{"poster":"ORElTirador","date":"2015-07-30T00:10:58.468+0000","title":"Actualmente, que tipo de daño está más favorecido, ¿AP o AD?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Ustedes que piensan, el Da&ntilde;o F&iacute;sico hoy en d&iacute;a es &quot;superior&quot; al Da&ntilde;o M&aacute;gico o al rev&eacute;s. Con superior no me refiero a que uno sea mejor que el otro, quiero decir si alguno tiene ventaja frente a otro o es m&aacute;s rentable builearse AP o AD.","replies":[{"poster":"TDT Vae Victus","date":"2015-07-30T00:55:56.607+0000","up_votes":2,"down_votes":1,"body":"El Ad está favorecido más que los ítems Ap, ya que si te das cuenta el AD hace escalar el daño de tus habilidades (en caso de que escalen con daño físico) y el daño de tus ataques básicos, sin embargo el Ap solo hace que escalen el daño de tus habilidades, no sé si me habrás entendido.","replies":[{"poster":"Revolución","date":"2015-07-30T01:08:21.247+0000","up_votes":1,"down_votes":1,"body":"Item de máximo AD: 80.\nItem de máximo AP: 120.\n\nLos escalados de las habilidades dan un daño mucho más certero y fuerte que los ataques básicos (por certero me refiero a tomar el impacto crítico como una probabilidad).\nHay objetos y maestrías que dan AP o daño mágico a los ataques básicos.\nHabilidades que se basan en ataques básicos.\nHay habilidades de daño físico que escalan en AP y de daño mágico que escalan en AD.\n\nEn resumen, no hay ningún tipo de ruta específica que determine que pickear campeones con daño orientado a físico a mágico, armarse AP o AD asegure una ventaja en particular, en ese sentido hay un balance. En todo caso hay cosas que son más bien circunstanciales, si te queda last pick mid (milagrosamente) y ves que hay Rammus y Malphite en el equipo contrario, que tu top es Fiora y tu jg es Udyr, fijate si es buena idea pickear Yasuo tal vez.","replies":[]}]},{"poster":"Equier","date":"2015-07-30T01:18:10.161+0000","up_votes":1,"down_votes":0,"body":"El AD y el Dps En AP.\nEl meta tanque favorece el AD ya que éste es mas capaz de matar a un tanque. Han escalado muchos los ADcarrys con capacidad de matar estos tanques, Vayne, Kog Maw o los que ofrecen utilidad al team como Sivir o Ashe.\n\nEn cuanto a los AP, el burst sirve cada vez menos, Le Blanc desaparece del God Tier, ahora se ve Azir, Cassiopeia, Viktor. Con un Liandry y DPS tienen las de ganar contra un tanque. O el caso de Ahri con true damage y Elise con el buff que le vino genial, y su daño con porcentaje de vida máxima y porcentaje de vida perdida. \n\nhttp://www.nerfplz.com/2015/07/2015-champion-tier-list-solo-queue_25.html","replies":[]},{"poster":"Revolución","date":"2015-07-30T00:53:51.179+0000","up_votes":1,"down_votes":0,"body":"Primero que nada no necesariamente AP o AD significa daño mágico o físico respectivamente, hay varias excepciones. Honestamente no creo que haya algún tipo de daño que rinda más en este momento o en ninguno particularmente, hay mucha diversidad de daño en todos los roles y son otras cosas las que hacen una verdadera diferencia.\n\nRespondiendo como llorón de soloQ te diría \"el daño verdadero, por eso Vayne se pickea 8 de 10 partidas\", pero todo contrarrestable.","replies":[]},{"poster":"Borriic II","date":"2015-07-30T01:10:01.055+0000","up_votes":1,"down_votes":1,"body":"el AD es ridiculamente muy superior piensalo\n- puedes sacar criticos, el AP no\n-el AP tiene un item que lo aumenta un 35%, el AD un item que aumenta los criticos un 50%\n-tanto el AP como el AD se benefician de la reduccion de cd en un 40% pero solo el AD se beneficia de poder lanzar hasta 2.5 ataques por segundo\n-Para asegurar objetivos el AD suele ser mas eficiente (torres, inhibidores)\n-Para castigar a tankes de mucha vida el AP tiene un objeto que causa un minusculo porcentaje de la vida en un lapso de tiempo, el AD un objeto que causa una gran cantidad de la vida por cada golpe (que pueden ser hasta 2.5 x segundo)\n-a la hora del burst los veo bastante parejos\npor lo tanto el AD sigue siendo superior :)","replies":[]},{"poster":"Naísu","date":"2015-07-30T00:20:44.456+0000","up_votes":1,"down_votes":1,"body":"creo que el ap por el meta de tanks pero no estoy seguro","replies":[]}]}