{"poster":"DarkXentinel01","date":"2018-06-03T15:56:08.256+0000","title":"Como puedo subir de honor?","subforum":"Nuevos jugadores","up_votes":4,"down_votes":1,"body":"bueno como ya vieron en el titulo me gustar&iacute;a subir de honor ya que me reportaron por lenguaje ofensivo, yo creo que no era para tanto solo me enoje como cualquier persona y no es justo todos tenemos alguna mala partida y que reporten por cosas asi creo que no es justo bueno la cosa esque baje a deshonor ahora no puedo subir no me importa por el honor sino que no me dejara jugar clash ni jugar en el pbe  se que lo que hice esta mal pero quiero areglarlo de una manerabueno eso gracias{{champion:115}}","replies":[{"poster":"DarkXentinel01","date":"2018-06-09T17:26:04.316+0000","up_votes":1,"down_votes":0,"body":"ok  muchas gracias por los consejos ahora jugare se sup eh intentare no hablar solo tratare de jugar mi partida y nada mas","replies":[{"poster":"Waninoko Main","date":"2018-06-11T01:05:15.702+0000","up_votes":1,"down_votes":0,"body":"te sugiero poner el chat en tamaño 0 para no leer a los malos jugadores que andan insultando. Ánimo y buena suerte","replies":[]}]},{"poster":"SG naiko ","date":"2018-06-03T23:00:39.389+0000","up_votes":1,"down_votes":0,"body":"1: No flamees\n2: Ve supp y haz peel carry\n3: Ez honor","replies":[]},{"poster":"Rick Silence","date":"2018-06-03T16:50:14.258+0000","up_votes":1,"down_votes":0,"body":"La manera más rápida? Jugá con una cuenta smurf :v\nY en cuanto a subir, es sencillo. No flamear, ser positivo, no hablar mucho durante la partida, recibir honor de compañeros no premades y dar honor. Jugar así y tener paciencia, porque demora. :3\nY creo que la mejor manera de ganar honor de tus aliados es jugar bien de supp y salvarle la vida a tus aliados un par de veces :3","replies":[]},{"poster":"Tea with Tibbers","date":"2018-06-03T16:25:36.862+0000","up_votes":1,"down_votes":0,"body":"Da honor a tus compañeros, esto aunque no lo creas sube tu honor.\nNo hables por chat, solo di \"wp\" cuando hagan buenas jugadas, \"mb\" cuando te equivoques y no respondas a provocaciones\ntodos nos frustramos aveces, pero insultar a quien te insulta no mejora nada, mutealo y reportalo al final, no respondas\nCrea un buen ambiente en el equipo; si eres mid y no necesitas mana dile al jg q se lo quede, rota cuando no tengas nada q hacer y ayuda.\nSe un buen compañero, eso motivara a la gente a q te de honor al final.\nSi alguien hace una buena play dile q le daras honor (aunq la haya cagado toda la partida), el lo recordara y quizas te de honor.\nSon cosas simples pero de seguro te hara salir del honor hell.\nPD quita el chat y no hables con nadie","replies":[]},{"poster":"SuperL0gic0","date":"2018-06-03T16:21:17.473+0000","up_votes":1,"down_votes":1,"body":"Juga suport. Hacelo bien y no molestes a la gente que quiere divertirse =S","replies":[]}]}