{"poster":"predator lee ","date":"2018-10-13T23:46:55.171+0000","title":"Xq riot ? Xq dejas jugar clasificatoria a esta gente ?","subforum":"Charlas Generales","up_votes":3,"down_votes":3,"body":"Hola esto es simple, vengo jugando hace rato muchos a&ntilde;os... Y estoy cansado y ya tengo que tomar medicamentos de los nervios...\r\nComo puede ser que entr&oacute; en ranked en plena partida les pido que no me gankeen y que no necesito ayuda .... A lo cual les pido xfavor si mueren 2 veces se queden bajo torre, a lo cual me contestan as&iacute; que bajaste de oro 2 a oro 3 por los mancos ? Bueno TE VAMOS A AYUDAR A BAJAR A HIERRO. Y evidentemente me trolliaron la partida y hace hace muchas partidas seguidas. \r\nComo puede uno jugar un juego que entra ya la gente con ganas de perder ? Solamente entran a trolliar y se van xq no les importa en absoluto el juego competitivo.","replies":[{"poster":"Tortuguita","date":"2018-10-14T00:12:13.317+0000","up_votes":3,"down_votes":0,"body":"Simplemente no des consejos. La gente de las es demasiado soberbia y a la primera que les hablas pueden tener la reacción mas errática posible, son como una caja de explosivos.\n\nSimplemente juega tu linea y listo, a la larga ya no los veras...","replies":[]},{"poster":"Baron Blackwolf","date":"2018-10-14T04:41:22.919+0000","up_votes":1,"down_votes":0,"body":"Tan acostumbrado al infierno estoy?\n#:(","replies":[]},{"poster":"ToraYasashi","date":"2018-10-14T03:53:53.781+0000","up_votes":1,"down_votes":0,"body":"tomate un té de tilo antes de jugar o fumate un dedo de Ivern que se yo.. {{champion:427}}","replies":[]},{"poster":"VikingoATR","date":"2018-10-14T02:34:30.698+0000","up_votes":1,"down_votes":0,"body":"desistalalo deja pasar un tiempo y cuando t sientas mejor si qres volves","replies":[]},{"poster":"AlanJG","date":"2018-10-14T02:25:16.553+0000","up_votes":1,"down_votes":0,"body":"Creeria que deberías desinstalar el juego, que estes obligado a tomar medicamentos para los nervios es demasiado....es por tu salud","replies":[]}]}