{"poster":"INT Loken","date":"2018-02-24T13:17:16.908+0000","title":"Überreagieren des Bansystems","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":4,"body":"Also...\r\nIch hatte heuten den 24.02.2018 ein Spiel mit 3 Freunden, welches wir verloren haben. Wir hatten die ganze Zeit viel Spa&szlig;, da wir bist zum Lategame alle permanent geoneshottet haben. Der gegnerische Midlaner ({{champion:10}} ) hat im Chat permanent rumgeheult. Sie ist quasi jeden beleidigt, hat verlangt, dass man den Olaf des Gegnerteams reporten soll, da er nach 10 Minuten bis ungef&auml;hr Minute 40 AFK war. Die Gegnerische Vayne war dann aber auf stark, die dann auch das Spiel gecarryed hat und dadurch kam Olaf auch wieder. &Uuml;ber unsere ganzen lustigen Spielmomente haben die sich nat&uuml;rlich auch aufgeregt, was auch witzig war. Das Problem nun ist, dass ich nat&uuml;rlich auch was geschrieben habe, aber auf keinen Fall war das Ernst gemeint. Das war der Chat:\r\n\r\nSpiel 1\r\nINT Loken: xDD\r\nINT Loken: your having fun?\r\nINT Loken: :)\r\nINT Loken: report ezreal feed\r\nINT Loken: and flame\r\nINT Loken: geh fott\r\nINT Loken: EZ\r\nINT Loken: DUI FAGGOT\r\nINT Loken: i carry\r\nINT Loken: XDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\r\nINT Loken: it is\r\nINT Loken: faggot\r\nINT Loken: 102% wskilled\r\nINT Loken: XDDDDDDDDDDDDDD\r\nINT Loken: For?\r\nINT Loken: Cry more\r\nINT Loken: youre already crying\r\nINT Loken: no probleme\r\nINT Loken: hartz IV\r\nINT Loken: pisser\r\nINT Loken: report ezreal\r\n\r\nNat&uuml;rlich ist das auch nicht sehr nett, aber ich sehe darin keinen Grund meinen Account deshalb sofort 14 Tage lang zu bannen. Mit einer Chatsperre f&uuml;r beispielweise 20 Spiele oder so zu bekommen f&auml;nde ich vollkommen legitim aber durch dieses System von Riot wurde ich von vielleicht 4 Spielern gemeldet und das System hat mich dann gebannt. Ich verstehe einfach nicht, wie viele Leute teilweise in Spielen Leute beleidigen und keine Art von Strafe bekommen. Aber wegen so ein paar Sachen mich so einzuschr&auml;nken halte ich f&uuml;r ein wenig &uuml;bertrieben. Nat&uuml;rlich werde ich auch weiterspielen, nur die Angst vor einem System dass &uuml;berreagiert, wenn man nur genug von Leuten gemeldet wird, macht es halt irgendwie keinen Sinn mehr f&uuml;r mich. Vor allem f&uuml;r das Geld, was ich investiert habe ist es auch schlecht. Ich akzeptiere eine Strafe zu 100%, aber das ist einfach zu viel f&uuml;r so eine Kleinigkeit. W&uuml;rde mich &uuml;ber Antworten oder Meinungen freuen.\r\n\r\nLG liebe Community.   {{sticker:slayer-jinx-catface}}","replies":[{"poster":"legofreak1","date":"2018-02-24T13:26:27.959+0000","up_votes":5,"down_votes":0,"body":"Das Bansystem kennt bei homophoben Beleidigungen keine Gnade und verteilt dafür auch direkt 14 Tage Bans ohne vorhergehende Chatsperren. Ein solches Verhalten ist in lol nicht erwünscht. Jedes weitere Fehlverhalten deinerseits kann nun zu einem permanenten Ban ohne weitere Warnung führen, du solltest also in Zukunft genau darauf achten, was du im Chat schreibst.","replies":[]},{"poster":"Time2Whine","date":"2018-02-26T08:55:38.641+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=INT Loken,realm=EUW,application-id=KYnfKGf0,discussion-id=xsilVEcH,comment-id=,timestamp=2018-02-24T13:17:16.908+0000)\n>\n>Das Problem nun ist, dass ich natürlich auch was geschrieben habe, aber auf keinen Fall war das Ernst gemeint.\n\nDas können alle behaupten die gebannt wurden. Was meinst du was hier los wäre wenn alle toxischen SPieler sowas sagen und daraufhin entbannt werden? Das würde das gesamte Strafsystem sinnlos machen, also solltest du zukünftig sowas unterlassen. Keiner kann in deinen Kopf sehen und wenn jemand fremdes, der dich nicht kennt, sowas liest wird er niemals Ironie herauslesen. Wobei sowas spaßig zu meinen ist schon ziemlich weltfremd.\n\n> Spiel 1\n> INT Loken: report ezreal feed\n> INT Loken: and flame\n> INT Loken: DUI FAGGOT\n> INT Loken: faggot\n> INT Loken: pisser\n> INT Loken: report ezreal\n\nReport Aufrufe + Beleidigung + Homophobische Äußerung. Bei Homophobie kennt Riot keine Rücksicht und das ist auch gut so, weil solche Beleidigungen unterste Schiene sind. Sowas schreibt man nicht, weder aus Spaß und vor allem nicht im Ernst. Alleine schon solche Beleidigungen im Allchat als BM ist das Letzte. Da hast du oder ihr euch anscheinend ganz groß und stark gefühlt, dass ihr fremden Leuten eins reinwürgen konntet.\n\n> INT Loken: For?\n\nHier scheint es klar zu werden, dass du dir absolut nicht bewusst ist was das Wort Faggot bedeutet und hier irgendwelche Sachen aus dem Internet oder Freundeskreis oder sonst wo nachplapperst. Daher ist die Bestrafung absolut richtig damit du deine Lektion darüber lernst und nicht alles blind nachplapperst\n\n> Natürlich ist das auch nicht sehr nett, aber ich sehe darin keinen Grund meinen Account deshalb sofort 14 Tage lang zu bannen. \n\nNicht sehr nett? Deine Beleidigungen sind absolut widerwärtig, sowas geht gar nicht. Die Strafe ist absolut richtig!\n\n>Mit einer Chatsperre für beispielweise 20 Spiele oder so zu bekommen fände ich vollkommen legitim aber durch dieses System von Riot wurde ich von vielleicht 4 Spielern gemeldet und das System hat mich dann gebannt. \n\nEs ist vollkommen egal wie viele Spieler dich reporten (Das dieses Denken immernoch existiert macht mich echt traurig). Sobald dich ein Spieler reportet durchsucht das System deinen Chat nach Beleidigungen und sobald es fündig wird erhälst du einen entsprechende Strafe. Dafür ein ist ein Report ausreichend. \n\n> Ich verstehe einfach nicht, wie viele Leute teilweise in Spielen Leute beleidigen und keine Art von Strafe bekommen. \n\nDas weißt du woher? Weil du keine Rückmeldungen für deine bekommst? Diese Meldungen bekommt man nur noch ganz selten. In dem Bereich ist RIot leider nicht sehr transparent. Jedoch heißt es nicht, dass du beleidigen darfst weil es andere tun. Sowas ist kein Freifahrtschein.\n\n>Aber wegen so ein paar Sachen mich so einzuschränken halte ich für ein wenig übertrieben. \n\nNein, es ist immernoch absolut berechtigt.\n\n>Natürlich werde ich auch weiterspielen, nur die Angst vor einem System dass überreagiert, wenn man nur genug von Leuten gemeldet wird, macht es halt irgendwie keinen Sinn mehr für mich. Vor allem für das Geld, was ich investiert habe ist es auch schlecht. \n\nSolange du dich vernünftig benimmst wird auch nichts passieren. Du kannst es mit dem echten Leben gut vergleichen, denn wenn jemand von 9 Leuten angezeigt wird einen Einbruch begangen zu haben wird das geprüft, aber wenn der Beschuldigte nichts gemacht hat wird die Anzeige fallen gelassen. Genauso ist es mit dem Bestrafungssystem auch. Wenn dich jemand reportet, du aber nichts strafbares getan hast, wird auch nichts passieren.\nLass dir aber gesagt sein, dass eine negative Äußerung wie \"stfu\", \"noob\" ausreichen kann und den Permabann auszulösen. Daher solltest du dich die nächste lange Zeit absolut korrekt verhalten und nur positives, konstruktives in den Chat schreiben.\n\n>Ich akzeptiere eine Strafe zu 100%, aber das ist einfach zu viel für so eine Kleinigkeit. Würde mich über Antworten oder Meinungen freuen.\n\nEine Strafe zu akzeptieren, diese aber mit Forderungen zu verknüpfen lässt das Ganze ziemlich unglaubwürdig wirken. Entweder du akzeptierst die Strafe in vollem Maße, oder gar nicht. Deinen Äußerungen aber als Kleinigkeit anzusehen zeigt noch einmal dass du nicht verstanden hast worum es geht und was du da eigentlich von dir gegeben hast. \nLern deine Lektion und gehe vernünftig mit deinen Mitmenschen um, ansonsten lesen wir hier bald von deinem Permabann wegen weiteren Kleinigkeiten.\n\nWie ist deine Meinung dazu?","replies":[]},{"poster":"Shiny Absol","date":"2018-02-24T22:09:31.950+0000","up_votes":4,"down_votes":0,"body":"der chat bot erkennt nicht, ob du es sarkastisch oder ernst meinst. selber schuld und gerechtfertigt. als ich mal gegen eine kata auf meinem smurf gespielt habe, war es so ähnlich. sie hat halt schlecht gespielt und dann kam im allchat immer sowas wie \"fucking noob\", \"Anivia stop your scripts your fgt\". Sie hat das game gewonnen, aber die lane verloren und dann kam \"ez du noob hahaha joke.\" nach meinem report wurde sie bestraft, obwohl sie meinte es wäre angeblich nur spaß gewesen x) glaube, wenn du dieser fremden person persönlich gegenüber stehst, würdest du sie auch aus spaß noob oder schwuchtel nennen? hat etwas mit respekt zu tun.","replies":[]},{"poster":"Wolf Husky","date":"2018-02-24T13:35:55.490+0000","up_votes":3,"down_votes":0,"body":"Das ist disrespect Af, natürlich ist das gerechtfertigt...","replies":[]},{"poster":"Arammus","date":"2018-02-24T20:25:48.229+0000","up_votes":2,"down_votes":0,"body":"wers jetzt der pisser? \nalleine das fgt rechtfertigt es","replies":[]},{"poster":"Nordwolf87","date":"2018-02-24T19:08:16.629+0000","up_votes":2,"down_votes":0,"body":"Vieeleicht lernt ihr ganzen pappnasen mal endlich dass fagot/fag/fgt zu deutsch \"schwuchtel\" eine beleidigung ist und lasst diesen schwulenfeindlichen scheiß? Und komm jetzt nicht mit \"normalen\" wort! Wenn ich im RL zu einem Freund \"Schwuchtel\" sag kann ich das...wenn ichs zu nem fremden sag krieg ich wahrscheinlich ein problem...","replies":[]},{"poster":"Mrs Pαste","date":"2018-02-24T14:41:47.496+0000","up_votes":2,"down_votes":1,"body":"Hey\n\nIch würde gestern auch gebannt. Jedoch hat die Vayne in meinem Team böse Dinge wie kys geschrieben... Ich habe daraufhin im /all geschrieben: Report vayne flaming and saying \"Suicide and Kill ur Family 1st, kys kys kys \". Alle sagen mir, dass ich nicht entbannt werde, aber warum? XD\n\nDein ban ist denke ich berechtigt, auch wenn ein Chat District evtl gereicht hätte","replies":[{"poster":"Sirrkas","date":"2018-02-24T17:52:21.665+0000","up_votes":2,"down_votes":0,"body":"Ich dachte ich hätte dir schon geschrieben, dass der Support durchaus Strafen zurücknimmt, wenn man wegen des Zitierens solcher Aussagen bestraft wurde. Du kannst aber eine andere Strafe erhalten oder deine behalten, wenn dein Chat noch andere toxische Sachen enthalten hat, als nur das Zitat.","replies":[]}]},{"poster":"Sirrkas","date":"2018-02-24T17:50:57.219+0000","up_votes":2,"down_votes":0,"body":">Mit einer Chatsperre für beispielweise 20 Spiele oder so zu bekommen fände ich vollkommen legitim aber durch dieses System von Riot wurde ich von vielleicht 4 Spielern gemeldet und das System hat mich dann gebannt. \n\nDu hast den 14 Tagebann erhalten, weil du \"Faggot\" benutzt hast. Das ist eine Beleidigung mit schwulenfeindlichemHintergrund. So etwas wird von Riot nicht toleriert. Da ist es auch egal, ob du 1, 4 oder 9 Reports erhalten hast.\n\n>Ich verstehe einfach nicht, wie viele Leute teilweise in Spielen Leute beleidigen und keine Art von Strafe bekommen. Aber wegen so ein paar Sachen mich so einzuschränken halte ich für ein wenig übertrieben. Natürlich werde ich auch weiterspielen, nur die Angst vor einem System dass überreagiert, wenn man nur genug von Leuten gemeldet wird, macht es halt irgendwie keinen Sinn mehr für mich. \n\nKeine Angst. Wenn du nichts falsch machst, wirst du nicht bestraft. Zumindest habe ich noch nie gesehen, dass jemand hier mit einer Strafe aufkreuzte, deren Chatlogs nur aus etwas wie \"gg\" \"gl hf\" \"we got this\" \"lets focus on winning\" \"gj\" \"ty\" bestanden haben. \n\nDass Leute für Beleidigungen durchaus bestraft werden, sollte mit deiner Strafe klar werden. Das \"Faggot\" habe ich ja schon erläutert. Aber auch andere Zeilen deines Chatlogs können Strafen nach sich ziehen. Der war allgemein nicht sehr sportlich. Dabei ist es auch egal, ob du es nicht so gemeint hast. Du würdest es sicher nicht in Ordnung finden, wenn jeder Flamer, der bestraft wird, nur schreiben muss, er hätte das als Scherz gemeint, damit die Strafe aufgehoben wird.","replies":[]},{"poster":"Lunnaris01","date":"2018-02-27T22:37:31.873+0000","up_votes":1,"down_votes":0,"body":"Also wenn der Ezreal in deinem Team und ein Freund von dir war, finde ich das auch überzogen und du könntest dich ggf. beim Support melden deswegen, aber für die sicher auch nicht leicht einzusehen.\n\nAnsonsten für die Zukunft merken, dass du deine Freunde vielleicht lieber als Affen oder sowas bezeichnest (Außer das ist jetzt rassistisch, weil schwarze mal als Affen bezeichnet wurden? hmmm..), anstatt gleich den faggot rauszuhauen. Wenn es nicht dein Premade war, dann auf jeden fall so gerechtfertigt..","replies":[]},{"poster":"clair de lune289","date":"2018-02-24T16:44:53.832+0000","up_votes":1,"down_votes":0,"body":"finde den 14 Tagebann hier mal wieder zu milde. Sei einfach froh das es nur ein 14 Tagebann ist und kein Perma.","replies":[]},{"poster":"Abasin","date":"2018-02-24T14:47:23.169+0000","up_votes":1,"down_votes":0,"body":"> INT Loken: DUI FAGGOT\nINT Loken: it is\nINT Loken: faggot\nINT Loken: hartz IV\nINT Loken: pisser\n\nReicht schon. Kappa.{{sticker:zombie-brand-facepalm}} \n\nIch wundere mich echt, dass Du da noch am Bannsystem zweifelst, was offenbar sehr gut funktioniert. Wenn auch nicht in Deinem Sinne.","replies":[]},{"poster":"SchaebigerLump","date":"2018-02-24T13:27:09.941+0000","up_votes":1,"down_votes":0,"body":"Glaube ein Perma Ban würde dir mal gut tun damit du lernst wie man sich benimmt. 100% gerechtfertigt und noch zu wenig meiner Meinung nach.","replies":[]}]}