{"poster":"LucielX","date":"2016-01-06T09:20:53.892+0000","title":"Aplicación de foros para celulares (Leer por favor)","subforum":"Problemas Técnicos","up_votes":15,"down_votes":1,"body":"Den positivo para que mas gente pueda ver esto! Gracias\n\nBueno, soy una de las cuantas personas que entran al foro mediante el celular o tabletas, y que si bien la pagina est&aacute; tambi&eacute;n en modo &quot;Para m&oacute;viles&quot; no es un sistema comodo y f&aacute;cil para usar desde un celular, tambi&eacute;n decir que va lento, y tarda en cargarse el foro desde el celular, y no es que mi internet o celular sea malo, quiero dejar la idea de que una aplicaci&oacute;n del foro ( Una app ) ser&iacute;a muy &uacute;til, c&oacute;modo y no tendr&iacute;amos opciones limitadas","replies":[{"poster":"Shappaw","date":"2016-01-06T09:47:06.117+0000","up_votes":3,"down_votes":1,"body":"Siempre pensé que podría haber una app estilo Foro de League of Legends. Resultaría muy cómodo, y más para aquellos, como yo, que a la noche están acostado por dormir, le pegan una leía al foro. Bien ahí por proponer la idea!","replies":[]},{"poster":"Anniequiladora","date":"2016-01-07T06:26:10.673+0000","up_votes":1,"down_votes":0,"body":"{{champion:11}}  + {{item:3211}} + {{item:3154}} = {{champion:24}}","replies":[]},{"poster":"Lev","date":"2016-01-07T00:48:54.416+0000","up_votes":1,"down_votes":0,"body":"Me gusta que la opción \"pa k kieres saber eso jaja saludos\" sea la más votada xD.\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Adheliøs","date":"2016-01-06T21:21:54.302+0000","up_votes":1,"down_votes":0,"body":"Lo pense la primera vez que entre al foro, estaría bueno que lo pusieran en tapatalk, es super como de leer foros alli, saludos :P","replies":[]},{"poster":"A simple Raryu","date":"2016-01-06T15:10:07.938+0000","up_votes":1,"down_votes":0,"body":"Yo creo que esa es una idea muy buena, pero ahora que Riot la haga, ya que segun ellos estan ocupados.\nMe parece exelente tu idea, pero dificil de realizarse\n\n> **No Tengo Firma pero se ve Bonito**","replies":[]}]}