{"poster":"Lecord","date":"2017-07-13T01:15:23.188+0000","title":"Servidor inestable,subidas de ping,demasiado lag.","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Bueno,&uacute;ltimamente hace unos 3-4 d&iacute;as empez&oacute; a andar mal nuevamente,el ping se mantiene a veces entre 30-40 o incluso 50,pero de la nada en ciertas ocasiones o momentos importantes dentro de la partida el ping sube a 400-600 o incluso 1000.\r\nPodemos ir ganando,a veces los de mi equipo se lagean y terminamos perdiendo. Al final esto nos afecta a todos.\r\n\r\nEn las partidas que he jugado a mi equipo le pasa lo mismo,les sube el ping de la nada,y algunos con desconexiones. As&iacute; que no soy el &uacute;nico,mi Internet esta bien,puedo jugar otros videojuegos online sin problemas,ver videos en 1080p sin problemas,en conclusi&oacute;n esto pasa solo en el LoL y no se ha dado una soluci&oacute;n\r\n\r\nAnteriormente se han dado problemas as&iacute; pero por 1 d&iacute;a y ya despu&eacute;s pasa,pero ahora es constante y casi imposible jugar,he tenido problemas con la selecci&oacute;n de campe&oacute;n y al aceptar una partida se cancela dando error,he intentado de todo y mi conexi&oacute;n no tiene ning&uacute;n problema,entonces siento que el problema es de los servidores de riot.\r\n\r\nPienso que deber&iacute;an preocuparse mas por su infraestructura y proporcionar un servicio de calidad,debido a la popularidad del juego y todo el dinero que puede llegar a invertir la gente y las ganancias que obtienen,ya que a veces los servidores dan asco con lo mal que van.\r\n\r\nSupongo que reclamar no va a servir,pero no pierdo nada.","replies":[{"poster":"Rolandfc","date":"2017-07-13T04:02:21.279+0000","up_votes":1,"down_votes":0,"body":"Lo  raro  es  que  funcione  bien  el  server  ,  siempre  funciona  mal  y  seguira  asi  por  mucho  tiempo  hasta  que  Riot  imbierta  en  calidad  para  sus  usuarios  ,  pero  eso  es  mucho  trabajo  .","replies":[]},{"poster":"KSM Masi","date":"2017-07-13T01:22:00.214+0000","up_votes":1,"down_votes":0,"body":"Por que a mi no me pasa ? Digo si fueran los servidores les pasaría a todos o no ?","replies":[{"poster":"Lecord","date":"2017-07-13T01:52:52.497+0000","up_votes":1,"down_votes":0,"body":"Digo que son los servidores porque no soy solo yo,en casi todas las partidas que me han tocado la gente tiene lag,la mayoría,pero de que hay un problema con los servidores los hay,existe poca probabilidad de que el lag de tanta gente sea culpa de su ISP,seria demasiada coincidencia,no?\n\nAunque hay exepciones,como la tuya pero se sabe que hay un problema,hay muchos reclamos sobre esto.","replies":[{"poster":"KSM Masi","date":"2017-07-13T02:19:26.004+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lecord,realm=LAS,application-id=v7qsfXsE,discussion-id=ApJGm91N,comment-id=00000000,timestamp=2017-07-13T01:52:52.497+0000)\n>\n> Digo que son los servidores porque no soy solo yo,en casi todas las partidas que me han tocado la gente tiene lag,la mayoría,pero de que hay un problema con los servidores los hay,existe poca probabilidad de que el lag de tanta gente sea culpa de su ISP,seria demasiada coincidencia,no?\n> \n> Aunque hay exepciones,como la tuya pero se sabe que hay un problema,hay muchos reclamos sobre esto.\n\nIgual sigo insistiendo que no es el server , debe ser problemas con las conexiones de ciertos países . Repito que si es el server nos caemos todos :v . En fin solución ? Ticket a soporte u esperar.","replies":[{"poster":"Phaedra","date":"2017-07-13T03:27:55.353+0000","up_votes":1,"down_votes":0,"body":"Es problema del server. Afecta a ciertas personas, pero es del server. Cada vez q sale un parche nuevo aparecen miles de errores aleatorios, q afectan a la minoria d ela comunidad. Este parche, por primera vez, me toco a mi. No puedo jugar porq despues de seleccion de elegir campeon, al momento de banear se me tilda el game. Jamas me paso, pero casualmente se pone el parche y sucede. Casualidad? Lo dudo. EN vez de cuestionar a los usuarios y defender a riot, deberias ponerte del lado del debil, porq el dia que te toque a vos vas a querer q te apoyen tambien. Saludos","replies":[]}]},{"poster":"Vaendrys","date":"2017-07-13T03:04:18.790+0000","up_votes":1,"down_votes":0,"body":"Si hay muchos tambien puede ser un problema de isp.","replies":[]}]}]}]}