{"poster":"deAbreHoyos","date":"2018-11-16T14:15:19.274+0000","title":"Las Tabi de Nija y Akali","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":0,"body":"Tengo una duda. Mucho del da&ntilde;o de akali proviene de su ataque basico potenciado, la gracia del campeon es poder aplicar este mismo repetidas veces. Ahora, &iquest;&iquest;&iquest;resulta rentable comprar Tabi de Ninja para mitigar este da&ntilde;o en Early??? o es mejor comprar unicamente resistencia magica y rezar???","replies":[{"poster":"POD2 Midnight","date":"2018-11-16T14:53:24.125+0000","up_votes":2,"down_votes":0,"body":"La Pasiva de Akali mete Daño Mágico, por lo que la reduces más con Mercurio que con Tabis. SIn embargo, algunas se hacen algo de AD, tipo {{item:3095}} {{item:3147}}, por lo que ahí conviene tabi. Recuerda:\n\n{{champion:84}} \nPasiva: AP\nQ -> AP\nW -> ---\nE -> AD\nR -> 1ero AD, 2do AP\n\nSaludos ;)","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-11-16T14:20:51.417+0000","up_votes":2,"down_votes":0,"body":"Las pasiva de tabi ninja no reduce el daño de efectos de impacto (rey arruinado, Q de nasus, Q de draven, W de tf, etc)","replies":[{"poster":"Bienzahar","date":"2018-11-16T15:19:31.428+0000","up_votes":1,"down_votes":0,"body":"Pero si reduce la e de teemo D:","replies":[{"poster":"Hnk Kenshiro","date":"2018-11-16T15:46:08.439+0000","up_votes":1,"down_votes":0,"body":"¿Tendrás algún videito de eso?","replies":[{"poster":"Bienzahar","date":"2018-11-16T20:01:57.456+0000","up_votes":1,"down_votes":0,"body":"No, no tengo.\nDe hecho fue una pregunta que me repondio un rioter hace rato ya.","replies":[]}]}]},{"poster":"Cuchufleitor","date":"2018-11-16T16:50:54.436+0000","up_votes":1,"down_votes":0,"body":"La Q de Nasus cuenta como efecto de impacto? siempre crei que simplemente añadia daño a tu ataque, entonces se puede duplicar con guinsoo?","replies":[{"poster":"Hnk Kenshiro","date":"2018-11-16T16:59:42.320+0000","up_votes":1,"down_votes":0,"body":"No, guinso no hace que apliques un efecto de impacto dos veces, te hace dar un segundo golpe unicamente aplica efectos de impacto.\n\nOsea, con nasus el golpe normal consumiria la Q, y el fantasma ya no tendria ese efecto de imacto.\n\nPor ejemplo, si tienes 3 cargas de la E de nami, tu golpe normal consumiria una y el fantasma consume la 2°, no es que apliques una misma carga dos veces.","replies":[{"poster":"Cuchufleitor","date":"2018-11-16T17:05:15.702+0000","up_votes":1,"down_votes":0,"body":"Ah no la tenia claro, gracias por la explicacion.","replies":[]}]}]}]},{"poster":"Hide on Manteca","date":"2018-11-16T15:01:48.991+0000","up_votes":1,"down_votes":0,"body":"como ya dijeron las tabi ninja no reducen el daño de efectos de impacto,  ademas las botas mercuriales dan la misma mr que el manto asi que no rinde comprárselas,yo te recomendaría que te rushees sorbahechizossi sos ad y doble manto si sos ap, estos los podes actualizar a las mercuriales y al banshe cuando se pueda","replies":[]}]}