{"poster":"ChefKochChris","date":"2015-10-03T20:04:52.702+0000","title":"MMR-Boosting","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":10,"body":"Gr&uuml;&szlig;e euch... \nIch habe letzte season plat 5 gespielt und hatte es dieses Jahr auf Plat 2 geschaftt... \nIch hatte extreme Internetprobleme in der letzten woche und spielte deswegen auf meinem Handy per Hotspot.\n\nNun zu meinem Anliegen.\nIch erhielt kurze Zeit sp&auml;ter eine Email, dass ich angeblich ELO Boosting betrieben haben soll und mir werden alle rewards genommen und\nich wurde f&uuml;r die Season 2015 einfach mal gesperrt.\nIch wandte mich an den Support und die meinten es w&uuml;rden eindeutige Beweise vorliegen...\nkann mir schlecht vorstellen dass ich von einem von denen gestalkt wurde , also l&auml;uft das ganze wohl automatisch\nder support l&auml;sst nicht mit sich reden und ich wei&szlig; nicht was ich noch machen soll.\nIch habe NICHT geboostet und werde gepeinigt wie ne sau\n\nhabt ihr noch irgendwelche Ideen was ich noch machen soll?\n\nIch hab echt paranoia nochmal ins ranked zu gehen jetzt, wenn das nochmal passiert werde ich dauerhaft gesperrt \ngrundlos...\nWas ich auch krass finde ist , dass mir keinerlei beweise vorgelegt werden und ich dem support auch angeboten habe s&auml;mtliche IPS mid denen ich drinnen war offenzulegen, alles wurde abgelehnt\n\nIch bin f&uuml;r jede Idee dankbar\n\nmit freundlichen Gr&uuml;&szlig;en \nChefKoch\n\nPS: bitte lasst die downvotes, ich würde euch auch nicht down voten nur weil ihr meine hilfe braucht\n\nhier zum beispiel ein paar leindensgenossen : \nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/ZoxEnntk-mmr-boosting\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/0q6fAW45-angebliches-mmr-boostingeloboosting\nhttp://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/gPIXnpwl-account-sperrung-wegen-boosting\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/6G5ZUxyc-mmr-boosting-sperre\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/2JeFxOZs-ich-wurde-gebannt-falscherweise-far-boosting-gebannt\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/96AOpK22-ich-brauche-ganz-dringend-hilfe-ich-wurde-zu-unrecht-wegen-elo-boostings-gesperrt\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/kMiodT4N-gebannt-hat-jemand-einen-rat\nes gibt mehr\n\n_**UPDATE :**_\n\nHatte ein neues Ticket verfasst und dem Support alles geschildert, sie sagen ich solle mich an das alte ticket wenden , an die \nfür die die sache schon gegessen war.\n{{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} ","replies":[{"poster":"Der Großmugister","date":"2015-10-04T12:10:17.302+0000","up_votes":4,"down_votes":0,"body":"Also nicht, dass es mich besonders berühren würde, aber wer nimmt sich hier eigentlich immer die Zeit, akribisch die Beiträge und Antworten bestimmter Leute down zu voten?^^ Meist schon wenige Minuten nachdem sie erstellt wurden, oder nehmen die Leute sich immer selbst den eigenen Upvote weg den man einem Beitrag automatisch gibt wenn man ihn erstellt?^^","replies":[{"poster":"Sirrkas","date":"2015-10-04T12:15:21.694+0000","up_votes":4,"down_votes":0,"body":"Hm, ich glaube wenn ich noch mal ein Ontopic  verfasse geb ich mir selbst einen Downvote um zu sehen ob es negativ wird.\n\nIch schätze aber mal einige haben wegen des Titels einen Downvote gegeben. Ist halt einer der typisch für \"wurde ungerecht bestraft\" ist. \n\nEdit: Oder du hast einen Hater.","replies":[{"poster":"ChefKochChris","date":"2015-10-04T13:45:17.930+0000","up_votes":3,"down_votes":3,"body":"die leute lesen es sich nicht durch , sie denken einfach nur : ach da heult wieder einer rum = downvote","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:46:22.087+0000","up_votes":5,"down_votes":1,"body":"Da!! schon wieder! :D Dieser Beitrag hatte nach etwa 30 Sekunden einen Downvote :D","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:47:11.955+0000","up_votes":4,"down_votes":1,"body":"Un meiner auch, Alter bist du fix :D","replies":[{"poster":"ChefKochChris","date":"2015-10-04T13:47:49.221+0000","up_votes":5,"down_votes":1,"body":"er stalkt uns","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:49:49.113+0000","up_votes":4,"down_votes":1,"body":"Ich hab mir wohl den Zorn des Downvote-Flashs zugezogen weil ich versucht habe dir zu helfen.^^","replies":[{"poster":"ChefKochChris","date":"2015-10-04T13:50:34.188+0000","up_votes":4,"down_votes":1,"body":"das kann gut sein, nimm dich in acht wenn du das nöchste mal vor die tür gehst ... he is watching you :P ich upvote dich , gegenseitig können wir uns vor ihm schützen :DD","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:51:18.631+0000","up_votes":3,"down_votes":1,"body":"Morgen hängt ein blaues v an meiner Haustür","replies":[{"poster":"ChefKochChris","date":"2015-10-04T13:52:05.145+0000","up_votes":4,"down_votes":1,"body":":DDD","replies":[]}]}]}]}]}]},{"poster":"ChefKochChris","date":"2015-10-04T13:47:22.929+0000","up_votes":3,"down_votes":1,"body":"ijemand hat mich auf den kicker :D","replies":[]}]}]}]},{"poster":"Eibert Rümmel","date":"2015-10-04T12:20:22.805+0000","up_votes":3,"down_votes":0,"body":"gute Frage. hab dich mal geupvoted, damit derjenige zumindest noch auf einen Smurph umloggen muss ;)","replies":[{"poster":"TheT0xicAvenger","date":"2015-10-04T18:45:47.805+0000","up_votes":3,"down_votes":2,"body":"Dito - ich verteil letzte Zeit schon grundsätzlich Upvotes um dem Trend entgegen zu wirken ;)","replies":[{"poster":"TheT0xicAvenger","date":"2015-10-05T08:57:26.127+0000","up_votes":2,"down_votes":1,"body":"Null ist doch schon mal ein Fortschritt. = )\n\nDas Witzige ist ja, dass beim Forenprofil nur Upvotes gezählt werden. Die Downvoterei is also in etwa so sinnvoll wie \"report X forTrollpick!!11!!!12!!!\" Aufrufe. ^^","replies":[{"poster":"eingew","date":"2015-10-05T09:28:58.660+0000","up_votes":2,"down_votes":0,"body":"Jain... ich denke schon, dass die Votes irgendwo ganz praktisch sind. Ich meine irgendwo sagt es ja schon aus, was am beliebtesten ist.\nNur die Gründe werden dabei halt nicht beachtet.","replies":[{"poster":"TheT0xicAvenger","date":"2015-10-05T10:58:21.174+0000","up_votes":1,"down_votes":0,"body":"Auch ich muss Jain antworten ;)\n\nIch würde viele Downvotes so einordnen, dass sich da ein Beitrag hinter versteckt, der - wohlwollend ausgedrückt - nicht unbedingt lesenswert ist. Das wäre dann ja auch durchaus sinnvoll = der Ja-Part des Jain\n\nAber offensichtlich lesen solche Beiträge hier im Forum umso mehr Leute und voten danach auch nochmal fleissig down. Man hat also eher einen Magneten, der bestimmte Forenuser anzieht. ;)\n\nMir als Neuling haben einige Fragen (und die entsprechenden Antworten) aus downgevoteten Threads übrigens sehr geholfen. Zum Glück hab ich mich da nicht von Downvotes vom Lesen abschrecken lassen. \n\nDie Downvoteanzahl hilft also oft nicht wirklich weiter und \"der Perma war ungerechtfertigt\"-Threads kann man auch ohne Downvotewut erkennen. Ich les auch mal einfach was nicht, was mich nicht interessiert, da muss ich nicht jedesmal runtervoten, weil es mich so sehr langweilt. But hey - thats just me ;)","replies":[]}]}]}]}]}]},{"poster":"Der Großmugister","date":"2015-10-04T07:26:35.522+0000","up_votes":4,"down_votes":2,"body":"Solltest du tatsächlich kein Boosting in Anspruch genommen haben, tust du mir echt Leid :(\n\nDarum habe ich mich mal ein wenig mit einem Account beschäftigt um heraus zu finden, wieso der Support überzeugt ist, jemand Anderes hätte auf Diesem gespielt.\nIch bin davon überzeugt, dass Accounts auf mehrere Ungereimtheiten getestet werden und wenn Mehrere auftauchen, wird der Fall als eindeutig eingestuft.\n\nEine der schwerwiegensten Abweichungen, ist der Wechsel der Summonerspells, ein Spieler hat Flash/Ghost entweder auf D oder F, ändert sich dies plötzlich, ist es fast sicher, dass Fremdeinfluss vorliegt.\n\nBei dir gibt es eine solche Abweichung, allerdings auf eine Art, die ich bisher nie gesehen habe, die aber in meinen Augen NICHT für Boosting spricht.\n\nDu scheinst beim Jungeln grundsätzlich Smite auf D zu legen, obwohl dort normalerweise dein Flash liegt. Diese Belegung hast du immer beim Jungeln, du hast aber nicht nur Junglespiele hintereinander und auch am selben Tag, immer wieder andere Positionen dazwischen, in denen Flash auf D liegt. Das spricht eindeutig dagegen, dass du geboosted wurdest, da hätte ja schon Jemand neben dir sitzen müssen, der immer schnell an den PC geht wenn du jungeln musst.\n\nDer, ich nenne ihn mal \"Boostingbuster\" wird aber nur Folgendes festgestellt haben:\n1. Der Spieler spielet plötzlich über eine andere IP\n2. Der Spieler hat Unregelmäßigkeiten in seinen Summoner Spells\n\nBei fast jedem Spieler wäre das ein eindeutiger Beweis, dein Wechsel von Flash und Smite beim Jungeln ist nämlich mehr als unüblich.\n\nVielleicht hast du eine Chance, wenn du den Wechsel der Spells erklärst, ich wünsche es dir zumindest.","replies":[{"poster":"ChefKochChris","date":"2015-10-04T09:04:27.416+0000","up_votes":3,"down_votes":2,"body":"Ich danke dir für dein verständnis und mühe , ich spiele jungle smite auf d weil ich öfter smite als flashen muss und die taste dann nicht so weit weg ist :(( \nIch weiss nicht was ich noch tun soll ... Dass ist alles so unfair \nIch habe bestimmt 400 ganes mit der summoner kombi flash f smite d ... Das mache ich IMMER im jungle ausnahmslos","replies":[{"poster":"Der Großmugister","date":"2015-10-04T09:24:11.563+0000","up_votes":3,"down_votes":1,"body":"Ich denke du hast eine Chance, wenn du den Support genau darauf hinweist, versuchs einfach mal","replies":[{"poster":"ChefKochChris","date":"2015-10-04T11:05:15.686+0000","up_votes":2,"down_votes":1,"body":"ich hab denen auch das mit den summoners geschrieben... danke dass du mich darauf hingewiesen hast, ich dachte bei der anzahl an spielen würde das nichts ausmachen","replies":[{"poster":"Der Großmugister","date":"2015-10-04T11:35:10.514+0000","up_votes":3,"down_votes":3,"body":"Ich gehe davon aus, dass da einfach ein Programm drüber läuf was nur die Positionen von Flash/Ghost nach Auffälligkeiten untersucht, wenn du sie drauf hinweist schaut vielleicht Jemand persönlich drüber und wenn es nur die beiden Dinge, also IP und Summonerspells waren die zum Bann geführt haben, wird es vielleicht zurückgenommen.","replies":[{"poster":"hshtagniemehrcdu","date":"2015-10-04T12:21:56.567+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=FzsXgunm,comment-id=00050001000000010000,timestamp=2015-10-04T11:35:10.514+0000)\n>\n> Ich gehe davon aus, dass da einfach ein Programm drüber läuf was nur die Positionen von Flash/Ghost nach Auffälligkeiten untersucht, wenn du sie drauf hinweist schaut vielleicht Jemand persönlich drüber und wenn es nur die beiden Dinge, also IP und Summonerspells waren die zum Bann geführt haben, wird es vielleicht zurückgenommen.\n\nGehst du wirklich davon aus, das Riot so dermaßen schlampig vorgeht?\n\nHier im Forum liest man immer wieder und fast nur von vertauschten Summunor-Spells;\nDas liegt aber vor allem daran, dass das eines der wenigen Dinge ist, welche man von der Matchhistory ablesen kann.\n\nEs gibt noch sehr viel mehr, was man als normaler User überhaupt nicht nachvollziehen kann.\nAnzahl der Klicks in einem Match, Bewegungsmuster, Zielgenauigkeit von Skillshots.\nDarüber habe ich grade mal 5 Sekunden nachgedacht, wenn man da ein bischen Zeit reinsteckt, wird man noch sehr viel mehr finden.\n\nSo brutal schlampig vorzugehen würde einerseits zu sehr viel mehr Threads führen.\nUnd zum anderen stünde es in krassem Gegensatz zur sonstigen Vorgehensweise bei z..b. Bans wegen schlechtem Verhalten.","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:13:38.446+0000","up_votes":2,"down_votes":0,"body":"Ich habe ja nicht behauptet, dass das die einzige Methode ist die angewendet wird, lediglich, dass im Bezug auf die Summoner Spells so vorgegangen wird.\nOder willst du mir sagen, dass sich da jedesmal jemand hinsetzt und per Hand die Spiele durchgeht?! o.O\neines von vielen Dnigen was überprüft wird, ist wohl die Lage der Summs, zusätzlich zu den Dnigen die du genannt hast und Anderen. Wenn bei genug Faktoren, Auffälligkeiten gefunden werden, gilt der Verdacht als bestätigt, so stelle ich mir das vor.\nWenn jetzt beim TE aber IP-Adresse und Summs wegfallen, weil er die Auffälligkeiten erklären kann, reicht es vielleicht nichtmehr aus.\n\nIch halte auch große Stücke auf Riot und halte sie für die beste Gaming-schmiede unserer Zeit, aber gerade bei diesem Thema desshlab davon auszugehen, Riot sei unfehlbar, halte ich für falsch und unfair dem TE gegenüber!","replies":[{"poster":"Patter91","date":"2015-10-04T13:16:55.212+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=FzsXgunm,comment-id=0005000100000001000000000000,timestamp=2015-10-04T13:13:38.446+0000)\n>\n> Wenn jetzt beim TE aber IP-Adresse wegfallen, weil er die Auffälligkeiten erklären kann\n\nZwei Worte: dynamische IP. Ich bezweifel ganz stark, dass der TE sich eine feste IP hat einrichten lassen.","replies":[{"poster":"Der Großmugister","date":"2015-10-04T13:20:08.612+0000","up_votes":2,"down_votes":0,"body":"Und selbst wenn nur ein Faktor wegfallen würde, könnte es helfen, ändert ja Nix an der Aussage an sich.","replies":[]},{"poster":"ChefKochChris","date":"2015-10-04T13:43:35.171+0000","up_votes":3,"down_votes":1,"body":"ich kenne mich mit internet protocol nicht wirklich aus , aber vielleicht macht es einen gravierenden unterschied ob man per LTE oder festem netz von zu hause aus drin ist... eine weiter auffälligkeit (ich wurde wegen negativen verhaltens gesperrt für einen Tag(ich weiß ich bin nicht stolz darauf)... ich konnte mich aber nach dem ban einloggen und als ich dann drinnen war wo der shop usw ist... war ich nicht mit dem pvp chat verbunden, jedoch als ich dann das fesnter des clients schloss... kam die email mit der mmr sperre direkt nach , ich weiß nicht ob dies auch ein auslöser sein könnte .... einloggversuch trotz ban\nauch bei www.whytismyip.de gab es deutliche unterschiede allein das aussehen der ips war anders aufgebaut","replies":[]}]}]}]}]}]},{"poster":"ChefKochChris","date":"2015-10-04T09:59:21.866+0000","up_votes":3,"down_votes":2,"body":"ich habe denen gestern nochmal geschrieben mit der ip meines handies usw bin mal gespannt was das gibt :((","replies":[]}]}]},{"poster":"ChefKochChris","date":"2015-10-04T09:02:04.458+0000","up_votes":3,"down_votes":2,"body":"Ich danke dir für dein verständnis und mühe , ich spiele jungle smite auf d weil ich öfter smite als flashen muss und die taste dann nicht so weit weg ist :(( \nIch weiss nicht was ich noch tun soll ... Dass ist alles so unfair","replies":[]}]},{"poster":"ChefKochChris","date":"2015-10-03T20:21:26.977+0000","up_votes":2,"down_votes":2,"body":"das habe ich gemacht... die weigern sich und meinen sie könnten daran eh nichts mehr ändern...","replies":[{"poster":"legofreak1","date":"2015-10-03T20:26:13.573+0000","up_votes":3,"down_votes":2,"body":"Dann ist sich der Support seiner Sache wohl sehr sicher. Du hast also gegen die Nutzungsbedingungen verstoßen und dann wird sich nichts ändern.","replies":[{"poster":"ChefKochChris","date":"2015-10-03T20:35:44.080+0000","up_votes":2,"down_votes":2,"body":"ich verstehs nicht, ich versteh nicht mal die logik daran , dass jemand dafür bezahlen sollte auf platin 2 zu kommen...","replies":[{"poster":"eingew","date":"2015-10-04T11:08:06.570+0000","up_votes":2,"down_votes":1,"body":"Naja, so ein Rang ist schon für einige eine Art Statussymbol. Und wenn man das nicht selbst erreichen kann, und genug Geld für unnützes Zeug flüssig hat, dann gibt man auch schon mal Geld für sowas aus.\n\nMit Logik hat das nicht viel zu tun. Eher mit Stolz.","replies":[{"poster":"ChefKochChris","date":"2015-10-04T11:10:36.075+0000","up_votes":2,"down_votes":1,"body":"und es ist ja nicht nur so dass man dafür blecht man setzt sich der gefahr aus alles zu verlieren und ich habe nicht wenig geld hier rein gesteckt an skins und runenseiten... mal abgesehen von den etlichen stunden ","replies":[{"poster":"eingew","date":"2015-10-04T11:16:09.485+0000","up_votes":2,"down_votes":0,"body":"Warum packst du nicht alles in eine Antwort? So ist das schon ziemlicher Spam irgendwie... Wenn du was vergisst kannst du deine Antworten übrigens auch bearbeiten :P\n\nEs geht bei der ganzen Sache nur um den Skin. Man kann ja wohl auch stolz auf ein teures Auto sein, oder? Das mag deinem Mindset widersprechen, aber es gibt genug Leute, die sich auch über derart \"einfache\" Dinge freuen.\n\nIch werfe dir ja auch nicht vor, das gemacht zu haben. Du hast gefragt, warum man sowas machen sollte und ich habe dir geantwortet. Das das Risiko dafür eigentlich zu groß ist, ist klar, vor allem dir, wo du doch die Strafe dafür erhalten hast.","replies":[{"poster":"ChefKochChris","date":"2015-10-04T11:19:09.548+0000","up_votes":2,"down_votes":1,"body":"verzeihung ich wollte nicht spammen , ich verstehe, wollte dir nur sagen warum ich nicht nachvollziehen kann warum man das machen sollte","replies":[]}]}]},{"poster":"ChefKochChris","date":"2015-10-04T11:09:35.884+0000","up_votes":3,"down_votes":1,"body":"Ich verstehe ja die kiddies die dafür blechen um die rewards zu erhalten... aber ich hatte alles safe , das einzige was halt noch machbar gewesen wäre wär nen dia rahmen ... aber dafür zu blechen ? :/","replies":[]},{"poster":"ChefKochChris","date":"2015-10-04T11:08:39.805+0000","up_votes":3,"down_votes":1,"body":"Stolz weil man dafür bezahlt hat ?","replies":[]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2015-10-04T10:35:44.627+0000","up_votes":2,"down_votes":1,"body":"Als Aussenstehender kann man wirklich nicht beurteilen, ob du zu unrecht ins Raster gefallen bist (Es muss ja Ausnahmen geben, die fälschlicherweise gebannt werden, kein System ist perfekt) oder was ich mir auch vorstellen könnte, dass du dich letzte Season hast boosten lassen ohne erwischt zu werden und diese Season halt schon.\nVon Plat 5 auf Pla2 wäre wirklich komisch ausgegebenes Geld, selbst für einen Booster ;)\nEs sei denn du wurdest gebannt bevor der Booster fertig war ;)\n\nich flashe übrigens auch auf d, ausser wenn ich jungle. Andersrum flashe ich viel zu oft in die Buffmonster rein ;)\n\nGehen wir mal von deiner Unschuld aus. Sitz die 2 Wochen ab. Dass jemand 2 mal zu Unrecht gebannt wird kann ich mir nicht vorstellen ;)","replies":[{"poster":"ChefKochChris","date":"2015-10-04T10:40:21.057+0000","up_votes":3,"down_votes":1,"body":"Danke für deine lange Antwort, ja du hast recht dass ist schon sehr unwahrscheinlich :/ \naber die sache ist halt , dass ich nicht weiß was ich gemacht habe und wenn man das nicht weiß\nhat man verständlicher weise wieder angst davor bestraft zu werden... wenn ich jetzt iwas bewusst gemacht hätte, \ndann würde ich denken : okay fuck die haben mich erwischt ich machs einfach nie wieder... aber das ist nicht der fall\nwenn die mir nicht glauben sollen die mich halt adden und auf die probe stellen ... oder keine ahnung ","replies":[]},{"poster":"ChefKochChris","date":"2015-10-04T11:07:49.971+0000","up_votes":2,"down_votes":1,"body":"und ja ^^ geht mir genau so mit den flash","replies":[]},{"poster":"ChefKochChris","date":"2015-10-04T11:00:11.750+0000","up_votes":2,"down_votes":1,"body":"und zu deinem double boost, man kann sich alles mögliche zusammenreimen bei so etwas bei dem man nicht persönlich erwischt werden kann...\nes gab einen regulären dauerhaften ip wechsel und das war beim umzug vor 2 jahren seit dem war ich immer hier online außer eben die letzte woche wegen den internetproblemen","replies":[]}]},{"poster":"legofreak1","date":"2015-10-03T20:19:52.059+0000","up_votes":4,"down_votes":2,"body":"Du kannst den Support nett fragen, ob dieser deinen Fall nochmal durchsieht, aber wenn dieser fest der Meinung ist, dass du gegen die Nutzungsbedingungen verstoßen hast und dies auch noch nach einer weiteren Überprüfung der Fall ist, dann wird auch nichts rückgängig gemacht werden.","replies":[]},{"poster":"Waldschrat86","date":"2015-10-03T23:19:44.560+0000","up_votes":2,"down_votes":1,"body":"Jemand anderen auf deinem Acc. spielen lassen außerhalb von Rankeds? Das reicht auch schon.","replies":[{"poster":"ChefKochChris","date":"2015-10-03T23:40:46.141+0000","up_votes":2,"down_votes":2,"body":"nein gabs nicht keiner hat sich bei mir eingeloggt und ich hatte auch keinen keylogger oder sonstiges gehabt so dass jemand mich gehackt hat. ich hatte erst überlegt ob ich im urlaub online war, aber selbst dass war ich nicht... ich hatte mal gegooglet, in diesem jahr(ausschließlich) hat es mehrere erwischt die sagen sie hätten nichts getan... ob das wahr ist ist ne andere sache aber vllt ist dieser \"detektor\" bei manchen dingen zu übereifrig... ich mein was soll mir ein plat 2 boost von 5 bringen warum sollte man dafür geld ausgeben , was bringt es einem überhaupt sich zu boosten , fühlt man sich dann cool weil man 3 divisionen höher ist ? na klasse -.- ich hätte es verstanden wenn ich jetzt silber 5 gewesen wär , gierieg nach skins usw, und wär dann pülötzlich in einem tag gold 5 ... DANN HÄTTE ICH VERSTANDEN wenn hier ein verdacht und evtl auch ein ban in meinen nacken gehauen werden , aber 3 divisionen auf platin ...","replies":[]}]},{"poster":"ü ö","date":"2015-10-03T21:14:35.331+0000","up_votes":2,"down_votes":1,"body":"> Ich hab echt paranoia nochmal ins ranked zu gehen jetzt, wenn das nochmal passiert werde ich dauerhaft gesperrt\n\nAlso war es ein 2 Wochen Ban, kein Perma?","replies":[{"poster":"ChefKochChris","date":"2015-10-03T21:19:48.074+0000","up_votes":2,"down_votes":2,"body":"ja genau... aber scheiß auf die zwei wochen und die skins... ich weiß ned was ich gemacht haben soll und habe angst dass ich grundlos gepermat werde","replies":[{"poster":"ChefKochChris","date":"2015-10-03T21:20:52.308+0000","up_votes":2,"down_votes":2,"body":"also wenn das nochmal \"in deren augen\" vorkommen sollte\nzumal das wahrscheinlich eh ein system ist das ips und unregemäßigkeiten abgleicht(studiere info)","replies":[]}]}]},{"poster":"Patter91","date":"2015-10-03T20:24:42.894+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ChefKochChris,realm=EUW,application-id=KYnfKGf0,discussion-id=FzsXgunm,comment-id=,timestamp=2015-10-03T20:04:52.702+0000)\n>\n> Was ich auch krass finde ist , dass mir keinerlei beweise vorgelegt werden und ich dem support auch angeboten habe s&auml;mtliche IPS mid denen ich drinnen war offenzulegen, alles wurde abgelehnt\n\nEinerseits sind sie nicht verpflichtet, dir irgendwelche Beweise zu liefern. Du stimmtest jeden Patch wieder zu, dass Riot Games deinen Account ohne Gründe sperren kann. Da sie aber gerade bei solchen Fällen sehr sorgfältig prüfen... Und sorry, auf dein Wort geb ich nichts, alle Gebannten im Forum haben bisher gelogen.\nAndererseits werden sie diese nicht offenlegen, da dies dazu führen könnte, die Systematiken dahinter zu durchschauen.","replies":[{"poster":"ChefKochChris","date":"2015-10-03T20:34:14.760+0000","up_votes":2,"down_votes":2,"body":"du findest es also außergewöhnlich , dass es jemand von plat 5 auf plat 2 schafft ?\nwas soll mir das bringen und wtf warum sollte ich dafür zahlen :D","replies":[{"poster":"TheUnknown98","date":"2015-10-04T06:51:49.481+0000","up_votes":1,"down_votes":2,"body":"Wieso zahlen, es reicht ja schon wenn ein Kumpel zu dir kommt und deine Rankeds macht, wenn der immer mit Flash auf F statt auf D spielt und anders klickt ist das schon ein Beweis.","replies":[]}]}]}]}