{"poster":"asdmaskldmnkfl","date":"2019-07-21T14:19:48.602+0000","title":"La toma de decisiones en LAS es realmente horrible dentro del juego. No crypost","subforum":"Charlas Generales","up_votes":13,"down_votes":1,"body":"He estado jugando en LAS y BR rankeds en elos similares oro IV y silver 1, en teoria un elo similar, pero las toma de decisiones en cosas básicas del juego en brasil es muy superior a las \r\n\r\nEjemplo:  ganas una teamfight y vas a pushear mid y tirar inhibidor, en las la gente quiere seguir pusheando a las torres de nexus, en brasil la gente se va a base porque sabe que su enemigo revive en 4 segundos y viene con items nuevos y mucha velocidad de movimiento por el boost de la fuente. \r\n\r\nHe estado viendo el stream de una chica que se llama sofikimmy que oscila entre diamante 4 y diamante 1 y de verdad la toma de decisiones en diamante es horrenda o sea en casos como el anterior tambien pushean a la fuente. \r\n\r\nAlgo para reflexionar\r\n\r\nSaludos","replies":[{"poster":"One Fox","date":"2019-07-21T14:45:19.112+0000","up_votes":8,"down_votes":0,"body":"Es LAS, no sé qué pretendés. El nivel de juego acá es muchísimo más inferior que en cualquier región. Tengo un amigo en Master y me decía exactamente lo mismo, llegar a oro o platino acá (en cuestión de nivel) es como llegar a plata en NA. Para mí es un problema más que nada cultural, ya de por sí los latinos toxiqueamos muchísimo y tendemos a pelearnos hasta por la más mínima cosa, a eso sumale que no son muchos los que se toman en serio el juego (a nivel competitivo hablando) y que el resto entra a divertirse, pasa el rato o hasta a trolear porque sí. \nLo que mejor podés hacer es juntarte con gente que de verdad quiera jugar sin toxiquear (y ganar), xq jugar con randoms por lo general lleva a eso.","replies":[{"poster":"asdmaskldmnkfl","date":"2019-07-21T15:58:17.647+0000","up_votes":2,"down_votes":1,"body":"Es que es brasil, ni siquiera na (bueno na tambien es un meme de server) pero de verdad brasil un oro es mucho mejor que un oro de las solo eso.","replies":[]},{"poster":"TortugaConMuleta","date":"2019-07-22T00:22:57.114+0000","up_votes":1,"down_votes":0,"body":"> Es LAS, no sé qué pretendés. El nivel de juego acá es muchísimo más inferior que en cualquier región. \n\nesta comprobado, hasta hay estadísticas","replies":[]}]},{"poster":"DemonShike","date":"2019-07-21T16:40:18.243+0000","up_votes":6,"down_votes":0,"body":"Eso es verdad amigo,pero lamentablemente hay un transfondo mas real ,que escapa del juego y ya pasa a la sociedad en la que convivimos en las,yo soy argentino y paso de flamear  por que creo que el trabajo psicologico en un equipo es tan importante como otros factores en la partida,el tema es el siguiente,tenes que tener en cuenta que ademas de que la sociedad latina esta en la mrda,no tenemos la misma cantidad de referentes (streamers,youtubers,blogers)que en otros sv ,por ende el progreso y el aprendizaje se ve mas reducido a comparacion de otras regiones y si a eso le sumamos otros factores como la gente que no busca informarse y mejorar tan solo va a las ranks a ver de que es capaz por que quizas no tiene tan normalizado la busqueda de guias y consejos en youtube u otras plataformas o que simplemente le da  \"paja\" pues asi es como estamos.Espero haberme expresado bien y que mi punto se haya dado a entender.\n\n:D","replies":[]},{"poster":"LCD Z1 Awesome","date":"2019-07-21T22:32:07.329+0000","up_votes":4,"down_votes":1,"body":"No generalices :D","replies":[]},{"poster":"Gahl","date":"2019-07-21T16:48:37.980+0000","up_votes":2,"down_votes":6,"body":"Se queja de la toma de decisiones...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEn silver xD","replies":[{"poster":"asdmaskldmnkfl","date":"2019-07-21T21:18:17.693+0000","up_votes":1,"down_votes":0,"body":"Lo comparo en brasil en el mismo elo.","replies":[{"poster":"Gahl","date":"2019-07-21T22:04:08.439+0000","up_votes":3,"down_votes":2,"body":"Realmente te pensas que hay diferencia? Deja de joder y centrate en mejorar vos que si estas en ese elo es xq te lo mereces y tenes el mismo macro que aquellos de los que te quejas.","replies":[{"poster":"TortugaConMuleta","date":"2019-07-22T00:20:05.821+0000","up_votes":1,"down_votes":2,"body":"Macro a diferencia de Micro se toma la decisiones en grupo\n\nMicro = decisiones Individuales = farming, tradeo de linea, push, etc\nMacro = decisiones Grupales = Drake, baron , rotacion de lineas , TF, Heraldo, etc","replies":[]}]}]},{"poster":"Erumil","date":"2019-07-22T21:36:08.704+0000","up_votes":1,"down_votes":0,"body":"XD apoyo esto","replies":[]}]},{"poster":"PasoPackXHonores","date":"2019-07-21T17:20:20.831+0000","up_votes":2,"down_votes":1,"body":"Yo igual me hice una cuenta en BR y es muy superior a LAS. Lo que mas me gustó es que no andan llorando a la primera muerte, diciendo : gg, ff al 15. Y tirando FF hasta el cansancio.","replies":[]},{"poster":"FullRams","date":"2019-07-21T15:04:10.490+0000","up_votes":2,"down_votes":1,"body":"Estuve jugando en equipo con jugadores streammers y con otros de aca. En equipos diamante todo bastante bien, en equipos oro y plata, si veia diferencia (yo no soy un crack tampoco apenas voy 27 lvls XD).\n\nA lo que voy es que se nota la diferencia entre elos. Pero se supone que se note. ¿por que esperas buena decision o buenas jugadas de alguien en ligas como plata y oro? esa seria la pregunta clave.\n\nHonestamente las partidas que perdi las perdi mas por malas decisiones mias, osea no de lo que yo hacia en si, pero si al pretender seguirle la idea a un plata, que a lo mejor estaba a dosp asos me marca que entra y de repente le pinta ir para otra linea. El fallo no es de el, osea si, pero yo tambien por confiarme. \n\nEso de aca a brasil, no se me parece que es mas como jugas vos que lo que hace el resto.","replies":[]},{"poster":"unionsovietica8","date":"2019-07-22T01:46:54.784+0000","up_votes":1,"down_votes":0,"body":"Yo tenia heraldo y habiamos matados a casi todos faltaba 1 y todo mi equipo en vez de ayudarme a tirar 2 torres con el bicho les señale vengan ... Se van todos a base como me enoje jajaja. y perdimos =)","replies":[]},{"poster":"Lunari Red Mask","date":"2019-07-21T15:49:11.930+0000","up_votes":3,"down_votes":5,"body":"Como ya dijeron es cultural el problema. En Argentina se tiene el ego inflado a tal punto de no reconocer errores, terminas peleandote con todo tu team en vez de jugar a ganar, a tal punto que prefieren perder e insultarse que juntarse a ganar. Me paso que no me quisieron dar jungla en ranked y  le banee el pick al jungla y trollee la partida. Y luego quede positivo en kda y el jungla en negativo, llendose él culpado de los reportes cuando no tuvo ayuda de ninguno, y tampoco la iba a tener porque es terrible pete. Obvio sí iba yo jungla ganabamos :V.","replies":[{"poster":"Raton Modesto","date":"2019-07-21T21:41:19.683+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lunari Red Mask,realm=LAS,application-id=v7qsfXsE,discussion-id=XaYe6phW,comment-id=0002,timestamp=2019-07-21T15:49:11.930+0000)\n>\n> Como ya dijeron es cultural el problema. En Argentina se tiene el ego inflado a tal punto de no reconocer errores, terminas peleandote con todo tu team en vez de jugar a ganar, a tal punto que prefieren perder e insultarse que juntarse a ganar. Me paso que no me quisieron dar jungla en ranked y  le banee el pick al jungla y trollee la partida. Y luego quede positivo en kda y el jungla en negativo, llendose él culpado de los reportes cuando no tuvo ayuda de ninguno, y tampoco la iba a tener porque es terrible pete. Obvio sí iba yo jungla ganabamos :V.\n\n\"no me quisieron dar jg en ranked y le banee el pick al jg y trollee la partida.\" nice\npd: llendose y :V. completito lo tuyo.","replies":[]}]},{"poster":"Annie Botz","date":"2019-07-21T17:07:32.122+0000","up_votes":1,"down_votes":0,"body":"Quién lo diría... con una muestra 2 veces mayor...\nDiamante 4- Diamante 1, en especial personas que rondan el 50% winrate es gente que sube por jugar, no por que juegue bien xd, en esta season se marcó más eso que otras veces (porque subió más gente más que nada). Ahora si juegas en chall siguen habiendo un par así pero ya se va notando la diferencia, más con pro players que jueguen solos en soloq.","replies":[]},{"poster":"Mala suertè","date":"2019-07-21T17:07:21.094+0000","up_votes":2,"down_votes":2,"body":"LAS, server de monos. {{sticker:sg-lulu}}","replies":[]}]}