{"poster":"Escänor","date":"2018-05-29T04:44:29.513+0000","title":"¿Es hora de un cambio para Annie?","subforum":"Charlas Generales","up_votes":5,"down_votes":3,"body":"Cuando empece a jugar hace 4 a&ntilde;os, veia Annies por todos lados, mid, supp, top, no dejabas de verla, estaba siempre.\r\n\r\nAhora no la veo ni en figurita, debe ser como 1 a&ntilde;o que no la veo en una partida mia.\r\n\r\nYo creo que el personajes se volvio impopular con tantos asesinos.\r\n\r\nAdemas que su kit de habilidades a mi parecer es anticuado, aburrido y no sirve.\r\n\r\nMejor dicho su kit de habilidades no, su E y su R, su E es una porqueria sin mas no necesita explicacion, pero Tibbers, es otra porqueria, a veces hace lo que quiere, como Margarita, como los dragones de Mordekaiser, para que sea mas divertido el ultimo rework que tuvo Tibbers fue que sea mas agresivo que corra mas, pero ni asi, no hay caso, es una R aburridisima.\r\n\r\nYo creo que deberian cambiar esas 2 habilidades, para que se vuelva a ver Annie, literalmente, la recorde ahora viendo una imagen, casi no me acordaba que existia.","replies":[{"poster":"Zoliza","date":"2018-05-29T08:24:20.018+0000","up_votes":2,"down_votes":0,"body":"Que un campeón no se use depende muchas veces más del meta que el Estado actual del mismo, annie no es mala ni su kit lo es, pero es un mago de rango medio que no tiene casi nunca prioridad de línea en early game.\nSu e reduce bastante el daño recibido (40% maxeada) por que es mala? \nSu r es la esencia principal del campeón mo puede no tener a tibbers, sino arreglar los Pet del juego en general.","replies":[]},{"poster":"BiIIy the Kid","date":"2018-05-29T17:08:42.574+0000","up_votes":1,"down_votes":0,"body":"son de la escuelita de teemo, nunu, etc... son point and click donde la única counterplay es el auto-spacing, se siente muy anticuado usar ese tipo de campeones.","replies":[]},{"poster":"Miroh","date":"2018-05-29T13:33:30.401+0000","up_votes":1,"down_votes":0,"body":"si le hacen cambios ojala le hagan rework visual tambien y que de una vez por todas le cambien el baile que es de los mas malos del juego no me gusta nada","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-05-29T10:12:42.617+0000","up_votes":1,"down_votes":0,"body":"El otro día la jugué arurf y me pareció un champ divertido, es cierto que se ve poco pero tiene un kit de habilidades interesante, y el tibbers  pega la verdad de las 5 veces que lo tire 3 mato. Creo que lo que pasa es que hay otros campeones que rinden más en el juego nada más. Pensá que es muy probable que hace 4 años a alguien le haya parecido lo mismo que a vos con otro champ","replies":[]},{"poster":"ToxicRunner","date":"2018-05-29T09:54:28.962+0000","up_votes":1,"down_votes":0,"body":"Esas partidas en donde tibbers no te seguia por quedarse parado en un Bush. \nOrito.","replies":[]},{"poster":"Her slave","date":"2018-05-29T05:21:38.977+0000","up_votes":1,"down_votes":0,"body":"Lo más divertido de Annie son su pasiva y su R, no le veo sentido en tus justificaciones para decir que no sirven.\n(La E ayuda a cargar la pasiva prácticamente gratis).\n\nEn lo demás concuerdo, es un campeón súper antiguo y se usa muy poco, quizás un minirework le de un pequeño empuje y se vea más por la grieta.\n\n{{sticker:slayer-jinx-catface}}","replies":[]}]}