{"poster":"mfw Lee banned","date":"2017-11-12T18:22:50.757+0000","title":"After two years of trying to get answers , nothing have changed [PERMABAN]","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello everyone , just like many other threads i've seen lately , riot permanently banned recently alot of players for various reasons (toxicity,eloboosting etc..) thats what reminded me of what happened to my old account.\r\nMany of these of course deserved it , but many , like me are left without any clear answer.\r\nMy account was banned 2 years ago because it has many \"security problems\" , by that they meant that it got hacked \"many times\" , by many times they meant once.\r\nThe full story is that somehow my friend managed to hack into my account and change email and all , didnt take me too long to get it back thanks to the support's help.\r\nContinued to play normally for two more years until one day i found out that i was permanently banned ?! contacted the support and they told me what i said above , hacked \"many times\" , asked for a proof about the second time my account was hacked in and they refused to answer.\r\nThis is the full story , didnt add anything and any riot agent is more than welcome to discuss this matter here infront of everyone.\r\nBy the way i have spent like 1000euros on this account just to get treated like this lol\r\nMy account's USERNAME is : lammal1801\r\nServer : EUW (posted in NA boards cuz euw mods never answer)","replies":[{"poster":"Broporo","date":"2017-11-13T03:16:43.722+0000","up_votes":1,"down_votes":0,"body":"Sorry it feels like no one has been giving you substantial info in those tickets, but I did take a look through those to see what was going on. You did have quite a few tickets open, and each of them was addressed explaining what happened and why. You can always go back and reference what was said, but I can't go over personal account info here on the boards.","replies":[{"poster":"mfw Lee banned","date":"2017-11-13T14:04:17.664+0000","up_votes":1,"down_votes":0,"body":"yeah every time they kept saying the same thing \"your account has been hacked many times\" and they never explained further and gave me any proof , please help me if you can","replies":[{"poster":"Broporo","date":"2017-11-13T21:20:12.871+0000","up_votes":1,"down_votes":0,"body":"I can't recover accounts myself from here on the boards, mainly just because I'm not a part of those teams. I was able to see what went down in your tickets, and if you read through those again you should understand what happened and why. It looks like multiple agents were able to provide explanations in your tickets.","replies":[]}]}]}]}