{"poster":"Demonawaken","date":"2014-08-01T09:54:14.807+0000","title":"Mi alapján kapjuk a promó meccsekhez a csapattársakat?","up_votes":1,"down_votes":0,"body":"Felmerült bennem ez a kérdés. Elvileg számít az MMR-em, legalábbis ezt szokták mondani. Eljutottam arra a pontra, ahol végre elfogadható csapattársakat kapok, és volt, hogy vereség nélkül másztam fel promóig két nap alatt. Aztán olyan embereket kaptam arra a bizonyos 2 meccsre, hogy nem lehetett lehozni ( 1vs5 harcok, ks miatti trollkodás, és hasonlók). Majd 2 easy win megint promóig, majd 2 loose. Nagyobb büntetés az a 2-3 meccs, mint az előtte lévő 6-8. Lehet, hogy gyengébb játékosokat kapok, mint amit az MMR-em miatt kellene kapnom? Vagy csak nincs szerencsém?","replies":[{"poster":"zrs1337","date":"2014-08-06T09:20:13.456+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem tök random, hogy kiket kapsz. Van sokszor, hogy kapok egy teamet, valaki dodgeol és utána full ugyanazt a teamet kapom enemyként akikkel toltam volna csak az én helyemen van más ember, olyan szokás szerint az a team amiből átkerültem újba szarráveri az enyémket... Na az rohadt idegesítő. :D\n\nAmúgy meg szerintem még platinumban is tök random emberek vannak, van aki onnan is inkáb bronzeba való, mert annyira képtelen felfogni az alapvető dolgokat.... Szóval vagy szerencséd van és kikapod a carryzhető embereket, vagy a \"omg meghaltam 10x 1v1ben topon, rohadjon meg az a noob jungler, nem érdekel megyek feedelni\" típusú agyhalottakkal rak össze...","replies":[]},{"poster":"BÜDÓSROMÁNERIK","date":"2014-08-02T02:29:21.422+0000","title":null,"up_votes":1,"down_votes":0,"body":"A rendszer célzottan gyűjti a retardáltakat, mert ha velük is tudsz nyerni promón, akkor 100%, hogy megérdemelten jutottál fel. Akkor van cink, ha nem 1 gratis majom van a csapatban, hanem több. Rendszeresen kapok promón olyan társakat, akik 5+-os loss-streaken vannak, és az én promóm menti meg őket a visszasorolástól... gg\n\n(az ilyen emberek mentális állapotáról meg ne is beszéljünk... kapsz 1 olyan társat, aki ideges, mert tudja, hogy visszaesik, ha lossol... Ideges, hibázik, meghal 2-3x, és elmegy afk-ba, és le>>>>ja az egészet, mert fejben már feladta. Sokszor nem a skill hozta le a promóm, hanem az a mental boost, amit beletolok egy-egy ilyen csapatba - ééééés, működik...)","replies":[{"poster":"J4CKP0T","date":"2014-08-03T12:08:38.915+0000","title":null,"up_votes":1,"down_votes":0,"body":"Amúgy az ilyen féle, játék tapasztalatok megosztására pont nem rég készült egy topic egy kolega révén. \"Feszültség levezető téma\" néven. Mellékesen este se mindig vannak ám jobb játékosok, ott általában ha jobbak is de fáradtabbak is szoktak lenni. A losetol való idegesség meg teljes mértékben felesleges, ha egyszer a promoba jutottál sikerülni fog máskor is. Egy promo elvesztése nem a világ vége. Fő a higgadtság, ami mondjuk már nekem se mindig megy pedig mérhetetlenül türelmes vagyok.","replies":[]}]},{"poster":"J4CKP0T","date":"2014-08-01T11:59:00.568+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez sok mindentől függ. Főleg az mmr-ed alapján kapod a csapat társaidat egyébként. Másrészt attól is függ, hogy melyik nap milyen időben játszol. Nem beszámítható igazán. Például lehet kifogsz egy olyan napot amikor a \"rossz\" játékosok, 16 év alatti gyerekek (no offense) nincsenek fenn vagy vica versa.","replies":[{"poster":"Demonawaken","date":"2014-08-01T18:32:49.144+0000","title":null,"up_votes":1,"down_votes":0,"body":"Akkor átállok az éjjeli lolra. Hátha lövik a pizsit a srácoknak. Köszi. :)","replies":[{"poster":"Parroxysm","date":"2014-08-02T09:16:48.356+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én is észrevettem, hogy hajnalba vagy kora reggel sokkal értelmesebb csapattársakkal lehet találkozni :D","replies":[]}]}]}]}