{"poster":"Myrania","date":"2018-04-18T20:22:26.084+0000","title":"Der Pro Patch vs \"Was ist mit den nicht Pro's?\"","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"{{sticker:zombie-brand-clap}} \r\nGenau das Gesicht mache ich mittlerweile nach jedem Patch den Riot raushaut. Ich wundere mich &uuml;ber 80% der Nerfs/Buffs und dergleichen.\r\nIch bin in der letzten Season Gold 1 gewesen. Hatte es Platin 5 geschafft aber dann die Lust verloren. Bisher keine Motivation f&uuml;r Ranked gefunden.\r\nAber wenn ich in Normals erlebe wie ein Rengar alles und jeden Oneshottet dann frage ich mich doch, ist das gewollt? Ich meine da ist auch kein Counterplay mehr m&ouml;glich man ist einfach tot. Vielleicht kann man was machen wenn man ein beinharter Pro ist. Aber das sind wir ja nicht alle.\r\nDas gilt auch f&uuml;r einige andere Champions. Wie empfindet ihr das welche Champs findet ihr momentan zu stark? Schreibt doch mal mit eurer Elo und warum.  Und bitte kein Elo Bashing will nur gern wissen ob ich mit der Meinung alleine dastehe.\r\nF&uuml;r mich steht klar fest, Rito scheint gerade nur Pro Patches zu machen, das hei&szlig;t gepatcht werden teilweise nur Champs die eben im Pro Play zu stark sind. In meinen Augen war Taliyah vollkommen balanced... Immerhin ist sie auch nicht gerade leicht zu spielen.\r\nIch finde es einfach schade, das Riot anscheinend einen Gro&szlig;teil der Community ignoriert, weil sie eben nicht Challenger sind, oder sonst was.\r\n{{sticker:sg-soraka}} \r\nUnd ehrlich gesagt geht mir die Laune am Game auch wieder fl&ouml;ten wenn ich sehe wie sich das entwickelt. Ich will das Game auch f&uuml;r meine Elo einigerma&szlig;en gebalanced wissen und nicht nur f&uuml;r die Pro&#039;s.\r\n\r\nWie sehr ihr das haut mir eure Meinung in den Thread :D Und bleibt chillig und cool Bitte Dankesch&ouml;n\r\n \r\n{{sticker:sg-ahri-2}}","replies":[{"poster":"Critical lmpact","date":"2018-04-19T09:35:21.939+0000","up_votes":3,"down_votes":0,"body":"Dass sich viele Veränderungen an Champions und gameplay an der Pro-Szene orientieren ist doch nichts neues. \n\nAber ich sehe dabei für die LowElo gar nicht so große Probleme. Ich bin selber Bronze 1 momentan, also wirklich Low :D, bin aber der Meinung, das hier jeder Champion jeden beliebigen anderen Champion schlagen kann. Sowas wie eine Meta gibt es zwar, hat aber längst nicht so einen großen Einfluss auf den Ausgang des Spiels wie in high Elo bzw. im professionellen Bereich.\n\nIn den unteren Elos ist einfach niemand in der Lage, die Vorteile die er gegenüber einem anderen Champion hat, auszunutzen und in einen Sieg umzuwandeln","replies":[]},{"poster":"IKartoffelI","date":"2018-04-20T08:35:29.157+0000","up_votes":1,"down_votes":0,"body":"Der jetzige Patch war pro orientiert, da er der msi patch ist. Bei den meisten dieser nerfs merkt der normale Soloq Spieler fast gar nichts, da diese Champs ihr potential erst im Team ausschöpfen. Ausserdem kannst du mit jedem Champ bis zu ner relativ hohen elo spielen. \n\nZu deinem Problem mit Rengar gibt es eine einfache Lösung:\nAp -> stundenglas\nEgal was -> Im Team stehen","replies":[]},{"poster":"SSI CptHaunted","date":"2018-04-19T09:05:48.352+0000","up_votes":1,"down_votes":0,"body":"Jeder Patch hat Auswirkungen auf jede Elo, von daher ist es nicht möglich jede Elo perfekt zu balancen (ohne für jede Elo eine eigene Spielversion zu bringen, was unsinnig ist), besonders nicht die Champions die ein sehr hohes Skillcap haben. Im Endeffekt würden also nur 3 Möglichkeiten bleiben:\n\n- Man patcht für die Pro-Ebene, darunter wird der Champion schwächer da die Leute sein Potenzial nicht voll ausschöpfen können und wird er kaum gespielt.\n- Man patcht für die breite Masse, der Champion ist ohne große Skill-Anforderungen stark, eskaliert auf Pro-Ebene komplett und ist dort zu 100% First-Pick oder gebannt.\n- Man reworked jeden skill-lastigen Champion bis jeder mit ihm gut performen kann, dann hat man irgendwann aber nur noch Yis und Xins und so weiter, nur mit anderen Namen.\n\nAllgemein hat die Pro-Ebene die größte Außenwirkung und damit ist es nicht übermäßig verwunderlich, dass Riot dort sein Augenmerk hat und letztendlich richtet ein Champion der zu stark ist in jedem Fall mehr Schaden an als ein Champion der zu schwach ist. Von daher muss man wohl oder übel damit leben und entweder Champions spielen deren Potenzial man ausreichend nutzen kann und wenn man eben schwierige Champions spielen will muss man sich dabei klar machen, dass schwierig auch schwierig bedeutet und es an einem selbst liegt wenn man mit dem schwierigen Champion schlecht ist.","replies":[]}]}