{"poster":"StunnerMan","date":"2020-01-26T17:07:56.320+0000","title":"È possibile finire almeno una ranked in 5?","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Lo chiedo perchè su una ventina di partite giocate, in almeno la metà ho avuto un afk in early/mid-game ed è davvero frustrante, ogni volta mi passa la voglia di giocarci.\r\nCredo che gli afk debbano essere puniti in modo più severo!","replies":[{"poster":"OTP REQUIEMBOW","date":"2020-01-27T21:17:04.449+0000","up_votes":2,"down_votes":0,"body":"ho fatto una serie di sconfitte da 10 partite di fila prendendo S-/S/S+, sempre finendo 4 contro 5 o meno... non so non riesco a capacitarmi del fatto che sto ricominciando le ranked da dove ho cominciato la season scorsa, ma la qualità delle persone è drasticamente peggiore... gente 0/10 al minuto 7, o peggio, gente che alla seconda morte di un alleato scrive FF e poi va afk... cosa è cambiato dallo scorso anno? penso di aver perso tipo il 70% delle partite che potevano esser vinte, invece sono state intate da animali frustrati che giocano per rovinare le partite altrui....","replies":[]},{"poster":"KrystalCore","date":"2020-01-28T23:05:28.090+0000","up_votes":1,"down_votes":0,"body":"Guarda stessa cosa è capitata a me. Infatti ho appena terminato un ticket bella in%%%%%%%. Cioè io gioco da 8 anni e sono sempre stata gold e un anno plat. Poi per s%%%%% mi sono sempre fermata a gold per prendere la skin e basta, tra l' altro sempre fatto in brevissimo tempo, massimo in un paio di settimane. Quest' anno invece è un incubo. Cioè perchè piazzarmi da g3 a b2? Perchè? Cioè ci sono stati anni che dopo le 10 placement ero diretta gold..mo b2? Perchè mettermi b2 prendendo 60lp a partita e non mettermi diretta s2 e prenderne 25-30? Cioè che senso ha. Fatica per niente. Matchata con gente poi a livello bassissimo ( 30-40) quando io sono al 170 , che tiltano e intano i game andando 0 9 0 al minuto 10. Questo capita per i 3/4 delle partite. Cioè io come dovrei fare? Non ho lo sbatti di stare 8 mesi a cercare di aiutare delle scimmie. Quindi ora in soloq sono s2 ma niente, ho perso 3 fame di fila a 0 punti per colpa di afk e gente che tira dritto apposta. Cosa cavolo è cambiato da anno scorso? Mai trovata gente così scarsa. Un matchmaking pessimo. Non ho più sta pazienza. Mi farò solo normal e a quel paese la skin gratis. Potesso vorrei ritornare unranked. XD E la colpa è soprattutto mia che le ho iniziate. Mi ero detta \" quest' anno niente ranked\" e poi ci sono ricascata. Mo basta. XD","replies":[]}]}