{"poster":"S04 Ezrael","date":"2018-05-24T18:27:48.633+0000","title":"Pick und Bann Phase","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Mir ist des öfteren aufgefallen, dass Beschwörer keine Champions bannen. Mich nervt das total, weil wenn z.B 3 Beschwörer keinen Champion bannen was bringt dann die Bann Phase? Ich weiß nicht, wass das für ein Vorteil bringen soll. (Das schreiben die immer, wenn ich die drauf anspreche) Ich empfinde dies als nachteil. \r\n\r\nEin Vorschlag dieses \"Problem\" zu umgehen.\r\n\r\nIch fände es besser, wenn mann keine andere Möglichkeiten hat als ein Champion zu bannen. Dieses Schwarze feld sollte entfernt werden.\r\n\r\nIch lasse mich gerne eines besseren belehren.\r\n\r\nMfG","replies":[{"poster":"Oriius","date":"2018-05-24T22:19:09.263+0000","up_votes":2,"down_votes":1,"body":"Denk ein wenig nach und denke dir einen strategischen Vorteil\n\nWenn du zb ne Irelia Top spielen willst und bannst Mundo dann kann der gegner sich seinen teil denken und fragt sich was könnte gerade meta auf top sein der jedoch von mundo gecountert wird. AHA IRELIA! dann picken die gegner einfach mal ez irelia weil die wissen du hast mundo gebannt und gg.  Wenn du keinen bannst wissen die auch nicht welche position du möglicherweise hast und welchen Champ du möglicherweise pickst","replies":[{"poster":"Jura500","date":"2018-05-25T12:21:04.655+0000","up_votes":2,"down_votes":0,"body":"Alternativ könnte man ja sein Team fragen ob sie noch einen Champ loswerden wollen. Ich denke deinen Ban zu verschenken ist immernoch besser als ihn einfach nicht zu nutzen.","replies":[]},{"poster":"S04 Ezrael","date":"2018-05-25T14:27:28.522+0000","up_votes":1,"down_votes":0,"body":"Okay kann ich als grund akzeptieren. Aber trotzdem kann man doch nervige champions bannen die offen sind oder nicht? Z.B Brand oder Zyra finde ich extrem nervig im Teamfights vorallem wegen ihren Ults. \n\nUnd wie Jura500 es bereits gesagt hat, kann man sein Team fragen.\n\nAusserdem kann es doch auch sein, dass ein anderer Mundo bannt weil er den zu OP findet obwohl er Support spielt.","replies":[]}]},{"poster":"Evenrider","date":"2018-05-24T20:56:02.694+0000","up_votes":2,"down_votes":0,"body":"Und wie ist das mit den gemeinsamen Bans?\n\nGibt es einen Unterschied, wenn 1 Team nicht bannt und das andere bannt: {{champion:122}} {{champion:104}} {{champion:39}} {{champion:412}} {{champion:157}} \nOder sowohl Team 1 als auch Team 2:  {{champion:122}} {{champion:104}} {{champion:39}} {{champion:412}} {{champion:157}} bannen?\n\nDie Wahrscheinlichkeit für genau gleiche Bans ist gering, aber da man doppelte Bans haben kann, ist ein doppelter Ban genauso Wertvoll wie Ban + No Ban.\nStell dir das Schwarze Feld einfach als ein Bann vor, den das Gegnerteam durchgeführt hat.\n\nUnd gerade bei aktuell beliebten Champs bzw. Dauerbans wie z.b. {{champion:157}} ist dies nicht so unwahrscheinlich.","replies":[{"poster":"S04 Ezrael","date":"2018-05-25T14:24:39.095+0000","up_votes":1,"down_votes":0,"body":"Klar kommt es vor. dass es doppel bans gibt. Ist halt ärgerlich. Aber gar keinen Champion zu bannen finde ich unnötig.","replies":[]}]},{"poster":"Marksmansitter","date":"2018-05-25T14:48:15.348+0000","up_votes":1,"down_votes":0,"body":"In normal drafts banne ich nie, weil es mir einfach egal ist gegen was und wen ich spiele.","replies":[]}]}