{"poster":"cardinals29","date":"2015-08-02T15:42:50.062+0000","title":"To People Saying GP was disabled because of the Draven Bug","subforum":"Gameplay","up_votes":9,"down_votes":5,"body":"You do know Riot had to plan all this out right?\r\n\r\nThe lore was all finished and GP was planned to be disabled long before the rework came out and the glitch was discovered. Some Riot employee didn&#039;t wake up last week and say &quot;Hey I think we should disable our newly reworked champion.&quot;\r\n\r\nAlso, Riot employees have stated both on the boards and on Reddit in a completely serious manner that GP was disabled completely because of lore.\r\n\r\nIt just annoyed me when people bring up the Draven bug so I had to say this.","replies":[{"poster":"Ser Garland","date":"2015-08-02T17:08:49.444+0000","up_votes":1,"down_votes":9,"body":"Its because of black market brawlers.\n\nThe brawler currency is Krakens. A currency also shared by GP to upgrade his ultimate, death's daughter.\n\nIf the two overlapped, GP would be OP as he'd get free Kraken currency to fully upgrade his ult early game.\n\nSo for the duration of this new game mode, Gangplank will be dead.","replies":[{"poster":"Downfall","date":"2015-08-02T17:14:10.086+0000","up_votes":8,"down_votes":1,"body":"GP upgrades his ult with silver serpents","replies":[]}]},{"poster":"JustMyBassCannon","date":"2015-08-04T05:11:18.894+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=cardinals29,realm=NA,application-id=3ErqAdtq,discussion-id=xuENI3wn,comment-id=,timestamp=2015-08-02T15:42:50.062+0000)\n>\n> It just annoyed me when people bring up the Draven bug so I had to say this.\n\nI'd rather believe that Riot *rationally* disabled a champion due to a bug, rather than *irrationally* disabled them because \"Fuck you, story time says he's dead except he's not.\"\n\nI mean, *ask any reader* if they actually thought Gangplank was dead before the last part of the story was revealed. Not even relying on the crutch of \"Riot doesn't delete champions,\" Miss Fortune wasn't even within line of sight to see Gangplank actually die, and she never recovered his corpse. No writer worth half a dime kills a main character off-screen.","replies":[]},{"poster":"Siyther","date":"2015-08-02T17:05:18.903+0000","up_votes":1,"down_votes":4,"body":"and where di u find these statements that he was disabled because of lore ive not seen them. why did u not link them?  Maybe they dont exsist, u offer no evidence to support your claim. If you did maybe i would believe you.  Disabling a champ because of lore when they have just beeen reworked is bad for business. It would be interesting if they did disable due to lore though i would be down with it if they could write some lore and disable some overloaded champs lol. Best times ive ever had in League was when Zedd was gone now he is back and i hate him again lmao","replies":[{"poster":"Downfall","date":"2015-08-02T17:18:43.891+0000","up_votes":3,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/miscellaneous/UJNhUba0-gangplank-skin-bundle?comment=0000\n\nhttp://boards.na.leagueoflegends.com/en/c/bug-report/Ey3JIqx8-what-is-the-gangplank-bug?comment=0001\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/AWLTXpZ2-the-real-reason-why-gp-is-disabled?comment=0002","replies":[]},{"poster":"cardinals29","date":"2015-08-02T18:16:43.466+0000","up_votes":1,"down_votes":0,"body":"My bad, I was in a hurry and didn't have time to find the actual  links . I'd also link to thank the person that provided them.","replies":[]},{"poster":"LaceUp23","date":"2015-08-02T17:06:39.542+0000","up_votes":1,"down_votes":0,"body":"What did I just read?","replies":[]},{"poster":"Zair Umbras","date":"2015-08-04T20:22:10.928+0000","up_votes":1,"down_votes":0,"body":"Right [here](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/bmtNEx52-riot-gp-being-disabled-is-getting-old-and-apparently-i-cant-be-upset-about-it?comment=00140030). It even got downvoted to hell and back.","replies":[]},{"poster":"TheDuelist999","date":"2015-08-04T05:53:34.922+0000","up_votes":1,"down_votes":0,"body":"Ned Stark died off screen","replies":[]},{"poster":"Zavern","date":"2015-08-03T02:54:02.088+0000","up_votes":1,"down_votes":0,"body":"My head hurts from reading that.","replies":[]}]},{"poster":"Tusutaki","date":"2015-08-04T05:05:19.417+0000","up_votes":2,"down_votes":0,"body":"Disabling because of a bug sounds a lot better than disabling because of a \"lore\" event which in itself is completely stupid.\n\nYeah disable a champion someone worked for or god forbid payed for because of story purposes. I love lore like any RPG enthusiasts but to pull this, is dumb.","replies":[]},{"poster":"Simplicate","date":"2015-08-02T19:57:27.019+0000","up_votes":1,"down_votes":2,"body":"https://www.youtube.com/watch?v=kQTZI1HnxI8 there's the bug in action. If you are accusing Riot of purposefully making a bug then that makes no sense considering there's no need for it. If they wanted GP disabled because of lore they could have just said fuck you and disabled him anyway.","replies":[{"poster":"Zair Umbras","date":"2015-08-02T22:58:52.510+0000","up_votes":3,"down_votes":1,"body":"They disabled him because of Lore. MF took him out. It was all planned. They wouldn't disable him because Draven can get a max of 122gold on the next kill given he doesn't die before getting the kill. lol. In the 90 seconds to begin with, where you're waiting for minions to spawn before heading to lane, you can total 61 attacks with Draven's .679 attacks per second. To make it worse, as the video shows, Draven's base AS is actually quicker than his axe pick up, so he can't actually get all 61, but even if he could, that's only 122g. Compared to tahm who was able to get 300g off of killing his own teammates and never got disabled for it? Lol... Yeah, no. GP wouldn't be disabled over a POSSIBLE 122g.","replies":[{"poster":"Simplicate","date":"2015-08-03T23:40:37.316+0000","up_votes":1,"down_votes":2,"body":"It wasn't planned lol. Believe all the conspiracies from these boards that you want, I dont care. Even then who gives a fuck, he's gonna be back up in the next patch. But if it WAS for lore then you can't argue, it would be Riots decision that they wont revert until the event is over.","replies":[{"poster":"Zair Umbras","date":"2015-08-04T04:58:11.044+0000","up_votes":2,"down_votes":1,"body":"GP's death was planned... lol. The event had him 'killed'. He's coming back because it was planned... Anyone who thought he was going to be permanently killed off is silly. If you didn't see GP not being actually killed by his ship being destroyed and believed he was going to be permanently dead.. lol... I can't help people who didn't see this all coming. It was pretty obvious and them disabling him and repeatedly saying he was killed just made it even MORE obvious.","replies":[{"poster":"Simplicate","date":"2015-08-04T05:43:54.559+0000","up_votes":1,"down_votes":0,"body":"Like I said believe what you want, everyone has their own *opinion* and yes what you and I say is and opinion due to the fact that no Red has seriously approached the topic and said otherwise. Have a good day and kindly fuck off.","replies":[{"poster":"Zair Umbras","date":"2015-08-04T07:03:03.840+0000","up_votes":1,"down_votes":0,"body":"Every red ever has said it and a few have seriously approached the topic and said exactly what has happened. People like you don't ever seem to read the red posts and take them seriously... lol.","replies":[{"poster":"Simplicate","date":"2015-08-04T19:19:34.870+0000","up_votes":1,"down_votes":1,"body":"Non have seriously approached the topic, they all have come on to the boards acting like pirates and playing along with the lore. Send me a link of a red actually replying to someone about this in a non retarded or serious manner.","replies":[{"poster":"Zair Umbras","date":"2015-08-04T20:20:44.440+0000","up_votes":1,"down_votes":0,"body":"Right [here](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/bmtNEx52-riot-gp-being-disabled-is-getting-old-and-apparently-i-cant-be-upset-about-it?comment=00140030). People downvoted it to hell and back because you all think there's some conspiracy or some bull crap behind it all. It was all planned.","replies":[]}]}]}]}]}]}]}]},{"poster":"Rueian","date":"2015-08-04T05:46:12.002+0000","up_votes":1,"down_votes":0,"body":"The question is... did they fix the bug?","replies":[]},{"poster":"Radnar the bold","date":"2015-08-03T23:42:56.721+0000","up_votes":1,"down_votes":0,"body":"They disabled him because of the lore...............","replies":[]}]}