{"poster":"IwillADCarry1","date":"2018-02-08T14:55:46.924+0000","title":"Illyrian Gaming recluta","subforum":"Reclutamento","up_votes":1,"down_votes":3,"body":"Ciao evocatori !\r\n\r\nIllyrian Gaming recluta giocatori per il proprio team di league of legends.\r\n\r\nNon siamo una community dove si cazzeggia e si entra tanto per ,quindi il post e rivolto a coloro che cercano un gruppo serio e motivato per giocare in team , partecipare a tornei e crescere.\r\n\r\nCosa offriamo :\r\n\r\n+Discord ( miglior programma di communicazione online con membri sempre attivi )\r\n+ Supporto anche su whatsapp tranne che in game/discord per topic nuovi , chiarimenti sul gioco ecc\r\n+Tornei ( partecipazione giornaliera a tornei con montepremi in RP o Soldi Veri fino a 3000&euro; )\r\n+Boosting ( un pacchetto gratis di boost con i nostri migliori players // Determinati criteri servono come ( essere attivi , partecipazione a tornei ecc)\r\n+Coaching ( se siete un gruppo e vi serve un giocatore in pi&ugrave; o un coach abbiamo quello che f&agrave; per voi , vi seguir&agrave; un coach con il quale migliorare )\r\n+Team competitivo ( Illyrian Gaming nasce circa 6 mesi f&agrave; e dopo alti e bassi ha vinto circa 7 competizioni online con montepremi che superano i 30k Rp e 200&euro; in soldi Veri ) \r\n+Academia per i giocatori meno esperti ( vi seguiremo e potrette giocare anche con i nostri Diamond )\r\n+ Diventare Illyrians ! \r\n\r\nQuello che chiediamo ;\r\n\r\n- Et&agrave; superiore a 16 anni. Motivi legali per eventuali partecipazioni a tornei LAN e ovvi motivi di maturit&agrave; .\r\n- Rispetto per tutti i membri .\r\n-Educazione in game e sui social \r\n- Attivit&agrave; ( non chiediamo di essere sempre su discord ovviamente,ma si richiede attivit&agrave; e partecipazione nelle attivit&agrave; del clan )\r\n-Passione e Seriet&agrave; .\r\n\r\n\r\nSe state cercando un gruppo motivato , volete crescere anche se siete di elo basso/livello basso contattate in game  : JackFrost14 oppure IwillADCarry1 .\r\n\r\n \r\nBuona giornata e grazie del vostro tempo .","replies":[{"poster":"Jaaaames","date":"2018-02-08T16:32:46.940+0000","up_votes":4,"down_votes":0,"body":"Boosting\nForum ufficiale di LoL","replies":[]},{"poster":"Frattaglia","date":"2018-02-09T16:32:28.094+0000","up_votes":1,"down_votes":0,"body":"Ciao, vi ricordo che l'account sharing (e quindi il boosting giocando con l'account di qualcun altro) è vietato dal regolamento generale di lol.\nPer il resto buon divertimento.","replies":[]},{"poster":"Shiny Minny","date":"2018-02-08T15:46:32.767+0000","up_votes":1,"down_votes":0,"body":"Ho mandato la richiesta d'amicizia a entrambi, così appena becco uno di voi si fanno due chiacchiere {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}