{"poster":"hater free zone","date":"2017-03-28T21:04:51.036+0000","title":"Is 'high elo' exclusively for people who can carry themselves?","subforum":"Gameplay","up_votes":5,"down_votes":1,"body":"I&#039;ve been consistently gold for the past 3 seasons, but I just can&#039;t seem to break through the platinum ceiling. I have a strong understanding of the game, but I am just not good enough of a player to be able to get all the kills/gold and carry the game consistently.\r\n\r\nI can consistently top dmg chart while maintaining the least amount of damage received, and I can consistently top in ward placed and destroyed.\r\n\r\nIn my experience, the champions that I see being able to carry games are those that have great 1v1/assassination kits. \r\nI can see and understand where I mess up in games, but I feel trapped in a cycle where whatever lane I am not in, I have no control over the success.\r\n\r\nI feel like in order to be able to get into high elo, you have to be able do everything and pick up the slack of everyone else, often struggling against your own teammates mistakes.\r\n\r\nIs that all that separates high elo players from low elo, to just be good enough to play against stacked odds?","replies":[{"poster":"ThorHammerz","date":"2017-03-28T22:23:50.057+0000","up_votes":3,"down_votes":0,"body":"Individual skill can get you a good way up, but after a certain point you just get a MUCH better return on investment when you put your efforts into teamwork management (as a quick reminder, League of Legends is a 5v5 game). That's not to say individual skill isn't important: you still need it, but it's not going to get you all the way up.\n\n\nAre you capable of playing with a team-friendly attitude (e.g. minimal flaming of teammates when things go downhill)? When team morale goes into the shitter, so too your chances of winning (not that it's impossible... but just that much more difficult in what is likely an already difficult situation).\n\nAre you capable of handling map rotations with your teammates (deciding when to push, when to do / NOT to do Baron)? The game ends when you kill their nexus (which is done via killing turrets). Not when you get kills from chasing a low-HP champion halfway across a map when the rest of his/her team is dead.\n\nAre you capable of exerting more influence on the map than your opponent early/mid game (assassins can typically do this better / have more incentive to do) so that your team gets a larger snowball?\n\nExpanding onto the previous point, are you capable of not only getting yourself fed, but also capable at (force-feeding) securing your teammates an income flow (e.g. if you're hogging all the kills as an Eve jungle while your carries are left with only scraps... good luck).","replies":[{"poster":"hater free zone","date":"2017-03-28T22:36:21.457+0000","up_votes":1,"down_votes":0,"body":"Solid insight. I can defintely improve on knowing where and when to rotate/roam. I feel like I have a powerful grasp of early game performance/awareness but as the match rolls into mid/late game I feel more lost as to where I need to be on the map.","replies":[]}]},{"poster":"Moetaro","date":"2017-03-28T22:41:39.236+0000","up_votes":1,"down_votes":0,"body":"https://youtu.be/pI-XFRQ8qQI\n\nthis is a video of pants are dragon explaining why he quitted support and saying\n\n\"fuck support, you cant trust your team, you need to take all kills, take all gold, take all the jungle and  play something that can carry the shit out of your team\". \n\nAnd he's talking about not trusting masters and diamond scrubs, so... make your maths dude.","replies":[{"poster":"hater free zone","date":"2017-03-28T23:33:12.609+0000","up_votes":1,"down_votes":0,"body":"thanks for the link, I just watched it now. He brings up a good part about the ego. I can definitely work on minimizing tilt from poor shot calling and being more self-assured.","replies":[{"poster":"Leon Etoile","date":"2017-03-29T01:58:13.619+0000","up_votes":2,"down_votes":0,"body":"From what you said and looking at your match history; you seem to be playing too safe. What that means is you aren't pushing your champs to the limit. I think it is either/combo of you playing scared, playing I can't die or we lose and your champ pool is so big you don't actually know the limits of your champs.","replies":[]}]}]},{"poster":"SwiftKitten88","date":"2017-03-28T21:07:26.775+0000","up_votes":3,"down_votes":7,"body":"its less about \"your skill\" and more about whether your are willing to abuse the \"OP\" or play champs that can 1v5 carry","replies":[{"poster":"Who is Taliyah","date":"2017-03-28T23:41:34.282+0000","up_votes":1,"down_votes":1,"body":"That is wrong.\nI'm no meta sheep and I don't abuse \"OP\" champions, I just play what I love and what I'm good at. That was enough to bring me to where I am now and hopefully a bit farther soon.","replies":[{"poster":"SwiftKitten88","date":"2017-03-29T00:13:05.117+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TaliyahToMaster,realm=EUW,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=00000002,timestamp=2017-03-28T23:41:34.282+0000)\n>\n> That is wrong.\n> I&#x27;m no meta sheep and I don&#x27;t abuse &quot;OP&quot; champions, I just play what I love and what I&#x27;m good at. That was enough to bring me to where I am now and hopefully a bit farther soon.\n\nand if the champs you love to play able to 1v5 when fed like {{champion:157}}  its going to be a LOT easier to climb that it would be if you loved playing something such as {{champion:44}}  were and 100% reliant on your teammates not to walk out of your ulti like complete morons.\n(honestly this happens WAY to much)\n\ni unfortunately have to make up number to explain this.. but out of a scale of 1-100 skill level was \"50\"\nand they played carry champs like {{champion:157}} .. the vast majority of the time they would be a higher rank who had a skill lvl of \"60\" but played champs like {{champion:44}} . and therefore the CHAMPS have a bigger influence on your elo than your skill\n\nOBVIOUSLY  if you have a skill lvl 10 and you play carry champs your STILL not going to be as high an elo as a player who plays {{champion:44}}  at a skill level of 50..\n\nsimilar to  \"skill\" being a elo multiplier .4 and a \"champ\" multiplier of .6.\n if your skill is trash.. it donest really matter how good you are at a champ your still not going to climb very high...\n\nbut if your skill is decent.. your going to climb much faster by pickking more carry champs than you would by increasing you skill more.","replies":[{"poster":"Who is Taliyah","date":"2017-03-29T00:24:07.868+0000","up_votes":1,"down_votes":1,"body":"That doesn't make too much sense.\nYou can't make up numbers and say the champ you play matters more than your actual skill.\nWhat matters is your skill and entirely your skill.\nIf your map awareness is bad, it won't help that you play yasou, your team is still going to die because you didn't react.\nIf you play yasou but manage your wave wrong, then you could have played aurelion sol aswell, your lane management would still be off.\nYou can play the strongest meta champs you want, but if you call for baron at the wrong time or you do not follow your team when you actually have to take an objective, you're still going to lose.\n\nGame knowledge, skill and overall experience is what you need.\n\nBtw, if Yasou is such an easy champ to climb with, why is it that the most Yasou mains are in low elo.\nWhy are there Taliyah one tricks, pre rework-Aatrox one tricks and other one tricks in high elo when these champions are not so strong. It is because they know their champs, they know the matchups and they know what they have to do.","replies":[{"poster":"SwiftKitten88","date":"2017-03-29T00:55:42.152+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TaliyahToMaster,realm=EUW,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=0000000200000000,timestamp=2017-03-29T00:24:07.868+0000)\n>\n> That doesn&#x27;t make too much sense.\n> You can&#x27;t make up numbers and say the champ you play matters more than your actual skill.\n> What matters is your skill and entirely your skill.\n> If your map awareness is bad, it won&#x27;t help that you play yasou, your team is still going to die because you didn&#x27;t react.\n> If you play yasou but manage your wave wrong, then you could have played aurelion sol aswell, your lane management would still be off.\n> You can play the strongest meta champs you want, but if you call for baron at the wrong time or you do not follow your team when you actually have to take an objective, you&#x27;re still going to lose.\n> \n> Game knowledge, skill and overall experience is what you need.\n> \n> Btw, if Yasou is such an easy champ to climb with, why is it that the most Yasou mains are in low elo.\n> Why are there Taliyah one tricks, pre rework-Aatrox one tricks and other one tricks in high elo when these champions are not so strong. It is because they know their champs, they know the matchups and they know what they have to do.\n\narg let me try this again..\n\n\"after you reach a certain skill, improving your elo further becomes less dependent on your skill improvement than the champions you play\"\n\nthat's the best  i can come up with to explain what i was trying to say.. and yeah i really DID word that OP pretty badly\n {{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]},{"poster":"Limmie","date":"2017-03-28T21:14:30.541+0000","up_votes":1,"down_votes":0,"body":"If that was true you wouldn't see people climbing from unranked to diamond with Aatrox or Urgot, nor FOTM chasers permabronzed.","replies":[{"poster":"SwiftKitten88","date":"2017-03-28T21:19:40.699+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Limmie,realm=NA,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=00000001,timestamp=2017-03-28T21:14:30.541+0000)\n>\n> If that was true you wouldn&#x27;t see people climbing from unranked to diamond with Aatrox or Urgot, nor FOTM chasers permabronzed.\n\ni said \"LESS about skill\" not that \"skill was completely irrelevant\"...  besides.. maining a champ that no one is ever used to facing is actually quite a benefit if your good at it.","replies":[{"poster":"Limmie","date":"2017-03-28T21:30:33.368+0000","up_votes":1,"down_votes":0,"body":"I used to have like a 80% winrate with old Yorick because nobody had any idea about what he did. I miss those times.","replies":[]}]},{"poster":"Asayake 5150glow","date":"2017-03-28T22:14:17.816+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Limmie,realm=NA,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=00000001,timestamp=2017-03-28T21:14:30.541+0000)\n>\n> If that was true you wouldn&#x27;t see people climbing from unranked to diamond with Aatrox or Urgot, nor FOTM chasers permabronzed.\n\nI've seen a Diamon Aatrox onetrick lmao","replies":[]}]},{"poster":" Milla Jovovich","date":"2017-03-28T21:12:36.865+0000","up_votes":2,"down_votes":0,"body":"They should really consider making Boards for Silver.","replies":[]}]},{"poster":"Psybicilin","date":"2017-03-28T21:10:48.324+0000","up_votes":2,"down_votes":0,"body":"You can get to high elo with every role, it's just a lot faster if you pick snowball/roaming champions and get fed.","replies":[]},{"poster":"Who is Taliyah","date":"2017-03-28T23:38:10.309+0000","up_votes":2,"down_votes":1,"body":"One of my favorite aspects about Taliyah is her roaming and snowball potential.\nPlay champions that snowball hard. Help out your team whereever you can. \nAdc is the worst role to snowball as you will never be able to leave the lane.\nJungle would be best in that aspect. Midlane roam champions, Toplane with teleport, support roaming midlane, these are the best ways to secure your team won't fall behind.","replies":[]},{"poster":"Frightning","date":"2017-03-29T06:38:02.613+0000","up_votes":1,"down_votes":0,"body":"Sounds to me like you have sound fundamentals, but haven't really learned macro play yet. It's one thing to be mechanically competent and have good fundamentals and game knowledge, but there is no substitute for understanding macro play. To illustrate just how powerful macro is: I routinely win games for my team even when I'm not fed, or even shutdown. Most often, I do so by shotcalling for my team (which is why the #1 thing teammates sometimes do that irks me is not following my shotcalls). For a hilarious example: I managed to win a 1v1 (fought all the way to Nexus kill) as Janna by simply out-rotating my opponent and split-pushing his towers in. Map rotations, timing and objective control. Those are the fundamentals to macroplay. The best role to learn macroplay from, imo, is jungle, because there, you are practicing macro level decision making from the very start of the game (which side of jungle do I start at, what route, do I invade, if so, when? When and where do I gank, etc...).","replies":[]},{"poster":"DunkinNoobs","date":"2017-03-29T06:18:34.125+0000","up_votes":1,"down_votes":0,"body":"No. There's more than one way to win a game, and carrying all the time is just one of those ways.","replies":[]},{"poster":"Troll for Trump","date":"2017-03-29T03:08:03.356+0000","up_votes":1,"down_votes":0,"body":"High elo players just know how to work with their team","replies":[]},{"poster":"FooDang","date":"2017-03-29T00:33:52.129+0000","up_votes":1,"down_votes":0,"body":"High Elo is for players that make less mistakes.\n\nWhen you die and say to yourself \"Yea, I fucked up\" thats the reason why you cant climb. \n\nHigh Elo players do say this to themselves, but less often.\n\nRepeating those mistakes only keeps you where you are at.\nLearning from those mistakes will allow you to climb.","replies":[]},{"poster":" Milla Jovovich","date":"2017-03-28T21:11:24.321+0000","up_votes":2,"down_votes":2,"body":"You can be at least Diamond by just pulling your weight every game,you don't need to be the best on your team.\n\nJust learn to do your part and climbing will start.","replies":[{"poster":"RK N0va","date":"2017-03-29T00:29:16.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mudrensen,realm=EUNE,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=0002,timestamp=2017-03-28T21:11:24.321+0000)\n\n> Just learn to do your part and climbing will start.\n\nI like that, I'ma start using that now.","replies":[]}]},{"poster":"JavelinJoe","date":"2017-03-28T23:35:08.804+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=IR4s4QswGS4\n[video](https://www.youtube.com/watch?v=IR4s4QswGS4)\nFrom 1:26-2:08 to learn what it takes to be good.\nThen from 2:20-3:15 you will learn why you will always lose.","replies":[]},{"poster":"SwaggyMcGhee420","date":"2017-03-28T21:36:21.737+0000","up_votes":1,"down_votes":0,"body":"It's definitely a lot easier to climb if you can consistently carry, but if you are a reliable player who does well most of the time, you'll climb eventually, it will just take a little while longer.","replies":[{"poster":"Rain Smurff","date":"2017-03-28T21:39:39.369+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SwaggyMcGhee420,realm=NA,application-id=3ErqAdtq,discussion-id=auy1bthN,comment-id=0004,timestamp=2017-03-28T21:36:21.737+0000)\n>\n> It&#x27;s definitely a lot easier to climb if you can consistently carry, but if you are a reliable player who does well most of the time you&#x27;ll climb eventually, it will just take a little while longer.","replies":[]}]},{"poster":"Finn Teh Human","date":"2017-03-28T21:35:56.201+0000","up_votes":1,"down_votes":0,"body":"There is a huge difference between Silver - Gold - Platinum players. Most players are Silver. Platinum is where you start seeing that it's not just pure skill that wins games, it's teamwork. I got into Platinum easy through mechanics. But mechanics can't win you a game when your team doesn't want to group or work to get objectives. Gold is usually where you can win easily off of knowing what to do and when, you don't really have to be good mechanically to get into Gold. I've seen Singed, Orianna, Shaco, and Zac's carry games. (Just to name a few.) But they knew what to do and when.","replies":[]}]}