{"poster":"Rule The Jungle","date":"2015-10-28T21:03:58.330+0000","title":"Dringend Hilfe bitte! Versuche es schon den ganzen Tag zu lösen!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe mich heute erneut vor dem Pc gesetzt und habe LoL ( wie immer ) gestartet. \r\nDas Problem ist nun, dass der LoL Client sich nicht &ouml;ffnet und im Task Manager auch nichts davon steht. Ich habe im LoL Forum schon nach L&ouml;sungen gesucht, wobei die das selbe Problem wie ich hatten, aber dies hat nicht funktioniert. ( Ich sollte zB dateien unter RADS\\projects\\... l&ouml;schen )\r\nNachdem dies nicht funktioniert hat, hat jemand empfohlen LoL zu deinstallieren und wieder zu installieren also habe ich dies auch gemacht.\r\nVergeblich trifft das selbe Problem auf obwohl ich Adminrechte verwendet habe. Auf Youtube habe ich nach L&ouml;sungen gesucht und die einzige Hoffnung f&uuml;r mich war, das eventuell meine Firewall es blockiert also habe ich der Firewall erlaubt. Aber dennoch hat es nicht funktioniert. Seid 3 Jahren League Of Legends ist mir noch nie so etwas passiert :( {{summoner:1}} Ich bitte sehr um Hilfe an jeden der sich damit in irgend einer Weise auskennt! :)","replies":[{"poster":"Rule The Jungle","date":"2015-10-28T21:50:15.145+0000","up_votes":1,"down_votes":0,"body":"Es wäre sehr nett wenn jemand Lösungen zu diesem Problem schreiben könnte damit ich diese eventuell anwenden könnte.\nIch muss jetzt leider erstmal weg aber schaue morgen sofort wieder rein und hoffe auf Lösungen zu diesem sehr merkwürdigen Problem :/\nGn8 und danke an alle die diese \"Diskussion\" gelesen haben und eventuell noch eine Lösung dazu haben.","replies":[{"poster":"Fairez","date":"2015-10-29T17:38:58.509+0000","up_votes":1,"down_votes":0,"body":"Wie sieht es denn mit den Log Dateien aus, wurden welche erstellt?\n\nHast du die Lösungsmöglichkeiten in der Toolbox schon probiert?\n> > * Stelle sicher, dass du alle Windowsupdates und Service Packs installiert hast\n> * Achte darauf, dass LoL nicht unter C:\\Programme, C:\\Programme(x86) oder in User-Ordnern installiert ist\n> * Öffne den Ordner **C:\\Riot Games\\League of Legends\\RADS\\projects** und lösche den Ordner **lol_launcher**\n> * Lade diese Datei runter:\n>   * deutsch: http://wrenchbox.de/download/LoLRADS_EUW_german.zip\n>   * englisch: http://wrenchbox.de/download/LoLRADS_EUW.zip\n> * Entpacke die Datei\n> * Verschiebe die darin enthaltenen Dateien (**lol.launcher.exe, lol.launcher.admin.exe und den Ordner RADS**) in deinen Installations-Ordner von LoL.\n> * Ersetze alle Dateien und Ordner\n>   * Solltest du nicht gefragt werden, ob du vorhandene Ordner oder Dateien ersetzen willst, hast du etwas falsch gemacht\n> * Starte den Patcher\n> \n> Der Patcher sollte nun wieder funktionieren. Das Spiel sollte also problemlos starten.\n\n-> http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0006\n\nDas Problem was du beschreibst kann verschiedene Ursachen haben. Teilweise liegt es am Antivirenprogramm oder der Firewall. Es können auch andere Programme dafür verantwortlich sein. \n\nEventuell kannst du noch eine Prozessliste hochladen, näheres dazu findest du hier:\n-> https://support.riotgames.com/hc/de/articles/201752674-Netzwerk-System-und-League-of-Legends-Logs#wq3","replies":[]}]},{"poster":"Fairez","date":"2015-10-28T21:16:15.243+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nschau bitte mal ob ein rads_user_kernel.log und/oder PatcherLog erstellt wurde und lade diese gegebenenfalls hoch. Wo du die Dateien findest erfährst du hier:\n-> http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0000\n\nHast du eventuell irgendwelche neuen Programme installiert?\nFirewall und Antivirenprogramm testweise schon mal komplett deaktiviert?","replies":[]}]}