{"poster":"Sirrkas","date":"2018-03-01T13:37:18.882+0000","title":"Über den Dev-Real-Talk: Die Gegnersuche","subforum":"Allgemeiner Chat","embed":{"description":"Schließen Stelle eine Frage zu Riot oder LoL, und wir werden versuchen, sie zu beantworten. Die Antworten werden jeden Donnerstag um 22:30 Uhr (MEZ) veröffentlicht. Anmelden, um eine Frage zu stellen Bei „Frag Riot\" wird immer wieder gefragt, wie wir deine Teamkameraden und Gegner bestimmen.","url":"https://nexus.leagueoflegends.com/de-de/2018/02/dev-matchmaking-real-talk/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2018/02/LOL_CMS_185_Social_1200_zcagmw8ri4fi5sksx1dq.jpg"},"up_votes":1,"down_votes":0,"body":"[In diesem Beitrag von Riot](https://nexus.leagueoflegends.com/de-de/2018/02/dev-matchmaking-real-talk/) wird einiges &uuml;ber das Matchmaking erkl&auml;rt. F&uuml;r die alten Hasen, die sich das durchlesen: Das &quot;GSW&quot; soll Gegnersuchwertung bedeuten und ist im Grunde der deutsche Begriff f&uuml;r MMR (Matchmakingrating). \n\nInteressant an dem Beitrag finde ich, dass viele Sachen erw&auml;hnt werden, die wir auch immer erkl&auml;ren, wenn das Gespr&auml;ch auf MMR, Wertung der Mitspieler etc. f&auml;llt. Teilweise ist es genau das, was einige aktive Forenmitglieder von sich geben. Wer sich mit dem Thema schon befasst hat, kann hier vielleicht noch kleine neue Informationsschnipsel finden. \n\nIch versuche den kurz in eigenen Worten zusammenzufassen. Ein paar wichtige oder f&uuml;r mich neue Stellen werde ich zitieren.\n.\n.\n___\n.\n.\n.\n**Zu un-/ausbalancierten Spielen:**\n\nKleine Vorteile im fr&uuml;hen Spiel, sollen die M&ouml;glichkeit bieten, daraus einen Sieg zu machen. \n\nDie erwartete Siegeschance jedes Teams betr&auml;gt meistens etwa 50 %. Es hat aber auch ein wenig Spielraum beim zusammenstellen der Teams.\n\nDas System kann aber nicht im Voraus wissen, ob jemand gerade einen schlechten Tag hat oder zu m&uuml;de ist, um durchschnittliche Leistung abzuliefern. Ob jemand neue Champions oder Rollen testet etc.\n\nDas System ist nicht perfekt.\n\n.\n.\n**Warum werden mir die schlechten Mitspieler/starke Gegner bei Siegesstr&auml;hnen gegeben**\n\nWie nicht anders zu erwarten steht hier, das gibt es nicht. Wer besser wird, wird als st&auml;rker angesehen und kriegt st&auml;rkere Mit- und Gegenspieler, wodurch man selber nicht mehr so sehr heraus sticht. \n\nDer Abstiegsschutz soll zudem verhindern, durch Pech abzusteigen.\n\n.\n.\n**Warum treffe ich im Normal auf Gold/Platin/Dia**\n\nWeil die MMR/GSW von Normals und Rankeds unabh&auml;ngig zueinander sind. \n\nAuch der Diaspieler soll im Normal die M&ouml;glichkeit haben, Sachen auszuprobieren. \n\nWer im Normal &ouml;fter verr&uuml;ckte Sachen testet, kann da eben auch deutlich schw&auml;cher als im Ranked sein.\n\nWichtig ist wohl vor allem dieser Abschnitt, es ist nur eine Ank&uuml;ndigung, sich das anzusehen, also wird es wohl noch eine Weile dauern:\n\n>Dennoch glauben wir, dass es Raum f&uuml;r Verbesserungen gibt. Wir sehen uns gerade ein paar Optionen an wie einen besseren Algorithmus, der in k&uuml;rzerer Zeit eine genauere GSW erstellt, oder eine teilweise &Uuml;bernahme der GSW aus Ranglistenspielen f&uuml;r ungewertete Spiele ohne direkte Verbindung.\n\n.\n.\n**Warum treffe ich als Bronze/Silber/Goldspieler auf Unrankeds?**\n\nDie neuen Spieler m&uuml;ssen irgendwo anfangen, das ist eben Silber, von da aus k&ouml;nnen sie fr&uuml;h h&ouml;her oder niedriger platziert werden. Man muss eben noch herausfinden, wie gut sie sind und wo sie hingeh&ouml;ren.\n\nEin Punkt den ich bisher noch nicht kannte oder in Betracht gezogen habe:\n>Wir m&uuml;ssen sie Spielern zuweisen, &uuml;ber die wir bereits jede Menge Informationen haben, um ihre Platzierung m&ouml;glichst genau bestimmen zu k&ouml;nnen. \n\n.\n.\n**Warum sind blockierte/gemutete/gemeldete Spieler nicht aus meinen Spielen ausgeschlossen?**\n\nSo eine Funktion w&uuml;rde das Matchmaking gewaltig st&ouml;ren, auch wenn nur wenige das ausnutzen w&uuml;rden.\n\n.\n.\n**Bewertung nach KDA und anderen Faktoren, statt nach MMR**\n\nMan k&ouml;nnte das System &uuml;berlisten, indem man statt f&uuml;r das Team und auf Sieg zu spielen, nur f&uuml;r die eigene Wertung spielt. \n\nSpielz&uuml;ge, die zu einem Sieg f&uuml;hren, k&ouml;nnten so nicht belohnt werden. Etwa, der Assassine, der die gegnerische Backline ausschaltet, der Tank, der 3 Gegner abh&auml;lt oder der Supporter, der sich opfert um das Team zu retten. \n\nEinige Champions k&ouml;nnten nicht einmal wirklich bewertet werden, wenn man das &auml;ndern m&ouml;chte, hier sind Singed und Nunu kurz erw&auml;hnt.\n\nEs wird an Systemen gearbeitet, die Erfolge Belohnen sollen. Hier wird etwas aufgef&uuml;hrt, wie Sichtwertung und spezielle Missionen.\n\n.\n.\n**Warum ist die MMR nicht &ouml;ffentlich sichtbar?**\n\n[5 Jahre alter Beitrag verlinkt.](http://forums.na.leagueoflegends.com/board/showthread.php?t=3712300&amp;page=114#post40484597)\n\nDas anzeigen der MMR hat viele Nachteile.\n\nVorteil: Die Leute f&auml;nden es wohl fairer, wenn bei allen die MMR steht. Vermutlich ist sowas gemeint wie, bei beiden Teams steht MMR 1120  bis 1140, bei jedem Spieler. \n\nNachteile:\nDas hier kann ich nicht ganz nachvollziehen\n>Wenn wir die GSW jedoch als einzige Messlatte f&uuml;r den Erfolg in League nehmen w&uuml;rden, w&uuml;rden wir die H&auml;lfte aller Spieler bestrafen, da sich ihre GSW im Verlauf einer Saison verschlechtert, obwohl sie sogar besser werden &ndash; nur wird jeder andere um sie herum ebenfalls besser.\n\nEs f&uuml;hlt sich besser an, eine Division oder Liga aufzusteigen, als die MMR von 1595 auf 1600 anzuheben. \n\nDer Abstiegsschutz bewahrt einen etwas vor der Angst, den Rang gleich wieder zu verlieren. Hier ist aber wieder ein Teil, den ich nicht so recht verstehe:\n>Au&szlig;erdem sch&uuml;tzt dich das Ligasystem bis zu einem gewissen Grad davor, mehrere Spiele in Folge und somit auch deine gute GSW zu verlieren.\n\nSoweit wir das Verstanden haben, w&uuml;rde sich die MMR ja trotzdem &auml;ndern, wenn man etwa auf Gold 5 mit 0 LP mehrmals verliert, aber nicht absteigt. Man tritt dann ja nicht umsonst gegen mittleres Silber an.\n\n.\n.\n**Schwankende LP Gewinne und Verluste in Master/Challenger**\n\nWenn man eine Weile nicht spielt, spielen die anderen dennoch weiter Rankeds. Dadurch soll sich die MMR der anderen in dem Bereich weiter verbessern, die eigene stagniert aber. Spielt man dann wieder (etwa nach einem kurzen Urlaub) kriegt man wohl weniger LP, da die eigene MMR aktuell zu niedrig f&uuml;r Master/Challenger ist.\n\n___\n\nWenn ihr mögt, können wir uns jetzt ein wenig darüber unterhalten, was an dem Beitrag nicht ganz passt oder vielleicht schlecht erklärt ist. ","replies":[{"poster":"Kind Prow","date":"2018-03-01T14:05:08.674+0000","up_votes":1,"down_votes":0,"body":">Nachteile:\n>Das hier kann ich nicht ganz nachvollziehen\n>\n>Wenn wir die GSW jedoch als einzige Messlatte für den Erfolg in League nehmen würden, würden wir die Hälfte aller Spieler bestrafen, da sich ihre >GSW im Verlauf einer Saison verschlechtert, obwohl sie sogar besser werden – nur wird jeder andere um sie herum ebenfalls besser.\n\nGanz einfach. Sagen wir, man startet mit 1200 GSW nach einranken. Im Laufe der Season schaffen es immer mehr Spieler sich einzuranken oder überhaupt mal Ranked zu spielen. Und offenbar ist der/die GSW abhängig von der Gesamtanzahl der Spieler. Somit wird der GSW kleiner, rutscht vielleicht auf 1100, während man selbst aber aufsteigt nach Gold, oder höher.\nDer Wert steigt, aber die Zahl sinkt. nun könnten Spieler aber davon ausgehen, dass der Wert bleibend ist und unzufrieden damit sein, dass er sinkt. Was nachvollziehbar ist.","replies":[{"poster":"Sirrkas","date":"2018-03-01T14:31:21.566+0000","up_votes":2,"down_votes":0,"body":"Nach dem Post habe ich den Beitrag auf deutsch und English noch mal an der Stelle verglichen. War im Grunde das gleiche. Ich glaube aber, ich habe eine Möglichkeit gefunden, die man das erklären kann. \n\nDa in beiden Varianten von der Hälfte der Spieler gesprochen wird und bei dem Beitrag zu Master+ davon geredet wird, dass die MMR in dem Bereich immer weiter steigt. Kann ich mir das gerade am ehesten so vorstellen, dass die MMR von der unteren Hälfte der Rangliste stetig nach oben wandert. \n\nSo würde zum Beispiel Silber 5 am Seasonanfang vielleicht einer MMR von 1400 entsprechen. Aber am Seasonende hat man vielleicht nur noch 1200, wenn man regelmäßig spielt. Wenn man davon ausgeht, dass man in dem Jahr etwas dazu gelernt hat, zum Beispiel ein wenig besser lasthitten, ein wenig besser traden etc. wäre man am Ende besser als vorher, aber eben noch Silber 5 Niveau, hätte aber vielleicht seine MMR trotzdem reduziert.","replies":[]}]}]}