{"poster":"Penguinknight","date":"2016-07-09T10:15:48.072+0000","title":"A Slow Death","subforum":"FanFiction","up_votes":5,"down_votes":3,"body":"&ldquo;COME OUT AND FACE ME COWARD!&rdquo;\nThe bandit was bordering on insanity. He was the last of 30 that had set out through the forest, his associates and leader all somewhere behind him, contorted bodies motionless beneath the trees. And he still knew nothing of the attacker save for small rustlings and echoes of emotionless laughter.\n\n&ldquo;COME OUT AND FIGHT!&rdquo; he roared. Again the vegetation responded only with silence.\n\nHe needed a proper battle. One where he could see his enemy before cleaving them in two. Physical training could not have possibly prepared him for this psychological warfare; an attack leaving him defenceless. The thug&rsquo;s nerves were strained to breaking point, every shadow was a foe and every whisper of the wind a leaping attacker. A movement up ahead. He raised his axe and rushed to destroy whoever responsible for the murder of his gang.\nThe brigand barely made 10 meters before an explosion detonated beneath his feet. Green toxin erupted, his vision swam and his throat swelled, choking on air. A searing pain flashed behind his knees and legs buckled. He was landed face to face with the orchestrator of torment.\nEyes glowed red and a respirator hissed beneath a green hood.\n&ldquo;Surprise.&rdquo; The figure&rsquo;s arm jerked upward and the bandit was no more.\n\nTeemo ripped his knife free from the dead body. Blood oozed out of the puncture wound under the jaw, coalescing into a thick blob. The poison always did its job well. Fighting fair was a good way to die.\n&ldquo;Better than what you deserve.&rdquo; He told the corpse.\nThere was a time when he didn&rsquo;t use poison. There had been a time when he worked with a team. Both had ended long ago, the exact date of which was blotted out on restricted documents kept in a restricted archive. Only Teemo knew that those records no longer existed. Omega Squad no longer existed, and it never had. Anything concerning the group had been destroyed. Anything to help him forget that other 5 members were all dead. To forget how he had killed them.\n \n> _The group sped across the rooftops of Zaun, heavily polluted air rustling their fur as they made their way to the target&rsquo;s laboratory. Smoke drifted upwards into a yellowed haze of a sky, and urchins ran around below in the streets. The objective was simple: eliminate the threat. Kill the mad-scientist experimenting with dangerous chemicals. Make it so he could never supply them as weapons. Kill Singed._\n\nThe journey back to Bandle City was long, branches scraped Teemo&rsquo;s cloak as he drifted through the forest; alone with the past, from which one could never shake free. You can learn to deal with it, to cope with your mistakes; but never truly fix them.\n\n> _Singed worked alone in his lab amidst the chaos of cluttered shelves and benches, completely engrossed in his work. Teemo remained on the roof while the rest of Omega Squad moved into position, trusting him to do his job._\n\nThey had trusted him, and now they were all dead. Teemo suddenly dropped to the ground, blowgun drawn. Never let your guard down. The rustling got closer. He loaded the chamber. A ferret scampered out of the bushes, sniffing for food. Teemo relaxed. Still oblivious to his presence, it began to move off, occasionally poking its nose around in search for things to eat. He placed a dart in its back.\n\n> _Singed was surprisingly fast. The shelving made it impossible to make a shot, and the team had to be careful so as not to break any of the beakers. Their target had no such qualms. Singed `sped down the aisles, either the product of panic, practice, or sheer recklessness. They changed tactics. Singed had to be driven out from the cover of the shelves. Towards the door. Teemo made the shot.\n> Sometimes, time stands still, and all you can do is watch. A misplaced step, a falling jar. Deflection. An impact in the shoulder and not the chest. Stumbling. A crash. Toppled shelves, released chemicals. Screaming. And so they had died. Images of agony and suffering forever branded into his memory._\n \nThe gradient of the earth increased as Teemo ascended the Sablestone Mountain Range that sheltered Bandle City. Once he reached the fallen tree with scratches around the base he made a sharp turn right.  53 paces later he pulled the fern on his left. Out with it came a wooden board. Entering the room behind, he closed the door shut behind him.\nThe Interior was dimly lit. He removed his gear, replacing the cloak, goggles, and respirator with his trademark bowl-shaped hat and smile. Because Omega Squad wasn&rsquo;t meant to exist, neither was its equipment. But he would continue to don the mantle, and through every foe that he killed the legacy of the team would live on.\nOmega squad may no longer exist, its members may be dead, but that did not mean that Teemo would not honour them. Inside memorabilia lay on a table. Medals, photos, and souvenirs taken from the teams&rsquo; operations, strewn haphazardly on the wooden surface. A small gap lay bare. A small spot to him that was frighteningly large. Every time he returned from patrol it was there to remind him that although death had given his comrades release they did not find solace.\n\n> _Teemo had to settle the score. This time it was not a pre-emptive strike to protect Bandle City. This time it was vengeance, and very personal. Ironically, everything was like the day when Omega Squad had burned. Again Singed worked alone, completely unaware of his presence. Teemo made the shot; but this time he fired not one dart, but 5. One for each friend he had lost that day. This time each were threaded with the deadly Ajunta poison; Singed would suffer as his team had suffered. And this time Teemo did not miss._\n> \n> _The razor sharp darts barely pierced the skin. Self-experimentation had hardened it into armour, and when Singed began to run it was clear that he was beyond the constraints of humanity. He moved faster than what was naturally possible, and did not falter when a dart buried into his leg. Explosions rocked the air as traps detonated. Still Singed ran on through the noxious cloud, laughing all the while._\n> \n> _In vain were the sacrifices of his comrades. In vain they had suffered agony. In vain mouths had foamed and arteries swelled then burst.  Teemo could not complete the mission that his friends had all died for. He would have wept out of anger and frustration; but there were no tears left to shed._\n\nBandle City was a merry utopia. Teemo felt out of place amongst the optimism of the other Yordles, though by now counterfeiting emotions came almost as naturally to him as ending a life.\n&ldquo;Hiya Teemo!&rdquo; called a cheerful voice. As always there was a big smile on Tristana&rsquo;s face, and a boundless enthusiasm for life that spread to everyone around her. Excited enough to rocket-jump through the middle of town. &ldquo;How was patrol?&rdquo;\nNormally Teemo hated discussing military matters, but with Tristana it was tolerable. She was in service herself, in the megling commando group, and understood what battle was like. Though it did not mean she could understand him.\n&ldquo;Quiet.&rdquo; he replied, &ldquo;I got bored of walking past empty traps and watched a ferret.&rdquo;\n\nShe chuckled, large pointed ears laughing with her. It was a pleasant sound.\n\n&ldquo;You know the purpose of patrolling our borders is to defend Bandle city; not observe the wildlife right?&rdquo; The teasing made Teemo feel welcome, but he knew that it was for the mask he wore, not who he was underneath. &ldquo;Well I&rsquo;ve got to race,&rdquo; Tristana continued, &ldquo;training&rsquo;s on soon and I gotta blast some targets. See you later!&rdquo;\n\nTeemo watched her form disappear, giant cannon swinging by her side. He wished he could join her. \nAlthough the single ray of light amongst the darkness and trauma of his world, Tristana was also its greatest pain. As much as he wanted to return the kindness, but he could not become attached. Teemo feared little. Not sword nor axe or even death. But he could not open himself to the risk. Never again could he undergo the anguish of losing someone close. To never be able to tell them the things he wanted to say. Neither could he risk disclosing the past. Though his path would be lonesome, it was best that it be this way. Teemo had served his people in the field; and he would continue to serve them by allowing them continue in ignorance of what he had become.","replies":[{"poster":"Fyooosh","date":"2016-07-15T15:20:17.432+0000","up_votes":1,"down_votes":0,"body":"I cannot stand Teemo in game, but I won't hold that against you for this great story =P Well-crafted, I like how you've built upon the omega squad version - I love reading 'hidden' sides to characters, or alternate versions based on very little information. Good job!","replies":[]},{"poster":"AdcStoleMyAs5ist","date":"2016-07-10T01:25:29.290+0000","up_votes":1,"down_votes":0,"body":"Save for his happy-go-lucky/psycho split personality, his flipped-out legendary skin (that I'm pretty sure is confirmed to represent his other side?) and the ship tease with Tristana, I guess there isn't a whole lot about Teemo that we know of - he's one of those champions that Riot's just left in the dumpster in terms of lore. \nTo be completely honest, You've done a really good job bundling all of that into this character in a coherent, believable manner that both answers and asks questions about who this _rat_ is. \n\nNot bad - you've got guts for writing about Teemo and expecting us to read it, much less _like_ it lol.\n\ngift singed all","replies":[]},{"poster":"Penguinknight","date":"2016-07-09T10:20:05.374+0000","up_votes":1,"down_votes":0,"body":"Plz no downvote because of Teemo hate  {{champion:17}} {{item:3070}}","replies":[]}]}