{"poster":"360 no hotdog","date":"2017-06-04T07:56:04.044+0000","title":"Skins 4 Annie","subforum":"Player Creations","embed":{"description":"Candyland Annie Art and Idea by me I thought of this one a really long time ago, but never got to drawing it til now. Tibbers is a gummy bear (or at least i tried to make him look gummy..) and she'...","url":"http://saintprecious.deviantart.com/art/League-of-Legends-Annie-Skin-Idea-366266404","image":"http://t15.deviantart.net/HKgWtwBBzPqhVKWMMHvDTBnucgA=/fit-in/300x900/filters:no_upscale():origin()/pre08/95e6/th/pre/i/2013/107/e/6/league_of_legends_annie___skin_idea_by_ayashiroi-d622cys.jpg"},"up_votes":2,"down_votes":0,"body":"I&#039;ve been looking through the inter webs and found some skin ideas for Annie . My first one \r\nI found on devianart ( I have a link to it) anyway it would be:\r\n- Candyland Annie. Tibbers as a gummy bear!! [go to the page if you want to see more]. \r\n-Academic: Annie is in a school uniform, and Tibbers is a spectacled bear with glasses and a vest on- he looks like a teacher of some sort. Annie&#039;s lines and animations are redone so that she says the same things, but more intelligently. \r\n-Infernal (Or as I like to say , Hellborn Annie) : Annie&#039;s lost control of her fire powers, and her hair is bright red and in a style that looks like horns. She has fire in her otherwise blank eyes, and her hands never stop being ablaze. She gets new lines and a more angry voice over to reflect this lack of control, and she leaves behind little flames wherever she skips for a couple of seconds. Tibbers is completely engulfed in flames, with the exception of his protruding claws. \r\n-Ringleader: Annie is dressed up like a ringleader. Tibbers is dressed up like a clown with face paint and everything, and he rides around on a comically undersized unicycle. When Annie attacks, it looks like the fire comes from her ringleader&#039;s whip. New lines are added to reflect the theme, and her recall has her tossing an untransformed Tibbers through a tiny hoop of fire. \r\n\r\nand there you have some of the ones I found and yeah I&#039;d really hope riot makes one of these (Remember these were not MY ideas)","replies":[{"poster":"Akkordian Zoeve","date":"2017-06-05T02:30:59.149+0000","up_votes":1,"down_votes":0,"body":"I would love the Infernal one as a Legendary or Ultimate skin. But anything less than that would probably result in not much effort and change.\n\nPersonally, the Academic one doesn't really fit with Annie (since she's about 8, and WAAYYYY too young for an academy or high school).","replies":[]},{"poster":"Blamzite","date":"2017-06-04T14:58:54.607+0000","up_votes":1,"down_votes":0,"body":"The one which gets other champs more skins\nSome champs only have 1-2 skins annie dosent need more","replies":[]},{"poster":"Fitzky","date":"2017-06-04T11:43:21.608+0000","up_votes":1,"down_votes":0,"body":"Annie is one of the champs with the most skins in the game she doesn't need anymore thank you leave new skins for Yorick and Illaoi","replies":[]},{"poster":"360 no hotdog","date":"2017-06-04T08:36:07.823+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}}","replies":[]}]}