{"poster":"IrrationalNumber","date":"2015-10-01T08:26:49.812+0000","title":"Forse il freelo di riven sta per giungere al termine","subforum":"Campioni e gameplay","embed":{"description":"The PBE has been updated! Continue reading for more information! ( Warning: PBE Content is tentative and iterative - what you see may not reflect what eventually gets pushed to live servers! Manage your expectations accordingly. ) ! * Remember *: The PBE is a testing grounds for new, tentative, and sometimes radical changes.","url":"http://www.surrenderat20.net/2015/09/930-pbe-update.html","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":4,"down_votes":4,"body":"Riven&#039;s abilities charge her blade, causing her next basic attack to deal an additional [20% - 50%] physical damage. If Runic Blade damages an enemy champion, Riven gains 20 Edge.  \r\nRiven&#039;s damage is increased by up to 10% based on how much Edge she has. If she hasn&#039;t gained Edge in the last 10 seconds, Riven begins to lose her Edge at the rate of 10 every second.  \r\nBonus Damage: X&quot;\r\n\r\nPassive is now on next basic attack rather than stacking up to three times.\r\nPassive now generates a new resource called Edge.\r\n10 Edge = 1% damage increase.\r\n\r\nBlade of the Exile (R) - Instead of increasing damage based on missing health, Wind Slash now consumes all Edge on use and increases in damage based on that.\r\n0 Edge = minimum damage &amp; 100 Edge = the maximum damage.\r\n\r\nSistema simile a quello di Renekton, ma almeno non dovrebbe piu&#039; oneshottarti in una combo.\r\n\r\nBye Riven, ripperoni tu e la tua skin da battlebunny, il tuo laugh spam e la tua fanbase di tossiconi.","replies":[{"poster":"TheNamelessOne89","date":"2015-10-01T08:45:50.760+0000","up_votes":4,"down_votes":0,"body":"Halleluja","replies":[]},{"poster":"TerrorVodka","date":"2015-10-01T08:53:33.818+0000","up_votes":5,"down_votes":2,"body":"in realtà il regno di terrore dei riven mains è finito con i nuovi juggernaut che la stuprano male in top.\nquesto aggiornamento aspetto lo mettano live per capire come cambierà le cose, sta di fatto che \nGODO COME UN PORCOSPINO RIVEN MAINS DE STA CIPPA, voi e le vostre \"high mechanics\"\nseeya","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T09:10:16.425+0000","up_votes":1,"down_votes":0,"body":"Il regno del terrore non era finito, bannavi i juggernaut e ti beccavi lei","replies":[{"poster":"TerrorVodka","date":"2015-10-01T09:18:55.680+0000","up_votes":1,"down_votes":0,"body":"non sono solo i juggernaut che l'hanno fatta andare in declino ma anche tutti i nuovi item op da tank che la rendono ormai non un ottimo pick secondo me","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T09:25:03.001+0000","up_votes":2,"down_votes":0,"body":"Attualmente ha il pickrate piu' elevato per la toplane al 13%, distante da gnar di 3 punti.","replies":[{"poster":"TerrorVodka","date":"2015-10-01T09:30:23.208+0000","up_votes":1,"down_votes":0,"body":"se i koreani smettono di giocarla per passare ai nuovi pick stile darius qualcosa vuol dire","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T09:32:11.026+0000","up_votes":1,"down_votes":0,"body":"I koreani son strani a non bannare darius ma bannano fiddlesticks.","replies":[]}]}]}]}]},{"poster":"Ringiel","date":"2015-10-01T08:59:27.239+0000","up_votes":2,"down_votes":0,"body":"preparati a beccarti il flame dai \"main\" riven xD","replies":[{"poster":"TerrorVodka","date":"2015-10-01T09:20:14.724+0000","up_votes":2,"down_votes":0,"body":"che flammino quanto vogliono gli rido in faccia lo stesso se mi iniziano a parlare di meccaniche e altre stronzate che si inventano per difendere quel cancro con la spada rotta","replies":[]}]}]},{"poster":"LionHeartV","date":"2015-10-01T11:18:44.735+0000","up_votes":2,"down_votes":1,"body":"vorrà dire che giocheranno tutti tryndamerde","replies":[]},{"poster":"IrrationalNumber","date":"2015-10-01T14:58:28.943+0000","up_votes":1,"down_votes":0,"body":"RIVEN PRESA AI MONDIALI\n\nAlmeno la finiamo di usarla come scusa \"eh ma che op, non la pickano manco ai mondiali\".","replies":[]},{"poster":"Nibbio Bianco","date":"2015-10-01T09:15:26.509+0000","up_votes":1,"down_votes":0,"body":"In realtà è un buff per contrastare l'attuale meta... attualmente Riven ottiene 20 / 25 / 30 / 35 / 40 / 45 / 50% AD ed ha massimo 3 stacks. ora ha un 30% fisso, quindi è più forte in early game, ed inoltre se ti fa un attacco base aumenta i suoi danni a seconda dell'edge che ha accumulato. Come ho sempre detto io, se la riot avesse toccato riven avrebbe dovuto buffare l'early game e concentrarsi su quello e nerfare il late ( il nerf è sulla ultimate ). Ma attualmente Riven farà dei danni orribili in early game, quindi non c'è molto da esserne felici perché se prende un vantaggio anche solo di una kills con i danni che può fare attualmente diventa veramente terribile fermarla.","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T09:17:47.731+0000","up_votes":1,"down_votes":0,"body":"Se usa la Q come gap closer non accumula \"edge\" e la spreca. In early non ha abbastanza cdr, se non gli permetti di accumulare edge puoi traddare in maniera piu' salutare all'inizio.","replies":[{"poster":"Nibbio Bianco","date":"2015-10-01T09:19:21.407+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=cAOZwaUi,discussion-id=gj8vgwOx,comment-id=00030000,timestamp=2015-10-01T09:17:47.731+0000)\n>\n> Se usa la Q come gap closer non accumula \"edge\" e la spreca. In early non ha abbastanza cdr, se non gli permetti di accumulare edge puoi traddare in maniera piu' salutare all'inizio.\n\nPrendi Riven con ignite -> Sblocchi la Q -> Appena l'avversario si avvicina al primo minion Q aa q aa q aa ignite -> morto. Garantito. Ha un sacco di danno in più in early game. No sense.\n\nQuesto cambiamento non è né un nerf né un buff, la potenzia di molto in early game e comunque nei teamfight nel late game dovresti riuscire a dare 5 colpi per ottenere il massimo dell'edge, anche perché le sue abilità sono abbastanza spammabili. Io la vedo abbastanza dura da definire nerf. Io sono terrorizzato da questo cambiamento. ","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T09:28:54.323+0000","up_votes":1,"down_votes":0,"body":"Secondo me sopravvaluti il burst e il cd delle spell, a lv 3-4 non sara' forte come pensi.","replies":[{"poster":"Nibbio Bianco","date":"2015-10-01T09:57:35.001+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=cAOZwaUi,discussion-id=gj8vgwOx,comment-id=0003000000000000,timestamp=2015-10-01T09:28:54.323+0000)\n>\n> Secondo me sopravvaluti il burst e il cd delle spell, a lv 3-4 non sara' forte come pensi.\n\nK, facciamo due conti. 3 attacch, 3 q. Ogni attacco base aumenta i danni sia degli attacchi. Ogni attacco dà 20 edge, ogni 10 edge sono 1% di danni in più. \n\nOra, tu sei riven, la tua q scala 10+40% ad per ogni q. A livello 1 hai 56 ad, + 10 dall'ad, della spada, + 22 ad dalle rune = 88 ad.  con le masteries arrivi a 93. \n\nQ = 10+37 = 47 +1 con havoc = 48\nAA = 93+28 = 121 Aumentato da blade weaving va a 122+3 di havoc = 125\nQ = 47 + 1% di danni in più solo su spell weaving 48+1 con havoc = 49 danni aumentati del 2% = 50\nAA=93+28= 121+1+3=125 = 127\nora sei sotto il 50% degli hp, executioner aumenta i tuoi danni del 5%\nQ = 47 +1 havoc + 1 spell weaving + 2 executioner = 51 +4% = 53\nAA = 121+1+3+4= 129 +4% = 134\nignite = 70 true damage\n\nsono 537 danni fisici e 70 true damage. Se non muori con la full combo ti manca un attacco base dalla morte. Ma comunque se non muori sei costretto a recallare e a perdere tanta exp e gold, torni che sei livello 1 e riven livello 2 o 3, se usi il recall sei comunque indietro perché ti zona, non puoi fare niente con quei danni. Se Riven non ti va all in a livello 1 è perché sta aspettando il livello 3 per avere il 10% di danni in più e ucciderti senza ombra di dubbio.","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T10:00:57.205+0000","up_votes":1,"down_votes":0,"body":"Parti dall'ipotesi che possa usare la full combo senza prendere danni lei stessa. Contro un champ dotato di sustain secondo me ce la fai, Tra l'altro c'e' il fattore armor che riduce i danni, il fatto che ormai non van piu' top con ignite etc...secondo me e' tutto da rivedere un matchup con riven. Per dirne una, secondo me olaf la prende ad asce in faccia meglio di prima ora.","replies":[{"poster":"Nibbio Bianco","date":"2015-10-01T10:02:31.811+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=cAOZwaUi,discussion-id=gj8vgwOx,comment-id=000300000000000000000000,timestamp=2015-10-01T10:00:57.205+0000)\n>\n> Parti dall'ipotesi che possa usare la full combo senza prendere danni lei stessa. Contro un champ dotato di sustain secondo me ce la fai, Tra l'altro c'e' il fattore armor che riduce i danni, il fatto che ormai non van piu' top con ignite etc...secondo me e' tutto da rivedere un matchup con riven. Per dirne una, secondo me olaf la prende ad asce in faccia meglio di prima ora.\n\nTutte le riven in elo alto giocano riven con ignite, Riven rimane un campione da splitpush e da early advantage, non è buona con teleport, come anche Renekton ecco perché sono spariti dal competitivo. Poi se ti va di prendere teleport puoi farlo, è sempre utile per il map control, ma è molto più utile su altri campioni. Comunque Q-AA-Q-AA-Q-AA non ci metti molto a farli, anche se ti butti in mezzo a tutti i minion non dovresti morire, anche perché non parliamo di una Riven che dopo averti fatto la full combo ti lascia a metà vita, ora come ora può ucciderti a livello 1, da morto non puoi dare più attacchi base per ucciderla e lei è troppo veloce. Secondo me Riven può uccidere a livello 1 con questo rework, ma è da provare. Se hai account pbe possiamo fare una prova. ","replies":[{"poster":"IrrationalNumber","date":"2015-10-01T10:45:02.695+0000","up_votes":1,"down_votes":0,"body":"Purtroppo no, sarei curioso pure io.","replies":[{"poster":"lorewolf1411","date":"2015-10-01T14:00:01.142+0000","up_votes":1,"down_votes":0,"body":"basta prendere zed top q per farmare da lontno e quando ingaggia usi la W o la ullty che sia un buon caounterpick?","replies":[{"poster":"lorewolf1411","date":"2015-10-01T14:00:25.734+0000","up_votes":1,"down_votes":0,"body":"scusate la mia scrittura ma non mi va di correggere","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Giovarco","date":"2015-10-01T13:22:50.205+0000","up_votes":1,"down_votes":0,"body":"Partirà come un rework, per poi scoprire che è un buff e sarà perma bannata. Non avete ancora imparato la lezione? Il solo fatto che i suoi Edge rimangono per 10 secondi e che tutto le sue abilità hanno un CD minore di 10, ti fa capire come si siederà al massimo degli Edge per zonarti a vita, come fa adesso, a meno che tu non possa caricare gli Edge sui minion. Comunque sia sono curioso di vedere quando verrà nerfata, ora che la Riot l'ha messa sott'occhio.","replies":[]},{"poster":"ubercodlegend200","date":"2015-10-01T11:15:40.885+0000","up_votes":1,"down_votes":0,"body":"Io non esulterei troppo in fretta il ciclo del pbe è appena iniziato ed oltretutto in game non si sa perfettamente quale sará il suo comportamento, tanti di quelli che sembravano nerf si sono poi rivelati buff","replies":[]},{"poster":"Tankerous","date":"2015-10-01T09:47:06.952+0000","up_votes":1,"down_votes":0,"body":"Beh i coreani saranno anche strani ma nel competitivo ci pisciano in testa, quindi io mi fido.","replies":[]},{"poster":"Dante Hellfire","date":"2015-10-01T11:20:29.981+0000","up_votes":1,"down_votes":1,"body":"Concordo con Riso sul discorso del buff early game.. L'unica soddisfazione sarà quella di non vedere spammare abilità a caso ma veder giocare Riven con un minimo di intelligenza anziché limitarsi a craniate sulla tastiera.","replies":[]}]}