{"poster":"vampireslayer200","date":"2016-05-01T02:30:50.386+0000","title":"Hacked my account","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"umm a week ago when I tried to log into my account it said my account had been temporarily suspended and all I thought of it is &quot;this makes no sense I haven&#039;t don&#039;t anything wrong must just be doing something about the game itself&quot; so I left it like that but now (a week later) I tried to go on and it said I was now permanently suspended and to check my email address for more info on this suspension but I checked and didn&#039;t have any email.\r\n\r\nI think someone might of hacked into my account (I haven&#039;t told any1 mu username or password). plz help me account name is Jaknelben its on OCE server. I have spent money of rp bought skins and champions on it and I&#039;m a little disappointed to now think that money was waisted now can you please tell me why and help me get this fixed","replies":[{"poster":"SephirothSG","date":"2016-05-01T02:36:51.303+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\n**Please remove your account name from the OP**\n\nSorry to hear your account may have been compromised, did you receive an email regarding the suspension, are you sure you were compromised?\n\nI'd recommend first ensuring your system is secure,\n\n* Download an antivirus if you don't already have one ([Malwarebytes](https://www.malwarebytes.org/mwb-download/ ))\n* Update your antivirus completely.\n* Run a full system scan.\n\nThe next thing to do is to begin the [Account Recovery Process](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account).\n\n>**If you have followed these instructions and still cannot recover your account please proceed with the following:**\n\n>[Submit a ticket](https://support.riotgames.com/hc/requests/new) with the subject line \"Unrecoverable Account\" from the email address that you used to sign up for your account. Make sure to provide us with the requested information about the account you are trying to recover. From there we will work with you to verify ownership of the account.","replies":[]}]}