{"poster":"I Stealth I","date":"2016-12-23T01:25:04.545+0000","title":"The Current State and Future of Lethality","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":0,"body":"&gt;Reav3, noting potential buffs for lethality, thoughts on a few visual updates, and more!\n\n&gt;When asked about potential Talon buffs following the preseason assassin update, Reav3 noted they are currently looking into lethality buffs.\n&quot;We will continue to monitor Talon going forward. The reason these buffs are so conservative is that the Live Gameplay Team is currently looking into buffs for lethality. If those changes do go through they should help Talon quite a bit so we are waiting to see what happens with that. \n\n&gt;Also Talon is the type of champion that is probably actually very OP in a experienced players hand if he was at a overall winrate of 50%. We do feel he is a bit weak though right now, hence the small buffs.&quot;\n\n&gt;As for when we might expect these lethality changes, Reav3  noted:\n\n&gt;&quot;Not sure which patch they are targeting. It will likely require a good amount of internal testing since it will effect so many champions. If they do decide to buff lethality it will likely be sometime early next year though.&quot;\n\nPersonally, I don&#039;t feel that Lethality deserves a buff. Currently, most Assassin champions can just keep building AD to just **SHRED** through their opponents, even tanks. These &#039;assassins&#039; are most notably,\n\n* Zed\n\n* Yasuo\n\n* Katarina\n\n* Rengar\n\n* and Talon\n\nLooking back at the old Talon, it was practically essential to build Armour Pen as it was the main source of Talon&#039;s DPS. Nowadays, due to the buffs to Talon&#039;s AD, he doesn&#039;t rely on Lethality as much as he did with Armour Pen. Lethality is sort of a must for other Assassins if they want to guarantee the kill on the ADC but it doesn&#039;t look like it needs a buff considering Duskblade&#039;s perk from Lethality \n\nSpeaking of Talon, in the latest PBE cycle, he&#039;s going to receive a buff. Honestly, it isn&#039;t really needed. Sure, he&#039;s very mana hungry at early game but late game he practically doesn&#039;t need mana. The other buff apart from buffing his mana regen &amp; growth is his &quot;Q&#039;s&quot; heal increase. Honestly, the heal is just pathetic and isn&#039;t useful at all, early game or late game, and the buff is pretty laughable.  \n\nThis report is brought to you by your loyal Talon main, StealthVortex88","replies":[{"poster":"Lord Sesshomaru","date":"2016-12-23T01:54:52.618+0000","up_votes":1,"down_votes":0,"body":"My opinion on lethality is that it shouldn't be readily available on so many items.\n\nas it stands, unlike an ADC or other physical damage dealer, assassins don't need to change their build path in order to shred armour.\n\nMages have to sacrifice potential power spike items like Deathcap or Ludens, in order to get a Void Staff. \nADC's lose out on a bloodthirster or other damage item if they want to go for a mortal reminder or lord doms. \n\nAssassins dont need to change their build path at all. If they want magic resist they buy Edge of night (which is a core item), if they want lethality, they buy Edge of night (which is a core item), if they want damage they buy Maw (which is a core item) if they want magic resist they buy Maw (which is a core item).\nall of the main assassin items give them all the stats they ever need, they dont ever have to build situationally like the other classes.\n{{item:3156}} {{item:3814}} {{item:3147}} {{item:3071}} \n\nI dont think assassins need a nerf or a buff, I think that their items need to be more situational and their core items should not give them Offensive stats (AD) Defensive stats (MR/HP) and counter-defensive stats (Lethality) all within the same item. \n\nIf they want to shred tanks, then they should have to build specifically for that (like mages or ADC's would have to), and if they want to burst squishes down quickly, then they should have to build a different path with less lethality and more damage. And if they want to build defensive, then their defence items like Edge of night, shouldn't provide them with so many offensive stats. \nThey should have to build situationally like everyone else, and not have all the stats they need given to them in most items they buy (and items they would buy anyway)\n\nMages lose a lot of potential damage when they buy Zhonyas or Abyssal, and they have to go out of their way to do so (neither of those items are key items on many mages), ADC's also lose a lot of damage when they have to build a GA or Banshees as well. \nBut assassins build the same items for whatever situation, and so don't sacrifice much.\n\nAnyway thats my view on it, I'm not a gameplay designer so what do i know xD \nbut thats how it seems to me.","replies":[]}]}