{"poster":"Water of Eden","date":"2014-04-06T00:37:31.437+0000","title":"Why YOU Should Take a Break From Your Most Played Champions","subforum":"Live Gameplay Balance","up_votes":5,"down_votes":0,"body":"So I'm a jungle main, and I used to spam Lee Sin and Wukong non-stop. I had been having a lot of success with both of them. I noticed that after a certain point, the more I played my mains the sloppier my playing got. I've started playing a lot of different junglers and expanding my champion pool. Now I've added Xin, Pantheon, and Elise to my champion pool. \n\nThe most interesting part of this was that once I went back to Wukong and Lee my performance on them was much better than it had been before. It makes sense because if you practice different champions you improve your mechanics. \n\nWhat do you think? Do you have any experiences like this? What do you do when you start playing sloppy on a champion?","replies":[{"poster":"PaladinNeph","date":"2014-04-07T13:52:25.792+0000","up_votes":2,"down_votes":0,"body":"ARAM. enough said.","replies":[{"poster":"Water of Eden","date":"2014-04-07T18:16:19.251+0000","up_votes":1,"down_votes":0,"body":"Or Urf. Urf is love. Urf is life.","replies":[]}]},{"poster":"Sir ArmaMalum","date":"2014-04-06T02:50:06.182+0000","up_votes":1,"down_votes":0,"body":"An idea I've seen thrown around in just general sports is when you go and take a break from something, you forget the high function habits (reflexes, etc.) good and bad, and then when you come back you start working towards the better habits you specifically remember.\n\nThat and playing different champs just exposes you to more overall situations where those champs are string and weak, making your play against them even better.","replies":[{"poster":"ArtoriusIV","date":"2014-04-06T03:00:23.655+0000","up_votes":2,"down_votes":0,"body":"On this, after I started playing Evelynn, I realized, she is very squishy early game, so if I am playing a strong brawler, (Olaf or Udyr most commonly) I know an invade is better suited to that then I thought previously Learning other champs strengths helps you play against them better in general.","replies":[]}]},{"poster":"Water of Eden","date":"2014-04-06T18:31:44.413+0000","up_votes":1,"down_votes":0,"body":"I appreciate the feedback everyone!!","replies":[]},{"poster":"Earl Eulrich","date":"2014-04-06T16:47:30.006+0000","up_votes":1,"down_votes":0,"body":"And you´re not only improving your mechanics - you also get a better understanding of other champs and understand how to exploit their patterns and weaknesses. Playing a hugely divers champion/role-pool only helps to get a better player.","replies":[]},{"poster":"Zedex","date":"2014-04-06T15:06:14.164+0000","up_votes":1,"down_votes":0,"body":"I play only Riven and Yasuo if I can help it and I notice sometimes I get more angry when I lose on said champions lol then I do if I lose on a champion I don't pick often. I don't curse and yell at me team just, myself I get angry when I mess up a Yas or Riv play..\n\nSo when that happens like in your case, yes I play something different as well. Usually for me its playing Aatrox top because hes one of my faves as well.","replies":[]},{"poster":"XxTSwiftxX","date":"2014-04-06T09:28:40.757+0000","up_votes":1,"down_votes":0,"body":"I main jungle and top and starting playing support for filling  and have never lost as taric until my 16th game and starting winning and losing over and over. I think it's the lack consistency and being unable to optimize yourself.","replies":[]},{"poster":"Crimsondude","date":"2014-04-06T04:37:21.441+0000","up_votes":1,"down_votes":0,"body":"This was so true with me as fizz, anivia, and nami... ._.","replies":[{"poster":"Water of Eden","date":"2014-04-06T06:56:16.775+0000","up_votes":1,"down_votes":0,"body":"Missed skillshots errywhere?","replies":[]}]},{"poster":"ArtoriusIV","date":"2014-04-06T02:04:00.553+0000","up_votes":1,"down_votes":0,"body":"Yes I do, but mine stemmed from something closer, I would forget that Udyr(my comfort and main jungler) is not godly unkillable early game, unlike at late game(at least how I build/play him) and would make plays, then die because I thought a turret shot would do no damage. I now play Evelynn, Olaf, Nocturne, and Skarner in the jungle as well.","replies":[]},{"poster":"Riot Sotere","date":"2014-04-06T01:52:24.584+0000","up_votes":1,"down_votes":0,"body":"I have experienced this to a small degree.  In particular, whenever I have taken a small break from League due to travel or the release of another game, I come back and my mechanics tend to be slightly better.\n\nIn League though I've had the best experience mastering champions. It gives me more time to focus on strategy and map awareness.\n\nWhen I start playing sloppy I tend to just take a break.  But that's easier said than done. Especially when I'm losing I always want to end the night with a win. ","replies":[]}]}