{"poster":"LDX Fenrir","date":"2018-10-15T12:50:53.523+0000","title":"metodi di gioco con visuale fissa/mobile","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Salve ragazzi.. Gioco a LoL ormai da 4 anni e non ho mai cambiato la modalit&agrave; visuale FISSA, sono comunque riuscito a portare a casa la divisione platino.. vorrei sapere se secondo voi dovrei cambiare questa mia modalit&agrave; di gioco e se quest&#039; ultima influisce sulle mie potenzialit&agrave; di gioco-\r\nringrazio in anticipo -**TheWolfOfLoL**","replies":[{"poster":"Linkimaru","date":"2018-10-15T13:53:46.959+0000","up_votes":1,"down_votes":0,"body":"Secondo me invece influisce e ti limita parecchio, fermo restando che a diamond basso ci puoi arrivare anche con la fissa, ma dubito esista un diamond alto/master/challenger che gioca senza visuale mobile...","replies":[{"poster":"BruschettaFelice","date":"2018-10-15T14:19:08.607+0000","up_votes":2,"down_votes":1,"body":"Ho un amico diamond 1 che gioca solo con la fissa","replies":[{"poster":"LDX Fenrir","date":"2018-10-15T16:54:37.709+0000","up_votes":1,"down_votes":0,"body":"wow! allora non è cosi fondamentale come credevo!","replies":[]}]},{"poster":"wattbatt","date":"2018-10-15T18:08:29.533+0000","up_votes":1,"down_votes":0,"body":"dimmi se sbaglio, la mobile è soprattutto per magji adc etc, gente ranged, per i melee non è così importante; io uso un metodo misto come paolocannone: la tengo fissa in lane e nel farming e la sblocco solo nei combattimenti","replies":[{"poster":"Linkimaru","date":"2018-10-15T21:18:05.597+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=cAOZwaUi,discussion-id=F42qTw1P,comment-id=00010002,timestamp=2018-10-15T18:08:29.533+0000)\n>\n> dimmi se sbaglio, la mobile è soprattutto per magji adc etc, gente ranged, per i melee non è così importante; io uso un metodo misto come paolocannone: la tengo fissa in lane e nel farming e la sblocco solo nei combattimenti\n\nNon c’entra nulla melee o ranged, io maino champ melee e non riuscirei a giocare con la telecamera fissa, per me è molto limitante... non capisco chi gioca con la fissa lo fa per ”pigrizia” o che altro? A imparare la mobile ci vuole poco e non richiede nessuna skill, molto più semplice rispetto imparare a muoversi e muovere contemporaneamente la visuale in un qualsivoglia FPS per fare un esempio.\nIl fatto che il personaggio stia sempre al centro dello schermo é molto limitante a mio avviso, in certe situazioni occorre vedere di più in una determinata direzione, soprattutto se giocate dal lato di sopra della mappa, inoltre se volte guardare cosa fa un’altra lane o il jungler come fate? Sbloccate e riboccate ogni volta?","replies":[{"poster":"wattbatt","date":"2018-10-16T14:15:35.715+0000","up_votes":1,"down_votes":0,"body":">non capisco chi gioca con la fissa lo fa per ”pigrizia” o che altro?\nIl fatto che il personaggio stia sempre al centro dello schermo é molto limitante a mio avviso, in certe situazioni occorre vedere di più in una determinata direzione, soprattutto se giocate dal lato di sopra della mappa\n\nIo la difficoltà la avverto molto pesante soprattutto quando faccio aram dal lato sopra, mi sento praticamente costretto ad usarla sbloccata perchè se no non ci si vede una mazza, e onestamente non ho proprio idea di come ci si possa riuscire. \nCon il mouse si devono fare 4 cose: muoversi, autoattaccare, puntare gli skillshot e muovere la visuale; se non sei un champ tankoso e non stai pokkando ma proprio è partito il 5v5 stai vivo circa 4-5 secondi, e riuscire a coordinare il movimento di camera con le altre 3 azioni in un attimo è difficile..è quasi più efficace premere tutti i tasti e basta\n\nSe ho urgenza di spostare la visuale le altre 3 azioni vanno al diavolo perchè: se stavo puntando uno skillshot devo invece  spostarMI e spostare la cam che magari poi la sposto troppo e la devo riaggiustare, nel frattempo la finestra di lancio buona è già andata, se invece lo sto lanciando il champ va nell'angoletto in alto e spesso mi capita di non vedere neanche che mi stanno attaccando perchè stavo guardando dove puntare e quindi non posso neanche muovermi all'indietro proprio perchè il champ è già nell'angolo(es. ult {{champion:202}} e{{champion:101}})  e quindi non c'è schermo su cui cliccare, se invece sono adc devo continuamente cambiare bersaglio mentre avanzo e indietreggio e queste due azioni magari le devo pure invertire a seconda di dove posiziono la cam; tutte queste cose comportano di avere il mouse su tutto lo schermo e a un certo punto non so neanche più dove l'ho messo e tutti questi pensieri vanno pure fatti in pochi secondi perchè se no ti esplodono; \n\nPer esempio l'altro giorno ero con {{champion:81}} vs {{champion:92}} e{{champion:11}} sempre in aram, avevo la cam sbloccata lontana per mirare e siccome loro fanno mezzo schermo in 0.5 sec, negli engage mi ritrovavo a premerli col destro prima che fossero in range di danno per fare qualche aa, e contemporaneamente a riportare la cam su di me per avere spazio di fare dei movimenti difensivi; nel panico di quei 0.5 secondi non ci posso mettere molti pensieri...per cui semplicemente dovevo fare:\nmovimento di cam+ movimento mio difensivo accordato con la posizione della cam e non quello canonico centrale+click destro per aa+qualche skillshot+loro che cambiano posizione a raffica per cui devo trovare un' inquadratura che abbia dentro i miei movimenti, i loro, i miei skillshot, i miei aa, la zona dietro di me+TUTTO ciò in modo pressochè istintivo dati i tempi, risultato: io che premo il vuoto e faccio un passo in avanti anzichè tutte queste cose in maniera corretta. \nSe io rinuncio a fare la giocata perfetta e premo E all'indietro + tutti i tasti tenendomi la posizione di cam che più probabilmente ha dentro ogni cosa(la fissa) mentre davanti c'è il marasma, la differenza con qualcuno che si è allenato a usare la cam in quei frangenti istantanei voglio proprio sapere dovè,  anzi sono sicuro che se faccio così me la gioco anche meglio che a tentare invano di coordinare tutte queste cose con un alto rischio di sbagliare; con la cam fissa posso tenere il mouse in una sola zona dello schermo per cui molti dati  li lascio \"inconsci\" come posizionamento aggressivo e difensivo e posso concentrarmi sul da farsi\n\n> inoltre se volte guardare cosa fa un’altra lane o il jungler come fate?\n\ntu come fai con la telecamera mobile? io si sblocco, clicco sulla minimappa e riblocco così torna subito da me, come si fa muovendo la telecamera? o la metti troppo lenta e mentre la muovi verso un altra lane manchi farm o la metti troppo veloce e devi continuare a fare aggiustamenti avanti/indietro finchè non sei sul punto che vuoi vedere e ci metti ancora più tempo","replies":[{"poster":"Linkimaru","date":"2018-10-16T14:20:13.603+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=cAOZwaUi,discussion-id=F42qTw1P,comment-id=0001000200000000,timestamp=2018-10-16T14:15:35.715+0000)\n>\n> Il fatto che il personaggio stia sempre al centro dello schermo é molto limitante a mio avviso, in certe situazioni occorre vedere di più in una determinata direzione, soprattutto se giocate dal lato di sopra della mappa\n> \n> Io la difficoltà la avverto molto pesante soprattutto quando faccio aram dal lato sopra, mi sento praticamente costretto ad usarla sbloccata perchè se no non ci si vede una mazza, e onestamente non ho proprio idea di come ci si possa riuscire. \n> Con il mouse si devono fare 4 cose: muoversi, autoattaccare, puntare gli skillshot e muovere la visuale; se non sei un champ tankoso e non stai pokkando ma proprio è partito il 5v5 stai vivo circa 4-5 secondi, e riuscire a coordinare il movimento di camera con le altre 3 azioni in un attimo è difficile..è quasi più efficace premere tutti i tasti e basta\n> \n> Se ho urgenza di spostare la visuale le altre 3 azioni vanno al diavolo perchè: se stavo puntando uno skillshot devo invece  spostarMI e spostare la cam che magari poi la sposto troppo e la devo riaggiustare, nel frattempo la finestra di lancio buona è già andata, se invece lo sto lanciando il champ va nell&#x27;angoletto in alto e spesso mi capita di non vedere neanche che mi stanno attaccando perchè stavo guardando dove puntare e quindi non posso neanche muovermi all&#x27;indietro proprio perchè il champ è già nell&#x27;angolo(es. ult {{champion:202}} e{{champion:101}})  e quindi non c&#x27;è schermo su cui cliccare, se invece sono adc devo continuamente cambiare bersaglio mentre avanzo e indietreggio e queste due azioni magari le devo pure invertire a seconda di dove posiziono la cam; tutte queste cose comportano di avere il mouse su tutto lo schermo e a un certo punto non so neanche più dove l&#x27;ho messo e tutti questi pensieri vanno pure fatti in pochi secondi perchè se no ti esplodono; \n> \n> Per esempio l&#x27;altro giorno ero con {{champion:81}} vs {{champion:92}} e{{champion:11}} sempre in aram, avevo la cam sbloccata lontana per mirare e siccome loro fanno mezzo schermo in 0.5 sec, negli engage mi ritrovavo a premerli col destro prima che fossero in range di danno per fare qualche aa, e contemporaneamente a riportare la cam su di me per avere spazio di fare dei movimenti difensivi; nel panico di quei 0.5 secondi non ci posso mettere molti pensieri...per cui semplicemente dovevo fare:\n> movimento di cam+ movimento mio difensivo accordato con la posizione della cam e non quello canonico centrale+click destro per aa+qualche skillshot+loro che cambiano posizione a raffica per cui devo trovare un&#x27; inquadratura che abbia dentro i miei movimenti, i loro, i miei skillshot, i miei aa, la zona dietro di me+TUTTO ciò in modo pressochè istintivo dati i tempi, risultato: io che premo il vuoto e faccio un passo in avanti anzichè tutte queste cose in maniera corretta. \n> Se io rinuncio a fare la giocata perfetta e premo E all&#x27;indietro + tutti i tasti tenendomi la posizione di cam che più probabilmente ha dentro ogni cosa(la fissa) mentre davanti c&#x27;è il marasma, la differenza con qualcuno che si è allenato a usare la cam in quei frangenti istantanei voglio proprio sapere dovè,  anzi sono sicuro che se faccio così me la gioco anche meglio che a tentare invano di coordinare tutte queste cose con un alto rischio di sbagliare; con la cam fissa posso tenere il mouse in una sola zona dello schermo per cui molti dati  li lascio &quot;inconsci&quot; come posizionamento aggressivo e difensivo e posso concentrarmi sul da farsi\n> \n> tu come fai con la telecamera mobile? io si sblocco, clicco sulla minimappa e riblocco così torna subito da me, come si fa muovendo la telecamera? o la metti troppo lenta e mentre la muovi verso un altra lane manchi farm o la metti troppo veloce e devi continuare a fare aggiustamenti avanti/indietro finchè non sei sul punto che vuoi vedere e ci metti ancora più tempo\n\nClicco sulla minimappa e per tornare su di me premi la barra spaziatrice, semplice senza dover sbloccare/bloccare","replies":[{"poster":"wattbatt","date":"2018-10-16T14:26:21.023+0000","up_votes":1,"down_votes":0,"body":"> Clicco sulla minimappa e per tornare su di me premi la barra spaziatrice, semplice senza dover sbloccare/bloccare\n\nw8 io ho messo il blocco/sblocco sulla barra spaz proprio perchè quando blocco la visuale torna da sola, tu invece sulla barra hai messo che la visuale torna a centrarti ma sempre mentre è sbloccata?","replies":[{"poster":"Linkimaru","date":"2018-10-16T14:33:53.996+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=cAOZwaUi,discussion-id=F42qTw1P,comment-id=000100020000000000000000,timestamp=2018-10-16T14:26:21.023+0000)\n>\n> w8 io ho messo il blocco/sblocco sulla barra spaz proprio perchè quando blocco la visuale torna da sola, tu invece sulla barra hai messo che la visuale torna a centrarti ma sempre mentre è sbloccata?\n\nNon l’ho messo io, è così di default che io sappia, e se la tieni premuta rimane fissa su di te finché non la rilasci","replies":[]}]}]}]}]}]},{"poster":"LDX Fenrir","date":"2018-10-15T16:56:17.182+0000","up_votes":1,"down_votes":0,"body":"immagino che in alcune situazioni sia limitante hai ragione.. spero non sia del tutto vero ciò che dici! ahhaha!!","replies":[]}]},{"poster":"Otivnaig","date":"2018-10-16T17:34:15.294+0000","up_votes":1,"down_votes":0,"body":"Ma la telecamera semifissa è scomparsa? non riesco a trovare come metterla e non trovo l'hotkey","replies":[]},{"poster":"Myþhz","date":"2018-10-15T13:45:40.448+0000","up_votes":1,"down_votes":0,"body":"Io sono arrivato DIamond giocando sempre con quella fissa... Secondo me non influisce sulle potenzialità di gioco, è una cosa personale","replies":[{"poster":"LDX Fenrir","date":"2018-10-15T16:56:38.213+0000","up_votes":1,"down_votes":0,"body":"Perfetto allora non devo scoraggiarmi! {{summoner:14}}","replies":[{"poster":"sbepuz97","date":"2018-10-15T23:13:38.117+0000","up_votes":1,"down_votes":0,"body":"sempre tenuto la telecamera fissa pure io, e arrivi a d2 senza problemi\n\ncerto, la sblocchi per vedere cosa succede nelle altre lane, ma poi la rimetto bloccata","replies":[]}]}]},{"poster":"Harkrade","date":"2018-10-15T17:09:15.760+0000","up_votes":1,"down_votes":0,"body":"E' facile da vedere: tutti i professionisti giocano con la mobile! Significa quindi che la mobile è la visuale che ti garantisce migliori prestazioni","replies":[]},{"poster":"JohannesKT","date":"2018-10-15T15:49:48.485+0000","up_votes":1,"down_votes":0,"body":"personalmente uso la visuale mobile solo se devo vedere cosa accade in una zona distante da quella in cui sono o se sono botlane costretto sotto torre e quindi devo guardare in basso per vedere dove mirare con gli skillshot.","replies":[{"poster":"LDX Fenrir","date":"2018-10-15T16:53:13.687+0000","up_votes":1,"down_votes":0,"body":"Sisi ovviamente anche io utilizzio la mobile quando è strettamente necessario! :D","replies":[]}]}]}