{"poster":"Drakorre","date":"2017-08-09T20:41:42.188+0000","title":"Nuovo campione: Lance  una mia idea :3","subforum":"Creazioni della community","up_votes":2,"down_votes":7,"body":"Lance, The Ender Mage.\nRole: Midlane Mage.\n\nPassive: Ender Zone \nEvery few seconds Lance summons a Tower (Smaller, black-colored and with shades of purple.)\nUp to five towers can be active at any moment. Towers grant gold when destroyed and disappear if too far away from Lance.\n\nQ: Orb of Despair\nLance shoots an Orb that deals damage to the first enemy struck.\nHitting a Tower will instead cause the Tower to shoot a new Orb, perpendicular to the original cast\n\nPassive\nNearby Towers link together to gain additional effects. If an Orb of Despair hits a connected Tower cluster it will trigger additional effects.\n\nEvery linked Tower will cast a weakened Orb of Despair, dealing reduced damage on every successive hit. Furthermore, based on the number of towers, the Orb itself will obtain the following bonuses:\n\n2 Towers: Slowing effect.\n3 Towers: Additional % Health damage.\n4 Towers: Additional Missing % Health Damage.\n5 Towers: Stun.\n\nW:Rise\n\nLance summons a Tower, knocking away enemies in the summoning area.\nLance can't cast Rise if there are 5 turrets on the field\n\nE: Ender Dash\n\nLance dashes to a nearby Tower, dealing damage and knocking away champions on his path.\n\nR:Ender Rage\n\nLance shoots a massive orb of energy, in a line. The Orb's damage is increased by 10% for each active Tower on the field. If Ender Rage kills an enemy champion it can be recast in the next 10 seconds.\n\n\n\nringraziamento speciale a Tera per la critica costruttiva e i consigli","replies":[{"poster":"HaIIeIujah","date":"2017-08-10T05:40:07.348+0000","up_votes":3,"down_votes":1,"body":"Postalo o in italiano o in inglese grammaticamente corretto, questo ibrido mi tilta a morte.","replies":[{"poster":"Drakorre","date":"2017-08-10T11:27:46.624+0000","up_votes":1,"down_votes":1,"body":"ho gia scritto i motivi nel testo alla fine e cmq ho avuto anche il correttore in ogni caso non è questo l argomento perche comunque si capisce pero grazie lo stesso della critica .","replies":[{"poster":"HaIIeIujah","date":"2017-08-10T12:20:13.069+0000","up_votes":2,"down_votes":0,"body":"> Lance, The Ender Mage.\n> Role: Midlane Mage.\n> \n> **Passive: Ender Zone **\n> Every few seconds Lance summons a Tower (Smaller, black-colored and with shades of purple.)\n> Up to five towers can be active at any moment. Towers grant gold when destroyed and disappear if too far away from Lance.\n> \n> **Q: Orb of Despair** \n> Lance shoots an Orb that deals damage to the first enemy struck.\n> Hitting a Tower will instead cause the Tower to shoot a new Orb, targeting the nearest enemy and prioritizing champions.\n> \n> _Passive_\n> Nearby Towers link together to gain additional effects. If an Orb of Despair hits a connected Tower cluster it will trigger additional effects.\n> \n> Every linked Tower will cast a weakened Orb of Despair, dealing reduced damage on every successive hit.  Furthermore, based on the number of towers, the Orb itself will obtain the following bonuses:\n> \n> 2 Towers: Slowing effect.\n> 3 Towers: Additional % Health damage.\n> 4 Towers: Additional Missing % Health Damage.\n> 5 Towers: Stun.\n> \n> **W:Rise**\n> \n> Lance summons a Tower, knocking away enemies in the summoning area.\n>  \n> **E: Ender Dash**\n> \n> Lance dashes to a nearby Tower, dealing damage and knocking away champions on his path.\n> \n> **R:Ender Rage**\n> \n> Lance shoots a massive orb of energy, [inserire tipologia di targeting]. The Orb's damage is increased by 10% for each active Tower on the field. If Ender Rage kills an enemy champion it can be recast in the next 10 seconds.\n> \n\n\nCapisci l'enorme differenza che fa per un lettore una formattazione accettabile rispetto a quella?\n\nQuanto al kit in sé: troppo potere concentrato nella Q, W ed E troppo simili al Kit di Azir, abilità contraddittorie e dall'utilità questionabile, fin tropp binario nella sua esecuzione e dubbio valore come campione originale. La Q andrebbe divisa per occupare l'intero kit e creare pioù possibilità di counterplay e di espressione persoanel, dato che al momento per via dell'autotargeting delle torri non vi è alcuna interazione tra il campione in sé ed i suoi bersagli.\n\nRipeto: La formattazione è **importante.** Se non ti sei preso il tempo di rendere il tuo concept leggibile e chiaro, assumo che non ti sei preso il tempo di ragionarci sopra a fondo.","replies":[{"poster":"Drakorre","date":"2017-08-10T13:50:09.400+0000","up_votes":1,"down_votes":0,"body":"ho sistemato un po spero vada meglio :)","replies":[]},{"poster":"Drakorre","date":"2017-08-10T13:43:21.967+0000","up_votes":1,"down_votes":0,"body":"si capisco e che non ho avuto molto tempo in quanto ieri ero molto impegnato comunque in ogni caso grazie della critica costrutiva :) ho messo molto potere  nella Qperche volevo creare un champ che devesse sapere cosa gli servirebbe senza renderlo troppo potente la E è piu che altro un modo per scappare da situazioni pericolose e cmq la W è abbastanza limitata in quanto il massimo di torri è sempre 5 magari sulla cosa delle torri si potrebbe renderle uno skillshot in ogni caso grazie del ottima critica costruttiva :)","replies":[]}]}]}]},{"poster":"Promo Hunter","date":"2017-08-09T22:15:49.775+0000","up_votes":2,"down_votes":0,"body":"sembra heim per via delle torrette, ma per questo champ sono troppo vitali ,  la w sarebbe da farci qualcosina in più... magari una passiva","replies":[{"poster":"Drakorre","date":"2017-08-09T22:59:42.949+0000","up_votes":1,"down_votes":1,"body":"si stavo pensando tipo un misto fra azir e illaoi. qualche idea sulla passiva della w?","replies":[]}]},{"poster":"Goddess Kaiśa","date":"2017-08-09T20:50:15.088+0000","up_votes":2,"down_votes":0,"body":"love it","replies":[{"poster":"Drakorre","date":"2017-08-09T22:09:37.942+0000","up_votes":2,"down_votes":1,"body":"thanks {{sticker:slayer-jinx-wink}}","replies":[]}]}]}