{"poster":"Mia Khalistar","date":"2018-09-02T21:39:15.357+0000","title":"Hextech Truhen","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Hallo,\nlangsam frage ich mich ob es anderen genauso ergeht wie mir. \n\nIrgendwie erhalte ich nen A*** voll Hextech Truhen aber schl&uuml;ssel bleiben aus, obwohl ich recht h&auml;ufig Honors erhalte (momentan stufe 4). \n\nIch habe mittlerweile 34 Truhen in der Hextech Werkstatt rumliegen mit denen ich allerdings recht wenig anfangen kann.                                                                                                                                   {{sticker:slayer-jinx-unamused}}\n W&uuml;rde mich interessieren ob es euch &auml;hnlich ergeht oder nicht. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Bxy Yes or Blade","date":"2018-09-08T07:44:30.355+0000","up_votes":1,"down_votes":0,"body":"Ich habe zurzeit 10 Schlüssel (alle durch diese Schlüsselfragmente) und keine einzige Kiste :(\nAlle beschweren sich über zu viele Kisten und ich habe einfach nur Schlüssel","replies":[]},{"poster":"alban1997","date":"2018-09-07T20:21:27.119+0000","up_votes":1,"down_votes":0,"body":"aktuell 34 Kisten und 0 Schlüssel xd \nhab aber schon sehr viele Kisten geöffnet, aus denen ich gute Skins bekommen habe :)","replies":[]},{"poster":"Angel Ayume","date":"2018-09-03T20:29:48.315+0000","up_votes":1,"down_votes":0,"body":"Aktuell 15 Truhen und 11 Schlüssel und 1 Fragment. ^^ \nHab das Problem nicht ganz so.","replies":[]},{"poster":"ˉˉIˉˉ","date":"2018-09-02T22:59:58.199+0000","up_votes":1,"down_votes":1,"body":"Yup, so ist das - und so ist das auch gewollt.\nEs ist ungefähr gleich schnell wie das alte System - sogar ein bisschen schneller wenn man sehr viele Spiele spielt.\n\nLetzendlich ist es Free stuff also beschwere ich mich nicht - aber ja, die Zeiten zwischen Schlüsselfragmenten ist sehr hoch.","replies":[{"poster":"Lunaá","date":"2018-09-02T23:30:26.987+0000","up_votes":1,"down_votes":0,"body":"Eigentlich soll man alle Kisten, die man sich erspielt, auch öffnen können, man sollte also 12 Fragmente pro Monat bekommen.","replies":[{"poster":"ˉˉIˉˉ","date":"2018-09-02T23:39:26.966+0000","up_votes":1,"down_votes":0,"body":"Das wäre natürlich super - aber ich erinerre mich nicht daran, dass Riot das je gesagt hat.\n\nTatsächlich ist aber ein/ausloggen auch wichtig für die Schlüssel - sagte zumindestens Riot beim Einführen des neuen Systems. Und da ich in letzter Zeit ziemlich häufig den Client neu starte habe ich auch tatsächlich das Gefühl mehr Schlüssel zu bekommen.\nMomentan sitze ich glaube ich auf 12 Kisten - bekomme aber 4-5 Fragmente die Woche.","replies":[{"poster":"ImTheFox115","date":"2018-09-03T07:22:17.678+0000","up_votes":1,"down_votes":0,"body":"Nein die haben gesagt, dass es unwichtig ist wie oft man einloggt xD","replies":[{"poster":"Enderized","date":"2018-09-03T08:05:52.009+0000","up_votes":1,"down_votes":0,"body":"Nein, sie haben lediglich gesagt, dass das System nicht so funktionierst, dass du dich 24/7 reloggst um Schlüssel zu bekommen.\nDennoch ist das \"Anmelden\" ein nicht unerheblicher Auslöser x)","replies":[{"poster":"ˉˉIˉˉ","date":"2018-09-03T19:03:45.411+0000","up_votes":1,"down_votes":0,"body":"Hätte mich tatsächlich auch gewundert wenn nicht.\nIch habe alleine heute mich 2 mal eingeloggt (einma mittags, das andere mal gerade eben) und habe jeweils ein Fragment bekommen.","replies":[]}]}]}]}]}]},{"poster":"Neamhoilte","date":"2018-09-03T10:47:04.759+0000","up_votes":1,"down_votes":0,"body":"Aktuell : 0 Kisten, 26 Schlüssel und 2 Fragmente. \n\nHabe aber diese Saison schon mehr Kisten bekommen als je zuvor! Dank der Anpassung im Aram.\n\nGruß ich","replies":[]},{"poster":"SgtBananenkuchen","date":"2018-09-03T07:27:30.505+0000","up_votes":1,"down_votes":0,"body":"Früher war das bei mir irgendwie komplett das Gegenteil, da hatte ich unmengen an Schlüssel, aber keine einzige Kiste.\nIch habe jetzt im Schnitt 8-10 Kisten (sobald ich 'ne neue holen kann, bekomme ich die meistens auch) und bekomme vielleicht einmal die Woche ein Fragment. Die Truhen wollen also bei mir nicht so wirklich.\nAndere Leute bekommen z.T. 2 Fragmente am Tag!\nDas System sollte mal überarbeitet werden, dass man nicht von einem unnötig viel und vom anderen gar nichts hat.\nSchlüssel kaufen von RP sehe ich auch nicht ein, wenn ich doch eh weiß, dass ich die irgendwann umsonst bekomme.","replies":[]},{"poster":"Nordwolf87","date":"2018-09-03T06:53:31.480+0000","up_votes":1,"down_votes":0,"body":"Ich habe 0 Truhen (weil wenn ich eine bekomme mach ich sie gleich auf) aber dafür 18 Schlüssel und 2 Schlüsselfragmente rumliegen {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Lunaá","date":"2018-09-02T23:32:50.233+0000","up_votes":1,"down_votes":0,"body":"Ich finde das irgendwie auch sehr komisch, das manche ständig Schlüsselfragmente bekommen und andere nicht.\n\nEin Freund hat auf seinem Account mindestens schon 24 fertige Schlüssel dieses Jahr bekommen, während ich auf 9 komme, und das obwohl ich teilweise mehr spiele und ein höheres Honorlevel habe","replies":[]}]}