{"poster":"Messias98","date":"2015-04-08T04:19:11.998+0000","title":"¿Cuando van a actualizar las runas?","subforum":"Charlas Generales","up_votes":0,"down_votes":0,"body":"Bueno, como la mayoria saben, Riot en la version 5.4 (si no me confundo) propuso los cambios en las runas, sellos, marcas, etc, haciendo que sus precios disminuyeran muchisimo, eliminando las runas progresivas, y eliminando el &quot;reciclador&quot; de runas. \r\nEsto nunca me ha llegado, y espere muchisimo tiempo para que llegue, y al final tuve que comprarme mis runas a un precio carisimo, porque el mismo nunca bajo!\r\nLo unico que hicieron fue retirar el &quot;reciclador de runas&quot;, pero los precios nunca bajaron. \r\nMi pregunta es: van a cumplir con las propuestas que hacen?\r\nEspero su respuesta, gracias de antemano. \r\n\r\nPD: Soy de Argentina, por ahi es mi pais, aunque no creo. Quiero mis runas mas baratas {{item:3151}}","replies":[{"poster":"Revolución","date":"2015-04-08T14:18:27.337+0000","up_votes":2,"down_votes":0,"body":"No sé precisamente de qué estás hablando que en teoría dijeron que harían.\n\nHubo al inicio de temporada una semana de descuentos con un 2x1 en páginas de runas y 30% de descuento en todas las runas, era limitado y se notificó de tal manera.\nAsimismo, hubo un gran cambio anunciado en simultáneo con la eliminación del mezclador de runas, que era la modificación permanente de los precios de las runas grado 1 y 2, el cual se hizo efectivo y ahora para los que son menos de nivel 20 es viable comprar runas para tener mayores ventajas en sus partidas sin estar sacrificando la posibilidad de equiparse correctamente al llegar a nivel 20 con las runas grado 3 (los precios son tan baratos que solamente con una partida ganada con la bonificación de primera victoria del día un jugador de nivel 15 puede comprar runas de grado 2 para ocupar todos los espacios desbloqueados que tiene de momento). \n\nEntonces quizás no entendiste bien cómo fueron ambas circunstancias, te las aclaré para que entiendas.","replies":[]},{"poster":"Messias98","date":"2015-04-09T02:52:58.585+0000","up_votes":1,"down_votes":0,"body":"Ah bueno, gracias a todos por las aclaraciones, al parecer había entendido mal! Igualmente, estaria bueno que bajen el precio de las runas lvl3, son demasiado caras!","replies":[]},{"poster":"lordeman10","date":"2015-04-08T18:25:50.235+0000","up_votes":1,"down_votes":0,"body":"habla de los cambios, de cuando bajaron el precio de las runas de grado 2 y 1 (las de 3 siempre se dijo que no cambiarían) y eliminaron del combinador de runas básicamente porque era un noobtrap\n\nlos cambios de los que hablas eran todos hacia runas de grados bajos para que la gente de nivel bajo tenga mejor experiencia con el tema de las runas\n\nhttp://las.leagueoflegends.com/es/news/game-updates/gameplay/combinador-de-runas-g1/g2","replies":[]},{"poster":"Caraxes","date":"2015-04-08T16:13:14.555+0000","up_votes":1,"down_votes":0,"body":"Nunca dijieron que iban a cambiar el precio.\n\nHabían dicho en un momento que quizás iban a cambiar algunas estadísticas, pero fue una de las cosas que ni llegaron al PBE.\n\nEl precio no lo van a bajar, el hecho de que gastes PI ahi y no en campeones es una de las mayores cosas para que gastes RP en campeones.\n\nLo que si hicieron es eliminar el combinador y cambiar las mas baratas (Tier 1 y Tier 2)","replies":[]},{"poster":"Demiurgius","date":"2015-04-08T04:36:02.308+0000","up_votes":1,"down_votes":0,"body":"Las runas bajaron, hubo 2x1 de paginas, y runas con descuento.","replies":[]}]}