{"poster":"dArtagnan","date":"2015-12-07T22:10:38.352+0000","title":"[NEW] Having issues Patching 5.24? Click Here!","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":4,"body":"Hey all,\n\nSince this is the last patch of 2015, we want to make sure everyone is set up to do some League marthoning (is that a word?) during Winter Break (for many of you) goes off without a hitch! Below are some of the most common errors as well as the most common solutions for them.  Make a post if you are still having issues, and we'll respond back!\n\n-----------------------------------------\n\n> #***UPDATE: 12/10 -- Stuck at 33% and \"Applying Patches...\"***\n\n> This may be caused due to a problem connecting to our Patcher Servers.  At the time your patcher needs to connect to our servers and download the newest content, something is blocking the connection.  To hopefully resolve this, make sure to complete all of the steps in our [Connection Issues Article](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues).  \n\n> If you have tried all of the steps there without any luck, Make sure to [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new) and include the latest 3 patcher logs titled **LoLPatcher.log** NOT LoLPatcherUX.logs. You can find your patcher logs here:\n\n> C:\\Riot Games\\League of Legends\\Logs\\Patcher Logs\n\n----------------------------------------------\n\n> #***Files Scanned reaches over 9000!!!!! Or, 15k, 20k, etc***\n\nThe patcher needs to scan already installed files to make sure that none of the files are corrupt.  If it finds one, it replaces it and rescans the files.  This is why it can sometimes get as high as 20k, even though there aren't 20k files in the installation.  \n\n**The best thing to do is let it scan files!**  If you restart the client, it may cause it to scan even more files.   The patcher will eventually stop scanning files, and it will patch normally afterward.\n\n> #***Patcher never pops up, or disappears after you press \"LAUNCH\"***\n\nThis can be caused by corruption with the patcher itself or it failed to properly self-patch. Additionally, it may be due to some issues with the configuration of your computer system's permissions (meaning it can't properly save the files in the correct location). To resolve this, make sure to complete all the steps in our [Patching Issues Article](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues)!\n\n> #***Patcher stops/errors out at 33%, Patcher fails at 99%, or a general \"Unspecified Error has occurred\" message***\n\nThese are usually connection related errors. Either your computer is unable to maintain a stable connection, or a 3rd party security program is blocking League of Legends from properly patching. Many of the most common Anti-virus programs [have already whitelisted LoL](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3), however make sure to update yours to the latest version!\n\nAlso, even though you may have set specific exceptions in place before for your security program, League of Legends has gone through a major update. Therefore, your security program may recognize the old version of League of Legends, but not the new version. \n\nTo get these issues resolved ASAP, make sure to go through our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)!\n\n--------------------------------------------------------------\n\n*If after completing these steps, and you still do not see the glorious orange 'LAUNCH' button, feel free to drop us a post in this thread!  Rioters as well as Wrenchmen volunteers will be on hand to respond and provide some additional help!*","replies":[{"poster":"BronzeAdventures","date":"2015-12-09T15:05:23.969+0000","up_votes":10,"down_votes":1,"body":"Mine stays on 33% and it's \"applying differences|Applying patches...\" Yet, it seems like nothing is happening, it's been like that for a while{{champion:32}} plz rito{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Alex Stukov","date":"2015-12-09T18:54:57.391+0000","up_votes":5,"down_votes":0,"body":"same thing for me... \"applying patches\" for an hour and nothing...","replies":[]},{"poster":"dArtagnan","date":"2015-12-09T22:03:42.295+0000","up_votes":1,"down_votes":0,"body":"Hmmm....typically, the patcher will display something else such as an error message, or another detail other than \"applying patches\".  Since its getting stuck on this part specifically, this is a little unusual.\n\nI want to investigate a bit further, but first I want to confirm that you have tried all of the different steps in the [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues).  I'm not saying the issue is on your end, but it allows us to rule this out as a root cause so we can move onto other reasons.  \n\nIf none of those steps have helped, can you give a bit more information?\n\n* What type of network are you playing on? (At home, business Wifi, School Campus, etc)\n* Do you have a 3rd party firewall active?  Which one?\n* What OS do you have?","replies":[{"poster":"Zoinks","date":"2015-12-10T12:22:56.695+0000","up_votes":1,"down_votes":0,"body":"Home netwrok,eset smart security firewall (never caused any problems before),windows 10","replies":[{"poster":"Wuks","date":"2015-12-11T01:18:12.131+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zoinks,realm=EUNE,application-id=osqw6G4M,discussion-id=iuzbVX1W,comment-id=000100040003,timestamp=2015-12-10T12:22:56.695+0000)\n>\n> Home netwrok,eset smart security firewall (never caused any problems before),windows 10\n\nHave you already tried temporarily disabling ESET Smart Security?","replies":[{"poster":"Zoinks","date":"2015-12-11T05:23:41.200+0000","up_votes":1,"down_votes":0,"body":"Yes i even tried uninstalling it. Nothing\nThe patcher was stuck on 33% for a long time before the patch for me and when i uninstalled league and installed it again it reached 70% and then it crashed,when i relaunched it it was on 33%again and applying patches. Also when i turn my internet off while its patching it doesnt notice and says aplying patches.","replies":[{"poster":"Wuks","date":"2015-12-11T07:05:41.214+0000","up_votes":1,"down_votes":0,"body":"Hey Zoinks,\n\nCan you upload a patcher log to http://upload.wrenchmen.org/ and provide the link here? If you're unsure where to find the logs, check out [**this article**](http://www.wrenchmen.org/resources/knowledgebase/howto/16?view=article).","replies":[{"poster":"Zoinks","date":"2015-12-11T10:40:46.178+0000","up_votes":1,"down_votes":0,"body":"http://upload.wrenchmen.org/TDQ39V\nHello,i really need you to help me before sunday,because i am leaving on sunday for a long time (i will only come back on january 21st) so i will be unable to buy the snowdown skins then! I really want to buy them,so please help me fix this before sunday. Thank you so much :)","replies":[{"poster":"Wuks","date":"2015-12-11T11:34:50.844+0000","up_votes":2,"down_votes":0,"body":"It really looks like an issue with your S_OK file. Can you try this step again:\n\nGo to\n>C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_patcher\\releases\\ {highest version number}\n\nand copy the \"S_OK\" file.\nNow go to\n>C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_air_client\\releases\\ {highest version number}\n\nand paste the \"S_OK\" file. Now try to restart the patching process.","replies":[{"poster":"Zoinks","date":"2015-12-11T11:56:13.434+0000","up_votes":1,"down_votes":0,"body":"Nope,didnt do it....I also tried all the steps in the \"connection issues\" and it didnt help at all.\nMaybe this will help: I ran the ICSI netalyzer thing and it only found one bad thing,and that was:the dns resolver at 192.168.1.1 is not responding (Keep in mind that it only displays this error when i am on a wired connection)","replies":[{"poster":"Wuks","date":"2015-12-11T13:23:33.796+0000","up_votes":2,"down_votes":0,"body":"Hey Zoinks,\n\nThis may require some additional troubleshooting. Stop by the community chat at http://wrenchmen.org/invite and join the #help-and-support chatroom. We'd be more than happy to troubleshoot with you there!","replies":[]}]},{"poster":"TacoKingIII","date":"2016-01-04T22:53:51.440+0000","up_votes":1,"down_votes":0,"body":"Neither of those links work for me.","replies":[{"poster":"Wuks","date":"2016-01-05T02:59:42.268+0000","up_votes":1,"down_votes":0,"body":"You'd need to go to your own specific League of Legends folder and manually navigate until you go to the highest numbered folder; then you'd make the S_OK modifications.","replies":[]}]}]}]}]}]}]}]},{"poster":"Low Key Tilted","date":"2015-12-09T22:20:13.572+0000","up_votes":2,"down_votes":0,"body":"Home Network, no third party firewalls, Windows 8","replies":[]}]},{"poster":"cHampDAcHizLa","date":"2015-12-09T19:37:35.058+0000","up_votes":2,"down_votes":0,"body":"White-listed everything LoL related, tried fixing files, disabled a bunch of protocols, ran as administrator, opened several ports and closed them again, turned off all of my protection software, deleted everything and reinstalled, still having the same problem.","replies":[]}]},{"poster":"Wild Play","date":"2015-12-11T01:12:48.140+0000","up_votes":5,"down_votes":0,"body":"I have a problem that stuck on 0%. help to solve this problem. after i close they windows. it shows bug splat pop up","replies":[]},{"poster":"Frooster","date":"2015-12-11T00:35:48.698+0000","up_votes":4,"down_votes":0,"body":"For ANYONE who is stuck at 0% or 33% try this : Go to \n\nRiot games/League Of Legends/Rads/projects/lol_air_client/Releases/0.0.1.175  and here u are goin to create a file And save it as \n\n\"S_OK\"\nRemember than its on MAYUS and the  \"\"  are to make sure your file isnt saved as a txt. Now remove the original file you  create of the folder and restart your launcher that should fix it.","replies":[]},{"poster":"KubkaNoobka","date":"2015-12-09T19:05:22.569+0000","up_votes":4,"down_votes":0,"body":"Hi guys I tried lot of things and this helped me. :-)\nI hope that it will work for you too.\n\nGo to “C:\\Riot Games\\League of Legends\\RADS\\downloads”\nDelete everything within the folder\nGo back to “C:\\Riot Games\\League of Legends\\RADS\\projects ”\nDelete the lol_air_client and lol_air_client_config_na\nGo back to “C:\\Riot Games\\League of Legends\\RADS\\solutions”\nDelete everything within here\nRestart Computer\nRelauncher LoL as Administrator","replies":[{"poster":"Aphadek","date":"2015-12-09T19:49:05.441+0000","up_votes":3,"down_votes":0,"body":"Tried this. Looked like it was working - when I opened the client it was at 0% and began patching (I took that as a good sign since mine has been stuck at the 33% mark for well over an hour). But now it is back to 33% and looks like the same issue. I'll let it run for a bit and post back results..","replies":[{"poster":"Aphadek","date":"2015-12-09T20:59:39.585+0000","up_votes":3,"down_votes":0,"body":"Still 33%...","replies":[]},{"poster":"cHampDAcHizLa","date":"2015-12-09T20:01:29.387+0000","up_votes":2,"down_votes":0,"body":"Tried this, doesn't seem to be working, been on applying patches 33% for about 7 minutes now, if by some miracle it fixes itself, I'll post results.\n\nEDIT - Definitely didn't work, still having the same issue, I've tried every suggestion that applies to me in the link given in the original post, hope I'm not the only one still having this problem.","replies":[{"poster":"Aphadek","date":"2015-12-09T21:00:00.267+0000","up_votes":2,"down_votes":1,"body":"frustrating eh...","replies":[]}]}]},{"poster":"dArtagnan","date":"2015-12-09T22:54:28.918+0000","up_votes":1,"down_votes":0,"body":"Keep in mind that completing these steps essentially force your patcher to re-patch itself.  It is similar to the steps we have in our [Patching Issues Article.](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues#wq5)  \n\nIf your issue is not with the patcher itself, but due to a larger issue, this may not fix it.  It is a good initial step to try though!","replies":[{"poster":"Low Key Tilted","date":"2015-12-09T23:32:06.743+0000","up_votes":2,"down_votes":0,"body":"yeah gave these steps a try, it went back up to 33% and stopped once more, now my wifi did go down while the patch was updating so there could be an issue there, but ive tried every other step there is","replies":[]}]}]},{"poster":"Blackmersy","date":"2015-12-09T13:01:00.205+0000","up_votes":4,"down_votes":0,"body":"Patching don't work for some reason its on 0% and says\"applying patches\" for 2 hours and nothing stay's on 0% {{sticker:zombie-brand-mindblown}} {{sticker:zombie-nunu-tears}}","replies":[{"poster":"Blackmersy","date":"2015-12-09T13:07:53.616+0000","up_votes":2,"down_votes":0,"body":"im so sad i wanted to try new{{champion:78}} ;'cc","replies":[]}]},{"poster":"ChunkyMilkMornin","date":"2015-12-09T23:53:06.613+0000","up_votes":3,"down_votes":0,"body":"I have been stuck on applying patches (33%) for an hour now.{{item:3070}}","replies":[]},{"poster":"tintinchi","date":"2015-12-13T11:13:32.149+0000","up_votes":2,"down_votes":0,"body":"Was able to patch just fine, but the ping now is higher than usual and makes game unplayable. Please fix.","replies":[]},{"poster":"Sweetlake","date":"2015-12-11T15:48:43.867+0000","up_votes":2,"down_votes":0,"body":"When I start my launcher it says '1 file scanning' for a very short duration, and then goes to \"Applying differences | Applying Patches\". It just stays on 0%.\nToday is friday and I had no trouble whatsoever with my launcher the previous few days. I checked my permissions and they should be fine. My internet works fine as well. Help please?","replies":[]},{"poster":"jackpresident","date":"2015-12-11T14:41:41.691+0000","up_votes":2,"down_votes":0,"body":"mine stays on 0% and keeps on saying applying patches , but i already installed 5.24. What the hell is he doing than?","replies":[]},{"poster":"Rakkan","date":"2015-12-11T04:23:32.194+0000","up_votes":2,"down_votes":0,"body":"Hey guys! I just finished updating my League of Legends last night. I tried launching it this morning and it is stuck at 0% and says Applying patches... It has been like that for 3 hours already. Is there any solution to this? Thx","replies":[]},{"poster":"x7r4n3x","date":"2015-12-11T03:57:47.684+0000","up_votes":2,"down_votes":0,"body":"i already downloaded and applied the patch and played a few games yesterday and today its trying to redownload the patch but its stays at 0%","replies":[]},{"poster":"TheNekoGentleman","date":"2015-12-10T20:01:58.139+0000","up_votes":1,"down_votes":0,"body":"Hello, I'm having an issue with the second patch (apparently the Snowdown login one)\nIt's basically stuck at 0% with the \"Applying patches\" message.\nI'm sadly used to problems with patching. Our local ISP (Orange Tunisia) has a firewall that makes patching annoying and requires you to force it to work by closing and restarting the client when the patching get stuck until it goes through, but all post patches have flawless execution (like hotfixes, hello there {{champion:72}} ). However this time, it's reversed: I had a flawless patching yesterday morning and now, I get this patching issue that never happened before. I contacted the ISP and they told me they did no maintenance or change whatsoever to their Firewall, so I wonder... Any solution?","replies":[{"poster":"dArtagnan","date":"2015-12-10T20:35:03.710+0000","up_votes":2,"down_votes":0,"body":"Getting stuck at 0% usually indicates that the problem is not with your connection, but may be with a local setting on your computer.  It is between 0-32% where the patcher focuses on updating itself, or verifying files in your installation.  Therefore, make sure that you complete all of the steps in our [Permissions Article.](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions)  They are the most common solutions to resolve issues at this point.\n\nGive me a reply back if you are still not able to get past this point!","replies":[]}]},{"poster":"Astolfo du Noir","date":"2015-12-09T20:20:34.422+0000","up_votes":2,"down_votes":0,"body":"I have tried many suggested things all over and I'm stuck at \"Applying differences | Applying patches...\" 0%\n\nI'm afraid I might have broke something but I  think I should wait it now. I had a power surge while it looked like it was patching fine a while ago so now I'm a bit upset it seems I might have to reinstall... :/","replies":[]},{"poster":"Dylan654","date":"2015-12-09T19:40:46.806+0000","up_votes":2,"down_votes":1,"body":"Hi I play on a Mac and idk if its the new patch or not but clicking on the short cut for league it sat on my bar loading for 10 min before it even brought me to where I could start patching.  I dont think it was my computer and my internet was working properly, so yall might want to check and see if this is a problem for macs.","replies":[]},{"poster":"ThisNameNotUsed","date":"2016-01-29T23:05:46.157+0000","up_votes":1,"down_votes":0,"body":"Riot, \nYou're obviously doing a fantastic job supporting your HUGE population of users. Bravo, it's a breath of fresh air.\n\nHowever, not mentioning anything about Mac user's Patcher logs is a big fail. I haven't been able to find mine after looking a few times now. Do we even have them?","replies":[]},{"poster":"flying scorpion","date":"2016-01-08T23:58:16.472+0000","up_votes":1,"down_votes":0,"body":"My patcher doesn't even show up! I only know it is working because i can see it on windows task manager. I tried reeinstaling but all it did was remove the game and the problem continues plz help","replies":[{"poster":"flying scorpion","date":"2016-01-09T00:18:58.130+0000","up_votes":1,"down_votes":0,"body":"oh and when i let it get to the end an error box appears but it has no title and no text, only a button and it's white","replies":[]}]},{"poster":"Rimram","date":"2016-01-05T23:07:18.713+0000","up_votes":1,"down_votes":0,"body":"i was playing league of legends just fine yesterday but it suddenly started to freeze at 0% applying patches... when i close the window a bugsplat shows up and it starts all over again, i cant even repair since the same thing happens then too! \nConsidering the fact that i was playing league of legends perfectly fine 8 hours ago and my computer has not been touched or any of its settings changed, i doubt its a problem with permissions or settings or so on. plz rito halp. :(","replies":[]},{"poster":"Prohibited1","date":"2016-01-04T01:13:49.907+0000","up_votes":1,"down_votes":0,"body":"I haven't played League for a month, and now when I tried to update it, it just keeps getting to 3-6% and it just closes the window. Tried to repair, to re-install patch, uninstalling League and when I tried to install it again the same thing, antivirus is disabled. Help please...{{champion:17}}","replies":[]},{"poster":"bmfote","date":"2015-12-24T14:24:20.911+0000","up_votes":1,"down_votes":0,"body":"From reddit - worked for me! \nhttps://www.reddit.com/r/leagueoflegends/comments/3y13vy/league_of_legends_wont_open_fix_524/\n\nSo I've seen A LOT of people having a ton of issues getting League to open on reddit, league of legends forums, random forums... pretty much everywhere on the internet. Unfortunately Rito doesn't know whats going on and cannot figure out how to help fix this problem.\n\nFor most people the problem has been that the patcher doesn't load, or they get \"another instance is running\", or that league just doesn't do anything when they double click their icon.\n\nI've seen plenty of fixes on forums, youtube, Rito's very own page @ https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues\n\nBasically, I've spent the last 3-4 weeks trying everything I can to get League to work. FINALLY, i figured out how to get league up and running, have it patch, and run successfully.\n\nThe problem seemed to stem from something between League and Adobe Air interacting / patching. No matter what i did, i could not get the Adobe Air files to show, not even after uninstalling and reinstalling. These files can be found in your \"C:\\Riot Games\\League of Legends\\RADS\\Projects\" folder. I never once had \"lol_air_client\", \"lol_air_client_config_na\", \"lol_game_client\", lol_game_client_en_us\". Mine only ever contained lol_launcer and lol_patcher.\n\nSo finally, after a great day at work, I decided - I'm playing LOL over christmas weekend mother fuckers.\n\nI tried multiple ways but here's how i made it work:\n1.Start -> Control Panel -> Uninstall a Program\n2.Uninstall All Adobe\n   -Air \n   -Flash 12 ActiveX \n   -Flash 12 Plugin \n   -Reader XI\n3.Uninstall LOL\n4.Start -> Computer -> C:\\ \n   -Delete Riot Games Folder\n5.Program Data -Delete Adobe \n   -Delete Riot GAmes\n6.Go To C:\\Program Files (X86) \n   -Delete all Riot / Adobe folders\n7.C:\\User -> Name -> AppDate -> Local \n   -Delete Adobe\n8.C:\\User -> Name -> AppDate -> Local -> Temp \n   -Delete Adobe ARM files\n   -Delete Adobe SFX files \n   -Delete Bugsplat files \n   -Delete all LOL_Public/LOLPatcher files\n9.Restart Computer\n10.Open Internet Explorer -> Alt+x -> Internet Options -> Advanced -> Reset \n   -Reset Default Settings\n11.Restart Computer\n12.Download Riot Games.zip from https://www.dropbox.com/s/s0pk98idc00khjj/Riot%20Games.zip?dl=0\n13.Create Folder on Desktop \"LOL\"\n14.Extract to folder LOL\n15.Cut Riot Games from Folder LOL\n16.Paste in C:\n17.C: -> Riot Games -> League of Legends -> lol.launcher.admin \n   -double click\n18.Profit.\nI hope this works for everyone. I am up and running. I dont want gold, i dont want shout outs... i just want to play league! For the first time in 3+ weeks... here i come bronze!\nthrow away account.\nlove you bmfote","replies":[{"poster":"InkFrost","date":"2015-12-31T23:57:37.328+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bmfote,realm=NA,application-id=osqw6G4M,discussion-id=iuzbVX1W,comment-id=0073,timestamp=2015-12-24T14:24:20.911+0000)\n>\n> From reddit - worked for me! \n> https://www.reddit.com/r/leagueoflegends/comments/3y13vy/league_of_legends_wont_open_fix_524/\n> \n> So I've seen A LOT of people having a ton of issues getting League to open on reddit, league of legends forums, random forums... pretty much everywhere on the internet. Unfortunately Rito doesn't know whats going on and cannot figure out how to help fix this problem.\n> \n> For most people the problem has been that the patcher doesn't load, or they get \"another instance is running\", or that league just doesn't do anything when they double click their icon.\n> \n> I've seen plenty of fixes on forums, youtube, Rito's very own page @ https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues\n> \n> Basically, I've spent the last 3-4 weeks trying everything I can to get League to work. FINALLY, i figured out how to get league up and running, have it patch, and run successfully.\n> \n> The problem seemed to stem from something between League and Adobe Air interacting / patching. No matter what i did, i could not get the Adobe Air files to show, not even after uninstalling and reinstalling. These files can be found in your \"C:\\Riot Games\\League of Legends\\RADS\\Projects\" folder. I never once had \"lol_air_client\", \"lol_air_client_config_na\", \"lol_game_client\", lol_game_client_en_us\". Mine only ever contained lol_launcer and lol_patcher.\n> \n> So finally, after a great day at work, I decided - I'm playing LOL over christmas weekend mother fuckers.\n> \n> I tried multiple ways but here's how i made it work:\n> 1.Start -> Control Panel -> Uninstall a Program\n> 2.Uninstall All Adobe\n>    -Air \n>    -Flash 12 ActiveX \n>    -Flash 12 Plugin \n>    -Reader XI\n> 3.Uninstall LOL\n> 4.Start -> Computer -> C:\\ \n>    -Delete Riot Games Folder\n> 5.Program Data -Delete Adobe \n>    -Delete Riot GAmes\n> 6.Go To C:\\Program Files (X86) \n>    -Delete all Riot / Adobe folders\n> 7.C:\\User -> Name -> AppDate -> Local \n>    -Delete Adobe\n> 8.C:\\User -> Name -> AppDate -> Local -> Temp \n>    -Delete Adobe ARM files\n>    -Delete Adobe SFX files \n>    -Delete Bugsplat files \n>    -Delete all LOL_Public/LOLPatcher files\n> 9.Restart Computer\n> 10.Open Internet Explorer -> Alt+x -> Internet Options -> Advanced -> Reset \n>    -Reset Default Settings\n> 11.Restart Computer\n> 12.Download Riot Games.zip from https://www.dropbox.com/s/s0pk98idc00khjj/Riot%20Games.zip?dl=0\n> 13.Create Folder on Desktop \"LOL\"\n> 14.Extract to folder LOL\n> 15.Cut Riot Games from Folder LOL\n> 16.Paste in C:\n> 17.C: -> Riot Games -> League of Legends -> lol.launcher.admin \n>    -double click\n> 18.Profit.\n> I hope this works for everyone. I am up and running. I dont want gold, i dont want shout outs... i just want to play league! For the first time in 3+ weeks... here i come bronze!\n> throw away account.\n> love you bmfote\n\nI was wondering if there is any way to get this fix to work on a Mac, I have had the same problem of being unable to launch League since Thanksgiving. A month long support ticket and 3 reinstalls of my OSX later, I still can't launch. Any tips would be appreciated, I'm glad someone has been able to get through this issue. Maybe Rito will pull through eventually...","replies":[]},{"poster":"tenebris Deus","date":"2015-12-27T07:50:19.180+0000","up_votes":1,"down_votes":0,"body":"Should of asked before i started this process but... i was desperate {{champion:32}}.. But has this worked for anyone else?","replies":[]}]},{"poster":"EbonyDarkyD","date":"2015-12-17T02:16:39.365+0000","up_votes":1,"down_votes":0,"body":"1. I have a problem with the snow shop i had gotten Challanger {{champion:103}} for %40 and it said \"Had a problem Lifting my request giv eit another shot\" and it woulden't work","replies":[{"poster":"Kao Atlantis","date":"2015-12-29T21:35:57.377+0000","up_votes":1,"down_votes":0,"body":"Hello LindyXiao,\n\nI don't know if you got this resolved, but I would recommend that you contact Riot directly about this problem [at this link](https://support.riotgames.com/hc/en-us/requests/new). It's not something that would likely be able to troubleshoot on the boards.","replies":[]}]},{"poster":"Soul Slayer 24","date":"2015-12-28T05:00:32.460+0000","up_votes":1,"down_votes":0,"body":"Ok so my problem is weird...\nI start the update, leave it running and start using different programs on my PC, like Sony Vegas and CS6. I leave the update running for a while because it's 1.2GB big and yeah that takes a while, but after an hour or so of editing videos and images I go back and check the progress only to see that the launcher has shut down...\nPlease help I really love this game!","replies":[]},{"poster":"Enduringnu","date":"2015-12-27T17:42:38.756+0000","up_votes":1,"down_votes":0,"body":"my problem is that right after starting a game my screen will go black until I press the enter button and after that the loading screen with the champion pictures will appear for like one second and then the game crashes, I already tried everything, uninstalling Lol, turning off my firewall, changing the DNS and even updating my mac. Please help me I want to play League again","replies":[]}]}