{"poster":"dArtagnan","date":"2015-07-20T19:14:02.888+0000","title":"[NEW] Having issues Patching 5.14? Click Here!","subforum":"[ARCHIVED] Help & Support","up_votes":30,"down_votes":7,"body":"Hey all,\n\nDon't get absolutely bodied by patching issues like [this guy](https://www.youtube.com/watch?v=y6i4bTBjCXI)!  Get out of the corner, and unleash your troubleshooting combo!  Regardless of your match-up, these steps will help resolve your patching issues, and get you to the next round.\n\n*(PS. Mox is one of our very own in Player Support!)*\n\n-----------------------------------------\n\n> ***Launcher/Patcher never pops up, or disappears after you press \"LAUNCH\"***\n\nThis can be caused by corruption with the patcher itself or it failed to properly self-patch. Additionally, it may be due to some issues with the configuration of your computer system's permissions (meaning it can't properly save the files in the correct location). To resolve this, make sure to complete all the steps in our [Patching Issues Article](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues)!\n\n\n> ***Patcher stops/errors out at 33%, Patcher fails at 99%, or a general \"Unspecified Error has occurred\" message***\n\nThese are usually connection related errors. Either your computer is unable to maintain a stable connection, or a 3rd party security program is blocking League of Legends from properly patching. Many of the most common Anti-virus programs [have already whitelisted LoL](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3), however make sure to update yours to the latest version!\n\nAlso, even though you may have set specific exceptions in place before for your security program, League of Legends has gone through a major update. Therefore, your security program may recognize the old version of League of Legends, but not the new version. \n\nTo get these issues resolved ASAP, make sure to go through our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)!\n\n--------------------------------------------------------------\n\n*If after completing these steps, and you still do not see the glorious orange 'LAUNCH' button, feel free to drop us a post in this thread!  Rioters as well as Wrenchmen volunteers will be on hand to respond and provide some additional help!*","replies":[{"poster":"ThàtsWhàtSheZèd","date":"2015-07-22T18:53:27.142+0000","up_votes":30,"down_votes":1,"body":"What about the computer-freezing bug that came with patch 5.14? whenever i log in it just freezes my computer and having to hard reboot it everytime.\nSomebody help, i am not the only one with this new problem","replies":[{"poster":"dArtagnan","date":"2015-07-23T03:36:24.981+0000","up_votes":11,"down_votes":1,"body":"I have seen an increase of reports about this as well.  Let me talk to our teams here at Riot, and I will provide more information tomorrow.\n\nIf this is a problem on our end, we want to get this fixed ASAP!","replies":[{"poster":"dArtagnan","date":"2015-07-23T21:16:55.812+0000","up_votes":14,"down_votes":0,"body":"***UPDATE***\n\nWe believe we have identified the root cause to why these freezes are occurring.  We are currently testing it to confirm, as well as working on some possible solutions.  As of right now, we don't have any specific work-around, but I'll provide an update once we have one!","replies":[{"poster":"TheQueenOfATLBoo","date":"2015-07-23T22:34:50.798+0000","up_votes":16,"down_votes":1,"body":"So disappointed with Riot...Did you even check this patch? The lack of responses and absolutely no warning of the continuing bugs in-game (which causes a loss and afk report) is awful. The excitement of this event, completely gone. Can you just give the job back to Boomjpie? Mac users are clearly not as important to you.","replies":[{"poster":"dArtagnan","date":"2015-07-24T01:14:32.120+0000","up_votes":16,"down_votes":3,"body":"***JULY 24TH UPDATE***\n\nWe recently released a hotfix for the Mac crashes!  If you are still seeing the red box of death in the in-game store, or other freezes, make sure to [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can investigate this further!\n\n-----------------------------------------------\n\nSince discovering the issues with the Mac crashes, we have been working non-stop to get a solution.  We believe we have one, and are looking to hotfix this within the next 24 hours.  I'll update this post once we push it out!","replies":[{"poster":"Orph3us","date":"2015-07-24T01:51:22.754+0000","up_votes":8,"down_votes":1,"body":"Hey dArtagnan, thanks so much for your attention to this issue. We really appreciate the work you all are putting into fixing the bug, and we're glad that you are taking the time to get us back onto the rift.  So thanks!","replies":[]},{"poster":"BuBBrah","date":"2015-07-24T01:16:50.957+0000","up_votes":9,"down_votes":2,"body":"dude its not jsut fuking MAC is Windows as well .","replies":[{"poster":"Sir Tsuki","date":"2015-07-24T02:22:29.875+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=BuBBrah,realm=OCE,application-id=osqw6G4M,discussion-id=QKdzynEY,comment-id=001c00060000000200000000,timestamp=2015-07-24T01:16:50.957+0000)\n>\n> dude its not jsut fuking MAC is Windows as well .\n\nI believe everyone know that, but seeing as though fixing a problem with MAC (being as though MAC doesn't necessarily have the preferred operating system for games and is still technically in beta with LoL) would be infinitely harder than fixing a problem with PC (which we all know has an operating system that is a lot easier to configure for gaming) I think giving MAC the priority would just make for a faster and even more potent fix for PCs. If that makes any sense.","replies":[]},{"poster":"TheKingOfAHorse","date":"2015-07-24T01:27:41.454+0000","up_votes":5,"down_votes":0,"body":"No man, whats happening is that kinda the whole mac userbase is having their games crash after 5 minutes no matter what. :( cri evry tiem","replies":[]}]},{"poster":"Crackmaster69000","date":"2015-07-24T02:21:22.000+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=dArtagnan,realm=NA,application-id=osqw6G4M,discussion-id=QKdzynEY,comment-id=001c0006000000020000,timestamp=2015-07-24T01:14:32.120+0000)\n>\n> Since discovering the issues with the Mac crashes, we have been working non-stop to get a solution.  We believe we have one, and are looking to hotfix this within the next 24 hours.  I'll update this post once we push it out!\n\nOk, so its good to know we don't have to wait 2 weeks like usual........however,  many players, myself included have gotten a leaver buster queue for something that isn't our fault. Will these queues be removed?","replies":[]},{"poster":"The Reaper22","date":"2015-07-26T00:06:27.048+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=dArtagnan,realm=NA,application-id=osqw6G4M,discussion-id=QKdzynEY,comment-id=001c0006000000020000,timestamp=2015-07-24T01:14:32.120+0000)\n>\n> ***JULY 24TH UPDATE***\n> \n> We recently released a hotfix for the Mac crashes!  If you are still seeing the red box of death in the in-game store, or other freezes, make sure to [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can investigate this further!\n> \n> -----------------------------------------------\n> \n> Since discovering the issues with the Mac crashes, we have been working non-stop to get a solution.  We believe we have one, and are looking to hotfix this within the next 24 hours.  I'll update this post once we push it out!\n\nplease this is not only mac windows also have this issue please find a way for windows also we cant play league of legends as well :/","replies":[]}]}]},{"poster":"Warlørd","date":"2015-07-23T23:19:02.191+0000","up_votes":9,"down_votes":0,"body":"Can we just roll this one back until it's not broken? Seriously, I spend a lot of money with you guys and I can't even play right now because the MAC client is completely broken and btw... that new HUB is garbage... seriously, where's the ping button and why are the fonts small and very unfriendly to colorblind folks.","replies":[]},{"poster":"Pìp","date":"2015-07-23T22:22:22.896+0000","up_votes":5,"down_votes":0,"body":"Woop woop!\n\nAny ideas how long until it's going to be fixed? :D","replies":[]},{"poster":"B1uBbx","date":"2015-07-25T21:07:08.385+0000","up_votes":4,"down_votes":0,"body":"is there a solution for the freeze after login bug yet? or where will you provide that update?","replies":[]},{"poster":"Maniacman97","date":"2015-07-24T00:32:45.580+0000","up_votes":5,"down_votes":1,"body":"With all these comments about MAC users please remember that the bug is not only affecting MAC users but also us Windows users","replies":[]}]}]},{"poster":"mayhemmonster32","date":"2015-07-22T23:55:09.965+0000","up_votes":7,"down_votes":0,"body":"the same thing is happening to me","replies":[]},{"poster":"boxxeh","date":"2015-07-22T22:55:47.256+0000","up_votes":6,"down_votes":0,"body":"I thought my computer had a virus, thanks for letting me know its not just me!","replies":[]},{"poster":"Maniacman97","date":"2015-07-23T00:01:04.134+0000","up_votes":6,"down_votes":1,"body":"I'm having the same problem even though i tried the bugsplat solutions. I think the problem is on Riot's end and not ours","replies":[]}]},{"poster":"I WILL TROLL YOU","date":"2015-07-22T13:00:24.974+0000","up_votes":17,"down_votes":2,"body":"http://oi57.tinypic.com/fmoxeb.jpg","replies":[]},{"poster":"Klissah","date":"2015-07-25T02:27:30.631+0000","up_votes":9,"down_votes":0,"body":"So I updated LoL about a few days ago and the patch (5.14) was fine. Everything went well! So after the patch I played normally, just like yesterday night. However this morning, I didn't get to play bc my parents went to the beach and I had to go w/ other family members. Then I came back in the afternoon (which was an 1 hour ago) and I opened the LoL launcher but it said 33%, scanning files etc. I'm really worried. Am I the only one w/ this problem? Does this have to do w/ any bugs? Is this even a bug? Pls help!!! :(","replies":[]},{"poster":"Just Relax Babe","date":"2015-07-23T03:34:38.306+0000","up_votes":8,"down_votes":0,"body":"yeah I am having the same issue. Even the item buy menu has a weird red background {{champion:104}} {{item:3071}}","replies":[]},{"poster":"Who fed Neeko","date":"2015-07-23T01:13:22.510+0000","up_votes":2,"down_votes":0,"body":"ive read alot of problems but mine haves to be the most annoying of them all! when im in a league match and open the shop purchase, the background should be black but instead its red and i guess this is a bugg and it loggs me ot of league and tells me to reconnect. this wasnt a problem in patch 5.13 or the others but patch 5.14","replies":[{"poster":"dArtagnan","date":"2015-07-23T04:09:37.363+0000","up_votes":4,"down_votes":0,"body":"Just to confirm, are you using the Mac Client currently, or is this occurring on Windows?","replies":[{"poster":"P00nPlatoon","date":"2015-07-23T05:23:34.410+0000","up_votes":7,"down_votes":0,"body":"I have these exact problems and I run LoL using the Mac Client\nred shop screen and frequent crashes mid game. very irritating","replies":[{"poster":"dArtagnan","date":"2015-07-24T01:25:38.030+0000","up_votes":5,"down_votes":0,"body":"[I recently posted an update](http://boards.na.leagueoflegends.com/en/c/help-support/QKdzynEY-new-having-issues-patching-514-click-here?comment=001c0006000000020000) about this particular issue.  We should hopefully be able to fix this soon!","replies":[]}]}]}]},{"poster":"LegendLeaguend","date":"2015-07-24T18:24:55.380+0000","up_votes":6,"down_votes":0,"body":"Whenever i login to lol.client, after a while my whole computer freezes and i have to force restart my computer. I am having this problem from the recent patch.\nI have a windows laptop.\nProcessor-  intel core i5- 2.5 GHz\nRAM- 6GB\nSystem type: 64 bit OS\nWindows 8.1\nGraphics- INTEL(R) HD graphics 4600 & AMD Radeon HD 8750M\n\nPlease give an earliest response  {{champion:32}} ","replies":[]},{"poster":"Boanger","date":"2015-07-24T16:01:07.664+0000","up_votes":6,"down_votes":0,"body":"After getting back from a two week vacation I opened league and patched everything fine, I played 3 games last night on the most current patch. I wake up this morning and open league and the launcher is stuck at 33%. I have the same internet connection (with no dips in connectivity) and I just patched everything current 8 hours ago, now I a have to reinstall the entire game to play again. I even tried \"repairing\" which lead to 6 hours of scanning files and then nothing. Why?","replies":[]},{"poster":"Belluh","date":"2015-07-24T00:38:22.925+0000","up_votes":4,"down_votes":0,"body":"[This bug](http://boards.na.leagueoflegends.com/en/c/help-support/BdG6less-weird-lag-since-55) still continues to happen.\n\nAnd now, I am having an issue where I cannot move. Everything is working fine, and I can move my cursor, but when I click I do not move at all. It happened last game during crucial points and it was very irritating (considering the fact that Jinx kept flaming me).","replies":[{"poster":"Masoff","date":"2015-07-24T00:40:45.180+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Belluh,realm=NA,application-id=osqw6G4M,discussion-id=QKdzynEY,comment-id=0065,timestamp=2015-07-24T00:38:22.925+0000)\n>\n> [This bug](http://boards.na.leagueoflegends.com/en/c/help-support/BdG6less-weird-lag-since-55) still continues to happen.\n> \n> And now, I am having an issue where I cannot move. Everything is working fine, and I can move my cursor, but when I click I do not move at all. It happened last game during crucial points and it was very irritating (considering the fact that Jinx kept flaming me).\n\nIve been having the same problem, the two above. With the lag stopping all animation and sometimes i cant move due to whatever it is, id like to see it fixed sometime soon, ive been looking for a solution forever and no one seems to have a fix","replies":[{"poster":"Jmivl","date":"2015-07-24T00:52:24.101+0000","up_votes":6,"down_votes":0,"body":"My son keeps having the same problem.  But it seems google is not the answer to everything on this one. Rito please. I hope this problem gets fixed because league of legends is the only thing connecting my sons relationship with me. I like to see this get fixed for the sake of every nerd father and nerd sons relationship #DeepThoughts\n\n ","replies":[]}]}]},{"poster":"PattyWhack19","date":"2015-07-25T02:12:08.991+0000","up_votes":5,"down_votes":0,"body":"I had the computer freezing problem (Windows) so I restarted my laptop. Now it seems I can play but I have a black screen there is text that cannot be clicked that I can only see when I highlight it. I cannot start the Act 2 rewards because I can't click on the link. Does anyone else have this problem?","replies":[]},{"poster":"MHAZIQ19","date":"2015-07-23T22:06:12.785+0000","up_votes":5,"down_votes":0,"body":"My one won't continue. At 1% it still didn't move. At the beginning, it had 3500+ KBps and then it drops to 0 when ever \"Step 1/2 Updating Interface 1059mb (0KBps)\n\nI tried literally everything on Youtube, Google, these boards and it still won't work. Now I'm really getting annoyed by the lack of effort every update that Riot has put in. \n\nI tried the S_OK file, Repair on (?) icon at the launcher. I've tried re-launching it everytime. Yesterday i left it from 9PM to the next morning. It was still on 32%. It was on 0KBps but i worked really slow. Today I tried it again because it didn't even move a percent for 3 hours. I did everything.\n\nPlease I'm really desperate to play League again. ASAP.{{champion:245}} {{summoner:14}} {{item:3089}}","replies":[]},{"poster":"DozensOMangos","date":"2015-07-22T23:25:17.901+0000","up_votes":5,"down_votes":0,"body":"This patch makes my game crash multiple times a game and now im on low priority queue because of this patch. Also, rengar's ult is bugged. It turns the entire screen gray when you try to use it and you cannot see anything until it wears off. Please make quick changes to this buggy patch.","replies":[]},{"poster":"Wicked Speck","date":"2015-07-22T07:17:09.945+0000","up_votes":2,"down_votes":0,"body":"updating interface 2.96MB (0 KBps) ... The patch update just stop updating ... restarted several times no effect, PC restart no effect, Internet restart no effect.\n\nEdit: value increases after a while ... e.g.: 5.92MB (0 KBps) but there is no update ... Any fix?","replies":[{"poster":"jowo22","date":"2015-07-22T08:11:57.980+0000","up_votes":5,"down_votes":0,"body":"they didnt even bother helping mine or some other peoples issues on 5.13 with working solutions  doubt they got any for  5.14","replies":[]}]},{"poster":"Peek A Boo V","date":"2015-07-25T22:03:24.820+0000","up_votes":4,"down_votes":0,"body":"every time i log in league of legends my client freezes my whole computer and i need to shut down i am so upset riot always have something wrong with the game every month that makes it unplayable and i am really getting sick and tired of it they wont do anything about it either {{champion:32}}","replies":[]},{"poster":"Alan One","date":"2015-07-24T22:45:11.466+0000","up_votes":4,"down_votes":0,"body":"The patch worked for me yesterday and I got onto the game. Today when we logged on, or tried to, It had apparently deleted the previous downloaded patch and was re-downloading it. It got stuck at 33% for hours. IT took 4 hours of freezing up my computer to load to 76% then it stopped. I've tried re-downloading league, restarting the game 4 times, and rebooting the computer more times than I can count. The result: IT STILL WON'T WORK! I checked firewall and it's allowed but it is still stuck right where it started: @ 33%{{champion:32}}","replies":[]},{"poster":"Fe 4","date":"2015-07-24T21:21:57.828+0000","up_votes":4,"down_votes":0,"body":"This is a bug with the lanucher, and it just keeps on scanning files.","replies":[]},{"poster":"iGotThatAntidope","date":"2015-07-24T16:23:20.004+0000","up_votes":4,"down_votes":0,"body":"damn can we get a response?","replies":[]},{"poster":"Aitchi","date":"2015-07-22T22:38:12.258+0000","up_votes":4,"down_votes":0,"body":"When installing the patch it has froze at 33% and calculating differences'. How many files should need to be scanned before it works? It's currently at 15000 files but not sure if it is patching correctly.","replies":[]},{"poster":"jackeylauu","date":"2015-07-26T13:35:39.964+0000","up_votes":3,"down_votes":0,"body":"My windows 8.2 laptop was freeze after I login as well.","replies":[]},{"poster":"ProtectTheAdc","date":"2015-07-25T06:23:14.876+0000","up_votes":2,"down_votes":0,"body":"Update is fine for me but after login it freezes","replies":[{"poster":"iam10 21","date":"2015-07-26T02:54:21.960+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Doujin Cypher,realm=NA,application-id=osqw6G4M,discussion-id=QKdzynEY,comment-id=00b0,timestamp=2015-07-25T06:23:14.876+0000)\n>\n> Update is fine for me but after login it freezes\n\nYes, same. League please fix I would like to play some time today!!!!!!!","replies":[]}]},{"poster":"PotatoSir","date":"2015-07-25T07:50:45.337+0000","up_votes":3,"down_votes":0,"body":"Whenever I login to League, the home menu where most of the update information and event info is black for me however I can still access chat, find a game and my profile. I would like to continue the second act of the Bilgewater event, however in order to do so I need to accept a side of the story  located in the home menu which is currently just a black screen for me with a scrollbar on the side. I have already tried repairing the launcher and uninstalled and reinstalled League, however my home menu is still black. Is there anyone else who also has this or is this just me? \n\nP.S When I first launched League, after the 5.14 update, my whole computer froze but after a hard restart League no longer freezes but the home menu is just black for me ever since.","replies":[]},{"poster":"AuraBlade","date":"2015-07-25T06:32:20.146+0000","up_votes":3,"down_votes":0,"body":"Since yesterday patch or hot-fixes or dunno what was it but since that stuff, I have been with some lagg or mini frozes on my games, when my ping its around 80-110 always with my fps as stable as always (60fps) but I am getting this little laggy spikes or frozes when i kill a minion and the gold pop up after like 2 seconds and so on in all the game long, sometimes is good and then from time to time I am getting this, I also noticed this happened to twitch streams, cuz since yesterday I am getting every 10 sec buffering streams which are just impossible to watch it like I was doing it past days without that, everything else works fine with no lagg (youtube, etc etc). So I dont know if it was something that come with the patch but I am starting to guess it was and I dont know how to fix it.","replies":[]},{"poster":"Darkling115","date":"2015-07-25T01:28:31.180+0000","up_votes":3,"down_votes":0,"body":"How many files (exactly) are in patch 5.14 Bilgewater?????? PLZ answer in a {{summoner:4}}\n\nI am currently at 6500 files\n\nI redownloaded the patch i guess.... I hope there is no more issues","replies":[]},{"poster":"Tyrinnus","date":"2015-07-24T22:26:18.258+0000","up_votes":3,"down_votes":0,"body":"It appears that like the dozens of others here commenting on the same issue, I too am experiencing bugs with the patcher. The first time I attempted to patch LOL, I \"finished\" the patch, and logged on. The moment I logged on, my entire computer froze. I waited about 30 minutes, and then hard-reset my computer with the power button. When I re-openned LOL, I got an \"unspecific error\" and had to start the patch again, but this time at 33%. Now it's scanning files over and over again, but it's stuck on \"1 Files Scanned\". I let that sit for 30 minutes, and then X'd out of LOL to try again. Now on my third attempt to patch, and there has been no progress. I've already checked, the patcher has all the permissions necessary to run through my firewall. I checked my internet connection, and was able to (for example) load YouTube videos at perfectly normal speeds. Has Riot released a fix for this problem yet?","replies":[]},{"poster":"Wuzu","date":"2015-07-24T19:40:12.515+0000","up_votes":3,"down_votes":0,"body":"Today I opened the patcher and it sits at 33% and then after waiting a couple minutes, the patcher bugsplats. I have already installed 5.14 and I don't know what to do. Any help would be appreciated","replies":[]},{"poster":"Beats by Draven ","date":"2015-07-24T17:00:48.484+0000","up_votes":3,"down_votes":0,"body":"my league stops at 33% how can i fix this pls rito","replies":[]}]}