{"poster":"dArtagnan","date":"2015-07-06T20:16:43.206+0000","title":"[NEW] Having issues Patching 5.13? Click Here!","subforum":"[ARCHIVED] Help & Support","up_votes":12,"down_votes":7,"body":"*Hey all,*\n\n*Carrier has arriv-- ...errr...patch 5.13 has arrived!  If the patcher isn't appearing correctly, or is not patching normally, the steps here should get this resolved and back into the client!*\n\n-----------------------------------------\n\n> ***Launcher/Patcher never pops up, or disappears after you press \"LAUNCH\"***\n\nThis can be caused by corruption with the patcher itself or it failed to properly self-patch. Additionally, it may be due to some issues with the configuration of your computer system's permissions (meaning it can't properly save the files in the correct location). To resolve this, make sure to complete all the steps in our [Patching Issues Article](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues)!\n\n\n> ***Patcher stops/errors out at 33%, Patcher fails at 99%, or a general \"Unspecified Error has occurred\" message***\n\nThese are usually connection related errors. Either your computer is unable to maintain a stable connection, or a 3rd party security program is blocking League of Legends from properly patching. Many of the most common Anti-virus programs [have already whitelisted LoL](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3), however make sure to update yours to the latest version!\n\nAlso, even though you may have set specific exceptions in place before for your security program, League of Legends has gone through a major update. Therefore, your security program may recognize the old version of League of Legends, but not the new version. \n\nTo get these issues resolved ASAP, make sure to go through our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)!\n\n--------------------------------------------------------------\n\n*If after completing these steps, and you still do not see the glorious orange 'LAUNCH' button, feel free to drop us a post in this thread!  Rioters as well as Wrenchmen volunteers will be on hand to respond and provide some additional help!*","replies":[{"poster":"Cat Eyes","date":"2015-07-16T23:58:01.017+0000","up_votes":9,"down_votes":1,"body":"someone should probably mention the log in freeze that has come with this patch. many threads have been posted and nothing has been done about it. \ni myself have reinstalled, force shut down, and ran it as administrator. ive emailed riot and now im waiting for a response. HALP RITO ;3;","replies":[{"poster":"Say No to Krugs","date":"2015-07-18T17:53:58.370+0000","up_votes":3,"down_votes":0,"body":"I have emailed them 3 times. Because it has happened to me 3 times. All in ranked games. They do not care right now about fixing it at all. Every email I got back they either blamed it on my connection or just talk about a different topic like leaver buster. It makes me mad that a game that i have put hundreds of dollars into simply cannot get the game right after 5 years.","replies":[]}]},{"poster":"your warm uwu","date":"2015-07-10T00:58:17.812+0000","up_votes":4,"down_votes":0,"body":"I have been trying to download the new update. I restarted my computer twice. I even tried to reinstall the game. it wont update. I have 1196 MB, 0 kbps, and its stuck at 1%. I am very mad at this. I have been trying to fix this since noon. I just sits here. also, my brother downloaded illegal versions of five nights at freddys. I think this could by why LOL will not update. can someone help me? if not, fix this problem Riot.","replies":[{"poster":"Verdizko","date":"2015-07-23T04:27:56.402+0000","up_votes":1,"down_votes":0,"body":"That's exactly my problem too...reinstalled LoL for 5 times already, firewall and Antivirus down, resetted mt connection, eaven changed to a wired link instead of wireless, but still no progress...I am about to quit...","replies":[]}]},{"poster":"Tilly","date":"2015-07-11T06:03:02.508+0000","up_votes":2,"down_votes":2,"body":"_**I main {{champion:429}} and sometimes when I press her Q it doesn't work **_","replies":[{"poster":"FarianWarrior","date":"2015-07-11T13:13:22.374+0000","up_votes":3,"down_votes":0,"body":"Because they updated her so that you can't use her Q when she is doing that jumpy thing","replies":[]},{"poster":"shreder123","date":"2015-07-20T00:02:51.767+0000","up_votes":1,"down_votes":0,"body":"It's true. I've tried using it to kill enemies but it wont work.","replies":[]}]},{"poster":"RuffTuffAfroPuff","date":"2015-07-10T01:06:16.678+0000","up_votes":4,"down_votes":1,"body":"My league will not patch either. It patches correctly until 32 percent, then it shows an unspecified error message. I've disabled windows firewall, turned peer to peer transfer on and off, and tried repairing. Is there a solution to this?","replies":[]},{"poster":"SpyreLord","date":"2015-07-18T03:29:20.958+0000","up_votes":2,"down_votes":0,"body":"Hi, so whenever I login into my league account, my holy entire laptop will freeze. I mean my WHOLE laptop will freeze. Yesterday league was running fine and then _that_ happened. I've tried running the program as an administrator, changing my compatibility, and nothing is working. \n\nPatch 5.13  Windows 8.1\nThanks in advanced.","replies":[{"poster":"elduris","date":"2015-07-18T07:35:23.297+0000","up_votes":1,"down_votes":0,"body":"Hey SpyreLord!\n\nCan you provide us with a [DxDiag log](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5)?","replies":[{"poster":"SpyreLord","date":"2015-07-18T07:43:23.184+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Elduris,realm=NA,application-id=osqw6G4M,discussion-id=fvv2REqj,comment-id=009b0000,timestamp=2015-07-18T07:35:23.297+0000)\n>\n> Hey SpyreLord!\n> \n> Can you provide us with a [DxDiag log](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5)?\n\nGot it right here.\nGoing to bed won't respond for a while. Thanks for any help in the meantime :)","replies":[]}]}]},{"poster":"CptRageBeard","date":"2015-07-11T23:15:46.332+0000","up_votes":2,"down_votes":0,"body":"I have done everything this guide has said to do, and yet my patcher still insists on stopping at 33% and then just begins to continuously scan files to no end. This is really starting to give me a headache. I just want to play the damn game.","replies":[{"poster":"Wuks","date":"2015-07-12T01:57:19.685+0000","up_votes":1,"down_votes":0,"body":"Hey A Drunken Pyrate,\n\nCan you provide a patcher log for us to work off of?\nhttp://www.wrenchmen.org/resources/knowledgebase/16?view=article","replies":[{"poster":"CptRageBeard","date":"2015-07-12T15:26:51.261+0000","up_votes":2,"down_votes":0,"body":"Here's another one in case that first isn't right.","replies":[{"poster":"Wuks","date":"2015-07-12T16:17:02.197+0000","up_votes":1,"down_votes":0,"body":"Can you try resetting your Internet Explorer settings, and see if that works?","replies":[{"poster":"CptRageBeard","date":"2015-07-12T17:02:40.416+0000","up_votes":2,"down_votes":0,"body":"Would that be an issue? Because I don't use Internet Explorer.","replies":[{"poster":"Wuks","date":"2015-07-12T17:05:33.460+0000","up_votes":1,"down_votes":0,"body":"I don't use it either; however, the client does, so the settings there affect the way the client interacts with everything else.","replies":[{"poster":"CptRageBeard","date":"2015-07-12T17:09:38.252+0000","up_votes":2,"down_votes":0,"body":"Oh, okay. How do I change the settings, then, and to what do I change them?","replies":[{"poster":"Wuks","date":"2015-07-12T17:13:12.221+0000","up_votes":1,"down_votes":0,"body":"Try the solutions on this page: \nhttp://boards.na.leagueoflegends.com/en/c/help-support/qGY56UB4-comprehensive-troubleshooting-your-patching-issues","replies":[{"poster":"CptRageBeard","date":"2015-07-12T17:27:45.481+0000","up_votes":2,"down_votes":0,"body":"There doesn't seem to be anything on there about changing the settings in Internet Explorer. :(","replies":[{"poster":"Wuks","date":"2015-07-12T17:41:28.120+0000","up_votes":1,"down_votes":0,"body":"Yeah, those are just some additional steps if you haven't tried them already. \n\n> Here's the link to changing your Internet Explorer settings. (Try the SSL steps as well as the reset if the SSL steps don't work).","replies":[{"poster":"CptRageBeard","date":"2015-07-13T02:15:54.887+0000","up_votes":2,"down_votes":0,"body":"From where are you quoting that, because I cannot find it, even when I try to do so with crtl+f?","replies":[{"poster":"Wuks","date":"2015-07-13T03:36:25.393+0000","up_votes":1,"down_votes":0,"body":"I've had my fair share of awkward moments. This is one of them. T.T\nhttps://support.riotgames.com/hc/en-us/articles/201753044-Store-Error-Store-appears-blank-black-or-empty\n\nSorry about that.","replies":[{"poster":"CptRageBeard","date":"2015-07-13T03:48:44.337+0000","up_votes":2,"down_votes":0,"body":"So I'm trying that now, and it doesn't appear to be working. Something I noticed when trying to patch from the EU region is that the patcher appeared to be attempting to scan EVERY SINGLE FILE in the game folder instead of just the ones that needed to be updated.\n\nIs it supposed to do this? If not, how do I make it stop?","replies":[]},{"poster":"CptRageBeard","date":"2015-07-13T03:50:31.319+0000","up_votes":1,"down_votes":0,"body":"Is there anyway there's a physical copy of the patch online that I can use to patch the game manually, or no? Because this is all just getting incredibly tiresome.","replies":[{"poster":"AngelCharm","date":"2015-07-21T05:07:11.053+0000","up_votes":1,"down_votes":0,"body":"Wuks, How do we copy and paste the files you uploaded from your computer? :O","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"BakaNerd","date":"2015-07-12T17:09:30.648+0000","up_votes":2,"down_votes":0,"body":"I had my client crash yesterday right as I was about to head into an ARAM match.  I attempted to repair the client, which repeatedly failed.  As such, I completely uninstalled LoL, including deleting the leftover files, then performed a registry clean with CClean.  I have attempted to reinstall the client, but I receive the Unspecified Error at various points of the process.  I went through all of the steps to disable my firewall and antivirus temporarily, and I seem to have gotten it to install past the 33% mark.  However, when it begins to \"Apply Patches\" at around 72%, this takes an extremely long time, and at 78% crashed to the \"Unspecified Error.\"  Logs are attached:","replies":[{"poster":"Wuks","date":"2015-07-12T21:08:14.537+0000","up_votes":2,"down_votes":0,"body":"Hey CourtJester03,\n\nCan you try this: http://boards.na.leagueoflegends.com/en/c/help-support/qGY56UB4-comprehensive-troubleshooting-your-patching-issues","replies":[{"poster":"BakaNerd","date":"2015-07-13T05:04:39.371+0000","up_votes":1,"down_votes":0,"body":"it took what seemed like forever (I updated a laptop in half the time, and started the same time), but I finally got the patch to complete and it seems as if all is well.  Thank you for all the help!","replies":[{"poster":"Wuks","date":"2015-07-13T05:52:54.024+0000","up_votes":2,"down_votes":1,"body":"Hey CourtJester03,\n\nGreat to hear! Did you try any of the solutions, or was it just the waiting game?","replies":[]}]}]}]},{"poster":"Wezzley","date":"2015-07-10T19:38:56.090+0000","up_votes":3,"down_votes":1,"body":"my patch worked fine, made a team and just after it says prepare for battle it crashed! Are you kidding me?  3 times this has happened  even after i tried some of the fixes lol says to do. How are you gonna let someone build a team and when its time to battle it crashes??? And then League suspends my time for the next 5 games. WHY DOES LOL NEED TO CREATE SUCH A LARGE PATCH TO BEGIN WITH. Its not like yer gonna come out with another in 2 weeks. Im very frustrated and tired from being up all night trying to figure this out.   League needs to give me back my 5 games and throw in some RP points","replies":[{"poster":"elduris","date":"2015-07-11T20:48:07.364+0000","up_votes":2,"down_votes":0,"body":"Hey Wezzley!\n\nWhat kind of error message do you get when your game crashes?","replies":[]}]},{"poster":"QcSQUADOU","date":"2015-07-09T20:35:49.147+0000","up_votes":2,"down_votes":0,"body":"Hey guys! I tried to update LoL but the second step stops at 80%, and it says \"Updating League of Legends | 112 MB ( 0 KBps ). What do I have to do?","replies":[]},{"poster":"BrodieBrah","date":"2015-07-09T19:47:14.726+0000","up_votes":2,"down_votes":0,"body":"I downloaded the patch, have a fine internet connection(posting here). But when I try to play a game it goes into the champion loading screen and tells me I can't connect or I get a bug splat.","replies":[]},{"poster":"redduckto","date":"2015-07-10T02:18:59.212+0000","up_votes":1,"down_votes":0,"body":"pls help,it has been 5 hours,wtf","replies":[{"poster":"redduckto","date":"2015-07-10T02:20:50.479+0000","up_votes":1,"down_votes":1,"body":"i just wanted to play 1 ARAM,now you ruined my night...Can't you just leave it alone???Why the hell you guys do another patch for tahm kench instead for just 1 complete patch???Take your fkn champ and shove it up your arses!!!!!!No offense but f*ck you,it was a night with full of fun !!","replies":[{"poster":"Wuks","date":"2015-07-10T02:25:19.014+0000","up_votes":3,"down_votes":1,"body":"> Go to Riot Games/RADS/projects/lol_patcher/releases/0.0.0.31\nCopy the “S_OK” file.\nGo to Riot Games/RADS/projects/lol_air_client/releases/0.0.1.149\nPaste the “S_OK” file.\nRestart your League.","replies":[]}]}]},{"poster":"General Veers","date":"2015-07-10T15:28:51.655+0000","up_votes":1,"down_votes":0,"body":"Hello, please help me to get this game to patch.\n\nWhen I click the LoL shortcut, the LoL logo with a grey bar beneath it appears for a moment and then disappears.  Nothing further happens, and no LoL related processes show up in task manager.\n\nI have tried running the admin .exe, running the normal .exe with admin privileges, all combinations of compatibility modes and screen resolutions.  I have tried the recommended fix of deleting various files in the install directory.","replies":[{"poster":"General Veers","date":"2015-07-10T16:42:21.913+0000","up_votes":1,"down_votes":0,"body":"I resolved this issue by re-installing the game.","replies":[{"poster":"dArtagnan","date":"2015-07-11T01:10:08.898+0000","up_votes":2,"down_votes":1,"body":"Great to hear!  :D  It does honestly seem like this was some type of corruption in the patcher itself.  The re-install seems to have fixed this up!","replies":[]}]}]},{"poster":"xXDemoniXx","date":"2015-07-09T23:14:06.787+0000","up_votes":1,"down_votes":0,"body":"Hello in my passed games i played ranked and i was in my promos to silver and when i got into promos and i won three matches and lose 2 and I won series but it said i never did and i checked. league didn't record my match games and I don't know what to do now plz someone help me or tell me whats going on","replies":[{"poster":"dArtagnan","date":"2015-07-09T23:24:55.207+0000","up_votes":1,"down_votes":0,"body":"I went ahead and took a look at your account.  It appears that since series started, you have gone 2-1!  The game you played just a while ago, gave you that 2nd victory.  You're almost there!!!!  Just one more win and you can enter the land of Silver! :D","replies":[{"poster":"xXDemoniXx","date":"2015-08-08T05:06:26.594+0000","up_votes":1,"down_votes":0,"body":"Thx riot your the best! =D","replies":[]}]}]},{"poster":"B RIZZLE MRDR","date":"2015-08-06T00:18:14.041+0000","up_votes":1,"down_votes":0,"body":"Hi! I am a D5 player ready to get back on the rift but I am having a problem with this patch I usually do not have. After I tried downloading the patch a couple of times (I usually average 2-4 bugsplats before it finishes, every patch.) the patch finished downloading. Then I pressed launch and it froze my computer. When I opened LOL next, it came up with a message \"unspecified error, check logs for info\" and stays at \"1 files scanned\". I have tried the remedies explained in the riot-provided videos and none of them worked. Please help :)","replies":[]},{"poster":"NateIsGay","date":"2015-08-05T13:47:01.506+0000","up_votes":1,"down_votes":0,"body":"It's the 5th of August and I think GP has been reenabled, when the patch began it stopped at 33% and is stuck on scanning files at 17k fil- wait nevermind! It just kicked! 50% and counting :D Yay!","replies":[]},{"poster":"OptikFluk3","date":"2015-08-02T13:25:08.342+0000","up_votes":1,"down_votes":0,"body":"so ever since april 14th i havent been able to play lol its pissed me off to the point were im about to quit ive reinstalled it so many times tried all the recommended suggestions but nothing ever happens when i open the file the logo shows up but thats it in task manager leagues gpu is 00 idk what that means but come on ever since the patch up back then i havent been able to get into the damn thing im not spending another cent on the game its screwed riot really needs to do something about this or they are gonna lose alot of players thanks to not opening please help i really wanna jump back into summoners rift u.u","replies":[]},{"poster":"Espectro90008","date":"2015-08-01T21:48:39.381+0000","up_votes":1,"down_votes":0,"body":"So I was returning to LoL after a couple of years because I'm having a Lan party tomorrow and I was in charge of preparing the PC's but I can't install the damn game been trying for days to no avail but it never goes past 33%, it starts at 300 KBps and it goes down litle by little until it stops at 0 KBps.\n\nI already tried everything on the connection issues guide and lurked this and other forums for a solution but nothing works.\n\nSo sad I have always liked LoL but I rarely have time to play video games anymore much less multiplayer games.\n\nBut I suppose that I could try again in six months during my next vacation.","replies":[]},{"poster":"gladiators1114","date":"2015-07-16T17:09:47.911+0000","up_votes":1,"down_votes":0,"body":"guys i wanted to buy cassiopedia  i went to my profile and i cant enter champions can u pls help me{{item:3070}}","replies":[{"poster":"Wuks","date":"2015-07-17T11:34:06.355+0000","up_votes":1,"down_votes":0,"body":"Hi gladiators1114,\n\nAs this isn't a patching related issue, I recommend you submit a new thread in the Help & Support Boards with as much information as you can provide, so that we can better assist you. \n\nhttp://boards.na.leagueoflegends.com/en/c/help-support/submit","replies":[]}]}]}