{"poster":"dArtagnan","date":"2015-08-03T21:10:58.306+0000","title":"[NEW] Having issues Patching 5.15? Click Here!","subforum":"[ARCHIVED] Help & Support","up_votes":6,"down_votes":4,"body":"Hey everyone,\n\nAll hail the return of Gangplank! When he retires for the evening, turns on his computarrrrr, and tries to patch League of Legends, he may encounter an issue.  While Gangplank would resolve this by either shooting his computer (and earning a few coins on the side) or by eating an orange, you should be able to resolve any patching issues you are experiencing by following these steps!\n\n-----------------------------------------\n\n> ***Launcher/Patcher never pops up, or disappears after you press \"LAUNCH\"***\n\nThis can be caused by corruption with the patcher itself or it failed to properly self-patch. Additionally, it may be due to some issues with the configuration of your computer system's permissions (meaning it can't properly save the files in the correct location). To resolve this, make sure to complete all the steps in our [Patching Issues Article](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues)!\n\n\n> ***Patcher stops/errors out at 33%, Patcher fails at 99%, or a general \"Unspecified Error has occurred\" message***\n\nThese are usually connection related errors. Either your computer is unable to maintain a stable connection, or a 3rd party security program is blocking League of Legends from properly patching. Many of the most common Anti-virus programs [have already whitelisted LoL](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3), however make sure to update yours to the latest version!\n\nAlso, even though you may have set specific exceptions in place before for your security program, League of Legends has gone through a major update. Therefore, your security program may recognize the old version of League of Legends, but not the new version. \n\nTo get these issues resolved ASAP, make sure to go through our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)!\n\n--------------------------------------------------------------\n\n*If after completing these steps, and you still do not see the glorious orange 'LAUNCH' button, feel free to drop us a post in this thread!  Rioters as well as Wrenchmen volunteers will be on hand to respond and provide some additional help!*","replies":[{"poster":"BoDwhere","date":"2015-08-05T14:02:09.641+0000","up_votes":8,"down_votes":1,"body":"Your new font doesn't scale: http://i.imgur.com/9ixX1JM.jpg","replies":[{"poster":"Wuks","date":"2015-08-05T21:11:29.552+0000","up_votes":1,"down_votes":1,"body":"Hey BoDwhere,\n\nLeague of Legends does not currently support 4K resolution at this time, and I'm not aware of any workarounds for this issue. You could try going into game.cfg and manually putting the text scaling to a small number and see if that resolves your issue, but beyond that, there's not much more I can do to help.","replies":[{"poster":"Ben Thayer Sucks","date":"2015-08-05T23:04:07.722+0000","up_votes":4,"down_votes":1,"body":"Please, I know there is no support for 4K resolution and there have been complaints about this for a while. Before patch 5.15 there were things that didn't fit but it was bearable and playable but with this HUD change even from that of the 5.14 it now becomes almost impossible to play. I really enjoy League of Legends and I really want to play it. It is slightly ridiculous that I am unable to do that. 4K displays are becoming more and more popular please help us play your game and stop ignoring us.","replies":[{"poster":"Rodgers","date":"2015-08-07T04:21:18.591+0000","up_votes":6,"down_votes":0,"body":"shall we petition for Riot to add 4K support?","replies":[]}]}]}]},{"poster":"LimpTrisket ","date":"2015-08-06T00:34:34.967+0000","up_votes":3,"down_votes":0,"body":"Downloaded patch and now having issues logging in, connecting to chat, and having HUGE spikes of lag in-game that make playing impossible. Was fine before I downloaded patch. Please help!","replies":[{"poster":"Garemite","date":"2015-08-06T03:24:21.004+0000","up_votes":2,"down_votes":0,"body":"Having the exact same issues. Every once and a while when I manage to log on, I get huge spikes of lag that don't even register on the ping indicator, and they're constant. Game is basically unplayable at this point.\n\nEDIT: Do you happen to live in Colorado? After reading a bit more on this particular issue, it seems to only be happening to those who live in the Denver area.","replies":[{"poster":"Wooden Spoon","date":"2015-08-06T04:14:06.319+0000","up_votes":2,"down_votes":0,"body":"Check the boards, seems there are problems with comcast for those who live in Colorado or are around that area. Rito said they'll work to fix it, but that was 6 hours ago.....","replies":[]}]},{"poster":"dArtagnan","date":"2015-08-06T03:27:31.330+0000","up_votes":2,"down_votes":0,"body":"All of the different problems you listed all point to some type of connection issue.  Your computer is trying to connect to our PvP.net or Game Servers, but is having a hard time maintaining a solid and stable connection.  Make sure that you complete all of the different steps in our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues).  The steps there have the most common solutions that should prevent these disconnections.\n\nLet us know if you are still having any issues!","replies":[]},{"poster":"Zohayb","date":"2015-08-20T04:11:09.982+0000","up_votes":1,"down_votes":0,"body":"same exact thing that happened to me. i wish you can just get an old patch so i can actually play league of legends","replies":[]}]},{"poster":"CrazyAMonkey","date":"2015-08-09T17:46:16.835+0000","up_votes":2,"down_votes":0,"body":"I can't log into League. I run the application as administrator and the launcher pops up. I press the launch button and the sfx plays but nothing happens the game doesn't launch. This happened just after i installed patch 5.15. I was having no issue with patch 5.14. Does it have anything to do with windows 10? I have the latest nVidia graphics drivers. So what could be causing this issue. It feels as though the launcher is slow to respond but I am not positive. I have tried everything to fix it including a full reinstall. What do I do? {{item:3070}}  QQ","replies":[{"poster":"elduris","date":"2015-08-10T00:27:00.316+0000","up_votes":2,"down_votes":0,"body":"Hey CrazyAMonkey!\n\nCan you provide us with some more information about your computer? Please [attach a DxDiag](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5) log to a post here so we can have a better understanding.","replies":[]}]},{"poster":"Skalfred","date":"2015-08-07T11:34:57.971+0000","up_votes":2,"down_votes":0,"body":"After i log in the launcher starts to load up the main page but only stops and freezes my entire computer.","replies":[{"poster":"elduris","date":"2015-08-10T00:23:14.605+0000","up_votes":1,"down_votes":0,"body":"Hey Skalfred!\n\nCan you provide us with some more information about your computer? Please [attach a DxDiag](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5) log to a post here so we can have a better understanding.","replies":[{"poster":"Skalfred","date":"2015-08-11T03:09:44.699+0000","up_votes":1,"down_votes":0,"body":"Okay the troubles are back here is the DxDiag Log","replies":[]}]}]},{"poster":"Swift Ninja Ace","date":"2015-08-07T04:07:09.897+0000","up_votes":2,"down_votes":0,"body":"my laptop freezes when i log on to the client\n\ni have a 8.1 hp notebook laptop","replies":[]},{"poster":"Lueroi","date":"2015-08-06T05:56:54.737+0000","up_votes":2,"down_votes":0,"body":"My FPS completly shot down after this patch which makes it almost unplayable :,(","replies":[{"poster":"dArtagnan","date":"2015-08-07T04:05:09.736+0000","up_votes":2,"down_votes":0,"body":"Keep in mind that **CrimsonExorcist, Nox Interna , and Celeste96**  are all ***completely*** separate issues.  Even though this is threaded together, I am going to treat every single one differently.\n\nRegarding your FPS, it sounds like there might be some outdated hardware that is causing your FPS to tank.  If you haven't already, make sure that you have updated your Graphics Card drivers to their latest version.  If you have, and are still seeing issues, make sure to reply back and attach the following logs:\n\n1) [DxDiag](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5)\n\n2) [Your latest R3d Log (check the date!)](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq7)","replies":[]}]},{"poster":"Tzar","date":"2015-08-06T15:33:44.756+0000","up_votes":1,"down_votes":0,"body":"I've been having a huge hud text problem like other people and was wondering if there was a fix for it.\n\nPic: http://imgur.com/JYuRVOW","replies":[{"poster":"Lost 4ever","date":"2015-08-06T16:05:45.355+0000","up_votes":2,"down_votes":0,"body":"I 've the same problem with u, now i cant play the game cause the huge text, hope riot can fix it soon","replies":[]}]},{"poster":"TILT PR00F","date":"2015-08-05T21:37:48.561+0000","up_votes":1,"down_votes":0,"body":"i deleted the file archives folder within my c-drive to see if that would be enough to allow me to patch , still no success. It will get past 33% now but seems stuck at 99% (applying patches) for a while now.","replies":[{"poster":"dArtagnan","date":"2015-08-06T04:04:50.408+0000","up_votes":2,"down_votes":0,"body":"If you are consistently getting suck at 99%, it sounds like there might be some type of connection issue, blocking you from downloading the final pieces of the patch.  The best steps that resolve this issue are found in our [Connection Issues Guide.](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)  There are quite a bit there, but make sure to complete every single one!\n\nLet us know if it still happens!","replies":[]}]},{"poster":"Alpha Mystogan","date":"2015-08-05T21:55:26.708+0000","up_votes":1,"down_votes":0,"body":"I can launch my client, but when it gets to the log on screen it just completely goes black. I can hear the music and everything and I was even able to log in by guessing where to click and type my password in but it was still just a black screen. I don't know if this has anything to do with Windows 10 because or Patch 5.14 because all of them started at the same time. Please help!","replies":[{"poster":"dArtagnan","date":"2015-08-06T03:57:45.270+0000","up_votes":2,"down_votes":0,"body":"It is definitely possible that this is caused by a rare Windows 10 interaction with League of Legends.  Have you had a chance to try the steps in [this post](http://boards.na.leagueoflegends.com/en/c/help-support/AnR7gUle-will-windows-10-and-league-of-legends-be-friends?comment=0001) at all?  It should help resolve this.\n\nLet us know if you are still seeing it!","replies":[{"poster":"Alpha Mystogan","date":"2015-08-07T21:43:18.560+0000","up_votes":1,"down_votes":0,"body":"I finished all of the steps and even reinstalled the game but nothing changed. Is there any other advice, or maybe a deadline as to when this problem will be fixed?","replies":[{"poster":"dArtagnan","date":"2015-08-12T20:18:39.272+0000","up_votes":1,"down_votes":0,"body":"Finding the root cause can be pretty tricky, especially with Windows 10 being so new. Therefore, if you are still experiencing the same issue, make sure to [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new)!  One of our Tech Specialists should be able to take a much more in-depth look and provide some further steps.","replies":[]}]}]}]},{"poster":"IBlewYourFlash","date":"2015-08-10T01:49:20.633+0000","up_votes":1,"down_votes":0,"body":"Before downloading this patch I upgraded to Windows 10. After that I patched League of Legends just fine. Currently patch 5.15. I started to play and I realized that during my game play my screen freezes for about .5 seconds occasionally. This has never happened before. It is really bothersome and affects my game play very negatively. I decided it must be Windows 10 so I downgraded back to Windows 7. It still happens! Anyone else having this problem? Please help.","replies":[{"poster":"dArtagnan","date":"2015-08-12T20:45:49.912+0000","up_votes":1,"down_votes":0,"body":"This seems to point to a problem with your hardware/software interaction, possibly your graphics drivers.  In an attempt to look into this further, can you reply back and attach the following logs?\n\n1) [DxDiag](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq5)\n\n2) [Your latest R3d Log (check the date!)](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq7)\n\nI should be able to investigate a bit deeper!","replies":[{"poster":"y u jew","date":"2015-09-12T16:42:27.536+0000","up_votes":1,"down_votes":0,"body":"I Still got this problem, even tho graphic drivers are all properly updated:( pls halp","replies":[]},{"poster":"IBlewYourFlash","date":"2015-08-21T22:19:41.095+0000","up_votes":1,"down_votes":0,"body":"Thank you for your reply. It was my graphics driver. I had to roll it back. Had some glitches in it I think. Thanks for your time.","replies":[]}]}]},{"poster":"Tr4shTv","date":"2015-08-20T21:55:07.289+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nI dunno if I'm alone tho I don't think so since Ive seen streaming players having the same problem live.\n\nSince I patched in 5.15 (and sadly remains in 5.16) I can't get in a game without having to reconnect 4 game outta 5.\n\nBasically, \n\n> I login - ok\n> Create game or join one - Ok\n> Champ selection - Ok\n> Game start... and I can't connect to game - Ko\n\nI get a message saying I couldn't connect to game server + Retry / Cancel.\n\nTryed retry - never worked.\nTryed Cancel -> I come back on lobby with the box asking me to reconnect.\n\n-> After several try I can finally reconnect but usually not before 5-6 minute in game.\n\nIts doing it honestly 4 game outta 5 and I can't play ranked in that condition since 5-6 min 4v5 is often far enought for a stomp.\n\nIs Riot aware of that bug ? \nIs there any investigation in progress ? \n\nThx for ur actions.\nBR.","replies":[]},{"poster":"Psyduck Soup","date":"2015-08-19T06:55:13.674+0000","up_votes":1,"down_votes":0,"body":"Havent played for a good 2 weeks. But when I came back, my friends told me I was \"bullshitting\" about not playing, I was so confused, they told me I had MATCH HISTORY and the day I came back, and even before. I come back to being banned until August 30th, this is the 2nd time this has happened to me, happens more, and I can get perm banned. and all the money n my account, gone. I can wait for the ban, but this is bs. {{item:3070}}","replies":[]},{"poster":"Hich2000","date":"2015-08-18T11:20:42.681+0000","up_votes":1,"down_votes":0,"body":"I have been looking all over for a sollution but I just can't find one so I hope you guys might know the answer.\nSince I downloaded the patch there have been a couple isseus that have never popped up before, the first being that whenever I try to start a normal or ranked match the accept/decline box never shows up, my screen doesnt even go dark and the timer just keeps ticking buf after a while it will throw me out of queue because I didn't respond.\nSecondly whenever I invite a friend he says that he joined the game but my screen doesn't show him in the lobby, and whenever he invites me (if I get the invite that is) the launcher doesn't show it when he starts the game so after a while we get thrown out because I couldn't respond.\nThirdly and finally the teambuilder doesn't show when someone is available to join or when I join a room it doesn't allow me to click ready even when the room is full.\nI have re-installed and repaired a couple times already,  enabled lol on through my firewall and it's whitelisted on my antivirus but the problems keep persisting, I also don't think that it is my internet connection as that would mean that I couldn't play online games at all, but I have still been able to play heroes of the storm, dota 2 and other games just fine.\nI hope that you people at riot know of a sollution to this problem because it's driving me insane.\n\nEDIT: I know I'm a little late but I got back from a vacation last saturday so I hope it's not too much of a hassle","replies":[]},{"poster":"Bobby Axelrod","date":"2015-08-18T08:34:55.391+0000","up_votes":1,"down_votes":0,"body":"Not sure if this thread is dead but the launch button on my launcher doesn't work, I have attempted to reinstall many times and every time has been unsuccessful. Also my client doesnt patch it seems to go straight into launch button would this have a relationship with my issue.","replies":[]},{"poster":"CrownXx","date":"2015-08-17T17:43:41.748+0000","up_votes":1,"down_votes":0,"body":"how do i  see my fps and ping?","replies":[]},{"poster":"Reilune","date":"2015-08-17T16:35:28.271+0000","up_votes":1,"down_votes":0,"body":"Yesterday while I was playing  ARAM the enemy {{champion:74}} 's turret was glitching and kept firing at me, it wasn't doing damage but it was stuck firing, everyone saw it, it was weird. Also, a couple of the snowballs didn't work, and when people tried to jump, they would go invisible and the animation look/sound of the person hitting the person they fly to went through, but the person appeared back in their spot where they were jumping from and didn't actually fly to the person, it happened to me once and to someone on the other team once.\n\nAlso, are you guys considering seasonal ARAM layouts like was previously suggested in another form post in relation to the Bilgewater ARAM map?\n\nAlso.. {{champion:104}}  <<<--this guy wants his cigar back.","replies":[]},{"poster":"24K Dama","date":"2015-08-16T23:34:47.089+0000","up_votes":1,"down_votes":0,"body":"please solve the font scaling problem with 4k monitors its almost impossible to play.","replies":[]},{"poster":"Enchanté","date":"2015-08-16T10:50:09.924+0000","up_votes":1,"down_votes":0,"body":"I dont have any of the issues above, but I'm recently having these \"sliding\" laggs :/ like the pings are fine, my internet speed is fine, everything else is fine, but my character just slides everywhere and the delay of spells and auto is just crazy. \n\nIs this just me or everybody else is experiencing this?","replies":[]},{"poster":"Yggdrasil Leaf","date":"2015-08-05T13:07:38.093+0000","up_votes":1,"down_votes":1,"body":"Hello,\nI'm stuck at 5% currently patching, with 0 KBps. I've already tried repairing and following the patching steps on the website. What should I do? I have let the patcher do its thing for about three hours with no progress being made.","replies":[{"poster":"swcs2013","date":"2015-08-16T08:48:23.704+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=evilshorty,realm=NA,application-id=osqw6G4M,discussion-id=QuRd8fR7,comment-id=0001,timestamp=2015-08-05T13:07:38.093+0000)\n>\n> Hello,\n> I'm stuck at 5% currently patching, with 0 KBps. I've already tried repairing and following the patching steps on the website. What should I do? I have let the patcher do its thing for about three hours with no progress being made.\n\nsame bro","replies":[]}]},{"poster":"Josome","date":"2015-08-16T02:52:37.718+0000","up_votes":1,"down_votes":0,"body":"When re-downloading  league on my mac is keeps saying (0kbps) I did the DNS and it worked but only until 48% Please help I've been having this problem for quite a while now","replies":[]},{"poster":"Nugamachi","date":"2015-08-16T01:31:31.756+0000","up_votes":1,"down_votes":0,"body":"While i'm in game my screen will randomly mess up. I play on free camera mode( not lock screen) and sometimes in the middle of the game my screen will just go wherever it wants and I cant really control it. I have to play on lock screen for about 15 minutes and then it works again, i dont know what is causing this but it is very irritating because I absolutely hate lock screen. No clue what to do","replies":[]},{"poster":"Zeetru","date":"2015-08-14T15:25:10.626+0000","up_votes":1,"down_votes":0,"body":"My patcher has been jumping from 2500mbs>2000mbs over and over. (The file download not kbs) In over 10 hours my patcher has been stuck around 33-37% and it's taking ridiculously longer than it should, my internet is completely fine too.","replies":[]},{"poster":"swcs2013","date":"2015-08-14T07:03:08.078+0000","up_votes":1,"down_votes":0,"body":"my patch is mess up and i always got an error every i ptch ot and its so slow i need help now rito","replies":[]},{"poster":"Rapidoyfurioso09","date":"2015-08-05T19:18:49.999+0000","up_votes":1,"down_votes":0,"body":"i cant play now for this PATH 5.15 NOTES","replies":[{"poster":"swcs2013","date":"2015-08-14T06:49:59.946+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rapidoyfurioso09,realm=NA,application-id=osqw6G4M,discussion-id=QuRd8fR7,comment-id=000c,timestamp=2015-08-05T19:18:49.999+0000)\n>\n> i cant play now for this PATH 5.15 NOTES\n\nsame","replies":[]}]},{"poster":"ImpracticalFein","date":"2015-08-05T16:24:33.384+0000","up_votes":1,"down_votes":0,"body":"Well I too am having a problem with patching 5.15 except my problem isn't that it crashes or stops patching, but rather it never patches at all. I open the LoL launcher and i click LAUNCH and i play like I would any other time. I just played an ARAM with a teemo who did have the patch, so his changes like the constant stealth in bush and throwing shrooms (thanks riot) were showning up for me yet i had not even updated yet. I naturally thought he was hacking, but League is usually free from hacks which made me question it. It makes no sense as to why I've played with people who have patched LoL, but my launcher has not. Please help!","replies":[{"poster":"swcs2013","date":"2015-08-14T06:48:21.494+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImpracticalFein,realm=NA,application-id=osqw6G4M,discussion-id=QuRd8fR7,comment-id=000a,timestamp=2015-08-05T16:24:33.384+0000)\n>\n> Well I too am having a problem with patching 5.15 except my problem isn't that it crashes or stops patching, but rather it never patches at all. I open the LoL launcher and i click LAUNCH and i play like I would any other time. I just played an ARAM with a teemo who did have the patch, so his changes like the constant stealth in bush and throwing shrooms (thanks riot) were showning up for me yet i had not even updated yet. I naturally thought he was hacking, but League is usually free from hacks which made me question it. It makes no sense as to why I've played with people who have patched LoL, but my launcher has not. Please help!\n\nsame","replies":[]}]},{"poster":"M1SF1T","date":"2015-08-13T17:54:15.362+0000","up_votes":1,"down_votes":0,"body":"Patching at 30KBps for the first 5 minutes not going anywhere, then suddenly drops to zero... Just got back from having no internet for 2 weeks and was really hoping to unwind with some LoL but I'm disappointed to say the least.\n\nCurrently repairing client. Anything else that might work if this doesn't?","replies":[{"poster":"M1SF1T","date":"2015-08-13T18:20:16.498+0000","up_votes":1,"down_votes":0,"body":"Nvm I ran the client as admin and it worked, I forgot about that, my bad :)","replies":[]}]}]}