{"poster":"dArtagnan","date":"2014-09-11T22:04:07.039+0000","title":"3rd Party Skin Site Fraud Update","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Getting scammed sucks. Unfortunately the internet is full of shady people who take advantage of others. At Riot we strive to protect players from these scammers, and recently we’ve noticed an increase in fraud around 3rd party skin sites and skin reselling. \n\nThese sites promise limited edition skins for League of Legends, when in reality they acquire codes illegitimately and exploit players. They charge excessive prices (we found one skin for over $1,000!) and sometimes take payment and never provide the content. You can’t predict the outcome, and no purchase is ever guaranteed regardless of what the seller says. To make matters worse these services typically use bots. Bots are lame to play with and chew up additional server bandwidth, negatively impacting everyone. \n\nRiot is taking action against these scammers at the source. We are working with multiple payment processors to inform them of the situation and recommend they no longer process fraudulent payments from these sites. Additionally we will be deactivating all previously issued skin codes starting today. If you have a skin code that you acquired legitimately please [send a request](https://support.leagueoflegends.com/anonymous_requests/new) to Player Support and include proof of ownership. We’d be happy to help redeem the content to your account, but please note after 07/23/14 we will no longer be redeeming codes for any reason. \n\nFor more information about codes and how to send Player Support a request, check out our [code cards FAQ](https://support.leagueoflegends.com/entries/46095810).\n\n***EDIT***: Player Support will not be retroactively removing content and skins that have already been redeemed prior to this announcement.","replies":[{"poster":"TenSlashTen","date":"2014-09-11T22:38:42.665+0000","up_votes":1,"down_votes":0,"body":"Yes I actually got scammed out of a pax sivir I bought for my girlfriend on this website called \"lolskinshop.com\"(i think was the name... EDIT: yes it's the name Just making sure I'm not pointing fingers at wrong people)\nI paid full price for the sivir code and she couldn't use it on NA.\nApparently the fuckers gave me a korean code.\nI already have pax sivir so I gave to code to a friend of mine from my ranked 5's on KR who likes sivir.\nThe code didn't go to waste but My money and gift for my girlfriend did.\nThat stuff is REALLY expensive I can't afford to buy another.\nAnd they refused to help out at all when i sent in a ticket on their janky ass support website.\n\nFelt dumb for ever trying to buy anything from a 3rd party bullshit website.","replies":[]}]}