{"poster":"el Loco Shen","date":"2016-08-10T16:48:52.654+0000","title":"Extreme Laggs und FPS Drops nach Patch 6.16","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute, wie der Titel schon sagt, seit Kled nun raus ist habe ich 2 Spiele voller Aggression spielen m&uuml;ssen..\r\nich habe einen Schei&szlig;-Laptop , also der nun wirklich kaum Games zocken kann, auch League schafft der auf den niedriegsten Einstellungen wenigstens mit 60 Fps, aber seit dem der Patch nun raus ist, ruckelt es einfach Extrem!. \r\n\r\nIch spiele es schon jetzt gar nicht mehr weil es mich ankotzt mit 3-15 Fps zu spielen, und eine ms von 100-300.. \r\n\r\nfolgendes schon probiert: \r\nUnn&ouml;tige Prozesse geschlossen via Task Manager.\r\nVia Task Manager der Lolclient.exe h&ouml;chste Priorit&auml;t gegeben.\r\nDie Game.cfg einmal gel&ouml;scht und via neustart wiederherstellen lassen.\r\nCcleaner mal durchlaufen lassen.\r\nMsconfig auch mal durchgeguckt.\r\n\r\nich wei&szlig; ne mehr weiter.. bitte um hilfe :/","replies":[{"poster":"el Loco Shen","date":"2016-08-11T22:56:17.552+0000","up_votes":1,"down_votes":0,"body":"Ja und es bessert sich leider nix. \n@Silibum - Ich habe ja auch geschrieben das ich \"Vorher\" 60 fps hatte, jetzt schwankt es wie der Ping hin und her\nwobei die Fps nun bei 10-30 schwankt und der ping von 70 auf über 200.. wobei ich vorher immer jedes game mit einer über positiven Ping zocken konnte sprich 30-50","replies":[{"poster":"silibum","date":"2016-08-12T11:15:52.370+0000","up_votes":1,"down_votes":0,"body":"Antworte bitte demnächst direkt auf meinen Beitrag - es war gerade reiner Zufall, dass ich diese Antwort gesehen habe. \nLade mir bitte ein [Log-Paket (Hex Tech Repair Tool)](https://support.riotgames.com/hc/de/articles/201752674) hoch.","replies":[{"poster":"el Loco Shen","date":"2016-08-12T12:19:33.640+0000","up_votes":1,"down_votes":0,"body":"Da ich keine Ahnung hatte was genau du davon möchtest, lade ich dir die rar/zip datei mal so hoch\n*http://www.file-upload.net/download-11843305/LoL-Logdateien.zip.html*\n\nfalls du aber das haben wolltest was im Aufgaben-Log steht einmal hier (tut mir leid das ich hier kein spoiler machen kann wo du das auf oder zu klappen kannst ist halt bisschen viel)\n\n*Wird gestartet\nBenutzerprofil wird abgerufen... Fertig\nC:\\Users\\Jenny\n„LoL-Logdateien“-Ordner wird erstellt... Fertig\nPing-Test wird ausgeführt\nPing wird ausgefhrt fr www.google.com [216.58.213.100] mit 32 Bytes Daten:\nAntwort von 216.58.213.100: Bytes=32 Zeit=61ms TTL=48\nAntwort von 216.58.213.100: Bytes=32 Zeit=52ms TTL=48\nAntwort von 216.58.213.100: Bytes=32 Zeit=129ms TTL=48\nAntwort von 216.58.213.100: Bytes=32 Zeit=44ms TTL=48\nPing-Statistik fr 216.58.213.100:\nPakete: Gesendet = 4, Empfangen = 4, Verloren = 0\n(0% Verlust),\nCa. Zeitangaben in Millisek.:\nMinimum = 44ms, Maximum = 129ms, Mittelwert = 71ms\nErgebnisse werden in Datei gespeichert... Fertig\nSystemuhr wird synchronisiert\nZeitsynchronisierungsdienst wird gestartet... Windows-Zeitgeber wird gestartet.\nWindows-Zeitgeber wurde erfolgreich gestartet.\nUhr wird neu synchronisiert... Befehl zum erneuten Synchronisieren wird an den lokalen Computer gesendet.\nDer Befehl wurde erfolgreich ausgefhrt.\nLogs werden gesammelt\nProzessliste wird erstellt... Fertig\nNetzwerkdiagnose wird erstellt... Fertig\nGrafikdiagnose wird erstellt... Fertig\nR3D-Logs werden kopiert... Fertig\nNetzwerk-Logs werden kopiert... Fertig\nRADS-Logs werden kopiert... Fertig\nLauncher-Logs werden kopiert... Fertig\nPatcher-Logs werden kopiert... Fertig\nMaestro-Logs werden kopiert... Fertig\nSpielkonfiguration wird kopiert... Fertig\nPermanente Einstellungskonfiguration wird kopiert... Fertig\nDNS wird automatisch zugewiesen\nNetzwerkadapter werden gesucht... Fertig\nDNS wird gelöscht...\nWindows-IP-Konfiguration\nDer DNS-Aufl”sungscache wurde geleert.\nFirewall wird aktiviert\nWICHTIG: Der Befehl wurde erfolgreich ausgefhrt.\n\"netsh firewall\" ist jedoch veraltet.\nVerwenden Sie stattdessen \"netsh advfirewall firewall\".\nWeitere Informationen zur Verwendung von \"netsh advfirewall firewall\" anstelle\nvon \"netsh firewall\" finden Sie im KB-Artikel 947709\nunter \"http://go.microsoft.com/fwlink/?linkid=121488\".\nOK.\nFirewall-Ausnahmen werden hinzugefügt\nLoL-Launcher wird als Firewall-Ausnahme hinzugefügt...\nWICHTIG: Der Befehl wurde erfolgreich ausgefhrt.\n\"netsh firewall\" ist jedoch veraltet.\nVerwenden Sie stattdessen \"netsh advfirewall firewall\".\nWeitere Informationen zur Verwendung von \"netsh advfirewall firewall\" anstelle\nvon \"netsh firewall\" finden Sie im KB-Artikel 947709\nunter \"http://go.microsoft.com/fwlink/?linkid=121488\".\nOK.\nLoL-Patcher wird als Firewall-Ausnahme hinzugefügt...\nWICHTIG: Der Befehl wurde erfolgreich ausgefhrt.\n\"netsh firewall\" ist jedoch veraltet.\nVerwenden Sie stattdessen \"netsh advfirewall firewall\".\nWeitere Informationen zur Verwendung von \"netsh advfirewall firewall\" anstelle\nvon \"netsh firewall\" finden Sie im KB-Artikel 947709\nunter \"http://go.microsoft.com/fwlink/?linkid=121488\".\nOK.\nAufgaben-Log wird gespeichert\nFertig\n„LoL-Logdateien“-Ordner wird gepackt\n7-Zip (a) [32] 15.14 : Copyright (c) 1999-2015 Igor Pavlov : 2015-12-31\nScanning the drive:\n6 folders, 31 files, 2795976 bytes (2731 KiB)\nCreating archive: C:\\Users\\Jenny\\Desktop\\LoL-Logdateien.zip\nItems to compress: 37\nFiles read from disk: 31\nArchive size: 253813 bytes (248 KiB)\nEverything is Ok\nFertig*","replies":[{"poster":"silibum","date":"2016-08-12T12:39:34.444+0000","up_votes":2,"down_votes":0,"body":"Das ist doch perfekt - alles gut.\n\nDeine Hardware weisst einige \"nicht so tolle\" Konstelationen auf: \n\n* Dein Ping ist zwischendurch etwas erhöht.\n* Du hast eine integrierte Grafikkarte in deinem Laptop (die sind meist etwas schwächer als normale Grafikkarten)\n* Du Spielst per WLAN - wechsel bitte auf eine Kabelgebunden Verbindung um das WLAN als Fehlerquelle auszuschließen\n* Du hast einige Paketverluste in deinen Spielen - manchmal \"stall'd\" der Network-Thread laut log sogar (Hier könnte Drittanbietersoftware schuld sein: Plays.tv, Treibersoftware von Maus/Tastatur, ggf. sogar AntiViru-Software)\n\nUm den Provider ergänzend auszuschließen mache bitte folgendes:\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> * Interval: 1 second\n> * Focus: all\n> * Target Name: 185.40.65.1\n>\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> * Edit -> Copy as Text\n> * Geht nach [Pastebin.com](http://Pastebin.com)\n> * Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> * Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n>\n> Fügt bitte außerdem das [Netlog](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0000) dieses Spiels ein.","replies":[{"poster":"el Loco Shen","date":"2016-08-12T14:04:27.551+0000","up_votes":1,"down_votes":0,"body":"http://www.file-upload.net/download-11843561/Logs.rar.html\n ich habe dir die Netlog & die pp2 datei vom PingPlotter beides in eine Rar gepackt.\nhoffe das hilft dir weiter.\nlg","replies":[{"poster":"silibum","date":"2016-08-12T14:12:35.064+0000","up_votes":1,"down_votes":0,"body":"Es bestägit jedenfalls mein Eindruck - die Verbindung zu den Servern nicht alles, aber leider nicht fehlerfrei bzw. stabil. Hast Du bereits auf LAN umgestellt wie empfohlen?","replies":[{"poster":"el Loco Shen","date":"2016-08-12T16:12:13.173+0000","up_votes":1,"down_votes":0,"body":"Leider kann ich das nicht da ich leider kein Lan Kabel besitze & auch kein Loch in der Wand oder das Gerät dazu mir ein Loch zu bohren um es überhaupt bis ins Zimmer zu kriegen.\n\nIch Spiele eigentlich hauptsächlich seit Jahren mit Wlan\nIch hab auch leider in Zukunft kein Geld aus gründen wie Arbeitssuchend.\n\nnaja schöne scheiße halt, kann man wohl nix warten ausser auf einem Hotfix bzw neuen Patch zu warten","replies":[{"poster":"silibum","date":"2016-08-12T16:25:08.296+0000","up_votes":1,"down_votes":0,"body":"Ein Patch wird Dir leider auch nicht beim Routing deines Providers zu den Riotservern helfen... :/ Neuer Provider / Provider gewechselt in letzter Zeit - das könnte ja auch ein Grund sein.","replies":[{"poster":"el Loco Shen","date":"2016-08-12T16:33:16.374+0000","up_votes":1,"down_votes":0,"body":"ne ne , nix derartiges .. aber vielleicht sind ja die Nachbarn schuld die hier ihre Wohnung kreuz- und quer umbohren und das halbe Haus mit abreißen, und haben ja ganz bewusst gewusst das ich am zocken bin und mir die Leitung kaputt gemacht. (sarkasmus on) ..\n\nich weiß halt auch nicht weiter aber es bringt ja auch nix sich weiter drüber auf zu regen.. ich werde da einfach gucken das ich sobald ich Geld habe mal ein Lan Kabel hole und ein Loch in die Wand kriege.. \nggf auch einen Tower kaufen bei dem ich die Leistung auch sicher weiß, denke doch ein i5 sollte für League reichen mit ner 750Ti","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Dragonith","date":"2016-08-14T22:45:23.927+0000","up_votes":1,"down_votes":0,"body":"Ich habe atm das Problem von FPS-Drops (von gecapten 60 -Original >200- auf 6), mit der GTX 1070, dem aktuellsten Treiber und, meines Wissens, richtiger Verkabelung fällt mir kein Grund für diesen Drop ein. Meist treten sie bis Min 5 auf, teils mehrfach, über das ganze Game verteilt.\n\nIch hoffe mir kann hier geholfen werden. ^^","replies":[{"poster":"el Loco Shen","date":"2016-08-16T14:15:24.261+0000","up_votes":1,"down_votes":0,"body":"Was bei mir geholfen hat und nicht nur bei den Frame Drops sondern auch bei meinen High ping war, das ich im Hauptverzeichnis von League of Legends einfach die Administrator.exe des Clients genommen habe (am besten rechtsklick drauf und den hacken rein damit die exe Permanent im Administrator modus startet).\n\nseitdem habe ich zwar wärend des ladebildschirms einen kleinen aussetzer das sich das Fenster kurz minimiert, was sich aber wieder maximieren lässt (so als ob es dich kurz ärgern will und das fenster klein macht)..\ngenauso wie bei dem Ping, im ladebildschirm ist er erst hoch, danach bleibt er konstant unten seit Minute 0.00 am anfang der Runde.\n\nIch hoffe das hilft dir weiter, auch wenn es eigentlich auf Dauer keine lösung sein *Sollte* , vorallem nicht bei deiner Monster Grafikkarte.","replies":[{"poster":"Dragonith","date":"2016-08-21T23:54:23.095+0000","up_votes":1,"down_votes":0,"body":"Der Patch des Drivers zum Anniversary-Update scheint es gefixt zu haben, bisher kam es in 5/5 Spielen zu keinerlei FPS-Drops o.ä.\nIch denke, dass der Driver noch nicht ausgereift war oder schlicht nicht mit dem aktuellsten Windows zu 100% kompatibel. {{summoner:2}}","replies":[]},{"poster":"Dragonith","date":"2016-08-18T15:47:26.855+0000","up_votes":1,"down_votes":0,"body":"Ich sehe keine gravierende Besserung, aber ist ein Ansatz.\nLassen wir uns überraschen woran es liegt, aber wäre schon schön League ohne FPS-Drops spielen zu können. Sollte nicht allzu viel verlangt sein. ^^","replies":[]}]}]},{"poster":"hollywoodskills","date":"2016-08-19T10:15:18.315+0000","up_votes":1,"down_votes":0,"body":"Guten Tag,\nmeinerseits liegt ein ähnliches Problem vor, wenn nicht sogar das gleiche.\nSeit einigen Tagen, ca. 4 Tagen, gelingt es mir nicht mehr mein Lieblingsspiel zu spielen, da meine ms deutlich gestiegen sind und nicht mehr meinen alten konstanten Wert von 29ms bis zu max. 34ms. Mein jetziger unkonstanter Ping schwankt zwischen 30 ms und 500ms, bis zum diconnect und Standbildern. Habe bereits einen Leaver-Buster bekommen,weil ich getestet habe und versucht habe das Problem zu lösen, na gute Geister habe ich auch gehofft, nichts half:), aber das ist nur nebensächlich und nicht mein Hauptproblem. Mittlerweile habe ich alles mögliche ausprobiert, gefühlt ganz Google durchsucht und sämtliche Tipps zur Pingsenkung getestet. Nichts hilft.  Meine Fragen sind nun: Warum schwankt mein Ping plötzlich und vorher nicht?, wer verursacht dies?, wie kann ich ich dieses Problem wieder beheben, damit ich erfolgreich und frustrationsfrei wieder spielen kann?, liegt es an Provider oder an den Servern? \nSchätzungsweise wird auch meine letzte Hoffnung auf den nächsten Patch zu warten und dann wieder normal zu spielen, auch sterben:/{{champion:61}} \nIch danke für jegliche Bemühungen.\nMfG","replies":[{"poster":"Dragonith","date":"2016-08-21T16:39:13.351+0000","up_votes":1,"down_votes":0,"body":"Eventuell kann deine Inkonstanz des Pings an W-Lan-Verbindung (?) oder an dem Accesspoint, sprich dem Zugriffspunkt aufs Internet, liegen.\nWenn es seit vier Tagen auftritt wäre es wahrescheinlicher, dass dein Provider Schuld daran trägt, aber Riot ist nunmal ein Fan ominöser Bugs, deshalb 60/40 für den Provider. :D\nIch schätze mal, die Variante per Lan-Kabel zu spielen wird dir bekannt sein, eventuell kannst du nachvollziehen welchen Accesspoint dein Provider nutzt und ob du nicht einen alternativen Zugangspunkt nutzen kannst.","replies":[]}]},{"poster":"laitrez","date":"2016-08-11T16:55:53.241+0000","up_votes":1,"down_votes":0,"body":"Selbes Problem hier seit den Patches ..","replies":[]},{"poster":"silibum","date":"2016-08-11T07:16:44.257+0000","up_votes":1,"down_votes":0,"body":"[Hier](https://support.riotgames.com/hc/de/articles/201752684) findest einen Artikel mit mehr Möglichkeiten zum Thema \"niedrige FPS\" - Wenn Dir bekannt ist, dass deine Hardware unausreichend ist, wirst Du mit einschränken auch weiter hin leben müssen - wobei 60 FPS natuerlich reichlich ausreichend sind.\n\nSolltest Du Windows 10 nutzen [deaktiviere bitte auch GameDVR](http://support.xbox.com/de-DE/xbox-on-windows/social/record-game-clips-game-dvr-windows-10#160cb39808a54d38acdc54c564943140).","replies":[]}]}