{"poster":"I Main Everyone","date":"2016-07-10T13:01:31.078+0000","title":"Riot you don't even have to pay me, I'll fix Teleport for you","subforum":"Gameplay","up_votes":181,"down_votes":15,"body":"Change teleporting to towers as it was, there&#039;s no reason to get rid of the tower saving and dive punishing potential that it provided for top and mid laners, but keep the long-as-heck teleport time for wards and minions, which is reigning in the power of teleport ganks as intended. Honestly I can&#039;t count the amount to cancelled teleports I&#039;ve had solely because Yi or Jax got and extra 4 Basic attacks off before I can&#039;t respond like I used to. It&#039;s not like having a shorter TP channel to towers is more threatening, they still have plenty of time to retreat to come up with a plan, even taking advantage of the fact that I no longer have teleport. Anyway, this is just for consideration.\r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ValyrianBlade","date":"2016-07-10T13:07:57.520+0000","up_votes":50,"down_votes":4,"body":"I agree with towers. Heck, if anything they could be shorter.\n\nI actually think minions are okay too. If you overextend past minions in a lane, you're taking a risk. Teleport as a punishment to that risk is fine in my opinion.\n\nWards and traps? I agree that teleporting to those was OP. I play a lot of ADC and it was horrible that whenever you get an edge bot lane and are pressuring them with good deep vision to be safe from ganks, all it took was a ward in the brush behind you that you didn't know was there to set up an easy TP double kill.\n\nI like the gameplay of recalling, roaming to the lane you want to help, ganking it normally, then teleporting back to your lane (on turret) to protect it. The cooldown refund on turret or a faster turret channel time would support this, and I think it's healthy gameplay (i.e. you can ward to protect as you would against normal ganks, and if you damage the top laner he's going in to lane at a disadvantage unless he recalls again thereby wasting more time before his TP).","replies":[{"poster":"Hyrum Graff","date":"2016-07-11T01:07:39.885+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ValyrianBlade,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=0000,timestamp=2016-07-10T13:07:57.520+0000)\n>\n> I agree with towers. Heck, if anything they could be shorter.\n> \n> I actually think minions are okay too. If you overextend past minions in a lane, you&#x27;re taking a risk. Teleport as a punishment to that risk is fine in my opinion.\n> \n> Wards and traps? I agree that teleporting to those was OP. I play a lot of ADC and it was horrible that whenever you get an edge bot lane and are pressuring them with good deep vision to be safe from ganks, all it took was a ward in the brush behind you that you didn&#x27;t know was there to set up an easy TP double kill.\n> \n> I like the gameplay of recalling, roaming to the lane you want to help, ganking it normally, then teleporting back to your lane (on turret) to protect it. The cooldown refund on turret or a faster turret channel time would support this, and I think it&#x27;s healthy gameplay (i.e. you can ward to protect as you would against normal ganks, and if you damage the top laner he&#x27;s going in to lane at a disadvantage unless he recalls again thereby wasting more time before his TP).\n\nShorter TP to minions punishes lane aggression. I don't like that affect. Shorter TP to towers only, though, I can get behind.","replies":[{"poster":"ValyrianBlade","date":"2016-07-11T01:45:11.390+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hyrum Graff,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=00000000,timestamp=2016-07-11T01:07:39.885+0000)\n>\n> Shorter TP to minions punishes lane aggression. I don&#x27;t like that affect. Shorter TP to towers only, though, I can get behind.\n\nI mean, we obviously can amiably agree to disagree.\n\nMy point being that I think standard aggression is fine - I've caught you out in the jungle or farther than you should be in a lane and will engage on you; TP shouldn't prevent this, I shouldn't be worried that my 3v2 will turn in to a 3v4 where the two solo laners will flank us in 4 seconds off of a ward we didn't know was there.\n\nMinions are completely different from wards though - they're a lot more similar to turrets. The enemy will always know if there are minions behind them. It's a conscious risk to run past minions. That's no different than taking the conscious risk of tower diving someone. Tower dives are aggression as well, and yet a shorter TP to a turret would punish that kind of aggression. Why is it any different than disregarding minions and going straight for a kill when there isn't a tower present? \n\nFor me, the line is whether the risk can be eliminated or at least known of before it's being taken. Wards are unnatural (as in they don't spawn on the map, we place them). Without a red trinket or a pink ward handy, there's nothing you can do to detect if there's a ward behind you. You can always kill minions before attacking though. You can back off of a turret that someone went to TP to.","replies":[{"poster":"Hyrum Graff","date":"2016-07-11T06:06:07.663+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ValyrianBlade,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=000000000000,timestamp=2016-07-11T01:45:11.390+0000)\n>\n> I mean, we obviously can amiably agree to disagree.\n\nIndeed.\n\nIf you (generally, not you specifically) want to have an argument, you can't prove the other person wrong without first agreeing on some principals to start from. Once you have that common ground you can build up your argument.\n\nThis disagreement isn't exactly an argument/debate, because there's no common ground for us to start from, because we have different values about what constitutes risk that should be punishable by a teleport and what doesn't. A lot of times I feel like people say \"agree to disagree\" because they can't win an argument, this is a place where I think it's actually very appropriate.\n\nAnyway, I love the explanation of values that you included; Rather than try to argue against them, I'm just going to try to explain mine.\n\nThat said, if you think you can find common ground somewhere so we have something to argue about, I'm sure that would make an interesting argument/debate.\n\n> My point being that I think standard aggression is fine - I&#x27;ve caught you out in the jungle or farther than you should be in a lane and will engage on you; TP shouldn&#x27;t prevent this, I shouldn&#x27;t be worried that my 3v2 will turn in to a 3v4 where the two solo laners will flank us in 4 seconds off of a ward we didn&#x27;t know was there.\n\nSay you're in a 2v2. Thresh gets a good hook on the enemy adc and you follow his lantern in, behind enemy minions. Then the enemies channel their teleport on the minions and.. well shit.\n\nMaybe that's excessive aggression. I think it's more interesting when you and thresh can be comfortable making plays like that. ...Particularly in the LCS, but I don't really want to focus on that because it's not the crux of my argument.\n\n> Minions are completely different from wards though - they&#x27;re a lot more similar to turrets. The enemy will always know if there are minions behind them. It&#x27;s a conscious risk to run past minions. That&#x27;s no different than taking the conscious risk of tower diving someone. Tower dives are aggression as well, and yet a shorter TP to a turret would punish that kind of aggression. Why is it any different than disregarding minions and going straight for a kill when there isn&#x27;t a tower present? \n\nIt's a question of degree of risk. I think that we agree that a tower dive is *supposed* to be a very risky play. In my opinion, diving behind enemy minions isn't or shouldn't be as risky. ie, it's not/shouldn't be a teleport-collapse level of risk.\n\n> For me, the line is whether the risk can be eliminated or at least known of before it&#x27;s being taken. Wards are unnatural (as in they don&#x27;t spawn on the map, we place them). Without a red trinket or a pink ward handy, there&#x27;s nothing you can do to detect if there&#x27;s a ward behind you. You can always kill minions before attacking though. You can back off of a turret that someone went to TP to.\n\nMinions are somewhere in between wards and towers. They're like towers in the ways you point out. They're like wards in that their position is variable and they can push on to the opponent's side of the map.\n\nIn the end, it boils down to \"What kinds of plays do I want to be riskier and which do I want to be safer?\" I'd like to encourage riskier plays, and discourage things like splitpushing alone because you know your solo laners can quickly teleport to the minions near you in the event of a collapse.\n\n--\n\n**Generally, I'd like the primary use of teleport to be strategic, not tactical.** Pushing a wave top, then teleporting bot to join your team *before* the fight starts. Coming bot for drag and then teleporting back to save top tower, instead of staying top and saving your tele just in case the enemy contests.","replies":[]}]}]}]},{"poster":"The Yetii Rider","date":"2016-07-10T17:20:18.157+0000","up_votes":10,"down_votes":3,"body":"The channel needs to be constant so that the time to interrupt the channel is constant. If you see an enemy channel TP, you don't see where they're going. You need a consistent idea of when a channel starts to when it finishes in order to make decisions like \"Should I dive this player to interrupt his TP?\"\n\nCould be interesting to see some kind of Homeguard TP, where if you channel while in the fountain the channel time is reduced.","replies":[{"poster":"Hyrum Graff","date":"2016-07-11T01:08:07.539+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=000a,timestamp=2016-07-10T17:20:18.157+0000)\n>\n> The channel needs to be constant so that the time to interrupt the channel is constant. If you see an enemy channel TP, you don&#x27;t see where they&#x27;re going. You need a consistent idea of when a channel starts to when it finishes in order to make decisions like &quot;Should I dive this player to interrupt his TP?&quot;\n> \n> Could be interesting to see some kind of Homeguard TP, where if you channel while in the fountain the channel time is reduced.\n\nOr TP could have some kind of a particle  or sound affect (like zhonya's) that tells you when it's going to end.","replies":[]},{"poster":"SpecterVonBaren","date":"2016-07-11T15:07:19.811+0000","up_votes":1,"down_votes":0,"body":"Make it have different colors depending on what they're TPing to. (With distinctly different colors for even the color blind)","replies":[]}]},{"poster":"Dengeden","date":"2016-07-10T16:09:46.261+0000","up_votes":5,"down_votes":22,"body":"No. Teleporting to towers is a get-out-of-jail-free card when you lose lane. So no.","replies":[{"poster":"Verdade","date":"2016-07-10T18:04:07.533+0000","up_votes":5,"down_votes":4,"body":"Yeah, everyone should play lane bullies, totally","replies":[{"poster":"Partholonian","date":"2016-07-10T18:47:02.941+0000","up_votes":7,"down_votes":0,"body":"I don't think that everyone should, but if you do it successfully, there should be some possibility of getting something meaningful out of it.  On the other hand if your opponent picks a lane bully and you successfully stay safe, you should be rewarded for that by having their champion not scale as well at the 2+ item stage if they haven't snowballed.\n\nIMO the nerf is warranted, except in very low elo where it's already a bad idea to take TP because most of the time your team won't have any wards to TP to, even when you say in chat \"I have TP ready, please put down a ward\".","replies":[]}]}]},{"poster":"Blakiepug","date":"2016-07-10T15:16:40.702+0000","up_votes":7,"down_votes":2,"body":"You have a very good point. The tower cooldown nerf to teleport kind of came out of nowhere from Riot to begin with and it ended up smacking them right back. Now that the cooldown is the same no matter what you teleport to, there is no reason not to go deep when ganking a lane. The shorter cooldown for going to towers encouraged smarter plays, not just the HERP DERP this ward is right next to adc *click*.","replies":[{"poster":"Bladerunner7777","date":"2016-07-11T03:28:38.259+0000","up_votes":2,"down_votes":1,"body":"It didn't \"come out of nowhere\"\n\nDouble TP was dominating Solo Q (rip) AND LCS and it was the most boring thing in the world to play and watch.\n\nThere was a thread on the front page of the League subreddit LITERALLY talking about how passive LCS is and why it's not as fun to watch anymore. Double TP will do the impossible and make LCS even MORE boring to watch.","replies":[]}]},{"poster":"Brucinator","date":"2016-07-11T05:31:36.474+0000","up_votes":3,"down_votes":0,"body":"I think someone mentioned this earlier, but why not make it so TP scales into the game with levels? I'd be making it scale exponentially too, so if you TP level 1, it's on like a 7 minute CD and has a 6+ sec channel time, but level 18 it'd be a 2 1/2 - 3 (ish) minute CD with a 2.5/3 second channel time.\n\nLike, basically make it useless for laners in the first 10-15 minutes of the game, but really good once it scales up. It will encourage people to take it for co-ordinated mid-late game team play, and won't simply be used as a get-out-of-jail-free card when you get first blooded.\nResponding to late game team fights will actually be do-able (let's be honest, a lategame teamfight can be completely done in 4 seconds).\nIdk, just the thoughts of a Wood 7 scrub that loves toplane.","replies":[]},{"poster":"Dominick Destine","date":"2016-07-11T01:43:26.870+0000","up_votes":4,"down_votes":1,"body":"Teleport is fine.\n\nIt was overpowered.","replies":[]},{"poster":"Jbels","date":"2016-07-10T15:13:01.358+0000","up_votes":4,"down_votes":5,"body":"Teleport has literally become nothing but a safety net for lane in the early game (You die? It's ok TP back and lose practically nothing with the new early game exp changes) and in the late game is only used as a means of teleporting to enemy objectives with huge waves about to crash into them. I bet you anything the pros will stop using it altogether at a certain point, or they'll start playing early game champions in top lane with ignite to snowball hard and ultra safe botlanes. \n\nThese changes to teleport will encourage nothing but passive play everywhere except top lane","replies":[{"poster":"Partholonian","date":"2016-07-10T18:42:41.763+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=NMF Jbels,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=0003,timestamp=2016-07-10T15:13:01.358+0000)\n\n> You die? It's ok TP back and lose practically nothing with the new early game exp changes\n\nAssuming your TP cooldown counts as \"practically nothing\".  And that you don't die *again* before it's up.  And that the wave position is favorable for you to not lose much.\n\nEarly deaths really *shouldn't* be that punishing though, that's why the death timer is short.  But you can't get the full benefit of the short death timer if it also takes you 15 extra seconds to get back to lane with your early game no boots and no homeguards movespeed.\n\n> These changes to teleport will encourage nothing but passive play everywhere except top lane\n\nThe main driver of passive play in the botlane is the fear of double tp clown fiestas if you cross the river (even though, in most people's elos, their opponent solo laners probably aren't aware of what's going on without voice comms, and there may not even be a ward to TP to).  The nerf is intended to *reduce* the fear of teleport ganks.","replies":[]},{"poster":"morris1","date":"2016-07-10T16:17:41.717+0000","up_votes":2,"down_votes":2,"body":"Calling it right now; {{champion:80}} will become meta.","replies":[{"poster":"Stalinium","date":"2016-07-10T21:50:48.914+0000","up_votes":1,"down_votes":0,"body":"Why not Shen?","replies":[{"poster":"Melledoneus","date":"2016-07-12T10:46:24.765+0000","up_votes":1,"down_votes":0,"body":"Because nobody gets noticed by Shen-pai.","replies":[]},{"poster":"Windzard","date":"2016-07-11T18:29:58.838+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stalinium,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=000300000001,timestamp=2016-07-10T21:50:48.914+0000)\n>\n> Why not Shen?\n\n\n\n\n\nRek´sai better.:) {{champion:421}} {{summoner:12}}","replies":[]}]},{"poster":"Pls dont do this","date":"2016-07-11T01:02:42.526+0000","up_votes":1,"down_votes":0,"body":"I actually mained pantheon for quite a bit of time. This is good to hear :P","replies":[]}]}]},{"poster":"Slamurai Jack","date":"2016-07-10T23:53:34.154+0000","up_votes":6,"down_votes":3,"body":"I'm glad TP is garbage; it's been used as crutch for bad play for far too long now. Let top laners lose a ton of exp if they die at lvl 3. Let bot lanes die if they get caught and all inned at a bad time. Let teams lose towers if the fail to account for pressure in side lanes. I'm tired of TP constantly bailing people out of their bad play; let the shitters get shit on for once.","replies":[{"poster":"Pls dont do this","date":"2016-07-11T00:52:23.792+0000","up_votes":1,"down_votes":1,"body":"I agree. Teleport lets people ignore their mistakes way to easily. For example, if I kill a top laner because he underestimated my lvl 2 combo, he can just tap back right away, with maybe one or two cs lost. Shitty plays should be punished.","replies":[{"poster":"Slamurai Jack","date":"2016-07-11T01:16:29.766+0000","up_votes":1,"down_votes":1,"body":"I actually want them to give TP a 5 seconds lockout after respawning as well so that doesn't happen as much. Tp's to minions and wards at least; let them TP to tower if they want to. I just want enough time to push the wave in before Im forced to back.","replies":[{"poster":"Pls dont do this","date":"2016-07-11T13:23:22.315+0000","up_votes":1,"down_votes":0,"body":"I agree","replies":[]}]}]}]},{"poster":"YuGiHo","date":"2016-07-11T05:15:57.149+0000","up_votes":2,"down_votes":0,"body":"im pretty sure its currently balanced for competitive more than the general population to use, like kalista.","replies":[]},{"poster":"Keepe","date":"2016-07-10T16:23:42.099+0000","up_votes":2,"down_votes":0,"body":"Ah, my friend, you forget one vital point.\n\nRiot Games gives no yiffs about what the community thinks.","replies":[{"poster":"ralsei","date":"2016-07-11T01:19:15.580+0000","up_votes":1,"down_votes":0,"body":"What's yiff?","replies":[{"poster":"Partholonian","date":"2016-07-11T01:41:55.891+0000","up_votes":2,"down_votes":0,"body":"Google it if you dare.  But not somewhere where other people can see your screen.  Seriously.","replies":[]},{"poster":"Keepe","date":"2016-07-12T21:58:04.753+0000","up_votes":1,"down_votes":0,"body":"https://cdn.meme.am/instances/50898271.jpg","replies":[]}]}]},{"poster":"RAP Yogurt","date":"2016-07-10T16:45:54.416+0000","up_votes":4,"down_votes":2,"body":"You know, I was expecting a generic riot hate \"you fucked up and never go back on your decisions omg rito so stubborn teleport is dead.\" This is one of those few gems on the boards that is actually thought out. Good work man.","replies":[{"poster":"AramsAreBest","date":"2016-07-10T18:44:44.943+0000","up_votes":2,"down_votes":5,"body":"Stfu","replies":[{"poster":"Pierce The Veal","date":"2016-07-11T00:06:46.452+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AramsAreBest,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=00090000,timestamp=2016-07-10T18:44:44.943+0000)\n>\n> Stfu\n\nNo u","replies":[{"poster":"AramsAreBest","date":"2016-07-11T09:52:59.534+0000","up_votes":1,"down_votes":1,"body":"No u","replies":[{"poster":"Pierce The Veal","date":"2016-07-11T12:39:48.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AramsAreBest,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=0009000000000000,timestamp=2016-07-11T09:52:59.534+0000)\n>\n> No u\n\nIk u r but wat m I?","replies":[]}]}]}]},{"poster":"Busty Demoness","date":"2016-07-11T06:37:08.833+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BurningInpachi,realm=NA,application-id=3ErqAdtq,discussion-id=uTLE3X88,comment-id=0009,timestamp=2016-07-10T16:45:54.416+0000)\n>\n> You know, I was expecting a generic riot hate &quot;you fucked up and never go back on your decisions omg rito so stubborn teleport is dead.&quot; This is one of those few gems on the boards that is actually thought out. Good work man.\n\nI've made posts more thought out than this OP.\n\nI happen to agree with the constant 4 second channel regardless of target. It offers an actual window of counterplay that you otherwise wouldn't have. Plus, it was still a buff when it was used on minions because that's an extra second those minions are invulnerable, which a tower won't switch off of until a champion draws aggro and leaves the rest of the minions/your allies to finish off the turret.","replies":[]}]},{"poster":"foinhas","date":"2016-07-10T18:45:51.168+0000","up_votes":2,"down_votes":1,"body":"will they fix the stupid interaction between tp and zac's/anivia's passive?","replies":[{"poster":"President Swa1n","date":"2016-07-10T21:34:22.605+0000","up_votes":1,"down_votes":0,"body":"Wasn't it intentional?","replies":[{"poster":"My Waifu Vanilla","date":"2016-07-10T22:22:47.803+0000","up_votes":2,"down_votes":0,"body":"Idk about that, but the increased time to the channel on TP now makes Zac 100% impossible to kill since a 4.5 second channel is now longer than the 4 second respawn late game for Zac. It isn't \"OP\" as much as it is annoying. Yes, it is something everyone tends to play around and takes a long af cd to save him, but it is very annoying.","replies":[{"poster":"President Swa1n","date":"2016-07-11T16:58:04.108+0000","up_votes":1,"down_votes":0,"body":"Haha, I didn't realize that. I guess it would be pretty annoying, yeah.","replies":[]}]}]}]},{"poster":"Niaphim","date":"2016-07-10T13:09:36.866+0000","up_votes":3,"down_votes":1,"body":"Not bad actually. As a tool to return to lane faster it could be buffed this way. Upvoted.","replies":[]},{"poster":"Off Meta Evan","date":"2016-07-10T20:31:05.565+0000","up_votes":4,"down_votes":2,"body":"I want them to nerf tp more honestly. i want {{summoner:14}} to be the summoner i see top most of the time now. focusing on utility and defensive playstyle makes this game more boring imo. i want my top laner blood baths where a lane isn't over until someones feeding harder than the red cross.","replies":[]},{"poster":"HateDaddy","date":"2016-07-11T02:50:43.165+0000","up_votes":2,"down_votes":1,"body":"It's fine now, if you're teleporting to save a tower only a few AAs away from being destroyed, you're wasting teleport.","replies":[]},{"poster":"48983507DEL1","date":"2016-07-10T14:56:08.064+0000","up_votes":2,"down_votes":1,"body":"Totally agree. +1","replies":[]},{"poster":"Mario","date":"2016-07-12T05:38:03.371+0000","up_votes":1,"down_votes":0,"body":"It's a me! Mario! I support this!","replies":[]},{"poster":"Eric Senpai","date":"2016-07-11T23:15:04.582+0000","up_votes":1,"down_votes":0,"body":"Jesus people, they already buffed turret damage, now y'all want tp to be used defensively hard core.","replies":[]},{"poster":"arc95","date":"2016-07-11T20:09:45.910+0000","up_votes":1,"down_votes":0,"body":"keep the tp channel length for everywhere but revert tp back to where you get get a reduced cd for tp'ing to turrets\n\nthat way it is strong as a return to lane tool but still nerfed in terms of joining/saving a fight(which was the reason it was op)\n\nthey nerfed the balanced part of tp first(the reduced cooldown on turret tp's) which didn't work so they nerfed the channel time to hit the save the bot lane function which worked but both combined to too much of a nerf\n\nthen for the tp to another lane aspect the channel time will hurt getting flanks on deep wards to set up kills... but would be buffed when tping to turret if the enemy towerdives(since you will get a reduced cooldown)\n\nbut what you said also works ^w^","replies":[]},{"poster":" Elisheva","date":"2016-07-11T19:57:46.312+0000","up_votes":1,"down_votes":0,"body":"Prioritization. Do you want items at a bad time, in exchange for a tower.","replies":[]},{"poster":"Best Foxx NA","date":"2016-07-11T17:14:31.946+0000","up_votes":1,"down_votes":0,"body":"Honestly the TP change was to prevent TP Ganks without any warning. I think in general if they wanna shorten the cooldown and keep the visibility changes, they'd have a balanced TP. The whole no vision while they're TP'ing in and \"HolyshitwheredidIrelia....and I'm dead\" was stupid and all. On the flipside, if you place deep wards and your enemy support is not clearing them and forgets about them, then you kinda deserve to get dove upon from that ward you didn't clear. It's just a thought. Clear the wards if you can, it will save you from TP ganks from behind.\n\nCause everyone knows getting a Wuju blade or a set of Irelia's knives or even a giant monkey's staff in your ass is no fun.\n\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Endarius","date":"2016-07-11T15:22:40.327+0000","up_votes":1,"down_votes":0,"body":"I agree. Tele Ganks are nasty, but being able to defend towers in the early game is not a negative play pattern. This also would create more meaningful choice as to when to use the spell.","replies":[]}]}