{"poster":"CarryInWeed","date":"2019-10-18T03:59:54.504+0000","title":"Akali esta en la basura :(","subforum":"Jugabilidad, balance y narrativa","up_votes":3,"down_votes":2,"body":"yo nunca jugué con el nuevo rework de Akali hasta unos días, es un champ bastante fuerte, pero se pasaron con el nerfeo, yo creo que lo único que deberían darle es bajarle el costo a la q, y su escala, y a la w que de menos energía pero te saque de visión y cancele básico de torres","replies":[{"poster":"La Fea UwU","date":"2019-10-18T04:08:30.597+0000","up_votes":2,"down_votes":0,"body":"Es un campeón que ya no se puede balancear. Sigue fuerte, y en buenas manos te da vuelta las partidas. Es uno de los campeones más pickeados en competitivo a pesar de los nerfeos xD","replies":[]},{"poster":"NNiohhOverride","date":"2019-10-19T00:02:39.334+0000","up_votes":1,"down_votes":0,"body":"Akali no está balanceada eso si es verdad, pero no es una mierda.\nYo la uso y gano fácil en elos inferiores a diamante III xD, el problema no es akali, son los campeones desbalanceados que existen en la actualidad.\nPareciera que como ven que el juego está que muere, buffean a los campeones más fáciles para que cualquier forro pueda subir de división abusando de campeones como garen, renekton, lee sin, elise, karthus,malzahar, etc.","replies":[{"poster":"VenganceZ","date":"2019-10-19T00:09:38.407+0000","up_votes":1,"down_votes":0,"body":"Igual te digo, hay gente que sabe lo roto que están, creen que van a ganar por jugar un champ roto y terminan fedeando de lo lindo, me ha pasado, es feo tanto si te pasa a vos cómo si le pasa al rival, da mucho asco","replies":[{"poster":"NNiohhOverride","date":"2019-10-19T00:16:42.574+0000","up_votes":1,"down_votes":0,"body":"Yo veo jugadores que fedean usando a garen con ignición 1v1..eso si es patético","replies":[]}]}]},{"poster":"CoronavirusC0V","date":"2019-10-18T04:02:59.073+0000","up_votes":1,"down_votes":0,"body":"si quieren balancearla si o si el cambio radicara en la R, como jugador de akali te digo que esa libertad de poder usarla hacia cualquiera direccion es lo que la hace tan fuerte, sino veras que akali sin la R mucho no hace","replies":[{"poster":"VenganceZ","date":"2019-10-19T00:14:22.911+0000","up_votes":1,"down_votes":0,"body":"Has jugado Akali vs ilaoi? Tira todas las r que vos quieras, esa mierda te las tanquea, se ríe en tu cara, y te hace 100/0 a nivel 6 si la ilaoi es buena ojo, (las típicas ilaoi maestría 5 basta)","replies":[]}]},{"poster":"EstoyDoramion","date":"2019-10-18T04:03:31.913+0000","up_votes":1,"down_votes":2,"body":"Y que me bufeen al yasuo de paso, que sufre muchos contra tanques. y que nerfeen a garen, y que devulevan al antiguo aatrox y que tire RAYOS LASER POR LOS OJOS VIEJA GG IZI REPORT JUNGLA","replies":[{"poster":"VenganceZ","date":"2019-10-19T00:12:49.033+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"AzorAha","date":"2019-10-18T06:03:39.436+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"VenganceZ","date":"2019-10-19T00:10:08.736+0000","up_votes":1,"down_votes":0,"body":"Corta xD","replies":[]}]},{"poster":"SpectreChazer","date":"2019-10-18T16:48:34.458+0000","up_votes":1,"down_votes":0,"body":"Sigue estando fuerte {{sticker:sg-lulu}}","replies":[]},{"poster":"Tenori Taiga","date":"2019-10-18T10:16:02.728+0000","up_votes":1,"down_votes":0,"body":"Yo no la veo tan mal. Sino la usaste nunca desde el rework capas te lleva un poco acostumbrarte. Personalmente la veo bastante bien, ya no la siento tan rota como antes pero como le agarres el truquito podes carrear fuerte","replies":[]}]}