{"poster":"PimpMasterTeemo","date":"2016-07-26T21:07:59.623+0000","title":"Yea wtf was that update?","subforum":"Gameplay","up_votes":2,"down_votes":5,"body":"Are you serious why would you ever buff vayne if she wasnt already op enough? her true damage plus her basic build gives her god mode already if her team has a lot of cc to peel her, shes impossible to kill cause of her kite. Ulti+Q= invisiblility, E knockback + all your teams cc she&#039;s nearly impossible to kill, not to mention if she buys QSS GG MAAAAAN. NOW HER Q CAN HIT TURRENTS IM DOOOOONE. Riot please reconsider this little buff to vayne although its little change it has a huge impact. Also buff wukong not that I main him or anything but you should buff that foo to do true damage every 3 hits.","replies":[{"poster":"Hyperiön","date":"2016-07-26T21:09:51.055+0000","up_votes":2,"down_votes":0,"body":"You do realize that it wasn't a buff at all. So what she can Q turrets, not a big deal. They nerfed her half crits. Which were so good on vayne, now its 1 or the other. So it hurts her full dmg build, and needs to get crit now.","replies":[{"poster":"godlikeinfernal","date":"2016-07-26T21:12:35.084+0000","up_votes":1,"down_votes":0,"body":"Wtf you talking about its 1 or the other, they said if her Q crits then the aa would crit with it, or if the aa crit then the Q would crit with it.","replies":[{"poster":"Hyperiön","date":"2016-07-26T21:17:35.676+0000","up_votes":1,"down_votes":0,"body":"Read what it says here: Tumble's bonus damage and Vayne's basic attack no longer crit independently of one another. If one crits, so does the other. \n\nNow how it used to be half crits, one could crit and one could not. So by them making it dependent now, She loses the half crits in the middle.","replies":[{"poster":"Votable Jester","date":"2016-07-26T21:28:38.551+0000","up_votes":1,"down_votes":0,"body":"It should average out to the same damage, but be less consistent.  If she does land a crit though, it'll be far more noticeable.","replies":[]}]}]}]}]}