{"poster":"Syonya","date":"2017-01-12T21:03:08.550+0000","title":"Jungler in Season 7  WAS IST DAS?!","subforum":"Spielerverhalten & Moderation","up_votes":0,"down_votes":12,"body":"Helloow! \r\n\r\n Ok also ich habe keine ahnung wie ich anfangen soll aber  ich verstehe die Jungler diese Season &uuml;berhaupt nicht...\r\nIch mache im moment meine 10 rankeds in solo/duo und habe 6 games verloren, davon waren 4 komplette freewins [ 4 more to lose.. ]. (Da ich support spiele kann ich halt nicht viel machen) \r\nAufjedenfall   ganked der Jungler kaum / nie ,nichtmal als  die Botlane am verlieren war , sehr oft wird getrollt oder sonstiges und die botlane ist schuld ( obwohl sie die lane gewonnen hat und roamen geht). Man muss  beleidigungen aushalten obwohl man nichts gemacht hat und positiv steht, dabei noch fast jedem versucht den Arsch zu retten und der dank ist  ein 4v5 teamfight  oder troller .Ich will nicht sagen, dass jeder Jungler so ist btw. also sorry I: \r\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\nIch verstehe es einfach nicht was mit den Junglern in dieser Season los ist . Wie will man  h&ouml;her kommen wenn man am ende an allem Schuld ist..?\r\n\r\nHat noch jemand solche leute /Jungler in seinem Team? Hoffe bin da nicht alleine  {{sticker:zombie-nunu-bummed}}   ich sage nur GEGE RITO ! {{sticker:zombie-brand-clap}} \r\n\r\n- Syonya","replies":[{"poster":"Wernicke","date":"2017-01-13T09:26:26.871+0000","up_votes":3,"down_votes":0,"body":"> Da ich support spiele kann ich halt nicht viel machen\n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Uranbrennstab","date":"2017-01-13T11:03:15.126+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Wernicke,realm=EUW,application-id=KYnfKGf0,discussion-id=so2ncfTI,comment-id=0006,timestamp=2017-01-13T09:26:26.871+0000)\n>\n> {{sticker:zombie-brand-facepalm}}\n\nSupport macht halt keinen Schaden :-D","replies":[{"poster":"Valar Morghulïs","date":"2017-01-13T14:43:22.288+0000","up_votes":1,"down_votes":0,"body":"Niiiiieeeeemals :D {{champion:17}}","replies":[]}]}]},{"poster":"0815xand0r","date":"2017-01-12T21:54:09.967+0000","up_votes":2,"down_votes":0,"body":"6 Spiele sind keine Grundlage für eine vernünftige Aussage. Die Stichprobe ist deutlich zu gering.","replies":[]},{"poster":"XenesisCH","date":"2017-01-13T08:56:08.259+0000","up_votes":1,"down_votes":0,"body":"So wie es aussieht spielst du meistens mit einem Premade auf der Botlane. Ich würde dir zuerst mal raten eure Synergien als Duo zu verbessern. Das kann z. B. auch die Wahl deines Supports betreffen. Wenn dein ADC z. B. Varus pickt, könntest du z. B. auch einen Poke Support aussuchen z. B. Karma um so eure Gegner von der Distanz aus klein zu kriegen und von der Lane zu drängen. \n\nWenn du jetzt aber doch Soraka spielst, empfehle ich dir dein Itembuild besser zu überdenken so sind z. B. {{item:3107}}  und {{item:3190}}  zu gut, um sie für Soraka nicht zu bauen, vor allem auch weil du \"Segen des Windflüsterers\" hast. Zudem ist {{item:3092}} auch semioptimal und die beiden Alternativen {{item:3069}} und {{item:2302}} deutlich besser, da sie dir z. B. auch Lebensregeneration geben (meine Meinung).\n\nAuf den Jungler gehen wir jetzt mal nicht ein, da der sowieso jedes Spiel wechselt und du den nicht beeinflussen kannst. Zudem wirst du nur mehr gewinnen, wenn du dich selber verbesserst und das Spiel carriest. Das kann man auch mit einem Support der heilt und zwar indem man die wichtigen Teammitglieder am leben hält, dass sie ihren Schaden raushauen können. Achja Losingstrikes passieren genau so wie am Laufband zu gewinnen und 6-10 Spiele nacheinander zu verlieren ist nichts aussergewöhnliches bzw. besorgniserregendes.","replies":[{"poster":"Syonya","date":"2017-01-14T02:34:49.211+0000","up_votes":1,"down_votes":0,"body":"hab soraka lange nich mehr gespielt ,danke  dir dafür :)  und  ich sollte echt mal poke champs spielen :D aber ich frag mich halt was da los ist..  auch in normals klappt es iwann nicht mehr.\n Ich will echt nicht sagen dass alle  jungler scheiße sind  und ja ich  mach auch genug fehler aber  mittlerweile wird jeder immer extrem   mad fängt an zu tilten und flamen. Dazu muss ich noch sagen , dass ich Junglen überhaupt nicht kann und es nicht meins ist. Klar kann er sich nicht zerreißen . \n\nOft mals  wenn man freundlich um einen gank bittet kommt nichts. Habs gestern bei Solo Q gemerkt da sich mein team generell dann in die haare bekommen hat  ( dabei war der Grund so sinnlos..)I:   \nUnd dann will keiner mehr als Team spielen und es ist vorbei x-x","replies":[]}]},{"poster":"Homunculi","date":"2017-01-13T08:36:46.696+0000","up_votes":1,"down_votes":0,"body":"Sehr lustig xD, man hört irgendwie aus jeder Ecke das dieser oder jender Schuld ist xD.\n\nHast du schonmal Jungle gespielt? Besonders in der letzten Zeit? \nEs kann eine subjektive Wahrnehmung sein, aber ich hab in meinen letzten Jungle Spielen des öfteren, böse was zu hören bekommen und das gerne mal vom Support.\n\nGut, es ist ja sowieso immer die Schuld des Junglers oder des Supporters, da brauchen wir uns nichts vormachen, ganz besonders wenn beide in der Base sind und der ADC am Tier2 Turret Dive 1v5 krepiert und rumplärrt warum keiner mitkommt.","replies":[{"poster":"Waldschrat86","date":"2017-01-13T17:03:31.168+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Homunculi,realm=EUW,application-id=KYnfKGf0,discussion-id=so2ncfTI,comment-id=0004,timestamp=2017-01-13T08:36:46.696+0000)\n>\n> Sehr lustig xD, man hört irgendwie aus jeder Ecke das dieser oder jender Schuld ist xD.\n> \n> Hast du schonmal Jungle gespielt? Besonders in der letzten Zeit? \n> Es kann eine subjektive Wahrnehmung sein, aber ich hab in meinen letzten Jungle Spielen des öfteren, böse was zu hören bekommen und das gerne mal vom Support.\n> \n> Gut, es ist ja sowieso immer die Schuld des Junglers oder des Supporters, da brauchen wir uns nichts vormachen, ganz besonders wenn beide in der Base sind und der ADC am Tier2 Turret Dive 1v5 krepiert und rumplärrt warum keiner mitkommt.\n\nAh du kennst also doese Geschichten :D","replies":[]}]},{"poster":"Waldschrat86","date":"2017-01-13T03:59:21.624+0000","up_votes":1,"down_votes":0,"body":"Schau mal, wo ihr mit eurer gewonnenen Botlane steht, wenn der Gergnerjungle was macht und eurer nicht bzw. halt was anderes macht.\nMeistens wird am gegnerischen Turm geklebt, weil hey ihr seid ja särker...naja finde den Fehler.\nImmer besonders interessant, wenn beim Gegner Assassinen zu finden sind.\nAchja undwenn ihr/du eh Lead habt, könntet ihr auch mal selber die Initiative ergreifen und Jungle/Mid whatver unterstützen.\nIch erleb so viele Spiele, wo die Botlane richtig verkackt, sich aber 0 an die Situation anpasst, aber genauso welche, wo das für die Gegner so läuft, man selber zu dem Zeitpunkt zig Türme oder sonstwas machen könnte, aber der ADC, der schpn über 1 Item Vorsptung hat seinen Arsch nicht von der Bot bewegt oder der Support mit seinen Aktiven beim ADC rumgammelt, während der Gegner den Rest überrennt,\nEs sind fast immer die fehlenden Rotationen, die momentan gerade in Low-Elo die Spiele entscheiden.\nEin Beispiel in nem Spiel gestern, kein ADC dafür Annie APC. Wir haben gewonnen, auch nichts extremes schiefgelaufen, aber eine Situation war wieder so typisch. T1 down, Gegner ADC in der Höhe unsere Annie stellt sich in den kleinen Busch amT2. Klar, dass wenn der pusht, den shutdown zu bekommen. Nur gleichzeitig pushen 2 von denen angeschlagen Mitte reißen den Turm ein, hätte sie deffen können, enorm viel Teamgold für die anderen verhindern. Naja das bisschen Killgold hatte höhere Priorität, leider gab's sogar das nicht, da der Jhin nicht so blöd war überhaupt si tief zu gehen. Und irgendwann steht man da und hat Inhis diwn und ist machtlos.\nAllein wenn man solche Dinge mal begreift und auch umsetzt ist man nie lange Bronze und hat auch in Silber keine großen Probleme, sigar darüber trifft das noch zu.","replies":[]},{"poster":"Nagsor Inaste","date":"2017-01-12T23:43:56.219+0000","up_votes":1,"down_votes":0,"body":"Vielleicht solltest du erstmal dein allgemeines Spielverständnis verbessern, was als Supportmain (vorallem Soraka/Janna/Nami) extrem schwer werden kann, weshalb ich dir raten würde in Normalgames so viele Champions und Rollen wie möglich bis zu dem Grad zu spielen, an dem du erkennst, wie dein Gameplay sich auf die Map und Verbündete auswirkt. Wenn du immernur hinter deinem ADC stehst und wartest bist du W/E auf ihn spamen kannst falls mal was passiert und dich dabei aufregst, dass dein Team so wenig macht, wirst du fortgeschrittenere Leaguemechaniken nie wirklich lernen und einsetzten können. Ich sage nicht, dass es nicht möglich ist dies auch so zu bekommen, sondern lediglich, dass es um ein Weites einfacher ist, mit auch anderen, möglichst abwechslungsreichen Rollen zu erreichen.\nDu kannst dir das ein bisschen wie ein LVL-System vorstellen, deinen Support-Skill von 70% auf 80% zu bringen ist wesentlich schwieriger als beispielsweise deinen Toplaner-Skill von 30% auf 40% zu bringen, wobei dir hierbei die neu erlernten Fähigkeiten (zB Map awareness/Objective control) auch für deinen Support nicht nur von Nutzen, sondern sogar essenziell sind.","replies":[]},{"poster":"Supportsmanlike","date":"2017-01-12T23:21:26.528+0000","up_votes":1,"down_votes":0,"body":"Genauso wie du dich fragst, was denn mit den Junglern los ist, gibt es auch Leute die sich fragen, warum kein Mensch supporten kann. Und wie du dir vielleicht selber denken kannst trifft weder das Eine, noch das Andere zu.","replies":[]}]}