{"poster":"Byakko kun","date":"2019-12-10T13:10:35.047+0000","title":"komme nicht mehr auf die support seite von riot","subforum":"Hilfe & Support","embed":{"description":null,"url":"https://support.riotgames.com/hc/de","image":null},"up_votes":1,"down_votes":0,"body":"bei mir kommt immer nur die meldung: \r\n\r\nFehler: Gesicherte Verbindung fehlgeschlagen\r\n\r\nBeim Verbinden mit support.riotgames.com trat ein Fehler auf. Das Zertifikat der Gegenstelle wurde widerrufen.\r\n\r\nFehlercode: SEC_ERROR_REVOKED_CERTIFICATE\r\n\r\n    Die Website kann nicht angezeigt werden, da die Authentizität der erhaltenen Daten nicht verifiziert werden konnte.\r\n    Kontaktieren Sie bitte den Inhaber der Website, um ihn über dieses Problem zu informieren.\r\n\r\nwürde mich über Hilfe freuen. schon mal danke im vorraus","replies":[{"poster":"Eroticat Nimar","date":"2019-12-10T19:32:49.978+0000","up_votes":1,"down_votes":0,"body":"Seite ist virtualy down\n\nmfg","replies":[]},{"poster":"Mezzo","date":"2019-12-10T16:29:32.613+0000","up_votes":1,"down_votes":0,"body":"Bei mir genauso Cache geleert verschiedene Browser benutzt, kann die Seite nicht aufrufen. Ist aber nur die Supportseite betroffen die anderen Riotseiten gehen.","replies":[]},{"poster":"legofreak1","date":"2019-12-10T13:27:38.428+0000","up_votes":1,"down_votes":0,"body":"Diese Fehlermeldung tritt auf, wenn das Sicherheitszertifikat der Seite durch die herausgebende Stelle wiederrufen wurde. Dies kann aus verschiedenen Gründen geschehen, in jedem Fall muss aber der Betreiber der Seite (in diesem Fall der Support) ein neues Sicherheitszertifikat auf der Seite einbinden oder das alte wiederherstellen.\n\nWarte bis der Fehler behoben ist und verwende die Seite nicht, da deine Daten nicht verschlüsselt übertragen werden und somit theoretisch von Dritten eingesehen werden können. Es kann sein, dass dein Browser das veraltete Zertifikat noch im Cache behält und die Daten nicht von alleine aktualisiert. In diesem Fall kannst du den Cache deines Browsers löschen, damit muss er die Informationen erneut abrufen.\nHier findest du Anleitungen für Chrome und Firefox, wie du den Cache deines Browsers leerst:\nhttps://support.google.com/accounts/answer/32050\nhttps://support.mozilla.org/de/kb/Wie-Sie-den-Cache-leeren-konnen","replies":[{"poster":"Ráyleigh","date":"2019-12-10T15:56:48.496+0000","up_votes":1,"down_votes":0,"body":"Cache leeren bringt nichts^^","replies":[]}]},{"poster":"Ráyleigh","date":"2019-12-10T13:13:02.685+0000","up_votes":1,"down_votes":0,"body":"Mir geht es auch so.\nEs wird sich dabei um ein Problem der Seite selbst handeln^^\n\nDa kann man nur abwarten und Tee trinken.","replies":[]}]}