{"poster":"JoshBog","date":"2016-11-17T09:56:48.880+0000","title":"When is flex 3v3 coming out","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"I&#039;ve been waiting for ranked 3v3 in oce since the server came out I use to always play 3v3 ranked with my friends in na when oce wasnt out and I just cant wait for it to come out I hope they release it in oce and not just leave us alone like always.","replies":[{"poster":"CadoAzazel","date":"2016-11-18T10:25:39.292+0000","up_votes":1,"down_votes":0,"body":"Our server population is not big enough for ranked 3v3","replies":[]},{"poster":"Captain Fortune","date":"2016-11-18T02:36:59.738+0000","up_votes":1,"down_votes":0,"body":"In the past Riot has stated because of the small player base that we couldn't have twisted treeline because of how much the community would be split up into different game modes. Having the different game modes meant that queue times in all game modes would be longer to the point where you would have to wait too long to get into a game.\n\nRiot in the past has experimented with fixing this though, with making it so that only during 3pm to 1am on certain days you could queue up for it. This was a good fix as during these times was when the peak amount of players on the server were playing and queue times weren't effected that much by having the amount of options that they did for game modes to choose from.\n\nHopefully they can figure out a solution similar to this or enable the game mode fully. Let me know if you need any clarification or questions and if you are curious you can find the link to the post where they talked about having the game mode up for a limited amount of time [here](http://boards.oce.leagueoflegends.com/en/c/announcements/HAK2vcae-twisted-treeline-team-builder-and-ranked-sr-schedule)\n\nAll up though I am very excited for the possibility of ranked 3s on OCE and I am very keen to play some 3s again with both friends and just generally these are just some things to keep in mind in case they have to implement things to make sure it works.\n\n~Elam","replies":[{"poster":"Pikachoochoo","date":"2016-11-18T02:59:38.495+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LGC Elam,realm=OCE,application-id=Ntey9fRZ,discussion-id=e1t6tEGt,comment-id=0000,timestamp=2016-11-18T02:36:59.738+0000)\n>\n> In the past Riot has stated because of the small player base that we couldn&#x27;t have twisted treeline because of how much the community would be split up into different game modes. Having the different game modes meant that queue times in all game modes would be longer to the point where you would have to wait too long to get into a game.\n> \n> Riot in the past has experimented with fixing this though, with making it so that only during 3pm to 1am on certain days you could queue up for it. This was a good fix as during these times was when the peak amount of players on the server were playing and queue times weren&#x27;t effected that much by having the amount of options that they did for game modes to choose from.\n> \n> Hopefully they can figure out a solution similar to this or enable the game mode fully. Let me know if you need any clarification or questions and if you are curious you can find the link to the post where they talked about having the game mode up for a limited amount of time [here](http://boards.oce.leagueoflegends.com/en/c/announcements/HAK2vcae-twisted-treeline-team-builder-and-ranked-sr-schedule)\n> \n> All up though I am very excited for the possibility of ranked 3s on OCE and I am very keen to play some 3s again with both friends and just generally these are just some things to keep in mind in case they have to implement things to make sure it works.\n> \n> ~Elam\n\nI wish there was ranked solos lol. At least ques aren't 7-20minutes like on Dota2 T_T ","replies":[]}]},{"poster":"Pikachoochoo","date":"2016-11-18T02:55:06.144+0000","up_votes":1,"down_votes":0,"body":"I hope never because duo trolls are bad enough. I wish it was just solo and full custom teams of 5 that existed for rank -.-","replies":[]}]}