{"poster":"Bluishlion","date":"2017-11-05T11:20:12.154+0000","title":"Metodo Anti-Flame 100% funzionante","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Ragazzi come sapete mi hanno bannato 7 account so di aver sbagliato, feci anche un post a riguardo, e adesso ho trovato il metodo per non flammare. Ho scaricato un programma che disabilita il tasto invio cosi da non poter piu scrivere ! Vi sembrer&aacute; una cosa da pazzi ma ho giocato senza scrivere, con i soli ping, e mi sto trovando da DIO. Bestemmio ad alta voce, quando capita, ed &egrave; molto pi&uacute; soddisfacente. Tanto a fine game se devo dire qualcosa nella lobby posso scrivere usando la tastiera virtuale, cosa che non posso fare in game. Ho notato che senza scrivere gioco molto meglio, farmo meglio, uso il cervello. Avessi usato prima questo metodo ora avrei un solo account pieno di icone e skin. Ma come si dice, meglio tardi che mai. Ora voi stareste dicendo:&quot; Ma non &egrave; pi&ugrave; semplice provare a non flammare?&quot;. Lo so che &egrave; sbagliato flammare, ne sono consapevole, rovina i game ed &egrave; tutto a discapito di chi flamma, il quale viene bannato ecc., per&ograve; con questo metodo non ho proprio la tentazione e per ora mi sta bene cosi. \nP.S. se volete sapere il nome del programma basta chiedere, non sto facendo pubblicit&aacute;, ma se posso aiutare anche un solo flamer a stare calmo in game, ben venga xD","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2017-11-05T11:53:08.558+0000","up_votes":1,"down_votes":0,"body":"Buon per te che hai trovato questo metodo ma a volte è necessario scrivere in chat e aiuta: quando qualcuno comincia a tiltare inizio a scrivere di mantenere una mente positiva e di non curarsi degli errori altrui perché tutti fanno errori, scrivo che è sempre vincibile e che non c'è nessun problema, basta farmare e non morire.. e questo negli ultimi tre giorni ha reso possibile l'impossibile, ho vinto partite in cui a 15 minuti eravamo sotto di un inibitore e di 20 uccisioni..","replies":[{"poster":"6GeMiNi9","date":"2017-11-06T16:39:43.473+0000","up_votes":1,"down_votes":0,"body":"+1\n\ncomunque non flammare è facile... basta controllare qui: http://privacy.riotgames.com/en_US/\n\ne guardando il dato preceduto da \"EUR\" capisci che meglio bestemmiare senza premere INVIO, e premerlo per motivare.","replies":[]}]},{"poster":"Saibbo","date":"2017-11-05T14:20:03.573+0000","up_votes":1,"down_votes":0,"body":"Provato semplicemente a togliere il tasto dalla tastiera o scrivere /mute all?","replies":[{"poster":"Bluishlion","date":"2017-11-06T11:41:57.646+0000","up_votes":1,"down_votes":0,"body":"se faccio mute all muto gli altri ma non me stesso XD Se fanno schifo mi viene lo stesso da flammarli o bestemmiarli addosso, invece adesso non posso piu scrivere e ciò mi ha fruttato 11 w su 16 ranked e sono passato in meno di 24h da gold5 0 lp a gold 4 25 lp !","replies":[]}]},{"poster":"Bluishlion","date":"2017-11-06T11:39:43.131+0000","up_votes":1,"down_votes":0,"body":"IL PROGRAMMA SI CHIAMA KEYTWEAK- KEYBOARD REMAPPER ! E' SEMPLICISSIMO , SI SCARICA IN 2 MINUTI :) ( ho messo il maiuscolo per farlo leggere a tutti meglio ).","replies":[]},{"poster":"KHO Haru","date":"2017-11-05T11:51:25.215+0000","up_votes":1,"down_votes":1,"body":"Nome programma? Lo chiedo per tutti non per me dato che flammo raramente ma mi piace come idea e sono sicuro che aiuterà. Scrivilo qui sotto o modifica il tuo post non penso sia preso come sponsor","replies":[{"poster":"Bluishlion","date":"2017-11-06T11:39:08.498+0000","up_votes":1,"down_votes":0,"body":"IL PROGRAMMA SI CHIAMA KEYTWEAK- KEYBOARD REMAPPER ! E' SEMPLICISSIMO , SI SCARICA IN 2 MINUTI :) ( ho messo il maiuscolo per farlo leggere a tutti meglio ).","replies":[]},{"poster":"Sexy Win","date":"2017-11-05T12:30:10.777+0000","up_votes":1,"down_votes":1,"body":"Credo intenda uno script di hotkey\ndel tipo \n{Enter}::return\n\nin un .ahk ","replies":[]}]},{"poster":"NOLIMIT Vladimir","date":"2017-11-05T16:11:50.582+0000","up_votes":1,"down_votes":1,"body":"a chi interessasse a fare una cosa del genere:\n\nScaricate AutoHotKeys da google e installatelo (non vi serve aprirlo una volta scaricato)\nAprite il blocco note e scriveteci     Enter::return\nSalvate il file come <nomechevipare>.ahk\nDoppioclick sul file che avete appena salvato ed entrarà in funzione(non farà nessunissima animazione quando lo fate partire), ogni volta che premerete invio restituirà il controllo al sistema operativo senza effettivamente premere la Key (per voi è come se non funzionasse)\nQuando avete finito di non flammare e dovete fare altro, CTRL+ALT+CANC (o tasto destro sulla barra delle applicazioni) -> Gestione attività -> Tasto destro su \"AutoHotKey Unicode 64bit\" -> Termina attività\n\n\nse una volta fatto doppioclick sul file vi si apre una MessageBox è perchè avete sbagliato a scrivere qualcosa","replies":[]}]}