{"poster":"DoYouEvenRyan","date":"2015-05-10T17:45:45.229+0000","title":"Not getting Forgot password Emails","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"so what i think could be a hacker has got into my account and has changed the password, so i&#039;v done the forgot password and even tried the forgot username and the emails have never gone to my email so i decide to send a support ticket 15 hours later some guy says yeah gonna send the forgot password email to i wait 1-2 hours and i had not still received it then he went on to say i&#039;v already sent you i try to explain the problem more stop replying to me has this got something to do with verifying my email?  i asked him and he didn&#039;t respond to that question.\r\n\r\nDo riot support employee&#039;s get paid bonus or something depending how many people they do? i feel as though i&#039;v been skipped... iv asked Microsoft if my email was alright they said it was all fine on their end as long as they were sending it i would be receiving it i dont understand after 3 days 0 progress. \r\n\r\n\r\nHas anyone had or seen this problem with the forgot password emails?","replies":[{"poster":"HORSE OF FORCE","date":"2015-05-12T07:04:47.425+0000","up_votes":1,"down_votes":0,"body":">My main account is Omgninjaryan and i cant log onto it\n\nI was going to ask how you signed in to the boards, lol.\n\nAnyway, you might want to submit another support ticket claiming about how you think your account has been stolen. Read over [this page](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account) and provide what information you can, and do this as quickly as possible.","replies":[]},{"poster":"DoYouEvenRyan","date":"2015-05-10T17:49:52.188+0000","up_votes":1,"down_votes":0,"body":"AND NO ITS NOT IN ANY JUNK MAIL FOLDER NOT ANY OTHER FOLDERS IN MY EMAIL","replies":[]},{"poster":"DoYouEvenRyan","date":"2015-05-10T17:46:13.691+0000","up_votes":1,"down_votes":0,"body":"My main account is Omgninjaryan and i cant log onto it","replies":[]}]}