{"poster":"Sabber100","date":"2014-10-01T20:41:42.460+0000","title":"Refund kérelem! MÁR LEIRTAM TÁMOGATÁSBA!!!","up_votes":1,"down_votes":1,"body":"Üdv, idéző nevem Sabber100\r\nAzzal a kérdéssel/bajjal fordulok hozzátok hogy nem régiben olyan 3150-es champeket vettem amit iszonyatosan megbántam mivel nem élvezem velük a játékot. Azt a kérdést szeretném feltenni hogy esetleg kaphatnák e 3 refundot mint a kezdetkor...(elhasználtam)\r\nMás hogy is meglehetne oldani gondolom, de ez lenne én magam szerint a legértelmesebb.\r\nBármit elfogadnák segítség nyújtásként, nem pont ezt a Champ eladás módot...\r\nKöszönöm hogy elolvastad/tátok ezt a témát!\r\nElőre is köszönöm!","replies":[{"poster":"iSPZ","date":"2014-10-01T21:00:44.984+0000","title":null,"up_votes":2,"down_votes":1,"body":"Soha senki nem kapott még plusz visszatérítési lehetőséget az alap három lehetőségen kívül. Azt hiszem ezzel elmondtam mindent, nem tesznek kivételt akár 4 éve játszol már a játékkal, akár tegnapelőtt kezdted, ha admin vagy ha nem, ha RP-t töltesz fel ha nem. Rengeteg a szóismétlés, de ezt csak így tudom leírni úgy, hogy teljesen érthető legyen. Visszatérítési lehetőséget, nem fognak adni, ez biztos. \n\nMás lehetőség meg igazából nincs, játssz, gyűjts IP-t és vegyél más hőst, következőleg pedig kétszer fontold meg melyiket veszed meg. Előbb utóbb úgyis megvennéd az összeset, hősre elhasználni a visszatérítési lehetőséget a lehető legrosszabb döntés, ezt mindig leírjuk itt a fórumon is. Nem pénzből vetted mint mondjuk egy kinézetet amit tényleg megbánsz és szeretnéd visszacserélni, hanem teljesen ingyen kaptad azt amiből megvetted. Játszol 2-3 hetet (ki mennyit játszik) és meg van az újabb hősre az IP. Mikor ingyenes próbáld ki, utána vedd meg ha tetszik, élvezed vele a játékot, ne látatlanba, hogy még soha nem játszottál vele és biztosan jó, közbe meg számodra egyáltalán nem az.","replies":[]},{"poster":"VampVik","date":"2014-10-02T07:32:32.350+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az komoly, hogy nyitsz egy eleve fölösleges témát majd egy óra múlva ctrl C+V segítségével sokszorozod is azt?\n\nhttp://boards.eune.leagueoflegends.com/hu/c/segitseg-es-tamogatas/Wh7Ku2cP-refund-kaorelem","replies":[]}]}