{"poster":"Kane the Main","date":"2016-08-19T23:14:29.996+0000","title":"Nur noch Trolls und Absichtliche Feeder","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":3,"body":"Hi ich hab da mal eine Frage an die Algemeinheit ist es bei euch auch im moment auch so egal ob Ranked oder Normal andauernd mindestens ein Spieler dabei der mit Absicht Feeded oder einfach nur rumtrollt mit und nur Schwachsinn macht?\r\n\r\nIn den letzten 18 Games hatte ich es jetzt nur leider wenn man so etwas Reported passiert leider nichts.\r\n\r\nIst das irgendwie ein neuer Trend oder so?\r\n\r\nIch Spiele jetzt seid fast 4 Jahren aber so Extrem war es es noch nie.\r\n\r\nHat jemand auch schon diese Erfahrungen gemacht weil ich muss leider Gottes sagen das mir die Lust auf das Spiel total vergeht dadurch","replies":[{"poster":"Zaddok","date":"2016-08-19T23:18:04.328+0000","up_votes":3,"down_votes":0,"body":">wenn man so etwas Reported passiert leider nichts.\n\nQuelle? :)","replies":[{"poster":"Kane the Main","date":"2016-08-19T23:30:40.450+0000","up_votes":1,"down_votes":1,"body":"Meine Match History dürfete reichen und wenn ich nach tagen keine Meldung bekomme gehe ich davon aus das nichts passiert ist.\n\nAusserdem sind meine Mates mit denen ich Spiele oft genug Zeuge davon.\n\nUnd da ich diese Leute auch blockiere ist meine Blocklist ebenfalls ziemich voll \n\nEs kann ja mal passieren das man mal einen schlechten tag hat und flamed undso oder das man nicht versteht wann man einen TF Forced oder nicht  und deswegen eine auf den deckel bekommt aber als normaler Mensch kann man sich doch eigendlich denken das man das nicht noch mal tut aber falsch gedacht \n\nEs wäre halt einfach schöne wenn es zb beim melden direkt die Option Troller dabei wäre.","replies":[{"poster":"Sentra","date":"2016-08-20T01:18:34.817+0000","up_votes":2,"down_votes":0,"body":"Nunja... Wie ich sehe, spielst Du nicht wirklich \"Aktiv\" von daher ist es natürlich unwahrscheinlicher das Du so etwas wahrnimmst.\nIch habe mir deine History angesehen und konnte da nicht sehr viel von Trolls erkennen nur ein paar Schlechte spiele, die aber dennoch relativ ausgeglichen waren und Du hast auch einige Siege einstreichen können.\nDie Option direkt Troller zu melden ist unnötig das Report-System ist wie es jetzt ist viel genauer denn ein Troll kann vielseitig seien und das System bzw. Die Optionen decken eine sehr große Palette ab. \n\nViel Glück und Alles Gute!","replies":[{"poster":"Kane the Main","date":"2016-08-20T09:14:10.192+0000","up_votes":1,"down_votes":1,"body":"Ja durch das Spiele ich ja immer weniger weil man freut sich mal wieder auf ne gespflegte Runde Lol und dann gehts wieder los ;)","replies":[]}]},{"poster":"Wernicke","date":"2016-08-20T06:30:15.190+0000","up_votes":1,"down_votes":1,"body":"Es vergeht leider kaum ein Spiel ohne Troll,flame oder afk,das ist leider wahr. Ist aber auch nicht nur seit neustem so, leider.\n\nAllerdings bringen Reports sehrwohl was! Beweis wäre z.b. dieses forum^^\nMan bekommt eben nicht immer eine Rückmeldung diesbezüglich. Besser gesagt, man bekommt sie sehr selten.\nDu darfst auch nicht vergessen, das eine Strafe nicht nach einmaligem vergehen eintritt sondern der Spieler sich öfter daneben benehmen muss.","replies":[]}]},{"poster":"Sentra","date":"2016-08-19T23:25:38.453+0000","up_votes":2,"down_votes":0,"body":"Ich Persönlich muss sagen das ich bisher eher gegenteilige Erfahrungen hatte.\nBisher kamen meine Reports ( wenn es denn gründe dafür gab ) immer durch und ich habe des öfteren eine Meldung bekommen das dieser auch Bestraft wurde. Von daher kann ich das nicht so richtig nachvollziehen.\nWie dem auch sei Ich wünsche eine Angenehme Nacht! {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Timethief49","date":"2016-08-20T01:10:15.949+0000","up_votes":2,"down_votes":0,"body":"Es bekommt nur der letzte der einen Spieler der bestraft wird eine Meldung wenn ich mich richtig erinnere. Glaub mir jeder bekommt seine gerechte strafe und wenn du nicht mehr an das System glaubst machs wie ich. Geh durch die Boards und Labe dich an denen die wie wild rumschreien, weil sie gebannt wurden.","replies":[]},{"poster":"grimmiexlove64","date":"2016-08-20T06:49:53.980+0000","up_votes":1,"down_votes":2,"body":"War vor 2 Wochen in der Promo zu Gold 2, dann fingen die Sommerferien an und die ganzen kleinen Kinder kamen in LoL online... und zack runter gedropped auf Gold 5, naja bin jetzt wieder Gold 4 aber trotzdem, wartet einfach noch paar Wochen bis die Ferien um sind dann kann man auch wieder in Ruhe climben.","replies":[{"poster":"DontKillMySoraka","date":"2016-08-20T10:15:02.654+0000","up_votes":1,"down_votes":0,"body":"In vielen Ländern sind die Ferien schon vorbei...","replies":[]},{"poster":"OT Riku","date":"2016-08-20T09:10:58.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=My Supp Sùx,realm=EUW,application-id=KYnfKGf0,discussion-id=jVUhOmbt,comment-id=0002,timestamp=2016-08-20T06:49:53.980+0000)\n>\n> War vor 2 Wochen in der Promo zu Gold 2, dann fingen die Sommerferien an und die ganzen kleinen Kinder kamen in LoL online... und zack runter gedropped auf Gold 5, naja bin jetzt wieder Gold 4 aber trotzdem, wartet einfach noch paar Wochen bis die Ferien um sind dann kann man auch wieder in Ruhe climben.\n\nDas ist nur deine subjektive Wahrnehmung....\nSommerferien sind überall anders und deswegen kommt es dir nur so vor.","replies":[]}]}]}