{"poster":"Lulanesa","date":"2017-03-06T00:54:02.592+0000","title":"Porque son tan tóxicos?","subforum":"Comportamiento del jugador","up_votes":13,"down_votes":2,"body":"Acabo de jugar una ranked y necesito descargarme, me toco support bueno esta bien le voy a poner ganas para que mi carry se fedee, la fase de linea en bot nos fue genial, tiramos la primera torre y empezamos con el roaming. Mi jg **un yi **desde el min 2 dijo que no iba a gankear a nadie, nadie se quejo. Quiso hacer counter jg con lvl 2 y lo mataron, nos flameo a mas no poder a la bot lane yo con lvl 2 aun no podia hacer nada intente ir a ayudar pero murio antes lo peor es que lo mataron 1vs1 ! La partida continu&oacute;, el chabon seguia flameando y nadie le decia nada en ningun momento, es mas con mi adc le poniamos onda diciendo que si se puede ganar que no esta perdido (porque queria rendirse a cada rato) min 20 tal vez, mi mid una lux iba 1-9 o por ahi de muertes, se fue afk porque no le dejabamos kills! Siempre eramos 3vs5 la verdad que es que no nos fijabamos en dejar las kills solo en sobrevivir. La partida continuo con el mid afk, el equipo enemigo llego a romper la primera torre del nexo, otro surrender por parte del yi, se reconecto Lux, bien ahora podemos ganar la partida pens&eacute;, el Yi seguia flameando sin recibir respuesta. Sin alargarme mas, ganamos al fin y al cabo teniamos un yi que hacia lo que hace cualquier yi, pasar a limpiar. \r\n\r\nLa verdad nunca senti esta sensacion de querer perder porque un jugador no merece ganar y me tocaron muchas personas flammer, feeders... Estoy harta de que nunca le hagan nada a esta gente, yo juego para divertirme o para desestresarme pero asi no puedo...\r\n\r\nGracias a los/el que leyo todo solo necesitaba descargarme.\r\n\r\nY si, el Yi ya me dijo que vuelva a la cocina{{champion:32}}","replies":[{"poster":"Ghalen","date":"2017-03-06T03:46:29.411+0000","up_votes":7,"down_votes":0,"body":"LAS está lleno de esos individuos derrotistas y mediocres que parecen estar predispuestos a perder desde el minuto 1, y casualmente son siempre jugadores desastrosos y sin autocrítica.\n\nLamentablemente, en esta comunidad muchas veces se salen de inmediato del lobby post-game y quizás ese sujeto que tendría que haberse comido 9 reportes, recibe solo 1 o 2 con suerte, y le terminan alargando indirectamente su raid de toxicidad por el servidor, gracias a la indiferencia de los que no lo reportaron en su momento.","replies":[{"poster":"Nerf Aery","date":"2017-03-06T17:19:48.226+0000","up_votes":2,"down_votes":0,"body":"Los famosos fracasados que entran a que les den carrito y no a cooperar para conseguirlo, en el game de recién carreamos entre dos y uno de los carreados dijo \"carrito nami y draven\" le di un honor por decir la verdad :3.\n\nY por otra parte, es mas fácil darle al botón de volver a jugar que hacer 3 clics y reportar.","replies":[{"poster":"Lulanesa","date":"2017-03-07T14:39:40.414+0000","up_votes":1,"down_votes":0,"body":"Yo siempre reporto cuando flamean mas que nada, cuando juegan mal bueno.. estoy en plata 2 no puedo esperar mucho de la gente (yo tampoco juego bien siempre) y siempre trato de escribir algo sobre el jugador que reporto, y funciona tal vez le dan un ban por horas pero que te salga el cartel de que vieron tu reporte y sancionaron a esa persona es una gran satisfacción","replies":[{"poster":"Nerf Aery","date":"2017-03-07T14:56:12.865+0000","up_votes":1,"down_votes":0,"body":"Te voy a citar lo que le dije una vez a uno en skype, me dijo que tardaba mucho en aceptar para ir a jugar otra partida.\n\n\"Qué estás haciendo? Acepta que sale otra\"\n-Espera que estoy aplicando la justicia noxiana...Ando reportando a todos por igual, con suerte alguno cae\"\n\nY en efecto, algunos caen en 30 segs y otros en dos horas.","replies":[]}]}]}]},{"poster":"TSW Rorschach","date":"2017-03-06T02:58:29.162+0000","up_votes":5,"down_votes":0,"body":"A mi me pasó algo parecido, yo estaba comenzando a jugar Morgana y tenía un Lee de mi lado que nunca gankeó ninguna lane y encima flameaba. Cuando estaban por nuestra base decía \"gg team\" \"Por qué no me emparejaron con el otro team\", etc. Tenía una Lux que no atinaba ni la E e iba 2/9, pero se la bancaba y lo respeto. No todos saben jugarle a un Urgot m7 xd pero el Lee aparte de manco era flammer y eso si que no lo tolero(?)\nMe puse las pilas porque ni mi adc, ni mi top, incluso ni mi mid merecían perder así. Y la comenzamos a dar vuelta acordando trampas por nuestra jg y aprovechándonos del Urgot que se confió demasiado.\n\nLa terminamos dando vuelta entre los 4 mientras el Lee no hacía NADA. Pero literal, NADA. En un momento se suicidó a propósito, luego se quedo boludeando por la jg.\nCuando la comenzamos a ganar feo obviamente tenía que decir \"QUE IZI QUE SON\" \"TUTORIAL COMPLETO CHE\", y el Urgot enemigo \"Report team\" \"Nadie hace nada\" \"report fulanito porque justo se murió y necesitaba una excusa\".\n\nYa con esas personas no sabés si tenés ganas de ganar o de perder :v decí que al Lee le callé la boca y no me mandó a la cocina, sino ahí si ibas a tener un Morgano furioso(?)","replies":[{"poster":"Lulanesa","date":"2017-03-07T14:25:15.932+0000","up_votes":1,"down_votes":0,"body":"A esto es a lo que voy! A mi no me molesta que no ganen la linea pero que se queden callados! que no culpen a los demas por sus errores, todos tienen malas partidas pero de ahi a flamear al team de la nada siendo que sos el inutil, me da mucha bronca","replies":[]}]},{"poster":"Akalimaster","date":"2017-03-06T12:35:28.641+0000","up_votes":3,"down_votes":0,"body":"Supp: Yi ¿Por que te moriste intentando counter junglear?\nYi: Ez k tenia flach\nSupp: Es un shaco...\nYi: ...\nYi: /all report supp flamer GG afk","replies":[{"poster":"Nerf Aery","date":"2017-03-06T17:29:01.184+0000","up_votes":1,"down_votes":0,"body":"Ese yi era chileno.","replies":[]}]},{"poster":"Nuke","date":"2017-03-06T02:05:33.656+0000","up_votes":3,"down_votes":0,"body":">Porque son tan tóxicos?\n\nNo aceptan ninguno de sus errores, todo lo que escriban hacia ellos con buena intencion en el juego, el lo asimila como amenaza, desafio. Si se equivoca en algo, va a defender su posicion por mas ridicula que sea la excusa, e insultan para sentir que tienen la razon, y asi el otro esta mas \"Oprimido\" porque el lo esta insultando y criticando de forma agresiva.\n\nEn resumen: Para no aceptar errores y porque son muy nerviosos.\n\nRara vez cambian. Pero para algo esta el maravilloso...\n\nhttps://wiki.teamfortress.com/w/images/thumb/d/dc/Banhammer.png/250px-Banhammer.png?t=20100707201757\n\nMas temprano que tarde, si sigue asi va a ser victima de Excalibeer en su silla y su cafe.\n\nhttps://i.gyazo.com/ca8633891934a94cd11a764c2b7fbfa0.png\n\nPD: Si es un caso EEEEEEEXTREMO ingame, podes contactar con el Soporte. \n\n¡Un saludo!","replies":[]},{"poster":"FrozenOnes","date":"2017-03-06T14:25:46.416+0000","up_votes":2,"down_votes":0,"body":"Es increíble, yo trato de mutearlos siempre que toxiquean. Hoy por ejemplo, en SoloQ estábamos pickeando y el support \"nunca había ido supp\". Yo, que juego casi exclusivamente support y mid, ya habiendo pickeado Lux mid, le digo que se elija janna, que es relativamente fácil usarla aún sin conocerla mucho. Inmediatamente el adc salta a cagarme a puteadas, que me calle porque seguramente soy un asco que janna, que si digo eso es porque no se las mecánicas del personaje y que no me meta donde no me llaman...\n\nY yo nada, me quedé perplejo. Le doy al pibe un simple consejo y salta el otro a toxiquearme así..\n\nObviamente lo muteé ni bien empezó el game (y gané!!!), pero me da bronca porque no hay nada de respeto.","replies":[{"poster":"Lulanesa","date":"2017-03-07T14:30:39.231+0000","up_votes":2,"down_votes":0,"body":"Eso pasa siempre! Nunca podes dar una opinion ni nada que ya te empiezan a insultar, una vez pedi que baneen a riven porque mi top era un yasuo... y me dijo que el va a banear lo que el quiera que no va a hacer caso a los demas _perdio a linea_","replies":[{"poster":"FrozenOnes","date":"2017-03-12T15:05:38.650+0000","up_votes":1,"down_votes":0,"body":"Es increíble... pero bueno, al menos cada tanto me topo con alguien normal o copado :/","replies":[]}]}]},{"poster":"guiyex","date":"2017-03-06T22:13:11.682+0000","up_votes":2,"down_votes":0,"body":"Es normal ver eso, lamentablemente es parte de muchas de las partidas en las que entro, siempre que se flamean intento calmar la marea, aunque casi nunca funciona, una vez me dieron como 3 rival honorable por fomentar el respeto entre los jugadores, pero bueno, igual la gente sigue haciendo lo que quiere, es una cagada pero se hace lo que se puede.","replies":[]},{"poster":"La Q de Irelia","date":"2017-03-06T16:20:00.267+0000","up_votes":2,"down_votes":0,"body":"vi la partida y la que peor salio fue esa riven 7/11/4, almenos se remonto y eso es lo que cuenta alfin y al cabo. Lamentablemente no se puede hacer nada con esa gente para que entre en razón. Muteall gg. Son tóxicos porque es su única defensa para no sentirse mancos, no existe otro motivo mas","replies":[]},{"poster":"Uli con azúcar","date":"2017-03-06T01:42:46.643+0000","up_votes":1,"down_votes":12,"body":"Y si ganaste, qué importa lo que haya pasado en el medio? Espero el Yi haya puesto un buen \"gg izi\"","replies":[{"poster":"Carry Me Chizu","date":"2017-03-06T05:25:51.618+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Uliiss,realm=LAS,application-id=PJAKt7ph,discussion-id=m06hHARf,comment-id=0001,timestamp=2017-03-06T01:42:46.643+0000)\n>\n> Y si ganaste, qué importa lo que haya pasado en el medio? Espero el Yi haya puesto un buen &quot;gg izi&quot;\n\nPor gente como esta y otros más la comunidad de LAS está de peor en peor :P","replies":[{"poster":"Zhidow","date":"2017-03-06T08:30:40.110+0000","up_votes":2,"down_votes":0,"body":"Dislike","replies":[]}]},{"poster":"Lulanesa","date":"2017-03-07T14:27:13.394+0000","up_votes":2,"down_votes":0,"body":"Puso lo que le alcanzo el tiempo, que nos carreo, \"isi tutorial\" y que nos reporten a su team obviamente. Y despues el cara rota cuando salimos de la partida a la pantalla de las estadisticas pone \" No merecian ganar mejor hubiera troleado\" ay ya me mori, encima no aclare que esa era mi promo! una perdida otra ganada, esa era la decisiva","replies":[]}]},{"poster":"DinoComeKiwi","date":"2017-03-06T02:13:07.435+0000","up_votes":2,"down_votes":0,"body":"Mira que yo no soy tóxico ni troll, ni me voy afk voluntariamente ni nada... Soy main supp y hay días que te tocan ADC`s que te hacen la típica ; están matando a tu jungla en el río y vas a ayudar, perfecto, tu jungla mató al otro gracias a que fuiste. ¿Pero que pasó en la botlane? Resulta que tu adc diveó a los otros y lo mataron, ahí no más manda un \"gg supp/mira mi supp/no tengo supp\" o gente que flammea sin razón  hasta a un pobre e inofensivo minion mago porque no focuseó a su enemigo. Me he imaginado mil  y un formas de que esa gente muera de manera lenta y dolorosa, incluso he estado a punto de irme afk o trollear diciendo \"No mereces ganar\" pero me acuerdo de que no soy como ellos y me resisto ;_; {{champion:32}} {{item:3070}}","replies":[{"poster":"Zhidow","date":"2017-03-06T08:29:59.431+0000","up_votes":1,"down_votes":1,"body":"A veces yo juego supp y otras veces adc.\nEn cuanto adc a veces el supp no sabe supportear y se va a cualquier linea y me deja solo en bot y la mayoría de los adc no pueden hacer mucho sin supp pero de una manera u otra me las tengo que arreglar solo, pero cuando vienen tipo 4vs2 y están un tanto feedeados, tan sólo nos queda escapar o quedar bajo torre ya que ir a pelear será regalarse porque minimo matarás a uno solo o quizás no. En esos casos en los que vamos escapando justo atrapan al supp y yo me logro escapar y me dice: Pero haz algo. Y por si fuera poco... porque otras veces si me han flameado de que supuestamente no hago nada.\nEn una partida perdimos porque el supp me dejo solo en bot y se iba a cualquier linea a buscar la kill y es más, lo mataban y mataban y aparte de haber feedeado yo en bot porque el otro adc tenía siempre su supp, mi equipo me trata de manco pero ni les importa él por qué.\nCuando juego con un amigo con microfono es muy diferente porque cuando el es mi supp y yo adc en esos casos cuando se junta la jungla, el adc y el supp enemigo y no hay oportunidad de matar me dice que me escape y hace lo posible para morir él y evitar que me maten a mi. Eso no es un buen supp? En cuanto a estos me decían: El supp no puede estar todo el rato pendiente de ti. Pero resulta que no me ayuda ni un poquito porque busca la kill o se tira bajo torre y luego me dice que no hago nada cuando lo matan... \nCuando juego yo como supp le pego a los minions y los dejo con poca vida para que el adc pueda farmear y lasthitear facil, no busco la kill y dejo que el los mate, siempre tambien me interpongo y hago que me maten a mi para que el pueda escapar.\nDime si me equivoco en cuanto a mi forma de ser supp.","replies":[{"poster":"Lulanesa","date":"2017-03-07T14:36:08.515+0000","up_votes":1,"down_votes":0,"body":"Depende de que supp, hay algunos que son de hacer roaming cuando a mi me toca supp trato de fedear a mi carry o dejarlo con algo de ventaja en la linea y recien voy a ayudar otras lineas, esta bien hacer rotaciones de vez en cuando pero ponele que lo tengan bajo torre a mi carry me vuelvo porque siempre divean facil, muchas veces depende de la situacion pero por lo que contas ese supp que te toco si fedeaba las otras lineas mejor que se quede en modo ward jajaja","replies":[]}]},{"poster":"Lulanesa","date":"2017-03-07T14:32:27.910+0000","up_votes":1,"down_votes":0,"body":"Ah pero si no vas al rio el jg inmediatamente \"gg bot lane\" y empieza el bardo. Esta gente es imposibleee! jajajaj","replies":[]}]},{"poster":"Gretta Thunberg","date":"2017-03-06T01:14:26.717+0000","up_votes":2,"down_votes":0,"body":"el tema es que riot no hace nada de nada para eliminar a los trolls, los bannean se crean una cuenta y siguen flameando y despues gente que no es flamer se contagia con esto y asi es el circulo vicioso","replies":[]},{"poster":"Neros II","date":"2017-03-06T03:32:16.049+0000","up_votes":2,"down_votes":1,"body":"Porque la gente no reporta lo suficiente y el sistema tarda mucho en banear. Reporten y esto se ve mucho menos.","replies":[{"poster":"SKT MiIanesa","date":"2017-03-06T03:38:26.604+0000","up_votes":1,"down_votes":5,"body":"JAJAJAJAJJJJAJAJAJAJJAJA Pobre incauto","replies":[{"poster":"TerrSinManos","date":"2017-03-06T14:12:23.681+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/MRPJGavz-cansado-de-los-taxicos-te-enseao-en-5-pasos-el-maotodo-para-que-puedas-banearlos\nLee ésto y tal vez cambies de opinión. La única forma actual de contribuir a un castigo para esta clase de jugadores es reportandolos. El sistema no detecta a los jugadores con mala actitud si no los señalamos con nuestros reportes. Si no reportamos, obviamente gente como esa seguirá dando vueltas y arruinando más partidas.","replies":[{"poster":"SKT MiIanesa","date":"2017-03-07T07:56:17.342+0000","up_votes":1,"down_votes":1,"body":"A lo que me refiero es que, aunque roportes la mayoria de las veces no pasa nada porque no flamean y no les dan sancio :P","replies":[]}]}]}]},{"poster":"Yazuò","date":"2017-03-06T17:37:17.382+0000","up_votes":1,"down_votes":0,"body":"Somos Limones, osea acidos, osea toxicos. Espero los negativos por chiste qlo mas fome enserio wn.","replies":[]},{"poster":"GuzH","date":"2017-03-06T13:18:23.427+0000","up_votes":1,"down_votes":0,"body":"Te invito a pasar por este post: http://boards.las.leagueoflegends.com/es/c/charlas-generales/Uvbusk5E-que-nos-estaa-pasando-parte-2-versian-video-opinion-personal . No sos la única que cree que algo anda mal, podemos hacer algo al respecto! {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"DevilNeverCry","date":"2017-03-06T12:15:17.921+0000","up_votes":1,"down_votes":0,"body":"Y pensar que tuve que carrear con yi en urf, que de por si esta roto en normal pero urf mae mia willy","replies":[]},{"poster":"DarksWaves","date":"2017-03-06T11:24:09.062+0000","up_votes":1,"down_votes":0,"body":"._. Porque es una capacidad del ser humano?","replies":[]},{"poster":"OLP PitusasBoy","date":"2017-03-06T08:36:27.155+0000","up_votes":1,"down_votes":0,"body":"El caso Killtaiwanese (creo que asi era el summoner) demostro la ineptitud e incompetencia del sistema de baneos, que solo banea a los toxicos en extremo, mas no a los trolls/afk/spammers/etc.\nNo esperes peras del olmo, Riot da placebos, nunca soluciones.","replies":[]}]}