{"poster":"fra8breaker","date":"2017-07-13T20:53:29.851+0000","title":"rengar top","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Ciao a tutti ho comprato e in giungla mi sono trovato molto male....... moltissima gente mi ha detto che ormai questo campione &egrave; inutilizzabile volevo chiedere a qualcuno che se ne intende se magari top fosse meglio. grazie  *hope*","replies":[{"poster":"vondarck","date":"2017-07-17T18:09:54.580+0000","up_votes":1,"down_votes":0,"body":"la nuova crepuscolare lo ha rimesso in vita m8\n\nanche io mi sono rimesso ad utilizzarlo","replies":[]},{"poster":"MisogiKumagawa","date":"2017-07-13T20:57:31.182+0000","up_votes":1,"down_votes":0,"body":"Top é anche peggio di giungla,top si trova gente tankosa quindi il burst di tenga é inutile","replies":[{"poster":"Mytlix","date":"2017-07-15T23:31:03.183+0000","up_votes":1,"down_votes":0,"body":"Beh non proprio inutilizzabile ci sono streamer come Dekar che lo giocano top e workano piuttosto bene,stessa cosa se vai a checkare i migliori rengar player nel server KR i primi 2/3 lo preferisco top alla giungla.","replies":[]},{"poster":"fra8breaker","date":"2017-07-13T20:59:44.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IceFoxEren,realm=EUW,application-id=cAOZwaUi,discussion-id=4Jnx2rU6,comment-id=0000,timestamp=2017-07-13T20:57:31.182+0000)\n>\n> Top é anche peggio di giungla,top si trova gente tankosa quindi il burst di tenga é inutile\n\nquindi è inutilizzabile?","replies":[{"poster":"MisogiKumagawa","date":"2017-07-13T21:19:45.214+0000","up_votes":1,"down_votes":0,"body":"Sì purtroppo","replies":[{"poster":"fra8breaker","date":"2017-07-13T21:28:43.534+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IceFoxEren,realm=EUW,application-id=cAOZwaUi,discussion-id=4Jnx2rU6,comment-id=000000000000,timestamp=2017-07-13T21:19:45.214+0000)\n>\n> Sì purtroppo\n\n:, ( e dottor mundo com e?","replies":[]}]}]}]},{"poster":"fra8breaker","date":"2017-07-14T07:30:05.461+0000","up_votes":1,"down_votes":0,"body":"GRAZIEEEEE","replies":[{"poster":"Darkinknight","date":"2017-07-14T08:37:19.295+0000","up_votes":1,"down_votes":0,"body":"Np.\nSolo un altro piccolo appunto.\nCome avrai notato hai a disposizione 2 pagine dir une con cui \"equippaggiare il champ\" prima del game.\nSu queste pagine vanno aggiunte le rune acquistabili nel negozio,tramite ip(punti che vinci giocando) o rp(punti che prendi shoppando).\nCi sono rune di lv 1 e 2 che costano 1ip l'una (in pratica te le lanciano dietro),quelle di lv 3 invece costano moltissimo. Fra qualche mese il sistema di rune verra modificato e non sara necessario comprarle,quindi ti consiglio di prendere solo quelle che ti servono (affidati appunto a Op.gg) ma di lv 2,cosi spendi quasi nulla","replies":[]}]},{"poster":"mangialavandini","date":"2017-07-14T07:18:18.502+0000","up_votes":1,"down_votes":0,"body":"più che al lv 19 senza mastery complete e rune, jung non la puoi fare\n\nl'unico jung che puoi usare a quel lv che regge i danni dei mostri è {{champion:19}} (Warwik)\n\nMa non ti conviene comunque, aspetta di avere una conoscenza sulle lane e poi buttati in jung","replies":[]},{"poster":"Darkinknight","date":"2017-07-14T06:28:52.228+0000","up_votes":1,"down_votes":0,"body":"Allora\nNon affidarti ciecamente a chi ti risponde qui sul forum..molti ti daranno un parere personale,spesso completamente errato nell'effettivo..e tu da novizio,non capirai chi dice il vero e chi boiate.\nInoltre essendo tu novizio non ha alcun senso cercare di capire il meta (campioni piu avvantaggiati nelle patch correnti) che dopo un mese o due cambia.\nTrova la lane che preferisci e Usa i champ che ti piacciono fine,scegliere un champ o un altro cambia solo \"sensibilmente\" la probabilita media di vittoria.\nComunque se vuoi farti una mezza idea di come siano messi DAVVERO i campioni attualmente,utilizza l'app OP.GG.\nLi troverai bene o male tutto cio che ti puo servire per capire se un champ va bene o male al momento,le build consigliate,le skill da maxare ecc.\nTieni solo in considerazione che ci sono 2 parametri principali\n- piu la pick rate è alta piu la win rate di conseguenza tende ad abbassarsi e viceversa\n- difficolta del champ,ce ne sono alcuni sconsigliati specialmente per i novizi.\nSe vuoi comunque capire meglio il game hai 2 scelte\n- giochi tanto e a forza di prendere insulti man mano impari\n- segui degli streamer,cerchi delle guide\nPer rispondere alla tua domanda intanto, sia rengar che mundo non sono messi molto bene atm.\nRengar te lo sconsiglio a prescindere,oltre a non essere messo granche richiede buona conoscenza della jng e il champ stesso non è molto semplice. Top se la cava ancora peggio che non in jng.\nMundo pur non essendo messo un granche,  per il tuo livello è gia piu utilizzabile per iniziare a imparare,estremamente facile da utilizzare e a livello basso si fa fatica a gestirlo con l'avanzare del game..utilizzabile in top viabile in jng.","replies":[]}]}