{"poster":"Xzeus12X","date":"2017-01-18T19:11:40.355+0000","title":"Prendere s è diventato impossibile","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ultimamente ho fatto una partita con rengar, finita 20/04/03 .. &egrave; finita a 20 min perche avevo carriato tutto il game. Ora mi dite come mai ho preso A?","replies":[{"poster":"Jeanne dˆArc","date":"2017-01-18T19:29:32.027+0000","up_votes":2,"down_votes":0,"body":"74cs al 24° sono pochini e praticamente non avevate obiettivi, ward ne hai messe? Credo anche che abbiano surrendato e solitamente quando il team avversario surrenda, si prendono sempre voti più bassi.","replies":[{"poster":"BrattishSolid6","date":"2017-01-18T19:50:09.660+0000","up_votes":1,"down_votes":0,"body":"Non penso che il surrend valga molto a dir la verità. Il problema maggiore è il farm, per prendere S doveva essere ALMENO sopra i 130, ma come minimo proprio.","replies":[{"poster":"Jeanne dˆArc","date":"2017-01-18T19:56:59.629+0000","up_votes":2,"down_votes":0,"body":"Ricorda che il surrender comporta alla mancata conquista di non pochi obiettivi: torri, inibitori e nexus. Anche quelli pesano sul voto finale.","replies":[{"poster":"BrattishSolid6","date":"2017-01-18T20:31:35.804+0000","up_votes":2,"down_votes":0,"body":"Questo sì. Le due cose possono essere correlate, ma se a nexus aperto i nemici surrendono, i voti rimangono pressoché invariati. In quel senso \"non influisce\"","replies":[{"poster":"Xzeus12X","date":"2017-01-18T22:01:06.879+0000","up_votes":1,"down_votes":0,"body":"Mai presa una s con rengar... capisco il surrend ma in altri casi è ingiusto . Lo score piu alto fino ad ora è stato 32/05/10 con 170 cs a 40 min (dove ho fatto una solo penta e il mio team dormiva)tutte le torri distrutte e ho preso 4 draghi completamente da solo. ..... niente.... a+","replies":[{"poster":"BrattishSolid6","date":"2017-01-19T06:14:26.446+0000","up_votes":1,"down_votes":0,"body":"Ripeto, il sistema dei voti tiene moltissimo in considerazione il farm. Non è un sistema al 100% meritocratico, ma non si può pretendere la luna. Secondo me se perseveri nel tuo intento prima o poi ci riesci di sicuro! Siamo tutti con te, buona fortuna ^^ (e prova a farmare un pochino di più, magari anche tassando per pushare dopo una kill o farmando sotto la torre di un alleato morto)","replies":[]}]}]}]},{"poster":"Kinder Inferno","date":"2017-01-18T22:03:05.052+0000","up_votes":2,"down_votes":1,"body":"Mi sono dimenticato che voi challenger riuscite ad avere il 70 %(22 su 34 !) di presence e avere una farm da  laner ,giocando JUNGLER in 20 min... è già.","replies":[{"poster":"BrattishSolid6","date":"2017-01-19T06:16:33.413+0000","up_votes":1,"down_votes":0,"body":"Ho forse detto che io sono in grado di avere quello score con quei cs com Rengar? È già tanto se arrivo a una misera B giocando gli assassini ahahah fatevi una camomilla ogni tanto, che vedete provocazioni e arroganza ovunque. Io ho solo detto quali sono i criteri, lungi dall'affermare che io saprei superarli","replies":[{"poster":"Kinder Inferno","date":"2017-01-19T09:08:12.231+0000","up_votes":1,"down_votes":0,"body":"Il gioco prende il considerazione il fatto  che  stai giocando un jungler e non pretende 130 farm in 20 min, per una S.","replies":[]}]},{"poster":"Xzeus12X","date":"2017-01-18T22:08:17.444+0000","up_votes":1,"down_votes":0,"body":"Main rengar e gioco con 30 fps . Se prendo un pc buono mi ritrovo in lcs xd","replies":[{"poster":"Kinder Inferno","date":"2017-01-18T22:57:41.115+0000","up_votes":1,"down_votes":0,"body":"ahahahah pregherò per te.","replies":[]}]}]}]}]},{"poster":"Best Chair Euw","date":"2017-01-18T19:52:40.870+0000","up_votes":2,"down_votes":0,"body":"Ho visto oggi un lucian 17/2/14 con 270 cs circa prendere s-...Al che mi son chiesto \" cazzo di score fanno di media gli altri lucian per prendere s+?\" ...Quindi si Delle volte non mi tornano molto neanche a me... Vabbè pace","replies":[]},{"poster":"DonCavallo","date":"2017-01-19T19:24:10.151+0000","up_votes":1,"down_votes":0,"body":"- Muori poco\n- Farma TANTO, TANTISSIMO, TROPPO\nAlmeno 100 minion ogni 10 minuti di gioco, ALMENO. Devi avere estinto tutti i minion del mondo e depredato i loro cadaveri. Farma come se non sapessi fare altro. E' tutto la.","replies":[]},{"poster":"Dissociated","date":"2017-01-19T15:09:44.298+0000","up_votes":1,"down_votes":0,"body":"farm. ogni volta che il kda è spettacolare ma prendi un voto basso è per la farm","replies":[]},{"poster":"DuckQuack0","date":"2017-01-18T19:56:34.554+0000","up_votes":1,"down_votes":0,"body":"Perché Rengar è facile da usare","replies":[{"poster":"Xzeus12X","date":"2017-01-18T22:05:58.392+0000","up_votes":1,"down_votes":0,"body":"Se ti trovi contro i bronzoni si ... ma contro i gold basta che ti stunnano e sei morto ^^","replies":[{"poster":"DuckQuack0","date":"2017-01-19T14:55:58.179+0000","up_votes":1,"down_votes":0,"body":"Perché tu lo buildi full AD?","replies":[]}]}]},{"poster":"DJok17","date":"2017-01-19T09:19:15.244+0000","up_votes":1,"down_votes":0,"body":"se il campione è op al momento è difficile prendere s perchè lo score medio è alto..\ncon azir (peggior midlaner del momento) con la media di 60 cs ogni 10 min, score del tipo 10/11/17 mi ha dato a+ quindi fai tu","replies":[]},{"poster":"Piombo Savage","date":"2017-01-19T08:59:02.854+0000","up_votes":1,"down_votes":0,"body":"Mi sembra che Frattaglia disse che i voti vanno assegnati in media ai punteggi e alle statistiche che fanno gli altri giocatori usanti il campione. \nI consigli che ti posso dare sono i seguenti:\n\n-Continua a riprovare e carryiare ;)\n-Devi piazzare un sacco di ward, ma non in base, devi piazzarle nei punti strategici come i bush.\n-I minions sono molto molto importanti (con minions intendo anche i mostri della giungla.\n-Pure gli assist sono importanti quindi anche se magari non c'è la kill per te cerca di aiutare.\n\nSe ti interessa la mia esperienza su la maestria 7 e dei consigli basta che vai a vedere il mio ultimo post, ecco il link:\nhttp://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/EuWtt184-traguardo-maestria-7\n\nBuona fortuna! ^^\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"vondarck","date":"2017-01-19T08:48:10.973+0000","up_votes":1,"down_votes":0,"body":"farma, una volta che hai un KDA superiore a 5 o 6 se finisci 100/0/100 o 10/0/5 non c'è differenza\n\nli fa la differenza che hai avuto con i minion, farma farma farma","replies":[]},{"poster":"Power Mac","date":"2017-01-19T08:40:25.376+0000","up_votes":1,"down_votes":0,"body":"Concordo, con certi campioni. Ora però sto iniziando a capirne un po' di più grazie alle risposte nel thread. Mi aiutate a capire cosa nonandava in queste partite, o se semplicemente la media globale è più alta con quei due campioni? Grazie in anticipo!\n22/6/12 con Darius, 20,8k di farming, 181 minions, due torri distrutte personalmente, 46 minuti di gioco: A. Warding decente a mio parere (ma non mi ci focalizzo molto quando gioco top o mid).\nStatistiche simili in un'altra ma con 6/0/4, 27 minuti, sempre intorno all'A.\n17/5/11 con Swain, 169 minions, una torre e un inibitore distrutti, partita sopra i 30 minuti: A+.","replies":[]},{"poster":"BluCobalto92","date":"2017-01-19T07:18:05.682+0000","up_votes":1,"down_votes":0,"body":"Io ho preso ieri la mia prima S con hecarim (peccato che nn è ancora a maestria 5) \ncomunque ho fatto di tutto in quella partita....mi pare sia finita 20/10/x i cs nn ne ho idea ma tra un tf è l altro farmavo tutto il farmabile e appena vedevo che iniziava un altro tf carivavo e prendevo kill e assist a caso buttandomi in mezzo....mi ha divdrtito troppo quella partita","replies":[]}]}