{"poster":"D4RKside2","date":"2015-03-18T09:21:36.186+0000","title":"veigar(patch 5.4/5.5","subforum":"Champions & Gameplay","up_votes":5,"down_votes":9,"body":"wir wollen den alten veigar{{champion:45}} wieder haben!!! bitte upvoten oder kommentieren um Riot eine nachricht zu übermitteln","replies":[{"poster":"Biestmaster","date":"2015-03-18T14:44:54.378+0000","up_votes":2,"down_votes":0,"body":"Ich will auch den alten Veigar wieder.  \n\nDer Stun ist jetzt unbrauchbar, den kann jetzt wirklich jeder dogen. Über die Q kann man reden aber da der Stun nicht mehr geht braucht man auch kein Q mehr da Ich Veigar in der Form nicht mehr spiele.\n\nEs ist mir auch unverständlich das so hard zu verändern wurde, da Veigar weder mobil noch einen escape hat. Die einzige Hilfe war der stun um anzugreifen und zu entkommen und das mit einem fetten CD. Jetzt ist man gegen all die jump and runs praktisch instant Tot durch den easy doge des Stuns.  und das bla bla Ich kann das aber könnt ihr euch sparen.","replies":[{"poster":"SirPacifista","date":"2015-03-20T22:28:18.664+0000","up_votes":2,"down_votes":0,"body":"Stimme ich volkommen zu, wir brauchen den alten Stun wieder,\nder q ist zwar seltsam, aber damit könnte man leben, ohne einen stun ohne delay wortwörtlich nicht.","replies":[{"poster":"Evenrider","date":"2015-03-21T02:51:24.544+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkPacifista,realm=EUW,application-id=Wj1wcocU,discussion-id=mFQLskqs,comment-id=00020000,timestamp=2015-03-20T22:28:18.664+0000)\n>\n> Stimme ich volkommen zu, wir brauchen den alten Stun wieder,\n> der q ist zwar seltsam, aber damit könnte man leben, ohne einen stun ohne delay wortwörtlich nicht.\n\nSie können ja die Range verkürzen. Sodass man nur noch die halbe effektive Range hat. Oder es Annie-like machen. Stunt zwar, aber für den Rest muss man erst hinlaufen oder flashen, wenn euch das lieber wäre. Sodass man sich wirklich in Gefahr begeben muss und vielleicht sogar seinen Escapespell offensiv nutzen muss.","replies":[]}]}]},{"poster":"Zero000","date":"2015-03-18T09:24:17.157+0000","up_votes":3,"down_votes":2,"body":"Nein wollen wir nicht.","replies":[{"poster":"SirPacifista","date":"2015-03-18T13:40:04.103+0000","up_votes":2,"down_votes":0,"body":"Doch wollen wir ;D\n(all diese Veigar hasser hier...)\nKauf MR und leben und du besiegst den alten Veigar (z.B. RoA+Aby)","replies":[{"poster":"Sirrkas","date":"2015-03-19T19:34:46.212+0000","up_votes":1,"down_votes":0,"body":"Das gilt bei so ziemlich allen Mages.","replies":[{"poster":"SirPacifista","date":"2015-03-20T22:22:44.256+0000","up_votes":1,"down_votes":0,"body":"Das stimmt, aber ich denke das ist bei den meisten nicht so wichtig (im vergleich zu Veigar)\nWeil:\nwenn du gegen Swain, Lux, Azir, DIana etc.  abyssal und mecury theads kauft ist jetzt nicht wirklich so ein problem für diese, sie harassen dich zu tode und geben dir mit den ultis den rest.\n\nVeigar hatte ein Combo, poken war etwas schwierig (außer der gegner kennt Veigar nicht) wenn du die Combo überlebst, was dann?\nTja, alles was man hat auf Veigar und er war match.","replies":[]}]}]},{"poster":"D4RKside2","date":"2015-03-18T09:30:24.337+0000","up_votes":2,"down_votes":0,"body":"warum nicht? er war ok wie er war jetzt ist er unbalanced","replies":[{"poster":"SirPacifista","date":"2015-03-20T22:26:49.049+0000","up_votes":1,"down_votes":0,"body":"Das stimmt, ich versteh auch nicht wie leute das gegenteil behaupten können (davon habe ich in diesen Forums sehr häufig gehört).\nJaja mit ner winrate von unter 42% (niedriger je höher das elo) und wird nicht mehr von einem challenger gepickt und gewonnen.\n\nDie meisten sagen ja das Veigar jetzt einfach mehr skill benötigt, dazu kann man nur sagen.... interessant... und spielt ihn doch selber bevor ihr über etwas redet wovon ihr keine ahnung habt. SEHR viele leute die sagen das er jetzt gut ist spielen ihn gar nicht, da kann man mal sehen wie viel scheiße die Leute reden.","replies":[]}]}]},{"poster":"IKartoffelI","date":"2015-03-18T09:58:15.528+0000","up_votes":2,"down_votes":0,"body":"Der alte war definitiv besser und nicht op, wenn man richtig gespielt hat.","replies":[{"poster":"D4RKside2","date":"2015-03-18T10:02:46.474+0000","up_votes":2,"down_votes":0,"body":"die Q sollte definitiv kein skillshot sein das passt nicht zu veigar und der stun war nicht op denkt mal an annie","replies":[]}]},{"poster":"boOGiepEp","date":"2015-04-08T09:47:07.368+0000","up_votes":1,"down_votes":0,"body":"hatte jetzt mal ne kleine LoL Pause und habe heros of the storm getestet. jetzt wollte ich mal wieder eine runde LoL einlegen...mit meinem Main...Veigar. plötzlich bemerke ich das er gepatcht wurde....ihr habt ihn zerstört riot, danke! LoL is für mich ab jetzt geschichte....ich habe das damals ja bei jax schon durchgenen lassen...aber nun is vorbei. by by LoL, hello Heros of the Storm.","replies":[]},{"poster":"DarkAngel101","date":"2015-03-19T19:25:45.850+0000","up_votes":1,"down_votes":0,"body":"Ich auch der, skillshot sieht soooo unnatürlich und ungewold aus D: und der neue stun ist ein Witz ein sehr schlechter sogar :P","replies":[{"poster":"Andrej553","date":"2015-03-20T09:13:42.468+0000","up_votes":1,"down_votes":0,"body":"Dafür aber leider kein kurzer :(","replies":[]}]}]}