{"poster":"Bavy","date":"2017-05-13T14:02:41.351+0000","title":"CERCASI PLAYER SERI PER SOLOQ","subforum":"Reclutamento","up_votes":2,"down_votes":3,"body":"Giorno a tutti stavo cercando qualcuno (bravo e serio) che abbia un elo compreso fra Gold 2 Platino 2/3 che possa fare ranked assieme a me. Al momento sono quasi in promo per Oro2 ma ero platino e per inattivit&agrave; mi buttarono g5. Gioco da circa 6 anni e sto ritornando a mainare adc (guardate i miei ultimi score) mainavo support.\r\nCercherei un ottimo Mid - Jung - Top possibilmente uno fra questi 3 ruoli.\r\nAddatemi all&#039;amicizia; Pelleossa\r\nNo Silver n&eacute; Bronzi, perch&eacute; l&#039;MMR mi calerebbe troppo ho bisogno di uno col mio stesso MMR o un p&ograve; pi&ugrave; alto.","replies":[{"poster":"I2OADHOUSE","date":"2017-05-13T15:29:56.804+0000","up_votes":1,"down_votes":0,"body":"Scusa ma quando sei stato plat? da op.gg  dice che il tuo picco massimo negli ultimi 2 anni è stato g3","replies":[{"poster":"Bavy","date":"2017-05-16T09:59:34.196+0000","up_votes":1,"down_votes":0,"body":"op.gg ti segna g5 nella scorsa season perché ero inattivo e da plat5/4 in cui ero, mi buttarono di nuovo Gold.","replies":[{"poster":"Dantazzo","date":"2017-05-16T10:05:59.282+0000","up_votes":1,"down_votes":0,"body":"Da plat 5 scendi a gold 1, da lì non c'è più inattività.","replies":[{"poster":"Bavy","date":"2017-05-16T10:43:54.646+0000","up_votes":1,"down_votes":0,"body":"Non credo, mi sono ritrovato gold 5 0 PL. Dopo un mesetto e qualcosa che ho riaperto il client, infatti chiesi e mi risposero così non ho problemi a dare prove seppur il mio intento, in questo post è di trovare un partner affidabile per ritornare in Platino.","replies":[{"poster":"Dantazzo","date":"2017-05-16T10:49:56.729+0000","up_votes":1,"down_votes":0,"body":"Fai conto che io la scorsa season praticamente ho fatto mesi a non fare ranked mentre ero gold alto e lì sono rimasto, visto che l'inattività l'hanno tolta 2 o 3 season fa per il gold.","replies":[]}]}]}]},{"poster":"Demigod Summoner","date":"2017-05-14T11:07:18.764+0000","up_votes":1,"down_votes":0,"body":"Non so quanto è affidabile, io la scorsa season sono arrivato Gold I punti alti, ma mi segna Gold II 0","replies":[]}]},{"poster":"Dantazzo","date":"2017-05-14T09:14:31.925+0000","up_votes":1,"down_votes":0,"body":"Che da plat sei finito gold 5 o è successo in season 3 o è una palla, per inattività puoi scendere al massimo fino a gold 1","replies":[]}]}