{"poster":"MenetSzel","date":"2018-02-01T08:36:25.125+0000","title":"Minden napi gondok","up_votes":1,"down_votes":0,"body":"Nos az&eacute;rt &iacute;rok ide, mert keresem azokat a szem&eacute;lyeket, vagy azt a hangot , aki v&aacute;laszt adna p&aacute;r k&eacute;rd&eacute;semre, &eacute;szrev&eacute;telemre.\r\nEl&eacute;g r&eacute;g&oacute;ta j&aacute;tszom ezzel a becses j&aacute;t&eacute;kkal &eacute;s az &eacute;vek folyam&aacute;n sajnos &uacute;gy &eacute;rzem egyre r&eacute;mesebb.\r\nEzen r&eacute;mess&eacute;g ok&aacute;t a k&ouml;vetkező pontokban fogom &ouml;ssze szedni: \r\n\r\n1. A kliens: az &aacute;lland&oacute; hib&aacute;k , amelyek j&aacute;t&eacute;k k&ouml;zben &eacute;rnek. Gondolok itt arra, hogy a j&aacute;t&eacute;k egyszerűen &ouml;ssze omlik. - A k&eacute;rd&eacute;seket megelőzendő: igen j&oacute; a g&eacute;pem, a vide&oacute; k&aacute;rtya is j&oacute; , a netemmel sincs baj ( k&ouml;zepes csomag, de eddig panaszom nem lehet r&aacute; ) &Aacute;m m&eacute;gis &aacute;lland&oacute; jelleggel kapom azt az &uuml;zenetet, hogy a j&aacute;t&eacute;k &ouml;ssze omlott , mert nincs kapcsolat a szerverrel, pedig az &eacute;n oldalamon semmi gond. \r\n\r\n2. J&aacute;t&eacute;k menet: N&eacute;ha nem &eacute;rz&eacute;keli a skilleket, vagy pedig nem &uacute;gy ahogy kellene. Egy egyzserű p&eacute;lda erre Blitz- hi&aacute;ba van a hookomban az ellens&eacute;g, nem kapja el , egyszerűen tov&aacute;bb s&eacute;t&aacute;l (  tudom van olyan r&uacute;na fa ami ezt lehetőv&eacute; teszi, de azt l&aacute;tom &eacute;s a j&aacute;t&eacute;k jelzi is, &aacute;m voltak olyan esetek, nem is kev&eacute;s, amikor nem volt ilyen r&uacute;n&aacute;ja az ellens&eacute;gnek &eacute;s a hook m&eacute;g se kapta el ) De itt gondolhatunk b&aacute;rmilyen rangre, egyszerűen a j&aacute;t&eacute;k n&eacute;ha nem az adott hat&oacute;t&aacute;von bel&uuml;l kezeli a skilleket. ( M&aacute;s p&eacute;ld&aacute;k : Ashe ulti, Tresh hook, draven ulti ) Ezen apr&oacute;s&aacute;gok miatt sz&aacute;mos olyan esetben sim&aacute;n meg hal az ember amikor nem kellene.\r\n\r\n3. Hős&ouml;k: &Eacute;n tudom, hogy tartani kell a j&aacute;t&eacute;k sz&iacute;nvonal&aacute;t, &eacute;s meg is &eacute;rtem. De k&ouml;ny&ouml;rg&ouml;m, az &aacute;lland&oacute; reworkok &eacute;s az &uacute;j OP-n&aacute;l OP-b hős&ouml;k teljesen meg&ouml;lik n&eacute;ha a j&aacute;t&eacute;kmenetet.  Vegy&uuml;k p&eacute;ld&aacute;ul itt az reworkolt Warwickot , r&eacute;gen az ultij&aacute;val direktbe lehetett az ellens&eacute;ges hősre menni. Most pedig csak sim&aacute;n beugrik &eacute;s ennyi, b&aacute;rki ki&uuml;theti vagy hookolhatja, ez&aacute;ltal a fő k&eacute;pess&eacute;ge teljesen &eacute;rtelm&eacute;t veszti. ( Hi&aacute;ba erős a passz&iacute;vja &eacute;s m&aacute;s k&eacute;pess&eacute;gei, hi&aacute;ba van j&oacute;l felszerelve. Olyan mintha csak d&iacute;sznek rakt&aacute;k volna oda . )\r\n\r\n4. Report rendszer: Erre csak annyit mondan&eacute;k van, de &eacute;n eddig nem l&aacute;ttam haszn&aacute;t. Hi&aacute;ba reportolok valakit , magyarul &eacute;s angolul is. Semmi v&aacute;lasz reakci&oacute;. A reportolt j&aacute;t&eacute;kos pedig v&iacute;gan &eacute;li tov&aacute;bb az &eacute;let&eacute;t. ( Itt nem az ilyen &aacute;ltal&aacute;nos baj&uacute;sz hegyez&eacute;sre gondolok a chatben, hanem sz&aacute;nd&eacute;kos &ouml;ngyilkoss&aacute;gra, erős feedre, &eacute;s nem egyszer cfg-s j&aacute;t&eacute;kosokra )\r\n\r\n5. K&ouml;z&ouml;ss&eacute;g: Ez a legr&eacute;mesebb. Nem &eacute;rtem mi&eacute;rt van az hogy a j&aacute;tszott j&aacute;t&eacute;kok bő 90%-ban van legal&aacute;bb egy olyan szem&eacute;ly aki valamilyen m&oacute;don direkt meg&ouml;li a j&aacute;t&eacute;kot. Azonban semmilyen szankci&oacute;t nem kap cser&eacute;be. ( a fennt eml&iacute;tett report rendszer ) &Eacute;s sz&aacute;momra ez a legr&eacute;mesebb. Felj&ouml;nn&eacute;k kicsit levezetni a gőzt esetleg egy hosszabb nap ut&aacute;n, &eacute;s egy j&aacute;t&eacute;kban, k&ouml;ny&ouml;rg&ouml;m egy j&aacute;t&eacute;kban t&ouml;bb ideget kap az ember , mint a val&oacute;s&aacute;gban. Nem tudom m&aacute;s szervereken is &iacute;gy van-e , de itt sajnos igen. &Eacute;s nem l&aacute;tni semmi v&aacute;ltoz&aacute;st , sőt egyre rosszabb. Főleg ha season kezd&eacute;s &eacute;s z&aacute;r&aacute;s van. Akkor az emberek egyszerűen megőr&uuml;lnek.....\r\n\r\n\r\nEnnyi lenne az &eacute;n kis b&aacute;natom. Nem k&ouml;t&ouml;zk&ouml;dni akarok, vagy fik&aacute;zni a j&aacute;t&eacute;kot, mert n&eacute;ha igen kellemes időt&ouml;lt&eacute;s tud lenni. De ezek a dolgok azok amik miatt ez a pozit&iacute;v &eacute;lm&eacute;ny el&eacute;g gyakran &aacute;tmegy negat&iacute;vba. K&ouml;sz&ouml;n&ouml;m mindenkinek aki elolvassa. Rem&eacute;lem nem hallgat&oacute; &eacute;s &eacute;rtő f&uuml;lekre tal&aacute;l!\r\n\r\nLegyen tov&aacute;bbi kellemes napotok. &Eacute;S j&oacute; j&aacute;t&eacute;kot id&eacute;zők! :)","replies":[{"poster":"Gresident","date":"2018-02-01T10:34:23.454+0000","title":null,"up_votes":1,"down_votes":0,"body":"1. Nálam soha semmilyen gondja nincs a kliensnek 1-2 havonta néha lecsatlakozik max.\n2. Itt a legnagyobb probléma az is ,hogy a skillek és az animáció nem egyforma hatósugarú, pl lux ultija szélesebben sebez, viszont a hosszú animáció alatt csak egy töredékig sebez, vagy sona skilljei kétszeres távolságból sebeznek, mint látszódik.\n3. Itt én inkább azt veszem észre, hogy a late gamesek nerfelve vannak, míg az early gamesek meg boostolva.\nAz assasin itemek botrányosan erősek,{{item:3147}} {{item:3142}} {{item:3814}} és akkor még rakjuk hozzá a {{item:3071}}, ezzel már a tank is megöl egy nagyobb skillel, nem hogy a semmiből feltűnő talon és zed. Némelyik adcnek is jobbak ezek, mint a saját itemei.\n\n4-5. Valóban gusztustalan... néha már élvezhetetlen a játék, hogy már az 5. meccset zsinórba fel kellene adni a 15percnél, persze nem adják fel, végig kell szenvedni velük még 10-15percet a vereségért... Olyan hatalmas eltérések vannak a játékosok közt, hogy az valami hihetetlen... \nÉs olyan gyökerek játszanak, hogy nem képesek belátni, hogy 15perc alatt ha az állás 3 / 25 azt nem lehet behozni.\nAz egyéni képességek mit sem érnek a lolban, a csapat a lényeg... csak ha a csapatodat 4 olyan játékos erősíti, akinek az össz hősismerete nem éri el a tiédet... ott pislogás szokott lenni.\n\nRankeden is ez van, az újat besorolja S2-S3-ba, a régit meg b5-be... aztán csak csodálkozás van, hogy a 40hősismeretes S2 játékos mainját taknyosra veri a bronz5 játékos.","replies":[{"poster":"Storiaron","date":"2018-02-02T09:25:54.309+0000","title":null,"up_votes":1,"down_votes":0,"body":"3. Ha az assasin itemek olyan botrányosan erősek, akkor eltudod mondani, hogy miért nincsen assasin az első 30 legerősebb champon között bronz és silver eloban? A legelső assasin katarina (32. hely)de őt sem kifejezetten mondanám lethality usernek.\n\nLehet, hogy rendszeresen nyomorult supportokat kapsz mikor adczel, de ez nem a meta hibája, hanem a besorolásodé. \n\n\"némelyik adcnek is jobbak ezek\" természetesen, Jhin, Mf, Quinn mi mást vegyen? A caster típusú adc-k miért vennének olyat, amit nem fognak használni? Megjegyzés, hogy Jhin SEM ezt venné, hanem critet, ha a csapatotokban több tank lenne. Vagy egyáltalán.\nAdcnek sem tilos armort vennie. Magasabb elon(félreértés ne essék, én NEM vagyok high elo player, NEM tartom magam annak stb stb)resolve secondaryt hoznak adc-k és azon belül iron skint(+5armor folyamatosan és még bónusz ha használsz potiont)e mellé veszel még egy ninja tabi-t meg egy guardian angelt és a lethality itemekből kereken 0 valueja lesz a szerencsétlennek.\n\n4-5.\n\nA lol nem is csapatjáték mondjuk platinumig(itt vagyok most). Itt SEM ténylegesen csapatjáték, csak kb a meccsek 20%-ában. Minnél feljebb vagy annál magasabb színvonalú meccseid lesznek ebből a szempontból. Ez már csak ilyen. \nTermészetesen a toxicity feljebb sem lesz jobb, az utolsó rankedemben, amit párnapja játszottam a 15. percnél hazabackelt a mides és az adc, hgy tudják egymást nyugodtan flamelni, és számukra a játék befejeződött azon a ponton.","replies":[]},{"poster":"MenetSzel","date":"2018-02-01T12:30:52.971+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sajnos igen, és így értem a skillek problémáját. Azonban azt az egyet valahogy a kicsi agyam nem rakja össze, hogy miért nem lehet egy egységes rendszert össze szenvedni ? Esetleg, hogy az early és late gamek ne legyenek ennyire durván meghatározók. Mert sajna számtalanszor bele futok én is, hogy pl.: Illaio kap 3 killt a játék elején , és utána vége, ha tud az ellenfél vele értelmesen játszani, egyszerűen nem lehet megölni. A rank rendszert meg alapból nem értem, néha akkorák a szint különbségek, hogy az embertelen. Nem lehet eligazodni rajta egyszerűen, és ha véletlen kapsz egy olyan csapatot, ami értelmesen is tud játszani, akkor meg jön az , hogy az ellenfél csapatban afk ki valaki , vagy egyszerűen feladják, mert ott jelenik meg egy troll. Olvasom havonta a lol posztjait a sportszerű játékos viselkedésről. Azonban amíg nincsennek értelmes szankciók ilyen téren, addig sajnos , elnézést a csúnya szóért, de baszhatják az egészet....","replies":[]}]},{"poster":"kalamona90","date":"2018-02-01T12:39:34.451+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az elsővel kapcsolatban csak ismételni tudom a többieket. Nincs bajom az új klienssel. az elején voltak problémák de mondták is hogy lesznek. De már hosszú hosszú ideje nem volt semmi bajom. Egyedül a hextech ládák nyitásakor szokott megakadni. De ezt leszámítva nincs bajom. Sőt 100X stabilabbnak érzem mint a régit. Azt megértem hogy valakinek nem megy rendesen mert nincs elég erős gépe. De ma már kb 60 ezer ft egy olyan használt gép ami 100% kon futtatja a játékot. \n\nA többihez nem tudok hozzá fűzni semmit.","replies":[{"poster":"MenetSzel","date":"2018-02-01T19:35:33.602+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem gyenge a gépem , és mégis néha gondol egyet a játék és ki vág . De akkor felveszem a kapcsolatot a megfelelő emberrel majd. :)","replies":[{"poster":"Gregori","date":"2018-02-01T21:37:38.304+0000","title":null,"up_votes":1,"down_votes":0,"body":"Gép, net, stb pipa, eddig oké. Na és próbáltad már újratelepíteni a klienst? Az idő során sok piszok marad benne, pár évente én is újra szoktam rakni, már csak azért is, mert akár pár gigát is spórolhatok vele.\nJobb ötletem nincs, nekem igazság szerint sosincs vele semmi bajom, legfeljebb a gépem okoz bizonyos problémákat.","replies":[{"poster":"MenetSzel","date":"2018-02-02T06:47:26.222+0000","title":null,"up_votes":1,"down_votes":0,"body":"Még nem, de ahogy lesz rá időm, megpróbálom ezt is , és kösözönöm a tippet. :) {{sticker:garen-swing}}","replies":[]}]}]}]},{"poster":"Shikaichi","date":"2018-02-01T17:48:03.165+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az első kérdéseddel kapcsolatban [ide ](https://support.riotgames.com/hc/hu/requests/new)tudsz írni és segítséget kérni. Lehet csak valami apróság, kis beállításon múlik csak a dolog amúgy, de ők segítenek kideríteni hol lehet a gond.\nA reporttokról csak akkor kapsz visszajelzést, ha te voltál az utolsó aki reportolta, akinek a hatására büntetést kapott az illető. Tehát ettől még lehet kapnak valamit, de abban a meccsben már nem vagy benne, ami után kapják és nem kapsz értesítést sem róla. Ha nagyon extrém, bomlasztó viselkedést észlelsz (anyázás, rákozás, homofób, rasszista megnyilvánulás), akkor szintén a fentebb említett linken, másik kategóriában tudod külön is jelenteni őket.","replies":[{"poster":"MenetSzel","date":"2018-02-01T19:33:59.599+0000","title":null,"up_votes":1,"down_votes":0,"body":"Oksa köszi a tippeket és tanácsot. :)","replies":[]}]},{"poster":"SquatEye","date":"2018-02-01T12:28:42.129+0000","title":null,"up_votes":1,"down_votes":0,"body":"1) vedd fel a kapcsolatot a supporttal, idejét sem tudom megmondani, mióta nincs bajom a klienssel (régen is inkább csak az update sántikált). Lehet, tudnak segíteni.\n2) elég sokat játszom skill shot hősökkel, a hitbox és az animációk néhány esetben csalóka tud lenni, de azért egy bizonyos idő után megszokod, és ráérzel.\n3) ez gondolom ízlés és játékstílus kérdése is, meg persze az egyensúly is kényes téma. Nehezen tudnám megállapítani, hogy összességében 1-1 rework előnyös vagy hátrányos lett-e (kivéve Mordekaiser, akit jól betettek botlane ADCnek, azóta sincs semmi haszna...).\n4) többször kaptam már visszajelzést, és mivel mélységeiben nem látunk bele a rendszer működésébe, nem tudjuk, mennyire hatékony. Alapvetően úgy gondolom, a RIOT még mindig túl megengedő a játékosokkal szemben.\n5) több ember = több idióta. Csapat alapú versenyjátéknál sajnos ez egy nehezen elkerülhető dolog... nem gondolom, hogy a LOL közösség szignifikánsan rosszabb lenne bármelyik másiknál, egyszerűen az emberi természet ilyen.\n\nKellemes napot neked is :)","replies":[{"poster":"MenetSzel","date":"2018-02-01T12:34:53.276+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet. Én nem azt mondom, hogy rosszabb a közösség. :) Egyszerűen úgy érzem lehetnének kicsivel erősebbek a szankciók. És igen csapat alapú, azonban ha az embernek nincs ideje egy-egy hosszabb meccsre, és egyedül akar játszani, akkor azért ne legyen már kiszorítva .:) Mert nekem néha az az érzésem, De lehet egyedül vagyok ezzel. :)","replies":[]}]}]}