{"poster":"Dumbfounded","date":"2018-01-26T01:16:02.735+0000","title":"Bug en la tienda, a alguien más le pasa?","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Hola a todos, quer&iacute;a preguntarles a los jugadores si les ocurre lo mismo que a m&iacute;. He probado en varias partidas y resulta que, si completo primero el _item de support _ (el nuevo con la_ gema de vida_, para tener los 4 wards), luego no puedo completar ning&uacute;n otro item. Intent&eacute; en varias ocasiones comprar _Gloria_ y _Promesa_, teniendo ya el oro y los items anteriores correspondientes y no me deja clickear **comprar**. Vend&iacute; todo y volv&iacute; a comprar y tampoco. Luego de mucho intento en la tienda, reinici&eacute; el juego y finalmente me dej&oacute; comprar los items completos. No s&eacute; si es casualidad o no, pero las partidas siguientes no complet&eacute; el _item de support_ para ver si me pasaba lo mismo y no se me bugue&oacute;. \r\nQuer&iacute;a saber si a alguien m&aacute;s le pasa esto. Sino, ser&aacute; problema m&iacute;o pero como podr&iacute;a solucionarlo? Reiniciar el juego implica tiempo afk, que podr&iacute;a afectar a mis compa&ntilde;eros, sobre todo en early que los tiempos de muerte son muy cortos como para reiniciar mientras este muerto.\r\n\r\nSaludos","replies":[{"poster":"GatoFX","date":"2018-05-06T08:09:03.305+0000","up_votes":1,"down_votes":0,"body":"Arreglen el bug de mierda!!!!","replies":[]},{"poster":"La Garrafa","date":"2018-01-26T01:55:50.811+0000","up_votes":1,"down_votes":0,"body":"A mi me acaba de pasar igual, aun teniendo los items para poder terminar uno me marcaba el precio como si no tuviera nada aunque me marque que tenia comprado para terminarlo","replies":[{"poster":"Dumbfounded","date":"2018-01-26T14:17:32.656+0000","up_votes":1,"down_votes":0,"body":"Claro, eso mismo me pasaba. Pero como lo solucionaste? O no lo solucionaste? Habrá que reinstalar el parche?\nGracias por tu respuesta, Saludos","replies":[{"poster":"La Garrafa","date":"2018-01-26T23:15:51.802+0000","up_votes":1,"down_votes":0,"body":"No lo pude solucionar, y a otro amigo tambien le paso cuando quiso comprar el pebetero. No se si sera por un tema de los items de supp o un bug del mercado del futuro","replies":[{"poster":"Dumbfounded","date":"2018-01-27T16:00:00.020+0000","up_votes":1,"down_votes":0,"body":"Debe ser del nuevo item de support, porque antes no me pasaba. Espero que lo solucionen entonces, creí que era problema mío.\nSaludos","replies":[]}]}]}]},{"poster":"I WAS IN ALPHA","date":"2018-01-26T02:17:41.581+0000","up_votes":1,"down_votes":0,"body":"A mi igual, yo para no reiniciar el juego lo que hacia era seleccionar otro item y luego volver al que estaba por comprar y curiosamente el precio se actualizaba y por lo tanto me dejaba comprar de nuevo normal, pero no se, es molesto :S","replies":[{"poster":"Dumbfounded","date":"2018-01-26T14:19:17.741+0000","up_votes":1,"down_votes":0,"body":"No entendi bien como hacías. Seleccionabas otro item cualquiera y luego el que querias comprar y se te desbugueaba? Creo que a mi no se me solucionó así. Que bueno que lo hayas resuelto, compañero. Reiniciar es muy tedioso.\nGracias por tu respuesta y suerte en la Grieta","replies":[{"poster":"I WAS IN ALPHA","date":"2018-01-26T19:37:42.206+0000","up_votes":1,"down_votes":0,"body":"Si, exactamente como lo planteas, espero que solucionen el bug pronto","replies":[]}]}]}]}