{"poster":"Absolute Three","date":"2019-04-27T21:32:18.908+0000","title":"I have a thought about banning people from the game for bad behavior","subforum":"Player Behavior","up_votes":1,"down_votes":24,"body":"Recently I realized there are more and more bad behaviors in games like kept spamming people for not being really good at playing in ranks and feeding the other team like those people who don't even know how to play the game. For that I suggest if 4 people within the same game reporting a player for the same reason, the player will be banned 2/4/6/8 up to 48 hours and the last ban will be banned forever from the game. And for feeding issue if in 7 days same player got reported for feeding for more than 5 times, he will automatically got demoted one rank. So in this case people will learn how to play as well as stop the spamming behavior in the game.","replies":[{"poster":"MagicFlyingLlama","date":"2019-04-27T21:50:06.578+0000","up_votes":11,"down_votes":1,"body":"Sounds like a great idea, just give premades the ability to ban anyone they want. What could go wrong?","replies":[]},{"poster":"rujitra","date":"2019-04-27T21:46:43.325+0000","up_votes":10,"down_votes":1,"body":"Why should players get more chances than they do now? Further, why should it be based on number of reports, and not on doing anything wrong?","replies":[{"poster":"Shiki Ryougi","date":"2019-04-27T22:50:31.861+0000","up_votes":1,"down_votes":0,"body":"As  counterpoint, who determines what is unacceptable in a community if not that community? That said allowing premades carte blanche to ban people is a dumb idea.","replies":[{"poster":"Kei143","date":"2019-04-28T01:58:59.497+0000","up_votes":1,"down_votes":0,"body":"The community does already decide what is and isn't acceptable. \n\nThe IFS is a learning machine  that learns from the regoin's reports daily. What isn't acceptable is determined by millions of players, and not just 4 people within that game.","replies":[]}]}]},{"poster":"Zombie Gerbil","date":"2019-04-27T21:36:15.028+0000","up_votes":9,"down_votes":1,"body":"The system is fine how it is. \nNo adjustments are needed.  The only thing the system needs are the people who agreed to the terms understand what they agreed to and follow it. That's all this system needs. Players should not be agreeing to something they do not read nor fully understand.","replies":[{"poster":"Immortal Fenix","date":"2019-04-28T00:50:09.358+0000","up_votes":1,"down_votes":2,"body":"Well, I'd say that one adjustment that should be made is what is and is not a bannable offense. I know I've gotten reported for genuinely trying to help someone get better at the game while they were reeing to me about flaming them for building off-meta.\n\nThere is no off-meta when it comes to things like 'Tank Yi'.","replies":[{"poster":"GatekeeperTDS","date":"2019-04-28T01:19:41.031+0000","up_votes":4,"down_votes":1,"body":"> I know I've gotten reported for genuinely trying to help someone get better at the game while they were reeing to me about flaming them for building off-meta.\n\nIf they're reported you for no reason, then you won't get punished. You will never get punished for, \"Hey, maybe you should build x, y, or z.\" You **will** get punished for being consistently belligerent to people across multiple games about their builds. They have a right to build tank Yi and you are not in charge of the team.","replies":[{"poster":"Immortal Fenix","date":"2019-04-28T04:28:53.533+0000","up_votes":1,"down_votes":1,"body":"The problem isn't how I address them, it's in how I speak. I'll smack-talk about my own gameplay by saying things like \"Well shit, I didn't expect that to go so badly.\" or \"Fawk I'm doing awful.\" in these very same games, which still flags the system because the language is still 'bad', even though I'm not flaming my team with it.\n\nNow, I'm not saying that I couldn't simply be a better man and not swear. I certainly could. But it's something that I don't always think about, and it still bites me in the ass later on even when I'm genuinely trying to be a good person.","replies":[{"poster":"zPOOPz","date":"2019-04-28T04:56:35.023+0000","up_votes":1,"down_votes":0,"body":"You will NEVER be punished for saying those 2 things especially when you are referring to yourself.  The system does not flag those 2 statements as \"bad\".  That is not how the IFS works, not to mention it would be the easiest case to get punishment revoked with a simple support ticket if that's all you say in your game.  There's also the fact that no one in their right mind would report you for saying \"well shit, I didn't expect that to go so badly\" or \"Fuck I'm doing awful\" (yes, even if you used \"Fuck\").  No report = no IFS = no review = no punishment.","replies":[{"poster":"Shiki Ryougi","date":"2019-04-28T18:56:20.687+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zPOOPz,realm=NA,application-id=ZGEFLEUQ,discussion-id=qQTZFXsG,comment-id=00000000000000000000,timestamp=2019-04-28T04:56:35.023+0000)\n>\n> You will NEVER be punished for saying those 2 things especially when you are referring to yourself.  The system does not flag those 2 statements as \"bad\".  That is not how the IFS works, not to mention it would be the easiest case to get punishment revoked with a simple support ticket if that's all you say in your game.  There's also the fact that no one in their right mind would report you for saying \"well shit, I didn't expect that to go so badly\" or \"Fuck I'm doing awful\" (yes, even if you used \"Fuck\").  No report = no IFS = no review = no punishment.\n\n[I beg to differ.](https://imgur.com/iGNUrEL)","replies":[{"poster":"zPOOPz","date":"2019-04-28T20:02:52.924+0000","up_votes":1,"down_votes":0,"body":"Why don't you post link or ss to the rest of that thread?  I participated in the old board during the Lyte's Smite era too and I remember that case too (vaguely if it's the same one i'm thinking of.  I believe the entire punishment was dropped due to him doing this in almost all his games and the Tribunal couldn't see that he was doing it to himself)...\n\n> not to mention it would be the easiest case to get punishment revoked with a simple support ticket if that's all you say in your game\n\nA simple support ticket explaining that you're doing it to yourself will get your punishment revoked same as that case if the IFS gets confused about who you're doing it to assuming anyone even reported you to begin with.","replies":[]}]}]}]}]},{"poster":"Zombie Gerbil","date":"2019-04-28T01:31:27.998+0000","up_votes":1,"down_votes":0,"body":"You've may have gotten reported, but you weren't punished. \nGoing off meta is by no means against the rules. It's the intent of trying to ruin someone's game by entertaining themselves by someone else's expense. \n\nSo no, still no adjustment needed.","replies":[{"poster":"Immortal Fenix","date":"2019-04-28T04:30:22.080+0000","up_votes":1,"down_votes":0,"body":"Not to be lazy about this, but I don't want to copy-pasta. Look at my reply to Gatekeeper. It's not the advice that flags the system, it's other incidents throughout the match.","replies":[{"poster":"Zombie Gerbil","date":"2019-04-28T04:52:10.563+0000","up_votes":1,"down_votes":0,"body":"I've read it. Yet, still not flaggable. I've said much much worse over the past 10 years.\nThe thing is, the system itself, it is much smarter than you'd ever assumed. While it seems like it only goes by certain word triggers, it's much more complex than that. You see, you can say \"fuck\", \"shit\", \"goddamnit\" or what have you. IFS won't even bat an eye. \n\nThe system is triggered by consistency and severity. Only the two. Consistency has this pattern humans uses, because the system itself, it's not really what punishes you. No, it's the players that you play with gives out that information. When you piss off enough people, it sticks. When I say it \"sticks\" I mean it's a flaggable offense that is against the Terms of Use. No context is needed, simply only the two formulas being consistency or severity.\n\nHowever, no matter how many reports you rack up, if it's not legitimate, you will not be flagged. Regardless of how many players reported you in a single game or even in a single day. No, because without that one certain intent, you can't be flagged. How do I know this? Simple, I know this because I've been here for 10 years, I've tested my limits, and yes, I got a couple of chat-restrictions and easily learned from it. The system has not always been the way it is, due to the fact it's constantly changing, but the system, the moral standard, and purpose of Riot Games intent for their game have never changed. For our main purpose here is to play the game and not use the chat against their players. The ill intent will be constantly reminded, warned, and punished if the players decide to go against the Terms of Use.","replies":[]}]}]}]}]},{"poster":"Prandine","date":"2019-04-28T06:08:52.580+0000","up_votes":3,"down_votes":0,"body":"Absolutely not as it would be abused heavily by premade trolls and jerks. Not only that but it's exactly why reports only flag games for review rather than immediately dish out a punishment, so premade trolls and jerks can't simply gang report someone they don't like or whatever. Besides, playing bad by itself isn't punishable, but intentionally playing bad to troll or grief is.","replies":[]},{"poster":"hrooza dota ","date":"2019-04-28T19:21:07.483+0000","up_votes":2,"down_votes":0,"body":"what if 4 players are flaming 1 guy for losing the lane that he was trying at? the poor guy will get banned for hours for something he had no real control of.","replies":[]}]}