{"poster":"M4UR1C31234","date":"2015-03-22T12:10:36.543+0000","title":"Die Aufgaben eines Junglers? Und gute Jungler für Anfänger?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo Liebe Com,\r\n\r\nIch würde gerne mal wissen was die genauen Aufgaben eines Junglers sind, da ich vlt. mal Junglen testen wollte, da ich im Last hitten von Creeps mehr als schreklich bin (81 Farm nach 45 Minuten wenn ich versuche was anderes als Support zu zocken ._.) und man als Jungler ja eher die Monster im Jungle tötet. Desweiteren wollte ich direkt dazu Fragen welche Champs sehr für den Jungle geeignet sind so in der Preisklasse von 450-3150 EP ({{champion:102}}  und {{champion:154}}  weiß ich aber die sind leider recht teuer und als recht neuer LOL spieler (zumindest Zac) denke ich mal nicht so easy zu spielen ^^.\r\n\r\nIch Bedanke mich schon einmal im Vorraus für eure Hilfe.\r\n\r\nMit Freundlichen Grüßen","replies":[{"poster":"Black Mage","date":"2015-03-22T12:30:58.398+0000","up_votes":2,"down_votes":1,"body":"Aufgaben? Kommt auf das team, den jungler, etc an, nie wirklich feste Aufgaben!\nAber die häufigsten sind:\n-Schlechte Matchups unterstützen durch Ganks\n-Gute Matchups mit wenigen Ganks zum Snowballen bringen\n-Objectives (Türme, Drachen, Baron, etc) sichern/holen\n-Den Gegner unterbrechen/nicht zum Spiel kommen lassen\nUnd das wichtigste: Das Spieltempo entscheiden!!!\n\nWenn DU/IHR das Spieltempo entscheidet, muss der Gegner drauf antworten, da er sonst Verluste macht (außer ihr lässt ihm Freilauf und er nutzt diesen aus), zum Spieltempo gehören Sachen wie: \"Der Gegner muss in einer unguten Position den Drachen unterbrechen, ansonsten bekommt dein Team einen noch höheren Vorteil, aber wenn dieser reingeht wird er höchstwahrscheinlich sterben, was genauso schlecht, vlt sogar schlimmer ist!\"\n\n\nDeswegen sind offensive Jungler gut ({{champion:121}} {{champion:80}} {{champion:107}} ) und Tanky Jungler ({{champion:113}} {{champion:32}} {{champion:31}} ) eher in Außnahmen \"genauso gut\"\n\nEdit: Deswegen war auch {{champion:59}} viel zu gut, denn er konnte sowohl Tanken, als auch Offensiv bauen, er ist halt ein Mobiler Darius gewesen, und das war nicht feierlich","replies":[{"poster":"dat Zoidberg","date":"2015-03-22T16:15:12.900+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Black Mage,realm=EUW,application-id=Wj1wcocU,discussion-id=5IHwQMJk,comment-id=0000,timestamp=2015-03-22T12:30:58.398+0000)\n>\n> Aufgaben? Kommt auf das team, den jungler, etc an, nie wirklich feste Aufgaben!\n\nFalsch, Drake gehört zu den festen Aufgaben des Junglers. Aber viele Jungler scheren sich nen Dreck darum und der Gegner holt einen Drake nach dem anderen weil keine Wards gestellt werden und der Drake-Timer ignoriert wird.","replies":[]},{"poster":"Nuckmuck","date":"2015-03-22T15:22:45.105+0000","up_votes":1,"down_votes":4,"body":"Assassinen wie {{champion:121}}  oder {{champion:107}}  eignen sich nicht mehr so gut für den Jungle. Sie haben einen schwachen clear und sind wen sie behind sind schwach. \n\nTank Jungler wie {{champion:32}}  oder {{champion:113}}  sind momentan am Stärksten. Durch das neue Jungle Item sind sie umheimlich Tanky. Meine Off-Tank Sejuani hat am ende 5700HP. Und mit ihrer Ulti kann ich ein Spiel komplett drehen. \n\nIm Allgemeinen finde ich das Jungler die  Teamkampf Fähigkeiten haben besser. Aber es kommt immer aufs Spiel an und was schon gepickt wurde.","replies":[]}]},{"poster":"IKartoffelI","date":"2015-03-22T19:53:09.031+0000","up_votes":1,"down_votes":1,"body":"Denn immer daran, dass ganken NICHT deine primäraufgabe ist. Du kannst es mal machen, aber der Jungle is Deine Lane.","replies":[{"poster":"Edward Thatch 33","date":"2015-03-23T17:46:30.559+0000","up_votes":1,"down_votes":0,"body":"Ganken ist wichtig um deine laner zu unterstützen. Kommt aber auch auf den Champion an, {{champion:9}} ,{{champion:19}}  und {{champion:77}}  sind im early  game keine guten ganker, während {{champion:35}}  und {{champion:64}} richtige Gankbestien sind","replies":[]}]},{"poster":"Marksmansitter","date":"2015-03-22T13:36:14.069+0000","up_votes":1,"down_votes":0,"body":"Gute Jungler (im aktuellen Patch):\nSejuani, Jarvan, Reksai, VI,  Amumu, Rengar...\n\nAufgaben:\n\n(Kommt auf den Champion drauf an)\n\n- counterganks setzen \n- eigene Hanks\n- objekt-Kontrolle\n- Warden/Dewarden\n- Auf die Karte achten und das Team vor Gegner warnen (auch wenn es offensichtlich ist)\n- bei Gelegenheit counterjunglen","replies":[]},{"poster":"Aramedis","date":"2015-03-23T09:16:50.931+0000","up_votes":1,"down_votes":2,"body":"Was ganz wichtig ist und du dir unbedingt merken solltest:\nALS JUNGLER BIST DU IMMER SCHULD! \nEgal für was du bist Schuld!\nDu musst auch nicht fragen wieso oder weshalb, akzeptiere deine Rolle als geflamtes Opfer und du hast den ersten Schritt zum Jungler bereits geschafft!\n\nJetzt aber mal zum Junglen an sich.\nDu bist nicht dafür gedacht um für deine Teammitglieder die Lane zu gewinnen.\nSchreien diese auch noch so oft nach Ganks musst du immer abschätzen in wie weit das sinnvoll ist. Ein Botlane zu ganken die bereits deutlich hinter dem Gegner liegt ist meist der eigene Tod und somit musst du für dich entscheiden in welcher Situation es richtig ist zu ganken und in welcher nicht!\nNatürlich kommt es dabei auch stark auf deine Elo an. Im höheren Bereich wird man das verstehen wobei im unteren Bereich wohl der Chat durch die Decke geht aufgrund von geflame. Aber wie gesagt Regel 1 du bist immer Schuld.\n\nAls Jugler stehst du an irgendwelchen Camps und killst diese. Hierbei nutzt du paar skills und machst an sich nicht viel. Während dieser Zeit ist die Minimap dein bester Freund.\nSolltest du gegnerische Bewegungen sehen auf der Minimap, z.B. Midlane versucht richtung Top zu gehen, dann Ping was das Zeug hält und unterstütze so dein Team. \n\nAls Jungler musst du zumindest im höheren Elo Bereich auch für ausreichend Vision sorgen. Das bedeutet nach dem 1 oder 2 back in die Base auf das Rote Trinked wechseln und Wards kaufen um entsprechende Objekte, beispielsweise den Drachen im Blick zu haben aber auch um den Gegnerischen Jungle auszuspionieren. Denn eines ist unglaublich wichtig für einen guten Jungler!\n\nTIMING ist alles! \nDu musst ein Gespür entwickeln für den Jungle. Was könnte dein gegenüber als nächstes machen, er ist bei blue gestartet also könnte er einen early gank mit hecarim in der mid wagen also passe ich meine Route so an das ich gegen Minute ... ungefähr in der mid sein kann. Denn eines ist klar der beste Gank ist und bleibt der Countergank!\nAuch wissen wann ich eine Lane in den gegnerischen Tower reinpushe oder wann ich die Lane freeze gehört für einen Jungler zum kleinen 1 mal 1 \n\n\nJeder kann Jungeln dafür braucht es keine sonderlichen Fähigkeiten die Camps bekommt jeder umgehauen. Richtig und gut zu Jungeln das können nicht viele. \n\nZu den Champs!\nDurch das neue Jungle Item hat sich einiges geändert. \n\nGanz hoch im Kurs stehen Jungler wie:\n{{champion:113}} , {{champion:421}} ,{{champion:20}} ,{{champion:2}} \naber auch weitere haben ihren weg wieder zurück gefunden\n{{champion:72}} ,{{champion:120}},{{champion:32}} \nund hier noch ein Insider:\n{{champion:154}}  \n\nFür jeden dieser Champs gilt, kaufe die grüne verzauberung und hol dir Gegenstände mit Leben. Danach Ressi Gegenstände und du wirst vermutlich ewig leben und dabei immer noch einiges an DMG drücken.","replies":[{"poster":"Powerjen","date":"2015-03-23T15:02:03.727+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Aramedis,realm=EUW,application-id=Wj1wcocU,discussion-id=5IHwQMJk,comment-id=0005,timestamp=2015-03-23T09:16:50.931+0000)\n>\n> Was ganz wichtig ist und du dir unbedingt merken solltest:\n> ALS JUNGLER BIST DU IMMER SCHULD! \n> Egal für was du bist Schuld!\n> Du musst auch nicht fragen wieso oder weshalb, akzeptiere deine Rolle als geflamtes Opfer und du hast den ersten Schritt zum Jungler bereits geschafft!\n> \n\nAls Supporter auch ;-)","replies":[]}]},{"poster":"iScoutx","date":"2015-03-22T12:49:25.219+0000","up_votes":1,"down_votes":1,"body":"Warwick, Amumu, Master Yi","replies":[]},{"poster":"Dru8urz","date":"2015-03-22T12:40:49.411+0000","up_votes":2,"down_votes":2,"body":"Zuerstmal: du MUSST deinen cs verbessern. Ich selbst bin support/jungle main trotzdem MUSST du manchmal andere rollen spielen, und csen können und als jungler musst du auch manchmal lasthitten. Aber zum junglen: ich nehme an du weisst welche route du nehmen musst. Wenn nicht ist meist gromp +leash+smite, dann blue dann red +smite am besten. Dann siehst du erstmal weiter. \n1.**GANKEN**: wenn eine Gegner lane hart pusht UND ihr in 2v1 könnt ( dass trifft net immer zu) dann geh sofort hin. Benutze deinen gapclose/runspeedseroid sofort, ebenso deinen stun. Ich nehme mal als beispiel jarvan. Viele machen den fehler und gehen auf die lane, autohitten und q-e erst nachdem sie hinter dem ziel stehen. Sinnlos denn: wenn du dannn erst q-est, hat dein laner keine zeit mehr damage zu machen. q-est du gleich, kann dein laner bursten UND der gegenerlaner paniced. so sieht ein gank aus.\nHast du einen summoner gezogen, merk dir in und schreib in in den chat und komm BEI DER NÄCHSTEN GELEGENHEIT SOFORT WIEDER. Wenn ein velkoz keinen flash mehr hat, und er mid genau in der mitte steht, ist er free kill. Botlane ganks geben mehr, da diese 4 summs blowen, während mid/top nur ihren flash haben. nachdem der gegner auss der lane raus ist pusht ihr sie gemeinsam um seinen cs zu denien. wenn dein laner und nicht du den kill bekommen hast, darfts du taxen, seinen cs nehmen. bekamst du den kill taxe lieber nicht um den laner bei laune zu halten.\n2. **FARMEN** Wenn du das stackitem hast, farme immer schön viel im jungle, vergiss aber trotzdem das ganken nicht. Ist dein laner nicht auf der lane darft du auch seinen cs securen.\n3.** OBJECTIVES** ACHTE AUF DEN DRAKE! das ist nur deine aufgabe, nicht die des supports.BUFFS: überlege immer, ob du dem gegner ainen buff stealst, wie (fighten, dann buff nehemen oder wegsmiten) warum ( er invaded meinen red, ich seinen, sein buff ist gleich up) und ob es sicher ist ( wo ist deren mid/top/bot).\n4. **DEN GEGENERJUNGLER DENIEN** durchs buffs stealen , counterjugnlen und counter ganken. Eine lane von dir pusht und hat nicht gewarded und ide gegener haben einen starken gankjungler? stell dich ungesehen in einen inlane bush, warte bis der gank kommt und dann ZERSTÖRT SIE.\nausserdem: wenn di counterjunglest: cleare die buffs für den timer, lass bei anderen camps 1 übrig, nicht 2 denn die kleinen geben sehr viel xp.\n\nWICHTIG: nimm erstmal das lila smite, das gibt dir leben und mana wenn du monster smitest, mit den anderen kannst du eh nix anfangen und das lilane is eh gut.\n\nEin guter anfänger jungler ist Wukong, du baust ihn mit der Krieger verzauberung als ad-offtank.\nHast du grad nich so ep am start, gönn dir amumu, bau ihn mit der tank-verzauberung und höchstens 1 offensives item( höllenzepter oder liandyrs, maximal beides). Beide können okay junglen und haben idiotensichere ganks und tolle ultis. Gick am besten noch ein paar yt videos wo jungle gespielt wird. Bist du besser, darfst du auch das stackitem bauen (mit yi, fizz usw) aber traue dich erst spät an lee und sieh dir am besten den 1h lee guide von nightblue an. Viel Spaß und nimm flamen nicht ernst ! Hoffe ich konnte helfen","replies":[]}]}