{"poster":"Pan De Coco","date":"2018-06-30T11:19:15.949+0000","title":"Missions not working?????","subforum":"Miscellaneous","up_votes":11,"down_votes":1,"body":"My mission is win a game in under 30mins PVP in SR or win 3 PVP games.... so far played 1 ranked and 1 URF both won and both in under 30mins but none of them counted... HELP!!!!!!!!!!!!!!","replies":[{"poster":"Ninox","date":"2018-07-01T01:21:57.913+0000","up_votes":2,"down_votes":0,"body":"For those who haven't noticed the ticker (yellow exclamation in the client), it's a known issue and it's being worked on.\n\nNow don't quote me on this, but it appears that it is in essence only a *display* bug. The missions appear to still be completing, just the mission panel isn't updating visually. \n\nThe ticker makes it sound like this is the case \"there is a problem *showing* progress on missions\", and when I logged in this morning my missions that I did last night updated. One updated with \"win a PvP game\" instead of \"win a PvP game in under 30 minutes\", but it's better than nothing.\n\nI don't know if all you will have the same experience, but I'd recommend you see if any missions have updated when you log in next.","replies":[{"poster":"NamsterNam","date":"2018-07-01T08:08:28.412+0000","up_votes":1,"down_votes":0,"body":"None of my missions have updated since yesterday.\nSo I'm still waiting on the rewards of my daily \"win a match\" mission and \"win a PvP game\" that I have already completed.","replies":[{"poster":"Ninox","date":"2018-07-02T03:15:05.704+0000","up_votes":1,"down_votes":0,"body":"Not sure if it's being fixed in waves of players or by region or what the go is. We don't have anymore details. I know it's working for me and my partner now and a few others on OCE but I don't know if that will remain the case. Just hang tight I suppose, they'll fix it soon.","replies":[]}]}]},{"poster":"Zero Infinity","date":"2018-06-30T16:05:37.870+0000","up_votes":2,"down_votes":0,"body":"Came here to report the same issue. Wonder what's going on.","replies":[]},{"poster":"LurksInCorners","date":"2018-06-30T14:28:22.596+0000","up_votes":2,"down_votes":0,"body":"I'm going to run out of time to complete the Day 1 mission for the event because no matter how many times I satisfy its conditions it doesn't update. There's only 30 minutes left.\n\nEDIT: and I can't complete all of the quests because of a bug.","replies":[]},{"poster":"Project Xayah","date":"2018-07-01T08:44:49.077+0000","up_votes":1,"down_votes":0,"body":"For some reason, I've barely had this issue occur. Across two accounts, I've only had one mission (out of 7 or so total, including 2 FWotD) that hasn't updated.\n{{sticker:sg-lux-2}}","replies":[]},{"poster":"top or feeeeeed","date":"2018-07-01T04:38:37.355+0000","up_votes":1,"down_votes":0,"body":"any paybacks{{champion:79}}","replies":[]},{"poster":"187prelude","date":"2018-07-01T02:09:25.593+0000","up_votes":1,"down_votes":0,"body":"Idk what’s happening I’m killing minions and it’s not effecting my missions???\nWhen will this be fixed supposably? It’s day 4.","replies":[{"poster":"Ninox","date":"2018-07-01T02:48:30.621+0000","up_votes":1,"down_votes":0,"body":"Likely they don't have a timelined fix yet, and if they do, likely we won't receive any communication, since the teams that know what's going on are busy working on the fix. This is at the very least affecting NA as well, it's not just us. When it's fixed depends on when the cause is identified and how hard it is to resolve. We don't have any more details than \"it's a known issue and being worked on\" atm.\n\nThat said, it does appear that missions are still updating, just not visually *and/or* that there is a significant delay between the game played and the missions updating. The games I played last night updated for me this morning.","replies":[]}]},{"poster":"Villainess","date":"2018-07-01T01:46:01.268+0000","up_votes":1,"down_votes":0,"body":"Same here - played a 37 minute ARAM game, got an S+ on Zilean, no FWOTD, no credit on any of the missions.","replies":[]},{"poster":"4y5tvb8","date":"2018-06-30T23:34:09.966+0000","up_votes":1,"down_votes":0,"body":"No match history - Mission won't detect healing done (tried 3 diff games) - 1st win of the day won't trigger","replies":[]},{"poster":"Lelface","date":"2018-06-30T23:32:05.471+0000","up_votes":1,"down_votes":0,"body":"same :/","replies":[]},{"poster":"Jaczam","date":"2018-06-30T16:59:15.832+0000","up_votes":1,"down_votes":0,"body":"Same here, do something rito! {{champion:266}}","replies":[]},{"poster":"AKMU","date":"2018-06-30T13:49:12.695+0000","up_votes":1,"down_votes":0,"body":"[How cute.](https://imgur.com/wDQrwvd)\n{{champion:99}}\np.s. I already have Lux...","replies":[]},{"poster":"Socon","date":"2018-06-30T13:28:06.813+0000","up_votes":1,"down_votes":0,"body":"My match history is not updating at all and i've played like 7 games","replies":[]},{"poster":"Montiness","date":"2018-06-30T12:17:24.408+0000","up_votes":1,"down_votes":0,"body":"Although I've just had the lovely experience of my First Win bonus not updating either so..... yeah.  Or the Short time to complete \"Call to War Day X\" ones, rip completing these on multiple accounts.","replies":[]},{"poster":"Montiness","date":"2018-06-30T12:07:02.747+0000","up_votes":1,"down_votes":0,"body":"same\n\nThere is a not saying they're aware they're not updating, nothing about what to do with it afterwards","replies":[]},{"poster":"DarkSoul1994","date":"2018-06-30T12:07:00.478+0000","up_votes":1,"down_votes":0,"body":"Yeah these missions bugged a few times for me. Just keep playing games and you'll get them done in no time.","replies":[]}]}