{"poster":"MukiGumixD","date":"2017-06-14T04:29:11.863+0000","title":"Varus Está Demasiado, DEMASIADO, roto.!","subforum":"Problemas Técnicos","up_votes":1,"down_votes":8,"body":"{{champion:110}} En cuestiones de que es ya para m&iacute;, bastante complicado luchar ocntra ese campe&oacute;n, logr&eacute; notar qu&eacute; est&aacute; suficientemente roto como para ganar l&iacute;nea, principalmente a inicios de juego, al llegar a jugar contra este campe&oacute;n se puede ver como su ofensiva es bastante alta, como por ejemplo una peque&ntilde;a compra del Varus y es suficiente para romperte de 3-5 basicos sin mencionar su Q y W que es exacatamente a lo qu&eacute; voy, sin m&aacute;s rodeos me concentro a decir que tiene demasiado poder como para luchar contra el a principios de partida y definiendose....! Es pero escuchen y pongan atenci&oacute;n.","replies":[{"poster":"erwinchelo","date":"2017-06-14T10:21:28.106+0000","up_votes":2,"down_votes":0,"body":"Que aparato....","replies":[]},{"poster":"Yitán","date":"2017-06-14T07:30:27.081+0000","up_votes":1,"down_votes":0,"body":"creo que es de los adc que menos problemas te da cuando está en el equipo rival","replies":[]},{"poster":"Setsumi Sakura","date":"2017-06-14T07:11:35.766+0000","up_votes":1,"down_votes":0,"body":"tiene bastante daño, pero se mueve menos que una torre.","replies":[]},{"poster":"Trying Improve","date":"2017-06-14T06:05:19.641+0000","up_votes":1,"down_votes":0,"body":"pero si en solo q es una mierda xd \nobvio que te va a reventar si te aplica su pasiva.","replies":[]},{"poster":"Lucio22","date":"2017-06-14T04:41:27.462+0000","up_votes":1,"down_votes":0,"body":"...\n\nsu q tiene un buen rango, pero eso es todo en varus, realmente:\n\n- su e tiene un rango corto, un lenteo medio pelo y aunque haga que te cures menos, si sales del circulo ya esta. ademas, para lanzarlo tiene que quedarse quieto un rato\n- su r tambien le exige quedarse quieto, el misil no es muy rapido que digamos pero si agarra a uno, hasta que agarre a otros pasa medio siglo, ademas de que si te agarra lo unico que hace es inmovilizarte ya que no es un stun (a diferencia de lo que muchos piensen) por lo que podes seguir atacando\n- su q le exige que se lentee para poder tener mas rango y daño, cualquier hard cc lo caga, nada que un sup tank no pueda arreglar (casi que cualquier supp puede, incluso soraka quien no es conocida por tener mucha variedad de daño) y la flecha no es particularmente veloz ni inesquivable\n- su w es la base del daño, pero tampoco dura una vida, con uno o dos cc se queda sin efecto (ya sea porque se le acabo el tiempo o se le acabo el varus)\n\npor algo es tier 2 o 3...","replies":[]},{"poster":"Turing Test","date":"2017-06-14T04:39:24.928+0000","up_votes":1,"down_votes":0,"body":"Varus no está roto. Ni siquiera lo estaba hasta hace dos meses. Le nerfearon la Q y pasó a la historia. Y tiene un early asqueroso. de lo peor del juego","replies":[]}]}