{"poster":"Mèta","date":"2018-09-08T13:59:16.849+0000","title":"Anregungen","subforum":"Champions & Gameplay","up_votes":3,"down_votes":1,"body":"Hallo Community,\r\n\r\nals langj&auml;hriger League of Legend Spieler macht man sich zwischenzeitlich so seine Gedanken. \r\n&Uuml;ber die Charaktere. Das Lernverhalten/ Lernhilfe. Den Salzgehalt einzelner Spieler. &Uuml;ber das Fortbestehen des Games.\r\n\r\nMir f&auml;llt auf: Viele neue Spieler sind aufgrund der Spielbaren Charaktere &uuml;berfordert.\r\n\r\nM&ouml;gliche L&ouml;sung: Die Charakter werden nach Stufe des Spielers freigeschaltet. Schnell lernbare Charakter (z.B: Garen, Shyvana, Darius, Tristana, Lux, Brand) werden dem Neuling nah gebracht. \r\n_\r\n\r\nMir f&auml;llt auf: Dem einzelnen Spieler ist ein vern&uuml;nftiges Lernen (Charakter und dessen F&auml;higkeiten) allein nicht m&ouml;glich. Auch in Gruppen f&auml;llt es neuen Spielern oftmals schwer ihr Selbstbewusstsein zu st&auml;rken.\r\n\r\nM&ouml;gliche L&ouml;sung: Neben den bereits existierenden Pop Ups der F&auml;higkeiten, Spielern einen Hinweis zu geben z.B.: Diese Attacke bewirkt dies, sie hat eine Abklingzeit von so und so vielen Sekunden, _diese Attacke ist gut gegen adc/tank/mage_\r\n_\r\n\r\nMir f&auml;llt auf: Beleidigenden Spielern wird es durch twinks m&ouml;glich gemacht, innerhalb einer Sperrung des Hauptaccounts auf einen anderen zuzugreifen und mit diesem ihr negatives Spielverhalten weiter zu f&uuml;hren. \r\nNeue, wie auch erfahrene Spieler werden durch negative Spieler vom Spiel vertrieben, diese spielen &uuml;ber Monate oder schlicht gar nicht mehr.\r\n\r\nM&ouml;gliche L&ouml;sung: Die Ehrungsstufe am allgemeinen Verhalten der Spieler fest zu machen, ein negatives auftreten h&auml;rter zu bestrafen, z.B.: mit dem Entzug der erreichten R&auml;nge und Strafpunkte die abgearbeitet werden m&uuml;ssen_ (keine Ranks mehr m&ouml;glich bis eine gewisse Punktzahl erf&uuml;llt ist/ diese sollte sich fortw&auml;hrend erh&ouml;hen). _\r\nSperren als letzten Ausweg belassen, den Schreck einer Sperrung aber erh&ouml;hen.\r\n-\r\n\r\nMir f&auml;llt auf: Normals werden von einigen Spielern(unter Ihnen auch Rank erfahrene) oft als unwichtig angesehen. Diese sabotieren das Spiel (afk gehen / aus dem Game gehen / feeden / Beleidigen und anderes) und machen es Spielern, die keine Rank Erfahrung sammeln wollen schwieriger sich im Spiel und von Riot als angesehen zu f&uuml;hlen.\r\n\r\nMeine Bitte: Macht den Spielern bewusst, dass League nicht nur aus Rankeds besteht. Das Ihr als Team den Spielern Lust auf Euer Game macht. \r\nBaut vielleicht auch andere Spielmodi ein &quot;Kampf gegen Darius&quot;, wo sich Spieler miteinander verb&uuml;nden und Teamgeist entwickeln m&uuml;ssen, um einen intelligenten und vom Spielverhalten seiner menschlichen Gegner lernenden &quot;Feind&quot; zu besiegen.\r\n\r\nLiebe Gr&uuml;&szlig;e,\r\n\r\nEure Bemme 1","replies":[{"poster":"QubeXP","date":"2018-09-11T17:44:58.686+0000","up_votes":1,"down_votes":0,"body":"Ich spiele halbes Jahr LoL, habe Account auf Level 76 gebracht und mein Skill ist nicht so gut.\n\n> Mir fällt auf: Viele neue Spieler sind aufgrund der Spielbaren Charaktere überfordert. Mögliche Lösung: Die Charakter werden nach Stufe des Spielers freigeschaltet. Schnell lernbare Charakter (z.B: Garen, Shyvana, Darius, Tristana, Lux, Brand) werden dem Neuling nah gebracht.\n\nJede Anfänger bekommt am Anfang kostenlos Garen, Brand und Ashe. Ansonsten ich bin für diese Idee dafür. Man kann so einstellen: wenn der Anfänger die Kiste öffnet, bekommt er höherer Wahrscheinlichkeit, Champion mit Schwierigkeitsstufe 1 zu bekommen.\n\n> Mir fällt auf: Dem einzelnen Spieler ist ein vernünftiges Lernen (Charakter und dessen Fähigkeiten) allein nicht möglich. Auch in Gruppen fällt es neuen Spielern oftmals schwer ihr Selbstbewusstsein zu stärken. Mögliche Lösung: Neben den bereits existierenden Pop Ups der Fähigkeiten, Spielern einen Hinweis zu geben z.B.: Diese Attacke bewirkt dies, sie hat eine Abklingzeit von so und so vielen Sekunden, diese Attacke ist gut gegen adc/tank/mage\n\nDas Spiel läuft zu schnell um überhaupt etwas zu lesen. Abklingzeit interessiert keiner, aber die Attacken können sehr hilfreich sein. Ansonsten bekommt man Selbstbewusstsein, wenn man häufig spielt. In Aram kann man Selbstbewusstsein durch häufiges Aufprall schneller stärken.\n\nDas schwierigste ist, Mausklicks perfekt zu beherrschen und Kameraperspektive zu optimieren. Ich kann immer noch nicht die Technik \"Bewegen und angreifen\" beherrschen und kenne keine Kameraperspektive außer \"Z\". Wenn ich als Xerath das ult machen will, hindert \"Z\" die komplette Sicht. Oder in Kluft der Beschwörer - wenn ich von oben beginne, dann hindert die untere Blanke die Sicht und ich kann gegnerische Champion nicht rechtzeitig erkennen und reagieren. Erfahrende Spieler benutzen viel Shortcuts was Neunlinge nicht wissen. \n\nIch habe gerade letzte Woche herausgefunden, dass man aktivierbarer Ult meines Teams im Tab ansehen kann. Wir bekommen das nur zufällig heraus...\n\n> Mir fällt auf: Beleidigenden Spielern wird es durch twinks möglich gemacht, innerhalb einer Sperrung des Hauptaccounts auf einen anderen zuzugreifen und mit diesem ihr negatives Spielverhalten weiter zu führen.\n\nStell dir vor, wenn dieser negativer Spieler dich und das gesamte Team auch meldet. Riot kann nicht Millionen Meldungen von ganzer Welt anschauen. Der Spieler beginnt zu beleidigen, wenn er zu viel verliert oder jemand ihn grob provoziert z.B. \"du spielst schlecht\".","replies":[]},{"poster":"HHaie tabbian","date":"2018-09-08T19:02:53.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bemme 1,realm=EUW,application-id=Wj1wcocU,discussion-id=gfFt3qAE,comment-id=,timestamp=2018-09-08T13:59:16.849+0000)\n>\n>Mir fällt auf: Normals werden von einigen Spielern(unter Ihnen auch Rank erfahrene) oft als unwichtig angesehen. Diese sabotieren das Spiel (afk gehen / aus dem Game gehen / feeden / Beleidigen und anderes) und machen es Spielern, die keine Rank Erfahrung sammeln wollen schwieriger sich im Spiel und von Riot als angesehen zu fühlen.\n\nIch bin zwar vollkommen deiner Meinung, dass man in keinem Spiel \"afk gehen / aus dem Game gehen / feeden / Beleidigen und anderes\" sollte. Aber du kannst Leuten nicht vorschreiben, wie Ernst sie einen Spielmodus zu nehmen haben. Wenn ich Normals spiele, spiele ich natürlich nicht so gut wie im Ranked, weil das offensichtlich nicht dieselbe Relevanz hat. Dazu kommt dann noch, dass ich dann üblicherweise keine Champions spiele, die ich wirklich spielen kann.","replies":[{"poster":"Mèta","date":"2018-09-10T17:07:33.486+0000","up_votes":1,"down_votes":0,"body":"Mir geht es darum: Jeder Spieler gibt sein Bestes.. das schließt nicht aus, dass Du mit Deinem Team verlierst und auch nicht, welche Modi gespielt werden.\n\nStell Dir vor, das von mir beschriebene schlechte Verhalten würde in jedem deiner zweiten Ranks auftauchen (afk gehen/feeden/beleidigen etc.) - wie viel Relevanz hätte es dann.\n\nMir geht es nicht um Dein Können mit jedem deiner Champs ;)","replies":[]}]},{"poster":"Noxempire","date":"2018-09-09T07:47:39.550+0000","up_votes":1,"down_votes":0,"body":"Ich finde du widersprichst dich hier ein wenig: \n\n>(keine Ranks mehr möglich bis eine gewisse Punktzahl erfüllt ist/ diese sollte sich fortwährend erhöhen). \n>\n\nUnd\n\n>Mir fällt auf: Normals werden von einigen Spielern(unter Ihnen auch Rank erfahrene) oft als unwichtig angesehen. \n>\n\nWenn du willst, dass die Leute normals ernst nehmen, darfst du sie nicht zur Strafabarbeitung degradieren. \n\n\n>Mögliche Lösung: Die Charakter werden nach Stufe des Spielers freigeschaltet\n>\n\nFinde ich doof. Man könnte den Spielern HINWEISE geben, welche Champions man spielen KÖNNTE. Aber nicht die Champions hinter ner EXP Wall verstecken. \nWenn jemand einen Champion cool vom Design findet, sollte er ihn spielen dürfen ganz egal wie gut er ist. \n\nMal ganz davon abgesehen, dass das die ganze Free Rotation dadurch sinnlos wird. \n\n>Die Ehrungsstufe am allgemeinen Verhalten der Spieler fest zu machen\n>\n\nVerstehe ich nicht so ganz. Das gibt es doch mehr oder weniger schon. \nDein Honor Level wird doch schon auf 1 oder 0 reduziert wenn du bestraft wirst. Schaffst du es nicht über Honor Level 1 zu kommen bekommst du keine Belohnungen.","replies":[{"poster":"Mèta","date":"2018-09-10T16:49:53.033+0000","up_votes":1,"down_votes":0,"body":"Zu Punkt 1: Wo widerspreche ich mich in diesem Punkt?  Der Salzgehalt in League ist inzwischen so hoch, dass langjährige Spieler, mit denen ich z.B. seit Season 1 gespielt habe sich aus diesem Spiel verabschiedet haben. Das Verhalten einiger Spieler (diesen Fall habe ich seit season 1 mehrmals erlebt) lässt das Game uninteressant werden und dafür ist es, in all seinen Möglichkeiten zu Schade - finde ich.\n\nZu Punkt 2: Ich bin der Meinung, Spieler lernen durch fassbare Konsequenzen. Benehmen sie sich nicht, muss es diese halt geben.\nLeague existiert nicht allein der Ranks wegen. League soll einer breiten Masse Spaß machen. Einigen Spielern machen Ranks aber keinen Spaß, deshalb spielen sie normals, oder Aram - die dort aber eine ebensolche Wertschätzung verdienen, wie jene die ihren Nachmittag mit Ranks verbringen.\n\nZu Punkt 3: In League buhlen laut _https://euw.leagueoflegends.com/de_  134 Champions um unsere Aufmerksamkeit. Uns Erfahrenen ist es inzwischen möglich auszuwählen, welcher Champion zu uns passt. Wir kennen von diesen Champions die Attacken, wissen welche davon was macht usw. \nKannst Du Dich aber an den Tag erinnern, an dem Du mit League begonnen hast. Wo Du keinerlei Ahnung von Deinem Champion hattest, Du im Spiel komplett vergessen hast, wie Du welche Attacke einsetzen kannst und was sie bewirkt? Mit Sicherheit hast Du alle Tasten qualmen lassen, um genau das Wissen zu erlangen, dass Dich jetzt ausmacht.\nMöglich aber wäre doch auch eine Hilfestellung, in der Fähigkeiten etwas genauer erklärt werden und es Anfängern einfacher macht sich heimisch zu fühlen.\n\nKleiner Nachtrag zu Punkt 3 - ich finde 134 Champions können abschrecken -  dadurch kam ich auf die Freisetzung einzelner Champions der Stufe auf den Spieler angepasst.\n\nZu Punkt 4: Vielleicht habe ich mich da etwas ungenau ausgedrückt. Die Ehrungen jetzt finde ich gar nicht so schlecht, ich könnte sie mir nur noch wichtiger vorstellen, z.B.: Spieler xyz sinkt auf Stufe 1, er ist für so lange von Belohnungen ausgeschlossen - er muss aber auch 123 punkte erreichen, um entsperrt zu werden  - erst danach kann er wieder zu seinem alten Stand aufsteigen und auch dann erst erhält er wieder Belohnungen.\nDie Ehrung ist und bleibt eine Ehrung für Teamgeist usw, sie ist damit aber auch eine Bestrafung.","replies":[]}]},{"poster":"Amycos Cyrus","date":"2018-09-08T18:40:41.078+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}\n\nIch schließe mich dir in allen Punkten an","replies":[]}]}