{"poster":"Ic3F4ll","date":"2016-08-15T20:21:56.454+0000","title":"Pls nerv annie","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"{{champion:1}}  ist zu overpowert sie macht Massig schaden auf 5 leute in einen viel zu kleinen zeitfenster. Die stunns sind viel zu schnell da ich finde es sollte einen bestimmten Zeitraum geben wo die stunns sich wieder aufladen k&ouml;nnen. Da es fast unm&ouml;glich ist mit jedem champ ein 2 vs 1 zu machen finde ich das dieser champ sehr genervt werden sollte","replies":[{"poster":"LegendaryXenon","date":"2016-08-15T20:59:42.060+0000","up_votes":3,"down_votes":0,"body":"Kaum kassiert man von einem besseren, direkt nerf schreien.","replies":[]},{"poster":"OT Riku","date":"2016-08-16T01:09:58.520+0000","up_votes":2,"down_votes":0,"body":"Kommt nicht alle paar Monate ein “bitte nerf Annie“ Thread?\nAlso ich finde sie gut so.","replies":[]},{"poster":"TerrorRaven","date":"2016-08-15T20:23:16.932+0000","up_votes":2,"down_votes":1,"body":"Mir erscheint sie eher zu schwach. Beim Update hat sie einiges an Burst, für den sie bekannt war, verloren.","replies":[{"poster":"Sałtyy","date":"2016-08-15T20:35:57.472+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TerrorRaven,realm=EUW,application-id=Wj1wcocU,discussion-id=frwz5BEa,comment-id=0000,timestamp=2016-08-15T20:23:16.932+0000)\n>\n> Mir erscheint sie eher zu schwach. Beim Update hat sie einiges an Burst, für den sie bekannt war, verloren.\n\n+ dem stun kann man jetzt NOCH besser sehen, gibt doch sowieso so viele stärkere champs aber jaaa! NERV ANNIE UND am besten noch ALLE anderen Champs xD","replies":[{"poster":"PTF Elousing","date":"2016-08-15T20:56:31.522+0000","up_votes":1,"down_votes":0,"body":"Alle Champs nerven macht keinen Sinn. Also nervt alle außer Taliyah pls, die braucht dringend einen Buff.","replies":[{"poster":"Sałtyy","date":"2016-08-15T22:42:09.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=der gimli zwerg,realm=EUW,application-id=Wj1wcocU,discussion-id=frwz5BEa,comment-id=000000000000,timestamp=2016-08-15T20:56:31.522+0000)\n>\n> Alle Champs nerven macht keinen Sinn. Also nervt alle außer Taliyah pls, die braucht dringend einen Buff.\n\ndas warn joke xDD     ne ich mag tali so, obwohl ihre W änderung war unnötig :c","replies":[]}]}]}]},{"poster":"Time2Whine","date":"2016-08-16T09:36:07.557+0000","up_votes":1,"down_votes":0,"body":"Ich habe selten so über einen Forenbeitrag gelacht. Man sieht doch wann sie wieder stunnen kann !?! Das siehst du anhand der Leiste unter ihrer HP Leiste ! Berechenbarer kann ein Stun nicht sein ! {{sticker:zombie-brand-facepalm}}\nWenn man natürlich klumpt, wenn Annie Flash und Ult sowie ihren Stun hat, sollte man eher an seinem Spielwissen arbeiten anstatt nach einem Nerv zu schreien wenn man mal von ihr gestompt wird.","replies":[{"poster":"Ic3F4ll","date":"2016-08-16T11:48:06.790+0000","up_votes":1,"down_votes":1,"body":"es geht mir nicht Darum das ich die stunns nicht sehe sonder dass sie einen bestimmten Cd auf ihren stunns braucht und nicht durchgängig mit den fähigkeiten stunnen soll -.-","replies":[{"poster":"Time2Whine","date":"2016-08-16T12:30:26.076+0000","up_votes":1,"down_votes":0,"body":"Ich rechne es dir nun einmal vor.\nIhr CD auf den Stun ist der CD den sie auf ihren Spells hat. Rechnen wir mit den Standard CD's der Spells ohne Ult und Cooldown Reduction.\nQ=4 Sekunden\nW=8 Sek\nE=10 Sekunden\nNutzt sie sofort ihre Spells nachdem der CD abgelaufen ist ergibt sich folgendes:\nQ=4 Sekunden , W+Q 8 Sekunden, E=10 Sekunden, Q=12 Sekunden --> entspricht einem Stun CD von 12 Sekunden, mit der Ult 10 Sekunden !\nAnnie kann also im absoluten Optimalfall alle 12 Sekunden ihren Stun einsetzen. 12 Sekunden für ein Counterplay, Gank etc. sind mehr aus ausreichend und niemals unbalanced, zumal man ja wie gesagt sehen kann, wann sie wieder stunnen kann.\nKann sie ihren Q nicht auslösen erhöht sich der CD ihres Stuns um einiges, da sie ja nur mit ihrer W und E arbeiten kann.\nSie kann also nicht permanent stunnen !!!","replies":[]}]}]},{"poster":"OrangeBubble","date":"2016-08-16T04:40:35.457+0000","up_votes":1,"down_votes":0,"body":"\"Die stunns sind viel zu schnell da ich finde es sollte einen bestimmten Zeitraum geben wo die stunns sich wieder aufladen können. \"\n\nUhm gibt es doch und du siehst sogar, WANN ihr Stun ready ist O.o","replies":[]},{"poster":"Doo ","date":"2016-08-15T21:05:52.536+0000","up_votes":1,"down_votes":0,"body":"Solange den meisten hier von euch die champs nur nerven gehts ja noch. Wäre ja noch toller wenn ihr alle champs nerfen wollen würdet!","replies":[{"poster":"haha weed lol xd","date":"2016-08-16T00:38:03.706+0000","up_votes":1,"down_votes":0,"body":"meistens nerven die Champions nur mich es ist Zeit für Payback","replies":[]}]}]}