{"poster":"Botlane Genocide","date":"2018-04-14T03:42:49.422+0000","title":"Ban Appeal","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Hello, \r\nI was banned for intentional feeding, however the Caitlyn on my team banned my Katarina and was very racist to me. I know this was unsportsmanlike of myself and I will never do it again. Please let me off the 14 suspension as this is the first time this has ever happened, I was heated because of the toxic players and I just started an exp boost so I can get to 30. If you could let me of that would be really appreciated!\r\n\r\nIn-game Username: Process\r\n\r\nP.S, this may not be the best time to ask but im 70 rp off of a 1820 Riven skin i&#039;d really like to buy, is there anyway that can be given to the account as a bonus for previous rp purchases, would mean the world.","replies":[{"poster":"kaboomblah","date":"2018-04-14T07:10:49.275+0000","up_votes":1,"down_votes":0,"body":"Judge Judy Cracks Up When a Man Loses His Case in 26 Seconds Flat!\n\nhttps://www.youtube.com/watch?v=2Cg3cUnYjYg\n\n","replies":[]},{"poster":"LAKIGR","date":"2018-04-14T05:04:36.448+0000","up_votes":1,"down_votes":0,"body":"I don’t get why you people think that inting and when you get banned you have a right to complain. Also if someone bans your champ instead of dodging the game and taking the 5 wait time you instead int for 20 minutes and then complain for getting pushed. And before you say anything about the Caitlyn I don’t give a shit about her. She’s not the one on the boards complaining. Also she was racist to you how?","replies":[]},{"poster":"Project Xayah","date":"2018-04-14T04:57:54.632+0000","up_votes":1,"down_votes":0,"body":"The bottom line is that you're being held responsible for your own actions. You did the wrong thing and so you got punished for it, whether someone else \"initiated\" the situation is irrelevant to your behaviour (that doesn't necessarily mean the other player(s) would have got off with nothing, though). I can pretty much guarantee the ban wont be lifted even if you were to appeal through Support. That said, it's good to see that you're adamant you'll try to prevent yourself from doing the same thing in the future, and I hope you have luck with that.\n\nAs for your \"RP dilemma\", you can create a drawing (or some such artwork) and submit it to [Support](https://support.riotgames.com/hc/en-us/requests/new) requesting a small amount of RP. It's likely they will provide as much as 50RP for anything you submit, though I'm fairly certain that is as much as they are allowed to give. As a note, the work doesn't necessarily have to be good, just recognisable as a League thing.\n\nPS: In case you didn't already know, an in-game ban will not prevent you from posting on the boards. You can freely post so long as you don't have an active boards ban.","replies":[]},{"poster":"LevvyLeviticus","date":"2018-04-14T04:40:03.988+0000","up_votes":1,"down_votes":3,"body":"Hey man, as far as I know, riot probably won't lift it, as they never really care about unfair bans. About the caitlyn though, did you report her? because if she said racial slurs like the n-word or others, she would get the same as you or maybe worse. If you didn't the instant feedback system doesn't look at it. I had the same thing happen to me a few months back. Nothing much you can do about it, just hang in there!","replies":[{"poster":"Gloric","date":"2018-04-20T11:27:09.028+0000","up_votes":2,"down_votes":0,"body":"lol Riot couldn't care 2 shits about racism unless it's against the Chinese.\nSaying \"sb\" for example means \"so bad\" to many western players, but is a chinese slur which is applied as such in all regions.\n\nAlso there are players who've had the name \"[removed - no reporting other players]\" since season 4 and etc.. who have never been forced to change their name or have that name option blocked.\n[removed]\n[removed]\n\nRiot is more interested in keeping any and all instances of their game featured on twitch or youtube PG13 in chat, than punishing people who promote hate speech, intentionally troll and grief.\n\nYour ban is a rarity and a welcome sight to my eyes. I've never had a int feeding report go through, despite getting them 1 in every 5 games.","replies":[]},{"poster":"LAKIGR","date":"2018-04-14T08:15:37.773+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=LevvyLeviticus,realm=OCE,application-id=T8eq2lFQ,discussion-id=oA9ZPsvL,comment-id=0000,timestamp=2018-04-14T04:40:03.988+0000)\n>\n> Hey man, as far as I know, riot probably won&#x27;t lift it, as they never really care about unfair bans. About the caitlyn though, did you report her? because if she said racial slurs like the n-word or others, she would get the same as you or maybe worse. If you didn&#x27;t the instant feedback system doesn&#x27;t look at it. I had the same thing happen to me a few months back. Nothing much you can do about it, just hang in there!\n\nI don’t get how you can call the ban unfair. He inted he broke the rules and got punished I don’t see how that’s unfair","replies":[]}]}]}