{"poster":"n Dwindling","date":"2015-02-16T19:02:32.647+0000","title":"Main-Champion","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"Hey,\r\nIch wollte mal fragen was ihr so empfehlen könnt zu mainen.\r\nEigentlich bin ich ja am besten als Adc nur leider bekomme ich nicht immer gute Supporter und will mich endlich aus Silber 1 in Gold carrien.\r\nDa wäre dann der Jungel aber den mag ich jetzt nicht so.\r\nDann bleiben nur noch die Top und die Mid Lane übrig.\r\nIch will einen der einen rechten guten Engage hat, nicht zu schwach im Early ist und recht gut im Late game, er soll nicht zu oft gebannt/gepickt werden und nicht in näherer Zukunft Todgenerft werden.\r\nVielleicht kann mir da ja jemand weiterhelfen\r\n\r\nMfg","replies":[{"poster":"Wolkenfuß","date":"2015-02-20T23:30:35.473+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir support und jungel nahe legen. beides dinge mit denen du das spiel gut beeinflussen kannst.","replies":[]},{"poster":"BigSchnitzel","date":"2015-02-20T22:43:13.640+0000","up_votes":1,"down_votes":0,"body":"Ich find den Thread ziemlich unnötig. Spiel das was dir am meisten Spaß macht. Und einen Champ der stark ist,kaum gepickt/gebannt wird und in jedem Teil des Spiels stark ist gibt es nicht soweit ich weiß. Und das schlimmste finde ich dass für dich die Mainrolle Support nicht einmal in Frage kommt.","replies":[]},{"poster":"Black Mage","date":"2015-02-16T19:12:43.823+0000","up_votes":1,"down_votes":0,"body":"zuerst: man kann in jeder position super carrien, punkt! Da ist man als adc, top, mid, jungle, sup, was weiß ich was non meta man atm spielt, IMMER gut bedient, denn keine rolle ist minderwärtiger als andere, nur halt nicht \"sichtbarer\" (wenn ein adc \"gewinnt\", dann merkt man das \"leider\" erst im mid/late game)\n\nzweitens: Spiel den champ den du am besten kannst, ich will und werde dir keinen champ nennen, weil viele dann diese vlt nicht so gut spielen können wie einen anderen, den sie eher picken sollten!\n\nIm Moment sind jedoch folgende champions (relativ) stark:\n- Lissandra\n- Cassio\n- Graves\n- Leona\n- Janna\n- Jarvan\n- Rengar\n- Rumble\n\nAnzumerken: viele champs eignen sich nicht gut für soloque, andere jedoch... sind bombe, wie rengar und jarvan!","replies":[{"poster":"MeMyselfandBaal","date":"2015-02-17T00:17:29.287+0000","up_votes":1,"down_votes":0,"body":"ich halte gerade den Lissandra und den Cassio Tipp sehr gefährlich... \n\nLissandra über ich selber gerade in Normal Games... und kriege nur aufs Maul mit ihr. Weil man halt, damit sie funktioniert, 2 Dinge genau abschätzen muss: 1. Auf wen werfe ich meine Ulti (und wann)? Und 2. Wie weit ist genau der Radius von meinem W? Und ja, für den W gibt es im Kampf keine Anzeige, man muss wirklich wissen, wie viele Leute in diesem relativ kleinen Kreis stehen... ich setze den derzeit regelmäßig komplett ins Leere und dann ist Liss ziemlich nutzlos...\n\nDeswegen sagte ich halt: In Silber I ist es wichtiger, seinen Champ und die Grundlagen des Spiels wirklich zu beherrschen, als das zu zocken, was die LCS Profis gerade picken.","replies":[{"poster":"Black Mage","date":"2015-02-17T11:20:30.571+0000","up_votes":1,"down_votes":0,"body":"JAIN, wie schon von mir gesagt, sollte man seine besten champs spielen, ich habe nur champions aufgezählt, die, wenn gut gespielt, viel reißen können!\n\nNicht mehr nicht weniger, wenn jemand liss spielen kann, dann ist es halt \"gut\", aber wenn nicht, dann soll er die finger von weg lassen, genauso wie von anderen champs!","replies":[]}]}]},{"poster":"Dat Ding15","date":"2015-02-16T21:25:15.014+0000","up_votes":1,"down_votes":0,"body":"Übermächtig? *hust* Kata *hust*\n\nWie auch immer, ich bin zwar unrankend und schätze mich auf Silber aber ich würd' dir Folgendes empfehlen:\nBau einen Championpool auf, wenigstens 2 Champs in jeder Lane sind wichtig, so bist du auch für evtl. Nerfs geschützt.\nWards auch als ADC! Bei jedem Back schadet es echt nicht mal einen Ward oder einen Pinkie mit zunehmen.\nUnd ab lvl9 hol dir Sweeping Lense ungemein wichtig, so kann man wichtige Informationen den Gegnern zerstören!\nObjectives sichern, wichtig ist Drakes im Early und auch Baron im Late mit Wards zu sichern. Vor allem wichtige Junglerrouten, wie River warden.\nWenn möglich, versuche den gegnerischen Blue/Red zu warden.\n\nZum Abschluss: Den Focus in Teamfights immer auf die Carries legen. Ob APC oder ADC egal. Kommt darauf an, wer mehr drückt, das Wichtigste ist, diese zuerst auszuschalten.\n\nDas wars zu meiner Seite :) (Falls du alles überhaupt gelesen hast)","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-02-16T19:18:08.303+0000","up_votes":1,"down_votes":0,"body":"Selbst Support spielen und Janna und Annie Mainen. Die beiden sind gerade so was von OP (je nachdem, ob dein Team sicheren engage oder disengage braucht), dass du, wenn du sie beherrscht, locker 66% deiner Spiele gewinnen kannst.\n\nAn sonsten... sind Champs in Silber 1 noch nicht so sonderlich wichtig. Wichtig ist es, die Champs, die man spielt, wirklich zu beherrschen. Du hast mehr davon, weiter Graves, Annie und Vi zu spielen (mit denen du ja auch hervorragende Bilanzen hast) als blind irgendwelchen LCS Metas zu folgen (und auf Lissandra umzusteigen...)\n\nWichtiger ist es auf so nen paar \"Globale Sachen\" zu achten. Also 1. Warden. Und ja, jedes gut gesetzte Pink Ward hilft deinem Team ungemein. Du kannst als Team 5 davon auf der Map haben, dein Support kann aber nur eines davon setzen. Logischer Weise braucht der da deine Hilfe. \n2. Drachen sichern. Das kann der Jungler nicht allein machen. Und den kann der Support auch nicht alleine Warden... da sind wir wieder bei erstens.\n\nErnsthaft, für mich war der Unterschied zwischen Silber I und Gold V der, dass ich gelernt habe, wie man Pink Wards verwendet. Du hast dagegen anscheinend in deinem gesamten Ranked Leben noch nicht ein Pink Ward gekauft und zahlreiche Spiele, in denen du 2-6 Wards setzt, obwohl du das gelbe Trinket im Inventar hast...\n\n Versuche mehr auf solche Details zu achten, als blind angeblich übermächtigen Champs hinterherzurennen. Denn übermächtig ist im Silber Eins immer das, was du beherrscht.","replies":[]}]}