{"poster":"ugur217","date":"2019-12-01T22:08:18.965+0000","title":"Soll ich Lee mainen oder wird das der größte Fehler (Gold  :))","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"steht eigentlich alles im Titel xD","replies":[{"poster":"Crοnοs","date":"2019-12-02T09:49:21.724+0000","up_votes":2,"down_votes":0,"body":"Du hast auf 55 Games 40% Winrate...\n\nAlso wenn du einfach nur climben willst lass die Finger davon.\n\nSteht hingegen der Spass im Vordergrund und deine Elo ist dir egal, dann lets go :)","replies":[]},{"poster":"Destiny244","date":"2019-12-02T11:03:16.838+0000","up_votes":1,"down_votes":0,"body":"Hab selbst vor kurzem angefangen, {{champion:64}} regelmäßig zu spielen, allerdings vorerst nur in Normals bis ich mir sicher bin. Es macht auf jeden Fall Laune, weil man schon gute Plays machen kann mit ihm. Und weil er halt eigentlich das ganze Game hinweg nützlich sein **kann**.  Ja kann! Hängt halt oftmals echt davon ab, wie das Early Game läuft. Wenn man im Jungle schnell die Kontrolle verliert und die Lanes zu schnell gefeedet sind, kann es echt etwas schwieriger werden. Ist ja aber für andere Jungler dann genau so schwierig. \n\nAlso ich empfehle dir echt, dass du vorher in Normal Games etwas vertraut mit ihm wirst bevor du dich direkt in die Rankeds stürzt. Und ob sich Lee Sin Main dann auch zum climben lohnt, hängt halt wie gesagt davon ab, wie gut und sicher du ihn spielst. Letzten Endes ist es möglich mit Lee Sin gute Plays für sich und das Team zu holen. Man hat halt enorme Mobility Vorteile durch Q und W und kann auch hier und da mal nen Drake oder Baron snacken. Lohnt sich also auf jeden Fall, ihn zumindest ein bisschen zu können.","replies":[]},{"poster":"Phoenixale","date":"2019-12-02T10:24:39.750+0000","up_votes":1,"down_votes":0,"body":"Was ist das für eine Frage? Nicht der Champ ist ein Fail, sondern du, wenn du nicht mit ihm umgehen bzw dir das strategische Denken fehlt. {{sticker:sg-miss-fortune}}","replies":[{"poster":"00 M4ddin 00","date":"2019-12-02T12:19:14.604+0000","up_votes":1,"down_votes":2,"body":"Denken .... Strategie.... Beim Lee sin spielen \n\nHahahahahahaha \n\nDie seasons wo der skill brauchte sind schon Jahre lang vorbei ^^'","replies":[{"poster":"SicKPeaL","date":"2019-12-03T11:30:43.013+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=00 M4ddin 00,realm=EUW,application-id=Wj1wcocU,discussion-id=x7T6MxAF,comment-id=00040000,timestamp=2019-12-02T12:19:14.604+0000)\n>\n> Denken .... Strategie.... Beim Lee sin spielen \n> \n> Hahahahahahaha \n> \n> Die seasons wo der skill brauchte sind schon Jahre lang vorbei ^^'\n\nDu denkst bestimmt auch, dass Yasuo, Riven, kata, akali, etc. etc. noob champs sind oder ;)?","replies":[{"poster":"00 M4ddin 00","date":"2019-12-03T11:47:13.127+0000","up_votes":1,"down_votes":1,"body":"Gegen schlechte Spieler mit den champs zu spielen ist keine Kunst... In high elo die zu spielen ist sicher eine Leistung aber hier bei uns sind dann lächerliche champs mit schlechten Design","replies":[]}]}]}]},{"poster":"Rena","date":"2019-12-02T08:09:03.270+0000","up_votes":1,"down_votes":0,"body":"League of Legneds ist ein Spiel.\nMach das was dir Spass macht :D!","replies":[]},{"poster":"00 M4ddin 00","date":"2019-12-02T06:26:58.233+0000","up_votes":1,"down_votes":0,"body":"Lee Spieler werden genau so behandelt wie yasou Mains ...","replies":[]},{"poster":"Aymira","date":"2019-12-01T22:24:45.824+0000","up_votes":1,"down_votes":0,"body":"Mach halt? Wenn du bock drauf hast, dann lass dich nicht bremsen.\n\nOb du damit Erfolg hast, steht dann auf nem anderen Blatt und das wird dir keiner im Vorfeld sagen können. :D","replies":[]},{"poster":"SeaHorseCalamity","date":"2019-12-02T16:15:50.970+0000","up_votes":1,"down_votes":1,"body":"Wenn dir Lee Sin gefällt und spaß macht ist es kein Fehler. Wenn du Lee nur  spielen willst, weil du zu viele Insec Plays gesehen hast, dann ist es ein Fehler.","replies":[]}]}