{"poster":"DarkShade918","date":"2016-01-18T09:06:43.286+0000","title":"WTF RIOT, i get banned from entering Queue and i did nothing...","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"3 dodges consecutively, none of which were me, and then i get this stupid message saying &#039;you dodged or declined to many games, and are unable to join queue&#039; are you fucking kidding me, i didn&#039;t dodge i got dodged by 3 other players. 15 minute no queue because im getting blamed for something someone else did\r\n\r\nNOT IMPRESSED","replies":[{"poster":"Tele","date":"2016-01-18T09:19:56.484+0000","up_votes":1,"down_votes":0,"body":"Send a ticket to Riot support. I think you probably did something wrong though, you're the first person I've heard to have this problem.\n\nDid you make sure you locked in and selected a champion?","replies":[{"poster":"DarkShade918","date":"2016-01-18T09:22:56.018+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Telecasterdude,realm=OCE,application-id=Ntey9fRZ,discussion-id=Y6OX7JyE,comment-id=0000,timestamp=2016-01-18T09:19:56.484+0000)\n>\n> Send a ticket to Riot support. I think you probably did something wrong though, you're the first person I've heard to have this problem.\n> \n> Did you make sure you locked in and selected a champion\n\n1st champ select our jg dodged due to instalocker\n2nd champ select same story the instalocker did again and the other guy dodged\n3rd champ select i locked gp top, and one on the enemy team dodges\n\ni then go to try 4th time and that fucking pop up appears saying \"you dodged to many champ selects or declined to many games please wait allocated time which was 15 mins, i didn't do shit\n\ni never dodge, or decline games, never have never will\n\nAlso riot support is useless has happened before and they do nothing about it","replies":[{"poster":"Tele","date":"2016-01-18T19:54:35.205+0000","up_votes":1,"down_votes":0,"body":"I'm sure they would if you gathered evidence. The problem is people go to Riot support with crazy ass shit, like\n\n_When I click on Teemo, he explodes and hacks my PC, pls fix!_\n\nBut provide no evidence. What do you expect Riot support to do? If they already knew how to fix it, it would already be patched.","replies":[{"poster":"DarkShade918","date":"2016-01-19T00:10:49.536+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Telecasterdude,realm=OCE,application-id=Ntey9fRZ,discussion-id=Y6OX7JyE,comment-id=000000000000,timestamp=2016-01-18T19:54:35.205+0000)\n>\n> I'm sure they would if you gathered evidence. The problem is people go to Riot support with crazy ass shit, like\n> \n> _When I click on Teemo, he explodes and hacks my PC, pls fix!_\n> \n> But provide no evidence. What do you expect Riot support to do? If they already knew how to fix it, it would already be patched.\n\nNope lol, i have sent 4 maybe 5 tickets before for other issues with evidence and all they say is try reinstalling\n\nWHICH NEVER WORKS AND I STILL HAVE THE ISSUE","replies":[{"poster":"Tele","date":"2016-01-19T10:12:09.597+0000","up_votes":1,"down_votes":0,"body":"Well if you have that evidence might as well post it here. Me or someone else might be able to help. Sounds like you got one of the more useless Riot support guys, they've been a little downhill lately.","replies":[]}]}]}]}]},{"poster":"Acheron","date":"2016-01-19T08:07:00.763+0000","up_votes":1,"down_votes":0,"body":"maybe if you try not to spam them with tickets. riot can get hella busy especially with ranked coming so soon. just send the one ticket and wait. they might just be looking for a solution. how are you connection wise? it could be there is too much delay in going between you clicking the champ and the server receiving that you have selected the champ maybe? \nall i know is that it has never happened to someone i know of.","replies":[]},{"poster":"Horizonn","date":"2016-01-18T10:34:54.345+0000","up_votes":1,"down_votes":0,"body":"I've had this problem i was sitting in champ select with Jinx chosen and my friends and i get kicked saying I dodged queue\nIt was pretty dumb i must say","replies":[]}]}