{"poster":"DazzaS","date":"2017-05-31T05:59:10.622+0000","title":"I'm looking for team of OOL as sub","subforum":"Team Recruitment","up_votes":1,"down_votes":7,"body":"Hi My Name is DazzaS A.K.A Daichi.S im 18yrs old i used to start playing league since season 4 and my 1st and 2nd account was Plat 4 and Silver 1 but i sold out both acc for $500 since season 5 so i gave up on season 6 and move on playing csgo but after few month i quit playing csgo and move on playing league as new account my rank is Bronze 4 i want to road to diamond from bronze but its kind of hard to rank up so if u wanna help me to rank up so plz add me on league: DazzaS and i want to become pro players as OCE so plz add me if u have spare subs for me to join when i get up to diamond","replies":[{"poster":"Blamzite","date":"2017-06-01T13:55:26.752+0000","up_votes":1,"down_votes":0,"body":"i believe Real world trading is a ban-able offense hmm... i happen to be a bronze 5 player and i can tell u theres no elo hell just a hellish lack of elo on your end :3","replies":[]},{"poster":"Akkordian Zoeve","date":"2017-05-31T10:17:13.838+0000","up_votes":1,"down_votes":2,"body":"> \"*There's no such thing as elo hell*\"\n> \"*Bronze is easy to get out of*\"\n> \"*If you deserved a higher rank, you would be a higher rank*\"\n\nAnd yet, here we have a Platinum (potentially Diamond) player struggling to get out of Bronze...\n\n**Finally**, a high elo player understands the problem with Bronze.","replies":[{"poster":"hailikecookie","date":"2017-05-31T10:31:40.216+0000","up_votes":1,"down_votes":0,"body":"Mate, in a previous post he said his accounts were gold and silver (yet here he says they are plat and silver). A few things don't line up here. \nEither way, it seems a bit farfetched that a player that was plat/diamond ends up in bronze 5 with a 39% win rate","replies":[{"poster":"Main Line","date":"2017-06-01T10:33:03.659+0000","up_votes":1,"down_votes":0,"body":"Yeah I was kinda amused with the price that he got for selling his lowbie accounts :) Riot wanna hit the banhammer for that action, or continue to just smirk at the amusement? )","replies":[]}]},{"poster":"SilkenFawn","date":"2017-06-01T09:51:19.137+0000","up_votes":1,"down_votes":0,"body":"Your such a kid lol, their is no ello hell.... hes a shit player whos at a bronze 4 level simple.... anyone in plat+ can get an account from bronze to silver with a 90 percent winrate","replies":[]}]}]}