{"poster":"Nelkore92","date":"2015-04-22T10:30:09.542+0000","title":"Cerco qualcuno che mi aiuto a rankare a silver 2","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Sono un silver 5 ed ero silver 4, non chiedo molto ma solamente di avere un compagno decente x le ranked xk sono stufo di avere gente che si butta 1v3 solamente xk ha un assassin, io maino giungla posso fare tutto tranne adc sono negato, mi basta solo questo piccolo burst basta che mi tolgo dai silver bassi almeno non mi fanno giocare con i bronzi che non usano nemmeno le ward gratuite","replies":[{"poster":"Best Chair Euw","date":"2015-04-22T11:24:58.235+0000","up_votes":2,"down_votes":0,"body":"Silver 2? Ma chiedi direttamente il gold V, così puoi iniziare a trollare e ti sei garantito la victorious skin. \nSe il problema sono le ward da jungler comprane te qualcuna...sono main giungla come te e almeno 1 pink mia voglio che sia presente per buona parte del game, più qualche ward da 3 minuti che metto top/bot/mid a seconda di chi è più pushato e che sia evidente che possa essere gankato","replies":[{"poster":"Nelkore92","date":"2015-04-22T12:28:08.137+0000","up_votes":1,"down_votes":0,"body":"mi accontento del silver 2 xk almeno trovo solo silver in matchmaking e non bronzi, al gold voglio arrivarci da solo, e grz dei consigli anke se la pink la prendo sempre al primo recall, cerchero di prendere anke le altre","replies":[]}]},{"poster":"Dantazzo","date":"2015-04-22T10:33:11.648+0000","up_votes":2,"down_votes":0,"body":"I deserve challenger, my team in always bad, report my team...","replies":[]},{"poster":"Dr LouD","date":"2015-04-22T10:54:40.725+0000","up_votes":1,"down_votes":0,"body":"Praticamente stai chiedendo che qualcuno ti boosti, perchè da solo non sei in grado di vincere contro bronzi, solamente perchè i bronzi li hai anche te in squadra? \n\n*I deserve challenjour*","replies":[{"poster":"Nelkore92","date":"2015-04-22T11:24:46.567+0000","up_votes":1,"down_votes":0,"body":"è inutile dare vantaggio alle lane con le gank se poi iniziano a fare 1v3 da soli xk si senton OP, io dico semplicemente che vorrei avere uno che non sia cosi tonto da fare ste cazzate tanto si possono perdere lo stesso le ranked se gli altri tre sono tonti che non usano ward e ingaggiano da soli","replies":[{"poster":"Frattaglia","date":"2015-04-22T11:51:56.729+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nelkore92,realm=EUW,application-id=MJVj50Jw,discussion-id=jPxWyUOs,comment-id=00020000,timestamp=2015-04-22T11:24:46.567+0000)\n>\n> è inutile dare vantaggio alle lane con le gank se poi iniziano a fare 1v3 da soli xk si senton OP, io dico semplicemente che vorrei avere uno che non sia cosi tonto da fare ste cazzate tanto si possono perdere lo stesso le ranked se gli altri tre sono tonti che non usano ward e ingaggiano da soli\n\nSe qualcuno fa così tu limitati a scrivere \"group\" e \"fight as 5\" oppure \"fight as 4\" se qualcuno splitpusha.\n\nFidati che se ti boostassero in silver 2 poi torneresti di nuovo giù.\n\n\n","replies":[]}]}]},{"poster":"UnknownEV","date":"2015-04-22T10:31:20.382+0000","up_votes":1,"down_votes":0,"body":"Team di amici op","replies":[]}]}