{"poster":"IthilBor075","date":"2015-07-18T22:55:01.733+0000","title":"Kalista4Ever <3","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Buonasera Evocatori. Ultimamente non faccio altro che giocare con {{champion:429}} , a parer mio &egrave; il champion pi&ugrave; forte che abbia mai provato. Sin dal primo giorno in cui l&#039;ho provata (rotazione gratuita) ho fatto una pentakill :).\r\nQui sotto vi lascio il link delle mie ultime 4 partite fatte con lei:\r\n**1. **http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2207761372/219560680?tab=overview\r\n**2.**http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2207820870/219560680?tab=overview\r\n**3.**http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2207863145/219560680?tab=overview\r\n**4.**http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2207888427/219560680?tab=overview\r\nPS: Vorrei un vostro giudizio :D","replies":[{"poster":"Collassina","date":"2015-07-19T05:56:37.491+0000","up_votes":4,"down_votes":0,"body":"{{item:3085}} {{item:3153}} {{item:3006}} \nSono i primi. \nScegli tu se fare runaan o BOTKR prima, ma come secondi fatti i boots (un paio solo, nell'ultima partita ne hai fatti due, uno alacrità e questi. Assolutamente no)\nIo se contro ho un support tank mi faccio la botkr prima, altrimenti il runaan.\nAl 9/10 evolvi il trinket blu pls {{item:3363}}.\nA seguito fatti assolutamente il sussurro fatale {{item:3035}} e poi io decido in base alla partita.\nSe contro ho un Zed per esempio o anche un vladimir assolutamente fatti la scimitarra e sfruttane l'attiva al massimo {{item:3139}}.\nOppure puoi optare per una BT {{item:3072}} (consiglio) o IE {{item:3031}}.\nPer ultimo Item scegli un difensivo come un angelo custode {{item:3026}} o un velo {{item:3102}} contro i cc.\n\nNon so cosa stessi buildando nell'ultima partita... basta un item difensivo, sei l'ADC non il tank.\n\nPer quanto riguarda la velocità d'attacco, spesso vedo un inizio di Statikk {{item:3087}} o di danzatore fantasma{{item:3046}} . Io te li sconsiglio entrambi se ti fai il runaan, hai già la velocità d'attacco che ti serve. Se non vuoi farti il runaan (se il team avversario è composto da tank te lo sconsiglio) allora fatti una phantom.\n\nRicordati di usare la W e se compri il trinket blu, da buon ADC, avrai una buonissima visione della mappa, aiutando il team. Cerca di firmare un po' meglio, ma non hai problemi, anzi. \nBuona fortuna!","replies":[{"poster":"IthilBor075","date":"2015-07-19T11:00:18.383+0000","up_votes":1,"down_votes":0,"body":"Buongiorno Evocatore!\nOra ti spiego più o meno quello che è successo nell'ultima partita. Siccome il nostro Top Laner  (GoLD lDeViLYeAh) ha feedato Riven, va bhe, più o meno abbiamo feedato tutti, sono stato costretto a comprare l'armatura perché non facevo altro che morire a causa di  Kalista, Rek'Sai e Riven.\nInoltre i miei compagni non mi proteggevano un granché. Comunque ci siamo divertiti un sacco haha :D, anche se abbiamo perso.\nNeanche me ne sono accorto che ho comprato due paia di boots xD.","replies":[{"poster":"Collassina","date":"2015-07-21T03:44:25.780+0000","up_votes":1,"down_votes":0,"body":"Non importa. Tu sei l'ADC, devi fare danno. E normale ti focussino, sta a te posizionarti per benino. Cercati dei video su yt riguardo al positioning ;)","replies":[]}]}]},{"poster":"Sorcio84","date":"2015-07-19T08:40:37.651+0000","up_votes":1,"down_votes":1,"body":"si si divertiti in questa patch dove le hanno buffato i danni all'attacco base.","replies":[{"poster":"Vileblood Pyke","date":"2015-07-19T10:29:20.862+0000","up_votes":2,"down_votes":0,"body":"Non proprio.\nLe hanno alzato l'AD base, ma i suoi AA fanno il 90% dell'AD invece del normale 100%.","replies":[{"poster":"Sorcio84","date":"2015-07-19T19:42:28.544+0000","up_votes":1,"down_votes":1,"body":"si ma io la odio lo stesso D: perchè sono un pó traditore","replies":[{"poster":"Desa","date":"2015-07-21T07:14:50.533+0000","up_votes":2,"down_votes":0,"body":"striscia!{{champion:429}}","replies":[]}]}]}]},{"poster":"Ringiel","date":"2015-07-18T23:01:21.092+0000","up_votes":1,"down_votes":0,"body":"non buildarci altro AS oltre il runnan,la botrk e le scarpine ... punta invece a chiuderti dopo quei 3 item bt,lastwhisper e IE o un item difensivo;\nio solitamente mi rusho botrk e scarpine ( la botrk la trovo utilissima su di lei sopratutto nel chasare champ visto che ti dota di uno slow aggiuntivo e ti permette di stackare la E più facilmente),dopo mi chiudo ruunan,bt e lastwhisper e poi l'ultimo item lo vario a seconda del game","replies":[{"poster":"Desa","date":"2015-07-21T07:17:46.167+0000","up_votes":1,"down_votes":0,"body":"sarò forse stupido, ma io starto di bt e poi runaan e poi botrk tralasciando gli stivali. finora mi trovo benissimo con questa build e ci ho già fatto 2 penta...","replies":[{"poster":"Ringiel","date":"2015-07-21T09:28:20.783+0000","up_votes":1,"down_votes":0,"body":"kalista è un champ che scala meglio con l'as che con l'ad ... rusharsi la bt e controproducente e ti costringe a maxare per prima la Q,visto che uppare la E richiede AS sin dalle fase iniziali;\ncmq l'as da anche mobility a kalista ... non ho mai visto rusharsi la bt da nessuno in elo alto,però se te ti trovi bene così nessuno ti vieta di farlo","replies":[{"poster":"Desa","date":"2015-07-22T07:45:56.368+0000","up_votes":1,"down_votes":0,"body":"infatti nn sono di elo alto. comunque io miro al mid game per avere quel rubavita dai due dardi del runaan così da poter fronteggiare più nemici assieme e poi strappare le lance.\nperò questo lo faccio quando sono feeddato(80% dei casi, credo) altrimenti starto di botrk","replies":[]}]}]},{"poster":"IthilBor075","date":"2015-07-18T23:07:24.403+0000","up_votes":1,"down_votes":0,"body":"Grazie dei tuoi consigli Evocatore!\nNelle prossime partite vedrò di metterle in atto.","replies":[]}]},{"poster":"Ucr0niA","date":"2015-07-19T08:33:41.557+0000","up_votes":1,"down_votes":1,"body":"I consigli di Sly Thefc sono quelli giusti.\n\nHo visto le tue build e diciamo che la prima cosa che salta all'occhio è un problema di \"priorittà\" come in fin dei conti ti han fatto notare.\n\nSpecie se punti sul {{item:3085}} da chiudere come first item, sarà d'obbligo continuare a spingere sulla tua Atk speed e sul tuo potenziale di danno; quindi comprare la {{item:3153}}  e le {{item:3006}} .\n\nNon comprare le {{item:3009}} , sono un item validissimo vero, ma tu sei il damage dealer, devi pensare ad essere brutale e quel Atk speed persino sulle scarpette ti serve.\nQuanto a incantamento usa {{item:1300}}  e non {{item:1301}} , generalmente non direi questa cosa a cuor leggero, visto che sono un amante della gemma verde, ma sei Kalista ti basi sugli AA e sulla tua incredibile AS, abuserai di quella gemma sfruttandola a pieno.\n\nNon andare di {{item:3026}} , questa scelta è diventata un trend per ADC, ma l'uso che ne fanno i normal player è totalmente sbagliato; devi pensare a che champ sei e cosa fai.\nImmaginati di avere un teemo top strafeedato che a fine partita, per vincere contro l'unico nemico che riesce a fronteggiarlo si fa un item difensivo come l'omen o la banshee, diciamo che sarebbe \"comprensibile\" se ciononostante con 5 item riesce a mantenere la stessa offensività.\n\nMa che tu a metà build come adc, interrompa la tua scalata all'ad per buildarti armor è \"strano\". Tra l'altro la Guardian andrebbe buildata solo in una condizione:\nQuella in cui sai che tutto il team ti difenderà, tutto, e per tanto sarai certo di morire pochissime volte, davvero che si contano su di una mano.\n\nMa in un game normale si muore, ti focusseranno, e quindi buildarsi la GA solo per la sua passiva e averla praticamente semrpe in cooldown, nonchè sapere che probabilmente morirai da solo attorniato da nemici e sarà del tutto inutile, rende questo item insensato.\nLa guardian te la fai come ultimo item se effettivamente hai 1/2 morti e sei feedato, cioè stai chiudendo la build laddove altri stanno ancora correndo per il 3°/4° item.\n\nBuilda {{item:3031}} , per far male sul serio.\n\nA questo punto dovrai solo decidere:\nIn caso avrai contro team relativamente squishy potrai andare di questa build:\n{{item:3085}} {{item:3153}} {{item:3006}} {{item:3046}} {{item:3031}} {{item:3072}} \nPer essere davvero potentissima;\nPotresti inoltre cambiare la {{item:3072}} con la {{item:3139}}  come suggerito da Sly Thefc in caso contro tu abbia un forte Zed o altri champ che potresti counterare con l'attiva.\n\nQuanto alla {{item:3087}}  sono contrario, non ne capisco tanto l'utilità, specie su Kalista poi ti converrà sempre la {{item:3046}}  mooooolto più forte.\n\nIn caso contro avrai tank munisciti di {{item:3035}}  da sostituire all'ultimo item.\n\n----\n\nDEVI CAMBIARE RUNE E MAESTRIE.","replies":[{"poster":"IthilBor075","date":"2015-07-19T11:01:59.264+0000","up_votes":1,"down_votes":0,"body":"Buongiorno Evocatore.\nHai detto che dovrei cambiare Rune e Maestrie, qualche consiglio? Ma secondo me, meglio non sprecare i PI per altre Rune per Kalista, perché ancora non l'ho comprata :'(.","replies":[{"poster":"Ucr0niA","date":"2015-07-19T13:11:15.858+0000","up_votes":1,"down_votes":1,"body":"Guarda che la pagina di maestrie vale per tutti gli ADC, inoltre tu ne hai, ma ne hai di livello 1/2, quelli sono veramente ip sprecati.\nTra l'altro le maestrie sono gratuite.","replies":[]}]}]}]}