{"poster":"Adrian Riven","date":"2018-05-17T20:08:41.480+0000","title":"Cambien la  nueva jg  o tendre que dejar lol.","subforum":"Off-topic y temas personales","up_votes":9,"down_votes":6,"body":"2 seasons seguidas de full tank meta + adc + supp con shields + ardent sencer  y ahora se les ocurre matar la jg, \n\ndia tras dia  el juego va muriendo y me párese normal  con estos cambios  basura que hacen.\n\nesta nueva jg me quita las ganas de jugar, no difruto jugando como antes, me dan ganas de dejar el juego.\n\nparece como si quisieran acabar con su propio juego.\n\npd: better bot lane wins","replies":[{"poster":"Casel2","date":"2018-05-18T00:00:05.439+0000","up_votes":4,"down_votes":1,"body":"Muriendo? en los World del 2017 fue visto por el doble de personas que los Wolds del 2016...Esta llegando tanta gente nueva que hasta estan pensando en cambiar completamente el tutorial para hacerlo mas explicativo, por harian eso si se esta muriendo? para que invertir tiempo?\nLa jg es la linea que mas cambia en LoL, que si cambio a los dragones, barones, heraldo, que si da menos xp, mas xp, que si cambio a los asesinos, cambio a los tanques y demas...que pasa papu? ahora que la jg es mas 1v1 contra el otro jg te retiras? ahora que porfin se centraron el counterjungleo y que sea mas eficiente robar jg y dejar super atras al otro te vas?\nYo creo que si sos main jg, con todos los cambios que sufre y seguira sufriendo no deberia de molestarte sino alegrarte ya que ahora un buen jg influira mas en los objetivos y los gankeos, no como antes que gankeaba cada dos por tres solo porque no tenia otra cosa para hacer, porque menos del 40% de los jg invadia, ahora te lo podes cruzar en el rio y pelear por el escurridizo y el que muera perdera 1 o 2 campamentos, cosa crucial que dejara atras al otro y tendra que contrajunglear si o si porque sino andaria con 2 o 3 niveles abajo de los laners. Hicieron que sea mas individualista y que se note mas quien tiene mas habilidad y quien no, lo mismo en las lineas ya que con esto y todos los cambios estan haciendo que si un mid tiene un jg, botlane y top malos pueda carrearlos y viceversa, no como antes que el jg mas activo (no con mas habilidad, tan solo con estar gankeando a cada rato ya hacias tu trabajo, sea kill o no) y la mejor botlane carraba, ahora el top y el mid tambien pueden, el jg puede dejar super atras al otro y demas cosas\nRito quiere que se note mas quien es mejor que el otro y luego llevar toda esa ventaja a las demas lineas, por el tema de los afks, trolls y eso, que se pueda remar a un mal jugador, antes con tener una sola lane mala a esta, perdias la partida de seguro, ahora esta mas nivelado, obvio te deja en super desventaja pero se puede remontar\nA acostumbrarse a los cambios brother, porque estan cambiando todo, asesinos, magos, tirados, soportes y muy pronto seguro a los tanque tambien","replies":[]},{"poster":"Puynsi","date":"2018-05-17T21:01:03.390+0000","up_votes":2,"down_votes":0,"body":"El juego no se esta muriendo, si queres hacer algo, anda doble top o doble mid y listo.","replies":[{"poster":"Adrian Riven","date":"2018-05-17T22:13:51.994+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Puynsi,realm=LAS,application-id=J8qpiO2I,discussion-id=JREbk7Lh,comment-id=0001,timestamp=2018-05-17T21:01:03.390+0000)\n>\n> El juego no se esta muriendo, si queres hacer algo, anda doble top o doble mid y listo.\n\nhttps://imgur.com/a/UNKGaXS","replies":[{"poster":"RING0","date":"2018-05-17T23:40:51.036+0000","up_votes":1,"down_votes":0,"body":"eso son los resultados de google,yo creo que nunca busque league of legends en google xD","replies":[]},{"poster":"Puynsi","date":"2018-05-18T01:08:46.436+0000","up_votes":1,"down_votes":0,"body":"Comparar busquedas de google con playercount es tan irrelevante una de la otra que ni chiste tiene discutirlo. League no se esta muriendo, un monton de otros juegos online si, pero league tiene tanta gente que si 100.000 jugadores se van mañana no va a haber diferencia.","replies":[]}]}]},{"poster":"Four Shot Man","date":"2018-05-17T20:56:44.850+0000","up_votes":1,"down_votes":0,"body":"bye","replies":[]},{"poster":"Epandakiller","date":"2018-05-18T01:06:35.886+0000","up_votes":1,"down_votes":1,"body":"por si no sabes el juego cambia para poder adaptarse para bien o para mal da igual la razon del cambio , es una forma de obtener nuevas formas de jugar de manera que los jugadores consigan nuevas formas de competir por sus beneficios en este caso pelearse por la decisiva mision de quien sea el mejor jg y eso si no te gustan los cambios no deberias jugar este juego , ya que , esto es un juego y merece adaptarse a lo nuevo. Sin nada mas que decir dire... los cambios son buenos !!! {{champion:121}}","replies":[]}]}