{"poster":"Zantuscat","date":"2017-03-31T02:48:06.384+0000","title":"Shyvanna necesita un Buff","subforum":"Charlas Generales","up_votes":5,"down_votes":5,"body":"Hola, fui un main shy en la s4 y he visto su evolucion, en este momento encuentro que esta muy debajo de muuuchos jgs, teniendo un win rate del 49% y un play rate de apenas 2%, ahora les digo, el porque necesita un buff? pues esto es porque ella al momento de estar fuerte era por los items que estaban rotos, no ella en si, enumeremos:\r\n\r\n1)El devorador (el del lobito): era de los champs que mejor aprovechaba este item, pegando un golpe cuadruple solo apretando la q, que sucedio? nerf a su q y a su w\r\n2)Mazo helado con hydra titanica: lo mismo, full tank deleteaba, ambos items nerfeados y durante esto tambien se nerfeo a su w\r\n\r\nSu &quot;rework de habilidades&quot;: a mi gusto malisimo, el cambio a la pasiva para que te rente, necesitas sacar 4 drags con eso recien estas equiparando a la pasiva antigua, le bajaron escalados y los buff de habilidades que tienes con el ulti no son tan diferentes a los de antes, incluso me llega a gustar mas los antiguos xd\r\n\r\nAsi que este champ fue nerfeado en momentos donde items estuvieron fuertes, estos items fueron nerfeados o eliminados, asi que shy recibio un nerf sin querer por lo mismo, lo que la dejo muy abajo, tambien le redujeron el da&ntilde;o de la w a los mounstros de la jg ya que limpiaba muy bien y ganaba mucha experiencia en la jg, per saben que?, la experiencia de la jg tambien fue nerfeada, asi que esta pobre dragona se ha llevado comiendo nerfs dobles durante mas de una season","replies":[{"poster":"Excidiar","date":"2017-03-31T14:23:26.792+0000","up_votes":4,"down_votes":0,"body":"49% de win rate es bastante bueno, lo que pasa es que la dragona fue god tier hace poco, así que como está, está muy bien. En vez de pensar que podría estar mejor, pensá que podría estar peor ({{champion:12}} {{champion:203}} {{champion:266}} )","replies":[{"poster":"Zantuscat","date":"2017-03-31T18:33:24.731+0000","up_votes":1,"down_votes":0,"body":"Para mi un win rate del 49% para tener tan bajo play rate es malo, igual hay muchos champs que estan peor que ella, eso lo comprendo, pero se ha llevado muchos nerfs indirectos que la han empeorado un poco :c","replies":[]}]},{"poster":"RNGesus","date":"2017-03-31T09:04:35.067+0000","up_votes":2,"down_votes":0,"body":"Shyvana literalmente llego a ser un dios, (tus compañeros lv 13 , vos lv 15) , la manera en la que llego a farmear shyvana es ridicula, a shyvana le pasa lo mismo que le pasa a lucian o a muchos personajes, lo queres balancear un poco y es permapick.","replies":[{"poster":"Zantuscat","date":"2017-03-31T13:29:07.913+0000","up_votes":1,"down_votes":0,"body":"Como tu lo dices, lo llego a ser y la nerfearon, me pareció bien, pero luego nerfearon su itemitacion y ahi murio :c, ademas que la exp igual se nerfeo, la gente sabe que farmea bien pero gankea mal, y que pasa si matas sus metodos de farmeo? Pues queda bajisima :c\nAdemas olvide agregar que la jg ahora sale mas lento, asi que su tecnica de farmear toda la jg un monton de veces se vio reducida :c","replies":[]}]},{"poster":"ÅTLAS ","date":"2017-03-31T05:19:52.274+0000","up_votes":2,"down_votes":0,"body":"Shyvanna le das un buff y queda demasiado rota en esa epoca que hablas ella te hacia oneshoot de forma absurda no esta tan mal pero estamos mal acostumbrados a verla rota todo el tiempo , y ahora que esta balanceada se la ve mal , pero realmente no esta tan mal.","replies":[{"poster":"Zantuscat","date":"2017-03-31T13:31:43.490+0000","up_votes":1,"down_votes":0,"body":"Cuando la mainie no estaba rota, era con el devorador que escalaba infinito, ahora esta bajisima porque farmear la jg ya no es tan rentable como antes, da menos exp y tiempos de reaparicion mucho mas largos","replies":[]}]},{"poster":"µßþÿŚŒæÆŽýŁłøûËÐ","date":"2017-03-31T03:45:25.216+0000","up_votes":3,"down_votes":1,"body":"JAJAJAJAJAJA","replies":[{"poster":"Zantuscat","date":"2017-03-31T13:32:30.788+0000","up_votes":1,"down_votes":1,"body":"Yo deje un monton de cosas por la cual encuentro que necesita un buff, tienes alguna opinion con bases para reirte de mi publicación?","replies":[]}]},{"poster":"A Noxian Beauty","date":"2017-03-31T03:15:20.847+0000","up_votes":2,"down_votes":2,"body":"completamente deacuerdo contigo.","replies":[{"poster":"Doomenator","date":"2017-03-31T03:55:07.400+0000","up_votes":3,"down_votes":2,"body":"Lo escribiste mal, se dice \"desacuerdo\". /s","replies":[{"poster":"A Noxian Beauty","date":"2017-03-31T04:01:21.947+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Doomenator,realm=LAS,application-id=v7qsfXsE,discussion-id=xdtJHT7W,comment-id=00000000,timestamp=2017-03-31T03:55:07.400+0000)\n>\n> Lo escribiste mal, se dice &quot;desacuerdo&quot;. /s\n\nno,estoy a favor de lo que el dice,asique es deacuerdo :)","replies":[]}]}]},{"poster":"Cuchufleitor","date":"2017-03-31T21:04:59.926+0000","up_votes":1,"down_votes":0,"body":"Mira, por lo menos de oro para abajo, siemrpe que tengo ganas de romper todo, eijo a Shyvana, si pierdo en general es por que alguien en mi team hizo las cosas muy mal jaja, es demasiado violento lo que pega esa cosa!!","replies":[]},{"poster":"Sir Crucifix ","date":"2017-03-31T15:23:28.459+0000","up_votes":1,"down_votes":0,"body":"Ayer la jugué en aram y me comi los mocos porque ahí no hay dragones","replies":[{"poster":"Hnk Kenshiro","date":"2017-03-31T18:43:10.745+0000","up_votes":1,"down_votes":0,"body":"La pasiva aumenta con torres destruidas.","replies":[]}]},{"poster":"Yo la amaba wum","date":"2017-03-31T15:47:58.732+0000","up_votes":1,"down_votes":0,"body":"Bitch please\nhttp://i.imgur.com/OXf484y.jpg","replies":[{"poster":"Zantuscat","date":"2017-03-31T18:34:57.171+0000","up_votes":1,"down_votes":0,"body":"xDD, se que hay peores como esos, pero lamentablemente fueron nerfeados por cosas distintas, 7 champs de los que aparecen ahi fueron nerfeados netamente por el competitivo, no por estar rotos en solo q, sino porque los profesionales supieron abusar de ellos xd","replies":[]}]},{"poster":"Alfisto","date":"2017-03-31T06:03:20.012+0000","up_votes":1,"down_votes":2,"body":"Si, muy de acuerdo. De todas formas, esto es muy personal, Shyvana siempre me pareció un jg anti jg. Limpió siempre bien, pero la jg siempre dio una cantidad de oro relativo. En todo lo demás, siempre fue un coloso sin cc para buenos gankeos. Actualmente tenes que transformarte para tener tu unica manera de acercarte, y ya ni siquiera es coloso, sus escalados iniciales son los de un luchador. Ahora se vuelve coloso con los dragones, el objetivo mas dificil de la jg. Las tiene todas en contra","replies":[]},{"poster":"Salvor","date":"2017-03-31T04:58:48.615+0000","up_votes":1,"down_votes":2,"body":"Estoy de acuerdo.","replies":[]}]}