{"poster":"Hide on villa","date":"2016-01-02T23:54:40.789+0000","title":"Funcionamiento del server en Argentina","subforum":"Charlas Generales","up_votes":16,"down_votes":2,"body":"Gente de Riot, &iquest;se podr&iacute;a saber cuando podr&iacute;a funcionar bien el server? La verdad que cansa ir carreando una de esas partidas que llega el minuto 20 y se rinden, y que de repente, a vos y a todo tu team le agarren 300 ms, digo, porque para hacer tiendas y todas las cosas de marketing est&aacute;n siempre, pero cuando hay que garantizar la experiencia de juego que prometen, las cosas fallan, entonces preguntaba eso, si alg&uacute;n d&iacute;a va a funcionar como debe, porque cansa ir ganando y cuando perd&eacute;s por el lag, los enemigos que residen en chile y no tienen lag empiecen con su &quot;gg izi&quot; &quot;malvinas&quot; o todas esas cosas. Gracias.","replies":[{"poster":"HotGod","date":"2016-01-03T00:06:57.061+0000","up_votes":9,"down_votes":0,"body":"Ahora viene el tipico \"pedo ed un juegro gdatuitdo madagdadecidos!!!11 xdd\" \n\ntranquilos muchachos, por suerte va a venir riot a recompensar todos los daños y a darnos unas increibles ofertas del 10% en skins de campeones que no usamos!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","replies":[{"poster":"Hide on villa","date":"2016-01-03T00:46:17.279+0000","up_votes":2,"down_votes":1,"body":"JAJAJAJAJAJAJAJA tenés toda la razón, yo por ejemplo, en mi caso, el año 2015 habré unido a 15 amigos a esta comunidad, y varios de ellos gastaron bastante plata en rp, pero ojo, yo le pido 300 de rp a riot bajo ese criterio y con buena voluntad, y me tiene que responder una máquina con 20 renglones de relleno.","replies":[]}]},{"poster":"o Trafalgar o","date":"2016-01-03T00:03:57.350+0000","up_votes":8,"down_votes":0,"body":"Estos se fueron de vacaciones seguro... asi q vamos a tener que esperar. Esperemos que no nos cobren RP para arreglar el server.","replies":[{"poster":"Hide on villa","date":"2016-01-03T00:47:19.015+0000","up_votes":1,"down_votes":0,"body":"Como dijo uno más arriba \"tranquilos muchachos, por suerte va a venir riot a recompensar todos los daños y a darnos unas increibles ofertas del 10% en skins de campeones que no usamos!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"","replies":[]}]},{"poster":"CROWDINGER","date":"2016-01-03T00:02:50.906+0000","up_votes":7,"down_votes":1,"body":"gg riot chile games","replies":[]},{"poster":"Pablincho","date":"2016-01-03T00:07:37.904+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"Hide on villa","date":"2016-01-03T00:41:33.714+0000","up_votes":1,"down_votes":0,"body":"Nunca lo había pensado así, tendrían que poner el servidor en algún país que esté más estable en todo sentido.","replies":[]}]},{"poster":"SrAmílcar","date":"2016-01-02T23:59:46.376+0000","up_votes":6,"down_votes":1,"body":"{{sticker:zombie-brand-clap}} welcome to las donde el unico beneficiado es chile","replies":[{"poster":"Hide on villa","date":"2016-01-03T00:42:12.801+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJA","replies":[]}]},{"poster":"SKULLTheProdigy","date":"2016-01-03T00:09:37.802+0000","up_votes":4,"down_votes":0,"body":"Acabo de perder una partida ... se cayo el team momentáneamente y estábamos jugando con 400 o 300 de ms cada uno y claro.... el otro team era de chile y que paso se preguntaran.. decían que era una excusa decir que teníamos lag.. y ayer fue igual y lo de Malvinas también lo dicen.. Generalmente no molesta pro aveces cuando lo espamean ya molesta,sabiendo que perdí una cuenta por putear a ese tipo de sujeto que ya es una cantidad excesiva.\n{{champion:20}} {{champion:20}} {{champion:20}} {{champion:20}} {{champion:20}} \n {{summoner:32}}  {{summoner:32}}   {{champion:53}}    {{summoner:32}}   {{summoner:32}} \n{{champion:20}} {{champion:20}} {{champion:20}} {{champion:20}} {{champion:20}} ","replies":[{"poster":"Hide on villa","date":"2016-01-03T00:44:28.528+0000","up_votes":3,"down_votes":2,"body":"Yo perdí mis recompensas por gente como ellos, y sí, me pasó lo de la partida hace un rato, iba con Lee Sin 11/0 (y todo mi team iba bien, era surrender al 20) y nada, teniamos lag, se extendió hasta el minuto 43 y terminamos perdiendo, y empezaron con \"vuelvanse a NA\" \"las malvinas son de ing\" (???????) y yo no digo nada, me la tengo que bancar, y ellos que si flammean, siguen tranquilos, pero ojo, actuo en represalia y me quedo sin recompensas. Pacticamente por estas cosas dejé de comprar rp.","replies":[{"poster":"MatiasZERO","date":"2016-01-03T00:47:19.848+0000","up_votes":5,"down_votes":1,"body":"Perdiste las recompensas porque no sabes comportarte, no por otras personas.-","replies":[{"poster":"The Neotox","date":"2016-01-03T05:26:47.204+0000","up_votes":2,"down_votes":0,"body":"Sin ofender, pero te invito a que siendo vos un jugador que nunca ha insutado a nadie, y que un dia pierdas la paciencia e insultes a alguien que viene haciendolo desde el principio de la partida. No se puede decir \"No sabes comportarte\" porque el ser humano jamas va a estar de acuerdo con todas las actitudes. Tengo amigos que trollean en mi cara, insultan, flamean, y seguro los que estan del otro lado de sus pantallas se sienten mal, y responden a esa actitud. Y ellos terminan baneados, porque? Porque los inutiles que insultaron complotaron para reportarlo entre 4. Simplemente, uno no puede esperar nada bueno de esta comunidad, menos si hay gente de mas de un pais conviviendo. Gracias por leer{{item:1052}}","replies":[]}]}]},{"poster":"Kurast","date":"2016-03-05T07:03:45.386+0000","up_votes":1,"down_votes":0,"body":"Te volvieron a banear AMIGO ?","replies":[]}]},{"poster":"Me Perdi URF","date":"2016-01-03T01:28:50.748+0000","up_votes":3,"down_votes":4,"body":"La misma respuesta..  PARA QUE JUEGAN SI HAY LAG!! ENTIENDANLO.. (sin ofender..) {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Gen","date":"2016-01-03T04:05:24.895+0000","up_votes":4,"down_votes":1,"body":"lo mismo a la inversa seria por que no cierran el server hasta que lo reparen bien. Por que lo dejan abierto si no anda. en fin ni ellos cierran ni nosotros dejamos de jugar por que esta.","replies":[{"poster":"Tutancadead","date":"2016-01-03T18:35:52.486+0000","up_votes":1,"down_votes":0,"body":"¿Tu jueves para Ganar plata o para divertirte?\n\nEl servar esta para ganar plata o pensabas que Riot va por ahí regalando tiempo de Internet.","replies":[{"poster":"Gen","date":"2016-01-03T19:23:58.996+0000","up_votes":1,"down_votes":0,"body":"no los juzgo es un trabajo y ahí esta solo lo pongo de referencia al comentario del señor mas arriba que tiene la santa paciencia de esperar para jugar en forma. yo ya estoy jugando con normalidad desde ayer. asi que no pasa nada lo peor ya paso creo.","replies":[]}]},{"poster":"Hide on villa","date":"2016-01-03T17:14:48.156+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dark Gen,realm=LAS,application-id=v7qsfXsE,discussion-id=NHLFz8G5,comment-id=00080000,timestamp=2016-01-03T04:05:24.895+0000)\n>\n> lo mismo a la inversa seria por que no cierran el server hasta que lo reparen bien. Por que lo dejan abierto si no anda. en fin ni ellos cierran ni nosotros dejamos de jugar por que esta.\n\nexacto","replies":[]}]},{"poster":"Hide on villa","date":"2016-01-03T17:15:19.979+0000","up_votes":1,"down_votes":0,"body":"Siempre me meto a custom a probar que no haya lag, anda bien, voy a partida, y ahí se cae","replies":[]}]},{"poster":"FacuRiroM","date":"2016-01-03T07:09:28.063+0000","up_votes":2,"down_votes":0,"body":"Tiene razon, anda muy mal el server aca en argentina y a los chilenos que no paran de insultar jaja las personas mas irritantes y mal habladas del{{champion:36}}","replies":[]},{"poster":"MrFriki","date":"2016-01-03T20:40:16.256+0000","up_votes":1,"down_votes":0,"body":"Me pasaba lo mismo con el tema del lag, pero me cambie de compañía y pedí más megas, a veces es el servicio que te brindan, actualmente no paso de los 60 ms, y solo pedi 5 megas :´v\npero en general es la compañía que te brinda el servicio de internet contratado.\n\nSaludos {{item:3460}} {{champion:119}} {{champion:53}} {{champion:64}} {{champion:24}} {{champion:112}} {{item:3460}}","replies":[{"poster":"Hide on villa","date":"2016-01-09T07:56:06.157+0000","up_votes":1,"down_votes":0,"body":"Sí, mi ISP (Internet Service Provideer) también es otro tema que tengo que arreglar, \"\"tengo 12 megas\"\" y anda como el culo, pero la falla del servidor es evidente, a todo el mundo le pasa.","replies":[{"poster":"MrFriki","date":"2016-01-09T09:51:37.995+0000","up_votes":1,"down_votes":0,"body":"Sep, trata de fijarte que ISP usa la compañia contratada, ya que con tectel y otras anda para el tuje. \nigual ahora mucho lag no hay.","replies":[]}]}]},{"poster":"sAnn","date":"2016-01-03T23:05:34.522+0000","up_votes":1,"down_votes":0,"body":"No se puede, simplemente no se puede jugar a este juego. MESES","replies":[]},{"poster":"g e n k z Z ","date":"2016-01-03T00:28:26.892+0000","up_votes":1,"down_votes":0,"body":"solo aca es el problema porq que hay juegos con servidor en otro continente y anda mejor que esto que tenemos al lado media pila","replies":[]},{"poster":"Pablincho","date":"2016-01-03T00:21:10.569+0000","up_votes":1,"down_votes":0,"body":"dejen de borrar post y contesten las quejas que si bien tienen un  tenor agresivo debido a la incomodidad que le provocan a los usuarios merecen ser contestados y no borrados sin respuesta que FALTA DE RESPETO","replies":[]}]}