{"poster":"Akbar","date":"2015-05-08T12:35:01.494+0000","title":"¿Existe el mito de la mala racha?","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"La realidad es que no creo mucho en esto realmente, pero dudo por el simple motivo de que o me va muy bien o me va muy mal, y eso de hacerse una auto critica esta perfecto, lo hago todo el tiempo y no culpo a nadie de mis errores, ahora... ganar muchas partidas seguidas, me tocan buenos equipos, estoy a la altura y luego de la nada, como que la suerte del juego te dice &quot;no, no podes ir tan bien, es hora de cambiar tu suerte&quot; y me toca con gente que pareciera que no tiene idea de lo que hace y empieza una mala racha que parece no terminar, una derrota tras otra, por mas que de todo mi esfuerzo en ayudar, dar apoyo, ser comprensivo y no hay caso, hasta momentos que voy ganando y de repente pierdo de la nada, como por arte de magia, es increible, me cuesta creer realmente, encima en medio de eso gente que flamea, una porqueria, son insoportables pero de eso no voy hablar porque es perder el tiempo ya que o te acostumbras porque no se hace nada o desinstalas el juego, cosa que lo pienso a veces, queria aclarar esa inmensa duda porque capaz es asi, vas muy bien y entonces algo hace que te emparejen con otro tipo de gente y viene la racha mala o simplemente es impresion mia.\r\n\r\nGracias a los que leyeron y espero resolver mis dudas.","replies":[{"poster":"HyenaLoL","date":"2015-05-08T15:09:26.455+0000","up_votes":5,"down_votes":0,"body":"la derrota influye emocionalmente, y te lleva a perder la siguiente y la siguiente, luego tu mmr baja , tu equipo no actua como supones que actuaria porque carece de las cualidades que tenian tus antiguos emparejamientos. Una vez te adaptas volves a subir, sube el mmr, te motivas y asi\nSon como ciclos de juego, incluyendo tu mejora de skill si es que hay, lo que te hace subir\ny si tu velocidad de adaptacion a el modo de juego de tu mmr influye en hasta donde bajas","replies":[]},{"poster":"Sirek","date":"2015-05-08T14:05:12.151+0000","up_votes":5,"down_votes":0,"body":"Yo creo que si, hay buenas y malas rachas, aunque yo creo que depende de un 70% de ti mismo (Estados de animo, condición de salud, cansancio, etc) y 20% que equipo enemigo te toque (mejor, peor o del mismo nivel que tu) y un 10% cirscuntancial (Que baneen al champ que mejor usas, que se le corte el internet a uno de tu team, que justo paso algo que te da lag, etc.).\n\nEsa es mi opinión.\n\n\nPiensa que los mejores del mundo tienen un win rate de 60% aprox,( O sea que de cada 100 partidas, pierden 40 de ellas), asi que no te sientas tan mal si pierdes mucho a veces xD\n\nY si te flamean, hay un comando que es /all mute y asi te concentras en ganar la partida en vez de ganar la discusión.","replies":[]},{"poster":"Bronze 5 Irelia","date":"2015-05-08T19:45:48.185+0000","up_votes":2,"down_votes":0,"body":"Hola vengo aquí para decirles lo siguiente , LA MALA RACHA EXISTE , y es el paso previo a un cambio radical en tu manera de jugar , me paso en ORO , me paso en PLATINO y gracias a dios me esta pasando en DIAMANTE (mi Main) , esta mal expresado el nombre pero si , es una serie de derrotas en la cual no vas a poder hacer absolutamente nada , solo perder con lo que seas que elijas y elijan los adversarios , porque es así te preguntaras ? la respuesta es sencilla , llega un punta en cada liga que tu elo es por ejemplo digamos ORO 3 , ganaste varias , tenes buen rank , tenes buenas victorias por ende te empareja obviamente con ORO 1 ... gente que juega mejor que vos al juego o lo entiende mejor , lo único que van a  lograr esas partidas si sos una persona inteligente , es a hacer un improve en tus mecánicas y en tu manera de jugar , y así después de un tiempo , obviamente metiendole ganas y que no decaiga la moral , le vas a encontrar la vuelta y tu entendimiento y tus mecánicas van a ser de un elo mas alto , lo siguiente es inevitablemente que subas de liga hasta que vuelvas a encontrar tu tope de habilidad , un saludo","replies":[{"poster":"HyenaLoL","date":"2015-05-09T01:34:42.311+0000","up_votes":2,"down_votes":0,"body":"eso es muy arbitrario xD\nhay malas rachas que son simples malas rachas y nada mas","replies":[]}]},{"poster":"Nyán","date":"2015-05-08T19:43:15.029+0000","up_votes":2,"down_votes":0,"body":"La mala racha no es por tu equipo, ni por el emparejamiento, ni por Rito, ni por que tu hermano se comió tu libro, es porque somos humanos.\n\nPerder una partida te afecta emocionalmente y te estresas un poco más cada vez hasta que no puedes ganar ninguna partida porque el estrés no te deja dar lo mejor de tí mismo. Empiezas a culpar a otras cosas en lugar de fijarte bien en lo que tú haces y a veces son pequeños errores, pero hay errores que cuestan partidas.\n\nHay algunas maneras de salir de una mala racha o racha de derrotas. Una de ellas que yo uso es estar un día sin jugar al LoL para quitarmelo de la cabeza y así poder volver con la mente clara y dar lo mejor. \nOtra que yo a veces uso es ir a ARAM y jugar para divertirme, no para ganar y muchas veces funciona. Porque lo que yo me digo al jugar un ARAM es que es muy fácil que las cosas vayan bien para un equipo.\nJugar con amigos que te carreen la primera partida para salir de la racha es una buena opción. Obviamente, debe ser en una partida normal porque: **¿¡Qué haces en ranked con una mala racha?!**\n\n*Esta es mi opinión sobre el tema, si no estás de acuerdo conmigo, pido que no te pongas a discutir porque no hay opiniones correctas o incorrectas. Gracias por leer.*","replies":[]},{"poster":"TORRESjr","date":"2015-05-08T14:00:58.165+0000","up_votes":2,"down_votes":1,"body":"Yo prefiero al flammer que al manco. las malas rachas existen. Si cuando perdes jugas bien, te rescatas y no moris innecesariamente y tu team muere 10,11,12 veces ahi estas en la mala racha","replies":[]},{"poster":"A tu casa feo","date":"2015-05-13T15:05:45.484+0000","up_votes":1,"down_votes":0,"body":"Simplemente la programación del juego hace que tus victorias y derrotas sean prácticamente iguales, y te puedo dar pruebas:\n1- Revisa tus victorias y derrotas. 50%-50% ? xD o casi\n2- Pregúntale a tus amigos cuantas derrotas y victorias tienen. La repuesta te puede asombrar.\nSaludos.","replies":[]},{"poster":"Darwin","date":"2015-05-09T20:16:05.226+0000","up_votes":1,"down_votes":0,"body":"hubo una época de mi vida que perdí la promo a bronce 2, 12 veces seguidas.... mas allá de la calentura que tenia (enojo), desinstale el juego y por un mes no jugué. Cuando volví, todo me iba mejor, al punto que hoy estoy casi en promo para oro 3. \n\nlas malas rachas si existen, y a veces dejar el juego lado y hacer otras cosas sirven para refrescar la cabeza y recuperar algo del optimismo que las malas rachas te absorben.\n\nsaludos y aguante {{champion:34}}","replies":[]},{"poster":"Fallout","date":"2015-05-09T04:24:03.221+0000","up_votes":1,"down_votes":0,"body":"La mala racha no es un mito, sino algo psicológco. Se dice que una persona recuerda momentos negativos con mas frecuencia que momentos positivos. En el caso de League, recordar 1 partda buena equivale a recordar 4 partidas malas, esto significa que al tener una mala partida ya sea por estar desconcentrado, niños rata, lag o lo que sea tendrá mas repercusión que tener una partida excelente. \n\nEn resumen, la mala racha es un aspecto emocional y físico al mismo tiempo, cuando juegas mal tu cerebro se cansa mucho más, porque a un nivel subconsciente dejas de pensar de forma lógica y tomas decisiónes incorrectas, tu concenctración comienza a bajar y tu tiempo de reacción también así como tu percepción (Mirar el mapa, estar atento a ganks, etc). \n\nTodo eso y mucho mas son los factores que forman la mala racha, la única forma de \"curar\" una mala racha es dejar el juego por un tiempo, ir a tomar aire, darse una ducha, \"Matar la gallina\" (1313), ver la tele o jugar otra cosa mas tranquila.\n\nProtip: Cuando estén jugando, siempre beban líquidos [Agua de preferencia o Jugo sin azucar en su defecto]. El consumo de líquidos ayuda a que tu cerebro se mantenga hidratado y puedas tener una mejor concentración. \n\nFuente: Un jugador en una mala racha de esas pero HORRIBLES.","replies":[]},{"poster":"Yrox the Third","date":"2015-05-08T19:42:18.813+0000","up_votes":1,"down_votes":0,"body":"La mala racha es simplemente perder seguido, como la buena racha es ganar seguido.","replies":[]},{"poster":"TetraPodMelonTea","date":"2015-05-08T19:15:59.036+0000","up_votes":1,"down_votes":0,"body":"man,si existen las malas rachas...te cuento la mia : cuando estaba en oro 1 tuve mala racha de 20 perdidas seguidas la season pasada..estaba como 15 partidas abajo..tuve q dejar de jugar 1 semana y cuando volvi se habia normalizado la cosa.ahora estoy platino 1 asi q no creo q haya sido q no tenia manos en ese momento = )\n\nPD: despues de esa semana subi a platino 4 desde oro 4 q me habia dejado la mala racha.","replies":[]},{"poster":"ManuJG","date":"2015-05-08T18:58:31.990+0000","up_votes":1,"down_votes":0,"body":"Las malas (tanto como las buenas) no son un mito ni un karma, son un hecho. Una gran cantidad de partidas perdidas (o ganadas) seguidas se considera como racha. Y toda racha se puede cortar en la próxima partida que juegues. Mientras más se prolongue la racha, más te afecta a vos en lo personal, pero las probabilidades de ganar o perder siguen siendo las mismas. Por eso mismo, es un hecho.","replies":[]},{"poster":"Litoman15","date":"2015-05-08T18:53:51.323+0000","up_votes":1,"down_votes":0,"body":"Yo creo que si existe, ahora estoy dentro de la mala racha, tuve un fin de semana de puras victorias con buen score y cosas así, ahora empiezo una partida gano mi linea y la pierdo porque o el mid enemigo esta feed o porque el adc enemigo esta feed, ahora estaba en una partida recién, tenia una Kalista que al minuto 24 tenia 31 de farm, estuvo flameando todo el rato sin sentido, y yo ganando la linea contra un trynda, me ha estado pasado toda la semana, no se si sera porque les molesta que uno tenga solo victorias :/, aparece solo gente que no sabe farmear ni pushear, solo persiguen la kill...","replies":[]},{"poster":"potato support","date":"2015-05-08T17:34:54.619+0000","up_votes":1,"down_votes":0,"body":"yo venia con un 70% de win rate, despues me toca gente que literalmente no sabe que carajo esta haciendo, y termino con un win rate de 48% en 10 partidos.\n\nwarwicks elo de oro que van 0/30/0 en maestrias, rushean devorador y bork. gente que juega bard, rushea IBG, recien compra ss y mobis al minuto 25, otro warwick que termina 0/16/14 con spirit visage, bilgewater cutlass, stalkers, y t1 boots.\n\ndespues estan los que se van afk porque perdieron linea y no saben ni como farmear, los que se quedan en base parados para que no les agarre el leaverbuster.","replies":[]},{"poster":"Dildo de Moria","date":"2015-05-08T17:27:38.605+0000","up_votes":1,"down_votes":0,"body":"Me pasó exactamente lo mismo, resulta que solía jugar mucho con mi main {{champion:131}} y te aseguro que toda partida que jugaba con ella la ganaba y terminaba con scores fantasticos 8+/2 me sorprendia hasta ami mismo, pero llegó el dia en que perdí una partida y no le dí mucha importancia, pero desde ahi toda partida que jugara con Diana, la perdía, no culpaba a mi team obvio, pero era como que de la cima descendi al pie de la montaña en tan solo 1 semana, ademas que terminaba con scores que yo mismo lloraba, ahora recien que jugué dos partidas con ella estoy como rompiendo esa mala racha, pero mi primera partida actual ganada con ella termine 11/10 ya que nuestro supp se fue afk reitreradas veces en medio de las tf y bue fedeó un poquito y en la segunda que fue hace tan solo unas horas, terminé 4/3, la verdad que siguen sin parecerme scores buenos, pero haber si vuelvo a los tiempos de gloria como me gusta llamarlo.","replies":[]},{"poster":"Murder Dealer","date":"2015-05-08T13:42:45.135+0000","up_votes":1,"down_votes":0,"body":"acá es cuando entra en discucion  el famoso elo hell, y si existe mas que todo en la liga oro, silver, platino de III a V. Cuando acumulas mas de 3 perdidas te empieza a emparejar con gente que viene igual de mal, y no todos se comportan bien por algo pierden no?.","replies":[{"poster":"íMonsterQ8","date":"2015-05-08T16:29:11.959+0000","up_votes":1,"down_votes":0,"body":"1.1- \"Elo Hell\" (entender que el sistema SI funciona)\n“yo soy bueno, pero en mi equipo siempre me toca gente mala y por eso pierdo”\n \n“siempre a mí \n \nme tocan trolls y afks”\n \n“la unica forma de ganar es teniendo suerte”\n Si quieres subir de liga debes entender una cosa:\nel sistema SI funciona. NO hay jug\nadores de bronce 5 que llegaron a challenger por “suerte” y NO hay  jugadores de challenger que no puedan salir de bronce V por “mala suerte”.\n EL SISTEMA SIEMPRE TE PONE DONDE TE MERECES ESTAR. ASI DE SIMPLE","replies":[]}]},{"poster":"Runth","date":"2015-05-08T15:25:53.829+0000","up_votes":1,"down_votes":0,"body":"Depende de nivel tuyo y de tu equipo\n\nExiste pero no tanto, por eso las rankeds nunca debes jugarlos mucho","replies":[]},{"poster":"trommi","date":"2015-05-08T15:22:54.248+0000","up_votes":1,"down_votes":0,"body":"Es todo cuestion de probabilidades tanto si jugas bien o mal siempre en alguna partida te van a tocar determinado team y hay entran las variables las variables pueden ser troll afk manco el otro team es mejor falta de comunicacion etc por eso no es mala racha sino variables si ganas muchas partidas seguidas lo aconsejable es para un poco jugar un par de normales para descartar variables es muy raro q te toquen afk trolls 2 partidas seguidas gracias por el espacio","replies":[]},{"poster":"nifu","date":"2015-05-08T15:12:50.831+0000","up_votes":1,"down_votes":0,"body":"tengo victorias positivas en ranked pero igual el sistema mientras mas ganas te pone con gente \"inferior a uno\" y contrario mas dificiles. cuando gano 4 seguidas yo ya se que tengo que estar en linias importantes y determinantes y tratar de ayudar a mi equipo en todo de no lograr esto que es dificil o por lo menos a mi me cuesta mucho carrear empiezo una racha mala. me molesta que siempre en la racha llego a promo y pierdo la promo en racha mala o subo de liga pero con elo alto y se hace dificil mantenerse. en lo personal ya subi a plata 2 5 veses y baje 4 hasta que logre un equilibrio de ganar perder una y una. ahi es cuando tenes que parar la pelota y ver que mejorar.","replies":[]},{"poster":"Funes7","date":"2015-05-08T14:51:32.895+0000","up_votes":1,"down_votes":0,"body":"Yo creo.\n\nA veces entro y juego 1 y aplasto, pero aplasto, me salen todas. Y con campeones uqe podes lucirte con jugadas locas como zigss.. me siento re pro. Termino de ganar me meto en otra y sigo.....\n\nHasta que dejo de jugar por \"x\" motivo. Y cuando vuelvo a jugar, ya sea con 2,3  horas o un dia de diferencia. \"se me fue la magia\".\n\nLo peor es cuando no te sale ni una que jugas otra y tu impotencia hace que tambien veas los errores en los demas.\n\nPorque vamos, que si vas ganando y en el equipo hay 1 o 2 mancos pero son callados, somos todos felices.\nAhora si vas perdiendo y jugando mal, ahi salen todos los fantasmas.\n\n\nLo mejor es jugar cuando estas en racha el tema es que siempre por h o por v termino teniendo que hacer otra cosa.","replies":[]},{"poster":"RNGesus","date":"2015-05-08T14:29:15.155+0000","up_votes":1,"down_votes":0,"body":"La racha de derrotas se debe a que si perdes y perdes te emparejan con gente que mal , y por consiguiente vas a seguir perdiendo , a no ser que la gente que te toque es gente buena pero que pierde por X razon , ahi capas cortas la racha","replies":[]},{"poster":"FullWarLoL","date":"2015-05-08T14:14:53.518+0000","up_votes":1,"down_votes":0,"body":"aca el tema es el elo hell... si tenes un promedio de mas derrotas que ganadas... te vana  emparejar con gente mas manka y a veces con menos experiencia por el ELO....\n\nte doy un ejemplo yo tengo como 200 ganadas en ranked... y como 205 perdidas tengo elo negativo... elo HELL...\n\nentonces me emparejan con niños que tienen 20 victorias... y 24 perdidas o un promedio parecido...\n\nentonces mi team esta lleno de gente nueva en ranked que ni runas tiene a veces....\n\ny comot e imaginaras... o careas tu... o no lo hace nadie...\n\nnota... las rachas son en realidad por sistema... si pierdes una no jueuges mas espea a otro dia... o un par de horas... y nunca entres enseguida a una partida si tu team era MALO...\n\nporque es muy probable que te toque con alguno de ellos :(\n\n\neso es todo exitos en tu paseo por el lol :D","replies":[]},{"poster":"Chimichanga Boy","date":"2015-05-08T15:42:38.364+0000","up_votes":1,"down_votes":1,"body":"TE ASEGURO QUE SI EXISTE ;_; .A mi me paso varias veces que vengo todo un historial de victorias y al rato cambia todo a derrotas por afk, flamers y trolls","replies":[]},{"poster":"Rurouni Batosai","date":"2015-05-08T13:51:24.341+0000","up_votes":1,"down_votes":3,"body":"Mala racha de q te toke un flamer afk o troll jajajaja o manco\n..\nmala racha= afk troll flaer manco","replies":[]},{"poster":"xClaudio Fnatic","date":"2015-05-08T13:44:20.383+0000","up_votes":2,"down_votes":6,"body":"creer en una mala racha es como creer que la suerte existe...\n4 mil millones de años de evolución y la gente aun cree en la suerte o en dios {{champion:119}}","replies":[]}]}