{"poster":"Daguero","date":"2017-04-16T20:26:59.140+0000","title":"Cola de baja prioridad injusta.","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":1,"body":"El d&iacute;a de ayer me encontraba jugando una partida con mis amigos, yo iba Jungla con Lee Sin y me estaba robando el red del enemigo al minuto 2:30.De pronto, se me apago el PC y lo tuve que volver a prender, cuando prendi&oacute;, abr&iacute; el LoL y me reconecte a la partida.La partida ya iba en el minuto 9.Estuve 7 minutos AFK y mis compa&ntilde;eros me entendieron porque eran mis amigos y les dije que iba a tardar un momento en reconectarme. Cuando volv&iacute; a la partida era LVL 2 mientras que los otros eran LVL 8, jugu&eacute; como siempre y parec&iacute;a que nunca me hab&iacute;a ido AFK, por desgracia perdimos la partida, y al salir me encuentro que me hab&iacute;an puesto una sanci&oacute;n de 20 minutos.\r\n Ya me canse de esto, ya no se que hace, espero la respuesta de un rioter.Espero que alguien vea este post y se fije en la ultima partida que jugue, ya que con el nuevo launcher se pueden descargar partidas.\r\n     Saludos. {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Yudel","date":"2017-04-16T20:39:06.478+0000","up_votes":1,"down_votes":0,"body":"Seguramente los enemigos te reportaron por ser justos con el team contrario o algún amigo tuyo te traiciono.\nEs cierto que uno no puede predecir problemas técnicos con su computadora, por que hasta la que funciona mejor si le viene un corte de luz dejara de funcionar.\nAhora lo que me extraña es que te sancionaran por que te haya pasado en una partida, tenia entendido que la sanción venia si te pasaba mas de una vez","replies":[{"poster":"Daguero","date":"2017-04-21T01:39:51.251+0000","up_votes":1,"down_votes":0,"body":"No es la primera vez que me pasa esto.","replies":[{"poster":"Yudel","date":"2017-04-21T18:40:15.572+0000","up_votes":1,"down_votes":0,"body":"bueno, por esa misma razón la sanción xd","replies":[]}]}]},{"poster":"Handel14","date":"2017-04-16T21:09:57.053+0000","up_votes":1,"down_votes":0,"body":"el punto es que estuviste afk y perdieron, el sistema no detecta si te levantaste o no","replies":[]}]}