{"poster":"Megattero","date":"2016-07-28T19:16:02.986+0000","title":"Skin del lume scomparsa (?)","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Questo Natale ho acquistato una skin del lume misteriosa (un po&#039; come le mystery boxes per le skin, solo che a Natale le hanno messe anche per le skin dei lumi) al prezzo di, mi pare, 380 RP. Fin qui tutto bene. Il problema &egrave; che da ieri non riesco pi&ugrave; a visualizzarla nella schermata di selezione dei campioni. Quando &egrave; successo per la prima volta mi sono detto &quot;mass&igrave; si sar&agrave; buggato, al prossimo game torna tutto a posto&quot;. Oggi faccio un&#039;altra partita e il lume non c&#039;&egrave; ancora. Allora provo a cercare su internet e vedo che la maggiorparte delle volte che qualcosa scompare (una skin, un champ...) &egrave; perch&eacute; &egrave; stato acquistato con RP &quot;non ufficiali&quot;, cio&egrave; non comprati dal client di LOL. Io non ho mai preso RP da questi siti, quindi la domanda sorge spontanea: qualcun altro ha il mio stesso problema? Potrebbe essere causato dalla mystery box (chiedo questo perch&eacute; ho altre 2 skin per il lume, una presa con il crafting hextech e l&#039;altra comprata dallo shop, ma nessuna di queste 2 &egrave; scomparsa)? So che si dovrebbe mandare un ticket al supporto, ma volevo prima vedere se &egrave; successo solo a me o anche ad altre persone. Grazie in anticipo per tutte le risposte","replies":[{"poster":"Kopoo","date":"2016-07-28T21:29:05.062+0000","up_votes":1,"down_votes":0,"body":"Anche un altro utente si è ritrovato senza alcune skin ward ( [Ward rimossa? ](http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/Ak0rskJg-ward-rimossa )), quindi ti suggerisco di aprire un ticket e chiedere spiegazioni a loro.\nFacci sapere!\nEDIT: Dando un'occhiata su reddit ho trovato questa discussione \"https://www.reddit.com/r/leagueoflegends/comments/4v0qcw/season_4_reward_skin_gone/ \", il Rioter che ha risposto ha detto che stanno già controllando (e che quindi provvederanno a risolvere).","replies":[]}]}