{"poster":"Groox II","date":"2016-06-28T13:20:15.277+0000","title":"Esperienza bonus per i support","subforum":"Discussioni generali","up_votes":9,"down_votes":3,"body":"Ho letto che per compensare la minor quantit&agrave; di esperienza presa dai support durante tutto il game la Riot ha messo che ora anche i lumi danno esperienza. Questo perch&eacute; di solito il compito di rimuovere le ward &egrave; svolto dai support.\r\nCosa impedir&agrave; da ora in poi, per&ograve;, di far togliere le ward agli altri membri del team?\r\nMi spiego meglio: fino ad ora i lumi non erano considerati molto come obiettivo da rimuovere, se non per togliere visione alla squadra avversaria. Da ora che daranno anche esperienza (oltre all&#039;oro che gi&agrave; danno) saranno visti un po&#039; come &quot;un minion in pi&ugrave; da farmare&quot;. Nelle lane top e mid cambia poco, ma in botlane mi immagino gi&agrave; che tutti i lumi verranno tolti dall&#039;adc per prendere ancora pi&ugrave; vantaggio.\r\nRisultato: non solo i support non prenderanno comunque esperienza in pi&ugrave;, ma non avranno nemmeno l&#039;oro che per ora elemosinano distruggendo le ward.\r\n\r\nPropongo alla Riot un altro sistema.\r\nSiccome il support  &egrave; un ruolo non propriamente da lane (top, mid e adc) ma pi&ugrave; un ruolo di spalla (appunto &quot;supporto&quot;), cosa che comunque fa anche il jungler (non per questo meno importanti degli altri), perch&eacute; non fare qualcosa simile ai jungler con lo smite e l&#039;oggetto da giungla?\r\nPotreste mettere un incantesimo utile solamente ai support (per esempio che funziona solo su alleati), in modo che non lo prendano anche gli altri membri del team come successe per lo smite, e gli oggetti da support che possono essere presi solo se si ha quell&#039;incantesimo.\r\nIn questo modo sarebbe pi&ugrave; facile per i rioter calibrare questi oggetti, e potrebbero metterci che danno esperienza bonus o qualsiasi altra cosa per invogliare a giocare questo ruolo tanto sottovalutato.","replies":[{"poster":"Immortal spax","date":"2016-06-28T18:13:55.596+0000","up_votes":5,"down_votes":1,"body":"Basterebbe mettere una passiva alla sightstone che permette di prendere 50%+ d'esperienza quando sei vicino ad un alleato con un livello superiore al tuo.","replies":[{"poster":"Groox II","date":"2016-06-28T18:29:40.203+0000","up_votes":1,"down_votes":0,"body":"Buona anche questa come idea. Avevo pensato qualche giorno fa a qualche modifica alla sightstone in effetti.","replies":[]}]},{"poster":"UnknownEV","date":"2016-06-29T07:49:05.803+0000","up_votes":3,"down_votes":0,"body":"In tutti i game... che ho fatto da support... TUTTI e dico TUTTI, quando io stavo togliendo una ward... ci mettono naso e la prendono loro...\nAllora a volte va bene, se bisogna fare veloce 2 colpi tuoi e uno del tuo adc e si rompe subito\n---\nio propongo che chi ha disattivato la ward nemica con {{item:3341}} o{{item:3364}} prenda lui tutta l'esperienza e i gold. Che ne pensi?","replies":[{"poster":"Groox II","date":"2016-06-29T12:24:50.759+0000","up_votes":1,"down_votes":0,"body":">In tutti i game... che ho fatto da support... TUTTI e dico TUTTI, quando io stavo togliendo una ward... ci mettono naso e la prendono loro...\nAllora a volte va bene, se bisogna fare veloce 2 colpi tuoi e uno del tuo adc e si rompe subito\n\nEsattamente. A me non sempre per fortuna xD\n\n>io propongo che chi ha disattivato la ward nemica con {{item:3341}}  o {{item:3364}}  prenda lui tutta l'esperienza e i gold. Che ne pensi?\n\nCredo sia un sistema molto complesso da fare a livello di programmazione. Io non me ne intendo per nulla, ma non credo sia semplice mettere un sistema che fa riconoscere chi ha messo i trinket rossi ma che gli dia la ricompensa solo quando le ward vengono tolte. E poi per {{item:2043}} come dovremmo fare?\nPiuttosto l'exp bonus può andare insieme all'oro bonus degli oggetti da support:\nCon la serie {{item:3301}} prendi un po' di exp bonus quando muoiono minion vicini non uccisi da te;\ncon la serie {{item:3303}} prendi un po' di exp bonus quando pokki (pocki? pocchi? quello insomma) i nemici (con la stessa limitazione dell'uccidere minion);\ncon la serie {{item:3302}} prendi un po' di exp bonus quando uccidi i minion per curare te e l'alleato. In questo caso un po' di più di exp rispetto agli altri due, dato che si fa meno spesso.\nTutto questo sempre legato al discorso che si possano prendere solo con l'incantesimo dell'evocatore apposito per support, altrimenti in mid {{item:3092}} diventerebbe un oggetto troppo forte.\n\nIn alternativa anche dare esperienza quando si piazzano le ward, dato che alla fine il support è quello che ne mette di più, può andare bene. Almeno per il momento sarebbe comunque un passo avanti. Non dentro la propria base, altrimenti starebbero tutti a spammarle con {{item:2049}}. In questo modo si incentiverebbe anche tutti i giocatori a dare visione.\n\nAncora di più, se l'incantesimo dell'evocatore per support fosse un qualcosa simile a {{item:3364}}  ma più potente (magari che toglie all'istante le ward nell'area) potrebbero lasciare che distruggere le ward dia esperienza.\nSarebbe simile a come hai detto te in questo caso.","replies":[{"poster":"UnknownEV","date":"2016-06-29T14:59:59.833+0000","up_votes":1,"down_votes":0,"body":"Esatto!\n\nPer l'incantesimo nuovo che vuoi proporre io aggiungerei:\nVisualizza un AMPIA area, se ci sono ward le toglie, se non ne trova neanche una... il cd si dimezza, troppo powa? :P","replies":[]}]}]},{"poster":"EmptyHole","date":"2016-06-28T13:50:15.542+0000","up_votes":4,"down_votes":1,"body":"L'idea dell'incantesimo che ti permette di  comprare gli oggetti da supporto non è male in effetti...+1","replies":[]},{"poster":"Fedejuve4ever","date":"2016-06-29T12:42:55.653+0000","up_votes":2,"down_votes":0,"body":"Quando tolgo la ward non sto a guardare chi prende quei 30 gold in più, stessa cosa sarà per l' xp, alcune volte lascio pure i gold all'adc. L'adc è quello che poi vi deve carriare eh","replies":[{"poster":"Groox II","date":"2016-06-29T12:49:38.139+0000","up_votes":1,"down_votes":0,"body":"Sì, proprio per questo dico che andrà tutto all'adc. Questo sistema però la Riot l'ha messo per _aiutare a prendere esperienza ai support_. Perché non vengono giocati volentieri da molti, e perché nel team di solito sono quelli più arretrati sia in gold che in exp. Quindi mettono questa cosa per ridurre il distacco di esperienza ed oro, ma in realtà tutti faranno il ragionamento che fai te, ovvero \"Hey, ma così può prendere più oro ed exp l'adc. Lasciamo a lui i trinket, così prende più vantaggio e carria meglio\". In questo modo** aumenterà il dislivello** di risorse tra support e adc **invece di diminuire**.","replies":[]}]},{"poster":"Vileblood Pyke","date":"2016-06-29T00:30:29.263+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Groox II,realm=EUW,application-id=MJVj50Jw,discussion-id=FwLE7mOu,comment-id=,timestamp=2016-06-28T13:20:15.277+0000)\n>\n> Cosa impedirà da ora in poi, però, di far togliere le ward agli altri membri del team?\n> Mi spiego meglio: fino ad ora i lumi non erano considerati molto come obiettivo da rimuovere, se non per togliere visione alla squadra avversaria. Da ora che daranno anche esperienza (oltre all'oro che già danno) saranno visti un po' come \"un minion in più da farmare\". Nelle lane top e mid cambia poco, ma in botlane mi immagino già che tutti i lumi verranno tolti dall'adc per prendere ancora più vantaggio.\n> Risultato: non solo i support non prenderanno comunque esperienza in più, ma non avranno nemmeno l'oro che per ora elemosinano distruggendo le ward.\n\nDevono solo provarci a prendermi le ward, questi maledetti...","replies":[{"poster":"Groox II","date":"2016-06-29T12:06:35.203+0000","up_votes":1,"down_votes":0,"body":"Vedo che mi capisci. Cioè, va bene togliere le ward, e chiunque dovrebbe farlo. Se c'è poco tempo va bene chiunque. Ma quando sei lì a togliere la tua ward da solo e sbuca uno a caso e la last-hitta è brutto :(","replies":[]}]},{"poster":"fedy99","date":"2016-06-28T20:17:52.601+0000","up_votes":2,"down_votes":1,"body":"bell'idea","replies":[]},{"poster":"Kim114","date":"2016-06-28T14:08:01.550+0000","up_votes":2,"down_votes":1,"body":"BUONISSIMA IDEA","replies":[]},{"poster":"zezzypiro133","date":"2016-06-29T08:00:11.275+0000","up_votes":1,"down_votes":0,"body":"Essendo main supp credo che gli oggetti da supp possano dare esperienza in più dato che l exaust o l ignite sono fondamentali per un support","replies":[]},{"poster":"UltraLion","date":"2016-06-28T20:45:54.573+0000","up_votes":1,"down_votes":0,"body":"L'idea non è malvagia, ma la differenza coi jungler sta nel fatto che loro han sempre avuto lo smite come scelta obbligata, i support invece hanno sempre avuto libertà di scelta, se andare più aggressivi o difensivi ecc. costringerli ad usare una sola spell li limiterebbe.\nAnche se potrebbero differenziarne l'effetto a seconda dell'oggetto che si acquista","replies":[{"poster":"Groox II","date":"2016-06-29T00:16:49.989+0000","up_votes":1,"down_votes":0,"body":"Se crei un incantesimo nuovo comodissimo ai support, questo diventerebbe \"scelta obbligata\" a loro come lo è lo smite per i support.\nPer esempio un incantesimo che ti mette un nuovo tipo di ward più potente, o boh, altro.\nAnche perché ora come ora i support al 90% usano l'exaust. Sia che vadano aggressivi, sia che vadano tank, sia che portino utility. Quindi già quello può essere considerato \"l'incantesimo del support\".","replies":[]}]},{"poster":"ReStRa6","date":"2016-06-28T16:59:38.985+0000","up_votes":1,"down_votes":0,"body":"Concordo, prova a mandare una mail alla riot con la proposta, secondo me è ottima :D","replies":[]},{"poster":"DANJERpuntoEXE","date":"2016-06-29T09:03:01.686+0000","up_votes":1,"down_votes":1,"body":"MANDA QUELLA MAIL!","replies":[]}]}