{"poster":"Jayjayko","date":"2017-04-22T14:10:34.903+0000","title":"League Gala Event","subforum":"Fanfic Workshop","up_votes":4,"down_votes":1,"body":"(I was so grateful that my &#039;glitzy red carpet league event (+Draven) Got mentioned in the Skin Story Slam conclusion :D . For those interested, here is the story. Enjoy)\r\n\r\n\r\nUpon a large magnificent red carpet, leading towards a great domed architectural wonder, a line of yordles stand upon its length, trumpets in hand and ready for the announcement. With a resounding blare from each, echoing out into the horizon, the official annual league gala has begun!\r\n\r\nHair as suave as ever, and a grin to match, the famous and dashing champion of Primetime, Draven was on the scene, microphone in hand.\r\n\r\nDraven: &ldquo;Welcome Welcome, Ladies, Gentlemen, Yordles, Voidlings&hellip;Undead&hellip;er..Unspecified! Welcome to the League Gala event! Im your host, Draven, but you already knew that! Ha ha!&rdquo;\r\n\r\nDraven looks around from his seat, taking in the crowd, as if waiting for some reaction. A disappointed look on his face, he peers around in distaste.\r\n\r\nDraven: &ldquo;All manners of nobles, dignitaries, socialists, stars and of course, best of all, me, will be making their way to this grand event&rdquo;\r\n\r\nEchoing from the speakers, a tiny squeaky voice is heard \r\n\r\nMr. Smiggles: &ldquo;Mr. Draven! Mr. Draven! Don&rsquo;t forget about us!&rdquo;\r\n\r\nDraven: &ldquo;Hm? Oh yeah..&rdquo;\r\n\r\nWith what little care he could muster, Draven announces his co-hosts.\r\n\r\nDraven: &ldquo;And at the scene, trying their best not to get stepped on, we have our reporters, the yordles Smiggles and Big Jib&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Yep! Yep!&rdquo;\r\n\r\nBig Jib: &ldquo;Hm? Wha&rsquo;? Who said ma name?&rdquo;\r\n\r\nMr. Smiggles plaintively: &ldquo;Wake up Jib&hellip;we&rsquo;re on&rdquo;\r\n\r\nDraven: &ldquo;Get that camera up and on for the arrivals Jib&hellip;and be sure to get my good side!&rdquo;\r\n\r\nWaffla: &ldquo;Oi! Don&rsquo;t forget about me!&rdquo;\r\n\r\nDraven rolls his eyes, exhausted with the distractions\r\n\r\nDraven: &ldquo;And standing on the carpet is Waffles..or something&rdquo;\r\n\r\nWaffla: &ldquo;Waffla!!&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Oh! Oh! I think the first stars are coming&rdquo;\r\n\r\nDraven: &ldquo;I was already here Smiggles&rdquo;\r\n\r\nWaffla: &ldquo;Oooooo, how amazing! Landing in a heroic stance, it&rsquo;s Galio, looking as debonair as ever!\r\n\r\nMr. Smiggles: &ldquo;I heard he got a whole new makeover&rdquo;\r\n\r\nWaffla: &ldquo;You bet! He&rsquo;s gliding down the carpet, a spectacle to see!&rdquo;\r\n\r\nWaffla: &ldquo;Ooo, girls try to control yourselves, because the gentleman have just entered the party!&rdquo;\r\n\r\nDraven: &ldquo;Well I do have a way with class&rdquo;\r\n\r\nWaffla: &ldquo;Right&hellip;well, here come the gentlemen Cho&rsquo;gath and Gnar, looking as sophisticated as ever. Oh gosh! Gnar just kissed my hand!&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Try not to faint Waffla! We need you to stay awake&rdquo;\r\n\r\nBig Jib: &ldquo;Did someone say cake?&rdquo;\r\n\r\nMr. Smiggles, sighing: &ldquo;No Big Jib&hellip;, just keep the camera steady&rdquo;\r\n\r\nWaffla: &ldquo;Oooh, Jib, Cho&rsquo;gath seems to have noticed you. What an honor!&rdquo;\r\n\r\nDraven: &ldquo;Ha! Get ready to run fast with those legs Jibbo!&rdquo;\r\n\r\nWaffla: &ldquo;Don&rsquo;t worry Big Jib! Officer Caitlin and the Riot squad are making sure everything goes peacefully&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Do I see glitter? It&rsquo;s seems to be flowing on the wind&rdquo;\r\n\r\nWaffla: &ldquo;I bet you do. I can&rsquo;t believe it. WOW! Popstar Ahri just stepped on the carpet in a shower of beautiful sparkles. Im such a fan!&rdquo;\r\n\r\nMr. Smiggles: &ldquo;I think I see something else going on there&rdquo;\r\n\r\nWaffla: &ldquo;Right behind her, the amazing and dashing Taric is on the scene, wearing his shocking pink armor of the fifth age. They&rsquo;re walking down the carpet in a display of sparkles and shines. Oh oh, I wonder if they&rsquo;re dating?!&rdquo;\r\n\r\nDraven: &ldquo;Ha!&rdquo;\r\n\r\nMr.Smiggles: &ldquo;He&rsquo;s definitely playing the support role well!&rdquo;\r\n\r\nBig Jib: &ldquo;I can&rsquo;t see! I can&rsquo;t see!&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Don&rsquo;t look directly at the sparks Jib!&rdquo;\r\n\r\nDraven: &ldquo;Who needs sparks when you got a mug like this, aye ladies?&rdquo;\r\n\r\nBig Jib: &ldquo;Hot chocolate mug?&rdquo;\r\n\r\nDraven: &ldquo;Jib&hellip;I swear&hellip;.I..&rdquo;\r\n\r\nWaffla: &ldquo;Superfan Gragas is really brewing up a storm of applause with the crowd! What a guy. Ooooo, wow!&rdquo;\r\n\r\nMr. Smiggles: &ldquo;What&rsquo;s going on Waffla?&rdquo;\r\n\r\nBig Jib: &ldquo;Why does it feel so cold&hellip;&rdquo;\r\n\r\nWaffla: &ldquo;I&rsquo;ll tell you why! The infamous Pentakill band has just appeared. The cheers from the crowd is near deafening&rdquo;\r\n\r\nDraven: &ldquo;Meh..&rdquo;\r\n\r\nWaffla: &ldquo;Lead by Mordekaiser, they&rsquo;re making their way down the carpet. OH, Sona just released a painful cord, sending their fans into a frenzy of delight!&rdquo;\r\n\r\nDraven: &ldquo;Sending my ears right to the infirmary you mean&hellip;&rdquo;\r\n\r\nWaffla: &ldquo;Hmm&hellip;&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Something the matter?&rdquo;\r\n\r\nWaffla: &ldquo;Something feels..definitely amiss here. Two large nosed and eye-glass wearing individuals have just entered. They look familiar but&hellip;im not sure. They seem to be getting strange looks.&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Very odd. Yes, I see them now, coming down the carpet. They seem rather shifty..&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Officer Caitlin seems to be questioning the large yellow one, I&rsquo;m not sure where this&hellip;&rdquo;\r\n\r\nBig Jib: &ldquo;DUCK!&rdquo;\r\n\r\nMr.Smiggles and Big Jib barely avoid a plasma ball of void energy, a misfire by one of the mysterious figures.\r\nWaffla: &ldquo;Eeee! They seem to be causing some ruckus. People are running away while champions leap to the ready!&rdquo;\r\n\r\nMr.Smiggles: &ldquo;It&rsquo;s getting pretty crazy here!! Draven has leapt to the scene, axe in hand and&hellip;wow! He knocked the nose right off one of them. It&rsquo;s Vel&rsquo;koz!!&rdquo;\r\n\r\nDraven: &ldquo;Ha ha!&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Seems Vel&rsquo;koz was trying to go for Zilean. Officer Caitlin and the Riot squad are trying to subdue him but he is unleashing an array of shots&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Poppy has stepped into the scene. Wow! One hit of that giant hammer and she sent Vel&rsquo;koz flying right out of the courtyard! What a yordle! What a hero!&rdquo;\r\n\r\nDraven: &ldquo;I did most of the work&hellip;&rdquo;\r\n\r\nWaffla: &ldquo;I see tentacles zooming out into the distance. He is looong gone&rdquo;\r\n\r\nMr.Smiggles: &ldquo;It seems the yellow one tried to sneak into the dome during the commotion. Oh&hellip;oh gosh. Is that Blitzcrank? It&rsquo;s definitely not Blitzcrank&hellip; is it?\r\n\r\nDraven: &ldquo;What other big yellow robot do you know?&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Yep, Officer Caitlin has caught him in her net. Seems he was banned from coming to these events after inappropriately grabbing others. Poor Blitzcrank&rdquo;\r\n\r\nMr.Smiggles: &ldquo;Things seem to be calming down now&rdquo;\r\n\r\nWaffla: &ldquo;It wouldn&rsquo;t be a League event without some action!&rdquo;\r\n\r\nDraven: &ldquo;And with that, let&rsquo;s take a look at our eyes in the sky. Here on Forecast duty, Janna! Let us know how it is going.&rdquo;\r\n\r\nJanna: &ldquo;Mic check, am I coming in?&rdquo;\r\n\r\nDraven: &ldquo;Yeah yeah&rdquo;\r\n\r\nJanna: &ldquo;Wait, are we rolling?&rdquo;\r\n\r\nDraven: &ldquo;&hellip;Yeah&rdquo;\r\n\r\nJanna: &ldquo;This is Janna live from the League Gala event and things are really heating up here!&rdquo;\r\n\r\nDraven: &ldquo;Well no sh&hellip;&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Ahem! Anything else to see, Janna?&rdquo;\r\n\r\nJanna: &ldquo;We&rsquo;re seeing a distinct chance of Pentakills!&rdquo;\r\n\r\nWaffla: &ldquo;Yep they already arrived&rdquo;\r\n\r\nMs. Smiggles: &ldquo;How&rsquo;s the weather looking?&rdquo;\r\n\r\nJanna: &ldquo;iiit&rsquo;s gusty!&rdquo;\r\n\r\nDraven: &ldquo;The wind&rsquo;s as dead as the Shurima dessert&hellip;what are you&hellip;&rdquo;\r\n\r\nA large gust of wind comes flying in from above.\r\n\r\nMr. Smiggles: &ldquo;Oooh, looks like Draven just got blown right off his chair. Thank you Janna for the update and surprise gale force. How&rsquo;s it looking at the front, Waffla?&rdquo;\r\n\r\nWaffla: &ldquo;The oh so debonair Ezreal has made an appearance and the girls have gone wild. Oh, appearing by his side is the beautiful and stunning Lux, wearing a gown of shifting elemental colors. How amazing!&rdquo;\r\n\r\nWaffla: &ldquo;As the last of the nobles and stars make their way inside, it looks like it is quieting down here, back to you Mr. Smiggles.&rdquo;\r\n\r\nMr. Smiggles: &ldquo;Thanks Waffla, it was quite a spectacle to be sure! They seem to be starting up inside, let&rsquo;s go enjoy the show!&rdquo;\r\n\r\nDraven: &ldquo;This is Draven, signing out. Autographed pictures of yours truly handed out for 30 mins after the show. Get them while you can!&rdquo;","replies":[{"poster":"Zookie","date":"2017-04-23T01:50:53.101+0000","up_votes":3,"down_votes":0,"body":"Such a fun story. Really enjoyed it!","replies":[]},{"poster":"IBELIEVEYOUDO","date":"2017-07-04T22:01:29.423+0000","up_votes":2,"down_votes":0,"body":"_Few things-enjoyed the story, it was a short, fun, quick read. _\n\n**+** Draven was very in character. You portrayed him wonderfully, and made the other champs shine, too.\n\n**+ **Featuring multiple champions gives your readers a little something to enjoy, whether they're an Ahri one trick or #gragasmain.\n\n**+ **The story was still entertaining, even if there was not a major conflict. \n\n**+** It was very light and hilarious, which is a nice change for League of Legends.\n\n**/** You did well adding extra characters. It makes it more believable that not only Janna and Draven would be covering the scene. The conversation between everyone got a little confusing though, as it was back and forth. You might slim the dialogue down, but be careful where you do this-the conversations between the characters were a lot of the humor!\n\n**/ **Some things shouldn't be abbreviated, but as most things are dialogue based, you captured our English slang really well. Towards the end, for example, saying \"30 minutes\" might have flowed better.\n\n**-** Make sure you watch your grammar. Little things, like a missed apostrophe, can make a big difference.\n\n**- **The actions and dialogue were sort of hard to differentiate between. Try using italics for your actions in between, since this is mostly script based, or even parentheses. Check out some plays to find out how they stylize their writing.\n\n_I hope these tips helped. That's just the advice I can give. I hope it's relevant, and again, great piece! It really brightened my mood! I know it's already like, way past time to edit it and all, but I thought I'd still give pointers. Congrats on getting featured with it!_\n{{sticker:zombie-brand-clap}}","replies":[]}]}