{"poster":"Vaka","date":"2017-01-30T19:09:57.190+0000","title":"SUPPORT / TOPLANE sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Gr&uuml;&szlig;e euch,\r\n\r\nich bin auf der Suche nach an einem RankedTeam f&uuml;r Season 7.\r\nZu meiner Person ich bin 27 Jahre alt und derzeitig Gold V (Letzte Season Gold III). Ich maine Support und Toplane.\r\nMeine LoL-Erfahrung begann mit Ende Season 2. und seitdem Spiele nahezu t&auml;glich. Im letzten Team habe ich die Rolle des Supportes &uuml;bernommen, wodurch meine Statistiken eher in die Richtung Support aussagekr&auml;ftiger sind.\r\n\r\nAuf diesen Weg suche ich ein Team, das ein gewissen Grad an Ernsthaftigkeit mitbringt und sich unter anderem dadurch auszeichnet, sich auf in der Pick- und Bannphase auf das wesentliche zu konzentrieren. Ich suche nicht unbedingt ein Tryhardteam, die an jedem Offline-Turnier des Jahres mitspielen wollen (Es liegt einfach nur daran, das mir dazu leider die Zeit fehlt :/ ), sondern einfach eine feste Gruppe, die sich mehrmals die Woche trifft und die TeamRankedLadder/FlexQue unsicher macht. (Tuniere sollen aber nicht g&auml;nzlich ausgeschlossen sein^^)\r\n\r\nIch m&ouml;chte jetzt nicht hinschreiben welche Champions ich maine, da ich finde das das nur bedingt Sinn macht. Ich vertrete eher die Auffassung, dass ein Spieler einen Gewissen Pool an Champions beherrschen sollte, somit passe ich meine Picks an die Teamkomposition an. Wenn ich frage, was ich picken soll, dann nicht weil ich keine Ahnung habe, auf was ich denn genau Lust habe. Sondern bei mir zielt die Frage auf die Strategie und Spielweise unseres Teames ab und wie wir dieses Spiel gewinnen wollen. Und das m&ouml;chte ich mit dem Team in der Championselection besprechen und entscheiden.\r\n\r\nAu&szlig;erhalb des Spieles besch&auml;ftige ich mich mit theoretischen Auseinandersetzungen bez&uuml;glich LoL, schaue, soweit es meine Zeit zul&auml;sst, viele Turniere und probiere auch gerne neue Sachen einfach aus.\r\nWenn ihr euch vorstellen k&ouml;nnt, mich als Teammember kennenzulernen, w&uuml;rde es mich freuen, wenn ihr mich auf EUW addet: Vaka. Dann k&ouml;nnen wir noch einige Dinge besprechen. Ich freue mich von mich von euch zu h&ouml;ren.\r\nVaka.\r\n\r\nZusammenfassung:\r\n\r\nAlter: 27\r\nAnzahl der Spiele: Jeden Tag ein paar Dutzend.\r\nMain-Position: Support und Top\r\nElo: Gold V (Stand Januar 2017)\r\nGr&ouml;&szlig;te Schw&auml;che: Untersch&auml;tzung der der Spielsitiuation\r\nSt&auml;rken: anpassungsf&auml;hig, Teamplayer, kritikempf&auml;nglich, motiviert.\r\nTeamspeak vorhanden?: Ja / Server vorhanden?: Nein\r\nSkype vorhanden?: Ja\r\nIn welchem Elo-bereich sollte das Team sein?: Gold aufw&auml;rts\r\nSuche: Competitive-Team\r\nMain-Champion: Competitive Pick\r\nSpiele seit Season 2\r\nFr&uuml;here Team-erfahrung: drei 5er-Teams Support/Top; ein 3er Team.\r\nWie kann das Team dich erreichen?: Auf EUW unter &quot;Vaka&quot;","replies":[]}