{"poster":"TheLastAirbender","date":"2017-02-07T17:29:22.800+0000","title":"Spieler wünschen anderen den Tod","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":3,"body":"Hi!\r\n\r\nHatte gerade ein spiel und hab ekko als support gepickt. Wurde autofilled nur so nebenbei und thresh war weg und dachte ekko is auch ganz gut und lustig.\r\nDaraufhin hatte mir ein Spieler die ganze Zeit im Spiel geschrieben, dass meine &quot;Drecksmutter an krebs sterben soll und dass ich mir auf jeden Fall ihre (Diana&#039;s) Worte merken soll, dass meine Mutter bald sterben wird und wenn sorgt sie daf&uuml;r&quot; und so..\r\nIch reporte sie, schreib das dahin und nichts passiert.. Wie kann das sein, dass solche Leute ungestraft das Spiel spielen d&uuml;rfen? Das ist schrecklich so etwas lesen zu m&uuml;ssen. Schade, dass sowas nicht flamen genug ist, um daf&uuml;r bestraft zu werden... Manche Leute vergessen halt, dass LoL ein Spiel ist genau wie Mensch &auml;rgere dich nicht oder mau mau oder so","replies":[{"poster":"eingew","date":"2017-02-07T18:49:07.692+0000","up_votes":2,"down_votes":0,"body":"> Ich reporte sie, schreib das dahin und nichts passiert.. \n\nWas lässt dich darauf schließen?\n\nAbgesehen davon würde ich bei negativem Chat einfach den Mutebutton betätigen, ich halte das so und habe so etwas noch *nie* in meinem ganzen Spielerleben gelesen, war also dementsprechend noch nie darüber aufgeregt oder habe sonst irgendwie Zeit damit verschwendet. Und reported habe ich die Leute trotzdem für ihre ersten (meist zwar ebenfalls negativen, dafür aber nicht so schlimmen) Kommentare, was also ebenso zu einer Strafe führt, wie wenn ich mir die anderen Dinge von ihnen anhöre. Entsprechend entspannt finde ich League meistens, selbst wenn alle Mitspieler flamen ist das zwar nervig, aber nicht weiter wichtig, weil ich dabei höchstens sehe, wie einzelne Spieler ab und zu stocksteif rumstehen ohne auf das Spiel zu achten, aber eben absolut nichts von dem Gekeife lesen muss ;).","replies":[]},{"poster":"ºJatschillik","date":"2017-02-07T17:36:46.681+0000","up_votes":2,"down_votes":0,"body":"Ich versteh dich mein junge ;D\nEs gibt Menschen denen sehr bewusst ist das es ein spiel ist, aber sich  zu sehr reinsteigern. die nicht nachdenken. die vllt die letzten 6 games in folge verloren haben. die vllt vorher ggn nen teemo gelaned haben. die vllt einfach aber auch nur scheisse sind. und weil der support da nix macht..   solltes du einfach drüber stehen","replies":[{"poster":"TheLastAirbender","date":"2017-02-07T17:43:32.650+0000","up_votes":3,"down_votes":2,"body":"ja ich find den tod wünschen aber schon echt krass, das is das schlimmste was passieren kann","replies":[{"poster":"Shakês Beer","date":"2017-02-07T17:56:48.943+0000","up_votes":2,"down_votes":0,"body":"Ich hab mir tatsächlich überlegt solche Leute die sagen \"Und wenn deine Mutter nicht stirbt dann sorg ich dafür\" anzuzeigen. Einfach wegen Morddrohung. Und ich kann dir aus Erfahrung sagen: Ich hab mal mit nem NA account, den ich nicht mehr brauchte Freunden unter Absprache Morddrohungen, Beleidigungen, Rassistische Kommentare zugesendet es ist erst sehr spät was passiert. aber es passierte was. Nur Geduld!","replies":[{"poster":"Atsùra","date":"2017-02-07T18:09:02.993+0000","up_votes":2,"down_votes":0,"body":"Was heißt \"sehr spät\"? Würde ich jetzt gerne mal wissen.","replies":[{"poster":"Shakês Beer","date":"2017-02-07T20:29:41.657+0000","up_votes":1,"down_votes":0,"body":"Wir hatten den versuchsaufbau über einen Monat und die Strafe waren ein 10 game mute. Wir haben das fast täglich gemacht!","replies":[{"poster":"Atsùra","date":"2017-02-08T17:17:39.549+0000","up_votes":1,"down_votes":0,"body":"DAS is natürlich krass... Ok ich hatte jetzt zwei Ansätze, wieso weshalb warum das System dann nicht reagiert... Aber direkt verworfen... Ich finde Morddrohungen schon etwas krasser... Als der \"normale\" Flame.","replies":[{"poster":"Pandaphiri","date":"2017-02-09T10:06:05.123+0000","up_votes":1,"down_votes":0,"body":"welcome to league of legends...\n\nso was sollte man echt selbst in die Hand nehmen und den betreffenden Spieler lieber verklagen","replies":[]}]}]}]}]}]},{"poster":"Atsùra","date":"2017-02-07T17:54:42.159+0000","up_votes":2,"down_votes":0,"body":"Und wenn sie noch so viele Spiele verlieren.. Einfach die Fresse halten und nen Boxsack boxen gehen und andere Spieler nicht dumm anmachen.. DAS is die Lösung! Als ob die Flamer die Progamer sind und denken sie dürfen, was sie machen... {{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"Doo ","date":"2017-02-07T19:15:06.621+0000","up_votes":3,"down_votes":1,"body":"Ist zwar nicht nett, aber wenn du dir so einen scheiß zu Herzen nimmst darfst du kein league of legends spielen. Das passiert nämlich jedes 2. Spiel.","replies":[]},{"poster":"Vapertank","date":"2017-02-07T21:13:44.429+0000","up_votes":1,"down_votes":2,"body":"Wenn mein ganzes Team in Solo Queue für Open mid geht nur weil sie zu unfähig und getilted sind wünsch ich denen nur dass ich sie niemals im RL sehe....","replies":[]}]}