{"poster":"10000 BC","date":"2016-01-07T12:55:42.910+0000","title":"Support sucht TryardTeam!!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Zur Mir:\r\n-SoloQ Elo: Platin 2\r\n-Position: Main Support\r\n-Habe Teamspeak und Headset/Mic\r\n-Habe schon einige erfahrungen mit Rankedteams\r\n-Eigentlich T&auml;glich mehrere Stunden online\r\n\r\nWas suche ich:\r\n-Team im Platin/Diamond bereich\r\n-Interesse an Tunieren am Wochenende\r\n-2-3 mal Training unter der Woche\r\n\r\nEinfach Adden -&gt; 10000 BC","replies":[{"poster":"Alpha and Ømega","date":"2016-01-14T10:29:37.546+0000","up_votes":1,"down_votes":0,"body":"Wir sind zurzeit ein Diamond 5 Team mit einiger Erfahrung in der Major-League und go4lol. Alle Member sind zurzeit Dia 4. Unser Jungler und Support haben uns verlassen weil sie den strengen Zeitplan nicht einhalten konnten(ihnen die Motivation gefehlt hat).\n\nIch schreibe dir hier mal unsere Trainingszeiten auf\n\nTrainingszeiten:\nMontag 18.30-22.00 Dynamic Que/Teamque\nDienstag 18:30-22:00 Championpool erweitern, Dynamic que\nMittwoch 18.30-22.00 Dynamic Que/Teamque\nDonnerstag 20:30-23.00 Championpool erweitern, Dynamic que\nFreitag 18.30-22:00 Theorie + Dynamic que\nSamstag 15.00-19.00 freiwillig jedoch von Vorteil\nSonntag 13.00-16.00 20:00-22.00 Wenn wir Go4lol anfangen plant euch den ganzen Sonntagnachmittag ein\n\nAndere Turniere für irgendwelche Qualifikationen oder Preise werden wir auch mitspielen. Also Zeit einplanen und flexibel sein.\n\nRegeln: Kein gegenseitiges anschreien, keine Negativität verbreiten, sich nicht öffentlich aufregen während des Spiels, Pünktlichkeit ist besonders wichtig, eigenes Engagement, Nach verlorenen Games schauen wir uns das Replay an und besprechen unsere Fehler, Bei Spielen wo wir Schwierigkeiten hatten besprechen wir das ebenfalls mit dem Replay.\n\nWenn man die Stimmung im Team nicht gut findet sofort darauf ansprechen.\nMan reagiert vernünftig auf Kritik und nimmt diese auf bevor man instinktiv darauf antwortet.\nMan kritisiert ebenfalls konstruktiv, das bedeutet man begründet die Kritik und sagt nicht einfach „der move war scheisse“\n\nDas ist mal ne kleine Zusammenfassung wenn du Fragen hast einfach AEP Metak anschreiben habe dich geaddet oder hier antworten.\n\nGruss\n\nAEP Metak","replies":[]}]}