{"poster":"PepitoLosPalotes","date":"2016-02-10T21:51:35.597+0000","title":"¿Nos van a privar también del ícono de Dominion?","subforum":"Charlas Generales","up_votes":14,"down_votes":2,"body":"Hoy fue anunciado que el modo de juego Dominion va a ser retirado. Y ya todos sabemos que nunca quisieron ponerlo por la poca atenci&oacute;n que tendr&iacute;a. Pero hay un punto interesante:\n\nComo pueden notar en [este link](http://las.leagueoflegends.com/es/news/game-updates/features/dominion-se-retira), se anuncia el retiro de Dominion para latinoam&eacute;rica, pero se saltaron todo un p&aacute;rrafo del [post original en ingl&eacute;s](http://na.leagueoflegends.com/en/news/game-updates/features/retiring-dominion).\n\n__________________________\n\n_&laquo;For players who&rsquo;ve made the Crystal Scar their home over the last four years, we&rsquo;ll be taking a snapshot of the queue today just before this post goes live. Then we&rsquo;ll give out an exclusive, never-to-be-reproduced Summoner Icon to anyone with over 100 wins in matchmade Dominion games (not including Co-op vs AI). You can expect the icon to land in your account within two weeks of this announcement! ...&raquo;_\n\n_«Para los jugadores que han hecho de la Cicatríz de Cristal su hogar por los últimos cuatro años, tomaremos una foto de la cola de hoy antes que este post se publique, Y luego estaremos entregando un exclusivo, nunca visto Ícono De Invocador a cualquiera con más de 100 victorias en Dominion (no incluye Co-op vs AI). ¡Pueden esperar que su ícono llegue a su cuenta en dos semanas luego de este anuncio!  ...»_\n____________________________\n\nEste p&aacute;rrafo que fue retirado habla de una peque&ntilde;a pero notoria y exclusiva recompensa para la gente que gan&oacute; 100+ partidas en Dominion. Recompensa que asumo ninguno de nosotros va a tener. Mi pregunta es la siguiente:\n\n&iquest;Siquiera en Riot Latinoam&eacute;rica pensaron en alguna forma que la gente que s&iacute; gustaba de Dominion y les negaron la posibilidad de seguir jug&aacute;ndolo obtuviera ese &iacute;cono? \n\n&iquest;Qu&eacute; tal reducir el n&uacute;mero que se requiere para obtener el &iacute;cono? &iquest;o d&aacute;rselo a la gente que jug&oacute; Dominion el fin de semana que lo activaron en LAS/LAN?\n\nPor favor, no nos dejen en la inferioridad otra vez, Dominion a m&iacute; me importaba, me gustaba c&oacute;mo la voz masculina del anunciante narraba las capturas, neutralizaciones, puntos de Nexus... Denos la posibilidad de tener esa recompensa :^(","replies":[{"poster":"4hsy","date":"2016-02-11T07:19:32.464+0000","up_votes":3,"down_votes":0,"body":"Yo me niego a perder iconos, perdi 2 iconos en toda mi vida desde season 2, y me niego a perder otro mas, no llegan a dar ni la mas minima probabilidad de adquirirlo y me voy a jugar dota. en mi vida no conseguir iconos es un pecado y la 3ra es la vencida,","replies":[{"poster":"Runth","date":"2016-02-11T07:22:40.221+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Proyecto Support,realm=LAS,application-id=v7qsfXsE,discussion-id=rLjuARx5,comment-id=0005,timestamp=2016-02-11T07:19:32.464+0000)\n>\n> Yo me niego a perder iconos, perdi 2 iconos en toda mi vida desde season 2, y me niego a perder otro mas, no llegan a dar ni la mas minima probabilidad de adquirirlo y me voy a jugar dota. en mi vida no conseguir iconos es un pecado y la 3ra es la vencida,\n\nyo perdi el icono del evento de lissandra y lo peor aun , el bosque retorcido\n\nahora perdere el de dominio q ahi mi cuenta esta de bajaen Na negando migrarla, vaya pena q me da","replies":[]},{"poster":"Aurum Ataraxia","date":"2016-02-12T06:41:02.872+0000","up_votes":1,"down_votes":0,"body":"Como ya dije en mi post (esto no es spam (ಠ_ಠ)﻿ ) la única forma de conseguir ese icono para nosotros y pagar la transferencia de servidores, irónicamente tendríamos que pagar, jugar 100 partidas y volver a pagar, me parece un poco injusto a mi también. Saludos ;D","replies":[]}]},{"poster":"Irania","date":"2016-02-11T03:29:42.307+0000","up_votes":3,"down_votes":0,"body":"A mi tmb me gustaba, pero desde que me pasé a LAS murió Dominion. Por eso nuestros números de juego en ese modo no crecieron más e.e","replies":[]},{"poster":"DynamicLegends","date":"2016-02-11T01:05:25.981+0000","up_votes":4,"down_votes":6,"body":"49 wins tienes en dominion, a comparación de tus 1538 en normales eso es un 3% aprox. En serio te importaba dominion? por favor, no seamos hipócritas tampoco, te creería si tuvieras por lo menos 300. \nAcá es donde va la frase \"no sabes lo que tienes hasta que lo pierdes\".\nPor cierto no entiendo porque tanto alboroto por un icono, ¡UN ICONO! algo que, en mi opinión, tiene importancia 0 en el juego.","replies":[{"poster":"PepitoLosPalotes","date":"2016-02-11T01:22:48.933+0000","up_votes":6,"down_votes":3,"body":"La respuesta es fácil, y respondo con otra pregunta:\n¿Cómo esperas que ese número sea más grande si no lo puedo jugar en el servidor en el que estoy?\n\nEspero una respuesta decente.","replies":[]},{"poster":"Darkdbgt","date":"2016-02-12T04:17:02.969+0000","up_votes":1,"down_votes":0,"body":"él quizá gano la mayoría de esas partidas en LAS, no te da la cabeza para pensar?","replies":[]},{"poster":"Aurum Ataraxia","date":"2016-02-12T06:46:51.785+0000","up_votes":1,"down_votes":0,"body":"Te invito a pasar por este post que hice recientemente, porque no me alcanza el coraje de escribirlo denuevo. Es solo para que te hagas una idea de la verdadera molestia de la gente y que no es solo por el icono. Saludos ;D\n[Dominion en LAS y LAN](http://boards.las.leagueoflegends.com/es/c/torneos-y-eventos-de-la-comunidad/T3AfHv6i-dominion-en-las-y-lan)","replies":[]}]},{"poster":"Selah","date":"2016-02-11T00:09:04.148+0000","up_votes":2,"down_votes":1,"body":"Es nada mas que un icono, pero los servers que sí tienen las colas de Dominion, tenían que esperar mucho tiempo para entrar a una partida (algunos incluso llegaron a esperar mas de 1 hora).","replies":[]},{"poster":"5UP Sylar JackER","date":"2016-03-02T13:27:37.551+0000","up_votes":1,"down_votes":0,"body":"[IMAGEN](https://scontent-gru2-1.xx.fbcdn.net/hphotos-xlf1/v/t1.0-0/s480x480/12814775_10208787183940120_5678771444421763205_n.jpg?oh=9cc1272c893d1ee12d124dd529ae878a&oe=576A26F6)\njeje","replies":[]},{"poster":"5UP Sylar JackER","date":"2016-03-02T13:26:39.342+0000","up_votes":1,"down_votes":0,"body":"[IMAGEN](https://scontent-gru2-1.xx.fbcdn.net/hphotos-xlf1/v/t1.0-0/s480x480/12814775_10208787183940120_5678771444421763205_n.jpg?oh=9cc1272c893d1ee12d124dd529ae878a&oe=576A26F6)\njeje","replies":[]},{"poster":"Braay","date":"2016-02-12T04:17:59.400+0000","up_votes":1,"down_votes":0,"body":"Macri nos privatizó el icono de Dominiom :C","replies":[]},{"poster":"JuanGuz","date":"2016-02-10T22:00:24.036+0000","up_votes":1,"down_votes":0,"body":"Solo se podía jugar en personalizadas, pero la gente juega a un \"modo inventado\" llamado las escondidas, cosa que le saca lo que es verdaderamente el modo de juego de Dominion. Pude jugar un par de partidas en NA antes de que abriera el server de LAS y me parecía un modo muy estratégico y de un buen trabajo en equipo.","replies":[{"poster":"PepitoLosPalotes","date":"2016-02-10T22:08:44.235+0000","up_votes":1,"down_votes":1,"body":"**Y tenía una [bonita explosión del Nexus](https://youtu.be/H8AdHrdl_2c?t=1589), me gusta más que la actual de Summoner's Rift.**","replies":[]}]},{"poster":"Ufaaaaaaaaaa","date":"2016-02-10T21:55:02.817+0000","up_votes":1,"down_votes":0,"body":"LAS pls.","replies":[]}]}