{"poster":"LIN","date":"2015-03-12T19:33:12.015+0000","title":"Random LoL Moments meist gezeigten Champions","subforum":"Champions & Gameplay","embed":{"description":"Liked the video? Click here to subscribe! http://bit.ly/mDwCBX. You can submit your plays to randomlolmoments@machinima.com. Your email should include the LoLReplay file (.lrf), a youtube video of the play and your player name. This is the first video of a series which shows you some random skillfull funny moments from League of Legends.","url":"https://www.youtube.com/watch?v=XaHRfqA6N9g&list=PLRILbAMFFjpzCLaBIdQd9ny1FWqc0cK7F","image":"http://i.ytimg.com/vi/XaHRfqA6N9g/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Ich schaue mir gerne Random LoL Moments an. Es ist teils richtig witzig was in ein LoL Match alles passieren kann. \r\nNach 326 Folgen kann ich zur recht behaupten das ich einiges gesehen habe. \r\nMir ist dabei auf gefallen das einige Champion ständig auftauchen. Von allem wenn es darum geht Penta Kills einzusammeln, aus diversen Situationen zu entkommen oder einfach nur richtig ein Gegner komplett zu vernichten ohne ein Kratzer.  \r\n\r\nDie Rede ist hier von {{champion:105}} {{champion:55}} {{champion:7}} {{champion:64}} {{champion:76}} {{champion:121}} {{champion:92}} {{champion:67}} {{champion:157}} {{champion:238}} \r\n\r\nAlles Assassinen mit sehr viel Schaden und hohe Mobilität. Sie springen schnell ins Kampf, verursachen massiv Schaden und entfliehen wieder ohne ein Kratzer. Natürlich, sie haben auch Schwächen, und zwar halten sie nicht viel aus. Aber wer braucht schon Leben bzw Rüstung wenn man sie gar nicht trifft. Die meisten von ihnen kann man kaum einholen weil sie so ein oder sogar zwei starken disengage Fähigkeiten haben.\r\nIch habe zwar gelesen das sie genau so designt wurden ( Viel Schaden, Mobilität, wenig Leben) \r\nWenn man ihnen keine Mobilität gibt dann sind sie komplett nutzlos weil sie nichts aushalten. \r\nAber trotzdem finde ich sie ziemlich mächtig gegenüber andere Champions.  Ihre Cooldowns sind teilweise sehr kurz. Sie können innerhalb von wenige Sekunden ganz weit weg sein und nach 5 Sekunden noch mal wegspringen.  \r\n Natürlich hat jeder Champion eine Rolle. Die Tanks tanken, die Supports Supporten, die Kämpfer kämpfen. Aber trotzdem scheinen sie mir besser zu sein. \r\n\r\nIch würde gern euer Meinung hören. Sind die Assassinen etwas stark?  \r\nCooldown zu niedrig? Engage und Disengage zu viel Reichweite?\r\nBräuchten wir mehr Items die zb  ihre Mobilität zu senken, oder sie kurz zu schweigen zubringen? \r\nFalls ihr sie okay findet. Wieso?","replies":[{"poster":"LIN","date":"2015-03-16T19:49:23.220+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=kMs2BvIvqFY\n\nSchaut euch {{champion:7}} an und sag mir wie man sie je einholt?","replies":[]},{"poster":"LIN","date":"2015-03-13T17:54:35.597+0000","up_votes":1,"down_votes":0,"body":"Ich wünschte ich könnte mehr mit andere Champions. Aber manche Champions haben nun mal Limit. Egal wie gut ich zb {{champion:86}} spiele, ich kann kein verrückten Outlplays durchführen. \nUnd high risk high reward ist wenn ich mit {{champion:1}}  auf 5 Feinde zuflashe und alle Stune und nicht mehr einfach wieder raus kann. Aber ich weis ja nicht. Ein klick rein und ein Klick wieder raus ist etwas low risky oder?  {{champion:7}} {{champion:238}}  zb brauchen nur ein Knopf drücken und schon sind sie wieder ganz weit weg von Schlachtfeld.\n\nWenn ein {{champion:51}} bedrängt wird dann kann sie E benutzen um etwas Distanz zu schaffen. {{champion:67}}  kann dem Feind weg Schießen, sich selbst wegrollen, Feind verwirren indem sie kurz unsichtbar wird.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-03-12T22:21:09.393+0000","up_votes":1,"down_votes":0,"body":"Nun ja... gerade bei Lee Sin ist natürlich immer die Frage: Wird er der Held des Videos oder der totale Trottel sein? Und wenn du dir auf Twitch mal Bronze Streams anguckst... ist die allgemeine Reaktion der Zuschauer: \"Wer hat Lee Sin? Ok, der wird verlieren\"...\n\nKlar, wenn man diese Champs beherrscht, sind sie richtig stark... aber hey, es gibt da auch ein Video, in dem die alte Karma 2 Champs vorführt... wenn man den Champ beherrscht, geht das auch...\n\nFür mich sind das alles High Risk High Reward Champs. Und man braucht halt richtig Skill (auf dem Champ) um ihn zu beherrschen... und ja, ich bin nach 5 Jahren LoL immer noch einfach zu dumm, eine Kata oder einen Zed effektiv zu nutzen und kann ums verrecken keine Assassinen Spielen...\n\nOh und nur so am Rande: Abgesehen von Kata haben alle Champs, die du hier als allgemein OP darstellst, gerade eine recht bescheidene Win Rate... Riven ist da mit 50,01% die einzige im Positiven Bereich... Lee Sin und Zed hängen gerade bei 46% rum... Wie gesagt: Man muss sie halt richtig beherrschen... wir picken alle Zed oder LeBlanc und träumen von Bjergsen oder Faker-Plays, die meisten von uns landen aber nur im Random Moments Video als Beispiel, wie man es nicht machen sollte...","replies":[]},{"poster":"Wekra","date":"2015-03-12T22:07:04.601+0000","up_votes":1,"down_votes":0,"body":"Gegen Assasinen helfen ganz einfach ein Exhaust und ein Stun..wenn ein Zed reinspringt, aber sein Opfer nicht töten kann weil er entweder zu greedy ist, oder weil er erschöpft wurde, oder weil eine Leona poplig mit der Q daneben steht (peeling) dann machen die Assasinen auch nicht mehr viel, außer ausradiert zu werden","replies":[]},{"poster":"erzi222","date":"2015-03-12T22:00:32.402+0000","up_votes":1,"down_votes":0,"body":"riven ist so gut wie IMMMER jeden tag dabei ........ echt langweilig.","replies":[]}]}