{"poster":"Artax92","date":"2015-04-15T11:28:57.563+0000","title":"Legale regalarsi skin con un account di livello 10?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"con le nuove regole la riot consente a chiunque abbia un account di livello 10 o superiore di fare regali come skin, champion icone, ecc visto che ogni account di partenza ha 400 rp e ci si impiega circa 1 sett per portarlo a livello 10 vorrei sapere se &egrave; legale creare account fittizi per regalarsi skin inferiori a 400 rp o in saldo. Cio&egrave; questa scelta pensate sia stata voluta dall riot consapevole di ci&ograve; o &egrave; un inculata che la riot vuole sfruttare per bannare?","replies":[{"poster":"Judge Drakoo","date":"2015-04-15T11:48:40.482+0000","up_votes":2,"down_votes":1,"body":"Non abbiamo nessun vantaggio a bannare i nostri giocatori, in un mondo perfetto tutti seguirebbero le regole e non ci sarebbe bisogno di ricorrere a punizioni.\n\nMi risulta che i 400 RP che ricevi non siano utilizzabili per fare regali, e con questo intendo che sono proprio bloccati dal sistema.","replies":[{"poster":"Sventura","date":"2015-04-15T14:19:30.071+0000","up_votes":2,"down_votes":0,"body":"Judge, non avete nessun vantaggio a bannere i giocatori?, no, ma a levare skin e contenuti si vero?, d'altronde, un cliente che non ha nulla può sempre spendere... , un cliente uscito dal gioco invece va ad aiutare la concorrenza... giusto? ;)","replies":[{"poster":"Nibbio Bianco","date":"2015-04-15T14:33:41.857+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sventura,realm=EUW,application-id=MJVj50Jw,discussion-id=rMhFPa6E,comment-id=00010001,timestamp=2015-04-15T14:19:30.071+0000)\n>\n> Judge, non avete nessun vantaggio a bannere i giocatori?, no, ma a levare skin e contenuti si vero?, d'altronde, un cliente che non ha nulla può sempre spendere... , un cliente uscito dal gioco invece va ad aiutare la concorrenza... giusto? ;)\n\nPensano al loro tornaconto come tu pensi al tuo. Mi sembra una cosa normale.","replies":[]}]},{"poster":"Artax92","date":"2015-04-15T12:16:47.643+0000","up_votes":1,"down_votes":0,"body":"beh la mia considerazione è stata fatta visto che in viviamo un mondo non \"perfetto\" ma dove \"fatta la legge trovato l'inganno\" e visto che il post uscito un paio di giorni fa non citava un eventuale abuso del servizio, mi ha fatto pensare o  voi avevate messo in conto una cosa del genere oppure  era un modo per beccare i cosiddetti \"furbetti\". Lo svantaggio qui nasce dal fatto che magari per skin un pò vecchiotte voi rischiavate di non ricavare nessun € con questo sistema, politica un pò discutibile dopo la scelta della riduzione degli RP tutti qui.","replies":[]}]},{"poster":"ChèckMate","date":"2015-04-16T13:13:36.822+0000","up_votes":1,"down_votes":0,"body":"Quindi non è legale regalarsi skin inferiori a 400 rp sul main account usando i rp degli smurf. Pena la perdita delle skin o ban. Giusto?","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-04-15T17:29:58.103+0000","up_votes":1,"down_votes":1,"body":"Puoi anche farti 5 account lv 15 e regalarti 2k di rp, credo che non sia bannabile.\nTipo un gamekit usi il tempo al posto del denaro.\n\nPerò non dai sostegno alla riot, non aiuti, e come se stessi imbrogliando, vele la pena spenderli in soldi <3.\n","replies":[{"poster":"UnknownEV","date":"2015-04-16T10:58:04.595+0000","up_votes":1,"down_votes":0,"body":"Poi non lamentarti se ti tolgono skin o altro, per aver abusato del sistema ;)","replies":[]},{"poster":"DragonFuryV","date":"2015-04-15T18:46:36.295+0000","up_votes":1,"down_votes":0,"body":"c'è gente onesta e gente disposta a tutto per ottenere quello che vuole\nanche se hai ragione secondo me, il secondo tipo di persone esisterà sempre","replies":[]}]},{"poster":"DragonFuryV","date":"2015-04-15T17:04:40.717+0000","up_votes":1,"down_votes":0,"body":"Il consiglio migliore di tutti: \nFatti sto autoregalo e sbattitene XD","replies":[]},{"poster":"Menfrix","date":"2015-04-15T11:52:53.141+0000","up_votes":1,"down_votes":0,"body":"È un raggiro nei confronti della riot, d'altronde il sistema si chiama recluta un amico, dunque nuovi players.","replies":[]},{"poster":"Nibbio Bianco","date":"2015-04-15T11:47:11.934+0000","up_votes":1,"down_votes":0,"body":"no","replies":[]}]}