{"poster":"The Charming One","date":"2016-09-05T12:16:19.117+0000","title":"Xerath and abyssal scepter","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"(Not a native speaker) So today, I played a howling abyss{{item:3001}}  match game. There was a Xerath{{champion:101}}  in our team. He built abyssal scepter, and I said I don&#039;t think Xerath needs that. He said I am stupid (WTF???).\r\n\r\nOur team has kat, fizz, twitch, xerath and maokai.{{champion:55}} {{champion:105}} {{champion:101}} {{champion:29}} {{champion:57}} \r\nEnemy team has fiddle, Jarvan, Sona, graves and viktor.{{champion:9}} {{champion:59}} {{champion:37}} {{champion:104}} {{champion:112}} \r\n\r\nI don&#039;t mind if some more people say I am stupid. But I really want to know it. Because I think I am a good builder for building items (grammar.lol~~XD).\r\nWhy do Xerath buy a item while the aura is smaller than his ability ranges?\r\nWhy do Xerath need that while there is no assassins in enemy team? (he is not a small range mage like Diana{{champion:131}}  to be able to get damaged by fiddle&#039;ult)\r\nFor magic penetration?? Then Liandry&#039;s Torment {{item:3151}} is better!! (He got Sorcer shoes, morellon, deathcap, void staff, and abyssal scepter{{item:3020}} {{item:3165}} {{item:3089}} {{item:3135}} {{item:3001}} {{item:3108}} )","replies":[{"poster":"Essembie","date":"2016-09-06T20:32:08.817+0000","up_votes":1,"down_votes":0,"body":"I would never use on xer bc xer should not be close enough to fight for aura to take effect.\n\nBut it is aram. Chill pills required all round. ","replies":[]},{"poster":"Requiemsfire","date":"2016-09-06T13:00:17.357+0000","up_votes":1,"down_votes":0,"body":"There is nothing wrong with abyssal scepter as a mage item. Magic resist, AP and CDR are all stats Xerath can use.","replies":[]},{"poster":"Nijel","date":"2016-09-06T02:04:12.596+0000","up_votes":1,"down_votes":0,"body":"It comes down to personal preference really.\n\nI would never buy Abyssal on a ranged mage on ARAM. Considering that many matches are an arms race (especially when a comp like theirs could be built pure damage) taking the time to build something defensive probably won't save you if they get on top of you or allow you to poke as hard as you need to be to **stop** them from getting on top of you _in the first place_. If anyone bought one it would be Maokai (or Kat or Fizz) who can get full effectiveness from all it's aspects, even if it might not offer enough survivability. Lastly, I wouldn't have bothered with Liandry's either, opting for a Seraph's Embrace rush, Zhonya's and potentially Luden's echo. But hey, it's aram so let people do whatever they want. It's more fun that way.","replies":[]},{"poster":"idc","date":"2016-09-06T01:36:30.317+0000","up_votes":1,"down_votes":0,"body":"Fiddlesticks, Sona and Viktor are very high magic damage champions, so having that Abyssal Scepter helps by giving Xerath some defensive stats in the magic resist, but also gives him CDR which is really good for Xerath too.\n\nJust because he isn't always in range for the aura doesn't mean it's a useless item on him. It definitely works. Plus champions like Viktor and Fiddlesticks have to get quite close to get a majority of their damage out, so the aura would most likely work in those cases.\n\nI think you need to stop giving people in ARAM build advice cos it doesn't seem like you know much about items and their effectiveness on certain champs, as much as you think you do.","replies":[]},{"poster":"QAPLA","date":"2016-09-05T22:24:25.198+0000","up_votes":1,"down_votes":0,"body":"Magic res, cooldown reduction, there's more to {{item:3001}} than just the aura.\n\nIt's usually the people on the team doing poorly, trying to give advice to those already carrying. Hey I'm 3/12 and you're 15/4 so let me tell you how to play.","replies":[]},{"poster":"xDarkRavenx","date":"2016-09-05T14:59:54.956+0000","up_votes":1,"down_votes":0,"body":"Well for one, who are you to question what people build in a gamemode played purely for fun. (I think)\n\nI'm speculating that he's worried about Viktor's burst so he built an Abyssal Sceptre for the Magic Resist.","replies":[]}]}