{"poster":"JustBoneBrook","date":"2015-11-24T23:22:58.886+0000","title":"Poppy art feedback","subforum":"Story, Art, & Sound","up_votes":6,"down_votes":0,"body":"Hi Riot and every one, \nI there to said what i think about poppy new art:\nhttp://4.bp.blogspot.com/-qhkARaVpWfc/VlTE0LZM60I/AAAAAAAA1PY/J4bs0Bzr5tw/s1600/Poppy_Splash_0.jpg\n\n#1 I LOVE her new Splash art really well done.\n\n#2 good concept\n\n#3 I REALLY REALLY Find her head too big in game (even for a yordle) Could you reduce her head size ... or make her body taler a bit?\n\nFinally I like it in general \n{{sticker:slayer-pantheon-thumbs}} \nGOOD JOB\nSORRY FOR THE BAD ENGLSIH","replies":[{"poster":"Passionlip","date":"2015-11-25T17:52:11.171+0000","up_votes":1,"down_votes":0,"body":"I love those eyes, they make me feel ready to go on an adventure.\nDo you people think she would like to have a companion in her journey?","replies":[]},{"poster":"JustBoneBrook","date":"2015-11-25T00:27:09.189+0000","up_votes":1,"down_votes":0,"body":"Oh yah and it a bit weird how the shild look (magic shild? or woodend shild i just dont got what it is)","replies":[]},{"poster":"Arcane Azmadi","date":"2015-11-25T00:03:08.865+0000","up_votes":1,"down_votes":0,"body":"I like it a lot (although in her ability preview videos she looked BIZARRELY big next to humans like Draven and Katarina, probably because of the head size you mentioned) but I'm a bit bothered by the bizarrely oversized snaggletooth. The Cute LIttle Fang trope is all very well, but it makes her look like a vampire yordle that's been punched really hard on one side of her face.","replies":[]},{"poster":"GetMariahCarried","date":"2015-11-24T23:54:41.659+0000","up_votes":1,"down_votes":0,"body":"I could have sworn when I clicked this thread, I was gonna be assaulted with the usual \"\\*\\*\\*\\* Rito I hate their new \\*\\*\\*\\* artwork, fire your dev team and quit touching my stuff\" classic nostalgia-bent community response to VU's... ya know, those things that required painstaking efforts from highly-skilled artists who've likely spent most of their lives honing a passion for visually expressing beloved qualities of stories/characters/places... whether those happen to be the EXACT qualities beloved by some people... people that the moment they see just ONE feature missing or out of place, freak out and unleash the most spirit-crushing verbal assault they can possibly concoct without any thought or consideration to whether such a reaction fits the situation.\n\nSorry for the unending sentence, but I was on a roll.\n\nIn short: Glad I could actually upvote! You don't have to complement artwork to be constructive. All you have to do is not be a totally irrational ass when providing an assessment, and either a) not stupid-aggressively assert your opinion or b) not ignore 90% of relevant details if you DO aggressively assert your opinion. Complement or not, whether I like Poppy's new artwork or not (I do btw), the OP pulled this off, and fairly easily.","replies":[]}]}