{"poster":"AhmCha","date":"2016-05-15T08:40:58.189+0000","title":"Fans from NA who shit on NA","subforum":"Esports","up_votes":94,"down_votes":21,"body":"you guys are a cancer to North American e-sports.\n\nSeriously some of the posts I&#039;ve been seeing seconds after the games ended, you&#039;d think you&#039;re all from EU, and just transferred your accounts. Is it really so difficult for you to acknowledge that CLG defied the odds and gave a performance to be proud of? Or do you not want our region to grow at all? \n\nI know I&#039;m gonna get flamed and downvoted for this, but I had to get it off my chest. NA &quot;fans&quot; are one of NA&#039;s biggest obstacles to growing as a competitive scene.\n\nEDIT: After reading some of the more reasonable responses to my words, I have a few things I'd like to add to this post so as to not generalize. \n\n1. I think it's perfectly OK to have your favorite team be in a different region. I'm personally always rooting for a different team in every region. CLG for NA, OG for EUW, SKT for KR, etc. I think the problem arises when people in our region actively bash our competitive scene, as it harms the local reputation of the NA LCS and discourages investment in it from possible sponsors and fans. \n\n2. Many people seem to forget that despite their rocky start in the group stages, SKT are the best team in the world, possibly the best team of all time, and CLG gave them a fight. Yes, running the same comp twice was dumb and running Poppy into Trundle twice even made me facepalm, but even though they got 3-0'd, it wasn't a steamroll like the last game of worlds last year, or even some of the RNG vs. SKT games. \n\nThat's all for now. ","replies":[{"poster":"FrankerX","date":"2016-05-15T08:47:48.676+0000","up_votes":7,"down_votes":2,"body":"its normal for fans to be \"salty\" :D\ni mean overall eu always performed better than na and im in both boards so i can tell you, its not better at all. in worlds when og and fnc both lost in semi finals, the boards got spammed with stuff like \"even wildcards or na would have done better\" its just human nature. sadly.","replies":[{"poster":"AhmCha","date":"2016-05-15T08:53:11.510+0000","up_votes":13,"down_votes":2,"body":"That I won't contest, however I think it's the context in which this salt has me so ironically salty. \n\nEUW has always been an impressive region in it's own right, whereas NA has...struggles to say the least. \n\nThis season saw us come further than we ever had, going toe to toe with the best teams in the world and making it to the finals of a major international event against the greatest League of Legends team of all-time, and refusing to go down without a fight, and that still isn't good enough for our inner tumors to acknowledge that we've grown, and that this performance could inspire a major growth in our competitive scene as well. I know haters will always hate, but I just felt the need to openly hate them back.","replies":[{"poster":"VasilisGreen","date":"2016-05-15T18:39:03.940+0000","up_votes":2,"down_votes":3,"body":"well, this problem roots to your mindset as players. I haven played in your region and probbably never will but because of some, or more likely, most of the players' attitude and play, they made NA a living meme and i think it's bad. Very bad. I've never seen a group of people bash on themselves and dig their own wholes like that. it's sad.\nWhy are you guys doing this?","replies":[{"poster":"ahferroin7","date":"2016-05-16T01:15:01.337+0000","up_votes":1,"down_votes":1,"body":"I have to agree.  I live in the US and have seriously considered multiple times moving my account to another region (and probably would have by now if it weren't for the fact that I'm never going to convince any of my friends to do so).  You get try-hards and people who refuse to take responsibility for their own mistakes in every region, but the worst I've seen are on the NA servers (I have a lot of friends on other games who play on other servers, we have a running challenge that if any of them can manage to top the stories I have of jerks from the NA servers, I'll switch to their region just to friend them and send them a legendary or ultimate skin of their choice, so far, this has never happened).\n\nI think most of it though is the culture here in the US.  A significant majority of people are raised as entitled brats with no sense of responsibility, and that attitude carries over into adulthood for a lot of people.","replies":[{"poster":"VasilisGreen","date":"2016-05-16T03:38:01.917+0000","up_votes":1,"down_votes":1,"body":"Look, about switching to other regions... where? EU? It will be unplayable, you will be stomped even by beginners for a simple reason. Ping... on EU, your ping will easily be about 200, you can't play on 200 ping. what other regions? KR? I think you can't play in KR unless you are Korean citizen or something, the game there is not run by riot. Same goes for china. The only other option is a south American server, like Brazil. You really don't have to change region.\nPersonaly, i switched servers, but i already was EU. I got from EUNE to EUW, and honestly, i am happy that i did. I didn't care if my irl friends would follow. You play this game for YOU above all else.\n\nAbout jerks, i think EUNE is worse. Also, the word \"tryhard\"  is missunderstood and misused. It's good to be a tryhard in Ranked and even in a normal game when you practice a champion because you want to improve. It's not ok to tryhard in a fun gamemode tho...\n\nBut the worse thing about a player is the fact that they preffer a champion to get nerfed, rather than work their ass off and learn how to play against it or ever practice their own champions more... But i think this is common to all regions","replies":[{"poster":"CR4ZYRONDH4VI","date":"2016-05-16T05:38:00.646+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VasilisGreen,realm=EUW,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=00030000000000000000,timestamp=2016-05-16T03:38:01.917+0000)\n>\n> Look, about switching to other regions... where? EU? It will be unplayable, you will be stomped even by beginners for a simple reason. Ping... on EU, your ping will easily be about 200, you can&#x27;t play on 200 ping. what other regions? KR? I think you can&#x27;t play in KR unless you are Korean citizen or something, the game there is not run by riot. Same goes for china. The only other option is a south American server, like Brazil. You really don&#x27;t have to change region.\n> Personaly, i switched servers, but i already was EU. I got from EUNE to EUW, and honestly, i am happy that i did. I didn&#x27;t care if my irl friends would follow. You play this game for YOU above all else.\n> \n> About jerks, i think EUNE is worse. Also, the word &quot;tryhard&quot;  is missunderstood and misused. It&#x27;s good to be a tryhard in Ranked and even in a normal game when you practice a champion because you want to improve. It&#x27;s not ok to tryhard in a fun gamemode tho...\n> \n> But the worse thing about a player is the fact that they preffer a champion to get nerfed, rather than work their ass off and learn how to play against it or ever practice their own champions more... But i think this is common to all regions\n\n Lol yeah the \"tryhard\" thing always makes me laugh. Like yeah, I'm trying to win the ranked game, so i guess that makes me a tryhard then lol. If so then I'm fine with that lol","replies":[]}]}]},{"poster":"Shenmue","date":"2016-05-16T13:07:25.054+0000","up_votes":1,"down_votes":0,"body":"because in reallity we don't give a damn flying phuck about league lol its not our lives hahahahaha EU = no lives gamers","replies":[]}]}]},{"poster":"kaltenashes","date":"2016-05-15T18:14:13.390+0000","up_votes":4,"down_votes":1,"body":"well, g2 ended split with 15-3 and did horrible in msi\nclg at least was able to comeback from games\n\nin this tournament, na>eu","replies":[{"poster":"FrankerX","date":"2016-05-15T19:20:06.991+0000","up_votes":4,"down_votes":1,"body":"i expected this, after all they are a new team and their agressive strat could never work on international stage. im still glad they went to msi, they learned something and hopefully they can do better at worlds now.","replies":[]}]}]},{"poster":"Nahui","date":"2016-05-15T16:49:43.062+0000","up_votes":10,"down_votes":2,"body":"Just because I'm from NA doesn't mean I have to support NA at all. I've loved SKT for about 3 years now. Although I'm not saying NA is trash, since CLG made it far, I will happily say they are not on the level of Korea and rather nowhere near. \n\nNow, if you're referring to NA fans shitting on NA, yeah that sucks dick. I personally interpreted it as \"Fans from NA\" as in fans of other teams but are in NA, hence voting for the \"Wrong\" team, but the former is probably correct. Fans should never shit on their own team. Displeased, sure. Don't need to be obligated to be proud of CLG and all humble, but at least not call them trash.","replies":[{"poster":"AhmCha","date":"2016-05-15T18:20:03.163+0000","up_votes":3,"down_votes":1,"body":"I of course don't believe you're under any obligation to support NA, and hell man, I love SKT too, how can you not? It just bothers me that we've really grown as a region so far this season, and CLG's performance could inspire growth in the scene as a whole, forcing TSM, C9, and IMT (who, admittedly, probably would've been in CLG's place here if they hadn't trolled the semifinals), to grow now that we've shown what an NA team is capable of, and these salt piles still have to try to diminish their accomplishment. ","replies":[]}]},{"poster":"Muted Summoner","date":"2016-05-15T08:43:29.705+0000","up_votes":6,"down_votes":22,"body":"How the hell was that final performance something to be proud of? Them getting there was amazing. the finals was horrible. Losing is one thing but losing like that? Holy shit that was bad.","replies":[{"poster":"Shadowatom","date":"2016-05-15T08:53:38.843+0000","up_votes":16,"down_votes":2,"body":"But saying they're shit is like saying ROX is shit for losing in the LCK final. They beat literally everyone except Korea (and technically China), you can say they sucked during the final, but saying they're the worst in the world again because they lost to the best team in the world is stupid.","replies":[{"poster":"VasilisGreen","date":"2016-05-15T18:35:02.501+0000","up_votes":2,"down_votes":0,"body":"None said that CLG is the worst... Do you remember season5 worlds when ThrowSeriousMatches was the world's punching bag? CLG is  a good team. But what they did today in game 2 was at least humiliating. They humiliated themselves with that cocky attitude. Let's not forget that for Managers and sponsors, this is still just Bussines. So, i wouldn't be surprised if i see big roster changes next season or even next split...\n\nLosing is one thing, but losing in that manner is something else...\n#NotLikeThis","replies":[]}]}]},{"poster":"Flagrock","date":"2016-05-15T17:29:24.391+0000","up_votes":3,"down_votes":0,"body":"It might be cool that a team from NA got to the finals, but not everyone in NA enjoys CLG. \n\nIf you look at the team, and organization as a whole, there is a lot of reasons why people from NA would not support CLG. Yes, they might be good players, but that's like saying everyone should support Tom Brady because he is a good player. If you look at the team's history and actually care about FAIR and competitive e-sports, CLG is not a good team to hold up to represent NA as a region. They have been penalized not once, but THREE times for breaking LCS rules when they attempted to poach Zionspartan (Darshan) and Scarra from other LCS teams, AND account sharing while in Korea (admittedly it was partly Riot's fault, but at the same time account sharing is NEVER allowed). So, why should a NA fan be happy with a team that has a history of competitive issues with breaking the rules? I don't support CLG because of their history of blatantly violating the rules for LCS. NO other LCS team has had this many issues with breaking the rules. \n\nSo yeah, CLG did well in an international competition. Yes, they are from NA, but that doesn't mean people think CLG as an organization or a team supports or represents the values of the NA region. I don't know about you, but I do not endorse teams that have a history of breaking the rules to represent the NA region and represent the NA values.","replies":[]},{"poster":"Randomonium","date":"2016-05-15T17:43:11.513+0000","up_votes":2,"down_votes":2,"body":"Haters are going to hate. I love when people talk about bad pros are (in any sport) when those pros could beat their salty fans with one arm tied behind their back and blindfolded. Its like \"If the pros are trash then what are you?\"","replies":[{"poster":"Colombo16","date":"2016-05-15T22:09:15.193+0000","up_votes":2,"down_votes":1,"body":"Lol but we're not pros are we? When people say pros are bad, it's usually in comparison to other pros. Everyone below masters (and maybe high diamond) is bad at the game, we all know that and no one pretends to be better than the pros, but comparing the pros between each other? That's fair game: can you objectively say that huhi isn't bad compared to faker?","replies":[{"poster":"Randomonium","date":"2016-05-15T23:05:30.143+0000","up_votes":1,"down_votes":1,"body":"What I'm saying is you shouldn't disrespect someone who is far better at something than you.  It makes you look incredibly pathetic, like one of those obese NFL fans who complain that their wide receivers aren't fast enough.  Its like \"dude, when was the last time you were able to touch your toes let alone run a 100 yard dash.\"\n\nYou get the same idiots who call UFC fighters pussies.  If you wouldn't say it to the person's face then you shouldn't say it period.  If you met Huhi would you say \"wow, you're trash compared to Faker.\"  I sure hope not because you'd look like a complete fool if you did and he probably wouldn't stop laughing at you.\n\nAll I'm asking is people stop being two-faced.","replies":[{"poster":"IronwallJackson","date":"2016-05-16T06:13:59.620+0000","up_votes":2,"down_votes":1,"body":"That's basically the \"why don't you do better\" argument, which is basically never valid. If someone looks poor when compared to their peers and someone who is worse criticizes them, their points aren't made any less true because of it.\n\nOr, in other words, just because I'm bad when compared to the players from, say, C9, doesn't make them not bad when they're compared to SKT.","replies":[{"poster":"Randomonium","date":"2016-05-16T10:00:17.560+0000","up_votes":1,"down_votes":0,"body":"Not at all.\n\nIts fine to criticize people but you shouldn't be disrespectful about it.  Basically, you shouldn't say something that you wouldn't say to the person's face.  That's just two-faced and cowardly.","replies":[{"poster":"Colombo16","date":"2016-05-16T10:10:41.196+0000","up_votes":1,"down_votes":1,"body":"Let me get this straight: if I have the courage to go to huhi's face and tell him that he's bad compared to faker, does that make it ok for me to say it on the boards? Honestly, I would say it to his face, and if he laughed, I'd be laughing right back at him since I said nothing that wasn't true. There is nothing disrespectful about saying that a pro is bad compared to another pro (comparing him to yourself however is a different matter) and let's be real, they chose this job, they should be prepared to be criticized. Just look over at EU and G2: they went into MSI with no practice and finished 5th, they've just lost a lot of respect from  the eu fans and are rightfully being criticized.","replies":[{"poster":"Randomonium","date":"2016-05-16T10:15:46.080+0000","up_votes":1,"down_votes":0,"body":"I don't think most people would say the stuff they say on the boards in real life.  People have a whole lot of \"internet courage\" and its really pathetic.\n\nIf you're one of the few who would then I definitely have more respect for you that most.  That said, I still don't think you should be disrespectful to anyone, let alone a pro who is far superior to you.  Its fine to be critical but disrespect is never justified.","replies":[{"poster":"Colombo16","date":"2016-05-16T10:20:08.745+0000","up_votes":2,"down_votes":0,"body":"People confuse being disrespectful to giving an opinion. What's disrespectful about saying a pro is better than an other if it's backed up by facts? I don't think saying faker is better than huhi is being disrespectful, do you? It's just an honest opinion (that some could consider fact) and is not disrespectful towards huhi. It's just criticism of his play, and it's exactly that criticism that pushes people to push themselves to be better. If you're not motivated by criticism, then I don't know what can motivate you more than proving people wrong and going and winning a trophy.","replies":[{"poster":"Randomonium","date":"2016-05-16T11:05:30.006+0000","up_votes":1,"down_votes":0,"body":"Yeah, that's perfectly reasonable.  If you say something like \"he frequently mispositions in team fights and doesn't roam as often as he should\" then that is a valid criticism that is actually constructive.  However, most people don't say that.  Most people say \"he's garbage\", \"he's trash\", \"I'm better than him\", \"he doesn't deserve to be on a LCS team\", etc, etc, etc.  That's not criticism, that's disrespect.\n\nIts very similar to people raging in game.  Calling your teammates trash and telling them to stop feeding is not criticism, its disrespect.  You aren't helping them, you are just being an ass.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Mai Waifu Irelia","date":"2016-05-16T08:49:40.767+0000","up_votes":2,"down_votes":0,"body":"You're calling people cancer for shitting on their own region?\nWho the fuck do you think you are to judge people on voicing their opinions about their own region? (Which are generally true anyway but that isn't the point).\nNA fans and psychology isn't what's stopping NA teams getting better, did you handpick this from reddit?\nI can readily tell you oce is garbage. Should you call me cancer by being able to recognise and accept that there are things we don't excel at?\nWhat a stupid thread to make.","replies":[]},{"poster":"IronwallJackson","date":"2016-05-16T06:03:14.338+0000","up_votes":2,"down_votes":0,"body":"NA teams are a cancer to NA e-sports. Because they're bad.","replies":[]},{"poster":"CR4ZYRONDH4VI","date":"2016-05-16T05:35:34.503+0000","up_votes":2,"down_votes":0,"body":"Yeah i agree with you about that.","replies":[]},{"poster":"Old Man Teeto","date":"2016-05-15T20:12:08.350+0000","up_votes":2,"down_votes":1,"body":"Game 2 was unacceptably poor.  My only real complaint.\n\n*NEVER* do you repeat a game entirely that you just lost, even if you think it wasn't because of the picks.\n\n-------\n\nGoing into it, I knew Huhi was outclassed heavily, and the Pick/Ban phase (because it didn't alternate) would only further this problem since Faker always had the option to last pick if they focused him in bans.\n\nI also knew Aphromoo (everyone sing his praise *wooo*) was one of the people most likely to get caught and picked off because he's consistently mispositioned on the map.\n\nDarshan wouldn't shine because of the meta not favoring his best style of play.\n\nThis left Xmithie and Stixxay, both were performing well, and carried the majority of CLG's hope to actually take a win in the series.  Stixxay made a lot of mistakes unfortunately, and Xmithie was a non-factor in team fights in these games.  So they lost.","replies":[{"poster":"EndlessIsolation","date":"2016-05-15T21:19:25.115+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Old Man Teeto,realm=NA,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=0011,timestamp=2016-05-15T20:12:08.350+0000)\n>\n> Game 2 was unacceptably poor.  My only real complaint.\n> \n> *NEVER* do you repeat a game entirely that you just lost, even if you think it wasn&#x27;t because of the picks.\n> \n> -------\n> \n> Going into it, I knew Huhi was outclassed heavily, and the Pick/Ban phase (because it didn&#x27;t alternate) would only further this problem since Faker always had the option to last pick if they focused him in bans.\n> \n> I also knew Aphromoo (everyone sing his praise *wooo*) was one of the people most likely to get caught and picked off because he&#x27;s consistently mispositioned on the map.\n> \n> Darshan wouldn&#x27;t shine because of the meta not favoring his best style of play.\n> \n> This left Xmithie and Stixxay, both were performing well, and carried the majority of CLG&#x27;s hope to actually take a win in the series.  Stixxay made a lot of mistakes unfortunately, and Xmithie was a non-factor in team fights in these games.  So they lost.\n\nDo you feel a lot of it was due to the nature of how the game is now? Specifically that specific playstyles are shutout/stunted or how league plays in general? or is it a comfort thing? I for one, in any game (even in tourney's I've been to for other games) would rather go with something I have the experience with over what has that 1% edge.\n\nSKT is a strong team no doubt, I just wish CLG would have done more in picks/bans. And I agree with you, Game 2 was just bad... it felt like they were trying to change their style without having the lab time/comfort picks to back it up.","replies":[{"poster":"Old Man Teeto","date":"2016-05-16T02:54:23.584+0000","up_votes":2,"down_votes":0,"body":"Game 2 being a complete repeat is a mistake for player mental state.\n\nMaybe scrimming the same things over and over and over to get used to the matchups and combos, but you give up a huge edge mentally going into another game is just... wrong... I feel this is highly on coaching/advising staff to even allow this.","replies":[]}]}]},{"poster":"Speedphoenix","date":"2016-05-16T00:17:22.682+0000","up_votes":2,"down_votes":0,"body":"I wish the eu boards were larger :'(\nright now having multiple boards is kinda useless","replies":[]},{"poster":"Gnart Even Close","date":"2016-05-16T00:13:43.304+0000","up_votes":2,"down_votes":0,"body":"I mean, NA kind of sucks compared to Korea.  That is a reality, just like U.S. women's soccer is really good.  it's largely a cultural obstacle (professional gaming is taken much more seriously in Korea) more than a player base issue, and there are plenty of moments in some professional matches that make you believe that both NA and EU are \"clown fiestas\".  that being said, I am proud of CLG for doing so well, and they should not be ashamed of losing to SKT T1.  nobody should.  it would be like being ashamed for losing a war to the U.S.  sure, it's possible to win, but the odds are so heavily stacked against you that it's not likely at all.  I'm personally more of a fan of the Korean region, even though I don't follow eSports much at all, simply because they are at a higher level than most of the other scenes (they won two out of the three finals they played in from my understanding).  I would love to be able to root for my own country as the best in the world, but right now NA is subpar to Korea and probably will always be","replies":[]},{"poster":"Simple Moon","date":"2016-05-15T21:35:41.122+0000","up_votes":2,"down_votes":0,"body":"I just ignore those posts. I root for anyone from NA in a tournament because I'm from NA. But I like to root for Rox, FNC as well when there is no NA team to represent. I was happy as hell to see CLG make it as far as they did. They deserved it. But SKT are on another level when it comes to organization and strats. I don't hate on them for winning, they earned it.","replies":[]},{"poster":"Malicxs","date":"2016-05-15T08:53:21.497+0000","up_votes":4,"down_votes":2,"body":"I was very impressed with CLG, i was just really upset they ran the same comp twice. That literally throws away 1 of your chances for a win. I didnt expect CLG to win the series, shit i was happy they made it to the finals cause thats awesome. I just wanted them to take 1 match, and that CANT happen when you run the Exact Same LOSING Comp for 2 games in a 5 games series. Like why? it just makes no sense unless you are really that arrogant to believe you can just Out Play the team that just beat you. And that show serious misjudgment on CLGs part. If they would have changed it up on match 2, i think they could have had a better chance by match 3. but they literally wasted an entire match.","replies":[{"poster":"High5","date":"2016-05-15T20:00:59.113+0000","up_votes":2,"down_votes":0,"body":"Really?  Why root for a team that can't win?  I'm not a NALCS fan, but if I was, I'd expect far more.  Watching competitions where the outcome is unknown is what makes it entertaining.  SKT dominating everyone else terribly boring and no fans should accept losing.  CLG is an established team should have far higher expectations.  The wildcards may need the experience, but the other regions have been at this for a while.  Continually losing and getting blown out should be embarrassing.  It should be celebrate as a moral victory.\n\nAs an EULCS fan, G2 was atrocious and should be even more embarrassed by their terrible showing.  They obviously weren't prepared or playing to win either.\n\n> [{quoted}](name=Malicxs,realm=NA,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=0004,timestamp=2016-05-15T08:53:21.497+0000)\n>\n> I didnt expect CLG to win the series, shit i was happy they made it to the finals cause thats awesome.","replies":[]},{"poster":"Guyy Fieri","date":"2016-05-15T19:04:16.585+0000","up_votes":2,"down_votes":1,"body":"I think they figured that they went way to aggressive in game one, which left their comp too far behind to truly work and considering that they had success mid game, they figured the comp should work if they don't throw the early game like that did in game one.","replies":[]},{"poster":"Lstrike","date":"2016-05-17T06:11:28.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Malicxs,realm=NA,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=0004,timestamp=2016-05-15T08:53:21.497+0000)\n>\n> I was very impressed with CLG, i was just really upset they ran the same comp twice. That literally throws away 1 of your chances for a win. I didnt expect CLG to win the series, shit i was happy they made it to the finals cause thats awesome. I just wanted them to take 1 match, and that CANT happen when you run the Exact Same LOSING Comp for 2 games in a 5 games series. Like why? it just makes no sense unless you are really that arrogant to believe you can just Out Play the team that just beat you. And that show serious misjudgment on CLGs part. If they would have changed it up on match 2, i think they could have had a better chance by match 3. but they literally wasted an entire match.\n\nI totally get why they didn't change their comp the second match. They didn't lose the first match because of their comp. They lost because of poor execution in the last couple team fights. They were ahead in gold most of the time in first match (although very little). I can totally understand their mindset going into the second match saying \"Let's run the same comp and execute late game fights better and win\"\n\nIn hindsight, yes, it looks like a poor choice because they lost. But it happens. Look at the third game where they changed the comp and they got stomped. That might have happened second game.\n\nAll in all, SKT was a much better team both in mechanical skill and team fighting prowess. Its only just that they won 3-0.\n\nAlthough I do wish they could have run a split push comp and had Darshan on a Jax or Fiora (but if they ran that and lost, fans would have said \"why are you pulling the same shit Immortals did and run off-meta picks\")","replies":[]}]},{"poster":"What Is Ranked","date":"2016-05-15T15:05:28.997+0000","up_votes":3,"down_votes":2,"body":"Never understood why people \"vote with their region\" . It's a localized submarket business. Do most of you drink pepsi because barrack obama supports it ? Voting with your region is a stupid notion. Back the teams you enjoy watching . Nation affiliation means nothing so lets get that out of the way. If americans want to hate on americans thats fine. There is nothing wrong with calling a loser a loser. Every game has one. There are soo many imports of players in na from lpl eu and other places that na isnt even na....did you all forget why lpl players transfer to na? Because they cant place in lcs in lpl because they arent good enough there in their home region....\n\nEventually na will be nothing but imports..And rightly so because stats have proven imports better than na players.\n\nI have always been a skt fan. Their players are always soo humble and agressive . Faker senpai ......\n\nWe need to stop polarizing regions . There is no na and there hasent been for a while .\n\nThe only polarizing that has ever been statistically true as much as no na lover wants to hear it; lck  > na\n\nIt's always abundantly clear when watching b05's or clutch games .\n\nlck > eu also .  \n\nAlso there is no pride in arrogance clg ran the same comp twice after it lost the first time..\nI believe the definition of insanity is repeating the same thing expecting different results... \nI think it's the definition of stupidity\n\nTLDR. There is no Na,all regions are flooded with foreigners so who cares..skt > clg...  Don't see a point in taking pride in clgs bad arrogant performance. Stop having region pride the regions are drowned in foreigners just vote for the team you like not region..Having pride in something you cannot change is silly..Thats how racism was started lol .the regions/ teams are a business ..I like skt but i wont be '\"proud\" of them..You don't wake up proud of wearing puma socks do you? If thats how you live life then some salty summoners are you‘re least of worries...\n**_\nBut i want to pose this question to everyone. When you were growing up and many of you watched ,idolized and were proud of you're home team. Why? Even as a child i did not understand this notion.. I rooted for the team i liked regardless of their geographic location....I think people would enjoy lcs more if they were blind to region. I think it's also important to mention that saying lck> na isn't an insult it currently is just a statistical fact in the competitive scene. I think there are less salty people than most think and the saltyest are those that start these threads saying they arent..._**","replies":[{"poster":"Shadula","date":"2016-05-15T16:52:55.359+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ReIiabIe,realm=NA,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=0006,timestamp=2016-05-15T15:05:28.997+0000)\n>\n> Never understood why people &quot;vote with their region&quot; . It&#x27;s a localized submarket business. Do most of you drink pepsi because barrack obama supports it ? Voting with your region is a stupid notion. Back the teams you enjoy watching . Nation affiliation means nothing so lets get that out of the way. If americans want to hate on americans thats fine. There is nothing wrong with calling a loser a loser. Every game has one. There are soo many imports of players in na from lpl eu and other places that na isnt even na....did you all forget why lpl players transfer to na? Because they cant place in lcs in lpl because they arent good enough there in their home region....\n> \n> Eventually na will be nothing but imports..And rightly so because stats have proven imports better than na players.\n> \n> I have always been a skt fan. Their players are always soo humble and agressive . Faker senpai ......\n> \n> We need to stop polarizing regions . There is no na and there hasent been for a while .\n> \n> The only polarizing that has ever been statistically true as much as no na lover wants to hear it; lck  &gt; na\n> \n> It&#x27;s always abundantly clear when watching b05&#x27;s or clutch games .\n> \n> lck &gt; eu also .  \n> \n> Also there is no pride in arrogance clg ran the same comp twice after it lost the first time..\n> I believe the definition of insanity is repeating the same thing expecting different results... \n> I think it&#x27;s the definition of stupidity\n> \n> TLDR. There is no Na,all regions are flooded with foreigners so who cares..skt &gt; clg...  Don&#x27;t see a point in taking pride in clgs bad arrogant performance. Stop having region pride the regions are drowned in foreigners just vote for the team you like not region..Having pride in something you cannot change is silly..Thats how racism was started lol .the regions/ teams are a business ..I like skt but i wont be &#x27;&quot;proud&quot; of them..You don&#x27;t wake up proud of wearing puma socks do you? If thats how you live life then some salty summoners are you‘re least of worries...\n> **_\n> But i want to pose this question to everyone. When you were growing up and many of you watched ,idolized and were proud of you&#x27;re home team. Why? Even as a child i did not understand this notion.. I rooted for the team i liked regardless of their geographic location....I think people would enjoy lcs more if they were blind to region. I think it&#x27;s also important to mention that saying lck&gt; na isn&#x27;t an insult it currently is just a statistical fact in the competitive scene. I think there are less salty people than most think and the saltyest are those that start these threads saying they arent..._**\n\nTotally agree with you on people being \"region locked\" and think they can only like teams from their region. In my case I live in Southern California and most people are expected to like (in American Football) A. San Diego Chargers B. San Fransisco 49ers C. Oakland Raiders       Yet when i tell someone \"I actually like the St. Louis Rams\" they think im  from another planet and hit me with the \"But they're so far away\".","replies":[{"poster":"Xantak","date":"2016-05-15T17:51:37.683+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shadula,realm=NA,application-id=9hBQwnEU,discussion-id=WXG1b2EN,comment-id=00060000,timestamp=2016-05-15T16:52:55.359+0000)\n>\n> Totally agree with you on people being &quot;region locked&quot; and think they can only like teams from their region. In my case I live in Southern California and most people are expected to like (in American Football) A. San Diego Chargers B. San Fransisco 49ers C. Oakland Raiders       Yet when i tell someone &quot;I actually like the **_Los Angeles Rams_**&quot; they think im  from another planet and hit me with the &quot;But they&#x27;re so far away&quot;.\n\nJust a little assistance to update you, since the team is moving to LA. :)","replies":[]}]},{"poster":"Guyy Fieri","date":"2016-05-15T19:07:04.143+0000","up_votes":2,"down_votes":1,"body":"You realize that CLG only has one import (in Huhi) right?  Everyone else on that team is homegrown NA talent.  This homegrown talent beat out the likes of Immortals (2 Koreans), TSM (always joked to be the least NA team in NA), Liquid (2 Koreans), NRG (2 Koreans).  No clearly all of the imports are the ones having the most success in NA right now......","replies":[{"poster":"What Is Ranked","date":"2016-05-16T10:04:07.642+0000","up_votes":1,"down_votes":0,"body":"Am i supposed to be impressed ? All of na is weak. They are never consistent . I personally think aphromoo is a bad support as far as pros go. Their toplaner tilts too hard.. just because a inconsistant team makes it out of a group of other inconsistant teams means nothing.  Also i see a lot of posters saying they are proud of clg for atleast dragging the game out. That really sounds pathetic. The worst part is i see people say watching skt win over and over is boring . Look at it from their point of view : they must feel bored facing inconsistant talent. Does anyone read stats? Anyone realise how bad skt played this year compared to usual ? Their consistancy was all over the place but they still won easily. That says more about a lack of talent than a boring showcase again as i said teams are doing their job they are businesses why be proud of them? They arent representing you.. do you cheer everytime your mailman delivers a letter? Fandom is odd .I \" appreciate\" watching a team that i think plays well together with amazing synergy. I dont love,feel proud of or support anyone in lcs. Stop giving these players soo much credit for doing what their paid to do they don't care if you support them they care about the piddly money they make that keeps them from flippin burgers \n\n\n\nbrb gonna go clap my neighbor mowed his lawn{{sticker:zombie-brand-clap}}","replies":[{"poster":"Guyy Fieri","date":"2016-05-16T14:40:59.479+0000","up_votes":1,"down_votes":1,"body":"How the fuck does league have anything to with my mailman or my neighbor cutting their grass?  \n\nI will never disagree that Korea is better than everyone else.  That's why, though, it's nice to see CLG have some success and win some games against regions other than NA.  \n\nYou remind me of Montecristo.  Clearly you think only one region matters in the entire world, even though you are from a different region.  For the record, Montecristo disgusts me with how rude and arrogant he is about literally everything.","replies":[{"poster":"What Is Ranked","date":"2016-05-16T21:06:01.617+0000","up_votes":1,"down_votes":0,"body":"Monte is a caster for a reason he is one of the most statistically biased casters, but since you didn't get my previous sarasm let me tell you like a child . Monte usually doesnt bank on feelings only stats. Since when does being truethful and stating a fact arrogant? You said yourself koreans are better.. so you are being arrogant like monte too since you stated a fact ?","replies":[]}]}]}]}]},{"poster":"RIP Resonance","date":"2016-05-15T08:44:29.444+0000","up_votes":3,"down_votes":1,"body":"I'm proud they got as far as they did, yes; however, I am disappointed in their performance.","replies":[]},{"poster":"Wuks","date":"2016-05-15T08:42:30.114+0000","up_votes":3,"down_votes":2,"body":"No downvote from me. Tell it like it is.","replies":[]},{"poster":"Seekêr","date":"2016-05-16T15:08:40.316+0000","up_votes":2,"down_votes":1,"body":"The fans aren't gonna stop e-sports from growing. The fact that they talk shit about it just indicates how many people follow the scene, that's all. Just like people who follow their state's football team. The team might suck, but we are still gonna follow it, whether it is in a positive or negative light, a viewer is a viewer in the sports industry.","replies":[]},{"poster":"Teemodanegro","date":"2016-05-16T02:22:37.334+0000","up_votes":2,"down_votes":1,"body":"> NA \"fans\" are one of NA's biggest obstacles to growing as a competitive scene.\n\nYou heard it here first boys, Pro players don't have enough incentive to do well. We're making them bad.","replies":[]},{"poster":"Just Jangle","date":"2016-05-16T00:17:19.319+0000","up_votes":2,"down_votes":1,"body":"When NA makes something fine at Worlds, then it would be something to be proud.\n\nMeanwhile NA teams are just trash.","replies":[]},{"poster":"LuunaLily","date":"2016-05-15T20:28:26.978+0000","up_votes":2,"down_votes":1,"body":"Can we please stop calling it North America. Its essentially just an American league. They even had the CLG logo with the United States flag. Even though Canada is part of \"NA\"","replies":[]}]}