{"poster":"Soryee Ge Ton","date":"2015-11-03T18:03:27.344+0000","title":"Rangliste Silber nur Troller ? Und mehr Tipps auf GOLD zu kommen","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Man jetzt reichts mir wirklich , kann man mal ein Spiel haben ohne das wirklich keiner AFK geht oder feedet was auch immer. Nichts wird unternommen, egal ob man sie meldet oder nicht. Das kann doch garnicht wahrsein. Seit halbes Jahr gehts schon so das in jedem Game 1 AFK ist oder sehr feedet.\r\n\r\nG&auml;be es noch mehr Tipps und jetzt bitte nicht mit Fehlern ankommen die ich machen. NEIN ich habe schon damals eingesehen welche Fehler ich machen .\r\n\r\nMit freundlichen Gr&uuml;&szlig;en","replies":[{"poster":"F L YI NG Candy","date":"2015-11-03T21:16:42.175+0000","up_votes":1,"down_votes":0,"body":"dann wäre Gold das jetzige Silber, weil eine grosse Mehrheit sehr schnell aufsteigen würde...","replies":[]},{"poster":"alphabeat24","date":"2015-11-03T19:39:33.094+0000","up_votes":1,"down_votes":1,"body":"Kenn ich sehr gut mit den AFK Spielern und den feedern, hänge selber auch schon sehr lange in S2 fest und komme dort wirklich kaum raus.\nIch fände es nicht schlecht, wenn der LP Verlust ,wenn man verliert, sich auf einen kleineren Bereich beziehen würde.\nIch habe nicht gerade selten, ein LP Verlust von 25 und gewinn ich dann mal mit einen halbwegs kompetenten Team ein Match krieg ich meistens 16-18 LP.\nKurz gesagt, man sollte mehr LP gewinnen bei einem Sieg als der Verlust bei einer Niederlage.(Niederlage : 10-15, Sieg : 15-20)\nSomit hätte man sogar tatsächlich einen Hauch einer Chance mal aufzusteigen.","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T20:58:13.915+0000","up_votes":1,"down_votes":0,"body":"Du kannst mehr LP gewinnen wenn der mehr Spiele hintereinander gewinnst. \nSpiele auf meinem Smurf ( diesen Account hier ) und hab bis vor kurzem keine Rankeds gespielt. Hab Placements gemacht und zieh den noch schnell auf Gold und hab eine Winrate von 80%. Verliere 7 LP und gewinne 27 LP. \nEs dreht sich nur darum wie gut du spielst und wieviel Siegesserien du bekommst.","replies":[]}]},{"poster":"haha weed lol xd","date":"2015-11-03T18:45:22.185+0000","up_votes":1,"down_votes":0,"body":"Hm.\nwürde dir raten eine rolle zu picken die einen grossen einfluss auf das spielgeschehen hat.\nJungle und Mid sind die stärksten Rollen im Moment.\n\nEin darius oder Malphite mit 0/7 in eurem Team kann immer noch nützlich und adc sind einfach viel zu schwach im Moment.","replies":[]},{"poster":"Kunkel","date":"2015-11-03T18:08:11.175+0000","up_votes":1,"down_votes":0,"body":"Selber nicht afk gehen dann hast du mehr AFKs im Gegenteam als in deinem (4 potentielle \"Afkler\" in deinem Team und 5 im Gegnerischen).  Im durschnitt profitierst du dann von den AFKs (rein Ligen mäßig der Spielspaß leidet natürlich)","replies":[]}]}