{"poster":"MTSAIA  GG","date":"2020-01-03T19:05:27.875+0000","title":"El Cliente y el Juego se ejecutan con la Tarjeta integrada","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"En la configuración de Radeon configuro al cliente y al juego para que se abran en Alto Rendimiento (Tarjeta Dedicada) pero al abrirlos cambia automáticamente a Ahorro de Energía (Tarjeta Integrada).\r\n\r\nEs raro porque todos los demás juegos que tengo si los puedo ejecutar con la dedicada pero con el LoL me pasa esto. Alguna solución?","replies":[{"poster":"Del0reaN","date":"2020-01-03T20:51:25.374+0000","up_votes":2,"down_votes":0,"body":"Si no usás para nada la integrada, desactivala desde la BIOS. Si tenés una tarjeta gráfica dedicada, tenerla activada solo te va a generar problemas.","replies":[{"poster":"ALITHOO","date":"2020-01-03T22:42:57.138+0000","up_votes":1,"down_votes":0,"body":"en español ? xd ami me pasa lo mismo como se desactiva?","replies":[{"poster":"Cônsistency","date":"2020-01-04T10:11:08.991+0000","up_votes":1,"down_votes":0,"body":"Ahí esta en español, deja de hacer preguntas y googleá mínimo...","replies":[{"poster":"ALITHOO","date":"2020-01-04T18:41:16.209+0000","up_votes":1,"down_votes":0,"body":"dale gracias a dios si nunca te cruzo en tu vida..","replies":[{"poster":"Cônsistency","date":"2020-01-04T23:50:36.423+0000","up_votes":1,"down_votes":0,"body":"Quien sos? Gordito random","replies":[]}]}]}]}]},{"poster":"MrMemo","date":"2020-01-04T03:57:36.223+0000","up_votes":1,"down_votes":0,"body":"Si no me equivoco en Windows 10 al hacer clic derecho en el lol te da la opción de ejecutar el juego con la tarjeta que quieras y en las propiedades también se podia dejar la dedicada como predeterminada {{sticker:vlad-salute}}","replies":[]},{"poster":"HadrieI","date":"2020-01-03T19:19:35.643+0000","up_votes":1,"down_votes":0,"body":"selecciona el .exe que es el juego como tal. prueba con el ejecutable en esta direccion C:\\Riot Games\\League of Legends\\Game (esa es la ruta al .exe que se habre cuando estas en partida)","replies":[]}]}