{"poster":"Cloudke","date":"2017-08-22T03:02:39.334+0000","title":"Game Start: Blitzcrank Mission 3 on event's website is different from the one on the client.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"① On the event website it is:\r\nMission 3\r\n\r\n**Win five matchmade games**\r\n\r\nGet 75 assists\r\nReward: 30 Tickets\r\n\r\n\r\n② On the client, it requires \r\n\r\n**Win five PvP Summoner's Rift  games**\r\n\r\nGet 75 assists\r\nReward: 30 Tickets\r\n\r\n\r\nOne of them must be wrong and misguided someone.","replies":[{"poster":"Broporo","date":"2017-08-22T03:53:10.629+0000","up_votes":1,"down_votes":0,"body":"Thanks for the heads up! Essentially these are saying the same thing, as \"matchmade\" is referring to a game mode where you enter a queue to be matched with 9 other players. I'll look into getting this updated since it's led to a bit of confusion for some players.","replies":[{"poster":"Champion Skin","date":"2017-08-22T06:49:19.280+0000","up_votes":2,"down_votes":0,"body":"> Essentially these are saying the same thing, as \"matchmade\" is referring to a game mode where you enter a queue to be matched with 9 other players.\n\nThat's not quite true actually\nSince there are 9 other players on ARAM but it isn't on summoners rift.... it is on Howling Abyss","replies":[]},{"poster":"beany","date":"2017-08-22T06:34:59.666+0000","up_votes":1,"down_votes":0,"body":"Match made just means any mode where you get matched with someone, even coop ai. That's why there's a specific pvp clause for that mission.","replies":[]},{"poster":"Maxxston","date":"2017-08-22T04:26:59.126+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=kmyEFOu9,comment-id=0000,timestamp=2017-08-22T03:53:10.629+0000)\n>\n> Thanks for the heads up! Essentially these are saying the same thing, as &quot;matchmade&quot; is referring to a game mode where you enter a queue to be matched with 9 other players. I&#x27;ll look into getting this updated since it&#x27;s led to a bit of confusion for some players.\n\n\"Matchmade\" == \"9 players\" isn't accurate though. The last missions in each line require just a matchmade game and can be completed in TT, in contrast to the wording on the mission cited by the OP. (I just completed the Final Boss: Blitz one in TT)","replies":[]}]}]}