{"poster":"SOV Radi0activ3d","date":"2016-10-10T23:19:29.085+0000","title":"Sistema de Baneos","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":6,"body":"Abro esta discuci&oacute;n, lo dejo muy en claro. El soporte de riot es un desastre. O por lo menos yo, no tuve buena suerte y como tienen tantas peticiones de reportes, y baneos, ya lo hacen con un pesta&ntilde;eo de ojo. cero preocupaci&oacute;n y dedicaci&oacute;n. Lamentable.","replies":[{"poster":"Excalibeer","date":"2016-10-11T17:29:23.533+0000","up_votes":2,"down_votes":2,"body":"Cual es la queja exactamente?  \n\nVeo un ticket abierto ayer 11 AM y a las 3 AM de hoy te responde alguien con bastante detalle y dedicación.  \n\nSi lo que esperas solo es un desbaneo, pues no creo que corresponde.\n\n-Excalibeer","replies":[{"poster":"SOV Radi0activ3d","date":"2016-10-13T00:35:17.976+0000","up_votes":1,"down_votes":0,"body":"Claro,lo leí. Pero sigo creyendo que fue un baneo injusto de una toxicidad de 4 personas contra mi, cuando yo no elevé la voz","replies":[{"poster":"Excalibeer","date":"2016-10-13T15:14:38.264+0000","up_votes":2,"down_votes":0,"body":"Tomaré el ticket y lo responderé.  Si quieres conversarlo aquí abiertamente no tengo problema.  \n\n-Excalibeer","replies":[{"poster":"RoloPocholo","date":"2016-10-26T22:17:08.873+0000","up_votes":3,"down_votes":0,"body":"No te respondió mas xDD (yo esperando el  {{champion:432}} )","replies":[{"poster":"Excalibeer","date":"2016-10-26T23:29:16.031+0000","up_votes":2,"down_votes":0,"body":"XD","replies":[]}]}]}]}]},{"poster":"deftttsu","date":"2016-10-10T23:46:19.632+0000","up_votes":2,"down_votes":0,"body":"Mira te dejaré mi experiencia como consejo, hace al rededor de 4 meses me banearon por 14 días era increiblemente toxico. \n\nDe verdad creo que desde ese momento cambie lo suficiente como para bancarme y \"MUTEAR\" altiro aunque hayan premades .. un chat de mi equipo o enemigo por el simple hecho que me tiltea el hecho de ver tanta groseria y mala onda.\n\nEn ese entonces era oro v .. hoy ya voy platino 3 a muy poco de promo a platino 2, aunque muchas veces me salio gente asi y le respondi me di cuenta de algo, el sistema de baneos por mas que te hayan insultado y atacado verbalmente y hayan dañado psicologicamente tu estado de animo u vida, los tendrá en el ojo pero tambien te tendrá en el ojo a tu comportamiento al ver este tipo de situaciones, te sugiero que cuando hayan \"premades\" y comiencen a insultar u trolear, simplemente mutealos o dejalos sin mutar pero lee cada palabra que dicen y no CONTESTES NADA. \n\nAsí de simple, no contestes nada, reportalos al salir y si te reportan 4 personas a la vez se puede tomar como reporte falso, sin dejar de lado que quizás esos 4 reports pueden agravar la situacion si has flameado anteriormente aunque sea un poco u les respondiste en la misma partida\n\nSaludos :) {{sticker:slayer-jinx-catface}}","replies":[{"poster":"SOV Radi0activ3d","date":"2016-10-10T23:49:21.104+0000","up_votes":1,"down_votes":0,"body":"Gracias por el apoyo genio! Una lastima tener que bancarme estos 14 dias","replies":[{"poster":"SnowyMagician","date":"2016-10-12T00:05:17.689+0000","up_votes":1,"down_votes":0,"body":"Si te banearon 14 dias es porque algo hiciste.\nAhora el soporte te responde,si vos queres una respuesta y un desban es otra cosa distinta.","replies":[]}]}]},{"poster":"Vaendrys","date":"2016-10-10T23:24:19.293+0000","up_votes":1,"down_votes":0,"body":"¿Y cual fue tu solicitud?","replies":[{"poster":"SOV Radi0activ3d","date":"2016-10-10T23:36:47.768+0000","up_votes":1,"down_votes":0,"body":"Me suspendieron la cuenta 14 días. Yo entiendo que todo insulto sea perjudicial para cualquiera y que es Anti deportivo.. Pero les digo que vuelvan a leer el chat. Lo reclamo. esa Partida eran 4 Premades y yo solo. Me insultaron con el \"Cancer\" , Que yo tengo \"problemas mentales\". Que soy \"Retrasado\". Todo por que hice varias jugadas malas. En cambio, ustedes se ponen a leer mis insultos, que la verdad, no insulté casi nada. Fue minimo a comparación de estos tipos. SE ABUSARON DE MI. RELEAN EL CHAT, PIDO JUSTICIA. RELEAN!\nYo tengo que estar 14 días suspendido por que esta gente me insultó mil veces peor de las pequeñas cosas que yo eh dicho.Sean justos. Les pido por favor que relean el tema, me decepciona mucho\n\nDe todas maneras, concuerdo que responder con otros insultos esta mal de mi parte, pero deberia ser al revez el baneo. Yo algo minimo, y ellos los 14 dias de suspension! Me parece muy injusto :(","replies":[{"poster":"SOV Radi0activ3d","date":"2016-10-10T23:37:58.141+0000","up_votes":1,"down_votes":0,"body":"Esto le habia enviado a riot!","replies":[{"poster":"MorochoCandente","date":"2016-10-11T02:16:35.311+0000","up_votes":1,"down_votes":0,"body":"El tema es que a vos te banearon 14 dias, y quizas a ellos tambien!.\n\nNo es que el sistema mira la partida y dice \"lo baneo a el y ellos no\", si los reportaste, y si siguen con una actitud toxica, van a terminar baneados eventualmente.","replies":[]}]}]}]},{"poster":"Desaroll","date":"2016-10-10T23:21:17.369+0000","up_votes":1,"down_votes":0,"body":"Hayo!\n\nSi comentas tu experiencia, quizás podamos opinar también de si tenés razón o si solo eres una persona llorando por que no le levantaron un ban.\n\n¿Por que los contactaste?\n\n¿Que respuesta esperabas?\n\n¿Que respuesta te dieron?\n\nSuerte!","replies":[{"poster":"SOV Radi0activ3d","date":"2016-10-10T23:38:28.436+0000","up_votes":1,"down_votes":0,"body":"Me suspendieron la cuenta 14 días. Yo entiendo que todo insulto sea perjudicial para cualquiera y que es Anti deportivo.. Pero les digo que vuelvan a leer el chat. Lo reclamo. esa Partida eran 4 Premades y yo solo. Me insultaron con el \"Cancer\" , Que yo tengo \"problemas mentales\". Que soy \"Retrasado\". Todo por que hice varias jugadas malas. En cambio, ustedes se ponen a leer mis insultos, que la verdad, no insulté casi nada. Fue minimo a comparación de estos tipos. SE ABUSARON DE MI. RELEAN EL CHAT, PIDO JUSTICIA. RELEAN!\nYo tengo que estar 14 días suspendido por que esta gente me insultó mil veces peor de las pequeñas cosas que yo eh dicho.Sean justos. Les pido por favor que relean el tema, me decepciona mucho\n\nDe todas maneras, concuerdo que responder con otros insultos esta mal de mi parte, pero deberia ser al revez el baneo. Yo algo minimo, y ellos los 14 dias de suspension! Me parece muy injusto :(\n\nEsto le habia dicho yo a riot!","replies":[{"poster":"Mazer Rakham","date":"2016-10-11T00:19:29.329+0000","up_votes":1,"down_votes":0,"body":"Te das cuenta que las sanciones no son por una sola partida, no? Esto quiere decir que en reiteradas ocasiones se dieron reportes consistentes con actitud tóxica de tu parte. Por ende, ese reporte fue sólo \"la gota que derramó el vaso\" y puede que los premades que tu dices no tengan reportes como los que tu tenías al momento de la sanción.","replies":[]},{"poster":"aleex5","date":"2016-10-11T00:18:06.178+0000","up_votes":1,"down_votes":0,"body":"se que es injusto pero cuando viste que eran premades y empezaron todos atacarte no debiste responder nada y mutearlos a todos y cuando hubiera acabado la partida reportarlos a todos, comentando lo que paso y te aseguro que no habrías recibido el baneo","replies":[]}]}]}]}