{"poster":"CrimsonLotus3","date":"2018-04-16T01:09:51.917+0000","title":"How much power should supports have until they become unhealthy?","subforum":"Gameplay","up_votes":2,"down_votes":5,"body":"Lets take a scenario:\r\n\r\n A fed assassin/diver jumps an adc but, is blocked by a janna who ends up everything to protect the adc. This protection ends up allowing the adc to auto attack and kill the assassin due to blowing all their cooldowns. My question is that is the protection and invalidating the assassins burst unhealthy? If we look at if from the perspective of the assassin yes it is. This is because it feels awful to useless and completely invalidated.  However, if we look at it from the perspective of the support its healthy because the supports job was to peel and they did what they needed to do. If the opposite happened, and the protection did not matter and the assassin ended up killing the adc would not it feel bad for the support player that their peel was useless?\r\n\r\n##So at what point is the supports peel toxic?\r\n\r\n###### just want a discussion tbh I dont really know the answer","replies":[{"poster":"Metal Janna","date":"2018-04-16T03:35:38.227+0000","up_votes":3,"down_votes":0,"body":"Use some strategy man. Janna can only shield her ADC OR herself, not both. Just bait out her shield by diving at her ADC, then kill her instead.\nThe support is indeed powerful. But that's all the more reason you need to shut them down. Don't think your roam was a failure if you don't kill the ADC. As long as you took out one botlaner you've made laning nearly impossible for the other, at least until he gets his partner back.","replies":[]},{"poster":"k wìx","date":"2018-04-16T01:49:52.337+0000","up_votes":3,"down_votes":0,"body":"The answer fundamentally depends on a lot of variables that your not talking about.\n\n1.) How fed is the assassin vs the support - what is the level and/or gold difference\n\n2.) How well did the Assassin set up the gank and execute it? Did it take a lot of skill to perform? \n\n3.) How well did the Janna stop the gank and prevent it? Did it take a lot of skill to perform? \n\nAnswer those for me, and we can proceed.","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-04-16T01:47:43.339+0000","up_votes":3,"down_votes":0,"body":"{{champion:63}}\n\nOMG Supports are actually just as powerful as normal team members now REEEEEEEE","replies":[{"poster":"CrimsonLotus3","date":"2018-04-16T02:20:42.629+0000","up_votes":1,"down_votes":0,"body":"That's kind of what I personally believe that supports are no longer half a champion however it's important to discuss where do we draw the line between healthy and unhealthy gameplay for the sake of discussion","replies":[]}]},{"poster":"Done25","date":"2018-04-16T01:33:31.218+0000","up_votes":2,"down_votes":0,"body":"You try to jump Trist as Kha. Janna blows every CD and SS she has to stop you. You expect to be able to just ignore her and kill the Trist anyways in a 1v2?","replies":[]},{"poster":"cyprien2509","date":"2018-04-16T01:27:14.895+0000","up_votes":2,"down_votes":3,"body":"Before;\nSupports would peel you buy landing crucial abilities such as Tornadoes at a CRUCIAL moment (such as cancelling a dash that would have been re-settable had it landed) \nNow;\nJanna slaps a shield on her ADC and watches as Ardent Censor and the all the ability power she's gained from passive gold does the work. Does the enemy team play well and pose a threat? NP, just press R and invalidate all of the damage done with your heal, which is now healing for ludicrous amounts since you're getting your items faster and thus scaling faster.\n\nBasically, Supports are straight out stat checking people. Tank Supports are SUPER tanky, Damage supports (such as Bard) are doing tons of burst damage, while peel supports such as Lulu/Janna aren't keeping their adcs alive by correctly timing their abilities and what not, but rather purely by buffing their ADCs to ungodly levels.","replies":[]}]}