{"poster":"Im not Funny 69 ","date":"2017-05-29T14:32:12.129+0000","title":"Wie schafft ihr es immer alles so Broken zu machen","subforum":"Champions & Gameplay","up_votes":2,"down_votes":6,"body":"Ja Fizz ulti ist ja nur zu schwach dann macht ihr alle spells st&auml;rker gute idee wann wird maln n Adc gebufft und d&uuml;rfen wir noch reinschei&szlig;en","replies":[{"poster":"Hashihime","date":"2017-05-29T14:42:16.343+0000","up_votes":3,"down_votes":2,"body":"Alter ich hab die Schnauze von euch hirntoten ADC Mains satt. \"Ohhhh ADC ist ja VOLL schwach!\" guck dir die top 100 in Challenger an. 50-60% sind ADC Mains rate mal warum. ADC ist nämlich alles andere als schwach ne ADC ist momentan find ich sogar zu stark mit all den bescheuerten Tools die man jetzt so dabei hat. Support hat nen Free Schild (Solari) und nen AOE Heal/DMG Item (Redemption), ADC hat Deaths Dance PD und ein komplett kosteneffizientes GA was sogar noch offensive stats gibt + Revive. Und dabei gehe ich noch nicht einmal auf den Lifesteal ein. \n\nTl:Dr\n\nGeh woanders heulen ADC ist fast schon zu stark momentan und Supports sind overtuned. Wenn du an nem Assassin stirbst (momentan eh mit die schwächste Klasse (zmd. Ap Assassins (Danke Adaptive und Abyssal))) hat der seinen Job gemacht und dich geklatscht weil du dumme Fehler gemacht hast. Punkt Ende Aus.\n\nOkuu{{champion:84}} ~~","replies":[{"poster":"Staatsanwalt","date":"2017-05-29T18:28:49.559+0000","up_votes":1,"down_votes":0,"body":"Ich geb dir da recht. Einen ADC zu bursten, wenn er richtig positioniert ist, ist meist sehr schwierig.\n\nDie ganzen Schilditems + Peeling sollten einen ADC davor bewahren sofort zu sterben.","replies":[{"poster":"Hashihime","date":"2017-05-29T20:46:24.336+0000","up_votes":2,"down_votes":1,"body":"Nichtmal dann. Gegner braucht nur ne Lulu + Ivern/Ori/Lux und Deaths Dance und der fällt nicht mehr um außer er läuft 1 v 5 ins Gegnerteam. Ganze Meta imo ist fürn arsch für nen Akali OTP -.-\n\nOkuu{{champion:84}} ~~","replies":[{"poster":"RAG Ryve","date":"2017-05-30T18:02:44.791+0000","up_votes":2,"down_votes":0,"body":"Stimmt absolut nicht.^^\n\nBestes Beispiel war die MSI. \nAuch dort hat SKT ne Protect the ADC Comp gespielt und die Schwäche hat man sehr schnell gesehen, CC.\nWenn du in so einer Comp einen gutes Mass CC triffst und der ADC fällt, ist der Fight automatisch verloren.\nEbenso haben Schilde CD´s, mit nem guten Bait sind die Schilde draußen und jeder anständige Bruiser oder Assassin kann den ADC erreichen und töten.","replies":[{"poster":"Hashihime","date":"2017-05-30T19:16:36.353+0000","up_votes":1,"down_votes":0,"body":"Wir sind hier aber nicht in der MSI sondern inner D5+ SoloQue ohne wirklich Teamabsprache.\n\n\nOkuu{{champion:84}} ~~","replies":[{"poster":"RAG Ryve","date":"2017-05-30T22:34:41.387+0000","up_votes":1,"down_votes":0,"body":"Dann sind wir aber auch nicht in D5+ wenn niemand den ADC CC´s und focused, dann sind wir irgendwo in Silver/Gold.^^","replies":[{"poster":"Hashihime","date":"2017-05-31T13:25:43.395+0000","up_votes":1,"down_votes":0,"body":"Nun wenn man aber das Game um den Bronze/Silver Bereich balancen würde wären Assassins noch nutzloser als sie es eh schon sind. \n\nUnd D5 ist ein Höllenloch glaub mir...\n\nOkuu{{champion:84}} ~~","replies":[]}]}]},{"poster":"charmelikeahri","date":"2017-05-30T19:59:01.428+0000","up_votes":1,"down_votes":0,"body":"Tja SKT hat das Spiel gewonnen obwohl Bang geboostet gespielt hat...","replies":[{"poster":"RAG Ryve","date":"2017-05-30T22:33:34.852+0000","up_votes":1,"down_votes":0,"body":"Faker hat teilweise auch ordentlich Mist gebaut.^^","replies":[]}]}]}]}]},{"poster":"404MilfNotFound","date":"2017-05-29T20:47:46.385+0000","up_votes":1,"down_votes":0,"body":"> guck dir die top 100 in Challenger an. 50-60% sind ADC Mains rate mal warum\n\ndas stimmt noch nicht einmal","replies":[{"poster":"Hashihime","date":"2017-05-29T20:49:51.233+0000","up_votes":1,"down_votes":1,"body":"Gut dann sinds eben 50-60% der Top 200 zufrieden? Ändert an der Aussage, dass ein zu großer prozentualer Anteil der Top-Spieler aus ADC Mains besteht nix und das zeigt auf, dass ADCs momentan gut sind oder meiner Meinung sogar zu stark, was aber die Schuld der komplett overtuned Supports ist.\n\nOkuu{{champion:84}} ~~","replies":[{"poster":"404MilfNotFound","date":"2017-05-29T21:39:32.526+0000","up_votes":1,"down_votes":0,"body":"Deine Aussage stimmt aber nicht, von den 200 Challengerspielern sind ca. 40 Spieler ADC´s. Quelle: lolking.net","replies":[]}]}]}]},{"poster":"Bayonetta38","date":"2017-05-29T14:46:01.010+0000","up_votes":1,"down_votes":10,"body":"ADCs sind jetzt nicht wirklich im Nachteil. Cait, Lucian, Jhin, usw. Alles ADCs die einen wegbursten und ein guter ADC lässt sich auch nicht so einfach schnappen und bestraft diejenigen die versuchen sie zu belästigen. \nKlar du hast recht so Noobchamps wie Fizz, Yi, Xin usw. sind natürlich viel einfacher zu spielen aber ist der Knackpunkt. \nWer spielt solche Noobchamps? Der Name sagt schon alles: Noobs, Leute die nicht mit schwierigen Champs umgehen können oder rumheulen wenn sie keine Kills bekommen. \nWarum werden diese Noobchamps noch mehr gebufft? Ganz klar: Damit diese Noobs besser damit umgehen können. Die kriegen nichtmal diese Champs richtig hin worauf Riot diese buffen muss damit diese nutzlosen Möchtegernpros überhaupt was machen können xD hahahahahahahaha.\n\n\n\n\n\n\n\nAlso der 2 Teil ist frei von mir erfunden xD Keine Ahnung was sich Riot dabei denkt diese Champs zu buffen. Da musst du Riot fragen.","replies":[{"poster":"RAG Ryve","date":"2017-05-29T16:29:46.884+0000","up_votes":2,"down_votes":0,"body":"\"Noob-Champ\" ist ein Ausdruck der zu 90% in der Bronze Elo rumgeistert wo Leute ihre Tode jedes mal damit rechtfertigen, dass sie von einem \"Noob-Champ\" getötet worden sind.\n\nSowas wie ein Noob-Champ existiert nicht, es gibt nur leichtere und schwerer Champs. Und btw, Fizz und Yi da reinzustecken íst schon etwas gewagt. Wer die Counter-Strikes falsch setzt oder mit Fizz nicht den Hai trifft ist nämlich ziemlich schnell tot.","replies":[{"poster":"Bayonetta38","date":"2017-05-30T06:42:29.754+0000","up_votes":1,"down_votes":6,"body":"Achh komm hör mir auf. Du bist sicher grad so mad auf mich weil du bestimmt so ein Main von diesen Champs bist. Du brauchst mir nicht erklären was Fizz Yi ist. Ohne sein Hai kann Fizz trotzdem einiges machen und Yi spieler brauchen auch meist kein taktisches Denken vielleicht später in Teamfights aber da übernimmt der Tank schon das engagen und er nimmt duch das Grand Canyon in die rechte Maustaste spammen die Kills. Jeder halbsweg hirnlose Typ kann mit sowas ein Penta machen oder das spie carrien. Die üblichen 0815 Noobchamps die carrien. Wow.\nDu heulst dich nur aus weil ich bestimmt ein Nerv von dir als Yi, Fizz oder was auch immer Main getroffen habe. \nFizz spieler sollen mal sowas wie Syndra, Orianna, Karma,  Aurelion, Cassio, Heimer oder Zyra spielen aber nein .......... nicht das die nachher wegen den Skillanforderungen anfangen zu Ragen und feeden. Haha findet euch damit ab. Ihr seid Noob champ spieler und daran wird sich auch nichts ändern. findet euch damit ab.","replies":[{"poster":"charmelikeahri","date":"2017-05-30T19:55:23.123+0000","up_votes":1,"down_votes":0,"body":"Ich frage mich ob du das ernstmeinst... wenn nicht dann bist du einer der am wenigsten verstehenden Personen die ich je im in Lol gesehen habe. Das grenzt ja schon an angeborene Dummheit.\n\nIch bitte dich, spiele vor meinen Augen einmal Fizz oder Yi. Du wirst feeden. Ich schwöre es dir. \n\nBitte meine deinen Kommentar nicht ernst oder lösch ihn jtz schnell so etwas absurd dummes gehört nicht in ein 12+ Spiel","replies":[{"poster":"Bayonetta38","date":"2017-05-31T06:45:30.499+0000","up_votes":1,"down_votes":2,"body":"Haha wie die sich aufregen. Hhahaha. Nö warum soll ich nicht zu dem stehen was ich von mir gebe? Ich habe diese Champs schon oft genug gespielt um zu wissen was die können und was nicht. Wenn jemand mit einem Fizz feedet dann ist das schon eine Kunst. Also keine Ahnung wie man des schaffen soll wenn man alles oneshotten kann. Dein Laner zerstört dich? mach ein Gank auf die und ein Double. Lategame Hai nach vorn. Wenn trifft sowieso feierabend für den Gegner wenn nicht nicht schlimm einfach warten bis jemand anderes TF startet und den ADC oneshotten. Als um mit Fizz schlecht zu sein vorallem wegen dieser Passiven, Schaden und Mobilität da muss man schon ein richtiges Talent zum feeden haben. Yi gut vielleicht da kann man feeden aber trotzdem nichts wo du großartig überlegen musst. War in Platin nicht anders und in Bronze auch nicht. Einfacher Noob champ mehr nicht.\nPech wenn es dich so stört meine Meinung heul wo anders haha. Wie sich immer Yi Spieler immer als skillastig bezeichnen wollen haha","replies":[{"poster":"Sirrkas","date":"2017-05-31T08:57:16.562+0000","up_votes":1,"down_votes":0,"body":"Wie kommst du darauf, dass alle Bronzespieler Kinder wären? Das Urteil ist einfach nur falsch. Jeder Spieler kann in Bronze sein, wenn er da hin gehört, das ist völlig unabhängig vom Alter. Ich kenne auch genug Mitte Zwanzig, die in Bronze spielen.","replies":[{"poster":"Bayonetta38","date":"2017-05-31T09:01:47.358+0000","up_votes":1,"down_votes":1,"body":"größten Teils und nicht nur aufs Alter bezogen.","replies":[]}]},{"poster":"charmelikeahri","date":"2017-05-31T15:43:52.050+0000","up_votes":1,"down_votes":0,"body":"Definitv ein Troll du hast dich zuu dumm gestellt :/","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-05-30T13:52:13.427+0000","up_votes":1,"down_votes":0,"body":"Also ich finde Syndra, Cassio, Kamra und Zyra deutlich leichter zu spielen, als Fizz.","replies":[{"poster":"RAG Ryve","date":"2017-05-30T17:59:42.831+0000","up_votes":1,"down_votes":0,"body":"Zyra und Cassio würd ich garnicht so sehr zustimmen. Zyra is ne Glaskanone die sofort platzt wenn sie einmal fehlt am Platz ist und mit Cassio overextended man sehr schnell durch ihren hohen Schaden.^^","replies":[{"poster":"Sirrkas","date":"2017-05-31T08:52:57.180+0000","up_votes":1,"down_votes":0,"body":"Vermutlich ist das für mich einfach so, weil ich Assassinen überhaupt nicht spielen mag. Ich komme da nur mit den wenigsten Champions klar^^","replies":[]}]}]},{"poster":"RAG Ryve","date":"2017-05-30T13:25:15.862+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir sicher der große Meister hier hat recht, wir meinen das doch alle nur alle weil wir so bad sind. XD\n\nGott sei Dank habe ich keinen Blick in deine Matchhistory geworfen...warte, hab ich doch. =O\nAlso glaubst du wirklich ich lasse mir von einem Silver Spieler erklären was ich alles tun sollte und was alles in LoL stark ist und was nicht?\nWohl eher nicht.^^\n\nAber bleib ruhig bei deiner Einstellung, dann werden wir uns wenigstes in Platin nicht begegnen.^^","replies":[{"poster":"Bayonetta38","date":"2017-05-30T13:49:48.803+0000","up_votes":1,"down_votes":3,"body":"Wenn ich auch ehrlich bin will ich auch gar nicht WIEDER ZURÜCK zu Platin, wenn man mal bedenkt was für arrogante Wesen sich dort treiben. Da sind mir die \"ProYasuoMains\" in Lowelo lieber. Und ja ich habe WIEDER ZURÜCK geschrieben da ich schon in Platin war bevor du überhaupt mit diesem Spiel angefangen hast. \nWenn diese Einstellung dafür sorgen soll das wir uns dann nicht begegnen bleibe ich gerne dabei, obwohl ich sowieso für niemanden meine Einstellung ändern würde. Da bleibe ich lieber Silber oder steige nur bis Gold anstatt mich mit jemanden wie dir abzugeben. \nIn meine Matchhistory zu schauen zeigt nur wie erbärmlich du bist indem du versuchst Fehler von mir zu finden, mich hatte es überhaupt nicht intressiert welche Elo du bist oder was du spielst. Ich habe mir immernoch nicht dein Account angeschaut weil ich auf sowas nicht zurückgreife.","replies":[{"poster":"RAG Ryve","date":"2017-05-30T17:52:44.970+0000","up_votes":1,"down_votes":0,"body":"Mir ist es auch reichlich egal was du machst oder nicht machst. XD\nMit gebannten Spieler was zu diskutieren macht einfach nur Laune da ihr toxisches Verhalten an den Tag kommt und daran ergötze ich mich gerne.^^\n\nUnd btw, ich informiere mich wenigstens bevor ich irgendwelchen Müll schreibe, was du ja nicht tust.^^\nDu wirfst lieber die Behauptungen durch die Gegend das irgendwer Fizz oder Yi Main ist ohne überhaupt zu sehen das ich diese Champs in den letzten Monaten nicht 1 mal gespielt habe. XD\n\nIch hingegen informiere mich stattdessen darüber in welcher Elo du rumgammelst weil du mit Behaupten, wie das mit den Noobschamps, rumwirfst obwohl dies eine typische Bronzegeste ist.^^\nUnd ich suche die Fehler auch nicht bei dir, ich weiß da das sie da sind, ich nehme dein Profil nur als Beweis, im Gegensatz zu dir der was behauptet, aber keinerlei Beweise hat außer ein großes Maul und nichts dahinter.^^","replies":[{"poster":"Bayonetta38","date":"2017-05-31T07:24:42.834+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"RAG Ryve","date":"2017-05-31T14:46:53.073+0000","up_votes":1,"down_votes":0,"body":"Und du solltest mal den Rest von deinen Kommis lesen:\n\n\" Ihr seid Noob champ spieler und daran wird sich auch nichts ändern. findet euch damit ab.\"\n\"Pech wenn es dich so stört meine Meinung heul wo anders haha.\"\n\"Damit diese Noobs besser damit umgehen können.\"\n\nMal so ein paar Dinge die mir eher zeigen das du in der Pubertät steckst da du alles und jeden beleidigen musst.^^\n\n\"was für arrogante Wesen sich dort treiben\"\n\nDa trifft das dann ziemlich gut auf dich zu.\nDu erhebst dich über jeden hier, unterstellst Ihnen Dinge und hast anscheinend 0 Plan von LoL.\nDu warst vermutlich nichtmal in Platin wenn man sich deine Spielverläufe ansiehst sondern prahlst einfach damit gern herum damit du dir besser vorkommst als die Anderen. Bist du aber nicht.\nUnd das siehst man auch an deinen Games. Du bistn Prolet, mehr nicht.\n\nUnd zu deiner Info, keiner hier scheint da auch nur ansatzweise auf deiner Seite zu stehen mit dieser lächerlichen \"Noob-Champ\" Sache. Jeder Post von dir wurde schon ein bis mehrmals downgevotete weil dein Benehmen gegenüber Anderen unter dem Niveau eines normalen Menschens liegt.","replies":[]}]}]},{"poster":"charmelikeahri","date":"2017-05-30T19:57:45.515+0000","up_votes":1,"down_votes":0,"body":"Ich habe das Gleiche wie du in Platin erlebt: Arrogante Spieler. Aber diese finde ich 20mal besser als Silberspieler die denken sie gehören nach Platin (ca. 50% der Spieler dort habe ich fas Gefühl) und die tilten mich extrem, so krass das ich manchmal sogar anfange diese zu flamen. Solche Ignoranz geht nicht in meinen Kopf.","replies":[]}]}]}]},{"poster":"HookEmUp","date":"2017-05-30T06:16:41.298+0000","up_votes":1,"down_votes":0,"body":"Yi würde ich denn doch zu den einfacheren Champions zählen - Fizz allerdings nicht... Hab mich mal an Fizz probiert und ohne Gnade gefeedet.:)","replies":[{"poster":"RAG Ryve","date":"2017-05-30T13:12:17.208+0000","up_votes":1,"down_votes":0,"body":"Das Problem bei Yi ist eigentlich ganz einfach erklärt, er hat keinerlei CC und sein Grundschaden ist nicht grad der stärkste.\nYi ist nur dann stark wenn er es im Spiel immer wieder schafft bei einem Gank Kills zu nehmen oder sehr Early schwache Gegner tötet, gelingt ihm das nicht ist er für die meisten Jungler ein gefundenes Fressen beim Counterjungeln.^^","replies":[]}]}]}]},{"poster":"charmelikeahri","date":"2017-05-30T19:59:29.935+0000","up_votes":1,"down_votes":0,"body":"Adc ist ne verdammt starke Rolle","replies":[]},{"poster":"Die Todesfaust2","date":"2017-05-29T18:14:35.879+0000","up_votes":1,"down_votes":0,"body":"Also ich bin mit Xayah als adc gut unterwegs in letzter zeit selbst eine Jinx die wenn sie gefeeded ist normalerweise zum Problem wird kann ich einfach einfach weil ich die stärken kenne in einem 1v1 rausnehmen und dann hat mein Team freie bahn so einfach geht das selbst als die Xin Zhao im jgl hatten wo du ich zittiere \"Noob-Champ\" sagst kann ich locker zumindest poken und stunnen also adc ist momentan einfach stark zu spielen.\n\nMfg\n{{champion:498}} {{summoner:7}}","replies":[]},{"poster":"Angel Ayume","date":"2017-05-29T17:43:09.969+0000","up_votes":1,"down_votes":0,"body":"Wenn du mit Adc nichts reißen kannst liegt es wahrscheinlich an deinem schlechten Positioning. Arbeite daran und du wirst auch als Adc erfolgreicher sein.","replies":[]},{"poster":"Rena","date":"2017-05-29T14:40:40.656+0000","up_votes":1,"down_votes":0,"body":"Adc ist zurzeit eine der besten Rollen","replies":[]},{"poster":"Alekra","date":"2017-05-29T14:38:01.331+0000","up_votes":1,"down_votes":0,"body":"\"Alle spells besser\" Les dir mal die Patchnotes durch. ADC müssen nicht gebufft werden die sind halt erst mit 2-3 items stark.","replies":[]},{"poster":"Oriius","date":"2017-05-30T05:01:38.181+0000","up_votes":1,"down_votes":1,"body":"ich sags mal so . die tatsache das fizz die höchste banrate hat sollte grund genug für n nerf sein xd","replies":[]}]}