{"poster":"Rundaren","date":"2015-10-13T21:17:10.908+0000","title":"Account von einer Bekannten wurde gehackt","subforum":"Hilfe & Support","up_votes":0,"down_votes":4,"body":"Der Account von einer Bekannten von mir wurde gehackt.\r\nSie hat auch die Beweise, dass der Ex Freund von ihr mit anderen Freunden von ihm in Game ist, mit ihrem Account!\r\nIch verfasse den Beitrag, weil der Riot Support noch nicht zur&uuml;ckgeschrieben hat und derzeit auch mit dem Account gespielt wird. \r\nKann ihr/uns jemand helfen?","replies":[{"poster":"Sirrkas","date":"2015-10-13T21:21:27.522+0000","up_votes":2,"down_votes":0,"body":"Passwort ändern und dem Support melden. Mehr kann man da erstmal nicht machen.","replies":[{"poster":"Rundaren","date":"2015-10-13T21:47:31.961+0000","up_votes":1,"down_votes":4,"body":"Alles schon geschehen.. Das Passwort kann man nicht mal ändern, die E-mail kommt nicht an..\nNaja sie überlegt morgen zur Polizei zu gehen, weil auch ihr Facebook Account gehackt wurde.. Kann man da was machen?","replies":[{"poster":"LZ Flame","date":"2015-10-13T21:51:30.584+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Rundaren,realm=EUW,application-id=7hciEY9w,discussion-id=6my7oV7L,comment-id=00000000,timestamp=2015-10-13T21:47:31.961+0000)\n>\n> Alles schon geschehen.. Das Passwort kann man nicht mal ändern, die E-mail kommt nicht an..\n> Naja sie überlegt morgen zur Polizei zu gehen, weil auch ihr Facebook Account gehackt wurde.. Kann man da was machen?\n\nich bezweifle das jemand von irgendwen was gehackt hat","replies":[{"poster":"Rundaren","date":"2015-10-13T22:06:56.625+0000","up_votes":1,"down_votes":2,"body":"Der Ex Freund war es, E-mail Adresse ist dann natürlich bekannt. Na klar ist das kein random Typ...","replies":[{"poster":"Taihuang","date":"2015-10-13T22:30:54.015+0000","up_votes":2,"down_votes":0,"body":"Es ist aber nunmal kein \"hack\".\nAnscheinend benutzt der Ex-Freund ihre Accountdaten die sie bei ihm gespeichert hatte.\nNatürlich ist das widerrechtlich und nicht in ihrem Sinne - aber weder hacking noch phishing.\n\nDas einfachste wäre die Passwörter von LoL / FB / etc. zu ändern bzw. sich neue\nan die Email-Adresse schicken zu lassen.\nWenn der Ex auch die PW's vom Emailaccount hat, dann halt beim Provider schauen das man auch die ändert.","replies":[{"poster":"Rundaren","date":"2015-10-13T22:35:39.838+0000","up_votes":1,"down_votes":3,"body":"Das Passwort würde sie gerne ändern, bekommt aber diese e-Mail von Riot nicht... Dann hat sie den Support angeschrieben und wartet jetzt.. Während in ihrem Account gespielt wird. Schön anzusehen ist dies auch nicht..","replies":[]}]}]}]}]}]},{"poster":"Soltar","date":"2015-10-13T21:54:32.829+0000","up_votes":2,"down_votes":0,"body":"\"gehackt\"\n\nim ernst leute, sagen euch eure eltern/lehrer nicht das ihr eure passwörter nicht weitergeben sollt?","replies":[{"poster":"Rundaren","date":"2015-10-13T22:01:29.346+0000","up_votes":0,"down_votes":3,"body":"Der Ex Freund hatte nur die E-Mail Adresse und nunja, jetzt ist der Account weg. Was soll man denn machen? Mehr als Passwort ändern kann man auch nicht, doof gelaufen, aber sowas bringt uns ja nun auch nicht weiter...","replies":[{"poster":"Taihuang","date":"2015-10-13T22:33:10.231+0000","up_votes":2,"down_votes":0,"body":"Hatte er nur die Email-Adresse?\nMit der allein kann man gar nichts machen.\nOder hatte er ihr (bei LoL) verifiziertes Email-Konto inkl. PW / Zugang?\nDann kann man spontan nicht viel machen, aber mittelfristig lässt sich auch das lösen.\nRIOT fragt einen sehr spezielle Fragen in solchen Fällen, um sicherzustellen das sie\nwirklich Kontakt mit dem Accountbesitzer haben.\nDas bekommt ihr schon geklärt, wird nur ein wenig dauern.","replies":[{"poster":"Rundaren","date":"2015-10-13T23:05:08.500+0000","up_votes":1,"down_votes":3,"body":"Soweit ICH weiß, ja. Wahrscheinlich hat er so alte Passwörter ausprobiert und dann wohl das Richtige erwischt. Anders kann ich mir das nicht erklären.. Naja und wenn man dann dieselbe Passwörter nimmt ist das ganze einfach durch... \nIhr Konto war mit ihrer E-Mail Adresse über den LoL Account verifiziert. Wenn sie versucht die Passwort vergessen Funktion zu benutzen, dann kommt keine E-Mail an.. Wahrscheinlich hat er auch das dann geändert.\nAllerdings haben wir gesehen, wie er und seine Freunde mit ihrem Account gespielt haben. Vorher hatte sie ihn allerdings nicht in der Liste, weil die beiden nicht im Guten auseinander gegangen sind..","replies":[]}]}]}]},{"poster":"HansMowlWurf","date":"2015-10-13T21:56:07.890+0000","up_votes":3,"down_votes":1,"body":"Kinder <3\n\nAber mal ehrlich, wenn sie ihre Anmeldedaten bei ihm auf dem Rechner abspeichert (man geht ja oftmals mit dem Rechner des Partners Online) oder ihm gar ihre Daten anvertraut, dann brauch man kein Hacker oder sonstwas sein um an die Daten zu kommen und damit Schindluder treiben zu koennen.\nUm genauzugehen muss man nichtmal wirklich klug dafuer sein ;D\nEinfach nur das nutzen, was einem vor die Fueße geworfen wird.","replies":[{"poster":"Rundaren","date":"2015-10-13T22:12:43.601+0000","up_votes":1,"down_votes":3,"body":"Richtig... Genau so meinte ich das! \nund wie Verfahren? Riot schon angeschrieben und so weiter.. Spiele wurden auch gespielt mit dem Account.. mit dem Ex Freund zusammen und Freunden, genug beweise sind da. Genau so wie eine E-Mail Adresse!","replies":[]}]}]}