{"poster":"Plug In Baby","date":"2016-07-05T22:51:24.695+0000","title":"Urgot Rework","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":5,"body":"Hallo :)\n\nUrgot ist die letzte Zeit viel im Gespr&auml;ch, seit l&auml;ngerem habe ich schon eine Idee f&uuml;r ihn. Sehen Leute von Riot einen solchen Post?\n\nDas Problem an Urgot ist die Rolle im Spiel, wie soll er sich anf&uuml;hlen?\nIch w&uuml;rde vorschlagen, in zu einem Midrange-AD-DPS-Bruiser zu machen, der mit seiner Ulti zu eine kurzen m&auml;chtigen Bedrohung wird. Ein Champion, der im Kampf ist und durch Item/Spelltankyness &uuml;berlebt, um dauerhaft auf mittlere Distanz hohen Schaden zu machen. Dazu schlage ich folgende &Auml;nderungen vor:\n\nAktuell:\nUrgots normale Angriffe und S&auml;urej&auml;ger reduzieren den durch sein Ziel verursachten Schaden 2,5 Sekunden lang um 15 %.\n\nDie Passive ist stark, aber meh. Zu langweilig. Stattdessen sollte dieses Miniexhaust in bestimmten Momenten st&auml;rker sein, man will es JETZT nutzen und nicht immer. Diese Passive wird gereworkt in den Spells.\nDie neue Passive:\n\nPassiv: Urgot kann keine normalen Angriffe vollf&uuml;hren.\n\nDas klingt hart, wird ihn aber viel stimmiger machen. Wer will denn die Urgot AAs? Die waren irgendwie dabei, aber im Late nutzlos (auf nem AD Champ) und  somit bescheuert. Seine neue alte DMG-Quelle ist daher sein Q:\n\nQ:\nUrgot feuert eine Rakete in die gew&auml;hlte Richtung, die normalen Schaden verursacht (keine Castanimation). Falls sein Q eine Einheit t&ouml;tet, werde die Manakosten zur&uuml;ckerstattet.\nWenn Urgot das Ziel mit E getroffen hat,  fliegt die Q &uuml;ber alle Einheiten hinweg, die nicht anvisiert sind, direkt zum gew&auml;hlten Ziel und f&uuml;gt diesen Schaden &gt;kreisf&ouml;rmig um das Ziel herum an.\nKann kritisch treffen und l&ouml;st On-hit-Treffer aus (nicht die AOE-Explosion), z&auml;hlt als Autoattack in jeder Hinsicht bis auf die Tatsache, dass es ein Skillshot &gt;ist.\nNormaler Schaden: 20/30/50/80/120 (+80%/90%/100%/110%/120% Gesamtangriffsschaden)\nCooldown: 2sec (skaliert mit CDR und AS: Die erste Sekunde kann mit 45% auf 0,55s reduziert werden. Urgot hat ein BaseAS von 1 und kein AS pro lvl. &gt;Der Cooldown der 2. Sekunde ist dann 1/AS, minimal also 0,4. Minimaler Cooldown insgesamt: 0,95. Ohne CDR Masterie 1s.)\nReichweite wie bisher 1000.\nProjektilgeschwindigkeit gleich.\nManakosten: 30 Mana\n\nW: AP-Scaling entfernt, Grundwert verdoppelt.\n\nDer Spell ist gut. Der E-Spell hat ne R&uuml;stungsreduzierung, die man nicht sonderlich merkt. Weg damit:\n\nE: \nAktiv: Urgot feuert eine &auml;tzende Ladung mit einem Radius von 150 in ein Zielgebiet. Sie erleiden w&auml;hrend der Wirkdauer von 5 Sekunden  normalen Schaden. Qs werden zielsuchend, wenn sie auf Ziele gerichtet sind, die unter E leiden, eine Explosion abh&auml;ngig vom Q-Dmg entsteht.\nDer erster direkte Treffer durch einen Q an einem ver&auml;tztem Ziel schw&auml;cht dieses: Der verursachte Schaden, seine R&uuml;stung und Magieresistenz ist f&uuml;r 2 &gt;Sekunden um 50% reduziert. Dieses Ziel wird wie bei exhaust deutlich visuell markiert.\nKeine Castanimation. Schaden und Cooldown und Manakosten unver&auml;ndert.\n\nR:\nUrgot geht f&uuml;r 3 Sekunden in den Hypermodus. Seine Q besitzt einen festen CD von 0,3 Sekunden und setzt bei jedem Treffer ein Explosion. In diesen drei Sekunden ist au&szlig;erdem seine kritische Trefferchance fest auf 100% gesetzt.\nManakosten: 100\nCooldown: 130/110/90\n\n\nWas haltet ihr davon?","replies":[{"poster":"TerrorRaven","date":"2016-07-05T23:18:51.898+0000","up_votes":3,"down_votes":1,"body":"Schlecht durchdacht. Ohne Mana ist er völlig wehrlos, was soll dann seine neue Passive sein? Mit diesen Änderungen kannst du ihn gleich aus dem Spiel entfernen.\nDie Rüstungsreduzierung hat im später sehr wohl bemerkt. Zusammen mit den Schwarzen Beil hat er mal eben deine halbe Rüstung runtergeshreddert.","replies":[]},{"poster":"OT Riku","date":"2016-07-06T07:22:09.596+0000","up_votes":1,"down_votes":3,"body":"Nice ich geh auf die Lane verklicke mich und schwupps E geskilled shit erste Vasallenwelle weg.\n2te. bekomme ich 3te. verliere ich weil ich kein Mana hab.\nDie Idee ist total undurchdacht AA sind das wichtigste für Early Trades.\nJa selbst Lasthitten kann der Junge ohne die Träne/Manamune nicht mal.\nWas denkst du denn wie man ihn spielen sollte?\nDu würdest jeden Trade verlieren auf lv 1 und alle anderen auch. \nWie willst du denn das Verhindern.....\nDas Konzept ist undurchdacht und komplett schwachsinnig von der Idee.\nNoch mal an den Schreibtisch und Neu ausdenken.","replies":[{"poster":"Plug In Baby","date":"2016-07-07T09:41:45.673+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChaosRiku,realm=EUW,application-id=L7E6lhzo,discussion-id=OscUsYzo,comment-id=0002,timestamp=2016-07-06T07:22:09.596+0000)\n>\n> Nice ich geh auf die Lane verklicke mich und schwupps E geskilled shit erste Vasallenwelle weg.\n> 2te. bekomme ich 3te. verliere ich weil ich kein Mana hab.\n> Die Idee ist total undurchdacht AA sind das wichtigste für Early Trades.\n> Ja selbst Lasthitten kann der Junge ohne die Träne/Manamune nicht mal.\n> Was denkst du denn wie man ihn spielen sollte?\n> Du würdest jeden Trade verlieren auf lv 1 und alle anderen auch. \n> Wie willst du denn das Verhindern.....\n> Das Konzept ist undurchdacht und komplett schwachsinnig von der Idee.\n> Noch mal an den Schreibtisch und Neu ausdenken.\n\nWie bei Azir W wird der Q automatisch geskillt, das ist ja nicht so schwierig. Seine Autoattacks werden durch Qs ersetzt. Für Minionkills gibts den Manarefund. Wenn er immer eingepusht wird, kann man ja doppelten Schaden zu Minons machen. Lasthitten geht, wenn man Skill und 30 Mana hat. AP-Champs ohne Mana sind auch nutzlos, das ist nun nichts neues.\nAb Lvl hat er mit seinem E ein Miniexhaust. Viel Spaß, dagegen zu traden.\n\n\n> [{quoted}](name=Aronoxlp,realm=EUW,application-id=L7E6lhzo,discussion-id=OscUsYzo,comment-id=0003,timestamp=2016-07-07T09:14:31.649+0000)\n>\n> Das Problem bei Urgot liegt woanders. Er ist ein Fernkampftank. \n> Er hat eine kurze Reichweite für einen Marksman, seine Ulti ist darauf ausgelegt in die Menge zu springen. \n> Da wo er nicht sein sollte. Seine Q hat zwar viel Reichweite, kann aber geblockt werden und seine E zu treffen ist nur bedingt einfach. Der Gegner muss sehr dumm sein. Außerdem hat er keinen Escape. Das ist nur dann okay, wenn der Champion Tanky ist und was kann. Sonst nicht.\n\nWas hat das mit meinem Vorschlag zu tun?\n\n> [{quoted}](name=TerrorRaven,realm=EUW,application-id=L7E6lhzo,discussion-id=OscUsYzo,comment-id=0000,timestamp=2016-07-05T23:18:51.898+0000)\n>\n> Schlecht durchdacht. Ohne Mana ist er völlig wehrlos, was soll dann seine neue Passive sein? Mit diesen Änderungen kannst du ihn gleich aus dem Spiel entfernen.\n> Die Rüstungsreduzierung hat im später sehr wohl bemerkt. Zusammen mit den Schwarzen Beil hat er mal eben deine halbe Rüstung runtergeshreddert.\n\nWarum kann man ihn aus dem Spiel entfernen?\nEr hat DPS, einen Slow, Tankyness, er besitzt ein Miniexhaust auf mehrere Gegner, wird mit der Ulti zum Hypercarry, hat Counterplay, da q und e Skillshots sind.\nDie Rüstungsreduzierung ist jetzt im Miniexhaust. Es geht nicht, darum, dass die Armorpen schlecht war. Wie die Passive war sie aber eine \"unsichtbare\" Stat. Ich will aber merken: Jetzt ist der Gegner schwach, ich kann traden","replies":[{"poster":"TerrorRaven","date":"2016-07-08T17:31:53.710+0000","up_votes":1,"down_votes":0,"body":"Tut mir Leid, aber Autoattacks zu entfernen ist eine extrem dumme Idee, da du sie als Überbrückung der CD vom Q brauchst. Auch so brachst du die, wenn du kein Mana hast.\nDie MR-Reduzierung auf den E ist überflüssig, da Urgot nur normalen Schaden hat.\nAlles von dir genannte hat er schon, selbst den Mana-Refund auf den Q. Du hilfst ihm mit diesen Änderungen kein Stück weiter.\nLediglich die Änderung vom der Ulti klingt ganz nett.","replies":[{"poster":"Plug In Baby","date":"2016-07-08T22:08:37.808+0000","up_votes":1,"down_votes":0,"body":"Nur weil es niemand gemacht hat, ist es dumm? Ja, das ist seine Schwäche. Dafür hat er ja Stärken und der Q hat ja fast den CD von nem AA. Und klar ist es ein Rework, un kein neuer Champ. Die Passvie und die Rüstungsreduzierung sind aber blöd, da nur passiv und nicht im Spiel direkt ersichtlich.","replies":[{"poster":"TerrorRaven","date":"2016-07-08T23:36:21.377+0000","up_votes":1,"down_votes":0,"body":"Es hat eben niemand gemacht, weil es dumm ist.\nGut, die Schadensreduzerung sieht man nicht direkt, aber die Rüstungsreduzierung um so mehr.\nSein Q hat auf allen Stufen einen Cooldown von 2 Sekunden. Deiner Idee nach kann er nur alle 2 Sekunden angreifen (was einer Attackspeed von 0.5 entspricht) und hätte damit die niedrigste DPS im Spiel. Er wäre extrem von CDR, Mana und seiner Ulti abhängig, um überhaupt im Spiel zu existieren. Im Grunde verstärkst du seine Schwächen, ohne die zu kompensieren.","replies":[{"poster":"KingDanius","date":"2016-07-11T13:47:32.790+0000","up_votes":1,"down_votes":0,"body":"Du verstehst den Punkt nicht.\nBei Graves Rework haben auch alle kleinen Kiddies gleich angefangen zu sagen, dass sein Ammo System kompletter Mist ist und er useless wird....Jaja, schlechter Witz.\n\n''Auf Allen Stufen 2 Sekunden'' ist auch relativ, da die Q ja eben mit Att Speed scalen könnte. Außerdem ist so ziemlich jeder Mage auch von CDR und Mana abhängig....\n\nMan könnte wenigstens noch einführen, dass man seine Q auch trotz fehlendem Mana aktivieren kann, sich der Schaden jedoch verringert (-50% ?) damit man wenigstens noch ETWAS machen kann bzw noch last hitten kann. \n{{champion:6}} {{item:3070}} \n\n\nIhr könnt euch ja auch mal meinen Champion Vorschlag MIT Modell und animierten Skills ansehen und eure Meinungen dazu äußern ^^\n\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/sMsBwX9L-champion-vorschlag-uon-der-gefangene-des-berges","replies":[{"poster":"TerrorRaven","date":"2016-07-11T14:06:41.413+0000","up_votes":1,"down_votes":0,"body":"Bei Graves haben die es auch gut Kompensiert. Hier fehlt sowas bzw. wird es noch verschlimmert.\n\n\"Man könnte wenigstens noch einführen, dass man seine Q auch trotz fehlendem Mana aktivieren kann, sich der Schaden jedoch verringert (-50% ?) damit man wenigstens noch ETWAS machen kann bzw noch last hitten kann.\"\n\nDa kann er gleich seine Autoattacks behalten, dass würde keinen Unterschied machen. Das Problem ist nicht, dass Urgots Autoattacks Schwach sind (im Gegenteil, da er ein AD-Champ ist). Das Problem ist die Reichweite von 425.","replies":[]}]}]}]}]},{"poster":"Shakês Beer","date":"2016-07-07T16:46:00.733+0000","up_votes":1,"down_votes":0,"body":"Das soll heißen du gehst am Ziel vorbei.\nAber zugegeben Irgendwo habe ich den Faden verloren. ","replies":[]}]}]},{"poster":"Plug In Baby","date":"2016-07-07T10:27:24.621+0000","up_votes":1,"down_votes":0,"body":"Die Ulti ist noch schlecht, weil der CD zu gering zum klicken ist. Ich würde den CD auf 0,5 festsetzen. Jeder Schuss lässt zwei Raketen schnell hintereinander ab.  Außerdem verliert in dieser Zeit der E seinen Zielsucher.","replies":[]},{"poster":"Shakês Beer","date":"2016-07-07T09:14:31.649+0000","up_votes":1,"down_votes":0,"body":"Das Problem bei Urgot liegt woanders. Er ist ein Fernkampftank. \nEr hat eine kurze Reichweite für einen Marksman, seine Ulti ist darauf ausgelegt in die Menge zu springen. \nDa wo er nicht sein sollte. Seine Q hat zwar viel Reichweite, kann aber geblockt werden und seine E zu treffen ist nur bedingt einfach. Der Gegner muss sehr dumm sein. Außerdem hat er keinen Escape. Das ist nur dann okay, wenn der Champion Tanky ist und was kann. Sonst nicht.","replies":[]},{"poster":"Kata Ga Kill","date":"2016-07-05T23:54:34.823+0000","up_votes":1,"down_votes":6,"body":"Ich würde Vorschlagen Urgot zu löschen dann gibt es ein hässliches Problemkind weniger.","replies":[{"poster":"KingDanius","date":"2016-07-11T13:48:58.801+0000","up_votes":1,"down_votes":0,"body":"Wenn du weggehen würdest, hätten wir auch eins weniger. {{item:3070}}","replies":[]}]}]}