{"poster":"JesterGG","date":"2016-04-02T18:10:21.543+0000","title":"Interesados en formar Team (Platino/Diamante) (?)","subforum":"Reclutamiento","up_votes":2,"down_votes":0,"body":"Hola Compa&ntilde;eros! me presento, soy Eduardo (JesterGG) (LAS) de Valparaiso, Chile. y pues les cuento, vengo de la s3 jugando, 2 a&ntilde;os de soporte, 1 a&ntilde;o de jungla, Actualmente Platino4 un poco desmotivado del soloq. pero con muchas ganas de trabajar con gente comprometida y que est&eacute; dispuesta a mejorar. he tenido intenciones de ser coach, por el tiempo que me paso viendo torneos, streaming, youtube etc...\r\ndentro del roster que tengo solo estoy yo como soporte, mi Adc por motivos de tiempo no podr&iacute;a, \r\na causa de esto, quiero invitarlos a participar de esta Iniciativa que por lo que veo muy pocos la tienen! \r\nCrear un team partiendo desde Neutro! Requisitos abajo :)\r\n\r\n-El nombre del Team se elegir&aacute; entre todos los que formemos esto.\r\n-El requisito m&iacute;nimo de edad es tener 17 a&ntilde;os\r\n-Est&aacute; dem&aacute;s decir que evitaremos gente rage dentro del equipo\r\n-Tener Skype, Teamspeak u cualquier servicio de comunicaci&oacute;n\r\n-Disponibilidad de 5 horas m&iacute;nimas al d&iacute;a  \r\n \r\nNecesito: \r\n\r\n-ADC \r\n-MID\r\n-JUNGLER\r\n-TOP\r\n\r\n-Quieres apoyar de alguna manera? Coach? Dise&ntilde;o? Bienvenido!\r\n\r\nGracias por Leer, espero contar con ustedes!\r\nSaluda Atte, Eduardo Reyes-","replies":[{"poster":"Maimedd","date":"2016-04-03T22:31:18.098+0000","up_votes":1,"down_votes":0,"body":"Buena men Soy de santiago , tengo 18 años vengo jugando de la S3  Main adc , tengo todas las tardes libres despues de las 1 de la tarde Agregame a Maimedd , soy platino 5 pero tengo el mismo problema , algo desmotivado en las SoloQ","replies":[]},{"poster":"Vizier","date":"2016-04-03T22:17:44.728+0000","up_votes":1,"down_votes":0,"body":"Soy platino 3 main mid adc (también me acomodo a otras line) \nel problema es que tengo horario limitado por ser estudiante, si te interesa envía solicitud.\n(Chile,Santiago)","replies":[]},{"poster":"JesterGG","date":"2016-04-03T16:05:16.345+0000","up_votes":1,"down_votes":0,"body":"Les envie Solicitud ingame chicos, durante la semana estaremos en contacto para conversar el tema seriamente! :)","replies":[]},{"poster":"lyssan","date":"2016-04-03T04:46:03.845+0000","up_votes":1,"down_votes":0,"body":"hola yo maineo adc y top cualquier cosa agregame y hablamos","replies":[]},{"poster":"pasaelpack","date":"2016-04-03T00:53:50.403+0000","up_votes":1,"down_votes":0,"body":"hola, soy main top y jg no soy platino ni diamante pero le pongo harto jajaja, tengo full disponibilidad bro!","replies":[]},{"poster":"Pateando ZURDOS","date":"2016-04-02T19:53:34.596+0000","up_votes":1,"down_votes":0,"body":"Norick midlaner bs as platino1 en tres meses cumplo 17","replies":[]}]}