{"poster":"Godos","date":"2016-09-01T04:41:56.917+0000","title":"Reembolsos despues de reworks","subforum":"Charlas Generales","up_votes":2,"down_votes":12,"body":"**_*Resumen nivel 5 al final* _** {{sticker:slayer-pantheon-thumbs}} \n\n\nSaludos invocadores! Les traigo una idea que vengo pensando hace tiempo (desde el rework a trundle y karma) mas o menos , pero siempre me dio paja publicarlo puesto que pens&eacute; que a alguien mas se le ocurri&oacute;.  Entre mi pool de campeones main y con los cuales me sentia comodo usaba a Graves {{champion:104}}  ( el viejo tirador), le compre el skin Graves Mafia, con el tiempo salio el skin de verano y tambien se lo compre. Un dia le hacen un rework completo ( lo cual me parece bien se distingue su estilo unico y su escopeta) pero al no ser el mismo graves y un campeon con mecanicas y estilo de juego totalmente nuevos era empezar a jugarlo totalmente de nuevo. Juego desde la season 2 y tengo todo en lo que refiere campeones/runas etc, por ende un nuevo campeon o un rework es emocionante porque hay algo nuevo que jugar. Para mi desgracia el nuevo graves no fue de mi agrado, es decir me encanta su tematica y su estilo, pero NO son mi estilo. Ni siquiera como tirador, todos saben que se lo usa jg/top e ir de adc con el es quedarse muy atras ( no es que no sea viable pero convengamos que hay 10 adc mejores). \n&iquest;Cual es el problema? Los skins que le compre al viejo Graves. Ahora no lo uso, no me siento comodo (encima fue el campeon con el que consegui la primer maestria), tenias un graves maestria 5 con skin y todo el paquete y basicamente no sabia usarlo. \nAsique mi idea seria que despues de un rework a un campeon (como lo fue mi Graves {{item:3151}}  ) si no te gusta puedas recuperar los RP invertidos en ese campeon, no tiene sentido comprarle skins a un campeon que te gusta, le cambian todo el set de habilidades y ya no es de tu agrado o no te sentis como o el motivo que fuera, y que no tengas ni la minima chance de de recuperar lo que pagaste. Porque se va a venir el rework de galio ( que le compre el legendario) y si no me gusta me voy a meter el skin en el cul.... Tuve la suerte que no usaba ryze/trundle/karma/malza etc. Lo que si jugaba mf y los retoques que le hicieron me gustaron y me senti mas comodo por lo que el skin mafia y arcade los sigo usando, pero si no me gustaba tambien, otro campeon con skin que iba a quedar en  la nada.\n\n**_*Resumen nivel 5 * _** {{sticker:slayer-pantheon-thumbs}} \n\nSi le compraste el skin a un campeon, mese despues te lo cambian totalmente (rework) y no te gusta el campeon y no lo usas porque no te sienta bien u otro motivo que te reembolsen los skins que pagaste por EL ANTIGUO CAMPEON. \n\n&iquest;Opiniones o Sugerencias?","replies":[{"poster":"Big Mad Gorilla","date":"2016-09-01T05:23:50.042+0000","up_votes":5,"down_votes":0,"body":"El problema es que seguramente te digan en el Staff que más allá de que sea un campeón, vos ya \"disfrutaste el uso del mismo\". Estoy seguro de que pasó algo parecido sobre la queja de una persona con Fiora, cuando le hicieron el rework, al igual que con Sion, y recuerdo haber leído una respuesta parecida a la que di. De todas formas, aunque me gustaría mucho que se hiciera esto, dudo que pueda llegar lejos y tener peso en las desiciones para el reembolso. Veo mucho más práctico que agrueguen un reembolso cada 1 año que por cada rework. Más de uno devolvería skins.","replies":[{"poster":"ANNIE QUILADO","date":"2016-09-02T17:25:05.560+0000","up_votes":1,"down_votes":0,"body":"hola maza :P","replies":[]},{"poster":"Gol D Roger","date":"2016-09-01T10:06:58.996+0000","up_votes":1,"down_votes":0,"body":"la idea que tiraste vos es mas realista y esta muy buena","replies":[]},{"poster":"Kyousuke","date":"2016-09-01T05:51:05.418+0000","up_votes":1,"down_votes":0,"body":"en realidad lo hacen y te reembolsan pero solamente por reworks completos de apariencia con fiora graves y malza no darian reembolso pero si con yorick poppy y ryze o almenos asi era hasta el año pasado que habían post pidiendolos","replies":[]}]},{"poster":"Djinnmastah","date":"2016-09-01T05:31:56.251+0000","up_votes":2,"down_votes":0,"body":" ¿Y quizá comprar un reembolso con una cantidad de rp? Gana Riot y ganamos nosotros.\n\n{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"Månegarm","date":"2016-09-01T04:55:43.757+0000","up_votes":3,"down_votes":2,"body":"Al parecer nadie se ha unido a la discusión todavía; ¡sé el primero en comentar!","replies":[]},{"poster":"Pascut","date":"2016-09-01T12:10:08.567+0000","up_votes":1,"down_votes":1,"body":"Desde un mini rework que le habían dado a rengar a comienzos del año pasado creo dijeron que no iban a realizar más ninguna clase de reembolso de este estilo","replies":[]},{"poster":"F0RZAKEN","date":"2016-09-01T05:24:53.793+0000","up_votes":1,"down_votes":1,"body":"Cambiar a vista cronológica","replies":[]},{"poster":"ForcerStriker","date":"2016-09-01T05:09:09.719+0000","up_votes":1,"down_votes":1,"body":"DEJAR UN COMENTARIO...","replies":[]}]}