{"poster":"DBZChiChi","date":"2018-11-24T11:57:53.481+0000","title":"Intentional afkers not punished?","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"I just had a game where some guy on 0LP didn&#039;t want to dodge because he would be on -3LP, he loaded into the game, walked into lane once, inted then afk&#039;d for 27 minutes then re connected, as far as i know he didn&#039;t get punished.\r\n\r\nMy question is, why do players like this never seem to get punished? They don&#039;t get suspensions/warnings nothin, at most they get a 30 minute timer?\r\nLike are u kidding me, he&#039;s ruining the ranked experience of 4 players, for a 30 minute queue at the most?\r\n\r\nI feel like the punishment doesn&#039;t fit the crime in this case and i feel as tho the riot support team or whoever is responsible should imply bans to players like this for 3-7 days to prevent it because it&#039;s just unfair. Specifically towards those individuals who are intentionally doing it.\r\n\r\nWhat are your thoughts? Do you have any complaints about the game that don&#039;t seem fair, share in the comments below.","replies":[{"poster":"QAPLA","date":"2018-11-26T08:14:37.134+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DBZChiChi,realm=OCE,application-id=T8eq2lFQ,discussion-id=ksPHUhAm,comment-id=,timestamp=2018-11-24T11:57:53.481+0000)\n>\n> What are your thoughts? \n\nI think you should post from your real account to begin with. Hiding behind a smurf on forums is for cowards.\n\nIt is way harder to analyze gameplay than chat.\nIf you abuse someone, it is obvious to moderators of your intent.\nGameplay however is more ambiguous. Are they having technical issues? How do those that dish out the punishments know if it is intentional or technical?\n\nIt's pretty easy to see why chat issues and gameplay issues are treated differently, if you actually think about it for 2 seconds.","replies":[]},{"poster":"Bookbash","date":"2018-11-24T23:42:04.411+0000","up_votes":2,"down_votes":1,"body":"Those sort of players have the worst attitude to the game. Had this inting Janna in my game recently. They tried to hold champion select hostage by saying \"Someone needs to dodge\". After the reply came back \"yeah, you\" then stated that they would int and just take cleanse and ghost summoner spells. They not only ran it down the lanes, but kept the surrender vote invalid until 20 minutes of our time was wasted. This is one of the main reasons why people quit the game, you cannot escape from the time wasters. [NEACE](https://www.twitch.tv/neace) said it best on his Fortnite stream when he compared this team game to basketball. If you join a few players for ball at a local court and they act like arseholes, you can just leave the game. You're not trapped in that situation.\n\nSo my friend, it is going to cost you a few minutes to make sure they are punished correctly. If you feel that this is worth it for the community's sake, then do this:\n\n1: Screenshot in game action\n2: Copy the pre and after game chats\n3: Upload to a site where you can combine them all\n4: Include the link in your report\n\nShould probably take you about 10 minutes after the game, but they won't be coming back. Just like the Janna. [Link removed, censor the names if you wish to re-add it but I feel the point has been made.]","replies":[{"poster":"Essembie","date":"2018-11-25T03:15:57.844+0000","up_votes":2,"down_votes":0,"body":"it is far easier to get banned by playing well and calling someone a dick than it is by being silent and ruining games through trolling.","replies":[]},{"poster":"DBZChiChi","date":"2018-11-25T03:49:56.000+0000","up_votes":1,"down_votes":0,"body":"Thank you, i'll do this with Gyazo in future, appreciate the post and i'll do my best to rid our player base of the ones i encounter!","replies":[]}]}]}