{"poster":"RM Heartmeander","date":"2018-07-08T12:59:23.551+0000","title":"Was würdet ihr von herunterladbaren Chatlogs halten bei Rankedgames genau wie die Replays?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":3,"body":"Mit ist gerade die Idee gekommen wegen ner Diskussion hier im Forum, dass der grossteil der flamer hier im Forum die eine CR oder nen Bann bekommen sich ja nur verteidigen w&uuml;rden.\r\nWas w&uuml;rdet ihr also davon halten, wenn man nebst den Replays von Rankeds auch die Chatlogs der entsprechenden Spieler herunterladen k&ouml;nnte?\r\n\r\nDas w&auml;re sehr interessant um auch zu sehen ob die Leute &ouml;fters flamen oder nicht.\r\nNat&uuml;rlich w&uuml;rde das auch Nachteile haben wie z.B. wenn man etwas &quot;pers&ouml;nliches&quot; schreiben w&uuml;rde wie z.B. den Namen wenn man Premade ist und aus irgend einem Grund nicht zusammen im TS o.&auml;. ist oder das flamer das System ausn&uuml;tzen k&ouml;nnten um zu analysieren wann und durch was man in etwa eine Bestrafung erwarten k&ouml;nnnte.\r\n\r\nIch pers&ouml;nlich w&uuml;rde es aber interessant finden um eben zu sehen ob die Leute die sich ja anscheinend nur verteidigen sich nicht doch &ouml;fters verteidigen (sprich flamen) und dadurch eine Strafe bekommen.\r\nAusserdem k&ouml;nnte man auch halbwegs das Verhalten der Leute sehen wie sie sich benehmen um dann vielleicht festzustellen, dass sie eben durch ihr Verhalten flame provozieren. (da man ja nebenbei das Replay anschauen kann)\r\n\r\nDas w&uuml;rde zumindest viel Aufschluss dar&uuml;ber geben und vielleicht auch den Leuten einfacher vor Augen f&uuml;hren was sie denn falsch machen.\r\n\r\n\r\nSo und nun zu euch die Diskussion ist er&ouml;ffnet!","replies":[{"poster":"Sirrkas","date":"2018-07-09T10:17:17.368+0000","up_votes":1,"down_votes":0,"body":"Es ist völlig irrelevant, ob jemand anderes angefangen hat oder schlimmer war. Wenn sie sich selber auf das selbe Niveau, haben sie ebenfalls eine Strafe verdient. Zudem heißt wehren nicht, zurückflamen. Die meisten scheinen ihre verbalen Attacken als eine Form von Notwehr zu sehen. Notwehr heißt aber nicht Rache, sondern beinhaltet die Mittel, die den geringsten Schaden verursachen, um sich selbst zu schützen. Bei Flamern wäre das der Mutebutton. An einem Flamewar teilnehmen wäre höchstens ein Gegenangriff und hat zudem so gut wie nie als Auswirkung, dass der andere aufhört zu flamen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2018-07-08T15:32:40.641+0000","up_votes":1,"down_votes":0,"body":"also mich würde das ja aus einem einzigen Grund wirklich interessieren. Und das sind meine eigenen Spiele, bei denen ich meine Mitspieler halt sehr schnell mute. Und dann ist es schwierig nachzuvollziehen, ob die dann wirklich so sehr weiter geflamed haben, dass sie reported werden müssen, oder ob ich um meine eigenen Konzentration zu wahren überreagiert habe...","replies":[{"poster":"Nordwolf87","date":"2018-07-09T08:48:53.340+0000","up_votes":1,"down_votes":0,"body":"War auch mein erster gedanke.","replies":[]}]},{"poster":"XenesisCH","date":"2018-07-08T15:31:34.389+0000","up_votes":1,"down_votes":0,"body":"Ich sehe keinen Nutzen in herunterladbaren Chatlogs. Die Chatlogs welche zur Verfügung gestellt werden, reichen völlig aus, um jemandem aufzuzeigen, weshalb er bestraft wurde. Tun sie das nicht, so werden es auch 100 weitere Chatlogs nicht tun.","replies":[]},{"poster":"LiebesWölkchen","date":"2018-07-08T13:01:04.843+0000","up_votes":1,"down_votes":3,"body":"Lass das mal die leute von riot machen, die machen ihre arbeit gut.\nVerschwende deine zeit nicht mit solchen sozial-gescheiterten Menschen.","replies":[{"poster":"RM Heartmeander","date":"2018-07-08T14:50:39.316+0000","up_votes":1,"down_votes":0,"body":"Trotzdem würde ich gerne meine eigenen Chatlogs einsehen können^^\nIst doch interessant zu wissen was man selbst so schreibt.","replies":[]}]},{"poster":"Alpacana","date":"2018-07-08T13:23:38.200+0000","up_votes":1,"down_votes":0,"body":"Ich finde die Frage ziemlich interessant.\nIch wäre eindeutig NICHT dafür, du wirst meinen post dazu wahrscheinlich auch schon gelesen haben.\nLetztendlich läuft es ja nur darauf hinaus zu schauen ob man sich \"zurecht\" verteidigt und genau das ist ja der Grund warum Riot nur den eigenen Chatlog bei einem Ban vorlegt. \nEs ist vollkommen egal ob es zurecht ist oder nicht, sobald du selbst flamest, bist du auch selbst Schlud und hast die Konsquenzen zu tragen.\nDie Mute-Funktion ist eine wunderbare Funktion und steht jedem zu, \"Der hat aber angefangen\" ist und bleibt meiner Meinung nach Kindergarten und rechtfertigt nicht, zurück zu flamen.\nSachlich zu argumentieren ist wiederum eine andere Sache (die aber, wie ich ja schon in dem anderen Post geschrieben habe, meist nur auf eine Wand trifft) und auch kein Grund zum Bannen ist. Solltest du gebannt sein, hast du höchstwahrscheinlich geflamed und somit deine eigene Verantwortung zu tragen.","replies":[{"poster":"RM Heartmeander","date":"2018-07-08T14:50:08.324+0000","up_votes":1,"down_votes":0,"body":"Hab ich leider nicht, da ich afk war und der Thread inzwischen gelöscht wurde.\nWie du vielleicht gelesen hast, bin ich der Meinung dass beide Schuld haben bzw. alle die flamen, denn sie flamen ja und es gibt nicht aber der hat angefangen.\n\nDie Chatlogs sollten ja nur einzeln heruntergeladen werden von dem Spieler auf dessen Profil man sich befindet.\nSchlussendlich wäre es ja an sich egal wenn man auch die anderen Chatlogs herunterladen würden, da dies keinen Einfluss darauf hat dass man selbst geflamt hat.\n\nEvtl. könnte man aber dadurch den Leuten aufzeigen was sie anders hätten machen können in dem man z.B. sagt ja nachdem Person x das gesagt hat, wieso hast du ihn nicht einfach gemutet?\nOder man könnte dann auch vorlegen, dass die Person eben nicht nur einmal geflamt hat sondern mehrere Spiele lang bzw. immer wieder und deswegen gerechtfertigt.\n\nIch persöndlich fände es aber sehr interessant bei den eigenen Spielen nur die eigenen Chatlogs herunterladen zu können, einfach weil es mich interessiert wie viel ich so schreibe und was ich so schreibe um halt Vergleiche zu ziehen und dann wirklich schreiben zu können: Also ich schreibe im Spiel vielleicht 3% von dem was du schreibst oder bei mir steht nur gj, nice, wp oder gg.","replies":[]}]}]}