{"poster":"RM Heartmeander","date":"2015-06-04T21:12:57.440+0000","title":"Neue Meditation fehlerhaft?","subforum":"Melde einen Bug","up_votes":2,"down_votes":0,"body":"Meditation\r\nB&Auml;UMCHEN WECHSLE DICH &bdquo;Meditation&ldquo; hat im Baum der Wissen-Meisterschaft den Platz mit &bdquo;Kluger Kopf&ldquo; getauscht.\r\nJE MEHR DU INVESTIERST, DESTO MEHR BEKOMMST DU Gew&auml;hrt 1/2/3 Manaregeneration alle 5 Sekunden. &rArr; Stellt alle 5 Sekunden 0,5/1/1,5 % des fehlenden Manas wieder her. \r\n\r\nWenn man es sich in nem Spiel achtet, steigt die Manareg nicht weiter an, egal wie viel Mana man verbraucht.\r\n\r\nWenn man sich hingegen Kelch der Harmonie kauft ist das anders.\r\n\r\nEINMALIG, Passiv - Manaquelle: Stellt alle 5 Sekunden 2 % des fehlenden Manas wieder her.\r\n\r\nSprich die Passive ist genau die gleiche doch die aus den Masteries wirken gar nicht.\r\nDas ist ein finde ich doch sehr erheblicher Bug, da dass ganze 3 verschwendete Punkte sind dadurch.\r\n\r\nVielleicht &uuml;bersehe ich ja auch etwas aber ich hab es mal versucht in einem freinen Spiel.\r\nDie Manareg hat sich kein bisschen ver&auml;ndert egal ob 100% oder 0% Mana. (hab es level 6 mit GP versucht, wobei das ja eigentlich egal ist wer ausser Veigar)\r\n\r\nFakt ist, die Manareg wurde nicht ver&auml;ndert egal wie viel Mana man verbraucht hat.\r\nErst als ich den Kelch gekauft habe war die Manareg variabel sprich je weniger ich hatte, desto h&ouml;her.","replies":[{"poster":"Protective Puppy","date":"2015-06-05T03:10:54.825+0000","up_votes":2,"down_votes":0,"body":"Schonmal bei jemanden anders erklärt:\nDu bekommst wortwörtlich alle 5 Sekunden einen Wert Mana wieder. Und nicht diesen Wert ÜBER die 5 Sekunden, wie es normalerweise mit Items ist.\n\nDas ist bei der Perseverance-Mastery im Tank-Tree genauso.","replies":[]},{"poster":"RM Heartmeander","date":"2015-06-05T18:36:54.018+0000","up_votes":1,"down_votes":0,"body":"Dann läuft aber wirklich etwas schief, da eben der Kelch wortwörtlich die gleiche Passive hat.\nDaher ist eines von beidem falsch.\n\nBzw. ist es normalerweise nicht in den /5sec gerechnet?\nIch meinte bsp. bei Mundo und den anderen Passiven ist das so die % alle 5sec was machen.","replies":[]},{"poster":"crit in ur anus","date":"2015-06-05T01:08:58.579+0000","up_votes":1,"down_votes":0,"body":"da hat riot wohl mist gebaut :D","replies":[]}]}