{"poster":"Skarnye West","date":"2016-07-25T18:44:25.218+0000","title":"Patch 6.15 - The One Where The Towers Change","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Welcome back to Patch Chat!\n\nI&rsquo;m Gentleman Gustaf, and here with me is Riot&rsquo;s Playtest Team, a group of high-ranking League players whose job it is to play the hell out of things and give actionable objective feedback to designers. Think of us as your high-Elo friends who happen to have played the new patch, rework, or champion long before it ever came out.\n\nEvery two weeks, concurrent with the release of [patch notes](http://na.leagueoflegends.com/en/news/game-updates/patch/patch-615-notes), we&rsquo;re going to be hosting a discussion here on Dev Corner. **Take this opportunity to ask us any questions about how we feel about the game or what it&rsquo;s like to work as a Riot playtester**.\n\nSeveral of our playtesters have competitive experience with lane swaps, so if you want to know how we think they will affect lane swaps - or just regular play - leave your questions below!\n\nIn competitive play, we expect to see fewer fast-push lane swaps. Specifically, we expect that lane swaps will now at least be contested, thanks to the value of tower first blood and the weaker bot side towers. This may change after the first five minutes of the game, but by then champions have their full basic kits (no ultimates yet) and can take better advantage of the mechanical aspects of the game in additional to the tactical.\n\nIn solo queue, we think that champions who can poke towers early on (Caitlyn?) might have the **option** of taking towers somewhat earlier, but that it probably won&rsquo;t have much of an impact.\n\nWe will be around for the next few hours and will try to answer as many questions as possible.\n\nAdam &quot;_Afic_&quot; Cohen\nPreston &ldquo;_Hinder_&rdquo; Bunker\nBen &ldquo;_Cezium_&rdquo; Burkhardt\nShawn &ldquo;_I Am The IRS_&rdquo; Currie\nDon &ldquo;_Aesah_&rdquo; Ding\nNicolas &ldquo;_Gleeb_&rdquo; Haddad\nDan &ldquo;_Penguin_&rdquo; Hardison\nMiles &ldquo;_Daydreamin_&rdquo; Hoard\nBao &ldquo;_Bao_&rdquo; Lam\nRobert &ldquo;_RobertxLee_&rdquo; Lee\nNicholas &ldquo;_Nickwu_&rdquo; Smith\nBlake &ldquo;_S0be_&rdquo; Soberanis\nTrevor &ldquo;_ThEntropist_&rdquo; Thernes","replies":[{"poster":"InTheory","date":"2016-07-26T03:36:24.136+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"playtestpenguin","date":"2016-07-26T06:50:54.429+0000","up_votes":1,"down_votes":0,"body":"That change actually didn't go through -- Cannon minion functionality will be the same.","replies":[{"poster":"DeathBurst","date":"2016-07-26T12:07:18.002+0000","up_votes":3,"down_votes":0,"body":"Anyway, it was already 1 every 3 waves before, no? It's just the timing that would have been modified.","replies":[{"poster":"InTheory","date":"2016-07-26T17:20:19.766+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"DeathBurst","date":"2016-07-26T18:33:06.278+0000","up_votes":4,"down_votes":0,"body":"I'm pretty sure that's not the case. If you look at the cost efficiency of gold generation items on the Wikia, you can see that the computations are done with a canon in every third wave before the 20 minutes mark.\n\nSee: http://leagueoflegends.wikia.com/wiki/Ancient_Coin for instance.","replies":[]}]}]}]}]},{"poster":"Shíny","date":"2016-07-25T19:57:47.776+0000","up_votes":1,"down_votes":0,"body":"Have there been any interesting developments from top lane not getting a siege minion until wave 5? Seems like there'd be some shifts in power spikes and what not.","replies":[{"poster":"Riot ThEntropist","date":"2016-07-26T00:00:54.414+0000","up_votes":4,"down_votes":0,"body":"This changed was pulled last minute and will not be in the patch.","replies":[]}]},{"poster":"astralwit","date":"2016-07-25T18:58:28.343+0000","up_votes":7,"down_votes":3,"body":"Any thoughts on buffing Ziggs' W AP ratio? It's a very low 35% AP ratio for a 26 sec. CD ability. Ziggs has the slowest MS of any mage so using his only escape for damage should provide more reward. I often want to play Ziggs in a riskier style with W but it rarely feels worth it.","replies":[{"poster":"Aesah","date":"2016-07-26T01:26:41.336+0000","up_votes":1,"down_votes":0,"body":"Ziggs's winrate is solid right now so he probably doesn't need a straight buff-  if you meant keeping his overall damage equal but putting more of the power in the W and taking it off his Q or E, IMO that would feel bad since you're *always* using the Q/E in your burst combo but only using the W a fraction of the time. In other words, W would still be best used as a utility spell so it would feel worse to give up more damage in those cases.","replies":[{"poster":"PrometheS","date":"2016-07-26T03:18:39.873+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Aesah,realm=NA,application-id=A7LBtoKc,discussion-id=ZcrdAVMB,comment-id=00000000,timestamp=2016-07-26T01:26:41.336+0000)\n>\n> Ziggs&#x27;s winrate is solid right now so he probably doesn&#x27;t need a straight buff-  if you meant keeping his overall damage equal but putting more of the power in the W and taking it off his Q or E, IMO that would feel bad since you&#x27;re *always* using the Q/E in your burst combo but only using the W a fraction of the time. In other words, W would still be best used as a utility spell so it would feel worse to give up more damage in those cases.\n\nZiggs seems fine but middle of the pack at best due to his unreliability and squishiness. Still, buffing the satchel damage ratio to 40% or even 50% AP wouldn't be significant in actual gameplay. \n\nThe cooldown is too long to abuse this ability and he also depends on the utility. His all-in dueling would be better but it would still not be something he's good at. I think he deserves a minor bump in W damage because he leaves a lot to be desired late game and isn't really a lane bully either (he might poke you a bit but it's not a kill threat unless you choose to disrespect him). \n\nHis utility is mediocre so all he really has is decent consistent damage. Just compare Ziggs to the massive utiltiy and safety of Anivia. I'd say her damage is on par or better than his while she has far better zone control, more safety, more utility and more burst. Her poke is a bit better but I could use Vel'Koz and say the same thing.","replies":[{"poster":"The Last Ballad","date":"2016-07-27T18:13:16.031+0000","up_votes":1,"down_votes":1,"body":"But neither of them can destroy towers that have been poked down with the defenders still near...","replies":[]}]},{"poster":"Newten","date":"2016-08-08T03:11:47.454+0000","up_votes":1,"down_votes":0,"body":"So everything is based on win rates? Wow, great justification there.","replies":[]},{"poster":"Rivuo","date":"2016-07-26T01:48:27.017+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Aesah,realm=NA,application-id=A7LBtoKc,discussion-id=ZcrdAVMB,comment-id=00000000,timestamp=2016-07-26T01:26:41.336+0000)\n>\n> Ziggs&#x27;s winrate is solid right now so he probably doesn&#x27;t need a straight buff-  if you meant keeping his overall damage equal but putting more of the power in the W and taking it off his Q or E, IMO that would feel bad since you&#x27;re *always* using the Q/E in your burst combo but only using the W a fraction of the time. In other words, W would still be best used as a utility spell so it would feel worse to give up more damage in those cases.\n\nCan you guys please tell the splash art department about this splash?\n\nhttp://i.imgur.com/G8vo6yT.png[/img]\n\nKalistas fingers arent the same. She has a perfectly normal thumb, then she has disjointed messed up fingers.","replies":[]}]}]},{"poster":"The Yetii Rider","date":"2016-07-26T00:37:13.889+0000","up_votes":2,"down_votes":0,"body":"Are you having more success building mana regen or mana on Sona?\n\nWith the change from 6.14 to reduce all her cooldowns, it seems more likely that she would need something like a larger mana pool to keep her spells constant in a fight (and with the ridiculous cadence increase, the % mana cost reduction from {{item:3003}} might be good on her)\n\nSuggestions for a full build on Sona this patch?","replies":[{"poster":"DeathBurst","date":"2016-07-26T02:28:47.395+0000","up_votes":1,"down_votes":0,"body":"Yeah, I'd like an answer to that question too.","replies":[]}]},{"poster":"DrDoom12912","date":"2016-07-25T20:05:22.992+0000","up_votes":1,"down_votes":0,"body":"Any thoughts on a Yorick re-work?","replies":[{"poster":"playtestpenguin","date":"2016-07-25T23:30:28.876+0000","up_votes":2,"down_votes":0,"body":"It's being worked on and pretty cool if I say so myself.","replies":[{"poster":"patmax17","date":"2016-07-26T06:28:41.991+0000","up_votes":1,"down_votes":0,"body":"How many ghouls? :D","replies":[]},{"poster":"Volcanuz","date":"2016-07-26T06:40:49.165+0000","up_votes":1,"down_votes":1,"body":"What about a nunu rework.. i would love to see this guy work again in low ELO or just in general. Even in pro/high elo games his hardly touched, he only has a good W/L because people hardly play him and those who do tend to get carried in the game. (seriously look here http://www.probuilds.net/champions/details/Nunu most those games his impact was tiny)\n\nAll i would need is a better ult like you did with Ryze. Something that works more with him.","replies":[]}]}]},{"poster":"warpenguin555","date":"2016-07-25T20:49:35.646+0000","up_votes":1,"down_votes":1,"body":"Super disappointed by Kled. Honestly his Kit is just everything i dont want to play with put into 1 champ","replies":[{"poster":"SirPurrr","date":"2016-07-25T21:14:49.643+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=warpenguin555,realm=NA,application-id=A7LBtoKc,discussion-id=ZcrdAVMB,comment-id=0005,timestamp=2016-07-25T20:49:35.646+0000)\n>\n> Super disappointed by Kled. Honestly his Kit is just everything i dont want to play with put into 1 champ\n\nLeauge might already have too many champions at this point. I'm not saying they can't add more, but the number is getting unwieldy from a balance perspective given how many different comps. can be created. You already see this because only about half the roster is used with any regularity so the number of champions, while large on paper, isn't really relevant. \n\nUntil League actually can claim to make use of its full champion roster, it seems silly to add more (at least from a game perspective rather than business). I still remember how Blizzard was actively removing units from SC2 early on due to lack of sufficient gameplay function to offset the balance issues they invariably create. With that said, it's too early to judge Kled. He seems fun to play but may not be fun for opponents. ;D","replies":[{"poster":"Thaurron","date":"2016-07-27T23:54:56.072+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SirPurrr,realm=NA,application-id=A7LBtoKc,discussion-id=ZcrdAVMB,comment-id=00050000,timestamp=2016-07-25T21:14:49.643+0000)>He seems fun to play but may not be fun for opponents. ;D\n\nThis is a serious problem with some champion's design that needs to be addressed. It may be fun to zip around as Yasuo and completely nullify a massive amount of abilities, but if you don't pick a champ that can deal with those things then you're kind of screwed.\n\nAnd don't get me started on the shield...","replies":[]}]}]},{"poster":"Frnak","date":"2016-08-05T02:46:15.940+0000","up_votes":2,"down_votes":1,"body":"Sweet job. Hire me pls.\n\n\nAlso, please fix Malzahar. Rework not grape success. It's cherry bad. \"Front lines battle mage\" is Ryze's dealio. Malz was heavy punisher. Now he's. Noodley slap man with OMGVOIDLINGSbutohwekilledthem nvm.  high level play = QSS lol no damage no suppression with all this burst going on. Can't really go RoA because 20% CDR is vital to him now that his base values and AP values **were nerfed into oblivion.**\n\n\nRito. I've played with him. So much. Even rework I've tried constantly to like it. I **TRY TO LIKE IT**. I cannot. \n\nHe's no longer impactful unless it's to R someone. Or someone tries to 1v1 and forgets to knock off that one voidling.","replies":[{"poster":"OG Elfton","date":"2016-08-05T11:38:47.183+0000","up_votes":2,"down_votes":1,"body":"Malz Needs a nerf not a buff{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Frnak","date":"2016-08-07T00:37:46.385+0000","up_votes":1,"down_votes":0,"body":"He's basically \"lol I hit e w muh voidlings getchu lololol teh plays\"\n\nor\n\n\"omg pressing R I hope someone is nearby to actually kill them\".\n\n\nHe just got another nerf to his passive. It's .25 secs now and longer CD. Oh, poke, then engage, amaze, hard, mang.","replies":[]}]}]},{"poster":"EROTIC RAID BOSS","date":"2016-07-26T02:51:46.228+0000","up_votes":2,"down_votes":1,"body":"What are your thoughts on this meta heading into worlds? \n\nIt seems to me, once again pretty stale in the jungle especially.\n\nAlso seems unfortunate that the meta is so dominated by kind of more boring champions like Malzahar, while fun champions that are hated by... certain players... like Zed, were really very overnerfed. I'll add thresh, kalista, riven and lee sin to the list. This probably won't earn me any popularity points on the whiniest boards I've ever seen, but those champions are fun to watch and they don't deserve to be so low tier either. I'll also say Azir is a lot of fun to watch and he definitely got Olaf'd to hell but I understand he was crowding out mid lane a lot. On the other hand it doesn't seem to have helped open up the mid lane meta much yet\n\nI guess what I want to know is, is the meta wide enough to support an interesting Worlds right now, and is there time to shake it up a little more, before we're locked into super minor changes that don't change anything (ie the ezreal and corki buffs last year)","replies":[{"poster":"Thaurron","date":"2016-07-27T23:52:11.702+0000","up_votes":1,"down_votes":0,"body":"I personally don't find Zed fun at all, it almost feels like his kit automatically outplays for you. Most skillful plays involve him porting to a shadow to dodge something, which honestly requires very little thought (especially with his ulti) and is heavily weighed in his favor in terms of counterplay - if he ultis you over a wall and you can't kill him in one second (or however long you can cc him) he'll just blink away. And swapping to his W shadow then his R shadow (or vice versa) isn't exciting because again, if he placed his shadows in a not-stupid location it's easy to blink away without any consequence.","replies":[{"poster":"EROTIC RAID BOSS","date":"2016-07-28T07:14:45.765+0000","up_votes":1,"down_votes":0,"body":"I think you're overstating how easy it is to make plays with his shadows. and overlapping shurikents dramatically increases your damage.\n\nits also pretty easy to counter his ult so that he doesn't kill you, between exhaust and zhonyas.\n\nin fact i'd guess you don't really play zed you just don't like playing against him. people trying to say zed isn't a high skill cap champ with a lot of room for different plays, are frankly full of shit. same goes with many of the other champs that are popular to hate, like yasuo leblanc azir lee sin etc","replies":[]}]},{"poster":"welovegag","date":"2016-07-26T05:23:59.287+0000","up_votes":1,"down_votes":0,"body":"I think riot should have buffed some of the champs with high difficulty caps especially zed. Not saying that hes not powerful enough but overall just felt like they should be balancing a champ based on damage output, difficulties, health, ability power, etc \nSome of the champs like vayne which i dont think needs any buff but becoz of popularity, they just decided to buff her to boost the popularity :S as a vayne main, a bit of dissappointment","replies":[{"poster":"InTheory","date":"2016-07-26T07:44:32.091+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"welovegag","date":"2016-07-26T09:35:59.287+0000","up_votes":1,"down_votes":0,"body":"I dont know abt the win rate of vayne but in my elo, vayne is usually bad af. Like total disaster lol","replies":[{"poster":"InTheory","date":"2016-07-26T11:31:00.208+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"welovegag","date":"2016-07-27T01:22:30.413+0000","up_votes":1,"down_votes":0,"body":"Doesnt keep me out from playing her too xdd shes just way stronger than other adc after having two to three core items.","replies":[]}]}]}]}]}]},{"poster":"InTheory","date":"2016-07-26T03:31:02.992+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MVpmack","date":"2016-07-28T04:05:06.769+0000","up_votes":1,"down_votes":0,"body":"tbh this is always going to happen, because jungle is much less about matchups and more about overall game impact, so the champs with the most desirable interactions with the game are going to be the most played. it's actually not too bad that there are 5 junglers now in pro play (the champs you listed plus Graves). last worlds it was like 3 junglers, really terrible. as long as the rest of the jungle cast is ok in normal play, it's not that bad. plus someone always plays lee sin and there's some occasional pocket picks with reignover's olaf or inori's rengar. really the jungle is tons better than last worlds, and I'm sure they're always working to add a bit more diversity.\n\nthe biggest issue is that there are fewer risky invades because pro teams are better at countering it, so the super invade fighter type junglers (pantheon, shyvana) are not as good in pro play.","replies":[]}]},{"poster":"WaterDonkey","date":"2016-07-26T10:18:25.941+0000","up_votes":1,"down_votes":0,"body":"Ive been noticing alot lately that jungle camps. mainly red and blu buffs minions will follow you for a LONG time some times all the way to tri bush. Is that intended?","replies":[{"poster":"MVpmack","date":"2016-07-28T03:59:51.834+0000","up_votes":1,"down_votes":0,"body":"chiming in here. if you get talisman, and camps reset but the talisman is still hitting them when they reset, they will aggro on you pretty far. kind of a weird interaction with the way patience works.","replies":[]}]},{"poster":"Kei143","date":"2016-07-26T08:41:51.310+0000","up_votes":1,"down_votes":0,"body":"Hijacking this from the other thread. \n\n> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=2YORAqEJ,comment-id=000f0000,timestamp=2016-07-26T03:15:53.313+0000)\n>\n> Pushing power was the bigger concern than gold income. Cannons make an enormous difference in ability to take down towers, given they both take hits before other squishier minions and take reduced damage from towers.\n\nAsking the pros / people that understand the game better; Not saying that meddler doesn't have the understanding, but the Point of View of a Diamond / Pro player is very different than commoners.\n\nIf the cannon minions spawned in the top lane first, how would that affect the tower pushing / lane swap game?","replies":[]},{"poster":"Malicious Metal","date":"2016-07-25T23:35:20.060+0000","up_votes":1,"down_votes":0,"body":"I sure hope Mordekaiser turning out to be numero Uno Jungler caused some eyebrows to be raised^^\nAny thoughts on his current state, outside of Jungle too?\n\nBecause I feel he's actually one of the most criminally underrated picks at the moment.\n(And no, this is no shameless advertisement, nu-uh!)","replies":[{"poster":"Mordepool","date":"2016-07-26T08:27:39.990+0000","up_votes":1,"down_votes":0,"body":"Noone especially riot care about him with such a small sample size the 50+ winrate means nothing.   Sry malice. Thats how they see it.   \n\nThen again riot Saw melee carries last year and we all know that was bs","replies":[]}]},{"poster":"patmax17","date":"2016-07-26T06:30:11.796+0000","up_votes":1,"down_votes":0,"body":"Thoughts on Kled? What does he excel at? :D\n\nI must admit, the kit seems a bit random to me, I fail to see the cohesiveness (but I guess it will get clearer when I can play him?)","replies":[]},{"poster":"SpecterVonBaren","date":"2016-07-26T01:52:40.733+0000","up_votes":1,"down_votes":0,"body":"Did you consider adjusting it so instead of bot getting the cannon the same wave as before, mid getting it one wave later and top two waves later that it was instead that bot lane gets the cannon 1 wave earlier than before, mid lane gets it the same wave as before, and top gets it one wave later?\n\nIt would make the change a lot less extreme and even be seen as a buff for bot lane instead of just nerfs to mid and top.","replies":[]},{"poster":"Kei143","date":"2016-07-25T20:17:28.075+0000","up_votes":1,"down_votes":0,"body":"HEY GG, \nAccording to patch 6.15\n\n>**Champion Select**\n>We’re testing a feature in some regions that shows how much lower or higher queue times may be based on the positions selected.\n>\n>We know queue times can vary dramatically depending on the roles a player picks, so we’ve added queue time impact estimates to position select as an experiment in test regions. Now you can decide if you prefer getting into game or getting your primary. We’ll evaluate rolling out the feature to other servers based on the results of the test, but wanted to keep you updated on our efforts either way.\n>\n> ####*TIMES TABLES*: Position select now displays when and to what degree particular position combinations impact estimated queue times\n\nDo you know which region is in for testing ?","replies":[{"poster":"Riot ThEntropist","date":"2016-07-26T00:01:22.194+0000","up_votes":1,"down_votes":0,"body":"Sadly this is not something our team works on so we have very limited knowledge on it.","replies":[]}]},{"poster":"LongHair Fox","date":"2016-07-25T20:45:16.406+0000","up_votes":1,"down_votes":0,"body":"As a top lane main I have got to worry: does the change in turret protection mean that turret first blood almost always goes to bot lane? The teleport nerf already makes it hard to affect bot lane from top, and if bot lane gets even more importance than it already has it feels like top will get even less weight on the game.","replies":[]}]}