{"poster":"Sparschwein","date":"2017-09-14T19:32:41.099+0000","title":"Probleme beim Match finden","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Community,\r\n\r\nIch habe das Problem, dass ich Matches (ARAM) finden m&ouml;chte. obwohl gesch&auml;tzte dauer etwa 40 Sekunden ist dauert es weit &uuml;ber 1:30 min bis ich die suche dann abbreche. Wenn ich die Suche dann abbreche erscheint ein Fenster in dem behauptet wird ich hatte die Championauswahl verlassen oder Spiele zu oft abgelehnt. Leider hatte ich ja gar nicht die Chance Spiele anzunehmen. Ich w&auml;re ja froh eines annehmen zu k&ouml;nnen, so ich doch gerade gerne spielen m&ouml;chte. Das ganze hat sich jetzt schon mehrmals wiederholt. Ich habe versucht LOL neu zu starten aber wieder das selbe Problem. Jetzt kann ich mich f&uuml;r 30 Minuten nicht mehr in die Warteschlage einreihen (davor 15 Minuten). Bei den FAQs hab ich dazu leider nichts gefunden oder es nicht als das selbe Problem erkennen k&ouml;nnen. \r\n\r\nKann mir jemand weiterhelfen? Was k&ouml;nnte die Ursache f&uuml;r das Problem sein?\r\n\r\nGr&uuml;&szlig;e Sparschwein","replies":[{"poster":"HHaie tabbian","date":"2017-09-14T19:53:59.964+0000","up_votes":2,"down_votes":0,"body":"Ich habe schonmal gehört, dass es diese Sperren geben soll, aber du bist der Erste, von dem ich es direkt höre.\nWenn du Warteschlangen extrem häufig abrichst, wirst du dafür bestraft, weil es negative Auswirkungen haben kann, wenn sehr viele Leute das tun würden.\nWenn da eine geschätzte Wartezeit von 40 Sekunden steht, und du nach 1:30 noch nichts hast, wieso brichst du dann ab? Das ist vollkommen normal und ich bin mir relativ sicher, dass du nach 3 Minuten in mehr als 90% der Fälle ein Spiel gefunden hast.","replies":[{"poster":"Sparschwein","date":"2017-09-14T20:05:15.348+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=7hciEY9w,discussion-id=PhXPma2r,comment-id=0001,timestamp=2017-09-14T19:53:59.964+0000)\n>\n> Ich habe schonmal gehört, dass es diese Sperren geben soll, aber du bist der Erste, von dem ich es direkt höre.\n> Wenn du Warteschlangen extrem häufig abrichst, wirst du dafür bestraft, weil es negative Auswirkungen haben kann, wenn sehr viele Leute das tun würden.\n> Wenn da eine geschätzte Wartezeit von 40 Sekunden steht, und du nach 1:30 noch nichts hast, wieso brichst du dann ab? Das ist vollkommen normal und ich bin mir relativ sicher, dass du nach 3 Minuten in mehr als 90% der Fälle ein Spiel gefunden hast.\n\nHallo Tabbian,\n\nDanke für die einschätzung. Ich habe das jetzt probiert einfach länger gewartet. Jetzt war es so nach etwa dem doppelten der geschätzten Zeit hat es  scheinbar ein Spiel gefunden. Es kommt also der Kreis der die ablaufende Zeit anzeigt und der Annehmen und ablehnen Button. Da ich natürlich Spielen möchte klicke ich auf annehmen. In diesem Moment erscheint wieder die Meldung ich hätte zu viele Spiele abgelehnt. Die Folge: du errätst es sicher. Wieder 30 Minuten gesperrt.\n\nEinfach warten ist also auch nicht des Rätzels Lösung.\n\nGrüße Sparschwein","replies":[{"poster":"HHaie tabbian","date":"2017-09-14T21:16:26.080+0000","up_votes":2,"down_votes":0,"body":"Das klingt für mich eher so, als ob dein Client auch noch eine Fehlfunktion hätte, wodurch dir es zu spät angezeigt wird, dass ein Spiel gefunden wurde, sodass in dem Moment, in dem du auf \"annehmen\" klickst, die tatsächlich Zeit, die man zum Annehmen hat, bereits vorbei ist.","replies":[{"poster":"Sparschwein","date":"2017-09-15T08:57:57.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=7hciEY9w,discussion-id=PhXPma2r,comment-id=000100000000,timestamp=2017-09-14T21:16:26.080+0000)\n>\n> Das klingt für mich eher so, als ob dein Client auch noch eine Fehlfunktion hätte, wodurch dir es zu spät angezeigt wird, dass ein Spiel gefunden wurde, sodass in dem Moment, in dem du auf &quot;annehmen&quot; klickst, die tatsächlich Zeit, die man zum Annehmen hat, bereits vorbei ist.\n\nJa sowas in der Art vermute ich auch. Die frage ist wie kann ich das beheben?\nGerade wurde wieder ein update gemacht vielleicht hat es das Problem für mich behoben. Vielleicht hätte ich gestern auch einfach mal drauf kommen sollen den PC komplet neu zu starten, vielleicht bringts das.\n\nGrüße Sparschwein","replies":[]}]}]}]},{"poster":"Z4NTHR4X","date":"2018-03-13T14:00:24.305+0000","up_votes":1,"down_votes":0,"body":"Hallo, ich bekomm seit heute andauernd Sperren weil es zu keiner Championauswahl kommt. Ich klicke immer aber irgendwann kommt dann ein Fenster mit einer Sperre. Es nervt übel das man einfach nicht zu spielen kommt.","replies":[]},{"poster":"Gin","date":"2017-09-15T08:03:12.436+0000","up_votes":1,"down_votes":0,"body":"Die 40 Sekunden sind ein geschätzter Wert und keine Garantie dass du in dem Zeitraum ein Spiel findest.\n\nUnd das hört sich für mich so an als ob du Verbindungsprobleme hast. Verwendest du zufällig eine WLAN-Verbindung? Falls ja, wechsel mal auf eine LAN-Verbindung und schau ob das Problem weiterhin auftritt.\n\n(Hast du Ingame auch Probleme mit deiner Verbindung/deinem Ping, oder läuft dort alles ohne Probleme?)","replies":[{"poster":"Sparschwein","date":"2017-09-15T09:01:24.589+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gin,realm=EUW,application-id=7hciEY9w,discussion-id=PhXPma2r,comment-id=0002,timestamp=2017-09-15T08:03:12.436+0000)\n>\n> Die 40 Sekunden sind ein geschätzter Wert und keine Garantie dass du in dem Zeitraum ein Spiel findest.\n> \n> Und das hört sich für mich so an als ob du Verbindungsprobleme hast. Verwendest du zufällig eine WLAN-Verbindung? Falls ja, wechsel mal auf eine LAN-Verbindung und schau ob das Problem weiterhin auftritt.\n> \n> (Hast du Ingame auch Probleme mit deiner Verbindung/deinem Ping, oder läuft dort alles ohne Probleme?)\n\nHallo Gin,\n\nnein ich benutze eine LAN-Verbindung exakt aus dem Grund das WLAN als Fehlerquelle ausschließen zu können.\nIngame habe ich manchmal Pingdrops allerdings kann ich es immer auf weitere benutzer im Netzwerk zurückführen (war gestern nicht der Fall).\n\nGrüße Sparschwein","replies":[{"poster":"Gin","date":"2017-09-15T09:50:42.941+0000","up_votes":1,"down_votes":0,"body":"Es wäre möglich dass im Haus noch Geräte rumliegen die zwar nicht von jemandem aktiv verwendet werden, allerdings trotzdem Internet ziehen. (Tablets, Handys und co.)","replies":[{"poster":"Sparschwein","date":"2017-09-27T18:34:08.342+0000","up_votes":1,"down_votes":0,"body":"Das dachte ich auch, weshalb ich das WLAN aus gemacht habe und ich habe den einzigen PC der über Kabel angebunden ist.","replies":[]}]}]}]},{"poster":"AlieenHD","date":"2017-09-14T19:40:34.582+0000","up_votes":1,"down_votes":0,"body":"Glaub mir, hatte mal eine Queue time von 25 Minuten als 5er Premande, knack zuerst das.","replies":[{"poster":"Sparschwein","date":"2017-09-14T19:46:29.445+0000","up_votes":1,"down_votes":0,"body":"Hallo AlieenHD,\n\nIch kann mir Vorstellen das man als 5er Premade schwerer ein Spiel finden kann. Allerdings nicht Solo Aram. Außerdem erklärt das leider nicht die beschriebene Sperre oder das womöglich nicht angezeigte gefundene Spiel.\n\nDanke für deine Antwort auch wenn sie wenig hilfreich ist.\n\nGrüße Sparschwein","replies":[{"poster":"AlieenHD","date":"2017-09-14T20:23:28.459+0000","up_votes":1,"down_votes":0,"body":"Hatte halt echt mal 25 min Queue :D","replies":[{"poster":"Qbert","date":"2017-09-15T08:11:24.140+0000","up_votes":1,"down_votes":0,"body":"Kennst du noch die Zeiten, als es für den Login(!) eine Warteschlange gab?\nRekord lag da bei ca. 1h bei mir. :)","replies":[{"poster":"Sparschwein","date":"2017-09-15T09:05:46.571+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=7hciEY9w,discussion-id=PhXPma2r,comment-id=0000000000000000,timestamp=2017-09-15T08:11:24.140+0000)\n>\n> Kennst du noch die Zeiten, als es für den Login(!) eine Warteschlange gab?\n> Rekord lag da bei ca. 1h bei mir. :)\n\nJA kenn ich auch. Ich hab Ende 2009 während meines Studiums angefangen zu Spielen. Diese Probleme waren ja bekannt und betrafen alle. Die tatsache aber das die Zeit abgelaufen ist obwohl sie mir noch nicht als abgelaufen angezeigt wird ist aber neu (für mich) und da ich nichts darüber gefunden habe wohl auch ein individuelles Problem, was darauf schließen lässt, dass das Problem irgendwo an meinem PC liegt. Leider kann ich absolut nicht sagen was es sein könnte. \n\nGrüße Sparschwein","replies":[]},{"poster":"HHaie tabbian","date":"2017-09-15T08:15:54.352+0000","up_votes":1,"down_votes":0,"body":"Wenn ich mich richtig erinnere, ging die sogar ab und zu auf zwei Stunden. Dann hat man lieber was anderes gemacht :D","replies":[{"poster":"Qbert","date":"2017-09-15T08:38:44.023+0000","up_votes":1,"down_votes":0,"body":"genau, ich hab dann bspw. einfach WoW oder CS gespielt  und hab ab und an mal geschaut, ob ich schon im Client on bin xD\n\nDas waren noch Zeiten, da wird ich ganz andächtig!","replies":[]}]}]}]}]}]}]}