{"poster":"Heavykills","date":"2016-03-19T17:36:12.604+0000","title":"Decepcionado de los rioters","subforum":"Charlas Generales","up_votes":76,"down_votes":13,"body":"Antes de comenzar, quiero que se tomen esto a manera de refleccion y no como una simple critica.\r\n\r\n Ya es bien sabido que la pol&eacute;mica que se ha producido debido al evento de cajitas 2x1 para el servidor de LAN, ha alcanzando un punto bastante alto, me he paseado por varias discusiones en el foro y en grupos tanto oficiales como no oficiales de league of legends tanto del servidor de LAS como el de LAN, y lo que he logrado ver realmente me ha decepcionado bastante, somos una comunidad de personas que juegan algo en com&uacute;n, un juego que nos ha permitido pasar varias tardes de ocio con nuestros amigos y en algunas ocasiones familiares, que nos ha permitido conocer gente y aveces hacer nuevos amigos a trav&eacute;s de este juego, pero ahora somos separada no solo por barreras idiomaticas y geograficas, sino por odio, racismo, prepotencia e inmadurez, ya han sido muchos los comentarios insultantes que he visto por parte de los invocadores, de LAS y de LAN, insult&aacute;ndose los unos a los otros, a trav&eacute;s del foro, facebook,twitter, etc, algunos incluso proponiendo hacer eventos separados.\r\n\r\nNo se que que les parecer&aacute; a ustedes, el evento de mascaras para mi fue algo bastante divertido, lastima que se haya ensuciado con los eventos posteriores de ambas comunidades, ahora quiero hacer la pregunta:\r\n\r\n&iquest;que clase de conducta es la que quieren premiar?, si ahora que se sabe que igualmente LAN recibir&aacute; 2 skins por la compra de 1 cajita, que al final es casi exactamente  lo mismo que el 50% de descuento, al saber esto muchos invocadores han soltado risas y se han burlado de LAS, debido a que a ellos les ha ca&iacute;do un premio mucho mejor sin haber conseguido el supuesto premio por parte de riot.\r\n\r\n&iquest;De verdad quieren premiar de esta forma a una comunidad tan toxica?, no quiero poner enlaces ni fotos de los comentarios que he presenciado, espero baste con mi palabra, como dije antes, grande ha sido el despliegue de insultos, y muchas han sido las peleas que he visto entre ambas comunidades, a mi parecer lo mas sensato en este caso es realizar el evento de las programado para LAN, puesto que se les prometi&oacute;, pero no dejar al servidor de LAS fuera de esto, ya que esta comunidad, termino el evento satisfactoriamente, se que no faltara quien me insulte y me diga eres de LAS y solo tienes envidia, y a esto cito lo que dijo un rioter hace poco tiempo atras:\r\n\r\n- muchos RIoters no estaban c&oacute;modos con la idea de dar un premio a una meta que no se alcanz&oacute;.\r\n\r\ny no solo los rioters, sino que toda la comunidad de LAS, y espero que los que tengan conciencia en LAN, apoyen este punto, &iquest;si no cumplo una meta, por que he de recibir un premio?.\r\nahora, se decidi&oacute; dar como premio de consuelo al server de LAN este famoso evento, el cual genero toda esta polemica, la pregunta central de todo esto es:\r\nsi el evento de las mascaras abarcaba a ambos servidores &iquest;porque dejar el servidor de  LAS afuera?\r\ny d&iacute;ganme, los invocadores que lean esto, si los rioters de LAN est&aacute;n tan preocupados por tener a sus invocadores felices proponiendo este evento &iquest;por que los rioter de las ni siquiera se han hecho presentes?.\r\n\r\nes por eso damas y se&ntilde;ores que estoy algo decepcionado, no solo de los rioters por no hacerse presentes, estamos en los foros, estamos en facebook, el descontento de la gente se ve tanto que casi es palpable, tambien estoy decepcionado de ambas comunidades, no es momento de pelear, somo personas que aunque se quejen y no quieran aceptarlo, tenemos algo en com&uacute;n, jugamos league of legens y disfrutamos de ello, en lugar de formar una comunidad unida solo veo mas y mas odio, no he visto ninguna sugerencia por parte del los invocadores de LAN, proponiendo hacer el evento de cajitas para ambos servidores, solo veo burlas, ahora propongo, por favor invocadores, digan que soluci&oacute;n ven mas factible.\r\n\r\n1) Que el evento sea para ambos servidores.  esto es lo que me parece mas justo, ya que ambos servidores disfrutar&iacute;an del evento\r\n2) cancelar el evento de cajitas. esto no lo veo factible puesto que ya se le prometio a LAN  y muchos amenzaron con demandar por publicidad enga&ntilde;osa y tampoco seria justo mentirles de esta manera\r\n3) hacer otro evento, para limar asperezas entre ambas comunidades\r\n4) que alg&uacute;n rioter se haga presente y analice el tema mas a fondo y en esta hago &eacute;nfasis puesto que algo que diferencia a league of legends de otros juegos, es la preocupaci&oacute;n de los rioters por sus invocadores, constantemente mejoran este juego para que nosotros sigamos disfrutando de este, y es algo que me gustar&iacute;a ver en este caso.\r\n\r\nesto es lo que puedo expresar, mi forma de expresarme nunca ha sido la mejor, espero no generar descontento, quer&iacute;a expresarme con respeto, me gustaria, no recibir insultos solo quiero que expresen su punto de vista.","replies":[{"poster":"Supakuru","date":"2016-03-19T18:13:23.827+0000","up_votes":15,"down_votes":0,"body":"no mercy men, si LAN no llego al aspecto, mala suerte. {{item:3070}}","replies":[]},{"poster":"Phënom","date":"2016-03-19T18:23:51.997+0000","up_votes":10,"down_votes":1,"body":"bueno, primero que nada, yo encuentro que no era una mala idea dar a LAN un premio de consuelo, pero no es posible que el premio al segundo lugar sea mucho mejor al del primer lugar que se esforzó mucho mas en conseguir. \nAdemas de esto una vez que los rioters de LAN decidieron cancelar el evento 50% de descuento en cajas , se vio la conducta mas toxica y asquerosa que eh visto insultando a todos y todo lo que podían, incluso los mismos rioters dijeron \"Las cosas han llegado a tal seriedad que los Rioters de LAN han recibido amenazas de muerte en números significativos\" y entonces me pregunto, ¿esa es la conducta que se esta premiando? LAN no merecía un premio, pero una vez que se les promete algo no se les puede llegar y quitar las cosas. un error de Riot LA en gerenal y al parecer para tener mejores recompensas es mas fácil   flamear hasta que te escuchen :/","replies":[]},{"poster":"MisteriouSxD","date":"2016-03-19T18:23:02.797+0000","up_votes":4,"down_votes":13,"body":"Opino que exageran un poco... Ellos deben gastar dinero, a nosotros nos dan la caja gratis... Aparte la skin no hace ni ayuda a las habilidades como jugador... Sino simple... Se ponen graves con regalos de peso... Lo mas logico por parte de riot seria sacar esos premios y hacer premios que no hagan sacar el lado oscuro de la comunidad, daran solo aumentos xD\nGente como favor... LAS ya esta i festado de gente rage... Es el punto de inflexión... Cambiemos la opinion de este server, disfrutemos de lo gratis... Y no la caguemos mas con pensamientos tan egoistas... Espero sea posible la opcion de eventos mas seguidos... Nos haría unirnos mas como comunidad... Eso saludos compañeros invocadores. Paz","replies":[{"poster":"Jeremías 17 5","date":"2016-03-19T18:35:42.317+0000","up_votes":10,"down_votes":0,"body":"Cierto ellos gastan dinero por una caja que le da 2 Skins... O sea que tienen una Gratis de todos modos, siguen ganando igual. Pero ya fue, discutir con los Rioters es en vano, siempre tendrán razón.","replies":[]},{"poster":"Scalibur5300","date":"2016-03-20T23:55:15.959+0000","up_votes":2,"down_votes":0,"body":"Esto no involucra habilidades individuales, estamos hablando de \"igualdad de servidores\", Ellos deben gastar dinero, pero si sacas bien la cuenta un 50% de descuento en cajas (490 = 245+245= 1 caja gratis + 1 caja paga al 100%) Es practicamente lo mismo, e incluso ganan mas que el nuestro Servidor como tal que logro la meta propuesta, la verdad a mi esta discusion me tiene sin cuidado, ya que si Riot regala o no Skins u otros recursos pagos, seguire jugando, y nada cambiara mi opinion.\n\nSaludos Misterious !","replies":[]}]},{"poster":" Quicksand","date":"2016-03-19T18:40:28.580+0000","up_votes":6,"down_votes":1,"body":"Solo espero que NUNCA MÁS TENGAMOS EVENTOS COMPARTIDOS CON LAN, solo eso espero de parte de riot... ya la CA** BASTANTE, y con LAS esta en deuda y lo saben...","replies":[]},{"poster":"Riot Cóndor","date":"2016-03-19T19:09:55.768+0000","up_votes":20,"down_votes":33,"body":"> [{quoted}](name=Heavykills,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=,timestamp=2016-03-19T17:36:12.604+0000)\n>\n>  algunos incluso proponiendo hacer eventos separados.\n\nEl evento nunca fue pensado como un evento conjunto. De hecho, y tal como ya mencioné en otro hilo, antes de empezar a hacer los cálculos y proyecciones de puntaje (como todo el proyecto es complejo y tiene muchas tareas que se dividen entre varias personas, los encargados de esta parte fuimos Cedriel y yo), pensábamos que ambas regiones tendrían puntaje separado. Cuando nos encontramos con la realidad de comportamiento de jugadores de ambas regiones, consideramos que era una coincidencia afortunada por la principal y única razón que la gente de un servidor no consideraría injusto que el otro tuviese menos puntos que acumular. En esta fase, nunca contemplamos el nivel de involucramiento que LAN tendría con la barra de progreso de LAS y viceversa. Al momento de ver las competencias en los foros, nos pusimos más contentos por la parte de los ánimos que se estaban dando entre ustedes que por la competencia con nuestros vecinos de LAN.\n\n> No se que que les parecer&aacute; a ustedes, el evento de mascaras para mi fue algo bastante divertido, lastima que se haya ensuciado con los eventos posteriores de ambas comunidades, ahora quiero hacer la pregunta:\n\nComo líder del proyecto de la Fiesta de Máscaras. Gracias por estas palabras.\n\n> &iquest;que clase de conducta es la que quieren premiar?, si ahora que se sabe que igualmente LAN recibir&aacute; 2 skins por la compra de 1 cajita, que al final es casi exactamente  lo mismo que el 50% de descuento, al saber esto muchos invocadores han soltado risas y se han burlado de LAS, debido a que a ellos les ha ca&iacute;do un premio mucho mejor sin haber conseguido el supuesto premio por parte de riot.\n\nEsto fue una decisión de LAN. Nuestro plan jamás fue dar un premio de consuelo, por más que LAS no hubiese llegado a las recompensas. El simple hecho de que la comunidad está muy muy muy unida a la de LAN, hizo que se hiciera una comparación directa. Lo tendremos en cuenta para eventos que también LAN haga, si es que los vuelven a haber...\n\n> &iquest;De verdad quieren premiar de esta forma a una comunidad tan toxica?, no quiero poner enlaces ni fotos de los comentarios que he presenciado, espero baste con mi palabra, como dije antes, grande ha sido el despliegue de insultos, y muchas han sido las peleas que he visto entre ambas comunidades, a mi parecer lo mas sensato en este caso es realizar el evento de las programado para LAN, puesto que se les prometi&oacute;, pero no dejar al servidor de LAS fuera de esto, ya que esta comunidad, termino el evento satisfactoriamente, se que no faltara quien me insulte y me diga eres de LAS y solo tienes envidia, y a esto cito lo que dijo un rioter hace poco tiempo atras:\n\nSeparemos un poco. Los insultos son mal vistos en cualquier situación. Hemos tenido que sancionar a mucha gente que ha faltado el respeto a otros durante este periodo. Lamentable, pero es la realidad.\n\n> - muchos RIoters no estaban c&oacute;modos con la idea de dar un premio a una meta que no se alcanz&oacute;.\n> \n> y no solo los rioters, sino que toda la comunidad de LAS, y espero que los que tengan conciencia en LAN, apoyen este punto, &iquest;si no cumplo una meta, por que he de recibir un premio?.\n> ahora, se decidi&oacute; dar como premio de consuelo al server de LAN este famoso evento, el cual genero toda esta polemica, la pregunta central de todo esto es:\n> si el evento de las mascaras abarcaba a ambos servidores &iquest;porque dejar el servidor de  LAS afuera?\n\nPor que fue una decisión única de los rioters en la oficina de LAN. Hubo varios factores que llevaron a cometer esta equivocación, como cuestiones internas de comunicación, que resultaron en ambas comunidades teniendo que sufrir las consecuencias. Pero un error vecino no implica que tengamos que romper nuestra palabra a ustedes. Mantener la palabra es importante para construir una relación de confianza con ustedes.\n\n> y d&iacute;ganme, los invocadores que lean esto, si los rioters de LAN est&aacute;n tan preocupados por tener a sus invocadores felices proponiendo este evento &iquest;por que los rioter de las ni siquiera se han hecho presentes?.\n\nHemos estado respondiendo temas con las decisiones que se han tomado para ser lo más transparente que podemos con ustedes. También se han respondiendo a los comentarios y propuestas de la comunidad. Te invito a leer el [red tracker](http://boards.las.leagueoflegends.com/es/redtracker). Me gustaría mencionar que una cosa es escuchar e involucrarse en la conversación y otra es estar de acuerdo y tomar acción con cada cosa que la comunidad propone. Nos importa mantener canales de comunicación abiertos y fluidos con ustedes, pero no siempre vamos a estar de acuerdo en las mismas cosas.\n\n> es por eso damas y se&ntilde;ores que estoy algo decepcionado,\n\nEn tu decepción, y en la del resto de la gente que está descontenta con esta situación, ya estamos trabajando con planes a corto, mediano y largo plazo.\n\n> esto es lo que puedo expresar, mi forma de expresarme nunca ha sido la mejor, espero no generar descontento, quer&iacute;a expresarme con respeto, me gustaria, no recibir insultos solo quiero que expresen su punto de vista.\n\nEl respeto es lo más importante. Sin respeto de antemano, es muy raro que haya alguien que quiera ofrecer una respuesta. En cualquier ámbito.","replies":[{"poster":"LaReinaPingüino","date":"2016-03-19T22:04:50.628+0000","up_votes":4,"down_votes":1,"body":"Pero como no iban a haber comparacio es entre servers sinera el mismo evento? Era necesario hacer el evento para ambos servers al mismo tiempo? Con el mismo nombre? Para la proxima aunque sea que salgan con diferentes nombres. Diferentes imagenes. Diferentes metas. Diferentes recompensas y nonal mismo tiempo. Y ahi no van a haber estos problemas","replies":[{"poster":"Hayato","date":"2016-03-20T00:38:58.574+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Elisab3t,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=000d0007,timestamp=2016-03-19T22:04:50.628+0000)\n>\n> Pero como no iban a haber comparacio es entre servers sinera el mismo evento? Era necesario hacer el evento para ambos servers al mismo tiempo? Con el mismo nombre? Para la proxima aunque sea que salgan con diferentes nombres. Diferentes imagenes. Diferentes metas. Diferentes recompensas y nonal mismo tiempo. Y ahi no van a haber estos problemas\n\nEl problema no fue que era el mismo evento, fue que LAN se salió de lo pactado en el evento.  Lo que resta es que la central de Riot tome medidas disciplinarias contra Riot LAN si considera necesario. Obviamente nosotros no seremos informados si hubo alguna resolución o no sobre el tema ya que es algo interno.","replies":[]}]},{"poster":"Wild Nida","date":"2016-03-19T19:39:12.624+0000","up_votes":4,"down_votes":0,"body":"> En tu decepción, y en la del resto de la gente que está descontenta con esta situación, ya estamos trabajando con planes a corto, mediano y largo plazo.\n\nDesde un comienzo dije este evento nos unio como comunidad, estamos hablando de unir una de las comunidades mas separadas por diferentes motivos. Algo que logramos Argentinos,Chilenos, Uruguayos etc. Es algo **nuestro**, me duele mucho que quede todo este esfuerzo opacado por un incidente que no nos corresponde. LAN es LAN, me costo mucho ver las cosas como son, incluso en mi tristeza he hablado con mi familia, para que me den un punto de vista y la verdad es que con esto pude ver el esfuerzo que cada uno de uds hacen por la comunidad, es dificil siempre ser el juzgado y nunca el que juzga. Por eso, me gustaria ver mas eventos unitario para LAS, no para beneficiarnos nosotros, sino para evitar que problemas con nuestros vecinos y que termine todo siendo una mala experiencia de algo tan bueno, ya que LAN nos demostro que se manejan de otra manera con su comunidad, no significa que UDS lo que estan todo el dia tratando de satisfacer a esta gran comunidad sean malos o no nos quieran.\n\nSaludos.\n\nShiina-{{champion:76}}","replies":[{"poster":"Hayato","date":"2016-03-19T20:10:36.415+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shiina,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=000d0000,timestamp=2016-03-19T19:39:12.624+0000)\n>\n> Desde un comienzo dije este evento nos unio como comunidad, estamos hablando de unir una de las comunidades mas separadas por diferentes motivos. Algo que logramos Argentinos,Chilenos, Uruguayos etc. Es algo **nuestro**, me duele mucho que quede todo este esfuerzo opacado por un incidente que no nos corresponde. LAN es LAN, me costo mucho ver las cosas como son, incluso en mi tristeza he hablado con mi familia, para que me den un punto de vista y la verdad es que con esto pude ver el esfuerzo que cada uno de uds hacen por la comunidad, es dificil siempre ser el juzgado y nunca el que juzga. Por eso, me gustaria ver mas eventos unitario para LAS, no para beneficiarnos nosotros, sino para evitar que problemas con nuestros vecinos y que termine todo siendo una mala experiencia de algo tan bueno, ya que LAN nos demostro que se manejan de otra manera con su comunidad, no significa que UDS lo que estan todo el dia tratando de satisfacer a esta gran comunidad sean malos o no nos quieran.\n> \n> Saludos.\n> \n> Shiina-{{champion:76}}\n\nExacto, no hay que comerse la cabeza tanto con este tema.","replies":[]}]},{"poster":"Johan2090","date":"2016-03-19T19:58:08.123+0000","up_votes":1,"down_votes":0,"body":"una pregunta riot condor, o rioters de LAN.\nPara LAS los aspectos serán entregado solo para personas que no tengan sanciones desde el 11/12/15 si es que no me equivoco ( lo leí hace tiempo), osea que si participaste constantemente en el evento pero fuiste sancionado anterior mente.. los premios del evento no te llegaran.. \nLa pregunta es: El 2x1 sera solo para los que participaron en el evento y ademas no cuentan con sanciones anteriormente? o cualquiera que tenga rp podrá comprarlo?\nsiendo la respuesta: que cualquiera lo pueda comprar.. no seria mucho para un simple premio de consuelo?","replies":[{"poster":"D4rKS1d3R","date":"2016-03-20T16:22:56.285+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Johan2090,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=000d0001,timestamp=2016-03-19T19:58:08.123+0000)\n>\n> una pregunta riot condor, o rioters de LAN.\n> Para LAS los aspectos serán entregado solo para personas que no tengan sanciones desde el 11/12/15 si es que no me equivoco ( lo leí hace tiempo), osea que si participaste constantemente en el evento pero fuiste sancionado anterior mente.. los premios del evento no te llegaran.. \n> La pregunta es: El 2x1 sera solo para los que participaron en el evento y ademas no cuentan con sanciones anteriormente? o cualquiera que tenga rp podrá comprarlo?\n> siendo la respuesta: que cualquiera lo pueda comprar.. no seria mucho para un simple premio de consuelo?\n\nEntiendo esto y te responderé así:El 50% de descuento era para todos, hayan o no participado en el evento(por eso la preocupación de Riot LAN a smurf de cuentas), al haber anunciado esto y tener que retractarse, sería injusto para las personas que no participaron en el evento y cargaron RP no tener ahora acceso al 2x1 en cajas.","replies":[]}]},{"poster":"SenbonZakura 1","date":"2016-03-20T04:05:45.974+0000","up_votes":1,"down_votes":0,"body":"riot no tiene verguenza y cada dia lo demuestra mas","replies":[]},{"poster":"Céfiro","date":"2016-03-19T21:18:01.476+0000","up_votes":3,"down_votes":0,"body":"Aprecio tu tiempo para responder todo lo que pusieron, me da lástima la falta de organización y comunicación entre las dos regiones, porque si se hubiese aclarado previamente, se sabe que esto no pasaría ahora. Pero bueno, a veces las cosas salen mal y tienen que saber asumir las consecuencias, está bueno que sepan que como usuarios activos nosotros queremos una solución, y no la están dando, leí por ahí que nos den cofres ¿por qué no? todos felices, es muy simple, pero siempre le buscan excusas a todo y dicen que no va a poder ser, es más fácil quedar mal para ustedes o no entiendo la verdad.","replies":[]},{"poster":"Help Support","date":"2016-03-20T06:10:38.081+0000","up_votes":1,"down_votes":0,"body":"Las acciones de lan de der premio consuelo siendo, que  ganaron el ward y los eventos de pi en grupo me parecio mal. Por que era el mismo evento en ambos servidores y ninguno dijo o hablo de premio consuelo si no se cumplia con las 13 metas. Ahora bien tambien me molesto que le sacaran el premioconsuelo. Pero lo que molesto mas que nada fue que los rioters de las no mejoraran el premio que ganamos. Asi como lan no cumplio con lo establesido de inicio las se podia jugar y mejorar el premio. Podian dar la misma oferta o dar 2 skin misteriosos enves de 1 que se gano. Podian hacer muchas cosas, pero decidieron no hacer nada. Solo hacer mas eventos exclusivos para las. Pero lan tambien tiene eventos exclusivos. No ganamos nada en si. Nada que saque la decepcion de saber que por mas que te mates en el juego y en los eventos todos ganan menos las.","replies":[]},{"poster":"Gen","date":"2016-03-20T02:29:22.560+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Cóndor,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=000d,timestamp=2016-03-19T19:09:55.768+0000)\n>\n> El evento nunca fue pensado como un evento conjunto. De hecho, y tal como ya mencioné en otro hilo, antes de empezar a hacer los cálculos y proyecciones de puntaje (como todo el proyecto es complejo y tiene muchas tareas que se dividen entre varias personas, los encargados de esta parte fuimos Cedriel y yo), pensábamos que ambas regiones tendrían puntaje separado. Cuando nos encontramos con la realidad de comportamiento de jugadores de ambas regiones, consideramos que era una coincidencia afortunada por la principal y única razón que la gente de un servidor no consideraría injusto que el otro tuviese menos puntos que acumular. En esta fase, nunca contemplamos el nivel de involucramiento que LAN tendría con la barra de progreso de LAS y viceversa. Al momento de ver las competencias en los foros, nos pusimos más contentos por la parte de los ánimos que se estaban dando entre ustedes que por la competencia con nuestros vecinos de LAN.\n> \n> Como líder del proyecto de la Fiesta de Máscaras. Gracias por estas palabras.\n> \n> Esto fue una decisión de LAN. Nuestro plan jamás fue dar un premio de consuelo, por más que LAS no hubiese llegado a las recompensas. El simple hecho de que la comunidad está muy muy muy unida a la de LAN, hizo que se hiciera una comparación directa. Lo tendremos en cuenta para eventos que también LAN haga, si es que los vuelven a haber...\n> \n> Separemos un poco. Los insultos son mal vistos en cualquier situación. Hemos tenido que sancionar a mucha gente que ha faltado el respeto a otros durante este periodo. Lamentable, pero es la realidad.\n> \n> Por que fue una decisión única de los rioters en la oficina de LAN. Hubo varios factores que llevaron a cometer esta equivocación, como cuestiones internas de comunicación, que resultaron en ambas comunidades teniendo que sufrir las consecuencias. Pero un error vecino no implica que tengamos que romper nuestra palabra a ustedes. Mantener la palabra es importante para construir una relación de confianza con ustedes.\n> \n> Hemos estado respondiendo temas con las decisiones que se han tomado para ser lo más transparente que podemos con ustedes. También se han respondiendo a los comentarios y propuestas de la comunidad. Te invito a leer el [red tracker](http://boards.las.leagueoflegends.com/es/redtracker). Me gustaría mencionar que una cosa es escuchar e involucrarse en la conversación y otra es estar de acuerdo y tomar acción con cada cosa que la comunidad propone. Nos importa mantener canales de comunicación abiertos y fluidos con ustedes, pero no siempre vamos a estar de acuerdo en las mismas cosas.\n> \n> En tu decepción, y en la del resto de la gente que está descontenta con esta situación, ya estamos trabajando con planes a corto, mediano y largo plazo.\n> \n> El respeto es lo más importante. Sin respeto de antemano, es muy raro que haya alguien que quiera ofrecer una respuesta. En cualquier ámbito.\n\nyo queria a Mundo Veraniego no lo tengo por que no se llego a la meta no hubo  premio consuelo y lo senti mucho por que fue uno de los primeros eventos que jugue y lo senti por que me esforcé mucho. totalmente injusto lo que hacen","replies":[]},{"poster":"Rolandkun","date":"2016-03-20T00:58:05.442+0000","up_votes":2,"down_votes":0,"body":"Y  el  respeto  para  nosotros  señores  rioters   se   rien  en  nuestras  caras  despues  del  esfuerzo  que   hemos  hecho  y  quieren  que  los  acompañemos  en  futuros  eventos  ,   noooooooooooooooooooooooo.","replies":[]},{"poster":"DeigoHMD","date":"2016-03-19T21:01:05.924+0000","up_votes":2,"down_votes":0,"body":"Entonces dicen que no volverán a tocar el tema de el descuento de LAN y dejaran a la comunidad descontenta así? Porque si hacen otro evento de eso de corto/mediano/largo plazo para Las creó que casi nadie participará o aportará en vista de lo que la comunidad piensa","replies":[]},{"poster":"Excorpion","date":"2016-03-19T20:25:28.355+0000","up_votes":2,"down_votes":0,"body":">En tu decepción, y en la del resto de la gente que está descontenta con esta situación, ya estamos trabajando con planes a corto, mediano y largo plazo.\n\nViéndolo de manera realista... los planes a corto, mediano y largo plazo en estos tiempos no son realmente una solución efectiva... dado que cuando sucedan la gente no pensará en que es la solución a este suceso de finales de la FdM... pensarán que simplemente es otro evento que no tiene nada que ver... e incluso la próximo FdM podrían pensar en que todo partirá de nuevo...\nLa generación de esta era quiere todo de inmediato... \"This is the NOW generation... This is the generation NOW\" - Black Eyed Peas, Now generation","replies":[]},{"poster":"ElCoronelMostaza","date":"2016-03-19T20:20:16.735+0000","up_votes":2,"down_votes":0,"body":"leyendo tu respuesta me doy cuenta que le llego un reto grande a los funcionarios de LAN, por otra parte se valora bastante que aquí en LAS no quieran ni ahora ni nunca realizar una acción improvisada como la que se hizo allá, de alguna manera aquí se han esmerado bastante que mejorar la calidad del server en cuanto a contenidos y que esto marque un precedente en cuanto a la uniformidad al momento de realizar eventos o algo parecido desde ahora en adelante","replies":[]}]},{"poster":"Arai Alt Eisen","date":"2016-03-19T18:09:56.554+0000","up_votes":4,"down_votes":0,"body":"nada para lan. respeten el evento principal. riot póngase los pantalones","replies":[]},{"poster":"INV3RSE","date":"2016-03-19T20:32:48.198+0000","up_votes":3,"down_votes":0,"body":"Estoy totalmente de acuerdo contigo bro, es totalmente injusto que LAS que fue el ganador del concurso, gane los premios, pero que LAN que perdiió, gane un premio aún mejor, yo creo que si pierdes no deben de premiarte...","replies":[]},{"poster":"ForceOfLight","date":"2016-03-19T18:28:39.396+0000","up_votes":3,"down_votes":0,"body":"Esperaba alguien que pensara lo mismo que yo pero como no tenia las palabras para referirme sobre el tema adecuadamente esperaba alguien que pudiera dar una solución que pudiera ser justa para ambos servidores y tu la distes;)\n\nA Nosotros como comunidad nos costo cumplir todas la metas, todos los premios que nos darán serán por que lo hemos ganado y LAN no lo logro y esta bien el premio de consuelo que le darán pero dejan de lado a LAS cuando nosotros nos esforzamos por llegar a las metas y seria justo que el premio también sean para la comunidad de LAS y así los rioters demostrarían lo que es jugar justo{{sticker:slayer-jinx-wink}} \n\nTe Felicito por dar la cara por la comunidad de una forma adecuada y dando un método justo{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Alejo323","date":"2016-03-19T17:40:51.770+0000","up_votes":4,"down_votes":1,"body":"Totalmente de acuerdo Men","replies":[]},{"poster":"Därknight","date":"2016-03-20T05:58:35.224+0000","up_votes":2,"down_votes":0,"body":"Yo lo que no entiendo es como llegaron en LAN, a pensar que dejar cajitas al 50% iba a ser un buena idea, cuando podían haber tomado miles de opciones mas viables, podían hasta darles la cajita y decir que fue gracias a los puntos que les sobro a LAS como mucha gente pedía en los foros. Una pena que todo haya concluido de esta manera.\n {{sticker:zombie-brand-facepalm}} ","replies":[]},{"poster":"ArcKyohei","date":"2016-03-20T00:05:59.839+0000","up_votes":2,"down_votes":0,"body":"solo puedo decir lo siguiente, para que participar en los eventos si a la final igual tendremos un \"premio de consuelo\", se que las oficinas de riot la trabajan de manera independiente, pero aun así, creo que la decisión que tomaron en lan fue injusta, en especial para nosotros que nos esforzamos por conseguir la meta. ahora si los de lan reclaman sobre que ellos no pudieron legar a la meta por que nosotros estábamos en vacaciones y ellos, no, entonces no debieron lanzar el evento al mismo tiempo en ambos servidores, ahí ya es falla de parte de las oficinas de lan, pero en si es lamentable todo el problema que se genero por una mala decision, que termino finalmente ampliando mas la brecha entre los usuarios de ambos servidores.","replies":[{"poster":"Hayato","date":"2016-03-20T00:45:21.386+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ArcKyohei,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=0013,timestamp=2016-03-20T00:05:59.839+0000)\n>\n> solo puedo decir lo siguiente, para que participar en los eventos si a la final igual tendremos un \"premio de consuelo\", se que las oficinas de riot la trabajan de manera independiente, pero aun así, creo que la decisión que tomaron en lan fue injusta, en especial para nosotros que nos esforzamos por conseguir la meta. ahora si los de lan reclaman sobre que ellos no pudieron legar a la meta por que nosotros estábamos en vacaciones y ellos, no, entonces no debieron lanzar el evento al mismo tiempo en ambos servidores, ahí ya es falla de parte de las oficinas de lan, pero en si es lamentable todo el problema que se genero por una mala decision, que termino finalmente ampliando mas la brecha entre los usuarios de ambos servidores.\n\nLa excusa de las vacaciones las puso la comunidad de LAN, en cualquier caso es de mediocres justificarse (y más echando la culpa a otros) por lo que uno no pudo lograr. \n\nYo no comparto totalmente que fue un esfuerzo, en realidad no fue algo que no hagamos normalmente. Puede que hayamos dejado de lado ciertas actividades por jugar pero eso también es un tema de responsabilidades, si uno falta al trabajo por jugar, no es que hizo un esfuerzo.. sino que no hizo bien le balance de prioridades. Además si uno cree que el objetivo valia mas que salir con amigos, estar con la novia o cualquier otra cosa, es porque se consideraba justo el objetivo. \n\nEsto no debería cambiar por el hecho de que LAN infligió las reglas, lo acordado en LAS se respetó y ambas partes estaban conformes con lo acordado.","replies":[]}]},{"poster":"Arkelius","date":"2016-03-19T20:01:28.847+0000","up_votes":3,"down_votes":1,"body":"Por que de los riotes?\n\nLan y Las son servidores separados, no tienen porque tener las mismas ofertas, incluso recuerda que servidores como NA o EU no tuvieron fiesta de mascaras, tambien hay eventos exclusivos en otros servidores que nunca veremos.\n\nLa decision de la oferta fue de LAN y unicamente de LAN, el problema es que se decidio (y lo decidio lan) dar un premio de consuelo\n\nLAS como corresponde no \n\nLAN se retracto porque se podia abusar de esa oferta y la cambio por otra de la que no pueda abusarse facilmente\n\nSigue siendo una oferta, y un premio consuelo, pero esto lo hicieron por la metida de pata de ellos, LAS no tuvo nada que ver\n\nComo mucho yo puedo decir que no me agradaron las decisiones de LAN, pero no tengo ni una queja respecto los Rioters de LAS a los que encima la comunidad parece echarles la culpa de algo","replies":[{"poster":"ArcKyohei","date":"2016-03-20T00:11:49.113+0000","up_votes":2,"down_votes":0,"body":"pero creo que ahí no se esta tomando en cuenta el fin del evento, hasta donde lo percibí yo, era un evento para crear una sana competencia entre ambos servidores, pero el resultado de la mala decisión de lan termino por aumentar la brecha entre los servidores. creo que se perdió el fin del evento, a mi parecer, ademas pq ellos tenian que tener un premio de consuelo si igual iban a tener uno de los 2 premios (refiriéndome a el centinela misterioso y al aspecto misterioso)?","replies":[]},{"poster":"Hayato","date":"2016-03-19T20:06:07.921+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Arkelius,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=000f,timestamp=2016-03-19T20:01:28.847+0000)\n>\n> Por que de los riotes?\n> \n> Lan y Las son servidores separados, no tienen porque tener las mismas ofertas, incluso recuerda que servidores como NA o EU no tuvieron fiesta de mascaras, tambien hay eventos exclusivos en otros servidores que nunca veremos.\n> \n> La decision de la oferta fue de LAN y unicamente de LAN, el problema es que se decidio (y lo decidio lan) dar un premio de consuelo\n> \n> LAS como corresponde no \n> \n> LAN se retracto porque se podia abusar de esa oferta y la cambio por otra de la que no pueda abusarse facilmente\n> \n> Sigue siendo una oferta, y un premio consuelo, pero esto lo hicieron por la metida de pata de ellos, LAS no tuvo nada que ver\n> \n> Como mucho yo puedo decir que no me agradaron las decisiones de LAN, pero no tengo ni una queja respecto los Rioters de LAS a los que encima la comunidad parece echarles la culpa de algo\n\nTotalmente de acuerdo!","replies":[]},{"poster":"Mazer Rakham","date":"2016-03-19T21:19:02.459+0000","up_votes":2,"down_votes":1,"body":"http://s24.photobucket.com/user/HunterShriek/media/clapping.gif.html","replies":[]}]},{"poster":"Kumiho chan","date":"2016-03-19T18:36:36.898+0000","up_votes":2,"down_votes":0,"body":"yo solo opino que mientras llegue cajita bien me da lo mismo lo que ofrescan en otros servidores ni como lo obtrubieron yo me esforce por algo y quiero la recompenza de mi ezfuerzo no tengo la necesidad de mirar para alado como dice la frace el invidioso no sabe lo que tiene hasta que te lo ve a ti  {{summoner:11}} {{champion:103}}  con esto dicho me despido","replies":[]},{"poster":"Dark Feraligatr","date":"2016-03-19T18:21:17.085+0000","up_votes":2,"down_votes":0,"body":"según mi parecer, Riot LAN cometió una negligencia, con las mejores intenciones pero negligencia igual. Si una empresa promete una meta y luego no la cumple genera división y de por si las relaciones entre LAN y LAS no son las mejores. Siempre hemos tenido que soportar que LAN nos desprecie diciendo que en LAS no hay nivel y a esa comunidad le van esa recompensa de consuelo? Riot lo único que hace y ha hecho es aplicarle sal a una herida.","replies":[]},{"poster":"chlenix","date":"2016-03-19T18:30:05.473+0000","up_votes":3,"down_votes":1,"body":"chicos, Riot esta cumpliendo a cabalidad lo acordado con el sv de LAS, nos dara un aspecto misterioso como se acordo\n\nlo otro, para el siguiente evento que se haga, simplemente no juegen para alcanzar la meta, si al final igual les daran el premio o algo mejor","replies":[]},{"poster":"JoelLdeA","date":"2016-03-21T02:12:33.797+0000","up_votes":1,"down_votes":0,"body":"Solucion?\n\nCambiarse de server y gastarte todo tu dinero en cajas para que salga worth it el rp de cambio de region.\n\nizi","replies":[]},{"poster":"Balmungg","date":"2016-03-20T16:47:53.047+0000","up_votes":1,"down_votes":0,"body":"decepción...","replies":[]},{"poster":"Løtus Flower","date":"2016-03-20T12:07:54.564+0000","up_votes":1,"down_votes":0,"body":"Esto debería ser como el sistema de ranked, si TU GANAS una partida obviamente ganas puntos, PERO EL QUE PIERDE no tiene derecho a puntos, así es la cosa señores si nosotros ganamos el rival no tiene derecho a nada. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Chillout","date":"2016-03-20T04:47:28.926+0000","up_votes":1,"down_votes":0,"body":"Sabes que pasa que un RIOTER tendria que hacer un post que diga, \"Saben que la verdad que si, los re cagaron los de LAN pero nosotros no podemos hacer nada\" y no meter excusas pelotudas.","replies":[]},{"poster":"Maedme","date":"2016-03-20T03:11:18.323+0000","up_votes":1,"down_votes":0,"body":"O que hagan promo 2x1 para ambos servers (ley pareja, nadie se queja) o que en vez de la cajita misteriosa nos den un cofre misterioso, y no es que nos merezcamos menos... ya que nos prestan menos atencion y nos tuvimos que bancar al server injugable por casi 2 meses con \"300 ms, que parecian 800...\"\nPor otra parte, NADIE se puede quejar de la reaccion de LAS ante el favoritismo de LAN, cuando escucharon a alguien en la historia con una \"protesta pacifica\"? por favor no nos hagan reir.","replies":[]},{"poster":"walterlama","date":"2016-03-20T01:02:07.975+0000","up_votes":1,"down_votes":0,"body":"si juge premade de a dos sume puntos?","replies":[]},{"poster":"MaoChronicles","date":"2016-03-20T00:51:38.427+0000","up_votes":1,"down_votes":0,"body":"Diste tan pocas opciones en tu encuesta que parece que lo que quieres que pongamos es que si no estamos a favor de que el evento 2x1 sea para todos, entonces eres de los que quiere que no sea para nadie.\nlo cual lo encuentro irrisorio. me respuesta es dejar la cosa como esta. seguir metiendo el dedo en la heridad no hace un bien \n\nque LAS se quede con lo que tiene ahora y LAn con lo que tiene ahora, luego tendremos tiempo de limpiar asperesas pero no ahora que todo el amibiente esta demasiado caliente","replies":[]},{"poster":"General Pınochet","date":"2016-03-19T20:07:15.923+0000","up_votes":1,"down_votes":0,"body":"claro la mejor opcion es que  el evento de las cajitas 2x1 sea para las  y lan no se por que rito no piensa en esa solucion si hasta niños de 14 años se le ocurre","replies":[{"poster":"Hayato","date":"2016-03-20T00:35:46.003+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gears Chris,realm=LAS,application-id=v7qsfXsE,discussion-id=Lx3oxFHY,comment-id=0010,timestamp=2016-03-19T20:07:15.923+0000)\n>\n> claro la mejor opcion es que  el evento de las cajitas 2x1 sea para las  y lan no se por que rito no piensa en esa solucion si hasta niños de 14 años se le ocurre\n\nPorque sentaría un precedente de que si no se logran las metas en LAS, aun así recibirás premios. Lo cual puede llevar a que la participación en los eventos se vea reducida y cuando no se obtengan las metas y no haya premio consuelo, la gente comenzará a quejarse que quieren premio consuelo.","replies":[]}]},{"poster":"Mr Wafles","date":"2016-03-19T19:13:20.211+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Mr Wafles","date":"2016-03-19T19:17:06.472+0000","up_votes":1,"down_votes":0,"body":"Riot es un copy and page no me banen  </3 Lo hice solo para darlé gracía al asunto","replies":[]}]},{"poster":"SKT T1 Santi45","date":"2016-03-19T18:19:51.773+0000","up_votes":1,"down_votes":0,"body":"La verdad, muy de acuerdo contigo, si el próximo evento lo hacen LAS y LAN seria no se si mas cómodo pero para también arreglar conflictos o así lo veo yo {{champion:32}} {{summoner:6}}","replies":[]},{"poster":"Zheyt1","date":"2016-03-19T21:00:27.903+0000","up_votes":2,"down_votes":3,"body":"Realmente, si quitan los regalos para LAN seria malo para ellos y se armaria mucho mas conflicto, y si le dan cajas tambien a LAS también porque..... ya saben mas menos. Lo mejor que creo yo que ese \"premio de consolacion\" para LAN esta bien, nosotros por lo menos llegamos a la meta. Y si nosotros no hubiéramos llegado y por habese motivo, nos hubieran dado lo mismo que a LAN, se armaria lo mismo. Solo los ardidos de mier** de LAS, callense y piensen un segundo.","replies":[{"poster":"Zheyt1","date":"2016-03-19T21:05:10.125+0000","up_votes":2,"down_votes":3,"body":"Ademas yo creo que algunos de LAS están exagerando demasiado con el asunto, se están ardiendo demasiado. Y también los picados de LAN, que yo creo que los han visto.....","replies":[]}]}]}