{"poster":"Doctor JayDee","date":"2016-01-22T00:48:45.543+0000","title":"So, jetzt nochmal langsam für mich zum Mitschreiben bitte :)","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Gerade &uuml;ebrschlagen sich ja die Ereignisse.\nIChs chaue nach ewigkeiten mal wieder zuf&auml;llig ins Forum und muss lesen,\ndass wohl viele Spieler extrem niedrig eingestuft wurden.\n\nDas wundert mich. **Ich war letzte Season Dia 5 und kam jetzt nach Platin 2. F&uuml;r mich also kein wirklicher Reset, fühlt sich alles wie gewohnt an, typisch Solo-Q eben.**\nJetzt muss ich aber lesen, dass viele Spieler mit tollen Placements teilweise von Platin nach Silber o.&auml;. verschoben wurden.\n\nSoweit dazu, jetzt lese ich, dass Riot eine neue Solo-Q plant und man mit den aktuellen Solo-Duo-Spielen MMR f&uuml;r die neue Dynamic-Queue sammeln kann,\ndie aber nur f&uuml;r 2-5 Spieler gedacht ist.\n\n**Ich bin ein reiner Solo-Spieler, waren meine Placements jetzt eigentlich vollkommen sinnlos und wenn dann irgendwann eine Solo-Q startet, dann darf ich praktisch wieder bei Null anfangen? Also mit komplett neuen Placements etc.?**\n\n**Bitte keine Verlinkungen auf den englischen bzw. deutschen Thread posten, die habe ich gelesen, aber nicht richtig verstanden.**\n\n**Oder ist es so, dass meine jetztige Solo-Q-MMR einfach f&uuml;r die neue Solo-Q &uuml;bernommen wird ohne Placements?**\n\n**Sonst kann ich praktisch einfach aufh&ouml;ren zu Spielen, bis in ein paar Wochen die Solo-Q startet...**","replies":[{"poster":"avíon","date":"2016-01-22T13:22:44.893+0000","up_votes":1,"down_votes":0,"body":"Ich reg mich selten über so etwas auf, jedoch finde ich das totalen Schwachsinn.. vor allem weil ich die 10 placements im solo gezockt habe. Und jetzt soll das für die Dynamic Que zählen obwohl ich immer alleine rankeds zocke. Also nochmal 10 Placement matches schwimmen..Totaler Schwachsinn meiner Meinung nach. GG Riot!!","replies":[]},{"poster":"Ireliα","date":"2016-01-22T01:28:12.572+0000","up_votes":1,"down_votes":0,"body":"So wie ich es verstanden habe:\n\nDeine jetzigen Placements waren für die Dynamic Que. Dort wirst du sobald sie startet als Platin 2 Spieler behandelt. Der normale Elo Reset wird erst in ein paar Tagen/Wochen stattfinden.","replies":[{"poster":"Doctor JayDee","date":"2016-01-22T01:32:13.583+0000","up_votes":1,"down_votes":0,"body":"Also kann man zusammenfassen: Im Solo-Q bin ich immer noch Dia 5 (bzw. ungefähr, da ich meine Hidden-MMR ja eh nich kenne), und darf mich in ein paar Wochen niochmal neu einranken?\n\nNice... Kappa","replies":[{"poster":"Ireliα","date":"2016-01-22T11:01:53.881+0000","up_votes":1,"down_votes":0,"body":"Genau das. Vorausgesetzt das der Informationsstand, den das deutsche Forum momentan hat korrekt ist.","replies":[]}]}]}]}