{"poster":"mi ramfan","date":"2014-03-19T02:21:04.864+0000","title":"You know what you guys really need, Riot?","subforum":"Boards Feedback","up_votes":11,"down_votes":0,"body":"A press secretary for the community.\n\nNo, I'm serious. I know it sounds like The Beard 2.0, but hear me out. \n\nThere's a reason President Obama doesn't come out every other hour and give a press conference in the White House Press Room. The obvious reason is that he's got a big job, what with running the country and all. Another big reason, and the reason I'm talking about here, is that people, when improvising or working from a sheet of information that they've been handed, sometimes have trouble saying things that are politically correct on the spots. Sometimes they misspeak, and when they do, it's in all the newspapers (or all over GD) the next day. That's why most large companies and most politicians have somebody to talk to the press for them, who's trained in how to respond properly without implying anything they shouldn't or making a massive splash that derails the discussion.\n\nYou guys need someone to sit on the community website (and maybe on GD until it's fully phased out) and just...answer questions. Keep whoever you choose up to date on what all the different teams are working on (that obviously isn't NDA restricted stuff like internal playtesting reworks), so they can answer questions reliably and accurately. The end result: there'll be no leaks from developers on stuff you don't want leaked (because presumably team heads will control what info the community secretary has access to) and the community will feel more like you guys are promptly responding to concerns. \n\nIn fact, not only will having someone filling the \"community secretary\" role make you appear more open to the community, it'll make appearances from the higher up Rioters more special. People will be more willing to hear out Rioters who aren't the community representative (who may end up tanking community aggro for a while if you don't give them info to respond to questions) and maybe won't rain downvotes upon them if they say something they don't like, because if the community secretary is doing their job very little will just be dropped on the community. We'll know what's going on enough to have patience, and if there's a consistent balance problem (like pre 4.4 Kassadin), we'll know that you are actually working on nerfing them instead of it looking from the outside like you aren't doing anything and are letting a champion be banned in 99% of matches because of LCS stability.\n\nIt's not as if you've never done this before, Riot. A while ago you had the infamous Beard, who generally only posted canned responses that only served to inflame the community. The Beard was essentially this:\n\nhttp://www.youtube.com/watch?v=j0GGNAbFU5M (4:30 long, you'll live GD)\n\nWhat you guys need is someone like Griftrix, RiotDamiya, or IronStylus in this role. They've got senses of humor, they're familiar, and they're fairly popular with the community because of both the former traits and their openness with the community in what they knew was going on. Now, obviously, they have important jobs to be doing...but find someone like them. Find somebody who's the closest thing to IronStylus who's not in a leadership role, and start them doing this instead. \n\nThe community (and Morello, who seems to be Riot's tank at the moment) will thank you.\n\nEDIT: RiotGradius' post on the GD version of the thread:\n\n> That's the thing though, this goes against what we believe in as Rioters.  We're supposed to be the ones on the forums chatting with our players.  We're supposed to feel empowered to make posts about the subjects we're knowledgable on.  I agree it feels like there are times when we're not talking as much as we should, but this is an iterative process, and we're trying to get better at it.  I personally am trying to talk more on the NA/EU/OCE forums when I feel like I can provide valuable insight or enjoy a playful post with you all.\n\n> Rioters posting on the forums should not be viewed as something super special that only happens every now and then.  It should be a common event.  Those at Riot who post on the forums do it because they love to talk to you, and genuinely care about the community.  We do it because we are aiming to be the most player focused gaming company, we want this to be about you guys.\n\n> In terms of leaks and NDAs, every Rioter goes through various classes to learn to distinguish between what should be said and what should not be said.  It's up to us as a team to prevent leaks from happening internally.  Sometimes things slip, and that sucks, but it's better than not being able to post on the forums except for \"approved posts.\"  \n\n> tl;dr - Rioters should be posting on forums, not some talking head that's approved by the communication manager.  We're all empowered to say whatever we feel is reasonable, and this is better than restricting that communication.\n\nMy response: \n\n> If anyone at Riot didn't want to post on the forums for whatever reason (scared of internet backdraft, too busy, whatever) but there's a pressing issue related to their department, the Community Secretary could follow up instead of them. This has no impact on the ability of other Rioters to come on the forums and talk with us whatsoever, other then allowing Rioters who would rather have no interaction with the community (come on, you guys are a big company, there's at least 10 or so of you if not more that are introverted or just don't want to come on GD) to not interact with the community, while allowing the people who really do enjoy interacting with the community to do so.","replies":[{"poster":"MrMilkManiac","date":"2014-03-19T20:15:24.459+0000","up_votes":6,"down_votes":0,"body":"So let me weigh in my two cents...\n\nWhat if I told you *insert morpheus face here* that there are lots of Rioters who browse the forums every day looking for places to engage with the community and answer questions.\n\nIts not so much that we dont have people who want to answer every question, its that a lot of the questions can't be answered for various reasons:\n\n* No definitive answer. A lot of the questions that are asked, we're still trying to figure out ourselves.\n* Sensitive information. Often times for security purposes we can't cue you into what's going on. Its not that we're ignoring you, its that sometimes its actually in the best interest of the community to not have certain information available to the general public.\n* Expertise. A lot of information we provide should come from the people who work the closest with it. If we did have one person whose job it was to ask the \"experts\" to provide answers for the community, they would be a jack of all information, expert of none. They could provide a basic answer, but not a satisfying conversation. If a person cannot hold up a conversation about what they post about, they are doing the community a disservice (imo).\n* Commitment. If we say on the forums that something is going to happen, and things change, it sucks for everyone (Think magma chamber). Sometimes we wont answer questions because any answer we give cannot be 100% accurate, and we cannot commit to anything.","replies":[{"poster":"mi ramfan","date":"2014-03-19T21:48:53.300+0000","up_votes":8,"down_votes":1,"body":"I'll take the red pill, thank you very much. \n\nIf the question has no solid, correct answer, then not only is that A. the kind of question that the community \"ideally\" is talking about, but B. it's the kind of question that we need as many people as possible (including Rioters) to be involved with answering. \n\nNobody's asking that you guys give out information on your server safeguards. The place where this would come up most, tbh, is balance decisions; we know you guys have a bigger balance team then the representatives who post on the forums, but because of that we only find out about upcoming stuff once it goes to the PBE (and even then we usually don't get context until it goes live). If the CS explained what the context for changes was (or even went behind the curtain and brought us internal test changes that weren't ready for PBE yet) then there'd be a lot less armchair theorycrafting and a lot more \"They're working on it, that's all we asked\". \n\nThe WHOLE POINT of the CS is that the info is coming from the people who are doing the relevant work; the CS just is a dedicated middleman between the community and Riot instead of someone who has to balance their posting with workload and free time. Sometimes, basic answers to questions like \"is Riot going to nerf Kassadin soon\" are all that's needed. If there are more advanced answers or deep design stuff involved, real developers can still sign on and post themselves; nothing in CS system prevents that. \n\nIf you're worried about people immediately assuming something will happen, the CS could say something like this:\n\n\"We are aware that a lot of players are frustrated with playing against Lee Sin right now. Our live team is testing X, Y, and Z changes in internal playtests tomorrow and Friday-if we're happy with the changes, we'll push them to PBE. If not, we'll go back to the drawing board\". \n\nThat response at least makes it look like you're doing SOMETHING. With League of Lee Sin/Elise/Vi/Kassadin for the last few months, players were frustrated because it appeared that you weren't doing anything.","replies":[]},{"poster":"Bob LLama","date":"2014-03-19T21:16:25.472+0000","up_votes":6,"down_votes":1,"body":"This.","replies":[]}]},{"poster":"PWYFF","date":"2014-03-20T19:41:52.909+0000","up_votes":6,"down_votes":0,"body":"I just realized how difficult it is to have group-focused discussions on here, but I'll bite. I'll be approaching this from a personal stance! Rather than specifically talking about your suggestion (sorry!), I'd like to highlight the difficulties (or problem space) of communication.\n\nSpecifically, communication that scales is probably one of the most difficult things we face, especially given our constantly growing player base. \n\nWhere before you could hop into a Ventrilo channel to talk with the devs about your latest grievances, these days our players are so spread out that it's hard to have a personal conversation that doesn't exclude the 99.9999%. That said, Riot's relationship with their players was what initially attracted me to the scene, and it's something I love as a concept.\n\nMilkManiac hits some great points about subject matter expertise and sensitive information, but I think ongoing commitment is a fun topic, so I'll just dive into that. The fact is, we're dealing with players and player communication on such a scope that the 'edge' cases go to the hundreds of thousands of players who can take control of the conversation. If a hundred thousand players are **passionate** about **one** single topic, and you magnify that times a thousand more, you end up with huge mobs of players who are rarely, if ever, satisfied by singular question and answers.\n\nThere's also the problem of global scale where a majority of our players actually don't speak \nEnglish as a first language, and one of player relations' (the team I'm a part of) jobs is to develop a globally scalable form of communication. Scale is insane though, and it's a huge pain point for us. I find myself constantly saying this: if our player base was 100, you'd have the most communication ever. If our player base was 100,000 I still think that'd be manageable. But our player base is... big. Very big.\n\nFinal point: people can get very mean very quick, and it drowns out any form of logical discussion. The problem with public rhetoric is that it very rarely defaults to who has better points - it's usually who can appeal to the masses faster. This requires some incredible levels of discussion moderation expertise and it's usually a \"born with it\" concept rather than a trained up one. \n\n**But at the end of the day, none of this is an excuse**. I agree with you that our communications have gotten so high-level that we can't communicate nuance and we're losing connection with the ground floor. Granted, there are millions of players on the ground floor and sometimes you wonder if it has an effect, but it's an ideal that Riot (and I) embrace.\n\nI disagree with the idea of creating a communications middle-man who is only a messenger - I think the core ideal of Riot (and a lot of Rioters will say this is what attracted them to the company) is that those who work on the project should also be allowed to talk about it. Game Design is probably the most nuanced and minefielded discussion forum, but I think we're committed (now more than ever, trust me) to figuring out how to work with it on a less \"globally scalable communications solution\" level. Be patient, but I hope you trust us.","replies":[]},{"poster":"Hinagiku33","date":"2014-03-19T03:10:14.632+0000","up_votes":3,"down_votes":0,"body":"I suggested this a looong time ago. They still need someone like this. And it isn't just a person who knows absolutely everything that's going on, it's more than that.\n\nCommunity: Hey Riot, what's up with Kassadin? We're banning him every game because he's ridiculous.\n\nPR Guy: I've been seeing this a lot. Can you tell me what specifically you're having problems with while I find out if someone is already working on him?\n\nSee? Not too painful. Even though he/she didn't know if Kassadin was being worked on, they opened a dialogue to get feedback and bought some time to find out the answer and get back to the thread after finding it. \n\nThere are a lot of excellent Public Relations people out there who know how to handle people, and more importantly the public. Come on Riot, all the cool corporations are doing it!","replies":[]},{"poster":"Sir ArmaMalum","date":"2014-03-19T03:35:39.096+0000","up_votes":2,"down_votes":0,"body":"If such a guy existed/comes along I would have the utmost respect for him if he does even slightly well. I think we can all agree that the LoL community has it's (somewhat large amount of) bad apples. Anyone who takes a stab at tackling the LoL community directly and as a whole would have his/her work cut out for them.\n\nUnfortunately one issue I can see with this (still agree overall) is that this can create a sheeple effect. i.e. users going to hypothetical guy/gal instead of looking for an answer themselves. I myself have had some experience of trying to make a post answering questions (DDoS attacks, yada yada) and showing it around to help, but there are still people who jump to immediate questioning and expecting an immediate answer before even thinking. Not a dealbreaker, and there are ways around this, but food for thought. :)","replies":[{"poster":"mi ramfan","date":"2014-03-19T04:00:57.214+0000","up_votes":2,"down_votes":0,"body":"Well, if any one question comes up too often the guy could make a sticky thread to answer it. \n\nIn terms of the sheeple effect, there are already people that take everything a Rioter says as the word of god anyways. I guess this wouldn't do anything to change that, but I don't necessarily agree it's a problem either. \n\nIt would be a hard job, for sure. You might have to rotate people around as they get burned out. That's alright; this is a time where a large portion of the community is going ham on Riot and claiming \"they're not as open as when they started\", and adding a Community Secretary (could easily be titled something different like Community Coordinator or something like that) who frequently responds to threads as part of their job description could easily help Riot's openness reputation without actually having to give any more information to the community then they already do. The Community Secretary is just one Riot voice that we could reliably ask for information and (assuming we post politely) get a relevant response on the topic at hand, instead of having to tag 1000 Rioters and spam bumps to get one Riot post.","replies":[]}]},{"poster":"ParinoidPanda","date":"2014-03-23T15:26:13.513+0000","up_votes":1,"down_votes":0,"body":"I concur that Riot should have a dedicated representative on the forums. As much as Rioters are indeed on the forums, there is no way you each individually can catch and respond to the numerous discussions, questions, and complaints, much less do so repeatedly when multiple threads get launched with already released info. You guys are indeed on the forums a lot, but there are times when having a mediator on hand would alleviate some tension. \n\nCase in point, the recent Skarner disaster. Scruffy did good in staying on the forums, but the big disconnect was that he didn't really address concerns. A mediator would have been appreciated in this case to let us know our concerns were being reviewed, but couldn't be considered. This would have relieved Scruffy of having to respond to every post.","replies":[]},{"poster":"ViCanFistMe","date":"2014-03-21T20:50:12.420+0000","up_votes":1,"down_votes":0,"body":"I volunteer as tribute for this place of honor for Riot. Riot, hire me and use me as fodder!","replies":[]},{"poster":"Grandmaster IMI","date":"2014-03-21T07:21:18.489+0000","up_votes":1,"down_votes":0,"body":"Have you considered this idea, anyone?\nhttp://community.na.leagueoflegends.com/en/c/site-feedback/mFtRxFln-idea-developer-support","replies":[]},{"poster":"Dragonheart NA","date":"2014-03-19T17:53:49.328+0000","up_votes":1,"down_votes":0,"body":"Here is a list of all the jobs at Riot --> http://www.riotgames.com/careers\n\nSeriously, I totally agree. Having one voice and coordinating the teams to bring one consistent message would do a lot for the company in my opinion. I would add more but I totally agree with everything you said. When you have a community as large as this such a popular game, having one or more people acting as a community liaison will bring tons or benefits and much more respect as a company. I have worked in IT and project management for 25 years and know how frustrating things can be for people when they feel they are not being heard or understood. Communication is 'key'.","replies":[]},{"poster":"GhastlyGhoulMan","date":"2014-03-19T04:48:23.551+0000","up_votes":1,"down_votes":0,"body":"I agree with this idea. It would definitely help keep things (possibly) from spiraling out of control from hate all the time. :P","replies":[]}]}