{"poster":"moampower","date":"2017-12-25T16:46:36.919+0000","title":"Fehler mit dem Client / Der Warteschlange mit geringer Priotität","subforum":"Hilfe & Support","embed":{"description":null,"url":"https://imgur.com/bDioTFh","image":"http://imgur.com/bDioTFhs.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo leute ich wollte hier im Forum um Hilfe f&uuml;r zwei Probleme mit meinem Account / Client fragen, diese Probleme machen es mir im moment nicht m&ouml;glich League of Legends zu spielen. \r\n\r\nIch habe das Problem das mein Client alle ~ 5-15 Minuten f&uuml;r 2-3 Sekunden disconnected, ich habe schon lange versucht dieses Problem zu beheben und war erfolglos. (Dabei ist mir an mehreren PC&#039;s aufgefallen das dieses Problem nur mit meinem Account Moampower vorhanden ist, was auch sehr merkw&uuml;rdig ist aber ich hoffe nicht weiter bedenklich.) Dieses Problem hatte mich bis jetzt nicht wirklich gest&ouml;rt und es ist f&uuml;r mich seit dem neuen Client vorhanden, wirklich nervig wird es jetzt daher dass ich in der &quot;Low Priority Queue&quot; 20 Minuten warten muss. Ich warte darauf dass diese 20 Minuten vorbei sind aber wenn ich Pech habe und mein Client kurz disconnected starten die 20 Minuten neu. Das hei&szlig;t ich bin nicht in der Lage in die Queue zu kommen und zu spielen. Jetzt zu dem Link/Bild , das ist nicht dass was Auftritt wenn mein Client disconnected, ich gehe davon aus das es ein Fehler des Clients ist. Es passiert einfach das die verbleibende Zeit sich auf 20 Minuten reseted ohne Grund, ich verlasse nicht einmal die Warteschlange dabei. Auf dem Bild sieht man dass ich bereits &quot;16:23&quot; Minuten warte aber die Verbleibende Zeit betr&auml;gt noch &quot;18:11&quot; Minuten, das zeigt auf das die Verbleibende Zeit sich &ouml;fters &quot;Reseted&quot;  selbst ohne Client Disconnect.\r\n\r\n*Und damit das klar ist das Disconnecten des Clients hat keinen Einfluss auf mein Spiel.\r\n\r\nUnd f&uuml;r die Leute die sich fragen warum ich in der &quot;Low Priority Queue&quot; bin, ich habe ein Spiel an einem schlechten Tag verlassen in dem ich mit meinem Team nicht ganz zu frieden war. Ich wei&szlig; das dass die falsche Reaktion war aber ich w&uuml;rde meine Strafe daf&uuml;r ja auch absitzen und es ist kein Normalfall.\r\n\r\nDie Frage ist ob irgendjemand eine L&ouml;sung f&uuml;r mich hat, oder jemand eine Idee hat warum dieses Fehler auftritt, ich bin f&uuml;r jede kommende Antwort dankbar.\r\n\r\n*Ps: Ich hoffe das dieses Forum f&uuml;r diesen Fall passt, das ist mein erster selbst erstellter Forum Eintrag.","replies":[{"poster":"legofreak1","date":"2017-12-25T20:06:27.458+0000","up_votes":1,"down_votes":1,"body":"Wenn du die Verbindung verlierst, während du in der Warteschlange bist, wirst du wieder von vorne eingereiht und musst erneut warten. Für ein einzelnes Verlassenes Spiel erhältst du keine 20 Minuten als Strafe, du hast also wahrscheinlich vorher schon eine für deine Verbindungsprobleme erhalten. Löst du diese, kannst du wieder Spiele suchen und erhältst für diese auch keine weiteren Strafen. Ein guter erster Ansatz sind die Artikel des Supports zu diesem Problem:\nhttps://support.riotgames.com/hc/de/articles/115005275528 \nhttps://support.riotgames.com/hc/de/articles/201752664","replies":[]}]}