{"poster":"Hanaguma","date":"2019-11-28T07:22:04.927+0000","title":"[TGSG] Time to say ...","subforum":"Allgemeiner Chat","up_votes":7,"down_votes":0,"body":"... Heeeey :D\r\n\r\nIch hab es Anfang der Woche angedroht und hier ist er: Mein erster TGSG Thread \\o/ \r\nWollen wir mal nicht unhöflich sein; Ich bin Hanaguma, Hana oder Anna (ist mir doch recht egal ^^“) und wenn ich hier mal was loswerde, wird es mit ziemlicher Sicherheit von meinem Alltag an der Uni (Angewandte Mathematik xD), meinen Vierbeinern, offensichtlicherweise von meiner Hassliebe zu LoL, anderen Games oder vllt auch mal Anime handeln (: - womit ihr meine groben Interessen raten könntet.\r\n\r\nAber wir wollen doch erst einmal den wichtigsten Fakt des Tages festhalten: Es ist quasi Freitag! Und damit quasi Wochenende! \r\nAuch wenn ich mich - wie wahrscheinlich jeder andere Mensch auf dieser Welt - ziemlich aufs Wochenende freue, fand ich doch, dass die Woche bis jetzt ziemlich fix rumgegangen ist!\r\n\r\nGestern Nachmittag war Ich das erste Mal aufm Weihnachtsmarkt - der hat Montag bei uns aufgemacht -, auch wenn ich irgendwie absolut noch gar nicht in Weihnachtsstimmung bin. Ich meine, kommt, wir haben noch November ... Aber! Ich konnte mir nicht die Möglichkeit auf einen Kinderschokoladen-Crêpe entgehen lassen und so war es echt ganz schön, vor allem weil um die Uhrzeit unter der Woche recht zu Beginn der Weihnachtsmarktzeit es angenehm leer war und nicht überall gedrängelt wurde.\r\n\r\nDanach hab ich ganz gekonnt nichts mehr gemacht und somit richtig schön lange geschlafen *-* \r\n\r\nHeute wird ein ziemlich langweiliger Tag To be honest. Bis 17:30 Uhr Uni und dann geh ich noch in der Weltgeschichte rumfahren um einen Dampfgarer abzuholen, den jemand zu verschenken abzugeben hat - da sagt man nicht nein :D\r\n\r\nIch wünsch euch einen ganz tollen Fast-Freitag, denkt dran - das Wochenende ist zum Greifen nah (:\r\n\r\n(Vllt kann ich mal bald nachschauen, wie man Bilder hier einbindet, ist ja eigentlich ganz praktisch :D)","replies":[{"poster":"Kirschkern","date":"2019-11-28T09:02:03.010+0000","up_votes":2,"down_votes":1,"body":"Na dann.\n\nIn irgendeinem der letzten Threads habe ich gelesen das du mit einem eigenen und deinem ersten TGSG Thread gedroht hast und inständig gehofft das es auch wirklich passiert D: Und das ist es. Also schon mal ein imaginäres Däumchen nach oben °-° kann auf der Arbeit leider keine Upvotes verteilen. Sogar die Steinzeit war moderner und komfortabler als der Scheiß der hier genutzt wird.\n\n> Es ist quasi Freitag! Und damit quasi Wochenende!\n\nWird auch Zeit!\n\nHeute ist mein erster Arbeitstag nach dem mini Urlaub und ich würde am liebsten direkt wieder nach Hause fahren tbh XD\n\nHier ist schon wieder alles so ... *komische Würg- und Ekelgeräusche mach* ... Das Pferd redet gar nicht mit mir. Gibt mir keine wichtigen Infos weiter und ich habe keine Lust mit ihr zu reden weil sie es einfach nicht worth ist. Sie hat auch direkt versucht mich bei der \"neuen\" PDL aka Frau Stressfaktor anzuschwärzen von wegen ich hätte Mist gebaut bei den letzten beiden Neueinzügen. Das konnte ich natürlich direkt mit der Wahrheit widerlegen, aber es geht ums Prinzip. Das sind so Sachen wo man sich zusammen reißen muss nicht ins Büro zu stürmen und zu schreien \"Ey du alte @§$%!\"# jetzt kommt mal klar du #*\"§€ sonst &amp;%€!\"@ [...]\" Deswegen verzichte ich auch dankend darauf mit ihr zu reden. Als ich mit Frau Stressfaktor eben noch geredet habe meinte sie auch noch einwerfen zu müssen \"Bei Herrn X auf dem Zettel ist auch angekreuzt das der Anmeldebogen da ist, aber da ist keiner\" XD Wo ich auch nur gesagt hab \"Keine Ahnung?\" ... Da hat Frau Stressfaktor aber auch gesagt das die Angehörigen das erst zum Sonntag mitbringen wo Ausnahmsweise mal ein Einzug stattfindet. Ich guck nachher trotzdem nochmal ob da ein Häkchen ist oder nicht °-° \n\nVielleicht wäre es fair wenn ich mich auch vorstelle? XD\n\nEinen Teil hier kennst du ja anscheinend schon? Bist du durch Zufall dazu gestoßen? Ist hier jemand so etwas wie deine Verbindungsperson die dich mit reingezogen hat?\n\nHallo!\n\nMein Name ist Tamara. Glaub die meisten belassen es mittlerweile bei \"TamTam\" °-° Oder Azima. Oder Kirsche. Oder Kern. XD\n\nlel .. Gut das ich seit einer halben Stunde an dem Teil schreibe und jetzt einfach lösche weil ich finde das es zu viel ist XD Ich versuch es nochmal kompakter!\n\n- Wohl die älteste Person hier\n- Ein Hund + Zwei heilige Birma Katzen\n- Arbeitet an einem Ort der schlimmer als die Hölle ist, was nicht am Ort selbst liegt, sondern an so genannten \"Kollegen\"\n- Threads bestehen meistens aus Meckereien über die Arbeit/ Kollegen und hin und wieder League Spoilern bzgl. anstehender Skins usw.\n- Ist gerne alleine und spielt vor allem gerne alleine\n- League ist momentan irgendwie auf Eis gelegt. Gibt nur eine Handvoll Spiele auf einem Lv 16 Smurf atm. Und TFT Spiele auf Azima die ... einfach so passiert sind XD idk\n- Spielt neben League nur noch Blade and Soul an einem Tag, alle vier Monate XD (fühlt sich zumindest so an)\n- Liebt schlafen + Hasst zu langes schlafen\n\nFertig :D Mehr gibt es nicht über mich zu sagen! Außer das ich eigentlich ganz nett bin :> aber das sind hier alle.\n\nOh doch. Ich bin so etwas wie die Mama der Ganzen Sache. Die anderen zwei/ drei Leute die mit verantwortlich sind für die Entstehung und tatsächliche Gründung und Umsetzung (dann sind es vier Leute) existieren momentan nicht oder nur als ... ich würde sie als Schattenwesen bezeichnen. Hin und wieder huschen sie mal vorbei ^^\n___\nNeue und nette Leute sind immer gern gesehen :) Freut mich!","replies":[{"poster":"Xayah Strife","date":"2019-11-28T09:09:11.483+0000","up_votes":1,"down_votes":0,"body":"Das ist die Uschi welche ständig Urlaub hat...\nIn 2,5 Woche ja schon wieder....\n{{sticker:sg-soraka}}","replies":[{"poster":"Kirschkern","date":"2019-11-28T09:16:06.932+0000","up_votes":1,"down_votes":0,"body":"=p Dafür war ich die ersten sechs Monate und von Juli bis Anfang Oktober actually durchgehend da D: Jetzt darf ich am Ende auch mal Urlaub haben :3","replies":[{"poster":"Xayah Strife","date":"2019-11-28T09:19:34.820+0000","up_votes":1,"down_votes":0,"body":"Ja das war auch sehr vorbildlich von dir aber leider hast du nun nachgelassen. :( \nBtw bist du die jünge hier nicht die älteste :D\n{{sticker:sg-ahri-2}} ","replies":[{"poster":"Kirschkern","date":"2019-11-28T09:31:41.266+0000","up_votes":1,"down_votes":0,"body":"Dann die zweit älteste. Du behauptest ja immer über 30 zu sein =p Aber ich bin noch drunter \\o/","replies":[{"poster":"Xayah Strife","date":"2019-11-28T09:37:26.527+0000","up_votes":1,"down_votes":0,"body":"Nein!\nDu bist 27\nMax ist damit älter als du..\nStäbchen hat noch den zweiten Weltkrieg miterlebt.\nMartin ist gleich alt wie du. \nIch bin eh Jesus.\nVllt ist Martins Freundin ja jünger als du\nSonst würde mir niemand einfallen. ^^","replies":[{"poster":"Kirschkern","date":"2019-11-28T09:55:23.352+0000","up_votes":1,"down_votes":0,"body":"Joa, wäre ganz schön wenn es hier ein paar ältere nette Herren geben würde =p\n\nAber das bleibt auch nur ein Traum °-°\n{{sticker:sg-lulu}}\n\nP.S.\nDas hat mich jetzt irgendwie an den geheimnisvollen Mister X erinnert :o Du böses Ding!","replies":[{"poster":"G2 Slippi","date":"2019-11-28T09:56:44.405+0000","up_votes":1,"down_votes":0,"body":"Also bin ich nicht nett? :(","replies":[{"poster":"XenesisCH","date":"2019-11-28T10:03:09.197+0000","up_votes":1,"down_votes":0,"body":"Das habe ich mich auch gefragt, aber dann habe ich beim genauen lesen noch **ältere** entedeckt, ich glaube sie meint damit mindestens Ü50. Ergo redet sie nicht von uns. ","replies":[{"poster":"G2 Slippi","date":"2019-11-28T10:14:31.785+0000","up_votes":1,"down_votes":0,"body":"Ja gut, wenn man darauf steht ^^","replies":[{"poster":"Kirschkern","date":"2019-11-28T10:59:01.182+0000","up_votes":1,"down_votes":0,"body":"Tatsächlich sollte man das \"ältere\" beachten :D Aber nicht wie Xeni sagt ü50. Das müsste schon 'ne Ausnahme sein der die krasseste aller krassen Begründungen (?) zu Grunde liegt XD\n\nUnd keine Angst :P du bist auch sehr nett! Was mich nicht davon abhält deine Frau zu klären :> XD Das musste irgendwie raus.","replies":[{"poster":"G2 Slippi","date":"2019-11-28T12:18:38.674+0000","up_votes":1,"down_votes":0,"body":"Ob sich hier im Forum wohl jemand mit ü50 rumtreibt? Wäre irgendwie interessant zu wissen ^^\n\nWas willst du mit meiner Frau klären? xD","replies":[{"poster":"Kirschkern","date":"2019-11-28T12:24:23.555+0000","up_votes":1,"down_votes":0,"body":"Hmmmmm Haudrpmoore (????) war doch ü50?\n\nNein nein =p mit deiner Frau will ich nichts klären. Ich will sie klären!\nhttps://media.tenor.com/images/62135e32e90344afbcd0ace63eb81657/tenor.gif","replies":[{"poster":"G2 Slippi","date":"2019-11-28T12:48:12.057+0000","up_votes":1,"down_votes":0,"body":"Ich glaube ich koche heute Pasta mit Tomaten, Mozarella und Ruccola {{sticker:sg-jinx}}","replies":[]},{"poster":"Kirschkern","date":"2019-11-28T12:40:25.373+0000","up_votes":1,"down_votes":0,"body":"Hmmmm Pastaaaaaa\n{{sticker:sg-jinx}}","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Hanaguma","date":"2019-11-28T12:15:23.900+0000","up_votes":1,"down_votes":0,"body":"Ihr seid alle so alt :p Ich habe es bis jetzt nur bis Level 20 irl geschafft :D \nBin ich jetzt euer Küken? ^^","replies":[{"poster":"Kirschkern","date":"2019-11-28T12:31:29.569+0000","up_votes":1,"down_votes":0,"body":"Es gibt nur ein Küken! °-°\n\nAuch in ihrer Abwesenheit wird Sophia immer das Küken sein °^°","replies":[{"poster":"Veezey","date":"2019-11-28T13:49:43.002+0000","up_votes":1,"down_votes":0,"body":"Und was war ich nochmal? :D","replies":[{"poster":"Kirschkern","date":"2019-11-28T13:57:17.778+0000","up_votes":1,"down_votes":0,"body":"Oh verdammt! Du warst auch ein Küken D:\n\nAber jetzt bist du Viktoria. Eine mittelgroße goldene Henne mit Alkoholproblem \\o/","replies":[{"poster":"Xayah Strife","date":"2019-11-28T14:11:59.050+0000","up_votes":1,"down_votes":0,"body":"Jetzt verrate doch nicht ihren Namen. :(\nJetzt geht mein Witz nicht mehr auf das ich ihr komische Männernamen gebe....","replies":[{"poster":"Kirschkern","date":"2019-11-28T14:14:15.699+0000","up_votes":1,"down_votes":0,"body":"Der Witz ist eigentlich das ich IHM einen weiblichen Namen verpasst habe, der von seinem eigentlichen Namen abgeleitet wurde.","replies":[{"poster":"Xayah Strife","date":"2019-11-28T14:34:32.988+0000","up_votes":1,"down_votes":0,"body":"Jetzt bin ich komplett verwirrend...\n\nhttps://media.tenor.com/images/232edcade5b7827357a34de5acc2d888/tenor.gif","replies":[{"poster":"Kirschkern","date":"2019-11-28T14:36:58.419+0000","up_votes":1,"down_votes":0,"body":":D Yeay!","replies":[{"poster":"Xayah Strife","date":"2019-11-28T14:39:45.779+0000","up_votes":1,"down_votes":0,"body":"Wir sollten \"Es\" in Max Keller bringen und dann entkleiden um zu sehen was \"Es\" ist. \n\nhttps://media.tenor.com/images/d06d37982c7487f0d55363767fd39815/tenor.gif","replies":[{"poster":"Kirschkern","date":"2019-11-28T14:51:08.698+0000","up_votes":1,"down_votes":0,"body":"Nein °-° Finger weg von meiner Viktoria!","replies":[{"poster":"Veezey","date":"2019-11-28T15:36:50.586+0000","up_votes":1,"down_votes":0,"body":"Jetzt bin ich schon dein Eigentum? Auch mal gut zu wissen{{sticker:sg-miss-fortune}}","replies":[{"poster":"Xayah Strife","date":"2019-11-28T15:46:17.905+0000","up_votes":1,"down_votes":0,"body":"Sie hat doch vorhin schon geschrieben sie sich Slippi Frau klar machen möchte also sei lieber vorsichtig. \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Veezey","date":"2019-11-28T16:41:34.602+0000","up_votes":1,"down_votes":0,"body":"Ach das passt schon xD","replies":[{"poster":"Veezey","date":"2019-11-29T13:16:13.102+0000","up_votes":1,"down_votes":0,"body":"Ich kann auf Zwieback verzichten :>","replies":[]},{"poster":"Xayah Strife","date":"2019-11-28T22:47:36.905+0000","up_votes":1,"down_votes":0,"body":"Ich glaube ich muss dich mal wieder in Handschelle legen.\nDu wirst langsam ein wenig zu frech.\nMorgen gibt es dafür keinen Zwieback zum Mittagessen!!","replies":[]},{"poster":"Veezey","date":"2019-11-28T21:53:31.120+0000","up_votes":1,"down_votes":0,"body":"Einfach nur eine Vermutung^^","replies":[]},{"poster":"Xayah Strife","date":"2019-11-28T20:09:55.285+0000","up_votes":1,"down_votes":0,"body":"Wieso nicht?","replies":[]},{"poster":"Veezey","date":"2019-11-28T20:08:33.513+0000","up_votes":1,"down_votes":0,"body":"So funktioniert das glaube ich nicht :D","replies":[]},{"poster":"Xayah Strife","date":"2019-11-28T17:09:59.191+0000","up_votes":1,"down_votes":0,"body":"Ich könnte natürlich auch Tamara nehmen die schon Slippes Frau hat und noch dich dazu dann hätte ich Harem. :)","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2019-11-28T15:01:38.048+0000","up_votes":1,"down_votes":0,"body":"Ne ich möchte endlich mal aufgeklärt werden. :)\nAber ich kann auch gerne meine Finger an dich legen...^^","replies":[{"poster":"Veezey","date":"2019-11-28T15:35:44.179+0000","up_votes":1,"down_votes":0,"body":"Ich bin eigentlich ein Kampfhubschrauber, der sich als Koala identifiziert.","replies":[{"poster":"Xayah Strife","date":"2019-11-28T15:45:42.674+0000","up_votes":1,"down_votes":0,"body":"Natürlich. :)","replies":[{"poster":"Xayah Strife","date":"2019-11-28T17:12:11.595+0000","up_votes":1,"down_votes":0,"body":"Ich halte dich einer für einen Bagger. :)","replies":[]},{"poster":"Veezey","date":"2019-11-28T16:40:55.297+0000","up_votes":1,"down_votes":0,"body":"Zweifelst du etwa? pew pew","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Veezey","date":"2019-11-28T15:32:37.607+0000","up_votes":1,"down_votes":0,"body":"Ne das finde ich nicht gut xD","replies":[]}]},{"poster":"Xayah Strife","date":"2019-11-28T13:52:54.670+0000","up_votes":1,"down_votes":0,"body":"Das wissen wir nicht. \nDu hast dich noch nicht vorgestellt.\nBisher bist du Uwe der Busfahrer. :)","replies":[]}]},{"poster":"Xayah Strife","date":"2019-11-28T12:53:04.542+0000","up_votes":1,"down_votes":0,"body":"Der war doch schon ewig nicht mehr hin. :) \n\nDie Sonderbonbons sind bei Anna glaub ich besser aufgehoben. ^^","replies":[{"poster":"Kirschkern","date":"2019-11-28T13:36:28.530+0000","up_votes":1,"down_votes":0,"body":"Nein","replies":[{"poster":"Xayah Strife","date":"2019-11-28T13:53:17.028+0000","up_votes":1,"down_votes":0,"body":"Bei mir schon. :)","replies":[]}]}]}]},{"poster":"G2 Slippi","date":"2019-11-28T13:43:39.761+0000","up_votes":1,"down_votes":0,"body":"Wir sind doch nicht alt ^^ Männer mit langen, grauen Bärten und Frauen mit Gehstock sind alt, aber wir doch nicht xD","replies":[]}]},{"poster":"INoKami","date":"2019-11-28T18:17:37.220+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 256, apokalyptisch späte Abendausgabe\n- INoKami´s Bizzare Adventure-Edition -**\n\nWas. Für. Ein. Tag.\nHeute war echt die Hölle los. Also der Reihe nach:\n\n* So wirklich beschweren darf ich mich ja nicht, weil ich es ja wirklich die letzten drei Tage heraufbeschworen habe... und nun ist es passiert. Mit voller Wucht.\nDeutsche Bahn natürlich, was habt ihr denn jetzt erwartet???\nIch, heute mit der früheren Bahn unterwegs, da noch ein Protokoll einzureichen ist (übrigens das letzte Protokoll für TU! Wir haben hiermit offiziell das dritte von fünf Praktika überlebt!) und ja... man kennt es: Bus ist überfüllt, Bahn lässt sich noch eine Minute mehr Zeit, mittlerweile ist man abgehärtet genug, um das einfach zu schlucken.\nUnd dann sind wir ungefähr in der Mitte meiner Strecke angelangt. Die Bahn hält, die Menschen gehen rein und raus... und wir warten. Rotes Signal? Keine Ahnung... und wir warten weiter. Drei Minuten Verspätung. Dann fährt endlich die Bahn los. Genau einen Meter weit, bevor die Notbremsung volle Möhre alle Insassen wie in einem Mixer durch den Zug schleudert. Da hat wohl jemand Spaß bei der Berufswahl gehabt... die Warterei geht also weiter. Fünf Minuten Verspätung. Der Zug fährt endlich los!\nTja, wieder mal genau einen Meter weit und wieder wird unnötig harsch gebremst. Mittlerweile wunderte es mich, dass ich noch niemandens Frühstück auf dem Boden gesehen habe. Und wir warten weiter. Auf dem anderen Gleis, dass eigentlich für die Gegenrichtung erbaut wurde, wird eine Regio angesagt... und zwar die, die eigentlich 8 Minuten hinter uns sein sollte!!! Schnell rechnet sich der Azubi aus, dass die Regio die schnellere Wahl als diese nervige S-Bahn ist. Also ab zur Tür und... sie geht nicht auf. Der Lappen von Lokführer hat einfach schon die Türen verschlossen, weil der Zug gleich los will!!! \"Gut\", denke ich mir, \"dann fahren wir halt gleich los! Verspätung haben wir ja schon genug...\"\nSchön wär´s.\nEs passieren weitere Minuten gar nichts (zum Glück aber auch keine Break Tests mehr...), bis dann an den Anzeigetafeln eine Nachricht aufploppt, die der Finisher ist. Es ist die voraussichtliche Ankunftszeit am nächsten Bahnhof. 20 Minuten Verspätung. Ne, den Spaß gebe ich mir nicht, zum Glück sind wir schon an der Hälfte der Strecke, heißt, eine andere S-Bahn und Regio-Linie hält hier auch. Die muss es also werden.\nErwähnte ich bereits, dass während dieser gesamten Wartezeit **NICHT EINE EINZIGE** Durchsage kam zwecks (Un-)Sinn des längeren Halts? Deutsche Bahn halt.\nZum Glück ist nicht alles verloren, denn nicht mal 10 Sekunden, nachdem ich die Bahn verlassen habe, rollt weiter hinten auf dem Gleis eine Regio ein. Also, Predator-Boots und Youmuus angeworfen und rein in die Blechkiste! Ging sogar gut. Nur jetzt ist Predator auf Cooldown, ohne dass ich was treffen konnte.\nOk, lassen wir das.\nEndlich geht es voran, im Rausfahren sehe ich noch, wie von meiner Linie die **NACHFOLGENDE** S-Bahn die immer noch stehende am Bahnsteig überholt, an einem späteren Bahnhof sehe ich diese nochmal, hab ausgerechnet, dass die nur drei Minuten Verspätung hat, im Endeffekt wäre die also wesentlich pünktlicher gewesen als die, die eigentlich eine Viertelstunde vorher losgefahren ist. Sachen gibt´s. Wir kommen nach einer gefühlten Ewigkeit an meinem Bahnhof an, aussteigen und zur U-Bahn rennen, der Zeitplan ist ja denkbar knapp... zu knapp. Als ich am U-Bahnsteig eintreffe, sehe ich gerade noch so die Rücklichter meiner U-Bahn. Na ja, wenn schon was schief geht, dann aber alles.\nAlso Planänderung: zurück zu den S-Bahnen, jede ist mir recht, da ich nur eine Station weit muss und ausnahmslos jede dort vorbeifährt. Dort gibt es nämlich auch einen passenden U-Bahn-Halt für mich. Wieder bei den S-Bahnen, die erstbeste wird genommen... oh, welch Ironie, es ist die von meiner Linie. Muss wohl die spätere sein, was auch sonst? Und noch besser: ihr Endhaltepunkt wurde wesentlich verkürzt, aber gut, da gibt es eine Wendeschleife oder so ähnlich... die Verspätungen muss man ja auch irgendwie korrigieren. Ich steige also ein, schaue belustigt auf die Anzeigetafel, schnell nicht mehr belustigt, sondern verwirrt, berechne die Differenz zwischen geplanter Ankunftszeit und tatsächlicher Uhrzeit...\nIch war wieder genau in der S-Bahn drin, in der ich vor 30 Minuten ausgestiegen bin. Ich begann, fast schon irre zu kichern und mich hätte es nicht gewundert, wenn man mich direkt von der S-Bahn in die nächstbeste Psychiatrie eingeliefert hätte. Ich hätte es aber auch irgendwie nötig.\nJunge, ich sitze hier schon seit einer Viertelstunde am Blog, wir sind bei locker 400-500 Wörter und das ist nur über die deutsche Bahn am Morgen!!!\nOh, warte, der Spoiler war unbeabsichtigt...\n* Schon ziemlich mit den Nerven am Ende komme ich an der Psychia… ähm, Schule an, ich will endlich nur das verdammte Protokoll abgeben (sind ja nur... 25 Minuten Verspätung von meinem ursprünglichen Plan), stehe am Labor, suche einen Assistenten… aber da ist keiner! Auch im Labor und im Assistentenzimmer ist keiner! Watsefuk?!\nNach 2 Minuten Belagerung stellte sich raus, die waren alle noch oben bei einer Besprechung und kamen daher alle gleichzeitig runter, nur, um ungelogen 15 Schüler in Empfang zu nehmen, die alle was von ihnen wollten. Darunter auch ich. Zum Glück ging das schnell: dem erstbesten Assistenten, der mich anschaute, Protokoll in die Hand gedrückt, er nahm es mit fertig.\nDann in den Hörsaal geschleppt und es machte sich jetzt schon das wohlig-bekannte \"Ich will nicht mehr!!!\"-Gefühl in mir aus.\n* Unsere Schule betont ja gerne, eine \"Schule ohne Rassismus\" zu sein. Ist ungefähr so wahr wie die Aussage \"Ich habe die Nutzungsbedingungen gelesen\". Erneutes Beispiel: heute Morgen. Ein Mitschüler kommt herein und bringt einen umgebauten Briefkasten mit. Die vordere Platte ist transparent, das Innere in zwei Kammern unterteilt: \"Ja\" und \"Nein\". Auf dem Einwurfschlitz war eine Frage. Der Sinn dahinter: damit die ganzen Raucher nicht ihre Kippen achtlos in die Umwelt schmeißen, können sie die auch in den Kasten werfen und nebenher noch an Umfragen teilnehmen, die der Schüler für seine Projektarbeit macht.\nSo. Und was macht man, wenn man Nichtraucher ist? Schon dezent diskriminierend...\n* Stöchiometrie und ich könnte kotzen. Wir haben die Klausur von letzter Woche besprochen und ich sage voraus: alles, was besser als eine 5 ist, wird als positive Überraschung vermerkt.\nIch sollte wirklich Motivationscoach werden.\n* Am Mittag gab es dann eine recht interessante WhatsApp, nämlich die Resultate der Klassensprechersitzung vom Montag. Hier die Ergebnisse im Schnelldurchlauf: Heizung in der Umkleide ist seit Monaten kaputt (vermerkt, wird irgendwann repariert), Mikrowelle in der Mensa ist kaputt (vermerkt, wird irgendwann repariert), wir bekommen eine Kaffeemaschine (die gibt aber kein Rückgeld und im Gebäude Kaffee trinken ist und bleibt verboten. Meine Schule halt), wir haben zu wenig Geräte (\"Reden sie mit Lehrer xy\" a.k.a. \"Nicht unser Problem\"... ist ja auch nur die Schulleitung, mit der gesprochen wurde), die Kleinen sind unsauber beim Reinigen von Labor und Hörsaal (scheint aber eine Tradition zu sein, dass sich das höhere Semester darüber beschwert. Gut, bei den Hygiene\"standards\" kann ich es aber auch verstehen, dass man Eingewöhnungszeit braucht) und die Geräteausgabe wird im Laufe des Jahres (konkrete Zeitangaben? Jauchzet und frohlocket, meine Kinder!!!) von einem anderen Lehrer übernommen, der die fast 80-jährige Lehrerin damit ablöst. Aber dafür noch langsamer ist als eben diese Lehrerin, da körperlich eingeschränkt (ich nenne keine Details) und ebenfalls in der Altersklasse 70+... die haben doch alle einen gottverdammten Lattenschuss in der Führungsetage!!!\n* Rückfahrt... oh boi. Deutsche Bahn, die zweite. Gut, es waren \"nur\" 7 Minuten Verspätung und ein verpasster Bus, aber das soll nicht Thema sein. Schon beim Einsteigen fällt mir ein älterer Mann im Rollstuhl auf, ebenfalls an der Station zugestiegen. Gut, erstmal war der für mich irrelevant, ich habe meinen Sitzplatz, alles ist gut. Der Mann beginnt daraufhin, sich mit einem anderen Fahrgast, ungefähr mein Alter, zu unterhalten. Kurz vor meinem Ausstieg spricht mich der Nicht-Rollstuhlfahrer an und fragt, ob ich diesem mit dem Aufzug helfen könne. Gut, der Bus ist eh weg, also kann die die paar Minuten Warterei auch sinnvoll nutzen. Gesagt, getan, wir sind mit dem Aufzug an der richtigen Seite des Bahnhofs angekommen. Ich frage ihn, wo er hin muss, der Busbahnhof soll es sein? Nebenbei fällt mir auf, dass seine Kommunikationsfähigkeiten eher eingeschränkt sind, aber gut, solche gibt es auch. Am Busbahnhof angekommen frage ich ihn, welchen Bus er denn brauche... konnte er mir nicht sagen. Das einzige, was er weiß, ist der Name des Pflegeheims, wo er hin muss. Nach einigem Hin und Her weiß ich endlich genau, wo er hin will (weil es bei uns im Ort zwei verschiedene Einrichtungen mit dem selben Namen gibt, musste erst rausfinden, welche davon er meinte)… tjoa, nur blöd, dass halt der Bus, den er braucht, auch meiner war. Und der ist schon ein paar Kilometer vom Bahnhof weg und dreht seine Runde.\nAlso habe ich mal kurz ein spontanes Praktikum zum Krankenpfleger absolviert und hab den Mann nach Hause geschoben. Gut einen Dreiviertel Kilo\n\nSo, und damit endet meine wahnwitzige Geschichte heute. Morgen schreiben wir Mathe, ich versteh gar nichts bei den Lehrer (haben wir übrigens auch bei der Klassensprechersitzung angesprochen. \"Wir reden mal mit ihm.\"), also das wird auch ein Quell der Freude werden. Aber jetzt genug, ich habe mir die Pause verdient!\n\nOk, vielleicht eine Sache noch: herzlich willkommen an unseren Neuzugang! Fühl dich wie zu Hause!\nMit Games und Anime wirst du hier schnell Freunde finden, Vierbeiner... ist eine Gratwanderung. Es gibt nur eine gültige Antwort und solltest du nicht diese angeben, wirst du ziemlich wahrscheinlich rechtskräftig zum Tode verurteilt und gesteinigt. So läuft das halt ;)\nAch ja, frisches Blut ist immer schön zu haben...\n\n_*_ _cries in Skin- &amp; Champion-Konzept-Schreiber_ _*_","replies":[]},{"poster":"Kirschkern","date":"2019-11-28T09:29:30.042+0000","up_votes":1,"down_votes":0,"body":"Apropos Weihnachten.\n\nNein.\n\nDas einzig gute an Weihnachten ist das \"viele\" frei haben, zumindest dieses Jahr, und das ganze Essen XD Und das wunderbar super schöne kalte Wetter wodurch es mir ermöglicht wird eine kuschelige Jacke zu tragen und einen flauschigen Schal °-° Vor meinem Urlaub war ich so kuschelig verpackt das ich auf der Heimfahrt im Zug so tief eingeschlafen bin das ich geschnarcht habe \\o/\n\nWobei es seit vorletzter Nacht wieder viel zu warm ist. Richtig nervig.","replies":[{"poster":"Nordwolf87","date":"2019-11-28T15:11:42.182+0000","up_votes":1,"down_votes":0,"body":"Die meisten feiern Weihnachten, weil die meisten Weihnachten feiern ;)","replies":[]}]},{"poster":"Kirschkern","date":"2019-11-28T09:49:10.434+0000","up_votes":1,"down_votes":0,"body":"Hier geht doch irgendetwas vor °^°\n\nDas Pferd sagt das morgen Rechnungslauf ist und hat sich schon Belege aus meinem Ordner raus geholt. Sogar die von den Taschengeldkonto Leuten. Das verwirrend XD Weil die zu meinem Rechnungslauf gehören!\n\nAlso mache ich das Taschengeld anscheinend nicht morgen °-°\n\nDann könnte es sein das ich morgen den Rechnungslauf durch böller und so gut wie gar nicht hier bin :o Ich arbeite ja nur bis 13 Uhr und länger werde ich definitiv nicht bleiben. Auch wenn die Briefe noch frankiert und weg gebracht werden müssen. Nein.\n\nEgal wie weit ich dann morgen komme, laufe ich 12.50 raus und Richtung Post. Muss nur daran denken meine Aushilfe zu bitten 15 Minuten früher zu kommen D: sofern das geht.\n\nWieso muss der Rechnungslauf auch schon morgen sein? Hallo? 29.11.? Sonst wird auch eher das Wochenende gewartet was hier auch der 02.12. wäre ... sonst ist das legit nie ein Ding XD","replies":[{"poster":"Nordwolf87","date":"2019-11-28T11:43:53.133+0000","up_votes":1,"down_votes":0,"body":"Ich mag dein neues icon {{item:2010}} \n\n:D","replies":[]}]}]}