{"poster":"Riot Lutzburg","date":"2015-01-02T02:21:16.122+0000","title":"Mitsukai, Emissary from the Clouds","subforum":"Concepts & Creations","up_votes":14,"down_votes":0,"body":"**Role**: AP Support, AP Mage\n\n**Inspiration**: I wanted to create a champion based on a character from my childhood, who was blessed with divine powers due to her devotion to her people’s religion.\n\n**General Design Philosophy**: Mitsukai is a utility and sustain-based support Champion with a heal, slow, tenacity boost, situational stun and a global ultimate which creates impassible terrain anywhere on the map. She is meant to be rather passive in lane, poking and deterring engagements whenever possible.\n\n**Risk Analysis**: Low. Mitsukai's semi-global Ultimate is definitely cause for concern, but I believe it can be tweaked and balanced in a way that makes it a healthy addition to the game.\n\n**Appearance**: Mitsukai is a winged champion from a city in the clouds high above Runeterra, who uses a global ultimate to summon aid from her allies above. She is a devout religious acolyte where she comes from, which imbues her with gifts and blessings in combat.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/Avatar-Priest-world-of-warcraft-burning-crusade-angel-wallpaper_zps55e1bd46.jpg\n\n> **Lore**: Mitsukai hails from a realm far above Runeterra; possibly even another world entirely.  This is a world of angelic immortals, which also once served as the home of Kayle and Morgana.  Their deep-seeded and deadly sibling rivalry eventually bound them both to serve the Grand Council, having both made separate deals with the Institute of War in exchange for advantages in their selfish war, which they had waged high above the clouds for over 10,000 years.  Their shortsightedness and lust for seeing the demise of their counterpart ultimately betrayed them both, however, for in their absence the war they cared so much about had come to a peaceful resolution.\n> \n> Without Morgana and Kayle embroiled in their cruel, deceptive conflict, the people they claimed to serve learned to coexist peacefully.  Enter Mitsukai, a mediator, humanitarian and philanthropist who was instrumental in ending the immortals' war.  With her duties complete in her homeland, Mitsukai sought to expand her message of peace to the world of Runeterra.  This land of mortals only knew her world as one of endless war, fueled by the bitter, spiteful sisters Kayle and Morgana.\n> \n> However, despite Mitsukai's best effort of diplomacy, the Institute of War refused to relinquish the sisters of their millennium-long contracts, which tasked them to wage war on the Fields of Justice for the next thousand years.  Facing no other options, Mitsukai vowed to show Runeterra the true potential of her world, as it now experienced a peace it hadn't seen for thousands of years.  With an unwavering conviction and a devout sense of faith for her enlightened home world, Mitsukai agreed to join the League of Legends and become *the Emissary from the Clouds.*\n> \n> (Special thanks to SpectrailWraithX for kicking off the inspiration for Mitsukai's lore!)\n\n**Strengths**: global utility ultimate, targeted heal, strong suite of crowd control and utility\n\n**Weaknesses**: incredibly low defensive stats comparable to Sona, long cooldowns, low AP ratios, inconsistent stun\n\n**Plays Most Like...**: {{champion:16}} {{champion:37}} {{champion:68}} \n\n**Auto Attack**: a ranged attack that sends an energy bolt from the tip of Mitsukai's staff.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_13215_pas_zps1b914955.jpg\n**Passive- Protectors From Above**: When Mitsukai drops below 30% health, a beacon of light from the skies appears nearby which lasts for 5 seconds. This beam travels along the ground, lighting and guiding Mitsukai's path based on her current movement patterns. Mitsukai restores 3% of her maximum health for every .5 seconds she stays within the light's rays (max 30% health). Allies receive half of these effects. This ability has a cooldown of 60 seconds.\n**Design Philosophy**: This is a thematically iconic ability, reminding players that Mitsukai is being watched over at all times and has the blessings of higher beings with her. Mechanically this allows her to survive potential dives or all-ins where she and her carry at bot lane came out on the bottom. From a technical perspective, this beacon would likely adopt similar behavior as Draven’s axes, predicting her desired movement patterns and guiding the light along that trajectory. (Special shout out to Earthlord Jazz for suggesting the tweak to this ability!)\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_8552_pas_zpscc82ce8d.jpg\n**Q- Righteous Squall (9 sec)**: Mitsukai flaps her wings with all her might, sending a gust of wind in a direction of her choice. This deals magic damage and pushes enemies back slightly. Enemies who are closer to Mitsukai are pushed back further. If pushed into a wall or other impassible terrain, the enemy becomes stunned for 1.5 seconds. In addition, if an allied champion is caught in the gust, they become refreshed and are cured of any slowing or Grievous Wounds effects they may be suffering from. This dispelling mechanic cannot affect Mitsukai directly.\nRank-ups lower cooldown and increase damage.\nThe range and width of this ability is comparable to Tryndamere's Spin.\n**Design Philosophy**: Another powerful disengagement tool, promoting a safe laning phase so that her ADC can farm effectively. The stun component adds some skill and positioning components to the ability, allowing Mitsukai to lock down enemies near walls. This also synergizes heavily with her Ultimate, which can actually create a series of walls for her to use. The dispel mechanic allows Mitsukai to better fulfill her role as a utility-focused support champion in instances where pushing an enemy back is not an ideal option. The ability to remove Grievous Wounds on an ally also synergizes with both her Passive and W incredibly well.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_7646_btn_zps39f2b18a.jpg\n**W- Sky’s Favor (14 sec)**: Mitsukai imbues an ally with a heal that also grants 20/25/30/35/40% bonus tenacity to the target for 2 seconds, not to exceed 99% tenacity.\nRank-ups increase heal and bonus tenacity.\n**Design Philosophy**: This is a standard and somewhat powerful heal in line with Soraka’s. Rather than granting bonus armor, though, Mitsukai’s grants bonus tenacity. This is an amazing disengagement tool when cast on an ally about to be crowd controlled, or on a tank who is trying to reach a priority target to lock them down.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11928_pas_zps7d9346cf.jpg\n**E- Wings of Reverence (8 sec)**: Mitsukai summons 1/2/3/4/5 feathers that encircle her for the next few seconds. Damaging an enemy with any other spell or auto attack causes a feather to hone in on that enemy, dealing magic damage and slowing them by 15% for 2 seconds. This slow stacks. In addition, the feathers will seek out enemy champions who attack Mitsukai directly. Subsequent feathers deal 50% less damage to their targets.\nRank-ups increase the number of feathers summoned, therefore increasing damage and slow potential.\n**Design Philosophy**: This ability allows Mitsukai the ability to poke and harass in lane, similar to Sona. This ability functions similarly to Nami’s E, but requires the rather defenseless Mitsukai to take the initiative and attack enemies herself.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11732_btn_zpsf16eb012.jpg\n**R- Heaven’s Fury (120 sec)**: Mitsukai uses vector targeting to initiate a semi-global ultimate (that scales in distance similar to Pantheon or Twisted Fate) that crashes a row of ornate, pillar-like statues in a line down from the skies above. This series of ~5 statues are roughly the length and width of Anivia's wall at max rank, and their shadows appear on the ground as they near the impact site to allow enemies a chance to prepare for their arrival. These pillars deal magic damage upon impact and create impassible terrain for 2/2.5/3 seconds before exploding in a chain reaction one at a time, dealing additional magic damage to enemies caught in the blasts. Mitsukai can reactivate this ability at any time to prematurely detonate the pillars.\nRank-ups increase the ability's activation time, lower cooldown, increase damage and increase cast range.\nVisually and mechanically this ability is similar to a combination of Rumble's ultimate and Anivia's wall.\n**Design Philosophy**: This is Mitsukai’s most iconic ability and provides amazing global utility to either secure a kill or gate off attackers from reaching an ally. Mitsukai can actually use these pillars as a wall, pinning enemies against them by using Righteous Squall before detonating them. Visually, these pillars should be reminiscent of ornate, beautifully crafted works of architecture, to evoke a sense of divination and beauty towards the world above.\n\nIf you liked this Champion, you can find over 70 more of my original concepts [HERE!](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/uuQxluoH-lutzburgs-champion-concepts-mega-thread?show=flat)","replies":[{"poster":"Riot Lutzburg","date":"2015-04-14T00:52:26.333+0000","up_votes":1,"down_votes":0,"body":"Any thoughts on Mitsukai's new lore?","replies":[{"poster":"SpectralWraithX","date":"2015-04-14T09:49:31.753+0000","up_votes":1,"down_votes":0,"body":"Did you get my email?","replies":[{"poster":"Riot Lutzburg","date":"2015-04-14T17:40:19.130+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000d0000,timestamp=2015-04-14T09:49:31.753+0000)\n>\n> Did you get my email?\n\nYes I did, thanks for taking the time to read her new lore.  As soon as you said \"mediator\" I knew that was the direction to take Mitsukai in.","replies":[{"poster":"SpectralWraithX","date":"2015-04-15T09:16:22.309+0000","up_votes":2,"down_votes":0,"body":"Yeah, it wasn't the mediator part that surprised me. But I'm glad I was able to be of some help. I was just thinking that schematically her ult could have been used to seperate Morgana and Kayle","replies":[{"poster":"Riot Lutzburg","date":"2015-04-15T17:29:56.643+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000d000000000000,timestamp=2015-04-15T09:16:22.309+0000)\n>\n> Yeah, it wasn't the mediator part that surprised me. But I'm glad I was able to be of some help. I was just thinking that schematically her ult could have been used to seperate Morgana and Kayle\n\nAh, that's a really cool and symbolic concept!  This visualization would look amazing as the splash screen intro for Mitsukai!","replies":[{"poster":"SpectralWraithX","date":"2015-04-15T23:58:41.912+0000","up_votes":1,"down_votes":0,"body":"Yep, here's to hoping riot makes this champion.","replies":[]}]}]}]}]}]},{"poster":"FlameHalbrdOkido","date":"2015-01-10T04:24:46.890+0000","up_votes":2,"down_votes":0,"body":"the support roster does need a buff in my opinion though, this is a great champ","replies":[{"poster":"Riot Lutzburg","date":"2015-01-10T05:40:49.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=0004,timestamp=2015-01-10T04:24:46.890+0000)\n>\n> the support roster does need a buff in my opinion though, this is a great champ\n\nNice, glad you like it!","replies":[]}]},{"poster":"FlynttFlossy","date":"2015-01-06T23:06:18.142+0000","up_votes":2,"down_votes":0,"body":"I'm all about new supports, tired of the few decent ones that work in this meta, and tired of getting flak for trying to break the meta by trying non conventional champs as bot lane combos","replies":[{"poster":"SlushieDee","date":"2015-06-10T18:37:47.814+0000","up_votes":1,"down_votes":0,"body":"Try Diana/Orianna sometime.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-07T02:33:02.323+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlynttFlossy,realm=NA,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=0003,timestamp=2015-01-06T23:06:18.142+0000)\n>\n> I'm all about new supports, tired of the few decent ones that work in this meta, and tired of getting flak for trying to break the meta by trying non conventional champs as bot lane combos\n\nThanks Flyntt, glad you like her.  I totally agree!","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-01-06T19:29:55.085+0000","up_votes":2,"down_votes":0,"body":"I would love for someone to propose an idea for Mitsukai's lore and how she intersects with Kayle and Morgana.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-05T04:33:31.763+0000","up_votes":2,"down_votes":0,"body":"Time to part the clouds to the heavens and bring Mitsukai back to the top where she belongs!","replies":[]},{"poster":"Lysdexic1","date":"2015-01-02T23:09:21.715+0000","up_votes":2,"down_votes":0,"body":"I think the ultimate is a little bit overpowered. Five Anivia walls  that deal damage is kind of insane when you think about it...... Or did you mean the combined total 5 are equal to that? in which case i think it is a bit better. Is it a channeled ability or instantly cast? And if it IS channeled i think it would conflict directly with her Q, giving enemies time to reposition themselves away from the wall so they can avoid the stun.... not actually a terribly bad thing, it gives the ability quite a bit of counterplay and i like that.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-02T23:24:11.757+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lysdexic1,realm=NA,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=0000,timestamp=2015-01-02T23:09:21.715+0000)\n>\n> I think the ultimate is a little bit overpowered. Five Anivia walls  that deal damage is kind of insane when you think about it...... Or did you mean the combined total 5 are equal to that? in which case i think it is a bit better. Is it a channeled ability or instantly cast? And if it IS channeled i think it would conflict directly with her Q, giving enemies time to reposition themselves away from the wall so they can avoid the stun.... not actually a terribly bad thing, it gives the ability quite a bit of counterplay and i like that.\n\nHaha whoops!  That sentence refers to the fact that visually, her Ult is comprised of around 5 of these Roman-esque pillars, and that the total physical size of the Ultimate is that of Anivia's max-ranked wall.\n\nI imagine this ability working similarly to Soraka's Ultimate in that it is often not needed until it's almost too late.  Having the awareness and presence of mind to use it in a clutch way is already pretty taxing for a support who is also worried about a hundred other things at the time.  Since I imagine the pillars to have a bit of a \"cast time\" as they fall (like a sped up Pantheon ult) I wouldn't want to also impose a cast time on Mitsukai's end.  Smart suggestion, though!","replies":[]}]},{"poster":"Keagn","date":"2015-04-14T01:26:56.712+0000","up_votes":1,"down_votes":0,"body":"Decided to take a look at this a little earlier than I said I would. Big fan of some of your previous works by the way, though I've been more of a lurker :P\n\nPassive: This is a really neat idea, but it seems a little low. Assuming you don't get hit (which is the opposite of what it sounds you're intending it for), you gain 25% health back, returning to a total of 55% , just a bit over half. An interesting empowerment to this might be is that the health regen increases if she takes additional damage while in the light, say instead of 5% she gets hit and its upped to 7% or something, or maybe gets a damage reduction.\n\nQ: Really neat ability, which I've honestly thought Kayle kinda needed with the whole winged paladin look, and you do a lot of justice to it.\n\nW: Pretty standard heal, though I would reduce the tenacity closer to 30-35% ish, not way more powerful than a tenacity item (all I can think of is boots :P). \n\nE: Kinda neat, reminiscent of Ahri, but behaves differently. Kinda Ahri fox-fire + Janna Zephyr. Its cool.\n\nR: This is the only thing I have a real problem with. The idea of the ability is nice, but the range is too much. The point of an ability like Anivia's wall, or Azir's ult, or abilities of the like is it provides some risk as far as how close you gotta be to use it, but this eliminates that. In my opinion, that makes an uneven trade, and an overpowered ability.\n\nOverall I like the concept, we could definitely use more angelic champions. Keep up the good work ^_^","replies":[{"poster":"Riot Lutzburg","date":"2015-04-14T06:06:08.856+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keagn,realm=NA,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000e,timestamp=2015-04-14T01:26:56.712+0000)\n>\n> Decided to take a look at this a little earlier than I said I would. Big fan of some of your previous works by the way, though I've been more of a lurker :P\n> \n> Passive: This is a really neat idea, but it seems a little low. Assuming you don't get hit (which is the opposite of what it sounds you're intending it for), you gain 25% health back, returning to a total of 55% , just a bit over half. An interesting empowerment to this might be is that the health regen increases if she takes additional damage while in the light, say instead of 5% she gets hit and its upped to 7% or something, or maybe gets a damage reduction.\n> \n> Q: Really neat ability, which I've honestly thought Kayle kinda needed with the whole winged paladin look, and you do a lot of justice to it.\n> \n> W: Pretty standard heal, though I would reduce the tenacity closer to 30-35% ish, not way more powerful than a tenacity item (all I can think of is boots :P). \n> \n> E: Kinda neat, reminiscent of Ahri, but behaves differently. Kinda Ahri fox-fire + Janna Zephyr. Its cool.\n> \n> R: This is the only thing I have a real problem with. The idea of the ability is nice, but the range is too much. The point of an ability like Anivia's wall, or Azir's ult, or abilities of the like is it provides some risk as far as how close you gotta be to use it, but this eliminates that. In my opinion, that makes an uneven trade, and an overpowered ability.\n> \n> Overall I like the concept, we could definitely use more angelic champions. Keep up the good work ^_^\n\nOh hey, great!  Thanks for writing up such a detailed review.\n\nI agree with you about the power level of her Passive and have adjusted it to 3% every .5 seconds from 5% every second.  This gives it a decent bit more healing power while also being more reliable and predictable in its cadence.\n\nGlad you like the Q!  The tenacity on W is a bit extreme; I'll tone it down.\n\nFor her Ultimate, the range does scale with rank so it's not massive right away.  I see what you're saying about other wall abilities, but they are instant and on a shorter cooldown (especially Anivia's wall or Trundle's pillar).  I think there's enough counterplay around this ability given the fact that it has a signifcant, multi-second long summoning time.  Still, I respect your opinion on the matter.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-04-13T07:54:50.525+0000","up_votes":1,"down_votes":0,"body":"Mitsukai's lore has been updated.  Thanks again to SpectrailWraithX for the original inspiration!","replies":[]},{"poster":"SpectralWraithX","date":"2015-04-03T09:08:41.172+0000","up_votes":1,"down_votes":0,"body":"Hey Lutz, how are you doing on the lore?","replies":[{"poster":"Riot Lutzburg","date":"2015-04-03T17:52:57.764+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000b,timestamp=2015-04-03T09:08:41.172+0000)\n>\n> Hey Lutz, how are you doing on the lore?\n\nHaven't gotten to touch it yet, I'm afraid.  Only so many hours in the day.  Looking to work on it this weekend, though!","replies":[{"poster":"SpectralWraithX","date":"2015-04-03T17:58:03.969+0000","up_votes":1,"down_votes":0,"body":"Kk. no worries. Have a happy easter mate.","replies":[{"poster":"Riot Lutzburg","date":"2015-04-03T17:58:39.909+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000b00000000,timestamp=2015-04-03T17:58:03.969+0000)\n>\n> Kk. no worries. Have a happy easter mate.\n\nThanks, you too!  Probably going to the beach with my girlfriend, so it should be a lovely and relaxing time.  :)","replies":[]}]}]}]},{"poster":"Nameless Hero","date":"2015-04-02T13:24:37.252+0000","up_votes":1,"down_votes":0,"body":"Hi Lutzburg, \n\nwhat do you mean by vector targeting with her ultimate?","replies":[{"poster":"Riot Lutzburg","date":"2015-04-02T15:29:32.324+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nameless Hero,realm=EUW,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000a,timestamp=2015-04-02T13:24:37.252+0000)\n>\n> Hi Lutzburg, \n> \n> what do you mean by vector targeting with her ultimate?\n\nVector targeting is an input method that some abilities in League use. Rumble's Ultimate and Viktor's laser both use vector targeting.","replies":[{"poster":"Nameless Hero","date":"2015-04-03T07:39:17.614+0000","up_votes":1,"down_votes":0,"body":"Interesting, I've been skimming the old boards for their tips on champion design and now I've just seen something on vector targeting. \n\nAnyway I really like your ultimate. It sounds incredibly useful and powerful and I love doric architecture but man these are columns not walls. Columns are always spaced apart and the thematic would be really odd for a wall. \n\nCan I suggest something? \n\nWhy can't she summon  a row of 4 angelic statues or 4 immobile angelic warriors? They would function exactly the same and would look a lot more intimidating especially if you call it Heaven's Fury.","replies":[{"poster":"Riot Lutzburg","date":"2015-04-03T17:52:31.784+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nameless Hero,realm=EUW,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000a00000000,timestamp=2015-04-03T07:39:17.614+0000)\n>\n> Interesting, I've been skimming the old boards for their tips on champion design and now I've just seen something on vector targeting. \n> \n> Anyway I really like your ultimate. It sounds incredibly useful and powerful and I love doric architecture but man these are columns not walls. Columns are always spaced apart and the thematic would be really odd for a wall. \n> \n> Can I suggest something? \n> \n> Why can't she summon  a row of 4 angelic statues or 4 immobile angelic warriors? They would function exactly the same and would look a lot more intimidating especially if you call it Heaven's Fury.\n\nThat's a great idea.  I went with columns simply because I wanted to capture the ornate feel of a Roman-esque or Cathedral vibe.  Turning them into huge statues lined up in a row would totally work.","replies":[]}]}]}]},{"poster":"SpectralWraithX","date":"2015-04-02T01:17:04.086+0000","up_votes":1,"down_votes":0,"body":"Just one question, can the q trigger both effects of dispelling debuffs and knocking back enemy champions? The q honestly reminds me of Gnar's ult. I would probably change the stun time on that to be the same as Leona's q which is 1.25 seconds. 1.5 is kinda long for a non ult ability.","replies":[{"poster":"Riot Lutzburg","date":"2015-04-02T01:41:50.538+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=0009,timestamp=2015-04-02T01:17:04.086+0000)\n>\n> Just one question, can the q trigger both effects of dispelling debuffs and knocking back enemy champions? The q honestly reminds me of Gnar's ult. I would probably change the stun time on that to be the same as Leona's q which is 1.25 seconds. 1.5 is kinda long for a non ult ability.\n\nYes, the gust is just a pass through skillshot so it'll do whatever it should contextually based on who happens to be caught in it.  Seems odd that it reminds you of Gnar ult.  It's designed to be about the width of Lux ult and have semi-short range.  It doesn't affect enemies around her; only the 1-2 she manages to hit with it.\n\nThe 1.5 second stun is also contextual based on being able to slam them into a wall, Condemn style.  Since this will happen rarely (except when used in conjunction with her Ultimate), I think 1.5 seconds might be justifiable.  For reference, Vayne and Poppy's terrain-based stuns are both 1.5 seconds, as well.","replies":[{"poster":"SpectralWraithX","date":"2015-04-02T01:43:56.345+0000","up_votes":1,"down_votes":0,"body":"Gnar's ult is similar to condemn in that if he throws them into the wall, they get stunned. But anyways, I emailed you an idea for the lore. check it out.","replies":[{"poster":"Riot Lutzburg","date":"2015-04-02T01:46:16.971+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=L0mB5hEo,comment-id=000900000000,timestamp=2015-04-02T01:43:56.345+0000)\n>\n> Gnar's ult is similar to condemn in that if he throws them into the wall, they get stunned. But anyways, I emailed you an idea for the lore. check it out.\n\nJust saw it!","replies":[{"poster":"SpectralWraithX","date":"2015-04-02T02:04:56.295+0000","up_votes":1,"down_votes":0,"body":"And the reason I made a comment on the stun is, vayne's condemn and poppy's heroic charge are single target abilities. They can only stun one person. That's why the stun is allowed to be 1.5 seconds. Anyways, did you get my followup email asking if there's any other champs you want me to have a look at the lore for?","replies":[]}]}]}]}]},{"poster":"Riot Lutzburg","date":"2015-04-02T00:12:41.120+0000","up_votes":1,"down_votes":0,"body":"I'm here from heaven to deliver the gift of the front page to Mitsukai.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-03-18T22:26:16.515+0000","up_votes":1,"down_votes":0,"body":"Whoa-oh!  We're halfway there!","replies":[]},{"poster":"Riot Lutzburg","date":"2015-03-10T04:02:28.864+0000","up_votes":1,"down_votes":0,"body":"I'm saying a prayer for Mitsukai to get noticed by the community tonight!","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-13T22:56:37.780+0000","up_votes":1,"down_votes":0,"body":"Mitsukai is going to fly back to the front page for a while.","replies":[]}]}