{"poster":"Riot Lutzburg","date":"2015-01-02T05:22:53.272+0000","title":"Thalius, the Arcane Blacksmith","subforum":"Concepts & Creations","up_votes":5,"down_votes":0,"body":"**Role**: AD Bruiser\n\n**Inspiration**: The original inspiration for Thalius was to create a ‘simple’ champion with ‘fire and forget’ abilities ideal for players new to *League of Legends*. This was to offset the mechanically complex champions I had been making recently.\n\n**General Design Philosophy**: Thalius’ design philosophy was a simple one: Create a champion that embodies the phrase, “Easy to learn, difficult to master.” The first step in embodying this mentality is to create a kit that doesn’t rely on a resource system, similar to Riven and Aatrox. Second, all of Thalius’ abilities are straightforward and efficient in their purpose. Finally, his Ultimate, while effective even in the hands of an inexperienced player, hides an immense layer of depth and nuance that skilled players can take advantage of.\n\n**Risk Analysis**: Very low. This character has an incredibly strong visual and thematic focal point, and a kit that would likely appeal to a very large swath of the League audience.\n\n**Appearance**: A hulking, axe-wielding warrior with ethereal/corporeal armor plating that seems to be made entirely of magic. The armor dissolves and materializes based on his current health percentage. A battered, fragile-looking figure is encased inside, enfeebled and way past his prime. He is a mage that is clinging to life, slowly dying from old age. Having practiced and perfected his art over decades, he has learned to conjure a magical barrier in the form of armor that protects his physical body from harm. Taking sustained damage breaks Thalius’ concentration, causing parts of his armor to fall and wisp away. Regaining his strength allows him to re-conjure his magical plating.\n\n*Note on Reference Materials: It was quite hard to find a single cohesive image that captured my concept of Thalius. He basically rests in a very large 'mech suit' made of medieval style armor, with hulking pieces of the armor connected by arcs of energy (somewhat like Xerath). The armor itself has a corporeal sheen and \"magical\" appearance to it, which I was unable to find reference images for.*\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/Iron-Monger-in-Iron-Man-movie_zps947fa349.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/SMM28SF0078_zps1632676f.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/lvl33_monster_zps286cd7f7.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/Armor_zps6a7b3eb8.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/Livingarmor5432_zps92e21124.jpg\n\n**Lore**: Thalius was once a famed blacksmith of Noxus, having honed the blades of its finest warriors, including Darius, Draven and Katarina. After a long and successful life, his body began to fail him, and his age began to get the best of him. Discontent with leaving his mortal form behind, Thalius turned to a form of dark magic and began learning a new craft- the dark art of immortality. Combining his mastercraft of metalworking and armoring with arcane magic, Thalius discovered a way to protect his mortal coil by encasing it in a suit of armor conjured and produced by the figments of his own mind.\n\nUnable to find satisfaction in his accomplishments, Thalius became corrupted by his own powers, and now craves immortality and notoriety above all. He joined the League as a testament to his own talents, demanding that Valoran lo and behold his ability to overcome death itself.\n\n**Strengths**: Doesn’t use a resource system in the traditional sense for his abilities, straight forward and intuitive play style, powerful auto attack reset abilities, synergizes strongly with critical strikes, massive health regeneration\n\n**Weaknesses**: Shut down by Grievous Wounds effect, must occasionally work with the moveset that’s given to him, must strike fine balance on when to use certain abilities over others (requires precise resource management)\n\n**Plays Most Like...**: {{champion:266}} {{champion:14}} {{champion:23}} \n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/1_zpsc9ed166d.jpg\n**Auto Attack**: Thalius wields a massive corporeal axe in both hands, attacking enemies in melee range.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11300_btn_zps0b77cd52.jpg\n**Passive- Dark Pact**: Thalius possesses 12% lifesteal.\n**Design Philosophy**: Thalius’ low-cooldown Ultimate synergizes with health percentages, and his Q costs a considerable amount of health to cast. Passive sustain is crucial to Thalius, as he will likely be sitting in the 60-80% health zone most of the game. This is similar to the behavior of Zac, Mundo and Aatrox players.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_8781_pas_zps81b2e315.jpg\n**Q- Unbalanced Strike (6 seconds)**: Thalius swings his axe in a large circle around him, dealing massive physical damage to all surrounding enemies. Thalius swings with such force that using this ability costs him 15% of his maximum health.\nRank-ups increase the damage as well as reduce cooldown.\n**Design Philosophy**: An incredibly simple ability in the vein of Darius’ Q. In addition to dealing damage, its main purpose is to provide Thalius players with a way to artificially lower their health, allowing them access to different abilities from their Ultimate.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_14652_pas_zpse42b4022.jpg\n**W- Grasping Blade (14 seconds)**: Thalius slams his axe into the ground, then swings it upward (like a whip or fishing pole), creating a lined skillshot that sends dark energy coursing through the ground. Any enemies caught in its path are displaced slightly backwards towards the origin of the ability (similar to Thresh’ Flay). In addition, they suffer magic damage and are slowed by 20/25/30/35/40% for 1 second.\nRank-ups increase the ability’s damage and slow amount.\n**Design Philosophy**: As a bruiser with an unreliable gap closer tied to his Ultimate, this ability is designed to provide Thalius with some soft crowd control in order to catch fleeing targets.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_16974_pas_zps92055ddf.jpg\n**E- Arcanic Discipline (11 seconds)**: Passive: Critical strikes lower this ability’s cooldown by .5 seconds, including the critical strike earned from its active component.\nActive: Thalius imbues his battle axe with arcane power, causing his next auto attack to deal bonus physical damage and possess a 20/40/60/80/100% increased chance to critically hit. This ability resets his auto attack swing.\nRank-ups lower the ability’s cooldown.\n**Design Philosophy**: This ability is a simple auto attack reset, tied around critical hits. It promotes the stacking of critical strike chance, which is a desired and intuitive build path for novice players.\n\n**R- Focused Assault (12 seconds)**: Thalius gains a bonus effect on his next auto attack based on his current health percentage. The Ultimate’s icon changes dynamically to reflect the ability’s current functionality. Thalius’ visuals also change to reflect which effect is currently available, based on how much armor he is encased in. The ability that gets locked in is chosen upon cast; not upon the actual auto attack. If Thalius is unable to auto attack after 3 seconds, the effect is lost and Focused Assault goes on a 50% reduced cooldown.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_13374_btn_zpsf9dfb3a5.jpg\n100-70% Terrifying Charge: Thalius’ next auto attack causes him to dash to his target from up to 350/425/500 range, fearing targets that collide with him during the dash. This fear functions similarly to Hecarim’s and lasts for .5/.75/1 second. The target of Terrifying Charge also suffers bonus physical damage alongside the auto attack.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_13540_btn_zps6b62fe52.jpg\n69-30% Arcanic Reinforcement: Thalius’ next auto attack reinforces his arcanic plating, causing him to gain 80/115/150 armor and magic resistance for 4 seconds. This causes his corporeal armor to glow intensely.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_14012_btn_zpsebf57690.jpg\n29-0%- Second Wind: Thalius’ next auto attack heals him for 20/25/30% of his maximum health over two seconds. This ability resets his auto attack swing.\nRank-ups improve the ability in a variety of ways, detailed above.\n**Design Philosophy**: Almost all of the nuance to Thalius’ kit is contained within his Ultimate. Its skill floor is very low, as Focused Assault can be used in almost any circumstance and still be considered helpful. However, this ability is intended to reward incredibly skilled resource management and knowledge of the enemy’s ability to deal damage. For example, there is a lot of counterplay to coincide with Thalius’ charge. Enemy players should do their best to NOT stand between him and his target, lest they be feared. Both parties are capable of out-juking the other, which is both fair and satisfying. If Thalius thinks he will be focused, then Arcanic Reinforcement may help him resist more damage than Second Wind could heal him. However, if Thalius can survive during the short ramp-up time of his heal, then he will put himself in a better position to stay in the fray for another round of brutal killings.\n\nIf you liked this Champion, you can find over 70 more of my original concepts [HERE!](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/uuQxluoH-lutzburgs-champion-concepts-mega-thread?show=flat)","replies":[{"poster":"AyRe CoNteMpT","date":"2015-04-30T19:21:28.192+0000","up_votes":2,"down_votes":0,"body":"i like the general design idea behind this champion tho i think some things are very flawed.\n\n1. his Q should cost CURRENT health, not max health aswell as deal bonus damage based on the health he lost (50% of health lost as bonus damage)\n\n2. his W is SO BORING. basically a longer ranged thresh flay. also, i dont like displacement-effects at all, even tho this is a small one. also, it doesnt interact in any way with the health-theme. how about it sends out three shockwaves fanning out infront of him, costing 1/2/3/4/5% of his current health for every enemy hit but placing a debuff on them that triggers once they take damage from thalius and heal him by 1/2/3/4/5% of his max health upon triggering. \nthis promotes aggressive play, switching targets and more of a frontline-aoe play instead of trying to assassinate people.\n\n3. his E is a joke. no offense but its a complete joke. it gives you 20% CHANCE to deal a crit? so if you dont crit, it did nothing? also, if scales on crit chance, so if you build crit, why would you need to level this ability up to 5?\ni really dont feel this ability should be reworked but rather exchanged with something completely different.\n\nhow about this: thalius slams his axe flat side first on an opponents head, dazzeling them for 1/1.25/1.50/1.75/2 seconds (blinding + slowing by 50%) aswell as TAUNTING all enemies in an area around the target for the duration (area about the size of volibears roar or darius axe, both 425)\nit costs 18% of his current health. for the next two seconds, auto attacks restore 1% of his maximum health.\n(like this, it also allows him to sustain from minions in lane aswell as freezing, which, as a bruiser, is his core task in lane.)\n\n4. now since he is very bruisery-aoe focused (he actually IS a bruiser) aswell as auto attack focused, i actually think his ultimate is very fitting and also very fun. tho, none of those abilities is very strong. either one of them could be a normal ability maybe with the exception of his 29-0 attack, but it just being a weaker mundo ultimate.\n\nso, now how about this:\n\n100-70: this also fears his target. everything else is sweet.\n\n69-30: armor and magic resist are a lot weaker than you think. 150 for 4 seconds is nothing if you compare it to like alistars ultimate. here is my suggestion: it increases his armor and magic resistance by 150 at all levels for 7 seconds. he also emmits an aura that grants allies 23/46/69% of this bonus (aura size same as locket). this aura persists for 7 seconds or until thalius uses R again. also, the target hit by this attack gets his armor and magic resist reduced by 50/100/150, but never below 60% of their current armor and magic resist.\n\n29-0: thalius instantly heals for 30% of his missing health, dealing the same amount as physical damage to his target over 3 seconds, tethering him to the target across 300 range. if the tether holds for the full duration, thalius regenerates another 30% of his missing health over the next 3 seconds.\n\nsince all this is based on missing and current health, its not as high as you would think but still very strong.\n\nthis ability can store up to 3 charges, each charge can be used individualy with a cooldown of 3 seconds but the same effect can only occur once every 8 seconds. if the effect that resembles his current health% is on cooldown, the next higher one will be applied. if he is above 70% hp and the charge effect is on cooldown, he cannot use this ability because there is no higher effect.\n\nthalius stores one charge of focused assault every 20 seconds, storing it 0.5 seconds faster for every enemy damaged by one of his OTHER abilities. every use of this ability costs 10% of his maximum health but never more than 20% of his current health.\n\nthe effect is locked in once he activates the ability, the health is only payed up attacking. if he does not attack within 4 seconds of activating the ability, the ability goes on its 3 second cooldown.\n\nhis ultimate does not, in any way, interact with cooldown reduction.","replies":[{"poster":"Riot Lutzburg","date":"2015-05-01T21:52:11.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUNSTFEHLA,realm=EUW,application-id=A8FQeEA8,discussion-id=et1Ug4W0,comment-id=0006,timestamp=2015-04-30T19:21:28.192+0000)\n>\n> i like the general design idea behind this champion tho i think some things are very flawed.\n> \n\nHi Kunstfehla, \n\nThank you for your detailed, insightful and thorough feedback.  I really like most of your suggestions, generally speaking, and I think if Thalius had different design goals, they would all be seen as improvements to his kit overall.  That said, I feel like your changes go directly against the entire design goal of Thalius.  His sole purpose of existence was to act as an introductory, simple, face-roll style Champion for new players to learn the game with, who simultaneously had a pretty universally enjoyed theme (brute with an axe in cool armor).  Basically I wanted to make a Garen, but with a bit more potential in terms of a skill ceiling (namely the Ult).  Regarding your specific feedback:\n\n1- I chose max health for Q because that guarantees a consistent and predictable dip in health pool in order for the Thalius player to reach the desired Ultimate they want.\n\n2- W is boring, but Thalius was also conceived before Thresh was ever revealed as a Champion.  I'm sorry that you have a personal distaste for displacements but I happen to think displacements are a healthy form of CC in the game and feel much more \"fair\" than long duration stuns from a player's perspective, while retaining similar levels of power.\n\n3- E isn't a joke because it's an auto attack swing RESET.  Having a guaranteed, on command crit is very powerful, and allows the player to deal roughly ~1300 damage in under .2 seconds if they time the reset properly.  Again, new players think crits are cool, and skilled players will master the timing of the auto reset to maximize their burst damage.  That said, in order to give the ability a little more appeal, I added a bonus physical damage component to the auto attack.\n\n4- The various Ultimate activations are intended to be measured and reserved in terms of power because his Ult is on a 12 second cooldown.  All the ideas you proposed here warrant a significantly longer one, and the charge system you propose adds unneeded complexity to a kit designed to be stupid simple.\n\nTo that point, most of your other suggestions do the same thing- add subjectively more fun or dynamic uses, but at the expense of clarity, comprehension and usability for a new player.  His W would become a triple skillshot and punish players for missing any of the three of them.  Your idea for his E adds a taunt effect, precise spacing requirements, a huge upfront health cost investment and the necessity of foresight to ensure that the player can recoop their health losses by having a consistent target to auto attack after triggering the ability.\n\nThese are all cool ideas and they could work on this kit, but they completely undermine the design goals of Thalius.  I commend the effort and thought that went into them and I hope you understand my position, wherein a 'great general kit' and a 'good kit that fits a design goal' are two different things.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-05-02T09:51:47.685+0000","up_votes":1,"down_votes":0,"body":"1. why do people always say garen has a low skill ceiling? hes like one of the hardest champs to play properly in league. strong champions what every \"Noob\" can play and have fun with are zed, yasuo, lucian, kalista, fizz etcpp.\n\nlook, i know you have adapted riots design philosophy as has everyone else when it comes to \"beginner friendlyness\" but actually, in the real reality of our world, people are not idiots. even if it seems like they are when playing soloQ. \n\nevery human being can play league and press buttons. the real problem here is not the mechanical boundary of \"oh shit zeds abilities require me to be like faker\" but rather the mental understanding of WHAT TO DO. this means, champions who FORGIVE MISTAKES easier than others are EASIER TO PICK UP. zed is one perfect example. he forgives endless mistakes and can still get away with it, and even if he is behind, he is still somewhat usefull in that he can fulfill his role and pick off squishies pretty good. garen on the other hand is a super hard to play champion because his abilities forgive zero mistakes. you fuck up, you die. and if you die, you CANT LANE anymore and even if you could, you would never get back into relevance.\n\nso i think the way you designed him makes it really easy to spam buttons but its very hard to actually play him correctly and OWN with him. also, its just not very much fun because of almost no interaction. the way i redesigned him ofcourse its a completely different champion but alot more interaction and alot more fun to play. also, alot more impactfull if played correctly. \n\nlike, the little brother of a friend of mine, he plays league with his friends from school and in that team there are 2 bronzes, 1 silver, 1 gold and 1 platinum player and they are all very much the same skill level. you would probably not believe their ranking is that different with the same skill, but its really no difference. they all enjoy playing zed and yasuo and lee sin and they all have decent mechanics with those champions despite all of them being complete noobs and kids. none of them enjoys playing garen tho because to play garen or darius or master yi or pantheon you need to be really good at the game to constantly play at a solid level and also have fun, because their initial mechanic does not offer any fun. you get the fun from the depth of your brain that tells you you just used a champion to his fullest potential and thus are proud of yourself. the fun doesnt come from flashing screens and jump jump jump \"haha outplayed\". \n\nalso, despite of being \"like\" garen in a way that he has little interaction with his own kit, he still isnt very strong or usefull in general, other than garen who is one of the strongest champs in the game.\n\nwell, im not telling you you should change your champion in a way that i proposed, im just saying, maybe it would help your own creativity and skill in gamedesign to reach even higher levels if you incorporate my experience and different point of view into it ; )\n\ni do like your champions afterall. else i wouldnt take a fruitflies lifespan to write all this^^\n\n\nedit: i just noticed i started the post with a 1. but there never is a 2. haha. i like that","replies":[]}]}]},{"poster":"Bayard","date":"2015-01-11T11:28:30.635+0000","up_votes":2,"down_votes":0,"body":"This is good, but he has 12% life steal and spell vamp level one. I can get passed those number because he doesn't have much aoe. Bu this all changes when he gets hydra! I suppose this balances the health costs on his abilities. After going through it i'm no longer opposed.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-11T11:52:32.192+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=a bearded bard,realm=NA,application-id=A8FQeEA8,discussion-id=et1Ug4W0,comment-id=0003,timestamp=2015-01-11T11:28:30.635+0000)\n>\n> This is good, but he has 12% life steal and spell vamp level one. I can get passed those number because he doesn't have much aoe. Bu this all changes when he gets hydra! I suppose this balances the health costs on his abilities. After going through it i'm no longer opposed.\n\nThank you for going through your thought process on this; I really appreciate it!  I'm glad you see how it all ties together when his whole kit is considered.  12% is, of course, just the number I landed on based on champions like Nasus.  Whether that's too much or too little (or whether the health cost of his Q needs  to change) could only really be seen in the testing and iteration phase of his implementation.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-04-10T00:37:35.890+0000","up_votes":1,"down_votes":0,"body":"I have created many champions from my mold.  I wonder if that's how Thalius feels.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-03-23T23:59:29.358+0000","up_votes":1,"down_votes":0,"body":"Just for bookkeeping purposes, I went ahead and adjusted some of Thalius' numbers; especially around his Ultimate.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-06T21:47:27.492+0000","up_votes":1,"down_votes":0,"body":"I've always thought that perhaps people wouldn't be that excited by Thalius, since his kit is so simple and his biggest selling point are his visuals (which I cannot do justice for via reference images alone).","replies":[]},{"poster":"GreenLore","date":"2015-01-02T11:18:44.561+0000","up_votes":1,"down_votes":0,"body":"I have to say that he looks interesting,the ult changing with his health is a cool idea and since his kit causes him to loose a lot of health,but also to regain a lot of health it fits with him.\n\nalthough I wonder,how does his first ult start?Do you activate it and then you dash to your target,or do you activate it,then need to autoattack and then dash to your target?\n\nHowever one thing i kinda dislike about him is that,while the character is a blacksmith,that is hardly represented in his kit.\nThe only ability based on him being a blacksmith is his 2nd ult,which increases his armor and mr.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-02T11:39:09.790+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=A8FQeEA8,discussion-id=et1Ug4W0,comment-id=0001,timestamp=2015-01-02T11:18:44.561+0000)\n>\n> I have to say that he looks interesting,the ult changing with his health is a cool idea and since his kit causes him to loose a lot of health,but also to regain a lot of health it fits with him.\n> \n> although I wonder,how does his first ult start?Do you activate it and then you dash to your target,or do you activate it,then need to autoattack and then dash to your target?\n> \n> However one thing i kinda dislike about him is that,while the character is a blacksmith,that is hardly represented in his kit.\n> The only ability based on him being a blacksmith is his 2nd ult,which increases his armor and mr.\n\nHi GreenLore, thanks for the feedback and good questions.\n\nHis ult doesn't happen in three stages, as I believe you're thinking.  Instead it is completely contextual based on his health at the time that he casts it.  If he ults while at 7% health, then he'll get Second Wind.  If he's above 70%, then it's the Charge, etc.  They don't need to happen in order and in many cases they would probably happen in the order of 1/3/2- dash in, almost die, regen and then endure.\n\nYou do make a very good point about his profession not being represented very well in his kit.  My only argument against that is that his entire existence inside that suit is a testament to his mastery over his craft.  I imagine that would be driven home in iconic visuals and perhaps even his dialogue.","replies":[]}]},{"poster":"AChanceOfReign","date":"2015-01-02T09:39:04.555+0000","up_votes":1,"down_votes":0,"body":"Dude how the hell do you put the pictures up like that :O\nMy looks really noobish :T","replies":[{"poster":"Riot Lutzburg","date":"2015-01-02T09:56:41.352+0000","up_votes":1,"down_votes":0,"body":"Check out the second or third post of my Mega Thread link for descriptions and links for my icons.  As for how I do it, I upload images to Photobuket and then use the \"direct link\" URL and paste it into my threads wherever I want the image to appear.  :)","replies":[{"poster":"AChanceOfReign","date":"2015-01-02T10:01:02.549+0000","up_votes":1,"down_votes":0,"body":"You are a life saver :O","replies":[{"poster":"Riot Lutzburg","date":"2015-01-02T10:02:39.482+0000","up_votes":1,"down_votes":0,"body":"Ooooh stop it. >_","replies":[{"poster":"AChanceOfReign","date":"2015-01-02T10:03:10.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=et1Ug4W0,comment-id=0000000000000000,timestamp=2015-01-02T10:02:39.482+0000)\n>\n> Ooooh stop it. >_\n\nlol","replies":[]}]}]}]}]}]}