{"poster":"Riot Lutzburg","date":"2015-01-02T13:25:05.834+0000","title":"A.I.S.E., the Steam Soldier","subforum":"Concepts & Creations","up_votes":23,"down_votes":2,"body":"**Role**: Marksman\n\n**Inspiration**: I wanted to create an ADC with a new type of resource that involved auto attacking to generate that resource.\n\n**General Design Philosophy**: A.I.S.E. is a unique take on an ADC that uses a unique resource called Steam, which he generates by auto attacking.  As a reward for aggressive play and repeated auto attacks, A.I.S.E. can then spend that resource to activate powerful abilities designed to keep him safe.  As you'd expect, A.I.S.E.'s combat pattern should look like one of a well-oiled machine, systematically generating and then expending steam as a resource, in an infinite loop until everyone around him is dead and he and his robotic brethren take over the world.\n\n**Risk Analysis**: Moderate.  A.I.S.E uses an all-new resource system which is both untested and unknown to current League players.  That said, his kit is rather tame outside of the unique way in which he manages his resources, and everyone loves robots!\n\n**Appearance**: A steampunk robot soldier with a rifle mounted to one arm.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/4e08e2b18a08f9d3732b1840b8509732_zpsfdca2f98.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/5d65643a2c0aba4b2030f2eda11a8bba_zps7bef2580.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/70e593a414849de9fd0d1d91828c0870_zps93a1f785.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/640x6714187Warmachine2dscifiwarriorsteampunkrobotpictureimagedigitalart_zpsefac8713.jpg\n\n**Lore**: A steam-powered automaton that serves as a prototype soldier. Created by a rival of Viktor’s.  His name stands for “Automated, Infinitely Sustainable Engine,” and is pronounced as “Ace.”\n\n**Strengths**: Powerful nuke Ultimate, not reliant on mana to use abilities and be effective, powerful critical strike incentives, strong survivability and escape tools\n\n**Weaknesses**: Resource cap prevents spamming of abilities, Ultimate’s damage is tied to resource system, dependent on critical strikes (RNG)\n\n**Plays Most Like...**: {{champion:6}} \n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_10896_pas_zps3c7f7e32.jpg\n**Auto Attack**: A.I.S.E. fires a long range shot from his steam rifle at 550 range. This generates 1 steam. Critical Hits generate 2 steam.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_3972_btn_zpsebec57e0.jpg\n**Passive- Steam-Powered Automaton**: A.I.S.E. uses steam as a resource, which generates slowly over time (1/sec). In addition, A.I.S.E. gains 1 steam with every auto attack. This effect is doubled when landing an auto attack on an enemy champion.  These are effects are also doubled when landing a critical hit. A.I.S.E.'s steam reserves are capped at 100.  A.I.S.E. respawns with full steam.\n**Design Philosophy**: A.I.S.E.’s entire kit revolves around the acquisition and expenditure of steam.  Tying the generation of steam to auto attacks promotes aggressive play in lane and disincentivizes stagnant laning.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_5931_btn_zps1dec9089.jpg \n**Q- Concussion Blast (1.5 seconds, 10 steam)**: A.I.S.E. launches a concussion grenade at cursor location up to 700 range (similar to Lay Waste) that deals minor physical damage (+30% AD) in a small area and shreds target's armor by 3/4.5/6/8/10 for three seconds. This debuff stacks. Successive hits with this ability refreshes the duration of the debuff, but the ability's steam cost increases by 5 with each use. (This allows the shred to stack roughly up to 5 times in most circumstances.)\nRank-ups increase damage and armor shred.\n**Design Philosophy**: This ability allows Ace to shred a target’s armor with consecutive landing of skillshots, as well as safely last hit from a distance.  It’s great at poking but does not deal enough damage to make it a priority during an active battle.  Typically Ace players will use this to shred a target’s armor enough to make a trade or all-in worth the investment.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_15536_pas_zps85e0db0c.jpg\n**W- Arc Conductor (14 seconds, 25 steam)**:  Passive: When this ability is available, A.I.S.E. will generate double steam on every third auto attack, including doubling the bonus steam earned for critical hits.\nActive: For the next 4 seconds, A.I.S.E. gains an electricity shield that blocks incoming damage (+50% AP). While the shield holds, attacks made against the shield cause it to pulse energy around A.I.S.E. in a small aura. Enemies caught in the pulse suffer minor magic damage (+20% AP) and become slowed by 80% for .5 seconds.\nRank-ups increase damage and shield amount, as well as lower cooldown.\n**Design Philosophy**: The passive component benefits players who are in a position of control or at the very least comfort in their lane, allowing a faster way to regenerate steam.  It also allows Ace to more easily scale into the late game.  The active component is one of Ace’s ‘escape’ and survivability tools, which prevents melee champions from diving onto him.  Attacking players can simply choose to ignore Ace while the shield is active and then proceed to wail on him.  However, even if that does happen, Ace still manages to avoid taking damage for an extended period of time.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_8926_pas_zpsc2569392.jpg\n**E- Steam Jet (12 seconds, 20 steam)**: A.I.S.E. fires a powerful jet of steam in a line, dealing magic damage and knocking all enemies in its path back. Enemies closer to A.I.S.E. are knocked back further.\nRank-ups increase damage done and lower cooldown.\n**Design Philosophy**: Steam Jet is a thematically relevant trope and mechanically acts as Ace’s primary disengage tool.  While he himself is rather slow and dawdling, his kit is designed to keep fighters and divers off of him so that he can continue to peck away at foes from a distance.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_7176_pas_zpsf981d42a.jpg\n**R- The Screaming Piston (70 seconds, all remaining steam)**: Passive: A.I.S.E. gains 1% attack speed for every 1 steam he is missing.\nActive: A.I.S.E. fires a super pressurized shot from his rifle at a target champion from up to 700 range, emptying all remaining steam from his reserves in the process. This deals 175/225/300 (+80% AD) (+100/250/400% total of current steam) physical damage.\nRank-ups increase damage done and steam multiplier value, as well as lower cooldown.\n**Design Philosophy**: The passive component of this ability acts as a safeguard against Ace players resource-starving themselves while simultaneously acting as an in-combat steroid to allow Ace to hyper carry late-game.  The active component drains all of Ace’s steam, dealing damage based on the amount used, which creates a very interesting player choice- should I harass and stay safe with my abilities or am I confident that I can all-in someone and escape afterwards?  The active component then, of course, fuels directly back into the passive component, helping the player to regenerate steam at an increased rate.\n\nIf you liked this Champion, you can find over 70 more of my original concepts [HERE!](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/uuQxluoH-lutzburgs-champion-concepts-mega-thread)","replies":[{"poster":"Riot Lutzburg","date":"2015-01-15T22:28:25.104+0000","up_votes":2,"down_votes":0,"body":"Ace's resource balancing has been reworked, thanks to all of your awesome suggestions!\n\n-Ace's steam cap has been increased to 100 from 50\n-Ace's passive steam regeneration has been normalized to 1/sec from 3/5 sec\n-Ace's abilities have all had their costs increase to account for the increased cap\n-Ace's Ultimate has had its damage scaling normalized to account for the increased cap\n-Ace now earns 2 steam for auto attacking enemy champions\n-Ace's \"double steam on critical hit\" Passive now also doubles steam gained from attacking enemy champions (meaning 4 steam for a crit against an enemy champion)","replies":[]},{"poster":"Lysdexic1","date":"2015-01-02T22:54:11.611+0000","up_votes":2,"down_votes":1,"body":"The one concern i have is the passive critical chance increase.  Yasuo's passive crit chance increase (while much higher) has made him a pariah of the game.  I do NOT want to see a long range version of Yasuo in this game *shudders*. Instead is it possible to make every second or third hit deal extra damage and generate one extra steam? It keeps the steam regenration, keeps him more centrally focused as a lane bully, and with scaling on the damage would still keep him relevant late game, like maybe 6% of his current AD is turned into true damage.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-04T23:15:18.072+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lysdexic1,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=0004,timestamp=2015-01-02T22:54:11.611+0000)\n>\n> The one concern i have is the passive critical chance increase.  Yasuo's passive crit chance increase (while much higher) has made him a pariah of the game.  I do NOT want to see a long range version of Yasuo in this game *shudders*. Instead is it possible to make every second or third hit deal extra damage and generate one extra steam? It keeps the steam regenration, keeps him more centrally focused as a lane bully, and with scaling on the damage would still keep him relevant late game, like maybe 6% of his current AD is turned into true damage.\n\nI hate RNG more than most people on this planet, so I welcome this suggestion with open arms!  Thank you!","replies":[]}]},{"poster":"ArbiterOfTruth","date":"2015-01-02T16:32:24.931+0000","up_votes":2,"down_votes":1,"body":"Good concept and mechanically sounds very similar to Urgot, maybe a little too much with the q and w (just my opinion). I have a problem with his ult; the passive punishes you for doing what a marksman is supposed to do, autoattacking, and conceptually doesn't make sense, if a steam engine is generating a large amount of steam then it is working very well. What was your thought process with the passive?","replies":[{"poster":"Riot Lutzburg","date":"2015-01-02T21:57:22.272+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ArbiterOfTruth,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=0002,timestamp=2015-01-02T16:32:24.931+0000)\n>\n> Good concept and mechanically sounds very similar to Urgot, maybe a little too much with the q and w (just my opinion). I have a problem with his ult; the passive punishes you for doing what a marksman is supposed to do, autoattacking, and conceptually doesn't make sense, if a steam engine is generating a large amount of steam then it is working very well. What was your thought process with the passive?\n\nYes, I must admit that his Q and W are pretty similar.  I think making an AD Karthus style cast mechanic differentiates it decently, and a lot of champions have shields and none of them have a paralyzing thornmail-like effect, so I would defend the abilities by saying they aren't overly similar to everyone's favorite four-legged crab monster.\n\nFor his Ultimate, I can kind of see where you're coming from but in practice I think it will have the opposite effect of what I think you're saying.  Good Ace players will use their spell rotation effectively in between auto attacks (especially Q's), which should mean that optimally they'll be sitting at a low amount of steam at all times.  The passive helps them auto attack more (what ADCs do, to your point) during the course of their natural play pattern, which includes the liberal use of their basic abilities.  Finally, the passive works as a rebound mechanic after Ace uses his Ultimate, which will always use the player's full amount of current steam reserves.\n\nUsing your argument as a foundation, I could argue that Olaf's passive (increased attack speed for every % health he's missing) punishes him for staying alive and being healthy, or that Maw {{item:3156}} punishes players in the same way.  I think abilities and items that grow in power based on contextual circumstances are a healthy part of the game.","replies":[]}]},{"poster":"Hildebrand","date":"2016-05-05T20:18:06.015+0000","up_votes":1,"down_votes":0,"body":"I'm always worried about ADC's without mana constraints, but this is pretty good.","replies":[{"poster":"Riot Lutzburg","date":"2016-05-06T00:29:48.823+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hildebrand,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=0018,timestamp=2016-05-05T20:18:06.015+0000)\n>\n> I&#x27;m always worried about ADC&#x27;s without mana constraints, but this is pretty good.\n\nYep, it's a very big deal and shouldn't be underestimated as a challenging mechanic to balance around.  I know a lot of people ask for it and many have tried to pitch concepts for it on these boards.  I'm not saying mine is perfect, but I certainly tried to give a mana-less ADC the respect and steady hand it deserves.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2016-05-05T19:35:03.764+0000","up_votes":1,"down_votes":0,"body":"One of my best friends helped me come up with the name for AISE.  He said this is his favorite concept of mine, but I can't help but feel like he only says that because of the name.  :p","replies":[]},{"poster":"Riot Lutzburg","date":"2015-07-14T18:26:12.715+0000","up_votes":1,"down_votes":0,"body":"I'm bringing some of my most-upvoted concepts back to the front page today, to see if a new audience still finds them compelling after so much time has passed.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-04-13T17:49:31.604+0000","up_votes":1,"down_votes":0,"body":"If there's one thing I have learned about the League community, it's that they love \"gunslingers\" and anything relating to conventional gun weapons.  Ace is proof of that.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-04-09T00:31:04.918+0000","up_votes":1,"down_votes":0,"body":"I want to let off some steam while I'm here today.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-03-31T00:22:00.446+0000","up_votes":1,"down_votes":0,"body":"I've always got an Ace up my sleeve!","replies":[]},{"poster":"Ciller","date":"2015-03-17T19:01:59.346+0000","up_votes":1,"down_votes":0,"body":"Ace looks like an insane champion. Seems like he would be very difficult to manage the resources, but I would absolutely love to play him. RITO INCLUDE NOW","replies":[{"poster":"Riot Lutzburg","date":"2015-03-17T19:33:34.456+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cilllller,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=0012,timestamp=2015-03-17T19:01:59.346+0000)\n>\n> Ace looks like an insane champion. Seems like he would be very difficult to manage the resources, but I would absolutely love to play him. RITO INCLUDE NOW\n\nYup, his actual kit is pretty simple so that the player can focus on managing his steam resource effectively.  The payoff for firing a fully powered Screaming Piston makes it #Worth.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-03-10T03:54:30.010+0000","up_votes":1,"down_votes":0,"body":"Let's steam up the front page!","replies":[]},{"poster":"Centuros","date":"2015-01-15T22:38:59.844+0000","up_votes":1,"down_votes":0,"body":"Created by Jayce, using similar technology to Blitzcrank, in an attempt to see if the resulting intelligence could be replicated, perhaps?","replies":[{"poster":"Riot Lutzburg","date":"2015-01-16T01:02:06.719+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Centuros,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=0010,timestamp=2015-01-15T22:38:59.844+0000)\n>\n> Created by Jayce, using similar technology to Blitzcrank, in an attempt to see if the resulting intelligence could be replicated, perhaps?\n\nHell yeah, I'm down for that!","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-01-10T01:56:36.516+0000","up_votes":1,"down_votes":0,"body":"I'm hoping to use everyone's feedback to rework Ace's resource balance... stay tuned!","replies":[]},{"poster":"FlameHalbrdOkido","date":"2015-01-07T04:01:54.360+0000","up_votes":1,"down_votes":0,"body":"both seem good","replies":[{"poster":"Riot Lutzburg","date":"2015-01-07T10:36:37.117+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=000d,timestamp=2015-01-07T04:01:54.360+0000)\n>\n> both seem good\n\nHoorah!","replies":[]}]},{"poster":"FlameHalbrdOkido","date":"2015-01-07T02:50:42.886+0000","up_votes":1,"down_votes":0,"body":"Do you think that AI.S.E. should still get 1 steam per successfull AA landed on a champion, while getting like 1/2 per minion, is that possible? Also i get that you would prefer having the damage on the ult tied to steam, and not range.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-07T03:01:07.448+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=000c,timestamp=2015-01-07T02:50:42.886+0000)\n>\n> Do you think that AI.S.E. should still get 1 steam per successfull AA landed on a champion, while getting like 1/2 per minion, is that possible? Also i get that you would prefer having the damage on the ult tied to steam, and not range.\n\nThe best way to solve that, as others have suggested, is to blow out the relative scale of the resource system.  So instead of 50 steam, Ace can use 100 and then gain 2 steam for AA's against champions and 1 for everything else.  This would also make it easier to balance his passive regen.\n\nAlso, to answer an earlier question, Ace would spawn with full Steam the way that other champions would spawn with full mana.  That wouldn't matter much anyway, however, since he also passively generates a bit of steam at all times.","replies":[]}]},{"poster":"FlameHalbrdOkido","date":"2015-01-07T02:08:09.241+0000","up_votes":1,"down_votes":0,"body":"I really enjoyed reading this concept. Your right who doesnt enjoy a good robot concept! A few questions though: Does it matter if A.I.S.E has AA'd a minion, or a champion, to gain 1 steam? Does A.I.S.E. start off the game with some Steam, or is at zero at the beginning to promote AA'ing. Is the capped range on Screaming Piston, where if he has max steam it goes the full distance, and if he has less steam the projectile would travel less distance? \nW is awesome i really like the potential strategies that stem from its utility, melee fighters better beware A.I.S.E.. I really like him, riot could use some more marksman/woman champions who have a unique way to deal damage from afar, and A.I.S.E. fits that bill. I too have seen Riot's cast of marksmen/women needing some freshness, (did a good job with Kalista) and am in the process of developing some concepts that don't use bows, crossbows, or generic guns of any kind.","replies":[{"poster":"Riot Lutzburg","date":"2015-01-07T02:37:45.693+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=hu0i0QO7,comment-id=000b,timestamp=2015-01-07T02:08:09.241+0000)\n>\n> I really enjoyed reading this concept. Your right who doesnt enjoy a good robot concept! A few questions though: Does it matter if A.I.S.E has AA'd a minion, or a champion, to gain 1 steam? Does A.I.S.E. start off the game with some Steam, or is at zero at the beginning to promote AA'ing. Is the capped range on Screaming Piston, where if he has max steam it goes the full distance, and if he has less steam the projectile would travel less distance? \n> W is awesome i really like the potential strategies that stem from its utility, melee fighters better beware A.I.S.E.. I really like him, riot could use some more marksman/woman champions who have a unique way to deal damage from afar, and A.I.S.E. fits that bill. I too have seen Riot's cast of marksmen/women needing some freshness, (did a good job with Kalista) and am in the process of developing some concepts that don't use bows, crossbows, or generic guns of any kind.\n\nGreat questions and ideas, and all part of the resource rework I'll be doing on Ace in the next couple of nights.  I think there have been a lot of great suggestions about how to make his resource system more balanced and usable, including your idea of generating more steam for AA's on champions.\n\nI also like the dynamic ult range idea but kind of struggle with justifying the dynamic effectiveness as a result, since it's already so strongly tied to how much steam Ace has when he uses it.","replies":[]}]},{"poster":"Revvy","date":"2015-01-05T01:13:50.105+0000","up_votes":1,"down_votes":0,"body":"A.I.S.E. is the one and only champion concept. Best name. Best character.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-04T23:16:29.496+0000","up_votes":1,"down_votes":0,"body":"To everyone discussing steam costs and regeneration rates, I am totally open to these suggestions.  I wasn't too worried about nailing it for this concept phase but you guys are making some good points about the effectiveness of doubling the cap to 100 and increasing the costs/gains.  I'll see what I can do with the numbers soon.","replies":[]},{"poster":"Zyorhist","date":"2015-01-03T18:33:02.765+0000","up_votes":1,"down_votes":0,"body":"honestly I would increase the steam costs and double the size of his pool.  I would also double how much he gets off of AA's and crits.  That way you actually notice how much you are gaining from aa's and not just getting all of your steam for free.","replies":[]},{"poster":"MidEvilKnight3k","date":"2015-01-03T15:16:05.739+0000","up_votes":1,"down_votes":0,"body":"It's a good thing you have the passive steroid on W that goes away when activated, even still I feel that that ability could become too oppressive if used offensively.  Just after a few q harrass, activate W then R and (if needed to close distance) flash onto your opponent and stay near them as you aa them.  Their support is going to have a difficult time peeling if you are just standing on the enemy carry while you are auto attacking them.  Anything they do is just going to damage and slow their own carry.","replies":[]},{"poster":"ceejtank","date":"2015-01-03T03:08:41.923+0000","up_votes":1,"down_votes":0,"body":"If you generate Steam automatically (3 every 5 seconds) you'll always come to lane full of Steam, and with only 5, 10, and 15 Steam costs on abilities, it sounds like you can really easily spam without running OoS in your laning phase.","replies":[]},{"poster":"chuckduck1","date":"2015-01-02T22:03:11.269+0000","up_votes":1,"down_votes":0,"body":"I like him, however as said previously in the post. He is designed to be rewarded for playing aggressively, but his tool kit makes him safe. I can just imagine that he starts shooting everyone in lane, but when they finally try to turn on him his shield just negates the damage and redirects it to whichever enemy is next to him. If a jungler were to gank, and the shield is active while they are attacking him, the jungler could potentially just be killed as if he were fighting a thornmail but with bonus damage from the adc and support.\n\nI like the concept though of the steam resource. It really seems unique. The ult passive reminds me of the passive for Aatrox, just flipped. Instead of gaining attack speed as the bar fills up, this guy slows down which I really like. It's good overall, just worried about the shield potential.","replies":[]},{"poster":"gameipedia","date":"2015-01-02T16:23:01.152+0000","up_votes":1,"down_votes":0,"body":"sadly I could not play him supp unless i went for full on harass, and he lacks cc but I would love to play with this champ, seems fun :D","replies":[]},{"poster":"Gorganmite","date":"2015-01-02T16:10:31.784+0000","up_votes":1,"down_votes":0,"body":"I do like this idea concept. Reminds me a little of Urgot and Rumble to be more specific. \nI would also think that the cap steam can be increased at intervals of 6, 11, 16.\nI had a few other comments but can't remember them. Will edit it when I do but overall not a bad idea concept.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-01-05T04:34:29.602+0000","up_votes":1,"down_votes":1,"body":"Haha I'm glad you like him, Revvy.","replies":[]}]}