{"poster":"Sennin Hagomoro","date":"2015-04-22T14:56:42.574+0000","title":"Kollege und ich suchen Spieler für Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Mein Kollege und ich suchen Spieler f&uuml;r ein Ranked Team.\nWir sind beide 18 Jahre alt.\nIch, IG DonBendra, spiele League of Legends seid Season 3. Dort war ich Silver 5. Season 4 arbeitete ich mich Gold 5 hoch. Und diese Season bin ich gerade Gold 5. Ich bevorzuge die Top Lane.\nMein Kollege, Eplotrix, ist im moment Platin 5 und ist Main ADC.\nWir haben uns gedacht, dass wir ein Ranked Team auftstellen, da es mehr Spa&szlig; macht. Und suchen Supp. Jungle und Mid.\nDie Vorraussetzungen sind:\n- mind. Gold 5\n- 18 Jahre alt\n- kritikf&auml;hig\n- TS3 oder Skype vorhanden\n- funktionierendes Headset \n- Zeit f&uuml;r Trainigsspiele\n- ausreichende Zeit für Rankedspiele\nWenn ihr dann Bock habt mit uns ein Team aufmachen, dann addet mich oder meinen Freund ingame.","replies":[{"poster":"Sennin Hagomoro","date":"2015-04-22T16:58:31.917+0000","up_votes":1,"down_votes":0,"body":"Wir suchen noch einen Jungler!!\n/push","replies":[]},{"poster":"Sir Virgo","date":"2015-04-22T16:13:13.798+0000","up_votes":1,"down_votes":0,"body":"Hört sich eigentlich super an :-)","replies":[]},{"poster":"Sennin Hagomoro","date":"2015-04-22T16:02:24.133+0000","up_votes":1,"down_votes":0,"body":"Also heute hab ich keine Zeit. Morgen könnten mein Kollege und ich vorbeischauen.","replies":[]},{"poster":"NVG Scythe","date":"2015-04-22T15:57:03.401+0000","up_votes":1,"down_votes":0,"body":"Schau doch einfach auf unserem Teamspeak Server vorbei! 216.127.64.77:4164\nWir sind ein Clan mit mehr als 20 Membern und haben 5 Squads. Wir spielen oft 5v5 Intern und ein Squad guckt zu, danach besprechen wir unsere Fehler usw...\nNatürlich werden auch Ranked Games gespielt.\n90% von uns sind 18+ und der Rest ist mind. 16\nIn unseren Clan wird man in der Regel ab Silber2 aufgenommen aber die meisten sind Gold3+ Und haben auch ein Paar Dia Spieler die uns ein bisschen Coachen.\nUns würde es sehr freuen wenn ihr vorbeikommt! Wir sind ein Aktiver Sozialer Clan also keinen großen Flame an Mitspielern (Kritik ist aber erwünscht) Denn wir profitieren davon uns gegenseitig zu helfen!\nWenn ihr an halbwegs menschlichen Zeiten kommt ist immer einer da der euch zuweisen kann, aber am besten wäre es heute um ca. 19:15 oder 19:30\nDanke und Viel Spaß!","replies":[]}]}