{"poster":"El Impostor","date":"2017-09-09T21:32:38.649+0000","title":"[JUEGO] Reworkea un campeón de una forma que fastidie a sus mains","subforum":"Memes & juegos","up_votes":6,"down_votes":1,"body":"Este post lo vi en reddit hace un tiempo, la idea es reowrkear algun campeon, explicando su nueva pasiva y habilidades, cosa que el kit mismo moleste a sus mains (Ejemplo: Volviendo a Zed un support funcional pero sin la capacidad de matar que tiene actualmente).","replies":[{"poster":"Liliths","date":"2017-09-09T21:38:49.745+0000","up_votes":10,"down_votes":0,"body":"{{champion:157}} :\nPasiva: No tiene piernas, ahora requiere la Ayuda de un campeno aliado para moverse.\n\nE: Pasiva; No puede utilizar el gesto de Maestria.","replies":[{"poster":"MILFortune","date":"2017-09-09T23:31:55.485+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Liliths,realm=LAS,application-id=E47gYOsn,discussion-id=fZEsmFfn,comment-id=0000,timestamp=2017-09-09T21:38:49.745+0000)\n>\n> {{champion:157}} :\n> Pasiva: No tiene piernas, ahora requiere la Ayuda de un campeno aliado para moverse.\n> \n> E: Pasiva; No puede utilizar el gesto de Maestria.\n\nVine con la misma idea de la E: que no pueda usar la maestría jajaa GG WP +10 invocador","replies":[]},{"poster":"El Impostor","date":"2017-09-09T21:50:06.852+0000","up_votes":1,"down_votes":0,"body":"\"Se debe montar sobre un aliado, si usa su Q hacia el frente, dañará a su compañero\"","replies":[]}]},{"poster":"Ahristócrata","date":"2017-09-09T21:47:42.891+0000","up_votes":3,"down_votes":0,"body":"Intercambio el muro de viento de Yasuo por su escudo, le quitó el doble crítico por otra cosa. El flujo quedaría como está acumulándose un poco más rápido que ahora.\n\nPasiva: Yasuo saca cada 25-17s según el nivel un muro de viento delante de él.\n\nW:\n\nPasiva: Yasuo aumenta su probabilidad de crítico de acuerdo a la cantidad de flujo que tenga, llegando hasta duplicarlo con el flujo al máximo.\n\nActiva: Yasuo consigue un escudo consumiendo todo su flujo (cds a considerar) .El poder del escudo escala con el crítico adicional (de los items) y velocidad de ataque adicional.\n\nYasuo pierde control del uso de su muro de viento, el doble crítico es situacional, y si quiere mejor supervivencia necesita comprarse ítems de crítico y atk speed de manera tal que si se arma tanque no le será tan funcional. Si usa el escudo mientras lucha pierde el multiplicador de crítico.\n\nNo sé, se me ocurrió recién y no es que tenga algo contra Yasuo.","replies":[]},{"poster":"Diosmo","date":"2017-09-09T23:14:13.985+0000","up_votes":4,"down_votes":1,"body":"{{champion:157}} \n\nPasiva: No puede utilizar el gesto de Maestria. (Creditos Liliths) [Eliminado] Escudo.\n\nQ: Igual.\n\nW: El escudo mitiga el daño un 50%, ya no para la ulti de Lux + bomba de Kim Jong-un.\n\nE: Se desliza a traves de los enemigos con paso de ballet lo que provoca que los enemigos huyan (como la E de WW) pero le baja la velocidad de ataque en 25/50%. Enfriamiento: 10 segundos.\n\nR: Igual como esta pero activa el gesto de Maestria al conectar la ulti. [Eliminado] Todo control de masas de los aliados no pueden activar la definitiva de Yasuo, solo con su remolino.\n\n\nAgregado: Uso de mana.","replies":[]},{"poster":"Cambur Delbarrio","date":"2017-09-10T02:31:14.252+0000","up_votes":2,"down_votes":0,"body":"{{champion:19}} \n\nwarwick se volvio vegetariano y le asquea la carne, deja de recuperar vida con su Q y R\n\nla W a enemigos tipo planta / no vivos\n\nquadriplica la velocidad de movimiento al tener menos del 30% de vida solo si va camino a su nexo","replies":[]},{"poster":"TaliyahTrump SSG","date":"2017-09-14T05:42:47.830+0000","up_votes":1,"down_votes":0,"body":"{{champion:64}} \n\nP: Solo puede espamear maestria mientras su Q esta sobre un objetivo. (Es decir que elija entre tirarse o sacar la chapita)\nQ: Ya no pega por vida faltante, escala con Ap, solo dura 0.5s sobre el objetivo.\nW: Ya no puede saltar, solo se escuda a si mismo.\nE: Igual\nR: Es una skill-shot mas fina que la lanza de nidalee, tiene la mitad de escalado pero para compensar se le duplica el enfriamiento, no se puede tirar hasta 5s despues de usar una habilidad de movilidad, empuja solo la mitad y ya no levanta a todos los demas objetivos alcanzados.\n\nRiot Scarizard: Con estos cambios esperamos que los main lee sin de verdad demuestren que son maestros del teclado al jugar y no que solo elijieron el campeon mas \"dificil\" del juego y ya por usarlo se crean pros :V","replies":[]},{"poster":"faster51","date":"2017-09-10T16:24:00.485+0000","up_votes":1,"down_votes":0,"body":"¿por dónde comienzo?\n\n***\n\n{{champion:412}} :\nQ: solo atrae al campeón, no lo stunea\nW: solo da un escudo y más vel. de movimiento, no puedes ir hasta 3sh \nE: solo ralentiza \n\n***\n\n{{champion:5}} :\nQ: es cada 5 básicos\nW: no otorga vel. de ataque\n\n***\n\n{{champion:21}} :\nQ: su rebote metela mitad del primer impacto\nR: no mete más de mitad de vida a los enemigos\n\n***\n\n{{champion:89}} :\nQ: solo ralentiza \n\n***\n\n{{champion:67}} :\nQ: al utilizar esta habilidad su vel. de ataque se reduce un 50% para su siguiente básico\nW: requiere de 5 básicos para activarla\nE: no stunea \nR: su Q tiene menos tiempo de invisibilidad \n\n***\n\n{{champion:11}} :\nQ: ya no lo hace invencible durante el efecto\nW:ya no reduce el daño infligido ni pausa su E ni R\nE: su siguiente ataque será un mini crítico, nada más que eso\nR:menos velocidades\n\n***\n\n{{champion:119}} :\nQ: solo tiene un uso y no se puede atrapar para lanzarla de nuevo \nW: solo dá vel. de movimiento\n\n***\n\n{{champion:53}} :\nQ: enfriamiento: 15 sec:\nahora es una skill shoot mucho más difícil de usar \nno se puede usar bajo torre\n\n***\n\n{{champion:86}} :\nmientras más vida, menos daño \n\n***\n\n{{champion:497}} :\nque ya no tenga cara de pervertido en su splash art\n\n***\n\n{{champion:99}} :\ntiene que asestar todo su combo para provocar daño (w incluida)","replies":[]},{"poster":"Send Núdes","date":"2017-09-10T01:39:52.417+0000","up_votes":1,"down_votes":0,"body":"Tenias que poner una regla para que no usen a yasuo :v","replies":[]},{"poster":"Trucy Wright","date":"2017-09-09T22:13:53.170+0000","up_votes":2,"down_votes":2,"body":"{{champion:1}} \n\nPasiva: Cada 15 minutos su proxima habilidad inmovilizará a su objetivo, pero cada habilidad tiene efectos distintos.\n\nQ: Annie pierde la mitad de su vida\nW: Annie regenera el maná/vida de su enemigo (si no usa maná regenera vida, si tiene toda la vida no sufre damage)\nE: Annie se ralentiza durante 5 segundos\nR: El jugador de Annie se va AFK por 1 minuto debido a siquiera usar al campeón","replies":[{"poster":"faster51","date":"2017-09-10T00:53:59.752+0000","up_votes":1,"down_votes":0,"body":"por mi esta perfecto u.u","replies":[]}]}]}