{"poster":"YeImLucho","date":"2016-09-13T21:24:25.991+0000","title":"Problemas Placa de video y Directx (AYUDA)","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hace poco hice una discucion acerca de mi problema con el LoL, hace 3 semanas ya que no puedo jugar, mi problema fue lo siguiente:\r\nDebido a que a este NOTEBOOK que uso la uso mas para la universidad que para jugar la pase a Window7 Profesional 32 bit (tenia Window10 original de fabrica) y al supuesto tecnico que la cambio me dijo que tubo que cambiar varias cosas para que sean compatibles como por ejemplo lo que es la \r\nplaca de video y drivers de los puertos usb, etc\r\nTengo la placa de video  VGA estandar actualizado aca, y me esta saliendo ese error en el juego\r\n\r\nSOLUCIONES QUE YA HISE:\r\n1) Repare el cliente\r\n2) instale 3 tipos de directx diferentes \r\n3) elimine el block &quot;game&quot; y uno mas que no me acuerdo como se llama de la carpeta &quot;config&quot;\r\n4) actualize la placa de video y me sigue saliendo el mismo problema, y cuando quiero descargar otro driver de placa de video me salta con que no es compatible con mi notebook\r\n\r\nTengo una Intel Celeron  N3050 2 nucleos 32 bit \r\n\r\nDesde ya muchas gracias por leer y mas gracias a quienes me puedan brindad una soluci&oacute;n","replies":[{"poster":"Cipher","date":"2016-09-13T21:28:55.288+0000","up_votes":5,"down_votes":0,"body":"????\n\nO sea, tenías windows 10 original, cambiaste a windows 7 (posiblemente pirateado) Y además el técnico te dice que removió/cambió la tarjeta de vídeo.\n¿Really?\n\nPues amigo, lo que hiciste fue muy estúpido. Aunque no lo creas windows 10 es mucho mejor que el 7. Más aún si es original.\n\nSi dice placa VGA estándar ES PORQUE NO HAY PLACA DE VIDEO.\n\nFuiste TOTALMENTE estafado.","replies":[{"poster":"Dim Light","date":"2016-09-13T21:35:52.496+0000","up_votes":1,"down_votes":0,"body":"Que forma más sincera de destrozar a alguien diciéndole la verdad. Te doy +1","replies":[]}]},{"poster":"Sonya Kyron","date":"2016-09-13T23:28:32.692+0000","up_votes":1,"down_votes":0,"body":"Pasate a Windows 10 x64, que yo te lo puedo arreglar para que ande perfecto.\nYo ya arregle una maquina similar y el LOL con todo en bajo daba 140 FPS y todo en medio 80-90 FPS.","replies":[]},{"poster":"Bienzahar","date":"2016-09-13T22:06:07.338+0000","up_votes":1,"down_votes":0,"body":"http://apollo-uploads-las.s3.amazonaws.com/1425931480702/Shankid.jpg","replies":[]}]}