{"poster":"Gr0undZer0","date":"2015-07-24T15:35:52.038+0000","title":"Die Unergründlichkeit des Bestrafungssystems RELOADED","subforum":"Spielerverhalten & Moderation","embed":{"description":"Servusla Community, wie der Titel bereits verr&auml;t, komme ich nicht dahinter wie im Detail die Auswertung von Spielen im Bezug auf Spielerverhalten funktioniert. Kurz zu meiner Situation: Ich habe im M&auml;rz 2015 zum ersten Mal eine Chat-Restriction bekommen, welche sich jedoch direkt &uuml;ber 75 Games (!!!) gezogen hat.","url":"http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/268zrpoU-die-unergrandlichkeit-des-bestrafungssystems","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":1,"down_votes":5,"body":"Soo meine Damen und Herren, \n\nda laut Google-Suchergebnis mein letzter Post schon geschlossen wurde, m&ouml;chte ich hier eine neue Diskussion beginnen, die diesmal **nicht** Restriction sondern Bann zum Thema hat.\n\nDie Hintergrundinfos zu meiner Situation k&ouml;nnt ihr in dem angeh&auml;ngten Link nachlesen.\n\nEin kurzer Schnelleinstieg: \nIch habe wiederholt Chatrestrictions und letztendlich sogar eine Ranked-Restriction bekommen.\nNachdem ich heute in einem Game einen miesen Mitspieler hatte der versucht hat das Spiel durch suicide zu manipulieren und der mich anschlie&szlig;end reported hat, habe ich eine 14-Tages Accountsperre erhalten. Meiner Meinung nach das alles jedoch nicht ganz verdient! \nIch bin ein Spieler, der immer wieder darauf hinweist, das Leute bitte nicht flamen sollen und auch nie Schimpfworte o.&auml;. in den Chat schreibe, sondern eigentlich eher versuche, ein positives Klima zu schaffen.\n\nIn der Email war der Chatlog angeh&auml;ngt, der die \"b&ouml;sen\" W&ouml;rter/S&auml;tze herausgefiltert hat und ich bin der Meinnung, dass die Dinge, welche ich gschrieben habe, bei weitem nicht BANN-w&uuml;rdig sind! \nMan beachte, dass ich deshalb so viel geschrieben habe, weil mir von Jungler/Bot wiederholt Fragen gestellt wurden und ich au&szlig;erdem wollte, dass Renek aufh&ouml;rt zu trollen.\n\nHier der Link zur Mail plus meine Erkl&auml;rungen, eure Meinung dazu bitte.\n\nHere are some chat logs that were identified as negative by other players in the community.\n\n~~~~~\nvi will u early gank? <- normale Frage\n\nworth <- nach dem invade, weil Gegner Flash nutzen mussten\n\nearly gank bot, she has no flash <- an den Jungler\n\nwhat lane? <- Frage an Jungler\n\nkill him <- als ich (mid) zur Top geroamed habe. Hier hat sein flame begonnen\n\n3 mid nice .. <- wurde gegankt\n\ni will mute u, u are toxic <- an den Toplaner (der Troller)\n\nmy first misstake and u start to flame <- auch an Top\n\nits viktor, and hes fed <- jungler sagte \"das war mehr dmg als gedacht\"\n\nvi with ult combo we kill him EASY <- aufmunternde Worte\n\nthrash first pick? i have more than 150 games with malza\nthis season and a 68% winrate. so pls mr toxic <- Top flamed weiter\n\ni guess its my fault too, that u suckk renek? <- das war das einzige, was auch nur ann&auml;hernd negativ von mir war!?!?\n\nstop trol\n\ndont kill the troll pls <- all chat\n\npls dont kill the troller <- all chat\n\nrenek!?\n\nviktor why? <- all chat, weil er den troller in der mitte immer wieder killt\n\nRENEKTON CAN U PLS STOP IT?\n\nim sry for what i said .. <- hier entschuldige ich mich sogar noch aber er h&ouml;rt einfach nicht auf\n\nrenek pls, im sry#\n\nRENEK PLS IM SRY STOP IT\n\n9x times pls. <- all chat\n\nme? u were the guys who flamed\n\nrenek im sry for talking. pls stop it now\n\nu know u build the wrong way vik? <- all chat, nur ein tipp and ihn\n\nwhy do u hate me?\n\nvik is a lot stronger if u upgrade the laser, but then\nbuild other items like ludens echo first ;) <- all chat, nur ein tipp\n\nthen ur mmr is lower than the averga in ur\nleague taric <- taric wollte wissen, wieso er f&uuml;r nen win nur 6Lp bekommt\n\n9x <- all chat\n~~~~~\n\nHIER DER LINK:\n\nhttp://link.email.riotgames.com/YesConnect/HtmlMessagePreview?a=fiCT_etp7RqBObxNqm0zujUP&msgVersion=web \n\nGibt es Hoffnung, dass jemand sich meiner Situation annimmt und diese Sperre eventuell aufhebt?\nIch frage mich eben, wieso z.B. Worte wie \"worth\" oder die Fragen \"will u early gank vi?\" als toxic herausgefiltert werden … ","replies":[{"poster":"drexxsack","date":"2015-07-24T15:39:21.399+0000","up_votes":3,"down_votes":0,"body":"Dein alter Post existiert noch:\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/268zrpoU-die-unergrandlichkeit-des-bestrafungssystems\nIst allerdings auch egal. Es lässt sich über das Thema besser in einem neuen Thread reden.","replies":[{"poster":"Gr0undZer0","date":"2015-07-24T15:44:28.477+0000","up_votes":1,"down_votes":1,"body":"Ist für mich auch ein neues Thema. Mir geht es ja nicht mehr direkt um die Funktionsweise des Bestrafungssystems, sondern eher darum, ob der Bann in meinem Fall gerechtfertigt ist und wenn ja wieso und ob ich dagegen irgendetwas tun kann. \nIch habe bis zum Studium ewig frei .. ich brauche meinen LoL-Account! :D","replies":[{"poster":"Madchickendinner","date":"2015-07-24T17:08:00.084+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gr0undZer0,realm=EUW,application-id=KYnfKGf0,discussion-id=ETrJuOFT,comment-id=00000000,timestamp=2015-07-24T15:44:28.477+0000)\n>der Bann in meinem Fall gerechtfertigt ist und wenn ja wieso und ob ich dagegen irgendetwas tun kann. \n> Ich habe bis zum Studium ewig frei .. ich brauche meinen LoL-Account! :D\n\nKlar. Aufhören zu flamen das wäre der Anfang aber der bann wird nicht aufgehoben. Viel spaß in den Ferien.","replies":[]},{"poster":"eingew","date":"2015-07-24T16:13:12.716+0000","up_votes":1,"down_votes":0,"body":"Ging glaub ich eher darum, dass du geschrieben hast, der sei geschlossen...\n\nwas auch immer Google dir das erzählt hat, es ist falsch, mit deinem Post ist noch alles ganz normal :P","replies":[]}]}]},{"poster":"drexxsack","date":"2015-07-24T15:51:53.886+0000","up_votes":2,"down_votes":0,"body":"> i will mute u, u are toxic\n> my first misstake and u start to flame\n> its viktor, and hes fed\n\nIst eine kleinerer Punkt: Spar dir solche Äusserungen wie \"i will mute you\". Sie kosten dich zeit, nerven den Rest Teams und bringen nichts.\n\n\n> i guess its my fault too, that u suckk renek?\n\nsame as above\n\n> stop trol\n> dont kill the troll pls\n> pls dont kill the troller\n> renek!?\n> viktor why?\n> RENEKTON CAN U PLS STOP IT?\n> im sry for what i said ..\n\nund da haben wir die folge...\n\n\n> 9x times pls.\n> me? u were the guys who flamed\n\nReportauffoderungen und Reportdrohungen werden aktuell vom System als Extremfall gewertet. Auch diese Dinge sind immer negativ.\nWeiteres gleich weiter unten\n\n> u know u build the wrong way vik?\n> vik is a lot stronger if u upgrade the laser, but then build other items like ludens echo first ;)\n\nLeute lassen sich nicht gerne belehren, schon gar nicht so penetrant aufdringlich, von Leuten, die genauso gut sind, wie sie.\n\n> 9x\n\nWie gesagt, werden Reportaufforderungen aktuell als Extremfall behandelt. Das ist momentan etwas das in der Diskussion steht. In NA z.B. ändert Lyte Strafen dieser Art häufig in 3-7Tage-Banns oder 300cr+. Die Strafen unterscheiden sich allerdings von Region zu Region(und auch was).\nMir persönlich sind 14 Tage dafür zuviel, allerdings kann ich diese Strafe durchaus auch nachvollziehen.\nReport ist das Wort, dass negative Spieler am häufigsten nutzen.\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/2EfOvuAs-verwarnung-wegen-negativen-verhaltens-mir-ist-nicht-bewusst-was-das-gewesen-sein-soll?comment=00030001\nhttps://www.reddit.com/r/leagueoflegends/comments/39qmkb/proof_inside_i_am_the_player_who_was_banned_for/cs5qo1r\nSpar dir die Diskussionen mit Flamern, die unaufgeforderten Belehrungen(gerade in diesem Ton) und die Reportaufforderungen, dann ist es weitestgehend fein.\nWenn du unbedingt willst, kannst du ja beim Support vorstellig werden, allerdings glaube ich nicht, dass die Strafe geändert wird.","replies":[{"poster":"Spicavius","date":"2015-07-25T02:37:45.015+0000","up_votes":2,"down_votes":0,"body":"Ganz ehrlich.\nWenn jemand in meinem Team schreibt (egal ob ich oder ein Teammate gemeint sind), dann zieht das soo dermaßen die Stimmung runter.\nDas fällt bei mir unter heftigstem Flamen und sollte auch mit 2 Wochenbanns bestraft werden.\n\nEin \"Reportaufruf\" macht nicht nur die Stimmung kaputt, es sorgt auch noch dazu, dass der angeblich zu reportende Spieler auch noch mit dem Flamer diskutiert ala \"For?\" oder \"What did i do?\"  oder wenn es ganz schlimm kommt \"/all He is lying report him for ....\"\n\nIch finde es wirklich gut, dass Lyte und sein PB-Team jetzt hart durchgreifen und knallhart viele Arten von Flame mit 2 Wochenbanns belegen.\n\nDiese Flamer jucken mich ja nicht (weil ich meinen Mutebutton habe), aber sie bringen immer meine restlichen Teammates dazu IHN zu flamen, was leider auch nur dazu führt, dass ich fast mein halbes Team muten muss.\n\nSowas passiert selten (vllt 1 von 20-30) spielen, aber wenn es passiert geht es mir schon tierisch auf die Nerven.","replies":[{"poster":"drexxsack","date":"2015-07-25T07:45:30.506+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=KYnfKGf0,discussion-id=ETrJuOFT,comment-id=00020001,timestamp=2015-07-25T02:37:45.015+0000)\n>\n> Ganz ehrlich.\n> Wenn jemand in meinem Team schreibt (egal ob ich oder ein Teammate gemeint sind), dann zieht das soo dermaßen die Stimmung runter.\n> Das fällt bei mir unter heftigstem Flamen und sollte auch mit 2 Wochenbanns bestraft werden.\n\nIn NA hat Lyte bisher daraus 3-7Tage-Banns oder 300+Cr gemacht. Das wäre auch das Strafmaß, dass ich gewählt hätte. Allerdings halte ich 14-Tage durchaus für eine Strafe, die man vertretbarerweise dafür vergeben kann,  je nachdem wie man die Qualität des Flames bewertet und in die Endwertung einfließen lässt.\nReportaufforderungen werden eigentlich nur als Druckmittel relevant und das ist schlicht nicht notwendig. Dennoch: Es ist möglich, dass da noch feintuning kommt. Ich würde die Wahrscheinlichkeiten dafür auf 50% schätzen.","replies":[]}]},{"poster":"eingew","date":"2015-07-24T16:12:01.862+0000","up_votes":2,"down_votes":0,"body":"Kann nur zustimmen, eine CR + RR hätte gereicht meiner Meinung nach.\n\nIch finde man sollte nicht Reportaufforderungen härter bestrafen, sondern ihnen den Wind aus den Segeln nehmen, indem man deutlicher aufklärt, dass Reports immer überprüft werden und nur zu einer Strafe führen, wenn man wirklich etwas falsch gemacht hat. Dann wird das nämlich auch als Drohung nutzlos.","replies":[{"poster":"drexxsack","date":"2015-07-24T16:13:56.346+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist, dass man es noch so deutlich erklären kann, man kann die Leute nicht zwingen etwas zu lernen.","replies":[{"poster":"eingew","date":"2015-07-24T16:17:12.824+0000","up_votes":1,"down_votes":0,"body":"Ja, aber die, die es nicht lernen werden sowieso bestraft. Ein einzelner Ladebildschirmsatz würde ja reichen.\n\n\"Did you know: Reports do only lead to a penalty, if you really have done something wrong.\"\n\nMehr oder weniger ;)","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-07-24T16:08:15.653+0000","up_votes":2,"down_votes":0,"body":"du machst halt 2 entscheidende Fehler: 1. der \"I will mute you, you are toxic\" Post... Ich hatte letztens nebenbei ebenfalls einen Mitspieler, der uns allen so oft erklären wollte, dass unser einer Mitspieler \"toxisch\" ist, dass er selber gar nicht gemerkt hat, dass er es selbst ebenfalls ist.\n\nUnd die Info ist so was von irrelevant. Einfach Muten und gut ist. Dass musst du auch niemanden Mitteilen. Das einzige, was ich ab und zu mache, ist ein \"Why didn't you just mute him\" an meine restlichen Mitspieler, wenn mein Chatverlauf erahnen lässt, dass die sich weiterhin mit ihm streiten... \n\nAber noch schlimmer: Du kündigst es an, schreibst aber hinterher weiter mit ihm... und zwar dann wirklich einfach nur destruktiv. Und da ist dann auch nichts mehr \"unergründlich\" dran. Wenn du den Top Laner einfach nach deinem schon unnötigen (und den Spieler eher zum weiter trollen motivierenden) Eintrag wenigstens mutest, passiert dir auch nix. Stattdessen beschäftigst du dich weiterhin mit ihm.","replies":[]},{"poster":"Gr0undZer0","date":"2015-07-24T17:56:49.218+0000","up_votes":2,"down_votes":3,"body":"Ok, was habe ich heute daraus gelernt?\n\nIm Chat absolut jedesmal einfach muten und/oder selbst REIN GAR NICHTS MEHR schreiben, da das System alles mögliche als negativ herausfiltert. \nGut, ich hatte einen schlechten Tag und mich von diesem Troller echt provozieren lassen, aber das wird nicht mehr vorkommen. \n\nNichts desto trotz finde ich die Strafe zu hart. {{champion:32}} \n\nDanke an der Stelle für die vielseitige Beteiligung! \n\nGibt eben auch gute Leute in der Community <3","replies":[{"poster":"Temudschinn","date":"2015-07-25T12:34:08.455+0000","up_votes":2,"down_votes":0,"body":"Hm, diesen Schluss finde ich falsch. Einfach nicht mehr zu reports aufrufen und niemanden mehr beleidigen - und alles ist gut.","replies":[{"poster":"Gr0undZer0","date":"2015-07-27T08:51:29.593+0000","up_votes":1,"down_votes":0,"body":"Naja da anscheinend auch ganz normale Aussagen, die absolut nicht negativ sind, als negativ eingeschätzt werde, wird in Zukunft gar nichts mehr oder nur noch wp oder gj im Chat auftauchen.","replies":[]}]}]},{"poster":"Revilous","date":"2015-07-24T17:41:53.640+0000","up_votes":1,"down_votes":0,"body":"nach allem, was man hier liest, werde ich nie wieder auch nur ein Wort schreiben wenn es nicht gerade überaus positiv oder lobend ist... Btw ich hatte vorhin jemanden der NUR negativ gestimmt war, die ganze Zeit sowas sagte wie \"ff20\" \"we cant win ..\" \"they are too ahead\" \"please ff, why dont ff\" und deshalb habe ich den reportet weil der meiner Ansicht nach nicht mehr richtig mitgespielt hat. Danach habe ich die Nachricht erhalten, dass dank mir wieder jemand bestraft wurde...","replies":[]},{"poster":"Phobos Selini","date":"2015-07-24T16:08:59.809+0000","up_votes":1,"down_votes":0,"body":"Da Du im anderen Thread eine genauere Einschätzung wolltest, bekommst Du sie hier:\n\n>3 mid nice ..\n\ndas ist bereits passiv aggressives Kritisieren der Spielsituation\n\n>i will mute u, u are toxic\nmy first misstake and u start to flame\n\nHier fängst du an die anderen als toxisch anzuprangern. Das bringt überhaupt nichts und heizt nur die schlecht Stimmung weiter auf.\n\n>its viktor, and hes fed\nvi with ult combo we kill him EASY\nthrash first pick? i have more than 150 games with malza this season and a 68% winrate. so pls mr toxic\n\nAngeberei, dummes weil unnötiges Rumdiskutieren mit toxischen Leuten\n\n>i guess its my fault too, that u suckk renek?\n\nJust Flame\n\n>stop trol\n\ndont feed the troll! \nWenn Du nicht wenigstens in Aussicht stellst, dass man das Spiel noch gut gewinnen könnte, oder andere deutlich positiv besetzte Kommentare anhängst, dann bringt diese Aufforderung nichts. Im Gegenteil es zeigt dem Troll, dass es Dich stört, und er fühlt sich so bestätigt. Geht diese Aufforderung an Spieler die einfach nur eine Aktion machen, die Dir nicht gefällt, dann ist es Blaming.\n\n>dont kill the troll pls\npls dont kill the troller\nrenek!?\nviktor why?\n\nunnötioges weinerliches Blabla\n\n>RENEKTON CAN U PLS STOP IT?\nim sry for what i said ..\nrenek pls, im sry#\nRENEK PLS IM SRY STOP IT\n\nOffenbar zu spät. Ansich eine postive Sache, dass Du Dich entschuldigst, aber es lagen mit Sicherheit auch schon einige Minuten zwischen diesem Teil und dem anfänglichen Blaming.\n\n>9x times pls.\n\nReportaufforderung und Drohung fällt unter Blaming.\n\n>me? u were the guys who flamed\n\npassiv aggressives Rumdiskutieren\n\n>renek im sry for talking. pls stop it now\nu know u build the wrong way vik?\n>why do u hate me?\n>vik is a lot stronger if u upgrade the laser, but then build other items like ludens echo first ;)\nthen ur mmr is lower than the averga in ur league taric\n\nauch wenn es vielleicht hilfreich gemeint war, kann sowas besserwisserisch und herablassend rüber kommen von Fremden\n\n>9x\n\nund nochmal die Reportdrohungen\n\n\nIch finde das reicht in dieser Menge allemal für eine ordentliche Strafe. Flaming, Blaming, Reportaufrufe, negatives Rumdiskutieren, altkluge Verbesserungen unnötiger Blabla Spam; das reicht um auch mal ne Kategorie höher zu greifen als nur eine CR, zumal Du ja bereits vorbestraft warst.","replies":[{"poster":"Gr0undZer0","date":"2015-07-24T17:53:04.266+0000","up_votes":1,"down_votes":4,"body":"> \n> Angeberei, dummes weil unnötiges Rumdiskutieren mit toxischen Leuten\n\nIch habe es hier nur gut gemeint, weil Vi verzweifelt war: sie sagte, dass der dort bereits gefeedete Vik zu viel Schaden macht. Da wollte ich aufmuntern in dem ich ihr gesagt hab, dass wir ihn zusammen killen können. \nWO ist das denn bitte Angeberei wenn ich einen Teamkollegen ermutige nicht aufzugeben?\n\n> \n> dont feed the troll! \n> Wenn Du nicht wenigstens in Aussicht stellst, dass man das Spiel noch gut gewinnen könnte, oder andere deutlich positiv besetzte Kommentare anhängst, dann bringt diese Aufforderung nichts. Im Gegenteil es zeigt dem Troll, dass es Dich stört, und er fühlt sich so bestätigt. Geht diese Aufforderung an Spieler die einfach nur eine Aktion machen, die Dir nicht gefällt, dann ist es Blaming.\n\nUm das mal ins Gedächtnis zu rufen: \nhier werden lediglich die Sachen aufgeführt, wie vom SYSTEM als negativ eingestuft wurden. \nIch habe durchaus Dinge gesagt wie: \"its not lost\", \"dont surrender\", \"we can still win\" o.ä. ...\n\nDeshalb kapiere ich ja auch nicht, wieso z.B. \"worth it\" nach einem guten Gank als flame eingestuft wird?","replies":[{"poster":"Temudschinn","date":"2015-07-25T12:27:11.368+0000","up_votes":2,"down_votes":0,"body":"Da trügt dich wohl deine Erinnerung...","replies":[]},{"poster":"eingew","date":"2015-07-24T20:13:37.882+0000","up_votes":2,"down_votes":1,"body":"Also eigentlich wird der gesamte Chatlog angeführt und nichts aussortiert.","replies":[]},{"poster":"Gr0undZer0","date":"2015-07-27T08:50:21.004+0000","up_votes":1,"down_votes":0,"body":"@ Eingew und Temudschinn:\nSorry, davon ging ich aus, da ja zu beginn meines Chatlogs folgender Satz steht:\n\"Here are **some** chat logs that were identified as negative by other players in the community.\"","replies":[]}]}]},{"poster":"Batrix2","date":"2015-07-24T15:53:38.560+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir raten beim Riot support nach zufragen hier im forum nützt es nichts","replies":[]},{"poster":"iDarkXenOi","date":"2015-07-24T15:44:33.223+0000","up_votes":1,"down_votes":5,"body":"Wurde heute auch gebannt :) recht grundlos tynma ging afk nach 0/2 also ein ragequit.. habe gesagt gg ff 20 und ja.. nach dem game kamm die Meldung dein acc bla bla wurde für bla gebannt. gg\n\nManchma hab ichs gefühl das die Flamer verschont bleiben und nur die guten leute die bans bekommen.\n","replies":[{"poster":"Sirrkas","date":"2015-07-24T15:45:19.263+0000","up_votes":2,"down_votes":0,"body":"Wenn du über deinen Bann reden willst, öffnest du dazu am besten einen eigenen Thread mit Chatlog in Form von Screenshots oder einem Link.","replies":[]},{"poster":"Gr0undZer0","date":"2015-07-24T15:46:19.196+0000","up_votes":1,"down_votes":1,"body":"so etwas würde ich z.B. nie schreiben \"ff 20\" … Never surrender! \nHatte schon viele Games die hoffnunglos aussahen aber sogar manchmal 4vs5 mit Rückstand noch gedreht wurden. ;-)","replies":[]}]},{"poster":"iDarkXenOi","date":"2015-07-24T15:54:15.939+0000","up_votes":1,"down_votes":2,"body":"das kannste in silver nicht erwarten ;) die Hoffnung is da weg","replies":[]}]}