{"poster":"only zhule","date":"2018-01-11T07:19:34.463+0000","title":"Can we get a support focused around doing damage?","subforum":"Gameplay","up_votes":1,"down_votes":2,"body":"If i had a better idea of abilities and all that this would go under concepts and creations.\r\n\r\nGod i want a support who&#039;s focus is on damaging the enemy champions.  Now i&#039;m not talking {{champion:99}}  going bottom as a full AP &quot;support&quot;.  i&#039;m talking about a champion who&#039;s team benefit is to wear down the enemy through constant minor damage.  You are rarely ever afraid of them blowing away 40% of your health pool in .5 seconds, but you always have to worry about getting ground down and killed by the enemy committing to a fight rather then just a single hit trade.   I want a champion who when you run into them alone in river (or wherever) you go &quot;ok i KNOW i can kill them BUT, unless they are trash, they are going to stall me for a good 20-45 seconds AND shave off at least 40% of my health pool.\r\n\r\nI want a champion who is not the current two flavors of support; passive heal/buff bot and I managed to land 1 CC... there goes most of your life.","replies":[{"poster":"Baron Barian","date":"2018-01-11T07:27:24.257+0000","up_votes":2,"down_votes":0,"body":"So....a burst mage?\n\nWhat you're asking isn't really anything that's not available in the game already. And if the champion's purpose is to primarily do damage, then it's support is, at best, a secondary role. Damage and support is kind of two different fields.","replies":[{"poster":"only zhule","date":"2018-01-11T07:36:24.819+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Baron Barian,realm=NA,application-id=3ErqAdtq,discussion-id=gz1Bp8LB,comment-id=0000,timestamp=2018-01-11T07:27:24.257+0000)\n>\n> So....a burst mage?\n\nI don't know how you got burst mage unless you are only responding to the title.\n\nPreferably it would be a character with two DoT effects, or one that isn't either on a 8 second cooldown that BARELY beats base health regen and lifesteal against minions or chunking you for 5% HP per tick for 4-6 ticks on a 20+ second cooldown.\n\n\nReally the tread is more poking at the idea that supports as a class are not allowed to do damage.  IE everyone flips their shit when the support, who built like a damage dealer, chunks someone for 30-50% with a full rotation.","replies":[{"poster":"Baron Barian","date":"2018-01-11T07:42:33.134+0000","up_votes":1,"down_votes":0,"body":"Oh! That description reminds me of a Dota hero, Venomancer. Like some mage supports, he can deal decent damage, but has utility that makes him played typically as a support.\n\nBut what he has that could make for an interesting champion ability, is a poison ultimate ability that damages, but can't reduce health below 1, so while the ult itself can hurt, it can't actually kill by itself, allowing for teammates to finish them off and earn the kill themselves.","replies":[]}]},{"poster":"TehNACHO","date":"2018-01-11T07:40:38.448+0000","up_votes":1,"down_votes":0,"body":"Well, semantics. There's Support the champion archetype (Sona Soraka Janna Lulu) and Support the role. Designing a champion that's specifically capable of early game damage despite being underleveled, low on gold, and working off a partner is technically unique. Not saying it's a direction that should be approached, but it is an unfulfilled niche.","replies":[]}]},{"poster":"Attticus Finch","date":"2018-01-12T00:36:26.825+0000","up_votes":1,"down_votes":0,"body":"Completely terrible idea. If you want to shit out damage there are literally four other roles who facilitate that.","replies":[]},{"poster":"JustMonika13","date":"2018-01-12T00:28:00.634+0000","up_votes":1,"down_votes":0,"body":"No.","replies":[]},{"poster":"Takazaki","date":"2018-01-11T08:38:27.099+0000","up_votes":1,"down_votes":0,"body":"we{{champion:143}} \nhave{{champion:161}} \nplenty{{champion:37}} \nof{{champion:25}} \nthose{{champion:1}}","replies":[{"poster":"only zhule","date":"2018-01-11T20:39:06.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Takazaki,realm=NA,application-id=3ErqAdtq,discussion-id=gz1Bp8LB,comment-id=0001,timestamp=2018-01-11T08:38:27.099+0000)\n>\n> we{{champion:143}} \n> have{{champion:161}} \n> plenty{{champion:37}} \n> of{{champion:25}} \n> those{{champion:1}}\n\noh look 4 mages and one support, really hammering home my point.\n\n(maybe Morg counts as a support now it has been a while since i last saw her go mid lane).","replies":[{"poster":"Takazaki","date":"2018-01-12T00:26:41.772+0000","up_votes":1,"down_votes":0,"body":"zyra has not been a mid laner for sessions\n\nvelkoz had flexed into bot lane since his release\n\nif you think morgana isnt a support then we are playing 2 different games\n\nannie literally defined what it ment to be a support mage.\n\ndamage support are just mages sent bot lane. dont pretend like they are anything else","replies":[]}]}]},{"poster":"Athenes Lulu","date":"2018-01-11T09:15:05.990+0000","up_votes":1,"down_votes":0,"body":"just pick mages botlane","replies":[{"poster":"only zhule","date":"2018-01-11T20:43:54.998+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cancerous Lulu,realm=NA,application-id=3ErqAdtq,discussion-id=gz1Bp8LB,comment-id=0002,timestamp=2018-01-11T09:15:05.990+0000)\n>\n> just pick mages botlane\n\nbut that misses the point.  everyone will accept if a \"mage\" is doing damage to them.  No one gets angry when a character 100% capable of being played mid, and most of the time is played in that role, does decent to heavy damage to them.  But SO HELP ME GOD if {{champion:89}} ,{{champion:37}} ,{{champion:16}} , {{champion:432}} ,{{champion:201}} , etc.... blows a full spell rotation on top of 2-3 damage items, that is unacceptable for the community at large.","replies":[]}]},{"poster":"FourIsTheNumber","date":"2018-01-11T14:22:19.591+0000","up_votes":1,"down_votes":0,"body":"{{champion:432}} {{champion:63}} {{champion:43}} {{champion:25}} {{champion:161}} {{champion:143}}","replies":[]}]}