{"poster":"FCJAAAAGOOOO","date":"2020-02-04T07:20:06.465+0000","title":"Top is trash.","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"I try to have fun in it and be creative but I can't help but admit that it's a trash role.  There can be fun from top, granted.  But fun in top lane requires a few things:\r\n\r\n1.) at least 1 of mid, bot or jg doing decently well\r\n2.) the whole team not picking immobile squishy champions/marksmen\r\n3.) not getting hard-camped by the enemy mid/jg\r\n4.) not having a team that does nothing to make up for top ganks\r\n5.) not having a jungler that is smite-clearing Krugs when they should obviously be making sure that the enemy team doesn't rush a 3rd dragon.\r\n\r\nFrom mid or bot the \"fun prerequisite\" list is much, much smaller, and entirely self-reliant:\r\n1.) don't feedlord oneself into oblivion\r\n2.) don't ignore your enemy laners when they leave lane.\r\n\r\nJungle isn't a great role right now, but it's still more forgiving than top:\r\n1.) don't die to the other jungler early\r\n2.) don't give double buffs to an enemy laner early\r\n3.) do something to help your own lanes\r\n4.) know how to play around objectives.\r\n\r\nSupports are the only ones that get to have fun guaranteed.  Their damage or CC is always relevant, they can get away with feeding and call it initiation and they can even get away with KS'ing as they are often carries themselves.\r\n\r\nUnfortunately, I can't stand support since RR and if I queue for something other than top I will most assuredly get autofilled as support.\r\n\r\nI just don't think this game is right for me.  It's really not about earning 1 win in an 8 loss streak - it's about not having to rely on someone else to break it or risking getting filled the dumbest role in LoL's history trying to queue for something else.  Games being shorter ironically has made them a waste of time.  That's not how this rant started but that's how I'll end it; when roles suck, the game sucks.","replies":[{"poster":"Disco Swiss","date":"2020-02-04T07:43:02.319+0000","up_votes":2,"down_votes":0,"body":"I used to love toplane. It's filled with cancer {{champion:82}} {{champion:236}} {{champion:875}} {{champion:516}} {{champion:16}} {{champion:41}} these guys suck to play against. You right this lane is rough.\nI switched to mid because its more forgiving. If im behind as a mid laner i can still farm without risk of dying(sometimes).\n\nJungle WAS fun but they patched it out of the game.\n\nBotlane is a coinflip.\n\nIts a weird game.","replies":[]},{"poster":"Waaaarrrrgggghhh","date":"2020-02-04T21:36:49.319+0000","up_votes":1,"down_votes":1,"body":"play shen","replies":[]},{"poster":"Deprecious","date":"2020-02-04T09:48:57.919+0000","up_votes":1,"down_votes":2,"body":"Jungle is not forgiving at all, if you go 0-2, you are 4 levels behind solo laners, same goes for botlane, both are useless once they lose their lanes, that is why junglers mostly go 0-10 or 10-0, same for botlane\n\nOn the other hand, on top and mid, if you go 0-2,  even 0-4, you are still ahead in level compared to botlane and jungle, and you can still win fights, and be usefull.. \n\nThe only weakness toplane has is their position on the map, and the ranged abusers that go there, i recently switched from support/jungle to mid/top, and trust me pall, you guys are having it easy, at least in gold/plat elo\n\n","replies":[]}]}