{"poster":"CrispyLeaves","date":"2015-10-13T02:29:39.000+0000","title":"Kalista Sentinel Bug","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"When kalista&#039;s soulbound ally auto attacks an enemy, the next auto attack from kalista deals the magic damage instantly. Then the physical damage from her auto attack goes with the animation. This has won me many trades in lane as a kalista player, but as a jinx main i can quite safely say i would like it removed because it can be really annoying, especially when trying to get kalista&#039;s auto attacks to miss by walking into brushes.","replies":[{"poster":"Jink","date":"2015-10-13T03:25:02.903+0000","up_votes":1,"down_votes":0,"body":"What do you mean \"Then the Physical damage from her auto-attack goes with the animation\" and how is that annoying when trying to make her attacks miss by moving into brush?","replies":[{"poster":"Talon12","date":"2015-10-13T04:40:20.566+0000","up_votes":1,"down_votes":0,"body":"the magic goes off when she uses the aa, not when the actual attack hits, so technically speaking, kalista can hurt you even if she misses her aa","replies":[{"poster":"CrispyLeaves","date":"2015-10-13T07:26:38.925+0000","up_votes":1,"down_votes":0,"body":"thats exactly what i was talking about xD. And i was kinda salty because she killed me like this.","replies":[{"poster":"Jink","date":"2015-10-13T10:28:37.247+0000","up_votes":1,"down_votes":0,"body":"I normally don't pay much attention to it because I just auto then am looking for my next target minion while checking enemies positioning and the minimap and my peripherals and hitting tab etc but I played her a few games ago and it does proc really fast lol - you should just get used to it and learn to play around it because with the amount of coding that went into it and the amount of testing that went on I think they made it proc like that intentionally but bear in mind Riot have made errors before. I don't think it's OP though but I can see how it'd be annoying lol you just gotta expect it for now anyway and maybe ask Riot if its intended because it may well be bugged to do that - Riot has all kinds of little bugs and make minor errors sometimes so it could be that.","replies":[]}]}]},{"poster":"CrispyLeaves","date":"2015-10-13T03:45:40.429+0000","up_votes":1,"down_votes":0,"body":"because her auto attacks miss if you go out of vision, so this is annoying because it has no animation and it doesnt have counterplay. While the rest of the auto attack goes with the animation of the auto, and misses. And i died in lane because the auto attack would have been negated by walking into bush, but the magic damage went instantly (during the windup of her autoattack) and killed me.","replies":[{"poster":"Jink","date":"2015-10-13T05:40:57.663+0000","up_votes":1,"down_votes":0,"body":"The counterplay is to expect a mini nuke and expect it at the appropriate time :p\n\nI think Riot did it like this intentionally but I may be wrong. Maybe if you send in a support ticket they'll give you some constructive feedback. I'd be interested to hear, but it seems obvious from the spotlight video if you watch it to check - that it applies prior to auto attacks landing and procs prior to the 2nd triggering auto attack completing and although I only ever noticed it as being like 0.2 seconds or 0.1 seconds sooner than my or my allies auto attacks landed in game I never paid much attention but if you watch the spotlight video you can blatantly see that it does apply sooner and I think either Riot intended this or made an error and sending in a support ticket is probably your best bet to get an answer.","replies":[]}]}]}]}