{"poster":"Barso55","date":"2019-02-26T11:52:08.088+0000","title":"Riot did a pretty good job of trying to make Morde a bot lane mage - Why isn't he picked more bot?","subforum":"Gameplay","up_votes":4,"down_votes":7,"body":"So on paper morde bot is really good. He does have clear weaknesses but clear strengths too. \r\n\r\nThe XP passive on his W allows him to have a level advantage, w movespeed and heal is really good for bot lane for both him and his supp, having range on E allows him to farm without meleeing all minions and poke and zone a little too. His base damages without items are really good, he can turn a 2v3 around by killing the adc with ult, he can push bot really hard if he kills enemy adc with ult, dragon is right there and if he takes it he can have some serious pushing and skirmish power for a little while, and he can start targon for additional gold for his sp and sustain in addition to w sustain. He can also build so many ways - straight ap, hybrid, or AD.\r\n\r\nHis biggest problem is landing triple q when the enemy supp will have cc and all the mobility on marksmen these days. But with probelt and a good supp with CC its not impossible. \r\n\r\nWhy hasn't this move from Riot been successful?","replies":[{"poster":"TricolorStar","date":"2019-02-26T11:54:38.492+0000","up_votes":10,"down_votes":0,"body":"Because playing a melee champ with no engage or hard CC as an ADC is like pulling teeth.","replies":[{"poster":"Baval","date":"2019-02-26T12:01:17.115+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=TricolorStar,realm=NA,application-id=3ErqAdtq,discussion-id=Hk62gEyA,comment-id=0000,timestamp=2019-02-26T11:54:38.492+0000)\n>\n> Because playing a melee champ with no engage or hard CC as an ADC is like pulling teeth.\n\nbasically this. He has no engage or escape so the enemy laner will just zone him to death. And since he uses health as his mana each poke drains his resources he cant easily get back. Shield helps a bit but an ADC can poke at long enough range. He has to rely completely on the enemy making mistakes to make anything happen, and thats not good.","replies":[]},{"poster":"Mordepool","date":"2019-02-26T17:01:23.066+0000","up_votes":5,"down_votes":0,"body":"And the lowest movement speed of any melee champion.","replies":[{"poster":"Agent Corgi","date":"2019-02-26T17:37:48.998+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mordepool,realm=NA,application-id=3ErqAdtq,discussion-id=Hk62gEyA,comment-id=00000001,timestamp=2019-02-26T17:01:23.066+0000)\n>\n> And the lowest movement speed of any melee champion.\n\nPretty sure Kled without Skaarl can outrun Mordekaiser.\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Mordepool","date":"2019-02-26T17:48:26.045+0000","up_votes":2,"down_votes":0,"body":"Yes actually i have 1st hand experience","replies":[]}]}]}]},{"poster":"lolipopevelynn","date":"2019-02-26T13:30:00.009+0000","up_votes":4,"down_votes":0,"body":"Morde bot doesn't work. They did an awful job. If \"you can see him work in high elo\" then get to high elo and make it work. Once you figured out that even one trick mordes arnt taking him bot come back and say you were wrong.  \n\nAnd no, even low elo he is nit taken bot. Too easy to abuse. You will see bull shit like thresh or kench adc before you see morde bot.","replies":[]},{"poster":"ValyrianBlade","date":"2019-02-26T13:25:51.775+0000","up_votes":4,"down_votes":0,"body":"Any reasonably high Elo ADC will know how to bully morde in Lane and basically get a big lead while morde is useless. \n\nMorde would be quite good in lower Elo, but most low Elo players will copy high Elo / pro, and therefore he's not played there either. \n\nHe's too easily kited, and therefore zoned. He'd only stand a chance with a really aggressive tank engage support like blitz/thresh/Leona, but even then his win condition comes down to his support landing the engage AND the enemy support missing their peel - all before they get poked/zoned out. \n\nIn addition to all of that, he lacks tower taking pressure late game. Sure, he can take them down with dragon ghost helping, but there's no guarantee he's getting dragon late game. \n\nI could see morde working in average-high Elo if he's got one of the above supports and either a marksman jungle or a hard engage cc jungle that can camp his Lane early. However such narrow win conditions make for an unpopular pick.","replies":[]},{"poster":"Murderkaiser","date":"2019-02-26T17:38:43.774+0000","up_votes":2,"down_votes":0,"body":"Too heavily dependent on good support to be able to do anything.","replies":[{"poster":"GigglesO","date":"2019-02-26T17:51:53.025+0000","up_votes":1,"down_votes":0,"body":"That and you can really easily poke him out of lane.","replies":[]}]},{"poster":"Agent Corgi","date":"2019-02-26T17:35:52.762+0000","up_votes":2,"down_votes":0,"body":"Morde's problem is that he lacks range (susceptible to poke) &amp; isn't a Viable Bot pick on his own.\nThe few times I've seen High ELO Morde players play him bot, they would be duo'd up with a hard engage support like Blitzcrank or Alistar. Even then, I imagine these guys have to actually put tons of work into winning those matches.\n\nHe **USED** to be good on his own back when his Juggernaut update launched in 2015. However as **_Useless Jhin_** pointed out, he was nerfed to the point where he was barely good anywhere let alone ADC. \n\nEnd of the day, he's not a terrible pick as a Toplaner or even a Midlaner in some cases. However, I would refrain from playing him in the ADC Role unless you &amp; a friend are super confident in your ability to play the game. He has very little synergy with most supports &amp; even with his Bonus EXP/Ghost Dragon Abilities (I can see Morde losing both of these in his Relaunch), it just doesn't compare to a standard Botlane.","replies":[]},{"poster":"Schenix","date":"2019-02-26T17:09:18.402+0000","up_votes":2,"down_votes":0,"body":"He was _too_ good at it because of what it takes to make an immobile sustain/damage bruiser work into ranged [unbearable early sustain and damage threat], and then nerfed into obscurity due to this.","replies":[]},{"poster":"Barso55","date":"2019-02-26T11:58:45.899+0000","up_votes":2,"down_votes":2,"body":"Well, your not playing him as an adc are you. His win condition is completely different, but perfectly viable - and he has all the tools to do it if the support picks correctly and knows what he is doing. Most RADCs have no engage or CC either. Their win condition is to farm and scale. His is to control bottom half of the map, powerfarm, push hard, turn 3v2s around, take drag and push, and snowball hard early. Yes, its unusual and different, but he has the tools for it. Its a matter of psychological acceptance of deviations from the meta.","replies":[{"poster":"shadowhunter4444","date":"2019-02-26T17:53:51.484+0000","up_votes":2,"down_votes":1,"body":"Morde has no method to win lane bot. All the enemy has to do is poke and kite. You will only win of your enemies are actually braindead. He might do well against squishy ranged champs mid, but they lose damage output after blowing spells and don't have a support covering their ass. And you can't afford to spend health for abilities in a 2v1 lane. Not when you're against a high damage champ with range who can poke you every time you try to take a minion.\nOther ADCs might not have hard cc either, but they do often have at least a gap closer/escape tool, and they aren't trying to literally stand on top of the enemy while walking at -2 miles per hour. By the time you get up to the adc you've probably taken 2 or three shots, then even if you get some damage on them they can kite you, and they have someone to peel. That just isn't good enough early. You will get bullied out of lane like no one's businesses and fall ridiculously far behind. In short, you aren't snowballing.\nThe problem isn't psychological, it's just numbers. If it was psychological you would at least see it in professional play more. People sre smart enough to figure out an off-meta playstyle. Besides, just about every ADC's win condition is to farm and scale. Mordekaiser is designed to be a lane bully, but there's no way he's bullying Caitlyn. Maybe if you get a perfect matchup against a low range adc and a melee support you might be able to do something, but it's still not that good. There are just people who do his job bot better and he does better other places.","replies":[]},{"poster":"Selegun","date":"2019-02-26T17:25:47.245+0000","up_votes":1,"down_votes":0,"body":"I like to run him botlane with friends from time to time.  Don't have much interest in ranked myself but I can help you theory craft the lane.  At work right now so I'll reply later when I'm free.","replies":[]}]},{"poster":"Barso55","date":"2019-02-27T05:37:04.985+0000","up_votes":1,"down_votes":0,"body":"My experience is in low elo, yeah. I find that a few points in w, 1-2 points in q, and the rest in E make him quite hard to actually poke out/zone.\n\nIt does depend 90% on the support pick, mechanics and knowledge of laning with mordekaiser though. \n\nTypical scenario is I just stand powerfarming in minion wave with w, their sp and adc use everything they have on me, and I lose about 25% health. They now have no CDs and my sp can engage them easily. His poke with e max and just half an item or 1 ap item in bot lane does like 15-20% of the enemies health, which isn't bad at all.\n\nThing with morde is if you don't stand in the middle of the wave with W and farm with E, you will get poked out and lose farm/die. Doing this also incites the aggression of the enemy bot lane, and if you are not behind/are ahead/have a few points in W you can soak up quite a bit of damage and your sp is free to engage them.\n\nTypically I either lose lane because sp is something that doesn't synergize well (no cc, like a soraka or something) and has no idea how to work with morde bot - ie. I stand in wave with w, get attacked by enemy sp and adc but sp just stands around not knowing what to do despite enemies having blown CDs, so often they see this disfunction and all in me 2v1 while sp runs away.\n\nOr I do the same thing, enemy blows some CDs, and because (in lower elo anyway) ranged champs just cannot not try to constantly harass a melee champ in their lane, they go out of position easily, my sp engages whoever is most out of position/has no CC, I get in, q, exhaust, q, probelt, q and they are pretty much dead. Sometimes might need to flash. I did say his engage and chase is really bad - but if he can keep up,outfarm/zone enemy hes already winning lane to some extent. Have your jungler gank at the right time and get the ADC's soul, and you have a 4v1 push bot. Take a drag instead and you still have a ton of power. Not to mention you can level 6 all in for sure earlier than the enemy team because of the xp thing. \n\nIt is situational, has a completely different playstyle and win condition, and can be hard punished, but it can secure a game easily too.","replies":[]},{"poster":"not2kleen","date":"2019-02-27T01:56:43.882+0000","up_votes":1,"down_votes":0,"body":"Literally the only good thing morde is good at is hard countering Yas talon and zed","replies":[]},{"poster":"Gandy Hands","date":"2019-02-26T23:50:05.738+0000","up_votes":1,"down_votes":0,"body":"The \"I've played three games or less of Mordekaiser\" starter pack.","replies":[]},{"poster":"shadowhunter4444","date":"2019-02-26T19:19:07.092+0000","up_votes":1,"down_votes":0,"body":"You're only going to win lane bot as Mordekaiser if your support is a god. But any ADC can win lane with a god support.  All of the advantages you mention only work if the enemy lets you do what you want.","replies":[]},{"poster":"20022012","date":"2019-02-26T17:37:54.468+0000","up_votes":1,"down_votes":0,"body":"Because they didn't do a very good job of making him a bot lane champion. He's a juggernaut that gets slightly more exp when an ally is nearby. That's it.","replies":[]},{"poster":"ShacoVSociety","date":"2019-02-26T17:29:21.014+0000","up_votes":1,"down_votes":0,"body":"Pretty common sense really. Let me paint a picture, they pick Caitlyn: you can’t farm. They pick Lucian: He wil forever kite you especcially when he has Bork, \nAlso for Ezreal, Vayne, etc. \nUnless your playing extremely low down the ladder you will not have botlane prio virtually ever which isn’t great when contesting scuttles, defending vertical jungling, drake control, or when reacting to a midland play or river play. Another downside is the lack of an ADC bot means less overall objective damage which means less threatening objective power plays, less siege power etc.","replies":[]},{"poster":"XxxLumberJackxxX","date":"2019-02-26T13:54:11.187+0000","up_votes":1,"down_votes":0,"body":"Because if the skill level of the morde player and the ADC are teh same, morde will die a lot and get little farm.\nCorrection, include skill level of the two supports as well.","replies":[]},{"poster":"BlueBilberry","date":"2019-02-26T13:53:50.919+0000","up_votes":1,"down_votes":0,"body":"He is yet another champ which doesn't belong on botlane with the marksmen.  Simple.  He has a rework coming which will probably make him stronger on top and mid.  Be patient.","replies":[]}]}