{"poster":"Epica","date":"2016-03-24T04:22:59.789+0000","title":"El cliente no inicia. AYUDA POR FAVOR!","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Buenas a todos, estaba jugando una partida con unos amigos, y luego de terminarla me quise unir a la cola clasificatoria, pero cuando quise hacerlo me salio un cartel de un &quot;error&quot; el cual no recuerdo exactamente que dec&iacute;a porque no le puse mucha atenci&oacute;n, pero si se que al final dec&iacute;a algo como &quot;Es recomendable reiniciar el cliente blah blah blah.... &quot;, lo cual hice, pero al momento de querer abrirlo nuevamente este simplemente no inicia, solo aparece el logo de League of Legends por 1-2 segundos y luego nada, revise el foro para ver si a alguien mas le hab&iacute;a pasado y efectivamente as&iacute; era, pero d&eacute;jenme que aclare que ya revise todas las posibilidades, incluidas las relacionadas a antivirus, pero aun as&iacute; no pasa naranja!\r\n\r\nSi alg&uacute;n rioter o alguno de ustedes compa&ntilde;eros de la comunidad tiene idea de como resolver esto, o sabe cual es la causa, se agradece mucho su colaboraci&oacute;n!.\r\n\r\nGracias de antebrazo.","replies":[{"poster":"Epica","date":"2016-03-24T04:33:48.106+0000","up_votes":1,"down_votes":0,"body":"Gracias por las respuestas, como dije en el comienzo del post, ya probé con todo lo relacionado a antivirus, e iniciar como administrador, modificar compatibilidades, etc etc....\n\nMi antivirus es Avast!, pero no creo que sea el problema, como dije en un comienzo estaba jugando normalmente, me salio un cartel de un supuesto error, cerré el juego como me aconsejaba y al tratar de abrirlo nunca mas funcionó. Repito que no creo que sea el antivirus ya que hasta hace un momento estaba funcionando normalmente. Saludos!\n\nEDIT: Estoy tratando de abrirlo en una laptop QUE NO TIENE ANTIVIRUS y que hasta ahora funcionaba perfectamente el lol pero hace exactamente lo mismo, logré abrir el launcher desde LolPatcher.exe dentro de la carpeta rads, no me deja ejecutarlo pero si darle a \"reparar el cliente\", ¿Qué aconsejan?.\n","replies":[]},{"poster":"I SuMaRu I","date":"2016-03-24T04:28:27.359+0000","up_votes":1,"down_votes":0,"body":"yo ya puse en foro hace esto y ya esta se soluciona el problema que tenes LOLPATCHER.EXE CAPAS QUE LO TEN GAS 2 VECES \n\n1) van al antivirus y seleccionan la casilla \"Estadistica\".\n2) van a la pestaña que dice \"Estado del componente\" y de ahi a \"elemenentos almacenados en el baul\".\n3) Ahi buscan el que dice LOLPATCHER.EXE le dan clic derecho y click a \"restaurar y añadir a excluciones\".","replies":[]},{"poster":"GatóMonstruo","date":"2016-03-24T04:24:51.214+0000","up_votes":1,"down_votes":0,"body":"En primera instancia, a tu antebrazo no lo quiero >.< \nSegundo, veamos, Cuál es el antivirus que tenés instalado en este momento? Probaste iniciar el cliente con el antivirus totalmente desactivado? Probaste inciarlo como administrador? \nEspero tu respuesta. \n\nSaludos.","replies":[]},{"poster":"Namatzuki","date":"2016-03-24T04:24:41.680+0000","up_votes":1,"down_votes":0,"body":"miles de persona postean soluciones. mira el foro o youtube","replies":[]}]}