{"poster":"MoonIightz","date":"2017-04-04T01:08:03.417+0000","title":"Plat-Dia Team sucht Jungler","subforum":"Clans & Teams","up_votes":3,"down_votes":1,"body":"Hallo alle zusammen,\r\n\r\nwir versuchen momentan ein Team aus Spielern aufzubauen, welche gut zusammen passen und gewillt sind, sich als Team zu verbessern.\r\nSelbst maine ich die Rolle des ADC&acute;s, bin 24 Jahre alt, maine Cait, Ezreal, Vayne und Lucian und bin gerade in Plat 1 unterwegs.\r\nWir suchen noch einen zuverl&auml;ssigen Jungler, welcher im Optimalfall Shotcallerfahrung hat.\r\n\r\nAnforderungen :\r\n- freundliches und respektvolles Auftreten\r\n- Kommunikationsbereitschaft\r\n- Kritikf&auml;higkeit\r\n- 18 Jahre oder &auml;lter\r\n- mindestens Platin Elo in Soloq\r\n- mindestens Gold in Flexq\r\n- main Jungle\r\n- Beherrschen mehrere Jungler\r\n- Zuverl&auml;ssigkeit \r\n\r\nAm allerwichtigsten ist mir, dass alle 5 Member des Teams gerne miteinander spielen. Die Atmosph&auml;re soll zwischen und w&auml;hrend der Spiele gut sein.\r\nDazu geh&ouml;rt vorallem, dass man nicht tiltet, das man die Gegner nicht beleidigt und das man nicht nach 10 Minuten surrendern will, nur weill man mit 10 zu 0 zur&uuml;ckliegt. Nat&uuml;rlich &auml;rgert man sich ab und zu, wenn man mal missplayed, gecampt wird oder der Gegner 3x nacheinander &uuml;belst lucky davonkommt, das meine ich nicht. Mir geht es darum, dass das nicht gleich die ganze Atmosph&auml;re im Team runterziehen darf.\r\nWichtig ist es mir au&szlig;erdem, sagen zu k&ouml;nnen : &quot;okay, das war mein Fehler, megabad sry&quot; und dann zu versuchen diesen Fehler nicht mehr zu begehen.\r\n\r\nWenn Ihr die Anforderungen erf&uuml;llt und auch wert auf die von mir genannten Priorit&auml;ten legt, dann added mich gerne ingame, oder schreibt hier.\r\n\r\nBeste Gr&uuml;&szlig;e,\r\nlts gosu !\r\n\r\n(Lts gosu , das i ist ein kleines L)","replies":[{"poster":"Corporal Crane","date":"2017-04-04T05:03:55.764+0000","up_votes":1,"down_votes":0,"body":"Ich habe dich Ingame geaddet, jungle seit 4 Seasons, habe Teamerfahrung und erfülle auch alle anderen Kriterien, nur im Shotcallen habe ich nicht so viel Erfahrung. Habe heute den ganzen Tag Zeit, kannst mich also einfach anschreiben.\n\nLiebe Grüße\nSlaveSlayer123 (Eigentlich \"Icanus\" - habe nur eine Wette verloren...)","replies":[]},{"poster":"Shoizy","date":"2017-04-04T02:47:02.532+0000","up_votes":1,"down_votes":0,"body":"ich würde gerne im  normal game ein 5er duo machen, will mal schauen wie ich mich so als jungler gebe wenn ich wirklich ernst spiele. (als training) bin ja Main jungler\n\nbin aber Silber 5 :D","replies":[]}]}