{"poster":"RootOfOrigin","date":"2015-06-28T21:08:25.309+0000","title":"Segítségkérés a javuláshoz","subforum":"Tippek és trükkök","up_votes":6,"down_votes":2,"body":"Sziasztok!\r\n\r\nLassan m&aacute;sf&eacute;l &eacute;ve j&aacute;tszom a j&aacute;t&eacute;kkal, &eacute;s id&eacute;n v&eacute;gre elkezdhettem a rankedet. 4/6-os prom&oacute;val Silver 5-be ker&uuml;ltem, ahol megmaradtam egy h&oacute;napig, ut&aacute;na viszont visszacs&uacute;sztam Bronz 2-be, sőt, jelenleg 0 LP-vel &aacute;llok, &eacute;s m&aacute;r egy h&oacute;napja nem rankedeztem a tov&aacute;bbi visszaes&eacute;stől val&oacute; f&eacute;lelem miatt. A visszaes&eacute;s nagyobb h&aacute;nyada nem rajtam m&uacute;lott (pl. sokszor feedelt valaki a csapatomb&oacute;l, nem volt hajland&oacute; egy&uuml;ttműk&ouml;dni), de szerintem &eacute;n is hib&aacute;s vagyok (t&uacute;lv&aacute;llal&aacute;s, rossz helyzetfelismer&eacute;s, &uuml;gyetlens&eacute;g, rossz shotcall, vagy csak egyszerűen nem j&ouml;tt &ouml;ssze semmi).\r\n\r\nAzt k&eacute;rdezn&eacute;m tőletek, hogy miben kellene fejlődn&ouml;m, hogy ak&aacute;r egyed&uuml;l is elvigyem a h&aacute;tamon a csapatot? Ahogy gondolom, a jelenlegi j&aacute;t&eacute;ktud&aacute;som alapj&aacute;n Silver 3-5 k&ouml;z&ouml;tt mozogn&eacute;k. Addig egy kis inform&aacute;ci&oacute; r&oacute;lam:\r\n\r\n - Kedvelt role: jungle &eacute;s support, ritk&aacute;bban ADC. Midet &eacute;s topot nem v&aacute;llalom rankeden, csak ha musz&aacute;j.\r\n - Sokat wardolok (persze nem egy dia/master/challenger j&aacute;t&eacute;koshoz m&eacute;rve, hanem div&iacute;zi&oacute;n bel&uuml;l)\r\n - Viszonylag kev&eacute;s hős&ouml;m van (jelenleg 20 vagy 21) (egy hibaok m&aacute;ris van :D )\r\n - A csapat&eacute;rdek, a csapat min&eacute;l jobb helyzet&eacute;nek biztos&iacute;t&aacute;sa a fontos sz&aacute;momra (ward, objective control)\r\n- Ha van pink ward a p&aacute;ly&aacute;n, azt nagy es&eacute;llyel &eacute;n pakoltam le\r\n - Nem vagyok technik&aacute;s j&aacute;t&eacute;kos (igaz&aacute;b&oacute;l kicsit merev mozg&aacute;som van, ez lelki okokra vezethető vissza. Ez vissza&uuml;t a bill+eg&eacute;r kezel&eacute;s&eacute;ben is.)\r\n - Botok ellen szoktam gyakorolni j&oacute; p&aacute;rszor (pl. &uacute;j hős kipr&oacute;b&aacute;l&aacute;sa, item szettek hat&eacute;konys&aacute;ga)\r\n\r\n[Profil a LolKingen](http://www.lolking.net/summoner/eune/41060005#profile)\r\n(itt megtal&aacute;lj&aacute;tok a r&uacute;n&aacute;kat &eacute;s a masteryket is - animerajong&oacute;k a mastery oldalak elnevez&eacute;s&eacute;ből ki is tal&aacute;lj&aacute;k, melyik champekhez tartozik az az oldal ;) )\r\n\r\nElőre is k&ouml;sz&ouml;n&ouml;m a v&aacute;laszotokat! A mastery oldalakhoz majd magyar&aacute;zatot adok, ha valami nem tiszta.","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T07:36:23.242+0000","up_votes":2,"down_votes":2,"body":"Első és legfontosabb szabály : WARDOLJ, WARDOLJ, WARDOLJ JA ÉS...wardolj... MINDIG upgradeld a trinketet bármilyen poszton is játszol instant lvl 9, ha emiatt 1 perccel később jön össze valami item, akkor is. Ha supportot játszol, ne érd be a sightstonnal, hanem amint eltüntetik a pink wardod, azonnal pakolj ki újat, nekem volt olyan meccsem, hogy 6 ot vettem, de a 3-4 az rendszeres, és LCS mennyiségű wardot pakolok le :)\n\nMÁSDOIK SZABÁLY:   Mindig nézd a minimapot, ezt mondjuk könyebben elsajátithatod, ha junglet vagy supportot játszol sokat, ott ráébredsz a fontosságára is.\n\nHarmadik szabály : Vagy van türelmed/tehetséged/kitartásod stb megtanulni last hitelni tisztességesen, ez esetben automatice feljebb fogsz jutni, vagy  ha nincs,ahogy pl nekem sem, ez esetben ha lehet ne játssz adc t, midre és topra meg vigyél olyan karikat, amikkel a hülye is tud jól farmolni,  meg harcolni is, lásd Annie, Vladimir, Morde, Malhazar, Shyvana, Heimerdinger, Malphite.\n\nNegyedik szabály : Sose szidj másokat, ha pl campel az enemy jungler, és meghaltál, az a te hibád, mert nem wardoltál rendesen és/vagy pusholtál, szoval máris az első pontnál vagyunk.  + ha sokat gankelnek, gondolj arra, hogy ezáltal mekkora előnybe kerül a csapatod, ha nem halsz le folyamatosan, hiszen ezáltal a ti junglereteknek a többi lane kb szabad préda :)","replies":[{"poster":"Sgt Stonebridge","date":"2015-06-29T08:51:35.179+0000","up_votes":1,"down_votes":1,"body":"Ez a wardolás és lasthitelés a 2 legnagyobb idiota bronz-silveres sztereotípia (mint látom teis 1500 meccsből vagy silver4es), nyilván jobb ha wardolsz és jól lasthitelsz de ennek a 2 dolognak nemsok köze van ahhoz hogy ott vagy ahol, a sok idióta ingame döntésnek van hozzá a legtöbb köze, de ezt már leírtam.","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T10:04:36.215+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jesseyo,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=00030000,timestamp=2015-06-29T08:51:35.179+0000)\n>\n> Ez a wardolás és lasthitelés a 2 legnagyobb idiota bronz-silveres sztereotípia (mint látom teis 1500 meccsből vagy silver4es), nyilván jobb ha wardolsz és jól lasthitelsz de ennek a 2 dolognak nemsok köze van ahhoz hogy ott vagy ahol, a sok idióta ingame döntésnek van hozzá a legtöbb köze, de ezt már leírtam.\n\nLátom azért mert platos vagy és gondolom játszol 5 szezonja mindjárt jo nagy a mellény, ami mellé a játéktudás már lehet fele akkora sincs :)\nAzért vagyok ott ahol, mert tavaly oktoberben kezdtem játszani,s ahogy kell megjártam a bronze 5 öt is, majd miután elkezdett a játéktudásom fejlődni is kellett vagy 1000 meccs hogy rájöjjek, azzal nem segitek a csapaton, ha felidegesitem magam hogy minden 2. meccsen afk van, vagy hogy miért 0-15 a topos Pantheon vagy 10 perc alatt 0-8 a mides Ahri, stb :)\n\nÉs mert nem játszom carry hosoket, de attól még hidd el vannak nekem is platos ismerőseim, akik  nemelfogultam látják a hülyeségeim is, és egyöntető vélemény, hogy a supportot megjátszom olyan szinten, szoval nagy valsoszinuség szerint jobban mint te :)\n\nJa igen, még vmi, duozni is ritkán szoktam , mert nem veszem annyira vérkomolyan a dolgot, pedig néhány hete össeálltunk valakivel 15-20 meccs erejéig és láss csodát pár nap alatt silver 5 bol silver 1, aztán nekiálltam szolozni és jott megint a s4  ill most a s3.\n\nÉs lehet kell még 100 vagy 150 meccs a goldhoz, de attól még ugy gondolom, a nagykepu stilisodnak miszerint a wardolás meg a last hit bullshit nem biztos hogy helye van :)","replies":[{"poster":"Szabadkőműves","date":"2015-06-30T15:27:03.366+0000","up_votes":3,"down_votes":0,"body":"Lényegében ezért nem megy sok ember feljebb és tartanak a meccsek azon a szinten ahol most vannak, inkább egymást méregetitek minthogy ép érvekkel támasztanátok alá ha úgy vélitek valami nincs rendjén. Értsd azt, hogy a probléma az, hogy az emberek inkább szeretnek mást kritizálni mint a célra összpontosítani.\n\nVagányak az ötletek a tieddel egyet értek Marginaldefeat DE ez csak akkor működik ha a csapatod is hasonlóan gondolkodik mint te, és ezen a szinten ahol én meg a kolléga vagyunk aki feltette a kérdést az emberek a killekre mennek, le farmolják az adc farmját stb stb... \n\nVagány de a mi szintünkre a legjobb megoldás még mindig a duo ranked, ha jól össze tudsz játszani a haveroddal és adc vagy akkor sokkal több az esélye de még így is sokban függ a csapattársaktól..","replies":[]},{"poster":"Sgt Stonebridge","date":"2015-06-29T10:52:19.203+0000","up_votes":1,"down_votes":1,"body":"Nyilván a supportot diamondos szinten játszod, de silver5ös vagy supportként, reális. Ha meg duoban felmentél silver1ig utána meg soloba lezuhantál silver5be az azt jelentette hogy a tag akivel duoztál valszeg lecarryzte neked az összes meccset ( boostolt téged) , és miután soloban játszottál visszaestél silver5be ahova a játéktudásod alapján tartozol. A wardolás és lasthit meg egyáltalán nem bullshit, aki silverben van nem azért van silverben mert nem farmol percenként 12-t és nem vesz minden backnél 1 wardot, hanem mert baromságokat csinál folyamatosan. (Btw nem nézem le a silver-bronzosokat, totál nemérdekel holvagy elhiheted, egyszerűen csak idegesítő hogy valaki tanácsot kér és olyan emberek adnak tanácsokat akik alapjáraton azt sem tudják mit beszélnek, pl a tag bronz1es és 1 silver5ös tag ad tanácsot aki valszeg ugyanugy játszik mint ő )","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T11:18:08.142+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jesseyo,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=0003000000000000,timestamp=2015-06-29T10:52:19.203+0000)\n>\n> Nyilván a supportot diamondos szinten játszod, de silver5ös vagy supportként, reális. Ha meg duoban felmentél silver1ig utána meg soloba lezuhantál silver5be az azt jelentette hogy a tag akivel duoztál valszeg lecarryzte neked az összes meccset ( boostolt téged) , és miután soloban játszottál visszaestél silver5be ahova a játéktudásod alapján tartozol. A wardolás és lasthit meg egyáltalán nem bullshit, aki silverben van nem azért van silverben mert nem farmol percenként 12-t és nem vesz minden backnél 1 wardot, hanem mert baromságokat csinál folyamatosan. (Btw nem nézem le a silver-bronzosokat, totál nemérdekel holvagy elhiheted, egyszerűen csak idegesítő hogy valaki tanácsot kér és olyan emberek adnak tanácsokat akik alapjáraton azt sem tudják mit beszélnek, pl a tag bronz1es és 1 silver5ös tag ad tanácsot aki valszeg ugyanugy játszik mint ő )\n\nTovábbra se vok silver 5 ös, sem 1500 gamem nincds de azért hazudozz csak tovább :)\nJaja lecarryzte, ezért volt az, hogy ha soloban jatszik akkor neki is 50% a gyozelmi aránya ahogy nekem is, és o is silveres :) Csak tudod más esély van a gyozelemre, ha már ketten tudnak játszani a csapatbol, és max 2 hozzád 3 nagyképu de annal kisebb tudásu van :)\nJa de nem is mindenki hulye csak te vagy a helikopter, a platos barátaim is egytol egyik akik szerint egyontetuen siman jatszom plat szinten a supportot :) És elég sok hozzád hasonlo nagyképu szarral jatszottam mar 1 vs 1 et silvereskent meg normalt is hidd el, és a többségnek elkentem a száját :) Tudod hiaba vagy jo support, ha mondjuk az adc d 20 perc alatt 50 farm ugy hogy kutya se zavarja, vagy mondjuk nyeritek meg a botot mikozben masik 2 lane feedel, de ezt neked hiaba is magyarázom :)","replies":[{"poster":"Sgt Stonebridge","date":"2015-06-29T13:28:13.146+0000","up_votes":2,"down_votes":1,"body":"Rendben tehár 1354 meccsből vagy silver4es , a különbség hatalmas. És egyszerűen te sem érted meg de nemis lehet sehogy a hozzád hasonlóknak elmagyarázni ha te ennyi meccsből silver4es vagy supportként akkor TE NEM PLATINA SZINTEN JÁTSZOL HANEM SILVER4 SZINTEN, attól hogy 1 normal gamen elkapsz valakit threshel és a haverod aztmondja ezt a platos is így csinálná attól függetlenül te NEM PLATINA SZINTŰ PLAYER VAGY MERT 1354 MECCSBŐL SILVER4BEN VAGY. Ezt hihetetlen nehéz megérteni és az ittlévő társaság 90%ának nem megy és ezért van ott ahol van mert csak a team a szar mert neked aztmonda a haverod h platos vagy és mégis ott rohadsz silverben.. valszeg ha kiboostolnának platba 2esével buknád a diviziokat amíg silveres nem leszel mivel odavaló vagy az a szinted... Amugy ugy csináltok mintha ez olyan %%%%%%sokat jelentene hogy ki goldos meg platos meg silveres, de nem jelent semmit, mindenki leszarja, a haverjaid gondolom nem azért játszanak veled mert ilyen-olyan divizioban vagy, akikkel meg random behív totál leszarják, ha feljebb akarsz jutni akkor ne azt nézd hogy épp milyen divizioban játszol meg hogy a leesin mit csinál melletted hanem próbálj meg fejlődni és akkor feljebb is fogsz jutni.","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T13:37:16.352+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jesseyo,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=000300000000000000000000,timestamp=2015-06-29T13:28:13.146+0000)\n>\n> Rendben tehár 1354 meccsből vagy silver4es , a különbség hatalmas. És egyszerűen te sem érted meg de nemis lehet sehogy a hozzád hasonlóknak elmagyarázni ha te ennyi meccsből silver4es vagy supportként akkor TE NEM PLATINA SZINTEN JÁTSZOL HANEM SILVER4 SZINTEN, attól hogy 1 normal gamen elkapsz valakit threshel és a haverod aztmondja ezt a platos is így csinálná attól függetlenül te NEM PLATINA SZINTŰ PLAYER VAGY MERT 1354 MECCSBŐL SILVER4BEN VAGY. Ezt hihetetlen nehéz megérteni és az ittlévő társaság 90%ának nem megy és ezért van ott ahol van mert csak a team a szar mert neked aztmonda a haverod h platos vagy és mégis ott rohadsz silverben.. valszeg ha kiboostolnának platba 2esével buknád a diviziokat amíg silveres nem leszel mivel odavaló vagy az a szinted... Amugy ugy csináltok mintha ez olyan %%%%%%sokat jelentene hogy ki goldos meg platos meg silveres, de nem jelent semmit, mindenki leszarja, a haverjaid gondolom nem azért játszanak veled mert ilyen-olyan divizioban vagy, akikkel meg random behív totál leszarják, ha feljebb akarsz jutni akkor ne azt nézd hogy épp milyen divizioban játszol meg hogy a leesin mit csinál melletted hanem próbálj meg fejlődni és akkor feljebb is fogsz jutni.\n\nIgen mindenki szerint aki látott már 50+ ember gold vagy plat szinten supportolok de szerinted aki még sosem láttál  és fingod sincs hogy látatlanban itélkezel grat :D :D :D Ez most olyan mintha beirnam hogy márpedig te 10 év alatt végezted el a 8 osztályt biztosan az utána következő 4 et meg 6 alatt, mert ilyeneket irsz :) És sosem mondtam azt hogy plat szinten játszom, a junglet talán eljátszom egy low gold szinten, a suppot meg szerintem egy high gold vagy low plat összes töbi posztot igen silvereskent jatszom, én is tudom :) de mint mondtam az is biztos véletlen, hogyha haverral duozunk akkor 20 bol 20X nyerjuk a bot lanet igen, rankeden :)","replies":[{"poster":"HDaniel","date":"2015-06-29T13:53:51.094+0000","up_votes":2,"down_votes":0,"body":"Tényleg irritáló ha valaki a rangra veri magát XD Gold 5 fiorát és yi-t is csaptam már szét veigarral, zileannal is 1v1-ben... akkor még unranked voltam, igaz most is csak  bronze 1 vagyok XD.","replies":[{"poster":"Tanners","date":"2015-06-29T21:38:56.301+0000","up_votes":1,"down_votes":0,"body":"Én az egyik barátommal elvertünk egy full platos botlanet :D ugy hogy én bronz 1 es vagyok a barátom meg silver5ös. De lehet ,hogy boostol platosok voltak.","replies":[]}]},{"poster":"Sgt Stonebridge","date":"2015-06-29T15:04:45.738+0000","up_votes":1,"down_votes":1,"body":"Hihetetlen hogy nem érted meg TE SILVER4 ES VAGY AZAZ SILVER4ES SZINTEN JÁTSZOL, ha platos szinten játsz%%%% supportal akkor fognádmagad bemennél supportal és feljutnál platig és akkor platos szinten játsz%%%% vele, máskülönben te honnan a halálból tudod hogy milyen szinten játszol. Nem az van hogy egyáltalán nem rankedezel vagy hogy van 13 meccsed rankeden , hanem az van hogy van 1354 meccsed rankeden abból %%%%%%sok support game és fix 50%os winraten állsz ami totálisan azt jelenti hogy te oda való vagy, SILVER3-4-5 ÖS SZINTEN JÁTSZOL, FŐLEG SUPPORTAL. A hasonlatod meg totál szar, ez olyan mintha odaadnám neked a bizonyitványom hogy full 2essel végeztem el a középiskolát de a haverjaim aztmondták hogy amugy mindenből5ös voltam anyira vágtam mindent","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T15:40:11.065+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jesseyo,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=00030000000000000000000000000002,timestamp=2015-06-29T15:04:45.738+0000)\n>\n> Hihetetlen hogy nem érted meg TE SILVER4 ES VAGY AZAZ SILVER4ES SZINTEN JÁTSZOL, ha platos szinten játsz%%%% supportal akkor fognádmagad bemennél supportal és feljutnál platig és akkor platos szinten játsz%%%% vele, máskülönben te honnan a halálból tudod hogy milyen szinten játszol. Nem az van hogy egyáltalán nem rankedezel vagy hogy van 13 meccsed rankeden , hanem az van hogy van 1354 meccsed rankeden abból %%%%%%sok support game és fix 50%os winraten állsz ami totálisan azt jelenti hogy te oda való vagy, SILVER3-4-5 ÖS SZINTEN JÁTSZOL, FŐLEG SUPPORTAL. A hasonlatod meg totál szar, ez olyan mintha odaadnám neked a bizonyitványom hogy full 2essel végeztem el a középiskolát de a haverjaim aztmondták hogy amugy mindenből5ös voltam anyira vágtam mindent\n\n\nJajajaja persze mesélj még :D :D :D :D  Suporttal kurvára nem 50% a win ratem, hanem több egyrészt, nem is kevéssel, másrészt pedig beszéljenek helyettem a számok, mert én tényeket tudok irni a te semmimondo handabandázásod helyett, szoval alljanak itt a mostanaban legkedveltebb supportom számai :\n\nÁTLAG 100 MECCSEN 4.00 FELETT KDA, ÁTLAG 19 ASSIST ÉS 46 WARD/ MATCH ÁTLAGBAN KÖZTE 4 PINK ÉS 100% BAN PINGELEK FIGYEMEZTETEM A CSAPATTÁRSAKAT ÉS VEZETNI PROBALOM OKET. \n\nDe biztosan ezek a számok azt mutatjak hogy bronz/silver szinten supportolok csak mindig challenger adc m van :D :D :D :D","replies":[{"poster":"Sgt Stonebridge","date":"2015-06-29T15:54:05.947+0000","up_votes":2,"down_votes":1,"body":"ember az hogy 1300+ meccsből silver4es vagy az mi a %%%% ha nem tény? de most komolyan AZ MI HA NEM TÉNY? mert itt az egyetlen tény az hogy töménytelen meccs után te SILVER4ES VAGY nem platinás hanem silveres, ha te platinás szinten játszol akkor MIÉRT NEM VAGY PLATINÁS? DE KOMOLYAN EZT VÁLASZOLD MEG, és ne az legyen hogy szar a team mert én amikor smurfoltem silver/goldban meccset alig tudtam loseolni akármit pickeltem és akármelyik platos haverom smurfol silveresek között megnyerni a meccsek 90%át\nszóval erre tényleg kiváncsi lennék ha te platos vagy akkor miért vagy silverben 1300 meccs után?\nez ugyanugy vonatkozik az ilyen mmateekre is ha te akkora vadállat vagy és mindenkit összeversz és minden \"elohell\" és sehol senki nemtud játszani akkor TE MIÉRT NEM VAGY OTT? miért van az hogy bronz5ből eltudsz menni 1 darabig és ott megállsz? komolyan miért van az? odáig szerencséd volt ott meg vége a szerencsének eddig tartott puff majd pár hét mulva megint lesz szerencse addig meg szivas van a noobokkal -,-' ?\nfurcsamód amikor talán még tavaly a Krepo csinált 1 smurfot és unrankedből ment challangerbe akkor megnyerte a goldos/silveres meccsek 99%át SUPPORTKÉNT, nyilván neki is mindig szupersztár adcje volt nem random silveres arc, mégis megtudta nyerni majdnem mindegyik meccsét, de azis lehet hogy csak neki mindig szerencséje volt :)","replies":[{"poster":"Kukendusz","date":"2015-10-04T06:40:32.758+0000","up_votes":1,"down_votes":0,"body":"Hallod %%%% sokat röhögtem ezen a vitán  :D\nkomolyan mondom az ilyen %%%%%% bronze vagy silveresek milyatt éri meg feljönni ide xD","replies":[]}]},{"poster":"Kukendusz","date":"2015-10-04T06:42:11.169+0000","up_votes":1,"down_votes":0,"body":"Veszek 1 sightstone le rakok a kezdőre 200 at  és hoppá 200 ward xD","replies":[]},{"poster":"SS Pappino","date":"2015-06-30T20:04:43.504+0000","up_votes":1,"down_votes":0,"body":"Nekem van egy silveres accom, és lejjebb akarok vele esni. Mindent próbáltam már, akármilyen szart pickeltem, stompoltam vele (gangplank, Mundo, WW), mert annyira rosszak ott az emberek (silver 4ről van szó). Tudnál tanácsot adni, hogy hogyan essek lejjeb a ranglétrán? \n\nElőre is köszi!","replies":[]},{"poster":"panzergodx","date":"2015-06-29T15:42:31.537+0000","up_votes":1,"down_votes":1,"body":"az az 1400 mecs meg csak véletlen van ott xd","replies":[]}]}]},{"poster":"mmateexd","date":"2015-06-29T14:45:32.439+0000","up_votes":1,"down_votes":0,"body":"Jesseyo minden fórumon lévő bronzos/silveresnek megakarja magyarázni hogy igenis neki van igaza mert ő platos xD közben meg a Plat divisio is egy nagy elohell ,ott sem tudnak játszani sőt tele van boostolt emberkékkel :) \n\nNa de ha a platos barátaid azt mondják hogy vagy olyan jó support mint amivel ők szoktak találkozni rankedon akkor nincs gond :D Azt meg hogy Jesseyo mit mond az ne érdekeljen mert mondom szegény gyerek nem tudja mit beszél :)","replies":[]}]}]}]}]}]},{"poster":"M4dr4c","date":"2015-06-29T11:57:33.108+0000","up_votes":1,"down_votes":0,"body":"Ez csak egy bizonyos szint felett igaz. Míg valaki nem tud 40 lasthitet összeszedni 20 perc alatt és az egész meccs alatt lerakott 2 wardot addig bizony sok köze van hozzá, hogy veszített. Ha már megy neki normálisan onnan már tényleg kezd csökkenni a fontossága.","replies":[]}]}]},{"poster":"M4dr4c","date":"2015-06-28T22:20:53.767+0000","up_votes":2,"down_votes":0,"body":"Alapvetően ez egy csapatjáték, sose arról szól, hogy valaki egyedül lehozza a játékot. Nem mondom, hogy nem történik meg időről-időre, de nem ez a jellemző.\n\nNem láttam semmi extra rosszat vagy kirívót a buildjeidben, igaz a nagy része ARAM volt. :D Abban pedig, hogy mennyit wardolsz, ami kb jónak is tűnik, az se mindegy, hogy hova. Azt pedig nem látom a statokból, de ha nézel streameket akkor egész gyorsan megtanulhatod az alap helyeket, ha még nem lenne meg.","replies":[]},{"poster":"RootOfOrigin","date":"2015-06-29T12:52:58.455+0000","up_votes":1,"down_votes":0,"body":"Köszönöm mindenkinek a segítséget! :)  Egy-két gondolatot még megosztok:\n\nA wardolással és a minimapnézéssel nincs különösebb gond. Lockolt kamerával játszom, és ezért gyakran figyelem a minimapot. Wardscore alapján a wardolással sincs gond - átlagosan 19-20 wardot teszek le meccsenként. Lanerként persze kevesebbet, support/junglerként többet.\n\nA ranged karaktereket szeretem, viszonylag kevés melee karakterrel játszom.\n\nKedvenc választásaim (normál játékkal együtt):\n- Top: Quinn, Hecarim, Morgana (ha nem egy aggro kari az ellenfelem)\n- Jungle: Sejuani (örök kedvenc :D), Gragas, Ekko (Cinderhulk vagy Runeglaive - utóbbi nagyon jó lett neki sztem)\n- Mid: Azir, Morgana\n- ADC: Sivir, Caitlyn, Graves (nincs meg, de freeként jól toltam vele)\n- Support: Morgana, Alistar, Leona, Sona\n\nSzeretek néha kreatívkodni (pl. AP Miss Fortune, Kalistának Mercury Treads cipőnek, AD caster Ashe), de szigorúan rankeden kívül, mert nem biztos, hogy működni fog rankeden.","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T15:37:32.807+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sunyikám,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=0007,timestamp=2015-06-29T12:52:58.455+0000)\n>\n> Köszönöm mindenkinek a segítséget! :)  Egy-két gondolatot még megosztok:\n> \n> A wardolással és a minimapnézéssel nincs különösebb gond. Lockolt kamerával játszom, és ezért gyakran figyelem a minimapot. Wardscore alapján a wardolással sincs gond - átlagosan 19-20 wardot teszek le meccsenként. Lanerként persze kevesebbet, support/junglerként többet.\n> \n> A ranged karaktereket szeretem, viszonylag kevés melee karakterrel játszom.\n> \n> Kedvenc választásaim (normál játékkal együtt):\n> - Top: Quinn, Hecarim, Morgana (ha nem egy aggro kari az ellenfelem)\n> - Jungle: Sejuani (örök kedvenc :D), Gragas, Ekko (Cinderhulk vagy Runeglaive - utóbbi nagyon jó lett neki sztem)\n> - Mid: Azir, Morgana\n> - ADC: Sivir, Caitlyn, Graves (nincs meg, de freeként jól toltam vele)\n> - Support: Morgana, Alistar, Leona, Sona\n> \n> Szeretek néha kreatívkodni (pl. AP Miss Fortune, Kalistának Mercury Treads cipőnek, AD caster Ashe), de szigorúan rankeden kívül, mert nem biztos, hogy működni fog rankeden.\n\nNo offense, de a 19-20 ward szerintem mocskosul kevés, én lanerkent teszek le átlagban 25 öt, junglerkent vmivel többet supporkent meg 45-50 et.","replies":[{"poster":"Kukendusz","date":"2015-10-04T06:58:56.302+0000","up_votes":1,"down_votes":0,"body":"Jajj %%%%i már megint a hülye wardjaidal jösz, oké oké kell a ward de ha semmit se tudsz kezdeni a champeddel hiába van 40 wardod","replies":[]}]}]},{"poster":"Marginaldefeat","date":"2015-06-30T11:09:04.446+0000","up_votes":1,"down_votes":0,"body":"Leonát is szeretem, meg most már Braumot is, de nem hiszem hogy kifogás hogy az adc n mulik vele sokminden. Én hiába csinalok pro engaget, ami 100% biztos hogy double kill lenne az adc nek, ha ő közben farmvillet játszik, és még jo esetben esetleg el tudok flashelni, rossz esetben meghalok.\nVagy mondjuk annyi de annyi eset, ami szintén sima double lenne, de az adc egész egyszeruen baszik a healt használni majd miután meghaltam, elhasználja magára... Persze már későn... És sorolhatnám. És hiaba mondod, hogy nem csak a supp dolga wardolni, ha silverben 100% hogy a supporton kivul senki se fog egy darab ward nem sok, annyit se lerakni, ha 100 bol 1 jatekos upgradelni a trinketjét, már sokat mondok, de ha nem én vok a support, akkor 60-70% ban még sightstonet se vesz aki supportol....  Én úgy gondolom a statjaim azért mutatnak valamit, meg az a tény is, hogy ha duo botot megyek az adc ismerőssel, akkor 100% ban megalázó modon elverjuk az enemy botot, mégpedig azt, hogy nem silver szinten supportolok.\n\nMásrészt pedig lehet jönni a gamek nagy számával, csakhogy kb el lehet osztani ezt 10 el, ugyanis kb 150 gammel ezelőttig azért nem jutottam feljebb, mert leálltam vitatkozni a hülyékkel, meg kiakadtam folyton ha mondjuk 0-10 es top vagy mid laner van és még ő anyázza a csapatot, stb. És hidd el, lehet feljebb természetes egy csomó dolog, de mondom az itteni adc k 50% farmolni se tud, meg ha rájuk rakom pl a Janna shieldet elmagyarázom neki normálisan mit kéne csinalnia de neeeem 100 bol akkor se használna fel tradelésre egyszer sem....","replies":[{"poster":"ScreamForMeBaby","date":"2015-07-01T05:07:09.166+0000","up_votes":1,"down_votes":0,"body":"Szóval akkor akik feljutnak azoknak szerencséjük volt vagy csupán fekete mágiára hagyatkoztak?:) Egyébként itt is a társaidra fogod a dolgot. \"Én jól mentem be, de ők rosszul/nem követtek.\" Fel kell mérned a helyzetet és ha az adc-d fosik, nem rambózol. Minden szituáció más, panta rhei.\n\nNem mellesleg az enemy adc is ugyanolyan életképtelen, mint a tiéd, de nektek legalább jó supportotok van, elvileg. Szóval nem értem a problémát.","replies":[]}]},{"poster":"SS Pappino","date":"2015-06-30T20:18:23.828+0000","up_votes":1,"down_votes":0,"body":"Játssz vele ------> {{champion:11}} \nTP/Smite\nfull attack speed rúnák\njungle item: {{item:3710}} \nFarmolás 6osig (ha easy a gank, akkor gankelj), onnantól meg elkószált ellenfelek megöléséből elstompolod a gamet.\nitem build: {{item:3710}} {{item:3006}} {{item:3153}} {{item:3142}} {{item:3031}} hatodik itemnek amit csak akarsz.\n\nSok sikert az Idézők Szurdokában!","replies":[]},{"poster":"Marginaldefeat","date":"2015-06-30T15:37:09.749+0000","up_votes":1,"down_votes":0,"body":"Pontosabban a duo ranked egy NAGYON JOL ISMERT ÉS TUTI JÓ JÁTÉKOSSAL :)\nMert volt olyan, hogy felvettem vkit ( vagy ő vett fel) egy jól sikerült meccs után, aztán mikor duóztam vele csodálatosat trollkodott/ más szerepben siralmas teljesitményt nyujtott :) És ugye duózásnál magasabb az ellenfelek átlag MMR je.","replies":[]},{"poster":"Galvin Flintmage","date":"2015-06-30T12:33:41.486+0000","up_votes":1,"down_votes":0,"body":"1.: próbálj minden Lane-en minimum 2 karaktert kiismerni, hogy ha arra a lane-re kerülsz akkor magabiztosan pickelhesd. A kedvenc role-odon legyen körülbelül 5 karaktered.\n2.: Próbálj olyan hősöket hozni, akiki nagyon jók teamfightban (Én Galio-val jutottam el plat-ig, utána viszont könnyen kijátszható)\n3.: Ha nem meta champ-et hozol, azzal meglepheted az ellenfelet. Nem tudja mennyit sebez X és Y képességed\n4. Normálozz (ez az én egyedi módszerem. Ha elég tapasztalatot szerzel, feljebb tudsz jutni. Kb 500 normál winnél el lehet érni gold-ot)","replies":[]},{"poster":"Marginaldefeat","date":"2015-06-29T16:16:08.876+0000","up_votes":1,"down_votes":0,"body":"Akkor még egyszer, hátha menni fog :)\n\nÁTLAG 100 MECCSEN 4.00 FELETT KDA, ÁTLAG 19 ASSIST ÉS 46 WARD/ MATCH ÁTLAGBAN KÖZTE 4 PINK ÉS 100% BAN PINGELEK FIGYEMEZTETEM A CSAPATTÁRSAKAT ÉS VEZETNI PROBALOM OKET.\n\nIgazi bronz support szint igazad van bocs :( :( :(","replies":[{"poster":"ScreamForMeBaby","date":"2015-06-30T05:20:27.323+0000","up_votes":1,"down_votes":0,"body":"Jómagam silver5-ből mentem fel plat5-ig, főleg supportokkal. Az, hogy az adc-den múlik, béna kifogás. A wardolás fontos, igen _( de tényleg, és nem csak a supportok dolga wardolni, kedves ad-carryk)_. De csak ezzel nem fogsz megnyerni egy meccset. Helyzetfelismerés, jó engage, etc. Egy kretén adc-t is el tudsz feedeltetni ha elég jó vagy, onnantól meg elég ha bőszen csapkodja a jobb egérgombját. \n\nNyilván idegesítő mikor kioktatnak, de azzal sose fogsz feljebb jutni, hogy oda képzeled magad. Ha azt hajtogatod magadban, hogy te jó vagy DE x-y okok miatt nem sikerül, csak magadat hátráltatod, mivel nem igaz. Vannak hullámvölgyek de ha huzamosabb ideig nem jutsz feljebb akkkor biza' elérted a képességeid csúcsát és ideje feljeszteni magadon.\n\nBtw, látom, hogy szereted Sonát és Jannát. Tudom, hogy élvezetes velük játszani de mielőtt papír suppot pickelsz, nézd meg a csapatod. Tanknak lennie KELL egy csapatban, különben orosz rulett az egész.","replies":[]}]},{"poster":"Marginaldefeat","date":"2015-06-29T15:46:06.488+0000","up_votes":1,"down_votes":0,"body":"Mondja egy kemény 1 szinttel felettem levő akinek mellesleg szarabb statjai meg kda ji vannak mint nekem biztosan véletlenul :D :D :D :D D:","replies":[]},{"poster":"mmateexd","date":"2015-06-29T10:22:35.116+0000","up_votes":1,"down_votes":2,"body":"Az a baj hogy supportal nem nagyon tudsz kijutni a rákból...nem lehetetlen és sokan ki tudnak, viszont ha kapsz egy rossz adc-t aki nem nagyon játszik össze a supportal akkor onnan már csak a feed megy.  Szerintem jungelt kellene erőltetned mert gankelsz 2-3 akkor nagy eséllyel meg is nyerted az illetőnek a lanet. Próbálkozz jungelban egy {{champion:80}} {{champion:62}} {{champion:254}}  ezekkel azért effektíven jól tudsz gankelni és ha nem is lesz kill de tuti hogy flashelni fog.\n\nViszont ha supportot pickelsz akkor nem muszáj minden bokrot wardolni :D Igazából annyi a varázsa hogy a draket majd később a Baront mindig pinkel wardold mert ha elkezdik szedni akkor azt észreveszitek. Saját jungelbe 1-1 ward elég, folyókba meg próbáljátok mindig elhozni a sutyerákot. Persze a saját lanet mindig wardold.","replies":[{"poster":"PvPSajtyyyPvP","date":"2015-06-29T14:21:45.925+0000","up_votes":1,"down_votes":0,"body":"Tudod ... Ha support vagy az nem azt jelenti hogy az ADC-d mellett kell játszanod... Ha láttod hogy a bot esélytelent akkor felmész midre hookolsz 1-et vagy vmi, megnyerted midet ... felmehetsz topra is roamolni. Azonkívűl egy feed assasinnal ( akinek megnyered a lane-ét, hookolsz neki egy jót megmented a lanternelez csak 1 példa a sok közül) nagyon könnyű kihasználni a jó wardolást.","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T15:41:38.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PvPSajtyyyPvP,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=00050000,timestamp=2015-06-29T14:21:45.925+0000)\n>\n> Tudod ... Ha support vagy az nem azt jelenti hogy az ADC-d mellett kell játszanod... Ha láttod hogy a bot esélytelent akkor felmész midre hookolsz 1-et vagy vmi, megnyerted midet ... felmehetsz topra is roamolni. Azonkívűl egy feed assasinnal ( akinek megnyered a lane-ét, hookolsz neki egy jót megmented a lanternelez csak 1 példa a sok közül) nagyon könnyű kihasználni a jó wardolást.\n\nÉs szerinted nem szoktam ezt csinalni ? :) Foleg mikor látom hogy az adc m totál reménytelen eset, és bármit csinalok feedelni fog és  lesz 50 vs 250 famrja . de midre roamolva sikerült felfeedeltetni a mid lanerunket legalább :)","replies":[]}]}]},{"poster":"Brăd","date":"2015-06-29T11:59:48.804+0000","up_votes":1,"down_votes":0,"body":"A megoldás egyszerű: Solo Lane ,avagy top és mid (én az előbbit javaslom).\nSzerezd be a solo lanekre való legidegesítőbb champion-öket:\nTop:\nYorick ,Renekton ,Quinn ,Gnar ,Vlad ,Nasus ,Kennen ,Rumble...\nMid:\nVlad ,Lux ,Cho' Gath ,Azir ,Fizz ,Kayle...\nTanulj meg velük játszani ,idegesítsd velük szarrá az enemy lanert = könnyű lane win = sok kill = könnyű carry!\n\nRengeteget wardolj ,figyelj oda a mapcontrollra ,utasítsd ,vezesd a társaid (pingekkel)!\nCsak a legszükségesebb esetben használd a chatet. Legyél néma ,de egyben bölcs ,próbáld a legkevésbé elterelni a saját figyelmedet a játékról!\n\nHallgass valami megnyugtató ,jó háttérzenét ,ha úgy érzed valami felidegesít ,csak figyelj a zenére és rövid időn belül megnyugszol!\n\nVedd poénra a játékot. Szard le mások véleményét ,tedd azt amit jónak látsz ,ne másokra bízd magad. Ne érdekeljen ,hogy vereség ,vagy győzelem ,ha mégis veszítenél ,mond magadnak azt ,hogy \"nem érdekel ,hogy vereség ,a következő majd csak win lesz\"! \n\nA tetteiddel vezesd a csapatod! Ha látod ,hogy tele van idiótákkal a helyzettel kényszerítsd őket ,hogy téged kövessenek.\n\nHa valaki elkezdene trollkodni ne foglalkozz vele és vedd rá a társaid ,hogy ők se tegyék! A troll rövid idő múlva megunja ,vagy ,ha mégsem ,akkor sem érte el a valódi célját (,hogy a csapatod felidegesítse).\n\nSzerezz duo partnert és foglaljatok el valami jó lane kombót (adc-supp ,top-jung)! Utóbbinál vedd rá ,hogy kb. csak téged gankeljen ,így rövid időn belül ti ketten lesztek elfeedelve => könnyű win.","replies":[{"poster":"RootOfOrigin","date":"2015-06-29T13:07:57.573+0000","up_votes":1,"down_votes":0,"body":"Quinnt szeretem topon játszani, csak az a bajom vele, hogy drága az a build, amivel van elég sebzése, és nem hal meg 1,5 másodperc alatt.\n\nÁltalában így szoktam buildelni (teljes build, nem sorrendben vannak az itemek) :{{item:3153}} {{item:3035}} {{item:3071}} {{item:3143}} {{item:3102}} {{item:3111}} \n\nHa több sebzés kell, akkor a Banshee-t lecserélem erre: {{item:3156}} \nHa AD az ellenfelem, akkor a cipőt erre cserélem: {{item:3047}} \nA cipőre pedig Bázisvédőt teszek kiegészítésként. Mostanában rakok neki játék közben egy {{item:3093}} -t, hogy hamarabb meglegyenek a tárgyak.\n\nRankeden egyszer vettem elő eddig, és egy hosszú meccsen nyertem is vele (igaz nem voltak jók a statjaim a végére).","replies":[]}]},{"poster":"Hide Your GF","date":"2015-06-29T08:20:52.593+0000","up_votes":1,"down_votes":0,"body":"Soloq nem a csapatjátékról szól. Kell a csapat, de nem szabad beáldoznod magadat azért, hogy valakit segíts akit nem ismersz és lehet, hogy egy ordas nagy feeder. Ami killt tudsz, hozd el. (Már ha olyan championnel vagy... de soloqban ha haladni akarsz, akkor olyan championnel javasolt játszanod)\n\nHogyha előrejutni akarsz a ranglétrán akkor a következőket javaslom:\n1) Játsz olyan championnel amelyiknek nincs sok skillshotja, így nem is lőhetsz mellé\n2) Játsz op champpel, dzsungelbe: \n1. amumu - ehez azért többé-kevésbé kell egy csapat, de ha full AP-ra buildeled akkor Q-E-R-be kb bárkit megölsz aki nem full tanknak buildeli a champjét \n2. evelynn - AP-ra buildelve, nagyon durva sebzést tud kiosztani az új dzsungeles cuccal, a láthatatlanság miatt pedig könnyen tudsz gankelni lane-ről jőve\n3. xin zhao - early game-ben nagyon durva damaget tol, toronyt is gyorsan pusztítja\n4. rengar - habáár valamivel bonyolultabb champ, mint a fentebb említettek, ha megtanulsz vele játszani, akkor könnyedén tudod hozni a játékot. Level 1-5-ben is életképes gankeket tud nyújtani, level 6 után meg pláne. http://eune.op.gg/summoner/userName=hide+your+gf - de lehet ezt csak azért mondom, mert nagyon rákaptam az utóbbi 1-2 hétben :D\n\nSupport: Nem ajánlok olyan champet amivel bekell ugorj 2v1-be és az ADC-d vagy jön vagy nem. Tehát az olyan champek, mint leona-nautilus kilőve. Őszintén szólva kissebb szinteken, mint ahol te is vagy, szinte akármilyen champ jó amivel jól játszasz. Pl. \n\nLehet, hogy nem annyira látványos, azért nem játszák de alistart tartom az egyik legjobb supportnak. Dupla CC, nulla dmg-et kap, heal... \nBlitzcrank, a sustain champek, közülük is a legjobb: Sona és Nami. Főleg sona, AP-ra buildelve. Nem rossz még morgana, soraka. Tankosabbak közül braum (tuti biztos vagyok benne, hogy mindent belelőnek az ajtódba, miközben a te ad carryd szétkapja őket).\n\nLulut is godtierbe tenném, shield, lassítás, supporthoz képest elég sok DMG, az az ulti...\n\nElég össze-vissza írtam, nincs rendszerezve de azért érthető, most fáradt vagyok ahoz, hogy újraszerkesszem de szivesen válaszolok bármilyen kérdésre (ha eszembejut, hogy visszanézzek, nem szoktam fórumozni, ingame is kérdezhetsz...)","replies":[{"poster":"Marginaldefeat","date":"2015-06-29T08:37:09.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hide Your GF,realm=EUNE,application-id=zRAyEAAl,discussion-id=xFWdLgG3,comment-id=0004,timestamp=2015-06-29T08:20:52.593+0000)\n>\n> Soloq nem a csapatjátékról szól. Kell a csapat, de nem szabad beáldoznod magadat azért, hogy valakit segíts akit nem ismersz és lehet, hogy egy ordas nagy feeder. Ami killt tudsz, hozd el. (Már ha olyan championnel vagy... de soloqban ha haladni akarsz, akkor olyan championnel javasolt játszanod)\n> \n> Hogyha előrejutni akarsz a ranglétrán akkor a következőket javaslom:\n> 1) Játsz olyan championnel amelyiknek nincs sok skillshotja, így nem is lőhetsz mellé\n> 2) Játsz op champpel, dzsungelbe: \n> 1. amumu - ehez azért többé-kevésbé kell egy csapat, de ha full AP-ra buildeled akkor Q-E-R-be kb bárkit megölsz aki nem full tanknak buildeli a champjét \n> 2. evelynn - AP-ra buildelve, nagyon durva sebzést tud kiosztani az új dzsungeles cuccal, a láthatatlanság miatt pedig könnyen tudsz gankelni lane-ről jőve\n> 3. xin zhao - early game-ben nagyon durva damaget tol, toronyt is gyorsan pusztítja\n> 4. rengar - habáár valamivel bonyolultabb champ, mint a fentebb említettek, ha megtanulsz vele játszani, akkor könnyedén tudod hozni a játékot. Level 1-5-ben is életképes gankeket tud nyújtani, level 6 után meg pláne. http://eune.op.gg/summoner/userName=hide+your+gf - de lehet ezt csak azért mondom, mert nagyon rákaptam az utóbbi 1-2 hétben :D\n> \n> Support: Nem ajánlok olyan champet amivel bekell ugorj 2v1-be és az ADC-d vagy jön vagy nem. Tehát az olyan champek, mint leona-nautilus kilőve. Őszintén szólva kissebb szinteken, mint ahol te is vagy, szinte akármilyen champ jó amivel jól játszasz. Pl. \n> \n> Lehet, hogy nem annyira látványos, azért nem játszák de alistart tartom az egyik legjobb supportnak. Dupla CC, nulla dmg-et kap, heal... \n> Blitzcrank, a sustain champek, közülük is a legjobb: Sona és Nami. Főleg sona, AP-ra buildelve. Nem rossz még morgana, soraka. Tankosabbak közül braum (tuti biztos vagyok benne, hogy mindent belelőnek az ajtódba, miközben a te ad carryd szétkapja őket).\n> \n> Lulut is godtierbe tenném, shield, lassítás, supporthoz képest elég sok DMG, az az ulti...\n> \n> Elég össze-vissza írtam, nincs rendszerezve de azért érthető, most fáradt vagyok ahoz, hogy újraszerkesszem de szivesen válaszolok bármilyen kérdésre (ha eszembejut, hogy visszanézzek, nem szoktam fórumozni, ingame is kérdezhetsz...)\n\n\nEgy kis kiegészités  , legalábbis véleményem szerint ez az Amumus dolog nagyon nem igy mukodik azért, szóval ha az ellennél picit is nem hülye jungler van, akkor szanaszét fog szopatni earlybe a counterjungval, másrészt ha Amut hozod, számithatsz rá, hogy rajtad kivul mindenki full dmg re fog menni, mert hogy ugyis te vagy a full tank, aztán meg a tf ba kb olyan gyorsasággal fogsz meghalni, mint egy Sona.\n\n2: Teljesen egyetértek amit a supportokról irtál, viszont kihagytad a god god god tiert, Janna, vele hoztam már le olyan meccseket a csapatnak, mikor az enemybe totál feedelt Kata Riven, Yi, Trynda meg hasonlok voltak és 20-25 kill volt oda az állás :) Arról nem is beszélve, mikor low hp n vagy, és 2-3 enemy veti magát utánad, persze sok esélyuk van a maguk 380-430 as spd jével a te 510-530 asod ellen :)","replies":[{"poster":"Hide Your GF","date":"2015-06-29T09:05:06.410+0000","up_votes":1,"down_votes":0,"body":"Ha választ írsz ne idézz :D Rosszul mutat.\n\nLow szinten nem kell tank, de még high elon sem néha. AP amumunak nem az a lényege, hogy tankoljon, hanem az, hogy (túlzás nélkül) Q-R-E és a squishybb targetek meghaltak, a többi meg már inkább fut tőled, minthogy megprobáljon megölni. Q képességén 70%-os ratio van, az E 50%, ulti 80%, ez 300 ap-val számolva, csak a ratioból 600 damage, erre rájon a 250+175+280, azaz összesen 1305 damage, minusz ami lejön az MR miatt. Counterjungle-el meg nem nagyon lehet szopatni, akkor mész gankelni, elég op a stunja.\n\nJanna tényleg jó, de god tiernek nem mondanám kisszinten mivel ahoz csapat is kell. Hiába tartod életben a teamet ha azok semmit sem csinálnak, akkor már inkább soraka, az 2 másodpercenként healel és nem 8 másodpercenként shieldel.","replies":[]}]}]},{"poster":"Sgt Stonebridge","date":"2015-06-28T22:48:01.698+0000","up_votes":1,"down_votes":0,"body":"A legfontosabb az lehet hogy olyan karakterekkel játsz amiket rendesen ki tudsz használni, lehet hogy unalmasabb velük játszani de oda tudsz figyelni a játék számodra fontosabb dolgaira, pl egy yasuoval miden sokkal jobban odakell figyelni mindenre mint 1 annieval amivel az egyetlen dolog amire oda kell figyelni hogy a másik mit csinál(gyakorlatilag magának farmol a karakter a q-val, jungeles egyszerűen tud gankelni a stun miatt, és nemkell arra figyelned hogy elmisselj valamit mert gyakorlatilag nincs skillshotja). Ilyen karakterek pl, mid/top : annie,vlad jung:pantheon supp:tarik(!!!!) adc:tristana,caitlyn, graves .\nBotra pl hihetetlen jó lenne ha mindenki elfelejtené azt a threst mert bár lcsn jó meg a streamekben is jó, a te kezedben rettenetes, ha be tudnád adni azokat a skillshotokat, jól tudnád használni az e-jét akkor valószínűleg nem low elon lennél, pickeld be a tarickot amivel elbaszni semmit nem lehet, tankos, jó damageja van és olyan egyszerű mint a faék.\n\nA másik az hogy aki bronzban/silverben van az nem azért van ott mert nemtud farmolni/kevés wardot vesz meg az ehhez hasonló idióta közhelyek, hanem azért van ott mert folyamatosan hülyeségeket csinál, hülye döntéseket hoz, ha  egyáltalán hoz akármilyen döntést és azt se followolja végig (ha megnézel akármilyen plat4 feletti playert az nagyrészt ha hoz valamilyen döntést azt végigviszi, nem áll meg gondolkodni fordul vissza tántorog, hanem fogja véggicsinálja aztán max fail  lesz belőle).  Próbáld leszűkíteni az üresjáratokat, döntsd el előre hogy miket buildelsz így nem akkor kell gondolkoznod amikor otthon állsz a bázison miközben már rég kifuthattál volna, ha azt látod hogy a másik elmegy a laneről és egy másik lanen öl akkor ne állj ott és nézz ki a fejedből hanem hozz egy döntést gyorsan (bepusholod a lanet, megpróbálod elhozni a towert / elmész a laned után hátha tudsz még csinálni valamit / elmész egy másik lanera hátha addig ott tudsz csinálni valamit). Ha ugydöntesz hogy roamolsz pl midesként botra akkor azelőtt pushold be a lanedat hogy ne veszíts farmot, mert  ha lemész botra és nemjön össze a gank akkor rosszabbul jársz mintha miden maradtál volna. \n\nHa botlanet játszol akkor azután hogy leszedtétek az első turretet, ne maradj boton, kezdj el a teameddel mozogni grouppoljatok miden, üssétek be azt a turretet is, és ha a waved átlépett a térfeledre/ arra a pontra ért amit a wardolások miatt láthatóan biztonságoasn elérsz akkor menj le és pushold be a wavet, aztán menj vissza a teamedhez mivel az enemyből valakinek le kell majd mennie elvinni azt a wavet vagy elbuknak annyi farmot, ha valaki lemegy akkor próbáljatok valahol fightolni emberelőnyben. Mielőtt fightolni kezdenél nézz rá a minimapra és számold össze hogy TI HÁNYAN VAGYTOK és hogy az enemyből HÁNYAT LÁTSZ (ez fontos, attól hogy nem látod azt a fiddlét valszeg ottvan a fal másik oldalán)\nTöbbek közt fontos rájönni hogy a te rangod a teamedtől SEMMILYEN FORMÁBAN NEM FÜGG. Az hogy milyen rankon vagy csak tőled függ, ha jobban játszol a veled összekerülő playereknél akkor feljebjutsz, lehet loseolsz meccset mert a leesin beírja hogy trololo és meghal 40szer, de a következő 3 meccset már megnyered mert jobb vagy náluk. Ha meg nem jutsz feljebb az azt jelenti hogy nem vagy jobb náluk és ott a helyed amíg jobban nem fogsz játszani, és amikor jobban fogsz játszani akkor pedig feljebb fogsz jutni.\n\nNÉZD A MINIMAPOT FOLYAMAT, ha meglátod valahol a jungelest nyomj oda egy pinget, valószínűleg a csapattársak is odanéznek, esetleg ha gyorsan gépelsz/nincs belőle hátrányod írd be chatbe, ne írj olyan hogy WHY NO SS, és ne őket hibáztasd ezért hanem arra gondolj hogy mekkora hülye voltál hogy nem vetted észre hogy a minimapon hiányzik 1 malphite topprol, gondolhattál volna arra hogy midre fog bemenni. NINCS OLYAN HOGY KS, az a lényeg hogy valaki elvigye a killt mivel abból lesz előny, ne cryolj ha valaki elviszi a killedet, örülj neki hogy megdöglött és nem élte tul 1 hpn.\nÉs ha lehetséges ne flameld a teamedet, attól semmi nem lesz jobb ha megmondod a leesinnek hogy 1 szar és napi 2szer meghuzod az anyját, max annyi fog történni hogy kiafkol esetleg elkezd visszaírni és miközben ír megölik 2x aztán elmegy afkolni.","replies":[]},{"poster":"Sz1ke","date":"2015-06-28T21:29:54.660+0000","up_votes":1,"down_votes":0,"body":"Szerintem megválaszoltad magadnak. :D\n\"túlvállalás, rossz helyzetfelismerés, ügyetlenség, rossz shotcall\"\nEzeken javítasz és jobb lesz, amúgy pedig 1 ember nem fog lecarryzni valószínűleg egy egész meccset.","replies":[]},{"poster":"HDaniel","date":"2015-06-29T13:57:17.306+0000","up_votes":1,"down_votes":1,"body":"Az hogy gold vagy silver vagy mi vagy csak annyit jelent hogy volt egy JÓ TEAM, nem te vagy az istenkirály. Ha pl tryndával topozok, és mindig minden rankeden 1/9/3 statom lenne, de a többiek mégis jók, és win lesz, akkor előbb utóbb  eljutok SILVERBE, GOLDBA de ugye nem azért vagy jó vagyok...","replies":[]}]}