{"poster":"j41r0 the killer","date":"2016-09-30T15:29:15.385+0000","title":"El mundial","subforum":"Esports","up_votes":1,"down_votes":0,"body":"Queria preguntar cuantos van a ver el mundial y a que equipos apoyan.\r\nEs mi primer post en los foros no juzguen {{sticker:slayer-jinx-unamused}} \r\nTambien queria preguntar que opinan del &quot;sorteo&quot; de las skins de tio Riot por acertar a las posiciones del mundial.\r\n\r\n                                                                                        Bueno, me despido hasta el siguiente post, que habr&aacute; m&aacute;s seguro y cuidense {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"martincarp","date":"2016-09-30T20:06:57.160+0000","up_votes":1,"down_votes":0,"body":"Como siempre estoy junto a C9 alentándolos, gritando cuando pierden un trade y festejando cuando rompen totos en las peleas en equipo. #GOC9\n\nY con respecto a los más fuertes para mi el gran candidato son los tigers, si el año pasado ya los consideraba fuertes, definitivamente éste es su año en mi opinión. \nSegundos están SKT, aunque vienen jugando a un nivel mecánico bastante pobre (para ser ellos, si los comparamos con el resto siguen siendo unas bestias), así que dependen de sobrevivir los primeros 15 minutos y a partir de las rotaciones y toma de decisiones empezar a remontar (básicamente lo mismo que los Rox, pero menos perfeccionado). \nTerceros EN MI OPINIÓN están los muchachos de Royal, anoche demostraron una mejora IMPRESIONANTE con respecto a la toma de decisiones, y estoy seguro que esa mejora se debe a que están empezando a perfeccionar los problemas de comunicación que acarreaban por la diferencia lingüística, y siendo más específico, con Mata. El hecho de que el muchacho pueda hacerles entender que es lo que tienen que hacer y explayarse como shotcaller realmente marca una gran diferencia. Mata fue básicamente el instructor del SSW campeón, el manejaba todo el mapa y el macrojuego, y anoche quedó más que claro que él será quien marque el ritmo de las partidas a favor de RNG. \nY cuarto tengo que poner a EDG, es una buena mezcla de excelente nivel mecánico y potencial de macrogame, si bien no lo demostraron ayer contra INTZ, a mi parecer fue un completo error de enfoque por parte del staff, se puede ver que incluso el coach hizo un draft desfavorable por culpa del exceso de confianza, lo cual seguramente transmitió a sus jugadores haciendo que no jueguen al 100%. Si solucionan ésto de cara a la preparación de las próximas partidas, estoy seguro que el potencial de éste equipo es suficiente para hacerle frente a cualquier escuadra.","replies":[]},{"poster":"Lucrexio","date":"2016-09-30T16:46:40.192+0000","up_votes":1,"down_votes":0,"body":"Opino que SKT tiene las de ganar, pero el equipo que más me llama la atención es RNG.","replies":[]},{"poster":"Crazy lyrics","date":"2016-09-30T16:34:58.822+0000","up_votes":1,"down_votes":0,"body":"el sorteo de las skin creo que todos estan por perder debido a intz salvo algunos brasileros xD","replies":[]},{"poster":"teemo reumatico ","date":"2016-09-30T15:48:43.183+0000","up_votes":1,"down_votes":0,"body":"apoyalo a intz representante de los paises emergentes :v lan las brazil etc. que le gano a edg campeon de china y uno de \nl os favoritos :v","replies":[]}]}