{"poster":"HunterPeace","date":"2016-12-28T11:17:09.176+0000","title":"Ist die League of Legends Community wirklich so schlecht?","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":4,"body":"Hallo Beschw&ouml;rer^^\r\n\r\nIch wollte mal ein paar dinge hier schreiben, die mir in drei Jahren LOL an der Community aufgefallen sind und w&uuml;rde gerne eure Meinung h&ouml;ren.\r\n\r\nIch m&ouml;chte ein Thema ansprechen das jeder kennt n&auml;hmlich Flamer.\r\n\r\nFlamer machen sowol Spiele kaputt als auch die gute Laune der Mitspieler. Ich habe schon in vielen Foren gelesen, das die Mehrheit sich dar&uuml;ber beschwert, dass sie st&auml;ndig Flamer im Team haben. Ich rede &uuml;brigends von wirklichen Flamern die deine Mutter und dich beleidigen und nicht die, die sagen das du schlecht farmst. Wenn man das ganze mal genau betrachtet, sind Flamer die Ausnahme. Denn angenommen in einem Spiel ist in beiden Teams ein Flamer und nahrt&uuml;rlich man selbst, dann sind von 10 Spielern nur 2 Flamer, also 7 Mitspieler die ganz normal spielen. Und ich muss auch sagen das jemanden der Trollt oder AFK geht hatte ich schon lange nicht mehr. Also warum hat die Community dann so einen schlechten Ruf?\r\n\r\nDas ist im prinziep ganz einfach erkl&auml;rt:\r\n\r\nEs werden schneller Fehler angesprochen als Lob verteilt. Ich bin mir zu 100% sicher das Riot an einem Tag mehr Reports aufweisen kann, als Lob an Mitspieler(Freundlichkeit, Teamgeist und Hilfreich). An einem einfachen Beispiel erkl&auml;rt: Wenn ein Blitzcrank von 10 Craps 10 trifft schreibt der ADC nichts, wenn allerdings von 10 Craps keiner trifft kann man schnell im Chat lesen  &quot;Du bist unn&uuml;tz&quot;. Oder ein First Time Lee Sin, der deine Lane gankt und einen Free Kill mit seiner Ult vermasselt. Jeder w&uuml;rde ihn Flamen, aber wenn ein Lee eine Lane gankt und der Gank jedesmal super war, wird dieser meist nie gelobt. Und ich wei&szlig; nicht wie  ihr das seht, aber ich sehe es in meinen Spielen genau so. Wir gehen (mich mit eingeschlossen) immer davon aus, das wenn jemand einen Champ pickt er den auch perfekt beherscht und wenn das mal der Fall ist ihn aber nicht Loben, weil wir es als selbstverst&auml;ndlich sehen.\r\nWas ich damit sagn will ist, das die Community nicht schlecht ist und Flamer eine Ausnahme sind, aber zu wenige haben die andere auch mal Loben. Und ich meine egal f&uuml;r was z.B eine Soraka deren Ults one Point sind, eine Jungler der dich immer Gankt oder ein Toplaner der sobald du Probleme hast zu dir Teleportet. Nur wir als Community k&ouml;nnen denn Ruf verbessern und das auch nur wenn wir gegen den Flame halten.\r\n\r\nMein Fazit:\r\n\r\nWenn wir alle anfangen unsere Mates zu Loben und Flamern weniger geh&ouml;r schenken, sind wir doch ein ganz gute Community.\r\n\r\nAber jetzt w&uuml;rde mich mal eure Meinug interessieren. Und nicht vergessen ich rede aus meiner Sicht und kann nur sagen was ICH in spielen sehe und lese. Wenn das bei euch anders aussieht, was ich mir durchaus vorstellen kann, ist das halt so.","replies":[{"poster":"AXE Sio","date":"2016-12-28T19:06:23.312+0000","up_votes":3,"down_votes":8,"body":"Sie ist extrem schlecht und ekelhaft. Menschlichkeit sucht man vergebens. Selbst in KZs gab es mehr menschlichkeit als hier.\n\nWarum kann ich an einem aktuellen beispiel aufzeigen.\n_\n5on5 ranked, mittlere gold elo.\n\nUnser jungler, ein random troll, schrieb gar nie etwas, hat von anfang an NUR gefarmt, nur! ist an fights und lanes vorbei gelaufen, als wäre niemand anderes da, für 25minuten. Nach ca. 10minuten hat mal einer gefragt....\"seju, could u gank once?\"\nnichts...keine reaktion, garnichts. Hat ein mal ulti gemacht als er gerdae die midlane gefarmt hat(mid laner war bot roaming und es waren dann 3gegner da), lief aber direkt weg, wäre locker 1-2 kills drin gewesen).\nSo ging das spiel weiter und weiter...\n\nIrgendwann war einer mal bedient und schrieb in all chat, \"thanks reporting sejuani, assisting enemy team\"....kurz danach hat sich noch einer beschwert...\n\nWie gesagt, das alles ohne grund!\n\nWas kam vom gegner team?\n\n\"shut up and stop whine about it\"\n\nNach dem spiel, \"please report sejuani\", was kam als antwort vom gegner team?\n\"why u even talk, you should first stop feeding before you complain about others\" (Mid laner war 2.6.4....nach 25minuten 4on5....)\n\nund genau das beweist wie ekelhaft die community ist.\n\nEin spieler ruiniert **bewusst **ein ranked spiel, schreibt nicht, dass es kein bann gibt(das ist ja wohl inzwischen jedem bekannt) und die gegner machen nichtmal was sondern kommen einem noch krumm, wobei jeder MENSCH verstehen müsste das man genervt ist..._\n\n\n- ich hatte auch genügend spiele mit 2.6.22 und das team laber einen voll wie schlecht man ja sei, mit seinen 2.6....so funktioniert die community.\n\n- Leute verteidigen allein oder zu zweit einen tier1 tower, während die gegner zu 5 mit baron pushen, was kommt von denen wo dann sterben? \"look noob team farming xy\"\n\nWie oft habt ihr mal nach dem spiel gehört: \"wp xy, you have been better\"\n\"du hast nur gewonnen weil der jungler ständig da war\", egal ob er null, zwei oder 10mal da war.\n\n99% schieben die schuld immer auf andere,\"mb\" gibt es selten und wenn, dann wird man direkt dafür dumm angemacht.\n\nIch spiele im Fussball Verein, dort kommen sich Spieler auch immer wieder mal krumm, aber abgesehen davon, dass man danach zusammen feiert, kennt man sich auch über längere zeit. Auch den Gegner kann man mal bisschen stressen, okay, aber danach gibt man sich die hand und gibt zu das etwas vielleicht ungerecht war oder nicht korrekt.","replies":[{"poster":"clair de lune289","date":"2016-12-30T12:01:52.003+0000","up_votes":3,"down_votes":1,"body":"wer in den ersten Zeilen \"Selbst in KZs gab es mehr Menschlichkeit als hier\" bringt,da brauch man gar nicht mehr weiterlesen.Es ist unmöglich dass noch etwas gescheites kommt.\n\nSicher können \"verbale\" Angriffe schlimm sein,aber unter gar keinen Umständen können sie Massenmord.Ich benutze hier bewusst nicht den Singular Mord,denn Mobbing auch nur mit Worten ,das einen Menschen zum Selbstmord treibt, ist im Grunde nichts anderes.","replies":[{"poster":"AXE Sio","date":"2016-12-30T15:10:41.243+0000","up_votes":2,"down_votes":3,"body":"es ist aber die wahrheit....schau dir mal berichte über KZ an...ist ein richtig passender vergleich","replies":[{"poster":"clair de lune289","date":"2016-12-30T15:38:24.357+0000","up_votes":5,"down_votes":1,"body":"es ist sinnlos Spielern wie dir,die Verhaltensprobleme in einem Spiel mit Massenmord in KZs vergleichen, überhaupt erklären zu wollen, warum dieser Vergleich mehr als nur daneben ist.","replies":[{"poster":"AXE Sio","date":"2016-12-30T16:52:20.582+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=0004000100000000,timestamp=2016-12-30T15:38:24.357+0000)\n>\n> es ist sinnlos Spielern wie dir,die Verhaltensprobleme in einem Spiel mit Massenmord in KZs vergleichen, überhaupt erklären zu wollen, warum dieser Vergleich mehr als nur daneben ist.\n\ndas hab ich nie getan...ich hab lediglich das verhalten zwischen den menschen dort als vergleich genommen. Das hat mit dem massenmord garnichts zu tun...nur weil du so oberflächlich und kurzsichtig denkst, heißt es nicht das der vergleich falsch ist. Es geht um die zwischenmenschlichkeit der Wärter und gefangenen....\naber es ist warhscheinlich sinnlos mit einem zu reden der direkt nur alles verdreht und aus dem zusammenhang reißt {{champion:63}}","replies":[{"poster":"clair de lune289","date":"2016-12-30T17:31:47.135+0000","up_votes":2,"down_votes":0,"body":"genau das Verhalten zwischen den Menschen in KZs war wiederlich und hatte nicht viel menschliches an sich, zumindest wenn es um das Verhalten zwischen Wärter und Gefangener geht.\nDer Massenmord hat sehr wohl etwas mit dem Verhalten der Menschen dort zu tun.\n\nWas glaubst du haben die Gefangenen gemacht wenn einer dem anderen das Essen gestohlen hatte?\nWie wurde entschieden wer noch Arbeitsfähig war?\n\nDu stellst das ganz hier so hin als wenn die Wärter in den meisten Fällen (wenige Ausnahmen gibt es immer) die Gefangenen nur so schlecht behandelt haben,weil es \"befohlen\" wurde.\nEs gab unzählige Vergewaltigungen etc aber hey die hatten sich eigentlich alle ganz doll lieb... merkste was?","replies":[{"poster":"AXE Sio","date":"2016-12-30T22:53:04.836+0000","up_votes":1,"down_votes":3,"body":"du verstehst den ansatz des vergleichs nicht....du bist wahrscheinlich einfach zu jung um sowas zu verstehen. Versuch mal nicht alles genau wörtlich zu nehmen und übertrage es auf den vergleich....vielleicht kommst du dann dahinter.","replies":[{"poster":"clair de lune289","date":"2016-12-30T23:41:49.337+0000","up_votes":3,"down_votes":0,"body":"es ist einfach lächerlich und geschmacklos Sachen die in einem Spiel (ich sage hier bewusst Spiel da es auf Fußballspiele etc auch zutrifft) mit Situationen aus den schlimmsten Kriegsverbrechen der Neuzeit zu vergleichen.\n\nIm späterem Verlauf deines ersten Posts verwendest du auf einmal Fußball,welcher von Anfang an ein passenderes Beispiel gewesen wäre.\n\nVor kurzem hatten wir erst einen Thread im Forum in der ein Spieler auf einmal anfing sich über die Bestrafungen von Riot zu beschweren-\nAn sich nichts neues als seine Erklärung dann allerdings lautete \"man sollte von riot nix anderes Erwarten da es sich ja um eine US Firma handelt und da die USA im 2WK die Atombombe abgeworfen haz, schon rein aus Prinzip verteufelt werden sollte\".\n\nDein Vergleich ist aus dem gleichem Niveau.\nEs geht nicht darum,dass man KZs/2WK und CO nicht diskutieren soll oder es für keine Vergleiche benutzen kann, sondern darum das es schon sehr absurd ist  grade solche Vergleiche bei einer \"lächerlichen\" Sache wie schlechtes/dummes/unvernünftiges Spielen oder sogar bewussten Sabotage/Beleidigen zu bringen.","replies":[]}]}]}]}]}]}]},{"poster":"Schlachtenhorn","date":"2016-12-29T09:09:54.247+0000","up_votes":5,"down_votes":0,"body":"\"Sie ist extrem schlecht und ekelhaft. Menschlichkeit sucht man vergebens. Selbst in KZs gab es mehr menschlichkeit als hier.\"\n\nWo beim Hirnlosen morden Millionen Unschuldiger die Menschlichkeit ist suche ich gerade vergebens.","replies":[]}]},{"poster":"Wernicke","date":"2016-12-28T11:22:27.713+0000","up_votes":5,"down_votes":3,"body":"Viele sagen die lol community wäre gar nicht so schlecht, ich hingegen kann sagen, dass ich mit meinen mittlerweile 35 jahren schon einiges an online gaming mitgemacht habe und dementprechend schon so einige communitys erlebt habe, egal ob casual oder damals MoH und Cod1 ESl usw... Alle möglichen verschiedenn Sparten, von shooter bis mmorpg alles dabei.\nMeine Sicht der Dinge: Leider ist die lol community das schlimmste was ich bisher erleben durfte, auch wenn viele hier das Gegenteil behaupten wollen und es für die Schilderung meiner Erfahrungen und Meinung jetzt wieder downvotes hagelt^^\nIch habe mal eine kleine Doku gemacht, weil ich meine subjektive Meinung überprüfen wollte. Ergabnis war, dass ich im Schnitt jedes 2. Spiel flame, afk oder trollen hatte. Mit trollen meine ich auch wirklich trollen und nicht nur schlechtes Spiel usw... Mit flame meine ich auch mehr als 1x Noob schreiben oder so. Flame hat übrigens den Groteil ausgemacht.\nTraurig aber wahr.\n","replies":[{"poster":"Pandaphiri","date":"2016-12-28T11:25:00.592+0000","up_votes":3,"down_votes":2,"body":"dem kann man nichts mehr hinzufügen. leider wollen riot und fans das eben nicht wahr haben und loben das spiel und die community in den himmel. die nackte wahrheit ist: es gibt mehr flamer und co als die zahlen sagen","replies":[{"poster":"HunterPeace","date":"2016-12-28T11:57:22.859+0000","up_votes":1,"down_votes":1,"body":"Wie viele Flamer hast du in deinem Team, wenn du mal spielst? Wie gesagt wenn 7 Mitspieler nicht flamen sind die die Mehrheit.\n\nIch sage das gleiche wie oben, ich will dir nichts unterstellen, aber wenn es mehr Flamer gibt müsstest du ja 4 Mitspieler haben die Flamen und das hatte ich noch nie.","replies":[{"poster":"Pandaphiri","date":"2016-12-28T12:04:16.455+0000","up_votes":3,"down_votes":2,"body":"ich habe nie geagt das die flamer die mehrheit sind. du solltest richtig lesen. ich habe geschrieben das es mehr sind als die zahlen zugeben . es sind nicht nur 5% oder so","replies":[{"poster":"Sirrkas","date":"2016-12-28T22:23:26.985+0000","up_votes":2,"down_votes":0,"body":"Niemand hat je gesagt, dass nur von 5 % der Spieler flame kommt. 5 % ist die Zahl der Spieler, die eine Strafe erhalten haben. Wenn aber jeder Spieler, im Schnitt jedes zehnte Spiel ein wenig toxisch wird, hat man eben im Schnitt, jedes Spiel einen toxischen Chat.","replies":[]},{"poster":"HunterPeace","date":"2016-12-28T12:05:52.950+0000","up_votes":2,"down_votes":1,"body":"Ah stimmt das habe ich falsch verstanden.","replies":[{"poster":"Pandaphiri","date":"2016-12-28T12:09:16.481+0000","up_votes":2,"down_votes":0,"body":"schon ok. kann passieren","replies":[]},{"poster":"AXE Sio","date":"2016-12-28T19:08:01.711+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HunterPice,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=00000000000000000000,timestamp=2016-12-28T12:05:52.950+0000)\n>\n> Ah stimmt das habe ich falsch verstanden.\n\nund genau sowas, hab ich NOCH NIE in league gesehen...nie! seit season 3....","replies":[{"poster":"HunterPeace","date":"2016-12-30T10:51:57.918+0000","up_votes":1,"down_votes":0,"body":"Was meinst du?","replies":[]}]}]}]}]}]},{"poster":"HunterPeace","date":"2016-12-28T11:53:23.885+0000","up_votes":2,"down_votes":1,"body":"Ok, aber dann hätte ich eine Frage: Hast du in jedem 2. Spiel mehrere Flamer oder nur einen? Denn ein Flamer kann andere dazu bewegen AFk zugehen und das meine ich mit Lob wenn du dagen wirkst bleibt er vieleicht. Gut gegen Trolls kann man leider nichts machen was in deren Köpfen vorgeht kann man nicht sagen. Und ich meine man kann auch nicht sagen das die Community so schlecht ist. Denn wenn du selbst nicht flamst dann ist das schonmal einer weniger. Darum finde ich Flamer sind die Ausnahme, da nicht alle Flamen und wenn du schreibst, dass die Lol Community das schlimmste ist, was du je erleben durftest, dann flamst du doch auch, also dürftest du dich nicht über andere beschweren. Ich versuche lediglich die Flamer von den anderen zu trennen. Und warum macht Flame den Größtenteil aus? Weil sowenige mal was positives schreieben.\n\nIch möchte dir in keinster Art unterstellen das du flamst oder sagen das das was du schreibst nicht stimmt. Ich finde nur das das was du schreibst mir ein bisschen zeigt das du mehr auf das schlechte achtest und weniger auf das gute. Denn klar in jedem 2. Game eine flamer zu haben ist schei**e, aber im umkehrschluss heißt das, das du in jedem 2. Game keinen Flamer hast.","replies":[{"poster":"Wernicke","date":"2016-12-28T12:56:14.049+0000","up_votes":2,"down_votes":3,"body":"Du versuchst das alles positiv zu sehen. Es sei dir gegönnt, bewahre dir diese Haltung ;)\n\n> Hast du in jedem 2. Spiel mehrere Flamer oder nur einen? \n\nEs ist ja so gut wie immer eine Kettenreaktion. Wenn erst mal einer anfängt, machen die anderen sehr schnell mit. Meist bdauert es nicht lange, bis dann also somit 3 oder 4 von 5 am rumzicken sind. Das führt dazu das natürlich schlechte Stimmung herscht, und sich keiner mehr aufs Spiel kontentriert, usw...\n\n>  Darum finde ich Flamer sind die Ausnahme\n\nWie gesagt, viele berichten selbiges. Daher habe ich ja meine kleine Doku gemacht um meine Meinung zu überprüfen. Ergebnis war leider, das flamer alles andere als ne Ausnahme sind. \nIch weiß das es Studien gibt, in denen steht wieviel % die flamer ausmachen, und das keine sehr hohe Summe ist. Wenn daswirklich der Wahrheit entprechen sollte, muss ich aber einen Pechaccount haben oder so. Denn das ich sowas leider jedes 2. Spiel habe ist leider keine Fantasie meinerseits :/ \nIch wünschte mir ja auch es wäre anders!\n\n> da nicht alle Flamen und wenn du schreibst, dass die Lol Community das schlimmste ist, was du je erleben durftest, dann flamst du doch auch\n\nWo du da einen Zusammenhang siehst ist mir ehrlich gesagt schleierhaft!?\nNein, ich flame nicht. Habe noch nie einen bann bekommen. Diese Tatsache hindert mich aber doch nicht daran mit anzusehen was andere Spieler so treiben?! Wenn ich nachher einaufen gehe, und mir kommen zwei hobby assi gangster entegegen deren peinliches Verhalten ich miterleben muss, werde ich doch nicht automatisch zum selbigen ^^\n\n> Ich möchte dir in keinster Art unterstellen das du flamst oder sagen das das was du schreibst nicht stimmt. Ich finde nur das das was du schreibst mir ein bisschen zeigt das du mehr auf das schlechte achtest und weniger auf das gute. Denn klar in jedem 2. Game eine flamer zu haben ist schei**e, aber im umkehrschluss heißt das, das du in jedem 2. Game keinen Flamer hast.\n\nUnterstellt hast du aber Paar Zeilen davor ;)\nKlar merkt man sich negative Aspekte. Stimme ich dir voll und ganz zu. Aber ein gg, gj oder iwas positives ist so selten geworden das es einfach nur traurig ist. Ich selbst hatte erst neulich wieder ein Schleifchen, da ich mich bemühe dieses Verhalten aufrecht zu erhalten. Leider lassen sich andere Spieler aber eher von negativen Dingen anstecken als von positiven.","replies":[{"poster":"DontKillMySoraka","date":"2016-12-28T15:41:33.295+0000","up_votes":2,"down_votes":1,"body":"Wenn du jedes zweite Spiel einen Flamer im Spiel hast, entspricht das ja den 5%...","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2016-12-28T13:18:54.140+0000","up_votes":3,"down_votes":2,"body":"Ich spiele schon seit 2002 mehr oder weniger regelmäßig online. Meine Erfahrungen reichen von Counter Strike und Battlefield, über WoW bis ins neue Oberwatch und ganz ehrlich: Die Community in LoL ist die reinste Pest. Es gibt definitiv keine toxischere und hasserfülltere Community als die von LoL. Riot unternimmt meiner Meinung nach viel zu wenig dagegen. Alle paar Tage heult hier zwar einer rum, der zu \"Unrecht\" gebannt wurde, aber das sind nur die krassen Einzelfälle. Ich habe in fast jedem Spiel Mitspieler oder Gegner, die entweder Mitspieler bei Fehlern als \"Retard\" oder \"boosted\" flamen oder sich über Gegner mit \"ez\" lustig machen. Und dafür wird man offensichtlich nicht bestraft. Bestraft wird man allenfalls für \"get cancer\" und auch dafür wird man nicht sofort gebannt, sondern bekommen ihre drei lächerlich geringen Vorstrafen.","replies":[{"poster":"0815xand0r","date":"2016-12-28T19:22:49.304+0000","up_votes":2,"down_votes":0,"body":"Wenn ich versuche das ganze mal möglichst objektiv zu betrachten, so ist die LoL-Community gar nicht so toxisch. Ich spiele auch schon reichlich lange und auch verschiedenste Spiele und muss sagen, dass es überall Idioten gibt.\nIn anderen Spielen fällt es oft nicht so auf. In WoW bspw. hat man einfach deutlich weniger mit Randoms zu tun und wenn dann eigtl. nur in Content, der dafür gedacht ist. Aber auch da, selbst im alten LFR wurde dermaßen viel geflamed, da muss sich WoW nicht hinter LoL verstecken, nur dass man da nicht so effektiv reporten konnte, wie in LoL.","replies":[]},{"poster":"Nivoras","date":"2016-12-28T18:29:45.621+0000","up_votes":2,"down_votes":0,"body":"Ich denke mal dass es bei drein der fünf Spiele am Genre liegt, in LoL hat man einfach vieel mehr Zeit zu flamen als in Overwatch zB (kann nur die beiden vergleichen, da ich die anderen Sachen nicht spiele). Durch die Todestimer, die Länge der Spiele, bei der Leute halt einfach naturgemäß mehr Fehler machen können und die aus dem nächsten Grund auch noch auffallen,  und dem \"Leerlauf\" wenn man zB zur Lane geht, hat man viel mehr Gelegenheiten seinem Team zu erzählen was man von ihnen hält^^ In Overwatch müsste man dafür schon ziemlich lange rumstehen.","replies":[]},{"poster":"gamerman3000","date":"2016-12-28T14:19:59.807+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Pure Cynicism","date":"2016-12-28T23:34:20.483+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=gamerman3000,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=00010000,timestamp=2016-12-28T14:19:59.807+0000)\n>\n> Für get cancer (und wenn man nochmehr toxisches zeugs gelabert hat) kriegt man nen insta permban\n\nLeider nicht. Ich habe schon Leute über op.gg beobachtet, die das geschrieben haben. Da war weder eine 2-wöchige noch eine permanente Pause zu erkennen.","replies":[{"poster":"gamerman3000","date":"2016-12-29T14:28:17.358+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Pure Cynicism","date":"2016-12-29T15:22:53.517+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=gamerman3000,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=0001000000000000,timestamp=2016-12-29T14:28:17.358+0000)\n>\n> Dann hat der das wohl einmalig geschrieben und dafür keine Reports bekommen. Dafür kriegt man einen instant Perma.\n\nIch habe ihn jedenfalls reportet.","replies":[]}]}]}]},{"poster":"Atsùra","date":"2016-12-28T18:22:24.360+0000","up_votes":1,"down_votes":0,"body":"Also ich bin lieb und nett und tilte nicht und flame nicht und versuch Frieden zu schaffen. Und wenns nit klappt, denk ich mir \"jajajaja lmaa, lache  und mach weiter :'D","replies":[]}]},{"poster":"MrBacker","date":"2016-12-28T16:07:35.926+0000","up_votes":3,"down_votes":2,"body":"Bin von anfang an dabei und hab mit mein fast 30 jahren auch schon viele onlinespiele gezockt und die LOL Community ist die mit abstand toxischte die ich in meinem ganzen zockerleben gesehn und erlebt habe. In jeden zweiten bis dritten runde ein flamer oder troll. Sie versauen den netten Spielern einfach das ganze Spiel und Riot sollte aufjedenfall knallhart durchgreifen. Wer anderre als retard beleidigt oder es sogar rassistisch wird sollte insta gebannt werden!","replies":[]},{"poster":"BMG Seddy","date":"2017-01-11T22:05:22.569+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HunterPice,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=,timestamp=2016-12-28T11:17:09.176+0000)\n>\n> Hallo Beschw&amp;ouml;rer^^\n> \n> Ich wollte mal ein paar dinge hier schreiben, die mir in drei Jahren LOL an der Community aufgefallen sind und w&amp;uuml;rde gerne eure Meinung h&amp;ouml;ren.\n> \n> Ich m&amp;ouml;chte ein Thema ansprechen das jeder kennt n&amp;auml;hmlich Flamer.\n> \n> Flamer machen sowol Spiele kaputt als auch die gute Laune der Mitspieler. Ich habe schon in vielen Foren gelesen, das die Mehrheit sich dar&amp;uuml;ber beschwert, dass sie st&amp;auml;ndig Flamer im Team haben. Ich rede &amp;uuml;brigends von wirklichen Flamern die deine Mutter und dich beleidigen und nicht die, die sagen das du schlecht farmst. Wenn man das ganze mal genau betrachtet, sind Flamer die Ausnahme. Denn angenommen in einem Spiel ist in beiden Teams ein Flamer und nahrt&amp;uuml;rlich man selbst, dann sind von 10 Spielern nur 2 Flamer, also 7 Mitspieler die ganz normal spielen. Und ich muss auch sagen das jemanden der Trollt oder AFK geht hatte ich schon lange nicht mehr. Also warum hat die Community dann so einen schlechten Ruf?\n> \n> Das ist im prinziep ganz einfach erkl&amp;auml;rt:\n> \n> Es werden schneller Fehler angesprochen als Lob verteilt. Ich bin mir zu 100% sicher das Riot an einem Tag mehr Reports aufweisen kann, als Lob an Mitspieler(Freundlichkeit, Teamgeist und Hilfreich). An einem einfachen Beispiel erkl&amp;auml;rt: Wenn ein Blitzcrank von 10 Craps 10 trifft schreibt der ADC nichts, wenn allerdings von 10 Craps keiner trifft kann man schnell im Chat lesen  &amp;quot;Du bist unn&amp;uuml;tz&amp;quot;. Oder ein First Time Lee Sin, der deine Lane gankt und einen Free Kill mit seiner Ult vermasselt. Jeder w&amp;uuml;rde ihn Flamen, aber wenn ein Lee eine Lane gankt und der Gank jedesmal super war, wird dieser meist nie gelobt. Und ich wei&amp;szlig; nicht wie  ihr das seht, aber ich sehe es in meinen Spielen genau so. Wir gehen (mich mit eingeschlossen) immer davon aus, das wenn jemand einen Champ pickt er den auch perfekt beherscht und wenn das mal der Fall ist ihn aber nicht Loben, weil wir es als selbstverst&amp;auml;ndlich sehen.\n> Was ich damit sagn will ist, das die Community nicht schlecht ist und Flamer eine Ausnahme sind, aber zu wenige haben die andere auch mal Loben. Und ich meine egal f&amp;uuml;r was z.B eine Soraka deren Ults one Point sind, eine Jungler der dich immer Gankt oder ein Toplaner der sobald du Probleme hast zu dir Teleportet. Nur wir als Community k&amp;ouml;nnen denn Ruf verbessern und das auch nur wenn wir gegen den Flame halten.\n> \n> Mein Fazit:\n> \n> Wenn wir alle anfangen unsere Mates zu Loben und Flamern weniger geh&amp;ouml;r schenken, sind wir doch ein ganz gute Community.\n> \n> Aber jetzt w&amp;uuml;rde mich mal eure Meinug interessieren. Und nicht vergessen ich rede aus meiner Sicht und kann nur sagen was ICH in spielen sehe und lese. Wenn das bei euch anders aussieht, was ich mir durchaus vorstellen kann, ist das halt so.\n\nKommt drauf an was man als Flame betrachtet.\nIch hatte auch meine Problemchen mit Flamer aber mitlerweile finde ich, dass wenn man genau liest was der scheinbare Flamer da schreibt, dieser Flamer jemanden nur auf etwas aufmerksam machen will (in den meisten Fällen). Ich habe mich schon daran gewöhnt und sehe Flame meistens eher als kritik die mir weiter hilft und tatsächlich bin ich dadurch viel besser geworden. Viele bezeichnen mich auch als Flamer nur weil ich in den Chat 10000 \"ALL MIDLANE!!!!!!\" schreibe bis die endlich raffen das Midlane free ist und wir gewinnen können wenn wir einfach nur durch pushen anstatt den Baron zu holen. Ihr müsst einfach aufhören über jeden mist zu heulen. Wenn ihr richtiges Flamen meint, wie wenn jemand euch beleidigt dann habe ich dafür natürlich kein Verständnis denn das ist einfach nur dumm. Aber wenn jemand euch auf eine toxische Art und Weise etwas mitteilen will, dann sollte man etwas mehr darauf achten denn meist liegt es an euch selbst warum die Leute anfangen toxisch zu werden (meine eigene Erfahrung). ;)\nIch selbst bin in Rankeds auch toxisch bzw. versuche einen Mates etwas strenger etwas mitzuteilen und meistens bringt es uns eher zum Sieg denn genau darum geht es.\nEinfach chillen und alles positiv sehen und vor allem auch mal an die eigene Nase fassen denn ich wette du und viele andere die sich über Flamer beschweren sind selbst auch nicht besser ;)\nprovokation ist übrigens auch Flaming denn die meisten die wegen Flamer rumheulen merken gar nicht wie provozierend und ekelhaft die sich selbst verhalten.\nAn sich selbst arbeiten und die anderen machen lassen, ganz einfach ^^","replies":[{"poster":"Veezey","date":"2018-06-16T17:28:29.770+0000","up_votes":1,"down_votes":0,"body":">Einfach chillen und alles positiv sehen und vor allem auch mal an die eigene Nase fassen denn ich wette du und viele andere die sich über Flamer beschweren sind selbst auch nicht besser ;)\n\nJo Flamer werden einfach gemutet, wenn sie zu sehr nerven. \n\n>provokation ist übrigens auch Flaming denn die meisten die wegen Flamer rumheulen merken gar nicht wie provozierend und ekelhaft die sich selbst verhalten.\n\nWas siehst du denn als Provokation? Für manche ist \":D\" schon provozierend genug oder Emotes. Da finde ich es schon ziemlich lächerlich, wenn sich Leute durch sowas provoziert fühlen.\n\n\nEdit: Ich hab grade erst gemerkt, dass der Thread ein Jahr alt ist ...","replies":[]}]},{"poster":"Varjo","date":"2018-06-16T16:21:30.411+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen, dass ich diese Zustände kenne.\n1. In dem Spiel sagt keiner ein Wort, weder gute noch schlechte und es wird einfach gespielt.\n\n2.Spiele in dem einer von den anderen mates durchbeleidigt wird. \n\n3.Alle hassen sich\n\n4.Es gibt 1-2 coole Leute mit denen man sich auch noch gut unterhalten kann soweit das ingame möglich ist.\n\n5. Achja und die Premates im Team welche eigentlich nicht mit den anderen 3 spielen wollen.\n\nUnd dann gibt es noch Mischungen aus allem.\n\nIch selber sehe aber genauso viele nette und hilfsbereite Personen. Wie auch nicht ganz so höfliche Menschen in Games. \nIch selber bin ein sehr ruhiger Spieler. Und werde sofort nervös wenn mich ein flamer ins Visier nimmt. Ich Spiele schlechter. Durch das dauernde beleidigen sinkt dann auch die ganze Moral des Teams und die Chance zu gewinnen wird kleiner.\nDas sind so meine Beobachtungen. \nAber ein gut gelaunter Spieler kann einem Spiel genauso gut tun.","replies":[]},{"poster":"Eisenhammer","date":"2017-02-28T01:01:23.601+0000","up_votes":1,"down_votes":0,"body":"yep","replies":[]},{"poster":"Lord Borzi","date":"2017-01-05T17:50:33.508+0000","up_votes":1,"down_votes":0,"body":"Hallo alle zusammen,\n\nich führe gerade an der Uni Kiel eine Umfrage dazu durch. Ich möchte untersuchen, wie sich die Persönlichkeit der Spielerinnen und Spieler auf das LoL-Spielerlebnis auswirkt.\n\nAuf diesem Wege suche ich auch noch weitere LoL-Spielerinnen und Spieler, die an meiner Online-Umfrage teilnehmen möchten (dauert ca. 15 Minuten). Ich würde mich freuen, wenn noch ein paar mitmachen würde. Auf Wunsch erhält man später die Ergebnisse dieser Umfrage.\n\nMeine Online-Umfrage erreicht Ihr hier: http://studfeedback.uni-kiel.de/evasys/online.php?p=botlane\n\nDas Passwort zur Umfrage lautet botlane\n\nBin doch mal gespannt, ob die LoL-Community wirklich so schlecht drauf ist ;)\n\nVielen Dank und viele Grüße,\nChristoph","replies":[]},{"poster":"Xeratur","date":"2016-12-28T17:56:27.619+0000","up_votes":1,"down_votes":0,"body":"Also aus meiner Sicht (Bin im Moment Silber 5 geranked.) habe ich in MMORPG's die meisten \"Flamer\" erlebt (Man denke dabei an die typischen Raids). Ich hatte selbst soweit ich mich erinnern kann 2-3 Fälle von \"extremen\" Flamern gehabt, welche mehr in die Richtung Rassismus gingen. Diese habe ich natürlich Reportet und da liegt mein Problem. Ich habe selbst Screenshots gemacht und diese an den Support geschickt, da ich nicht wollte, dass dies im Flut der Reports untergeht der Kinder, die jeden dauerhaft ohne wirklichen Grund reporten. Nur wenn da selbst der Support bei extremen Rassismus und sonstigem einfach nur sagt nach dem Motto ja nicht unser Problem. Reporte ihn nach dem Spiel und dann gucken wir mal weiter. Sowas kann ich nicht nachvollziehen. Bei solchen Fällen einfach die Augen zumachen, aber andere Leute bannen die nicht nach Meta spielen aber trotzdem erfolgreich sind diese ohne groß nachzudenken Perma zu bannen ist für mich einfach nur unverständlich. In jedem Spiel gibt es genug solcher fälle, nur ich denke die League Community schaukelt sich da selbst viel zu hoch. Zudem denke ich nur, dass es so viel \"Einfluss\" in dem Spiel hat, da auf den Chat so einen großen Fokus gelegt wird. In jedem anderen Game was ich gespielt habe, war der Chat meistens Nebensächlich klein in irgendeiner Ecke.","replies":[{"poster":"AXE Sio","date":"2016-12-28T19:09:28.681+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Xeratur,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=0003,timestamp=2016-12-28T17:56:27.619+0000)\n>\n> Also aus meiner Sicht (Bin im Moment Silber 5 geranked.) habe ich in MMORPG&#x27;s die meisten &quot;Flamer&quot; erlebt (Man denke dabei an die typischen Raids). Ich hatte selbst soweit ich mich erinnern kann 2-3 Fälle von &quot;extremen&quot; Flamern gehabt, welche mehr in die Richtung Rassismus gingen. Diese habe ich natürlich Reportet und da liegt mein Problem. Ich habe selbst Screenshots gemacht und diese an den Support geschickt, da ich nicht wollte, dass dies im Flut der Reports untergeht der Kinder, die jeden dauerhaft ohne wirklichen Grund reporten. Nur wenn da selbst der Support bei extremen Rassismus und sonstigem einfach nur sagt nach dem Motto ja nicht unser Problem. Reporte ihn nach dem Spiel und dann gucken wir mal weiter. Sowas kann ich nicht nachvollziehen. Bei solchen Fällen einfach die Augen zumachen, aber andere Leute bannen die nicht nach Meta spielen aber trotzdem erfolgreich sind diese ohne groß nachzudenken Perma zu bannen ist für mich einfach nur unverständlich. In jedem Spiel gibt es genug solcher fälle, nur ich denke die League Community schaukelt sich da selbst viel zu hoch. Zudem denke ich nur, dass es so viel &quot;Einfluss&quot; in dem Spiel hat, da auf den Chat so einen großen Fokus gelegt wird. In jedem anderen Game was ich gespielt habe, war der Chat meistens Nebensächlich klein in irgendeiner Ecke.\n\naber raids mit league zu vergleichen ist ja jetzt nicht so wirklich sinnvoll...mmorpgs haben in der regel recht guten umgang unter den spielern, egal welcher fraktion oder gilde etc.","replies":[{"poster":"Pure Cynicism","date":"2016-12-28T23:37:38.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AXE Sio,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=00030000,timestamp=2016-12-28T19:09:28.681+0000)\n>\n> aber raids mit league zu vergleichen ist ja jetzt nicht so wirklich sinnvoll...mmorpgs haben in der regel recht guten umgang unter den spielern, egal welcher fraktion oder gilde etc.\n\nNa, WoW ist zwar mMn nicht ganz so schlimm wie LoL - zumindest mittlerweile nicht mehr - aber auf PvP-Servern hatte man zumindest in der Anfangszeit um 2005 herum für die gegnerische Fraktion wenig übrig. Spit-Makros, Leichencamping usw. gab es täglich. Aber mittlerweile hat es sich doch stark geändert.","replies":[{"poster":"Spicavius","date":"2016-12-31T09:29:24.210+0000","up_votes":1,"down_votes":0,"body":"Du meinst sowas, dass man den Ally etwa 3 Stunden campt weil man sonst nichts anderes (damals nach der Schule) zu tun hatte und das Ganze nur, weil er einen beim Dailys machen gekillt hat.  xD. <_<","replies":[]},{"poster":"AXE Sio","date":"2016-12-30T15:11:49.663+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Ceiwyn,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=000300000001,timestamp=2016-12-28T23:37:38.694+0000)\n>\n> Na, WoW ist zwar mMn nicht ganz so schlimm wie LoL - zumindest mittlerweile nicht mehr - aber auf PvP-Servern hatte man zumindest in der Anfangszeit um 2005 herum für die gegnerische Fraktion wenig übrig. Spit-Makros, Leichencamping usw. gab es täglich. Aber mittlerweile hat es sich doch stark geändert.\n\ngegnerische fraktion...in league hat man aber 4 teammates","replies":[{"poster":"Sirrkas","date":"2016-12-30T18:54:23.162+0000","up_votes":1,"down_votes":0,"body":"Und 5 Gegner, die man Flamen kann.","replies":[{"poster":"AXE Sio","date":"2016-12-30T22:53:41.821+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=00030000000100000000,timestamp=2016-12-30T18:54:23.162+0000)\n>\n> Und 5 Gegner, die man Flamen kann.\n\nja, aber es geht doch darum, dass in league deine TEAMMATES dich am meisten beleidigen und flamen....das ist bei raids eher weniger der fall...abgesehen davon, dass die sich meist besser kennen als league spieler in random Q","replies":[{"poster":"Sirrkas","date":"2016-12-30T22:56:37.937+0000","up_votes":1,"down_votes":0,"body":"Bei meinen Spielen kommt der Flame fast ausschließlich von den Gegnern.","replies":[{"poster":"AXE Sio","date":"2016-12-31T09:25:12.287+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=0003000000010000000000000000,timestamp=2016-12-30T22:56:37.937+0000)\n>\n> Bei meinen Spielen kommt der Flame fast ausschließlich von den Gegnern.\n\nbei mir wirklich gar nie...da sind manchmal paar bisschen großkotzig...{{champion:157}} ...aber in der regel kommt vom gegner nur \"report my teammate xy\" ...ich adde nach dem spiel am häufigsten meinen direkten gegenspieler","replies":[]}]}]}]}]}]},{"poster":"Sirrkas","date":"2016-12-28T22:18:05.698+0000","up_votes":1,"down_votes":0,"body":"Warum kann man das nicht, wenn man beides auf Flame untersucht?\n\nBei jedem ist die Meinung zu dem Thema anders. Ich habe deutlich schlimmere Eindrücke von Dota2, HotS und CS:GO gehabt als von LoL. Battlerite war am Anfang auch schlimmer, inzwischen ist es etwa auf dem Niveau von LoL. Bei mir sind meine Teams aber meistens nett untereinander. Da sind nur selten Flamer dabei, der Flame kommt eher aus dem gegnerischen Team, wenn die unterlegen sind und zum Beispiel den Jungler blamen. ","replies":[{"poster":"AXE Sio","date":"2016-12-30T15:11:27.104+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=nbe0QBGm,comment-id=000300000000,timestamp=2016-12-28T22:18:05.698+0000)\n>\n> Warum kann man das nicht, wenn man beides auf Flame untersucht?\n> \n> Bei jedem ist die Meinung zu dem Thema anders. Ich habe deutlich schlimmere Eindrücke von Dota2, HotS und CS:GO gehabt als von LoL. Battlerite war am Anfang auch schlimmer, inzwischen ist es etwa auf dem Niveau von LoL. Bei mir sind meine Teams aber meistens nett untereinander. Da sind nur selten Flamer dabei, der Flame kommt eher aus dem gegnerischen Team, wenn die unterlegen sind und zum Beispiel den Jungler blamen.\n\nweil bei raids werden GEGNERISCHE armeen angegriffen, hier wird UNTEREINANDER beleidigt und getrollt und sich selbst...","replies":[{"poster":"Sirrkas","date":"2016-12-30T18:53:56.491+0000","up_votes":1,"down_votes":0,"body":"Das hindert die Mitspieler doch nicht daran, sich gegenseitig zu flamen. Und sei das nur irgendein Jäger, der dachte er schafft es einfach reinzustürmen und zu gewinnen, weil alle Heiler nur dafür da sind, ihn am Leben zu halten.","replies":[]}]},{"poster":"Schlachtenhorn","date":"2016-12-29T09:11:59.605+0000","up_votes":1,"down_votes":0,"body":"Dota2 ist Allgemein bekannt als das Spiel mit der Unfreundlichsten Community was länger auf dem Markt ist und eine große Spielerzahl hat.","replies":[]}]}]}]},{"poster":"dNiW","date":"2016-12-30T16:45:02.292+0000","up_votes":1,"down_votes":0,"body":"Ich hatte in den letzten 50 Spielen nur einen Spieler der hart geflamt hatte. \nIm Vergleich zu Season 3/4 finde ich ,dass das Flame-Niveau nicht schlimmer geworden ist.\nHatte in den letzten Spielen sehr viele gute Mitspieler, die sich auch erkundigt haben was das Team möchte. Und das in Bronze!\nBin zufrieden+","replies":[]},{"poster":"D3Di","date":"2016-12-28T22:08:11.178+0000","up_votes":1,"down_votes":0,"body":"Das Kernproblem, warum LoL eine so toxische Community hat, ist, dass jeder denkt er wüsste wie das Spiel zu spielen ist. Jeder denkt von sich, er wüsste was richtig ist.","replies":[]}]}