{"poster":"Riot Ahab","date":"2015-01-05T22:43:12.650+0000","title":"NA Server Roadmap Update: Optimizing the Internet for League and You","subforum":"[ARCHIVED] Help & Support","up_votes":118,"down_votes":7,"body":"**UPDATE:** *Thanks for all your questions and joining in on the discussion, that's it from us for now. Keep an eye out on Boards for future updates from the NA Roadmap team!*\n\n\nHi everyone,\n\nRiot Ahab here again to share more updates on what we're doing to address East Coast ping problems. By now, you may be familiar with the NA Server Roadmap, which outlines our approach to addressing ping disparity across the US and Canada. You can check it out [here](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future). \n\nToday, I want to introduce **Riot WizardOTL** (formerly Riot WizardoftheLake), who has been busy leading the charge on Phase 2 of the Roadmap: building a dedicated network for League of Legends traffic.\n\nWhy are we doing this? Currently, ISPs  focus primarily on moving large volumes of data in seconds or minutes, which is good for buffered applications like YouTube or Netflix but not so good for real-time games, which need to move very small amounts of data in milliseconds. On top of that, your internet connection might bounce all over the country instead of running directly to where it needs to go, which can impact your network quality and ping whether the game server is across the country or right down the street.\n\n**This is why we’re in the process of creating our own direct network for League traffic and working with ISPs across the US and Canada to connect players to this network. **\n\nThere’s a lot of fine-tuning to do as we bring additional parts of the network online, and we could use your help. Some connections can misfire and run a longer route than necessary to get to this network, so If you have experienced a sudden spike to your connection since November, please let us know in the comments below.* (edit: removed survey link to process collected information!)*\n\n~~There’s a lot to cover, so we thought this would be best served as a Q&A. We’ll hang around this thread for the next 4 hours to answer questions and get into the nitty-gritty should anyone be curious.~~\n\n_Thanks everyone for your questions! This thread's comments are being disabled and archived - please jump back [here](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future) to the main post and scroll to the bottom to find the most recent NA Server Roadmap update if you have any questions you'd like addressed!_","replies":[{"poster":"Sleeplessone","date":"2015-01-05T23:47:00.562+0000","up_votes":12,"down_votes":0,"body":"Am I reading this correctly in that you are setting up what is your own Tier 2 or 1 network?","replies":[{"poster":"Riot Ahab","date":"2015-01-05T23:55:32.586+0000","up_votes":29,"down_votes":1,"body":"Exactly, we're focused on peering directly -- technically we may not meet the classification of a Tier 1 network, but you've got the idea.","replies":[{"poster":"Sleeplessone","date":"2015-01-06T01:18:03.267+0000","up_votes":49,"down_votes":0,"body":"As a side request please set the router hostnames to league champs so when sending in traceroutes for future problems I can use the line.\n\n\"As you can see Tryndamere is critting my ping pretty badly.\"","replies":[{"poster":"SpicySharks","date":"2015-01-07T07:47:46.944+0000","up_votes":21,"down_votes":0,"body":"{{champion:75}} It certainly would be a shame if I\n\nCast Wither on your internet as a teamfight broke out","replies":[]},{"poster":"CommandShockwave","date":"2015-01-06T01:19:05.790+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Sleeplessone,realm=NA,application-id=osqw6G4M,discussion-id=AMupzBHw,comment-id=000e00000001,timestamp=2015-01-06T01:18:03.267+0000)\n>\n> As a side request please set the router hostnames to league champs so when sending in traceroutes for future problems I can use the line.\n> \n> \"As you can see Tryndamere is critting my ping pretty badly.\"\n\nGood *god* yes.","replies":[]}]},{"poster":"Fiorinol","date":"2015-01-06T00:00:32.782+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Riot Ahab,realm=NA,application-id=osqw6G4M,discussion-id=AMupzBHw,comment-id=000e0000,timestamp=2015-01-05T23:55:32.586+0000)\n>\n> Exactly, we're focused on peering directly -- technically we may not meet the classification of a Tier 1 network, but you've got the idea.\n\nThis might be a weird question, I understand that you probably cannot provide an answer for performance increases as mileage may vary.\n\nBut are there any metrics you can share on how much peering directly will affect latency?\n\nAs someone asked above concerning distance, are there still plans to centralize the actual servers? Having your own circuit will likely solve packet losses and jitter, but it won't solve latency much I'm afraid, East Coasters will still have +80 ping.","replies":[{"poster":"Keevalroy","date":"2015-01-06T00:06:57.791+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Sefam,realm=NA,application-id=osqw6G4M,discussion-id=AMupzBHw,comment-id=000e00000000,timestamp=2015-01-06T00:00:32.782+0000)\n\n> As someone asked above concerning distance, are there still plans to centralize the actual servers?\n\nChicago.  Chicago please Riot.  Everyone deserves an equal playing field, and keeping the server location on one side of the continent will still create a disparity no matter how well optimized the paths are.","replies":[{"poster":"Sleeplessone","date":"2015-01-06T00:15:55.288+0000","up_votes":15,"down_votes":1,"body":"> Chicago. Chicago please Riot. Everyone deserves an equal playing field \n\nExcept those in Chicago who deserve a more equal playing field? :P","replies":[]}]}]}]}]},{"poster":"Lilybet","date":"2015-01-05T23:16:31.552+0000","up_votes":35,"down_votes":8,"body":"Is there any way your team could educate the community on the work and planning it takes to make an endeavor of this size? There seem to be a lot of people who think that this problem is most easily solved by buying some servers plugging them in, and now everything is magically fixed.  \n\nIt might help if people knew what all went into a huge plan such as making a direct network and dedicated infrastructure. And it might also give people an idea of how long it actually takes to do this sort of thing. Misinformation is the enemy here.","replies":[{"poster":"Riot Ahab","date":"2015-01-05T23:27:46.723+0000","up_votes":32,"down_votes":2,"body":"Agreed - we're talking on our end about ways to keep the community informed as we go along these steps. As pieces of the network come online, maybe we post an update to a thread and explain what happened (what went right, what didn't). There are of course some things we can't talk about for security concerns in the nitty-gritty, but still it could be worthwhile to outline the project into steps.","replies":[]}]},{"poster":"tr0llzy","date":"2015-01-05T23:32:52.361+0000","up_votes":7,"down_votes":0,"body":"When will this be finished by?","replies":[{"poster":"Riot Ahab","date":"2015-01-05T23:47:03.713+0000","up_votes":22,"down_votes":1,"body":"The full network is slated to be built by the end of March this year.","replies":[{"poster":"Lilybet","date":"2015-01-05T23:56:29.885+0000","up_votes":4,"down_votes":1,"body":"Does this mean that it will be up and fully functional, or just that the network itself will be ready?","replies":[{"poster":"Riot Ahab","date":"2015-01-06T00:00:22.592+0000","up_votes":14,"down_votes":0,"body":"The hardware will be functional -- the agreements may take a little extra time (since contracts always do), and there will be extra work hammering out individual hiccups and making sure as many players as possible have their connections pathing correctly to this network.","replies":[{"poster":"Lilybet","date":"2015-01-06T00:02:33.554+0000","up_votes":5,"down_votes":1,"body":"So basically, the hardware itself is on schedule, but we'll still have to wait a bit while the ISP negotiations go on. So it mostly depends on the ISPs?","replies":[{"poster":"Riot Ahab","date":"2015-01-06T00:10:34.765+0000","up_votes":18,"down_votes":0,"body":"The March goal should include getting the agreements done (and we are currently on schedule in that regard), but the back-and-forth on contracts never fails to amaze me on how long it can take!","replies":[{"poster":"Sleeplessone","date":"2015-01-06T00:14:33.125+0000","up_votes":6,"down_votes":0,"body":"We had fiber put in for a point to point between two major buildings.  Because one of the two buildings was near an airport it took close to 3 years with the contract bouncing beween us, the port, and the ISP before everything was settled and the line was put in.  Contracts be crazy.","replies":[]},{"poster":"Lilybet","date":"2015-01-06T00:14:39.764+0000","up_votes":5,"down_votes":1,"body":"I know, right? Bureaucracy can be such a pain. XD Thanks for the hard work.","replies":[]}]}]}]}]}]}]},{"poster":"Masalar","date":"2015-01-05T23:02:35.917+0000","up_votes":19,"down_votes":1,"body":"This all sounds interesting. I just wish I knew enough about any of this to ask a question -.-\n\nI suppose I'll ask: \"If this all gets done in the most ideal way possible, what will this make gameplay like? Will ping improve? Will gameplay improve even if ping doesn't with the \"less data faster\" approach? Will people on the west coast notice a change?\"\n\nI just really don't know enough about anything to ask a deep question.","replies":[{"poster":"sonicdeathmonk","date":"2015-01-05T23:29:35.299+0000","up_votes":21,"down_votes":2,"body":"Many players should see improvements in network quality as our new North American network rolls out.  These improvements could be less ping time, less network packet loss, and more stable connections (less disconnects).   Ping, packet loss, and stability may not all move in the same direction for all players depending on location within North America, their ISP (how their ISP connects to Riot's network).  \n\n Ping, packet loss, and stability are not always tied together and can be affected by many things.  When it comes to network quality we prioritize stability, reduced packet loss, and ping time pretty much in this order.   You can't play the game if you are not connected, you will see more lag with more packet loss, and ping can become a problem when it gets significantly high or is unstable (shooting up and down all the time in the middle of the game).    \n\nThe game client only reports ping time to players but it also tracks stability and packet loss to Riot (and in client log files) on a near real time basis (though it can take us a day to crunch all the data from all the game clients before we see a troubling trend developing so we are not yet at real time detection of some network problems).   Sometimes packet loss will show up in your ping time, usually you will see it jump up and down quickly which often indicates packet loss is happening or if severe packet loss will show up as lag in the game.    \n\nFaster ping time is often reported by players to \"feel\" better and is often something that is reported to be more meaningful the better you are at playing a game.  How fast ping is before you feel the difference is likely dependent on the individual but it is generally thought the lower the better (diminishing returns apply, going from 160 ping to 90 ping is more impactful than going from 110 ping to 40).  Lower ping time can also help mitigate packet loss since the game can recover missing packets faster.    Because the Internet is a loose collection of various private and public networks, ping time is something that will constantly change for players.  Some players could see slight increases in ping times while others can see significant reductions as our new network comes online.   Our goal is benefit the most players and then troubleshoot ISPs that still have players with poor network quality.\n\n***EDIT: Formatting***","replies":[{"poster":"Windup Orianna","date":"2015-01-05T23:37:36.205+0000","up_votes":9,"down_votes":1,"body":"You're right about a stable connection feeling better. I feel physically less tense when my connection is good.","replies":[{"poster":"McKizz","date":"2015-01-07T07:40:36.679+0000","up_votes":6,"down_votes":0,"body":"Agreed. Which means I play more and spend more money on League instead of other games. {{champion:119}}","replies":[]}]}]},{"poster":"John Berserk","date":"2015-01-05T23:20:29.700+0000","up_votes":2,"down_votes":0,"body":"I dont have a super deep understanding of this as networking is not my field of study (though it is related to it somewhat), but I think what this basically means is...\n\nWell, with networks, signals are lost or dulled somewhat after making various stops. I dont think distance is necessarily an issue. They're usually boosted when sent out again towards another stop, and continue making their way to their primary location. \n\nAs far as I know, there are more stops between east coast players and Riot than there are between west coast players and Riot. This connection is currently going through already-established and built connections throughout the US and Canada. What Riot is doing is making a dedicated **direct** connection to their network, which in theory would make the difference in ping among players on both the east and west coast virtually non-existent. \n\nOr something like that.\n\nNetworking is not my thing as I said. :P","replies":[{"poster":"Spooge","date":"2015-01-06T01:58:43.880+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Noctes setcoN,realm=NA,application-id=osqw6G4M,discussion-id=AMupzBHw,comment-id=00000000,timestamp=2015-01-05T23:20:29.700+0000)\n>What Riot is doing is making a dedicated **direct** connection to their network, **which in theory would make the difference in ping among players on both the east and west coast virtually non-existent.**\n\nIf Riot comes up with a way to make ping difference between east and west coast virtually non-existent they will have a few Nobel Prizes in Physics as well as technology patents that they could license for inconceivable profits, because that is the holy grail of telecommunications. Until then, you will always be ~70-80ms behind someone west coast (assuming you are east coast), even with the best possible routing.\n\nI'm not trying to stomp on Riot's efforts, improving the routing can improve the game, but there is a reason Chicago and other central cities are huge hubs for Internet servers - *if you insist on picking a single location* for the best possible latency to a whole continent it's going to be somewhere near the center.","replies":[{"poster":"Ascilia of Roses","date":"2015-01-06T04:30:19.078+0000","up_votes":5,"down_votes":0,"body":"The US is about 2680 miles wide (over-estimate) which is about 4.31*10^6 m. Light travels at about 3*10^6 m/s. Assuming this direct network has a minimal number of stops between your ISP and the west coast, it would take the signal about 14 ms to travel that distance. Add in a couple hops here and the travel time will probably be a bit higher than that number. That being said, if the network is built in such a way that there is a small number of hops for packets, then we'll see significantly lower ping times for east coast players. \n\nNevertheless, the ping difference between west and east coast will always be at least ~10-20 ms simply because of physics.","replies":[]}]}]}]},{"poster":"DragonPup","date":"2015-01-05T23:11:59.016+0000","up_votes":11,"down_votes":1,"body":"Out of morbid curiosity, how are the NA ISPs to deal with on this?\n\n(For disclosure, I am a very low level employee of a very large one and personally wondering how they are to deal with on a backbone level)","replies":[{"poster":"sonicdeathmonk","date":"2015-01-05T23:34:33.876+0000","up_votes":16,"down_votes":2,"body":"It can take us many months to work with large ISP companies to achieve even modest results.  Gaming is currently not a priority for most.   However we are investing a lot of time in educating the ISPs that have LoL players as customers.  It is very company dependent and we expect it will be a long road to travel but ultimately great for gamers.","replies":[]}]},{"poster":"PsycloneJoker","date":"2015-01-05T23:12:02.145+0000","up_votes":5,"down_votes":1,"body":"What was up with the huge amounts of packet loss that many experienced around Dec. 29-30?","replies":[{"poster":"sonicdeathmonk","date":"2015-01-06T00:24:09.364+0000","up_votes":14,"down_votes":1,"body":"There was a lot of DDoS activity targeting the game industry the last 2 weeks of the year.  While it may not be your specific cause, DDoS can create congestion for more than just the target.  Congested pipes create packet loss.  Hard to tell for a specific player though.","replies":[]}]},{"poster":"LozzaManiac","date":"2015-01-06T04:00:18.221+0000","up_votes":12,"down_votes":0,"body":"Every time I hear about this, it blows my brain a bit. I can't believe a games company is doing something this huge. I have a few questions, sorry I'm a bit late to the party! It would be awesome to see a dev diary of some sort when this is done so we could learn exactly how you achieved it. As a computer science student all these statements do is end up leaving me with lots of questions that I know you can't answer at this point due to PR reasons! But heck I'll ask a few anyway, I tried to keep these not completely technical as I'm assuming you can't go into details...\n\n1. Are you having trouble finding T1/T2 lines in various parts of the country? Do you use an ISPs internal T1/T2 network to transport the data around the country, or are you financing your own and asking the ISPs to forward the data through that?\n\n2. (This kind of links to 1.) Will you manage the network yourselves or let an outside company do that? Although on-site maintenance for each line presumably would be handled by the provider, how about overall network management? I know as a company you're constantly hiring, but do you think you'll have the manpower to handle it alone?\n\n3. How did you as a company react when an employee suggested doing this? It's a pretty crazy thing to do and I can't imagine you (as a company) agreed immediately. What made you decide that this was indeed the way to go? (I agree, for what that is worth!)\n\n4. How long do you think it will take for the investment this will require to pay off? \n\n5. I saw in another comment you mentioned how you hope to work with other games companies so that this isn't such a one of thing. A followup question I have to that is why do you think no one has done this already? \n\nI also have lots of questions just generally about how you manage your network and security because it fascinates me and it's what I want to do in my career! Do you guys have an email or something I can email some questions to? I understand of course if that's too much, but hey thought I'd ask!","replies":[{"poster":"WizardOTL","date":"2015-01-06T04:27:18.779+0000","up_votes":11,"down_votes":1,"body":"Thanks for the post! We are really excited, and we are actually trying to build a new type of network and actually change the meta of a Network engineer, so this is a TON of fun and really challenging.\n\n1. No, we have our own all optical network and we are asking the ISPs to send League traffic through that.\n2. We manage it internally. We have a great core team and we are actively recruiting to grow that group.\n3. Honestly, it took us a while to digest and wrap our heads around it. We had to meet with outside groups, and recruit people that have dealt with \"service provider\" networks versus data center networks. And then we ran some tests and found that this was the right path.\n4. We don't really look at it that way, this is the best for the players, so it is just something we need to do.\n5. I think there was a huge gap for software developers and data center network engineers to get over to understand this problem, and most games don't have the requirements that LoL has. So it really didn't manifest until now. As more games need this type of performance, you may see more companies doing this now.\n\nWould love to share more, but a lot of that is pretty security sensitive. Maybe come take a tour we can talk.","replies":[]}]},{"poster":"OblongOtter","date":"2015-01-06T00:14:59.963+0000","up_votes":4,"down_votes":0,"body":"I smell something to do with net neutrality when you talk about working with ISPs.  Sounds forced.  Sniff Sniff.","replies":[{"poster":"WizardOTL","date":"2015-01-06T00:23:44.522+0000","up_votes":13,"down_votes":1,"body":"No and yes. So we are forced to do this because of the way the Internet is architected, not because the ISPs are forcing us to. Net Neutrality is not in play here, this is just the way any network would have to be built to achieve our goals.","replies":[]}]},{"poster":"Fiorinol","date":"2015-01-05T23:21:47.389+0000","up_votes":12,"down_votes":3,"body":"Gnarsies here.\n\nAs much as I understand the effort and why certain areas might be problematic, I still don't understand why you still focus on \"building a dedicated network\" for League when you haven't moved the servers yet. On top of that, you pass through Amazon AWS to protect yourself against DDoS attacks. My packets end up communicating with a server in New Jersey owned by Amazon and I have no idea where exactly they are going and what route they take, yet if I do network tests with many other servers in that area, I don't get jitter (Ping variation) or packet loss. And yet for some reason, you point at ISPs and net neutrality. If the net is neutral, how does League get to have a \"League dedicated network\" rather than to be stuck on the same lane as everybody else?\n\nBesides, the US backbone has been more and more congested, resulting in overall increases in ping and packet retransmission (Which don't happen with League since I believe League uses UDP to transfer packets, so packets just get lost and never get re-transmitted) [Look at page 9 of this study done by M-Lab](http://www.measurementlab.net/static/observatory/M-Lab_Interconnection_Study_US.pdf ). This ping/packet issue isn't exclusive to Riot. I still do not understand why you aren't migrating the servers to an appropriate location other than Oregon, which is about as far as you can go if you look at any backbone topology;\n\nhttp://i.imgur.com/xUvNAYG.png\n\nIs this League network essentially a bunch of clusters set up in various locations to push along League traffic, much like a VPN pushes traffic through specific routes? Are you doing this exclusively for the Oregon server?","replies":[]},{"poster":"Masalar","date":"2015-01-05T23:55:26.731+0000","up_votes":5,"down_votes":0,"body":"OOO, I came up with a good question. How do you see what you're doing impacting gaming as a whole? By the sound of it, what you're working on sounds mostly LoL exclusive...but the same principles would hold true for all/most online games. Is this the sort of thing you could then sell/rent to other game companies? Or would this pave the way with ISPs for other companies to get similar systems in place? Is none of that really being considered yet because just getting this in place is more than enough work?\n\nThis is Toby Determined for the Gravity Falls Gossiper and inquiring minds want to know!","replies":[{"poster":"WizardOTL","date":"2015-01-06T00:18:49.554+0000","up_votes":10,"down_votes":2,"body":"Masalar,\n\nGreat question - and the honest answer is, \"we don't know.\" Every game's architecture is different, however we are working with other gaming companies to try and improve stability and make playing games more fun. I hope that helps.","replies":[]}]},{"poster":"Mascot 3000","date":"2015-01-05T23:11:49.128+0000","up_votes":2,"down_votes":0,"body":"I'm in the same boat as Masalar, and I'd like to know more about the US's internet infrastructure. Are there any resources that you'd recommend reading, either books or websites?\n\nAre there other services that also require a similar rapid transit of small data, like would torrenting be similar?","replies":[{"poster":"sonicdeathmonk","date":"2015-01-06T01:34:49.456+0000","up_votes":6,"down_votes":0,"body":"http://web.stanford.edu/class/msande91si/www-spr04/readings/week1/InternetWhitepaper.htm\n\nhttp://qz.com/187034/how-the-internet-works-and-why-its-impossible-to-know-what-makes-your-netflix-slow/\n\nhttp://www.pcworld.com/article/2151483/report-u-s-internet-providers-allow-congestion-and-want-cash-to-clear-it-up.html\n\nhttps://ipp.mit.edu/sites/default/files/documents/Congestion-handout-final.pdf","replies":[]}]},{"poster":"Laslow","date":"2015-01-06T01:21:07.150+0000","up_votes":6,"down_votes":0,"body":"Hey guys - I'm a Cisco Network Engineer by trade (deal with BGP/EIGRP/MPLS/etc) for the past 15 years and have been hit really hard here in Manhattan.  I live near Wall St. and use Verizon Fios in my building.  I've been having severe packet loss for the past 2-3 weeks.  I can't play ranked anymore and will be bummed if the packet loss isn't fixed by the time the season starts.\n\nMy question is - Should I stick it out with Verizon or switch to another provider?  My ping never really changed with the recent issues (95-120) and I can deal with the ping since it's 'consistent' but the packet loss is so sporadic that it makes it hard to actually CS at times.\n\nI wish I could do a trace route to see where I was getting the issues, but with Layer 2 routing and MPLS it's basically impossible these days to see where packets are really going.\n\nLast question - I bought VyprVPN to see if that would help and haven't had time to test it thoroughly yet.  Will this help my connection?  I'm not sure if Verizon is using my source/destination IP's to throttle my traffic (like they did with Netflix) or if it's just a general 'lump data' issue and real time things like games suffer no matter who they are.\n\nMy biggest worry is that Riot would get popular enough for ISP's to take notice  and then start throttling until the customer or Riot started paying extra (again, like Netflix).\n\nThanks for all the work you guys are doing, I know it takes time, and understand the intricacies with building out a large scale network/dealing with so many different providers.\n\nEdited question:  What happened in the past 4-6 weeks that started causing people to have such big problems?","replies":[{"poster":"WizardOTL","date":"2015-01-06T01:38:10.002+0000","up_votes":7,"down_votes":1,"body":"Great question! We are working as fast as we can with Verizon to peer with them, and are not aware of any issues (though I just reached out to their VP of network infrastructure). We are also working to make sure that we are not going to get throttled, our traffic is really low (300k or less) so that shouldn't be a problem. I really don't think the VPN service is worth it, but it does not hurt to try.\n\nThank you for playing ! Even if you are a Cisco guy ;) Seriously though, great post.","replies":[]}]},{"poster":"poopypeepy","date":"2015-01-05T23:25:34.709+0000","up_votes":7,"down_votes":1,"body":"I've been complaining a lot recently about the Riot servers (rather sensibly) and I appreciate this post because not only does it explain the terrible connection, it also explains how it is being fixed. This is the first time I have EVER seen Riot NA talk about the problems with there servers WITH a solution. I'm also happy to know that the measures being taken are going to have a drastic improvement, and I'd rather this and wait a little bit than a tiny, instant fix. So thank you Riot team for finally announcing your intentions. It's all a lot of us have been asking for for several weeks/months.","replies":[]},{"poster":"TheGrayBuffoon","date":"2015-01-05T23:15:25.917+0000","up_votes":8,"down_votes":2,"body":"What about the other issues that are plaguing so many players like constant DCing of PvP,Chat, inability to access the store, etc.?  Will your new work rectify these issues?  Its just not Pings  My ping is quite fine and when I am in the load screen it takes no time for me to get to 100% but prior to this I am constantly getting disconnected from, again, PvP Chat.","replies":[{"poster":"sonicdeathmonk","date":"2015-01-05T23:38:19.238+0000","up_votes":6,"down_votes":1,"body":"Network quality has been a big focus for us in 2014 with a ton of planning and work being accomplished.  As work continues into 2015 players should see improvements in network quality for many of the LoL services though game play is our biggest focus.  It might be worth contacting player support about your specific frequent issues with PvP chat disconnecting.","replies":[]}]},{"poster":"Limy Monkey","date":"2015-01-06T02:09:04.809+0000","up_votes":4,"down_votes":0,"body":"As I understand it, this will greatly reduce packet loss and disconnects, but largely leave ping untouched. From my experience, packet loss and disconnections may be annoying, but they are also not the major issue. My constant ping of about 100ms may be reduced to maybe 80 or so, and i will no longer receive 8-15 ping spikes per game.\n\nWhile this is all said and good, from my perspective, an East Coast server would reduce my constant ping to < 50, possibly < 30. This would be coupled with reduced ping spikes and fewer disconnections, but in my mind (and the majority of League players' minds), constant ping is more important than a few packet losses or ping spikes each game. I understand that adding an East Coast server produces extra technical issues, namely having games with people on both the east coast and west coast of the US playing simultaneously.\n\nMy question after stating the above is: can you honestly say that this current course of action is the most effective way of increasing performance for East Coast players? Or am I to assume Riot is simply trying to avoid the technical issues of adding an East Coast server? Finally, is there a list of ISP's you have gotten confirmation of their assistance in this current course of action? And is there anything I can do to make sure my ISP is on that list?","replies":[{"poster":"Riot Ahab","date":"2015-01-06T02:56:39.341+0000","up_votes":6,"down_votes":1,"body":"The current course of action (Phase 2 of the NA Server Roadmap) will likely not provide the biggest impact (ping-wise) to East Coast players, you are correct. It will have other big impacts as you listed to packet loss and connection stability.\n\nPhase 3 (server centralization), however, is much more likely to deliver the results you're looking for by minimizing the physical distance between players all over NA to the game servers. The frustrating thing is we don't have a timeline to share on this phase just yet, but it is coming with agreement/contract working happening in the background.\n\nWe now peer with Comcast, Charter, Shaw, Telus, and we are in negotiations with Time Warner Cable, Verizon, Cox Communications, CenturyLink, and many other ISPs. We're targeting those that carry most of our players, so odds are your ISP is already on the list of folks we are talking to!","replies":[]}]},{"poster":"CommandShockwave","date":"2015-01-06T00:49:57.022+0000","up_votes":2,"down_votes":0,"body":"As someone on the west coast (on telus, in Langley BC [30 mins from Vancouver], if it helps) what does this mean for my connection?\n\nAre we talking better for EVERYONE, or is this mainly a solution directed towards east coasters? I can't say I have a right to complain if I see a ping increase, but I surely hope I don't. After years of 20-40 ping, jumping to a constant 60-70 is a bigger deal than you might think, seriously, those diminishing returns you mentioned are highly subjective.","replies":[{"poster":"Riot Ahab","date":"2015-01-06T00:58:53.018+0000","up_votes":5,"down_votes":1,"body":"This network should bring a marginal improvement for everyone - coast to coast. West coasters are impacted by this as well - we've seen traffic in San Francisco get bounced across the country before finally getting to the server.","replies":[{"poster":"CommandShockwave","date":"2015-01-06T01:03:28.645+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Ahab,realm=NA,application-id=osqw6G4M,discussion-id=AMupzBHw,comment-id=001a0000,timestamp=2015-01-06T00:58:53.018+0000)\n>\n> This network should bring a marginal improvement for everyone - coast to coast. West coasters are impacted by this as well - we've seen traffic in San Francisco get bounced across the country before finally getting to the server.\n\nSo will this Riot-owned backbone offset the increase in distance once the servers are centralized? After playing with an average 30 ping and pretty much zero spiking-issues for 1.5-2+ years now, it's safe to say I (and most of my friends) don't fall into the category of people who are having their traffic bounced cross-continent, so I'm curious if \"a marginal improvement\" is the final answer to the full equation, or only until the centralization happens.\n\nI don't mean to sound pushy btw, I'm just hoping for some clarification on your statement. ","replies":[{"poster":"Riot Ahab","date":"2015-01-06T01:10:33.982+0000","up_votes":6,"down_votes":1,"body":"Exactly - the backbone should deliver as comparable an experience as possible east to west coast once servers travel to a centralized location.","replies":[]}]}]}]},{"poster":"Nausicäa ","date":"2015-01-06T00:17:45.407+0000","up_votes":4,"down_votes":2,"body":"Can you explain why NA servers have not be moved to a more centralized location? More importantly, you recently upgraded your servers, why not take that opportunity to move the servers to central US?","replies":[]}]}