{"poster":"Alone Musk","date":"2015-02-08T20:51:34.050+0000","title":"Übertriebener Modus (Idee für den 1.April)","subforum":"Karten & Spielmodi","up_votes":0,"down_votes":3,"body":"> Stellt euch mal einen Modus vor der einfach nur Hirnrissig und Behindert ist.\nz.B. mit 5 Nexus Towern, 6 Inhibitorn, Alle Camps sind Blue/Red Buffs und natürlich noch derbe andere scheiße.\n\nAlso einfach nur die KDB , die verändert wird und nen neuen modus ergibt.\n\n> 5 v 5\n5 pro team\n6 Inhibitoren\nNur Blue und Red buffs\n3 Barons beim Baron camp\n5 Dragons im unteren Teil des Flusses\nZu VIELE Gebüsche (Rengar hätte spaß xD) so ca 500\n60-80% cooldownreduction\nreduzierte manakosten\nalles größer (champs tower buffs nashor dragon ...)\nEiskalt alles übertrieben\n100%mehr hp\n100% mehr ap\n100% mehr ad\n100% mehr Mana \n100% mehr rüstung und magieresistenz\n50% mehr lauftempo \nAlle Tower sind Super tower\nMinion Spawnrate 40 pro wave\nNexus HP 1000000\nTower HP 20000-25000\n5 Nexus tower\n> Normal pick\nManche Itempassives haben 90% verringerte cooldown:\n> Hextech Gunblade,Gefräßige Hydra,Amulett der Eisernen Solari,Yuomus Geistklinge,Redliche Pracht.Zwillingsschatten,Alle Support items (Gebirgs...,Amulett...,Anrecht)\n\nMejais und Schwert des Okkulten lassen sich stacken (man holt sich 6 davon und kriegt dann 6 x 180 :D oder 5 davon und ein Rabadons .\n\n> Man hat 10 Itemslots also der Modus ist retarded bis zum ka 3 käse hoch ...\n\nhatet mich ruhig aber ich würde es für den 1.april lustig finden      \n\n  (P.S. hab die umfrage vergessen einfach ja oder nein schreiben :D)","replies":[{"poster":"Dat Ding15","date":"2015-02-08T20:56:15.357+0000","up_votes":2,"down_votes":0,"body":"Ich glaub die größe der Map, wär ein großes Problem...","replies":[]},{"poster":"Faker is Buschi","date":"2018-07-24T13:57:17.582+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen .\n\nEigentlich bin ich hier,um nur mal meine Meinung über das neue lol mit zu teilen.\nEinfach und schlicht gesagt schrott müll oder wie auch immer.\nTatsache ist nach 8 Jahren lol , ist das game so wie bei allen anderen guten bekannten spielen (Aion/Metin/4Stoy),\nvöllig degeneriert der damage ist im vergleich zu den vielen champs arten nicht mehr nachvollziehbar ich meine ap/adc klassen sind mit teilweise einer Atacke one-hit (idiotisch) den wie soll jemand da noch plays machen oder sein können beweisen.\nDazu kommen die immer behinderten neuen champs dazu,ich mein in Ranket werden nur noch 10-15 bestimmte champs gespielt wenn man weiter kommen will.\ndie Leute in L.A sollen mal aufhören so viele Drogen zu konsumieren damit sie mal wieder ,klar denken können .\nso sieht es nach 8 Jahren lol bei mir aus .... spiel fängt an 2-4 min später möchte ich einfach das game nur noch quiten in aram als beispiel.\nAber eigentlich sollte ich dankbar sein ^^ so spar ich mir seit etwa 3 Jahren 100 Euro aufladen im Monat danke Riot ^^\nden erst wenn das Game wieder sinn macht und meine Leute wieder lust bekommen auf das spiel werde ich mir überlegen ob es lohnt weiter Skins zu kaufen gg Riot weiter so.\nAch ja ^^ streicht die artikel aus der agb oder löscht sie vollständig den ich find es nicht fähr das mitlerweile fast jeder mit makros spielt ....\nbeispiel... malzar ultet anni die haut aber nach 1.5 sek ihren stan raus ?????? wie sie kann nicht ^^auser die skills gehen nachträglich noch raus ...was bei mir heist das der befehl nacheinader ausgeführt wird ..sprich makro user  gg.","replies":[{"poster":"Mjölnir Kind","date":"2018-07-24T14:01:05.345+0000","up_votes":1,"down_votes":0,"body":"Wenn du deine Meinung über LoL uns mitteilen willst und drüber reden willst, erstell doch einfach einen eigenen Thread und kommentiere nicht auf einem 3 jahre alten Thread","replies":[]}]}]}