{"poster":"Meterbacsi","date":"2015-10-10T20:03:09.718+0000","title":"Invitel lagg?!","subforum":"Általános beszélgetés","up_votes":6,"down_votes":0,"body":"Sziasztok!\nAz&eacute;rt nyitottam ezt a t&eacute;m&aacute;t, hogy megk&eacute;rdezzem csak nekem j&aacute;tszhatatlan a j&aacute;t&eacute;k? Mikor elkezdtem a j&aacute;t&eacute;kot (2 &eacute;ve) fix 31ms-el j&aacute;tszottam. Ezen a ny&aacute;ron ez felment 45-re de m&eacute;g mindig j&aacute;tszhat&oacute; volt a j&aacute;t&eacute;k semmi baj. De most.... kb szeptember k&ouml;zep&eacute;től katasztr&oacute;fa 60 ms a j&aacute;t&eacute;kban akkora k&eacute;s&eacute;s van mint a h&aacute;z, de tűrtem. Ma este kiakadtam, el&eacute;rtem azt, hogy 90ms-t jelez m&aacute;r, a j&aacute;t&eacute;k bet&ouml;lteni alig akar. A k&eacute;rd&eacute;sem az lenne, hogy m&aacute;s Inviteles is tapasztal ilyet? Van egy bar&aacute;tom aki szint&eacute;n enn&eacute;l a szolg&aacute;ltat&oacute;n&aacute;l van &eacute;s ő is panaszkodik. \nSpeedtesten semmi extr&aacute;t nem mutat a m&eacute;rő, akkor mi lehet a baj? A windows 10 esetleg...?\n\nNetem: http://www.speedtest.net/my-result/4734915759","replies":[{"poster":"Deapimp","date":"2015-10-10T21:13:37.416+0000","up_votes":4,"down_votes":0,"body":"Pont ugyan ez van most nálam is 54 fix ping tegnap este 85 fix se le se fel nem ment valami gáz van az invitelnél kb 2 hete ilyen nálam azelőtt 30-35 ping volt. Én már próbáltam laptop on win 7 asztalin win 10 ugyan az most is fix 58 ping en játszhatatlan. EUW-is és EUNE-is ugyan ez..","replies":[]},{"poster":"R3wan","date":"2015-10-10T21:50:10.380+0000","up_votes":2,"down_votes":0,"body":"Kisebb-nagyobb lagokat tapasztalok, de a 60 ms még teljesen normális egyébként. Zavaróbb, amikor fogja magát és felugrik 8-900-ra. De ezt most csinálja, nyáron sűrűn szakadt. Az még rosszabb volt.","replies":[]},{"poster":"Anonym Feeder","date":"2015-10-20T15:55:48.337+0000","up_votes":1,"down_votes":0,"body":"Na ne szórakozz!!\nAzt hittem én indítottam a témát! Mintha csak magamat látnám! \nEzt a videót anno 70-ben töltöttem fel pont ezzel a címmel : https://www.youtube.com/watch?v=ojyRVMny1SM\nIlyen egy átlagos meccsem, és még ne legyek idegbeteg? :D Viccnek tartom a szolgáltatót, gyakran hívtam már őket sz.rnak az egészre, egy olyan szolgáltató amit ha tudnék úgy perelnék, hogy csődbe is mennének! Az egész faluban ELVISELHETETLEN az internet! Egy Google kezdőlapot van hogy fél percig tölt és csak éjjel jó a pingem, de 11:00-23:00 között nem tudok 1 meccset lagg nélkül játszani. 80 ping alá nem megy, de a késés akkora, hogy mikor meglátom hogy csak úgy a semmitől megy le a HP-m a modemet majdnem ketté töröm, bánom hogy még nem tört szét.\nLassan úgy vagyok, hogy jobb lenne Invitel nélkül mint vele. Más szolgáltató nincs a faluban, hívtam már vagy 200 szolgáltatót sajnos nem tervezik, hogy ide bekössenek mást. \n\nUi.: A videó egy nagy ... nem foglalkoztam vele, csak hogy lássák az Invitelesek milyen jó is a szolgáltatásuk.\n2. Nekem 5Mbites net van, van hogy 0.37Mbit /secet mértem, na ekkor gondolkodtam el a perelésen.","replies":[]},{"poster":"äkita","date":"2015-10-18T19:13:56.480+0000","up_votes":1,"down_votes":0,"body":"Sziasztok !\nEast szerveren játszok 3 éve 10 megás nettel kezdtem 30-35 körüli pingel\nszeptemberben váltottam 20 megás netre. ( UPC ) pingem a lolba 31-35 Wb ideje alatt 31-35 semmi laggolás nem tapasztalható. ( akkor van minimális lagg ha bejön az új patch és valamit elbasznak ) haverok akikkel játszok T-homosok Invitelesek mindenkinekk laggol a lol a Ms 35-999 között ugrál ( ha teamfightvan akkor stabil 200 ms ) mielött el kezdődött a Wb semmi baj nem volt.. dehát szerintem senki ne csodálkozzon hogy nagy a pingje wb alatt mert a kliens nem birja a nagy terheltséget én szerintem : ) tehát vagy ne játsz még megy a Wb vagy menj be a legközelebbi Ups irodába és igényelj tőlük csomagot : )","replies":[]},{"poster":"SportzMan","date":"2015-10-12T07:33:19.315+0000","up_votes":1,"down_votes":0,"body":"A szeptember közepén elkezdődő laggokhoz biztos van köze a vb közvetítéseknek. De abban igazatok van, hogy előtte is voltak ping gondok, meg utána is biztosak lehetünk benne, hogy lesznek és ezt ISP-től szinte függetlenül mondhatom (talán a DIGI az egyetlen, amiről nem hallottam ilyet). De azért vegyétek azt is figyelembe, hogy az ilyen hálózati jellegű problémáknak az elhárítása nem egyszerű, ugyanis számtalan faktort kell figyelembe venni: szerver oldali hálózat, ISP oldali hálózat, és még a saját otthoni hálózatunk is. És most ne gyertek azzal hogy, de hisz egy hete még hibátlanul működött, mert egy nap alatt is meghalhat a routered, switched, modemed; új driverek települhettek windows által, sérült az utcába bekötött vezeték valamilyen ok miatt és stb.. És a másik kedvencem ez a \"de hát 2 éve még jó volt a pingem\" kategóriás hozzászólás.. Könyörgöm, ez alatt a két év alatt annyit változott a hálózatok kihasználtsága amiatt hogy már a 6 évesek a facebookon és youtube-on néznek hd videókat(és inkább nem sorolom tovább), hogy ne akarjátok összehasonlítani.. Kész fejleszteni kellene a hálózatokat az ISP-knek magyarországon, de vagy nem akarják vagy nagy szabású változtatást akarnak, ami nem ma fog bekövetkezni..","replies":[{"poster":"Bubi a Cica","date":"2015-10-12T21:01:51.762+0000","up_votes":1,"down_votes":0,"body":"Ha jobban belegondolok, akkor az én laggom akkor kezdődött, mikor a kibeba...ott facebook elkezdett automatikusan videókat lejátszani. Lehet megeszik az összes netemet?","replies":[]}]},{"poster":"Shiroe","date":"2015-10-11T16:52:27.941+0000","up_votes":1,"down_votes":0,"body":"Na mostmár EUW szerveren is amerikai szerver IP-t látok a windows erőforrás figyelőben IP alapján , szóval most már ott is laggol :) eddig még mindig  ireland volt ha EUW-ra logoltam, nem is volt semmi laggom.\n\nhttps://www.iplocation.net/\n\n185.40.64.69  irelandos ez volt EUW, máig..\n54.69.249.74 ez meg az USA Oregonos, ez EUNE máig is, most már west is és ott is laggolok végre yee \\o/","replies":[]},{"poster":"IronGamer123","date":"2015-10-11T10:46:33.332+0000","up_votes":1,"down_votes":0,"body":"Nyugi emberek én is tapasztaltam ez azért van mert sok értelmesék a lol-on keresztül nézi a vébé-t igy sokan vannak fent a szerveren és igy nagy a szerver laggok nekem is 500-600 ra fel ugrik a ms ugy hogy mindenki mondja az ismerösének hogy youtubén néze  ne  alolon keresztül","replies":[{"poster":"Meterbacsi","date":"2015-10-11T15:42:00.463+0000","up_votes":1,"down_votes":0,"body":"már a vébé előtt is csinálta :S","replies":[{"poster":"IronGamer123","date":"2015-10-11T16:07:26.628+0000","up_votes":0,"down_votes":0,"body":"akkor lehet ez az új pathc a hibás","replies":[]}]}]},{"poster":"Shiroe","date":"2015-10-11T15:28:31.333+0000","up_votes":1,"down_votes":0,"body":"Nekem csak EUNE szar egyedül, EUW tökéletes akármikor logolok át oda, még ha EUNE laggol is épp. Illetve minden más netes játék tökéletesen müködik, amikor is EUNE laggol ha gondol 1et.","replies":[]},{"poster":"Pomegranate","date":"2015-10-11T09:05:53.906+0000","up_votes":1,"down_votes":0,"body":"Sziasztok! Nekem is ilyen gondom van. Mikor 2 éve elkezdtem a lolt semmi bqj nen volt, de nyár elején már kezdtem érezni hogy valami nem okés mert laggoltam miközben kint sütött a nap.... Mostanában egy gamet nem tudok menni anélkül hogy ne kapjak percenkénti idegbajt :)","replies":[]},{"poster":"Meterbacsi","date":"2015-10-11T08:06:14.183+0000","up_votes":1,"down_votes":0,"body":"2 éve 5 megás nettel kezdtem, még azzal is 30 körül járt a pingem, aztán később 10 megára emelték nem volt semmi gond most 30 ezzel sem VOLT gond csak most szeptember közepétől játszhatatlan.. engem nem zavar hogy mennyit mutat csak játszható legyen a játék.. és sajnos ez mostanság nem mondható el :(","replies":[]},{"poster":"Mind The Gap","date":"2015-10-11T05:33:46.027+0000","up_votes":1,"down_votes":0,"body":"Nekem úgy 5.10-es frissítésig volt 35 pingem, azóta össze teszem a két kezem, ha meglátom az 50 pinget. Nem tudom, mit csináltak, de kijavíthatnák, mert elég sokszor droppol, és azóta az alap pingem nem kevesebb, mint 50-60. Inviteles netem van btw.","replies":[]},{"poster":"Őrangyal","date":"2015-10-11T04:42:28.805+0000","up_votes":1,"down_votes":0,"body":"Itt is ugyanez a helyzet. 81-90-re felugrott és van hogy még magasabbra is... Szomorú, remélem javítva lesz.","replies":[]},{"poster":"Tetth","date":"2015-10-10T21:59:34.212+0000","up_votes":1,"down_votes":0,"body":"Még mindig jobb az enyémnél. :D \n\nhttp://www.speedtest.net/my-result/4735122447\n\nViszont nálam ezzel a kis aranyos 10 megás nettel semmi probléma vagy minimális lag sem tapasztalható. A pingem 40 és 70 közt ingadozik, mikor hogy. Arra pedig hogy miért emelkedik időről időre a pinged, szerintem nem tudjuk a pontos választ.","replies":[]}]}