{"poster":"JackParrot","date":"2018-01-07T18:43:19.719+0000","title":"Cheater","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Signori evocativi,\r\nVi scrivo per portare a galla un problema che si &egrave; presentato (non credo solo a me) durante la fase di gioco in cui ogni evocatore picka il proprio campione.\r\nAlcune volte mi &egrave; uscito dalla partita come se qualcuno avesse dodgiato, per poi dirmi che ero stato io. \r\nIo naturalmente non ero uscito dalla selezione dei campioni e comunque mi ha dato una penalit&agrave; nella coda. \r\nDopo 5/6 volte che mi succede non posso credere che sia una coincidenza, ma ho letto che potrebbero essere altri giocatori che, insoddisfatti della partita, tramite un programma fanno dodgiare gli altri giocatori al posto loro.\r\nNe sapete qualcosa? Ringrazio in anticipo.","replies":[{"poster":"Floppyz","date":"2018-01-07T19:24:14.758+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=TheFrostWarlock,realm=EUW,application-id=MJVj50Jw,discussion-id=1axAPsAr,comment-id=,timestamp=2018-01-07T18:43:19.719+0000)\n>\n> Dopo 5/6 volte che mi succede non posso credere che sia una coincidenza,\n\nNon è una coincidenza, probabilmente hai qualche problema a livello PC/client/connessione. Potresti cominciare con questo: https://support.riotgames.com/hc/it/articles/224826367\n\n> ma ho letto che potrebbero essere altri giocatori che, insoddisfatti della partita, tramite un programma fanno dodgiare gli altri giocatori al posto loro.\n> Ne sapete qualcosa? Ringrazio in anticipo.\n\nQuel che so è che questa cosa non è vera. Verifica client/PC/connessione.","replies":[{"poster":"JackParrot","date":"2018-01-09T19:16:34.917+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=1axAPsAr,comment-id=0000,timestamp=2018-01-07T19:24:14.758+0000)\n>\n> Non è una coincidenza, probabilmente hai qualche problema a livello PC/client/connessione. Potresti cominciare con questo: https://support.riotgames.com/hc/it/articles/224826367\n> \n> Quel che so è che questa cosa non è vera. Verifica client/PC/connessione.\n\nOkok, grazie mille, scusate la mia paranoia ^^\"","replies":[]}]},{"poster":"Sorcio84","date":"2018-01-08T20:14:25.038+0000","up_votes":1,"down_votes":2,"body":"sono stao su alcuni siti, ho letto che ci sarebbe un modo per ddossare alcuni giocatori in game, ma non in champ select, oltre ad un presunto tool per vedere i pick nemici ecc. Alcuni siti sono chiusi solo agli iscritti. Non linko e no provo questi cheats, però chiedo che l'attenzione rimanga sufficentemente attiva giusto per escludere ogni caso di cheat attuali e nuovi.","replies":[{"poster":"Floppyz","date":"2018-01-08T21:13:16.271+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sorcio84,realm=EUW,application-id=MJVj50Jw,discussion-id=1axAPsAr,comment-id=0002,timestamp=2018-01-08T20:14:25.038+0000)\n>\n> sono stao su alcuni siti, ho letto che ci sarebbe un modo per ddossare alcuni giocatori in game, ma non in champ select, oltre ad un presunto tool per vedere i pick nemici ecc. Alcuni siti sono chiusi solo agli iscritti. Non linko e no provo questi cheats, però chiedo che l&#x27;attenzione rimanga sufficentemente attiva giusto per escludere ogni caso di cheat attuali e nuovi.\n\nPremesso che Riot per forza di cose tiene sempre d'occhio la situazione da questo punto di vista (ed è sicuramente più sul pezzo di noi), per come funzionano le cose ora, non è possibile attaccare direttamente i giocatori, quindi niente DOS.\n\nStesso discorso per cose come vedere i pick nemici (finché non li invii al server, solo il tuo client sa cosa hai pigiato, e dopo che invii l'informazione al server, non è possibile ottenerla perché, per farla semplice, non è programmato per fornirla).","replies":[{"poster":"Sorcio84","date":"2018-01-09T04:57:18.476+0000","up_votes":1,"down_votes":0,"body":"meno male, quindi quel periodo in cui prepickavo a caso e 8 su 10 i nemici mi bannavano il pick, era solo un caso. meglio così. Grazie.","replies":[{"poster":"Floppyz","date":"2018-01-09T17:22:25.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorcio84,realm=EUW,application-id=MJVj50Jw,discussion-id=1axAPsAr,comment-id=000200000000,timestamp=2018-01-09T04:57:18.476+0000)\n>\n> meno male, quindi quel periodo in cui prepickavo a caso e 8 su 10 i nemici mi bannavano il pick, era solo un caso. meglio così. Grazie.\n\nUn caso, oppure pickavi qualcosa che in quel momento era popolare/molesto, o ancora, se eri uscito da precedenti lobby, magari hai rincontrato le stesse persone, che ti avevano visto fare il pick nella precedente lobby (o ovviamente un mix di tutte queste possibilità).","replies":[{"poster":"Sorcio84","date":"2018-01-10T00:33:17.464+0000","up_votes":1,"down_votes":0,"body":"Ottimo grazie ( 'w')","replies":[]}]}]}]}]},{"poster":"lStardustl","date":"2018-01-07T21:33:21.158+0000","up_votes":1,"down_votes":0,"body":"Non è un cheat.\n\nContatta il supporto:\nhttps://support.riotgames.com/hc/it","replies":[]}]}