{"poster":"JackParrot","date":"2018-07-16T00:40:55.961+0000","title":"Bug prezzo in RP","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Hey ragazzi, come sapete l&#039;evento Vs di quest&#039;anno si &egrave; appena concluso. Arrivo un po&#039; in ritardo a chiederlo, ma a me &egrave; capitato che ad inizio evento ho visitato il negozio del client e qui mi veniva proposto il bundle (10 sfere del Lupo+10 sfere del Leone +48 gettoni evento+2 icone evocative) al bassissimo prezzo di 500 RP.\r\nSenza farmi troppe domande ho acquistato il pacchetto pagandolo lo stracciato prezzo di 5&euro;.\r\nSolamente confrontandomi con dei miei amici mi sono reso conto che in realt&agrave; il prezzo del bundle era di (giustamente) 5.000 RP e non 500, ma io avevo comunque speso solamente 500 RP nulla mi &egrave; stato richiesto di pi&ugrave;.\r\nQualcuno sa dirmi se &egrave; gi&agrave; accaduto ad altri o sono stato solo io il fortunato?\r\nRingrazio in anticipo.","replies":[{"poster":"Runä","date":"2018-07-16T10:20:10.965+0000","up_votes":2,"down_votes":0,"body":"E' successa veramente questa cosa, anche io ho comprato il bundle a 500 rp pensando mi desse solamente 2 sfere con i gettoni, quando sono andata sui premi e mi sono vista 20 sfere mi si è storto il naso pensando al prezzo così basso.\nEra sicuramente un bug iniziale del negozio dal momento che alcuni miei amici volevano acquistarlo un ora dopo ma il prezzo stava a 5000 rp\nC'è stato anche chi per sbaglio ne ha comprati due ed il secondo gli è stato rimborsato con 500 rp","replies":[]},{"poster":"beppedessi","date":"2018-07-16T07:31:35.625+0000","up_votes":1,"down_votes":0,"body":"Accidenti! Puoi mettere lo screen del tuo storico degli acquisti nel negozio? Francamente stento a crederci che sia successo....","replies":[{"poster":"JackParrot","date":"2018-07-16T14:35:23.277+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=beppedessi,realm=EUW,application-id=MJVj50Jw,discussion-id=3A1v2Z3l,comment-id=0000,timestamp=2018-07-16T07:31:35.625+0000)\n>\n> Accidenti! Puoi mettere lo screen del tuo storico degli acquisti nel negozio? Francamente stento a crederci che sia successo....\n\nAppena posso te lo posto :)","replies":[]}]}]}