{"poster":"Auron1337","date":"2016-05-26T23:50:51.874+0000","title":"Support sucht ADC","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"gr&uuml;&szlig;e meine lieben ich spiele lol seid fast der ersten stunde\r\nhatte aber eine fast 4 jahre lange pause entsprechend ist auch meine flist nicht mehr aktuell\r\n\r\nich suche also sehr aktive ADC&#039;s f&uuml;rs ranked spielen oder ein team was entsprechend ein sehr aktiven supporter sucht\r\n\r\nich selbst stelle weder anforderungen an das alter noch die elo \r\n\r\nsolltet ihr interesse haben addet mich einfach ingame Auron1337\r\n\r\ngr&uuml;&szlig;e","replies":[{"poster":"Auron1337","date":"2016-05-27T18:40:35.000+0000","up_votes":1,"down_votes":0,"body":"na wo stecken denn die ganzen teams den noch ein sehr aktiver supporter fehlt ? :P meldet euch\n\ngrüße","replies":[]},{"poster":"LCG mozuki","date":"2016-05-27T16:15:32.765+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst.\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Hearthstone, etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/tAy6UKsy-aequilibritas-esports-sucht-mitglieder-community-und-esports-lol-csgo-hearthstone-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Metronus631","date":"2016-05-27T09:26:09.386+0000","up_votes":1,"down_votes":0,"body":"Hey ich habe dich mal geaddet bin Adc main und suche auch\neinen supporter main für duoq und so weiter naja kanst ja anehmen \nwenn du bok hast : Metronus631","replies":[]},{"poster":"Auron1337","date":"2016-05-27T08:58:36.970+0000","up_votes":1,"down_votes":0,"body":"so ein paar leute haben sich schon gefunde die suche nach einen aktiven ranked team ist natürlich noch aktuell \n\ngenau so kann sich gerne auch jeder adc melden der aktiv auf bot mit mir spielen möchte\n\ngrüße","replies":[]}]}