{"poster":"MrFix0o","date":"2016-04-20T12:05:27.114+0000","title":"Draghi Random...WTF?!","subforum":"Discussioni generali","up_votes":4,"down_votes":4,"body":"Con l&#039;arrivo della Patch 6.8 ci saranno dei grossi cambiamenti come alcuni di voi sapranno\r\n( per chi non lo sa: http://www.surrenderat20.net/2016/04/419-pbe-update.html )\r\nOltre al cambiamento degli item da mago, e di alcuni maghi, c&#039;&egrave; anche un cambiamento per i mostri neutrali, dei buff blu e rosso...ma soprattutto dei draghi...ed &egrave; di quest ultimi che voglio parlare...\r\nMagari sono io che non vedo oltre, ma questa cosa dello spawn casuale dei draghi non la capisco proprio...\r\nQuesto &egrave; un gioco competitivo, e come tale, non dovrebbe basarsi sulla casualit&agrave;, ma con statistiche uguali per tutti i game, in modo da rendere pi&ugrave; competitivo e basato sulla bravura dei giocatori...\r\nRendendo Random il tipo di spawn dei draghi va a minare quest&#039;ultima...io questa cosa la trovo priva di senso...\r\nIl Match pu&ograve; cambiare in base al tipo di drago che spawna...\r\n\r\nMettiamo caso che il Team A prende solo un drago di tipo Fuoco, quindi ha l&#039;8% di Ap e Ad in pi&ugrave;...Ma sono tutti Tank con pochi danni, quindi non va ad aumentare poi di molto, ma il Team B prende quello di tipo Terra e ha il 10% di danno in pi&ugrave; come true dmg sui mostri Epici (tra cui i draghi ricordo) e torri, il che vuol dire che hanno un vantaggio ENORME sul team avversario sugli obbiettivi, che vanno ad incrementarsi, Spawna ancora un drago di Terra, il Team B se lo aggiudica, e ora ha 20% in pi&ugrave;...e un altro ancora...30% in pi&ugrave;...siamo a 35 minuti, con cos&igrave; tanto danno sulle torri il Team A &egrave; praticamente rinchiuso in base, spawna il BigDrago che conferisce il 50% in pi&ugrave; dei buff dei precedenti draghi...puf...Vinta easy...e con soli 3 draghi giusti...\r\n\r\nOra prendiamo li stessi Team, ma sta volta, facciamo lo spawn diverso dei draghi, il Team A si aggiudica quello dell Acqua, ogni 18s resotora il 10% della vita e mana mancante, sui tank con molta vita {{champion:36}} {{champion:14}}  o anche champ con un uso forte di mana in early {{champion:268}} {{champion:54}} Questo buff &egrave; una manna dal cielo...ogni 18s possono fightare senza ritegno, disingaggiare, ottenere vita e mana, e ricominciare...vantaggio -&gt; pi&ugrave; draghi -&gt; pi&ugrave; buff... vinta...se capitano quelli giusti...magari pu&ograve; spawnare quello dell aria che conferisce Spd fuori dal combattimento...ma siamo gi&agrave; nei Tf e qui &egrave; piuttosto inutile... fa perdere un Tf...il Team B vince, prende un drago, Terra, danno pi&ugrave; alto -&gt; Baron -&gt; Push -&gt; Altri Draghi utili -&gt; Win\r\n\r\nDi sicuro render&agrave; le partite ancora pi&ugrave; varie...ma se ne sentiva davvero la necessit&agrave;? Non sono gi&agrave; abbastanza varie? Facendo cos&igrave; non si avvantaggia di pi&ugrave; la fortuna che l&#039;effettiva bravura? Certo qui puoi dire: No, anzi qui devi essere pi&ugrave; bravo a non lasciarti sfuggire i draghi che sono pi&ugrave; importanti, devi calcolare di pi&ugrave; in base al buff che ottieni, essere pi&ugrave; flessibile...\r\nIn parte &egrave; vero, ma forse ad alti eli, con gente con un bel cervello che pu&ograve; calcolare tutto e avere tanta flessibilit&agrave;...ma la massa? Riuscir&agrave; a cambiare? Anche ignorando il Bronzo che &egrave; un gioco a se, il Gold e il Platino e in parte i Diamanti? siamo nella media...I giocatori Medi riusciranno ad essere pi&ugrave; flessibili e calcolatori in base al buff che ottengono? Secondo me no, secondo me le partite saranno vinte anche dalla fortuna, certo anche adesso &egrave; cos&igrave;...ma in questo modo aumenti di pi&ugrave; il fattore C...\r\n\r\n\r\nVoi cosa ne pensate? \r\nE&#039; sicuramente un cambiamento interessante, ma non mi piace moltissimo, magari mi sbaglio... sfortunatamente posso sbagliare anche io XD","replies":[{"poster":"DoubleT","date":"2016-04-20T13:00:13.919+0000","up_votes":1,"down_votes":0,"body":"Appunto perché lo spawn è casuale diventa fondamentale in fase di costruzione del team, non sbilanciarsi troppo su un versante. Proprio per poter sfruttare almeno 1 dei buff casuali i team potrebbero essere più bilanciati nella loro composizione. Forse (non ne sono sicuro) potremmo finalmente vedere meno team full tank o full AP o full AD.","replies":[{"poster":"MrFix0o","date":"2016-04-20T13:43:57.171+0000","up_votes":1,"down_votes":0,"body":"Non hai tutti i torti....\nPerò il vantaggio andrà sempre in base al drago e in che periodo lo si ottiene\nQuello del aria è più forte in early ma se lo ottieni più avanti più essere meno utile...\nOvviamente sono solo ipotesi...","replies":[{"poster":"DoubleT","date":"2016-04-20T14:56:12.981+0000","up_votes":2,"down_votes":0,"body":"Le tue sono ipotesi plausibili, che aprono infatti ad un discorso molto interessante secondo me: se ci pensi appunto per i vantaggi dei diversi draghi, non solo il team dovrà avere una composizione bilanciata, ma come dici tu, gli stessi draghi saranno obiettivi importanti da prendere in diverse fasi della partita.\nQuesto porterà di certo ad avere un gioco più variegato, il drago non diventerà più un buff fisso da prendere in momenti prestabiliti: un buff forte per l'early-game porterà a cercare un rush al drago nei primi minuti, un drago con un buff buono per il late-game potrebbe essere lasciato da parte fino ad un certo punto e poi contestato dai due team.\n\nCome vedi il tuo ragionamento apre ad una serie di possibilità che rendono il gameplay un po' più complesso ed un po' meno monotono.","replies":[{"poster":"MrFix0o","date":"2016-04-20T15:32:50.408+0000","up_votes":2,"down_votes":0,"body":"Già sono d'accordo sulla varietà, c'è da vedere se non sono un po troppo sbilanciati come buff... vedremo...\nDi sicuro è un cambiamento interessante...\n\n\n...e poi boh, credevo anche io di aver creato un post interessante...e poi mi ritrovo con un bel -1...grazie omino dei - !","replies":[]}]}]}]},{"poster":"Liorenato","date":"2016-04-20T12:27:16.918+0000","up_votes":2,"down_votes":1,"body":"Si aggiunge varietà ad un gameplay monotono.\nOvviamente mi riferisco all'andamento della partita e non al gameplay dei singoli champion che è sempre infinitamente esplorabile.","replies":[]},{"poster":"Darkinknight","date":"2016-04-20T16:49:48.053+0000","up_votes":1,"down_votes":0,"body":"Non credo che tu dica cose teoricamente sbagliate..pero da come vedo io,molto molto molto raramente mi trovo ad avere ad esempio 4 draghi nel mio team e 3 in quello avversario..di solito chi si prende il primo drago,salvo steal si prendera anche gli altri..anche i buff attuali avvantaggiano tutti si,ma alcuni molto di piu..ad esempio il maggior danno alle torri per i champ adatti a pushare, % di movimento per udyr esempio..secondo me cambiano solo i buff non la mentalita di gioco(a elo basso-intermedio),ma i draghi alla fine se li piglia tutti o quasi il team che sta vincendo esattamente come ora,non credo ci sara bisogno di cambi di mentalita..se poi risultano piu importanti e incentivano i player a prendere questi obbiettivi tanto meglio,magari alcuni capiranno che con lo score il game non lo vinci","replies":[{"poster":"MrFix0o","date":"2016-04-20T17:22:36.436+0000","up_votes":1,"down_votes":0,"body":"Nel mio esempio metto che un team prende un drago e l avversario ne prende 3, magari mi sono spiegato male...ma non è questo il punto...\nIl punto è che ora i buff sono legati allo spawn random dei draghi, non è più fisso, questo vuol dire che se ti va bene il buff vinci più facilmente, ma può capitare anche quello che non ti serve a nulla...\nNon lo so...anche tu hai ragione, ora i draghi sono più importanti...boh...\nMagari è una bella cosa...ma a me puzza...","replies":[{"poster":"Darkinknight","date":"2016-04-20T19:56:15.022+0000","up_votes":1,"down_votes":0,"body":"Tutti i buff sono un plus..se attualmente un team non ti contesta un drake normalmente,è perche non puo non perche del buff non importa..con i nuovi draghi sarebbe uguale,quindi non cambia nulla in campo di flessibilita..se prendi un buff importante in early,puo essere lo stesso inutile appunto perche è un qualcosa in piu,ma nulla di decisivo","replies":[]}]}]},{"poster":"anagoor","date":"2016-04-20T18:01:51.082+0000","up_votes":1,"down_votes":0,"body":"fortuna... sì... no... Non possiamo dire che è fortuna, dipende da quanto si è bravi ad utilizzare il proprio buff e dalla capacità del proprio team di prendere i draghi prima degli avversari, si dice fortuna quando tra due contendenti uno riceve uno strumento migliore rispetto ad un altro in modo completamente casuale, ma qui è ben diverso, in primis drago è uno ed è uguale sia per il team avversario che per sé, secondariamente il drago va conteso e dunque se lo aggiudica la squadra meglio organizzata.\nChe poi scusa tanto ma il discorso che questo buff funziona meglio per gli avversari che per noi non gira proprio, adesso è la stessa identica cosa, l'ad/ap bonus funziona meglio su certe composizioni che su altre e così vale per tutti gli altri buff, la sola differenza è che adesso sai già il buff che ti capiterà,lì no, di fatto non cambia assolutamente niente perchè sia in questo che in quel caso i team si affronteranno e lo prenderanno i più forti.","replies":[]},{"poster":"Tankerous","date":"2016-04-20T13:52:53.467+0000","up_votes":1,"down_votes":1,"body":"Penso che \"la massa\" dovrà imparare ad adattarsi, come sempre. Un pò di tempo e questa novità diventerà routine.","replies":[]}]}