{"poster":"EzeK","date":"2015-04-25T17:16:20.638+0000","title":"Leona Support.","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"En fin... estoy jugando bastante con Leona ya... hasta el echo de que prefiero jugar de supp que de JG ( lo que me gusto al empezar el juego )\r\ntengo unas dudas como :\r\nRunas ? : \r\nuso\r\nmarcas : da&ntilde;o \r\nSellos : armadura\r\nGrifos : resistencia magica.\r\nQuintaesanias o algo asi : 3 de da&ntilde;o.\r\n\r\nesta bien las runas ? o algun consejo de que mejorar?.\r\nrealmente a los adc... digamos &quot; blandos &quot; a lv 2, les bajo 1/4 de hp f&aacute;cilmente... sin mencionar el da&ntilde;o del adc.\r\nAhora... Sirven otras? o estan bien las que tengo ?.","replies":[{"poster":"Ðwayn","date":"2015-04-26T04:07:59.849+0000","up_votes":1,"down_votes":0,"body":"Hola, te recomiendo 2 paginas de runas para leona que estoy usando actualmente y me dan muy buenos resultados.. La primera es: 3 Quintas de Armadura, Marcas de daño, Sellos de Vida Plano y Glifos de Resistencia Magica Plano.. La otra es: 3 Quintas de Aramdura, Marcas de Armadura, Sellos de Vida Plano y Glifos de Resistencia Magica Plano.. La segunda es para ir mas tanque, depende de tu gusto tambien.. xD Espero que te sirva de algo.. :) Saludos..","replies":[{"poster":"EzeK","date":"2015-04-28T04:27:07.572+0000","up_votes":1,"down_votes":0,"body":"Sirve la vida?.\nOsea vi comentarios Que no rendia con Leona  ya que cuenta con la W ( en Diferentes lados ) - con las paginas 0 21 9. realmente tankeo bastante en early.\nSin embargo sirve la vida en las runas ?.  Osea... no es mejor armor - armor progresivo y asi mismo con las magicas?.","replies":[]}]},{"poster":"Jonshi","date":"2015-04-25T23:48:27.321+0000","up_votes":1,"down_votes":0,"body":"(Acabo de encontrar una guia de Leona Jungle... WTF?)\nRunes: x3 quints 1 gold/ 10 sec o x3 quints +26 heal, red y yellow armor, blue magic resist progresivas o planas.\nEso segun esta guia: http://www.lolking.net/guides/81441","replies":[{"poster":"Jonshi","date":"2015-04-25T23:49:07.947+0000","up_votes":1,"down_votes":0,"body":"Si queres ponele tambien en las quints o en las red hybrid penetration.","replies":[]}]},{"poster":"greefercreeperII","date":"2015-04-25T19:50:45.860+0000","up_votes":1,"down_votes":0,"body":"yo me armo con un poquito de ap las runas pero están bien y depende de como la quieras jugar si la quieres full full tanque a inicicio las quintas de vida o armadura pero las tuyas están bien REPITO","replies":[]}]}