{"poster":"Omnimesh","date":"2015-03-04T21:18:32.367+0000","title":"After 5 years of me playing I am still penalized for a leaver to much","subforum":"Gameplay","up_votes":5,"down_votes":4,"body":"After 5 years I would expect that riot would change how much LP you lose when a member of your team afks/leaves.  I understand why there is a loss, but why not have it half as much as what would originally be?  I had a game just about 30 minutes ago where I had someone go mid, died within the first 5 minutes then leave.  I am almost positive that was a smurf account so even if he did get banned it's only an extra account.  So I ended up losing 21 LP for a 4 vs 5 game whilst it not even being remotely fun to even play.  So why not just make it 10 LP lost and show it was -50% reduced for a leaver.  Again, I get why it's a loss.  It's to prevent from an abuse of a duo queue or even a five man premade to have someone leave to soften the loss on the entire team, but still the team with something that is out of their hands should not be penalized so heavily.","replies":[{"poster":"Sailor Mint","date":"2015-03-04T21:25:31.937+0000","up_votes":1,"down_votes":1,"body":"~~Being a good citizen for years doesn't give you the right to wreck your neighbor's car, nor does it let you get away with ruining League of Legends games.~~\n\nEdit: I am not drunk. I swear.","replies":[{"poster":"LeonDemonOfDeath","date":"2015-03-04T21:29:57.045+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Devi Freak Mint,realm=NA,application-id=3ErqAdtq,discussion-id=F3LaILcG,comment-id=0000,timestamp=2015-03-04T21:25:31.937+0000)\n>\n> Being a good citizen for years doesn't give you the right to wreck your neighbor's car, nor does it let you get away with ruining League of Legends games.\n\nWhat does this even have to do with the post?","replies":[{"poster":"DaCush","date":"2015-03-04T21:54:35.097+0000","up_votes":2,"down_votes":0,"body":"His post goes to show what a majority of the people do on the League forums. They read the title post and don't even read the actual post. His title could be taken as that he is the one who gets penalized too much for leaving. At least, that's how I read it prior to clicking the link until I read the body.","replies":[]}]}]},{"poster":"Saianna","date":"2015-03-04T22:45:03.085+0000","up_votes":1,"down_votes":0,"body":"Sigh.. Ppl would abse it.. Imo it's better if leaver gets penalized alot, while others less","replies":[{"poster":"Linthe","date":"2015-03-04T22:48:31.537+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=F3LaILcG,comment-id=0004,timestamp=2015-03-04T22:45:03.085+0000)\n>\n> Sigh.. Ppl would abse it..\n\nIKR. Like this has not been proposed/begged for 5000 times already.","replies":[{"poster":"Saianna","date":"2015-03-04T23:07:34.669+0000","up_votes":1,"down_votes":0,"body":"I know mate :)\n\nI'm no ranked fan tho. Last time i've played it really seriously was in S...2? Or maybe 1?\n\nBut that would help you, ranked fans, so it's aight","replies":[]}]}]},{"poster":"Kazaashi","date":"2015-03-04T23:05:52.986+0000","up_votes":1,"down_votes":0,"body":"Basically it comes down to the fact that, given that you are not the DC/leaver, the other team has a higher chance of getting one; therefore, over enough games, you will have lost the same amout of 4v5's as won 5v4's.\n\nIt sucks when it happens, but so do a LOT of things in life.","replies":[]},{"poster":"SmokingPuffin","date":"2015-03-04T21:46:03.959+0000","up_votes":1,"down_votes":0,"body":">  I understand why there is a loss, but why not have it half as much as what would originally be?\n\nBecause they don't halve the LP gains for the winning team in a 5v4.  \n\nThey could choose to do tihs, but then you have another problem: many if not most leaves occur in losing game states.  If you were already losing as a 5v5, you shouldn't get any benefit from a member of your team leaving to make it a 4v5.","replies":[{"poster":"Omnimesh","date":"2015-03-04T21:58:22.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SmokingPuffin,realm=NA,application-id=3ErqAdtq,discussion-id=F3LaILcG,comment-id=0001,timestamp=2015-03-04T21:46:03.959+0000)\n>\n> Because they don't halve the LP gains for the winning team in a 5v4.  \n> \n> They could choose to do tihs, but then you have another problem: many if not most leaves occur in losing game states.  If you were already losing as a 5v5, you shouldn't get any benefit from a member of your team leaving to make it a 4v5.\n\nYes, which is why you still get a loss.  It's understandable that it could be abusable but you could simply increase the penalty for leaving.  Double the LP cost for leaving a game that you would normally lose if you left and half the cost of the team who had the leaver on the team.  I don't think anyone would want to leave the game for their team to only lost half as much while they could be near 50 LP lost","replies":[{"poster":"SmokingPuffin","date":"2015-03-04T22:17:31.069+0000","up_votes":1,"down_votes":0,"body":"> Double the LP cost for leaving a game that you would normally lose if you left and half the cost of the team who had the leaver on the team.  \n\nThis might work.  Main concerns:\n\n* Creates an incentive to rage at a player you think might leave if you bother him enough\n* Creates bad feels for players who lose connection to the game\n\n> I don't think anyone would want to leave the game for their team to only lost half as much while they could be near 50 LP lost\n\nYou'd probably have some edge cases still.  A player that's on 0 LP but safe from demotion might leave, for example.","replies":[]}]}]},{"poster":"t0ad5","date":"2015-03-04T21:50:54.714+0000","up_votes":1,"down_votes":0,"body":"They should just end the game and give the leaver the equivalent of a 5, if not 10, person Lp loss.","replies":[]},{"poster":"CaptanKrushnKill","date":"2015-03-04T22:03:50.274+0000","up_votes":1,"down_votes":1,"body":"The game needs to end at 5, 10, 15, and 20 if a player has been afk for 4 minutes or hasn't loaded in.\n\nThe bearing on the side that has an AFK is too great to overcome, and whatever bad things happens as a result of ending early cannot nearly be as bad as a 99% chance of losing the game.","replies":[]}]}