{"poster":"Nerf My Rengar","date":"2015-03-29T18:50:41.998+0000","title":"Para ustedes, cuales son los top mas viables en ligas medias y altas donde ya existe el teamwort?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Esta ultima season se pusieron muy fuertes los top con una teamfight a la que puedan aportar con mucho control de masas como lissandra gnar, maokay, incluso morgana. Ustedes cuales opinan que los mejores campeones para usar actualmente en top ?","replies":[{"poster":"SmK AuncelGG","date":"2015-03-29T19:20:10.222+0000","up_votes":2,"down_votes":1,"body":"tienes a offtank como  jax, riven, xin´zao, tankes como malphite por su iniciacion en tf , cho´gath, nasus, renekton, rammus etc.... \ntodos ello aportan mucho en tf algunos mas que otros pero aportan en fin, pero si estas buscando aguantar y aportar con cc mi eleccion seria malphite o nautilus\n\nsaludos cordiales","replies":[]},{"poster":"lordeman10","date":"2015-03-31T17:25:31.826+0000","up_votes":1,"down_votes":0,"body":"just irelia\n\ny no la tengo ni la he usado mas de 3 veces pero estoy en platino 2 soy main support y la odio se te tira en los carry y no la parás con nada","replies":[]},{"poster":"BadWay","date":"2015-03-30T13:58:12.156+0000","up_votes":1,"down_votes":0,"body":"Pues, creo yo que se están destacando mucho los campeones con daño basado en AP pero que también se buildean Tank. \nSwain, Vladimir, Rumble, Lissandra, Maokai, etc...\n\nTienen generalmente ventaja sobre el top convencional, ya que poseen buen poke, algunos sustain, y a la vez, buenas vías de escape o maneras de aguantar el daño.  \n Básicamente, cualquiera de esos campeones que nombré, podrían ganar tranquilamente TOP contra un Renekton, Aatrox, Nasus, Tryndamere, Pantheon, etc.","replies":[]},{"poster":"Nerf My Rengar","date":"2015-03-29T19:20:09.349+0000","up_votes":1,"down_votes":0,"body":"Con este foro quería hacer un top ten de los que serian los tier en este season, para mi serian maokay morgana lissandra, lulu, sion, irelia, riven, gnar y nose","replies":[]},{"poster":"Encarnox","date":"2015-03-29T19:01:12.288+0000","up_votes":1,"down_votes":0,"body":"Si quieres un TOP tanque con mucho CC te recomendaría a {{champion:31}} tiene buen aporte en las peleas de equipo,un derribo aéreo,silencio,ataques básicos con daño en área y una ulti de daño verdadero que podría acabar con el tanque rival muy rápido.","replies":[]},{"poster":"DreamTales","date":"2015-03-29T18:58:17.223+0000","up_votes":1,"down_votes":0,"body":"yo no se de ligas altas y medias (no juego rankeds todavía), pero yo creo que cho gath puede ser buena opción. su Q y W son en area y silenciar a todo el enemigo sería una gran ventaja. es un tanque que no puedes evitar, con ponerle un poco de ap quita bastante y molesta, ignorarlo es muy dificil.\nEn fase de linea casi no tiene counters, ademas obliga al enemigo a comprar resistencia mágica por su daño alto.","replies":[]}]}