{"poster":"ZACxBOT","date":"2017-08-19T10:19:06.867+0000","title":"Can someone explain WTF this is?","subforum":"Gameplay & Strategy","embed":{"description":"See posts, photos and more on Facebook.","url":"https://www.facebook.com/photo.php?fbid=1269347403175284&set=a.152877678155601.29247.100003001103095&type=3&theater","image":null},"up_votes":1,"down_votes":0,"body":"AAzir is pretty OP","replies":[{"poster":"TheyCallHimTeemo","date":"2017-09-07T00:02:04.260+0000","up_votes":1,"down_votes":0,"body":"Azir is far from OP.  He is extremely squishy and has no mobility apart from his dash.  It has a long CD and he uses so much mana.  He is hard to play and is an important part in the team fight meaning that you are going to be focused. (and probably insta gibbed.)","replies":[{"poster":"Nightjar","date":"2017-09-07T00:49:19.825+0000","up_votes":1,"down_votes":0,"body":"he also requires extensive knowledge of positioning of both himself and his sand soldiers, his early game damage is pathetic, he takes a while to scale, whilst he has good dps his burst is mediocre lategame, his only defensive peel is his ult, his only mobility spell is on a long cooldown and is key to his shurima shuffle.\n\nHis shurima shuffle is extremely risky as it's hard to pull off, and places you in the middle of the enemy team, as a squishy poke mage who no longer has any peel or mobility and no ability to burst an assassin who jumps on him.\n\nHis passive is useful midgame but it falls off, and he gets countered hard by assassins, and he also loses straight up spell slinging contests with most other zone and poke mages.\n\nAzir is one of the hardest champions in the game to learn and even once you've learnt him to an extensive degree, you will still probably lose more than you win with him. To have him stand on par with other meta midlaners, you need to be at the highest tiers of play, because if you play him below  plat/diamond, you have probably singlehandedly lost your team the game.\n\ni love azir lorewise but this isn't a champion you should ever play in ranked and arguably not even in normals.","replies":[]}]}]}