{"poster":"SoneStar","date":"2019-01-29T16:20:34.236+0000","title":"Rankedplatzierung von neuen Accounts.","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Moin\n\nHabe soeben meine Placements dieses  Smurfaccounts vollendet und bin ziemlich verwirrt...\nWie kann es den bitte sein, dass ein frischer Account (S8: unranked) nach 8 Siegen und 2 Niederlagen in Silber IV eingestuft wird?! Mir ist bewusst, dass 8/2 nicht gerade eine Meisterleistung ist, aber es h&auml;tte fr&uuml;her allemal f&uuml;r Gold III+ gereicht. Meine MMR scheint zwar diesem Niveau zu entsprechend (zumindest waren meine Gegner und Mitspieler alle im hohen Gold-Bereich), aber es kann doch nicht sein, dass nun &quot;seri&ouml;se&quot; Smurfaccounts in Silber landen....  Zahlreiche SpielerInnen  beschweren sich seit jeher &uuml;ber Smurfs, die ihnen die &quot;Faire Chance&quot; am Spiel rauben. Welchen Sinn macht es dann bitte, genau diese Smurfs in Silber einzustufen? Anstelle von 10-20 Spielen sind es dann n&auml;mlich schnell mal  50 dieser &quot;unfairen Art&quot;.\nHoffe Riot behebt diesen absurden Fehler wieder!\n\n\n**Edit:**\nIch habe nun 26 Spiele hinter mir und bin bereits Gold IV und das trotz meiner eher bescheidenden Winrate von gut 70%. Umso mehr frag ich mich, welchen Sinn es macht, einen neuen Account, der mit 8/2 (oder besser) aus den Placements geht, in Bronze einzustufen?!  Um ihm anschließend mit einem LP-Gain von 38 durch die Liegen zu katapultieren... \n\nIch denke, die Variante der letzten paar Seasons, bei denen offensichtliche Smurfaccs bereits Gold II + eingestuft wurden, war für beide Seiten wesentlich angenehmer. ","replies":[{"poster":"eingew","date":"2019-01-30T08:37:22.148+0000","up_votes":1,"down_votes":0,"body":"Dein erstes Spiel hast du gegen Bronze gewonnen und danach hast du auch nur gegen Silber gespielt, deshalb wurdest du wahrscheinlich auch nur auf Silber eingestuft. Mittlerweile spielst du aber hauptsächlich gegen Gold, der Aufstieg aus Silber heraus sollte jetzt also recht schnell gehen.","replies":[{"poster":"SoneStar","date":"2019-01-30T23:47:09.504+0000","up_votes":1,"down_votes":0,"body":"Stimmt, ich bekomme ca +35 LPund verliere 6-7 LP. Ändert aber leider nichts an der Tatsache, dass ich mich nun durch einige unvorstellbar mühsamen Spiele quälen muss, um endlich einen spielbaren Gold/Plat Account zu haben.","replies":[{"poster":"Awsane","date":"2019-01-31T11:33:21.271+0000","up_votes":2,"down_votes":0,"body":"Inwieweit sind die Spieler denn mühsamer als wenn du Gold/Platin angezeigt hättest?\n\nAlso den Punkt, dass du ein Paar Spiele mehr spielen musst den gebe ich dir, aber welche Gegner du bekommst hängt ja nicht von der Liga ab die bei dir im Profil steht sondern der MMR.","replies":[]},{"poster":"Sedros","date":"2019-01-31T02:11:39.331+0000","up_votes":1,"down_votes":0,"body":"Damalas gabs auch kein iron","replies":[{"poster":"eingew","date":"2019-01-31T07:22:32.650+0000","up_votes":1,"down_votes":0,"body":"Wobei das ja mit seiner 1% Spieleranteil eher als Pendant zu Diamant zu dienen scheint. Es scheint mir etwas krass, wenn das so starke Verschiebungen beim LP-Gain bewirkt, als Master eingeführt wurde war das jedenfalls nicht so.","replies":[{"poster":"Sedros","date":"2019-02-02T02:35:43.483+0000","up_votes":1,"down_votes":0,"body":"Wow ich bin begeistert von solchen Kommentaren..\nWo soll ich nur anfangen. Nur ne kurze Frage vorab. Denkst du wirklich, dass Riot eine extra schlechte Liga einführt wo nur 1% drin sein werden, damit sie sich noch schlechter fühlen?\n\nDu versuchst wirklich Master mit 4 Divisionen zu vergleichen also das macht aber auch wirklich gar keinen Sinn. Im Masterbereich werden nicht ansatzweise so viele Spieler sein(0,1% gerade). Das sind nur ein paar Plätze, da musst du kein LP-Gain für verändern. Auch dein 1% hast du dir wohl ausgedacht. Iron liegt gerade bei knapp 8%. Diamant und Platin zusammen bei ungefähr 9%. Auch Aussagen über Rangverteilungen zu machen am Anfang einer Season, wenn da gerade neue Ränge eingeführt wurden, macht keinen Sinn. Lass erstmal die Leute spielen und sich verteilen.","replies":[{"poster":"eingew","date":"2019-02-04T07:46:56.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sedros,realm=EUW,application-id=ip27PlEH,discussion-id=Kagbo5T0,comment-id=00030000000000000000,timestamp=2019-02-02T02:35:43.483+0000)\n>\n> Wow ich bin begeistert von solchen Kommentaren..\n> Wo soll ich nur anfangen. Nur ne kurze Frage vorab. Denkst du wirklich, dass Riot eine extra schlechte Liga einführt wo nur 1% drin sein werden, damit sie sich noch schlechter fühlen?\n\nEs geht laut Riot wohl eher darum, auf den Rändern der Elo, die ja klassischerweise größere Skillunterschiede einfassen, als die Ligen in der Mitte der Rangliste, Fortschritte sichtbar zu machen, die sich vorher innerhalb einer Liga gehalten haben.\n\n> Du versuchst wirklich Master mit 4 Divisionen zu vergleichen also das macht aber auch wirklich gar keinen Sinn. Im Masterbereich werden nicht ansatzweise so viele Spieler sein(0,1% gerade). Das sind nur ein paar Plätze, da musst du kein LP-Gain für verändern. Auch dein 1% hast du dir wohl ausgedacht. Iron liegt gerade bei knapp 8%. Diamant und Platin zusammen bei ungefähr 9%. Auch Aussagen über Rangverteilungen zu machen am Anfang einer Season, wenn da gerade neue Ränge eingeführt wurden, macht keinen Sinn. Lass erstmal die Leute spielen und sich verteilen.\n\nIn op.gg sind es immer noch nur etwas mehr als 2%, daran habe ich mich eben gerichtet. Abgesehen davon solltest du meinen Kommentar noch mal lesen und prüfen, ob das, was du da hereininterpretierst, da auch tatsächlich drin steht.","replies":[]}]}]}]}]}]},{"poster":"MyKogInYourLulu","date":"2019-01-29T17:10:58.493+0000","up_votes":2,"down_votes":0,"body":"Silber ist seit langem die Einstiegsklasse. Sofern dein MMR im Normal bis Level 30 nicht schon extrem hoch war ist es nichts ungewöhliches dass du in Silber landest. Riot weiß ja nicht ob das jetzt ein Smurf Account ist oder nicht. Insofern könnten dann Spieler aus Glück alle 10 Spiele gewinnen und viel zu hoch eingerankt werden. Ist ja auch nicht besser und wäre öfter der Fall.","replies":[{"poster":"SoneStar","date":"2019-01-29T18:32:17.328+0000","up_votes":2,"down_votes":0,"body":"Glaube nicht, dass das der Fall war. Habe in den 7 Jahren die ich LOL spiele sicher über 10 Smurfaccounts eingestuft und alle waren Gold+, zweimal reichte es sogar für Plat V. Ich bin mir daher sicher, dass es auf die neue Season (S9) zurückzuführen ist.","replies":[{"poster":"MyKogInYourLulu","date":"2019-01-29T19:10:17.992+0000","up_votes":1,"down_votes":0,"body":"Jetzt könnte man sich natürlich fragen warum du es nötig hast mehr als einen Lol Account pro Jahr zu machen... Denke das sollte dein größeres Problem sein.","replies":[{"poster":"SoneStar","date":"2019-01-29T19:22:40.979+0000","up_votes":1,"down_votes":0,"body":"Aus zwei relativ simplen und offensichtlichen Gründen:\n\n* Um mit sämtlichen Freunden spielen zu können. (Dia und Silber geht sinnvollerweise nicht)\n* Weil ich auf meinem Mainaccount nur tryhard spiele und ich Normals verabscheue.\n\nNatürlich würden dafür 2 Accs genügen, da hast Du wohl recht.\nSpiele momentan allerdings nur auf 4 Accounts.","replies":[{"poster":"MyKogInYourLulu","date":"2019-01-29T20:18:59.238+0000","up_votes":1,"down_votes":0,"body":"Naja Ranked (zumindest Solo/Duo) ist ja auch nicht dafür da um mit Freunden zu spielen die weit unter dem eigenen Skilllevel sind. Dafür gibts Normals und das finde ich auch gut so. Premades erhöhen das MMR des Gegnerteams und bei solchen krassen Elo Unterschieden ist es meistens dann ein gefühltes 4v5. Der vermeintlich bessere des Duos behandelt dann alle anderen von oben herab und geht nicht selten AFK.\n  \nIch will dir nichts unterstellen, spiele aber selber schon seit Season 2 und habe genug gesehen. Vor allem wenn dann jemand schreibt, dass er schon über 10 Accounts hatte. Ist halt etwas verdächtig. Mal davon abgesehen, dass ein schnellerer Aufstieg Eloboosting und etc. vereinfachen würde, worüber sich wohl die wenigsten freuen würden.","replies":[]}]}]}]}]},{"poster":"Napoleon2587","date":"2019-01-29T18:45:52.880+0000","up_votes":1,"down_votes":1,"body":"Ich wurde mit meinem Account vor ca 6 Jahren mit 7/3 in Silber 3 eingestuft und hatte eher das Gefühl, dass Riot die Einstufung angehoben hat. Alle Freunde von mir sind Gold gestuft worden selbst mit 5/5 etc.\nIch finde sogar jeder sollte in Iron anfangen, meinetwegen bei guten Placements in Iron I, damit jeder merkt, wie schwer es ist, da raus zu kommen und um Smurfs vielleicht auch etwas abzuschrecken, denn dann müssen sie länger grinden um zu climben.","replies":[{"poster":"GoD Chickenrider","date":"2019-01-31T09:43:51.405+0000","up_votes":2,"down_votes":1,"body":"Das wäre extrem kontraproduktiv... Als High ELO Spieler stellt es im Normalfall kein Problem da aus Iron heraus zu kommen. Aber für Spieler die wirklich Silber/Gold sind, wird es dadurch noch schwerer (4Potentielle Smurfs im eigenen Team gegen 5Potentielle Smurfs im gegnerischen Team)","replies":[]}]},{"poster":"Cenâreth","date":"2019-02-11T00:19:08.444+0000","up_votes":1,"down_votes":0,"body":"Naja es war doch sowieso geplant dass Neulinge in Iron eingestuft werden kommt der Plan möglicherweise mit Split 2? Oder hat man den verworfen?","replies":[]},{"poster":"Cenâreth","date":"2019-01-29T22:28:04.655+0000","up_votes":1,"down_votes":0,"body":"Die Einstiegsklasse wurde noch nicht verändert wird ws mit Split 2 kommen soll aber angeblich Iron werden.","replies":[]}]}