{"poster":"Lukkii010","date":"2015-12-28T16:49:08.208+0000","title":"Damage der Tanks ist zu viel","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"In meinen Augen ist das Spiel zurzeit extrem unbalanced . Es ist nicht selten so das der ADC oder der Midlaner von einem full tank wie z.B Malphite alleine get&ouml;tet wird ohne das der Adc oder Midlaner etwas machen kann. Ich find das einfach nur unfair ich mag Adc und Midlaner aber wie kann es sein das man von den Tanks allein get&ouml;tet wird und man selber keinen Schaden an denen macht . Deswegen w&uuml;rde es mich interressieren ob Riot das irgendwann mal &auml;ndern m&ouml;chte . Ausserdem ist dazu der Last Whisper auch noch schlecht geworden . Ich w&auml;re daf&uuml;r dass der Grund Damage von allen Tanks runtergenommen wird. Bsp zu der Situation : Ich war Kayle{{champion:10}}  die Gegner hatten Blitzcrank{{champion:53}}  ,der war full Tank ausser einem H&ouml;hlenzeppter .Er hat mir mit seiner Ulti 1000 Dmg gemacht das ist einfach zu viel","replies":[{"poster":"pulledchicken","date":"2015-12-28T17:00:26.477+0000","up_votes":2,"down_votes":0,"body":"{{item:3035}}  ist momentan Crap !\n\nIch denke Riot wird aber diesbezüglich nochmal was machen ....","replies":[]},{"poster":"0 DMG LUL ","date":"2015-12-28T17:10:52.596+0000","up_votes":1,"down_votes":0,"body":"Das was du da geschrieben hast ist wahr . Ich sage nur {{champion:223}} ;er geht nur HP und macht so viel dmg das man denkt das er full AP ist.Selbst eine Fiora oder Vayne die % dmg machen ,machen den Frosch irgendwie kaum was aus.Wisst ihr es ist doch so : Tanks haben viel HP und machen kaum dmg ,aber wenn ein adc in late game nicht mal 1v1 gegen einen Tank gehen kann ,weil er weiß das er sterben wird, dann stimmt hier etwas gewaltig nicht.","replies":[{"poster":"BM Vilich","date":"2015-12-28T18:54:27.112+0000","up_votes":3,"down_votes":1,"body":"Da ADC keine 1v1-Rolle ist, geht das durchaus in Ordnung so.","replies":[]}]},{"poster":"BM Vilich","date":"2015-12-28T18:53:06.606+0000","up_votes":2,"down_votes":1,"body":"ADCs sind im 1v1 auch nicht stark. Und der Damage ist auch nur bei Mundo etwas hoch.","replies":[]},{"poster":"Im a Papaya","date":"2015-12-28T18:25:36.091+0000","up_votes":1,"down_votes":0,"body":"Nehmen wir mal den meist gehassten Tank Fighter in lol: Darius. Darius hat 1 bis 2 Items die etwas ad und etwas leben geben und dann noch ein paar defensive Items je nachdem wie das gegnerische Team aussieht. Er hält viel aus, lässt dich nicht mehr los wenn er dich hat und seine ult hat absoluten Schaden der gut skaliert. trotzdem ist er im Normalfall Damage technisch eher hinter den meisten adcs da diese ihre Crit chance haben. Crit ist für jeden ad Champ eine sichere Skalierung und gibt ihnen die Möglichkeit mehr Schaden als jeder andere Champ zu machen.","replies":[]},{"poster":"Lukkii010","date":"2015-12-28T17:39:37.925+0000","up_votes":1,"down_votes":0,"body":"Naja sollte aber nciht so sein dass man 3 def items kauft damit man überleben kann","replies":[{"poster":"Rainbow Dashie","date":"2015-12-28T18:22:43.606+0000","up_votes":1,"down_votes":0,"body":"wenn du wirklich 3 Deff items brauchst machst du aber gehörig was falsch bei Fullbuild.","replies":[]}]},{"poster":"Rainbow Dashie","date":"2015-12-28T17:31:08.850+0000","up_votes":1,"down_votes":0,"body":"1. Es ist Pre Season  da ist vieles Unbalanced\n2. bei einem 20/0 300 CS Malphite ist klar das ein 0/10 2 CS ADC nichts ausrichten kann. Im late sieht das schon wieder anders aus.\n3. wurde hier ja schon angsprochen die last whisper und botrk Änderungen treffen einige halt hart.\n4. auch ein Midlaner oder ADC darf durchaus Deff Items benutzen und muss nicht nur full dmg gehen.","replies":[]},{"poster":"Lukkii010","date":"2015-12-28T16:55:50.180+0000","up_votes":1,"down_votes":0,"body":"Naja wenn ein Tank dir 500 Schaden mit Ulti macht und du nur 2 k Leben hast dann liegts schon am Tank Damage","replies":[{"poster":"M4UR1C31234","date":"2015-12-28T17:00:44.756+0000","up_votes":1,"down_votes":0,"body":"Im Late vlt. 600 (500+ {{item:3001}} ) und das auf 0 Magicresist mit Magiedurchdringung durch das {{item:3001}} und das ist schon länger so als nur die Preseason vorher war es nie ein Problem durch den besseren {{item:3035}} & {{item:3153}}  .\n\n\nMit Freundlichen Grüßen {{champion:92}} {{champion:92}} {{champion:92}}","replies":[]}]},{"poster":"M4UR1C31234","date":"2015-12-28T16:54:49.301+0000","up_votes":1,"down_votes":0,"body":"Es liegt nicht am DMG der Tanks es liegt an den Änderungen von {{item:3035}} & {{item:3153}}. Wenn man diese beiden Items wieder in ihren S5 Zustand zurück bringen würde wären Tanks schonmal sehr geschwächt.\n\nPS: Zum Zeitpunkt wo er diesen DMG macht solltest du dich durch Lifesteal ({{item:3072}} ) wieder hochheilen können und wenn er in der Range für die Ulti ist dann hat entweder dein Team was falsch gemacht oder du wurdest gehooked.\n\nMit Freundlichen Grüßen {{champion:92}} {{champion:92}} {{champion:92}}","replies":[]}]}