{"poster":"Theoridia","date":"2017-01-11T20:16:51.291+0000","title":"Client disappears after clicking Launch since latest patch","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"WTF? Please help me. I've tried reinstalling but doesn't help.","replies":[{"poster":"Porocles","date":"2017-01-11T21:28:38.913+0000","up_votes":1,"down_votes":0,"body":"A setting may have changed on your PC that is blocking the patcher from launching.  Go over the steps in the [permissions](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) guide to troubleshoot.  Let me know if you have any questions about that.","replies":[{"poster":"Theoridia","date":"2017-01-12T18:55:29.793+0000","up_votes":1,"down_votes":0,"body":"Hi boss, I tried all those things, including reinstalling the game, except updating Windows. As they try to put Windows 10 on my PC like a virus.\n\nI can manage to get it to let me get to the login once by ending all lol processes in task manager, including lol patcher. And by deleting lol patcher and lol launcher in C:\\Riot Games\\League of Legends\\RADS\\projects\n\nThen once I close the client down and try to relaunch the same thing happens again. I think it's to do with the update.","replies":[{"poster":"Porocles","date":"2017-01-12T19:00:37.766+0000","up_votes":1,"down_votes":0,"body":"If closing stuff in your manager happened to get some progress but not the permissions guide, then I wonder if some other software is causing a block.  It's really important to update windows to boot, but that is your choice.  Hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so our tech team can take a closer look and figure out what's going on.  Grab our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) and attach some logs to the ticket for context.  We'll reply to it as soon as we can!","replies":[{"poster":"Theoridia","date":"2017-01-12T19:07:59.045+0000","up_votes":1,"down_votes":0,"body":"It could be Avast Antivirus as I updated that recently. But this only started happening with the new update yesterday on lol","replies":[]}]}]}]}]}