{"poster":"El Mastrai","date":"2018-06-24T13:49:03.513+0000","title":"modos de juegos rotativos","subforum":"Charlas Generales","up_votes":17,"down_votes":1,"body":"vaaamo a ver, el modo grieta del invocador tanto como aram y bosque retorcido son entretemidos hasta cierto punto peeeero, que pasa con los modos de juegos mas entretenidos? hace semanas no veo al menos un rey poro, y ya aburre, deber&iacute;a hacerse una votaci&oacute;n de la comunidad para ver si quieren q se vuelva a antes, d&oacute;nde quizas no todos los fines de semana pero cada 2 habia un modo que duraba 3 o 4 dias, y eso era genial cambiar un poco lo normal y despues te da mas ganas de jugae en la grieta del invocador, qur opinan comunidad? riot?","replies":[{"poster":"Carpaccio","date":"2018-06-24T14:19:15.744+0000","up_votes":5,"down_votes":1,"body":"Respeto que a la gente le guste URF y esta bien,pero por ejemplo a mi,me gusta One For All y Ascencion y no tengo noticias {{champion:32}}","replies":[{"poster":"El Mastrai","date":"2018-06-25T19:08:30.019+0000","up_votes":1,"down_votes":0,"body":"exactamente, a mi me encanta urf, lo amo, pero one for all, asecension, asedio al nexo, y esos tambien los amo, ya grieta del invocador... se volvió... repetitivo","replies":[]},{"poster":"AustinAries","date":"2018-06-24T15:32:39.661+0000","up_votes":1,"down_votes":2,"body":"A mi también me gusta OfA, hasta que durante 7-8 partidas seguidas te toca la típica premade que quiere ir si o si con X personaje y si llegan a perder la elección o kitea a ultimo segundo haciéndote perder tiempo o trollea durante la partida...","replies":[]}]},{"poster":"LACTE4","date":"2018-06-24T15:03:47.202+0000","up_votes":2,"down_votes":1,"body":"Todos queremos que vuelva eso {{champion:32}}","replies":[]},{"poster":"fenakz","date":"2018-06-24T17:18:55.751+0000","up_votes":1,"down_votes":1,"body":"Esta petición viene desde hace años. Antes decian que cada 3 meses iba a ver un modo de juego, despues no se que paso que quedo en el olvido (quedo vacio el \"modo rotativo\") ya que ni es rotativo si lo sacan cuando hay eventos o problemas como los de clash . Yo les propondia que en 4 semanas 2 semanas pongan un modo de juego un fin de semana basicamente 2 findes al mes (asi no es repetitivo) como hacen algunos juegos en la actualidad para \"mantener\" diferente el juego. Lo que no comparto es que cualquier modo de juego al principio es divertido despues ya hay gente que se lo toma muy enserio (ES UN MODO DE JUEGO MUCHACHOS) y empieza a ser toxico por X motivo y ya le saca gracia. ","replies":[]}]}