{"poster":"mad Lou","date":"2016-11-09T21:42:46.156+0000","title":"Bester Support Champion für Anfänger im Solo Q","subforum":"Level Up: Guides & Tipps","up_votes":3,"down_votes":1,"body":"Ich wollte mal Eure Meinung h&ouml;ren, welcher Champion am besten f&uuml;r einen Anf&auml;nger im Solo Q geeignet ist und auf was man achten soll. Da ich bald einmal Ranked spielen will, sollte ich mich f&uuml;r einen Main entscheiden.\r\n\r\nDerzeit bin ich Main Soraka, bei der ich eigentlich davon ausging, dass sie als anf&auml;ngerfreundlich gilt. Nun habe ich geh&ouml;rt, dass man bei ihr sehr gute Mitspieler braucht und deshalb nicht so geeignet sein soll f&uuml;r Solo Q.  K&ouml;nnte eventuell daran liegen das Soraka keinerlei Selbstverteidigung hat. Sehrt ihr das auch so?\r\n\r\nUnd was ist f&uuml;r Solo Q besser? Defensiver oder Offensiver Support\r\n\r\n\r\nZudem wollte ich als Back-Up Champion einen Tank-Support spielen, allerdings w&uuml;sste ich nicht welcher sich f&uuml;r Low Elo &uuml;berhaupt eignet, da scheinbar alle Tank-Supports recht viel Skill von einem selber und von den Mitspielern abverlangt.","replies":[{"poster":"Iam a real Man","date":"2016-11-10T16:40:03.927+0000","up_votes":2,"down_votes":0,"body":"Ganz allgemein formulieren kann man das leider nicht.\n\nIch denke Soraka ist eigentlich ein sehr guter SoloQ Pick vor allem je niedriger die Elo ist.\nDie Spieler dort sind zu unkoordiniert um Soraka direkt aus einem Fight zu focusen und auch auf der Lane kann dein Adc viele Fehler machen und du holst ihn immer aus schwierigen Situationen raus. Solange du selbst gutes Positioning hast ist sie daher ein durchaus guter Champion.\nAllerdings handelst du mit ihr natürlich eher Reaktiv und leitest nicht selbst Kämpfe ein oder kannst Picks machen,dafür ist das für den Gegner genauso schwierig.\n\nMan könnte genauso bei offensiven Supportern sagen,dass sie Teamarbeit benötigen,denn wenn niemand deinem Engage folgt ist es genauso nutzlos.\nUnd die Schwierigkeit liegt darin auch zu richtigen Zeit zu engagen und zu sehen wann ein Gegner out-of-position ist. Sie fordern einen sehr pro-aktiven spielstil.\n\n\nErstmal solltest du spielen was dir spaß macht,Champions die dir übern einen langen Zeitraum nicht langweilig werden,das ist erstmal das wichtigste.\n\nÜberlege einfach welcher Spielstil dir liegt,es gibt auch genügend Misch-Champs die sowohl aggressiv als auch defensiv spielen können z.B Nami,Braum\n\nempfehlen kann ich persönlich Soraka,Sona,Braum und wenn du einen sehr engage lastigen Support möchtest dann Leona.\n\nSobald du sicherer in den grund Mechaniken bist,könntest du z.B Nami,Morgana,Janna und Alistar mit rein nehmen \n\n\nAbraten würde ich dir erstmal von thresh,Lulu,Blitzcrank,Bard,Zyra und karma\nDiese Champs können für Leute die noch nicht so lange spielen eher schwierig sein,weil sie entweder sehr gutes Positioning fordern,Sehr starke Mechanics oder super viele Möglichkeiten in ihrem Kit haben,wodurch sie viel schwerer zu lernen sind^^","replies":[{"poster":"AliforJesus","date":"2017-11-28T12:39:02.804+0000","up_votes":1,"down_votes":0,"body":"danke für die sehr detaillierte Beschreibung!!","replies":[]}]},{"poster":"Ehren Teemo","date":"2016-11-10T07:26:24.782+0000","up_votes":2,"down_votes":1,"body":"Also mein erster supp champion war damals Janna , kann ich jedem empfehlen ihre Grund mechaniken sind recht simpel und trotzdem ist die Kern Kurve solide (also man lernt immer mal wieder nen neuen trick )\n\nIch persönlich bin aber sona Main seit dem 5.1.2015 <3 \nEinfach nur ein sehr flexibler champ der meiner Meinung auch recht simpel ist (song oft death : qwe qwe qwe qwe)\nUnd seit dem mini rework <3","replies":[]},{"poster":"mad Lou","date":"2016-11-15T23:21:37.112+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antworten hier.\nIch habe mir nun ein paar Gedanken gemacht und werde erstmal bei Soraka bleiben. Als Tank Support habe ich mir nun Alistar geholt, obwohl ich erst zu Leona tendiert habe. Als weitere Supports werde ich mir wohl noch Lux, Zilean und vielleicht noch Sona holen. Nami würde ich zwar gerne spielen, aber sie ist mir momentan etwas zu teuer. Von dem was ich gesehen habe würde mir wohl noch Lulu Spass machen aber ich lasse erstmal sein. \n\nEs scheint Champions zu geben, bei denen sich eh niemand einig ist ob sie nun einfach zu spielen sind oder nicht. Beispiel: Leona oder Blitzcrank.","replies":[]},{"poster":"Abasin","date":"2016-11-15T15:11:05.157+0000","up_votes":1,"down_votes":0,"body":"Es ist ganz einfach der, den Du aktuell am Besten spielen kannst. Es werden hier viele Champs und gute Gründe für und gegen sie genannt. Daran sieht man, wie weit die Meinungen auseinander gehen. Deswegen empfehle ich Dir folgendes: Beginne mit der von Dir favorisierten Soraka. Aber übe in den Normals mit ein bis 2 weiteren Champions.","replies":[]},{"poster":"Lynuin","date":"2016-11-14T17:26:28.945+0000","up_votes":1,"down_votes":0,"body":"Ich empfehle dir vor allem {{champion:12}} {{champion:25}} {{champion:201}} . Als Anfänger wirst du definitiv in einem Bereich spielen wo spiele durchschnittlich relativ lange dauern und ein Vorteil nicht zwingend gut ausgebaut wird. Diese Champions sind relativ vielseitig und können sich ganz ordentlichin der Defensive behaupten und lassen gleichzeitig Möglichkeiten offen nach vorne zu spielen. Die Möglichkeiten nach vorne zu spielen zu haben ist sehr wichtig denn nur so kann man vorteile ausbauen oder in einem Ruckstand gegner für Fehler bestrafen. Eine Soraka ist in solchen situationen eher unpraktisch- ansonsten verlässt du dich nahezu ausschliesslich auf deine Mitspieler.","replies":[]},{"poster":"Elyosano","date":"2016-11-11T08:39:47.735+0000","up_votes":1,"down_votes":0,"body":"Um es relativ kurz zu machen. \n\nIch finde anfangen sollte man in jedem Fall mit tanky Supports. Da ist ein guter Champ braum. Er bringt alles mit u du lernst alle Mechaniken. Er passt in jedes matchup u durch die neuen items bist du im Late super tanky. Und du kannst super skillshots lernen mit deiner q","replies":[]},{"poster":"devilrob7","date":"2016-11-10T14:42:19.829+0000","up_votes":1,"down_votes":0,"body":"Ich komme persönlich mit Tanky Supportern besser klar, da diese sehr viel aushalten und damit auch den ein oder anderen Fehltritt überleben. Auch bringen diese meist sehr viel CC mit, was gerade bei Teamfights im Mid- oder Lategame **immer** sinnvoll ist. \n\nMeine Favoriten sind {{champion:201}} {{champion:12}} {{champion:89}}. Wenn es ein AP-Supporter sein soll, kann ich dir {{champion:25}} {{champion:40}} empfehlen.\n\nKlar machen Supports wie {{champion:43}} {{champion:143}} mehr Damage, bzw. werden im Moment im Competitive Bereich bezorzugt, aber du musst sehr genau auf dein Positioning achten, da du ansonsten instant tot bist und dein Team einen schweren Nachteil hat.","replies":[]},{"poster":"stoitzii","date":"2016-11-10T00:47:55.888+0000","up_votes":1,"down_votes":0,"body":"Hey Ho, dass ist ansich garnicht so einfach. Man beachtet im Ranked meist was der Gegner auswählt und versucht diesen dann zu Countern. Zudem achtet man ( im low elo Bereich eher nich so) auf eine gewisse Synergie zwischen Adc und Support. Soraka ist ziemlich anfällig und man spielt sie extrem Def ( also meist weiter hinten zum Adc healen und gelegentlich mal Q machen um zu heilen, sollte ein Kampf starten dann eben E für Silence) Ich kann dir als mehr oder weniger Anfänger ( ist nicht böse gemeint) Leona empfehlen da sie relativ stark ist als Tank Support. Zudem wenn du gern heilst evtl Nami. Ich empfehle dir einfach mal paar Bot games zu spielen und diverse Supports zu testen --> Tank --> Leona/Alistar . Zudem kannste wenn du bock hast mal als Support Nami Karma oder Lulu testen, machen alle sehr spaß :) Falls du mal Fragen hast --> Trump the dumb adden - kann dir gern hier und da paar tipps geben bei Lust und laune. \nGrüße :)","replies":[]}]}