{"poster":"Reaper Soraka","date":"2017-01-25T04:44:15.173+0000","title":"So I logged in...","subforum":"Gameplay","up_votes":4,"down_votes":1,"body":"Saw they took away the RGM...\nDecided I&#039;d play blind pick a couple times before bed...  (it's actually more fun than draft for me recently because you don't know the enemy champs.)\nClosed the game before I found one aaaaaaaaand~\nDecided to go play Diablo III because it is more feels more exciting, less repetitive and less linear than SR at the moment.\n\nI just thought Riot might want to know how I feel about the current state of the game.","replies":[{"poster":"OctoberIV","date":"2017-01-25T04:46:13.887+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Reaper Soraka,realm=NA,application-id=3ErqAdtq,discussion-id=oqg2LXau,comment-id=,timestamp=2017-01-25T04:44:15.173+0000)\n>\n> I just thought Riot might want to know how I feel about the current state of the game.\n\nThey don't give a fuck about you or your feelings.","replies":[{"poster":"Dynikus","date":"2017-01-25T09:19:23.360+0000","up_votes":1,"down_votes":0,"body":"I mean, they do care how their playerbase feels about their game. Will this one thread on its own invoke change? no. But that's doens't mean enough people voicing their opinions won't.","replies":[]},{"poster":"Divine Winds","date":"2017-01-25T04:47:55.301+0000","up_votes":1,"down_votes":0,"body":"They don't give a fuck about me or my feelings FeelsBadMan BibleThump","replies":[{"poster":"Omen46","date":"2017-01-25T07:35:02.376+0000","up_votes":1,"down_votes":0,"body":"...I only play this game because I have someone dear to me that plays it. I only have fun when there is a carry champion on the team. You know what I mean, The same old one trick pony with the same build and the same amount of rampant damage with so much prowess you can't even enjoy playing your champ. Then even with that simple criteria, there is so much flaming and taunting that the game is more about being told how bad the new players are rather than trying to out think and react to the game. Any outplay now is only dodgeing 1 cc and retaliating with enough attack to instagib yourself.","replies":[]}]}]}]}