{"poster":"BangerDolo","date":"2018-03-16T04:32:04.895+0000","title":"why is banning a champ in league seem like chopping a head off of a hydra","subforum":"Gameplay","up_votes":50,"down_votes":3,"body":"It seems like if you ban &quot;x&quot; you will just get &quot;y&quot; who is better than the one you ban \r\nAnd then if you ban the &quot;y&quot; you will just get &quot;x&quot; or &quot;z&quot;","replies":[{"poster":"Lothloran","date":"2018-03-16T04:56:39.164+0000","up_votes":7,"down_votes":25,"body":"Unless you're playing with a premade 5 stack, bans are fucking useless.   \n#1 there's not enough time in pregame to discuss picks and strategy.  So bans are meaningless.  If you're not trying to set something up then there's no point in banning anything.   \n\nIf you're trying to set up and AOE lock down, and you want to ban Janna so she doesn't screw with your positioning then that means something, otherwise it's just a meaningless mechanic to make you feel like you have an impact.","replies":[{"poster":"zacktootall","date":"2018-03-16T05:30:37.655+0000","up_votes":5,"down_votes":3,"body":"what if i ban yi is that a useless ban?","replies":[{"poster":"Lord of Math","date":"2018-03-16T05:33:41.974+0000","up_votes":15,"down_votes":2,"body":"> [{quoted}](name=zacktootall,realm=NA,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=00000000,timestamp=2018-03-16T05:30:37.655+0000)\n>\n> what if i ban yi is that a useless ban?\n\nno it is less than useless, you hurt your own team by not letting the enemy team play {{champion:11}} while you play {{champion:33}} and collect freelo.","replies":[{"poster":"zacktootall","date":"2018-03-16T05:46:08.748+0000","up_votes":3,"down_votes":3,"body":"and what if i (the top laner(no problem using anyone to fight anyone)) and/or the jungler and/or the support don't want to play {{champion:33}} is it useless then?","replies":[{"poster":"Yaśuo Main","date":"2018-03-16T10:44:04.193+0000","up_votes":1,"down_votes":1,"body":"its not bad because yi is one of the squishiest skirmishers anyway, so if you play a fighter top or any class that is meant to have damage, you can kill him pretty easily","replies":[{"poster":"Thefrostyviking","date":"2018-03-16T11:08:46.028+0000","up_votes":25,"down_votes":0,"body":"Actually....if your team is just slightly lacking in hard CC and yi gets fed early.......\n\nBrutality level : Higher than Dark souls.","replies":[{"poster":"Give Me Kayle","date":"2018-03-16T12:32:00.673+0000","up_votes":6,"down_votes":1,"body":"This is low elo we're talking about. CC doesn't exist here","replies":[{"poster":"Tails9016","date":"2018-03-16T21:39:32.257+0000","up_votes":4,"down_votes":0,"body":"> This is low elo we're talking about.  Nothing good exists here\n\nFTFY","replies":[]}]},{"poster":"Yaśuo Main","date":"2018-03-16T19:36:31.106+0000","up_votes":2,"down_votes":0,"body":"well you aren't wrong because i had to deal with fed crit yi, dear god","replies":[{"poster":"Thefrostyviking","date":"2018-03-16T21:50:25.854+0000","up_votes":2,"down_votes":0,"body":"Yeah that stuff is traumatizing.\n\nHe just gets static shiv+ie and starts ulti+E, starts a passive double attack and someone squishy dies. \n\nIt's like 800-900 damage in under a second at 2-3 items, and he can do it almost right away again a couple of autos later.","replies":[]}]},{"poster":"TimeSaint","date":"2018-03-17T12:25:46.091+0000","up_votes":1,"down_votes":0,"body":"True people dont respect yi and then midgame they just end up typing n all chat about QQQER","replies":[]}]}]}]}]}]}]},{"poster":"Jerry SeinfeId","date":"2018-03-16T11:09:51.890+0000","up_votes":18,"down_votes":0,"body":"Because in a game with about 140 characters, there's plenty of shit you don't like playing against.","replies":[]},{"poster":"Agent Corgi","date":"2018-03-16T19:27:55.588+0000","up_votes":5,"down_votes":0,"body":"Can't tell you how many times I've had to play Vayne because Kai'Sa ended up being Picked/Banned. As annoyed as I was, I ended up learning a champion that was completely foreign to me since I figured they played similarly to one another.\n\nOff topic\n**\"I pity the Hydra, so many heads intent on sharing the meal\" - Tahm Kench, The River King**","replies":[]},{"poster":"DeathBurst","date":"2018-03-16T18:43:15.593+0000","up_votes":4,"down_votes":0,"body":"Didn't check your profile, but mostly, don't ban the top meta picks. At least until Plat, meta isn't really important, so just ban something for YOUR lane that you don't want/know how to play against, or ban a Jungler you don't like.\n\nThing is, before you reach high MMR, the players' skill are much more important than the champions potential, because no one can actually use this potential fully. So you should be much more worried about a Yorick main who know their shit than by a first time GP who picked him only because he's meta. Except you can't know in advance you're against a Yorick main. So don't stress about bans, relax, and just ban something you *personally* don't like.\n\nAnd if you don't really care, ask your team-mates what they want. Most people would want more than 1 ban ^^\n\nAlternatively, you can use this website, when it works: http://bestbans.com/ (It currently doesn't, for quite some time already.)","replies":[]},{"poster":"Raiyza","date":"2018-03-16T14:11:08.162+0000","up_votes":5,"down_votes":1,"body":"I wish we had ban phases like the LCS does. \n\n\"Oh look. He picked kog maw. We can ban janna/lulu now.\"","replies":[{"poster":"Stillname","date":"2018-03-17T04:28:31.466+0000","up_votes":1,"down_votes":0,"body":"I think that it would be pretty frustrating in soloq. Imagine you want a champ banned but you are last in line and they pick it before you can ban it.\n\nIt will be in the new competitive game mode coming out that is more of a tournament style though.","replies":[]}]},{"poster":"HalcyonDweller","date":"2018-03-16T17:57:05.058+0000","up_votes":3,"down_votes":0,"body":"That's why I just ban annoying stuff rather than worry about what is OP or UP. If you are still playing what you know well then most of the time you're going to beat the FOTM sheeple who just follow what is OP each patch (because they won't know what they are doing most of the time).","replies":[]},{"poster":"Proxy345","date":"2018-03-16T11:44:12.029+0000","up_votes":3,"down_votes":0,"body":"Just autoban Yasuo because no one likes him on either team anyways lol","replies":[]},{"poster":"Marshbouy","date":"2018-03-16T15:32:35.261+0000","up_votes":4,"down_votes":1,"body":"I just ban whoever I can't stand to play against. \n\nI can handle most OP picks, but I cannot handle a riven top lane or a xerath mid.","replies":[{"poster":"Alex h8721","date":"2018-03-16T17:04:08.166+0000","up_votes":3,"down_votes":1,"body":"Agree w/ ya especially on xerath, that range is just obnoxious","replies":[]}]},{"poster":"T4underbolt","date":"2018-03-16T16:31:50.965+0000","up_votes":2,"down_votes":5,"body":"Because meddler and ghostcrawler instead of continuing balancing of morello decided to turn this game into clown fiesta for noobs and casuals and buffed the sht out of too many champs. 4 years ago there were picks that were broken but 6 bans were enough to contain broken champs because the rest of them were manageable and had clear weaknesses and required more than just brainless spamming spells off cooldown. Here is your answer.","replies":[{"poster":"HalcyonDweller","date":"2018-03-16T17:57:54.343+0000","up_votes":4,"down_votes":0,"body":"Neither you nor I know if they ever said, \"Lets turn this game into a clown fiesta for noobs!\" And I highly doubt they said that. So let's not pretend people said things that we don't know if they did or didn't, k?\n\nC'mon dude, you're better than this. We just talked about Occam's Razor the other day.\n\nDon't jump to conclusions like lemmings jump off cliffs.","replies":[{"poster":"T4underbolt","date":"2018-03-16T22:42:37.040+0000","up_votes":1,"down_votes":0,"body":"Okay. So I'm gonna go out and start hitting a guy with a hammer untill he is dead but actually I'm going to say \"I'm not hitting this guy with a hammer\" or \" I'm giving him a massage. He will feel great after I finish\". That means I'm not actually hitting him and killing with hammer but giving him a massage and the fact he bleeds isn't true as well. Don't act all high with \"we had a talk\". You are not my father. You are probably still some middle school kid who all you can do is use words you don't understand and copy paste wikipedia.","replies":[{"poster":"HalcyonDweller","date":"2018-03-17T00:06:38.534+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=000a00000000,timestamp=2018-03-16T22:42:37.040+0000)\n>\n> Okay. So I&#x27;m gonna go out and start hitting a guy with a hammer untill he is dead but actually I&#x27;m going to say &quot;I&#x27;m not hitting this guy with a hammer&quot; or &quot; I&#x27;m giving him a massage. He will feel great after I finish&quot;. That means I&#x27;m not actually hitting him and killing with hammer but giving him a massage and the fact he bleeds isn&#x27;t true as well.\n\nYour hammer example doesn't work because there are presumably witnesses and/or forensic evidence. People or forensic scientists can attest to the fact that you \"massaged\" the dude with a hammer. Nobody can attest to (nor has anybody attested to) Rioters saying, \"Let's turn this game into a clown fiesta for noobs!\" Not only is there no evidence of it, but such a simplistic and idiotic statement is highly questionable, and highly unlikely.\n\n> Don&#x27;t act all high with &quot;we had a talk&quot;. You are not my father. You are probably still some middle school kid who all you can do is use words you don&#x27;t understand and copy paste wikipedia.\n\nI'm not acting high and mighty. It's a simple thing, don't jump to conclusions. Or at the very least if you must do so, keep it to yourself.","replies":[{"poster":"T4underbolt","date":"2018-03-18T13:52:12.556+0000","up_votes":1,"down_votes":0,"body":"There is evidence. Game turning into sht fiesta and riot refusing to fix the problem. Even better. They increase the problem with their changes and trying to fool people saying it will fix the problem. But it only fools.fanboys and casuals, nobody else. If you can't understand this and can't see the obvious intentions of riot then you truly are blind.","replies":[{"poster":"HalcyonDweller","date":"2018-03-18T18:47:57.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=000a0000000000000000,timestamp=2018-03-18T13:52:12.556+0000)\n>\n> There is evidence.\n\nOk let's analyze your evidence then, shall we?\n\n> Game turning into sht fiesta\n\nOk that happened, but I still fail to see a connection that you keep implying is there.\n\n> and riot refusing to fix the problem.\n\nI have never seen a Rioter say, \"The game is getting worse and we won't fix it.\" On the contrary, I've actually seen them respond to posts where people raised concerns and said that they were looking into those problems. Additionally, we've seen changes made to the game that deal with some of those problems several patches later.\n\n> They increase the problem with their changes and trying to fool people saying it will fix the problem.\n\nOn what grounds are you saying that they are trying to fool people? Because you keep saying that they are, but you still haven't shown any physical evidence of them thinking or saying that.\n\n> But it only fools.fanboys and casuals, nobody else. If you can&#x27;t understand this and can&#x27;t see the obvious intentions of riot then you truly are blind.\n\nRemember what I said about putting a spin on things with your words to make it sound as awful as possible? You're doing it again and it's making it very hard for me to take you seriously.","replies":[{"poster":"T4underbolt","date":"2018-03-18T22:32:02.075+0000","up_votes":1,"down_votes":0,"body":"What changes they made to make it better. Not.a single of.last patches have fixed anything. And where is your evidence that they are caring about the game? They said countless times to many things they are looking into it and yet did nothing about those things. They just keep saying \"we re looking into it\" like a metronome to settle people down so they can keep milking money untill people are uproaring again and got put off with another lie. You say I got no evidence yet you have none and facts they games is turning more and more sht say that riot doesn't really want to fix anything. Solutions are here for a long time but riot simply refuses to use them because it hurts their wallets.","replies":[{"poster":"HalcyonDweller","date":"2018-03-19T03:30:54.100+0000","up_votes":1,"down_votes":0,"body":"OK every time I point out something is not evidence you just come up with more stuff that you spun yourself up about. We're not going to get anywhere until we address this:\n\n> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=000a000000000000000000000000,timestamp=2018-03-18T22:32:02.075+0000)\n>\n> They just keep saying &quot;we re looking into it&quot;\n\nIndeed.\n\n> like a metronome to settle people down so they can keep milking money untill people are uproaring again and got put off with another lie.\n\nAll of the rest of this statement is something YOU added onto their statement.\n\nThe problem here is that you have this mental image in your head of \"the other side\" and any time somebody says something you don't actually listen to what they said, you just plug it into that mental image and see what your version of them says instead. You're imagining what people say, and then making assumptions based off of it. Just like what you did with me - claiming that I thought and said all that stuff and then calling me biased because of it. You need to get yourself able to identify when you're doing that and stop it. It's only going to make your life (and everyone else's life harder).","replies":[{"poster":"T4underbolt","date":"2018-03-19T07:56:27.149+0000","up_votes":1,"down_votes":0,"body":"You have no evidence that riot wants to fix the game. They say they will but they either don't do anything with a problem or do a complete opposite which screws the game even harder. If this is not enough for you to understand they don't want to fix the game and only lean towards casuals then even God appearing before you and telling you this in person won't convince you. You say I'm avoiding something but you are the one who is unable to admit pure facts that stand in our faces. If riot doesn't fix the game and they have obvious solutions that can be applied all in one patch that means 2 things: they either profit really hard or they are not very smart and have no idea what are they doing. There is no other possible reason.","replies":[{"poster":"HalcyonDweller","date":"2018-03-19T16:09:41.823+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=000a00000000000000000000000000000000,timestamp=2018-03-19T07:56:27.149+0000)\n>\n> If this is not enough for you to understand they don&#x27;t want to fix the game and only lean towards casuals then even God appearing before you and telling you this in person won&#x27;t convince you. You say I&#x27;m avoiding something but you are the one who is unable to admit pure facts that stand in our faces.\n\nMy point was that repeatedly you have imagined that I or Riot have thought or said things (which never actually happened), and you specifically imagined them in a way that made you feel more justified in being angry about them.\n\nI'm willing to consider possibilities, but I'm not willing to jump to conclusions. Is it possible that they don't care? Yeah, but it's not likely. Not with all the different moving pieces that factor into their actions.\n\n> You have no evidence that riot wants to fix the game.\n\nAnd you have no evidence of them refusing to fix things. Possible negligence or mistakes - those two things you might have a case with. But straight up refusing to fix the game? I doubt it.\n\n> They say they will but they either don&#x27;t do anything with a problem or do a complete opposite which screws the game even harder.\n\nConsidering timelines, human error, and hype over new ideas, it would seem to me like there are plenty of reasons they could be messing things up without doing so maliciously.\n\n> If riot doesn&#x27;t fix the game and they have obvious solutions that can be applied all in one patch that means 2 things: they either profit really hard or they are not very smart and have no idea what are they doing. There is no other possible reason.\n\nYou're ignoring workflow and schedules. Their devs can't just drop everything they are doing to pay attention solely to the latest hydra to rear it's head. If they worked re-actively like that they would be running around all the time like chickens with their heads cut off. Nothing valuable would get done and they'd be in a constant state of panic overcompensating changes all the time and just throwing the game's balance even worse out of whack.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"TimeSaint","date":"2018-03-17T12:27:42.828+0000","up_votes":2,"down_votes":0,"body":"I just find it funny cause use to be only 3 people could ban and now we all can ban and i still see some dum dums choose to ban nobody or someone on their own lineup xD or the bottom pick wants you to leave someone open and the enemy picks them haha...classic","replies":[]},{"poster":"PickIe Rickkk","date":"2018-03-16T19:26:14.298+0000","up_votes":2,"down_votes":0,"body":"in season 4 I would strategize banning so that if I was on purple team, I'd refuse to ban the 5th op champion so that there were 2 op champions available. That countered their first pick power pick with mine. \n\nNow I just ban some annoying braindead lane counterpick because there's 50 champs that need to be banned. \n\nI now pretty much ban more based off pickrate than winrate which is sad.","replies":[]},{"poster":"JackMcSnipeyz","date":"2018-03-16T11:56:53.737+0000","up_votes":2,"down_votes":0,"body":"Because there will always be top picks and counter picks.\nYou'll never reach a state where you ban ONLY your counters like LCS because there are a LOT more viable odd ball picks in soloQ.\n\nAlso like someone else said there are over 100 champs in the game, you cant ban every pick you dont like to play against.","replies":[]},{"poster":"Hahahahyena","date":"2018-03-16T11:37:55.899+0000","up_votes":4,"down_votes":2,"body":"the answer is: riot balancing","replies":[{"poster":"LordGeovanni","date":"2018-03-16T21:06:15.397+0000","up_votes":2,"down_votes":1,"body":"Lack there of.","replies":[]}]},{"poster":"Colgate Gator","date":"2018-03-16T19:43:59.067+0000","up_votes":2,"down_votes":1,"body":"Because in the end, you have to end up playing agaisnt something.","replies":[]},{"poster":"T4underbolt","date":"2018-03-20T15:13:44.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HalcyonDweller,realm=NA,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=000a000000000000000000000000000000000000,timestamp=2018-03-19T16:09:41.823+0000)\n>\n> My point was that repeatedly you have imagined that I or Riot have thought or said things (which never actually happened), and you specifically imagined them in a way that made you feel more justified in being angry about them.\n> \n> I&#x27;m willing to consider possibilities, but I&#x27;m not willing to jump to conclusions. Is it possible that they don&#x27;t care? Yeah, but it&#x27;s not likely. Not with all the different moving pieces that factor into their actions.\n> \n> And you have no evidence of them refusing to fix things. Possible negligence or mistakes - those two things you might have a case with. But straight up refusing to fix the game? I doubt it.\n> \n> Considering timelines, human error, and hype over new ideas, it would seem to me like there are plenty of reasons they could be messing things up without doing so maliciously.\n> \n> You&#x27;re ignoring workflow and schedules. Their devs can&#x27;t just drop everything they are doing to pay attention solely to the latest hydra to rear it&#x27;s head. If they worked re-actively like that they would be running around all the time like chickens with their heads cut off. Nothing valuable would get done and they&#x27;d be in a constant state of panic overcompensating changes all the time and just throwing the game&#x27;s balance even worse out of whack.\n\n\nNegligence is as bad as straight up refusing to fix things. And their negligence comes from obvious benefits that they have from game being in such state. The game has been changing into clown fiesta for casuals. It is obvious that if game is easier and you can do flashy oneshots without even sweating it is more popular between noobs and casuals. And they make at least half if not more of lol players population. So riot basically shown middle finger to every veteran player or any player who want a competitive game where your skill matters for the sake of earning money. And let me remind you that their Devs suddenly can instantly add changes to pbe if the problem concerns their chosen one classes/champs if they are too weak. Suddenly every other big work is getting cancelled for a while just to fix their prescious ADCs for example, but they refuse to even start on thinking how to fix problems that are not that hard to fix but been here for months or years. It is obvious bias driven by greedyness.","replies":[{"poster":"HalcyonDweller","date":"2018-03-22T16:09:59.863+0000","up_votes":1,"down_votes":0,"body":"Nothing?","replies":[]},{"poster":"HalcyonDweller","date":"2018-03-20T17:38:40.734+0000","up_votes":1,"down_votes":0,"body":"This wasn't in reply to me, it was in reply to the post. I didn't get any notification for it. We're lucky I found it by checking the post again to see if you had tried to continue discussing this. Same thing happened with your other comment in our other discussion.\n\nJust so you understand how the boards work; you have to click \"reply\" under one of my own comments in order for it to post in reply to me. In discussion pages, any comment made in reply to another comment will put a notification in the other commenter's notification box, until you run out of reply space (visible in discussion view as when replies stop nesting under one another).\n\n> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=001d,timestamp=2018-03-20T15:13:44.961+0000)\n>\n> Negligence is as bad as straight up refusing to fix things. And their negligence comes from obvious benefits that they have from game being in such state.\n\nI used negligence loosely. A better word would have been \"incompetence\" because chances are that they aren't fixing things because they are working on other things. There is a big difference between \"not working on problem A because of working on problem B\" and \"not working on problem A out of a malicious desire to screw people over\" as you have implied.\n\n\"Obvious\" AKA \"easy to infer.\" The inference can still be false. It might be \"obvious\" to some people that vaccines cause autism, or that the moon landing was faked, or that the 9/11 attacks in the USA were an inside job, etc. Being \"obvious\" to someone doesn't make any of these theories true. \n\n> The game has been changing into clown fiesta for casuals. It is obvious that if game is easier and you can do flashy oneshots without even sweating it is more popular between noobs and casuals. And they make at least half if not more of lol players population. So riot basically shown middle finger to every veteran player or any player who want a competitive game where your skill matters for the sake of earning money.\n\nWait, let me repeat that back to you to see if I correctly understand what you are saying:\n\n1. \"The game has been getting changed to cater to casuals\"\n\n2. \"It stands to reason that if the game is easier then it will be more popular among casual players.\"\n\n3. \"Casual players make up most of the player-base.\"\n\n4. \"**Therefore** Riot is flipping off all the veteran players to chase money from the majority.\"\n\nI have a number of problems with this argument:\n\nFirst, there is a big difference between catering to one group and flipping another group off. If you think that paying attention to another group instead of your group is the equivalent of being flipped off then that's actually kind of an entitled attitude to take. If a waiter brings water to one table but not another, they aren't literally flipping the second table off, they simply didn't provide the same level of service to the second group. Getting upset over it is textbook entitlement, and in a restaurant where you pay for service, it makes sense, but in a free to play game where nobody pays for service, it is not.\n\nSecond, statement #4 is a leap in logic. It is just as easy to infer other conclusions from your line of reasoning instead of #4. Such as, \"Riot is catering to the majority of players in an effort to make the game more fun for more people.\" You're missing some supporting statements that would be necessary to draw a connection between \"catering to casuals,\" and \"flipping off veterans\" or \"chasing money.\"\n\nThird (this is mostly just advice, not actually a counterargument), you made your assertions out of order which made it confusing to follow. If you want people to listen to you, understand you, and be persuaded to follow your point of view, you need to present things in an understandable order. If you present the ideas out of order you are more likely to lose your audience because they stop understanding what you mean. Statement #1 should have been after statement #3 and before statement #4.\n\n> And let me remind you that their Devs suddenly can instantly add changes to pbe if the problem concerns their chosen one classes/champs if they are too weak. Suddenly every other big work is getting cancelled for a while just to fix their prescious ADCs for example, but they refuse to even start on thinking how to fix problems that are not that hard to fix but been here for months or years. It is obvious bias driven by greedyness.\n\n[citation needed] Please give examples, rather than just vaguely reference actions in a way that could be construed any number of ways. As far as I know, they cannot just \"instantly add changes to the PBE\" because testing and development are processes with existing schedules and workloads. If you go to the grocery store and while you are in the checkout line you try to hand your cashier an item to scan while they are in the middle of picking up an item off the grocery belt to scan, you interrupt the whole process and make everything take longer. This is much more apparent in processes that are more complicated than scanning grocery items, such as factory work or video game development and testing.\n\nAlso please try to present your ideas without coloring the argument with made up examples of things that you imagine they think or say or do. Using such imaginings as if they are evidence of things only distorts the argument and makes it more difficult to sort through claims and reasoning.","replies":[]}]},{"poster":"DeloricVI","date":"2018-03-19T04:15:24.158+0000","up_votes":1,"down_votes":0,"body":"I feel a lot of the same way.... in levels of play like mine, the typical pattern I observe in the mid lane is with assassins. I tend to hold my own in a rough stalemate with assassins, because I usually play a champion that doesn't counter them well because he's my main and I know him best. But, after about 15 minutes or so of me denying them kills, they just roam to another lane, and no matter how many times I ping, my allies usually ignore me and just die, allowing them to snowball.\n\nIf I ban Zed, they pick Katarina. If those are both gone, they pick Talon. If Talon isn't available, they pick Kassadin. If they don't pick Kassadin, they have Fizz. There are so many assassins, you could master 3 and never get banned out. There are so many champions that fill very similar roles that picking a couple of them makes you un-bannable.","replies":[]},{"poster":"MorganFreemanBot","date":"2018-03-18T22:33:39.554+0000","up_votes":1,"down_votes":0,"body":"Because most of the champions you want to ban aren't legitimately unbalanced, you just don't like playing against them.","replies":[]},{"poster":"ValyrianBlade","date":"2018-03-16T19:39:51.383+0000","up_votes":1,"down_votes":0,"body":"Ya, whenever I banned Diana, they'd pick Akali. Even blind pick it before I picked...\n\nStarted banning Akali though, and fortunately don't see Diana getting picked instead.","replies":[{"poster":"LightIsMyPath","date":"2018-03-18T12:34:15.667+0000","up_votes":1,"down_votes":0,"body":"Maybe that's not the case, but if I saw a Diana ban I would think Kat/Yasuo/Talon is coming.. Since Akali does well into them she's picked. On the other hand though an akali ban doesn't mean much cause she's annoying to way more champions and she's more commonly picked. Like if I see Morgana banned 70% of the time they have blitz/thresh...","replies":[{"poster":"ValyrianBlade","date":"2018-03-18T15:05:19.156+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LightIsMyPath,realm=EUW,application-id=3ErqAdtq,discussion-id=HsNEwEPx,comment-id=00100000,timestamp=2018-03-18T12:34:15.667+0000)\n>\n> Maybe that&#x27;s not the case, but if I saw a Diana ban I would think Kat/Yasuo/Talon is coming.. Since Akali does well into them she&#x27;s picked. On the other hand though an akali ban doesn&#x27;t mean much cause she&#x27;s annoying to way more champions and she&#x27;s more commonly picked. Like if I see Morgana banned 70% of the time they have blitz/thresh...\n\nYea that's kind of what I mean. Akali is an easier to play (with less potential) version of Diana. Anyone that Diana does well against, Akali often beats too by virtue of their kits being so similar (i.e. lots of damage with a targeted low cooldown ultimate dash that has resets). If Diana lands her Q her burst is stronger (not to mention she's innately tankier), but Akali doesn't need to land anything to just go in with her R and have resets.","replies":[]}]}]},{"poster":"GripaAviara","date":"2018-03-18T14:02:10.309+0000","up_votes":1,"down_votes":0,"body":"I perma ban master yi. The only champion as retard as that one is veigar, but i prefer vs veigar than die to a 5-0 master yi at lvl 6","replies":[]},{"poster":"Oxyrotten","date":"2018-03-16T11:41:54.648+0000","up_votes":1,"down_votes":0,"body":"You must play toplane!","replies":[{"poster":"BangerDolo","date":"2018-03-17T18:46:06.421+0000","up_votes":1,"down_votes":0,"body":"And bot","replies":[]}]},{"poster":"Chigara Ashada","date":"2018-03-16T21:27:16.972+0000","up_votes":1,"down_votes":0,"body":"Just ban Zoe fam.","replies":[{"poster":"BangerDolo","date":"2018-03-17T17:54:53.230+0000","up_votes":1,"down_votes":0,"body":"Banning Zoe in this patch? LUL","replies":[]}]},{"poster":"LordGeovanni","date":"2018-03-16T21:01:01.933+0000","up_votes":1,"down_votes":0,"body":"ban {{champion:67}}  get {{champion:51}}  ban her get {{champion:222}}  ban her get {{champion:119}}  ban him get {{champion:67}}  or {{champion:202}}","replies":[]}]}