{"poster":"Forgottën","date":"2015-02-11T03:26:13.437+0000","title":"Problemas con server","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hola, recien vengo de jugar una partida y aunque mis fps estaban altos y mis ms estables se podia notar un delay o \"patinaje\" en los campeones increible, tanto de mi equipo como del enemigo. Veo que hay artos post parecidos desde la mañana, pero siempre es mejor avizar que siguen los problemas...saludos.","replies":[{"poster":"Farnese","date":"2015-02-11T03:44:55.221+0000","up_votes":1,"down_votes":0,"body":"Denante jugué un par de rankeds con 10 ms, aunque el delay de mi equipo y del enemigo existía. Incluso, cuando lograba una kill mi enemigo se quedaba un par de segundos \"vivo\" sin la barra de HP, así de asqueroso el delay, sin nombrar el retraso de habilidades y el recall y un sin fin de detalles","replies":[]},{"poster":"katebal","date":"2015-02-11T03:42:11.108+0000","up_votes":1,"down_votes":0,"body":"desde el día viernes por la noche que comenzó el lag y a día de hoy sigue igual o peor y la única respuesta que me dieron a mi correo (porque envié una queja formal a soporte) fue que se debía a que quizás estaban haciendo mantenimiento o que se debía a problemas con mi conexión pero no es así la verdad por mi parte voy a dejar pasar una semana antes de volver a intentar jugar tal vez si notan en algún momento la disminución de partidas y gente conectada al juego se tomen la molestia realmente de revisar que ocurre y se pongan manos a la obra de arreglar el problemas... de momento sostienen que ellos no tienen la culpa de que nadie pueda jugar y que dejemos la queja en el foro y que siempre tienen gente trabajando en el foro que nos dará una respuesta jaja, pero esa persona, creo que se tomo vacaciones sin avisar, porque son mas de 200 post informando y pidiendo explicaciones de porque tanto lag y hasta ahora ellos; si dijeron algo, era para lavarse las manos...","replies":[]},{"poster":"cronos365","date":"2015-02-11T03:33:02.840+0000","up_votes":1,"down_votes":0,"body":"ami me estuvo andando con 150 de ping todas las partidas que es el limite de lo jugable si tuviera menos de 12 mb me andaria muy mal","replies":[]}]}