{"poster":"Beats29","date":"2015-10-29T21:25:53.138+0000","title":"I was reading about Mastery Changes, and 1 thing made me really confused","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Tier 1 (**Maximum 5 Points** split between Recovery and Unyielding)\nRecovery:  +0.4/0.8/1.2/1.6/2.0 Health Regen per 5 seconds\nUnyielding: +1.2%/2.4%/3.6%/4.8%/6% Bonus Armor and Magic Resist\n\nTier 2 (**Choose one**)\nExplorer: +12 Movement Speed in Brush and River\nTough Skin: You take 2 less damage from Champion and Monster basic attacks.\n\nAnd so on...\n\nDoes this mean we will have only 18 points avaiable on each tree? And most importantly, isn&#039;t this a big hit to hybrid champions? What if you wanna take points on same tier that are more worth to them but you can&#039;t because of the limit?\n\nI&#039;m not overacting btw, I&#039;m just confused, since I have no acess to PBE.","replies":[{"poster":"Meddler","date":"2015-10-29T21:43:14.199+0000","up_votes":5,"down_votes":1,"body":"Yes, there is now a limit of 18 points per tree, with a maximum of 5 per stat tier and 1 per keystone tier. It's possible some hybrid's might suffer from that, and need some follow up help, there are a couple of masteries that they really benefit from however (e.g. there's now one mastery that gives both AD and AP per level, rather than those stats being split across two different masteries).","replies":[{"poster":"Beats29","date":"2015-10-29T21:56:42.931+0000","up_votes":2,"down_votes":0,"body":"Thank you very much for the fast answer.\n\nWell, I somewhat understand the reasoning and it's probably to avoid people taking the same thing all the time (like most junglers giving preference to offensive tree), but the change on Tier 5 of Ferocity Tree seems a big hit, specially to Kayle and Jax, even more if you consider the changes to Trinity Force and Black Clever. In theory, I'm definitely not happy with this, but I guess it's a matter of pratice. We'll see. I understand ADCs do really need some change, but please don't ignore how those item/masteries can affect other roles. ","replies":[]},{"poster":"eux0r","date":"2015-11-03T04:01:49.550+0000","up_votes":1,"down_votes":0,"body":"i am sorry if i am necroing something but i just saw your comment on a [third party information aggregator](http://www.reignofgaming.net/news/32763-more-context-on-marksman-update-and-preseason) and seeing as it is really hard to get any reply as a non-NA i see little other options:\n\nseing a rioter say things like \"If you felt good about the variety before, then you should feel even better going into this new system.\" makes me really sad, because it is simply not true. \n\ni made [a post](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/dluaqrW3-feedback-masteries-on-pbe) where i go into more detail/give some examples but the gist is: the masteries are taylored for generic builds and if you want to go magicdamage-attackspeed or something like that the masteries are just plain worse in comparison. \nthey offer no proper way for unconventional builds to specialise and force you to take stuff you dont want with no conceivable reason.","replies":[]},{"poster":"lofi n chillhop","date":"2015-10-29T23:14:53.787+0000","up_votes":1,"down_votes":0,"body":"it seems like a more significant shift to now have the second most powerful tier now be available in your second tree, or to have at least one of these new tiers in all three trees! I saw a comment from a red maybe you meddler I forget, that the masteries would be as strong as strong as before, but if there are now 18 points in one tree instead of 21 I don't think that statement can be fairly said at all! there is a significant enough shift in power, that the new system can't be gauged against the old system.","replies":[]}]},{"poster":"lofi n chillhop","date":"2015-10-29T21:33:25.299+0000","up_votes":1,"down_votes":0,"body":"well, now the same 5 points for ap per level also give you ad per level, so actually hybrid champs are bufffed :D\n\n... altho now you have to pick between armor pen and magic pen. lol :( ","replies":[{"poster":"Beats29","date":"2015-10-29T22:34:26.398+0000","up_votes":1,"down_votes":0,"body":"I dunno, I think the flat AP/AD is easier to itemize than armor/magic penetration.","replies":[{"poster":"lofi n chillhop","date":"2015-10-29T23:07:51.339+0000","up_votes":1,"down_votes":0,"body":"yeah I agree... there's actually three pen masteries now, one which is hybrid pen, one for armor, and one for magic, I don't really get it... especially with their ad and ap per level being in one mastery...","replies":[]}]}]}]}