{"poster":"Robin Hoody","date":"2019-08-07T05:46:43.349+0000","title":"Las Clasificatorias en low-mid elo son una loteria","subforum":"Charlas Generales","up_votes":14,"down_votes":5,"body":"Ganas 1 porque el jg enemigo no sabe jugar y termina 1/10, stompeas al enemigo y ganas.\nEn la siguiente tu supp es unrank, lleva lux porque quiere carrear, muere 21 veces... en la otra tu bot decide trolear, entre supp y adc mueren 25 veces en 25 minutos, te stompean, perdes... en la siguiente hay un afk en el enemigo, ganas por mayoria... en la siguiente tu mid y top no se aguantan la linea, mueren 6 veces cada uno en 10 minutos... osea... ya no importa que tan bueno seas, que tanto te esfuerces, es un juego de a 5 y estas jugando a la fortuna en el emparejamiento... por lo menos esto me pasa a mi... y se muy bien que a muchos, aunque salgan a decir \"la suerte no existe\"... yo considero que mientras haya un equipo ganador y uno perdedor... podes estar 80% en el ganador u 80% en el perdedor... o 50 y 50 como la mayoria.\nHoy jugue muy bien varias partidas y las perdi... y en una de las que gane mi adc era una MF 0/12, esa persona ganó, y no lo merecia, el jg enemigo jugo espectacular, y perdió, el adc fue el mejor de la partida, y le gano una MF que no sabia farmear.\n\nLOTERIA SEÑORES!","replies":[{"poster":"Zevko","date":"2019-08-07T06:32:03.488+0000","up_votes":12,"down_votes":8,"body":"si seguramente sea eso, seguramente los high elo cuando smurfean en oro siempre tienen suerte por algún tipo de magia o conjuro sino cómo es que logran subir varias cuentas de gold en muy pocos días?","replies":[{"poster":"Mitsuri Kanroji","date":"2019-08-07T07:12:34.834+0000","up_votes":14,"down_votes":3,"body":"Pero el no esta smurfeando, no podes esperar que juegue de 10 la linea, el juega como puede  y no fedea, pero tiene otra persona en el equipo que se la pasa fedeando  y aunque el haya ganado linea a su compañero lo stompearon, tenes 1 menos en el equipo y uno fedeado del otro","replies":[{"poster":"Nabuze","date":"2019-08-07T10:26:23.619+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Zereƒ Dragneel,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=00000000,timestamp=2019-08-07T07:12:34.834+0000)\n>\n> Pero el no esta smurfeando, no podes esperar que juegue de 10 la linea, el juega como puede  y no fedea, pero tiene otra persona en el equipo que se la pasa fedeando  y aunque el haya ganado linea a su compañero lo stompearon, tenes 1 menos en el equipo y uno fedeado del otro\n\nCon esto solo admites que \"el que no está smurfesndo\" no le dan las capacidades.\n\nEl smurf se le hace fácil porque ya conoce lo que hace falta para ganar y lo que le funciona a él para escalar.\n\nSi jugas \"bien\" no basta. Es una partida buena pero sigue siendo de nivel de tu liga actual.\nSi querés subir tenés que jugar diferente al resto de jugadores en la misma partida. Tenés que destacar mucho más que los demás en lo que haces.","replies":[{"poster":"Arsig","date":"2019-08-08T03:57:31.020+0000","up_votes":1,"down_votes":0,"body":"Pues en teoría si ,no? , digo supongamos que estamos jugando en oro , y vos queres ser platino , para ser platino tenes que tener el nivel de un platino y si tenes el nivel de platino deberías poder ganarle a los demás oros.\no sino que otra alternativa tenemos para subimos de liga?","replies":[{"poster":"Nabuze","date":"2019-08-08T16:16:34.871+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Arsig,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=0000000000000000,timestamp=2019-08-08T03:57:31.020+0000)\n>\n> Pues en teoría si ,no? , digo supongamos que estamos jugando en oro , y vos queres ser platino , para ser platino tenes que tener el nivel de un platino y si tenes el nivel de platino deberías poder ganarle a los demás oros.\n> o sino que otra alternativa tenemos para subimos de liga?\n\nSi tenés el nivel de un platino sólido entonces vas a poder ser platino sin problemas.\n Si llegaste a platino sin haber hecho ningún dúo entonces deberías ser capaz de volver a llegar.\n\nSi no puedes llegar a platino es que falta mejorar.\n\nNo lo digo de caprichoso es una realidad frustrante con la que nos chocamos una vez que llegamos a nuestro límite cada cierto tiempo.\n\nActualmente estoy en Maestro y mí tope fue GM pero en GM el juego cambio para mí y me hizo entrar en una racha de derrotas tremenda. No fui lo suficientemente bueno para GM y ahora estoy que bajo a DI.\nMe falta mejorar.\n\nEn cambio si bajo a platino a una smurf no dependo mucho de mí equipo. El ritmo con el que influenció las líneas no deja a mí enemigo carrear.\nHay cosas que uno puede ver que los demás no ven y cuando te das cuenta de eso mejoras mucho.\n\nMe fui por las ramas, era más que nada para no dejar tan seco el primer párrafo.","replies":[]}]}]}]},{"poster":"Te voy a Trolear","date":"2019-08-07T09:02:35.069+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=0000,timestamp=2019-08-07T06:32:03.488+0000)\n>\n> si seguramente sea eso, seguramente los high elo cuando smurfean en oro siempre tienen suerte por algún tipo de magia o conjuro sino cómo es que logran subir varias cuentas de gold en muy pocos días?\n\nSi seguamente no juegan con un duo high antes de estancarse y seguro la mayoria no juega jg para subir {{sticker:sg-lulu}}","replies":[{"poster":"Zevko","date":"2019-08-07T09:18:16.672+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Te voy a Trolear,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=00000001,timestamp=2019-08-07T09:02:35.069+0000)\n>\n> Si seguamente no juegan con un duo high antes de estancarse y seguro la mayoria no juega jg para subir {{sticker:sg-lulu}}\n\n??? estas insinuando que un jg high elo no podría salir de oro solo? XDDDDD","replies":[{"poster":"Te voy a Trolear","date":"2019-08-07T09:48:49.661+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=000000010000,timestamp=2019-08-07T09:18:16.672+0000)\n>\n> ??? estas insinuando que un jg high elo no podría salir de oro solo? XDDDDD\n\nsi no es bosteado ni carreado y esta en high claro que sale solo de oro. y que es el rol mas facil de subir de eso tampoco hay duda :v. Pero si se cansa del mal emparejamiento seguro se pone a jugar con un duo para salir mas rapido, cosa que si alguien de menos nivel juega solo puede bajar mucho por este emparejamiento random.","replies":[]},{"poster":"RAT IRL9","date":"2019-08-07T09:38:19.056+0000","up_votes":2,"down_votes":4,"body":"Elmillor (challenger/master ) es el mejor ejemplo, 4 dias en platino bajo , asi que si, es dificil salir de low elo , va a salir obvio pero cuesta no es que les regalen las partidas {{summoner:11}}","replies":[]}]}]},{"poster":"Nikorn12","date":"2019-08-07T19:41:48.059+0000","up_votes":1,"down_votes":0,"body":"La realidad es que las personas que suben cuenta en cuanto logran subir el mmr, subir es mucho mas facil. Pero necesitas ser mucho mas impecable en todos tus movimientos para ganar una partida de la cual tus compañeros van a ser una carga mas que una ayuda. Por eso muchos que se crean cuentas las primeras 10 clasificatorias las ganan y ya despues saltan de divicion y estando en oro/ platino por lo menos tus compañeros no son tan random ( si afk pero no tanta diferencia) \n\nPiensen que en una linea sale un \"sin clasificar\" enfrente tiene a un Oro 2, poque gano 3 partidas seguidas de sus 10 de emparejamiento y muy posiblemente ese equipo pierda porque no tiene que estar en ese nivel. Cuando si estuviera smurfeando ese sin clasificar va a ser el que rompa todo","replies":[]}]},{"poster":"Hendrix","date":"2019-08-07T12:51:06.377+0000","up_votes":3,"down_votes":0,"body":"Es muy raro encontrar partidas parejas. La inmensa mayoria de las partidas se ganan por paliza o se pierden por paliza.","replies":[{"poster":"Annie Botz","date":"2019-08-07T15:18:49.047+0000","up_votes":1,"down_votes":0,"body":"Esto es un tema de parches (antes una partida podía durar 1 hora, ahora 40 es mucho).\n\n Igual la suerte influye pero no lo suficiente para que te atasques en 200, 300 o más partidas. Si con el solo hecho de tener 51%winrate o incluso 50 puedes subir a platino mínimo, te dan una win free, es que literal te ponen en bandeja las cosas para subir hasta oro-platino, luego es poner un poco más de tu parte pero no es un conocimiento extraordinario, solo es saber elegir según la situación.","replies":[{"poster":"Hnk Kenshiro","date":"2019-08-07T17:59:41.359+0000","up_votes":1,"down_votes":0,"body":"Y si subiendo de liga fallas 2 veces, tienes 2 wins gratis xd","replies":[{"poster":"Annie Botz","date":"2019-08-07T22:26:03.658+0000","up_votes":1,"down_votes":0,"body":"No tenía idea de eso, gracias por el dato xd","replies":[]}]}]}]},{"poster":"Mitsuri Kanroji","date":"2019-08-07T07:07:32.437+0000","up_votes":1,"down_votes":0,"body":"No solo es asi en low/mid elo, yo juego partidas con gm/master/diamante, considero que este elo es alto y aun asi es coinflip, no solo en LAS en todos los servidores pasa lo mismo, y en especial en elo alto que una kill ya es mucha diferencia. Te stompean una linea y si tu linea no recupera perdes el game","replies":[{"poster":"Rohaerlyn","date":"2019-08-07T07:58:55.167+0000","up_votes":3,"down_votes":0,"body":"Para de morir porfa\neS qUe nO jUeGo aDc \n{{sticker:sg-shisa}}","replies":[]}]},{"poster":"Vaaš","date":"2019-08-07T20:03:19.725+0000","up_votes":1,"down_votes":0,"body":">  ya no importa que tan bueno seas, que tanto te esfuerces, es un juego de a 5 y estas jugando a la fortuna en el emparejamiento.\n\nExacto. \n\nLlega a ser tan hilarante ver a tus compañeros jugar tan mal, armarse mal  que simplemente no merecen ganar y yo solo disfruto del gran desastre JAJA porque me da igual perder o ganar sinceramente ¿Te imaginas si subo esta cuenta a D como la otra? ya no sería divertido.\n\nLas cosas que veo en Plata no las veo en D (ni que juegue tanto tampoco) ya no sería lo mismo pero es como dices, es una lotería.","replies":[{"poster":"lordeman10","date":"2019-08-07T23:00:31.090+0000","up_votes":1,"down_votes":0,"body":"Podés hacerlo mejor pero no lo hacés porque te tocan compañeros malos.. eso no es lotería eso es tener mentalidad debil, si sos bueno tenés que demostrarlo no alcanza con saberlo","replies":[{"poster":"Vaaš","date":"2019-08-07T23:37:02.525+0000","up_votes":1,"down_votes":0,"body":"Son malos, no merecen ganar.\n\nCuando jueguen mejor se merecerán subir.","replies":[{"poster":"lordeman10","date":"2019-08-08T00:01:13.774+0000","up_votes":1,"down_votes":0,"body":"y sin dudas van a hacerlo! el problema con esto es que ya no los van a emparejar con vos y a vos te van a emparejar con nuevos plata igual de \"malos\" que los anteriores, así hasta que vos mejores o decidas subir\n\ndigamos si hay una loteria sobre tus compañeros a veces salen mejores y a veces peores.. pero no hay azar en subir ligas, podés tener alguna buena o mala racha de vez en cuando pero no te pueden llevar muy lejos eso deberías tenerlo más que claro si llegaste hasta diamante","replies":[{"poster":"Vaaš","date":"2019-08-08T02:02:25.337+0000","up_votes":1,"down_votes":0,"body":"Uso esta cuenta para \"trolear\" o simplemente divertirme ya lo dije me da igual ganar o perder subir o bajar.\n\nPero si veo a uno malo no me gustaría ver a ese en D porque no se lo merece prefiero perder ya que no me importa y listo.","replies":[{"poster":"lordeman10","date":"2019-08-08T15:13:43.734+0000","up_votes":1,"down_votes":0,"body":"esto es retorcido\n\npero yendo a lo que impoerta, ¿en que quedamos? ¿si te pones las pilas y jugas en serio podés subir o hagas lo que hagas no importa porque es una loteria?","replies":[{"poster":"Vaaš","date":"2019-08-08T19:54:40.041+0000","up_votes":2,"down_votes":0,"body":"Hmmm como que no entendiste la parte donde digo: \"ME DA IGUAL ganar o perder subir o bajar\"","replies":[]}]}]}]}]}]}]},{"poster":"unionsovietica8","date":"2019-08-07T12:03:29.857+0000","up_votes":2,"down_votes":0,"body":"Hola tengo mucha experiencia en ranke Jejeje. Y te puedo decir que en base de perder 7 rankes seguidas una muy mala suerte a causa de ( Las primeras jugue espectacular pero mi team una m... la 4,5,6 Afk trolls mancos y el tipo que no entraba por el bug de la carga de pantalla que me paso hace unas horas. Y la Septima el colmo... 1 que lo matan a los 5 minutos y empieza a regalar muertes. naaaa) Despues de esas partidas me dan 15 pl si gano y me quitan 20 si pierdo. Me re cagaron el mmr. No soy muuuuuuuuy bueno pero jugue excelente en las 7 y tenia que entrar en tf ahi mi score empeoro. Y en cada partida no lo podia creer. una tras otra. Es increible ademas que estoy por caer a plata y me tocan 2 oros y la siguente partida para sumar 15 miseros pl me tocan platas y \"Bronces\"!!!. Y no es todo las ultimas 6 partidas creo me tocaron puros afkkkk o se van afk 10, 15 minutos. Dios. Conclusion!...\nEl sistema beneficia a los que tienen buena racha no a los habilidosos. Si tenes una muy mala suerte y perdes 4 o mas partidas consecutivas el sistema dice \"Bueno este chico no es bueno no pertenece a este elo lo emparejo con gente de etc. Y ahi en vez de ayudar te hunde mas. Ultimamente les juro estoy jugando sin ganas!. Y elijo cualquier linea se jugar todas. Pero ya casi sin prestar atencion ni nada la ultima la gane creo y jugue casi como probando champ runas y hechizos osea me daba igual perder o ganar. Y una Kata smurf me carreo. Jugue con esos animos por que me hago la idea que, para que ganar si la proxima que juegue me toca un troll manco o afk y la pierdo imposible asi!!!.","replies":[{"poster":"Robin Hoody","date":"2019-08-07T22:26:21.107+0000","up_votes":2,"down_votes":0,"body":"exacto... si no tenes suerte, basta con tener una racha de 7 u 8 derrotas para hundirte... en las placements tuve 4 partidas con afks, en una un nasus jg troll, y en otra un top que murio 6 veces y se fue.... fueron 6 de 10 que eran inganables... 1 la gane y 3 las perdi por mi mal desempeño... quede 1 victoria 9 derrotas en las placements, eso me hundio de entrada... imaginate despues perdiendo un par ya solo me tocaba gente negativa... hasta hoy","replies":[]}]},{"poster":"HopelessRomantic","date":"2019-08-07T06:33:37.738+0000","up_votes":3,"down_votes":1,"body":"Por eso uno siempre lleva un duo confiable cuando rankea. Disminuye la probabilidad de que te toquen esos \"indeseables\".","replies":[{"poster":"Vileplume","date":"2019-08-07T16:47:37.858+0000","up_votes":1,"down_votes":0,"body":"Jugando con mi duo bajé a oro IV. La gente así toca igual, encima cuando juego con alguien son peores","replies":[{"poster":"Kårlsęfnni","date":"2019-08-07T17:36:14.594+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Watermellow,realm=LAS,application-id=v7qsfXsE,discussion-id=UMR0FEuK,comment-id=00010000,timestamp=2019-08-07T16:47:37.858+0000)\n>\n> Jugando con mi duo bajé a oro IV. La gente así toca igual, encima cuando juego con alguien son peores\n\nEso es porque el mmr de tu duo es más bajo que el tuyo, o los 2 tienen un mmr de mierda hehehe","replies":[{"poster":"Vileplume","date":"2019-08-07T20:45:24.115+0000","up_votes":1,"down_votes":0,"body":"Sip, tiene un mmr malísimo. Pero jugando sólo me toca gente mala. (No tan mala como la que me toca jugando con el)","replies":[]}]}]}]},{"poster":"Osorkon21","date":"2019-08-07T09:14:02.174+0000","up_votes":2,"down_votes":0,"body":"Si bro, así es el emparejamiento low - mid elo, por eso céntrate en mejorar tu nivel hasta un punto donde puedas carrear fácilmente si te sale el equipo perdedor, eso es lo que hace la diferencia, y eso es lo que permite a la gente de ligas altas subir sus cuentas de Unranked a diamante en 1 - 2 semanas\n\nPd: no es que a esta gente no le tocan trolls, afks, feeders, flammers, mogolicos ratas y todo ese tipo de jugadores... les tocan pero de las partidas donde les toca esa gente logran ganar varias carreando al equipo (esto no depende solo de ser un genio mecánicamente y salir 14/0, sino que depende principalmente de tu Macro Juego) si sabes controlar la presión sobre el equipo enemigo y ponerlos en la situación que necesites/quieras,lograr que se muevan hacia una linea en particular para lograr ir por objetivos sin pelear de forma en que dependas de tu equipo vas a ganar muchas partidas donde te tocan gente muy inútil.","replies":[{"poster":"Osorkon21","date":"2019-08-07T09:23:53.939+0000","up_votes":1,"down_votes":0,"body":"Pos PD: con Low - Mid Elo me refiero a Oro - Platino, hierro - bronce - plata (low elo) básicamente es muchísimo mas fácil subir teniendo buen macro juego, ya que aunque los enemigos sean mejores que tus compañeros, siguen siendo bastante malos mecánicamente y sobre todo no tienen idea de macro game, te recomiendo Jugar top (con TP!) y jugar controlando la presión en 2 carriles (lógicamente con un campeón bueno en enfrentamientos 1 vs 1) Buscando presionar una linea constantemente (si no ganas el 1 vs 1 no lo hagas, la presión dividida requiere que los enemigos se vean obligados a moverse de a 2 a tu linea dejando al resto de tu equipo 4 vs 3 y dandote la oportunidad de usar Tp Para quedar 5 vs 3 y lograr objetivos, torres, baron, dragones)\n\nO jugar Jg o Mid tmb controlando bien la presión en el mapa, como jungla gankeando donde sea necesario para asegurar un objetivo si el gank sale bien, o bien Mid si sos bueno mecánicamente y podes fedearte early y buscar hacer buen snowball con roaming, gankeando top y bot cada vez que puedas pushear mid hasta torre enemiga para obligar al otro midlaner a quedarse en mid para no perder cs o cada vez que puedas mandar a base o matar al mid enemigo.\n\nSon cosas bastante básicas del macro juego que muchas veces ignoramos y jugamos a lo tarados buscando ganar solo por fed/ventaja de composición/superioridad mecánica.","replies":[]}]},{"poster":"Alfisto","date":"2019-08-07T06:48:58.244+0000","up_votes":2,"down_votes":0,"body":"Hay algo de razón en lo que dices. Yo aportaría que la constancia y el buen juego propio a la larga te llevarán a conseguir el objetivo. Lo que no hay forma de calcular es en cuanto tiempo lo lograrás: ahí es cuando se aplica a rajatabla tu argumento. No hay manera de saber que tan poco/tanto/mucho  te costará llegar a x liga.","replies":[{"poster":"unionsovietica8","date":"2019-08-07T12:14:28.456+0000","up_votes":1,"down_votes":0,"body":"Apoyo ciertamente eso estaba en plata 4 hace poco y decidi subir a oro en 4 dias lo consegui. Y fue por que entendi que tenia que hacer objetivos xP. Empeze a ir yorick top o miss adc champs que son muy utiles para barrer lineas o ayudar en tf. Pero hay algo que no muchos dicen y por experiencia es muy cierto. Hay que tener cuidado con las malas rachas. por que una vez que caes no solo te recompensan con pocos pl y te quitan bastante sino que te emparejan con Afk gente que no tiene ni idea en el juego etc. Y asi hay muchos que se estancan. Ojo con eso.","replies":[]}]},{"poster":"Lechowski","date":"2019-08-08T19:24:30.784+0000","up_votes":1,"down_votes":0,"body":"Creo que no están entendiendo lo que él quiere decir. \nPor lo que cuenta, y doy fe de eso, las partidas no son \"competitivas\", se gana por supremacía/stompeando o se pierde de la misma manera. Que la razón de esto sea un afk, un unranked, un troll, una mala partida, da igual. Lo cierto es que las partidas no son \"ajustadas\" por lo que uno no se queda con la sensación de \"si jugase un poco mejor, habría ganado y quizá podría subir (por ejemplo) de oro IV a oro III. Las divisiones no se sienten escalonadas, puesto que sólo (o casi siempre) se gana o pierde stompeando, hay que ser un stomper, hay que ganar por supremacía y carrear a todo el equipo para ganar, por esta situación los Smurfs no tienen problemas, pero así no debería ser el juego sino que debería sentirse escalonado.  \nObviamente si (inserte nombre de jugador profesional) jugase la partida con un midlaner 0/20 en Plata III la ganaría igual, pero en una situación donde hay 10 jugadores realmente Plata III, queriendo subir a Plata II no se supone que tengan el nivel de jugar 4v6, ni de poder stompear tan fuere su línea como para compensar la del otro, por eso están apuntando a Plata II y no a GM.","replies":[{"poster":"Del0reaN","date":"2019-08-09T01:55:35.757+0000","up_votes":1,"down_votes":0,"body":"Una gran parte del problema en los emparejamientos es la creación de cuentas smurf. Hace unas semanas atrás creé una con la intención de ver qué pasaba. Oh! Sorpresa. Me encontré con partidas en las que me emparejaban (a pesar de tener un MMR \"alto\") con jugadores de niveles bajos que todavía no sabían jugar.\n\nLas partidas normales se resumían a quién abusaba más de los novatos. Ni hablemos de ARAM, donde ganaba el equipo con más smurfs.\n\nLos emparejamientos en general son una lotería, de eso no me quedan dudas, pero hay que ser realistas, la comunidad con sus cuentas smurf arruinan una gran parte de lo poco que se puede hacer.","replies":[]},{"poster":"Robin Hoody","date":"2019-08-08T20:57:12.889+0000","up_votes":1,"down_votes":0,"body":"todos dicen la misma boludes \"como faker y otros pro llevan cuentas unrank a challenger en 2 semanas\"... ese es el punto, son pro... si un silver1 tuviera que jugar como grand master para subir a oro, el sistema seria una poronga... y oh sorpresa... lo es...","replies":[]}]},{"poster":"Del0reaN","date":"2019-08-08T04:30:32.950+0000","up_votes":1,"down_votes":0,"body":"Creo que el gran problema es la brecha GIGANTE que existe entre los que recién se inician y los veteranos. Un recién iniciado te puede destrozar un equipo completo sin esfuerzo alguno (el propio, obviamente), mientras que un veterano en el juego no siempre te va a carrear una partida. De hecho, si ponés a ambos en el mismo equipo, pesan más las malas decisiones de un novato que las buenas de un experto.","replies":[]},{"poster":"lordeman10","date":"2019-08-07T20:25:40.674+0000","up_votes":1,"down_votes":0,"body":"a verrr la suerte existe es algo real, podés tener equipos muy malos y equipos muy buenos la cosa es lo que hacés vos con esa suerte, porque siempre podés hechar a perder la partida aún con un equipo muy bueno, a todos nos pasó, o también podés hacer la gran azaña y lograr cosas maravillosas con un team apestoso\n\nen resumen, las partidas balanceadas tenés que ganarlas, las partidas dificiles tenés que dejarlo todo porque donde ganás alguna de estas rompés la balanza, las partidas fáciles tenés que asegurarlas y listo 55% y después jugás con faker","replies":[]},{"poster":"iiií","date":"2019-08-07T20:07:24.045+0000","up_votes":1,"down_votes":0,"body":"Mientras ganes 6 de 5 subis","replies":[]},{"poster":"Zawyer Rush","date":"2019-08-07T16:33:42.342+0000","up_votes":1,"down_votes":0,"body":"Son coinflip en cualquier elo salvo tengas el nivel necesario para ganar solo ahi se termina la \"suerte\". En esta cuenta tengo un winrate horrible, jugue en una epoca donde vivia tilt y que mi team muriese una vez era motivo para trollear, tenia problemas personales graves y me desquitaba con el juego y deje tan en el pozo su mmr que me cruce a lo peor del pozo del lol. \n\ny aca tenes otra de mis smurf https://las.op.gg/summoner/userName=botbox, nota la diferencia (esta cuenta la tuve que subir como 3 veces a diamond porque me bajo por inactividad).","replies":[]},{"poster":"Pollo al Ornno","date":"2019-08-07T16:23:36.320+0000","up_votes":1,"down_votes":0,"body":"En este juego hasta no llegar a una liga donde medianamente la gente use la cabeza y las manos en vez de los pies y los codos para jugar, recien ahi, vas a tener chances de subir.\n\nTe paso mi ultima ranked jugada para que veas lo asqueroso que fue ese game para mi... Iba akali, MUY fedeado, en las tf me borraba a dos e incluso llegue a sacar 3 en una, pero simplemente mi equipo en vez de pushear o hacer objetivos iba a base o se ponia a farmear la JG (aparte que murieron un monton de veces).\n\nPara mi es un 70% suerte de que te toque justo un troll en el team rival o alguien que logre fedearse en tu team (ya sea un asesino o incluso el propio adc) y 30% habilidad porque basicamente si fedeas todos tus games con muchisima facilidad es porque tu liga es mucho para vos al parecer.\n\nhttps://las.op.gg/summoner/userName=Darkin2396 (fijate el historial)","replies":[]},{"poster":"AzorAha","date":"2019-08-07T07:56:49.880+0000","up_votes":1,"down_votes":1,"body":"También depende de la composición de campeones, porque aunque quieran tapar el sol con un dedo hay campeones más fuertes y útiles que otros. Por ejemplo una miss fortune es mucho mas útil  que por ejemplo una Ashe, una buena R de Miss puede hacer un desastre en una TF y cambiar el transcurso de la partida\n{{sticker:slayer-jinx-wink}} {{sticker:slayer-jinx-wink}}","replies":[{"poster":"unionsovietica8","date":"2019-08-07T12:11:22.204+0000","up_votes":1,"down_votes":0,"body":"Eso es verdad. O un Yi que aunque vasha 0/3 le decis farmea un rato en jg yi y en late se hace un pentakill.","replies":[]}]},{"poster":"BadBunnybb","date":"2019-08-07T10:02:16.576+0000","up_votes":2,"down_votes":3,"body":"El sistema de clasificatoria es perfecto una vez que lo entiendes, mira te lo voy a explicar lo mas sencillo posible.\n  simplemente se basa en como juegues vos, por eso solo q y no flex, es tan sencillo como entender que si no carreas la partida bajas de liga. lo entendi cuando estuve en oro, no podia entender como es que mi equipo eran tan malo como para no tener chances de ganar y que el otro equipo siempre tenga ventaja sobre las demas lineas y mi linea ademas este neutra o que saque ventaja pero no haga diferencia por que los demas estan por encima de mi.\n  Una vez que entiendes eso hay que pasar a lo siguiente, como gano entonces una partida donde mi equipo fedea y el yo no pueda hacer nada?, simple, aprendiendo a carrear y sacar ventaja de toda situacion, por ejemplo. la top lane va perdiendo 1/5 minuto 13, el jungla lo gankea y mueren ambos contra una fiora 5/1, okey en ese instante le tenes que decir al jungla que te gankee a vos, por que si no entiendo mal siempre la culpa la tiene tu equipo, ya que vas a estar por delante de la bot lane con mas ventaja. bueno en ese momento que tu jungla los empieza a gankear ya sacass mucha mas ventaja vos en tu linea y ademas el jungla vuelve a la partida sacando ventaja de ese gank, lo siguiente seria tirrar la torreta, una vez que cae la torre de bot empiezan las rotaciones. (si a todo esto tu top sigue muriendo y el jungla enemigo lo gankea hasta cansarse, no hay problema tenes  que dar por echo que eso va a pasar y planear una estrategia q pueda contrarestar eso, por ejemplo sacando todos los dragones y robandole la jungla de abajo para que no se desarrolle adecuadamente, porque a la vez que tu top va a estar muriendo y el top rival se siga fedeando, vos vas a estar haciendo lo mismo en otras lineas) una vez empezadas las rotaciones tenes que pensar en donde saca la ventaja, por ejemplo podes pushear bot hasta la segunda tier y rapidamente rotar a mid, gankean al mid, no importa si muere no, la cosa es obligarlo dejar la linea para poder tirar esa torre, si la estrategia fracasa rapidamente vas y gankeas top, con el jungla y con el mid, si el top enemigo se vende por estar fedeado que en oro ocurre la mayoria de las veces, es una torre asegurada, (en el caso de que el jungla enemigo sea malo y no haya echo heraldo van y lo hacen, un objetivo mas que da mucha ventaja) en ese momento la partida ya va bien encaminada. basicamente tenes que tratar de sacar ventaja ante cualquier situación, si sos un buen jugador y mereces subir vas a ganar, si no podes subir y estas estancado es porque mereces estar en esa liga, es asi de simple.  \n  Todo lo que escribí es por experiencia propia, subi de oro 5 a diamante 1 en 3 semanas, y ahora que no puedo salir e incluso desendi a d2, entiendo que no es por mi equipo, la derrota es por mi mismo que no tengo el nivel suficiente para subir a maestro o challenger","replies":[{"poster":"Danimilz","date":"2019-08-07T17:10:54.792+0000","up_votes":1,"down_votes":0,"body":"Bue, si en 6 años no subías y en encima que el juego está más fácil para mantener a los casuales, era que tú nivel era muy malo","replies":[]}]}]}