{"poster":"FelrickOne","date":"2017-03-04T00:59:27.281+0000","title":"Me hackearon mi cuenta, tengan cuidado.","subforum":"Charlas Generales","up_votes":7,"down_votes":3,"body":"Hace un par de d&iacute;as intente entrar a mi cuenta para jugar una partida como cualquier otra, hasta que de pronto, me dice contrase&ntilde;a incorrecta.\r\nLa volv&iacute; a digital numerosas veces, y nada. Fue ah&iacute; cuando me di cuenta de que algo estaba mal.\r\n\r\nSin embargo, me percate que hab&iacute;an entrado a mi correo tras ver en la papelera de reciclaje, quien intento robarme la cuenta no era tan listo como para saber que los mensajes borrados se guardan igual. Hab&iacute;an pedido cambiar la contrase&ntilde;a y algunos datos de la cuenta, incluyendo cuentas de Steam que tenia vinculada a ese correo (que por suerte no tenia juegos).\r\n\r\nIntentaron cambiar los datos personales de mi correo, pero microsoft tiene un nivel de seguridad con el cual no pudo, y no tuvo otra opci&oacute;n que cambiar mi cuenta a otro correo, y as&iacute; fue. Perd&iacute; acceso a mi cuenta.\r\n\r\nAcud&iacute; al soporte (quien me ayud&oacute; y ayuda en estos momentos es **r&oacute;ms**, excelente atenci&oacute;n, +10) y me suspendieron la cuenta hasta que pudiese normalizar mi situaci&oacute;n, y en eso estoy.\r\n\r\nComo **CONSEJO**, les digo que refuercen su informaci&oacute;n de su correo vinculado a su cuenta de lol, dado que es muy sencillo que entren con los datos b&aacute;sicos, jam&aacute;s entr&eacute; a un link desconocido, jam&aacute;s entr&eacute; a una pagina o algo similar, as&iacute; que en cualquier momento les puede ocurrir.\r\n\r\n&iquest;C&oacute;mo puedo solucionar este problema?\r\n\r\n1) Desinfecten su computadora de virus, usen anti-malwares o anti-spybots, nunca se sabe.\r\n2) Si el paso 1 no funciona o les empeora su computadora (como me sucedi&oacute; a mi), solo queda formatear.\r\n3) Pidan que cambien su correo vinculado a la cuenta, y una contrase&ntilde;a temporal hasta que puedan retomar, sino, suspendan su cuenta para protegerla.\r\n4) Refuercen y aseguren que tengan acceso a todo tipo de informaci&oacute;n y cuenta.\r\n\r\nSaludos, espero recuperar mi cuenta, suerte invocadores! {{champion:32}}","replies":[{"poster":"Rroncon","date":"2017-03-04T02:01:16.872+0000","up_votes":2,"down_votes":1,"body":"RP gratis ? xd","replies":[]},{"poster":"Twisted Payaso ","date":"2017-03-04T13:56:10.890+0000","up_votes":1,"down_votes":0,"body":"Keylogger se llama lo que te hicieron. te rastrearon el teclado, algún parche de algún programa, algún crack.","replies":[]},{"poster":"Rito JeZylZ","date":"2017-03-04T10:22:07.495+0000","up_votes":1,"down_votes":0,"body":"Vaya suerte :/","replies":[]},{"poster":"Azir se carrea","date":"2017-03-04T04:10:47.779+0000","up_votes":1,"down_votes":0,"body":"la peor comunidad por mucho","replies":[]},{"poster":"Syet","date":"2017-03-04T03:30:26.955+0000","up_votes":1,"down_votes":0,"body":"Igual para que haya sucedido eso,  en alguna página farsante te conectaste sin darte cuenta. algunas roban información sin que lo sepas ( con los cookies)  por eso también recomiendo usar ccleanear para limpiar todo cache o aplicaciones alojadas en el explorador que uses, Malwarebytes también es el mejor programa que existe actualmente , con la versión gratuita basta, o ponerle un crack a la versión pro, aunque con el crack igual te arriesgas.  también puedes limpiar todo cookie y cache de croome en la pestaña configuración avanzada\n\nLo otro es tener window 10 pro actualizado. window defender es bueno, pero no tanto cómo AVG ( ojo solo el antivirus)\n\nque sirva de consejo para todas las personas, un pc es cómo tener un auto.","replies":[]},{"poster":"Mazer Rakham","date":"2017-03-04T02:42:50.290+0000","up_votes":1,"down_votes":0,"body":"Si la vinculas a una cuenta de Gmail puedes poner la opción para que te avise cada vez que alguien entra desde algún dispositivo desconocido a tu celular","replies":[]},{"poster":"Lautinvocador","date":"2017-03-04T02:35:52.349+0000","up_votes":1,"down_votes":0,"body":"Ojala la recuperes, tenes todo mi apoyo, Suerte !!","replies":[]}]}