{"poster":"Kuponya","date":"2018-07-18T23:28:00.078+0000","title":"What do people even consider counterplay nowadays?","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Being able to dodge? Able to build around it? Able to play around it?\r\n\r\nIn a factual sense, counterplay means that there is an action you can take based on the game features that allows you oppose the move. And since there is no ability that automatically destroys the opposing Nexus, everything in League has some form of counterplay, but players mostly refuse to take any steps that threaten their fantasy.","replies":[{"poster":"Anatera","date":"2018-07-18T23:34:58.555+0000","up_votes":6,"down_votes":1,"body":"At the moment, the only counterplay is killing the enemy faster than they kill you. \n\nAt least that's what idiots consider to be good counterplay.","replies":[]},{"poster":"Kelg","date":"2018-07-18T23:50:53.292+0000","up_votes":3,"down_votes":3,"body":"Hypermobile champs imo have no counterplay because unless you too are hypermobile, you have no way of avoiding their engage and no way of catching them if you happen to get a leg up on them. These champs generally are uninteractive and poke at you and/or wait until they can all in and finish you off (See: {{champion:245}} {{champion:164}} {{champion:105}} {{champion:39}}{{champion:238}}  {{champion:114}} etc.)   If you are an immobile champ vs a mobile champ you can't really make plays on them unless you have a form of hard cc or burn flash(which they obviously have too), if you're immobile with no hard CC, well, you're SoL because you have to sit there and wait for them to fuck up. \n\nI'm pretty sure this is the reason why people always complain when a new super mobile champ is released, because by doing this, they are actively snuffing out a lot of the old and outdated champions who have no way of contesting these new champs. It's almost like riot doesn't even play their own game, or maybe they just don't care at this point and just want LoL to be fun to watch.","replies":[{"poster":"Anatera","date":"2018-07-18T23:52:44.145+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=0G11c8Wq,comment-id=0004,timestamp=2018-07-18T23:50:53.292+0000)\n>\n> Hypermobile champs imo have no counterplay because unless you too are hypermobile, you have no way of avoiding their engage and no way of catching them if you happen to get a leg up on them. These champs generally are uninteractive and poke at you until they can all in and finish you off (See: {{champion:245}} {{champion:164}} {{champion:105}} {{champion:39}}{{champion:238}}  {{champion:114}} etc.)   If you are an immobile champ vs a mobile champ you can&#x27;t really make plays on them unless you have a form of hard cc or burn flash(which they obviously have too), if you&#x27;re immobile with no hard CC, well, you&#x27;re SoL because you have to sit there and wait for them to fuck up. \n> \n> I&#x27;m pretty sure this is the reason why people always complain when a new super mobile champ is released, because by doing this, they are actively snuffing out a lot of the old and outdated champions who have no way of contesting these new champs.\n\nI'm sure someone will say flash is supposed to be the counterplay against mobile champs, conveniently forgetting that the mobile champs have CDs much lower than flash's CD.","replies":[]},{"poster":"Kuponya","date":"2018-07-19T05:36:39.818+0000","up_votes":2,"down_votes":0,"body":"Not defending those champions, but you can play around their mobility via flanking, brush, etc.","replies":[]}]},{"poster":"Veraska","date":"2018-07-18T23:49:57.195+0000","up_votes":2,"down_votes":0,"body":"Strategic counterplay is counterplay thats indirect, champion picks, itemization, map movements to avoid the fed enemy, all strategic\n\nTactical counterplay is champion specific interactions, dodging ahri charm or kiting Darius for example","replies":[]},{"poster":"Tahminatrix ","date":"2018-07-19T00:28:10.869+0000","up_votes":2,"down_votes":1,"body":"Pressing E on someone as nasus is counterplay.","replies":[{"poster":"AnAggravatedPimp","date":"2018-07-19T00:31:41.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Super Cow Swag,realm=NA,application-id=3ErqAdtq,discussion-id=0G11c8Wq,comment-id=0005,timestamp=2018-07-19T00:28:10.869+0000)\n>\n> Pressing E on someone as nasus is counterplay.\n\nI'm already tilted. Just read that and I'm done with ranked for a month","replies":[]}]},{"poster":"Fízz v2","date":"2018-07-18T23:47:35.208+0000","up_votes":1,"down_votes":0,"body":"I dont consider building items counterplay, to me it means being able to dodge or play around stuff (so Jhin auto attacks have counterplay because of reload, and pre 8.14 Fizz W had counterplay because it had a delay to play around)","replies":[]},{"poster":"Lets have shrex","date":"2018-07-18T23:28:58.458+0000","up_votes":1,"down_votes":0,"body":"That's the same argument as saying \"what's the point of living if you end up dying\"","replies":[]}]}