{"poster":"xKayfandar","date":"2017-02-09T21:54:37.466+0000","title":"Hola, soy xKayfandar","subforum":"Charlas Generales","up_votes":1,"down_votes":9,"body":"Hola comunidad &iquest;Como est&aacute;n? Bueno mi queja es la siguiente, me han dado leaverbuster porque en varias ocasiones se me ha ca&iacute;do el internet en varias partidas, por culpa de qu&eacute; no hay muy buena se&ntilde;al donde yo vivo (Ocupo fibertel en este momento), resulta qu&eacute; tuve una ca&iacute;da de internet y me dieron una cola de baja prioridad de 20 minutos, la verdad me gustar&iacute;a qu&eacute; pongan una verificaci&oacute;n para ver si realmente est&aacute; afk o se le cay&oacute; el internet, jugu&eacute; bien una partida, iba 9/5 se me cay&oacute; el internet y me dieron leaver buster, &iquest;Alguna manera de qu&eacute; puedan verificar si se les cae o no? un abrazo!\n\nEDIT: Cuando se me vuelva a caer traigo pruebas, hice el reclamo pero todavía no vinieron!!","replies":[{"poster":"WhiteMax","date":"2017-02-09T21:59:53.085+0000","up_votes":3,"down_votes":0,"body":"No, no existe, si te fuiste afk te fuiste afk y punto, es un sistema automatizado y no acepta \"excusas\" del \"porque te vas Afk\". \n\nAdemas, el leaver booster solo se activa si te vas Afk en \"mas de una partida\".","replies":[{"poster":"xKayfandar","date":"2017-02-09T22:03:10.717+0000","up_votes":1,"down_votes":0,"body":"O sea, no vengo a pedir qué me lo quiten, solo vengo a pedir si pudiesen poner algo qué lo verifique, la señal de donde vivo no llega muy bien entonces el internet se va cortando muchas veces a lo largo de una hora, y sí se me cayó en más de una partida, pero en todas jugué bien y aún así en las qué gané cuando volví porque se me cayó el inter me lo dieron igual :/","replies":[{"poster":"WhiteMax","date":"2017-02-09T22:06:58.581+0000","up_votes":2,"down_votes":0,"body":"En la esquina superior derecha de la pantalla la palabra \"MS\" y un numero, si el numero es 100 o +, significa que estas teniendo lag, si supera los 200, probablemente se te vaya la conexion.\n\nSi tu hablas de que te manden una notificacion de que estas apunto de activar tu leaver booster, pues no existe ni existira, por que? porque se aprovecharia de eso para irse Afk en partidas que no tengan ganas de jugar y cuando les salta el cartel se esperen un tiempo para volver a jugar Afk.\n\nPD: No importa si \"jugaste bien\", te fuiste Afk, solo eso importa.","replies":[{"poster":"xKayfandar","date":"2017-02-09T22:09:38.150+0000","up_votes":1,"down_votes":1,"body":"No pido qué te notifiquen, pido qué no den el LeaverBuster cuando se caigan los internets, ahora les doy una prueba de qué es lo qué pasa","replies":[{"poster":"WhiteMax","date":"2017-02-09T22:13:18.378+0000","up_votes":3,"down_votes":0,"body":"Pero haber vos entendes que: Si te vas Afk constantemente en partidas te salta la sancion de Leaver booster y PUNTO FINAL.\n\nLas \"excusas\" NO importan, si importaran entonces la gente se aprovecharia y diria excusas falsas cuando en realidad se van Afk porque apagaron el Ruter o sus Mamas les dijeron que vayan a la Tienda a vayase a saber que y ellos se hacen las victimas escribiendo cosas que a ciencia cierta no se sabe si son verdad o mentira (no es lo mismo ver lo que escribe alguien o verlo de frente y su forma de hablar), el punto es que no hay excusas y no importa la razon de porque te fuiste Afk ya que tuviste \"oportunidades\" antes de que te saltara la sancion.","replies":[{"poster":"xKayfandar","date":"2017-02-09T22:16:17.936+0000","up_votes":1,"down_votes":1,"body":"Ya di pruebas, eso de desconectar el router te aparecería una X y me salía un signo de peligro a mi.","replies":[{"poster":"WhiteMax","date":"2017-02-09T22:21:54.219+0000","up_votes":2,"down_votes":0,"body":"No entendes.{{sticker:zombie-brand-clap}}","replies":[{"poster":"xKayfandar","date":"2017-02-09T22:24:26.289+0000","up_votes":1,"down_votes":1,"body":"Perdón, soy soberbio, pero sí tenes razón. Después de todo si estuve AFK y los perjudique, así qué sí, tenes razón","replies":[]}]}]}]}]}]}]}]},{"poster":"Excorpion","date":"2017-02-09T22:08:12.375+0000","up_votes":2,"down_votes":0,"body":"Si se cae el internet uno no debería jugar hasta solucionar el problema.\nal seguir jugando uno se arriesga a ser castigado","replies":[]},{"poster":"NÿT Âkałi","date":"2017-02-09T22:48:23.677+0000","up_votes":1,"down_votes":0,"body":"lo que pasa es que si vos te vas afk intencionalmente o no , el resultado es el mismo , vos dejas a tu team con uno menos , por lo cual quedan en desventaja , y si pasa mas de una vez al leave buster le da igual la razón, siempre será asi y esta bien. si tenes tanto problema con el internet tanto por tu bien como por el de tu team no entres a jugar hasta q lo arreglen , solo arruinas la experiencia de los demas y encima vas a comerte mas castigos. saludos:D","replies":[]},{"poster":"Yrox the Third","date":"2017-02-09T21:56:04.532+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, a Riot le da exactamente lo mismo de la razon de porque estabas AFK (al menos que ellos sean los responsables de esto, pero la mayoria de las ocasiones, se dan cuenta y dan avisos), lo que les importa es que estuviste afk y en ese tiempo afectaste a tus compañeros negativamente, por eso te afectaron.","replies":[{"poster":"xKayfandar","date":"2017-02-09T21:57:04.129+0000","up_votes":1,"down_votes":1,"body":"El tema es qué no fue por una mala intención, realmente me dio mucha bronca qué se me haya caído el internet tantas veces, me vivo quejando por fibertel, pido mil disculpas a las personas de las partidas.","replies":[{"poster":"Rosv Stuff","date":"2017-02-09T22:04:05.428+0000","up_votes":1,"down_votes":0,"body":"Te va a decir que si tenes problemas con tu internet vayas a jugar con bots hasta que se arregle tu problema. Obviamente que riot te lo dice en otras palabras.","replies":[]}]}]},{"poster":"xKayfandar","date":"2017-02-09T22:13:02.839+0000","up_votes":1,"down_votes":1,"body":"http://imgur.com/a/HbI0t Aquí una","replies":[]}]}