{"poster":"xKayfandar","date":"2019-03-05T14:55:10.137+0000","title":"Programas de skins ¿Legales?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hace un tiempo 2-3 años, me banearon una cuenta por usar el programa LolSkin, el cual te cambia las skins, sigo viendo que hay gente que admite usarlo e incluso youtubers que lo admiten y no les pasa nada aún, ¿es legal o ilegal?","replies":[{"poster":"DARKBOW923","date":"2019-03-05T15:18:09.374+0000","up_votes":3,"down_votes":0,"body":"Hola.\n\nProgramas como lolskin mklol etc NO son legales.\n\nSin embargo programas como wooxy los cuales se usan para cambiar el mapa, el HUD, skins CUSTOM (skins que NO existen en el juego) SÍ son legales, pero mientras no se use ni UNA partícula de alguna skin real y además están en la categoría de 'usa bajo tu propio riesgo' puedes encontrar más información en la página de soporte del lol\n\nSaludos!","replies":[]},{"poster":"L9 Skasha","date":"2019-11-16T23:44:09.527+0000","up_votes":1,"down_votes":0,"body":"amigo pasa que ellos no cambian todavia su terminos y servicios, pero lo que quieren dan a entender es, NO uses skins existentes que fueron creadas por riot para usarlas ilegalmente, tipo si usas lux y tenes el programa, no te pongas la definitiva porque fue diseñada por riot y se puede comprar, ponete kda lux ya que esta hecha por los fans y no existe realmente en el juego","replies":[]},{"poster":"Aephis","date":"2019-03-05T16:06:57.905+0000","up_votes":1,"down_votes":0,"body":"Dejarias que alguien use gratis la unica fuente de ingresos que tenes en el juego?","replies":[]},{"poster":"PUPI URU","date":"2019-03-05T15:59:50.262+0000","up_votes":1,"down_votes":0,"body":"NO pasa nada un amigo usa Lolpro desde hace 2 años y pico y nunca le paso nada a la cuenta {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"The Old Black","date":"2019-03-05T15:48:21.338+0000","up_votes":1,"down_votes":0,"body":"Es simple, si usas un skin de riot sin tenerla es ilegal porque a ellos les cuesta plata. Si te pones urgot star guardian eso ya es bajo tu propio riesgo","replies":[]},{"poster":"YuGGi ","date":"2019-03-05T15:09:19.422+0000","up_votes":1,"down_votes":0,"body":"no es ilegal por lo que tengo entendido ya que no afecta el juego ademas solo vos ves la skin","replies":[]},{"poster":"AMD Radeon RDNA","date":"2019-03-05T15:03:02.373+0000","up_votes":1,"down_votes":2,"body":"Totalmente ilegal. No te arriesgues a perder tu cuenta","replies":[{"poster":"xKayfandar","date":"2019-03-05T15:04:42.183+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=0_3vDfkfCQA\nVi este video donde explica que no es ilegal, pero sigo sin entender por qué dicen que es ilegal y tanta gente lo usa :/","replies":[]}]}]}