{"poster":"Warren","date":"2015-08-02T21:27:38.984+0000","title":"Gangplank...un pirata?","subforum":"Charlas Generales","up_votes":11,"down_votes":0,"body":"Veamos, Gangplank ya no tiene tripulaci&oacute;n, ni barco, que es precisamente lo que lo hace seguir siendo un pirata?\r\n\r\na mi parecer el doble rework que han hecho no me convenci&oacute; nada :/ parece mas viejo y esta mas gordo, y ya no tiene tripulacion ni barco, no es el pirata que tanto me gustaba cuando comenze a jugar, es un viejo triste que lo perdi&oacute; todo.\r\n\r\nPD: de donde sale la ulti de gp si ya no tiene barco!?","replies":[{"poster":"Neo Gaussrik","date":"2015-08-03T14:23:04.307+0000","up_votes":4,"down_votes":0,"body":"Es un hombre que lo ha perdido todo!\n\nSu reputacion, su autoridad, sus riquezas, incluso su brazo (lo cual lo dificulta bastante, ya que su estilo de dos armas requiere ambos brazos!)\n\nQue hara GP ahora? Cual es su plan? Si Aguasturbias cae bajo el control de Miss Fortune, y sus seguidores se estan matando en las calles...\n\nMwahahahaha. :3\n\nVeamos que pasa!","replies":[{"poster":"Furi Shurtugal ","date":"2015-08-03T19:54:29.970+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=X24fVw2z,comment-id=0009,timestamp=2015-08-03T14:23:04.307+0000)\n>\n> Es un hombre que lo ha perdido todo!\n> \n> Su reputacion, su autoridad, sus riquezas, incluso su brazo (lo cual lo dificulta bastante, ya que su estilo de dos armas requiere ambos brazos!)\n> \n> Que hara GP ahora? Cual es su plan? Si Aguasturbias cae bajo el control de Miss Fortune, y sus seguidores se estan matando en las calles...\n> \n> Mwahahahaha. :3\n> \n> Veamos que pasa!\n\nSeñor Gaussrik, usted es diabolico","replies":[]},{"poster":"Bruce Lee","date":"2015-08-03T17:15:22.722+0000","up_votes":1,"down_votes":0,"body":"Su reputación te aseguro que sigue intacta","replies":[]},{"poster":"Warren","date":"2015-08-03T16:26:23.340+0000","up_votes":1,"down_votes":0,"body":"{{champion:223}} no le dara una manita? (o un lenguetazo, en su caso)\n\nNo se, supongo que me cayo mal esto por que a mi me encantan los piratas, y que conviertan a unos de los pocos piratas que hay en el juego en esto...me decepciona bastante xD. De hecho, agradezco muchisimo que den la skin, por que si no creo que ni lo jugaría.\n\nAunque debo admitir que me gusta todo el {{champion:432}}  que han hecho en un momento, espero ver mas eventos de esta clase en el futuro.","replies":[]}]},{"poster":"Infernus Nisman","date":"2015-08-02T22:04:26.303+0000","up_votes":4,"down_votes":1,"body":"Obviamente fue por el evento nomas, su tripulación y su barco siguen intactos.. No tiene nada que ver dentro del juego, es lo mismo que decir que Corki no puedo Montar a Urf ya que lo mato Warwick","replies":[{"poster":"DarkSoul98","date":"2015-08-03T03:40:58.573+0000","up_votes":1,"down_votes":0,"body":"No fue \"por el evento nomas\" porque fijate que el personaje cambio xD y su lore tambien","replies":[]}]},{"poster":"Pwao","date":"2015-08-02T23:45:45.775+0000","up_votes":2,"down_votes":0,"body":"GP sigue siendo un pirata... en su corazón (El pirata que todos llevamos dentro).","replies":[]},{"poster":"Supernova Rigel","date":"2015-08-03T21:18:22.049+0000","up_votes":1,"down_votes":0,"body":"En todas las películas, series, libros siempre hay un par de lacayos que siguen al malo a pesar de su caída, ejemplo: Pettigrew o Bellatrix Lestrange en Harry Potter. Pero de todos modos estoy de acuerdo contigo xD No me gustó ninguno de los dos nuevos Gangplank xD","replies":[]},{"poster":"Blooder X","date":"2015-08-03T14:37:05.098+0000","up_votes":1,"down_votes":0,"body":"Si pierde un ojo y le ponen un parche, se vuelve Big Boss.","replies":[]},{"poster":"Gakiod","date":"2015-08-03T00:13:54.770+0000","up_votes":1,"down_votes":0,"body":"A mi ya no me parece un pirata, me parece un gragas-cyborg-zombi-jesucristosuperstar que vive en una tierra cercana al mar. \n\nPor suerte siempre esta la \"skin clasica\" (espero que la skin clasica que regalaran conserve las \"viejas\" frases)","replies":[]},{"poster":"Bruce Lee","date":"2015-08-03T00:03:40.068+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=8wtLnklM9CI","replies":[]},{"poster":"sonizskk","date":"2015-08-02T23:52:37.345+0000","up_votes":1,"down_votes":0,"body":"gp un pirata piratero","replies":[]},{"poster":"Hexplosivo","date":"2015-08-02T22:32:30.468+0000","up_votes":1,"down_votes":0,"body":"Gangplank se está recuperando de la operación en estos momentos, ténganle paciencia.","replies":[]},{"poster":"ar9ento","date":"2015-08-03T01:04:02.558+0000","up_votes":1,"down_votes":1,"body":"mas les vale q saquen una skin legendaria porque sino es un robo esto, para q cortarle un brazo a un champion ? por un skin clasic? ademas de q todos los skin son horribles? el de juguete casi no tiene movimientos de juguete. El special forces no tiene un back distinto, quedo mejor el del clasico que tiene una animacion mas larga..... en fin.... me conformo con los barriles pero esteticamente dejan mucho que desear.","replies":[]},{"poster":"MariniZro","date":"2015-08-03T01:03:45.079+0000","up_votes":1,"down_votes":1,"body":"Bueno querido invocador, llevo 14 años en el mundo de los videojuegos, y si vas a buscarle la logica a todo, te aviso que CASI ningun videojuego la tiene...\nEn el caso del Lol, GangPlank no va a tener otra ulti, y va a seguir siendo un pirata por mas que no tenga tripulacion ni barco en el LORE... \nO acaso barbanegra deja de ser pirata por estar muerto? O un medico deja de ser medico cuando no tiene la bata blanca? :O\nMira, en este juego hay muchas cosas ilogicas:\n-Nami cura con agua (WTF)\n-Janna cura con Viento (WTF)\n-Ashe en su definitiva, lanza una flecha mas grande que lo que puede abarcar su arco\nNo se me ocurren muchas mas, pero creo que quedo claro..\n\nY esto que escribi no es con intencion de Ofenderte amigo, sino de Informarte :) Y contarte que los videojuegos, son Mundos Irreales, o lo mas posible alejado a la Realidad, donde pueden pasar cosas que en la realidad no ocurren \n\nSaludos Invocador :D","replies":[]},{"poster":"Excorpion","date":"2015-08-02T21:45:09.870+0000","up_votes":1,"down_votes":1,"body":"Gangplank aun aparece muerto segun el launcher - aun no se puede usar - , solo lo han recompuesto con un brazo robotico y no ah hecho nada más que eso, nadie sabe que va a pasar, ni con el, con Miss Fortune, con Aguasturbias, Con Graves y su pistola, Con TF y Graves y si Gangplank a de retomar aguasturbias como la figura de poderío que es.","replies":[]}]}