{"poster":"Pialsato","date":"2018-02-20T16:35:13.651+0000","title":"(SUGERENCIA) Sobre los reportes y baneos (POST SERIO)","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":5,"body":"Antes que nada pido disculpas por el titulo, creo que no es lo mas apropiado pero no pude pensar en otro titulo, srry. \r\n\r\nREPORTES: Si bien es cierto que los reportes son una de las pocas maneras (Para no decir la &uacute;nica) para poder reportar a la gente que sea toxica, troll, flamer o que haya hecho algo que nos incomode y arruine la experiencia dentro del  juego, hay disgusto sobre esto por que la gente piensa que no sirve y esto pasa por varios motivos pero a mi parecer el mas importante es el siguiente:\r\n\r\n-La falta de llegada del cartel de que el jugador fue baneado, el cual llega a la ultima persona que lo reporto, por ende creen que los reportes no sirven, y por ese motivo dejan de reportar, y a la larga al creer que los reportes no sirven se convierten tambien en toxicos creando una comunidad toxica la cual si no se soluciona pronto se vera muy afectada.\r\n\r\nEntonces a que quiero llegar con esto?\r\n\r\nNo se si pueda ser posible, pero creo que la mejor manera de solucionar esto es que en los foros se cree una secci&oacute;n en la que diariamente o semanalmente o mensualmente,  se publique a los jugadores que han sido baneados durante ese lapso de tiempo para que a la gente que no le apareci&oacute; el cartel, se den cuenta que su reporte si contribuyo en el baneo del jugador que arruino su experiencia dentro del juego. Yo creo que de esta manera la gente se dar&aacute; cuenta de que los reportes sirven y que asi se disminuya la toxicidad de la comunidad la cual si es mucha y se debe admitir.\r\n\r\nYo voy a ser sincero, as&iacute; que comenzare diciendo mi edad, yo tengo 14 a&ntilde;os y cumplo 15 en mayo, soy uno de esos ``Ni&ntilde;os ratas&acute;&acute; que ustedes creen que  solo por ser joven y seguir yendo a la escuela somos los responsables de la toxicidad , lo cual es todo lo contrario, no todos somos iguales, no creo que a los j&oacute;venes nos digan que seamos ``Ni&ntilde;os ratas&acute;&acute; y que por nuestra culpa el juego este as&iacute;. El problema es de todos, la toxicidad es problema de la comunidad en el cual todos somos responsables desde el mas callado hasta el mas toxico, es nuestra comunidad y nosotros debemos mejorarla .\r\n\r\nPido disculpas si el post se alargo demasiado, por las faltas ortogr&aacute;ficas y por la posible mala redacci&oacute;n del texto, me gustar&iacute;a saber que les pareci&oacute; mi idea, espero que este post no se quede en el mont&oacute;n por que de verdad creo que sea una buena idea para disminuir la toxicidad, para no alargarlo mas agradezco a todos lo que leyeron y les pido que dejen su opini&oacute;n, acepto criticas a favor o en contra (Criticas constructivas) eso es todo.","replies":[{"poster":"Bear TheWhite","date":"2018-02-20T17:00:55.479+0000","up_votes":3,"down_votes":0,"body":"El baneo y el reporte funcionan excelente, que no lo acepten porque quieren sancionar a quien y como se les canta es otra cosa.\nBuen post pero totalmente descabellado. En vez de arreglar lo que anda, aprendan a callarse la boca y aceptar que si la cagan la pagan.","replies":[{"poster":"Pialsato","date":"2018-02-20T17:19:12.252+0000","up_votes":1,"down_votes":1,"body":"Funciona eso lo sabemos, pero no todos, por eso mi sugerencia, para que la gente que piensa que de nada sirve reportar lo considere alver que la gente de verdad es baneada","replies":[{"poster":"Bear TheWhite","date":"2018-02-20T17:29:35.667+0000","up_votes":1,"down_votes":0,"body":"Ridiculo. La gente piensa eso. Pero no es asi. Como voy a arreglar algo que no esta roto porque alguien me diga que si. Sobre todo si ya se que funciona","replies":[{"poster":"Pialsato","date":"2018-02-20T17:49:13.130+0000","up_votes":1,"down_votes":0,"body":"Respeto tu opinion pero por que me hablas con esa cuenta, si esta es tu cuenta verdadera no creo que sepas mucho sobre los reportes despues de todo eres lv7 eso se consigue en un dia, no tienes experiencia, y si no es tu cuenta ya tendras tus motivos, pero a lo que voy no es arreglar algo, es mas a darse a conoce la existencia de los reportes los cuales hay mucha gente que cree que no funciona lo cual es lo contrario.\nRespeto tu opinion y me gustaria que respetes tambien la mia, yo solo quiero que la comunidad mejore","replies":[]}]}]},{"poster":"Lord Monmon","date":"2018-02-20T17:14:16.804+0000","up_votes":1,"down_votes":2,"body":"Si a vos te parece que funciona excelente, estas entrando al foro y no estas jugando, dale, no mientas.. vos no jugas.","replies":[]}]},{"poster":"Paaizer","date":"2018-02-20T16:49:51.357+0000","up_votes":1,"down_votes":2,"body":"Sigo insistiendo, creo que deberia volver el tribunal pero con gente copada siendo quien mira los casos.\nNo se por que lo sacaron pero suena que algunos tiraban negativo sin leer el caso.","replies":[{"poster":"Lucio22","date":"2018-02-20T16:54:38.665+0000","up_votes":1,"down_votes":0,"body":"Lo sacaron porque los mismos jugadores decidían si se aplicaba o no sanción y, mientras habia algunos que nos lo tomábamos en serio, otros simplemente le daban a uno de los botón sin leer ni pensar (además de que te podía tocar un report hecho por o contra vos, lo que no dejaba un juicio muy justo que digamos...)","replies":[{"poster":"Paaizer","date":"2018-02-20T17:02:43.760+0000","up_votes":1,"down_votes":1,"body":"si, era de esperarse\nuna lastima porque asi realmente sabias que una penalizacion era impartida.\nera mortal cuando reportaban a algun latino en NA por no hablar ingles.\nTACO TACO","replies":[]}]},{"poster":"Pialsato","date":"2018-02-20T17:17:06.788+0000","up_votes":1,"down_votes":1,"body":"Seria bueno el tribunal pero mucha gente no se lo tomaba en serio, habia falta de compromiso por lo que yo sepa","replies":[]}]},{"poster":"Linyera Violento","date":"2018-02-20T16:53:21.254+0000","up_votes":1,"down_votes":1,"body":"muy buen post me gusto bastante a pesar de que fue algo largo pero la idea esta genial +1 :v","replies":[{"poster":"Pialsato","date":"2018-02-20T17:16:20.662+0000","up_votes":1,"down_votes":1,"body":"Gracias por apoyar la idea","replies":[]}]}]}