{"poster":"Zorro70","date":"2015-11-07T00:21:14.996+0000","title":"2 Premades Suchen Rankedteam","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Ich Zorro70 (Silber IIII) und eine Freundin (Alariiiix Silber III) suchen ein Rankedteam mit netten und guten Silber-Platin Spielern. \nIch bin main Mid und Jungle, wobei ich auch In der Top Lane spielen kann. Alariiix ist main ADC aber sie kann im notfall auch Jungeln(:\n- Bin 14 und Alariiix 16\n- 100% No Flame\n- Unterst&uuml;tzen das Team\n- Geben nie auf (:\n- Eigentlich jeden Tag Online (von 14-22 Uhr)\n\nWenn ihr Interesse habt addet mich oder schreibt es  hier in der &quot;Disskusion&quot;","replies":[{"poster":"OMG gaoox","date":"2015-11-08T09:28:17.971+0000","up_votes":1,"down_votes":1,"body":"Hey,\n\nIch (M 14) und mein Bruder (17) haben wegen den Battlegrounds vor kurzem ein Team gegründet.\nDa ich noch keine \"Disskusion\" erstellt habe, haben wir noch keine Mitglieder, aber ihr zwei passt sehr gut!\nIch persönlich gehe auf die Toplane während mein Bruder auf der Midalne rumlungert, also kannst du Zorro70, in deinen Jungle verschwinden und alariix kann auf die Botlane gehen. ^^\nAusserdem bin ich Gold V und mein Bruder Gold\n\nWenn ihr beiden Lust habt dann könnt ihr mir hier schreiben und wenn nicht, dann viel spass bei eurem anderen Team. :)","replies":[{"poster":"Zorro70","date":"2015-11-08T10:20:31.718+0000","up_votes":1,"down_votes":1,"body":"Hört sich gut an (:\nWir sind leider nur silber, aber meiner Meinung nach sind wir besser als Silber :3\nIch würde dich dann adden wenn ich Online komme wenn das dein InGameName is im Forum(:","replies":[{"poster":"OMG gaoox","date":"2015-11-08T10:36:40.604+0000","up_votes":1,"down_votes":1,"body":"Ich habe dich geaddet. ^^\nIch wollte aber noch sagen, dass ich TS3 haben solltet da wir einen eigenen TS-Server besitzen :).\nUnd wenn ihr noch einen Supp kennt der ca Silber-Gold ist dann könnt ihr ihn ja mal fragen ob er mitmachen will! :)","replies":[]}]}]}]}