{"poster":"gyyyr","date":"2015-11-17T14:58:11.088+0000","title":"mehr trolls seit 5.22","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":3,"body":"Seit dem 5.22 patch hatte ich in jedem spiel mindestens 1 troll/afk/flamer in entweder meinem team oder im gegnerischen Team. Vor diesem patch war das nur jedes 4. game so. Was ist passiert? Wieso spiele ich jetzt wieder mit solchen leuten? Was wurde in dem bereich ver&auml;ndert?","replies":[{"poster":"Avaloxus","date":"2015-11-17T16:35:53.173+0000","up_votes":1,"down_votes":0,"body":"Flamer kommen genaus häufig vor wie vor dem Patch. Auch wenn ich erst ein Jahr dabei bin. AFKler muss ich sagen sind derzeit echt wenige geworden, wenn dann waren es meist disconnects. Und Trolls na ja ein Einziger bis jetzt. Ich vermute Du hattest einfach nur ungewöhnlich viel Pech.\nÜbrigens neben dem Muten hilft es diese Spieler direkt im Anschluss des Spiels zu blockieren. ich weiss nicht ob das Einfluss auf das Matchmarkingsystem hat, aber ich bin nie wieder mit einem blockiertem Spieler in einem Team gewesen und meine Blockedlist hat meine FL locker überholt. Merkwürdigerweise nicht ein Germangamer unter den blockedflamer. Wohl auch nur Glück. ;-)","replies":[{"poster":"Spihscp","date":"2016-11-11T14:13:43.373+0000","up_votes":2,"down_votes":0,"body":"also das blocken hilft gar nichts, mach ich auch, und in einem spiel war der gleiche gleich wieder da mit dem ich zuvor gespielt habe, seitdem lass ich das mit dem blocken","replies":[]},{"poster":"Waldschrat86","date":"2015-11-17T17:48:14.722+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Avaloxus,realm=EUW,application-id=KYnfKGf0,discussion-id=lFHLgjJp,comment-id=0006,timestamp=2015-11-17T16:35:53.173+0000)\n>\n> Flamer kommen genaus häufig vor wie vor dem Patch. Auch wenn ich erst ein Jahr dabei bin. AFKler muss ich sagen sind derzeit echt wenige geworden, wenn dann waren es meist disconnects. Und Trolls na ja ein Einziger bis jetzt. Ich vermute Du hattest einfach nur ungewöhnlich viel Pech.\n> Übrigens neben dem Muten hilft es diese Spieler direkt im Anschluss des Spiels zu blockieren. ich weiss nicht ob das Einfluss auf das Matchmarkingsystem hat, aber ich bin nie wieder mit einem blockiertem Spieler in einem Team gewesen und meine Blockedlist hat meine FL locker überholt. Merkwürdigerweise nicht ein Germangamer unter den blockedflamer. Wohl auch nur Glück. ;-)\n\nNe das beeinflusst das Matchmaking nicht, aber es spart das muten falls man nochmal mit dem Spieler in ein Spiel kommt.\nMitte-Ende der Saison hab ich fast nur normal Draft gespielt, da ich Mirrormatchups hasse, meine miesesten Rollen verbessern und ohne Leistungsdruck spielen wollte. Dort sind mir dann ein paar mal welche, die auf Ignore waren wieder begegnet. Gemerkt hab ich das allerdings fast immer erst nach dem Spiel oder wenn im Chat ein Monolog auftauchte, der nur als Dialog Sinn gemacht hat. :)","replies":[]}]},{"poster":"Believing","date":"2015-11-17T15:12:06.084+0000","up_votes":1,"down_votes":0,"body":"Nichts :D Es ist halt einfach so das du Bronze bist und es in der Elo Spieler gibt die aus Spaß spielen oder besser gesagt das Spiel nicht ernst nehmen, d.h. wenn zB was dazwischen kommt, gehen sie afk ohne das es sie stört. Und Flamer in der Elo kann man nicht vermeiden, ist halt einfach standard ^^ Ignorier sie in dem du sie mutest, glaub mir das wird helfen. Weiterhin viel Spaß in deinen Rankeds und gl\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"IcryWhenIpoop","date":"2015-11-18T23:22:58.030+0000","up_votes":2,"down_votes":0,"body":"Das hat mit der Elo n Scheiss zu tun. Ich bin atm Gold 1 und ich hab ständig Afkler, Trolls und Flamer.   Ich war mit dem Char aber auch schon Silber 5 und habe mich von da nach oben gespielt. Es ist überall dasselbe. Deine besten Freunde in diesem Spiel sind der Mute und der Reportbutton. Mach das beste draus.","replies":[{"poster":"Believing","date":"2015-11-18T23:37:19.198+0000","up_votes":1,"down_votes":0,"body":"Hmm stimmt. Ich persönlich finde eh alles unter D5 nicht wirklich cool von dem Verhalten her, klar es gibt Ausnahmen, die sind aber viel zu selten. Spiele auch aktuell keine SoloQ, bin momentan D2, würde aber sagen in Dia wird eher getilted als geflamed etc.","replies":[]}]}]},{"poster":"Veezey","date":"2015-11-17T16:13:03.947+0000","up_votes":1,"down_votes":0,"body":"Ich hatte seit dem Patch keinen einzigen Troll oder Flamer. Hmm","replies":[]},{"poster":"Wolkenfuß","date":"2015-11-17T15:54:38.784+0000","up_votes":1,"down_votes":0,"body":":D jedes spiel in dem ein Random dabei ist habe ich 2 adc's","replies":[]},{"poster":"I Jungle GG","date":"2015-11-17T15:19:13.791+0000","up_votes":1,"down_votes":0,"body":"Leider gibt es echt mehr Troller sowie afk Spieler {{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"LCG mozuki","date":"2015-11-17T15:12:40.073+0000","up_votes":1,"down_votes":0,"body":"ich merke mal vorsichtig an es ist preseason da meinen die meisten haligali zu machen :D","replies":[]},{"poster":"MATRIX LORD ZIP","date":"2015-11-17T15:08:25.685+0000","up_votes":1,"down_votes":0,"body":"Es hatte so ziemlich jedes Game oder zweites ein Flamer drin.\nAfkler hat mit dem zutun weil sie Probleme haben mit der Verbindung, Patch oder andersweitig\nTroller gibt es immer noch genau gleich viele und wächst genau so schnell wie die Community vermutlich.","replies":[]}]}