{"poster":"gyyyr","date":"2016-02-07T21:02:55.197+0000","title":"Sachen die Smite besser macht als Riot Games","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":6,"body":"Als erstes bevor mich noch jemand deswegen flamed, eine Warnung.\r\n**In diesem Post wird nur LoL/Riot Games kritisiert, obwohl nat&uuml;rlich auch Smite/Hi-Rez Studios fehler hat. Kein Spiel und Keine Firma ist perfekt und deshalb kann immer von anderen gelernt werden. **\r\n**Meiner Meinung nach sollte man ein Spiel/eine Firma die man mag so h&auml;ufig wie m&ouml;glich kritisieren, damit das Spiel/die Firma besser werden kann.**\r\n\r\nIch habe mir Smite vor einem Jahr installiert und dann auch ein paar Spiele gespielt(bis mein account lvl 6 erreicht hat). Seit dem habe ich das Spiel allerdings nicht mehr gespielt, da ich mich mit LoL besser auskannte und auch alle meine Freunde League of Legends spielten. Gestern hat mich ein Freund gefragt, ob ich mit ihm Smite spielen will und ich stimmte zu. Dabei sind mir einige Sachen aufgefallen die Smite besser macht als LoL.\r\n\r\n1. In dem einen Jahr in dem ich nicht gespielt habe, gab es einen neun Modus und mehrere neudesignte Karten.\r\n2. Es gibt 6 Spielmodi und es werden alle 6 aktiv gespielt weil das balancing auch in allen 6 Karten funktioniert.\r\n3. Man kann im Custom Game einstellen mit welchem lvl man startet, wieviel Gold man hat, ob Minions spawnen sollen und ob jemand der zuschaut eine verz&ouml;gerung haben soll.\r\n\r\nEs gibt noch mehr Dinge die gewisse Leute an Smite besser finden als an League allerdings m&ouml;chte ich diese Dinge nicht wirklich in LoL sehen.\r\n\r\nRiot Games hat mit League of Legends ein sehr gutes Spiel gemacht und sie nehmen auch viel Geld damit ein, allerdings sieht es so aus als h&auml;tte Riot Games so viel angst einnahmen zu verlieren dass sie sich nicht trauen wirklich etwas neues zu machen.\r\n\r\nIch w&uuml;nsche euch noch viel Spass beim Downvoten dieses Beitrags\r\ngyyyr","replies":[{"poster":"CooL Ice Tea","date":"2016-02-07T21:54:51.613+0000","up_votes":2,"down_votes":0,"body":"Ich hab Smite selber auch auf dem Rechner und habe ungefähr so viel gespielt wie du. Jetzt kommt die frage aller fragen zu deinem zweiten Punkt, solche leute wie wir, die das Spiel absolut wenig gespielt haben, können das Balancing einschätzen?","replies":[{"poster":"gyyyr","date":"2016-02-07T22:07:49.260+0000","up_votes":1,"down_votes":4,"body":"ich würde nicht sagen dass ich das balancing einschätzen kann. Ich behaupte dies allerdings weil alle 6 modi gespielt werden und nicht so wie bei LoL wo nur Normal Games und ARAM wirklich gespielt werden. die Meisten Spieler haben noch nie 3v3 oder Dominion gespielt weil das balancing dort einfach nicht funktioniert.","replies":[{"poster":"Bergelmir32","date":"2016-02-07T22:12:04.944+0000","up_votes":4,"down_votes":0,"body":"Hmm, ist das nicht ein bisschen wiedersprüchlich? Kaum wer spiele 3v3 und Dominion weil dort schlecht gebalanced sei, aber ARAM ist super beliebt obwohl das Balancing dort absolut grausig ist, klingt nicht grad logisch.","replies":[{"poster":"gyyyr","date":"2016-02-07T22:58:02.078+0000","up_votes":1,"down_votes":1,"body":"Das interessante an ARAM ist ja nicht das balancing sondern die zufälligen champions die auf kleinem Raum kämpfen.","replies":[{"poster":"Bergelmir32","date":"2016-02-07T23:15:47.767+0000","up_votes":3,"down_votes":0,"body":"Ja, und 3v3 hat sein schnelleres kompakteres Gameplay und Dominion das es eben noch ein ganzes Stück mehr Objectiv based ist als die anderen Modi. Das, genauso wie das Zufällige am ARAM ist aber völlig irrelevant.\nDu hast gesagt 3v3 und Dominion werden weniger gespielt weil das Banacing schlecht ist. ARAM hat das schlechteste Balancing und wird trotzdem sehr viel gespielt, wie wichtig kann Balancing dann also sein.\nWie gesagt, das ist unlogisch und obwohl Balancing bei 3v3 und Dominion so ausschlaggebend sein soll das diese Modi desshalb weniger gespielt werden, soll es beim ARAM nahezu egal sein..., das ist schon ziemlich zurech gebogen.","replies":[{"poster":"gyyyr","date":"2016-02-08T09:37:24.008+0000","up_votes":1,"down_votes":1,"body":"Bei ARAM kannst du den Champion den du spielst ja nicht selber auswählen sondern bekommst zufällig einen. Das Team wird also meistens unbalanced sein. In ARAM geht es aber darum, dass man trotz einem eventuellen nachteil das spiel versucht zu gewinnen. In 3v3, 5v5 und Dominion kann das Spiel balanced sein, aber es ist nur in 5v5 wirklich balanced.","replies":[{"poster":"Bergelmir32","date":"2016-02-08T11:29:58.192+0000","up_votes":4,"down_votes":0,"body":"Weil man eben mit einem Team ohne Poke und ohne hard Engage gegen ein paar der lästigsten Poke Champs dastehen kann soll Balancing im ARAM kaum eine Rolle spielen? Das macht nicht übermäßig viel Spaß, wenn man nicht auf der Poke-Seite steht und das man trotz eventuellem Nachteil versucht das Spiel zu gewinnen trifft auf jeden einzelnen Modus zu, außer man ist einer der ff@20 Spammer und die gibts in jedem Modus, auch im ARAM.\nEs ist ja auch nicht so das man ARAM nicht balancen könnte, z.B. indem man den Schaden der Poke Champs verringert und/oder ihre CDs erhöht etc., so wie es auf der 3v3 Map ja auch gemacht wird.\n\nWir sind also immernoch an dem Punkt wo du behauptest 3v3 und Dominion seien nicht balanced und würden aus diesem Grund weniger gespielt aber ARAM, der Modus mit der schlechtestens Balance, ist sehr beliebt, nur das natürlich, zufälliger weise grade bei dem Modus der dir in den Kram passt, Balancing kaum eine Rolle spielt.\n\nEs ergibt schlicht und einfach keinen Sinn zu behaupten schlechtes Balancing wäre der Grund wesshalb gewisse Modi nicht gespielt werden, wärend andere trotz schlechten Balancings gut frequentiert sind.\nDu stellst hier Behauptungen auf à la \"Äpfel werden kaum gegessen weil sie rund sind.\" Orangen werden aber auch gegessen obwohl die rund sind, offensichtlich kann die Rundheit also nicht der ausschlaggebende Grund sein, offensichtlich kann das Balancing also nicht der ausschlaggebende Grund sein.","replies":[{"poster":"gyyyr","date":"2016-02-08T13:50:53.611+0000","up_votes":1,"down_votes":2,"body":"ARAM kann man nicht balancen solange man das R(andom) drin lassen will, wo hingegen 3v3 und dominion in dem Raum dazwischen hängen.  Es ist halb balanced und halb unbalanced und das fühlt sich einfach komisch an. \nZum Beispiel die minion collision hängt auch in so einem zwischenraum, sie ist da hat aber nicht wirklich einen Sinn und ist auch ziemlich unlogisch und kompliziert. Das fühlt sich auch nur nervig an und es sollte sich für einen seite entschieden werden.","replies":[{"poster":"Bergelmir32","date":"2016-02-08T14:15:34.106+0000","up_votes":2,"down_votes":0,"body":"Was ist im ARAM am stärksten? Poke, Hard Engage und Heilung! Oh, siehe da, an Heilung wurde bereits gedreht, warum sollte das also nicht auch für die anderen Sachen gehen? Natürlich kann man da balancen, so wie man es in jedem anderen Modus auch macht, Champs die in diesem Modus sehr stark sind nerfen, so wie sie überall anders auch generft werden wenn sie zu stark sind.\n\nMinion Kollision ist unlogisch? Da ist was was dir im Weg steht und es ist unlogisch das du da nicht einfach durch laufen kannst? Ich kann nicht durch Wände gehen, so unlogisch! Abgesehen davon das Minions ein großartiger Schutz vor Nahkämpfern sein können, durch Minion Kollision.\n\nEs ergibt immernoch keinen Sinn zu behaupten schlechtes Balancing wäre der Grund wesshalb gewisse Modi nicht gespielt werden, wärend andere trotz schlechten Balancings gut frequentiert sind und die Behauptung man könne ARAM nicht balancen ändert nichts daran.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Parunpata","date":"2016-02-07T23:55:35.270+0000","up_votes":2,"down_votes":0,"body":"Hey, ich verstehe deine Punkte, allerdings kann man das nicht einfach so vergleichen.\nLeague of Legends lebt quasi von der 5 vs 5 Map. Die ist so beliebt und gut, dass gar keine Nachfrage nach einer neuen Map besteht. \nJeder spielt darauf gerne, die Spielerzahlen sind enorm. Sie haben einfach (zurzeit) keinen Grund für eine neue Map, weil die jetzige immer noch hoch im Kurs ist.\n\nEin Spiel wie Smite braucht Neuerungen, um den Platzhirschen Konkurrenz zu machen. Wäre alles ähnlich wie LoL, würde es keiner spielen. Deswegen probieren sie so viele neue Sachen. \nGenau wie bei Heroes of the Storm. Fähigkeitenupgrade ist was cooles und dass alle Teammitgleider gleich leveln ist auch klasse, aber das bedeutet nicht, dass es auch klasse für LoL ist. HotS musste solche Sachen einbauen, um sich von LoL oder von DotA zu unterscheiden. Ansonsten würde sich einer stinknormaler Zocker doch denken: \"Warum was anderes anfangen, wenn es eh wie LoL ist\".\n\nAlle Spiele haben ihre Spielerzahl und halten sich auch oben, und jeder tut es eben auf seine eigene Art und Weise.","replies":[{"poster":"gyyyr","date":"2016-02-08T09:08:20.989+0000","up_votes":1,"down_votes":1,"body":"> Ein Spiel wie Smite braucht Neuerungen, um den Platzhirschen Konkurrenz zu machen. Wäre alles ähnlich wie LoL, würde es keiner spielen.\n\nwieso spielen denn soviele LoL wenn es vorher schon DotA Allstars gab? Beide Spiele sind nur für ihre 5v5 map bekannt und smite wollte einfach noch mehr bieten als nur die 5v5 map. Sie hätten genau so gut sagen können dass sie nur eine 5v5 map haben wollen, der Fakt dass es ein 3rd person MOBA ist, ist neuerung genug.","replies":[{"poster":"Sirrkas","date":"2016-02-08T11:36:21.410+0000","up_votes":2,"down_votes":0,"body":"Ich schätze mal das liegt daran, dass Dota viel zu komplex ist, um es in kurzer Zeit einigermaßen zu verstehen. Zudem wird bei Dota viel mehr bestraft. Man verliert da zum Beispiel bei einem Tod nicht nur Zeit zum farmen und EP sammeln, sondern auch noch einen Teil des Goldes. Man muss nicht nur Minions lasthitten können, sondern auch noch darauf achten, dass man die eigenen töten kann, um Farm zu denien. Das macht das ganze sehr undurchsichtig für Neueinsteiger und fördert zudem snowballing. \n\nBei beiden Spielen, wird man gegen den 3/0 Assassinen kaum noch eine Chance im 1vs1 haben, bei LoL kann er dir aber zumindest nicht auch noch den Farm unter dem Turm streitig machen.","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2016-02-07T21:51:48.376+0000","up_votes":1,"down_votes":0,"body":"Die Spactate delay bei einem Custome game halte ich ebenfalls für groben Unfug. Das wäre ein guter Modus, fürs coaching.","replies":[{"poster":"gyyyr","date":"2016-02-07T22:08:54.794+0000","up_votes":1,"down_votes":1,"body":"> Das wäre ein guter Modus, fürs coaching.\n\nDa hast du ja selber schon einen Sinn hinter der Funktion gefunden.","replies":[]}]},{"poster":"Ehren Teemo","date":"2016-02-08T00:36:23.335+0000","up_votes":1,"down_votes":2,"body":"Gaaaaaanz einfach :\nLoL hat Quinn das reicht mir :3\n\nMFG Lizart\n\"Die Flügel der Gerechtigkeit\"{{champion:133}}","replies":[]}]}