{"poster":"iNono","date":"2015-02-17T23:26:06.616+0000","title":"Dia 5 Mid Laner sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nich suche ein festes Team, welches regelmäßig an Turnieren teilnimmt aber gleichzeitig eher locker aufgestellt ist.\r\n\r\nZu mir:\r\n\r\nIch bin 20 Jahre alt und studiere momentan Medieninformatik. Ich spiele seit 2010 LoL und befinde mich zur Zeit in Diamant 5 auf dem Weg nach oben. Meine Main Lane ist die Mitte und dort spiele ich vor allem Swain. Für andere Champs bin ich natürlich auch offen wobei ich Swain mit Abstand am besten beherrsche und ich ihn in der Regel auch spiele. \r\n\r\nWas ich genau suche:\r\n\r\nIch suche ein Team in dem es eher locker zugeht. Es sollte schon mehrmals in der Woche gespielt werden, allerdings sollte auch das Real Life im Vordergrund stehen. Also am besten wären keine festen Trainingszeiten sondern eher eine Whats App Gruppe in der man sich dann immer spontan zum zocken verabredet. Ich finde wenn man feste Trainingszeiten hat, dann vernachlässigt man schonmal hin und wieder das Real Life, da man zu der Zeit dann evtl was wichtigeres hätte machen können, dieses aber wegen dem Zocken dann ausfallen lässt. Deshalb bevorzuge ich eher eine Gruppe wo man dann evtl jeden Tag mal fragt obs heute bei jedem möglich ist. Und wenn man dann mal ne ganze Woche keine Zeit hatte sollte das auch kein großes Problem darstellen. Das soll jetzt nicht heißen, dass das bei mir öfter vorkommt sondern ich will nur sicher gehen, dass der \"Zwang\" nicht zu groß ist. Neben dem normalen trainieren wäre es natürlich gut regelmäßig an Turnieren teilzunehmen. Achja und die Spieler sollten auch so im Diamant Bereich sein.\r\n\r\nIch hoffe es gibt da draußen noch weitere Diamant Spieler die bock auf Turniere und sowas haben und es gleichzeitig aber locker angehen lassen wollen :) \r\n\r\nFalls ja meldet euch unter diesem Post oder addet mich ingame.\r\n\r\nViele Grüße","replies":[{"poster":"ruffneck","date":"2015-02-18T10:45:27.314+0000","up_votes":1,"down_votes":0,"body":"Bei Interesse gerne melden =)\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/azEzzfTs-gzg-sucht-spieler-far-platdia-team","replies":[]}]}