{"poster":"Stardew Valley","date":"2016-11-19T17:52:27.572+0000","title":"Couldn't Connect to Chat / Get to Loading Screen (CenturyLink)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"(I think this is another problem with CenturyLink)\r\nThis morning I couldn't connect to Chat which prevented me from calling the role I want in blind pick.\r\nI closed and reopened LoL a few times (cause it still wouldn't let me connect). Until about the 4th try, LoL just completely stopped opening (I restarted my PC a few times and it still wouldn't open). Now I had to uninstall and redownload LoL. I was able to open it, but I still could not connect to chat, so I decided go draft instead. But after finishing champion select, I could not even get to the loading screen. Anyone else having the same issue?","replies":[{"poster":"xSoriix","date":"2016-12-30T01:41:58.811+0000","up_votes":1,"down_votes":0,"body":"I had this happen about the same time with Centurylink. Now I can't even log in to the client as it will tell me Connection Failure: Unable to connect to the PVP.net server. \n\nIt started with issues connecting to chat. Then the game would crash every time I got to the loading screen of a game. After several attempts to reconnect it would finally let me back into the game. That happened for 2 days and then I wasn't even able to log in. I pushed it off due to the holidays and being busy. Finally decided to try again tonight and still no luck. Anyone still having issues? \n\nI had something similar to this happen a few years ago with another ISP and it turned out to be something blocking access to one of the league servers. Seems like the same thing is happening here. Will see if I can get in touch with someone at Centurylink I guess.","replies":[]},{"poster":"Porocles","date":"2016-11-19T18:31:50.359+0000","up_votes":1,"down_votes":0,"body":"It's certainly possible that your ISP could have issues or a change in routing that can cause delays reaching chat or game servers, but I'd like to rule out other possibilties first.  There may in fact be more local solutions to work with, so I recommend going over each step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide first to help.  Hopefully that will do the trick, but let me know.  Also are you using the legacy or updated client?","replies":[{"poster":"Stardew Valley","date":"2016-11-19T19:06:03.304+0000","up_votes":1,"down_votes":0,"body":"I can't reach the link. I think it's definitely an issue with CenturyLink. I actually had a similar issue earlier on my phone where I can't reach the apple site. It only kept loading. So I used cellular data and it worked easily.\n\nAs far as I know there was also an issue specifically for CenturyLink users just a few months ago. I'll try to reach the link on my phone using cellular data.\n\nEDIT: I tried doing a custom game and I got to the game easily. So I tried my luck on another draft pick game and again, it won't get me to the loading screen. It just keeps telling me to retry. (It's like preventing me from having contact with other players?)\n\nAlso, for some reason the last team did not choose to remake. I definitely got reported :/","replies":[]}]}]}