{"poster":"Blood Fest","date":"2019-09-13T08:49:34.315+0000","title":"Why is Rank so toxic towards new players playing rank","subforum":"Player Behaviour","up_votes":3,"down_votes":0,"body":"So i went on a mission. got sick of having bad games in nomal draft mode full of feeders afkers trolls people saying no to FF even if we losing hard.\r\n\r\nSo i fought ranking up would be fun first time i have play my full 10 games to earn a rank. \r\n\r\ngot silver 3. \r\n\r\nim no pro at the game i have tons learn i been playing since season one alot has change over the years when aram came out all i did was play that\r\nbut anyway i took 89 day break came back wanted to play nomals so i did. but feeders afkers trolls people saying no to FF even if we losing hard.\r\n\r\nmade game hard and enjoy able so i ranked up\r\nplayed support whole way the game were between gold 1 and silver 4\r\ni notice how toxic ranked players were against new coming ranked players its depressing and tilting.\r\n\r\ngot told to uninstall.\r\nthat im bad give up playing and other stuff.\r\n\r\nok tonight i failed as a support i only played 12 games in rank. and some theses people giving me crap failed there lanes who had few 100 ranked games\r\nseem only give me crap. is it blame the support day is it. its not like i ranked up in iron 4 which i fought was gonna happen. \r\n\r\nalso if you have taken none of enemy towers and they in your base and its 38-10 why vote double no on ff. its tilting and very toxic like your beaten you need learn that not drag out to point you wannta just afk.","replies":[{"poster":"Bring me my belt","date":"2019-09-13T13:19:51.041+0000","up_votes":3,"down_votes":0,"body":"It's not just towards new players it happens to everyone. The game is purely toxic, Riot just have a penalty system that is crap. just mute all and move on","replies":[{"poster":"Exarch Leona","date":"2019-09-14T15:48:40.298+0000","up_votes":2,"down_votes":1,"body":"I don't even believe there is a system at this point. \nWith how often, tonight alone, the amount of abusive inters/afkers was unreal, and I can say with certainty that they won't go punished. \n\nBecause, AND QUOTING RITO, that isn't against the rules.","replies":[{"poster":"JasonWazza","date":"2019-09-15T08:33:44.331+0000","up_votes":1,"down_votes":0,"body":"no it's against the rules it's just \"hard to define intentional feeding over just being bad\"\n\nNever mind the fact that it's obvious with a simple review of what they are doing half the time, but that's not the point.\n\nbut hey it gives the trolls the \"i'm just bad\" defence to use regardless of how many games they just int for.","replies":[{"poster":"TheDemonEmperor","date":"2019-09-16T12:04:49.492+0000","up_votes":1,"down_votes":1,"body":"> Never mind the fact that it's obvious with a **simple review of what they are doing half the time**, but that's not the point.\n\nAre you kidding me? How many people do you think riot would need to hire to bring your idea into being?\n\n1 person working for 8 hours; From reading the complaint to manually checking the replay would take at least 7-9mins to grasp a proper analysis. The finer details i imagined would entails, watching all the moments leading up to the bad scores, as well as exchanges of words.\n\nTilting? Bad plays? team is overall losing? What happen to make the scores that bad?? Is the player consistently scoring bad? being reported frequently? These are question a support employee would need to solve before handing out a **game play ban**. By no mean it will be a short duration type of viewing. \n\nA crossed all ranks players are prone to report the worst performing player on the team. Especially in silver4 or lower. Which are the bulk of the rank population. \n\nIf the situation is as toxic as you have frequently mentioned. Then the figures of reported incidents would outmatch the numbers of employees by a LARGE MARGIN. It is a stupid move to hire so many employees to manually view replays like you have SUGGESTED.\n\nIf you think it is simple. Then you are telling me a lot about yourself.","replies":[{"poster":"JasonWazza","date":"2019-09-16T14:38:03.904+0000","up_votes":1,"down_votes":0,"body":"\"1 person working for 8 hours; From reading the complaint to manually checking the replay would take at least 7-9mins to grasp a proper analysis. The finer details i imagined would entails, watching all the moments leading up to the bad scores, as well as exchanges of words.\"\n\nSo first the main stuff needs to be transferred into different types of cases, since facing facts, there are people who will troll, and people who will intentionally feed, this is achieved quite easily more then likely through just doing a quick cross section of the reports and finding the key words that would tell about each, not every report needs to show the key words, but letting the community know this is an initiative would incentivize them actively making use of the words as well.\n\n\"Tilting? Bad plays? team is overall losing? What happen to make the scores that bad?? Is the player consistently scoring bad? being reported frequently? These are question a support employee would need to solve before handing out a game play ban. By no mean it will be a short duration type of viewing.\"\n\nYou really are trying to do this in the dumbest manner, which i think just shows your inability to think of a solution then anything else, none of what your trying to say, needs a support employee to be involved.\n\n\"A crossed all ranks players are prone to report the worst performing player on the team. Especially in silver4 or lower. Which are the bulk of the rank population.\"\n\nYes but across the whole population, it's not like proper players would get reported every game in a 20 game stretch (or at least a high percentage) your the person who's trying to find the occasional 1 in 20 game inter, not me (though admittedly it wouldn't be hard to tell since they tend to use the chat in stupid ways that make it obvious as well, but not really my point).\n\n\"If the situation is as toxic as you have frequently mentioned. Then the figures of reported incidents would outmatch the numbers of employees by a LARGE MARGIN. It is a stupid move to hire so many employees to manually view replays like you have SUGGESTED.\"\n\nAnd that would be why you don't investigate every single report in the game like a moron.","replies":[{"poster":"TheDemonEmperor","date":"2019-09-17T10:49:06.087+0000","up_votes":1,"down_votes":1,"body":"> So first the main stuff needs to be transferred into different types of cases, since facing facts, there are people who will troll, and people who will intentionally feed, this is achieved quite easily more then likely through just **doing a quick cross section of the reports and finding the key words that would tell about each**, not every report needs to show the key words, but letting the community know this is an initiative would incentivize them actively making use of the words as well.\n\nYou are suggesting using words of mouth as proof in order to speed up the process? \n\nWithout the  game play footage, this is effectively flawed and one sided. Not only it neglect the circumstance of the case, it heavily leaned on the majority's accusation. Which can be easily abuse under stressful situation where 4 players would point their finger to the guy who lost lane. \n\n> You really are trying to do this in the dumbest manner, which i think just shows your inability to think of a solution then anything else, none of what your trying to say, needs a support employee to be involved.\n\nThe one who is not being comprehensive is you, not i. I'm covering more aspects, from reasoning to timing. While you've pushed passed the details in order to get your shallow idea into the arena. \n\nThe so call solution you came up with, is no more than child play. No serious company would hire you for that idea. It is so elementary, that it is laughable. \n\n> Yes but across the whole population, it's not like proper players would get reported every game in a 20 game stretch (or at least a high percentage) your the person who's trying to find the occasional 1 in 20 game inter, not me (though admittedly it wouldn't be hard to tell since they tend to use the chat in stupid ways that make it obvious as well, but not really my point).\n\nIn order to grasp a reasonable conclusion, we 1st need to understand the nature of why report occur in the case of, troll/inter or innocent. \n\nSuch as: no sympathy for the guy who lost lane badly, don't know why the team mate got destroyed in lane but take an assumption that he didn't want to win, playing an off meta champ and under performing. All of these add on to losing and temper, people are quick to report others. \n\nWho's to say the same player that was reported in one game, wont be reported again for the same reason? Should that player be ban based on others painting a narrative? If yes, then how many games of being reported must the person go through before the trigger is pull?\n\n**How can a support employee know without manually checking it through?? Because words of mouth is good enough? You think everything can be boiled down to judgement for the one game?? **\n\nWhat if someone feed on your one game, but did not do it on the next? But since you are so pissed off about losing you think he is  an inter/troll. Better yet, do you track the inting player and determine that they are a serial offender? \n\nSo easy for you to cut all the information out and make a loose assessment. \n\n> And that would be why you don't investigate every single report in the game like a moron.\n\nThat is why there is a big delay on game play banning vs WORDS BANNING! HOLY @#$%.\n\nYou don't think things through, you just come up with these 144p resolution idea and think it is HD.","replies":[{"poster":"JasonWazza","date":"2019-09-17T11:01:54.599+0000","up_votes":1,"down_votes":0,"body":"\"That is why there is a big delay on game play banning vs WORDS BANNING! HOLY @#$%.\"\n\nThis assumes that the game play bans happen at all just FYI.\n\nBut hey your too busy assuming what the idea of trying to implement this would be instead of even considering how easy it would be to implement something that would actually make it not need to be a huge manual slog, Cause you know, Tribunal forced players to review things for hours on end to get a judgement.\n\nOr even better, it's not like the bot could compile enough information for a good analysis of what the player is doing.\n\n\"What if someone feed on your one game, but did not do it on the next? But since you are so pissed off about losing you think he is an inter/troll. Better yet, do you track the inting player and determine that they are a serial offender?\"\n\nIt's not hard to spot serial offenders, and they are everywhere in games, usually with history's full of trolling or inting behaviour.\n\nAnd no it doesn't take me hours to review footage to be able to see that.","replies":[]}]}]}]}]}]}]}]}