{"poster":"Undead Zzz2","date":"2014-12-03T10:41:56.631+0000","title":"Reserves needed for team.","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Hi guys. I'm trying to make a rank team here and is recruiting atm. I'm looking for people who's keen to enter the upcoming OCE open ladder tournament and move towards becoming pro. To join would pref to be at least silver 5 and able to use Skype and can be added on fb just so it's easier for all of us to contact each other. Also we want members who are positive and non toxic/salty. If this sounds like you and your keen add me.\n\nWe would like to have players who can at least play 2 lanes without problem. \nSo far we have a mid+support. A adc player. \nNeed someone who can jg,top and support. \n\nAlso we are looking for a manager to manage the team. Post below ign if u can look after a team. \n\nThanks!","replies":[{"poster":"IIpsycheII","date":"2014-12-07T12:02:52.258+0000","up_votes":1,"down_votes":0,"body":"ign IIpsycheii\ngold 3, mid top jg player. can also support if needed.","replies":[]},{"poster":"Wolves","date":"2014-12-05T14:52:57.472+0000","up_votes":1,"down_votes":0,"body":"gold 4 add wolves tho only available 11.30pm to 4 am nz time and 8 am to 1pm in the weekdays , free all weekend for tournaments. and any role","replies":[]},{"poster":"KingDinger","date":"2014-12-04T07:02:23.329+0000","up_votes":1,"down_votes":0,"body":"i can carry you if you like. best heimer dinger OCE. just need a team comp built around me to make sure 100% carry. can jungle mid top or support dinger, with support dinger being least reliant on team to carry but reliant on the ADC to not just ragequit at lvl 3.","replies":[]},{"poster":"Curse of Annubis","date":"2014-12-04T06:36:20.420+0000","up_votes":1,"down_votes":0,"body":"Gold 3 Jungle and top main and good at support.","replies":[]},{"poster":"SoulMasterKaze","date":"2014-12-03T11:24:28.469+0000","up_votes":1,"down_votes":0,"body":"Heya! I'm Silver 4 and a support main, with my second and third-best roles are jungle and toplane respectively.\n\nI have pretty good flexibility by way of times and days, and I'm not a complete so-and-so if games start going poorly.\n\nIn-game name is same as this one, hope to hear from you soon.","replies":[]},{"poster":"OMGHOTDOG","date":"2014-12-03T11:01:49.659+0000","up_votes":1,"down_votes":0,"body":"Im Bronze 4 Can play whenever, I main jungle and Top and would love a chance for the reserve roll thank you! IGN OMGHOTDOG","replies":[]},{"poster":"Mar3thyu","date":"2014-12-03T10:48:19.656+0000","up_votes":1,"down_votes":0,"body":"im B1 in a series atm haven't used Skype and LoL b4 so yeah I mainjg but top and mid aswell","replies":[]}]}