{"poster":"PandemoniumSeek","date":"2018-04-06T22:05:21.928+0000","title":"Bann","subforum":"Aiuto e supporto","up_votes":2,"down_votes":10,"body":"Buonasera,\n\nio vorrei che gentilmene andaste a vedere la partita che mi ha portato al bann.\n\nio ho speso dei soldi su questo account e non &egrave; accettabile che mi venga bloccato a causa di uno che mi ha insultato per una partita intera.\nil fatto che venga bannato io e non lui &egrave; veramente ingiusto. andate a rivedervi la partita di questo giocatore  Yasuo che ha disputato con me e vedrete come &egrave; stato tossico. non &egrave; accettabile questo comportamento da parte del sistema riot scusate ma uno che subisce degli insulti che non pu&ograve; difendersi in alcun modo viene bannato. succede sembre cos&igrave; vengo attaccato io con isulti e poi vengo segnalato perch&egrave; gli altri giocano insieme e si mettono d&#039;accordo.\nio chiedo che mi venga data almeno un alta opportunit&agrave; io muter&ograve; tutti d&#039;ora in avanti e non scriver&ograve; pi&ugrave; niente. per&ograve; non potete bannarmi un account su cui ho speso cos&igrave; tanti soldi. oltretutto in questo modo perdete pure un cliente.\nchiedo cortesemente di osservare la partita disputata e di rivedere la segnalazione che mi &egrave; stata fatta.\nPer cortesia vi chiedo di togliermi il bann e dimostrer&ograve; che non sono un giocatore tossico per il sistema. oltretutto dopo aver speso pi&ugrave; di 100 euro per un gioco gratuito questa cosa &egrave; davvero inaccettabile. io li ho spesi per correttezza perch&egrave; giustamente se usufruisco di un servizio e riconosco che &egrave; fatto bene lo voglio premiare e godermelo meglio ( in questo caso con le skin ).\nPer favore cercate di fare il possibile per sbloccarmelo un ultima volta.\n\n Discussione avuta con\n\nYasuo\n\n\nPartita 1\nPandemoniumSeek: i&#039;m drunk guys i try to not feed  and focus farm\nPandemoniumSeek: k\nPandemoniumSeek: i&#039;m good player\nPandemoniumSeek: but i cannot carry this game\nPandemoniumSeek: focus farm\nPandemoniumSeek: i&#039;m fuking drunk\nPandemoniumSeek: kayn is flame\nPandemoniumSeek: by jax\nPandemoniumSeek: man stfu pls\nPandemoniumSeek: 1 vs 4 u go\nPandemoniumSeek: u are fuking toxic\nPandemoniumSeek: report jungle for flame from minut 3\nPandemoniumSeek: pls\nPandemoniumSeek: impossible to play\nPandemoniumSeek: yes but he flame anyway\nPandemoniumSeek: HAHAHAHAH\nPandemoniumSeek: HAHAHAHHA\nPandemoniumSeek: kayn cry\nPandemoniumSeek: hahahahah\nPandemoniumSeek: he cry like a 12 years\nPandemoniumSeek: u so bad\nPandemoniumSeek: i didn&#039;t feed ekko\nPandemoniumSeek: u feed ekko\nPandemoniumSeek: man\nPandemoniumSeek: HAHAHHA\nPandemoniumSeek: pls\nPandemoniumSeek: if u are bad don&#039;t use excuse\nPandemoniumSeek: i done\nPandemoniumSeek: go se replay\nPandemoniumSeek: fuking kid\nPandemoniumSeek: toxic player\nPandemoniumSeek: we lose for u\nPandemoniumSeek: pls\nPandemoniumSeek: report kayn\nPandemoniumSeek: he is good only to write\nPandemoniumSeek: flame from minut 3\nPandemoniumSeek: look him\nPandemoniumSeek: he troll now too\nPandemoniumSeek: he play 1 vs all\nPandemoniumSeek: man\nPandemoniumSeek: x9 u flamer\nPandemoniumSeek: now i write to riot\nPandemoniumSeek: u are most toxiest player ever\nPandemoniumSeek: man\nPandemoniumSeek: kayn trool\nPandemoniumSeek: AHHAHAH\nPandemoniumSeek: look him\nPandemoniumSeek: HAHAHHA\nPandemoniumSeek: he is good only to write\nPandemoniumSeek: HAHAH\nPandemoniumSeek: HAHAH U HAVE 46% WINRATE\nPandemoniumSeek: AHHAHAHA\nPandemoniumSeek: i have\nPandemoniumSeek: and u are ridicolous\nPandemoniumSeek: i flame only\nPandemoniumSeek: pls\nPandemoniumSeek: go to serch some friend\n\n_EMISSARY EDIT: Ho censurato il nome dell'evocatore a cui ti riferisci. Il name&&shame è vietato._","replies":[{"poster":"Detective Meow","date":"2018-04-06T22:58:24.454+0000","up_votes":7,"down_votes":0,"body":"Madonna, prossima volta silenzia e fregatene.\nAnche te che hai iniziando dicendo di essere ubriaco hai chiesto un po' in ginocchio al team di essere indisposto nei tuoi riguardi.\nQuando leggo qualcuno che esordisce in questa maniera la prima cosa che mi viene in mente è: \"ma 'sta gente capita tutta a me?\".\n\nUno torna a casa da lavoro, stanco, con la testa che esplode di numeri, logga League per farsi una partita ranked e il segno della croce di trovarsi un team quanto meno amichevole e becca:\n1) il flamer\n2) l'afk\n3) l'ubriaco\n4) il tipo a caso che inta\n5) il tipo a caso che dopo la prima morte inizia a spammare surrender\n6) il tipo a caso che dopo i primi 10 minuti di partita proclama \"it's lost gg i go afk\"\n\nGente che puntualmente dopo la partita di cui sopra, ritrovi in fila sul forum ad aprire topic per lamentarsi di quanto sia trash tier il proprio team.\nEh va beh ragazzi, non posso essere volgare, ma gente così meglio fuori che dentro.","replies":[{"poster":"Suppört 0r Feed","date":"2018-04-07T09:05:02.926+0000","up_votes":1,"down_votes":2,"body":"> 6) il tipo a caso che dopo i primi 10 minuti di partita proclama &quot;it&#x27;s lost gg i go afk&quot;\n\nahaha sono io {{sticker:sg-kiko}} \n\nno a parte gli scherzi, ti do ragione, dovevi mutare tutti, chiaramente anche tu hai usato parole 'volgari' quindi boh, io ci godo","replies":[{"poster":"Detective Meow","date":"2018-04-07T10:36:05.045+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Suppört 0r Feed,realm=EUW,application-id=98NGV4Al,discussion-id=gpt8YBe3,comment-id=00050000,timestamp=2018-04-07T09:05:02.926+0000)\n>\n> ahaha sono io {{sticker:sg-kiko}} \n> \n> no a parte gli scherzi, ti do ragione, dovevi mutare tutti, chiaramente anche tu hai usato parole &#x27;volgari&#x27; quindi boh, io ci godo\n\nExcuse me sir, ma con chi ce l'ha?","replies":[{"poster":"Suppört 0r Feed","date":"2018-04-08T16:59:00.427+0000","up_votes":1,"down_votes":0,"body":"con l'autore del post?? {{sticker:katarina-love}}","replies":[{"poster":"Detective Meow","date":"2018-04-08T21:39:51.478+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Suppört 0r Feed,realm=EUW,application-id=98NGV4Al,discussion-id=gpt8YBe3,comment-id=0005000000000000,timestamp=2018-04-08T16:59:00.427+0000)\n>\n> con l&#x27;autore del post?? {{sticker:katarina-love}}\n\nHai risposto a me.","replies":[]}]}]}]}]},{"poster":"Dr LouD","date":"2018-04-07T07:23:40.285+0000","up_votes":7,"down_votes":1,"body":"> i'm fuking drunk\n\nhttps://ih0.redbubble.net/image.370068309.4729/flat,800x800,070,f.u2.jpg","replies":[]},{"poster":"Dodop","date":"2018-04-07T08:42:01.685+0000","up_votes":5,"down_votes":1,"body":"La cosa ironica è che ti stai lamentando di un ban in seguito a un game in cui:\n1) Hai detto di essere ubriaco all'inizio del game, provocando un impatto psicologico negativo sui tuoi compagni di team (soprattutto nei confronti di chi già era tiltato di suo)\n2) Hai risposto al flame (che ovviamente non giustifico) del tuo compagno insultandolo, anche pesantemente, a tua volta (con un inglese perfetto poi xd)\nDai, lo hai ammesso tu stesso:\n>PandemoniumSeek: i flame only\n\n3) Hai chiesto di reportarlo più volte, azione reportabile e bannabile\n\nInsomma, sei uno di quei player strafottenti da mutare alla prima frase scritta in chat, che credono sempre di aver ragione dietro al proprio schermo e che poi si lamentano in modo ridicolo quando vengono puniti. Cioè ma veramente ti stai lamentando perché ti sei \"difeso\" con il suo stesso mezzo? Siamo nel 2018, la legge del taglione è passata ormai da migliaia di anni xD\nInutile dire che il banN è assolutamente meritato, e le punizioni sono giustamente uguali per tutti, puoi anche aver speso 1000 euro in skin e sei considerato esattamente come gli altri.\n\n>PandemoniumSeek: now i write to riot\n\nEh no caro, le cose sono andate un po' diversamente ahahah","replies":[{"poster":"PandemoniumSeek","date":"2018-04-08T09:38:04.576+0000","up_votes":1,"down_votes":2,"body":"\"i flame only\" è sbagliato volevo scrivere u flame only e il mio inglese e gli errori erano dovuti al mio stato.\n\nSe chiedere il report è bannabile bisognerebbe bannare metà del player di lol, per favore, che giustificazioni sono queste.","replies":[]},{"poster":"PandemoniumSeek","date":"2018-04-08T09:37:14.634+0000","up_votes":1,"down_votes":2,"body":"\"i flame only\" è sbagliato volevo scrivere u flame only e il mio inglese e gli errori erano dovuti al mio stato.","replies":[]}]},{"poster":"Floppyz","date":"2018-04-06T22:20:43.437+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=PandemoniumSeek,realm=EUW,application-id=98NGV4Al,discussion-id=gpt8YBe3,comment-id=,timestamp=2018-04-06T22:05:21.928+0000)\n>\n> Buonasera,\n> \n> io vorrei che gentilmene andaste a vedere la partita che mi ha portato al bann.\n> \n> io ho speso dei soldi su questo account\n\nMi spiace, ma il fatto che tu abbia speso del denaro sul tuo account, non gli conferisce alcuno status speciale, né ti garantisce maggiore indulgenza per quanto riguarda le punizioni.\n\n\n>e non &amp;egrave; accettabile che mi venga bloccato a causa di uno che mi ha insultato per una partita intera.\n\nNon sei stato punito perché una persona ti ha _insultato per una partita intera_, ma perché ti sei comportato in maniera poco educata.\n\n> il fatto che venga bannato io e non lui &amp;egrave; veramente ingiusto.\n\nIl fatto che tu sia stato punito non significa che a lui non accadrà lo stesso. Tieni anche conto che account diversi hanno stati di tossicità/punizioni diversi, e non sempre si viene puniti con una sospensione alla prima infrazione.\n\n > uno che subisce degli insulti che non pu&amp;ograve; difendersi in alcun modo viene bannato.\n\nHai modo di difenderti ignorando e segnalando il giocatore in questione. Puoi anche silenziarlo, così da non leggerlo più.\n\n> vengo attaccato io con isulti e poi vengo segnalato perch&amp;egrave; gli altri giocano insieme e si mettono d&amp;#039;accordo.\n\nPiù segnalazioni nella stessa partita, valgono comunque come una, e portano a una punizione solamente se hanno effettivo riscontro nella realtà.\n\n> io chiedo che mi venga data almeno un alta opportunit&amp;agrave; io muter&amp;ograve; tutti d&amp;#039;ora in avanti e non scriver&amp;ograve; pi&amp;ugrave; niente. per&amp;ograve; non potete bannarmi un account su cui ho speso cos&amp;igrave; tanti soldi. oltretutto in questo modo perdete pure un cliente.\n> chiedo cortesemente di osservare la partita disputata e di rivedere la segnalazione che mi &amp;egrave; stata fatta.\n> Per cortesia vi chiedo di togliermi il bann e dimostrer&amp;ograve; che non sono un giocatore tossico per il sistema. oltretutto dopo aver speso pi&amp;ugrave; di 100 euro per un gioco gratuito questa cosa &amp;egrave; davvero inaccettabile. io li ho spesi per correttezza perch&amp;egrave; giustamente se usufruisco di un servizio e riconosco che &amp;egrave; fatto bene lo voglio premiare e godermelo meglio ( in questo caso con le skin ).\n> Per favore cercate di fare il possibile per sbloccarmelo un ultima volta.\n\nRiot non rimuove **mai** le sospensioni per tossicità, e prima di arrivare a una permanente ci sono diverse fasi che passi e avvisi che ricevi, proprio perché si rende conto che è brutto perdere l'account. Se però nonostante tutti questi avvisi, il giocatore continua a comportarsi male, beh, a costo di perdere un cliente, Riot lo allontana, tutelando tutti gli altri, che non hanno fatto niente di male.\n\nQuello che è inaccettabile è pretendere di potersi comportare male, a spese degli altri giocatori, che hanno tutto il diritto a giocare serenamente, senza che gli si dia fastidio.\n\nIn sintesi, mi dispiace, ma oramai la frittata è fatta, avresti dovuto pensarci prima e comportarti di conseguenza. Spero che questa esperienza ti serva per il futuro.","replies":[]},{"poster":"CesoiePlastiche","date":"2018-04-06T22:27:45.769+0000","up_votes":3,"down_votes":1,"body":"PandemoniumSeek: i'm drunk guys i try to not feed and focus farm\nPandemoniumSeek: man stfu pls\nPandemoniumSeek: fuking kid\nPandemoniumSeek: u are fuking toxic\nPandemoniumSeek: report jungle for flame from minut 3\n\nSei partito dicendo a tutti che eri ubriaco, questo fa già tiltare il tuo team che deve sorbirsi un tizio che sembri voglia trollare... La causa del flame è tua e ti sei pure messo ad insultare gli altri, Ban meritato.","replies":[]},{"poster":"Koria","date":"2018-04-06T22:15:57.044+0000","up_votes":3,"down_votes":1,"body":"Quante volte ha detto la Riot di non flammare ? Tante ma tante volte. La prossima volta impari a non flammare","replies":[]},{"poster":"Dodop","date":"2018-04-08T10:39:31.444+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=PandemoniumSeek,realm=EUW,application-id=98NGV4Al,discussion-id=gpt8YBe3,comment-id=0008,timestamp=2018-04-08T09:34:31.545+0000)\n\n> \n> ok avete perfettamente ragione però posso dire che non ha senso bannare l&#x27;account? negli altri giochi si banna dalla chat perché in questo modo oltretutto riot perde un cliente.\n> Non trae nessun vantaggio a bannarmi l&#x27; account. non sarebbe possibile chiudermi la chat ma lasciarmi la possibilità di giocare?\n\nAhahahah ma secondo te perdere un cliente alla Riot interessa molto? Anzi, in questo modo la Riot ha rimosso un giocatore negativo nei confronti della community.\nScaricando League of Legends accetti l'EULA, una serie di regolamenti e norme che includono anche la possibilità di bandire l'account di un giocatore che non si comporta bene con gli altri all'interno del gioco. Ed è proprio quello che è successo nel tuo caso, con la tua arroganza e strafottenza hai rovinato l'esperienza di gioco ad altri player meritandoti il ban poiché la community (e tantomeno la Riot) non ha bisogno di un giocatore come te.\n\n> Se chiedere il report è bannabile bisognerebbe bannare metà del player di lol, per favore, che giustificazioni sono queste.\n\nOvviamente non succede che ognuno che scrive \"report X\" viene istantaneamente bannato, però ho comunque puntualizzato il fatto che ciò vada contro le regole di Riot anche se si tratta di una pena più lieve rispetto a  insultare altri giocatori per esempio. Quindi nel tuo caso anche aver chiesto di reportare il tuo compagno di squadra ha contribuito (anche se con un peso minore rispetto al resto del flame) al tuo ban.","replies":[{"poster":"PandemoniumSeek","date":"2018-04-08T19:37:30.519+0000","up_votes":1,"down_votes":2,"body":"Si però basterebbe bannare dalla chat. perchè già così mi impedisci il flame. non potendo scrivere non rovinerei il gioco a nessuno.","replies":[]}]},{"poster":"Aurelion Shmoll","date":"2018-04-06T22:37:29.375+0000","up_votes":2,"down_votes":1,"body":"Se violi il regolamento, aspettati di venir sanzionato.","replies":[]},{"poster":"PandemoniumSeek","date":"2018-04-14T15:25:56.047+0000","up_votes":1,"down_votes":1,"body":"un altro motivo per cui bannare è inutile è che io posso continuare a giocare.","replies":[]},{"poster":"PandemoniumSeek","date":"2018-04-08T09:34:31.545+0000","up_votes":2,"down_votes":2,"body":"Buongiorno grazie per le risposte,\n\nok avete perfettamente ragione però posso dire che non ha senso bannare l'account? negli altri giochi si banna dalla chat perché in questo modo oltretutto riot perde un cliente.\nNon trae nessun vantaggio a bannarmi l' account. non sarebbe possibile chiudermi la chat ma lasciarmi la possibilità di giocare?\n\nSaluti","replies":[]},{"poster":"Demigod Summoner","date":"2018-04-06T22:38:17.340+0000","up_votes":2,"down_votes":5,"body":"account su cui ho speso così tanti soldi, ti ringrazio perchè grazie a te gioco a questo gioco senza aver mai speso un euro ed ottenendo anche skin gratis","replies":[]}]}