{"poster":"Ymir","date":"2015-09-15T18:50:58.930+0000","title":"Migliorie in arrivo per le limitazioni della chat","subforum":"Discussioni generali","up_votes":16,"down_votes":1,"body":"Ciao a tutti! Vogliamo parlarvi delle migliorie che stiamo per implementare nelle limitazioni della chat, insieme a quelle del [feedback istantaneo](http://euw.leagueoflegends.com/it/news/game-updates/player-behavior/potenziamenti-al-feedback-istantaneo). Ma prima, un breve riassunto.\r\n\r\nLe punizioni per i comportamenti negativi in LoL dovrebbero servire a tre scopi:\r\n\r\n●\tIncoraggiare i giocatori negativi occasionali o moderati a rivedere la loro condotta\r\n●\tProteggere i giocatori dalle esperienze negative\r\n●\tRimuovere da LoL i giocatori che non cambiano condotta\r\n\r\nDa quando abbiamo lanciato le limitazioni della chat, l&#039;anno scorso, abbiamo notato alcuni problemi. Alcuni giocatori negativi accumulano quantit&agrave; folli di limitazioni della chat, ma il loro uso della chat limitata continua a diffondere negativit&agrave;, senza segni di miglioramento. Altri rivedono la loro condotta, ma devono comunque affrontare centinaia di partite con la chat limitata, prima di capire se sono migliorati o se devono ancora affrontare delle punizioni. Altri ancora ricevono le limitazioni della chat, ma non sanno quali comportamenti sono stati reputati non accettabili dagli altri giocatori, quindi non sanno come migliorare. \r\n\r\nEcco cosa stiamo facendo per risolvere questi problemi: \r\n\r\n●\tLe punizioni crescono rapidamente per chi non migliora. Ecco come funziona:\r\n○\tPrima infrazione: 10 partite con chat limitata\r\n○\tSeconda infrazione: 25 partite con chat limitata\r\n○\tTerza infrazione: due settimane di ban\r\n○\tQuarta infrazione: ban permanente \r\n●\tRiduciamo il tempo che passa tra l&#039;azione e la conseguenza (aumentando significativamente i tassi di miglioramento) assegnando le limitazioni della chat entro 15 minuti dalla fine di una partita. Allo stesso modo, i giocatori limitati ora riceveranno punizioni crescenti mano a mano che le ottengono, invece di dover aspettare la fine delle limitazioni, in modo da sapere cosa li aspetta. \r\n●\tIl giocatore che commette l&#039;infrazione ora riceve un feedback diretto sul suo comportamento. I giocatori ricevono delle comunicazioni ufficiali nel client, con le chat che gli altri giocatori hanno giudicato offensive.\r\n\r\nUltima nota: considerando l&#039;ampia portata di queste modifiche, tutte le limitazioni della chat e classificate verranno azzerate e le limitazioni passate non conteranno ai fini del nuovo sistema. Tutti ripartono con una fedina pulita (per quel che riguarda le limitazioni), quindi &egrave; un ottimo momento per iniziare a comportarsi bene. \r\n\r\nQueste modifiche verranno attivate nel corso di questa patch (5.18). Mi troverete qui nel thread per rispondere alle vostre domande. Fatemi sapere il vostro parere!","replies":[{"poster":"SireAngelus","date":"2015-09-15T21:10:15.345+0000","up_votes":6,"down_votes":0,"body":"ho un'idea, molto più funzionale e dinamica: al di là del ban per feeders che mi trova d'accordo (contrariamente a quello per afk, si dovrebbe trovare una soluzione per fare in modo che 4 rimanenti non si trovino in una situazione di svantaggio piuttosto).\nMettete il porcamiseria tasto REMAKE nel gioco. Prima di 40 secondi puoi votare se ANNULLARE la partita in caso di afk. Non capisco tutta questa ostilità contro questa funzione che ti semplifica la vita.  La stessa cosa dovrebbe esistere a fine champ select.\nPerché non instaurate un metodo che limita la chat automaticamente  PER QUELLA PARTITA in caso il sistema rilevi(in tempo reale) linguaggio abusivo?\nCosì non avete bisogno di preoccuparvi se il sistema fa errori( nessun errore permanente) la punizione è commisurata al crimine, migliora la qualità  del game. \n\n\nLe ranked restrictions sono uno strumento completamente inutile. Fanno solo venire voglia di abbandonare il gioco.","replies":[{"poster":"Bloody Axe","date":"2015-09-15T21:38:57.375+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=SireAngelus,realm=EUW,application-id=MJVj50Jw,discussion-id=Kev113OO,comment-id=0009,timestamp=2015-09-15T21:10:15.345+0000)\n\n Le ranked restrictions sono uno strumento completamente inutile. Fanno solo venire voglia di abbandonare il gioco.\n\nEsatto, sono completamente inutili anche a mio parere","replies":[]}]},{"poster":"BluFoxer","date":"2015-09-15T22:34:59.396+0000","up_votes":4,"down_votes":0,"body":"Wtf  quindi io che sono stato bannato due settimane,  rimango un avanzo di galera lo stesso?!?!?\n{{champion:9}}","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-09-15T18:57:48.651+0000","up_votes":3,"down_votes":1,"body":"Hai già risposto a questa domanda, Ymir, ma la rifaccio, giusto per essere sicuri.\nDa questa patch in poi, tutte le fedine tornano immacolate?","replies":[{"poster":"lucanomax1994","date":"2015-09-15T19:24:43.931+0000","up_votes":5,"down_votes":1,"body":"***","replies":[{"poster":"A Yordle ln Heat","date":"2015-09-15T19:39:22.024+0000","up_votes":2,"down_votes":3,"body":"Ho chiesto conferma.\nNon c'è bisogno di fare il butthurt.","replies":[]}]},{"poster":"Firenheit","date":"2015-09-15T19:28:23.984+0000","up_votes":1,"down_votes":1,"body":"Si, Common, tranne i ban. Chi è stato bannato per X giorni rimane \"sporco\".","replies":[{"poster":"UnknownEV","date":"2015-09-16T09:19:12.661+0000","up_votes":1,"down_votes":0,"body":"MA :I","replies":[{"poster":"Firenheit","date":"2015-09-16T09:20:39.894+0000","up_votes":1,"down_votes":0,"body":"lol?","replies":[{"poster":"UnknownEV","date":"2015-09-16T09:37:54.005+0000","up_votes":2,"down_votes":0,"body":"-Parlo di mesi fa- \n---\nNon voglio dire che non mi meritavo le 2 settimane di ban... \nHO flammato per una draft dove mi davano del °° (meglio evitare le parole che mi scrivevano).. e rispondendogli mi sono beccato queste due settimane.\n---\nOra dato che stanno implementando questo nuovo sistema... io... anche stando zitto e giocando tranquillo... ho paura dei piccoli report (inutili) che ogni tanto arrivano da giocatori \"arrabbiati\" o che a fine game ti danno il \"comportamento negativo\" anche senza fare nulla.\n---\nAllora io mi sono {{summoner:1}} Purificato u.u  xD \n\nè da quando mi hanno bannato che NON uso la chat, se non per \"gg\" SOLO per il mio team. \n\nE infatti non mi è arrivato più niente...ma ti giuro ho una paura che un piccolo \"report\" inutile mi faccia bannare... permanentemente... e dato che a \"noi\" non puliscono la fedina...Sono terrorizzato...\n---\nConsigli...? anche da Rioter se legge :c","replies":[{"poster":"Firenheit","date":"2015-09-16T09:44:42.293+0000","up_votes":2,"down_votes":0,"body":">Consigli...? anche da Rioter se legge :c\n\nAspettare l's6. \n\nNon sono mai stato bannato, quindi non so, però se questo, *i comportamenti negativi che li attivano (omofobia, razzismo, sessismo, minacce di morte e abusi verbali eccessivi) sono universalmente rifiutati dalla community *, è vero bisogna esagerare per ricevere un ban diretto XD","replies":[{"poster":"UnknownEV","date":"2015-09-16T09:55:49.312+0000","up_votes":2,"down_votes":0,"body":"Ok... allora sono più tranquillo... dato che NON scrivo più niente! :D\n---\nOvviamente gioco corretto...niente feed o afk °-°\n---\nCambio argomento!\nMa scusa... come fa il sistema a capire se stai fiddando  o se sei talmente pressato dal jungler nemico e ti ritrovi 0/7 XD\n---\nAnche se mi è capitato di morire una volta per errore...e mi sento dire \"OMFG stop FEED NOOB\" c:","replies":[{"poster":"Firenheit","date":"2015-09-16T10:23:15.084+0000","up_votes":1,"down_votes":0,"body":"Un esempio? Ghost, Homeguerd Teleport contro la base nemica, stai trollando.","replies":[]}]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2015-09-15T22:42:33.027+0000","up_votes":1,"down_votes":1,"body":"A saperlo prima avrei flammato molto di più oggi...","replies":[]}]},{"poster":"Pasticcionex","date":"2015-09-16T07:21:21.064+0000","up_votes":1,"down_votes":0,"body":"io ho una domanda, ma se io per caso flammo scrivendo il flame con numeri al posto di lettere tipo stup1d 1d10t ecc e mi reportano, conta come report o lo posso contestare? anche perchè teoricamente non significano niente!","replies":[{"poster":"Judge Drakoo","date":"2015-09-16T10:23:07.872+0000","up_votes":3,"down_votes":0,"body":"Se flammi, ti prendi le punizioni, e non ti vengono rimosse.","replies":[]},{"poster":"patmax17","date":"2015-09-16T14:25:32.174+0000","up_votes":1,"down_votes":0,"body":"La Riot ha già confermato che il sistema è abbastanza \"furbo\" da leggere (e punire) il leet, e anche le varie abbreviazioni e slang","replies":[]}]},{"poster":"Invisible Bonny","date":"2015-09-16T01:36:30.970+0000","up_votes":2,"down_votes":0,"body":"Nice, ero un flamer anche se ormai ho imparato a non farlo piu. \nPreferisco farmare e aspettare che finiscia l incarriabile game, piuttosto che rischiare di nn giocare piu.\nSpero che il sistema punisca anche a chi da report infondati. \nOggi ero trynda e contro avevo un gankplang che flammava in spagnolo in maniera esagerata. Offendendo mia madre ps conoso lo spanish. Ho rivecuto l avviso di report... troppe mazzate si e' preso in lane. Peero il rep sono stato io.\nSpero che cn questo clear le mie segnalazioni verrano prese piu in considerazione e nn mi arrivino piu segnaazioni di report no sense. \n\nI cold remember... hope","replies":[]},{"poster":"Firenheit","date":"2015-09-15T19:29:19.451+0000","up_votes":2,"down_votes":0,"body":"Una cosa non mi è chiara. \nIo che reporto, se il mio report (scusa la ripetizione) va a buon fine, ho un feedback che mi avvisa che quel giocatore è stato punito?","replies":[{"poster":"ViaMalinconiaN9","date":"2015-09-15T20:08:17.650+0000","up_votes":2,"down_votes":0,"body":"Si ^^ grazie a dei miei report 2 giocatori sono stati puniti <)^^(>","replies":[{"poster":"Firenheit","date":"2015-09-15T20:16:42.192+0000","up_votes":2,"down_votes":0,"body":"Bannati o limitati?\nAdesso per i ban arriva l'avviso della punizione in porto (mi è arrivato solo una volta l'avviso, anche se ho reportato gente che offende le mamme a gogo, ma ok), ma da domani arriverà anche per le limitazion chat?\nIo pretendo che se mi scrivono *\"stfu\"* e reporto, questi vengano puniti e voglio saperlo.","replies":[]}]},{"poster":"UltraLion","date":"2015-09-16T08:45:03.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=Kev113OO,comment-id=0003,timestamp=2015-09-15T19:29:19.451+0000)\n>\n> Una cosa non mi è chiara. \n> Io che reporto, se il mio report (scusa la ripetizione) va a buon fine, ho un feedback che mi avvisa che quel giocatore è stato punito?\n\nSarebbe figo, ma non c'è scritto nel post","replies":[]}]},{"poster":"Sorcio84","date":"2015-09-15T19:23:20.282+0000","up_votes":1,"down_votes":0,"body":"Allora se non ho capito male, se io scrivo\nomg noob useless unistall 0/10/2 best euw !!!\n\nmi arriva un avviso che dice : hai scritto omg noob... ed è un comportamento tossico, e vado verso la restrizione.\n\nSe invece scrivo\n\nplease play safe don't die and wait me for help\ne mi segnalano, ho comunque la finestrella che mi avvisa, e in caso di restrizione posso fare ricorso mostrando quelle finestrelle (in casl di vero rage report), anche se il sistema dovrebbe riconoscere un testo ok da uno tossico\n\nInsomma, questo dovrebbe risolvere almeno in parte, le false segnalazioni e/o il rage report, perchè vedi dove (teoricamente) hai sbagliato.","replies":[{"poster":"73668109_DEL","date":"2015-09-15T19:57:34.544+0000","up_votes":2,"down_votes":0,"body":"No , da come ho capito da qui ---->http://euw.leagueoflegends.com/it/news/game-updates/player-behavior/potenziamenti-al-feedback-istantaneo\nE come prima una piccola frase che dice sei stato bananto per : linguaggio offensivo e poi il chat log SOLO delle tue frasi , indistintamente fra quelle \"consentite\" o meno.\nIn sostanza cambia solo che non ti arriva la mail , ma direttamente nel client.\n\nSe sbaglio liberi di contraddirmi.","replies":[{"poster":"Sorcio84","date":"2015-09-15T23:10:05.534+0000","up_votes":1,"down_votes":0,"body":"beh contraddirti no, ma io avevo letto\n\n* con le chat che gli altri giocatori hanno giudicato offensive.\n\nquindi pensavo che ti mostrasse anche altro oltre a quello che hai gia citato tu","replies":[]}]}]},{"poster":"Bloody Axe","date":"2015-09-15T21:42:13.779+0000","up_votes":2,"down_votes":1,"body":"FINALMENTE RIOT, MI VIENE DA PIANGERE","replies":[]},{"poster":"Thix","date":"2015-09-15T18:58:02.887+0000","up_votes":2,"down_votes":1,"body":"Perché la fedina viene ripulita?\nIo ho ricevuto due restrizione della chat da 75 partite, perché dalla 5.18 è come se fossi uno che non ha mai flammato?\nChiedo perché non mi sembra corretto nei confronti di chi ha sempre rispettato le regole.","replies":[{"poster":"Nibbio Bianco","date":"2015-09-15T19:03:56.403+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Thix,realm=EUW,application-id=MJVj50Jw,discussion-id=Kev113OO,comment-id=0001,timestamp=2015-09-15T18:58:02.887+0000)\n>\n> Perché la fedina viene ripulita?\n> Io ho ricevuto due restrizione della chat da 75 partite, perché dalla 5.18 è come se fossi uno che non ha mai flammato?\n> Chiedo perché non mi sembra corretto nei confronti di chi ha sempre rispettato le regole.\n\nPerché è un nuovo sistema. In Italia c'è una legge che permette ai carcerati di uscire dalla galera se cambia qualche legge che nell'anno in cui è uscita li facevano rimanere in galera. Non ricordo il nome di questa legge, ma l'insieme del tutto si chiama Democrazia.","replies":[{"poster":"StayM","date":"2015-09-15T19:47:53.163+0000","up_votes":2,"down_votes":1,"body":"principio di irreatroattività della legge penale sfavorevole","replies":[]},{"poster":"Giovarco","date":"2015-09-15T19:33:26.303+0000","up_votes":1,"down_votes":0,"body":"Sarebbero chiamate, in generale, leggi retroattive, se non ricordo male.","replies":[]}]},{"poster":"73668109_DEL","date":"2015-09-15T19:57:55.260+0000","up_votes":1,"down_votes":0,"body":"Per celebrare il gioco positivo, i giocatori che non hanno ricevuto limitazioni della chat o classificate o non hanno ricevuto ban negli ultimi tre mesi riceveranno un'esclusiva icona dell'evocatore. Potete aspettarvi di vedere l'icona nel vostro account entro il giorno 5.19.\nSaremo qui nei commenti per rispondere alle vostre domande!\n\nChi è stato corretto verrà premiato quindi stop cry xD","replies":[]}]},{"poster":"JollyJack360","date":"2015-09-27T09:19:06.541+0000","up_votes":1,"down_votes":0,"body":"Non ho capito una cosa, se per caso dopo una partita uno è coosì arrabbiato da reportare il compagno, ma sbaglia righa, reportandone un altro, questi passa i guai?\ninoltre in caso di errore nel sistema  cosa succede?","replies":[]},{"poster":"OnlySimo","date":"2015-09-16T16:39:25.485+0000","up_votes":1,"down_votes":0,"body":"Spesso mi è capitato di abbandonare una partita perché la connessione saltava o per problemi di server e via dicendo, non ho mai preso e sono andato afk di mia spontanea volontà; a tal proposito volevo chiedere, dato che si stanno apportando molte migliorie, se c'era un sistema che riconosceva chi andava volontariamente afk oppure no. Abbandonando la partita fino ad oggi mi sono ritrovato con le code a bassa priorità, punizione che posso comunque accettare dato che ero afk (non volutamente) ma comunque afk, non vorrei che ora mi ritrovassi con un ban per problemi non riconducibili a me !!! Grazie a tutti per le risposte :)","replies":[{"poster":"Firenheit","date":"2015-09-17T10:25:46.474+0000","up_votes":1,"down_votes":0,"body":"Risponderò con la più totale calma. \nLasciare per una partite crea un danno ai giocatori che vengono methati con te e teoricamente anche agli avversari. In pratica rovini mediamente 40 minuti di game a 9 persone.\nOra, a prescindere se il tuo AFK è intenzionale o meno, il risultato è sempre lo stesso, quindi è giusto che il sistemi ti allontani per non buttare altre partite. \nLa coda limitata, punizione per gli AFK, non influisce sulla perdita dei premi ecc, perché, appunto, magari non intenzionali.\nDovete capirla, però, questa cosa: se la vostra connessione di salta, dovete smettere di giocare PVP per rispettare si voi, ma soprattutto per non far perdere tempo ad altre 9 persone che vogliono farsi una partitina.","replies":[{"poster":"OnlySimo","date":"2015-09-17T11:52:32.636+0000","up_votes":1,"down_votes":0,"body":"Capisco quello che dici ma non posso prevedere quando succede !!! E quando succede vado a fare, prima di tornare in PvP, un game con bot/personalizzato così da vedere se posso riprovare a giocare o meno così da rovinare altri game. La mia connessione comunque non ha quasi mai dato problemi rilevanti solo che ogni tanto fa i capricci e io questo come già detto non posso prevederlo !","replies":[{"poster":"Firenheit","date":"2015-09-17T12:15:43.237+0000","up_votes":1,"down_votes":0,"body":">ma non posso prevedere quando succede\n\nEd è per questo che non succede niente per una volta :)\nSi è puniti quando si è recidivi, ovvero quando persisti nel giocare pur sapendo che la tua connessione potrebbe saltare da un momento all'altro :)","replies":[]}]}]}]},{"poster":"HolySmite Jack","date":"2015-09-16T16:49:19.462+0000","up_votes":1,"down_votes":0,"body":"Vorrei chiedere una cosa ai rioter...oggi ho giocato male una ranked con vayne..e mi hanno reportato...non c e il rischio ban/chat ristrette per questo giusto?","replies":[]},{"poster":"73668109_DEL","date":"2015-09-15T19:44:33.717+0000","up_votes":1,"down_votes":0,"body":"Complimenti per aver capito almeno questo passaggio finalmente.\n\"Altri ancora ricevono le limitazioni della chat, ma non sanno quali comportamenti sono stati reputati non accettabili dagli altri giocatori, quindi non sanno come migliorare.\"\n\nNon vi sembra un po' troppo passare da 25 chat restricted a 2 settimane di ban ?","replies":[{"poster":"Firenheit","date":"2015-09-15T20:19:19.183+0000","up_votes":1,"down_votes":0,"body":"Se flammi, ed è vero che lo fai, due avvertenze, sono più che sufficienti. \nMi chiedo, però, se il contatore si azzera.\nSe prendo una limitazione a Gennaio e una a Ottobre, si sommeranno oppure saranno entrambe da 10 partite?","replies":[{"poster":"Glar","date":"2015-09-16T13:14:10.937+0000","up_votes":1,"down_votes":0,"body":"Ciao Firenheit,\n\nposso confermarti che su ogni account verranno registrati permanentemente tutti i comportamenti negativi che ha avuto nel tempo.\nMa allo stesso tempo terremo in considerazione anche tutti quei giocatori che hanno dimostrato un miglioramento nel loro comportamento nel tempo tra una punizione e l'altra ;)","replies":[{"poster":"Firenheit","date":"2015-09-16T13:28:53.767+0000","up_votes":1,"down_votes":0,"body":"Un po' come le punizioni per AFK, afferrato e grazie ;)","replies":[]}]}]}]},{"poster":"SIRIUS BLACK 92","date":"2015-09-16T09:28:55.651+0000","up_votes":1,"down_votes":0,"body":"Io sono un big flamer, mi toccherà togliere la chat dal gioco maledetti Ahah","replies":[]},{"poster":"Menfrix","date":"2015-09-16T08:02:06.917+0000","up_votes":1,"down_votes":0,"body":"Ooooeeee,  italian Style, condono per tutti...\nVa beh, vedremo come funzionerà, almeno alla terza si inizia a bannare...\nCerto, quello che fa strano è che dopo una revisione all'assegnazione dei premi di finestagione ci sia il condono... son troppo buoni alla riot.","replies":[]},{"poster":"Frattaglia","date":"2015-09-16T07:48:11.167+0000","up_votes":1,"down_votes":0,"body":"Io avrei aspettato la quinta punizione per dare il ban permanente, ma mi sembra comunque un'ottima miglioria!","replies":[]},{"poster":"StayM","date":"2015-09-15T19:51:23.931+0000","up_votes":1,"down_votes":0,"body":"Fantastico, letteralmente fantastico, finalmente mai più gente con 1200 chat ban che continuano a flammare, \nbrace yourself, Ban-hammer is coming.\n\nL'unica cosa che un attimo mi turba è il 25 chat --> ban diretto \nInoltre se una persona ottiene il ban da 2 settimane e poi, dopo 1 anno che non riceve altre segnalazioni, ne riceve un'altra, avrà il permaban lo stesso? o c'è un periodo di redenzione? (stile punti della patente?)","replies":[{"poster":"Sorcio84","date":"2015-09-15T23:11:16.595+0000","up_votes":1,"down_votes":0,"body":"io spero in un periodo di redenzione D:","replies":[]}]},{"poster":"imaDeftpie","date":"2015-09-15T19:37:53.760+0000","up_votes":1,"down_votes":0,"body":"curiosità: anche chi ha le ranked ristrette torna a giocare ranked? e chi ha la coda di 20 minuti tra una partita e l'altra?","replies":[{"poster":"Ste the ripper","date":"2015-09-15T22:43:27.405+0000","up_votes":1,"down_votes":0,"body":"le code afk non sono mai state collegate alle limitazioni sul comportamento, non credo che cambierà qualcosa ora.","replies":[]}]},{"poster":"IDontMainLulu","date":"2015-09-15T21:13:28.611+0000","up_votes":1,"down_votes":0,"body":"finalmente... era ora che mostraste ai giocatori le ragioni precise delle loro punizioni... altrimenti facile dare limitazioni a caso in base ai report... ora bye bye a quelli che reportano x abuso verbale così tanto x...","replies":[]}]}