{"poster":"diabetín","date":"2019-12-31T10:05:09.337+0000","title":"\"como podes perder linea contra un yasuo\"","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"que onda que siempre que muero en los primeros 10 min contra un yasuo alguien me dice esto? osea sin importar mi campeón o si fue por algún gank siempre hay alguien que dice eso, y que onda? desde cuando yasuo es free win en los primeros 10 minutos (calculale que desde lvl 1 a 9)??\r\nla ultima vez que me pasó fue cuando jugaba yo con kassadin y el yasuo me mató a lvl 6, y ahi me puse a recordar la cantidad de veces que me dijeron eso, cosa rara porque nunca lo leí de otro campeón, solo de yasuo, asique que onda? por que piensan asi tantas personas? para mi la fase de lineas de yasuo no es tan free como muchos piensan","replies":[{"poster":"Zelos From Jonia","date":"2019-12-31T10:25:04.960+0000","up_votes":5,"down_votes":0,"body":"En realidad lo de \"yasuo es free win\" es porque es gankeable y predecible.\n\nPero no porque sea debil en linea, de hecho tiene un early fuertisimo. Pasa que muchos jugadores \"repiten cual loro\" pero jamas analizaron por que un jugador llega a la conclusion de que ganarle a yasuo es facil.","replies":[{"poster":"doomguy2003","date":"2020-01-01T00:35:21.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=BPbQg2nF,comment-id=0000,timestamp=2019-12-31T10:25:04.960+0000)\n>\n> En realidad lo de \"yasuo es free win\" es porque es gankeable y predecible.\n> \n> Pero no porque sea debil en linea, de hecho tiene un early fuertisimo. Pasa que muchos jugadores \"repiten cual loro\" pero jamas analizaron por que un jugador llega a la conclusion de que ganarle a yasuo es facil.\n\nEs facil por varias razones (algunas las acabas de decir)\n\n-1: Super gankeable (no tiene escape a ganks)\n-2: La mayoria de yasuos en elo bajo son malardos jugando","replies":[]}]},{"poster":"Dalahsurfal","date":"2019-12-31T11:14:08.037+0000","up_votes":2,"down_votes":0,"body":"En realidad es porque la mayoría de Yasuos \"mains\" de low elo son malos con el campeón y suelen pushear y regalarse en linea sin visión, morir y flamear al jungla.\nY vaya si me habrán tocado de esos, solo algunos pocos con un millon que son platino o diamante han sido dignos adversarios.","replies":[{"poster":"diabetín","date":"2019-12-31T12:39:37.528+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dalahsurfal,realm=LAS,application-id=v7qsfXsE,discussion-id=BPbQg2nF,comment-id=0001,timestamp=2019-12-31T11:14:08.037+0000)\n>\n> En realidad es porque la mayoría de Yasuos \"mains\" de low elo son malos con el campeón y suelen pushear y regalarse en linea sin visión, morir y flamear al jungla.\n> Y vaya si me habrán tocado de esos, solo algunos pocos con un millon que son platino o diamante han sido dignos adversarios.\n\nnormalmente me emparejan con oros y platinos, veo mas diamantes en mis partidas que bronces, yo creo que un platino ya deberia tener una idea de como usarlo (cabe aclarar que todos son m7, hace meses no veo un yasuo sin maestria)","replies":[{"poster":"Dalahsurfal","date":"2019-12-31T15:01:11.747+0000","up_votes":1,"down_votes":0,"body":"También se dice por los memes xD dudo mucho que gente de ese elo sea capaz de decirte algo así de forma seria y si lo hacen wow que pena.","replies":[{"poster":"diabetín","date":"2019-12-31T23:44:21.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dalahsurfal,realm=LAS,application-id=v7qsfXsE,discussion-id=BPbQg2nF,comment-id=000100000000,timestamp=2019-12-31T15:01:11.747+0000)\n>\n> También se dice por los memes xD dudo mucho que gente de ese elo sea capaz de decirte algo así de forma seria y si lo hacen wow que pena.\n\nbldo parecen homero simpson cuando se rie de que marge tiene problemas con el juego\n\"sali 0 14 de linea pero NO ES NADA PORQUE TU PERDISTE LINEA CONTRA UN YASUO, perdi bot contra un duo darius y garen pero NO ES NADA PORQUE TU PERDISTE LINEA CONTRA UN YASUO, tengo 17 minions en 15 minutos pero NO ES NADA PORQUE TU PERDISTE LINEA CONTRA UN YASUO\"","replies":[{"poster":"Dalahsurfal","date":"2020-01-01T02:04:21.419+0000","up_votes":1,"down_votes":0,"body":"Bueno jdjsa yo en lo personal nunca jodo con eso de los Yasuos solo decia causas que pensé serian las probables jaja. Pero que no te afecte si te dicen eso, ignora y ya.\n{{sticker:sg-ahri-2}}","replies":[]}]}]}]}]}]}