{"poster":"TheMostLegend","date":"2015-08-13T18:28:24.402+0000","title":"Folytonos hiba, majd büntetés 2 - Gondolkozás nem erősség","up_votes":1,"down_votes":4,"body":"Mivel oda nem tudtam le&iacute;rni ez&eacute;rt ide is le&iacute;rom. Mivel h&aacute;t le lettek tiltva a hozz&aacute;sz&oacute;l&aacute;sok.\n\n\"folytonos hiba\"... gondolkozzunk... az azt jelenti hogy nem egyszeri!!! De zseni vagyok (m&aacute;sokkal ellent&eacute;tben). Legal&aacute;bb a gondolkod&aacute;s sz&aacute;momra műk&ouml;dik!\n\nHa m&uacute;ltkor kaptam egy 5 tilt&aacute;st, &eacute;s egy nehezen gondolkod&oacute; szem&eacute;ly azt &aacute;ll&iacute;tja 1 alkalom&eacute;rt nem b&uuml;ntet a rendszer, akkor az esz&eacute;be se jut, hogy ez a folytonos hiba, m&aacute;r előtte is fenn &aacute;llt. Vagyis mi t&ouml;rt&eacute;nhetett?\n\nKonkr&eacute;tan egy alkalom&eacute;rt tiltott a rendszer, mert visszaesőnek n&eacute;zett, az&eacute;rt, mert 2-3 percn&eacute;l tudtam csak sokszor becsatlakozni a j&aacute;t&eacute;kba. Ami ugye nem l&eacute;nyeges hogy lvl 2-&ouml;n megyek be, mert akkor m&eacute;g nincs d&ouml;ntő f&ouml;l&eacute;ny, ez&eacute;rt sem adtam neki eddig hangot. Meg egy&eacute;bk&eacute;nt sem gondoltam hogy ez inaktivit&aacute;s a LeaverBustern&eacute;l hiszen ez hiba&uuml;zenet! De most eg&eacute;szen hossz&uacute; ideig nem v&aacute;laszolt a szerver, ami megint nem n&aacute;lam keresendő, maximum az internet szolg&aacute;ltat&oacute;mn&aacute;l!\n\nSz&oacute;val az ilyen bunk&oacute; hsz-es lez&aacute;r&aacute;sokat l&eacute;gysz&iacute;ves mellőz&uuml;k a j&ouml;vőben, mert &uacute;gy t&uuml;ntetnek fel engem mintha &eacute;n visszaeső afkol&oacute; lenn&eacute;k mikor k&ouml;zben 1 &eacute;v alatt 1x v&eacute;gigafkoltam egy meccset. H&uacute; de rendszeres visszaeső vagyok! Ez&eacute;rt is kaptam m&eacute;g r&eacute;gebben 1-2 h&oacute;napja pozit&iacute;v &uuml;zenet a klienstől, hogy javult a fi&oacute;kom &aacute;llapota, mivel a szokatlann&aacute;l kevesebbszer vagyok inakt&iacute;v! \n\nHa gondolod ezt is z&aacute;rhatod mert neked ez a szok&aacute;sod. M&aacute;r &iacute;rtam az &uuml;gyf&eacute;lszolg&aacute;latnak, mivel itt egyből z&aacute;rj&aacute;k a topicot, h&aacute;tha ott mondanak valami okot arra, mi&eacute;rt is van ez a hiba, mert hogy n&aacute;lam minden rendben az is biztos.\n\nAzt  meg külön kiemelem hogy attól hogy a drága zöldnevünknek nincs hiba a gépén (egy sem) akkor miért van ennyi visszajzés ebben a fórumrészben? Azt nem mondhatod hogy mindenki maga tehet a hibáiról, hiszen sokszor ott egy 3. személy is, internet szolgáltató nevében.\n\nTiszta logikátlan a gondolkodás és a felvázolás. Csak én fogom a fejemet.","replies":[{"poster":"Looter","date":"2015-08-14T08:02:33.757+0000","title":null,"up_votes":4,"down_votes":1,"body":"\"De zseni vagyok (másokkal ellentétben). Legalább a gondolkodás számomra működik!\"\n\nLáthatóan nem.","replies":[]},{"poster":"EUNE gets Rekt","date":"2015-08-13T19:07:08.862+0000","title":null,"up_votes":2,"down_votes":0,"body":"A gondolkodásom logikus, ezt csak bizonyítja az, hogy azt állítod, minderről a szolgáltatód tehet.\n\nAkkor nézzük meg, hogy miről is van szó:\n\n1. Tiltást kaptál\n2. Késve érkeztél a meccsre\n3. A rendszer joggal nézett visszaesőnek, hiszen ez többször fordult elő\n4. Állításod szerint a szolgáltatód a ludas.\n\nHa viszont a szolgáltatód a ludas, akkor miért ide írsz? Miért nem őket hívod fel? Effektíve nekem ehhez mi közöm van?\n\nÉs nem, az adminok nem (csak) azért vannak, hogy segítsék a többi játékost, bármilyen meglepő, arra ott van a Játékostámogatás.\nNem oktattam ki senkit, tényeket és a többi témából összeszedett konzekvenciákat közvetítettem.\n\nValamint bármilyen érdekes, hónapok óta hibaüzenetek és crash nélkül játszok. (Mondjuk rendben is tartom a rendszerem.)","replies":[{"poster":"TheMostLegend","date":"2015-08-13T19:17:01.405+0000","title":null,"up_votes":1,"down_votes":0,"body":"Eredeti oprendszerem van eredeti vírusírtóval és nem vagyok mezei user, mert programozást tanultam és alapszinten mellette rendszergazdai alapokat is. Az én gépem 100%-ban friss, hibátlan stb.\n\nNem tudom hogy ők-e a ludasok, csak tippelni tudtam, mivel tudom hogy a hiba nem nálam van. (arról nem is beszélek hogy másfél évig dolgoztam \"karbantartóként\" ahol vállalati gépeket ráztunk helyre, és javítottunk meg.) DE ha egyszerűen nem nálam van a hiba, nem én tehetek róla.\n\nAzóta van amióta bejött az új kijelző még úgy hogy rankeden nem volt elérhető.","replies":[{"poster":"Naixx","date":"2015-08-13T19:47:54.926+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha nem nálad van a probléma és az internetszolgáltatód a ludas akkor is te a felelősséged, hisz biztosítanod kell a megfelelő internet kapcsolatot is és ha ezt nem tudod akkor ne játssz, mert mások játékát teszed tönkre. Ha folyamatosan ilyen problémád van hívd fel a szolgáltatót és próbálj velük kompromisszumba lépni, ha ez nem megy akkor válts másikat.","replies":[{"poster":"TheMostLegend","date":"2015-08-13T20:02:32.008+0000","title":null,"up_votes":1,"down_votes":0,"body":"Még pár hónapig nem lesz itt Telekom, vagyis Monopolhelyzet miatt ott maradok ahol vagyok.\nNincs választási lehetőség, max a mobilnet, de az még a WiFi-nél is rosszabb.","replies":[{"poster":"Invisible Dye","date":"2015-08-13T22:05:56.503+0000","title":null,"up_votes":1,"down_votes":0,"body":"Csak nem 29-es körzet?!? ^^\nÉn már várom a telekomot, de nagyon. upc meg mehet ahova gondolom.","replies":[]}]}]}]}]},{"poster":"EUNE gets Rekt","date":"2015-08-13T20:54:21.361+0000","title":null,"up_votes":1,"down_votes":0,"body":"Tudtommal meg van.","replies":[{"poster":"TheMostLegend","date":"2015-08-14T05:10:07.154+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lényegtelen. Az még szarabb mint a WiFi és a WiFi sincs az ajánlott kapcsolatok listáján.\nArról nem is beszélek hogy unokatestvérem telekomos, és csak funkciós korlálatlan van:\npl emailre, TV-re stb. egyedül éjszaka van 00-tól 7-ig olyan tematikus mobilnet ami korlátlan ami ezt is érinti.\n\nDe tökmindegy, mert akkor meg azért jönnék ide -  ami értelemtelen lenne, mivel szolgáltatói hiba - mivel folyton megszakad a kapcsolat.","replies":[]}]},{"poster":"EUNE gets Rekt","date":"2015-08-13T20:04:50.346+0000","title":null,"up_votes":1,"down_votes":0,"body":"Játszottam már T-Mobile-os mobilinternetről, stabil 70 ms Latencym volt. Csak egy korlátlan díjcsomag kell hozzá. :D","replies":[{"poster":"TheMostLegend","date":"2015-08-13T20:23:00.389+0000","title":null,"up_votes":1,"down_votes":0,"body":"De ha megszakad egy percre ugyanaz lesz a helyzet. Korlátlan díjcsomag tudtommal meg nincs mobilnetnél.","replies":[]}]},{"poster":"sz1sz1","date":"2015-08-13T18:51:05.646+0000","title":null,"up_votes":1,"down_votes":2,"body":"neked is ezt dobja ki? mellesleg én írtam a játékostámogatásnak és elküldtem a szükséges fájlokat. 4 napja várok a válaszukra eddig semmi. \n\nKedves EUNE gets Rekt!\n\n\"A játékban való részvételhez neked kell elégséges feltételeket biztosítani.\"  Ehhez annyit hozzá tennék hogy nem hiszem hogy nálunk van a probléma ha több embernek is rossz a játék. Szerinted mindenképp a játékos hibás ha szar a szerver? új patch óta egy percet nem tudtam játszani azelőtt tökéletesen ment a játék.\n\nU.i.: Azt hittem az adminok azért vannak hogy segítsék a többi játékos nem pedig hogy fennhangon kioktassák és egy tudatlan baromnak állítsák be.","replies":[{"poster":"Zooty","date":"2015-08-13T20:06:04.368+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én inkább úgy fogalmaznék hogy típushibáról van szó. Hidd el, ha a szerverrel lenne gond, akkor senki se tudna játszani.\nAz a hibaüzenet amit kaptál rengeteg hibát lefed, lehet hogy neked teljesen más problémád van, mint egy másik játékosnak, aki \"sikertelen csatlakozás\" hibaüzenetet kapott. Pontosabb diagnózist a játék naplófájljaiból kaphatunk.\nIlyenkor mi azért linkelgetjük a szokásos tudásbázisos linkeket, mert azok a problémák javarészét lefedik. Ha viszont ezek a cikkek sem segítenek, akkor jön a játékostámogatás, és az említett naplófájlokból próbálják kideríteni, hogy hol lehet a probléma.","replies":[]},{"poster":"Lashrath","date":"2015-08-13T19:03:03.992+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha a szerver lenne szar akkor senki nem tudna játszani - nem így van... innentől kezdve a hiba vagy nálad vagy a szolgáltatódnál van. És ettől aponttól igen is érvénybe lét hogy neked kell teljesíteni a megfelelő feltételeket. Szerverhibát elenyésző számban láttam az elmúlt öt évben egy kézen meg tudom számolni. Volt napi rendszerességgel hibám pár hete mivel a UPC este 8 körül machinált az adatátirányítással. Nem szerverhiba volt - de nem tudtam játszani. - aki laptopról játszik, vagy gyengébb gépről, aki wifin vagy gyenge neten keresztül próbál feljutni, akinek valami lopott és így vagy úgy feltört oprendszere van, aki esetleg a drivereit nem frissíti, vagy nincsenek fent a különböző szükséges futtatófelületek... az tudja a hibát folyamatosan is produkálni és qq vagy nem qq de a támogatás nem fog belelátni a gépedbe. Van egy csomó tipp a oldalon hogy mit kell ellenőrizned hogy megfelelően működik-e.","replies":[]}]},{"poster":"EUNE gets Rekt","date":"2015-08-13T19:24:36.597+0000","title":null,"up_votes":1,"down_votes":0,"body":"Annyit segítek, hogy néhány hazai szolgáltató az esti órákban elérési útvonalat változtat. Ezért nem sikerül elérned a szervert.\nElég valószínű, hogy az Magyarország exkluzív probléma.\n\nAz, hogy ez összefügg-e azzal, hogy pont akkor jelentkezett a probléma, amikor bejött az új HUD, abban nem tudok segíteni. De az is lehet, hogy csak egy véletlen bagatel egybeesés.","replies":[]}]}