{"poster":"XShadowAlkX","date":"2014-10-26T02:31:58.907+0000","title":"How do.you land a skillshot?","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"I started playing ranked today and I made the mistake of comparing it to.draft pick. Ranked is a whole new level and I experience extreme frustration. My first ranked game I was able to get mid and I played malzahar who is the champion I'm the best with since I've played him a long time. I won my lane and we won the game. However, my next ranked game I lane against a kayle. It was frustrating, kayle dodged every skillshot (even my e) I didn't miss he just dodged them. Kayle had 0 skillshots to dodge so I was completely at their mercy. \n  I want to know when is the best time to land a skillshot? Obviously whenever I threw one it was easily avoided so.it wasn't the right time. Is there any secret to landing one? Any tips are greatly appreciated.\nEdit: I was lux","replies":[{"poster":"Squirvizard","date":"2014-10-26T16:42:00.915+0000","up_votes":1,"down_votes":0,"body":"You typically want to harass your opponent when they go for CS. Look at your minions health, when one goes low, they're going to auto attack it for gold, this is your chance to get your trade, than back off. If you keep making good trades consistently, you will get a lead on them and possibly translate that into a kill.\n\nThe Kayle was probably side-stepping or backed off right as soon as she cast her ability on you, to potentially avoid your damage. You may have to time your skillshots better as they go for cs, or try to pick up on movement patterns, which means watching your opponents movements closely to better predict where they will move, and place your skillshot there. Maybe he likes to keep moving in the direction he initially meant, maybe he likes to mix it up and turn back around. It's a big mind game.\n\nIf anyone trades you, always trade back with your abilities. If you're auto attacking a cs as they're trading you, you will not be able to auto attack them back for a while, but you can still cast skills.\n\nYou can't land every skillshot, but landing them consistently, and dodging consistently can get you a pretty significant lead over your opponent. \n\nJust keep practicing with skillshots, eventually you'll get so good at it, it'll be almost burned into your brain.","replies":[]},{"poster":"Kuroi86","date":"2014-10-26T04:18:48.985+0000","up_votes":1,"down_votes":0,"body":"Throwing your shots when they CS is a big must with skill shots.  The most important part though is to practice.  Practice threading your shots through minions, practice leading your target and aiming just ahead of them.  Practice hitting max range shots to improve your understanding of the mechanics of your particular skill shot.  Practice, practice, practice!","replies":[]},{"poster":"Chewbacca Merkin","date":"2014-10-26T03:56:47.956+0000","up_votes":1,"down_votes":0,"body":"Whenever they go to take farm theyre prone for a fraction of a second. Otherwise, if ping is over 80 i wouldnt use lux,","replies":[]},{"poster":"OmniMoto","date":"2014-10-26T02:56:40.247+0000","up_votes":1,"down_votes":0,"body":"Lux is a very hard champion to skillshot with (I have played her once, and those skillshots are very difficult to hit being slow and decently thin). So don't bring yourself down too hard for one bad game. Here are a few tips that I use to help your skillshots (I play Ahri a lot so trust me, I can land a skillshot xD).\n\n1. One of the best times to hit an enemy with a skillshot is when they are going in for a last hit, if you time it right, just as the (in your case, sword of kayle) starts to swing or you know it is about to. Such as when you see her walk towards a minion that is low to last hit it.\n\n2. Another great time is when they are parallel to you in lane (on the same side of the minion wave) It is less effective than the last tip but it sure helps.\n\n3. NEVER, EVER, EVER, UNDER 99.8% CIRCUMSTANCE, should you fire a (I forgot which spell it is for lux, but in general, shots that hit one target and go in a straight line, such as morgana's bind) Linear lone target shot at an enemy when their minions are between you and them.\n\n4. Practice, Practice, Practice. Timing is everything will skillshots (other than angle, of course), If you shoot a skill to early, it goes ahead of the enemy, too late, it goes behind.  Get a friend (if you have one, if not just add me-  motomaster654 and I could help you as well) to join a 1v1 custom game with you, both of you skillshot champs (Ahri and lux for example). And play as if it were a normal game, but both of you just bring 5 mana pots, and 5 health pots, as you will need the mana and health, as you will be shooting shots at each other for however long, keep farming like usual, just play, but shoot more shots than usual. (Also get blue buff for each player, help each other out and leash it to one another for more mana and cdr.\n\n5. Remember, even if you are challenger, and in the lcs, pro mid laner skill shot champion worlds behind the back roundabout kick in the face sorta badass, YOU WILL MISS, missing skills is a part of the game, also remember that some people spend a lot of time just practicing dodging skill shots of all sorts.\n\n6. And lastly, there is no \"secret recipe\" or \"perfect way to do things\". Every person that you see that is good at skillshots just understands how they skillshot, how their champions skillshot.\n\n7. One last tip, notice if the enemy dodges left or right, forwards or backwards when you shoot a skillshot from a certain direction, everyone has a habit of some sort (probably). For me, I frequently dodge left or backwards, try and shoot it where you THINK they will go, not where you want them to, not where they are.\n\n\nI hope this helped!","replies":[]},{"poster":"AbyssionKnight","date":"2014-10-26T02:52:50.254+0000","up_votes":1,"down_votes":0,"body":"Without video it's hard to say what you did wrong. \n\nSkillshots are really about mindgames. You're trying to anticipate where your target is going to be, and tossing your skillshot to hit them at that future location, while they're trying to confuse you and juke the skillshots. \n\nI assume you know that basic, and how in a gank to use skill shots to coral a target so that if they do juke your bind, they're moving in a direction that puts them away for their turret / team / safety, and in a place they're more vulnerable. \n\nWith Lux, especially at lower elo's, remember your bind hits two targets. Most people just stay behind minions to dodge skillshots, and you can abuse that habit with your bind, hitting a minion and then your enemy with the second binding. \n\nUsing your e slow to help your q also works rather well, though if people are easily dodging your e, it sounds like you aren't positioning it optimally and giving them easy avenues of escape.\n\nSince skillshots are mind games, the best time to land them is when your opponent doesn't expect it. Like using a skillshot when they move in to last hit. Early on a kayle can't keep her e up constantly, so you have opportunities where you know exactly where she's going to be positioned and can punish her for it.  It's also good to realize that you don't necessarily have to spam your abilities punishing them. Sometimes scaring them enough that they zone themselves from cs is better than being oom and having them shove to your tower. For champions like lux, getting jungle assistance early can really make that fear factor apply better. \n\nBeyond the above it's really just practice that makes you better at skillshots. \n\nI'm far from an expert, having only reached as high as silver 3, but at least at my level of skill the above seems to work well, though maybe a diamond or plat will tell you to completely disregard what i've said. I dunno. O_o;","replies":[]},{"poster":"2000boxes","date":"2014-10-26T02:49:30.265+0000","up_votes":1,"down_votes":0,"body":"Throw your e out as lux and when they are getting ready to sidestep throw your q where they are heading","replies":[]}]}