{"poster":"You Got My Name","date":"2016-01-20T16:40:30.230+0000","title":"Dynamic Q oder lieber das \"only Solo Q\" ?","subforum":"Allgemeiner Chat","embed":{"description":"Today's red post collection includes an update on the 2016 ranked season and dynamic queue including the announcement of a solo only (no duo!) queue for the upcoming season, a look at the champions and skins that will be on sale in February, context on the recent Rengar PBE changes, a grab bag of red posts from , a 30% off hoodie sale in the merch shop, and more!","url":"http://www.surrenderat20.net/2016/01/red-post-collection-update-on-dynamic.html","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":1,"down_votes":1,"body":"Hey,\r\nder eine oder andere weiss es vll, aber in verlauf der n&auml;chsten Wochen bekomme wir die m&ouml;glichkeit &quot;only soloQ&quot; zu spielen.\r\n(siehe surrender at 20 link)\r\n\r\nDa frag ich mich :&quot; was soll ich nun spielen ? Dynamic oder solo ?&quot; wie z&auml;hlt was usw.\r\n\r\nWas w&uuml;rdet ihr spielen ?\r\n\r\nIch denke ich w&uuml;rde glaub auf only Soloq gehen. Da die Verteilung recht random sein kann wenn man alleine in Dynamic rein geht.","replies":[{"poster":"Trace Lost","date":"2016-01-20T16:47:27.315+0000","up_votes":2,"down_votes":0,"body":"ich werde wenn ich alleine bin SoloQ spielen und wenn meine Freunde da sind Dynamic.\n\nLG","replies":[]},{"poster":"Alustus","date":"2016-01-20T16:45:10.132+0000","up_votes":2,"down_votes":0,"body":"Da man sich nicht für eines der beiden Systeme entscheiden muss wahrscheinlich beides, wobei ich das Reine soloQ öfters nutzen werde, zumindest denke ich das.\n\nAußerdem bekommt man bei beiden Systemen eine eigenes Rating von daher sehe ich keinen Grund sich entscheiden zu müssen.","replies":[]},{"poster":"Patsí","date":"2016-01-20T16:44:56.772+0000","up_votes":1,"down_votes":0,"body":"Das kommt mit der Zeit denke ich mir. Je nach dem wie sich das DynamicQ etabliert, wie die Erfahrungen mit 4 premades 1 solo werden und welche die \"Haupt\"-Queue wird.\n\nAber beide Queues zu spielen wird vermutlich unendlich viel Zeit beanspruchen.\n\nMfG Wohpatsy","replies":[]}]}