{"poster":"Ivánzhito","date":"2017-07-02T01:03:08.667+0000","title":"¿Como puede ser que tenga un Elo tan malo?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hola como estan, quisiera hablar sobre sus Elos ya que el mio es literalmente un Asc... Ya que siempre no banean bien a un Champ y remontan a el ultimo momento, nunca NUNCA banean Vayne y lo que lleva esto es a &quot;Vayne Feed en Late&quot;... Despu&eacute;s no banean a Fizz y gana linea en todo el Early... Ustedes que tal su Elo :/ ? Consiguere un buen Duo ? Estare leyendo sus comentarios. :) {{champion:60}}","replies":[{"poster":"Grosero","date":"2017-07-02T03:45:04.475+0000","up_votes":1,"down_votes":0,"body":"El año pasado, que fue mi primera season, tenía un WR de 35% más o menos, no ayudaba a levantar las partidas y uno no se da cuenta de esas cosas. Este año tengo 60% de wr en soloQ y más de 50% en flex. Lo único que te puedo decir es que veas a jugadores de elos más altos jugando en X rol para que así puedas aprender más cosas, como controlar tu linea, como aprovechar los errores del enemigo, etc.","replies":[{"poster":"Ivánzhito","date":"2017-07-02T04:22:25.679+0000","up_votes":1,"down_votes":0,"body":"Gracias compa.","replies":[]}]},{"poster":"JPablo01","date":"2017-07-02T03:11:26.378+0000","up_votes":1,"down_votes":0,"body":"Como saber el elo?","replies":[]},{"poster":"Annie Botz","date":"2017-07-02T01:27:53.346+0000","up_votes":1,"down_votes":0,"body":"Es normal tener un elo malo si tienes un winrate de 28% xd\nRecuerda que ahora son 5 baneos y tu puedes banear lo que te parezca más roto, útil o quizás prefieres no banear nada.\n\nTe recomendaría jugar más en equipo (aunque en bronce es algo difícil) intenta hacer calls para objetivos, si sabes que los de bot no tienen flash y tu tienes tp puedes bajar y sacar kills.\nSi juegas de jungla puedes hacer un gank sorpresivo a lvl2 dependiendo del campeón que uses, si eres , mid puedes hacer roam e ir a top o bot, wardear la jg enemiga, buscar los puntos débiles.\n\nJuega con lo que sepas jugar y con lo que sepas que podrás ayudar en late, también es importante la composición, si el enemigo saca {{champion:412}} no debería sacar champs frágiles como {{champion:37}}.\n\n\nY por último deberías encontrar una linea que te acomode, ya que así tendrás más experiencia en esa linea a medida que juegas.","replies":[{"poster":"furikake","date":"2017-07-02T01:55:37.845+0000","up_votes":1,"down_votes":0,"body":"El primer consejo que te doy: APRENDE A JUGAR UN ROL/LINEA MUY BIEN.\nEl hecho de ir en ese rol en ranked te asegura que vos no la vas a cagar y vas a ir muy bien. El resto puede variar sin embargo vos vas a jugar bien siempre ;)\n\nEste es el mejor consejo para subir de liga ya que vas a mejorar tus decisiones y las mecánicas de los campeones asociados a tu rol.\nAunque tengas un rol principal, no descuides tu rol secundario ya que no siempre vas a ir en el principal. Enfocate en 2 roles que te diviertan y juega muchas partidas hasta que mejores.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Ivánzhito","date":"2017-07-02T02:00:25.921+0000","up_votes":1,"down_votes":0,"body":"Pues mucho me dicen que vaya mid, voy pero pocas veces gano y si voy, es Kayle o Ahri ya que las uso muy bien, o sino tengo la jungla con Udyr y Yi. Muchas gracias!","replies":[{"poster":"furikake","date":"2017-07-02T02:34:34.552+0000","up_votes":1,"down_votes":0,"body":"No importa lo que digan los otros: ¿en que rol te diviertes más y sientes que puedes ganar? es simple xD\nPrueba varios roles y fijate cual te gusta más.\n\nOtra cosa muy importante: adaptate a los cambios y no usen los mismos campeones siempre.\n\nPor ej: kayle hace mucho que ya no se usa en MID, en este momento hay mejores campeones para ese rol.\nConsigue más campeones para tu rol y úsalos según convenga cada momento, no te quedes con: uso X campeón muy bien.\n\n¿Quieres aprender a ganar más? Usa los campeones que estén más fuertes.","replies":[]}]}]},{"poster":"Ivánzhito","date":"2017-07-02T01:34:45.771+0000","up_votes":1,"down_votes":0,"body":"Gracias por la sugerencia :)!","replies":[]}]},{"poster":"Deigex","date":"2017-07-02T01:41:39.039+0000","up_votes":1,"down_votes":0,"body":"Con un winrate tan bajo como el tuyo,  en bronce 4 el problema no son los equipos, te recomiendo dejar de rankear hasta que aprendas las bases del lol y no sigas destruyendo tu mmr.\nConcentrate en una linea y un par de campeones que no requieran mucho mecanicamente por ejemplo annie en mid. Jugas un poco de todo y no jugas nada al fin y al cabo, mira gameplays, guias, en  el elo en el que estas si algo sobran son errores, aprende a detectarlos y beneficiarte de ellos y salis solo.","replies":[{"poster":"Ivánzhito","date":"2017-07-02T02:01:33.040+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias!","replies":[]}]}]}