{"poster":"Ninjá","date":"2016-10-14T06:06:00.233+0000","title":"Can't Creat a PBE account after being accepted? HELP :)","subforum":"[ARCHIVED] Help & Support","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/0a03588a560630376b3b46de5020903f","image":"https://i.gyazo.com/thumb/1200/_7e3f3532a9814e48ce3e83826002e363-png.jpg"},"up_votes":1,"down_votes":0,"body":"So i was logging into league like i do every day and i got a pop up saying u were accepted to PBE. I got rlly excited and rushed to my email and got an email saying i was accepted i click the link download the client but i haven't made and account and i couldn't figure out how to do it. eventually i remember i have to go to where i originally signed up to do it and that it should be on step 3 but it still says step 2 which is pending. i got every thing telling me i got in finally but i cant make an account, Im really excited to help you and i cant wait to become apart of the pbe community. PLS HELP ME RIOT. {{item:3070}} \r\n\r\nSorry about the other post it was sloppy and didnt make sense and i just wanted it to make sense so you can understand it sorry. :)","replies":[{"poster":"Porocles","date":"2016-10-14T17:32:03.362+0000","up_votes":1,"down_votes":0,"body":"The screenshot doesn't give a lot of context, but I do see it says alpha and not PBE.  Looking into your account, it looks like your PBE application was received but not yet accepted.  The Alpha and PBE are independent programs, so getting into one doesn't grant access to another.  For more information on getting setup on the alpha, check our the [alpha community boards](http://boards.na.leagueoflegends.com/en/c/alpha-client-discussion).  Hope that helps!","replies":[{"poster":"Ninjá","date":"2016-10-14T21:02:05.457+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=k2QL7vOI,comment-id=0001,timestamp=2016-10-14T17:32:03.362+0000)\n>\n> The screenshot doesn&#x27;t give a lot of context, but I do see it says alpha and not PBE.  Looking into your account, it looks like your PBE application was received but not yet accepted.  The Alpha and PBE are independent programs, so getting into one doesn&#x27;t grant access to another.  For more information on getting setup on the alpha, check our the [alpha community boards](http://boards.na.leagueoflegends.com/en/c/alpha-client-discussion).  Hope that helps!\n\nOh ok thanks for the help thats{{item:3070}}  disappointing lol","replies":[]}]},{"poster":"Zevrin","date":"2016-10-14T17:12:14.789+0000","up_votes":1,"down_votes":0,"body":"Hi,\nThe image you attached says welcome to the Alpha client. The Alpha client and the PBE are different things. \nI just got accepted to the Alpha client yesterday, and I'm really liking it. It uses whatever your normal account(s) are, and you log in as you do now, but everything before the game loading screen is updated and classier looking. (The store, your summoner page, hextech crafting, game lobby, etc.)\nWe are using it to see if there are any bugs that we run into while playing with it. \nHopefully that doesn't disappoint you :(","replies":[{"poster":"Ninjá","date":"2016-10-14T21:01:34.070+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zevrin,realm=NA,application-id=osqw6G4M,discussion-id=k2QL7vOI,comment-id=0000,timestamp=2016-10-14T17:12:14.789+0000)\n>\n> Hi,\n> The image you attached says welcome to the Alpha client. The Alpha client and the PBE are different things. \n> I just got accepted to the Alpha client yesterday, and I&#x27;m really liking it. It uses whatever your normal account(s) are, and you log in as you do now, but everything before the game loading screen is updated and classier looking. (The store, your summoner page, hextech crafting, game lobby, etc.)\n> We are using it to see if there are any bugs that we run into while playing with it. \n> Hopefully that doesn&#x27;t disappoint you :(\n\nOh ok thanks for the help thats fisappointing lol{{item:3070}}","replies":[]}]}]}