{"poster":"Nz Ballin","date":"2015-06-11T02:59:42.685+0000","title":"Exhaust questions","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":1,"body":"Does exhaust apply to effects cast prior to exhaust activated, ie dots or a spell in the air?","replies":[{"poster":"sparklefart","date":"2015-06-11T04:12:08.988+0000","up_votes":2,"down_votes":0,"body":"this is {{summoner:3}} ing","replies":[]},{"poster":"DiamondAries","date":"2015-06-11T03:11:01.000+0000","up_votes":2,"down_votes":0,"body":"Exhaust is a debuff, which means that once applied they have reduced stats. During the duration of Exhaust the enemy is slowed, has reduced resistances, and deals less damage. If you are talking damage wise, it means that damage from the exhausted champion is reduced from that moment (for example, if cast on Fiddle in the middle of his drain it will start dealing less damage over time) while they take more damage because of their reduced resistances (for example, say you were Fiddle and were draining someone. If they got exhausted in the middle of your drain, they would begin taking more damage).\n\nI was not quite sure what you were asking, but I hope this helps.","replies":[{"poster":"RLG Shaky","date":"2015-06-11T06:22:32.941+0000","up_votes":1,"down_votes":1,"body":"fiddle isn't a good example of what he means, he's asking if you exhaust a person, say zed and he's ult, and then once he lands from he's ult if you put it on him will the damage done to you be reduced?","replies":[{"poster":"DiamondAries","date":"2015-06-11T08:38:25.738+0000","up_votes":1,"down_votes":1,"body":"That is also a bad example, because Zed's ult is actually a debuff as well. Fiddle is a better example because his drain is just a simple DoT spell that is straight to the point.","replies":[{"poster":"RLG Shaky","date":"2015-06-11T13:34:54.681+0000","up_votes":1,"down_votes":1,"body":"yeah that true but i think maybe like a caitlyn ult if she fires it and just before it hits the person will it do less?","replies":[{"poster":"DiamondAries","date":"2015-06-11T23:06:04.908+0000","up_votes":1,"down_votes":1,"body":"If the person is exhausted before it hits then yes, it should do less damage.","replies":[]}]}]}]}]},{"poster":"BarryButcher","date":"2015-06-11T07:21:44.756+0000","up_votes":1,"down_votes":1,"body":"Yes. Because the resistances of the person exhausted are reduced by 10 therefore every time the DOT damage is calculated or \"ticks\" it does more due to the lower resistances regardless on when the spell was cast","replies":[]}]}