{"poster":"Linna Excel","date":"2015-11-05T22:48:37.311+0000","title":"Can I make a suggestion for Miss Fortune's passive?","subforum":"Gameplay","up_votes":17,"down_votes":11,"body":"Would she be OP if her old W passive was added into her new passive?\r\n\r\nYou do x magic damage per hit (builds up as you attack the same target).  If you switch targets, you get the change bonus and on the hit after that, if you hit the same guy again, the magic damage starts applying.  \r\n\r\nSo instead of forcing her to keep switching, she can switch and focus if she needs to.","replies":[{"poster":"Meddler","date":"2015-11-05T23:27:48.823+0000","up_votes":24,"down_votes":4,"body":"Forgive me if I'm misunderstanding you on this one, is the proposal that MF gets bonus damage for attacking a target repeatedly and for changing targets? Trying to understand what gameplay that drives if so, since initial reaction is that it just reads as 'attack whoever you'd normally attack and ignore the passive'.","replies":[{"poster":"A Tall Joke","date":"2015-11-06T00:36:40.584+0000","up_votes":8,"down_votes":3,"body":"What if her passive was a fusion of the two that still involves some decision making?\n\ni.e.\nMF deals bonus damage, ramping up, for every consecutive attack on a single target. When she switches targets, she deals bonus damage based on how much she ramped up before switching.\n\nThen, she's not forced to bounce between targets OR duel but instead this introduces a new decision making paradigm of \"when do I switch targets for the big BOOM\"\n\nIt also makes a clear window of power for her that she gets to ramp up.\n\nEDIT: Clarification- The idea was that she lost her stacks when she switched targets, using it for a single big attack.","replies":[{"poster":"junglerboy16","date":"2015-11-06T01:44:42.313+0000","up_votes":2,"down_votes":2,"body":"I like this a lot^\n\nIt may need some clarifying though, for instance, does the initial switch damage reset her stacks from the last target? If that's the case, then it actually punishes her very severely for switching targets frequently, which is kind of the opposite of what her current rework drives at (being a run-and-gun opportunistic markswoman who attacks whoever is within range). \n\nThis idea instead enforces an identity as a cleanup team fighter who's damage increases for each consecutive person she kills, which seems out of place with her identity.","replies":[{"poster":"A Tall Joke","date":"2015-11-06T18:44:12.467+0000","up_votes":1,"down_votes":0,"body":"It was meant to lose her stacks; she expends her stacks for a big attack.\n\nI don't think MF is much a hit and run style opportunistic gunner nor does this maker her clean up well (one stack expended shouldn't do much damage). Rather, it gives her a unique teamfight niche outside of her ult. It's interesting, I think to see what sort of strategies would arise but I can immediately see that one potential strategy would be to start going hard on the tank and ramp up stacks. This could actually discourage the rest of the enemy team to follow up if she successfully ramps up enough because then anyone who comes into range will take HUGE damage (ideally).","replies":[{"poster":"junglerboy16","date":"2015-11-06T22:44:38.779+0000","up_votes":1,"down_votes":0,"body":"No, she isn't a run-n-gun marksman currently, but that's what Riot said was there specific goal for her with this rework, so that's what I'm comparing your suggestion against.","replies":[{"poster":"A Tall Joke","date":"2015-11-07T02:16:37.716+0000","up_votes":1,"down_votes":0,"body":"I thought their goal was wombo combo marksman? I think her ult fits that well and having a ramp up attack, that prepares for burst, i think, would help that identity too.","replies":[]}]}]}]},{"poster":"Kitsuki05","date":"2015-11-06T03:48:47.922+0000","up_votes":1,"down_votes":3,"body":"any sort of passive that gives mf bonus damage for hitting the one target repeatedly will just be bad for her in terms of balance. The \"keep attacking targets\" is pretty much the goal for every ad carry, so gaining hidden damage for doing so just gimps her damage elsewhere to keep her from being too much of a bully. However, making so that switching her targets increases her damage, if executed properly, will make for an interesting dichotomy; continuously attacking a target that cannot defend itself is always the best course of action for any ranged carry, but in a situation where the target's threat increases, mf has more reason to harass them dangerously than any other carry. She gets bonus damage simply for firing off pot shots every now and then, meaning you prefer situations that allow you to hit and run, rather than ones where you must play it safe.\n\nTake for example Caitlyn's passive: Caitlyn gains a spike of damage for her next target, meaning suddenly it's worth a lot more risk to land a single attack on the enemy. Factor in the enemies' ability to back off from this aggression and you have yourself a meaningful challenge implemented into gameplay. In this situation mf's spike in damage is any time the enemy has not been hist last, however backing off is not a possible response to this effect, her buff will always be present. The only recourse is to be _more_ aggressive so that mf is forced to commit to losing fights, or is kept out of attack range.","replies":[{"poster":"A Tall Joke","date":"2015-11-06T18:49:55.507+0000","up_votes":1,"down_votes":0,"body":"I think spacing plays a huge role in playing against MF with the proposed passive. If you follow up on your tank immediately and invade her space, then you win. If your tank's been in there for a while, your follow up could end up with you dead. So, the game becomes more about timing your attacks and positioning (so that if she does have a big attack ready, you're not in range).\n\nI think single target ramp up damage isn't very invisible (see: Ursa from DotA). You can very visibly see her doing more damage as the fight goes on. It's satisfying and gives a good warning (when she chunks you, BACK OFF). In terms of meaningful counterplay here, the key point I think, in any fight with MF is to not let her ramp up. Don't let her ramp up her whole ult on your team. Don't let her keep her speed up so she can kite. Don't let her ramp up her passive. Just now, Double Up synergy with her passive got a lot cooler :D","replies":[]}]}]},{"poster":"unban swifty","date":"2015-11-06T07:08:22.181+0000","up_votes":2,"down_votes":0,"body":"What if the target-switch damage was based on how much she built up with the same-target damage?","replies":[]},{"poster":"Linna Excel","date":"2015-11-06T00:03:38.896+0000","up_votes":2,"down_votes":0,"body":"My thoughts at first were both.  You get the old bonus if you focus, but the new switch bonus when you switch.  Sort of like a a big hit for swtiching and then the old bonus starts anew going if you stay on that target.  So you'd be able to duel in the old way, or attack 2+ targets for the new one.  As I see it, the new bonus is a guaranteed mini-crit when you are juggling targets at the cost of dueling/lane bullying.  So in some situations it is better, in others it is worse.  So I wanted to see if there was a way to give her a different steroid based on a different circumstance; ADCs generally need a steroid of some kind to be relevant.\n\nSo in response to your question, I'm thinking maybe tweak that to a ramp then juggle gameplay style instead of just a juggle gameplay style.  Make the new bonus for switching based on how high you got the focus bonus, if you attack someone twice in a row after switching, it resets.  So pick on someone (the old bully MF) and do it well enough, you get to be a better juggle bully (new MF).  Basically a Volty style translation of old W passive into her new passive.  Do a good job of bullying someone and you get a bigger bonus for switching than you currently do.  Don't do a good job, and you get a lower juggle bonus.\n\nNow to answer the question you didn't ask, the counterplay to this is not to let her start bullying someone too much and try to force her to switch targets before she ramps up on any one champ.  I think that this change would give her new passive a little more counterplay from the other team if they act quickly.","replies":[{"poster":"Blackquill","date":"2015-11-07T11:13:57.390+0000","up_votes":1,"down_votes":0,"body":"So the TL;DR would be \"Hit this guy, get bonus damage, stack up the passive, switch targets, get bonus damage based on stacks\"?","replies":[]}]},{"poster":"Pika310","date":"2015-11-06T00:13:02.819+0000","up_votes":4,"down_votes":3,"body":"From my understanding, it drives the gameplay of \"teamfight like a proper ADC and focus on survival, only targeting enemies you can attack safely.\"\n\nAs opposed to, \"dive into the enemy team and split up your damage trying to hit as many different enemies as possible, like an Udyr trying to juggle stuns without actually trying to kill anyone so as to 'maximize your effectiveness.'\"","replies":[]},{"poster":"Tentacle Love","date":"2015-11-06T00:29:44.457+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=fKsOxbmJ,comment-id=0002,timestamp=2015-11-05T23:27:48.823+0000)\n>\n> Forgive me if I'm misunderstanding you on this one, is the proposal that MF gets bonus damage for attacking a target repeatedly and for changing targets? Trying to understand what gameplay that drives if so, since initial reaction is that it just reads as 'attack whoever you'd normally attack and ignore the passive'.\n\nI think the idea is to double tap and switch targets for maximum boom, which actually sounds pretty challenging and fun.","replies":[]},{"poster":"Remlap1223","date":"2015-11-06T00:11:41.748+0000","up_votes":1,"down_votes":0,"body":"Meddler doing this would function similarly to Ashe's flurry right now; a huge chunk of damage, followed up by little damage boosts.  She's already getting hit huge in terms of damage per level and base AD for this reason, so why not implement this as compensation?  It wouldn't be toxic since she could only apply this to one target at a time (whereas MF right now can theoretically stack max impure shots against all enemies, especially if she ults).","replies":[]},{"poster":"lightdragoon88","date":"2015-11-06T04:18:46.833+0000","up_votes":1,"down_votes":2,"body":"I was thinking maybe she get an extra 5-10% critical hit chance when she hit a new target.","replies":[]}]},{"poster":"Reaper Review","date":"2015-11-05T23:36:46.260+0000","up_votes":9,"down_votes":0,"body":"It means that MF's first shot on a unit applies the Love Tap bonus, then subsequent hits against the same unit begin to stack Impure Shots.\n\n_Miss Fortune's first attack against a new target deals (50-100% AD) bonus Physical Damage. Subsequent basic attacks against the same target deal (6% AD) bonus Magic Damage on-hit, stacking up to five times. (Attacking a new target resets these effects.)_\n\nThat's what I'm reading it as, at least. The Impure effect doesn't necessarily have to be magic damage, I just copied it verbatim.\n\nThe nifty thing about this would be that the Love Tap marker would tell you who you're building the \"Impure Shots\" effect on. The marker could possibly even change to reflect said stacks, like Black Cleaver's marker does.","replies":[{"poster":"LVL 5 PORO","date":"2015-11-06T06:13:39.105+0000","up_votes":2,"down_votes":0,"body":"I like this.","replies":[]},{"poster":"Remlap1223","date":"2015-11-06T00:07:35.927+0000","up_votes":2,"down_votes":0,"body":"Yes, all of my yes!","replies":[]},{"poster":"killd0zer","date":"2015-11-06T04:22:32.125+0000","up_votes":4,"down_votes":3,"body":"That's a really shitty idea then lol.\n\nThe amazing gameplay decision between dealing increased damage, or dealing increased damage. Why not just increase all basic attack damage lmao.\n\n0/10","replies":[]}]},{"poster":"A Miss Fortune","date":"2015-11-06T00:40:09.657+0000","up_votes":8,"down_votes":3,"body":"With how much damage MF's Love Tap does I don't really want her Impure Shots passive back, I can already see her pick-or-ban in LCS once again. Her Love Tap does 50% - 100% of her AD without a cooldown, it also works with her Q. Not only does her Q poke more but she's noticeably more bursty, that and a good MF and Q and auto attack two completely different targets at the same time, her new passive isn't a joke at all.","replies":[{"poster":"WolfBV","date":"2015-11-06T01:25:38.190+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=A Miss Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=fKsOxbmJ,comment-id=0004,timestamp=2015-11-06T00:40:09.657+0000)\n>\n> With how much damage MF's Love Tap does I don't really want her Impure Shots passive back, I can already see her pick-or-ban in LCS once again. Her Love Tap does 50% - 100% of her AD without a cooldown, it also works with her Q. Not only does her Q poke more but she's noticeably more bursty, that and a good MF and Q and auto attack two completely different targets at the same time, her new passive isn't a joke at all.\n\nWhen your Q kills a minion and does 1/4 a Leona's health and you just :D","replies":[{"poster":"A Miss Fortune","date":"2015-11-06T01:34:19.447+0000","up_votes":1,"down_votes":0,"body":"Or when it kills a minion and you force the enemy ADC to back as they return to lane and you just know this is why you main MF.","replies":[]}]},{"poster":"SoMNia","date":"2015-11-06T04:11:53.405+0000","up_votes":1,"down_votes":0,"body":"Attack a champion, Q a minion, attack two more times. If you do it right, you should get 3 consecutive Love Tap attacks as the second one lands between the Double Up bounces. You can also use this in teamfights with at least 3 targets.","replies":[]}]},{"poster":"Pika310","date":"2015-11-05T22:49:44.115+0000","up_votes":11,"down_votes":15,"body":"The problem with this suggestion is that it's a good idea.  Rito doesn't listen to good ideas.","replies":[{"poster":"killd0zer","date":"2015-11-06T04:25:32.622+0000","up_votes":6,"down_votes":1,"body":"The problem with the suggestion is it's the result of about a tenth of a second of brain power.","replies":[]}]},{"poster":"chipndip1","date":"2015-11-06T02:58:14.939+0000","up_votes":1,"down_votes":2,"body":"Here's a thought: Just because your passive requires you to change targets to use it, doesn't mean you have to keep switching targets.\n\nAnother thought: What if the point of the passive is to get a head start on damage new opponents, rather than bouncing around between multiple targets?\n\nIt's not that damn hard.","replies":[{"poster":"Marthian","date":"2015-11-06T04:01:23.169+0000","up_votes":3,"down_votes":1,"body":"First thought: You are basically required to change targets to do much of anything. Right now it's not a bonus for switching targets, it's a punishment for not switching targets (her base AD is extremely low that repeat hits deal terrible damage early game, sometimes mid too.)","replies":[{"poster":"chipndip1","date":"2015-11-06T04:12:00.221+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Marthian,realm=NA,application-id=3ErqAdtq,discussion-id=fKsOxbmJ,comment-id=00060000,timestamp=2015-11-06T04:01:23.169+0000)\n>\n> First thought: You are basically required to change targets to do much of anything. Right now it's not a bonus for switching targets, it's a punishment for not switching targets (her base AD is extremely low that repeat hits deal terrible damage early game, sometimes mid too.)\n\nHer laning phase is designed for her to bully people with Q, which automatically triggers the passive on the second target. I don't see the issue there. Besides, if you're farming, you hit a minion, and then you hit a champ, then go back to hitting a minion. The fact that you're in lane gives you a constant method to start trades in your favor by utilizing that passive.","replies":[]}]}]},{"poster":"Tis a nice day","date":"2015-11-06T08:32:26.668+0000","up_votes":2,"down_votes":1,"body":"If switching and focusing are both viable options, how does this change MF's gameplay from that of a generic ADC?","replies":[]},{"poster":"Reaper Review","date":"2015-11-06T05:10:30.243+0000","up_votes":2,"down_votes":1,"body":"Her passive and trading are fine if there's another target to hit and she can do so quickly, like in laning phase.\n\nBut doing this consistently AFTER laning is where you'll have a harder time. You don't always have the luxury of being able to get easy love taps, and MF's damage output plummets without them. Have you seen how low her base and scaling AD are now? She has ~63 base AD at level 18, which for reference is the amount Maokai has at level one.\n\nSo if she's forced to only hit the closest available target, she'll do much less damage to it than any other ADC would in the same scenario.\n\nYes, her ult will do high damage late-game with a good channel, but she's not and shouldn't be just an ult bot.","replies":[]},{"poster":"SoMNia","date":"2015-11-06T03:59:14.377+0000","up_votes":2,"down_votes":1,"body":"Just take the Fervor of Battle mastery. It gives stacking bonus damage on-hit against champions, but the stacks build on the user instead of the target (you just need to keep attacking anything), and they're physical damage, so you don't need hybrid penetration. Honestly, what you're suggesting would create a situation where you're rewarded for switching targets AND for not switching targets, which basically means \"do more damage no matter what\" and removes any interesting gameplay choices you would otherwise have. I don't think that's a good idea.\n\nBesides, you can use Q on a completely separate target to move the Love Tap mark twice while you're attacking and triple up on the bonus (second attack must land after first Q, before second Q). Good enough?","replies":[]},{"poster":"Lord Boltrix","date":"2015-11-06T07:50:39.738+0000","up_votes":1,"down_votes":0,"body":"I'd like the idea for there to be a mix up between dealing overall damage to the entire enemy team in small skirmishes that don't really amount to anything except to add more pressure, hence the idea behind Love Tap, and something to do when one particular person is becoming a problem. The Love Tap could still go off AD, as a way to allow for her to focus on that primarily and encourage trying to spread the 'love' around, but the magic damage of the Impure Shot stacking mechanic could scale off of AP, as a way to indirectly mess with tanks or bruisers who would stack armor without giving Miss fortune something like Armor Penetration.\n\nOf course it should take a few shots to ramp up in damage, so that it doesn't become 'better' per say to just focus on one target and ignore Love Tapping everyone around Miss Fortune.\n\nIt would add more dynamic to the concept of Love Tap in that she is trying to apply pressure everywhere, so that she might try to keep up the focus and the spread as needed, essentially trying to juggle as many opponents as possible with her passive, which sounds like a really cool mini-game, and we all know how Riot love's their mini-game playstyles.\n\nSo here is how I would have it.\n\nLove Tap works as it does as it scales off AD and deals bonus physical damage, promoting Miss Fortune to attack new targets, however, attacking a target who had Love Tap applied to them instead builds stacks of Impure Shots against them, dealing AP-scaling magic damage that ramps up. When Miss Fortune applies Love Tap to a new target after building up stacks of Impure Shots, she consumes all those stacks and adds bonus magic damage to the Love Tapped target.\n\nThus, rather than discouraging Love Tapping, it encourages people to be much more methodical about when and how they Love Tap.\n\nTo make this work, you'd likely have to increase how long Miss Fortune must wait before a target she Love Tapped can be tapped again, but I don't mind that at all, and I feel it would make it fun to play her and try to decisively build stacks and then discharge them, like a sort of Stattik Shiv built into her.","replies":[]},{"poster":"WolfBV","date":"2015-11-06T01:26:01.618+0000","up_votes":1,"down_votes":0,"body":"MF's already in a pretty good spot tho. But I guess if it helps my Tank Fortune do even more damage.","replies":[]},{"poster":"RazzleDazzleThem","date":"2015-11-05T22:56:27.592+0000","up_votes":1,"down_votes":0,"body":"I assume you mean that if {{champion:21}}  has a bunch of stacks on something and switches targets, all those stacks will be reapplied to her new target. In that case, I think it's actually a neat idea.","replies":[]}]}