{"poster":"FreshHomework","date":"2016-07-10T22:26:02.787+0000","title":"DOESN'T THIS ANNOY YOU","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"I&#039;m only level 16 and I&#039;m tired of those Summoners my level that invite a whole bunch of level 30&#039;s and they have an advantage with perks, runes and masteries. Can&#039;t Riot make a level barrier to stop these other Summoners from going into my game and just beat us under 30 minutes.","replies":[{"poster":"TheOneUser","date":"2016-07-11T11:53:59.341+0000","up_votes":2,"down_votes":0,"body":"The systems averages the levels out to make it a bit fairer but 1 lvl 30 lvl 16 duo can still probably beat 5 lvl 20s.\nI'll just add that this is an experience pretty much every lvl 30 has gone through. I was lvl 29 once and i duo'd with a lvl 30 and got matched up with a lvl 16 who was playing with a team full of lvl 30s. Pretty horrible experience for that guy :P","replies":[{"poster":"Légs","date":"2016-07-16T04:11:49.663+0000","up_votes":1,"down_votes":0,"body":"a long time ago i was level 16 and i paired up with my level 30 friends O.O, was scared out of my mind.\n\ni played ashe.","replies":[]}]},{"poster":"Ingénue","date":"2016-07-10T23:16:17.445+0000","up_votes":2,"down_votes":0,"body":"While it is annoying, think of it as a learning opportunity. \n\nThere are a number of reasons why low levels play with level 30s, the biggest reason is to learn.  Playing with your level 30 friends allows you to experience some of their gameplay and shapes the way you play from the get-go. \n\nThe other reason is to escape the toxicity. In low level games, everyone accuses everyone of smurfing, and if you aren't and are actually trying to learn the game you will probably get flamed for not performing to a certain standard of play. By playing with friends, you don't have to put up with that. \n\nLeague is a team game, and the best kind of team is one that is comprised of your friends. Even though it is frustrating to come up against players that have an advantage such as runes/masteries/experience, it is unlikely Riot is going to put a cap on what level friends you can play with because it dampers the team experience from the very beginning of a league players journey.","replies":[]}]}