{"poster":"AudnaI","date":"2015-05-22T10:30:45.325+0000","title":"Computer hängt sich beim starten der Client Oberfläche auf","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo\r\n\r\nJedes mal nachdem ich mich einlogge und der Client die Oberfl&auml;che l&auml;dt (aktuelle News, spectate Vorschl&auml;ge etc.) friert mein kompletter\r\nPC ein. Ich kann die Maus nicht mehr bewegen, Tastatur eingaben werden nicht angenommen, Musik im Hintergrund stoppt usw. ein kompletter freeze.\r\nLoL startet von einer SSD auf der sich auch das Betriebsystem Win 7 x64 befindet.\r\nDer Freeze geht wenige Sekunden, danach funktioniert der Client sowie der PC wieder tadellos.\r\n\r\nWie l&auml;sst sich dieses Problem verhindern?\r\n\r\nMfG danny","replies":[{"poster":"Manwe Sulimo","date":"2015-05-22T11:01:37.808+0000","up_votes":1,"down_votes":0,"body":"lol komplett neu installieren. evtl auch adobe air (ka genau)\n\nevtl admin rechte beachten falls du auf einem windows account ohne admin rechte spielst.","replies":[{"poster":"AudnaI","date":"2015-05-23T10:26:31.126+0000","up_votes":1,"down_votes":0,"body":"Ich habe LoL komplett neu installiert, aber leider hat das nichts geholfen, bzw. nur kurzzeitig.\nIch konnte mich ca.2 mal ohne das Problem einloggen, danach war es jedoch wieder da.\nDer Windows ACC hat Admin rechte!","replies":[{"poster":"Phobos Selini","date":"2015-06-23T13:51:12.869+0000","up_votes":1,"down_votes":0,"body":"Also ich hatte das Problem immer beim ersten Starten des Clients an einem Tag. Wenn ich dann ohne Windows neu zu starten oder die IP zu erneuern den Client nochmal gestartet habe, trat das Problem nicht mehr auf.\nDieser Client Freeze zog sich jetzt über mehrere LoL Patches hin. Aber es scheint so als hätte ich es jetzt endlich mit einem Windows Update geschafft. Bei mir trat zusätzlich noch ein seltsames Problem auf, dass der WU Dienst sich seit längerem unbemerkt aufgehängt hat, so dass ich jetzt nach der Behebung erst mal einige Patches runterladen musste. Aber nun scheint LoL wieder normal zu starten.","replies":[]}]}]}]}