{"poster":"Skorch","date":"2017-02-07T14:42:58.247+0000","title":"Can we get a battle mage?","subforum":"Concepts & Creations","up_votes":37,"down_votes":6,"body":"Like a semi tanky, ap Melee caster mage (not galio). I may have seen an idea for this before but something along the lines of a monk with a Bo staff.\n\nEdit: Holy shit, i just saw this had near 1000 views and was top page of C&C thanks guys.","replies":[{"poster":"Papa Andrei","date":"2017-02-07T17:14:26.856+0000","up_votes":13,"down_votes":1,"body":"Morde, Diana, Galio, Kassadin,.\nAlready got melee ap aa based\nAlso Eve","replies":[{"poster":"Skorch","date":"2017-02-07T17:46:14.920+0000","up_votes":2,"down_votes":1,"body":"I wouldnt call them battle mages except maybe Kassadin, There is also the thematic that a Battlemage makes, and none of them fit that. Althought they are indeed melee ap aa champs yes, not quite what im looking for.","replies":[{"poster":"Papa Andrei","date":"2017-02-07T19:20:25.923+0000","up_votes":13,"down_votes":2,"body":"Morde is literally a battlemage, exactly. He is a mage, who uses melee weapons, who thrives in the thick of battle. If you do not consider him a battlemage, then you don't know what a battlemage is and you have grabbed a random title to describe what you want.","replies":[{"poster":"Wimbledofy","date":"2017-02-08T07:36:00.647+0000","up_votes":3,"down_votes":1,"body":"mordekaiser is nothing like a battlemage. Only thing that makes him magey is that he is ap. But if you look at it from a non ingame/stat perspective he is not a battlemage.","replies":[]},{"poster":"Skorch","date":"2017-02-07T19:41:22.321+0000","up_votes":4,"down_votes":2,"body":"In game he is a battlemage, but thematically (while we dont know a lot) he is more of a lich than a battlemage. Although we know very little of his ability we do know he relied on his immortality a lot during his battles.\n\nIm looking for someone who uses more equal parts magical ability and fighting prowess.","replies":[{"poster":"Spaceman5pff","date":"2017-02-07T22:35:07.746+0000","up_votes":1,"down_votes":0,"body":"{{champion:39}} if you consider telekinesis to be magic, she does alot of attacking vie using her mind to throw enchanted blades around.\n\nBut that is getting SUPER technical","replies":[{"poster":"5000000000000000","date":"2017-03-16T00:54:14.013+0000","up_votes":1,"down_votes":0,"body":"Riot has stated already that her thematic has a lot of potential for gameplay update. Maybe she'll feel like a battlemage while still being a diver?","replies":[]}]}]}]}]}]},{"poster":"Fondling Gems","date":"2017-02-07T17:42:03.633+0000","up_votes":5,"down_votes":0,"body":"To insert a reference I just spent an amusing hour searching for:\n\n\"Battle mage?  That's not a profession.  It barely qualifies as a hobby. 'Battlemage' is about as impressive a title as Lord of the Dance.\"\n...\n\"I am adding Lord of the Dance to my titles.\"\n\n-Richard: Lord of the Dance, Mistress of Magma, Archmage of Destiny, Lord Ashendale, Mayor of a little village up the coast","replies":[{"poster":"Skorch","date":"2017-02-07T17:52:45.209+0000","up_votes":1,"down_votes":0,"body":"What?","replies":[{"poster":"Fondling Gems","date":"2017-02-07T17:54:37.912+0000","up_votes":1,"down_votes":0,"body":"Damn, references falling through again.  Ahh well, I tried.  Maybe someone else will get it.\n\nSorry, every time I hear battlemage that quote is all I can think of.","replies":[{"poster":"Skorch","date":"2017-02-07T18:01:55.780+0000","up_votes":1,"down_votes":0,"body":"It was beautiful to read, but all i can respond with is \"What?\"","replies":[{"poster":"Fondling Gems","date":"2017-02-07T18:09:40.062+0000","up_votes":3,"down_votes":0,"body":"The most wonderful webcomic in existence: LFG.  Basically rolls DnD, World of Warcraft, and all that jazz into one world and has you following 2 characters:  The lawful good elf who wants to help things and the undead evil lich who hangs out, is all but unkillable, and just screws with people.\n\nBasically reading it is a yes or no question:\n\nhttp://cdn.quotesgram.com/img/24/76/2103266881-im-a-hat-on-a-cat.png\nDid you find this amusing?  Read LFG.\nNo?  Run from any LFG fans you meet.","replies":[]}]}]}]}]},{"poster":"WinTheWarOnPants","date":"2017-02-07T21:45:21.151+0000","up_votes":2,"down_votes":1,"body":"> Bo staff.\n\nThis peeves me to no end!\n bō (棒: ぼう), is a very tall and long **staff** weapon used in Okinawa and feudal Japan.\nWhen you say \"Bo staff\" you are saying \"staff staff\"...","replies":[{"poster":"Danjeng","date":"2017-02-07T23:26:59.682+0000","up_votes":3,"down_votes":2,"body":"Bo Staff is the English name for a Japanese weapon. \nYou won't expect Japanese people to pronounce \"Hotdog\" rather than \"Hottodoggu\", now would you?\n\nBut I can understand you. Master Sifu from Kung Fu Panda series, means \"Master Master\".","replies":[{"poster":"WinTheWarOnPants","date":"2017-02-07T23:52:30.682+0000","up_votes":2,"down_votes":0,"body":"> Bo Staff is the English name for a Japanese weapon.\n\nIt's not. I know i sound like i'm just being overly picky too people who don't understand how language translation works, but \"Bo staff\" is redundant. It's the same as saying \"katana sword\" or \"zweihander sword\". \"Bo\" is the name of the weapon, pronunciation has nothing to do with this. \"master sifu\" also peeves me lol most Americans don't speak anything other than english so these errors rarely get corrected do to ignorance. Just like when you see some non-english speaker in another country wearing a shirt that says \"I F*CK MY MOTHER\" and they have no idea what it means.","replies":[{"poster":"Supreme Senpai69","date":"2017-02-08T00:17:25.975+0000","up_votes":1,"down_votes":1,"body":"Oh trust me they know exactly what it means","replies":[{"poster":"WinTheWarOnPants","date":"2017-02-08T02:42:27.911+0000","up_votes":4,"down_votes":0,"body":"https://www.printsome.com/blog/wp-content/uploads/black-woman-t-shirt.jpg\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]},{"poster":"HeartseekerVarus","date":"2017-02-08T20:35:12.790+0000","up_votes":2,"down_votes":0,"body":"Do you know how much of English actually does this, though? XD\n\nThere's a reason that there's a DORD (Department of Redundancy Department) and the RAS Syndrome (Redundant Acronym Syndrome Syndrome).\n\nThere's actually a word to describe place names that fall under the DORD's area, even: tautological.\n\nDC comics is Detective Comics Comics\nLake Tahoe is Lake Lake\nLe Brea Tar Pits is The Tar Tar Pits\nSahara Desert is Desert Desert\nPlease RSVP is Please Respond Please\nATM machine is Automated Teller Machine Machine\nRice Pilaf is Rice Rice (well, Rice Ball of Rice)\nMinehaha Falls is Waterfall Falls\nChai Tea is Tea Tea\n\nAvenue Road in Toronto (need I say more)\nStreet Road in Pennsylvania (god love the person who named it)\nMississippi River is Big River River\nShrimp Scampi is Shrimp Shrimp\nAhi Tuna is Tuna Tuna\nLCD display is Liquid Crystal Display Display\nThe Rock of Gibraltar is The Rock of the Rock of Tariq\nEast Timor is East East\nTimor Leste is STILL East East\n\nQueso Cheese is Cheese Cheese\nSalsa Sauce is Sauce Sauce\nThe Los Angeles Angels is _The The Angels Angels_\nNaan Bread is Bread Bread\nPanini Sandwich is just horrible. A Panino is a sandwich, and panini is plural. So Panini Sandwich is Sandwiches Sandwich\nPIN number is Personal Identification Number Number\nRAS syndrome is Redundant Acronym Syndrome Syndrome\nDORD, since we're here, is the Department of Redundancy Department\n\nEl Camino Way is The Way Way\nWalla Walla River is Little River River (Walla is River, Walla Walla is Little River - otherwise it'd be River River River)\nEas Fors Waterfall, in Scotland, is a stupendous offender: Waterfall Waterfall Waterfall. Scottish Gaelic, Norse, and English.\nLaguna Lake is Lake Lake (California, what on earth)\nLake Lagunita is Lake Little Lake (California, please)\nLakeville Lake in Michigan.\nCanvey Island is Cana's Island Island\n\nBoulder Rock in Antarctica\nMilky Way Galaxy? Well, that's the Milky Way Milky Way.\nRue Avenue, New Jersey.\nAus Jus Sauce is Sauce Sauce\nRAM memory is Random Access Memory Memory\nHIV Virus?\nVIN Number?\n\n\nAnd then you have your bo staff/staff staff. Somehow, it's less surprising after a whole list.\n\n(Hah, it's like a poem. A very annoying poem that doesn't rhyme.)\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"WinTheWarOnPants","date":"2017-02-15T02:52:36.736+0000","up_votes":2,"down_votes":0,"body":"I didn't realize a bunch of these lol Good post and thanks for the info. Also, thanks for giving me even more language peeves Q.Q It really is \"the more you know\". It's crazy how little we understand about many things that we see/use every day.","replies":[]}]},{"poster":"macromite","date":"2017-02-08T00:41:04.727+0000","up_votes":1,"down_votes":0,"body":"Zweihander sword is actually passable. as Zweihander is a sword and also a description, literally meaning two handed or two hander, so in this case being a two handed sword.\n\nalso language is fluid, don't get caught in specifics or you will trip yourself up and end up being incomprehensible.","replies":[{"poster":"WinTheWarOnPants","date":"2017-02-08T02:44:05.656+0000","up_votes":2,"down_votes":1,"body":"yeah that probably wasn't as good as an example.","replies":[]}]}]}]}]},{"poster":"Sherogarth","date":"2017-02-07T21:33:35.018+0000","up_votes":4,"down_votes":0,"body":"Kind Sir you should specify that you are looking for someone whose main theme is \"The Battle Mage\" and not someone who just \"plays\" like one.\nIt's also worth noting that \"battle mage\" is very loose theme, it can mean many different thing - \"mage who specialise in battle magic\", \"mage who loves to battle\", \"mage who can win entire battles by himself\", \"mage trained for battle\"... the list goes on.\nProbably proper theme you are looking for is \"The Spellsword\" - a character that combines both arcane/elemental magic, some kind of (enchanted) armor and a weapon.\n\nWhile characters stated by others fit into \"mage/warrior\" achetype none of them is \"spellsword\" in its core.\nE.g. one could say that {{champion:44}} fits into this theme - \"he uses melee weapon and magic hur dur...\" - but he is more of \"a star/gem battle cleric\" in his core (he was \"a gem paladin\" before his rework but now both Garen and Leona fit paladin theme better than he).","replies":[]},{"poster":"macromite","date":"2017-02-07T17:54:44.733+0000","up_votes":5,"down_votes":1,"body":"you said not galio after describing galio.\n\nmaybe you should just play galio.","replies":[{"poster":"Skorch","date":"2017-02-07T18:01:24.997+0000","up_votes":4,"down_votes":0,"body":"THEMATICS MY SIR!! There is a different between a fighter that uses magic to aid him. And a flying golem with magical properties. Same properties in gameplay point of view, different in thematics.","replies":[{"poster":"macromite","date":"2017-02-07T19:22:14.392+0000","up_votes":1,"down_votes":2,"body":"If monk thematics is what you want play lee sin.\nthematically he uses magic with his ult and q, and he is a monk.","replies":[{"poster":"Skorch","date":"2017-02-07T19:42:28.704+0000","up_votes":3,"down_votes":2,"body":"Not necessarily a monk, but someone who uses equal parts magic ability and fighting prowess.\nLee has the fighting prowess, but his moves dont feel all that magical to me.","replies":[{"poster":"AlienPrimate","date":"2017-02-08T00:29:23.491+0000","up_votes":2,"down_votes":0,"body":"In the lore he was a mage who became a monk seeking repentance after accidentally killing people with a magical experiment.","replies":[]},{"poster":"macromite","date":"2017-02-07T21:13:38.652+0000","up_votes":3,"down_votes":1,"body":"equal parts magic and fighting prowess eh? try out garen, leona, or Aatrox on for size on the thematic front. all of them use some level of magical capacity along with a good amount of physical power.\n\n(also, I have no idea why your last comment got downvoted. I don't understand.)","replies":[{"poster":"Spaceman5pff","date":"2017-02-07T23:01:58.640+0000","up_votes":2,"down_votes":1,"body":"Garen doesn't do much magic really.\n\nDiana is far closer than garen","replies":[{"poster":"macromite","date":"2017-02-08T00:33:20.563+0000","up_votes":1,"down_votes":2,"body":"when it comes to magic garen trades quantity with quality.\n\nalso diana uses magic much more than I think he is going for. based on his mention of a monk it should be more physical than magical.","replies":[{"poster":"Spaceman5pff","date":"2017-02-08T00:37:40.539+0000","up_votes":1,"down_votes":1,"body":"OP actually specified that it should NOT be a monk.","replies":[{"poster":"macromite","date":"2017-02-08T00:53:01.921+0000","up_votes":1,"down_votes":1,"body":"Where?","replies":[{"poster":"Spaceman5pff","date":"2017-02-08T01:19:11.009+0000","up_votes":2,"down_votes":1,"body":"> Not necessarily a monk, but someone who uses equal parts magic ability and fighting prowess.\n> Lee has the fighting prowess, but his moves dont feel all that magical to me.\n\nThe part where you replied without reading, apparently","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"SpecterVonBaren","date":"2017-02-07T22:53:50.844+0000","up_votes":4,"down_votes":1,"body":"{{champion:68}}\n\nEdit: And here I thought I'd be repeating what someone else said but I'm not. How the hell am I the first person to bring up Rumble?","replies":[{"poster":"The Great Divide","date":"2017-02-08T06:52:38.736+0000","up_votes":1,"down_votes":1,"body":"I still to this day argue that rumble is a perfectly designed champion because he so perfectly embodies what a battle mage is and should play like (even if he can be slightly overtuned at times).","replies":[{"poster":"Votable Jester","date":"2017-02-08T17:47:24.602+0000","up_votes":2,"down_votes":1,"body":"I'd say his ult is too long ranged and he's too lacking in tankiness to embody a battle mage to me, but I think everyone has their own view of what a battle mage should be.","replies":[]}]}]},{"poster":"LVL 5 PORO","date":"2017-02-07T19:44:51.954+0000","up_votes":4,"down_votes":1,"body":"{{champion:131}}","replies":[]},{"poster":"TetsuTeito","date":"2017-02-08T00:47:54.956+0000","up_votes":2,"down_votes":0,"body":"I looked into Battlemages, and using inspiration from Dragon Age and KoA, I've come up with this skillset. If anyone wants to flesh it out, go for it. :)\n\nPassive: Regains 1-5% (based on level) of his mana when struck by an auto attack.\n\nQ: Empowers his autoattacks to deal damage over time for 5 seconds\n\nW: Blinks to a target location\n\nE: Charges for 3 seconds, then gains a shield for 50-75% (based on level) of the damage taken in that 3 seconds, blasting back 50% of the damage taken as magic damage in a short range aoe\n\nR: Blasts a force of elemental energy in a cone, dealing magic damage and pulling enemies towards him, as well as gaining bonus armor and magic resist depending on how many enemies were pulled\n\nI hope this helps a little bit.","replies":[{"poster":"HeartseekerVarus","date":"2017-02-08T20:45:59.023+0000","up_votes":1,"down_votes":0,"body":"A Dragon Age type of battlemage theme would be awesome. Between LoL and Dragon Age, I'd probably sooner replay Inquisition (a third time) or DA2 (a fourth time) instead of doing LoL, if I only had time for one.\n\nI, personally, am in this thread mostly to read other comments and hope for an eventual battlemage theme, I don't have ideas on abilities... just themes and/or backstories. So I'm also just here to second the notion of a DA inspired mage. XD","replies":[{"poster":"TetsuTeito","date":"2017-02-09T02:11:14.602+0000","up_votes":2,"down_votes":0,"body":"Maybe I'll flesh this one out in my spare time and release it later, then. I should go back and finish all of my champion ideas.","replies":[]}]},{"poster":"Skorch","date":"2017-02-08T11:09:59.949+0000","up_votes":1,"down_votes":0,"body":"I was also drafting an Idea. Something along the lines of each ability had a different theme. And his passive would grant bonuses based off the last ability used.","replies":[{"poster":"TetsuTeito","date":"2017-03-15T19:49:42.490+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=A8FQeEA8,discussion-id=9nRyv9fA,comment-id=001b0000,timestamp=2017-02-08T11:09:59.949+0000)\n>\n> I was also drafting an Idea. Something along the lines of each ability had a different theme. And his passive would grant bonuses based off the last ability used.\n\nIs there a specific faction you had in mind for this champion? Like Ionia, Noxus, etc.?","replies":[{"poster":"Skorch","date":"2017-03-16T00:44:34.407+0000","up_votes":1,"down_votes":0,"body":"Wow this is an old post, well... hmm... Personally as i stated above when i think battle mage, i go Bo Monk, so technically Ionia, i also feel like that works the best if the theme is say... Elements, they could be all about balance and shit.","replies":[{"poster":"TetsuTeito","date":"2017-03-16T01:23:41.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=A8FQeEA8,discussion-id=9nRyv9fA,comment-id=001b000000010000,timestamp=2017-03-16T00:44:34.407+0000)\n>\n> Wow this is an old post, well... hmm... Personally as i stated above when i think battle mage, i go Bo Monk, so technically Ionia, i also feel like that works the best if the theme is say... Elements, they could be all about balance and shit.\n\nWell I actually already made a kit. It's not really elemental or really about balance, but I feel it's what a Battlemage in runeterra would have in his/her arsenal. I just wanted to know where you would like the lore to be placed. I was actually thinking of making him a noxian who switched sides to Ionia after seeing the error of his ways, or making him a wandering mercenary.","replies":[{"poster":"Skorch","date":"2017-03-16T01:25:33.776+0000","up_votes":1,"down_votes":0,"body":"Isnt that just sort of Riven, and a little bit of Taliyah?","replies":[]}]}]}]}]}]},{"poster":"idontgiveabother","date":"2017-02-08T03:22:48.228+0000","up_votes":1,"down_votes":0,"body":"Im thinking a ryze with a more dynamic theme here. You could probably change around his theme/colors and there you go. ","replies":[{"poster":"Skorch","date":"2017-02-08T10:50:39.593+0000","up_votes":2,"down_votes":0,"body":"Wait, what if we MADE Ryze the battlemage in this years \"annual ryze update?\"\n\nActually he will probably still need one afterwards again, nvm.","replies":[]}]},{"poster":"FortisDominus","date":"2017-02-07T16:24:00.434+0000","up_votes":1,"down_votes":0,"body":"A melee mage champion that does more damage with autos based on AP ratios while being tanky would be nice","replies":[{"poster":"Galactic Pimp","date":"2017-02-07T17:14:58.333+0000","up_votes":3,"down_votes":2,"body":"{{champion:131}}","replies":[{"poster":"FortisDominus","date":"2017-02-07T17:18:05.350+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=IFapToYourSister,realm=NA,application-id=A8FQeEA8,discussion-id=9nRyv9fA,comment-id=00050000,timestamp=2017-02-07T17:14:58.333+0000)\n>\n> {{champion:131}}\n\nlol no","replies":[]}]}]}]}