{"poster":"Ornn Bot","date":"2018-06-07T20:34:36.481+0000","title":"Master Yi","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":5,"body":"So we getting a Master Yi nerf anytime soon ?","replies":[{"poster":"Quinncest","date":"2018-06-08T07:08:27.684+0000","up_votes":2,"down_votes":0,"body":"I personally don't think he needs a nerf. He's an extremely hit or miss type of champion.\nIf he falls behind, he's going to be useless unless he afk farms all game and pushes himself back into it, and if he gets fed, just like every other champion - it's nasty.","replies":[]},{"poster":"Lord Sesshomaru","date":"2018-06-07T21:53:04.357+0000","up_votes":2,"down_votes":1,"body":"The annoying thing about Master Yi, is the way Riot choose to balance champions across all ranks, instead of a specific bracket.\nThey feel _(and its fair enough)_, that all skill levels should have all champs available to them.\n\nHowever while this is a fair view, it isn't always practical. Trying to make a champ balanced both in Bronze 5 and in Challenger, just doesn't happen. Especially with extreme champs like Yi. So the result we get is a Master Yi thats too weak for pro-play, but way too strong for lower elo. And they cant buff him because Bronze will cease to exist, an they cant nerf him, because the 1 or 2 challengers that use occasionally him, will no longer be able to.\nSo every time he does get a buff, later down the track he gets a fairly equal nerf, and vice versa, so he always stays in this limbo state.\n\nSo until Riot abandon this principle and just admit that Yi wont be a worlds pro-plays champ, and just balance him as the newbie practice champ he was intended to be, he will always be a problem.\n\nIts a sticky situation.","replies":[]},{"poster":"Garen Player","date":"2018-06-08T06:42:13.696+0000","up_votes":1,"down_votes":0,"body":"Rammus = gg","replies":[{"poster":"Socon","date":"2018-06-09T11:29:31.113+0000","up_votes":1,"down_votes":0,"body":"red smite rage blade botrk blood razor = gg","replies":[{"poster":"Garen Player","date":"2018-06-09T14:13:44.786+0000","up_votes":1,"down_votes":0,"body":"Yi won't last that long for those items {{sticker:sg-miss-fortune}}","replies":[{"poster":"Socon","date":"2018-06-16T04:00:33.269+0000","up_votes":1,"down_votes":0,"body":"Sure he will {{sticker:slayer-jinx-wink}}","replies":[]}]}]}]},{"poster":"Socon","date":"2018-06-09T11:33:21.561+0000","up_votes":1,"down_votes":0,"body":"Master Yi has been in a bad spot for a while now (as in a weak champion) and with the changes to jungle, he falls even further behind since many other junglers outclass him early and can win the scuttle fight. Even though he got much-needed buffs a number of patches ago he's still another risk for reward type champion.","replies":[]}]}