{"poster":"Cracatoa","date":"2016-02-21T00:34:12.204+0000","title":"Ayuda se me queda pegado en el logo","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"Cuando abro el lol se queda pegado el logo de &quot;League of Legends&quot; (aproximadamente 1 o 2 minutos)  y despues me sale &quot;Could not connect to the http server&quot;","replies":[{"poster":"Hwaxinghz","date":"2016-02-21T01:00:40.348+0000","up_votes":1,"down_votes":0,"body":"A mi me pasó esta mañana, eliminé unas carpetas (las del Launcher y las del Patcher), las volví a descargar y se solucionó, son bugs del juego, nada mas.","replies":[{"poster":"Hero of Ligth","date":"2016-02-21T02:46:45.483+0000","up_votes":1,"down_votes":0,"body":"Me podrias decir cuales son las carpetas exactas y donde puedo encontrarlas? Muchas Gracias :-)","replies":[{"poster":"Hwaxinghz","date":"2016-02-21T02:48:40.641+0000","up_votes":1,"down_votes":0,"body":"C://Riot Games/League of Legends/Rads/Projects y allí dentro aparecen lol_air_client_config_la2, Lol_Patcher y LoL_Launcher, elimina las carpetas con esos nombres. Abres el juego y empieza a actualizar de nuevo, de esa forma se repara el inicio.","replies":[{"poster":"Hero of Ligth","date":"2016-02-21T02:53:40.983+0000","up_votes":1,"down_votes":0,"body":"No pasa nada. Ahora me  aparece el error de pvp.net parchet kernel. Si puedes pasarme esas carpetas que elimine por Mega Te mando cajita :-)","replies":[{"poster":"Hwaxinghz","date":"2016-02-21T15:36:05.119+0000","up_votes":1,"down_votes":0,"body":"Esas carpetas contienen los datos del launcher y del patcher bugeado, por eso mismo al eliminarlas se borra  la opción del bug y se vuelve a descargar de nuevo.\n\nEs más complejo que eso, tienes que borrar también los logs (la carpeta logs de league of legends) y si sigue el problema, la carpeta Solutions de la carpeta RADS, con eso se me soluciona el otro error","replies":[]},{"poster":"EoNTheBest","date":"2016-02-21T02:58:50.827+0000","up_votes":1,"down_votes":0,"body":"No creo que sean cosas de eliminar unas carpetas y ya, creo que es un problema de Riot, tanta gente con el mismo problema de la nada, y ninguna solución funciona...","replies":[]}]}]}]}]},{"poster":"Veta3","date":"2016-02-21T02:31:40.531+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo.. no se que hacer para arreglarlo ya probé de todo{{champion:32}}","replies":[]},{"poster":"J0CS4N","date":"2016-02-21T00:36:25.598+0000","up_votes":1,"down_votes":0,"body":"mira esto : https://www.youtube.com/watch?v=iaPrTN3u0hc","replies":[]}]}