{"poster":"Temp65432","date":"2016-06-20T07:57:56.681+0000","title":"A \"tökéletes balance\"","up_votes":8,"down_votes":1,"body":"Sokan szoktatok posztolni, hogy mi&eacute;rt is op XY, vagy hogy mi&eacute;rt nem tudj&aacute;k m&aacute;r v&eacute;gre balanceolni a j&aacute;t&eacute;kot. Megpr&oacute;b&aacute;lom egy kicsit elmagyar&aacute;zni, mi&eacute;rt k&aacute;ros egy j&aacute;t&eacute;k sz&aacute;m&aacute;ra a t&ouml;k&eacute;letes balance. \n\nVegy&uuml;k p&eacute;ld&aacute;nak a warcraft 3-at, vagy starcraftot, amik tudom&aacute;som szerint el&eacute;g j&oacute;l balanceolt j&aacute;t&eacute;kok. Ezeken a j&aacute;t&eacute;kokon m&aacute;r nem nagyon v&aacute;ltoztatnak, p&aacute;r &eacute;vente 1-2 kisebb friss&iacute;t&eacute;s. Annyira j&oacute;l balanceoltak, hogy kialakult egy olyan meta, ahol az ellenf&eacute;l minden l&eacute;p&eacute;s&eacute;re megvan, hogy neked arra mik&eacute;nt kell reag&aacute;lnod. Ez elsőre j&oacute;l hangozhat, viszont ennek hat&aacute;s&aacute;ra taktikai j&aacute;t&eacute;kokb&oacute;l &aacute;talakultak reflex j&aacute;t&eacute;kokk&aacute;. L&eacute;nyeg&eacute;ben ha 2 olyan j&aacute;t&eacute;kos j&aacute;tszik aki nagyj&aacute;b&oacute;l egy szinten &aacute;ll, az ker&uuml;l ki győztesen, aki a megfelelő l&eacute;p&eacute;seket hamarabb tudja kivitelezni. Ettől a limit&aacute;lt sz&aacute;m&uacute; t&ouml;k&eacute;letesre fejlesztett taktik&aacute;t&oacute;l a j&aacute;t&eacute;k repetit&iacute;vv&eacute; v&aacute;lik.\nEz LoLban &uacute;gy jelenne meg, hogy mivel minden karakter &quot;ugyan annyira&quot; erős, kialakuln&aacute;nak adott taktik&aacute;k &eacute;s pickek, amiket mindenki unalomig ismer, &eacute;s akkor a j&aacute;t&eacute;kot csak a reflexek d&ouml;nten&eacute;k el, az , hogy ki tud gyorsabban reag&aacute;lni. Ezzel a j&aacute;t&eacute;k unalmass&aacute; v&aacute;lna. K&eacute;pzelj&uuml;k el, hogy lcsen mindig ugyan az a 10 fel&aacute;ll&aacute;s v&aacute;ltakozna &eacute;veken kereszt&uuml;l.\n\n&Eacute;s akkor itt vissza is kanyarodtunk a lolhoz. Azzal, hogy a lol soha nem t&ouml;k&eacute;letesen balanceolt siker&uuml;lt kialak&iacute;taniuk egy folyamatosan v&aacute;ltoz&oacute; j&aacute;t&eacute;kst&iacute;lust, aminek k&ouml;sz&ouml;nhetően milli&oacute; f&eacute;le k&eacute;ppen lehet j&aacute;tszani a j&aacute;t&eacute;kot. Lehet, hogy egyik patchben az XY az erős, a m&aacute;sikban pedig az AB, de ezek patchenk&eacute;nt v&aacute;ltoznak. Lehet, hogy most a tankok, k&eacute;sőbb pedig az assassinok lesznek a domin&aacute;nsak a j&aacute;t&eacute;kban. Ezzel a j&aacute;t&eacute;k a frissess&eacute;g &eacute;rzet&eacute;t tudja kelteni, minden egyes lej&aacute;tszott menetben.\n\nHa el&eacute;rn&eacute;k a t&ouml;k&eacute;letes egyens&uacute;lyt, akkor a j&aacute;t&eacute;kot arra k&aacute;rhoztatn&aacute;k, hogy &ouml;r&ouml;kre pontosan ugyan olyan maradna, &eacute;s m&aacute;r csak az &uacute;j karaktereket kellene hozz&aacute;igaz&iacute;tani. Viszont am&iacute;g ezt az egyens&uacute;lyt nem &aacute;ll&iacute;tj&aacute;k fel, addig a lehetős&eacute;gek v&eacute;gtelenek &eacute;s folyamatosan v&aacute;ltoztathatnak rajta. Persze ez sokszor ideges&iacute;tő az adott pillanatban, amikor &uacute;gy &eacute;rzitek, hogy a j&aacute;t&eacute;k nem fair, de az az&eacute;rt nem fair, mert nem is szabad annak lennie. A balanceol&aacute;s addig tesz j&oacute;t egy j&aacute;t&eacute;knak, am&iacute;g az nem &aacute;ll t&ouml;k&eacute;letesen egyens&uacute;lyban, csak megk&ouml;zel&iacute;ti azt. Hagyni kell a játékosokat, hogy bármilyen az egyensúlytól való eltérést a már megadott lehetőségekkel tudjanak kompenzálni...Ettől változik a meta.\n\nRem&eacute;lem ezzel siker&uuml;lt egy kicsit megvil&aacute;g&iacute;tanom a Rit&oacute; b&aacute;csi l&eacute;p&eacute;sei m&ouml;g&ouml;tt megb&uacute;v&oacute; sz&aacute;nd&eacute;kot p&aacute;r ember sz&aacute;m&aacute;ra ^^","replies":[{"poster":"Tetth","date":"2016-06-20T10:20:41.380+0000","title":null,"up_votes":2,"down_votes":0,"body":"Most hogy belegondolok... lényegében ezért nem untam még meg a játékot. Erős érvelés.","replies":[{"poster":"Temp65432","date":"2016-06-20T10:35:02.339+0000","title":null,"up_votes":1,"down_votes":0,"body":"szerencsére (vagy nem), már mindegyik véglettel sikerült találkoznom amióta játszok (túl balanceolt, vagy túl broken/egyáltalán nem balanceolt), érdekes volt megfigyelni, hogy melyik, hogy működik. Meg érdekelt a gondolat, szóval elég sok videót néztem a témában.\n","replies":[{"poster":"Orvvadasz1","date":"2016-06-20T12:09:15.089+0000","title":null,"up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Tango The Shared,realm=EUNE,application-id=VFnq5EbB,discussion-id=ZFuNRkUE,comment-id=00000000,timestamp=2016-06-20T10:35:02.339+0000)\n>\n> szerencsére (vagy nem), már mindegyik véglettel sikerült találkoznom amióta játszok (túl balanceolt, vagy túl broken/egyáltalán nem balanceolt), érdekes volt megfigyelni, hogy melyik, hogy működik. Meg érdekelt a gondolat, szóval elég sok videót néztem a témában.\n\nAz a baj vele hogy így is rosszabb mintha rendesen lenne balancolva. Gondoljatok bele mikor láttátok utoljára Urgotot, Sejuanit vagy Poppyt ( lehet hogy nem rég lett frissítve de akkor is csak 1 hónapig használták). Yorick bent sincs a heti free karakterek között ( Ez is azért mert elvileg túl op) csak a riot már 2 éve igérgeti hogy reworkölik ( aha persze). Itt se jobb mint a starcraft2ben mert melyik karaktereket látjátok legtöbbször? Hát persze hogy az assassinokat és a tankokat és ez már elég régóta tart. Persze ez eddig még elviselhető lenne de a tankok amellett hogy szinte lehetetlen őket megölni mert annyi a hpjuk armorjuk és magic resistjük hogy egy évig ütöd őket akkor se fogynak el, még cserébe hpból kapnak sebzést is. ( pl Zac) Vagy a másik tankos oldal ami egyszerre épít hpt is meg sebzést is és ezért kevesebb hpjának kéne lennie mint egy tanknak és kevesebb sebzésének mint egy assassinnak. De nem mert hogy, hogy nem a ugyan annyi hpja van mint egy full tanknak és kb annyi dmgt oszt ki mint egy jobb assassin. Ja és mellesleg ha eltalálja az ellenséget a Qjával ( khmm Darius és Illaoi ) vagy Wjével ( Illaoi + csápok) akkor a hpja hiányzó része x százalékával még healel is. Persze mondhatnátok hogy vannak a tank ölő tárgyak de mit érsz velük ha a játék elejétől fogva feedeled az enemyt mert meg se tudod sebezni mire megöl. A true dmgel operáló karakterek se a tankok ellen igazán opk bár azok ellen találták ki ( Vayne az kivétel mert ő a tankok ellen tényleg több sebzés okoz de ez csak azt eredményezi hogy ugyan olyan gyorsan öli meg a tankot és az adct is) hanem azok ellen a szerencsétlenek ellen akiknek kevés hpjuk van (ezt a max hpra értem) ugyanis ezek a képességek általában temérdek sebzést okoznak. ( khhmmm Darius 5 stack passiv Q 5Ulti Pentakill gg ez). Az assassinok meg ugyan olyanok mint régen csak opbbak mert ők használják igazán az adcnek adott tárgyakat igazán nem azok akiknek szánták. Így pedig esélyed sincs ellenük egyedül. ( Elnézéseteket kérem ha ez most sírásnak hangzik de már régóta idegesít ez a dolog ha bárkinek nem tetszik a véleményem szavazza le de nem akarok ezen vitázni.)","replies":[{"poster":"AKA PamutKecske","date":"2016-06-20T12:29:27.685+0000","title":null,"up_votes":2,"down_votes":0,"body":"Teljesen egyetértek.","replies":[]},{"poster":"92DorianGray92","date":"2016-06-21T09:03:24.479+0000","title":null,"up_votes":1,"down_votes":0,"body":"Érdekes, mind a hárommal a napokban találkoztam :D Urgot nyert az enemyben, nagyon erős volt, Seju hozzásegített (mondjuk...) engem egy hard carry győzelemhez, Poppyval épp tegnap játszottam, szétfeedelt egy Pantheont topon. Szerintem mindhárom hős simán játszható, erősebb alternatívák vannak, tény, de ha jó vagy vele, mindegyik champ megállja a helyét (Ekkoval 300 játék körül járok, a nerf után is ugyanúgy viszem, topra is, midre is, még mindig teljesen jól működik, mert ismerem és tudom használni).","replies":[]},{"poster":"Temp65432","date":"2016-06-20T19:50:10.307+0000","title":null,"up_votes":1,"down_votes":0,"body":"A témára nézve lényegtelen, hogy mi op és mi nem. Ez a fajta játék készítés egy bevett szokás, a legtöbb játék használja, tehát felesleges levetíteni 1-2 championra a dolgot. És amúgy fura az érvelésed mert poppyt meg sejuanit jóval többször látni mint például egy zacet vagy illaoit.","replies":[{"poster":"Orvvadasz1","date":"2016-06-20T20:58:10.230+0000","title":null,"up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tango The Shared,realm=EUNE,application-id=VFnq5EbB,discussion-id=ZFuNRkUE,comment-id=0000000000000002,timestamp=2016-06-20T19:50:10.307+0000)\n>\n> A témára nézve lényegtelen, hogy mi op és mi nem. Ez a fajta játék készítés egy bevett szokás, a legtöbb játék használja, tehát felesleges levetíteni 1-2 championra a dolgot. És amúgy fura az érvelésed mert poppyt meg sejuanit jóval többször látni mint például egy zacet vagy illaoit.\n\nAz vicces mert már vagy fél éve egyiket sem láttam. ( Bocs Zacet igen a hétvégén a gamemodeban).","replies":[]}]},{"poster":"Gabor3","date":"2016-06-20T14:46:31.129+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sokban függ attól, hogy mennyire könnyen használható egy karakter. Az assassinok sokat sebeznek, könnyű velük elmenekülni, legtöbbnél mana miatt sem kell aggódni. Könnyen kezelhetőek, így persze, hogy azok vannak előnyben.\nA tankok (meg assassinok ellen is) olyan champet kell hozni, akivel tudod, hogy \"jó\" vagy ellene, vagy legalább tartani tudod a lanet. Ha látod, hogy esélytelen a lane win, akkor védekezz, kérj segítséget. Láttam már Dariust, Illaoit is bénázni, sok függ a többi champtől és, hogy hogyan használják, okosan játszott e early gameben. Az viszont tény, hogy vannak undordítóan könnyen kezelhető karakterek. :D Csak azért OP-k, mert könnyebb vele játszani, mint pl egy Urgot, Zac, vagy Nunuval, akik ugyanúgy lehetnek brutál erősek, csak talán nem olyan könnyű velük elérni azt, mint pl egy Zed, Fizz vagy Akalival (személyes vélemény).\nAmúgy meg én szoktam látni Poppyt, Yorick pedig idén biztosan megkapja a reworkjét.\nGalio meg érdekes, mert nagyon ritka, de szerintem nagyon könnyen kezelhető champ, csupán tudni kell mely midesek ellen vihető.","replies":[{"poster":"FirstFizz","date":"2016-06-20T16:42:42.910+0000","title":null,"up_votes":1,"down_votes":2,"body":"Még egy ember aki lenézi Fizzt :D Mi bajotok vele már nem azért...Elmondom mi a mostani Fizz felállás a játékban :) \n\n1. A Bruiser Tank Fizz : aminek {{item:3078}} építesz viszont kevésbé tankosabb mint elődje aminek {{item:3025}} építettél. Leginkább basic attackból sebez és ezért van mindenki kiborulva rá mert ,,full op tank assasin és az E miatt meg sem lehet ölni gg rito''. Egy Trundle lazán megveri topon FIzzt sőt még egy Jax is. Ennyire op a Fizz.\n\n2. A full ap Fizz mid: elárulok egy nagy titkot hogy mi is a full ap Fizz lelke....az ultija :) Ha misseled  az ultit meghaltál,vagy jobbik esetben elment a free kill...ezek után is op? :D Vagy nehéz gankelni??? Még mindig könnyebb egy Fiztt gankelni mint egy LB-t vagy egy Katát :DD","replies":[{"poster":"Gabor3","date":"2016-06-20T19:49:00.014+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én a felugrását gyűlölöm, hogy miatta nagyon sok midest könnyen kijátszik + rengeteget sebez amúgy is. Az ultiját nem kell nézni, az egyáltalán nem zavaró szerintem. De össze vissza cikázik, mindent dodge-ol, rá még nagyot sebez. xD Persze vannak itemek, más mides champek, de akikkel én szeretek azok ellen nagyon rossz. :D Meg úgy alapból is, ha enemy mid Fizz, tapasztalataim szerint a mi midensük 80%ban veszti a lanet. Topról nem nyiltakozok, ott sokkal \"elverhetőbb\".\nKata pedig sokkal jobb, csak minimálisan kell tudni ellene játszani, LB az attól függ.","replies":[]}]}]}]}]}]},{"poster":"Xescure","date":"2016-06-20T20:39:10.862+0000","title":null,"up_votes":1,"down_votes":0,"body":"Érdekes nézetek... Szerintem igazad van ; )","replies":[]}]}