{"poster":"FirIlma","date":"2017-01-23T12:19:40.198+0000","title":"Különböző Rankok","up_votes":7,"down_votes":2,"body":"Egy &ouml;tlet.\r\nRank sztereotipi&aacute;k.\r\nSzem&eacute;lyes&iacute;ts&uuml;k meg őket, hogy k&uuml;l&ouml;nb&ouml;ző tulajdons&aacute;gokkal ruh&aacute;zzuk fel őket.\r\nEbből lehetne csin&aacute;lni egy k&eacute;preg&eacute;nyt - karakterekk&eacute;nt m&uuml;k&ouml;dnek, k&uuml;lsej&uuml;k is t&uuml;kr&ouml;zz&eacute;k milyen d&iacute;vizi&oacute;ban vannak.\r\nIlletve rankedbeli probl&eacute;m&aacute;kat is humorosan meg lehetne jelen&iacute;teni.\r\nMagic\r\n\r\nhttp://i.imgur.com/hFXLsr0.jpg\r\n\r\nhttp://i.imgur.com/DUMsLas.jpg\r\n\r\nMi a v&eacute;lem&eacute;nyetek? Milyen benyom&aacute;sotok van a k&uuml;l&ouml;nb&ouml;ző diviz&iacute;&oacute;kkal kapcsolatban?","replies":[{"poster":"Temp65432","date":"2017-01-23T12:30:56.683+0000","title":null,"up_votes":2,"down_votes":0,"body":"http://a.memegen.com/9lol3m.gif\n\n\n---\nNobody is nobody and everybody is weird like you and me.","replies":[]},{"poster":"Muffinpantsu","date":"2017-01-23T14:22:55.379+0000","title":null,"up_votes":3,"down_votes":1,"body":"Én nem igazám értem, hogy hogyan tükrözi a divíziót a rajz, szerintem a legtöbb emberről nem mondod meg első ránézésre egyébként sem, hogy ő most akkor bronz vagy master. Ha nem figyelem milyen szöveg van mellette, akkor nem biztos, hogy a challengerre nem azt mondanám, hogy bronz.\n\nEgyébként az elgondolás nem rossz, de ha már a diamondosokat olyan arisztokrata vonásokkal ruháztad fel, akkor a felette lévőket miért nem?:D\nA silverseket meg talán leginkább átlagosnak ábrázolnám (ami nekem pl a Challenger rajzával egyenlő), mert szerintem statisztikailag ott van a legtöbb játékos a bronz után.\n\n\nA lányok egyébként általánosan túl erős/éles arcvonásokat kaptak, ami nem túl feminin. Talán egyedül a platos csaj tűnik első ránézésre is annak, de a többiek mellett leginkább csak a jel teszi egyértelművé, hogy lányok.","replies":[{"poster":"ScreamForMeBaby","date":"2017-01-23T16:28:38.238+0000","title":null,"up_votes":1,"down_votes":7,"body":"A játék első 60 másodpercből belövöm a divíziód kábé. Csak abból ahogyan mozogsz, ahogy (nem) wardolsz.","replies":[{"poster":"Temp65432","date":"2017-01-23T16:43:21.617+0000","title":null,"up_votes":1,"down_votes":1,"body":"@Vioney arra gondolt, hogy kinézetről nem állapítod meg. Ha mész szembe az utcán egy taggal, akkor nem fogod tudni kinézetről megállapítani azt, hogy milyen divbe van, hacsak nem nagyon csúnya mert akkor valszeg korean challenger. (vicc volt, no butthurt pls)\n\nViszont a képen meg azok a tulajdonságok vannak megszemélyesítve, amiket az emberek álltalában gondolnak az adott divben játszókról. Pl a kezdő unranked aki azt se tudja hol van. A gold aki nagyon menőnek érzi magát, mert kap skint season végén. A dia aki \"arisztokratikusan\" lenéz mindenki. Az unott challenger aki már annyit játszott, hogy teljesen kiégett és úgy elver mindenkit, hogy le se szarja.\n\n---\nNobody is nobody and everybody is weird like you and me.","replies":[{"poster":"ScreamForMeBaby","date":"2017-01-23T18:17:17.174+0000","title":null,"up_votes":2,"down_votes":1,"body":"Nem szándékoztam érdemben reflektálni a dologra, csak offoltam kicsit. Az ötletet jónak tartom ugyan, de úgyis letojják magasról amit mi ide karcolgatunk. Egymás között beszélgetünk csak, semmi több. \n\nEgyébként meg szerintem simán lehetne ilyen csinálni, én szórakoztatónak találnám ha egy karakter megszemélyesítené a játékstílusom (ha már maga a játék nem ad lehetőséget a karakterek formázásra csak nagyon-nagyon-nagyon szűk keretek között).\nSzóval lehetnének alapból olyan ruhákban a karakterek, ami a divíziót jelöli, képviseli. Már a színből is egyből tudná az ember. A \"plecsnik\" pedig jelölhetik azt, hogy mennyire vagyok csapatjátékos, a szakadt ruha pedig azt ha inkább az alpári színvonalat képviselem.\n\nHa valaki most ezt beszólásnak vagy kritikának vette az eressze el a dolgot, tényleg csak beírtam az első gondolatom ami eszembe jutott minden bántó szándék nélkül.","replies":[]}]},{"poster":"Muffinpantsu","date":"2017-01-23T18:21:11.389+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kulcsmondat: \n> Én nem igazám értem, hogy hogyan tükrözi a divíziót a rajz, szerintem a legtöbb emberről nem mondod meg első ránézésre egyébként sem\n\nNyilván nem a játéktudásra gondoltam, amikor a divíziók vannak megszemélyesítve a képeken, emberi arcokkal...","replies":[{"poster":"ScreamForMeBaby","date":"2017-01-24T07:33:18.822+0000","title":null,"up_votes":1,"down_votes":0,"body":"Még mindig nem akartam érdemben hozzászólni, csak félálomban ide véstem valamit, minden ártó szándék nélkül. De köszönöm a hatodik helyesbítést.:D","replies":[]}]},{"poster":"M4dr4c","date":"2017-01-23T16:43:10.019+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ugye tudod, hogy teljesen másról beszélsz?","replies":[]}]},{"poster":"FirIlma","date":"2017-01-23T20:04:46.951+0000","title":null,"up_votes":1,"down_votes":0,"body":"dündündünDÜÜN.\nreflektálva hogy \"magatok közt beszéltek\"\n\na problémát értem, és igazából hosszabb leírásokkal nem akartam terhelni a posztot, mivel \"papíron\" úgyis csak a fejek vannak meg.\naz hogy kicsoda hogy néz ki csupán a személyes impreszióm különböző divizíókról, de mivel jelenleg nincs több rajz - kicsit magyarázom kinek miért és olyan a kinézete.\n\nmindenekelőtt a tüsis haj - vagyis inkább érdekes frizura maga az adot rank szimbolumának egyik részét próbáltam felhasználni - mivel ezek az első sketchek a karakterekről még bőven fog változni, de ezt az elemet mindenképpen meg szeretném tartani (mármint hogy fura frizurák)\nilletve amit nem mondtam. a képekről nem látszik de egy adott divizion belül a magasságok megegyeznek. a bronzeosok a legalacsonyabbak, a silveresek picivel magasabbak és így tovább. egyénenként divizíón belül nem változik se a magasság se a testalkat, csak a rájuk jellemző, kicsit karakterformáló ruházat vagy hajstílus.\n\nruházatukról pár szót - elég képlékeny a dolog, de mindenképpen a rank szimbolumók ismérveit fogja erősíteni.\na challengereknél felhasználom, hogy kaptak egy kabátot Riottól, így pl ők leginkább erről lehet felismerni őket. diások ruhája is csak úgy fog ragyogni akár a diamond jel, és így tovább. de egyenlőre még nincsenek konkrét ötleteim ezekkel kapcsolatban még eléggé csak körvonalazodnak.\n\ns i l v e r : az első ami eszembejutott róluk hogy edge teen. hétköznapiak ám sok silveres ismerősömtől láttam, hogy rájuk nem az állandó saltynesség a legmeghatározóbb hanem ahogyan gondolkodnak magukról. egy bizonyos fokú befordultság - kijutottak bronzeból elértek valamit, de még nem teljesen \"felnőttek\". tudnak dolgokat de nem mindent. reflexszerűen is a kamaszokra asszociáltam velük kapcsolatban, és ez a gondolat befészkelte magát.\n\ng o l d : a legmeghatározobb tapasztalatom velük kapcsolatban kétségkíbül Sky Williams egyik videója, ahol szinta kulcsmondatként hangzott el: \"We are in gold _everything_ works\"  - így a goldosoknak maguk a viselkedésük kicsit nihilista talán? illetve exhibicionisták. (az már csak maga az arany miatt lett ilyen benyomásom)\n\np l a t: well.... róla van a legkevesebb élményem - egy ismerősöm segít és ő azt állította viszonylag ők a legnormálisabbak. elég magas helyet értek el, viszont nincs egy görcsös következő szintbe jutás*. így őket tettem meg mint \"pozitív\" szereplői a történetnek.\n\nd i a m o n d: hírnév dicsőség. szinte a legmagasabb rank** amit egy játékos elérhet. viszont maga a saltynesség megnövekszik, a görcsös challenger rankba jutás miatt*. itt a kinézet szintén a diamond csilli-villi kinézete miatt alakult így.\n\nc h a l l e n g e r: egy csapat huligán akik még egymást is ekézik, nemhogy a kisebb divíziókat. a legtetején állnak ennek a piramisnak így olyan dolgokat is megengedhetnek maguknak, ami más ranknál elképzelhetettlen. hallottam hogy régebben voltak \"gatekeeper\" challnegerek** - vagyis ha a promoban lévő diamondos nem tetszett a challengereknek nem engedték tovább eltrollkodták a játékot. viszont ha szimpatikus volt, akkor jöhetett a challengerek köze.\n\nkb így nutshellben a gondolataim a különböző rankokról. hangsúlyozom - nem teljesen pontos. ha nagyon reálisak akarok lenni _minden rank toxic unszimpatikus karaktert személyesítene meg_ . engem viszont kicsit taszít ez a feltevés, hogy az összes rank másképpen toxic és salty. egysíkú lenne és szeretnék ezeknek a \"karakterek\"nek teret és mélységet.\nnem azért fog blamelni mert _eleve_ ez a szerepe hogy ilyen legyen - hanem mert _az ingerek amik játék közben érték, karakterileg így reagálna_","replies":[]}]},{"poster":"mate0727","date":"2017-02-06T15:25:55.860+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kihagytad a Master rangot.","replies":[]},{"poster":"kezeslabas","date":"2017-01-23T15:50:32.804+0000","title":null,"up_votes":1,"down_votes":0,"body":"Simán lehetne a kliensben egy ilyen \"Karakterlap\" mint a képen! :D\nA Skill-t mérhetné a játék a Ranked játékokban elért minősítések alapján.\nA Teamwork-öt a Honor rendszerből már megszokott rendszerrel lehetne mérni, vagy a mecseken elért Kill participation alapján.\nA Patience-t és a Saltyness-t nem tudom hogy lehetne mérni :D\n\nDe lehetne mondjuk pár stat, amit lehet mérni a meccsek alatt mint Farming vagy Warding.","replies":[]}]}