{"poster":"xXLumpsluck5Xx","date":"2014-09-11T18:11:33.243+0000","title":"Új hősötletek","up_votes":5,"down_votes":0,"body":"Sziasztok!\nEzt a hőst nemrég dolgoztam ki.\nKérnék szépen véleményeket és esetleges javítási ötleteket.\nKösz hogy ránéztél:)\nYalanos\nA halál bérgyilkosa\nÉleterő: 410 (+80 szintenként) \nMana: 265 (+40 szintenként) \nSebzés: 44 (+3.6 szintenként) \nTámadási sebesség: 0.64 (+3% szintenként) \nMozgási sebesség: 340\nÉleterő-regen: 6.5 (+0.6 szintenként) \nMana-regen: 5.5 (+0.5 szintenként) \nPáncél: 16.5 (+3.5 szintenként) \nVarázsellenállás: 30 (+0 szintenként) \nLőtávolság: 550\n\nPasszív: Bónusz töltési idő csökkenést ad a közel lévő ellenséges hősök száma alapján:\n\n1 hős: 5%\n2 hős: 10%\n3 hős:15%\n\n\nQ, Sötét dobócsillagok \nYalanos egy dobócsillagot dob egy kijelölt területre, amely sebzést okoz a célterületen tartózkodó és a dobócsillag útjában lévő ellenfeleknek. A dobócsillag 5 másodpercig a földben marad.\nTöltési idő: 10 másodperc és maximum 3 Sötét dobócsillagot tárolhat. ( A töltetek közti töltési idő: 4,4/3,8/3,2/2,6/2 másodperc)\n \n\n\nKöltség: 50/55/60/65/70 mana\nHatótáv: 850; Szélesség: 60; Becsapódási kör átmérője: 150\nSebzés: 65/90/125/170/220 (+a bónusz sebzés 75%-a) fizikai sebzés\nMinden sötét dobócsillag 1 másodperccel csökkenti a Sötét energia képesség töltési idejét.\n\nW, Sötét energia \nYalanos sötét energiát vezet a földben lévő Sötét dobócsillagaiba.\nA dobócsillagokon tartózkodó ellenségek sebzést szenvednek el és lelassulnak.\nHa a dobócsillagok közül többen is megkapják a hatást, egy 30 egység széles energiasáv jön létre közöttük, amely 1 másodpercig a helyén marad és az áthaladó ellenségek 1 másodpercre 30%-kal lelasulnak.\nHa a sötét energia képességet használjuk, a földben lévő dobócsillagok megsemmisülnek.\nKöltség: 100 mana\nTöltési idő: 22/20/18/16/14 másodperc\nHatótáv: 1500 (1500 egységnyi távolságon belüli Sötét dobócsillagok kapják meg a hatást)\nSebzés: 70/80/90/100/110 (+40% sebzés) varázssebzés\nLassítás: 20/25/30/35/40%; Hatás: 3 másodperc\n\nE, Az elfeledett technika \nYalanos egy kétfázisú ugrást hajt végre: először a kijelölt területre ugrik, majd 0,5másodperc elteltével Az elfeledett technika segítségével egy hosszabb ugrást hajt végre mely nyomán sötét erők kezdenek kavarogni mely 1,5 másodpercig tart és az áthaladó ellenfelek sebződnek és lelassulnak.\nAz irányításához nyomd le az E billentyűt, (ez az első ugrás helyét jelöli ki) majd húzd az egeret a kívánt irányba (a második ugrás). (Mint Victor E-je)\n\nKöltség: 60/70/80/90/100 mana\nTöltési idő: 15/14/13/12/11 másodperc\nElső ugrás hatótávja: 200\nA második ugrás hossza: 400\nSebzés: 80/90/100/110/120 (+70%varázssebzés)(+20%sebzés) varázssebzés\nLassítás: 25%; 2 másodperc\n\nR, Végső képesség: Kivégzés \nYalanos egy 12 ágú dobócsillagot vesz elő majd beledobja a célpont ellenséges hősbe fizikai sebzést okozva neki.\nA Sötét energia képesség töltési ideje 1 másodpercRE csökken.\nA Kivégzés képességen is használható a Sötét energia képesség.\nAmennyiben ez a képesség megöl egy ellenséges hőst, Yalanos sebzése 10 másodpercre 35/40/45%-kal megnő.\nKöltség:100 mana\nTöltési idő: 84/72/60 másodperc\nSebzés: 175/225/275 (+50% sebzés) fizikai sebzés\nHatótáv: 600\n\n\n\n\nHáttértörténet: Yalanos Noxusban született. Mesterének már fiatal korában megmutatta, hogy tud ölni. Egyszer összekapott tanítója másik növendékével, és amikor a veszekedés elfajult, habozás nélkül megölte. Egy későbbi vitában megpróbált végezni tanítójával is, de mestere végül legyőzte. Yalanos nem halt meg de megsebesült és végleg száműzték Noxusból. \nEl is indult északnak ahol az egyre súlyosabb sebeit végül egy Zaun-i gyógyítómester látta el, és végül teljesen rendbejött. Tovább folytatta vándorútját és eszébe jutott, hogy milyen régen ölt. Kívánta a gyilkolást. Betért mindenhová ahol kihívást jelenő emberek voltak és mind megölte. Minél többen voltak annál jobban koncentrált és annál hatékonyabb volt. Egyszer egy ember felfigyelt rá. Ennek az embernek sok ellensége volt, tehát Yalanos-nak nagy öröme volt hiszen azt tehette amit szeretett és még fizettek is neki.\nEgyik nagy csatájában mégis sikerült legyőzni. Nagyon sok ellenfele volt akik megsebzése után könnyedén végeztek vele.\nLelke kóborolt, míg el nem ért az Árny szigetekre. Ott megtanulta hogyan szerezhet magának sérthetetlen alakot és ősi technikákat is tanult.\nYalanos felszabadultabban érezte magát és erősebnek, mint valaha.\nÍgy visszament Noxusba ahol végzett mesterével és ezelőtt végzett minden ellenfelével, akit útja során szerzett. Rájött azonban, hogy neki ez már nem kihívás, ezért csatlakozott a Legendák Ligájához hogy minden ölés kihívást jelentsen, és hogy újra élvezze azt.\n\nÁltalános: Yalanos magas és sovány. Ruhája kékesszürke és sok helyen szakadt; ezeken a szakadásokon a belőle áramló energia szivárog ki, mely pirosas fényben izzik. Maszkot visel, mely ruhája színével egyezik és szeme a ruhája szakadásainál kissé élénkebb narancssárgás piros színt bocsájt ki. Cipője foszlott, bőr barnásszürke.\nDobócsillagjainak 3 hosszú görbe ága van és felkarján, combján, bal lapockáján, valamint a kezében vannak: ezeket használja alaptámadásokra és a Q képességére.\nA jobb lapockáján egy nagyobb átmérőjű 12 ágú dobócsillag van: ez a végső képessége.\nHangja mély és hangsúlytalan, szinte suttogó.","replies":[{"poster":"silentmate","date":"2014-09-15T17:07:21.595+0000","title":null,"up_votes":2,"down_votes":0,"body":"Egyáltalán hova lehet ilyeneket küldeni amit tényleg meg is néznek?","replies":[{"poster":"Sadraal","date":"2014-09-15T18:35:36.610+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sehova :D\nA magyar fórumot is \"látja a RITO\", ugyanis vannak magyarok a Riotnál, csak éppen ők egyáltalán nem foglalkoznak a rajongói alkotásokkal.\nLáttam már jó ötletet itt és a Facebookon is, de pont annyira le vannak tojva, mint az általam tervezett karakterek.\nElhiszem, hogy van sok katasztrofális ötlet is, de úgy gondolom, hogy a jobbak megérdemelnének egy kicsit több figyelmet is.","replies":[]},{"poster":"xXLumpsluck5Xx","date":"2014-09-15T17:38:36.620+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egy másik fórumra ahol Mr.RITO is látja \nam légyszi egy véleményt is írj akkor már","replies":[]}]},{"poster":"Mikasa Ackerman9","date":"2014-09-11T18:50:01.895+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T04:52:35.297+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi szépen tényleg sok munka volt vele.\nSajna igazad van a RITO ügyben de az egyik munkatársukkal ezt leleveleztem(amúgy neki is tetszik) és azt mondta ha a magyaroknak tetszik fordítsam le és tegyem ki egy másik oldalra ahol a FŐ-RITO-sok is láthatják.\nSajna a rajzolásban nem vagyok nagy profi(főleg gépen) ezért írtam bele az Általánosba","replies":[{"poster":"Sadraal","date":"2014-09-12T14:10:47.682+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez a levelezés ismerős :D\nNekem is pont ezt írták, ezért le is fordítottam az első terveket, aztán megcsináltam a részletes kitet és a base statokat hozzá, majd elküldtem újra. Azóta is várok valami visszajelzést... :D","replies":[]},{"poster":"KuvinFukinAtya","date":"2014-09-12T05:20:34.075+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ebben Szerintem segíthetek:)","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T06:14:58.128+0000","title":null,"up_votes":1,"down_votes":0,"body":"hogyan?","replies":[{"poster":"KuvinFukinAtya","date":"2014-09-12T10:13:44.358+0000","title":null,"up_votes":1,"down_votes":0,"body":"Konyítok egy kicsit a rajzhoz :)","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T11:44:29.588+0000","title":null,"up_votes":1,"down_votes":0,"body":"az jó:D","replies":[]}]}]}]}]}]},{"poster":"KuvinFukinAtya","date":"2014-09-11T19:44:18.288+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az ötlet brutálisan jó. Nagyon tetszik. Azzal a q-w comboval miket lehetne alkotni..\nÉn is szívesen látnám a játékban.Ha gondolod van pár ismerősöm akivel elég konkrét dolgokat lehet alkotni. Megcsinálhatnánk eggyüt. A Photoshoppal tudok kezdeni dolgokat.😏  Egy kérdésem viszont van . Az r képesség csak szerintem gyenge?(szerintem jobb lenne az ha ezzel finishel egy herot akkor  30%/40%/50%-val erősödne az adja valamint a töltési ideje  ugyan annyi %ál csökenne. A buff 10 secig marad rajta.)","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T04:48:56.348+0000","title":null,"up_votes":1,"down_votes":0,"body":"az ötlet jó köszi talán az általad javasolt buff kicsit sok de igazad van:)","replies":[{"poster":"KuvinFukinAtya","date":"2014-09-12T05:15:01.295+0000","title":null,"up_votes":1,"down_votes":0,"body":"😎 gondoltam hogy op nak találod majd de szerintem nem annyit sebez mint egy átlag ulty.Szerintem a damage buff tényleg kicsit sok ellismerem .","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T06:14:08.802+0000","title":null,"up_votes":1,"down_votes":0,"body":"esetleg a base dmg-t növelhetném","replies":[{"poster":"KuvinFukinAtya","date":"2014-09-12T10:10:30.142+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szentem amit kitaláltam illik a nevéhez :) a damage így szentem jó ha rá rakod a buffot","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T10:12:40.524+0000","title":null,"up_votes":1,"down_votes":0,"body":"akkor így jó lesz? \"a buff adna 35-40-45% AD-t\"","replies":[{"poster":"KuvinFukinAtya","date":"2014-09-12T12:11:48.098+0000","title":null,"up_votes":1,"down_votes":0,"body":"Tökéletes.","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T12:53:20.066+0000","title":null,"up_votes":1,"down_votes":0,"body":"ok most nézd meg","replies":[]}]}]}]}]}]}]},{"poster":"xXLumpsluck5Xx","date":"2014-09-12T04:59:36.818+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mit szólnál ha a buff adna 35-40-45% AD-t =>Úgyis egyre több lesz neki ahogy buildel tehát nem kell nagyon túlzásba vinni/Töltési idő csökkentést egyáltalán nem adnék amit mondtál az már 2-es ulti szinten is eléri a maxot és amúgy is  kap passzívból","replies":[]}]},{"poster":"DonyHUN","date":"2014-09-12T11:04:54.691+0000","title":null,"up_votes":1,"down_votes":0,"body":"hmm","replies":[{"poster":"xXLumpsluck5Xx","date":"2014-09-12T11:44:04.118+0000","title":null,"up_votes":1,"down_votes":0,"body":"???","replies":[]}]},{"poster":"Kadegrow","date":"2014-09-12T10:46:29.168+0000","title":null,"up_votes":1,"down_votes":0,"body":"Grat a hőshöz. Jó lett nagyon. :D enyém is lassan készen van már aztán én is felrakom mert rengeteg hősöket raknak már fel mostanság :D","replies":[]}]}