{"poster":"IramenExiliado","date":"2016-04-11T21:11:29.431+0000","title":"unranked lvl 30 vs diamantes y platinos.","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Desde el viernes subi al lvl 30 con 130 victorias 119 derrotas, al tal punto que de la nada todo este fin de semana me han tocado en mi team y en contra puros platinos y diamantes.. y eh perdido casi (porque algunas las eh ganado ) todas las partidas. yo no estoy totalmente acostumbrado a jugar con gente de elo alto..  a tal punto que las derrotas me estan llegando a los 129 derrotas.. &iquest; como soluciono esto? es bueno o malo? trato de jugar bien pero llega al punto de perder tanto que ya me aburre tener las cosas asi..","replies":[{"poster":"AuroraExecution","date":"2016-04-11T21:21:56.077+0000","up_votes":2,"down_votes":0,"body":"Es bueno que te toque con gente de mejor nivel, asi podes aprender cosas nuevas y otras formas de jugar.\n\nOtra tema es que el mmr de las normales es distinto al mmr de rankeds.","replies":[{"poster":"IramenExiliado","date":"2016-04-11T21:25:12.639+0000","up_votes":1,"down_votes":0,"body":"si las normales, todavia no tengo campeones ideales para las ranked XD","replies":[]}]},{"poster":"Sonya Kyron","date":"2016-04-11T21:26:38.841+0000","up_votes":1,"down_votes":5,"body":"tuviste suerte, cuando yo jugue mis 10 unranked en una me toco contra 3 diamantes y 2 platinos y en mi team 1 oro y 4 unranked.\n\nes muy normal que pase eso cuando riot te quiere hacer perder a proposito. se soluciona cuando quedes rankeado en bronce o plata ya no te van a tocar ni diamantes ni platinos en rankeds y probablemente lo maximo sean ORO 5.","replies":[{"poster":"Annie Botz","date":"2016-04-11T22:01:30.764+0000","up_votes":4,"down_votes":1,"body":"De hecho es bastante improbable ya que el MMR tiene una base que esta entre Plata y Oro, muy difícil que te toquen diamantes en rank (en mis rank casi siempre son todos d5 en adelante, una que otra vez platino 3 2 1)","replies":[{"poster":"Sonya Kyron","date":"2016-04-12T04:18:50.570+0000","up_votes":1,"down_votes":2,"body":"recorda que lo del MMR no se aplicaba para unrankeds antes del 20 de febrero de 2016.\nCon lo cual un high elo de la season anterior podia tener 5 challenger vs 1 plata + 4 unranked por ejemplo, tal como me toco a mi.\nNo se para que me dan negativos si soy uno de los 30 o 40 jugadores que entienden los sitemas de MMR y emparejamiento en todo el server.","replies":[{"poster":"Neros II","date":"2016-04-12T05:02:56.088+0000","up_votes":1,"down_votes":0,"body":"El MMR oculto funciona desde que salió el juego para cualquier modo de juego, menos ARAM que tiene un emparejamiento bastaaaante random. Uno de los 30 o 40 jugadores que entiende algo de 450.000 o más? Y crees que el MMR de unrankeds no existía antes de Febrero de este año cuando el juego tiene 6 años? Poné la captura de pantalla de esa partida por favor.","replies":[{"poster":"Sonya Kyron","date":"2016-04-12T05:30:09.638+0000","up_votes":1,"down_votes":2,"body":"como no lo vas a entender te dejo el link que lo explica mejor que yo.\nhttp://www.elitepvpers.com/forum/league-legends-trading/4028634-need-duoq-partner-7-games-read-first-euw.html\n\npd:el elo es oculto mientras seas unranked. despues todos lo saben.","replies":[]}]}]}]},{"poster":"IramenExiliado","date":"2016-04-11T21:45:30.504+0000","up_votes":1,"down_votes":0,"body":"estar perdiendo todo el dia porque me tocan diamantes no me gusta nada.. ya me aburri y quiero volver a la normalidad cuando ganaba a cada rato ... esto de tener buen \" MMR \" no me sirve a mi","replies":[]}]},{"poster":"Annie Botz","date":"2016-04-11T21:59:27.775+0000","up_votes":1,"down_votes":1,"body":"=He perdido, he ganado.=\nEstoy seguro de haber hecho un post parecido hace ya su tiempo (más de 1 año) con la misma queja (en su momento llegué a ver challenger o.o)\nLa verdad es que esto es como cuando eres lvl 1 - lvl 29 los otros juegan premade y te enfrentas con gente de nivel 30 o cercano.\nSé perseverante y mejora tu juego, la mayoría de las personas juegan por diversión o para probar cosas nuevas en normal (o también para practicar con un champ en específico)\nA mí me pasaba igual que a ti y no me gustaba perder, pero aunque lo creas son pocas las opciones.\nYo (aunque suene tedioso)  me creé otra cuenta para volver a reforzar lo que aprendí en el juego (por la diferencia de nivel).\nJugué muchas veces Lee Sin y llegué desde Bronce I (por inactividad) hasta D5 Por aprender a jugar Lee.\nFueron unas 200 partidas en las que gane unas 120 y perdí 80 aprox. aunque eso ya es otra historia (ya que son ranks :v)","replies":[{"poster":"Sonya Kyron","date":"2016-04-12T04:22:42.697+0000","up_votes":1,"down_votes":1,"body":"cuidado que a ORO 5 es lo maximo que se podia bajar por inactividad, lo demas fueron manqueadas puras seguidas, igual que como baje yo de plata 2 a bronce 5. Porque podria estar meses y jamas te bajan.","replies":[{"poster":"Annie Botz","date":"2016-04-12T21:51:59.592+0000","up_votes":1,"down_votes":0,"body":"Cuidado que esta cuenta es de finales del 2011\nFueron 10 ranks a lo que salga en el 2014 (no me animé a dar las 10 en el 2013) y en su momento te quitaban lp por inactividad en todas las ligas menos en bronce.\nAhora el sistema cambió","replies":[]}]},{"poster":"IramenExiliado","date":"2016-04-11T22:37:09.588+0000","up_votes":1,"down_votes":0,"body":"B1 a D5 solamente usando lee sin? O.o wtf te quedaste loco seguro XD","replies":[{"poster":"Annie Botz","date":"2016-04-11T23:20:36.217+0000","up_votes":1,"down_votes":0,"body":"Bueno tampoco tanto, pero ayudó en su momento, también jugaba soporte- mid y me iba bastante bien.\nEl vicio es fuerte!","replies":[]}]}]},{"poster":"Manzaníto","date":"2016-04-12T01:52:57.164+0000","up_votes":1,"down_votes":0,"body":"estos del lol están borrachos cuando hacen los emparejamientos. y se rascan las bolas todos el dia.","replies":[]},{"poster":"Hell Darking","date":"2016-04-12T00:01:45.050+0000","up_votes":1,"down_votes":0,"body":"a ti te carrearon cierto? tienes mucho elo pero no sabes jugar bien.. es lo unico que puedo ver de este post","replies":[]},{"poster":"teemo reumatico ","date":"2016-04-11T23:40:44.457+0000","up_votes":1,"down_votes":0,"body":"yo en mis primeras partidas de posicionamiento juge 8 vs oros plata bronces unrankeds,las gane. y las ultimas dos  vs platinos y diamantes las perdi . y si se siente feo por que no tenes casi posibilidad de contrarestar el juego en equipo que se alcanza a ese elo . pero bue te  sirve de leccion. deberias estar orgulloso y feliz de jugar vs esos elos asi aprendes mas . suerte <3","replies":[]},{"poster":"Sherpard","date":"2016-04-11T22:26:44.167+0000","up_votes":1,"down_votes":0,"body":"Si te toca contra gente de elo alto, es porque tu elo en normal es bastante alto.\n\nEs algo bueno, porque algunas veces podes ver como juegan y \"copiar\" jugadas de ellos y ver que hacen en cada momento de la partida.\n\nA mi hasta ahora lo mas alto fueron 2 challenger (uno en mi team y otro en el contrario) bastante entretenido verlos jugar normal.","replies":[]},{"poster":"martincarp","date":"2016-04-11T21:21:30.235+0000","up_votes":1,"down_votes":0,"body":"Por empezar supongo que hablas de partidas normales, así que no deberías mentalizarte con que estás jugando contra gente de mejor nivel, ya que la mayoría de las personas de ligas de Platino hacia arriba utiliza las normales para practicar campeones y roles que no usarían en partidas clasificatorias. Por ejemplo si yo juego mid o top soy capaz (me pasa de hecho) de perder contra personas Plata u Oro, simplemente porque mi nivel en esos roles es mucho más bajo que en mi rol principal o mi rol secundario.\nY segundo, deberías aprovechar para ver que es lo que hacen que te sacan tanta diferencia, que tienen en cuenta para aprovechar cada uno de tus errores, y aprender en base a esa observación. Al fin y al cabo son partidas normales, lo único que afecta es si ganas más o menos PI, y si obtienes chances de recibir un fragmento de llave de la artesanía Hextech.","replies":[]},{"poster":"Krew i Wino","date":"2016-04-11T21:21:09.152+0000","up_votes":1,"down_votes":1,"body":"diamante en que sentido en marcos o partidas ganadas? explica pls por con elo no creo que sea","replies":[]}]}