{"poster":"CaHaiS","date":"2018-11-13T08:27:16.888+0000","title":"Porque son tan desbalanceados los emparejamientos?","subforum":"Charlas Generales","up_votes":8,"down_votes":2,"body":"Tengo mucha  bronca, mis ultimas 3 ranked jugue 1 vs 9 literalmente, la primera me fedie pero ni uno venia bien todos 0-7 1-8 4-10, la segunda estaba mas peleado con mi oponente de linea aunque venia 1-0 y ganandole en farm pero al min 10 ya perdiamos 15-1 en el global y en la ultima venia bien en farm y 5-1 pero el resto 0-4 1-5 el mid 8-8 , ni uno que saque ventaja o que sepa aprovechar las kills, porque emperejan tan mal, esto es o ganas por paliza al min 20 o perdes por paliza al min 20 y no importa si jugas bien o mal, jugas completamente solo","replies":[{"poster":"Vino y Falopa","date":"2018-11-13T08:37:18.628+0000","up_votes":10,"down_votes":1,"body":"El que tiene que aprovechar las kills sos vos, una vez que mataste 2 o 3 veces al de tu linea ya vas a tener libertad para moverte y ayudar otras lineas.. No sirve ir 10 0 en mid si mataste al mismo tipo y no intentaste dar una mano al jg en invadiar a divear bot o ir a top a ayudar o forzar un flash.. Va nose segun leo siempre vas bien y vas feed dopa el koreano saco una guia de como moverte y como jugar la linea miratela da consejos muy claves xD","replies":[{"poster":"Lorian","date":"2018-11-13T08:56:48.359+0000","up_votes":2,"down_votes":1,"body":"Claro es como dice el, si no utilizas la ventaja que sacaste no vas a hacer nada, de igual manera tambien cuenta el pick con el que vayas ese score, no es lo mismo ir \n 10-0 con un teemo que ir 10-0 con un talon o kassadin que pueden rotar 8 veces mas","replies":[]},{"poster":"Light Z","date":"2018-11-13T13:21:22.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vino y Falopa,realm=LAS,application-id=v7qsfXsE,discussion-id=A4nUZXPJ,comment-id=0000,timestamp=2018-11-13T08:37:18.628+0000)\n>\n> El que tiene que aprovechar las kills sos vos, una vez que mataste 2 o 3 veces al de tu linea ya vas a tener libertad para moverte y ayudar otras lineas.. No sirve ir 10 0 en mid si mataste al mismo tipo y no intentaste dar una mano al jg en invadiar a divear bot o ir a top a ayudar o forzar un flash.. Va nose segun leo siempre vas bien y vas feed dopa el koreano saco una guia de como moverte y como jugar la linea miratela da consejos muy claves xD\n\nHola, si por casualidad tenés la guía me la pasas?","replies":[{"poster":"Jhäö","date":"2018-11-13T14:28:53.763+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ligthx Project,realm=LAS,application-id=v7qsfXsE,discussion-id=A4nUZXPJ,comment-id=00000001,timestamp=2018-11-13T13:21:22.708+0000)\n>\n> Hola, si por casualidad tenés la guía me la pasas?\n\nBusca en you tu be amigou","replies":[]}]}]},{"poster":"ShyLink","date":"2018-11-13T14:21:29.669+0000","up_votes":2,"down_votes":0,"body":"Pues para mi lo son, el otro dia me toco jugar contra un oro y un plata 3...¡Soy Bronce 2! y jugaba solo, no estaba jugando en equipo con alguien de buen elo y tampoco lo hice con anterioridad.","replies":[]},{"poster":"Malware","date":"2018-11-13T12:28:04.979+0000","up_votes":2,"down_votes":0,"body":"Si ya sabes como feedearte solo necesitas aprender a hacer roam. Ayuda a tu equipo a que se fedee, vos solo podrias ganar, pero no lo estas haciendo, asi que ayudalos a ayudarte. Si son malos no van a subir y no los vas a ver mas, si son buenos entonces no vas a tener de que quejarte.\nLos comebacks son posibles. Lo unico importante es que no seas de esos odiosos que ni bien el enemigo hace la first blood dice GG go next.\nEsos merecen la muerte, ban y que los viole su tio.\n\nSaludos.\n{{sticker:katarina-love}}","replies":[]},{"poster":"Never more 20","date":"2018-11-13T14:13:58.738+0000","up_votes":1,"down_votes":2,"body":"Sos un manc0 eso pasa jajajaja\nLas provabilidades de tener un team asi son de 50% eso significa esas personas te pueden tocar en el otro equipo y es free win, pero muchacho me parece que llegaste a tu limite, cuando las partidas se ponen mas dificiles significa que es tu limite y que te falta aprender mas, es decir, ser mejor jugador para poder carrear.","replies":[{"poster":"skylex157","date":"2018-11-13T16:39:03.512+0000","up_votes":1,"down_votes":0,"body":"Es lv 38, debe ser bronce XD","replies":[{"poster":"N4V1D4D","date":"2018-11-13T16:45:28.833+0000","up_votes":1,"down_votes":0,"body":"Basandonos en tu lógica que debería ser yo que soy  lvl 80?","replies":[{"poster":"skylex157","date":"2018-11-13T23:37:18.836+0000","up_votes":1,"down_votes":0,"body":"me refiero que el sistema de lv30+ existe desde principio de año, asi que si sos lv 38, es que empezaste a jugar al juego hace relativamente poco, no es lo mismo que nuestros casos que somo gente que juega de vez en cuando y ya, ese tio o es relativamente nuevo (ya que minimo 2 años te tardas en entender toda la complejidad del jeugo para ser decente) o juega extremadamente poco, asi que puede haber perdido habilidad, en cualquiera de los casos, lo mas posible y mas aun con la queja de niñato de que le tocaron 3 partidas malas y por lo tanto el juego tiene el match making roto apoyan el hecho de que sea bronce o en el mejor de los casos plata","replies":[]}]}]},{"poster":"CaHaiS","date":"2018-11-13T19:45:56.939+0000","up_votes":1,"down_votes":0,"body":"Te juego un 1 vs 1 a ver que  tan bueno sos","replies":[]}]},{"poster":"N4V1D4D","date":"2018-11-13T16:44:09.642+0000","up_votes":1,"down_votes":0,"body":"De esto vengo hablando AÑOS  {{champion:45}}   el sistema de emparejamiento esta hecho adrede de esta manera si  venis ganando 10 seguidas te empareja con laguno o algunos que vengan perdiendo varias seguidas, si venis perdiendo muchas te emparejan con algiuien que viene ganando varias seguidas,obvio que no se da siempre pero masomenos es asi.Por que es asi? por que si la gente subiera rapido de liga dejaria de jugar por ende hacen el sistama de subida complicado para qe ganes 2 partidas,la tercera la pierdas y digas a... gane 2 perdi 1 voy a ver de nuevo,vuelves a perder y te empecinas en salir positivo \"ganando\" y terminas el dia  jugando 10 partidas ganando 6 perdiendo 4, y \"avanzando de a poco\"  (Eso pasa cuando nos abes carrear o no te da la habilidad para tal asunto) El objetivo principal de riot no es hacerte pasar malas exp sino crear en ti una adicción para su ultimo fin que es que inviertas dinero y . Juego desde la season 2 algo entiendo del juego","replies":[]},{"poster":"skylex157","date":"2018-11-13T16:36:49.945+0000","up_votes":1,"down_votes":0,"body":"Intentaste usar a tryndamere o veigar en vez de un tanke?","replies":[]}]}