{"poster":"Fukai shi ","date":"2015-12-23T05:34:12.014+0000","title":"necesito consejos como mejorar mi rendimiento de adc soy diamond 5","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"buenas para aquellos que estan leyendo esto , soy diamond 5 main carry bueno ex ya que al llegar a diamante decai mucho en mi nivel cde adc quiero recuperarlo pero no se como. deje de jugar carry para despues voler pero no pasa nada nose que hacer necesito ayuda recomendaciones :7\r\n\r\nSaludos y Gracias","replies":[{"poster":"Blachu","date":"2015-12-23T05:39:51.215+0000","up_votes":2,"down_votes":0,"body":"ve teemo adc eso te va a dar el poder de ser mejor adc","replies":[]},{"poster":"Sonya Kyron","date":"2015-12-23T12:39:26.493+0000","up_votes":1,"down_votes":1,"body":"Hola, soy \"ultra pro\" (ex plata 2 ex bronce 5). Tenes que saber que todo jugador tiene varios limites de habilidad.\nCada limite de habilidad es independiente de cada champ.\nSeguramente sos un excelente jugador con todos los champs, con algunos mas que con otros.\nPero en realidad no conoces cual es tu limite, la unica forma de saberlo es ponerte a prueba bajo condiciones normales.\nEs decir a bajisimos ms (entre 12 y 50) y altos FPS ( 60 Fps constantes) ya que casi todos los monitores dan eso (o si tenes de los otros 80, 90, 100 o 120 fps).\nCuando sepas lo que podes dar y con que champ, sabes hasta donde podes llegar.","replies":[{"poster":"Fukai shi ","date":"2015-12-23T13:17:42.500+0000","up_votes":1,"down_votes":0,"body":"gracias por la ayuda :D","replies":[{"poster":"Sonya Kyron","date":"2015-12-23T13:43:17.630+0000","up_votes":1,"down_votes":0,"body":"si podes anotame aca a cuantos FPS y MS estas jugando y te puedo decir si se puede mejorar o no, si estas al maximo\nsolo es cosa de entrenar y cuando tengas 500 partidas con cada cham vas a haber encontrado tu máximo.\n\nEl camino de la perfeccion es muy largo, pero con paciencia lo haces caminando todos los dias, podes no llegar, pero hay una sola cosa en lo que tenes que enfocarte, que es festejar cada paso adelante y aprender de cada paso hacia atras.","replies":[{"poster":"Fukai shi ","date":"2015-12-23T14:17:39.963+0000","up_votes":1,"down_votes":0,"body":"voy a 45 fps y a 30 ms","replies":[{"poster":"Sonya Kyron","date":"2015-12-23T15:15:47.632+0000","up_votes":1,"down_votes":0,"body":"si queres contactate conmigo en el juego y veo como te lo subo a 60 FPS","replies":[]}]}]}]}]},{"poster":"rokushoger","date":"2015-12-23T11:07:26.817+0000","up_votes":1,"down_votes":0,"body":"Venía a darte el mismo consejo que zench, y además decirte que está buenísimo que aún siendo diamante 5 tengas la humildad de pedir ayuda y querer mejorar. Realmente veo poco de eso, y debería haber más.","replies":[{"poster":"Fukai shi ","date":"2015-12-23T13:20:09.453+0000","up_votes":1,"down_votes":0,"body":"la verdad es que pienso que aun siendo diamante te falta por aprender a lo mejor no en como se basa el juego en general de calls etc, pero su tu habilidad con respecto a las lineas como seria en mi caso","replies":[{"poster":"rokushoger","date":"2015-12-23T14:25:05.614+0000","up_votes":1,"down_votes":0,"body":"Yo la verdad tengo muchísimo para aprender todavía, sobre todo mecánicamente, lo que no tengo es el tiempo.","replies":[{"poster":"Fukai shi ","date":"2015-12-23T14:27:32.134+0000","up_votes":1,"down_votes":0,"body":"la verdad es que aun siendo challenger cada dia que le dedicas tiempo al juego aprendes algo nuevo a lo mejor no en una linea solamente si no mas bien en los demas carriles \n\ny claramente para subir o mejorar hay que dedicarle tiempo , lo mejor que te recomendaria para ir mejorando es que juegues unas 8 partidas de solo q semanales","replies":[]}]}]}]},{"poster":"ZeNch","date":"2015-12-23T05:37:15.718+0000","up_votes":1,"down_votes":0,"body":"Graba tus partidas (BaronReplays) y cuestionate cada movimiento y preguntate que decision pudo ser mejor.\n\nNo estoy a la altura de darte un consejo pero quizas esto te haga tener una autocritica mas clara para salir adelante","replies":[{"poster":"Fukai shi ","date":"2015-12-23T13:18:11.845+0000","up_votes":1,"down_votes":0,"body":"gracias por la ayuda :D","replies":[]}]},{"poster":"Zaiiko 666","date":"2015-12-23T06:14:59.390+0000","up_votes":1,"down_votes":0,"body":"Mira yo soy Diamante 4, y te voy a decir que para subir Elo tenes que ir con Lucian, izi farm, izi damage explosive, izi lcs plays.  \n\nPD: Te escribo desde esta cuenta porque en la otra me banearon del foro. :P  ","replies":[{"poster":"Fukai shi ","date":"2015-12-23T06:23:48.267+0000","up_votes":1,"down_votes":0,"body":"la verdad es que no quiero solamente ocupar un champ para subir elo si no mas bien el echo de mejorar tu habilidad en el rol \n\ngracias por comentar","replies":[]}]}]}