{"poster":"OverlordZilean","date":"2018-08-15T13:54:03.483+0000","title":"This Game Right Here Is the Reason league Is Doomed","subforum":"Community Events","embed":{"description":"OverlordZilean / Lv. 16","url":"http://oce.op.gg/summoner/userName=overlordzilean","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":1,"body":"now I dont know to get  replay so i shall explain to you what happend\r\nmy whole team Is Destroying you know 9/0 dravens 2/1 zilean ect, nasus has 531 stacks and he cant Take on darius.. \r\n Darius Can almost 1 shot him Darius is super underfeed  Darius is tankening all the dmg Doing all the damage yet my entire team cant kill him Our draven who is Crazy feed is on par with gold with him... this whole game Dont make senese he did not out play us he Single Handle OVERPOWERED US 1 darius \r\nYou got to understand He was Not a good Darius Like you get them good lees or jaxs He simply one because of his stats There is alot Wrong with this game so much I cant even go into all the Details But when you see a Nasus with more then 500+ stacks Cant take on a Darius 1v1  something not right I mean the darius after he gets his R ready can make the TANKY nasus from 100% to 15% in 1 R this is an example Of Riots mistake they have no made this champion broken like they did with (yas zed riven) they Have him so powerful a full team of 5 Who where all Feed Can be Overpowerd By a Darius with little to not skill by the time he started to turn the game we had most of there towers and 2 dragons If you do get your hands on the replay watch it and Just think is this what league had turned to a game without skill Only champion Picks to win..... if this is the cases I shall quite my 1 trick pony zill who i have mained for over 5yr and play Riven and get to dimond + and Win Because I could Handle zilean doing 10dmg per auto back when he weak but i cant Handle A chamption with stats so Powerful he cant  Overpower a team without being feed Just simple because he existences he wins. Watch the replay And just see it enough to make me cry a bit.","replies":[{"poster":"Project Xayah","date":"2018-08-16T07:05:53.138+0000","up_votes":1,"down_votes":0,"body":"Just an FYI on the replay, in order to record a replay you can go to your match history in the client, once there you will find a small round button (containing an arrow pointing downward to a \"box\") next to each game which can be used to download the replay for that game. Once downloaded, you can view the replay  using the same button (should change to a \"play\" arrow surrounded by a \"circular arrow\") and record as much of the match as you want. Recordings will appear in the \"Highlights\" tab of your profile, which will include a button that will take you to the files location on your computer (round button containing a file icon, next to the selected highlight).\n\nKeep in mind, videos showing players breaking the rules may be removed due to the standing \"no name and shame\" policy on the boards.","replies":[]},{"poster":"OverlordZilean","date":"2018-08-15T13:57:34.381+0000","up_votes":1,"down_votes":0,"body":"I cant Fully explain in detail just how Mest up Just how Unfair this game was but Its a clear sigh of that the game needs to change Like when you see a 100% doge chance jaxs you fix it Well Riot you need to fix Champions like Riven zed and yas But at least try and fix this problem of darius Being able to overpower a team.  I cant explain It you have to watch the replay and see for yourself","replies":[]}]}