{"poster":"Sanghelios","date":"2018-03-05T20:11:17.807+0000","title":"How League of Legends broke me as a player and individual","subforum":"Gameplay","up_votes":41,"down_votes":13,"body":"I've had this thread in mind for quite some time, unsure whether my disdain for the game was the reason for the path I (and others) have taken. To elaborate, I will summarize my League of Legends ranked history from the beginning to now. \n\nPreseason 6 was when I started playing, and about midseason I decided to play only rankeds, which with dedication and the many games I played, maining Yasuo, Skarner and Teemo (I know, I know), I climbed from my initial placement being Silver, to Plat. During this period I have never been hardstuck, never been on a win/losing-streak-deathspiral. I was content with the rank I acquired during my first season as a Top/Jungle player. \n\nI was greatly enjoying the game to the point of playing up to 10 games every day. League was the only game I wanted to play and Diamond the rank I strived to achieve. I was ambitious, determined, a winner. I would annihilate everyone in my path. Don't play Yasuo they say? Yasuo. Yasuo is not a champion for new players? Yasuo. I was so proficient and determined at the champion that I knew every matchup, knew how to defeat every Riven player on this damn ladder. (This used to be a skill matchup)\n\nThat was, until Riot decided to gradually nerf Yasuo out of Toplane, from changing Trinity's path(Zeal) to changing Yasuo's fluent playstyle in S7 by nerfing E and transferring power into his Q. I was extremely displeased by these changes, because I knew that they weren't right. Every Yasuo player knew. The problematic aspects of his kit were Q allowing an experienced player to win otherwise difficult melee matchups, and Windwall - the bane of ADCs and mages. Yasuo was wrongfully addressed and because of it, the same issues of Yasuo are present to this day.\n\nAs a result, I(late S6, pre7) decided to play a new lane, one that was closest to Toplane, and with Mid as my new role, I ought to play the next edgiest, mechanically intense champion on the list. Annie... I'm kidding, it's Zed. \n\nI was having a blast even though I was awful at Zed, I enjoyed the learning curve as I have with Yasuo. What would stop me from acquiring proficiency once again, but on a different champion? Nothing, so I thought. Midseason 7 was when I considered myself a worthy Zed player, I had surpassed 150k mastery practising primarily Zed in my ranked games. You read right, I had achieved ~150 ranked games on Zed with a winrate close to 45%. I was not discouraged (yet), as it is an expected sacrifice of learning Zed (I hate normals). These fools, I thought, these foolish Orianna players, foolish botlaners. I would get my revenge now that I have died a thousand deads on this champion. I will reap their flesh and shadows, I will finally climb back up. \n\nThat was, until Riot decided bot lane required a higher power budget, required the aid of Ardent Censer and the cleansing of the dreadful system named autofill, - by shifting power from nowhere to the support class. People would play support, and Reddit would not be complaining about autofill. We, Riot Games, solved everything. \n\nArguably they did solve this issue, but for me it was hell. The torment I choose to endure during mid-late season 7 playing Zed in a meta dominated by enchanter supports and adcarries running rampant on shields and healing. It is beyond words to describe the magnitude of tilt I, an unfortunate, still somewhat determined soul had to experience. \n\nThe logical course of action would be to abandon Zed, abandon playing assassins altogether in favor of control mages. But believe me when I say that, there was nothing I desired more than the killing of botlaners. I would flash ult ignite even for supports if they dared to poke me, even if I knew it would mean the death of me, I would take this smug support with me, tear it to shreds as my team flames me for an inconsiderate play. The occasional satisfaction of killing was enough for me to keep playing Zed. I was an assassin for reason, no, a killer. \n\nI was a shadow of my former self, shaped by tilt and the hatred for balance. Not balance in its literal sense, but the game balance and paths Riot had taken this game.\n\nI did achieve Platinum at the beginning of season 7, however ever since mid season 7, until now, I have been hardstuck in low Gold for the reasons aforementioned. Stopwatch was merely the final straw, - and even now that it is gone, the game is still equally frustrating for me to play, be it top or midlane. \n\nEvery time I relive the fraction of determination still within me, I play myself into a winstreak quickly followed by a losingstreak. Every time I play to the peak of my ability, a surge of my former competitiveness, I am downed by games that cannot be won, games that were seemingly scripted and predetermined to send me back. Something I had never experienced during season 6.\n\nLeague of Legends has taken my mind and mentality, my determination and with it, the desire to climb. \nIt is time to leave, but I know I'm too weak, know I cannot uninstall until I am only a shell of hatred, deprived and escapen by all my pride and determination. Soon it will all end. This is my story.","replies":[{"poster":"AMYS GRAVE","date":"2018-03-06T01:51:57.527+0000","up_votes":33,"down_votes":7,"body":"> Preseason 6 was when I started playing,\n\nSorry you were too late to play when league was fun.","replies":[{"poster":"Sp33d Zer0","date":"2018-03-06T02:39:43.177+0000","up_votes":16,"down_votes":2,"body":"Weird, I've had fun every season since season 2.","replies":[{"poster":"RenownedWheat42","date":"2018-03-06T03:42:06.540+0000","up_votes":12,"down_votes":3,"body":"Apparently if you have fun lately you're considering wrong by the community.","replies":[{"poster":"ChuShoe","date":"2018-03-06T06:43:45.484+0000","up_votes":3,"down_votes":2,"body":"I mean, I personally believe this game is cancer for everybody, and that it's incredibly unhealthy to play 1 game of league a day, but yes... It is very fun.","replies":[{"poster":"Spank the Fox","date":"2018-03-06T11:55:32.623+0000","up_votes":2,"down_votes":0,"body":"I stopped playing one game a day...now I just binge 1 session a week.\n\nNot entirely sure it’s better....","replies":[]}]}]},{"poster":"AMYS GRAVE","date":"2018-03-06T22:06:19.870+0000","up_votes":2,"down_votes":1,"body":"Good for you? I'm Glad you like fast-paced hard-snowballing clown fiestas with limited strategy?","replies":[]}]},{"poster":"xelaker","date":"2018-03-06T02:00:56.786+0000","up_votes":4,"down_votes":0,"body":"my exact thought","replies":[]},{"poster":"Daedric Etwahl","date":"2018-03-06T06:48:38.987+0000","up_votes":2,"down_votes":0,"body":"Tbh I joined preseason 6 as well, and I hear about horror stories in the past (4.20 warwick, kassadin, pick order even though Im a support main, the sona rework fiasco, etc) and really all I can think is \"Boy, glad I missed that\"\n\nReally the only thing I would want to go back in time to experience would be the DJ Sona hype.","replies":[{"poster":"AMYS GRAVE","date":"2018-03-06T22:04:48.772+0000","up_votes":2,"down_votes":0,"body":"The real difference between the problems we had before and the problems we have now lies in isolation. We could ban warwick, kassadin, etc... we could negotiate for role selection (and yes most of the time people were not total douchenozzles and would be open to trading roles). The players have no recourse now when minions are auto pushing, or when death timers were raised and made the game incredibly snowbally, or when one item is so overwhelmingly strong only strong users of that item are viable. We had the tools to deal with the problems we had then, but there's nothing we can do about the problems we have now.","replies":[]}]}]},{"poster":"LightningShado","date":"2018-03-05T23:44:14.814+0000","up_votes":17,"down_votes":4,"body":"I understand your frustration with this game but I have a an easy solution. Stop playing the game for a little while and then come back. If you still don't like it, then quit. \n\nYay, downvotes.","replies":[{"poster":"Sp33d Zer0","date":"2018-03-06T02:41:03.561+0000","up_votes":18,"down_votes":1,"body":"Stop playing a a game no longer being enjoyed?\n\nThe fuck do you think this is? A hobby?!","replies":[]},{"poster":"woodvsmurph","date":"2018-03-06T05:24:00.569+0000","up_votes":4,"down_votes":1,"body":"You would be right. That is a perfectly valid and mature option.\n\nBut it is hard to let go of something you have put much time into and for which you still find rare moments of bliss from. The thing most players writing posts like this one though is for the \"balance\" of the game to be more in balance. That or to be skewed towards the champs they play. I've since season 3 I believe. Almost exclusively ranked once I hit 30. And the balance team has gone from trying to achieve actual balance to making flavor of the week or month op champs which are merely swapped with the passing of each new meta. I much prefer - and it is within their ability to do so - a game that is balanced around... balance.","replies":[{"poster":"deadlychuck","date":"2018-03-06T17:25:38.651+0000","up_votes":3,"down_votes":0,"body":"It's a dopamine addiction is all.\n\nIf they can hook you on a dopamine release, then you'll spend far more hours chasing that same rush, even if they remove it. \n\nThere's no reason for them to make a balanced game, if they can make a game that will better get players to keep playing for far less effort and resources. ","replies":[{"poster":"LightningShado","date":"2018-03-06T17:36:02.662+0000","up_votes":1,"down_votes":0,"body":"Then people should start relying on their thinking rather than their feelings and then they'll be happy. \n\nEven if people don't do this to change, they should at least trust their angry and distress towards this game.","replies":[{"poster":"deadlychuck","date":"2018-03-06T17:55:38.019+0000","up_votes":1,"down_votes":0,"body":"Everyone's always an animal, but no one will always think rationally.\n\nEven the most rational of thinkers could experience a dopamine addiction, but the least rational of thinkers will not be swayed by their rational thoughts.\nIn effect, riot just needs to appeal to the lowest common denominator, because we aren't perfectly rational creatures. \n\nAnd people's sunk costs and dopamine addictions will keep them habitually coming back.","replies":[{"poster":"FourIsTheNumber","date":"2018-03-06T22:36:18.840+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=deadlychuck,realm=NA,application-id=3ErqAdtq,discussion-id=ZElOXhEp,comment-id=00040001000100000000,timestamp=2018-03-06T17:55:38.019+0000)\n\n> And people&#x27;s sunk costs and dopamine addictions will keep them habitually coming back.\n\nI really think you're overusing the term dopamine addiction to a kind of stupid degree. People truly are not that simple, and if it was simply a dopamine release then we would get it from other sources and be addicted to literally everything. It's absolutely ridiculous to say that the only reason people do things is because of a dopamine rush, sounds like something from a high schooler who just took biology for the first time.","replies":[{"poster":"deadlychuck","date":"2018-03-07T21:14:01.112+0000","up_votes":1,"down_votes":0,"body":"Don't get me wrong, there are other reasons that people will come back to play a game that they haven't played in a while, or know doesn't succeed in providing the same experience that they want out of it. \n\nWhich is why i brought up people's sunk costs. \nBarrier to Entry\nNostalgia \n\nBut the fact of the matter is that people generally aren't going to behave rationally and will often behave based on habits. If you played a game every day for a year, then you can be sure that you're going to feel weird if you go without playing the game for a week. \n\nReally, i think that difficulty quitting league has more to do with cognitive ease than specifically some kind of dopamine addiction. The point however, is that riot tailors their game to produce those kind of \"exciting\" and \"intense\" moments, which is more akin to someone trying to maximize dopamine releases, rather than someone trying to develop a well designed and compelling game.","replies":[]}]},{"poster":"LightningShado","date":"2018-03-06T18:48:06.495+0000","up_votes":1,"down_votes":0,"body":"Well, that sounds like a real problem. If you have an addiction, try tearing yourself away from the game. Go outside or on a camping trip. Go hang out with friends, and if you don't have any friends, go to a public place and try to get some. Do whatever. Yell out loud and attract attention. You're bound to get some people interested in you. Just talk about anything one you find someone. Ask questions and keep eye contact. Always tell the truth because you want a real friend. Just do anything to divert your attention away from the game. Even shows could do the trick. Once you don't think you need it anymore, try playing again and I can almost guarantee that you will be happier playing and it won't be as important to you, which will also help you grow as a person and player. \n\nThat's my advice. Try it or not.","replies":[{"poster":"deadlychuck","date":"2018-03-07T21:24:25.997+0000","up_votes":1,"down_votes":0,"body":"I'm really not addicted to League at this point. It took me a few years, and having quit playing all together for months, but now i play to keep up to date to see where the state of the game is, specifically waiting patiently for it to crumble under it's own weight. \nA few year ago, back in 2016, i said that at the current rate of change, assuming that no massive unexpected competitor in the market, league probably had 4 years before they'd move the game so far that they'd exhaust their market and struggle to appeal to their split audience, as they started to hemorrhage players. Not to say that the game will be dead by 2020, but rather you will see it start to wane from a metaphorical death by a thousand cuts. \n\nAnd i think everyone can appreciate how there's a primal fascination to watch something big fall. See when the straw breaks the camel's back and what parts are the first to buckle under the pressure.","replies":[{"poster":"LightningShado","date":"2018-03-07T22:24:07.947+0000","up_votes":1,"down_votes":0,"body":"That's kinda messed up. I don't think that'll happen but I'll keep playing in the meantime!","replies":[]}]}]}]}]}]},{"poster":"LightningShado","date":"2018-03-06T13:32:21.750+0000","up_votes":2,"down_votes":0,"body":"I completely understand but if something doesn't make you happy anymore, stop doing it. You'll actually be happier if you do and then nothing is lost. \n\nAlso, I like how the game is right now to be honest. I actually feel like I'm good now. Like actually good with map awareness, objective control, and micro. So anything that Riot does I'm fine with unless they like make the game unplayable in some way, which would be very difficult to do. I like it when here things are added and the meta is shaken. It keeps the game exciting in my opinion.","replies":[{"poster":"woodvsmurph","date":"2018-03-06T15:20:58.999+0000","up_votes":3,"down_votes":0,"body":"Changing up the meta is fine - but not empowering certain champs or roles to the point that it completely negates others from being playable. Like a good disengage comp winning in a meta for disengage is fine; however, a poorly executed disengage comp should not beat a perfectly played hard engage comp just because disengage is the meta. Does that make sense?\n\nSimilarly, I'm fine if gp, vlad, and tanks are the meta in top right now, but it doesn't mean they should auto-win if I pick something other than meta toplaner at the moment. If they play equal to me or better, that's fine - they should win because the current meta gives them an advantage all-else being equal. However, if I clearly play 10x better than my lane opponent, they shouldn't be able to beat me just because I'm not on a meta champ. Get where I'm coming from?\n\nAnd that is the problem. Stuff has been empowered TOO far towards enforcing the meta in recent history. Ever since juggernaut rework in my opinion, many patches have gone from trying to help balance things out while changing what's meta to intentionally grossly overpowering certain champs or roles and trying to enforce said champs/roles/comps as a meta that must be followed if you want a fair chance at winning. When meta comp executed poorly beats non-meta but perfectly rounded out comp executed at average level, you have a problem in my opinion. Because then it is almost entirely about the draft - rather than making it somewhat about team comp but still allowing 2 decent team comps to come down to player skill and teamwork moreso than what champs are locked. That's all I'm saying.","replies":[{"poster":"LightningShado","date":"2018-03-06T17:51:00.955+0000","up_votes":2,"down_votes":0,"body":"True. Champions fall in and out of meta, but you think that Riot favors some champions over others. I don't think this is true.\n\nLook at the Volibear buffs. He was crap tier for so long and now he's OP. I guess Riot really favored him for the past year. Also, Zoe got nerfed hard last patch or two patches ago (I can't remember) to the point of almost garbage. Buffs are on the PBE but that's only because she was so bad. One champ I do have a problem with is Tristana. She's just too strong. That's why ban her every game. That's what it's there for. Still, before the stars and planets aligned to make her so strong, she was absolute garbage. Caitlyn super strong back in season 6 and now she's not at all. Riot nerfed her into the ground. Assassins were busted at one point. Now they're not. I don't think Riot favors certain champions because...\n\nThe meta is always in flux. People are always in flux. Life is always in flux.","replies":[{"poster":"SilentGob1in","date":"2018-03-07T08:55:16.629+0000","up_votes":1,"down_votes":1,"body":"why can you not balance the game for each level, would that involve work that may not be as fun for people at riot ? Too bad\nthey are supposed to be working for their customers, this is not the case with riot. All I see is extemely poor customer service, a company that is out of touch with its customer base, and a complete lack of integrity and responsibliity. The game dev at riot are the biggest trolls of the entire game. They have made lower tiers into permanent Beta testing.Her is an example of Riot Dev trolling . Someone dodges and I go from primary roll to secondary roll , punished due to their dodge, then as i Select my champ there is an error so I am diconectted temp by the time i get reconnnected I have been give a leaver ban and because i dodged a troll earlier its a 30 min wait. A 30 min wait for zero reasons other than lower tier beta testing. this is not a one off, ( I have the highest int avaliable a high end gaming computer as well) this happens over and over and over, it gets reported and they do...you guessed it nothing . This is but one example I could give you hundreds and that is not a joke hundreds of examples of diff small things that can be fixed , should be fixed but wont be because of a complete utter disregard for customer service. I truly hope someone from riot read this.","replies":[{"poster":"LightningShado","date":"2018-03-07T12:31:27.560+0000","up_votes":1,"down_votes":0,"body":"There are so many things wrong with what you just said. \n\nRiot has a support page on their website do you can go to that to fix any of your problems. I can't link it now because I don't have time.","replies":[]}]}]}]}]}]},{"poster":"deadlychuck","date":"2018-03-06T17:21:40.228+0000","up_votes":1,"down_votes":0,"body":"The irony in this approach is that there's no reason to expect the game to get better for a player who's frustrated with the game design. \nRiot always moves in the same direction with their design, and they've been doing it for at least 5 years now. If they've reached the point where you are frustrated with the game, then leaving for any period of time to allow them to make changes will only return you to a game worse than it was when you left.\n\nNot that they listen to the frustrated players which stick around anyway.","replies":[{"poster":"LightningShado","date":"2018-03-06T17:31:58.552+0000","up_votes":1,"down_votes":0,"body":"Then by your logic I would say just quit the game completely. There are plenty of other games to enjoy, and soon be if them are even free.\n\nIf you don't think something will get better in your eyes, the smart thing to do would be to just get away from it.","replies":[{"poster":"deadlychuck","date":"2018-03-06T17:46:27.917+0000","up_votes":1,"down_votes":0,"body":"I did for about 6 months. The problem is that having played for 7 years, I've got excessive experience in the game. I ended up coming back, because I had nothing to play.\n\n> There are plenty of other games to enjoy\n\nExcept there really aren't. Many games have adopted a similar design philosophy to league, and it makes them completely unplayable to me. Let alone trying to play long enough to get proficient. \nIf I enjoyed single player games, then i'm sure there'd be plenty of games to play, but virtually every MMORPG wants to imitate league's action oriented combat. \nThere's no middle ground anymore, either you've got a painfully slow boring turn based (generally single player) RPG, or you've got an action RPG, which will completely dispose as much of the RPG aspect of the game as possible, to stuff as much action as they can fit into it.\n\nOutside of that the current market bubble is on Arena Deathmatch shooters like fortnite, which I don't have any interest in playing.\n\nEdit: Oh, and just to be clear, it's not only me who finds many of the games adopting these philosophies unplayable. Many devs (basically all of them) which have attempted to shift the design of their existing titles or new titles towards action have seen much worse sales and/or community feedback. ","replies":[{"poster":"LightningShado","date":"2018-03-06T18:51:51.356+0000","up_votes":1,"down_votes":0,"body":"Yah know, I played Fortnite yesterday for the first time and it was much more fun than I thought it would be. I think it's more fun with friends that you can goof around with but the game alone was pretty fun by itself. I wasn't interested at all but my friend convinced me to download it and play with him. \n\nJust try doing something else other than League. I believe in you! :)))))))))))","replies":[{"poster":"deadlychuck","date":"2018-03-07T21:18:16.884+0000","up_votes":1,"down_votes":0,"body":"I've played fortnite, both PvP and PvE, I even own the PvE part of the game. \n\nIn fact, I actually play fortnite somewhat regularly (specifically the PvE), because one of my close friends is a developer on the game, after Epic scrapped Paragon. \n\nI just don't like the hunger games, survival of the fittest model. It's just not my taste.","replies":[]}]}]}]}]}]},{"poster":"341123545652","date":"2018-03-06T04:33:57.235+0000","up_votes":8,"down_votes":1,"body":"very sad story indeed. Sadly the game is basically run/balanced for its intended audience of ADC/support mains, probably brings in the most cash for them idk what other reason they would do such a shift. \n\nMy recommendation to you would be, since you already moved from top to mid, it may be time for you to move from mid to bot. I would recommend {{champion:119}}  , def seems to fit your style and you probably will feed alot. But the way league is now, either suffer frustration or quit the game , or just join them in the bottom lane.","replies":[{"poster":"y0r1ck","date":"2018-03-06T07:35:31.878+0000","up_votes":2,"down_votes":0,"body":"Yo I'm a support main and i don't like it either. Op as fuck items I can't lie. Gotta built the same thing every game or lose.","replies":[]}]},{"poster":"FourIsTheNumber","date":"2018-03-06T02:45:57.515+0000","up_votes":9,"down_votes":2,"body":"damn this is the edgiest boards thread i've seen yet \n\n\"i am a ruined person because riot has meta changes\"","replies":[{"poster":"Swarovsko","date":"2018-03-06T09:38:21.770+0000","up_votes":3,"down_votes":1,"body":"lmaooooooooooooooooooo \"how league of legends broke me as a player **and individual**\"\n\nBITCH IM FUCKING DEAD WTF\nThis might be the cringiest thing to happen in these boards","replies":[]}]},{"poster":"CrazyCobra247","date":"2018-03-05T20:17:23.860+0000","up_votes":7,"down_votes":1,"body":"Easy way to leave, get perma banned, works everytime. Once you lose all your hardwork it usually does the trick. I feel you though, Ive constantly said stop changing stuff. I believe they should get Characters to a point of balance then stop changing. New Characters should be weak at 1st then gradually raised to par. How long did we get used to Runes and now poof gone. Im actually ok with that though. Jungles been changed, that was nice as well I think. Some champs tho completely redone, for example Gangplank...idk\n\nI feel your pain, sorry buddy.","replies":[{"poster":"Sanghelios","date":"2018-03-05T20:27:14.741+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=CrazyCobra247,realm=NA,application-id=3ErqAdtq,discussion-id=ZElOXhEp,comment-id=0000,timestamp=2018-03-05T20:17:23.860+0000)\n>\n> Easy way to leave, get perma banned, works everytime. Once you lose all your hardwork it usually does the trick. I feel you though, Ive constantly said stop changing stuff. I believe they should get Characters to a point of balance then stop changing. New Characters should be weak at 1st then gradually raised to par. How long did we get used to Runes and now poof gone. Im actually ok with that though. Jungles been changed, that was nice as well I think. Some champs tho completely redone, for example Gangplank...idk\n> \n> I feel your pain, sorry buddy.\n\nThere are times I wish I would simply be banned, but although I am often expressing my frustration in chat, I'm trying to never address players. Probably because I can relate to what causes people to feed or be toxic.","replies":[{"poster":"deadlychuck","date":"2018-03-06T17:32:24.059+0000","up_votes":3,"down_votes":0,"body":"It's funny, I just played fucking around, talking shit, and complaining about how absolutely shit the game's design is in all chat, for probably 2 years now, still have never gotten ban.\nI played zero CS {{champion:112}} {{item:3098}} Top for like 15 games, and doing exactly what i just said, still didn't get ban.","replies":[]}]}]},{"poster":"Ionian Vulpix","date":"2018-03-06T04:29:35.304+0000","up_votes":4,"down_votes":9,"body":"TL:DR - Assassin main salty that supports are more than ward bots and can actually protect the carries.","replies":[{"poster":"Hammermancer","date":"2018-03-06T04:33:23.015+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Ionian Vulpix,realm=NA,application-id=3ErqAdtq,discussion-id=ZElOXhEp,comment-id=000e,timestamp=2018-03-06T04:29:35.304+0000)\n>\n> TL:DR - Assassin main salty that supports are more than ward bots and can actually protect the carries.\n\nCarries should be able to protect themselves with skill against an oppenent like zed or any of his cousins\n\nSupports shouldn't be able to press W and let a bronze adc get a penta","replies":[{"poster":"Ionian Vulpix","date":"2018-03-06T05:10:39.506+0000","up_votes":5,"down_votes":0,"body":"But then assassins complain about any ADC being able to use their skills to escape. Trist W, Xayah R, Ezreal E. And it's very difficult to outplay a Zed pressing R-E-Auto-Ignite regardless.\n\nThen what should supports do? Ward and watch helplessly as an ADC gets blown up?","replies":[]}]}]},{"poster":"Ok sure but why","date":"2018-03-05T20:59:11.666+0000","up_votes":5,"down_votes":0,"body":"I miss the Critity Force too {{champion:86}} {{champion:67}} {{champion:41}} {{champion:122}} {{item:3070}}","replies":[]},{"poster":"Raoul","date":"2018-03-06T18:35:09.729+0000","up_votes":4,"down_votes":0,"body":"http://i0.kym-cdn.com/entries/icons/original/000/024/703/weakness.jpg","replies":[]},{"poster":"nelogis","date":"2018-03-06T10:07:14.049+0000","up_votes":4,"down_votes":0,"body":"Hashinshin once said:\n\n\"As a top laner, your number one desire isn't to win, it's to kill\"\n\nMaybe there was more truth to that than we think\nOnce a top laner always a top laner. This might be your inner top main reminding you of your roots.\n\nTo be honest I seriously don't mind losing if had a fcking amazing killfest top with non cancer champs. \nWith like Trundle Olaf vs Yorick Vi\nJust 4 bruisers (2 jungle 2 top) clubbing and killing eachother top the whole time.\n\nThe best feeling ever, just to brawl the whole time. No worries about jungler ganking since both are top, no worries about wave management and cs-ing, no worries about getting dived.. no.. just killing!","replies":[]},{"poster":"BestPudgeNA","date":"2018-03-06T03:23:53.263+0000","up_votes":3,"down_votes":0,"body":"Cheer up i hear mid season patch is finally gonna balance ADCs \n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"rtbf225618241","date":"2018-03-06T21:13:39.955+0000","up_votes":2,"down_votes":0,"body":"Well there's definetly writing skill in you.\n\n> I was a shadow of my former self...\n\nOh fuck you, you totally stole that from me! :P","replies":[]},{"poster":"FutureCreator","date":"2018-03-06T08:07:59.784+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=Gd9OhYroLN0\n\nThe proper soundtrack to this post","replies":[]},{"poster":"F O R F I T Z","date":"2018-03-06T04:46:04.366+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bloody Hellfire,realm=EUW,application-id=3ErqAdtq,discussion-id=ZElOXhEp,comment-id=,timestamp=2018-03-05T20:11:17.807+0000)\n>\n\n> \n> I did achieve Platinum at the beginning of season 7, however ever since mid season 7, until now, I have been hardstuck in low Gold for the reasons aforementioned. Stopwatch was merely the final straw, - and even now that it is gone, the game is still equally frustrating for me to play, be it top or midlane.  \n\n\nSadly I'm having this exact same issue this season.  Normally I can achieve high gold 1600 MMR every season, this one feels way different in terms of carrying from top lane or mid.  \n\nstomping my lane really hard just doesn't do it anymore, I literally gotta win each lane and make sure I get bot lane fed for my team to be successful this season.  I use to play Evelynn and snipe off 2 people before team fighting or split push, however she has really weak wave clear on her (Q) since rework, now split-pushing on her has become somewhat useless.  This season I play mostly rumble top, I can end lane phase with a really good cs/kill lead and still get dumpster by the enemy support and adc with way less gold.\n\nIt has become pretty pathetic imo.\n{{item:3070}} {{champion:68}} {{item:3070}}","replies":[]},{"poster":"Oxyrotten","date":"2018-03-06T04:37:02.494+0000","up_votes":2,"down_votes":0,"body":"What has this game made us? We were once men, and now we are mere monster's and creatures of habit.","replies":[]},{"poster":"Karfuss","date":"2018-03-06T03:17:48.773+0000","up_votes":2,"down_votes":0,"body":"Whenever I got like that, I used to take 6 months to a year break from League. Then you come back, look at all the new stuff and start drooling whilst trying to wrap your head around everything that has changed since you last played. You come back, everything feels new and it feels like you're just starting again.\n\nI've done that three or four times now, and now I simply don't care what happens in my games and I don't tilt at all (which is easy to say, but it's surprisingly hard to tilt when you don't care). I just do my best knowing it's all I can do.","replies":[]},{"poster":"FullmuteAll play","date":"2018-03-05T20:33:54.095+0000","up_votes":1,"down_votes":0,"body":"As far as I undrstand your mentality such champions may fit your playstyle and be efficient and pleasurable to play {{champion:69}} {{champion:13}} {{champion:8}} {{champion:112}}","replies":[]}]}