{"poster":"QEENTO DAN","date":"2015-06-23T01:23:13.430+0000","title":"i'm done","subforum":"Feedback sul forum","up_votes":1,"down_votes":3,"body":"Questo post non ha senso di esistere, scrivo solo perch&egrave; non ho nulla da fare e non ho ancora sonno per andare a dormire. \r\nSono stato nuovamente bannato dalle ranked per 35 normal e draft e sono veramente seccato, scocciato da cio. Ovviamente voi subito penserete beh flammi &egrave; giusto che tu venga bannato. E certo, vi do ragione. Tutte le volte cerchi di avere un buon mood e spesso ti becchi honor per collaborativo, amichevole etc,. E deprimente e demoralizzante poi quando ti capita la lose streak di turno,  dopo 4-5 partite che perdi non ne puoi pi&ugrave;, flammi l&#039; ennesimo troll o afk di turno e ti arriva subito la ranked restrict, della serie fottesega degli honor che ricevi ogni volta. Insomma diciamocelo, il flame esiste da sempre e per sempre, su qualsiasi gioco, ed &egrave; molto avvilente essere puniti perch&egrave; in una o due partite hai flammato gente che fa di tutto per non farsi volere bene. Questo fottuto sistema controlla solo se te stesso, giocatore singolo, e appena vede che usi termini &quot;scurrili&quot; subito ti punisce, e se ne frega totalmente di che razza di player tu possa aver avuto in team. Legalmente un crimine resta un crimine, indipendentemente a chi sia diretto, moralmente rubare a un poveretto per strada o rubare a berlusconi, &egrave; una cosa ben diversa, spero di aver reso il concetto.\r\n\r\nE poi che cazzo, va bene, il flame non &egrave; una bella cosa, ma io in due anni su questo gioco non ho mai trollato o afkato una singola volta , e solo perch&egrave; a volte  ci sono player che fanno di tutto per farti uscire di testa, mi devo beccare 70 (circa) normal cui non ho alcun interesse a giocare. \r\n\r\nL&#039; altra volta vincere quelle 35 draft &egrave; stata un&#039; impresa, credo di aver beccato piu afk e troll in quelle partite che in tutta la mia esperienza in ranked, e questa cosa mi secca ancor pi&ugrave;; non credo proprio di trovare la voglia, considerato il poco tempo a disposizione, di giocare queste partite. \r\n\r\nInsomma, come gia detto, classico post di sfogo, a cui nessuno fotter&agrave; minimamente, com&#039; &egrave; normale che sia, ma almeno per farvi riflettervi sulla pesantezza delle punizioni riguardo al flame che esistono solo e solamente (che io sappia) su questo gioco. Salut!","replies":[{"poster":"lucanomax1994","date":"2015-06-23T06:33:03.840+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"kirchhoff","date":"2015-06-23T15:22:25.601+0000","up_votes":2,"down_votes":0,"body":"In wow vinci sempre e quindi sono tutti normali.\nLOL ti mostra che si può anche perdere, perdere non piace e la gente sclera.","replies":[]}]},{"poster":"Wendy Simms","date":"2015-06-23T02:21:22.254+0000","up_votes":2,"down_votes":0,"body":"Perchè la riot crede che insultare un player sia controproducente se non scoraggiante. come se augurare il cancro o incoraggiare qualcuno cambi la sua skill.\nIn realtà però, se uno gioca ai lemmings senza ward e muore come un ritardato, lo farà a prescindere se io gli dò del coglione o gli dico \"stai attento, segui noi\", se lo ha fatto significa che non ha skill, ciò che gli dico io è irrilevante.\n\nD'altra parte del resto, cosa importa alla riot se un player è talmente unskillato da rovinare il gioco agli altri \"sfigati\" che lo hanno in team? Nulla. Infatti se tu giochi, volontariamente, come un cerebroleso in preda a crisi epilettiche che fa più stronzate di un clown in un circo non vieni punti, che sia ranked, normal o aram.\n\nPer questo. Conoscere il sistema, accettarlo e regolarsi di conseguenza.\nLa rito banna i flamer? Non flammate. Ti girano i coglioni? Trolla e fatti insultare come se non ci fosse un domani e non rispondere, Aiuterai così a far pulizia.\nIo in due settimane che ho trollato droppando dal platino al silver ho ricevuto la notifica di ban del nuovo sistema dei 14 giorni di almeno 15 player. ed è un ottimo risultato calcolando che se non avessi trollato avrei dato la possibilità a questi unskillati di giocare ranked. no?\nio guardo il lato positivo delle cose.","replies":[]},{"poster":"Wendy Simms","date":"2015-06-23T01:36:51.758+0000","up_votes":1,"down_votes":0,"body":"beh, il discorso è chiaro:\nAlla riot interessa tener pulita la chat, non il gameplay.\nquando ti girano i coglioni non flammare, non serve a nulla. Trolla e porta gli altri al ban. semplice e diretto, la riot ti ringrazierà anche.","replies":[{"poster":"QEENTO DAN","date":"2015-06-23T01:49:51.479+0000","up_votes":1,"down_votes":0,"body":"La cosa che non capisco è perchè esiste il ban per flame quando puoi semplicemente cliccare su un' icona che ti muta. E in più, non prendiamoci in giro, un gioco senza flame è il paese dei balocchi, non esisterà mai, a maggior ragione su LoL, dove con  tutte le iniziative che fanno (eventi, uscite di skin, rapporto coi player) la  fascia media dei giocatori è 15 anni.","replies":[]}]}]}