{"poster":"StylusPro","date":"2016-06-27T13:06:12.833+0000","title":"Chau","subforum":"Charlas Generales","up_votes":1,"down_votes":6,"body":"Voy a jugar mi primera ranked del d&iacute;a y me toca una vayne con un bardo en bot, minuto 4 ya hab&iacute;an muerto mas de 3 veces cada uno la vayne y el bardo lo &uacute;nico que hac&iacute;an se reian y ponian &quot;ahora voy a jugar encerio&quot; y volv&iacute;an a morir.\r\n\r\nFue la primera ranked del d&iacute;a y ya me sacaron las ganas de jugar por hoy ya es cualquier cosa las ranked.\r\n\r\nVoy a desinstalar me recomiendan un juego? si es mmorpg mejor.","replies":[{"poster":"Misery Business","date":"2016-06-27T13:50:40.670+0000","up_votes":8,"down_votes":0,"body":"Te trolearon una vez y ya pecheas?\n\nsi desinstalalo, no tenes aguante.","replies":[]},{"poster":"Mb87","date":"2016-06-27T13:11:17.682+0000","up_votes":2,"down_votes":4,"body":"te acompaño riot ya forrados de plata se pasan por los huevos el juego ni lo controlan a que mierda emparejan o a que mierda reportan nada.","replies":[{"poster":"Shappaw","date":"2016-06-27T13:54:23.558+0000","up_votes":4,"down_votes":0,"body":"Poné un par de comas aunque sea.","replies":[]}]},{"poster":"StylusPro","date":"2016-06-27T13:57:39.432+0000","up_votes":1,"down_votes":4,"body":"Me molesta la actitud que tuvieron porque ganamos top mid y jg y me molesta que hayamos perdido por los troll.\n\nSe reporto y siguen jugando ya da igual ya lo desinstale y volveré al mu que ya se esta descargando.\n\nSuerte para los demás espero que algún día esto mejore pero lo dudo.","replies":[{"poster":"waffen SS","date":"2016-06-27T14:54:15.197+0000","up_votes":3,"down_votes":0,"body":"Largate nadie te quiere hasta nunca","replies":[]}]},{"poster":"Lince Salvaje","date":"2016-06-27T13:45:18.169+0000","up_votes":2,"down_votes":0,"body":"Lo unico que tienes que hacer es reportarlos y listo...\nY si te molesta leerlo en el chat podes mutearlo..\nSon pequeñas y simples solucines :)","replies":[{"poster":"Mb87","date":"2016-06-30T00:32:52.768+0000","up_votes":1,"down_votes":0,"body":"Simples soluciones reportas a un chabon que todo el chat flameo fedeo y ni bloqueado o baneado.","replies":[]}]},{"poster":"Chellx","date":"2016-06-28T14:55:49.899+0000","up_votes":1,"down_votes":0,"body":"La verdad el lol no es juego lindo , a menos que juegues con amigos y te diviertas con ellos . Pero las ranked son estresantes y feas , por que estas jugando para posicionarte en una división , y nada puede ser frustrante tener que perder partidas así como la tuya o por cosas peores . Mejor tene paciencia , por que simplemente es solo un juego cualquiera como todos los demás","replies":[]},{"poster":"Yellow Sphere","date":"2016-06-28T05:17:53.217+0000","up_votes":1,"down_votes":0,"body":"Andate, pá, nadie te va a extrañar de todas formas, no sos nadie por acá.","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-06-27T15:37:03.809+0000","up_votes":1,"down_votes":0,"body":"Las despedidas se consideran spam, esto deberia estar en \"comportamiento del jugador\", y a todos nos toca gente asi.","replies":[]},{"poster":"escorpion023","date":"2016-06-27T14:32:13.043+0000","up_votes":1,"down_votes":0,"body":"alguien se  preguntado como seria una partida de 5 trols contra 5 trols ?\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Zetha","date":"2016-06-27T14:39:51.881+0000","up_votes":1,"down_votes":0,"body":"El objetivo del troll es arruinar la partida y perderla a propósito, osea, que perderla de alguna forma es su victoria. Estarían contantemente muriendo, regalando kills y ayudando al equipo de trolls enemigo, el que la pierda es el que gana por mas ilógico que suene. xDD\nDios, ahora me dieron ganas de ver una custom o algo asi, debe ser gracioso!\nAunque me da la impresion de que en una de esas uno se va a rebelar y va a empezar a jugar en serio, ¡Quien sabe, jaja! \nSaludos! {{champion:51}} {{champion:119}} {{champion:90}} {{champion:106}} {{champion:236}} {{summoner:31}}","replies":[]}]},{"poster":"wattefak","date":"2016-06-27T13:56:13.488+0000","up_votes":1,"down_votes":0,"body":"Guacamelee, tal vez no sea mmorpg pero es adictivo el sistema de juego que tiene","replies":[]}]}