{"poster":"StylaX","date":"2016-03-03T12:00:39.982+0000","title":"A Minionok mint magyarosítás.","subforum":"Hibabejelentés","up_votes":2,"down_votes":2,"body":"Kedves J&aacute;t&eacute;kosok &eacute;s Riot!\n\nMikor elindult a szinkroniz&aacute;ci&oacute;ja a j&aacute;t&eacute;knak nagyon izgatottak voltunk,hiszen teljesen magyar j&aacute;t&eacute;kot kaphattunk a Riot Games &aacute;ltal.\nMinden remek,pár dolgot kiv&eacute;ve. Mivel magyar nyelvű j&aacute;t&eacute;kot szeretn&eacute;nk kapni,ez&eacute;rt fontos hogy mindent a lehető legjobban leford&iacute;tsanak,&eacute;s amit nem lehet annak megtal&aacute;ljuk a magyar megfelelőj&eacute;t,rem&eacute;lem ez a szempont. Itt most a ,,Minionok&quot; ford&iacute;t&aacute;sra gondolok. Szeretn&eacute;m k&eacute;rni hogy ha lehets&eacute;ges m&eacute;g ezt megv&aacute;ltoztatni egy magyar megfelelőre,&eacute;n legink&aacute;bb a ,,Szolg&aacute;k&quot; sz&oacute;t javasoln&aacute;m. E sz&oacute; utal arra szerintem hogy mi vagyunk az ,,Id&eacute;zők&quot; &eacute;s minket szolg&aacute;lnak seg&iacute;ts&eacute;g&uuml;kkel,&eacute;s egyfajta hatalom gondolat&aacute;t is hangoztatja a j&aacute;t&eacute;kosok fel&eacute;. Minden kedves kommentelőt megk&eacute;rek,mint a Riotot is hogy k&eacute;pzelj&eacute;k el ahogy a komment&aacute;r azt mondja : ,,A szolg&aacute;k elindultak&quot; &eacute;s m&aacute;r nem is hangzik olyan h&uuml;lyes&eacute;gnek,sőt szerintem ez lenne az egyetlen j&aacute;rhat&oacute; &uacute;t a Minionok megfelelőj&eacute;re.","replies":[{"poster":"Mind The Gap","date":"2016-03-03T14:49:36.936+0000","up_votes":1,"down_votes":0,"body":"Én a segédet javaslom. Nem tudom, hogy a legtöbb ember miért az angol megfelelőjét akarja, ha egyszer ez egy magyar fordítás. Ha miniont meg inhibitort akarnak látni, használják angolul a játékot.","replies":[{"poster":"M4dr4c","date":"2016-03-03T15:14:41.030+0000","up_votes":2,"down_votes":0,"body":"Pont azért, amiért nem kerestünk magyar szót a gólra, a célra, a taxira és még sorolhatnám. Amúgy akkor már inkább gyalog, az katonai és sakk megközelítésből is helyesebb, mint a szolga, segéd és egyebek.","replies":[{"poster":"StylaX","date":"2016-03-03T18:53:51.143+0000","up_votes":2,"down_votes":1,"body":"Már bocsi de nem sakkot játszunk hanem mobát,itt ha aztmondják szolga még illik is a játék stílusához","replies":[{"poster":"M4dr4c","date":"2016-03-03T19:41:01.015+0000","up_votes":5,"down_votes":0,"body":"Csak semmi értelme nem lenne az adott helyzetben. Egy szolga nem járkál általában fegyveresen.","replies":[]}]},{"poster":"Mind The Gap","date":"2016-03-03T15:34:32.931+0000","up_votes":1,"down_votes":0,"body":"De a legtöbb jövevényszó magyarosítva lett legalább, hogy ne hangozzon olyan külföldiesen. Mellesleg ezeknek a szavaknak meg van a magyar megfelelőjük (gól - cél, pakk, pakolni - csomag, csomagolni, chat - csevegés, stb.). A gól, taxi szavak önmaguk adják a jelentésüket, nincsen rájuk rendes magyar szó. Azonban a minionra van 3: kegyenc, segéd és szolga.","replies":[{"poster":"StylaX","date":"2016-03-03T18:54:26.477+0000","up_votes":1,"down_votes":0,"body":"ott a pont","replies":[]},{"poster":"M4dr4c","date":"2016-03-03T16:18:23.178+0000","up_votes":1,"down_votes":0,"body":"Abból a három jelentésből egyik se jó ide. Ez kb egy negyedik jelentése a szónak. A kegyenc egy úri kitartott semmirekellő, a segéd egy mesterember segítsége főként, míg a szolga valami alantasabb munkákat végez, takarítás és hasonlók. Melyik illik ebből a minionra? Mert szerintem egyik sem.\nAmúgy a miniont, hogy magyarosítanád, mikor épp úgy mondjuk ki, ahogy leírjuk? :D (Amúgy a gólra és a taxira van magyar megfelelő, csak nem ennyire rövid, kompakt megoldás, belőtte a labdát és bérkocsi, bár ezt a másodikat főként a bérelt és saját magunk által vezetett autóra használjuk.","replies":[]}]}]}]},{"poster":"Gabor3","date":"2016-03-03T12:17:30.019+0000","up_votes":5,"down_votes":0,"body":"Nagyon régen már ki lett vesézve ez a téma. A \"szolga\" és \"kegyenc\" fordításokat javasolták, de a játékosok nagy része és a Riotosok is a \"minion\" mellett maradtak. Ez olyan akár az inhibitor, ennek is lehetne egy sokkal magyarosabb neve, de már megszoktuk és mindenki így nevezi őket. Szerintem sem kell ezen változtatni.","replies":[]},{"poster":"StylaX","date":"2016-03-03T12:06:47.531+0000","up_votes":1,"down_votes":2,"body":"A megszokás nagy úr,de szerintem figyelni kell hogy mindent Magyarra fordítsunk és majd átszokunk,Riot se végezzen fél munkát,eddig is zavart engem,de gondoltam most írok hátha lesz belőle valami anyanyelvi átgondolás","replies":[{"poster":"M4dr4c","date":"2016-03-03T12:23:25.857+0000","up_votes":3,"down_votes":0,"body":"Egy lokalizáció nem arról szól, hogy mindent magyarra kell fordítani. Jó példák a személy és helységnevek, esetleg fajok nevei, de különféle szakkifejezések is ide tartoznak. Szerintem a minion belefér, mivel ez egy ismert fogalom. Olyan, mint a gól. Vagy az szerinted magyar szó? :)","replies":[{"poster":"StylaX","date":"2016-03-03T12:26:41.989+0000","up_votes":1,"down_votes":1,"body":"Személy szerint a Minionok szót sosem hallottam,maximum Minyon,de akkor ennyi erővel lehetett volna az,még az is jobb lett volna mint Minionok :( Ezzel kapcsolatban csalódott vagyok,még a kommentár is ilyesztően mondja,kirohannék a mapról :D","replies":[{"poster":"Shikaichi","date":"2016-03-03T12:29:18.620+0000","up_votes":2,"down_votes":0,"body":"De az inhibitorra is azt mondtad, hogy nem hallottad még sehol, az maradhat így. Most a minionra mondod ezt, az nem maradhat... nem értem. :S","replies":[{"poster":"StylaX","date":"2016-03-03T19:03:44.582+0000","up_votes":1,"down_votes":0,"body":"Egyszerű,az Inhibitort melyik játékba hallottad még? Én semelyikben,viszont a Minionok kifejezés egy angol szó,és ha már magyarul hallgatod a játékot elég füllbehangzó hogy azzal fogad egy magyarosítás a játék elején hogy ,,a Minionok elindultak\". Bármit eltűrnék még a ,,A kis bogyók elindultak\" is jobban hangzana mint a Minionok. Ez számomra kb olyan mintha azt mondanám: Kárral megyek suliba,esik a rain. tényleg mért nincs az időjárás jelentésben hogy,ma gyenge rain várható,néhol sztorm is kialakulhat? Ilyen alapon ez is türhető lehetne..","replies":[{"poster":"Shikaichi","date":"2016-03-03T19:51:15.073+0000","up_votes":2,"down_votes":0,"body":"Nem ezzel van a baj, hanem azzal, hogy azt se nézted, hogy mit írtál előtte, teljesen ellentmondásossá válsz.","replies":[]}]},{"poster":"Lashrath","date":"2016-03-03T17:20:03.099+0000","up_votes":1,"down_votes":0,"body":"Szerintem ő sem.. de mindegy is :D","replies":[]}]},{"poster":"M4dr4c","date":"2016-03-03T12:30:28.954+0000","up_votes":2,"down_votes":0,"body":"Vannak más gondok is ezzel a fordítással, pár jóval komolyabb is, nem értem miért épp ezen akadtál fent. Ezt személy szerint én is meghagytam volna így. Az, hogy nem ismered a szót csak arra utal, hogy nem játszottál LoL-t a magyarosítás előtt. Ez nem probléma, de épp ezért ne gondold már ennyire biztosnak a véleményed helyességét. Sokaknak ez egy évek óta használt alapkifejezés, mint a régi Quake 3, Ut játékosoknak a frag.\nAmúgy az ijesztő dolog az, hogy fordításról vitatkozol, de a saját szövegedet nem nézed át hibák után. ;) (Igen, az ijesztő nem ly.)","replies":[]}]}]}]},{"poster":"Anonym Feeder","date":"2016-03-05T01:12:13.401+0000","up_votes":1,"down_votes":0,"body":"Minionok a kezdetektől, maradjanak is azok. \nNekem nem okoznak gondot, nincs a fejük fölé írva 128 képpontos betűnagysággal a nevük, így nem zavar. Hozzátéve sosem játszok 5-ös premade Magyar csapattal, így mindig azt kell írnom az adc-nek, hogy \"last hit minions\" nem pedig \"last hit szolga\", véletlen Magyar lenne még reportolna is flém miatt.\nNem tudom ide még mit lehetne írni.","replies":[{"poster":"M4dr4c","date":"2016-03-05T02:00:53.118+0000","up_votes":2,"down_votes":0,"body":"\"még reportolna is flém miatt.\"\nEzen nagyon jót röhögtem. :D","replies":[]}]},{"poster":"Orvvadasz1","date":"2016-03-07T15:51:30.991+0000","up_votes":1,"down_votes":0,"body":"Teljesen jó így ahogy van. Mindenki ezt használja és valószínűleg nem is akarják majd leváltani. Sokkal lolosabb az hogy minion mint hogy szolga.","replies":[]},{"poster":"Nemin","date":"2016-03-04T18:45:29.540+0000","up_votes":1,"down_votes":0,"body":"Ennyi erővel hívhatnánk az Inhibitorokat Gátlóknak... Vagy a Nexust Központnak. Nem jelentenek mást, de felvizezett hangzást kelt, így szerintem teljesen jó a mostani megnevezésük.\n\nEz ugyan olyan, mint, hogy a Pentakill sem ötszörös gyilkosság, mert szimplán az első témába vágóbb és jobban illik, vagy, hogy nem Y mesteri, hanem Master Yi és nem Negyedik Jarvan, hanem Jarvan IV.","replies":[]},{"poster":"Norb Cena","date":"2016-03-04T10:32:40.233+0000","up_votes":1,"down_votes":0,"body":"Szerintem hívjuk őket migránsoknak.","replies":[]},{"poster":"Shikaichi","date":"2016-03-03T12:03:47.468+0000","up_votes":1,"down_votes":0,"body":"Szerintem nem... Abban a bizonyos mesében sem fordították le a nevüket mondjuk szolgáknak. És már megszoktuk az évek során.","replies":[]},{"poster":"StylaX","date":"2016-03-03T12:21:36.977+0000","up_votes":1,"down_votes":1,"body":"Szerintem ne a megszokást vegyük alapul,mert ha ezen az elven vagyunk akkor maradjunk már az angol változatnál,azt úgy is 2009 óta halljuk,másrészt emlékszem hogy ki lett vesézve,de hátha meggondolta magát a többség,és az újonnan csatlakozott játékosok is  vannak akik lehet erre szavaznának,az Inhibitor nevet még sehol sem hallottuk,ez szép LoL-os kifejezés,azon ezért nem változtatnék","replies":[]}]}