{"poster":"beschwoerer3624","date":"2019-06-12T19:44:05.592+0000","title":"Benutzername ändern","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\nIch würde gerne meinen Benutzername ändern, jedoch nicht den angezeigten sondern den, den man immer beim einloggen angeben muss.\r\nJemand ne Ahnung wie das geht?\r\n\r\nDanke schon mal im Voraus!","replies":[{"poster":"Avisli","date":"2019-12-15T13:05:53.340+0000","up_votes":1,"down_votes":0,"body":"Ich bin der Meinung man sollte den Ingame Namen nicht kostenlos ändern können aber, dass man den Benutzernamen nicht beliebig ändern kann finde ich schlecht...","replies":[]},{"poster":"BeerBearD","date":"2019-11-28T00:04:09.820+0000","up_votes":1,"down_votes":0,"body":"Ich hatte die Nacht ca 3 Uhr eine kommische Sache, als ich mich aus loggte und wieder einloggen wollte. Ich kam auf die normale Staretseite aber OHNE, dass ich etwas clicken konnte, sondern nur Riot heisst jetzt \"riot irgendwas\" (game ist auf englisch und hab mir nicht den genauen wortlaut gemerkt), aber auf jeden fall konnte ich nichts drücken, ausser diesen Butten auf den ich auf eine \"RIOT SEITE\" verbunden wurde und meinen normalen Benutzername (Login Name) ändern sollte. Auf Grund dessen, dass die platform möglicherweise auch auf anderen geräten dann funktioniert( android?), für die kommunikation so stand es in der beschreibung. Habe das alles erstmal nicht gemacht und mich jetzt wieder eingeloggt (23:00 des selben tages)  und dieses Fenster ist nicht mehr da... was war das? Und kam das von RIOT?!??\n\nMfG","replies":[]},{"poster":"RΞΛPLIX","date":"2019-06-13T08:25:07.108+0000","up_votes":1,"down_votes":0,"body":"Denn kann man glaub ich nicht ändern, nur wenn man den Server wechselt und dieser auf den Server schon vergeben ist. Dann muss man ein neuen auswählen aber dieser ist dann nur für den Server, das heißt wenn du wieder auf deinen Hauptserver wechselst ist das wieder der alte.","replies":[{"poster":"HyperionCH","date":"2019-06-13T09:17:18.566+0000","up_votes":1,"down_votes":0,"body":"Ich habe gehört, dass dies wirklich so ist.\n\nSo etwas verstehe ich wirklich nicht. Eine Funktion zur Änderung des Benutzernamens sollte eigentlich Standard sein.","replies":[]}]}]}