{"poster":"ZyXEL 001","date":"2018-04-21T07:11:59.436+0000","title":"Yo quiero ser ingeniero","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":2,"body":"Ustedes qu&eacute; quieren ser?","replies":[{"poster":"Tenken","date":"2018-04-21T07:21:28.886+0000","up_votes":4,"down_votes":9,"body":"Ilustrador y Artista Conceptual Profesional, enfocado en el área de los videojuegos.\n\nDesde que tengo memoria y capacidad de poder jugar he tenido el sueño de poder trabajar en el desarrollo de uno.\n\nClaro, antes con mi corta edad decía ''Quiero trabajar haciendo videojuegos'', pero obviamente eso abarca muchas áreas. Ahora se que me quiero dedicar al área mencionada de la Ilustración.\n\n▂ ▂ ▂\n\nAdemas, siempre he pensado en que, cuando tenga la habilidad de un profesional, poder ayudar a las personas que quieren mejorar en el dibujo, ya sea por que quieren ser profesionales o por simple hobbie, no dando clases como tal, sino quizá mediante vídeos y otras plataformas que usan gran mayoría de Ilustradores para compartir su contenido.\n\nPero la cosa es que me gustaría ayudar, bueno, ya lo he hecho, pero mas que nada doy consejos y corrijo ciertas cosas, así que preferiría adaptarlo al formato de vídeo narrado de como se hacen ciertas técnicas o como lograría hacer las que vaya adquiriendo con el tiempo.\n\nEn fin, eso es lo que quiero ser, profesionalmente hablando.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"AXSUS","date":"2018-04-21T14:23:09.170+0000","up_votes":1,"down_votes":0,"body":"muy buena no se por que tantos negativos","replies":[{"poster":"Quãntum Fizzics","date":"2018-04-21T15:39:23.348+0000","up_votes":1,"down_votes":0,"body":"Porque el post es un meme inadecuado...l\nNadie lo entendio excepto uno que publico mas arriba.","replies":[{"poster":"exrex","date":"2018-04-21T16:09:51.717+0000","up_votes":1,"down_votes":0,"body":"Es que es un chiste popular taringuero, ahi da risa porque lo mejor viene en los comentarios en donde se bardean. Pero esto no es taringa, aca le decis a alguien que no le gusta su opinion y te cae ban. Por eso no es chistoso.","replies":[{"poster":"Tenken","date":"2018-04-21T16:56:42.495+0000","up_votes":2,"down_votes":1,"body":"Dudo mucho que sea por eso, la moneda sin valor del foro me cae como la lluvia ioniana por casi cualquier cosa que comento, pero en fin. A mi no me sirve ni para comprar un chocolate desabrido de 150 pesos.\n\nEsto me recuerda a un post que iba a comentar ayer, de alguien que supuestamente estaba teniendo ciertos problemas emocionales y pedía ayuda en el foro, donde en el comentario que escribí (Pero no publiqué al final) mencionaba que no iba a responder basado en la broma ni en memes fomes (Por que daba a entender eso en su ultima frase del post), supongo que aquí pasa lo mismo.\n\nIgual, no es la primera vez que respondo de esta manera a post que están más enfocados en el ''humor'' (O eso creo. De todas formas, prefiero responder así), solo que en este no me di cuenta, hahah.\n\nMe declaro oficialmente ignorante en cultura taringuera.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"theforumwillburn","date":"2018-04-21T19:00:37.780+0000","up_votes":3,"down_votes":0,"body":"\"Dudo mucho que sea por eso, la moneda sin valor del foro me cae como la lluvia ioniana por casi cualquier cosa que comento, pero en fin. A mi no me sirve ni para comprar un chocolate desabrido de 150 pesos.\" Puto amo xD","replies":[]}]},{"poster":"ZyXEL 001","date":"2018-04-21T22:22:41.873+0000","up_votes":1,"down_votes":0,"body":"La comunidad del foro en el lol no tolera lo políticamente incorrecto, solo por eso no lo coloqué.\n\nYo me moría de risa, creo que me voy al infierno xD","replies":[]}]}]}]}]},{"poster":"bertox","date":"2018-04-21T08:50:11.077+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"ZyXEL 001","date":"2018-04-21T14:59:12.647+0000","up_votes":1,"down_votes":0,"body":"Sos el único que entendió el post... Pero si pongo esos memes acá la moderación me pone ban de 250 años","replies":[]}]},{"poster":"dieyasuodiejaja","date":"2018-04-21T18:38:38.875+0000","up_votes":1,"down_votes":0,"body":"Pues nesesita no tener emociones, pensar en la gente como recursos, una personalidad egoísta y ser un robot solucionador de problemas para los ricos que solo le importa lograr su objetivo ahunque cause sufrimiento, despidos, injusticias y otros desastres sociales.","replies":[]},{"poster":"RSSPLOTER","date":"2018-04-21T14:42:45.138+0000","up_votes":1,"down_votes":0,"body":"Mi sueño es tener el copete bien peinado.","replies":[]},{"poster":"AXSUS","date":"2018-04-21T14:23:31.517+0000","up_votes":1,"down_votes":0,"body":"Espero ser artista marcial agregame","replies":[]},{"poster":"Monokai","date":"2018-04-21T11:02:26.519+0000","up_votes":1,"down_votes":2,"body":"yo quiero ser tu padrastro","replies":[]}]}