{"poster":"ZyXEL 001","date":"2018-04-26T01:43:38.588+0000","title":"¿Cuánto pagan de electricidad? (Argentina)","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":3,"body":"Casi ausente toda la semana debido a lo ocupado que estoy, con poco consumo de electricidad (240kW) en el bimestre, 800$\r\n\r\nCuenten sus experiencias, seguro me compadezco de varios ac&aacute;!","replies":[{"poster":"OzymandiasV","date":"2018-04-26T01:45:15.827+0000","up_votes":3,"down_votes":4,"body":"La última factura nos vino $3500. Maldigo a los que votaron a este gobierno que te ahorca con las tarifas, endeuda el país, se llevan la plata afuera y encima deja sin trabajo a mucha gente.","replies":[{"poster":"Javo Trypod","date":"2018-04-26T01:57:41.051+0000","up_votes":5,"down_votes":2,"body":"Bajo la pobreza casi un 3% respecto al 2015, aumento el empleo (el sector obrero un 9,5%, fue el mas positivo y desde hace 9 años no habia tantos trabajadores en el rubro).\nLo de la factura, mostra el consumo con una foto.\nY amigo, todos los sectores del pais estaban en la quiebra por lo que dejo el kircherismo, si los servicios no aumentan y no se quitan subsidios ibamos a seguir en una mentira donde vivir costaba 5 pesos mientras el pais se iba a un final parecido al de Venezuela.\nDe alguna forma tenemos que pagar la jodita del gobierno anterior\nEdit:\nOlvide mencionar que se hicieron y hacen obras constantementes (No como en anteriores gobiernos donde se \"inauguraban\" edificios sin equipar y que nunca se utilizaron) tales como Retiro (completamente nueva, busca fotos quedo hermoso) Constitucion (la parte del subte toda nueva) se agrando el trayecto del metro bus por un monton de zonas, autopistas y rutas del interior (RN12 y RN14 de misiones, RN 11 de formosa, Camino del Buen Ayre, RN19 Córdoba, RN40 y RN150 San Juan, Chubut y Mendoza, RN119 Corrientes, RN147 San Luis, RN8 y RN7 Bs As, RN3 y RN40 Santa Cruz, Circunvalación Cordoba, RN23 Rio Negro, RN18 Entre Rios, RN22 Neuquen, RN9 Tucuman, etc)\nTodas estas obras se habian prometido hace 8 años y nunca se arrancaron. \nConcluyendo, no, no es un gobierno 10 puntos el de Macri, tiene muchisimas acciones cuestionables, pero creeme que mejor que hace bastante no habia un gobierno que de verdad se preocupe por el pueblo\nPD: Como veo que te interesa mucho mi vida si queres por privado te paso alguna red social mia asi ves lo bien que vivo {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"OzymandiasV","date":"2018-04-26T02:28:11.731+0000","up_votes":3,"down_votes":3,"body":"***","replies":[{"poster":"Javo Trypod","date":"2018-04-26T02:45:21.854+0000","up_votes":3,"down_votes":2,"body":"Como deducís que soy facho? y pobre?\nComo es que se mata de hambre si baja la pobreza? y no lo dice la tele, lo dice el indec, que es de lo que se aferro la oposicion durante el 2016... o ahora ya no es mas confiable? \nY no, no repito lo que dicen en la tele porque (aunque sea una pena y deberian corregirlo) el gobierno no hace propaganda en la tele de si mismo, cosa que deberia. Esto lo busque yo mismo en la pagina del gobierno y otras paginas de internet.\nLa verdad vivo muy bien, puedo darme mis gustos y por suerte gracias al laburo de mis papas puedo irme de vacaciones al exterior todos los años, y para tu info, no soy macrista, solo apoyo bastantes medidas del gobierno y lo voto ya que el resto de partidos politicos son peores.\nDentro de lo peor, cambiemos es lo menos malo","replies":[{"poster":"OzymandiasV","date":"2018-04-26T03:17:01.065+0000","up_votes":1,"down_votes":2,"body":"\"La verdad vivo muy bien, puedo darme mis gustos y por suerte gracias al laburo de mis papas puedo irme de vacaciones al exterior todos los años, y para tu info, no soy macrista, solo apoyo bastantes medidas del gobierno y lo voto ya que el resto de partidos politicos son peores.\"\n\nFlaco, no podés hablar desde la comodidad que significa ser mantenido por tus viejos. Ponete en el lugar de gente que la está pasando muy mal, que no tiene para darle de comer a sus hijos.Pero bueno, al leer tu comentario me di cuenta que sos muy jovencito y que no tenes idea de nada. Y por lo visto, tus viejos son de guita y no deben tener un discurso muy crítico de la situación porque claro, como a ellos les va bien, el resto que se caguen. Encima me nombras al INDEC como fuente confiable de datos cuando  hace años que dista de serlo.\n\nTe recomiendo que salgas de la burbuja que representa el confort de ser mantenido por tus viejos. Saludos.","replies":[]}]}]},{"poster":"snáke","date":"2018-04-26T17:27:15.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Javo Trypod,realm=LAS,application-id=J8qpiO2I,discussion-id=MqnInXmV,comment-id=00000000,timestamp=2018-04-26T01:57:41.051+0000)\n>\n> Bajo la pobreza casi un 3% respecto al 2015, aumento el empleo (el sector obrero un 9,5%, fue el mas positivo y desde hace 9 años no habia tantos trabajadores en el rubro).\n> Lo de la factura, mostra el consumo con una foto.\n> Y amigo, todos los sectores del pais estaban en la quiebra por lo que dejo el kircherismo, si los servicios no aumentan y no se quitan subsidios ibamos a seguir en una mentira donde vivir costaba 5 pesos mientras el pais se iba a un final parecido al de Venezuela.\n> De alguna forma tenemos que pagar la jodita del gobierno anterior\n> Edit:\n> Olvide mencionar que se hicieron y hacen obras constantementes (No como en anteriores gobiernos donde se &quot;inauguraban&quot; edificios sin equipar y que nunca se utilizaron) tales como Retiro (completamente nueva, busca fotos quedo hermoso) Constitucion (la parte del subte toda nueva) se agrando el trayecto del metro bus por un monton de zonas, autopistas y rutas del interior (RN12 y RN14 de misiones, RN 11 de formosa, Camino del Buen Ayre, RN19 Córdoba, RN40 y RN150 San Juan, Chubut y Mendoza, RN119 Corrientes, RN147 San Luis, RN8 y RN7 Bs As, RN3 y RN40 Santa Cruz, Circunvalación Cordoba, RN23 Rio Negro, RN18 Entre Rios, RN22 Neuquen, RN9 Tucuman, etc)\n> Todas estas obras se habian prometido hace 8 años y nunca se arrancaron. \n> Concluyendo, no, no es un gobierno 10 puntos el de Macri, tiene muchisimas acciones cuestionables, pero creeme que mejor que hace bastante no habia un gobierno que de verdad se preocupe por el pueblo\n> PD: Como veo que te interesa mucho mi vida si queres por privado te paso alguna red social mia asi ves lo bien que vivo {{sticker:slayer-jinx-wink}}\n\ny vos te crees que bajo la pobreza en medio de un proceso inflacionario y de baja de sueldos? (si los sueldos bajan porque arrreglan por debajo de la inflación las \"paritarias\"). \nBajo la pobreza con respecto al semestre anterior, si miras contra el 2015 no bajo NADA la pobreza... Las estadisticas desnundas no dicen nada, ponelas en contexto, es un efecto rebote y muy pequeño, mirando en una escala temporal mas amplia la situación solo empeora","replies":[{"poster":"Javo Trypod","date":"2018-04-27T14:49:56.319+0000","up_votes":1,"down_votes":0,"body":"Cuando asumió Cambiemos la pobreza era del 30%, despues del primer año (2015-2016) de gestion subio a 32%. De 2016 a 2017 bajo al 30,5% (creo que fue la primera vez que el indice bajo desde 9 o 10 años) y de 2017 a 2018 volvio  a bajar al 28%.\nY estos datos los mostro el Indec (organismo en el cual la oposición confia porque no esta regido por el gobierno)","replies":[{"poster":"snáke","date":"2018-05-01T17:21:02.041+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Javo Trypod,realm=LAS,application-id=J8qpiO2I,discussion-id=MqnInXmV,comment-id=0000000000010000,timestamp=2018-04-27T14:49:56.319+0000)\n>\n> Cuando asumió Cambiemos la pobreza era del 30%, despues del primer año (2015-2016) de gestion subio a 32%. De 2016 a 2017 bajo al 30,5% (creo que fue la primera vez que el indice bajo desde 9 o 10 años) y de 2017 a 2018 volvio  a bajar al 28%.\n> Y estos datos los mostro el Indec (organismo en el cual la oposición confia porque no esta regido por el gobierno)\n\nasumió con un numero, y luego bajo....pero sigue en el mismo numero prácticamente que con el que asumió...es decir no hay cambio en la pobreza. Que bajo entonces? simplemente es una fluctuación normal de ida y venida, clásicas de la argentina. Ademas el indec es poco exigente con lo que considera pobre y con lo que no... yo no veo ningun progreso en este gobierno, solo recuerdo sus promesas demagogas que no cumplio claro, por eso son demagogas.... en fin, otro gobierno corrupto y mentiroso, estoy esperando para votar cambio de vuelta","replies":[{"poster":"Javo Trypod","date":"2018-05-01T19:54:18.695+0000","up_votes":1,"down_votes":0,"body":"No, bajo 2% despues de 2 años. No pasaba desde 2008 una baja en la pobreza. Tambien se desaceleró la inflación. Y no solo eso, sino que se invierte en el pais, arriba ya mostre  algunas obras que se hicieron (muchas mas que el kirchnerismo en sus 12 años).\nEste gobierno tiene muchisimos errores, pero en 2 años hicieron mejor que el peronismo en 70.\nLA SEPTIMA potencia mundial eramos. Mira donde quedsmos por el peronismo, mira la matanza mira el pais, por donde lo veas esta destruido, y este gobierno (no es lo suficientemente bueno) ayuda y aporta mas en medio mandato que el peronismo en 70 años.","replies":[{"poster":"snáke","date":"2018-05-01T23:23:14.883+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Javo Trypod,realm=LAS,application-id=J8qpiO2I,discussion-id=MqnInXmV,comment-id=000000000001000000000000,timestamp=2018-05-01T19:54:18.695+0000)\n>\n> No, bajo 2% despues de 2 años. No pasaba desde 2008 una baja en la pobreza. Tambien se desaceleró la inflación. Y no solo eso, sino que se invierte en el pais, arriba ya mostre  algunas obras que se hicieron (muchas mas que el kirchnerismo en sus 12 años).\n> Este gobierno tiene muchisimos errores, pero en 2 años hicieron mejor que el peronismo en 70.\n> LA SEPTIMA potencia mundial eramos. Mira donde quedsmos por el peronismo, mira la matanza mira el pais, por donde lo veas esta destruido, y este gobierno (no es lo suficientemente bueno) ayuda y aporta mas en medio mandato que el peronismo en 70 años.\n\nen mi ciudad cerraron 8 plantas quimicas en los ultimos 14 meses. El impuesto a las ganancias que macri dijo que los obreros no iban a pagar mas se sigue pagando (y ms que antes).\n Al presupuesto de mi ciduad le sacaron 5 millones que ya estaban pactados porque el intendente no tiene el mismo color politico que vidal. No cambio nada. El promedio de inflacion acumulado desde que esta el pro es el mismo que la era K. El ministro de trabajo tiene empleados en negro y los despide via whatsapp... jaja me recordas a los ganaticos K defendiendo su modelo...es la misma mierda abran los ojos","replies":[{"poster":"Javo Trypod","date":"2018-05-01T23:57:41.549+0000","up_votes":1,"down_votes":0,"body":"Cuales 8 plantas quimicas cerraron en tu ciudad? me gustaria verlas!\nAh, y te recuerdo que la tasa de desempleo bajo, hay 400.000 trabajadores mas que hace 2 años... y como dije antes, el mayor cambio fue en el sector obrero, el que subio un 9,5%\nY como dije, no soy de cambiemos, tiene un monton de errores, la forma de endeudarse es absurda, y la forma en que se manejan podria ser bastante mejor. Pero soy Argentino, quiero lo mejor para mi pais, y toda la mierda peronista y kirchnerista me canso, arruino el pais. Cambiemos es tristemente (me gustaria un gobierno mucho mejor) la mejor opcion para nuestro pais.\nEdito:\nAdemas aca te cito algo que lo dice las naciones unidas en 2017:\n\n♦ \"De acuerdo al último informe de perspectivas económicas elaborado por la división de las Naciones \n Unidas para el Comercio y el Desarrollo (UNCTAD), el crecimiento del empleo para el 2018 será una \n realidad en toda América Latina.\n\nEste informe revela que la región crecerá debido principalmente al aumento de la demanda mundial, pero también por la baja de la inflación. Para Argentina se estima una suba del PBI del 3%.\"\n\nY esto corresponde a 2018 (luego de ese 3% de aumento del pbi):\n\n ♦ \"Por su parte, el Fondo Monetario Internacional (FMI) proyectó que Argentina crecerá un 2,5% en su \n PBI y la tasa de desempleo en el país será de 7,7% para el 2018.\"\n\nY para que entres en contexto, el desempleo en 2015 era del 8,6 (Acordate que hasta 2016 inclusive, el indec estuvo manipulado por el kirchnerismo, que decia que el valor de la canasta basica de argentina era inferior al de alemania)\nEsto de alemania lo dijo Moreno o Anibal Fernandez (no recuerdo bien) basandose en datos del indec\nConclusión: Este gobierno logro bajar el nivel de desempleo que habia en 2015, que seguramente era mayor al 10% pero nunca lo admitirian (esto ultimo numero es una suposicion de varios economistas, pero no tiene porque ser cierta)\n\nPD: Porfavor, estoy harto de dejar callados a todos lo que intentan tirar abajo lo que digo (fundamentados con datos e info de paginas que mostre) con cosas inventadas como facturas truchadas o sin mostrar el consumo, datos erroneos, si queres discutir, hacelo con datos exactos, no con \"cerraron 8 plantas en mi barrio\" \"mi tio se quedo sin laburo\" \"mi otro tio tambien lo echaron\".\nY porfavor, sin insulto ni denigrar, que por lo que veo sos mas respetuoso que el resto","replies":[]}]}]}]}]}]}]},{"poster":"ZeNch","date":"2018-04-26T16:30:47.522+0000","up_votes":1,"down_votes":0,"body":"Si te estan cagando (no lo se) revisa aca:\nedesur:\nhttp://www.edesur.com.ar/cuadrotarifario201802.pdf\nedenor:\nhttp://www.edenor.com.ar/cms/files/SP/CuadroTarifario.pdf\n\nFijate que tipo de cliente sos (hogar/comercial/plan social/etc) y despues segun tu consumo te da el precio por kW y lo que queda es multiplicar.","replies":[]}]},{"poster":"AC Wolf","date":"2018-04-26T01:48:45.253+0000","up_votes":1,"down_votes":0,"body":"este mes me llego de $4800","replies":[{"poster":"ZeNch","date":"2018-04-26T16:29:46.691+0000","up_votes":1,"down_votes":0,"body":"Si te estan cagando (no lo se) revisa aca:\nedesur:\nhttp://www.edesur.com.ar/cuadrotarifario201802.pdf\nedenor:\nhttp://www.edenor.com.ar/cms/files/SP/CuadroTarifario.pdf\n\nFijate que tipo de cliente sos (hogar/comercial/plan social/etc) y despues segun tu consumo te da el precio por kW y lo que queda es multiplicar.","replies":[{"poster":"AC Wolf","date":"2018-04-26T16:37:08.394+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZeNch,realm=LAS,application-id=J8qpiO2I,discussion-id=MqnInXmV,comment-id=00020000,timestamp=2018-04-26T16:29:46.691+0000)\n>\n> Si te estan cagando (no lo se) revisa aca:\n> edesur:\n> http://www.edesur.com.ar/cuadrotarifario201802.pdf\n> edenor:\n> http://www.edenor.com.ar/cms/files/SP/CuadroTarifario.pdf\n> \n> Fijate que tipo de cliente sos (hogar/comercial/plan social/etc) y despues segun tu consumo te da el precio por kW y lo que queda es multiplicar.\n\n Muchas gracias, ahora mismo ire a buscar una boleta ^^","replies":[]}]}]},{"poster":"Jinxie","date":"2018-04-26T02:02:06.414+0000","up_votes":1,"down_votes":0,"body":"5000$","replies":[{"poster":"ZeNch","date":"2018-04-26T16:29:24.646+0000","up_votes":1,"down_votes":0,"body":"Si te estan cagando (no lo se) revisa aca:\nedesur:\nhttp://www.edesur.com.ar/cuadrotarifario201802.pdf\nedenor:\nhttp://www.edenor.com.ar/cms/files/SP/CuadroTarifario.pdf\n\nFijate que tipo de cliente sos (hogar/comercial/plan social/etc) y despues segun tu consumo te da el precio por kW y lo que queda es multiplicar.","replies":[{"poster":"Jinxie","date":"2018-04-26T22:15:58.434+0000","up_votes":1,"down_votes":0,"body":"No entiendo o.0\nPero se que son 1100 kW","replies":[{"poster":"ZeNch","date":"2018-04-26T22:57:34.036+0000","up_votes":1,"down_votes":0,"body":"ES UN MONTON BOLUDO!!!!! el cuadruple que yo","replies":[{"poster":"Jinxie","date":"2018-04-26T23:27:17.059+0000","up_votes":1,"down_votes":0,"body":"Ah jaja xD , creo que usamos mucha electricidad","replies":[{"poster":"ZeNch","date":"2018-04-26T23:46:17.469+0000","up_votes":1,"down_votes":0,"body":"Trata de pasarte todo a led las lamparas, y tener cuidado con el aire acondicionado al pedo (solo si es necesario)\n\nNo son caras y hay de muchos tipos (o sea para diferentes portalamparas) y fijate la diferencia, yo creo que se pagan solas.\nRespecto a TV no consumen mucho pero no dejar encendidas al pedo, no se que decirte me asustaria que me llegue una factura asi D=","replies":[{"poster":"Jinxie","date":"2018-04-27T00:02:56.332+0000","up_votes":1,"down_votes":0,"body":"Oh, Gracias por los consejos :D","replies":[]}]}]}]}]}]}]},{"poster":"Forero","date":"2018-04-26T11:53:13.386+0000","up_votes":1,"down_votes":0,"body":"Preguntai cuanto sale la luz y estalla otra discusión de política xd","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-04-26T02:36:20.877+0000","up_votes":1,"down_votes":0,"body":"Cómo diría la abuela, ocho billetes de cien. {{summoner:14}}","replies":[{"poster":"AC Wolf","date":"2018-04-26T06:42:40.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZanahoriaAsesina,realm=LAS,application-id=J8qpiO2I,discussion-id=MqnInXmV,comment-id=0007,timestamp=2018-04-26T02:36:20.877+0000)\n>\n> Cómo diría la abuela, ocho billetes de cien. {{summoner:14}}\n\nEsoo tiene que arder.. {{champion:1}}","replies":[]}]},{"poster":"ZeNch","date":"2018-04-26T02:14:38.283+0000","up_votes":1,"down_votes":0,"body":"Yo soy de los que tienen suerte... (Edesur)\n61 dias (2 MESES) 280kW y para pagar $273 con monedas (el total de los 2 meses).\n\nEl uso de mi casa es:\nHeladera + 1 lamparita led TODO EL DIA\nLa PC 16Hs de uso + 8hs encendida sin uso (Modo normal, no suspendida ni hibernada)\n8 Luces led en la cocina encendidas unicamente en las comidas + un rato a la noche (3 horas)\nLuces de Baño/Pasillo/Comedor solo cuando se usan estos lugares (no mucho) y son todas led\n\nNo tenemos Bomba, nos llega agua de la calle directo. Usamos cocina y termotanque a gas.\n\nCada vez consumimos menos asi que venimos salvandonos de los aumentos.\n\nNo estoy conforme pero estoy mas conforme, paso a explicar:\nEmpezaron a haber obbras sobre electricidad en mi barrio y a mi que se me corataba la luz varios dias en verano y otros varios en resto del año ya no pasa mas casi, el otro dia hubo uno de 3 horas si... pero antes tenia cortes de 1 a 3 dias de forma random (literal).\nRespecto al precio, creo que era necesario el aumento PERO no entiendo esas facturas de miles de pesos... cuanto consumo tendran? Es de hogar o local? (los locales pagan como local, es precio diferente).\n\nRecuerden que cada persona que tenga una mala facturacion puede hacer el reclamo correspondiente para que le detallen el porque de dicho pago o el porque pagan un plan (ahora explico) que no les corresponde.\n\n\nCuadro tarifario:\nhttp://www.edesur.com.ar/cuadrotarifario201802.pdf\n\nRevisen tipo de tarifa que les corresponde y tienen el valor por KW.\n\nPara Edenor no tengo idea pero hay un simulador de consumo para eso aunque deberian buscar el cuadro tarifario para saber cual les corresponde.","replies":[]},{"poster":"Rynx","date":"2018-04-26T01:54:28.453+0000","up_votes":1,"down_votes":6,"body":"Mantengamos el foro del LoL como las reuniones familiares: \"no se habla de política ni de religión\".","replies":[{"poster":"Jinxie","date":"2018-04-26T02:01:44.736+0000","up_votes":1,"down_votes":0,"body":"No es politica... \nSolo pregunta cuanto les llego de luz","replies":[]},{"poster":"Salvor","date":"2018-04-26T02:28:47.657+0000","up_votes":2,"down_votes":0,"body":"Esta preguntando cuanto cuesta un servicio.","replies":[]}]},{"poster":"IvVicious","date":"2018-04-26T01:49:22.447+0000","up_votes":1,"down_votes":0,"body":"¿Pagás por bimestre? WTF","replies":[]},{"poster":"Salvor","date":"2018-04-26T01:46:06.052+0000","up_votes":1,"down_votes":0,"body":"Hoy recibí la boleta, 379$ pesos. 273kW en 57 días.","replies":[]}]}