{"poster":"ZyXEL 001","date":"2018-05-16T02:26:52.812+0000","title":"Ryze, el niño mimado de Riot. Mordekaiser, el descarte","subforum":"Charlas Generales","up_votes":5,"down_votes":9,"body":"- Ryze ha tenido 4-5 reworks a lo largo de su vida\r\n\r\n- Ryze ha sido buffeado intencionalmente con un Buff del 40% del AP en su root para que Faker lo use en Worlds 2017 \r\n\r\n- El premio de un torneo es Ryze triunfante\r\n\r\n- Ryze tiene todas sus skins reworkeadas\r\n\r\n- Siempre que queda d&eacute;bil Ryze se le hace un rework\r\n\r\n- Mordekaiser tiene gr&aacute;ficos de un juego de MS Dos\r\n\r\n- Mordekaiser tiene alrededor de 200 bugs reportados,  casi un tercio de las skins existentes en el juego.\r\n\r\n- Mordekaiser le nerfearon el Rylai en su momento y no lo han compensado con nada, o no han querido buscarle alguna soluci&oacute;n.\r\n\r\n- No recuerdo la &uacute;ltima skin que le han sacado a Mordekaiser.\r\n\r\n- El &uacute;nico rework que recibi&oacute; Mordekaiser, solo dur&oacute; gracias a estad&iacute;sticas absurdas y ganancia de oro, por medio de nerfeos y tiempo qued&oacute; obsoleto. No s&eacute; molestaron ni siquiera en mejorarlo a diferencia de Ryze.\r\n\r\n- &iquest;En cu&aacute;ntas cinem&aacute;ticas aparece Ryze?\r\n\r\n- &iquest;Y Mordekaiser? Mordekaiser debe agradecer a Kayle Pentakill (otra que tiene los pies cuadrados, igual que Volibear)\r\n\r\n- Hasta los personajes m&aacute;s populares como Lee, Ahri, Zed, entre otros han tenido sus horas bajas (merecidas) y se las han respetado pero si Ryze empieza a tener sus horas bajas aparece la ambulancia del rework.\r\n\r\n- Mordekaiser ha recibido menos abrazos que Amumu en toda su existencia.\r\n\r\nSi tienen algo para agregar, que sea bienvenido.","replies":[{"poster":"Kokoro Chacarero","date":"2018-05-16T02:56:58.068+0000","up_votes":2,"down_votes":0,"body":"[Listado completo de bugs de Mordekaiser](https://www.reddit.com/r/leagueoflegends/comments/6memxb/all_180_mordekaiser_bugs_ranked_by_importance_and/)\n\nPor si alguien se quiere reir un rato. Cuanta incompetencia.","replies":[{"poster":"Esti","date":"2018-05-17T01:58:09.188+0000","up_votes":2,"down_votes":0,"body":"Ten, no actualizaste {{sticker:slayer-pantheon-thumbs}} https://boards.euw.leagueoflegends.com/en/c/bug-reports-eu/aixWwLZf-mordekaisers-updated-buglist-back-with-over-200-bugs-and-100-pages","replies":[{"poster":"Dystopia18","date":"2018-05-17T14:31:33.422+0000","up_votes":2,"down_votes":0,"body":"ADC Morde Only (EUW)  - 8 months ago\nCurrently own a 70% win rate on 160 mordekaiser games in master tier\n\nno one cares about his bugs, the only one that do are people that don't play him and want to fixe bugs for the sake of fixing bugs\n\nbut here is the thing\nMordekaiser will never be played by non-main players\nRiot won't waste ressources to fixe 200 bugs or more on a champion that is terribly unpopular\nMordekaiser DOES NOT NEED ANY KIND OF BUFF, and yes bugfixes are buffs\n\nhe got buffed with the last bugfixe that was very noticeable (W not dealing damage on creeps, slowing his farming) and this bugfixe made mordekaiser mains across the world having something like more than 66% win rate, just look at lolalytic.\n\ni hope that you do that only for fun, because riot won't do anything, and because mordekaiser doesn't need bugfixes especially since he will get a vgu\n\n\ndaba pereza traducirlo... pero se entiende\n{{sticker:slayer-jinx-unamused}}\n\nPD: lei la mitad del enlace que publicaste e iba a escribir lo mismo pero por suerte lo encontre leyendo los comentarios,me ahorro tiempo xD","replies":[]},{"poster":"Kokoro Chacarero","date":"2018-05-17T22:17:03.012+0000","up_votes":1,"down_votes":0,"body":"God bless","replies":[]}]}]},{"poster":"Sirek","date":"2018-05-16T15:36:06.138+0000","up_votes":1,"down_votes":0,"body":"Si loco! Mordekaiser esta botado, solo un rework que por la fuerza trataron de metarlo como ADC. \n\n0 Movilidad, más de 150 bugs, visualmente las skins que tiene son solo Chromas.","replies":[]},{"poster":"PATH Kamui","date":"2018-05-16T14:43:23.885+0000","up_votes":1,"down_votes":0,"body":"El nickname de uno de los creadores del juego es Ryze xD Yo creo que  ve a su champ débil y golpea la mesa jajaja.  El otro Tryndamere no está ni ahí xd","replies":[]},{"poster":"rokushoger","date":"2018-05-16T11:03:14.899+0000","up_votes":1,"down_votes":0,"body":"Te sumo una? Adivina quien es el personaje central del video de temporada 1 de league of legends? Siiiiiiiiiiiiiiiiiii es ryze! \nAhora a la inversa, adivina cuantos videos tiene morderkaiser como personaje principal? Siiiiiiiiiiiiiiiiiiiiiiiiii 0! (el de pentakill no cuenta porque el no es estelar, sino que la figura más destacada ahí es kayle).","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-05-16T03:08:00.612+0000","up_votes":1,"down_votes":0,"body":"Sólo interesa el esport.","replies":[{"poster":"ZyXEL 001","date":"2018-05-16T03:10:39.077+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=v7qsfXsE,discussion-id=4WObn2a8,comment-id=0001,timestamp=2018-05-16T03:08:00.612+0000)\n>\n> Sólo interesa el esport.\n\n¿Quieres unas piscolits? ¡Mi viejo auspicia!","replies":[]}]}]}