{"poster":"ZyXEL 001","date":"2016-02-08T19:20:00.263+0000","title":"Pequeño nerf a Ahri (Leer primero)","subforum":"Charlas Generales","up_votes":7,"down_votes":25,"body":"Solo es una sugerencia, simplemente es para quitarle un poco de seguridad al personaje sobre todo en solo Q.\r\n\r\nAhri lleva m&aacute;s de 1 a&ntilde;o rondando el 54 % con una popularidad de alrededor 15%, lo cual es mucho.\r\n\r\nQ (Pasiva): Ahora Ahri obtiene 60% de velocidad de movimiento despu&eacute;s de impactar a un campe&oacute;n durante 1 segundo.\r\n\r\nLa actual pasiva da 60% de vel de movimiento de forma decreciente independientemente si impacta o no en el campe&oacute;n, esta ser&iacute;a velocidad constante sin decrecer en el tiempo ya que el orbe debe impactar y por lo tanto debe tener una mejor recompensa.\r\n\r\nDarle una funci&oacute;n parecida a la pasiva del Phage, lo cual recompensar&iacute;a m&aacute;s a aquellos que realmente la sepan jugar que a aquellos que solo abusan de esta pasiva. Tambi&eacute;n de esta manera ella deber&iacute;a arriesgarse un poco m&aacute;s.\r\n\r\n\r\nSaludos! La reina Nati (: ! {{champion:92}} {{champion:29}}","replies":[{"poster":"ZyXEL 001","date":"2016-02-08T20:27:30.074+0000","up_votes":3,"down_votes":2,"body":"La gente te hunde a negativos pero no da un argumento consistente.\n\nMucho fan ronda por acá.","replies":[{"poster":"Rikka Takänashi","date":"2016-02-09T01:44:51.467+0000","up_votes":1,"down_votes":0,"body":"Concuerdo con vos. Yo te doy un argumento sobre el nerfeo a ahri: Yo opino que si que le bajen aunque sea un poco pero por otra parte a mi me divierte mas tratando de encontrar su punto débil y tratar de atacar en ese punto pero ya me sali del tema, si bajenle un poco la velocidad de movimiento aunque sea hasta 45 - 50 % y saquen esa seguridad como dijiste porque Ahri cuando se tira es porque te mata nose si sirvio pero maso menos opino eso","replies":[{"poster":"ZyXEL 001","date":"2016-02-09T03:39:46.231+0000","up_votes":1,"down_votes":0,"body":"O podría escalar por nivel, también es otra idea aunque eso le quitaría un poco de su identidad al comienzo de la partida.","replies":[{"poster":"Rikka Takänashi","date":"2016-02-09T03:42:05.542+0000","up_votes":1,"down_votes":0,"body":"mmmm si pero también esta buena esa idea que escale por nivel","replies":[]}]}]}]},{"poster":"Sir Crucifix ","date":"2016-02-08T19:33:47.939+0000","up_votes":2,"down_votes":1,"body":"uh te van a caer la banda lechera a insultarte y ponerte negativos  , ahri = manuelas","replies":[{"poster":"ZyXEL 001","date":"2016-02-09T03:32:26.824+0000","up_votes":1,"down_votes":2,"body":"Me comí los negativos de la vida, parezco Dasant xD","replies":[{"poster":"Sir Crucifix ","date":"2016-02-09T04:47:21.109+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=v7qsfXsE,discussion-id=lcfYEOaF,comment-id=00010001,timestamp=2016-02-09T03:32:26.824+0000)\n>\n> Me comí los negativos de la vida, parezco Dasant xD\n\nbueno pero ese es un pedofilo","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2016-02-08T19:32:16.874+0000","up_votes":2,"down_votes":1,"body":"seria nerfear la vel. que gana solo por que si y buffear la que gana al impactar a un campeon? mmm no suena mal.","replies":[{"poster":"ZyXEL 001","date":"2016-02-08T19:35:04.795+0000","up_votes":2,"down_votes":4,"body":"Si, es la idea, pero me matan a negativos por inercia y ni siquiera escriben la razón :(","replies":[]}]},{"poster":"Silver000","date":"2016-02-08T23:11:31.551+0000","up_votes":1,"down_votes":0,"body":"XD en el mismo dia lei nerf, buff y rework al mismo campeon","replies":[]},{"poster":"Tiranosaurio Rex","date":"2016-02-09T18:22:18.631+0000","up_votes":1,"down_votes":1,"body":"Tanto problema la velocidad de movimiento Ahri en un champ que esta preparado para para correr de un gank con la ulti o la Q ya esta bastante nerfeada no entiendo la necesidad del post si erra el Charm queda vendida y no puede hacer todo su maximo daño o tiene que usar la ulti para correr esta bien Ahri yo me preocuparia por otra cosa como las pirañas no viste la pelicula donde mandan al submarino nuclear contra las pirañas, y una se mete por el periscopio y le saca el ojo al que esta viendo y hace hay hay hay!!","replies":[]}]}