{"poster":"ZyXEL 001","date":"2018-03-25T21:57:14.222+0000","title":"Reflexiones: Riot, voluntarios y eventual final de la CLS","subforum":"Charlas Generales","up_votes":9,"down_votes":11,"body":"Buenas tardes, este post es simplemente un llamado a reflexi&oacute;n y debate:\n\n____\n\n\n>**Para los que no conocen del tema**: \n\n>Hace un poco menos de un a&ntilde;o, Riot ha decidido que todos los voluntarios se reunan en la final de la CLS realizada en Buenos Aires compartiendo un momento maravilloso. Esto no parecer&iacute;a molestar a nadie pero simplemente por el hecho de que la comunidad de LAS desconoce el rol del voluntario.\n\nImaginemos por un momento a una persona que vive en la Patagonia, en el sur de Chile, o en el norte de ambos pa&iacute;ses o en un lugar remoto, que desear&iacute;a con toda su alma poder ver a los finalistas de la CLS y resulta que una persona por el simple hecho de dar consejos en el **foro de un juego (que tiene poca visibilidad ante la comunidad) se gane un pasaje y estad&iacute;a a  ver dicha final.**\n\n&iquest;A qu&eacute; viene revivir esto? Pues estamos a pocos meses de presenciar una **nueva final en Per&uacute;**, **imaginen que por el simple hecho de comentar ac&aacute; se ganen un pasaje a Per&uacute;, estad&iacute;a en Per&uacute; y dem&aacute;s &iquest;C&oacute;mo creen que se sentir&iacute;a el resto de la comunidad?**\n\nCuando realizaron esta reuni&oacute;n en Buenos Aires, **&iquest;No pensaron en las personas que vienen del resto de Argentina y de Chile que gastan miles de pesos en pasaje, estad&iacute;a, qu&eacute; estuvieron esforz&aacute;ndose para poder llevar a su hijo a ver a sus &iacute;dolos? ** Honestamente dicho acto fue una **falta de respeto** a las personas que en su momento estuvieron planeando su log&iacute;stica para presenciar el evento en su tiempo.\n\n- **A los voluntarios: **&iquest;Se pusieron en el lugar de aquellas personas que no pudieron ir por otras razones (socioecon&oacute;micas, tiempo, etc) y que ustedes por simplemente ser seleccionados para colaborar en un foro donde todos sabemos que no todos cumplen el rol, ocuparon esos lugares?\n\n- **A los rioters:** &iquest;Qu&eacute; se les pas&oacute; por la cabeza?\n\nPorque la **culpa** no la tienen los voluntarios, al fin y al cabo fueron invitados, **si no quien les regal&oacute; dicho premio** que es en todo caso** Riot LAS.**\n\n____\n\n\n\n\nUn saludo.","replies":[{"poster":"Salvor","date":"2018-03-25T22:51:51.175+0000","up_votes":7,"down_votes":3,"body":"Yo lo veo razonable, se pudieron conocer Rioters y Voluntarios de manera personal.\nSeguramente lograron una comunicacion mucho mas buena que un simple grupo de chat.\nDespues lo de los que no pudieron ir por razones economicas etc, me parece algo obvio.\nRiot es una empresa, (nos guste o no) y no una ONG. Yo tampoco puedo ir por mil razones como esta a montones de eventos ¿y que?\n¿Acaso podian sacar un \"CLS PARA TODOS\"? Me parece un poco fantasioso. \nLa empresa decidio llevar a ese grupo y no me parece razon para señalar con el dedo.\n\nRespecto al programa de voluntarios es un tema para largo, habia escuchado que se pensaba hacer una revision.\nAlgunos aportan mucho, otros poco, otros aportan en silencio (conoci un par de casos) y otros simplemente se fueron.\n\nUno puede criticar tanto a Rioters, Voluntarios y Moderadores.\nPero cuando ya lo unico que hacen es eso y se paran en el lugar del HATER que solo aparece cuando alguno postea en contra o sale algun bardo con un baneo ya es lamentable.\nNo hay que caer en ningun extremo, ni el que justifica todo ni el que critica todo.\n\nSaludos!","replies":[]},{"poster":"BG King Fratus","date":"2018-03-25T22:25:58.700+0000","up_votes":2,"down_votes":1,"body":"Quizás sea política de la empresa, esa orden venga de arriba, como premio y motivación para que continúen con su \"colaboración\" (las comillas solo se aplicarían para LAS).\n\nMas allá de la conformidad que se pueda tener por parte de la comunidad por como desempeñan su \"rol\", ellos no tienen la culpa de haber sido seleccionados, ni mucho menos el recibir una compensación por su \"labor\" en nuestros foros. Creo que deben aprovechar la experiencia y sacarle el jugo al máximo.","replies":[{"poster":"ZyXEL 001","date":"2018-03-25T22:30:48.191+0000","up_votes":1,"down_votes":2,"body":"Eso lo dejé expreso en la última oración, no cuestiono la labor de ellos (y este post no es precisamente para debatir si el voluntario hace bien o no su tarea). \n\n\nLo que estoy pidiendo es un lugar a reflexión de parte de ambos y que se pongan en el lugar de la persona que se tomó tiempo en planear dicho viaje para poder estar presente.","replies":[]}]},{"poster":"Tenken","date":"2018-03-25T22:21:25.424+0000","up_votes":4,"down_votes":7,"body":"Todo eso, se resume en una sola palabra, que también puede definir a todo lo que fue (En su mayoría) el asunto de los Voluntarios y de Riot LAS con todo esto: \n\n>Nepotismo\n\nObviamente todos los que no hacen oídos sordos a esto, o no aspiran a ser uno de ellos lo saben.\n\n▂ ▂ ▂\n\nLamentablemente a mi pesar, siento (Y posiblemente tenga razón, y esto lo digo con la mente fría y todo el respeto del mundo) que Riot LAS es una sección de Riot que nunca aprende de sus errores, ya que simplemente no buscan mejorar. \n\nAunque me lo nieguen una y mil veces, ellos velan por el interés personal y el de sus amigos, no buscan apoyar a los demás simplemente por ser su trabajo, sino para ser reconocidos, hasta por responder preguntas bastante básicas.\n\nPosiblemente me meta a la pata de los caballos (Es un decir en Chile), pero la experiencia personal que he tenido con Riot LAS, ha sido increiblemente nefasta (Con la excepción de solo una vez, según recuerdo, que se actuó con verdadero criterio).\n\nDesde Voluntarios que aportan al acoso, Moderadores que sancionan injustamente, pasando por Agentes que tergiversan las palabras de uno y nunca llegan al consenso, hasta un Rioter que te responde de manera burlona y con prepotencia, y que en pocas palabras, te dice que no estas capacitado mentalmente para entender como actúan.\n\nPor donde lo vea, Riot LAS es una región que no va a poder mejorar mientras siga así, y sus empleados (Por no decir otro termino, ya que de ellos debería empezar el cambio) son lo que en cualquier empresa competente y seria merece un despido o minimo una amonestación, cosa que hasta donde veo, es inexistente con ellos.\n\nY ahí vuelvo a lo primero que dije; si Riot LAS no cambia de una vez su actuar, jamas vamos a mejorar como comunidad, y cosas, como el lamentable hecho que mencionas, continuarán pasando.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"BG King Fratus","date":"2018-03-25T22:30:59.005+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Tenken,realm=LAS,application-id=v7qsfXsE,discussion-id=LYKQV9Pt,comment-id=0000,timestamp=2018-03-25T22:21:25.424+0000)\n>\n> Todo eso, se resume en una sola palabra, que también puede definir a todo lo que fue (En su mayoría) el asunto de los Voluntarios y de Riot LAS con todo esto: \n> \n> Obviamente todos lo que no hacen oídos sordos a esto, o no aspiran a ser uno de ellos lo saben.\n> \n> ▂ ▂ ▂\n> \n> Lamentablemente a mi pesar, siento (Y posiblemente tenga razón, y esto lo digo con la mente fría y todo el respeto del mundo) que Riot LAS es una sección de Riot que nunca aprende de sus errores, ya que simplemente no buscan mejorar. \n> \n> Aunque me lo nieguen una y mil veces, ellos velan por el interés personal y el de sus amigos, no buscan apoyar a los demás simplemente por ser su trabajo, sino para ser reconocidos, hasta por responder preguntas bastante básicas.\n> \n> Posiblemente me meta a la pata de los caballos (Es un decir en Chile), pero la experiencia personal que he tenido con Riot LAS, ha sido increiblemente nefasta.\n> \n> Desde Voluntarios que aportan al acoso, Moderadores que sancionan injustamente, pasando por Agentes que tergiversan las palabras de uno, hasta un Rioter que te responde de manera burlona, y que literalmente te dice que no estas capacitado mentalmente para entender como actúan.\n> \n> Por donde lo vea, Riot LAS es una región que no va a poder mejorar mientras siga así, y sus empleados (Por no decir otro termino) son lo que en cualquier empresa competente y seria merece un despido o una amonestación, cosa que hasta donde veo, es inexistente con ellos.\n> \n> Y ahí vuelvo a lo primero que dije; si Riot LAS no cambia de una vez su actuar, jamas vamos a mejorar como comunidad, y cosas, como el lamentable hecho que mencionas, continuarán pasando.\n> \n> Saludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤\n\nCoincido totalmente con tu exposición. Creo que a cada server lo hacen los empleados (no se si el Soporte y colaboradores de foros entrarian en este rotulo). Tengo la oportunidad de interactuar en los foros y con el Soporte, tanto en LAS como BR, y la diferencia es abismal: la oratoria que tienen tanto los mods, como el Soporte y los que hacen videos es muy por encima superior a LAS. El respeto, conocimiento, redaccion e incluso su apertura a criticas, es muy satisfactoria. \n\nPero bueno, creo que cada vez quedan mas cabos sueltos y disconformidades por parte de la comunidad de LAS con los empleados de Riot. Y podemos ver que un buen puerto no es nuestro destino.\n\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Tenken","date":"2018-03-25T22:40:13.295+0000","up_votes":2,"down_votes":3,"body":"Para que LAS mejore como comunidad, se debe empezar por la cabeza de la serpiente, o sea, por la gente que tienen a cargo.\n\nDe nada sirve que los usuarios mejoremos, para que ellos sigan ejerciendo un mal uso de poder y se aprovechen de la inconsciencia y falta de percepción que pueden tener algunos que quizá no han desarrollado un criterio propio.\n\nY lo peor, es que la comunidad casi siempre ve con malos ojos comentarios como los míos, donde se dice la más pura verdad (Con evidencias transparentes como el post de la sanción de Turing Test).\n\nNo se si en mi caso sea por el rencor injustificado que me tienen, o por que de verdad la comunidad es bipolar y tiene falta de criterio propio, guiándose solamente por la opinión colectiva de turno, ya sea dada por un Rioter o por un usuario cuyo post tiene mas de 10 positivos.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"BG King Fratus","date":"2018-03-25T22:43:35.151+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Tenken,realm=LAS,application-id=v7qsfXsE,discussion-id=LYKQV9Pt,comment-id=000000000000,timestamp=2018-03-25T22:40:13.295+0000)\n>\n> Para que LAS mejore como comunidad, se debe empezar por la cabeza de la serpiente, o sea, por la gente que tienen a cargo.\n> \n> De nada sirve que los usuarios mejoremos, para que ellos sigan ejerciendo un mal uso de poder y se aprovechen de la inconsciencia y falta de percepción que pueden tener algunos que quizá no han desarrollado un criterio propio.\n> \n> Y lo peor, es que la comunidad casi siempre ve con malos ojos comentarios como los míos, donde se dice la más pura verdad (Con evidencias transparentes como el post de la sanción de Turing Test).\n> \n> No se si en mi caso sea por el rencor injustificado que me tienen, o por que de verdad la comunidad es bipolar y tiene falta de criterio propio, guiándose por la opinión colectiva de turno, ya sea dada por un Rioter o por un usuario cuyo post tiene mas de 10 positivos.\n> \n> Saludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤\n\nSe han expuesto muchos casos, muchas screenshots tanto de Mods como del Soporte, donde denota su falta de criterio y poca profesionalidad (si es que se puede apañar el termino en este caso) al evaluar situaciones o dirigirse a los usuarios. Y tampoco se puede hacer una exposicion o reclamar algun derecho, porque te van a censurar, quitar de contexto el problema, o buscarle el pelo al huevo. Y el claro ejemplo de eso lo mencionaste, es el de Turing Test.","replies":[]}]}]}]}]}