{"poster":"ZyXEL 001","date":"2018-01-25T01:53:06.778+0000","title":"Hay un Rey de la censura en el foro?","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":6,"body":"Cierto personaje cada vez que le hacen un post en contra le caen muchos negativos, si le haces comentario en contra te caen tambi&eacute;n muchos negativos.\n\nNo s&eacute; supone que una persona que supuestamente pregona de &quot;ayudar a la comunidad&quot; este censurando con su club y los clubes aliados a los posts qu&eacute; no est&eacute;n de acuerdo con el mediante horda de downvotes cuando la cantidad de comentarios en contra es mucho mayor?","replies":[{"poster":"GDPhyros","date":"2018-01-25T02:44:46.827+0000","up_votes":3,"down_votes":1,"body":"lo que yo si e visto es un par de usuarios que les gusta hacer polemica por cosas que no valen la pena y de como los bajan a negativos al momento en que publican alguna p#ndejada","replies":[]},{"poster":"Tenken","date":"2018-01-25T02:22:47.532+0000","up_votes":6,"down_votes":5,"body":"No se a quien te refieras con exactitud (Y teniendo en cuenta que el viejo ''rey de la censura'' ya no se pasa por estos lares), sin embargo.\n\nHe visto casos en los que hay unas ''vacas sagradas'' en el foro, pero eso normalmente pasaba con la gente que tiene rango; y por ahora no he visto algo similar en el foro, lo cual está muy bien.\n\nPero respecto a lo que mencionas de ''ayudar a la comunidad'', puedo darme una idea.\n\nEn fin, no es que en el foro se reconozca a la gente que en realidad ayuda o intenta ayudar a los demás de manera desinteresada (Esos quedan en el anonimato, por obvias razones, ya que no necesitan publicar su ''altruismo'' a cada rato, pidiendo cifras, sino que simplemente lo hacen); y es casi un cliché que los que hacen lo contrario siempre parecen tener un séquito de seguidores que apoyan eso, y siempre es alguien deshonesto (Hablando en aspectos generales).\n\nDe todas formas, es mejor ignorar, los positivos y negativos en el foro ya dejaron de tener valor, simplemente son una forma de decir que estas de acuerdo con algo o no, o que algo te gusta o te disgusta.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"WhiteMax","date":"2018-01-25T14:56:48.051+0000","up_votes":1,"down_votes":0,"body":"> ya dejaron de tener valor,\n\nAlguna vez lo tuvieron? mas alla del tema de entrar a \"Populares\".","replies":[{"poster":"Tenken","date":"2018-01-25T15:20:44.351+0000","up_votes":1,"down_votes":0,"body":"Bueno, eso parece ser verdad, acabo de ver los ''mejores'', y la mayoría son post repetidos del Modo Reclutamiento, protestas y peticiones. \n\nY casi todos esos post tienen mas de 1 año, que curioso.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]}]}]},{"poster":"Kłaytøn","date":"2018-01-25T03:20:15.070+0000","up_votes":3,"down_votes":2,"body":"Otro mas de los cuales piensan tener la razón absoluta y estar 100% correcto en todo al parecer.","replies":[]},{"poster":"FedecarboneroUY","date":"2018-01-25T02:28:54.803+0000","up_votes":3,"down_votes":2,"body":"{{sticker:slayer-pantheon-popcorn}} \n\naguante el {{champion:432}}","replies":[]},{"poster":"Ks Erwyn","date":"2018-01-25T02:23:50.396+0000","up_votes":3,"down_votes":2,"body":"rey de los hipócritas, rey sin color, rey de los positivos en post propios, y no se le cae la cara de vergüenza de acusar a otros de mafia o multicuentas, me hace acordar a los  bueno/malos tiempos de Auri...\n\n\n\n\n{{sticker:sg-lulu}} Los caretas siempre caen","replies":[]}]}