{"poster":"ZyXEL 001","date":"2016-01-14T21:47:58.832+0000","title":"Porque Riven es odiada? =(","subforum":"Charlas Generales","up_votes":2,"down_votes":6,"body":"Eso lo del t&iacute;tulo.\n\nEs que me encanta el personaje pero noto mucho odio hacia ella.\n\nQuería empezar a jugarla pero me desmotiva que haya tanto odio hacia Riven, es muy entretenida, no se que tiene de malo. \n\nAsí que no se si jugarla :(","replies":[{"poster":"Yrox the Third","date":"2016-01-14T21:52:53.202+0000","up_votes":4,"down_votes":1,"body":"Es por los estereotipos de los \"main rivens\" que se creen pros, se tiran 1 vs 5 aunque vayan 0/20 creyendo que se hacen penta, flamean a todos, etc. hay una cantidad ENORME de este tipo de gente.\nAdemas de que Riven, si es entretenida, no te lo niego, pero es un personaje con un snowball MUY FUERTE y se esta feedeada es casi imposible de parar y la gente no sabe jugar contra ella.\n\nEn lo personal, me gusta Riven, simplemente odio a la gran mayoria de que la usa por estos estereotipos.","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:11:16.858+0000","up_votes":1,"down_votes":0,"body":"Es por la gente, pero la campeona es muy divertida de jugar y muy linda también :3","replies":[]}]},{"poster":"Bienzahar","date":"2016-01-14T21:55:14.439+0000","up_votes":3,"down_votes":1,"body":"Mira mamá sin manos!","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T21:59:07.942+0000","up_votes":1,"down_votes":0,"body":"Pero sin manos nadie puede jugar... una está en el teclado y la otra en el mouse.","replies":[{"poster":"Bienzahar","date":"2016-01-14T22:01:27.544+0000","up_votes":1,"down_votes":0,"body":"Puedes cabecear el teclado y hacerte un penta.","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:04:47.241+0000","up_votes":1,"down_votes":0,"body":"Te sirve para salir de bronce 3? xDDDD","replies":[{"poster":"Bienzahar","date":"2016-01-14T22:42:07.618+0000","up_votes":1,"down_votes":0,"body":"Soy Platino IV en otra cuenta :V","replies":[]}]}]}]}]},{"poster":"Razgrid","date":"2016-01-14T21:51:52.698+0000","up_votes":3,"down_votes":1,"body":"dejame ver :\n\naparte de \n\n- tener escudo op\n- tener mas saltos que fizz\n- tener stunt\n- daño aoe\n- ulti de rango\n\nNo, no se por que es odiada","replies":[{"poster":"Thesupersayan","date":"2016-01-15T03:31:04.061+0000","up_votes":1,"down_votes":0,"body":"Tambien darius y garen son counters de ella asi que GG :v","replies":[]},{"poster":"ZyXEL 001","date":"2016-01-14T22:10:28.362+0000","up_votes":1,"down_votes":0,"body":"Que significa op? Es que no entiendo mucho todavia la terminología de aca :3\n\nFizz es el pescado no? Pero ese no lo targeteas, a Riven si xD","replies":[]}]},{"poster":"MS 903","date":"2016-01-15T03:20:03.323+0000","up_votes":1,"down_votes":0,"body":"ademas aunke tu no lo creas riven para sacarle el 100% de efectividad a sus habilidades igal hay que tenerle manos como para cancelar las animaciones, cancelar las q con ataques basicos etc. ademas si le sabes jugar bn con ella en elo bajo es facil salir con ella","replies":[]},{"poster":"DragonKI2","date":"2016-01-14T22:05:22.814+0000","up_votes":1,"down_votes":0,"body":"Yo no la odio , pero meda un asco .. ,solo por que tiene un movilidad y un daño absurdo, aparte de los flamers que se creen pros con ella.. mas aun. \ntiene un daño en area horrible,un escudo que escala con ad, movilidad op, ulti que le damas daño y mas daño en area yupi yeahh!!!  y por ultimo sus cancelamientos de animaciones eso es lo mas asco que me daa mi .\n\nEn resumen, juega si quieres con riven naide  no te lo permita pero eh , no te vuelvas uno de esos flamers de mrd pls , y si te barean mute y report :P\n\nSegun yo..","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:07:37.654+0000","up_votes":1,"down_votes":0,"body":"Pero la chica con las orejas y muchas colas tiene tambien mucha movilidad o el Kassadin (Asi se llamaba) y nadie dice nada xDDDD\n\nNo se, yo juego por diversión, nada más :)","replies":[{"poster":"DragonKI2","date":"2016-01-14T22:12:08.913+0000","up_votes":1,"down_votes":0,"body":"Pero una cosa es ahri  otra khassa , aparte khasa la ulti le consume mana yes mucho, mientras que riven no tiene mana, lueog ahri es la ulti que tiene un cc claro... mietras que riven la tiene en todas las otras 2 habilidades, peor si juga por diversion JAJAJAJ","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:20:00.071+0000","up_votes":1,"down_votes":0,"body":"Ah es porque no tiene mana xD!\n\nPero te sigue a todas partes! Yo una vez seguí a uno y no lo alcanzaba con maestro yi, use ulti y todo y se escapaba y me agarro blitz y me mori :C","replies":[{"poster":"PARASITADO","date":"2016-01-14T23:59:18.882+0000","up_votes":1,"down_votes":0,"body":"yo no odio a riven, el tema es que no sabemos como jugar contra eso porque la mayoría creo que siguen en el meta de tanques sin movilidad como legendarius. y nerfeadin/Divorssiadin y ahri con un tanque mueren. por eso","replies":[]}]}]},{"poster":"Dildo de Moria","date":"2016-01-14T22:12:40.830+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=v7qsfXsE,discussion-id=R0Z1dIau,comment-id=00050000,timestamp=2016-01-14T22:07:37.654+0000)\n>\n> Pero la chica con las orejas y muchas colas tiene tambien mucha movilidad o el Kassadin (Asi se llamaba) y nadie dice nada xDDDD\n> \n> No se, yo juego por diversión, nada más :)\n\nPorque la chica de muchas colas no te va a matar a básicos y sus enfriamientos no son relativamente cortos ¬¬","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:18:52.185+0000","up_votes":1,"down_votes":0,"body":"Enfriamientos... es lo que demora la habilidad no? N.n\n\nBueno, igual Riven es tan hermosa y dulce :)\n\nImaginátela a Riven con orejas y muchas colas!  n.n\n\nEsa tal Ahri veo que también borra mucha gente no como Riven pero te tira el beso y estás muerto xD","replies":[]}]}]}]},{"poster":"Lucrexio","date":"2016-01-14T22:07:07.354+0000","up_votes":1,"down_votes":0,"body":"Es al igual que los champs que tienen potencial para hacerlos pelota a todos, cuando jugas contra ella la odias, pero cuando la usas, no.","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:21:13.632+0000","up_votes":1,"down_votes":0,"body":"Como Master Yi? Ese te pega mucho a básicos y te mata rápido xD\n\nO Voli que tira unos rayos gigantes, te muerde y moriste jaja! Y parece inmatable!","replies":[{"poster":"PARASITADO","date":"2016-01-14T23:56:32.367+0000","up_votes":1,"down_votes":0,"body":"o heimerdonger, minuto uno oponentes saludando con el baile, la broma o la maestría (super amistoso) y heimer con sus torretas autistas inmortales {{item:3145}}    {{champion:74}}","replies":[]}]}]},{"poster":"MrFriki","date":"2016-01-14T21:55:55.461+0000","up_votes":1,"down_votes":0,"body":"Jugala y ya esta, ¿tanto te preocupa la opinion de la gente?","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:00:30.902+0000","up_votes":1,"down_votes":0,"body":"Es que soy nuevo, o sea estuve jugando hace mucho mucho tiempo pero deje y volvi. Y la estoy practicando en personalizadas porque lo intente practicar en una cuenta mas bajita que tengo y me decían noob champ si ganaba y si perdía me decían que era malo :(\n\n{{champion:92}} {{item:3151}}","replies":[{"poster":"MrFriki","date":"2016-01-14T22:42:48.230+0000","up_votes":1,"down_votes":0,"body":"Y eso te preocupa? \nen lo personal siempre use a jax, un campeon que me gusta y siempre me decian noobchamp y cosas asi pero nunca les hago caso, si no les gusta lo que juego a mi no me importa lo uso porque me gusta y vos tendrias que hacer lo mismo, si te gusta jugalo que importa la opinion de los demas y de ultima mutealos.","replies":[]}]}]},{"poster":"Gruga","date":"2016-01-14T22:01:11.399+0000","up_votes":1,"down_votes":0,"body":"Por lo que dijieron antes aparte de que siempre la riven aliada va a feedear y la enemiga va a feedearse xD","replies":[{"poster":"ZyXEL 001","date":"2016-01-14T22:05:59.509+0000","up_votes":1,"down_votes":0,"body":"Eso pasa mas con los lee sin, el enemigo hace buenos insects y el aliado bueno coloca el ward XDD","replies":[]}]}]}