{"poster":"ZyXEL 001","date":"2016-02-17T05:05:07.933+0000","title":"Ahri se merece un nerf... Pero no ese!!!!!","subforum":"Charlas Generales","up_votes":3,"down_votes":8,"body":"Quieren matar parte de su jugabilidad???\n\n**Edit/contexto del post: Nerfeo a la E para el próx parche, si se lanza a alguien con salto afecta al final el encantamiento, como funcionaba antes el  Horizonte de Sucesos de Veigar.**\n\nAcaso no se recompensa a la persona que puede predecir un desplazamiento ofensivo hacia ella (salto de rengar, R de Diana, Wukong, LB, etc) de la persona que si??\n\nPero claro!!!! Dejemos que Riven pueda cancelar animaciones con su Q, que Lee pueda hacer estragos con su kit de habilidades sin ninguna restricci&oacute;n ambos!!\n\nEntre hacerla m&aacute;s vulnerable y hacerla polvo, est&aacute;n haciendo lo segundo porque no solo la hacen vulnerable, tambi&eacute;n tocan parte de su esencia.\n\nCada vez se distingue menos entre el jugador de Ahri de verdad y un jugador que reci&eacute;n la empieza a jugar... sigo pensado que la movilidad a la Q fue el buffeo m&aacute;s mal pensado que le dieron.\n\nY no vengan con la excusa de querer clarificar los CC y que los taunts sea taunts porque no es lo mismo que Shen te atraiga con 4k de HP y no se cuantas resistencias a que Ahri atraiga a Rengar reci&eacute;n cuando est&aacute; al lado despu&eacute;s de saltar y le termine pegando un b&aacute;sico (Porque as&iacute; funcionan las provocaciones) que la termine matando.","replies":[{"poster":"FedecarboneroUY","date":"2016-02-17T06:03:47.904+0000","up_votes":3,"down_votes":0,"body":"\"que Lee pueda hacer estragos con su kit de habilidades\"\n\njajajajaja estraguisimos, lo permabaneare o permapickeare de ahora en adelante :v","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T06:14:49.093+0000","up_votes":1,"down_votes":1,"body":"Pasa que hace estragos en buenas manos y la mayoría en vez de manos tiene Manaos.","replies":[{"poster":"FedecarboneroUY","date":"2016-02-17T06:24:13.535+0000","up_votes":1,"down_votes":0,"body":"lo uso todos los dias, y los estragos los haces al principio, donde te pongas de buenito a dejarles las kills a tus compañeros o donde tengan un champ un poco thanke y rotillo y un team con buen cc y disengage se te van todos los estragos, eso te lo aseguro ;)\n\njuga con Udyr, le vas a poder ganar desde el Early hasta el Late game, no le tengas miedo a los Lee´s\nSaludos :)","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T06:29:33.228+0000","up_votes":1,"down_votes":1,"body":"No le tengo miedo, pero yo hablo de la gente high elo, Lee Sin esta fuerte hoy por hoy, además que al kit de habilidades (Su jugabilidad) no ha sido tocada jamás!! Igualmente no viene al tema si está fuerte o no.\n\nNo apunto a que Lee tenga 15k de daño, no me interesa, si no conservar parte del estilo de juego de cada uno, nerfear sin limitar las mecánicas.\n\nImaginate que un día Riot venga con que la patada de Lee Sin no la podés cambiar más de dirección con el flash o que la 2da Q puede ser frenada si te chocas con un campeón sin causarle daño al que se cruza... por dar dos ejemplos.","replies":[{"poster":"FedecarboneroUY","date":"2016-02-17T18:01:30.540+0000","up_votes":1,"down_votes":0,"body":"Bueno, yo no jugaba en la season 4, pero al parece por lo que me han dicho, el escudo de la W no te lo daba solo al saltar a un aliado, sino que a un ward o a un minion tambien te lo daba, cosa que ahora no es asi, y supuestamente su E realentizaba mas... al parecer si son cambios que le han hecho a su jugabilidad, aunque yo no los experimente, se a lo que te referis, pero esos cambios a los que te referis se los han hecho (hasta hace muy poco por ejemplo, a Azir) antes Azir cuando usaba su E para ir a un soldado, si se cruzaba con un campeon enemigo le hacia un knock up pequeño, y le daba un escudo, ahora solo le da el escudo y corta su trayectoria,  por lo que si queres atravesar un muro y un enemigo se pone contra este, lo unico que conseguis es un escudo :c\nsiempre les cambian algo a los champs, nos guste o no.","replies":[]}]}]}]}]},{"poster":"ChronoGrandpa","date":"2016-02-17T06:05:56.093+0000","up_votes":2,"down_votes":0,"body":"creo que la E de ahri no es una provocacion, sino un \"enamoramiento\", justamente dice en el skill \"Ahri lanza un beso que daña y hechiza al enemigo al que alcance primero, provocando que avance inofensivamente hacia ella.\", obviamente que lo provoca pero no como funcionan los taunts como rammus, shen y galio (si es que no me olvido ninguno)","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T06:15:24.442+0000","up_votes":1,"down_votes":0,"body":"Es lo que quiere hacer Riot precisamente! Convertirlo en un taunt!","replies":[]}]},{"poster":"Dildo de Moria","date":"2016-02-17T06:05:32.231+0000","up_votes":2,"down_votes":0,"body":"Habrá que aguantarselo como todas las cosas, este nerfeo se va a notar mucho contra los counters de Ahri (LeBlanc, Fizz, Diana) y generalmente. Ahri necesitaba un nerfeo, si, pero bajarle el daño creo que la dejaría aún más inútil que si le hacen este cambio, ya que Ahri obtiene su daño gracias al tiempo que la E le da para acertar sus habilidades, sino las acierta es notable su falta de daño, por eso bajárselo sería mucho peor. Me jode que la nerfeen? Si, Ahri es de mis campeones favoritos, y si me molesta, pero habrá que acostumbrarse y tratar de leer con más anticipación los movimientos del enemigo. Saludos! ^^","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T06:21:06.806+0000","up_votes":1,"down_votes":0,"body":"Igual no me molesta rebuscarmelas contra ellos, me molesta que hayan sacado una parte de su jugabilidad...\n\n:(","replies":[]}]},{"poster":"Runth","date":"2016-02-17T19:08:26.305+0000","up_votes":1,"down_votes":0,"body":"aun asi ahri seguira siendo tier gold al q lo domine, sino, veran mancos usando","replies":[]},{"poster":"Neckrof","date":"2016-02-17T13:02:29.540+0000","up_votes":1,"down_votes":0,"body":"Riven\n> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=v7qsfXsE,discussion-id=Y3Ptufcd,comment-id=,timestamp=2016-02-17T05:05:07.933+0000)\n>\n> Pero claro!!!! Dejemos que Riven pueda cancelar animaciones con su Q, que Lee pueda hacer estragos con su kit de habilidades sin ninguna restricci&oacute;n ambos!!\n> \n> \n\nWhat????? Riven esta fuerisima del meta (WINRATE 47.91%), Lee tiene uno de los peores Winrate (45.37%).... que onda tu comentario loco???\n\nSi vas a alegar, alega con más fundamentos que estos, Ahri tiene un Win Rate de 53.32% y no le va a afectar ese nerfeo contra yasuo o un zed (Que son los personajes que más se pickean en Mid)","replies":[{"poster":"Hoseook","date":"2016-02-17T15:22:27.924+0000","up_votes":1,"down_votes":0,"body":"son campeones populares, ergo, mucha gente lo usa y no siempre lo usan \"bien\" eso no quiere decir que necesiten un buff o algo asi","replies":[{"poster":"Neckrof","date":"2016-02-17T15:31:28.106+0000","up_votes":1,"down_votes":0,"body":"No entendiste jajajajajaja.....\n\nLo que digo es que reclama por que van a nerfear la E de Ahri, pero saca de ejemplo personajes que no tienen un buen WinRate y estan lejos de estar fuertes en este meta.\n\nIgual te quiero xD\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T17:23:43.115+0000","up_votes":1,"down_votes":2,"body":"Vos no entendiste nada! Me refiero a la jugabilidad ! No me refiero al equilibrio de los campeones (considero a Riven equilibrada)...\n\nImaginate que Riven deje de cancelar la Q (la cual en realidad es un BUG). O quiten alguna animación de cancelación...\n\nA Ahri no le están nerfeando solamente, le están quitando parte de su capacidad de outplay, parte de su jugabilidad.\n\nEl nerf está apuntado a los main Ahri, a las Ahris normales no les afecta en nada casi...","replies":[{"poster":"Neckrof","date":"2016-02-17T17:40:59.595+0000","up_votes":1,"down_votes":0,"body":"Debería ser al revés, los Main Ahri no deberían tener problemas mientras que los Ahris normales les debería afectar. \n\nEste nerf esta apuntado a que no pueda joder a personajes como Tristana o Corki a los cuales les cortes el casteo de su salto (Es lo que veo y pienso)\n\nEn fin, podríamos discutir toda la tarde pero creo que no llegaríamos a nada, tenemos puntos de vistas diferentes, creo que no estuvo mal ese nerf, creo que solo las ahri ahora tendrán que acostumbrarse a usar la E de mejor manera, por que el efecto sigue y duración sigue siendo el mismo. \n\nY de Riven, siendo BUG o no, Riot nunca lo ha querido solucionar, pero \"cortar la animación\" no les asegura ganar partidas, y queda reflejado en los números (Que es lo que Riot dice que toma en cuenta para buffear o nerfear personajes xD)\n\nSin Ragear, es una discusión en un foro en el cual todos podemos poner nuestros puntos de vista y esta abierto a cualquier jugador de cualquier división.","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T17:58:49.372+0000","up_votes":1,"down_votes":2,"body":"Al revés, una Ahri normal dudo mucho que a Diana, Fizz o a LeBlanc pueda frenarlos...\n\nClaramente los mains se adaptaran pero en cierto modo es una penalización más fuerte a aquellos que si la juegan.\n\nSi querés afectar a las Ahri normales nerfea la velocidad de movimiento de la Q de las cuales no hay una que no abuse de ello. O las skills teledirigidas ya que son bastante fuertes al snowballear.\n\nSe supone que la Q y la E es donde debe estar concentrado todo el daño y las skills aim deberían no reventar.\n\nQuerés hacerla más difícil o que sea más vulnerable, esa no es la forma. \n\nMe hace acordar mucho cuando dieron el tiempo de delay  para volver a la sombra de la R a Zed por ejemplo.\n\nEs una valoración personal, no me agrada cuando restringen mecánicas de un campeón.","replies":[]}]}]},{"poster":"Hoseook","date":"2016-02-17T16:27:59.589+0000","up_votes":1,"down_votes":0,"body":"shit mala mia, sorry\n\ntkm muxo","replies":[{"poster":"Neckrof","date":"2016-02-17T17:31:45.383+0000","up_votes":1,"down_votes":0,"body":"Yo tambien :*","replies":[]}]}]}]},{"poster":"ZyXEL 001","date":"2016-02-17T17:25:55.649+0000","up_votes":1,"down_votes":1,"body":"El win rate no es sinónimo de equilibrio, si ambos estarían arriba del 50% algo mal estaría porque son personajes difíciles de jugar. Aunque a nivel profesional Lee Sin no es para nada débil, eso no lo podés negar.\n\nTe expliqué todo en el otro comentario.","replies":[]}]},{"poster":"Karrie","date":"2016-02-17T12:25:28.016+0000","up_votes":1,"down_votes":0,"body":"¡Cuantas veces la van a nerfear!\nla nerfearon por que paraba la ulti de Sion y de Hecarim\nAhora nuevamente nerf al kiss\nAHRI SE IDENTIFICA POR TENER UNA E ASI DIOS!!!\n\nCLARO NERF AHRI..... VAYAN A NERFEAR A SU JHIN DE PACOTILLA QUE SIEMPRE LO TERMINAN CARREANDO","replies":[]},{"poster":"Maedme","date":"2016-02-17T10:56:19.071+0000","up_votes":1,"down_votes":0,"body":"Tenes razón no es lo mismo que {{champion:98}}  te atraiga siendo tanque (tanque = no te mata de una), que una maga asesina que deletea ({{champion:103}} ) te tenga atraído sin poder hacer nada.","replies":[]},{"poster":"Runth","date":"2016-02-17T07:26:02.834+0000","up_votes":1,"down_votes":0,"body":"ya con eso, no es segura usarla en top","replies":[]},{"poster":"Caipirinhã","date":"2016-02-17T05:09:12.939+0000","up_votes":1,"down_votes":0,"body":"Ahora lucian tambien corta animaciones","replies":[]},{"poster":"ZyXEL 001","date":"2016-02-17T06:22:33.444+0000","up_votes":1,"down_votes":3,"body":"{{champion:39}} {{champion:38}} {{champion:121}} {{champion:103}} {{champion:84}} {{champion:421}} {{champion:143}}\n\nBienvenida Ahri al grupo de los nerfeados (:","replies":[{"poster":"LanaDelReyVEVO","date":"2016-02-17T06:32:35.276+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=v7qsfXsE,discussion-id=Y3Ptufcd,comment-id=0004,timestamp=2016-02-17T06:22:33.444+0000)\n>\n> {{champion:39}} {{champion:38}} {{champion:121}} {{champion:103}} {{champion:84}} {{champion:421}} {{champion:143}}\n> \n> Bienvenida Ahri al grupo de los nerfeados (:\n\nSacando a {{champion:421}}  todos los demás estan bastante bien","replies":[{"poster":"ZyXEL 001","date":"2016-02-17T06:36:39.085+0000","up_votes":1,"down_votes":1,"body":"La idea es todos mostrar todos los que en su momento tuvieron un Ban Hammer como {{champion:2}} \n\nYa se que están bien ._.","replies":[]}]}]}]}