{"poster":"ZyXEL 001","date":"2017-06-02T00:04:39.790+0000","title":"Ahri es una apología al machismo","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":18,"body":"La temática de Ahri es una apología al machismo, sus frases y su comportamiento, ninguna mujer en todo el planeta tierra se comportaría de esa manera...\r\n\r\nElla consigue \"esencias vitales\" de manera muy cuestionable, porqué debemos tener un personaje con una personalidad tan zo*** por no decir otra cosa!\r\n\r\nPorqué no hay un hombre que haga lo mismo que Ahri en el juego? Porqué estamos en un mundo machista!","replies":[{"poster":"Rebkans","date":"2017-06-02T01:07:33.390+0000","up_votes":7,"down_votes":0,"body":"No vengas con esas cosas acá.\n\nPara empezar, ahri es mitad humana y mitad zorra. Si, literalmente es una zorra y no lo digo en el mal sentido. Ella era un animal. \nGracias a la magia adquirio rasgos humanos y utiliza sus encantos para atraer hombres ingenuos. \n¿O me vas a decir que eso no ocurre en la realidad? Hay cientos de mujeres muy bonitas que saben que son hermosas y se aprovechan de eso. ¿O acaso crees que algunas chicas jovenes se juntan con los viejos millonarios por amor?\n\n> ninguna mujer en todo el planeta tierra se comportaría de esa manera...\n\nNo sé en que planeta vivis la verdad, hay mujeres que se comportan asi o peor...\nEn todos lados hay mujeres que usan sus atributos para atraer hombres.\n\n\nAhri es astuta, inteligente y hermosa. Una combinacion que la convierte en algo muy letal y eso no es para nada machista. De hecho, es increible\n\n> Porqué no hay un hombre que haga lo mismo que Ahri en el juego? \n\nNo, no hay un hombre en el LoL que se comporte asi... hay 3:\n\n{{champion:497}} Es practicamente la version masculina de Ahri\n{{champion:44}} Ni hablar del sensual Taric\n{{champion:6}} Es el mejor de todos. Su sensualidad es tan alta que no puede ser comprendida por los simples mortales\n\nAsi, como veras, no hay nada machista en Ahri.","replies":[{"poster":"Amandiwi","date":"2019-06-23T18:33:35.284+0000","up_votes":1,"down_votes":0,"body":"Wow, no sé cómo vine aquí. Pero tengo unas cuantas cosas que decir sobre este post. No estoy de acuerdo con que Ahri sea un campeón directamente machista. Pero de igual manera estoy en desacuerdo con tus comentarios con respecto a su comportamiento; de partida, usar la sensualidad no tiene nada de malo, creo que haber dicho \"hay mujeres que se comportan así o peor\" no estuvo bien, ya que es algo que AMBOS sexos hacen y no tiene nada de malo, la sensualidad viene de la mano con el sexo y eso es IMPORTANTE. La diferencia es que la sociedad les ha enseñado a las mujeres desde que son unas niñas a verse bonitas para los ojos ajenos, antes era directamente para contraer matrimonio y no quedar como \"una solterona\" (despectivamente), hoy; ya no es explícito, pero sigue siendo así. Pero hay que entender y no tachar de feminazis a las mujeres que se sienten ofendidas por personajes así, ya que es justificable. La imagen anatómica de estos personajes (y por favor, no hay excusas) son solo para atraer miradas, desde los inicios de los videojuegos que esto sucede, y en este aspecto se utiliza aquella imagen como \"objeto\" de miradas (de hombres, obvio). Ahora hay personajes como Kayn que hacen exactamente lo mismo pero para atraer otras miradas. Pero por favor entender el disgusto de algunas mujeres que están acostumbradas a sentirse atacadas por el machismo y el prototipo de una mujer bonita y sensual. Un poco tarde al post pero bueno :){{sticker:sg-miss-fortune}}","replies":[]},{"poster":"ZyXEL 001","date":"2017-06-02T11:46:14.201+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Rebkans,realm=LAS,application-id=J8qpiO2I,discussion-id=1j7GqfsN,comment-id=0004,timestamp=2017-06-02T01:07:33.390+0000)\n>\n> No vengas con esas cosas acá.\n\nLos moderadores no dijeron nada al respecto asi que supongo que verás esto seguido, y más si me lo pides así ;)\n\n> Para empezar, ahri es mitad humana y mitad zorra. Si, literalmente es una zorra y no lo digo en el mal sentido. Ella era un animal. \n> Gracias a la magia adquirio rasgos humanos y utiliza sus encantos para atraer hombres ingenuos. \n> ¿O me vas a decir que eso no ocurre en la realidad? Hay cientos de mujeres muy bonitas que saben que son hermosas y se aprovechan de eso. ¿O acaso crees que algunas chicas jovenes se juntan con los viejos millonarios por amor?\n\n\nNo se\n\n> No sé en que planeta vivis la verdad, hay mujeres que se comportan asi o peor...\n> En todos lados hay mujeres que usan sus atributos para atraer hombres.\n> \n> \n> Ahri es astuta, inteligente y hermosa. Una combinacion que la convierte en algo muy letal y eso no es para nada machista. De hecho, es increible\n\nNo se\n \n> No, no hay un hombre en el LoL que se comporte asi... hay 3:\n> \n> {{champion:497}} Es practicamente la version masculina de Ahri\n> {{champion:44}} Ni hablar del sensual Taric\n> {{champion:6}} Es el mejor de todos. Su sensualidad es tan alta que no puede ser comprendida por los simples mortales\n\nNo se\n\nhttps://www.youtube.com/watch?v=AE8QZbgwSbA","replies":[{"poster":"Rebkans","date":"2017-06-02T13:14:07.671+0000","up_votes":1,"down_votes":0,"body":"Y bueno, si queres quedar como la feminazi que no sabe argumentar, es tu problema.\n\n","replies":[]}]}]},{"poster":"stonerock","date":"2017-06-02T00:58:27.901+0000","up_votes":2,"down_votes":1,"body":"Es un juego dios mio, que tan resentido social vas a ser??? relajate un poco y disfruta la vida hermano, que? Ahora que hagan \"linda\" a un campeon es machista? por favor","replies":[]},{"poster":"saikou29","date":"2017-06-02T18:47:12.452+0000","up_votes":1,"down_votes":0,"body":"Riven con la skin de playboy\nNidalee con sus frases, skins y bailes.\nSona y bueno ya sabemos.\nMiss fortune. No hace falta más.\nSi quieres a un feminazi ahí tenes a illaoi, independiente mujer que se carga a cualquiera que le joda los ovarios a fuerza bruta o la bella rek'sai\nEs un juego de fantasía, nadie viene a concientizarse sobre realidades o problemáticas sociales.\nAh y si pensas que no hay mujeres u hombres (sí, hombres) que hagan lo mismo o peor que ahri bueh vivís en una burbuja","replies":[{"poster":"ZyXEL 001","date":"2017-06-05T03:32:23.098+0000","up_votes":1,"down_votes":0,"body":"O sea, que un \"homonazi\" sería un hombre independiente que se carga a quien lo moleste a las piñas? Según tu definición de feminazi.\n\nMamita querida...","replies":[]}]},{"poster":"WhiteMax","date":"2017-06-02T01:37:32.777+0000","up_votes":1,"down_votes":0,"body":"Ahri es una sucubú, se supone que sea asi para atraer hombres, punto.","replies":[{"poster":"saikou29","date":"2017-06-02T18:42:38.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=J8qpiO2I,discussion-id=1j7GqfsN,comment-id=0006,timestamp=2017-06-02T01:37:32.777+0000)\n>\n> Ahri es una sucubú, se supone que sea asi para atraer hombres, punto.\n\nLe cambiaron el lore, pero se entiende tu punto","replies":[]}]},{"poster":"MasterRightClick","date":"2017-06-02T15:57:26.245+0000","up_votes":1,"down_votes":0,"body":"No rompas los huevos man","replies":[]},{"poster":"Eligandini","date":"2017-06-02T00:19:17.753+0000","up_votes":1,"down_votes":0,"body":"No rompamos las bolas en cada apartado de la vida por favor. Yo entiendo que es un tema serio en Argentina, yo cuando pickeo ahri no me dan ganas de matar mujeres, no busquemos problemas donde no los hay.","replies":[{"poster":"ZyXEL 001","date":"2017-06-02T11:51:47.244+0000","up_votes":1,"down_votes":0,"body":"Matar mujeres? Quién escribió eso?","replies":[]}]},{"poster":"UnWe0nCualquiera","date":"2017-06-02T01:21:42.355+0000","up_votes":1,"down_votes":0,"body":"1 de 2, o es un simple troll tratando de llamar la atención haciendo una parodia de las \"feminazis\" o de verdad est@ tip@ esta loc@ o desesperadamente solo (digo, quejarse en un foro sobre un personaje ficticio en base a un tema \"polemico\" para llamar la atención, no es como que de la impresión de no necesitar para nada atención)","replies":[]},{"poster":"Yoen","date":"2017-06-02T00:49:24.618+0000","up_votes":1,"down_votes":0,"body":"Antes que nada, esto es _**un juego**_, de **fantasía** o un\nmundo creado por rito.\nPor ello no significa que **_se asemeje totalmente a la realidad _**y por \neso pueden haber personajes extraterrestres aludiendo a la \n\"_ufología_\", disfraces de animales, aludiendo a los \"_defensores de los\nanimales_\", personajes  con tales atributos, aludiendo al \"_sexismo_\".\n\n**_Pero esta alusión es responsabilidad de cada uno_**.\nEntonces cualquier persona puede interpretar las cosas y personajes\ndel juego a su modo de ver y tendrá que hacerse cargo de sus pensamientos.\n\nChicos no confundan las cosas, _es un juego_. El que existan personajes\ncon estilos y esas cosas, como las skins y temáticas, están basadas\nen lo popular.\nLo popular, cosas populares y la moda, son forjados por nosotros y por\neso rito como empresa, sacará beneficio de eso. \nNadie está obligado a seguir lo popular y también pueden seguirla,\nsegún sea el caso.\n\nSi no les gusta el campeón o el juego por su temática, simplemente\nno lo jueguen, hay muchos títulos por jugar.\n\n\nSuerte","replies":[]},{"poster":"KSM Masi","date":"2017-06-02T00:14:26.179+0000","up_votes":1,"down_votes":0,"body":"Bueno vas a buscar todo lo machista en el juego ? No es el primer comentario que haces sobre \"machismo\" dentro del juego. Por cierto si genera sensualidad un champ femenino a algún player estamos jodidos.","replies":[]}]}