{"poster":"Nightsoul","date":"2017-12-06T14:09:52.109+0000","title":"Aery o Cometa Arcano","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"Hola, como maineo magos e tenido esta duda, se que aery es da&ntilde;o seguro y el cometa arcano con slow o cc  es de ayuda pero . cual escala mejor? cual es mejor en early, soy main swain y e usado hasta ahora el cometa arcano y me rendido mucho pero quiero saber si me pierdo de un potencial mayor con aery.","replies":[{"poster":"Nightsoul","date":"2017-12-06T18:01:51.252+0000","up_votes":1,"down_votes":0,"body":"muchas gracias por los comentarios , pero luego de leerlos y ver algunas estadisticas con swain opte por el cometa,  razon simple, es ceirto que se spamea mas pero swain no cuent aocn un cooldown muy elevado, meter el cometa no es didficil con swain dado a un slow de gran area y rango y su w. Pero teniendo en cuenta lo qu dijeron el swain mid es mejor comet apero sin embargo en top la cosa cambia y es ahi donde elaery saca mas provecho dado que fastidiar tanques es lo que hace swain en top asi que ahora se que hacer con el campeon en cada linea. \ngracias poir la ayuda.","replies":[]},{"poster":"Este NoEs Suareh","date":"2017-12-06T16:16:44.092+0000","up_votes":1,"down_votes":0,"body":"La runa depende de como vayas a jugar el campeón, si me decís que vas a jugar full poke en lane a cada rato hostigando te pones Aery porque se spamea muy facil. Si queres hacer tradeos relativamente cortos pero sin estar pokeando constantemente, aprovechas tu slow de la Q y tu CC de la E para poder acertar el cometa arcano que hace mas daño  en ese tradeo.","replies":[]},{"poster":"Yuzko","date":"2017-12-06T16:02:52.521+0000","up_votes":1,"down_votes":0,"body":"tecnicamente con aery en toda la partida haces mas daño (sobretodo en early puesto que el cometa tiene mucho cd ademas que es dodgeable) si bien aery pega menos la cantidad de veces que lo activas hace que al final termines haciendo mas daño a la larga.. ahora si el cometa arcano en late tiene muy poco cd ademas que se reduce su cd dependiendo de como pegues tu habilidad.. en mi opinion depende del campeon. por ej a swain yo le pondria aery el cometa es dodgeable .. si te pones a pensar ponelo asi 2 aery =1 cometa pero el cometa tiene el % de fallar y en lo que tiras 4 aery puedes meter 1 cometa y swain no lo probe pero debe ser re molesto con el anillo de flujo y la runa que te hace tirar skills free asi que mas razon para llevar aery.. ahora el cometa hablando de otros campeones en los que cueste algo meter las skills onda xerath puede llegar a ser. En fin en mi opinion usa aery puesto que la mayor parte de las partidas terminan en early o mid game y no llegan al late donde el cometa es muy molesto","replies":[]},{"poster":"M4RT0","date":"2017-12-06T15:00:49.173+0000","up_votes":1,"down_votes":0,"body":"No soy main Swain ni nada por el estilo, pero estuve jugando ese campeón en top con las nuevas runas y considero como la mejor opción a \"Aumento Glacial\" y de segunda rama la de Brujería para conseguir los 28 de ap, combinando las runas secundarias con tu preferencia. Y la verdad me da buenisimos resultados ya que el inicias con el slow del básico y te ayuda a acertar tu w ( que considero difcil de acertar xD ) y asi meter todo tu combo y realizar un daño absurdo. Además priorizo el GLP para que la activa realice una zona de slow y te ayude incluso más y mejore tus aportes en las tf.\nEspero que te sirva :D","replies":[{"poster":"Nightsoul","date":"2017-12-06T15:47:55.856+0000","up_votes":1,"down_votes":0,"body":"si es muy cierto aportas una utilidad impresionante, lo probe, pero tu escalado cae muchisimo basicamente serias un suport, con esa runa, de hecho el swain con utilidad usa la runa de movimiento de brujeria, que otra variante,  pero si como tu dices en top sobre todo con tanques al sacarle movilidad tu sales ganando.","replies":[]}]},{"poster":"Charlôtte","date":"2017-12-06T14:15:39.442+0000","up_votes":1,"down_votes":0,"body":"Con campeones como Orianna podés usar aery, incluso suponiendo que tiene algún stun básico, porque tanto la W como la E envían a aery a tus aliados, dandoles un pequeño escudo. \nFuera de eso, creo que el cometa siempre viene mejor para todos los demás. Hasta a Miss se la usa con cometa.","replies":[{"poster":"Not Personal","date":"2017-12-06T15:08:39.225+0000","up_votes":1,"down_votes":0,"body":"Yo a miss la uso con aery, por la constancia con la que spameo la q o los basicos. Para mi va mas por ese lado, si tenes un champ que spamea habilidades cada 10 segundos te conviene el cometa, con zoe por ejemplo que tira cada 4 segundos una q creo que es mejor el aery.","replies":[]}]},{"poster":"SKT T1 Bank","date":"2017-12-06T14:19:55.501+0000","up_votes":1,"down_votes":0,"body":"En cuanto a escalado no se, porque no los uso mucho, pero lo que si se es que con swain te conviene cometa, porque como adc, se que si me acertas la habilidad de snare automaticamente me golpea el cometa y no puedo evitarlo, en el caso de magos de slow si es mas claro que va a pegar, pero en el caso de magos de burst su delay no es lo mejor. Ademas si tengo un adc movil te puedo evitar el cometa.","replies":[]}]}