{"poster":"Dresvyanin","date":"2015-04-08T10:58:53.639+0000","title":"Frissítések","up_votes":1,"down_votes":0,"body":"Halih&oacute;!\n\n&Eacute;n &eacute;rtem, hogy sz&uuml;ks&eacute;gesek a friss&iacute;t&eacute;sek meg minden, de nem lehetne mondjuk &uacute;gy megcsin&aacute;lni, hogy a klienst rendberakni előbb, mert az im&eacute;nt &eacute;pp befagyott az eg&eacute;sz kliens &uacute;gy ahogy van, majd mire siker&uuml;lt egy&aacute;ltal&aacute;n kil&eacute;pnem, addigra bedobott egy f&eacute;l pilanatra hősv&aacute;laszt&aacute;sra. Mire visszal&eacute;ptem, b&uuml;ntet&eacute;s v&aacute;rt mert elhagytam a j&aacute;t&eacute;kot hősv&aacute;laszt&aacute;s k&ouml;zben...amiből f&eacute;l m&aacute;sodpercet l&aacute;ttam mert 2 percig az eg&eacute;sz kliens full feh&eacute;r volt.. \n\n&Eacute;s ez csak az aktu&aacute;lis probl&eacute;m&aacute;m..arr&oacute;l nem besz&eacute;lve, hogy nagyj&aacute;b&oacute;l 2 - 3 h&oacute;napja j&aacute;tsza azt a kliens, hogy friss&iacute;t&eacute;skor behal 1-2 alkalommal mire egy&aacute;ltal&aacute;n v&eacute;gig megy a friss&iacute;t&eacute;s.\n\nÉs ehhez hozzájönnek azok a hibák, hogy pl minden második meccsem során a teleport nem működik mert rányomok a kistérképen a toronyra és nem teleportál hanem a villanásnyi időre látom a tornyot a képernyőn valamint ugyan így nem működik néha egy két ellenfélre célozható támadás se. \n\nA képen látható a hiba... semmi se történik, tölt, fehér keret jelenik meg a kliensen és kész...","replies":[{"poster":"Mind The Gap","date":"2015-04-09T19:42:26.816+0000","title":null,"up_votes":2,"down_votes":0,"body":"Mivel rettentő sok bug van a játékban, amelyek csak arra várnak, hogy kijavítsák őket, addig a klienshez nem nyúlnak komolyabban. Bizonyára a kliens akár tele lehet fölösleges scriptekkel, jobban mondva kitörölt funkciókkal, amelyek valamelyest csökkenthetik a teljesítményt. A Riotnak sem nyúlik mindenhova el a keze; lehetséges az is, hogy a program, amellyel elkészítik a LoL klienst, azzal már nem lehet több gondot megoldani. Lassan a LoLnak - mint minden számítógépes játéknak - nagyobb teljesítményigénye lesz. Tele van hangfájlokkal, kódsorokkal, hálózati kapcsolattal. Szerintem ez a legkisebb probléma, de egyelőre a kliens optimalizálást szerintem nem most fogják elkezdeni.\nLehetséges a szerver hiba is, mivel szinte nap, mint nap támadják a Riot szervereit különféle hackek, többek közt RP hackek. Igaz, minél több támogatás érkezne a Riothoz, annál jobb szervergépei lehetnének. Na de nézzük csak, mennyiféle dolgot kell fenntartania a Riotnak, hogy lássátok, még a mostani RP jövedelmek sem elegek:\n-Weboldal domain;\n-Áramfogyasztás;\n-Szervergépek fenntartása, karbantartatása;\n-A Riotnál dolgozó emberek megfizetése;\n-Mint minden munkahelyen, a Riotnál is van víz;\n-Zenészek fizetése;\n-Hősönkénti szinkronszínésznek fizetni, akárhányszor adnak új championt.\n\nKorábban én is kirageltem azon, hogy a Riot így,  a Riot úgy, de nem oldja meg a problémát. Egyelőre ez van, de észben kell tartanunk, hogy nem csak az ÉLŐ szervereket kezeli a Riot, hanem a PBE-t is, amelyre nap, mint nap adnak frissítéseket.\nAmiben nem lenne igazam, jelezzétek, hogy kijavítsam.","replies":[{"poster":"Dresvyanin","date":"2015-04-14T05:50:40.295+0000","title":null,"up_votes":1,"down_votes":0,"body":"1. én nem a Riot-ot magát szidom\n2. szerintem más is fel lenne háborodva ha azért kap büntetést mert a legutóbbi frissítés óta minden első meccskeresésnél nem dob be hősválasztásra elfogadás után, hanem befagy és ha mázlim van akkor úgy rak be nagy nehezen hogy marad 4 másodpercem hőst választani...és ez még a jobbik eset..mert legelőször egyáltalán nem lépett be időben és kaptam a büntetést..\n3. én azt is megértem hogy mindennel ők sem tudnak foglalkozni egyszerre, DE akkor talán fontossági sorrendet kéne felállítani..nem a skinek, hősök frissítései meg egyéb harmadrangú dolgoknak kéne az elsőnek lennie hanem a problémák mihamarabbi megoldásának.\n\nÉs utólag megjegyezném, hogy az is vicces hogy beteszik a frissítést és kinyomják mellé az értesítést, hogy a frissítés közben előfordulnak problémák, de dolgoznak rajta ^^","replies":[{"poster":"Mind The Gap","date":"2015-04-14T07:05:36.111+0000","title":null,"up_votes":1,"down_votes":0,"body":"Próbálják is kijavítani, de akkor ritkábban jelennének meg skinek és hősök, hiszen annyi bug van a játékban, hogyha azokkal foglalkoznának, csak akadályoznák a játékfejlesztés haladását, és nem sikerül időben kiadni a frissítéseket. Tenném hozzá: én is voltam ideges emiatt, de nyílván, ha emiatt low priority-re kerülnék (szerencsére soha nem volt nálam ilyen), akkor írnék a supportnak.","replies":[]}]}]},{"poster":"M4dr4c","date":"2015-04-08T11:11:51.078+0000","title":null,"up_votes":1,"down_votes":0,"body":"De azt ugye tudod, hogy frissítések nélkül meg nem lehet rendbe rakni a klienst? :D Ördögi kör amivel nem nagyon lehet mit kezdeni. Amúgy szerintem a problémák jó része szerver gond és nem kliens gond.","replies":[{"poster":"Shikaichi","date":"2015-04-08T11:16:09.831+0000","title":null,"up_votes":2,"down_votes":0,"body":"Azt mondják, hogy ez a frissítés probléma csak az EUNE szerveren van, meg a magyarnál. Ha már átváltod angolra, akkor is működik rendesen. Én mondjuk sosem próbáltam, mert általában lefut az után, hogy egyszer újraindítom. Ha lassú is, nem érdekel, úgy sem akarok egyből játszani, hagyom a háttérben, hadd fusson. :)","replies":[]}]},{"poster":"Enforc3r","date":"2015-04-08T15:49:28.553+0000","title":null,"up_votes":1,"down_votes":0,"body":"A teleportos gond most nálam is van, elég idegesítő... Azért az MK-LOL virít a háttérben xD","replies":[{"poster":"Dresvyanin","date":"2015-04-14T05:42:55.375+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen virít XD Amúgy azzal is vannak gondok amióta megjött ez az új frissítés mert például nem enged játék közben skint választani mert amint egy csapattárs hőst választ úgy érzékeli mintha én választottam volna másikat és azonnal átugrik skinválasztás közben arra a hősre.","replies":[]}]},{"poster":"JustARaver","date":"2015-04-09T15:18:14.548+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az mind szép és jó, hogy új kinézetek meg hasonlók jönnek, de az, hogy a klienset rendbe hozni, na az már nem megy. Az 5.7-es frissítés bejövetele óta, még a hősválasztóva se dob be, vagy ha mégis, akkor ismeretlen hiba... és még én kapom a büntetést, mert a kliens sz*r...{{item:3070}}","replies":[]}]}