{"poster":"notvert","date":"2014-08-05T18:53:55.552+0000","title":"Riot Games Summer Intern Q&A","subforum":"[ARCHIVED] Miscellaneous","up_votes":28,"down_votes":0,"body":"We have twelve current Riot interns who are going to answer questions about their internship experience this summer. If you have a question about a specific area in Riot, you can direct the questions to the intern listed below.\n\n* Riot Koins, Network Operations\n* Riot Usher Voice, Project Management\n* NevermoreMB, Project Management\n* Riot Eh, QA\n* Riot Buck, Insights\n* Riot FeelsU, Engineering\n* Riot Brick Fort, Esports\n* Riot Katana, Esports\n* Riot Shao, Engineering\n* Riot Sherman505, North American Programs\n* CroissantCat, Regional Publishing\n* Nivyx, Publishing LATAM\n\nEveryone is standing by for your questions over the next two hours. Have a question about what it's like to be an intern at Riot? Ask them now!\n\nThanks!\n\nTo continue the conversation, we launched our [Official 2015 NA Summer Internship Thread](https://www.linkedin.com/groups/Official-2015-NA-Summer-Internship-3544410.S.5902565028451598336) on LinkedIn.","replies":[{"poster":"FlamingSnot","date":"2014-08-05T19:39:59.218+0000","up_votes":2,"down_votes":2,"body":"How hard would it be/ long would it take to give blitz an open hard when he shoots his Q? {{champion:53}} {{champion:53}} {{champion:53}}","replies":[{"poster":"R Buck","date":"2014-08-05T19:51:38.165+0000","up_votes":29,"down_votes":0,"body":"Common misconception - Blitzcrank's Q is not a grab, it is actually a long-ranged fistbump. When an enemy is touched by the fistbump, the power of friendship compels them to go give Blitzcrank a big hug.\n\nAt this point he generally punches them in the face.","replies":[{"poster":"Riot Nitsuabo","date":"2014-08-07T19:23:31.410+0000","up_votes":5,"down_votes":0,"body":"/thread","replies":[]}]}]},{"poster":"MrBuffington","date":"2014-08-05T19:06:05.887+0000","up_votes":7,"down_votes":0,"body":"Can you describe a typical day in your area? Thanks!","replies":[{"poster":"R Buck","date":"2014-08-05T19:15:05.143+0000","up_votes":7,"down_votes":0,"body":"Wake up at ~10am, head down to the office at around 11am, and then go to meetings and program for the next eight hours. By around 8pm I'm generally just playing League at the office, and I head home around 11pm.","replies":[{"poster":"Riot Koins","date":"2014-08-05T19:21:19.386+0000","up_votes":20,"down_votes":0,"body":"He doesn't wake up at 10, that's a lie","replies":[{"poster":"Brick Fort","date":"2014-08-05T19:22:32.943+0000","up_votes":16,"down_votes":0,"body":"Can confirm, are roomates.","replies":[]},{"poster":"Shaodow","date":"2014-08-05T19:22:30.592+0000","up_votes":11,"down_votes":1,"body":"shots fired from the roommate","replies":[]},{"poster":"Sherman","date":"2014-08-05T20:18:10.713+0000","up_votes":8,"down_votes":0,"body":"Whoa whoa whoa, I actually share a room with him.  Can confirm, wakes up at 10! Doesn't move until 11 though...","replies":[{"poster":"Riot Koins","date":"2014-08-05T20:25:26.726+0000","up_votes":7,"down_votes":0,"body":"This is a conspiracy!  When it comes down to it though, have you *really* woken up if you haven't moved?  :P","replies":[]}]}]}]},{"poster":"Aboot","date":"2014-08-05T19:17:31.173+0000","up_votes":7,"down_votes":0,"body":"I usually get in around 10 and get started on whatever work I have for that week. Then around 12 we usually go grab lunch at either the food trucks around or grab some food at the food court and bring it back to my desk. Then I'll get back to meetings and work. If I have some time, I'll play a game or two during the day. After dinner, I play a couple games of League, then try to grab some friends to play Avalon or Werewolf.","replies":[]},{"poster":"Shaodow","date":"2014-08-05T19:15:44.856+0000","up_votes":4,"down_votes":0,"body":"Engineering has a pretty typical day, but it really depends on where the meetings are scheduled.\n\n10AM - standup - so I usually get in around 9:30am - 9:45am, depending on when I wake up.\n11AM - self-backlog-sorting-out-stuff / emails from yesterday I didn't get to\n12PM - lunch\n1pm - 6pm - lots and lots of code. and meetings. but mostly code.\n\nAfter work, I tend to just chill at the office and duo with some other Rioters, or just grind soloQ for them LP.","replies":[]},{"poster":"Brick Fort","date":"2014-08-05T19:11:40.059+0000","up_votes":4,"down_votes":0,"body":"As a web developer in Esports, this is how my day goes:\n\nI usually get into work around 9:30/10 AM and get started either wrapping up the prior day's work or starting on my tasks for the day. My team has \"standup\", which is a short standing meeting where we cover all the work we did yesterday and what we'll do today, and then we grab some lunch. The afternoon might be uninterrupted coding, or it could be peppered with a meeting or two. I usually wrap up work around 7/8PM depending on if I've got to nail down that last bug or if everything's in a good place. Then it's time to play some ARAMs with the team or grind out some solo queue games. Of course, sometimes you get drawn into something fun like an all Esports 5s game. Nothing quite like dunking Nick Allen :)","replies":[]}]},{"poster":"PepitasNestle","date":"2014-08-05T19:26:18.416+0000","up_votes":3,"down_votes":0,"body":"How was it dealing with presumably your first NDA? How many friends asked about game secrets?","replies":[{"poster":"CroissantCat","date":"2014-08-05T19:30:22.605+0000","up_votes":18,"down_votes":0,"body":"What NDA? Here's the next champion. http://i.imgur.com/5WEieKe.jpg","replies":[{"poster":"PepitasNestle","date":"2014-08-05T19:36:12.458+0000","up_votes":5,"down_votes":0,"body":"He looks so OP. I'm sure his bindings are more deadly than Morg's.","replies":[{"poster":"CroissantCat","date":"2014-08-05T19:41:33.516+0000","up_votes":8,"down_votes":0,"body":"His taunt will actually be global. Every time you taunt, it will echo throughout all the games of LoL.","replies":[{"poster":"PepitasNestle","date":"2014-08-05T20:12:42.968+0000","up_votes":9,"down_votes":0,"body":"\"It looks like you could use some help!\"","replies":[]}]}]}]},{"poster":"BestIntentionsNA","date":"2014-08-05T19:27:50.765+0000","up_votes":8,"down_votes":0,"body":"My previous internship required that I get a top secret clearance from the Department of Defense, so by this point my friends are used to the \"I can't talk about my work\" routine.","replies":[{"poster":"CroissantCat","date":"2014-08-05T20:32:29.617+0000","up_votes":7,"down_votes":0,"body":"# #humblebrag <3","replies":[]}]}]},{"poster":"Emily Zhang","date":"2014-08-05T19:16:14.858+0000","up_votes":7,"down_votes":1,"body":"Riot Usher Voice,\n\n\nWhat's it like to be the prettiest Riot Intern at Riot HQ?","replies":[{"poster":"CroissantCat","date":"2014-08-05T19:19:03.526+0000","up_votes":14,"down_votes":0,"body":"I thought I was the prettiest intern :(","replies":[{"poster":"usher voice","date":"2014-08-05T19:27:51.928+0000","up_votes":10,"down_votes":0,"body":"^ This is true.","replies":[]}]}]},{"poster":"Infero","date":"2014-08-05T19:13:54.864+0000","up_votes":5,"down_votes":0,"body":"@ Riot Buck: \nWhat is your background going into Insights and how has that benefited you @ Riot?","replies":[{"poster":"CroissantCat","date":"2014-08-05T19:15:41.621+0000","up_votes":14,"down_votes":1,"body":"Riot Buck uses it unfairly to win bets and has already robbed me of $15.","replies":[{"poster":"R Buck","date":"2014-08-05T20:46:03.247+0000","up_votes":10,"down_votes":0,"body":"never bet against an analyst","replies":[]}]},{"poster":"R Buck","date":"2014-08-05T19:20:04.493+0000","up_votes":8,"down_votes":0,"body":"I'm an undergraduate at Carnegie Mellon University, studying Computer Science. I've done a lot of independent research projects (science fair-type stuff) on machine learning and NLP in the past, and taken classes on it. It's been pretty essential to my work here - it's important to be able to understand what people are talking about when they start name-dropping algorithms, and to understand the tradeoffs of each. I've also been programming for seven years now, which means I have enough general computer knowledge to implement stuff.","replies":[{"poster":"Drunk Old Man","date":"2014-08-05T19:40:54.264+0000","up_votes":1,"down_votes":0,"body":"I've been messing with programming since I was around 8 years old, playing with things like BASIC and PHP (I'm 22 now) How would you describe Riot as an employer for programmers? \n\nI've fiddled with the idea of trying to apply for a job there since I started playing League way back when, but the unfortunate part is that I spent the first 7 years of my childhood in a small part of a smaller town, so I didn't get to go to school (no grade school, middle school, or even high school). While we did buy books, I ended up not learning grammar correctly until I was 12 years old, where I taught myself by sitting in an IRC chat for programmers (they were really nice fellas). I spent a lot of time working on cars from 14-19, and actually hurt my wrist to the point where I couldn't hand-write anymore when I was around 15. After that, I figured that it was easier to write with a keyboard, and spent a lot of time playing with languages like PHP, Python, Perl, C#, and such, and grew to love programming. While I haven't done anything amazing, I've written private servers for games like Conquer Online, made various chat servers/bots for a community I hung out in, and basically anything I thought would be fun. But, long story short, I just want to know if a company like Riot would suit someone like me. I'm weighing my options of whether to go to trade school, or to go get my GED and try and go to college for programming. I'm just a pretty indecisive person.","replies":[{"poster":"comfybunny","date":"2014-08-05T19:47:51.729+0000","up_votes":1,"down_votes":0,"body":"IM INDECISIVE TOO! :D That's so awesome I'm pretty sure you have to be enrolled in school to intern for them though :X I think for programming/ software engineering school isn't as important as what you are capable of producing. I think school for me right now is like fancy papers of merit that will help your career someday down the path when you advance.","replies":[{"poster":"Drunk Old Man","date":"2014-08-05T19:54:50.036+0000","up_votes":4,"down_votes":0,"body":"Right, most programming jobs ask for a degree or \"equivalent experience\", and they will likely give you a test to see if you have it. Unfortunately, where I live in California, there's not a whole lot of those jobs. I'm still looking though!\n\nYou're right about the intern part, by the way. You can't intern unless you're a student.","replies":[]}]}]}]}]},{"poster":"Shoken","date":"2014-08-05T19:37:50.858+0000","up_votes":3,"down_votes":0,"body":"I'd really, really, really like to join riot in the future\ni'm still in high school tho (almost finished!)\n\nI want to go for informatic engineering at university... Is there a chance i can enter if i do that or should i aim at other majors?","replies":[{"poster":"Riot Eggo McLego","date":"2014-08-05T19:41:30.990+0000","up_votes":9,"down_votes":0,"body":"There are people with really diverse fields of study here! Riot cares more about what you know and what you can do than what you've studied.  The other esports intern last year with me (who is now full time after graduating) studied Philosophy.  I'm studying English and Economics.  If you want to work in a more technical field then that will certainly help you, but never feel limited by what you've chosen.","replies":[{"poster":"Shoken","date":"2014-08-05T19:45:37.466+0000","up_votes":5,"down_votes":0,"body":"Thank you for the answer. That actually... reassured me a lot. :D","replies":[{"poster":"Riot Eggo McLego","date":"2014-08-05T19:48:40.071+0000","up_votes":5,"down_votes":0,"body":"No problem! As I mentioned in another comment, I think the most important thing is building up your skills and experience.  Whether you want to work at Riot or another game company,  you're fortunate enough to know what your passion is very early! Use this extra time to learn to make games if that's what you're interested in, or write about them, or help manage communities even if it's on a volunteer basis.  Before getting an internship here, I was volunteering for several LoL websites and getting experience that really helped me out.","replies":[]}]}]},{"poster":"CroissantCat","date":"2014-08-05T19:46:20.691+0000","up_votes":4,"down_votes":0,"body":"Hey WaffleBit!\n\nI wouldn't worry too much about what your major is :P I'm a biology/political science double major, which is something you wouldn't necessarily associate with LoL. As long as your passionate about League and what you do, your major is only a secondary concern. That being said, if you want to get into the engineering or art teams, it's best to have the knowledge to be able to bring value to those teams. As part of the regional ambassador team, there's a larger emphasis on soft skills such as people and time management and organization that you can't necessarily be taught in a major.","replies":[{"poster":"Shoken","date":"2014-08-05T19:59:43.685+0000","up_votes":5,"down_votes":0,"body":"Thank you for the advice! :D This Q & A is great","replies":[]}]}]},{"poster":"comfybunny","date":"2014-08-05T19:50:43.020+0000","up_votes":3,"down_votes":0,"body":"From my POV, Riot seems more like a startup culture than a corporate environment (suit, tie, meetings). Can someone talk about the pros and cons of working at Riot verses a larger corporation? How much overhead is involved when starting a project? (licensing, rules and regulations, etc). Do you think Riot will be there for you ten years from now? Do you see yourself making a career in Riot as opposed to a stepping stone in your career?","replies":[{"poster":"Riot Eggo McLego","date":"2014-08-05T20:00:04.089+0000","up_votes":7,"down_votes":0,"body":"I think that right now, Riot is somewhere in between start up and corporate culture, but I don't see it ever become a suit and tie sort of workplace.  Because there's not as much pressure today as a game company faces in its infancy, it means that we can spend more time and resources putting out an ultimately better product - this is what I think separates us from a start up where everyone is burning the midnight oil to get something out no matter what it looks like.\n\nThat being said, it still maintains some of the best parts of a start up in my opinion.  If you absolutely want to make a project happen and it's in line with what Riot wants to accomplish for players, you can do that. There's a lot of freedom to do what you love.  There is some red tape, which is meant to make sure that Riot maintains a high quality bar, but that shouldn't stop you from making anything, just maybe push you to improve upon it.\n\nI think that Riot will be around for a long time and I also think that it's a place I want to work for as long as I can.  It's hard to imagine working somewhere with better company culture and there's no way that I could pursue my passions elsewhere in the same way.","replies":[]},{"poster":"Nivyx","date":"2014-08-05T20:04:31.593+0000","up_votes":6,"down_votes":0,"body":"> From my POV, Riot seems more like a startup culture than a corporate environment (suit, tie, meetings). Can someone talk about the pros and cons of working at Riot verses a larger corporation?\n\nYou're right, the culture here is much more like a startup than a settled corporate setting. We do still have meetings, of course, because communication matters, but suits are an endangered species around here. ;-)\n\nThe pros of this are pretty obvious, right? The work is flexible, interesting, and fast-paced. You can wear your real clothes to work. The people are awesome, and super easy to work with. If this is the environment for you, its total heaven. \n\nThe cons (to my eye) are that if you like to know your EXACT role and be able to disappear into a dark room and come out weeks later with a completed project, this is not for you. Projects evolve quickly, and being able to be part of a team is as important in some cases as the hard skills. People skills matter when the organization is more flat in its power dynamics (Riot is much more flat than any other company I've worked for-- I have as much say in team meetings as my manager, if the topic is something I have experience with). Also, its easy to bite off more than you can chew, because if you say you can do something, you will be trusted to get it done.","replies":[]},{"poster":"Riot Koins","date":"2014-08-05T19:58:20.190+0000","up_votes":4,"down_votes":0,"body":"I think you're spot on with the startup culture; I wear jeans (or shorts) and a t-shirt to work every day.  I like this feel because it fosters growth and innovation.  You basically get to work on whatever you want, as long as you can convince people that it is valuable to players (we're all players too remember!).    It can be tricky to start new projects though, because everyone is so excited about what they are currently working on, that pulling them away is difficult.\n\nAs for the second part of your question, I really hope Riot will be here 10 years from now.  I have no business knowledge, but I believe they can do it.  I've already accepted a full time position elsewhere, but I've told my  managers that I would love to return to Riot in the future.  Its too much fun to not want to come back!","replies":[{"poster":"comfybunny","date":"2014-08-05T20:05:44.404+0000","up_votes":3,"down_votes":0,"body":"What made you accept a full-time position elsewhere? What is the structure of Riot like regarding promotions and management? What opportunities of growth and mobility are within Riot?","replies":[{"poster":"Riot Koins","date":"2014-08-05T20:12:55.682+0000","up_votes":5,"down_votes":0,"body":"I chose an offer elsewhere because I felt as though it was an opportunity that will open doors for me now, and wherever I may choose to go after.  I've talked with my managers here, and basically, if I hate it, I can always re-apply here.  I really love it here, and hate to be going somewhere else, but if things go poorly, hopefully I can come back =)\n\nAs far as promotions go, I'm not too sure.  I'm sorta familiar with the intern->full time process, but after that I wouldn't really know.  Mobility here is very flexible.  If you can prove that you provide value to another team, and can demonstrate your passion, you'll have no trouble moving around!","replies":[]}]}]}]},{"poster":"Ethoras","date":"2014-08-05T20:10:31.196+0000","up_votes":4,"down_votes":0,"body":"Riot Eh (love your name lmao.), what do you do as a QA? :3.\n\nAlso, [this question is for every intern!] I'm heading to college this year and wanted to apply to become an intern at Riot. What should I do to be successful in getting an internship?\nDo I have to prove my League skills O_O; Haha. \nJoking aside, I'm really interested!","replies":[{"poster":"Aboot","date":"2014-08-05T20:38:45.712+0000","up_votes":6,"down_votes":0,"body":"There's actually two types of QA here, QA Tools and Automation (which is the team I'm on) and embedded QA. Embedded QA is pretty much what it sounds like, we have QA people spread throughout the teams here. So instead of just having a QA team that helps the engineers, we have those QA people directly on the team so they can work with the engineers as they go, which allows the QA to just turn to the guy next to him to talk about what is wrong with a build. \n\nQA Tools and Automation, on the other hand, is it's own team. We work on internal tools that help ease the engineer's jobs. We do sometimes write tests, but most of the time we're developing the tools to help give the engineers a sense of how the builds are doing or an easier way to write tests for the things they are working on. We're focused on helping the engineers create better code and giving them the tools necessary to do that.\n\nHope that answers your question! Let me know if you want there is anything you want to know in greater detail.","replies":[]}]},{"poster":"PepitasNestle","date":"2014-08-05T19:38:44.254+0000","up_votes":4,"down_votes":0,"body":"@Riot Katana:\nYou are one of the repeat offenders on the list. How did it feel being one of the senior interns this time around? Did you dispense your infinite wisdom to the other interns?","replies":[{"poster":"Riot Eggo McLego","date":"2014-08-05T19:45:36.580+0000","up_votes":6,"down_votes":0,"body":"I like the repeat offender classification. Being an intern for the second time is nice because it makes adjustments much easier. I felt like I grew so much professionally and personally last year, so I was able to hit the ground running this year. \n\nI'm pretty sure I don't have any kind of special wisdom that I could impart on anyone, but I did give this advice to anyone who asked me how to adjust to Riot: talk to as many people as you can.  Networking at Riot is incredibly easy as everyone is very willing to talk, teach, and work together.  It's also very important if you want to branch out and diversify your work load. I've been lucky enough to help out basically every sub team in esports and even other teams at Riot, so I've gotten a really good bearing on what I most enjoy working on and where my strengths and weaknesses are.  There are always exciting things and people around Riot and getting to know other Rioters is the best way to find your niche.","replies":[]}]},{"poster":"Shel Silverstein","date":"2014-08-07T22:10:42.879+0000","up_votes":1,"down_votes":0,"body":"Out of everyone at Riot, Who do you think is the better singer? @Riot  {{summoner:12}} to base.","replies":[{"poster":"Riot Koins","date":"2014-08-07T22:18:56.857+0000","up_votes":5,"down_votes":0,"body":"An intern comes to mind, none more lyrically inclined, he's the best not by luck, he's the rapper Riot Buck","replies":[]}]},{"poster":"cindobeast","date":"2014-08-05T20:12:06.846+0000","up_votes":2,"down_votes":0,"body":"How far does everyone commute? \n\nI'm moving to San Diego next year and would love to work at Riot but I want to know if 3 hour commutes are a thing","replies":[{"poster":"Riot FeelsU","date":"2014-08-05T20:17:30.031+0000","up_votes":5,"down_votes":0,"body":"This summer Riot has provided most interns with a housing option just a few minutes walk from the office.","replies":[]}]}]}