{"poster":"Broken Scripts","date":"2019-11-24T07:15:45.088+0000","title":"This season is honestly doomed already","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"I don’t know where to even begin with the absolute tragedy that is season 10. It’s already so messy, so scattered that no matter what direction and topic I start at, I’m bound to hit something that needs to be tweaked or something that’s stupidly broken and needless.\r\n\r\nIt’s no secret that I mained support in season 9 – mainly to prove that it’s possible to carry 1v9 as a support in SoloQ (No DuoQ abusing, which also needs to be fixed) – so, that’s where I’ll start.\r\n\r\nBot lane has lost all identity and become such an unfun and pointless lane that it feels like it’s becoming the next top lane. ADC is still based around Kai’Sa and Xayah, support has been cut down and now only 20% of supports are actually viable in the sense of the game and how it plays. I can see the return of mage supports because no one needs or wants traditional supports. If your champ isn’t doing damage, you’re not worthy. If you have no tools to empower and literally carry Kai’Sa or Xayah, you’re useless.\r\n\r\nBut that’s not even all of it, as this was mostly season 9 issues. Support now needs to dedicate *three* wards to bot lane. *Three*. The changes to the brush and the useless addition of the alcove has greatly impacted supporting and map awareness. The middle brush (in front of the alcove), the tribrush, and the J4 brush are all core warding spots, this means that the ADC needs to step up or the support needs optimal warding and vision control. You ward the middle brush as it *should* give vision and awareness of the other two.\r\n\r\nSpeaking of the alcove, how useless is this feature? I haven’t seen a single person use it at all, even those that would do well with the feature. No makes use of it, no one makes from it, no one does anything with it. It’s just a useless addition that breaks the flow of the map. It looks weird and it plays weirdly – both in bot lane and top lane.\r\n\r\nNow, mid lane wasn’t hit as bad, but the lethality changes have done no good for the lane. Indirectly buffed every single AD assassin in the game and then some. Talon, Zed, Rengar, Kha’Zix. All buffed when they didn’t need buffs. Well, except for Zed, but he is one small direct buff away from being busted.\r\n\r\nLethality is in such a ridiculous spot right now, playing anything but that is a massive strike against you. Champs are hitting their spikes quicker, killing you quicker, doing far more damage with no defence against it, have a banshees for assassins – who thought this was a good idea? And can just snowball so much easier than before.\r\n\r\nWhen you have tanks building full lethality, something is wrong. Shout out to the Darius in my last game that built full lethality, went 26/4, and carried the game single-handily.\r\n\r\nSanguine Blade is so ridiculously stupid it’s not even funny. Lethality, attack speed, lifesteal? It’s, like, an assassin’s wetdream.\r\n\r\nI like the jungle changes, I think they’re great, but now everything relies on whether the jungler is good. Top, mid, and bot are all supports for the jungler. If your jungler wins the objective game, your chances of winning the game are drastically increased. If you have a lot of tanks, then getting the ocean soul is just an automatic win. I versed a Mundo earlier that had 4 ocean drags + soul and could literally 1v5 and take no damage. He healed it all back – through healing reduction, too. He ended the game alone as no one on our team could kill him as he healed too much, did a lot of damage, and no one on our team could match him.\r\n\r\nThe elder dragon is just as bad. Tanks now have a Cho’Gath ult constantly.\r\n\r\nTop is literally abandoned now as all junglers play bot side for the dragons. In my last ten games, top has been ganked twice. It’s baffling.\r\n\r\nOn another note, just so I can stop ranting, why did you remove the moonwalk from Ekko’s True Damage skin? Imagine making a skin, selling it, then removing things from it with no word.\r\n\r\nEdit: Also mad you removed Evelynn’s ability to smite and stay stealthed.\r\n\r\nEdit 2: I’m mad that Aphelios is a mute. He’s damn hot. Imagine him with Sylas’ voice.\r\n\r\nEdit 3: I forgot to mention Ryze and the fact he needs another rework.","replies":[{"poster":"Pikachoochoo","date":"2019-11-24T18:31:39.787+0000","up_votes":1,"down_votes":1,"body":"just sounds like iron to silver 2-3 and just more meta sheeple (people who follow metas too hard instead of thinking) not building their own according counter builds. I like the new dragons too, they should flush the baby birds out of the meta nest hopefully.","replies":[{"poster":"bgentle2myashe","date":"2019-11-24T23:06:14.788+0000","up_votes":1,"down_votes":0,"body":"Sorry, I'm a little confused. I thought this post was about the new update and the problems that came with it. You're talking about me specifically playing arams that didn't go well and apparently you still hold a grudge, like those 3-5 games determines me as a player? How many arams have you actually played because norms and ranked gets trolled every 2nd game and you are holding a grudge about a few arams lol. Like, yeah ok I have good and bad games like everyone else and sometimes I get tilted and play very poorly. Wow who would of thought I'm just as human as the next person? Not to mention you claim to have the psychic ability to judge people by there post and determine their rank. Haha so very impressive. \nThanks for the honor though I guess? That's a nice addition as a backhanded complement to my trolling. ","replies":[{"poster":"Pikachoochoo","date":"2019-11-24T23:54:40.308+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bgentle2myashe,realm=OCE,application-id=Ntey9fRZ,discussion-id=sEoufV4L,comment-id=00010000,timestamp=2019-11-24T23:06:14.788+0000)\n>\n> Sorry, I'm a little confused. I thought this post was about the new update and the problems that came with it. You're talking about me specifically playing arams that didn't go well and apparently you still hold a grudge, like those 3-5 games determines me as a player? How many arams have you actually played because norms and ranked gets trolled every 2nd game and you are holding a grudge about a few arams lol. Like, yeah ok I have good and bad games like everyone else and sometimes I get tilted and play very poorly. Wow who would of thought I'm just as human as the next person? Not to mention you claim to have the psychic ability to judge people by there post and determine their rank. Haha so very impressive. \n> Thanks for the honor though I guess? That's a nice addition as a backhanded complement to my trolling.\n\nstating how trustable he/she is :l So bgentle2myashe is an alternate acc??? Yes, I hold grudges for a very long time if somebody's behaved badly enough to remember and to be wary around. Yeah, 3-5 matches 15-30min each is a decent chunk of time to notice stuff. Purposely not helping by hanging back for cleans ups or flaming noobs aren't really play styles if they're tilting greed and afking because of noobs. Eyesight and memory isn't psychic. They were legit honors because you did gradually stop but I still feel neutral about you. I don't think saying somebody isn't trolling anymore is severe, client keeps closing by itself after posting here????","replies":[{"poster":"bgentle2myashe","date":"2019-11-25T00:16:52.196+0000","up_votes":2,"down_votes":0,"body":"Trustable = Trustworthy. Sorry I am not dm'ing you but I do correct grammar and am happy to have mine corrected as well. \nI honestly could not tell if you were trolling with your first reply because of the broken english and I don't remember you but I can see now you speak fairly and honestly so thank you. \nBgentle2myashe is the only account I have ever played a League game with and is not an alternate account. I changed my name once from \"juskillmealredy\" which was roughly 3 years ago.\nI really don't remember how long ago these games were you are referring to but as you say, I obviously left enough of an impression to be judged for. For that reason I apologize to you for in fairness to myself I do not feel that is a fair representation of who I am or how I play the game. \nAt times I do change my play style based on my champion or my opponents and I feel like I am much improved compared with what I used to be. How-ever the challenge to improve never ends both mentally or statistically. \nI do appreciate your honesty and candid comments.\nHaving said all that, any comment from someone I don't know is very rarely taken with more than a grain of salt for me. There will always be people who judge, criticize and belittle others just because they can or they think they are better. Since I don't know you this scenario is no different. I do really try to leave people with something positive rather than negative from any interaction with me which is why I have apologized to you. You seem to be very judgmental (which is your right if you choose to be) but also fair and reasonable so I will give you the same.","replies":[{"poster":"Pikachoochoo","date":"2019-11-25T00:42:10.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bgentle2myashe,realm=OCE,application-id=Ntey9fRZ,discussion-id=sEoufV4L,comment-id=0001000000000000,timestamp=2019-11-25T00:16:52.196+0000)\n>\n> Trustable = Trustworthy. Sorry I am not dm'ing you but I do correct grammar and am happy to have mine corrected as well. \n> I honestly could not tell if you were trolling with your first reply because of the broken english and I don't remember you but I can see now you speak fairly and honestly so thank you. \n> Bgentle2myashe is the only account I have ever played a League game with and is not an alternate account. I changed my name once from \"juskillmealredy\" which was roughly 3 years ago.\n> I really don't remember how long ago these games were you are referring to but as you say, I obviously left enough of an impression to be judged for. For that reason I apologize to you for in fairness to myself I do not feel that is a fair representation of who I am or how I play the game. \n> At times I do change my play style based on my champion or my opponents and I feel like I am much improved compared with what I used to be. How-ever the challenge to improve never ends both mentally or statistically. \n> I do appreciate your honesty and candid comments.\n> Having said all that, any comment from someone I don't know is very rarely taken with more than a grain of salt for me. There will always be people who judge, criticize and belittle others just because they can or they think they are better. Since I don't know you this scenario is no different. I do really try to leave people with something positive rather than negative from any interaction with me which is why I have apologized to you. You seem to be very judgmental (which is your right if you choose to be) but also fair and reasonable so I will give you the same.\n\nlol ty, oi r you Broken Scripts or not because the previous message was for him/her. I don't really remember you clearly  except maybe 2 aram matches and 1-2 sr but I don't bother to remember people who play accordingly because then I know they aren't a danger lol so yeah, good on ya either way (not sarcasm). Alot of people don't seem to use cull =/ &lt;- this is a face and +3hp is 3% lifesteal of a 100, most ad champs aren't even near 100 at start then it's still a nice life steal item that takes up empty space until you need to sell it, I'm just mentioning it coz I did a custom recently to read all the new items or try see if tiamat was critting again (not sure if it ever did)","replies":[{"poster":"bgentle2myashe","date":"2019-11-25T03:58:12.112+0000","up_votes":1,"down_votes":0,"body":"No I'm not broken scripts I was just responding to his post.\nI thought you were talking to me because you responded to my post with a quote and then another post following the quote but I may have gotten confused that the second post was not for me. \nAs I said before, I never was a great player and I'm still not when it comes to stats or items even before the new updates. I just jump on the rift and try to outplay. All the rest just complicates the game too much for me which is partly why I support.","replies":[{"poster":"Pikachoochoo","date":"2019-11-25T04:07:25.031+0000","up_votes":1,"down_votes":0,"body":"aw okay tyvm","replies":[]}]}]}]}]}]},{"poster":"Broken Scripts","date":"2019-11-26T02:24:59.729+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Pikachoochoo,realm=OCE,application-id=Ntey9fRZ,discussion-id=sEoufV4L,comment-id=0001,timestamp=2019-11-24T18:31:39.787+0000)\n>\n> just sounds like iron to silver 2-3 and just more meta sheeple (people who follow metas too hard instead of thinking) not building their own according counter builds. I like the new dragons too, they should flush the baby birds out of the meta nest hopefully.\n\nI'm not iron or silver. Even accounts that I int on are far above that elo bracket. Has nothing to do with sheeple or whatever. Open your eyes.\n\nThe only position in this game that is good is jungle. Everything else is garbo.","replies":[{"poster":"Pikachoochoo","date":"2019-11-26T18:41:35.814+0000","up_votes":1,"down_votes":1,"body":"MYEH, u talka crepe, u no even say tenk you https://boards.oce.leagueoflegends.com/en/c/miscellaneous/5BTJcXHo-can-we-nerf-conq?comment=0001 Rank bullcrappa because of friend teams boosting each other, people no even claim dey smurf anymores and it is very disturbing if people hug metas that high up as you claim (mass conq). Nearly perma invisi is game changing (make people stop and think) with the right player, Eve being revealed by smite is more than fair already, she is a dark fairy after all, besides her just standing behind you and waiting because people wont buy pink wards or the correct sight utilities. Best role is bot lane to prevent double feeders and if oce wasn't so full of fake account troll tilters any role would be good","replies":[]}]}]},{"poster":"Ąngel","date":"2019-11-27T10:53:13.856+0000","up_votes":1,"down_votes":1,"body":"It's actually hilarious they thought adding a second rift herald would make the jgler want to go top more often.. did they not realise their changes to drag would completely cancel out any relevance the extra rift had?","replies":[{"poster":"Pikachoochoo","date":"2019-11-27T18:28:34.517+0000","up_votes":1,"down_votes":0,"body":"dragons can't take half hp off turrets in 1 hit","replies":[]}]},{"poster":"bgentle2myashe","date":"2019-11-24T09:47:11.909+0000","up_votes":1,"down_votes":1,"body":"I agree with everything in this post. I am no expert but it looks well researched and thought out for a preliminary type analysis of the the recent update.  \n\nIf I may add my small analysis on the state of the game which is based on Riot's transitioning in to the expansion of it's own gaming world. Ever since the TFT release league has been slowly wilting in quality and quantity in different areas. Now with the further of expansion of gaming possibilities from Riot League of Legends is an after thought. Rip League of Legends for you will be missed!","replies":[{"poster":"Pikachoochoo","date":"2019-11-24T18:39:49.127+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bgentle2myashe,realm=OCE,application-id=Ntey9fRZ,discussion-id=sEoufV4L,comment-id=0000,timestamp=2019-11-24T09:47:11.909+0000)\n>\n> I agree with everything in this post. I am no expert but it looks well researched and thought out for a preliminary type analysis of the the recent update.  \n> \n> If I may add my small analysis on the state of the game which is based on Riot's transitioning in to the expansion of it's own gaming world. Ever since the TFT release league has been slowly wilting in quality and quantity in different areas. Now with the further of expansion of gaming possibilities from Riot League of Legends is an after thought. Rip League of Legends for you will be missed!\n\nneh sounds laike rant. I like TFT but I wish they'd get stricter on de cheater cats and bugs https://boards.oce.leagueoflegends.com/en/c/miscellaneous/EHr9Zurb-woodland-lux-is-nice ","replies":[{"poster":"Broken Scripts","date":"2019-11-26T02:23:07.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pikachoochoo,realm=OCE,application-id=Ntey9fRZ,discussion-id=sEoufV4L,comment-id=00000000,timestamp=2019-11-24T18:39:49.127+0000)\n>\n> neh sounds laike rant. I like TFT but I wish they'd get stricter on de cheater cats and bugs https://boards.oce.leagueoflegends.com/en/c/miscellaneous/EHr9Zurb-woodland-lux-is-nice\n\nnice thread hijack lmfao.","replies":[{"poster":"Pikachoochoo","date":"2019-11-26T18:35:30.839+0000","up_votes":1,"down_votes":0,"body":"you should be more skurredz of {{item:3181}} combined with atk speed runes than that new skill rune alone. MWUOHOHOHOHOHOHOHOHOHO. But at least it should promote more teamwork  (ACTUAL tactical splits  and counterwise) >.> HOPEFULLY............ Derpahurr (not at you, people who won't group and end at 12-17min or etc in rank). It is relevant because he/she is poopooing on TFT. ","replies":[]}]}]}]}]}