{"poster":"EdwardKenway","date":"2017-03-12T21:24:45.898+0000","title":"INSTANT DC, BANS, and LP LOSS","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":0,"body":"So...\nI have been getting instantly DC-ed the moment I load into a game. Bugsplat, reports, the whole thing. I have been time banned, demoted, lost promos, and all that because of the instant DC. I have reinstalled League, checked my internet, upgraded my computer, restarted the world--nothing helps. \nI get into ranked games with my Duo Partner and I DC. I lose 33 LP for it and get my bans (this is all after this happen for 2 other games and losing promos). \nSO, I play through my five bans alone in normals. Nothing happens, all is well. \nTHE VERY NEXT GAME I PLAY with a duo I get instant DC AGAIN! I was in a chat call with him and the stupid game thinks I am just not playing because all the times I got instant DC-ed, it NEVER GAVE A REMAKE OPTION. Also, I sometimes I get back into the loading screen after reconnecting 5 times and I will load to about 50% and then it DCs again. Or whatever since it thinks I'm still in game and punishes me for it and won't allow a remake. \nSo this is ONLY happening with I am in a DUO QUEUE. I apparently can play just fine alone. What the heck is going on? Why am I being punished for this crap? Why can't it get fixed?\nFun fact, I also have opened help tickets about it (especially after getting a \"free loss\" rather than a free win after getting into promos...wtf is THAT about??) but I have been ignored for almost a year now. I've opened 3 help tickets in a year and have never heard back. Not even exaggerating. \nPlease help. This isn't funny any more, Riot. I have failed promos several times because of these bugs (and that free loss I wrote to you about with a screen shot and everything). If I can't play with friends, then this game needs to just be trashed. Stop punishing me for things I am no doing. I have suffered through the bans with grace but it's time to fix this.\n\n*UPDATE*\nNever mind, still DC even when playing alone. Now I have a 5 game 10 minute ban. Yay....#PunishTheInnocent","replies":[{"poster":"CrazFight ","date":"2017-03-12T22:53:19.704+0000","up_votes":3,"down_votes":0,"body":"If you're seeing the bug splat at the champion loading screen, it's may be due to an out of date graphics driver. Let's make sure that your graphics card has all of its latest updates. If you're still crashing at the loading screen, go through each step in our [Bug Splat Guide](https://support.riotgames.com/hc/en-us/articles/201761974#section-mac) and we should be able to narrow down the problem.\n\nHit me back up if you need any additional help!\n\nThere is also a riot post about crash's after the windows update[ here](http://boards.na.leagueoflegends.com/en/c/help-support/X6sPFPu8-fps-drops-and-crashes-after-the-windows-10-anniversary-update). ","replies":[{"poster":"EdwardKenway","date":"2017-03-13T00:24:09.892+0000","up_votes":1,"down_votes":0,"body":"I don't understand what the graphics has to do with the DC and never getting to the loading screen. This just started happening maybe a bit more than a week ago. My computer isn't old at all.","replies":[{"poster":"CrazFight ","date":"2017-03-13T00:31:25.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EdwardKenway,realm=NA,application-id=osqw6G4M,discussion-id=dy6oGsEq,comment-id=00000000,timestamp=2017-03-13T00:24:09.892+0000)\n>\n> I don&#x27;t understand what the graphics has to do with the DC and never getting to the loading screen. This just started happening maybe a bit more than a week ago. My computer isn&#x27;t old at all.\n\nDo u have windows 10?","replies":[{"poster":"EdwardKenway","date":"2017-03-13T00:36:36.351+0000","up_votes":1,"down_votes":0,"body":"I have OSX Sierra","replies":[{"poster":"CrazFight ","date":"2017-03-13T00:38:55.327+0000","up_votes":2,"down_votes":0,"body":"Do a client repair if you haven't done so already.","replies":[]},{"poster":"Broporo","date":"2017-03-13T21:28:27.339+0000","up_votes":1,"down_votes":0,"body":"Since you're getting the Bug Splat before you ever see the champion loading screen, it could very well be an unstable connection. If you haven't yet, lets go through our [**Connection Guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#section-mac) to be sure that isn't the root of the problem. The link should direct you to the Mac portion of the guide, but if not just click on that big red Mac button.\n\nLet me know how that guide works for you!","replies":[{"poster":"EdwardKenway","date":"2017-03-13T21:37:12.272+0000","up_votes":1,"down_votes":0,"body":"I did that yesterday when you mentioned it. I always try that first and go through those suggestions. But I see 2 of the server alerts are down, so maybe something got fixed. I will try again now.","replies":[]}]}]}]}]}]},{"poster":"Exitar","date":"2017-03-13T18:07:55.162+0000","up_votes":2,"down_votes":0,"body":"I can't even enter co-op vs AI or custom games lol this issue started over a week ago and Riot let it get this bad before doing anything","replies":[{"poster":"EdwardKenway","date":"2017-03-13T18:19:58.682+0000","up_votes":1,"down_votes":0,"body":"I got into a custom yesterday and a bot round, but not today :(","replies":[]}]},{"poster":"Broporo","date":"2017-03-12T23:43:04.665+0000","up_votes":3,"down_votes":3,"body":"So you're only having this disconnection issue while in a duo queue with your buddy? Since you were also in chat call with him while duo queuing, this may in fact the result of an intermittent faulty connection. Follow our [Connections Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to see if we can narrow down the issue. \n\nIf you're also seeing the Bug Splat error, it could be good to go ahead and check out the [Bug Splat Guide](https://support.riotgames.com/hc/en-us/articles/201761974) for fixes as well.\n\nLet me know how this works for you.","replies":[{"poster":"EdwardKenway","date":"2017-03-13T00:22:37.137+0000","up_votes":2,"down_votes":0,"body":"Updated my OP. Still instant DC even when alone. Just not while playing my punishment games it seems. Trying one right now with my lovely ten minute ban wait to see if I DC again. Super stoked for that 20 minute ban wait.","replies":[{"poster":"CrazFight ","date":"2017-03-13T00:32:32.546+0000","up_votes":2,"down_votes":0,"body":"Hey there! Go into a custom to see if you DC not a actual game so you don't get timer banned again.","replies":[]}]},{"poster":"Dragonslayer RS","date":"2017-03-13T11:34:07.432+0000","up_votes":2,"down_votes":1,"body":"8 players in my game had this issue. All of us get leaver LP punishment due the this server error. my team was winning 33:10 and nearly end game. please refund the LP to us!!!!","replies":[{"poster":"Crazy Canadian9","date":"2017-03-13T12:56:34.495+0000","up_votes":1,"down_votes":0,"body":"Same, it wasn't only me dc'ING there was at least 5 people both times, I don't care about the lp I just really Dont want to wait 20 for 5 games, can I please get the 20 min queue wait removed","replies":[]}]},{"poster":"xCheapShotx","date":"2017-03-13T12:07:07.385+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=dy6oGsEq,comment-id=0001,timestamp=2017-03-12T23:43:04.665+0000)\n>\n> So you&#x27;re only having this disconnection issue while in a duo queue with your buddy? Since you were also in chat call with him while duo queuing, this may in fact the result of an intermittent faulty connection. Follow our [Connections Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to see if we can narrow down the issue. \n> \n> If you&#x27;re also seeing the Bug Splat error, it could be good to go ahead and check out the [Bug Splat Guide](https://support.riotgames.com/hc/en-us/articles/201761974) for fixes as well.\n> \n> Let me know how this works for you.\n\nhttps://p6.zdusercontent.com/attachment/43400/dczwfEXHjgeNIoOzXi761zJ37?token=eyJhbGciOiJkaXIiLCJlbmMiOiJBMTI4Q0JDLUhTMjU2In0..4aCnyOyoOFD388LfPcS6og.Nj2SVqAPsWOibZ6hO3kftx7ycjSNgj2N5zLO8mZ8DWqD-X0PBThwO9QO3YdwmZg636EUsh1No54Q1OarqDWNElT9dy6XN8v6JpTXGcjG8bkTogNBHkO7ZBx7m1lLBOhvDm4SQTIGgTC10wauS9JruXp-NV--V2q59cVqqpStTXNcAjS6eNmjWudcjsuTZE3aK62NiE692GrYq2PFq9V4NC_GUyKZAVIwWRX2cUZMN-r7ILdtKror88X91PAjnqjdw_Jredpq63YT8_loFaWrN2mG1t4LJrc32N47tpizu3w.nSMpY1S5YZV0VVigzd6HYQ","replies":[]}]},{"poster":"EdwardKenway","date":"2017-03-13T00:33:31.831+0000","up_votes":1,"down_votes":0,"body":"Tried an ARAM just now alone and all that (after the ten minute wait). Still DC-ed. This is just great. Initiating a full repair, updating computer (again), and restarting.\nIf I didn't love this fucking game so much, I'd never go to all this trouble. You know what I mean?  \n*Cries and crosses fingers*","replies":[{"poster":"Broporo","date":"2017-03-13T04:55:57.325+0000","up_votes":2,"down_votes":2,"body":"If you're trying to test certain adjustments to to see if it solved your disconnection issue, make sure you're doing those tests in a custom game so that you avoid getting the Leaverbuster punishments. While it may not seem fair to get punished for leaving a game due to a disconnect, this is still affecting the other players who have to go the rest of the match without a 5th teammate. \n\nUntil we get this ironed out, be sure to test the steps outlined in the [**Connection Guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#section-windows) using a custom game.","replies":[{"poster":"Exitar","date":"2017-03-13T17:31:49.021+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=dy6oGsEq,comment-id=00030000,timestamp=2017-03-13T04:55:57.325+0000)\n>\n> If you&#x27;re trying to test certain adjustments to to see if it solved your disconnection issue, make sure you&#x27;re doing those tests in a custom game so that you avoid getting the Leaverbuster punishments. While it may not seem fair to get punished for leaving a game due to a disconnect, this is still affecting the other players who have to go the rest of the match without a 5th teammate. \n> \n> Until we get this ironed out, be sure to test the steps outlined in the [**Connection Guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#section-windows) using a custom game.\n\nwe aren't the ones causing them to have a bad game riot YOU ARE! WTF is wrong with you people now??? I miss the actual help and dedication of old riot staff back in the S1-S3 days, RIP Rito","replies":[{"poster":"EdwardKenway","date":"2017-03-13T18:03:47.848+0000","up_votes":1,"down_votes":0,"body":"Whoa there, brother. There are 27 million people who play this game on any given day. There is an issue with the app (or program, or whatever version you have), but they are looking in to it. All we can do is remain civil, inform them of issues and wait for a fix. In the mean time, I am doing all I can on my end: updating my computer, running the fix from inside the game, reinstalling--that kind of thing. Just in case. \nAnd fun fact, playing People VS Bots counts as a ban game, so I'm playing it easy in bots and testing my fixes in there. I think PVP is where it will foul up, but I have to try.","replies":[{"poster":"Broporo","date":"2017-03-13T21:56:25.473+0000","up_votes":1,"down_votes":1,"body":"Earlier today we became aware that our players were in fact having disconnection issues. We have a post where you stay up to date on how we are resolving this issue, which you can find [**here**](http://boards.na.leagueoflegends.com/en/c/help-support/3Lmbjp8Y-3132017-na-server-issues)\n\nWe are working on the issue, and appreciate everyone's patience as we get things sorted out.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"EdwardKenway","date":"2017-03-14T00:46:01.681+0000","up_votes":1,"down_votes":0,"body":"Thanks, Broporo. Even though my only day off my evil job was ruined, I appreciate you all looking in to it. Help me, Broporo, you're my only hope *cries*\n\n {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Broporo","date":"2017-03-16T20:56:07.618+0000","up_votes":1,"down_votes":0,"body":"Thankfully, the servers have been restored! \n\nSorry for the slower response, though, I was on my days off in a galaxy far, far away!","replies":[{"poster":"EdwardKenway","date":"2017-03-17T00:43:59.703+0000","up_votes":1,"down_votes":0,"body":"AND NOW I have a 20 minute ban for how many games?? And it has nothing to do with me. You punish the good people and this is how we fucking turn to the dark side. These last two years have been fraught with bugs and unjust punishment for me. From that free loss I got last year (after qualifying for my promos, rather than a free win) to this.\nWhy don't you want me to climb? Why don't you want me to play this game?\nI am not waiting 20 minutes just to be crashed again and perma-banned. Guess I'm already perma-banned...","replies":[]},{"poster":"EdwardKenway","date":"2017-03-17T00:40:49.845+0000","up_votes":1,"down_votes":0,"body":"Yeah no, still instantly crashing. I can't play at all. Never be able to play out of bronze. Guess I'm just not allowed to play.","replies":[]}]}]}]}]}]},{"poster":"Nulllight","date":"2017-03-13T19:39:18.453+0000","up_votes":1,"down_votes":0,"body":"Bull! It's your damn fault we couldn't connect in the first place riot! How dare you punish us! We had no idea we couldn't connect to a game! Fix your shit.","replies":[{"poster":"EdwardKenway","date":"2017-03-14T00:51:43.164+0000","up_votes":1,"down_votes":0,"body":"I still can't get on and the \"official\" post says it was fixed over 8 hours ago. But it's not","replies":[]}]},{"poster":"Doge664","date":"2017-03-13T13:30:09.698+0000","up_votes":1,"down_votes":0,"body":"Exact same thing is happening to me, it's not the internet problems, there is something wrong with the app........","replies":[]},{"poster":"EdwardKenway","date":"2017-03-13T13:02:00.849+0000","up_votes":1,"down_votes":0,"body":"My connection is fine, my computer is fine. I think the app is messed up. I ran the repair and it was fine in a bot match but it was last time too. It's PVP that's an issue. I'll try again though and just risk my account since there is no other way to test it.","replies":[]},{"poster":"Ivahsew","date":"2017-03-13T12:03:44.026+0000","up_votes":1,"down_votes":0,"body":"My entire team was just given a loss, including me... I'm too afraid (in series) to actually start another ranked match until there is confirmation about this connection issue that some parts of NA have been having. my team during champion select were complaining about being disconnected in their previous games and being unable to connect.","replies":[]}]}]},{"poster":"EdwardKenway","date":"2017-03-19T00:57:19.344+0000","up_votes":1,"down_votes":0,"body":"Played out my 20 minute bans in aram and bots vs AI. Jump into a normal. CRASH. I even uninstalled and reinstalled. This game is garbage and it's developers are obviously garbage. If you don't want me to play you game so bad, just fucking tell me.","replies":[]},{"poster":"EdwardKenway","date":"2017-03-17T00:39:28.859+0000","up_votes":1,"down_votes":0,"body":"So I AM NOT DISCONNECTING.\nIf I was, it would not tell me I am afk and punish me. No, the game is crashing. It is still happening. Is this not going to be fixed ever? Am I just not allowed to play any more? I can't climb, have to be in bronze even longer, and it has NOTHING to do with my skill. It has everything to do with a game that cannot stay open long enough for me to walk down mid. CRASHING. NOT DC.\nEven working on it?","replies":[]},{"poster":"EdwardKenway","date":"2017-03-14T00:39:59.236+0000","up_votes":1,"down_votes":0,"body":"Got into a bot match and a people vs ai. Tried aram: instant D.C. I get into the match almost. Loses in but right when I went to click to upgrade Q it D.C. Me. So close","replies":[{"poster":"EdwardKenway","date":"2017-03-14T00:53:29.942+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=_mM3mVLcsDw\n\nthis is what is happening still. Just poof. No game for me","replies":[]}]},{"poster":"Exitar","date":"2017-03-13T18:22:09.251+0000","up_votes":1,"down_votes":0,"body":"No other servers have this issue, only NA. recently people were getting leaver buster bans for the black screen at champ select also and nothing was done about that either. Riot USED to actually understand when they screwed up and we weren't punished for it. THAT is my issue.","replies":[{"poster":"EdwardKenway","date":"2017-03-13T19:12:10.074+0000","up_votes":1,"down_votes":0,"body":"I will agree that things have gotten bad since they got bought by that Chinese company. That's when they started with the gambling shops and not just the \"%-off shops\" during events. Sad change there too.","replies":[]}]},{"poster":"EdwardKenway","date":"2017-03-13T18:19:17.615+0000","up_votes":1,"down_votes":0,"body":"Damn, it happens in People VS Bots too.","replies":[]},{"poster":"Jepp2078","date":"2017-03-13T00:27:49.547+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"CrazFight ","date":"2017-03-13T00:33:31.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jepp2078,realm=EUW,application-id=osqw6G4M,discussion-id=dy6oGsEq,comment-id=0002,timestamp=2017-03-13T00:27:49.547+0000)\n>\n> \n\nThis doesn't belong here, as the rules say no name shaming, if you want to report a player pls refer to using a [support ticket.](https://support.riotgames.com/hc/en-us)","replies":[]}]}]}