{"poster":"SanRico69","date":"2016-11-25T09:19:03.768+0000","title":"Ez nem igaz.. Segitség","subforum":"Általános beszélgetés","up_votes":2,"down_votes":0,"body":"Sziasztok.!\r\n\r\nK&ouml;r&uuml;lbel&uuml;l m&aacute;r egy H&oacute;napja nem kapok kulcst&ouml;red&eacute;ket &eacute;s mindennap 3 vagy t&ouml;bb meccset lej&aacute;tszok. Szokszor nyer&uuml;nk nem az a baj hogy veszit&uuml;nk. A Statom se olyan rossz.. Nem &eacute;rtem M&aacute;r 1 h&oacute;napja nem kaptam kulcst&ouml;red&eacute;ket &eacute;s igy nem tudok l&aacute;d&aacute;t nyitni (T&ouml;bb l&aacute;d&aacute;m van mint kulcsT&Ouml;RED&Eacute;Kem.) Valaki elmagyar&aacute;zn&aacute; hogy ez m&uuml;k&ouml;dik? Előre is k&ouml;sz&ouml;n&ouml;m!\r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"CHARLiEFOXROT","date":"2016-11-25T09:41:46.311+0000","up_votes":2,"down_votes":4,"body":"EDIT: Olvassátok el Nerdcore kommentjét mert az enyém false infokat is tartalmazott.\n\n( valamint a votedown manó is erre járt és -4re alázott csak mert én tévedtem, ahelyett hogy leírta volna rendesen ha mar tévedtem...\nEz a jó hozzáállás, tényleg, gratulálok... )","replies":[{"poster":"Nemin","date":"2016-11-25T10:03:27.102+0000","up_votes":2,"down_votes":1,"body":"Mi ez a marhaság már megbocsáss... S? 100% hónap elején? Ezeket honnan szedted?\n\nKulcstöredéket minden győztes meccs után kaphatsz, olyan karakterrel aki megvan.  A százalék bár valóban minden hónapban nullázódik, de nem 100% és értéke ismeretlen, minden egyes Kulcstöredék után nagyban csökken.\n\nAz egyénileg változó mennyiségről meg annyit, hogy egy random generátor dobálja, nem nézi a riot, hogy pont neked ne adjon kulcsot, a faluvégi Pistékét pedig árassza el kulcsokkal.\n\nÉs nem vizet prédikálok bort iszok, mert én is tizenhat ládán ülök, de el tudom fogadni, hogy hát istenem ez van.","replies":[{"poster":"CHARLiEFOXROT","date":"2016-11-25T12:12:35.279+0000","up_votes":1,"down_votes":1,"body":"Kicsit mintha rossz hangot ütöttél volna meg.\nA hibáim elismerem és köszönöm a javítást, de minden ilyen nemű megszólalásoddal aláásod magad a viselkedésed miatt.\n\nCsak sajnálni tudlak az ilyen heves kiindulásaidért. Velem is előfordul, de a legjobb elhagyni őket. Ezt tanácsolom neked is.","replies":[{"poster":"Nemin","date":"2016-11-25T13:10:06.156+0000","up_votes":3,"down_votes":0,"body":"Nem volt bennem semmi rosszindulat, viszont lehet kicsit valóban elszóltam magam. Csak tudod annyira szutyok érzés, hogy van egy GYIK, amit több napon át hegyeztünk olyanra, hogy tök jó legyen és minden infót megtaláljatok és nagyjából mindenki letojja. \n\nAmúgy négyünk közül mindig is nekem volt a legszókimondóbb stílusom, amin bár próbálok javítani, de a régi szokások nehezen halnak ki.","replies":[{"poster":"CHARLiEFOXROT","date":"2016-11-25T14:25:22.812+0000","up_votes":1,"down_votes":0,"body":"Nagyra értékelem, hogy próbálsz változtatni, és egyébként ehhez kötődően el is olvastam ujra a GYIK et. Szóval nem csak a levegőbe dobálóztok a szavakkal. ;)","replies":[]}]}]},{"poster":"Sylasi Elvtárs","date":"2016-11-25T11:20:42.719+0000","up_votes":3,"down_votes":0,"body":"Kevesebbet kéne fórumozni és többet játszani ;)","replies":[]}]},{"poster":"Temp65432","date":"2016-11-25T10:00:55.599+0000","up_votes":4,"down_votes":0,"body":"> Csak S+ / S / S- osztályzatokért kaphatsz\n\nEz nem igaz. Ez a láda.\n\n> minden hónapban resetelődik\n\nMegint csak nem...az 1. megszerzett kulcs után 1 hónappal. Az nem biztos, hogy hó elejére esik\n\n>  minden kulcstöredék után feleződik az esélye hogy töredéket kapsz.\n\nEz sem teljesen. Nem feleződik, hanem exponenciálisan csökken. (nincs megmondva, pontosan mennyivel).\n\nEzen felül természetesen nem személyenként változik, hogy ki mennyit kap. Ha jól játszol akkor sok a ládád, ha sokat játszol akkor meg sok a kulcsod.\n\nÉs még azt kihagytad, hogy ha premadeben játszol akkor nagyobb az esélye a kulcs droppnak. Minél többen vagytok együtt annál nagyobb az esélye, hogy kapsz.\n\nBtw, ez mind le van írva a GY.I.K.-ban, olvasgassátok.","replies":[{"poster":"CHARLiEFOXROT","date":"2016-11-25T12:09:00.415+0000","up_votes":1,"down_votes":1,"body":"Köszi a pontosítást, én is rég olvastam már. :)","replies":[]}]}]},{"poster":"SanRico69","date":"2016-11-25T11:15:19.356+0000","up_votes":1,"down_votes":0,"body":"Köszönöm szépen hogy felvilágósitottatok ebben a témakörben!\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"CHARLiEFOXROT","date":"2016-11-25T12:13:42.247+0000","up_votes":1,"down_votes":1,"body":"Nincs mit és Bocsi a false infókért, volt amivel én sem teljesen voltam tisztában, de csak segíteni akartam. :/","replies":[{"poster":"SanRico69","date":"2016-11-25T14:15:53.372+0000","up_votes":1,"down_votes":0,"body":"Semmi baj te csak jót akartál nekem :)\n{{sticker:zombie-nunu-hearts}}","replies":[]}]}]}]}