{"poster":"Shadowbyte","date":"2019-06-06T04:01:27.648+0000","title":"14 day ban for defending myself in chat","subforum":"Player Behavior","up_votes":1,"down_votes":16,"body":"14 day ban from one game. wew. I'm so confused on how this system works. Literally one of the first few games since I got back from a chat restriction so it wasn't a build up of reports (previous games were great and good vibes all around). Either the threshold at this point is 0 or something in this log filled it to 100%. I played a losing mid lane so any references to mid losing or not doing anything is me telling my team I'm next to useless at this point, don't know if ban bot picked it up as me flaming. Even with no context or full chat logs (it was full of flame towards me but that doesn't matter to ban bot) taking this log for it's face value I can't see anything that could trigger ban bot other then the mid references. I'm literally defending myself and occasionally trying to calm them down (it was kinda weird because one of them kept flipping between nice then toxic) in chat but I guess even defending yourself is construed as flame by the ban bot? \r\n\r\nMeanwhile both the other flamers got off scot-free (no instant feedback report) despite telling me to uninstall, spamming death timer or mia pings on me (idk if ban bot looks at that, doubt it does since it doesn't show up on your logs), calling me trash, useless, feeding, inter, 4v6 etc. Think just slightly below tyler1 levels of flame.  \r\n\r\nSeriously confused about how riot's automated system works. If anyone can tell me what went wrong here it'd be appreciated. Otherwise I'll just change the client to remove the chat box from the game entirely because in my experience comms in this game has no benefits other then that 1 in a hundred game.\r\n\r\n\r\n\r\nGame 1\r\nIn-Game\r\nShadowbyte: gg\r\nShadowbyte: cant even do anything\r\nShadowbyte: mid lost\r\nShadowbyte: cant do anything with eve and syndra sitting in lane\r\nShadowbyte: easy for you to say\r\nShadowbyte: ...\r\nShadowbyte: w/e game was over once we lost their red\r\nShadowbyte: I literally got in lane cho\r\nShadowbyte: check your map before you ping pls\r\nShadowbyte: worry about yourself first nunu\r\nShadowbyte: weird\r\nShadowbyte: so did I\r\nShadowbyte: wouldn't possibly the screwed up invade or the non existant jg pressure\r\nShadowbyte: oh\r\nShadowbyte: nunu's mad\r\nShadowbyte: hello jg?\r\nShadowbyte: why would I go back and give another kill?\r\nShadowbyte: cya both in 14 days :)\r\nShadowbyte: hows honor 0 treating you both?\r\nShadowbyte: oh wew look at our team\r\nShadowbyte: wheres everyone at baseee\r\nShadowbyte: wew\r\nShadowbyte: is that your entire vocab cho?\r\nShadowbyte: nunu look at your kdc before you trash me for mine\r\nShadowbyte: you realize 1/7 isnt that much better then 0/7\r\nShadowbyte: smh\r\nShadowbyte: no flame this time?\r\nShadowbyte: ping me again nunu\r\nShadowbyte: I missed it the first time\r\nShadowbyte: you really must like getting banned huh?\r\nShadowbyte: trash talking when you're 1/8\r\nShadowbyte: lol\r\nShadowbyte: go ahead and report me then?\r\nShadowbyte: lol\r\nShadowbyte: why yall so mad over a game\r\nShadowbyte: chill\r\nShadowbyte: literally farming\r\nShadowbyte: chill\r\nShadowbyte: i literally just took turret\r\nShadowbyte: so did you?\r\nShadowbyte: what?\r\nShadowbyte: you realize I died taking turret while you died losing one... I dont see how I'm in the wrong here\r\nShadowbyte: last time I \"helped\" all I got was flame\r\nShadowbyte: wonder why I'm farming side lanes now eh\r\nPost-Game\r\nShadowbyte: bro\r\nShadowbyte: this cho and nunu wont shut up\r\nShadowbyte: cya in 14 days","replies":[{"poster":"KFCeytron","date":"2019-06-06T04:24:36.378+0000","up_votes":9,"down_votes":0,"body":"You spent the entire time raging at your team. If that's what you do within a few games of finishing your second chat restriction, that consistent toxicity will earn you a follow-up punishment, this time a 14-day suspension.\n\nYou don't get an instant feedback report for every report that results in a punishment.\n\nThe very first thing you said in chat was \"gg,\" which indicates that you gave up. Then you went on and on about how your teammates would surely be banned, insulted a teammate's vocabulary, continually brought up teammates' scores, and use passive-aggressive sarcasm to draw out an argument. Did this put a stop to your teammates' flaming? No. That's because flaming back isn't \"defending yourself\" - it's not a defensive measure. It is purely offensive, and simply causes chat to deteriorate further. If you want to defend yourself from having to deal with rude or offensive chat messages, use the mute function. It is a 100% effective defensive measure.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T04:53:04.984+0000","up_votes":1,"down_votes":6,"body":"I thought that's the whole point of an instant feedback report. To give instant feedback on a report. It simply doesn't make sense for it to tell you your report helped every other time. \n\nI don't know about you but I've comeback from many games where either myself or teammates said gg early on. Maybe it's a difference in game experience but gg doesn't mean you've given up and just gonna run down mid or afk in base (neither of which I did). \"going on and on about how they'll surely be banned\" happened 2 times, once in game, the other post game. \"Continually bringing up teammates scores\" also is a two time thing. We were all doing poorly that game (you can see I was 0/7) and two people decided to shift all blame on me for inting, griefing telling others to report me etc. In an attempt to catch up I farmed sidelanes, surprise surprise I was now a \"troll\". \n\nI don't know if it's obvious but the things I said were to discredit their arguments, even without a full chat log it seems obvious to me.\n\ncheck your map before you ping pls\nworry about yourself first nunu\nwhy would I go back and give another kill?\nnunu look at your kdc before you trash me for mine\nyou realize 1/7 isnt that much better then 0/7\nyou realize I died taking turret while you died losing one... I dont see how I'm in the wrong here\nlast time I \"helped\" all I got was flame\n\n\nI'm not sure what you construed as passive-agressive sarcasm, it's probably a difference in personality but if you could point them out that be appreciated.","replies":[{"poster":"KFCeytron","date":"2019-06-06T05:18:49.460+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00020000,timestamp=2019-06-06T04:53:04.984+0000)\n>\n> I thought that's the whole point of an instant feedback report. To give instant feedback on a report. It simply doesn't make sense for it to tell you your report helped every other time. \n> \n> I don't know about you but I've comeback from many games where either myself or teammates said gg early on. Maybe it's a difference in game experience but gg doesn't mean you've given up and just gonna run down mid or afk in base (neither of which I did). \"going on and on about how they'll surely be banned\" happened 2 times, once in game, the other post game. \"Continually bringing up teammates scores\" also is a two time thing. We were all doing poorly that game (you can see I was 0/7) and two people decided to shift all blame on me for inting, griefing telling others to report me etc. In an attempt to catch up I farmed sidelanes, surprise surprise I was now a \"troll\". \n> \n> I don't know if it's obvious but the things I said were to discredit their arguments, even without a full chat log it seems obvious to me.\n> \n> check your map before you ping pls\n> worry about yourself first nunu\n> why would I go back and give another kill?\n> nunu look at your kdc before you trash me for mine\n> you realize 1/7 isnt that much better then 0/7\n> you realize I died taking turret while you died losing one... I dont see how I'm in the wrong here\n> last time I \"helped\" all I got was flame\n> \n> \n> I'm not sure what you construed as passive-agressive sarcasm, it's probably a difference in personality but if you could point them out that be appreciated.\n\nIFR is like giving a dog a treat when he sits. The idea is that the dog will sit just for the possibility of a treat.\n\n\"Gg\" by itself probably isn't going to get you punished, but when it's part of a larger string of negativity, it can be a factor.\n\nYou referred to teammates' impending punishments in four messages, not two. Even one would be too many; it serves no purpose.\n\n> Shadowbyte: cya both in 14 days :)\nShadowbyte: hows honor 0 treating you both?\nShadowbyte: you really must like getting banned huh?\nPost-Game\nShadowbyte: cya in 14 days\n\nBringing up your teammates' scores and performance:\n\n> Shadowbyte: worry about yourself first nunu\nShadowbyte: wouldn't possibly the screwed up invade or the non existant jg pressure\nShadowbyte: nunu look at your kdc before you trash me for mine\nShadowbyte: you realize 1/7 isnt that much better then 0/7\nShadowbyte: trash talking when you're 1/8\n\nAgain, even once would be more than necessary.\n\n\"Discrediting their arguments\" is also not necessary. It simply serves as providing your own arguments, inflaming the ongoing argument. If you don't like what someone is saying, you should lament that you had to see one negative message and then mute them. Don't go to work drawing out more negative messages from them. Focus on your own play and report the negative players at the end of the match.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T05:34:44.998+0000","up_votes":1,"down_votes":4,"body":">IFR is like giving a dog a treat when he sits. The idea is that the dog will sit just for the possibility of a treat.\n\nI really hope that's wrong because it really screws with people's perception of what's allowed and what's not (at least for me). Imagine reporting someone who's spamming chat with toxicity, you report him post-game, nothing happens. Weird. Looks like riot isn't doing anything about it so what they said can't be that bad. \n\n>You referred to teammates' impending punishments in four messages, not two. Even one would be too many; it serves no purpose.\n\nIf it serves no purpose then why did they stop flaming for a while after? I find that reminding them there's a punishment system sometimes checks their aggro. \n\n>Bringing up your teammates' scores and performance:\n\nAs the game goes on people's performance changes, mine was mocked throughout the game despite improving later on. I'm literally reminding them that we're in the same boat (kda wise). \n\n>mute them\n\nI'm seriously considering removing the in game chatbox from my client completely, I'm just trying to gauge how sensitive the ban bot is and it doesn't seem to make any sense given my experience with previous games","replies":[{"poster":"KFCeytron","date":"2019-06-06T05:44:44.355+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=0002000000000000,timestamp=2019-06-06T05:34:44.998+0000)\n>\n> I really hope that's wrong because it really screws with people's perception of what's allowed and what's not (at least for me). Imagine reporting someone who's spamming chat with toxicity, you report him post-game, nothing happens. Weird. Looks like riot isn't doing anything about it so what they said can't be that bad. \n> \n> If it serves no purpose then why did they stop flaming for a while after? I find that reminding them there's a punishment system sometimes checks their aggro. \n> \n> As the game goes on people's performance changes, mine was mocked throughout the game despite improving later on. I'm literally reminding them that we're in the same boat (kda wise). \n> \n> I'm seriously considering removing the in game chatbox from my client completely, I'm just trying to gauge how sensitive the ban bot is and it doesn't seem to make any sense given my experience with previous games\n\nI think you have it backwards: if you saw an IFR popup after every punishment, guaranteed, that would quickly tell you what \"can't be that bad\" and what can. Making it a bit random encourages players to simply adhere to the rules rather than looking for the exact line of toxicity they have to toe.\n\nIf they paused their flame for a bit, I guess they started it back up, because it looks like it kept going... as did yours. The attention encourages them.\n\nYes, you reminded your teammates that their scores were bad. That's not a good thing. It's rude and it perpetuates arguments.\n\nIf you think the IFS is overly sensitive and see your toxic chat as perfectly acceptable, then yes, you might be well-served by not chatting anymore. I think the chat box can be resized and moved, from what I've heard.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T05:59:11.569+0000","up_votes":1,"down_votes":5,"body":">Making it a bit random encourages players to simply adhere to the rules rather than looking for the exact line of toxicity they have to toe. \n\nThe current state of the community would suggest otherwise. What other MOBA out there is known for it's toxic community. Hell, even league ads on facebook are filled with comments warning of the toxic community. \n\nThere's a reason why laws work like they do today, if we persecute people in secret not only would that undermine the entire system but the public would question every now and then \"why did this murderer get away with it\". I get the idea of keeping players on their toes but having a clear line marked out is much better then the extremely fuzzy one riot's given us. \n\nKnowing when and where to stop is much better then not. You know it's ok to smoke weed in some states, but not in others. Riot's system is basically saying we'll arrest you some of the times we catch you smoking in an illegal state but we won't tell you what states are illegal. Oh and by the way, we'll change the legality of states at our discretion.","replies":[{"poster":"KFCeytron","date":"2019-06-06T06:29:33.223+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=000200000000000000000000,timestamp=2019-06-06T05:59:11.569+0000)\n>\n> The current state of the community would suggest otherwise. What other MOBA out there is known for it's toxic community. Hell, even league ads on facebook are filled with comments warning of the toxic community. \n> \n> There's a reason why laws work like they do today, if we persecute people in secret not only would that undermine the entire system but the public would question every now and then \"why did this murderer get away with it\". I get the idea of keeping players on their toes but having a clear line marked out is much better then the extremely fuzzy one riot's given us. \n> \n> Knowing when and where to stop is much better then not. You know it's ok to smoke weed in some states, but not in others. Riot's system is basically saying we'll arrest you some of the times we catch you smoking in an illegal state but we won't tell you what states are illegal. Oh and by the way, we'll change the legality of states at our discretion.\n\nThe current state of the community doesn't seem that bad when I play, cf. the wide world of toxicity that punished players see. I find that odd.\n\nRiot is not a government, the rules are clearly stated, and valid reports result in a punishment to the best of the system's ability. Don't spend an entire match bickering with your team in a misguided attempt to \"defend yourself.\" Be positive and constructive, try to ignore negative players, and focus on the game.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T17:54:56.857+0000","up_votes":1,"down_votes":5,"body":">The current state of the community doesn't seem that bad when I play, cf. the wide world of toxicity that punished players see. I find that odd.\n\nWhich really says something about the supposed non-existent prisoner island\n\n>the rules are clearly stated\n\nAnd by rules you mean the giant paintbrush that covers everything allowing behinds the scenes discretion and inconsistency?\n\n> valid reports result in a punishment to the best of the system's ability\n\nGranted. But I'm not saying the system isn't trying it's best. I'm saying the system's best isn't enough for this community. It has barely changed since it was introduced years ago. There's still a textbox for your comments (which are now useless despite it asking you for them to help review the case???) even when the entire system is automated. \n\n>Be positive and constructive, try to ignore negative players, and focus on the game.\n\nYou can literally be all that and still get punished under the system.","replies":[{"poster":"KFCeytron","date":"2019-06-06T20:42:28.655+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00020000000000000000000000000000,timestamp=2019-06-06T17:54:56.857+0000)\n>\n> Which really says something about the supposed non-existent prisoner island\n\nIt is non-existent. When I see toxicity, I mute. When toxic players see toxicity, they join in. When I said it was odd, I was being facetious.\n\n> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00020000000000000000000000000000,timestamp=2019-06-06T17:54:56.857+0000)\n>\n> And by rules you mean the giant paintbrush that covers everything allowing behinds the scenes discretion and inconsistency?\n\nNo, I mean the ToU that you agreed to when you signed up.\n\n> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00020000000000000000000000000000,timestamp=2019-06-06T17:54:56.857+0000)\n>\n> Granted. But I'm not saying the system isn't trying it's best. I'm saying the system's best isn't enough for this community. It has barely changed since it was introduced years ago. There's still a textbox for your comments (which are now useless despite it asking you for them to help review the case???) even when the entire system is automated.\n\nOkay. The report that resulted in your punishment was valid, though.\n\n> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00020000000000000000000000000000,timestamp=2019-06-06T17:54:56.857+0000)\n>\n> You can literally be all that and still get punished under the system.\n\nWell, you weren't being all that in this log, so that's not a very relevant theory to bring up. I suggest you do so from now on, though, because the next valid report you get - no matter how minor - will result in a permaban.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"GatekeeperTDS","date":"2019-06-06T04:19:52.069+0000","up_votes":4,"down_votes":0,"body":"When one person is flaming, and then someone else starts \"defending himself\" by flaming back, the rest of the people in the game now have to deal with two people ruining the game instead of one. This is why context doesn't matter and why you got punished.\n\nDefend yourself by **ignoring idiots**. Their words can only bother you **if you let them**.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T04:43:54.694+0000","up_votes":1,"down_votes":5,"body":"I'd like to know what's construed as flame in this sense. AFAIK banter is allowed, and so are facts. I naturally add humor and facts in my comebacks, I can't really understand what riot construes as ok and what's bad. I mean tyler1 is sponsored by riot so what he says must be ok right? Would I be better off changing the client so the chat box doesn't exist in this case? ban bot clearly doesnt care much for it.","replies":[{"poster":"KFCeytron","date":"2019-06-06T05:08:04.478+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=00000001,timestamp=2019-06-06T04:43:54.694+0000)\n>\n> I'd like to know what's construed as flame in this sense. AFAIK banter is allowed, and so are facts. I naturally add humor and facts in my comebacks, I can't really understand what riot construes as ok and what's bad. I mean tyler1 is sponsored by riot so what he says must be ok right? Would I be better off changing the client so the chat box doesn't exist in this case? ban bot clearly doesnt care much for it.\n\nFriendly banter is allowed.\n\n* \"Whoa, almost got you there!\"\n* \"Gotta be quicker than that!\"\n* \"Oof, did you step on my shroom?\"\n\nHelpful facts are allowed.\n\n* \"Adaptive Helm will really help against that DoT.\"\n* \"Enemy jg's ult is up; look out.\"\n* \"You have a hard matchup, so I'll gank your lane often.\"\n* \"Enemy has too much vision around Baron for us to catch them by surprise.\"\n\nRude arguing is not allowed.\n\n* \"I like how you never gank.\"\n* \"You're nothing but a leech.\"\n* \"Report me for what? You're the one who should be reported.\"\n\nRude facts are not allowed.\n\n* \"You're 1/7.\"\n* \"You've done nothing but complain about KS this entire time.\"\n* \"Buying an account doesn't make you Diamond.\"\n\nEven neutral facts don't get a free pass.\n\n* \"2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\n2+2=4\"\n\nHumor where you're helping the team be positive and work together is allowed.\n\n* \"I've made a huge mistake.\"\n* \"Zed killed me so hard that I died!\"\n* \"Of course I helped you, Xayah. U r my bae!\"\n* \"This 23/2 Teemo is on our team and I'm still gonna have nightmares.\"\n\nHumor where you're viciously laughing at someone is not allowed.\n\n* \"Look at this noob!\"\n* \"My cat can Flash better than that.\"\n* \"I wish I could see the look on your face when you're banned.\"\n\nFrom what I've heard, T1 these days occasionally rages _on camera_ but not _in chat_. This allows him to let off steam and entertain viewers without bothering his teammates. Saying rude things out loud is permitted. Transmitting those rude things to your teammates is not.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T05:17:27.952+0000","up_votes":1,"down_votes":5,"body":"I have no idea if elo is a factor or not but I have rarely/never seen any comms near the allowed ones in my game. Forgive me but I find it hard to believe that something as simple as the examples of rude facts or arguing is considered flame. If that's the case then I should be reporting at least 3 people each game I play which seems crazy.\n\nI'm genuinely curious if this is an ideal situation or is league ecosystem at my elo just really that bad and I'm just used to it. I ask this because if it's the latter then I really have the odds against me since I don't have an inkling of what a good, clean, toxicity free game is like. Most of the things I've said are what I've seen other people say without repercussion so I just assumed it was within acceptable banter.","replies":[{"poster":"KFCeytron","date":"2019-06-06T05:29:14.391+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Shadowbyte,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=0000000100000000,timestamp=2019-06-06T05:17:27.952+0000)\n>\n> I have no idea if elo is a factor or not but I have rarely/never seen any comms near the allowed ones in my game. Forgive me but I find it hard to believe that something as simple as the examples of rude facts or arguing is considered flame. If that's the case then I should be reporting at least 3 people each game I play which seems crazy.\n> \n> I'm genuinely curious if this is an ideal situation or is league ecosystem at my elo just really that bad and I'm just used to it. I ask this because if it's the latter then I really have the odds against me since I don't have an inkling of what a good, clean, toxicity free game is like. Most of the things I've said are what I've seen other people say without repercussion so I just assumed it was within acceptable banter.\n\nThis is your third punishment, which is a strong indication that the things you're saying _are_ considered rude. Most of the negativity I see in my games is limited to \"ez\" (which I hate getting thrown at me) and the occasional complaint that someone is dying a lot (usually I, because I'm bad at this game). A chat log like the one you've shown is exceptional. You can see other examples of unacceptable chat by browsing other threads here on PB, posted by other punished players. Pay more attention to the explanatory responses than to the specific wording.","replies":[]}]}]},{"poster":"GatekeeperTDS","date":"2019-06-06T11:02:27.209+0000","up_votes":4,"down_votes":1,"body":"KFCeytron gave you a good explanation. I have a policy of immediately disengaging from anyone who brings up Tyler1 in order to deflect their own bad behavior.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T19:19:23.628+0000","up_votes":1,"down_votes":6,"body":"You mean you can't explain the hypocrisy of how someone so toxic can be invited to guest the finale of NA lcs i.e endorsed by riot, meanwhile their playerbase gets shafted for lesser offenses. I guess that's as good of a reason as any for immediately disengaging.","replies":[{"poster":"GatekeeperTDS","date":"2019-06-06T19:35:33.110+0000","up_votes":4,"down_votes":1,"body":"Nah, it's just pointless to argue about certain topics and/or with certain people. Your post and every reply to me and others in this thread and others is ragerageragerage. You're angry, we get it, stop taking it out on me.","replies":[{"poster":"Shadowbyte","date":"2019-06-06T20:21:32.266+0000","up_votes":1,"down_votes":5,"body":"Nice ad hominem. And here you are talking about fallacies. The irony is palpable.","replies":[]}]}]},{"poster":"CharDeeMcDenniz","date":"2019-06-06T11:28:58.040+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=GatekeeperTDS,realm=NA,application-id=ZGEFLEUQ,discussion-id=3atb7Yr8,comment-id=000000010001,timestamp=2019-06-06T11:02:27.209+0000)\n>\n>  I have a policy of immediately disengaging from anyone who brings up Tyler1 in order to deflect their own bad behavior.\n\nnew meta","replies":[{"poster":"GatekeeperTDS","date":"2019-06-06T11:49:22.474+0000","up_votes":2,"down_votes":1,"body":"Tyler1 is this board's favorite strawman.","replies":[]}]}]}]}]},{"poster":"BoRnToKiLL666","date":"2019-06-06T16:08:29.637+0000","up_votes":3,"down_votes":1,"body":"> Game 1\n> In-Game\n> Shadowbyte: cya both in 14 days :)\n> Shadowbyte: cya in 14 days\n\n\nOH NO NO NO NO NO, the irony.\n\nSweetie, you need to learn to not flame your teams :)","replies":[]},{"poster":"Xidphel","date":"2019-06-08T03:47:05.158+0000","up_votes":1,"down_votes":0,"body":"You don't get punished for muting. You get punished for letting your ego control your every action.","replies":[]},{"poster":"Soul Dealer","date":"2019-06-06T04:21:52.674+0000","up_votes":3,"down_votes":13,"body":"Honestly you don’t deserve the ban. Nothing toxic in there","replies":[]}]}