{"poster":"Switch834","date":"2016-12-13T02:59:11.655+0000","title":"can't turn off language filter","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I've tried checking the box and unchecking it.  It doesn't work no matter what I try.","replies":[{"poster":"Targons Blade","date":"2016-12-13T05:06:09.842+0000","up_votes":1,"down_votes":0,"body":"This is a fairly annoying bug that pops up on the new client. There are a few methods that seem to fix it for some players, so I recommend trying the steps below:\n\n1. First, try launching into the *Legacy Client* using the 'Launch Legacy Client' from the login screen. From there, hit the cog icon in the top right and enable the language filter, then disable it. Close the Legacy Client out afterward.\n\n2. Log back into the New Client, then hop into your League installation folder and navigate to the Config folder. *Delete* the **LeagueClientSettings.yaml** file. It should be in this directory:\n\n> C:\\Riot Games\\League of Legends\\Config\n\n____\nAfter the above steps, close out League completely, then log back in and launch into a custom match to see if your filter is now off. Let me know if this helped!","replies":[{"poster":"Switch834","date":"2016-12-13T16:24:40.022+0000","up_votes":1,"down_votes":0,"body":"I followed those steps but it did not work.  Chat filter is still enabled.","replies":[{"poster":"Targons Blade","date":"2016-12-13T22:56:29.783+0000","up_votes":1,"down_votes":0,"body":"I'm sorry to hear that. :(\n\nWe've seen this work for some and not for others, so it's a bug with the Beta Client itself. I'd recommend reporting it on the [**Client Discussion Boards**](http://boards.na.leagueoflegends.com/en/c/alpha-client-discussion) so we can track it.\n\nLet me know if you have any questions.","replies":[{"poster":"Dreolon","date":"2016-12-30T22:21:58.103+0000","up_votes":1,"down_votes":0,"body":"These steps worked well for me. \nFor others out there with the same problem, try the following:\n1. Open the file _LCUAccountPreferences.yaml_ with Notepad or another familiar text editor. \nIt should be in the folder: C:\\Riot Games\\League of Legends\\Config\\\n2. Change the line  chatFilterDisabled to true, like such: \"chatFilterDisabled: true\"\n3. Profit","replies":[]}]}]}]}]}