{"poster":"PyschoPen1s","date":"2017-01-23T09:32:25.406+0000","title":"Welche grafikkarte für LoL","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo.\r\nIch habe sonst LoL auf meinem msi gaming laptop gespielt. den hatte ich damals gebraucht gekauft und er ist jetz kaputt. darauf lief LoL auf max mit stabile  60 fps.\r\nals ersatz hab ich hier noch einen alten office pc der noch einwandfrei l&auml;uft. Ich m&uuml;sste dort nur eine grafikkarte einsetzen da er im moment mit einer onboard l&auml;uft. die frage ist nun. Welche. es soll jetz keine high end grafikkarte sein sondern ledeglich eine die f&uuml;r LoL reicht und nicht mehr . \r\nDie specs des office pcs :\r\nIntel Core 2 Duo E7300 2x 2.66  ghz\r\n300w netzteil\r\n4 gb ram(k&ouml;nnte auf 8 erweitern)\r\nich wei&szlig; das netzteil ist schwach aber ich suche keine grafikkarte die ein extra strom anschluss braucht . sondern eine die f&uuml;r LoL auf mittel-hoch ohne schatten reicht.\r\n W&uuml;rde mich auf vorschl&auml;ge freuen \r\nlg","replies":[{"poster":"das3wigeleben","date":"2017-01-23T11:25:46.370+0000","up_votes":2,"down_votes":1,"body":"kauf dir das was du ausgeben willst selbst mit ner 15 euro teuren gt 610 kannst elol in 60 fps zocken ....","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-01-23T10:07:37.985+0000","up_votes":2,"down_votes":1,"body":"Ohne jetzt gro0ßartig Ahnung von Technik zu haben: Ich bezweifele, dass du heutzutage überhaupt noch eine funktionierende Grafikkarte bekommst, auf der LoL nicht funktioniert.\nMeine Eltern haben sich vor über 10 Jahren einen PC gekauft, der damals schon nicht High End war... Und selbst auf dem kann man LoL zocken. Die Anforderungen dieses Spiels gehen halt eher in die Internetleitung als auf die Hardware.\n\nDu musst halt gucken, welches Motherboard du hast, das ist eigentlich wichtiger als der Prozessor. Und dann eine zum Motherboard passende Karte für maximal 50 Euro kaufen. Das sollte funktionieren.\n\nNur um das mal zu relativieren: LoL braucht eine Direct X 9.0 fähige Grafikkarte... die gibt es seit 2003... Genau so wie der Pixel-Shader 2.0. Da musste ich erst Mal googlen, was das ist...\nAnders ausgedrückt: Solange Raedeon und GeForce auf der Grafikkarte steht, solltest du keine Probleme bekommen.","replies":[]},{"poster":"Celesil","date":"2017-01-23T11:36:34.931+0000","up_votes":1,"down_votes":1,"body":"Moin,\n\num es kurz zu machen: \nWenn du wirklich **nur **LoL spielst/ spielen möchtest, dann reicht eine GTX 1050 oder auch GTX 1050 ti. Die bekommst du für um die 150 - 180 €, wenn ich mich nicht irre. Natürlich könntest du auch die 1060 nehmen, jedoch ist die schon \"zu viel\" für LoL. Alles über der 1060 ist der absolute Overkill.\nFür die Radeon Varianten gilt das gleiche, nur kenne ich da die Bezeichnungen nicht wirklich aus dem Kopf.\n\n-----\n\nBisschen länger:\nDie 1050 und 1050 ti reicht für LoL, damit du eine konstante Leistung in Hoch - Sehr Hoch hast. LoL ist da .. naja, anspruchslos. Was nur sein könnte, das deine CPU limitiert. Jedoch lässt sich das einfach herausfinden. Wenn du die Grafikeinstellungen (in LoL) gleich belässt und nur die Auflösung runterdrehst und sich dann die FPS erhöht, limitiert die CPU.\nDie CPU könnte limitieren, da die 1050 ti z.B. Riser of the Tomb Raider in full HD auf hohen Einstellungen und SMAA, mit ~ 35 - 40 FPS schafft und das besagte Spiel um ein vielfaches stärkere Leistungen an die Grafikkarte legt, als LoL.\nVor allem ist deine CPU alt. Ich glaub die ist irgendwas um 2008 herausgekommen.\n\nFür andere und vor allem modernere/ aktuellere Spiele ist die 1050/ 1050 ti u. U. zu schwach um ordentlich damit zu spielen. Das liegt u.a. an dem geringen Vram von 2gb.\n\nIch persönlich frage mich eher was für ein Mainboard und vor allem, was für ein Netzteil du hast? Ist das Netzteil ein paar Jahre alt, gilt als Faustformel, direkt austauschen.\nMit einem effizienteren Netzteil lässt sich ein bisschen was sparen und reicht dennoch für aktuelle Hardware aus.\n\n-----\n\nWas ich dir persönlich Rate:\n\nSpare etwas Geld und kaufe dir gleich aktuelle Hardware. \nNicht das du dadurch Strom sparst, auch die Chance das es Probleme mit einem alten Hardwareteil gibt, ist ausgeschlossen. \nHier gäbe es viel, gute und fundierte Hilfe dazu (ein Unterforum von WoW) : https://eu.battle.net/forums/de/wow/topic/17612903498 \n\nMfG\n\nCele","replies":[{"poster":"Gin","date":"2017-01-23T15:30:36.989+0000","up_votes":1,"down_votes":0,"body":"Ergänzend dazu:\n\nIch würde dir empfehlen auf 8Gb RAM zu upgraden. League of Legends zieht jetzt zwar nicht sonderlich viel, aber jeder Rechner den man zum zocken verwendet sollte wenigstens 8Gb haben. Das sollte dann für die meisten \"normalen\" Spiele reichen. Vor allem wenn du nebenbei noch andere Sachen offen hast wie Skype, Chrome/Firefox, Discord stoßen die 4Gb schnell an ihre Grenzen.","replies":[{"poster":"Qbert","date":"2017-09-29T07:58:27.769+0000","up_votes":1,"down_votes":0,"body":"Schon allein Win10 greift sich davon ja 1,5 GB :[","replies":[{"poster":"Gin","date":"2017-09-29T09:17:05.202+0000","up_votes":1,"down_votes":0,"body":"Da hat jemand ja einen echt alten Beitrag gefunden xD\n\nUnd wie kommt man auf einen Beitrag von vor 8 Monaten? Suchst du nach einer Grafikkarte für LoL?\n\n{{sticker:sg-jinx}}","replies":[{"poster":"Qbert","date":"2017-09-29T09:34:49.969+0000","up_votes":1,"down_votes":0,"body":"Der Thread ist aufgeploppt .... und ich versuche generell die Kommentare vorher zu lesen, bevor ich selber einen verfasse ... dabei bin ich über deinen gestolpert und hab nicht auf's Alter geschaut \n{{sticker:sg-lulu}}","replies":[{"poster":"Gin","date":"2017-09-29T09:40:14.717+0000","up_votes":1,"down_votes":0,"body":"Ahh, ich sehe es. Vor 1-2 Stunden gab es weitere Antworten.\n\nHuh, interessant xD","replies":[]}]}]}]}]}]},{"poster":"Pandeonor","date":"2017-09-29T08:58:18.728+0000","up_votes":1,"down_votes":0,"body":"Mein Rat: kaufe Dir eine gebrauchte GTX750 oder GTX750Ti wenn Du den entsprechenden Steckplatz und Platz hast und darauf achtest das Du eine Version ohne extra Stecker erhältst (es gibt die 750er mit und ohne Zusatzstromstecker; sollte Dein Netzteil aber den Zusatzstecker besitzen spricht nichts dagegen. Eine GraKa benötigt nicht mehr Strom durch den Stecker. Ich hatte eine 750Ti hier mit Zusatzstecker welche auch nur so mit 60 Watt TDP angegeben ist. Die ist leider defekt gewesen.).\n\n\nGründe: \n- Du hast m.E. einen alten Rechner und eine GTX1050 könnte u.U. Dein altes Bios überfordern. \n- Eine GTX750/Ti benötigt nur etwa 60Watt und die meisten könnten auf Dein Board passen und das BIOS könnte mit diesen umgehen. Wäre evtl. hilfreich wenn Du Dein Board posten könntest.\n- Der Engpass wird eher Dein Prozessor werden. Das Geld welches eine neue GraKa kostet ist ggfs. besser später in einem anderen System aufgehoben. Die 750Ti reicht für etwa 90 FPS wenn die CPU oder das Board nicht den Engpass darstellen und wird m.E. gebraucht so um 40-50EUR kosten.","replies":[]},{"poster":"sinsiddy","date":"2017-09-29T07:48:25.301+0000","up_votes":1,"down_votes":0,"body":"Wenn es wirklich nur für LoL und ggf. andere eSport Titel reichen muss kannst Du entweder auf die 1050 TI 4GB (ca. 150 Steine) oder wenn es noch etwas günstiger sein muss auf die AMD RX560 4GB (ca. 120 Steine) zurückgreifen. Für LoL reicht ggf. auch die RX 550 2GB (die gibts unter 100). Kannst gerne [hier mal reinschauen](https://www.only4gamers.de/grafikkarten-vergleich/#tab-con-4), da findest Du alle Infos! \n\nIch würde die RX550 prinzipiell nicht unbedingt empfehlen, aber wenn der Geldbeutel knapp ist wohl die einzige Alternative. Wenn Du nen komplett neuen Budget PC bauen willst würde ich Dir folgendes Setup empfehlen:\n\nCPU: Pentium G4560 / I3 7100 / Ryzen 1200\nGPU: GeForce GTX 1050TI\nRam: 8GB Budget Ram (z.B. von Crucial)\nMoBo: je nachdem welche CPU du wählst, einfach eine günstige Variante nehmen, weil du im Budget Bereich eh nicht mit Overclocking etc. hantierst\n\nGehGeh\nsinsiddy","replies":[]},{"poster":"TheGreatTeacher","date":"2017-01-24T19:57:39.240+0000","up_votes":1,"down_votes":0,"body":"hab ne gtx 650 ist etwas alt aber bekomme dennoch 130 fps , mfg","replies":[]},{"poster":"Homunculi","date":"2017-01-23T14:04:07.903+0000","up_votes":1,"down_votes":0,"body":"Da dir die anderen schon so fleißig helfen wäre meine Frage jetzt: was ist eigentlich am Laptop kaputt^^?","replies":[]},{"poster":"ViviD VooiD","date":"2017-01-23T11:16:47.349+0000","up_votes":1,"down_votes":0,"body":"mit einem oem 300 watt netzteil, wirst du keine grafikkarte betreiben koennen, die einen zusaetzlichen stromanschluss erfordert.\n\nhat dein system schon einen pci-e steckplatz? oder wird das noch mit AGP Steckplatz betrieben?\n\nwenn es pci-e hat, ist so etwas \n\nhttp://www.mindfactory.de/Hardware/Grafikkarten+(VGA)/GeForce+GT+fuer+Multimedia/GT+720.html\n\nmoeglich. ich hab mit der vorgaenger version gt620 LoL zocken koennen, aber mit einem intel core i5. somit laesst sich das nicht direkt vergleichen mit deinem e7300\n\nist so das guenstigste, was mir einfaellt.\n\nkannst diese karten aber auch bestimmt auf ebay oder kleinanzeigen.ebay fuer 10 bis 20 euro finden. denk aber dran, dass du keine karte holst, die einen zusaetzlichen stromanschluss benoetigt.\n\n\nansonsten musst du noch in ein netzteil mit mehr leistung investieren. dein jetziges z.b. duerfte einen 6 bis 8 pol connector gar nicht haben\n\nedit: sry hab nur bis zu deinen specs gelesen. das mit dem stromanschluss hast ja schon gewusst^^","replies":[{"poster":"Celesil","date":"2017-01-23T11:48:56.733+0000","up_votes":1,"down_votes":0,"body":"Moin,\n\n> mit einem oem 300 watt netzteil, wirst du keine grafikkarte betreiben koennen, die einen zusaetzlichen stromanschluss erfordert\n\nStimmt so nicht ganz. Eine GTX 1050/ 1050 ti hat nur einen Stromanschluss. Somit wäre dies grundsätzlich kein Problem und da beide Karten das Gesamtsystem auf ~ 150W belasten, reicht das 300W Netzteil locker. Hier habe ich nur die reine Wattzahl des Netzteils betrachtet.\n\n> hat dein system schon einen pci-e steckplatz? oder wird das noch mit AGP Steckplatz betrieben?\n\nDas ist da eher eine wichtige Frage.\nMit einem AGP Steckplatz lässt sich nur eine stark veraltete Technik verbauen.\n\n> ansonsten musst du noch in ein netzteil mit mehr leistung investieren. dein jetziges z.b. duerfte einen 6 bis 8 pol connector gar nicht haben\n\nKommt auf das Netzteil drauf an. Auch alte Netzteile dürften, wenn ich mich nicht irre, einen 6- wie auch 8-Pin Anschluss besitzen. Ein gutes 450W Netzteil reicht derzeit für viele Konfigurationen um eine GTX 1070 um i5 6600 aus. Mit einer i7 und/ oder k CPU eher ein 500W Netzteil nehmen. Kommt eine 1080 dazu, dann eher 550 - 600W.\n\nWas hier eher viel, viel wichtiger wäre. Wenn das Netzteil alt ist, also so grob 2 oder 3 Jahre und mehr, lohnt sich in den meisten Fällen ein Austausch. Dann gibt es jedoch ein weiteres Problem. Wenn ein neues Netzteil gekauft wird, lohnt sich bei solch alten Komponenten (wie der TE beschrieben hat) ein direkter Neukauf eines PC (selbstverständlich als einzelnen Komponenten). \n\nMfG\n\nCele","replies":[{"poster":"ViviD VooiD","date":"2017-01-23T13:35:51.737+0000","up_votes":1,"down_votes":0,"body":"es gibt nur sehr wenige 300watt psu die einen 8pin connector haben.\n\ndieses -> http://www.mindfactory.de/product_info.php/300-Watt-be-quiet--TFX-Power-2-Non-Modular-80--Gold_951171.html\n\nmit gold effizienz hat eines. da kommen dann von den angegebenen 300watt auch ca 270watt raus\n\nreicht fuer low entry karten bestimmt.\n\n\naber bei einem aelteren office pc wuerde ich jetzt so ein mehr oder minder hochwertiges PSU nicht vermuten.\n\nmit einem standard bronze psu hast nur ca 240 echte watt von den angegebenen 300watt auf dem datenblatt. und nicht jedes psu hat diese effizienz klasse\n\n\naber diese diskussion ist hier offtopic, da der TE ja schon angibt, dass er keine karte mit zusaetzlichem stromanschluss sucht\n\nsomit bleibe ich bei meinem vorschlag einer gt730, gt620 oder wie ein anderer hier postete gt610. die sich mit einer 620 durchaus vergleichen laesst http://gpuboss.com/gpus/GeForce-GT-620-vs-GeForce-GT-610\n\nsofern eben ein pci-e anschluss vorhanden ist\n","replies":[]}]}]},{"poster":"Phazôn","date":"2017-01-23T10:06:06.267+0000","up_votes":1,"down_votes":0,"body":"also ich hab ne onboard grafik karte in meinem pc und nur 4 gb ram   und 32bit win 7  und kann lol mit stabilen fps spielen \n\nallerdings spiele ich auf mindest anforderung was die grafi k einstellung angeht xD","replies":[]}]}