{"poster":"Sz1ke","date":"2015-08-26T22:22:02.443+0000","title":"Az új patchről","subforum":"Általános beszélgetés","up_votes":1,"down_votes":17,"body":"Rem&eacute;lem nem haragszik meg senki ha azt mondom, hogy kb ez a LoL t&ouml;r&eacute;nelem legeslegborzaszt&oacute;bb patch-e.\r\nDe komolyan ez minek kellett? Az eddig is op &eacute;s balance-olatlan karaktereket m&eacute;gjobban felerős&iacute;tett&eacute;k. Igaz a Skarnerre r&aacute;f&eacute;rt, de nem ilyen m&oacute;don &eacute;s nem ennyire. Szerintem eddig is teljesen haszn&aacute;lhat&oacute; volt.\r\nEzekkel az &uacute;j itemekkel meg kb ignor&aacute;lt&aacute;k az &ouml;sszes adc-t. A tankok j&oacute;form&aacute;n &ouml;lhetetlenek. Az a h&uuml;lye duma meg amit a patch &eacute;rkez&eacute;sekor &iacute;rtak, hogy &quot;mert a tank semmit nem &eacute;rt &eacute;s hogy hamar meghalt&quot;. Ez komoly? Kinek volt pof&aacute;ja ezt le&iacute;rni?\r\n1: tankot egy &eacute;rtelmes team SOSE f&oacute;kusz&aacute;l elsők&eacute;nt\r\n2: egy t&eacute;nylegesen tankra &eacute;p&iacute;tett, eleve tank karakter nem halt meg eddig se k&ouml;nnyen\r\n3: a tank, az&eacute;rt legyen tank, hogy legyen egy &quot;boxzs&aacute;k&quot; am&iacute;g a t&ouml;bbi DPS!!! karakter elint&eacute;zi a neki tetszőlegest\r\nEz a baj, hogy itt a Riot &uacute;gy &quot;balance-ol&quot;, hogy &ouml;ssze vannak mos&oacute;dva majdnem minden&uuml;tt a szerepek.\r\nA tank legyen sok hp-s, ellen&aacute;ll&aacute;sokkal, alacsony dps-el. Az assassin t&ouml;r&eacute;keny, nagy dps-el, adc szint&eacute;n zen&eacute;sz. stb stb\r\nOlvastam itt adc-knek range n&ouml;velő t&aacute;rgyr&oacute;l. Az is minek? M&eacute;gjobban t&ouml;nkretenni az eg&eacute;sz j&aacute;t&eacute;kot?\r\nAnno bennem is felvetőd&ouml;tt, de &iacute;gy belegondolva egy baroms&aacute;g.\r\n\r\n_OFF\r\nA Garen-ra sem tudom a mai napig, hogy minek kell silence, m&eacute;g ha 0,5 - 1 secig lenne rajtad akkor az m&eacute;g belef&eacute;rne.\r\nNem mondom, hogy a Talon gyenge, de att&oacute;l elveszik ezek meg olyanokat kapnak, hogy mikor olvasom kifolyik a szemem.\r\n&Ouml;ssze-vissza adnak-vesznek el dolgokat. A Leona-n is k&eacute;t stun. Minek? Hogy a 12 &eacute;vesek is &quot;tudjanak valamivel j&aacute;tszani&quot;? Legal&aacute;bb amivel odah&uacute;zza mag&aacute;t az ellenf&eacute;lhez, az ne menne &aacute;t a minionokon. Valami neh&eacute;zs&eacute;ge legyen m&aacute;r... A Lucian passive is. Zero cd, op hat&aacute;s. A Yasuo falnak mi&eacute;rt kell basic attackot lev&eacute;deni &eacute;s mi&eacute;rt v&eacute;d le korl&aacute;tlanul mindent am&iacute;g fenn &aacute;ll?_","replies":[{"poster":"Tetth","date":"2015-08-27T08:29:37.909+0000","up_votes":4,"down_votes":0,"body":"CSAK sírni tudsz. https://www.youtube.com/watch?v=fPGNJEEumfA","replies":[{"poster":"Sz1ke","date":"2015-08-27T12:17:25.274+0000","up_votes":1,"down_votes":0,"body":"Köszönöm!","replies":[]}]},{"poster":"Norb Cena","date":"2015-08-26T22:30:30.515+0000","up_votes":4,"down_votes":0,"body":"Újabb minőségi sz1ke topic.\n(3 másodpercig megfordult a fejemben, hogy megpróbálok veled vitatkozni, de utána eszembe jutottak az eddigi topicjaid, hozzászólásaid.)","replies":[]},{"poster":"panzergodx","date":"2015-08-26T23:08:25.381+0000","up_votes":2,"down_votes":0,"body":"LOL hogy bírtad ki 1 hétig hogy ne nyiss újabb atom %%%%%% topicot?","replies":[{"poster":"Sz1ke","date":"2015-08-27T12:23:25.545+0000","up_votes":1,"down_votes":2,"body":"Volt megint 1 hetes eltiltásom, mert állítólag mindig én személyeskedek és persze nincsenek emberek akik szándékosan kiváltsák ezt egy idő után a másikból. ;)","replies":[{"poster":"Zooty","date":"2015-08-27T15:32:01.872+0000","up_votes":3,"down_votes":0,"body":"Nem csak \"állítólag\".\nTényleg provokatív amit csinálsz, és már rengetegszer lettél figyelmeztetve emiatt..\n\nNem tudom miért akarod folyamatosan az áldozat szerepét eljátszani, viszont ez a magatartás csak ellenszenvet szül minden oldalon.\nÉn most nem ellened akarok beszélni, tényleg abszolút baráti tanácsként írom ezt: Kérlek próbálj nem negatívan hozzáállni mindenhez és mindenkihez, mert ugyanazt fogod visszakapni..","replies":[{"poster":"Sz1ke","date":"2015-08-27T16:54:06.122+0000","up_votes":1,"down_votes":0,"body":"Akkor most leírom és jól figyelj. Tény, hogy ez most lényegében önvédelem lesz, DE! függetlenül attól, hogy cryposztokat írok többségében és semmi szüksége nincs (csak muszáj kiadnom magamból néha a dolgokat), valamint sajnos semmin nem fog változtatni ingame, DE alapvetően a 'síráson' kivül nem bántok itt senkit. Próbálok normálisan válaszolni, és megindokolni egy-egy rossz meccsem (stat stb) miértjét, aminél ha nem is éreznek együtt, de nem kellene egyből jönni a papírforma dumákkal, hogy \" te vagy a noob, meg látatlanban rávágni, hogy szimplán sz4r a farmod, meg sokat haltál, mert annak nagyon sok oka lehet, ráadásul olyan ami nem biztos, hogy az én hibámból adódik.\" Na mármost miután ezeket túlzásba viszik egyesek, és én úgy gondolom, hogy ők viszik át személyeskedő hangneműre a beszélgetést, nem tudom miért csak az tűnik fel, ha a továbbiakban én is hasonlóképpen írok vissza nekik.\nUgye már egyik ilyen posztom sincs meg, így visszanézni nem tudod, de jó volna pártatlanként végignézni egy-egy ilyen témát és nem csak a poszt íróját büntetni, mert igencsak érdekes dolgokat írnak általában mások is, csak azok nem kapnak érte semmit, mert az én írásomra fókuszál mindenki.","replies":[{"poster":"Zooty","date":"2015-08-27T17:34:25.286+0000","up_votes":1,"down_votes":0,"body":">csak muszáj kiadnom magamból néha a dolgokat\n\nHa itt vezeted le a frusztrációdat, akkor ne lepődj meg hogyha ugyanazt kapod vissza..\nÉn abszolút megértem hogyha egy meccs felidegel/frusztrál/lehangol/stb., de ezt ne másokon vezesd le kérlek. Ha egy meccs negatívan hat rád, csak jusson eszedbe hogy ez csupán egy játék, azért játszunk vele, hogy kikapcsolódjunk, és élvezzük azt.\n\n>Próbálok normálisan válaszolni, és megindokolni egy-egy rossz meccsem (stat stb) miértjét\n\nAmikor az ilyenekre \"papírforma dumák\" érkeznek, (téged okolnak) akkor az azért van, mert csak ezzel a filozófiával lehet ebben a játékban feljebb kerülni. Ezt úgy értem, hogy csak is a saját hibáiddal szabad törődnöd. Igen, a csapattársaid is hibáznak, és igen, van olyan meccs, amit teljesen elvesztenek neked. De ha ezzel törődsz, csak frusztrált leszel, és nem fejlődsz semmit!\n\nAbban egyetértek, hogy van amikor nyersen fogalmazzák meg ezt neked mások, és ez nem szép dolog. Próbálj meg ezeken felülemelkedni, és nem visszaírni ugyanebben a stílusban, mert csak szitkozódás lesz belőle. Legyél te a okosabbik fél, aki túlteszi magát ezeken..\n>Ugye már egyik ilyen posztom sincs meg, így visszanézni nem tudod\n\nNekem mint fórumadminnak van rá lehetőségem hogy a törölt posztokat is lássam. Párat magam töröltem (ezt onnan láthatod, hogy a törlési üzeneteket mindig aláírom). Amúgy meg pont azért töröltem az egész témát, és nem csak amit te írtál, mert ezt tartottam a legpártatlanabb megoldásnak. Viszont ettől függetlenül amiket fent írtam még mindig állnak. Kérlek próbáld meg magad túltenni a játék és a kommentek általi frusztráción, mert nagyon károsak mind neked, mind a fórumos közösségnek. Hidd el, még a játékosteljesítményedet is pozitívan fogja befolyásolni! :)","replies":[{"poster":"Sz1ke","date":"2015-08-27T18:10:05.389+0000","up_votes":1,"down_votes":0,"body":"\"Amúgy meg pont azért töröltem az egész témát, és nem csak amit te írtál, mert ezt tartottam a legpártatlanabb megoldásnak.\"\nIgen, de büntetést feltételezem csak én kaptam, pedig nem én voltam az egyetlen aki nem megfelelően viselkedett.\nAmúgy elég sokszor egy ponton túl én is inkább kitöröltem elég sok témámat, mert nem láttam értelmét elérhetőnek hagyni.","replies":[{"poster":"panzergodx","date":"2015-08-27T19:07:08.824+0000","up_votes":2,"down_votes":0,"body":"jó lenne ha eleve meg se nyitnád őket","replies":[{"poster":"Sz1ke","date":"2015-08-27T19:16:35.226+0000","up_votes":1,"down_votes":1,"body":"Jó lenne ha nem járnál a posztjaimhoz ugatni. :)","replies":[{"poster":"oroszlan15","date":"2015-08-28T12:28:48.786+0000","up_votes":1,"down_votes":0,"body":"még egy teljesen barátságos hozzá szólás és 10 percnyi 5csillagos vicc","replies":[{"poster":"Sz1ke","date":"2015-08-28T17:04:02.339+0000","up_votes":1,"down_votes":0,"body":"Ez nem vicc és szimplán csak annyit jelent, hogy ha tudja hogy (szerinte) csak állandóan cryposztokat nyitok, akkor nem köteles elolvasni.","replies":[{"poster":"oroszlan15","date":"2015-08-31T20:04:56.679+0000","up_votes":1,"down_votes":0,"body":"mert így is van","replies":[]}]}]}]}]}]},{"poster":"Norb Cena","date":"2015-08-27T22:13:30.913+0000","up_votes":1,"down_votes":0,"body":"Csodálom a lelkierődet és a toleranciádat, amivel ezt és az ehhez hasonló gyerekeket kezeled. Megmondom őszintén - bár látszik is a hozzászólásaimon - én már sajnos hiányában vagyok ezeknek az értékeknek, mondjuk nem is lennék moderátor semmi pénzért. \nOké, ha Pistike kikap egy meccsen és feljön egy QQ topicot nyitni ahol elmondják neki, hogy nyugodjon le, ez csak egy játék, fókuszáljon a saját hibáira etc. De amikor Pistike heti 4 QQ topicot nyit ugyan arról, amiben ugyan azt a  Dunning-Kruger effect-től bűzlő sz@rt darálja, számomra (és még sok más fórumozónak) nem elviselhető.","replies":[{"poster":"Sz1ke","date":"2015-08-28T17:06:19.290+0000","up_votes":1,"down_votes":0,"body":"Leírom egy topicon belül másodjára is neked. Nem kötelező elolvasni. Meglátod a nevemet, 'skip' és már nincs is gondod.","replies":[]}]},{"poster":"Sz1ke","date":"2015-08-27T21:02:35.780+0000","up_votes":1,"down_votes":1,"body":"\"Ha egy meccs negatívan hat rád, csak jusson eszedbe hogy ez csupán egy játék, azért játszunk vele, hogy kikapcsolódjunk, és élvezzük azt.\"\nSajnos nem tudom élvezni azt a meccset ahol \"simán\" nyerhetnénk, de kikapunk, mert 10x-i leírás után sem hajlandóak együtt mozogni és használni a malphite+varus+katarina ulti kombót ami kb instant megölné a team felét. Kb mindenki solozik, az adc-nk úgy szerencsétlenkedi ki a segítségemmel a 2 killjét, az enemy blitz meg 10/10 hookot ront még 5 centiről is, és ilyenek ellen kapunk ki.\nÉn küzdenék a Gold 5ért, ezek meg mint ha most kezdték volna, úgy játszanak.\nArról nem is beszélve, hogy meccs vége előtt pont kapok egy bugsplatet, így \"feed\" helyett, leavért is reportolhatnak, illetve nem tudom reportolni őket.","replies":[{"poster":"Zooty","date":"2015-08-27T22:02:58.527+0000","up_votes":1,"down_votes":0,"body":"> Sajnos nem tudom élvezni azt a meccset ahol..\n\nPedig ez egy nagy gond. Meg kell tanulnod szimplán élvezni a játékot attól függetlenül hogy nyerés vagy vesztés lesz a vége. \nLátom silver 1-be vagy, és ott lebeg előtted a gold és a szezon végi jutalmak.. Azt tanácsolom hogy ennek ellenére felejtsd el hogy egyáltalán rankeden vagy. Ne LP-ért játssz, hanem csak úgy.. játssz. Ugyanis hogyha a győzelemért játszol csak, akkor elizgulod a játékot, és az érzelmeid negatívan fogják befolyásolni azt. (ezt próbálod levezetni itt a fórumon szvsz..)\n\nItt egy videó, ami ha nem is pont erről szól, de kitér erre is. Szerintem nagyon tanulságos, ajánlom figyelmedbe. (viszont angol nyelvű)\nhttps://www.youtube.com/watch?v=Vny-dT8dxQI\n\n\nÉs ne feledd, *\"néha nyersz, néha pedig tanulsz\"*!","replies":[]}]}]}]}]},{"poster":"panzergodx","date":"2015-08-27T12:38:22.971+0000","up_votes":1,"down_votes":0,"body":"te magad váltod ki az emberekből az ellenszenvet a 2 naponta megjelenő tard topicjaiddal meg cryaiddal, és mikor már 1 topicodból bebizonyosodik hogy ennél nagyobb hülye nem lehetsz, nyitsz 1 következőt ami bebizonyítja hogy de, lehet valaki ennél is butább, te is azon a szinten vagy mint minden low elos: van ez a játék qwerdf-et kell nyomogatni meg klikkelgetni a mapon és majd lesz valami, és mikor loseolsz feljössz ide nyitsz egy topicot ami tele van a sírásoddal mert abszolút fogalmad nincs a gameről és hogy abba mi miért történik, és ez már rohadtul felpumpálja egy két ember agyát","replies":[{"poster":"Nemin","date":"2015-08-28T07:47:45.018+0000","up_votes":2,"down_votes":0,"body":"Ácsi, vannak (például én is ) olyanok, akik próbálják komolyan venni a játékot silver/bronze-ban! \nÉs nem úgy vesszük, hogy \"qwerdf\" meg klikkelgetni a mappon, lehet neked jó tehetséget és jó csapatokat osztott a Jóisten, de semmi jogod, hogy magas lóról beszélj velünk!\n\nA topic nyitójával kapcsolatban, meg el kell tűrni az ilyet, én is baromira utálom, ha idejön egy ilyen tirpák gyerek és osztja nekünk az észt, de, ha neki ettől jó, hát istenem csinálja, csak ne heti négyet.","replies":[{"poster":"panzergodx","date":"2015-08-28T09:43:12.863+0000","up_votes":1,"down_votes":0,"body":"de az a baj h a tag heti 4 ilyen topicot nyit, ha jól számolom holnap jön a következő amibe kitalálja hogy nerfelni kéne a zed shadowját mer nem lehet gankelni mer mindig elugrik és ezért kap ki folyton a zedektől, vagy valami hasonló %%%%ságot","replies":[{"poster":"Sz1ke","date":"2015-08-28T17:03:04.750+0000","up_votes":1,"down_votes":0,"body":"Köszönöm, hogy mondtál valami újat, amitől jobb játékos lehetek, mint te és köszönöm a statisztikai értékeket is. Ebből látszik, hogy szeretsz, ezért nyomon követed a dolgaimat. ^^","replies":[]}]}]},{"poster":"Sz1ke","date":"2015-08-27T12:50:57.623+0000","up_votes":1,"down_votes":0,"body":"Örülök, hogy mindenki tisztában van azzal, hogy mennyit tudok a játékról.","replies":[{"poster":"panzergodx","date":"2015-08-27T13:05:20.113+0000","up_votes":1,"down_votes":0,"body":"a topicjaid alapján tisztán lejön.","replies":[{"poster":"Sz1ke","date":"2015-08-27T14:04:41.092+0000","up_votes":1,"down_votes":0,"body":"Örülök, hogy ilyen jó elemző képességekkel bírsz.\nMúltkor is volt valami IQ huszár aki benyögte, hogy nem csodálkozik ha a suppom a jungelben mászkál, mert ő is inkább ezt tette volna, ha (ő szerinte) az adc-nek (én) rossz a farmja és meghal. \nCsak a drágalátos okos elméjű barátunk nem tud mondatot értelmezni és nem esett le neki, hogy az a \"supp\", eleve LE SEM JÖTT mellém, és 1v2-ztem. Úgy gondolom ilyen esetben nem meglepő a rosszabb farm és az esetleges 1-2 halál.","replies":[{"poster":"Norb Cena","date":"2015-08-27T21:59:02.903+0000","up_votes":1,"down_votes":0,"body":"Én voltam az az \"okos elméjű\" aki ezt írta miután annyit írtál, hogy \" a supportom elment rohangálni\". Szóval lehet hogy neked kéne megtanulni fogalmazni - bár nálunk anno. általános felsőben volt fogalmazás óra 2 évig, lehet hogy ha majd te is eljutsz oda akkor megtanulsz értelmes szöveget írni.","replies":[{"poster":"Sz1ke","date":"2015-08-28T16:56:16.428+0000","up_votes":1,"down_votes":0,"body":"Én mindig is jó voltam értő olvasásból, úgyhogy nem tudok vele mit tenni ha más számára nem volt érhető az a mondatom, csak azért mert nem részleteztem az utolsó fűszálig.","replies":[]}]}]}]}]}]}]}]},{"poster":"Vasipari Béla","date":"2015-08-27T13:55:32.204+0000","up_votes":3,"down_votes":0,"body":"Yasuo fal miért véd, Zed miért sebez, Sion miért beton, Evelynn miért láthatatlan, Ekko miért tud ugrálni??? OMG NERFELJÉK AZ ÖSSZES HŐST!!! AZ ÖSSZES HŐS TÚLSÁGOSAN OP!!!","replies":[{"poster":"Sz1ke","date":"2015-08-27T14:00:44.221+0000","up_votes":1,"down_votes":0,"body":"Köszönjük a jól betanult, \"értelmes\" és általánosító kommentet.","replies":[{"poster":"Brăd","date":"2015-08-27T16:31:26.866+0000","up_votes":1,"down_votes":0,"body":"Ez nem általánosítás volt ,tekintve ,hogy konkrétan ugyanezt csinálod.","replies":[{"poster":"oroszlan15","date":"2015-08-28T12:34:03.053+0000","up_votes":1,"down_votes":0,"body":"pontosan","replies":[]}]}]}]},{"poster":"Brăd","date":"2015-08-26T23:26:10.799+0000","up_votes":3,"down_votes":0,"body":"Csatlakoznék az előttem szólóhoz. Általában a posztjaid értelmetlenek és nem szólnak semmiről. A Riot-nak megvan a maga kis terve és valószínűleg jó okkal változtattak a Juggernaut-okon ,tekintve ,hogy high ELO-n általában igen ritka pickek voltak ,tekintve ,hogy vagy dmg-re ,vagy deffenzivitásra kellett velük menni ,mert lategame-re nem értek semmit.\nCsak ,hogy tudd:\nA Riot ezeket a buffokat azoknak a játékosoknak szánja ,akik értik is a játékot. Tegyük fel ,bronzban lehet ,hogy Darius ellen nem lehet semmit se kezdeni ,mert lanebully ,ellenben egy normális játékos érti ,hogy hogyan kéne és mit csinálnia.\nMi az ,hogy \"ignorálták az összes adc-t\"? Tudod ,nem csak egyfajta adc van a játékban. Van pl. a tipikus Tank Destroyer ,mint Vayne ,van splitpusher ,mint Tristana ,van Lategame-es Teamfight adc ,mint Twitch etc... \n\nTovábbá:\nGarennak azért kell silence ,hogy Garen lehessen. A champion lényege a folyamatos peeling és irritáció ,a silence-re azért van szüksége ,hogy a kiszemelt áldozat kisebb esélyel meneküljön meg.\n\n\"Nem mondom, hogy a Talon gyenge, de attól elveszik ezek meg olyanokat kapnak, hogy mikor olvasom kifolyik a szemem.\"\nMit vesznek el? Mit kapnak? Hol van a tárgy a mondatból?\n\nLeona:\n1. Először is 3 stunja van.\n2. Tipikus kezdeményező champ ,lényege ,hogy bemegy a fightba és all in. Könnyedén ellehetetleníthető ,ha távol tartjuk a carry-től (support feladata)\n3. Egy alapvető support ,akivel könnyű megtanulni játszani. Rengeteg kezdő játszik vele ,ennek köszönhetően ,viszont magasabb ELO-kon tudnak is az emberek ellene játszani.\n\nNem értem mi lenne a probléma a Lucian passzívval? Earlyben a spellek rengeteg manát igényelnek az aktiválásához ,lategame-re meg nagyon hasznos ,mivel kisebb a range-e jópár adc-nél ,így a passzív segítségével is képes kiadni magából egy rendes adc sebzését.\n\nA Yasuo falnak az a lényege ,hogy a ranged championöket ,mint az adc ellehetetlenítse. Eredetileg Yasuo bruisernek készült és a faljának köszönhetően lényege az lett volna ,hogy az adc-t zavarja ,viszont nekiálltak vele ,úgy játszani ,mint egy assassin ,ennélfogva rövid úton bruiserből mobilis assassin lett.","replies":[{"poster":"YiJaegar","date":"2015-08-27T07:24:37.530+0000","up_votes":1,"down_votes":0,"body":"> 1. Először is 3 stunja van.\n\nCsak 2 stunja van a Q és az ult középső része, az E csak enyhén root-tol (0,2 secre kb még oda húzod magad addig).","replies":[{"poster":"Brăd","date":"2015-08-27T10:16:38.396+0000","up_votes":1,"down_votes":0,"body":"Furcsa mód nálam többször is előfordult ,hogy channel-eket Leona E-vel szakítottam meg (pl.: teleport).","replies":[{"poster":"YiJaegar","date":"2015-08-30T07:16:09.499+0000","up_votes":1,"down_votes":0,"body":"Az azért van mert már úgy 1 éve a tp-t beszakítják a rootok is (mivel az ugy mond helyváltoztatás), de ha megnézed kata ultot nem szakítja be vagy malza ultot.","replies":[]}]}]},{"poster":"Sz1ke","date":"2015-08-27T12:20:45.370+0000","up_votes":1,"down_votes":1,"body":"Lucian alap range lehet kicsi de az össze többi spellje a fél pályán átér.\nYasuo-ból csak a tankosság hiányzik, amúgy kb minden megvan benne, úgy túlontúl op még a fala nélkül is.","replies":[]}]},{"poster":"HΣLIΘS","date":"2015-08-29T07:47:03.529+0000","up_votes":1,"down_votes":0,"body":"S4 már jócskán ment mikor én jöttem. Morgana eléggé tetszik nekem, és jó lett volna rá a Victorious skin, de nem kezdtem rankedezni, 1 részt mert kitudja kijutnék e egyáltalán bronze ból, másrészt meg gold ig hosszú az út. Pláne ha az ember kezdő :'DDD Mivel vágytam rá, de tudtam hogy esélytelen megszerezni, megvettem Ghost Bride Morgana t, és megvan az öröm :D Érthetetlen számomra mért kell ilyen komolyan venned a játékot, de ha ez tesz boldoggá, hajrá ;) Ha nem így fognád fel, jól szórakozhatnál.","replies":[{"poster":"Sz1ke","date":"2015-08-29T09:29:32.649+0000","up_votes":1,"down_votes":0,"body":"Mivel tudtommal itt nincs privát üzenet küldésének lehetősége így még csak egy skype elérhetőséget sem adok meg, hogy elmondjam a legfőbb okát.\nAmúgy nekem is tetszik a Ghost Bride Morgana, de azért a Victorious mégiscsak limitált és nem is rossz az sem.\nSzórakoztatna engem a játék a lose-ok ellenére is, ha úgy kapnék ki, hogy nem azt látom, hogy a fixen nyerhetőt a makacssága miatt eldobja a team. Amúgymeg úgy volna az igazi ha mindkét csapat kiegyenlített küzdelem mellett veszítene vagy nyerne.","replies":[]}]},{"poster":"HΣLIΘS","date":"2015-08-28T21:08:28.159+0000","up_votes":1,"down_votes":0,"body":"Hogy mondjak egy példát, alap 90 AD val kezd, meg ami szintelve jön, max 200 tegyük fel, mire megvan az Infi és a Statikk. Ez max 280 AD, kritje (-20 passzív miatt) kb 600 DMG lehet(ne), ha nem lenne alap páncélja az ADC nek, ami kb 50 körül minimum lehet late game ra, szóval az 1500 HP s ADC t folytonos Crit találat mellett sem tudom elképzelni hogy 2 spellből feküdjön, azt nem is nézve, hogy egy hasonló buildje azért neki is akad. Azt szintén figyelmen kívül hagyva, hogy míg ezt a 2 alap itemet meg is veszi Yasuo, milyen a statja vagy a farmja. hagyták e farmolni, vagy akadályozták, van e killje, vagy csak ő feedel? Simán megvette e ezt a 2 itemet, vagy épp hogy late re kiszenvedte? Sok kérdés van itt, sokmindenen múlik az egész. Hadd mondjak neked valamit. Itt nem kötekedés van vagy pofázás, de mért veszed ilyen komolyan a játékot? És akkor? Ez van. Most is úgy hagyom itt a gépet hogy utolsó két meccsem bukás, de nem verem a fejem a falba. megtettem ami tőlem telik, próbáltam tenni a győzelemért, ez van, nem lehet mindig nyerni. Majd holnap lehet revenge t venni. Ilyen a játék értsd meg, ahhoz hogy te nyerhess, valakinek buknia is kell, és nem lehetsz mindig a nyertes szerepében. Nekem is volt már, hogy nem rajtam múlott, hanem úgymond az useless team en az a bukás amit elszenvedtünk, mert tankként hiába könyörögtem nekik mikor beugrottam a team fight ba, hogy jöjjenek és öljenek, mire várnak.. Semmit nem tettek, full hp n a turret alatt álltak. Engem alig karcoltak, de mégis elbuktuk. 0 DMG vel én tudtam jóformán killt kapni, pedig csak be kellett volna szedniük, de mégis inkább a háttérben vártak. Megesik a rossz csapat, a rossz nap, a rossz meccs, de ez már csak ilyen. Nem kellene folyton sírni, senki nem tud neked segíteni. Vagy azt várod hogy boostoljanak minimum Goldig? Gondolj át mindent, miként lehetnél te magad is jobb hogy megnyerhesd a meccset. Nem elég killelni és ha a team ed szar, akkor leszólni őket. Segíts nekik, nem 1v5 ben fogsz nyerni, hanem csapatmunkával.","replies":[{"poster":"Sz1ke","date":"2015-08-28T21:23:11.464+0000","up_votes":1,"down_votes":0,"body":"Nem várok senkitől boostot. Nem vagyok 1v5 típus, de néha azért megesik, hogy mégis ilyen helyzetben találom magam. Tudom, hogy nem lehet mindent megnyerni, de amin látom, hogy egyértelmű win volna, ha együtt mennénk, fókuszálnánk és be volna védve az adc-nk, azt nem szeretem elbukni.\n\nHogy miért veszem olyan komolyan a játékot? Ezt nem fogom neked megmondani teljesen őszintén és a fő okot kifejtve, mert nem vágyom a fikázók hadára, de maradjunk annyiban, hogy azért, mert azért járok rankedra, hogy feljebb jussak, ha nem ez volna a célom akkor normaloznék, ott kevésbé érdekel a win. Ez a 3. szezon ha jól emlékszek amióta játszok, így szeretném már végre legalább a Goldot megszerezni, és nem titok, hogy a szezonvégi jutalmak is motiválnak. Valószínűleg nem az egyik main-emre jön majd Victorious skin, de ha mégis, és nem tudom megszerezni, akkor 'egy világ dől majd össze bennem'.","replies":[]}]},{"poster":"HΣLIΘS","date":"2015-08-27T21:17:43.932+0000","up_votes":1,"down_votes":0,"body":"Yasuo fala 4 sec ig tart ki, és helyhez kötött, namost ha futkos rajta körül, akkor defensive ben tolja, ha \"csúszik\" és Q akkor már offensive és könnyű célpont, pláne hogy az ADC közelébe kell férkőzzön a maga kis Range jével, míg az ADC már minimum 500-600 as Range ből fókuszálhatja, az a Q és \"meghaltál\" nem épp így működik. Irdatlan nagy feed kell, hogy E-Q és a célpont meghaljon. Az viszont már a team ed hibája lenne... Early ben kell fókuszálni, amíg gyenge, így late ben nem lesz E-Q = insta kill. Kétlem hogy önerőből odamegy és szétcsap akárkit, csak mert olyan nagyon OP, győzelem vagy vereség nem egy emberen múlik, hanem a csapaton, bár a team kb annyira erős akár a két leggyengébb láncszem, mert hiába van 3 kemény verőlegény, ha 2 feedelni jár, az enemy nyer. Nagy szerencse és tudás kellene ahhoz hogy 3 an hozzanak le egy olyan felállást, amiben ugyanolyan erős emberből van 5 az enemy nél. Mellesleg ha az enemy olyan szar, ahogyan írtad, nem értem miért ne lehetne lehozni? Ha megérdemled a minimum G5 öt, akkor azt a 10/10 bad hook os Blitz et simán szétszeded és ezáltal kapod a feedet. Nem csak azt kell nézni hogy a te statod jó legyen, ne a lane d nyerd meg hanem a meccset, mellesleg vereség a győzelemmel kéz a kézben jár, nem lehet mindig nyerni.","replies":[{"poster":"Sz1ke","date":"2015-08-28T16:53:05.015+0000","up_votes":1,"down_votes":1,"body":"Late gameről van szó és mivel tegyük fel van a Yasuonak egy Infinity meg egy Statikk, mert úgy gondolom ez alap mindenkinél. Az rengeteg crit és dmg is van annyi, hogy egy átlag 1500 hp-s adc-t megöljön 2 skillből, főleg ha betalál a Q.\n\nÉn Janna-ztam. Egy feedes supp azért nem ér annyit, mint egy feedes ADC. A Varus-t amennyire tudtam segítettem, elején is csak kiszenvedte a közreműködésemmel a double killt. Amúgy szegény irdatlan bamba volt. Isteni szerencséje volt, hogy ilyen rossz volt a Blitz, mert amúgy 10/10 berántotta volna, mivel nagyon esetlenül mozgolódott és rossz volt a reakcióideje.\n\nNem lehet mindig nyerni, de ez egy nagyon könnyű meccs lett volna, ha azt csinálják amit kérek tőlük. Azaz egymásután használni a 3 ultit és TEAMFIGHTOLNI, amit hiáb írtam le 5x és pingeltem folyamatosan, nem voltak képesek felfogni, pedig látták, hogy ha 3 lane-re szakadunk SEMMIT nem érünk.","replies":[]}]},{"poster":"HΣLIΘS","date":"2015-08-27T18:47:13.370+0000","up_votes":1,"down_votes":0,"body":"Ácsi már, értem én mit akarsz, de én azt mondom, jól van ez így, hidd el.\n1. Mire belekötni Lucian ba? Egy olyan low-range s ADC vé tették, hogy besz@rok, az a passzív igenis kell neki, és hogy felhasználja, kell oda spell is. Ami egyrészt MANA igényes, early ben nem is kicsit, másrészt közelsem megy át a \"fél pályán\", Lucian hoz állandó fürgeség kell, oda kell rá figyelni, nem csak esztelenül futkosni, spellezni, merthogy milyen jó a passzívja... Jól van így ahogy van, bár én sajnálom azt az orbitális CD t az ultiján, annak ellenére hogy a sebzése inkább szörnyek ellen jó (belopni egy Dragont/Baront), vagy utolérni egy LOW-HP st.\nYasuo nak azt hiszed minden basic attack ra vagy felé irányuló spellre ki lehet vetni a Szélfalat? Remélem tudod hogy elég nagy CD van rajta, és ezáltal early ben nem is ér túl sokat, arról nem beszélve hogy milyen keskeny early ben, szerintem egyáltalán nem OP, jó reflexek kellenek a helyes használatához. \nTudom, most mit pofázik egy unranked, de bakker, megvannak a champ ek, tudom jól melyik mit ér, egyiken sem érzem azt hogy az általad felvázolt tulajdonságaik miatt olyan qrva OP k lennének, nem úgy megy az hogy beugrok 1v5 ben és odateszem magam istenesen. Hidd el, baromi sokan csak feedelni tudnak vele, én nem sok emberrel találkoztam aki igazán jól kezelné őket, szóval kétlem hogy bármit is változtatni kellene rajtuk, a módosított tankokról nem is beszélve.\nSkarner tényleg elég kemény lett, de pl Darius akármilyen buff ot is kapott, a nerf ből is jutott neki rendesen, gondolj bele, Q nem aktiválja a passzívot, sőt olyan low-dmg s lett, a késleltetett aktiválás mellett, hogy tényleg csak a HP zásra jó, sebezni talán late ben tudna vele észrevehetően. W ből kiszedték a jó kis CDR t, nem 200% ot sebez, csupán 140% ot, passzívnak kevesebb a sebzése, aminek örülhet az az ulti buff ja.\nMost értem én hogy felborult a rend, az a megszokott játékmenet amit az adott champ ekkel toltak, de nem kell ilyen szarul felfogni, alkalmazkodni kell hozzá, a balance változtatások mindig is voltak és lesznek is, ehhez is hozzá kell szokni, ez van.","replies":[{"poster":"Sz1ke","date":"2015-08-27T19:15:40.460+0000","up_votes":1,"down_votes":1,"body":"A Yasuo annak ellenére hogy nagyon op, jól használni tényleg nem könnyű. Ennek ellenére soká van fent a fala és azidő alatt korlátlanul levéd mindent. Egy adc-t ellehetetlenít, mert ahogy forog a fal körül még ha hosszában van se tudod meglőni, neki eközben visszajön a csúszás, q és meghaltál.","replies":[]}]},{"poster":"Tazsam","date":"2015-08-27T06:59:04.499+0000","up_votes":1,"down_votes":0,"body":"Az összes tank elég komolyan nerfelve lett ezzel a patchel kedves sz1ke. Erre te kijelented, hogy ölhetetlenek?\nNézd meg a patch note végén az itemeket, gyakorlatilag minden tankos item vagy drágább lett és/vagy csökkentettek a statjain. Nekem pont az a problémám, hogy nagyon sokat buktak a tankok ezzel a patchel, összehasonlításként amikor a patch kijött gold 3 voltam most gold 5 0lp körül tanyázom és én jórészt csak tankokat játszom.\nSzóval te valamit nagyon félreolvastál.","replies":[{"poster":"Sz1ke","date":"2015-08-27T12:29:23.458+0000","up_votes":1,"down_votes":0,"body":"Szerintem meg az új itemekkel kombinálva erősebbek lettek. Ahol Skarnerek quadráznak és társaik, ott szerintem nem beszélhetünk gyengítésről.\nÉn se bírom sose megszerezni a Gold5-öt. 70 pont környékéről 0-án vagyok megint és ez nem a karakterek miatt van, hanem mert röhejes, hogy mennyire nem tudnak az emberek együttműködni.\n(Most pedig gyerünk gyorsan és nézzük meg, hogy az utolsó 4 meccsemen milyen atom feedjeim voltak. Az okok nem lényegesek, csak az, hogy ott egy 0-9es Vayne meccs és tuti Bronze 10-es a gyerek és még ennek ellenére panaszkodik, hogy Silverben van.)\n\nA fórumot böngészve pont kapóra jött.\nhttp://matchhistory.eune.leagueoflegends.com/hu/#match-history/EUW1/204585506\nCsak úgy nagyjából nézd át a Garen meccseit és azután is azt mondd, hogy gyenge a változtatással és az új itemekkel.","replies":[{"poster":"Tazsam","date":"2015-08-27T12:54:45.917+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sz1ke,realm=EUNE,application-id=VFnq5EbB,discussion-id=p5AyUqtA,comment-id=00040000,timestamp=2015-08-27T12:29:23.458+0000)\n>\n> Szerintem meg az új itemekkel kombinálva erősebbek lettek. Ahol Skarnerek quadráznak és társaik, ott szerintem nem beszélhetünk gyengítésről.\n> Én se bírom sose megszerezni a Gold5-öt. 70 pont környékéről 0-án vagyok megint és ez nem a karakterek miatt van, hanem mert röhejes, hogy mennyire nem tudnak az emberek együttműködni.\n> (Most pedig gyerünk gyorsan és nézzük meg, hogy az utolsó 4 meccsemen milyen atom feedjeim voltak. Az okok nem lényegesek, csak az, hogy ott egy 0-9es Vayne meccs és tuti Bronze 10-es a gyerek és még ennek ellenére panaszkodik, hogy Silverben van.)\n> \n> A fórumot böngészve pont kapóra jött.\n> http://matchhistory.eune.leagueoflegends.com/hu/#match-history/EUW1/204585506\n> Csak úgy nagyjából nézd át a Garen meccseit és azután is azt mondd, hogy gyenge a változtatással és az új itemekkel.\n\nLinkeltél egy match historyt ahol garent játszották harcosnak, van a srácnak összesen 1.5 tank iteme. Ez egyáltalán nem tank, ez egy tipikus bulldozer és mint ilyen simán elpusztítható, épp csak egy paraszthajszál választja el egy átlagos papír karitól, na meg a W-je de ha minden képességet abba a 2-6 másodpercbe sűrítetek amíg a W aktív akkor persze, hogy nem tudjátok felrobbantani.","replies":[{"poster":"Sz1ke","date":"2015-08-27T13:59:36.814+0000","up_votes":1,"down_votes":0,"body":"Csakhogy a Garen és a Darius régóta pont az a karakter ami tank itemmel is darál és dps itemekkel is tankos.","replies":[{"poster":"Tazsam","date":"2015-08-27T16:31:27.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sz1ke,realm=EUNE,application-id=VFnq5EbB,discussion-id=p5AyUqtA,comment-id=0004000000000000,timestamp=2015-08-27T13:59:36.814+0000)\n>\n> Csakhogy a Garen és a Darius régóta pont az a karakter ami tank itemmel is darál és dps itemekkel is tankos.\n\nugyan miért darálna egy full tank darius vagy garen? \nGaren Q,E adből skálázódik emlékeim szerint 40% körül, az ulti a hiányzó hpből de nem gondolnám, hogy darálásnak lehet hívni ha valaki 80 secenként meg tud ölni 1 db 1/5. hp-s hőst, márpedig full tank itemekkel ennyire fog darálni.\nDarius Q 50-70% ad, W 40% ad, R 75% ad, ha ehhez nem építesz ad itemeket akkor el is felejtheted a karaktert, majd jól oda fog tudni húzni magához valaki 24-12 secenként és ennyi, persze az ult true dmg itt is jelentős ad nélkül is, de az megintcsak 80 secenként él, kivéve ha körülveszi őt 5 db 20%-hps enemy.","replies":[]}]}]}]}]},{"poster":"Zooty","date":"2015-08-26T23:10:31.826+0000","up_votes":1,"down_votes":0,"body":"Ha rework-ölnek egy hőst, akkor azt nem azért csinálják hogy buffoljanak vagy nerfeljenek rajta. Amikor valaki olyan állapotban van, hogy nem tudják pár stat módosításával kiegyensúlyozni, akkor kap teljes átdolgozást, hogy balanszolható állapotba kerüljön az adott hős..\nHa ez megtörtént, csak utána lehet játszani a számokkal kiegyensúlyozás céljából.\nValami hasonlót kell elképzelni, ha új tárgy jön be a játékba..\n\nSkarner valóban erősebb lett a kelleténél, de ez nem azt jelenti hogy az átdolgozás megbukott, ugyanis pár szám módosításával kiegyensúlyozottá tehető..\nÉs ha már Skarnernél tartunk, idő előtt kihoztak egy hotfixet, melyben Skarnert és Dariust rakják helyre:\n\n> **Skarner:**\nBase MS lowered to 335 from 345\nBase AD lowered to 57 from 61\nW shield lowered to 10/11/12/13/14% from 12/13/14/15/16%\nE damage lowered to 40/65/90/115/140 + 25/35/45/55/65 from 40/75/110/145/180 + 25/50/75/100/125\nE cooldown increased to 14/13.5/13/12.5/12 from 13/12.5/12/11.5/11\n**Darius:**\nQ damage increased to 40/70/100/130/160 from 20/40/60/80/100\n(Q heal increased to 15% of missing health per enemy champion hit) Still 10%. \n\nEzek a változtatások elméletileg mától már az élő szervereken is jelen van!","replies":[]}]}