{"poster":"Typhoid Mary","date":"2020-01-07T15:55:30.861+0000","title":"Fundraiser for Australia","subforum":"Miscellaneous","up_votes":33,"down_votes":1,"body":"Hiya, just here to echo ChunkyBeef2, can we please bring back Ocean week or put skins on sale and donate proceeds or do something insane like change all the infernal skins to firefighters just even for a day globally, postergirl the heck out of firefighter Tristana. It would be super cool and super appreciated if Riot could help out not only the players who have undoubtedly been affected by the fires but the land down under itself. Riot please send any help you can, allow those who can not help by themselves to help as a community.\n\nEdit: please upvote or comment support to increase chance of a dev or someone able to do something seeing this &lt;3","replies":[{"poster":"Gehirn","date":"2020-01-10T05:35:30.311+0000","up_votes":3,"down_votes":1,"body":"Hi Everyone,\n\nAppreciate everyone's concern for bushfire relief. This is something that actually matters in the grand scheme of things and, personally, I wish people looking out for the welfare of others and the environment could be so front of mind and such a priority for all of us more often. We still come together in times of crisis, at least.\n\nWith my own semi-political rant out of the way, I can say that we are already investigating having bushfire relief as one of the causes to receive the proceeds from the Dawnbringer Karma skin.\n\nFor those who're unaware, Dawnbringer Karma was released in December and 100% of proceeds from this skin and specific related content will be set aside for charity. In the coming months, players will get the option to vote for where they want these proceeds to go and we're aiming to have Australian bushfire relief to be among the voting options in OCE. The skin and related content is available for purchase until January 14th 07:00 AEDT, so if you'd like to contribute then consider purchasing the skin and/or the related content and be sure to vote for the cause you most support when voting opens in the client.\n\n[See the original news post](https://oce.leagueoflegends.com/en/news/champions-skins/creative-spotlight/dawnbringer-karma-charity-skin) for more details on what additional content purchases will go towards this charity fund.\nGiving players the option to direct some of these funds to bushfire relief _is a priority for us that we are trying to make happen_, but I shouldn't promise it will happen on behalf of those Rioters who actually have to make it happen. So just know we'll do our best to make it so.\n\nIn addition to this, Kushnood recently mentioned on [a related Reddit post](https://www.reddit.com/r/leagueoflegends/comments/ekhn1s/firefighter_tristana_for_australia_wildfires/fddzqf0/?context=10000) that we're currently in contact with the International Medical Corps to find out how Riot can offer support, and also touched on the complications involved with putting an item on sale for charity as a reactive measure.","replies":[]},{"poster":"BSV Josh","date":"2020-01-08T00:10:14.708+0000","up_votes":7,"down_votes":0,"body":"As a firefighter myself, this is a great idea and definitely one that Riot should get on board and support. \n\nCommunities out there have been struggling, of which the recovery effort is going to be astronomical once this disaster settles and passes. \n\nRIP to my brothers on the fire ground that have also made the ultimate sacrifice protecting their community.","replies":[{"poster":"Jeneral Pain","date":"2020-01-08T08:51:24.946+0000","up_votes":1,"down_votes":0,"body":"Personally, I'd rather see the funds go to those affected communities because as a volunteer firefighter, Yeah I get to go home to my bed, my shower, and my internet etc etc.\n\nBut I love that the community is really rallying around everyone! \n\nI'm due for my second deployment into East Victoria later this week, early  next week.","replies":[{"poster":"BSV Josh","date":"2020-01-08T23:30:10.996+0000","up_votes":1,"down_votes":0,"body":"Yeah, thats what i'd rather as well. \n\nWe've just sent strike team 1421 to Gippsland on a 5 day stint. \n\nWhich brigade are you with bro?\n\nCheers \n\nJosh","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2020-01-08T02:14:53.122+0000","up_votes":2,"down_votes":0,"body":"I couldn't agree more!\nOcean week or Fire/Water themed skins sale seem like great ideas!\n\nThere's certainly something we can be doing!\nIf my mum in NZ can be knitting and mailing pouches for Joeys, then I'm sure the massive League Community and Riot can make an effort too! ^^\n\nWe just raised money from Dawnbringer Karma too, that hasn't been spent yet.  I'm sure the 'social impact fund' won't mind if the original plan goes out the window, and that money goes towards immediately saving lives and rebuilding both people and animal communities.\nThat money is already sitting there, at the very least let us vote now, so we can opt send it to people and animals who urgently need it.","replies":[]},{"poster":"RepstarFox","date":"2020-01-07T23:59:28.400+0000","up_votes":2,"down_votes":0,"body":"Have all water and fire based skin proceeds be donated to fire relief funds be a good one i'd say","replies":[{"poster":"Typhoid Mary","date":"2020-01-08T00:09:23.065+0000","up_votes":2,"down_votes":0,"body":"Yeah man one of the many ways they could help. Heck it go big and expand the firefighter skin line and donate proceeds.","replies":[]}]},{"poster":"SoloGarenFTW","date":"2020-01-08T10:24:12.123+0000","up_votes":1,"down_votes":0,"body":"They need about 6 months to legally do 100% income for a charity so Firefighter Tristana is not possible. From what I have read they are checking what they can do.","replies":[{"poster":"Typhoid Mary","date":"2020-01-08T12:15:19.561+0000","up_votes":1,"down_votes":0,"body":"Thanks for that info, certainly puts things into perspective. Fire fighter tristana was just an example/idea of course and purely just to inspire further thought :)","replies":[]}]}]}