{"poster":"Palahdium","date":"2016-06-03T19:07:41.616+0000","title":"Ausgewählte Champs im eigenen Team nicht bannen können","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":6,"body":"Hallo!\r\n\r\nIch &auml;rgere mich immer wieder &uuml;ber &quot;Mit-&quot;spieler, die aus Schlafm&uuml;tzigkeit oder weil sie einfach nur trollen oder einen erpressen wollen, den von mir vorangezeigten Champ einfach bannen. Es m&uuml;&szlig;te doch ein Einfaches sein, diese Ban zu blockieren. (Vor-)Ausgew&auml;hlte Champs von Spielern im eigenen Team d&uuml;rfen einfach nicht gebannt werden k&ouml;nnen vom eigenen Team - warum auch. Oder gibt es da eine sinnvolle Anwendung?\r\n\r\nGr&uuml;&szlig;e,\r\nPalahdium","replies":[{"poster":"Revilous","date":"2016-06-03T20:50:30.953+0000","up_votes":3,"down_votes":0,"body":"Stell dir vor, Urgot bekommt 1000% mehr DMG nächsten Patch und der Last Pick wählt ihn aus und dann kannst du ihn nicht mehr bannen und die Gegner picken ihn. Wähle einfach deinen Champ vorher nicht aus so einfach ist das.","replies":[{"poster":"Palahdium","date":"2016-06-04T18:54:31.428+0000","up_votes":1,"down_votes":0,"body":"Verstehe ich, aber dafür hast du nen Mitspieler der trollt, weil er sauer ist. Wenn es gut läuft vielleicht nur super schlechte Stimmung im Team. Wenn es für dich dumm läuft nen Report am Ende.","replies":[{"poster":"eingew","date":"2016-06-05T08:01:40.642+0000","up_votes":1,"down_votes":0,"body":"Der Report ist für dich absolut kein Problem, so lange du dir neben dem Non-Meta-Pick nichts anderes hast zu schulden kommen lassen.","replies":[]}]}]},{"poster":"Crounty","date":"2016-06-03T20:23:43.558+0000","up_votes":1,"down_votes":0,"body":"Also in dem letzten Patch habe ich immer Lucian z.B gebannt, wenn mein ADC der letzte oder vorletzte Pick war, selbst wenn er ihn ausgewählt hat(außer er wollte swappen). Das habe ich immer aus dem Grund gemacht, damit die Gegner ihn ganz einfach nicht first picken und somit nur durch ihn schon eine hohe Winchance haben","replies":[{"poster":"Palahdium","date":"2016-06-04T18:57:17.940+0000","up_votes":1,"down_votes":0,"body":"Und wie haben die Spieler darauf reagiert? Hast du dennoch verlohren, weil sie das Spiel dann sabotiert haben?","replies":[{"poster":"Crounty","date":"2016-06-05T07:06:00.635+0000","up_votes":2,"down_votes":0,"body":"Hab keine Spiele verloren weil niemad das Spiel sabotiert hat.","replies":[]}]}]},{"poster":"Zaddok","date":"2016-06-04T17:28:56.721+0000","up_votes":1,"down_votes":0,"body":"Das fände ich zum Beispiel nicht in Ordnung, da ich sehr ungerne nach einem Champ-Release diesen in meinem Ranked habe.\n\nDa banne ich diesen neuen Champ als meinem 1st Pick diesen zu lassen der denkt er könnte 3 Stunden nach Release eben diesen Mainen.","replies":[{"poster":"Palahdium","date":"2016-06-04T18:56:26.549+0000","up_votes":1,"down_votes":1,"body":"Ja, diese Chaoten, die in Rankeds Champs ausprobieren und mir noch am Release-Tag sagen, das sie ihn beherrschen, hasse ich auch. Dann gibt es halt nen Feeding-Report. Aber wenn er sauer ist und trollt hilft das bannen des neuen Champs auch nicht.","replies":[{"poster":"Wernicke","date":"2016-06-05T05:47:47.564+0000","up_votes":1,"down_votes":0,"body":"Das mit dem report system hast du noch nicht so ganz verstanden oder? \nWenn ich mir hier so deine antworten durchlese... Fall XY, ja dann gibts danach n report...\n\nNene, Ich banne in bestimmten Fällen auch lieber champs als sie z.B. dem Gegner zu überlassen.","replies":[]},{"poster":"Zaddok","date":"2016-06-04T19:04:17.951+0000","up_votes":1,"down_votes":0,"body":"Das bannen nicht, aber danach gibst du ihm ein Report für Assisting Enemy Team und gut ist.","replies":[]}]}]},{"poster":"Snowgen","date":"2016-06-04T10:14:58.590+0000","up_votes":1,"down_votes":0,"body":"Naja wenn wir keinen First pick bannen und jemand nen OP Champ haben will, banne ich ihn manchmal trotzdem. Hab einfach kein Bock das Risiko einzugehen, ggf gegen ihn spielen zu müssen.","replies":[]},{"poster":"oreodragon","date":"2016-06-03T19:27:10.153+0000","up_votes":1,"down_votes":0,"body":"dagegen kannst du leider nichts machen.\nsorry dir das sagen zu müssen{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"Yaboku San","date":"2016-06-03T19:15:13.426+0000","up_votes":1,"down_votes":0,"body":"Ich schätze mal er trollt dich einfach oder er wollte nicht das die gegner es first picken.","replies":[]}]}