{"poster":"200 IQ SINGED ","date":"2018-01-27T14:00:52.584+0000","title":"Verbindung kann nicht hergestellt werden.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich denke das Problem ist bei den meisten bekannt. Ich bekomme die Fehlermeldung das die Verbindung nicht hergestellt werden kann. Ich habe auch schon das meiste probiert bis hin zum kompletten neu aufsetzen meines Rechners. \n\n\nEvtl k&ouml;nnt ihr mir ja helfen da der Support  sich m&auml;chtig zeit l&auml;sst.  \n\nhttps://picload.org/view/ddproiga/unbenannt.jpg.html\n\nLG","replies":[{"poster":"200 IQ SINGED ","date":"2018-01-27T15:07:04.755+0000","up_votes":1,"down_votes":0,"body":"Also mit VPN funktioniert es soweit falls jemand das gleiche problem hat.\nEventuell sich dann mit meinem Anbieter in Verbindung setzen ?","replies":[{"poster":"silibum","date":"2018-01-27T15:27:22.862+0000","up_votes":1,"down_votes":0,"body":"Du solltest immer auf den Kommentar von jemand Antworten, dann kriegt man auch eine Benachrichtigung. Du bist Kabel Deutschland Kunde und dort gibt es bekannte Probleme mit dem Kapazitäten/Routing/Verbindung zur den Servern. Da kannst Du erstmal reichlich wenig gegen tun. Leider.","replies":[]}]},{"poster":"200 IQ SINGED ","date":"2018-01-27T14:14:14.851+0000","up_votes":1,"down_votes":0,"body":"Es ist schon das zweite ticket da das erste nichts gebracht hat- also denke ich ist es nicht so sinnlos hier nochmal zu fragen. \n\nMit das meiste ist so ziemlich die komplette liste des Artikels gemeint den du gepostet hast, Komplettes Betriebsprogramm neu aufgesetzt und gleich werde ich es noch mit einem VPN Service ausprobieren.","replies":[]},{"poster":"silibum","date":"2018-01-27T14:04:30.243+0000","up_votes":1,"down_votes":0,"body":"Wenn Du bereits den Support angeschrieben hast, dann warte bitte ab. Es macht wenig Sinn den Support zu kontaktieren und dann hier auch noch zu fragen (Die Antwortzeit variiert je nach Problem zwischen Stunden und Tagen - am Wochenende dauert es meist länger. Antworte bitte nicht unnötig auf das Ticket, da es die Wartezeit verlängert).\n\nDavon ab kannst Du ja mal diesen Artikel lesen (ich weiss ja nun nicht was \"das meiste\" bei Dir bedeutet): https://support.riotgames.com/hc/de/articles/201752664","replies":[]}]}