{"poster":"Im an ARIAN","date":"2016-08-31T17:57:58.175+0000","title":"Cheater ruinieren das Spiel","subforum":"Champions & Gameplay","up_votes":1,"down_votes":9,"body":"Hi, ich bins wieder, der Typ der in der Elo-Hell Diamond rumh&auml;ngt, net aus der Dia4 raus kann, weil er nur getrollt wird und pech mit den Teams hat, der Ben. Gestern hatte ich einen Adc im Spiel (Ezrael) der hat 32 kills gehabt, kein Scherz, ich dachte mir, entweder ist der Typ einer der besten Challender oder er cheated. Ich habe ihn geaddet und befragt, er sagte er cheatet, das macht er schon ewig und er hatte noch nie einen Ban oder so... dann fragte ich ihn wie er cheatet und womit, dann sagte er, dass es ein Geheimnis w&auml;re, aber er k&ouml;nne keinen Skillshot verfehlen und l&auml;sst sich von keinem Skillshot treffen, h&auml;lt immer Max-Distanz zu den gegnern und somit spielt er perfekt. Ich bin w&uuml;tend geworden, weil obwohl er stark dazu beigtragen hat, dass wir unser Spiel gewinnen, hasste ich, dass der cheatet, ich habe ein Ticket geschrieben, aber anscheinend ist bisher nichts passiert, sollte ich Kontakt mit dem Support aufnehmen? Ich habe Screenshots wie er zugibt, dass er cheatet...","replies":[{"poster":"hshtagniemehrcdu","date":"2016-08-31T20:17:42.118+0000","up_votes":4,"down_votes":0,"body":"Schonmal dran gedacht, dass er dich einfach nur verarscht hat?","replies":[{"poster":"Uranbrennstab","date":"2016-09-01T10:21:29.720+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cantabrum,realm=EUW,application-id=Wj1wcocU,discussion-id=NNAHqs7E,comment-id=0002,timestamp=2016-08-31T20:17:42.118+0000)\n>\n> Schonmal dran gedacht, dass er dich einfach nur verarscht hat?\n\nHä? Denkst du, jemand im Internet würde einfach so lügen erzählen?  Denkst du das?!","replies":[]},{"poster":"Nycaria","date":"2016-08-31T23:29:27.012+0000","up_votes":1,"down_votes":0,"body":"Ich würde die Post von dem Typen nicht allzu ernst nehmen,er schreibt seit Tagen QQ-Threads im Forum in denen er sich über irgendwas aufregt. ^^\n\nAuf die Frage warum er nicht mit seinem Main im Forum schreibt \n\n> Ich möchte lediglich Anonym bleiben mit meinem Main, will nicht ingame angeschrieben oder geflamt werden.","replies":[]},{"poster":"Good Guy Putin","date":"2016-08-31T23:04:44.731+0000","up_votes":1,"down_votes":0,"body":"Jap das gleiche hab ich mich auch gefragt :D","replies":[]}]},{"poster":"68 73 77 65","date":"2016-08-31T18:42:34.172+0000","up_votes":1,"down_votes":0,"body":"Scripten ist jetzt nicht unbedingt was, dem man jedes Game begegnet.. klar gibt es Scripter, aber wenn du in eins von 100 Games nen Scripter triffst und dann verlierst, shit happens.","replies":[{"poster":"OrangeBubble","date":"2016-09-01T05:52:01.628+0000","up_votes":1,"down_votes":0,"body":"Er hat doch gewonnen xD","replies":[]}]},{"poster":"haha weed lol xd","date":"2016-09-01T01:30:03.648+0000","up_votes":1,"down_votes":0,"body":"Jaja Ezreal is back und die Koreaner Scripter freuts :D","replies":[]},{"poster":"Camillentee v2","date":"2016-08-31T18:06:42.504+0000","up_votes":1,"down_votes":0,"body":"Wenn du schon ein Ticket geschrieben hast, wird sich der Riot Support sehr wahrscheinlich in den nächsten Tagen noch melden. Die Screenshots solltest du dem Support auch auf jedem Fall schicken, da dies ein eindeutiger Beweis ist. Ich kenne das auch Bro. Hänge gerade im High Dia und darf auch öfter gegen Scripter spielen. Das macht keinen Spaß.\nMfG RP","replies":[{"poster":"HHaie tabbian","date":"2016-08-31T18:18:21.010+0000","up_votes":1,"down_votes":0,"body":"Kann man denn davon sprechen, dass man in High Dia \"hängt\"? Ich meine viel höher geht es ja kaum noch (ja, ich weiß, dass es skilltechnisch noch ein großer Unterschied ist) und man gehört somit zu den besten Spielern, was doch eigentlich schon ganz gut ist.","replies":[{"poster":"Camillentee v2","date":"2016-08-31T20:25:04.447+0000","up_votes":1,"down_votes":0,"body":"Wenn man das so sieht kommt auch nie höher. Es gehört noch viel mehr zum Spiel als reiner Skill. Diese Essenziellen Dinge (Map Awareness, Mechanics , Attidute und Game Knowledge) unterscheiden einen hohen Dia Spieler von einem Master und Challenger.  Es kann zwar sein, dass ich als Mid/jungl main bessere Mecanics als ein Challenger Janna main habe. dafür hat dieser bessere Map Awareness und besseres Game Knowledge als ich.  \nMfG RP","replies":[{"poster":"HHaie tabbian","date":"2016-08-31T20:53:10.066+0000","up_votes":1,"down_votes":0,"body":"Skill benutze ich als übergeordneten Begriff für alle Fähigkeiten und jedes Wissen, welche benötigt werden, um das Spiel erfolgreich zu spielen.\nUnd ja, ich denke, dass es Zeiträume gibt, in denen es aufgrund bestimmter gegebener Umständen praktisch nicht möglich ist, sich relativ zu den anderen Spielern zu verbessern und dadurch aufzusteigen.","replies":[]}]}]}]}]}