{"poster":"TwoPixel","date":"2016-08-11T12:25:13.412+0000","title":"Tipps um in League of Legends besser zu werden?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"&gt; Guten Tag ^^\r\n\r\nIch m&ouml;chte mich gerne in League of Legends enorm steigern , w&uuml;rde aber gerne auf Kostenpflichtige &quot; R&auml;nge&quot; , Guides oder sogar verbotene Tools verzichten :) Also komplett &quot;Normal&quot; sozusagen.\r\n\r\nAlso vor 2 Tagen war ich noch Bronze 5 mit 0 LP ( Ja finde ich auch kacke!) und jetzt habe ich es zum Gl&uuml;ck geschafft mich in Bronze 4 mit 20 LP zu bef&ouml;rdern^^\r\n\r\nKleine Info Auf welchen Positionen und welche Champions ich spiele :\r\n\r\nPrim&auml;r: &quot;Jungel&quot; mit Lee sin ( Schaden ) Sekund&auml;r: ADC mit Ashe\r\n\r\nW&auml;re Sehr erfreut wenn ich hier ein paar Tipps bekommen w&uuml;rde :) ( Andere k&ouml;nnen auch davon Profitieren glaube ich)!\r\n\r\nMit freundlichen Gr&uuml;&szlig;en: Nick :)","replies":[{"poster":"TheTrueVicious","date":"2016-08-11T12:28:12.331+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nnur so als kleiner Tipp. Ich würde an deiner stelle kein lee spielen. Ist nen sehr schwieriger Champ ich würde was spielen, was auch noch im Late viel impact hat.","replies":[{"poster":"TwoPixel","date":"2016-08-11T12:33:35.216+0000","up_votes":1,"down_votes":0,"body":"Aber der macht Spaß :o und ich habe ihn auf Level 6 :D","replies":[{"poster":"MeMyselfandBaal","date":"2016-08-11T14:08:44.172+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TwoPixel,realm=EUW,application-id=vatevpvi,discussion-id=GRQiLxdt,comment-id=00000000,timestamp=2016-08-11T12:33:35.216+0000)\n>\n> Aber der macht Spaß :o und ich habe ihn auf Level 6 :D\n\nAlso um mal eine Geschichte aus der Elohölle zu teilen: Ich hätte die alte (ja, die ganz alte) Karma auch auf Level 6 gehabt, wenn es dieses System damals schon gegeben hätte. Dann bin ich auf Annie und Sona umgestiegen. 2 Wochen später war ich Silber IV... Einfach nur weil ich Champions gepickt habe, die einfach, stark und in der Meta sind...  \nNatürlich ist es nicht verkehrt, dass zu spielen, was einem Spaß macht... aber in manchen Fällen macht man es sich halt auch unnötig schwierig.\nIch als Sup Main habe Champions wie Thresh oder Alistar, die mechanisch etwas anspruchsvoller sind, erst angerührt, als ich Platin war. Bis da hin habe ich immer Supports gespielt, die ziemlich stumpf waren. Auch weil ich mich dadurch eher auf das große Ganze konzentrieren konnte. \nDies ist sicherlich nicht der einzige Weg um besser zu werden. Schließlich führt es dazu, dass ich mechanisch immer noch relativ grausam bin. \n\nAber wenn du wirklich nur raus aus Bronze willst, spielst du was einfaches und stumpfes und freust dich über die steigende Elo.","replies":[{"poster":"TwoPixel","date":"2016-08-11T14:34:13.777+0000","up_votes":2,"down_votes":0,"body":"ok danke :D Ein paar leute haben mir gesagt mit Amumu könnte man ganz einfach aus bronze. Und das stimmt auch ^^^habe gerade first time Amumu gespielt und stand 10/4/8 ^^","replies":[{"poster":"Ireliα","date":"2016-08-11T17:04:26.401+0000","up_votes":1,"down_votes":0,"body":"Das große Problem an mechanisch anspruchsvollen Champions ist, dass du dich eigentlich noch damit beschäftigen solltest das Spiel zu verstehen. Wenn du einen Champion mechanisch zu 100% beherrschst kannst du dich darauf konzentrieren alles andere richtig zu machen und bist nicht so fokussiert darauf die \"Plays\" zu veranstalten.\n\nEs bleibt dir natürlich selber überlassen, aber du wirst schneller ein besserer Spieler wenn du zuerst die einfachen Champions spielst und erst ab Platin/Dia mit den wirklich schwierigen anfängst.","replies":[]}]}]},{"poster":"SeaHorseCalamity","date":"2016-08-11T12:55:41.528+0000","up_votes":1,"down_votes":1,"body":"1. Tipp von mir: Lass dir von keinem Vorschreiben, welche Champs du spielen sollst.\nevtl wirds als Lee ein bisschen schwieriger, allerdings lohnt es sich auf Dauer, da du bereits die ganzen Mechaniken wie aktive Items, schnelle, große combos, animationscancellei usw von Anfang an lernst. (Wie gesagt: viel auf einmal, aber kann sich lohnen.)\n2. Tipp: Lerne wie man richtig Teamfighted (such auf Youtube nach \"Teamfight Breakdown\", da hast du ein Paar beispiele.)\n3. Lerne, aus einem Vorteil den größt möglichen Nutzen zu ziehen. \n\nWenn du das alles kannst, bist du schon Gold.\nEs wird nicht leicht, und auch nciht schnell vonstatten gehn, aber wer aufsteigen will muss an sich arbeiten.","replies":[{"poster":"leonthefirefly","date":"2016-08-11T14:40:56.421+0000","up_votes":1,"down_votes":0,"body":"das mag schon sein das er mit lee vieles lernt aber leichter ist es eins nach dem anderen zu lernen und du kannst mit lee nicht sagen so jetzt lern ich insec jetzt bla du brauchst alles damit du lee gut kannst und ganz im ernst nieeeeeemand wirklich nieeemand der bronze 5 ist kann lee sin spielen, sonst wäre er bei einem so mechanischem champ nicht bronze^^. Daher ist es mit anderen champs wirklich leichter gerade amumu keine schweren skillshots tanky asfuck einfach soviel verzeihender alls lee. Das lässt einem einfach deutlich mehr raum für basics wie, wann drake wo wards... die einem einfach auf jedem champ helfen.","replies":[{"poster":"SeaHorseCalamity","date":"2016-08-11T16:00:29.368+0000","up_votes":1,"down_votes":0,"body":"Wenn er Lee gern spielt und Lee ihm Spaß macht, wird er wohl besser gelaunt sein, wenn er Lee spielt, als wenn er Amumu (eher lagweilig) spielen \"muss\" um aufzusteigen.\n\nDass es nicht der einfachste und schnellste Weg ist, hab ich ja bereits erwähnt, allerdings bin ich der Meinung, dass es gut ist, schon früh in komplexere Bereiche vorzustoßen, anstatt das Alles im Nachhinein neu anzulernen.","replies":[{"poster":"Anislkr","date":"2016-08-11T17:15:45.647+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"SeaHorseCalamity","date":"2016-08-12T07:07:57.532+0000","up_votes":1,"down_votes":0,"body":"Das hängt wohl stark vom Spieler ab^^\nIch hab schon wieder nen Padawan, der mit lvl 26 Problemlos gegen Platin-Adcs mithalten kann. Sowohl vom Farm her, als auch vom Kiten, sowohl die Itemwahl (Situationsbedingte ebenfalls), Attackmove beherrscht er ebenfalls, er weiß, wen er wann angreifen muss und verpennt nebenher nichtmal, seinen Support im Teamfight durch heal zu retten.\nEr ist wohl in fast jeder Hinsicht ein besserer Adc als ich.\nUnd ist noch nichtmal lvl 30.\n\nIst aber wohl ein Einzelfall.\n\nMein Gedankengang ist: Wer mit Lee Sin junglen kann, der kann auch mit Udyr und Amumu junglen.\nUnd wenn jemandem Lee Sin Spaß macht, warum sollte er ihn nicht spielen dürfen? Lernt man mehr, wenn man keinen Spaß dabei hat? Oder muss man das Spiel erst beherrschen, um Spaß haben zu dürfen?\n\nWenn jemand mit Lee Sin das Spiel lernen wil, soll er das tun. Ist evtl etwas schwieriger als die normaler Variante, dafür hast du schon einiges zusätzlich gelernt, wenn du Lee dann mal kanst.","replies":[]}]}]}]},{"poster":"sabonav80","date":"2016-08-11T16:13:38.409+0000","up_votes":1,"down_votes":0,"body":"lerne richtig farmen  ist normalerweise tipp nummer 1 in bronze  : jeder der mehr als 50% des farms bekommt ( bzw im junlge effektiv ist )\nwird min bronze 2-silber kommen ohne die augen zu öffnen","replies":[]},{"poster":"TwoPixel","date":"2016-08-11T13:17:53.074+0000","up_votes":1,"down_votes":0,"body":"Diese Tipps sind doch schon mal ein guter Anfang! \n\n Danke sehr :D","replies":[]}]},{"poster":"Kurisu 1v9","date":"2016-08-11T12:41:15.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TwoPixel,realm=EUW,application-id=vatevpvi,discussion-id=GRQiLxdt,comment-id=00000000,timestamp=2016-08-11T12:33:35.216+0000)\n>\n> Aber der macht Spaß :o und ich habe ihn auf Level 6 :D\n\nWillst du climben oder willst du das spielen, was dir Spaß macht? Ich hab glaube über 100k Lee Points, aber ich fass den Champion im Ranked nicht an. Wieso mache ich das nicht? Weil dieser Champion mit ziemlich großen Risiken verbunden ist. Snowballst du nicht super hart und kannst machen was du willst, dann muss dieser Champion zu 100% on-point gespielt werden und tbh das schafft man meistens nicht.\n\nWenn du schon an deinem Champion Pool arbeiten solltest, würde ich Zac, Gragas und Rek Sai spielen. Die sind zwar nicht so \"spaßig\" wie Lee Sin, aber auch nicht so anfällig für Fehler.","replies":[]},{"poster":"TheTrueVicious","date":"2016-08-11T12:39:55.343+0000","up_votes":1,"down_votes":0,"body":"Wenn du willst spiel ihn klar macht er Spaß. War nur ein Tipp, weil es einfach unglaublich schwierig ist ihn perfekt zu spielen. Ich würde dir Ammumu empfehlen mit dem kommst du locker aus Bronze raus.","replies":[]}]},{"poster":"FNC HolyJin","date":"2016-08-11T13:43:27.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheTrueVicious,realm=EUW,application-id=vatevpvi,discussion-id=GRQiLxdt,comment-id=0000,timestamp=2016-08-11T12:28:12.331+0000)\n>\n> Hi,\n> \n> nur so als kleiner Tipp. Ich würde an deiner stelle kein lee spielen. Ist nen sehr schwieriger Champ ich würde was spielen, was auch noch im Late viel impact hat.\n\nKappa","replies":[]}]},{"poster":"GotBoostedBySKT","date":"2016-08-11T12:41:38.050+0000","up_votes":1,"down_votes":0,"body":"Ich gebe TheTrueVicious recht. Im Low Elo würde ich leichtere Champs spielen wie etwa Ammumu, Master Yi, Xin Zhao und noch mehr solcher Champs. Aber wenn du halt einfach nur Spaß haben willst, dann würde ich dir raten weiter Lee Sin zu spielen. Es ist nicht unbedingt etwas besonderes wenn man einen Champ auf Level 6 hat. Man hat ihn zwar dann oft gespielt aber man ist trotzdem nicht UNBEDINGT gut mit ihm.","replies":[{"poster":"TwoPixel","date":"2016-08-11T13:13:06.384+0000","up_votes":1,"down_votes":0,"body":"Ja das glaube ich euch sehr wohl aber ich finde es schwer mich jetzt umzustellen um andere champs zu spielen.\nIch besitze Rek'Sai aber wie würde ich lernen sie gut zu spielen?\n\nKann man mir irgendwelche guides zu Rek'Sai geben und vllt. selber eigene Erfahrungstipps geben`?","replies":[]}]},{"poster":"TiO2","date":"2016-08-11T17:07:21.297+0000","up_votes":1,"down_votes":0,"body":"1. lern die Schwächen und Stärken deines Champs kennen und finde was über seine Counter heraus und wie sie funktionieren. \n2. immer mal einem Blick auf die Minimap haben und immer schön in den Teamfights helfen außer du bist low oder was ähnliches\n3. Denk als Jungler immer daran, dass der gegnerische jungler eventuell counter jungeln könnte.\nIch bin zwar auch nur bronze IV aber ich habe schon um die 600 matches gewonnen.","replies":[]},{"poster":"sabonav80","date":"2016-08-11T16:11:39.813+0000","up_votes":1,"down_votes":0,"body":"kauf dir nen  coach für 5/10 oken der analysiert dein gameplay undsagtt dir genau  was du übensollst.... aber eins kann ich dir sagen : spiel kein lee sondern \nAmumu Volibear Vi Gragas oder Elise jungle ( letztere beide isnd n bissle anspruchsvoller) lee ist ein champ den nichtmal alle challagnerspieler beherschen und schon gar kein bronze player :) carryen wird hart mit ihm :) auch wenn er spaß macht ashe  ist ok :) für b,\nwürd dir auch douq coaching anbieten aber auch net kostenfrei vll gest du mal auf : lol-coaching.com","replies":[{"poster":"sabonav80","date":"2016-08-11T16:14:44.657+0000","up_votes":1,"down_votes":0,"body":"es gibt natürlich noch weitere mögliche junlger diese sind mir grad eingefallen : ich hab damals meine ersten rankeds im junlge mit yorik gecarryet xD aber die zeiten sind vorbei","replies":[]}]},{"poster":"ITSNUTRONZ","date":"2016-08-11T13:12:19.964+0000","up_votes":1,"down_votes":0,"body":"-> Achte auf dein Farm\n-> Wenn du siehst der Gegner gibt richtig Power und will dich unbedingt töten kannst du davon ausgehen das der sein Jungler um Hilfe bittet also geh einfach safe und Poke ihn von hinten\n-> Motivier deine Mitspieler\n-> Falls jemand dich Flamed ohne Grund : I Mute U. und schon kann der spaß weiter gehen nachdem du ihn auf ''stumm'' geschalten hast\n-> Spiel nie Alleine wenn die Lane Phase zuende ist lauf mit dein team rum oder deff\n-> Spiel Champion die dir sehr gefallen aber nur 2 ist zu wenig.\n-> Nimm hochteils nur conter damit du dein team helfen kannst  z.B\n\n{{champion:238}} >{{champion:157}} \n{{champion:122}}  >{{champion:86}} \n{{champion:50}} > AD MITTE\n \nUnd so weiter. Falls du mal keine Ahnung hast was der Conter ist frag deine Team Mates die sollten wenn du glück hast ein conter für dich finden\n\n-> wenn du neu LoL startest spiel erst ein bot Game 5 VS 1 wo du ein Champion benutzt der dir nicht leicht fällt.\n\nSo das waren die Tipps für dich ich würde gerne meine Tipps und Taktiken auch geben aber wäre dann unnötig für mich, weil ich mir dann die Mühe umsonst mache das alles zu entwickeln{{sticker:slayer-jinx-wink}}","replies":[{"poster":"HookEmUp","date":"2016-08-11T13:45:23.496+0000","up_votes":1,"down_votes":0,"body":"Das mit den Countern ist ein fragwürdiger Tipp finde ich. In der low Elo - wo ich mich auch befinde - haben counterpicks an sich nichts zu sagen. Wenn ich pro Lane 2 Champs habe die mir Spaß machen (was automatisch heißt, dass ich mehr Zeit investiere und dadurch besser spiele) reicht es vollkommen aus für Gold.\n\nBevor er nun ständig auf Mobafire klickt und sieht - nice Yasuo is strong gegen Vel'Koz. Hat ihn aber nie gespielt. ","replies":[{"poster":"ITSNUTRONZ","date":"2016-08-11T14:53:29.656+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch diesen Tipp gegeben:,, -> wenn du neu LoL startest spiel erst ein bot Game 5 VS 1 wo du ein Champion benutzt der dir nicht leicht fällt.'' was bedeutet das er Champion ausprobieren soll und da kam bestimmt einmal ein Yasuo vor und wenn nicht wird er bald kommen.\n\nUnd ich denk nicht das es nur 1 Conter gibt.\nNämlich hat keiner eine Ahnung das {{champion:41}}  auch {{champion:157}}  Contert.","replies":[]}]},{"poster":"TwoPixel","date":"2016-08-11T13:20:25.672+0000","up_votes":1,"down_votes":0,"body":"So wie ich dein Post gerade verstehe willst du mir mit meiner Sekundären ADC lane helfen oder?","replies":[{"poster":"ITSNUTRONZ","date":"2016-08-11T13:28:15.977+0000","up_votes":1,"down_votes":0,"body":"Ja aber der Jungler ist auch teil davon.\nMan kann auch den gegnerischen jungler contern und dann in sein jungle gehen und first blood abgeiern oder einfach late warten und ihn dann holen somit kann er niemanden helfen\nund man braucht als jungler farm damit man auch helfen kann\n\nich denk nicht das ein level 3 lee sin besser als ein lv 6 lee sin ist","replies":[{"poster":"TwoPixel","date":"2016-08-11T13:38:28.353+0000","up_votes":1,"down_votes":0,"body":"Achso ok-","replies":[]}]}]}]}]}