{"poster":"Indexes","date":"2016-11-16T14:11:29.236+0000","title":"Flex Que 4 Spieler.","subforum":"Ligen & gewertete Spiele","up_votes":5,"down_votes":1,"body":"Es ist ja momentan die Flex Que nicht mit 4 Spieler M&ouml;glich mit dem grund das nicht genug einzelne Spieler in die Flex Que gehen werden da es ja die Solo/Duo Que geben wird, aber es sind 3 Spieler M&ouml;glich.\r\nWenn dies die begr&uuml;ndung ist die im FAQ steht dann solte man entweder 3 Spieler auch deaktivieren weil dann 2er Team auch in die Solo Q gehen w&uuml;rden.\r\nEine andere M&ouml;glichkeit w&auml;re es meiner meinung nach 4 Spieler zu Aktivieren um zu schauen wie es sich mit den Warteschlangen verh&auml;lt, weil ich habe momentan 3 weitere Freunde mit den ich gerne Ranked Spielen w&uuml;rde, aber Leider ist ja die Flex Que f&uuml;r 4 spieler Deaktiviert.\r\n\r\nIch weis nicht ob ich das hier richtig reinposte aber W&auml;re sch&ouml;n wenn man es weiterleitet k&ouml;nte das man die flex q als test f&uuml;r 4 spieler freischaltet.\r\nMfG: Florian ;).","replies":[{"poster":"Megamaexx","date":"2016-11-16T14:20:02.560+0000","up_votes":3,"down_votes":0,"body":"Wenn man 3 Spieler auch deaktiviert, hat man das alte System wieder: Nur allein, zu zweit oder zu fünft. (Solo/DuoQ und Teamranked) \nIch wäre auch für's Erlauben der 4er in FlexQ. Man kann ja clientseitig eine Meldung bringen, wenn gerade sehr wenig Solo-Spieler unterwegs sind. Aktuell werden es nämlich ziemlich viele sein, da SoloDuoQ noch nicht da ist.","replies":[]},{"poster":"Revilous","date":"2016-11-16T19:47:03.849+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir unsicher, ob genügend Solo Spieler in die FlexQ gehen weil sie in dem Fall ja auch SoloQ spielen könnten. Ich habe mich nicht wirklich informiert und weiß nicht, ob die geplante reine SoloQ kommt oder eine Solo/duoq weil in dem Fall ist die 3er Queue auch sinnlos und dann könnte man statt der FlexQ auch einfach Teamranked und Solo/DuoQ machen (was eigentlich das beste wäre und schon Jahre funktioniert hat rito pls)\n\nFalls aber die reine SoloQ kommt, sehe ich keinen wirklichen Grund, 4er Queue zu deaktivieren, da die Solospieler die sich beschweren würden, auch SoloQ spielen könnten. Die 4er Q hätte dann halt bloß ne ewig lange Queuetime.","replies":[]}]}