{"poster":"Tacchino Robot","date":"2018-02-22T07:45:14.367+0000","title":"La \"figlia\" del vuoto","subforum":"Campioni e gameplay","up_votes":3,"down_votes":2,"body":"Ho visto le interazioni di Kai&#039;sai e sono rimasto parecchio deluso, mi aspettavo molte pi&ugrave; interazioni con il padre o comunque un personaggio che insegue qualcosa per tutta la vita, invece &egrave; solamente un champ che conta le kill che fai :/ non ha neanche interazioni sulle pentakill o cose simili :/","replies":[{"poster":"UnknownEV","date":"2018-02-22T08:29:55.658+0000","up_votes":2,"down_votes":0,"body":"La storia ci sarà nell'universo. Non deve racontartela lei ogni volta che cammina nella landa {{summoner:-1}}","replies":[{"poster":"wattbatt","date":"2018-02-22T09:17:34.765+0000","up_votes":3,"down_votes":2,"body":"bè ma per esempio swain ne dice di cose","replies":[{"poster":"Pulastér","date":"2018-02-22T12:35:55.497+0000","up_votes":2,"down_votes":0,"body":"Stiamo comparando un gran generale di un grandissimo impero (con capacità di leggere le storie altrui tra l'altro) a una poveretta che è stata isolata per tanti anni dal suo mondo per colpa del void? A meno che non sia una veggente non vedo come possa raccontarvi qualcosa del suo mondo o del \"vuoto\" che già tutti sappiamo.","replies":[{"poster":"HaIIeIujah","date":"2018-02-22T13:09:24.542+0000","up_votes":4,"down_votes":0,"body":"Beh, oddio. Ci sono parecchie cose che avrebbe potuto dire sui Voidborn.\n\nUna citazione contro Kha'Zix, su come anche lei ha dovuto adattarsi. Una contro Kog, in cui cita il padre (ammesso che non sia stato retconnato). Qualcosa di specifico contro Cho e Rek sulla loro natura. Frasi dedicate a Malz che anziché discutere solo delle sue profezie ci facciano intravedere _esattamente_ cosa sta preparando.\n\nIl problema è che, come ogni volta che si scrive del Void, non si può essere troppo specifici. Sia ben chiaro: l'invasione del Void a livello di lore è il _glorioso climax_ della storia, il conflitto finale che dovrebbe unire (o dividere) tutte le nazioni di Runeterra. E dato che per renderlo come si deve ci vorrebbero ancora anni e anni di preparazione tutte le informazioni che ci arrivano al momento sono nebulose e dalla dubbia canonicità- perché descriverlo troppo toglierebbe molto di quel mistero che ne è la minaccia princiapale.","replies":[]}]},{"poster":"Tacchino Robot","date":"2018-02-22T11:12:50.494+0000","up_votes":1,"down_votes":0,"body":"Esatto, inoltre ha taunt con Kassadin veramente miseri","replies":[]}]}]},{"poster":"Pulastér","date":"2018-02-22T13:05:35.493+0000","up_votes":2,"down_votes":0,"body":"Se mai ricevesse una VO, vorrei tanto che Kassadin la tauntasse con un \"Kai'Sa, sono io tuo padre!\".","replies":[{"poster":"Tacchino Robot","date":"2018-02-23T11:01:51.478+0000","up_votes":1,"down_votes":0,"body":"Magistrale","replies":[]}]},{"poster":"Náos","date":"2018-02-22T09:31:51.532+0000","up_votes":1,"down_votes":0,"body":"É giusto un pelo stereotipata, peccato perché come estetica  (occasione sprecata anche lì) e abilità mi piace molto","replies":[{"poster":"Tacchino Robot","date":"2018-02-22T11:13:13.551+0000","up_votes":1,"down_votes":0,"body":"È Kerrigan","replies":[]}]}]}