{"poster":"Debels","date":"2015-04-23T23:30:13.533+0000","title":"Im Ranked Afk / Disconnects","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":2,"body":"Hallo werte Lol-Community ich habe mir einige gedanken gemacht zum Thema &quot;Afk im Ranked / Disconnects ) dass das Spiel f&uuml;r eine gewisse Zeit angehalten wird so wie in Dota dort ist es ja m&ouml;glich das Spiel zu pausieren, oder das das Spiel gesamt erst ganich gewertet wird  und das Spiel beendet wird die Runde .Wenn es nur ein 4 vs 5 w&auml;re da ein Spieler einen dauer Disconnect oder Afk gehn ( Spieler werden ja erst nach einigen Minuten automatisch Disconnectet bei Afk) Da ein 4 vs 5 meist eh zu einem Lose f&uuml;hrt im unterlegenen Team, und sicher einige von uns in ihrer Elo festsitzen weil sie andauernt Leaver drin haben oder leute mit DC&#039;s.","replies":[{"poster":"LadeMuertenegra","date":"2015-04-23T23:50:27.148+0000","up_votes":2,"down_votes":0,"body":"Naja :D Dann dauert das Spiel 2 Std {{item:3151}} Haha Ironie... Naja kommt drauf an wie lange die \"Pause\" wäre","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-04-23T23:52:15.111+0000","up_votes":3,"down_votes":2,"body":"ähm nein... also rein Mathematisch... nein. Du hast 5 potenzielle Leaver im Gegnerteam, aber nur 4 im eigenen. Also davon ausgehend, dass du selber nicht AFK gehst und dein Verhalten keinen Ragequit fördert... dementsprechend müsstest du mehr 5vs4 Spielen als 4vs5. Reine Stochastik. Und die logische Konsequenz dieser Rechnung ist: du würdest du das, was du hier forderst, nicht auf-, sondern absteigen, weil die ganzen 5vs4 Siege nicht gewertet werden. Du würdest also eher ab- als aufsteigen... Das Problem ist natürlich, dass du dich an diese 5vs4s nie erinnerst. Dieses Spiel wird halt als \"belangloser Sieg\" abgetan, während das 4vs5 als ärgerliche Niederlage angesehen wird... Und teilweise bekommst du erst ganz am Schluss mit, dass der Gegner die letzten 5 Minuten nur noch zu 4. war... \n\nUnd sobald man sich bewusst gemacht hat, dass man als freundlicher Spieler mit stabiler Internetverbindung langfristig von AFKlern profitiert, heult man auch nicht mehr rum, dass das System geändert werden müsste... zumindest wenn es einem nur um die \"Elo\" geht, in der man angeblich wegen den Leavern \"festhängt\"...\nUnd dann sind wir noch nicht mal beim Missbrauch... Wie verhinderst du, dass das verlierende Team kurz vor Schluss das Spiel sinnlos in die Länge zieht, nur weil einer das Spiel verlässt und die restlichen 4 deswegen eine 20 Minütige Pause einfordern dürfen...","replies":[{"poster":"bloodstoorm","date":"2015-04-24T08:59:40.034+0000","up_votes":2,"down_votes":1,"body":"Mathematisch korrekt, dennoch habe ich jetzt nach ein paar Games mal ein Fazit gezogen und hatte mehr games mit Leaver im eigenen Team als im gegnerischen. Ich heule deshalb nicht rum aber ärgern tu ich mich doch denn wenn man ein Gegnerteam hat welches nicht total verdummt ist nutzen die diesen Spieler gnadenlos zum Sieg aus. \nDer Missbrauch lässt sich bei so einer Lösung nicht verhindern, deshalb sollte man eher bei den Afklern ansetzen und diese härte bestrafen. Denn letztendlich sollten sie bestraft werden und nicht das Team welches das Game dann verliert. Ich denke dabei auch daran dass man vielleicht weniger LP verliert wenn einer Afk geht.","replies":[{"poster":"MeMyselfandBaal","date":"2015-04-24T10:23:35.621+0000","up_votes":3,"down_votes":1,"body":"Dann frag dich mal, warum du mehr AFKs in deinem Team hast als ich... und behaupte bloß nicht, dass das was mit der Elo zu tun hatte, ich war 2 Jahre Bronze und hatte trotzdem mehr AFKs im Gegnerteam als im eigenen... \n\nDa gibt es eigentlich nur 2 Varianten: 1. Du nimmst die 5vs4 Spiele einfach nicht war.\n2. Dein Verhalten fördert die Motivation deiner Mitspieler, das Spiel zu verlassen...\n\nDu kannst du selber eine Variante aussuchen...","replies":[]},{"poster":"drexxsack","date":"2015-04-24T09:45:41.187+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sanctuary2056,realm=EUW,application-id=KYnfKGf0,discussion-id=YUFV2EVQ,comment-id=000100000001,timestamp=2015-04-13T17:02:57.230+0000)\n>\n> Daran gehindert wird sowieso niemand, egal was man macht. Man kann höchstens **versuchen** Wiederholungen zu verhindern. Für dieses Ziel sind die derzeitigen Strafen besser als die früheren Accountbans (auch Permabans!), denn diese haben die Möglichkeit offen gelassen den Account zu wechseln. Auch was die Rehabilitationsquote angeht, so steht schon lange fest, dass harte Strafen nicht die Besten sind. Im Gegenteil, sobald eine Strafe zu hoch wird, wird sie nicht mehr akzeptiert und als surreal angesehen. Sie bieten auch keinen abschreckenden Effekt.\n> \n> Ad hoc klingt es natürlich einleuchtend, dass harte Strafen abschrecken. Bei genauerer Überlegung und vor allem Beobachtung... nicht mehr so ganz. Viel wichtiger ist die Form der Strafe und da ist Riot schon auf einem guten Weg finde ich. Keine Ahung wo das realistische Optimum liegt... aber verhindern wird man Leaves sicher nie. Das geht nicht.\n\n\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/YUFV2EVQ-afk-evtl-haartere-strafen?comment=000100000001\n\nManchmal ist es schon herrlich, dass alle Antworten schon im Forum rumgeistern. Das macht vieles einfacher.\n\n\"Weniger LP-Verlust\" wurde schon so oft durchgekaut.\nDas müsste man zwangsläufig auch an einen geringeren MMR-Verlust koppeln, was so einige Nachteile, neben dem erheblichen Missbrauchspotential, hat.\nBevor wir darüber auch nur weiter diskutieren, solltest du dich darüber schlau machen, wie das Elosystem funktioniert.\n\nhttp://de.wikipedia.org/wiki/Elo-Zahl\nhttp://de.wikipedia.org/wiki/Elo-Zahl#Deflation_und_Inflation\n\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/0pbuL8kv-troller?comment=00050001\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/oWBL3Pgp-bin-jetzt-bronze-1-weil-es-nur-noch-feeder-gibt-order-afk-leute?comment=0005","replies":[]}]}]},{"poster":"Psydelick","date":"2015-04-24T00:15:46.707+0000","up_votes":2,"down_votes":4,"body":"zu meinem Bild muss man wohl nichts sagen oder? ich stecke bald seit einem Halben jahr drin fest ich habe in Normals positive stats ich meine keine ingame stats sondern wirklich win und lose das können wohl nur die wenigsten behaupten. aber seit dem ich damals 2013 mein Acc versaut habe in dem ich viel zu früh ranked angefangen habe komme ich aus Bronze nicht mehr raus ich habe auch ehrlich gesagt nicht mehr den willen da zu ich weiß nicht warum 4vs5 games überhaupt gewertet werden das ist das dümmste System was es gibt die jenigen die afk gehen sollten am besten gleich 50 Strafpunkte oder so bekommen -.- ","replies":[{"poster":"eingew","date":"2015-04-24T05:45:11.390+0000","up_votes":2,"down_votes":2,"body":"4 potentielle Leaver vs 5 potentielle Leaver.\n\nDu gewinnst öfter durch Leaver, als dass du durch sie verlierst, sofern du selbst seltener leavst. Diese halten dich also keineswegs auf, im Gegenteil, du steigst durch sie auf.\n\nWenn du es nicht schaffst aufzusteigen liegt das keineswegs an deinen Mitspielern, sondern an dir.","replies":[{"poster":"Psydelick","date":"2015-04-24T10:56:01.972+0000","up_votes":1,"down_votes":4,"body":"4 potentielle Leaver vs 5 potentielle Leaver ich würde echt gerne wissen woher diese Statistik kommt weil mir kommt es immer nur so vor als wenn ich die Afkler bei mir drinnen habe natürlich mache ich auch fehler nur ich komme immer kurz vor den 100 points und den geht es wieder bergab bis ich auf 0 bin dann geht es wieder Berg auf bis ich den wieder kurz vor den 100 points bin natürlich weiß ich das ich nicht perfekt bin auch wenn ich es mir ungern eingestehe aber ich weiß es  ich versuche immer aus meinen Fehlern zu lernen auch wenn ich sie manchmal 2 oder 3 hintereinander mache und schiebe nicht immer alles auf mein Team aber was soll ich aus so einem Game lernen? :) ","replies":[{"poster":"drexxsack","date":"2015-04-24T11:07:14.090+0000","up_votes":3,"down_votes":1,"body":"Das \"4-5-Prinzip\" ist einfach Mathematik/Logik.\nStatistik ist zwar ein Bereich der Mathematik, aber ich vermute, dass dein Verständnis von Statistik sich ausschließlich auf den Teilbereich \"deskriptive Statistik\" bezieht(Wobei das ganze eher Wahrscheinlichtkeitstheorie ist, was Teil der Stochastik ist, die auch die Statistik beinhaltet, so nebenbei).\nBeide Teams haben 5 Slots und diese sollen mit Spielern belegt werden, die aus einem bestimmten Pool stammen. In diesem Spielerpool ist alles vertreten:\n1. Gute Spieler\n2. Schlechte Spieler\n3. Notorische AFKler\n4. Flamer\n5. Notorischen Saboteure\n6. Der Rest und alles was ich vergessen habe\nDer Pool wird durch die MMR bestimmt.\nJetzt ist es nun allerdings so, dass, aus deiner Sicht, das Gegnerteam 5 Slots mit zufälligen Spielern füllen und dein Team nur 4.\nDu bist aus deiner Sicht kein zufälliger Spieler.\nDer seltsame Effekt daran:\nAus Sicht des Matchmakings verteilen sich alle Spielertypen (auf lange Sicht) gleichmäßig über beide Teams.\nAus deiner hingegen hat der Gegner eine höhere Wahrscheinlichkeit, dass einer seiner Slots mit \"nicht hilfreichen\" Spielern belegt wird, allerdings auch eine höhere Wahrscheinlichkeit, dass einer der Slots mit einem \"aussergewöhlich guten\" Spieler belegt wird.\nOb du nun aus diesem Pool in einen \"höheren\" Pool dauerhaft aufsteigen kannst, hängt nun davon ab, wie du deinen festgelegten Slot nutzt.\nBist du überwiegend \"nicht hilfreich\" wirst du absteigen. Bist durchschnittlich gut für diesen Bereich, wirst du dort verbleiben.\nBist du \"aussergewöhnlich gut\" für diesen Bereich, wirst du auch aufsteigen.\nDu hast gegenüber dem Matchmaking einen Informationsvorteil.","replies":[{"poster":"Psydelick","date":"2015-04-24T11:55:40.154+0000","up_votes":3,"down_votes":3,"body":"jetzt habe ich es verstanden weil ich der eine Spieler ich bin, ich sollte vielleicht manchmal ein bisschen weiter denken :D ","replies":[{"poster":"drexxsack","date":"2015-04-24T12:02:51.238+0000","up_votes":2,"down_votes":1,"body":"Ich würde dir Empfehlen, das Bild zu entfernen, es verstößt gegen die Forenregeln.\n\nGibts halt. Das gibt es in Bronze, aber auch in Dia und Challenger. Es ist vllt nicht immer Wut-AFK, aber in jedem Bereich hat man diese Spieler.\nEr wird seine Strafe bekommen(oder schon bekommen haben), wenn er öfters solche Aussetzer hat.\nNiemand von uns weiß wie das Spiel gelaufen ist, weshalb ich auch nicht weiß, ob es  Provokationen gab.\nNicht viele Spieler merken, wenn sie andere provozieren. Das rechtfertig das AFK-Gehen in keinster weise. Es ist allerdings so, dass keiner im Forum die konkreten Ursachen in diesem Fall erkenne kann, auch du nicht, denn du bist als Beteiligter nicht objektiv.\nZunächst ist deine Aufmerksamkeit zunächst aufs Spiel im allgemeinen und dein Spiel im besonderen gerichtet.\nDu bekommst zwangläufig nicht alles mit. Hinzu kommt dann noch, dass es schwer ist, sich unmissverständlich auszudrücken, wenn man nur wenig Zeit hat.\nEs ist also durchaus auch drin, dass eure Beruhigungsversuche von einer Partei missverstanden wurden. Das kann beide Seiten betreffen. Entweder wurde es vom Angesprochenen nicht richtig aufgefasst oder es hat für euch einfach netter geklungen als es tatsächlich war.\nDas ist alles eine vollkommen normale Sache und kein Beinbruch.","replies":[{"poster":"Psydelick","date":"2015-04-24T13:00:03.526+0000","up_votes":1,"down_votes":2,"body":"hö gegen was hat es den verstoßen? :o es ist ein ganz normales Bild O.o \n\n\n> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=GjT0Bj2v,comment-id=0003000000000000000000000000,timestamp=2015-04-24T12:13:57.854+0000)\n>\n> Vielleicht hat der Spieler einfach gemerkt, dass da offensichtlich jemand denkt, er habe kein Brain :)\n\nich denke eher weniger^^","replies":[{"poster":"eingew","date":"2015-04-24T13:14:41.571+0000","up_votes":2,"down_votes":1,"body":"Ja, weil du überzeugt davon bist, dass er kein Brain hat.\nArroganz ist blind. Blindheit ist Unwissen. Unwissen ist Hass. Hass ist... nicht ansatzweise durchdacht.","replies":[{"poster":"Psydelick","date":"2015-04-24T13:23:22.557+0000","up_votes":1,"down_votes":0,"body":"hättest du es gesehen hättest du es auch gesagt glaube mir und es ist auf das Game verhalten bezogen nicht das er allgemein kein Brain hat :) ich sollte eine Youtube Serie starten den hätte Bronze 5 für mich ein Sinn :D aber dank euch bin ich wieder guter Hoffnung und bin die ganze zeit wieder am ranked spielen^^","replies":[{"poster":"eingew","date":"2015-04-24T13:54:16.660+0000","up_votes":2,"down_votes":1,"body":"Es macht überhaupt kein Unterschied worauf du das beziehst, wenn du ihm sowas vermittelst wird es das merken, die meisten Menschen tun das, und sei es nur unbewusst.\n\nUnd wenn du eine Serie auf YT startest musst du dich auf eine Menge bereits etablierter Konkurrenz gefasst machen :P","replies":[]}]}]},{"poster":"drexxsack","date":"2015-04-24T13:07:48.515+0000","up_votes":2,"down_votes":1,"body":"> Andere Spieler melden\n> Bitte meldet einen möglichen Fall von Fehlverhalten eines Spielers nicht in diesen Foren. Wenn ihr mitbekommt oder hört, dass eine andere Person gegen die Regeln verstößt, nutzt die Report-Funktion oder schickt uns ein Ticket, so dass wir den Vorfall untersuchen und entsprechend vorgehen können. Wir wissen, dass Spieler andere mit besten Absichten öffentlich anzeigen, aber oftmals führt das nur zu Hexenjagden und kaum jemals zu positiven Diskussionen. Wir werden Maßnahmen gegen Spieler ergreifen, die gegen Regeln verstoßen haben, also meldet diese Spieler bitte auf korrekte Weise.\n> \n> Moderatoren halten nach Folgendem Ausschau:\n> ● Beiträge, die andere Spieler des miesen Verhaltens im Spiel bezichtigen\n> ● Beiträge, in denen anderen böswilliges Verhalten vorgeworfen wird\n> ● Beiträge, in denen anderen Cheaten, Betrügen oder die Inanspruchnahme unerlaubter Dienstleistungen vorgeworfen wird\n> ● Beiträge, in denen Anderen Rumtrollen in Foren vorgeworfen wird (dafür gibt es die Meldefunktion)\n\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/NAoZxZxA-allgemeine-regeln\nEs ist offensichtlich, wen du meinst.","replies":[{"poster":"Psydelick","date":"2015-04-24T13:16:39.895+0000","up_votes":1,"down_votes":1,"body":"ok den lösche ich es obwohl den die Hälfte kein Sinn mehr ergibt was  von euch geschrieben wurde weil die anderen damit nichts mehr anfangen können und nichts zusammen passt .-. es scheint mich jemand ziemlich zu hassen das er alles von mir dislikt :D ","replies":[]}]}]},{"poster":"eingew","date":"2015-04-24T12:13:57.854+0000","up_votes":2,"down_votes":1,"body":"Vielleicht hat der Spieler einfach gemerkt, dass da offensichtlich jemand denkt, er habe kein Brain :)","replies":[]}]}]}]},{"poster":"eingew","date":"2015-04-24T11:32:17.638+0000","up_votes":2,"down_votes":1,"body":"Ja, Leaver sind nervig und machen keinen Spaß. Aber sie sind kein Grund, warum du nicht aufsteigst.\n\nUnd wenn es rein ums lernen geht sind Spiele, in denen man 4v5 eigentlich deutlich effektiver. Es ist schwerer, also lernt man auch besser dadurch. Aber nur, wenn man den Leaver als willkommene Hürde sieht, einen Berg, den man gerne erklimmt. Tut man das nicht, sondern beschwert sich über den steileren Weg braucht man sich nicht wundern, dass man nicht auf dem Gipfel ankommt.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2015-04-24T10:27:28.393+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Psydelick,realm=EUW,application-id=KYnfKGf0,discussion-id=GjT0Bj2v,comment-id=0003,timestamp=2015-04-24T00:15:46.707+0000)\n>\n> aber seit dem ich damals 2013 mein Acc versaut habe in dem ich viel zu früh ranked angefangen habe komme ich aus Bronze nicht mehr raus \n\nÄhm... habe ich damals auch. Und ich hatte die ungute Angewohnheit viel zu oft nachts um 3 betrunken die Pre-Rework Karma im Ranked zu spielen und mich dann zu wundern, dass das nicht klappt... ich trage deswegen bis heute eines meiner 2 \"Bronze II\" Beschwörer Symbole... darf mich aber inzwischen Platin nennen... nur um zu beweisen, dass man da raus kommt, wenn man selber besser wird. Aber man muss halt den Willen und die Zeit haben um sich zu verbessern...\n\nUnd ja, ich habe 2013 mit den selben \"Noobs\" gespielt wie du damals und heute...","replies":[{"poster":"Psydelick","date":"2015-04-24T11:08:08.483+0000","up_votes":1,"down_votes":3,"body":"ich finde damals war es aber nicht so schlimm wie heute kann aber auch täuschen da ich dieses Jahr erst angefangen wirklich Aktiv zu spielen und mich immer Informiere Patchnotizen Summoner inn etc. die anderen 2 Jahre wundert es mich nicht das ich da auch Bronze war :D","replies":[]}]}]},{"poster":"Grona1992","date":"2015-04-24T08:02:12.836+0000","up_votes":2,"down_votes":1,"body":"> zu meinem Bild muss man wohl nichts sagen oder? ich stecke bald seit einem Halben jahr drin fest ich habe in Normals positive stats ich meine keine ingame stats sondern wirklich win und lose das können wohl nur die wenigsten behaupten. \n\nJa zu deinem Bild muss man nix mehr sagen...\nErstens ist nicht ersichtlich WANN Xin und Leona geleavt sind. \nZum zweiten hast du Eine Teambeteiligung von 5 was 1 mehr ist als der Afkler\n5von 12 ist als TANK eine grottenschlechte Teambeteiligung wenn man sich Teambeteiligung von Cait, Xin und Ez anguckt. \nDa Xin und Leona ein sehr gutes Game abgeliefert haben (Beide sind nicht 1 mal gestorben) kann man davon ausgehen das sie entweder DC durch Riot oder so hatten, ein Flamer im eigenen Team was den Ragequit provosiert hat (was ich sehr wahrscheilich finde da 1 Person im Abschlussscreen das game nicht einfach abgetan hat als lose sondern anfing Riot zu Flamen ;-) ), oder ein Reallife Notfall entstanden ist was man niemanden übel nehmen kann. \n\n> aber seit dem ich damals 2013 mein Acc versaut habe in dem ich viel zu früh ranked angefangen habe komme ich aus Bronze nicht mehr raus ich habe auch ehrlich gesagt nicht mehr den willen da zu ich weiß nicht warum 4vs5 games überhaupt gewertet werden das ist das dümmste System was es gibt die jenigen die afk gehen sollten am besten gleich 50 Strafpunkte oder so bekommen -.- \n\nWenn man das tuen würde würdest du ewig in Bronze 5 bleiben, da Bronze 5 nunmal das untere Ende ist! Das heißt wer Bronze 5 ist hat eine Extreme Chance auf Afkler und das würde sobald dein MMR dieses Niveau erreicht hat das Problem mit sich führen das man ein MMR Jojo aufbaut da es immer Afkler geben würde und die frage nicht mehr ob sondern wieviel Afkler pro Team sind. Des weiteren habe ich 2013 Silber angefangen ohne dort hinzugehören habe 2014 in Bronze 5 gestartet und habe mich selbst auf Silber hochgecarryt. Also funktioniert deine Argumentation auch nicht. Die Normal Statistik hat des weiteren gar keine Aussagekraft dein Normal \"MMR\"(!) kann (!)  auch so tief liegen das du mit leuten gematcht wirst die dir einfacht total unterliegen sind.Besser werden funktioniert garantiert wenn man sein Spiel verbessert, aufhört zu Flamen oder auf Flamer zu achten (TAB-> Mute! ein wahres zaubermittel!), statt Meta die eigenen Champs zu spielen und einfach auch mal verlieren kann.","replies":[{"poster":"Psydelick","date":"2015-04-24T11:04:35.827+0000","up_votes":1,"down_votes":1,"body":"sie sind recht früh afk gegangen wodurch wir den erst die Bot verloren haben ein Bronze Spieler Kann nur schlecht gegen 1vs2 spielen das hat sich den im späteren game natürlich auch auf die anderen Lanes ausgewirkt ich trainiere Meta champs erst bevor ich sie im Ranked spiele also ich komme mit Malph und Corki gut klar ich spiele aber auch im Jungel warwick was überhaupt kein Meta champ ist :) und ich kann verlieren nur wenn ich den 4. hintereinander verliere bin ich echt Depri was ich momentan versuche zu vermeiden und Flamen tue ich garnicht Flame=Lose im gegen teil ich versuche meinem Team gut zu zu reden was schon einige Games gewendet hat :) natürlich weiß ich das ich auch Fehler mache woraus ich immer versuche zu lernen ich will nicht die ganze schuld auf mein Team schieben :)","replies":[]}]},{"poster":"Sanctuary2056","date":"2015-04-24T05:33:33.195+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Debels,realm=EUW,application-id=KYnfKGf0,discussion-id=GjT0Bj2v,comment-id=,timestamp=2015-04-23T23:30:13.533+0000)\n>\n> sicher einige von uns in ihrer Elo festsitzen weil sie andauernt Leaver drin haben oder leute mit DC&#039;s.\n\nSicher nicht. Es werden wohl nahezu alle von uns letztenendes eine höhere Elowertung haben, als wir sie hätten wen es keine leaver gäbe. Denn wie du richtig erkannt hast, verlieren meißt 4 und es gewinnen aber 5. Das bedeutet es existiert ein Eloüberschuss bei den Nicht-leavern. Es ist eigentlich nur die Frage wie lange das dauert...\n\nMal ne Frage, warum spielst du nicht einfach dota statt lol, wenn dir die Lösung dort besser gefällt?","replies":[{"poster":"Debels","date":"2015-04-24T18:09:47.939+0000","up_votes":1,"down_votes":0,"body":"Ich spiele kein Dota  , mir persönlich gefällt es auch nicht , da macht mir Lol einfach mehr spaß. Das man in Dota das spiel pausieren kann weis ich auch nur von einem Kumpel. Aber es ist ja auch nur ein Vorschlag von mir. Weil es ist schon echt Schei** wenn einer aus meinen Team oder bei dem Gegner Afk geht  oder einen Disconnect  hat. Lieber hab ich ein faires 5v5.","replies":[]}]},{"poster":"Ârrow","date":"2015-04-23T23:39:19.251+0000","up_votes":1,"down_votes":0,"body":"Die Idee mit der Pausierung in LoL, wäre evtl auch eine gute alternative das Spiel etwas fairer zu gestalten, wenn man davon absieht das da mal jeder mitspielt da man in Dota ja als gegner ganz einfach das Spiel weiterlaufen lassen kann, und diese pausierung ja nur begrenzt einsetzbar ist. Sprich man muss wieder eig drauf hoffen das die Gegner fair sind und das nich weiterlaufen lassen würden dann wärs wieder unfair mit 4 vs 5 ^^  Aber so als Grundidee ganich so verkehrt da dieses verlieren weil man einer weniger is echt deprimierend ich als Main Support kann das nich so hart carryn :D{{item:3070}}","replies":[]},{"poster":"three stodges","date":"2015-05-20T13:52:42.676+0000","up_votes":1,"down_votes":2,"body":"Riot ist einfach nicht in der Lage  ein System gegen afk / dc Spiele  zu erstellen weil Sie einfach unfähig sind  Ich weiß wie aber mich bezahlt keiner dafür ^^","replies":[]}]}