{"poster":"DamianSoler","date":"2016-09-25T22:31:27.543+0000","title":"Dudas sobre sistema de Calificacion (supports)","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Estimados colegas\r\nhoy jugue con Soraka support y sal&iacute; con un KDA de 1/0/37 que esta lejos de ser perfecto pero claramente no amerita una B+ y me hizo preguntarme: &iquest;en que se fija realmente el sistema de calificaciones?\r\n\r\n[Captura de pantalla de la partida](http://i66.tinypic.com/fwlz7a.png)\r\n\r\nSaludos","replies":[{"poster":"JD20","date":"2016-09-25T23:43:36.261+0000","up_votes":1,"down_votes":0,"body":"TODOS están equivocados, el sistema relaciona tus estadísticas (KDA, Farm, Asistencia en torretas/inhibidores, etc) por ej, si tu sacaste B+ sacando 1/0/37 debe haber alguna Soraka de LAS que haya salido por ej: 5/0/48 y ese seguro saco la S, osea, el sistema te compara con todo lo de las otras Sorakas Supp de LAS y se fija si eres mejor que ellas o no. Y si te destacas, sacarás la S","replies":[]},{"poster":"martincarp","date":"2016-09-25T23:10:07.291+0000","up_votes":1,"down_votes":0,"body":"Lo que hace el sistema no es fijarse en KDA o farm, sino que compara tus estadísticas en la partida con las estadísticas promedio del campeón en el servidor.\nEn el caso de una Soraka lo más importante supongo que es participación de asesinatos (tienes un 71%, para ser Soraka es mejorable, pero debería ser suficiente para una buena nota), curación a aliados (probablemente en ésta estuviste flojo), y la participación de objetivos (tu sabrás en cuantas torretas obtuviste al menos una asistencia). Así que busca en alguna de esas estadísticas, o en cualquier otra realmente, y sabrás en qué tienes margen de mejora.","replies":[]},{"poster":"Néd Stark","date":"2016-09-25T22:37:45.942+0000","up_votes":1,"down_votes":1,"body":"Se fija en tu: \nKda.\nFarm.\nWards.\nContribución dentro del las tf.\nContribución con los objetivos.\nY no se que mas se si algo me lo pasé por alto.","replies":[]}]}