{"poster":"Tkelly219","date":"2018-05-13T03:10:48.892+0000","title":"WHAT IS THIS LEAVERBUSTER?!?!?!","subforum":"Player Behavior","up_votes":1,"down_votes":6,"body":"Hey riot I have been a long time league fan and love to play even with everything that sometimes can almost ruin the game, but I deal with it and love it. The only thing that I have had a problem with is the leaverbuster system. I totally understand that it can be annoying and can ruin games when people leave but sometimes people have a life...\r\n Here are my points, leaverbuster for missing a que or not picking/banning a champ shouldn&#039;t give you more than 5 min leaverbuster, afk no more than 10 min, and for leaving a game no more than 1 hour total time (15 per que) for leaving a game. I just got leaverbuster for 30 for the nest 5 games... because I missed banning a champ?!?! what is that? \r\n   The thing of it is riot that not everybody has a whole day to just sit and wait out 2 1/2 hours of waiting, that&#039;s just not right to do to people with regular everyday lives. I love league but I&#039;m sorry I cant play unless this is removed from my acc. I just don&#039;t have time to wait that out when I only have about 1 hour segments to play, which means waiting 30 min then playing a 45 min game aint gonna work. Please fix this it just isn&#039;t right to do to honest good players.","replies":[{"poster":"Silent Gravity","date":"2018-05-13T03:22:13.097+0000","up_votes":5,"down_votes":0,"body":"The leaverbuster system always always, even on the harshest 20 minute LPQ, uses less time than was wasted by the person going AFK.\n\nIf this amount of time is seen as bad, then you should stop wasting the time of 9 other people.","replies":[]},{"poster":"breakordoom444","date":"2018-05-13T06:11:59.913+0000","up_votes":2,"down_votes":0,"body":"Quoting is fucking broken rito plz fix\n> \n> Hey riot I have been a long time league fan and love to play even with everything that sometimes can almost ruin the game, but I deal with it and love it. The only thing that I have had a problem with is the leaverbuster system. I totally understand that it can be annoying and can ruin games when people leave but sometimes people have a life...\n> \n\n\nWell AFking one or two games won't give you leave busters, its constant and(or) a pattern of behavior, if you know something might go wrong, dont play the game.\n\n\n> Here are my points, leaverbuster for missing a que or not picking/banning a champ shouldn't give you more than 5 min leaverbuster, afk no more than 10 min, and for leaving a game no more than 1 hour total time (15 per que) for leaving a game. I just got leaverbuster for 30 for the nest 5 games... because I missed banning a champ?!?! what is that?\n> \n\n\n5 minutes is a good time for you to finish whatever you were doing, and leaving the game at all will only hurt your team, I doubt you were leavebustered for doing that **_ONCE_**, if its a pattern of behavior, know what to ban for what position.\n\n\n> The thing of it is riot that not everybody has a whole day to just sit and wait out 2 1/2 hours of waiting, that's just not right to do to people with regular everyday lives. I love league but I'm sorry I cant play unless this is removed from my acc. I just don't have time to wait that out when I only have about 1 hour segments to play, which means waiting 30 min then playing a 45 min game aint gonna work. Please fix this it just isn't right to do to honest good players.\n> \n\n\nWell its not Riots fault that you only have one hour to play, and Riot isn't going to remove your account restriction becuase of you alone, if they do it can be exploited at great numbers.\n\nI suggest you just do it on ARAM.\n\nEDIT: IT WORKS HAHAHAHAAH","replies":[]},{"poster":"AJStarhiker","date":"2018-05-13T04:22:25.567+0000","up_votes":2,"down_votes":0,"body":"Last I checked, queue dodging is on a separate penalty system from LeaverBuster.  It does *not* affect more than the next game and you do not have to be in an active queue while waiting.  It also resets on a daily basis.\n\nQueue dodge penalties are there to make sure players think about whether the dodge is worth it (obvious troll vs. the time and minor LP loss). It's also designed to minimize damage for players who realize *before the game starts* that they won't be able to finish a game.  If they aren't coming back, the timer doesn't matter to them, since it will have expired before they return.\n\nThat said, multiple dodges will result in longer timers for each dodge.  That's to discourage trivial dodges, such as a viable off-meta pick.","replies":[]},{"poster":"Kei143","date":"2018-05-13T03:17:01.381+0000","up_votes":1,"down_votes":0,"body":"I think you should learn to split up your points to make things easier to read, instead of a block of text.","replies":[]}]}