{"poster":"Sethane","date":"2015-08-21T05:37:17.153+0000","title":"New Rengar Skin","subforum":"Player Creations","up_votes":3,"down_votes":0,"body":"I was talking to some mates of mine about new idea&#039;s for champ skins. The best by far was surprise party Rengar XD We all love the surprise party Fiddlesticks and now Amumu&#039;s addition too the skin collection I see it a great follow up with the next installment to be a Rengar.","replies":[{"poster":"Suki no Sukiru","date":"2015-10-08T04:51:12.647+0000","up_votes":2,"down_votes":0,"body":"imma rengar main and i support this.{{champion:107}}","replies":[]},{"poster":"ninjaIRL ","date":"2015-08-21T09:51:10.052+0000","up_votes":2,"down_votes":0,"body":"[Here](http://boards.oce.leagueoflegends.com/en/c/player-creations/nELO4QPg-surprise-party-rengar) is someone who has already recieved 247 views from the same idea.\n[Another one](http://forums.na.leagueoflegends.com/board/showthread.php?t=3661316) from the forums way back when.\n[Another](http://forums.oce.leagueoflegends.com/board/showthread.php?t=37434) with 33 upvotes from the forums.\n\nGreat idea!\nThough, I suspect Riot wants AoE heavy champions to have the theme but I personally don't think it should be the case.","replies":[{"poster":"Sethane","date":"2015-08-22T02:30:51.588+0000","up_votes":1,"down_votes":0,"body":"I didn't think about the AOE thing. That is a good point. Though I can't think of many people who have a AoE ability that would fit the surprise party theme","replies":[]}]},{"poster":"SilentXKiller","date":"2015-10-03T10:11:34.476+0000","up_votes":1,"down_votes":0,"body":"To be truthful, I'm pretty sure each set of skins e.g. surprise part, marauder, pentakill, etc all have 5 people in it max excpet for unique skins which only one champion will have. SO, basically Penatkill skins have 5 champions, Marauders have 4 and another will be released soon. I'm pretty sure surprise party already has: Soraka, Nami, Udyr, Amumu, Nasus. Fiddlesticks being a seperate one since it is not in the same splash art???","replies":[{"poster":"Sethane","date":"2015-10-07T09:44:19.325+0000","up_votes":1,"down_votes":0,"body":"Soraka, Nami, Udry and Nasus don't have suprise party skins. Yes they are in the same splash art but their skins are under different names. There are a lot of similarities with Suprise party Fiddle and Amumu just like Definently not BLitz and Udry. Yet Udry and Amumu are in the same spash are for the skins. Also Soraka's and Nami's skin only apply too them due too meme's or popular things in the community. So they are both one of a kind skins. I think this splash art is just a one of a kind and only set that way because of their release dates.","replies":[]}]}]}