{"poster":"DarkSerenade","date":"2015-12-06T20:07:51.984+0000","title":"[GAMEPLAY] Caitlyn can place over 3 traps","subforum":"Report a Bug","up_votes":2,"down_votes":8,"body":"While playing a normal game and later on a ARAM, Caitlyn is able to place more than 3 traps down total. I know that originally it was 3 but during ARAM I noticed that she had 5-6 TRAPS out at the same time. Its incredibly unfair and difficult to play when the whole lane is being blocked up. I noticed this in a Normal game a few weeks ago also. I dont have a video/picture of it unfortunately but please try to fix this, Thank You :)","replies":[{"poster":"moonstones","date":"2015-12-07T18:23:41.116+0000","up_votes":1,"down_votes":0,"body":"As others have mentioned, this is working as intended and was part of the marksman update. :]","replies":[{"poster":"Hupsis","date":"2015-12-07T18:29:18.544+0000","up_votes":2,"down_votes":0,"body":"Has the hitbox been reduced on the traps? Sometimes when I'm purposefully trying to step on them as a support, I just walk past it. Before the update it would have activated when stepping on the edge of the trap but now you pretty much have to step on the muffin part of the trap to activate it. Nothing wrong with this system (since she can place so many traps now) but I'm just curious if it's just my imagination or an actual change.","replies":[{"poster":"moonstones","date":"2015-12-07T21:43:01.320+0000","up_votes":1,"down_votes":0,"body":"I poked Champion Update about this - yup, we did make the hitbox smaller!","replies":[]}]}]},{"poster":"Zombiemaster","date":"2015-12-06T20:28:14.472+0000","up_votes":2,"down_votes":0,"body":"Apparently someone didn't read the patch notes. In patch 5.22, Riot changed her traps so that she can have 3-5 maximum traps out at once, depending on the rank of the ability.","replies":[]},{"poster":"Gon Freecss GR","date":"2017-04-07T05:06:07.085+0000","up_votes":1,"down_votes":0,"body":"Hey there why dont you consider make some characters out of anime like Luffy from one piece and Rorronoa zoro, or gintama or naruto one piece characters tho would be the best even if you buy the rights if nessesary it would be an increase on both of the players number and also in the income as you can add features like skins or something else i dont know for these champs","replies":[]},{"poster":"TheLastShadow45","date":"2015-12-06T20:50:14.458+0000","up_votes":1,"down_votes":0,"body":"levels 1-5 in order 3/3/4/4/5","replies":[]},{"poster":"Punkkee","date":"2015-12-06T20:14:34.406+0000","up_votes":1,"down_votes":0,"body":"uhm that's intentional she can place 5-6 traps now","replies":[]},{"poster":"Primaquarius","date":"2015-12-06T20:13:58.289+0000","up_votes":1,"down_votes":0,"body":"<Ackbar>","replies":[]}]}