{"poster":"Long Dong Wukong","date":"2014-12-05T15:25:00.070+0000","title":"It's almost time for me to give up on Jungle Wukong","subforum":"Gameplay","up_votes":17,"down_votes":7,"body":"**(Before anyone asks or makes an assumption, no, I didn't just lose, I went likr 4/0/4 or something.)\n**\n\nIt's gone from non-meta but viable to pretty much pointless.\n\nYou feel weak for the entirety of the match. You simply don't get the experience or gold required to function anymore. Each camp is half of your health, the two potions barely keeping you afloat for half of a clear even with Lifesteal Quints.\n\nI've done Krug/Gromp, Buff, Buff, Recall. I've done Krug/Gromp, Buff, Camp, Camp, Recall, Buff. No matter what you do, you're wide open for invasion because you're at 40% health AND recalling, and then you're wasting your buff time not being able to gank. You're playing catch-up on levels the entire time, never simply even or ahead. You're behind in items because there's no gold income. Conservation beforehand was enough extra income for Wukong to complete core items, even if they were a little behind a top laner's pace. Now you practically won't finish an item for 20+ minutes unless you end up 6/0 at 10 minutes somehow.\n\nAnd then to top it off, they're nerfing Ranger's Trailblazer next patch to where it has the standard 60s smite cooldown. Recalling and picking that up to bullshit some sustain with the stun and Decoy was the only way to actually get anything done, even though you still started to fall behind on levels.\n\nCan you still do it? Sure, but why would you bother? Poppy is just as effective at clearing and sustaining camps. That is to say, fucking terrible at it but you can still BARELY do it if you don't want to accomplish anything.\n\nI really expected at the very least another potion by now, but I guess heavy sustain like Warwick is doing too well because the additional buttfuckery doesn't really affect them because they heal through it regardless.\n\nRecalling after getting both buffs or recalling in the middle of your first clear just isn't acceptable if you're in a match you actually want to win, i.e. ranked. I'll give it till the end of the preseason, but I'm just about done bothering. I still enjoy him top because you have the income to actually do something, but feeling weak as fuck for the entire match if I jungle is boring. Which is sad, because I WAS a jungle main, but it's just boring now.\n\n*Edit - Just to add, maybe he's still good, he's okay-ish after the first clear. But it's just a bitch to deal with so I'm about done with it*","replies":[{"poster":"Poldy Scarecrow","date":"2014-12-05T19:41:41.200+0000","up_votes":9,"down_votes":0,"body":"First off props for making this thread OP. \n\nEve/ Naut/ Sej are worse off and definitely need buffs but that aside- poor monkey...  There are lots of fairly popular threads for each of the weak junglers   but noone seems to care that wukong suffers there as well. \n\nHe's permanently susceptible to invades and ranger's trailblazer was a huge help. I know lots of people say he's a top lane first but damn he gets bullied there almost as hard as in the new jungle. No champion should have to start the game with flask + pots (in lane) and have to rely on level 2 cheese to do well. And no jungler ( who got a leash especially ) should Have to recall just clearing the first 2 camps.\n\nWu somehow manages to perform well due to stealth and his ult but any smart team can destroy him early in lane or jungle due to poor dueling potential, no sustain and mana issues. I do understand the reason for his weaknesses, I just hope that he is included with sej, naut and eve etc in proposed fixes so jungling with them won't  be so risky and laborious.\n\nPS: I really do like the new jungle camps, buffs and changes. Would just like to see some junglers brought up to par is all.","replies":[{"poster":"Castanean","date":"2014-12-06T02:01:09.037+0000","up_votes":4,"down_votes":0,"body":"Alright, while not really directly related to Wukong, I'm gonna have to word in here, as a Sejuani main.\n\nI don't know about {{champion:28}} and {{champion:111}} , as I don't actually play them, but {{champion:113}}  is still very, VERY viable in the jungle. All you have to do to make her stronger in jungle is make some small, non-typical changes to your masteries. My Sejuani masteries are 0/19/11, and just switching from my regular jungle masteries to that improves performance by a lot. Then there's the path you take. With Seju, I typically go Blue, Wolves, and then I chose if I should go to krugs or Red depending on my health and the cooldown on smite, which I save for red buff. Of course, runes should probably also be taken into account. I, personally, have 9 AD marks, armor quints and seals, and CDR glyphs. Don't ask why I have CDR. Just, please, Don't. Because I don't know. It just works.\n\nBut the point is; This works. And that MAY be the case for some other junglers too. As a rioter once said; try new things out. Maybe your favourite junglers get more viable if you make some small, unusual adjustments to the runes and masteries.","replies":[{"poster":"Poldy Scarecrow","date":"2014-12-06T03:28:10.853+0000","up_votes":1,"down_votes":0,"body":"Hey thanks for the tip bro, will definitely try it out. Some fault on my part for not having tried sej in the new jungle. She had it tough in s4 and with wu and the others barely getting by I feared the worst for her.\n\nI remember the comment and I wholeheartedly agree on trying new masteries, runes and paths. I'm actually really glad Riot's encouraging the exploration and have been enjoying it so far. However, I do believe that a few junglers remain under par. Instead of ganking, keeping up with the enemy jungler, contending objectives, warding off counterjunglers or counterjungling themselves champs like wu have to divert their resources to just surviving their own jungle. This puts them at a disadvantage to the enemy jungler who most likely has better sustain and clear and is free to do all the things i mentioned above.\n\nThanks for replying to my post and for the valuable sej tip. I wasn't trying to argue if in case my tone came across wrong lol. I basically meant to say that the junglers who have to focus on surviving are overall much riskier picks. Eve for example is purely a jungler so merely surviving should not be an issue. ie if that is her defined role, she should at worst be able to survive and clear without worry.\n\nWrt runes they're expensive and if you have a few basic rune pages you won't be able to explore the full range of options. Since the appropriate runes per each jungler are more diverse it often doesn't make sense buying runes which only work on one champion or which may not work at all.\n\nReally sorry for this long and redundant post. Will continue to try new things but still hope some junglers get some much deserved love. Thanks for your reply.","replies":[{"poster":"Castanean","date":"2014-12-06T13:53:17.177+0000","up_votes":2,"down_votes":0,"body":"No worries. I just wanted to state that Seju doesn't actually need a buff to be viable. Also, I kinda think that this was the point of the jungle update, to make it harder for squishy champions to jungle and make survivability actually worth something in the jungle. Y'know, to make the tanky junglers more viable, since they clear taking less damage than, for example, Master Yi and Wukong. \n\nOf course, side effects are bound to happen that are negative for some. As it goes, you can't make everyone happy. But I strongly doubt that Riot will let it go on for too long. Y'know, Evelynn and Wukong being unable to jungle. They're probably going to buff the currently not-so-viable junglers into being totally viable.\n\nOn another note... I have to apologize, as I don't really know the feeling of having my junglers made unviable. The only junglers I know how to play are Sejuani(my main) and Rammus, the first champion I tried in the jungle. To a lesser degree, I know Yi and Udyr as well, but those two are in a good spot due to their kit andnatural damage. \n\nIf you have any tips to jungling Fiora though, that would be highly appreciated! y'know, BESIDES killing the dragon at level 3.\n\n... Speaking of which, guess what I just discovered! \nhttps://www.youtube.com/watch?v=5gl2Wz9lPBQ","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T16:45:27.256+0000","up_votes":1,"down_votes":0,"body":"Yeah I've linked that video to other topics before and some one posted it here, but that's not easy to do and is heavily latency dependent. At 97-105ms~(which isn't half bad for east coast) you'll get smacked by an auto every so often that you were supposed to dodge, and they add up. It also takes fucking *forever*, and people ward Dragon early now because they're aware of the early dragon bullshittery that can go on in this preseason.\n\nIt's not something that's actually feasable to pull off with Wukong, unlike Pantheon.","replies":[{"poster":"Castanean","date":"2014-12-06T18:17:19.762+0000","up_votes":2,"down_votes":0,"body":"Well, sure. It's not as feasable as pantheon, but it makes stealth-dragons much easier. Especially once you get a few levels higher. So, instead of going at level 3, go at 5, 6. Still early, and you can stealthily de-ward the dragon a bit before you actually go as well. Wukong jungle is still possible, probably, just not Lee Sin levels of effective. Hopefully, he gets a buff though. I'd hate for people to lose the possibility to jungle with champions they like, even though I actually despise going against a Wukong in the jungle.\n\n... And hey, Pantheon's way of soloing the dragon is just silly. No one should have it that easy.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-08T15:35:18.240+0000","up_votes":1,"down_votes":0,"body":"It isn't as effective as Lee/Udyr/Warwick/Nunu/Fiddle/Pantheon/etc. because he can't keep his health up enough to farm *or* gank. It's not that I don't have the possibility to jungle Wukong, but why would I go through the struggle when I can play champions that can do the exact same thing but better? It was stealth ganks and burst damage with the ability to chase their flash that made it a thing previously, and he can still do it, but it's just more difficult to have an impact now to the point that you might as well play some one else as far as effectiveness goes.\n\nBut no, it really isn't a viable option to try to solo a Dragon on Wukong, especially at 5 or 6. It will definitely be warded by then, and it's very difficult to do especially with East Coast latency. You're basically asking for the other team to come kill you and then take a free half health dragon. It's seriously more of a trolly yolo type thing on Wukong. You don't expect it to work, but fuck it you're going to do it anyway.\n\nAlso I don't think Wukong needs buffs in the typical sense, they shouldn't mess with his damage or skills because he scales retardedly hard already. The only thing they could really touch is reverting his Q back to 30% ArP at all ranks instead of 10/15/20/25/30, but that won't really help the jungle and he's decent in lane so there's no reason to. I still advocate the Decoy fearing minions/creeps when it spins at the end. That basically gives you another auto that gets \"absorbed\" and it makes sense because they'd be sp00ked.","replies":[{"poster":"Castanean","date":"2014-12-08T17:31:01.246+0000","up_votes":1,"down_votes":0,"body":"You make very good points, I don't really have much to counter argue it. In addition, to make matters worse for Jungle Wukong, it seems Riot has already made Dragon's basic attacks un-dodgeable, so there's that out the window  for even those with good latency. Although, Pantheon can't block it anymore either, so that's a relief. Panth was a big enough pain already.\n\n> I still advocate the Decoy fearing minions/creeps when it spins at the end.\n\nThis seems like a good idea to help his jungling, at least a little bit. I do hope Riot gives him at least *something* that lets him jungle better.\n\nOh, here's the video about the whole \"Can't Block Can't Dodge\" dragon situation.\n\nhttps://www.youtube.com/watch?v=ImNL-wWI3Tk","replies":[{"poster":"Long Dong Wukong","date":"2014-12-08T19:53:34.869+0000","up_votes":1,"down_votes":0,"body":"Oh god is that on the PBE?\n\nThat no juggle thing in particular is going to make dragons really hard to justify doing... It's going to murder people until like 20 minutes in, lol.","replies":[]}]}]}]}]},{"poster":"Poldy Scarecrow","date":"2014-12-06T18:13:12.952+0000","up_votes":2,"down_votes":0,"body":"Haha cool bro I hear ya- glad to know she's not as bad as I it's being made out to be. \n\nAgree with all your points-  I generally like that the new jungle is tougher and I have the utmost faith in riot. With all the feedback I'm sure they're working on helping the weaker junglers.\n\nHaha no apologies necessary man it's cool. I tend to be paranoid about wu lol. He wasn't mentioned in other  threads and the two I did see were completely ignored. People usually think he's OP, hate him for being annoying or just don't care cuz he's not cool like yasuo, zed or khazix etc. His low popularity and good winrate might mean he'll prob end up going without compensation.\n\nHe isn't completely unviable if you get a leash and the enemy jungler stays out. But having to B early, wasting buff time, low sustain and generally less gold and XP really diminishes your ganks and impact on the game. If your jungle is invaded or your team is behind too then you don't have much of a chance so he can never be a truly safe/good pick.\n\nSorry for talking about Wu so much it just kinda sucks being bullied and having a miserable early game no matter where you decide to play him. It's like he doesn't belong anywhere..\n\nOh man I wish i did but I haven't tried her out yet. Thanks for replying and the video too. Will definitely try it out with both of them lol","replies":[]}]}]}]}]},{"poster":"Mirage Night","date":"2014-12-05T16:17:17.240+0000","up_votes":9,"down_votes":1,"body":"At least he is a viable top lane, Evelynn was only viable in jungle and now she isn't viable anywhere..","replies":[]},{"poster":"Apex Citavista","date":"2014-12-05T20:15:13.480+0000","up_votes":3,"down_votes":4,"body":"I'm a wu kong jungle main. I do just fine in the jungle. Yeah I'm a bit low at the start, and I have ot usually back after my second buff, but Usually when i get around llv 8-9 I have no problem with sustain. and I can gank really easily.  Might have t do with your rune page, if youre still running the old CDR wu kong page.","replies":[{"poster":"OyddAWqJ5r","date":"2014-12-05T22:10:10.193+0000","up_votes":8,"down_votes":1,"body":"hahahaha \"around lvl 8-9\". You mean when the game is over? Lol. I'm pretty sure anyone who goes jungle can sustain perfectly fine once they hit lvl 8 or 9.","replies":[]},{"poster":"Long Dong Wukong","date":"2014-12-06T01:03:14.296+0000","up_votes":2,"down_votes":0,"body":"Some one already said it, but everything sustains at level 9. Level 9 doesn't matter. That's like what, 13+ minutes in or something?\n\nWhat matters is your first clear, and the second clear to a less extent. Your first clear you have to recall at some point, period. You have the option of going Buff, Camp, Buff, to secure your buffs, but then you waste your buff time because you're **definitely** going back. Your other option is Krug/Gromp, Buff, Camp, Camp, Recall, Buff. You can mix and match what camps you want to do all you like, preferably not doing the Raptor, but you're going back and it leaves you wide open.\n\nIt's really bad, man.","replies":[{"poster":"Apex Citavista","date":"2014-12-08T01:57:26.106+0000","up_votes":1,"down_votes":0,"body":"Idk man, maybe it's just your style of play?  I'm only actually able to be invaded on my first clear.  Yeah I have to go back after I do camp>buff>buff, but after that my dueling potential is fine.  Might also be because I dont get rangers trailblazer.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-08T02:33:10.959+0000","up_votes":1,"down_votes":0,"body":"Well, first it's pretty much known and accepted even in the competitive scene that Wukong's clear is fucking ass and he's vulnerable as fuck and weak for the first about 8 minutes, and then the second buff rotation comes and he can function better, but that's 8 minutes of basically not being there for your team. Another thing is that the income is so abysmal in this jungle that you basically are a hobo scrounging around for money trying to finish any core item so you can actually be useful. It's not so much of a playstyle issue as an issue of this is simply how this character functions in their new crap jungle. That is, he doesn't function. He can't really deal with it.\n\nThe champions that don't need gold to fill their role are the ones that are actually good.\n\nNunu counterjungles and objective secures for free no items required, Fiddle sustains for free and ults to delete your team no items required, Warwick W's and suicides into a carry no items required, etc. And it just so happens that even though these characters don't need a lot of income, they end up getting more than the struggling junglers because they have heavy built in sustain so they're in the field longer.\n\nAlso, please buy a Ranger's. It's not really a choice. Riot wanted there to be some choice, but Ranger's is **leagues** ahead of the other Smites. It's that much better.","replies":[{"poster":"Apex Citavista","date":"2014-12-08T03:21:15.340+0000","up_votes":1,"down_votes":0,"body":"I disagree about rangers.  That might be the difference.  My clear on wu kong is just fine most the time, but I get Stalkers Blade, because it helps him out MONSTROUSLY with his ganks, espcially when you hit 6 and I typically gank bottom, it's almost a guaranteed kill.  I don't play farm wu kong, I gank a lot, and I get a lot of gold from that, and a bit from taxing, and I only farm jungle camps between ganks really.  Or I make sure that I own the rivers with the scuttlers to avoid my lanes getting ganked.\nit might also be your items over mine.  I get hydra, not blackcleaver like most because it fits my play style.\nEither way, I don't really have nearly as big of a problem as you playing wu kong, my wu kong play functions just fine.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-08T15:19:29.287+0000","up_votes":1,"down_votes":0,"body":"You don't understand, it isn't about disagreeing. The Ranger's is the best jungle item. It has a 45 second smite cooldown, sustain, AoE damage, and a stun for more sustain. They can buff Stalker's damage by 50 on champions and Ranger's is still better. It's not a matter of opinion on this one. You're taking a counter-intuitive item that forces one of your summoner's to be stretched between two roles. \n\nThink of all the times that you didn't have smite for a gank because you had to use it on a camp that was whooping your ass. Think of all the times that you didn't have smite for a camp because you just used it on a failed gank. And no, a small two second slow on a 60 second cooldown doesn't magically make you have a 100% gank rate. If you're saving your smite specifically for ganks, you're not only predictable but **way** behind the other jungler because you're jungling so ungodly slow. If their Udyr isn't a God compared to you while you're roaming around barely doing camps, then he wasn't playing correctly. \n\nUdyr can do what you do and still heavily outfarm you. Warwick outpaces you to 6 and shits on your team. Nunu eats all of your shit and you fall behind because you can't stop him and you sure as hell aren't going to successfully gank a level 8 as a level 5. etc.\n\nIt's not a matter of me having a problem playing Wukong. I do perfectly fine and know precisely how to do it. It's just so garbage early that it isn't a real pick anymore. It's a struggle to play Assassin-esque champions in the jungle now. Kha'Zix is a bitch, Evelynn is dead, Wukong is a bitch, etc. People that actually know what they're doing know Wukong is balls weak early and WILL come kill you or take your shit while you're back if they're playing Lee/Udyr/Nunu/Trundle/etc. And you *are* weaker than a current strong pick for the first 15 minutes. Wukong needs items and levels that he can't come up with in this jungle, they don't. That's why they're strong right now.\n\nIf they let you get away with being weak and don't punish your team for it, Wukong eventually scales hard and can cause serious damage. But good players are going to make your life hell.\n\nThey are nerfing Ranger's next patch however, so we'll see how bad that wrecks everyone but the sustainers. I think it'll kill Evelynn outright, as if she wasn't already dead.","replies":[{"poster":"Apex Citavista","date":"2014-12-10T07:23:13.630+0000","up_votes":1,"down_votes":0,"body":"It is bought the most, that doesn't make it the best.  It's used primarily on farming junglers.\nI watch diamond/masters/challenger games all the time whenever I see a wukong in the game, and almost EVERY time, they get stalkers blade, NOT trailblazer.  So while it might be \"the best\", doesnt mean that it's best for him.","replies":[]}]}]}]}]}]}]},{"poster":"TehNACHO","date":"2014-12-05T16:10:15.122+0000","up_votes":1,"down_votes":0,"body":"I actually had an amazing game recently as Wukong camping a lane all day, lol.","replies":[{"poster":"Saevum","date":"2014-12-05T16:16:56.657+0000","up_votes":2,"down_votes":0,"body":"> I actually had an amazing game recently as Wukong camping a lane all day, lol.\n\nYeah, cause its easier than getting the camps clear in the first levels.","replies":[{"poster":"TehNACHO","date":"2014-12-05T16:32:03.539+0000","up_votes":1,"down_votes":0,"body":"That's the point, imo.\n\nHe's a much more burst based Jungler, making him much better at ganking lanes with significant CC, or counterganking extended engages.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-05T17:02:08.210+0000","up_votes":5,"down_votes":0,"body":"The point is that you can't actually be there to countergank or gank after your first clear. You're effectively delayed two minutes longer than the current strong junglers.\n\nIf you go to gank at 40-50% health, you're making a very risky gamble that you aren't going to walk into their jungle or get your laner and yourself doublekilled.\n\nSince that's generally unwise, you recall. Now you're off the map while their jungler is still on.\n\nI've had successful games, I've had 15/3/10 games etc., so don't get me wrong. It's not like you just can't get anything done. It's that it generally feels like I'm weak as fuck even after 2 or 3 kills because the jungle is giving so little return on exp and gold for how much it sets me back gank-wise. So if I spam ganks, every unsuccessful one is wasted time because I don't get experience or gold out of it, and if I try to clear camps, it's worse gold and experience by far than laning and I lose too much health to gank.","replies":[]}]}]}]},{"poster":"WooBeeWoo","date":"2014-12-06T00:09:56.602+0000","up_votes":3,"down_votes":0,"body":"This is why I hate the new jung. Yeah you can make it through but its not fun to play catch up ALL game so you really cant make it through. Before when I got in a ranked game I had options (Vi, Elise, Wu, Panth, Lee, Udyr, Skarner) and even not ranked viable picks like Naut I could play normals and have fun.... now its like WW panth or bust and I think the jungle just isn't fun anymore. Which sucks considering Its 95% what I like to play so instead of playing daily like I used to I play like a game a week and I come to the boards and stuff to see if things change","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T17:16:16.168+0000","up_votes":1,"down_votes":0,"body":"I like the ideas, and it's fine on stuff with heavy sustain. I just don't like how it changed the pacing of the match to basically be *Early Game almost doesn't matter, Mid & Late are all that's important*. I can play DotA if I wanted to play something with slow ass pacing.\n\nI guess it's basically Riot's way of saying get the fuck out of the jungle, and that's fine I guess.","replies":[]}]},{"poster":"disregardable","date":"2014-12-05T15:30:50.360+0000","up_votes":3,"down_votes":0,"body":"Yeah, Wu is a gank-reliant jungler. So are tens of others.","replies":[]},{"poster":"Cale017","date":"2014-12-05T17:00:01.960+0000","up_votes":1,"down_votes":3,"body":"He was always a top first and a jungle second anyways. It shouldn't surprise anyone that a champion who wasn't designed with the jungle in mind is having a harder time now when even champs who WERE designed for the jungle are struggling.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-05T18:52:50.183+0000","up_votes":5,"down_votes":1,"body":"Vi was designed to be a top too, lol.\n\nBut yes, the jungle is currently heavy sustain or gtfo","replies":[{"poster":"Lajinn5","date":"2014-12-06T04:34:38.065+0000","up_votes":1,"down_votes":0,"body":"> Vi was designed to be a top too, lol.\n> \n> But yes, the jungle is currently heavy sustain or gtfo\n\nOf course she's a top, I see no world in which Vi is a bot laner","replies":[{"poster":"Brenticus12","date":"2014-12-06T15:30:31.598+0000","up_votes":1,"down_votes":0,"body":"And she can still reliably jungle, that was the point he was making.\nAnd I've tried Vi bot with Thresh support, pretty fun, we did pretty well.","replies":[]}]}]}]},{"poster":"Gigahappytown","date":"2014-12-06T16:56:03.480+0000","up_votes":1,"down_votes":2,"body":">ITT op trys to play a gank heavy jungler as a farming jungler","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T17:09:18.133+0000","up_votes":2,"down_votes":0,"body":"ITT can't gank without health and you have 40% and no potions after you first clear, whether you go Buff/Camp/Buff or Krug-Gromp/Buff/Buff or Krug-Gromp/Buff/Camp/Camp\n\nYou're recalling as Wukong in the middle of your first clear at some point regardless, unless you're just some crazy fuck who actually wants to gank at 40% health as if the laner isn't going to blow you up on sight.\n\nWould you rather me gank at level two by just going Red -> Gank? Kek.","replies":[{"poster":"Gigahappytown","date":"2014-12-06T19:01:24.344+0000","up_votes":1,"down_votes":2,"body":"> ITT can't gank without health and you have 40% and no potions after you first clear, whether you go Buff/Camp/Buff or Krug-Gromp/Buff/Buff or Krug-Gromp/Buff/Camp/Camp\n> \n> You're recalling as Wukong in the middle of your first clear at some point regardless, unless you're just some crazy fuck who actually wants to gank at 40% health as if the laner isn't going to blow you up on sight.\n> \n> Would you rather me gank at level two by just going Red -> Gank? Kek.\nYou said that everytime you would try to farm the jungle as wukong you would lose too much health\n\n\nYour not supposed to farm the jungle\nyour supposed to farm champions","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T19:15:06.778+0000","up_votes":1,"down_votes":0,"body":"You're**\n\nBut anyway, uh, you have to keep up in levels to farm champions and there's not always some magical gank opportunity. Not only does every gank not always work, but there are times when there's nothing to do on the map and you need to kill your own camps to occupy the time to keep yourself relevant. It's like this for everyone, except the camps beat Wukong's asscheeks off until he has enough items to delete the camps before they hurt him.\n\ni.e. he gets fucked up for about 8 levels.","replies":[]}]}]}]},{"poster":"Omega360","date":"2014-12-05T23:05:50.679+0000","up_votes":1,"down_votes":0,"body":"I agree with this for the most part, but the only thing is that I managed to win a game or two with Wukong jungle.  I most certainly agree he feels way behind on gold and exp, but if you build him right you can get through pretty well.\n\nIn the game I had success in, I did indeed go traiblazer into warriors enchantment, b/c devourer doesn't work very well on him, since he can barely clear, and not with any speed.  After that I bought a pickaxe and sat on it, til I built some tanky items.  If you decide you want to try any other item, you will most likely fail without trailblazer regen and the straight damage and pen (soon to be bonus dmg vs champs) warrior enchantment provides.\n\nFor sure, there are better junglers out there, unless you plan on ult syncing with a yasuo, that can do everything Wukong does but better and easier (I can definately say Xin Zhao is really good in new jungle, just go trailblazer, devourer, and tiamat and you're good for dmg).\n\nIf you want I can go into detail on what kind of runes, masteries and jungle path I used, but I don't plan on picking Wukong more than Xin right now.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T16:33:38.109+0000","up_votes":2,"down_votes":0,"body":"I've won a bunch of games as Wukong Jungle, I've had 15/3/10 or w/e matches too. It's mostly that it just feels like shit to play. I think I said that in the OP somewhere, but yeah.\n\nIt's not that I CAN'T win, it's that it feels like shit to play because I'm generally always behind, and even when I win it's like, well shit I barely even played a part in that, good job team.\n\nI should just start buying a sightstone and warding their jungle up. If I feel like a second support then I might as well act like one. It feels like the objective isn't so much getting your team ahead(Dragon's worth no money and has local experience only, Dragon Buffs don't matter AT ALL early game, etc.) as it is to just play decently and let them carry you. And that's boring.","replies":[]}]},{"poster":"Kingsgrave","date":"2014-12-05T19:39:02.513+0000","up_votes":2,"down_votes":0,"body":"Maybe hes one of the champs they are going to give buffs to like Sej/Naut/Eve?","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T16:47:17.520+0000","up_votes":1,"down_votes":0,"body":"Dunno, I really don't think so honestly because he's decent top/mid. They'd be buffing solo lanes if they gave him anything nice. The only thing I could think of is to make his Decoy fear minions/creeps when it disappears for 1.5 seconds or something.\n\nThat makes it absorb an auto and then basically \"absorb\" another auto because they're feared when their next attack would be.","replies":[]}]},{"poster":"GundayMonday","date":"2014-12-05T16:31:28.253+0000","up_votes":2,"down_votes":1,"body":"He's not that bad. Being able to solo dragon from level 3 onward is pretty useful too:\n[http://youtu.be/OJwBwIpg_9U](http://youtu.be/OJwBwIpg_9U)","replies":[{"poster":"Long Dong Wukong","date":"2014-12-05T16:50:53.721+0000","up_votes":3,"down_votes":1,"body":"Yeah, I've linked that video in a few topics.\n\nIt's not quite the same thing as Pantheon just auto attacking and spamming skills. It's very difficult to successfully solo a Dragon at level 3 with Wukong and latency plays a huge part in this as well, and I'm on the East Coast so my ping is 97-105.\n\nPeople ward Dragon early now too, to make sure no bullshit's going on.","replies":[{"poster":"GundayMonday","date":"2014-12-05T16:59:17.921+0000","up_votes":1,"down_votes":0,"body":"Ah, I thought it might be you! Sorry for preaching to the choir so to speak.\n\nThe extra jungle gold should help Wu out, even with the trailblazer nerfs incoming. You may still have to recall after 3 camps, but your clear should speed up once you return. Gotta optimize all the little things to max your sustain. Stuff like kiting jungle camps between auto's and using your E and W to dodge the little camp dmg (same concept that you do with dragon). It's doable, but it's definitely A LOT tougher than playing a champ like {{champion:19}}  or {{champion:20}}  where you can just sit in the middle of a camp auto'ing and Qing to laugh off their damage with your sustain.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-05T18:37:02.963+0000","up_votes":2,"down_votes":0,"body":"Yeah, it's doable, I do perfectly fine pretty much every game, it's just that I feel like I have significantly less control of the match than before. It's seriously *twice* as difficult to take control of a game even if you end up with 5 kills at 13 minutes. Before if you gave me 5 kills that early, it was fucking over. I just shit all over your team.\n\nNow I feel like I might as well spend that kill money on a sightstone and pretend like I'm a second support.\n\nNext patch is what, a net of 10g more per camp(because I believe they're reducing the base gold the camps give for some reason too) after you finish your jungle item, but at the loss of sustain from Ranger's. I don't see it being any better, it probably just evens out for Wukong.\n\nLike I said I don't mind him top, so I can just switch to top main or something because he gets the money to really scale hard up there. But this jungle thing seems just about dead to me unless they really change stuff.","replies":[{"poster":"GundayMonday","date":"2014-12-05T19:31:31.191+0000","up_votes":2,"down_votes":0,"body":"I see what you're saying. \nI mained {{champion:113}}  and {{champion:62}}  out of the jungle last season so it'll definitely be sad if he's not viable anymore due to the changes. Happy to yell with you if Riot accidentally nerfs him out of the jungle!","replies":[]},{"poster":"Haunt","date":"2014-12-06T17:39:26.264+0000","up_votes":1,"down_votes":0,"body":"> Yeah, it's doable, I do perfectly fine pretty much every game, it's just that I feel like I have significantly less control of the match than before. It's seriously *twice* as difficult to take control of a game even if you end up with 5 kills at 13 minutes. Before if you gave me 5 kills that early, it was fucking over. I just shit all over your team.\n> \n> Now I feel like I might as well spend that kill money on a sightstone and pretend like I'm a second support.\n> \n> Next patch is what, a net of 10g more per camp(because I believe they're reducing the base gold the camps give for some reason too) after you finish your jungle item, but at the loss of sustain from Ranger's. I don't see it being any better, it probably just evens out for Wukong.\n> \n> Like I said I don't mind him top, so I can just switch to top main or something because he gets the money to really scale hard up there. But this jungle thing seems just about dead to me unless they really change stuff.\n\n\nKha'Zix is the same way. Every Assassin-like character except Lee Sin and Pantheon most likely won't be healthy enough to gank after buffs are done. Good news it though, that it will be easier when the smite change goes through. You'll be able to get red and blue fast and easy. Hopefully it can help clear faster so you can get more exp and gank faster. \n\nBut yea, I undertsand what you're saying since I like to play mainly assassins and they get shit on by the jungle now.","replies":[]},{"poster":"OyddAWqJ5r","date":"2014-12-05T22:07:39.342+0000","up_votes":1,"down_votes":0,"body":"Nah it's actually not a buff to junglers at all. They're decreasing the total cost of all camps by 10g and making machete + all upgrades grant +10g for killing large monsters.\n\nIt's not a buff at all, it's just some anti-poachering stuff.","replies":[{"poster":"Long Dong Wukong","date":"2014-12-06T17:23:13.004+0000","up_votes":1,"down_votes":0,"body":"Don't forget that it's the machete that is only +10g, the jungle items once upgraded give +20g, for a net gain of 10g per camp since they're reducing the income per camp.\n\nBut yes, it's basically to give your first clear the same amount of gold while making the jungle less lucrative for laners, and then once you get your smite upgrade item you get a *little* more gold per camp.\n\nThe thing is the camps take twice as long to spawn, so it's still shitty as fuck gold compared to before.","replies":[]}]}]}]}]}]},{"poster":"Fury and Emperor","date":"2014-12-05T18:53:59.275+0000","up_votes":1,"down_votes":2,"body":"Not all champions are designed to be viable in every role.\n\nWukong was designed to be a top, he's still a top.","replies":[{"poster":"Vertanium","date":"2014-12-05T22:34:54.663+0000","up_votes":2,"down_votes":0,"body":"they nerfed him once he was strong in the jungle because he had too much power, they never intended him to be anywhere specific really. so once he found somewhere where he fit they nerfed him.","replies":[]}]},{"poster":"19 19 19","date":"2014-12-10T07:46:27.350+0000","up_votes":1,"down_votes":0,"body":"if you think thats worse try nocturne and evelynn clearing","replies":[{"poster":"Long Dong Wukong","date":"2014-12-10T18:08:49.656+0000","up_votes":1,"down_votes":0,"body":"Nocturne isn't any worse than Wukong, Eve is however dead.","replies":[]}]}]}