{"poster":"Faylong","date":"2015-06-10T05:38:59.690+0000","title":"Le Blanc-patch","subforum":"Champions & Gameplay","embed":{"description":"Seid gegrüßt, Beschwörer! Willkommen zu Patch 5.11 - dem, mit dem Caitlyn etwas Liebe erfährt und es einige bedeutende Veränderungen am Gewundenen Wald gibt. Die Verbesserungen für Caitlyn sind für sich genommen noch kein Meilenstein, doch wenn ihr bedenkt, wie lange es her ist, seit der Sheriff von Piltover etwas Aufmerksamkeit bekam (Hinweis: ganz schön lange), ist das zumindest eine Erwähnung im Vorwort wert.","url":"http://euw.leagueoflegends.com/de/news/game-updates/patch/patchnotizen-511#patch-champions","image":"http://euw.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/patch_notes_banner_20.jpg?itok=5IcmgFe1"},"up_votes":1,"down_votes":0,"body":"{{champion:7}} LB wurde nun letztlich doch gepatcht. Was haltet ihr von den &Auml;nderungen?\r\nMich interessiert vorallem ob sie f&uuml;r euch noch Spielbar erscheint, oder ob ihr kaum noch interesse habt diesen Champ zu spielen.\r\nWer nichts schreiben m&ouml;chte darf auch einfach die Umfrage nutzen ;)\r\nBin gespannt auf die Kommentare.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-10T08:19:42.369+0000","up_votes":1,"down_votes":1,"body":"nach nem nerf heulen doch immer alle rum ;D\nich fand, leblanc war vorher absolut okay und sie ist auch jetzt noch absolut okay. \n\ndas einzige was ich nicht verstehe ist, dass sie trotz ihrer winrate, die NIE über 50% war (nicht einmal als sie noch ihren silence hatte) überhaupt generft wird. ich meine, es war vielleicht für noobs frustrierend gegen sie zu spielen, aber das ist doch fast jeder champion für noobs. besonders stark war sie allerdings nie, da sie sehr abhängig davon war, zu snowballen und SELBST DANN nicht wirklich safe carrien konnte. da war nen 5:0 zed immer noch effektiver als ne 10:0 leblanc (nix gegen zed).\n\nich weiß nich, ich fand bis auf die noobfrustration gabs eigentlich nie nen problem und mich hats auch nie gestört gegen leblanc zu spielen, ihre winrate ist nicht umsonst immer lächerlich low gewesen.","replies":[{"poster":"Shanick","date":"2015-06-10T08:32:41.889+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUNSTFEHLA,realm=EUW,application-id=Wj1wcocU,discussion-id=4TEpkGub,comment-id=0000,timestamp=2015-06-10T08:19:42.369+0000)\n>\n> nach nem nerf heulen doch immer alle rum ;D\n> ich fand, leblanc war vorher absolut okay und sie ist auch jetzt noch absolut okay. \n> \n> das einzige was ich nicht verstehe ist, dass sie trotz ihrer winrate, die NIE über 50% war (nicht einmal als sie noch ihren silence hatte) überhaupt generft wird. ich meine, es war vielleicht für noobs frustrierend gegen sie zu spielen, aber das ist doch fast jeder champion für noobs. besonders stark war sie allerdings nie, da sie sehr abhängig davon war, zu snowballen und SELBST DANN nicht wirklich safe carrien konnte. da war nen 5:0 zed immer noch effektiver als ne 10:0 leblanc (nix gegen zed).\n> \n> ich weiß nich, ich fand bis auf die noobfrustration gabs eigentlich nie nen problem und mich hats auch nie gestört gegen leblanc zu spielen, ihre winrate ist nicht umsonst immer lächerlich low gewesen.\n\nLeblancs win rate schwankt sehr stark, da Sie eine höheren Skill benötigt. Man kann mit ihr sehr viel anstellen, gerade da Sie ihre Fähigkeiten umfangreicher verwenden kann. Deswegen sagt die Win rate nicht immer wirklich was über die Stärke eines Champions, sonst wäre Azir, Zed, Kalista oder Nidalee  auch Champs die man nur buffen müsste und Katarina ein Champion der erstmal ordentlich generft werden muss, obwohl Pro's wissen wie man sie ausschaltet(mit ihr hat man eigl. auch kein Problem).\n\nDie WinRate ist abhängig der Schwierigkeit des Champions und wie du in einem vorherigen Thread schon geschrieben hast: Die Leute machen LCS nach und \"Noobs\", also niedrigere Divisionen, sind nunmal mehr als in den höheren Divisionen. Diese ziehen dann die Winrate runter. Dein Gegenbeispiel \"Pro's\" können also mehr aus ihr machen. \n\nEinen 5:0 Zed kannst du immernoch mit einem QSS blocken. Eine 5:0 Leblanc könnte immer wieder den dmg raushauen.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-10T11:02:20.443+0000","up_votes":1,"down_votes":1,"body":"leblancs winrate schwankte in den letzten 2 jahren zwischen 42 und 46%... \nihre peak war bei 48% oder so kurz vor dem silence nerf. wirklich, statistisch gesehen muss der champ wirklich OP sein ;D\nselbst in der LCS hatte leblanc keine so krasse dominanz oder winrate und bis auf ein paar wenige spieler die sie wirklich gut können, ist sie da auch nicht oft gesnowballt. es gab einfach keinen grund ausser das viele rumgeheule.\n\nund nen 5:0 zed kann auto attacken, während eine X:0 leblanc trotzdem nur ihre eine combo hat.","replies":[{"poster":"Leeerzeichen","date":"2015-06-10T14:51:25.878+0000","up_votes":3,"down_votes":0,"body":"LeBlanc = Beliebter Champion =  wird von vielen schlechten und ein paar guten gespielt = Winnrate wird stark von den schlechten Spielern bestimmt.\n\nUnd Riot balance die Champions danach wie gut sie sind wenn sie gemeistert werden und da war/ist sie einfach nur broken. Kein Melee, harter CC, sehr gute Scalings, non-ulti skillshot dash + option zurück zu jumpen => praktisch nicht zu fangen, ulti ohne manakosten mit der man jeden ohnehin schon starken skill nochmal in einer stärkeren Form nutzen kann, ..","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-10T14:58:06.790+0000","up_votes":1,"down_votes":0,"body":"leblanc = sehr komplexer champion = hat in high elo und lcs nur eine mittelmäßige winrate und kda = selbe winrate wie in low elo = warum nerf","replies":[{"poster":"Leeerzeichen","date":"2015-06-10T20:15:37.287+0000","up_votes":2,"down_votes":0,"body":"Oben hab ich dir viele Gründe genannt. Sie hat schlicht zu wenig Counterplay. Außerdem warum wird sie denn noch so oft gespielt oder gebannt, wo doch das Tank Meta die Assassins vertreibt?","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-11T06:48:32.590+0000","up_votes":1,"down_votes":1,"body":"sie hat massenweise counterplay. leute checken es einfach nur nicht. andere champions werden auch viel gespielt, obwohl sie eine niedrige winrate haben.","replies":[{"poster":"Leeerzeichen","date":"2015-06-11T11:03:17.266+0000","up_votes":1,"down_votes":0,"body":"Und welches?","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-11T12:17:19.329+0000","up_votes":1,"down_votes":0,"body":"das selbe wie jede andere assassin auch: waveclear, vision, grouping etcpp.\n\nentweder einen waveclear champion spielen der ausserhalb ihrer reichweite bleiben kann (ziggs, kogmaw, xerath, azir) oder einen der sie outtraded, evtl sogar einen bruiser. mordekaiser, kassadin, master yi, cassio, vielleicht sogar darius.\n\nwarum musst du unbedingt champions spielen, die von leblanc zerrissen werden? das geheule kommt doch nur daher, dass die leute ihre lieblingschampions problemlos gegen jeden anderen champion spielen und stompen können.\n\nes ist einfach 100% möglich leblanc keine kills in der lane zu geben, selbst wenn man dann im farm leicht hinten liegt. man outscaled sie mit fast jedem champ auch mit weniger farm und ist viel nützlich in teamfights und objective control. dann nen paar wards und sich nich dumm im jungle assassinaten lassen und alles is cool. deshalb ist leblancs winrate so niedrig.","replies":[{"poster":"Leeerzeichen","date":"2015-06-11T13:40:35.647+0000","up_votes":2,"down_votes":0,"body":"Darum geht es nicht.\nAuf der Lane komme ich meisten gut gegen sie klar.\nZumal du gerade dich selbst wiederlegt hast, wenn man seinen Lieblingschamp problemlos gegen jeden Champ außer LeBlanc spielen können, zeigt mir dass, das LeBlanc op ist.\nEs geht darum das es kein Counterplay gegen ihren Assassinstil gibt. Ihr Burst besteht aus 2 Point and Click-und 1 extrem einfachen Skillshot. Alles ohne Warnung und sie kommt nach dem kill auch noch super easy weg. \n\nSchauen wir z.B zed an. Er ultet dich, du siehst ein dickes Kreutz über dir, du hast Zeit zu reagieren, er erscheint an einer vorhersehbarer Stelle, muss eine Skillrotation machen, in der er CCed werden kann, er ulted erneut um zu entkommen, du hast erneut Zeit zu reagieren und ein Item zu benutzen um nicht zu sterben. Da gibt es 3 Mal die Möglichkeit Counterplay zu betreiben. \n\nBei LeBlanc läuft es so ab, es fliegen 2 point and click skills superschnell auf dich zu gefolgt von LeBlanc, du hast ein minimales Zeitfenster um als AP-Champ Zhonyas zu aktivieren, als AD-Champ bist du am Asch, Leblanc nutzt ihre w erneut und ist weg bevor sie von CC getroffen werden kann. 0,5 Möglichkeit Counterplay zu betreiben wenn man gute Reflexe hat. Das ist viel zu wenig. Es gibt einen Grund warum fast jeder Assassine außer LeBlanc melee ist.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-11T15:42:33.098+0000","up_votes":1,"down_votes":1,"body":"in dem szenario hast du jetzt aber nen brush gefacechecked oder? weil sonst wärs einfach dein fehler so nah an ne leblanc ranzulaufen dass sie dich einfach mit Q R treffen kann. \n\nausserdem hat ihre Q R combo so lange castanimation, dass sie easy zu CCen ist, wenn man mental vorbereitet ist. oder man jumped weg. wenn leblanc einfach auf dich zuläuft und du stirbst, dann hast du deine chance auf counterplay schon verpasst.\n\nund wenn du in der lane gut gegen sie klar kommst, sollte sie danach eigentlich keine allzu große gefahr mehr sein.\n\nPS: man kann jeden champion gegen jeden anderen lanen und teamfightrelevanz behalten. man kann allerdings nicht jeden champion mit jedem anderen champion stompen, aber leute wollen halt dass sie mit ihrem lieblingschampion in jedem matchup 10:0 gehen können.","replies":[]}]}]}]}]}]}]}]},{"poster":"Shanick","date":"2015-06-10T16:26:03.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUNSTFEHLA,realm=EUW,application-id=Wj1wcocU,discussion-id=4TEpkGub,comment-id=000000000001,timestamp=2015-06-10T11:02:20.443+0000)\n>\n> leblancs winrate schwankte in den letzten 2 jahren zwischen 42 und 46%... \n> ihre peak war bei 48% oder so kurz vor dem silence nerf. wirklich, statistisch gesehen muss der champ wirklich OP sein ;D\n> selbst in der LCS hatte leblanc keine so krasse dominanz oder winrate und bis auf ein paar wenige spieler die sie wirklich gut können, ist sie da auch nicht oft gesnowballt. es gab einfach keinen grund ausser das viele rumgeheule.\n> \n> und nen 5:0 zed kann auto attacken, während eine X:0 leblanc trotzdem nur ihre eine combo hat.\n\nDas die Win Rate was über OP Champions sagt kam von dir\nZitat: \"das einzige was ich nicht verstehe ist, dass sie trotz ihrer winrate, die NIE über 50% war (nicht einmal als sie noch ihren silence hatte) überhaupt generft wird.\"\nMeine Aussage was das die Winrate was über den Skill aussagt, nicht über zu starke Champions. \n\nMeiner Meinung war Leblanc zu stark in ihren Möglichkeiten Druck aufzubauen und das volle Potenzial haben LCS Spieler gezeigt. \n\nZum Zed: Wenn der den ADC auto-attacken will soll er das nur machen. Weit kommt er meine Meinung nach nicht ohne Ulti. Leblanc hat zwar dieselbe Situation, aber ihre Combo kann man schwer einfach auflösen wie Zeds ulti. \nNach kurzer Zeit hat Sie ihre Kombo wieder (auch die ulti mit 24s CD ohne CDR). Zed hingegen muss meist erstmal länger warten um einsatzbereit zu sein. Geschweige denn von dem Moment nach der Ulti in dem man ihn leichter aufhalten kann als Leblanc.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-11T07:07:24.953+0000","up_votes":1,"down_votes":0,"body":"die winrate sagt auch nichts über den skill aus, da jeder champion in league of legends \"ähnlich schwer\" zu spielen ist. die mechanische hürde in league ist minimal und der gamesense den jemand braucht, um das game vernünftig zuende zu spielen, ist immer der gleiche. manche champions wie zb garen oder darius sind schwerer als maokai oder hecarim, aber grundsätzlich drückt die \"schwierigkeit des champions\" die winrate nicht um so viele %.\n\n\"das potential haben lcs spieler gezeigt\". ja, faker hat gezeigt wie leblanc ausrasten kann und viele andere spieler haben gezeigt, wie viele andere champions ausrasten können.\n\nleblanc hatte selbst in dia+ nie eine hohe winrate und in der lcs wurde leblanc 2013, obwohl sie so stark war wie nie zuvor, nur ein einziges mal gespielt. erst 2014 kam der trend auf, leblanc zu spielen und niemand wusste, was sie dagegen machen sollen. leblancs winrate war astronomisch. das normalisierte sich aber mit der zeit, nachdem die koreaner gezeigt haben wie man dagegen spielt.\nDANACH kam der silence nerf und weitere nerfs und ihre winrate blieb unverändert mittelmäßig während ihre winrate im soloQ weiter abnahm. mittlerweile hat die sich zwar auch ein bisschen erholt, ist allerdings immernoch deutlich unter 50%.\n\nleblanc ist einfach als reiner 5on5 champion designed und selbst da hat sie nur eine mittelmäßige winrate obwohl das teilweise die besten spieler der welt sind. das hat also nichts mit high skill zu tun sondern mit champdesign und champ power. \n\nich will nicht sagen, dass der silence remove unnötig war. von mir aus war das gut für counterplay etc, allerdings glaube ich, dass das nicht das kernproblem war. ich meine, wenn eine ahri auf dich flash-charmed bist du auch tot und es gibt kein counterplay sobald du getroffen wurdest. das counterplay gegen leblanc war, dass sie dich halt mit zwei spells treffen muss und du davor immer noch flashen kannst. wenn du nen bush facecheckst gegen JEDEN burstchamp gibt es im grunde kein counterplay, und das ist auch der sinn der sache.\n\nzusätzlich hat leblanc so stark beschränkte anwendungsgebiete und so massive schwachstellen, dass sie große probleme hat, public games zu closen. zed zb hat einfach durch die auto attack power viel mehr anwendungsgebiete und power uptimes. \ndamit will ich nicht sagen dass zed einfach besser und stärker ist, sondern dass ich den leblanc nerf absolut nicht verstehe. ja ich verstehe dass es FRUSTRIEREND ist in einer sekunde weggebursted zu werden, aber das können noch zig andere champions und es ist einfach ein reines low-elo-mentalität-problem und kein echtes gameplay problem.","replies":[]}]}]},{"poster":"Alustus","date":"2015-06-10T08:46:12.181+0000","up_votes":1,"down_votes":0,"body":"> Die WinRate ist abhängig der Schwierigkeit des Champions und wie du in einem vorherigen Thread schon geschrieben hast: Die Leute machen LCS nach und \"Noobs\", also niedrigere Divisionen, sind nunmal mehr als in den höheren Divisionen. Diese ziehen dann die Winrate runter. Dein Gegenbeispiel \"Pro's\" können also mehr aus ihr machen.\n\nDie winrate schwankt aber auch bei Dia+ Spielern sehr stark :)\n\nIch finde, dass Leblanc verändert gehört und nicht generft.\nSie hat mMn ein ähnliches Problem wie Lee vor nicht allzulanger zeit.\n\nDer grund warum Leblanc eine so unbeständigkeit hat ist mMn der, dass wenn die gegner ins late kommen sie \"schwach\" wird.\nAber wenn sie im early/midgame  gut spielt kann sie das game gut carrien. (da wird auch der patch nicht viel verändern)\n\nIst aber nur meine Meinung.","replies":[{"poster":"Shanick","date":"2015-06-10T16:18:19.685+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=Wj1wcocU,discussion-id=4TEpkGub,comment-id=000000000000,timestamp=2015-06-10T08:46:12.181+0000)\n>\n> Die winrate schwankt aber auch bei Dia+ Spielern sehr stark :)\n> \n> Ich finde, dass Leblanc verändert gehört und nicht generft.\n> Sie hat mMn ein ähnliches Problem wie Lee vor nicht allzulanger zeit.\n> \n> Der grund warum Leblanc eine so unbeständigkeit hat ist mMn der, dass wenn die gegner ins late kommen sie \"schwach\" wird.\n> Aber wenn sie im early/midgame  gut spielt kann sie das game gut carrien. (da wird auch der patch nicht viel verändern)\n> \n> Ist aber nur meine Meinung.\n\nLaut den Statistiken schwankt sie seit Tagen bei 47-49%\n\nNatürlich schwankt es  auch in Diamant. Aber dort weil die Anzahl der Spieler geringer ausfällt. Die Fläche wird natürlich Ebener je mehr Spieler gezählt werden und in niedrigeren Divisionen sind das nunmal mehr.","replies":[]}]}]}]}]}