{"poster":"UnMainMordeTonto","date":"2016-09-06T20:15:16.540+0000","title":"Riot se esta portando bien","subforum":"Charlas Generales","up_votes":64,"down_votes":2,"body":"Para mi, Riot se esta portando bastante zukulento ultimamente:\r\n\r\n&bull;Skin Gratis por soy LoLero(me toco una garcha llamada garen comando pero &ntilde;e) \r\n&bull;Rework Yorik (para mi quedo bastante bueno)\r\n&bull;Phanteon panadero\r\n&bull;Nerf a Yasuo (lo q todos buscaban, en lo personal no me importa pero bueno todos lo odian xd) \r\n&bull;Rework de kata y algunos asesinos mas (esto me gusto) \r\n&bull;Skin proyecto pr&aacute;cticamente gratis (me dierona yasuo xd solo por eso lo compre)\r\n&bull;Volver&aacute; urf (con picks aleatorios, veremos que sale) \r\n\r\nSon bastantes cosas buenas que pasaron en relativamente poco tiempo, lo unico que jode es el leave buster que te comes por que te llaman para hacer yokse pero aprendi a llevarlos y ya no me molestan (no aumenten el tiempo eso si xd)","replies":[{"poster":"Quo","date":"2016-09-06T20:35:06.612+0000","up_votes":27,"down_votes":3,"body":"Pero a la gente desgraciadamente eso no le importa, siguen quejandose de la comunidad y los problemas de conexi칩n cuando el 80% de esos problemas son culpa de los propios usuarios.\n\nMe alegra que al menos alguien reconozca que riot esta haciendo las cosas bien en algunos aspectos.","replies":[{"poster":"LGBT Valentina","date":"2016-09-06T21:29:33.006+0000","up_votes":14,"down_votes":5,"body":"Y pero en parte tienen razon y en alguna cosas la comunidad esta triste\n\nPantheon panadero, era para un skin legendaria. Una skin pedida por la comunidad que no le dieron ni bola la verdad, parece que la hicieron asi nomas para vender (y es verdad)\n\nEl nerf a yasuo, es meh. Es solo para yasuo tank y el bug que tiene yasuo este parche no lo arreglan por que \"no supone una gran ventaja (200 de da침o extra en early y 700+ en late no es ventaja parece)\n\nEspero que le peguen en Urf random, por que la gente suele ser tryhard en ese modo de juego. Lo malo van a ser la cantidad de gente que va a dodgear\n\nRiot no es una empresa que precisamente mantenga al consumidor (al jugador) feliz en todos los aspectos\nDe todas formas no se niega que hacen sus cosas buenas\nPero de 10 cosas, solo 1 a 3 son buenas, las otras 7 nos dan con un palo xd","replies":[{"poster":"Snooow","date":"2016-09-06T22:04:09.340+0000","up_votes":6,"down_votes":0,"body":"Lo de pantheon tenes razon y muchos esperan que antes de que salga del pbe la mejoren, al menos que le cambien los dialogos","replies":[{"poster":"LGBT Valentina","date":"2016-09-06T22:27:17.423+0000","up_votes":5,"down_votes":0,"body":"Es que la verdad, si no era definitiva era legendaria :/\nYo quede super triste","replies":[]}]},{"poster":"Quo","date":"2016-09-07T02:59:27.957+0000","up_votes":1,"down_votes":0,"body":"Sobre pantheon no opinare pues en lo personal la skin me gusta y es llamativa.\n\nEl nerf a yasuo... es mas complejo de lo que parece balancear a un campe칩n, yasuo esta hecho para tener una movilidad del demonio y poder aplicar buen da침o, claro pero ser relativamente squishy l pues si consigues encadenarle cc y burstearlo no vale para nada, pero la gente vio que buildeandolo tanque romp칤a igual asi que por eso se le decidi칩 nerfear su aspecto de tanque, el tema del bug no se realmente por que no lo tocaron y no estoy realmente informado sobre el as칤 que no opinare mas sobre eso.\n\nBien dijeron cuando empezaron los modos rotativos que urf solo estar칤a dos veces al a침o y ahora meten random urf a mi parecer un acierto pues as칤 no ser치n los mismos picks de siempre.\n\nClaramente riot no es una empresa que mantenga al jugador feliz en todos sus aspectos, sus excusas para el sistema de replays o el de un modo sandbox fueron como pegarle a tu abuela, una mierda, pero tambi칠n vamos a ser sinceros, muchos de los eventos que hace por lo general son para beneficiar al usuario, y 칰ltimamente sus eventos son muchos y mas seguidos que antes.\n\nComo jugador yo calificar칤a en una escala de satisfacci칩n del 1 al 10 a riot con un 8, quiz치 es solo que tenga suerte y nunca tuviese problemas realmente graves, pero yo no he tenido experiencias negativas con la empresa.","replies":[{"poster":"LGBT Valentina","date":"2016-09-07T04:58:27.326+0000","up_votes":4,"down_votes":7,"body":"Hace 3 season juego, 3 season que estoy en hight elo. Se lo que es balancear a un campeon y Riot da pena para eso\n\nNo sirve de casi nada el nerf a yasuo, la build va a seguir igual \nPD-Sterak/Frozen y si necesita da침o IE, si necesita el vida, el item que le faltaba. Solo va a afectar al build en el orden, va a seguir igual de op\n\n\nEl URF random, espero que valga la pena. Tendrian que meter colas penalizaciones mas largas cuando dodgea alguien para evitar un embole de la gran 7\n\nEsos eventos ultimamente son un fraude y enfadan mas al jugador\nEl ultimo evento, muchisima gente no participo y muchisima gente se vio obligada a entrar en un club ----> Y lo mas cara dura que vi en mi vida, aparece un Riot y ocurre esta situacion:\nVarias personas no quieren entrar en un club o crearse uno, pero quieren ayudar con los puntos. Simplemente no quieren entrar en un club, hasta dijieron que hacian duo, aparece un Riot y dice: Creen un Club ANTI-SOCIALES y jueguen 1 partida entre ustedes (el comentario fue MUCHISIMO peor, lo cagaron a negativos)\nFiesta de mascaras: Tremendo final eh\nUltimo evento: Recompensas que dieron pena simplemente y mal organizado: La unica recompensa que valia era la ultima, me acuerdo que una era para descargar los Splash art (mas conchudo no se puede ser) y encima al final ocurrio un problema con diana infernal y se la dieron a todo el mundo. Really?\nY te OBLIGAN a entrar en un club. Ojo esta bien, es un esfuerzo minimo pero es injusto\n\nYo estoy casi totalmente en contra con las decisiones de Riot y eso se debe tambien a que paseo mucho por los foros de NA y ver las respuestas de balanceo o planes a futuro simplemente es penoso. Los cagan a negativos, viene un flaco (unos cuantos) y escriben durante 1 hora un post que hace feliz a todos los jugadores\n\nA los Riot de LAS (que postean) en general los \"quiero\", por que se nota que son buena gente y aunque te hagan un copy paste de la oficina principal cuando alguien pregunte acerca del balanceo, se nota la buena onda que tienen con los jugadores\nEn NA creo que hay 2-3 que son queridos en lost post. Cuando aparece ghostcrawler o meddler para hablarte de algo, la verdad te queres pegar 1 tiro en la jeta\n\nPor si le interesa a alguien mas: La idea de los asesinos (el \"rework\") es que antes de que te maten, tengas tiempo de reaccion. Me encanta los felicito\nAhora les pregunto a ustedes jugadores de lol, este tiempo de reaccion que tan diferente es para {{champion:157}} ,{{champion:62}} ,{{champion:254}} ,{{champion:4}} ,{{champion:11}} {{champion:39}} {{champion:114}}  y sobre todo {{champion:92}} , etc\nLes pregunto, que diferencia va a ver entre un asesino y un Bruiser o un off tank como los de ahora\nSi pensamos 1 segundo, el asesino que mata mas lento en si es Zed, por los 3 segundos. El rework que les viene a los asesinos va a ser 1 chiste (esto que hago es un copy paste de NA que me parecio genial el comentario)\nSi quieren mas counter play en los asesinos, no van a ser mas asesinos en si\n\nOsea, la diferencia ahora entre un asesino y {{champion:92}} va a ser: \nRiven te mata mas rapido, pero tiene que seguirte (ponele que le cuesta) y si te agarra sos pollo\nUn asesino \"ponele\" que van a tener (seguramente) mas gap closer y si te agarra podes safar\n\nSi me dan a elejir, elijo riven y cada 3-4 min con flash (botas + maestrias) me hago una play y gano el game...\n\n\nSi los \"bruiser\" (No se como llamarlos) en estos momentos nos hacen oneshot, vamos a tener proximamente asesinos que no asesinan o vamos a tener nuevos rengar pero sin el aviso que lo tenemos al lado\n\n\nEdit: Y personalmente, (les vuelvo a chupar las medias a los de NA, pero esto es casi subjetivamente) esta es la PEOR season, pero la PEOR season de todas\nY siempre digo lo mismo, cada season es peor, es menos divertida, cada vez hay mas champs y hay menos pool, pero esta season hablando desde \"hight elo\" y eso que solo juego normals, me parecio un asco. Espero que esta season haya sido para experimentar por que tengo las pelotas llenas","replies":[{"poster":"Neo Gaussrik","date":"2016-09-07T16:07:20.192+0000","up_votes":9,"down_votes":4,"body":"> [{quoted}](name=Abyss Watchers,realm=LAS,application-id=v7qsfXsE,discussion-id=1JWnR4ML,comment-id=0000000000010000,timestamp=2016-09-07T04:58:27.326+0000)\n>\n> Hace 3 season juego, 3 season que estoy en hight elo. Se lo que es balancear a un campeon y Riot da pena para eso\n\nOh? Eso suena a desafio.\n\n> No sirve de casi nada el nerf a yasuo, la build va a seguir igual \n> PD-Sterak/Frozen y si necesita da침o IE, si necesita el vida, el item que le faltaba. Solo va a afectar al build en el orden, va a seguir igual de op\n\nNo realmente; deja al build en una posicion muy incomoda.\n\nEl cambio a la velocidad de ataque significa que si no te estas comprando velocidad de ataque primero, eres castigado severamente, pero si construyes velocidad de ataque y luego no compras criticos, entonces tu da침o sostenido post-definitiva se reduce dramaticamente.\n\nSi crees que vas a poder seguir pasando da침o como antes despues del cambio, te tengo noticias. :p\n\n> Esos eventos ultimamente son un fraude y enfadan mas al jugador\n> El ultimo evento, muchisima gente no participo y muchisima gente se vio obligada a entrar en un club\n\nCuriosamente, ha sido uno de los eventos de mayor participacion que hemos hecho.\n\n> Yo estoy casi totalmente en contra con las decisiones de Riot y eso se debe tambien a que paseo mucho por los foros de NA y ver las respuestas de balanceo o planes a futuro simplemente es penoso. Los cagan a negativos, viene un flaco (unos cuantos) y escriben durante 1 hora un post que hace feliz a todos los jugadores\n\nHay muy poca participacion de Rioters en los foros de NA; en esa region, principalmente se discute en Reddit.\n\nY bien, si vas a medir el balance basado en los positivos y negativos, entonces terminarias con un juego en el que Lee Sin Zed Yasuo Vayne y Thresh dominan, y campeones como Zilean Urgot Yorick y Nunu son incapaces de hacerle frente.\n\nPopularidad != balance.\n\n> Les pregunto, que diferencia va a ver entre un asesino y un Bruiser o un off tank como los de ahora\n\nMovilidad. Los asesinos tienen herramientas para llegar consistentemente hasta sus objetivos, mientras que un \"Bruiser\" o \"Off tank\" no.\n\n> Si pensamos 1 segundo, el asesino que mata mas lento en si es Zed, por los 3 segundos. El rework que les viene a los asesinos va a ser 1 chiste (esto que hago es un copy paste de NA que me parecio genial el comentario)\n> Si quieren mas counter play en los asesinos, no van a ser mas asesinos en si\n\nAsesinos que se tardan en matarte siguen siendo asesinos. Este es el mismo argumento que hicieron cuando les quitamos los silencios a los asesinos, y sospecho que tambien estara equivocado en este caso.\n\n> Si me dan a elejir, elijo riven y cada 3-4 min con flash (botas + maestrias) me hago una play y gano el game...\n\nHaha, no hay problema. :p Si quieres jugar a Riven como asesina, adelante! Pero toma en cuenta que si te va mal en el early, no vas a poder llegar nunca a la linea trasera del equipo enemigo...\n\n> Edit: Y personalmente, (les vuelvo a chupar las medias a los de NA, pero esto es casi subjetivamente) esta es la PEOR season, pero la PEOR season de todas\n\nHey, si no te gusta, no te gusta. Sin embargo, el dise침o de juegos es mas complejo de lo que presentas, y creo que existe un mundo en el que un asesino tenga un rol estrategico unico dentro del juego -sin- eliminarte en 0.5 segundos. Creo que Zed lo demuestra, y otros asesinos (Akali, Ahri, Ekko) lo han demostrado tambien.\n\n> Y siempre digo lo mismo, cada season es peor, es menos divertida\n\nSi esto opinas, es tu opinion.\n\n> cada vez hay mas champs y hay menos pool\n\nPero esto no es cierto. Diversidad es una de esas metricas que medimos, y te aseguro que habia \"menos champs y menos pool\" en el pasado. Te acuerdas de S4?\n\n> Espero que esta season haya sido para experimentar por que tengo las pelotas llenas\n\nBien, no se que decir a esto.","replies":[{"poster":"Cosmic Ganks","date":"2016-09-09T03:12:44.308+0000","up_votes":1,"down_votes":0,"body":"hola Gauss, podes, si tenes tiempo, entrar en mi post, y aclararme algunas dudas? \nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/bVfJfi2v-nerfs-a-aurelion-sol-pbe-8092016","replies":[]},{"poster":"LGBT Valentina","date":"2016-09-07T17:09:48.547+0000","up_votes":4,"down_votes":5,"body":"Yasuo: La verdad, no veo donde esta tu reduccion de da침o\nYasuo se rushea PD, esto le da AS y 60% critico. Bien nerfeamos ese 40% que no va a meter criticos (aunque se como funcionan los criticos en el lol, no es a base de suerte precisamente)\n\nSi Hablas que estas nerfeando mucho al champ, espero verlo. Por que el problema de yasuo en mid game, radica en que tiene 60% critical chance + 20% de AS en runas y el frozen (utilidad) y volvemos con el tema de la W (que tendria que ser como la W de yorick, aguante una elevada cantidad de da침o\n\nRepito, su lane fase no la veo nerfeada mucho. En si lo tankes no existen en este meta (los tankes puros), va a seguir teniendo una movilidad altisima, la Q sigue contando como 3 stacks de fervor (sin CDR)\n\nNo se si te diste cuenta en lo que escribistes: El cambio a la** velocidad de ataque significa que si no te estas comprando velocidad de ataque primero**, eres castigado severamente, **pero si construyes velocidad de ataque y luego no compras criticos**, entonces tu da침o sostenido post-definitiva se reduce dramaticamente.\n{{item:3046}} Hola {{item:3046}}  Como {{item:3046}}  Te {{item:3046}}  Va {{item:3046}}  Todo {{item:3046}}  Bien? \nTengo % {{item:3046}}  de reduccion de da침o {{item:3046}} {{item:3046}} \nEse \"nerf\" que vos hablas, es si yasuo en pocas palabras se hace la trini...\n\n\nEvento: Aunque no suelo creer eso que dicen. Pongamos la situacion en donde te doy la razon\nPero no me podes negar que no fue una buena experiencia\nNo me baso en los post de + o -. Normalmente, los post te llevan a reddit, pero de todas formas se comenta \nRepito: Postea uno de Riot acerca del balance y aparece la persona que se escribe la biblia entera ---> No hace falta decir quien tiene la razon\n\n**Y bien, si vas a medir el balance basado en los positivos y negativos, entonces terminarias con un juego en el que Lee Sin Zed Yasuo Vayne y Thresh dominan, y campeones como Zilean Urgot Yorick y Nunu son incapaces de hacerle frente.**\nDecime en que momento, esos ultimos 4 campeones le pueden hacer frente\nYo solo en la LCS veo 2 jg. No veo variedad en el pool de champs en las demas lane\nNerfean a jhin, en vez de a la yoomu\nLo unico que veo son ekkos con distintas builds\n\n\nA los asesinos le sacaron el silence por que no podias reaccionar, ahora podes \"\"\"\"\"\"\"\"\"\"\"reaccionar\"\"\"\"\"\"\"\"\"\"\"\"\"\nTalon, te sigue burtsteando con o sin silence. Ultea desde atras, corre con yoomu y sos pollo\n\n\nSi un asesino tarda en matarme, entonces por que jugaria un asesino. Si me decis que a riven le va mal en early game y no remonta\nEntonces con zed-talon-kata-akali, etc estos asesinos que si no tienen un farm \"decente\" en mid game, son mas inutiles que el mismo supp y esto se sabe desde rato\nQue me sirve llegar a la lineas de atras y no podes asesinar --------> A menos que me estes diciendo que en un futuro van a ir 0/7 y me van a seguir matando, lo veo super balanceado en ese caso \nhttp://www.relatably.com/m/img/curly-bill-meme-well-bye/65815104.jpg\n\nRepito, no veo la diferencia entonces\nSupongamos que le van bien y mal\nBien: Riven Mata a todo el equipo si esta feed\nBien: El asesino llega a los carrys y los mata\nMal: Riven tiene que esperar a saber entrar, pero el da침o lo va a tener por el kit y la clase de campeon que es\nMal: El asesino no tiene dmg, pero pude llegar. Wut?\n\n\nAhora me hablas de asesinos: Ekko\nNunca se jugo de asesino y cuando se juega de asesino (como yo lo uso), es el asesino con menos burts en el juego\nLa unica razon por la que ekko full AP es viable, es por que sigue teniendo stun en area\nAhri: La sigo viendo desde el cambio a la Q y la verdad, no considero bajo ningun aspecto balanceado a este campeon, es mas lo modificaron para premiar a las personas que no sabian jugar sacando el bonus de da침o al impactar el charm\nAhri antes: Si tenias 70-60% de tu vida y te metia charm, te ivas a morir\nAhora: Ahri te mete una Q, te saca el 40% de tu vida y te limpia la wave, ademas de tener bajo CD y un bajo coste de mana\nAhri actualemente, no te tiene ni que meter un charm para matarte\nY repito, sigo sin ver bien la claridad de Ahri, si hablamos de estadisticas Ahri no es balanceada y el kit de ahri no es es claro a mi parecer\nQ: Limpiar wave y pokear\nW: Parece de relleno\nE: Es mas defensivo que de ataque\nR: Cumple 2 funciones y las 2 por igual de bien. Correr o atacar\n\nAkali: El kit de akali siempre dio problemas y ya vemos como termino. No hace falta hablar de este termino\nEspero que el rework que le van a hacer de frutos\nPor que antes del nerf a la E, el counter play de akali era como el de trynda, si no le rompes el culo pre 6. Olvidate de jugar\nTe bursteaba en 1 segundo\n\n\n\nCuando me refiero a menos pool, talvez tengas razon\nPero si vamos agregar 5 champs al pool cada season como es la realidad. Mierda tengo que esperar a la season 37\n\n\nMe refiero a que haya sido para experimentar por la cantidad de cambios que hicieron\nAlgunos buenos (dentro de todo) o merecidos {{item:3124}} \nOtros desastrosos {{item:3078}} y la verdad estas botas {{item:3111}} me estan dejando que desear\nEn la season 5, dijieron que la tenacidad iba a afectar los desplazamientos y seguimos aca\n\n\nMiremos al dragon de viento, cuanto costo darle un poco mas de MS\nMiremos a morde, no puedo creer que sea un campeon todavia\nLa trinidad... Demmmm and pray for the gods\n{{item:3046}} no lo veo en un buen estatus en comparacion a las demas\n{{item:3142}}----------> sigan nerfeando champs \n{{item:3147}} hola, soy un item mas de adc que asesino\n{{item:3800}} Me di cuenta que este item todavia sigue existiendo\n{{item:3083}} En mi vida volvia a ver otra\n {{item:3123}} ?????? ---------> Eso que odian los champs de life steal ustedes\n{{item:3035}} Tenien que tener mas de 175 de armadura para que sea worth...\nY las maestrias.......................................\nhttp://i2.wp.com/memecollection.net/wp-content/uploads/2013/05/thats-enough-internet-for-today-cat.png?resize=340,184\n\n\nOjo, la lista sigue y hay muchisimas cosas que las deje incompletas por que si me decis que clavo un post de 1-2 horas y lo lees\nme la como entera la http://www.experimentosfaciles.com/wp-content/uploads/2016/01/papa.jpg","replies":[{"poster":"Maestro Pok칠mon","date":"2016-09-07T23:12:16.340+0000","up_votes":1,"down_votes":0,"body":"que linda discusion se armo jajaja a spectear {{summoner:2}}","replies":[]}]}]}]}]}]},{"poster":"Pollos Hnos","date":"2016-09-07T02:21:45.405+0000","up_votes":2,"down_votes":1,"body":"Hay que reconocer que riot hace cosas buenas, pero los problemas de conexion son una realidad(ese 80% no se de donde lo habr치s sacado..) y la comunidad es lamentable y no se aplican sanciones severas para corregir estos problemas","replies":[{"poster":"Quo","date":"2016-09-07T02:51:48.391+0000","up_votes":3,"down_votes":0,"body":"El 80% es como decir \"muchos\" o \"pocos\" no pretendia dar un dato exacto. La comunidad es lamentable pero 쯘so es culpa de riot? ultimamente si miras el foro casi a diario hay post's de gente pidiendo que le den una segunda oportunidad porque la banearon, yo mismo he recibido dos carteles de sanci칩n aplicada en esta semana. el problema es que muchos piensan que poner solo \"actitud antideportiva\" y  mandarlo es mas que suficiente para que se aplique la sanci칩n, muchas veces es importante que pongas mas detalles.\n\nPor el tema de la toxicidad y comunidad tu realmente crees que cuando pides un report al final de la partida, 쯦odos lo reportan?\n\nPor el tema de problemas de conexi칩n riot lleva meses trabajando en solucionar los problemas con las empresas, mantenimiento a servidores y buscan soluciones, 쯤ue hace el usuario promedio? \"RIOT K AZCO MAS DAO LAG Y PERDI MI PROMO SIDAAAAA\" cuando en vez de eso bien pueden enviar un ticket a soporte para solicitar ayuda.\n\nMe molesta que la gente critique siempre a riot y lo tenga entre la espada y la pared y esa misma gente sea la primera que no busca dar feedback o buscar soluciones por su cuenta antes de acudir a llorar a los foros o a bardear, con esto tampoco voy a decir que riot sea un santo y haga todo bien, claro que no. Pero vamos, que cansa ver a la gente siempre criticando lo malo y bardeando por todo en el foro, sabes, la gente de riot tambien son seres humanos, de vez en cuando un \"bien hecho\" puede alegrarles el dia individualmente o como empresa. ","replies":[]}]},{"poster":"fenakz","date":"2016-09-07T16:07:23.811+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mbeju Kya,realm=LAS,application-id=v7qsfXsE,discussion-id=1JWnR4ML,comment-id=0000,timestamp=2016-09-06T20:35:06.612+0000)\n>\n> Pero a la gente desgraciadamente eso no le importa, siguen quejandose de la comunidad y los problemas de conexi칩n cuando el 80% de esos problemas son culpa de los propios usuarios.\n> \n> Me alegra que al menos alguien reconozca que riot esta haciendo las cosas bien en algunos aspectos.\n\n\nEl 80% no es de los usuarios, son de los proovedores que tenemos. Ojal치 fuera mi problema y lo solucionar칤a solo.","replies":[]}]},{"poster":"SantiQ432","date":"2016-09-07T00:59:35.072+0000","up_votes":2,"down_votes":0,"body":"Pues a mi me toc칩 PROYECTO:YI y...toca mainearlo jeje...","replies":[{"poster":"Old Gabvy","date":"2016-09-07T15:33:27.586+0000","up_votes":8,"down_votes":1,"body":"izi penta papu","replies":[{"poster":"sonof666","date":"2016-09-08T02:00:57.313+0000","up_votes":1,"down_votes":0,"body":"Si 칠l es \"izi penta\", yo soy \"izi hexa\".\n\nA m칤 primero dentro de unas cajitas de Proyecto me toc칩 a PROYECTO:YI, y en la segunda semana con la cajita proyecto especial me toc칩 a PROYECTO:ZED.  Dos skin proyecto.","replies":[]},{"poster":"Zoycite","date":"2016-09-08T00:48:31.105+0000","up_votes":1,"down_votes":0,"body":"reportado por actitud antideportiva :O {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"UnMainMordeTonto","date":"2016-09-07T18:52:08.794+0000","up_votes":1,"down_votes":0,"body":"jajaja ami me toco a yasuo majinate como quien diria","replies":[]},{"poster":"DarkFlame96","date":"2016-09-07T17:12:17.190+0000","up_votes":1,"down_votes":0,"body":"Dijo la palabra prohibida D: \nDenunciado lince -10 {{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Brightram","date":"2016-09-06T21:55:45.507+0000","up_votes":5,"down_votes":0,"body":"A mi me gusta que est칠n reworkeando a los asesinos, no puedo esperar jajaja\nMe parece perfecto el nerf a yasuo, no se mete con el yasuo de cr칤tico as칤 que sigue igual, arregla el problema que todso ten칤amos con el yasuo tanke que daba mucha recompenza para  poco esfuerzo, as칤 que lo veo bien.\nCajitas, osea skins practicamente gratis\nAwante rito biega y Gaussrik","replies":[{"poster":"EdxxEdxx","date":"2016-09-07T00:03:40.010+0000","up_votes":3,"down_votes":0,"body":"espero que el rework de asesinos (el de katarina y lb mas que nada) se centren un poco mas en balanceo, no me refiero a nerfeos, sino que hacer los campeones mas skilled, especialmente katarina. lb esta bien en skill, pero es bastante agobiante el hecho de que te burstea en early y no tenes manera de reaccionar o defenderte. y bueno, katarina, es desquisiante, no digo que sea invencible, pero si es muy muy molesta el tema de que no es mentira, y es que te pegan un cabezaso al teclado, y te hacen el full-combo y su full-da침o E-E","replies":[{"poster":"Brightram","date":"2016-09-07T15:36:57.401+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EdxxEdxx,realm=LAS,application-id=v7qsfXsE,discussion-id=1JWnR4ML,comment-id=00040000,timestamp=2016-09-07T00:03:40.010+0000)\n>\n> espero que el rework de asesinos (el de katarina y lb mas que nada) se centren un poco mas en balanceo, no me refiero a nerfeos, sino que hacer los campeones mas skilled, especialmente katarina. lb esta bien en skill, pero es bastante agobiante el hecho de que te burstea en early y no tenes manera de reaccionar o defenderte. y bueno, katarina, es desquisiante, no digo que sea invencible, pero si es muy muy molesta el tema de que no es mentira, y es que te pegan un cabezaso al teclado, y te hacen el full-combo y su full-da침o E-E\nLB tiene de Skillful lo que yo tengo de alem치n. Poco y nada\nPega much칤simo sin items y sus Cds no son muy altos, tener en cuenta que su R para el da침o que hace no consume man치. \nEs m치s, no es tanto el da침o lo que molesta, porque si vamos al caso, un rengar te salta en la cabeza y te mata de todas formas (aunque rengar necesita comprarse items, lb con 1 item te puede deletear ) lo molesto es la doble W , Ser un asesino, saltar unas 4000 unidades  y poder volver atr치s sin riesgo alguno es bastante absurdo.  \nEstos champs en s칤 lo que tienen es un punto en que se vuelven absurdos, despu칠s los podes parar pero hay un punto medio en que si te quieren matar te matan.\nAyer jugando Tf vs Zed, yo iba 3/0 y el 1/2 con 20 minioms menos, llego a nivel 6, me ultea, le esquivo la triple Q , me pega una E y auto ataque, sobrevivo a la R, otra vez tiene la E, flash E auto y muero. Explicame como un champ que va por debaojj de nvel, tiene menos items, erra sus skills principales, puede matar tan facilmente en linea, poco logico. Despues s칤, en late no supo hacer nada porque se com칤a un focus de Cristo y terminamos ganando, pero esos snowballs absurdos que tienen algunos.","replies":[{"poster":"EdxxEdxx","date":"2016-09-07T19:30:03.356+0000","up_votes":1,"down_votes":0,"body":"lo del snowball se puede entender, es decir, un asesino obviamente tendra mas snowball que un tanque, pero hay campeones que si, con solo 1 kill que te hagan un snowball del que no importa que hagas no seas capaz de remontar?... zed, como dije, almenos se aguanta, ya que quieras o no tiene skillshots, y debe tirar bien la sombra (no vengamos con \"zed noobchamp me mata\", es un asesino, obvio que tendra da침o, ese no es el caso de todos modos, el caso es que podes defenderte), pero lb y katarina... bueno, bien como dijiste, lb te burstea y te explota, pero el problema es que no tenes tiempo de reaccionar, estas asi en linea tranquilamente y \"PUM toma te bursteo a travez de los minions, te saco media vida, y vuelvo a seguir farmeando :D\". pero bueno, pentarina, es absurdo. lo bueno es que si la destrozas en early despues se queda ahi en toda la partida (claro el problema es lograr que se quede en el early ^o^).\n\npero bueno, de todos modos, esperemos a los reworks, es muy probable que rito los vaya a hacer justamente por este tipo de quejas, y porque los personajes son indeseables :p veamos con que nos salen.","replies":[{"poster":"Brightram","date":"2016-09-07T20:46:16.498+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EdxxEdxx,realm=LAS,application-id=v7qsfXsE,discussion-id=1JWnR4ML,comment-id=0004000000010000,timestamp=2016-09-07T19:30:03.356+0000)\n>\n> lo del snowball se puede entender, es decir, un asesino obviamente tendra mas snowball que un tanque, pero hay campeones que si, con solo 1 kill que te hagan un snowball del que no importa que hagas no seas capaz de remontar?... zed, como dije, almenos se aguanta, ya que quieras o no tiene skillshots, y debe tirar bien la sombra (no vengamos con &quot;zed noobchamp me mata&quot;, es un asesino, obvio que tendra da침o, ese no es el caso de todos modos, el caso es que podes defenderte), pero lb y katarina... bueno, bien como dijiste, lb te burstea y te explota, pero el problema es que no tenes tiempo de reaccionar, estas asi en linea tranquilamente y &quot;PUM toma te bursteo a travez de los minions, te saco media vida, y vuelvo a seguir farmeando :D&quot;. pero bueno, pentarina, es absurdo. lo bueno es que si la destrozas en early despues se queda ahi en toda la partida (claro el problema es lograr que se quede en el early ^o^).\n> \n> pero bueno, de todos modos, esperemos a los reworks, es muy probable que rito los vaya a hacer justamente por este tipo de quejas, y porque los personajes son indeseables :p veamos con que nos salen.\n\nEl de kata no se si lo viste pero est치n cambiando el tema de la E y la W , parece prometedor, y para Lb dicen que le quieren poner una penalizacion de tiempo para volver a la marca del piso, lo veo copado. Esperemos","replies":[]}]}]}]}]},{"poster":"Begins","date":"2016-09-07T13:13:02.185+0000","up_votes":4,"down_votes":0,"body":"Ahora sale {{champion:131}} luna de sangre y ya esta, este no es rito.","replies":[]},{"poster":"MATSUGER111","date":"2016-09-06T22:29:49.602+0000","up_votes":4,"down_votes":0,"body":"Dices que no te importa si nerfean a yasuo y te he visto tu historial de post y es todo lo contrario a lo que dices :) deja de ser falso\nPor otra parte tambien pienso que rito se ha portado bien +10","replies":[]},{"poster":"lordeman10","date":"2016-09-06T23:59:44.801+0000","up_votes":3,"down_votes":0,"body":"recientemente me gust칩 que me dieron cosas en que gastar mi pi para los que \"ya tenemos todo\", hablo de los cromas\n\nla verdad que si estoy bastante conforme con las 칰ltimas deciciones, y me encant칩 la producci칩n que armaron para los e-sports en LAS, me imagino que en worlds a칰n habr치 m치s sorpresas \n\nsiempre hay alguna que otra cosa particular que no nos gusta y la decimos enseguida porque queremos que cambie pero me parece bien destacar de vez en cuando lo que vemos bueno\n\n######춰Es un Boleto para participar en el torneo de la comunidad del foro! [游륳(http://boards.las.leagueoflegends.com/es/c/torneos-y-eventos-de-la-comunidad/TMEkT1AQ-torneo-el-foro-retorcido)","replies":[]},{"poster":"Thails SirYordle","date":"2016-09-06T22:01:26.791+0000","up_votes":3,"down_votes":0,"body":"Alguien que valora a Rito, aun hay gente honorable en este mundo :v +1 proo","replies":[]},{"poster":"Manu Carba","date":"2016-09-06T21:28:09.890+0000","up_votes":3,"down_votes":0,"body":"Acordate de la gloriosa Artesania Hextech <3","replies":[{"poster":"EdxxEdxx","date":"2016-09-07T00:05:02.890+0000","up_votes":2,"down_votes":0,"body":"\"riport rito no me dan llaves\" score: 2/24/3   C+ \n\"riport rito no me dan cajas >:C\" score: 4/15/6    A-\n \npobre rito, se merecen algo de piedad D:","replies":[{"poster":"1KRAVEN1","date":"2016-09-07T01:09:32.367+0000","up_votes":2,"down_votes":0,"body":"Suele pasar 10/31/11{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Carbon6player","date":"2016-09-08T03:39:58.784+0000","up_votes":1,"down_votes":0,"body":"yo tengo 5 ptas llaves :'v y eso que quedo A+ :'vvvvvvvvvvvvvvvvvvvv","replies":[{"poster":"EdxxEdxx","date":"2016-09-08T03:59:31.082+0000","up_votes":1,"down_votes":0,"body":"como cuando jugas con el mismo campeon, pero ya sacaste un cofre con el, y te empezas a llenar de llaves pero sos pobre y no podes comprar cofres con rp ;-;","replies":[]}]}]}]},{"poster":"Arcoiris de Amor","date":"2016-09-07T21:36:04.377+0000","up_votes":2,"down_votes":0,"body":"pantheon panadero pudo ser mejor :(","replies":[]},{"poster":"Alba Mortem","date":"2016-09-07T02:59:02.672+0000","up_votes":2,"down_votes":1,"body":"S칤... otro post de estos... es c칩mo si... ahora viniesen c칩mo unos pro-riot... China tendr치 que ver con esto...\n\nEn fin, igual, esas son cosas superficiales, es se침al que se est치n perdiendo muchos jugadores, debo admitir que son cosas muy buenas y se les agradece de coraz칩n, pero tienen que seguir esforz치ndose y buscar una manera de mejorar el balanceo... (Porqu칠 en esta temporada se fueron al demonio con los items y algunos champs), vamos que se puede Riot, sigue as칤, tambi칠n deben seguir esforzandose por mejorar la comunidad pero SOBRETODO: Debemos dar parte de nosotros para que eso sea posible, lastima que la mayor칤a de los usuarios no frecuentan el foro.","replies":[{"poster":"Alba Mortem","date":"2016-09-07T06:10:32.646+0000","up_votes":2,"down_votes":1,"body":"Por lo visto no se los puede complacer, mi comentario completo es una clara adulaci칩n a Riot, pero en fin, sigan as칤, solo quedaran los fan치ticos de siempre.","replies":[{"poster":"UnMainMordeTonto","date":"2016-09-07T18:49:36.309+0000","up_votes":2,"down_votes":0,"body":"see, sale esto no nos gusto. Cuando rito se ponga como blizzard a cobrar 20 usd al mes por su juego van a agradecer las skins gratis","replies":[]}]},{"poster":"UnMainMordeTonto","date":"2016-09-07T03:09:24.488+0000","up_votes":1,"down_votes":0,"body":"Como van a mejorar la actidud de alguien que si le baneas se crea otra cuenta y hace lo mismo 1 y otra ves","replies":[{"poster":"Alba Mortem","date":"2016-09-07T06:09:41.656+0000","up_votes":2,"down_votes":0,"body":"Entonces est치n condenados.","replies":[]},{"poster":"Rayxah","date":"2016-09-08T07:29:01.626+0000","up_votes":1,"down_votes":0,"body":"Nadie tiene tanto tiempo para gastar un mes entero en subir una cuenta a nivel 30 solamente para \"ni침oratear\". 2 veces te lo hacen, 3 ya no.","replies":[]}]}]},{"poster":"Marshall Mathers","date":"2016-09-06T22:05:32.640+0000","up_votes":2,"down_votes":0,"body":"+10 papu{{champion:36}}","replies":[]},{"poster":"MapacheMandioca","date":"2016-09-06T21:42:02.267+0000","up_votes":2,"down_votes":0,"body":"Riot nos esta dando un monton de regalos y eso me encanta, lastima que en la skin proyecto me haya salido leona pero lo UNICO que tengo para criticar es la poca esencia que te dan por desencantar las cosas de proyecto (2 de esencia) ya que a mi al menos me quedaron varias cosas pero despues de eso se pasaron con su amabilidad la verdad\nFelicitaciones Riot Games! :D espero que sigan haciendo este buen trabajo","replies":[]},{"poster":"Rayxah","date":"2016-09-07T01:06:26.811+0000","up_votes":3,"down_votes":1,"body":"Eventos hacen siempre, es lo que mantiene a la comunidad activa. Rework's/nerf's/buff's son cosas que siempre se hicieron, porque es el modo en el que el juego se mantiene en constante avance y no se queda en el tiempo. \n\nLo de los chromas, no lo hicieron porque los usuarios lo pidieron, lo hicieron porque la gente no las compraba porque no val칤a la pena gastar el rp que vale una skin, por tener el champ de otro color.\n\nLo 칰nico \"nuevo\" que metieron fue la artesan칤a hex, que al principio estaba \"bien\", despu칠s misteriosamente baj칩 el ratio de llaves bastante (lo digo, porque entre los 칰ltimos meses y el que sali칩, es claro que me bajaron el 50% de la cantidad de llaves que ganaba, siendo que cada mes \"se reinicia la curva\").","replies":[{"poster":"Old Gabvy","date":"2016-09-07T15:33:07.462+0000","up_votes":2,"down_votes":1,"body":"Es mas facil ganar llaves si jugas premade, la idea es volcar a que los jugadores tiendan a jugar con amigos. Entonces si quer칠s farmear llaves, mejorar tu puntuaci칩n de una partida, no te parece mejor hacerlo en blind pick con amigos, usando ts/skype ? :)","replies":[{"poster":"Rayxah","date":"2016-09-08T07:27:00.349+0000","up_votes":1,"down_votes":0,"body":"No, la verdad que no. Y siendo que juego una de cada 20 partidas s칩lo apenas, porque me cans칠 de que me toquen ni침os t칩xicos y troll's tampoco es cierto que mejora la posibilidad, porque juego con 3 premades m치s por d칤a y la cantidad de fragmentos que consigo, es una cada 3 d칤as aproximadamente (o me los tira a los 3 un mismo d칤a y durante la semana no me dan ni la hora).","replies":[]},{"poster":"Handicapped PC","date":"2016-09-07T19:03:30.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gabvy,realm=LAS,application-id=v7qsfXsE,discussion-id=1JWnR4ML,comment-id=000c0000,timestamp=2016-09-07T15:33:07.462+0000)\n>\n> Es mas facil ganar llaves si jugas premade, la idea es volcar a que los jugadores tiendan a jugar con amigos. Entonces si quer칠s farmear llaves, mejorar tu puntuaci칩n de una partida, no te parece mejor hacerlo en blind pick con amigos, usando ts/skype ? :)\n\nEs muy bajo el ratio de llaves aunque jueges con amigos, Siempre juego casi todas mis partidas en premade menos las ranked y  muy pocas veces gano fragmentos de llaves, muy de vez en cuando de repente se vuelve loco el sistema y gano un monton de fragmentos de la nada.","replies":[]},{"poster":"UnMainMordeTonto","date":"2016-09-07T18:50:54.682+0000","up_votes":1,"down_votes":0,"body":"la verdad una ves casi perdemos, (estaba flameandome pero por skype al final me calme) luego de repente dejamos de amargarnos y nos ponemos a trabajar en team y ganamos hibamos perdiendo por 3 torres y 11 kills","replies":[]},{"poster":"OG Noah do Bree","date":"2016-09-07T16:48:44.182+0000","up_votes":1,"down_votes":0,"body":"igual siento que el ratio de llaves es muy bajo, te lo digo siendo un jugador que el 90% de sus partidas las juega en premade de m칤nimo 4 jugadores. La unica forma de sacar llaves es cuando reinician la curva, y solo saco 2 llaves al mes (como exageraci칩n 3)","replies":[{"poster":"CIown Fiesta","date":"2016-09-07T17:14:31.976+0000","up_votes":1,"down_votes":0,"body":"Creo que es tu mala suerte porque yo en un mes llego a sacar 5 llaves jaja\nEn este momento tengo 6 creo, pero no tengo cofres T.T","replies":[]}]}]}]},{"poster":"Its Hero Time","date":"2016-09-08T00:54:57.687+0000","up_votes":2,"down_votes":2,"body":"URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF URF URF URF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF RUF RUF RUF RUF RUF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF URF  URF","replies":[]}]}