{"poster":"ESG Curo","date":"2017-03-22T21:16:27.902+0000","title":"PLATIN 1 MIDLANER sucht TEAM","subforum":"Clans & Teams","embed":{"description":"ESG Curo / Platinum 3 21LP / 115W 108L Win Ratio 52% / Vayne - 33W 23L Win Ratio 59%, Ashe - 14W 14L Win Ratio 50%, Jhin - 11W 14L Win Ratio 44%, Varus - 9W 9L Win Ratio 50%, Ezreal - 2W 12L Win Ratio 14%","url":"https://euw.op.gg/summoner/userName=ESG+Curo#","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":2,"down_votes":0,"body":"Heyho, ich bin der Nicolas und 16 Jahre alt und zurzeit anscheinend auf der Suche eines Teams. Ich\r\nmaine wie man am Titel schon sehen kann Midlane seit Season 4. In S6 war ich Platin 1-2 wo ich 2 Wochen nach Seasonstart auch wieder angelangt war aber nun auf Platin 3 gedropped bin. Meine gr&ouml;&szlig;te Schw&auml;che ist das Wave-catching im Mid-Lategame, im Moment bin ich aber damit besch&auml;ftigt genau das zu &auml;ndern. Meine St&auml;rken sind wenn ich nicht komplett geboostede Tage habe, meine Mechanics und mein Shotcalling. Ich besitze Teamspeak, Discord und Skype. Das Team sollte wie im Titel schon steht mindestens im Platinbereich sein und ich h&auml;tte auch nichts dagegen bei Diamond-Teams als Substitude zu spielen. Ich bin vorallem auf der Suche nach einem &quot;ESL-Team&quot; bzw. einem competitive-Team womit man auch mal spa&szlig;ige Abende haben kann und nicht 24/7 tryharded. Mein Championpool besteht aus Viktor, Syndra, Vlad, Jayce, Zed, Azir, Orianna, Ahri, Talon und Ekko. Des weiteren spiele ich seit Season 3 League of Legends und spiele seit Mitte Season 4 aktiv Ranked. Ich war vorher in 3 Teams die sich aber alle mit der Zeit aufgel&ouml;st haben deshalb ist mir der Fakt das das Team lange besteht auch sehr wichtig. Ansonste kann man mich eigentlich immer im TS finden (endside-gaming.de) oder Ingame unter &quot;ESG Curo&quot;. Ich w&uuml;rde mich sehr &uuml;ber Antworten freuen und bin gerne bereit Tryouts zu spielen :).","replies":[{"poster":"ESG Curo","date":"2017-03-23T18:47:19.844+0000","up_votes":1,"down_votes":0,"body":"push dis","replies":[]},{"poster":"ESG Curo","date":"2017-03-22T21:16:40.047+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]}]}