{"poster":"9AngelOfDeath5","date":"2017-11-23T19:55:20.202+0000","title":"buona sera problemi ping","subforum":"Aiuto e supporto","up_votes":4,"down_votes":0,"body":"buona sera ragazzi .. scusatemi sono due giorni che molto a caso, ho problemi di ping, aprendo lol.\r\nNello  speed test il ping mi si alza solo quando apro l&#039; app di lol se no la connessione &egrave; stabile.\r\nDetto cio &egrave; un problema del server?\r\npoiche ho chiamato il mio operatore e mi ha detto che la connessione &egrave; ok!\r\nho provato a mettere a posto dns disistallare antivirus e tutto. Cosa posso far? ho fatto anche il lagreport!","replies":[{"poster":"Chroniicles","date":"2017-11-24T16:15:19.570+0000","up_votes":1,"down_votes":0,"body":"Ciao! Utilizzi la connessione wi-fi per giocare? Perchè in caso dovresti provare se col cavo il problema persiste!\nDovresti anche assicurarti che non ci siano altri dispositivi a saturare la banda (altri pc in casa, cellulari, tablet, ...)","replies":[]},{"poster":"YOL0WN","date":"2017-11-24T10:27:06.465+0000","up_votes":1,"down_votes":0,"body":"anche io problemi di ping se pur meno di voi .. giocavo con 38 ora sto a 44 ... sembra una cretinata ma da fastidio ... ergo sono loro","replies":[]},{"poster":"AthlonX860","date":"2017-11-24T09:45:44.295+0000","up_votes":1,"down_votes":0,"body":"Anche io ho problemi di ping, ma solo la sera. ieri ho superato i 9000ms :D","replies":[]},{"poster":"Sclaus","date":"2017-11-23T20:55:16.252+0000","up_votes":1,"down_votes":0,"body":"Anche io ho notato strani aumenti di ping ultimamente... di sicuro non sarà colpa della mia connessione.","replies":[]},{"poster":"javateciava","date":"2017-11-23T20:29:25.933+0000","up_votes":1,"down_votes":0,"body":"Ciao, credo sia un problema dei server centrali. Ultimamente hanno messo mano ai punti d'accesso dei giocatori per ridurre la lag. È più che facile che ti abbiano \"tagliato la connessione\".\nEdited: Sto avendo anch'io \"problemi di connessione\".","replies":[]},{"poster":"WillSmith89","date":"2017-11-23T22:20:43.942+0000","up_votes":1,"down_votes":1,"body":"Anche io sono due giorni che ho ping esagerati... oltre 300 ogni partita, quando non ho mai avuto problemi di ping sempre sotto i 60 fps. Potete risolvere? è parecchio fastidioso ed è difficilissimo giocare","replies":[]}]}