{"poster":"Neox","date":"2015-06-04T06:39:34.195+0000","title":"Ability to Give Reasoning to Solo Ranked dodge","subforum":"Miscellaneous","embed":{"description":null,"url":"http://i.imgur.com/ohZJDLM.jpg","image":"http://imgur.com/ohZJDLMs.jpg"},"up_votes":5,"down_votes":0,"body":"Riot should introduce a option to say why you have dodged in solo ranked at selection, and the ability to report trolls that make selection and inevitably the game terrible to play. Of course they&#039;d be troll reports also, but the tribunal would be able to distinguish which is which. \r\nIt would be easy to see who the trolls are also from chat, and the picks that the team didn&#039;t agree on or a lane was already locked in or called.\r\n\r\nI just feel that its silly to see someone doing fine by the team, dodge pregame because there&#039;s a troll in the team before the game even starts. And they&#039;ll get the time penalty rather than the troll.\r\n\r\nYeah, Nah?","replies":[{"poster":"Maraudaur","date":"2015-06-04T07:19:00.157+0000","up_votes":3,"down_votes":0,"body":"Hey Neox,\n\nInstead of giving players the option to report and punish players that troll/fight over roles and lanes, we are working on solving the root issue. The current iteration of Team builder is a test and we are working on the next iteration of team builder. If match making can take roles into account (e.g. not match up two people who want mid) then a lot of champion select problems and frustrations will be gone.\n\nCheck out this thread on reddit a while back that had a player talking about a very similar situation, with Riot Lytes response!\nhttps://www.reddit.com/r/leagueoflegends/comments/2ws22k/i_miss_doing_tribunal_work/cou0c1c","replies":[{"poster":"Garens Harem","date":"2015-06-04T10:44:31.223+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Maraudaur,realm=OCE,application-id=Ntey9fRZ,discussion-id=6rA58zNK,comment-id=0000,timestamp=2015-06-04T07:19:00.157+0000)\n>\n> Hey Neox,\n> \n> Instead of giving players the option to report and punish players that troll/fight over roles and lanes, we are working on solving the root issue. The current iteration of Team builder is a test and we are working on the next iteration of team builder. If match making can take roles into account (e.g. not match up two people who want mid) then a lot of champion select problems and frustrations will be gone.\n> \n> Check out this thread on reddit a while back that had a player talking about a very similar situation, with Riot Lytes response!\n> https://www.reddit.com/r/leagueoflegends/comments/2ws22k/i_miss_doing_tribunal_work/cou0c1c\n\ngood to see oce reds responding to threads\n\nmeanwhile in na, very few reds contact xd","replies":[{"poster":"JasonWazza","date":"2015-06-04T11:32:01.100+0000","up_votes":1,"down_votes":0,"body":"Realistically we get less red replys then NA because NA just has a higher amount of threads, the percentage of threads that get red responses in NA is lower, but the overall number is likely higher.","replies":[]}]}]},{"poster":"noogai","date":"2015-06-04T10:03:10.226+0000","up_votes":2,"down_votes":1,"body":"Perhaps Rito should consider disabling blind pick for a day or two, and just use team builder for normals?\n\nThat way, team builder actually gets some use as the only reason people don't use it is because of the insane queue times. Rework it to: Top lane, Mid lane, Jungle, ADC and Support only, none of this mage mid, mage bottom etc, and then let the masses decide which one they prefer.","replies":[{"poster":"Project Xayah","date":"2015-06-04T11:47:07.421+0000","up_votes":1,"down_votes":0,"body":"> Perhaps Rito should consider disabling blind pick for a day or two, and just use team builder for normals?\n\nOr we could just get rid of blind pick altogether. Maybe even replace it with draft pick.\n\n> That way, team builder actually gets some use as the only reason people don't use it is because of the insane queue times.\n\nWell, if all the people who complained about TBs insane queue times actually used the queue there wouldn't be insane queue times. The **only** reason those same people have used TB before is because of things like those role icons and the SR beta.\n\n> Rework it to: Top lane, Mid lane, Jungle, ADC and Support only, none of this mage mid, mage bottom etc, and then let the masses decide which one they prefer.\n\nI have to disagree with you there. What you're suggesting is a standard \"META\" pick, which isn't the intention of the teambuilder queue. Not to mention, the current system gives *more* information to potential team mates than what you're suggesting. Rather than just getting \"Support\" or \"Top\" you get an idea on how the person is intending to play the champion.","replies":[{"poster":"noogai","date":"2015-06-04T13:00:34.236+0000","up_votes":1,"down_votes":0,"body":">Or we could just get rid of blind pick altogether. Maybe even replace it with draft pick.\n\nYeah, but then you still have people trolling with picks. People disrespecting pick order and picking ADC even though it's already been picked because they don't wanna play support dangit!.\n\n>Well, if all the people who complained about TBs insane queue times actually used the queue there wouldn't be insane queue times. The only reason those same people have used TB before is because of things like those role icons and the SR beta.\n\nIt's a neverending circle man. If people would use TB, TB wouldn't have huge queues, but it does, so people don't use TB. That's why I suggested disabling BP for a day or two so people get to see the matchmaking system.\n\n>I have to disagree with you there. What you're suggesting is a standard \"META\" pick, which isn't the intention of the teambuilder queue. Not to mention, the current system gives more information to potential team mates than what you're suggesting. Rather than just getting \"Support\" or \"Top\" you get an idea on how the person is intending to play the champion.\n\nI'm talking only for that specific day. People nowadays only call top mid jg sup and adc anyway, sure there are OoM (out of meta) picks as well but they're still in a lane somewhere.\n\nAll of this, and team builder lets you drop out at any time without a penalty. I don't believe normal games should have a penalty for dodging the queue either, but that's because of the current state of whiny babies that will instalock or will lock the lane/champ/role you want before you even get a chance to actually have somebody else confirm who called.","replies":[]}]}]},{"poster":"100Problems","date":"2015-06-07T04:09:19.353+0000","up_votes":1,"down_votes":0,"body":"Yeah, this is in ranked queue and the azir still chose mid when i took it.","replies":[{"poster":"100Problems","date":"2015-06-07T04:42:28.525+0000","up_votes":1,"down_votes":0,"body":"I gave him mid and vsed a ren at top and here's the end result.","replies":[]}]},{"poster":"Transcender","date":"2015-06-07T03:46:38.648+0000","up_votes":1,"down_votes":0,"body":"I think a tribunal is the only answer for oce.\n\nI will probably get banned simply because people don't like who I am and what i do but as a whole the reporting system needs to filter out all of the people in this game who are still evolving from primates.\n\nWe will have like no one left and queue times will be 10 mins+ but hey that's our community for you.","replies":[]},{"poster":"BadLuckFollowsMe","date":"2015-06-04T23:41:35.747+0000","up_votes":1,"down_votes":0,"body":"Literally a minute ago, got a guy that went \"Going mid\" then after locking a char \"Actually no, can someone else.\" Then, after me and second pick locked a top and mid \"Actually, going mid again.\"\n\nSwiftly followed was literally every person on the team saying \"gg I'm afking\" or \"gg I'm going to feed\", leaving me to have to lose lp and get a time ban because nobody else would.\n\nSo yeah, we need a better system for dodging.","replies":[]},{"poster":"Chicken4dinner","date":"2015-06-04T11:53:54.575+0000","up_votes":1,"down_votes":0,"body":"I made a post about this a while ago, Heartvine here thought it would be great to compare me with a child who wants to get away with being naughty >:(\n\nHad been simmering over that for a while actually","replies":[]},{"poster":"mallasaur","date":"2015-06-04T08:11:44.906+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"KidneyxThief","date":"2015-06-04T08:41:48.616+0000","up_votes":1,"down_votes":0,"body":"This has zero reverence to the op's discussion.... \n\nMaybe make your own post if you ... want to tell people about your ban.","replies":[{"poster":"noogai","date":"2015-06-04T10:00:17.981+0000","up_votes":1,"down_votes":0,"body":"It's spelled \"relevance\".","replies":[]},{"poster":"mallasaur","date":"2015-06-04T08:51:32.065+0000","up_votes":1,"down_votes":1,"body":"i know i know. i got that already. im worried thats all.","replies":[]}]},{"poster":"GoldenTomat0","date":"2015-06-04T08:15:50.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mallasaur,realm=OCE,application-id=Ntey9fRZ,discussion-id=6rA58zNK,comment-id=0001,timestamp=2015-06-04T08:11:44.906+0000)\n>\n> i got permabanned for no reason i can recall. i didnt even get an explaination to why i got banned. i have only been banned once for only 2 days and that was for leaving a game. and that was 2 years ago. since than i have played to have fun and seldom done anything to offend others. so even if i have done something wrong, it seems very harsh to me that i got permabanned without a warning. Thank you. I just wanted you guys to know this and i know this has very little to do with the discussion.\n\nkeep it in your own thread.","replies":[]}]}]}