{"poster":"Guardian33","date":"2017-06-02T16:01:36.637+0000","title":"League of Legends Support is a joke.","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"The league of legends support team, or whoever is managing the ticket systems is a complete joke. For the past 5 days I have been trying to get a Riot employee to help me with my issue through the ticket system, but so far they have just made my situation worse.\n\nHere is my situation.\n\n- I have been playing on my account for a while, and decided to change the password to make it more secure than it already was, especially since I was spending a bit of RP on the game. Furthermore, the email that was verified to my account is one that I do not remember, not the full name of the email or the password.\n- I opened up a ticket explained my situation of how I wanted to change the email linked to my account. I was sent questions to a personal email of mine to answer and have done so. During this process they had blocked my account, and I was unable to log in through the league of legends gameplay client.\nI was reviewed and I was not given authorization to change the email linked to my account.\n- I said fair enough, I'll just try again in a few months, and hopefully I will get more questions correct. I attempt to log into the league of legends client and...the account is still blocked. I cannot log in, I cannot play games. I am left in the dust.\n- I am now left with a support employee who takes days to answer, an account that is still blocked for no reason. I decide to open another ticket to help progress my situation. I open a ticket, explain the situation of how my account is still blocked. This second employee on this ticket then emails me the same set of questions which I failed to answer from the first employee.\n- I wish I had never opened a ticket, I would have been happily playing on my account.\n\nSomeone please help me","replies":[{"poster":"Porocles","date":"2017-06-02T16:07:09.277+0000","up_votes":2,"down_votes":1,"body":"It sounds like you've gone through a lot and I know all of this might feel like a hassle, but our account team won't give an account back unless they are absolutely sure- without a shadow of a doubt- that it's going back to the account owner.  \n\nThis series of questions that you're asked is going to happen anytime you reach out to the account team to verify ownership, otherwise it's unlikely that we'll share any info about the account or make modifications.  \n\nAn account might also get locked in case of suspicious activity or unauthorized access as a layer of protection.  If you have a ticket number, I'd be happy to check on the status, but do your best to verify that you're the owner in the ticket to make things a bit easier for everyone involved.  Let me know!","replies":[{"poster":"Guardian33","date":"2017-06-02T16:23:48.169+0000","up_votes":1,"down_votes":0,"body":"Please help me man. I literally have no idea what to do or how to get it unblocked.","replies":[]}]},{"poster":"Guardian33","date":"2017-06-02T16:22:48.400+0000","up_votes":1,"down_votes":0,"body":"Thank you for the reply.\n\nBut what is the point of blocking an account? Your not giving an account back if it was unblocked in the first place?\nIf it was never blocked in the first place, and a hacker had gotten into it, Obviously the hacker wouldn't reach out to the support team to get it blocked. I literally have the password and username and I play on the account all the time. If I were a hacker of some sort, I would have already gifted any champions or riot points that were in the account before having reached out to the support team. You aren't giving anything back? I am not asking for anything but for you to unblock the account.....\n\nI'm sorry, but there literally is no logic in blocking an account. Your blocking an account, and not going to unblock it, even though by default every account is unblocked??? wtf????\n\n\nHere is my ticket.\n30480632","replies":[{"poster":"Porocles","date":"2017-06-02T16:47:47.517+0000","up_votes":1,"down_votes":0,"body":"The lock would prevent any further access, or worse, damage that could have otherwise been avoided.  These locks are applied as protection and when suspicious activity or access is determined.  What's worse than just losing access is a player's account that lost content, transferred, or even participated in malicious activity.  :(  On the bright side of it all, our account team can help with both recovery and repairs but it doesn't heal the negative experiences other players could have been caused. \n\nI looked at your ticket status, and it looks like you're causing quite a bit of delays for yourself.  I know you're eager to get your account back, but you're spamming tickets which can cause confusion and delays.  Seriously, we want to help you get your account back and as fast as possible but you need to work with us dude.\n\nYour specialist made you a ticket with recovery questions.  Do you have that ticket number and have you replied back with answers yet?  Help us help you.  :/","replies":[{"poster":"Guardian33","date":"2017-06-02T17:04:36.963+0000","up_votes":1,"down_votes":0,"body":"1st ticket included Hixion which was my initial ticket that was about changing the email. I responded to the questions.\nMy 4th ticket, I was sent the same questions to answer and was regarding account blockage.\nI will reply to the 4th ticket as I did with the 1st and I will wait for the answer.\n\nThank you for your help","replies":[]}]}]}]}