{"poster":"Kivolan","date":"2019-11-14T04:54:49.739+0000","title":"Toning Down Ekko's Safety & Reliability","subforum":"Gameplay","up_votes":59,"down_votes":13,"body":"> We've recently removed your post for violating the Boards Universal Rules and sub-board guidelines, which prohibit the posting of low-effort and non-constructive content.\n\nALRIGHT LET'S TRY THIS AGAIN FOLKS\n\nEkko has been sitting at a 53-54% win rate with an 8%+ play rate for months now. This was mainly due to a _multitude_ of buffs ~~in preparation for his true damage skin being released~~ to get him seen in pro play more. These included a cost reduction and stun duration increase on his W in 9.18, as well as higher damage on his E and a lower cooldown on his R in 9.16.\n\nAll of this combined has pushed Ekko to the top tier Jungle spot. How? High reliability and a plethora of failsafes in his kit.\n\nEkko's optimal build path starts with {{item:3152}}, giving him additional mobility with which to get to a champion. Combined with his two-part E, which first lets him cross walls before blinking to an enemy, this dash range is nearly half the screen (First part of E, {{item:3152}}, second E.) Once on you, you're either stunned for a whopping 2.25 seconds or at least slowed by his Q. Three stacks of his passive also grants him movement speed, which is easily obtained just from his E + Q + auto. This makes escaping from a gank quite nearly impossible on an immobile champion, even when successfully landing all of your abilities.\n\nPerhaps the most frustrating aspect of Ekko's kit is his R, however. While it's an easily avoidable damage nuke, it's more often used as an \"oops, I messed up\" button to get away with tower dives and failed engages. Combined with his passive movement speed and a shield from his W, this makes Ekko far too safe of a champion.\n\nSo how do you nerf him back to a state where he's able to be dealt with while keeping his unique play style as a skirmisher for teamfights? The easiest answer is to revert the majority of his buffs, as they were largely unneeded. Ekko's SUPPOSED to be a high skill cap champion, but he's simply too safe and reliable at the moment to really be anything of the sort, as evidenced by that high win rate with such a huge play rate. Specifically, I'd revert the cooldown buffs to his ultimate, and reduce the duration of his stun back to 1.75.\n\nMy other thought is to remove some of that reliability when it comes to trades, which gives the enemy time to react. The main reason you can get an entire rotation off on him and still come out behind is because he's already triggered his passive before you're able to peel him off, giving him an extra speed boost to close whatever gap you managed to create. This can be done by upping his passive's trigger requirement to four hits, which requires two auto attacks in addition to his initial E + Q before he gains that bonus movement speed, and upping the cooldown of his dashes by an extra second or two, forcing him to retreat for an additional moment before reentering fights.\n\n~~Hope that was enough effort.~~","replies":[{"poster":"94372148","date":"2019-11-14T07:40:06.685+0000","up_votes":41,"down_votes":4,"body":"I think you mean let's tone down the safety and reliability of quite literally every assassin out right now.","replies":[{"poster":"Śhunpo","date":"2019-11-14T08:26:55.042+0000","up_votes":15,"down_votes":1,"body":"You mean revert the assassin update and every assassin rework.","replies":[{"poster":"Z3SIeeper","date":"2019-11-14T11:29:53.965+0000","up_votes":14,"down_votes":0,"body":"The assassin update introduced longer burst windows. The buffs and overall meta shift that followed said fuck those windows.\n\nThose burst windows still exist, they were good reworks, but they are just blatantly ignored because it only takes half of an assassins kit to blow someone up right now.\n\nAlso imo revert these reverts or rework them properly {{champion:7}} {{champion:107}} .","replies":[{"poster":"xelaker","date":"2019-11-15T05:06:34.942+0000","up_votes":2,"down_votes":0,"body":"The fuck do I care about burst windows if I die in .79 seconds?","replies":[]}]}]}]},{"poster":"AquariusGine","date":"2019-11-14T09:40:19.948+0000","up_votes":21,"down_votes":2,"body":"Gotta wait till TD Ekko hype dies down before the nerf hammer.","replies":[]},{"poster":"Godlzahar","date":"2019-11-14T09:29:41.821+0000","up_votes":20,"down_votes":3,"body":"His broken as hell, and not only that but you can get 25 sec cd on his ult with right runes as well! Thats right!","replies":[{"poster":"ikiriou","date":"2019-11-14T18:03:33.717+0000","up_votes":5,"down_votes":0,"body":"As a main of Ekko i can confirm that it's less than 25 seconds it's more 20.63 sec or something like that :p","replies":[]},{"poster":"AmWhaleIRL","date":"2019-11-14T18:25:59.095+0000","up_votes":3,"down_votes":0,"body":"Yeah, playing him the other day I also found his Ult CD to be nutty low. Not enough window for punish.","replies":[{"poster":"TheBootyDoctorMD","date":"2019-11-15T02:25:12.590+0000","up_votes":1,"down_votes":0,"body":"Ekko somewhat falls off late game so this hardly makes or breaks games that I have. This CD only happens at rank 3 of his ulty. At this point in the game he gets stunned and a blown up by an adc quite easily. I mean I main adc so he should be the bane of my existence, but assuming someone didn't int for the first 20 minutes of the game - which they probably did - I don't think this is a big problem of his kit vs other things.","replies":[]}]},{"poster":"WTBeGirl100EUhr","date":"2019-11-14T16:53:29.888+0000","up_votes":1,"down_votes":0,"body":"If you opt into gimmick runes for the express purpose of having a 25s CD ult and explicitly itemise for 45% CDR which he _will_ reach eventually but usually in the jungle not until 4/5 items (Runic+Proto+Zhonya+Lich Bane), with boots and Morellonomicon being in there somewhere and often wanting to go for Rabadons for increased healing and shielding from his R and W respectively then, yes, you can get 25s CD ult. \n\nThe reality is that ultimate hunter is garbage because of how _overkill_ it is.","replies":[]}]},{"poster":"preternatural","date":"2019-11-14T10:04:14.598+0000","up_votes":14,"down_votes":2,"body":"i don't care, i told people he didn't need those buffs he received 3 patches in a row prior to his skin being announced and i was told i didn't know anything about ekko.\nyeah sure then, now ya'll suffer for it and it ain't my problem.\nhe's pretty nifty to pilot right now.","replies":[]},{"poster":"Z3SIeeper","date":"2019-11-14T11:27:29.974+0000","up_votes":11,"down_votes":2,"body":"Tone down his damage imo. The utility buffs were good and made him better at skirmishing (which requires survival).\n\nIf Ekko is gonna be a skirmishing assassin, he should be partially giving up assassin qualities (nutty damage) to reap the benefits of his skirmisher identity (ability to stay scrappy).\n\nOR\n\nWe can just nerf the skirmishing qualities while keeping his assassin qualities the same (aka revert the buffs).","replies":[{"poster":"Ahri Body Pillow","date":"2019-11-15T02:10:31.594+0000","up_votes":3,"down_votes":0,"body":"This. Ekko is SUPPOSED to be able to get out and try again. That was Riot's entire point when making him He's supposed to be a utility assassin. The trade-off is damage for utility in the form of his W, Q slow, and his old passive slow. \n\nTone down the damage, keep his utility and ability to get out of sticky situations.","replies":[]},{"poster":"Academy Kayn","date":"2019-11-14T18:29:37.930+0000","up_votes":1,"down_votes":1,"body":"In some fairness, Ekko has lower damage than most assassins early game. It's just that when he gets snowballing, that damage now starts coming from being ahead of the enemy, more than it being in his kit, but that's what I've personally been experiencing. I could be wrong in my observation, but most Ekkos when ahead, I've found, have a hard time killing anyone who isn't stunned, not without his ult.","replies":[{"poster":"Kivolan","date":"2019-11-14T22:20:40.618+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Academy Kayn,realm=NA,application-id=3ErqAdtq,discussion-id=aEkdhdVe,comment-id=000a0000,timestamp=2019-11-14T18:29:37.930+0000)\n>\n> In some fairness, Ekko has lower damage than most assassins early game. It's just that when he gets snowballing, that damage now starts coming from being ahead of the enemy, more than it being in his kit, but that's what I've personally been experiencing. I could be wrong in my observation, but most Ekkos when ahead, I've found, have a hard time killing anyone who isn't stunned, not without his ult.\n\nThis is why he excels in the jungle, and his lane win rates are more in tune with what you've expect. Targets will already be at 75-50% health, and he has a far too easy time getting to them and sticking to them.","replies":[]}]}]},{"poster":"HeartPalpitation","date":"2019-11-14T10:10:21.197+0000","up_votes":4,"down_votes":13,"body":"I dunno man ekko is incredibly snowball reliant and if he doesnt somehow get picks early he is pretty fucking terrible. Ekko is fine IMO and people need to stop asking for nerfs when pre season is right around the corner, it will shake up the meta quite a bit and only ekko jg is *strong8 and jg is getting quite a nerf in preseason. So relax im sure you will be getting the tank jgs back again soon since apparently thats all people want in this game now lol.","replies":[{"poster":"wolf jade","date":"2019-11-14T10:10:57.704+0000","up_votes":6,"down_votes":7,"body":"Not true","replies":[{"poster":"HeartPalpitation","date":"2019-11-14T10:13:06.935+0000","up_votes":12,"down_votes":3,"body":"> [{quoted}](name=wolf jade,realm=EUNE,application-id=3ErqAdtq,discussion-id=aEkdhdVe,comment-id=00070000,timestamp=2019-11-14T10:10:57.704+0000)\n>\n> Not true\n\ngood input man you really disproved me","replies":[{"poster":"wolf jade","date":"2019-11-14T10:27:41.077+0000","up_votes":6,"down_votes":5,"body":"thanks","replies":[]}]}]}]},{"poster":"taleofsonata","date":"2019-11-14T13:27:43.625+0000","up_votes":9,"down_votes":1,"body":"Tone down his fucking Q spam in lane. Make it soo that the cooldown is long enough that the stacks runs out. Or increase its mana cost to 110 mana at max rank.","replies":[]},{"poster":"Saezio","date":"2019-11-14T08:09:33.091+0000","up_votes":5,"down_votes":18,"body":"Are you complaining about jungle or mid? \n\nNeither has had 53% winrate in any of the last patches btw. (plat+ stats)\n\nMost it was like 52,5% in jg. Mid is balanced, 51% winrate or so. There are a lot worse champs","replies":[{"poster":"Divin1ty","date":"2019-11-14T09:15:32.148+0000","up_votes":16,"down_votes":3,"body":"> [{quoted}](name=Saezio,realm=EUNE,application-id=3ErqAdtq,discussion-id=aEkdhdVe,comment-id=0002,timestamp=2019-11-14T08:09:33.091+0000)\n>\n> Are you complaining about jungle or mid? \n> \n> Neither has had 53% winrate in any of the last patches btw. (plat+ stats)\n> \n> Most it was like 52,5% in jg. Mid is balanced, 51% winrate or so. There are a lot worse champs\n\nEverything above 50-51% is in fact not fine, especially with a high Playrate on a a champ that  should be difficult.","replies":[{"poster":"Handy Sandy ","date":"2019-11-14T13:03:10.594+0000","up_votes":3,"down_votes":0,"body":"what's supposed to be difficult about ekko","replies":[{"poster":"WTBeGirl100EUhr","date":"2019-11-14T16:58:10.166+0000","up_votes":1,"down_votes":0,"body":"Positioning the W, mostly. Going for the stun is often a bait. Not saying you can't ever go for the stun (or that people will walk into where you put the W by complete coincidence) but it's primarily a zoning tool and a shield on a delay that requires you to have some foresight as to when you'll be taking damage and where your target will be walking. It's less about mechanical complexity as it is cerebral. He also has an EQ animation cancel that I rarely see Ekkos use that can be a little awkward to learn but isn't difficult to reproduce once you have it down.\n\nHis clear is less straight-forward than most and requires kiting to be done healthily something that most junglers are incapable of doing - especially on melees. \n\nHell, Qiyana has an awful solo-queue winrate in the jungle JUST because her clear is bad if not done properly and most people don't do it properly.","replies":[]}]}]}]},{"poster":"preternatural","date":"2019-11-14T11:42:29.634+0000","up_votes":7,"down_votes":2,"body":"also just to justify this thread.\nekko's W\nthis ability was not supposed to be tinkered with at all.\nrito increased the stun duration on successful W's and that obviously made ekko much more reliable and safe.\n\nyou want to engage on ekko? don't worry he'll walk away from you with his passive in tow while hard stunning you through your merc treads (rofl waste of gold if i have a even half decent adc on the team), so now the champion is more safe.\nhis entire combo can be muddled (yes) through during the stun duration, where as before you had to actually fast hit his dmg combo to trade properly, ergo the champion is now more reliable too.\nthis is before we get to interactions with zhonya's and protobelt and his R on his W.\n\nalso\njust for shits and giggles, he was given a flat dmg buff on his E, his most reliable source of combat dmg because it's point and click.\nanother reliability buff.\nif he needed the dmg (didn't imo) it could have been placed on his q or his passive (3-hit) or heck the ultimate if we must.\nbut nah it's on the E so anyone can do it.\nand so some of his matchup dynamics have now changed because he out utlities some or has just about more dmg come lvl 12/13 with his ult cdr buff too.\n\nso yeah. :/\nhe gets banned a lot now, was getting banned before teh bans but more sparingly lol.","replies":[{"poster":"HungryAngry2SPP","date":"2019-11-15T00:58:25.479+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=preternatural,realm=EUW,application-id=3ErqAdtq,discussion-id=aEkdhdVe,comment-id=000b,timestamp=2019-11-14T11:42:29.634+0000)\n>\n> just for shits and giggles, he was given a flat dmg buff on his E, his most reliable source of combat dmg because it's point and click.\n> another reliability buff.\n\n10 dmg btw \n\n> if he needed the dmg (didn't imo) it could have been placed on his q ~~or his passive (3-hit) or heck the ultimate if we must.~~ \n\nIf you even thought about buffing Ekko's Q, it means you don't even know how we works (mid).","replies":[{"poster":"preternatural","date":"2019-11-15T02:34:33.399+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HungryAngry2SPP,realm=EUNE,application-id=3ErqAdtq,discussion-id=aEkdhdVe,comment-id=000b0000,timestamp=2019-11-15T00:58:25.479+0000)\n>\n> 10 dmg btw \n> \n> If you even thought about buffing Ekko's Q, it means you don't even know how we works (mid).\n\nyeah 10 more reliable damages. \nyou get off 2 e's in a kill combo and that's a kill secured that is no longer gated by enemy regen. \n\nalso they don't give his q more damage because that would make his jungle clear too fast and healthy. \nwhat he does in a lane with q is irrelevant cause he does that anyway when not interacting with champions, so no that's not why they don't put dmg on his q.\nthat aside he didn't need the damage anyway but it's easier to ignore that bit than address it.","replies":[]}]}]},{"poster":"Daddy Ants","date":"2019-11-14T11:11:06.650+0000","up_votes":5,"down_votes":1,"body":"Revert the Ultimate cooldown buff and hit his W stun duration.","replies":[]},{"poster":"ÈvilMorty","date":"2019-11-15T02:39:08.895+0000","up_votes":2,"down_votes":0,"body":"Give opponents a window of time to cc him to cancel his ult","replies":[]},{"poster":"Makarakarn","date":"2019-11-15T02:27:13.403+0000","up_votes":2,"down_votes":0,"body":"All I have a problem with is his ult. Sure the damage part can be avoided easily (but if it does hit oh fucking god), but the amount of safety it allows is so annoying.","replies":[]},{"poster":"Ahri Body Pillow","date":"2019-11-15T02:11:31.630+0000","up_votes":2,"down_votes":0,"body":"Why not just remove his passive double damage to monsters? That will automatically take him out of the jungle.\n\nKeep it for epic monsters, though.","replies":[]},{"poster":"KnightLakega","date":"2019-11-15T02:08:00.478+0000","up_votes":2,"down_votes":0,"body":"Everything you said is spot on, but you made one error in your analysis. \n\nYou forgot to factor in Riot.. They don't care about balance.. They only care about keeping things \"different\" and the pro scene. Balance is the last thing they think about or care about.","replies":[]},{"poster":"Buck Strickland","date":"2019-11-14T23:33:59.433+0000","up_votes":2,"down_votes":0,"body":"When you see him on the enemy team it's an instant eye roll because of how frustrating it's going to be. Dude is way overtuned and has too many lives.","replies":[]},{"poster":"LightswornLance","date":"2019-11-14T16:41:20.239+0000","up_votes":2,"down_votes":0,"body":"What is with riot giving champions with already insane mobility, super high movement speed buffs to go with them. Mostly talking about akali and ekko.","replies":[]},{"poster":"BrokenRayquaza","date":"2019-11-14T11:49:14.124+0000","up_votes":3,"down_votes":1,"body":"Yeah ekko has always been able to do this but he does it waaaay too well rn","replies":[]},{"poster":"Rαy","date":"2019-11-14T10:12:05.097+0000","up_votes":3,"down_votes":1,"body":"Just revert one of those unnecessary buffs?! He was fine before.","replies":[]},{"poster":"l Ryden l","date":"2019-11-14T16:52:03.479+0000","up_votes":2,"down_votes":1,"body":"Sure lets just nerf a champ who's doing fine now and hasn't been relevant at all since SKT T1 won Worlds 2016.","replies":[]},{"poster":"only luciano","date":"2019-11-15T07:03:01.137+0000","up_votes":1,"down_votes":0,"body":"Why does an assassin have a 2.25 stun, slow,  and shield all in one ability?\n\nAlso it comes with percent health missing damage as well.","replies":[{"poster":"Hvsao","date":"2019-11-15T17:54:29.481+0000","up_votes":1,"down_votes":0,"body":"Its incredibly easy to dodge?","replies":[]}]},{"poster":"Grunt666","date":"2019-11-14T23:12:02.600+0000","up_votes":1,"down_votes":0,"body":"It’s really simple the problem is he gets way too much damage from the basic qwe so he never needs to use his ultimate to kill people. Transfer or remove dmg froM qwe so he he wants to 100-0 people he needs to land his ult damage. \n\nHe really is one of the most brain dead champs atm same thing over and over all in with qwe and either get kills or don’t and r to safety rinse repeat. The sad part is that qwe usually does enough damage to kill people it’s the joke this game has become.","replies":[{"poster":"rosès","date":"2019-11-15T17:42:36.418+0000","up_votes":1,"down_votes":0,"body":"If you couldn't kill people without your ultimate,you would be useless since that is impossible to hit,boards are such a joke lol\nthe buffs he received were pretty much meaningless since if you hit your w when it was 1.75 when ganking a lane it was a kill anyway,but because of them people started to play him and realise that ekko its pretty good","replies":[]}]},{"poster":"Wild Geese","date":"2019-11-15T17:00:50.422+0000","up_votes":1,"down_votes":0,"body":"The 2.25 second stun is what's way too much, that thing stuns in an AOE longer than most ultimates.\n\nYeh it's kinda hard to hit, but in teamfights it's really a lot easier, especially in objectives and choke-points like in Baron fights. It's just way too game winning for a normal ability (attached to a pretty good assassin with excellent survival).","replies":[]},{"poster":"Freeza with an I","date":"2019-11-15T06:51:54.533+0000","up_votes":1,"down_votes":0,"body":"I hope he gets nerfed soon, just went against one who tower-dived me (a tank) and took 5 tower shots and got out with full HP due to his overtuned ult.","replies":[]},{"poster":"Monstermushmush","date":"2019-11-15T03:14:01.639+0000","up_votes":1,"down_votes":0,"body":"I'm an Ekko main. I agree. I'd like his play and ban rate to go down anyways.","replies":[]},{"poster":"Crescent Dusk","date":"2019-11-15T01:03:32.379+0000","up_votes":1,"down_votes":0,"body":"How many assassins besides Qiyana did we see at world's or LCS? Right, none.\n\nMid lane is such a joke that bringing Tristana is an even betetr option, a fucking ADC.","replies":[]},{"poster":"Jennifer17","date":"2019-11-15T01:01:49.454+0000","up_votes":1,"down_votes":0,"body":"you want an assassin to be less safe and reliabil what are you crazy?","replies":[]},{"poster":"Sylaelque","date":"2019-11-14T22:57:12.383+0000","up_votes":1,"down_votes":0,"body":"AP scaling champions mostly like that not just Ekko. {{champion:8}} {{champion:105}} {{champion:35}} ","replies":[]},{"poster":"ESeTyRC","date":"2019-11-14T22:03:21.187+0000","up_votes":1,"down_votes":0,"body":"... Huh.\n\nDidn't realize he received buffs.\n\nThought I was just remembering his damage incorrectly.","replies":[]},{"poster":"VelvetCrotch","date":"2019-11-14T19:36:06.443+0000","up_votes":1,"down_votes":0,"body":"I dont know why this isn't pointed out already. I mean at release ekko's ult was just broken. and he is still kinda unbalanced especially regarding his passiv. He is too mobile and burst far too hard for a champ who has a out-of-jail-free-card with his ult and aoe cc (which is hard to pull of but can be a massive zoning tool and teamfight changer)","replies":[]},{"poster":"miightofdemacia","date":"2019-11-14T18:13:26.102+0000","up_votes":1,"down_votes":0,"body":"What I've always disliked about ekko's ult was how it healed him. If you look at the little cinematic that they made around the time or just before they released ekko, he had a time reversal where he retained any memories he obtained while everyone else gets rewinded. But ekko ALSO retains damage sustained. If you watch, he got hit hard and rewind time but was still hurting in the cinematic. But yet, in game, when he rewinds, it heals him. Not by a little, it's a lot.\n\nI know cinematic shouldn't be everything, but if his ult was to stay true to the cinematic then he shouldn't be healing so much after ulting if at all. It should just be a reposition tool and/or nuke. Not both of those things combined with a giant heal. I'd be happy if his heal is just nerfed to the ground or removed from his ult. Again, in the cinematic, he still was suffering from damage he took even after rewinding time. In game, he is like, oh hey i healed like nothing ever happened.\n\nBut I don't really mind ekko's get out of jail card as much as the newer and updated champs with bs get out of jail free cards. Look at akali, pyke, senna. All given easy to use escape/disengage tools. If they mess up, welp easy escape button.","replies":[]}]}