{"poster":"Perseverans","date":"2015-03-05T22:16:57.933+0000","title":"Streaming Giocatori","subforum":"Esport","up_votes":1,"down_votes":0,"body":"Scusate, solo oggi ho letto del caso SpectateFaker, avendo letto solo il riassunto rilasciato dalla riot probabilmente mi mancheranno delle parti, in partiolare lagali, che magari hanno omesso per correttezza o per necessità di non divulgazione, ciò non di meno non è la prima volta che vedo che ci sono problemi a livello di Esport, la \"mafia\" dietro ai team è un spettro che ormai è arrivato e mai se ne andrà. Detto questo mentre leggevo la situzione sopra citata di SpectateFaker mi ha colpito la parte sulla questione che Faker avrebbe ceduto le sue prestazioni in esclusiva ad Azubu (spero di averlo scritto bene), mentre LordStarLucian le trasmetteva in modalità spettatore su Twitch, portando via ovviamente utenza ad Azubu e allo strem di Faker. Superato il casino e la foga del momento la citica LordStrLucian mi pare più che sensata quando afferma che avend acettato le condizioni di utilizzo Faker non possa dire niente a nessuno su chi faccia vedere cosa e quando delle sue partite, mentre voi invece potete, essendo \"vostro\" l'account di gioco. La mia idea è quindi semplice, da ora in poi, essendo voi i possessori degli account, a chiunque voglia essere tutelato in queto genere di casi, proponete un contratto tripartito, un format, in cui un dato sponsor o che so io che contatti un certo pro player per quanto il concerne il suo streaming debba redigere un contratto che oltre al giocatore, fruitore dell'account e delle prestazioni, debba contattare anche voi, possessori dell'account, e che debba essere firmato da tutte e tre le parti. Questo sistema presenta più aspetti positivi:\r\n1) Vi porterà altri soldi\r\n2) Data la presenza di questo contratto chi non debba averlo redatto con  voi ma solo con lo sponsor per non dividerne i \"ricavi\" se dovesse avere un problema simile dovrà solo mangiarsi le mani per non averlo firmato e firmarlo in seguito, insomma va bene la protezione dei player ma se non ci pensano affari loro\r\n3) In questo modo avrete il controllo, il diritto e il dovere (e la libertà) di controllare gli streaming dei pro players che vogliano streammare sotto contratto.\r\n\r\nOvviamentr questa è un'idea generale, non essendo io un esperto di legge o quant'altro, ma finchè non vi metterete in prima persona a garanzia, a fianco dei giocatori, avrete sempre di sti problemi, quasi insolubili, dato che la vostra soluzione non è una vera soluzione, non basandosi su nessuna regola accettata o redatta, è solo una consuetudine che volete immettere da questo caso sottolineando che per voi sono più importanti i player con un peso economico legale all'interno di lol rispetto a chi invece non lo ha, mi spiace dirvelo ma traspare questo dalla vostra \"soluzione\".\r\nRipeto, questa è un'idea più o meno campata così, ma mi pare darebbe più garanzie a tutti, dato che tutti i soggetti verrebbero compresi nel contratto.","replies":[{"poster":"Perseverans","date":"2015-03-07T10:42:23.064+0000","up_votes":1,"down_votes":0,"body":"infatti la questione non è obbligarli, ma proporgli questa possibilità, chi vuole garanzie si rivolge alla riot per questo tipo di cose","replies":[]},{"poster":"Jay Kenton","date":"2015-03-06T22:49:08.465+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/it/c/esport-it/KMYqXZcZ-lol-memorabilia-faker-e-la-dmca\n\nLa Riot non può obbligare nessuno a fare ciò che proponi, piuttosto quello a cui lentamente si sta arrivando è un sindacato dei giocatori professionisti.","replies":[]},{"poster":"Majin Kayn","date":"2015-03-06T00:57:46.143+0000","up_votes":1,"down_votes":0,"body":"Amen","replies":[]}]}