{"poster":"Plectrums","date":"2016-09-24T16:36:30.165+0000","title":"Any other absolute noobs want to join up for some low-pressure games?","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"I&#039;m a noob, about level 16 I think, and more to the point I&#039;m an old man in video game terms (35) so I have no hope or aspiration of competing with today&#039;s uber-serious ultra-skilled teenagers. I am greatly enjoying this game though, so I&#039;d maybe be interested in playing some more co-ordinated games with mature people who are capable of acting like decent human beings, and who also don&#039;t imagine themselves to be playing at pro-level (seriously, everyone who plays this game seems to think their rightful place is competing in the world championships. And winning.)\r\n\r\nI don&#039;t know how these things are usually organised, so just post here if you&#039;d be interested I guess. And, I cannot stress this enough, if you care much about winning I don&#039;t think I have much to offer you.","replies":[{"poster":"CLG HotshotGG","date":"2016-09-27T10:52:00.986+0000","up_votes":1,"down_votes":0,"body":"Hey man. I can play normals with you, can teach you how to play champions if you want. I'm playing since season 2. Now I'm a Diamond 3. Add me in the game and we can talk more. \nIGN: CLG HotshotGG","replies":[{"poster":"Plectrums","date":"2016-09-28T13:33:52.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CLG HotshotGG,realm=OCE,application-id=mR0UmRrp,discussion-id=cBBg9Z84,comment-id=0005,timestamp=2016-09-27T10:52:00.986+0000)\n>\n> Hey man. I can play normals with you, can teach you how to play champions if you want. I&#x27;m playing since season 2. Now I&#x27;m a Diamond 3. Add me in the game and we can talk more. \n> IGN: CLG HotshotGG\n\nThanks, much appreciated :) That said, I'm really not looking to be taught anything. I truly am just looking for low pressure fun, and if I'm being taught, it follows that I may fail to learn, and that alone is more pressure than I want :P And I am learning, but at my own pace, which is a pace that I suspect would frustrate any teacher.\n\nThanks again, though :)","replies":[]}]},{"poster":"Sloth Almighty","date":"2016-09-27T10:31:29.795+0000","up_votes":1,"down_votes":0,"body":"I'm about as cruisy as it gets in game, always happy to add someone new. I'm more likely to laugh at a stupid mistake, then flame anyone for it. That's what games are for right, the entertainment factor?\n\nAnd possibly likely to vote Yes on surrender seconds before we destroy their Nexus and win... just for shits and giggles xD\n\nAlso, i'm 32 and I certainly don't think we are the 'old men' of video games. We are the veterans, our generation has grown with the progression of games themselves. We are the seasoned vets ;)","replies":[]},{"poster":"KillMaimDestroy","date":"2016-09-26T10:04:02.053+0000","up_votes":1,"down_votes":0,"body":"Heya,\n\nI would absolutely love some mature active people to play with I'm 29, been playing for a long while now still in bronze.\n\nIt takes alot for me to flame and would love to play with some level headed people.","replies":[]},{"poster":"MrFahrenheit7","date":"2016-09-26T08:44:49.323+0000","up_votes":1,"down_votes":0,"body":"Hey mate, I'm relatively old by video game standards as well. Currently S3 on my main, but my smurf is level 12 and I'm keen on levelling it up. Add me if you want to play","replies":[]},{"poster":"Essembie","date":"2016-09-24T22:01:33.779+0000","up_votes":1,"down_votes":0,"body":"Im an old man too. I prefer \"pioneer\" or \" foundation member\".","replies":[]},{"poster":"Łæoña","date":"2016-09-24T21:59:02.708+0000","up_votes":1,"down_votes":0,"body":"Yeah sure, well Im literally done with climbing since I can't get anywhere. So if u want to mess around with some oddly champions in not their usual lanes then hit me up","replies":[]}]}