{"poster":"Queen Ivy","date":"2017-03-21T11:14:12.574+0000","title":"DuoQ Partner gesucht (Gold)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi ihr Lieben,\r\n\r\nIch suche einen ADC oder JUNGLER als mate.\r\n\r\nZu mir:\r\nHei&szlig;e Sandra, letze season g4 diese *noch* g5\r\nHab meistens ab 19/19:30 zeit.\r\nKann jegliche art an Support spielen aber das ist auch nicht all zu schwer.\r\nIch habe auch kein Problem die Champions zu w&auml;hlen die von mir verlangt werden zudem reagiere ich z&uuml;gig auf Calls\r\n\r\nZu dir an ADC:\r\n{{champion:236}} {{champion:21}} {{champion:110}} {{champion:29}} {{champion:67}} JHIN \r\n\r\nZu dir an Jungler:\r\n{{champion:29}} {{champion:113}} {{champion:64}} {{champion:104}} {{champion:427}} \r\n\r\nDer durchschnitt im Alter w&auml;re super wenn er 23-30 w&auml;re.\r\nSolltet auch im gold+ bereich sein, dr&uuml;ber ist noch ok aber nicht darunter.\r\n\r\nFreue mich &uuml;ber kurze PN unter dem Text und nicht einfach adden vielen Dank :){{sticker:slayer-jinx-catface}}","replies":[{"poster":"I love you Malon","date":"2017-03-21T11:21:21.151+0000","up_votes":2,"down_votes":0,"body":"Sonst noch Wünsche? xD","replies":[{"poster":"Queen Ivy","date":"2017-03-21T12:02:58.058+0000","up_votes":1,"down_votes":0,"body":"wenn das nicht deinen Ansprüchen entspricht dann ignoriere mein  Post doch einfach :)","replies":[]}]},{"poster":"Ceburrashka","date":"2017-03-21T14:17:21.899+0000","up_votes":1,"down_votes":0,"body":"Hey, das trifft sich relativ gut, habe mir auch gerade gedacht, ich könnte mich mal nach nem duo partner umschauen, am besten support ;)\nDaher eigentlich perfekt. Ich bin Jungle main, spiele zurzeit viel Graves, bin aber auch relativ flexibel. Wenn wir irgendeine gute Kombo finden würden, wäre ich auch gerne bereit, wen anders zu üben.\nKann gleich ehrlich sagen, meine Match-History aktuell ist leider kompletter Horror, bin nur am verlieren, muss da noch bisschen analysieren und meine Fehler finden, eventuell wäre das mit einer externen Meinung sogar besser. Jedenfalls bin ich trotzdem sehr zuversichtlich, dass wir zusammen gut climben können werden, ich bin ruhig, habe relativ angemessenes Spielverständnins und war letzte Season Platin 4 als Jungler. Zurzeit bin ich Gold 5...\nWenn du Interesse hast, etwas zu quatschen, kannst mich gerne ingame adden.","replies":[]},{"poster":"Eighty Carry","date":"2017-03-21T12:39:45.073+0000","up_votes":1,"down_votes":0,"body":"Heyho,\n\neventuell wäre unsere Community etwas für dich. Wir bieten Coaching, Teambetreuung sowie Turniere an. Aktuell sind wir um die 130+ aktive Mitglieder & sind in allen Elo's von Unranked-Master vertreten. Bei uns findet immer jeder jemanden zum Spielen sei es für Normals, Rankeds oder auch Customs. Gerne laden wir Dich zu einem Gespräch auf dem Teamspeak ein.\n\nUnser Post im League of Legends Forum: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/mr8iv0EJ-a-rift-guardians-sucht-mitglieder-teamerstellung-community-coaching-overwatch-a\n\nMit freundlichen Grüßen,\n\nRift Guardians","replies":[]}]}