{"poster":"kt Wingz","date":"2017-03-30T18:08:32.582+0000","title":"El tribunal tiene que volver ya !","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":10,"body":"No puede ser que pierda 2 partidas ganadas por que la gente se va afk sin razon miren mi historial son partidas que estaban ganadas\nEn la primera el Nasus se fue afk no se por que y terminamos perdiendo una partida que estaba terminada ya \nEn la sergunda con Warwick una Akali se fue afk sin decir nada y perdimos por ser 1 menos\nEl trubunal tiene que volver si o si por que este sistema no sirve directamente si no se reportan en grupos 3 o 4 reportes no cae una sancion no me caliento por haber perdido sino por que en vez de irse afk desde el minuto 1 se van afk a los 30","replies":[{"poster":"Hnk Kenshiro","date":"2017-03-30T18:29:11.812+0000","up_votes":6,"down_votes":0,"body":"Respóndeme ¿quisieras ser juzgado y sancionado por los mismos flamers/ afk que reportas?","replies":[]},{"poster":"Teemo Stahp Pls","date":"2017-03-30T18:35:33.643+0000","up_votes":4,"down_votes":0,"body":"Es gracioso por que LAS es una de las comunidades que mas bans pide y a la vez la que menos reporta","replies":[]},{"poster":"9081913DEL1","date":"2017-03-30T18:15:49.224+0000","up_votes":4,"down_votes":1,"body":"Irse afk, a veces es una caida de internet, un fallo de energia, se murio tu pc, paso algo en casa, hay miles de razones que terminan con un usuario afk. \n\nHay sanciones en el sistema actual y son correctamente impartidas.\n\nEntiendo tu frustracion por tus partidas recientes, pero sabes bien que cambiar el sistema de sanciones no tiene nada que ver con el estado de conexion de las personas, eso en la mayoria de los casos no esta al alcance de RIOT.\n\nSaludos y suerte en tus proximas partidas!","replies":[{"poster":"kt Wingz","date":"2017-03-30T18:23:14.441+0000","up_votes":1,"down_votes":4,"body":"Mi frustracion aumento ya que me relegaron por esas 2 partidas {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Charlôtte","date":"2017-03-30T18:17:54.175+0000","up_votes":1,"down_votes":0,"body":"Si lo reporta uno o lo reportan los nueve da igual, no lo van a banear por una partida que se fue AFK, por ahí no vuelve a hacerlo. En caso de que lo haga en varias partidas hay un sistema automático que lo pena sin reportes y, además, si lo reportan en esas varias partidas puede ser penalizado como cualquier otra persona por la razón que sea.","replies":[]},{"poster":"Feebo","date":"2017-03-30T18:29:30.123+0000","up_votes":2,"down_votes":2,"body":"si... este foro da lo mismo pongan (comportamiento del jugador) si riot no hace nada al contrario... le hacemos todo mas facil, le damos los nick de estas personas sacamos fotos, pantallazos y ene pruebas PERO!!!! riot dice, nooooo!!!! queremos que nos cueste encontrar estas personas queremos que ( digan me robaron un minion me voy afk ) queremos que esto no sea disfrutar de la partida queremos que fedeen, flameen etc..  es mas facil asi!!!\n\nrescato del foro, esports","replies":[]}]}