{"poster":"Mergoo","date":"2015-06-20T20:44:27.151+0000","title":"Verbindungsaufbau","subforum":"Melde einen Bug","up_votes":1,"down_votes":2,"body":"Seit Freitag hab ich ein Problem. Wenn ich ingame bin kann ich mich nach einer Zeit nicht mehr bewegen und es kommt ein Fenster wo drauf steht &quot;Verbindungsaufbau&quot; obwohl mein Internet funktioniert kommt es st&auml;ndig. Ich hab schon alles versucht. Lol deinstalliert, beim Anbieter angerufen und Internet gecheckt, sogar meinen Pc habe ich formatiert. So langsam frustriert mich dies weil ich der einzige bin der dieses Problem hat. Wenn jemand weis warum dies st&auml;ndig passiert soll er mir bitte dies sagen damit ich ein bisschen beruhigt bin.","replies":[{"poster":"Bookey","date":"2015-06-20T22:55:11.998+0000","up_votes":1,"down_votes":0,"body":"Wenn du das Forum durchschauen würdest, würdest du bemerken, dass du leider nicht der einzige bist. \n\nIch zum Beispiel habe im Moment auch das selbe Problem. Bei mir führt das ganze dann aber noch so weit dass ich nach ner Zeit komplett aus dem Game raus bin und danach nicht wieder reconnecten kann. Am Internet wirds nicht liegen, da mein Skype sonst dabei abschmieren würde. \nWas mir jedoch aufgefallen ist, ist dass viele die diesen \"Bug\" im Moment haben, bei Kabel Deutschland sind. \n\nSchlimm finde ich nur, dass Rito sich dazu nicht äußert.","replies":[{"poster":"GummibaumXYZ","date":"2015-06-21T06:48:15.632+0000","up_votes":1,"down_votes":0,"body":"Warum findest du es schlimm, wenn Riot sich nicht äußert?\nGanz eindeutig, scheint das Problem ja bei Kabel Deutschland, bzw. deren Verbindung zu den Riot Servern zu liegen.\nWarum findest du es nicht schlimm, dass die sich äußern?\n\nHast du in deren Forum auch gepostet und nachgefragt, was los ist?","replies":[{"poster":"Bookey","date":"2015-06-25T16:29:21.483+0000","up_votes":1,"down_votes":0,"body":"Haha. Hast du schonmal beim Kundendienst von Kabel Deutschland angerufen? :D \nAls ob die da jemals irgendwen haben, der sich zu irgendwas äußern könnte. :D\n\nGibt halt genug Leute die den Support angeschrieben haben.. mehrmals. \nund jedes Mal nur die übliche vorgefertigte Antwort zurück kam.","replies":[]}]},{"poster":"Mergoo","date":"2015-06-21T06:40:10.291+0000","up_votes":1,"down_votes":0,"body":"Ohje bin auch bei Kabel Deutschland...","replies":[]}]}]}