{"poster":"Rito Vash","date":"2016-09-18T01:11:16.151+0000","title":"Asking Too Much","subforum":"Client Discussion","up_votes":8,"down_votes":0,"body":"Prob too much, idk, I believe in riot, You should make it so our profile is most freq played champ **+**  **most used _skin_** for the most frequently played champ","replies":[{"poster":"Riot a huevo","date":"2016-09-19T16:57:10.212+0000","up_votes":5,"down_votes":0,"body":"We've had a lot of people have many different opinions on what the profile screen should show. I don't know what are future plans for it. Thanks for your suggestion!","replies":[{"poster":"Control Ward","date":"2016-09-21T21:53:35.014+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot a huevo,realm=NA,application-id=2E4zVIwd,discussion-id=sIOXkmbj,comment-id=0001,timestamp=2016-09-19T16:57:10.212+0000)\n>\n> We&#x27;ve had a lot of people have many different opinions on what the profile screen should show. I don&#x27;t know what are future plans for it. Thanks for your suggestion!\n\n@Riot A Huevo What do you think of letting the player choose their profile background from a selection, on any mastery (3,4 or 5) or high champions? So that players cant just choose any champion that they don't per say play but also have the ability to pick and choose what they would like to show? What do you think about this?","replies":[{"poster":"Riot a huevo","date":"2016-09-23T16:45:08.751+0000","up_votes":3,"down_votes":0,"body":"Sounds reasonable to be able to configure it, some argue that the profile screen should directly reflect what your main champ is, a result of your play style. I agree with the former. I don't decide on it though. Also, whatever we have right now, can be changed later. It is interesting to see how many opinions there are about this.","replies":[{"poster":"Gr8stFlameOnRift","date":"2016-11-07T10:45:03.157+0000","up_votes":1,"down_votes":0,"body":"I think let the players configure it could be the best option, would be nice to see my Neon Strike Vi as the background of my profile even if I'm not playing her a lot cause I wanna test other champs.  But I have to say that's kinda complicated to do on an online game, too many information to save and store. Showing the most used champion in recent games is probably the safer choise for a lighter client","replies":[]}]}]}]},{"poster":"Fisherman Fízz","date":"2016-09-19T04:04:41.899+0000","up_votes":1,"down_votes":0,"body":"yep yep I agree on this 100%\n\n{{champion:105}}","replies":[{"poster":"The Blue Rajah","date":"2016-09-23T18:53:44.168+0000","up_votes":2,"down_votes":0,"body":"Why'd you put Wukong at the bottom of your post?","replies":[]}]}]}