{"poster":"EzraTwitch","date":"2015-02-14T20:21:57.578+0000","title":"Mordakaiser changes are Massive Across the Board Nerfs [IN DEPTH MATH]","subforum":"Gameplay","up_votes":19,"down_votes":5,"body":"As someone who loves Mordekaiser, always built him tanky, had great success with him, never built DFG on him. . .These changes disgust me.  Level by Level Comparison of New (PBE) vs. Old Mordekaiser.  If Riot is going to insist on going this direction they need to make some serious number adjustments unless they are trying to give him a raw numbers nerf across the board.  Personally as a dedicated Morde Player I would like Riot to scrap this until they have more time to think on it, but we all know their record when it comes to listening to the community.\n\nFor comparison I will be running both builds with 21/9/0 Runes (Which include all health increasing mastery's, so the \"New Improved\" Mord will still be fully benefiting from all of his health scaling.  Runes will be Magic Penetration Red, Armor Yellow, Move Speed Quints, Magic Resist Glyphs (None of these effect the scaling for easier math, however is still a good Morde page for both new and old).\n\nLevel 1 Comparison.  Starting a Dorans Shield and 1 Rank E. (Math from Mastery Tree included).\n\n**Old Mord** E Damage (8 Ability Power, 691 Health ): 75 Damage, Generates 26 Shield per Champion Hit, and 13 Shield per Minion Hit.\n*New Mord* E Damage (8 Ability Power, 691 Health):  74 Damage, Generates 27 Shield per Champion Hit, and  8 Shield per Minion Hit.\n***NET Change:  -1 Damage, +1 Shield per Chamion Hit, -5 Shield Per Minion Hit***\n\nAssuming that as part of his Harassment Pattern Mordakaiser casts E on 1 Enemy Champion and 3 Enemy Minions at Level 1.\n**Old Mord** Deals 75 Damage and Generates 65 Shield.\n*New Mord* Deals 74 Damage and Generates 51 Shield.\n***NET Change: -1 Damage, and -14 Shield.***\n\nLEVEL 3\nLevel 3 Comparison.  Dorans Shield, Rank 1 Q/W/E (Math from Mastery Tree and Level Included:  (10 Ability Power, 730 Health Total)\n**Old Mord**E Damage: 75 Damage, Generates 26 Shield per Champion Hit, and 13 Shield per Minion Hit.\n*New Mord* E Damage: 74 Damage, Generates 29, Shield per Champion Hit, and 13 Shield per Minion Hit.\n***Net Chang -1 Damage, +3 Shield per Champion Hit, +/- 0 Shield per Minion Hit.***\n\n**Old Mord** W Damage: 26 Damage per Second, Generates 8 Shield per Champion Hit, and 4 Shield per Minion Hit (Per Second)\n*New Mord* W Damage:  25 Damage per Second, Generates 7 Shield per Champion Hit, and 2 Shield per Minion Hit (Per Second).\n***Net Change: -1 Damage per Second, -1 Shield per Champion Hit Per Second, -2 Shield per Minion Hit***\n\n**Old Mord** Q Damage: 84 Damage, Generates 29 Shield per Champion Hit and 14 Shield per Minion Hit OR 138 Damage and Generates 48 Shield verse a Single Champion.\n*New Mord* Q Damage: 83 Damage, Generates 29 Shield per Champion hit and Generates 8 Shield per Minion Hit OR 136 Damage and Generate 29 Shield verse a single Champion.\n***Net Change: -1 Damage +/- 0 Shield per Champion, -6 Shield per minion OR -2 Damage -19 Shield verse a single Champion.***\n\n\nLEVEL 5 with Hexatech Revolver and Dorans Shield; 3 Ranks E, 1 Rank Q, 1 Rank R. (50 Ability Power, 823 Hit Points)\n\n**Old Mord** E: 190 Damage, 66 Shield per Champion, 33 Shield per Minion.\n*New Mord* E: 185 Damage, 32 Shield per Champion,  10 Shield per Minion.\n\n**Old Mord** W (Per Second): 34 Damage, 10 Shield per Champion, 5 Shield per Minion.\n*New Mord* W (Per Second):  31 Damage, 8 Shield per Champion,  2 Shield per Minion.\n\n**Old Mord** Q Damage: 100 Damage, 35 Shield per Champion, 17 Shield Per Minion or 165 Damage and 70 Shield versus 1 Champion.\n**New Mord** Q Damage:  95 Damage, 32 Shield Per Champion, 9 Shield Per Minion, or 156 Damage and  32 Shield versus 1 Champion.\n\n***Net Change versus 1 Champion and 3 Minions: -52 Damage, -141 Shield Generated.***\n***Net Change versus 1 Champion: -17 Damage, -40 Shield Generated.  Net Loss Across the Board.***\n\n\n**Clearly after eviscerating his early game these changes are meant to help his late game.  Lets try the most popular Bruiser Mord Build.  Sorcs Boots, Sunfire, Abyssal, Ryligh, Liandries, WoTa.  Level 18.\nTotal Health: 3101, Total Ability Power 320, Armor and Magic Resist with Creeping Death Active 181 Armor, 181 Magic resist. Seems like a respectable Bruiser Build, lets compare old and new scaling.**\n\n**Old Mord** E: 442 Damage, 154 Shield Generated per Champion Hit.\n**New Mord**E: 410 Damage, 124 Shield Generated per Champion Hit.\n\n**Old Mord** W:  144 Damage, 43 Shield Generated per Champion Hit.\n*New Mord* W: 128 Damage,  31 Shield Generated per Champion Hit.\n*New Mord* W (Assuming 2 Shields are Active and Striking same Enemy): 256 Damage, 62 Shield Generated. (Because Mord can now produce two shields, this has the potential to be buff  given certain assumptions on position).\n\n**Old Mord** Q: 328 Damage, 114 Shield per Champion hit, OR 541 Damage and 189 Shield versus a Single Champion.\n*New Mord*Q:  296 Damage,  124 Shield per Champion, or 488 Damage and 124 Shield versus a Single Champion.\n\n**Old Mord** R: 46% of Targets Max health as Magic Damage (Assuming 2000 - 3000 health enemy), Generates 322 - 483 Shield (NOT COUNTING SHIELD GAINED FROM GHOST ATTACKS).\n*New Mord* R: 46% of Targets Mas Health as Magic Damage (NO Initial Damage so NO initial Burst of Healing). Generates 310 Shield.\n\n***NET CHANGE in a Team Fight with 3 Champions assuming BOTH Mord and 1 Ally are hitting 3 enemies with his Creeping Death and Mord Ulted a 2000 Health Enemy (In other words I am making as many concessions towards the New Mords kit as possible).  +144 Damage, -81 Shield. (In other words even with me giving Every possible Situational Advantage too new Mordakaiser he still ends up Shielding less while only doing slighly more damage.)***\n\nNow lets see what the new Numbers are in a less than ideal situation for Mordekaiser 1v2 verse 2 other enemies of 2500 Health (Ulting one of them).\n\n***Net Damage Loss:  -160 Damage, Net Shield Loss -196 Shield.***\n\n\nAs you can see, these changes result in a Net Shield loss across the board, even with over 3000 health.  The one thing that is quite possibly better is his ghost AFTER he gets it out, but even this is a negative change.  Why? Because its completely counter to what Riot is trying to accomplish with these changes. Its simply gateing his power in such a way that he has no access to it with out the help of an Ally, since they have already eviscerated his already mediocre dueling potential.  On top of that compared to the old ghost the new ghost generates considerably less shield. Considering a halfway decent ghost on old Mord  (Yasou, Ash) produces around 130 Shield per auto attack and a higher AS then 1 a second, where as new Mord produces only around 62 Shield a second while his Ult is active (Assuming 3101 Health).  Even assuming that these changes weren't horrendous, what does Mordekaiser offer with out damage?  A Bruiser with 0 Damage, 0 CC, 0 Gap closers is completely ignorable and might as well not exist.  If you are insistent on changing his shield to Health Scaling additional drastic changes need to be made to the Champions Kit in order to prevent him from becoming utterly useless.  Right now hes just a Low Damage, Low Mobility Mundo with Less CC.\n\nI know Riot doesn't often listen to the community but please in this one case do what you have done a few times in the past and retract these horrible changes until you have a better idea of what you want this champions identity to be.  Just because you have the technology to scale things off of health instead of Damage doesn't necessarily mean you should.  By forcing Mordakaiser to stack obscene amounts of health to produce the same amount of shield you are forcing him to build into something that is easily ignorable and brings nothing to the table.\n\nAn disappointed Mordekaiser fan.","replies":[{"poster":"xLegendary Troll","date":"2015-02-14T20:42:49.988+0000","up_votes":8,"down_votes":1,"body":"{{champion:161}} Thank you for your...*contribution*. However, once something goes through PBE it's most likely going live.","replies":[{"poster":"EzraTwitch","date":"2015-02-14T20:51:08.280+0000","up_votes":3,"down_votes":2,"body":"They have not gone through changes a few times (Removal of ward Jumping, Lee Sin nerfs) Lets hope this is one more of those times.","replies":[{"poster":"xLegendary Troll","date":"2015-02-14T21:05:48.582+0000","up_votes":5,"down_votes":3,"body":"It's going to happen no matter what because deep down inside I also believe he should scale off max HP. Scaling off max HP makes {{item:3116}} viable on him, which indirectly or directly solves his CC problem.","replies":[{"poster":"Tengrichan","date":"2015-02-14T21:07:39.912+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xLegendary Troll,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=000000000000,timestamp=2015-02-14T21:05:48.582+0000)\n>\n> It's going to happen no matter what because deep down inside I also believe he should scale off max HP. Scaling off max HP makes {{item:3116}} via led on him, which indirectly or directly solves his CC problem.\n\nSo we are going to be forced from one item build into another.Brilliant.","replies":[{"poster":"xLegendary Troll","date":"2015-02-14T21:10:39.561+0000","up_votes":2,"down_votes":0,"body":"But at least he has CC and tankiness now. I never needed CC on Morde because I always relied on cooldown and spell vamp to sustain in team fights. I really wish they just made his Q root people or something and leave him alone.","replies":[]}]},{"poster":"ExiledTyrant","date":"2015-02-14T21:09:37.838+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xLegendary Troll,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=000000000000,timestamp=2015-02-14T21:05:48.582+0000)\n>\n> It's going to happen no matter what because deep down inside I also believe he should scale off max HP. Scaling off max HP makes {{item:3116}} viable on him, which indirectly or directly solves his CC problem.\n\nIt also let's his shield scale smoothly whether Morde is ahead or behind. It's a better lever to add to his kit than add more damage. If they need to increase his skills to 5% here or there it will be easier than giving him 100 more damage.","replies":[]}]},{"poster":"Ulquiorra995","date":"2015-02-14T23:35:37.956+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=EzraTwitch,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=00000000,timestamp=2015-02-14T20:51:08.280+0000)\n>\n> They have not gone through changes a few times (Removal of ward Jumping, Lee Sin nerfs) Lets hope this is one more of those times.\n\nWard jump removal actually went on live... until Lee players complained. Lee rework was on PBE... until Lee players complained? See a pattern on things which don't go to live?\n\nUnfortunately, being on PBE almost certainly means it's going on live.\nRiot never listened to Cass feedback.\nRiot never listened to Sona feedback.\nRiot never listened to new jungle feedback.\n\nNeed I continue?","replies":[]}]}]},{"poster":"Sailor Mint","date":"2015-02-14T21:18:23.852+0000","up_votes":5,"down_votes":1,"body":"You're failing to factor in enemy MR for shield generation, your live numbers are inflated by 15-30% in lane alone.\n\nOn the PBE, a 0MPen Morde will get 4% max health shields regardless of his target having 0 or 200MR. On live it's based on actual damage dealt.","replies":[{"poster":"ExiledTyrant","date":"2015-02-14T21:28:28.557+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Devi Freak Mint,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=0006,timestamp=2015-02-14T21:18:23.852+0000)\n>\n> You're failing to factor in enemy MR for shield generation, your live numbers are inflated by 15-30% in lane alone.\n> \n> On the PBE, a 0MPen Morde will get 4% max health shields regardless of his target having 0 or 200MR. On live it's based on actual damage dealt.\n\nThe more I went over the numbers the more wrong it looks. Halving the Q and W shielding amount on new Morde  and 0 resistance is skewing the numbers 2x or so  than what they should be in a lot of places.","replies":[{"poster":"EzraTwitch","date":"2015-02-15T09:45:05.454+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ExiledTyrant,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=00060000,timestamp=2015-02-14T21:28:28.557+0000)\n>\n> The more I went over the numbers the more wrong it looks. Halving the Q and W shielding amount on new Morde  and 0 resistance is skewing the numbers 2x or so  than what they should be in a lot of places.\n\nMR already doesn't effect his shield generation.  He generates shield based off Damage he deals, not what they take after mitigation.  Test it in a custom if you don't believe me.","replies":[{"poster":"ExiledTyrant","date":"2015-02-15T10:01:23.298+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=EzraTwitch,realm=NA,application-id=3ErqAdtq,discussion-id=NiFAc5aV,comment-id=000600000000,timestamp=2015-02-15T09:45:05.454+0000)\n>\n> MR already doesn't effect his shield generation.  He generates shield based off Damage he deals, not what they take after mitigation.  Test it in a custom if you don't believe me.\n\nI did and so far your wrong . i did it with a leona bot and just now a malphite bot both 32 mr  both gave me a 18 shield return alone on a 70 damage E no modifiers or penetration. 35%  of 70 is 24.5 so I should expect 24 or 25 shield what I got was 25% less (18) which is exactly what 32 Mr brings the damage around to.","replies":[]}]}]}]},{"poster":"TwoD","date":"2015-02-16T00:30:30.421+0000","up_votes":2,"down_votes":0,"body":"No it's not wtf are you on lmao","replies":[]},{"poster":"ExiledTyrant","date":"2015-02-14T21:04:47.800+0000","up_votes":2,"down_votes":0,"body":"Morde actually generates 8% not 4% shield on isolated targets so all of the Q assumptions are off skewing the net loss. The double damage and shielding potential of 2 creeping deaths not being considered also throws off the numbers even more. So a lot of the W and Q shield amounts should be doubled. \n\nThe general trend with resist taken into account is that Morde will generate more shield on those who build to actively counter him through MR and he will generate slightly less against people in the low MR range of 50 or under. By slight we are talking about 1-3 shield in the 50s and maybe 10-30 in the 30s or under. \n\nNew Morde also has no more in combat shield decay.","replies":[]},{"poster":"EfficientDynamo","date":"2015-02-14T20:51:35.615+0000","up_votes":3,"down_votes":1,"body":"Thank you so much for doing the math on this. I don't think anyone is happy with the proposed changes to Morde, although there is the hope that they want to change their old process of releasing an OP change and then nerfing them down. Have you had the time to look at his damage/shield output over a 5-10 second fight? Maybe the decreased cooldowns/health costs would allow him to cast Q an extra time or something.\n\nEither way these changes are not horrible nerfs, but are nerfs against a champion that was already underplayed and needed some buffs to his kit.","replies":[]},{"poster":"Arcane Azmadi","date":"2015-02-16T00:47:09.071+0000","up_votes":2,"down_votes":1,"body":"You didn't need fancy mathematics to know these changes were nerfs. When a champion as outdated as Mordekaiser is practically useless except when played in a single, very narrow and specific way, nerfing that single viable way because you don't like it and giving him some random buffs that do NOTHING to address the issues that make him useless to begin with is nothing but kicking a cripple.\n\nMorde needs a total remake. Riot don't care enough about him to give him one, so they nerf him into COMPLETE uselessness just to give the illusion that they're doing something about him. I think they just don't have a clue.","replies":[]},{"poster":"Krully","date":"2015-02-14T21:09:02.250+0000","up_votes":2,"down_votes":1,"body":"they want to make him into a tank, but he has no CC.\n\nand tanks in this meta, especially top lanes, already have it hard.","replies":[]},{"poster":"Killstrado","date":"2015-02-14T20:56:51.744+0000","up_votes":2,"down_votes":1,"body":"now {{champion:82}}  will just hang out at the pub with {{champion:154}} and drink a few beers as they make fun of {{champion:6}} in the corner","replies":[]},{"poster":"Darth Pixy Misa","date":"2015-02-16T02:13:04.277+0000","up_votes":1,"down_votes":0,"body":"Considering the problems tanks are having, why doesnt Morde have damage reduction on his passive? For instance all damage absorbed by the shield is reduced by 20%, if damage exceeds the shield hp it does not transfer? \n\nSince they are changing his skills, with all this mobility around, why not give Morde a large slow at least?","replies":[]},{"poster":"ExiledTyrant","date":"2015-02-16T00:04:09.133+0000","up_votes":1,"down_votes":0,"body":"Here's a video I made showing a live custom match vs Leona Bot. I consistently gained 18 shield per E when i hit her alone instead of 24-25 shield which would be the expected value of a 70 damage E If 24-25% magic resist was not taken into account:\n\nhttp://youtu.be/SRZNL_rwkmM","replies":[{"poster":"Terff","date":"2015-02-16T00:45:38.855+0000","up_votes":1,"down_votes":0,"body":"The changes havent actually gone through yet, the text is changed but the abilities remain the same.","replies":[]}]},{"poster":"Jungle Lux God","date":"2015-02-15T16:21:04.232+0000","up_votes":1,"down_votes":1,"body":"I like that you took a mathematical approach to looking at Mordekaiser, but I think it is unfair to compare his current builds to his old ones, because new Mordekaiser is going to change up his build to account for these changes, because of how some items always considered a necessity may no longer be considered a requirement on Mordekaiser.\n\nHextech revolver/Will of the Ancients may no longer be mandatory on Mordekaiser because of how much lower his costs got. Mace of Spades got about halved at every rank, Siphon of Destruction got halved at later levels, and Creeping Death got a sizeable cost reduction. Because the reason you got Revolver/Wota was to counteract his health costs, and his health costs got lower, Mordekaiser may get a lot more power out of buying other items that still fill the bruiser playstyle. \n\nZhonya's I could definitely see being picked up on bruiser Mordekaiser as a somewhat more offensive replacement for Wota, while a lot of tank items could fill the same niche that Wota filled without sacrificing a lot of power from him.\n\nIn addition, Mordekaiser did get some cool changes that make him better without directly changing his damage, such as his shield not decaying while in combat, an auto attack range increase for his Q auto attack, cooldown reduction on his Q, and extra movement speed between himself and the target of his W while his W is active.\n\nI'm not saying that these changes are direct buffs or nerfs. I just feel that it is kind of unfair to compare current Mordekaiser to the new Mordekaiser when Morde players are going to have to change up their builds.","replies":[]},{"poster":"Tusutaki","date":"2015-02-14T20:58:27.051+0000","up_votes":1,"down_votes":1,"body":"Im interested as what you would say about my suggested Mord changes. If you support it, then spread it around. \n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/ip1yvMzu-mordekaiser-buffs\n\nHowever I do agree that this negatively impacts Mord more so than anything else. ","replies":[]}]}