{"poster":"Wuks","date":"2017-06-14T15:29:45.156+0000","title":"My First Thoughts on the New Honor System","subforum":"Player Behaviour","up_votes":9,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Jason","date":"2017-06-14T16:38:55.243+0000","up_votes":6,"down_votes":0,"body":"It's pretty darn cool, and there's already a noticable change in peoples attitudes for them skins.","replies":[]},{"poster":"Fitzky","date":"2017-06-15T03:56:26.485+0000","up_votes":1,"down_votes":7,"body":"There is no point hearing your opinion, of course you're gonna say \"It's freaking amazing\" when you're Riot's little handyman, otherwise you wouldn't be keeping your job.","replies":[{"poster":"Project Xayah","date":"2017-06-15T05:17:21.243+0000","up_votes":7,"down_votes":0,"body":"If that were true, then I think it would be safe to say I never would have had a shot at being a volunteer. I have, after all, butted heads with Riot quite hard on certain things, which did include some quite toxic comments coming from me. That, however, is in the past (I've not gotten over what happened, I've just decided that there's no point continuing to argue those points when all it will do is make me *that* frustrated) and I'm now more focused on trying to help the people who come to the boards seeking it.\n\nBeing part of the volunteer program doesn't mean you don't voice you opinion when it conflicts with Riot. If anything, it's a very good reason to do so. Volunteers aren't just around to help people when needed, we're representatives of the community and, as such, it can be said that it is a responsibility of us to speak up when we disagree with one of Riot's decisions (though, not in a toxic manner).","replies":[{"poster":"Fitzky","date":"2017-06-15T05:57:24.067+0000","up_votes":1,"down_votes":3,"body":"That's funny when Sesshomaru is the only volunteer I have seen who has ever conflicted with Riot (after getting the role) and has argued against Riot on the boards. The rest of you suck up to Riot like the majority of players are sucking up for honours because all they care about is the rewards and don't give two shits about how everyone else feels. You can see why Sesshomaru is the only volunteer I've been positive to, because without him the scales wouldn't be balanced, the boards would be filled with goody-two-shoes that say yes to everything Riot suggest and think everything in League is perfect. I'm not saying the boards needs assholes, the boards needs people who disagree with Riot and point out some of the ridiculous shit they come up with.","replies":[{"poster":"Project Xayah","date":"2017-06-15T08:23:44.701+0000","up_votes":4,"down_votes":0,"body":"As Seras pointed out, understanding the why and how of Riot's decisions (and, by extension, how in-game systems work) and being able to explain them objectively doesn't necessarily mean you agree with them. I can't speak for any of the other volunteers, but I try to avoid anything that I feel too strongly about (I mentioned the fact I butted heads with Riot a few times in the past, and it's those kinds of subjects I try to avoid).\n\nThat said, I honestly haven't seen that much recently that I've disagreed with. I can't say I keep up with every change (big or little), because that would be untrue, but from what I've seen about Riot's decision-making recently there's nothing that stands out to me as something I'd be opposed to. I have a very much \"love/hate relationship\" with Riot (and not to confuse the company with it's employees), so it's likely that I'll have a bit to say about any decisions I don't agree with, when I see them, that is.\n\nIf you want to see the times I *have* opposed Riot I can (try to) scrounge up the relevant threads/posts and you can see how I have been at times I've heavily opposed Riot. Keep in mind, though, I do try to be (significantly) less negative now (which is nothing to do with the volunteer program, that's just a decision I made the last time I \"returned\" to the boards).","replies":[]},{"poster":"Ninox","date":"2017-06-15T07:36:55.877+0000","up_votes":4,"down_votes":0,"body":"Just because I try to give context on decisions doesn't always mean I agree with said decisions. You're free to have whatever opinion you want of me, but I'd rather it be because of who am I not who you think I am. Just as I agree with you on somethings and disagree on others, the same goes for Riot. \n\nI like honour, I don't like punishment feedback. I think the system does pretty well with chat toxicity but could do better with the sneakier intent feeders. I try my best to respect and understand Riot's decision-making, I am after all a PB people and have to explain a lot of it, but that doesn't mean I agree with all of it or think they are perfect and can't do better.\n\nThat said, yes, I do generally agree with Riot's decisions, but sharing an opinion doesn't mean sucking up.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2017-06-15T05:26:01.082+0000","up_votes":3,"down_votes":0,"body":"Well said!","replies":[{"poster":"Talon12","date":"2017-06-15T08:57:33.376+0000","up_votes":1,"down_votes":3,"body":"That ego.","replies":[{"poster":"Lord Sesshomaru","date":"2017-06-15T09:51:24.753+0000","up_votes":2,"down_votes":0,"body":"You lost me?\n\nI see what Fitzky is saying, and can see why you could come to that conclusion. \nBut I think HeartVine had a good response. \nOne that is more or less what I believe as well.","replies":[{"poster":"Talon12","date":"2017-06-16T10:27:52.260+0000","up_votes":1,"down_votes":3,"body":"he complemented you and it went right top your head","replies":[{"poster":"Ninox","date":"2017-06-17T03:00:53.537+0000","up_votes":2,"down_votes":0,"body":"I'm pretty sure he was questioning your comment not Fitzky's","replies":[{"poster":"Talon12","date":"2017-06-17T03:56:55.403+0000","up_votes":1,"down_votes":2,"body":"yes. Fitzky essentially said that he is great, and that fed his ego some more. He said he got lost, so i put him back on the train tracks.","replies":[{"poster":"Project Xayah","date":"2017-06-17T04:29:56.363+0000","up_votes":3,"down_votes":0,"body":"How does that apply to Sessh responding with a \"Well said!\" to one of my posts that isn't even in the same chain as where Fitzky commended Sessh on speaking his mind about Riot's decisions?","replies":[]}]}]}]}]}]}]}]},{"poster":"Wuks","date":"2017-06-15T05:06:35.730+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=T8eq2lFQ,discussion-id=EB6s7f1Q,comment-id=0004,timestamp=2017-06-15T03:56:26.485+0000)\n>\n> There is no point hearing your opinion, of course you&#x27;re gonna say &quot;It&#x27;s freaking amazing&quot; when you&#x27;re Riot&#x27;s little handyman, otherwise you wouldn&#x27;t be keeping your job.\n\nThere is quite literally nothing holding me from offering my criticisms of this system or any other Riot initiatives. I'm a community volunteer who specialises in Help & Support inquiries and Player Behaviour, but beyond that, I'm a member of the community nonetheless. There is very little benefit in stifling discussion, whether that be criticism or praise.","replies":[]},{"poster":"Broken Scripts","date":"2017-06-15T09:19:17.025+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=T8eq2lFQ,discussion-id=EB6s7f1Q,comment-id=0004,timestamp=2017-06-15T03:56:26.485+0000)\n>\n> There is no point hearing your opinion, of course you&#x27;re gonna say &quot;It&#x27;s freaking amazing&quot; when you&#x27;re Riot&#x27;s little handyman, otherwise you wouldn&#x27;t be keeping your job.\n\nI agree. Absolutely disgusting biased mods.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2017-06-14T23:22:55.275+0000","up_votes":4,"down_votes":0,"body":"Nice game!\n\nI agree, it's a good system!\nand unlike chasing lvl 7's, once you reach the top you have to still keep up good behaviour otherwise you go back.\n\nWhat Im seeing with it, is how little effort it takes to just say something nice. \nLike I'm not a toxic person, nor am I overly friendly unnecessarily.\nBut even I find myself saying little things like \"That was good kiting Cait!\"\nWhen otherwise I probably wouldn't have bothered saying anything except \"gj\". \nIt takes no time at all, and means the world to Cait. \n\nOf course, everyone is out sucking the team's dick for honour. _(which is hardly a bad thing)_\nIt'll die down eventually, but hopefully by then, people have gotten a taste of what it's like to be in a world with less toxicity, so they will strive to keep it that way.","replies":[{"poster":"Ninox","date":"2017-06-15T03:18:57.372+0000","up_votes":3,"down_votes":0,"body":"It ain't hard to not be a douchecanoe, it's only a fraction harder to say a nice thing each game :) I love the fact that honour highlights that AND that there is a very natural progression with real drawbacks if you do choose to be a butt. Positive reinforcement is more effective than negative any day. In truth I feel once things are settled and maybe it has been expanded a little, the honour system will do a lot more to prevent toxicity than punishments will for the vast majority (bad days and casual toxics, obvs those that set out to be toxic are going to be regardless).","replies":[{"poster":"Lord Sesshomaru","date":"2017-06-15T03:48:56.889+0000","up_votes":2,"down_votes":0,"body":"I agree, I'm all for positive reenforcement!\nAs we see nearly every day on the boards, punishing people just makes them angrier. \nIt's true that for some people, punishment is the only thing they'll listen to! But for the majority, I think this system opts to be a better deterrent for bad behaviour. \n\nOne thing I do really like about the new honour system, is that its not _too_ rewarding. It doesn't give you 10 free skins a day and have giant neon flights flashing above your head saying \"Im a nice guy!\".\n\nPeople shouldn't be spoiled just for being nice, it's just something that people should do naturally. \nAnd this system gives you just enough of a reward to say 'thanks for being positive'.\nas well as showing people it feels good to not be a dick.\nBut doesn't shower them with gifts for exhibiting basic human behaviour.","replies":[]}]},{"poster":"Broken Scripts","date":"2017-06-15T09:20:54.501+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=T8eq2lFQ,discussion-id=EB6s7f1Q,comment-id=0002,timestamp=2017-06-14T23:22:55.275+0000)\n>\n> Nice game!\n> \n> I agree, it&#x27;s a good system!\n> and unlike chasing lvl 7&#x27;s, once you reach the top you have to still keep up good behaviour otherwise you go back.\n> \n> What Im seeing with it, is how little effort it takes to just say something nice. \n> Like I&#x27;m not a toxic person, nor am I overly friendly unnecessarily.\n> But even I find myself saying little things like &quot;That was good kiting Cait!&quot;\n> When otherwise I probably wouldn&#x27;t have bothered saying anything except &quot;gj&quot;. \n> It takes no time at all, and means the world to Cait. \n> \n> Of course, everyone is out sucking the team&#x27;s dick for honour. _(which is hardly a bad thing)_\n> It&#x27;ll die down eventually, but hopefully by then, people have gotten a taste of what it&#x27;s like to be in a world with less toxicity, so they will strive to keep it that way.\n\nIt shocks me that people expect praise for actually playing the game. Like, do you want on a pat on the back for getting a minion? Cait should stfu and play her role better and not expect to be congratulated.","replies":[]}]},{"poster":"MasterMirkinen","date":"2017-06-14T23:32:05.594+0000","up_votes":3,"down_votes":0,"body":"<3","replies":[]},{"poster":"Akkordian Zoeve","date":"2017-06-14T22:55:15.196+0000","up_votes":3,"down_votes":0,"body":"Wow :D well done","replies":[]},{"poster":"Tameru","date":"2017-06-15T07:00:42.776+0000","up_votes":2,"down_votes":0,"body":"Here's my opinion on the new system\nAs someone who is naturally supportive (unless I fall behind a lot and get self deprecating), I feel this system is good as it makes the people who usually get salty and blame the team think twice. Therefore, less hate, easier to play, etc etc\n\nThe one thing I could want fixed is what it drops. Key fragments, whilst awesome for those who have chests \nhttp://imgur.com/a/RTC1u)]\n...they aren't so good for people who have keys. Maybe have it balanced so it gives whatever you have less of, with chests having a 1/3rd droprate of keys.\n\nI'm still going to be positive because it's just how I play, but I see little incentive to do so for rewards when most of the rewards i either already have or don't want","replies":[]},{"poster":"Broken Scripts","date":"2017-06-15T09:16:33.979+0000","up_votes":1,"down_votes":0,"body":"The only thing I'm seeing is that 6/10 win/loss ratio.","replies":[]},{"poster":"Your Neighbour","date":"2017-06-20T15:16:40.854+0000","up_votes":1,"down_votes":1,"body":"Please make a prison queue for people with honor 0","replies":[]},{"poster":"Exarch Leona","date":"2017-06-15T16:24:25.577+0000","up_votes":1,"down_votes":1,"body":"Sweet, now they bring up a screen to honor people who afk, trolled or threw a game. Reward all the toxic behaviour :D\n\n\n\n*Sarcasm intensifies*","replies":[]}]}