{"poster":"Sir Lobito ","date":"2016-10-28T19:52:16.721+0000","title":"Duda sobre programas de skin","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"Deseo saber si hay alg&uacute;n problema en que yo instale un programa llamado wooxy que me da la opci&oacute;n de solo yo ver la custom skin que ponga, eso me meritara de un baneo? o alguna cosa? ayuda por favor :3","replies":[{"poster":"martincarp","date":"2016-10-28T19:59:56.531+0000","up_votes":1,"down_votes":0,"body":"Siempre y cuando el programa no aporte ninguna ventaja en lo que a jugabilidad respecta está permitido.\nTe dejo un enlace con una declaración oficial con respecto a los programas de tercero que se hizo hace aproximadamente un año.\n\nhttp://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/Yglr8tUK-aplicaciones-de-terceros","replies":[{"poster":"Desaroll","date":"2016-10-28T21:49:06.042+0000","up_votes":1,"down_votes":0,"body":"Ojo, que no dice que estén totalmente permitidos.\n\nDice, y cito:\n>Por ahora, los modelos personalizados y arte están en la categoría de “Usese bajo tu propio riesgo”, pero les tenemos un ojo encima. No podemos optimizar para características que no desarrollamos nosotros. Si estas se llegaran a convertir en un problema en un futuro (por ejemplo que se sean ventajas medibles al jugador), tomaremos acción según la posición explicada arriba.\n\nEsto quiere decir que por ahora no las castigan, pero eso puede cambiar en cualquier momento.\n\nDejo la advertencia solo por si alguien malinterpreta lo de \"totalmente permitido\".\n\nSuerte!","replies":[{"poster":"martincarp","date":"2016-10-28T21:54:39.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Desaroll,realm=LAS,application-id=v7qsfXsE,discussion-id=iIVhJF4E,comment-id=00040000,timestamp=2016-10-28T21:49:06.042+0000)\n>\n> Ojo, que no dice que estén totalmente permitidos.\n> \n> Dice, y cito:\n> \n> Esto quiere decir que por ahora no las castigan, pero eso puede cambiar en cualquier momento.\n> \n> Dejo la advertencia solo por si alguien malinterpreta lo de &quot;totalmente permitido&quot;.\n> \n> Suerte!\n\nTenés razón, ahí lo edito para no generar confusiones. Sinceramente leí el post de Rito medio a la apurada.","replies":[]}]}]},{"poster":"ZanahoriaAsesina","date":"2016-10-28T19:59:46.505+0000","up_votes":1,"down_votes":0,"body":"No,** por ahora** esta permitido o mejor dicho en este momento están mas centrados en sancionar otras cosas.\n\nAunque tenes que tener cuidado con las actualizaciones del programa porque si a Riot no le gusta algo del mismo puede que empiecen a sancionar en un futuro a los jugadores que lo usen.\n\nSuerte.","replies":[]},{"poster":"Lukhazs","date":"2016-10-28T19:57:57.971+0000","up_votes":1,"down_votes":0,"body":"no pasa nada te recomiendo skin preview tiene muuuuchas skin y huds","replies":[]},{"poster":"Diosmo","date":"2016-10-28T19:55:33.424+0000","up_votes":1,"down_votes":0,"body":"En vez de lidiar con programas raros busca en youtube (o google) Personaje+skin+spotlight y te lo muestran haciendo todas las animaciones (incluido R y recall).\n\nSaludos!","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-10-28T19:54:31.387+0000","up_votes":1,"down_votes":0,"body":"De momento, no pasa nada por usar Wooxy, hasta que anuncien que no lo seguirán permitiendo :p","replies":[]}]}