{"poster":"AkabaneKun","date":"2015-09-08T19:58:34.841+0000","title":"Evelynn  Ravage (E) damage lowered to 50/90/130/160/210 from 70/110/150/190/230","subforum":"Gameplay","up_votes":120,"down_votes":26,"body":"What in the actual fuck, seriously? Why not make her a walking ward and call it a day riot?\n\nEdit: Nerf reverted, let's hope it stays like this.","replies":[{"poster":"Only Play Darius","date":"2015-09-08T20:02:36.747+0000","up_votes":35,"down_votes":5,"body":"The fact that she is an assassin/mage yet builds AD tank should say enough about her currents state. No need to nerf.","replies":[{"poster":"Dessem","date":"2015-09-08T20:10:35.756+0000","up_votes":34,"down_votes":4,"body":"She even has a ~50% winrate according to lolking, so I'm confused. It looks like she's in that perfectly fine spot of losing as much as she wins, but somehow Riot wasn't satisfied and thinks Evelynn is OP and needs a nerf...?\n\nShe CAN be rather strong when build AP Assassin, but Rengar still deletes you a hell of a lot faster than Evelynn can.","replies":[{"poster":"manbearswine","date":"2015-09-08T21:57:20.196+0000","up_votes":3,"down_votes":35,"body":"> [{quoted}](name=Ramuhdo,realm=EUW,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=00030000,timestamp=2015-09-08T20:10:35.756+0000)\n>\n> She even has a ~50% winrate according to lolking, so I'm confused. It looks like she's in that perfectly fine spot of losing as much as she wins, but somehow Riot wasn't satisfied and thinks Evelynn is OP and needs a nerf...?\n\nMassive banrate,she was idiotic op shit.\nNow she is moronic very strong cancerous garbage(Thank you rylai scepter).\n \n> She CAN be rather strong when build AP Assassin, but Rengar still deletes you a hell of a lot faster than Evelynn can.\n\nThis is exactly my point,you know a champion is moronic garbage when the first thing you compare it to is rengar.","replies":[{"poster":"Adrian Umbra","date":"2015-09-08T22:37:07.133+0000","up_votes":17,"down_votes":1,"body":"...Massive banrate?  What universe do you live in?  It's been a month since I've seen a single Eve ban, let alone a whole bunch of them.  Her play rate was hovering around 4%, with a ban rate of under 10% last I checked.\n\nAnd the reason Eve's being compared to Rengar is that they fill the same niche, a jungle assassin who deletes people if they can get fed.  And Rengar absolutely does it better.  So why are they nerfing Eve first if Rengar's this horrible overpowered toxic champion?","replies":[]}]},{"poster":"Gorgannan","date":"2015-09-09T01:34:15.774+0000","up_votes":2,"down_votes":0,"body":"Idk how you don't understand what's going on. They've done this with DOZENS of champions.\n\nThey don't like them, they think they're unhealthy, they nerf them into garbage until a rework. I'm not saying you should agree or like it, but you should KNOW that's what is happening. Urgot, Sion, Heimerdinger, Olaf, Kassadin, and many more. \n\nThey aren't trying to BALANCE her.","replies":[]}]},{"poster":"Meep Man","date":"2015-09-08T23:10:37.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jelly Mac,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=0003,timestamp=2015-09-08T20:02:36.747+0000)\n>\n> The fact that she is an assassin/mage yet builds AD tank should say enough about her currents state. No need to nerf.\n\nI thought she was supposed to be on-hit?","replies":[{"poster":"Kuroi86","date":"2015-09-08T23:38:39.441+0000","up_votes":5,"down_votes":1,"body":"AP, AD, Tank, On-Hit, Bruiser, you name it, Eve can build it...","replies":[{"poster":"Alphadef","date":"2015-09-09T02:10:32.944+0000","up_votes":9,"down_votes":1,"body":"AP, AD, Tank, On-Hit, Bruiser, You name it and someone can do it significantly better.","replies":[{"poster":"Kuroi86","date":"2015-09-09T02:26:44.180+0000","up_votes":4,"down_votes":0,"body":"True, I didn't mean to insinuate that it makes her a good pick if you're wanting to go a particular route.  What I meant is that she is somewhat reactionary.  If you find yourself in a situation where you need to choose between going AD, AP or tank, then Eve is able to go in any direction while still being usable.  Not every champ has that distinction.","replies":[{"poster":"Bears Dont Care","date":"2015-09-09T02:39:06.442+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=00030001000000000000,timestamp=2015-09-09T02:26:44.180+0000)\n>\n> True, I didn't mean to insinuate that it makes her a good pick if you're wanting to go a particular route.  What I meant is that she is somewhat reactionary.  If you find yourself in a situation where you need to choose between going AD, AP or tank, then Eve is able to go in any direction while still being usable.  Not every champ has that distinction.\n\nExcept that your team comp determines what route you build, not the situation with the enemy team.\nYou don't go \"oh hey, they are armor heavy, let me go AP\".\nYou build for synergy with your team.\nShe isn't usable because she has no synergy with a particular team comp.\nIf you want someone flexible, pick lee Sin.","replies":[{"poster":"Kuroi86","date":"2015-09-09T02:49:42.203+0000","up_votes":2,"down_votes":0,"body":"Not even Lee Sin is good at that any more.\n\nPick {{champion:107}}","replies":[{"poster":"5000000000000000","date":"2015-09-09T03:46:16.524+0000","up_votes":2,"down_votes":0,"body":"When is Lee Sin ever not good?","replies":[]}]}]}]}]}]}]},{"poster":"yay nibbers","date":"2015-09-08T23:15:41.548+0000","up_votes":2,"down_votes":0,"body":"Her highest winrate builds actually have her building AP again. Rylai's is actually pretty OP on her now that AOE abilities apply 40% slows for 1 second. Which is a constant, relatively debilitating slow. Just something to think about.","replies":[]}]},{"poster":"Dessem","date":"2015-09-08T20:02:11.384+0000","up_votes":28,"down_votes":5,"body":"RIP Evelynn. 50% winrate apparently too high for her.\n\nBeing an Evelynn main is getting a slight buff, then a series of nerfs. And no skins ever because Evelynn needs a Visual Update first, without being anywhere on the list because it's not a priority.\n\nMeanwhile, Vayne still untouched.","replies":[{"poster":"Kuroi86","date":"2015-09-08T23:52:58.821+0000","up_votes":1,"down_votes":0,"body":"They were working on the VU, but it was so horrible that they scrapped it until one of the artists can come up with something proper.  Trying to find a pic of the proposed VU.\n\nSeriously, she looked like she was wearing bulky plate armor over her torso and nothing on her arms/legs and her hair looked even more SSJ than it currently does.","replies":[{"poster":"AkabaneKun","date":"2015-09-09T01:16:08.439+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=00020001,timestamp=2015-09-08T23:52:58.821+0000)\n>\n> They were working on the VU, but it was so horrible that they scrapped it until one of the artists can come up with something proper.  Trying to find a pic of the proposed VU.\n> \n> Seriously, she looked like she was wearing bulky plate armor over her torso and nothing on her arms/legs and her hair looked even more SSJ than it currently does.\n\nhttp://img1.leaguecraft.com/skins/asset/skin_1400763629_760px_41073_1.jpg%22\n\nIt's not that hard.","replies":[{"poster":"Uiraya","date":"2015-09-09T03:43:15.777+0000","up_votes":3,"down_votes":0,"body":"This is not nearly as awful as I expect it'll be.\n\n I mean, it's not great.\n\nBut I expect Eve's VU to destroy her character the way her neverending nerf train has destroyed her gameplay.","replies":[]},{"poster":"Kuroi86","date":"2015-09-09T01:22:49.462+0000","up_votes":2,"down_votes":0,"body":"Oy, worse than I remembered.","replies":[]}]},{"poster":"Dessem","date":"2015-09-08T23:58:21.970+0000","up_votes":2,"down_votes":0,"body":"Please don't show me, I want to love Evelynn for a bit longer. :'(","replies":[]}]}]},{"poster":"Mafia LeBlanc","date":"2015-09-08T22:14:02.220+0000","up_votes":14,"down_votes":0,"body":"Reasons like this are why I dropped her as my main after her rework.\nI was perfectly happy with her nerfed version where they completely gutted her, removed her stun, removed half her healing from her ult, and banned people for playing her.  I still had fun and enjoyed my games as the trashy shadow walker.\n\nThen they remade her into a Shyvana wannabe with stealth and completely ruined her playstyle for me, and I dropped her like a hot potato after playing nothing but Eve for thousands of games.\n\nThey don't care about this champion, and I'd recommend anyone who mains her to find a new one.","replies":[]},{"poster":"LadyRenly","date":"2015-09-08T20:26:18.013+0000","up_votes":15,"down_votes":2,"body":"Morde, Darius and Garen are 100% pick or ban, BETTER NERF EVELYNN","replies":[]},{"poster":"qetzel","date":"2015-09-08T21:56:28.085+0000","up_votes":5,"down_votes":2,"body":"While her win-rate is fairly average (50%) those with many games on her are getting 57% \n\nhttp://champion.gg/champion/Evelynn/Jungle\n\nThis is significantly higher than 53-4%, the number a Rioter (Repetoir, I think) suggested as the 'ideal' win rate for experienced players on a balanced champion. Based purely on statistics, some nerf is warranted.","replies":[{"poster":"Vekkna","date":"2015-09-08T22:33:24.673+0000","up_votes":9,"down_votes":1,"body":"No, this makes no sense. Look at the top, like, 20-ish mid laners. They all peak over 55% at various experience levels. The most egregious outliers being Zilean, Lux, Heimer, etc. who effectively hit 60% at different points and/or never dip below 50% for **anyone.**\n\nChamps like Vayne and Draven also both have very steep skill curves with high win rates for very experienced players and very low win rates for inexperienced players. This is supposed to be acceptable design.\n\nThen you have Evelynn, whose skill floor and cap are both far higher than Xin Zhao, yet Xin's win rate ranges only from 52% to 57%, not 45% to 56%.  Yet Evelynn is the one getting nerfed which makes exactly zero fucking sense.","replies":[]},{"poster":"Deathtenfold","date":"2015-09-08T21:59:47.398+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=qetzel,realm=EUW,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=0012,timestamp=2015-09-08T21:56:28.085+0000)\n>\n> While her win-rate is fairly average (50%) those with many games on her are getting 57% \n> \n> http://champion.gg/champion/Evelynn/Jungle\n> \n> This is significantly higher than 53-4%, the number a Rioter (Repetoir, I think) suggested as the 'ideal' win rate for experienced players on a balanced champion. Based purely on statistics, some nerf is warranted.\n\nBecause good evelynn players who win their games due to positioning and ganking prove to riot shes too strong?","replies":[]},{"poster":"Adrian Umbra","date":"2015-09-08T22:52:27.951+0000","up_votes":3,"down_votes":0,"body":"After more than 125 games, people are achieving a great win rate on Evelynn.  Yes, that's a pretty high win rate, but she's also a champion who's not seen much any more, one that generally sucks during the first few games her players try with her, and one that generally works well against tank junglers.  With how low her play rate is, she's getting close to counterpick status, like Malphite, a champion who is also reaching high win percentages at high experience levels.\n\nhttp://champion.gg/champion/Malphite/Top\n\nSo even if Riot pulls this reasoning for her getting nerfed, I'm going to call bull on it because there ARE champions out there who have win rates like this at high experience levels who don't need nerfs and aren't getting hit.  Heimerdinger hits that level of win rate at far lower numbers of games.  Lux and Zilean kick both of them to the curb. Wukong too.  So why is it that only Evelynn can't have nice things out of any of those?","replies":[]}]},{"poster":"Deathtenfold","date":"2015-09-08T20:02:07.399+0000","up_votes":10,"down_votes":2,"body":"Its FINEEEE my auto attacks do more damage than my Highest damaging skill in my kit. I can make this work without dying to every single jungle monster now. But just in case, i'll replace {{summoner:4}}  with {{summoner:7}} .","replies":[{"poster":"maikokk","date":"2015-09-08T22:06:02.651+0000","up_votes":6,"down_votes":1,"body":"people were using her E on hit applications to make up for her lack of q damage... you cant let Evelyn do damage or she might carry :(","replies":[]}]},{"poster":"Kuroi86","date":"2015-09-09T00:40:42.406+0000","up_votes":3,"down_votes":8,"body":"*sigh* \n\nI'm just gonna come out and say it.\n\nEve needs a rework.\n\nHer stealth is far too strong on a champion who's meant to burst squishies.\n\n>But her stealth isn't permanent, she becomes visible before you can hit anyone!\n\nPassive range 700\nUlt range 650/250\n\nBy the time you see Eve, she's already killing you.\nHer stealth leaves little time for anyone below challenger to react. (See {{champion:107}} syndrome)\n\nAbout the only thing that keeps her viable is the fact that her kit has a little bit of almost everything a jungler could ever want.  \nDPS style ability.  Check\nAD and AP scalings. Check\nAttack speed and move speed buffs. Check\nThese leave Eve with a kit that is open to a LOT of different build options.\n\nAll the same, her stealth is holding her back.  \nRiot doesn't like when a champ is able to blow you up from stealth with little to no chance to counter play.\n{{champion:121}} Nerfed out of solo queue\n{{champion:107}} Nerfed, reworked, nerfed, buffed, nerfed, then Riot threw up their hands at attempting to balance this mess.\n{{champion:35}} Hit by the Hammer of Dawn\n{{champion:17}} Left in a pitiable state since beta with little in the ways of balancing.\n{{champion:91}} Nerfed\n{{champion:84}} Nerfed\n{{champion:29}} Used to be pick/ban.  Then got nuked out of existence. \n\nStealth + burst is a pain to balance and Eve is just another example of how feast/famine it is.","replies":[{"poster":"Bears Dont Care","date":"2015-09-09T01:44:04.468+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=001b,timestamp=2015-09-09T00:40:42.406+0000)\n>\n> *sigh* \n> \n> I'm just gonna come out and say it.\n> \n> Eve needs a rework.\n> \n> Her stealth is far too strong on a champion who's meant to burst squishies.\n> \n> Passive range 700\n> Ult range 650/250\n> \n> By the time you see Eve, she's already killing you.\n\nFalse, her ultimate's damage is current health based, and on top of this she has suffered repeated Ratio and base damage nerfs.\nThe range of her ! is 500 in range, and her Ravage is roughly beyond melee range.\nOn top of this, merely running from her causes her Q's to miss because they decay in projectile speed.\nSuggesting that her stealth leads to \"WOMFG DEATH\", is false considering the items such as DFG,no longer exist.\non top of this, ravage was made physica  which lessened her burst due to natural armor gained from leveling and no longer synergizing with DFG.\nYour statement is literally a lie.\n\n\n> Her stealth leaves little time for anyone below challenger to react. (See {{champion:107}} syndrome)\n\nFalse. The reaction speed of the average human being, pure, is around .23 seconds.\nThe amount of time it takes for her to close that distance is closer to 1 second.\nGoing purely on reaction speed means you have more of a chance to react to her attack and damage.\nMeanwhile, rengar can triple Q you to death.\nKha'zix can burst you to death\nRiven can burst you to death.\n\nAll much faster than evelynn ever will.\nDid I mention Lee sin?\nLee Sin.\n\n> \n> About the only thing that keeps her viable is the fact that her kit has a little bit of almost everything a jungler could ever want.  \n\nFalse, in many ways.\n\n> DPS style ability.  Check\n> AD and AP scalings. Check\n> Attack speed and move speed buffs. Check\n> These leave Eve with a kit that is open to a LOT of different build options.\n\n1. Junglers want sustain. Evelynn has none.\n2. Junglers want CC. Evelynn has  a slow on her ult. She has nearly no CC. No CC means being more reliant on your laner for damage AND CC. Due to her low damage early game, she has the hardest time landing early game kills unless she swaps flash out for an offensive spell such as exhaust or ignite. \n3. Base stats? Evelynn is low on all of them.\n4. Gap closers. She has none.\n5. MS enhancers/ Udyr has it, and can spam it to be constant. Hers is not constant. Ever\n6.  Having two scalings is not a desired trait. It adds flexibility to building, but isn't an indemand thing. Look at Rengar, Sejuani, Lee sin.\n7. Attack speed is not a useful stat in and of itself. Look at AD casters such as Vi, Pantheon, Kha'zix. They don't build attack speed.\n\nEvelynn's kit does not leave her opent o a lot of build options.\nHate spike is sustained. \nRavage is burst.\nAgon'y embrace is tank ability. (lol wut?)\n\nShe builds either warrior's or runeglaive.\nRuneglaive for burst (btw it doesnt scale well)\nWarriors  AD bruiser.\n\nHell most often she goes Warrior because she is an AD bruiser.\nNot an assassin.\nNot a tank.\n\n> \n> All the same, her stealth is holding her back.  \n> Riot doesn't like when a champ is able to blow you up from stealth with little to no chance to counter play.\n> {{champion:121}} Nerfed out of solo queue\n> {{champion:107}} Nerfed, reworked, nerfed, buffed, nerfed, then Riot threw up their hands at attempting to balance this mess.\n> {{champion:35}} Hit by the Hammer of Dawn\n> {{champion:17}} Left in a pitiable state since beta with little in the ways of balancing.\n> {{champion:91}} Nerfed\n> {{champion:84}} Nerfed\n> {{champion:29}} Used to be pick/ban.  Then got nuked out of existence. \n> \n> Stealth + burst is a pain to balance and Eve is just another example of how feast/famine it is.\n\nExcept Evelynn does NOT burst.\nWhen was the last time you exploded compared to Kha, rengar, zed or any other actual assassins?\nExactly.\nShe isn't an assassin\nShe isn't any semblance ofwhat she used to be","replies":[{"poster":"Kuroi86","date":"2015-09-09T02:43:56.825+0000","up_votes":1,"down_votes":3,"body":">False, her ultimate's damage is current health based, and on top of this she has suffered repeated Ratio and base damage nerfs.\nThe range of her ! is 500 in range, and her Ravage is roughly beyond melee range.\n\nAnd it takes how long for Eve to cover that range after dropping her ult on a target?\n\n>On top of this, merely running from her causes her Q's to miss because they decay in projectile speed.\n\nNo it doesn't, if you want to avoid her Q then move through minions, but the decay only works in your favor if you're faster than Eve.\n\n>Suggesting that her stealth leads to \"WOMFG DEATH\", is false considering the items such as DFG,no longer exist.\n\nShe no longer pops you like before, this is true.  But with {{item:3708}} {{item:3285}} she can quickly burst through a squishies health and needing only one or two autos or a Q to finish off her target.\n\n>on top of this, ravage was made physica which lessened her burst due to natural armor gained from leveling and no longer synergizing with DFG.\n\nWhy, because she was popping people without people having a chance to retaliate.\n\n>Meanwhile, rengar can triple Q you to death.\nKha'zix can burst you to death\nRiven can burst you to death.\n\n>All much faster than evelynn ever will.\nDid I mention Lee sin?\nLee Sin.\n\nLiterally, the only one you mentioned that can kill someone faster than AP Eve is Rengar.  But hey, Rengar is ridiculous.  Riven deals fast damage, but not nearly as fast as the likes of Rengar.  Kha has literally been nerfed out of solo queue and only really bursts you if he's insanely fed or you're dumb enough to go wandering in his jungle alone.\n\n>Not an assassin.\nNot a tank.\n\nEve was originally an assassin, since then her nerfs have rendered that moot.\nAnd while I'm glad it was short lived, there WAS a time when most Eve players played her tank because that was literally the only way to make her work, she had been so hard nerfed that it was the only way for you to get off a decent amount of damage before dying.\n\n>She isn't any semblance ofwhat she used to be\n\nExactly.  Now ask yourself why.  What was the point of what I said and all the long winded bs you just posted trying to prove me wrong when all you did was prove me right.\n\nEve used to have burst, she used to have CC, she used to demolish people.  And she used to do it with little time for any retaliation.  \n\nWhy was her burst nerfed so hard?\n\nBecause it came out of no where.\n\nBecause by the time you saw her, you knew it was too late.\n\nThat is the problem with her stealth.\n\nIf she can burst, then you've almost as little chance against her as you did against Talon when he had a silence.   You've almost as little chance against her as you have against Rengar in his current form!\n\nWas has Riot nerfed so many stealth champs.","replies":[{"poster":"Bears Dont Care","date":"2015-09-09T03:05:48.614+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=001b00000000,timestamp=2015-09-09T02:43:56.825+0000)\n>\n> The range of her ! is 500 in range, and her Ravage is roughly beyond melee range.\n> \n> And it takes how long for Eve to cover that range after dropping her ult on a target?\n\nI gave the \"under 1 second\" quote based on  a stand stil target.\n\n\n> \n> No it doesn't, if you want to avoid her Q then move through minions, but the decay only works in your favor if you're faster than Eve.\n\nHer Q prioritizes champions, you're assuming it will bug out and hit a minion.\nThe decay works even if you move the exact same speed as her.\n\n> \n> She no longer pops you like before, this is true.  But with {{item:3708}} {{item:3285}} she can quickly burst through a squishies health and needing only one or two autos or a Q to finish off her target.\n\nShe needs several more items than just Luden's and a runeglaive to burst a squishy that quickly.\nSeriously, don't exaggerate it doesn't help your argument\n\n\n\n> \n> Literally, the only one you mentioned that can kill someone faster than AP Eve is Rengar.  But hey, Rengar is ridiculous.  Riven deals fast damage, but not nearly as fast as the likes of Rengar.  Kha has literally been nerfed out of solo queue and only really bursts you if he's insanely fed or you're dumb enough to go wandering in his jungle alone.\n\nThis is factually false, have you not looked at her base damage/ratios/CD's?\nRengar, Zed, Leblanc, Malzahar, Lee Sin, pantheon.\nEvelynn doesn't kill a target super quickly because her kit does NOT allow it.\nOne is a tank tool.\none is SUSTAINED.\nOne is a burst tool.\nSuggesting that Evelynn's burst is only slower than Rengar's is a grossly misinformed statement.\n\n> Exactly.  Now ask yourself why.  What was the point of what I said and all the long winded bs you just posted trying to prove me wrong when all you did was prove me right.\n\nUm, not really.\nYou're trying to displace your argument.\n\"Well she was like this in the past, so its okay if they nerf her for the same reasons even though they are not relevant.\"\n\nUm..no.\nIf a champion no longer exhibits the toxic behavior, you don't nerf them further for behavior they no longer exhibit.\n\n> \n> Eve used to have burst, she used to have CC, she used to demolish people.  And she used to do it with little time for any retaliation.  \n\nWhat CC?\nAfter her rework she only had her slow.\nIt was even weaker than it is currently in terms of slow strength.\nTHe retaliation issue happened because of the following.\n\nRavage was magical.\nHate spike had much higher base damage.\nAgony's embrace was MAXIMUM health not CURRENT health.\nDFG existed.\n\nNone of this exists now, so the nerf makes no sense.\n\n> \n> Why was her burst nerfed so hard?\n> \n> Because it came out of no where.\n> \n> Because by the time you saw her, you knew it was too late.\n> \n> That is the problem with her stealth.\n> \n> If she can burst, then you've almost as little chance against her as you did against Talon when he had a silence.   You've almost as little chance against her as you have against Rengar in his current form!\n> \n> Was has Riot nerfed so many stealth champs.\n\nExcept that ISN'T relevant.\nWe are discussing THIS nerf, at THIS time.\nWe're not talking about nonsense that happened int he past that no longer is relevant.\nWe are discussing the fact that her nerf is unwarranted because she no longer has the same type of tools she did in the past that made her a lesser Rengar.","replies":[]}]}]}]},{"poster":"Bârd","date":"2015-09-08T23:20:53.356+0000","up_votes":5,"down_votes":0,"body":"The reason is simple.\n{{champion:28}} splash has purple in it\nWho else has purple in his splash art?\n{{champion:38}}","replies":[{"poster":"Oerba No Naja","date":"2015-09-08T23:29:04.169+0000","up_votes":3,"down_votes":0,"body":"{{champion:134}}","replies":[]},{"poster":"AngelSpite","date":"2015-09-08T23:33:15.323+0000","up_votes":1,"down_votes":0,"body":"{{champion:121}}","replies":[{"poster":"OperationDEEZ1","date":"2015-09-09T03:23:32.197+0000","up_votes":2,"down_votes":0,"body":"{{champion:25}}","replies":[]}]}]},{"poster":"BeatinWarDrumz","date":"2015-09-08T22:25:10.208+0000","up_votes":6,"down_votes":1,"body":"are you fucking serious?  and no nerfs to vayne?  Eve is pretty damn balanced atm...","replies":[]},{"poster":"Rebonack","date":"2015-09-08T20:40:49.460+0000","up_votes":7,"down_votes":2,"body":"The new Rylai's is really nice on Eve.\n\nAnd as we all know, Eve isn't allowed to have nice things.","replies":[]},{"poster":"Lapis x3","date":"2015-09-08T20:29:42.056+0000","up_votes":7,"down_votes":2,"body":"These Evelynn nerfs are ridiculous, Riot's balance team is making me really annoyed. Sona gets tons of nerfs...then Cass...Rek'sai...now Evelynn? Why, just...why?\n\nShe has no innate tankiness, has horrible base damages ever since Q was nerfed, and now your...reducing her base damages even more?\n\nWhat does Evelynn have that requires her to be nerfed? Probably so she doesn't get played in Worlds. \n\nBut OH, of course Lee Sin gets a buff! His high skillcap warrants it! His Ult doesn't do** nearly **enough damage when compared to Eve's E! ~","replies":[{"poster":"Mecha MaIphite","date":"2015-09-08T20:58:08.903+0000","up_votes":1,"down_votes":0,"body":"I'm going to be honest, I hate laning against Cass and I don't care if she gets nerfed. I didn't play mid much before her rework so I don't know what she was like before.","replies":[{"poster":"Bears Dont Care","date":"2015-09-08T20:59:18.607+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Puddinglax,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=00070000,timestamp=2015-09-08T20:58:08.903+0000)\n>\n> I'm going to be honest, I hate laning against Cass and I don't care if she gets nerfed. I didn't play mid much before her rework so I don't know what she was like before.\n\nBut what you \"feel\" shouldn't determine balance.","replies":[]}]}]},{"poster":"Final Spark Lux","date":"2015-09-08T21:23:12.421+0000","up_votes":6,"down_votes":15,"body":"because 20 base damage is gonna make her go from being good to completely useless? if thats the case, you arent building properly","replies":[{"poster":"Deathtenfold","date":"2015-09-08T21:27:12.946+0000","up_votes":13,"down_votes":3,"body":"> [{quoted}](name=Final Spark Lux,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=000f,timestamp=2015-09-08T21:23:12.421+0000)\n>\n> because 20 base damage is gonna make her go from being good to completely useless? if thats the case, you arent building properly\n\nFirst of all, she wasn't good to begin with, secondly she needed that damage to even clear two camps, after getting a leash too. You clearly don't understand Evelyn enough to say people are not building properly","replies":[]}]},{"poster":"Guy Fox Teemo","date":"2015-09-08T21:22:19.874+0000","up_votes":4,"down_votes":3,"body":"Feel like there gonna keep her shit until she gets a rework, because if she's strong with her current kit. It isn't fun to play against an assassin who has permanent invis. And don't say pink ward because only a max of 5 can go on the entire dam map.","replies":[{"poster":"Deathtenfold","date":"2015-09-08T21:24:55.733+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=DarkSoul245,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=000e,timestamp=2015-09-08T21:22:19.874+0000)\n>\n> Feel like there gonna keep her shit until she gets a rework, because if she's strong with her current kit. It isn't fun to play against an assassin who has permanent invis. And don't say pink ward because only a max of 5 can go on the entire dam map.\n\nAs I posted earlier, RIOT made it permanent invis. It used to be an active, but I guess making it last only 5-20 seconds was too much work. So instead of making it go from 50 seconds to 5-20, they changed it completely and have not stopped nerfing her. Her only decent buffs were later nerfed so they held zero meaning.","replies":[]}]},{"poster":"ks916","date":"2015-09-08T20:30:48.543+0000","up_votes":6,"down_votes":2,"body":"Not the nerf Evelyn needed. I just wanted rylai's not be so fcking godlike on her not a nerf on dmg, thought she did fine in terms of dmg.","replies":[{"poster":"Deathtenfold","date":"2015-09-08T20:44:34.885+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=kamal916,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=0008,timestamp=2015-09-08T20:30:48.543+0000)\n>\n> Not the nerf Evelyn needed. I just wanted rylai's not be so fcking godlike on her not a nerf on dmg, thought she did fine in terms of dmg.\n\nI have only one problem and only one. You stated '' Not the nerf Evelyn NEEDED'' She not only needs the opposite of a nerf ( a buff to her entire kit) but also to not have idiots from the balance team working on her.","replies":[{"poster":"ks916","date":"2015-09-08T21:10:52.633+0000","up_votes":2,"down_votes":0,"body":"My bad I kinda phrased it wrong, she doesn't need nerfs I just want them to do something with the with either Rylai's or Eve's synergy with it since it's a perma slow with hate spikes which is so annoying. You can't fix/buff her without addressing rylai's on her.","replies":[{"poster":"Maximum Morde","date":"2015-09-08T21:26:01.385+0000","up_votes":7,"down_votes":3,"body":"> [{quoted}](name=kamal916,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=000800000000,timestamp=2015-09-08T21:10:52.633+0000)\n>\n>since it's a perma slow \n\n{{champion:22}}, {{champion:27}}+{{item:3116}} , {{champion:75}} (Technically not perma, but close enough since he builds cdr, and worse for the auto attackers), Basically any auto attacker + {{item:3022}} \n\nBut, somehow it isn't ok for Eve to have a slow(for 3000 gold) that lets her actually stay on target given that she is a short range melee. \n\n{{champion:33}} : OK.","replies":[{"poster":"ks916","date":"2015-09-08T21:40:16.501+0000","up_votes":3,"down_votes":4,"body":"I'm not okay with any champion that can constantly reapply a 40% slow every 1.5 seconds, especially one that's an invisible jungler since once she gets on top of me I don't have much counter play, even if I flash she can press W and catch up to me and reapply the slow. Have you seen a Eve go Runeglave into Rylai's? It's pretty ridiculous. I'm not calling for Eve to be nerfed into the ground or anything but I do mind the fcking 40% perma slow on a invisible jungler. If you want to fairly buff her you need to deal with that slow she can consistently apply, imagine eve being strong with rylai'a in its current form, do we really want another champion to permanently ban?","replies":[{"poster":"AkabaneKun","date":"2015-09-08T21:42:13.794+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=kamal916,realm=NA,application-id=3ErqAdtq,discussion-id=qXFZUoA6,comment-id=00080000000000000000,timestamp=2015-09-08T21:40:16.501+0000)\n>\n> I'm not okay with any champion that can constantly reapply a 40% slow every 1.5 seconds, especially one that's an invisible jungler since once she gets on top of me I don't have much counter play, even if I flash she can press W and catch up to me and reapply the slow. Have you seen a Eve go Runeglave into Rylai's? It's pretty ridiculous. I'm not calling for Eve to be nerfed into the ground, I don't mind if she's decently strong, but I do mind the fcking 40% perma slow on a invisible jungler.\n\nYou don't run away from eve, you kill her.","replies":[]}]}]}]}]}]}]}