{"poster":"Rainbow LGBT","date":"2019-09-06T17:47:37.606+0000","title":"Información sobre el sistema de nivel de Honor","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"¡Hola comunidad! \r\nComo funciona el sistema para subir de nivel? Como hay que jugarle y que cosas evitar hacerlas?\r\nHe leído que el sistema de honores se ha modificado hace unos meses y ya no cuesta tanto subirlo como antes, esto es así?\r\nMi honor esta bloqueado actualmente (por problemas en partida) y luego del desbloqueo comienzo desde el nivel de honor 0 y leyendo a otros jugadores les costaba muchísimo desbloquear y también salir del nivel de Honor 0 pero leí a otro jugador diciendo que con esa nueva actualización de hace unos meses ya no cuesta tanto subir el nivel.\r\nTambién leí que ayuda a subirlo si no usas para nada el chat, ni una palabra, ni usar los pings y siempre dar honores al finalizar partida. Nose si los gestos también será mejor no usarlos y así subir de nivel mas rapidamente","replies":[{"poster":"Musidora Klemm","date":"2019-09-06T17:56:54.300+0000","up_votes":2,"down_votes":0,"body":"Subir no cuesta si no tuviste penalizaciones, cuando te penalizan la cosa se pone pesada y te toma un buen tiempo desbloquear el honor y recién ahí empezar a subir, tengo entendido. \nSe sube jugando, y el dar o recibir honor ayuda a esa progresión. Claro está que el dar o recibir honores de premades no tiene el mismo valor que recibir o darle a alguien desconocido.","replies":[]},{"poster":"PasoPackXHonores","date":"2019-09-06T19:13:19.327+0000","up_votes":2,"down_votes":2,"body":"Mira, yo quedé honor 0 por hacer un chiste sobre el aspecto de un campeón. Y bueno, cada 11 días subo 1 punto de control, casi sin jugar. Ya llegué a honor 1. Practicamente NI JUEGO. \nEl año pasado quedé en honor 1, y me maté jugando unas 100 partidas semanales, y la cantidad mínima de días para conseguir un punto de control, son 7 días. En 28 días subí de honor 1 a 2.\n\nAsí que, consejo. Ni te gastes en jugar para subir honor. Solo no digas nada y juga de vez en cuando, como yo y sube solo. Ahora, si flameas, no vas a subir nunca.\n\nP.d: cuando termines la partida, dale honor a cualquiera, no te hagas el Fakker y no le des honor a nadie. Dale a quien sea, pero si o si a alguno. Eso es lo que te sube el honor. El resto no importa. ","replies":[]}]}