{"poster":"HaIIeIujah","date":"2017-12-25T20:33:34.460+0000","title":"[CONTEST A PREMI] Primo Fanfiction Invitational","subforum":"Creazioni della community","up_votes":21,"down_votes":6,"body":"TL;DR: Contest a premi con in palio una Skin da 1350 RP, vedasi il regolamento per le specifiche.\n\n_Questo non è solo un contest, ma anche una sorta di \"raduno\" per la ridotta ma appassionata community del forum. Questo è il primo progetto di una serie che ho intenzione di promuovere per riunire ed incentivare gli utenti della Board, ed il Fanfiction Invitational è rivolto in particolare agli \"autori\" che si sono cimentati o intendono cimentarsi in materiale basato sull'universo di League. Quelli a seguire saranno di natura diversa, ma tutti con lo scopo comune di rivitalizzare il forum._\n\n****\n> \n> **Il Premio:** Una Skin da 1350 RP o inferiore a scelta del vincitore. Se il contest dovesse raggiungere un totale di 10+ Partecipanti, si aggiunge un premio di 750 RP o inferiori per il secondo posto. Il Contest verrà considerato valido solo se saranno presenti almeno cinque partecipanti, altrimenti non verrà assegnato alcun premio.\n\n**_\n\n> \n> **Il Format:** Una singola storia breve di 3500 Battute (senza considerare gli spazi) o minori, nella quale siano presenti _almeno_ due campioni. Il genere della storia, cosìccome la sua forma (prosa, prima persona, terza, tempo, e così via) sono interamente a discrezione dell'autore. Per essere considerata valida, una storia dovrà essere postata come risposta a questo thread. E' possibile applicare qualsivoglia correzione minore (grammatica, errori di battitura, riscrittura di singole frasi) come modifica, ma non alterazioni maggiori come interi paragrafi o cambi di personaggi/trama. Ogni partecipante è invitato ad aggiungermi dal client al momento del post, così da assicurarci che non ci siano problemi per l'eventuale premio e per la votazione (Vedasi sotto).\n> \nSono escluse: storie che violino le regole generali del forum, in particolare per quanto riguarda i contenuti \"forti\"; storie scritte sotto la forma di un copione televisivo; storie che necessitino di icone/immagini esterne per avere un senso compiuto, che siano esse sempre fanart o di terzi.\n\n**_\n\n> **La Durata:** Da oggi, 25/12/2017, al 3/01/2017 a mezzanotte. La premiazione avverrà nei giorni immediatamente successivi, a seguito della votazione.\n\n**_\n\n> **Il Metodo di Scelta del Vincitore:** Al termine del periodo valido, tutti i Partecipanti al contest saranno tenuti a votare una singola storia (esclusa la propria), a loro scelta se in privato o in questo thread. Io personalmente aggiungerò il mio voto, dal valore di 2 (se a 5 Partecipanti) o 3( se a 10+ Partecipanti) ad una delle storie. La storia che avrà totalizzato più voti riceverà il primo premio. In caso di pareggio è possibile che venga richiesta una seconda votazione ai partecipanti.\n\n> Al fine del Contest, Upvote e Downvotes non avranno alcun valore.\n\n**_\n\n**Commenti Finali:** Questo è un esperimento. E' possibilissimo che questo post sia tempestato di downvotes e lasciato abbandonato, ma sono pronto anche a quel risultato se non altro come dimostrazione del \"clima\" qui presente. Non credo andrà così, in quanto sono convinto che nonostante tutto questa boards siano l'ambiente giusto per far rinascere, pezzo per pezzo, una community. Pertanto, anche se so benissimo che quello delle fanfiction è un argomento di estrema nicchia, invito chiunque (anche i più dubbiosi), se non a cimentarsi almeno a condividere il tentativo.\n\n\n**_\n\n**Lista attuale dei partecipanti:**\n\nDantazzo\nChernobogH\nCommonDotaPlayer\nSideshowEMS\nSickAnto\nMatteo00\nSahira94\nVicarioAmelia\n\n**Stato del Contest:** Attivo, avendo raggiunto la quota di 5 partecipanti minimi! Ricordo che a 10 si aggiungerà anche un premio per il secondo classificato.","replies":[{"poster":"HaIIeIujah","date":"2017-12-25T20:34:55.653+0000","up_votes":6,"down_votes":0,"body":"Rimarrò disponibile qui e dal Client ( o meglio, dall'App) per rispondere a qualunque curiosità. Se possibile chiederei di mantenere i commenti che non consistano di storie in risposta a questo, così da lasciare il resto del thread libero.\n\nPer chi volesse partecipare ma non avesse ancora scritto, potete tranquillamente commentare ed editare più in avanti.\n\nBuona fortuna!","replies":[]},{"poster":"HaIIeIujah","date":"2018-01-03T11:09:06.157+0000","up_votes":4,"down_votes":0,"body":"Siamo a 8 partecipanti e mancano circa 12 ore alla chiusura del contest.\n\nDato che ognuno degli scrittori dovrà poi votare una delle altre storie, invito chi può a mettersi avanti leggendo le entry degli altri partecipanti, così da iniziare già a farsi un idea.\n\nPer chiunque fosse ancora indeciso sul partecipare o meno, arrivati a 10 partecipanti si aggiungerà un premio per il secondo classificato - e ce ne mancano soltanto due, quindi inseritevi pure.\n\nQuesto commento e post verranno aggiornati stanotte, ma in ogni caso qualunque storia pubblicata oltre le 00:00 non sarà più ammissibile.","replies":[]},{"poster":"Sahira94","date":"2017-12-30T13:55:33.364+0000","up_votes":4,"down_votes":1,"body":"Eccomi con la mia storia, la quale è stata modellata tantissimo pur di farla rientrare nel limite. Dovremmo essere precisamente a 3500 battute, non contando il titolo!\nSpero che, seppur alcune cose siano lasciate all'immaginazione del lettore, si capisca il fulcro di ciò che volevo dire e... buona lettura!\n\n**Fidati di me**\n\n_**“So che hai giurato di non lavorare mai più con qualcuno di cui non avessi piena fiducia”\n“Ah, sì?”\n“Infatti non mi ascolti”\n“Lavoro bene da sola. E diaaamine se funziona!”**_\n\nLa cima del tondo Rising Howl era appena svanita sotto Via del Salto, verso Zaun. La fuggitiva si fermò prima dello strapiombo che divideva Piltover e guardò indietro, incrociando divertita gli occhi fucsia con quelli infuriati e ametista della sua inseguitrice.\nSenza pensarci due volte, volse lo sguardo verso il baratro del canyon ricolmo del Grigio fumo della città e balzò giù con uno strillo eccitato.\n«Ehi Vi!!!»\nQuesta si sporse a controllare oltre il precipizio: sul tetto della carrozza hexdraulica Jinx sbracciava per lei, puntando Zapper contro i passeggeri sotto.\nLo stridio dell'ascensore si faceva sempre più lontano mentre scendeva.\nQuante volte da bambina lo aveva cavalcato pur di farsi un nome con quel folle rito di passaggio?\nSorrise e cadde tra le tre colonne di supporto dell'ascensore, ignorando le urla di Caitlyn.\n\n_**“Sicura come il Grigio segue il giorno?”\n“No”\n“Ecco. Ti fidi solo di te stessa, e nemmeno troppo”**_\n\n«Così mi piaci CiccioBomba!» \nQuel salto terminò qualche metro più giù; atterrò in ginocchio lasciando che il peso venisse scaricato sui guantoni. Questo crepò la vetrata, rendendola pericolante.\nAlzatasi fece un passo indietro, esalando un sospiro agitato e sbranando l'altra con gli occhi.\n«È finita, stronza»\nL'una di fronte all'altra come in un maledetto deja vu, Jinx le puntò Zapper contro. Sembrò titubare nel premere il grilletto e Vi aveva bisogno di tempo perché la corsa si potesse arrestare alla fermata.\n«Non mi spari?»\n«Non è divertente se non esplode!»\nLa mano corse sulla schiena.\n«Infatti...> Rise. «Se Fishbones deci-»\nUn raggio dall'alto esplose in una rete d'energia che la costrinse a terra per l'urto e si aggrappò ad una grata stringendo il lanciarazzi. \nCait urlò qualcosa ma Vi la ignorò, provando a fare un passo in avanti.\n«Aspetta che ti metta le mani addosso...»\nJinx sghignazzò scossa dalle convulsioni ma ad un tratto la sua determinazione annientò la rete elettrica in cui era stata intrappolata e sollevò tremante la testa, fulminandola con occhi lucidi misti di follia e rabbia pura.\nZapper era precipitato nel vuoto.\n«Mi-iss Cil-in-dro»\nCon difficoltà iniziò a muoversi per usare Fishbones. \n“Non di nuovo”\nVi si mosse poggiando un piede sul vetro crepato. Non se ne accorse, ma mise troppo peso per darsi quello slancio.\nLa situazione precipitò.\nLetteralmente.\nIl vetro si ruppe e cadde addosso a Jinx, la quale si sforzava di puntare l'arma in alto. Rotolarono, cercarono inutilmente di afferrare qualcosa che fermasse la discesa.\nAnche la parete rocciosa sembrava farsi beffe di loro, vicina eppure lontana.\nIl terrore nelle loro urla annunciò il loro impatto.\n\n_**“Hai paura”\n“Di?”\n“Di rimanere sola ancora una volta”**_\n\nSarebbe morta così, tra le grigia braccia di Zaun ammirando le luci lontane di Piltover come la vera zaunita che era?\nAi Forzieri dell'Eclisse il mondo le era crollato addosso ma qui non c'erano nascondigli, neanche raschiare le pareti nel disperato tentativo di aggrapparsi a qualcosa era servito.\nAccecata da quella consapevolezza chiuse gli occhi.\n“Non voglio morire...”\nEra finita.\n\n_**“Caitlyn...”**_\n\nSentì un'esplosione vicina, il fumo le bloccò il respiro ed ebbe un pensiero istintivo, inutile date le circostanze.\n“Ho bisogno di...”\nAria.\n“Janna. Janna ti prego”\nIl vento rispose al richiamo e il fumo si diradò schiarendo la vista sulla carrozza lontana.\nLi aveva salvati.\nEra stata perfetta.\n\nUn raggio rosso sul petto.\nUno sparo su un fianco lontano.\nCi mise un po' a capire che no, non sarebbe morta, che quelle convulsioni elettriche e il dolore per l'essere stata spinta contro la parete di un'alcova scavata sulle rocce significavano salvezza.\nScoppiò violentemente a ridere, piangendo.\n\n**_“...grazie per avermi sparato”\n“Brusco e violento, come piace a te”\n“Già. Mi spingo fino all'autodistruzione, metto loro prima di me. È inevitabile e gli errori mi perseguitano”\n“Vi. È... siamo una bilancia. Come dicevi?”\nLe porse un pugno.\n“Lavoro di squadra?”\n Vi esitò, ma sorrise e porse il suo._**\n\n**_“Lavoro di squadra”_**","replies":[{"poster":"HaIIeIujah","date":"2017-12-30T14:42:35.898+0000","up_votes":2,"down_votes":0,"body":"Con esattamente 3500 battute, questa storia è ammessa! Grazie per la partecipazione.","replies":[]}]},{"poster":"Apostasis","date":"2018-01-02T22:37:11.958+0000","up_votes":2,"down_votes":1,"body":"Non credo sia venuto molto bene, ma ho voluto fare un tentativo. Fantastica iniziativa!\nIl soggetto della storia riguarda la discesa nella follia di Renekton ad opera di Xerath, enjoy(?).\nDovrebbero essere esattamente 3498 battute, ma se ho contato male accorcerò entro domani affinché rispetti i parametri.\n\n\nBuio. Buio ovunque. Un rumore serpeggia nell’aria, o forse è nella mia testa? Lo sento, un suono irregolare, pesante, affannoso e trascinato, almeno credo: i miei passi?\nSi, solo l’eco della mia prigionia mi è compagno, sepolto in questa…stanza? Non saprei più dove sono sepolto, forse lo sto solo immaginando, o forse sono vittima di un’incessante silenzio maledetto…\n“Non dimenticare le tue colpe, Guardiano; migliaia di persone, grida fra le sabbie insanguinate, credevano in te, invocavano il tuo nome…”.\nMa io ho un nome? Tutto ciò che ricordo è il sangue. Io vivo per le battaglie e…ma sono vivo? Cos’è questa necessità di ammazzare e sviscerare? Non ricordo, solo urla mi abbracciano da ogni lato.\nChissà se la Voce può sanguinare?\nDovrei ricordare, ma non riesco a concentrarmi, questa Voce mi fa impazzire. Il richiamo del sangue è troppo forte. Distruggere, qualunque cosa. Ma non c’è niente che possa gridare, se non il riverbero dell’eco, che rimanda indietro i miei versi furiosi.\n“Fai pena cosi, un tempo eri un Guardiano di Shurima, ed ora sei solo una bestia priva di senno. Non ricordi nulla, o possente Asceso? Non ricordi il giorno in cui cadde il Sole? Non ricordi-”.\n“SILENZIO!”\nSmettila! Smettila di parlare! Mostrati e affrontami!\n“Non ti ricordi di Nasus, Renekton? “\nIn un attimo, un singolo furioso attimo, ricordo: quel giorno maledetto, la corsa, una figura di energia bluastra, la lotta, quel volto da sciacallo…\n“Fratello…”\n“Fratello? Hai dimenticato cosa ti ha fatto? Hai dimenticato il suo tradimento? È stato lui a rinchiuderti in questa tomba!\n“Gli ho detto io di farlo! Per proteggere Shurima-“\n“Sei patetico! Sai benissimo che voleva solo seppellirti fra queste mura silenziose, sai benissimo che è sempre stato invidioso di te, che non ha mai voluto condividere la sua Ascensione, che è stata la sua paura a portare a questa tua reclusione! Ed ha approfittato della tua caduta per rovesciare sul tuo nome la colpa di quel disastro, si è solo approfittato di te! E tu sei bloccato in questa fossa, in questa tomba a pagare per le SUE colpe…dà sfogo alla tua sete di sangue e prenditi la tua vendetta!”\nOdio questa voce sibilante. Odio tutto quello che dice. Odio che abbia ragione. Odio. Odio non essere in battaglia, a massacrare soldati con la mia ascia. Ascia? Forse è solo una memoria lontana…No, non posso esserne sicuro. Ho dei ricordi, sfocati, a tratti sfuggono, mi sembra di non riuscire a ricordare qualcosa di importante, come se fosse la mia memoria e non io ad essere avvolto dall’oscurità…\n“Io ti offro ciò che desideri, Renekton…presto saremo liberi da questa tomba, ed io ho intenzione di restituirti ciò che quel cane ha rubato!”\nQualcosa è diverso. Le ombre si allungano senza luce.\n“Onore!”\nC’è qualcosa. Un lampo blu si rivela dall’interno di una cassa. Un sarcofago forse?\n“Gloria!”\nQuesta odiosissima voce proviene da lì. Che sia...Xerath? Possibile?\n“Massacro!”\nMa alla fine cosa importa? Finalmente qualcosa da distruggere!\nScatto. Non è altro che cibo per la mia arma! Finalmente attaccare qualcosa di soli-  Bruciore, intenso.\nSabbia sgorga dal braccio. Non riesco a muovermi. Immagino di provare dolore, ma non provo nulla oltre che rabbia. Voglio saziare la sete della mia lama. Ma non riesco. Perché?\n“Sai bene che sarebbe inutile attaccarmi. Non siete riusciti ad uccidermi allora, non ci riuscirai tu da solo. Anche tu lo sai, altrimenti perché ti saresti fermato?”\n“Sono i tuoi trucchetti, stregone da quattro soldi! Lasciati annientare!”\n“Ma io non ho fatto nulla, se non mostrarti la verità. ”\nOdio questa dannatissima voce.\n“Io ti offro ciò che desideri”\nOdio queste menzogne.\n“Chiedo solo che tu mi offra la tua forza.”\nOdio…\n“Ed in cambio la vendetta sarà tua!”\nOdio che abbia ragione.\n“Renekton, io ti libererò dalla schiavitù della vendetta. Tu combatterai per me.”\nBuio. Furia. Vendetta. Sangue. Fratello…traditore.\nRuggisco alla stanza buia.\n“Io non ho un nome, ma ho un solo obiettivo, massacrare quel maledetto sciacallo e far sì che ogni granello di sabbia sia ricoperto del suo dannato corpo! Io non sono il tuo servo, né tantomeno il tuo generale! Io sono il Macellaio delle Dune!”.\nFuria.\nFinalmente libero.","replies":[{"poster":"Matteo00","date":"2018-01-03T01:07:26.863+0000","up_votes":2,"down_votes":0,"body":"> Ruggisco alla stanza buia.\n\nIl coccodrillo come fa?!!!","replies":[]},{"poster":"HaIIeIujah","date":"2018-01-02T22:57:10.289+0000","up_votes":2,"down_votes":0,"body":"Confermo le 3498 battute ed accetto la storia nel contest. Grazie per la partecipazione!","replies":[]}]},{"poster":"SpaghettiWestern","date":"2017-12-26T00:11:27.724+0000","up_votes":1,"down_votes":4,"body":"Figli miei, prima di condurvi in questa ultima battaglia, voglio raccontarvi una storia che mio padre era solito raccomandarmi vicino al fuoco del nostro accappamento. Disse Nagan, il prode condottiero dei \"Lupi\", una delle più antiche e feroci tribu barbare esistite in quell'era lontana.\n\n\"Parla, amico mio, come tu sai, noi non abbiamo paura della morte, e combatteremo fino all'ultimo questo nemico, anche se so il motivo del tuo racconto\". Disse Mosin, il suo braccio destro.\n\n\"Bene allora\", Nagan iniziò a sedersi vicino al fuoco, mentre la tempesta e la scarsa luce della luna illuminavano il bivacco.\n\n\"Un tempo, questa terra che conosciamo oggi come \"Freljord\" era un luogo florido e pieno di vegetazione, la selvaggina non mancava mai, quasi sembrava non accorgersi delle trappole che lasciavamo...\"\n\n\"Bei tempi Nagan, loro però...\" ,\n\nuna gomitata interruppe Mosin prima di finire, \"Non affrettarti Mosin, ricordati, le vecchie storie vanno raccontate dall'inizio, o perdono il loro significato come lo svanire del tempo\". Disse Nagan, mentre ravvivava il fuoco.\n\n\"Ti prego padre, continua il tuo racconto. Potrebbe essere l'ultima volta, e lo sai bene.\" disse il giovane guerriero.\n\n\"Sei sempre stato così impulsivo figlio mio.. mi ricordi sempre lei, devo dirlo, saranno anni ormai che ci ha lasciato soli, ma ha rimasto un impronta indelebile. Quasi come quella ferita di mazza di Puro Ghiaccio {{champion:48}} . Fanno sempre male!\", ridacchiò Nadan.\n\n\"Per favore padre, ho uno strano presentimento nel cuore, e non voglio che questo mi trattenga in battaglia\". Disse Il guerriero, ed iniziò a guardare Nagan con occhi gonfi di ira e di rammarico.\n\n\"Va bene, dunque, come dicevo prima, questa era una terra fertile, e non esistevano queste enormi \"guerre\" tra tribù, ci si limitava a far combattere solo i migliori guerrieri per far valere le proprie ragioni, vero Olaf?\"\n\n\"Certo, per me era tutto quello che potevo desiderare, sai benissimo come sono!\". Quasi per magia, un grosso guerriero apparve alle spalle di Nagan... {{champion:2}} \n\n\"Inoltre, ti ricordo anche che per tradizione, anche tuo figlo avrebbe dovuto partecipare\", finì lui, ridendo impunemente.\n\n\"Ma sentilo, non sei nemmeno riuscito ad uccidere uno di quei \"mostri\", e vorresti sfidare Tryndamere?, bah, i giovani sono sempre più imprudent..\" Mosin non riuscì a terminare la frase, in un attimo, delle strane figure color rosso violaceo irruppero nell'accampamento.\n\n\"Finalmente ci si diverte!\" esclamo il Berserkr, lanciandosi come un indemoniato su uno degli esseri, facendolo a pezzi con le sue asce. \n\n\"Come è possibile?, i Darkin sono entrati e le sentinelle non ci hanno avvertito?\" disse un Mosin stupito.\n\n\"Non preoccuparti delle sentinelle, e proteggi mio figlio e lui che vuole...\" \n\nmentre Nagan terminava la frase, i fumi dei fuochi oscurarono la vista, e, pochi attimi dopo, era scomparso.\n\n\"Padre, PADRE!!\" , urlando, il giovane Tryndamere iniziò a crearsi un varco con la sua spada, uccidendo senza pietà alcuna tutti gli avversari che gli si paravano davanti. \n\n\"No, non adesso, non davanti a lui, affrontami, sono perfetto per TE...\" {{champion:2}} \n\nOlaf non poteva crederci, aveva aspettato tutta la vita per quel momento, non poteva fallire, doveva affrontare lui la Lama, doveva ucciderlo lui, non poteva farlo fare ad un ragazzino come Tryndamere, non doveva farglielo fare, non ne avrebbe retto il peso..\n\nLa pioggia iniziò a scendere sulle rovine del villaggio oramai in fiamme, un vento gelido inizio a spazzare via il fumo che aveva oscurato il campo fino a quel momento della battaglia..\n\n\"Chi, o cosa sei tu?\" Tryndamere rabbrividì per la prima volta nella sua vita, auguzzando lo sguardo per vedere la creatura.\n\n\"Io sono colui che ti porterà a governare il freljord, non lo desideri?, guarda questo villaggio, guardalo.. non ho fatto vittime tra i tuoi guerrieri per farti fare una scelta... Preferisci seguirmi, o morire qui, solo e dimenticato?\"\n\n\"Non ho paura di un semplice Darkin, dovresti saperlo\" incalzò Tryndamere, stringendo bene la sua spada.\n\n\"Davvero?, allora prova a ferm..\" l'oscura figura non riuscì a finire, che un accetta volante le taglio un pezzo d'ala.\n\n\"Finalmente faccia a faccia, volevo divertirmi ancora con voi Darkin, ma non siete resistenti alle mie asce, eppure ci sono andato leggero ahah\"\n\nalle spalle del vichingo, erano presenti numerose carcasse di Darkin minori, nulla comparati al loro signore, ma la Lama dei Darkin era impressionata.\n\n\"Hai ucciso quasi tutto il mio esercito da solo, sono estasiato, voi umani non cambierete mai, vivete solo per la bramosia della battaglia e della gloria, paura di essere dimenticati?\" , con un tono serpentino, l'agile figura volò in un attimo vicino al Berserkr, colpendolo con la sua lama affilata.\n\nOlaf parò il colpo, ma non la magia che si celava dietro\n\n\"Non posso cadere così, non posso..\" Quasi in un attimo, la vita di Olaf gli passò davanti, non riusciva a crederci, aveva forse trovato un degno avversario?..\n\n\"Vedi?\" ridacchiò Aatrox \n\n\"non sei degno di ricevere questo dono, non hai la RABBIA necessaria a sfruttarlo, sei solo un povero guerriero che finirà solo e dimenticato, ricordatelo!\"\n\n\"Lui non ha bisogno di alcun potere come il tuo, e nemmeno io\"\n\nCon il cuore carico di paura, ma anche di rabbia, Tryndamere si lanciò contro l'oscura figura, ma ad ogni colpo, si sentiva \"diverso\", non sentiva l'odio dell'oscura figura, non ne sentiva la follia omicidia, i movimenti delle loro spade sembravano una danza, quasi un \"gioco\", come un allenamento tra padre e fig... \n\nTryndamere si ridestò da quella schermaglia che gli sembrava ipnotica.\n\n\"PADRE, SEI TU?\"\n\n\"Sono ancora qui, per adesso\" rispose la strana creatura.\n\n\"Come è possibile?, cosa ci fa lui dentro di te?\"\n\n\"Era quello il motivo del mio racconto.\" disse Nagan, riuscendo a riprendere il controllo del Darkin, seppur solo momentaneamente.\n\n\"Quando la strega dei ghiacci cerco di risvegliare i guardiani del gelo, noi delle tribù ci accorgemmo che questo avrebbe portato solo rovina ai nostri popoli, e iniziammo a prepararci per l'imminente guerra, finchè non arrivò lui, che cambio tutto..\"\n\nIl controllo sul Darkin iniziò a vacillare, l'arma incominciò a prendere di nuovo possesso di Nagan, ricoprendolo quasi interamente\n\n\"Ho fatto solo quello che mi avevano chiesto, e adesso, sono venuto a reclamare la mia ricompensa. Ricordati Tryndamere, verrò anche per te un giorno.\"\n\nCosì come era arrivato, la lama dei Darkin sparì, lasciando un giovane guerriero solo, ma motivato nel suo intento.\n\n**THE END**\n\n\n**BONUS CLIP:\n**\n\"Ehy, cosa ti prendo dal nostro bravo gragas\"? disse Olaf {{champion:2}}\n\n\"Una birra\" disse Tryndamere {{champion:23}} \n\n\"FA PARTIRE LO SPOT\" disse Brolaf.\n\nhttps://www.youtube.com/watch?v=JehBDmQ3Q3s&t=0m58s\n\n\n\nP.s Non mi denunciate, mi raccomando.","replies":[{"poster":"HaIIeIujah","date":"2017-12-26T00:28:55.273+0000","up_votes":1,"down_votes":0,"body":"Nessuna denuncia, ma conto piu’ di 5000 e passa battute, quindi la storia e’ di molto sopra il limite consentito per adesso e non posso accettarla.","replies":[{"poster":"SpaghettiWestern","date":"2017-12-26T00:51:55.454+0000","up_votes":1,"down_votes":1,"body":"figurati, è un bozzetto questa qui >.>\n\nuso questo sito per conteggiarlo https://wordcounter.net/","replies":[{"poster":"HaIIeIujah","date":"2017-12-26T01:13:26.924+0000","up_votes":2,"down_votes":0,"body":"Il risultato e’ uguale. E’ possibile che tu abbia confuso parole con battute ( ovvero caratteri)?","replies":[{"poster":"SpaghettiWestern","date":"2017-12-29T19:49:24.764+0000","up_votes":1,"down_votes":2,"body":"no, non avevo confuso.\n\nComunque, non partecipo al contest, mi andava semplicemente di scrivere una storia.","replies":[{"poster":"HaIIeIujah","date":"2017-12-29T19:54:52.096+0000","up_votes":1,"down_votes":0,"body":"...e allora come mai l'hai pubblicata sotto il contest, e non su un tuo thread?","replies":[]}]}]}]}]}]},{"poster":"Kim114","date":"2017-12-26T00:10:52.728+0000","up_votes":1,"down_votes":0,"body":"Devo scrivere una storia, pla addami, ma qui in questo posto o un altro? La domanda la devi ancora fare su dove si basa la storia o ho tralasciato qualcosa?","replies":[{"poster":"HaIIeIujah","date":"2017-12-26T00:26:43.838+0000","up_votes":2,"down_votes":0,"body":"La storia, una volta completata, va postata qui come ha fatto KillAhri. Il tema e’ a tua scelta, con la condizione che rispetti coo che e scritto nel regolamento. Per “addatemi” intendo da League, per permettermi di organizzare la votazione piu’ tardi.","replies":[]}]},{"poster":"ChernobogH","date":"2018-01-04T10:55:47.013+0000","up_votes":3,"down_votes":1,"body":"Io voto Sahira94","replies":[]},{"poster":"SickAnto","date":"2018-01-04T10:00:45.780+0000","up_votes":3,"down_votes":1,"body":"Voto Sahira94, onestamente penso sia la migliore tra tutte, molto bella e rispetta perfettamente la caratterizzazione dei personaggi. Si vede che ci ha messo molto impegno.","replies":[]},{"poster":"Dantazzo","date":"2017-12-28T11:54:12.895+0000","up_votes":4,"down_votes":6,"body":"Titolo: La Lore\n\nEravamo un gruppo strano, Zed, Syndra, Jinx, Poppy, Gangplank, ed io , Nasus. Non avevamo niente in comune tranne la nostra missione, rovesciare il dispotico governo di Kcaic, era salito al potere sfruttando l'assenza della nostra beneamata regnante Katarina, sfruttando la sua abilità nel combattere battaglie immaginarie contro un regime imposto da lui stesso nella sua testa, era anche famoso per le sue multiple personalità, tutte irritanti. \nCosì partimmo alla volta del suo castello, ma la strada ci fu presto sbarrata dal suo scagnozzo Ottosirli, era famoso per introdursi la notte nelle case delle persone brutte ed emettere fragorosi peti, più brutta era la persona più forte era il peto, c'è chi dice che lo facesse per eccitarsi, altri che lo facesse perchè è deficiente. In ogni caso ci sbarrava la strada, dovevamo riuscire ad oltrepassarlo, per nostra fortuna in quel momento Urgot passò di lì, non dovemmo fare altro che fargli tirare una martellata da Poppy per spedirlo il più lontano possibile nel cuore della foresta, Ottosirli lo seguì immediatamente, emettendo fragorosi peti e probabilmente facendo appassire una buona parte di foresta, alcune leggende narrano che Maokai fosse in principio un comune albero, animatosi per sfuggire al quel tanfo.\nLiquidato il tirapiedi proseguimmo per la nostra strada, finchè non trovammo un uomo, nessuno di noi conosceva il suo vero nome, ma era noto come il Pro faggot, ci offrì il suo aiuto, ma mentre stavamo per ripartire vide passare un uomo con tutti gli accessori fatti di diamante, senza pensarci lo seguì dicendo \"Scusate ragazzi, il dovere mi chiama\" e si mise a seguire l'uomo, ovviamente con una mano nei pantaloni, non ci stupimmo troppo, alla fine era noto per quello.\nDopo alcuni giorni di viaggio e numerose situazioni da fan service, soprattutto riguardanti le palle di Syndra e la pazzerellosità di Jinx, ci ritrovammo di fronte alle porte del castello di Kcaic, non saremmo mai potuti entrare, la porta era protetta da un incantesimo, si sarebbe aperta solo recitando una formula magica nota solo agli adepti di Kcaic, fu allora che Zed, in preda a vari sproloqui, disse \"Mio dio ma sono circondato da idioti, io faccio sempre tutto, voi non fate mai nulla, sembra di essere alla fiera dell'autismo lituano\" a quel punto la porta si aprì, Zed trionfante disse \"AH AH visto ragazzi? Sono un genio\" dopo quelle parole la porta si richiuse subito. Confusi cercammo di capire il perchè, finchè a Gangplank non venne l'idea \"Un momento\" disse \" Queste porte sono state incantate da Kciac ed i suoi seguaci, forse si aprono solo quando sentono qualcosa di stupido\" a quel punto tutti in coro tutti in coro urlammo \"Resto sempre indietro per colpa del gruppo!!\" le porte si spalancarono immediatamente, entrammo nel castello.\nLe guardie di Kciac provarono subito a sbarrarci la strada, per fortuna erano state personalmente addestrate da Kciac, quindi ci trovammo a fronteggiare: soldati che tenevano la spada al contrario, maghi che provavano a fermarci col gioco delle 3 carte, perdendoci pure,  strateghi che sostenevano che il nostro punto debole fosse che avremmo potuto ucciderli solo una volta sola. Non era un bello spettacolo insomma. Finchè non giungemmo alla sala del trono Kcaic era lì, seduto sul trono, con un ghigno stampato sul volto. \"E' finita\" dissi \"Hai perso, il tuo emh... esercito è stato sconfitto, la tua fortezza conquistata, non hai più niente\" Kcaic rispose \"Ho ancora l'elemento della sorpresa\" a quel puntò tirò una leva, che lo fece precipitare in una vasca piena di squali armati di laser sulla testa che prima lo cossero a puntino e poi se lo mangiarono. \"Kappa\" fu la reazione generale, non potemmo fare a meno di notare che gli squali risultavano nettamente più stupidi dopo aver mangiato Kcaic, alcuni di loro provarono a camminare sulla terraferma, altri mandarono dei curriculum alla EA.\n\"E' finita\" disse Syndra, \"No\" risposi \"Ora dobbiamo trovare Katarina\".","replies":[{"poster":"HaIIeIujah","date":"2017-12-28T12:08:26.440+0000","up_votes":2,"down_votes":1,"body":"Con 3318 battute, questa...particolare...entry viene accettata. Grazie per la partecipazione... immagino?","replies":[{"poster":"Dantazzo","date":"2017-12-28T12:16:50.125+0000","up_votes":3,"down_votes":1,"body":"Grazie, sono qui per vincere. Bel concorso comunque complimenti.","replies":[]}]}]},{"poster":"A Yordle ln Heat","date":"2017-12-26T10:31:42.137+0000","up_votes":5,"down_votes":4,"body":"Questa storia, che ho intitolato \"**Il Pistolero delle Ironspike Mountains**\" è una storia che presenta un conflitto tra {{champion:202}} Jhin, {{champion:35}} Shaco e {{champion:203}} Kindred.\n\n___________\n\nRaramente tempeste di quel calibro imperversavano fino a valle, superando i confini del Frejlord solo per crollare contro le pianure a sud di Piltover; era da molto che non si vedeva una cosa simile, un gigantesco mare bianco che dal cielo arrivava alla terra, ghiacciando qualsiasi cosa sul suo cammino. Anche i più possenti guerrieri high-tech della zona si erano rintanati tra le case e gli ostelli pur di non dover affrontare la gelida brezza proveniente da Nord Ovest; non sapevano, però, che in mezzo a quel bianco mare imperversava una minaccia ancor maggiore. \n\nUna figura si faceva strada sui vialetti di terra scavata della zona rurale, diretta più in là, verso le Ironspike Mountains. Il suo passo, lento e ritmico, quasi ipnotico, gli dava un'aura surreale: come poteva muoversi in quel modo mentre affrontava la furia del Frejlord? Ma soprattutto, che cos'era? Già i più timorosi religiosi della zona, che spiavano l'essere dalle finestre congelate, pregavano che si trattasse di uno spirito benevolo ... Ma le loro preghiere si strozzavano nelle loro gole quando, ad intervalli casuali, il mantello dell'entità si alzava rivelando un'enorme pistola, le cui incisioni in oro illuminavano il suo cammino.\nRaggiunta una piccola grotta ai piedi del bosco, l'entità si lanciò al suo interno e, con la stessa grazia che aveva invaso ogni sua singola mossa fino a quel momento, rimosse la sua tunica: una pioggia di piccoli coltelli e dardi scivolò giù dalle sue vesti. Molte lame avevano trafitto la carne, ma l'essere non sentiva dolore. Bensì, sentiva solo quella risata malefica rimbombare nelle sue orecchie. Pensava sarebbe stato facile, e bellissimo: cosa c'è di più ironico, triste, esilarante, doloroso ed inebriante della morte di un giullare? Quel malefico giullare, però, era ancora meno umano di lui.\n\nI suoi pensieri vennero interrotti da un leggero trottare sulla neve, diretto verso la sua posizione. Non poteva essere il giullare, perché questo non avrebbe mai affrontato i quattro proiettili d'oro del pistolero a viso aperto. Era qualcos'altro, una figura il cui manto bianco si confondeva con lo scenario innevato. Aveva un arco, e un lupo al suo fianco, e una maschera nera, e un intento divino.\n<<Puoi fare una scelta, Khada Jhin.>> un lampo blu ricoprì l'arco della bianca agnellina, e una freccia si materializzò tra le sue dita.\nIstintivamente, Jhin si rialzò in piedi e si guardò il petto. Molti più coltelli di quelli che aveva notato prima erano conficcati nel suo ventre, e di colpo riuscì a percepire la pungente presenza di quelli conficcati nella sua schiena. Il Virtuoso aveva capito chi era l'essere che lo stava sfidando, e per quanto lo stesse facendo controvoglia, stava lentamente accettando di essere stato sconfitto da un mero giullare.\n\n<<Il tuo tempo qui è finito. Getta le armi e mostra il petto, e il dolore di quelle lame non trafiggerà più né il tuo corpo, né il tuo orgoglio.>> ma il pistolero aveva altri piani. Aveva realizzato che occasione aveva per le mani.\n<<Uno.>> il primo proiettile partì, diretto per l'agnellina, ma questa balzò via.\n<<Due.>> un altro proiettile diretto verso la maschera nera. Un secondo balzo salvò Kindred.\n<<Tre.>> questa volta, il proiettile finì dritto per terra. Un altro coltello, apparso ora dal nulla, comparve nell'avambraccio di Jhin, mozzandogli i tendini delle dita. Impugnò la pistola con l'altra mano. Il lupo partì a fauci spalancate verso di lui.\n<<Quattro!>> il proiettile colpì il lupo, ma lo trapassò senza arrecargli danno. E fu allora che, nella più completa sorpresa di Kindred, Jhin afferrò la testa del lupo e, invece di trattenerla, la reindirizzò verso i suoi stessi organi vitali: i denti affilati trapassarono quel che rimaneva della sua armatura, e cacciarono furiosamente via gli intestini del Virtuoso.\n\nGli schizzi di sangue, come i brandelli di osso e carne, formarono bellissime costellazioni simmetriche sulla neve, mentre tra una risata e l'altra Jhin esalava l'ultimo respiro. Quella sera avrebbe creato una morte bellissima, e se il giullare non poteva dargliela, avrebbe preferito morire in agonia piuttosto che privare il suo pubblico di un gran finale.\n\n____________________\n\nSenza contare i doppi caporiga (che ho messo per migliorare la leggibilità) sono un totale di 3498 caratteri (spazi esclusi).\nSe questo da problemi posso toglierli e lasciare dei caporiga \"standardizzati\", ma nuocerebbe gravemente alla leggibilità. :p\n\nL'ho scritto in fretta e furia, quindi potrei tornare successivamente per correggere qualche possibile errore grammaticale che non sto notando in questo momento.\nHave a good read. :3","replies":[{"poster":"HaIIeIujah","date":"2017-12-26T10:41:36.481+0000","up_votes":3,"down_votes":1,"body":"Come gli spazi, i caporiga non sono considerati nelle battute. Grazie per la partecipazione, e buona fortuna!","replies":[]}]},{"poster":"ChernobogH","date":"2017-12-27T16:34:12.631+0000","up_votes":5,"down_votes":4,"body":"Beh, eccomi qua, dopo taaaanto tempo e per partecipare al contest. Spero che questa misera storia basti\n\nLa caccia selvaggia\nQuella notte, se si poteva dire appartenere ancora al mondo mortale, era diventata un incubo per quegli stolti demaciani che avevano osato avventurarsi oltre il palese pericolo.\nNessuna stella aveva avuto il coraggio di presentarsi nel cielo e solo la luna piena squarciava la volta celeste. Ma era una luna innaturale, dello stello colore delle fiammate blu che violentemente come bestie feroci stavano consumando il bosco. L'indomita avanguardia, capeggiata dal comandante Garen Crownguard, forse aveva compreso il vero significato della parola terrore: i loro cuori battevano così forte che per poco non avrebbero sfondato la gabbia toracica e armatura. I cavalli correvano vincendo il peso della bardatura e dei loro fantini spinti dal più primordiale degli istinti.\n<<Restate uniti!>> Gridò il comandante. Già una buona fetta di uomini si era separato, con la strada tagliata da quelle fiamme spettrali, il fumo e le grida terrificanti non facevano altro che preoccuparlo sempre di più: se c'era una minaccia era meglio affrontarla assieme. \n\n<<Aiutami!>> Gridò il soldatino ammantato nella latta mentre corre verso il compagno. Il mastino che stava affossando poco fa le zanne nel cavallo del mortale ora cambia bersaglio esortato dai suoi padroni oltre alla nebbia e le fiamme spettrali nella boscaglia. Un corno da caccia risuonò distante e il rumore di zoccoli non mortali si facevano sempre più fitto e possente. Il mastino, uno spettro orribilmente dilaniato e trasmutato di un mastino almeno, si gettò sul guerriero appiedato ma il compagno ancora cavallo riesce ad intercettarlo con la lancia. Un tronco crollò, sintomo che i cavalieri della caccia si stanno avvicinando. Il terrore si iniettò negli occhi dei mortali. Il guerriero a cavallo esortò la cavalcatura anch'essa terrorizzata a fuggire abbandonando il compagno alla disperazione. Il guerriero appiedato corse o almeno ci prova, prima che qualcosa di tremendo possa spaccare l'ultima barricata consumata dalle fiamme. Un centauro, un orrore di ferro e fiamme scattò verso il demaciano. L'alabarda in quell'istante compie un unico fluido movimento dal basso in destra verso la sinistra in alto, il corpo tagliato a metà nella vita venne gettato d'avanti al cavaliere spettrale che con un fendente dall'alto non esita a separare ancora di più la vittima della sua caccia. Un sadico sorriso si forma sul volto di Hecarim. Non perde velocità: tutto questo attacco è stato compiuto nel battito di ciglia necessario per far posare gli zoccoli sul terreno prima di essere portati ancora avanti. La boscaglia ai lati viene spaccato da cavalieri spettrali: carne consumata, ossa esposte e metallo fuso con il corpo erano i dettagli dei cavalieri e cavalli che ora accompagnavano Hecarim, un tempo coraggiosi guerrieri, ora cavalieri della sua Caccia Selvaggia. Lontano da lui risuonò un altro corno da caccia. La bocca di Hecarim, un orribile ammasso di denti senza labbra si contorse ancora di più in quello che dovrebbe essere un sorriso: la caccia non era assolutamente finita e stava per diventare più interessante.\n\nGaren pose il piede sulla carcassa non morta estraendo lo spadone poco fa usato per un affondo. Il suo corpo era ricoperto dal sudore e dal sangue, il terreno lo circondava con legname ancora bruciante e le carcasse dei suoi soldati e dei cavalieri spettrali. La respirazione aumentava sempre di più mentre il rumore delle grida e degli zoccoli aumentava. Ora li vedeva: vide i cavalieri accompagnati dai loro mastini infernali circondare la radura. Sono immobili ma nello spazio lasciato da quel circolo qualcosa avanzava, qualcosa di enorme, un ibrido uomo-cavallo circondato dalle fiamme spettrali che a breve avrebbero lasciato solo cenere laddove prima vi era una foresta. Garen porse la destra avanti mostrando al nemico il fianco mentre il piede sinistro si faceva indietro. L'elsa della spada era tenuta al fianco sinistro, pronta in un ultimo affondo mentre Hecarim corse e si preparava nel suo affondo...","replies":[{"poster":"HaIIeIujah","date":"2017-12-27T16:35:55.890+0000","up_votes":1,"down_votes":0,"body":"Con 3365 battute, questa fanfiction entra nel contest. Grazie per la partecipazione!","replies":[]}]},{"poster":"Matteo00","date":"2017-12-28T19:58:34.576+0000","up_votes":3,"down_votes":2,"body":"Premetto che il mio uso della _consecutio temporum _   fa leggermente schifo, inoltre il luogo dove si svolge la vicenda è lo stesso di quello nel video di Rakan/Xayah contro Zed (adattato un po' alla mia immaginazione e al mio testo).\nSpero vi piaccia.\n\nIl racconto si intitola:  Un oscuro duello\n\nNella fitta foresta di Ionia, in una segretata regione dove è posta la base dell'Ordine dell' Ombra,  un urlo straziante interruppe l’allenamento del maestro Zed.  Fuori alla sala del trono, una delle due guardie che controllavano l'entrata si era accasciata a terra.\n\n“Che è successo?” chiese Zed all’altra guardia.\n\n\"Non lo so, mio signore; ha detto d'aver visto qualcosa muoversi velocemente tra gli alberi, così sono andato a controllare ma non ho visto niente. Poi ho sentito le sue urla e sono tornato.\"\n\nIntanto la guardia continuava a urlare, colpendo a pugni l'aria intorno a lui come se avesse paura di qualcuno, come se il suo peggior incubo si fosse fatto reale. \nInnervosito,  più dalle urla che dalla storia, Zed sgozzò con disprezzo quel debole soldato, e la regione riprese il silenzio.\nMa mai in quel luogo la notte aveva raggiunto temperature così basse, da far addirittura congelare  il terreno e rendere l’aria fredda  come il corpo di un morto. Dopo che i soldati portarono via il cadavere, Zed ordinò di controllare l'intera regione, per poter restare da solo a meditare nel castello. \nRientrando nella sala principale, vide il suo trono congelato, e alle sue spalle sentì un gelido sospiro.\nZed si voltò lentamente, quasi per dare possibilità al suo nemico di sorprenderlo da dietro; ma ciò che si trovò davanti fu singolare. Una creatura spettrale senza volto, dagli occhi vuoti, molto simile a una delle sue ombre, eppure non avvertiva  un senso di appartenenza ad essa. Attratto dall'apparente ombra, andò verso essa, poi alzando la mano cercò di toccarla, e l’ombra fece lo stesso. Ma al tocco, Zed fu attraversato da un gelido freddo in tutto il corpo; ritornato in se, capì che lo spettro era una grande minaccia, così lo colpì, ma esso bloccò la lama con la sua, spingendo all’ indietro Zed.\n\n“Zed,  maestro delle ombre…” disse la creatura con voce demoniaca “ ... la tua oscurità mi ha attratto sin da subito;  come può un semplice uomo controllarne così tanta ?”\n\nL’essere diffuse le tenebre in tutta la sala, tenebre troppo oscure, persino per  Zed.\n\n“Cosa sei?”  chiese quest’ultimo rimasto senza vista. Dalla sua voce, lo spettro percepì un leggero stato d’angoscia.\n\nUna risata malvagia echeggiò tra le pareti del castello –“Così anche le ombre hanno paura!”- La risata continuò.\n\nSenza preavviso il fantasma  si scagliò verso Zed,  con i suoi artigli lo prese per la gola trascinandolo fino al trono, ma poco prima che lo potesse trafiggere con la sua lama, Zed riuscì ad usare la sua ombra teletrasportandosi al centro della sala, mentre il fantasma squarciò quest’ultima.\n\n\"Cosa sei?\" chiese Zed con voce più audace.\n\n\"Io sono il re delle tenebre, portatore del crepuscolo, incarnazione degli incubi di ogni uomo !\"\n\n\nLa debole luce dell’esterno tornò ad illuminare la stanza. \n“Voglio sapere il tuo nome!”\nZed lanciò i suoi shuriken allo spirito, che gli deviò verso l’alto, ma fu trapassato alle spalle da quelli dell’ombra, che si dissolsero subito dopo in una piccola nube nera.\n\n“Uno spettro che può essere colpito?” provocò Zed.\n\nIn quel momento cominciò un oscuro duello: Zed contro il suo nuovo incubo.\n\nOmbre si creavano e svanivano nel nulla, i colpi delle lame si diffondevano per tutta la regione;  da tutta Ionia era possibile percepire un’ elevata forza di malvagità pura intorno all’edificio.\nLo scontro proseguì fino all’alba, quando entrambi esausti per le ferite erano rimasti a terra.\nCon le sue ultime forze,  Zed si concentrò e andò all’attacco insieme a 2 ombre; lo spettro fu colpito da esse, ma riuscì a mettere a terra il ninja.  Con una lama lo bloccò al pavimento, impedendogli di usare le ombre come via di fuga, mentre con l’altra era in procinto di ucciderlo, quando qualcosa cominciò a far calore nel suo freddo corpo, per poi scoppiare e sbalzare all’indietro.\n\n“Cosa è stato?” urlò per il dolore.\n“Il marchio della morte!” disse esausto Zed.\n\nI soldati, allarmati dai colpi, entrarono nella sala del trono e circondarono il nemico.\n\n“Sei stato un degno avversario  questa notte. Prima di lasciarti andare, qual è il tuo nome, demone?”\n“Il mio nome … è Nocturne”\nIn un attimo sparì alla vista avvolto dalle tenebre, mentre il Sole sorgeva all’orizzonte.","replies":[{"poster":"HaIIeIujah","date":"2017-12-28T22:34:41.610+0000","up_votes":1,"down_votes":0,"body":"Con 3486 caratteri, anche questa storia è ammessa al contest. Grazie ancora per la partecipazione.","replies":[]}]},{"poster":"Dantazzo","date":"2018-01-04T07:44:36.552+0000","up_votes":2,"down_votes":1,"body":"Io voto CommonDotaPlayer. Ho trovato la sua storia, scritta bene, chiara, fluida e con sufficiente gore.\nAnche se ci sarebbe stato bene un \"Omg noob 2v1\"","replies":[]},{"poster":"Asayuna","date":"2017-12-26T15:16:59.834+0000","up_votes":1,"down_votes":2,"body":"_______________________________\n\nLa storia si chiama 'Compulsory Violence', ed è parte di una mia serie di fanfiction su Caitlyn e Vi {{champion:51}} {{champion:254}}, che amo particolarmente ^^\nSi divide un due parti, una iniziale raccontata da Cait, l'altra conclusiva raccontata da Vi. Ho aggiunto i nomi tra parentesi in caso non fosse chiaro chi stia parlando. Dovrebbero essere circa 3480 caratteri\nBuona lettura :3\n_______________________________\n\n(Cait)\n\n« Hai trovato treccina blu?! » urlò Vi, sbattendo i suoi guantoni hextech sul tavolo. \n« Ragazzona, il tavolo mi serve, in realtà... » le risposi, guardandola infastidita dalla sua stupidità. Beh, l'amavo, ma mica per tutto. \n« Già, già... Scusa » disse lei, alzando le mani e tenendole in alto, rimanendo con lo sguardo fisso su di me. \n\"Più una sfida, che una scusa\", pensai, sedendomi accanto al “quasi-tavolo”, ormai. « Non so se posso fidarmi... ha tutta l'aria d'essere un'imboscata, Vi » \n« Qualunque imboscata viene sbaragliata dai miei guantoni, Cupcake. Basta un pugno e tutto si risolve » esclamò, sorridendomi. \nSbuffai, lanciandole un'occhiataccia « La forza non è tutto, ragazzona ». \n« Dov'è la ragazza, Caitlyn? » mi chiese, diventata seria, guardandomi. Dapprima arricciai le sopracciglia, dopotutto, non mi chiamava spesso per nome. Inoltre... Il suo sguardo era così deciso, ardeva di passione. Certo che faceva sul serio. Mi sciolsi un po’.\n\"Mi fionderei proprio sulle tue labbra...\" pensai. E, quando metabolizzai il mio perverso pensiero, arrossii di brutto, alzando un paio di scartoffie e facendo finta di leggere un qualche sorta di fascicolo per non farmi vedere. Tossii, e iniziai a dire: « Abbiamo trovato un messaggio. A giudicare dal tipo di terreno ritrovato sulla carta, è una zona... A nord-est di Piltover. Una catena montuosa. Lì pare che si sia anche avvistata miss... » vidi il fascicolo abbassarsi, e Vi guardarmi « ... treccina... » \n« Cupcake », mi chiamò. Dal suo sguardo, sembrava volesse azzannarmi. E non in senso buono.\n\"Mi ha... letto il pensiero...?\", subito andai a pensare. « ... Sì? » risposi, titubante. \n« Quel fascicolo è al contrario » mi disse, ridendo sotto i baffi. Poi mi prese il mento con due dita, e mi baciò. Nulla di speciale, solamente poggiò le sue labbra contro le mie. Però... avvertii questa sensazione di calore invadere tutto il corpo, e quello che inizialmente doveva essere un semplice bacio io lo trasformai in qualcosa di più. Le afferrai la nuca, affondando sempre più le mie labbra nelle sue, cercando la sua lingua. E lei mi capì al volo, alzandomi in braccio e spingendomi delicatamente sul tavolo, dandomi ciò che desideravo, lei. E non mi accorsi che la stazione di polizia era un po' troppo silenziosa.\nE poi...\n\nTre secondi. In tre secondi realizzai la situazione. \nUno: La stazione era praticamente in rovina. Sentivo grida lontane, e un grande e assordante fischio nelle orecchie. \"Un'esplosione...\", andai subito a pensare.\nDue: Vi. Ferita alla spalla, non era niente di serio, anzi. Ma il suo sguardo... Il suo viso... era terrorizzata. Ma da cosa? Eppure... guardava solamente me. \nTre: ... Il problema ero io. E lo capii appena iniziai a vedere Vi con una leggera tonalità di rosso. L'odore della polvere non era abbastanza forte da stordirmi. Sentivo il calore del sangue, del mio sangue, scorrere sulla mia fronte e a scendere. \nVi mi diceva qualcosa, urlava forse, ma io non la sentivo, le orecchie completamente ovattate. E le sue lacrime mi fecero sentire peggio, sempre peggio. \nAprii la bocca, uscì solo un lieve lamento. \nMi prese delicatamente, appoggiando la mia testa sulla sua spalla. Chiusi gli occhi, e pensai “Basta lottare. Basta”.\n\n(Vi)\n\n« Caitlyn... » sussurrai, vedendo la mia piccola Cupcake lentamente chiudere gli occhi. Mi venne ancora una volta da piangere. \n\"Come cazzo è successo?!\" pensai. Piuttosto, urlai nella mia mente. Guardai attorno a me, qualsiasi dettaglio mi sarebbe bastato. E lì lo vidi. Sul cappello della mia partner, in lontananza. Un capello lungo e blu. Un fottutissimo capello blu. \nDigrignai i denti, stringendo forte Cait fra le mie braccia. \"È stata lei. La Mina Vagante.\" \nAlzai lo sguardo, ero furiosa. Piano piano assemblavo i pezzi, metabolizzavo ciò che mi circondava: odore di polvere, detriti, piccoli solchi nel terreno. \n\"Piccoli solchi... Sono state le sue granate, allora, a creare tutto questo. E Cait... Cait era più vicina al terreno. E si è presa tutto il colpo per me.\" \n« Desidererai che i giochi siano finiti quando metterò le mani su di te! » urlai, come per minacciare una persona che, probabilmente, non era neanche lontanamente lì.","replies":[{"poster":"HaIIeIujah","date":"2017-12-26T18:04:38.202+0000","up_votes":2,"down_votes":1,"body":"Hey, intanto benvenuta nel forum dato che da quel che vedo questo è il tuo primo post.\n\nEssendo questo un contest, non posso ammettere storie scritte precedentemente per altri progetti- se vuoi partecipare dovrei crearne una da zero, esplicitamente per il concorso.","replies":[{"poster":"Asayuna","date":"2018-01-03T18:01:15.630+0000","up_votes":1,"down_votes":0,"body":"Ohw forse mi hai fraintesa. non è stato scritto per un progetto. E' solo parte delle mie fanfiction scritte su Caitlyn e Vi :3","replies":[{"poster":"HaIIeIujah","date":"2018-01-03T18:15:08.515+0000","up_votes":1,"down_votes":0,"body":"Questo è un thread per un contest di fanfiction originali, create appositamente per esso. Ogni storia che è stata accettata è stata scritta dall'autore in occasione del concorso.\n\nLa tua è una storia scritta precedentemente. In quanto tale, non posso accettarla. Spero di essere stato più chiaro ora.","replies":[]}]}]}]},{"poster":"Matteo00","date":"2018-01-04T10:46:07.006+0000","up_votes":1,"down_votes":0,"body":"Voto la storia di SickAnto","replies":[]},{"poster":"HaIIeIujah","date":"2018-01-03T23:14:41.955+0000","up_votes":1,"down_votes":0,"body":"Ed il contest si chiude!  Grazie a tutti per la partecipazione e le visualizzazioni. Adesso inizia la fase di votazione.\n\nPer ricordarne il funzionamento:\n\n* Ogni Partecipante  deve assegnare il suo voto ad una Storia diversa dalla sua.\n* Il mio voto personale verrà poi aggiunto, con valore doppio.\n* La votazione può avvenire in privato (contattandomi sul client) o in risposta alla storia stessa dal forum.\n* Una volta che tutti i partecipanti avranno votato, o se sarà passato troppo tempo, si procederà al conteggio dei voti e verrà aperto un nuovo thread per il vincitore, al quale sarà assegnata una Skin da 1350 RP o meno a sua scelta.","replies":[{"poster":"Dantazzo","date":"2018-01-04T06:39:13.425+0000","up_votes":1,"down_votes":0,"body":"Il voto è da 0 a 10? Il tuo vale il doppio? Pensavo valesse 2.","replies":[{"poster":"HaIIeIujah","date":"2018-01-04T07:16:05.186+0000","up_votes":1,"down_votes":0,"body":"Il voto e’ una singola preferenza. Vale uno.","replies":[]}]}]},{"poster":"SideshowEMS","date":"2017-12-28T15:33:19.893+0000","up_votes":2,"down_votes":2,"body":"Ieri mattina sono finalmente riuscito a tornare alla locanda nella città di Nashramae. Mi ci sono voluti due giorni per uscire dalle macerie di quella maledetta tomba. \nAppena entrato nella mia stanza mi sono buttato nella  vasca da bagno. Ci sono rimasto per mezza giornata, ed ho passato il resto del tempo a rimettere in sesto le mie cose, e a ricucire gli strappi dei vestiti.  Ero così arrabbiato che una volta finito non sono riuscito a chiudere occhio fino all’alba. Credo di aver dormito solo un paio d’ore. \n\nE’ stata decisamente una pessima spedizione. Non soltanto sono quasi morto ( non sarebbe la prima volta ), ma ne sono uscito a mani vuote e sopratutto … “ Ragazzino ?! ” Come si è permessa ? \n\nIo sono un uomo !\n\nAppena superato l’ingresso della tomba ho trovato un cadavere. Eh eh, e cosa ci vuoi trovare in una tomba, Ez ? Questo però sanguinava ancora. Una trappola scattata dalla parete alla sua sinistra lo aveva trasformato in uno spiedino. Impronte di stivali superavano il corpo, e si inoltravano verso l’interno. \n\nSgranchendo le dita all’interno del mio guanto, ho incominciato ad avanzare. Lentamente e con maggior attenzione rispetto al solito. Ormai sono abituato alle insidie delle rovine dimenticate, ma quando ci sono altre persone, le cose si fanno davvero pericolose. \n\nPiù andavo avanti e più sembrava che chi mi aveva preceduto non avesse avuto molta fortuna. Continuavo ad imbattermi nei corpi che le trappole avevano lasciato cadere sui pavimenti di pietra. \nLa scia dei caduti puntava in una direzione precisa, ed io decisi di seguirla. \n\nImprovvisamente ho sentito un urlo. Ho accelerato il passo, e alla fine li ho raggiunti. \nLe grida provenivano dall'ennesima vittima dei trabocchetti, ma c’era qualcuno ancora vivo.  \n\nHo visto una donna arrampicata sul lato di un grande piedistallo, che reggeva fra le mani un piccolo oggetto luccicante. Si trattava probabilmente di qualche vecchio idolo. Non molto interessante, ma una volta tanto questa era una buona notizia. Ad occhio non valeva molto, ed  ho pensato che non fosse così importante che qualcuno ci fosse arrivato prima di me. A giudicare dalla sua espressione, anche quella donna non  era soddisfatta del risultato. \n\nNon c’era niente da fare e ho pensato di andarmene, ma a quanto pare dopo migliaia di anni di pacifica immobilità, la soglia su cui mi trovavo ha deciso di cedere, e sono precipitato nello spiazzo sottostante. Non ho fatto neanche in tempo a mettermi in piedi, che quella pazza è saltata giù dal piedistallo e ha scagliato un’enorme lama contro di me. Mi sono buttato su un lato, e l’ho schivata per un soffio. Mi sono alzato cercando di dire qualcosa per fermarla, ma ho sentito delle lame che tornavano indietro. Mi sono buttato di nuovo a terra, e quella maledetta cosa mi ha rasato i capelli sulla nuca. Sembro un vecchio stempiato ora ( assomiglio allo zio Lymere, eh eh ). \n\nLa lama è tornata in mano alla donna, che se l'è  fatta roteare dietro la schiena solo per tirarmela di nuovo contro con il doppio della forza. Non era una situazione in cui si potesse discutere. \nMi sono inginocchiato per schivare il disco, poi ho preso la mira e ho sparato un colpo. Nello stesso tempo la lama tornava indietro, ma ci avevo pensato. Mi sono concentrato su un punto poco dietro le mie spalle ed il guanto ha fatto il resto. Dopo un breve bagliore ho visto il disco che si allontanava dal mio volto. Tempismo perfetto, mi aveva superato. \nLa donna è stata costretta a gettarsi di lato per schivare il colpo, e la lama è caduta a terra scivolando sul pavimento. Si è lanciata a recuperare l’arma, e mi ha dato le spalle. Era fatta. O così pensavo. \n\nHo sparato di nuovo, ma non sono riuscito a capire come, il colpo non ha avuto effetto. Il raggio è scomparso in un grande bagliore blu quando ha raggiunto la donna. Lei si è girata, mi ha squadrato con gli occhi, e ha sogghignato. Recuperata la lama, ha infilato una delle punte in una fessura lungo la parete. Invisibili meccanismi hanno iniziato a muoversi dietro le lastre di pietra che sorreggevano il soffitto.  La donna è corsa via in uno dei passaggi prima che le pareti iniziassero a crollare.  \n\nHa gridato “ Addio ragazzino “. \n\n“ Ragazzino ?! “","replies":[{"poster":"HaIIeIujah","date":"2017-12-28T22:33:49.958+0000","up_votes":1,"down_votes":0,"body":"Con 3459 caratteri, questa storia è ammessa. Grazie per la partecipazione e buona fortuna!","replies":[]}]},{"poster":"SickAnto","date":"2017-12-28T14:34:05.006+0000","up_votes":2,"down_votes":2,"body":"I due e gloriosi fratelli di Shurima erano l’orgoglio di tutto l’impero, lo rappresentavano in tutto il loro splendore.  Nasus, lo sciacallo, amante della storia e dal grande intelletto che divenne uno dei migliori strateghi mai esistiti in tutta Runeterra. Poi c’era Renekton, il fratello minore, un alligatore dal caldo temperamento, che si buttava per primo nella battaglia.\n\nRicordo il giorno in cui ebbi l’onore di combattere assieme a quei due grandi uomini…almeno una volta lo erano. Shurima continuava la sua campagna di conquista e stavolta l’imperatore mirava ad una città del Nord, che si affacciava al mare.\n\nNasus, come sempre, era a comando del intero esercito, mentre Renekton era già alle prima linee, con il fremito di poter affettare qualcuno con la sua arma; onestamente lo capivo, anche a me bolliva il sangue per quant’ero eccitata. Sia di poter stare al loro fianco, sia di combattere.\n\nLo Sciacallo, con un cenno di mano diede il via alle catapulte di poter bombardare le mura della città. Pensavo si puntava ad aprire dei varchi per poter entrare. Invece non fu così. Miravano alle torri e alle postazioni dove c’erano gli arcieri nemici, limitandosi a ciò.\n\nIo guardai scettica a questa tattica e chiesi. “Perché non puntiamo ad aprirci una strada? Così sprecheremo i proiettili.” Nasus, mi fissò per qualche secondo per poi ridere e darmi una pacca sulla testa. “Evito che ci massacrino i soldati. Niente arcieri, niente pioggia di frecce e così sarà più facile perdere meno uomini. Ad aprire la strada ci penserà mio fratello: basta la sua forza bruta per buttare giù quel portone.” E infatti così fu. L’Alligatore, con un manipolo di uomini alle sue spalle, corse fino all’entrata principale e passo dopo passo crebbe di stazza, diventando un vero e proprio coccodrillo gigante e i pochi arcieri sopravvissuti non riuscirono a fermare la sua avanzata, visto che le frecce non scalfivano per niente la sua pelle squamosa.\n\nCon una spallata, buttò giù facilmente il portone che, sebbene era rinforzato di metallo, fu piegato al volere del Dio Coccodrillo. Ero rimasta sbalordita da tutta la sua potenza, non riuscivo a non ammirarlo per ciò che riusciva a fare. Sentivo da quella distanza il clamore del combattimento e io stringevo forte a me la mia sacra lancia a due lame e Nasus, se ne accorse senza problemi. “Stringi ancora i denti, ragazza. Vedrai che ci sarà anche la tua occasione.” E quando affermava ciò, non era mai a vanvera: sapeva che cosa poteva accadere.\n\nInfatti, delle palle di fuoco fuoriuscivano dalla città ed arrivarono fino a dove era posizionato il grosso del esercito. L’Asceso accanto a me storse il naso ed esclamò. “Maghi.” Per evitare di subire ulteriori perdite, lo Sciacallo creò una gigantesca barriera che ci protesse dalle palle di fuoco nemiche.\n\nPoi, d’un tratto, numerosi  uomini a cavallo uscirono dai due lati delle mura della città e si stavano preparando a circondarci, con Nasus occupato a difenderci con la barriera. “Come ho detto prima, Sitra, va è il tuo momento.” Mi disse ed io non aspettavo altro. Così, chiamai i miei più cari amici e mi diressi alla carica verso i cavallerizzi.\n\nNon fu molto difficile, quegli stolti non sapevano nemmeno andare a cavallo, figuriamoci impugnare un’arma contro. Ne eliminai un bel paio con estrema facilità, ma sentivo di essere ignorata da quei uomini: non puntavano all’esercito ma bensì al Asceso.\n\nUno di loro cercò di trafiggerlo con una lunga lancia ed io in fretta e furia corsi per impedirglielo. Lanciai la mia arma contro di lui, beccando il cavallo e facendolo cadere, ma l’uomo non si arrese e corse all’impazzata contro Nasus. Io dunque, con un estremo tentativo lo seguii e mi misi in mezzo ai due, prendendo in pieno petto la lancia. L’uomo, venne poi spazzato via proprio da Nasus con la sua ascia ed io caddi a terra, morente.\n\n“Ragazza, ciò che hai fatto ti rende onore.” Mi disse, mentre mi prese in braccio. In quel momento non riuscivo a distinguere il tempo e lo spazio, ma capì che avevamo vinto, sentendo le urla di festa, specialmente di Renekton, che in un tratto lo vidi sporco di sangue.\n\n“Avrai ciò che un onorevole guerriero spetta.” Sentii alla fine, prima di soccombere al buio.\n\n_________\n\nEccomi qui, con una storiella di Nasus, Renekton e un mio personaggio che penso di pubblicare a breve come campione. Spero che sia di regola al contest e che venga apprezzato.\n\nDetto ciò, buona fortuna a tutti.","replies":[{"poster":"HaIIeIujah","date":"2017-12-28T14:35:39.026+0000","up_votes":1,"down_votes":0,"body":"Con esattamente 3499 battute, questa storia è accettata. Grazie per la partecipazione!","replies":[]}]},{"poster":"Sahira94","date":"2018-01-05T12:09:52.978+0000","up_votes":2,"down_votes":2,"body":"Io voto SideshowEMS perché credo che sia riuscito a giostrare bene il poco spazio disponibile, riuscendo a scrivere una storia completa, che funzionasse e che rispettasse anche la caratterizzazione dei personaggi c:","replies":[{"poster":"SideshowEMS","date":"2018-01-05T21:56:13.674+0000","up_votes":1,"down_votes":1,"body":"Grazie. \n\nIn effetti il primo pensiero che ho avuto prima di iniziare a scrivere è stato \" Non voglio che sia solo un finale \". Nel senso che non volevo solo descrivere una bella scena, ma che avesse senso come storia, anche se corta. Son contento di esserci riuscito.","replies":[]}]}]}