{"poster":"HaIIeIujah","date":"2017-05-04T10:29:49.316+0000","title":"Riguardo Xayah e Rakan, qualche settimana dopo...","subforum":"Campioni e gameplay","up_votes":6,"down_votes":1,"body":"Xayah siede ad un winrate di circa il 50% in bronzo, in rapida discesa man mano che sale fino a circa il 48% in plat+.\r\n\r\nRakan leggermente peggiore, con alcune modifiche in arrivo dal PBE. Che queste siano buff o nerf assumo dipenda dal playstyle, ma il range sulla Q dovrebbe renderlo molto pi&ugrave; utilizzabile.\r\n\r\nSfortunatamente non ho modo per verificare il loro winrate combinato, ma la prima impressione sembra essere che siano nella media.","replies":[{"poster":"Asfolbrice","date":"2017-05-04T13:58:56.301+0000","up_votes":3,"down_votes":0,"body":"Xayah è sempre un grosso dito che insinua tra le natiche.\nRakan soffre alcune lane e necessita di raziocinio.\n\nIl danno early di Xayah è dovuto il più delle volte alle piume e quindi ad errore di posizionamento degli avversari (in alcuni frangenti davvero poco evitabile a onor del vero).\n\nRakan non so se cadrà nel dimenticatoio. E' veramente unico essendo un support healer ad alta velocità con buone dosi di ingaggio.\n\nPoi se davvero, come leggo qui, gli aumentano il raggio della Q saranno dolori. Per carità io gioco Rakan ma secondo me la sua Q è bilanciata così. Non facile da piazzare perchè unisce buona dose di danni e cure per due. Secondo me il raggio è equilibrato così. \n\nPiù che la Q quello che veramente limita la capacità di Rakan è il raggio della E in assenza di Xayah. Limitare così tanto il raggio della E ad un campione che si basa sui movimenti veloci lo rende davvero zoppo in assenza della compagna, che invece anche da sola fa il suo dovere mi sembra.","replies":[{"poster":"BlackAltair1","date":"2017-05-04T14:30:58.339+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Asfolbrice,realm=EUW,application-id=cAOZwaUi,discussion-id=2GE26vTU,comment-id=0005,timestamp=2017-05-04T13:58:56.301+0000)\n>\n> Xayah è sempre un grosso dito che insinua tra le natiche.\n> Rakan soffre alcune lane e necessita di raziocinio.\n> \n> Il danno early di Xayah è dovuto il più delle volte alle piume e quindi ad errore di posizionamento degli avversari (in alcuni frangenti davvero poco evitabile a onor del vero).\n> \n> Rakan non so se cadrà nel dimenticatoio. E&#x27; veramente unico essendo un support healer ad alta velocità con buone dosi di ingaggio.\n> \n> Poi se davvero, come leggo qui, gli aumentano il raggio della Q saranno dolori. Per carità io gioco Rakan ma secondo me la sua Q è bilanciata così. Non facile da piazzare perchè unisce buona dose di danni e cure per due. Secondo me il raggio è equilibrato così. \n> \n> Più che la Q quello che veramente limita la capacità di Rakan è il raggio della E in assenza di Xayah. Limitare così tanto il raggio della E ad un campione che si basa sui movimenti veloci lo rende davvero zoppo in assenza della compagna, che invece anche da sola fa il suo dovere mi sembra.\n\nCondivido a pieno. Trovo rakan il champ più divertente di lol. Aumentare il range della Q non serve ma basterebbe buffare di poco, anche di pochissimo quello della E in assenza di Xayah","replies":[]}]},{"poster":"zYaichi","date":"2017-05-04T11:38:05.666+0000","up_votes":1,"down_votes":0,"body":"Perché la gente non li sa ancora giocare,aspetta qualche mese e la loro winrate salirà","replies":[{"poster":"HaIIeIujah","date":"2017-05-04T11:41:23.903+0000","up_votes":2,"down_votes":0,"body":"Rakan di sicuro, ma Xayah non è esattametne complessa da giocare.","replies":[]}]},{"poster":"Šlim Shady","date":"2017-05-04T19:11:37.800+0000","up_votes":1,"down_votes":0,"body":"Secondo me la potenza  del campione Xayah è stato nel fatto che in molti non sapevano della sua passiva e in alcuni casi è difficile da gestire e da ricordarsi (intendo le piume che lascia a terra) ovviamente parlo del mio Elo. Anche se ultimamente non si vedono più insieme.","replies":[]},{"poster":"oroora6","date":"2017-05-04T13:51:33.208+0000","up_votes":1,"down_votes":0,"body":"Warwick nel primo mese è rimasto con winrate negativo, ora è uno dei jungler migliori.\nFizz nel primo mese è rimasto con winrate negativo, ora è uno dei midlaner migliori\nRakan penso che rimarrà basso, ma Xayah tra qualche patch inizierà a scoppiare in winrate, basta che la gente comprenda come usare al meglio la sua E ed è finita per la botlane, inoltre quando il banrate si abbasserà il winrate si alzerà di conseguenza, come è successo con rengar","replies":[]},{"poster":"Darkinknight","date":"2017-05-04T12:45:48.078+0000","up_votes":1,"down_votes":0,"body":"Secondp me rakan andra nel dimeticatoio in un paio di patch e xayah sara nerfata (è vero che ha una winrate intorno al 49%,ma con una pick rate elevata e la patch stessa di uscita quindi non uno sa usarla decentemente)\nAnche solo a impressione il danno early game che ha non ha senso nell'insieme del suo kit","replies":[]},{"poster":"Ringiel","date":"2017-05-04T11:03:05.175+0000","up_votes":1,"down_votes":0,"body":">Sfortunatamente non ho modo per verificare il loro winrate combinato, ma la prima impressione sembra essere che siano nella media.\n\nl'unica cosa sgrava di xayah è come distrugge le torri con la W,ma il resto è nella media; non l'ho ancora provata con {{item:3087}} e {{item:3094}} dopo la patch di ieri,ma per me attualmente ci sono adc molto più forti ({{champion:67}} {{champion:51}} {{champion:236}} {{champion:22}}  {{champion:81}} )","replies":[{"poster":"Arteriam","date":"2017-05-04T11:06:49.428+0000","up_votes":1,"down_votes":1,"body":"Eggià, ma Xayah se accoppiata con Rakan è sicuramente worth.","replies":[{"poster":"Ringiel","date":"2017-05-04T11:10:34.673+0000","up_votes":1,"down_votes":0,"body":"si,ma il problema è che il più delle volte rakan lo vedo bannato per via del suo kit della madonna (infatti ha un 20% di ban rate). sicuramente insieme sono veramente forti,ma il basarsi su un solo champ per aumentare la chance di win secondo me la rende inferiore ai 5 champ che ho elencato.","replies":[{"poster":"Arteriam","date":"2017-05-04T11:51:06.287+0000","up_votes":1,"down_votes":0,"body":"Appunto, pickate entrambi o niente, il resto e meglio per workano pure da soli.","replies":[]}]}]}]},{"poster":"Arteriam","date":"2017-05-04T10:39:09.631+0000","up_votes":1,"down_votes":0,"body":"Lo sono, ma sfortunatamente perdono un pò di forza se non sono assieme. (Intendo se banni uno dei due ecc.)","replies":[]}]}