{"poster":"SuraKnight","date":"2018-04-14T22:08:42.655+0000","title":"Scendete dal Piedistallo","subforum":"Discussioni generali","up_votes":6,"down_votes":2,"body":"Io certa gente non la capisco proprio. In molti game (normal) incontro player che costantemente ad ogni errore di qualcuno nel team sono pronti a criticare. Si sentono delle divinit&aacute; solo perch&egrave; magari sono gold platino o che so io, se la tirano e insultano tutti dicendo bronzini o minchiate varie. Sempre pronti ad insultare e a dire cosa e giusto o meno, poi sono i primi a fare minchiate. PLACATEVE FATE SCHIFO COME TUTTI GLI ALTRI.\r\nPeace :D","replies":[{"poster":"Aakraos","date":"2018-04-17T12:20:55.732+0000","up_votes":2,"down_votes":0,"body":"Di persone maleducate ne è pieno il mondo, e di conseguenza qualcuna (o più di una) è anche qui nella nostra quasi paradisiaca community. Il primo consiglio che mi sento di darti, essendo un player proprio come te, è quello di ignorare i primi tentativi di flame e silenziare subito le persone sgradite. Inoltre non buttarti giù: la stragrande maggioranza di loro, statisticamente, non supererà il gold e nonostante tutto non farti condizionare più di tanto per il rank tuo o altrui, non sempre è un indice reale di abilità. Ti auguro di trovare persone meno fastidiose e buona fortuna!","replies":[]},{"poster":"Sorcio84","date":"2018-04-16T21:23:51.594+0000","up_votes":2,"down_votes":0,"body":"Certi platino sono solo feccia che da della feccia a chi è più basso di loro, ma chi si credono di essere ? Io dico, se uno è migliore sa che ci sono gli scarsi, te ne fai una ragione e amen. Magari in game dai consigli, warda qui, pinga la, seguimi, ritirati, ecc, come dovrebbe essere nell'idea del gioco corretto.","replies":[]},{"poster":"SPARATEVI","date":"2018-04-16T06:25:28.263+0000","up_votes":2,"down_votes":0,"body":"per quanto riguarda il game è una questione di mentalità: è sempre più facile dare via le colpe che ammettere un proprio errore.\nper quanto riguarda il forum è il già citato fenomeno dei \"leoni da tastiera\": sono dietro un monitor non possono farmi niente rispondo maleducato per sentirmi figo tanto cosa può succedere?","replies":[]},{"poster":"Detective Meow","date":"2018-04-15T09:07:07.261+0000","up_votes":4,"down_votes":2,"body":"Questi in game, hanno un elo superiore al bronzo 1 e se credono Faker.\nPoi ci sono i platino/diamanti sul forum che una volta su 3 danno del \"ritardato\" a gente totalmente a caso, che non conoscono, e che le loro madri si vergognerebbero di sapere cosa van facendo i figli a briglie sciolte sulla rete.\nAlla fine la community è una, maleducata e saccente nel gioco, maleducata e saccente nel forum.\nCon la scusa che siamo dietro uno schermo ci si permette vocaboli e terminologie che faccia a faccia non si penserebbero neppure, fa schifo? Sì, perchè quei gran figoni di elo alto che dovrebbero dare buon esempio e insegnare qualcosa, magari hanno qualcosa da insegnare a livello di game ma a livello umano va a finire che è trash.\nSpero solo che nella vita al di fuori del gioco, abbiano un comportamento quantomeno migliore, altrimenti la società civilizzata avrà fallito su quasi tutti i fronti.\n\nPeace a tutti eh.","replies":[]},{"poster":"Tacchino Robot","date":"2018-04-15T00:12:09.350+0000","up_votes":4,"down_votes":4,"body":"\"Qui vige l'uguaglianza, qui non conta un cazzo nessuno!\"","replies":[]}]}