{"poster":"SuraKnight","date":"2018-05-12T13:53:38.104+0000","title":"Rendere la mappa \"viva\"","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ciao a tutti. Volevo sapere cosa ne pensate riguardo un idea che mi &egrave; venuta in mente.\r\nL&#039;altro giorno riflettevo sui cambiamenti della landa degli evocatori di circa 4 anni fa se non sbaglio. Mi sono quindi domandato: perch&egrave; non renderla ancora pi&ugrave; interattiva? Mi spiego meglio. Trovo che sarebbe fantastico se alcune abilit&agrave; di determinati champ potessero modificare il paesaggio della landa. Per fare un esempio: quando ornn usa la sua e sul muro di taliah crea un varco; perch&egrave; allora non lascia segni se lo usa su un muro della landa? La stessa cosa vale per altri campioni:\r\nLa ultimate di nunu, la q di poppy, la q di chogat, la ulti di rammus o pantheon ecc.. potrebbero lasciare dei segni sulla landa. Ovviamente questo non modificherebbe la &quot;giocabilit&aacute;&quot; della landa ma avrebbe come unico effetto quello di rendere la landa un vero e proprio campo di battaglia con tutti i segni e le cicatrici. \r\nVoi che ne pensate?","replies":[{"poster":"Dr LouD","date":"2018-05-12T14:58:07.746+0000","up_votes":8,"down_votes":0,"body":"Immagina quanto possa essere chiaro e giocabile un teamfight 5v5","replies":[]},{"poster":"Ringiel","date":"2018-05-12T14:51:35.368+0000","up_votes":2,"down_votes":0,"body":"il senso di tutto ciò,a parte rendere più pesante il gioco fino a renderlo ingiocabile,visto che certi champ spammano le abilità","replies":[{"poster":"SuraKnight","date":"2018-05-12T15:42:41.347+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=lPWuNKu8,comment-id=0001,timestamp=2018-05-12T14:51:35.368+0000)\n>\n> il senso di tutto ciò,a parte rendere più pesante il gioco fino a renderlo ingiocabile,visto che certi champ spammano le abilità\n\nNon lo so era solo un idea che volevo condividere. \nComunque non sto parlando di burroni che si formano al centro della landa dentro cui sprofondano i campioni, avevo in mente giusto qualche piccola interazione grafica, come poi esiste giá ad esempio per la q di taliah (si formano dei cerchi rossi, mi pare, sul terreno) che non penso intacchino la fluiditá del game","replies":[{"poster":"Ringiel","date":"2018-05-12T16:23:08.465+0000","up_votes":1,"down_votes":0,"body":"se fossero perenni per forza di cose dopo un po di game intacca la fluidità perchè il tuo pc deve caricarle ogni volta,sopratutto se ti becchi champ tipo poppy che spammano spell dall'inizio del game,ma anche se non lo fossero renderebbero il gioco ingiocabile,perchè ti immagini in un fight che casino esce fuori? la E di lux  ad esempio nella mappa natalizia non si vede perchè il terreno è troppo chiaro,figurati in un terreno devastato,quindi di un colore diverso dal normale,quante spell non si vedrebbero o si confonderebbero per altre ... per me rimane un idea pessima,perchè non porta nessun vantaggio nell'essere inserita (ad esempio la landa oltre a essere più bella di quella vecchia è anche più leggera perchè gli oggetti richiedono meno poligoni),ma solo svantaggi","replies":[{"poster":"SuraKnight","date":"2018-05-12T16:44:03.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=lPWuNKu8,comment-id=000100000000,timestamp=2018-05-12T16:23:08.465+0000)\n>\n> se fossero perenni per forza di cose dopo un po di game intacca la fluidità perchè il tuo pc deve caricarle ogni volta,sopratutto se ti becchi champ tipo poppy che spammano spell dall&#x27;inizio del game,ma anche se non lo fossero renderebbero il gioco ingiocabile,perchè ti immagini in un fight che casino esce fuori? la E di lux  ad esempio nella mappa natalizia non si vede perchè il terreno è troppo chiaro,figurati in un terreno devastato,quindi di un colore diverso dal normale,quante spell non si vedrebbero o si confonderebbero per altre ... per me rimane un idea pessima,perchè non porta nessun vantaggio nell&#x27;essere inserita (ad esempio la landa oltre a essere più bella di quella vecchia è anche più leggera perchè gli oggetti richiedono meno poligoni),ma solo svantaggi\n\nAspetta forse non mi sono spiegato. Non intendo perenni in tutti i game. Intendo che in ogni game la landa viene \"modificata\" poi resettata al game successivo. Insomma ogni game è una storia a sè e la landa ne riporta gli eventi invece che essere statica. Poi quelle che propongo io sono piccole modifiche tipo mini spaccature o crepe non certo chissá che grandi cambiamenti. Poi non è una cosa fuori dal mondo. Basta pensare ai piccoli corvi di swain che appaiono sulla mappa quando c'è lui etc... Secondo me sarebbero piccoli dettagli che arricchirebbero la landa. Comunque ognuno ha la sua opinione ed è giusto così :D","replies":[]}]}]}]},{"poster":"oitrillox","date":"2018-05-13T11:03:59.623+0000","up_votes":1,"down_votes":0,"body":"L'idea non sembra male ma io direi invece di creare un campione che modifichi il terreno con le sue abilita,tipo creare un muro di rovi che con il tempo sparisce oppure alzare una parte di terreno per impedire i movimeti dei nemici (che ovviamente sparisce col tempo), cose cosi.\n\nPero la tua idea non mi sembra brutta{{sticker:slayer-jinx-wink}}","replies":[{"poster":"SuraKnight","date":"2018-05-13T11:11:12.134+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oitrillox,realm=EUW,application-id=MJVj50Jw,discussion-id=lPWuNKu8,comment-id=0005,timestamp=2018-05-13T11:03:59.623+0000)\n>\n> L&#x27;idea non sembra male ma io direi invece di creare un campione che modifichi il terreno con le sue abilita,tipo creare un muro di rovi che con il tempo sparisce oppure alzare una parte di terreno per impedire i movimeti dei nemici (che ovviamente sparisce col tempo), cose cosi.\n> \n> Pero la tua idea non mi sembra brutta{{sticker:slayer-jinx-wink}}\n\nSi infatti sarebbe carino anche un support il cui kit permette di modificare la mappa: creare muri cespugli o passaggi per il team.","replies":[{"poster":"oitrillox","date":"2018-05-13T13:07:47.217+0000","up_votes":1,"down_votes":0,"body":"questa sarebbe una cosa fantastica!{{sticker:sg-kiko}}","replies":[]}]}]},{"poster":"The Fluffy Lamb","date":"2018-05-13T00:33:37.837+0000","up_votes":1,"down_votes":0,"body":"Taliyah lascia dei segni quando usa non so quale abilità.\n\nQuesta idea c'è gia, ma per pochi abilità di pochi campioni.\n\n\n\nSe prendessimo la ulti di kindred , mio main, all'interno della zona di immortalità ci sono delle linee, credo siano rune ma ho la netta sensazione che siano linee a caso in disegno etereo di cui non comprendo il significato sarebbe bello che queste rune lasciassero il segno per terra, non sono cosi visibili da infastidire il gameplay\n\nSe invece prendessimo la W potenziata di Corki quella non potrebbe lascaire segni poerche annerisce quasi completamente il terreno.\n\n\nIpotesi mie","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-05-12T18:16:16.015+0000","up_votes":1,"down_votes":0,"body":"Ottima idea:)\n\nhttps://www.youtube.com/watch?v=BJ0xBCwkg3E&feature=youtu.be","replies":[]},{"poster":"Oimmena","date":"2018-05-12T14:14:51.889+0000","up_votes":1,"down_votes":0,"body":"Di per sé l'idea è valida, ma presenta due problematiche. La prima è che 10 pg su una mappa così piccola, lascerebbero troppi segni. Cosa che si potrebbe ovviare dando un limite di permanenza, tipo che dopo un tot (di tempo o di usi) svaniscono e vengono sostituiti da quelli nuovi, l'importante è che non siano troppo invasivi da un punto di vista grafico. La seconda è legata alle prestazioni... LoL è un gioco che puoi fare anche su un tostapane e la Riot, anche quando ha rifatto dei visual up-grade della mappa o dell'interfaccia, ha sempre cercato di tenerlo a mente. Certo, potrebbero metterla come opzione - tipo come hanno fatto con gli animaletti e gli altri effetti della mappa.","replies":[]}]}