{"poster":"Origin Yona","date":"2018-06-21T13:30:33.526+0000","title":"JUGANDO AL LOL MAS DE 5 AÑOS","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Soy de Argentina \r\ny no soy un toxico ni nada pero osea cuando hay que decirle las cosas buenas a los invocadores de hoy en dia o los que juegan hace 2 a&ntilde;os o 1 a&ntilde;o ya ellos lo toman como un flameo osea ? nose quienes son de seson 2 pero me acuerdo que era hermoso jugar lol y era toda gente bueno y muy raras veces te cruzabas con flamers y toxicos y ahora parece que toda la comunidad esta llena de esas personas ?\r\nyo solo digo lo que pienso y gracias por leerlo si lo leiste &lt;3 :3 \r\nrecien juga una que me reportadon por foro porque supuestamente trollei y solo tuve una mala partida como todos y bueno nada eso espero que entiendan mi situacion","replies":[{"poster":"Franzjo","date":"2018-06-21T14:12:22.492+0000","up_votes":2,"down_votes":0,"body":"Juego desde la s2 y tenes razon antes habia mucho menos toxicos pero era en EU y no jugaban tanta gente como ahora.","replies":[]},{"poster":"Bud Dicec","date":"2018-06-21T17:07:01.445+0000","up_votes":1,"down_votes":0,"body":"Si alguien te dice dejate de joder las pelotas y deja de morir, no es flameo. Lo que pasa es que la gente no sabe usar el mute y no saben aceptar consejos.","replies":[]},{"poster":"Clostridium","date":"2018-06-21T16:48:16.443+0000","up_votes":1,"down_votes":0,"body":"es por la politica de riot que todo lo que no sea positivo se toma como critica negativa u ofensa...\n\nes mejor no decir nada o seras penalizado... eso esta clarisimo ya... todo es motivo de sancion por mal comprtamiento...\n\nme gusta no, pero yo al contraio veo que gracias a esto a bajado mucho el flameo","replies":[]},{"poster":"rokushoger","date":"2018-06-21T16:12:15.322+0000","up_votes":1,"down_votes":0,"body":"Yo juego desde antes todavía pero dado que antes el server LAS no existía, pero flamers siempre hubo. En mi percepción actualmente la mala onda ha aumentado significativamente pero no solo en lol sino a nivel mundial.","replies":[]},{"poster":"Vaaš","date":"2018-06-21T19:25:08.229+0000","up_votes":1,"down_votes":1,"body":"Yo juego desde la S1 en EUW como con 3 a 4 cuentas después me cambie a LAS pero no, no habían flamers ni nada era hermoso wn ;'C las primeras seasons.\n\n¿Ibas mal? no importa nadie te decía nada... todos jugando tranquilos porque **es un juego** y el juego ni era muy conocido soy de las 1ras personas en jugarlo. \n\nSe extrañan muchas cosas, como los antiguos items de jg hasta el cliente de legado, cuando todos los champs estaban en balance etc. La gente entraba para divertirse no para flamear o usar las señales de MIA/SS para provocar, cuando te hacías un Penta el equipo enemigo te felicitaba o al menos a mi me pasaba eso, todo era tranquilo en un ambiente que da gusto jugar las partidas que duraban la hora cuando ambos equipos estaban muy parejos... esas si eran partidas para el recuerdo.","replies":[]},{"poster":"DIOS TUTI","date":"2018-06-21T14:07:09.322+0000","up_votes":1,"down_votes":1,"body":"juego hace 2 años y medio y no me tomo todo como flameo, jaque mate ateo.","replies":[]}]}