{"poster":"Akasuisei","date":"2016-03-11T18:21:13.682+0000","title":"Champs in Pro League are almost all the same","subforum":"Esports","up_votes":3,"down_votes":1,"body":"I&#039;ve noticed while watching the 2015 world&#039;s that the same champs are always appearing in each match with a lot of matches being almost identical in team composition.  I realize that there is a meta and certain champs are just OP and that a few champs get chosen to counter each other, but I was wondering if anyone could provide more specific benefits or reasons why we are seeing the same champs again and again.  I&#039;ve been following a lot of the pro matches for a while so I&#039;ve heard the commentary that the casters give during champ select, but some times I am still left wondering &quot;why choose that champ in that situation?&quot;.  I will also admit that I am currently hovering between Bronze and Silver skill wise and the team comps down there are nothing like that at the Pro level, which is probably another large reason that I&#039;m not seeing the connection.  I also found that when looking at my champ pool, I only have/play maybe 15% of the champs at the Pro level.  Here is list of some of the champs that I almost always see appear in pro matches:\n\nKalista\nCorki\nRek&#039;Sai\nGragas\nLucian\nLulu\nLee Sin\nTrundle\nThresh\nAlistar\nGangplank\nBraum\nKindred\nEkko\nElise\n\nI know there are a few more that are always appearing, but if you follow the Pro matches, you probably already know them.\nAnyway, of the close to 130 champs, why this same rotation of 20-30 champs?","replies":[{"poster":"Miku Lv99","date":"2016-03-11T23:53:45.236+0000","up_votes":2,"down_votes":0,"body":"No, it's not just that the pros practiced those.  I'm sure many of them are proficient with plenty of other champions.\n\nThere is one secret (well, not really) thing that most of them have in common that makes them really good.  They have mobility.  The most OP thing in the history of LoL, which is massively underrated in terms of power level by the balance team.  Everything but mobility has a limit to how powerful it can make you.  You know, if you have twice as much damage, you are still only about twice as good.  But mobility doesn't work that way.  In a game of trying to outposition your opponents, mobility allows you to essentially cheat and not have to pay for doing things.  And this isn't just to escape ganks in lane.  It's actually potentially infinitely powerful in teamfights.  That's right, you can be an unbounded amount more useful in a fight because of it.  Assuming your opponents have a powerful zone controller like Thresh, Braum, or Alistar, they can somewhat zone you out of ever doing anything in a teamfight.  As in, you'll just instadie as soon as you try to do anything useful.  As in, your usefulness is 0.  But, if you have mobility, then you can do things.  And the more mobility you have, the more of the time you can get away with doing things.  So someone like Kalista can attack a huge amount of the time because of this.  The only other champions that can really be that good that don't have that much mobility have to have very long range, very high utility, or high zone control.  Also none of them can be very bad early or mid game as those are immensely important.","replies":[]},{"poster":"MrHaZeYo","date":"2016-03-14T09:44:14.258+0000","up_votes":1,"down_votes":0,"body":"It's been this way for a long time, least those 20-30 champs slowly rotate in and out. Although this year I feel we're seeing a good amount. \n\nTop: \nGraves\nMalphite\nFiora\nPoppy\nQuinn\nRyze\nMao Kai\nTrundle\nNaut\nRammus\nCho'Gath\nEkko\nPantheon\nGangplank\nJax\nKayle\nShen\nYas\nVlad\nOlaf\n\nJungle:\nElise\nReksai\nGragas\nLee Sin\nNid\nNunu\nRumble\nZac\nKindred\n\nMid:\nLux\nAhri\nLeBlanc\nViktor\nSyndra\nLulu\nLisandra\nZed\nTalon\nZilean\nAnivia\nKarma\nOrianna\nTwisted Fate\nVel Koz (Faker at IEM)\n\nAD:\nCait\nKali\nCorki\nEzreal\nLucian\nJhin\nDraven\nMiss Fortune\nKog\n\n\nSupp:\nAlistar\nBard\nJanna\nSoraka\nBruam\nMorg\nThresh\n\n\nThose are all Champs that have been picked at least once in either LCS or IEM over the spring split. Ya some rarely see play but it doesn't change the fact they've been picked. Look at top lane alone, back in Season 4 Spring it was Renekton vs Shyvana with some Trundle sprinkled in, now we got a healthy amount of varity. Sure its not the whole LoL Roster seeing action but champs get rotated in and out based on the Meta.","replies":[]},{"poster":"TBakes","date":"2016-03-11T22:01:54.094+0000","up_votes":1,"down_votes":0,"body":"I think there are a few things that many of these champions have in common: early game pressure, powerful teamfight potential, mobility, engage, and reliability. With turrets so weak and longer death timers in the mid-game, LCS teams are looking for champions that do not take long to hit a power-spike. There is also a certain level of mobility needed to get around the map to push/defend different lanes, as well as get vision with limited vision resources. The level of communication and practice is higher at the pro level, which means teamfighting champions are really utilized much more effectively. Finally, they need champions with a certain level of reliability, because it would be unfortunate if a single mistake completely ruined the usefulness of a champion. \n\nThese are just guesses based on what I have watched and heard. I'm sure I might be way off or there might be other pieces I am missing.","replies":[]},{"poster":"Stillname","date":"2016-03-11T20:00:56.646+0000","up_votes":1,"down_votes":0,"body":"There is only so much time in the day to practice champions, so the pros pick which champs they think are the best and practice those. Maybe there is some hidden op strat with champs that aren't being played but there are too many champs to consider trying them all every patch.\n\nThat is until someone discovers a new strategy but after the first week they bust it out everyone jumps on that strat and it becomes the new normal.","replies":[]}]}