{"poster":"Gonk","date":"2017-12-10T19:03:09.755+0000","title":"Duda sobre carrear","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Por que hay algunos campeones que no pueden carrean partidas?. Por ejemplo Garen. Que requisitos tienen que tener un campe&oacute;n para carrear?\r\n\r\n\r\n\r\nSaludos!","replies":[{"poster":"Oblivion awaits","date":"2017-12-10T19:13:30.232+0000","up_votes":2,"down_votes":0,"body":"Cualquier campeón puede carrear una partida. ¿Crees que Garen no puede carrear una partida? Hay un sujeto que subió a Maestro jugando Garen Full AD con ignición. No digo que en todas sus partidas carreó, pero estoy más que seguro que en muchisimas si. ¿Por qué afirmo esto? Porque como jugador de SOLOQ tienes que saber que hay un % de partidas en las que tú vas a carrear, otro % en los que te van a carrear y otro % en las que vas a perder inevitablemente hagas lo que hagas. Obviamente este porcentaje varia dependiendo de jugador en jugador.","replies":[]},{"poster":"SolidDisk","date":"2017-12-10T19:29:12.966+0000","up_votes":1,"down_votes":0,"body":"http://las.op.gg/ranking/ladder/\nEl top 1 tiene 54% de winrate XD.\nhttp://las.op.gg/summoner/userName=kieferr  top 3 uso jayce y salio 10 10 no gano.\n\nlos campeones no carrean nada, depende de quien los juega y como los juega.\n\ndatos curiosos que vi, los challengers a veces juegan cualquier champ (pero saben jugar esos) y ademas practican mucho entre rankeds, pero no espamean partidas. estan lvl 42-43 y eh visto gente lvl 46 en plata y bronce.","replies":[]},{"poster":"NLG Walter","date":"2017-12-10T19:09:38.443+0000","up_votes":1,"down_votes":0,"body":"Garen si puede carrear 1vs9, se usan campeones que solo usan enfriamiento en skills, que matan rapido bichos, que con solo 1 item ofensivo ya tienen decente daño, etc.\n\nEjemplos Yi, Darius, Garen, Riven, Yasuo, Tryndamere, Jax, Nasus.","replies":[{"poster":"SolidDisk","date":"2017-12-10T19:13:02.725+0000","up_votes":1,"down_votes":1,"body":"jayce?\n\nhttps://ugc.kn3.net/i/origin/http://media.tumblr.com/tumblr_lv8ri7yNI81qlnl59.gif","replies":[{"poster":"NLG Walter","date":"2017-12-10T19:20:20.190+0000","up_votes":1,"down_votes":0,"body":"ÑO\n{{sticker:sg-ahri-3}}","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-12-10T19:29:53.643+0000","up_votes":1,"down_votes":1,"body":"Para poder carrear necesitas daño sino dependes del daño de tu team, el problema con usar un campeon tanque es que no aportas daño para romper torres (hay excepciones como trundle).","replies":[]}]}