{"poster":"Gonk","date":"2017-12-28T07:25:01.490+0000","title":"Por que esta tan OP camille con cometa arcano?","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":2,"body":"Pasa esto: hace rato que no la juego porque no le pegaba ninguna runa de precisi&oacute;n (desde mi punto de vista) y hace poco vi que esta muy bien camille con cometa, por que?\r\n\r\n\r\nEspero su respuesta, saludos!","replies":[{"poster":"Tráncos","date":"2018-01-01T02:31:42.747+0000","up_votes":1,"down_votes":0,"body":"Queria saber lo mismo.\nJuego bastan camille pero con la runa de precision el perfecto y siempre la carrro , pero hace dos semanas en kr spamean con cometa supongo que es por su w, desde mi punto de vista con precision esta mas op en late.","replies":[]},{"poster":"Yamisuke","date":"2017-12-28T08:25:34.209+0000","up_votes":1,"down_votes":0,"body":"Coreanos(?","replies":[{"poster":"Gonk","date":"2017-12-28T18:20:41.339+0000","up_votes":1,"down_votes":0,"body":"Casualidad que haya jugado con vos mientras yo era camille?","replies":[{"poster":"Yamisuke","date":"2017-12-29T01:21:01.339+0000","up_votes":1,"down_votes":0,"body":"Aaa eras vos xD Sii, jugué con una Camille con cometa asdf, puede ser","replies":[]}]}]},{"poster":"The Steel Shadow","date":"2017-12-29T00:53:54.126+0000","up_votes":1,"down_votes":0,"body":"Camille esta viable, no Op. Requiere manos para jugarse bien y no es la más jugada de top nunca.\nDejense de joder quiero verla en el mundial y jugarla con seguridad","replies":[]},{"poster":"Not Personal","date":"2017-12-28T12:17:39.941+0000","up_votes":1,"down_votes":0,"body":"Por que entra bien en sinergia con su W (por la relentizacion y el pokeo) y con su E cuando inicias (por que es un stun y por ende le pega seguro)","replies":[]},{"poster":" Ankau","date":"2017-12-28T11:59:15.282+0000","up_votes":1,"down_votes":0,"body":"Yo la uso con estrategia ofensiva y me va super bien siempre. Creo que es cuestión de gustos. De todos modos, me consta que se está usando en general con cometa arcano. Supongo que se debe a su W principalmente, para potenciar su capacidad de pokeo, ya que los relentiza y falicita el impacto del cometa, Haciendo que el daño en el juego temprano sea mucho más contundente. Saludos!","replies":[]},{"poster":"SKT T1 Bank","date":"2017-12-28T10:30:22.268+0000","up_votes":1,"down_votes":0,"body":"DA. El da y la forma en la que le llega el daño al enemigo hace que sea sumatoria. No es lo mismo con una lanza de nidale que ya se esta moviendo el enemigo y cometa no le va a dar nunca.","replies":[]}]}