{"poster":"AVINII","date":"2017-06-27T11:31:32.997+0000","title":"RHAAST & KAYN / ONE OF THE 5 DARKINS???","subforum":"Champions & Gameplay","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/GLQQt","image":"http://i.imgur.com/WY8aB4W.jpg?fb"},"up_votes":1,"down_votes":1,"body":"the new champ is able to transform into a darkin. question now: does this have to do something with Aatrox&acute;s lore??","replies":[{"poster":"LneWolf","date":"2018-07-18T09:41:10.758+0000","up_votes":1,"down_votes":0,"body":"Ihr habt wohl die Story **nicht ganz gelesen.**\nKayn stammt aus **Noxus** und war lediglich als Kindsoldat im Krieg mit Ionia beteiligt.\n**@xSyrusSx** Das ist ja genial! Habe ich bisher nicht drauf geachtet.\nUnd durch die Geschichte vom Rework ist Aatrox das Schwert :)\nAatrox, sowie Rhaast, sind beide Düstere. Aatrox ist dabei der Anführer der Düsteren. \nhttps://universe.leagueoflegends.com/de_DE/story/champion/aatrox/","replies":[]},{"poster":"Snivelyfox","date":"2017-06-29T05:31:12.131+0000","up_votes":1,"down_votes":0,"body":"Kayn hat mit Aatrox an sich gar nichts zu tun. Er ist ein Schattenmagier aus Ionia und Zeds Schüler.\nSeine Sense dagegen ist eine lebende Waffe und ein Düsterer namens Rhaast.\nDie Interaktionen zwischen Kayn/Rhaast und Aatrox gibt es bereits auf Youtube.\nDaraus geht hervor, dass Rhaast und Aatrox Brüder sind. Zumindest sagt Rhaast das, wenn er die Kontrolle über Kayn übernommen hat.\nWenn Kayn und Rhaast noch um die Vorherrschaft kämpfen, verleugnet Rhaast ihn mehr oder weniger und antwortet auf Kayns Nachfrage, ob sie sich kennen nur sinngemäß: \"Uns verbindet eine gemeinsame Geschichte.\"\nWenn Rhaast Aatrox tötet meint er danach: \"Du hättest genauso gehandelt.\", oder: \"Du bist nicht stärker geworden.\"","replies":[]},{"poster":"xSyruSx","date":"2017-06-28T01:14:50.410+0000","up_votes":1,"down_votes":0,"body":"Allerdings kennt Rhaast Aatrox sehr wohl. Rhaast hat einige Sätze die er sagen kann wenn er mit oder gegen Aatrox kämpft.\n\nVermutlich wird Rhaast irgendwie mit Aatrox neuer Lore verbunden, wenn Aatrox mit seinem Rework an der Reihe ist.\nWürde mich nicht wundern, wenn Aatrox eigentlich das Schwert ist, und nicht die Gestalt mit den Flügeln. Man sieht ja was mit\nKayn passiert wenn er von dem Düsteren Übernommen wird.","replies":[]},{"poster":"TerrorRaven","date":"2017-06-27T21:39:11.300+0000","up_votes":1,"down_votes":0,"body":"Aktuell nicht. Aatrox Aufenthalt ist offen (letzter bekannter war Frejörn, wo er Tryndameres Dorf aufgelöscht hat), während Kayn aus Ionia stammt (laut der Ankündigungsseite).","replies":[]}]}