{"poster":"Manaos","date":"2019-03-28T03:38:39.621+0000","title":"No voy a permitir que me roben","subforum":"Problemas Técnicos","up_votes":5,"down_votes":6,"body":"Mas de 7 años jugando a este juego y  esta empresa se da el lujo de robarme, cargue 50 dolares de RP y para el que viva en argentina o sepa como esta la situación en este país sabe que es muchísima guita.\r\nAyer cargue ese monto y todavía estoy esperando que me lo carguen en la cuenta, si alguien sabe del tema o  algún rioter de la cara por esta manga de ladrones.\r\nEl pago lo hice con debito por ese medio que esta en la tienda del cliente de \"BoaCompra\" Y lo peor de todo es que cerre lo mas tranquilo la ventana esa que dice el numero de la transaccion por la confianza que tenia en riot y jamas me llego lo que pague y el unico registro que tengo esta en la App de mi banco, y no puedo poner la screen de la transacción  porque lo unico que dice es el numero de mi tarjeta.","replies":[{"poster":"Riot Ezkii","date":"2019-03-28T16:43:50.772+0000","up_votes":4,"down_votes":0,"body":"Hola Manaos,\n\nLas compras dependiento del método de pago puedes tener retrasos en la entrega, esto puede ser por varios motivos como :\n\n-Retraso en la comunicación entre el banco/centro de pago/etc.  ---> boacompra -----> Riot\n-Saturación de la comunicación\n\nAlgunos métodos pueden presentar un retraso de hasta 48 horas después de la compra.\n\nDe igual he reviso y veo que el RP ya ha sido agregado a la cuenta hace rato.\n\nRecuerda que para cualquier duda en compras con BoaCompra puedes contactarles directamente a su servicio de chat.","replies":[]},{"poster":"Excorpion","date":"2019-03-28T03:45:15.239+0000","up_votes":2,"down_votes":0,"body":"Si lo hiciste por Boa Compra deberías tener hasta un correo con la transacción...\n\nDe todos modos en soporte, billing te atienden rapido en caso de rp","replies":[{"poster":"Manaos","date":"2019-03-28T03:52:09.957+0000","up_votes":1,"down_votes":1,"body":"Me lo dejaron en \"revisión\" No es la primera vez que compro de esa manera, y el soporte no me constesta","replies":[{"poster":"Excorpion","date":"2019-03-28T04:10:45.021+0000","up_votes":1,"down_votes":0,"body":"Pero estas usando el chat cierto ??","replies":[]}]}]},{"poster":"BRRRR","date":"2019-03-28T13:40:32.847+0000","up_votes":1,"down_votes":1,"body":"ward para saber que paso {{item:2055}}","replies":[{"poster":"iNGENiO","date":"2019-03-28T17:40:16.079+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/VInR8x2q-no-voy-a-permitir-que-me-roben?comment=0005\n\nLa verdad que es raro que tengas problemas con el RP siempre en ese sentido\ndan muy buen soporte!","replies":[]}]},{"poster":"MainStarGuardian","date":"2019-03-28T14:23:11.492+0000","up_votes":1,"down_votes":0,"body":"Estas cosas se solucionan, no te estan intentando robar. Una vez tuve que esperar como un mes mientras lo solucionaba con el soporte el problema del RP.","replies":[]},{"poster":"xXLailXx","date":"2019-03-28T13:22:57.786+0000","up_votes":1,"down_votes":0,"body":"se demora hasta 48 hs la entrega no es que te robaron antes de hacer una acusación como me robaron deberías leer las condiciones de uso con cuando realizas una compra es lo primero que se dice cuando comprar con ese medio de pago es que puede demorar 48 hs hábiles la entrega de los rp yo compre también por ese medio la primera que compre con ellos se demoro pór que lo hice con débito   es mas rápido el pago lo haces por rapipago amigo","replies":[]},{"poster":"iNGENiO","date":"2019-03-28T12:38:16.492+0000","up_votes":1,"down_votes":0,"body":"Si compraste por tarjeta de débito, podes también consultar tu cuenta de mercadopagos porque a veces se canaliza por ese medio desde boa compras.\n\nY bueno sin duda usa el chat en vivo \n\ny sino podes arma un ticket","replies":[]}]}