{"poster":"9X THIS VÂYNE","date":"2016-01-12T18:34:25.848+0000","title":"Mausprobleme Hilfe bitte!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo liebe **LoL-Community**,\r\nich habe seit ca. 6 Monaten das gro&szlig;e Problem wegen Einstellungen in LoL &amp; kann deswegen kein LoL spielen. Ich war Master 16 LP und bin jetzt d2 wegen  dieser starken Einschr&auml;nkung. Komme ich zu dem **Problem**: Ich spiele schon seit Season 1 Ende mit &quot;**Normal-Cast**&quot; und wollte vor ca. 6 Monaten wie schon erw&auml;hnt wieder mit Normalcast zocken an einem Tag. Hatte dann leider das Problem das alle meine &quot;Binds/Spells&quot; die ich ausf&uuml;hren wollte nicht gewohnt mit &quot;LM = Linke Maustaste&quot; sondern nurnoch mit &quot;**MAUSRAD KLICK**&quot; gehen. Ich verstehe nicht wieso das so ist, habe mal an irgendeinem Tag eventuell ausversehen was ge&auml;ndert was ohne Absicht war und bereue es bis heute, wenn es an mir lag. Nun ist das bei Smartcast auch so sprich: Alle Spells gehen wie gewohnt mit &quot;Q,W,E,R,4 (Ward) usw.&quot; direkt, da es ja Smartcast ist, doch wenn ich auf die Map unten rechts bei mir draufklicke und z.B gucken m&ouml;chte wo der gegnerische Jungler ist oder oder, das es einfach nur mit &quot;**MAUSRAD MITTE/KLICK**&quot; nurnoch geht. Habe auf verschiedensten Teamspeaks nachgefargt, Skype, Ingame Kollegen gefragt doch es kam keine L&ouml;sung zu stande. Habe auch das meiste schon probiert wie zB. LoL reinstalliert, Input Ordner vom Kumpel angewendet oder eigenen gel&ouml;scht, Ingame alles auf &quot;Standarteinstellunge&quot; zur&uuml;ckgesetzt, und die &quot;Config.&quot; Dateien habe ich auch vom Kumpel &uuml;bernommen. Vielleicht k&ouml;nnte es an den Systemeinstellungen liegen das ich da was mit der Maus umgestellt habe, da ich mich leider nicht bestens da auskenne komme ich nicht weit. Ach PS: An der Maus &amp; PC / USB-Anschluss liegt es nicht da ich das komplett durchprobiert habe, wie gesagt vllt an der Systemsteuerung oder noch was anderes.\r\n\r\nW&auml;re derzeit **permanent** auf Skype, Teamspeak3 usw. ansprechbar, wenn sich L&ouml;sungen bieten.\r\nZudem w&auml;re ich auch &uuml;ber eine deutliche &amp; schnelle Antwort/L&ouml;sung dankbar.\r\nDanke im Vorraus f&uuml;r jegliche Tipps.\r\n\r\nPS:\r\nSkype: martiin.nevaa\r\nTeamspeak3 worauf ich t&auml;glich draufbin: lolarena.eu (Name: twitch.tv/iKurwax &hearts; M&aacute;rtin)\r\n\r\nMFG. ~~M&aacute;rtin~~ !","replies":[{"poster":"9X THIS VÂYNE","date":"2016-01-12T18:47:42.138+0000","up_votes":1,"down_votes":0,"body":"@LEGOFREAK1 kannst du mir es genauer erklären? Wärst du in Teamspeak3/Skype kurz zur Verfügung? Wäre nett.\n\nMFG. Mártin","replies":[{"poster":"legofreak1","date":"2016-01-12T18:51:19.133+0000","up_votes":1,"down_votes":0,"body":"Wo genau hast du denn ein Problem? Die Anleitung gibt das Verfahren eigentlich Schritt für Schritt wieder.\nDas Forum verfügt außerdem über eine \"Antworten\"-Funktion, nutze diese bitte der Übersicht halber.","replies":[{"poster":"9X THIS VÂYNE","date":"2016-01-12T18:53:56.909+0000","up_votes":1,"down_votes":0,"body":"Das Problem liegt einfach darin, das ich das mit \"Mausrad\" alles aktivieren kann. NUR damit! \nÜber Teamspeak3/Skype ginge es in innerhalb 2 Minuten da du dich bestens damit auskennst und ich nicht wirklich ein Freund von Internetanleitungen bin oder halt generell Hilfen. Wärst du so nett und könntest du ebend Teamspeak3/Skype (je nach dem) öffnen? Wäre sehr nett. Einfach nur wegen der \"besseren\" & \"schnellen\" Erklärung deiner seits.\n\nMFG. Mártin","replies":[{"poster":"legofreak1","date":"2016-01-12T18:58:31.951+0000","up_votes":1,"down_votes":0,"body":"Wenn du Probleme mit der Anleitung hast, dann kann ich dir helfen, wenn du mir sagst, wo das Problem liegt. Wenn du aber nichtmal die Anleitung liest oder versuchst nach dieser vorzugehen, dann kann ich dir nicht helfen.","replies":[{"poster":"9X THIS VÂYNE","date":"2016-01-12T19:02:18.576+0000","up_votes":1,"down_votes":0,"body":"Ok, ich habe ja wie schon erwähnt das Problem das meine Maustasten verändert wurden wie auch immer, sprich ich kann alles nurnoch mit \"Mausrad / Mausklick Mitte\" aktivieren. Habe das in die Input dateien eingefügt ( [GameEvents]\nevtPlayerMoveClick=[Button 1]\nevtPlayerSelectClick=[Button 2] ).\nEs hat nix geholfen, & in meiner Inputdatei steht auch nur das ( vor dem Einfügen der GameEventsdatei! )\n\n[Quickbinds]\nevtUseItem4smart=0\nevtCastAvatarSpell2smart=0\nevtCastAvatarSpell1smart=0\nevtCastSpell1smart=0\nevtCastSpell4smart=0\nevtCastSpell3smart=0\nevtUseItem5smart=0\nevtUseVisionItemsmart=0\nevtCastSpell2smart=0\nevtUseItem6smart=0\nevtUseItem1smart=0\nevtUseItem3smart=0\nevtUseItem2smart=0\n\nPS: Kannst du mir vllt kurz schicken wie deine kompletten Input-Dateien aussehen? Also kurz alles reinkopieren.\n\nMFG. Mártin","replies":[{"poster":"legofreak1","date":"2016-01-12T19:07:47.903+0000","up_votes":1,"down_votes":0,"body":"In der Anleitung steht drin, wie du die Änderungen vornehmen musst, damit alles funktioniert. Da alles serverseitig gespeichert ist, ist es mit einem einfachen löschen bzw ändern der Dateien nicht getan sondern muss in einer bestimmten Reihenfolge gemacht werden. Ich habe dir auch gesagt, du magst bitte zuerst deine sämtlichen Einstellungen zurücksetzen, wie dies funktioniert steht ebenfalls in der Anleitung, dazu musst du nicht einmal spezielle Änderungen an den Dateien vornehmen, sondern musst sie lediglich löschen.\nWenn du die Einstellungen zurückgesetzt hast, dann musst du nicht mehr mit dem Mausrad klicken und kannst alles wie gewohnt einstellen.","replies":[{"poster":"9X THIS VÂYNE","date":"2016-01-12T19:13:57.418+0000","up_votes":1,"down_votes":0,"body":"Zitat: Wenn du Probleme mit der Anleitung hast, dann kann ich dir helfen, wenn du mir sagst, wo das Problem liegt @LEGOFREAK1\n\nNaja, will mich nicht beschweren aber diese Antwort war keine große Hilfe auf mein Problem, wollte nur wissen ob du nicht deine Input dateien hier reinschicken kannst, ist ja nix dabei, keine privaten Daten oder sonstiges aber egal, schönen Abend noch.\n\nMFG. Mártin","replies":[{"poster":"legofreak1","date":"2016-01-12T19:19:07.281+0000","up_votes":1,"down_votes":0,"body":"Aufgrund der Art und Weise, wie die Dateien gespeichert werden, würde es dir nur absolut nichts bringen, einfach meine Dateien zu kopieren. Wenn ich dir diese schicken würde, um alles zurückzusetzen, müsstest du nach der oben geposteten Anleitung vorgehen, um sie einzubinden. Und damit sind wir wieder am Anfang. Du sagst selber, du hast bereits die eines Freundes versucht zu kopieren, dies hat anscheinend nicht funktioniert.\n\nDas hier ist nun mein letzter Post in diesem Thema, ich habe dir eine Anleitung geschickt, wie du deine Einstellungen zurücksetzen kannst, um wieder die ursprünglichen Einstellungen im Spiel zu haben. Anstatt diese Hilfe anzunehmen, bist du der Ansicht, dass du weißt, wie es besser funktioniert und diskutierst mit mir rum, was zu tun ist, anstatt meine Anweisungen zu befolgen.","replies":[]}]}]}]}]}]}]}]},{"poster":"legofreak1","date":"2016-01-12T18:36:50.080+0000","up_votes":1,"down_votes":0,"body":"In unserer Toolbox haben wir eine Anleitung zum [vollständigen Zurücksetzen der config-Dateien](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0001). Geh die bitte durch, danach sollten alle Einstellungen auf standard zurückgesetzt sein.","replies":[{"poster":"StillYasuoMain","date":"2016-01-12T18:40:17.638+0000","up_votes":1,"down_votes":0,"body":"Könntest du mir da helfen?\n\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/wfnLxmm3-spiel-startet-nicht-brauche-hilfe\n\nBitte schnell weil ich bekomme sonst eine Afk strafe.","replies":[]}]}]}