{"poster":"Exangambit","date":"2015-06-11T20:57:05.790+0000","title":"Random high ping during games","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hi, \r\n\r\nIts got to that point now that I am unable to play ranked anymore as at random times during the game I can get ping spikes around 300-400 ping.\r\nThe worst has been at least 2k ping, its starting to get a bit ridiculous. And from what I remember I think this started happening since patch 5.7.\r\nMy friend who is also in the same city as I am also gets these random ping spikes also and we are with different ISPs.\r\nWe live in New Zealand.\r\n\r\nIts not a constant high ping, but annoying during lane phase and team fights when it occurs.\r\nIf anyone else in New Zealand or on this server in general is getting the same kind of issues then please sound off. I don&#039;t believe this has to do with my set up if I know other people who are getting this also.\r\n\r\nAny help will be appreciated","replies":[{"poster":"HORSE OF FORCE","date":"2015-06-12T00:38:28.395+0000","up_votes":1,"down_votes":0,"body":"Are you with Spark?","replies":[{"poster":"Exangambit","date":"2015-06-12T03:48:52.770+0000","up_votes":1,"down_votes":0,"body":"Nope Slingshot, BUT my friend is with Spark.\n\nnot sure if Slingshot/Spark go with the same exchanges etc. But maybe!","replies":[{"poster":"HORSE OF FORCE","date":"2015-06-12T07:27:02.639+0000","up_votes":1,"down_votes":0,"body":"It's a possibility. I've just heard absolute nightmares from Spark users and League, which pretty much match up to what you described.\n\nIf possible, try using another internet source such as tethering your phone's data (League game usually takes 15MB) or going to a public Wifi hotspot, in addition to switching out wireless for wired in your own home.\n\nCan you do a network diagnostics? Go to this site: http://netalyzr.icsi.berkeley.edu/ and perform a test. You need Java enabled. Report here any findings that appear as red in your diagnosis; the rest is usually irrelevant. **Do not post the entire report in the post.**","replies":[{"poster":"CaZm","date":"2015-08-19T08:11:43.718+0000","up_votes":1,"down_votes":0,"body":"I use Spark internet and it is absolutly terrible, ping spikes all the time, and crashes every other hour and makes you have to reset your client, its disgusting how they get away with providing this \"service\".","replies":[]}]}]}]}]}