{"poster":"DARKYNSOLOTOP","date":"2018-01-01T10:33:30.646+0000","title":"Problemi durante l'installazione di lol con la directx 9","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"In pratica ho avuto un problema con l&#039;intero pc e ho dovuto far pulizia disinstallando e installando programmi tra cui lol, ma durante l&#039;installazione mi da problemi con la directx 9, io ho la direct aggiornata fino all&#039;undici 11, da quello che ho capito e che avendo gi&agrave; quei componenti vanno in contrasto perch&egrave; l&#039;installazione di lol fa automaticamente l&#039;installazione del directx 9 che io gi&agrave; ho...non so come fare, qualcuno che ha avuto il mio stesso problema?","replies":[{"poster":"Chroniicles","date":"2018-01-02T14:06:49.863+0000","up_votes":1,"down_votes":0,"body":"Ciao! Molto probabilmente devi reinstallare semplicemente le [librerie visual c++](https://support.microsoft.com/it-it/help/2977003/the-latest-supported-visual-c-downloads).\n> da quello che ho capito e che avendo già quei componenti vanno in contrasto perchè l'installazione di lol fa automaticamente l'installazione del directx 9 che io già ho\n\nnon è questo il problema, puoi star tranquillo ;)","replies":[]},{"poster":"Orniflex","date":"2018-01-02T13:24:32.779+0000","up_votes":1,"down_votes":0,"body":"Directx9 e 11 sono due cose diverse. Scarica  la versione del directx9 dal sito microsoft ufficiale.\nSe dovessi riscontrare problemi esegui un avvio pulito di windows!","replies":[]},{"poster":"Marksson","date":"2018-01-02T06:43:41.263+0000","up_votes":1,"down_votes":0,"body":"Premetto di non avere specializzazioni di alcun tipo in ambito informatico, ma possiedo solo esperienza, Directx9 dovrebbe essere annullato o perlomeno installato e non sostituito al classico 11 nel tuo caso, quindi per permettere la sua installazione ho bisogno di ulteriori informazioni; Se ti va dammi qualche contatto social in modo tale che possa aiutarti meglio.","replies":[{"poster":"DARKYNSOLOTOP","date":"2018-01-02T07:52:52.601+0000","up_votes":1,"down_votes":0,"body":"https://www.facebook.com/pasquale.carnevale.9","replies":[]}]}]}