{"poster":"Lucky","date":"2015-07-13T20:04:56.892+0000","title":"\"Division 5 is basically the tier below\"","subforum":"Gameplay","up_votes":116,"down_votes":11,"body":"Sorry but I think we deserve some credit for surviving promos","replies":[{"poster":"Deep Terror Nami","date":"2015-07-13T20:17:10.996+0000","up_votes":103,"down_votes":3,"body":"Division 1 is pretty much Division 2\nDivision 2 is pretty much Division 3\nDivision 3 is pretty much Division 4\nDivision 4 is pretty much Division 5\n\nTherefore, Division 1 is pretty much Division 5, which is basically the tier below it.\n\nWe are all Bronze 5. Tiers and Divisions are an illusion.","replies":[{"poster":"FamousJ6","date":"2015-07-14T15:59:58.966+0000","up_votes":1,"down_votes":0,"body":"Rank is a rooster illusion.","replies":[{"poster":"Deep Terror Nami","date":"2015-07-14T16:02:32.052+0000","up_votes":7,"down_votes":0,"body":"Rooster illusion? Is that like cock magic?\n\nhttps://38.media.tumblr.com/fe1289550f0068a1d4265463d8a25938/tumblr_nfeu0knF5W1qz8x31o1_500.gif","replies":[]}]},{"poster":"Solari Fortune","date":"2015-07-15T00:44:02.017+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Valkyrie Witch,realm=NA,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=0001,timestamp=2015-07-13T20:17:10.996+0000)\n>\n> Division 1 is pretty much Division 2\n> Division 2 is pretty much Division 3\n> Division 3 is pretty much Division 4\n> Division 4 is pretty much Division 5\n> \n> Therefore, Division 1 is pretty much Division 5, which is basically the tier below it.\n> \n> We are all Bronze 5. Tiers and Divisions are an illusion.\n\nIf Tiers and Divisions are illusions, doesn't that mean Bronze 5 is an illusion as well?","replies":[{"poster":"Deep Terror Nami","date":"2015-07-15T01:04:21.129+0000","up_votes":3,"down_votes":0,"body":"Not necessarily, because Bronze 5 is love. Bronze 5 is life.","replies":[]}]},{"poster":"Sukishoo","date":"2015-07-13T23:11:53.085+0000","up_votes":2,"down_votes":1,"body":"Yes, we all are ONE!","replies":[]},{"poster":"gaby1best","date":"2015-07-14T15:56:46.350+0000","up_votes":1,"down_votes":0,"body":"Came for this.","replies":[]},{"poster":"Taarki","date":"2015-07-14T12:41:03.337+0000","up_votes":1,"down_votes":0,"body":"Clearly Bronze 5 is challenger 1.","replies":[]}]},{"poster":"MetalGearTeemu","date":"2015-07-13T20:44:42.558+0000","up_votes":31,"down_votes":2,"body":"All are bronze until challenger. \n\nThen its silver.","replies":[{"poster":"idoki","date":"2015-07-14T10:51:49.047+0000","up_votes":1,"down_votes":0,"body":"What happens when you get rank 1?","replies":[{"poster":"MetalGearTeemu","date":"2015-07-14T17:20:17.354+0000","up_votes":4,"down_votes":0,"body":"Then you begin never-ending gold promotions. \n\nEnjoy your stay in hell. \n\n{{champion:17}}","replies":[]}]}]},{"poster":"Gorgannan","date":"2015-07-14T01:49:34.170+0000","up_votes":14,"down_votes":1,"body":"\"Golds pretty much silver.\"\n\nIf that were true, they'd be in gold and I'd be in silver. \n\nNo, Gold is Gold. And it feels good.","replies":[{"poster":"Transgressor","date":"2015-07-14T01:56:01.064+0000","up_votes":3,"down_votes":7,"body":"Gold's players are worse than silver 4.","replies":[{"poster":"Rinky Dinky","date":"2015-07-14T02:23:35.575+0000","up_votes":11,"down_votes":2,"body":"Yeah thats why they are in a higher division.","replies":[{"poster":"Auz the Ripper","date":"2015-07-14T03:05:23.524+0000","up_votes":11,"down_votes":0,"body":"Yep, this game is scored like golf\nDidn't you know that?","replies":[]},{"poster":"Troll for Trump","date":"2015-07-14T05:57:26.688+0000","up_votes":1,"down_votes":8,"body":"hurrdurr that's why they are in a higher division. No they just play more. Anyone can get to a higher rank by spam playing the shit out of the game. But people have lives. Heck you want to boast about \"being gold\"? Go on Ebay.","replies":[{"poster":"Canechurch","date":"2015-07-14T09:22:37.506+0000","up_votes":3,"down_votes":1,"body":"I work a 50-60 hour work week doing commodity financing at a bank and still climbed from s3 to gold2 in the last two months. Try again.","replies":[{"poster":"5TWqBDnzUz","date":"2015-07-14T13:27:05.205+0000","up_votes":2,"down_votes":1,"body":"Despite his immaturity, I see what VulDread is saying. There are a fair few gold 5s with ~1k wins who literally bruteforced their way into gold, followed by avoiding ranked for the rest of the season. Riot for whatever reason turned off LP decay for gold, making this possible.","replies":[{"poster":"Canechurch","date":"2015-07-14T14:06:05.699+0000","up_votes":3,"down_votes":1,"body":"The counterpoint being that after ~1k wins they learned enough to actually play at Gold V (I know it probably took me that many games) and then were too afraid to risk that after 1k wins. For me I got Gold V in preseason, placed Silver, got Gold V again, demoted, got Gold V again, demoted (a lot of that was more slacking off, at the time it took a lot of energy for me to play at a level that could get me promoted) and only now have gotten myself solidly into gold (promoted to Gold II last night, eyes on plat!)\n\nMy point is more that its a fine line between S1 and Gold V and usually to force your way up you need to play on the ball for that level, and eventually it becomes more natural for you. If anything 1k wins evidenced that someone is closer to their true skill rather than brute forcing their way up. I'm much more suspicious of a Gold V with 8 wins and 2 losses.","replies":[{"poster":"Troll for Trump","date":"2015-07-15T08:50:24.699+0000","up_votes":1,"down_votes":0,"body":"Im pretty sure you cant go from division 5 of the next tier to division 1 of the former tier...","replies":[{"poster":"Canechurch","date":"2015-07-15T09:04:35.549+0000","up_votes":1,"down_votes":0,"body":"Having been demoted twice this season, I can say with absolutely certainty that you can. That was the case last season but they changed it in S5","replies":[{"poster":"Troll for Trump","date":"2015-07-16T23:38:40.869+0000","up_votes":1,"down_votes":0,"body":"really, that's dumb af.","replies":[{"poster":"Canechurch","date":"2015-07-17T07:51:53.236+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VulDread,realm=NA,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=000a000000000001000000000000000000000000,timestamp=2015-07-16T23:38:40.869+0000)\n>\n> really, that's dumb af.\n\nNot really. I was tilting super hard, I deserved to get demoted.","replies":[]}]}]}]}]}]},{"poster":"Transgressor","date":"2015-07-14T16:35:53.316+0000","up_votes":2,"down_votes":1,"body":"Which leaves 110-100 hours each week for your personal leasure. 2 hours of league a day are easily feasible, which if consumed exclusively by ranked is actualy pretty viable. Not to mention nobody's stopping you from playing all you want at weekends. In the span of +/- 2 months that's plenty of time. You are working 7-8 hours a day anyways(I don't know how timetables work at a bank) which is MUCH sorter than your average blue-collar, especialy with how things are here in Europe.","replies":[{"poster":"Canechurch","date":"2015-07-14T17:56:34.029+0000","up_votes":1,"down_votes":0,"body":"I'm working 9ish typically, up at 8am, in at 9am, out at 6 (530 on a good day, 7-730 on a bad one). Two nights a week I've usually got something going on and cant play, but during the day on weekends, two hours before bed (from like 9-11), and a fair bit on saturday and sunday. It's plenty of time, while still having a life - that's my point!\n","replies":[]}]},{"poster":"Maliginant","date":"2015-07-14T17:19:22.307+0000","up_votes":1,"down_votes":0,"body":"From my experience, if you're a halfway decent player you can get directly seeded into gold or high silver. E.g. I was gold v last season and got seeded into gold iv this one.","replies":[]}]}]}]}]},{"poster":"Zair Umbras","date":"2015-07-14T03:17:15.849+0000","up_votes":5,"down_votes":1,"body":"Plat is pretty much Bronze. With more bitching. Lots more bitching. Like, when I was in Bronze as a noob in S3, I worked my ass off to get to Silver 1 and the bitching got lower.. and lower... then I got to Plat 1 in S4 and I had so much more bitching without much improvement on the player's skills. I'm in plat now and I'm wondering if it was worth the climb. :( Gold at least had the funny whiners where they talk like they're all big and you're just sitting there laughing at them. Plat has the 'GG. First blood' ones who question why you're not being a META sheep, like rushing an Athene's over a Nomicon because you need the MR. lol.","replies":[{"poster":"5TWqBDnzUz","date":"2015-07-14T13:32:30.806+0000","up_votes":1,"down_votes":0,"body":"It's different on OCE...\nB5-B2 don't play serious.\nB1 want silv and will rage like hell if you make the smallest mistake or do something differently to they would.\nSilv 5 is b5-b2 attitude (they've made it now, they no longer take it serious again)\nsilv4-1 is full on raging idiots.\ngold5 is full of cheese champion mains thinking they deserve challenger while they're on 0 points (riv/yas/kat/etc)\ngold 4-1 get a little annoyed, but they at least want to win rather than wanting to annoy people or ruin their experience.\nplat 5 is the most confusing league, there's a massive variety of players, all with different attitudes. Once you hit plat 4 (physically or MMR wise, MMR in the case of my smurf) they literally don't talk all game... Just complete silence. You'll see a \"lol\" in some cases where something unique/weird happens, that's about it. It's really weird.","replies":[{"poster":"Zair Umbras","date":"2015-07-15T00:13:03.961+0000","up_votes":1,"down_votes":0,"body":"I have learned where I wish to go then because I'm in Plat and it's the equivalent of your gold 5.","replies":[]}]}]},{"poster":"MetalGearTeemu","date":"2015-07-14T17:19:31.449+0000","up_votes":1,"down_votes":0,"body":"its nice to get gold because it means the skin... \n\nbut never forget my friend... \n\nGold is the HEAVIEST metal.","replies":[]}]},{"poster":"Shroom Junkie","date":"2015-07-13T20:09:16.859+0000","up_votes":15,"down_votes":8,"body":"uh\nyeah\ni sooo survived promos...\ndidn't like get put in silver 5 by default or anything...\nI DESERVE CREDIT!\n:D","replies":[{"poster":"Rinky Dinky","date":"2015-07-14T00:07:54.391+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"Shroom Junkie","date":"2015-07-14T01:01:55.506+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=Lane Cancer,realm=NA,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=00000001,timestamp=2015-07-14T00:07:54.391+0000)\n>\n> You deserve the downvotes for acting like a child yes\n\nWait wtf.\nWhy do I have 5 downvotes? I was making a joke... seriously I never actually went through promos I just went through the placements and got in Silver V. q.q","replies":[{"poster":"FluxBound","date":"2015-07-14T04:33:42.795+0000","up_votes":2,"down_votes":0,"body":"people are angry that they got placed below you","replies":[]}]}]}]},{"poster":"Kenshikenji","date":"2015-07-14T03:23:39.121+0000","up_votes":1,"down_votes":1,"body":"Division 5 isn't necessarily the same as the tier below, but they're usually flooded with players who probably don't belong there and are too scared to play more ranked in case they get demoted. From personal experience though, and as many people will tell you, rank regardless of tier or division doesn't really tell you anything about the players skill level. I've seen people in my Elo (high plat) who range from great to the kind of no map awareness, feeding, flaming, mechanically awful non-meta picking crap you'd expect in bronze.....and not rarely, its quite scarily often tbh. At the same time I know people who are stuck in silver who are mechanically amazing, like \"diamond\" level. \n\nBut yeah, I understand why people say this, because often the division 5 players don't display enough of the qualities EXPECTED of that elo, because they barely belong there if they can't get out of division 4/5 of that tier. If that's because they haven't played much (because they are scared of getting demoted) fine, you can't really judge if they \"are that tier level\" because they haven't had enough experience around that tier to judge either way. If they have played many games and can't get out of X 5/4 chances are they may not be good enough to \"qualify\" for that tier..... It's all ridiculous tbh, most people who say \"x 5 doesn't count\" are just lower elo jealous people anyway....but again based on personal experience of \"X 5\" players....they do often suck compared to what you'd expect of them. Mainly diamond 5's or diamonds last season. I assume they were only diamond 5 because they nearly all seem to suck ass. and I can't imagine they got far into diamond with silver mechanics and a bronze attitude.","replies":[{"poster":"Canechurch","date":"2015-07-14T09:33:05.720+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kenshikenji,realm=EUW,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=000c,timestamp=2015-07-14T03:23:39.121+0000)\n>\n>At the same time I know people who are stuck in silver who are mechanically amazing, like \"diamond\" level. \n\nI feel like this is not true.","replies":[{"poster":"Gelgamek","date":"2015-07-14T15:00:55.449+0000","up_votes":1,"down_votes":0,"body":"LOL def not true..","replies":[]}]}]},{"poster":"Dengeden","date":"2015-07-14T05:54:52.185+0000","up_votes":2,"down_votes":0,"body":"But should we get credit for hanging in there with 0 LP? *Cue inconspicuous whistling*","replies":[{"poster":"SH Azykan","date":"2015-07-14T07:12:55.746+0000","up_votes":2,"down_votes":0,"body":"what about -3 lp? Do I get credit for that? :D\n(had to dodge my first game after I completed my series...)","replies":[]}]},{"poster":"KoKoboto","date":"2015-07-14T05:14:57.655+0000","up_votes":2,"down_votes":0,"body":"I got more Bronze 1 to Bronze 2, to Gold 5 by mostly playing Quinn\nWhen I got to gold I instantly noticed the atitutude change\nNow after screwing around a ton in normals *probably at silver mmr* I can tell the difference between a silver and gold, skill-wise sometimes not much but atitude and decision making big time (sometimes)","replies":[{"poster":"Troll for Trump","date":"2015-07-14T05:54:48.294+0000","up_votes":1,"down_votes":3,"body":"you mean gold players are even more toxic and larger douches and have almost just as worse decision making skills; perhaps even worse than silver palyers because they like to fuel their ego?\n\n\nAlso, getting out of bronze, I came out to find Silver is more toxic than Bronze. That's just....","replies":[{"poster":"Canechurch","date":"2015-07-14T09:31:48.146+0000","up_votes":1,"down_votes":0,"body":"Actually, in EUW at least, people in Gold 4 - 2 know what they're doing way more and on average are much more chill than silver 4-2 from my experience. Fewer deaths per game, better farm, better grouping, better warding. People also less frequently tilt hard and go 0-10, stopping the bleeding at 0-3,4 (of course there are exceptions to everything) My experience anyway.","replies":[]}]}]},{"poster":"48983507DEL1","date":"2015-07-14T01:31:17.553+0000","up_votes":2,"down_votes":0,"body":"Think of Divisions 5 as the bottom of an actual ladder. The bottom is where people are pushing and shoving trying to get on while avoiding people falling back down it. The higher you get, the more people you bump off the ladder, and you have less clutter in the way, making you stand out more.","replies":[]},{"poster":"Rinky Dinky","date":"2015-07-14T00:07:04.126+0000","up_votes":2,"down_votes":0,"body":"Oh okay then challengers is basically masters.\n\nThat numbr 1 spot is basically numba 2","replies":[]},{"poster":"HateDaddy","date":"2015-07-14T01:04:54.611+0000","up_votes":2,"down_votes":1,"body":"You'll play against the same players, especially once you get above 60 LP in division 1. The div 5 players will typically not be playing with nearly the sense of urgency since they shouldn't be in real danger of being demoted. Trust me, div 5 0 LP lifers have ruined more games for me than div 1s trying to climb have.","replies":[]},{"poster":"Drunk Rummate","date":"2015-07-15T15:12:23.109+0000","up_votes":1,"down_votes":0,"body":"\"Division 5 is basically the tier below, except at one point you got lucky and won 3 games out of 5\"\n\nHappy?","replies":[]},{"poster":"s LessThanThree","date":"2015-07-15T14:38:49.651+0000","up_votes":1,"down_votes":0,"body":"division 5 is where all the boosted accs, tilted ragers, trolls, and people who only play once a week for season bonuses live. That and people who got carried there and are on the way to being dropped. This applies for every Division 5 except for Bronze, increasing in severity as you go higher (Diamond 5 being the worst)","replies":[]},{"poster":"Beerstein","date":"2015-07-15T04:17:39.390+0000","up_votes":1,"down_votes":0,"body":"Am I the only one that thinks there's a large skill gap between Silver 1 and Silver 2 players?\n\n> [{quoted}](name=Matthias9119,realm=NA,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=000d00000000,timestamp=2015-07-15T04:08:58.625+0000)\n>\n> If it was \"balanced\" then there wouldn't be 50-100% more people above each tier division than below it.  You can see that as the divisions go up, the number of players in each division goes down except at the tier boundaries.\n> \n> e.g.:\n> \n> S3: 126K players\n> S2: 109K players\n> S1: 64K players\n> **G5: 108K players**\n> G4: 52K players\n> \n> Of course, that's exactly what you'd expect from the way Riot has set it up.  Anyone who can hold their own in S1 is one lucky winning streak away from promoting to G5, and then they \"stick\" in G5 for the rest of the season.\n\n\nA lot are also 0LP G5 because friends carried them for skins. Heck almost all the people I know in 0LP G5 got carried there.","replies":[]},{"poster":"Matthias9119","date":"2015-07-14T03:42:39.037+0000","up_votes":1,"down_votes":0,"body":"If you look at the distribution (ex: http://na.op.gg/statistics/tier/ )\n\nIt's pretty clear that somewhere between, I dunno, 1/5 and 1/3 of the players in a \"V\" division would probably be in the next tier down if it wasn't so hard to demote.","replies":[{"poster":"thePandev","date":"2015-07-14T06:24:53.896+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Matthias9119,realm=NA,application-id=3ErqAdtq,discussion-id=PGm36z1f,comment-id=000d,timestamp=2015-07-14T03:42:39.037+0000)\n>\n> If you look at the distribution (ex: http://na.op.gg/statistics/tier/ )\n> \n> It's pretty clear that somewhere between, I dunno, 1/5 and 1/3 of the players in a \"V\" division would probably be in the next tier down if it wasn't so hard to demote.\n\nExcept that's pretty much balanced by the fact that you have to go through promos","replies":[]}]}]}