{"poster":"Wotlog","date":"2019-02-18T16:28:59.820+0000","title":"DeVotion eSports Academy sucht Substitute Jungler für SINN League","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Unser Main Jungler f&auml;llt ungl&uuml;cklicherweise f&uuml;r die n&auml;chsten drei Wochen komplett aus, weshalb wir kurzfristig einen Ersatz im Bereich Dia+ suchen, der bereit ist seinen Platz, f&uuml;r diesen Zeitraum, innerhalb unseres Teams f&uuml;r die Summoner&rsquo;s Inn League 2. Division einzunehmen.\r\n\r\nUnser Team ist Teil eines des gr&ouml;&szlig;ten deutschen League of Legends Clans, DeVotion, mit Spielern und Teams von Challenger bis Bronze und spielt im Moment in der SINN League Division 2.2 mit u.a. Panthers Gaming und dem Spandauer Inferno. In dir suchen wir einen neuen, motivierten Spieler, der bereit ist sich als Ersatzspieler kurz- bis l&auml;ngerfristig in unser Team zu integrieren, um unsere Erfolgsgeschichte in der SINN League gemeinsam mit dir fortzusetzen.\r\n\r\nWir bieten dir hier die M&ouml;glichkeit dich in einem kompetitiven Umfeld auszuprobieren oder selbst wiederzufinden. Nach deinem aktiven Einsatz innerhalb der SINN League und nach R&uuml;ckkehr unseres Main Junglers, steht es dir frei dem Team weiterhin als aktiver Substitue Jungler erhalten zu bleiben, dich einem der unz&auml;hligen anderen Teams bei DeVotion anzuschlie&szlig;en, oder, selbstverst&auml;ndlich, uns g&auml;nzlich zu verlassen um deine neu gewonnen Erfahrungen anderorts einzubringen.\r\n\r\nUnser Team umfasst im Moment 8 hoch motivierte Mitglieder, vier Spieler im Main Roster von Jungle bis Support, drei Substitute Spieler auf den Positionen Top, ADC und Support, alle sieben im Bereich Diamant+, sowie einen Coach, mich selbst.\r\n\r\nWir trainieren mehrmals die Woche mehrere Stunden mit Pre- und Postgame Analysen, Scrims und Theorieeinheiten um unsere Ziele zu erreichen.\r\n\r\nWas wir von dir erwarten:\r\n\r\n-\tGeistige Reife und ein Mindestalter von 18 Jahren\r\n-\tDerzeitige Elo von Diamant oder h&ouml;her\r\n-\tP&uuml;nktlichkeit und Zuverl&auml;ssigkeit\r\n-\tEinen mittelgro&szlig;en bis gro&szlig;en Championpool\r\n-\tKritik- und Konzentrationsf&auml;higkeit\r\n-\tOffene und kommunikative Pers&ouml;nlichkeit\r\n-\tAktivit&auml;t innerhalb des Spiels auch au&szlig;erhalb der Trainingszeiten\r\n\r\nWas k&ouml;nnen wir dir bieten:\r\n\r\n-\tEin Main Roster das schon seit einem Jahr erfolgreich zusammenspielt\r\n-\tCoach, Analysen und Scrims\r\n-\tTeamspeak3 Server mit ~80 aktiven Mitgliedern pro Tag\r\n-\tDie Aussicht auf Ruhm und Ehre\r\n\r\nFalls wir dein Interesse geweckt haben, f&uuml;ge mich einfach im Client hinzu, damit ich dir ein paar Fragen zu deiner Person stellen kann und du auch die M&ouml;glichkeit bekommst uns ein paar Fragen zu stellen. Wenn das alles geklappt hat und wir denken, dass auch du gut zu uns passt, werden wir dich zu einem Tryout einladen.\r\n\r\nAbschlie&szlig;end bleibt mir nur zu sagen, auch wenn dieses Anschreiben sehr steif und strikt wirkt, sind wir zwar innerhalb des Spiels eine disziplinierte und koordinierte Einheit, aber au&szlig;erhalb einfach nur genauso bescheuert wie alle anderen. Dieses Team wurde urspr&uuml;nglich von Freunden gegr&uuml;ndet um Spa&szlig; zu haben und das soll auch bei uns nicht verloren gehen :)\r\n\r\nWir freuen uns auf deine Bewerbung.\r\n\r\nDeVotion eSports Academy","replies":[]}