{"poster":"BeckasDoor","date":"2017-07-23T09:44:20.367+0000","title":"Devistating win rate in ranked.","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"So a little back story on me, I played dota, dota 2, hon, and hots all before playing this game. In every one of them I preform pretty well. My most recent accomplishment would be Plat in hots. Now obviously hots isn&#039;t at all on the same league as this game, but I just wanted to give some pretext. So I just started about a month ago and finally hit level 30 and Ihave to say ive been having a miserable experience in ranked. As far as my placement goes, I was put in silver 5 and to be honest I was happy about it. Mechanically, I have mobas down pretty well, but this game comes with its own unique set of challenges that sets it apart from other mobas, so I figured placing low and slowly climbing would suit me well. However, I have been applying ointment to my anus every day because of how hard I&#039;m being penetrated. I literally have a %20 winrate in ranked. Now sure, you could say that I&#039;m simply a bad player, but my counter argument would be that I&#039;m supposed to be placed with players at the same skill level as me. I really don&#039;t understand how riot could believe that this is acceptable. What makes matters worse is that, when I check my teams W:L ration before every game the common theme seems to be my team is full of %20-%30 win rates, while the enemy is sitting at roughly %50. I don&#039;t know, maybe I&#039;m just ranting, but I&#039;m hoping someone could shed some light on the issue I&#039;m having.","replies":[{"poster":"Sanctimonious","date":"2017-07-23T11:52:48.032+0000","up_votes":1,"down_votes":0,"body":"You went 4/6 in promos, and your Normals MMR is silver 5. I think the system is trying not to drop you because of the way your original placements works, and it thinks you got \"unlucky.\" You appear to keep getting matched with Bronze 1's, despite losing so it's possible that you had higher than silver mmr when you got placed. Maybe you're a bronze 3/2 player in ranked, but a silver in normals. \n\nIn terms of improving, i sent a friend request if you're interested. I'm usually around plat / diamond in league.","replies":[]},{"poster":"Leylania","date":"2017-07-23T10:13:48.228+0000","up_votes":1,"down_votes":0,"body":"Maybe it would be better if you first play some normal games and try to improve and then go back to ranked? Looking at your matchhistory your stats don't look good at all but if you have experience with mobas it should be an easy thing for you to improve.\n\nHere you can see your matchhistory and all your stats and whatever you need to know https://na.op.gg/summoner/userName=BeckasDoor\n\nFor Builds you should go to http://www.probuilds.net/ and look up the champion you need a build for.\n\nNow first thing I see on your matchhistory is that your CS (creep farm) is aweful most of the games, go into a bot game or practice mode and just cs for some time, should help you improve in it and will give you more gold to spend ingame. Aim for 60 cs in 10 Minutes and around 120-150 in 20-25 Minutes. Then atleast 200 in 30 Minutes. With a bit of practice this should be no problem for you soon. \n\nNext tipp is to look for a few champions to main and improve on them instead of spaming different champs all the time. Get a main champion for atleast 2 roles that you learn to master (and some more that you should be comfy on), those will be your high winrate pocket picks. You should get a main role aswell (adc or mid for example), on this role you should have a few more champions you can play so you can swap depending on the matchup while keeping up your high winrate. Having a champion \"mastered\" helps to improve overall since you can try new things without having to worry about your mechanical skills on your champion. \n\nNext thing is that exspecially low elo players like to ignore: Warding. Having vision will win or lose you the game. If you don't know where the enemy jungler or midlaner is you will most likely die to a gank since you had no idea that it's coming. Always buy a control ward when you go back and have the money to buy one (75 gold is not that expensive) and don't forget to place it and use your yellow trinket. If you are unsure where good warding spots are, feel free to ask here or watch hig elo players and see where they place their wards in certain situations.\n\nNext thing is a bit more complex but just as important as warding, the macro gameplay. This will come with experience but always remember: objectives >>>>> kills\nIf you have the chance to go for a tower, drake, baron or rift herald then go for it, don't chase the half dead enemy laner that ran into his jungle. Use the situation to bring your whole team ahead (a single kill won't do that, a fallen tower which opens up the lane will).\n\nYour mindset is the next important thing. Don't flame or tilt. If someone flames you mute him, report him after the game and move on. Tilting will make you play worse and flaming will break your teams concentration and make them play worse aswell.\n\nOne more thing that some people forget is: Inform yourself about the game. You can't win if you don't know what skills the enemy champion has or what stats he gains from his items. Start reading patchnotes http://na.leagueoflegends.com/en/news/game-updates/patch and overall learn the champions and items. Watching the lcs (profesional league) can help you with improving overall, but you need game knowledge first to understand what they are doing.\n\nHope this helps you with improving yourself ^^","replies":[{"poster":"BeckasDoor","date":"2017-07-23T10:19:24.579+0000","up_votes":1,"down_votes":0,"body":"This makes plenty of sense and I'll make more of an effort at \"mastering\" a champ before playing ranked but we're talking about bronze-silver elo. My mmr is on par with everyone else's. It makes no sense to get smashed every game.","replies":[{"poster":"Geauxx","date":"2017-07-23T11:39:10.388+0000","up_votes":1,"down_votes":0,"body":"The base mmr for an account playing ranked for the first time will almost always place silver5, now whether or not you have enough of an understand to play better off it or now will be depend if you can can increase or decrease it.\n\nIf it's dropping that rapidly then it's just that you don't have that much of an understanding, simple as that.","replies":[]},{"poster":"Leylania","date":"2017-07-23T10:25:28.458+0000","up_votes":1,"down_votes":0,"body":"Your mmr will drop. You had the luck to get placed in silver 5 because it's your first season of ranked where your ranked mmr isn't that bad yet. You already dropped to bronze and with your current winrate it is very likely to drop down further and further. That is why you get smashed. You don't play on silver level right now, not even on high bronze. You just had the luck to get placed higher than where your skill level is currently (sounds harsh but that's how it is)","replies":[]}]}]},{"poster":"MoldyCheese1","date":"2017-07-23T10:36:10.490+0000","up_votes":1,"down_votes":0,"body":"ok, heres what ill say, a thing your going to need to look at is \"the meta\" of champions that are good, great, ect.\nnot saying you need to play them you can get anywhere with anyone but meta will be easier, but you will need to learn how to fight champions based off who you want to main, look up counter for your champ(s) so you know who to essentially ban and learn to roam, farm well ect. cant explain too much out of a discord/skype call but thats all up to you, im not the best im gold 5 but figured i could help :P\n{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"archerno1","date":"2017-07-23T09:46:57.252+0000","up_votes":1,"down_votes":0,"body":"Your problem is your choice of champions and builds. Your are handicapping yourself for no reason. \n\nFor example, on Jax your last game, you built Titanic Hydra as jungler. Titanic is great for top Jax for splitpush. With that build you never group with your team, you just push. If you splitpush as Jungler , enemy team will take all neutral objectives.\n\nYou played Amumu top into Jax and rushed Rod of Ages. Jax probably demolished you. You should have rushed {{item:3110}}  to reduce his attack speed.\n\nHave you considered playing support until you learn a bit about game, champions and such?","replies":[{"poster":"BeckasDoor","date":"2017-07-23T10:14:01.578+0000","up_votes":1,"down_votes":0,"body":"Yeah my jungler was also a bronze lee sin that never ganked and they had a Vi that just dicked me permantly. Yeah my Build is pretty bad sure but so my asshole after the fucking I received from them.","replies":[]}]},{"poster":"MoldyCheese1","date":"2017-07-23T09:47:31.702+0000","up_votes":1,"down_votes":0,"body":"if you want i can inv you to a discord and talk about this, not a rioter, but ive been mad at this system 2 and can prolly help a little","replies":[{"poster":"MoldyCheese1","date":"2017-07-23T09:48:40.762+0000","up_votes":1,"down_votes":0,"body":"https://discord.gg/wY6CDz heres the link dont need to click, im fine with typing this is just faster.","replies":[]}]}]}