{"poster":"Released Ape","date":"2017-08-08T16:37:22.135+0000","title":"Dieser Moment, wenn du realisierst das Riot etwas gut gemacht hat","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":2,"body":"Ich wei&szlig; das passiert &auml;u&szlig;erst selten, meistens bemerkt es gar nicht. Doch eins muss ich sagen, auch wenn es sehr sp&auml;t kommt, das neue Ban System ist um Welten besser!\n\n- Deutlich schneller\n- Jeder kann mitbestimmen\n- Bis zu 4 Bans mehr (was aufgrund der vielen Champions n&ouml;tig wurde)\n\nBin ich der einzige der begeistert ist vom neuen Ban System? Habe ich vielleicht einen Thread &uuml;bersehen - ist ja gut m&ouml;glich. Ich hab gerade richtig Lust bekommen ein paar Kilometer zu joggen, ach ich renn einfach los! Solch seltene Momente, in der man positive Dinge so sp&auml;t erkennt - darf man mit einen Run ja feiern.\n\n**Ein paar Fragen, die ich gerne stellen m&ouml;chte:**\n\nJemand Ideen wie ich das sportlich feiern k&ouml;nnte?\n\nFindet ihr das neue System r&uuml;ckblickend auch besser oder eher nicht?\n\nHabt ihr in letzter Zeit weitere positive Ver&auml;nderungen bemerkt?\n________\nLiebe Gr&uuml;&szlig;e,\n\nGainZ this (ehemals Hapyp, wobei ich den Namen ohnehin nochmal &auml;ndern werde)","replies":[{"poster":"SwissKeks","date":"2017-08-08T17:09:04.078+0000","up_votes":2,"down_votes":0,"body":"Kaum zu glauben dass ich diese Idee für Jahre verurteilt habe\n\nAm Ende ist man immer schlauer..","replies":[{"poster":"Released Ape","date":"2017-08-08T20:20:15.170+0000","up_votes":1,"down_votes":0,"body":"Ich war anfangs komplett dagegen, dachte das wird das Spiel ruinieren - aber es hat sich gut entwickelt. Meine nächste Sorge ist das kommende Runensystem, hoffentlich wird das auch so gut.","replies":[]}]},{"poster":"Kind Prow","date":"2017-08-08T17:05:30.683+0000","up_votes":2,"down_votes":0,"body":"Moin Hapyp :D\n\nJa, es gab sehr viele Threads über das neue Bannsystem.. und wie scheisse und beschissen und schlecht es doch wäre :>\n\nFeier doch diese grenzenlose Genialität mit einem Sprint durch den Wald :>  Oder alternativ über eine Baustelle :o\n\nPositive Veränderungen in letzter Zeit: Ornn, Honorsystem, Lootsystem, etc","replies":[{"poster":"Released Ape","date":"2017-08-08T20:18:45.109+0000","up_votes":1,"down_votes":0,"body":"Hab gehört Baustellen sind gefährlich :c\n\nStimmt das Honorsystem ist auch lobenswert.","replies":[]}]},{"poster":"Oriius","date":"2017-08-09T00:26:22.240+0000","up_votes":1,"down_votes":0,"body":"Finde ich auch gut das neue System. Jedoch als Support main kommts oft vor das meine lieblingssupporter gebannt werden was ich ein wenig schade finde. Ansonsten gibts nichts zu meckern und keiner sagt mehr \"ban yas\" pls weil du selbst bannen kannst ._.","replies":[]},{"poster":"Dermel","date":"2017-08-09T00:17:00.305+0000","up_votes":1,"down_votes":0,"body":"Ich fand die Idee von Anfang an gut und habe nie verstanden warum so viele dagegen waren, man kann einen Champion ({{champion:90}}) einfach für sich aus dem Spiel löschen, was will man mehr?","replies":[]},{"poster":"Elome","date":"2017-08-08T22:24:07.111+0000","up_votes":1,"down_votes":0,"body":"Sorry aber wie genau kommst du af 5 bans mehr?","replies":[{"poster":"Released Ape","date":"2017-08-08T22:39:00.437+0000","up_votes":1,"down_votes":0,"body":"Danke für den Hinweis. Habs korrigiert :c","replies":[]}]},{"poster":"Sirrkas","date":"2017-08-08T20:42:27.557+0000","up_votes":1,"down_votes":0,"body":"Mir persönlich haben die alten 6 Banns gereicht. Allerdings gefällt es mir, dass es jetzt fairer ist und jeder einen Champ bannen kann, den er nicht sehen will. Skeptisch war ich bei der Idee über die Umsetzung der Banns. Eine Verlängerung der CS hätte mir nicht gefallen, da aber alles Banns nun simultan zu Beginn der CS erfolgen, ist es sogar meist schneller als davor.","replies":[]},{"poster":"Tobbel","date":"2017-08-08T17:07:24.668+0000","up_votes":1,"down_votes":0,"body":"also ich wär für 10 bans auf jeder seite","replies":[{"poster":"Released Ape","date":"2017-08-08T20:19:21.621+0000","up_votes":1,"down_votes":0,"body":"Wäre das nicht etwas viel :D\n\nImmerhin müsste man dann mind. 30 Champions für Ranked haben.","replies":[]}]}]}