{"poster":"Released Ape","date":"2017-06-10T10:02:51.503+0000","title":"Böse Einkaufstüten :c","subforum":"Allgemeiner Chat","up_votes":11,"down_votes":2,"body":"Manchmal muss sogar ich aus dem Haus z. B. wie Heute um wieder einzukaufen. Doch ich f&uuml;hle mich danach meiner M&auml;nnlichkeit beraubt, ich versuche es mal zu beschreiben:\r\n\r\nIch laufe mit kurzer Hose und T-Shirt einen Kilometer zum einzigen Lebensmittelladen weit und breit, lade mir verschiedene Zutaten und Getr&auml;nke ein und dann beginnt die Horror Tour. Jetzt hebe ich die Plastikt&uuml;te mit einer Hand an und allein vom Gewicht merke ich schon das ich die Elastizit&auml;t der T&uuml;te wieder ans Limit gebracht habe, der Griff kn&uuml;llt sich ein und dr&uuml;ckt sich in meine Hand ein. Doch ich gebe nicht nach und laufe los, die Sonne scheint auf meinen K&ouml;rper und die T&uuml;te f&uuml;hlt sich immer schwerer und schwerer an. Ich gebe die T&uuml;te von der linken zur rechten Hand, dabei schneide ich mir aufgrund der Milcht&uuml;te die seitlich in der T&uuml;te h&auml;ngt ins Bein. Es blutet etwas und ich drehe die T&uuml;te so das die &quot;scharfe&quot; Seite nicht st&auml;ndig gegen mein Bein schl&auml;gt. Und so geht es weiter ich wechsel beide Seiten ab, von der rechten Hand zu linken -&gt; von der linken zu rechen -&gt; usw. und dann kommt wieder die Ampel die 50 Jahre ben&ouml;tigt um zu wechseln. Nat&uuml;rlich bin ich der schlimmste Finger der Stadt und renne schnell dr&uuml;ber, die Autofahrer hupen wie verr&uuml;ckt und eine alte Dame ruft mir hinterher &quot;ich glaub ich spinne, wo sind wir denn hier?!&quot; Ich rufe ein schnelles &quot;Entschuldige, ich dachte die Ampel ist kaputt hinterher&quot; und laufe mit schlechten Gewissen schnell weiter. Vor dem Haus angekommen knicke ich kurz ein, lege die T&uuml;te ab und puste mir in die H&auml;nde. Jetzt muss ich nur noch die Treppen hoch und zum Dachgeschoss und als ich dann in der Wohnung bin lege ich die T&uuml;te wieder ab und schau in den Spiegel und denke mir &quot;Mensch du siehst schei&szlig;e aus&quot;. Vollkommen fertig r&auml;ume ich die Sachen ein und ich frage mich ob ich eine hochwertigere T&uuml;te nehmen sollte.\r\n\r\nDas Gewicht der t&uuml;te betrug ca. 10 Kg und ich frage mich warum sich das so schwer anf&uuml;hlt. Einmal war ich naiv und dachte ich kauf ein wenig auf Vorrat und dann kam ich beinahe heulend zuhause mit 3 T&uuml;ten an, das waren dann vllt. 25-30 Kg. Ich kann mir nicht erkl&auml;ren wie mich das so fertig machen kann, ich bin vielleicht nicht die sportlichste Person - aber so schlimm hatte ich meine Verfassung nicht in Erinnerung...\r\n\r\nWie sieht es bei euch aus? K&ouml;nnt ihr euren Einkauf ohne Probleme nach Hause bringen und was f&uuml;r eine T&uuml;te benutzt ihr? \r\n\r\nW&uuml;rde mich &uuml;ber Hilfe freuen, helft euren Hapyp bei den allt&auml;glichen Problemen des Lebens!","replies":[{"poster":"Humpelstilzche","date":"2017-06-10T10:11:47.739+0000","up_votes":4,"down_votes":0,"body":"Ich kenn das Problem. Selbst in einem Single-Haushalt kann so ein Einkauf schon mal ordentlich was wiegen. Ich trinke z.B. relativ viel Milch und blöderweise wiegt halt jeder Liter Milch ein Kilo. Wenn dann noch all der andere Kram dazu kommt wird das schnell mal ein Gewicht, dass man nicht mehr beliebig weit an der Hand hängend tragen kann. \n\nMeine Lösung dafür ist recht pragmatisch: Ein Wanderrucksack. Da passen über 50 Liter rein und Gewicht ist kein wirkliches Problem, schließlich sind die Dinger ja dazu gedacht auch schweres Gepäck über weite Strecken zu transportieren ohne das irgendwas reibt oder einschneidet. \nAllein dafür hat sich das Geographie-Studium schon gelohnt :P\n\nPS: Ich bin offen für Rucksack-bezogenes Sponsoring! Das und Spitzhacken. Spitzhacken sind mindestens genauso unterschätzt wie Wanderrucksäcke!","replies":[{"poster":"KorSett","date":"2017-06-10T10:31:11.697+0000","up_votes":2,"down_votes":0,"body":"OOH JA wir brauchen MEHR Spitzhacken (auch in LoL!!!!)!\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Humpelstilzche","date":"2017-06-10T10:35:05.684+0000","up_votes":2,"down_votes":0,"body":"Absolut. Ich meine, man kann damit Löcher graben, Sachen kaputt hauen, sie irgendwo im Boden reinrammen und sich auf den Stil setzen, steile Hügel raufklettern und ich bin mir sicher auch in der Küche finden sich Einsatzgebiete.\n\nSpitzhacken sind im Prinzip das Smartphone von morgen. ","replies":[{"poster":"The mute Swan","date":"2017-06-10T10:45:29.861+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=apvVdHEv,comment-id=000000000000,timestamp=2017-06-10T10:35:05.684+0000)\n>\n> Absolut. Ich meine, man kann damit Löcher graben, Sachen kaputt hauen, sie irgendwo im Boden reinrammen und sich auf den Stil setzen, steile Hügel raufklettern und ich bin mir sicher auch in der Küche finden sich Einsatzgebiete.\n> \n> Spitzhacken sind im Prinzip das Smartphone von morgen.\n\nMan kann sich die Spitzhacke auch über die Schulter legen und dann die einkaufstüten dranhängen. Hebelkraft nennt sich das. Spitzhacken sind ja so Praktisch... Dosenöffner verlegt? kein problem. Spitzhacke tuts auch.","replies":[{"poster":"Sirrkas","date":"2017-06-10T12:08:24.568+0000","up_votes":2,"down_votes":0,"body":"Wenn wir eine Seite der Spitzhacke mit einem Axtblatt ersetzen, kann man damit auch Holz machen, sich rasieren und ein verlegter Haustürschlüssel sollte auch kein Problem mehr darstellen.","replies":[{"poster":"Awsane","date":"2017-06-10T13:01:53.548+0000","up_votes":2,"down_votes":0,"body":"Respekt mit einer Axt einen Schlüssel nachmachen kann nicht jeder!","replies":[{"poster":"Sirrkas","date":"2017-06-10T14:22:43.808+0000","up_votes":2,"down_votes":0,"body":"Ich dachte eher mit der Tür ins Haus fallen, also wortwörtlich. Wenn die aus Holz ist, hat man zudem 2 Fliegen mit einer Klappe geschlagen und Brennholz besorgt.","replies":[{"poster":"dugg","date":"2017-06-15T11:27:21.280+0000","up_votes":2,"down_votes":0,"body":"Durch die Vielseitigkeit des Werkzeugs entstand auch der Name - Spitzhacke. Damit ist nicht gemeint, dass sie an einer Seite spitz ist oder permanent rollig. Sie ist einfach universell einsetzbar und daher \"spitze\". Ähnliches Schicksaal trifft auf den Hammer zu. Ursprünglich sollte das Werkzeug \"stumpfes Schlagwerkzeug mit Stiel\" heißen. Bei der ersten Anwendung erfuhr dem Erfinder allerdings der Satz:\" Das Werkzeug ist ja hammer.\" So war der Name Hammer geboren.\n\nIch nutze meine Spitzhacke sehr einseitig. Als Wegfahrsperre. Mit der spitzen Seite noch oben auf dem Fahrersitz gelegt, überlegt sich Autodieb zweimal ober nun behände ins gerade \"aufgeschlossene\" Fahrzeug springt oder eben nicht.\n\nKleiner Geheimtipp: In die nächste Dienstbesprechung einfachmal eine Spitzhacke mitnehmen. So kann man die Meinungen der anderen schnell mal untergraben.","replies":[]}]}]}]}]}]}]},{"poster":"Awsane","date":"2017-06-10T12:06:45.400+0000","up_votes":2,"down_votes":0,"body":"wenn du den Rucksack impregnierst, kannst du 50 Liter Milch einkaufen, wenn die sie in den Rucksack schüttest, dann sparst du dir den Müll zuhause","replies":[]}]},{"poster":"Maexle","date":"2017-06-10T10:40:30.401+0000","up_votes":1,"down_votes":0,"body":"Ich benutze meistens einen Rucksack und eine Stofftüte ( Plastiktüten sind eh böse, selbst wenn sie nicht schwer sind). Auf diese Weise kann ich das Gewicht ein bisschen verteilen oder mehr einkaufen. \n{{champion:17}}","replies":[{"poster":"sN00Bdogg","date":"2017-06-11T09:36:50.095+0000","up_votes":2,"down_votes":0,"body":"Ich gehöre auch zu  der Rucksack+Tüten-Fraktion. Allerdings rauche ich die Tüte auf dem Weg zum Discounter!","replies":[{"poster":"Homunculi","date":"2017-06-12T07:07:06.383+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=6zXDo4dL7SU","replies":[]}]}]},{"poster":"Kind Prow","date":"2017-06-10T16:27:52.314+0000","up_votes":2,"down_votes":0,"body":"Mensch du, Spitzhacken sind wirklich unterschätzt. Und zu allem Überfluss kann ich damit auch Einbrecher verjagen ^^","replies":[]},{"poster":"AI Yjuq","date":"2017-06-10T13:14:41.059+0000","up_votes":2,"down_votes":0,"body":"> Wie sieht es bei euch aus? Könnt ihr euren Einkauf ohne Probleme nach Hause bringen und was für eine Tüte benutzt ihr?\n\nJa, ich nimm einfach einen Rucksack mit -> Problem gelöst ^^","replies":[{"poster":"Homunculi","date":"2017-06-12T07:06:22.351+0000","up_votes":1,"down_votes":0,"body":"Rucksack OP!!!","replies":[]}]},{"poster":"KorSett","date":"2017-06-10T10:19:35.594+0000","up_votes":1,"down_votes":0,"body":"Du könntest dir ja einen Bollerwagen zulegen. Ich selber hab kaum so ein Problem, da ich ein Auto habe :/ . Früher als ich noch kein Auto hatte, habe ich meiner Oma manchmal geholfen schwere Dinge zu heben, im Gegenzug hat sie mich alle 2 Wochen zum Getränke holen kurz zum Laden und wieder heim gefahren. Da das eigentlich das meiste Gewicht ist und man dann leicht mal 4 Sixer Wasser (oder was du eben trinkst) Hamstern kann xD. (DISCLAIMER: Es ist trotzdem schwer alles vom Erdgeschoss bis in den 4ten Stock zu tragen, ich spreche aus Erfahrung. Aber dafür 2-3 Wochen nur leichte Einkäufe)\nHoffe ich kann dir vielleicht ein paar Ideen geben, evtl. gibt es ja in deiner Familie jemanden mit Auto zu dem du guten Kontakt hast. Viel Glück bei deinen weiteren Einkäufen!!\nLG Sauerbraten","replies":[{"poster":"sN00Bdogg","date":"2017-06-10T11:58:47.212+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sauerbraten,realm=EUW,application-id=YnZkMR0R,discussion-id=apvVdHEv,comment-id=0001,timestamp=2017-06-10T10:19:35.594+0000)\n>\n> ... im Gegenzug hat sie mich alle 2 Wochen zum Getränke holen kurz zum Laden und wieder heim gefahren. \n\nDas nenn ich Glück! Ne Oma, die einen zum Bier holen fährt und auch noch den Ausweis vorzeigt!","replies":[{"poster":"KorSett","date":"2017-06-10T12:06:13.886+0000","up_votes":1,"down_votes":0,"body":"Haha zu der Zeit war Bier kaum ein Problem, geschweige denn das ich eine eigene Wohnung hatte und damit auch Volljährig war...","replies":[]}]}]},{"poster":"The mute Swan","date":"2017-06-10T10:43:19.648+0000","up_votes":2,"down_votes":0,"body":"Ich habe die Lösung gegen das Einschneiden: Stofftaschentücher. Man lege sich die zwischen Handfläche und tragegriff. Fehlende Muskelkraft kann man damit natürlich nicht kompensieren. aber es kann beim tragen helfen.","replies":[{"poster":"Nainya","date":"2017-06-14T15:08:19.245+0000","up_votes":1,"down_votes":0,"body":"Habe zu dem Zweck immer nen alten Arbeitshandschuh dabei gehabt.\nStabil genug um die einschneidende Wirkung der Plastiktüte zu kontern, gleichzeitig aber nicht so warm von der Sommerhitze outplayed zu werden...","replies":[]}]},{"poster":"Doenerlord","date":"2017-06-12T07:13:50.629+0000","up_votes":1,"down_votes":0,"body":"Auto regelt ;D","replies":[]},{"poster":"Findefuchs","date":"2017-06-11T10:45:41.323+0000","up_votes":1,"down_votes":0,"body":"Es gibt so EInkaufstaschen die man hinter sich her ziehen kann :D Damit rennen hier voll viele Omi's rum (Find ich total süß eigentlich, wie die mit ihren Einkaufs... äh.. rollbaren Rucksäcken hier rum rennen!) \nIn die passt total viel rein, du musst sie nicht tragen (außer die Treppe hoch) und kannst trotzdem noch einen Rucksack mitnehmen :b","replies":[]},{"poster":"Sihari","date":"2017-06-10T10:29:46.377+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich schwöre ja auf meine Handtasche, die das Gewicht mit breiteren Henkeln auf meine Schulter läd. Da schneidet erstens nix ein und zweitens wird auch der Arm nicht so lang gezogen, wodurch sich das Gewicht gleich leichter anfühlt.\n\nAber so eine Handtasche ist natürlich nicht für jeden was, weswegen ich den Männern hier ein paar wiederverwendbare Einkaufstaschen empfehlen kann.\n(Die, die so eine seltsame Mischung aus Plastik und Stoff sind. Ihr wisst sicher, welche ich meine...)\nDer Griff wurde bei diesen Taschen extra dafür gemacht, dass er einem nicht die Finger abtrennt! Auf diese Weise ist es gleich 10x angenehmer den Einkauf zu tragen, glaub mir! xD\n(Außerdem kann man den Beutel auch gemütlich irgendwo in den Flur stellen oder so, um dort dann die Pfandflaschen direkt reinwerfen zu können.)","replies":[]},{"poster":"sN00Bdogg","date":"2017-06-10T11:55:45.375+0000","up_votes":1,"down_votes":3,"body":"Wenn \"einkaufen gehn\" dein Skillcap übersteigt, dann würde ich auch für die Kluft eher Noobchamps empfehlen!","replies":[]}]}