{"poster":"Fireflies","date":"2018-03-15T22:52:04.055+0000","title":"Quitar LP por remake. (premade)","subforum":"Jugabilidad, balance y narrativa","up_votes":24,"down_votes":9,"body":"Hola! Esto mas que una queja, es algo que me gustar&iacute;a que riot cambiara porque no tiene NADA de sentido.\r\nComo a varios ya les tiene que haber pasado, me quitaron 18 lp porque mi premade desconect&oacute; y mi team obviamente tir&oacute; remake, lo cual es entendible. \r\nMe parece justo tener una penalizaci&oacute;n por ello, pero me parece totalmente injusto perder mas de 3 lp, o incluso una promo por una desconexi&oacute;n que obviamente no es mi culpa. No tiene nada de sentido que a mi d&uacute;o por ejemplo se le corte la luz y por eso riot me saque 20 lp. \r\nQue culpa tengo yo? Esta bien si me sacan 3 lp como si hubiera dodgeado, pero mas de eso me parece super exagerado. \r\nQue opinan uds? capaz me voy mega ignorada, pero supongo que no pierdo nada con postear mi opini&oacute;n. \r\n\r\nSaludos amiguines.","replies":[{"poster":"Hnk Kenshiro","date":"2018-03-15T23:03:21.578+0000","up_votes":11,"down_votes":4,"body":"Lo veo bien la verdad, es el duo, que uno se haga responsable :p","replies":[]},{"poster":"Kłaytøn","date":"2018-03-16T01:53:42.165+0000","up_votes":3,"down_votes":0,"body":"Na, que tenga una sola desventaja el jugar duo no lo veo mal.","replies":[]},{"poster":"Chase me","date":"2018-03-16T02:23:09.200+0000","up_votes":1,"down_votes":0,"body":"ahh?... yo me iba a remake y mi duo no perdia LP... we","replies":[{"poster":"Hnk Kenshiro","date":"2018-03-16T12:08:57.085+0000","up_votes":2,"down_votes":0,"body":"Solo le pasa a los que son diamante 5 o más.\n\nSi tu duo no es diamante, no le aplica.\n\n(Si tu eres diamante y tu duo no, tampoco le aplica)","replies":[{"poster":"Chase me","date":"2018-03-16T21:32:36.357+0000","up_votes":1,"down_votes":0,"body":"Ah, debio ser porque yo aplicaba eso cuando estaba en platino xD que paja man","replies":[]}]}]},{"poster":"Darkfoe703","date":"2018-03-16T00:35:26.251+0000","up_votes":2,"down_votes":6,"body":"A mí me parece bien, de otra manera se explotaría el sistema. Saludos","replies":[{"poster":"La Q de Irelia","date":"2018-03-16T04:50:44.586+0000","up_votes":2,"down_votes":5,"body":"te parece bien que te saquen lp solo porque tu duo se desconecto animal??","replies":[{"poster":"LightDagger","date":"2018-03-16T05:06:30.245+0000","up_votes":2,"down_votes":0,"body":"Se, una desventaja tenían que tener... digo teníamos xD Ya no haré más duos","replies":[{"poster":"Hnk Kenshiro","date":"2018-03-16T12:00:46.179+0000","up_votes":2,"down_votes":0,"body":"Es solo si eres diamante 5 o más igual","replies":[{"poster":"LightDagger","date":"2018-03-16T15:48:14.842+0000","up_votes":1,"down_votes":0,"body":"Tendría que ser para todos los elos, suelo tardarme 5min o más en encontrar partida porque me toca uno de esos duos que querían ir duo bot, y pues les digo que dodgeen o se la banquen.","replies":[]}]}]},{"poster":"Capitana Beryl","date":"2018-03-16T13:55:11.487+0000","up_votes":3,"down_votes":0,"body":"Respeta la opinión de los demás, al que llamaste \"animal\" sólamente dió su opinión.","replies":[{"poster":"La Q de Irelia","date":"2018-03-16T19:41:30.395+0000","up_votes":1,"down_votes":1,"body":"si es una animalada lo que dijo xD","replies":[]}]},{"poster":"Darkfoe703","date":"2018-03-16T16:12:05.249+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=La Q de Irelia,realm=LAS,application-id=xQmJPO8F,discussion-id=RdPPKj9M,comment-id=00040000,timestamp=2018-03-16T04:50:44.586+0000)\n>\n> te parece bien que te saquen lp solo porque tu duo se desconecto animal??\n\nClaro que sí! Esto es internet, nadie sabe porqué te desconectas, si fue porque se te cayó la conexión, si tuviste un accidente, si una alpaca se comió la línea... Tranquilamente te podes desconectar con la inatención de no perder porque crees que el otro team tiene mejor composición, y te sacrificas por el team, por tu duo.\nEsto tampoco es nuevo. Deberías saberlo antes de jugar. No es que te desayunas con la noticia, es parte del reglamento de clasificatorias. Y los aceptas y asumis cuando decidis jugar con un compañero.\nSaludos y cuidado con la arena, no se te vaya a meter en el ojo.","replies":[]}]}]},{"poster":"Matox","date":"2018-03-16T00:47:09.892+0000","up_votes":1,"down_votes":0,"body":"te sacan pl si tiran remake? pense que solo le sacaban al que se desconectaba","replies":[{"poster":"Cris300","date":"2018-03-16T02:03:47.041+0000","up_votes":2,"down_votes":0,"body":"no entendiste nada, se tiro remake porque su duo no estaba presente en la partida, el sistema de LP funciona asi: juegas solo pero tiras remake porque OTRA persona se fue afk a inicio de partida pero no te quitan LP porque no es tu duo, pero si se hace duo le quitan LP al responsable junto a su duo, cosa que me parece una estupides que le quiten LP solo porque su duo no pudo estar en la partida por tal tal y tales razones (obviamente no estoy diciendo que el duo se fue afk intencionalmente, sino que hay cosas que son inesperadas como el corte de luz, de internet, que se reinicie el pc sin previo aviso, etc, solo lo explico para no malinterpreten mi mensaje)","replies":[]}]},{"poster":"SAD Katarina","date":"2018-03-16T01:41:57.366+0000","up_votes":2,"down_votes":0,"body":"Camila se fue afk? Xd","replies":[{"poster":"Fireflies","date":"2018-03-16T15:43:14.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SAD Katarina,realm=LAS,application-id=xQmJPO8F,discussion-id=RdPPKj9M,comment-id=0006,timestamp=2018-03-16T01:41:57.366+0000)\n>\n> Camila se fue afk? Xd\n\nYo soy Camila xD","replies":[{"poster":"SAD Katarina","date":"2018-03-16T22:43:43.078+0000","up_votes":1,"down_votes":0,"body":"Ah, me confundo mucho con los tildes XDDDD","replies":[]}]}]},{"poster":"Nabuze","date":"2018-03-16T08:17:45.382+0000","up_votes":3,"down_votes":2,"body":"Los dúos tienen desventajas que gratificante noticia.\nLástima que los carreados suelen tener buena conexión y unas muy buenas pc .","replies":[]},{"poster":"lordeman10","date":"2018-03-16T19:26:32.333+0000","up_votes":1,"down_votes":0,"body":"es una medida anti boosteo, ya que si alguien jugaria desde una cuenta secundaria podría analizar los rivales de la partida en pantalla de carga y optar por abandonarla para que el boosteado no pierda LP","replies":[]},{"poster":"Winter Lion","date":"2018-03-16T16:01:16.693+0000","up_votes":1,"down_votes":0,"body":"Asi como es la comunidad, seguro que si lo despenalizan después tendremos una oleada de trollls que se dediquen a meterse en partidas nomas para quedarse afk y que el team tire remake o pierda por ser 4 vs 5","replies":[]},{"poster":"matiaskiller","date":"2018-03-15T23:17:45.297+0000","up_votes":3,"down_votes":4,"body":"si llegaste a promo 1 vez vas a llegar 2 no te vas a morir por perder una promo a mi ayer me trollearon la promo porque estaba en promo y no vine a llorar de echo es injusto que el que se desconecta pueda tirar del cable porque se enoje y pinguear el ping y decir tengo lag y asi no lo penalizan para mi tendrian que sacar eso si se desconecta no se muere por 20 puntos menos","replies":[{"poster":"Fireflies","date":"2018-03-16T15:42:15.441+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=matiaskiller,realm=LAS,application-id=xQmJPO8F,discussion-id=RdPPKj9M,comment-id=0001,timestamp=2018-03-15T23:17:45.297+0000)\n>\n> si llegaste a promo 1 vez vas a llegar 2 no te vas a morir por perder una promo a mi ayer me trollearon la promo porque estaba en promo y no vine a llorar de echo es injusto que el que se desconecta pueda tirar del cable porque se enoje y pinguear el ping y decir tengo lag y asi no lo penalizan para mi tendrian que sacar eso si se desconecta no se muere por 20 puntos menos\n\nYo no perdí ninguna promo, fue un ejemplo.","replies":[]}]},{"poster":"Kåtãrînâ","date":"2018-03-16T04:03:02.668+0000","up_votes":1,"down_votes":0,"body":"A mí me sacaron una promo por no aceptar una partida ue","replies":[]},{"poster":"FailonX","date":"2018-03-16T02:17:56.077+0000","up_votes":1,"down_votes":0,"body":"Lo acabo de ver en el soporte, y me resulta increiblemente absurdo y sin sentido...\nEs solo a partir de Diamante por si las dudas :v","replies":[]},{"poster":"Tea with Tibbers","date":"2018-03-15T23:39:55.606+0000","up_votes":1,"down_votes":4,"body":"Si presentas una queja por este motivo quiere decir que te ha pasado muchas veces (descarto que sea solo 1 porque por 1 no pasa nada, yo dodgee una partida de promo sin querer y no me queme la cabeza), si es asi entonces o juga solo o atenete a las consecuencias de que tu amigo no tenga coneccion estable o sea un leaver, el sistema esta bien como esta.\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Cris300","date":"2018-03-16T02:05:42.573+0000","up_votes":1,"down_votes":0,"body":"hay cosas en la vida que son inesperadas, en la season pasada me empezaron a putear porque me salio bug splat y despues el juego porque si no me dejaba entrar a partida hasta minuto 20","replies":[]}]},{"poster":"Bienzahar","date":"2018-03-16T11:43:04.110+0000","up_votes":2,"down_votes":2,"body":"Esta bien, yo incluso les quitaría más. Eso de hacer duo es para nenas.","replies":[]}]}