{"poster":"RedFire2055","date":"2016-07-03T13:40:46.372+0000","title":"Script e Scripters","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Cos &eacute; lo script esattamente? Come funziona ? E come faccio a capire chi sono gli scripters?","replies":[{"poster":"call me pawn","date":"2016-07-03T14:24:00.386+0000","up_votes":1,"down_votes":0,"body":"Gli script sono i cheat, in pratica un computer gioca al posto tuo o fa determinate azioni sempre al posto tuo.\nTe li devi scaricare, molto spesso a pagamento, per poi attivarli (credo).\nNon è difficile riconoscerli se tipo hai un ezreal contro che  dopo 10 minuti di game non è stato preso nemmeno da uno skill shot ha 120 di farm e non ha mai missato una q, beh è uno scripter.","replies":[{"poster":"Skydago","date":"2016-07-03T15:26:08.787+0000","up_votes":3,"down_votes":1,"body":"o è challenger smurf tra i bronzi","replies":[]}]},{"poster":"Sorcio84","date":"2016-07-03T20:02:34.412+0000","up_votes":2,"down_votes":2,"body":"Sono stato nei siti di script e bot con un browser usato una volta e poi resettato.\n\nGli script sono prlgrammi di terze parti che imteragiscono totalmente o parzialmente con il gioco.\n\nComprendono :\n\n- bot che giocano al posto tuo\n- last hit sui minion\n- togli la nebbia di guerra e vedi tutto (addio lumi)\n- rotazionr di spell perfetta\n- kiting ( es kalista e kogmaw )\nPs : esiste un metodo che consiste nel  settare 3 tasti in un determinato modo, questo non è script ma lomdiventa in combinazione al cheat successivo\n- anti zoning e autoschiva skillshot\nQuesto cheat calcola in tempo reale la posizione migliore per non farsi colpire dai nemici, anche se non li vedi\n- drophack (crea problemi nel serve che hosta il game)\n- champ select hack (permette di vedere i pick nemici prima che lockino il chsmp)\n\nTempo fa esisteva anche una urf hack, in pratica con certi champ andavi abamti spammando ulti a raffica. In un video una soraka fa vincere il game a tutto il team dritto al nexus nemico da inizio game.\n\n- spambot\nViene usato su accounti rubati. Spamma link fraudolenti a tutti i contstti nella lista amici e in champ select","replies":[{"poster":"Groox II","date":"2016-07-05T23:40:40.280+0000","up_votes":1,"down_votes":0,"body":"Utili indicazioni.\nConoscere il nemico per combatterlo.\n+1","replies":[]}]},{"poster":"Campanello","date":"2016-07-03T17:30:38.440+0000","up_votes":1,"down_votes":1,"body":"io so perfettamente cosa sono: sono programmi di terze parti che permettono di schivare ogni skillshot facendoti muovere da solo, praticamente nell esatto momento in cui inizia il cast il tuo personaggio inizia a dodgiare da solo, oppure al contrario per prendere gli skillshot","replies":[{"poster":"ZZALA","date":"2016-07-03T17:56:02.184+0000","up_votes":1,"down_votes":0,"body":"Fanno anche di più.","replies":[]}]}]}