{"poster":"CatStorm Boy","date":"2019-12-02T15:24:17.606+0000","title":"Cerco gente con cui giocare, tranquillamente.","subforum":"Reclutamento","up_votes":2,"down_votes":1,"body":"Ciao a tutti ragazzi!\r\n\r\nMi chiamo CatStorm Boy e ho ripreso da poco a giocare a LoL. Ho già giocato in precedenza, ed ho notato una cosa davvero molto brutta.\r\n\r\nNon so se solo io, e spero che sia così, trovo solo \"bot\" nel mio team, mi spiego meglio;\r\nAnche voi trovate solo gente che tira dritto a farsi ammazzare senza un criterio di logica? solo io vedo che questa gente non segue MAI le call (giuste o sbagliate che fossero) andando dritti in bocca dei nemici continuando un 1v2-3-4-5?\r\n\r\nSto cercando gente con cui giocare (attualmente normal che sto ancora al 15 circa anche se ho quasi 20 campioni) per divertirci e giocare comunicando, con un pò di cervello e soprattutto che abbiano VOGLIA DI GIOCARE, non che come il team avversario sta su di 2 draghi e 10 kill si mette AFK in base a piangere pregando per una arresa.\r\n\r\nAttualmente gioco con la mia premade, e grossomodo copriamo tutte le linee (principalmente ADC e SUPPORT), ma come scritto sopra e che tengo a ribadire, i ruoli non sono importanti, la bravura nemmeno, stiamo cercando gente che abbia VOGLIA DI GIOCARE e che comunichi con il proprio team, senza pensare di essere OP, o migliori di altri o chissà che cosa passa per la testa di certa gente. \r\n\r\nQuesto post non vuole essere aggressivo nei confronti di nessuno, scusate se leggete un leggero tono di frustrazione in queste parole, ma personalmente mi piace LoL, con tutte le sue costanti e variabili tra campioni mappe e modalità di gioco, e sarei parecchio stufo di questi pseudo coreani troll che al primo minuto si buttano 1v3 dando 8 kill per poi andare afk leggendo cose tipo \"I'm the best u suck u r reported\" e compagnia bella.\r\n\r\nVorrei ringraziare tutti voi che dedicate un pò di tempo al post di un ragazzo che ancora ha la passione per questo gioco e che vuole solo fare delle partite tranquillamente, senza dover tutte le sante volte tenere un fegato esplosivo sanguinante in bocca. \r\n\r\nCiao a tutti evocatori e buona fortuna nella landa! ;)","replies":[{"poster":"Mirtillino","date":"2019-12-04T14:11:36.352+0000","up_votes":2,"down_votes":0,"body":"Ciao! ti ho aggiunto ora su lol! summoner: Mirtillina\nmagari facciamo due chiacchere e qualche game, ma sono del tutto d'accordo con la tua linea di pensiero! a presto!","replies":[]},{"poster":"5RN 99 Monkeys","date":"2019-12-02T18:18:38.049+0000","up_votes":2,"down_votes":0,"body":"Ciao! Sono L’owner di una community molto attiva in questo senso, potremmo fare al caso tuo. Unisciti al nostro server discord, posso spiegarti tutto li \n\nhttps://discord.gg/Cwnekqt","replies":[]},{"poster":"Térence Fill","date":"2019-12-10T14:00:09.393+0000","up_votes":1,"down_votes":0,"body":"Mi trovi \"maledettamente\" d'accordo con tutto ciò che hai scritto: appena loggo, poco ma sicuro, ti addo!","replies":[]},{"poster":"Articus","date":"2019-12-04T15:04:50.756+0000","up_votes":1,"down_votes":0,"body":"Articus gold4","replies":[]},{"poster":"Mizar","date":"2019-12-04T06:06:26.464+0000","up_votes":1,"down_votes":0,"body":"Ciao, io gioco prevalentemente da solo. Sono main Talon, Diana. Non ho una community perché ritengo che in Italia non c'è la mentalità per poter prendere seriamente un gioco, seppur come ho detto è un gioco. Se vuoi giocare con l'idea di farlo tranquillamente, ma allo stesso tempo con serietà, puoi contattarmi sul gioco. Il mio nome è Mizar. Ti saluto cordialmente.","replies":[]},{"poster":"foxsimo24","date":"2019-12-03T10:46:50.533+0000","up_votes":1,"down_votes":0,"body":"Hey ciao! Se vuoi puoi entrare nel mio canale telegram...li forse potrai trovare qualche compagno per normal, flex oppure duo...ah in quel canale telegram sto organizzando anche due tornei : 1vs1 e 2vs2, quindi se ti va potresti pure partecipare (totalmente gratuiti e sono previsti pure i premi per i vincitori)...se vuoi maggiori informazioni aggiungimi su lol: foxsimo24\n\nBuonagiornata Simone.","replies":[]}]}