{"poster":"Riot Cóndor","date":"2015-03-06T18:01:48.271+0000","title":"[FINALIZADO] Sesión de P&R sobre Bardo","subforum":"Charlas Generales","up_votes":31,"down_votes":11,"body":"Bienvenidos invocadores a una nueva sesión de preguntas y respuestas sobre campeones. En esta edición estaremos conversando sobre nuestro amigo Trotamundos de aspecto muy simpático y bonachón.\n\nEn esta ocasión, contamos con la presencia de varios rioters que estarán respondiendo preguntas en las siguientes áreas:\n\n* Concepto y apartado creativo: Mister Candanga, Riot Cóndor\n* Jugabilidad: Mister Candanga y Riot Ozrak\n* Sonido y \"voces\": Riot Pavaro y Riot Brujo\n* Historia y otros detalles: Sir Dal y Riot Cóndor\n\nLos invitamos a participar con sus preguntas desde ahora (las 11hs MX, 12hs CO/EC/PE, 12:30hs VE, 14hs CL/AR, 15hs UY) y durante 4hs. Como sabemos que existen muchas dudas, le daremos prioridad aquellas que reciban mayor cantidad de votos por parte de la misma comunidad con el objetivo de evitar demasiadas preguntas repetidas y concentrarnos en lo más relevante para ustedes.\n\nPara acceder al resumen de todas las respuestas que dimos, accede a [este enlace](http://boards.las.leagueoflegends.com/es/c/charlas-generales/1r74tUdy-sesian-de-pr-sobre-bardo?show=rundown).","replies":[{"poster":"Pizzah","date":"2015-03-06T18:35:16.219+0000","up_votes":11,"down_votes":1,"body":"¿A bardo le gusta el fernet?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T19:29:01.853+0000","up_votes":41,"down_votes":3,"body":"> [{quoted}](name=Pizzah,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=0032,timestamp=2015-03-06T18:35:16.219+0000)\n>\n> ¿A bardo le gusta el fernet?\n\nEl Fernet existe gracias a Bardo.","replies":[]}]},{"poster":"Doctor","date":"2015-03-06T19:10:39.320+0000","up_votes":5,"down_votes":1,"body":"Si un bardo era la persona encargada de cantar la historia de sus pueblos en las tabernas....\n\nA bardo le gusta el fernet y la cumbia?","replies":[{"poster":"Sir DaL","date":"2015-03-06T19:39:14.040+0000","up_votes":27,"down_votes":0,"body":"No, si existiese un campeón que le gustase el Fernet, debería estar mas orientado a Freljord en lugar de ser parte de otra dimensión.\n\nSi le gusta la cumbia es insta-ban, y nunca saldría, asi que puedo confirmar que no le gusta la cumbia.","replies":[]}]},{"poster":"Chained Wings","date":"2015-03-06T18:27:39.515+0000","up_votes":13,"down_votes":4,"body":"- La piedra que rescata Bardo, tiene que ver con la piedra que está buscando Nami? \n- El campeón cuenta con interacciones con otros personajes?\n- Soraka, está relacionada de alguna manera con Bardo?\n- Tiene un rostro real bajo su máscara? \n- Tiene alguna relación con Ao Shin?\n- El campeón aparece por la inminente llegada de los vigilantes, o no está relacionado?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T19:16:49.970+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Son of the Ice,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=0023,timestamp=2015-03-06T18:27:39.515+0000)\n>\n> - La piedra que rescata Bardo, tiene que ver con la piedra que está buscando Nami? \n\nNop.\n\n> - El campeón cuenta con interacciones con otros personajes?\n\nEsta se la dejo a Riot Pavaro.\n\n> - Soraka, está relacionada de alguna manera con Bardo?\n\nPoco probable. A Bardo no se le conoce relación alguna. Es un espíritu que mora y viaja a través de los planos. Tal vez Soraka tiene conocimiento sobre este que no es el mismo que tiene la gente de Runaterra, ¿pero de conocerse? Nop.\n\n> - Tiene un rostro real bajo su máscara? \n\nEsa es la apariencia que él eligió. No es un ser de carne y hueso que deba ocultar una identidad por algún motivo o para respetar alguna tradición.\n\n> - Tiene alguna relación con Ao Shin?\n\n¿Quién es Ao Shin? xD. Ahora en serio, si aún no lanzó, eso significa que aún no existe.\n\n> - El campeón aparece por la inminente llegada de los vigilantes, o no está relacionado?\n\nNo está relacionado. Los conflictos de Runaterra no tienen cabida en su misión.","replies":[]}]},{"poster":"Elodopu Knows","date":"2015-03-06T19:19:46.550+0000","up_votes":2,"down_votes":0,"body":"no tiene mucho que ver con bard pero podrian hacer un P & R de personajes que ya salieron?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T19:40:38.887+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=opdospu,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=006a,timestamp=2015-03-06T19:19:46.550+0000)\n>\n> no tiene mucho que ver con bard pero podrian hacer un P & R de personajes que ya salieron?\n\nMe agrada ver tu interés en las sesiones de P&R. Parece ser que este formato le agrada a la comunidad. Ten por seguro que en un futuro, cuando continuemos creciendo, podremos hacer más sesiones como esta de otros tipos. Los rediseños, eventos y otras cosas, son buenas excusas :)","replies":[]}]},{"poster":"Lee Sin Ponerla","date":"2015-03-06T20:15:26.593+0000","up_votes":1,"down_votes":0,"body":"QUE ES ESE SIMBOLO? RIOT PORFABOR","replies":[{"poster":"Riggs","date":"2015-03-06T20:21:03.468+0000","up_votes":8,"down_votes":1,"body":"ahí se apaga. XD","replies":[]}]},{"poster":"Lil Ttøtø ","date":"2015-03-06T18:25:08.884+0000","up_votes":9,"down_votes":2,"body":"¿Bardo tendra alguna interacción especial con Soraka? Ya que ambos son seres celestiales que protegen runaterra...","replies":[{"poster":"Salmater","date":"2015-03-06T19:10:17.313+0000","up_votes":4,"down_votes":1,"body":"ambos tienen el cuerno ademas","replies":[]}]},{"poster":"Pizzah","date":"2015-03-06T18:38:06.302+0000","up_votes":2,"down_votes":0,"body":"¿Cómo se llama el lugar de origen de Bardo?\n\n¿Qué importancia tienen las marcas de la máscara de bardo en la Grieta del Invocador?\n\n¿Cuál era la función de la piedra presente en el video \"Bardo: Montaña\"?\n\n¿A Bardo le gusta armar bardo?\n\nSaludos!","replies":[{"poster":"Mister Candanga","date":"2015-03-06T20:36:59.771+0000","up_votes":6,"down_votes":0,"body":"> ¿Cómo se llama el lugar de origen de Bardo?\n\nBARDONIA. No la verdad es que se desconoce el lugar de origen, es un ser misterioso, interestelar, podríamos decir que es percibido como un alien, alguien de otro mundo. \n> \n> ¿Qué importancia tienen las marcas de la máscara de bardo en la Grieta del Invocador?\n\nSimplemente son un símbolo de que se acerca El Bardo. \n\n> \n> ¿Cuál era la función de la piedra presente en el video \"Bardo: Montaña\"?\n> \n\nUna piedra de poder ancestral, su función especifica es desconocida. \n\n> ¿A Bardo le gusta armar bardo?\n\nNo directamente, pero a donde va el Bardo, de seguro hay Bardo!\n\n\n> \n> Saludos!","replies":[]}]},{"poster":"corbuscorax","date":"2015-03-06T18:56:46.559+0000","up_votes":5,"down_votes":0,"body":"tengo una pregunta\nbardo tiene 4 dedos al igual que jax y su forma de vestir al igual que los rasgos corporeos son paresidos\n1 - bardo y jax son de la misma especie o clase?, que clase es (siempre me parecio raro que jax tuviera 4 dedos y no fuera humano)\n\nnos cuentan que origuinalmente se basava en tocar su isntrumento y en la musica\n2 - cuentenos algo mas de los distintos kits que probo antes de sali a la luz y xk los descartaron\n\n3 - bardo es nacido, como soraka que existe para ese proposito, o fue alguien o algo mas en su pasado, algo asi como ahri que cambio y llego a ser lo que es (una pregunta un poco relacionada a si comparte clase con jax y que clase seria)","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T21:53:31.094+0000","up_votes":3,"down_votes":0,"body":"1) No\n\n2) Se cambió el kit de Bardo varias veces, en una iteración, la definitiva era como una onda de pulso que afectaba a todos, otorgándoles mejoras a los aliados y silenciando a los enemigos.\n\n3) Soraka y Bardo son dos existencias diferentes. Ambos conocen del otro, pero Soraka no tiene las mismas capacidades ni nunca las tuvo. Bardo puede visitar el plano del que proviene Soraka, pero Soraka no puede visitar todos los planos que Bardo conoce.","replies":[]}]},{"poster":"Jcyrano","date":"2015-03-06T18:09:47.904+0000","up_votes":5,"down_votes":0,"body":"Hecho: Bard tocaba su Instrumento(no se su nombre) en un bosque bastante oscuro neblinoso y retorcido\nPregunta: ¿como se llama el instrumento y era ese bosque en \"the shadow Isles\"?\n\nHecho: el asalto parece ser orquestado por fuerzas Noxianas pero sin sus banderas\npregunta: ¿fue esto un \"ataque clandestino\" antes de que Noxus iniciara la guerra contra Ionia?\n\nHecho: un joven intenta rescatar a varios niños\nPregunta: ¿es ese joven el que años después cuenta la historia a los 3 jóvenes que se ven en la 1° presentación de Bard \"el manto cosmico\"?\n\nHecho: la constelación lleva tiempo en el cielo\nPregunta: ¿cuanto y durante que evento ocurrió la aparición de esta?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T19:09:24.126+0000","up_votes":3,"down_votes":0,"body":"1) No se sabe dónde está. Probablemente no sea Runaterra ya que él no tiene 'hogar'.\n2) Nada de clandestino xD. Es un conflicto más, parte del ataque frontal que recibió Jonia por parte de Noxus. Aunque el 'conflicto' en ese lugar remoto Jonio, tenía una intención, que era robarse el artefacto de manos jonias.\n3) Una buena pregunta, pero no lo creo. La historia de Bardo se conoce en todo Runaterra. El anciano que ves en el imagen, representa al contador de historias (el relato oral era muy importante antiguamente para la raza humana) y cómo esa historia pasa de generación en generación.\n\n3) EDITADA CON INFO: Confirmado, el niño que está siendo cargado en el video promocional, [minuto 1:22](https://www.youtube.com/watch?v=ezRrrdboWLc), es el anciano cuentacuentos que aparece en la web '[Manto Cósmico](http://las.leagueoflegends.com/es/champion-preview/el-manto-cosmico)'.\n\n4) Miles de años. No se sabe a ciencia cierta.","replies":[]}]},{"poster":"When Pigs Fly","date":"2015-03-06T18:03:17.513+0000","up_votes":5,"down_votes":0,"body":"-¿Cuántos meeps puede tener Bardo como máximo por su pasiva?\n\n-¿Son las campanas visibles en terreno inexplorado (bush y niebla de guerra)?¿Pueden los aliados y enemigos verlas de la misma forma que Bardo?\n\n-¿Puede Bardo stunear a alguien con Amarre Cósmico si lo lanza contra un objetivo que está por entrar/terminó de salir de un Viaje Místico?\n\n-¿Existe una cantidad máxima para colocar Santuarios del Guardián?\n\n-¿Los Santuarios del Guardian duran un tiempo o hasta que son usados/destruidos?\n\n-En el video de Bardo, cuando invoca un Santuario del Guardian, se ve que este carga hasta un punto,¿Significa que debe cargarse antes de poder ser usado, o su poder se amplifica si está cargado al máximo?\n\n-¿Puede Bardo inmovilizar unidades con Destino Apacible que estén dentro de un Viaje Místico, o las unidades dentro son inmunes a inmobilizaciones?\n\n-¿Puede también inmovilizar a Rek'Sai mientras viaja en uno de sus túneles?\n\n-¿Qué tan grande es el cooldown de Destino Apacible?\n\nY la pregunta más importante:\n-Señorita Caitlyn,¿conoce usted a este supuesto genio del supporteo errante?","replies":[]},{"poster":"borsoiwalter","date":"2015-03-06T19:01:05.862+0000","up_votes":1,"down_votes":0,"body":"Si decidieron que su fraces sean sonidos musicales en lugar de voces para hacerlo ''universal'', ¿Porque su nombre varia en los distintos servidores (Bard / Bardo)? \n\nEn mi opinion hasta ahora una de las cosas interesantes que tiene el juego es que sus nombres son los mismos para otros servidores. Yo creo que cambiar el nombre dependiendo del servidor crea confusiones en lo que es el juego universalmente hablando... Entiendo que solo cambia una O, pero que tal si hacen algo parecido mas adelante? Cambiaran el nombre solo un poco o lo cambian casi por completo?...","replies":[{"poster":"Riot Brujo","date":"2015-03-06T19:21:13.207+0000","up_votes":4,"down_votes":0,"body":"Debido al concepto original, era muy importante conservar el misterio de su nombre. La gente lo conoce como el bardo, es el nombre que le dan en todos los idiomas de Runaterra, en todos los tiempos que ha aparecido. En ese sentido, es más un título que un nombre propio. Al igual que con el Maestro Yi y el Doctor Mundo, esa parte no la traducimos. Si bien hay casos como Miss Fortune, Twisted Fate o la misma Jinx, donde los nombres también encierran un significado en inglés, con ellos hubiéramos tenido que hacer un cambio radical y, como dices, optamos por preservar su universalidad. En el caso de este nuevo campeón, de Bard a Bardo el cambio no es demasiado grande y conserva el sabor ancestral de su historia y el misterio que rodea al personaje.\nPoniéndolo de otra forma, la música es un lenguaje universal donde no caben las palabras específicas. No tenemos un nombre para llamar al bardo, porque es un ser más allá de las palabras, entonces le damos un título descriptivo. si lo hubiéramos llamado Bard en español, tendrìa un nombre concreto y no uno universal.","replies":[]}]},{"poster":"NoMeReporte","date":"2015-03-06T19:11:33.922+0000","up_votes":4,"down_votes":0,"body":"¿Tiene bardo, en su posición de protector, alguna relación con los vigilantes de hielo? \n¿Que tan antiguo es bardo? Me refiero a cuanto tiempo lleva \"trabajando\", desde que momento, antes de que eventos de la historia.\n¿Tendrá Bardo algún papel importante en el desarrollo de la historia? ¿Se verá envuelto en eventos relacionados con las vertientes ya abiertas (Shurima, freljord, las islas de la sombra...) o podría llevar a desarrollar una nueva rama? \n¿El Bardo cuenta con aliados o enemigos, o prefiere \"trabajar de maneras misteriosas\"? No me refiero necesariamente a campeones. \n¿En algún momento, Bardo evitó alguna catástrofe mas grande que la que se puede observar, por ejemplo, en el video Montaña? \n¿Bardo trabaja bajo instrucciones de algo superior o simplemente actúa como dicte su juicio?    \n¿Es la función de bardo evitar algo muy grande del futuro o simplemente hacer cosas como lo de Montaña?","replies":[]},{"poster":"byakkoo","date":"2015-03-06T18:55:46.029+0000","up_votes":4,"down_votes":0,"body":"¿EL MURO DE YASUO PUEDE BLOQUEAR LA \"HABILIDAD ATRAVIESA PAREDES\" DE BARDO?\n\nlo digo en mayusculas por que es de vida o muerte D:","replies":[]},{"poster":"Rombospics","date":"2015-03-06T18:09:06.213+0000","up_votes":4,"down_votes":0,"body":"Hay algunos detalles en Bardo que recuerdan el concepto de Ao Shin ¿tiene algo que ver con el simpático dragón?\n\n¿Qué pasa si Lee Sin tira una patada a un campeón que justo en ese instante realiza viaje místico? ¿Y si Caitlyn le lanza ulti? ¿Y si Karthus le lanza ulti?","replies":[]},{"poster":"Insane Warlord","date":"2015-03-06T18:48:02.016+0000","up_votes":5,"down_votes":1,"body":"¿Porque tradujeron el nombre de Bard?","replies":[{"poster":"Riot Ozrak","date":"2015-03-06T21:02:41.543+0000","up_votes":3,"down_votes":0,"body":"Bard no es nombre, sino un arquetipo de personaje y es por eso que nuestro equipo de Localización decidió traducirlo. Así como Master a Maestro.","replies":[]}]},{"poster":"Princess Boo","date":"2015-03-06T18:16:39.954+0000","up_votes":5,"down_votes":1,"body":"Bardo sera un Supp Tank {{item:3302}}  ? o Un Supp Ap {{item:3303}} ?","replies":[]},{"poster":"DarkUmbreon47","date":"2015-03-06T18:18:47.522+0000","up_votes":7,"down_votes":3,"body":"Bardo es illuminati?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T19:18:30.021+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=DarkUmbreon47,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=0012,timestamp=2015-03-06T18:18:47.522+0000)\n>\n> Bardo es illuminati?\n\nNo, es pleyadiano.","replies":[]}]},{"poster":"1nombredeusuario","date":"2015-03-06T22:20:12.759+0000","up_votes":3,"down_votes":0,"body":"me gustaria aportar con una pregunta seria... \n-¿el lugar donde bardo aparece, esta siendo atacado por los noxianos? \n-¿bardo en si es un vigilante, tendra interacciones especiales con lissandra?\n-¿estan todos los vigilantes o grandes de la historia de runaterra o tenemos aun mas por ver? y si es asi, ¿que pasara cuando esten todos?\nDe antemano gracias","replies":[]},{"poster":"Jerrys","date":"2015-03-06T20:56:21.755+0000","up_votes":3,"down_votes":0,"body":"¿El viejo caído en el vídeo de Bardo, es el mismo que esta en nuestro banner de perfil?","replies":[{"poster":"Lee Sin Ponerla","date":"2015-03-06T21:11:51.854+0000","up_votes":2,"down_votes":0,"body":"ese Viejito esta desde el principio , y representa a un invocador , en este caso a nosotros. pero es sierto que tienen parecido","replies":[]}]},{"poster":"RavenBelmont","date":"2015-03-06T18:46:04.980+0000","up_votes":3,"down_votes":0,"body":"¿Se puede empujar a un campeón rival hacia el portal que abre Bardo y forzarlos a cruzar?","replies":[{"poster":"Mister Candanga","date":"2015-03-06T20:34:06.100+0000","up_votes":3,"down_votes":0,"body":"no, la persona tiene que hacerle clic al portal para que funcione, lo que si se pueda hacer es intentar confundir a la persona para que lo haga, por ejemplo entrar en un arbusto y colocar un portal  justo antes de que la persona adquiera visión adentro del arbusto y que le haga clic por error y se transporte.","replies":[]}]},{"poster":"Chainsteelzxc","date":"2015-03-06T18:53:02.080+0000","up_votes":3,"down_votes":0,"body":"En que época fue conocido por primera vez Bardo, fue contemporáneo a la llegada de los vigilantes, a lo sucedido en la islas de las sombras, o a la traición de xerath?\n\nEn la fiesta de máscaras fue Bardo quien le llevo los disfraces a los poros?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T20:30:25.404+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chainsteelzxc,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=0048,timestamp=2015-03-06T18:53:02.080+0000)\n>\n> En que época fue conocido por primera vez Bardo, fue contemporáneo a la llegada de los vigilantes, a lo sucedido en la islas de las sombras, o a la traición de xerath?\n> \n> En la fiesta de máscaras fue Bardo quien le llevo los disfraces a los poros?\n\nHay signos de Bardo de hace miles y miles de años. Antes de la traición de Xerath. Antes de que la Isla de las Sombras quedara en su estado actual, pero desconozco si antes de que los Vigilantes llegaran a Runaterra. Del conflicto con los Vigilantes, seguro que sí, pero de los Vigilantes en Runaterra, no lo sé.\n\nY no, Bardo no tiene relación a la Fiesta de Máscaras. De hecho, ninguna de las historias de los campeones tiene relación a los eventos que hacemos y que no sean eventos de facción.","replies":[]}]},{"poster":"TwoKindredSouls","date":"2015-03-06T20:07:09.059+0000","up_votes":3,"down_votes":0,"body":"La batalla que vemos en el video de Bardo:montaña , sucede antes de que Riven sea dada por muerta? o despues?","replies":[]},{"poster":"Rainbow Quartz","date":"2015-03-06T20:07:00.228+0000","up_votes":3,"down_votes":0,"body":"Buenas tardes. Quería saber si el que creó el personaje tuvo algún tipo de inspiración en Studio Ghibli, porque Bardo tranquilamente podría ser parte de los universos increíbles de Mononoke, Chihiro, Totoro, Howl. Gracias, saludos.","replies":[]},{"poster":"Magenokus","date":"2015-03-06T20:06:43.148+0000","up_votes":3,"down_votes":0,"body":"-Bardo tiene algo que ver con Brand? En la historia de Brand, cuando el es un pirata, dice que en una cueva hay extrañas luces, como polillas, y que la cueva esta cubierta de runas antiguas. Ademas, dice que Brand busca venganza. Fue Bardo quien encarcelo a Brand?","replies":[]},{"poster":"BlackDog25","date":"2015-03-06T19:45:13.314+0000","up_votes":3,"down_votes":0,"body":"1) Bardo tiene alguna relación directa con algún campeon?\n2) Tiene el mismo gusto de bebida que Jax?\n3) Fue Bardo quien le llevo los disfraces a los poros en la fiesta de mascaras?\n4) Concretamente cual es su deber como guardián?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T21:55:40.481+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BlackDog25,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=009c,timestamp=2015-03-06T19:45:13.314+0000)\n>\n> 1) Bardo tiene alguna relación directa con algún campeon?\n> 2) Tiene el mismo gusto de bebida que Jax?\n> 3) Fue Bardo quien le llevo los disfraces a los poros en la fiesta de mascaras?\n> 4) Concretamente cual es su deber como guardián?\n\n1), 2) y 3) No.\n4) Proteger reliquias, objetos de gran poder, para que el balance de los distintos planos no se vea negativamente afectado.","replies":[]}]},{"poster":"ISG OnePunch","date":"2015-03-06T19:43:48.785+0000","up_votes":3,"down_votes":0,"body":"Cual es la razón de bardo de unirse a la liga de leyendas?","replies":[]},{"poster":"Bodhisattva","date":"2015-03-06T18:48:36.693+0000","up_votes":3,"down_votes":0,"body":"Porque se unio Bardo a la liga? Cual es su motivacion al pelear en la grieta?","replies":[]},{"poster":"FedeeRodriguez","date":"2015-03-06T18:38:06.371+0000","up_votes":3,"down_votes":0,"body":"La apariencia de Bardo son utilizados a partir de la apariencia de Ao Shin? Ya que el cabello y las partes doradas son muy parecidas. Me gustaria que el nombre siguiera con su traducción en Inglés \"Bard\" ya que \"bardo\" en Argentina puede confundirse con otras palabras, como \"conflicto\", \"lio\", etc. Gracias :)","replies":[]},{"poster":"TwoKindredSouls","date":"2015-03-06T18:11:34.192+0000","up_votes":2,"down_votes":0,"body":"Porque en el video de Bardo : la montaña el ancioano decia ¨sin ella moriremos¨?\nPorque eran tan importantes los altares?\nComo es que bardo se movia tan rapido?","replies":[{"poster":"Riot Cóndor","date":"2015-03-06T18:23:04.394+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SKT T1 HI TLER,realm=LAS,application-id=v7qsfXsE,discussion-id=1r74tUdy,comment-id=0007,timestamp=2015-03-06T18:11:34.192+0000)\n>\n> Porque en el video de Bardo : la montaña el ancioano decia ¨sin ella moriremos¨?\n> Porque eran tan importantes los altares?\n> Como es que bardo se movia tan rapido?\n\nCon respecto al artefacto, los Jonios manejan un conocimiento muy antiguo y saben que ese artefacto actúa como un recipiente de gran poder. Los noxianos tenían la misión de quitarles ese artefacto.\n\nCon respecto a lo que dice el anciano, los Jonios son una civilización que no rompe con el balance de la naturaleza. Al saber que este artefacto tiene un importante protagonismo en la vida misma, el anciano sabía que no contar con ese artefacto traería caos.\n\nSobre los altares no tengo información, pero si tuviese que adivinar yo como Riot Cóndor, diría que los Jonios lo querían salvar de caer de malas manos y sabían que ese altar milenario era un camino para entregarle el artefacto al 'Gran Protector'. Por eso el anciano estaba tan empecinado en llevárselo. Le atribuyo su frase a una clase de afirmación que le da al Bardo estilo: \"sí, llevátela, ya que sin ella (todos) podríamos correr un gran riesgo.\". No sé, esa es mi teoría.\n\nLos objetivos de Bardo son inciertos. Lo que sí sabemos es que trascienden las motivaciones que pueda tener cualquier persona en Runaterra. Podría llegar a tener sus propios planes o actuar por \"instinto\". Hasta lo que se sabe, hace miles de años que está trabajando.","replies":[]},{"poster":"Sir DaL","date":"2015-03-06T18:16:31.575+0000","up_votes":3,"down_votes":0,"body":"Bardo se mueve muy rápido, es una de sus cualidades :)\nSin ella moriremos es la referencia a la reliquia, un artefacto de gran poder\nLos altares son importantes, por eso no solo \"se lleva\" la reliquia sino también estos altares\n\nSaludos!","replies":[]}]},{"poster":"Th4NaToS","date":"2015-03-06T18:22:22.287+0000","up_votes":3,"down_votes":0,"body":"El anciano dice:\"Moriremos sin ella\" a que se refiere?\n¿A que aceptan su destino de morir mientras que nadie use el tesoro sagrado?\n¿O si le pide que no se la lleve que su pueblo iba a perecer sin el objeto y a bardo le da lo mismo y se lo lleva?\nY si es asi a bardo no le importa nada mas que proteger los objetos?\n\nY el video esta claro que esta echo en el pasado.\n Otra pregunta seria si alguien esta usando un tesoro sagrado y eso hace que Bardo regrese a buscar otro objeto la pregunta que objeto y que campeon?\nPodria ser Azir ya que el es revivido y fue un emperador tendría que saber sobre los objetos sagrados de Runaterra y el piensa usar alguno para vengarze de xerath\n\nOtra pregunta seria tiene que ver algo con soraka?\ny si tiene que ver con algo porque no la ayudo?","replies":[]},{"poster":"hashirama23","date":"2015-03-06T18:13:21.817+0000","up_votes":4,"down_votes":1,"body":"Cuando lo van a poner en la tienda a bardo? {{item:3151}}","replies":[]},{"poster":"Pockytito","date":"2015-03-06T22:20:29.243+0000","up_votes":0,"down_votes":0,"body":"3 preguntas:\n1. Por que los meeps no hacen miiiip (sosteniendo la i de meep) cuando aparecen??\n2. Pensaron en buffear su ulti para que cure aliados y dañe enemigos??\n3. Si lo usan para trollear, van a hacer que se vaya a otra dimensión??\nGracias","replies":[]}]}