{"poster":"GC Marksman","date":"2016-11-18T16:10:19.498+0000","title":"Hilfe, mein Account wurde permanent gesperrt","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Liebes Riot Team,\r\nIch kam heute nach Hause, nachdem ich auf einem mehrt&auml;gigen Schulausflug war und ich wollte mal wieder League of Legends spielen, doch dann sah ich das mein Account permanent gesperrt ist. Ich habe keine Ahnung, warum mein Account gesperrt sein sollte. Ich beleidige (fast) nie andere Spieler, dass mir oft schwer f&auml;llt. Spiele verlasse ich so wenig wie m&ouml;glich und an freie Riot Points zu kommen versuche ich auch nie, weil sowas immer sehr zwielichtig ist. Ich hab auf LoLSkill ( http://www.lolskill.net/summoner/EUW/NGN%20Offizier/summary ) sofort mein Profil angeschaut um zu sehen, ob sich dort vielleicht etwas ver&auml;ndert haben k&ouml;nnte, aber es hat sich nichts ver&auml;ndert.\r\nJetzt sagte ein Freund, dass mein Account gehackt wurde. Wenn das wirklich passieren kann, h&auml;tte ich jetzt gerne Information, ob der Hacker jetzt auch weiter auf meinen PC oder mein Netzwerk Zugriff hat.\r\nIn der Nachricht, die mir im Clienten angezeigt wurde, stand ich h&auml;tte eine E-Mail erhalten mit weitern Informationen, aber in der von mir angegebenen E-Mail Adresse (welche ich selbstverst&auml;ndlich schon kontrolliert habe) erhielt ich keine E-Mail.\r\n\r\nAlso liebes Riot-Team, w&auml;rt ihr so freundlich mir Informationen zukommen zu lassen und meinen Account wieder freizugeben. Ich w&uuml;rde n&auml;mlich gerne weiter League of Legends spielen und nicht das ganze Geld einfach verlieren, welches ich in das Spiel steckte. Sowohl nehme ich auch an zahlreichen Umfragen zu dem Spiel teil und bewerbe mich f&uuml;r die Tests, wie neulich f&uuml;r den Alpha-Clienten (der &uuml;brigens echt gut wurde). \r\n\r\nDanke","replies":[{"poster":"eingew","date":"2016-11-18T16:16:50.158+0000","up_votes":1,"down_votes":0,"body":"Den Support findest du [hier](https://support.riotgames.com/hc/de).","replies":[]},{"poster":"Markathus","date":"2016-11-18T16:15:45.863+0000","up_votes":1,"down_votes":0,"body":"Wenn du etwas von Riot willst musst du dich beim Support melden wir hier sind nur dir Forum-Community und können dir da leider nicht wircklich weiterhelfen","replies":[]}]}