{"poster":"AvK Ðęlµxe ąƒ","date":"2017-10-05T15:14:54.009+0000","title":"Hey Babes! Let's talk about High Ping in Ranked Games...","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Don&#039;t worry, we&#039;ve all had it... you come home and no ones home, you boot up League and half way through your housemates decided they wanna go on Redtube... or the most probable... Netflix. Maybe your sister streams 5 tabs of 1080p Youtube...  this happens all the time. It sucks... and honestly... there&#039;s nothing that can really be done unless you have a modem with Bandwidth Control.\r\nSo firstly let&#039;s check that out... log in to your dad&#039;s modem... or your housemates... or possibly even your own... the usual codes can be found on the internet... but let&#039;s say for now it&#039;s the old &quot;192.168.1.1&quot; - username and password is almost always: &quot;admin&quot;\r\n\r\nFind a tab that says Bandwidth Control or Bandwidth Throttling... or something along those lines...\r\nNow put in your current IP address and set the min upload to 800kbps or higher... and the min download to at least 2500kbps or higher... don&#039;t be full greedy though and use it all... but you need at least 800kbps upload for the game to run smoothly... you literally need jack all for download... it also helps if you make your IP as the highest priority (usually making it number 1)... Set everyone elses IP address as 100kbps min upload.... but give them mass download... as this is what they probably want... you mainly want all that juicy upload quota.\r\n\r\nTa Da. Please use this info for non evil things... and make sure you turn off the Bandwidth Control when you are done playing League. (don&#039;t be that guy!)\r\n\r\nIf you happen to not have a modem with this particular thing... well then.. Please for the love of Trent Reznor (God)... can you please type in to your browser: &quot;speedtest.net&quot; and change the server to Sydney... and then Press &quot;GO!&quot;\r\nWhat you will see before you is a damn good average of what you&#039;re gonna get if you play League.\r\nIf the ping is over 150... maybe don&#039;t play just yet. Wait it out.\r\nOtherwise...\r\nHappy Playing.\r\n\r\nAlso, this message will self destruct in like... 30 seconds... so.... you didn&#039;t hear any of this from me.\r\n{{sticker:vlad-salute}}","replies":[{"poster":"ThatsBS","date":"2017-10-05T20:42:57.958+0000","up_votes":1,"down_votes":0,"body":"Its a good comment, i almost want to buy an aftermarket modem/router. To get the control.","replies":[]},{"poster":"Akkordian Zoeve","date":"2017-10-05T18:51:07.694+0000","up_votes":1,"down_votes":0,"body":"Not sure what the issue is. I don't really see much difference between here (where I have 30 ping) and my NA account (where I have 200-300 ping). I mean, naturally there is a bit, but not enough to really affect my gameplay. \n\nBut I guess that may because I spent over a year playing with 1,500+ ping, so 30 or 300 is insignificant.","replies":[]}]}