{"poster":"Chaki","date":"2017-01-30T13:51:33.492+0000","title":"Ganks vermeiden (Midlane)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Moin,\r\nich habe folgendes Problem - Ich kann nicht vermeiden, dass ich geganked werde. Ich warde soviel ich kann, kaufe 24/7 Pink wards, spiele passiv, aber wenn die Gegner einen Lee oder &auml;hnliches haben, dann wird meine Lane permanent gesitted. Da man keine normalen Wards mehr kaufen kann, bin ich auch nicht in der Lage mehr als 1 Pink + zeitweise ein Trinket Ward zu haben. Mir macht LoL so absolut kein Spa&szlig; mehr. \r\nUnabh&auml;ngig davon welchen Champ ich spiele, welchen Jungler die Gegner haben, welchen Jungler wir haben oder auch ob ich in der Mitte der Lane stehe oder an meinen eigenen Turret ich bin alleine und werde durchgehend geganked.\r\nOhne Vision Hilfe von meinem Team habe ich keine Chance.\r\nIch hoffe jemand kann mir irgendwelche Tipps geben.\r\nMfG.","replies":[{"poster":"HHaie tabbian","date":"2017-01-30T16:39:43.910+0000","up_votes":1,"down_votes":0,"body":"Nun, es gibt Dinge, die verhindern, dass du bei einem Gang stirbst.\n- Du hast Flash. Wenn du Flash hast und trotzdem bei dem Gang stirbst, stehst du viel zu aggressiv.\n- Du bist stark genug, um 2v1 zu fighten, bzw. du schaffst es deinen Lanegegner so low hp zu halten, dass du ihn töten könntest, wenn der Jungler kommt.\n- Du lässt dich reinpushen. Wenn du nah an deinem Turm stehst, kannst du im Prinzip nicht sterben. Es sei denn vielleicht, die Gegner haben ein Blitzcrank jungle.\n- Wenn die Lane aus irgendeinem Grund gepusht sein sollte und du nicht weißt, wo der Jungler ist, gib lieber ein paar Cs auf, als zu riskieren zu sterben.\n\nAber du bist doch schon Dia V mit 60% Winrate, da wirst du ja eigentlich gar nicht so schlecht spielen können ;)","replies":[]},{"poster":"xSyruSx","date":"2017-01-30T16:00:33.059+0000","up_votes":1,"down_votes":0,"body":"Da ich ziemlich viel {{champion:136}} und auch stellenweise {{champion:4}}  oder {{champion:63}}  in der Midlane zocke, kann ich aus meiner Erfahrung heraus sagen, dass sich dies eig. gar nicht vermeiden lässt. \n\nDie Midlane ist, wie Ihr Name schon sagt, die Zentralste Lane und ein Angelpunkt für den Jungler. Da dazu noch sein eigener Midlaner, welcher oft viel Burst, auch ohne Items, hat, und man selber als Mage eher ein weiches Ziel ist, ist es klar dass der Jungler sehr gerne auf der Midlane vorbeischaut.\n\nAlles was du tun kannst ist es eben gegen die entsprechenden Jungler zu warden (also gegen den hier {{champion:120}} eher tief warden, da es einem überhaupt nichts bringt nen Hecarim im Busch zu sehen, da er dann schon auf die Midlane trampelt, man sieht Ihn also einfach zu spät. Gegen den hier{{champion:121}}  im Busch und an den Flanken usw.)\n\nZudem bleibt dir dann auch nur eben beobachten und dementsprechend handeln. Ist dein Gegner eher Passiv und neigt nur dann zu Aggressivem Spielstil wenn der Jungler da ist? Oder ist er er eher Aggressiv und wird plötzlich passiver wenn sein Jungler da ist? Oder versucht er dich zu unvorsichtigen Manövern zu baiten damit du deine Summoner früh benutzen musst und dann wehrlos dar stehst? Sowas versuche ich immer zu beobachten,\n\nLeider ist es damit auf der Midlane ein wenig wie Pokern. Du kannst noch so gut beobachten und reagieren....mit nem Scheiß Blatt verlierst du halt trotzdem. Du kannst halt nur etwas warden und versuchen zu erahnen was deine Gegner vorhaben. Achja, und IMMER den Gegnerischen Jungler pingen, damit alle wissen wo in etwa er sein könnte.\nWenn er Topside ist, dann versuche dich eher auf die untere Seite deiner Lane zu positionieren, bei Botside eben oben.\n\nNatürlich kannst du auch versuchen mit deinem Jungler die Ganks deiner Feinde zu countern. Dafür muss halt nur euer 2 vs 2 stärker sein als das vom Gegner.\n\nWas auch funktionieren könnte ist, wenn du selber nur spärlich auf der Midlane bist. Heißt also rein pushen, ab in den Kriegsnebel. Rein pushen, ganken, rein pushen und wieder verstecken. Was der gegnerische Jungler nicht sieht, kann er auch nicht ganken.\n\n\nAlles in allem lässt sich aber nur sagen, dass es auf der Midlane eben nicht wirklich vermeidbar ist geganked zu werden, da die Ausgangslage für den Jungler halt sehr oft einfach zu gut sind um diese Chancen zu ignorieren. Man kann diese Chancen allerdings verringern und es dem gegnerischen Jungler deutlich schwerer machen als Ziel genommen zu werden. So lassen sich vielleicht die ganks von 4 oder 5 auf vielleicht nur 2 oder sogar nur einen reduzieren, wenn der Jungler merkt dass er bei dir nur Zeit verschwendet.","replies":[]},{"poster":"This Is LUX","date":"2017-01-30T14:04:44.117+0000","up_votes":1,"down_votes":0,"body":"Welche Champs spielst du auf der Mitte? Bei Karthus, kann ich verstehen, dass du nicht wegkommst, aber bei sowas wie Katarina oder Ahri sollte man schon escapen können^^","replies":[{"poster":"Chaki","date":"2017-01-30T14:12:11.393+0000","up_votes":1,"down_votes":0,"body":"Katarina ist 24/7 gebannt, spiele ich nicht, Ahri hat bis 6 keinen Escape und bis dahin wurde ich schon oft genug geganked.\nIch spiele ziemlich gerne Ryze oder Syndra, sonst bin ich aber wirklich eher der Control Mage Spieler, wie Xerath oder Taliyah. \nMir ist bewusst, dass diese Champs ziemlich unmobil sind, aber das sind momentan fast alle aktuellen Midlaner.","replies":[{"poster":"This Is LUX","date":"2017-01-30T14:15:57.710+0000","up_votes":1,"down_votes":0,"body":"Bin ich um ehrlich zu sein auf ein Fan von^^ Aber ich denke, dass XenesisCH schon recht hat, im Sinne von die Summs zu ändern und DEUTLICH mehr auf die Minimap zu achten. Hat mir persönlich auch geholfen^^","replies":[{"poster":"Chaki","date":"2017-01-30T14:19:42.397+0000","up_votes":1,"down_votes":0,"body":"Naja wenn ich auf einem Champ wie Ryze oder Syndra einen defensiven Summoner Spell (Heal, Exhaust, Barrier) spiele, dann kann ich es sofort vergessen die Lane zu gewinnen, da dadurch sehr viel Killpressure verloren geht. Ich achte genug auf die Minimap, leider bringt die einem ohne Vision sehr wenig.","replies":[{"poster":"This Is LUX","date":"2017-01-30T14:24:59.799+0000","up_votes":1,"down_votes":0,"body":"Dann musst du dafür sorgen, dass genügend Vision da ist. Ich weiß, hört sich simple an, ist aber so :/","replies":[{"poster":"Chaki","date":"2017-01-30T14:35:12.384+0000","up_votes":1,"down_votes":0,"body":"Ja wie denn?\nWie soll ich denn für Vision sorgen? **Man kann keine Wards kaufen**","replies":[]}]}]}]}]}]},{"poster":"Cold as Ice","date":"2017-01-30T14:05:19.543+0000","up_votes":1,"down_votes":0,"body":"Was ich immer mache wenn ich weiß der gegener startet am Red oder Blue dann geh ich beim minute 3 beim Red auf die rechte Seite und beim Blue auf die linke Seite da die jungle meistens um Minute 3 mit der Rotation durch sind und anfangen zu ganken. Ich gucke auch immer auf die Mal ob vllt. Die jungler sichtbar ist wenn ja Spiel ich agresiv und wenn ich sehe der jungler kommt von top oder bot in die Mitte 5 Sekunden aggressiv bleiben und dann zurück am besten so spielen das der jungler denkt Nice bekommen ich vllt. Aber du stehst so dass er nur Zeit verschwendet","replies":[{"poster":"Chaki","date":"2017-01-30T14:24:27.426+0000","up_votes":1,"down_votes":0,"body":"Das sind ja ziemlich allgemeine Tipps, prinzipiell versuche ich auch so zu spielen, aber oft ist die Situation so, dass man den Gegner töten muss, damit es worth ist, was mit gegnerischer Jungle Pressure oft tötlich endet. Somit ist das aggresive Spielen in den kurzen Phasen selten erfolgreich.\nTrotzdem danke für deine Tipps, ich versuche sie etwas aktiver umzusetzen.","replies":[]}]},{"poster":"XenesisCH","date":"2017-01-30T14:03:59.668+0000","up_votes":1,"down_votes":0,"body":"Champions mit Escape-skill spielen, mehr auf die Minimap achten, den Jungler zum Counterganken auffordern, defensive Summs wie {{summoner:21}} {{summoner:3}} {{summoner:7}} oder {{summoner:1}}  usw. Wahrscheinlich bist du auch einfach nur getiltet von einer Niederlagenserie, da könnte dann halt mal ein bisschen zu pausieren helfen oder keine Rankeds spielen ;-).","replies":[{"poster":"Chaki","date":"2017-01-30T14:09:46.971+0000","up_votes":1,"down_votes":0,"body":"Champions mit Escape-Skill spielen:\nDie meisten aktuellene Meta Champions haben keinen wirklichen Escape. \nz.B Syndra, Ryze, Orianna, Cassiopeia, Viktor, Lux u.ä\nKlar gäbe es auch mobile Midlaner wie z.B Ahri oder Ekko wobei ich mich nicht auf 2 Champions konzentrieren will, welche beide Assassins sind und demnach nicht in jedem Matchup gut sind.\nIch spiele immer Flash/Ghost, oftmals kann ich mit den Summs auch escapen, aber dann bin ich 5 Minuten free.\nDer eigene Jungler könnte mir natürlich sehr dabei helfen nicht geganked zu werden (warden, Krabe, etc.), aber das kann ich von keinem Jungler erwarten, dass er hilfreich ist. Außerdem achte ich eigentlich fast immer auf die Minimap, aber ohne Vision bringt die einem leider nicht viel.\nGetilted bin ich nicht, ich bin auch gerade nicht auf einer Niederlagenserie, das ist komplett Objektiv betrachtet, Ich werde in mindestens 3 von 4 Games gesitted und repeat ganked, die ganze Zeit.","replies":[]}]}]}