{"poster":"SPARTAN125","date":"2016-02-21T16:24:42.255+0000","title":"¿Riot cuando implementaran mejoras al sistema de reportes?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Como pueden ver la mayor&iacute;a de los jugadores existe mucha gente toxica,trolls,afks y cuando nos enojamos por la partida que perdimos porque una persona troleo o una persona flameo toda la partida despu&eacute;s de la partida lo reportamos y luego vemos que ese mismo jugador esta jugando como sino pasara nada porfavor intenten de implementar mejoras al sistema de reportes.\r\n\r\nGracias.","replies":[{"poster":"Marra","date":"2016-02-21T21:27:28.380+0000","up_votes":1,"down_votes":0,"body":"El sistema de reportes esta bien como esta.","replies":[{"poster":"Genn Cringris","date":"2016-02-22T04:40:37.433+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lapislázulii,realm=LAS,application-id=PJAKt7ph,discussion-id=oPXtG5J2,comment-id=0005,timestamp=2016-02-21T21:27:28.380+0000)\n>\n> El sistema de reportes esta bien como esta.\n\nConcuerdo contigo en que el sistema de reportes de por SÍ está bien, pues debe ser prudente al momento de castigar. Pero no creo que LAS le dé el uso correspondiente; al menos en está región creo que está un poco obsoleto. ¿Por qué? Porque he visto a un montón de jugadores que no reportan a un troll o un AFK del equipo enemigo porque les permite ganar la ranked y luego andan con el \"GG IZI\" (es más, a veces hasta les dan honor). O los famosos premades que reportan, acosan y flamean al inocente cuando ellos son los que arruinan la partida. No hablo por las otras regiones, porque desconozco la situación en esos lugares.\n\nSaludos.\n\n_-Setsuna Meiou._","replies":[]}]},{"poster":"The Inkanus","date":"2016-02-21T18:27:15.354+0000","up_votes":1,"down_votes":0,"body":"Lo que pedís se implementó el año pasado, está en las FAQ de este foro, y acá hay algunos ejemplos.\nhttp://imgur.com/a/V17t9\n\nSaludos.","replies":[{"poster":"Magical Pants","date":"2016-02-21T18:57:25.151+0000","up_votes":1,"down_votes":0,"body":"Enserio crees en ese 0.06%? no voy a darcifras ya que las desconozco pero que de 10 partidas en 8 tengamoss un jugador con actitud negativa (troll,afk,flamer,xenofobo,etc) yo creo que mas sanciones se deberian aplicar, y no me refiero a bans permanentes sino a bans de 1 dia-1 semana-1 mes, que estas vayan progresando segun siguas con esa actitud.\nno se doy mi opinion ya que eh visto a muha gente horrible en este juego y que supuestamente cuando se le banea te sale el cartelito que ah sido baneado, pues a mi nunca me salio ese cartelito, es un mito....","replies":[{"poster":"The Inkanus","date":"2016-02-22T17:33:00.788+0000","up_votes":1,"down_votes":0,"body":"Hola, no importa si creo en ese 0.06%, en lo que creo es en esos mas de 300 posts de gente llorando porque los sancionaron (si mirás bien, no es solamente ese primero que sale en la miniatura acá).\n\nY lo del cartelito, no es exactamente como lo describís, hay alguna pequeña chance de que te salga el cartelito, no sucede siempre y es posible que nunca lo veas, YO nunca lo vi, sin embargo reporto frecuentemente, aún asi, confío en el sistemita, y para reforzar esa confianza está la galería de los 300.\n\nSaludos.","replies":[{"poster":"Magical Pants","date":"2016-02-22T21:26:17.481+0000","up_votes":1,"down_votes":0,"body":"Una probabilidad? rlly? no lo creo... tengo un amigo que si le salio ese cartelito un par de veces, pero estoy hablando de hace mas de 1 año, cuando el empezo a jugar. a partir de ahi no conozco a nadie que le saliese alguna ves ese cartel.\ny teniendo en cuenta la cantidad de gente que juega a lol, unos 10 posts de gente sancionada es hasta vergonzoso.","replies":[]}]}]}]},{"poster":"Dyaebl","date":"2016-02-21T18:54:34.058+0000","up_votes":1,"down_votes":0,"body":"Hace 6 meses, hace 4 meses, hace 3 meses, en unos 2 o 3 meses, en unos 6 meses, etc etc etc","replies":[]},{"poster":"artistafracasado","date":"2016-02-21T17:09:57.765+0000","up_votes":1,"down_votes":0,"body":"Nunca se banea inmediatamente, es cosa de usar la cabeza para saber por qué es así.","replies":[]},{"poster":"Samu1999","date":"2016-02-21T17:01:47.989+0000","up_votes":1,"down_votes":0,"body":"A mi me paso lo mismo , juge mi primera partida ranked , iba de lo mas bien ganando top contra un rengar hasta que a los 3 minutos uno de mi equipo que iba mid se fue afk y no volvio mas haciendo que perdamos.\nMe puse a jugar despues de eso una partida normal y me toco un tipo que ademas de robarme la linea se ponia a trollear haciendo que vuelva a perder la partida\nOtra vez me puse a jugar otra partida normal y de nuevo estaba el mismo troll -.-","replies":[]},{"poster":"Ks Erwyn","date":"2016-02-21T16:36:13.414+0000","up_votes":1,"down_votes":0,"body":"pretenden que lo sancionen inmediatamente? lamentablemente debe tener una seguidilla de report para que el bann sea haga efectivo, siempre ha sido asi, mas ahora que no existe el tribunal","replies":[]}]}