{"poster":"Manu Carba","date":"2016-03-20T04:40:48.899+0000","title":"Dodgear vale la pena? Se pierde ELO?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Buenas, hago este thread porque tratando de jugar una clasificatoria, tuve que dodgear 2 partidas consecutivas. Si, dodgie dos partidas seguidas y por eso perdi unos 16 LP:\n\n1er partida: Al que le tocaba mid &quot;se olvido&quot; y pickeo volibear, entonces tuve que ir yo mid, eligiendo a un campeon que uso bien en mid como Corki. Instantaneamente el que iba jungla (que no lee el chat) dice &quot;Corki top? na listo, trolleo&quot;, y pickea Heimerdinger... Tuve que dodgear.\n\n2da partida: Me toco un team sin UN tanque... Un pibe que habia perdido 10 partidas seguidas como adc y habia pickeado kalista... Segundo dodge y con este perdi 13 LP.\n\nLa pregunta es:\n\nVale la pena dodgear si se sabe que la partida ya esta perdida? Vale la pena intentar ganarla?\n\nSegun lo que escuche, es mejor dodgear en esos casos ya que se pierde LP pero NO ELO. Cuan cierto es eso?\n\nEspero opiniones! Muchisimas gracias!\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"SHAKKAswaglife","date":"2016-03-20T14:21:43.614+0000","up_votes":3,"down_votes":0,"body":"sinceramente si dogeas pierdes lp algo no muy importante,pero si solo jugas esas partidas pierdes el lp y el elo,es mejor perder lp que elo,ten en mente que si no pierdes elo  esos lp los recuperaras mas facil puesto que te tocara gente mas competente.\n\n\neso es lo mas inteligente que te pudiera aconsejar.","replies":[{"poster":"Tutancadead","date":"2016-03-20T14:59:25.646+0000","up_votes":1,"down_votes":0,"body":"Vajo esa logica te conviene perder la partida. Menos elo= enemigos mas fáciles que dan mas puntos.\n\nEl verdadero punto es que pierdes mucho mas lp jugando ademas de frustrarte.","replies":[{"poster":"SHAKKAswaglife","date":"2016-03-20T17:32:49.534+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tutancadead,realm=LAS,application-id=v7qsfXsE,discussion-id=hZbsocFr,comment-id=00030000,timestamp=2016-03-20T14:59:25.646+0000)\n>\n> Vajo esa logica te conviene perder la partida. Menos elo= enemigos mas fáciles que dan mas puntos.\n> \n> El verdadero punto es que pierdes mucho mas lp jugando ademas de frustrarte.\n\nel elo afecta TU emparejamiento por lo tanto tu bajaras  a emparejarte con team mas mancos reduciendo tu provabilidad de ganar,con tu elo intancto es mas probable que ganes ya que es gente mas competitiva","replies":[{"poster":"Tutancadead","date":"2016-03-20T17:44:35.122+0000","up_votes":1,"down_votes":0,"body":"Tu elo afecta a ambos team. Osea que ambos team serán mas mancos.\nSiempre y cuando tu estrategia no sea esperar que te carean. Te conviene que el nivel medio del resto de los jugadores baje.","replies":[{"poster":"SHAKKAswaglife","date":"2016-03-21T00:11:09.612+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tutancadead,realm=LAS,application-id=v7qsfXsE,discussion-id=hZbsocFr,comment-id=0003000000000000,timestamp=2016-03-20T17:44:35.122+0000)\n>\n> Tu elo afecta a ambos team. Osea que ambos team serán mas mancos.\n> Siempre y cuando tu estrategia no sea esperar que te carean. Te conviene que el nivel medio del resto de los jugadores baje.\n\nclaro que afecta a ambos pero es un arma de doble filo puede que la ganes por que el otro team son malos o que pierdas  por que tu team es malo preferiblemente si sigues con tu elo intacto tu team sera bueno y el otro igual es obio sera una partida de 2 horas de pura habilidad de los equipos prefiero eso que ver gente hamable que le da oro al otro team con su vida","replies":[{"poster":"Tutancadead","date":"2016-03-21T00:39:20.090+0000","up_votes":1,"down_votes":0,"body":"Eso ya es cuestión de gustos, XD.\nYo generalmente pierdo mucho antes de empezar a ganar o cosas asi.","replies":[]}]}]}]}]}]},{"poster":"Shinya Yukimura","date":"2016-03-20T05:56:02.632+0000","up_votes":1,"down_votes":0,"body":"Te voy a dejar mi humilde opinion, dodgear siempre y cuando sea la primera partida que lo haces esta bien y te doy razones: Tu composicion de equipo no te gusta, te encontraste con algun jugador potencialmente toxico o simplemente tenes que irte por alguna urgencia. Luego del primer dodgeo te quita 10lp o mas asi que yo dodgearia mas de 1 vez en caso de extrema necesidad","replies":[]},{"poster":"kipkeior","date":"2016-03-20T04:50:00.338+0000","up_votes":1,"down_votes":1,"body":"Vale la pena si , especialmente si ¨no¨ son rankeds , porque ya donde se ponen a pelear por la linea y te hacen la clásica de copy and paste , ya empiezan a insultar a otros  etc , ya se que la partida esta perdida desde que compenzo xD","replies":[]},{"poster":"Priestess Winda","date":"2016-03-20T04:43:24.061+0000","up_votes":1,"down_votes":1,"body":"El dodge no te quita elo, pero hacelo solamente cuando sea absolutamente necesario por que creo que si lo haces constantemente te pueden banear\n\nsaludos{{champion:34}}","replies":[]}]}