{"poster":"Manu Carba","date":"2016-10-08T00:15:43.973+0000","title":"Hasta cuando puedo comprar Iconos de equipos?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Queria saber eso!\n\nPorque estoy apoyando a EDG, porque los conoc&iacute; este mundial, (primer a&ntilde;o que juego al LoL y veo un mundial) y si me siguen gustando capaz me compre el icono para apoyarlos, pero quiero esperar lo maximo posible jeje... Me gusta tambien TSM pero ese es mas comun (?)\n\nGracias por la ayuda y consejos!\n\nEDIT: Como funciona el tema de mejorarlo y esas cosas?","replies":[{"poster":"RaResz","date":"2016-10-08T00:18:27.481+0000","up_votes":1,"down_votes":0,"body":"Mmm, comprarlo ahora o más adelante si no tenes pensado mejorarlo es lo mismo.\n\nSi te gusta y tenes los RP, compralo!\n\nImagino que los iconos estarán hasta el último día de transmisión del mundial.","replies":[{"poster":"Manu Carba","date":"2016-10-08T00:21:23.989+0000","up_votes":1,"down_votes":0,"body":"1. Si me lo compro me dan para hacerlo platino directo?\n2. Que otras formas hay de conseguir el icono sin gastar RP?","replies":[{"poster":"RaResz","date":"2016-10-08T00:26:15.310+0000","up_votes":1,"down_votes":0,"body":"1) Te dan el fragmento de Tier 2 del icono que compraste.\n2) No hay otra forma de conseguir el icono que no sea mediante los 250 RP. El único icono gratuito es el representativo del Mundial 2016.","replies":[{"poster":"Manu Carba","date":"2016-10-08T00:50:00.031+0000","up_votes":1,"down_votes":0,"body":"Y me conviene comprarme el icono ahora? Osea me va a dar el tiempo para llevarlo a tier 3?","replies":[{"poster":"DanteV","date":"2016-10-08T16:20:56.033+0000","up_votes":1,"down_votes":0,"body":"supongo que si necesitas 11 dias para llegarlo a tier 3","replies":[{"poster":"Manu Carba","date":"2016-10-08T18:58:07.587+0000","up_votes":1,"down_votes":0,"body":"Tenes idea si abro un cofre de campeonato con una llave comun y corriente, cuantas joyas me dan?","replies":[{"poster":"DanteV","date":"2016-10-08T19:21:30.645+0000","up_votes":1,"down_votes":0,"body":"De un cofre de campeonato te dan 3 joyas","replies":[]}]}]},{"poster":"RaResz","date":"2016-10-08T15:42:33.880+0000","up_votes":1,"down_votes":0,"body":"Mmm, es complicado, pero puede que llegues si lo compras exactamente ahora y no te perdes ningun día!","replies":[]}]}]}]}]},{"poster":"DanteV","date":"2016-10-08T00:22:42.569+0000","up_votes":1,"down_votes":0,"body":"supongo que hasta noviembre lo que dura el mundial y lo mejoras comprando gemas que se pueden adquirir los dias es que juegan los equipos como hoy, necesitas 22 gemas para subirlo hasta nivel 3","replies":[{"poster":"Manu Carba","date":"2016-10-08T00:24:57.951+0000","up_votes":1,"down_votes":0,"body":"Esas gemas son las que salen 150 PI en la tienda?","replies":[]}]}]}