{"poster":"Manu Carba","date":"2016-02-15T19:59:57.598+0000","title":"Dodgear una de las 10 partidas de posicionamiento rankeds cuenta como derrota?","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Lo que dice el titulo...\r\n\r\nSi dodgeo en una o varias partidas rankeds de las 10 de posicionamiento, me cuentan como derrota?","replies":[{"poster":"NGreppi","date":"2016-02-15T20:26:03.628+0000","up_votes":3,"down_votes":0,"body":"Como experiencia propia y no hablar porque si, dodgear no cuenta en las 10 primeras, lo digo porque en la que iba a ser la primera de todas dodgee y despues jugue una y me aparecio 1 sola jugada..","replies":[]},{"poster":"vaz2001","date":"2016-02-15T20:06:10.880+0000","up_votes":3,"down_votes":0,"body":"En las 10 primeras no te afecta {{champion:432}} \nBueno, tendrás que esperar los 5, 10 o 20 min, pero no te cuenta como derrota","replies":[]},{"poster":"SK Bathoryff","date":"2016-02-15T20:12:06.560+0000","up_votes":2,"down_votes":0,"body":"Muy mal informado...Nada que ver amigo, cuando dogeas y estas en unranked y toda vía no jugaste las 10 partidas, no te cuenta como derrota.","replies":[]},{"poster":"ZeNch","date":"2016-02-15T20:11:26.144+0000","up_votes":2,"down_votes":0,"body":"dodgear las 10 primeras no es derrota pero cuenta como evitada... a lo que voy es que en vez de 10 tu elo se basara en 9 o 8 partidas y asi segun cuantas dodgees. sigue sin ser recomendado","replies":[]},{"poster":"KSGL","date":"2016-02-15T20:05:05.416+0000","up_votes":1,"down_votes":4,"body":"¡Buenas!\n\nSí, dodgear una partida cuenta como derrota sea en posicionamiento, o bien en promoción. Desde esta temporada la única forma de salvarse es no fijando un ban por lo que experimenté tras un par de partidas, sin embargo sí se aplica la penalización por tiempo.\n\n¡Saludos!","replies":[{"poster":"Server GG","date":"2016-02-15T20:09:44.697+0000","up_votes":4,"down_votes":1,"body":"No, muy mal informado..dogear en las partidas de posicionamiento no cuenta como derrota (yo lo hice y gané 8 de 10 con ese método y ningún problema) solo hay que estperar el tiempo de penalización y nada mas","replies":[]}]},{"poster":"MatiasZERO","date":"2016-02-15T21:24:41.815+0000","up_votes":1,"down_votes":1,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/Os1xBbE6-pregunta-sobre-las-10-partidas-de-posicionamiento?comment=0001\nNo crees más temas con lo mismo, si ya está respondido.-","replies":[{"poster":"Manu Carba","date":"2016-02-15T22:58:16.012+0000","up_votes":1,"down_votes":0,"body":"Me respondieron dos personas, uno contradiciendo al otro. ¿Cómo se yo quién miente y quién no? ¿o quién sabe y quien no?\n\nNo digas boludeces.-","replies":[]}]},{"poster":"lordeman10","date":"2016-02-15T20:27:12.857+0000","up_votes":1,"down_votes":0,"body":"creo que si bien no la toma como derrota te la descuenta de tus provisionales osea jugarías solo 10 si esto es bueno o malo no estoy seguro la verdad que experimentaría con mi smurf que todavía no lo posicioné :P","replies":[{"poster":"judas94","date":"2016-02-15T20:38:10.873+0000","up_votes":1,"down_votes":0,"body":"Yo creo que te sigue dando las 10 provisionales, el año pasado dodge un par de salas cuando estaba haciendo las primeras 10 y creo que juegue las 10.","replies":[]}]}]}