{"poster":"Skagerak","date":"2016-11-02T19:31:01.853+0000","title":"Wunsch Elo","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hey ich wollte einfach mal fragen wie es bei euch diese Season so gelaufen ist. Hat jeder von euch seine Wunsch Elo erreicht und wenn ja warum und wenn nein nat&uuml;rlich auch warum. :D \r\n\r\nIch habe meine Wunsch Elo (Master) leider nicht erreicht, den gr&ouml;&szlig;ten Faktor spielte bei mir da leider die Zeit. Ich denke das ist bei vielen &auml;hnlich :)\r\nAls ich aber gemerkt habe das es eben nichts wird hab ich mir noch einen Account nach Diamant hochgespielt. Demnach bin ich trotzdem recht zufrieden mit meiner Leistung. ( Ist einfach das beste Gef&uuml;hl zu sagen man ist 2 mal Dia :D).\r\n\r\nNaja wie dem auch sei ich werde mich bis Ende der Season auf meinen Lorbeeren ausruhen. Den Leuten die immer noch am tryharden sind viel Gl&uuml;ck das ihr es noch hin bekommt :) \r\n\r\nMfg Skagerak","replies":[{"poster":"Chryssey ","date":"2016-11-04T19:55:02.046+0000","up_votes":2,"down_votes":0,"body":"Ich hatte erst letzte Season angefangen und hab mich von B5 auf B2 hoch gekämpft diese Season war Silber auf jeden Fall mein Ziel , das Spiel hat mir aber so viel Spaß gemacht das ich es förmlich gesuchtet hab und sogar mein Ziel weit überschritten hab ich bin nun Platin 5 und fast sogar Platin 4 und denke wenn man aufsteigen will soll man einfach das zocken was Spaß macht!{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Popstar","date":"2016-11-07T17:17:04.292+0000","up_votes":1,"down_votes":0,"body":"Gratuliere! {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"ÐankGamer420","date":"2016-11-03T15:00:08.627+0000","up_votes":1,"down_votes":0,"body":"Wollte Gold werden, aber ich habe zu wenig Rankeds gemacht und habe manchmal geflamt. Mein ziel ist es 100% nicht mehr zu flamen und eigentlich nur noch Rankeds zu machen :D","replies":[]},{"poster":"Lagbeard","date":"2016-11-02T22:27:56.896+0000","up_votes":1,"down_votes":0,"body":"Tja, ein kleiner Fisch wie ich ist da ziemlich bescheiden. Ich war letzte Season Silber 1 und wollte nun Gold erreichen - Erfolglos. Nach einer katastrophalen Season die ich (wohl verdient) mit Promos von Bronze zu Silber und Abstiegskämpfen verbracht habe, bin ich nun komplett ahnungslos, was ich tun soll. \nIch habe Janna gemaint, und meine Winrate auf ihr ist absolut inakzeptabel (genau so wie meine spielerische Leistung allgemein). Ich habe mich nun damit abgefunden, dass ich diesen Champ wohl nicht weiter belästigen sollte, und verusche nun im Rest der Season und der Preseason, neue Champs und vielleicht sogar neue Positionen (ADC? Vielleicht auch Mid, aber da bin ich noch schwächer :D) zu lernen um vielleicht in der nächsten Season mit einem echten Main durchstarten zu können. Allerdings wird sich das wohl erübrigen, denn ich habe als Second Role Support, wodurch ich nicht halb so oft ADC üben kann, wie ich es gerne würde. Mal sehen, was ich mir da ausdenke. Vermutlich zwingt mich der Teamersteller ohnehin wieder auf einen Support. Ich sollte mich mal mit Sona näher befassen. VIelleicht kann ich die ja besser.","replies":[]},{"poster":"Nivoras","date":"2016-11-02T21:19:01.848+0000","up_votes":1,"down_votes":0,"body":"Ich wäre gerne Platin geworden, aber ich glaube dafür tilte ich zu schnell... Bei mir reichen schon 2-3 Niederlagen in Folge und ich rede mir ein wie schlecht ich bin, das ich niemals höher kommen werde und höre erstmal ewig lange auf zu ranken:D Aber mal gucken, jetzt für die Presaison habe ich mir vorgenommen ganz entspannt zu spielen, nicht mehr auf meine KDA zu achten und vlt klappt es dann ja nächstes Jahr mit Platin oder sogar Diamond, wer weiß^^","replies":[{"poster":"Eldritchpal","date":"2016-11-02T22:11:42.558+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nivenor,realm=EUW,application-id=YnZkMR0R,discussion-id=moyYQvBh,comment-id=0002,timestamp=2016-11-02T21:19:01.848+0000)\n>\n> Ich wäre gerne Platin geworden, aber ich glaube dafür tilte ich zu schnell... Bei mir reichen schon 2-3 Niederlagen in Folge und ich rede mir ein wie schlecht ich bin, das ich niemals höher kommen werde und höre erstmal ewig lange auf zu ranken:D Aber mal gucken, jetzt für die Presaison habe ich mir vorgenommen ganz entspannt zu spielen, nicht mehr auf meine KDA zu achten und vlt klappt es dann ja nächstes Jahr mit Platin oder sogar Diamond, wer weiß^^\n\nDu solltest bereits nach 2 Niederlagen in Folge für ungefähr ne Stunde mit league aufhören ist schon richtig","replies":[]}]},{"poster":"Kaito","date":"2016-11-02T20:03:37.716+0000","up_votes":1,"down_votes":0,"body":"Meine Wunsch Elo ist Platin. (Mit 'nem Challenger Rahmen & Icon, weil die am besten aussehen)\n\nNaja, bisher nicht erreicht, bin zur Zeit Gold IV mit 72LP. \nIch versuche diese Season noch Gold III zu schaffen und mir Platin dann für die nächste Season vorzunehmen.\nWarum ich's nicht geschafft habe?\n Nunja, ich habe im Laufe der Season nicht ganz so viele Rankeds gespielt und vielleicht bin ich auch noch nicht so weit, dass ich Platin erreichen kann. Also werd ich alles daran setzen und fleißig weiterüben mein Ziel in der nächsten Season zu erreichen.\n {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Práedyth","date":"2016-11-02T20:07:47.719+0000","up_votes":1,"down_votes":1,"body":"wollte auch master werden.....war relativ lange und oft in dia 2 aber als riven otp carried sichs schwer. und dann ist da noch das problem mit den leuten die sich boosten lassen......gott wie ich das hasse. ich würde wetten wenn ich die zeit die ich in riven investiert habe stattdessen in den jungle investiert hätte wäre ich bereits master, evtl sogar challenger (ich lerne sehr schnell). der rang an sich macht mir nicht viel aus aber der rahmen und das icon von master sehen so geil aus....","replies":[]}]}