{"poster":"midlane hokage","date":"2016-08-19T10:50:45.617+0000","title":"Ist das ein Grund jemanden zu melden? Wenn nein, sollte es ein Grund sein?","subforum":"Spielerverhalten & Moderation","up_votes":8,"down_votes":0,"body":"hi,\r\nich hatte eben mal wieder ein Spiel gehabt, wo jemand st&auml;ndig DC&#039;d ist. Haben wir nat&uuml;rlich verloren, ist auch keine gro&szlig;e Sache.\r\nWas mich eher wurmt, ist die Tatsache, dass er folgendes sagte: &quot;geez, since months i get DC&#039;s every game, but only on EUW&quot;. \r\n\r\nHei&szlig;t f&uuml;r mich eigentlich, dass er wissentlich unsere Siegchancen verringert hat, und somit das Spiel unabsichtlich absichtlich negativ beeinflusst hat. Ich wei&szlig;, klingt doof, aber so ist es doch, oder?\r\n\r\nIch finde sowas schei&szlig;e. Klar, er kann nichts f&uuml;r die Probleme seines Anbieters oder so, aber wenn er doch wei&szlig;, dass er mit st&auml;ndigen Abbr&uuml;chen k&auml;mpfen muss, sollte er doch wenigstens kein Ranked spielen, oder? Gemeldet habe ich ihn nicht, da ich mir nicht sicher war ob sowas &uuml;berhaupt gemeldet werden darf, wollte aber mal eure Meinung dazu h&ouml;ren.","replies":[{"poster":"Maexle","date":"2016-08-19T10:53:25.158+0000","up_votes":5,"down_votes":0,"body":"Natürlich darf man sowas melden aber normalerweise sollte da auch der Leaverbuster automatisch darauf anspringen. \n{{champion:17}}","replies":[]},{"poster":"Time2Whine","date":"2016-08-19T11:26:24.753+0000","up_votes":4,"down_votes":0,"body":"Jeder Spieler ist laut den Riot Richtlinien selbst für eine funktionierende Hard - und Software verantwortlich. Tut sie es nicht und der Spieler spielt trotzdem LoL, erhält er entsprechend eine Strafe. Gerade wenn jemand weiß, dass etwas nicht stimmt und trotzdem spielt und dadurch anderen Spielern den Spass durch DC's etc. nimmt, gehört er/sie noch eher bestraft.","replies":[]},{"poster":"eingew","date":"2016-08-19T11:28:50.106+0000","up_votes":3,"down_votes":0,"body":"Mal ganz abgesehen davon, dass die Community das offenbar ebenso wie du einen Report wert findet, an sich ist das ganze System darauf ausgelegt, dass *du* entscheidest, welches Verhalten unangemessen ist. Wenn du also findest, dass entsprechender Spieler damit unsportlich handelt und wissentlich oder gar mutwillig dein Spiel und das deiner Mit- / Gegenspieler versaut, dann handelst du im Sinne des Systems, den Spieler zu melden. Egal, ob du vorher mit anderen abgestimmt hast, ob dieses Verhalten unangemessen ist, oder nicht.\n\nMelden darfst du alles und jeden. So lange du den Button nicht ausnutzt um zum Beispiel schlechte Spieler für ihre (potentielle) Unfähigkeit zu bestrafen benutzt du das System genau richtig, indem du Spieler Aufgrund ihres unangemessenen Verhaltens meldest. Am besten schreibst du einfach in das Kästchen den genauen Grund für deine Meldung, um Missverständnissen vorzubeugen.\n\nUnd selbst wenn du mal versehentlich jemanden reportest, der das eigentlich nicht verdient hätte, das ist kein Problem, das System bestraft sowieso nur Spieler, die es verdient haben. Und für falsche Reports bestraft wurde bisher nur eine Gruppe von Spielern, seither ist das nicht wieder aufgetreten, sollte Riot allerdings noch einmal Spieler für den Missbrauch von Reports bestrafen, so werden sie die Spieler auswählen, die das ständig tun und nicht nur selten mal dabei einen Fehler machen.","replies":[]},{"poster":"Haeffer","date":"2016-08-19T11:15:42.171+0000","up_votes":2,"down_votes":0,"body":"Ich hatte gestern jemand der hatte ein Problem mit seinem Ping, dieser war laut seiner Aussage (sehr) hoch, was ein Spielen kaum möglich gemacht hatte.\n\nIch will ihm nichts unterstellen, daher vermute ich auch lag es daran, dass dieser nicht einen Annie-Stun mit der ultimative Fähigkeit mal auf einen Gegner getroffen hat.\n\nKann ja alles mal passieren, hatte auch erst vor kurzem Latenz-Probleme durch ein Windows Update, welches ich nicht stoppen konnte.\n\nAber auf Nachfrage, meinte er diese Probleme hätte er immer seit Season 4.\n\nEr hat also, wie in deinem Fall, Ranked gespielt mit einem **wissentlichen **und vor allem doch auch wesentlichen Handicap gespielt.\nDies finde ich nicht den Teamkollegen fair gegenüber.","replies":[]},{"poster":"Nuckmuck","date":"2016-08-19T13:10:07.219+0000","up_votes":3,"down_votes":2,"body":"Natürlich ist es reportbar und du solltest den Spieler dafür reporten, erstrecht wen er es vorsätzlich macht. \nMeiner Meinung nach gehören auch die Leute reportet die (als Support) 0/10/x stehen und dann sagen \"Ich bin ja nur Support, das ist nicht wichtig wenn ich viele Tode habe\" \n\nGrundsätzlich stelle ich mir bei einem Report die frage: Möchte ich diesen Spieler anderen oder mir selbst in einen weiteren Spiel zumuten ? \nWenn die Antwort nein lautet weil er sich unsportlich oder sogar beleidigend Verhalten hat oder in sonstiger weise negativen Einfluss auf das Spiel genommen hat reporte ich diesen Spieler. \n\nUnd das ich mit dieser Philosophie richtig liege bestätigt mir jedes mal der \"Feedback\" Dialog der bestätigt das ein vor kurzen gemeldeter Spieler bestraft wurde.","replies":[{"poster":"clair de lune289","date":"2016-08-19T13:55:31.278+0000","up_votes":1,"down_votes":0,"body":"also sollten deiner Meinung nach alle Supports ausnahmslos versuchen jeden kill zu bekommen,da es deiner Meinung ja egal ist wie viele assists sie haben.\n\nz.b. sind stats wie 0/10/40 ganz ok/gut wenn man z.b, eine annie als support spielt \n\nwahrscheinlich bist du auch einer der glaubt das jeder kill in der botlane dem adc zu verdanken ist (grade im earlygame) nur weil nach möglichkeit dieser ihn bekommt und eben nicht der support der den kill erst mit cc und/oder poke möglich gemacht hat.\n\nläuft es gut heißt es immer \"gj adc\" läuft es schlecht ist es eher \"this support...\" und dann wird sich gewundert warum support bei vielen unbeliebt ist","replies":[{"poster":"Nuckmuck","date":"2016-08-28T06:09:22.553+0000","up_votes":1,"down_votes":0,"body":"Nein, ich bin der Meinung das die Aussage \"Es ist egal wie viele Tode ich habe, ich bin nur Support\" nicht zieht.\n\nIch bin weder der Meinung das der ADC auf der Bot die kills macht (den das ist in den wenigsten fällen der Hauptgrund für einen Kill) noch das Supporter absichtlich Kills krallen sollen. \n\nAußerdem wird in meinen Spielen der Support in den seltensten fällen geflamt. \n\n\nWenn die Annie 0/10/40 steht, aber das restliche Team nur maximal 2 Tode hat, dann hat sie trotzdem viel zu viele Tode.","replies":[{"poster":"Sirrkas","date":"2016-08-28T14:08:49.370+0000","up_votes":1,"down_votes":0,"body":"Das klingt für mich nach ziemlich wenigen Toden auf Annie, wenn sie den Zweck verfolgt, an den ich gerade denken. Der wäre nämlich reingehen, eventuell mit Flash, alles stunnen und zusehen wie das eigene Team ein Ace macht, während die Gegner auf dich einkloppen. Die 40 Assists sprechen da eher dafür, dass Annie ihre Aufgabe gut erfüllt hat.","replies":[]},{"poster":"TeoX796","date":"2016-08-28T12:55:16.097+0000","up_votes":1,"down_votes":0,"body":"du hast wohl nie Sup gespielt was.....","replies":[]}]},{"poster":"Nightmare Azir","date":"2016-08-19T14:23:46.273+0000","up_votes":1,"down_votes":0,"body":"Ich kann deine Einstellung sehr gut verstehen. Ich spreche aus der Mainposition Mid Lane. Wenn ich mal keine Lust auf Mid Lane habe gehe ich Fill. Ich kann unterschreiben dass Supporter mehr geflamed werden aber adc's werden genauso geflamed manchmal. Ich spreche nicht davon wenn ich eine spezifische Lane spiele und dann geflamed werde sondern über meiner allgemeinen LoL Erfahrung. Abgesehen vermute ich nicht dass dies der Grund ist warum Support unbeliebt ist. Abgesehen davon hat jede Lane seine Daseinsberechtigung und es gibt auch auf jeder Lane Mains! Ich hoffe du kannst meine Ansicht nachvollziehen. \nLG ColdRizzon{{item:3110}}","replies":[{"poster":"clair de lune289","date":"2016-08-19T17:04:31.763+0000","up_votes":1,"down_votes":0,"body":"ich willl hier nicht behaupten das support mehr geflamt wird sondern nur das in den berreichen in denen ich bis jetzt gespielt habe (silber bis plat) der support (wenn er nicht grade einen extremen snowball mit einem \"dmg\" support hat) selten für gute arbeit gelobt wird.\ndas liegt wohl hauptsächlich daran das seine arbeit schlechter \"sichtbar\" (wards/peele/calls) ist.","replies":[]}]},{"poster":"Sirius00","date":"2016-08-19T14:17:06.679+0000","up_votes":1,"down_votes":0,"body":"Supports haben meine vollste bewunderung, wenn sie nicht fulltank/fullap bauen, sondern wirklich supportitems wie mikaels, shield of the iron solarii oder das rote Trinket. Leider sind solche supports zumindest bei mir selten, weshalb ich fast nur premate spiele. Aber in der Lane gebt ihr den Ton an, und wenn es einen Kill gibt, dann weiss jeder ADC und jeder Support, dass es nur einen gibt, der für diesen KIll verantwortlich ist...\n\nMfG{{champion:96}}","replies":[]}]}]},{"poster":"mOlDaViA","date":"2016-08-20T01:31:45.824+0000","up_votes":1,"down_votes":0,"body":"Da hätte ich jetzt auch mal eine Frage.\n\nDarf man jemanden melden, der einem den Champ bannt den man spielen will, nur weil er/sie denkt es wäre ein troll pick?\nIch z.b. habe gerade Taliyah auf der Top gepickt. Ich bin mit ihr eig richtig gut auch auf de Top. Aber meine mates meinten sie bannen zu müssen da ich anscheinend \"trolle\".  Das sind meiner Meinung nach kiddys die keine Ahnung haben, aber mir versaut sowas den Spaß.\nHab jetzt leider kein screen mehr machen können, habe allerdings die Konverstion kopiert.\n\nDontUnderestimat : can i mid pls\nsmokedead44 drg2k: prefer some supp ?\nlevystrike 27i: no sorry\nDontUnderestimat : ok :(\nmOlDaViA G&deg;E&deg;R: Reported                 <-- da wurde mein Champ gebannt\nDontUnderestimat : lol\nmOlDaViA G&deg;E&deg;R: Report levy\nDontUnderestimat : pretty sure thats not a reportable offence\nDontUnderestimat : banning you from troll pick\nlevystrike 27i: talia top?\nlevystrike 27i: go troll np\nmOlDaViA G&deg;E&deg;R: troll pick? ru stupid?\nmOlDaViA G&deg;E&deg;R: ok now i go troll\nDontUnderestimat : 4x report then\nsmokedead44 drg2k: i  quit np\nDontUnderestimat : which in ranked is 2 week ban\nmOlDaViA G&deg;E&deg;R: do it\nDontUnderestimat : thanks dude\nDontUnderestimat : fed up of these children\nsmokedead44 drg2k: i dont want to play with this guys\nDontUnderestimat : he is a child\nmOlDaViA G&deg;E&deg;R: screen goes to riot\nDontUnderestimat : he is thowing a tantrum\nsmokedead44 drg2k: im taking photo and send for riot forum bye moldavia <3\nDontUnderestimat : lol :)\nsmokedead44 hat den Chatraum verlassen.\nEin Spieler hat die Championauswahl verlassen. Deine Gruppe ist zum Matchmaking zurückgekehrt.\nDu bist nun wieder nur mit deinen arrangierten Teammitgliedern in einem Chatraum.\n\n\nIch finde sowas einfach nur lächerlich. Ich mein ich spiel sogar Ashe auf der Top was eig echt komisch ist. Aber selbst das geht wenn du weisst wie.\nAber Taliyah bannen weil man sie auf der Top spielt? *hate those kiddys*\n\n\nSchreibt mal was ihr davon haltet oder dazu denkt.\n\nGrüße\nmOlDaViA","replies":[]},{"poster":"BMG Seddy","date":"2016-08-19T21:29:17.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=free hentai,realm=EUW,application-id=KYnfKGf0,discussion-id=4GT86Poz,comment-id=,timestamp=2016-08-19T10:50:45.617+0000)\n>\n> hi,\n> ich hatte eben mal wieder ein Spiel gehabt, wo jemand st&amp;auml;ndig DC&amp;#039;d ist. Haben wir nat&amp;uuml;rlich verloren, ist auch keine gro&amp;szlig;e Sache.\n> Was mich eher wurmt, ist die Tatsache, dass er folgendes sagte: &amp;quot;geez, since months i get DC&amp;#039;s every game, but only on EUW&amp;quot;. \n> \n> Hei&amp;szlig;t f&amp;uuml;r mich eigentlich, dass er wissentlich unsere Siegchancen verringert hat, und somit das Spiel unabsichtlich absichtlich negativ beeinflusst hat. Ich wei&amp;szlig;, klingt doof, aber so ist es doch, oder?\n> \n> Ich finde sowas schei&amp;szlig;e. Klar, er kann nichts f&amp;uuml;r die Probleme seines Anbieters oder so, aber wenn er doch wei&amp;szlig;, dass er mit st&amp;auml;ndigen Abbr&amp;uuml;chen k&amp;auml;mpfen muss, sollte er doch wenigstens kein Ranked spielen, oder? Gemeldet habe ich ihn nicht, da ich mir nicht sicher war ob sowas &amp;uuml;berhaupt gemeldet werden darf, wollte aber mal eure Meinung dazu h&amp;ouml;ren.\n\nWenn er hohen Ping hat und Normals spielt, ist das noch akzeptabel (meine Meinung) weil mir passiert das auch ab und an mal. Aber gerade aus diesem Grund sollte man keine Rankeds spielen. Ich selbst spiele auch nicht Rankeds weil ich weiß das es manchmal eben zu den hohen Pings kommt.\nDas ist auf jeden Fall ein Grund zum reporten da er es mit purer Absicht macht.\nUnd wenn er es schon seit Monaten so macht, dann wird er bald auch höchstwahrscheinlich eine Strafe bekommen.","replies":[]},{"poster":"Zanlan","date":"2016-08-19T14:00:15.146+0000","up_votes":1,"down_votes":0,"body":"Ja, ich reporte sowas.\nJeder sollte selber schauen ob sein System läuft und erst dann spielen.","replies":[]},{"poster":"Killerkante","date":"2016-08-19T12:57:47.659+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach ist es ein Meldegrund, ganz besonders wenn's einem bewusst ist dass das häufiger passiert.\nWenn nicht ist's auch ein Grund... warum?\nWeil man nur hauptsächlich nur dann bestraft wird wenn's zum Regelfall wird.\nMan versaut jedesmal bis zu 9 Leuten das Spiel.\n\nAllerdings kümmert sich der leavebuster darum.","replies":[]},{"poster":"Maíko","date":"2016-08-19T10:54:38.746+0000","up_votes":1,"down_votes":0,"body":"Klar...sobald jemand afk geht, aus welchen Gründen auch immer, ist das ein Verstoß.\nSowas kannst du einfach reporten.","replies":[]}]}