{"poster":"Mazoku","date":"2016-01-24T16:06:01.742+0000","title":"Teemo","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Recientemente empece a jugar teemo. Lo encuentro muy divertido en las ligas bajas (gold principalmente) ya que clasifique en silver 1 (de platino a silver) y alli no saben contrarrestarlo. Es por ese motivo que estoy subiendo a puro teemo.\r\n\r\nPor que creen ustedes que se lo considera un troll pick en ligas bajas?\r\n\r\nEntiendo que en ligas altas puede ser un champ poco efectivo a menos que se lo pickee en un nicho en particular pero en ligas bajas hace destrosos.\r\n\r\nSera porque es un champ super dificil de jugar?","replies":[{"poster":"Nathan Op","date":"2016-01-24T16:13:02.796+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/289748166/1901367\n\n\nsin palabras","replies":[{"poster":"Revolución","date":"2016-01-24T17:49:53.015+0000","up_votes":1,"down_votes":0,"body":"Eso sí que es meritorio, tenías una MF support full AP (que parece que jugaba bien) y una Lulu que con mirarle la build nada más me hizo dar vergüenza ajena.","replies":[{"poster":"Nathan Op","date":"2016-01-27T02:52:32.040+0000","up_votes":1,"down_votes":0,"body":"alguien lo vio :O gracias xd","replies":[]}]}]},{"poster":"Pirata Yasparo","date":"2016-01-24T17:56:16.808+0000","up_votes":1,"down_votes":0,"body":"Hola lo que pasa principalmente es que en lineas bajas se tiene un desconocimiento de los campeones en general y teemo es efectivo por:\nDesconocen la pasiva de la e y comienzaan a tradear recibiendo cada vez mas daño\nNo compran pinkwards\nLa q de teemo no se puede fallar.\nSe buildean mal contra teemo y seguramente el resto de champs.\n\nNo se porque se le considera troll pick, la verdad es que un teemo bien jugado puede tener bastante impacto en el juego, aunque lo mas probable es que por desconocimietno se le considere poco util, algo similar a lo que se dice de shaco en la tf, pero es por desconocimiento. Saludos! .\n\nPD: Ademas teemo es couter de varios champs.","replies":[]},{"poster":"Korichigo","date":"2016-01-24T16:38:43.347+0000","up_votes":1,"down_votes":0,"body":"Mira amigo... te soy sincero... vi tu historial y das que hablar bastante con teemo, solo 2 o 3 partidas saliste bien bien, las demas fuiste todas carreados con mas muertes que kill, y las muertes no ganan las partidas, solo los objetivos eso esta claro... pero tampoco vale de nada matar 100 y morir 200 nada rentable... asi que no se yo me fijaria...","replies":[{"poster":"YanXi","date":"2016-01-24T16:41:42.341+0000","up_votes":1,"down_votes":0,"body":"Recientemente empezo a jugar como dice al principio del post, pero el no habla de su habilidad con teemo sino mas bien de que porque es considerado pick troll en ligas bajas\n\n-Saludos","replies":[{"poster":"Mazoku","date":"2016-01-24T17:06:09.719+0000","up_votes":1,"down_votes":0,"body":"Todavia no tengo ni la quinta maestria de campeon. Pero parece que hay gente que ni se gasta en leer todo el TH antes de contestar cualquier verdura.","replies":[{"poster":"Korichigo","date":"2016-01-24T17:21:37.962+0000","up_votes":1,"down_votes":0,"body":"Si decis no saben contrarrestarlo entonces que significa?, que te esta yendo bien PORQUE NO SABEN CONTRARRESTARLO VOS MISMO LO DECIS... entonces edita y pone: es de mucha utilidad, y ahi tendria mas sentido lo que decis. si terminar 0/999 para vos es no saber contrarrestarlo, creo que tenes el concepto bastante errado...","replies":[{"poster":"Mazoku","date":"2016-01-24T17:26:26.591+0000","up_votes":1,"down_votes":0,"body":"En respuesta a tu pregunta: Que no sepan contrarrestarlo no significa que me este yendo bien. Ese es un salto logico que no podes hacer sin incurrir en una falacia.\n\nSaludos!","replies":[]}]}]}]}]},{"poster":"DayronDrakend","date":"2016-01-24T16:13:38.267+0000","up_votes":1,"down_votes":0,"body":"Porque lo suelen utilizar para trollear, y los que lo utilizan para jugar tampoco son muy buenos. Destrozos*","replies":[]},{"poster":"MewMewKittyCutie","date":"2016-01-24T16:13:16.694+0000","up_votes":1,"down_votes":0,"body":"lo malo de teemo es que en ligas mas arriba lo pueden dejar en la mierda y le campean {{item:3364}}","replies":[]},{"poster":"NoSoyRodriguez","date":"2016-01-24T16:47:05.760+0000","up_votes":1,"down_votes":1,"body":"NO LO QUE PASA ES QUE EN LIGAS BAJAS NO TIENEN IDEA DEL JUEGO DE TEEMO POR LO QUE LOS CIEGOS SE PONEN HACER TF MIENTRAS ESTAS PUSH ALGUNA LINEA MUEREN X NO DEFENDER BAJO TORRE Y HECHAN CULPAS ENSEGUIDA AL POBRE TEJON ES LO QUE ME ACABA DE PASAR Y MAS EN LAS DONDE LA GENTE DE LATINOAMERICA ES LA GRAN MAYORIA IGNORANTE Y BRUTA","replies":[]}]}