{"poster":"aramsucks","date":"2018-06-12T17:24:46.010+0000","title":"Meine Sicht auf die ARAM-Änderungen","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"Kurz zu mir: Ich spiele ARAM seit man damals den Modus noch in Custom Games auf der Kluft zocken musste. Ich bin nicht der aktivste Spieler, komme aber auf ca. 5k Spiele verteilt &uuml;ber mehrere Accounts und meine beiden Hauptaccounts sind am oberen Ende der Fahnenstange des Matchmakings. Ich wollte einige Punkte ansprechen, die andere Spieler kritisiert haben:\n\n\n{{item:3083}} _Das Entfernen von Warmogs_\n\nIch habe schon ein paar Mal gelesen, dass man es negativ empfindet, dass diese R&uuml;stung nun wegf&auml;llt, dass man nun Probleme mit Tanks bekommt, weil diese im Gegensatz zu Adcs keinen Sustain h&auml;tten.\nDas mag in gewisser Weise so sein, aber Warmogs war schlicht zu stark. ARAM lebt davon, dass jeder Zug auf der Lane auch Konsequenzen hat. Wenn man einen Trade versucht, muss man das Risiko eingehen, dass man HP verliert und diese nicht sofort ersetzt bekommt, vielleicht sogar den Ausgang des n&auml;chsten Teamfights riskiert zu verlieren.\n\nWarmogs war auf vielen Champion (auch auf hohem Matchmaking) als 3./4./5. Item ein Nobrainer und hat viele Poke-Setups einfach gekontert. Wenn ein Item ganze Champions kontert, dann muss es generft oder entfernt werden. Wer mal als Poke-Champ in einem Setup ohne echten Engage gegen eine Soraka mit Warmogs gespielt hat, hatte die ersten 10, max. 15 Minuten Spa&szlig; gehabt, kann dann aber gef&uuml;hlt afk gehen.\n\n\n_Der Nerf von Dark Harvest_\n\nDann habe ich &ouml;fters gesehen, dass Dark Harvest nun f&uuml;r zu schwach befunden wird...\nNEIN!\n\nDark Harvest war seit Einf&uuml;hrung des neuen Runensystems viel zu stark. Es hat gar nicht lange gedauert und viele Spieler begriffen diese Rune als eine Art Nobrainer f&uuml;r fast jeden Champion. Und das war sie auch, wer damit gekonnt umgehen konnte, hat absurd viel zus&auml;tzlichen Schaden machen k&ouml;nnen.\nDa viele Matches in regelrechten Fiestas mit 50 Kills insgesamt in 10 Minuten oder noch mehr endeten, war diese Rune bestens daf&uuml;r geeignet.\n\nDer Nerf ist deshalb v&ouml;llig gerechtfertigt und nun ist die Rune meiner Meinung nach als balanced zu sehen. Nun kann man sich auch viel mehr Gedanken &uuml;ber andere Runenkombinationen machen, ohne Gefahr zu laufen, dass man enorm viel Schaden links liegen l&auml;sst. Einen weiteren Nerf oder einen Buff halte ich f&uuml;r unangebracht.\n\n\n{{item:4004}} {{item:4010}} {{item:4001}} _Neue, zeitlich begrenzte Items_\n\nHier ist man wohl eher geteilter Meinung. Bin ich tats&auml;chlich auch. Die Stiefel sind so, wie sie sind, v&ouml;llig in Ordnung.\nDas Spektralmesser ist auch bestimmt gut f&uuml;r Assassinen, aber erfordert meiner Ansicht nach einiges an Erfahrung mit dem Item. F&uuml;r Anf&auml;nger also g&auml;nzlich ungeeignet.\nDas Mage-Item (Ich kenne nicht mal den Namen ...) ist f&uuml;r mich bisher uninteressant gewesen. Es bietet die gleichen Werte wie das Morellonomikon, nur statt den klaffenden Wunden einen Spellshield. Aber f&uuml;r wen soll das Item sein? AP-Assassinen? Gibt jetzt nicht so viele davon, die auch im ARAM viable sind. Der Schild ist auf Mages oftmals sinnlos, weil man schnell einen Zauber auf einen Gegner wirft, den Schild ausl&ouml;st und er nutzlos auf CD geht (30s). Da habe ich lieber die klaffenden Wunden.\n\n\nAlso das sind die Punkte, welche mich bei der Kritik anderer Spieler st&ouml;rten. Alles andere wie erweiterter Champion-Pool, neue Lebensrelikte und Ersatzbank sind ja durchweg positiv angekommen und ich kann mich dem nur anschlie&szlig;en.","replies":[{"poster":"OPChampsSucks","date":"2018-06-12T17:44:17.622+0000","up_votes":1,"down_votes":1,"body":"1. Nein kann dir nicht zustimmen. Einige Champs haben durch das entfernen von warmogs eine unglaublich schlechte Möglichkeit wirkungsvoll zu sein (bsp skarner)  außerdem haben gewisse Champs wie garen dadurch noch weitere unglaubliche starke vorteile erhalten.  Zudem sind heal&shield supporter jetzt unglaublich unbalanced& broken weil man jetzt nicht mal eine warmogs kaufen kann um die heilung des gegnerischen Teams auszugleichen. Hab bis jetzt die letzten 30 sona games wo diese im Gegnerteam war ALLE verloren weil es einfach unnormal unbalanced ist gegen sie nun zu spielen. Das meinte ich auch mit \"jetzt wird an ARAM rumgefuscht und am Ende ist der Modus unspielbar\" genau dieser Fall trifft gerade ein. Genau so wie ich schon vor Monaten gesagt habe wie es mit KdB weitergeht wenn League weiterhin so eine Kurve fährt und genau das ist ebenfalls eingetreten (aber ich erzähl nur Müll und mir glaubt ja niemand komisch das ich am Ende fast immer recht habe lol) \n\n2. ja dark harvest ist jetzt gut wie es ist. allerdings war es auch nicht krass broken.\n\n3. hier gibts durchaus geteilte meinungen. Ich finde das feature mit den schuhen zwar eig ziemlich nice und auch das spektralmesser kann ganz lustig sein (skarner XDDDDDDD) aber die gegenstände gehören für einen leidenschaftlichen aram spieler einfach nichts in aram. dann kannste auch dauerhaft SMR Poroking reinbrettern. Der modus wurde übrigens von Tencent ebenfalls zerstört danke dafür.","replies":[{"poster":"aramsucks","date":"2018-06-12T18:12:32.011+0000","up_votes":1,"down_votes":0,"body":"Das ist aber Quatsch, so einige Champions waren schon immer schlecht im ARAM, allen voran Skarner. Ob mit Warmogs oder ohne, solche Champions haben nicht das Problem des Sustains, sondern dass sie viel zu einfach gekitet werden können, weil ihr Spielstil darauf ausgelegt ist, am Gegner dran zu bleiben, aber nur wenig Schaden verursachen.\n\nGaren mal als Beispiel hat eher einen flexibleren Spielstil, er kann sowohl viel Schaden in den Gegner drin austeilen, als auch in einer Hit-and-Run-Manier dem Gegner empfindliche Schadensspitzen verteilen.\n\nHeliung ist im ARAM derzeit gut gebalanced, einzig eben Garen und Mundo mit ihrem Self-Heal sind aktuell gewissermassen Geheimtipps, weil sie so starke und flexible Kits mitbringen.\n\n\nIch wäre vorsichtig, was du mit \"leidenschaftlich\" meinst. Das Spiel braucht immer wieder mal einen Meta-Shift und der kam mit Einführung des Snowballs genau richtig. Dann war erstmal ne Zeit lang Schluss mit reinen Poke-Teams und es war die Zeit der Fiesta geboren. Zumindest mir macht diese Meta deutlich mehr Spaß.","replies":[]}]}]}