{"poster":"PenobertLP3","date":"2017-12-19T19:17:51.888+0000","title":"High Ping in LoL","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich habe seit ca. 2 Wochen ein kleines Problem, also mein Internet l&auml;uft fl&uuml;ssig wie immer und in keinem anderen Spiel habe ich Probleme mit dem Ping, bis vor ca. 2 Wochen in LoL. Ich wei&szlig; nicht warum aber nur in LoL schwangt mein Ping in Game konstant zwischen 30 und 2000 ms. Auch wenn ich misch anmelden will und im Client an sich l&auml;uft alles extrem langsam.\r\nIch habe bereits den PC platt gemacht und die Treiber neu installiert und wei&szlig; langsam nicht mehr weiter woran es liegen kann.\r\nIch hoffe, dass mir jemand helfen kann,\r\n\r\nMatthias","replies":[{"poster":"Homunculi","date":"2017-12-20T09:04:57.894+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nmache doch bitte mal einen Tracert:\n\n>Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\nZusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\nEin gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\nhttps://www.pingplotter.com/download.html \nUm ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n\n>Trace Interval: 1 second\nFocus Time: all\nTarget Name: 185.40.65.1\nStartet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\nWenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n\n>Edit -> Copy as Text\nGeht nach Pastebin.com\nFügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\nKopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n\n\n\nBist du bei UnityMedia/Kabel BW?\n\nFalls ja frag mal bitte nach ob sie bei dir die IPv6 Verbindung abschalten.","replies":[]},{"poster":"DrYatty","date":"2017-12-19T19:24:01.680+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nbei Verbindungsprobleme rate ich dir mal diese Liste komplett abzuarbeiten. -> [Klick](https://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen)\n\nNachdem du alles durchgegangen bist und du bemerkst nichts hat funktioniert hat, melde dich einfach nochmal mit der Antwortenfunktion. :)","replies":[]}]}