{"poster":"Celesil","date":"2015-12-15T10:50:41.670+0000","title":"Carrien/ getragen werden - Was ist das?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Moin moin liebe Zocker und Zockerinnen,\r\n\r\nes ist ja oft hier im Forum zu lesen oder auch teilweise im Spiel bzw. nach dem Spiel, das wer getragen (gecarried) hat oder wie er/ sie dies bewerkstelligt.\r\nJeder von uns hat, denke ich mal, die eigene Auffassung davon, was der Begriff &bdquo;das Spiel tragen&ldquo; denn nun wirklich ausmacht und vor allem, wie ich oder wir dies erkennen. Gibt es &uuml;berhaupt eine Definition f&uuml;r den Begriff, gibt es eine Faustformel die wir grunds&auml;tzlich auf alle Spiele anwenden k&ouml;nnen?\r\nIch denke nein.\r\n\r\nHier m&ouml;chte ich einfach mal meine Ansichtsweise des Begriffes &bdquo;wie trage ich ein Spiel&ldquo; \r\nerl&auml;utern bzw. was ich darunter verstehe.\r\nSelbstverst&auml;ndlich muss dies nicht auf alle zutreffen, noch m&ouml;chte ich irgendjemanden \r\ndavon &uuml;berzeugen das genau meine Ansichtsweise die Richtige sei. Was ich gerne h&auml;tte, das ihr euch die Zeit nehmt und auch einmal erl&auml;utert wann jemand das Spiel getragen hat, nach eurer Auffassung.\r\n\r\n-------------------------------------------------------\r\n\r\nNun f&uuml;r mich hat jemand das Spiel getragen, der die Grundvoraussetzung f&uuml;r das Team \r\nherstellt, &uuml;berhaupt Erfolge in der derzeitigen Partie zu erzielen.\r\n\r\nSei es durch enormen Schaden an z.B. T&uuml;rmen, an den gegnerischen Helden , auch kann die jeweilige Heilung ausschlaggeben sein oder genau so die Platzierung der Augen und entfernen der gegnerischen Sicht.\r\nEbenfalls ist es in meiner Auffassung vollkommen irrelevant ob nun die einsame Insel, auch Top genannt, der Unterst&uuml;tzer, die Mitte oder der Sch&uuml;tze die Grundvoraussetzung aufbaut. Jeder ist dazu in der Lage, nur betrifft es meist (denke ich) nur eine einzelne Person die dies in der Partie meistert.\r\n\r\n-------------------------------------------------------\r\n\r\nNegativ abgegrenzt:\r\n\r\nWenn ich nun die beste KDA habe, bin ich dann automatisch der, der das Spiel getragen hat?\r\nWenn ich nun den meisten Schaden an ... verursacht habe, habe ich dann automatisch das Spiel entschieden bzw. getragen?\r\n\r\nDies k&ouml;nnte ich oder auch wir nun ewig fortf&uuml;hren, zu einem richtigem Ergebnis d&uuml;rften wir nicht so schnell, vielleicht auch gar nicht kommen.\r\nIch denke wir m&uuml;ssen diesen Begriff sehr sensibel und vor allem objektiv auf das jeweilige Spiel anpassen und anwenden. Daf&uuml;r ist das Spiel zu komplex und weitreichend, als so eine schnelle und doch einfache Aussage zu treffen.\r\n\r\n---------------------------------------------------------\r\n\r\nLasst euch aus, schreibt eure Meinung nieder und versucht diese bitte zu erkl&auml;ren.\r\nBin gespannt ob und was f&uuml;r Antworten hier zu lesen sein werden.\r\n\r\nMfG\r\n\r\nCele","replies":[{"poster":"Dratzel","date":"2015-12-15T13:36:32.979+0000","up_votes":3,"down_votes":0,"body":"Am Ende gewinnt das Team, welches unterm Strich die kleinere Anzahl falscher Entscheidungen trifft und die wenigsten Individuellen Fehler begeht.\nWer was wohin trägt, spielt keine Rolle. Die Summe aller Faktoren ergibt das Ergebnis, nicht die Höhe des Einzelnen.","replies":[{"poster":"Shacoláde","date":"2015-12-17T07:50:34.452+0000","up_votes":1,"down_votes":0,"body":"Ich seh es eigentlich ähnlich.\nNicht die Leute die am \"meisten DMG\" gemacht haben oder irgendwo anders in der Statistik vornie liegen, sind nicht automatisch die MVPs.\nMeiner Ansicht gewinnt meistens das Team, dass in Summe die wenigsten Fehler gemacht haben.\nAls bestens Beispiel dient, dazu ein Game, wo es in den ersten 20min 2:24 für die Gegner stand. \nDie waren am Minute 25 so greedy, sodass der Supporter dann gedived haben, weil sie dann einfach gemeint hatten, das game trägt sich nun von alleine.  Wir kamen dann öfter durch solche Aktion in ein 5vs3 überlegenheit, was uns die Möglichkeit gab, das game ins Late zu tragen; Dragon and Baron zu sichern. Zum Schluss wurde einer noch gecatched von denen und das wars. Stand zum Schluss 28:34 und haben es trotzdem gewonnen.\nHaben auch öfter schon mit nem AFKler gewonnen, durch splitpushen. 3 deffen den Tower während der 1 die Tower der Gegner einreist.\nIch muss sagen, dass es mittlerweile sogar einfach geworden ist solche Games zu gewinnen als früher, weil ab einem bestimmten Zeitpunkt die Leute nur noch auf Kills aus sind und das kann man nutzen.","replies":[]}]},{"poster":"EpicDieterBohlen","date":"2015-12-15T15:54:38.497+0000","up_votes":2,"down_votes":0,"body":"bedeutet für mich, wenn ich dazu beitrage, dass meine teammates ihre lane gewinnen und dem jungler z.b. beim counterjunglen helfe. \nkurz gesagt wenn ich einen großen positiven einfluss auf mein team habe.","replies":[]},{"poster":"Veaser","date":"2015-12-15T13:17:48.037+0000","up_votes":2,"down_votes":0,"body":"servus Celesil,\n\nalso Ich trage nur eine große Last auf meinen Schultern wenn es darum geht zu entscheiden ob Ich einen sarkastischen Kommentar zu einer Beleidigung gegen das team oder sonstjemanden zurückschreibe oder ob Ich es doch lasse mit dem Hintergedanken dass es eh keinen Sinn macht.\n\nNa Spaß beiseite, Ich finde jeder kann das Spiel \"tragen\", es können auch mehrere Mitglieder eines teams das Spiel tragen oder das gesamte Team durch gute Zusammenarbeit, so ähnlich wird es auch in deinem Post geschrieben aus meiner Sicht.\n\nViel Spaß beim weiteren Spielen und lass die anderen auch mal was tragen sonst überarbeitest du dich am Ende noch \n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Quietschiie","date":"2015-12-15T11:32:54.166+0000","up_votes":2,"down_votes":0,"body":"Ich finde, ein Spiel carriet man, wenn ich mein Team mit meiner Rolle zum Sieg führe. Ob ich jetz als Jungfer meine Bot-Lane campe, um meinem Schützen möglichst viele Kills bzw. Einen großen lead zu geben oder aber als Support jeden meiner Spells, Summoners usw. perfekt lande ist egal. (Nur um mal 2 Beispiele zu nennen) die Hauptsache ist, dass man seine Rolle perfekt oder so gut wie möglich erfüllt. Wie bereits gesagt wurde hat das ja nicht immer was mit kills oder dmg zu tun..","replies":[]},{"poster":"Sihari","date":"2015-12-15T11:27:46.953+0000","up_votes":2,"down_votes":0,"body":"Grundsätzlich finde ich, dass es Blödsinn ist, jedes Spiel den einen Carrie zu suchen. Viele starren ewig auf die Statistik um den Spieler zu suchen, der die meisten Tötungen verursachte oder den meisten Schaden anrichtete. \nDabei muss es nicht in jedem Spiel einen Carrie geben. Gecarriet wurde nur dann, wenn ein Spieler sich massiv von allen anderen in seinem Team abhob. Ansonsten hat das gesammte Team den Sieg herbeigeführt!\nAuch, dass man eben anhand von Tötungen und Schaden an XY versucht den Carrie zu bestimmen ist absoluter Schwachsinn. Ein guter Spieler zeichnet sich auch durch gute Calls und Zurückhaltung in den passenden Momenten aus.\nAm lustigsten finde ich jedoch diese Leute, die meinen sie hätten das Spiel für ihr Team gewonnen, da sie die meisten Kills hatten, ohne dabei auf die Assists ihrer Mitspieler zu achten. Ein Supporter oder Jungler, der so ziemlich jeden möglichen Kill gesichert und so den Assist abgeräumt hat ist vielleicht eher der  Carrie des Spiels, als der, der nur stumpf abgeräumt hat.","replies":[]},{"poster":"Tokogawaruf","date":"2015-12-15T23:00:31.829+0000","up_votes":1,"down_votes":0,"body":"Der, der gecarried hat, war für mich immer die Person, die dem Team im Allgemeinen den meisten Nutzen gebracht hat. Nutzen ist hier seeehr flexibel, da auch der \"gutmütig/freundliche Spieler\" durch Chat Balsam (wp, ty guys, ...)  das Team derart motivieren kann, das seine Freundlichkeit das Team zu Höchstleistungen treibt und er somit carried.\nAber wie du auch angesprochen hast, ganz grob gesehen ist der Carry häufig der, der im Spiel das meiste reißt, sei es durch Schaden, Kontrolle oder Tankyness bzw. absichtlich im Fokus des Gegners stehen. Wobei meiner Meinung als ADC Main nie ein Einzelner Alleine carried, sondern einer eben nur am meisten heraussticht. Verloren und Gewonnen habe ich alle meine Spiele im Team, nie alleine\n\nein bisschen nebenbei, die Position ADC, also AD Carry, heißt eigentlich nur so, weil er durch das Early Game getragen werden muss/soll, damit er besser oder überhaupt im Late Game carrien kann, wie erwähnt, durch Schaden.","replies":[]},{"poster":"Garth81","date":"2015-12-15T16:15:31.459+0000","up_votes":1,"down_votes":0,"body":"Nimmt man es wörtlich, also das Team zum Sieg tragen, ist es für mich recht leicht ersichtlich. \nDer Carry eines Spiels hat durch das vorhanden sein seiner Person das Team zum Sieg getragen. Dieses ist nicht durch normales Teamplay wie z.B. bei  \n\n> [{quoted}](name=Nephirelle,realm=EUW,application-id=YnZkMR0R,discussion-id=NVzIMoal,comment-id=0000,timestamp=2015-12-15T11:11:33.683+0000)\n\n> Viele glauben, wenn sie eine gute KDA hätten, hätten sie das Spiel auch getragen. Dem ist aber nicht so.\n> Ein überspitztes Beispiel: Wenn vier im Team die fünf Gegner so lange ablenken / platt machen, während ein fünfter erfolgreich Splitpushed, dafür aber kaum Kills oder Assists abbekommt, hat er das Spiel quasi auch getragen.\n\nentstanden. Grade dieses ist für mich kein Carrien sondern ein ganz normales Spielen. Ohne das ablenken der Gruppe, ist das Splitpushen des einzelnen nicht möglich, ohne das Splitpushen des einzelnen ist das ablenken der Gruppe sinnlos. Hier wird nicht ein Part vom anderen gecarriet, sonder es herrscht eher eine gegenseitige Abhängigkeit. \n\nGenauso gibt es keinen Carry, wenn jede Lane gewinnt. Spielt z.B. die Top Lane ohne CC  gegen einen Gegner mit guten Escape möglichkeiten wird sie wahrscheinlich weniger Kills haben, als die Leo Ashe Lane die gegen z.B. Varus / Blitz dominieren,  einfach weil die Bot halt nicht mehr wegkommt. Dadurch haben aber trotzdem beide gleich zum Sieg durch das Gewinnen der Lane beigetragen, wenn auch unter anderen Vorraussetzungen und damit anderem KDA am Ende \n\nCarrien ist also eher eine Einzelleistung (durch Skill oder auch einfach ein sehr glückliches Spiel, ihr kennt sicher die Spiele wo einfach alles klappt) die die Gesamtleistung der Gruppe von Niederlage zum Sieg trägt. Dieses kann sowohl vom Jgl kommen, der irgendwie immer genau da ist, wo er grade gebraucht wird, vom Sup, der jeden engage des Gegner in Rauch oder auch Blut aufgehen lässt, sowie natürlich auch klassisches Abräumen aller Gegner seitens der Carries.","replies":[]},{"poster":"Zulwar","date":"2015-12-15T13:43:46.649+0000","up_votes":1,"down_votes":0,"body":"Wenn jemand ein Spiel trägt, dann ist das für mich jemand, der nicht auf sein Team angewiesen ist.\n\nDas heißt diese Leute sind den eigenen und dem Gegnerischen Team deutlich überlegen.\nMeistens zeichnen sich diese Leute durch eine Hohe Kill und Assist zahl aus, aber auch einer geringen Todeszahl. Manchmal sorgen diese auch dafür das z.b. das Gegnerische Team 3 oder 4 Leute zum verteidigen eines Turmes entsenden und somit der Rest des Teams andere Lanes pushen oder Objekte sichern kann. Somit trägt diese Person das Spiel so das das eigene Team kaum noch was machen muss/schafft.","replies":[]},{"poster":"Alustus","date":"2015-12-15T13:03:20.271+0000","up_votes":1,"down_votes":0,"body":"Carrien kann für mich jeder, der effektiv mithilft das sein Team gewinnt.\n\nSei es ein Jungler der alle Lanes zum rollen bringt.\nEin Support der seinen ADC beschützt und eventuell auch den Adc die kills besorgt.\nOder ein Toplaner der ahead kommt und dann Snowballt.\n....\n\n\nGrundsätzlich finde ich nicht das man sich darüber gedanken machen muss.\nAuch wenn ich es hasse wenn jemand vor einem Spiel schreibt i will carry oder das ganze Spiel schreibt just stay deff i will carry this...\nPrinzipiell sollte das Team zu jemanden sagen thx for carry und nicht der Gegner.\n\n\nAuch sollte man nicht von sich selber behaupten das man gecarried hat, sowas soll wenn überhaupt das Team entscheiden.","replies":[]},{"poster":"Nephirelle","date":"2015-12-15T11:11:33.683+0000","up_votes":1,"down_votes":0,"body":"Viele glauben, wenn sie eine gute KDA hätten, hätten sie das Spiel auch getragen. Dem ist aber nicht so.\nEin überspitztes Beispiel: Wenn vier im Team die fünf Gegner so lange ablenken / platt machen, während ein fünfter erfolgreich Splitpushed, dafür aber kaum Kills oder Assists abbekommt, hat er das Spiel quasi auch getragen.\n\nEin anderes Beispiel: Ich hatte einen Damage Dealer, der kaum Kills, aber etliche Assists bekommen hat. Er flamete mich als Support, weil er mehr Assists (exakt einen *räusper*) hatte als ich und war überzeugt, daher besser zu carrien. Dass sein Job als Damage Dealer doch eher die Kills als die Assists wären und Soraka auch mal im Hintergrund den Heiler gibt, um ohne selbst Assists zu bekommen einen schnellen, erneuten Teamfight gegen den geschwächten Gegner möglich zu machen, kam ihm damals nicht in den Sinn.","replies":[]}]}