{"poster":"Celesil","date":"2015-08-14T08:19:28.155+0000","title":"Erklärung Spieletechnicken/ Mechaniken bzw. grundsätzliche Erklärung","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Moin moin alle zusammen,\n\nin einem anderen Beitrag hatte ich ja gefragt, wie ich ein Spiel aufnehme weil ich mich gern verbessern m&ouml;chte. Ein paar spiele von mir habe ich auch angeschaut und erkannt, ok da war ich (z.B.) zu unachtsam.\nObs auf Dauer wirkt, werd ich ja sehen :)\n\nHier m&ouml;chte ich nun allerdings was anderes Fragen.\n\nIn einem Beitrag hatte jemand eine Liste ver&ouml;ffentlicht, die jemanden aufzeigen sollte wodran er arbeiten k&ouml;nne. Die Liste Sah wie folgt aus:\n\n1) schlechter CS\n2) schlechtes Positionieren in Teamfights\n3) kein Kiten\n4) kein Wissen &uuml;ber Zeitpunkte in denen du engagen solltest (in welcher Spielphase ist mein Champ besonders stark etc.)\n5) was wird wann gebaut?!\n6) was mache ich &uuml;berhaupt die ganze Zeit\n7) wann kann ich pushen\n8) wo ist der Gegnerjungle\n9) wie erkenne ich einen Gank\n10) welcher Support synergiert gut mit mir\n11) wie Freeze ich eine Lane\n12) wie farme ich unter dem Tower\n\nF&uuml;r mich Pers&ouml;nlich, da ich ja fast nur den Unterst&uuml;tzer spiele, sind die Punkte 4, 5, 7, 8, 9, 11 & 12 interessant.\n\nIch habe teilweise wirklich das Problem das ich nicht wei&szlig;, wann soll ich nun (mit Leona z.B.) mich ins gegnerische Team bewegen. D.h. E > R > Q. Das W lassen wir nun mal au&szlig;en vor. Mal erwische ich einen guten Moment und mal einen Moment der echt ... wo sich jeder die H&auml;nde &uuml;ber den Kopf zusammenschl&auml;gt und fragt \"Warum?\".\nGenau so verh&auml;lt es sich mit dem \"Wann baue ich was?\". Klar, wenn viel AP bei den Gegner ist, gehe ich eher auf Magie Resistenz. Andersrum genau so wie mit viel physischen Schaden. Jedoch hadere ich mit mir (als Beispiel) \"Soll ich nu die Schuhe ausbauen oder doch lieber erst das Omen zu ende bauen?\" \"Lieber erst den \"Sightstone\" oder doch lieber die Legion (Gruppen MR Gegenstand)?\"\nEinen Gank erkenne ich eher selten. Dann ist es so, das sich die Gegner extremst zur&uuml;ck halten oder extremst offensiv sind. Zumindest bekomm ich das so meist mit.\n\nSo, nun die wohl absolute Anf&auml;nger Frage, was ist mit \"wie Freeze ich eine Lane\" gemeint? Pragmatisch w&uuml;rd ich ja sagen, einfach mal den Blizzard ins Haus lassen. Jedoch wei&szlig; ja jeder, das ist ein wenig sehr! an den Haaren herbeigezogen :)\n\nW&auml;re nett wenn sich der ein oder andere findet, der f&uuml;r mich ein klein wenig Erleuchtung bzw. Hilfestellungen/ Tipps gibt.\n\nMfG\n\nCele","replies":[{"poster":"Bemte","date":"2015-08-14T09:08:40.333+0000","up_votes":2,"down_votes":0,"body":"Teamfights sind sehr schwer, vor allem in der SoloQ, ja.\nDas Problem hier ist, dass ihr euch kaum absprechen könnt. Und dann passiert es halt mal, dass du rein rennst und dein Team was anderes vor hatte.\nÜblicherweise ist es die Aufgabe des Tanks oder eines anderen Initiators, reinzuspringen und die alle aufzuscheuchen. Als Support solltest du falls möglich (also so lange dein Team dich nicht unbedingt braucht um reinzurennen) bei deinem ADC bleiben und diesen mit deinen Spells und mit Exaust beschützen. Denn wenn der ADC stirbt während der gegnerische noch lebt, ist der Teamfight meist verloren. Andererseits: wenn der eigene ADC noch einige Zeit schönen Schaden austeilt während der gegnerische schon tot ist, werdet ihr diesen Teamfight wohl gewinnen. Also: halte deinen ADC am Leben und sorg dafür, dass ihm kein Gegner gefährlich wird sondern dass er statt dessen alles killen kann.\nZu den Items: Es ist oft schwer zu sagen, was man gerade braucht. Sightstone ist meist sinnvoll als eines der ersten Items. Sicht ist verdammt wertvoll: du siehst einen Gegner, der ganken kommt, du siehst, wenn der Gegner versucht den Drachen zu machen, du siehst ggf. auch wenn der Gegner versucht seinen Buff auf der Bot-Seite zu machen und kannst ihn dann da mit deinem ADC und Jungler bei stören...\nAuch dein Team wird sich über gute Sicht beim Drachen und im gegnerischen Jungle sehr freuen; denn oftmals setzt ja leider kaum einer außer dem ADC wirklich viele Wards.\nJenachdem wie oft ihr gegankt werdet, brauchst du zusätzlich noch ein paar pink Wards und musst den Sightstone wirklich extrem früh kaufen.\nBei den anderen Items hilft ein Blick auf das eigene Team: hat bisher kaum einer von denen Schuhe ausgebaut, wirst du im Teamfight nicht hinterherhängen sondern mit ausgebauten Schuhen eher vorne weg rennen => erst was anderes bauen.\nRanduins ist ein sehr nützliches Item: wenn du wirklich mal ins gegnerische Team reinspringst kannst du alle slowen - Problem: dein Team muss sofort reagieren. Hier hilft ein wenig Absprache im Chat sicher gut.\nDarüber hinaus kannst du einen Gegner, der versucht deinen ADC zu töten, damit slowen und der ADC kann ihn zu tode kiten (vorausgesetzt natürlich der ADC ist gut^^).\nMit dem Freezen einer Lane ist gemeint durch gezieltes, dosiertes Angreifen der Minions dafür zu sorgen, dass die Lane (also der Punkt, wo deine Minions auf die gegnerischen treffen) immer an der gleichen Stelle bleibt. Das macht man natürlich in erster Linie, wenn die Stelle für einen selbst gerade vorteilhaft ist, zB weil man gut farmen kann aber so nah an seinem Turm ist, dass man kaum gegankt werden kann.\nDas wird meist dadurch gemacht, dass man die gegnerischen Minions erst zum Schluss tötet (last hittet), damit sie nicht zu früh sterben und die eigenen nicht zu stark pushen. Damit die gegnerischen nicht pushen tankt man sie kurz (also stellt sich hin und lässt sich von ihnen angreifen), bis die eigene Verstärkung auftaucht.\nDas ist eine oftmals sehr nützliche Technik, wenn man eine Stelle hat die für einen selbst von Vorteil und für den Gegner von Nachteil ist. Andererseits ist es sehr schwer das ordentlich zu machen, vor allem wenn man zu zweit in der Lane ist und der Gegner ggf. versucht was dagegen zu machen (zB während du die Minions tankst bis deine eigenen auftauchen kann er dich ordentlich angreifen^^).","replies":[]},{"poster":"I have NO Impact","date":"2015-08-16T14:56:47.900+0000","up_votes":1,"down_votes":0,"body":"Wenn du willst schaust hier mal vorbei :) ich streame ca. alle 2 tage ich gebe viele tipps für anfänger über das game mein skill selbst ist nicht platin aber ich kann dir viel helfen :)  (bronze-silber)          http://www.twitch.tv/unbel1evablegg","replies":[]},{"poster":"SoulOfLight","date":"2015-08-15T06:36:53.898+0000","up_votes":1,"down_votes":0,"body":"Engagen kannst du fast immer wenn du mindestens Einen punkt erfülst.\n1. Von deinem Team mehr vor ort sind 4v5\n2. Wenn du einen gefedeten Teammate hast auch gerne 2v2.\n3. Wenn der gegnerische jungler top lane gankt und ihr auf der lane gleich auf seid. \n4. Wenn dir dein Jungler mitteilt das er bot ganken möchte und bereits nahe ist, setzt du alles was du hast.\n\nZu beachten sind noch die minions.\nBevor du reingehst überleg was der gegner für cc hat und wie der trade ablaufen soll.\nDas wichtigste ist dein adc zu beschützen.\nIn teamfights stehst du bei deinem adc bis der kamp beginnt, mit leona kannst du gerne deine ult benutzen um den kampf zu eröffnen doch solange kein gegner gestorben ist oder dein team einen gravierenden Vorteil hat wie 5th drake oder baron solltest du nicht all dein cc einsetzen.\nDenn bedenke, jederzeit kann ein shaco aus dem nichts auftauchen und deinen adc bedrängen wenn du dann dein stun noch hast ist dir dein adc sehr dankbar.","replies":[]},{"poster":"Rv Sabo","date":"2015-08-14T17:34:01.909+0000","up_votes":1,"down_votes":0,"body":"Egal mit welchem Champion du spielst solltest du beim Engage immer auf folgendes achten : \n- wo ist die Position des gegnerischen Jungler und Midlaners\n- nie engagen wenn viele gegnerische minions da sind\n- wenn möglich engage immer auf den Adc \n- achte darauf welche Fähigkeiten eure Gegner eingesetzt haben \n \nDer Rest ist eigentlich schon geklärt.","replies":[]},{"poster":"iJUKEuQQ","date":"2015-08-14T11:09:05.085+0000","up_votes":1,"down_votes":0,"body":"laneverhalten\nwenn die waves aufeinandertreffen und kein champ(weder du noch die gegner)die minions angreifen, dann passiert folgendes:\ndie lane belibt in der mitte und es entsteht quasi ein endloser kampf der waves, \nbei der die position wo sie aufeinandertreffen immer so ziemlich genau in der mitte der lane ist.\n\nmit freezen ist folgendes gemeint. du machst nur den letzen schlag um einen minion zu töten, damit du eben die position der waves wo sie aufeinandertreffen in der mitte halten kannst( oder je nachdem wo die lane gerade steht).\nder vorteil die lane zu freezen liegt darin, das ihr näher am tower farmt und so sicherer vor ganks und engages der gegner seid.\ndiese taktik ist zb ganz angebracht, wenn :\n\n-du und dein lanegegner gleich auf seid (um zu verhindern das du gegankt wirst oder misplayst und dann die lane weggibst)\n-dein lanegegner vorne ist(damit du besser ins spiel zurück kannst)\n-du vorne bist und dein gegenüber zonen möchtest(zb du bist 3 0 und kannst nun die lane \"einfrieren\" und dein gegner kann nicht farmen->vorteil ausbauen)\n\nDie lane pushen bedeutet:\ndie minions so hart wie es geht verprügeln, damit die lane an den gegner tower kommt, und ihr druck aufbaut\n\nslowpushen bedeutet:\ndu tötest von einer wave nur sagen wir mal die caster minions, lässt die anderen stehen.\nmit der zeit baut sich somit einer riesige wave auf und der push ist im allgemeinen schwerer zu entdecken, da es ja \"nur\" mnion sind\n\nlies dir doch mal ein paar lane strategien durch und wie sich waves verhalten wenn du was machst.in nem bt game kann man das gut testen","replies":[]},{"poster":"Celesil","date":"2015-08-14T10:48:40.482+0000","up_votes":1,"down_votes":0,"body":"Vielen dank für die schnelle und auch gute Antwort.\n\nEs sei gesagt, das ich nur normale Spiele spiele. Für die gewerteten fehlen mir noch Helden, wie auch ein Haufen Wissen/ Können.\n\n> Als Support solltest du falls möglich (also so lange dein Team dich nicht unbedingt braucht um reinzurennen) bei deinem ADC bleiben und diesen mit deinen Spells und mit Exaust beschützen.\n\nWenn ich Leona spiele, habe ich zumindest das Gefühl das ich den Kampf beginnen muss, weils sonst keiner macht. Ich mein, es geht ja nicht darum so viele Todesstöße wie es nur geht zu bekommen, dennoch lässt sich ein Kampf ja nicht dauerhaft vermeiden. Ich denke, da muss ich einfach noch mehr üben :)\n\n> Sicht ist verdammt wertvoll\n> [...]brauchst du zusätzlich noch ein paar pink Wards\n\nGenau aus dem Grunde kaufe ich, momentan eher selten, die grünen Augen und ein pinkes habe ich fast durchweg dabei. Zumindest versuche ich meistens ein pinkes Auge dabei zu haben, um es besser zu sagen. Denke das dürfte auch recht gut funktionieren mit der Sicht, die ich meinem Team bescheere. \nDa habe ich eher das Gefühl, das ich meistens allein nur Augen aufstelle. In der Statistik nach dem Spiel, sehe ich dann das es nur ein Gefühl war; weil auch andere Teammitglieder paar Augen stellten.\n\n> Mit dem Freezen einer Lane ist gemeint durch gezieltes, dosiertes Angreifen der Minions dafür zu sorgen, dass die Lane [...] immer an der gleichen Stelle bleibt.\n\nSehr, sehr vielen dank für die Aufklärung. Auf so einen simplen Gedanken wäre ich nun wahrlich nicht gekommen.\n\nNochmal, danke sehr. Ich denke damit kann ich ein wenig besser abschätzen, mit ein wenig Übung selbstverständlich, wie ich Techniken/ Mechaniken verbessern kann.","replies":[]}]}