{"poster":"CrYpToNi3R","date":"2015-07-23T21:50:32.259+0000","title":"Enemy Team use dedos","subforum":"Ligen & gewertete Spiele","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/2215890848/39742053?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":2,"body":"Das gegnerische Team hat uns gededost und somit haben sie das Spiel beenden k&ouml;nnen ohne das wir etwas daran verhindern konnten.\r\nDa es ein Ranked Game war w&uuml;rde ich gerne haben das es nicht gewertet wird oder als draw ge&auml;ndert wird.\r\nAls wir grade dabei waren den letzten Teamfight einzuleiten flog einer nach dem anderem aus dem Game und konnte nicht neu connecten erst als sie unsere Base schon zerst&ouml;rt haben.\r\n\r\nIch danke schonmal im Voraus mfg. CrYpToNi3R","replies":[{"poster":"Kaitri","date":"2015-07-24T08:04:04.568+0000","up_votes":1,"down_votes":0,"body":"ich dachte immer immer drophacks (wo beide seiten rausfliegen) werden nicht gewertet.\nund ddos ist schon sehr unwahrscheinlich. skypst du mit deinen gegnern? :D","replies":[]},{"poster":"Zero000","date":"2015-07-23T22:00:40.481+0000","up_votes":1,"down_votes":0,"body":"Woher weist du das es deine Gegner waren?\nAuch gibt es zwei Möglichkeiten \nentweder haben sie die Server von Riot angegriffen, dann wären sie von den Problemen aber auch betroffen,\ndie andere Möglichkeit wäre das sie euch direkt angreifen, dafür müssten sie aber eure IP wissen.\nWenn ihr also nicht gerade mit denen im Teamspeak wart, dann fällt dies flach.","replies":[]},{"poster":"Dymania","date":"2015-07-23T21:57:12.582+0000","up_votes":1,"down_votes":0,"body":"Aus Manipulativen Gründen können dir keine Punkte gutgeschrieben werden oder rankedspiele gelöscht werden, egal was passiert, du musst damit leben. Siehs halt von der positiven Seite, wenn einer der Gegner etwas illegales oder verwerfliches macht, wird er gebannt. Ergo wirst du nicht mehr mit solchen Leuten auf Dauer gematcht.","replies":[]},{"poster":"CrYpToNi3R","date":"2015-07-23T22:55:03.565+0000","up_votes":0,"down_votes":0,"body":"Also man kann einen auch rauskicken über das game.\nWir hatten nur noch deren nexus open und einen tower und bei uns war noch fast alles up ausser die T1 Reihe. :/","replies":[]}]}