{"poster":"Gazalives00","date":"2015-07-19T03:58:17.039+0000","title":"Can I legally sell this online???","subforum":"Community Creations","embed":{"description":null,"url":"https://www.google.ca/search?q=league+of+legends+splash+art&espv=2&biw=1920&bih=979&source=lnms&tbm=isch&sa=X&ved=0CAYQ_AUoAWoVChMIjvmHnqbmxgIVk_aACh23HwC0#tbm=isch&q=league+of+legends+splash+art+shirts&imgrc=-bjB9L1G7DtoMM%3A","image":"https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQG3ufSHiwZ-wW4buN8v_IuqoOLuTlxoO5vwtv4iG35Z6BvLRHmJIl6XUo0"},"up_votes":2,"down_votes":0,"body":"As I mentioned in the title is it possible for me to make my own splash art (e.g. a shadowy nocturne image on a shirt and sell it? WITHOUT USING THE &quot;League of Legends&quot; title ANYWHERE. Simply just a drawing). Can I legally sell this online, and to friends???\r\n\r\n\r\nIf there are any requirements OR payments necessary please mention below in the comment section.\r\n\r\nRIOT Member answer please! Thank you very much!!!\r\n\r\n\r\n\r\nTHE LINK GIVEN ISN&#039;T MINE! Just an example that I found online.","replies":[{"poster":"Bioluminescence","date":"2015-07-19T04:29:30.294+0000","up_votes":3,"down_votes":0,"body":"This page is a good starting point for these sorts of questions - http://www.riotgames.com/legal-jibber-jabber\n\nI'm not any more knowledgeable on the matter than that web page is, so if you have questions that the page doesn't answer, you should send an email to info@riotgames.com.  They can sort you out :)","replies":[]},{"poster":"L0G1C B1T","date":"2015-07-19T05:01:31.169+0000","up_votes":1,"down_votes":0,"body":"Generally things like this are very much a grey area.  Riot employees have to be very careful what they say is allowed because otherwise it can come back and bite them in some future unrelated legal case.  There is a whole 'grey-market' with selling fan made tshirts, or fan made art for any IP of any company.  Some of it can probably be covered under \"Fair Use\" (for example, a parody of any Intellectual Property is completely fine with or without the consent of the owner - this is how Weird Al can use the same music, or how The Daily show can use copyrighted clips) but how far this protects is a very blurry line.  Whole sites out there exist just to sell fan made tshirts of all kinds of IP - especially combinations of IP (my sister has a Grinch - Dr. Who mashup shirt) that I am sure the owners of that IP would never willingly allow, but due so largely under a claim of \"Fair Use\" that gives them a certain immunity.\n\nAlso there are some weirdness in some IP laws.  For example in trademark law, companies are forced to be super protective.  Say some random small-time Joe sells some tshirts with Coca-cola trademarks on it and doesn't stop when asked by Coca-cola.  Coca-cola is almost forced to sue even if he is doing the company little harm.  It isn't because they are being mean, but because if they don't that in and of itself can be used in any later court case as a reason that 'they don't care about their trademark' and can actually result in them loosing the trademark altogether.\n\nNote that Trademark law, Copyright law, and Patent law are all COMPLETELY different... and very complicated.\n\nIn short... it is called a 'legal grey area' for a reason.  No one really knows until a specific case is decided in court.  All we can do is guess lol.  I would recommend caution.\n\n~David","replies":[]},{"poster":"Trídent","date":"2015-07-19T04:04:44.381+0000","up_votes":1,"down_votes":0,"body":"Probably not, but then things like this exist:\n\nhttp://mage.gtarcade.com/ (League Ripoff)","replies":[]},{"poster":"DarkPhoenix2420","date":"2015-07-19T04:04:03.405+0000","up_votes":1,"down_votes":0,"body":"I don't see why not. I mean artists sell their splash art all the time. They usually have their own online website and sell different artwork. There is no \"league of legend\" title or anything to refer it to Riot. As long it is your work, there shouldn't be any problem. However, if you are planning to sell in Riot's little merchandise shop. I think the rules are stricter and that you have to consult with Riot","replies":[]}]}