{"poster":"The Great Duck","date":"2018-03-12T06:03:26.351+0000","title":"High \"Risk\" and High Reward ....","subforum":"Gameplay","up_votes":3,"down_votes":13,"body":"{{champion:143}} Good joke.\r\n\r\n- Efficient mana costs for high damage\r\n- moderately low cooldowns\r\n- easy-to-land cc\r\n- very safe cast range\r\n\r\nNerfs would be great.","replies":[{"poster":"MagicFlyingLlama","date":"2018-03-12T06:14:13.986+0000","up_votes":2,"down_votes":2,"body":"* No mobility\n\n* No defenses at all if you bypass short duration CC\n\n* Utterly useless until lategame vs fast-attacking ranged champs\n\n* Sub-50% winrate","replies":[{"poster":"The Great Duck","date":"2018-03-12T19:40:39.512+0000","up_votes":1,"down_votes":0,"body":"You just described almost every mage. The issue is this stupid bitch is viable in almost any comp and any duo in the bot lane. She's uber flexible in that she can play passive/aggressive. However, most midlane mages wouldn't scale without gold if they went bot; Zyra has no issues with that, for a single combo with like 10 AP on her is easily almost half your health.","replies":[{"poster":"MagicFlyingLlama","date":"2018-03-12T21:38:47.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=00Nightwing,realm=NA,application-id=3ErqAdtq,discussion-id=AVJLidxu,comment-id=00000001,timestamp=2018-03-12T19:40:39.512+0000)\n>\n> You just described almost every mage. The issue is this stupid bitch is viable in almost any comp and any duo in the bot lane. She&#x27;s uber flexible in that she can play passive/aggressive. However, most midlane mages wouldn&#x27;t scale without gold if they went bot; Zyra has no issues with that, for a single combo with like 10 AP on her is easily almost half your health.\n\n49% winrate.\n\nAnnoying does not equal OP, although it does typically warrant some adjustments.","replies":[{"poster":"The Great Duck","date":"2018-03-14T18:09:26.065+0000","up_votes":2,"down_votes":0,"body":"That's one of my points. She has no real risk given how safe her cast range is and unless she literally spams her spells, she doesn't have any mana issues. Fine if she does a lot of damage, but at least they had heavy costs back when I started in season 3. Now I tell any newcomer who has to play support to start with a mage because it's so brain-dead easy to carry it for the first few elos.","replies":[]}]}]},{"poster":"Onotori","date":"2018-03-12T06:18:48.068+0000","up_votes":2,"down_votes":3,"body":"3/4 of those sound a lot like Zoe. But we gutted her, while she isn't broken at all. Zyra, on the other hand...","replies":[{"poster":"ViciousSummoner","date":"2018-03-12T11:43:08.944+0000","up_votes":2,"down_votes":0,"body":"The change to Zoe's proc was really all that was needed though. Cause damn when she pops up and Q's you and you enter gray screen simulator for the next 10,000 years that shit don't feel fun.","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-03-12T21:40:25.451+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Konotori,realm=NA,application-id=3ErqAdtq,discussion-id=AVJLidxu,comment-id=00000000,timestamp=2018-03-12T06:18:48.068+0000)\n>\n> 3/4 of those sound a lot like Zoe. But we gutted her, while she isn&#x27;t broken at all. Zyra, on the other hand...\n\nI dont know, a 54% +/- 1% winrate seems pretty broken to me.. actually _massively_ broken","replies":[]}]}]},{"poster":"Cloud273","date":"2018-03-12T08:35:25.864+0000","up_votes":3,"down_votes":1,"body":"The reason Riot doesn't buff mid Zyra is because it would also indirectly buff support Zyra, which Riot doesn't want. Mages are only allowed to be strong if they aren't oppressive in bot lane. When they start to outclass supports that's when Riot starts to nerf them.","replies":[]},{"poster":"Poop Jelly","date":"2018-03-12T19:53:17.417+0000","up_votes":2,"down_votes":1,"body":"But how? Personally I think Zyra currently is below average at mid and meh at bot. She's good as support if facing someone who doesn't do well under poking pressure, but I'm sure she's not even the best poke supports at bot lane.","replies":[]},{"poster":"Bazooka Blade","date":"2018-03-13T00:11:47.719+0000","up_votes":1,"down_votes":0,"body":"play {{champion:68}} and be grateful you have {{champion:143}}","replies":[]},{"poster":"Ren Amari","date":"2018-03-12T21:59:51.556+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"CarryAlex","date":"2018-03-12T23:47:30.528+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ren Amari,realm=NA,application-id=K6EGEal2,discussion-id=J1wTLg1s,comment-id=0001,timestamp=2018-03-09T18:32:36.495+0000)\n>\n> Call him out on why i believe that skarner isn&#x27;t as good as people think, and he says &quot;your current elo&quot; Then unfriends me. Yes, a hard stuck plat player, will tell me what is good. I don&#x27;t care what elo you are, if you are below diamond 2, you are fucking garbage. This is the truth, don&#x27;t come raging at me because you have a 47% winrate.\n\nFyi I deleted you because I said Plat+ for 3v3, you are not Plat this season or last. Also big talk from someone whose never hit diamond even once lol. You can also say \"hard stuck plat player\" all you want I went from bronze to diamond last season in 3 months lol. What a joker.","replies":[]}]},{"poster":"5050BS","date":"2018-03-12T07:55:56.681+0000","up_votes":1,"down_votes":3,"body":"If you cant win vs Zyra then you are in bronze and that right there explains it.\n\nZyra is in need to help from Riot.  Glad they are maybe looking at helping her.","replies":[{"poster":"The Great Duck","date":"2018-03-12T19:36:57.265+0000","up_votes":1,"down_votes":1,"body":"Coming from someone stuck in silver http://na.op.gg/summoner/userName=XXXMurderPenguin LOL","replies":[{"poster":"5050BS","date":"2018-03-12T21:59:05.955+0000","up_votes":1,"down_votes":2,"body":"And yet my statement is not wrong.\n\nAlso you are unranked and started in S5 lol","replies":[{"poster":"The Great Duck","date":"2018-03-14T18:04:37.790+0000","up_votes":1,"down_votes":1,"body":"Not my main account. But that ought to speak for itself. Your averages are trash; mine are not. You're stuck in a bracket I could boost you out of in like 8-10 games. You're in no position to insult anybody's skill.","replies":[]}]}]}]}]}