{"poster":"ZxHazard7","date":"2016-01-10T18:59:33.172+0000","title":"Jungler","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Tra Hecarim e Vi chi Jungla meglio in generale?","replies":[{"poster":"Tankerous","date":"2016-01-11T12:31:42.933+0000","up_votes":2,"down_votes":0,"body":"Vi picka meglio bersagli prioritari, Hecarim ha un migliore 5v5. Entrambi ottimi, ma non \"top\" tier. Qualsiasi raccomandazione sarebbe soggettiva. Ti consiglio di provarli entrambi.","replies":[{"poster":"Foschìa","date":"2016-01-11T15:24:32.036+0000","up_votes":1,"down_votes":0,"body":"Questo commento è una gioia per gli occhi: breve, semplice, conciso, chiaro, pertinente!","replies":[]}]},{"poster":"firevictori","date":"2016-01-11T21:56:57.169+0000","up_votes":1,"down_votes":0,"body":"Vi tutta la vità\nha molta più mobility fuori dai combattimenti\nha generalmente moltà più utility nei fight perchè con la ulti prende adc nemico e lo riempie di cazzoti\n\novviamente questo è un mio parere personale ( considera che io heca non lo so usare perchè finisco sempre a fare il kamikaze)","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2016-01-11T12:20:22.707+0000","up_votes":1,"down_votes":0,"body":"Sono entrambi ottimi e devastanti se usati bene. Io preferisco Vi ma sono gusti","replies":[]},{"poster":"kernel panic","date":"2016-01-11T10:08:54.200+0000","up_votes":1,"down_votes":0,"body":"Hecarim se riesci a snowballare all'inizio è ottimo. Ma se resti indietro è davvero difficile rientrare in game.\n\nI danni di Vi invece son costanti per tutto il game, in più la sua ulti è ottimo per annullare uno dei 2 carry.","replies":[]},{"poster":"ShowterX","date":"2016-01-10T19:21:43.290+0000","up_votes":1,"down_votes":0,"body":"io preferisco hecarim ma anche vi è altrettanto forte.. hecarim ganka meglio nel senso che è più veloce a spostarsi da una lane all' altra... vi ha un engage mostruoso come hecarim quindi... prendili tutti e due :d i danni li hanno tutti( sia in giungla che contro i champ) e due reggono moltissimo entrambi.. in tf forse è più utile la ulti di hecarim che stunna tutti ma se usata bene anche quella di vi fa zompare tutti in aria perciò bho vedi tu.. quello che ti piace di più...hecarim se lo vuoi compra pure la skin nuova.. è troppo bella *.* e vi uguale demone è epico xD","replies":[{"poster":"ZxHazard7","date":"2016-01-10T19:24:43.162+0000","up_votes":1,"down_votes":0,"body":"Beh in effetti sono piu portato per Heca (anche perchè ora ho 4800 ip lol)","replies":[]}]}]}