{"poster":"LlL UZl VERT","date":"2015-03-15T21:39:42.804+0000","title":"Bester Jungler für Low Elo?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich spiel eigentlich nie Jungle, aber wenn ich muss dann J4. Ich find ihn aber nicht so stark im neuen Jungle. Könnt ihr mir welche empfehlen die sehr gut in der Low Elo sind? (Silber 2) Wäre Kha'zix ein guter Jungler?","replies":[{"poster":"MYM Kreigon","date":"2015-03-17T00:05:02.604+0000","up_votes":1,"down_votes":0,"body":"{{champion:254}} {{champion:59}} {{champion:421}}","replies":[]},{"poster":"Iron IV dude","date":"2015-03-16T15:56:28.279+0000","up_votes":1,"down_votes":0,"body":"Shaco, Jarvan, Vi, Rengar und derzeit NIDALEE...","replies":[]},{"poster":"Clown in a Box","date":"2015-03-16T13:24:15.687+0000","up_votes":1,"down_votes":0,"body":"Schau dir paar Shaco Guides an, train ihn bissl und carry dich nach oben :)","replies":[]},{"poster":"IKartoffelI","date":"2015-03-16T09:20:44.797+0000","up_votes":1,"down_votes":0,"body":"Pantheon funktioniert auch wunderbar. Dank seiner passive bekommt er wenig Schaden und sein Stun ist prima zum ganken. Ab lvl 6 kannst du jeder Kane schnell per Ult helfen und sein Speer verhindert, dass Gegner abhaun (100% Crit wenn das Ziel unter 15% hp ist). Im teamfight Stunts du einfach den stärksten gegnerischen Champ und fertig :)","replies":[]},{"poster":"Nuckmuck","date":"2015-03-16T05:59:52.782+0000","up_votes":1,"down_votes":0,"body":"Vergiss WW. Der Champ hat Substain ja aber bis Stufe 6 hast du kaum möglichkeiten zu Ganken. Wen eine lane hilfe braucht kann das schonmal zum gedultsspiel werden.\n\nDann lieber Trundle, Xin Zhao wen du probleme gegen die Mobs hast. Vi ist extrem gut. Aber mein Geheimtipp ist Sejuani. Sie ist Tanky macht AP dmg (die meisten haben nur Rüstung in den Runen oder MR per level) und ihre Ulti kann ganze Fights entscheiden. \n\nIm allgemeinen lässt sich aber sagen Spiel lieber einen Tankigen Jungler da diese durch den letzten Patch (Jungleitem das Leben gibt) gebufft wurden. Champs wie Amumu klappen auch wunderbar.","replies":[]},{"poster":"Selphid","date":"2015-03-16T01:37:04.155+0000","up_votes":1,"down_votes":0,"body":"Nimm einen mit Sustain, dann hast du schonmal ein Hauptproblem nicht, das man sonst bedenken muss.\nWarwick ist wie gesagt für Leute gut, die nicht viel Erfahrung mit dem Jungle haben, aber auch Trundle und Xin Zhao schneiden meinem Empfinden nach sehr gut mit Jungle-Anfängern ab.","replies":[]},{"poster":"Phaniel","date":"2015-03-16T00:19:31.035+0000","up_votes":1,"down_votes":0,"body":"Also ich persönlich würde dir Warwick empfehlen. Mit ihm hat es bei mir damals auch angefangen. Die ganks sind einfach, im jungle hast du keine probleme mit dem Leben und er ist recht usefull im lategame.","replies":[]},{"poster":"HyperionCH","date":"2015-03-15T22:14:43.579+0000","up_votes":1,"down_votes":0,"body":"Spielbar sind wirklich viele.\n\nAuch Kha ist natürlich spielbar, jedoch ist oft das Problem, dass man entweder viel DMG machen kann, aber dann zerplatzt wird, wenn man reinspringt, oder man ist eher tanky, kann aber entsprechend wenig ausrichten. Da ist die Frage, wie dein Team sich zusammenstellt (mit Ori finde ich Kha nice -> springt mit dem Ori-Shield rein und Ori ultet dann).\n\nVi ist deshalb nice. Die Mechanics sind nicht allzu schwer und selbst recht tanky macht sie viel Schaden. Man ist auch flexibel, je nachdem ob ihr bereits tanky Champs habt oder nicht, kann man mehr auf DMG oder mehr auf Tank gehen.\n\nSelber spiele ich auch gerne Rammus, wenn die Gegner gerade sehr viele AD-Champs picken. Im Late Game ist er einfach unzerstörbar. :D","replies":[]},{"poster":"Reomatz","date":"2015-03-15T22:03:57.109+0000","up_votes":1,"down_votes":0,"body":"Vi findet ich in der niedrigen Elo extrem stark, aber playable sind einige.","replies":[]},{"poster":"Fennylicious","date":"2015-03-15T21:59:43.681+0000","up_votes":1,"down_votes":0,"body":"J4, ganz klar, der Kerl kann Spiele gewinnen","replies":[]},{"poster":"PlanetenPlatzer","date":"2015-03-15T21:53:08.344+0000","up_votes":1,"down_votes":0,"body":"Ich finde Jarvan IV besser als Kha' Zix. Und schwach? - Nein. \n\nAber egal wo (und das bedeutet Low Elo gehört da dazu), du kannst immer alles spielen. Egal wo - Egal wie.","replies":[]}]}