{"poster":"ZNKT","date":"2017-01-28T22:54:41.105+0000","title":"Suche einen \"Art Mentor\"!","subforum":"Community-Kunstwerke","up_votes":2,"down_votes":0,"body":"Mein Name ist ZNKT und ich fange gerade mit digital Art an. Vor einem Monat habe ich mir ein drawing Tablet gekauft, und seitdem ich es besitze, sitze ich mehr als 4 Stunden t&auml;glich an Photoshop und &uuml;be das Zeichnen. Weil ich League of Legends und Digital Art so sehr mag, ist mein Ziel mal so herausragende Splasharts wie hier in LoL zu erstellen. Das Problem das ich bisher habe ist nur, dass ich keinen &quot;Mentor&quot; bzw Lehrer habe, der mir zeigt was ich richtig oder falsch mache und wie ich mich verbessern kann. Ich habe schon aktiv nach Leuten gesucht die Erfahrung haben und mir helfen k&ouml;nnten, doch noch niemanden gefunden. Deshalb bin ich jetzt hier im Forum und suche jemanden, der Erfahrung im digital Art Sektor hat und auch gut daran ist, sowie sich bereit erkl&auml;ren w&uuml;rde, mir zu helfen besser zu werden, vielleicht auch ab und zu meine Bilder bewerten kann oder mich etwas &quot;coacht&quot;. Wenn du so eine Person bist, dann z&ouml;gere nicht und antworte gleich auf diesen Post! Ich w&uuml;rde mich um jede Art von Hilfe freuen! \r\nHier noch ein paar Bilder von mir:\r\n\r\nStill life 2: http://m.imgur.com/a/oXbs0\r\nStill life 1: http://imgur.com/8QFrU1z\r\nArmor studies: http://imgur.com/BOI6o5w http://imgur.com/6OuvM2Q\r\nFanart Splashart: http://imgur.com/P2Bl2wJ\r\n\r\nDemn&auml;chst fange ich mit League of Legends Fanart an, also werft mal ein Auge ins &quot;Art&quot; subforum!","replies":[{"poster":"AI Yjuq","date":"2017-01-29T03:29:57.458+0000","up_votes":1,"down_votes":0,"body":"Wenn du jemanden für Theorie suchst kann ich dir helfen. Aber selbst aktiv zeichnen tue ich nicht, also schon. Aber die Bilder die ich so zeichne / male / erstelle sehen meist für den Müll aus, da ich keine ruhige Hand habe für mein Grafiktablett. Gerade Striche sind ohne technische Tools nicht möglich bei meinen Händen. Aber wenn du von der Theorie viel wissen willst, da bin ich für zu haben. In den letzten Jahren hab ich viel gelernt und hab mir einiges angeeignet.","replies":[{"poster":"ZNKT","date":"2017-01-29T07:14:24.868+0000","up_votes":1,"down_votes":0,"body":"Das ist zwar unvorteilhaft, aber ich fände es super wenn du mir helfen könntest! Ich fange heute mit einer LoL - Fanart an, also ich würde dir die nächsten Tage schreiben, wenn sich Probleme auftun / ich wieder mal nicht weiß wie ichs besser machen soll, ok?","replies":[{"poster":"AI Yjuq","date":"2017-01-29T17:03:03.089+0000","up_votes":1,"down_votes":0,"body":"Du kannst mich unter Discord erreichen: Cythor#7083\nAlternativ über das Forum hier, obwohl ich hier eher unregelmäßig hinein schaue.","replies":[{"poster":"ZNKT","date":"2017-02-05T17:23:49.394+0000","up_votes":1,"down_votes":0,"body":"Habe dir soeben auf Discord geschrieben, bzw eine Anfrage geschickt! Ich bräuchte etwas Hilfe wegen dem Bild!","replies":[]}]}]}]}]}