{"poster":"Keock","date":"2015-08-18T16:35:53.136+0000","title":"Silber+ sucht Rankedteam","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo Commuity,\r\n\r\nIch bin auf der Suche nach einem Rankedteam 5 vs 5. Ich bin einfach kein Solospieler und die SoloQ geht mir schlichtweg auf die Nerven. Mit Premades 5 vs 5 ist eher mein Ding und deshalb bin ich auf der Suche nach einem Team.\r\n\r\nZu mir: \r\n\r\nIch bin 20 Jahre alt und wohne in NRW. Ich spiele LoL schon lange und das meistens mit Freunden zusammen. Ich denke so viel gibt es &uuml;ber mich nicht zu erz&auml;hlen :D Ihr k&ouml;nnt mich bei Interesse fragen was Ihr wissen wollt.\r\n\r\nWelche Rolle ich bei euch bekleiden soll ist mir erstmal egal, ich w&uuml;rde mir die entsprechenede Rolle dann als main aneigenen..generell ist es so dass ich keine Rolle wirklich nicht kann, also bin ich da felxibel. Ich besitze Skype sowie Ts.\r\n\r\nWas ich von euch erwarte:\r\n\r\nWichtig ist mir dass Ihr eurer Team gewissenhaft spielt, d,h, wir spielen mehr als nur 2-3 Spiele zusammen...ich sage das deshalb, weil es bei mir schon h&auml;ufig an diesem Punkt gescheitert ist und das ist nicht Sinn der Sache. Dazu geh&ouml;rt nat&uuml;rlich auch regelm&auml;&szlig;iges spielen mit dem Team und stetiges verbessern sowie Taktiken entwickeln und Spiele auswerten. Au&szlig;erdem w&auml;re es nicht schlecht wenn Ihr mindestes 18 Jahre alt seid. (von mir aus gerne Ausnahmen)\r\n\r\n\r\nVielleicht hat ja das ein oder andere Team Interesse ;) \r\nadded mich gerne ingame: Keock     \r\n    oder &uuml;ber Skype: evkev3 (bitte schreibt da dann rein worum es geht)\r\n\r\nViel Spa&szlig; in der Kluft\r\nKeock","replies":[{"poster":"brain2203","date":"2015-08-19T08:56:10.477+0000","up_votes":1,"down_votes":0,"body":"ich w체rde auch suchen bin in team main support aber spiel auch eine gute mitte und jungel \nschwanke zwischen silber bronze da solo q auch nichts f체r mich ist ts ist vorhanden","replies":[]},{"poster":"Keock","date":"2015-08-18T17:49:08.925+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]},{"poster":"RisingMoon","date":"2015-08-18T17:25:12.192+0000","up_votes":1,"down_votes":0,"body":"Main role w채re durchaus hilfreich :). Wollen was festes aufbauen, vllt melde ich mich mal, ob Interesse h채ttest","replies":[]}]}