{"poster":"Malpheon","date":"2016-02-24T16:11:08.798+0000","title":"Ich suche einen \"Trainer\"","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Der Titel sagt ja schon einiges aus. Ich bin momentan Silber 1 und Main Top / Mid ich gewinne h&auml;ufig meine Lane aber nie wirklich hoch vllt 2-3/0 und einem Farmlead von 20 cs leider f&auml;llt es mir schwer das Game zu carrien und ich verliere st&auml;ndig weil es immer so stark schwankt im Mid/Late und ich oft in tf nicht wei&szlig; was ich tun soll um zu gewinnen. Ich m&ouml;chte mich aber sehr gerne verbessern ich schaue mir schon die ganzen Video an die es so auf Youtube gibt und ich verinnerliche mir immer alles aber trotzdem schaffe ich es nicht zu gewinnen. Ich w&uuml;rde mich also freue wenn irgendein Diamant Spieler der eine meiner beiden Lanes mained mit mir vllt. ab und zu ne Runde spielt und mir sagt was ich denn so besser machen k&ouml;nnte. Vllt. findet sich ja irgendein netter Dia spieler der Zeit und Lust hat einem noob wie mir zu helfen :D Ich bin sehr lernwillig! :) \r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nAu&szlig;erderm suche ich noch ein DuoQ Mate bevorzugt Main adc","replies":[{"poster":"No Counterplay","date":"2016-02-24T18:12:32.044+0000","up_votes":1,"down_votes":0,"body":"Jo. Was du suchst, nur um den richtigen Vokabel zu verwenden, ist ein Coach. Zumindest würdest du mit diesem Begriff auf jeden Fall mehr finden, wenn du z.B auch auf Google eine Suche starten würdest. Es gibt verschiedene Seiten die solche Coaching Dienste anbieten, vom Dia 1 20 euro/h Coach bis zum gratis Coach, welches vielleicht noch nicht soviele Erfahrungen hat und demensprechend noch gratis ist. Auf jeden Fall ist egal wie neu ein Coach ist er wird meistens trotzdem erfahrener sein als irgendwelche (entschuldigung nicht abwertend gemeint) dahergelaufenen Diamant Spieler aus dem Forum. Vor allem du kannst dich bei diesen auch darauf verlasses, dass diese auch pünktlich kommen und sich auch bemühen weil vor allem bei neuen und unerfahreren Coaches können negative Reviews sehr unangenehm für eben diese werden.  Eine Beispiel Seite wäre z.B http://lolcoaching.com/ . Auf der findest du kostenplichtige, aber auch gratis Coaches in allen Elo Bereichen.\nIch hoffe ich konnte dir helfen.\nMfg No Counterplay","replies":[]},{"poster":"Julian Chopper","date":"2016-02-24T16:20:20.444+0000","up_votes":1,"down_votes":0,"body":"1. pinks kaufen\n2. mehr wards platzieren (kannst dir als midlander das blaue trinket kaufen)\n3. falls du tank jungler spielst, dann würde ich das item upgrade kaufen, das es dir erlaubt wards zu platzieren","replies":[]}]}