{"poster":"Arknoid Smurf","date":"2017-05-21T13:16:30.267+0000","title":"La logica illogica della Riot","subforum":"Aiuto e supporto","up_votes":2,"down_votes":17,"body":"Allora, premesso che gioco da 5 anni a LoL e che in 5 anni mi hanno bannato 12 account circa. Quindi parliamo di una media di 2,4 account bannati ad anno. Questo &egrave; ovviamente uno dei nuovi creati tanto per continuare a &quot;supportare&quot; la Riot e vedere cose divertenti.\r\nAllora iniziamo con la logica della Riot quando il tuo account viene bannato in modo permanente per flame o altri comportamenti ritenuti negativi per la comunit&agrave;.\r\n\r\n1)La prima spiegazione, che danno gli operatori che lavorano per il servizio di support  della Riot, alla sospensione permanente di un account &egrave; questa &lt;&lt;rimuoviamo in modo permanente i giocatori che continuano a creare esperienze negative nel gioco.&gt;&gt;. E ovviamente spesso sono accompagnate da altre frasi come &lt;&lt; la sospensione permanente comporta la fine dell&rsquo;account, siamo certi che  potrai evitare questo tipo di situazione in qualsiasi altro nuovo titolo deciderai di giocare.&gt;&gt;.\r\nAllora, in primis, sono affermazioni non veritiere e quanto meno antitetiche; infatti se il tuo obiettivo &egrave; rimuovere in modo permanente I GIOCATORI che continuano a creare esperienze negative nel gioco, dovresti bannare permanentemente il giocatore e non semplicemente un account. Questo &egrave; impossibile visto che la Riot ti d&agrave; la possibilit&agrave; di creare account in continuazione (prova vivente ne sono io, come centinai di migliaia di altri giocatori). Quindi alla fine non viene eliminato il problema e il fame, come le esperienze negative per la comunit&agrave; continuano, semplicemente se uno &egrave; intelligente non  spende pi&ugrave; soldi sull&#039;account sapendo che prima o poi si verr&agrave; bannati di nuovo perch&eacute; quello che la riot non capisce &egrave; che spesso il flame nasce da reazioni ad azioni (trollers o afk intenzionali) e che quel giocatore &egrave; un essere umano di natura/carattere impulsivo. Pensare di cambiare la natura di una persona &egrave; assurdo! Ma la cosa antitetica per eccellenza &egrave; dire che ti bannano per sempre l&#039;account perch&eacute; vogliono rimuovere il giocatore che ha creato situazioni negative per il resto della comunit&agrave; e per&ograve; ti invitano a RIGIOCARE evitando di ripetere quelle situazioni (non lo so questa frase mi fa venire in mente Crozza quando diceva: drogatevi in modo responsabile!?! eheh). Ma allora scusa a questo punto mi viene il sospetto che lo scopo della Riot non sia rimuovere i giocatori negativi ma solo che il giocatore &quot;negativo&quot; spenda altri soldi in RP per recuperare pi&ugrave; velocemente IP con boost, o ricomprare skins o altro. Insomma &egrave; utile a livello economico bannare cos&igrave; riparti da capo e spendi (in teoria o se hai poca pazienza, e visto che sei impulsivo tutto combacia!). Tuttavia sembrano ignorare il fatto che molti  piuttosto che spendere di nuovo o dare soldi alla riot dopo un ban permanente preferisce comprare un account nuovo dai diversi siti on line che li vendono come se fosse tutto regolare quando sarebbe una delle violazioni pi&ugrave; grandi del contratto con la riot! \r\n\r\n2)A volte ti bannano un account al quale non giocavi da diverso tempo, magari chiedi di recuperare la psw perch&eacute; credi di averla dimenticata e scopri che invece l&#039;account &egrave; stato bannato e hanno cambiato la psw. Ti riconoscono come proprietario originario dell&#039;account ma non ti tolgono la sospensione permanente perch&eacute; per loro &egrave; colpa tua se non sei stato attento e ti hanno fregato la psw o &quot;hackerato&quot; l&#039;account. Quindi ovviamente ti invitano a riniziare tutto da capo e quindi riprende peso la tesi di prima secondo cui la Riot cerca sempre di spennare il pi&ugrave; possibile con ogni scusa i suoi clienti. Ma come mi dici che mi riconosci come vittima del furto di account, ma che sono problemi miei e quindi riparti dal Via stile monopoli e ricompra tutto?!\r\n\r\n3)la frase pi&ugrave; bella che si pu&ograve; trovare in molti articoli della Riot su certi comportamenti dei giocatori &egrave; questa &lt;&lt; Ho sempre pensato che la piet&agrave; porti frutti pi&ugrave; ricchi della mera giustizia. - Lux&gt;&gt;; poi per&ograve; loro di piet&agrave; non ne sanno niente, come di giustizia per altro, quindi addio account sia che tu sia colpevole che vittima (poi va a discrezione dei supporters in realt&agrave;, 1 volta su 4 si recupera e lo so per esperienza aiutando amici e con i miei stessi accounts, anche se ormai la tendenza negli ultimi tempi &egrave; di rigidit&agrave; totale).\r\n\r\nCosa consiglio di fare: \r\nA) creare iscrizione account di gioco solo inviando carta identit&agrave; o patente o altro documento riconosciuto assieme ad una altra foto del proprio volto con in mano il documento, in modo che i dati inseriti siano corrispondenti ai dati reali del giocatore. Cos&igrave; bannato l&#039;account il giocatore non potr&agrave; fare altri account nuovi almeno che non falsifichi carte identit&agrave; etc (che sono reati perseguibili in ogni Stato e dubito uno arrivi a tanto). Se proprio volete essere severi e GIUSTI, e RIMUOVERE PERMANENTEMENTE I GIOCATORI che hanno creato e portato situazioni negative allora dovreste fare cos&igrave;! Lo fanno per i siti di poker on line, o di registrazione per i servizi ai Comuni etc, in sintesi per ogni servizio SERIO dove un account corrisponde davvero solo a un utente ed egli ne &egrave; davvero responsabile perch&eacute; i dati corrispondono alla realt&agrave; e non a persone fittizie, che poi in realt&agrave; qui su LoL basta cambiare e-mail e nemmeno i dati personali del giocatore per creare un account nuovo.\r\n\r\nB)per chi feeda intenzionalmente non esiste punizione reale, almeno che non scriva in chat che lo sta facendo apposta la Riot presume sempre che sia stato un bad game o un serie negativa di partite. Quindi in questo caso nonostante le verifiche sul kda e altri algoritmi vari non c&#039;&egrave; una vera punizione. Io consiglio alla riot semplicemente di abbinare chi ha un pessimo kda con altri pari a loro in modo che tra troller feeders si divertano tutti insieme. Ovviamente non parlo di chi ha una partita negativa o un paio, ma quando si vede che una persona che prima vinceva 15 ranked su 20 si ritrova ad averne perse di fila 16 su 20 allora scatti l&#039;abbinamento. Soprattutto se il kda peggiora all&#039;improvviso drasticamente!\r\n\r\nC) per i flamer invece non capisco razionalmente il motivo del ban, e nemmeno della limitazione di chat. Dal momento che esiste la possibilit&agrave; di MUTARE i giocatori in game, ci vuole niente si mutano e fine del problema. In quale modo un flamer pu&ograve; costringere un altro giocatore a subire il suo flame se mutato?! Non parliamo di gente afk o feeder che purtroppo ti impongono la loro negativit&agrave; nel gioco senza che tu abbia uno strumento per rimuoverla. Per i flamers esiste l&#039;opzione MUTA, usata RIMUOVE totalmente il problema! Davvero razionalmente non capisco in che modo si debba punire qualcuno che &egrave; di fatto innocuo grazie agli strumenti di gioco. Ma ad ogni modo per ogni cosa direi che l&#039;opzione A) &egrave; la migliore se si vuole essere severi e giusti, e non usare ogni scusa per lucrarci sopra.\r\n\r\nBuona giornata a tutti","replies":[{"poster":"HaIIeIujah","date":"2017-05-21T13:18:14.180+0000","up_votes":11,"down_votes":1,"body":"TL;DR : Ho flammato come un cane, mi hanno permabannato ripetutamente, continuo perché non ho capacità di imparare o controllarmi e mi sono in qualche modo convinto di avere ragione. Molto interessante.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T13:42:32.858+0000","up_votes":2,"down_votes":8,"body":"Si vede che non hai letto tutto ;) Molto intelligente.\nSe vedi l'opzione A) io dico che il permaban deve essere fatto bene se lo si vuole usare per reali motivi di giustizia e non per lucro. \nSenza considerare il fatto che parlavo anche del recupero account per motivi diversi dal flame e infine della opzione C) da te totalmente ignorate. \nti chiedo di commentare con argomentazioni ai vari punti riportati e non con frasi standar che ormai sono un classico. Quelli che rispondono come te sono tipici e si incontrano sempre purtroppo ogni volta che si posta negli anni! Sei così prevedibile che mi annoia quasi risponderti","replies":[]}]},{"poster":"Master Caos98","date":"2017-05-21T14:05:41.999+0000","up_votes":3,"down_votes":4,"body":"Secondo il mio punto di vista mettere league of legends a pagamento risolverebbe moltissimi problemi alla riot,ovvero:\n1)Si eviterebbero gli smurf dato che dovrai nuovamente pagare\n2)Uno ci pensa due volte prima di farsi bannare l'account\n3)Essendoci meno account i server sono meno pieni e ridurrebbe i costi della manutenzione dei server.\n\nSecondo me si dovrebbero fare controlli più accurati per verificare se il report sia giusto o e tanto per dare fastidio,moltissime volte ho visto gente idiota che banna solo perchè perdi una lane o per aver fatto un errore.","replies":[{"poster":"HaIIeIujah","date":"2017-05-21T14:09:00.666+0000","up_votes":7,"down_votes":1,"body":"4) Dimezzerebbe la playerbase e con essa il loro reddito","replies":[{"poster":"Nabbomaster","date":"2017-05-21T15:32:54.328+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=00020000,timestamp=2017-05-21T14:09:00.666+0000)\n>\n> 4) Dimezzerebbe la playerbase e con essa il loro reddito\n\ndiciamo pure riderre a un decimo se non meno\noltre agli smurf ci sono quelli che giocano perche' gratis","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T16:31:42.165+0000","up_votes":1,"down_votes":2,"body":"ci sono quelli che trollano apposta perché non gli costa niente. Se vuoi ti faccio vedere con sto account che posso perdere 30 partite di fila feedando con 0/20 a partita e non venire punito in alcun modo, basta che non scrivo niente in chat :) Vuoi fare questo sperimento con me? l'essere gratis è un danno non un pregio secondo me da quel punto di vista, ti permette di fare account a palate e comportarti come vuoi senza conseguenze reali","replies":[]}]},{"poster":"Dantazzo","date":"2017-05-21T14:32:44.711+0000","up_votes":3,"down_votes":1,"body":"Solo dimezzerebbe?","replies":[{"poster":"HaIIeIujah","date":"2017-05-21T14:33:27.956+0000","up_votes":3,"down_votes":1,"body":"Avrei potuto dire \"inizierebbe a fare collassare il gioco\", ma sarebbe suonato esagerato.\n\nNon meno realistico, ma esagerato.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T16:32:42.071+0000","up_votes":1,"down_votes":3,"body":"dimezzerebbe la playerbase, composta al 35% da smurf o account secondari, pensa te. Mi sembra un ragionamento sensato, leggi gli altri commenti ;)","replies":[]}]}]},{"poster":"Master Caos98","date":"2017-05-21T14:13:34.759+0000","up_votes":2,"down_votes":3,"body":"Il 30% degli account sono tutti smurf,quindi ridurebbe di non poco i costi dei server,e inoltre si migliora la community.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T14:47:50.740+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Master Caos98,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=000200000000,timestamp=2017-05-21T14:13:34.759+0000)\n>\n> Il 30% degli account sono tutti smurf,quindi ridurebbe di non poco i costi dei server,e inoltre si migliora la community.\n\nsecondo me Master ha ragione, ma sbaglia gli account smurf o comprati sono anche superiore come numero un 35%","replies":[]}]}]},{"poster":"ZZALA","date":"2017-05-21T14:54:20.481+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Master Caos98,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=0002,timestamp=2017-05-21T14:05:41.999+0000)\n>\n> Secondo il mio punto di vista mettere league of legends a pagamento risolverebbe moltissimi problemi alla riot,ovvero:\n> 1)Si eviterebbero gli smurf dato che dovrai nuovamente pagare\n> 2)Uno ci pensa due volte prima di farsi bannare l&#x27;account\n> 3)Essendoci meno account i server sono meno pieni e ridurrebbe i costi della manutenzione dei server.\n> \n> Secondo me si dovrebbero fare controlli più accurati per verificare se il report sia giusto o e tanto per dare fastidio,moltissime volte ho visto gente idiota che banna solo perchè perdi una lane o per aver fatto un errore.\n\nConosco gente che ha 10 smurf su CSGO o OW . Gli smurf non sono il problema , sono gli smurf troll e flammer il problema .","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T16:30:07.728+0000","up_votes":1,"down_votes":3,"body":"si e sono tanti comunque anche quelli...tipo me!","replies":[]}]}]},{"poster":"lich Roland","date":"2017-05-21T13:58:05.736+0000","up_votes":5,"down_votes":1,"body":"E che cazzo se ti hanno bannato 12 volte sei proprio irrecuperabile","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T15:08:08.091+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=lich Roland,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=0001,timestamp=2017-05-21T13:58:05.736+0000)\n>\n> E che cazzo se ti hanno bannato 12 volte sei proprio irrecuperabile\n\ndecisamente SI! è questo il punto LICH ROLAND. Io sono irrecuperabile giusto? L'obiettivo della Riot è quello di RIMUOVERE PER SEMPRE i giocatori irrecuperabili BANNANDO PERMANETEMENTE IL LORO ACCOUNT. Allora è servito a qualcosa? Ho smesso di giocare?! Ho smesso di flammere? ho smesso di essere irrecuperabile? NO! allora perché non fare come nel punto A) o C)?!","replies":[{"poster":"lich Roland","date":"2017-05-21T17:09:45.184+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Arknoid Smurf,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=00010001,timestamp=2017-05-21T15:08:08.091+0000)\n>\n> decisamente SI! è questo il punto LICH ROLAND. Io sono irrecuperabile giusto? L&#x27;obiettivo della Riot è quello di RIMUOVERE PER SEMPRE i giocatori irrecuperabili BANNANDO PERMANETEMENTE IL LORO ACCOUNT. Allora è servito a qualcosa? Ho smesso di giocare?! Ho smesso di flammere? ho smesso di essere irrecuperabile? NO! allora perché non fare come nel punto A) o C)?!\n\nSecondo me invece contro una parte funziona perchè non tutti hanno voglia di rifarsi tutto da capo e quelli come te sono pochi.Quelli che vengono bannati o cambiano atteggiamento o cambiano gioco secondo me e i casi come tuoi sono inevitabili finchè non si lega l'account a un documento d'identità che risulterebbe infattibile","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T17:31:11.192+0000","up_votes":1,"down_votes":3,"body":"infattibile? lo fanno sui siti di pokeronline in modo super facile, lo stesso vale se fai servizi digitali del Comune o di altri siti. Quindi non vedo il problema.\nNon funziona per niente LICH, la percentuale di gente che viene permabannata aumenta sempre di più anziché diminuire tanto che la stessa riot ha smesso di mettere la classica frasetta durante il ban: \"solo il 5% degli utenti viene permabannato\" perché sta salendo sempre di più","replies":[]}]}]},{"poster":"Arknoid Smurf","date":"2017-05-21T14:48:54.215+0000","up_votes":2,"down_votes":4,"body":"decisamente, ma il punto era proprio evitare che gente come me continui, il senso della logica sarebbe questo. Invece continuo, perché loro non vogliono che tu smetta di giocare e di essere negativo ma solo che tu inizi da capo come account per comprare da capo. \nAltrimenti per logica, si farebbe come nel punto 1) e A) che ho scritto. \nNon trovi sia così?","replies":[]}]},{"poster":"Khail the Crow","date":"2017-05-21T15:10:25.468+0000","up_votes":4,"down_votes":1,"body":"Il sistema che proponi è antieconomico. Potrebbe essere gestito solo con un'anagrafica digitale a cui la RIOT dovrebbe interfacciarsi, e già sarebbe difficile con una sola nazione, figuriamoci.\nIn poche parole, non è sostenibile da una compagnia ergo lo dobbiamo scartare.\n\nIl permaban funziona abbastanza. Scoraggia i giocatori a tornare o a continuare con i loro comportamenti, e comunque li rimuove dal sistema per un certo periodo di tempo.\nLe regole imposte dalla RIOT sono semplici e abbastanza giuste. Non ho mai visto dei player bannati per comportamenti tossici senza una buona ragione. Sono le stesse regole a cui si attengono quotidianamente milioni e milioni di sportivi e giocatori. Niente che un normale umano non possa accollarsi.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T16:51:10.433+0000","up_votes":2,"down_votes":3,"body":"cit. <<Il permaban funziona abbastanza. Scoraggia i giocatori a tornare o a continuare con i loro comportamenti, e comunque li rimuove dal sistema per un certo periodo di tempo.>> Si per un certo periodo di tempo, cioè il tempo di crearsi un account nuovo, cioè 5/6 minuti? ;) :P \nFunziona \"abbastanza\" dici tu stesso, non funziona per niente bene...tanto è vero che hanno smesso anche di ripotare la frase tipica che c'era fino a poco fa che solo il 5% dei giocatori viene bannato etc, tanto è vero che sta aumentando sempre di più come percentuale. Mi piace perché prima parlate di come bisogna essere maturi, responsabili e sportivi come milioni di altri sportivi e giocatori, e che quindi è giusto bannare un account, ma poi di comportamento responsabile per evitare che i giocatori negativi tornino a comportarsi come prima non c'è ne è traccia perché sarebbe troppo costoso! :P \nKahil certa gente non cambierà mai, punto, la riot lo sa benisismo e non gli frega niente che sta gente giochi e dia fastidio agli altri, gli interessa che paghino e spendano soldi, tanto è vero che non bannano né l'IP né limitano la possibilità di creare account verificando un minimo i dati e i giocatori negativi (tipo me) ci sono sempre e sono sempre in aumento :D \nSono abbastanza sicuro che la sportività e la giustizia non abbiano niente a che vedere con ste scelte, tanto è vero che fino al 2014 NON era previsto il ban permanente per i flamers ma solo la restrizione di chat progressiva magari anche all'infinito. Io avevo collezionato tipo 50200 partite con chat ristretta all'epoca! Poi per fare cash cambia tutto :) (ah prima la gente diceva che era giustissimo restringere la chat e non bannare la gente, mi piace vedere come nel forum col tempo le idee cambino in base alle regole del padrone, se domani le ricambiasse con chat ristretta e non permban direste che è giusto così! eheh)","replies":[{"poster":"Khail the Crow","date":"2017-05-21T17:49:14.831+0000","up_votes":2,"down_votes":1,"body":"Scusa, ma non hai capito una mazza. Prima di tutto non usare il plurale. Io commento per me, non per gli altri.\nTe lo dico un po' più schiettamente, a costo di esser rude ma voglio essere chiaro. \nCiò che tu hai proposto è fantasioso, assolutamente non implementabile e non vantaggioso per la compagnia. Quello che tu o io vogliamo è irrilevante. Onestamente metterei la firma per far bannare la persona che è riuscita a farsi permabannare più di un account. Purtroppo o per fortuna, il mondo non esiste per accontentare me. \nO te. Perciò mettiti il cuore in pace. Il permaban resta (perché poi è questo il succo del problema, no?).\n\nPerché la RIOT ha introdotto il permaban? Perché giocatori oltremodo tossici sono un danno per gli affari. In poche parole, fanno volentieri a meno di loro.\nIl sistema funziona? A giudicare dal fatturato della compagnia direi proprio di sì. Se vuoi fatti un giro su Google e controlla.\nPrevengo le obiezioni: gioco o meno, la compagnia esiste per fare soldi e non per far quello che piace a te. Troveranno il giusto compromesso tra profitto e accontentare la clientela (di cui tu non sei un campione rappresentativo).","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T19:04:18.384+0000","up_votes":2,"down_votes":4,"body":"Ti cito: <<Perché la RIOT ha introdotto il permaban? Perché giocatori oltremodo tossici sono un danno per gli affari. In poche parole, fanno volentieri a meno di loro.\nIl sistema funziona? A giudicare dal fatturato della compagnia direi proprio di sì. Se vuoi fatti un giro su Google e controlla.>>\nRagazzo, ti sei risposto da solo. Io non dico che non devono permabannare, dico che il MOTIVO per cui permabannano non è quello per cui i giocatori tossici sono un danno per i loro affari, anzi loro sono molto contenti che ci siano, proprio perché come dici tu aumenta il loro fatturato così ;) Sai cosa vuol dire 350.000 account bannati in media ogni anno, anzi a salire, perché la percentuale dal 5% all'anno e salita al 7% dal 2015 ad oggi e chissà nel 2018 a quanto sarà! Così rifai account, compri boost, compri skins...poi loro sanno bene che sei impulsivo o altro e sbem= un sacco di soldi. Ci sta da dire che la Riot è la prima a violare il proprio regolamento lasciano creare account a ragazzi under 14 anni che in quasi tutti gli Stati compresi l'Italia sono impossibilitati per legge a costituire regolare contratto, però finché buttano soldi va tutto bene ;) E lo sanno bene questo dell'età, ho risposte di supporter ufficiali della riot che dicono di essere a conoscenza che molti utenti sono under 13 ma che non gli bannano l'account solo per l'età ma ci devono essere alte ragioni. Cioè un contratto nullo lo tengono valido per succhiare soldi, il resto no ...poi parlano di giustizia (quella della riot) e sportività. La clientela è merda per la Riot direi che è evidente, visto che da 5 anni la gente si lamenta dei flamers, feeders, cheaters e afkers...e solo per i cheaters e flamers esiste il permaban come punizione, mentre gli altri non hanno nulla di fatto. Ti invito ad addarmi in game e vedere la mia cronologia per capire come i feeders intenzionali non sono mai puniti se non si autodichiarano tali in game! ;) :) Detto questo la soluzione è semplice, le parole di qualcuno sono offensive e non cambia? banna per sempre la chat (il per sempre è SEMPRE esagerato, scusa il gioco di parole, sarebbe sufficiente per tot mesi e a progressione come facevano prima sino al 2014...ma prima erano scemi e guadagnavano di meno effettivamente )","replies":[{"poster":"Khail the Crow","date":"2017-05-21T19:38:25.368+0000","up_votes":2,"down_votes":0,"body":"Invece il loro metodo funziona, con buona pace di chi non è d'accordo.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T20:16:29.344+0000","up_votes":2,"down_votes":2,"body":"si si funziona tantissimo, un po' come funziona per la democrazia le bombe in Iraq o in Siria ;) con buona pace di chi non è d'accordo! giusto per citarti! Sembra che se qualcosa procuri denaro sia giustificabile sempre e comunque nonostante i diritti e interessi degli altri che se lo prendono nel culo devono starsene (con buona pace di chi non è d'accordo). Ti giuro quella frase la sai usare davvero bene, mi piacerebbe molto assistere a qualche ingiustizia reale nella tua vita da parte di qualche autorità o multinazionale e poi venire a lì a dirti mentre sei in rovina: dai il loro metodo funziona, con buona pace di chi non è d'accordo.","replies":[]}]}]}]}]}]},{"poster":"Vileblood Pyke","date":"2017-05-21T20:12:47.146+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Arknoid Smurf,realm=EUW,application-id=98NGV4Al,discussion-id=vMMJ1RNE,comment-id=,timestamp=2017-05-21T13:16:30.267+0000)\n>\n> Allora, premesso che gioco da 5 anni a LoL e che in 5 anni mi hanno bannato 12 account circa. Quindi parliamo di una media di 2,4 account bannati ad anno.\n\nBene, direi che possiamo fermarci qui.","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T20:20:13.884+0000","up_votes":2,"down_votes":3,"body":"bene, allora direi che proprio non capisci. Visto che sono ancora qui e continueranno a bannarmi account (per quel che mi frega) e voi continuerete a subire \"situazioni negative di gioco\" da parte mia e dei miei collaboratori, il fatto di ignorare qualcosa e di non pensare ad alternative davvero risolutive vi può portare soltanto a continuare ad avere gentaglia come me, sempre di più. Io mi diverto un sacco, col nuovo metodo, ti invito ad aggiungermi su twtich per vedere come il progetto sta già andando bene ;)","replies":[]}]},{"poster":"Floppyz","date":"2017-05-21T20:32:07.593+0000","up_votes":3,"down_votes":1,"body":"Visto che Arknoid Smurf ha deciso di cominciare la sua collezione anche sul forum e quindi non potrà più rispondervi, chiudo il topic.","replies":[]},{"poster":"Jack Garrus","date":"2017-05-21T17:26:36.937+0000","up_votes":2,"down_votes":1,"body":"Voci dicono che nella season 8 la Rito introdurrà il BAN DALLA TERRA.\n\nBtw, ti consiglio di imparare un minimo di sintesi, perchè qui non tutti hanno così tanto tempo a disposizione come te (visto che in 5 anni ti sei impegnato a farti bannare ogni volta che potevi, e ricominciare con lo stesso mindset. GG) per leggere il libro che hai scritto.\n\nQuindi hai ragione te: buuu ritoh, buuu","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T17:32:36.993+0000","up_votes":2,"down_votes":3,"body":"jack se avessi avuto modo di leggere il mio \"libro\" avresti scoperto che propongo idee e soluzioni coerenti, mentre il sistema attuale non è per niente coerente. Ad ogni modo la tua argomentazione di ironia e sfottò si dimostra molto matura e sicuramente valida.","replies":[{"poster":"Jack Garrus","date":"2017-05-21T17:51:53.617+0000","up_votes":2,"down_votes":1,"body":"Ovviamente, ma mi stupisce che te in cinque anni non ti sia mai accorto di quanti post identici al tuo siano stati scritti. \n\nCapisco il concetto che hai espresso, ossia: siccome io sono stato bannato a nastro innumerevoli volte cosicchè la riot possa garantire un gioco più sano a tutti, io continuo a tornare perchè alla fin fine la riot non ha un vero piano per farmi fuori definitivamente da lol. E fin qui ci siamo.\n\nIl tuo punto A è una cosa che riot eviterebbe a tutti i costi, in quanto la maggior parte dei giocatori sono minori di 15 anni, pertanto non possono avere dei documenti. \n\nIl punto B è plausibile, ma è stato proposto così tante volte che dubito che la riot voglia concretizzarlo. E se tu appena lvl 30 non smurf ti ritrovi in b5 con la peggio melma del gioco perchè ovviamente non sai come ci si comporta in ranked, quando spererai mai di uscire dal B? Non ha un gran senso.\n\nC : il mute è senza dubbio una salvezza spesso, ma se si dovesse farlo di default non sarebbe una buona strategia, visto che alcune volte ci si ritrova in team sani in cui possono nascere collaborazioni e amicizie. E poi uno che mi augura il cancro, la morte, l'inverno nucleare e le emorroidi sinceramente non vorrei più dovermelo trovare tra i piedi ;)","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T18:20:17.350+0000","up_votes":2,"down_votes":4,"body":"la carta di identità in italia la puoi avere prima dei 14, e negli altri paesi dai 14 anni in su. Mi chiedo perché la riot debba far giocare persone under 14 anni o sui 15 anni quando espressamente chiede che prestino consenso al contratto e al codice della riot. Come fanno a chiedere responsabilità e maturità a chi ha 15 anni o meno?! Ti rendi conto della contraddizione della Riot? se non per lucro non ha proprio senso :)\nPer il punto B ti do ragione solo per la problematica di uscire dal B5 per qualcuno che ci finisca dentro, cosa rara per uno che inizia ranked almeno che non le perda 7 su 10 o di più.\n\nC) il MUTE sai bene che lo puoi usare quando vuoi solo SU UN GIOCATORE o SU Più GIOCATORI e che è già di base come opzione, quindi la soluzione migliore, visto che il permaban non serve a limitare gli insulti o chi insulta, dimostrazione vivente ne sono io. Ma giusto ti invito a specatarmi. Sto facendo 1/9 intenzionalmente con YII, mi flammano in 4, giustamente, io non scrivo niente in CHAT. Indovina cosa farò? reporterò per flame quei poretti che verranno puniti mentre a me non faranno niente. Ho deciso di dare un po' del mio Karma in giro, ho parlato con altri 7 miei amici e siamo tutti d'accordo. Faremo una bella crew radunando sempre più gente per trollare e reportare la gente. Così giusto per tenere la tossicità e la negatività in game finché la riot non si renderà conto che deve comportarsi in modo diverso :)\n\nP.s. chiunque ti auguri determinate cose da MUTATO non lo leggi e finisce lì, voglio vedere come te la cavi quando troverai qualcuno del mio team torllarti in game ;) quello si che è davvero fastidioso e negativo per la comunity. Ora registro su twtich anche...voglio far leggere la chat. Poretti erano bravi ragazzi tutti carini e cordiali prima che io iniziassi a trollare. \nTUTTI flammano se provocati, ricordatelo, vorrei sapere il tuo nome giocatore per addarti e vedere cosa succede il giorno che finisco per caso nel tuo team :)","replies":[{"poster":"Jack Garrus","date":"2017-05-21T19:02:47.679+0000","up_votes":3,"down_votes":1,"body":"Ragazzo mio, devi farti aiutare, e non lo dico per prenderti in giro.\n\nA parte che, come fai notare anche tu, quando si inizia a giocare firmi un contratto. Non pensi che se ti metti a fare queste festicciole con i tuoi amichetti la riot non prenderà provvedimenti davvero seri nei tuoi confronti ?http://euw.leagueoflegends.com/it/legal/termsofuse .\n\nMah, se ti va di buttare così la tua vita fai pure. Ricordati però che se stai dichiarando 'guerra' a una multinazionale per mostrare quanto ce l'hai lungo, specie con le tue intenzioni infantili, mi sa mi sa che perderai e collateralmente rovinerai il game ad un sacco di gente che, con te e il tuo correre contro i mulini a vento, non c'entra nulla, ma mi sembra che neanche te ne importi.\n\nBuona fortuna {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T19:16:10.166+0000","up_votes":2,"down_votes":4,"body":"Ragazzo mio, vorrei farti notare che per stipulare un contratto in ogni Paese civilizzato (italia compresa) ci vuole l'età legale per farlo. La Riot sa bene che con l'attuale metodo di iscrizione chiunque può farlo, e sicuramente un contratto \"stipulato\" da un ragazzo under 13 anni non ha nessun valore di legge e mi chiedo con quale ipocrisia la Riot possa pensare che senza verificare l'età di un iscritto sia valida l'adesione al loro contratto! A livello legale potrei fargli il culo in ogni stato americano e in italia di sicuro. Visto che loro sanno bene di aver 12enni (potrei esserlo io stesso per quel che ne sai tu) a milioni a giocare e che usano carte di credito o paypal dei genitori per pagare e va tutto bene, tutto regolare. Poi ti ripeto io mi faccio del ridere ora trollando e coi miei amici ci divertiremo un mondo. Attualmente ho altri 4 account oltre questo e sono in D2, Plat IV, Gold II e Silver I. Sarà un piacere rovinare l'esperienza di gioco a tanti altri feedando a schifo senza incorrere in nessuna punizione grazie al sistema attuale e anzi a far bannare o punire chi flammerà me o miei compagni di crew. Davvero ti invito ad aggiungere alcuni di questi account per farti del ridere a vedere le partite, le chat di gente calma che impazzisce (a ragione secondo me), gli screen delle punizioni effettuate dalla riot che mi ringrazierà anche della segnalazione ahah! Ti giuro sarà puro divertimento. Una multinazionale non vuol dire che avrà ripercussioni serie a causa mia, certamente è più un danno OW o altri games on line. Ma io ci metto del mio a farmi del ridere giusto per vedere cosa può succedere. Tu ti salverai di sicuro se avrai un account sopra a D1 perché attualmente anche tra i miei amici la divisione massima è quella quindi non possiamo trollare oltre. Abbiamo già studiato di non scendere troppo di divisione e di non esagerare, quindi si trolleranno 5 partite di fila massimo, poi si giocherà un po' meglio giusto per mantenere un andamento altalentante ma non troppo positivo negli score per restare a galla in certe divisioni e poi si torna a trollare 5 partite di fila. Chi invece ormai è infondo a B5 trolla senza ritegno anche illimitate partite.\nSpero di beccarti giusto per vedere la tua reazione e vedere se una segnalazione mia o del mio staff potrebbe portarti a qualche conseguenza negativa da parte della Riot, a quel punto grasse risate. Trollato da noi, beffato dalla Riot! that's amore <3. P.S. chi usa i disegnini della Riot come quella Vi davvero mi rende triste, cosa hai 15 anni? sembri una bimba di 15 anni ti prego, o un pedofilo. Non usare quella roba, fa venire i brividi pensare di parlare con un uomo adulto che usa quelle cose","replies":[{"poster":"Jack Garrus","date":"2017-05-21T19:22:49.051+0000","up_votes":3,"down_votes":1,"body":"Dai per scontato che tutti siano marci come te ^^ GL !","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T19:30:24.239+0000","up_votes":2,"down_votes":5,"body":"no no davvero, fa proprio schifo pensare che un uomo adulto di sesso maschile possa usare quella roba. Cioè pensi di fare il \"puccioso\" nella tua testa?! Dovresti curarti prima di molestare qualche bambina, quelle immagini non sono nate per essere usate da uomini ma da ragazzine o al più donne che giocano a fare le bimbe. Spiegami per quale motivo un uomo adulto deve usare \"quell'emoction\"? capisci che dovrebbe essere qualcosa che ti rappresenta o che ti piace particolarmente? Quindi ti piace una Vi stile bimba con fiocco e musetto da gatto? in sintesi le bimbe=hai dei problemi o perché ti credi una ragazzina di 15 anni o perché ti piacciono le bimbe. Certo se tu fossi una ragazzina o una donna con la sindrome di peter pan cambia discorso e allora fai bene a usarla e GL a te","replies":[]}]}]}]}]}]}]}]},{"poster":"Darkinknight","date":"2017-05-21T15:59:57.913+0000","up_votes":2,"down_votes":1,"body":"1) si,l'idea in se non sembra stupida,se non fosse che per i siti online che dici tu si tratta di gioco d'azzardo,maggiorenni e a cui inserisci un bancomat o simili,ergo su un videogioco NON si puo fare specialmente per il discorso maggiorenni..secondo non funzionerebbe lo stesso, il mio account viebe bannato,metto i dati di un parente/amico che non gioca a lol.\n2)per chi feeda intenzionalmente la punizione c'è,dai 14 gg di ban al permaban..solitamente quello che hanno un account bannato 12 volte tendono a vedere feeder chiunque non li stia carriando,motivo per cui sembra non vengano puniti.\n3)sei per strada,un tizio w caso inizia a offenderti parenti,augurarti malattie ecc ecc..ma esiste un telefono e le cuffiette,quindi il tizio è nel giusto e non va punito perche tu potresti ascoltare la musica e ignorarlo..questo ovviamente secondo la tua logica.\nIl permaban non risolve tutti i giocatori tossici,ma una parte si ed è comunque una punizione..vai in macchina e superi il limiteti beccano e ti multano..domani a drai comunque piu veloce se non impari ma la punizione l'hai avuta lo stesso..poi certo,le capre che non sanno comportarsi e non imparano dagli errori ci saranno sempre,si divertano a rifarsi/spendere soldi a comprare nuovi account..esenti comunque di tutto cio che si era guadagnato in precedenza","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T16:44:10.652+0000","up_votes":1,"down_votes":4,"body":"3) se un tipo ti ingiuria per strada non viene punito, è stato depenalizzato con Renzi il reato di ingiurie proprio perché erano troppi quei tipo di reati e intasavano la giustizia e il rovinare la fedina penale era esagerato per un momento di ira (tra l'altro esiste anche la c.d. provocazione ritorsione come giustificante quando era penale, nel senso che in caso di \"flame\" o meglio ingiurie reciproche finiva tutto in un nulla giuridico) e quindi ora è solo civile. Ad ogni modo è totalmente diversa la cosa visto che non ho la presenza di qualcuno che mi ronza attorno essendo il MUTA qualcosa che ti permette di ignorare totalmente SOLO QUEL GIOCATORE senza dover ignorare il resto, mentre con le cuffie ledo la possibilità di ascoltare altre persone o quello che mi circonda.  Per la macchina idem, se commetto sempre la stessa punizione e ho solo da pagare una multa e perdo punti, posso pagare e sempre pagando riavere i punti, oppure ridare la patente, di sicuro non mi sequestrano l'auto e non la portano via. Ma la cosa su cui non condivido è questa: <<le capre che non sanno comportarsi e non imparano dagli errori ci saranno sempre,si divertano a rifarsi/spendere soldi a comprare nuovi account..esenti comunque di tutto cio che si era guadagnato in precedenza>>. A loro non interessa e la punizione non serve a insegnare qualcosa alla gente che flamma. Se vuoi impedire a qualcuno di flammare devi togliere la sua chat per periodi sempre maggiori ma toglierla del tutto e non limitarla, né tanto meno cambiare la tipologia di sanzione da restrizione chat a ban perpetuo. Penso che la cosa migliore per educare sia quella di incentivarli a comportarsi in modo positivo premiando il fatto che non flammino e ricevano magari onori dai compagni o avversari anziché sanzionare con punizioni di proporzioni e tipologie diverse. Il fatto che la percentuale di flamers non diminuisca ma aumenti né la prova che il sistema così non funziona. Uno stesso membro dello Staff dello Riot, che crea proprio i personaggi, ha detto che il ban per chi flamma non serve a niente perché il fenomeno è in percentuale in aumento e non in diminuzione, ma che bisogna trovare metodi alternativi...aveva proposto cose come l'isola dei flamers per un tot di tempo e restrizione di chat totale invece che parziale a numero progressivo per il ripetersi del flame. Quando l'ha proposto lui però era una cosa sensata, lo propone un player diventa uno che non sa comportarsi e non impara mai dalla punizione XD","replies":[{"poster":"Darkinknight","date":"2017-05-21T19:44:34.229+0000","up_votes":2,"down_votes":1,"body":"-Depenalizzato non vuol dire che puoi farlo e gli altri devono adeguarsi\n-Dopo X multe e punti paghi e in piu perdi la patente la(e successivamente puoi rifarla esattamente come l'account)..ti rifai l'account?quante ore perdi per ritornare poi a un punto dove venir ribannato? Te lo compri? Beh se per il tuo flame vai a spendere quei 15-20 euro ad account + cio che perdi dall'account ben venga,la tua sanzione l'hai avuta.\n-Se di 100 giocatori tossici,anche solo la meta l'account successivo,o quello dopo ancora,  lo sfrutttano con un comportamento decente,il permaban ha efficacia..se uno è testa di ** non lo cambi nemmeno a metterlo in galera,e certo un videogame non puo far miracoli su persone che non hanno capacita di relazionarsi civilmente \n- a chi viene permabannato l'account interessa, non ler niente tutti i giorni ci sono persone che vengono qua a piangere per il permaban/ gente che viene a lamentarsi di quanto sia inutile e no sense il permaban( guardacaso sempre i permabannati)\n- che me lo dica tu o un rioter la considero in ogni caso un'idea senza ne capo ne coda..cosi come dico molti rework o cambiamenti ritengo siano fatti dopo una un rave party..a mio parere il titolo non fa l'opinione.\nmettere flamer insieme a soli altri flamer cosa ottieni? Metti un drogato insieme a dei drogati,sicuro non lo trovi disintossicati dopo un po. Oltre che manco sanno fare dei matchmaking decenti,figurarsi spartire i player in questa maniera.\n- se io,come player,mi trovo un tossico in team,sono contento di vederlo permabannato,che si prenda 10-20-100 chat ristretta non mi fa ne caldo ne freddo (detta anche giustizia,un po come il Renzi da te citato non è certo da prendere come buon esempio)\nIl sistema è perfetto cosi?certo che no..ma non è certo depenalizzando certi comportamenti, raggruppare tossici coi tossici, e fare in modo che un messaggio o simili ti dica che sei stato un bravo bimbo,a cambiare player che non cambiano nemmeno con il permaban\nPuoi anche metterti in coda con i tuoi amici a trollare eccetera,fatevi bannare,comprate account e via di nuovo,soldi buttati nel nulla :) qualsiasi cosa non vi farebbe cambiare,almeno pagate..io posso mutare un player tossico per non farmi infastidire,ma quel ban a fine game mette la ciliegina sulla torta.\nChe tutto cio che fa la riot gira intorno al suo portafogli? Beh mi sembra scontato,non vedo da nessuna parte sia segnato come ente di beneficienza","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T20:11:42.820+0000","up_votes":2,"down_votes":2,"body":"1) depenalizzato vuol dire che se non sai il mio nome e cognome NON puoi farmi niente, perché se vai a denunciarmi ti ridono in faccia essendo improcedibile e quindi unica via la citazione a giudizio civile ma dovresti sapere nome cognome e indirizzo. Ah e il giudice in base all'art. 35 del dpr 274/2000 se giudica congruo la tua offerta risarcitoria (che spesso consiste in scuse pubbliche in aula) finisce tutto lì. Ergo direi che puoi fare quello che vuoi da quel punto di vista, se vuoi ci vediamo un giorno faccia a faccia e ti insulto tutto il tempo e vediamo come a va a finire? giusto per farti capire che sto esempio proprio lo devi lasciare stare che c'entra niente.\n2) Tu stesso dici <<a chi viene permabannato l'account interessa, non ler niente tutti i giorni ci sono persone che vengono qua a piangere per il permaban/ gente che viene a lamentarsi di quanto sia inutile e no sense il permaban( guardacaso sempre i permabannati)>> Quindi solo per sta frase dovresti capire che davvero non serve a un caXXo ma ti ostini a non volerlo vedere, dai capisco ognuno la vede come vuole, sono punti di vista. Aspetta solo di avere la fortuna di finire tra le partite mie o dei miei nuovi compagni di crew ;)\n3)<<che me lo dica tu o un rioter la considero in ogni caso un'idea senza ne capo ne coda>> mi fa piacere che tu lo dica, ricordatelo quando la riot cambierà idea e tu giustificherai quella nuova regola, mi sembri il classico con la sindrome di giustificare l'autorità, tempi d'oro quando c'era mussolini eh?! ;)\n4) <<io,come player,mi trovo un tossico in team,sono contento di vederlo permabannato>> bravo, stai tranquillo presto toccherà anche al tuo account, il flame ormai è qualsiasi chat se riportato più volte di fila non essendoci un tribunale ma solo un sistema automatico che in caso di qualsiasi scritta in chat la vede come flame o spam se tu vieni reportato 4/5 volte per tot partite.\n5)Puoi anche metterti in coda con i tuoi amici a trollare eccetera,fatevi bannare,comprate account e via di nuovo,soldi buttati nel nulla :) qualsiasi cosa non vi farebbe cambiare,almeno pagate . PAGARE?! NON PAGHEREMO MAI LA RIOT! ahahah, ma tu conosci il phishing?! hai notato che ultimamente sta aumentando questo fenomeno? guarda vai tranquillo dammi tempo 10 giorni e mi prendo il tuo account ;) Poi non piangere se te lo lasciano sospeso perché per loro la politica è: dovevi proteggerlo meglio ;)","replies":[]}]}]}]},{"poster":"Hariberü","date":"2017-05-21T17:45:10.712+0000","up_votes":2,"down_votes":2,"body":"A) ma se poi le ragazze carine mandano le loro foto nudes coi documenti in mano e diventano inbannabili? :OO","replies":[{"poster":"Arknoid Smurf","date":"2017-05-21T17:49:42.229+0000","up_votes":2,"down_votes":3,"body":"sarebbe una cosa positiva, almeno si sa quali sono gli account delle ragazze fighe XD !!! \nChi ti dice che io non sia una figa poi?! :P","replies":[]}]}]}