{"poster":"LodeAlSole","date":"2016-08-21T14:33:41.826+0000","title":"AIUTO SONO SPASTICO! ( taliyah problem)","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ok ragazzi, probabilmente ho io qualche problema, ma datemi una dritta se no mi sparo alle palle!\r\n\r\nSto cercando di imparare sta taliyah ma 1 cosa mi assilla! LA SUA DANNATA R !!\r\nCavolo, la lancio, riclicco per cavalcarla euforico dritto verso il gank perfetto e.,...tadan! muovo il cursore, clicco poer muovermi, ripremo tutto, ma da sto cavolo di muro non mi fa mai scendere quando voglio io!!! sono io decerebrato o succede anche voi?","replies":[{"poster":"Ryukito","date":"2016-08-21T22:06:19.169+0000","up_votes":1,"down_votes":0,"body":"A proposito di Taliyah, faccio qui la domanda per non aprire un nuovo post. Giocavo con Vayne e nella squadra avversaria c'era lei, Taliyah. Ad un certo punto lei ha ultato venendo bot ma io usando la capriola ho oltrepassato il muro, cosa che la capriola di Vayne non oltrepassa neanche i minions. È un bug?","replies":[{"poster":"Skydago","date":"2016-08-21T22:44:35.675+0000","up_votes":2,"down_votes":0,"body":"La capriola di vayne oltrepassa pure il muro di jarvan.","replies":[]}]},{"poster":"NiraBlade","date":"2016-08-21T17:11:16.265+0000","up_votes":1,"down_votes":0,"body":"quando arrivi nel punto prescelto dovresti muovere il cursore sul lato e sul punto prescelto dal quale vuoi scendere. Se lo premi in un punto troppo presto (per esempio in quel momento sei attaccato ad un muro e la \"zona\" prescelta è troppo avanti) non dovrebbe lasciarti scegliere. Magari prova a fare un video di questo problema che dopo me lo guardo (metti visibile il puntatore del mouse pls)","replies":[]},{"poster":"oroora6","date":"2016-08-21T17:10:47.367+0000","up_votes":1,"down_votes":0,"body":"fai il video quando ti spari, diventi famoso sul tubo poi\n\na parte tutto, te la mandi e poi premi con il destro per finire di andare sul muro, scendendo nella direzione desiderata.","replies":[]}]}