{"poster":"ProjectNKone","date":"2019-12-16T19:13:37.349+0000","title":"¿Aatrox esta realmente muerto?","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Hola Invocadores.{{sticker:vlad-salute}} \r\n\r\n\r\nLamentablemente ultimamente un campeon esta practicamente Muerto y este es Aatrox{{champion:266}} \r\nEl problema comenzo desde el parche 9.14 donde como muchos sabran al campeon se le retiro el revivir/resurreccion de su Definitiva(R) lo que causo que el winrate de Aatrox{{champion:266}}  bajara mucho ya que su mejor ``arma`` hasta ese entonces en top fue eliminada.\r\nRiot tratando de compensar el borrar  El revivir/resurreccion de su definitiva(R)  añadio muchas mas curacion a su Pasiva y a su R pero ¿Esto realmente ayudo al campeon o lo empeoro? \r\nEn mi opinion el campeon empeoro mucho a comparacion de como estaba, yo lo jugaba mucho al champ pero desde ese parche lo deje de usar ya que el campeon ya no aportaba lo mismo que antes ya no era lo mismo, realmente nunca senti que las curaciones eran buenas y nunca llegaban a compensar la falta del Revivir/resurrecion.\r\nEl tema yo lo deje por ahi pero ultimamente me han comenzado a tocar varios Aatrox {{champion:266}} tanto en ranked como en normales varios eran main del campeon y segun lo que he visto varios aun no llegan a adaptarse al mini rework que le hicieron, segun lo que me dicen es que sienten que el campeon esta muriendo a falta de lo que mas lo caracterizaba que era su Revivir (he dicho demasiadas veces revivir xD)\r\nY bueno chicos lo que busco con esta discusion es saber su opinion del tema en mi opinion el campeon esta muriendo y riot le tendria que devolver su antigua R  espero que respeten mi opinion y espero Sus Opiniones sobre el tema.\r\n\r\nGRACIAS POR LEER, BAY BAY{{sticker:sg-kiko}}","replies":[{"poster":"xTm Joe Kelly","date":"2019-12-16T20:54:21.553+0000","up_votes":1,"down_votes":0,"body":"corta curaciones y dejo de funcionar el pobre, paso lo mismo con mi jax sacaron el dodge y le quitaron su pasiva riot hace lo que quiere con los personajes los deja en el olvido y los mata hasta dejar de verlos no se para que sacan tantos campeones si después de cada nerfeo que le hacen ni se les ve la sombra.","replies":[{"poster":"VenganceZ","date":"2019-12-16T21:20:41.069+0000","up_votes":1,"down_votes":0,"body":"No vas a comparar un jax con 1 o 2 ítems con un Aatrox que aún con toda su build es basura con patas","replies":[{"poster":"xTm Joe Kelly","date":"2019-12-16T21:25:06.432+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VenganceZ,realm=LAS,application-id=v7qsfXsE,discussion-id=qWAtWnEG,comment-id=00020000,timestamp=2019-12-16T21:20:41.069+0000)\n>\n> No vas a comparar un jax con 1 o 2 ítems con un Aatrox que aún con toda su build es basura con patas\n\nconociste al primer jax ? sabes algo de el campeón ? parece que nada su pasiva antigua le daba 3 de hp por 1 de daño + 2 de hp x 1 de ap = por algo era un campeón híbrido su w pegaba 220 ahora pega 180 tiene menos armadura y escala con menos armadura igual se regenera menos vida y menos mana no pega tanto como antes pero supuesta mente es balance y dicen que esta roto gente que no lo conoce desde que salio.","replies":[{"poster":"VenganceZ","date":"2019-12-16T21:33:34.943+0000","up_votes":2,"down_votes":0,"body":"Pero actualmente jax es viable, no es troleo, podés llevarlo a top o a jg y sirve. Jugar Aatrox actualmente es trolear. Es como sacar Talón jg si no sos Challenger ni te va a servir de nada ese pick.\n\nQuizás vos estás tan ofendido y dolido como todos los Main Aatrox de ahora y tenés mi apoyo.\n\nPero Aatrox murió. Murió y si no hacen algo no va a volver","replies":[{"poster":"xTm Joe Kelly","date":"2019-12-16T21:37:03.522+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VenganceZ,realm=LAS,application-id=v7qsfXsE,discussion-id=qWAtWnEG,comment-id=0002000000000000,timestamp=2019-12-16T21:33:34.943+0000)\n>\n> Pero actualmente jax es viable, no es troleo, podés llevarlo a top o a jg y sirve. Jugar Aatrox actualmente es trolear. Es como sacar Talón jg si no sos Challenger ni te va a servir de nada ese pick.\n> \n> Quizás vos estás tan ofendido y dolido como todos los Main Aatrox de ahora y tenés mi apoyo.\n> \n> Pero Aatrox murió. Murió y si no hacen algo no va a volver\n\nviable ? te meten un stun bueno y no puedes meterte a una tf pero bueno yo apoyo su lucha y a ver que se puede hacer para que mejoren y no lo maten mas de lo que esta suerte bro y ojala les vaya bien a todos los main aatrox","replies":[{"poster":"Tayler95","date":"2019-12-17T18:21:57.507+0000","up_votes":1,"down_votes":0,"body":"gracias, que se comparta cualquier tema con Aatrox, se tiene que escuchar x lo menos, darnos algo. El CAMPEON ERA DPS ! lo mataron","replies":[]}]},{"poster":"Tayler95","date":"2019-12-17T18:20:43.905+0000","up_votes":1,"down_votes":0,"body":"para mi tendrian que sacarle TODO esto que le metieron al \" Aatrox \" de ahora. El original tendria que volver.","replies":[]}]}]}]}]},{"poster":"Endrance","date":"2019-12-16T22:53:52.420+0000","up_votes":1,"down_votes":0,"body":"Aatrox esta muerto?\n\nSejuani se rie de este post xD","replies":[]},{"poster":"Tayler95","date":"2019-12-16T19:40:46.763+0000","up_votes":1,"down_votes":0,"body":"Como minimo, le sacaron lo unico que lo hacia completamente diferente. Ya esta muerto.\nYo opino que devuelvan al viejo Aatrox, soy M7 con mas de 500,000 + de puntos con ese campeon. Nunca me adapte al nuevo. es imposible, me respondieron que le pasaria como Akali . . en su momento cuando me comunique con rito. Pero como van a cambiar a un DPS de manera drastica a sacarle eso, ahora solo depende de la Q y que no falle porque sino no se cura menos revivir. Obligando a no meterse adelante de la batalla como anteriormente lo hacia. {{champion:266}}","replies":[{"poster":"VenganceZ","date":"2019-12-16T21:21:55.162+0000","up_votes":1,"down_votes":0,"body":"Wow... Es como si yo mismo hubiese hecho este comentario... Es más... Creo que comenté lo mismo en otro post hace un tiempo ( o cree uno contando esto)","replies":[]}]},{"poster":"VenganceZ","date":"2019-12-16T21:19:22.556+0000","up_votes":1,"down_votes":0,"body":"No leí nada pero hoy en día los únicos Aatrox que veo en la grieta son los que llegaron a oro y compraron el campeón para probar la Skin \n\nF para los Main Aatrox que no lo consiguieron (yo soy uno, de haberlo sabido le hubiese hechado todas las ganas del mundo)","replies":[]},{"poster":"Fransoi ","date":"2019-12-16T20:57:56.267+0000","up_votes":1,"down_votes":0,"body":"Aatrox cuando le sacaron el revivir le dieron ese buff en las habilidades siguió siendo el top más fuerte durante MESES domino top casi toda la S9 como main top me cansé de enfrentarlo le vivia ganando ya que illaoi es lo que más juego y es muy buena selección contra aatrox pero aún así ese campeón fue nerfeado bien y aún si bien su % de victorias es malo tiene mucha seleccion eso quiere decir que ese % de victorias es porque gente que no lo juega lo usa aatrox sigue siendo un gran campeón pero ya no es un monstruo","replies":[]},{"poster":"ProjectNKone","date":"2019-12-16T19:24:15.960+0000","up_votes":1,"down_votes":0,"body":"Opinen si quieren xd","replies":[]},{"poster":"Tabulador","date":"2019-12-16T22:13:07.911+0000","up_votes":1,"down_votes":1,"body":"aatrox asi esta balanceado  y lo usa bastante gente es lo que importa igual que jax ","replies":[]}]}