{"poster":"Rat IRL 3434221","date":"2018-12-17T19:32:04.279+0000","title":"El Nuevo sistema de Placements es un desastre","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"OK... este es mi perfil:\r\nhttp://las.op.gg/summoner/userName=Draven%20IRL\r\n\r\nMe hice una Smurf para hacer un challenge de 1 semana a Challenger.\r\nTermino mis placements con un 9-1 u 8-2, no recuerdo bien. Y me deja en Hierro, ok no hay problema, subo todo hierro jugando contra Golds y platinos. Y ahora en Bronce IV y de ahi sigo salteando divisiones Hasta bronce I. Pero me matchea con Diamantes y Platinos.\r\nMi problema es el siguiente. Si yo estoy jugando contra Diamodns y Platinos el ascenso se me va a dificultar bastante mas que jugando contra gente de la liga a la que estoy en estos momentos Bronce I. Entonces basicamente para cuando llegue a Silver o gold voy a estar matcheandome contra master y/o challengers? Como que no lo veo muy justo, si bien yo tengo ese nivel de juego. Porque me ponen la chapa de digamos Silver si todos contra los que me estoy enfrentando son master / challenger?\r\n\r\nYo creo que las anteriores placements donde haciendo un 9-1 ya te dejaban en platino eran mucho mas precisas en cuanto a estas cuestiones...\r\nPuede alguien decirme que esta pasando aca ? porque bajo mi punto de vista es un desastre esto...\r\nPara llegar a Challenger tengo que hacer 300 partidas contra challengers con un winrate impresionante ? porque si estoy jugando como silver y si tengo que enfrentarme a challengers para ganar LP cada vez que gane no me va a subir una division entera sino unos miseros 35-45 LP...","replies":[{"poster":"LéonKaiser","date":"2018-12-17T19:42:59.810+0000","up_votes":3,"down_votes":0,"body":"Somos conscientes de esto, de hecho, fijate en este post:\n\n- https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/WaLHbERt-continuacian-cambios-a-clasificatorias\n\n**Pregunta: **\nLos jugadores con cuentas smurf/secundarias nuevas quedan clasificados en Hierro y suben demasiado lento.\nHicimos un cambio para que las nuevas cuentas queden clasificadas en Hierro para mejorar la experiencia de participar en las clasificatorias. Esto tuvo un efecto secundario no intencional en algunas cuentas secundarias donde el rango de un jugador y su MMR podían desincronizarse (por ejemplo, tener rango Bronce pero jugar en partidas de Oro o Platino), lo que hacía que escalar fuera muy tedioso e injusto.\n**Respuesta: **\nColocar cuentas nuevas que nunca hayan jugado una partida de clasificatoria en Hierro ayuda a evitar que los nuevos jugadores queden clasificados en Plata y desciendan rápidamente a Hierro o Bronce. Como resultado, ascender con cuentas secundarias será un poco más tedioso, pero al mismo tiempo, queremos evitar que dichas cuentas jueguen en partidas de Oro o Platino mientras aún están en Bronce. Aumentaremos la cantidad de PL que estos jugadores reciban para que sus rangos y MMR se mantengan más cerca uno del otro. Después de que empiece la temporada, añadiremos aún más mecanismos, como la posibilidad de empezar con PL adicionales después de ser promovido y saltar divisiones de forma más acelerada, para aumentar aún más la velocidad a la que estos jugadores suben.","replies":[{"poster":"Annie Botz","date":"2018-12-17T20:26:09.349+0000","up_votes":1,"down_votes":0,"body":"¿Cuándo piensan ponerle un Pin/destacarlo? Este no es el primer post sobre lo mismo, se lleva repitiendo estos últimos días...","replies":[{"poster":"Silcardo Jenazad","date":"2018-12-19T15:26:43.180+0000","up_votes":1,"down_votes":0,"body":"Ls gente no se gasta en leer las notas en los eventos que le salen ni bien abris el cliente... no nos engañemos... el post esta... solo hay que leer... asi le agreguen marcador..tilde...destacarlo.. no importa... la gente no lee... gasta el tiempo mas en quejarse que en informarse.. pareciera que buscan en todo momento algo para quejarse en vez de usar la logica y ver que esta mal y que bien en realidad.. nada les viene bien... no se gastan ni en prestar atencion..","replies":[]}]},{"poster":"Rat IRL 3434221","date":"2018-12-17T19:54:35.525+0000","up_votes":1,"down_votes":0,"body":"Muchisimas gracias LeonKaiser por aclarar las dudas.","replies":[]}]},{"poster":"Hell Darking","date":"2018-12-17T19:37:37.473+0000","up_votes":1,"down_votes":3,"body":"xD\nes cuenta smurf, no creas que por eso te van a poner contra bronces y platas para que subas rapido\nel sistema esta hecho para detectar esas cosas, vas a jugar con gente de tu nivel siempre","replies":[{"poster":"ThePunkRocker","date":"2018-12-17T20:40:08.298+0000","up_votes":2,"down_votes":0,"body":"no entendiste la finalidad del post...","replies":[]},{"poster":"Zinc","date":"2018-12-18T01:10:25.720+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hell Darking,realm=LAS,application-id=v7qsfXsE,discussion-id=9A0EsrYg,comment-id=0000,timestamp=2018-12-17T19:37:37.473+0000)\n>\n> xD\n> es cuenta smurf, no creas que por eso te van a poner contra bronces y platas para que subas rapido\n> el sistema esta hecho para detectar esas cosas, vas a jugar con gente de tu nivel siempre\n\nSi jugara con master/challanger desde el momento que lo ponen en hierro **jamas subiria**, por razones obvias.","replies":[]}]},{"poster":"Danimilz","date":"2018-12-18T14:03:08.112+0000","up_votes":1,"down_votes":3,"body":"Me da gracia, el flaco se crea una smurf para dársela de pro hijo de faker stompeando a low elos, y como lo emparejan con gente cercana a su nivel viene a quejarse. \nLas cosas que hay que leer.","replies":[{"poster":"Rat IRL 3434221","date":"2018-12-19T02:11:26.609+0000","up_votes":1,"down_votes":0,"body":"Para nada padre.\nNo entendiste para nada el punto del Thread.\nSi yo me pongo a jugar con gente de mi nivel o un nivel similar, Tengo que tener EL RANGO de ese nivel osea, si yo estoy jugando con master y diamond por que tengo que ser Silver I o Gold. Yo tengo que tener la chapa de Master o Diamond. No la de SILVER I.\nA eso viene el TH. Que si bien el sistema toma mi elo y sabe lo que juego, yo fisicamente estoy Silver I aunque este jugando con Diamonds entonces por que si cada partida es una partida de Diamond me da progresion de un elo de silver. Y no me pone en Diamond y voy progresando DESDE DIAMOND como realmente son el nivel de juego de las partidas emparejadas que tengo.\nEdit: Si quiero Stompear gente asi no tendria una smurf simplemente me meto a Normal y los reviento en normal que tiene un MMR completamente distinto del de Ranked por si no lo sabias...","replies":[]}]}]}