{"poster":"Calihea","date":"2016-02-28T13:35:09.855+0000","title":"Respondiendo preguntas! #3","subforum":"Guias y consejos","embed":{"description":"Gracias por comunicarse con la Clínica del Dr. Calihea. Si desea preguntar por qué sigue en Bronce, marque 1. Si gusta saber en qué servidor juego, marque 2. Si conoce el número de interno, márquelo. Si no, espere y será atendido. BIENVEDISOA A LA CLINIC LDM DR CALIGHJK PARTE 3!","url":"https://www.youtube.com/watch?v=m9dtL2roue0","image":"https://i.ytimg.com/vi/m9dtL2roue0/hqdefault.jpg"},"up_votes":10,"down_votes":0,"body":"Buenos d&iacute;as, amigos. En esta emisi&oacute;n de la Cl&iacute;nica del Dr. Calihea vamos a ver:\r\n\r\n-Por qu&eacute; flameo?\r\n-Flamer/Troll/AFK en mi equipo. C&oacute;mo revierto la situaci&oacute;n?\r\n-C&oacute;mo y cu&aacute;ndo es conveniente hacer Split-push?\r\n-Me madeo mucho. Est&aacute; bien?\r\n-Me chupa todo un huevo. Est&aacute; mal?\r\n-Unranked to Diamond.\r\n-Jungle Rumbla, viable?\r\n\r\nEspero les guste!","replies":[{"poster":"Asturios","date":"2016-02-28T16:20:38.682+0000","up_votes":3,"down_votes":0,"body":"Primero que nada me encanta ver un argentino haciendo videos de LoL, escuchar esa forma de hablar caraterística de acá se siente muy familiar y agradable. Además que estoy cansado de tener que escuchar el acento de los españoles, no me termino de acostumbrar. Y más allá de eso me gustó mucho el video en general. Me suscribo a tu canal y deseo que crezcas mucho :)\n\nBueno te dejo mi opinión, por ahí es dura pero espero que te sirva. Lo que pasa es que me encanta discutir jajaja\n\n-> La palabra hipocrita fue mal usada. Hipócrita sería que digas que no te gusta Rumble jungla y que lo juegues, por ejemplo. En tu caso si no lo jugaste, opinar del tema sería \"tocar de oido\".\n\n-> Te olvidaste de explicar por qué a Blitzcrank no lo considerás un buen support más allá de las cosas positivas que remarcaste. Es bastante obvio que es por el gancho, si lo erras quedas bastante inutil. Sin embargo tiene un knockup en la E y el silencio de la R especial para cortar ultis como la de Kata. Tanto por tanto tiene más utilidad que Taric por ejemplo, que para ser support su ultimate no tiene ningun tipo de CC.\n\n-> El tema de la penetración de armadura yo lo estuve investigando y es bastante matemático y no depende del campeón que se use. Creo que no se lo puede explicar a la ligera sin dar un pequeño ejemplo. Básicamente la penetración de armadura es eficiente mientras menos armadura tenga el objetivo. Las fórmulas indican que a partir de cierto valor de armadura, a igual cantidad de oro gastado el daño es mayor gastandolo en daño puro o en algun item como ultimo suspiro que disminuye la armadura de forma porcentual.\n\nLa forma que encaraste el flameo, trolls, afk, etc. me pareció muy adecuada. Tomarlo como parte del juego es la mejor forma de verlo.\n\nMe encantó el tema del splitpush, muy bien explicado. Esas son el tipo de cosas que se explican desde la experiencia de juego.\n\nTambién me gustó mucho tu experiencia subiendo de divisiones y ligas. Eso de tener que cambiar tu main de supp a adc para poder hacer un carry más seguro a tu equipo es verdad. La mayoria de eloboosters que veo siempre van adc o mid. Pero claro, hay que saber jugar bien. Jugando adc o mid tenes el poder de carrear muy fuerte o echar a perder la partida en 10 minutos.","replies":[{"poster":"Calihea","date":"2016-02-28T23:30:21.400+0000","up_votes":2,"down_votes":0,"body":"Hola! Me alegro de que te haya gustado, me alegro de que te suscribas y mas me alegro todavía del pedazo de opinión que dejaste abajo. Dura o no dura, respeto ante todo, caballero. \n\n-> Lo de la palabra hipocresía es un buen punto y por lo que googlié parece ser que llevo 2 décadas usándola mal. -15lp y report para mi. \n\n-> Si bien es cierto que al Blitz todavía le queda el knock up de la E y la ulti (que además, por lo que buildeas termina teniendo muy poco tiempo de CD) me sigue pareciendo que a la hora de hablar de peel se queda corto en relación a otros personajes del mismo rol. Slow + stun gratis + bloqueo de daño + bonus de armadura + knock up y slow del Braum. El slow + posible doble stun, el heal y velocidad de movimiento de la W y la ulti del Bardo. El knock up de la Q, el heal+velocidad+daño de la W, el slow + daño extra de la E y la ulti de la Nami. Creo que con esos ejemplos se entiende lo que quiero decir. El Blitz tiene recursos para hacer peel pero creo que hay campeones con los que la misma acción puede ser mucho mas sencilla de realizar con menores riesgos. \n\n-> Si, el asunto de la penetración de armadura es mas delicado y requiere de muchas especificaciones pero me parece muy circunstancial como para dedicarle un párrafo aparte. Traté de enfocarme mas en explicar un poco los resultados que el modo en el que funciona la penetración. Pero es cierto que a fin de sacarle el mayor provecho posible a algo, entender como funciona es casi primordial. \n\n-> No hay otra manera. Cuando entendés eso empezás a jugar un juego distinto jajaja.\n\n-> Otra cosa que no mencioné en este video en particular pero que dije en la gran parte de los otros es el tema de la prueba y error. Entender hasta dónde podés ir con X campeón va a hacer que el splitpush sea mas o menos efectivo. Si salí 10-0 de la línea con Jax pero me da miedito encarar a 2 del equipo contrario o si me lo buildeé como el orto, de poco va a servir.\n\nY lo de cambiar la main A MI me fue efectivo. Ojo, discutiría en otro momento el tema de los roles que tienen mas o menos potencial de carry (para mi todos los roles tienen potencial de carry), lo hice por la división en la que estaba. Hoy en día si te toca un BUEN carry, de esos que te hacen un asado abajo del agua, podés carrear de support. Obviamente que el que termina matando a todo el mundo es la persona a la que le estás cuidando la espalda, pero tu función fue allanarle el terreno para que el se luzca. Tu función también fue wardear la zona de Barón que terminamos haciendo por tener ventaja de visión. Vos carreaste como soporte cuando wardeaste bien en fase de líneas y el otro equipo no tuvo nunca la oportunidad de hacer un 3v2. Es un laburo silencioso pero muy efectivo. \n\nEn fin, te agradezco mucho el comentario y espero ver mas en el futuro!","replies":[]}]},{"poster":"DJ Peligro","date":"2016-02-28T20:45:08.355+0000","up_votes":1,"down_votes":0,"body":"Excelente {{summoner:31}}","replies":[]},{"poster":"Avenír","date":"2016-02-28T19:07:46.325+0000","up_votes":3,"down_votes":6,"body":"Y vos quien sos ? xd","replies":[]},{"poster":"Bienzahar","date":"2016-02-28T17:25:23.434+0000","up_votes":3,"down_votes":6,"body":"Quien te conoce?","replies":[]}]}