{"poster":"Deapimp","date":"2015-01-09T17:54:10.731+0000","title":"Vegyetek erősebb PC-t, vagy ne játssz ranked játékot.","subforum":"Minden egyéb","up_votes":2,"down_votes":2,"body":"Nem tudom mostanában mi van itt a szerveren de egyre több ilyennel találkozom, hogy lol-ra hivatkoznak, hogy milyen szar, meg fps-lagg és hasonlók.\r\n2 hét alatt több alkalommal is azzal találkoztam, hogy TF- top nem akar jönni, kérdezzük miért? válasz: \"magyar srác\" én nem megyek tf közelébe mert 10-15 fps-em van, kérdem én akkor miért játszol rangsorolt játékot? Ennek mi értelme van? Értem én, hogy szeretne előrébb jutni de így, hogy akar? csak azt várja, hogy 5v4 be a többi megnyerje neki a játékot? \r\nMásik eset: tf jön a jungles egy helyben áll semmit nem csinál, meghal utána report rito fps lagg omg faking rito 5 fps. Kérdem: ez a riot hibája, hogy neki  fo... a gépe?  Kb semmi gépigénye van a játéknak. \r\nJó lenne ha aki tudja, hogy ennyire rosszul megy neki a játék az inkább ne mennyen rangsorolt játékot.\r\nKezdj el spórolni, cigi helyett meg buli helyett vegyél gépet amin tudsz játszani.\r\n\r\nRage OFF","replies":[{"poster":"M4dr4c","date":"2015-01-09T19:02:49.713+0000","up_votes":1,"down_votes":0,"body":"Arra nem gondoltál, hogy esetleg a pálya felújítása előtt jól futott neki és csak azóta rossz? De abban egyetértek, ha így fut neki ne menjen rankedre.","replies":[{"poster":"Deapimp","date":"2015-01-09T19:35:32.985+0000","up_votes":1,"down_votes":0,"body":"Értem, csak akkor rankedre ne mennyen, másik 9 ember játékát teszi ezzel tönkre.","replies":[{"poster":"M4dr4c","date":"2015-01-09T22:33:39.465+0000","up_votes":1,"down_votes":0,"body":"Nem ezt írtam én is?","replies":[]}]}]},{"poster":"Tomasz cool","date":"2015-01-09T20:17:15.126+0000","up_votes":1,"down_votes":0,"body":"Teljes mértékben egyetértek veled.\n\nIgaz az új, felújított pályát nem tudtam még kipróbálni a korábbi gépemen (ami egy 2009-as konstrukció és akkor is csak középkategóriás volt ), de a régi map szinte zökkenőmentesen futott közepes grafikai beállítások mellett. Én nem értem hogy akinek fps laggjai vannak, az min játszik?! \nMeg az új mapot ne egy ranked meccsen próbálja ki a mókus.","replies":[]}]}