{"poster":"MILFortune","date":"2019-10-21T23:11:38.370+0000","title":"Fua loco 23 minutos para jugar contra bots jaja ¿qué es este server?","subforum":"Problemas Técnicos","up_votes":10,"down_votes":0,"body":"{{sticker:zombie-nunu-hearts}}","replies":[{"poster":"Metalenzo","date":"2019-10-21T23:37:50.511+0000","up_votes":5,"down_votes":0,"body":"estoy jugando en BR y la verdad es que alla es MUCHO MEJOR QUE ACA.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Mahoko","date":"2019-10-21T23:22:49.009+0000","up_votes":5,"down_votes":0,"body":"sirve de algo preguntar cosas aca? alguien de riot responde? 2 dias de queues eternos? estamos celebrando los 10 años con los mismos servidores del 2009 :P?","replies":[]},{"poster":"Kronosss100","date":"2019-10-21T23:36:08.586+0000","up_votes":2,"down_votes":0,"body":"Uno muy especial, en el mal sentido.\nNada mas lindo que esperar casi 10 minutos para jugar 1 partida y que el ping te suba a 500, te baje a 90 para despues subir de nuevo a 510.","replies":[{"poster":"Alfa19935","date":"2019-10-22T02:13:30.499+0000","up_votes":1,"down_votes":0,"body":"A mi ayer domingo para entrar denoche inicie secion a las 21:40 y me lo habrio el cliente a las 22:05 estava re furioso. Estan meta hablar de que sacaran 5 juegos. Y en ves de procuparse por mejorar su juego mas popular mejorar los server para que mas gente entre etc.No como lei un comentario mas arriba siguen con los servers del 2009 y seguro que si. No lo duden. Porque no puede ser que cada vez que alla un evento los servers se caigan. Y es solo en LatinoamericaSur. En Norte america, europa, y todo el lado asiatico no pasa eso. Acaso que nos ven como unos del monton que les da lo mismo si tenemos server o no. La verdad una mierda todo eso.Y ademas no solo demora en entrar sino que despues solo puedes jugar normales o contra bot. El modo aram y el de bosque no se puede jugar. Y ensima juegas una partida normal y con suerte no te cierra el cliente, porque 1 o 2 veses durante la partida se va el ping por las nubes y te desconecta asi de la nada.Y claro al final juegas una mala partida por culpa de la desconeccion y claro ruegas porque no se cierre el cliente porque para entrar despues son 20 minutos para cuando entras ya termino la partida y te sancionan por salirte de una partida y te tienes que comer una sanción que no tiene sentido.","replies":[]}]}]}