{"poster":"ZzEluzZ","date":"2015-10-10T12:51:48.714+0000","title":"Me da miedo cargar RP por \"pago en efectivo\"","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"estoy pensando cargar RP por medio de &quot;pago en efectivo&quot; como &quot;pago facil&quot; o &quot;rapipago&quot; etc. pero no me animo porque pienso que podr&iacute;a haber un error y perder&iacute;a mi dinero. &iquest;alguien que haya comprado RP por algunos de los medios ya mencionados? si hay. pls d&iacute;ganme como deber&iacute;a hacerlo para que no haya ning&uacute;n problema.. Gracias. {{champion:119}}","replies":[{"poster":"ZzEluzZ","date":"2015-10-10T17:17:17.720+0000","up_votes":1,"down_votes":0,"body":"Gracias por aclarar mi duda :3 capaz se regale una cajita... jaja ;)","replies":[]},{"poster":"Keep CaIm","date":"2015-10-10T15:19:36.297+0000","up_votes":1,"down_votes":0,"body":"Es seguro man, lo unico feo es que no se te carga al instante debes esperar un plazo entre 48 horas para que te llegue, te recomiendo que pagues durante la semana ya que los fines de semana hay trafico en las tarifas, y si tienes dudas solo guarda el tikect y listo tu dinero esta seguro, cargo rp de esa forma siempre","replies":[]},{"poster":"feed no jutsu","date":"2015-10-10T15:16:02.354+0000","up_votes":1,"down_votes":0,"body":"Es seguro, lo malo es que tenés que pagar el doble porque cof cof cof... inflación.","replies":[]},{"poster":"potato support","date":"2015-10-10T14:20:22.133+0000","up_votes":1,"down_votes":0,"body":"te diria que si tenes tarjeta es mas recomendable, ya que estarias pagando el doble de dinero por rapipago por casi menos rp.\n\nlos dos metodos son seguros.","replies":[]},{"poster":"YanXi","date":"2015-10-10T14:14:26.342+0000","up_votes":1,"down_votes":0,"body":"Es seguro no hay ningun problema ya lo he usado a ese metodo como 4 veces sin ningun problema por ahora\n\n-Saludos","replies":[]},{"poster":"Kyousuke","date":"2015-10-10T13:49:27.841+0000","up_votes":1,"down_votes":0,"body":"es el método mas fácil y seguro creo yo, hay algunos casos (muy pocos y difíciles) que tuvieron problemas pero yo hasta ahora nunca tuve problemas y no tarda ni 1 día. eso si despues de pagar la boleta guardala y guarda el ticket por cualquier cosa","replies":[]},{"poster":"Pollos Hnos","date":"2015-10-10T13:15:22.668+0000","up_votes":1,"down_votes":0,"body":"Es totalmente seguro,  Yo cargo rp por ese metodo siempre,  lo único que tenes que hacer es imprimir tu boleta e ir a pagarla en el lugar que elegiste, con decirte que en 12 hs siempre recibi mi rp por eso no demora tanto, pero si queres cargar hoy los vas a recibir recién el martes por que debes esperar días hábiles","replies":[]},{"poster":"Lemon Roots ","date":"2015-10-10T12:58:53.667+0000","up_votes":1,"down_votes":0,"body":"Yo uso este método para comprar RP, es simple, solo debes completar los datos que te pide que no es casi nada, solo el email y el nombre, y luego debes imprimir el boleto de transacción, andas a un pago facil o rapipago o las otras opciones que indica el boleto, y listo los pagas y en 1 o 2 días te llegan los RP :)\n\nSaludos.","replies":[]}]}