{"poster":"Prollyraceist","date":"2019-05-22T06:59:21.998+0000","title":"Kai sa ARAM","subforum":"Gameplay","up_votes":19,"down_votes":3,"body":"Anyone else getting blown up by her W on aram when she goes  AP","replies":[{"poster":"El Condor Pasa","date":"2019-05-22T09:21:05.535+0000","up_votes":16,"down_votes":0,"body":"Kaisa has +12% damage dealt for some reason.","replies":[{"poster":"KFCeytron","date":"2019-05-22T09:28:18.582+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=El Condor Pasa,realm=NA,application-id=3ErqAdtq,discussion-id=KV937cNY,comment-id=0002,timestamp=2019-05-22T09:21:05.535+0000)\n>\n> Kaisa has +12% damage dealt for some reason.\n\nThat seems wholly unnecessary...","replies":[]},{"poster":"ConDiQuyenChinh","date":"2019-05-22T21:26:41.160+0000","up_votes":1,"down_votes":0,"body":"You forgot to mention {{champion:76}}  who has one of the most obnoxious poke in the mode with SUSTAIN also received a 15% damage buff, because she is bad at \"all ining\" and clearly needs to have the damage to instantly blow someone up on top of what she was already able to do.\n\nAlso don't give champs that has CD resets on kill like {{champion:55}} buffs in ARAM, she still sucks against cc heavy / tank comp while completely annihilate everything else.\n\nAnd where are the nerfs for {{champion:555}} {{champion:518}} {{champion:110}}{{champion:81}}   Riot? \n\nAlso {{champion:83}} nerfs??? I have to laugh that champ was already meme tier before the changes.\n\nI'm fine with no ARAM bans but please don't give buffs/nerfs to champs that don't deserve them.","replies":[]}]},{"poster":"HP Crookshanks","date":"2019-05-22T09:09:06.362+0000","up_votes":12,"down_votes":1,"body":"They buffed some of the decent champions and made them broken. Riot is weird.","replies":[{"poster":"letsfeedtogether","date":"2019-05-22T09:28:30.044+0000","up_votes":2,"down_votes":6,"body":"kaisa had like 42% wr before the buffs.\n \nriot mort/mortdog twitter for this infro","replies":[{"poster":"HP Crookshanks","date":"2019-05-22T09:52:59.854+0000","up_votes":16,"down_votes":1,"body":"Some champions have low win rate because people don't know how to play or build them.","replies":[{"poster":"Anu3isII","date":"2019-05-22T13:47:51.888+0000","up_votes":3,"down_votes":0,"body":"Idk about the Win Rate of Kog, but I see that a lot of people don't even think about building him AP, even in cases where it would be necessary for an AP caster to clear waves or deal with Armor stacking.","replies":[]},{"poster":"Nhika","date":"2019-05-22T15:49:47.671+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=HP Crookshanks,realm=EUW,application-id=3ErqAdtq,discussion-id=KV937cNY,comment-id=000000000000,timestamp=2019-05-22T09:52:59.854+0000)\n>\n> Some champions have low win rate because people don't know how to play or build them.\n\nFinally someone that understands that winrate in league means jack shit.","replies":[{"poster":"letsfeedtogether","date":"2019-05-22T16:10:11.447+0000","up_votes":1,"down_votes":1,"body":"Win rate dosent mean it all. But it does not something and thats why riot balance things with win rate. (Proof in mortdog twitter) \n\nAram kaisa isnt that strong  i avree her w can be but her other kit isnt really good in aram","replies":[]}]},{"poster":"Syrile","date":"2019-05-22T10:03:16.262+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=HP Crookshanks,realm=EUW,application-id=3ErqAdtq,discussion-id=KV937cNY,comment-id=000000000000,timestamp=2019-05-22T09:52:59.854+0000)\n>\n> Some champions have low win rate because people don't know how to play or build them.\n\nThat is most of the champions in ARAM.\nEveryone just wants the busted ones.\n\nSome have kits that really cannot be fixed for ARAM. You are either ridiculously good with them and can win, or they fail no matter what (unless you make them unkillable and insta-burst damage I suppose?).\n\nBalancing ARAM is silly.\nLetting Riot's \"balance\" team touch anything is even more absurd.","replies":[]}]}]}]},{"poster":"Eldeazar","date":"2019-05-22T13:39:31.662+0000","up_votes":7,"down_votes":0,"body":"Yes. Kai Sa AP with Dark Harvest is a low effort impactful gameplay in ARAM because her \"poke\" is way too strong. Far stronger than things like xerath or lux","replies":[{"poster":"PB4UAME","date":"2019-05-22T20:31:40.415+0000","up_votes":3,"down_votes":0,"body":"The ludicrous +***12 FUCKING PERCENT EXTRA DAMAGE ON EVERYTHING SHE DOES*** RiTo slapped on her for no reason on ARAM certainly isn't helping fucking anything, especially with most tanks and bulkier targets now taking between 5-15% extra incoming damage, which, in the worst case, causes Kai'sa to hit for 131.76% as much damage as she's supposed to.\n\nRIOT needs to fuck off with these nonsensical, unbalanced, and frankly massively biased \"adjustments\" to champions in ARAM.  No, we didn't need fucking more damage from ADCs and poke champions, and for tanks and defensive champions to do less and take even more damage.  Fuck off with all that bullshit.","replies":[]}]},{"poster":"Cronofuge","date":"2019-05-22T13:29:02.318+0000","up_votes":5,"down_votes":0,"body":"She had a bad winrate because everybody played her adc or on-hit but that wasn't easy to pull off.  Turns out the right call was to build straight AP and you could actually solo poke the enemy team out if they didn't have a warmogs tank.  Right around the time people were figuring out to build straight ap on her in aram, the nerf to long range spells came through.  This made AP feel terrible to play.  So bad that they hotfixed her to have +15% damage to offset the 900+ range damage nerf.  This not only made adc/on-hit kai'sa extremely good due to poke champions getting nerfed, but made the melee champs she counters pop up more often due to overall aram changes.\n\nThis turned out to be a bit much so the peeled back 3% to end up at 12% but with the range damage reduction being buffed to 1000+ range from 900 range, AP kai'sa feels mostly unchanged from her extremely strong original state.  ADC/on-hit kai'sa are strictly better than before, and any AP kai'sa W's within 1000 range are also strictly better than before, even though she could single handedly win games pre-aram changes.  She probably needs looking at.","replies":[]},{"poster":"PaffWasTaken","date":"2019-05-22T12:17:28.290+0000","up_votes":5,"down_votes":0,"body":"For some reason, she has one of the biggest damage buffs anyone in ARAM has. It makes no sense at all, since every ADCs are top tier and that she is one of the few with huge poke, so she basically fits the ARAM meta perfectly. This is pure and utter favoritism from Riot, the only reason Kai'Sa's ARAM winrate is that low is because people who first pick her up literally ult in every occasion they have.","replies":[{"poster":"Daddy Ants","date":"2019-05-22T19:44:00.605+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=PaffWasTaken,realm=NA,application-id=3ErqAdtq,discussion-id=KV937cNY,comment-id=0004,timestamp=2019-05-22T12:17:28.290+0000)\n>\n> For some reason, she has one of the biggest damage buffs anyone in ARAM has. It makes no sense at all, since every ADCs are top tier and that she is one of the few with huge poke, so she basically fits the ARAM meta perfectly. This is pure and utter favoritism from Riot, the only reason Kai'Sa's ARAM winrate is that low is because people who first pick her up literally ult in every occasion they have.\n\nOnly ADC whos \"top tier\" in aram that isn't Kai'sa is Jhin.","replies":[{"poster":"PaffWasTaken","date":"2019-05-22T19:47:06.813+0000","up_votes":6,"down_votes":0,"body":"I don't know what you are talking about man, {{champion:202}} {{champion:222}} {{champion:15}} {{champion:22}} {{champion:96}} {{champion:51}}  and {{champion:21}}  are all above 54% winrate which, in a \"\"\"\"\"RANDOM\"\"\"\"\" gamemode, is quite freaking insane","replies":[{"poster":"PB4UAME","date":"2019-05-22T20:42:31.069+0000","up_votes":4,"down_votes":0,"body":"Because, quite simply, for the last, oh, 6-7 years or so, ADCS have been bar none the strongest, most powerful and most influential role on the entire game, on new champion design, on item balance, on METAs, on map rotation, allowed map strategy (no more  2 v 1s as that let ADCS be too over powered and ignore early towers/laning entirely; early drake focus, early jungle focus, no non-ADCs allowed to be viable in bot lane [collective bitching and whining instantly nerfed that after less than two weeks when RIOT last tried to open bot lane up to more than literally only the one single sub class that is far stronger than everyone else] no more split pushing as that invalidated the ADC and their need for sieging in 5 man pushes, so we cannot let that be a viable tactic, +backdoor shielding, +free ranged damage to ADCs/APC against towers + more abilities (like trist E, Ez's new skill, etc) suddenly allowed to be used on towers to let them out push champions like Yorick, and Nasus who had similar pushing power by being able to use their aa empowers on towers as a formerly unique mechanic) and basically the entire game as a whole is balanced from the perspective of ADCs as the indisbutable, kings of League of Legends, that have the entire game catered to their playstyle, prefferences and existence over literally every single role, champion, and other lane in the entire fucking game.\n\nNo shit they have higher winrates than 90% of all other champions even when just talking about the average of all ADC winrates on other modes, not even comparing the top ADCs to other champions (in which case they are better than 99% of all other champions), just their average.  They are far stronger, scale harder, are safer, and frankly are even easier to play than other champions, so of course, all else equal, they will win far more games than other champions.  Even in the hands of first timers and novices they will out perform others consistently.","replies":[]}]}]}]},{"poster":"FSRER","date":"2019-05-22T18:09:45.649+0000","up_votes":3,"down_votes":0,"body":"Balancing at aram is bullshit anyways. You have champions like kaisa who do 12% more dmg for no reason so does  zed and many others without taking more dmg... I don't get it, really.","replies":[]},{"poster":"Syrile","date":"2019-05-22T09:11:32.437+0000","up_votes":3,"down_votes":0,"body":"This is Riot's \"balance\" team at its finest.","replies":[]},{"poster":"Icy Hot Shoto","date":"2019-05-22T17:01:08.565+0000","up_votes":2,"down_votes":0,"body":"But we got that damage reduction, remember? So clearly it's not THAT bad!\n\nI say, as I play AP Kai'Sa every time in aram, and watch as whoever I just hit lose half their health even though the damage reduction shield popped up.\n\nYeah, really great balance changes there Riot.","replies":[]},{"poster":"Jaspers","date":"2019-05-22T10:41:29.786+0000","up_votes":2,"down_votes":0,"body":"From fog of war with Luden's, passive and a 50% cooldown reset as well. I'd take Vel'Koz on ARAM over Kai'Sa hiding offscreen anyday (he's still above 50% apparently but has taken a hit of about 10-8% in win rate since their balancing started).","replies":[]}]}