{"poster":"Nindusu","date":"2019-01-09T01:19:34.930+0000","title":"Mit Master Yi bis Diamond kommen?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":4,"body":"Ich gewinne mit master yi so gut wie jedes game. bin gerade silber da ich erst n&auml;chste season weiter  spielen werde. Es wird zwar etwas langweilig sein aber yi ist der einzige mit dem ich carrien kann wenn ich khazix spiele mache ich genauso viele kills so 20/5 und verliere trotzdem. Ich verstehe das system nicht. Schaut mal meine letzten games an yi war fast immer free win. yi ist doch gerade zu op? Nur wenn eine lane nicht feded dann gewinne ich mal mit anderen champs. Ich gehe halt fast immer bot ab lvl 6 und versuche double kill das ist meine taktik mit yi und auch wenn ich mal fede sobald ich bisschen ks mache bin ich wieder drinne und ez penta.\n{{champion:11}} ","replies":[{"poster":"biohazard27","date":"2019-01-09T02:50:59.665+0000","up_votes":4,"down_votes":0,"body":"auch werden die leute anfangen um die schwächen von master yi zu spielen. eine gut gesetzte cc & dein champ platzt auf wie ne piniata. je höher du kommst wirst du deine spielweise anpassen müssen & um die gefährlichen spells deiner gegner rumspielen müssen.","replies":[]},{"poster":"Alpacana","date":"2019-01-09T02:22:27.580+0000","up_votes":3,"down_votes":0,"body":"Mag in Silber noch funktionieren. Champions scalen aber mit dem Spielverständnis des Benutzers (und der anderen Spieler).\nJe höher du kommst umso weniger Fehler werden also die Gegner machen und umso schwerer wird es für dich werden bis zu einem Punkt wo deine \"Level 6 Taktik\" nicht mehr funktionieren wird da Gegner anfangen defensiv zu spielen oder evtl der gegnerische Jungler counterganked.\n\nSoll aber nicht heißen, dass es unmöglich ist mit Yi only nach Diamond zu kommen. Generell ist es mit jedem Champ möglich, vorausgesetzt du bist gut genug.","replies":[{"poster":"ImTheFox115","date":"2019-01-09T05:04:01.428+0000","up_votes":2,"down_votes":0,"body":"Ob Gold soviel besser ist als Silber wage ich zu bezweifeln...","replies":[{"poster":"Uranbrennstab","date":"2019-01-09T09:59:14.449+0000","up_votes":1,"down_votes":0,"body":"Nein ist es nicht","replies":[{"poster":"Cenâreth","date":"2019-01-09T13:09:00.971+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=000000000000,timestamp=2019-01-09T09:59:14.449+0000)\n>\n> Nein ist es nicht\n\nPlatin auch nicht wie ich gehört hab und dass untere Dia soll ja auch recht disgusting sein.","replies":[{"poster":"Skagerak","date":"2019-01-09T13:21:55.373+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=0000000000000000,timestamp=2019-01-09T13:09:00.971+0000)\n>\n> Platin auch nicht wie ich gehört hab und dass untere Dia soll ja auch recht disgusting sein.\n\nNaja es hat schon seine Gründe warum Spieler in Silber sind und nicht in Platin oder Gold geschweige denn Diamant. Die Unterschiede sind schon riesig auch wenn man Sie im direkten Gameplay beim zuschauen kaum sieht.  Allein der Unterschied zwischen Low Dia und Low Platin ist unglaublich groß vorausgesetzt der Dia Spieler hat sich auch selbst dorthin gespielt. Wenn du ein Spiel von Dia und Master nebeneinander schauen würdest, würdest du auch da keine riesigen Unterschiede sehen können obwohl die sehr wohl da sind. \n\nDas kann man aber eben erst beurteilen wenn man selbst mal ne längere Zeit in diesen Elos gespielt hat. Einmal gegen nen Dia oder Platin Spieler zu spielen und daher seine Meinung zu bilden ist doch sehr dürftig, geschweige denn vom Hörensagen und auch wenn man im Normal game mal gegen solche spielt sagt das sehr wenig über diese Elos aus.\n\nWenn es stimmen würde das ja fast alle gleich schlecht sind, warum sind dann nicht alle in Diamant ?","replies":[{"poster":"Cenâreth","date":"2019-01-09T13:41:41.944+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=00000000000000000000,timestamp=2019-01-09T13:21:55.373+0000)\n>\n> Naja es hat schon seine Gründe warum Spieler in Silber sind und nicht in Platin oder Gold geschweige denn Diamant. Die Unterschiede sind schon riesig auch wenn man Sie im direkten Gameplay beim zuschauen kaum sieht.  Allein der Unterschied zwischen Low Dia und Low Platin ist unglaublich groß vorausgesetzt der Dia Spieler hat sich auch selbst dorthin gespielt. Wenn du ein Spiel von Dia und Master nebeneinander schauen würdest, würdest du auch da keine riesigen Unterschiede sehen können obwohl die sehr wohl da sind. \n> \n> Das kann man aber eben erst beurteilen wenn man selbst mal ne längere Zeit in diesen Elos gespielt hat. Einmal gegen nen Dia oder Platin Spieler zu spielen und daher seine Meinung zu bilden ist doch sehr dürftig, geschweige denn vom Hörensagen und auch wenn man im Normal game mal gegen solche spielt sagt das sehr wenig über diese Elos aus.\n> \n> Wenn es stimmen würde das ja fast alle gleich schlecht sind, warum sind dann nicht alle in Diamant ?\n\nReden wir von Season 1 - 7 oder von der jetzigen Season? Es ist richtig dass er sich dort hingespielt hat, es ist aber aktuell kein Qualitätsunterschied zwischen Silber und Dia erkennbar. Außer du meinst den Qualitätsunterschied im Flamen. Es kristallisieren sich nur aktuell vereinzelte mechanisch gut spielende Spieler in allen Elo Bereichen heraus. Aber auch nur weil jeder den selben Champ spielt. Ekko, Leblanc, Jax, Yi, Nasus, Trynda. Ich seh sonst keinen Qualitätsunterschied und ich schau auch recht regelmäßig viele Dia/Master Spieler auf Twitch zu.","replies":[{"poster":"Skagerak","date":"2019-01-09T14:09:14.719+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=000000000000000000000000,timestamp=2019-01-09T13:41:41.944+0000)\n>\n> Reden wir von Season 1 - 7 oder von der jetzigen Season? Es ist richtig dass er sich dort hingespielt hat, es ist aber aktuell kein Qualitätsunterschied zwischen Silber und Dia erkennbar. Außer du meinst den Qualitätsunterschied im Flamen. Es kristallisieren sich nur aktuell vereinzelte mechanisch gut spielende Spieler in allen Elo Bereichen heraus. Aber auch nur weil jeder den selben Champ spielt. Ekko, Leblanc, Jax, Yi, Nasus, Trynda. Ich seh sonst keinen Qualitätsunterschied und ich schau auch recht regelmäßig viele Dia/Master Spieler auf Twitch zu.\n\nDas hab ich gemeint \"ich habe es bei dem gesehen wie Dia spielt\" \"ich hab von dem gehört das Dia so spielt\" du selbst weißt es doch trotzdem nicht. Wie willst du das auch beurteilen wenn du selbst nie in diesen Elos gespielt hast. Ich hab doch sogar schon erklärt warum das so aussieht nur weil ich keinen Unterschied im Gameplay zwischen Dia und Master sehe heißt das nicht das ich so gut bin wie Master. Das zeigt eher das ich viel zu schlecht bin und vollkommen unfähig auch nur ansatzweise zu verstehen was eben die Unterschiede zwischen den Ligen sind weil das auf einem vollkommen anderem Niveau ist. Dasselbe ist auch der Fall bei den anderen Ligen, du kannst gar nicht sehen was die High Elo Spieler besser machen da dir einfach Unmengen an Wissen fehlt um das beurteilen zu können.\n\nDas macht überhaupt keinen Sinn was du sagst.","replies":[{"poster":"Cenâreth","date":"2019-01-09T14:18:52.709+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=0000000000000000000000000000,timestamp=2019-01-09T14:09:14.719+0000)\n>\n> Das hab ich gemeint &quot;ich habe es bei dem gesehen wie Dia spielt&quot; &quot;ich hab von dem gehört das Dia so spielt&quot; du selbst weißt es doch trotzdem nicht. Wie willst du das auch beurteilen wenn du selbst nie in diesen Elos gespielt hast. Ich hab doch sogar schon erklärt warum das so aussieht nur weil ich keinen Unterschied im Gameplay zwischen Dia und Master sehe heißt das nicht das ich so gut bin wie Master. Das zeigt eher das ich viel zu schlecht bin und vollkommen unfähig auch nur ansatzweise zu verstehen was eben die Unterschiede zwischen den Ligen sind weil das auf einem vollkommen anderem Niveau ist. Dasselbe ist auch der Fall bei den anderen Ligen, du kannst gar nicht sehen was die High Elo Spieler besser machen da dir einfach Unmengen an Wissen fehlt um das beurteilen zu können.\n> \n> Das macht überhaupt keinen Sinn was du sagst.\n\nIch hab in meinen Normal Spiele auch schon direkt gegen Platin und Dia auf der Bot spielen dürfen und ich konnte als Silber Spieler nicht nur mithalten sondern großteils den Gegner auch dominieren. Mir sagen auch viele Platin Spieler nach dass ich in Silber nichts verloren habe sondern viel weiter höher angesiedelt sein sollte, sollen die jetzt im Unrecht sein weil es so ist oder weil es wer anderer gesagt hat?\n\nWas die meisten Master Spieler besser machen? teilweise nichts außer dass roamen und das Warden und möglicherweise Knowledge über den Champ gegenüber aber ich kenne z.B. keinen Master Spieler der eine Lösung hat wie er gegen Karthus APC spielt und genau dasselbe können auch die Silber Spieler nicht. Das Roamen und Warden können viele Silber Spieler auch nicht geb ich dir Recht, es gibt aber auch genügend Silber Spieler die es können dadurch ist ja auch der Qualitätsunterschied gar nicht richtig zwischen den Klassen erkennbar, nur weil einer Master ist, muss er nicht gleich wie Master spielen, genauso wie nicht einer der Silber ist nicht gleich wie Silber spielen muss. Solange er die Champs spielt, die gerade in Meta sind gegen den andere nicht klar kommen und er in selber beherrscht, wird er auch climben. Ich z.B. bin mechanisch schlecht auf Zed, trotzdem schaffe ich es wenn ich ihn spiele mit ihm 8 Kills rauszuholen. Wo ist die Saison hinverschwunden wo man mit Zed noch mechanisch besser spielen musste um an diese 8 Kills ran zu kommen?","replies":[{"poster":"Skagerak","date":"2019-01-09T14:29:36.594+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=00000000000000000000000000000000,timestamp=2019-01-09T14:18:52.709+0000)\n>\n> Ich hab in meinen Normal Spiele auch schon direkt gegen Platin und Dia auf der Bot spielen dürfen und ich konnte als Silber Spieler nicht nur mithalten sondern großteils den Gegner auch dominieren. Mir sagen auch viele Platin Spieler nach dass ich in Silber nichts verloren habe sondern viel weiter höher angesiedelt sein sollte, sollen die jetzt im Unrecht sein weil es so ist oder weil es wer anderer gesagt hat?\n\nDas sind genau die Punkte die ich auch angesprochen habe. Du kannst nicht sagen wie gut Platin oder Dia ist nur weil du mal gegen die auf der Botlane gespielt hast, wahrscheinlich waren die dann auch noch offrole ohne main Champion ist klar das die dann nicht so gut spielen. Wenn ich ADC in Silber spielen würde könnte man mich auch auf der Lane besiegen da ich die Rolle nicht spiele das game würde ich aber trotzdem gewinnen weil ich einfach viel mehr weiß was das Macro  angeht. \n\nAlso bitte welcher Platin Spieler soll das gesagt haben ? und dann bestimmt auch noch nach 1 game wo er dich mal gesehen hat oder ? \nWenn ich mir nur deine Stats anschaue weiß ich schon das du vollkommen hardstuck bist und so niemals aufsteigen wirst. Nach 600 games eine 49% winrate in Silber echt wow...... Sogar nur 45% als Adc nach 226 games......... du hast in keiner Warteschlange eine Winrate von 50%. \nAlso beim besten Willen diese Platin Spieler haben echt nicht auf deine Stats geschaut die erzählen eine vollkommen andere Geschichte als du Sie hier erzählst. \n\nAber lass mich raten das liegt nicht daran das du schlecht bist sondern an den Mitspielern oder ? Du hast alle 600 Ranked games Feeder  flamer und Troller gehabt. Du musst dann wohl das größte Pech der Welt haben.","replies":[{"poster":"Cenâreth","date":"2019-01-09T14:35:02.105+0000","up_votes":1,"down_votes":1,"body":"Wenn du einen Ezreal Main Spieler als Offrole bezeichnest, weil du es nicht glaubst oder glauben willst ist, dass ja deine Sache, aber wir sind hier auch in einem öffentlichen Forum wo jeder seine Meinung austauschen kann, solange es konstruktiv und sachlich bleibt.\n\nPunkt 1, was mir schon mal auffällt in diesem mechanischen Sachen gibt es in den Championbeschreibungen der Champs einen Schwierigkeitsgrad den kann Riot theoretisch schon rauspatchen, weil dass ganze mittlerweile unnötig geworden ist.\n\nNatürlich bin ich vollkommen hardstuck aber dass hat weniger damit zu tun wie ich ADC spiele. Ansonsten würde ich auch Ziggs und Karthus APC abusen. Die Leute beherrschen nicht dass Feeling mit einem ADC zu spielen, hab ich jetzt auch auf meinem 2. Account gemerkt als ich ne Runde durch Jungle gedüst bin.\n\nAber du kannst mir ja mal die Definition von Hard Stuck erklären, weil anscheinend haben wir beide darunter eine ziemlich unterschiedliche Auffassungsgabe was Hard Stuck überhaupt ist und wenn du mal meine Matchhistory wirklich durchleuchtet hättest, wüsstest du dass deine Definition von dem was du gerade geschrieben hast mit dem was ich hier lese ziemlich weit auseinander liegt.","replies":[{"poster":"Skagerak","date":"2019-01-09T14:51:01.032+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=0000000000000000000000000000000000000000,timestamp=2019-01-09T14:35:02.105+0000)\n>\n> Wenn du einen Ezreal Main Spieler als Offrole bezeichnest, weil du es nicht glaubst oder glauben willst ist, dass ja deine Sache, aber wir sind hier auch in einem öffentlichen Forum wo jeder seine Meinung austauschen kann, solange es konstruktiv und sachlich bleibt.\n> \n> Punkt 1, was mir schon mal auffällt in diesem mechanischen Sachen gibt es in den Championbeschreibungen der Champs einen Schwierigkeitsgrad den kann Riot theoretisch schon rauspatchen, weil dass ganze mittlerweile unnötig geworden ist.\n> \n> Natürlich bin ich vollkommen hardstuck aber dass hat weniger damit zu tun wie ich ADC spiele. Ansonsten würde ich auch Ziggs und Karthus APC abusen. Die Leute beherrschen nicht dass Feeling mit einem ADC zu spielen, hab ich jetzt auch auf meinem 2. Account gemerkt als ich ne Runde durch Jungle gedüst bin.\n> \n> Aber du kannst mir ja mal die Definition von Hard Stuck erklären, weil anscheinend haben wir beide darunter eine ziemlich unterschiedliche Auffassungsgabe was Hard Stuck überhaupt ist und wenn du mal meine Matchhistory wirklich durchleuchtet hättest, wüsstest du dass deine Definition von dem was du gerade geschrieben hast mit dem was ich hier lese ziemlich weit auseinander liegt.\n\nIch hab deine Matchhistory gesehen und die ist echt nicht gut. Außerdem hast du seit der Midseason 600 ranked games und bist immer noch Silber also wenn das nicht Hardstuck ist was dann ? Spätestens wenn man sieht das du seit Season 5 Silber bist sieht man das du Hardstuck bist ? Ich glaub eher das du einer der Spieler bist die denken das gute Stats einen auch zu einem guten Spieler machen was nicht stimmt. Wenn du 10/0 aus der lane gehst und das game verlierst dann bist du vielleicht gut auf der Lane aber scheiße im Rest des Spiels. Das macht dich noch lange nicht zu einem guten Spieler.... \n\nDas mit dem Ezreal Spieler versteh ich nicht ganz was willst du damit sagen ? \n\nAußerdem gibt es Unterschiede in der Schwierigkeit zwischen den Champions warum soll Riot den Schwierigkeitsgrad jetzt rauspatchen ? Leblanc ist schwieriger als Amumu das weiß jeder.  Ich versteh nicht ganz was du damit meinst","replies":[{"poster":"Apucalypse","date":"2019-01-09T17:42:04.264+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=00000000000000000000000000000000000000000000,timestamp=2019-01-09T14:51:01.032+0000)\n>\n> Ich hab deine Matchhistory gesehen und die ist echt nicht gut. Außerdem hast du seit der Midseason 600 ranked games und bist immer noch Silber also wenn das nicht Hardstuck ist was dann ? ...\n\nIch muss dir danken. Endlich mal Sinnvolle Kommentare (all deine in diesem Thread) diesbezüglich. Desweiteren noch Sachlich und in einer guten und positiven Form Kritik. Allerdings sind solche Leute meist auch brain mäßig hardstuck.\n\nSie haben lediglich ihre Wahrnehmung und dies mag für sie Wahr aussehen, was es aber eindeutig nicht ist (erkennbar durch die Fakten). Ich muss dir in allen Punkten zustimmen. Jeder sagt, alles unter Dia 2 ist Mist, was witzig ist, da kaum einer dies erreicht bzw. sie selber dadurch Mist sind und die Unterschiede der einzelnen Elos wohl nicht erkennen (fängt schon bei den rotations, roaming, warding, punishment auf Fehler an) . Aber so sind sie, die unverbesserlichen.\n\nAlso noch einmal danke, vielleicht erreicht deine Botschaft Jemanden ! Gewiss !","replies":[{"poster":"Skagerak","date":"2019-01-09T17:46:39.232+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Apucalypse,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=000000000000000000000000000000000000000000000001,timestamp=2019-01-09T17:42:04.264+0000)\n>\n> Ich muss dir danken. Endlich mal Sinnvolle Kommentare (all deine in diesem Thread) diesbezüglich. Desweiteren noch Sachlich und in einer guten und positiven Form Kritik. Allerdings sind solche Leute meist auch brain mäßig hardstuck.\n> \n> Sie haben lediglich ihre Wahrnehmung und dies mag für sie Wahr aussehen, was es aber eindeutig nicht ist (erkennbar durch die Fakten). Ich muss dir in allen Punkten zustimmen. Jeder sagt, alles unter Dia 2 ist Mist, was witzig ist, da kaum einer dies erreicht bzw. sie selber dadurch Mist sind und die Unterschiede der einzelnen Elos wohl nicht erkennen (fängt schon bei den rotations, roaming, warding, punishment auf Fehler an) . Aber so sind sie, die unverbesserlichen.\n> \n> Also noch einmal danke, vielleicht erreicht deine Botschaft Jemanden ! Gewiss !\n\nDanke. Gibt halt leider manche die sind unbelehrbar trotzdem versucht man es immer wieder.","replies":[]}]},{"poster":"Cenâreth","date":"2019-01-09T15:27:16.535+0000","up_votes":1,"down_votes":1,"body":"Mein Gott seh ich aus wie Sion Mains die denken wenn ich jetzt 4/10 aus der Lane gehen kann ich trotzdem 3 Towers Solo holen einen Nexus und einen Inhi? Mir haben auch schon andere zu DuoQ geraten was nicht funktioniert hat, für Flex im 5er Pre Team bin ich ja anscheinend zu gut, was niemand spielen will, also bleibt nur SoloQ übrig weil in Normals bin ich ja auch „hardstuck“ weil irgendwer auf im Jungle einen Trade spielen muss den er nicht kann.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Skagerak","date":"2019-01-09T12:35:19.980+0000","up_votes":2,"down_votes":0,"body":"Ich muss da leider MeMyselfandBall zustimmen. Es ist extrem unwahrscheinlich das du Diamant innerhalb von 1 Season erreichst. Selbst wenn du extrem viel zockst dich immer bemühst und richtig tryhardest brauch man 2 Jahre dafür und das gilt schon als extrem schnell, da die meisten erst gar nicht Diamant erreichen.  Normalerweise solltest du so mit 1 Liga pro Season rechnen und das ist schon ziemlich gut das heißt für dich diese Season Gold nächste Platin und dann Diamant. \n\nIch selbst hab dafür 2 Jahre gebraucht und 3000 games innerhalb dieser 2 Jahre. Ich weiß ja nicht wie viel Zeit du hast aber zu der Zeit hab ich eigentlich nichts anderes gemacht außer zocken, schlafen und mehr oder weniger schule. \n\nImmerhin hast du schon mal einen Plan der sich gut anhört, weswegen ich dir aufjedenfall zutraue Diamant zu schaffen. Doch dazu kommt dann noch ob du das Durchhaltevermögen hast so lang zu spielen und dann noch immer den selben Champion. Auch wenn ein OTP zu sein die schnellste Art ist um aufzusteigen kann es gut sein das dich irgendwann der Ehrgeiz verlässt. Traust du dir wirklich zu 1000 games denselben Champion zu spielen obwohl du nicht mal weißt ob du überhaupt dein Ziel erreichst ? Außerdem bist du jetzt noch in Silber und zuversichtlich wo es viel einfacher ist  aufzusteigen, allein schon dadurch das man Wins bei verloren Promos geschenkt bekommt. Richtig schwierig wird es erst sobald du in Platin angekommen bist, dann gibt es keinen Bonus mehr durch Wins, die Spieler dort sind ziemlich gut und es kommt oftmals nur auf Kleinigkeiten an die du perfektionieren musst um besser zu werden was sehr schwer ist, besonders wenn man alleine spielt und keinen hat der dir über die Schulter schaut. \n\nAußerdem solltest du dir vielleicht wirklich erst mal kleinere Ziele suchen z.B wirklich erstmal Gold schaffen und dann weitersehen damit wirst du nämlich schon genug zu kämpfen haben. Wenn du nämlich schon in Gold Probleme hast verlässt dich schnell die Lust weiter zu tryharden da du ja nicht mal die hälfte des Weges bis Diamant geschafft hast und die härteste Etappe ja sogar erst noch kommt. \n\nManche werden mir hierbei nicht unbedingt zustimmen, aber du musst dich auch von einem Teil des Spaßes verabschieden um wirklich in die High Elo zu kommen musst du nämlich üben üben und üben und das ist ein wesentlicher unterschied zum einfach drauf losspielen. Ich mein du musst hier gegen Leute gewinnen die schon Jahre Erfahrung und hunderte wenn nicht Tausende von games in der High Elo haben. Leute die main Champions haben (und ich mein jetzt nicht \"mains\" aus der Low Elo die grad mal 50 games auf dem Champion haben) sondern welche die wirklich viel über den Champion wissen, nach 1000 games und bis zu einem gewissen Punkt sogar mit High Dia Spielern bis Master mithalten können. \n\nDas ganze Wissen musst du dir in extrem kurzer Zeit aneignen ohne die Lust daran zu verlieren dich weiter verbessern zu wollen und dazu noch über einen längeren Zeitraum konstant spielen zu können damit du dich auch konstant verbesserst. Dazu kommen noch Spielmechaniken welche in der Low Elo gar keine Rolle spielen und über welche du noch nie nachgedacht hast. Der Unterschied zwischen Low und High Elo ist wie Kreisliga und Bundesliga das kann man einfach nicht Ansatzweise vergleichen.  \n\nDas hat am Ende mehr mit Training, Ausdauer und Perfektion zu tun als mit Spaß am game so wie es eben auch bei anderen Sportarten ab einem gewissen Punkt ist. Das wichtigste ist aber Zeit und Durchhaltevermögen nur so kannst du dich lang genug konstant verbessern um Diamant zu kommen und im besten Fall diesen Rang auch immer wieder zu erreichen\n\nMir ist klar das man auch anders Diamant erreichen kann auch mit Spaß und vielen Champions zocken oder verschiedene Rollen mainen etc, aber es dauert eben viel länger und ist extrem selten wenn nicht sogar fast unmöglich. Ich hab zumindest noch keinen kennengelernt der es ohne main lane und main Champions hinbekommen hat.\n\nDas soll dich jetzt nicht abschrecken, es ist aber die harte Wahrheit. Es hat seinen Grund warum nur etwa 0,6% der Spieler Weltweit Diamant erreicht haben.","replies":[{"poster":"Cenâreth","date":"2019-01-09T13:34:22.455+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=0004,timestamp=2019-01-09T12:35:19.980+0000)\n>\n> Ich muss da leider MeMyselfandBall zustimmen. Es ist extrem unwahrscheinlich das du Diamant innerhalb von 1 Season erreichst. Selbst wenn du extrem viel zockst dich immer bemühst und richtig tryhardest brauch man 2 Jahre dafür und das gilt schon als extrem schnell, da die meisten erst gar nicht Diamant erreichen.  Normalerweise solltest du so mit 1 Liga pro Season rechnen und das ist schon ziemlich gut das heißt für dich diese Season Gold nächste Platin und dann Diamant. \n> \n> Ich selbst hab dafür 2 Jahre gebraucht und 3000 games innerhalb dieser 2 Jahre. Ich weiß ja nicht wie viel Zeit du hast aber zu der Zeit hab ich eigentlich nichts anderes gemacht außer zocken, schlafen und mehr oder weniger schule. \n> \n> Immerhin hast du schon mal einen Plan der sich gut anhört, weswegen ich dir aufjedenfall zutraue Diamant zu schaffen. Doch dazu kommt dann noch ob du das Durchhaltevermögen hast so lang zu spielen und dann noch immer den selben Champion. Auch wenn ein OTP zu sein die schnellste Art ist um aufzusteigen kann es gut sein das dich irgendwann der Ehrgeiz verlässt. Traust du dir wirklich zu 1000 games denselben Champion zu spielen obwohl du nicht mal weißt ob du überhaupt dein Ziel erreichst ? Außerdem bist du jetzt noch in Silber und zuversichtlich wo es viel einfacher ist  aufzusteigen, allein schon dadurch das man Wins bei verloren Promos geschenkt bekommt. Richtig schwierig wird es erst sobald du in Platin angekommen bist, dann gibt es keinen Bonus mehr durch Wins, die Spieler dort sind ziemlich gut und es kommt oftmals nur auf Kleinigkeiten an die du perfektionieren musst um besser zu werden was sehr schwer ist, besonders wenn man alleine spielt und keinen hat der dir über die Schulter schaut. \n> \n> Außerdem solltest du dir vielleicht wirklich erst mal kleinere Ziele suchen z.B wirklich erstmal Gold schaffen und dann weitersehen damit wirst du nämlich schon genug zu kämpfen haben. Wenn du nämlich schon in Gold Probleme hast verlässt dich schnell die Lust weiter zu tryharden da du ja nicht mal die hälfte des Weges bis Diamant geschafft hast und die härteste Etappe ja sogar erst noch kommt. \n> \n> Manche werden mir hierbei nicht unbedingt zustimmen, aber du musst dich auch von einem Teil des Spaßes verabschieden um wirklich in die High Elo zu kommen musst du nämlich üben üben und üben und das ist ein wesentlicher unterschied zum einfach drauf losspielen. Ich mein du musst hier gegen Leute gewinnen die schon Jahre Erfahrung und hunderte wenn nicht Tausende von games in der High Elo haben. Leute die main Champions haben (und ich mein jetzt nicht &quot;mains&quot; aus der Low Elo die grad mal 50 games auf dem Champion haben) sondern welche die wirklich viel über den Champion wissen, nach 1000 games und bis zu einem gewissen Punkt sogar mit High Dia Spielern bis Master mithalten können. \n> \n> Das ganze Wissen musst du dir in extrem kurzer Zeit aneignen ohne die Lust daran zu verlieren dich weiter verbessern zu wollen und dazu noch über einen längeren Zeitraum konstant spielen zu können damit du dich auch konstant verbesserst. Dazu kommen noch Spielmechaniken welche in der Low Elo gar keine Rolle spielen und über welche du noch nie nachgedacht hast. Der Unterschied zwischen Low und High Elo ist wie Kreisliga und Bundesliga das kann man einfach nicht Ansatzweise vergleichen.  \n> \n> Das hat am Ende mehr mit Training, Ausdauer und Perfektion zu tun als mit Spaß am game so wie es eben auch bei anderen Sportarten ab einem gewissen Punkt ist. Das wichtigste ist aber Zeit und Durchhaltevermögen nur so kannst du dich lang genug konstant verbessern um Diamant zu kommen und im besten Fall diesen Rang auch immer wieder zu erreichen\n> \n> Mir ist klar das man auch anders Diamant erreichen kann auch mit Spaß und vielen Champions zocken oder verschiedene Rollen mainen etc, aber es dauert eben viel länger und ist extrem selten wenn nicht sogar fast unmöglich. Ich hab zumindest noch keinen kennengelernt der es ohne main lane und main Champions hinbekommen hat.\n> \n> Das soll dich jetzt nicht abschrecken, es ist aber die harte Wahrheit. Es hat seinen Grund warum nur etwa 0,6% der Spieler Weltweit Diamant erreicht haben.\n\nWeil Riot will dass nur 0,6% weltweit Dia erreichen? Könnte ja auch der mechanische Grundsatz drinnen liegen, wir wollen nur 100.000 Spieler in dieser Elo, alle anderen werden hinuntergereiht.\n\nWenn du mir vor 2 Season dass gesagt hättest, hätte ich dir dass durchaus alles noch geglaubt.\n\nAber ich denke, diese Season passt von dem gesagten hier einiges nicht in die tatsächliche Thematik. Allein deswegen schon weil es alleine für ADCs selbst in DuoQ Bereichen schwer zu climben ist, damit stimmt für mich die Relation derzeit im spiel aktuell einfach nicht. Warum auch? jeder 2. will halt squishy supps spielen, die ohnehin nicht funktionieren und wenns ihnen nicht passt wenn der adc eben mal afk farmen muss, gehen sie halt afk. Dafür funktioniert haltn Yi absolut gut, warum? Vielleicht kein Hard CC Champ im Team oder weil jeder dass pickt was er gerne spielen will und damit halt den \"Broek'she\" Grundsatz verfolgt? Ich mein es reicht doch einen Broeki zu haben, der dass spielt was er will da brauch ich nicht 15 andere zu haben.","replies":[{"poster":"Skagerak","date":"2019-01-09T14:01:24.993+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=QeU7MZeR,comment-id=00040000,timestamp=2019-01-09T13:34:22.455+0000)\n>\n> Weil Riot will dass nur 0,6% weltweit Dia erreichen? Könnte ja auch der mechanische Grundsatz drinnen liegen, wir wollen nur 100.000 Spieler in dieser Elo, alle anderen werden hinuntergereiht.\n> \n> Wenn du mir vor 2 Season dass gesagt hättest, hätte ich dir dass durchaus alles noch geglaubt.\n> \n> Aber ich denke, diese Season passt von dem gesagten hier einiges nicht in die tatsächliche Thematik. Allein deswegen schon weil es alleine für ADCs selbst in DuoQ Bereichen schwer zu climben ist, damit stimmt für mich die Relation derzeit im spiel aktuell einfach nicht. Warum auch? jeder 2. will halt squishy supps spielen, die ohnehin nicht funktionieren und wenns ihnen nicht passt wenn der adc eben mal afk farmen muss, gehen sie halt afk.\n\nStimmt so nicht in Korea ist z.B ein viel größerer Bestandteil der Spieler in Diamant als in Europa allein deswegen stimmt das schon nicht was du sagst. Außerdem spielen dort viel mehr Spieler die eben üben und nicht nur aus Spaß zocken und das Spiel viel ernster nehmen als wir hier im Westen ist also klar das der Bestandteil an guten Spielern dort viel höher ist, im Westen könnte wir aber auch so viele gute Spieler haben, wenn sich eben mehr Spieler anstrengen würden oder generell mehr anfangen würden Rangliste zu spielen.\n\n Wie soll Riot außerdem automatisch Spieler daran hindern aufzusteigen ? Das einzige was Sie machen können ist die Anzahl der Spieler welche in einer Liga sein können zu verringern, das haben Sie aber nur in Challenger mit 200 Spielern und in Grandmaster mit 500 Spielern gemacht, in den anderen Ligen können so viele Spieler sein wie möglich vorausgesetzt alle Spieler sind gleich gut, was unmöglich ist. Die Spieler selbst sorgen dafür das nur ein bestimmter Teil in der jeweiligen Liga ist. Manche haben eben Zeit 6h am Tag zu zocken, andere nicht Riot muss doch nicht extra irgendeinen Grundsatz haben um die besseren Spieler von schlechteren zu trennen, das macht die Rangliste von selbst.\n\nAußerdem stimmt das mit den ADCs nicht ganz. Man hatte jede Season eine Rolle welche nicht so dominant war oder einfach schlecht man siehe allein die Supporter in Season 2 oder 3 als die einfach nur laufende Bots waren die Wards gekauft haben, auch die haben es geschafft aufzusteigen. Genauso kann man dann sagen das es ADCs die letzten Seasons viel einfacher hatten aufzusteigen, weil die dort einfach richtig gut waren, eben die wichtigste und stärkste Rolle im game.  Du musst dich eben anpassen damit du in LoL gut bist, da sich das Spiel dauernd verändert. Außerdem spielen die Sachen für Low Elo sowieso kaum eine Rolle du kannst es mit Off Meta picks bis nach Diamant schaffen bis die Meta wirklich so einen riesigen Unterschied macht das du sie spielen musst um aufzusteigen bist du wahrscheinlich schon Diamant 1. Ich selbst bin immernoch nicht darauf angewiesen meta zu spielen um aufzusteigen und ich bin schon in Diamant. Das liegt daran das man selbst dann noch zu schlecht ist um sowas wirklich auszunutzen.\n\nAußerdem haben Afks Flamer Troller etc nichts damit zu tun ob du aufsteigst oder nicht, Erstens hat jeder solche Mitspieler also ist jeder so gesehen gleich beeinflusst von diesen was das aufstiegen also wieder für alle gleichschwer mach. Zweitens sind diese Fälle so selten das bei 500 games in der Season die und ich übertreibe hier 20 games welche man dadurch verliert gar keine Rolle spielen, genauso gewinnst du ja dann auch 30 games weil jemand im Gegner Team flamet trollt etc. Ach stimmt ja die Gegener haben ja nie solche Spieler........ \n\nStell dir dann doch einfach mal die Frage wie die anderen dann aufsteigen hab ich etwa bis Diamant immer Glück mit meinen Mitspielern gehabt ? wohl kaum...... das war harte arbeit ohne rumgeheule mehr nicht.","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2019-01-09T05:21:53.030+0000","up_votes":3,"down_votes":1,"body":"Du kannst es mit jedem Champ nach Dia schaffen. Mit Yi wirst du aber vielleicht aber mittlerem Platin deutlich langsamer climben, aber bis dahin sollte es ziemlich fix gehen. Der Champ ist halt perfekt für SoloQ gemacht und wenn im Gegnerteam nicht mindestens 2-3x hard CC und ein fetter Tank vorhanden sind, schlitzt der einfach durch alles durch. Nur - auch in Gold und Platin werden kaum Tanks, sondern nur Bruiser, Assassins und Mages gespielt. Die sind einfach Opfer für Yi.","replies":[]},{"poster":"TEA H3roHirsch","date":"2019-01-30T17:23:17.799+0000","up_votes":1,"down_votes":0,"body":"Silber 5. In der Elo spielen deine Gegner kein League, sondern irgendetwas anderes äußerst komisches. Dort funktioniert yi noch, ab high-gold ist Flaute. Deswegen hab ich ihn auch aufgegeben.","replies":[]},{"poster":"Cenâreth","date":"2019-01-09T13:08:14.040+0000","up_votes":1,"down_votes":0,"body":"Sollte theoretisch möglich sein du wirst aber auf deinen Weg den einen oder anderen Hard CC abkassieren.\nAber an sich sollte es möglich sein allein weil Hard CC Champs wie Maokai die ihn durchaus ärgern können oder Jax entweder sogut wie nie gespielt werden oder die Leute beide zu 80% nicht beherrschen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2019-01-09T11:38:30.166+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir ja den Tipp geben, dir realistische Ziele zu setzen. Das hilft extrem, weil an sonsten Endtäuschungen vorprogrammiert sind.\n\nKann man mit jedem Champion Diamond werden? Garantiert.\nIst es wahrscheinlich, dass man sich in einem Jahr so sehr verbessert, dass man von nem Durchschnittsspieler zur absoluten Elite aufsteigt? und es sind halt nur etwa 2% der Spieler auf diesem Server Diamond oder höher. Dass du dich innerhalb relativ kurzer Zeit so stark weiterentwickelst, ist extrem unwahrschienlich. \n\nIch würde dir den Tipp geben: Versuche dir 2019 den Siegreichen Skin zu holen. Alles, was danach kommt, ist nen Bonus. Und dann kannst du 2020 überlegen, wie viel Energie du noch in die Rangliste stecken willst, oder ob Gold dir nicht reicht, und dir hohes Gold oder Platin zum Ziel setzen.","replies":[]}]}