{"poster":"Ignizer","date":"2016-01-15T23:26:10.912+0000","title":"Error en el parche 6.1","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Al terminar la selecci&oacute;n de campeones, cuando est&aacute; por comenzar la pantalla de carga, se me cierra League of legends con un error, al parecer muy com&uacute;n entre los usuarios pero a&uacute;n sin soluci&oacute;n. El error sale con la descripci&oacute;n &quot;No se puede iniciar la aplicaci&oacute;n&quot;, enumerado como &quot;(0xc0000005)&quot;. Solicito ayuda por parte de los moderadores de Riot si es posible, ya que el error no ocurr&iacute;a previamente a instalar el parche 6.1.\r\nIntent&eacute; todas las soluciones recomendadas por parte de los usuarios tanto en el foro como en videos de youtube, entre ellas reinstalar el parche, reemplazar unos dlls dentro de system32, actualizar DiretX;  y ninguna me ha funcionado, lo &uacute;nico que me queda por intentar, ya casi sin esperanzas, es reinstalar el juego por completo, lo cual con la velocidad de mi internet (3 MB), teniendo en cuenta que el cliente solo utiliza un 10% o menos de la misma, me llevar&iacute;a un d&iacute;a entero, y mis padres no me permiten dejar el ordenador encendido por la noche. Espero que puedan ayudarme, ya que estoy super ansioso por volver a jugar luego de una semana de vacaciones. Gracias.\r\nTengo una copia de seguridad del juego por completo dentro de un usb que me ha prestado un amigo para instalarlo por primera vez hace un mes y medio aproximadamente, (Unos 6gb&#039;s) Pero esta sin el parche 6.1. &iquest;Podr&iacute;a hacer algo con ello?, ya que supongo que ser&iacute;a lo mismo que reinstalar el parche, lo cual lo intent&eacute; dos veces y no ha funcionado. Saludos.\r\n\r\n{{champion:84}} {{summoner:14}}{{summoner:4}}  {{item:3146}} {{item:3116}} {{item:3100}}{{item:3157}}  {{item:3089}} {{item:3117}}","replies":[{"poster":"poguis23","date":"2016-01-20T20:03:38.541+0000","up_votes":1,"down_votes":0,"body":"{{champion:161}}","replies":[]},{"poster":"TsawadaRin","date":"2016-01-15T23:31:43.798+0000","up_votes":1,"down_votes":0,"body":"si te comentan´´es algo que se instalo mal borra todo el game y vuelvelo a instalar´´ no les creas lo mas preferible es esperar a que riot haga una actualizacion de errores *que seguro sera en 2 dias* y esperar a que se te solocione,saludos :D","replies":[]}]}