{"poster":"Slaybeast","date":"2015-11-12T17:14:27.054+0000","title":"Gangplank meine meinung nochmal auf deutsch, sry für die auf english :D","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Meine Meinung zu Gangplank patch 5.22 ist dass er sehr darunter leidet dass es keine Crystaline flask weder Mana potions zu Verf&uuml;gung mehr hat. Obwohl Ich ihn nur 2 mal seit dem patch gespielt habe, finde ich schon dass er deutlich anf&auml;lliger geworden ist f&uuml;r Mana Probleme. Ich werde sicher sehr lange brauchen heraus zu finden wie ich mit ihm &uuml;bers early komme. W&uuml;rde mich sehr &uuml;ber ein paar tips freuen. \r\nIch finde man sollte irgendwie sein Mana sustain buffen. NICHT viel, aber zu mindestens etwas.\r\n\r\nUnd dann ist da noch Talon der mich in dem Moment indem er level 6 geworden ist, geoneshotted hat mit einer rotation. Aber dass ist ein anderes Tema\r\n\r\nMfg Slaybeast","replies":[{"poster":"Schesam","date":"2015-11-12T17:17:19.088+0000","up_votes":1,"down_votes":0,"body":"Es gibt die Flask noch. Kostet 500 Gold, stellt 50 Mana und 150 Leben pro Tick wieder her... Kann man theoretisch auch als Startitem benutzen. Dazu musste GP generft werden und wenn man das erreicht, indem man sein early weiter schwächt, dann ist das gut so","replies":[{"poster":"Slaybeast","date":"2015-11-12T17:22:50.662+0000","up_votes":1,"down_votes":0,"body":"Hast recht. Ich gebe zu die neue Flask habe ich noch nicht ausprobiert. Die ist Eigentlich für den jungler gedacht da sie pro grosses monster ein Refill kriegt. \n\nAber danke, ich werde es ausprobieren <3","replies":[{"poster":"ChrisLightxd","date":"2015-11-12T17:25:25.323+0000","up_votes":1,"down_votes":0,"body":"Was die flask bekommt pro camp ein refill?o.o das ist ja eig. schon ziemlich op o:","replies":[{"poster":"OT Riku","date":"2015-11-12T19:00:16.097+0000","up_votes":1,"down_votes":0,"body":"Nicht wirklixh ich komme besser ohne das kalt hatte bis jetzt immer das Gefühl ixh hänge zu sehr hinten und da ich gerne diana spiele die erst ab lv 6 wirklixh nützlich ist hatte ich mein 1. Item nichtmal auf lv 6 was mich gen einen Lee ( sollte diana nicht gegen ihn picken )echt zurück geworfen hat weil er in der zeit schon 3 mal geganked hat \n\nNaja","replies":[]}]},{"poster":"Schesam","date":"2015-11-12T17:27:48.866+0000","up_votes":1,"down_votes":0,"body":"Die Trank kann man in 2 Varianten ausbauen, eines für 400g und eines für 500g. das für 400g ist für den Jungle, gibt 60 Leben und 20 mana pro tick, kriegst aber eine Aufladung pro camp. Das für die lane kostet 500g und gibt 150 leben und 50 mana pro tick, füllt sich aber nur im shop auf\nHabs nur auf deutsch: Trank des Jägers für 400g im Jungle und Verderbender Trank für 500g für die lane","replies":[]}]}]},{"poster":"ÆonFox","date":"2015-11-12T17:35:49.963+0000","up_votes":1,"down_votes":0,"body":"Es gieb wie schon gesagt wurde die Flask noch, das sie beim Jungler wieder Aufladungen bekommt ist doch nicht nachteilig, soll dir recht sein wenn du an der Krabbe nen Stack kriegtst oder wenn du Gromp/Kruggs snackst und Glanz ist nun günstiger und giebt nun CDR statt AP und mehr Mana als Früher.\nMan muss sich in dem neuen Wirwar nur erstmal zurrechtfinden.","replies":[]}]}