{"poster":"Pansuil","date":"2018-01-22T01:12:07.261+0000","title":"I feel like i was actually unfairly reprimanded by the leaver system.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I started up ranked queue, first game of the day made it through champ select, but then when the game started to launch loading screen it crashed. The client said it was bugsplat and said there was  a potential bug in the client and that the client needed to be fixed. So it started going through every file re-patching the client, it took so long that my team was able to remake the game and i got a leaver status and also lost -17LP for it. I mean i'm not entirely frazzled about this but it does suck a whole lot to to lose that much LP when i barely even lose that from playing a game out and losing and i very much wouldn't like the possibility of going into low priority over something like this especially if it happens again.\r\n\r\n\r\nhttps://imgur.com/a/voPmi\r\n this is the picture evidence of this nonsense I highlighted the game and also highlighted my client still patching after having been reprimanded","replies":[{"poster":"Broporo","date":"2018-01-22T02:42:07.705+0000","up_votes":1,"down_votes":0,"body":"Snap that does really suck. Sometimes these crashes can come way out of left field, but ultimately we all have to make sure the game will work before hopping into a match. We can't do anything about that LP, since an afk loss is still a loss, but we should definitely try and make sure this doesn't happen again. \n\nAfter that repair, be sure to test it a couple times in a custom/practice match first. If it's not working correctly still, it might be due from hiccups in your connection causing errors in the game files you're downloading, in which case an ethernet connection could help.","replies":[]},{"poster":"Chermorg","date":"2018-01-22T01:45:45.516+0000","up_votes":1,"down_votes":0,"body":"Hey, sorry to hear you got the punishment for leaving the game. Virtually all the time this happens it's not something Riot can control - they can't control if a file is corrupted by your system causing the game to crash, nor can they control if your game is crashing due to conflicts with your computer hardware or other software. The end result is the same - your four teammates (and the enemy) had to waste their time in a champion select, loading, and the first 3 minutes of a game because of your crash.\n\nNote that you won't get any further penalties (such as low priority queue or bans) unless this is happening frequently - the system merely treats the game you AFKed for as a loss.","replies":[]}]}