{"poster":"excodar","date":"2017-05-28T06:20:33.983+0000","title":"Im Pretty Sure People Wanted 10 Bans Because They WANTED Certain Champs To Be Permabanned","subforum":"Gameplay","up_votes":174,"down_votes":28,"body":"10 bans just filter out the champions with kits so overpowered or toxic that they don&#039;t even belong in league of legends. You had a chance to make the meta more diverse and instead its going to be 3 dominant champions for every role xd","replies":[{"poster":"DunkinNoobs","date":"2017-05-28T06:40:05.867+0000","up_votes":15,"down_votes":18,"body":"Yeah no shit. And Riot doesn't want their champs permabanned.","replies":[{"poster":"Divewing","date":"2017-05-28T06:56:46.332+0000","up_votes":93,"down_votes":8,"body":"Then rework them, shift their power, do something.\n\nPart of the reason people want crap like Lee permad is because, on the surface, it appears that Riot isn't interested in changing him regardless of how abhorrent he is to play against.\n\nSo what other choice do these people have?","replies":[{"poster":"korg023","date":"2017-05-28T10:34:51.116+0000","up_votes":44,"down_votes":3,"body":"this. If champion is permabaned that means someone doesent want to play with or against them at all . That tells you alot about that champion design.","replies":[{"poster":"Elikain","date":"2017-05-28T16:22:27.445+0000","up_votes":5,"down_votes":12,"body":"It doesn't as you're literally saying that a person's choice of a permaban can never be subjective but is always objective in nature. That isn't true. I ban Yi because every Yi on my team i've played with so far has been a liability, no matter how good or bad he's been doing. \n\nThat doesn't mean he's broken.\nIt just means i have had bad experience when playing with Yi players and i don't want him in my games. That doesn't mean Riot should change Yi in some way because he's on my permaban list.","replies":[{"poster":"YumaS2Astral","date":"2017-05-28T17:12:39.205+0000","up_votes":7,"down_votes":0,"body":"Yes, but what if Yi was on the majority of people's permaban list, like Yasuo currently is?","replies":[{"poster":"Elikain","date":"2017-05-28T19:24:59.713+0000","up_votes":8,"down_votes":1,"body":"Yasuo is also on my ban list for the same reason Yi is.\nEnemy Yasuo does win his lane, does know to build crit and damage and shit on everyone, my Yasuo always loses their lane and goes centuries old bruiser build that doesn't work anymore.\n\nI'm not banning Yasuo because he can't be countered.\nAnd i'm not saying that Yasuo can't be on the usual banning list of the majority of players because he isn't absurdly strong. I'm just saying that every player has their own reason why someone is on their permaban list and most of the times, these champions are there because of the popular opinion. This means that players themselves don't understand why they're banning these champions, they merely adapt the ban list from pro play and use it as factual evidence that they are, in their current condition, too strong for the current meta.\n\nIf a champion is being banned in most of the games, then there definitely is a legitimate reason why they're being banned. But if you ask players themselves why do they ban what they ban, most of the times you're either going to get generic response (because they're OP/broken) or they wouldn't know how to properly answer your question. This only proves that these ban lists are most of the times adopted from higher ELOs and passed down to everyone else.\n\n_**You know what you're supposed to be banning but you don't know exactly why you're doing it.**_","replies":[]}]}]}]},{"poster":"DunkinNoobs","date":"2017-05-28T07:26:16.823+0000","up_votes":11,"down_votes":41,"body":"> [{quoted}](name=Saïx,realm=OCE,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=00040000,timestamp=2017-05-28T06:56:46.332+0000)\n>\n> So what other choice do these people have?\n\nThe same one they've been taking for years: Tell their playerbase to quit whining and get good. High elo players don't whine about champs like Yasuo nearly as much as silver players do, and there's a reason for this.","replies":[{"poster":"Divewing","date":"2017-05-28T08:13:19.053+0000","up_votes":46,"down_votes":7,"body":"Maybe, but does that make it any less valid?\n\nI'm honestly getting sick of the \"get good\" excuse.\n\nThe issue for a lot of these people IS NOT THAT THEY CANNOT FIGHT THESE CHAMPIONS.\nIt's that when they have to, THEY FUCKING HATE IT. \n\nDoesn't matter if I'm LCS or bronze 5, it will never change a champion's kit, and if someone think's it's obnoxious (notice I didn't say overpowered), THEN SKILL WILL NEVER MATTER.\n\nNow this next bit is completely 100% opinion, so take it with a grain of salt (pun not intended), but frankly i think dismissing the feelings of not an individual, but a full group, off as \"they are trash, get better\" seems rather arrogant if you ask me.","replies":[{"poster":"DunkinNoobs","date":"2017-05-28T08:23:43.995+0000","up_votes":17,"down_votes":11,"body":"I hate fighting Shen with a fiery passion, but the boards love that champ for some reason.  I have plenty of champs I'd love to never see again, but I'd never lobby for more bans in the hopes that those champs would become permabanned and then gutted. That's the difference between me and the yasuo/lee/fizz/etc. haters.","replies":[{"poster":"Mira Arya Enthe","date":"2017-05-28T09:24:18.737+0000","up_votes":13,"down_votes":15,"body":"This. I hate fighting Gangplank, Yi, Shen, Galio, Nautilus, Maokai and Poppy. You don't see me posting shit about them on the boards everyday. Begging people to ban them for me. I jist need to get good.","replies":[{"poster":"Ahristocats","date":"2017-05-28T10:38:56.672+0000","up_votes":7,"down_votes":2,"body":"why do you hate yi tho i don't get it\nhe's inexistent in early game which is why he isn't played in high elo\nif you invade him/gank lanes before him, it's legit a free win","replies":[{"poster":"GULAG 4 U","date":"2017-05-28T15:24:08.191+0000","up_votes":10,"down_votes":0,"body":"Comming from a Yi/Aatrox main.\n\nA fed yi is extremely frustrating. Especially if he gets fed, he can dumpster your entire team for the simple mistake of using your cc before your damage spells. \n\nHe isn't op, but his entire kit is ridiculously frustrating if ahead because of the amount of damage he can dish.\n\nYi mains also tend to be garbage people too, and that doesn't help. ","replies":[{"poster":"Andrey0345","date":"2017-05-28T20:26:50.473+0000","up_votes":2,"down_votes":0,"body":"Same thing is with Tryndamere tbh.","replies":[{"poster":"GULAG 4 U","date":"2017-05-28T22:31:30.959+0000","up_votes":4,"down_votes":0,"body":"Tryndamere has arguably the biggest fuck you skill in the game.","replies":[]}]}]}]}]}]}]},{"poster":"Jamenawerl","date":"2017-05-28T11:57:26.937+0000","up_votes":4,"down_votes":10,"body":"If you consider plat or diamond high elo then you are totally wrong.\n\nHell, Lee is broken even in challenger.","replies":[{"poster":"Mira Arya Enthe","date":"2017-05-28T13:05:29.818+0000","up_votes":4,"down_votes":5,"body":"Janna x Rubick is a master tier player and also can confirm nobody hates Yasuo and nobody bans him there either.\n\nAnd I consistently watch the streams of 4 challenger players. Nobody bans him there either or even talks about him.\n","replies":[{"poster":"Jamenawerl","date":"2017-05-28T13:42:08.776+0000","up_votes":12,"down_votes":0,"body":"\"Nobody\".\n\nThats why he is the 8th most banned champion in Diamond+ when he isnt even one of the most OP ones. I also know several diamond and plat tier players and a lot of them hate yasuo.\n\nI get that there are more players complaining about Yasuo in low elo than in high elo, but there are a lot of high elo players that do complain about him (the best known example that comes to mind was the challenger Dopa) and a lot of low elo players that dont (such as you). Generalizing in this case is a mistake.\n\nYou can find the Yasuo matchup as a cakewalk or as a cancer because some parts of his kit are insanely effective to deal with low mobility, low burst and/or skillshot/projectile reliant champions, while being useless otherwise. It doesnt have anything to do with the elo you play in, but with the champions you play.\n\nIts kinda obvious that they wont ban him in challenger because they are almost forced to play meta champs and they only have 6 bans to deal with the OP champions, but that doesnt mean he is fun to play against.","replies":[{"poster":"Thilmer","date":"2017-05-29T16:44:45.680+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jamenawerl,realm=EUW,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=000400000000000200010000,timestamp=2017-05-28T13:42:08.776+0000)\n>\n> &quot;Nobody&quot;.\n> \n> \n\nYup, that kind of argument is absurd.\n\n\"It has a low banrate, only 22%\".\n\nThere are 140 champions in the game and if they were perfectly balanced all then would have around 1% banrate; any banrate over 10% is fucking huge.","replies":[]}]}]},{"poster":"DunkinNoobs","date":"2017-05-28T12:17:41.628+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Jamenawerl,realm=EUW,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=0004000000000002,timestamp=2017-05-28T11:57:26.937+0000)\n>\n> If you consider plat or diamond high elo then you are totally wrong.\n> \n> Hell, Lee is broken even in challenger.\n\nHe has a 47.5% winrate in Diamond+, which is high enough elo that you'd expect people to know how to play. If that's broken, I wonder what would be balanced. 42% low enough for you?","replies":[{"poster":"Jamenawerl","date":"2017-05-28T12:28:50.895+0000","up_votes":2,"down_votes":4,"body":"Regarding Yasuo, people bitch about him in diamond the same way they do in bronze, thats why I said you were wrong.\n\nRegarding Leesin, winrate alone doesnt mean anything, specially when he has been a dominant pick in competitive play for such a long time.","replies":[{"poster":"DunkinNoobs","date":"2017-05-28T12:38:06.144+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=Jamenawerl,realm=EUW,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=000400000000000200000000,timestamp=2017-05-28T12:28:50.895+0000)\n>\n> Regarding Yasuo, people bitch about him in diamond the same way they do in bronze, thats why I said you were wrong.\n\nI'm actually diamond. They don't. Pretty much the only people that complain about Yasuo at diamond+ are adc mains, go figure. But you don't need my anecdote because we have actual numbers. Yasuo is banned 54% of the time overall but only 22% of the time in Diamond+. Go to Korea and that number gets even lower where his banrate is only 7% in their plat+ solo q. The best players of the game simply don't care about Yasuo; they're too busy banning actual OP champs like Lulu and Zac.","replies":[{"poster":"Troll for Trump","date":"2017-05-28T16:07:51.256+0000","up_votes":4,"down_votes":0,"body":"I mean, in KR, FIzz currently has what, a 70% Ban rate or something?","replies":[]}]}]}]}]},{"poster":"BeatzBoyFTW","date":"2017-05-28T12:22:46.426+0000","up_votes":5,"down_votes":2,"body":">  High elo players don't whine about champs like Yasuo nearly as much as silver players do, and there's a reason for this.\n\nSo technically, high elos suck against an Aatrox or Yorick.\n\nOk then...","replies":[{"poster":"MuffledGarbage","date":"2017-05-28T17:01:08.833+0000","up_votes":7,"down_votes":0,"body":"Don' diss my boi {{champion:83}} by putting him in the same list as {{champion:266}} m8.","replies":[]},{"poster":"DunkinNoobs","date":"2017-05-28T12:32:18.261+0000","up_votes":4,"down_votes":0,"body":"High elo players complain about different champs than low elo ones do, although there is some overlap. High elo players bitch far more about Ivern than low elo ones do, for example. Qtpie and other high elo players have been saying that shield spamming is broken for months now and low elo players still don't see it as a problem. They're too busy complaining about Yasuo, Lee, Ahri, and whatever assassin killed them a bunch last game. High elo players complain about what's actually good at their level. Low elo players complain about what kills them, not what wins or is actually good.","replies":[]}]},{"poster":"Lauchmelder","date":"2017-05-28T20:00:01.590+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=DunkinNoobs,realm=NA,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=000400000000,timestamp=2017-05-28T07:26:16.823+0000)\n>\n> The same one they&#x27;ve been taking for years: Tell their playerbase to quit whining and get good. High elo players don&#x27;t whine about champs like Yasuo nearly as much as silver players do, and there&#x27;s a reason for this.\n\nThe \"Git gud\" argument when it comes to Yasuo is absolute garbage. His kit is toxic in design. People don't complain about him being OP, they complain because \"dash dash dash dash Q Q Q rinse repeat\" is just horrible to play against.","replies":[{"poster":"DunkinNoobs","date":"2017-05-28T20:02:52.013+0000","up_votes":4,"down_votes":3,"body":"It's horribleness decreases exponentially as you become a better laner. The only people that really have a right to complain about Yasuo are people who main mages with nothing but skillshots like Ziggs. And even then, Ziggs can handle himself if played correctly.","replies":[{"poster":"Lauchmelder","date":"2017-05-28T20:59:29.470+0000","up_votes":7,"down_votes":4,"body":"Again. The \"git gud\" argument you're constantly throwing around is worthless.\n\nPeople know how to deal with Yasuo, they just don't want to lane against someone with double crit and no cooldown on his mobility and damage spell as well as a windwall that negates all skillshots thrown towards him. \n\nIt's not that hard to understand when you dismount from that high horse.","replies":[]}]}]}]},{"poster":"FCJAAAAGOOOO","date":"2017-05-28T22:08:34.787+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saïx,realm=OCE,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=00040000,timestamp=2017-05-28T06:56:46.332+0000)\n>\n> Then rework them, shift their power, do something.\n> \n> Part of the reason people want crap like Lee permad is because, on the surface, it appears that Riot isn&#x27;t interested in changing him regardless of how abhorrent he is to play against.\n> \n> So what other choice do these people have?\n\nThe specific problem with Lee is that he wrecks the other jungler making every lane basically a 2v1 which is ridiculous.  It's most disgusting at lower Elos where you DON'T play around it.  They need to seriously reduce his jungle survivability in particular.","replies":[]}]}]},{"poster":"Hexs Fortune","date":"2017-05-28T06:28:56.152+0000","up_votes":28,"down_votes":2,"body":"Everyone now has the power to permaban any champ of their choosing.","replies":[{"poster":"LeagueOfJhin","date":"2017-05-28T06:36:50.358+0000","up_votes":15,"down_votes":3,"body":"Mines gonna be this bitch {{champion:105}}","replies":[]},{"poster":"Add Me After","date":"2017-05-29T15:37:45.835+0000","up_votes":2,"down_votes":0,"body":"The problem is that we wanted both teams to work together to ban 10 cancer champs - now it's down to 5 bans per team and they can overlap.  Anti clarity - more hoping and praying someone bans him","replies":[]}]},{"poster":"Slack King","date":"2017-05-28T06:37:58.337+0000","up_votes":22,"down_votes":1,"body":"{{champion:64}} mine will be","replies":[{"poster":"nGio","date":"2017-05-28T08:39:03.900+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Slack King,realm=NA,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=0003,timestamp=2017-05-28T06:37:58.337+0000)\n>\n> {{champion:64}} mine will be\n\nThat's been mine for about 5 years now. Glad to know that I will literally never see him again, since Riot wants to keep him as the lord of the jungle.","replies":[{"poster":"korg023","date":"2017-05-28T10:40:32.448+0000","up_votes":6,"down_votes":0,"body":"I cant wait to never play versus lee again. That guy just comes from all angles of the map to kick me around like a ping pong ball. GOD BLESS!","replies":[]}]}]},{"poster":"Velgam","date":"2017-05-28T12:19:25.311+0000","up_votes":19,"down_votes":1,"body":"If 10 bans would make a champ perma banned out OF 134 CHAMPIONS IN GAME, there is an issue with those champs.","replies":[]},{"poster":"Daddy Braum","date":"2017-05-28T07:15:31.580+0000","up_votes":17,"down_votes":0,"body":"It could also have something to do with the fact that there are almost 140 champs in the game now and bans wasn't enough to \"level\" out the playing field from the flavour of the month champions","replies":[{"poster":"Durzaka","date":"2017-05-28T16:39:01.027+0000","up_votes":8,"down_votes":0,"body":"This.\n\nBack in the day we had 6 bans, and 40 champions to pick.\n\nNow we have 140, and even 10 unique bans doesnt help cover the same area the original 6 did back then.","replies":[]}]},{"poster":"JavelinJoe","date":"2017-05-28T06:32:59.784+0000","up_votes":10,"down_votes":0,"body":"I wanted 10 so I could have a say in what was banned in a game. Having to first/second pick without getting a ban sucked ass since more often than not you were just counter picked.","replies":[]},{"poster":"DemainaNyx","date":"2017-05-28T07:06:30.975+0000","up_votes":9,"down_votes":0,"body":"I personally want 10 bans because I hate when my team bans Yasuo/Fizz/Zed and ignores the fact that Zac is really strong on this patch, or the Ivern is or whatever.  It allows me a voice in what I don't want to have to face without having to beg a teammate to ban them.","replies":[{"poster":"Mira Arya Enthe","date":"2017-05-28T09:26:32.089+0000","up_votes":6,"down_votes":2,"body":"This. 90% of the time I ban tanks, Yi or Gangplank. Idgaf about my teams desire to cockblock a couple specific champions. Lots odlf people are like us they just aren't noisy about it.","replies":[{"poster":"korg023","date":"2017-05-28T10:38:58.174+0000","up_votes":4,"down_votes":0,"body":"i had a person pick zac top since he doesent want to face him in enemy team so he picked him top lane. It was ranked solo queue and we lost that game since he was feeding enemy fiora 4 kills in early game. He also had 0 games as Zac. How people on this server are actually dumb.","replies":[]}]}]},{"poster":"Eternum Nocturne","date":"2017-05-28T16:49:57.120+0000","up_votes":7,"down_votes":0,"body":"mine will be {{champion:92}} just to piss off Riven mains knowing they can't play anything else.","replies":[]},{"poster":"PePsiLemoNN","date":"2017-05-28T07:14:22.062+0000","up_votes":5,"down_votes":3,"body":"Having 10 champs permabanned won't make the meta more diverse. The next best 10 champs would be the meta  and it would be the same shit.\n\nand\n\n> [{quoted}](name=Hexs Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=0000,timestamp=2017-05-28T06:28:56.152+0000)\n>\n> Everyone now has the power to permaban any champ of their choosing.","replies":[{"poster":"korg023","date":"2017-05-28T10:37:38.745+0000","up_votes":8,"down_votes":1,"body":"will play vs mundo or shen any day instead yasuo riven or lee sin","replies":[]},{"poster":"3TWarrior","date":"2017-05-28T13:18:48.483+0000","up_votes":3,"down_votes":0,"body":"riot's biggest win with this is allowing players to get rid of their personal hell champions, but yeah, there are inherent problems when there are champions that are consistently better than the other 100 except in the hands of dedicated mains or very experienced players","replies":[]},{"poster":"Add Me After","date":"2017-05-29T15:41:17.963+0000","up_votes":2,"down_votes":0,"body":"You're missing the point - what we wanted 10 bans was to get rid of cancer champs as a team - not individually - even if I'm mid lane - I want to ban maybe a mid lane and lee sin, but Riot is making it less about the team and more about the solo player","replies":[]}]},{"poster":"Skins Project","date":"2017-05-28T11:46:11.519+0000","up_votes":9,"down_votes":2,"body":"Wait what..\n\nYou know what happens if you had 10 bans permabanning?\n\nWhat would happen is the top 10 champions would always be banned. Now the champions that were top 20, and were not of the 10 banned would come out and be dominant. The 10 bans was to allow players to ban anyone whom is either A) Hard counter. B) Redundant. C) Unsure of how to play against. It was not to reduce the champion count of the game by 10.","replies":[]},{"poster":"Aeró","date":"2017-05-28T21:41:18.120+0000","up_votes":2,"down_votes":10,"body":"HIgh elo players dont bitch as much as the bronzies crying to permaban yasuo and lee every game.","replies":[{"poster":"excodar","date":"2017-05-28T21:59:11.265+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=Aeró,realm=NA,application-id=3ErqAdtq,discussion-id=1uH6I3tG,comment-id=002d,timestamp=2017-05-28T21:41:18.120+0000)\n>\n> HIgh elo players dont bitch as much as the bronzies crying to permaban yasuo and lee every game.\n\nActually they do, except its with Ivern and Lulu","replies":[]}]}]}