{"poster":"Aufn Kopp Kloppa","date":"2017-08-06T08:12:23.101+0000","title":"Eine neue Spielmethode","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Hallo Leute!\r\n\r\nIch wollte mal Bescheid geben, dass die Level Bot&#039;s weiterhin existieren und es weiterhin vorkommt dass &quot;dein&quot; Team aus 4 Level Bot&#039;s und dir besteht. Dies f&uuml;hrt bei mir in der Regel dazu dass ich das Spiel binnen 7 Minuten verloren habe. Zurzeit kann ich nur gegen Bot&#039;s spielen da mir Normale Spiele zu schwer sind und ich erst Level 3 bin. Ich w&uuml;rde Riot daher bitten meine neue Spielmethode zu &uuml;berdenken, welche ich im Anschlu&szlig; gleich vorstellen werde, da die H&auml;ufigkeit der Level Bot&#039;s zunehmend zunimmt und das Spielgeschehen deutlich erschweren. Vier Level Bots renn in der Mitte in den gegnerischen Turm und sei es Veigar, Swain oder Annie als gegnerischer Bot brauchen diese nur einmal anhitten und bekommen den Kill. Nach knapp 5 Minuten hat ein Veigar dann zum Bleistift knappe 300 - 400 AP und 23/0/0 w&auml;hrend du selbst sag ich mal grade mal 1 - 3 Kills und 40 AP bzw. 90 AD hast. Die gegnerischen Bots wechseln zu diesem Zeitpunkt dann bis auf einen alle Mid Lane und pushen die T&uuml;rme schnell und pr&auml;zise down w&auml;hrend deine &quot;Teamkameraden&quot; sie weiterhin feeden. Sch&ouml;n anzusehen ist das ganze nicht und nimmt in erster Linie den Spielspa&szlig;. Ich habe mir eine neue Spielmethode &uuml;berlegt, was so einen Push wenn man 4 Level Bot&#039;s im Team hat, erschwert aber auch in Normal Games sicherlich neue Strategien und Wege f&uuml;r die Spieler bereithalten kann. Hier mein Vorschlag.:\r\n\r\nKleine Information, auch wenn sich der erste Satz gleich etwas confuse anh&ouml;rt, bitte ich dennoch weiterzulesen denn ich denke mit dieser Methode ist sicherlich eine Menge neuer Spielspa&szlig; verbunden und es w&auml;re z.B eine Alternative zu den vermissten Horror Bots. :D\r\n\r\nMan k&ouml;nnte doch auf den Lanes, (nicht im Dschungel) also auf TOP, MID, BOT eine zuf&auml;llig erscheinende Plasmakugel einf&uuml;hren welche sich nach 5 - 10 Sekunden Aufladezeit (Reaktions- Handlungszeit f&uuml;r den Spieler) in ein Schwarzes Loch also einfach einen schwarzen Abgrund im Boden entpuppt und alles was da rein l&auml;uft ist INSTA tod. Soviel zum ersten Satz. Detailiert w&uuml;rde das auch nicht overpowered sein denn man m&ouml;ge bedenken es w&uuml;rde ja nur auf den drei Lanes stattfinden und zuf&auml;llig in regelm&auml;&szlig;igen Abst&auml;nden und unterschiedlichen Gr&ouml;&szlig;en und Formen auftreten. Im Dschungel w&uuml;rde es deshalb keinen Sinn machen, da sonst aufeinmal Blue, Red, Dragon, Harald, Baron ect, futsch w&auml;ren. W&auml;re ja schwachsinnig. Auf den Lanes hingegen w&auml;re das nat&uuml;rlich etwas anderes. Erstens k&ouml;nnte man mit gewissen Champs diese h&auml;sslichen Level Bot Feeder da reinschubsen xD. Somit dauert es l&auml;nger bis der Gegner Kills zusammen hat und man h&auml;tte als Neuling eine Chance. Oder da die Level Bots nahezu nur grade aus laufen, laufen sie eh selbst rein und sterben insta und Veigar wird nicht so gefeedet.\r\n\r\nUnter anderem kann ich mir durchaus auch vorstellen dass es in Ranked&#039;s oder Normal Games auch den Spieler f&ouml;rmlich dazu dr&auml;ngt seine Strategien zu &uuml;berdenken und in Teamfights das durchaus genauso lustig, wie auch interessant und erschwerend sein k&ouml;nnte, da man wenn man zum Beispiel grade im Teamfight ist 5 vs. 5 auf einer Lane alle kloppen aufeinander ein und pl&ouml;tzlich erscheint die Plasmakugel so ne schwarz violett wei&szlig;e Kugel und du hast noch 10 Sekunden Zeit um deine Aktionen zu &uuml;berdenken da du nicht wei&szlig;t wie die Form oder Gr&ouml;&szlig;e des Schwarzen Loches das gleich erscheinen wird und alles im Radius in den Tod rei&szlig;t, nun musst du selbst f&uuml;r dich entscheiden, schaff ich es noch den ADC im Teamfight umzuhaun, den Support zur&uuml;ckzudr&auml;ngen ect. pp oder hau ich lieber ab? Ich denke mal diese Art an Spielmechanik, sollte Riot diese einbauen wird wieder Schwung in League of Legends bringen, denn zurzeit ist es meines Erachtens nach irgendwie n bisschen die alte Leier, immer dasselbe nichts besonderes. \r\n\r\nAu&szlig;erdem noch bevor ich es vergesse, sollte ein Team zum Beispiel Harald gelegt haben und die Gegner alle oder fast alle grade tod sein oder vielleicht mal kurz nicht aufpassen, k&ouml;nnte das andere Team wenn es nicht aufpasst mal gut und schnell um zwei Tower erleichtert sein. Dann diese Lane verst&auml;rkt zu halten w&auml;hrend man die anderen Lanes aber nicht aufgeben m&ouml;chte, erweist sich bei nicht so starkem und gutem Team als recht schwierig, doch w&auml;re da ein schwarzes Loch, w&uuml;rde eventuell Harald sterben und ein oder gar zwei Tower &uuml;berleben. Zum Beispiel. Auch w&uuml;rde es unter anderem nicht nur die Strategie in Teamfights &uuml;berdenkbar machen sondern auch Ganks deutlich erschweren oder erleichtern. Lee zum Beispiel, st&ouml;&szlig;t den Gegner bei Gank einfach mal ins Schwarze Loch, Lane f&uuml;r sich entschieden, Blitzcrank zum Beispiel, zieht den Gegner einfach mal von der einen Seite des schwarzen Loches auf die andere, w&auml;hrend der Flugbahn bzw. Grap Bahn &uuml;ber dem schwarzen Loch ist der Gegner futsch, tod xD. Es w&auml;re also sicherlich lustig, Festhalten usw. und grade in dem Moment &ouml;ffnet sich n schwarzes Loch, g&auml;be also ordentlich viele Methoden den Schwung mal wieder so richtig in die H&ouml;he zu schie&szlig;en und auch mit 4 Level Bots zum Bleistift ein Spiel noch f&uuml;r sich zu entscheiden, trotz zu hart gefeedeter Gegner.\r\n\r\nFalls das eine Option w&auml;re dies zu bewerkstelligen w&uuml;rde ich mich &uuml;ber ein Feedback seitens der Community aber vorallem auch seitens Riot freuen, was denkt ihr dar&uuml;ber, wie findet ihr den Vorschlag? P.s. Eins sollte man sollte diese Spielmechanik wirklich eingef&uuml;hrt werden bedenken, T&uuml;rme sollten nat&uuml;rlich auf keinen Fall Schaden durch die Schwarzen L&ouml;cher nehmen, bzw. nicht mal in der Reichweite sein, die Schwarzen L&ouml;cher sind nicht verschiebbar, sind halt wie n Baum also nicht bewegbar durch den Spieler oder sonstiges, und wenn man reinl&auml;uft, reingeschubst wird, gestuned ist w&auml;hrend so n Loch aufgeht, tja Pech, nicht schnell genug reagiert, jz biste insta tod. Also es sollten Grenzen bei den schwarzen L&ouml;chern sein, wobei wenn man im Schwarzen Loch ist, gibts kein Entkommen mehr, au&szlig;en rumlaufen w&auml;re ne Option, aber sobald man mal drinne ist, biste auch schon tot. Da sollte dann auch eine Riven zum Beispiel nicht mehr rauskommen. Und Teemos Pilze zum Beispiel wenn sie da grade mitten auf der Lane liegen, (ich spiele nur und gerne Teemo) tja Pech mein lieber Teemo, die Pilze sind dann eben futsch. Platzierst sie halt gscheiter xD. Zum Beispiel, also ich denke diese Methode w&uuml;rde den Spielspa&szlig; enorm anheben und neue Strategien entfesseln von denen man vorher vielleicht noch nicht mal wusste dass es diese gibt.\r\n\r\nWas denkt ihr dar&uuml;ber, schreibt mir bitte Eure Meinung, w&uuml;rde mich freuen.","replies":[{"poster":"Aufn Kopp Kloppa","date":"2017-08-06T08:18:06.659+0000","up_votes":1,"down_votes":0,"body":"Ich hab vergesse zu erwähnen, dass das Schwarze Loch nur zeitlich begrenzt von Ka sagen wir 15 Sekunden bestehen bleiben sollte. sonst hat man ja lauter Schwarze Löcher auf der Map :D","replies":[{"poster":"OT Riku","date":"2017-08-06T10:01:30.427+0000","up_votes":1,"down_votes":0,"body":"Als funmode ja aber bots sind nach einer Zeit kein Problem mehr.\nDu wirst früher oder später die normalen Bots 1v5 schlagen.\nZu den Lv bots in deinem Team Riot bannt diese Accounts in Wellen.\nUnd es ist eine art Wettrüsten von Riot und den Botprogrammierern, Riot bannt die programmierer ändern das Programm und Riot sucht und bannt wieder.","replies":[]}]},{"poster":"zoriax","date":"2017-08-06T09:13:06.889+0000","up_votes":1,"down_votes":0,"body":"Naja könnte man sich für einen Funmode überlegen aber nicht als dauerlösung gegen Bots","replies":[]},{"poster":"manial fly","date":"2017-08-06T08:40:53.732+0000","up_votes":1,"down_votes":0,"body":"Es gibt schon nen Mod mit schwarzen Löchern, nennt sich Sternenvernichter :p","replies":[]}]}