{"poster":"Limîted","date":"2016-06-20T18:32:27.903+0000","title":"Ich wurde Permanent gebannt für mein Chatverhalten...","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":12,"body":"Also ich poste euch hier den Chatlog rein ich glaube jemlich nicht das das ein permabann wert ist.. Ich hatte noch nie einen timebann und noch nie eine chatsperre... Ich habe in den Account sehr viel Zeit und Geld investiert und ich finde es nicht in Ordnung was Riot da mit mir macht. Ich würde mich ja mit einem 3-7 Tage ban zufrieden geben aber nicht mit einem Perma...\n\n\nSpiel 1\nLim&icirc;ted: the babysitt is real\nLim&icirc;ted: 4:29 second gank\nLim&icirc;ted: alles klar\nLim&icirc;ted: Ja ne is klar :D\nLim&icirc;ted: haha\nLim&icirc;ted: los geh back :D sonst biste gleich tot\nLim&icirc;ted: ok\nLim&icirc;ted: gank top pls\nLim&icirc;ted: lee gank nochmal top brauche kills der Jax is zu &auml;ngstlich\nLim&icirc;ted: ne\nLim&icirc;ted: er traut sich ja nicht richtig 1o1 ohne tower ^^\nLim&icirc;ted: soviel dazu\nLim&icirc;ted: und unser Jungler kommt nie ganken auch geil\nLim&icirc;ted: Gank top please\nLim&icirc;ted: lee sind war schon 7x oben\nLim&icirc;ted: holy shit\nLim&icirc;ted: Akali please\nLim&icirc;ted: It is not my prob when jax fed ^^\nLim&icirc;ted: GG\nLim&icirc;ted: wtf\nLim&icirc;ted: omg\nLim&icirc;ted: f\nLim&icirc;ted: noob\nLim&icirc;ted: useless jungler\nLim&icirc;ted: and wrong build\nLim&icirc;ted: omfg\nLim&icirc;ted: Hahaha\nLim&icirc;ted: du bekommst im 1o1 mega auf die fresse\nLim&icirc;ted: du kannst nichts machen ^^\nLim&icirc;ted: und top w&auml;re auch gewonnen w&uuml;rde Akali mal lernen zu junglen und auf h&ouml;ren zu sagen das ich juden vergasen soll ^^\nLim&icirc;ted: wtf f&uuml;r ?!\nLim&icirc;ted: GG\nLim&icirc;ted: Hahaha penta with Akali easy\nLim&icirc;ted: f&uuml;r was willsten du mich reporten ?\nLim&icirc;ted: hahahaha\nLim&icirc;ted: GG\nLim&icirc;ted: honor akali best jungler euw no ganks\nLim&icirc;ted: GG\n\nSpiel 2\nLim&icirc;ted: GG blitz afk -,-\nLim&icirc;ted: np\nLim&icirc;ted: my bad\nLim&icirc;ted: wtf\nLim&icirc;ted: i can&#039;t do nothing ^^\nLim&icirc;ted: Leona E+q+r\nLim&icirc;ted: really ?!\nLim&icirc;ted: WTF\nLim&icirc;ted: kha pls gank bot\nLim&icirc;ted: blitz why fokus malph ?!\nLim&icirc;ted: wtf blitz 4/5\nLim&icirc;ted: GG\nLim&icirc;ted: Darius stfu\nLim&icirc;ted: Salty kid ^^\nLim&icirc;ted: mit der einstellung gewinnst du nie\n\nSpiel 3\nLim&icirc;ted: wtf\nLim&icirc;ted: als ob\nLim&icirc;ted: easy\nLim&icirc;ted: dann h&auml;ttest rengar spielen sollen\nLim&icirc;ted: np\nLim&icirc;ted: bin nur jungler\nLim&icirc;ted: the camp is real\nLim&icirc;ted: Wo ist der Zed den ?!\nLim&icirc;ted: wenigstens kommst du weg\nLim&icirc;ted: Okay\nLim&icirc;ted: Irgendwie verkacken hier grad alle\nLim&icirc;ted: Please report Zed\nLim&icirc;ted: sch&ouml;n das wir wegen dir das game verlieren weil du afk warst -,-\nLim&icirc;ted: H&Ouml;RT A UF ZU FIGHTEN\nLim&icirc;ted: WIR VERLIEREN DADURCH ZU 100%\nLim&icirc;ted: omg\nLim&icirc;ted: NEIN\nLim&icirc;ted: nicht\nLim&icirc;ted: GG","replies":[{"poster":"Der Großmugister","date":"2016-06-20T18:36:44.225+0000","up_votes":4,"down_votes":0,"body":"> Lim&amp;icirc;ted: mit der einstellung gewinnst du nie","replies":[{"poster":"Limîted","date":"2016-06-20T18:39:15.450+0000","up_votes":2,"down_votes":2,"body":"Wir haben alle 3 games gewonnen xD \nmir geht es darum das ich für diesen Chatlog perma gebannt wurde ^^ und das finde ich nicht fair da es nichts schlimmes ist... in dem Account sind über 700€ investiert wurden und die bannen ihn permanent ^^ Ich habe mir davor noch nie was zu Schulden kommen lassen und dann auf einmal dierekt einen Permabann ?! Waaas","replies":[{"poster":"Der Großmugister","date":"2016-06-20T18:43:53.287+0000","up_votes":5,"down_votes":0,"body":"Mit nie was zu Schulden kommen lassen meinst du also, dass du nie eine Chtrestriction oder einen 14-tage-Bann hattest?\n\nKann ich mir kaum vorstellen!\n\nDie Chatlogs sind toxisch! Du benimmst dich ätzend und respektlos!\nEin Perma ohne Vorstrafe, ist meiner Meinung nach nicht ganz berechtigt, ich wette aber, dass du vorbestraft bist und dann geht es absolut klar!","replies":[{"poster":"Limîted","date":"2016-06-20T18:52:10.786+0000","up_votes":1,"down_votes":4,"body":"Nein hatte noch nie eine Strafe können alle meine Freunde auch bezeugen.","replies":[{"poster":"Der Großmugister","date":"2016-06-20T19:01:54.639+0000","up_votes":7,"down_votes":0,"body":"Ich kann das ohnehin nicht prüfen, daher mache ich mir auch keine Gedanken darüber, ob es die Wahrheit ist oder nicht.\nWenn es stimmt, dann hat die Chatanalyse die Stelle mit dem Vergasen, als Hetzrede \"fehl?\"interpretiert, in dem Fall könnte sich ein Ticket  an den Support lohnen, evtl. wird dein Permabann dann zu einer Chatrestriction.\n\nIm Umgang mit dem Support empfehle ich dir, Aussagen wie \"das ist alles nicht schlimm\" zu unterlassen.\nDu hast für dein Verhalten definitiv eine Strafe verdient! Nur eben nicht, in erster instanz, die Höchststrafe.\nKonzentriere dich also nur auf den Fehler mit dem \"Juden vergasen\" und weise sie darauf hin, dass du einen Mitspieler zitiert hast.\nMit etwas Glück, wird das als weniger schlimm angesehen, deine Chancen stehen besser, wenn du zugibst, insgesamt Fehler gemacht zu haben.\n\nStelle dich aber darauf ein, dass du erstmal 2-3 automatische Antworten bekommst, der Support bekommt unzählige, blödsinnige \"ich wurde unschuldig bestraft\"-Tickets, wesshalb man hartnäckig sein muss, um an einen Menschen zu geraten.\nDrohe nicht mit rechtlichen Schritten, da hast du ohnehin keinerlei Handhabe und der Support ist ab dem Moment verpflichtet, dir nichts mehr zu schreiben sondern nur über Anwälte zu kommunizieren.\n\nViel Erfolg und ändere dein Verhalten, mit deiner momentanen Ausdrucksweise, bist du nach der ersten Strafe, dennoch nur 3 weitere Spiele vom Perma entfernt, ein erfolgreiches Ticket wäre also nur ein Aufschub.","replies":[]}]}]},{"poster":"LegendaryXenon","date":"2016-06-20T18:44:47.602+0000","up_votes":2,"down_votes":0,"body":"Könnte der Satz mit dem \"Juden vergasen \" sein, der falsch übersetzt wurde.\n\nIm Endeffekt muss da aber vorher cr+cr+2w gewesen sein. \nEinen Bann hast du aber definitiv für dein Verhalten verdient, du wirkst überheblich, toxisch, bist beleidigend und blamest im allChat.  In der Summe reicht das wohl.","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-06-20T18:46:03.549+0000","up_votes":5,"down_votes":0,"body":"Bist du dir ganz sicher, dass du noch keine einzige Strafe vom Instantfeedbacksystem erhalten hast? \n\nBei dem Chatlog sollte es nämlich nicht direkt zum Permabann kommen.","replies":[{"poster":"Limîted","date":"2016-06-20T18:52:30.947+0000","up_votes":2,"down_votes":1,"body":"Ja ich bin mir ganz sicher.","replies":[{"poster":"Humpelstilzche","date":"2016-06-20T21:11:32.178+0000","up_votes":5,"down_votes":0,"body":"Bitte kontrollier das nochmal. Geh bitte deine Emails durch (auch die im Spamordner) und durchsuch sie nach Mails von Riot. Einen sofortigen Perma zu bekommen ohne jemals zuvor bestraft worden zu sein ist nämlich schlicht nicht möglich. \n\nSolltest du nichts finden, kann ich das gerne auch nochmal an einen Rioter weitergeben der sich das mal genauer anschaut. Ich würde mich dann mit den Infos die ich bekomme hier nochmal melden, wenn du einverstanden bist. Wäre das okay für dich?\n\nAber, wie gesagt: Vorher Emails checken!","replies":[{"poster":"Limîted","date":"2016-06-21T12:39:45.586+0000","up_votes":2,"down_votes":1,"body":"Habe meine Emails gecheckt und nur die Antworten vom Support gefunden, keine Email mit dem genauen Grund des banns","replies":[{"poster":"eingew","date":"2016-06-21T14:19:37.034+0000","up_votes":5,"down_votes":0,"body":"Die Chatlogs hat dir also der Support nach einer Anfrage zugesendet... kannst du uns dann einen Screen von dem Ticket geben?\n\nEdit:\n\nWenn du dich im Client einloggst sollte da neben deinem Chatlog auch ein Button sein mit dem du auf eine Website, also deine Reformkarte kommst. Wenn du uns den Link gibst, dann hast du uns alles gegeben, um zu beweisen, dass der obige Log nicht gekürzt wurde.\nOder du machst halt Screenshots.","replies":[]}]}]}]},{"poster":"AmazingMaze","date":"2016-06-20T18:49:00.316+0000","up_votes":4,"down_votes":0,"body":"Ich denke dass das System die Aussage \"auf hören zu sagen das ich juden vergasen soll\" nicht als Zitat erkannt hat.\nSoweit ich weiß wird Rassismus sehr schnell hart bestraft. Vorausgesetzt natürlich es war tatsächlich ein Zitat und er hat mit den Vorstrafen die Wahrheit gesagt.","replies":[{"poster":"Sirrkas","date":"2016-06-20T18:51:04.920+0000","up_votes":4,"down_votes":0,"body":"Bei einem einzigen Kommentar in der Richtung, würde ich eher von einem direkten 2 Wochenbann ausgehen.","replies":[{"poster":"Balzifer","date":"2016-06-20T19:23:36.318+0000","up_votes":2,"down_votes":1,"body":"Ich ging auch davon aus das 2 Spieler die ich am Samstag als Gegner hatte mit Sicherheit einen Permabann kassieren würden.\n\nDiese haben 20-30 Minuten lang haufenweise rassistische Parolen in den Allchat geschrieben, aber wie immer gab es keine Ingamemeldung das der Report zu einer Strafe führte (Ich bezweifle deren Existenz eh langsam), und nach einer Kontrolle heute spielen beide munter weiter auf ihren Accounts . \n\nWenn der Chatverlauf von den beiden Typen von der Analyse nicht mal als 14 Tage Bann eingestuft wurde, dann waren alle die bisher hier im Forum gepostet haben zu 100% Unschuldig.","replies":[{"poster":"Sirrkas","date":"2016-06-20T21:23:40.758+0000","up_votes":5,"down_votes":0,"body":"Keine Angst, die Benachrichtigungen gibt es noch. Ich habe letzten Monat erst eine erhalten. Die Frage ist eher, wie oft man sie kriegt und wann. Scheinbar muss es der letzte Report vor dem Bann gewesen sein. Wenn die Leute als zum Beispiel für rassistische Aussagen gebannt werden, das aber erst nach 2 bis 3 Vorfällen geschieht und du nicht im letzten gemeldet hast, wirst du wohl keine Benachrichtigung sehen.","replies":[]}]}]}]}]},{"poster":"Abasin","date":"2016-06-21T08:53:08.045+0000","up_votes":5,"down_votes":0,"body":"Dass Du noch nie einen Bann oder CR hattest, glaube ich Dir einfach nicht. Die Flamerei geht Dir einfach zu routiniert durch die Tasten. Spielverläufe lassen sich checken, auffällige Pausen von z.B. 14 Tagen fallen auch schnell ins Auge...und die Forencracks hier kann man nicht so leicht hinters Licht führen. Wenn Du hier alle Information so gut es geht verlinkst, dann kann man sich das ansehen und Dir gezielt Tipps geben. Der Copy&Paste Deines Chatlogs reicht nicht aus, der könnte von Dir manipuliert worden sein, also lass uns lieber auf die Quelle schauen. Auch die Mail mit dem Banngrund und die Mails vom Support wären interessant. Es liegt an Dir.","replies":[{"poster":"eingew","date":"2016-06-21T10:38:03.063+0000","up_votes":5,"down_votes":0,"body":"Ich möchte diesem Kommentare an dieser Stelle nachdruck verleihen. Auch ich wäre äußerst interessiert an Beweisen hinsichtlich der Logs und natürlich der mehrfach erwähnten, äußerst dubiosen, angeblichen Supportantworten. Andernfalls halte ich deine \"Beweise\" für nicht ausreichend um mich von einem derart massiven Fehler der Chatanalyse zu überzeugen.","replies":[]},{"poster":"Limîted","date":"2016-06-21T12:36:29.644+0000","up_votes":1,"down_votes":1,"body":"Antwort 1 :\n\n Ardeol (Riot Games Player Support)\n\n19. Juni, 11:52 PDT\n\nHallo LimĂŽted,\n\ndein Konto wurde dauerhaft gesperrt, nachdem unsere Disziplinarverfahren bereits zu mehrfachen Strafmaßnahmen geführt haben.\n\nBitte melde dich bei deinem Client an, um deine Reformkarte mit den jüngsten Spielen zu sehen, die zu dieser Maßnahme geführt haben. Bei Riot Games ermuntern wir Spieler zwar dazu, sich zu bessern, entfernen aber stets Spieler aus unserem Spiel, die fortlaufend für negative Spielerlebnisse sorgen.\n\nZu dieser Maßnahme kommt es erst, wenn wiederholte Strafmaßnahmen erfolgt sind, und wir werden die Sperre unter keinen Umständen aufheben.\n\nObwohl dies das Ende des Weges ist, sind wir zuversichtlich, dass du mit etwas Abstand bei den nächsten von dir gespielten Spielen ein anderes Verhalten zeigen wirst.\n\nAlles Gute bei deinen künftigen Unternehmungen.\n\nMit freundlichen Grüssen, Ardeol\nRiot Games\nPlayer Support\n\n\"Rock solid\"\n\nAntwort 2 : \n\n \t\n\nArdeol (Riot Games Player Support)\n\n20. Juni, 05:38 PDT\n\nHey,\n\nes tut mir wirklich sehr Leid, dass du diese Bestrafung ungerecht findest, doch du bist selber für den Stand deines Kontos verantwortlich. Wir würden nie diese Maßnahmen ergreifen, ohne 100% sicher zu sein, dass es sich wirklich um Fehlverhalten handelt.\n\nSolltest du weiterhin jegliche Hilfe benötigen, sind wir bereit dir dabei zu assistieren.\n\nMit freundlichen Grüssen, Ardeol\nRiot Games\nPlayer Support\n\n\"Rock solid\"\n\n\n\nAntwort 3 : \n\n\n Ardeol (Riot Games Player Support)\n\n20. Juni, 11:37 PDT\n\nHallo nochmal,\n\nwir haben den Fall sorgfältig geprüft und festgestellt, dass du unsere Regeln verbrochen hast, deswegen ist diese Strafe gerechtfertigt.\n\nBei weitergehenden Fragen oder Anliegen stehe ich gerne zur Verfügung, aber denke daran, dass wir unsere Entscheidung in dieser Sache auf keinen Fall rückgängig machen werden.\n\nMit freundlichen Grüssen, Ardeol\nRiot Games\nPlayer Support\n\n\"Rock solid\"\n\nSo das sind die Antworten die ich bis jetzt erhalten habe, ich habe leider keine Email in der drinen steht wehalb ich genau gebannt wurde, ich wurde nur aus dem Spiel geworfen habe mich neu eingelogt und da steht jetzt : Limîted permanent gebannt.... und der Chatlog den ich euch geschickt habe.","replies":[{"poster":"Haudruppmoor","date":"2016-06-21T12:43:19.165+0000","up_votes":2,"down_votes":0,"body":"Fehlt nur noch ein Link zu der Reformkarte.\n\nmfg\nMB","replies":[{"poster":"Limîted","date":"2016-06-21T12:44:51.047+0000","up_votes":1,"down_votes":0,"body":"Und wie bzw wo bekomme ich den ? Habe wie gesagt keine Email erhalten","replies":[{"poster":"Haudruppmoor","date":"2016-06-21T12:47:44.562+0000","up_votes":2,"down_votes":0,"body":">Bitte melde dich bei deinem Client an, um deine Reformkarte mit den jüngsten Spielen zu sehen, die zu dieser Maßnahme geführt haben.\n\nDas müßte doch ein Link sein, und wenn Du draufklickst öffnet sich Dein Browser und zeigt Dir den Chatlog an. Dann brauchst Du nur noch die Adresszeile zu kopieren, oder geht das net ? Bin verwirrt .","replies":[{"poster":"Limîted","date":"2016-06-21T12:50:45.746+0000","up_votes":1,"down_votes":0,"body":"Das steht bei mir nicht o.O","replies":[{"poster":"Sirrkas","date":"2016-06-21T14:07:23.334+0000","up_votes":4,"down_votes":0,"body":"Im Zweifelsfall kannst du auch Screenshots vom Pop-Up machen. Das werden zwar viele, wenn du es aber so machst, dass der Chat überlappend ist (also wenn ein Screen zum Beispiel mit \"ok\" endet, sollte der nächste an die Stelle zeigen und dann weiter gehen) , kannst du uns damit auch zeigen, dass du nichts ausgelassen hast.","replies":[]},{"poster":"Haudruppmoor","date":"2016-06-21T13:00:52.691+0000","up_votes":3,"down_votes":0,"body":"Häh, doch, in Deiner ersten Mail steht was von Reformkarte. Ich bin mir ziemlich sicher, daß das ein Link zu einer Webseite ist, wo der Chatlog aufgeführt ist. Und diesen Link kannste kopieren.","replies":[]}]}]}]}]},{"poster":"HyperionCH","date":"2016-06-21T14:00:10.908+0000","up_votes":3,"down_votes":0,"body":"Du hast aber vorher geschrieben, dass Riot einen Fehler gemacht habe.\n\nHier steht dies nirgends, im Gegenteil! Riot bestätigt nochmals klar, dass die Strafe berechtigt ist.","replies":[]},{"poster":"Abasin","date":"2016-06-21T13:18:14.769+0000","up_votes":3,"down_votes":0,"body":"> Zu dieser Maßnahme kommt es erst, wenn wiederholte Strafmaßnahmen erfolgt sind, und wir werden die Sperre unter keinen Umständen aufheben.\n\nDieser Satz alleine stellt schon klar, dass Du bereits vorher auffällig warst und entsprechende \"Vorstrafen\" erhalten hast. Also leider nix mit noch nie etwas bekommen. Es ist zwar nicht ausgeschlossen, dass Du einige Mails ignoriert hast oder deren Inhalt nicht richtig gedeutet hast. Dennoch steht ausser Zweifel, dass Du nicht aus heiterem Himmel gebannt wurdest.","replies":[]}]}]},{"poster":"AmazingMaze","date":"2016-06-20T18:43:15.345+0000","up_votes":5,"down_votes":0,"body":"Wenn du die Wahrheit sagst und noch nie einen Chatbann oder 14 Tage Sperre hattest, hat das System wohl diese Aussage \"Limîted: und top wäre auch gewonnen würde Akali mal lernen zu junglen und auf hören zu sagen das ich_** juden vergasen**_ soll ^^\" nicht als Zitat erkannt und dir dafür den Perma gegeben.\n\nWie gesagt, wenn du die Wahrheit sagst ist das ganze zwar bestrafungswürdig aber keinen direkten permanenten Bann wert.\nSchreib den Support an, nur die können dir weiter helfen.","replies":[{"poster":"Limîted","date":"2016-06-20T18:54:22.085+0000","up_votes":1,"down_votes":6,"body":"Der support meint das mein account gesperrt bleibt und sie irgendwie einen fehler gemacht haben oder sowas ^^","replies":[{"poster":"AmazingMaze","date":"2016-06-20T19:06:23.463+0000","up_votes":4,"down_votes":0,"body":"Moment, sie sagen sie hätten einen Fehler gemacht aber der Account bleibt gesperrt?\nErklär mir das bitte genauer, das macht so keinen Sinn.","replies":[{"poster":"Limîted","date":"2016-06-20T19:08:44.218+0000","up_votes":1,"down_votes":3,"body":"Sowas in der Art, ein Freund hat auch ein Ticket geschrieben und da wurde zu Ihm gesagt das ein Fehler aufgetreten ist aber sie meinen Bann nicht aufheben werden ^^ Also wahrscheinlich das mit meinemt Zitat \" Juden vergasen \"","replies":[{"poster":"Humpelstilzche","date":"2016-06-20T21:05:07.910+0000","up_votes":5,"down_votes":0,"body":"Das würde ich an deiner Stelle nochmal ganz genau lesen, denn das gibts eigentlich nicht. Wenn Riot einen Fehler macht, biegen sie das wieder gerade anstatt den Ban einfach zu lassen. \nPoste doch bitte mal den exakten und vollständigen Inhalt der Antwort des Supports, ich bin mir sicher wir können dir dabei helfen das richtig zu interpretieren (oder dem Support auf die Finger klopfen, wenn er tatsächlich Blödsinn geschrieben hat).","replies":[]},{"poster":"Der Großmugister","date":"2016-06-21T06:02:55.498+0000","up_votes":3,"down_votes":0,"body":"Zeig doch bitte mal einen Screenshot von der Antwort.","replies":[]},{"poster":"XenesisCH","date":"2016-06-20T21:18:34.426+0000","up_votes":3,"down_votes":0,"body":"Ich möchte die Antwort vom Support gerne mal lesen. Nimmt mich wunder was der schreibt. Kannst du die mal reinposten?","replies":[]},{"poster":"AmazingMaze","date":"2016-06-20T19:58:04.622+0000","up_votes":3,"down_votes":0,"body":"Dann schreib ihnen noch mal oder eröffne ein neues Ticket.\nWeil wenn es wirklich so ist wie du das hier beschreibst würde ich nicht locker lassen.","replies":[]},{"poster":"Darkr3sQ","date":"2016-06-21T07:11:03.657+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Limîted,realm=EUW,application-id=KYnfKGf0,discussion-id=V7PTKIEL,comment-id=0004000000000000,timestamp=2016-06-20T19:08:44.218+0000)\n>\n> Sowas in der Art, ein Freund hat auch ein Ticket geschrieben und da wurde zu Ihm gesagt das ein Fehler aufgetreten ist aber sie meinen Bann nicht aufheben werden ^^ Also wahrscheinlich das mit meinemt Zitat &quot; Juden vergasen &quot;\n\nWas mich daran stutzig macht ist, dass ein Freund Auskunft über Dein Konto erhält. Normalerweise gibt der Support keine Auskunft über andere Konten raus.","replies":[]}]}]}]}]},{"poster":"oneshot Vasco","date":"2016-06-23T00:51:22.070+0000","up_votes":1,"down_votes":0,"body":"Und wie sieht es jetzt aus hier? konnte kein endergebnis finden in den kommis? :D ich hoffe gab eine lösung?","replies":[{"poster":"Limîted","date":"2016-06-23T10:20:03.023+0000","up_votes":1,"down_votes":7,"body":"Account bleibt gebannt ^^ Hätte es einfach wie nen anderer machen sollen und sagen sollen mein Account wurde gehackt obwohl es garnicht stimmt ^^","replies":[{"poster":"Sirrkas","date":"2016-06-23T10:36:07.555+0000","up_votes":6,"down_votes":0,"body":"Dir ist bewusst, dass der Riotsupport deinen Fall ansehen kann? Die sehen also deinen Chatlog und deine vorherigen Strafen. Auch dann, wenn du ihnen schreibst, du wärest angeblich gehackt worden, wirst du dann wohl kaum entbannt werden.","replies":[]}]},{"poster":"HyperionCH","date":"2016-06-23T07:03:01.655+0000","up_votes":4,"down_votes":1,"body":"Es gab schon vor dem Erstellen des Thread eine Lösung, jedoch gefällt diese derm TE nicht. ;)","replies":[]}]},{"poster":"Schlampe des ADC","date":"2016-06-20T18:56:00.113+0000","up_votes":2,"down_votes":1,"body":"Spiel 1 :\n\n> Limîted: gank top pls\n> Limîted: **lee gank nochmal top** brauche kills der Jax is zu ängstlich\n---\n\n.\n> Limîted: und unser Jungler kommt nie ganken auch geil \n\n(Dazu komme ich gleich)\n\n---\n> Limîted: Gank top please\n> Limîted: lee sind war schon 7x oben\n---\n\n(Dazu komme ich gleich)\n> Limîted: useless jungler\n\n---\n\n.\n> Limîted: honor akali best jungler euw no ganks\n\n---\n\nSooo, zur Zusammenfassung :\nDu hast (nach diesen Verlauf) insgesamt 10x geflamed das der Jungler top gehen soll... und dann flamest (sry wenn ich das so behindert schreibe :D) du den Jungler weiterhin, das er dir helfen soll ? Junge.... (ich höre mal hier auf zuschreiben.. sonst wird mein Kommentar noch gelöscht...)\n---\nSpiel 2 :\n7x geflamed.... Bist du *censored* ?????????????  Junge... und dann noch dieser spruch :\n\n> Limîted: mit der einstellung gewinnst du nie\n\nDu hast etwas gewonnen... einen Free Ban\n\n---\nSpiel 3 :\nzum letzten kann ich nichts sagen... oh doch, warte :\n\n> Limîted: mit der einstellung gewinnst du nie\n\nDu hast etwas gewonnen... einen Free Ban\n---\n\nMFG - Der Feeder","replies":[{"poster":"Limîted","date":"2016-06-20T18:58:27.312+0000","up_votes":0,"down_votes":6,"body":"Spiel 2 und 3 Waren mit 4 freunden ^^ da haben wir uns gegenseitig geblamed ^^ Aber das glaubt der support natürlich nicht ^^ obwohl sie es bezeugen","replies":[{"poster":"Sirrkas","date":"2016-06-20T19:18:22.162+0000","up_votes":5,"down_votes":0,"body":"Ich glaube dir das auch nicht, weil der Teamchathat bei vollen Premadegruppen bisher nie gewertet wurde.","replies":[]},{"poster":"HyperionCH","date":"2016-06-21T07:29:54.552+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Limîted,realm=EUW,application-id=KYnfKGf0,discussion-id=V7PTKIEL,comment-id=00080000,timestamp=2016-06-20T18:58:27.312+0000)\n>\n> Spiel 2 und 3 Waren mit 4 freunden ^^ da haben wir uns gegenseitig geblamed ^^ Aber das glaubt der support natürlich nicht ^^ obwohl sie es bezeugen\n\nAlso aus meiner Sicht war zumindest Spiel 2 nur 1 Premade im Spiel (sonst müssten es Premades sein, mit denen du in den letzten 20 Games maximal 2 Games gespielt hast; und dann auch nicht hintereinander).\nDer Premade war übrigens Ahri; den einzigen Champ, den du nicht geblamed hast.\nbtw. habt ihr das Game auch verloren, weshalb deine Aussage, dass alle 3 Games gewonnen wurde, auch nicht stimmt.\n\nFazit:\nDeine Aussage, dass ihr unter Freunden geblamed habt, glaube ich dir kein Wort. Sorry!\n\nDeshalb habe ich auch meine Zweifel, ob deine \"Mai-Pause\" von über 2 Wochen wirklich gewollt war.\nGerne hätte ich auch den Link zum Chatlog. Sorry, aber wenn schon einige deiner Aussagen nicht korrekt sind, habe ich die Befürchtung, dass auch der chatlog abgekürzt sein konnte. Dies kam in der Vergangenheit leider hier im Forum auch schon bei einzelnen bestraften Spielern vor.","replies":[]},{"poster":"eingew","date":"2016-06-20T19:33:06.621+0000","up_votes":3,"down_votes":0,"body":"Der Support prüft das sogar, das hat nichts mehr mit glauben oder nicht glauben zu tun. Wenn der Support das als falsch ansieht... dann liegt es daran, dass diese Aussage falsch ist - außer der Support hat einen massiven Fehler gemacht, was erst mal unwahrscheinlich ist, weil der bei einer Prüfung schnell auffällt und ich gehe jetzt einfach mal aus, dass du das in mehr als einer Antwort versucht hast zu klären.","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2016-06-21T08:57:47.954+0000","up_votes":1,"down_votes":0,"body":"Das ist aber recht harmlos, wenn man das mit anderen Permabaned Chatlogs vergleicht.","replies":[{"poster":"Limîted","date":"2016-06-21T12:29:15.396+0000","up_votes":1,"down_votes":2,"body":"Ja, und da ich noch nie eine sperre hatte mit dem Account, und noch nie eine chatsperre ist es echt ungerecht das es dierekt ein Permabann ist","replies":[{"poster":"Bettnachleger","date":"2016-06-21T16:16:03.847+0000","up_votes":3,"down_votes":0,"body":"Der Riot Support schreibt aber was anderes.\nDu hattest schon andere Strafen.","replies":[]}]}]},{"poster":"Wernicke","date":"2016-06-21T15:39:05.631+0000","up_votes":3,"down_votes":0,"body":"Durch den thread gewühlt...\nMeine Gedanken, das wird wohl alles seine Richtigkeit haben, weil hier iwas vorne u hinten nicht stimmt, und der TE, weshalb auch immer, iwas auslässt, verheimlichen will, whatever... Vlt war ihm nicht ganz bewusst das auch einfache Forenuser alles nachgucken und ggf bestätigen oder auf Ungereimtheiten aufmerksam machen können, und nu weiß er nicht wie er aus der Nr. wieder raus kommen soll^^ \n\nWenn ich mir den gesendeten chatverlauf anschaue, glaube ich sowieso noch mehr dass das alles seine Richtigkeit hat und der TE auch schon vorher Strafen hatte. 14 tägige Pausen wurden ja sogar schon ausgemacht.\n\nUnd auch hier noch mal: Es ist sowas von sch*** egal wieviel Geld du in dein Acc gesteckt hast. Dadurch gibt es keine Sonderbehandlung. \nDu hättest vlt mal eher über dein chatverhalten nachdenken sollen, wenn du ach soviel Kohle in den Acc gesteckt hast!\nVlt einfach mal spielen anstatt wie ein kleines Mädchen chatten?!","replies":[]},{"poster":"Der Großmugister","date":"2016-06-21T12:14:13.093+0000","up_votes":3,"down_votes":0,"body":"Um mal vorsichtshalber eine Sache klarzustellen, du bist die im klaren darüber, dass es dir nichts bringt uns anzulügen? nichtmal wenn wir dir hier alle glauben würden?\n\nKeiner von uns kann dich entbannen und  der Support kann deine Aussagen mit einem Klick überprüfen. Wenn wir dich hier also auf Grund von Lügen unterstützen, kommst du damit dennoch nicht durch.","replies":[{"poster":"Limîted","date":"2016-06-21T12:28:29.245+0000","up_votes":1,"down_votes":1,"body":"Ist mir bewusst ^^ aber wieso sollte ich Lügen ? Mir ist auch bewusst das das mit dem flamen nicht richtig war. Es tut mir ja auch leid","replies":[]}]}]}