{"poster":"Squishy Tank","date":"2016-10-03T10:23:59.139+0000","title":"Zilean Bug","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Als Zilean-Main ist mir ein kleiner Bug aufgefallen - der zwar klein und l&auml;stig, aber in einscheidenden Situationen auch den Unterschied machen kann...\r\n\r\nEs geht hierbei um seine Passive F&auml;higkeit: Wenn ich mit Zilean jemanden bef&ouml;rdern k&ouml;nnte, dieser sich jedoch out of range befindet um bef&ouml;rdert zu werden, dann kann ich Zilean zwar den Befehl geben, er n&auml;hert sich auch dem verb&uuml;ndeten Champ bis auf Range, STOPPT dann... und tut garnichts.\r\nAuch bei erneutem Klick auf den Champ passiert nichts, er wird nicht bef&ouml;rdert, n&auml;hert sich wenn notwendig zwar weiterhin, beginnt auch manchmal eine Animation welche aber wieder sofort abgebrochen wird... und passiert nichts.\r\n\r\nFakten: Man muss sich innerhalb der Range befinden um den Belohnungsvorgang via Passive starten zu k&ouml;nnen. Sollte sich der Verb&uuml;ndete nach dem Animationsstart wegbewegen oder wegporten, wird der Verb&uuml;ndete trotzdem &quot;zu Ende&quot; bef&ouml;rdert. \r\n\r\nBefinde ich mich jedoch nur knapp au&szlig;erhalb der Range, der Verb&uuml;ndete bewegt sich nicht und ich m&ouml;cht ihn bef&ouml;rdern, dann n&auml;hert sich Zilean zwar aber STOPPT aprupt... und macht nichts. Erneute Aktivierung &uuml;ber dem Champ bring wie gesagt nichts (es sieht so aus als wolle er sich bewegen oder eine Animation starten) - man MUSS Zilean manuell den Befehl geben, noch einen Schritt zu n&auml;hern, bevor man die Aktion starten kann.\r\n\r\nF&uuml;r mich kann das so nicht gewollt programmiert sein und muss sich meiner Meinung nach um einen Bug handeln.","replies":[{"poster":"Bigf0ot","date":"2016-10-10T14:46:31.983+0000","up_votes":1,"down_votes":0,"body":"Ich glaube es liegt daran, das Riot kommplett aus italienern besteht, so viel spagetthi code wie die benutzen. So war wahrscheinlich die einfachste lösung und umsetzung der passive.","replies":[]},{"poster":"GAME ON","date":"2016-10-05T03:01:34.701+0000","up_votes":1,"down_votes":0,"body":"Falls du es noch nicht reproduziert/getestet hast, könnte daran liegen dass Zilean sich ausserhalb des kampfes befinden muss.","replies":[]}]}