{"poster":"Squeaky101","date":"2015-05-25T02:08:58.800+0000","title":"Current state of spell popularity is less and less diverse","subforum":"Gameplay","embed":{"description":null,"url":"http://i.imgur.com/wJbtN0q.png","image":"http://imgur.com/wJbtN0qs.png"},"up_votes":67,"down_votes":3,"body":"Summoner Spells are a very important aspect of League, but throughout the last few years they have started to become less and less diverse. As you can see in the chart from LoLKing.net, some spells are magnitudes greater in popularity than the others, with a few spells ({{summoner:2}} ,{{summoner:13}} ,{{summoner:1}} and {{summoner:6}}) only taking up 0.3% of the chart. 0.3 percent! for FOUR spells! \n\nRiot has tried to implement new spells, some succeeded (like barrier) while others did not (like Surge). But much time has passed, and the current lineup of spells have not been touched upon for a long time. The chart speaks for itself. {{summoner:4}} is so essential that they might as well just give it to everyone for free! Summoner Spells could be so much more immersive, with greater variety to choose from. Around half of the spells we currently have rarely see use, while Flash is the go-to spell that everyone is obliged to take because of its usefulness. It would be very interesting to see how the other spells could be touched upon, buffed or tweaked in order to become relevant. \n\nIf any Rioters come across this post, I am curious as to what the balancing team thinks about the current state of Spell popularity, and if you are looking into possible changes in the future. \n\nAnd of course, I am curious as to what the community thinks as well. Please let us know what you think about the current state of Spell popularity.\n\nLink to the chart for those interested: http://www.lolking.net/charts?region=all&type=spell-popularity&range=daily&map=sr&queue=normal\n\n**Edit:** Now I know many people are defending against what I said about {{summoner:4}} being too popular, but what I meant is that it is too popular simply because the other spells aren't worth taking over it. Flash is fine how it is, but if some other spells got improved (the blue spells) then we would see them being used more, adding more of that diversity that we saw in the early days of League. New spells would be welcomed with open arms too. We have had a great addition so far ({{summoner:21}} ), and there are probably some other ideas that could be made into new spells. \n \n \n \n>  \n> _\"Change is good\"_\n> _Kha'Zix, the Voidreaver_","replies":[{"poster":"sp441","date":"2015-05-25T04:10:59.587+0000","up_votes":65,"down_votes":4,"body":"While I don't think Ghost is too bad, the other spells you mentioned are *definitely* pretty crap. Clarity is nearly completely useless later in the game, Cleanse requires tight timing and lacks the clutch recovery from Barrier or Heal, and Clairvoyance's job can be done just as well by a Blue trinket without giving up one of your summoner spells. Barrier also runs into problems of just being an overall lesser Heal most of the time.\n\nMaybe Ghost should have some out-of-combat bonus movement speed, Clarity should refresh all cooldowns by 80% and raise your CDR by 15% for 10 Seconds, Clairvoyance should drop a stealth ward on top of revealing wards, traps, and stealth champions, Cleanse should give you a 50% movement speed burst that decays over 3 seconds, and maybe Heal should heal more than Barrier protects, but heal over a short time instead of instantly.","replies":[{"poster":"YOU BEEN WARNED","date":"2015-05-25T05:40:51.923+0000","up_votes":10,"down_votes":2,"body":"I approve, your ideas are well thought and logically implemented.","replies":[]},{"poster":"NorthernDruid","date":"2015-05-25T13:21:13.488+0000","up_votes":3,"down_votes":0,"body":"Clarity refreshing (non-ultimate/passive) cooldowns would be pretty damn neat.\n\nThat alone would make it competitive with the currently good spells (would probably have to lower the mana restore, but still).","replies":[{"poster":"Old Man Teeto","date":"2015-05-25T15:54:48.117+0000","up_votes":6,"down_votes":2,"body":"Making Clarity a combat summoner by making it a refresher Orb only destroys the reason to take Ignite as a combat summoner.\n\nIgnite would only be worth taking against healing specific champions such as Swain/Mundo or on champions with non-existent CD's such as Yasuo.\n\nAs reference, imagine Syndra with Clarity that also refreshes her non-ultimate CD's.  Q -> E -> W -> Q -> Refresh -> E -> Q -> R.  That wouldn't even be too difficult to pull off and you could fish for it from a good safe range.\n------\n\nIgnite would have added 70-410 damage.  The combo above easily adds more than ignite would while adding kit synergy.","replies":[]}]},{"poster":"It Hertz When IP","date":"2015-05-25T11:47:38.099+0000","up_votes":2,"down_votes":1,"body":"No to the Ghost idea, cause Hecarim will become even more unbearable than he already is.\n\nThe rest sound interesting; would the Clarity buff override the 40% CDR cap?","replies":[{"poster":"sp441","date":"2015-05-25T12:03:53.624+0000","up_votes":3,"down_votes":0,"body":"Better not, a 80% cooldown refresh is already pretty powerful on champions capped by long cooldowns.\n\nAlso, not entirely sure whether it should be self-cast only or also target a friendly ally like Heal.","replies":[]}]}]},{"poster":"Akeydel","date":"2015-05-25T02:31:38.160+0000","up_votes":7,"down_votes":5,"body":"Can I get a source? the pie chart seems disproportionate as {{summoner:11}} should take up more than 1/5 (since jungles ALWAYS take it, and now other lanes take it too), but seems to be taken less than {{summoner:14}}.","replies":[{"poster":"Squeaky101","date":"2015-05-25T02:36:15.242+0000","up_votes":25,"down_votes":0,"body":"http://www.lolking.net/charts?region=all&type=spell-popularity&range=daily&map=sr&queue=normal\n\nActually, Smite is where it should be at 10%, remember that each person has 2 spells, so in a match there are 20 spells taken. If each jungler takes 1 smite each, that's 2/20 or 1/10.\n\nEven if the chart were to be a little off, it is a well known fact that Flash is taken 95% of the time. That was mainly the point i was trying to get across, and that the four spells I mentioned barely see use (which can also be observed simply by playing)","replies":[{"poster":"Akeydel","date":"2015-05-25T02:46:44.695+0000","up_votes":10,"down_votes":0,"body":"Cool thanks.\nand yeah, 10%, my bad, thanks for the clarification.","replies":[{"poster":"Rootworth","date":"2015-05-25T03:05:15.042+0000","up_votes":8,"down_votes":70,"body":"GET REKT NOOB MATH MAN!","replies":[{"poster":"missinggrave","date":"2015-05-25T03:09:56.766+0000","up_votes":27,"down_votes":2,"body":"There are two immediate reactions to reading that;\n1) Ew.\n2) No.","replies":[{"poster":"Rootworth","date":"2015-05-25T03:14:54.230+0000","up_votes":7,"down_votes":61,"body":"That's what your mama said when you saw you for the first time. LOLOLOL","replies":[{"poster":"missinggrave","date":"2015-05-25T03:17:52.454+0000","up_votes":46,"down_votes":2,"body":"Nah, that was my dad. Mom was caught up in the moment of having a child. Dad was staring at a red mess they called a baby. Babies are gross when they're born, man. Even you.","replies":[{"poster":"Decrit","date":"2015-05-25T07:15:32.584+0000","up_votes":20,"down_votes":1,"body":"Just.....\n\n*Claps claps*","replies":[]},{"poster":"MarhsallLee67","date":"2015-05-25T06:10:21.170+0000","up_votes":10,"down_votes":1,"body":"My sides are gone holy shit.","replies":[]}]}]}]}]}]}]},{"poster":"stealthfox94","date":"2015-05-25T02:33:24.843+0000","up_votes":2,"down_votes":0,"body":"True it's actually pretty rare to see top lane take {{summoner:14}} these days.","replies":[{"poster":"Akeydel","date":"2015-05-25T02:50:36.481+0000","up_votes":2,"down_votes":0,"body":"I think that difference is because MOST midlaners take {{summoner:14}}. That plus some top laners, supports, junglers ({{champion:35}}) and even adc's can take {{summoner:14}}. Supports taking {{summoner:14}}  also explains the lack of {{summoner:3}}, which would be surprising otherwise.","replies":[{"poster":"BluePolarizer","date":"2015-05-25T03:01:37.062+0000","up_votes":4,"down_votes":45,"body":"I will AFK if anyone takes ignite on ADC and I'm the support, because its a lost game in champ select.","replies":[{"poster":"Rootworth","date":"2015-05-25T03:05:40.938+0000","up_votes":16,"down_votes":8,"body":"Then you're a fool.","replies":[{"poster":"BluePolarizer","date":"2015-05-25T04:01:45.509+0000","up_votes":5,"down_votes":31,"body":"stay silver.","replies":[{"poster":"Rootworth","date":"2015-05-25T04:30:00.845+0000","up_votes":3,"down_votes":22,"body":"Stay in Bronze 5, dweeb.","replies":[{"poster":"BluePolarizer","date":"2015-05-25T04:40:07.811+0000","up_votes":8,"down_votes":13,"body":"Lol, even bronzes don't take ignite on ADC.","replies":[{"poster":"Rootworth","date":"2015-05-25T04:43:22.559+0000","up_votes":3,"down_votes":22,"body":"You just proved how retarded you are! LOLOLOLOLOL","replies":[{"poster":"Yer Not My Uncle","date":"2015-05-25T04:50:11.965+0000","up_votes":12,"down_votes":3,"body":"^I feel like this Rootworth is about 14 from reading his comments.","replies":[{"poster":"XLC","date":"2015-05-25T05:48:25.346+0000","up_votes":11,"down_votes":0,"body":"That's insulting to 14 year olds.\nAnd yet sadly true for several of them... >.>","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"SleepyLionCub","date":"2015-05-25T06:47:39.770+0000","up_votes":11,"down_votes":0,"body":"How to fix the diversity \n\n{{summoner:2}} Increase size, and allow it to reveal stealth units.\n\n{{summoner:13}} Make global, so everyone gets the mana, also change from +40%, to +30 Mana regen for 10 seconds.\n\n{{summoner:1}} Change into a spell shield, that absorbs all abilities thrown in for 1 (+ Champion level x .10) Seconds","replies":[{"poster":"Kaipop","date":"2015-05-25T21:35:10.777+0000","up_votes":4,"down_votes":0,"body":"2.8 Second long spellshield? No thanks","replies":[]},{"poster":"starly135","date":"2015-05-25T11:47:48.965+0000","up_votes":2,"down_votes":0,"body":"My opinions on your ideas:\n\nClairvoyance: Mostly agree, allows for reactive play to stealth champs before level 9 (upgraded red trinket) and without preemptively having to carry a 100g ward for aggressive/reactive usage. Although the size is debatable because it is still global.\n\nClarity: I want to disagree but I can understand why you want to do that. As a reactive spell in or before a team fight this spell might be all you need to turn around after a few skirmishes and the irritating problem is that you might not be able to group close enough to use it on everyone.  But otherwise the spell requires you to have a lead on your opponent because you likely lack better defensive or offensive capabilities to your opponent. So in a healthy standpoint it should be okay. Having more mana in lane means forcing your opponent away giving you less holes in your defense, but your instant survivability or killing power is lower due to the increased oppression you've chosen to have on your spells. The reason this one is so long is because I feel I'm copping out by not supporting change, because it is weak, but it's simply that it occupies a niche that makes it weak. It's more mana vs survivability or offensive potency it just can't win out.\n\nCleanse: So it depends on how you mean spell shield. A spell that is Morgana's black shield? Probably too weak as a summoner spell to only deal with magic damage but a spell shield that absorbs CC and damage from physical and magic sources is a ludicrously stronger barrier even if the capacity is very low. I don't believe you intend it as an Olaf ult where you still take damage but can't arn't subject to cc but this is probably too strong for ADCs and Assassins to use. And if your saying that it should absorb them as a Banshee's but over a duration then it is very unhealthy as it stomps all over an Assassin or someone who relies on each of their spells landing in quick succession as any bursty champion does. Effectivly the same problem they had with Exhaust.","replies":[]}]},{"poster":"Jamaree","date":"2015-05-25T02:20:28.805+0000","up_votes":7,"down_votes":32,"body":"Ghost needs to allow you to go through walls\n\nCV is just outdated and needs to be removed because it is now basically a trinket\n\nCleanse, not really sure what to do with that one to be honest, it is strong but not strong enough to be a solo summoner's spell, best bet, splitting it into barrier and ghost. The CC reduction going onto ghost with the cleanse itself going onto barrier\n\nClarity, once again not sure.","replies":[{"poster":"3TWarrior","date":"2015-05-25T02:59:02.082+0000","up_votes":1,"down_votes":17,"body":"clarity is fine where it is.  a lot of champs benefit from having a mana steroid","replies":[{"poster":"Jamaree","date":"2015-05-25T03:05:30.644+0000","up_votes":13,"down_votes":0,"body":"That is why no one ever uses it right?","replies":[{"poster":"3TWarrior","date":"2015-05-25T03:21:15.245+0000","up_votes":2,"down_votes":9,"body":"no, more than likely it's because the mana dependent champs have less escape mechanisms than the manaless champs\n\nif you're an ez in lane, it's rare you're gonna be out of mana, meanwhile, if you're a chogath poking early game, you need all the mana you can get","replies":[{"poster":"Jamaree","date":"2015-05-25T03:26:28.698+0000","up_votes":4,"down_votes":0,"body":"If you know how to play properly, you learn how to properly and sparingly use your mana, and Cho Gath has a passive that recovers both his mana and health, its current form is too weak to be worth using over other spells.","replies":[{"poster":"3TWarrior","date":"2015-05-25T03:43:35.968+0000","up_votes":1,"down_votes":7,"body":"if you say so, but there are plenty of champs including chogath who greatly appreciate being able to spam their spells more\n\nI main kogmaw for now and his E takes a ton","replies":[{"poster":"Jamaree","date":"2015-05-25T03:48:09.680+0000","up_votes":8,"down_votes":0,"body":"You need to learn to scrimp more, or getting more mana in your build if you are taking clarity over anything else, you are holding yourself back.","replies":[]}]}]}]}]}]},{"poster":"IcyPepper","date":"2015-05-25T02:23:39.447+0000","up_votes":3,"down_votes":0,"body":"If cleanse got a slight buff, it would be very useful in the current meta.\n\nNot sure if ghost going through walls is a good idea, but thematically it *does* make sense. I could imagine two spells being made, the current ghost being renamed, and a new \"ghost\" with a slightly lower MS boost to go through walls with.","replies":[{"poster":"Jamaree","date":"2015-05-25T02:27:45.141+0000","up_votes":4,"down_votes":0,"body":"Unless it gives pure CC immunity for a set amount of time, no reason to take it over heal or barrier right now, if anything, heal should lose the MS increase and be put on cleanse, as for ghost, it is meant to be the other utility movement spell over flash, but flash lets you go over walls and most of the time, that is far better then just a raw speed boost, a raw speed boost that doesn't reduce CC at all.","replies":[{"poster":"MalzaharAnyLane","date":"2015-05-25T02:43:23.404+0000","up_votes":6,"down_votes":0,"body":"I'm not sure you want Black King Bar on people below level 12, tbh.\n\nCleanse's problem is that it's not useful enough during knockups. If you could cleanse the stun on the knockup such that it served only as a snare, then it would be worth taking on people that still need to cast or attack during knockups.\n\nCleanse interacting with knockups is something Riot is looking at, but I think it's a much lower priority than finding ways to phase Flash out of the game entirely. League has too many get out of jail free cards.","replies":[]}]}]}]},{"poster":"Squeaky101","date":"2015-05-25T02:34:20.361+0000","up_votes":8,"down_votes":1,"body":"Something Riot could test is simply removing Flash entirely, and see what spells people take in its place. Sure, it would be a nerf to many champions who go well with it, but they could also try implementing new spells to make up for the loss. \n\nI think a thornmail type spell would be cool, where a percentage of damage taken is redirected to who dealt the damage for a few seconds. Or perhaps a dumbed-down version of flash where instead of blinking to the location, you dash forward resulting in a slower flash. \n\nAnd I like where Jamaree is going with the Ghost idea. It's just perfect, and I'd even consider using ghost if it were to have that change made to it.","replies":[{"poster":"Marthian","date":"2015-05-25T04:05:13.516+0000","up_votes":3,"down_votes":1,"body":"It would basically make anything that lacks mobility/dash instantly not viable.","replies":[]}]},{"poster":"CrazedPorcupine","date":"2015-05-25T03:22:18.444+0000","up_votes":6,"down_votes":0,"body":"Cross Posted from my Summoner spell thread from several months ago.\n \nBarrier, Barrier started off in ARAM as the MUST pick spell beside Flash. It was then moved to SR, where it became the MUST PICK for ADC's However, since Heal has been buffed at the beginning of Season 4, Barrier has become outclassed in almost all cases. I suggest changing it to a support/tank pick that is contested by exhaust.\n TANK'S REJOICE! NEW -> When used, creates a barrier on target ally champion closest to your cursor (within 200 units) granting them a shield that protects against 50+10xLvl and grants 4xlvl% of your total Armor and Magic Resistance for the next 2 seconds. (Numbers would be capable of changing) 180 second cooldown\nThis turns Barrier into an actual BARRIER by providing CLUTCH resistance bonuses and a very SMALL (230 Hp at level 18) shield to try and save an ally in a manner different from Heal. it's combat usage is also capable of helping save someone from a gank, that heal or exhaust may not be able to do. Exhaust would still be powerful because of it's ability to reduce damage to EVERYONE, and reduce the resistances of the target. Tank supports would likely take Barrier, while squishier supports would take exhaust.\n\n Clarvoyance: once considered a must pick spell for supports, it used to have a cooldown as low as 45 seconds. This led to binary play where the enemy jungler would always be seen and could permanently be tracked through the jungle. Riot then nerfed CV, and it fell out of use as it's ability to scout was not as good, since it wasn't up enough to constantly track the enemy team. Since the nerf from 45 seconds to 60, and a host of smaller minor changes, CV has become a \"troll\" pick, especially since the removal of Elesia's Miracle. (RIP) CV has further been pushed out because of the arrival of the blue Trinket.\n ALL SEEING EYE SEES ALL! NEW: When used, all enemy champs are revealed for 2 seconds (Similar to TF ult first active) 90 second cooldown.\nThis now gives CV an incredibly unique type of vision, that no trinket can replicate. This could make CV a VERY desirable pick in competetive because of it's ability to locate anybody at any point in time.\n\n Clarity: Clarity was once also considered a solid pick for more utility AP champs as champs could sustain their DPS. In fact, now that mana regen is much worse, Clarity could potentially become a decent pick for mana based mids that need a tiny bit of mana to escape or to secure a kill. HOWEVER, Since summoner spells are generally picked for their more IMMEDIATE combat usage rather than anything else. So, my thoughts for the change are one that I think i'd seen on the boards before, that I actually incredibly like.\n MINI RAPID FIRE MODE! NEW: When used resets all non-ultimate cooldowns and reduces the mana costs of all abilities by 75% for the next 2 seconds. 210 Second Cool-down\nThematically, this is a person meditating and gaining insight and ability to use all their skills again. It also allows for some incredibly flashy plays, Granted this could potentially be way over bearing, and may not be a healthy addition. However, because it would be a worthwhile spell to pick up in this manner, it could actually be balanced by changing how much it reduces non-ultimate cool-downs by, or how much the mana costs are reduced, or for how long they're reduced. In any situation, it becomes a worth while spell to use on some/many champs.\n\n Cleanse: Cleanse has been niche pick because of it's clutch CC removal and CC reduction, but it loses out to QSS overall. This is because QSS not only gives defensive stats, builds into a hybrid defensive/offensive item, but removes ALL debuffs, not just most CC.\n TRULY CLEANSED: NEW -> Cleanse Now removes ALL forms of CC, and grants 1 second of CC immunity upon use: 150 second cooldown\nTHis now makes cleanse a true pick against CC heavy teams, and actually has something that sets it apart from QSS in that Cleanse removes ALL CC (Including suppressions) and gives a 1 second immunity. QSS still removes Debuffs like Grevious wounds and DoT spells Like Malefic Visions, but now, cleanse can actually prevent the stunlocking and CC chain that the current cleanse and it's 65% CC REDUCTION does not. Doing this make Cleanse desirable against CC heavy lanes, or against WW and Malzahar (Note that it doesn't stop the damage, just teh CC)\n\n Revive: Revive has been considered the absolute WORST spell in the game since season 1, it's been left in because it actually say pretty common usage with the cheesy revive teleport homeguard Karthus, and a few other champs that could pull off that combo. However it's 9 minute Cooldown has always made it a terrible pick up and a waste of a summoner spell.\n BRINGING IT BACK! NEW: Revive's cooldown now scales with level beginning with 555 Seconds (9 minutes 15 seconds) and reducing by 15 seconds every level (level 1 cooldown unchanged of 540 seconds)\nThis means that at level 18, Revive has a cooldown of 270 seconds, or 4 minutes and 30 seconds. In other words, a spell worth using.\n\n Ghost: This is honestly a decent pick, and actually I don't really have anything to make it better or worth picking over flash, since flash's terrain hop will always be too good to give up in most cases. The only thing I can see worth changing is giving the user 75% slow resistance while ghost is active. Mainly because the powerful slows in the game make people using ghost somewhat kite-able.","replies":[{"poster":"YOU BEEN WARNED","date":"2015-05-25T05:50:57.588+0000","up_votes":4,"down_votes":0,"body":"I agree with your ideas except cleanse, suppression champions really need to get that suppression off to be effective; they often CC themselves along with the enemy after all.\n\nCleanse VS suppressors would un-CC you while CCing the enemy, that's not the type of change you should introduce. ","replies":[{"poster":"CrazedPorcupine","date":"2015-05-25T15:53:33.469+0000","up_votes":2,"down_votes":0,"body":"Like I said, this was cross posted from several months ago. I actually agree that cleanse should not remove suppressions, and that should be left to QSS. I actually didn't play at the time that Cleanse used to work the way I've outlined. The current cleanse simply needs at least 1 second of CC immunity rather than this stupid 65% tenacity that doesn't do anything.","replies":[]}]},{"poster":"SpecterVonBaren","date":"2015-05-25T06:21:58.584+0000","up_votes":1,"down_votes":0,"body":"\"MINI RAPID FIRE MODE! NEW: When used resets all non-ultimate cooldowns and reduces the mana costs of all abilities by 75% for the next 2 seconds. 210 Second Cool-down\"\n\n{{champion:7}}  OH HOHOHOHOHO!","replies":[{"poster":"EverTokki","date":"2015-05-25T08:26:49.938+0000","up_votes":3,"down_votes":0,"body":"Make it stop. \\*cries in corner\\*","replies":[]}]}]},{"poster":"lDontLiftIcarry","date":"2015-05-25T04:07:13.971+0000","up_votes":1,"down_votes":23,"body":"whats the shiny  ball at the top\nI want that spell.\n\nthis chart is fucked\nsmite should be in like 99% of games.\n\nyou can't possiblely be counting other modes besides the ones where smite is actually used or why even post smite on the chart\nOr TP for that matter.\n","replies":[{"poster":"Squeaky101","date":"2015-05-25T04:12:54.883+0000","up_votes":2,"down_votes":0,"body":"The gem represents all of the other spells. And the percentage is based on the 20 spells that are chosen in a match, not its chance of appearing in a match overall.","replies":[{"poster":"lDontLiftIcarry","date":"2015-05-25T04:20:27.913+0000","up_votes":1,"down_votes":16,"body":"doesnt make sense.","replies":[{"poster":"IGotScuttleCrabs","date":"2015-05-25T04:26:21.508+0000","up_votes":11,"down_votes":1,"body":"What doesn't make sense? 20 spells are picked a game. Almost 50% of them are flash while typically 2 are smite or 1/10th.  Pretty straight forward.","replies":[]}]}]}]},{"poster":"OyddAWqJ5r","date":"2015-05-25T05:05:51.939+0000","up_votes":6,"down_votes":1,"body":"Does it really matter though? Honestly Flash is a staple of the game. It is a tool that literally creates flashy plays.\n\nI think summoner spells should be thought of more as role constants or semi-constants than tools needing diversification.","replies":[]}]}