{"poster":"hshtagniemehrcdu","date":"2019-03-18T17:48:18.804+0000","title":"Datenträger-Auslastung 100","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich versuch's einfach mal hier...\r\n\r\nHabe seit zwei Tagen das Problem, das meine Datenträgerauslastung auf 100% steigt, ohne das irgendwelche Programme laufen.\r\nLaptop wird angeschaltet, sofort volle auslastung.\r\nDas Gerät ist dadurch so gut wie nicht mehr nutzbar, und auch die Framerates während des Spielens gurken auf 5-15 rum.\r\n\r\nIm Task Manager werden dabei laut den aufgelisteten Programmen vielleicht 1-2 MB verbraucht, wenn's hochkommt.\r\nKann also keine Prozesse abschalten, um das Problem zu behebn.\r\nUnd irgendwelche Hinweise von Windows, woran es liegen könnte, gibts natürlich nicht.\r\n\r\nWindows Update ist es nicht, System ist auf neuestem Stand.\r\nDatenträger- und Systemdatenträgerbereinigung durchgeführt.\r\nDefragmentiert.\r\nVirenscanner laufen lassen.\r\nAlle Problembehandlungen, die von Windows zur Verfügung gestellt werden durchlaufen lassen.\r\nAlle Autostart-Programme abgeschaltet.\r\nWindows Search/Defender, Superfetch abgeschaltet.\r\n\r\nKeine Ahnung woran's liegt, kam einfach von einem tag auf den nächsten.","replies":[{"poster":"Neamhoilte","date":"2019-03-19T12:28:26.424+0000","up_votes":1,"down_votes":0,"body":"Check mal im Windows Wartungscenter unter Einstellungen, ob du an der Verbesserung für Windows teilnimmst. \nDann sammelt nämlich Onkel Microsoft nen Haufen Daten und blockt quasi die Festplatte.\n\nGoogle mal nach „Microsoft Compatibility Telemetry“&nbsp;","replies":[]},{"poster":"hshtagniemehrcdu","date":"2019-03-18T18:00:29.831+0000","up_votes":1,"down_votes":0,"body":"Einmal aufgeschraubt und entstaubt hab ich auch schon - das ist es nicht.","replies":[{"poster":"Clawler","date":"2019-03-18T18:10:17.835+0000","up_votes":1,"down_votes":0,"body":"Sonst fällt mir nur noch ein das es evlt. probleme mit einigen autostart programmen gibt. Schau mal was du alles so im autostart hast, einiges davon ist einfach überflüssig so.","replies":[{"poster":"hshtagniemehrcdu","date":"2019-03-18T18:13:14.819+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Clawler,realm=EUW,application-id=7hciEY9w,discussion-id=h56KEMWJ,comment-id=00010000,timestamp=2019-03-18T18:10:17.835+0000)\n>\n> Sonst fällt mir nur noch ein das es evlt. probleme mit einigen autostart programmen gibt. Schau mal was du alles so im autostart hast, einiges davon ist einfach überflüssig so.\n\nAlles deaktiviert, bis auf Audio-Manager und ein Nvidia Prozess.","replies":[{"poster":"Clawler","date":"2019-03-18T18:30:53.246+0000","up_votes":1,"down_votes":0,"body":"wait als autostart hast du nur audiomanager und nvidia prozess? lul damn. Mehr fehlt mir sonst auch nicht ein ausser ganz billo nh defragmentierung XD","replies":[]}]}]}]},{"poster":"Clawler","date":"2019-03-18T17:51:40.175+0000","up_votes":1,"down_votes":0,"body":"Ich hatte das damals auch... oh je hat mich das genervt, leider habe ich auch keine richtige(technische) lösung gefunden. Bei mir gings wieder nachdem ich meinen Pc mal entstaubt habe, dunno ob das deswegen gefixt war aber aufjedenfall war er dannach nicht mehr ausgelastet xD. Ich kenn mich pc's leider nicht so gut aus aber ich hab halt 3-4 monate rumgemacht mit 100% datenträger auslastung genauso wier bei dir ohne das irgendwelche programme liefen. vlt. hilfts ja :D mehr hab ich leider nicht anzubieten aber ich glaube man kann alles mal probieren :D","replies":[]}]}