{"poster":"IIIrickIII","date":"2017-08-04T02:08:23.030+0000","title":"non englisch insult","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":0,"body":"Hat Riot eigentlich ein System was nicht englische Beleidigungen erkennt oder/und machen sich die mods die M&uuml;he das zu &uuml;berpr&uuml;fen, wenn man das reported?","replies":[{"poster":"Lotuskobra","date":"2017-08-04T07:10:21.748+0000","up_votes":2,"down_votes":0,"body":"Kurz und knapp:\n\nJa\n\nLang und Breit:\n\nDas Scantool, dass die Chatverläufe scant, wenn ein Report getätigt wurde versteht x verschiedene Sprachen. Es ist egal, ob dich jemand auf französich, englisch oder deutsch beleidigt – mit einer kleinen Ausnahme: Wenn jemand in einer kaum gesprochenen Sprache schreibt und flucht wird es denke ich schwer, da dem System dazu Erfahrugswerte fehlen – wenn du also auf einem Amazonasdialekt fluchen kannst, wird es schwer das zu erkennen.\n\nDas System versteht mittlerweile (dazu ist es selbstlernend) auch viele Abkürzungen: kys, fdp oder ähnliches. Wenn neue Beschimpfungen oder Abkürzungen gängig werden – vllt werden wir morgen alle als Kurzrüsselelefanten bezeichnet – dann wird das Tool bei ausreichend vielen Reports lernen, dass dieser Begriff von der Community nicht erwünscht ist. Wenn also alle vernünftig reporten und das System so füttern, werden sehr viele Dinge erkannt – egal in welcher Sprache.\n\nDas Tool selber bedarf zudem keinerlei Zugriff von außen, wenn überhaupt mal eine Person aus Fleisch und Blut drüberschaut, dann im Falle einer Beschwerde nach einer Strafe. Der Support bekommt dann Zugriff auf die Protokolle und kann einsehen, was man geschrieben hat – aber dann ist es im Regelfall eh zu spät.","replies":[{"poster":"franticFurball","date":"2017-08-04T07:21:38.669+0000","up_votes":3,"down_votes":0,"body":">wenn du also auf einem Amazonasdialekt fluchen kannst, wird es schwer das zu erkennen.\n\nUmgekehrst ist natürlich die Frage nach dem Sinn von Beleidigungen, welche das Gegenüber nicht entziffern kann ^^","replies":[{"poster":"eimoH","date":"2017-08-06T09:20:17.332+0000","up_votes":1,"down_votes":0,"body":"Wenn man dies nur tut um Frust abzulassen dann ist dies vielleicht gar nicht so falsch. (:","replies":[]}]},{"poster":"Temudschinn","date":"2017-08-06T11:26:37.356+0000","up_votes":2,"down_votes":0,"body":"> Das Tool selber bedarf zudem keinerlei Zugriff von außen\n\nIch meine mal gelesen zu haben, dass Spieler mit vielen Reports, die vom System jedoch wiederholt durchgewunken werden, manuell überprüft werden (um genau die Ausnahmen, die du beschreibst, zu finden). Finde aber grad die Quelle nicht mehr, kann sein dass ich mich irre.","replies":[{"poster":"Lotuskobra","date":"2017-08-06T11:32:20.098+0000","up_votes":1,"down_votes":0,"body":"Das kann durchaus sein, aber dazu müsste man die Qualität der Quelle kennen. Sinn würde es für solche Spezialfälle auf jeden Fall machen und es gibt sicher im System Optionen, Dinge von außen einzufügen, nur arbeitet das System eben größtenteils alleine und braucht keine Hilfe. Ich bin gespannt was demnächst von Riot verändert wird!","replies":[]}]}]},{"poster":"Epic Melons","date":"2017-08-04T03:00:17.778+0000","up_votes":1,"down_votes":3,"body":"Ich denke die nicht-englischen Reports werden mit einem automatisierten System geprüft. \n\nBsp.\n\nWenn immer wieder Reports kommen die normale Wörter enthalten, aber jedes Mal das Wort \"Hurensohn\" dabei ist, dann könnte es sein, dass das System das erkennt und dieses Wort dann als \"böse\" einstuft.\n\nBtw, das Englische Reportsystem ist sau easy auszutricksen.\n\n(Und bevor jetzt jemand sagt 'blablabla, warte bis du gebannt wirst', ich benutze den Trick seit 3 Jahren und es ist noch nie etwas passiert. Bevor ich den Trick nutzte, hatte ich dauernd chat-restrictions etc.)\n\n\n\nÜbrigens, für alle extra schlauen, das System erkennt auch wenn jemand \"fck\" anstelle von \"fuck\" schreibt. Oder \"you son of a bitchh\" etc. Denn wie gesagt, wird ein bestimmtes Wort sehr oft verwendet wird es als \"böses Wort\" automatisch in die Datenbank eingefügt.","replies":[{"poster":"eimoH","date":"2017-08-06T09:28:02.655+0000","up_votes":1,"down_votes":0,"body":"Ja wenn man ungewöhnliche Beleidigungen+Formulierung verwendet, diese in gewisse Zeitabständen nicht wiederholt und ansonsten nur positiven Chatverläufe hat hat das System Probleme dies zu erkennen. \nAllerdings wird an einer besseren Erkennung gearbeitet und nur weil du deinen Chatverlauf für so negativ hältst muss dies nicht jeder so sehen vielleicht bist du auch einfach zu gut erzogen. ;)","replies":[{"poster":"MGP","date":"2017-08-06T10:52:24.546+0000","up_votes":1,"down_votes":0,"body":"Was er meint ist das du durch Anwendung von Sarkasmus unglaublich toxisch sein kannst.\nUnd was soll das System da auch tun? Da ersetzt er einfach jedes toxische \"easy\" durch ein \"gj\" oder ein \"wp\" das reicht schon.\nTada er ist genau so toxisch wie die anderen nur was soll das System da machen... Er hat ja nur gute Worte verwendet.\n\nDu würdest vieles davon nicht mal selbst als toxisch wahr nehmen solange du nur den Chatlog liest, da dir jeder Kontext fehlt.\nEin Beispiel:\nDu Spielst Talon gegen Oriana Mitte. Oriana stirbt flasht weg und stirbt am Ignite. \"WP Ori rly nice flash\"\nKurz darauf kommt der gegnerische Yi ganken dived und stirbt am Tower ohne den Kill zu bekommen. \"GJ Yi never would have thought it's possible to dive a Talon\"\n\nDer Spieler war doch jetzt auch zu den Gegner unglaublich nett^^\nOhne Kontext würdest du das vielleicht als nerfig aber nicht als toxisch empfinden.\nMit Kontext ist das einfach nur unglaublich toxisch\n\nIch selbst weiß nicht genau wie das System funktioniert, aber ich kann dir garantieren das es dich für dieses Verhalten nicht bannt.\nIch habe Leute erlebt die damit weit toxischer waren als der ein oder andere der hier im Forum gepostet, hat was für einen perma ban nötig war und haben dafür noch nicht einmal eine Chatristriktion bekommen. Manche von denen machen das wie oben schon gesagt seit über 3 Jahren.","replies":[]}]}]}]}