{"poster":"IntercoolerTurbo","date":"2017-11-04T21:19:48.524+0000","title":"Quanto è affidabile quello che c'è scritto su wikia?","subforum":"Campioni e gameplay","embed":{"description":"Welcome to the League of Legends Wiki, the wiki about League of Legends that you can edit!We currently have 2,561 articles about the free-to-play MOBA video game created by Riot Games.","url":"http://leagueoflegends.wikia.com","image":"http://images.wikia.com/leagueoflegends/images/b/bc/Wiki.png"},"up_votes":1,"down_votes":0,"body":"Quanto ci si pu&ograve; fidare di quello che si trova scritto su http://leagueoflegends.wikia.com ?\r\nSul sito ufficiale di LoL se ne fa nessun accenno e molte delle informazioni che si trovano sul wiki non vengono riportate da nessuna altra parte. C&#039;&egrave; una sorta di monitoraggio della Riot oppure sono veramente solo i giocatori che riportano dei numeri di quantit&agrave; di danno, spell bloccanti o meno, ecc... solo sulla base della loro esperienza?\r\nSi rifanno invece per caso a qualche fonte ufficiale che non ho ancora trovato?","replies":[{"poster":"A Yordle ln Heat","date":"2017-11-05T08:53:42.332+0000","up_votes":3,"down_votes":1,"body":"Molti dati della wiki sono presi direttamente tramite data-mining, ovvero entrano nel codice di gioco e prendono direttamente le informazioni da lì.","replies":[{"poster":"IntercoolerTurbo","date":"2017-11-05T17:19:16.482+0000","up_votes":1,"down_votes":0,"body":"cioé? Cosa intendi per entrare nel codice di gioco? Tu lo hai mai fatto?","replies":[{"poster":"wattbatt","date":"2017-11-06T11:03:48.606+0000","up_votes":2,"down_votes":1,"body":"sai che i programmi sono fatti con righe di codice di un linguaggio di programmazione vero?","replies":[{"poster":"INAZUMA 33","date":"2017-11-06T17:02:52.254+0000","up_votes":2,"down_votes":0,"body":"mica è obbligatorio saperlo! se non è il suo mestiere","replies":[]}]},{"poster":"Floppyz","date":"2017-11-06T17:51:36.639+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IntercoolerTurbo,realm=EUW,application-id=cAOZwaUi,discussion-id=A7nGEVuA,comment-id=00000000,timestamp=2017-11-05T17:19:16.482+0000)\n>\n> cioé? Cosa intendi per entrare nel codice di gioco? Tu lo hai mai fatto?\n\nIn pratica tutto quello che tu vedi sullo schermo o vedi succedere da quando lanci a quando chiudi il gioco è scritto e codificato da qualche parte nel client (tutti i valori, le statistiche, la grafica, e via dicendo). Ci sono persone che con tanta pazienza cercano questi dati all'interno dei file del client che li contengono.\n\nÈ (semplificando parecchio) un po' come avere un file compresso. Per accedere al contenuto devi aprirlo e tirare fuori quel che ci trovi. :)","replies":[]}]}]},{"poster":"TZombi1234","date":"2017-11-05T15:43:37.680+0000","up_votes":1,"down_votes":0,"body":"Penso che ogni giocatore prende una pagina di questa wiki e aggiunge qualcosa. Come qualsiasi altra wikia del resto","replies":[]}]}