{"poster":"DiveAlive","date":"2020-01-27T07:28:43.342+0000","title":"after dozens of jungling games this season, I just can't anymore. make duo JG a thing somehow","subforum":"Gameplay","up_votes":17,"down_votes":18,"body":"It's just not a one person job anymore..\n\nI have been performing reasonably well with it but I just can't fecking handle the pressure and blame.\n\n-Im supposed to: \n-gank all 3 lanes simultaneously by 3:00, \n-never fall behind their jg in exp, \n-always control both scuttles, drakes, heralds and barons\n-match each of their jungler appearances per lane\n\nIf I don't check all the boxes in this list I risk my allies trolling/inting/quitting/tilting.\n\nall while trying to squeeze in farming camps while lane carries take them for themselves and instatroll if I try taxing after netting them a kill...\n\nyo for real fuck that role as it is.","replies":[{"poster":"BigFBear","date":"2020-01-27T09:52:58.055+0000","up_votes":13,"down_votes":1,"body":"Yesterday I had a game where i lvl 2 ganked bot and gave them first blood. After my first back (around min 5) i ganked bot a second time and we got a kill after that I solo drake.\nIn this time mid got ganked 2 times and died once.\nImmediately started to blame me after his first death. Called \"jngl difference\" and me an afk shit jungler. Went mental boom and spam pinged and insulted me for the rest of the game. (He ended his game with 12 deaths btw.)\n\nThat's just jungler life.\nYou can camp 2 lanes and make them 10:0 but the third lane will flame you to death.\nNo role is more unthankful than jungle.","replies":[{"poster":"Unshakable","date":"2020-01-28T11:00:11.649+0000","up_votes":3,"down_votes":0,"body":"100% agree, jungle is a mess right now. Riot changed jungle where farming jungle just doesnt do it anymore and early gankers are rising in power because they get the gold lead with early kills. I miss the days when skarner could do something. but now its just lee, kha, hec, and elise steamrolling through the early game with their super mobility and ganking power. In a game that riot has PUSHED snowballing into the meta, jungle wins lanes. You didnt do anything wrong. riot did.","replies":[{"poster":"BONUS DMG 2NOOBS","date":"2020-01-28T21:37:13.782+0000","up_votes":2,"down_votes":0,"body":"kha?  Hec?  LOL.  They trash tier in 10.2.   lee, elise, ekko, shaco, zac, warwick, nidalee, olaf, and reksai pretty much the only thing being played aside from one tricks.","replies":[{"poster":"Unshakable","date":"2020-01-29T00:50:50.249+0000","up_votes":1,"down_votes":0,"body":"Yea my bad, But you understood the point right?","replies":[]}]}]},{"poster":"GripaAviara","date":"2020-01-27T16:16:31.079+0000","up_votes":2,"down_votes":2,"body":"The thing is, he's not very wrong. He is wrong to blame you, but also right the jungle won his opp lane\n\nNowadays, enemy jungle puts a little pressure, in most match-ups your lanner gets a little advantage and it's lost. It's stupid. Everything snowballs so fast. Just take Fizz, that stupid champion gets a level advantage and you're toasted, at best you can barely farm. He gets beefier and soon he'll melt you in the turret range because his spells for some dumb reasons reset the tower focus. The damage is insane, it need to be reduced overall. No champion bellow lvl 11 should melt you in 2 seconds or less","replies":[]}]},{"poster":"PhearBunny","date":"2020-01-27T10:59:04.923+0000","up_votes":8,"down_votes":1,"body":"played SR for the first time in about 2months yesterday.\nJungle is clearly in a worse state than it was before.\n\nFelt blatently obvious that the only viable solo que junglers are hypermobile gank machines.\nClearing felt useless.\nMooching lane exp was significantly better than clearing my own jungle, which makes me feel even more forced to play a hypermobile gank machine. Namely Leesin.\nThe level difference between mid and jungle is just cruel.\nIf my mid laner is losing, i have to worry about a lvl7 mid laner running me down in my own jungle while im lvl4....seriously?","replies":[]},{"poster":"M1stry","date":"2020-01-27T07:39:00.887+0000","up_votes":12,"down_votes":5,"body":"Dude this game in general isn't fun anymore. It's run by a bunch of snowflake mods who cater to snowflake players. You get banned for literally anything and because the community is primarily comprised of 10yo crybabies the real players always get fked.","replies":[{"poster":"kaitlynfeartech","date":"2020-01-27T09:26:47.643+0000","up_votes":4,"down_votes":1,"body":"\"you get banned for literally anything\" is self-evidently not true lmao I'm sorry","replies":[]},{"poster":"thegreatest711","date":"2020-01-27T14:07:37.484+0000","up_votes":2,"down_votes":0,"body":"agreed lmao you might have been just actively wild my dude ive been playing since 2014 (on and off) only been banned once lol and i 100% was drunk and looked the next day like oh shit im dumb","replies":[]}]},{"poster":"Linna Excel","date":"2020-01-27T23:57:08.263+0000","up_votes":4,"down_votes":0,"body":"Half of the problem is mids don't understand that they are in the best position to be helping junglers, but aren't.","replies":[{"poster":"GilxeN","date":"2020-01-28T08:11:40.344+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Linna Excel,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=000d,timestamp=2020-01-27T23:57:08.263+0000)\n>\n> Half of the problem is mids don't understand that they are in the best position to be helping junglers, but aren't.\n\nThat's the whole problem I am experiencing, a smarter mid abusing junglers position and invading them, if lead is on their side. And nothing you can do about it, you getting popped in a second (especially if it's the assassin).","replies":[{"poster":"Linna Excel","date":"2020-01-28T14:57:07.728+0000","up_votes":3,"down_votes":0,"body":"Yes, this too.  Not only are mids not helping their own junglers, but because junglers are falling behind in XP, an enemy mid laner can start invading them.  This is kind of brutal for the game because in most elos, everyone wants everything from the jungler, but no one is willing to consistently help them out.","replies":[]},{"poster":"UF Dan","date":"2020-01-28T19:14:44.647+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GilxeN,realm=EUW,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=000d0000,timestamp=2020-01-28T08:11:40.344+0000)\n>\n> That's the whole problem I am experiencing, a smarter mid abusing junglers position and invading them, if lead is on their side. And nothing you can do about it, you getting popped in a second (especially if it's the assassin).\n\nAh shit that's crazy bro you're getting ganked by the midlaner? damn bro I wish literally any laner had the right to complain about ganking from junglers.","replies":[{"poster":"BONUS DMG 2NOOBS","date":"2020-01-28T21:39:28.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UF Dan,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=000d00000001,timestamp=2020-01-28T19:14:44.647+0000)\n>\n> Ah shit that's crazy bro you're getting ganked by the midlaner? damn bro I wish literally any laner had the right to complain about ganking from junglers.\n\nYeah bro, wish I could be the first champion to level 6 in the game, while also having the shortest lane and safest role in the game, and close proximity to all lanes and nuetral objectives.  MUST BE SO HARD.  Fucking useless midlaners.","replies":[]}]}]}]},{"poster":"Gath Immortal","date":"2020-01-28T02:32:44.155+0000","up_votes":3,"down_votes":0,"body":"or we could take pressure off of jungle by just generally making it less important and impactful, shocking concept I know but there's really no need for one role to be so much more game deciding than others.","replies":[]},{"poster":"Warmas","date":"2020-01-28T10:41:16.891+0000","up_votes":2,"down_votes":0,"body":"They are buffing jungle xp next patch.\nThat's not at all the case a good jungler knows what to do, no you don't gank all lanes, and the know there are unwinnable games, and mutes chat.","replies":[]},{"poster":"14daysuspensionk","date":"2020-01-28T09:20:23.332+0000","up_votes":2,"down_votes":0,"body":"Just play Nexus Bli-\n\n\nOh wait.","replies":[]},{"poster":"UF Dan","date":"2020-01-27T12:30:04.330+0000","up_votes":3,"down_votes":11,"body":"JG Mains upset that they can't simultaneously decided 3 lanes, secure every object, be up in levels, and be able to 1v1 every laner in the game.\nDamn bro that shit sucks","replies":[{"poster":"Sir Saltarin","date":"2020-01-27T13:17:28.206+0000","up_votes":2,"down_votes":3,"body":"Couldn't agree more.","replies":[{"poster":"LTK KoRo","date":"2020-01-27T20:53:11.014+0000","up_votes":2,"down_votes":0,"body":"hey all what i want is to be above ADC level so i can skillfully oneshot him with lee sin r q q, what's wrong with that?","replies":[{"poster":"Sir Saltarin","date":"2020-01-27T23:40:08.425+0000","up_votes":2,"down_votes":0,"body":"I rather see 60 minutes games on pro play in which junglers don't reach level 18.\n\nCan't believe they are nerfing MF for being viable 1 patch on pro play.\n\nThe fact that she has been S+ on soloQ since PreSeason started is irrelevant here because it doesn't fit my narrative.","replies":[{"poster":"LTK KoRo","date":"2020-01-28T08:50:05.842+0000","up_votes":2,"down_votes":0,"body":"i agree, it's ridiculous that MF is getting nerfed before truly oppressive champions, like Yasuo, Zed or Fizz","replies":[]}]}]}]},{"poster":"The thigh guy","date":"2020-01-27T16:16:55.677+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=UF Dan,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0006,timestamp=2020-01-27T12:30:04.330+0000)\n>\n> JG Mains upset that they can't simultaneously decided 3 lanes, secure every object, be up in levels, and be able to 1v1 every laner in the game.\n> Damn bro that shit sucks\n\nNo. Jungle mains don’t WANT this. Our fucking teammates want this. And THATS the problem.","replies":[{"poster":"UF Dan","date":"2020-01-27T21:41:01.822+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=The thigh guy,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=00060002,timestamp=2020-01-27T16:16:55.677+0000)\n>\n> No. Jungle mains don’t WANT this. Our fucking teammates want this. And THATS the problem.\n\n\"It's just not a one person job anymore.. \"\n\"all while trying to squeeze in farming camps while lane carries take them for themselves and instatroll if I try taxing after netting them a kill...\"\n\nclearly this post is implying that jg is weaker and considering how every jg main is up and arms about how \"weak\" their role is even though it's still deciding 90% of games, that's why i made that comment.\nIf this post really is complaining about toxicity specific to the jg then there's not a lot to say go /muteall every role has a responsibility and are flamed all the same for it.\nIf you really don't want to be flamed bc you're playing a role that almost always decides the game, then go petition to riot to nerf the role","replies":[{"poster":"The thigh guy","date":"2020-01-27T23:54:58.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UF Dan,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=000600020000,timestamp=2020-01-27T21:41:01.822+0000)\n>\n> \"It's just not a one person job anymore.. \"\n> \"all while trying to squeeze in farming camps while lane carries take them for themselves and instatroll if I try taxing after netting them a kill...\"\n> \n> clearly this post is implying that jg is weaker and considering how every jg main is up and arms about how \"weak\" their role is even though it's still deciding 90% of games, that's why i made that comment.\n> If this post really is complaining about toxicity specific to the jg then there's not a lot to say go /muteall every role has a responsibility and are flamed all the same for it.\n> If you really don't want to be flamed bc you're playing a role that almost always decides the game, then go petition to riot to nerf the role\n\nHere’s the problem. It’s not better jungler wins anymore. It’s autofilled jungler loses.","replies":[{"poster":"UF Dan","date":"2020-01-28T19:22:30.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The thigh guy,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0006000200000000,timestamp=2020-01-27T23:54:58.808+0000)\n>\n> Here’s the problem. It’s not better jungler wins anymore. It’s autofilled jungler loses.\n\nI disagree. It's been BOTH better jg wins and autofilled jg loses for the past 3 years, with a peak of last season and this season so far with the metaphorical 1v1 between junglers that is most Soloq games.","replies":[]}]}]}]},{"poster":"Zerenza","date":"2020-01-28T01:23:54.990+0000","up_votes":2,"down_votes":0,"body":"Mid, Top and Bot mains upset that the jungler couldn't do all of those things for them.","replies":[{"poster":"UF Dan","date":"2020-01-28T19:20:26.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zerenza,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=00060003,timestamp=2020-01-28T01:23:54.990+0000)\n>\n> Mid, Top and Bot mains upset that the jungler couldn't do all of those things for them.\n\nYeah sounds about right. Maybe if laners had the luxury of getting any say on being ganked/dove, objective control, vision control(aside from support), then maybe we wouldn't complain to our junglers not accomplishing the responsibilities jg mains so desperately want to keep.\n\n>complains when jg can only decide 80% of games as opposed to 90%\n>complains when laners complain to them for losing jg effectively singlehandedly losing the game for them\n \nPick one bro. Either get your role to proportionally impact the game and thus have less expectations, or stfu when you're expected to disproportionally impact the game.","replies":[]}]},{"poster":"GilxeN","date":"2020-01-28T07:26:05.712+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=UF Dan,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0006,timestamp=2020-01-27T12:30:04.330+0000)\n>\n> JG Mains upset that they can't simultaneously decided 3 lanes, secure every object, be up in levels, and be able to 1v1 every laner in the game.\n> Damn bro that shit sucks\n\nDown voted for a reason, try to jungle please then make a re-post with a fresh mind.","replies":[{"poster":"UF Dan","date":"2020-01-28T19:10:42.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GilxeN,realm=EUW,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=00060004,timestamp=2020-01-28T07:26:05.712+0000)\n>\n> Down voted for a reason, try to jungle please then make a re-post with a fresh mind.\n\nI do play jg, It's funny how the role i once considered the most difficult to pull off become just a braindead binary role where smart jg pathing doesn't matter and counter jungling is meaningless. Jungling has been reduced to how many times you can right click lanes, a strategy that will decide 90% of games.\nMore importantly i play laners, who have to have their lanes decided by the whims of either jungler and have disproportionately smaller impact on the state of the games compared to junglers.\n\nBut sure bro go ahead and tell me how it's unfair that you're under leveled when you haven't touched a single camp and have full dragon control, 100% KP, and vision control.","replies":[]}]},{"poster":"Dr Endeavor","date":"2020-01-27T13:10:18.725+0000","up_votes":3,"down_votes":1,"body":"Not that they want it all. But that in a weaker jungle are still EXPECTED to do it all.","replies":[{"poster":"UF Dan","date":"2020-01-27T21:35:22.806+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Dr Endeavor,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=00060000,timestamp=2020-01-27T13:10:18.725+0000)\n>\n> Not that they want it all. But that in a weaker jungle are still EXPECTED to do it all.\n\nconsidering how every jg main is complaining about jgs current state even though the role is still deciding 90% of games I beg to differ.","replies":[{"poster":"Dr Endeavor","date":"2020-01-27T22:14:44.057+0000","up_votes":2,"down_votes":0,"body":"I dunno what your rank is, maybe much higher than I have achieved. But based off of many many games where I get every jungle objective, get my lanes early leads and still keep my deaths to a minimum.... means squat if my team doesn't do anything with it where I am at on the ladder.","replies":[{"poster":"UF Dan","date":"2020-01-27T22:27:01.528+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Dr Endeavor,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0006000000000000,timestamp=2020-01-27T22:14:44.057+0000)\n>\n> I dunno what your rank is, maybe much higher than I have achieved. But based off of many many games where I get every jungle objective, get my lanes early leads and still keep my deaths to a minimum.... means squat if my team doesn't do anything with it where I am at on the ladder.\n\nYou can op.gg me in a mere matter of seconds if you want to know my rank.\nMy games last an average of 20-25 mins which is pretty much the exact amount of time junglers have in SoloQ to completely control the game lane wise, objective wise, vision wise. If you really are getting every single objective and getting early lane leads in this perfect hypothetical scenario of yours you will win 95% of the time. I don't see how a team ahead in dragons and kills has an equal chance of winning the game. \nIf your team really does suck at pushing a lead based on rank, then the enemy team should equally suck as much as playing without a lead assuming both teams are ranked similarly so this argument doesn't hold up.\nOn top of that, you're 1/5 of the whole team. Add the fact that you're the jungler and thus control the entire flow of the game then it starts to seem like it's not your teams fault at all.\n\nThis argument that as a jungler you're magically getting every objective and winning every lane yet still losing really doesn't make sense to me.","replies":[{"poster":"Dr Endeavor","date":"2020-01-27T22:36:37.618+0000","up_votes":1,"down_votes":0,"body":"Don't know what to tell you, you can look me up just as quick as well.","replies":[{"poster":"UF Dan","date":"2020-01-27T23:37:54.090+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr Endeavor,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=000600000000000000000000,timestamp=2020-01-27T22:36:37.618+0000)\n>\n> Don't know what to tell you, you can look me up just as quick as well.\n\nI didn't ask for your rank, and all my arguments assume that both teams are equally ranked regardless of what their actual skill level is.","replies":[]}]}]}]}]}]}]},{"poster":"FlameHalbrdOkido","date":"2020-01-27T20:45:19.433+0000","up_votes":2,"down_votes":0,"body":"hey i get it, im willing to duo jg with you or play a type of champ that can farm bot solo so the \"support\" can be a duo jg as a full team support or just jg with u","replies":[]},{"poster":"XzMln","date":"2020-01-27T17:32:49.465+0000","up_votes":2,"down_votes":0,"body":"Don't forget ward for 3 people because your adc and toplaner won't ward so you have to ward for yourself and them.","replies":[]},{"poster":"Nøctμrne","date":"2020-01-27T16:10:04.152+0000","up_votes":2,"down_votes":0,"body":"People fail to understand that the Jungles job is not to win your lane for you, and it makes it even worse when someone only has a carry mentality, and refuses to be carried. Maybe jungle isn't the role for you, we've always been trash talked and blamed for almost the past 6 seasons. My mental has never broken except from a duo yesterday that tilted me completely. \n\nThis duo bot got ganked by an olaf 3 times brcause they were pushing the enemy underneath tower. I was finally able to gank them, and the enemies got out with almost np hp (they both had stopwatch!). I immediately pinged the infernal drake because it was free to grab and thry had no way to contest it. I asked for assistance and these two didn't move. So I was forced to back from a free drake because I couldn't solo it. Olaf ended up walking up after I backed and killed it. I asked why they didn't help and they said \"You didn't help gank us so we didn't help you kill dragon. \" those fucking words tilted me and made me lose all my mental capacity.They legitimately griefed me and made me feel like giving up.","replies":[]},{"poster":"FeedKaylePlease","date":"2020-01-27T13:11:51.855+0000","up_votes":2,"down_votes":1,"body":"I've found that /mute all solves a lot of problems. I'm not joking. Try it and see for yourself.","replies":[{"poster":"Crescent Dusk","date":"2020-01-27T23:59:07.827+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeedKaylePlease,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0007,timestamp=2020-01-27T13:11:51.855+0000)\n>\n> I've found that /mute all solves a lot of problems. I'm not joking. Try it and see for yourself.\n\nMute doesn't stop laners from taking your camps in front of you or forcing your smite out so your buffs/scuttles don't get stolen by them. Nor does it compel laners to get the Udyr or Talon off your jungle or help you contest scuttles.\n\nMy best solution has been to play support Zilean instead. I can carry teamfights and lane post 6 hard, and I only have to babysit a single lane to do well.\n\nAnd my gold income is passive so I can have necessary items even when behind in lane.","replies":[{"poster":"FeedKaylePlease","date":"2020-01-28T13:04:40.324+0000","up_votes":1,"down_votes":0,"body":"The objective of the game is to win. If you're not ganking a particular lane, there is probably a reason for it. If you decide to gank a lane simply because you're afraid your team mate will troll or leave then 9 out of 10 times it's not gonna turn out great. You're going to be ganking when you shouldn't be ganking. It's gonna make things worse and you will lose the game anyway. It's better to play YOUR game and stop giving a fuck about what your team mates might do. Sure, they might troll, leave, run it down, steal your camps but tell me, how is that different than when you play top lane and your bot lane goes 0-8 in 8 minutes? A laner that trolls because he didn't get ganks when he demanded is a shit player. He is a shit player whether you gank for him or not and he would most likely lose they game for you no matter what you do. It's ALWAYS better to ignore him and invest your resources into better players whether that be yourself or another lane.\n\nI don't claim to be a good jungler or even a good player but I've been performing a lot better in the jungle since I started playing this way. If at a particuIar time I don't think ganking is a good idea, I don't come. I don't care how much you ping. I don't care how much you threaten to afk or run it down. I will not make bad plays simply at the behest of idiots. However, the most important thing I do now is completely ignore them. I mean no chat. I don't bother to explain shit or argue. I just play MY game. If he starts writing novels in chat, I mute him because it's distracting. Jungling requires that you pay attention to a lot of things, more so than laners. You should not be distracted. Don't do that to yourself/","replies":[]}]},{"poster":"The thigh guy","date":"2020-01-27T16:18:17.900+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeedKaylePlease,realm=NA,application-id=3ErqAdtq,discussion-id=ApxXq1KQ,comment-id=0007,timestamp=2020-01-27T13:11:51.855+0000)\n>\n> I've found that /mute all solves a lot of problems. I'm not joking. Try it and see for yourself.\n\nWon’t stop your baby bitch top laner from rage quitting out because he didn’t get a gank at minute 2","replies":[{"poster":"FeedKaylePlease","date":"2020-01-27T19:57:35.450+0000","up_votes":1,"down_votes":1,"body":"Let him rage quit. If he is willing to quit because he is not getting ganks, it's more than reasonable to assume that he is a shit player anyway. \n\nI used to give in to the pressure and gank my team mates who beg but what usually happens is I have to literally baby sit them and when I finally get them ahead, if I don't sit on them, they will still fuckin lose despite the lead. Another thing that happens is that they can actually bait you into giving up a double kill. They get you so scared that they'll leave that you throw common sense out the window to gank for them when you should be completely ignoring them.\n\nEven if he rage quits, you still have a much higher chance of winning by ganking your winning lanes. You can get a winning lane so far ahead they can 4v5 the match. \n\nNEVER EVER give in to the pressure. Trust me. Ignore shit laners, mute them if you must. Let them fuckin leave if they don't like it, they are shit anyway. You don't need shit stains like them.","replies":[]}]}]},{"poster":"sirus otter","date":"2020-01-28T13:37:12.407+0000","up_votes":1,"down_votes":0,"body":"nah as a jngler all you need to do is /muteall get one lane stupid ahead, ignore the lane thats loosing the most and the third lane just kinda show up occasionally and keep preasure but primarily just farm if your loosing the game overall. getting even 1 item up or a few lvls on the enemy jngler could really change alot.\nif your playing jng champs like ww who can easily solo drag after lvl 4, try and keep the enemy jng warded and put a pink on drag and solo it, who knows maybe the extra health regen from ocean will turn around a loosing lane. \nthe only thing you HAVE to do on jng if you wanna win is scuttle, drag, herald, and baron control.\nthat is your main job. you are the jngler and all of those things are in the jungle.\nim mediocre in the jng at best but even i can pick up a few easy wins keeping all this in mind, trying to do everything yourself especially when even just 1 lane is loosing really bad can be very stressful and you'll just lose if you try to hard to do everything.\ni reccomend trying to get bot lane ahead because then you get drag control always, and mid lane is a very easy gank spot if you always make sure one side isnt warded.","replies":[]},{"poster":"ablackrift","date":"2020-01-28T06:43:55.948+0000","up_votes":1,"down_votes":0,"body":"this is why i wont jungle anymore.{{champion:28}}","replies":[]},{"poster":"xelaker","date":"2020-01-28T05:53:31.145+0000","up_votes":1,"down_votes":0,"body":"That would be a massive undertaking that would need a lot of xp changes, and we all know how riot is at xp changes lol","replies":[]},{"poster":"ProphetOfDraven","date":"2020-01-27T08:10:36.238+0000","up_votes":1,"down_votes":0,"body":"Clash is the only way.","replies":[]},{"poster":"DONT NEEEED TEAM","date":"2020-01-27T16:53:44.898+0000","up_votes":1,"down_votes":1,"body":"Ur just  bad get good good jubglers continue to climb and win","replies":[]},{"poster":"Starcraft243ver","date":"2020-01-27T11:16:49.119+0000","up_votes":3,"down_votes":3,"body":"> -Im supposed to:\n> -gank all 3 lanes simultaneously by 3:00,\n> -never fall behind their jg in exp,\n> -always control both scuttles, drakes, heralds and barons\n> -match each of their jungler appearances per lane\n\nThat's fine, the other jungler is supposed to do that as well.","replies":[]}]}