{"poster":"Tiza","date":"2014-07-30T17:06:12.048+0000","title":"New and reworked champions in the LCS and CS","subforum":"Esports","up_votes":18,"down_votes":3,"body":"Hey everybody!  Tiza here, from the Esports League Operations team.  We're having a debate at the office and want to hear your opinion!\n\nIn our current LCS ruleset, we have the following rule (8.4.1 on page 28, for those keeping track at home.  Challenger has the same rule as well).\n> Champions who have not been available on the live service for more than 4 weeks will be automatically restricted. Champions that have undergone reworks will be subject to LCS discretion.\n\n> Example: Champion A was released January 23, 2014, so Champion A becomes eligible to be used in all LCS matches on February 20, 2014.\n\nThe League Operations team is discussing whether or not we think this is a good policy.  While it's cool to see new champions in top level play, new champions go through a lot of early balance changes, and a new champion release throws some chaos into teams' plans (which isn't necessarily a bad thing!).  The LCS and CS moves to a new patch a calendar week after the patch hits live in NA, EUW, and EUNE (see rule 8.4 again).\n\nHow do you think champions and reworks should be introduced to the LCS?  Should it stay at a month, come out even with the new patch, or somewhere in between?  Should reworks be treated differently than new champion releases?  What about for major events, like playoffs, All-Star, or Worlds?\n\nEDIT: You can check out the LCS and CS rulesets by visiting http://lolesports.com/about and clicking on the Rules tab!\nEDIT2: Any changes we decide on here wouldn't take into effect until the 2015 season.","replies":[{"poster":"xAtri","date":"2014-07-30T17:28:48.994+0000","up_votes":31,"down_votes":3,"body":"During the regular split due to the weekly Scrim schedules of various teams the players get little time to practice new champions. Yet teams keep showing us new champions every few weeks, this means that 4 weeks is ample time for teams to practice a champion and integrate it into various team compositions.\n\nReducing the duration too much will cause a tilt due the power a new/reworked champion offers hence I propose the following changes.\n\n- New Champions: 3 Weeks\n\n- Kit Rework: 2 Weeks\n\n- Minor Rework: 1 Week\n\n---\n\nSkarner, Though skarner was reworked, how he was played didn't change. But his kit was reworked thoroughly so 2 Weeks.\n\nMaokai, He got a very minor rework, again it didn't fundamentally change how he was played and gave him a type of a buff. 1 Week.\n\nNidalee, Her kit rework was a major change as it affected how she was primarily played (mid lane) but it didn't much affect how she was played in the top lane, but buffed that playstyle. I'm unsure about such a rework, it might be worth 2/3 Weeks of ban.","replies":[{"poster":"Pyro","date":"2014-07-30T18:19:09.564+0000","up_votes":9,"down_votes":1,"body":"In Riot terms:\n\n**Champion Release** (new champion) and **Champion Relaunch** (major rework) - **3 weeks**\nThis includes new champions (Gnar) and complete reworks (Karma, Heimerdinger)\n\n**Champion Update** (minor rework) - **2 weeks**\n This includes reworks that do not affect the core gameplay of the champion (Skarner, Nidalee, arguably Sona). Can last longer if the impact is too severe (overbuffed 4.12 Lucian)\n\nAll other changes **together with patch, after 1 week.**","replies":[{"poster":"Meanie40","date":"2014-07-30T19:45:37.195+0000","up_votes":1,"down_votes":1,"body":"I'd move the minor rework to 1 week as well, though I thoroughly agree with the rest.\n\nEDIT: Seeing pros play on the same patch as live will help those who follow the LCS to use the strategies, rather than saying \"Bloodthirster OP? Not on live, this game doesn't relate to my play.\" (Just picked Bloodthirster as an example of a recent change.)","replies":[{"poster":"Pyro","date":"2014-07-30T20:34:54.936+0000","up_votes":1,"down_votes":1,"body":"A lot about the professional gaming is preparation - lisiting important picks and bans, deciding what to contest and what to leave for the enemy. The draft phase decides the flow of the game (ticking lategasme timebombs, early pressure, etc.)\n\nTeams need time to play on the new patch and observe which strategies work, otherwise it will be a game of \"Who is a better patchnotes fortuneteller\" and \"Who can pull out an all-nighter to test new champions\".  Plus, EU would get zero preparation time and NA would get two more days + observation of EU, as if they didn't do that already (EU regurgitates Korea picks like Xerath or Faker's mid Zilean, occasionally forging their own like Maokai top - then, NA copies them).\n\nAnd \"minor reworks\" can have a longer timeout than one extra week - 4.12 Lucian is unfit for competitve play (he would deprive  purple side of one ban).","replies":[]}]}]}]},{"poster":"M0redikaiser","date":"2014-07-30T17:37:24.161+0000","up_votes":3,"down_votes":0,"body":"I replied to Tiza's tweet and said that the duration of the global ban should be reduced to two weeks. Let me explain why.\n\nI'll start by saying that it is absolutely necessary to have a ban for the first few weeks. This lowers the possibility of \"cheese strats\" or teams dropping everything to be the first to play a new champion. As an example, let's say that Gnar is released on the Tuesday before a super week and immediately enabled. Cloud 9 could spend the week practicing what they already know, while Curse may spend those 3 days only playing Gnar. If Gnar gets through, Cloud 9 may not know how to play against him yet and may lose because of it. If he's banned, Curse will have lost almost the entirety of their practice time. In either situation, one of the teams was screwed, either by feeling rushed to learn the new champion or by not having the time to learn any counter-play. \n\nHowever, I feel that 4 weeks is a little too much time to get adjusted. From a competitive perspective, this both eliminates the possibility of a surprise pick, and the teams will probably have scrimmed against every other team's variation of the new champion. Now you may be saying \"But TeeKhay, you just made the argument that there needs to be a global ban so that teams can't surprise each other.\" I don't believe that this is a valid argument after two weeks because the players will have had sufficient time to learn some form of counter-play to the champion. If they haven't by this point, I would point the blame solely at the team who failed to do their homework. Also from a spectator's point of view, it's exciting to see the new champion and learn from the pros. While I think the players' interests should trump the spectators interest in this scenario, I feel that this is an appropriate amount of time that benefits both parties.","replies":[]},{"poster":"Pugnax","date":"2014-07-30T17:15:19.802+0000","up_votes":2,"down_votes":0,"body":"4 weeks to see a new champ in the competitive scene seems a bit much considering that everyone has the ability to witness the champ on live servers. I'm not saying if a new champ comes out the day before LCS that it should be allowed the next day but maybe a 2 week \"buffer\" time could suffice so pros could see where the champ fits in for their team comps and what not. I do not think it should take a full month for a team to understand what a champ can and can not do anymore.","replies":[{"poster":"TiberiusAudley","date":"2014-07-30T17:17:29.005+0000","up_votes":3,"down_votes":0,"body":"You misread the rule -- it says 4 weeks after they've been on the live service, not 4 weeks after the patch is played competitively.","replies":[{"poster":"Pugnax","date":"2014-07-30T17:25:04.021+0000","up_votes":1,"down_votes":0,"body":"Yeah thought i misread it at first, editing accordingly","replies":[]}]}]},{"poster":"Old Man Teeto","date":"2014-07-31T01:01:55.402+0000","up_votes":4,"down_votes":1,"body":"I'm going to specifically talk Worlds, as I feel LCS split is fairly well done already.\n\nLast year for Worlds we saw a Trinity Force buff in the patch that was sent to worlds.\n\nCorki, Kogmaw, and Ezreal who hadn't seen play for the majority of the season became go-to AD Carries.\n\n-------------\n\nAll three of these champions saw no changes that would prevent them from being played (kit rework and such) but became the primary candidates for play.\n\nI feel as if the patch that Worlds is played on should be the patch that the final qualifiers is played on.\nLast year Dade of MVP Ozone saw THREE of his core signature champions nerfed that helped him qualify, in return he was crushed by players whose core champions were either buffed or had newly favorable match ups.\n\nNot only would be see the best play out of teams and players by ensuring no psychotic change occurs between the end of Qualifiers and Worlds, but we might actually see the best team of the season, instead of the patch.\n\n---------\n\nAs this pertains to Gnar, I feel he should NOT be allowed at Worlds as he won't be there for Qualifiers, but his 1 month hiatus would be up in time for Worlds if you don't specifically remove him from being played there.","replies":[]},{"poster":"Akava","date":"2014-07-30T17:16:59.086+0000","up_votes":4,"down_votes":1,"body":"I think it should stay at 4 weeks. While I can appreciate the work that goes into a new champion, it's almost impossible for the developers to know how the community will use a new champion. A lot of champions in recent memory have been released in a state where they are pick or ban and that's not healthy for the competitive scene. Reducing the time frame may also result in knee jerk reactions from developers as they panic to balance a new champion so they don't harm said scene.","replies":[]},{"poster":"Young Jmac","date":"2014-07-30T17:09:53.882+0000","up_votes":5,"down_votes":2,"body":"I think having larger champion pools is better, what I would suggest is moving that 4 weeks to 2 weeks or so. It's a good compromise.","replies":[]},{"poster":"MalikCaesar777","date":"2014-07-31T03:54:14.124+0000","up_votes":2,"down_votes":0,"body":"I would leave it as is.\n\nTeams should be allowed to adjust to these changes. \n\nHaving to deal with a reworked/altered champion for the first time in a competitive environment would be difficult.\n\nIt would also cause problems in terms of fairness, since some players do have knowledge before hand about champion changes. \n\nSo some players may get more hands on time with a reworked/altered champ.\n\nNot to mention if something is downright game breaking and it goes through it shatters every team's strategy.","replies":[]},{"poster":"Aryite","date":"2014-07-30T18:49:15.582+0000","up_votes":2,"down_votes":0,"body":"I honestly feel like the pro scene scares developers while they're designing champions. A champion can't be too strong or the pro scene is gonna flip. I think that new champions shouldn't be played until a full patch later or at least until the balance team can decide what kind of changes the champion needs first. We don't want something to be too strong or too weak. \nAlso, I feel like new champions should be banned from ranked for a certain time period as well. Isn't the ranked queue supposed to feed into the CS and LCS? It doesn't feel that way at all when people play champions for the first time in ranked.","replies":[]},{"poster":"ImTheProof","date":"2014-07-30T18:48:08.070+0000","up_votes":2,"down_votes":0,"body":"I think new/reworked champions should become available in LCS in the patch after they are released. For example, as Braum came out in patch 4.7, he wouldn't be able to be played until the LCS is on patch 4.8. While this isn't a \"set\" amount of time (like 2 weeks, 3 weeks, etc) it is enough time for any major bug fixes or any major balance changes.\n\nIt is equivalent to saying \"3 weeks\" because patches have been coming out every 2 weeks, but it is flexible should the patch schedule change for w/e reason. It also gives enough time for hotfixes (as does the current system).","replies":[]},{"poster":"FalcoCreed","date":"2014-07-30T18:38:35.634+0000","up_votes":2,"down_votes":0,"body":"4 weeks is a long time to wait, but if the impact that Braum and Yasuo have had on the competitive scene is any indicator, 4 weeks is a good amount of time for nerfs to come through and teams to adapt to the new champion. However, for large kit changes, like Lucian or Kha'Zix, 1 week would be a good amount. Then for large reworks, like Sona and Nidalee, 2 weeks seems appropriate. Obviously, minor tweaks and number adjustments should continue as normal.\n\nAs for large tournaments/events, like Worlds, all champions should be available, but there shouldn't be any major changes to anything in the 1 to 3 weeks leading up to the event, with larger tournaments getting more time to adapt. Following this for worlds, the last big changes should be done before the middle of August, assuming Worlds begin in the middle of September.","replies":[]},{"poster":"YEE boi","date":"2014-07-30T18:20:55.391+0000","up_votes":2,"down_votes":0,"body":"2 weeks seems like it would be enough, 4 weeks is a little much but it's not really detrimental","replies":[]},{"poster":"PrezMango","date":"2014-07-30T17:42:28.837+0000","up_votes":2,"down_votes":0,"body":"I first wanna start by saying champion reworks are a great way to improve a player's experience with a particular champion as well as opening the doors to seeing more usage of underused champions in the LCS. I love hearing and reading about reworks since it's sort of like evolving a champion and readjusting the game to \"fit\" the way it's played today (vs the way it was played in previous patches/seasons).\n\nIf who have undergone reworks are disabled for four weeks, the hype upon it's release dies down after a while and people don't really have a reason to play them.  Pro players will stream and don't have as much of a reason to play these new champions since there isn't as much of a reason to (due to the lack of relevance since the champion is disabled for weeks to come). I know that some pros dont play on live patches until it's relevant (i.e. LCS matches are on the new patch). The reworked champions in general may not see as much play as we'd like. I'm assuming that part of the goal with these reworks is to see more play with these champions (I understand I could be wrong here if my assumption is flawed/incorrect).\n\nPro teams have to readjust and learn new patches upon them going live in LCS; certain champions are suddenly better picks than others, certain item builds may now be ideal vs the old ones, etc. I feel like if the timing of champion reworks were released at the same time as patches, it's easier for people to see the strengths and weaknesses of any given picks, and they'll be more likely picked/favored over the way they were before. As an example, I personally think Skarner's update was an overall good one and made him more playable than he was pre-rework, but he's hardly seen in LCS - maybe one or two games on him? Nidalee's most recent rework on her abilities (not as much a \"rework\" as it was an update, maybe not the best example) came out with patch 4.11 (if I'm not mistaken) and  we've seen her played in LCS. She's still relevant in the meta.\n\nTl;dr - Enabling champions who had a rework with patches as opposed to disabling them for four weeks can help with popularity and likeliness of seeing the champion more often (like {{champion:76}} ) as opposed to championships who got reworked but are still less favored (like {{champion:72}} ).\n\nBut, of course, these are just my opinions. What do you guys think?","replies":[]},{"poster":"CaptainMårvelous","date":"2014-07-30T17:37:00.720+0000","up_votes":2,"down_votes":0,"body":"Can we have this rule for ranked as well?","replies":[]},{"poster":"unSatisfied","date":"2014-07-30T17:28:24.142+0000","up_votes":2,"down_votes":0,"body":"I think it should be moved down to 2 weeks but no lower.","replies":[]},{"poster":"PepitasNestle","date":"2014-07-30T17:20:01.537+0000","up_votes":3,"down_votes":1,"body":"I think the timing is fine. The thing I think that needs to be standardized with this is how it is enforced across all region. Last year Korea was put into a tough spot due to the fact that they had only been playing competitively on the current patch for a week or so before the competition while every had be playing on it for a couple of weeks to a month. Otherwise I am fine with the current setup.","replies":[{"poster":"M0redikaiser","date":"2014-07-30T20:26:11.921+0000","up_votes":1,"down_votes":0,"body":"Korea no longer has any problems like this. China does, but there's nothing that Riot can do about that.","replies":[]}]},{"poster":"TiberiusAudley","date":"2014-07-30T17:19:28.355+0000","up_votes":3,"down_votes":1,"body":"I think the rule is fine as-is.  With the wording that reworks are subject to LCS discretion, it allows you to make a decision to enable it sooner or keep it disabled longer should its balance prove questionable or bugs like Rengar's Q critting or being able to be queued through use of his ultimate arise and require fixing prior to the champion being playable in LCS.","replies":[]},{"poster":"Cyraknoss","date":"2014-07-30T17:14:18.679+0000","up_votes":3,"down_votes":1,"body":"Honestly I like the rule. It gives time for both us viewers and the pros to see the champion in soloqueue and get a general idea of what it does and how it might work before it shows up in the LCS. For big events like All Stars or Worlds I'd hope that no new champions/reworks or patches be allowed from start to finish. Patches can shift how teams play and one hitting in the middle of an event like Worlds could go a long way to ensuring a team that maybe wasn't as good at the start suddenly wins the whole thing off the back of some patch/champ rework specific cheese.","replies":[]},{"poster":"Alleka","date":"2014-07-30T17:14:00.393+0000","up_votes":3,"down_votes":1,"body":"It should run live on the patch following the release (given the delay on LCS from live, probably 2-4 weeks depending on the release date within the current patch).  That gives time for fine-tuning the balance of the champion and should introduce the champion slightly quicker, which is what the audience wants to see.","replies":[]},{"poster":"lojician","date":"2014-07-30T18:50:46.955+0000","up_votes":4,"down_votes":2,"body":"Maybe if you force the pros to deal with broken abominations like lucian and nidalee when the rest of us do they'll get fixed in a more timely manner.","replies":[]},{"poster":"WaytotheDawn63","date":"2014-07-30T17:13:44.370+0000","up_votes":4,"down_votes":2,"body":"It definitely takes too long to see new champions/reworks in competitive. As evidenced with Braum, players are great at picking up new champions quickly. And I think delaying their availability only slows down peoples ability to learn to play against them.\n\nThat said, unless it's an entire champion relaunch, reworks should be available more quickly than new champions. Reworks are significant changes, but are still far less impactful than an entire new champion.\n\nAdditionally, the thing about delaying new champions/reworks is the patch players play on. These champions normally launch with a patch that introduces many changes. So they play on a patch with only SOME of those changes. A champion/strategy on a new patch can be stronger (or weaker) because a champion that actually launched with that patch is not available also.\n","replies":[]},{"poster":"MadCast VoShay","date":"2014-07-30T17:09:48.755+0000","up_votes":6,"down_votes":4,"body":"Personally, I think if its good enough for the patch, it's good enough for the LCS. While keeping a buffer between Worlds/All-Stars/Playoffs and potentially unbalanced content, I see no reason to keep the 'weekly' games protected from new/reworked content.","replies":[]},{"poster":"the waterdog","date":"2014-07-31T03:05:09.824+0000","up_votes":2,"down_votes":1,"body":"Doubt a red answers this because it calls their processes into question, but why in the world are they asking us?  Do we have experience playing in the LCS or at a high level?  This reeks of pandering to win over the majority for any change they make even though our opinions shouldn't really matter.  If they were asking whether we'd like to see new champions as soon as possible without regards to competitive integrity, then sure.","replies":[]},{"poster":"Mughi of Ruckus","date":"2014-07-31T18:28:10.174+0000","up_votes":1,"down_votes":0,"body":"It's easy to say fairness certainly demands the delay.  After all the question being asked is how interesting the latter could make things, as we see the pros trying to adjust to the new champions and/or changes in real time.  I think the greater question, though, requires a data driven answer first:  How much end effect would this actually have on a given team's season?  I expect not much, frankly.  A swing of a few games at the absolute most.  If the effect is minimal, it doesn't really matter.  There'll be no reason to hold back.  If it's not, then the question of which outcome is considered most valuable actually becomes a question.  Even then, though, releasing champions on a schedule that's mindful of tournaments in the LCS would likely help minimize any disruptions to season standings just as well.","replies":[]},{"poster":"Acidic Puddle","date":"2014-07-31T13:46:54.262+0000","up_votes":1,"down_votes":0,"body":"I think there should be at least a week between a rework being played in the LCS, but this could be extended due to an issue, and a month for new champions. For the reworks this is because there could still be something unbalance that can be exploited. But with new champions I would like for the pro players to have time to practice with the champions so they can be used to their fullest potential by the worlds best!","replies":[]},{"poster":"MrSc0tty","date":"2014-07-31T11:31:42.765+0000","up_votes":1,"down_votes":0,"body":"I've said it once I'll say it a thousand times. \n\nLCS players should be playing the same game that casual players have to. If Lucian is broken, or Rengar is bugged, and you don't want pro players showcasing that for the world to see? Better fix it before they play then.","replies":[]},{"poster":"Cepheus","date":"2014-07-31T05:35:08.389+0000","up_votes":1,"down_votes":0,"body":"Looks good as it is, apply to significant reworks as well plz.","replies":[]},{"poster":"Mattarias","date":"2014-07-31T05:22:34.436+0000","up_votes":1,"down_votes":0,"body":"A month is good, honestly. Too much of a wildcard otherwise.","replies":[]},{"poster":"Enoz","date":"2014-07-31T01:50:21.747+0000","up_votes":1,"down_votes":0,"body":"New champ should be 2 weeks\nrework 1 week\n\nOnce playoffs start they should keep same patch for that round of playoffs  \nthe entirety of worlds should be played on the exact same patch with the same restricted champions","replies":[]},{"poster":"dois","date":"2014-07-31T00:49:58.576+0000","up_votes":1,"down_votes":0,"body":"Hi there, \n\nFirst of all i think that Riot should valorize the hard work that teams do to be up to date, and from what i see i guess that when  a new champion came out, he should be played asap. And why? Cause teams have to be ready to that kind of modification, and with that i guess  we could add a new factor to the equation that teams train, *Adaptability*. Because almost all the teams can come up strong with one month off training over a champion. It will add a lil' of unpredicatable and a surprise factor bring to the LCS more competition, and we could see some weaker teams come stronger after a new release or rework. Kappa","replies":[]},{"poster":"Alcyon","date":"2014-07-31T00:03:30.324+0000","up_votes":1,"down_votes":0,"body":"Having 4 weeks is too long of a time and any innovative ideas that players have become too wide spread and punish the early adopters of a champion in my opinion. \n\nOne of the skills the pros have are the ability to recognize the strengths of a champion.  If they find a strat that works better than what opponents have come up with then they should be allowed to use it.  \n\nWhat some consider cheese strats, I see just a strat that makes use of a new champion's strengths.  I think there should be some reward for coming up with a superior plan faster. \n\nSo I feel that the champs availability in lcs should be 2 weeks instead of 4.  This should allow for game breaking bugs to be found that slipped through the PBE while still letting pros have a benefit for their innovation.","replies":[]},{"poster":"Soarent","date":"2014-07-30T23:52:58.722+0000","up_votes":1,"down_votes":0,"body":"This is what I think:\nNew Champions shouldn't be playable until the next patch seeing that this will be the time he/she gets nerfed or buffed. It also allows teams to find counters and know how to play so called champion.\nReworks that don't chance a champions abilities so much like Heim's and newly Sona's should be allowed right away seeing that they aren't really far from the original kit.\nReworks that change a whole champions kit like {{champion:101}} shouldn't be allowed till the next patch to. \nSeeing that they could need nerfed or buffed.\nThat's my opinion but I can see people think differently. All I know is I wouldn't want to go up against a just recently complete rewored champ or a champ that people are still learning how to say there name.","replies":[]},{"poster":"TDeck","date":"2014-07-30T23:18:55.213+0000","up_votes":1,"down_votes":0,"body":"I quite like the current system. I feel like if the time frame was shortened the balance team would try to get that champion balanced quicker and because of that they might have a higher chance of overreacting to a certain part of a Rework/NewChamp instead of waiting to see what the overall problems are.\n\nas far as events; I would prefer if worlds was played on a patch where everyone had plenty of time to adapt and come up with strategies with no new content for a while but I could absolutely see how the viewer might just want to see a new champ that was released right before worlds or something like that.\n\n\n\nIf there was a change to the 4 week rule, I think xAtri's post is a very good road to take or at least explore. New champions should always take the longest though in my opinion. Even tho the PBE does a great job ironing out glaring problems, PBE just doesn't have enough data to be confident in a champions power level on its release to live.","replies":[]},{"poster":"Nine Ravens","date":"2014-07-30T23:17:10.794+0000","up_votes":1,"down_votes":0,"body":"I don't think there should even be a delay before teams can select new or reworked champions in the LCS. Every team in a region has the same amount of time to acclimate to the new patch, so each team starts out in the same position and determining how much they should focus on new/reworked champions simply becomes part of their strategy and incorporates its own set of risks and rewards.\n\nIf a team wants to devote most of their practice into incorporating a new champion, that's a strategic gamble. They may be able to surprise opponents with a slick new strategy, but they run the risk of their opponents having discovered a counter-strategy they weren't aware of or of having the champion banned away.\n\nAlternatively, a team could choose to ignore a new champ and plan on just banning it against teams they suspect will pick it, but the tradeoff is having effectively one less ban against those teams, or getting blindsided by a team they didn't scout properly and let the champ through against. Either way, these are strategic choices the teams should be allowed to make.\n\nPatches have introduced other changes that affect balance as much as, if not more, than a new or reworked champion that, AFAIK, are not regulated by the LCS rules. Major changes to items or summoner spells, such as the recent marksman itemization changes, can have a dramatic impact on balance as well. If teams can be trusted to adapt to such changes in the week before the LCS switches to the newest patch, I think they can handle new champions as well.\n\nI feel similarly about larger events such as Worlds. There may be more of a discrepancy there since not all regions get the latest patch simultaneously, so some teams may have less time than others to practice. However, these are one-time events scheduled well in advance. If Riot doesn't want to have such events determined by who adapts quickest to the latest changes, then it is simply a matter of not making major changes to the game - to champions, items, or any other part of the game - right before such events. \n\nI would also like to echo something other players have voiced - if a new champ isn't okay to be picked in the LCS, why is it okay for that champ to be picked in Ranked? If you're worried about potential balance issues or lack of experience with new champions upsetting the outcomes of LCS matches, why is okay for them to influence Ranked games? I feel that the same policy should apply to both settings. If you want to ban champs for a time in LCS, do the same for Ranked. If you let champs be immediately available in Ranked, then the LCS should do the same.","replies":[]},{"poster":"SwiftStriker00","date":"2014-07-30T21:06:16.715+0000","up_votes":1,"down_votes":0,"body":"4 Weeks is a bit much. Your talking a third of the split a champion will be unplayable. Lets take Gnar since he is new.  And lets say the new champ is 2 weeks probation. That's fine, because usually by the 2-3 weeks Riot will most likely patch Gnar to bring his numbers more inline for whatever reason. Well Its going to be a week from that point. Ultimately you'll still get a 3-4 week window of no LCS play, unless Gnar's release is pretty seamless then he might come in a bit sooner.\n\n*Just as a side note, define Minor  I don't think a one week probation would be necessary if it was a small tweak to one skill e.g. Q now has 5%-> 6% AP Scaling. I think it would be fine to enable him by the start of the next week.\n\ntldr; New Champ, Major Rework - 2 weeks. 1 Week addition for any Minor change. <1 week for tweak","replies":[]},{"poster":"Jamore","date":"2014-07-30T20:37:01.772+0000","up_votes":1,"down_votes":0,"body":"At least four weeks!","replies":[]},{"poster":"Pr1ma1","date":"2014-07-30T20:07:11.115+0000","up_votes":1,"down_votes":0,"body":"I think the month is good for new champs but a rework should be given 2 week after it is released","replies":[]},{"poster":"Docternative","date":"2014-07-30T18:15:39.930+0000","up_votes":1,"down_votes":0,"body":"> a new champion release throws some chaos into teams' plans (which isn't necessarily a bad thing!)\n\nI think that's your answer. \nUnless a new champion is so bugged/broken that he wouldn't be allowed to be played anyway, I don't see a reason why the champion shouldn't be available at the same time as the new patch (1 week), since patches can also lead to major gameplay changes and Riot's strategy when it comes to the competitive scene is all about rewarding teams that can adapt in a very short amount of time.\n\nI do think however there should be a cutoff date at least when it comes to worlds (no new patches/champions/reworks starting 4 weeks before worlds until it ends.)","replies":[]},{"poster":"IZMYNIZ","date":"2014-07-30T18:15:37.123+0000","up_votes":1,"down_votes":0,"body":"In my opinion, worst case scenario is the champion gets permabanned for a patch. If you are really worried about a champion being OP you shouldn't let them be played in solo queue either. I think the right people to ask are the LCS players themselves here. Maybe make internal polls for the players as a whole to decide what should go into LCS? They will have the best idea on what is going to be op in LCS or not, so why not ask them? If this route is taken, though, I think the process should be transparent, so we can see what they actually think and why.","replies":[]},{"poster":"Pryotra","date":"2014-07-30T18:09:15.308+0000","up_votes":1,"down_votes":0,"body":"2-3 weeks, for normal reworks and new releases\n\n1 week tops for minor changes to a champ like Mao or maybe even Sona.","replies":[]},{"poster":"Coach Feratu","date":"2014-07-30T18:03:49.741+0000","up_votes":1,"down_votes":0,"body":"I think newly released/reworked champions should be available asap for the lcs and cs matches.\nIf that champion is supposedly imbalanced then it's the teams' decisions to either pick, ban or simply ignore that champion. It makes the game more thrilling to see something new which may give one team an advantage or disadvantage based on how they play something they're unfamiliar with.\n\nTLDR; New champions can be banned, let them be available","replies":[]},{"poster":"Etosh","date":"2014-07-30T17:55:55.002+0000","up_votes":1,"down_votes":0,"body":"Imo, you should disable champions with a 90+% pick/ban rate until they are fixed. Seeing Lucian disabled because he is too strong was just too much for me to handle, seeing Kassadin permabanned in Europe since the beginning of EU LCS. \n\nReworked champs should be disabled for one week and newly introduced ones for two weeks. There aint no thing such as minor rework.","replies":[]},{"poster":"Jungle Trundle","date":"2014-07-31T03:27:40.719+0000","up_votes":1,"down_votes":1,"body":"1 week\n\nI want it to be 1 week.  Riot has said over and over that League is all about ADAPTING TO THE EVER-CHANGING.  Why make pro players wait a month?  If they recognize that a champion is OP, let them have the option to wreck with them and/or ban.  It just makes sense.  Allow pro players to have another reason that they're pros: analysis of new kits","replies":[]},{"poster":"Avían","date":"2014-07-30T19:10:32.830+0000","up_votes":1,"down_votes":1,"body":"Maybe 2 weeks? I do think 1 month is overkill, everyone probably plays against & with it on Solo Queue, they do play alot of games & 2 weeks could be enough to have the experience, on what is good with it & vs it.","replies":[]}]}