{"poster":"Sneaky Pepper","date":"2018-11-06T20:02:45.805+0000","title":"Botlane LF Team [D3+]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Abend Summoners\r\n\r\nWir sind gemeinsam auf der Suche nach einem competitive Team, das Ambitionen hat sich individuell und gemeinsam zu verbessern.\r\n\r\nIch bin 21 Jahre alt und komme aus der Schweiz.\r\nBringe sehr viel Teamerfahrung mit, da ich die letzten 3 Jahre sehr viel Competitive gespielt und ebenfalls an sehr vielen Turnieren teilgenommen habe.\r\nIch selbst habe einen sehr teamorientierten Spielstil, kann mich daher jedem Team anpassen und mit den Ressourcen dementsprechend umgehen.\r\nBin an sich ein sehr vocaler Spieler, bringe ebenfalls Shot Call Erfahrung mit.\r\nDie letzten 5 Wochen hatte ich eine kleine League Pause wegen RL, bin aber jetzt umso motivierter wieder aktiv zu spielen und zu improven.\r\n\r\nMein Support ist 20 Jahre alt und kommt aus Deutschland.\r\nEr bringt ebenfalls sehr viel Teamerfahrung mit, spielte ebenfalls die letzten 3 Jahre competitive und war an vielen Turnieren beteiligt.\r\nIst von der Person her etwas ruhiger Natur.\r\nEbenfalls sehr motiviert zu improven und unsere Ziele zu erreichen.\r\n\r\nAdc - D3 - http://euw.op.gg/summoner/userName=Sneaky%20Pepper \r\nSupport - D2 - http://euw.op.gg/summoner/userName=Wol&yuml;o\r\n\r\nUnsere Ziele\r\n-Sich f&uuml;r die 2nd Div ESL Meisterschaft qualifizieren / oder ggf. mitspielen\r\n-Regelm&auml;&szlig;ige Trainingszeiten\r\n-Konstantes improven innerhalb sowie ausserhalb des Teams\r\n\r\nWir w&uuml;rden es sehr willkommen hei&szlig;en, wenn das Team bereits Unterst&uuml;tzung von einer Organisation bekommt in Bezug auf einen Coach usw.\r\n\r\nBei weitere Fragen oder Interesse addet mich bitte inGame unter:\r\nSneaky Pepper","replies":[{"poster":"GG SURRENDER PLS","date":"2018-11-07T13:53:58.380+0000","up_votes":1,"down_votes":0,"body":"\"Konstantes improven innerhalb sowie ausserhalb des Teams\" \nDas schafft ihr nur wenn ihr nicht den ganzen Tag Normals und ARAMs spielt, als Tipp :-)","replies":[]}]}