{"poster":"Farnow","date":"2019-04-15T00:12:35.091+0000","title":"Kill-Xp/ snowballing und wie man es nerven sollte um den Jungle zu schwächen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Früher war es mal so, dass ich einen Laner zwar töten konnte aber nicht zwangsläufig musste. Ich konnte auch einfach gut farmen. In der Lane war wave managment wichtig und zudem ging es darum gut zu spielen. Ein Jungler konnte einer Lane zwar helfen hat sie aber nicht zwangsläufig in eine komplett andere Richtung gedrückt. Nun hat der Jungler mehr Einfluss den je. Dadurch das Kills scheinbar deutlich mehr xp geben als zuvor und es gleichzeitig noch die Turretplatings gibt ist der Einfluss der Jungler auf das Spiel und snowballing allgemein sehr stark. So wird der bessere Jungler im Schnitt mehr Spiele gewinnen als verlieren zumindest deutlicher als andere Rollen. Mir geht eines auf jeden Fall zu weit. Es ist klar das der Jungler sehr viel Einfluss auf das Spiel hat, aber aktuell ist es zu viel. Ich würde mir wünschen, dass die XP für einen Kill deutlich reduziert wird und shut down gold für farn noch langsamer aufgebaut wird. So wird snowballing reduziert und Spieler die gut farmen und ihre lane dominieren nicht durch einen Gank sofort in die Negativität geschoben. Ich weiß der Jungler soll etwas bewirken doch das gold eines Kills ist schon mehr als genug. Dann ist ein jungler der einige Kills hat auch nicht gleich auf dem Level der Sololaner. Desweiteren würde ich die Zeit in der die Turretplatings vorhanden sind etwas nach hinten verlegen, wenn ich sie nicht komplett entfernen würde oder das Gold reduzieren. Denn die Rolle den die Platings spielen sollte, erfüllen sie nur bedingt bis gar nicht. Sie stoppen extrem snowball nicht leicht ohne early game champs zu stark zu schwächen, sondern sie verstärken eben diese über das Maß hinweg. Was sind schon 14 Minuten Schutz? Die Platings werden mit dem Harold meist nur zu einer einfachen gold quelle. Auch werden sie durch Rotationen eigentlich nur zu einer zusätzlichen Goldquelle für das gewinnende Team.\r\nZusammenfassend wünsche ich mir eigentlich nur wieder mehr ein ruhigeres League of Legends mit mehr Laning und Planung. Klar mechanische Skills sind toll, aber sie sollen wenn möglich nur ein Teil sein und gerade im Lategame scheinen. Ich will die Möglichkeit haben durch zoning und weiteres gut ahead zukommen und gleich zeitig meine feedende Botlane zu carrien (in einem vernünftigen Ramen natürlich)\r\n\r\nIn der Hoffung in Zukunft wieder mehr Spaß an League haben zu können\r\nKai (Farnow)","replies":[{"poster":"MadoTV","date":"2019-04-15T13:43:50.242+0000","up_votes":1,"down_votes":0,"body":"Ich spiele jng jnd dieTurrets sind einfach schwach sie brauchen mehr schaden oder attack speed.\nzu der ersten Sache wir jungler wären ohne diesen Impakt nutzlos","replies":[]},{"poster":"Nack321","date":"2019-04-15T08:30:34.847+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung steckt das Hauptproblem bei den Türmen die einfach viel zu schwach sind und nicht wirklich Schutz gibt wie sie eigentlich sollten. Was zb eine verbesserung wäre wäre wenn der Tower mehr aushalten würde oder der Tower wie in 3vs3 viel schneller schießen würde damit es weniger möglich wäre unter dem eigenen Tower auch mal vor nem Asssinen mehr Schutz zu haben bzw gegen Juggernaut wie Darius oder Garen.","replies":[]},{"poster":"ObeyTheCode","date":"2019-04-15T04:16:57.161+0000","up_votes":1,"down_votes":0,"body":"Riot soll mal das Balancingteam austauschen, dann wir der Snowball schwächer. Einfach ekelhaft was mit der Botlane abgeht. Ich spiele Mundo als Support und stompe jede Lane.","replies":[]}]}