{"poster":"TlNA","date":"2015-06-17T01:46:54.703+0000","title":"Server Down","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Wird heute was gepatcht oder warum gehen die Server schon wieder down ?","replies":[{"poster":"Dullitwin","date":"2015-06-17T02:20:18.094+0000","up_votes":2,"down_votes":0,"body":"Ich kann dir nur empfehlen dir das Ausrufezeichen durchzulesen da stehen immer interessante Informationen drin =)","replies":[]},{"poster":"TlNA","date":"2015-06-17T02:11:13.558+0000","up_votes":2,"down_votes":1,"body":"Du keiner zwingt dich dazu dieses Spiel zu spielen. Ich habe den Thread erstellt weil ich wissen möchte ob Riot heute den neuen Patch einspielt, oder es wieder nur hotfixes sind. Aber danke für deine Anteilnahme !!!","replies":[]},{"poster":"Busty Botter","date":"2015-06-17T07:55:48.488+0000","up_votes":1,"down_votes":0,"body":"server gehn wieder alle","replies":[]},{"poster":"Busty Botter","date":"2015-06-17T06:33:34.730+0000","up_votes":1,"down_votes":0,"body":"auch wenn ich keine 0815 frauen mag, sind die wartungen noch immer im gange","replies":[{"poster":"Lena0815","date":"2015-06-17T07:43:12.383+0000","up_votes":1,"down_votes":0,"body":":) thx","replies":[]}]},{"poster":"Lena0815","date":"2015-06-17T06:23:33.927+0000","up_votes":1,"down_votes":0,"body":"kurze frage liegt es an mir oder ist der server noch in wartung ? zu denn vorigen kommentaren fälllt mir nicht viel ein jeder muss selbst wissen ob oder eben ob er es nicht spielt aber ich finde die wartungen erträglich und riot arbeitet gut am spiel keine großen ausfälle usw einige sollten sich also nicht so anstellen :)","replies":[]},{"poster":"Kayrok93","date":"2015-06-17T02:08:19.938+0000","up_votes":1,"down_votes":5,"body":"Ich kann nur dazu sagen! Riot ist der letze dreck auf erden die bekommen einfach null auf die reihe und sollten sich besser eine anderes hobby suchen! wegen diesen scheiß problemen von diesen scheiß pissern wurde ich jetzt schon das 2 mal abgestuft ! zuerst hatten alle probleme in das game zu finden außer zum 4 mal die gegner ! und wir hatten mit problemen zu kämpfen ... ihr scheiß pisser solltet euch mal was für die community einfallen lassen denn viele werden unnötig abgestuft weil ihr kleine idioten einfach nichts auf die reihe bekommt. also tut mir bitte einen gefallen und sucht euch mal bessere angestellte! \n\nPS: Hoffe das ihr irgendwann mal so stark gehackt werdet das ihr das spiel endgültig an den nagel hängen könnt ! *drücke ganz fest die daumen dafür*","replies":[{"poster":"NoWayØut","date":"2015-06-17T04:52:30.609+0000","up_votes":1,"down_votes":1,"body":"Junge die kriegen wohl was auf die reihe. client die bewegungen im game,\nund das riot mal geddost wird ist doch jeden klar kein system der welt kann ein\ngut gezielte häcker angriffe überstehen.\n\nund die tun alles mögliche damit wir spielen können, beheben die meist größsten bugs im game\n(durch jeden gelösten bug kommt ein neuer bug hin zu)","replies":[]}]},{"poster":"Ostaralon","date":"2015-06-17T03:22:48.659+0000","up_votes":1,"down_votes":1,"body":"Ach wenn alle da rein reden sag ich auch mal was @Kayrok93 ich möchte nur mal klar stellen\ndas EUWEST der meist besuchte Server ist  (soweit ich weiß) und von Tag zu Tag werden es immer \nmehr, da ist es kein Wunder das die Server ab und an down sind. Und wenn die das nicht passt dann \nhör doch einfach auf das Spiel zu spielen...... so sehe ich das \n\nGruß Ostaralon!!","replies":[]}]}