{"poster":"J Epstein","date":"2018-06-18T01:02:50.657+0000","title":"Smite should be automatically selected when jungling","subforum":"Gameplay","up_votes":29,"down_votes":4,"body":"Playing with people who &quot;forgot smite&quot; cause unnecessary losses.  You can&#039;t even report them because what category would you choose?  And ok, lets say it was a mistake, why should I automatically lose because  of it?\n\nRunes have a auto-switching mechanic when the rune is incompatible with a champion.  It wouldn&#039;t be too hard to auto switch one Summoner Spell with smite for people who fill the role as jungle.\n\nThis isn't controversial, and can only lend to a more positive experience.\n\nedit:  If I ran smiteless jg in ranked and was lvl 2 while rest game was lvl 6, would this not cause suspicion of trolling?  auto-selecting smite for those who get rolled JUNGLE helps curb this autoloss","replies":[{"poster":"MagicFlyingLlama","date":"2018-06-18T01:43:11.294+0000","up_votes":12,"down_votes":6,"body":"Not everyone queued as jungle is actually playing jungle.\n\nThis would just outright not work. A reminder in select would be ok, though.","replies":[{"poster":"Infernape","date":"2018-06-18T10:18:06.627+0000","up_votes":7,"down_votes":0,"body":"So let people actually swap roles.","replies":[]},{"poster":"J Epstein","date":"2018-06-18T01:50:54.470+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=0000,timestamp=2018-06-18T01:43:11.294+0000)\n>\n> Not everyone queued as jungle is actually playing jungle.\n> \n> This would just outright not work. A reminder in select would be ok, though.\n\nit is something though?  if they gonna trade that's extra emphasis on reminding the jgler to pick smite","replies":[]},{"poster":"GripaAviara","date":"2018-06-18T12:57:07.142+0000","up_votes":3,"down_votes":0,"body":"And? If you don't want to play jungler you swap and change summoners.","replies":[]},{"poster":"Cosnirak","date":"2018-06-18T13:22:54.787+0000","up_votes":1,"down_votes":0,"body":"All they have to do is have it automatically set one summoner to smite if you don't already if you are selected as jungle at the start but still let people swap off smite from there if they want to.","replies":[]}]},{"poster":"WubbaLubbaDubDab","date":"2018-06-18T07:11:23.361+0000","up_votes":5,"down_votes":0,"body":"exactly make smite default when some1 has the jg role and if they swap they can freely change the smite.","replies":[]},{"poster":"Despìca Bìll","date":"2018-06-18T08:23:40.363+0000","up_votes":6,"down_votes":1,"body":"Anybody who fills the jungle role, whether by original choice or by swap, should have smite autoselected. Then, if they choose to change it, a dialogue box should ask them to confirm. That way, if they go smiteless, it's clearly by design, and not another autofill who forgot he was even jungling.\n\nGreat idea, OP...this would be a small but wonderful QoL fix.","replies":[]},{"poster":"Mcsquzzy","date":"2018-06-18T18:51:53.504+0000","up_votes":3,"down_votes":0,"body":"I remember riot giving a reason why they have not made made this change. The community is divided on which button is for which summoner. So forcing then one way or another may effect them. \nGranted the one time I mixed them up I just changed the hotkeys in options","replies":[{"poster":"J Epstein","date":"2018-06-20T01:02:24.339+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mcsquzzy,realm=NA,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=000d,timestamp=2018-06-18T18:51:53.504+0000)\n>\n> I remember riot giving a reason why they have not made made this change. The community is divided on which button is for which summoner. So forcing then one way or another may effect them. \n> Granted the one time I mixed them up I just changed the hotkeys in options\n\nYeah i agree at one point it might have been viable to not pick smite as jg, but this new jg is hard enough even with smite.  \n\nI think of it like this:  If I got a smiteless jg every game who was lvl 3 while rest of game was lvl +6, would that be a fair game?","replies":[]}]},{"poster":"TheMinionLeader","date":"2018-06-18T16:54:01.870+0000","up_votes":3,"down_votes":0,"body":"That is the ultimate feelsbadman loading screen. Jg without smite xD","replies":[]},{"poster":"Kídá","date":"2018-06-18T12:47:26.669+0000","up_votes":3,"down_votes":0,"body":"I think it would be better to allow us to set preferred summoner spells for each role that load up when you enter champ select. If you role swap then its on you to change your spells accordingly but this would help mitigate much of the issue with no smite junglers.","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-18T16:34:29.085+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Rorek,realm=NA,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=0004,timestamp=2018-06-18T12:47:26.669+0000)\n>\n> I think it would be better to allow us to set preferred summoner spells for each role that load up when you enter champ select. If you role swap then its on you to change your spells accordingly but this would help mitigate much of the issue with no smite junglers.\n\nI think it should work for junglers not bot lane and here is why:\n\nTop as {{champion:240}} when he first came out most kleds took {{summoner:3}}  but now we take {{summoner:14}} {{summoner:21}}  and usually {{summoner:12}}.\n\nMid as {{champion:142}} I have taken{{summoner:3}} {{summoner:14}} {{summoner:1}} \n\nBot as {{champion:222}}  adc I have taken {{summoner:7}} {{summoner:21}}  and even {{summoner:3}} \n\nDont get me started on support.","replies":[{"poster":"Kídá","date":"2018-06-18T17:28:00.711+0000","up_votes":1,"down_votes":1,"body":"It would be player preference. You would choose spells just like it is now except at the start of draft you would have your preset spells selected","replies":[]}]}]},{"poster":"TheCodeisCupCake","date":"2018-06-18T10:10:34.992+0000","up_votes":3,"down_votes":0,"body":"How about a Red outlined bold message appears the last 30 seconds after everyone has locked in a champion (When you are choosing runes etc) that tells your team nobody has picked smite. The message is automated if, nobody has picked smite","replies":[]},{"poster":"remakoro","date":"2018-06-18T16:51:38.021+0000","up_votes":2,"down_votes":0,"body":"wHaT if sOmeONe wAnt To SWAP HIS FUCKING ROLE? M? After getting autofilled for example?","replies":[{"poster":"TheMinionLeader","date":"2018-06-18T16:54:23.146+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=remakoro,realm=EUNE,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=0009,timestamp=2018-06-18T16:51:38.021+0000)\n>\n> wHaT if sOmeONe wAnt To SWAP HIS FUCKING ROLE? M? After getting autofilled for example?\n\nYe this is why this will never be enforced.","replies":[{"poster":"Ripikou","date":"2018-06-19T05:44:36.821+0000","up_votes":2,"down_votes":0,"body":"It just selects it, it doesn't force you to keep it. How is that hard to comprehend?","replies":[]},{"poster":"J Epstein","date":"2018-06-20T00:54:40.766+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheMinionLeader,realm=NA,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=00090000,timestamp=2018-06-18T16:54:23.146+0000)\n>\n> Ye this is why this will never be enforced.\n\nIf you're gonna swap then you are more aware you need to change summoner spells and runes than somebody who doesn't swap.","replies":[]}]}]},{"poster":"Mreeshai","date":"2018-06-19T05:38:23.981+0000","up_votes":2,"down_votes":0,"body":"Alternatively, you could have it remember your last used spell combo for that position and use that as a default when you are selected for the same role in draft/ranked. I think it already does this when you change maps, at least. In ARAM I have different summoner spell combo remembered than in SR.\n\nThis is how it would work:\n-If you play Jungle role in Draft, your would get same summoners that you had the last time you played Jungle role. If you play Support role in Draft, your defaults would be the same summoners from the last time you played Support and so on. Very simple mechanic, people would get used to that and it is less controversial than forcibly changing one of your summoner's.","replies":[{"poster":"J Epstein","date":"2018-06-20T00:58:26.028+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mreeshai,realm=EUW,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=000e,timestamp=2018-06-19T05:38:23.981+0000)\n>\n> Alternatively, you could have it remember your last used spell combo for that position and use that as a default when you are selected for the same role in draft/ranked. I think it already does this when you change maps, at least. In ARAM I have different summoner spell combo remembered than in SR.\n> \n> This is how it would work:\n> -If you play Jungle role in Draft, your would get same summoners that you had the last time you played Jungle role. If you play Support role in Draft, your defaults would be the same summoners from the last time you played Support and so on. Very simple mechanic, people would get used to that and it is less controversial than forcibly changing one of your summoner&#x27;s.\n\nThis would work too.  Just seems like coding is hard for RIOT, may be too hard to implement.","replies":[]}]},{"poster":"Recon1212","date":"2018-06-18T16:05:57.268+0000","up_votes":2,"down_votes":0,"body":"I think what would be the right thing to do in this scenario is if someone is in the JG role and they don't have smite selected at say 30 secs and 15 secs it will notify the player very noticeably and say \"Hey buddy you need smite.\"\n\nAnother thing that they could do, is if someone who in in the JG role loads into game without smite, as long as they are in the fountain they can switch to only smite, one time and only switch back as long as they are in fountain. But the second they leave can't change. This would allow them to obviously get smite but wouldn't make it so they can abuse anything, they either need it and take it, or they don't and they leave it.","replies":[]},{"poster":"Arcane Blue Boi","date":"2018-06-18T13:06:30.637+0000","up_votes":3,"down_votes":1,"body":"When you have smite, jungle items should AUTOMATICALLY be your starting items\nthere are too many jungle champions viable in the jungle to which riot recomends laning items when you are queued jungle and have smite.","replies":[]},{"poster":"Duke Dryfocker","date":"2018-06-18T17:51:28.954+0000","up_votes":1,"down_votes":1,"body":"Does anyone JG anymore?\nI think two top is actually better.  I tried JG recently and it was so frustrating I almost quit the game.","replies":[{"poster":"Mreeshai","date":"2018-06-19T05:53:39.519+0000","up_votes":1,"down_votes":1,"body":"Do you tend to see Junglers in your games these days or are people going double top or double mid instead? Jungle camps are worth xp. It is a good idea for someone to gather that XP for the team.","replies":[{"poster":"J Epstein","date":"2018-06-20T00:57:19.078+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mreeshai,realm=EUW,application-id=3ErqAdtq,discussion-id=igrKsOcz,comment-id=000c0000,timestamp=2018-06-19T05:53:39.519+0000)\n>\n> Do you tend to see Junglers in your games these days or are people going double top or double mid instead? Jungle camps are worth xp. It is a good idea for someone to gather that XP for the team.\n\nI see enough of smiteless jungles to warrant me to ask for autoselecting a smite summoner spell.","replies":[]}]}]},{"poster":"Purplesamosa","date":"2018-06-19T08:29:57.658+0000","up_votes":1,"down_votes":0,"body":"No offence to all design suggestions but they do show what you what, but take in mind that we do have unsealed spellbook.\n\nWhat that tells us is that riot has the ability to swap summoner spells within game.\n\nMy suggestion is to have a store purchase that is limited to before 3:00 (remake time) to swap out any summomer spell that has not been used.\n\nUpon attempting a purchase a UI button of the summoner spell chosen appears above your viable to swap summoner spells (much like Kai'sa evolve), when leaving the fountain this UI disappears in the case of a misclick purchase (the same way you're unable to undo when leaving the fountain).","replies":[]},{"poster":"Mokuto Bunshi","date":"2018-06-18T16:36:39.984+0000","up_votes":1,"down_votes":0,"body":"I support this idea 100%","replies":[]},{"poster":"dnsup","date":"2018-06-19T07:22:46.391+0000","up_votes":1,"down_votes":1,"body":"Or, how about this? Instead of a minutes-long (and nearly useless) loading screen, allow selection of summoner spells and runes (which have always and still frequently glitch--as in, malfunction completely, rather than revert to a previous state--if you haven't finished editing them before the loading screen pops).\n\nYou might object: _\"But what about the loading screen? The loading screen [of almost random duration, depending on network] gives players time to <x>, <y>, and <z>. If you don't see the enemy team's summoner spells &c., how will anyone <1>, <2>, or <3>?\"_\n\nThe loading screen frequently lasts as long as champion select, and it's not as if all information has to be displayed at the same time. And considering that the pre-game _champion and role negotiation_ is definitively concluded when the loading screen pops up (champions all locked, etc.), there is plenty of time for these two things:\n\n- A limited re-selection of summoner spells (and maybe confirming runes) within a given time period\n\n- Revealing the teams' summoner spells/capstone selections to one another in time to allow <1>, <2>, <3>, and then some.\n\n---\n\nOn paper, there are so many reasonable ways to smooth this rough edge in the software that I refuse to believe that none are practical. (Naturally, I have no way of knowing for certain; faith is my only option, absent privileged information).","replies":[]},{"poster":"Nøctμrne","date":"2018-06-18T17:41:28.994+0000","up_votes":1,"down_votes":1,"body":"The reason it doesn't exist is because of players who switch positions in champion select.\n\n Forcefully to giving a player a summoner spell is just another way Riot would be simplifying the game. The game doesn't start when the timer does, it starts in champion select,  and neglecting to do certain things is the fault of the player. \n\nThe only way this would work would be if there was an option to actually trade roles in champion select. (Like how we trade champions).","replies":[]},{"poster":"Onkel Malte","date":"2018-06-18T13:27:08.022+0000","up_votes":1,"down_votes":1,"body":"It think shouldn't auto-switch upon starting the game. I think it should rather auto-switch your non-flash summoner upon being placed in the Lobby. You could change it back anytime, but that would help a lot against unwanted mistakes.","replies":[]}]}