{"poster":"Smoothys","date":"2017-09-21T23:50:43.386+0000","title":"How to Fast Level my Account to 30?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello guys and gals,\r\n\r\nI would like to ask If someone would be kind enough to share some tips/tricks regarding how to level up my account to level 30 in the most fast and efficient way? \r\n\r\nThanks! {{champion:51}}","replies":[{"poster":"TechSupp0rt","date":"2017-09-22T03:58:14.312+0000","up_votes":1,"down_votes":0,"body":"O hello there.\n\nThe fastest way would be to..\n\n- Play co-op vs AI in the twisted treeline.\n- Take a friend with you, and you both pick ad carry with smite and teleport.\n- Force your way through the bottom lane of the map.\n- Finish right after 5 minutes has passed.\n- Repeat.\n\nAnd if you really wanted to, you can make it even faster with EXP boost.\n\nThis method, as boring as it is, is the fastest way to level up.\nAnd it actually requires you to be quite familiar with the game. If you take 10 minutes to destroy the nexus, I fear this is not for you.\nIf that is the case? Clearly it would do you better to actually play the game, not cheese through the levels.\n\nTechSupp0rt","replies":[{"poster":"Smoothys","date":"2017-09-23T16:04:27.841+0000","up_votes":1,"down_votes":0,"body":"actually this is my second account my other one got shut down :/  i just havent leveled an account for over 4 years ...so i am rusty ..and its quite boring to be honest cause I play with easy players ...used to be gold :P","replies":[]}]},{"poster":"Broporo","date":"2017-09-22T01:30:06.839+0000","up_votes":1,"down_votes":0,"body":"You might have a good time playing some co-op vs ai at first, and then maybe work your way into Twisted Treeline (3v3) which might be a little easier to get the hang of the full MOBA experience. SUmmoner's Rift (5v5) tends to be a little more complicated, but you'll get it in no time! \n\nI'd also suggest hitting up the Player Recruitment board to see if you can find some people who would be willing to help you while playing games alongside you ^_^!","replies":[{"poster":"Smoothys","date":"2017-09-22T01:38:39.282+0000","up_votes":1,"down_votes":0,"body":"Thank you appreciate it !! Sorry if i posted in the wrong board but i think there was a bug when I was trying to ''choose a board'' thanks again for the info!","replies":[]}]},{"poster":"HeyItzSteve","date":"2017-09-22T01:05:40.462+0000","up_votes":1,"down_votes":0,"body":"The fastest, most efficient way to level your account to 30 is to get an XP Boost and farm Normal Games.","replies":[{"poster":"Smoothys","date":"2017-09-22T01:23:10.624+0000","up_votes":1,"down_votes":0,"body":"Thanks for the info appreciate it! for now i can only play cop vs AI games","replies":[]}]}]}