{"poster":"3agle","date":"2015-03-18T00:39:21.796+0000","title":"Alguien piensa que Bardo es una version inferior de Nami","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Aunque Bardo tiene un kit muy interesante, con un amigo nos pusimos a analizar su kit de habilidades, y nos dimos cuenta que cumple la misma funcion que Nami, es un Champ que en Fase de linea se dedicara a pockear, y que luego en TF gracias a su ulti este servira como Engage o Disangage, pero nos pusimos a ver los pros y los contras aqui algunos que deducimos:\n\n{{champion:432}} :\n\n+Tiene buen escape\n+Buen sustain\n+Mucho pokeo con sus mep (creo que asi se llaman)\n+Buen Engage y Disangage\n-Muy debil\n-Kit de habilidades muy dificil de usar correctamente\n-Como Tank, Tankea muy poco y apenas tiene daño\n-Como Mago, no tiene el daño de una Nami, Zyra o Sona\n\n\n{{champion:267}} \n\n+Buen sustain\n+Mucho CC\n+Bonus de daño magico\n+Mucho pokeo\n+Buen Engange y Disangage\n+Bonus velocidad de movimiento\n-No tiene formas de escape muy eficientes, si ya uso su R\n-Como Tank, pierde mucho pokeo y sustain\n-Como mago si te pillan mal te revientan\n\nAl final llegamos a esta conclusion, aunque Bardo es un campeon relativamente nuevo, y que aun falta mucho por aprender, le falta un pequeño Buff, ya que su Q solo da un stun si choca contra otro campeon o muro, pero uno dira la Q debera pegar un monton y la respuesta es no pega muy poco y tiene un escalado de 0.5 de tu ap. en cambio muchos otros campeones tienen una Q mas facil de atinar y con mejores beneficios que la de Bardo ya veas, Blitz, Thresh, Morgana, Nami, asi que encuentro que a Bardo le deberian dar un pequeño buff o si no quedara muy olvidado, ya que un Supp agresivo como Thresh, Blitz, Leona, le haran pasar un muy mal rato.","replies":[{"poster":"ragunaover","date":"2015-03-18T00:53:24.113+0000","up_votes":4,"down_votes":0,"body":"Con un equipo cordinado yo creo que Bardo revienta como cualquier support de utilidad,ademas no olvidemos el porque hizo rito este champ\n\nPara que los koreanos hagan top plays y los bronces trolleen :3","replies":[{"poster":"3agle","date":"2015-03-18T01:00:47.879+0000","up_votes":1,"down_votes":0,"body":"Pero piensalo de esta forma, Bardo tiene una Fase de linea muy flojas, si este no obtiene las campanitas, y va llenando su pasiva, en cambio Nami tiene una muy buena fase de linea, aunque Bardo tenga una excelente fase de TF, Nami tambien tiene una buena TF, el mayor problema de Bardo es si usas mal su R dejas vendido a todo tu equipo, en cambio con Nami es muy dificil fallar tu ulti haciendo que tu Team quede vendido, en lo que es mecanicas y aspecto Bardo me gusto mucho pero necesito un pequeño buff para ayudarle a definir si es un Mago o un Tank","replies":[{"poster":"ragunaover","date":"2015-03-18T01:08:34.645+0000","up_votes":1,"down_votes":0,"body":"Concuerdo lamentablemente :c  No le e visto en ningun juego competitivo pero es cierto que en cuanto a competencia de supp Nami es la papi y señor a parte de que Bardo consiste en gankear otras lineas y sustanear a su adc cada vez que vuelve de compra pero deja mal vendido a su adc a comerse cualquier gank ope koreano :v gg Bardo te la re bardearon los korecos.","replies":[]}]}]},{"poster":"Robinification","date":"2015-03-18T01:54:52.596+0000","up_votes":2,"down_votes":0,"body":"soy paltino main supp y creo q bardo es superior a nami en todo menos en cc","replies":[]},{"poster":"Nehalem","date":"2015-03-18T01:37:11.236+0000","up_votes":2,"down_votes":0,"body":"bardo tambien tiene sustain en linea junto a su adc , y no tiene tantos problemas de mana en early gracias a sus meeps. nami tiene muy graves problemas con el mana al principio hasta que compras el caliz","replies":[]},{"poster":"Princess Mipha","date":"2015-03-18T01:19:53.486+0000","up_votes":2,"down_votes":0,"body":"\"Supports agresivos como thresh, blitz, leona te hacen pasar un mal rato\"...\nCada vez que leo esto me muero de risa xD. Soy jugadora sup full utilidad y la verdad este tipo de champs nunca me han dado problemas. Jugando bien los puedes cagar (y dejar mal de paso, porque para campeones con tanto aguante como ellos es ridículo que un sup de utilidad te parta la cara xD). Todo esta en cómo usar los champs. Por lo que vi a bardo le viene un pequeño buff de daño en el pbe, así que a esperar.\n\nSaludos","replies":[]},{"poster":"Promy","date":"2015-03-18T01:03:11.209+0000","up_votes":2,"down_votes":0,"body":"Yo creo que Bardo esta más orientado al juego en equipo, los ganks que puede hacer Bardo junto con el jungler en la mid lane son sorprendentes. En lane lo único que tiene que hacer es dejar los heals y pockear, y de la nada desaparecer, el equipo enemigo pensara que estás recogiendo las campanas, pero en realidad estas haciendo un doble gankeo en mid.","replies":[]},{"poster":"Norman Bates","date":"2015-03-18T05:09:06.578+0000","up_votes":1,"down_votes":0,"body":"Siempre jugue contra un Bardo, y siempre le gane... con cualquier champ... cualquieeeeer champ ({{champion:6}} )","replies":[]},{"poster":"gupi","date":"2015-03-18T04:56:59.658+0000","up_votes":1,"down_votes":0,"body":"Primero y principal Bard es un champion bastante difícil de usar. No me refiero solo a su kit, sino a su necesidad de hacer roaming constante para poder maximizar su potencial. El adc tiene que saber pararse muy bien para poder sacar todo el provecho de Bard, además de saber cuando pushear y cuando freezear la línea.\nParticularmente a mi me encanta su kit y su capacidad para crear plays (o arruinarlas del todo). Pero tiene unos stats bastante pobres comparandolo con otros, ya que si lo haces tanque, no tanquea en realidad; y si lo haces AP poke al estilo Sona por ejemplo, se queda corto en daño en relación a otros supports del estilo. Creo que es un pick muy situacional y el factor riesgo/ganancia es altísimo en este supp, ya que las cosas pueden salir bien, o pueden salir extremadamente mal y tirar una partida al tacho.","replies":[]}]}