{"poster":"3agle","date":"2017-03-31T14:42:11.729+0000","title":"Es solo mi idea o ...?","subforum":"Comportamiento del jugador","up_votes":17,"down_votes":3,"body":"Hola, solo queria crear una discusion para ver si es solo mi idea o pasa en general, que el juego en lo que va de Season esta injugablemente las Ranked, no lo digo por los troll ni los afk, lo digo de por si por una &quot;Gran Parte de la Comunidad&quot;, que entran a la partida con no se como decirlo ... un Ego gigante y simplemente no le hacen caso a la gente y prefieren dedicarse a molestar a sus compa&ntilde;eros que intentar ganar el game?.\r\n\r\nLa verdad esto me viene pasando en todas las ranked que juego, siempre hay alguien en mi equipo o el equipo rival que esta tilteando o simplemente siendo un fastidio para su equipo, y esto aunque antes ya se veia extra&ntilde;amente ahora es para mi caso pan de cada d&iacute;a, la verdad ya casi no juego a menos que sea con amigos o me entren ganas de jugar y que un juego tan bueno como este se vea tan opacada por una Comunidad tan mala y aunque me gustaria que esto fuera solo la comunidad, no puedo decir que es solo la comunidad, Gran Parte tiene la culpa la empresa riot o los rioter que se encargan de castigar a los malos usuarios y porque digo esto es muy sencillo, esto se ve reflejado en sus castigos, para mi gusto sus castigos son muy leves, pero la verdad no quiero meterme en ese asunto.\r\n\r\nBueno solo queria desahogarme un poco, ya que ni si quiera tengo ganas de jugar y entrar solo para salir mal, se que esto jamas se solucionara ya que riot es una empresa con fines de lucro y claramente prefiere la Cantidad ($) a la calidad de juego.\r\n\r\nUn saludo y suerte en la grieta invocador {{champion:122}}","replies":[{"poster":"Trying Improve","date":"2017-03-31T16:07:30.369+0000","up_votes":8,"down_votes":2,"body":"Parte de la comunidad aún no se da cuenta que somos el peor servidor del mundo XD\nEn vez de jugar con ganas de aprender y a la vez divertirte hacen todo lo contrario, veo muy a menudo gente que no tiene idea como funciona el juego y si les das un \"consejo\" te flamean buscando cualquier motivo.","replies":[{"poster":"Deadpooldesune","date":"2017-03-31T19:54:18.488+0000","up_votes":2,"down_votes":2,"body":"No tienes idea de como es jugar en corea xDDDD","replies":[{"poster":"Trying Improve","date":"2017-04-01T13:00:15.453+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Deadpooldesune,realm=LAS,application-id=PJAKt7ph,discussion-id=6yKeyAIy,comment-id=00080001,timestamp=2017-03-31T19:54:18.488+0000)\n>\n> No tienes idea de como es jugar en corea xDDDD\n\n¿Y tú sí? Sin contar verlo por stream\nAl menos yo he jugado en 5 servidores distintos y conozco las diferencias de cada uno.","replies":[]}]},{"poster":"FedecarboneroUY","date":"2017-03-31T23:13:40.706+0000","up_votes":1,"down_votes":1,"body":"Es que es el peor servidor y acá igual son todos challengers XD","replies":[]},{"poster":"La corrupción","date":"2017-03-31T19:39:28.122+0000","up_votes":2,"down_votes":2,"body":"Bien, digame señor burns en cuantos servidores ha jugado\n\nhttps://i.ytimg.com/vi/FjhBb2o4K5M/hqdefault.jpg","replies":[]}]},{"poster":"James Northrend","date":"2017-03-31T17:24:32.179+0000","up_votes":4,"down_votes":0,"body":"riot no pretende banear a los jugadores trolls, imagina que ellos piensan asi: 100 ratas en mira para ser baneados \"para... esas 100 ratas compran rp todos los meses, pero los buenos jugadores no cargan tanto mmmm dejenlos en cola de baja prioridad y adornemos los parches para que se vea que hacemos algo con esa gente\" a riot de echo le interesa que esas ratas jueguen ya que mas cuentas asi les da mas utilidad que una persona que lleva años jugando y que con el tiempo va jugando menos ... yo en particular juego las 10 unrankeds y listo quedo en la liga que quedo y lo poco que estoy jugando es aram y buscar la victoria diaria, los jugadores de latam son lo peor a nivel de comunidad, es triste ver que lo peor de el server es mi propia comunidad, los rioters no pueden hacer mucho y que hablar de riot, desde que sacaron el tribunal de justicia ya pintaba mal el tema de la comunidad y bueno estamos asi. ME GUSTA EL JUEGO PERO NO LA GENTE QUE LO JUEGA.","replies":[{"poster":"PulsarShockWave","date":"2017-04-01T05:15:37.356+0000","up_votes":1,"down_votes":0,"body":"Hace unos minutos termine de responder a un msj en mi post planteando la misma situación. \n\nA RIOT le chupa 3 huevos y medio la gente dedicada al juego, que trata de mejorar y que trata de no hacer bardo para pasarla bien, a RIOT le importa  el dinero (platita, guita, pasta, viyuya, los verdes, el roca, caching, etc) y los que aportan dinero son los Wallet \"Warrios\" (que de warriors no tienen nada, solo son ratas del maincra con plata) que vienen compran RP y porque compraron RP y skin se piensan que la tienen re clara.\n\nPero si vos hablas de eso y de la eliminación de las colas ~~Normal Reclutami~~CENSORED Parece que les estuvieras robando literalmente.\n\n\"Sr RITO, que piensa hacer con los Trolls y los AFK que se están presentando elevandamente en Ranked?\"\n-Estamos trabajando en un nuevo sistema de estratificación cuántica que va a remodularizar la categoría de los haptiones de generación de MMR para provocar una ruptura espacio-temporal la cual va a mejorar el matcmaking 0.000023 %.\n\"Pero eso no responde la pregunta\"\n-Ahhh, no? ahhhhh los trolls y los afk! ahhh emmmmmmm, eeeeeeeeemmmmmm -Cola de baja prioridad y listo, son los que ponen la guita vaaamos no jodas\n\n\"Sr RITO, porque si una cuenta recibe varios reports no pasa nada pero una cuenta recibe dos y ya tiene ban de chat?\n-El nuevo sistema de selección de campeones\n\"Otra vez no esta respondiendo la pregunta.... -_- \"\n-Siguiente pregunta\n\n\"Sr RITO, según usted la Cola de Reclutamiento Normal no era saludable... porque no se quitó la Cola Blind Pick y se dejo solo la Cola Draft pick que es mas moderna, mejor optimizada y cumple con las expectativas del juego?\"\n-Teníamos que hacer cambios, hay veces que son buenos otras malos, no podemos contentar a toda la comunidad pero bueno es asi, si no es de tu agrado, seguramente encontraras otro juego que lo sea y migraras a ese lugar (textual lo que me respondieron)\n\"Osea que evidentemente no les importa perder jugadores que los bancaron desde la S1 para atraer jugadores que juegan un tiempo compran RP y luego dejan de jugar?\"\n-Todos tienen las mismas oportunidades, lo sentimos que los cambios hayas hecho que disfrutes menos del juego, pero teníamos que tomar una decisión y eso hicimos, para algunos fue buena para otros no tanto.\n\nAsí que si. Cuando pregunte eso fue lo que me respondieron. Les chupa un huevo vos, yo y todos los demás que queremos tener una linda experienca de juego, mientras metas plata en tu cuenta todo va a estar bien, ahora si jugás por jugar... vales menos que un troll afk feeder bronce 1.","replies":[]}]},{"poster":"Ode to dark","date":"2017-03-31T15:14:08.223+0000","up_votes":4,"down_votes":0,"body":"Uhm... En mi caso no, buen ambiente y eso. Casi siempre es uno solo que es tóxico así que se le mutea y listo.","replies":[]},{"poster":"GameMode","date":"2017-03-31T14:59:56.529+0000","up_votes":4,"down_votes":1,"body":"\"De lo que va esta season\" y es la primer season que jugas. Lolazo del grande.","replies":[]},{"poster":"LemønPykë","date":"2017-03-31T17:07:41.099+0000","up_votes":2,"down_votes":0,"body":"desde bronce a diamante,\nhay flamers tilteantes,\nsi tu quieres ser maestro,\nmejor mutea bien al resto.\nokno :P","replies":[{"poster":"PROPHENCY","date":"2017-03-31T22:42:42.167+0000","up_votes":1,"down_votes":0,"body":"Jajajjaa","replies":[]}]},{"poster":"Steffler","date":"2017-03-31T15:26:26.954+0000","up_votes":2,"down_votes":0,"body":"Que haces man, yo venia jugando bien y tranqui estos ultimos dias con suerte de ningun trollor o salame pero hoy me toco uno que me triggerio de una manera impresionante, por mi parte nunca me enojo pero como me trato el flaco me hizo enojar muy mucho y me saco las ganas de jugar directamente despues de lo que me puso que fue lo siguiente junto con lo que le decia: \n\" me:- Man yo anuncie mi champ y me lo sacaste.-\nel vago: que lastima yo nunca me fijo que anuncian los de abajo.- *yo estaba de supp en la parte de abajo de la lista anunciando mi champ desde el inicio*\nel vago: ademas ese champ no es de supp asi que callate y juga.-\n\nA todo esto el champ que yo habia anuncia era Galio{{champion:3}}  y el loquito lo lockeo sin avisar ni decir nada, encima regalo top como el mejor y yo quede atonitod e la triggeriada que me pegue por sus comentarios que no podia jugar mas y bueno evidentemente se perdio la partida.","replies":[]},{"poster":"Excidiar","date":"2017-03-31T15:08:52.543+0000","up_votes":2,"down_votes":0,"body":"La verdad, me pasó en todas las rankeds que jugué (3 flex, 3 soloq) que me quitó las ganas de jugar ranked, siempre un feeder (intencional) Troll o flamer en mi equipo. Tanto que decidí pasar olímpicamente de rankear esta season.  ¿La solución? Generalmente las normales tienen mejor onda, casi nadie viene tenso y casi todos juegan para divertirse, ojo, no digo que no te vaya a tocar un troll. (Como esa karma que dijo \"si usas ese campeón , trolleo\" Y terminó 1/13/1 aunque podíamos ganarla, murió a propósito unas 10 veces, 3 o 4 por ejecución y el resto feedeando.) Pero por lo general las partidas son bastante más sanas en normal que en ranked. O de última vas a bots intermedios a dar clases de lol a los newbies sin flamearlos. (Porque flamear en una partida contra bots es el colmo del flameo).\n\n;)","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-03-31T14:57:50.964+0000","up_votes":3,"down_votes":1,"body":"Para mi las Solo Q están imposibles :p\n\nNo soy un jugador carreador, por lo que no voy a subir de liga jugando únicamente por mi mismo, planeo esperar el cambio a tankes, por si dejo de jugar soporte  y me concentro en Jg, a ver si me favorece el meta, por ahora seguiré en normales o quizás flex, que hay mejor ambiente.","replies":[]},{"poster":"Nuke","date":"2017-03-31T16:27:29.184+0000","up_votes":2,"down_votes":2,"body":"> ya que riot es una empresa con fines de lucro y claramente prefiere la Cantidad ($) a la calidad de juego.\n\n¿Eso que tiene que ver? No es culpa de Riot que los jugadores tengan mal comportamiento.","replies":[{"poster":"ablis","date":"2017-04-01T15:54:57.039+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XNuke69,realm=LAS,application-id=PJAKt7ph,discussion-id=6yKeyAIy,comment-id=0009,timestamp=2017-03-31T16:27:29.184+0000)\n>\n> ¿Eso que tiene que ver? No es culpa de Riot que los jugadores tengan mal comportamiento.\n\nSi tiene que ver, porque las reglas del juego la colocan ellos. Si ellos quisieran que sea un campo de batalla por el chat no habrían sanciones ni reports ni nada de eso. Pero, por el contrario, ellos quieren un juego sin  este tipo de conductas, colocan un sistema de reportes y sanciones, pero... no funciona.  Resultado, no hay penas reales/sanciones suficientes para los culpables de hacer el ambiente malo,  y se mantienen y proliferan. \n\nEl mal comportamiento siempre existirá pero que crezca y prolifere es responsabilidad del dueño del juego. Tienen que invertir más en un buen sistema de reportes y sanciones. Tienen dinero para eso.","replies":[]},{"poster":"3agle","date":"2017-03-31T20:07:20.124+0000","up_votes":1,"down_votes":0,"body":"Te doy el caso, imagina que Riot es nuestra **Madre** Y la ~~Horrenda~~ Comunidad es su **Hijo**, si tu dejas que tu hijo haga lo que quiera y no le das un control, este se sale de control, pasa exactamente lo mismo en el juego, si no aplicas castigos severos o a tomar en cuenta, la comunidad no cambiara nunca y vera los castigos como un chiste, pero en parte esto pasa porque Riot lo que quiere es nuestro ~~Dinero~~ ganas de jugar y no la calidad y ambiente que este haya dentro, y esto no solo pasa en Las, pasa en todos los servidores.","replies":[]}]},{"poster":"El Nabu","date":"2017-04-01T07:20:16.898+0000","up_votes":1,"down_votes":0,"body":"El problema es la toxicidad, está muy lleno de flameos. Ni siquiera es el tipico \"y para que te tiraste solo\" o \"cagaste la tf inciando mal/cuando somos menos o falta el adc\" que sería como una especie de limite, quizás con mas menos insultos, podes tomarlo a bien o mal pero de todos modos estaría marcando un error que alguien cometió y arruinó una jugada. La cosa ya va más de *lo matan porque un lee sin hizo un buen gank y el otro laner lo baiteo a tradear* \"manco de mierda, como no te dan las manos, deja de morir pelotudo/wn/bo/*insulto en guarani* (eso si que es algo que nunca vi)\" o van perdiendo y salta el jg \"que malo eres *inserte campeon*, ni con campeo te feedeas\" o lisa y llanamente \"report a tal, es muy malo, nos trolea la partida\" por tener una partida aunque sea un poco mala y morir dos veces seguidas. No hay tantos trolls como dicen que hay, lo que si hay mucho es gente que tiene una mala partida o solo con un mal early game y tilteo ya basta como para que no quieran jugar más y no tryardeen la partida o jueguen seguro, sumado al flameo de algun compañero que va al insulto directo y personal más allá de la frustración de que cometa muchos errores juntos. De todas las partidas en este año no recuerdo que me haya tocado un troll adrede, ni siquiera uno que haya sido la oveja negra, o sea, que sea el del equipo que se nota claramente que juega mal (porque era un troll y no lo hizo obvio o por eloobost), pero si incontables flamers que ponian su atencion en el chat y a veces hasta se quedaban en base solo para decir lo malo que es su equipo.\n\nY en cuanto a los afks, creo que son muchos más las personas que se les cae la conexión o salta bugsplat que los que realmente se van afk, se nota mucho cuando uno se va afk a propósito y muchos de las veces la partida ya estaba perdida porque la moral del equipo estaba bajisima y estaban con mucha desventaja.","replies":[{"poster":"El Nabu","date":"2017-04-01T07:24:04.812+0000","up_votes":1,"down_votes":0,"body":"También lo de darse por vencido, que parece que es reportable porque lo dice en la descripcion del report por actitud negativa, es algo que usan mucho en corea cuando pierden el early game, de ahi viene el famoso open mid y los 5 se quedan en base en lugar de esperar al min 20. Aunque tiltearse no se si sea motivo de report, porque no es algo que la persona decida porque si, pero si quizas pueda tomarselo de otra forma.","replies":[]}]},{"poster":"Milanga De Soja","date":"2017-03-31T17:04:30.652+0000","up_votes":1,"down_votes":0,"body":"Cuando entro a la sala y digo algo nadie me contesta , solo los veo hablando entre si , 2 estan callados y los otros 2 hablando entre si (\"xDDDDDDDDDD\"\"no tengo maestrias :v\"\"voy teemo jg :v\"\":VVVVVVVVVV\"\"xDDDDDD\")\ncuando empieza la partida , mueren los dos que se quedan callados y los otros tambien , y bueno , empiezan morir morir morir y morir\ncuando vamos 2 a 43 y estan tirando el nexo el chat esta asi: \":VVVV\"\"gg izii\"XDDDDDDD\"\":v\"\":VVV\"\nY bueno , eso son las normales , las rankeds son irrenarrables","replies":[]},{"poster":"Kyousuke","date":"2017-03-31T15:27:11.472+0000","up_votes":1,"down_votes":0,"body":"pues esto es como todo, puede tocarte buena gente o mala sin importar si jugas ranked o normales, es hasta que se te acomode el elo y ya, yo ahora juego flex para practicar top y mid y aveces me tocan flammers y otras gente que juega bien y si ve a algún flammer lo calma y siguen jugando, hace unos días jugué una con {{champion:105}}  top contra un {{champion:157}} y por confiarme perdí la linea el jungla empezó a molestarme así que lo silencie pero siguio hablando ya que el mid y adc estaban diciéndole que se calme que solo tuvo una mala partida, cualquiera puede pasarle pero esta jugando y tratando de ganar y gracias a eso y que metí varios tiburones hermosos ganamos.\njugar online siempre es igual puede tocarte buenos o malos es cosa de jugar y no preocuparse por eso, si sabes jugar vas a subir tarde o temprano.\n\nayer jugué una en mid también con {{champion:105}} y le dije al olaf gankea antes del 6 a {{champion:38}}  y esto se gana fácil, el tipo super copado viene gankea 2 veces y ya fue free win, no se enojo por que le pedí el gank ni nada, solo vino gankeo y entre el team empezamos a hablar y reír de algunas cosas y ganamos divirtiéndonos.\nno tengas miedo de la gente juga para divertirte y ya, sino juga en premade para subir como muchos lo están haciendo ahora","replies":[]},{"poster":"Mascheranox","date":"2017-03-31T15:26:14.296+0000","up_votes":1,"down_votes":0,"body":"lo que note tambien es que tarda mas para buscar partida\nme pongo la opción supp y aletoria\ntarda como 5 minutos,antes a los 30 segundos ya encontraba","replies":[]},{"poster":"Gretta Thunberg","date":"2017-03-31T14:57:38.362+0000","up_votes":1,"down_votes":0,"body":"La verdad es que si, entran a rankeds creyendose faker y uno les da un consejo y piensan que los flamea eso es terrible por que uno no lo hace con alguna mala o segunda intencion, pero nooo ellos son faker entonces no necesitan consejos, al decirles eso les ofende y trolean o se tiltean.","replies":[]},{"poster":"Rohaerlynn","date":"2017-03-31T19:08:52.665+0000","up_votes":1,"down_votes":1,"body":"Solo idea tuya.","replies":[]}]}