{"poster":"l BlackWidow","date":"2016-01-09T08:22:56.055+0000","title":"Recomiendan jugar fines de semana?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"No es que juegue como los dioses, es m&aacute;s , es lo m&aacute;s parecido a un cry post que van a encontrar : Pero no se si a m&aacute;s de uno le pasa que juega los fines de semana y se encuentra con las personas mas horrendas en platino 1 diamante 5 jugando que no tienen idea de como jugar. Que siendo adc tiran q w e y vuelven a la torre como si fueran un xerath.\r\n\r\nAl que vaya a ver mi historial y diga ,pero saliste 6-8-5 que se guarde el comentario, cada partida es &uacute;nica y el que en una partida sali&oacute; 2-1-1 y perdi&oacute; es porque juega por kda , no para ganar.\r\n\r\nAver sus opiniones sobre jugar los fines de semana.","replies":[{"poster":"SrIkarus","date":"2016-01-09T17:22:51.367+0000","up_votes":1,"down_votes":0,"body":"Cuando mas podes jugar menos podes hacerlo.Quee peguntaras .?? Estas en vacaciones podes jugar mas pero debido a gente inmadura nenes de entre 9 añitos y 17 añitos juegan lol , sin tener minimo de tutoriales, o partidas normales, juegan hasta ranked sin importarles nada solo jugar por que si quiero pi , si gano o pierdo es igual.Da los mismo.Los reportes y sanciones no llegan  y si llegan nadie se entera.Deberian hacer una aclaracion de sanciones, y post de las mimas en en el foro, para los que jugamos enserio y sanamente , saber cuando nos toquen ese tipo de personas in game.Gracias {{champion:74}} {{item:2050}}","replies":[]},{"poster":"Score","date":"2016-01-09T11:17:14.508+0000","up_votes":1,"down_votes":0,"body":"Es Vacaciones estan ellos 24x7","replies":[]},{"poster":"iCharZ","date":"2016-01-09T09:24:50.939+0000","up_votes":1,"down_votes":0,"body":"No... te recomiendo jugar los dias de la semana a la noche/madrugada pero es imposible, siempre hay esta gente que caga partidas...","replies":[]},{"poster":"Absolüt","date":"2016-01-09T08:29:56.657+0000","up_votes":1,"down_votes":0,"body":"Y que se yo, estaba el mito de que los fines de semana estaba lleno de nenitos , cosa que antes era \"viable\" ya que ahora además de que estamos en vacaciones, el LoL se hizo muy popular tanto así que se llenó de jugadores , entre ellos una gran cantidad de niños/adolescentes con las hormonas a mil (no todos) y con los impulsos muy \"altos\" (Se ponen muy nerviosos fácil, se alteran, te insultan, étc xD). Por eso prefiero jugar de noche si es que puedo, porque de día está la típica de \"me mandaron a comprar\" \"mi mamá me apagó la PC por no querer hacer la tarea\" étc. Igual los fines de semana a la noche suele haber un problema, nunca falta el típico jugador a las 4:00 AM poniendo  \"uh estoy re loco\" \"uh perdonen pasa que estoy escabiando a full\" \"uhh trolleo porque estoy re loco re porreado\", ó a las 6:00AM \"recién llego del baileeeee, sale trollear en ranked\" (Sí, aunque no lo crean viví episodios así MUCHAS veces y no pasa solo en el LoL, en el Cs, en el WoW, en lo que sea siempre va a haber de esos xD).\nEn fin jugá el fin de semana pero a la nochecita, después de las 22:00 si podés y si perdiste 2 seguidas no jugués más.","replies":[{"poster":"l BlackWidow","date":"2016-01-09T09:07:36.884+0000","up_votes":1,"down_votes":0,"body":"Nose si me pasa ami en la cabeza nomas, pero para mi los fines de semana viene la gente que quedo en ese elo diamante 5 y se quedó ahi, y juega los fines de semana, perdió practica no esta a la meta y hace perder las rankeds.","replies":[]}]}]}