{"poster":"DeadUmbreon","date":"2017-09-12T16:29:48.069+0000","title":"Zu empfindlich? Oder etwa doch zu aggressiv?...","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":6,"body":"Ja... ich wei&szlig;... der Junge der sich bessern wollte, hat wieder geflamet (siehe unten).. was ich aber nicht akzeptieren kann ist, dass der report dennoch g&uuml;ltig ist...  ich hab nicht die person gemeint, sondern die Person angesprochen den Champ in unseren Tower zu bewegen um zu verrecken... nicht den direkten Tod gew&uuml;nscht.. is schon nh Unterschied, oder? ... noch dazu. wenn der Report allein noch wegen dem Gp g&uuml;ltig &quot;ist&quot;... ich habe nur zu ihm gesagt, er soll aufh&ouml;ren solo auf der Toplane zu pushen.. er war wirklich 15 Minuten sinnlos auf der Toplane ... er hat permanent dort reingepusht obwohl keiner der Gegner rechtzeitig jemals da war und nur einen einzigen Tower bekommen. Ich hab ihm nur gesagt er soll aufh&ouml;ren alleine zu spielen und endlich mit uns spielen, da wir durchgehend 4v5 gemacht haben und seine Ult uns einfach 0 geholfen hat. Daraufhin meint er mich und sein Team zu flamen. (man sieht ich flame ihn nicht?)  Ich hab ehrlich das Gef&uuml;hl, je &auml;lter ich werde, desto verweichlichter wird die Community uuund eventuell sogar das Tribunal (ist das das richtige Wort f&uuml;r die Regelmacher?)... als w&uuml;rden 8 J&auml;hrige das Spiel spielen...  ja das pussys h&auml;tte ich mir ersparen k&ouml;nnen, aber wenn man vom gegnerischen Jungler permagesittet wird und dann noch nh  Ranked spielt ist man leicht reizbar.\r\n\r\nNvm... w&uuml;rde mal dringend um erkl&auml;rung bitten... ich brauch nichtmal was schreiben und werde reportet, weil mein team der Meinung ist, dass ich feede obwohl ich mal nh schei&szlig; Tag hab oder so... was soll das bitte? ... ich bitte daher um hilfreiche Kommentare und nicht dieses &quot;viel spa&szlig; mit dem perma&quot; Gelaber, was ich bei dem vorletzten Post hatte... falls daran nichts ge&auml;ndert werden kann/wird, werde ich die Schei&szlig; strafe halt absetzen.. hab ich wenigstens Zeit die Sucht von LoL zu verringern xD\r\n\r\nGame 1\r\nDeadUmbreon: lmao\r\nDeadUmbreon: carryed by soraka and j4..\r\nDeadUmbreon: pussys xd\r\nDeadUmbreon: skilled champ\r\nDeadUmbreon: press r...\r\nDeadUmbreon: mf and syndra totally balanced... press r\r\nDeadUmbreon: kys noob champ :)\r\nDeadUmbreon: there are enough towers to do that\r\nDeadUmbreon: bruh i dont said to your person that you should kys\r\nDeadUmbreon: gp stop solo\r\nDeadUmbreon: we do 4v5\r\nDeadUmbreon: cause oyu do nothing\r\nDeadUmbreon: btw how you will report me if i said that YOUR champ should kys\r\nDeadUmbreon: just explain\r\nDeadUmbreon: then you cant report me lmao\r\nDeadUmbreon: said the one with only press r champ\r\nDeadUmbreon: btw we do 4v5 cause gp ignore his team\r\nDeadUmbreon: sexy mi\r\nDeadUmbreon: i didnt said it to her person\r\nDeadUmbreon: only to the champ","replies":[{"poster":"Humpelstilzche","date":"2017-09-12T16:41:22.772+0000","up_votes":4,"down_votes":0,"body":"> is schon nh Unterschied, oder?\n\nEin Unterschied den du klar machen musst. Klar, du hast dich dannach rausgeredet (ich vermute mal weil an dir gedroht hat dich zu reporten), aber du hast das Missverständnis ja quasi herausgefordert. Schreib doch so einen Scheiß einfach nicht. Sowas schreibt man doch als intelligenter Mensch nicht ohne zu wissen, wie das ankommt. \n\nMal abgesehen davon ist das ja nicht das einzige, was du gemacht hast. Zusätzlich hast du dich noch über andere Spieler lustig gemacht bzw warst ihnen gegenüber herablassen (erste zwei Zeilen) und hast sie beleidigt (dritte Zeile). \n\n> noch dazu. wenn der Report allein noch wegen dem Gp gültig \"ist\"... \n\nJeder Report ist gültig. \n\n> ich brauch nichtmal was schreiben und werde reportet\n\nErstens weißt du das nicht, zweitens ist es völlig irrelevant. Reports haben keinerlei Wirkung wenn du nicht auch tatsächlch was angestellt hast. \n\n> falls daran nichts geändert werden kann/wird, werde ich die Scheiß strafe halt absetzen\n\nJep, da kann nichts dran geändert werden. Wärst du unschuldig, wäre das was anderes, aber wie du ja bereits selber gemerkt hast, bist du das nicht, selbst ohne den \"kýs\" Kram.\n\nAber am Ende nochmal eine winzige Gardinenpredigt. Sind nur ein paar Worte, keine Sorge: Solltest du es nach offensichtlich mehreren Strafen nicht endlich mal besser wissen als dich so zu verhalten? Nerven die Strafen dich nicht?","replies":[{"poster":"DeadUmbreon","date":"2017-09-12T16:57:04.038+0000","up_votes":1,"down_votes":2,"body":"Naja wie gesagt, selbst wenn ich nichts schreibe, schreibt dann irgendeiner aus meinem Team \"report  (den Champ und den Champ, halt nur auf mich bezogen)...\" und dann nichtmal nh Grund dazu schreiben... man macht nichts falsches, wird trotzdem reportet... und nach deiner Meinung... soll ja jeder Report gelten... \n\nund klar gehts mir aufn Sack, aber es gibt ja nicht die Einstellung \"Chat sperren\" ... will ja eh nichts schreiben, wenn ich mit meinen Freunden spiele und da so nh Random dabei is. andere flamen noch mehr und haben ihren Account auch nur noch weil die einfach mal 2-3 Wochen nicht spielen. Ich erwähne das, weil ich da jemanden kenne, der dieser Beschreibung nämlich zutrifft. Werde aber auch keine Namen sagen, auch wenn ich die Person nicht mehr leiden kann.","replies":[{"poster":"Humpelstilzche","date":"2017-09-12T19:44:51.946+0000","up_votes":1,"down_votes":0,"body":"Jeder Report gilt, d.h. jeder wird überprüft. Hast du nichts gemacht, hat der Report keinerlei Wirkung.","replies":[]},{"poster":"zoriax","date":"2017-09-12T17:50:56.358+0000","up_votes":1,"down_votes":0,"body":"\"...und nach deiner Meinung... soll ja jeder Report gelten... \"\n\nDu verstehst das Report-Sytem nicht.\n\nReport ist wie eine Anzeige. So kann ich meinen Nachbarn auch Anzeigen weil ich vermute das er ein Topterrorist ist. \nDarauf hin wird die Polizei überprüfen ob er einer ist oder nicht. (Bzw dein Chat wird nach Schimpfwörtern durchsucht)\n\nBist du Unschuldig passiert dir NICHTS!!! \n\nIm übrigen gilt das auch für die Anzahl der Reports/Anzeigen. ob nun Einer, Neun oder eine ganze Nachtbarschaft.\nWo kein Täter ist gibt es keine Strafen.\n\nEdit: Deshalb sin Reportaufrufe auch Strafbar da sie nutzlos sind und oft nur als Beleidigung dient. ","replies":[]},{"poster":"Revilous","date":"2017-09-12T17:27:59.335+0000","up_votes":1,"down_votes":0,"body":"Sagen wirs mal so: Du hast bessere Chancen deinen Bann aufheben zu lassen, wenn nur sowas wie \"gl hf\", \"gj\", \"stay positive\" und \"ggwp\" in deinem Chatlog drin steht. Dann wirst du aber auch nicht gebannt, egal wieviele Leute dich reporten.\n\nDass andere mehr flamen kommt dir einerseits nur so vor und du kannst es nicht wissen aber andererseits ist es auch völlig egal. Du wurdest gebannt, also musst du dein Verhalten ändern und niemand anderes.","replies":[]},{"poster":"Sirrkas","date":"2017-09-13T19:30:01.567+0000","up_votes":1,"down_votes":0,"body":">andere flamen noch mehr und haben ihren Account auch nur noch weil die einfach mal 2-3 Wochen nicht spielen.\n\nDer wird bei dem ersten Spiel nach 3 Wochen dann aber ebenfalls gebannt, wenn er da negativ auffällt oder sich gar deinen Chatlog leistet.","replies":[]}]}]},{"poster":"Kata Ga Kill","date":"2017-09-12T16:40:17.586+0000","up_votes":2,"down_votes":0,"body":"Ich les mir diesen Roman jetzt nicht durch.....aber wenn ich sowas pingeliges sehe:\n> \"Was hat das damit zu tun?\"\n> \"Angst führt zur dunklen Seite der Macht!\"\n\nMit anderen Worten deine Empfindlichkeit ist bzw. führt zum aggressivem Verhalten.\nSollte wohl selbst erklärend sein.\n\nWenn du es nicht händeln kannst, mute die Leute und konzentrier dich lieber aufs Spiel.","replies":[{"poster":"DeadUmbreon","date":"2017-09-12T16:59:05.735+0000","up_votes":1,"down_votes":2,"body":"Nicht meine Empfindlichkeit, sondern die, der anderen xd Mir geht relativ alles am Arsch vorbei, was die mir schreiben, nur die Einstellung vom Spielverhalten regt mich auf.","replies":[{"poster":"Qbert","date":"2017-09-13T07:16:40.471+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeadUmbreon,realm=EUW,application-id=KYnfKGf0,discussion-id=EEAq98aw,comment-id=00000000,timestamp=2017-09-12T16:59:05.735+0000)\n>\n> Nicht meine Empfindlichkeit, sondern die, der anderen xd Mir geht relativ alles am Arsch vorbei, was die mir schreiben, nur die Einstellung vom Spielverhalten regt mich auf.\n\nDann lerne doch einfach, das Spielverhalten ebenso zu ignorieren, wie das geschriebene Wort.\nDu kannst sie sowie so nicht ändern.","replies":[]}]}]},{"poster":"Darkr3sQ","date":"2017-09-14T05:12:38.342+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich:\nDu warst vorbestraft. Du weißt, dass bei einer Vorstrafe die nächste Prüfung deutlich schneller eingeleitet wird. Du weißt auch, dass wenn man sich negativ im Chat äußert - und nüchtern betrachtet enthält Dein Chat negatives - und man reportet wird, eine Bestrafung erfolgt. Du sorgst wider besseres Wissen dafür, dass eine Analyse Deines Chatverlaufes durch Reports etwas findet, was es bestrafen muss. Und anschließend beschwerst Du Dich darüber und kannst die Bestrafung nicht nachvollziehen?\nWenn Du wieder spielen kannst solltest Du Dich **vor** dem Schreiben im Chat einfach mal folgendes fragen: \"Kann man das geschriebene negativ auffassen\". Sollte die Antwort darauf kein eindeutiges Ja sein, schreib es nicht. Oder wenn Du das nicht richtig einschätzen kannst - was möglicherweise der Fall sein könnte, da Du diese Strafe jetzt nicht nachvollziehen kannst - schreib einfach gar nichts. Wenn Du gar nichts schreibst, kannst Du auch nicht bestraft werden. Es hilft Dir aber ungemein, wenn Du Deinen Account weiterhin behalten willst. Wenn es Dir hilft, Mute einfach alle Spieler von Anfang an und schalte den All-Chat aus. Dann bekommst Du auch Report-Gebettel Deiner Mitspieler an die Gegenspieler nicht mit.\nNach der Strafe reicht eine Kleinigkeit aus, damit Du einen Perma kassierst. Es reicht ein kleines Noob und einen Report in diesem Spiel, damit Du geprüft wirst und den Perma bekommst. Soll keine Drohung sein sondern nur ein Gut gemeinter Rat. Nimm in an oder lass es sein, aber beschwere Dich danach nicht.\nDarüber hinaus: selbst wenn Du den Account nach der Strafe 3 oder mehr Wochen liegen lässt und nicht anfasst hast Du dadurch keinen Vorteil. Zeit wird in gespielten Spielen gemessen. Wenn Du nicht spielst, geht Deine Strafstufe nicht runter, da immer die Relation gespielte Spiele zu reporteten Spielen als Schwellwert genommen wird, und nicht reportete Spiele in Zeitraum.","replies":[]},{"poster":"Abasin","date":"2017-09-12T20:29:03.696+0000","up_votes":1,"down_votes":0,"body":"> DeadUmbreon: kys noob champ :)\n\nDas wars wohl. Selbst mit Grinsesmiley ist ein Todeswunsch nicht gerade \"freundlich\".","replies":[{"poster":"Qbert","date":"2017-09-13T07:14:24.145+0000","up_votes":1,"down_votes":0,"body":"das ist glaube ich die Stelle, die hier hiermit meint:\n> ich hab nicht die person gemeint, sondern die Person angesprochen den Champ in unseren Tower zu bewegen um zu verrecken... \n\nWas für mich aber nicht wirklich erkennbar ist ...","replies":[]}]},{"poster":"Pandeonor","date":"2017-09-12T20:23:43.092+0000","up_votes":1,"down_votes":0,"body":"Wie viele Möglichkeiten gibt es wohl:\n\nDeadUmbreon: _ich bin angepisst, besser, Ihr seid an allem Schuld, ich brauche ein Frustventil und das ist der Chat_  \n\nvon sich zu geben?\n\n☺\n\nDu hast ihn geflamed und Dich über ihn und sein Spiel (sein \"r\")  lustig gemacht. \n\nEs gibt 2 Arten von Kritik. Die eine ist konstruktiv/hilfreich, die andere ist destruktiv/zerstörerisch gemeint. Du warst deutlich destruktiv und hast damit Euren Schwachpunkt noch weiter geschwächt und alle im Team genervt.\n\n_\"ich brauch nichtmal was schreiben und werde reportet, weil mein team der Meinung ist, dass ich feede obwohl ich mal nh scheiß Tag hab oder so... was soll das bitte? \"_\n\nYep - was soll das bitte?? Der hatte vielleicht auch einen scheiss Tag oder ist einfach schlecht mit seinem R und Du reitest das halbe Spiel drauf ´rum anstatt ihn (wenn Du schon etwas Schreibzwang hast) konstruktive Hinweise zu geben. Woher weisst Du ingame so genau das es nicht sein schlechter Tag war? ☺","replies":[]},{"poster":"Night Lead","date":"2017-09-13T06:10:26.477+0000","up_votes":1,"down_votes":2,"body":"Ich bin jetzt mal das primitive Report Computer-Sytem\n\n> \n> Game 1\n> DeadUmbreon: lmao\n> DeadUmbreon: carryed by soraka and j4..\n> DeadUmbreon: pussys xd  {{summoner:14}} \n> DeadUmbreon: skilled champ  {{summoner:14}} \n> DeadUmbreon: press r...\n> DeadUmbreon: mf and syndra totally balanced... press r  {{summoner:14}} \n> DeadUmbreon: kys noob champ :) {{summoner:14}}  {{summoner:14}}  {{summoner:14}} \n> DeadUmbreon: there are enough towers to do that\n> DeadUmbreon: bruh i dont said to your person that you should kys {{summoner:14}} \n> DeadUmbreon: gp stop solo {{summoner:14}} \n> DeadUmbreon: we do 4v5\n> DeadUmbreon: cause oyu do nothing {{summoner:14}} \n> DeadUmbreon: btw how you will report me if i said that YOUR champ should kys {{summoner:14}} \n> DeadUmbreon: just explain\n> DeadUmbreon: then you cant report me lmao {{summoner:14}} \n> DeadUmbreon: said the one with only press r champ\n> DeadUmbreon: btw we do 4v5 cause gp ignore his team {{summoner:14}} \n> DeadUmbreon: sexy mi \n> DeadUmbreon: i didnt said it to her person\n> DeadUmbreon: only to the champ","replies":[]}]}