{"poster":"millo90","date":"2015-01-05T23:56:12.671+0000","title":"Why is match making so bad?","subforum":"Gameplay","up_votes":5,"down_votes":0,"body":"I don't understand how hard it is to play 5 people in the same rank against each other. Duo's ruin match making, making me have to play with 4 silver 2 teammates against a team of 4 gold 4's and a gold 5. How is this even remotely fair?","replies":[{"poster":"Catsaber","date":"2015-01-06T00:15:23.299+0000","up_votes":4,"down_votes":0,"body":"as a person who only plays on the teambuilder, i cant even begin to say on how many times i got matched WITH and AGAINST plat/diamond players. I mean i'm unranked, why i'm with/against ppl who are highly above my elo, it doesnt make any  sense. Riot seriously need to look on matchmaking system..","replies":[{"poster":"seylinya","date":"2015-01-06T02:32:58.257+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warcatsaber,realm=NA,application-id=3ErqAdtq,discussion-id=I7AjyciY,comment-id=0001,timestamp=2015-01-06T00:15:23.299+0000)\n>\n> as a person who only plays on the teambuilder, i cant even begin to say on how many times i got matched WITH and AGAINST plat/diamond players. I mean i'm unranked, why i'm with/against ppl who are highly above my elo, it doesnt make any  sense. Riot seriously need to look on matchmaking system..\n\nthats exactly my issue. im not ranked yet and would like to play with a friend to improve. but whenever i queue with him we are against people with 500-1k wins whereas we are at 102 and 75 wins( bronze and silver players vs my team that is all unranked) . of course if u play and win for long and have those kinda wins means u have more experience in the game. my team wont ward well for example or dont know how to last hit or is not familliar with all champs yet, so im bummed out that i keep facing people that obviously are pro in the game and our team gets trashed cause i queue with a friend..... when i queue solo i get a little more balanced mm for sure.\n\ni mean i dont even have enough runes yet for 2 builds...\n\ni used to play prime world and there is only pvp and u have rankings from beginning. u start at 1100 and will only be matched vs 1100 if u queue with a friend that is 1200 u will be pulled up to 1200 though but it doesnt happen that u are vs high ranks like 2000. but in most of the mobas id u are in a 3+ premade ull be upscaled which is though. yes, premades are mostlikely on ts or so but one shouldnt be punished if u want to play and learn with a friend.","replies":[]}]},{"poster":"Wînter Fox","date":"2015-01-06T00:33:22.672+0000","up_votes":2,"down_votes":0,"body":"I'm Gold 5 in ranked. In one draft normal yesterday I was with a Master Zed against two Diamonds and a Plat. \n\nI lost lane against Diamond Irelia, our Gold duo bot lost to the Plat, Zed went pretty even with Diamond Ziggs but we lost. Idk how or why the hell these terrible matchups keep happening.","replies":[]},{"poster":"SexyTaylorSwift","date":"2015-01-06T00:16:23.741+0000","up_votes":2,"down_votes":0,"body":"Cuz rito wuld rather nerf Sona","replies":[]},{"poster":"InsaneSamurai","date":"2015-01-05T23:57:58.862+0000","up_votes":2,"down_votes":0,"body":"This does need to get looked at, especially for Team Builder.  I commonly get paired with people who have played 10% of the amount of total games I have.","replies":[]},{"poster":"Antonidas1","date":"2015-01-06T08:54:20.401+0000","up_votes":1,"down_votes":0,"body":"Hey hey hey... at least you guys didn't get put with a Challenger 1 {{champion:131}} . Some friends ( 2 others ) and I were playing on our smurfs because ping op right ?? And we're all under level except one of us and we end up getting matched with a Challenger 1... like seriously the other 2 people weren't as experienced as us and that smurf just demolished {{champion:103}}  so to make it less painful for the other 2 on our team so we ff'd. The game - http://matchhistory.lan.leagueoflegends.com/es/#match-details/LA1/128518859/202565626?tab=overview \nand the Challenger - http://www.lolking.net/summoner/lan/4613092 , But at least this was just a normal game right ?? ","replies":[]},{"poster":"ScurvyNave","date":"2015-01-06T00:50:50.037+0000","up_votes":1,"down_votes":0,"body":"Cause for some reason rank level (gold, bronze etc) isn't tanker into account by team builder matchmaking algorithms. So a platinum can play  as {{champion:121}} for the first few times in team builder and stomp everyone because he's more experienced and a better player but team builder treats him like a bronze because he's playing a new champ.\n\n-This literally happened to me a plat kha six vs my team of all bronze ranks. Needless to say we got stomped and he got a pent\n\n-Rito plz","replies":[]}]}