{"poster":"krzbrg361","date":"2015-02-09T19:24:56.669+0000","title":"Jungler Buff","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo liebe Community, als Main Jungler bin ich etwas besorgt über den nutzen einiger Champions in der neuen Meta.\r\nZ.b Kha Zix ist im neuen Jungle sogut wie nutzlos. er kassiert super hart und kann deshalb kaum early game pressure aufbauen.\r\nIm mid game kommt dann dazu das man meistens völlig behind ist und gar nicht machen kann in den Teamfights.\r\nIch finde einfach die disparitäten im bezug auf \"viability\" ungerecht verteilt, man sieht nur noch WW, J4,Lee Sin,Vi und vereinzelt Diana und Fiddle im Jungle (Jetzt natürlich auch nida).\r\nIch würde mir kleine Anpassungen, oder wenigstens Tips wünschen das so gut wie möglich zu umgehen.\r\nLG Junknerd","replies":[{"poster":"Freefall013","date":"2015-02-14T22:13:53.958+0000","up_votes":1,"down_votes":0,"body":"Also ich muss als häufiger Hecarim-Spieler im Jungle sagen, dass mir der neue Jungle eigentlich besser gefällt. Die neuen Buffs helfen einem ja auch die Camps besser zu clearen.\nHecarim hat jetzt auch nicht den unglaublichen Heal, aber ich komme eigentlich immer zurecht. Ich schaffe vor dem ersten Back-Gehen immer Frog, Blue- und Redbuff. \nIm Early-Game kann man eigentlich auch ein paar Ganks einrichten und dabei immernoch das Level zwischen Botlane und Mid/Top -Lane oder mindestens das Level der Botlane halten. \n\nMan muss immer mal wieder zurück in die Base gehen, öfter als in der letzten Season. Was ich aber nicht sagen würde ist, dass der neue Jungle nicht balanced wäre. Die Champs, welche für den Jungle geeignet sind, schaffen es eigentlich bei richtigem Spielen, auf dem Level des Teams zu bleiben und diesem durch Ganks gute Hilfe zu leisten.\n\nIch persönlich habe mich gut an den neuen Jungle gewöhnt und würde mir momentan auf keinen Fall den alten Jungle zurückwünschen. Auch das Spielgefühl ist meiner Meinung nach deutlich besser als vorher, auch die Anforderungen sind höher, was es deutlich spannender macht.\n\nVorallem die Drachenbuffs finde ich super. So können sich auch in der Gegend des Drachen immer wieder Spannungen zwischen den Teams aufbauen, da der Drache deutlich wichtiger geworden ist, im Vergleich zur letzten Season.","replies":[]},{"poster":"Ragequit Account","date":"2015-02-09T19:41:00.968+0000","up_votes":1,"down_votes":0,"body":"Es war doch schon immer so, dass nur ein paar Jungler häufig gespielt werden.\nEnde S3 man hauptsächliche Elise und Lee gesehen. In der Preseason 5 war immer nen Warwick.\nMit WW, J4, Lee, Vi, Rengar, Shaco, Fiddle, Pantheon und Reksai haben wir schon mehr als eine Handvoll spielbarer Jungler. Dann kommen noch Champs wie Hecarim, Fizz, Nida, Seju,... hinzu. Khazix ist mmn auch ein schlechtes Beispiel. Wirklich Probleme haben Elise und Evelynn oder auch Nocturne und Nauti.","replies":[{"poster":"DEM0G0RGON","date":"2015-02-09T20:31:48.167+0000","up_votes":1,"down_votes":1,"body":"Alos probleme haben elise und nocturne gar nicht, zumindest was sustain und clearspeed angeht.\nda haben beide eine menge von und nach dem ersten back läuft der jungle bei denen wie bei jedem anderem champ auch","replies":[{"poster":"krzbrg361","date":"2015-02-14T22:00:41.102+0000","up_votes":1,"down_votes":0,"body":"Elise find ich auch noch sehr Solide, ist halt etwas Schwerer zu spielen und meiner Meinung nach sollte man eher Tanky bauen.","replies":[]}]}]},{"poster":"krzbrg361","date":"2015-02-14T21:59:48.282+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank erstmal für die netten antworten, ich hab mir schon haufenweise zeug angeguckt wie man damit umgehen soll, nur find ich leider das Problem das man useless ist wenn das team behind ist etwas zu gravierend, was ihn als pick für den soloq ziehmlich schlecht erscheinen lässt.\nDadurch das er einen vergleichweise so geringen Sustain hat, hat er auch keine Chance Nidalee oder einen Lee Sin 1 vs. 1 zu killen auch wenn man Gold mäßig ebenbürtig ist.\nSeine 1vs. 1 Stärke, das Counterjunglen und die gegner einzeln rauszupicken find ich dadurch ziehmlich beeinträchtigt, er ist somit sehr einfach zu countern.\nIch bin mir sicher das Riot ihn nicht buffen wird im eigentlichen Sinne, ich würde mir aber mehr Sustain im Jungle Wünschen.\nMan könnte z.B seiner e oder q etwas lifesteal bei junglemonstern hinzufügen.","replies":[]},{"poster":"iJUKEuQQ","date":"2015-02-09T21:42:03.708+0000","up_votes":1,"down_votes":0,"body":"ich find den jungle an sich nicht so schlimm mit kha.musst halt vor dem zweiten buff mal back.kannst dir dafür dein jungler item holen.(ich spiel gern das mit sustain zb ab da is der jungle dann easy).\nnach ner menge kha spielen diese season jetzt muss ich sagen, mich stört am meisten an ihm, dass du in richtung useless gerätst wenn du bzw. dein team behind geraten.und weil sein dmg jetzt nicht mehr sooo stark ist(im early oder ohne seine core items), passiert mir das in letzter zeit echt oft, dass die gegner mit 1%hp entkommen^^aber an sich scheint er ganz ok so zu sein wie er ist, denn ich hab ne ~5x% win rate mit ihm.\ngefühlt is es zwar so , als wär er zu schwach, spiel ihn aber seit release","replies":[]},{"poster":"Gragion","date":"2015-02-09T19:33:49.844+0000","up_votes":1,"down_votes":0,"body":"Die Meta wechselt von Patch zu Patch. Wenn ich das richtig verstanden habe, dann willst du wissen, wie man am besten mit Kahzix spielt? - Nun dafür gibt es zahlreiche geupdatede Guids. Schau doch einfach mal bei lolking.net oder bei baronbuff.de vorbei! :) \n\nWenn es aber darum geht, den Jungle für Khazix attraktiver zu machen, na dann kann nur Riot dir Abhilfe schaffen. \n\n\nGrüße! {{summoner:31}}","replies":[]}]}