{"poster":"FlyingDutchman77","date":"2015-07-08T11:45:27.032+0000","title":"14-Tage Bann direkt nach dem Spiel","subforum":"Hilfe & Support","up_votes":3,"down_votes":2,"body":"Hallo,\n\nich habe heute ein paar Spiele gemacht und war dann ein paar Minuten weg (war relativ toxic). Als ich dann wieder kam wurde ich erst deconnected und hab dann gesehen das ich 14-Tage Bann erhalten habe. Das interessante war nur, dass der Grund, das Spiel direkt davor war (seit wann geht das so schnell oder hatte ich evtl nen Mitarbeiter von Riot in meinem Game?!) Ich habe vorher noch keinerlei Verwarnungen oder &auml;hnliches bekommen. (Z&auml;hlt wahrscheinlich als die 1.Wahrnung)\nBtw. soll das kein Geheule sein vonwegen ich \"habs nicht verdient\" etc. der Bann kann durchaus als gerechtfertigt angesehen werden, nur wundert es mich 5 Minuten nach dem Spiel schon gebannt zu sein. \nOder lag es evtl. daran, dass ich den Satz \"well i feeding without a reason ;)\" rausgehauen habe, der eigendlich etwas anders gemeint war den ich jedoch dummerweise nicht mehr korrigiert habe. \n\nMfG Florian","replies":[{"poster":"Alustus","date":"2015-07-08T12:09:13.343+0000","up_votes":2,"down_votes":0,"body":"> , nur wundert es mich 5 Minuten nach dem Spiel schon gebannt zu sein.\n\nIst doch äußerst erfreulich wenn es so schnell geht.\n\nNunja wir wissen ja nicht was du geschrieben hast.\nVllt sind da einige wörter gefallen die Riot als sehr sehr toxisch ansieht.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T12:34:32.180+0000","up_votes":1,"down_votes":1,"body":"Chat ist unten. Man bekommt leider nur seinen Teil.","replies":[{"poster":"Alustus","date":"2015-07-08T12:46:34.503+0000","up_votes":1,"down_votes":0,"body":"Nunja es geht ja ums eigene benehmen und nicht das der anderen.\n\nNaja das was mir auffällt ist das 70% deiner Chateinträge negativ sind, was mMn schon extrem ist.\nProbier dich mehr auf dich zu konzentrieren und lass dich nicht von anderen Spielern reizen\n\n\nHoffen wir mal das dir diese 14 Tage eine Lehre sind, wenn ja kann es dir egal sein ob eine Warnung kommt oder nicht.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T12:53:30.286+0000","up_votes":1,"down_votes":1,"body":"Ja aber mal ehrlich würdest du für diesen Chat direkt 14-Tage verhängen (hatte noch keine Chat Einschränkung o.ä.)? Ich meine wenn ich nen schlechten Tag habe und mich hauptsächlich über afks aufrege. Beim nächsten mal dann Perma-Bann für sowas ?!\nBtw. an dem Spiel waren auch nur die ersten 10 Minuten positiv.","replies":[{"poster":"Alustus","date":"2015-07-08T13:06:13.315+0000","up_votes":2,"down_votes":0,"body":"Nunja ich würde mal sagen ich finde es konsequent.\n\nEig. solltest du dich auch an einem schlechten tag im griff haben.\nDas wahrscheilich immer wieder ausrutscher passieren werden/können ist mir bewusst.\nAber ich habe es auch irgendwie geschafft 2,5 Jahre im Chat nicht auszurasten, und während dieser Zeit hatte ich auch desöfteren schlechte Tage (um es nett auszudrücken).\n\nIch weiß zwar nicht wie momentan das System läuft, aber ich denke nicht das du das nächste mal direkt einen Bann bekommst.\nEinen Permabann spricht Riot sehr selten aus. Wenn man bedenkt wieviele Leute im Forum herumgrannt sind mit 1400 Games RR und CR.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T13:19:59.661+0000","up_votes":1,"down_votes":1,"body":"Mal so am Rande die Verwarnung gilt aber nur für diesen speziellen Account oder ?","replies":[{"poster":"Alustus","date":"2015-07-08T13:23:08.693+0000","up_votes":1,"down_votes":0,"body":"Speeren/strafen sind soweit ich weiß (nicht offiziell) immer nur auf 1 Account bezogen. (kann mich aber auch irren)","replies":[]}]}]},{"poster":"HyperionCH","date":"2015-07-08T13:07:27.605+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlyingDutchman77,realm=EUW,application-id=7hciEY9w,discussion-id=BqpREm3E,comment-id=0001000000000000,timestamp=2015-07-08T12:53:30.286+0000)\n>\n> Ja aber mal ehrlich würdest du für diesen Chat direkt 14-Tage verhängen (hatte noch keine Chat Einschränkung o.ä.)? Ich meine wenn ich nen schlechten Tag habe und mich hauptsächlich über afks aufrege. Beim nächsten mal dann Perma-Bann für sowas ?!\n> Btw. an dem Spiel waren auch nur die ersten 10 Minuten positiv.\n\nIch persönlich: ja.\n\nDieses Verhalten hat nichts mit schlechtem Tag zu tun, sondern mit einem inakzeptablem Umgang gegenüber seinen Mitspielern.","replies":[]}]}]}]}]},{"poster":"Revilous","date":"2015-07-08T20:50:22.409+0000","up_votes":1,"down_votes":0,"body":"Wenn man sich so die Chatlogs durchliest, fällt mir auf, dass ich noch nie Timebanned war obwohl ich soetwas harmloses 24/7 schreibe. Bspw. habe ich letztens erst eine Irelia voll geflamt weil die so schlecht gespielt hat. Also ich war Toplane gegen sie mit AD Katarina und da habe ich geschrieben \"Irelia what are you doin\" \"concentrate pls you play fkn bad its 2 ez 4 me\" naja danach hat sie getrollt und ist dann afk gegangen haha, war ein Ranked :D Naja sowas mache ich dauernd aber kriege nur Ranked und Chatbann aber nie Timebanns, seit 2 Jahren inzwischen?? Stattdessen erhalte ich Skins und Champions für mein ach so gutes Verhalten Riot ihr seid zu nett zu mir :3","replies":[{"poster":"FlyingDutchman77","date":"2015-07-09T22:37:28.401+0000","up_votes":1,"down_votes":1,"body":"Geht mir auf meinem Main genauso... in mir keimt die Vermutung auf, dass sie das machen weil der nicht lvl 30 ist und auf dem deutlich weniger kohle geflossen ist...(also die schnelle drastische Bestrafung, nicht generell) aber hey Geld oder Lcs Spieler Gleichbehandlung hört schnell auf bei sowas xD Wobei das natürlich nur ne Vermutung von mir ist.","replies":[{"poster":"Revilous","date":"2015-07-10T13:17:57.956+0000","up_votes":1,"down_votes":0,"body":"Ich hab noch keinen Cent in dieses Spiel investiert? wtf","replies":[{"poster":"FlyingDutchman77","date":"2015-07-10T19:50:59.604+0000","up_votes":1,"down_votes":0,"body":"Ich meine auch nicht generell sondern die Schmerzgrenze ^^","replies":[]}]}]}]},{"poster":"Lêgendâry","date":"2015-07-08T22:19:36.986+0000","up_votes":1,"down_votes":0,"body":"Riot wird sich schon was dabei gedacht haben, die Bannen nicht ohne Grund{{summoner:31}} .","replies":[]},{"poster":"Hicku","date":"2015-07-08T14:11:30.967+0000","up_votes":1,"down_votes":2,"body":"Ich habe mal gehört das wenn extreme Häufungen von Reports nach einem Game auftreten (das Berühmte 9x....oder etwas weniger), dass dann eine Verwarnung in Kraft tritt oder falls man die schon hatte, dann direkt ein \"milder\" Bann ausgesprochen wird....\n\nDas könnte aber auch ein Mythos gewesen sein.","replies":[{"poster":"HyperionCH","date":"2015-07-08T14:19:29.767+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hicku,realm=EUW,application-id=7hciEY9w,discussion-id=BqpREm3E,comment-id=0002,timestamp=2015-07-08T14:11:30.967+0000)\n>\n> Ich habe mal gehört das wenn extreme Häufungen von Reports nach einem Game auftreten (das Berühmte 9x....oder etwas weniger), dass dann eine Verwarnung in Kraft tritt oder falls man die schon hatte, dann direkt ein \"milder\" Bann ausgesprochen wird....\n> \n> Das könnte aber auch ein Mythos gewesen sein.\n\n\"Mythos\" ist untertrieben; es ist völliger Quatsch.\n\nBei vielen Reports innerhalb kurzer Zeit gibt es eine Warnung.\nEine Warnung hat mit einer Verwarnung aber nichts zu tun.\n\nSollte man weiterhin oft reportet werden, startet die Chatanalyse. Erst wenn diese Toxiness findet, gibt es Strafen.\n\nIn Einzelfällen (wirklich schlimme Finger) kann die Chatanalyse sofort starten und ohne Vorwarnung einen 2-Wochen-ban aussprechen. Analysiert wird der Chat jedoch immer.","replies":[]},{"poster":"Sirrkas","date":"2015-07-08T14:16:57.548+0000","up_votes":1,"down_votes":0,"body":"Die Reports alleine bewirken so etwas nicht. Die Warnung erhält man, wenn man öfter als sonst gemeldet wurde. Vielleicht sowas wie in 2 von 10 Spielen, bei Spielern, mit einer weißen Weste und notorische Flamer sehen sowas wohl nur dann wieder, wenn sie statt in jedem zweiten in 2 von 3 Spielen gemeldet werden. \n\nDie Banns werden bei Extremfällen verteilt und das schon wenige Minuten nach dem Spiel.","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-07-08T14:15:30.220+0000","up_votes":1,"down_votes":0,"body":"Die Warnung erhält man, wenn man öfter als sonst in letzter Zeit reportet wurde. Das msus nichtmal auf nur ein Game bezogen sein. Und einen Ban aufgrund von Reports gab es noch nie (auch keinen \"milden\" Ban). Bans werden nur verteilt, wenn sie gerechtfertigt sind (was Reports nicht unbedingt sind).","replies":[]}]},{"poster":"Alzucard","date":"2015-07-08T11:47:22.269+0000","up_votes":1,"down_votes":0,"body":"Bei einem Ban solltest du eigentlich eine E-Mail bekommen. Zumindest hab ich davon letztens eine gesehen.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T11:56:20.066+0000","up_votes":1,"down_votes":1,"body":"Ja ne Mail hab ich bekommen, aber da war halt nur der Chatverlauf und paar Hinweise vonwegen sowas dulden wir nicht etc. ... Was ich komisch finde ist, dass ich auf dem Account direkt nen Bann bekomme mich aber auf meinem \"Main\" auch schon schlimmer verhalten habe, aber nix kam. \n(Ja ich weiss Schande über mein Haupt ich versuch ja mich zu bessern...)","replies":[{"poster":"HyperionCH","date":"2015-07-08T12:21:30.840+0000","up_votes":1,"down_votes":0,"body":"Dieses System mit dem schnellen 14-Tage-ban gibt es noch nicht allzu lange.\nKann also sein, dass die ganz schlimmen Dinger auf deinem Main noch vor dieser Neuerung war.\n\nMöglich ist natürlich auch, dass es nur Glück ist. Darauf solltest du aber bezüglich deinem Main-Account nicht vertrauen.","replies":[{"poster":"Alzucard","date":"2015-07-08T12:24:59.232+0000","up_votes":1,"down_votes":0,"body":"Wie lange gibts das denn schon?","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T12:28:48.041+0000","up_votes":1,"down_votes":1,"body":"Ja aber direkt 14-Tage ohne Vorwarnung ? Das Problem ist an sich habe ich keinen direkt beleidigt, sondern mich mehr über unsere afks geärgert (einmal tristana und dann gragas) und dann sind halt wörter wie afk, feed, idiot, moron etc gefallen. (nein, nicht die beliebten \"cance\" Sprüche etc. auch nix rassistisches o.ä.)\nKönnte mir vorstellen, dass wenn das ein automatisches System macht, dass ohne den restlichen Chat wirklich zu verstehen bewertet, den Chat als \"schlimmer\" einstuft.","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-08T13:06:58.237+0000","up_votes":1,"down_votes":0,"body":"> Könnte mir vorstellen, dass wenn das ein automatisches System macht, dass ohne den restlichen Chat wirklich zu verstehen bewertet, den Chat als \"schlimmer\" einstuft.\n\nEs ist vollkommen irrelevant, was andere geschrieben haben. Wenn **dein** Chatverlauf nicht in Ordnung ist wirst du dafür bestraft, Punkt Ende aus. Nur weil andere sich nicht gut verhalten gibt es dir noch lange nicht das Recht selbst auch so zu handeln.\n\nDas System verteilt die 14-Tage-Bans bis spätestens 15 Minuten nach einem Game und liefert auch keine Vorwarnung. Warum sollte es auch? Du hast schließlich gegen den WdB verstoßen und sollst die nächsten 14-Tage über dein Verhalten nachdenken und nicht eine Warnung wegklicken und nicht mehr drüber nachdenken.\n\nJeglicher Flame ist Toxic und sollte deshalb bestraft werden. Es ist vollkommen egal ob man blamed, Leute beleidigt, sich rassistisch äußert oder anderen Leuten Krebs wünscht. \"Normaler\" Flame sollte deshlab nicht weniger bestraft werden als Beleidigungen.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T13:16:48.604+0000","up_votes":1,"down_votes":1,"body":"Naja das ne Vorwarnung kommt steht eig in den AGBs bzw. in der Sektion zu den Bestrafungen","replies":[{"poster":"HyperionCH","date":"2015-07-08T13:21:12.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlyingDutchman77,realm=EUW,application-id=7hciEY9w,discussion-id=BqpREm3E,comment-id=0000000000010000000000010000,timestamp=2015-07-08T13:16:48.604+0000)\n>\n> Naja das ne Vorwarnung kommt steht eig in den AGBs bzw. in der Sektion zu den Bestrafungen\n\nHast du diesen Abschnitt?\nIn der EULA fand ich z.B. nichts.","replies":[{"poster":"FlyingDutchman77","date":"2015-07-08T13:28:52.922+0000","up_votes":1,"down_votes":1,"body":"Ah ne passt hab das bei dem eingeschränkten Chat falsch verstanden.","replies":[]}]}]}]},{"poster":"FlyingDutchman77","date":"2015-07-08T12:30:21.878+0000","up_votes":1,"down_votes":1,"body":"Naja ich haus einfach mal rein, wie gesagt war müll aber gut zu spät ^^ Das mit Riven hab ich nur in unsern Chat geschrieben (für die gegnerische Riven nicht zu sehen)... Einiges war auch ironischer Spass mit der gegnerischen Janna, die die 3 games davor schon dabei war und ich hab mundo gespielt deswegen der hodor ^^ Der Rest flame halt.\n\n\n\"fuck theise rivens ...\njust dont gank top pls\njo riven lets take it slowly ok ?\njust stop cry and play\nward\ngragas pls\nnot hus fault\ncan u just strop cry gragas and follow calls\njo guys can u just stop ggetting kills if u die aswell\nryze pls\nGRAGAS\nno\nwell nice tris afk\nfuckn moron\njust ff\nfuck this tris\npls report tris afk and gragas negative attituide pls\n^^ like the 3rd sentence i said\nty\nrly ?\nall 3\n^^\nye well its my 3rd game with him ^^\nhodor :(\nwell i feeding without a reason ;)\nliek u ^^\njust trying out stuff\nnice grag still with ult xD\nmuhahaha\ngz now gragas is afk xD\ni have no clue\njust report them pls\njanna pls\ncan we pls ff\nidc anymore\nand ryze srly stfu\nu feeding from beginnin\ni just dont care cause we got 2 trolls anyway\nso u can feed ?\nno excuse\nif u feed ur fault\ni get gangbanged from 4 ppl all the time cause u are unable to grp so stfu pls\nso what\ndont grp\nye idc\nits lost anyway\ndia but k\nwell i dont play like it atm\nnope\nyes\nits called fooling around\nwhen u dont care\"","replies":[]}]},{"poster":"HyperionCH","date":"2015-07-08T12:39:38.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bandigo,realm=EUW,application-id=7hciEY9w,discussion-id=BqpREm3E,comment-id=0000000000010000,timestamp=2015-07-08T12:24:59.232+0000)\n>\n> Wie lange gibts das denn schon?\n\nSeit ca. 2 Monaten.","replies":[]}]}]},{"poster":"Alzucard","date":"2015-07-08T12:00:38.135+0000","up_votes":1,"down_votes":0,"body":"Ich habe selbt letztens eine 250 Matches Chat Restriction bekommen und weiß auch wieso. ich arbeite auch daran ^^\nJa das ist seltsam, aber es ist möglich, das einfach alle im Game dich reportet haben.\n\nhttps://support.riotgames.com/hc/de/articles/201752984\nIst schon recht seltsam das gebe ich zu. Hier steht es übrigens auch  noch mal wie das abläuft.","replies":[]}]}]}]}