{"poster":"Smasher","date":"2015-07-24T19:48:18.680+0000","title":"Consulta copyright a la hora de stream. (Buscando respuesta oficial)","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Buenas a todos, ando con una duda que me plantearon hoy en mi stream y quisiera que alguien me aclare el tema (si es una repsuesta oficial de alguien de rito mucho mejor).\r\n\r\nYo empece  a streamear hace menos de 3 semanas y eventualmente surgio la idea de ver la lcs juntos y comentarla. Yo lo hice 1 vez sin pensarlo siquiera porque me parecio algo natural, era simplemente mirar la partida juntos y comentarla mientras charlaba con mis followers (lo cual nos daba una experiencia mucho mas copada que cuando uno esta jugando). Hoy a uno de los followers se le ocurrio preguntar si esto era legal, y recien ahi ca&iacute; en que nunca veo streamers haciendo eso y por lo tanto quizas estaba prohibido y de inmediato decid&iacute; dejar de hacerlo hasta averiguar sobre el tema.\r\n\r\nBusqu&eacute; en google, en twitch y rito y no encontr&eacute; una respuesta clara, si alguien pudiera dirigirme a un link o contestarme seria genial.\r\n\r\nLa pregunta seria: &iquest;Es ilegal hacer broadcast de la transmision de la lcs (en ingles) mientras yo comento en mi stream en espa&ntilde;ol y charlo con mis seguidores?\r\n\r\nEn caso de esta prohibido, hay alguna manera en la que se pueda hacer algo similar? Digo, puedo hostear y chatear quizas, pero sin audio, lo que hace que se pierda un poco la gracia. Streamear una repeticion supongo que no esta prohibido porque he visto grandes streamers hacerlo. Pero bueno, &iquest;que opciones hay basicamente?\r\n\r\nDesde ya muchas gracias :)!\r\n\r\nSaludos!\r\n\r\nSmasher","replies":[{"poster":"ATR Nanho","date":"2015-07-24T20:01:34.086+0000","up_votes":2,"down_votes":0,"body":"Personalmente he visto canales de twitch baneados por pasar directos de otros canales [esto sucedio con un torneo de csgo] Sobre riot no se la verdad si tengan copyright sobre sus directos, habra que esperar a que un rioter responda","replies":[{"poster":"Smasher","date":"2015-07-24T20:02:54.968+0000","up_votes":1,"down_votes":0,"body":"Si, eso me imaginaba. \n\nPor eso la segunda parte de la pregunta, que otras opciones hay?\n\nSupongamos que acaba de pasar la partida de Fanatic, apenas termina puedo hacer broadcast de la repeticion sin peligro alguno?\n\nEspero una respuesta de alguien de riot =D!\n\nGracias igual :)","replies":[{"poster":"ATR Nanho","date":"2015-07-24T20:36:07.289+0000","up_votes":1,"down_votes":0,"body":"Supongo que no habría problema alguno con eso, seria lo mismo que los videos en youtube por asi decirlo, una retransmición. Sino lo que podrías hacer es una vez terminado el torneo transmitirlo devuelta para la gente que no lo pudo ver.\n\nesta interesante lo que planteaste, esperemos un rioter aver que dice","replies":[]}]}]}]}