{"poster":"Hi ím Kata","date":"2016-11-17T18:51:43.704+0000","title":"Silber 5 Supporter sucht Team ^-^","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey! :3\nIch bin ein Supporter der seine Champs kann aber auch gerne bereit ist neue Champs zu lernen.\nErstmal ein paar Infos zu mir! :3\nName: Fabian\nAlter: 17\nBin Momentan in Silver 5 aber hoffe das dies sich mit der neuen Season auch verbessert!\nMeine Champs die ich momentan aktiv spiele: {{champion:432}} {{champion:40}} {{champion:37}} \nSind jetzt nur ein paar Beispiele spiele auch noch andere Champs :D\nNaja wenn ihr noch was wissen wollt oder euch das jetzt schon angeregt hat dann addet mich einfach ingame : RS ZeshoX\nMan sieht sich in der Kluft! :3\nKann nat&uuml;rlich auch alle anderen Lanes au&szlig;er Top falls ihr schon einen Supporter habt und etwas anderes sucht\n\n(Tag ist noch vom alten Team wir aber bei gelegenheit ge&auml;ndert)","replies":[{"poster":"fess123","date":"2016-11-18T06:43:19.792+0000","up_votes":1,"down_votes":0,"body":"Hi Fabian,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}