{"poster":"IVPA Frunbe","date":"2019-03-24T15:40:33.110+0000","title":"Ich bekomme 11LP und verliere 25 ohne eine große Loosing streak","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Moin, ich hab jetzt etwa über 200 Ranked games und ich verstehe dieses LP system gar nicht und erachte es als absolut unfair.\r\nAls ich platin 1 war bekam ich noch 19 LP und sobald ich dia kam und das erste spiel gewann, waren es nur +13 und immer -24.Jetzt nachdem ranked resett habe ich wieder angefangen zu ranken und hatte keine größere loosing streak als 3 loosing hintereiannder, trotzdem bekomme ich nur 11lp und verliere 25.Außerdem hatte ich bisher 0 looses auf 0LP und trotzdem das gelbe ausrufezeichen während mein kollege 11 looses und 4 wins hat aber trotzdem +14... Kann mir das jemand erklären? Ja ich weiß meine allrounder winrate ist nicht wirklich gut aber rechtfertigt dsa diese extremmen -/+ LP?","replies":[{"poster":"MamasLieblingx3","date":"2019-03-24T15:46:14.043+0000","up_votes":2,"down_votes":1,"body":"vor paar tagen habe ich auch paar spiele auf p1 gewonnen und immer +20 lp bekommen für einen sieg bis ich auf 60 lp war. dann hab ich eins verloren und auch 20 lp verloren was okay ist. was aber heute passiert ist, ist das ich wieder gewonnen habe und +17 lp bekommen habe. ich hab eine 52% winrate auf 155 games. kann doch nicht sein, dass meine mmr so abnimmt durch einen lose so das ich -3 lp mache falls ich das ausgleiche. \n\nalso ich kann dich gut verstehen","replies":[{"poster":"Dreadlord Mike","date":"2019-03-24T15:57:14.485+0000","up_votes":1,"down_votes":0,"body":"Es kommt auch immer darauf an, gegen was für enemies du spielst.\nWenn du zb Gegner hattest deren mmr niedriger als deine war, bekommst du auch weniger wenn du gewinnst.","replies":[{"poster":"IVPA Frunbe","date":"2019-03-24T16:07:17.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dreadlord Mike,realm=EUW,application-id=ip27PlEH,discussion-id=Tr37HwlZ,comment-id=00000000,timestamp=2019-03-24T15:57:14.485+0000)\n>\n> Es kommt auch immer darauf an, gegen was für enemies du spielst.\n> Wenn du zb Gegner hattest deren mmr niedriger als deine war, bekommst du auch weniger wenn du gewinnst.\n\nJa das ist schon klar, aber wie so ist meine MMR so niedrig ohne besonders schlechte winrate oder einer loosing streak?","replies":[]}]}]},{"poster":"Avorox","date":"2019-03-24T15:50:15.771+0000","up_votes":1,"down_votes":0,"body":"Dein MMR ist halt einfach super niedrig, du spielst ja auch fast nur gegen Platinspieler. Ich kann verstehen dass das die Motivation nicht unbedingt steigert, aber wenn du wie Dia spielst wirst du gegen diese Platinspieler öfter gewinnen als du verlierst und damit irgendwann dein MMR fixen.","replies":[]}]}