{"poster":"Skillimaster","date":"2015-05-07T04:17:00.309+0000","title":"Mittlere Bots Bug?","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo. Ich habe festegestellt das Bots auf der mittleren Stufe, (Rammus/ Malphite/ Shen/ Galio...) und warscheinlich noch mehr, scheinbar ihre Orientierung verlieren, sobald man (Unten haben wir gespielt) den mittleren Inhibitor gepusht hat. Sie laufen nach rechts richtung Inhib tower, der noch steht und quetschen sich alle vor die Wall (Wo auch der Eingang des Gegners ist). Wir konnten das in mehreren Spielen feststellen, leider spielen wir aber fast immer mit den selben Bots deswegen die ungenaue Angabe.\n\nDazu kommt das der Irelia Bot, der einen Ziggs Bot Buchst&auml;blich \"auseinander\" nimmt (vor beiden Nexus Towern des gegners) und pl&ouml;tzlich Ziggs nicht mehr als target nimmt( ziggs knapp 400 Leben, Irelia 2000+)  und in beide Nexus tower rein l&auml;uft bis zum Nexus ohne ersichtlichen Grund. \n\n\"Freies Game\", kein Co-op\n\nMfG  Skilli","replies":[{"poster":"Kaitri","date":"2015-05-07T08:26:49.772+0000","up_votes":1,"down_votes":0,"body":"das mit den bots ist so ne sache... ich glaube wenn sie zuviel dmg nehmen dann hauen sie ab. hab schonmal beobachtet selber, ware auf knapp 200 hp und slowed hab dem bot alles in die fresse geklatscht, er selber war dann nur mehr auf ~600hp runter von ~2000 und ist halt abgehauen.\nund bei den inhibs weiß ich auch nicht so was da los ist, das ist mir im 3v3 mal aufgefallen du kannst zu 3. die botlane durchpushen, nach 5min den inhib haben UND DANN kommen die 2 top bots erstmal back. danach kannst du afk bleiben und zusehen wie die super inhibs die unterlevelten bots backpushen die meist nur mehr aus der base und wieder zurück laufen.\nsin dhalt bots","replies":[{"poster":"Skillimaster","date":"2015-05-08T20:25:59.061+0000","up_votes":1,"down_votes":0,"body":"Kaitri, danke schon mal für deine Antwort. \n\nIch habe oben versucht möglichst genau zu beschreiben, wie die Bots sich verhalten um zu verdeutlichen das es wirklich ein Bug der Bots ist.\n\nDie Irelia mit dem Ziggs Bot war auf min. 3/4 Hp, und ist in die Gegnerischen Nexus Tower gelaufen. \n\nIch hätte vielleicht erwähnen sollen das die Bots auf unserer Seite waren und auch WIR den Inhib gepusht hatten. Sie stehen also in der Gegnerischen Base und warten das ein Gegner kommt und laufen vor der Wall hin und her Richtung rechten Inhib Tower der Gegner.\n\nKEIN Flucht verhalten sondern, ich weiß auch nicht.","replies":[]}]}]}