{"poster":"Examqle","date":"2016-08-27T02:13:39.746+0000","title":"Becoming toxic, need jusus","subforum":"Player Behaviour","up_votes":2,"down_votes":0,"body":"Hi ive noticed been becoming more and more angry playing league and it has translated into the chat. ive been saying some pretty harsh things (none of your typical flaming) and i want to stop before i get banned i love playing the game but it can make me frustrated Thanks.","replies":[{"poster":"Tele","date":"2016-08-27T05:02:33.401+0000","up_votes":2,"down_votes":0,"body":"Hey summoner,\n\nIt's great to hear you want to reform! I'd like to give you some specific tips though, rather than just listing a bunch of broad [general stuff](http://boards.oce.leagueoflegends.com/en/c/player-behaviour/K57wEEW0-self-improvement?comment=0001) that we've done before, if that's ok.\n\nI'll need you to answer a few of these questions so we can understand your situation a little better (leave anything you don't want to answer blank):\n\n1. Are you getting angry at people who are legitimately trolling/insulting you? Or  are you getting angry at people who are doing badly in lane?\n\n2. Does this happen in ranked, normals or both?\n\n3. Do you have /allchat enabled? and how often do you use the mute button?\n\n4. Do you play with friends often?\n\n5. And lastly, what's the most severe restriction you've received? (gives us an idea of how quickly we need to act)\n\nAttach your replies to this comment if you'd like, or add me in-game and send some of your answers there :D","replies":[{"poster":"Examqle","date":"2016-08-28T05:28:46.534+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tele,realm=OCE,application-id=T8eq2lFQ,discussion-id=HeEZuvWN,comment-id=0000,timestamp=2016-08-27T05:02:33.401+0000)\n>\n> Hey summoner,\n> \n> It&#x27;s great to hear you want to reform! I&#x27;d like to give you some specific tips though, rather than just listing a bunch of broad [general stuff](http://boards.oce.leagueoflegends.com/en/c/player-behaviour/K57wEEW0-self-improvement?comment=0001) that we&#x27;ve done before, if that&#x27;s ok.\n> \n> I&#x27;ll need you to answer a few of these questions so we can understand your situation a little better (leave anything you don&#x27;t want to answer blank):\n> \n> 1. Are you getting angry at people who are legitimately trolling/insulting you? Or  are you getting angry at people who are doing badly in lane?\n> \n> 2. Does this happen in ranked, normals or both?\n> \n> 3. Do you have /allchat enabled? and how often do you use the mute button?\n> \n> 4. Do you play with friends often?\n> \n> 5. And lastly, what&#x27;s the most severe restriction you&#x27;ve received? (gives us an idea of how quickly we need to act)\n> \n> Attach your replies to this comment if you&#x27;d like, or add me in-game and send some of your answers there :D\n\nHi Thanks for helping\n\n1. Both of these things happen alot but i probably get more angry at people Trolling and directly insulting\n\n2. Both\n\n3. i always have all chat enabled just in case we want to have some friendly banter i use the mute button id say in half my games\n\n4. on the weekend yes but not during the week\n\n5. i have never received a ban / restriction but i feel like if i continue i will so i want to stop before i do\n\nthanks again!","replies":[{"poster":"Tele","date":"2016-08-29T05:53:14.186+0000","up_votes":2,"down_votes":0,"body":"Hmm sounds like the issue I had a few years ago. \n\nHere's what worked for me:\n\n1. **End on a good note.**\nOne of the things that triggered me was that I was queuing up expecting a negative experience (like a bad team), so when anything slightly negative happened I'd just mentally give up. \n\n What helped me curve that back was making sure I ended each day on a good note. If I wanted to play 5 games but the 3rd game was rewarding, I'd just stop there and practice CSing or watch streams. \n\n After a while I noticed that I won more games and I was going into games thinking _\"I can totally carry this\"_.  How you end an experience actually has a massive physiological impact.\n\n2. ** Play less seriously with more friends!**\n I think you should be playing with friends every second day. I know you might write this off as useless advice, but you'll find yourself raging less if you make a serious effort to play more with good friends. \n\n Also by \"playing with friends\", I don't mean just adding them to the game. I mean getting in voice chat with them and talking while you play. Playing experimental champion picks also helped me completely de-stress the experience.\n\nRemember you won't see effects immediately from stuff like this. It's going to take at least a week to get over your current attitude towards League and then maybe you'll see results in the next week.\n\nAlso I wouldn't worry too much about being punished. It's obviously not a good thing, but if you're genuinely trying to reform the actual punishment might come as a good reminder when you're about to flame in-game.\n\nSorry for so much reading! :D","replies":[]}]}]},{"poster":"TheOneUser","date":"2016-08-28T17:33:32.798+0000","up_votes":2,"down_votes":0,"body":"league isn't a fun game (unless you're a troll)\n what i think happens probably is that after 1 horrible game theres a sense of dissatisfaction \nwhich leads to going into another game which would be played on tilt.\nfrustration is a perfectly normal part of the game! ideally you'd have a 50% win rate.\ni think to stop flaming, it's better to focus on what you could do better rather than all the things your team did wrong.\nbut that doesn't matter bc that hashinshin guy got to challenger blaming his team","replies":[{"poster":"Sloth Almighty","date":"2016-08-31T03:30:11.986+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheOneUser,realm=OCE,application-id=T8eq2lFQ,discussion-id=HeEZuvWN,comment-id=0003,timestamp=2016-08-28T17:33:32.798+0000)\n>\n> league isn't a fun game (unless you're a troll)\n\nWell that's a bit presumptuous lol. I love playing league and find it very fun, win or lose. I also don't consider myself to be a troll nor have been accused of such","replies":[]}]},{"poster":"QAPLA","date":"2016-08-31T01:26:38.996+0000","up_votes":1,"down_votes":0,"body":"When we bastardise the name of Jesus, can we please use \"Jebus\", as actually appeared as a 'misprint' in early editions of the bible. Not Jusus, which is just crude.\n\nBy the way, although baptised, I am not a Christian. I accept Jebus as a prophet, not as the one true son of God and savior of mankind.","replies":[{"poster":"Icy Spectre","date":"2016-09-04T15:41:52.942+0000","up_votes":1,"down_votes":0,"body":"No, you call him Jizzus Crust, or you gtfo.","replies":[]}]},{"poster":"trolledallmylife","date":"2016-08-27T10:21:35.012+0000","up_votes":3,"down_votes":5,"body":"Best thing to do is uninstall this cancer + ebola + aids of a game now!\n\nRiot won't ever do anything serious to remove toxicity in this game as long as they are making money!\n\nTakes 10 sec to create a new account even if u get banned.\n\nUnless there is perma ip ban, nothing will change.","replies":[{"poster":"xDarkRavenx","date":"2016-08-27T11:02:48.832+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=trolledallmylife,realm=OCE,application-id=T8eq2lFQ,discussion-id=HeEZuvWN,comment-id=0002,timestamp=2016-08-27T10:21:35.012+0000)\n>\n> Best thing to do is uninstall this cancer + ebola + aids of a game now!\n> \n> Riot won&#x27;t ever do anything serious to remove toxicity in this game as long as they are making money!\n> \n> Takes 10 sec to create a new account even if u get banned.\n> \n> Unless there is perma ip ban, nothing will change.\n\nYour name suits you well.","replies":[{"poster":"Icy Spectre","date":"2016-09-04T15:41:05.135+0000","up_votes":1,"down_votes":0,"body":"If you downvote, he automatically wins.","replies":[]}]}]},{"poster":"DonkeyWhisperer","date":"2016-08-30T16:34:50.485+0000","up_votes":1,"down_votes":0,"body":"mate i know your pain trust me going from high gold to now high silver in such a short time i know the feeling of that mix,\nwhats been said playing with friends its a good way to enjoy the game i do the same thing if i find like im not having a fun due to toxic players and the worst kind of people toxic people toxic players who do terrible themselves and have to give advice. i generally tend to just not play anymore or do something else, nothing worse espically when playing rank when your trying to rank up you find yourself in a bad mood and you might be like hey c'mon man srsly? to your team\ni am no saint for not throwing abuse back to toxic players espically when you can clearly see they are retarded(pardon my language) and you and every1 knows it generally im the bigger smart ass and i have to hold my tongue not to crush em on the net cause it does ruin games.\nand eek the lower elos im finding from my recent elo drop yeh theres alot more toxicity in rank\n\n1 thing i do say to toxic silly players is clearly your not having a fun time playing the game so why play? quite frankly most toxic players are generally kiddos who havnt hit adult hood yet\n\nthe mute button and report button are the best tools and by far so much less of a headache trying to reason with some1 toxic as 99/100 times they are not as smart as you are and common sense cant be explained to em\n\nmake a new acc? righto so your telling me some1 is willing to waste so long to get a new acc to lvl 30? some1 who would just do that would just be on the game just troll matey i think thats 1 of the purpose of needing to hit lvl 30 so it you cant hit a ranked and getting banned and losing champs would actaully hurt some1 playing the game who enjoys it.","replies":[]},{"poster":"Vegathron","date":"2016-08-29T03:49:20.471+0000","up_votes":1,"down_votes":0,"body":"Heres my problem. when someone goes out of their way to annoy or acts selfish and doesnt care if they ruin it for the rest of the team (for example a support not building sightstone) i just get this loop in my head trying to imagine how they are thinking that they can be such assholes and what kind of person they must be to be so selfish. this goes round and round in my head and gets me EXTREMELY annoyed and thats how i mainly become toxic.\n\nif anyones got some tips for that id love to hear em","replies":[{"poster":"Gzen","date":"2016-08-29T04:23:48.317+0000","up_votes":1,"down_votes":2,"body":"Get on their level and troll with them, if they don't care about the game neither should you.","replies":[{"poster":"Gzen","date":"2016-08-29T04:24:27.363+0000","up_votes":2,"down_votes":2,"body":"Also a support not buying sightstone is not always trolling, Buy it yourself. Adapt.","replies":[]}]}]},{"poster":"Gzen","date":"2016-08-29T04:21:00.883+0000","up_votes":1,"down_votes":1,"body":"1. Don't type anything in-game. Maybe yell instead.\n2. Take a break from the game, or continue and accept your frustration.","replies":[]}]}