{"poster":"XZT DuroK","date":"2017-07-05T14:50:29.181+0000","title":"Ya no se que hacer...","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":3,"body":"Sinceramente estoy cansado, y ya no se que hacer, lo intente todo.\r\n Es agobiante quer&eacute;s mejorar, y subir de liga pero la comunidad es tan injusta que es imposible.\r\n Actualmente estoy atrapado en plata V y plata IV, ni pas&oacute; ni retrocedo de ahi.\r\n Muchas gu&iacute;as dicen que hay que mejorar farm, fijar objetivos, pensar antes de cada jugada, usar champs que domines bien, aceptar los errores, mirar los replays de tus jugadas.. etc, etc, etc...\r\n Bien, hice todo eso, pero qu&eacute; pasa con el resto?\r\nNo puede ser que el emparejamiento sea tan malo, y no es por hacerme el pro, pero siempre es la misma historia, flamers, AFK, gente que se suicida, gente que prueba champs en Ranked... Pero luego todos dicen &quot;No pierdes por culpa de tu equipo&quot; como no? S&iacute; en bot murieron 7 veces, el jungla no gankea, el mid no hace roaming..\r\n Luego dicen que no quieren fomentar el odio en la comunidad, y ojo, no estoy en contra de Riot, se que ellos no eligen quien avanza y qui&eacute;n no, estoy en contra de los ni&ntilde;os que se dedican a joder literalmente partidas de qui&eacute;n realmente quiere subir de liga.\r\nYo admito que hace un tiempo no era buen jugador y que merec&iacute;a est&aacute;n en ligas bajas, pero antes de que empiece la s7 comenc&eacute; a mejorar en todo aspecto, segu&iacute; concejos de profesionales, busque gu&iacute;as en el foro, use much&iacute;simo la herramienta de pr&aacute;ctica, y hoy, con 0 humildad, se que no estoy en la liga que merezco estar, y no soy el &uacute;nico, conozco un jugador excelente, que siempre sale bien en sus partidas, y est&aacute; en B III.\r\nHasta cu&aacute;ndo la comunidad t&oacute;xica va a seguir siendo m&aacute;s fuerte que la comunidad sana?\r\nPor que no sancionar realmente a la gente t&oacute;xica?\r\n Porque una sanci&oacute;n de 5 partidas en cola de baja prioridad no es una sanci&oacute;n.\r\n Est&aacute; semana me tom&eacute; la libertad de anotar cada cosa que pasaba en la partida, y haciendo c&aacute;lculos nada complicados, hay una estad&iacute;stica que de 5 jugadores, 3 son t&oacute;xicos.\r\n Hagan algo con esta gente por favor.","replies":[{"poster":"Hwaxinghz","date":"2017-07-05T16:07:20.373+0000","up_votes":1,"down_votes":0,"body":"Agregame y vemos que puedes mejorar.","replies":[{"poster":"vaVav","date":"2017-07-05T16:11:16.624+0000","up_votes":2,"down_votes":0,"body":"Vos me trolleaste la promo a Bronce 2","replies":[]}]},{"poster":"vaVav","date":"2017-07-05T15:36:14.835+0000","up_votes":2,"down_votes":0,"body":"Entré a tu perfil a ver que tal eres ejecutando los consejos que te dieron esas guías, y vi lo siguiente:\n\n> ##1. No farmeas\n\nCon los campeones que más juegas (Ashe, Lucian, Annie, Nasus, Viktor, MF y Ahri) no eres capaz de llegar a los 200 de farm. \n\nTe recomiendo practicar el farmeo, se que puede ser algo tedioso, pero realmente sirve hacerlo. Recuerda que el farmear se traduce en oro, este es items y estos son daño/resistencias que te llegarán a dar una gran ventaja.\n\n> ##2. No sacan objetivos\n\nEntre tus últimas veinte partidas, pude ver que en promedio sacan **1.5 Dragones** y **5.5 Torres** por juego. Números no muy lindos..\n\nTe recomendaría aprender de **Rotaciones** y **Split-Push**, y no solo la definición, mírate unos vídeos y usa lo aprendido en normales hasta que veas un progreso.\n\n> ##3. Pool champ\n\nEn cuanto a números, tienes buen porcentaje de victorias con tus mejores campeones, pero varías más de lo que deberías.\n\nSi realmente quieres subir, te aconsejo totalmente que te decidas por dos líneas only en las cuales uses dos o tres campeones exclusivamente. Irás aprendiendo a masterizar X campeones, verás tu progreso con los mismos y al tener más práctica podrás destrozar a tus rivales.\n\nNo elijas a cualquiera, mira el meta, aprende como funciona y elige acorde a este. Dominar un campeón es bueno, pero dominar uno fuerte es mejor.\n\n------------------------------------\n\nPor último, me gustaría que me digas como tomas decisiones tu, en qué piensas antes de cada jugada como dices. \n\nJugá tranquilo, divertite y aprendé, es lo más lindo que hay progresar así.\n\n¡Saludos!\n_-NovaIncipere_","replies":[{"poster":"XZT DuroK","date":"2017-07-05T16:08:34.459+0000","up_votes":1,"down_votes":0,"body":"Aprecio mucho las críticas constructivas, y te agradezco los concejos.\n En cuanto a tu pregunta, voy paso por paso.\n Priorizo Drake cuando se la ubicación del jungla enemigo, ya sea que este muerto o lejos de dragón, también cuando bot y mid no están en condiciones de ir a aportar.\n En cuanto al farm, obviamente no es perfecto, las estadísticas lo dicen.\n Jugando adc, depende si el soporte es agresivo o pasivo, y me acoplo a su estilo de juego, si tiene un buen CC como una leona, un Braum juego agresivo y focuseando a su adc.\nSí el soporte es un mago o alguien que aporte con bastante daño, pokeo de a poco junto con el soporte.\n Jugando de top, siempre estoy atento de las otras líneas para aportar con un TP. Y como jungla gankeo siempre a quien mira el mapa, está atento, y sabe como iniciar, muchas veces pasa que realizas un gank y tus compañeros no te ven por el mapa y te dejan solo...\n De todas formas, te tomaste el tiempo para mirar los estadísticas y de apoyarme, te lo agradezco mucho.","replies":[]}]},{"poster":"Crazy lyrics","date":"2017-07-05T14:57:38.483+0000","up_votes":2,"down_votes":0,"body":"usa un campeón con el que marques diferencia por ej para salir de plata yo use a viktor o riven con los que ganaba linea y podia romear\n","replies":[{"poster":"XZT DuroK","date":"2017-07-05T15:08:03.328+0000","up_votes":1,"down_votes":0,"body":"Gracias por el concejo, lo voy a tener en cuenta","replies":[]}]},{"poster":"PWG Raeghast","date":"2017-07-05T16:27:36.858+0000","up_votes":1,"down_votes":0,"body":"1) Eso de fijar objetivos aplica en ligas mas altas, en plata preocupate de matar 5615616951561 veces al laner rival para el minuto 15, hacelo que trollee, que flamee a su equipo, que se vaya afk.\n2) La toxicidad de la gente no esta directamente relacionada con su nivel de juego, para Diamond/Master/Challenger la cosa no cambia, sigue habiendo mucha toxicidad, pero el nivel de juego es mejor.","replies":[]}]}