{"poster":"RobbieFry13","date":"2016-09-20T05:59:24.856+0000","title":"This was new and Obnoxious","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"So Auto-fill has been on a lot lately when I am playing, which doesn&#039;t really bother me since I play mostly support.  Last night I got Jungle and thought sweet! finally something different. \r\nI almost missed it at first bc there were some other conversations happening in the chat, but Our support typed &quot;I go JG&quot;\r\nI replied no sorry but I do want that role to which he eloquently responded  &quot;I go JG&quot;\r\nHe typed that in a few more times and then since he had first pick he took Nocturne and assigned Smite. \r\nIt was late, likely would have been my last game so I skipped, but I feel like there must have been a better way to handle that situation.  Does any one have suggestions?","replies":[{"poster":"Sylas Dr3gb0urn3","date":"2016-09-20T12:18:34.482+0000","up_votes":2,"down_votes":0,"body":"The options you have are the options you pretty much always have in a League of Legends Champ Select gone bad: Carpe Diem!\n\nA.) You can allow them to have the role/take theirs. Carpe Diem!\n\n      a.) You can allow them to have the role/take theirs. From here, you can be happy with the support role and do your best, showing your support to him, by encouraging him as an ally player in the jungle, and being the best support you can be because after all, you did auto-fill to begin with. Carpe Diem!\n\n      b.) You can allow them to have the role/take theirs.  From here, you can be happy with the support role and do your best, showing your support to him, by encouraging him as an ally player in the jungle, by being the best support you can be and if it was really that big of a deal to you, even though you auto-filled to begin with, you may report him after, in the Unsportsmanlike category. When you do this, be sure to leave a note in the provided detailed section, of how the player was being Unsportsmanlike in champ select and how it affected your experience. Carpe Diem!\n\n      c.) You can allow them to have the role/take theirs.  From here, you can be unhappy with the support role, and troll and report him after. By doing this you become part of the problem, and are subject to being reported as well. When you do this, be sure to leave a note in the provided detailed section, of how the player was being Unsportsmanlike in champ select and how it affected your experience. Carpe Diem!\n\nB.) You can duo jungle, taking smite as well. Carpe Diem!\n\n      a.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and if he is from champ select on out sportsmanlike, you can work on opposite sides of the jungle and work together to make it work. Carpe Diem!\n\n      b.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and if he is from champ select on out Unsportsmanlike, you can work on opposite sides of the jungle and try to make it work. Carpe Diem!\n\n            1.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and if he is from champ select on out Unsportsmanlike, you can work on opposite sides of the jungle and try to make it work. From here, you can choose to report him under the Unsportsmanlike category. When you do this, be sure to leave a note in the provided detailed section, of how the player was being Unsportsmanlike in champ select, and how he was further Unsportsmanlike In-Game and how it affected your experience. Carpe Diem!\n\n            2.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and if he is from champ select on out Unsportsmanlike, you can work on opposite sides of the jungle and try to make it work. From here, you can choose to take some responsibility for the match, since you did in fact choose auto-fill and also chose to duo-jungle, and not report him. Carpe Diem!\n\n      c.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and you can try to out-smite him. Carpe Diem!\n\n           1.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and you can try to out-smite him. This is going to frustrate him or another ally. From this point, you can choose to Be sportsmanlike and happy with the practice of trying to out-smite a troll. Carpe Diem!\n\n                 A1.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and you can try to out-smite him. This is going to frustrate him or another ally. From this point, you can choose to Be sportsmanlike and happy with the practice of trying to out-smite a troll. From this point, you can choose to report him after the match under the Unsportsmanlike section.  When you do this, be sure to leave a note in the provided detailed section, of how the player was being Unsportsmanlike in champ select and how it affected your experience. Carpe Diem!\n\n                 A2.) You can duo jungle, taking smite as well. From here you can be happy with the duo jungle jungle role that you have now been provided and chose to take, and you can try to out-smite him. This is going to frustrate him or another ally, as one or both of  you are going to fall behind. From this point, you can choose to Be sportsmanlike and happy with the practice of trying to out-smite a troll. From this point, you can choose to take some responsibility for the match, since you did in fact choose auto-fill and also chose to duo-jungle, and also chose to try to out-smite a troll, and not report him. Carpe Diem!\n\n      d.) You can duo jungle, taking smite as well. From here you can be unhappy with the duo jungle jungle role that you have now been provided and chose to take, and you can troll the duo jungle role and report him after. By doing this you become part of the problem and are subject to being reported as well. When you do this, be sure to leave a note in the provided detailed section, of how the player was being Unsportsmanlike in champ select and how it affected your experience. Carpe Diem!\n\nC.) You can do what you did and dodge, reporting no one, he will go on to do the same thing to the next group of individuals, because he will learn nothing, and the people who are queued with him they may choose a negative response instead of a positive one, and you have become part of the problem, by passing the buck, and not the solution, but are not subject to being reported, as passing the buck is not a reportable offense. If you are a strong enough individual to withstand his Unsportsmanlike behavior, and can choose a positive reaction to the situation instead of a negative one, I don't recommend taking this option, if you are truly wanting to help end Unsportsmanlike behavior, because passing the buck, is part of the problem, not part of the solution. If you aren't a strong enough individual to withstand his Unsportsmanlike behavior, I STRONGLY recommend that you take this option and if this is your first dodge, you can re-queue in  5 minutes, so step away from the computer for a minute or find something else to do on your computer in the meantime, maybe join the boards and post this threads like this one to seek help or read up on your lore. Carpe Diem!\n\nD.) You can give him the jungle role, and if you are truly unhappy about being support, you can ask politely if any of the other 3 players remaining would exchange roles with you. Carpe Diem!","replies":[{"poster":"RobbieFry13","date":"2016-09-20T18:39:49.898+0000","up_votes":2,"down_votes":0,"body":"I really appreciate your positivity, and sincerely wish everyone in the queue could have your attitude towards the game. \nJust a few things to clarify, \n1- I didn't choose Autofill, it was on in the system be of a low number of users.\n2 - If he had asked me or at least responded with something other than \"I go JG\" I probably would have switched with him under the right circumstances, or been willing to double jg \n\nI guess the take away is that the only real option is to be the bigger person, play your best and when the match is over report the offending player for not playing their assigned role and communicating fairly & \neffectively if they had wanted to change that role.  Instead I got penalized, and he likely got what he wanted in the next queue.","replies":[{"poster":"Sylas Dr3gb0urn3","date":"2016-09-20T20:25:38.602+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RobbieFry13,realm=NA,application-id=ZGEFLEUQ,discussion-id=md4q7qkg,comment-id=00030000,timestamp=2016-09-20T18:39:49.898+0000)\n>\n> I really appreciate your positivity, and sincerely wish everyone in the queue could have your attitude towards the game. \n\nYou are welcome and I wish everyone else did as well.\n\n> Just a few things to clarify, \n> 1- I didn&#x27;t choose Autofill, it was on in the system be of a low number of users.\n\nWord, my misunderstanding. However, this factual information doesn't change the options above. Only YOUR outlook on them. NOT his actions or reactions to you and  your actions.\n\n\n\n> 2 - If he had asked me or at least responded with something other than &quot;I go JG&quot; I probably would have switched with him under the right circumstances, or been willing to double jg \n> \n> I guess the take away is that the only real option is to be the bigger person, play your best and when the match is over report the offending player for not playing their assigned role and communicating fairly &amp; \n> effectively if they had wanted to change that role.  Instead I got penalized, and he likely got what he wanted in the next queue.\n\nI understand that it's Insulting when someone is so selfish that they try to take that which is been given to you already, and on which they have no claim. Consider this though:\n\nAn angry student walks up to his teacher, in class and challenges him to a duel. Shouting insults, &quot;You&#039;re an old fool! You have no strength left! I will strike you down in one blow.&quot; But the teacher ignored him, and continued with his lesson, and when class was over the student left defeated and deflated with nothing. Another student approached the teacher when all the other students were gone and said, &quot;Teacher, why did you not take his challenge, why did you let him insult you?&quot;\nThe teacher responded, &quot;If someone brings you a gift and you do not take it, To whom does it belong?&quot; The student thought about it, and replied, &quot;It belongs to the one who offered it.&quot; The teacher said, &quot;It is the same with envy and insults: If you refuse to accept them, they belong to the one who offered them.&quot;\n\nDon&#039;t accept the toxic remarks or actions other summoners make. Do not even respond to them. Anything offered and rejected, belongs to the person offering it.\n\nYou have NO power over others actions. Only power over how you react to them. If you ignore and do not respond to them, then in the end, they are creating only their own negative experience. While it may be hurtful to HEAR, or SEE, you can remove the power from the words TOWARDS yourself and give it back to them. The old &quot;I&#039;m Rubber you&#039;re glue&quot;, that you all heard in elementary school was taught to you for a reason. That reason, is because it really does have power. It is the power of your own mind.\nDON&#039;T RELY ON THE LAW TO PROTECT YOU, IF YOU WONT EMBODY THE LAW!\nIF YOU WOULD SHINE LIKE THE SUN, FIRST YOU MUST BURN LIKE ONE. {{champion:89}} \nIf all else fail, don&#039;t forget the mute option.\nDON&#039;T PASS THE BUCK!{{champion:37}} \nKEEP YOUR FRIENDS CLOSE AND YOUR ENEMIES CLOSER. That&#039;s why good-natured trash talking in /all chat is so much fun.{{sticker:slayer-jinx-catface}} \nGo ahead, Run! I&#039;ll give you a 5 minute head start! {{champion:51}} \nBUT DON&#039;T FORGET TO KEEP YOUR FRIENDS YOUR FRIENDS, DON&#039;T MAKE AN ENEMY OUT OF AN ALLY.\nSolitude can be lonlier than death!{{champion:32}}","replies":[]}]}]},{"poster":"Kei143","date":"2016-09-20T10:42:53.093+0000","up_votes":2,"down_votes":0,"body":"do a double jungle comp where you play a heavy invade and ganking style, and start opposite sides of the map.","replies":[]},{"poster":"MUSHROOM MIDGET","date":"2016-09-20T07:34:19.287+0000","up_votes":2,"down_votes":0,"body":"you handled it the right way.  \n\nthe other best way is to take jungle too and practice your outsmiting and report him after.  but that usually doesnt lead to a win and the report can not reliably lead to any punishment.","replies":[]},{"poster":"Geauxx","date":"2016-09-20T06:24:26.325+0000","up_votes":2,"down_votes":0,"body":"Tbh, you handled it the least stressful way to do, the other way would have to be report him after the game.\n\nThere's not really anything you can do outside of reporting it.","replies":[]},{"poster":"JRobin31","date":"2016-09-20T21:22:11.446+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RobbieFry13,realm=NA,application-id=ZGEFLEUQ,discussion-id=md4q7qkg,comment-id=,timestamp=2016-09-20T05:59:24.856+0000)\n>\n> So Auto-fill has been on a lot lately when I am playing, which doesn&amp;#039;t really bother me since I play mostly support.  Last night I got Jungle and thought sweet! finally something different. \n> I almost missed it at first bc there were some other conversations happening in the chat, but Our support typed &amp;quot;I go JG&amp;quot;\n> I replied no sorry but I do want that role to which he eloquently responded  &amp;quot;I go JG&amp;quot;\n> He typed that in a few more times and then since he had first pick he took Nocturne and assigned Smite. \n> It was late, likely would have been my last game so I skipped, but I feel like there must have been a better way to handle that situation.  Does any one have suggestions?\n\nYou can open a ticket with support to get him punished even though you left champion select.  Do that and you will have handled the situation even better!\n\nPersonally, I don't care if someone in first pick tries to \"steal\" my role.  If I say no, then he can't have it.  He can dodge if he wants.  It's his problem not mine because my philosophy is centered around self-improvement instead of winning or losing particular games.  His decision to double jungle would simply present me with an opportunity to learn more about how double jungling works.  His decision doesn't stop me from trying to win the game and he can expect me to answer NO to all of his surrender votes until the enemy Nexus falls.  I get players in my games all the time that feed or AFK or do weird unhelpful stuff.  I don't really differentiate this behavior from that.  I focus on improving my best game and that includes learning how to carry bad teammates.  As a result of my philosophy, I rarely intentionally dodge champion select.  In fact, I can't remember the last time I deliberately dodged a game.  But that doesn't mean you have to stick it out.  You are perfectly fine to dodge the occasional game.","replies":[]}]}