{"poster":"sanisa","date":"2019-10-05T20:06:50.777+0000","title":"Invasión Runica capitulo 67","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":0,"body":"Bryce y los mercenarios se estaban haciendo cargo de los ninjas y de las criaturas que habían aparecido de repente, Jhoni por su lado se sentía imponente al no poder hacer nada para ayudar, *un ciego al cual le falta un brazo no puede ayudar en combate*, eso eran los pensamientos de Jhoni, el cual no pudo hacer mas que quedarse en el escondite al cual Bryce lo había llevado.\r\n\r\nOrnulu: Quieres ayudar, no es así?\r\nJhoni: Claro que quiero!... pero...\r\nOrnulu: Mira, no voy a dar vueltas, puedo ver que no son solo ninjas, sino también esas criaturas, concéntrate, son almas vacías, pueden sentirlas, cierto?\r\nJhoni: ... Si...\r\nOrnulu: Bien, mira, puedo ayudarte a tener algo parecido a vista, no vas a perder tu ceguera, y esta es solo una solución temporal, pero, si lo aceptas, seras mas útil de lo que eres ahora.\r\nJhoni: ... Acepto.\r\n\r\nTras aceptar el trato, Ornulu colocó sus manos en los ojos de Jhoni, el cual, a pesar de tener su venda, era capaz de ver siluetas, de sentir los obstáculos de su entorno.\r\n\r\nJhoni: Puedo... puedo ayudar.\r\n\r\nSin perder tiempo, Jhoni salío de su escondite tropezando con algunos objetos salio del lugar de comida, afuero pudo sentir la desesperación de la gente, el valor de algunos otros, la sed de sangre de algunos ninjas, y los corazones vacios de las criaturas, Jhoni entonces, luego de unos segundos de analizar su entorno, creo una serie de tentáculos, con los cuales acabo con la vida de las criaturas, Bryce por su lado, rápidamente corrió hacía Jhoni.\r\n\r\nBryce: Jhoni?! Jhoni!! puedes ver? - Dijo emocionado y confundido al ver que su amigo aun traía la venda -\r\nJhoni: Mas o menos, no del todo, no importa, que esta ocurriendo?\r\nBryce: Las criaturas esas también aparecieron, están atacando a todos, excepto a los ninjas, no se que esta ocurriendo, pero, debo reunir rápido a mi escuadrón, crees que podrán manejartelas solo? - Dijo de forma apresurada -\r\n\r\nMientras Bryce hablaba, Jhoni podía sentir como los mercenarios mataban a todos los ninjas y a las criaturas, eran unos 6, los cuales sin problema alguno estaban sobreviviendo al repentino ataque.\r\n\r\nJhoni: ... No, pero descuida, no estoy solo, pero, tengo un plan, tendrás alguna forma de encontrarme si nos separamos?\r\nBryce: Creo que si, podría ubicarte si usas una excesiva cantidad de magia, pero si hay algún enemigo que también pueda hacerlo, podrías quedar expuesto.\r\nJhoni: Eso no importa, escucha, en 15 minutos tu escuadrón y el mío se van a reunir en el mismo punto, entendido?\r\nBryce: Tienes un escuadron?... No importa, muy bien, 15 minutos Jhoni, no podre darte mas tiempo, tengo un objetivo aquí y debo cumplirlo.\r\n\r\nTras decir esto, Bryce desapareció, dejando solo a Jhoni el cual uso su nueva \"vista\" para ubicar a los mercenarios, intento correr hacía ellos, pero repentinamente cayo al suelo.\r\n\r\nJhoni: Q-que...\r\nOrnulu: Estas cansado, es normal, te lo dije, no puedes usar esta clase de poder a la ligera.\r\nJhoni: ... N-no...\r\n\r\nJhoni, con la poca fuerza que tenia, se puso de píe, relajo esa vista, era mas difícil para el ubicar las cosas ahora, apenas podía sentir sus alrededores, y sus objetivos ahora estaban mas lejos y eran menos localizables, Jhoni ignoro este detalle y comenzó a correr hacía ellos, tropezó con algunos objetos y recibió algunas heridas, mató a unas pocas criaturas y huyo de otras, finalmente fue rodeado por un escuadrón de ninjas, pero estos fueron rápidamente derrotados por un ataque en área alrededor de Jhoni,  el cual era una serie de sombras sin forma que los dejaron inhabilitados el tiempo suficiente para que Jhoni corriera, al final, logro llegar al grupo, y les dio un grito.\r\n\r\nJhoni: Lewis!!!\r\n\r\nEse grito hizo que los mercenarios voltearan a ver a un Jhoni levemente herido y cansado, rápidamente el gigante y la chica fueron a \r\n\r\nGigante: Chico, estas bien? - Dijo preocupado -\r\nJhoni: No importa, ustedes, ustedes tienen una forma de encontrar a Kiros, no es así?\r\nGigante: Y tu como sabes eso? - Dijo con un tono de duda -\r\nJhoni: No importa, necesito ir con el.\r\n\r\nTras escuchar la petición de Jhoni, ellos rápidamente dieron una respuesta.\r\n\r\nChica: Bien, iremos tu y yo, ellos tienen que hallar al jefe.\r\nJhoni: Muy bien, no tenemos tiempo que perder, andando.\r\n\r\nLa chica y Jhoni pasaron varios minutos en el camino hacía Kiros, Jhoni de tanto en tanto caía el suelo del cansancio, pero rápidamente se reincorporaba, aunque mas débil, apenas y podía enfrentarse a las criaturas, y los ninjas casi lo matan, la chica varias veces lo salvo del peligro, finalmente, luego de varios minutos, Jhoni pudo escuchar el grito de Talía.\r\n\r\nTalía: Maestro!!\r\n\r\nEsta estaba al lado de Kiros, un Puma, y varios soldados de Ionia.\r\n\r\nTalía: Maestro! Esta bien? Donde esta Bryce?! Quien es ella? - Hablaba muy rápido, tenia un tono preocupado, pero al fijarse en la chica, pregunto con curiosidad -\r\nJhoni: Ella es una mercenaria de Lewis, pero eso ahora no importa, pudo sentir a varios sujetos allá, pero...\r\nTalía: Son soldados de Ionia.\r\nJhoni: Ya veo, bien, supongo que este es un punto seguro.\r\nTalía: Estan trayendo a todos los civiles aquí, a los soldados los esta comandando Kenen, pero algunos civiles que salve me están siguiendo a mi, me siento toda una general. - Dijo esto ultimo con un tono bastante emocionado -\r\nJhoni: Felicidades, ahora solo debemos esperar, Bryce debería de llegar en cualquier-\r\n\r\nBryce finalmente había llegado, traía consigo a dos miembros de su escuadrón, sin decir palabra alguna, nuevamente se fue.\r\n\r\nMiembro: El capitán dijo que esperáramos ordenes de usted. - Dijo refiriéndose a Jhoni -\r\nJhoni: Bien, escuchen, mantengan esta área segura, protejan a los civiles, esta claro?\r\nMiembro: Si teniente - Tras decir esto, con unas cadenas que salieron de sus manos, se ubico en el terreno elevado, y desde allí empezó a matar a las distintas criaturas, mientras el otro se ubico en tierra, y con sus manos empezó a arrojar lo que parecían ser esferas de energía, con las cuales noqueaba a las criaturas, poco a poco llegaban mas miembros del escuadrón, finalmente, al llegar todos, Bryce empezó a hablar sobre su misión.\r\n\r\nBryce: Bien, este parece un lugar seguro, ahora escucha, Jhoni, mi trabajo aquí era cuidar a las criaturas a las que capturamos aquel día en las primeras incursiones , están aquí en Ionia, debo ir por ella.\r\nJhoni: Entiendo, por favor, déjame ir contigo, no puedo dejarte ir solo, si estas criaturas están aquí, tal vez sea por eso.\r\nBryce: Es probable, tambien puedes equivocarte, pero no hay tiempo para discutir, ¡¡Lira!!\r\n\r\nTras este grito, uno de los miembros del escuadrón había aparecido frente a Jhoni y Bryce.\r\n\r\nBryce: Lira, necesito transporte, tenemos que ir a las celdas de las criaturas.\r\nLira: Entendido capitan, denme sus manos.\r\n\r\nBryce y Jhoni tomaron cada uno una mano de la chica, luego de esto, los 3 desaparecieron... pocos segundos después, reaparecieron detrás de los que parecían ser Shen, y una mujer muy parecida a Akali, pero parecía verse mayor que la de sus splash art, y ambos parecían estar peleando.\r\n\r\nLira: Jefe, creo que debo retirarme. - Dijo con un tono serio, pero aparentemente asustado -\r\nBryce: Ve, informa a los demás lo que esta ocurriendo.\r\n\r\nLira desapareció.\r\n\r\nJhoni: Y puedo saber exactamente que esta ocurriendo.\r\nBryce: Shen y una version mas madura de Akalí estan en frente de nosotros peleando con Zed... Kryla, y una especie de lobo, pero es mas... monstruoso, y no parece que les este yendo muy bien.\r\n\r\nKryla: Bueno bueno, que tenemos aquí, ambos maestros de las sombras reunidos en un solo lugar.","replies":[]}