{"poster":"sanisa","date":"2019-07-24T18:01:11.577+0000","title":"Invasión Runica capitulo 57","subforum":"Creaciones de la comunidad","up_votes":2,"down_votes":0,"body":"Jhoni y su grupo entraron en las catacumbas sin ser detectados, la primera habitación por la que pasaron estaba totalmente vacía, pero al adentrarse mas y mas, se encontraron con unas instalaciones con tecnología sorprendente-mente avanzada, las criaturas allí no eran nada parecidas a las que enfrento Jhoni, estos parecían mas organizados, mas inteligentes, eso era algo mucho mas aterrador que las criaturas brutales y sin cerebro, Jhoni y su grupo continuaron movilizándose usando sus habilidades, luego de unos minutos de moverse sin ser detectados, llegaron a las celdas, era una habitación, pero esta tenia una entrada cuidada por dos guardias, así como un pasillo lleno de guardias, entonces el grupo se reunió en una zona oscura del laboratorio, empezaron a susurrar su situación.\n\nVastaya reptil: Y ahora que?\n\nJhoni: Estoy pensando, pero ustedes también pueden tener ideas, no los detendré.\n\n Vastaya felino: Y si buscamos una sede central para abrir todas las celdas de golpe?\n\nJhoni: Suponiendo que existe, es lo mejor, pero yo supuse que la idea de que serian celdas de acero, que nos bastaría con destruir las rejas y ya, pero teniendo en cuenta su tecnología, tal vez es lo mejor, pero tenemos que conseguir mas información... *Observa a las criaturas* alguno debe tener información, pero no tengo idea de como saberlo... demonios, este plan apesta, debi dejar que algún otro intentara hacer alg-\n\nJhoni recibio una bofetada de una Vastaya reptil, cosa que no se escucho gracias a que fue con el puño cerrado.\n\nVastaya reptil: No pierdas la calma, era imposible saber que ocurría adentro, necesitábamos parte de un plan, y la tenemos, ahora debemos completarlo, ok?\n\nJhoni: ... S-si, perdón, me altere... Muy bien... Ornulu, crees que puedes explorar las instalaciones buscando alguna pista con la que nos puedas ayudar?\n\nOrnulu: ... Solo porque aun no se viene lo interesante, y quiero que esto avance.\n\nJhoni: Muy bien, somos 5,  nos dividiremos en 3 grupos, ustedes hagan pareja con alguien, intenten buscar la mayor cantidad de información posible, pero vamos a implementar ahora mismo una regla, sin importar lo que le pase a cualquier prisionero o a nosotros, no vamos a revelarnos hasta que todos los prisioneros sean liberados, entendido?\n\nLos Vastaya lo miraron con cierta duda, pero luego de unos segundos ellos accedieron, rápidamente formaron las parejas y desaparecieron, Jhoni por su lado se quedo vigilando el pasillo, en cierto punto notó que los guardias habían reducido su numero.\n\nJhoni: ... Muy bien, espero que sirva.\n\nJhoni apunto hacia los guardias con sus manos, de las cuales salieron unas esferas de energía oscuras, las cuales, lograron llegar al lado de un guardia, este la noto en el ultimo segundo, pero de la esfera de energía salio un tentáculo que mato al instante al guardia, lo mismo ocurrió con los demás guardias, luego de que cayeran todos, Jhoni intento ponerse de pie para ir a la puerta, pero su cuerpo cayo al suelo del cansancio.\n\nJhoni: M-maldición.\n\nJhoni, a duras penas apoyándose de una pared camino hasta la puerta principal, la cual estaba abierta.\n\nJhoni: **Supongo que tiene sentido que no la cerraran, se supone que están en una base secreta bajo tierra, y encima estas celdas son custodiadas por varios guardias**\n\nJhoni rápidamente logro ver como el lugar estaba lleno de celdas, al acercarse logro ver como estas tenían a los vastaya adentro, Jhoni entonces observo detenidamente las celdas, logro ver que estas estaban selladas con energía, y rápidamente dedujo que si necesitaba encontrar un puerto de control para abrirlas, entonces Jhoni salio caminando de esa habitación.\n\n\n\n- Vastaya reptil y Jaga -\n\nAmbos estaban usando sus habilidades para observar el interior de algunas de las habitaciones, en algunas parecían cámaras criogenicas, otras armerías, y sucesivamente terminaron viendo distintas habitaciones mientras se adentraban a lo mas profundo de las catacumbas, finalmente lograron llegar a la que parecía ser la habitación con el puerto de control, pero esta estaba siendo custodiada por dos guardias similares a Cekyc, aunque no eran tan grandes, y no tenían armas, los Vastaya decidieron no arriesgarse y volver a su ubicación anterior luego de haber descubierto la posible clave.\n\n\n\n- Ornulu -\n\n\n\nOrnulu estaba flotando atravesando las paredes viendo cosas que le interesaban, las formas de estas criaturas, su tecnología, la aparente falta de magia en estas catacumbas, entonces notó una roca grande, custodiada por unos cuantos guardias similares a Cekyc, Ornulu paso de largo, bajando bajando, termino llegando a una habitación gigante, a diferencia de las demás que tenían el tamaño normal para que cruce algo como un humano, o algo que sea un poco mas grande, este lugar era colosal, allí Ornulu pudo sentir la energía maligna de un científico en particular, pero entonces logro sentir la energía de la criatura colosal de este jardín, Ornulu simplemente le resto importancia y empezó a flotar hacia los científicos, allí vio la sala con la cual estaban monitoreando todo, desde el jardín gigante hasta las celdas, entonces Ornulu noto antes que el guardia que misteriosamente había muerto, rápidamente Ornulu colocó su mano dentro del cuerpo del asistente, y como si se hubiera materializado, uso su mano para aplastarle el corazón, cosa que lo mato al instante, y uso unas cuantas sombras que esparció en el interior de su cuerpo para simular que se movía, asiendo que no llamara la atención.\n\nOrnulu: Ese imbécil me debe una enorme.\n\nOrnulu entonces hizo que la pantalla que mostraba las celdas volviera en el tiempo, mostrando grabaciones anteriores.\n\nOrnulu: No me puedo creer lo simple que es esto, supongo que los conocimientos de Jhoni del sony vegas servirán para algo.\n\nOrnulu mientras hacia esto escucho una conversación de los demás asistentes.\n\nAsistente 1: Oye, los científicos están yendo a las celdas del nivel 2, ábrelas.\n\nAsistente 2: Entendido.\n\nOrnulu rápidamente termino con lo del asistente muerto para prestar atención al como abrían las jaulas, viendo que el asistente 2 usaba esa computadora, y con un no muy complicado sistema abriría las celdas de ese nivel.\n\nOrnulu: No se ve muy dificil.\n\n\n\n- Vastaya del exterior -\n\n\n\nCesar: Creo que ya esta lo suficientemente oscuro, creo que ya es hora.\n\nRakan: Tienes razon, solo podemos confiar y esperar, pero debemos hacer nuestra parte.\n\nLuego de esta breve charla Rakan, Cesar y otro puñado de Vastaya empezar a atacar la entrada principal de las catacumbas.\n\n\n\n- Grupo de Jhoni -\n\nTodo el grupo estaba reunido en alguna parte, exceptuando a Ornulu.\n\nJhoni: Bien, pude verificar lo que dijeron, y si, se necesita de un puerto principal para abrir las celdas.\n\nOrnulu: Llegue justo para mencionarte eso.\n\nMientras Jhoni hablaba, Ornulu atravesó el suelo apareciéndose de repente.\n\nOrnulu: Descubrí como abrir las celdas, pero tendrás que ir a lo mas bajo de este lugar.\n\nOrnulu le explica a Jhoni las cosas que vio.\n\nJhoni: *Saca el mapa del lugar* Podrías especificar donde es?\n\nOrnulu le señalo a Jhoni los lugares que vio, desde la roca, el jardin y el lugar para abrir las celdas.\n\nJhoni: Bien, eso cambia las cosas, y me da un plan, bueno, dos deben ir a esta habitación y destruir la roca que esta ahí.\n\nVastaya reptil: Por que? Que es esa cosa?\n\nJhoni: Es el centro de energía del laboratorio, si lo destruimos, acabaríamos con la energía de este lugar.\n\nVastaya felino: Pero nosotros no nos quedaríamos encerrados? o no podríamos no abrir las celdas?\n\nJhoni: Teniendo en cuenta que este lugar esta mas vigilado, después de todo yo ya destruí una de estas y se lo importantes que son.\n\nTras dar una explicacion del plan, se dividieron en 2 grupos, Jhoni iría con la vastaya reptil hasta la central, y los otros 3 se encargarían de la roca, entonces fue que sintieron un estruendo desde arriba.\n\nJaga: Debe ser que el grupo 2 ya inicio su ataque.\n\nJhoni: No pudo ser en mejor momento, tal vez eso alerte a las criaturas y abandonen este lugar para combatir afuera, pero eso por ahora no nos preocupa, andando.\n\nJhoni y su grupo empezaron a seguir el camino para llegar hasta la central, y hasta la roca.\n\n\n\n- Con los científicos -\n\nAmbos científicos habían vuelto a entrar en la misma habitación por la que observaban el jardín.\n\nCientífico 1: Con solo 1 de esos Vastaya rindió para iniciar la creación de cientos de B1, es una pena que prioricen la cantidad a la calidad, podrían ser buenas mascotas si se los aprovechara al máximo.\n\nCientífico 2: Pero ya te haz dado demasiados lujos, fue demasiado enviar un grupo de Vastaya, sino que preparaste todo para enviar un segundo grupo,\n\nCientífico 1: Cuando esta criatura alcance su máximo potencial con la muestra que acabo de enviar, ya veras como el jefe me lo agradece, ademas, los Vastaya que no logramos capturar están allí arriba, podremos compensar luego las perdidas. - Se oye el sonido de un ascensor - Mira, el espectáculo ya va a-\n\nEl monologo del científico fue rápidamente interrumpido con el repentino ataque a la puerta, Jhoni y la Vastaya habían aparecido repentinamente en la central, los científicos miraron con asombro como el famoso Yin había logrado colarse en las instalaciones sin ser detectado, Jhoni por primera vez los vio, se horrorizo al ver como estas criaturas tenían una forma tan humana y animal, a diferencia de Kryla que mantenía ciertos rasgos, estos parecían humanos mecanizados, pero Jhoni rápidamente le restó importancia al ver que la Vastaya se les abalanzo y los noqueo, luego de que estos dos cayeran, se prepararon la vastaya y Jhoni para atacar a los demas, pero todos ellos ya estaban muertos.\n\nJhoni: ... **Ornulu? ¿El es capaz de hacer esto?** Jhoni intento sacarse ese tema de la mente al ver la computadora que Ornulu había definido anteriormente, Jhoni siguió los pasos que Ornulu le indico, y finalmente pudieron ver a través de un monitor como las celdas se habrían, Jhoni y la Vastaya estaban por escapar, pero finalmente escuchar el ascensor, el cual abrió sus puertas, dejando ver a un gran numero de Vastaya, de los cuales Jhoni pudo sentir angustia, miedo, ira e impotencia, pero lo que sintió y vio junto a los vastaya fue peor, una colosal criatura de 20 metros, que lentamente caminaba hacia los Vastaya, la reptil estaba horrorizada al ver a una criatura tan grande con un aspecto tan retorcido.\n\nJhoni: Ve con los demás. - Dijo con un notorio miedo en su voz -\n\nReptil: De que hablas?\n\nJhoni no dio ninguna respuesta, y con un salto, y su cuerpo envuelto en sombras para evitar el daño de la caída y el corte de los vidrios, de un salto rompió el vidrio en frente suyo para llegar hasta el jardín, poniéndose entre el grupo de Vastaya y la criatura colosal, el ojo de Jhoni cambio a su respectivo color oscuro, y unas cicatrices invadieron gran parte de su cara, al mismo tiempo de una de sus manos empezaron a salir unas marcas oscuras en su brazo, entonces, sin voltear ni dirigir la palabra a nadie Jhoni creó una especie de pared para que los Vastaya subieran hasta el vidrio que acababa de romper, les ordeno a los Vastaya que subieran, luego de esto Jhoni uso sus manos para generar unas gigantescas lanzas que perforaron el cuerpo de la criatura, entonces estas lanzas se convirtieron en sogas que estaban incrustadas en el suelo,  aparentemente haciendo que la criatura no se moviera.\n\nJhoni: SALGAN DE AQUÍ AHORA!!!\n\nLuego de ver la demostración de poder de Jhoni, no dudaron y corrieron hacia la pared y la escalaron, mientras esto sucedía, la criatura tensaba sus músculos, lo cual era suficiente para destruir las sombras de Jhoni, a lo cual Jhoni respondía creando nuevamente tentáculos, lanzas, cuerdas, pero cada vez era mas débil, pero la criatura no hacía ni el intento por avanzar, solo jugaba con los poderes de Jhoni, entonces, al ver que ya la mitad había escapado, la criatura inmediatamente regenero sus heridas, entonces Jhoni hizo el intentó de huir por la misma pared por la que habían huido casi todos los Vastaya, pero la criatura uso su ala, la cual era de su mismo tamaño, y le bloqueo el camino a Jhoni, al mismo tiempo le dio un golpe con su ala que lo mando a volar, chocando contra una pared, al mismo tiempo la pared que Jhoni había creado se desvaneció, dejando caer a la ultima Vastaya, la cual parecía una niña felina, con orejas de zorro y cuatro colas, la criatura no le dio importancia y Jhoni no la vio, la criatura se lanzo contra Jhoni, intentando usar sus garras para atravesar a Jhoni, pero este uso un tentáculo que salio de su manga para esquivarlo, de la misma forma que intento columpiarse con los piratas durante el abordaje, hizo lo mismo ara esquivar el ataque, a duras penas se puso de píe, entonces intento nuevamente lo de las lanzas, pero esta vez estas se trababan en la piel del coloso, dejando impactado a Jhoni al ver que sus lanzas se quebraban como si de simples ramas de tratara al intentar atravesar la piel del coloso, el cual se quedo parado unos segundos viendo a un Jhoni increíblemente cansado, con sangre en su boca y que apenas podía mantenerse de pie, pero tenia una mirada desafiante hacía el coloso, el cual apunto con su dedo garra hacia Jhoni, el cual rápidamente creo una barrera para intentar prevenir cualquier ataque, la criatura entonces le apunto con sus dedos, y de repente una garra del gigante salió volando hacia Jhoni, rompiendo en pedazos la barrera y atravesando a Jhoni en el estomago, dejando un agujero enorme donde antes estaba su estomago, el impulso de la garra fue tal que se llevo el cuerpo de Jhoni y lo dejo clavado en la pared, el silencio invadió el jardín durante unos segundos, la criatura no se movía ni un centímetro, solo se quedo observando el cadáver inerte de Jhoni, el cual a cada segundo que pasaba se desangraba cada vez mas y mas, la criatura entonces empezó a caminar hacia este cadáver, pero de repente se pudo escuchar un desgarrador grito proveniente del escondite de la Vastaya.\n\nNiña: NOOOOOOO!!!!!!","replies":[]}