{"poster":"sanisa","date":"2017-11-28T18:52:15.807+0000","title":"Capitulo 6 una mesa, una tienda","subforum":"Creaciones de la comunidad","up_votes":5,"down_votes":1,"body":"**Capitulo 6**\r\n\r\n\r\nEl polvo se estaba disipando, las ratas contemplaban como el polvo desaparecía poco a poco de la tienda.\r\n\r\nRata: squeak squeak (yo gane)\r\nOrnulu: ya quisieras\r\nPeter: y bien, quien gano?\r\nLeo: no quiero arruinar la sorpresa :)\r\n\r\nEl polvo se termino de disipo y la mayoría de los presentes esperaban\r\nimpacientemente el saber quien fue el ganador.\r\n\r\nJhoni: …\r\nDerek: …\r\nJhoni: jeje… gane\r\nDerek: … je, felicidades.\r\n\r\nLuego de que todo el polvo se disipara se logro ver claramente que el ganador\r\nfue Jhoni, el cual, sin darse cuenta, las marcas de su brazo empezaron a\r\ndesaparecer, así como el fuego de Derek.\r\n\r\nPeter: entonces tu vas primero?\r\nJhoni: parece que si :D\r\nPeter: Esta bien, ven conmigo.\r\n\r\nDijo señalando la puerta de la que el había salida. Ambos sin decir nada\r\nempezaron a caminar.\r\nDerek, solo miraba la escena en silencio.\r\n\r\nDerek: ...\r\n\r\nLeo, mirando a Derek con una sonrisa picara dijo\r\n\r\nLeo: Celoso?\r\n\r\nY Derek solo se quedo en silencio mientras tanto con las ratas\r\n\r\nRatas: squek\r\nOrnulu: Ok, toma\r\n\r\nJhoni y Peter ya se habían ido a la habitación, era un cuarto vació con nada\r\nmas que dos sillas y una mesa en el centro de ella.\r\n\r\nPeter: Muy bien, sientate aquí.\r\nLe dijo, señalando una de las sillas, mientras el se sentaba en la otra.\r\nJhoni: Ok\r\n\r\nDijo esto sin una pizca de duda Peter puso su brazo en la mesa en posición para hacer pulseadas, Jhoni no entendía nada, pero sin decir nada, puso su mano en la misma posición para empezar las pulseadas con el.\r\n\r\nPeter: Muy bien, cuando diga ya, empezaremos, 1 2 3 ya\r\n\r\nAmbos empezaron a hacer fuerza intentando ganarle al otro, entonces del\r\ncentro de las manos de ambos, salio una luz, la cual envolvió toda la\r\nhabitación…","replies":[{"poster":"Gish","date":"2019-08-09T16:16:17.413+0000","up_votes":1,"down_votes":0,"body":"https://m.imgur.com/gallery/Fhaoy","replies":[]}]}