{"poster":"Gebudsan","date":"2016-11-13T14:02:24.911+0000","title":"Neue Flex Einstufungen unzumutbar","subforum":"Ligen & gewertete Spiele","up_votes":3,"down_votes":2,"body":"Liebe Mitspieler und Riot Mitarbeiter, \n\nich bin eigentlich wirklich kein Spieler der sich beschwert oder meint er h&auml;nge in einer Elo Hell fest... aber die neuen Einstufungen in der flex Queue sind wirklich &auml;rgerlich. Ich bin kein super toller Spieler, schwanke immer so zwischen S5 und S3. Aber nun bin ich in Bronze 5 und das macht wirklich keinen Spa&szlig;! jedes zweite Spiel leaved ein Spieler.. weil ist ja eh nur B5, macht man ja nur zum Spa&szlig; und wenn Mama dann zum Essen ruft muss man wohl gehen. \nAber mal ehrlich, ich spiele als Main ADC und bin deshalb mehr als jede andere Position von meinen Mitspielern und insbesondere von meinem Supp abh&auml;ngig. Ich hatte jetzt bereits mehrere Spiele wo mein Supp nicht mal ne Key masterie hatte. Vorletztes Spiel hat mein Supp (Kayle) innerhalb von 31 Min KEINE Ult benutzt und im gesamten Spiel 799 Schaden an Champions gemacht. \nJeder f&auml;ngt mal klein an und deshalb habe ich auch theoretisch kein Problem mit schlechten Spielern auf niedrigen Elos aber wenn man erfahrenere Spieler ohne erkennbaren Grund dort hinein steckt finde ich das sehr fraglich und es nimmt einem den Spa&szlig; am Spiel. \nIch werde mich da wie ich es immer getan habe wieder heraus arbeiten aber ich denke dass ihr solltet ihr nochmal so eine krasse Abstufung machen viele Spieler verlieren werdet, &uuml;berdenkt dies nochmal. \nEs ist als sei ich ein Maurer gewesen der H&auml;user baut und nach dem neuen System habt ihr mich wieder mit ner Schaufel in die Sandkiste gesetzt um Sandburgen zu bauen... das macht keinen Spa&szlig;. 1-2 Divisionen verlieren, okay, aber 6 Divisionen... finde ich doch sehr sehr hart. Vor allem weil der Unterschied zwischen Silver und Bronze viel krasser ist als z.B. zwischen Silver und Gold oder Gold und Platin. ","replies":[{"poster":"EU Jungler Nr 1","date":"2016-11-13T15:09:50.832+0000","up_votes":2,"down_votes":0,"body":"Also ich war ende der Season Platin 3 und mein Kollege Gold 1\n\nEr hat 6Spiele gewonnen und 4 Verloren und wurde in Bronze 1 eingestuft. Ich hingegen habe 7 gewonne und 3 Verloren und wurde in Platin 5 eingestuft. Also die diverens zwischen Bronze 1 und Platin 5 sind schon sehr heftig, dafür das er nur 3 Divisionen unter mehr war und 1 game mehr verloren hat als ich.\n\nMuss auf jedenfall überarbeitet werden !!!!!","replies":[]},{"poster":"DeadDia","date":"2016-11-13T14:11:21.613+0000","up_votes":2,"down_votes":0,"body":"das gleiche bei mir, ich habe bei der Bewertung 5/5 gewonnen und bin b5 gekommen.","replies":[]},{"poster":"Δπσπψωσυș","date":"2016-11-14T10:52:26.792+0000","up_votes":1,"down_votes":0,"body":"Wurde S4 eingestuft, war D5 SoloQ. 14 Divisionen niedriger. Bin schon wieder Gold 4. Mit 30LP pro Sieg geht's recht flott. Aber Spaß macht es nicht Low Elos zu stompen...","replies":[]},{"poster":"RHP Shanks","date":"2016-11-14T10:11:55.398+0000","up_votes":1,"down_votes":0,"body":"Die flex q hatt die elo von euren teammrankeds ges genommen habt ihr keine teamrankeds gespielt ist es klar das ihr weit unten landet.\nAuser dem wenn die soloq raus kommt dann wirds spannend und man muss nicht immer mit gegen 5pre spielen während man nur randoms hatt^^\nalso nicht den kopf hängen lassen","replies":[]},{"poster":"Vweldar","date":"2016-11-13T16:16:14.072+0000","up_votes":1,"down_votes":0,"body":"aber wenns auf deinem team 4 randoms gibt und im gegner team 5 is es doch wahrscheinlicher bei den gegnern dass sie einen troll haben? auserdem ist dies ziemlich normal. auch bei den soloq placements.","replies":[]},{"poster":"Stinkakeksz","date":"2016-11-13T14:27:02.202+0000","up_votes":1,"down_votes":1,"body":"Ich habe 8/2 gespielt und wurde Platin 5 eingestuft.\n\n\n\nIhr müsst verstehen das die Flex Queue eine kompletter reset der elo ist . Da kann theoretisch Challenger gegen bronze spielen( die ersten Spiele) je häufiger ihr gewinnt desto früher bekomm ihr eure \"normale elo\" \n\nWenn ihr silber niveau spielt seit ihr wahrscheinlich nich in der Lage gegen die Gold etc Leute zu carrien und werded somit tiefer eingestuft. \n\nJetzt wo ihr Bronze seid dürftet ihr ( wenn ich genug Ahnung habt, wie man LoL spielt sehr einfach hoch climben können)","replies":[{"poster":"Shauna aka Vayne","date":"2016-11-13T14:49:07.243+0000","up_votes":1,"down_votes":0,"body":"Nein eigentlich nicht. mann muss glück haben mit den team du spielst gegen alles aber wenn du nur gegen platin und Dimond spielst bringt das auch nix..und dein team ist dann silber GG riot","replies":[{"poster":"Stinkakeksz","date":"2016-11-13T14:59:38.086+0000","up_votes":1,"down_votes":1,"body":"Wenn du die ersten spiele gegen dia und Plat spielst (was allein schon sehr unwahrscheinlich ist weil prozentual die meisten spieler silber sind), dass verlierst du vllt das stimmt .\n\nDadruch sinkt deine mmr -> logisch\nAber dann spielst du die letztn (meinetwegen 7 rankeds) nicht mehr so häufig gegen solche leute, da die Platin spieler steigen und die Bronze und silber leute sinken ( was normal ist)\n\nUnd wenn ich mir so deine Teammates und gegner in den ersten rankeds angucke dann waren die meisten platin spieler in deinem Team","replies":[{"poster":"Shauna aka Vayne","date":"2016-11-13T15:09:11.795+0000","up_votes":1,"down_votes":0,"body":"Nein ich meine nach meiner einstufung... da waren die meisten platin","replies":[{"poster":"Stinkakeksz","date":"2016-11-13T15:31:43.715+0000","up_votes":1,"down_votes":0,"body":"dann liegt es daran, dass diese \"solo/duo queue season 6 platin spieler\" in deiner flex queue elo eingestuft wurden","replies":[]}]}]}]},{"poster":"ZiXima","date":"2016-11-13T14:36:47.917+0000","up_votes":1,"down_votes":0,"body":"stimmt teilweise.. stell du dir mal vor du spielst übelst gut verlierst aber 2 Spiele wegen afks und wirst von Gold auf Bronze gestuft.","replies":[{"poster":"Stinkakeksz","date":"2016-11-13T14:42:10.646+0000","up_votes":1,"down_votes":1,"body":"DU wurdest nicht von Gold zu Bronze gestuft weil Flex Warteschlange eine komplett nue Warteschalnge ist bei der ALLE spieler bei 0 anfangen\n\nDIe kommende solo/duo wartschlange wird dein elo aus season 6 einigermaßen wieder spiegeln (aber selsbt da wird man immer tiefer eingestuft als man war\n\nUnd selbst die challenger müssen wieder bei platin anfangen","replies":[]}]}]},{"poster":"ZiXima","date":"2016-11-13T14:34:27.554+0000","up_votes":1,"down_votes":0,"body":"Ich stimme halbwegs zu.. Ich bin ein Sason 6 g5 Spieler und habe 6/4 die Einstufung-Games gespielt. In meinem Fall war das letzte game sogar ziemlich einfach aber in der 20. Minute ging unser Yasuo top afk. Wir haben dann bis zur 40. Minute weiter gespielt und doch verloren. Schluss endlich wurde ich b1 eingestuft. \n\nBitte Riot das kann doch nicht sein. Ich habe mir letzte Season schon meinen Arsch aufgerissen damit ich von Bronze 3 bis Gold komme... und jetzt meint ihr: \"ah ja dieser Spieler wird es sicher lieben wieder alles von neu machen zu müssen.\" Ich meine mit Silber 3 oder so währe ich ja klar gekommen aber 2 Divisionen tiefer?.. \n\nIch hoffe mein Problem wird verstanden und es wird eine für mich motivierende Lösung gesucht, denn so macht das echt kein Bock mehr.","replies":[{"poster":"Shauna aka Vayne","date":"2016-11-13T14:50:44.175+0000","up_votes":1,"down_votes":0,"body":"Deiner Meinung !","replies":[]},{"poster":"Stinkakeksz","date":"2016-11-13T15:02:24.207+0000","up_votes":1,"down_votes":1,"body":"aber ihr wurdet keine Divisionen runtergestuft, weil sie Season 6 elo und die Flex elo, 2 komplett verschiedene und von einander unabhängige systeme sind \nFlex elo ist ein neuanfang von der elo für alle\nDie kommende solo/duo elo ist abhängig von deiner elo aus season 6, welche aber auch geringer ausfallen wird, weil man bei einer neues season immer tiefer anfängt als man aufgehört hat","replies":[]}]},{"poster":"Shauna aka Vayne","date":"2016-11-13T14:21:12.565+0000","up_votes":1,"down_votes":0,"body":"Also Bronze 5 ist schon krass.. ich bin auch immer zwischen s2 und s5 rumgezwitscht. und habe 6 von 10 spielen gewonnen und wurde b1 eingestuft was ich auch nicht verstehe zumal spiele ich seid beta aber das macht kein spaß. oder dein team ist bronze uznd die gegner plat und dimon beim flex macht genau so ein spaß aber du sagtest wärst main adc? ich bin main supp magst du mal zusm spielen ich spiele Blitz und karma Tham ETC Blitz auf 7 ^^ dann adde mich oder ich dich","replies":[]},{"poster":"Stinkakeksz","date":"2016-11-13T14:39:09.166+0000","up_votes":1,"down_votes":1,"body":"Ihr habt ja noch eine 2. Chance mit der Solo/Duo queue die in wenigen Tgaen/Wochen starten wird.\nDie Rankeds die ihr doch spielen werdet sind abhängig von euer Elo aus Season 6 \n\nDIe Flex queue hat keine Informationen aus eurer elo aus Season6 übernommen sondern war sozusagen ein neuanfang","replies":[]}]}