{"poster":"Ichinii","date":"2015-11-12T21:06:13.781+0000","title":"S6 Teamaufbau","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hey Leute, \nnachdem ich insgesamt 5 Monate in einem ziemlich erfolgreichen Team mitgewirkt habe m&ouml;chte ich nun mein eigenes Ranked Team aufbauen.\nDaf&uuml;r suche ich Leute die Lust am zocken haben und sich verbessern m&ouml;chten. Nachfolgend findet ihr eine kurze Info zu mir und was ich genau Suche.\n\nSo, erstmal was &uuml;ber mich:\n\n1. ich heiß Phillip und bin 21 Jahre alt\n2. spiele seit Season 2\n3. bin seit Anfang Season 5 Mid-Main\n4. bin momentan Platin 3\n4. habe bereits wie schon oben beschrieben in mehrern Teams mitgewirkt und habe auch schon an mehrern Tunieren teilgenkommen\n5. Lieblingschampion sind {{champion:268}} {{champion:38}} {{champion:34}} {{champion:112}} {{champion:238}} \n6. Mich selbst w&uuml;rde ich als aufgeschlossen, freundlich und etwas verr&uuml;ckt charakterisieren\n7. bin ein ziemlich gro&szlig;er Anime-Fan (bin nebenbei noch in einer kleinen Fansub-Gruppe t&auml;tig)\n\nSo das wars erst einmal zu mir und jetzt kommt was bzw. wen ich suche:\n\n1. Also wie man sich es schon von oben her denken kann suche ich Leute f&uuml;r die Toplane, den Jungle, und die Botlane, also ADC und Support\n2. Ihr solltet mindestens Platin 5 sein (Gold ist auch okay wenn du auf deiner Postion überzeugen kannst) und 18 Jahre oder &auml;lter sein.  \n3. Ich suche Leute die freundlich sind, nicht flamen, spa&szlig; am Spielen haben aber auch etwas erreichen wollen.\n4. Au&szlig;erdem solltet ihr zuverl&auml;ssig sein da geplant ist 3 - 4 mal die Woche zu trainieren. (Training mei&szlig;t gegen Abend)\n5. Was natürlich auch wichtig ist, ist Kritigfähigkeit und das Interesse daran sein eigenes Spiel etwas zu analysieren\n6. Ihr solltet auch ein anst&auml;ndiges Headset besitzen und Teamspeak f&uuml;r die Kommunikation haben\n\nSo das sollte erstmal das wichtigste sein was es zu wissen gilt. Falls du den Post bis hier hin gelesen hast und Interesse hast kannst du ja gerne einen Kommentar schreiben oder mich einfach Ingame adden. Alles weitere kann ja dann noch in einem Gespr&auml;ch gekl&auml;rt werden. \n \nIch freue mich auf eure Antworten!\nLiebe Gr&uuml;&szlig;e,\nIchinii                                                          \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Lazarević","date":"2015-11-12T21:21:39.397+0000","up_votes":2,"down_votes":0,"body":"Ich bins der Alex aka. MrEvEninG LoL\n\nIch suche ein Team das ich joinen kann. Erstmal zu meiner Person bevor ich auf mich als Spieler eingehe:\n\n\n* Ich heiße** _Alexander_** aka** _MrEvEninG LoL_** wie vorher bereits erwähnt \n* Ich bin_** 19+ Jahre alt**_\n* Ich bin wie man vlt. am Text erkennen kann **_Deutscher_** ^^\n* Außerdem bin ich ein sehr engagierter LoL Spieler und **_spiele seid Season 2 _**\n* Ich bin eine offene und sehr direkte Person d.h wenn mich was stört sage ich es einem direkt, aber im ganzen eigentlich sehr nett/freundlich\n\n\n\n**_Nun über mich._**\n\n\nIch war last Season und die davor ein JNG/TOP hybrider, da mir aber der JNG nicht mehr gefällt werde ich Toplaner \nAn und für sich kann ich jeden relevanten TOP Champ ( genauere Daten kommen unten), ich muss sie nur wieder auffrischen um sie auf einen guten Niveau spielen zu können. Im letzten Team war ich der Shootcaller, kann aber auch der Dyrus sein der 1 mal alle 10 Minuten was sagt.\n\n\n_**Meine Stats**_ \n\n1. **_Solo Q:                 Plat 5 65 LP ( seid erreichen von Platin nur Pflichtrankeds)_**\n2. **_5v5 Ranked:      Gold 5 ( nur geplaced) _**\n3. **_3v3 Ranked:      Platin 5 (20 Games gespielt) _**\n\n\n\n**_Meine Champion Stats_**\n\n{{champion:14}}  58,8% winrate    51 Games \n{{champion:68}} 82,6% winrate    23 Games \n{{champion:58}} 62,5% winrate    09 Games \n{{champion:92}} 55,6% winrate    09 Games \n{{champion:39}} 60,0% winrate    10 Games \n\n\nChampions die ich noch gut kann aber nicht in Rankeds gespielt habe \n\n{{champion:122}}  Den hat man nicht bekommen \n{{champion:36}}  wurde erst gerade gebufft\n{{champion:150}} kam nie dazu weil das matchup nicht gepasst hat\n{{champion:57}} Solo q und maokai ne nur im Teamranked\n{{champion:2}} erst am ende der Season OP/ meta geworden\n{{champion:111}} Solo q naja/ Teamranked stark\n{{champion:223}} Perma bann oder Supp pick\n{{champion:157}}  War zu bad auf den erst jetzt gut \n{{champion:245}} Leider nciht mehr gespielt ist hammer spassig \n{{champion:54}}  Gleiche wie bei Nauti und Mao\n{{champion:8}} Nur in normals gespielt\n\nChampions die ich noch lernen will/werde \n\n\n{{champion:114}} \n{{champion:41}} \n{{champion:86}} Ja auch für Spin to Win braucht man 1,2,... Übungsspiele \n{{champion:120}}\n{{champion:117}} \n{{champion:107}} \n\nSooooo jetzt wisst ihr einiges über mich. Falls ihr weitere fragen habt oder ihr sagt den will ich mir mal über ts3 anhören oder mit ihn spielen wollt, addet mich in LoL oder schreibts in die Kommentare, ich werde so schnell wie möglich antworten \n\n\nVielen dank fürs lesen \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Kyrusa","date":"2015-11-12T21:08:41.744+0000","up_votes":1,"down_votes":1,"body":"immer diese dumme eloeingrenzung.. als wäre gold jetzt der lectze dreck udn noob... \nich kann super supp, supp aber ungern randoms... weil die halt oft kein adc können.. und es ist hatl nur ein dummes game... daher jukt elo mich net.. aber so nieein gutes team zu bekommen... schade drum...\nes wird nie auf skill gewertet.... -,-","replies":[]},{"poster":"Zèphyrion","date":"2015-11-18T17:22:02.228+0000","up_votes":1,"down_votes":0,"body":"Kannst du mich bitte nochmal adden...?","replies":[]},{"poster":"Zèphyrion","date":"2015-11-13T12:58:50.752+0000","up_votes":1,"down_votes":0,"body":"Hey, habe dich erstmal in Lol geaddet um weiteres zu besprechen :)","replies":[]}]}