{"poster":"Bigshowlol","date":"2018-05-19T14:24:03.517+0000","title":"Spiel ist für Anfänger unspielbar ! Smurfs überall","subforum":"Champions & Gameplay","up_votes":4,"down_votes":1,"body":"90% aller niedrig level Accounts sind &quot;smurfs&quot;.\r\n\r\nWie soll man als Anf&auml;nger dieses Spiel genie&szlig;en k&ouml;nnen wenn in jedem Spiel 90% smurfs sind?\r\nMit 20-0 stats durch das Spiel laufen und man selbst frustriert ist.\r\n\r\nKlar sind diese Leute erb&auml;rmlich bis auf die Knochen damt sie auch mal ihre 5 Minuten Ruhm bekommen.\r\nAber f&uuml;r Anf&auml;nger ist das richtig mies.\r\n\r\nUnd dass Riot das hart egal ist zeigt wie stark am Abgrund dieses Spiel steht.,","replies":[{"poster":"Angel Ayume","date":"2018-05-19T15:13:46.289+0000","up_votes":3,"down_votes":2,"body":"Wer alleine spielt und ohne \"Smurfs\" levelt, der sollte ab einem gewissen Leven keine Probleme mehr haben und wird automatisch mit anderen Anfängern zusammen gematched. \n\nWer als Anfänger jedoch ständig mit Smurfs spielt oder mit Leuten über Lvl 30, der sollte sich nicht beschweren, wenn man dann alleine mit Smurfs zusammen spielt.","replies":[]},{"poster":"Dornenpanzer","date":"2018-05-19T15:04:51.545+0000","up_votes":2,"down_votes":1,"body":"Du bist Level 31 mit positiver Winrate. Deine Stats sehen auch okay aus, dafür dass dir angeblich Smurfs das Spiel versauen. Dein Problem wirkt irrational","replies":[]},{"poster":"Sôzetsu","date":"2018-05-24T20:54:15.352+0000","up_votes":1,"down_votes":0,"body":"Riots matchmaking is absoluter schwachsinn ich bin selber ein smurf und sobald ich 60% winrate erreiche kriege ich 4 behinderte menschen ins team und das meien ich nicht böse aber anders ist deren verhalten nicht erklärbar, entweder ich stompe die gegener KOMPLETT oder ich sitze hoffnungslos auf der topalkne und sehe wie der score auf 20/1 steht wobei ich den einzigen kill ahbe und keinen tod.\n\nrito amcht ein competetive spiel und schmeißt neue spieler, casuals tryhards und smurfs einfach zusammen da lernt keiner etwas von und toxicity ist GARANTIERT.\n\n\nflamed riot richtig zu denn es ist nicht riot die so dumm sind sondern Tencent die riot gekauft ahben und nur auf geld gieren.\n\nflamed riot macht ihnen klar dass das matchmaking hilfe braucht und dass high elo spieler für ertragbares schlechtes verhalten bannen neue spieler verscheucht weil sie mit den smurfs spielen müssen.\n\ntencent wird nichts tun solange sie ihr geld nichjt in gefahr sehen.","replies":[]},{"poster":"Alpacana","date":"2018-05-19T15:05:27.410+0000","up_votes":1,"down_votes":0,"body":"Ich geb dir vollkommen Recht, dass das ziemlich frustrierend ist, allerdings denke ich nicht, dass diese Leute Smurfen um \"5 Minuten Ruhm zu bekommen\", sondern einfach, um sich einen neuen Smurf zu leveln (ja, das kann man auch gegen Bots in 3v3 machen, ich weiß das geht schneller, ist aber auch stink-langweilig). \n\nIch weiß nicht, inwiefern Riot da etwas gegen machen kann und ob es sinnvoll ist (falls es überhaupt möglich ist, Smurfs von neuen Spielern zu trennen), denn wenn es wie du sagst 90% der Spieler sind, dann wären die Queue-Zeiten für Anfänger extrem lang und ich denke, dass DAS schon eher ein Grund ist für neue Spieler, das Spiel erst gar nicht anzufassen. (Ich selbst würde auch nicht 20 Minuten warten um ein Spiel zu finden, nur weil ein Freund mal meinte, ich soll dieses Spiel ausprobieren).\n\nUns liegt es einfach nicht in der Hand daran etwas zu ändern, deshalb gibt es auch eigentlich keinen Grund, an der Tatsache rumzumeckern, auch wenn man es nur zu gut nachvollziehen kann. Entweder man lebt als Spieler damit, oder man tut sich dieses Spiel erst gar nicht an. (Oder man holt sich als Anfänger selbst einen Freund dazu der das Spiel schon kennt und auf diesem Level carried, wenn dir daran so viel liegt) ;)","replies":[{"poster":"naniwakaze","date":"2018-05-19T15:11:12.732+0000","up_votes":1,"down_votes":0,"body":"> Ich weiß nicht, inwiefern Riot da etwas gegen machen kann und ob es sinnvoll ist (falls es überhaupt möglich ist, Smurfs von neuen Spielern zu trennen) (...)\n\nWenn Leute (wie du es sagst) nur ein neues Konto leveln wollen, es gibt tatsächlich Überlegungen, ob bei der überarbeiteten EInführung ins Spiel neue Spieler und Smurfs zu Beginn getrennt werden können:\nhttps://nexus.leagueoflegends.com/de-de/2018/05/dev-new-player-experience/\n\n> Wir möchten eine Option einfügen, mit der erfahrene Spieler die Einführung überspringen können. Das hat zudem den Vorteil, dass neue Spieler in ihren ersten Spielen auf andere Neulinge treffen.","replies":[{"poster":"Pandeonor","date":"2018-05-19T16:58:26.057+0000","up_votes":1,"down_votes":0,"body":"Das wird nichts bringen. Smurfs sind in aller Regel wohl in der gleichen Struktur aufgebaut wie die \"Originale\". Es werden Bronze bis Gold-Spieler sein welche sich den Smurf halten eben aus dem Grund um mir Anfängern gematcht zu werden. 80% Winrate macht mehr Spaß.\n\nDas Dutzend echter(tm) Smurfs im Sinne von High-Elo (Plat/Dia) welche sich einen Zweitaccount zum Trainieren holen (anstatt das in Normals zu machen) kann man m.E. getrost vergessen.","replies":[]},{"poster":"Alpacana","date":"2018-05-19T15:15:47.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=naniwakaze,realm=EUW,application-id=Wj1wcocU,discussion-id=q7kEWqiX,comment-id=00020000,timestamp=2018-05-19T15:11:12.732+0000)\n>\n> Wenn Leute (wie du es sagst) nur ein neues Konto leveln wollen, es gibt tatsächlich Überlegungen, ob bei der überarbeiteten EInführung ins Spiel neue Spieler und Smurfs zu Beginn getrennt werden können:\n> https://nexus.leagueoflegends.com/de-de/2018/05/dev-new-player-experience/\n\nWow, das wusste ich nicht, finde ich echt cool, stellt sich dann allerdings immernoch die Frage, wie lang dann die Queue-Zeiten für neue Spieler wären, wenn all die Smurfs wegfallen würden.","replies":[{"poster":"naniwakaze","date":"2018-05-19T15:38:10.331+0000","up_votes":1,"down_votes":0,"body":"Stimmt, an die Sache mit den Queue-Zeiten hab ich selbst noch gar nicht gedacht. Mal sehen, ob sie dafür eine Lösung haben werden!","replies":[]}]}]}]},{"poster":"Amycos Cyrus","date":"2018-05-19T15:14:36.624+0000","up_votes":1,"down_votes":1,"body":"1. LoL steht glücklicherweise nicht am Abgrund.\n2. Smurfs werden in erster Linie mit Smurfs gematcht. (Sofern diese als Smurfs erkannt werden)\n3. Man kommt recht schnell aus dieser \"Smurf\"-Ecke heraus, wenn man sich an das Spiel gewöhnt hat, da man ja auch aus dem \"Anfänger\"-Niveau heraus kommt.","replies":[{"poster":"Noxempire","date":"2018-05-19T16:14:56.462+0000","up_votes":1,"down_votes":0,"body":">Angrund\n>\n\n...etwa, Clan Angrund.?!","replies":[]}]},{"poster":"three stodges","date":"2018-05-19T14:58:42.547+0000","up_votes":1,"down_votes":1,"body":"Genauso muss dir das Spiel auch egal sein, nicht mehr einlogen und was anderes zocken.","replies":[{"poster":"Dornenpanzer","date":"2018-05-19T15:07:06.174+0000","up_votes":1,"down_votes":1,"body":"Interessante Meinung für einen aktiven Spieler. Gibst anderen den Tipp, was anderes zu zocken, spielst aber selbst häufig.","replies":[{"poster":"Alpacana","date":"2018-05-19T15:14:41.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dornenpanzer,realm=EUW,application-id=Wj1wcocU,discussion-id=q7kEWqiX,comment-id=00000000,timestamp=2018-05-19T15:07:06.174+0000)\n>\n> Interessante Meinung für einen aktiven Spieler. Gibst anderen den Tipp, was anderes zu zocken, spielst aber selbst häufig.\n\nIch denke, der größte Teil der Community teilt meine Meinung. Mittlerweile ist man es halt gewohnt, gegen Smurfs zu spielen wenn man einen neuen  Account leveln möchte und da man als neuer (und auch älterer) Spieler daran nunmal nichts ändern kann, bleibt einem nichts anderes übrig als es zu ertragen oder dich erst gar nicht in diese Position zu bringen.\n\nIch persönlich finde, dass der Einstieg für neue Spieler extrem schwer ist, da man sehr schwer \"neue\" Spieler untereinander differenzieren kann.\nManche Spieler haben Erfahrungen mit MMOS, andere wissen während ihres ersten Spiels nicht einmal, was ein Champion ist, oder wie man ihn auf dem Spielfeld erkennt, daher kann ich die Frustration neuer Spieler sehr gut nachvollziehen, weshalb ich denke, dass es vollkommen normal ist, neuen Spielern vom Spielen abzubringen, wenn sie nicht wirklich durch diese Phase gehen wollen. (Das soll nicht heißen, dass League ein schlechtes Spiel ist, sonst würde ich es ja selber nicht spielen, allerdings finde ich, dass es für neue Spieler einfach echt verdammt schwer ist am Anfang und man sich gut überlegen sollte, ob man sich das antun möchte)","replies":[{"poster":"Dornenpanzer","date":"2018-05-19T15:45:07.044+0000","up_votes":1,"down_votes":2,"body":"Mein Kommentar war auf Three Stodges bezogen^^ geht aus der Diskussionsansicht hervor, ich nehme mal an, du benutzt die chronologische Ansicht?\nJedenfalls ging es mir darum, dass Three Stodges meinte, dass er einfach aufhören sollte, zu spielen, ohne dass er dieses selbst lebt.","replies":[{"poster":"Alpacana","date":"2018-05-19T15:47:13.751+0000","up_votes":1,"down_votes":0,"body":"Ah ja sorry, my bad!","replies":[{"poster":"Dornenpanzer","date":"2018-05-19T15:52:32.201+0000","up_votes":2,"down_votes":2,"body":"np mate :)","replies":[]}]}]}]}]}]},{"poster":"Kayantao","date":"2018-05-20T11:48:54.826+0000","up_votes":1,"down_votes":2,"body":"riot  macht schon eine menge gegen smurfs, ich habe selber mehrere smurfs hochgespielt, und schon nach den ersten 10 games kommt man in einen bereich wo man nur noch gegen 90% smurfs spielt. klar ist das system nicht perfekt aber meiner erfahrung nach funktioniert es doch recht gut.","replies":[]}]}