{"poster":"Nunzio2406","date":"2015-03-18T18:40:48.963+0000","title":"Willkürliche Framedrops im Spiel","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute. Seit dem Release der neuen Map habe ich ein ziemlich merkwürdiges Problem. Ich habe immer mal wieder, absolut willkürlich Framedrops und einen eingefrorenen Bildschirm für 2-3 Sekunden. Die Framedrops und Freezes sind nicht auf bestimmte Situationen festgelegt, also treten nicht in jedem Teamfight auf. Manchmal bekomm ich auch einen, wenn ich gerade die Lane hochlatsche und nichts besonderes passiert.\n\nJedenfalls dachte ich erst, dass es an meinem PC liegen muss. Er ist jetzt 2-3 Jahre alt (Laptop) mit folgenden Merkmalen :\n\nPackard Bell EasyNote TS44HR4 \nIntel Core i 5-2450M 2,5GHz\n4 GB Ram 64 Betriebssystem\nNVidia GEforce GT630M\n500 GB Festplatte\n\nDa das Ding ja schon einige Zeit auf dem Buckel hat, hab ich innerlich so gut gesäubert wie es eben geht, da er auch Recht warm wurde. Jetzt sind die Temperaturen wieder auf dem Normalniveau, hat das Problem aber nicht gelöst. Dann hab ich meine Festplatte mal entrümpelt, mit Defragmentierung, tuneup, pipapo, neuer Treiber für die Grafikkarte und mal auf mal und adware gecheckt. Hat alles nichts gebracht.\n\nMir wird hier mit Sicherheit keiner eine Universallösung bieten können, aber vielleicht gibt es ja jemanden, der das Problem auch hatte und mir helfen kann, denn es versaut mir mächtig die Lust am spielen. Ich werd jetzt heute oder morgen mal einige andere Spiele ausprobieren, wie SC2 und mal sehen wie es da so läuft. \n\nAuffällig ist es, dass es seit der neuen Map so ist, von jetzt auf gleich. Auf der alten Map hab ich immer auf den normaleinstellungen gespielt, also mittel und jetzt ruckelt es auch, wenn ich auf sehr niedrig gestellt habe. Neu installiert hab ich schonmal.\n\nWürde mich über antworten freuen!\n\nEDIT: Kleiner Nachtrag. Ich hab jetzt im Forum mehrere Posts gesehen, die dasselbe Problem beschreiben. Kann es sein, das es ein Problem mit dem Spiel gibt? MfG\n\nNochmal ein kleiner Nachtrag, hab gelesen, dass gewisse Logs nützlich sein könnten. Also habe ich 3 redlogs (die letzten 3 per pastebin) und mein dxdiag angehängt!\n\nhttp://pastebin.com/SFeqWX49\n\nhttp://pastebin.com/7jbHrwhw\n\nhttp://pastebin.com/SHWwKEqL","replies":[{"poster":"Saîlor Moon Moon","date":"2015-03-20T21:00:32.911+0000","up_votes":1,"down_votes":0,"body":"**Halte deine Treiber aktuell, sie könnten deine Framerate retten!**\n\nDeinen Aussagen und den Angehängten Logs entnehme ich, dass dein Laptop eine \"zuschaltbare\" Grafikkarte hat. Diese gibt es in drei Ausführungen(getrennt, offen, vermischt) und von zwei Herstellern (*AMD und NVidia*).\n\n**Was musst du darüber wissen? **\n\nIn der Regel werden diese Grafikkarten nur in Laptops genutzt und sind Spezialanfertigungen für die OEMs (*Laptophersteller z. B. Asus, Dell, Lenovo, HP, ...*). Da sie obendrein sehr wartungsaufwändig sind, übernehmen hier die Hersteller die Treiberpflege. Bei dem Versuch die \"offiziellen\" Treibe von AMD oder NVidia zu nutzten kommt meisten ein Verweis auf eine nicht unterstützte Grafikkarte. In den meisten Fällen funktioniert eine automatisches Update (*NVidia Systemsteuerung / Catalyst Control Center*)  nicht.\n\n**Was kannst du tun?**\n\nGehe zur Website deines Herstellers und suche nach exakt **deinem** Modell in der Regel bieten sie dort die aktuellen Treiber an.\nhttp://www.packardbell.de/pb/de/DE/content/download\n\n---\n\n> System Manufacturer: Packard Bell, System Model: EasyNote TS44HR\n\nDa wir ein DxDiag haben, konnte ich dir hier etwas nützliches besorgen. :-) \nhttp://global-download.packardbell.com/GDFiles/Driver/VGA/VGA_NVIDIA_8.17.12.8590_W7x64_A.zip?acerid=634677220925627472&Step1=NOTEBOOK&Step2=EASYNOTE&Step3=EN%20TS44HR&OS=711&LC=de&BC=PACKARD%20BELL&SC=EMEA_8P\n\n---\n\nWenn deine Treiber Aktuell sind, findet sich in der Regel eine Einstellung welche der beiden Grafikkarten du verwenden willst, dort solltest du auch \"Anwendungsspezifische\" Einstellungen hinterlegen können. Ich kann dir leider keine konkreten Screenshots liefern, da ich keinen Laptop mit NVidia Grafikkarte mehr habe.\n\n---\n\nSollte dein Problem dadurch nicht oder nicht ausreichend gelöst werden, melde dich hier wieder oder schreibe dem Support.\nWenn dein Problem allerdings dadurch gelöst werden konnte, sei doch bitte so nett und lass es uns wissen. :-)\n\nLG *Phöbus*","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-20T21:20:25.166+0000","up_votes":1,"down_votes":0,"body":"Heya\nEhrliche Frage: Woher hast du das kopiert :P\nSo wunderbar ausführlich formuliert^^\nUnd wer ist \"uns\"\nFragen über Fragen....\n\nMfG Rkoturdo","replies":[{"poster":"Saîlor Moon Moon","date":"2015-03-20T21:28:44.603+0000","up_votes":1,"down_votes":0,"body":"> Ehrliche Frage: Woher hast du das kopiert :P\n> So wunderbar ausführlich formuliert^^\n\nSo wunderbar ausformuliert/kopiert: Ich bin IT-Techniker, mit Fokus auf Support und Webmanagement/Errorhandeling, das ist mein Beruf. ;-)\nWenn du das lange genug machst, bist du irgendwann ganz drinnen.\n\n> Und wer ist \"uns\"\n\nUns = Die Community hier im Player-Help-Player Support.","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-20T21:37:38.506+0000","up_votes":1,"down_votes":0,"body":"Heya\nKann ich mir bei den Formulierungen ne Scheibe abschneiden?\nUnd inhaltich: LoL verwendet schon die richtige Graka, da sollte das Problem also nicht liegen(siehe R3D-Logs). Mal schaun ob das Treiberneuinstallieren geholfen hat.\n\nMfG Rkoturdo","replies":[{"poster":"Saîlor Moon Moon","date":"2015-03-20T21:51:47.542+0000","up_votes":1,"down_votes":0,"body":"> Kann ich mir bei den Formulierungen ne Scheibe abschneiden?\n\nBitte. Bediene dich.\n\n> Und inhaltich: LoL verwendet schon die richtige Graka, da sollte das Problem also nicht liegen(siehe R3D-Logs). Mal schaun ob das Treiberneuinstallieren geholfen hat.\n\nDie Grafikkartenhersteller machen es sich mit diesem \"OEM übernimmt den Support\" auch sehr einfach, die Dinger sind einfach ~~nicht~~ nie aktuell. Nach spätestens zwei Jahren ist der Support vorbei und dann fängt das Gezockel an. \n\nBezüglich der Logfiles. Ich halte es ja für durchaus hinterfragenswert, ob ein Programm als stabil angesehen werden kann, wenn es per **default** so viele \"*nicht gefunden*\", *\"nicht geladen*\", \"*nicht freigegeben*\" Fehler ausspuckt. Es erschwert das Lesen der selben ungemein. Ich habe mir zwar einen Filter gebastelt, welche diese \"~~normalen~~\" Fehler raus nimmt aber intelligent finde ich die Konstruktion nicht.\n\nIch habe ja eher die Vermutung, das er mit dem RAM an die Grenzen stößt. 4GB sind bei einem 64 Bit OS eigentlich die Unterkante, die Swap/Pagefile kann einiges abfangen aber nicht alles. Bei einer physikalischen Platte ist dann auch der Ofen aus durch das ständige Lesen->Puffer->Schreiben->Puffern-Lesen.","replies":[{"poster":"Nunzio2406","date":"2015-03-20T22:41:48.626+0000","up_votes":2,"down_votes":0,"body":"Ich habe ja eher die Vermutung, das er mit dem RAM an die Grenzen stößt. 4GB sind bei einem 64 Bit OS eigentlich die Unterkante, die Swap/Pagefile kann einiges abfangen aber nicht alles. Bei einer physikalischen Platte ist dann auch der Ofen aus durch das ständige Lesen->Puffer->Schreiben->Puffern-Lesen.\n\nIch hatte bei anderen und viel aufwendigeren Spielen noch nie Probleme, kann mir bei bestem Willen nicht vorstellen, das jetzt für LoL der RAM nicht mehr reicht.\n\nWerde deinen Ratschlag ansonst befolgen und melde mich dann wieder","replies":[]}]}]}]}]}]},{"poster":"Shincalu","date":"2015-03-23T11:38:28.989+0000","up_votes":1,"down_votes":0,"body":"Ich versuchs mal ;)","replies":[]},{"poster":"Nunzio2406","date":"2015-03-22T18:45:53.964+0000","up_votes":1,"down_votes":0,"body":"Shincalu, du solltest lieber deinen eigenen Thread aufmachen, denn so verlieren die fleißigen Helfer nur die Übersicht über alles.","replies":[]},{"poster":"Nunzio2406","date":"2015-03-21T13:09:00.567+0000","up_votes":1,"down_votes":0,"body":"Hey, hab den 2. Link den du mir geschickt hast ausprobiert, also installiert. beim ersten war ich mir nicht sicher was ich da nun von den treibern auswählen sollte. \n\nhttp://www.bilder-upload.eu/show.php?file=f9ff28-1426943891.jpg\n\nhabt ihr das hier gesucht?\n\nhttp://www.bilder-upload.eu/show.php?file=09bc78-1426943994.jpg\n\nhab für lol einfach mal auf nvidia hochleistungsprozessor gestellt\n\nNormalerweise steht da, wo nvidia hochleistungsprozessor steht : globale einstellung (automatische auswahl : nvidia gpu) verwenden.","replies":[]},{"poster":"Nunzio2406","date":"2015-03-20T20:34:31.362+0000","up_votes":1,"down_votes":0,"body":"Hab grad mal ein Aram zum Testen gemacht. Bisher lief alles in Ordnung, aber ich werde es morgen auf der normalen Map versuchen. Wo finde ich das \"alles auf Anwendung entscheiden lassen\"?","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-20T21:18:45.170+0000","up_votes":1,"down_votes":0,"body":"Heya\nIn der Nvidia Systemsteuerung unter 3D-Optionen(3d-Einstellungen verwalten) wenn ich mich nicht irre.^^\n\nMfG Rkoturdo","replies":[]}]},{"poster":"Nunzio2406","date":"2015-03-20T19:11:33.848+0000","up_votes":1,"down_votes":0,"body":"Ich hbe jetzt einfach nochmal den neuesten treiber von Nvidia runtergeladen. allerdings steht da immernoch als Grafikkarte Intel HD Family. Inwiefern ist das jetzt ein Problem? Und wie kann ich das ändern? Soll ich die Intel Karte einfach mal deaktivieren?","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-20T20:30:03.381+0000","up_votes":1,"down_votes":0,"body":"Heya\nSchlimm ist das nicht, da LoL ja die Nvidia benutzt.\nAber ich muss mir nochmal Gedanken machen, woher die Drops kommen.\nSchau mal in der Nvidia-Systemsteuerung(Rechtsklick auf dem Desktop).\nIst dort alles auf Anwendung entscheiden lassen?\n\nMfG Rkoturdo","replies":[]}]},{"poster":"Nunzio2406","date":"2015-03-20T18:28:42.136+0000","up_votes":1,"down_votes":0,"body":"Nach der Software von Nvidia ist der aktuell. Ich werde mich mal schlau machen! Danke für die Antwort! Bin in den technischen Sachen nicht so der Hit :/","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-03-20T18:25:23.717+0000","up_votes":1,"down_votes":0,"body":"Heya\nLoL scheint schon die Nvidia zu benutzen, bei der DxDiag wird aber nur die Intel angezeigt. Daher musst du selbst mal schauen, ob dein Nvidiatreiber aktuell ist.\n\nMfG Rkoturdo","replies":[]},{"poster":"Nunzio2406","date":"2015-03-20T18:19:37.910+0000","up_votes":1,"down_votes":0,"body":"Keiner eine Idee? =(","replies":[]},{"poster":"Nunzio2406","date":"2015-03-19T10:28:03.630+0000","up_votes":1,"down_votes":0,"body":"http://pastebin.com/SFeqWX49\n\nhttp://pastebin.com/7jbHrwhw\n\nhttp://pastebin.com/SHWwKEqL\n\nHier sind die R3dlogs, oben hat er sie irgendwie nicht mehr eingefügt.","replies":[{"poster":"Shincalu","date":"2015-03-22T12:29:51.702+0000","up_votes":1,"down_votes":1,"body":"Guten Tag,\n\nIch habe so ziemlich das selbe Problem!\nIch habe alle Schritte befolgt welche im Support Tab des Forums zum selber durchführen angegeben sind.\nIch habe mein Laptop neu aufgesetzt und ihm ein Upgrade verpasst, eine SSD.\nSeit dem läuft LoL nicht mehr flüssig.\nWenn ich beispielsweise als Jungler vor den Golems stehe bei 1:55 und sie spawnen hab ich von bislang 180 Fps nur noch 1-10! Das hällt dann für 1-3 Sekunden an. Leider nicht konstant sondern immer nur Sporadisch. Wenn ich in Teamfights reingehe stehe ich wiederum auch für 1-3 Sekunden bewegungsunfähig rum.\nLaufe ich durch den Jungle oder werfe mit Nidalee einen Speer auf den Gromp etc. habe ich in dem Moment wo der Speer trifft und ich den Sound höre wieder Standbild und die Fps gehen runter.\nIch schreibe derzeit schon mit einem (Gott sei Dank) fähigen Supporter der mir auch schon direkt die Fehlerquelle für seine damaligen Performanceprobleme gesagt hat.\n\nKaspersky.. Das Programm habe ich allerdings auch schon vor dem neu aufsetzten gehabt und hatte keine Probleme damit.\nIch sehs auch ehrlich gesagt nicht ein wegen einem Spiel meine Sicherheit aufzugeben.\nAber gesagt getan, ich habe den Schutz für die dauer eines Spiels ausgeschaltet und es wurde nicht besser.\nIch habe jetzt etliche DxDiag´s und Prozesslisten sowie r3d logs geschickt und es kommen immer wieder neue Vorschläge die allerdings nicht viel bringen.\nMSi Afterburner was ich auch noch extra geladen habe und den log verschickt habe hat wohl auch nichts gebracht, nur muss doch irgendwo her dieses Problem kommen? Wenns nicht an meinem Rechner liegt bleibt ja nur noch eine logische Konsequenz...\nDarum jetzt hier nochmal. Ich hoffe mir kann einer von euch helfen so das ich das Problem von 2 Seiten bearbeiten lassen kann ;)\n\nAnbei versuche ich jetzt die Dateien anzuhängen die ich zuletzt versendet habe. Auch wenn ich noch nicht dahinter gekommen bin wie ich mehrere anhängen kann, da er bei mir nach einer Schluss macht :D\n\nmfg","replies":[]}]}]}