{"poster":"jaggapuss","date":"2016-03-10T08:33:21.388+0000","title":"4 afks in a row","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"usually i wouldnt mind an afk here and there but i just got 4 in a row, and then a nasus that just gave up cause jungler didnt have smite. do i get loss prevention for i dont knw 4 consecutive afks in a row its really hard when u work your way out of brone then your trying to climb silver which in my opinion is just as hard as bronze. plus it really sucks when u ban them and there in the next que and recognize the same guy who didnt take smite so they afk again {{item:3751}}","replies":[{"poster":"Ingénue","date":"2016-03-10T08:42:01.848+0000","up_votes":2,"down_votes":0,"body":"You won't get a loss prevention, as they are only handed out when massive server-wide disruptions happen.\n\n_Unfortunately these kinds of things happen, but luckily Riot has a pretty good system of picking up and punishing players like this. _\nFirst of all, hopefully you reported the people at the end of the game.\nAs well as this, the automated leaver buster system treats ranked games more severely than the other types, so it is likely that they are on the edge of a low priority queue (or have already been hit with one). \n\nYou can read about the leaver buster system [here for more info. ](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ)\n\n**In terms of avoiding afk and ragequitters in your teams, you can [create/ join a premade 5](http://boards.oce.leagueoflegends.com/en/c/team-recruitment) for either dynamic queue or norms.** This way, you can learn each others play styles, build long lasting friendships, have A+ communication and less toxicity. You even get bonus IP and mastery points. **You also have the added security of knowing that they aren't going to afk on you.**","replies":[{"poster":"WolfeImmortal","date":"2016-03-12T07:31:29.957+0000","up_votes":1,"down_votes":0,"body":"I have to say Princess Yaia is completely right here, as I have trouble with trolls, AFKs etc. but whenever I party up with 2 or more friends I can rely on I win. If you want check my history and look at my past games to see the carrying I have done and still not been able to win feel free to.","replies":[]},{"poster":"jaggapuss","date":"2016-03-11T21:02:24.335+0000","up_votes":1,"down_votes":1,"body":"yea ino but its hard to have a 5 man ranked plus the que times just doesnt make it worth it","replies":[]}]},{"poster":"WE WUZ KINGZ","date":"2016-03-11T02:36:08.402+0000","up_votes":1,"down_votes":0,"body":"Feels. I got demoted even though i have over 50% winrate because I got trolls repeatedly.","replies":[{"poster":"jaggapuss","date":"2016-03-11T21:01:58.140+0000","up_votes":1,"down_votes":0,"body":"same so annoying im over ranked","replies":[]}]}]}