{"poster":"jaggapuss","date":"2017-09-08T20:52:44.585+0000","title":"so nothing after 7 years of playing the fuking game","subforum":"Player Behaviour","up_votes":2,"down_votes":6,"body":"your not going to review my fukin ban from 4 people blowing me in for no fukin reason all game then surrendering the game when we are about to win , did i mention get the enemy team to flame me as well cause i was doing good for 45 mins then u send me my fukin chat ban witch is me being passive to there fukin racism and flaming,,, what the actual fuck i thought u care about your old school players more than some fukin trolls who jump on to fuck people of you lost a player iv rakt up more than 450 DAYS play time on your fukin game since season 1 and you cant even review me i guess thats where u say from seeing the way you type i can tell your toxic first time flaming thanks for taking hundreds of dollars and countless hours in return for nothing","replies":[{"poster":"ThatsBS","date":"2017-09-09T10:19:10.066+0000","up_votes":2,"down_votes":0,"body":"Your rant needs evidence. No point in flaming riot without evidence.","replies":[{"poster":"jaggapuss","date":"2017-09-09T23:20:15.961+0000","up_votes":2,"down_votes":0,"body":"how do i get my chat logg","replies":[{"poster":"TheDemonEmperor","date":"2017-09-10T04:33:47.075+0000","up_votes":1,"down_votes":0,"body":"riot send your chat log and why you are banned to the email of your account.","replies":[]}]}]},{"poster":"QAPLA","date":"2017-09-09T22:08:07.503+0000","up_votes":1,"down_votes":0,"body":"8 instances of \"fukin\" or \"fuck\" in your post (rant).\n\nI think I understand why you were banned.\n\nCheer up buddy, it's just a game.","replies":[{"poster":"jaggapuss","date":"2017-09-09T22:53:11.202+0000","up_votes":2,"down_votes":1,"body":"common mate 45mins getting flamed for no reason then a ban when they surrender just before were going to win OK i swore a lot i was angry i haven't been banned in 7 years the people coming into the game are ruining it how are u supposed to cheer up","replies":[{"poster":"Plutooh","date":"2017-09-19T22:31:18.623+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jaggapuss,realm=OCE,application-id=T8eq2lFQ,discussion-id=NJ2XZLKw,comment-id=00020000,timestamp=2017-09-09T22:53:11.202+0000)\n>\n>  i haven&#x27;t been banned in 7 years\n\nFrom what I understand you don't get a perm ban the first time, you get suspended or chat restricted first. Perm bans I would of thought would be for multi offences so.....","replies":[]},{"poster":"CHEESYLEEKS","date":"2017-09-10T00:34:38.012+0000","up_votes":1,"down_votes":0,"body":"45 minutes without muting..... just mute flamers its not hard.","replies":[]}]}]},{"poster":"jaggapuss","date":"2017-09-09T22:51:41.692+0000","up_votes":2,"down_votes":1,"body":"how do i find my chat log obviously i was a little angry because of the ban for being passive 7 years no ban does that not say enough","replies":[]},{"poster":"Roguestoney","date":"2017-09-19T22:54:30.369+0000","up_votes":1,"down_votes":0,"body":"1 game 🤔 get rekt m8 😂🙃","replies":[]},{"poster":"TheDemonEmperor","date":"2017-09-09T09:16:55.775+0000","up_votes":1,"down_votes":0,"body":"Post your chat log, lets see.","replies":[]}]}