{"poster":"LuluTopSionMid","date":"2018-11-23T18:52:18.636+0000","title":"Do you ever get the impression that Riot Support hates players who play Off-Meta?","subforum":"Player Behavior","embed":{"description":"r/leagueoflegends: This is a subreddit devoted to League of Legends.","url":"https://www.reddit.com/r/leagueoflegends/comments/9zqt9g/i_know_riot_support_does_their_honest_best_but_do/","image":"https://external-preview.redd.it/IBeO1kfoJGiaTnEWxn9KY-8tVMaR1gR-cnDwLhbB9ss.jpg?auto=webp&s=b1cd4d8408f0a6803a45529d307e31e6ce857a8f"},"up_votes":37,"down_votes":14,"body":"So I was looking at that post about instilling the will to win and comeback victories etc thread, and some guy posted that despite doing great against the odds he ends up banned on his account **_For Playing Ezreal Support_** which is pretty darn hilarious. Personally, I think we still live in a highly toxic community that disavows any attempt to play the game differently than what they are used to, punishing players at low rank for their ingenuity and creativity while raising them on a pedestal for putting a low rank strategy into use at a high rank. \r\n\r\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/A5AE4R4N-the-key-to-instilling-your-teammates-with-hope-and-the-will-not-to-give-up?comment=0000","replies":[{"poster":"C0l0urless","date":"2018-11-23T20:11:15.923+0000","up_votes":13,"down_votes":1,"body":"Ezreal is quite gold reliant and has 0 utility, I'd say he is an awful example for an off-meta support.","replies":[{"poster":"ı Sona ı","date":"2018-11-24T00:12:21.137+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=C0l0urless,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0006,timestamp=2018-11-23T20:11:15.923+0000)\n>\n> Ezreal is quite gold reliant and has 0 utility, I&#x27;d say he is an awful example for an off-meta support.\n\nThat's only if you discredit his personal flash ability, which essentially lets him bait the enemy team into positions they don't want to be in. High mobility poking is a fair supporting method, like people picking malphite support and spamming Q at the enemy.","replies":[{"poster":"C0l0urless","date":"2018-11-24T00:26:24.943+0000","up_votes":7,"down_votes":0,"body":"That's still worse and has a much narrower application compared to what other supports (even off-meta ones) can do.\n\nHigh mobility poking on a support is fine, but the problem with Ez is that he can't do anything to protect the ADC.","replies":[{"poster":"ı Sona ı","date":"2018-11-24T00:55:53.384+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=C0l0urless,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=000600010000,timestamp=2018-11-24T00:26:24.943+0000)\n>\n> That&#x27;s still worse and has a much narrower application compared to what other supports (even off-meta ones) can do.\n> \n> High mobility poking on a support is fine, but the problem with Ez is that he can&#x27;t do anything to protect the ADC.\n\nBesides being a threat, a deterrent, or maybe he makes the ultimate sacrifice and jumps in front of the ADC to block a thresh grab or an Ashe ult, etc. Thank you Ezreal Supports of the world, I hope I get 20 in a row! But only if you've practiced it sufficiently and understand your role! \n\n{{sticker:sona-playing}}","replies":[{"poster":"2Charmnot2Charm","date":"2018-11-26T02:07:51.069+0000","up_votes":4,"down_votes":0,"body":"> Besides being a threat\n\nToo bad Ezreal depends on having gold to actually deal damage\n\n> a deterrent\n\nWe have Zyra/brand that can deal 10x the damage ezreal does in AOE (with much less gold btw), and the other supports that aren't damage carries can still deterrent enemy players with CC and peal, so once again Ezreal fails.\n\n> or maybe he makes the ultimate sacrifice and jumps in front of the ADC to block a thresh grab or an Ashe ult\n\nImplying you need Ezreal's E to do that when legit any support champion can do that with good positioning, but if you really wanted a support just for that one job look no further because riot already have these 3 perfect for that job {{champion:223}} {{champion:497}} {{champion:201}}","replies":[{"poster":"C9 Aphrolift","date":"2018-11-26T19:19:00.321+0000","up_votes":1,"down_votes":1,"body":"> Implying you need Ezreal's E to do that when legit any support champion can do that with good positioning, but if you really wanted a support just for that one job look no further because riot already have these 3 perfect for that job {{champion:223}} {{champion:497}} {{champion:201}}\n\nYou can use the Ezreal E to effectively against a Blitzcrank hook by body blocked for your ADC.","replies":[{"poster":"2Charmnot2Charm","date":"2018-11-26T20:23:41.482+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=C9 Aphrolift,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=000600010000000000010001,timestamp=2018-11-26T19:19:00.321+0000)\n>\n> You can use the Ezreal E to effectively against a Blitzcrank hook by body blocked for your ADC.\n\n{{champion:12}} {{champion:89}} {{champion:497}} = Supports you don't want to pull because they can freely engage onto your adc now, thanks for the free flash buddy.\n\n{{champion:12}} {{champion:201}} {{champion:89}} {{champion:223}} = supports that don't cared about getting hook cause they have the tankyness to survive early on\n\n{{champion:25}} {{champion:223}}  = Do I really need to explain why morg and kench are here?\n\n{{champion:40}} {{champion:117}} {{champion:267}} {{champion:44}} {{champion:412}}  = If the adc got hooked over these its not instant win unless the adc was low already, because nothing is stopping that adc you just pulled from turning onto your ad instead when their support is ready to cc your adc, the only two adcs' where this doesn't matter is if the blitz is supporting draven/lucian.\n\nTranslation: Stop trying to justify Ezreal support when actual support champions can do anything he has to offer as support 10x better.","replies":[]}]},{"poster":"ı Sona ı","date":"2018-11-26T08:11:55.502+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=2Charmnot2Charm,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00060001000000000001,timestamp=2018-11-26T02:07:51.069+0000)\n>\n> Too bad Ezreal depends on having gold to actually deal damage\n> \n\nToo bad 90% of Ezreals use Klepto for \"gasp\" gold generation so when he's harassing them he \"gasp\" is earning gold. \n\nBasically he's a mercenary for hire, paid to attack the enemy.","replies":[{"poster":"2Charmnot2Charm","date":"2018-11-26T20:04:10.440+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=000600010000000000010000,timestamp=2018-11-26T08:11:55.502+0000)\n>\n> Too bad 90% of Ezreals use Klepto for &quot;gasp&quot; gold generation so when he&#x27;s harassing them he &quot;gasp&quot; is earning gold. \n> \n> Basically he&#x27;s a mercenary for hire, paid to attack the enemy.\n\nAnd that's better than actual support champs using real keystones that buffs their play style with zero downsides how? \n\nAlso Kelpto will NOT make up for the fact that Ezreal will not be getting any gold from minions because he is the support {{sticker:zombie-brand-facepalm}}","replies":[]}]}]},{"poster":"C0l0urless","date":"2018-11-24T10:39:39.657+0000","up_votes":3,"down_votes":0,"body":"He isn't much of a threat tho, especially compared to other damage supports and him having to sacrifice himself to save the ADC from a hook isn't good either, considering many supports could do it and live.","replies":[]}]}]}]},{"poster":"C9 Aphrolift","date":"2018-11-23T20:25:17.434+0000","up_votes":5,"down_votes":2,"body":"I played him both pre and post re-work.  His w used to grant attack speed.\n\nYour gold generation is pretty good at least in bronze elo because many enemy adc's / support's don't make a great effort to dodge q's. You build the blue support item and you get lots of extra gold with Q because of klepto(the old klepto anyway haven't gotten to test the new one really).\n\nThen you just build a tear with iceborn later and you have some slow utility and a damage spike as soon as you transform your tear item which typically happens in under 25 minutes.  Great to poke down enemies when behind or ahead as long as teams are grouping but not engaging.","replies":[{"poster":"C0l0urless","date":"2018-11-23T20:33:10.328+0000","up_votes":2,"down_votes":1,"body":"Hmm, I guess I didn't account for them letting you get Klepto procs, but I am still not the biggest fan of it.\n\nThe lack of utility early game when you arguably need it most seems quite bad and is made worse by the fact damage supports like Brand probably still out-damage you.","replies":[{"poster":"C9 Aphrolift","date":"2018-11-23T20:44:08.069+0000","up_votes":2,"down_votes":1,"body":"Yes, I will concede Brand has better burst damage and cc.  But, I don't have the blue essence available to purchase him.  Do you have any cheaper poke style support recommendations?\n\nAlso, I really like the mobility Ezreal provides.  If the enemy team locks in Blitzcrank I can save any ADC in lane if I'm playing Ezreal by tanking hooks and shifting out after.","replies":[{"poster":"C0l0urless","date":"2018-11-23T21:27:12.099+0000","up_votes":2,"down_votes":1,"body":"> Yes, I will concede Brand has better burst damage and cc. But, I don't have the blue essence available to purchase him. Do you have any cheaper poke style support recommendations?\n\nFiddlesticks is cheap and I heard he is quite annoying to deal with.\n\nEdit: I remembered a few more good ones: Soraka (does quite a lot of damage if you max E first), Zilean and Lux (she is more expensive unfortunately).\n\n> Also, I really like the mobility Ezreal provides. If the enemy team locks in Blitzcrank I can save any ADC in lane if I'm playing Ezreal by tanking hooks and shifting out after.\n\nI don't think that's enough of a pro, considering Pyke can do the same, Morgana can block the hook while also being capable of negating other CC and tank supports are often undesirable hook targets.","replies":[]}]}]}]},{"poster":"Très Pauvre","date":"2018-11-25T00:24:10.677+0000","up_votes":1,"down_votes":0,"body":"i'd say with new klepto that gold farming with ez against a melee support would be totally viable","replies":[{"poster":"C0l0urless","date":"2018-11-25T10:44:05.824+0000","up_votes":1,"down_votes":0,"body":"It still leaves the problem you can't actually support until you buy iceborn.","replies":[{"poster":"Très Pauvre","date":"2018-11-26T16:56:52.885+0000","up_votes":1,"down_votes":0,"body":"Played into a melee support with proper positioning you could apply enough pressure to get your adc through the laning phase and later gear up to be another carry later in the game.  As long as he's getting the adc through the lane phase he's \"actually supporting\" CC and peel don't necessarily have to come from the support role.","replies":[{"poster":"C0l0urless","date":"2018-11-26T17:13:26.282+0000","up_votes":1,"down_votes":0,"body":"Most ADCs cannot protect themselves, especially in the early game, so even getting them through the laning phase might be hard while you have no utility.","replies":[{"poster":"Très Pauvre","date":"2018-11-26T17:47:13.433+0000","up_votes":1,"down_votes":0,"body":"at this point almost every adc has some kind of self peel/CC or mobility and if not they can spec into it sustain which most of them do anyway.\n\nEzreals form of protection is pressure by constantly throwing skill shots.  You hit great, but with the mobility on his e he can exert pressure higher up the lane allowing his adc to position safely.  The pressure he provides in lane is what keeps the adc safe.  Move to midgame he can then pick up side waves and now you've got 2 carries coming out of the bot lane as opposed to 1.\n\nThis is also all keeping in mind ez is warding and sweeping because within this role he still has primary responsibility over vision.  Not that everyone else should be ignoring it either.\n\nI want to also make clear that, in my opinion, ezreal support is not a pick that can be played with/into any comp.  Its niche and pocket pick at best.","replies":[{"poster":"C0l0urless","date":"2018-11-26T18:05:54.260+0000","up_votes":1,"down_votes":0,"body":"His skill shots don't provide enough of a threat to gain pressure against conventional supports, since they have lower base damage and don't travel through minions and with his lack of utility the enemy will always be able to kill your ADC if they manage to land CC on him. The aspect of him becoming a second carry is also underwhelming since support like Brand can do the same without needing to take CS.\n\nVision control is something every champion is capable of so this isn't any kind of big plus either.\n\nI don't see a viable niche for him since the enemy support would pretty much have to be useless for it to work.","replies":[]}]}]}]}]}]}]},{"poster":"SonicAF","date":"2018-11-23T23:35:15.822+0000","up_votes":13,"down_votes":4,"body":"Back in season 5 I climbed to diamond with jungle Sona. I had to face the same rhetoric every day - \"your pick is not optimal and you should be banned\".\n\nIt was as optimal as it gets. It was perfect for my strengths and it covered my weaknesses as a human. It was surprisingly cheesy, functioning completely different to other junglers, making counterjungling nearly impossible - I developed weird paths and untilized different smites specifically to play around enemy invades. It was a decent dueling pick. It was a lategame carry.\n\nPeople in my lobbies did not know or believe it. They could not crack it. So they flamed all the time and, you can be sure, I accumulated quite a few reports in those days, especially in the games I lost.\n\nJungle got reworked, meta shifted. She doesn't carry me to diamond anymore, but I am still playing her from time to time. Just like I play Sona mid and Sona bottom as a carry.\n\nYou do not know strengths of support Ezreal. You can not crack it like that in a forum thread. Your idea that the player has to be banned because it doesn't perform in your head is directly harmful for the game, shutting down sparks of creativity and potentially harrassing people doing something great that you fail to understand. Do you believe it doesn't work? Well, there is MMR to judge what works and what doesn't work. Who is next? People with high ping? People maining tier 2 meta champions? People unable to kite on ad carry?\n\nJesus, merely having this conversation disgusts me. Reading this thread I want to distance myself from forum community more than ever.\n\nShame on you, people. \n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"ı Sona ı","date":"2018-11-24T03:14:16.689+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SonicAF,realm=EUW,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=000d,timestamp=2018-11-23T23:35:15.822+0000)\n>\n> Back in season 5 I climbed to diamond with jungle Sona. I had to face the same rhetoric every day - &quot;your pick is not optimal and you should be banned&quot;.\n> \n> It was as optimal as it gets. It was perfect for my strengths and it covered my weaknesses as a human. It was surprisingly cheesy, functioning completely different to other junglers, making counterjungling nearly impossible - I developed weird paths and untilized different smites specifically to play around enemy invades. It was a decent dueling pick. It was a lategame carry.\n> \n> People in my lobbies did not know or believe it. They could not crack it. So they flamed all the time and, you can be sure, I accumulated quite a few reports in those days, especially in the games I lost.\n> \n> Jungle got reworked, meta shifted. She doesn&#x27;t carry me to diamond anymore, but I am still playing her from time to time. Just like I play Sona mid and Sona bottom as a carry.\n> \n> You do not know strengths of support Ezreal. You can not crack it like that in a forum thread. Your idea that the player has to be banned because it doesn&#x27;t perform in your head is directly harmful for the game, shutting down sparks of creativity and potentially harrassing people doing something great that you fail to understand. Do you believe it doesn&#x27;t work? Well, there is MMR to judge what works and what doesn&#x27;t work. Who is next? People with high ping? People maining tier 2 meta champions? People unable to kite on ad carry?\n> \n> Jesus, merely having this conversation disgusts me. Reading this thread I want to distance myself from forum community more than ever.\n> \n> Shame on you, people. \n> {{sticker:slayer-jinx-unamused}}\n\nYes!","replies":[]},{"poster":"C9 Aphrolift","date":"2018-11-23T23:56:00.450+0000","up_votes":2,"down_votes":0,"body":"I feel a little inspired after this.  When my suspension is up and when pre-season is over I'm going to try and see how high I can climb as an Ezreal support main.  Hopefully, I won't get banned :)","replies":[]}]},{"poster":"Mordepool","date":"2018-11-23T18:56:56.716+0000","up_votes":9,"down_votes":2,"body":"Just look at all the diversity in botlane. \nThen look at most of the botlane mains complain and beg for nerfs only vs that diversity. Just an example.\n\nThe more the game  changes the more people want it to stay the same","replies":[]},{"poster":"raizo1988","date":"2018-11-24T11:30:38.948+0000","up_votes":3,"down_votes":0,"body":"This is what alot of off-meta players being complaining for YEARS! Pick and play off-meta.\n\nRIOT supports: This is not how this champion is supposed to play! *Suspend account*\n\nSeriously....sometimes whoever worked as RIOT supports really really bad at doing their jobs! Intentional feeders and Toxic players running free while off-meta players get banned for nothing!","replies":[]},{"poster":"SanKakU","date":"2018-11-23T19:37:35.335+0000","up_votes":3,"down_votes":0,"body":"To be fair, after Ezreal's latest rework, he can no longer trigger Summon Aery on allies.","replies":[]},{"poster":"Fondling Gems","date":"2018-11-23T20:36:34.731+0000","up_votes":1,"down_votes":1,"body":"Something to consider is that yes there are people in player support who hate off meta picks.  That is because player support is composed of a large number of humans who each have their own opinions.\n\nIt is worth noting that you have provided one case where someone did get banned, and in the comments someone had their ban get overturned.  Riot has rules about this specifically to handle the fact that people think differently.\n\nYou also aren't going to hear about the times people didn't get a punishment when player support looked over a game because.... no one except the player support agent would even know it was a possibility.\n\nBut I guess we don't focus on the positive side enough so here are some examples where I didn't get banned:\n\nI just played 3 games as Nasus, Xerath, and Karthus as APC with an AP rek'sai support each game.  We won 2/3 of them and no one so much as commented on our picks in a single one of the games.\n\nI used to play quite a bit of support J4 with flag max Aery and items like Ardent Censor and Grail.  There was only 1 times someone got seriously upset and 2-3 other times where people were offput by it at all.\n\nSeason 4 frozen mallet Ashe support.\n\nI play Kassadin support.\n\nI played an AP Kog'maw support game where everyone was quite supportive of me.\n\nIn other positions I have been playing J4 Mid for a long time as well as the occasional Vi mid game.\n\nJhin top is funny and I have never gotten flamed for that even when I feed.\n\nPeople are cool with whatever role I play Thresh/Taric in.  Taric Jg is a favourite.\n\nMy Poppy builds usually end up being full AD and sometimes appear in the bot lane.\n\nAD Elise Top anyone?  Will admit I got flamed fairly hard in one of those games but for the most part it wasn't too bad.\n\nRenekton Support is a mean pick.\n\nBlitz Top into Irelia is a favourite of mine now.\n\nTank Karma Top.\n\nQuinn Mid.\n\nI don't think I have ever been flamed for playing AD Soraka except in an ARAM game of all things.\n\nAP Raka top is also pretty funny.\n\nGot an Aatrox support game in that went really well.\n\nDarius support has always done well by me, and my team never complains.\n\nI played old Aatrox in any of the 5 positions and no one ever flamed.\n\nI do always ask first so it might not count but I have never gotten flamed for reviving the River Shen meme.\n\n-------------------------------------------------\n\nSure I get flamed on occasion, but y'know what?  For how often I play off meta I really do get flamed more for being a terrible ADC player than for doing off meta stuff, and I have never once been so much as warned for any kind of behavior by player support.","replies":[{"poster":"TwitchInMyPants","date":"2018-11-23T21:55:30.327+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Fondling Gems,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0008,timestamp=2018-11-23T20:36:34.731+0000)\n>\n> Something to consider is that yes there are people in player support who hate off meta picks.  That is because player support is composed of a large number of humans who each have their own opinions.\n> \n> It is worth noting that you have provided one case where someone did get banned, and in the comments someone had their ban get overturned.  Riot has rules about this specifically to handle the fact that people think differently.\n> \n> You also aren&#x27;t going to hear about the times people didn&#x27;t get a punishment when player support looked over a game because.... no one except the player support agent would even know it was a possibility.\n\nYes its fine that you weren't banned, but there are multiple examples of it happening in earlier seasons with the big ones being a couple smite Supports, a Support Nunu and a Support Singed.  The Nunu was noted for being toxic but Riot defended the Support Singed ban on the basis of it being too disruptive for an adc player.\n\nFrankly, I'd rather ban people who actually int rather than ban people who are off meta.  I know these people would get banned sometimes if we started actually banning inters, but the fact that someone who plays Support Ezreal gets banned over someone who basically steals jungle camps, walks down lanes, and steals kills to pad their stats while not engaging gets to ruin my games and continue playing is fucking absurd.  If both got banned and the false ban got revoked that'd be one thing, but most gameplay infractions that aren't a Rammus running down mid with a bunch of zeals are totally ignored and the most common case of false bans are off-meta picks.\n\nIts reasonable for people to be concerned that this is a thing.  Its not reasonable to say Rioters should be fired but its going to hurt player trust to just outright ban people for trying something so they shouldn't be surprised when they allow people the authority to do this and there's no repercussions that people are mad.  They don't even give compensation RP or anything like they used to in previous seasons, you lose time on the game for a false crime and they spit you out back out into the system... if you got banned for off meta picks do you think you'd still be wanting to actively play them or would you think about how you could be reported and have concerns about it?","replies":[]}]},{"poster":"Spekkıo","date":"2018-11-24T16:35:04.936+0000","up_votes":2,"down_votes":5,"body":"I'd 100% ban everyone who plays an \"off-meta\" support and it has nothing to do with whether or not the pick is off-meta.\n\nIt's because it's support and 99.999999999% of the time when someone wants to play an \"off-meta\" support, or in other words a carry in a support role, it's because they were auto-filled into support and they want to K.S. the actual carry, use the fact that they have a couple kills as an excuse to start taking C.S., jungle buffs, more kills from other carries, etc...\n\nThis happens all the fucking time and it always stems from the mentality that these people refuse to support anyone but themselves, even at the expense of everyone else's chances of winning the game.","replies":[{"poster":"MasterDClone","date":"2018-11-24T22:13:53.831+0000","up_votes":1,"down_votes":0,"body":"shouldn't we remove autofill tho, seems to solve the problem, and i play off meta supports because i can't farm for shit, but in support with the support item i can get a lot of gold and still pop off","replies":[{"poster":"Spekkıo","date":"2018-11-25T17:43:51.062+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Master2139,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000,timestamp=2018-11-24T22:13:53.831+0000)\n>\n> shouldn't we remove autofill tho, seems to solve the problem, and i play off meta supports because i can't farm for shit, but in support with the support item i can get a lot of gold and still pop off\n\nI've never understood why they put autofill into ranked queues.  I would much rather wait a couple more minutes for a queue pop and have people genuinely experienced in playing the roles they're queueing up for instead of some bitter \"mid or feed\" type jackass slotted into support out of convenience.","replies":[{"poster":"ı Sona ı","date":"2018-11-25T20:46:49.172+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Spekkıo,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=001900000000,timestamp=2018-11-25T17:43:51.062+0000)\n>\n> I've never understood why they put autofill into ranked queues.  I would much rather wait a couple more minutes for a queue pop and have people genuinely experienced in playing the roles they're queueing up for instead of some bitter \"mid or feed\" type jackass slotted into support out of convenience.\n\nWell, they put autofill so that 10 minutes queues would be the thing of the past. More so, players NEED to learn to play more than one position so they can be helpful in all scenarios.","replies":[{"poster":"Spekkıo","date":"2018-11-25T21:04:04.200+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0019000000000000,timestamp=2018-11-25T20:46:49.172+0000)\n>\n> Well, they put autofill so that 10 minutes queues would be the thing of the past. More so, players NEED to learn to play more than one position so they can be helpful in all scenarios.\n\nPeople aren't learning how to play support, they're learning how to circumvent playing support when autofilled as support without being punished for it under the guise of \"playing an off-meta pick and that should be okay.\"\n\nSo maybe we should learn how to do one of two things :\n\nA ) Encourage and teach people how to effectively play support so that they don't do it.\nB ) Find a way to punish people for doing it.\n\nIt seems only logical, as opposed to today's standard of \"Just fucking deal with it and if you complain, you'll be punished.\"\n\nAgain, I am not talking about people who are actually playing an off-meta pick as a support, to support.  I'm talking about people playing carries as a support, not playing as a support, not itemizing as a support, not vision controlling as a support, intentionally KS'ing carries, pushing lanes themselves, etc...","replies":[{"poster":"ı Sona ı","date":"2018-11-25T22:54:22.256+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spekkıo,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000,timestamp=2018-11-25T21:04:04.200+0000)\n>\n> People aren&#x27;t learning how to play support, they&#x27;re learning how to circumvent playing support when autofilled as support without being punished for it under the guise of &quot;playing an off-meta pick and that should be okay.&quot;\n> \n> So maybe we should learn how to do one of two things :\n> \n> A ) Encourage and teach people how to effectively play support so that they don&#x27;t do it.\n> B ) Find a way to punish people for doing it.\n> \n> It seems only logical, as opposed to today&#x27;s standard of &quot;Just fucking deal with it and if you complain, you&#x27;ll be punished.&quot;\n> \n> Again, I am not talking about people who are actually playing an off-meta pick as a support, to support.  I&#x27;m talking about people playing carries as a support, not playing as a support, not itemizing as a support, not vision controlling as a support, intentionally KS&#x27;ing carries, pushing lanes themselves, etc...\n\nWhat do you build as support Annie/Brand? Knights Vow? Or damage damage damage?","replies":[{"poster":"Spekkıo","date":"2018-11-25T23:16:40.189+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=001900000000000000000000,timestamp=2018-11-25T22:54:22.256+0000)\n>\n> What do you build as support Annie/Brand? Knights Vow? Or damage damage damage?\n\nI'd imagine that's a bit more nuanced of a question than it originally seems.\n\nThe first question should be whether or not Annie/Brand are viable off-meta support champions and why.\n\nAssume you build damage though, you're going to need more gold than you normally would as almost all carry items, if I'm not mistaken, are far more expensive than support items.\n\nWhere are you going to get that gold from?  Who would be getting that gold otherwise?  Is it worth the traditional power spikes from big team-focused support items to wait for more self-centered power spikes from carry items?","replies":[{"poster":"ı Sona ı","date":"2018-11-25T23:20:11.057+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spekkıo,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0019000000000000000000000000,timestamp=2018-11-25T23:16:40.189+0000)\n>\n> I&#x27;d imagine that&#x27;s a bit more nuanced of a question than it originally seems.\n> \n> The first question should be whether or not Annie/Brand are viable off-meta support champions and why.\n> \n> Assume you build damage though, you&#x27;re going to need more gold than you normally would as almost all carry items, if I&#x27;m not mistaken, are far more expensive than support items.\n> \n> Where are you going to get that gold from?  Who would be getting that gold otherwise?  Is it worth the traditional power spikes from big team-focused support items to wait for more self-centered power spikes from carry items?\n\nYou didn't answer whether or not they'd build knights vow or not, or other \"traditional support items.\" \n\nThis whole \"viability\" thing you also threw into the mix as well for some reason as though the question is about viability. It isn't. The conversation was about Riot Support banning someone for \"role stealing\" because they picked ezreal support and adcs who didn't want to work with them. It isn't a question of viability at that points its just an emotional response from immature players.\n\nYou aren't an immature emotional player right?","replies":[{"poster":"Spekkıo","date":"2018-11-25T23:49:09.889+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000000000000000,timestamp=2018-11-25T23:20:11.057+0000)\n>\n> You didn&#x27;t answer whether or not they&#x27;d build knights vow or not, or other &quot;traditional support items.&quot; \n> \n> This whole &quot;viability&quot; thing you also threw into the mix as well for some reason as though the question is about viability. It isn&#x27;t. The conversation was about Riot Support banning someone for &quot;role stealing&quot; because they picked ezreal support and adcs who didn&#x27;t want to work with them. It isn&#x27;t a question of viability at that points its just an emotional response from immature players.\n> \n> You aren&#x27;t an immature emotional player right?\n\nNo, the conversation is about banning people not playing as a support while being autofilled into the support role.\n\nThat includes, but is not limited to, viability.  You want it to be ONLY about what items they build.\n\nIf you're going to pick a champion that has zero viability as a support just to say that you can't itemize as a support so that you can build damage, then you're taxing your team by your choices.\n\nYou don't arbitrarily get more gold in-game because you're a carry in the support role.  It doesn't come out of thin air.  You have to take it from someone else on the team.\n\nThe moment you get into completely abnormal choices like Darius support, you should be at the mercy of your team, _if_ it detracts from your responsibilities as a support.\n\nAgain, if you want to play Darius support and you build support and you fight for vision, etc... then I personally don't have a problem with it.  I'm also one person.\n\nWhether or not I think it's okay, doesn't necessarily mean that your team mates think it's okay.  I believe someone from Riot, years ago, coined it best, when they were talking about you needing to get permission from your team prior to forcing them into any off-the-wall decisions.\n\nIt's only fair to the 4 other people on your team that you're about to gamble the game with, to ask if they're alright with it.","replies":[{"poster":"ı Sona ı","date":"2018-11-26T00:05:29.935+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Spekkıo,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=001900000000000000000000000000000000,timestamp=2018-11-25T23:49:09.889+0000)\n>\n> No, the conversation is about banning people not playing as a support while being autofilled into the support role.\n> \n> That includes, but is not limited to, viability.  You want it to be ONLY about what items they build.\n> \n> If you're going to pick a champion that has zero viability as a support just to say that you can't itemize as a support so that you can build damage, then you're taxing your team by your choices.\n> \n> You don't arbitrarily get more gold in-game because you're a carry in the support role.  It doesn't come out of thin air.  You have to take it from someone else on the team.\n> \n> The moment you get into completely abnormal choices like Darius support, you should be at the mercy of your team, _if_ it detracts from your responsibilities as a support.\n> \n> Again, if you want to play Darius support and you build support and you fight for vision, etc... then I personally don't have a problem with it.  I'm also one person.\n> \n> Whether or not I think it's okay, doesn't necessarily mean that your team mates think it's okay.  I believe someone from Riot, years ago, coined it best, when they were talking about you needing to get permission from your team prior to forcing them into any off-the-wall decisions.\n> \n> It's only fair to the 4 other people on your team that you're about to gamble the game with, to ask if they're alright with it.\n\nSee that's the thing, its YOUR OPINION that it has 0 viability. Like it used to be players opinions that Taliyah/Vayne/Ezreal/Twisted Fate weren't viable jungles until someone at a high elo did it. Same with MF support, same with Annie/Brand Support, same with Viktor top, etc etc etc etc etc. \n\nWhat you believe is good and right isn't the standard staple of everyones collected opinion. As someone who plays Sona top, let me give you advice. \n\nIt Does Not Matter What The Strategy Is If It wins. It does not matter if you don't LIKE the strategy it if it wins. The collective goal of ranked is not to have a feel good time and everyone does the same thing over and over and over but to Win and Rank Up. I hope I have 20 ezreal supports in a row to help ensure my victory.","replies":[{"poster":"Spekkıo","date":"2018-11-26T00:27:22.062+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0019000000000000000000000000000000000001,timestamp=2018-11-26T00:05:29.935+0000)\n>\n> See that&#x27;s the thing, its YOUR OPINION that it has 0 viability. Like it used to be players opinions that Taliyah/Vayne/Ezreal/Twisted Fate weren&#x27;t viable jungles until someone at a high elo did it. Same with MF support, same with Annie/Brand Support, same with Viktor top, etc etc etc etc etc. \n> \n> What you believe is good and right isn&#x27;t the standard staple of everyones collected opinion. As someone who plays Sona top, let me give you advice. \n> \n> It Does Not Matter What The Strategy Is If It wins. It does not matter if you don&#x27;t LIKE the strategy it if it wins. The collective goal of ranked is not to have a feel good time and everyone does the same thing over and over and over but to Win and Rank Up. I hope I have 20 ezreal supports in a row to help ensure my victory.\n\nYou're saying that all champions are equally as viable as any other for any role in the game?","replies":[{"poster":"ı Sona ı","date":"2018-11-26T00:43:59.833+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Spekkıo,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000000000000000000000010000,timestamp=2018-11-26T00:27:22.062+0000)\n>\n> You're saying that all champions are equally as viable as any other for any role in the game?\n\nIf a player is skilled enough to pull it off, yes.","replies":[{"poster":"Spekkıo","date":"2018-11-26T14:53:48.265+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=001900000000000000000000000000000000000100000000,timestamp=2018-11-26T00:43:59.833+0000)\n>\n> If a player is skilled enough to pull it off, yes.\n\nIf Faker can solo carry games as Ivern ADC in Bronze 3, it doesn't mean Ivern is a viable ADC.\n\nIt simply means the skill discrepancy between the players is so high that it can accommodate for non-sense like this.","replies":[{"poster":"Spekkıo","date":"2018-11-26T21:48:23.109+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000000000000000000000010000000000000002,timestamp=2018-11-26T20:52:01.901+0000)\n>\n> The only thing i'm citing is a few of hundreds of examples of someone trying something different than what you believe to be the correct way to play the game and you disliking it because you haven't actually tried it yourself and personally tested its merits, only going by mob mentality. Think for yourself, be a trend setter. Don't be sheep. INNOVATE. Be Amumu/Malphite botlane like Riot suggest. If you like, why don't you play a couple normals as Ezreal support, and then come back with your results? But don't start with \"compared to x y z.\" Just answer if it did the job they said it could do, or if it did not.\n\nIf you want to innovate, do it in normals.\n\nIf you can't agree on the basic principle that some champions are better than other champions at certain aspects of the game, then we don't have any room for conversation beyond that.\n\nYou're either not being honest with yourself or you're not being honest with me.","replies":[]},{"poster":"Spekkıo","date":"2018-11-26T20:25:04.270+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000000000000000000000010000000000000000,timestamp=2018-11-26T19:15:47.456+0000)\n>\n> Have you tried it? \n> \n> They said Annie was a non-sense support before someone good did it. Ezreal/TF/Taliyah jungle as well, etc.\n\nThat's great but you're citing a handful of examples which are applicable to your narrative as opposed to the vast majority of times in which it doesn't.","replies":[]}]}]}]}]},{"poster":"C9 Aphrolift","date":"2018-11-25T23:57:46.896+0000","up_votes":1,"down_votes":0,"body":"What champions do you play and in what roles?","replies":[{"poster":"Spekkıo","date":"2018-11-26T00:10:25.306+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=C9 Aphrolift,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=0019000000000000000000000000000000000000,timestamp=2018-11-25T23:57:46.896+0000)\n>\n> What champions do you play and in what roles?\n\nDifficult question to answer, sorry not trying to be evasive here but I haven't SERIOUSLY played League in a long time.\n\nI came back, made this account, which is 26 now.  I've spent most of my time playing Jungle Nunu, I'd say.  I was originally playing Akali _( I've tried her in pretty much every role at least once or twice )_ for the most part cause I just liked the KDA skin and her playstyle but really fell in love with Nunu. \n\nSo I bought all the available skins I could for him and just played the shit out of him.\n\nI've been trying to get good at Aatrox lately because I like the way he struts around and I've been playing him in the jungle.\n\nBut I'd also like to say that none of this is ranked, either.  They're pre-30 blind pick normals so I wouldn't expect me to be playing support Akali in ranked, for instance.\n\nGenerally speaking, when I'm 30+ and playing ranked on any account, I play straight-forward, widely accepted champions in their respective roles.\n\nI'll play mages/assassins in mid-lane.\nI'll play tanks or bruisers in top/jungle.\nI'll play traditional adc's in adc.\nI'll play traditional supports in support.\n\nI don't try to reinvent the wheel when I play competitively, but that's just me.","replies":[{"poster":"C9 Aphrolift","date":"2018-11-26T00:19:41.517+0000","up_votes":1,"down_votes":1,"body":"> Difficult question to answer, sorry not trying to be evasive here but I haven&#x27;t SERIOUSLY played League in a long time.\n> \n> I came back, made this account, which is 26 now.  I&#x27;ve spent most of my time playing Jungle Nunu, \n\nAll good.  Thank you for taking the time to answer.  Any champion would do really for this example.  I think Nunu is a fine pick.\n\nHow many games have you played on Nunu?  And how many times have you had to justify your pick to teammates?","replies":[{"poster":"Spekkıo","date":"2018-11-26T00:40:31.927+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=C9 Aphrolift,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=001900000000000000000000000000000000000000000000,timestamp=2018-11-26T00:19:41.517+0000)\n>\n> All good.  Thank you for taking the time to answer.  Any champion would do really for this example.  I think Nunu is a fine pick.\n> \n> How many games have you played on Nunu?  And how many times have you had to justify your pick to teammates?\n\nLet me preface the rest of our conversation by saying, I'm at my parents' place for the week and I'm sharing a computer so I might disappear here soon because it's getting close to a time where my sister normally wants on so if I'll address anything you have to say in the morning when I wake up.\n\nI'm trying to find a number for the amount of games I've played with Nunu but I can't figure it out.  I've played enough to get mastery 5 on him on this account already, technically 6 because I have the shards n' what not to make the mastery 6 token I just haven't wanted to waste my BE on it yet.\n\nI haven't had to justify playing him yet in any of the games.  Nunu's been a jungler since Nunu's been a champion, I believe, so nobody's ever been at odds with the pick.","replies":[{"poster":"Spekkıo","date":"2018-11-26T14:50:03.372+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=C9 Aphrolift,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190000000000000000000000000000000000000000000000000000,timestamp=2018-11-26T01:25:48.876+0000)\n>\n> It&#x27;s all good. Reply when you want to.\n> \n> But when you have to start to justify your picks to other players on your team you can see how that might be an issue, right?\n> \n> I could point out that I&#x27;ve had bad experiences with Nunu players and there&#x27;s 25 other junglers with [higher winrates](https://champion.gg/statistics/#?roleSort=Jungle&amp;sortBy=general.winPercent&amp;order=descend) at plat+ elo and could you please pick something else?\n> \n> Do you think it should be a punishable offense, if you choose to play Nunu after I&#x27;ve typed this?\n\nI almost feel like there's a distinction being lost in these conversations and I can't tell if you're doing it intentionally or not.\n\nI've already given caveats for people playing off-meta picks as a support, did I not?  I think I've made it abundantly clear that this is okay.\n\nI've only suggested that you need to justify your pick if it's something off-the-wall, not something that's standard and not necessarily as popular as another pick.\n\nThese aren't the same things.\n\nAnd you're completely ignoring every other variable in the entire situation to hyper focus on one.  You've been doing this since we started talking with different points each time.\n\nIf someone wants to play a champion in support that is an off-meta support or a champion that they feel could fulfill the roles of a support but isn't necessarily considered a traditional support, that's fine.  But you have an obligation to your team to fulfill the responsibilities of that role.\n\nThis isn't complicated.  If you're going to be intentionally trying to KS, steal farm, push lanes, etc... then yes, you're meant to justify that kind of playstyle change with your team because you're effectively stealing resources they'd generally have available to them.\n\nIt doesn't matter if YOU as a person are perfectly fine with random strangers doing this in your game, it matters if the community as a whole agrees to it or in the hypothetical case that I suggest, it'd matter if your team agreed to it.\n\nAlso, Nunu is designed to be a jungler.  Regardless of whether or not he's as strong as other junglers right now, doesn't mean he's not traditionally a jungler.  A more honest example would be doing something like Braum Jungle.  If I had played enough normals with Braum Jungle that I thought it'd be a solid strategy, then yes I'd be okay with needing the permission of my team mates to try it in their ranked games.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"C9 Aphrolift","date":"2018-11-24T23:12:09.245+0000","up_votes":1,"down_votes":1,"body":"> It&#x27;s because it&#x27;s support and **99.999999999%** of the time when someone wants to play an &quot;off-meta&quot; support, or in other words a carry in a support role, it&#x27;s because they were auto-filled into support and they want to K.S. the actual carry, use the fact that they have a couple kills as an excuse to start taking C.S., jungle buffs, more kills from other carries, etc...\n\nI would venture to say it's not that high a percent because I play \"off-meta\" supports and in around 80% of my games I queue for \"support/fill\".  My games alone would skew this to a lower percentage.\n\nI like the idea of making a champ I enjoy playing work in the role I enjoy playing the most.","replies":[{"poster":"Spekkıo","date":"2018-11-25T17:41:34.931+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=C9 Aphrolift,realm=NA,application-id=ZGEFLEUQ,discussion-id=GFIVL8Tv,comment-id=00190001,timestamp=2018-11-24T23:12:09.245+0000)\n>\n> I would venture to say it&#x27;s not that high a percent because I play &quot;off-meta&quot; supports and in around 80% of my games I queue for &quot;support/fill&quot;.  My games alone would skew this to a lower percentage.\n> \n> I like the idea of making a champ I enjoy playing work in the role I enjoy playing the most.\n\nIt's not to be a literal percentage, it's simply put to emphasize the overwhelming majority of times that it happens as I've detailed in my post and NOT how you've trying to suggest YOU personally play off-meta supports.\n\nEveryone who's ever played Solo Queue KNOWS this to be the case.\n\nI don't give two shits who you play in the support role as long as you play them as a support, but that's almost never the case.\n\nIt's the same as when the person locks in Lux support.  They don't play to support you, they don't ward properly, they buy one gold item and that's only to help them get more gold through laning phase then it's glass cannon AP stacking same as a mid-laner, they actively attempt to try and take every kill and use their ults to snipe across the map to KS their team mates, they solo push lanes out instead of letting the traditional carries get the gold, etc...\n\nIt's the selfish mentality that even though they got auto-filled to support, they feel as though they can play their carries in the role and skirt the responsibilities of the role altogether.\n\nFuck those people.","replies":[]}]}]}]}