{"poster":"tigre05","date":"2017-01-25T07:01:48.578+0000","title":"dejen de hecharle la culpa a los demas...","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":5,"body":"lo q dice el titulo.. dejen de hecharle la culpa  los demas si no suben,,, me canse de ver gente bronce plata oro platino diciendo q por los trolls no suben...  no llegan a divisiones maas altas porque no saben jugar, o al menos no son autocriticos, los demas son los demas asi terminen 0/10 no te toca la misma persona todas las partidas.... y aunque te toque dos partidas seguidas el es el malo no vos....  a menos q vos tmb seas malo... me da bronca el tipico oro 5 con 100 prtidas q le dice &quot;plata o bronce&quot; al q tiene una o 2 div menos,... cuando con tantas partidas siguen siendo pts..... autocritica muchachos si son malos son malos y punto.,..\r\n\r\n\r\npd: fijense mis stats y mis kda cn esta cuenta es una smurf q juego cuandoo me pinta el pinocho y no andole hechando la culpa a los demas si pierdo o si salen 0/24","replies":[{"poster":"Jaden101","date":"2017-01-25T07:07:47.657+0000","up_votes":3,"down_votes":0,"body":"Viejo, apoyo que uno esta en su división por uno mismo, pero también se lo que es ser support y que en ranked tu adc se vaya afk y una janna con item de support no puede farmear sola bajo torre, y menos si el equipo rival se aprovecha y te detrosa bajo torre.. A ver si, es una partida la que pierdo por el afk o por el trol, pero si es una promo? o incluso puedes ver en op.gg que jugué 40 ranked y 7 fueron sin adc.. (soy main support) y incluso de esas 7, gane 2. \n\nPerdí 5 por tener un adc afk, no fueron seguidas, que tal si fueron en 3 promos mías que justo me toca el afk... **Te complica mucho mas subir de este modo, imposible? No no lo es, ¿Estás en bronce por los trols? No, porque el que sabe jugar, sale con o sin trols, pero si tengo que admitir que pasas una mala experiencia y se te hace muchísimo mas difícil por esta clase de gente.**\n\n\nPD: Yo estoy en bronce pq quiero :D, no fuera de broma, estoy jugando ranked para mejorar no para subir elo, ya comprobé que con syndra mid, salgo de bronce cuando quiera, pero estoy entrenando y quiero salir de bronce jugando support.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-25T07:22:03.738+0000","up_votes":2,"down_votes":0,"body":"buen punto actualmente las posiciones mas dificiles para subir son adc y supp, por el estado actual de los adc y de supp por que como dices si tu adc se va afk te vas al pozo.\n\nsobre todo en estas ligas bajas donde si el top saca 2 kills no hayan como pararlo lo mismo pasa en mid me incluyo pero a un adc con 2 kills lo mata cualquiera. \n\npero es verdad que si a ti te toca una vez el troll despues al otro equipo le puede tocar el troll donde hay una racha de ganadas hay un racha de perdidas. a mi me pasa en mi promo de b3 a b2 que la primera promo la perdi por culpa de un fidel suporte, y despues perdi la otra, luego por la mañana jugue jugue 2 una para entrar a la promo y otra para subir y gane las 2 facilmente","replies":[]},{"poster":"tigre05","date":"2017-01-25T07:42:01.919+0000","up_votes":1,"down_votes":0,"body":"aunque duela y no guste si queres ser sup hasta oro alto o incluso platino juga sups ap de daño","replies":[]}]},{"poster":"Dyslexic Wolf","date":"2017-01-25T07:56:00.813+0000","up_votes":2,"down_votes":0,"body":"Tigre te vi comentar en un post donde el autor decía que quería adoptar un bronce y vos comentaste. ¿Por que lo hiciste?","replies":[{"poster":"FedecarboneroUY","date":"2017-01-25T08:15:00.333+0000","up_votes":1,"down_votes":0,"body":"porque no sube por los trolls y afks {{sticker:slayer-jinx-wink}} \nkappa","replies":[]}]},{"poster":"SphinxZeld","date":"2017-01-25T15:10:14.766+0000","up_votes":1,"down_votes":0,"body":"Report tigre no gank feed gg izi???","replies":[]},{"poster":"The machine Vi","date":"2017-01-25T14:15:53.774+0000","up_votes":1,"down_votes":0,"body":"entonces usted no tiene habilidad tampoco","replies":[]},{"poster":"Attyla","date":"2017-01-25T08:16:54.079+0000","up_votes":1,"down_votes":0,"body":"me apunto... te dejo mi op.gg para q veas mis stats y mi win rate... http://las.op.gg/summoner/userName=tigre05 deja de pedirle  a gente que te suba vos osino no tendria gracia el sistema subi por tu cuenta y valoraras mas ser plata 2 con tu esfuerzo que oro 2 eloboosteado","replies":[{"poster":"Stay in Tower","date":"2017-01-25T13:09:18.396+0000","up_votes":1,"down_votes":0,"body":"yo no veo nada especial, tengo amigos en plata con el mismo winrate o más xD","replies":[{"poster":"AMD","date":"2017-01-25T13:33:52.094+0000","up_votes":1,"down_votes":0,"body":"St3 m3n","replies":[]}]}]}]}