{"poster":"Goxzy","date":"2017-06-20T00:21:43.340+0000","title":"Client problems","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"My Client is stuck on Reconnect. This happened after my game was dc'd. and that game was 2 hours ago. so i got on my other account and i could log into the servers fine,* and play a match with no problems* my account is stuck like this and i would enjoy to play this game. please help","replies":[{"poster":"Goxzy","date":"2017-06-20T00:39:51.629+0000","up_votes":1,"down_votes":0,"body":"iv tried almost all of it, its not my connection, my 2nd account is working fine right now, but when i log onto this one it keeps trying to connect me to a game over 2 hours ago..","replies":[{"poster":"Másón","date":"2017-06-20T00:41:12.736+0000","up_votes":2,"down_votes":0,"body":"We were in the same game and I'm having the same exact issues, now unless some how we both have the exact SAME computer issues (not possible) its gotta be on their end.","replies":[{"poster":"Dr STUBBYchaser","date":"2017-06-20T00:46:47.383+0000","up_votes":1,"down_votes":0,"body":"I am still having the issue, tried a third account...cannot even make a custom game on 2 different machines, all other games work (GW2. Diablo III etc.)","replies":[]},{"poster":"Goxzy","date":"2017-06-20T00:43:40.824+0000","up_votes":1,"down_votes":0,"body":"No clue on what this bug is Tbh","replies":[]}]}]},{"poster":"Goxzy","date":"2017-06-20T00:49:52.189+0000","up_votes":1,"down_votes":0,"body":"i can play a game on my other account.. and not disconnect.","replies":[]},{"poster":"Broporo","date":"2017-06-20T00:34:11.467+0000","up_votes":1,"down_votes":0,"body":"Hmmmm this might have been a weird coincidence where you were finally able to get logged in with your second account. It doesn't currently look like anything is wrong with this account on the back end, so do me a favor and try updating some of your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) just in case something was reset there.","replies":[]},{"poster":"Dr STUBBYchaser","date":"2017-06-20T00:33:05.171+0000","up_votes":1,"down_votes":0,"body":"i cannot get on my other account, i even tried a different computer...","replies":[]},{"poster":"Goxzy","date":"2017-06-20T00:30:11.368+0000","up_votes":1,"down_votes":0,"body":"I can get on my other account and the game works fine. so this has to be a curtain issue.","replies":[]},{"poster":"Dr STUBBYchaser","date":"2017-06-20T00:25:39.805+0000","up_votes":1,"down_votes":0,"body":"Same problem although it happens with my account and my friends i can log in and get lobby but cannot connect to game and stuck on reconnect.","replies":[]}]}