{"poster":"laz464","date":"2018-01-25T18:58:53.643+0000","title":"Riot is stuffed... Here's why","subforum":"Player Behaviour","up_votes":3,"down_votes":3,"body":"Well everyone knows that the terms of service, everyone agrees on right? \r\nLet me point you out to some Knowledge on buying stuff.\r\n\r\nWhen you buy RP and anything that uses RP is yours for that specific account. (get your shit outta here with that rented shit as that is BS)\r\nfrom all perspectives when you buy something no matter what it is its yours to own no matter what, \r\nIn league when u buy a champion you own it, When you buy a skin you own it, When you buy rp you own it. No matter what you OWN IT (you get the point)\r\n\r\nNow i bought league of legends like i mean i own its property to a certain degree as i paid 24 dollars for the game at ebgames or something anyway that&#039;s not the point,\r\nThe point is i own it and when someone takes something away from you that you bought you can either (i&#039;m guessing take it to court or make a big argument about it and get it back(refund))\r\n\r\nTo everyone that has banned accounts can get their money back as riot doesn&#039;t own what you buy they only created it (same principle goes to everything in the industry) i will give you examples as to the same analogy for different scenarios...\r\ni.e buying a car from a dealer no matter what you do with it they cant take it away, buying a house if you destroy it you bought it so you replace it, if you buy a new iPhone apple cant do anything to take it back or ban you from using is as you bought it.\r\n\r\nEveryone gets what i&#039;m saying??? when you buy something from riot games no matter what it is (you own it)(you don&#039;t rent it)\r\nPlus no law or terms of condition can come into consideration as it doesn&#039;t effect it.\r\n\r\nLastly for all the accounts that people reported that gets it banned is wrong and is Unlawful and riot has to give you your account back no matter the reason of its ban or, or you give it a chat ban. \r\n\r\nAnyway comment what you must but i am correct in all forms being, Riot get your game back up and give people their accounts back.","replies":[{"poster":"SOOM","date":"2018-01-25T19:21:09.057+0000","up_votes":2,"down_votes":1,"body":"You know when you load a new patch and they tell you to agree to the contract... maybe read it and you will find some great info on this matter","replies":[{"poster":"laz464","date":"2018-01-25T19:36:08.103+0000","up_votes":1,"down_votes":1,"body":"well actually when you download a new patch it downloads it does not give you anything to sign buddy.\n\nYe i already did buddy and i'm still correct","replies":[{"poster":"SOOM","date":"2018-01-25T20:10:45.891+0000","up_votes":2,"down_votes":1,"body":"Terms of use section 4","replies":[{"poster":"SOOM","date":"2018-01-25T20:12:38.404+0000","up_votes":2,"down_votes":1,"body":"Specifically \n\n“4.3. Do I “own” the Virtual Goods I unlock? (No. What you “unlock” is not the virtual good itself, but rather, a qualified right to access it in the Game.)\nYou have no ownership or other property interest in any of the Virtual Goods you unlock, regardless of whether you acquired access to those Virtual Goods using Riot Points, Blue Essence or Hextech Crafting. Virtual Goods have no monetary value. You can’t redeem them for cash. You can’t obtain any refunds for purchasing Riot Points or Virtual Goods, except as expressly permitted by us. You can find our current content refund policy here.\nWe have the right to delete, alter, move, remove, or transfer any and all Game Content—including Virtual Goods—in whole or in part, at any time and for any reason or no reason, with or without notice to you, and with no liability of any kind to you. We don’t provide or guarantee, and expressly disclaim, any value, cash or otherwise, attributed to any data residing on servers we operate or control, including any Game Content attributed to your account. The sale or transfer of your right to access certain Virtual Goods, Blue Essence, Riot Points or Hextech Items may only be conducted via services approved of or provided by us, if any.\n\n4.4. Once again: I don’t own these Virtual Goods? (“No!” shouted all the lawyers.)\nNOTWITHSTANDING ANYTHING TO THE CONTRARY HEREIN, YOU ACKNOWLEDGE AND AGREE THAT YOU SHALL HAVE NO OWNERSHIP OR OTHER PROPERTY INTEREST IN YOUR ACCOUNT, AND THAT ALL RIGHTS IN AND TO YOUR ACCOUNT ARE AND SHALL FOREVER BE OWNED BY AND INURE TO THE BENEFIT OF RIOT GAMES. YOU FURTHER ACKNOWLEDGE AND AGREE THAT YOU HAVE NO CLAIM, RIGHT, TITLE, OWNERSHIP, OR OTHER PROPRIETARY INTEREST IN THE GAME CONTENT THAT YOU UNLOCK OR ACCUMULATE, REGARDLESS OF ANY CONSIDERATION OFFERED OR PAID IN EXCHANGE FOR RIOT POINTS OR VIRTUAL GOODS. FURTHERMORE, RIOT GAMES SHALL NOT BE LIABLE IN ANY MANNER FOR THE DESTRUCTION, DELETION, MODIFICATION, IMPAIRMENT, HACKING, OR ANY OTHER DAMAGE OR LOSS OF ANY KIND CAUSED TO THE GAME CONTENT, VIRTUAL GOODS OR RIOT POINTS, INCLUDING THE DELETION OF GAME CONTENT, VIRTUAL GOODS OR RIOT POINTS UPON THE TERMINATION OR EXPIRATION OF YOUR ACCOUNT.”","replies":[{"poster":"laz464","date":"2018-01-25T20:46:32.454+0000","up_votes":1,"down_votes":1,"body":"Ye that doesnt count as its wrong and the terms of service is what riot made up and is wrong on every level possible. plus it doesn't confine with Australian laws to terms that (what you buy you own) no law or rules can come into contact as that is with anything bought.","replies":[{"poster":"SOOM","date":"2018-01-26T00:37:10.406+0000","up_votes":2,"down_votes":0,"body":"Too bad this isn’t an Australian game when you signed up to league you agreed to those terms so that’s that... which bit of it is wrong and where is your justification that it is made up? \nBecause it has every legal endowment possible that I can see","replies":[]},{"poster":"Ninox","date":"2018-01-26T01:34:04.956+0000","up_votes":1,"down_votes":0,"body":"Seems like you might have read the ToS or at least skimmed it, but I think you need to go and actually read the ACL buddy.","replies":[]}]}]}]}]}]},{"poster":"QAPLA","date":"2018-01-25T22:02:41.051+0000","up_votes":2,"down_votes":0,"body":"You aren't buying anything, you are paying to access it.\n\nFor example, if you pay for a round of mini-golf, you are paying for access, not buying the clubs/course/etc.\n\nThis is the difference between goods and services, please learn it laz464, as you seem quite deluded on the subject.","replies":[{"poster":"SOOM","date":"2018-01-26T00:37:35.743+0000","up_votes":1,"down_votes":0,"body":"Economics 101","replies":[]}]},{"poster":"LunaLovegood","date":"2018-01-26T01:24:41.631+0000","up_votes":1,"down_votes":0,"body":"I love reading these whenever they pop up. \nevery couple of weeks or months someone new makes a post about how riot is breaking this consumer law or that law thinking they know exactly how it works and that they must be right.\nYOU ARE NOT RIGHT, RIOT PAID A BUNCH OF LAWYERS TO FIX UP THEIR TERMS OF SERVICE TO FIT INTO AUSTRALIAN LAWS, ITS BEEN YEARS SINCE THE GAME HAS HAD SERVERS IN AUSTRALIA AND NOT ONCE HAVE THEY LOST A LAW SUIT OVER THIS PLEASE THINK ABOUT WHAT YOU ARE POSTING.","replies":[]}]}