{"poster":"sorynotas","date":"2019-08-15T14:50:39.886+0000","title":"Schatteninseln Champion-Konzept: Valn, Die Zerbrochene Seele","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":2,"body":"**Valn,**\n**Die Zerbrochene Seele**\n\"Hey..._Töten_...Komm nicht näher..._Bleib doch hier_...Ich will nichts Böses\"\nWieder Tot\n\n\n**Vorwort**\n(Alles was in Kursiv geschrieben ist, ist von der zweiten Persönlichkeit von Valn gesprochen und wird deswegen leicht verückt betont)\nDie Idee zu Valn ist zum teil eine Verwertung eines alten, (weil ich ihn für zu schlecht empfunden habe) bereits gelöschten, Champion Konzepts.\nZum anderen teil kommt die Idee von \"YINU'HWARI,Die Mönche der Leere\"\n https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HdWatrpy-championkonzept-yinuhwari-die-manche-der-leere\nIch habe die Idee mit den mehreren Champions aufgeschnappt und ein bischen umgewandelt.\nAußerdem hatte ich schon immer daruaf gehofft das mal ein Champion von den Schatteninseln kommt der \"gezwungen ist dort zu sein und Seelen zu sammeln\".\nAls letztes ist mir alledings auch aufgefallen das sich das ganze Konzept auch etwas nach Gestaltwandler Fähigkeiten anhört.\n(Versteht ihr alles später noch)\nManchen ist vielleicht auch aufgefallen das ich die Reihenfollge der Unterpunkte gleich gemacht habe wie \"TheGanera\" da ich noch nicht so viel erfahrung habe und mich erstmal daran orientiere. (\"TheGanera\" ist der, der die\"YINU'HWARI,Die Mönche der Leere\" geschrieben hat)\n\n\n**Aussehen**\nValn trägt ein weißes Schirt, eine Braune Stoffhose um die ein schwarzer Gürtel geschnallt ist. Dieser Gürtel trägt eine rostiege viereckige Eisenschnalle die oben und unten etwas länger ist als der Gürtel. In der mite hat sie ein Symbol das einer Ziege ähnelt. Das Ganze wird dann noch duch einen leicht durchlöcherten schwarzen Mantel, mit Kaputze die er nicht trägt, abgerundet. Er trägt kein Schuhwerk oder Handschuhe.\nAußerdem ist Valn ein Geist was ihm eine bläulich dursichtige Gestallt gibt. Aus den Löchern des Mantel strömen auch vereinzelt Nebelschwaden.\n\n**Vorgeschichte**\n\nEs war ein strahlender Morgen als Valn, mit seiner Frau Mira und seinen zwei Töchtern Enri und Laila, am Frühstückstisch sahs. Der Tau glitzerte auf der Wiese hinter dem Haus und die ersten Vögel begannen ihr allmorgendliches Lied anzustimmen.\nAlles schien normal, doch etwas war doch anderst. \nEtwas bedrückendes lag auf den Lebewesen des kleinen Dörfchens. \nDies war ein Gerücht über ein Ungetüm in Eiserner Rüstung, dieses macht Feldzüge durch ganz Valoran und mezelte alles nieder was sich seiner Arme in den Weg stellt. \nDie Dörfler hatten Angst, da sie nicht weit von seinem Sitz, der unsterblichen Bastion, entfernt Lebten. \nGenauer gesagt nur zweit Flusabzweigungen weit weg, in richtung des heutigen Demacias. \nDoch das Leben musste weiter gehen dachte auch Valn. \nAber all die Freude und Gellassenheit, die dieser Morgen mitbrachte sollten nicht lange halten.\nEine Glocke leutete. \nDas Dorf war binnen Secunden in bereitschaft, denn das konnte nichts gutes verheisen. \nEiner der Dörfler hatte die Alarmglocke geleutet und Brülte nun vom Kirchturm herunter:\"Eine Arme\". \nMordekeiser blitze es durch Valns Verstand. \nNein, das konnte nicht sein, warum sollte so jemand sich für ein kleines Dorf wie dieses interesieren. \nEr rannte aus dem Haus und blickte zu einem kleinen Hügel am Horizont, den alle wie versteinert ansahen. \nEin Riese, ein Monster, mindestens zwei Meter groß und dick in Eisen Gehült stand an der Front einer Arme von ungefähr 100 Mann. \nEr ist es also doch.\nWas wollte er hier. \nWar die erste Frage die wohl allen durch den Kopf schoss.\nDoch was es auch war, es konnte nichts gutes verheißen. \nValn hollte, nachdem er den Gedanken zu ende gebracht hatte, sofort die einzige art von Bewaffnung die er besaß, eine Heugabel. \nEr war Bauer in einem einfachen Dorf, mit einem einfachen Leben und einer einfachen Familie, die er über alles Liebte. \nEr hasste den Krieg und das Leid das dieser brachte, was ihn woll zum genauen gegenteil von Mordekeiser machte, und er wollte niemals eine richtige Waffe auch nur in die Hand nehmen. \nDoch er musste etwas tun. \nEs musste seine Familie, sein Dorf verteidiegen, mit allem was er hatte.\nVlan drehte sich schlagartig um alls er das laute Schreien und Stampfen hunderter Leute hörte.\nEs dröhnte in seinen Ohren wie ein Donnerschlag nach einem Unwetter.\nAlle Männer des Dorfes rannten an den Eingang, um sich gegen die Krieger des Feindes zu stellen und obwohl Valn nicht der Bürgermeister oder Anführer des Dörfchens wahr, stand er an ihrer spitze. \nEr konnte sich kaum auf den Beinen halten, als der Boden unter den Schritten der Feinde erbebte. \nEinen moment lang wollte er weglaufen, einfach zu seiner Frau und den Kindern, sie umarmen und alles vergessen, doch es war zu spät. \nKeine drei Schritte vor Valn kam die Arme und das Monstrum Mordekeiser zum stehen. \nEine Totenstillen kehrte ein, die nur ab und an durch das Flattern eines Vogels unterbrochen wurde. \nEs war unerträglich. \nDoch nur wenige Augenblicke später sollte, das sich ändern. \nEiner der verängstigten Dorfbewohner rannte auf das Monstrum aus Eisen zu. \nEs war Kel, ein guter Freund von Valn, der in schon durch einige Strapazen begleitet hatte. \nEr war ein schmächtiger junger Mann der sein leben noch vor sich hatte. \nDoch sein wilder Kampfschrei endete abrupt. \nEs dauerte keine Secunde, da hatte Der Eiserne Albtraum seinen Streitkolben in die Luft gerissen und Kel gleich mit. \nEr landete hinter der Meute aus Dorfbewohnern, wo er sich vor Schmerzen wand. \nDaraufhin tratt Mordekaiser einige Schritte nach vorne, auf Valn zu. \nEine hallende tiefe Stimme, die an das Kratzen auf Metal erinnerte kam aus dem inneren der Rüstung:\"Du wirst der erste und letzte sein\". \nMit diesen Worten holte Mordekaiser zum Schlag aus und traf Valn was seinen Korper am Boden Zerschmetterte. \nEin art lachen schien aus der Rüstung zu kommen als Valn Mordekaiser aus großen bläulichen Augen ansah. \nDie restlichen Dorfbewohner schrien vor Angst oder rannten weg und als sich Valn zu ihnen umdrehte kam noch ein Satz aus der Rüstung:\"Töte sie\".\n\nAls Valn erwachte sah er sich um. Er war in seinem Haus. Blut an der Wand und am Boden. \nEr schwebte in der Luft.\nLangsam erhob er seine Hände.\nAls er dann bei klarem Verstand wahr, konnte er seinen Augen nicht trauen.\nDurch seine, von Nebelschwaden umhülten Hände, sah er Mira mit Enri und Laila im Arm.\nGesichter voller Blut und Trännen.\nEr sank zu Boden und wollte Weinen.\nDoch stat Trännen hörte er nur eine Stimme.\n\n_Bis du jetzt etwa traurig_\n\"Was war das\" blitzte es durch Valns Verstand.\nEr schaute sich verwundert um doch da war nichts und niemand.\n_Na, Na, versuch mich garnicht erst zu finden_\nDiesmal war die Stimme ganz deutlich.\n\"Wer und wo bist du\"brüllte Valn dann heraus.\n_Ich, ich heiße Rem_\n\"Und was hast du hier angestellt\"\n_Ich? Nichts, das warst du_\n\"Wovon redest du\"\n_Schau dich doch mal an. Erinnerst du dich echt nicht_Gab die fremde Stimme zurück.\n\"Ich bin Tot.\"\n_Also genauer gesagt Untot_\n\"Was, ist passiert? Warum...\"\n_Du erinnerst dich also wirklich nicht_\n_In ordnung, dann sag ich dir mal was. Du hast deine Frau, deine Kinder und alle hier im Dorf umgebracht_\n\"Nein, so etwas würde ich niemals tun\"\n_Na gut, ich gestehe. Ich war auch nicht ganz unbeteiligt und das hat mir viel spaß gemacht_\n\"Wenn du das warst dan zeig dich Feigling!\"\n_Oh Nein, das geht so nicht_\n\"Warum nicht!\"\n_Ganz einfach ich bin du. Ich bin in dir. Ich bin ein Teil von dir_\n\"Nein, selbst wenn das war so währe. Würde nicht mal der kleinste Teil von mir, auch nur einer Fliege etwas zu leide tun\"\n_Oh, da irrst du dich gewaltig_\n_Aber willst du denn nicht wisssen warum ich erst jetzt auftauche. Wenn ich doch ein Teil von dir bin_\n\"Vieleicht weil ich jetzt tot bin\"\n_Du hast ja echt all deine Erinnerungen verloren. Aber egal. Der der mich geschaffen hat ist gleichzeitig, der der dir befohlen hat alle hier zu töten_\n\"Was, wovon redest du. Ich wüde nie solche Befehle ausführen\"\n_Und doch hast du es getan_\n\"Also gut wenn das stimmen sollte, dann kennst du den der das eigentlich war\"\n_Natürlich kenne ich ihn aber..._\n\"Wie ist sein Name. Wo ist er\"\n_Na, Na, so leicht mache ich es dir nicht. Sonst hab ich am ende ja gar keienen Spaß_\n\"Na schön, und was tuen wir jetzt\"\n_Ach mir ist das egal aber mein Alter Herr hat was von der League der Legenden gefaselt. Frag doch mal net, vieleicht helfen die dir ja_\n_oder du besuchst die Schatteninseln wo er jetzt hinwollte_\n\n\n\n\n**Zitate**\n\n**Bewegungsbefehl:**\n\n\"_Nein, nicht da lang_...Hier sind aber weniger Menschen\"\n\n\"Bitte verschwinde, _Das geht leider nicht sonst währe ich schon weg_\"\n\n\"_Denkst du man kann hier spaß haben_...ich hoffe nicht\"\n\n\"Du bist dir sicher das er dort ist..._Aber ja, ich würde dich nie belügen_\"\n\n\"_Willst du das wirklich wagen_...Sollange du keinen Spaß hast ist mir alles recht\"\n\n\"Sie werden wieder nur vor mir weglaufen..._Nein, so weit lasse ich sie nicht kommen_\"\n\n\n**Angriffsbefehl:**\n\n\"Hey du, ich will doch nur Reden..._Ich aber nicht_\"\n\n\"Hör auf ihnen zu schaden..._Aber dann ict mir so langweilig_\"\n\n\"_Na, hat das weh getahn_...Oh, ich bitte um vergebung\"\n\n\"Bitte kannst du mir Helfen..._Oder führ mich sterben_\"\n\n\"_Wie lange kann ich mit dir Spaß haben_...Wie lange bis du enlich aufhörst\"\n\n\"Es tut mir leid..._Mir aber nicht_\"\n\n**Zu Champions:**\n\n**Zu Mordekaiser:**\n\n\"Du wars das also damals..._Mit ihm darf ich aber machen was ich will oder?_\"\n\n**Zu Ryze:**\n\n\"_Du bist mächtig_...Bitte hilf mir\"\n\n**Zu Le_Blanc:**\n\n\"_Du kennst ihn das weis ich_...sag mir wo er ist\"\n\n**Zu Thresh:**\n\n\"_Du weist wie man spaß hat_...Nein die Laterne ist mir zu eng\"\n\n**Zu Karthus:**\n\n\"Der Tot ist kein Geschenk..._Also ich finde es toll_\"\n\n**Zu Items:**\n\n{{item:3742}} \"_Hatte er das nicht auch_...Dann hat er es verloren\"\n\n{{item:3303}} \"Muss ich damit töten?..._Nein, ich werde es tun_\"\n\n{{item:3151}} \"Diese Qualen sind ein Witz im vergleich zu dem was ich erleiden musste\"\n\n{{item:3070}} \"Ich wünchte ich könnte noch Weinen\"\n\n{{item:3157}} \"Das hätte ich schon früher gebraucht\"\n\n\n\n\n**Werte:**\n\n\tStatistiken    \t\t(+Pro Stufe)\n\nLeben:  \t\t534  \t(+80)\nLebenREG.: \t \t6,4 \t(+0,2)\nMana:   \t\t380 \t(+44)\nManaREG.: \t\t5,5 \t(+0,2)\nAngriffsschaden:  \t51 \t(+2.5)\nAngriffstempo: \t\t0,63 \nRüstung:   \t\t23  \t(+2,8)\nMagieresistenz:  \t31  \t(+0,5)\nLauftempo:  \t\t332\nReichweite: \t\t325\n\n\nDas sind meine ersten Statistiken, die ich durch zwei andere Magier grob erechnet habe.(Ahri,Annie)\n\n\n**Fahigkeiten:**\n\n**Passiv: Die zwei in einem**\n\nValn hat eine gespaltene Persönlichkeit und kann so zwischen den beiden wählen. Mann hat, ähnlich wie bei Kindred, eine Anzeige über den Fähigkeiten in der man umschalten kann. (Man kann das Umschalten auf das Mausrad legen um es schneller zu machen (oder auf eine andere Taste))\nAußerdem hat man ähnlich wie bei Gestaltwandlern unterschiedliche Fähigkeiten. Allerding hat Rem kein Mana sonder bezahlt Fähigkeiten mit Leben(Valn hat Mana)(Die Rüstung von Rem wierd bei der verwendung von seinen Fähigkeiten mitbeachtet). Das ganze unterteilt sich in Valn und Rem ( Rem ist der Verückte oder die zweite Person).\n\nIst Valn Aktiv hat man 5% (+1% pro Stufe) mehr Rüstung und Magieresistenz, 7 weniger lauftempo und 10% (+1% pro Stufe) weniger Fähigkeitsstärke.\n\nIst Rem Aktiv so hat man 5 mehr Lauftempo, 5% (+1% pro Stufe) mehr Fähigkeitsstärke und 22% (+1% pro Stufe) der Rüstung und Magieresistenz gehen verloren. (solange Rem Aktiv ist ist die ManaREG. halbiert)\n\nQ:Totenwelle/Geisterhafter Schlag\n\n1.Totenwelle erschafft vor Valn eine Welle die vor ihm losgeht und an getroffenen Gegnern 50/65/80/95/110 (+0,5 AP) magischen Schaden veruhrsacht. Getroffene Gegner werden dann 0,75/1/1,25/1,5/1,75 Secunde vesthällt.\n\nMana:50/55/60/65/70\nAbklingzeit:15/14/13/12/11\nReichweite: 600 Einheiten\n\n2.Rem schlägt mit einem Geisterstreitkolben in einem Kegelförmigen gebit vor sich. Alle getroffenen ziehle werden nach hinten in die luft geschlagen(Der knockback veringert sich aber, je weiter der Gegner von Rem entfernt ist). Der Schlag macht 70/140/210/280/350 (+0,3 AP) magischen Schaden.\n\nKosten:2%/3,5%/5%/6,5%/8% des aktuellen Lebens\nAbklinzeit:14/12,5/11/9,5/8\nReichweite:350\n\nW:Freundlichkeit/Hass\n\n1.Freundlichkeit erlaub es Valn sich an, in ihrer Bewegung eingeschränkte Champions, heran zu ziehen (bis auf 325 Einheiten(seine normale Angriefsreichweite))\n\nMana:10/10/10/10/10\nAbklinzeit:18/17/16/15/14\nReichweite:700 Einheiten\n\n2.Hass läst den nächsten Autoattack für 7/7;75/8;5/9,25/10 auf einen Gegner zu einem magischen Angriff werden. Dieser Angriff macht 10/15/20/25/30 (+0,75 AP) magischen Schaden und heilt Rem um 30% des verursachten Schadens.\n\nKosten:5%/6%/7%/8%/9% des aktuellen Lebens\nAbklinzeit:15/13/11/9/7\n\nE:Ausgleichende Macht/Zerstörerische Macht\n\nPassiv: Sollten sich Ausgleichende Macht und Zerstörerische Macht gegenseitig berühren, so enden beide Felder sofort in einer Explosion an der Schnittstelle, (sind die Felder aufeienander so explodiert die Mitte), die 20% der geklauten Rüstung.... bzw. des geklauten Angriefsschadens.... (+0,75 AP) als magischen Schaden verursacht.\n\n1.Ausgleichende Macht erschafft ein kreisförmiges Gebiet, für 3/3,25/3,5/3,75/4 Secunden in dem Gegner 5%/6%/7%/8%/9% (+2% pro 100 AP) ihrer Rüstung und Magieresistenz verlieren und 70% der auf diese Weise verlorene Rüst. und Magieres. geht an Verbündete Champions in dem Feld. (hierbei wird die Rüst.... unter den Champions aufgeteil. Also zwei Champions im Feld gleich jeder erhält nur 50% der Rüstung und ...)\n\nMana:10/15/20/25/30\nAbklinzeit:14/12,5/11/9,5/8\nReichweite: 750 Einheiten\n\n2.Zerstörerische Macht erschafft ein kreisförmiges Gebiet, für 1/1,25/1,5/1,75/2 Secunden in dem Gegner 10% (+1% pro 100 Ap) ihres Angriffschadens und ihrer Fähichkeitsstärke verlieren und 50% der auf diese Weise verlorenen Angriffschadens und ihrer Fähichkeitsstärke geht an Verbündete Champions in dem Feld.(es gilt die gleiche Regel wie bei Ausgleichende Macht zur verteilung der Punkte)\n\nKosten:5%/6%/7%/8%/9%\nAbklingzeit:16/14,5/13/11,5/10\nReichweite:750 Einheiten\n\nR:Genug jetzt/Ausbruch\n\n1.Genug jetzt erschafft unter Valn ein Gebiet das alle Einheiten für 1,5/2/2,5 Secunden in Stase versetzt.\n\nMana:100\nAbklinzeit:160/140/120\nReichweite:300 Einheiten\n\n2.Ausbruch sorgt dafür, dass man für die nächsten 10 Secunden nicht mehr zu Valn Wechseln kann. Mann erhällt, für die zeit des Effekts 25%/35%/45% zusätzliche Fähigkeitsstärke und 20 mehr Lauftempo. Der Rüstungs und Magieresistenz Verlust erhöhen sich auf 3% pro Stufe bis die Fähigkeit endet. Außerdem laufen die Abklinzeiten von Valn solange nicht weiter.\n\nKosten:20% des Aktuellen Lebens\nAbklinzeit:180/160/140\n\n\n\n**Solltet ihr noch vorschläge haben wie z.b. die Fähigkeiten oder so besser machen kann schreibt doch ein kommentar.**\n\n**Ich entschuldiege mich schonmal dafür das ich schon wieder etwas hochlade, aber um ganz ehrlich zu sein denke ich seit jahren über Championkonzepte nach. So hatte ich dann auch die Idee für einen Geist dar alle Umarmen will, doch das habe ich schnell verworfen. Auf jeden fall denke ich schon laänger über diesen Champion nach als ich eigentlich Post hochgeladen habe und ich hoffe das dieses Kozept euch Jetzt bis auf die Stats vieleicht zufrieden stellt und nicht wieder zu kurz gedacht ist**\n\n**Außerdem wollte ich mich bei \"TheGanera\" bedanken das sie/er mir den Tipp mit dem Textdokument gegeben hatt ich werde ab jetzt nicht unvolständieges oder unüberlegtes mehr hochladen und hoffe ich gehe euch nicht zu sehr auf die Nerven.**\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Amycos Cyrus","date":"2019-08-15T15:18:39.108+0000","up_votes":2,"down_votes":0,"body":"Interessantes Konzept.\nGrundsätzlich finde ich, dass du mit diesem Konzept ein wirklich gutes erstes Konzept abgeliefert hast, bei dem du dir sogar einen recht anspruchsvollen Charakter (Gestaltwandler) vorgenommen hast.\n\nDie recht einfachen und gradlinigen Fähigkeiten passen recht gut zueinander und mich begeistert sogar etwas, dass du daran gedacht hast, dass die Gestalten auch untereinander eine Synergie bedürfen. (Die E-Passive in diesem Fall).\n\nBezüglich deiner gewählten Statistiken ist nichts zu bemängeln, wobei auffällt, dass du das Angriffstempo nicht mit dem Level skalieren lässt. (Soll das so sein?)\n\nDas einzige wirklich auffällige ist, dass du dich wohl gegen die Nutzung von Rechtschreibprüfungen sträubst, denn das Konzept ist eine Flut von Rechtschreibfehlern.\n___\n\nNach diesem kurzen Kommentar, auch noch einmal eine Entschuldigung von mir bezüglich meiner \"Predigt\" zu deinem \"Spamm\" (Du hast dieses Konzept wie oft gepostet 5mal?)","replies":[{"poster":"sorynotas","date":"2019-08-15T15:30:03.916+0000","up_votes":1,"down_votes":0,"body":"Ja, gut ich weis wie miss meine Rechtschreibung ist aber leider ist z.b. mein Schreibprogramm ein Textdokument also bitte entschuldiege das. Und ja ich habe dieses Kozept 2 mal hochgeladen zuerst Rem und Valn als einzelne Champs aber dan 2 mal als 1 Champoin.\nUnd ich bin dir sehr dankbar das es wenigstens irgendwehm gefält. (Sorry für die Rechtschreibung.) Ach und das mit dem Angriffstempo ich kenne keinen guten Wert daführ vieleicht 0,05 oder so was meinst du?","replies":[{"poster":"Divin1ty","date":"2019-08-15T15:32:43.598+0000","up_votes":2,"down_votes":0,"body":"Du kannst den Text kopieren, einfach markieren und STRG-C und STRG-V in ein entsprechendes Programm, oder Website. Hier eine als Beispiel https://rechtschreibpruefung24.de .","replies":[{"poster":"sorynotas","date":"2019-08-15T16:08:25.961+0000","up_votes":1,"down_votes":0,"body":"Ich danke dir sehr für diesen Tipp aber ich glaube ich habe gerade die meisten Fehler in meinem Kozept behoben.\nTrotzdem schaue ich nochmal.","replies":[]}]}]}]},{"poster":"Divin1ty","date":"2019-08-15T14:57:47.129+0000","up_votes":1,"down_votes":0,"body":"> \"Hallo...Töten..\n\nIch finde es komisch das bei solchen Konzepten der böse, traurige, grauenhafte, whatever Charakter immer Hallo am Anfang von sowas sagt.\nÜbrigens, extrem viele Sätze in der Lore mit den selben Anfängen (es, er) verdirbt vielen den Lesespaß.","replies":[{"poster":"sorynotas","date":"2019-08-15T15:07:15.392+0000","up_votes":1,"down_votes":0,"body":"Ich danke dir. Du hast mich gerade auf einen fehler Aufmerksamm gemacht den man vieleicht erst ab den Zitaten versteht. Ich habe mir das mit dem Hallo so gedacht, das das der gute sagt und das Töten dan wie eine zuckung des anderen ist.","replies":[{"poster":"Divin1ty","date":"2019-08-15T15:12:09.975+0000","up_votes":1,"down_votes":0,"body":"Ist ja auch kein großes Ding und stört vielleicht nur mich, aber ich finde ein Hallo einfach fehl am Platz bei sowas. ^^'\nAlso kein Stress. :3","replies":[{"poster":"sorynotas","date":"2019-08-15T15:31:10.040+0000","up_votes":1,"down_votes":0,"body":"Ich werde das Hallo zu einem Hey änder weil ich das Hallo auch seltsam finde aber solltest du noch vorschläge haben neme ich sie gerne an.","replies":[]}]}]}]}]}