{"poster":"Tenjirou","date":"2016-11-01T15:44:01.738+0000","title":"Suche Gemeinschaft","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Hallo Mitbeschw&ouml;rerinnen und Mitbeschw&ouml;rer,\r\n\r\nda ich keine Lust habe dauernd Alleine zu spielen und meine IRL Freunde und ich nur noch selten gemeinsam Zeit finden m&ouml;chte ich mich nach einer Gemeinschaft umsehen. Daf&uuml;r beschreibe ich mich vll. mal Besten:\r\n\r\nIch bin 26 Jahre und Berufst&auml;tig. In LoL hab ich nur wenig Ranked gespielt und bin bisher auf Bronze 2, denke aber meine eigentlicher Rang w&auml;re mindestens Master. Nein Spa&szlig; ich denke ich geh&ouml;re so in etwa in B3-B4. Ich spiele gerne aus Spa&szlig; und meine Hauptrollen sind Top (wenn ich solo spiele) oder ADC mit nem Kumpel als Support (ich kann aber auch den ein oder anderen in der Mitte). Da ich in einer WG wohne kann es &ouml;fters mal vorkommen, dass mein Ping sehr launisch ist. Zu meiner Pers&ouml;nlichkeit kann ich sagen, dass ich etwas sch&uuml;chterner bin, aber auch mal (schlechte) Spr&uuml;che bringe. Meine Hauptspielzeit ist im Moment unter der Woche Abends 18/19:00 - 22:00 Uhr. Am Wochenende kann ich leider nicht, da ich am Wochenende Zuhause (nicht in der WG) bin und dort keinen PC habe.\r\n\r\nIch suche deswegen speziell nach einer Gemeinschaft, die keine zu hohen Anforderungen setzt.\r\nIhr solltet haben:\r\n\r\n* Verst&auml;ndnis f&uuml;r Fehler, die passieren mir oft\r\n* Mir nicht b&ouml;se sein, wenn ich nach einer Runde spontan aufh&ouml;re, weil der Ping miserabel geworden ist\r\n* Bronzies aufnehmen, denn ich denke ich bin dort noch eine Weile. Ich habe damit kein Problem, denn wenn ich besser werde, dann werde ich wohl irgendwann aufsteigen. Aber Alles mit seiner Zeit.\r\n* Im TS w&uuml;rde ich wohl vorerst eher der stille Lauscher sein.\r\n* Ich erhoffe mir vllt den Einen oder Anderen (oder die Andere, will ja nicht sexistisch wirken) kennen zu lernen auf freundschaftlicher Ebene.\r\n\r\nFalls ihr noch Fragen habt z&ouml;gert nicht zu Fragen. Ich freue mich auf eure Antworten.\r\n\r\nMfg\r\nTenjirou","replies":[{"poster":"Scheidenkleister","date":"2016-11-01T19:38:43.721+0000","up_votes":1,"down_votes":0,"body":"Wer sucht das nicht :D","replies":[]},{"poster":"ServusIhrLuschen","date":"2016-11-01T15:49:51.912+0000","up_votes":1,"down_votes":0,"body":"komm zu uns wir sind eine kleine gemeinschaft und wachsen bei uns sind eig immer paar meist ich haha ich geb dir einfach mal ts daten ^^ und wenn du noch net reden wilst geht auch schreiben :) 46.20.46.235:10098{{champion:412}}   {{summoner:14}}","replies":[]}]}