{"poster":"Leblancs Boob","date":"2019-03-13T20:10:32.718+0000","title":"At level 6 Leblanc can root a target for 3 seconds--as an assassin","subforum":"Gameplay","up_votes":60,"down_votes":3,"body":"How about we nerf this instead of continually destroying an assassin's ability to assassinate? The current PBE nerf to Leblanc's Q scaling will do nothing to her proplay presence because no one picks her specifically for damage--she has, bar none, the best gank assistance of any champion in the game. As long as she can dash two screens away and snare a target long enough for her team to collapse,she will continue to be a monster in coordinated play. But every nerf to her damage and CDs makes her worse and worse to play as a solo champion.\r\n\r\nAn assassin **should never** be able to hard cc anyone for as long as 3 seconds, but instead of nerfing that we nerf the assassin's numbers, making her less able to act independently because she can't make her own plays without her damage. At this point, I don't even care if you remove her snare entirely, just please stop nerfing an assassin's damage to preserve her cc that she shouldn't have in the first place.","replies":[{"poster":"SuicidePlank","date":"2019-03-13T20:34:58.620+0000","up_votes":28,"down_votes":0,"body":"Can they please nerf her E range after she hit you? Like you won't get away from being rooted, you simply won't. With her 1 1/2 dashes and her ability to outrun most champs and on top of that, if you and her run the same way, your flash won't even help you getting out of range.\nImo lacks a lot of counterplay.","replies":[{"poster":"Leblancs Boob","date":"2019-03-13T21:54:02.896+0000","up_votes":4,"down_votes":0,"body":"I'd be totally fine with that. My biggest concern is nerfing an assassin's damage to the point where they can't assassinate anymore. Because, let's face it, this nerf won't do anything to affect Leblanc's proplay presence. What happens if she remains too strong and needs another nerf? Are we going to keep nerfing her damage until she just becomes the team's mobile cc bot?","replies":[{"poster":"Z3Sleeper","date":"2019-03-14T00:46:29.052+0000","up_votes":3,"down_votes":2,"body":"Agreed, her damage isn't the problem, it's her utility.\n\nShe doesn't need 850 range on a tether that she hits at point blank then ports out with. It's impossible to break. Nerf that first.","replies":[]}]}]},{"poster":"BLIGHTBRINGER","date":"2019-03-13T20:33:10.238+0000","up_votes":24,"down_votes":1,"body":"Don't forget about the chain length, which is basically the entirety of Mid Lane, and it's hitbox is the size of a Cho'Gath at the end.","replies":[]},{"poster":"Jamaree","date":"2019-03-13T20:27:11.134+0000","up_votes":9,"down_votes":2,"body":"If she is using her r to also snare you, isn’t she like slicing her damage in half?","replies":[{"poster":"Verxint","date":"2019-03-13T20:34:30.322+0000","up_votes":19,"down_votes":0,"body":"Her R snare is the same damage as her R Q, and she doesn't need the damage for gank assistance like the OP said","replies":[{"poster":"Academy Kayn","date":"2019-03-14T02:11:17.218+0000","up_votes":1,"down_votes":0,"body":"Yeah, it's the same damage, but over 3 seconds, and 2 different procs of damage, so even if it wasn't a gank, the time to kill has been significantly lengthened if they go this route. \n\nMeanwhile, they Q-Q-W for the same damage, but much more reliably. The only thing rooting does for you is maybe get you some more auto-attacks in midstwhile. If they're aiming to reduce her abiility to kill faster, then Q is the thing they should nerf.\n\n I imagine Riot already considers the Root strategy a fairer option, considering that they've pushed Time to Kill as a bigger thing for them since the Assassin Class rework. More seconds alive, means more time to respond.","replies":[{"poster":"Verxint","date":"2019-03-14T04:45:20.413+0000","up_votes":3,"down_votes":0,"body":"Except you can't really respond, especially if it's used to assist ganks. You have to flash and use a dash to get out, her blinks and passive make her safe, and the enemy jungler getting that extra time to pound your ass is more than worth the longer TTK.","replies":[{"poster":"Academy Kayn","date":"2019-03-14T06:22:35.318+0000","up_votes":3,"down_votes":0,"body":"Respond doesn't always mean run away. She's setting you up to stick by her for a minimum of 3 seconds, attack back, you're not just a lamb to the slaughter. Most midlaners have some form of CC, plenty do. \n\nThat said, you can respond, at the very beginning. You can dodge the first snare, and before anyone says you can't dodge it when she goes point blank, yes, you can. Sidestep. All Leblancs are going to think you're going to run away, so just repress the lizard part of your brain for a second, and side step. Once you see her Dashing towards you, that's when.\n\n Even if she follows up with Ult R, that's still just a normal root/slow, just damage is better.","replies":[]}]}]}]},{"poster":"Leblancs Boob","date":"2019-03-13T21:40:02.421+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0000,timestamp=2019-03-13T20:27:11.134+0000)\n>\n> If she is using her r to also snare you, isn’t she like slicing her damage in half?\n\nThis actually isn't true. Leblanc's most optimal early-mid game kill combo almost always involves double chain. A lot of people may not know this, but Leblanc's double chain combo does the same exact amount of damage as her double Q combo **at all stages of the game**. Double chain is better early-mid because it gives you 3 full seconds of autoattacks (boosted by corrupting pot) and even a second Q or W depending on how long the fight lasts. Double Q is only used late game because its faster.","replies":[{"poster":"ArtumisPrime","date":"2019-03-14T03:07:08.649+0000","up_votes":2,"down_votes":0,"body":"I haven't seen the Q nerf. Is it significant enough that her double chain will be a larger damage source?","replies":[]},{"poster":"FlameHalbrdOkido","date":"2019-03-14T02:13:45.301+0000","up_votes":1,"down_votes":0,"body":"yeah a 3 sec CC duration doesn't seem gud for an assassin, they should make the duration of the CC scale with rank up to 1 sec, and then they should probably nerf E's dmg it shouldn't deal the same amount of dmg as Q, like EVER for the CC it offers, there should be trade off","replies":[]},{"poster":"Ragnaveil","date":"2019-03-13T21:51:14.985+0000","up_votes":1,"down_votes":0,"body":"Not to mention more insta burst late game instead of having to wait a bit for the chain to arm.","replies":[]}]},{"poster":"Marshbouy","date":"2019-03-13T20:34:07.742+0000","up_votes":3,"down_votes":2,"body":"and mobility, but let's not use logic here.","replies":[]},{"poster":"The Trent","date":"2019-03-14T03:50:41.314+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0000,timestamp=2019-03-13T20:27:11.134+0000)\n>\n> If she is using her r to also snare you, isn’t she like slicing her damage in half?\n\nUnless they changed it, lb's q and e share the same damage amount on R. It's just q r e is a faster combo than q e r","replies":[]},{"poster":"Crescent Dusk","date":"2019-03-14T01:08:26.838+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0000,timestamp=2019-03-13T20:27:11.134+0000)\n>\n> If she is using her r to also snare you, isn’t she like slicing her damage in half?\n\nThe chain does a truck ton of damage on its own and 2 chains+Q damage is enough to kill most ADC's and enemy mages, which is whom leblanc wants to target.","replies":[]},{"poster":"Neptunia xoxo","date":"2019-03-13T22:56:15.220+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0000,timestamp=2019-03-13T20:27:11.134+0000)\n>\n> If she is using her r to also snare you, isn’t she like slicing her damage in half?\n\nYeah... except chain base damage is r%%%%%ed. xD","replies":[]},{"poster":"Ragnaveil","date":"2019-03-13T20:35:10.332+0000","up_votes":1,"down_votes":0,"body":"Eh, if she throws a q on the target before it lands or after it lands, it makes up for it since if the target doesn't get out of range, it does damage again and then roots. Sure, the Q nerf isn't \"the right nerf\", but its a spell with two parts, intial damage and a mark that gives any of her select spells extra damage when she has them land on that marked target. She gets one kill or happens to get Lost Chapter or something with little to no problems, she will make that item rain hell on you.\n\nTL;DR: Yes and no.","replies":[]}]},{"poster":"IAmTheLego","date":"2019-03-13T22:10:09.617+0000","up_votes":7,"down_votes":0,"body":"Not to mention how ridiculously long her e range is.\n\nHigh risk high reward btw.\n\nBalance and fairness my ass.","replies":[{"poster":"Craft Zeppelin","date":"2019-03-14T08:27:17.538+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IAmTheLego,realm=EUNE,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0006,timestamp=2019-03-13T22:10:09.617+0000)\n>\n> Not to mention how ridiculously long her e range is.\n> \n> High risk high reward btw.\n> \n> Balance and fairness my ass.\n\nBut honestly, I've seen a lot of Leblancs being counter-oneshotted by the enemy when they try that since it takes quite a lot of time. \nShe needs to actually stay to dish out the damage for that combo.","replies":[]}]},{"poster":"FOR JUSTICE","date":"2019-03-13T20:58:10.995+0000","up_votes":3,"down_votes":2,"body":"She may be an assasin but id just like to point out most ap assasins have some form of Hard cc. Not all, but most.\n\nFizz has a knockup/displacement\n\nAhri has a charm (but shes like some kind of kite mage thing i guess)\n\nDont know what kind of cc you would call dianas, but its there\n\n\nAkali has an AoE stun\n\nElise has a stun and slow as well as ekko\n\nEtc.","replies":[{"poster":"KnulleFitte","date":"2019-03-13T21:20:57.201+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=FOR JUSTICE,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0004,timestamp=2019-03-13T20:58:10.995+0000)\n>\n> She may be an assasin but id just like to point out most ap assasins have some form of Hard cc. Not all, but most.\n> \n> Fizz has a knockup/displacement\n> \n> Ahri has a charm (but shes like some kind of kite mage thing i guess)\n> \n> Dont know what kind of cc you would call dianas, but its there\n> \n> \n> Akali has an AoE stun\n> \n> Elise has a stun and slow as well as ekko\n> \n> Etc.\n\nthe issue her is that her cc can last up to three seconds. Op isnt advocating for removing it, but making it less powerful.","replies":[]},{"poster":"Somebody Love Me","date":"2019-03-15T10:58:25.831+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FOR JUSTICE,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0004,timestamp=2019-03-13T20:58:10.995+0000)\n>\n> She may be an assasin but id just like to point out most ap assasins have some form of Hard cc. Not all, but most.\n> \n> Fizz has a knockup/displacement\n> \n> Ahri has a charm (but shes like some kind of kite mage thing i guess)\n> \n> Dont know what kind of cc you would call dianas, but its there\n> \n> \n> Akali has an AoE stun\n> \n> Elise has a stun and slow as well as ekko\n> \n> Etc.\n\nThey also have delays that the AD assassins needed duskblade to patch up","replies":[]},{"poster":"Tormentula","date":"2019-03-14T23:52:34.946+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FOR JUSTICE,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0004,timestamp=2019-03-13T20:58:10.995+0000)\n>\n> She may be an assasin but id just like to point out most ap assasins have some form of Hard cc. Not all, but most.\n> \n> Fizz has a knockup/displacement\n> \n> Ahri has a charm (but shes like some kind of kite mage thing i guess)\n> \n> Dont know what kind of cc you would call dianas, but its there\n> \n> \n> Akali has an AoE stun\n> \n> Elise has a stun and slow as well as ekko\n> \n> Etc.\n\nElise isn’t an assassin and doesn’t have a slow built into her kit.\n\nCC isn’t limited to AP assassins anyway, not when you look at old rengar and pyke at least.","replies":[]},{"poster":"0opsRewind","date":"2019-03-14T16:24:20.231+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FOR JUSTICE,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0004,timestamp=2019-03-13T20:58:10.995+0000)\n>\n> She may be an assasin but id just like to point out most ap assasins have some form of Hard cc. Not all, but most.\n> \n> Fizz has a knockup/displacement\n> \n> Ahri has a charm (but shes like some kind of kite mage thing i guess)\n> \n> Dont know what kind of cc you would call dianas, but its there\n> \n> \n> Akali has an AoE stun\n> \n> Elise has a stun and slow as well as ekko\n> \n> Etc.\n\nakali has an AoE _micro_ stun","replies":[]},{"poster":"FlameHalbrdOkido","date":"2019-03-14T02:23:15.526+0000","up_votes":1,"down_votes":0,"body":"It should be pointed out that officially classed assassins who do have hard CC, usually have some sort of delay or set up that allows the enemy to avoid suffering the CC.\n\nI wouldn't call Ahri or Elise assassins as much a burst mages, or diver/burst mage for Elise\n\nexcept for Akali's mini stun, which I have no idea why she has, (should be like a 0.5 heavy slow + ground if its meant to keep people in place) but its barely visible\n\nI wouldn't say LB follows this trend due to her W and E's range which allows her to keep escaping targets within range easier than other Assassins can pull off their hard CC. Either way it should last 2 sec MAX","replies":[]}]},{"poster":"Laçez","date":"2019-03-13T23:38:44.834+0000","up_votes":1,"down_votes":0,"body":"Just to put this in perspective. Ekko's W, which takes 3 seconds to cast &amp; requires him to be in it for it to proc, last for 1.75 seconds &amp; was actually nerfed when it was longer than that. \nIt is aoe though...","replies":[{"poster":"Edge of Daybreak","date":"2019-03-14T00:02:18.262+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Laçez,realm=EUW,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=0008,timestamp=2019-03-13T23:38:44.834+0000)\n>\n> Just to put this in perspective. Ekko's W, which takes 3 seconds to cast &amp; requires him to be in it for it to proc, last for 1.75 seconds &amp; was actually nerfed when it was longer than that. \n> It is aoe though...\n\nand gives him a shield along with an execute passive and a slow when you aren't in the area basically it does a lot more stuff.","replies":[{"poster":"Laçez","date":"2019-03-19T01:08:19.893+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hopeless Dragon,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=00080000,timestamp=2019-03-14T00:02:18.262+0000)\n>\n> and gives him a shield along with an execute passive and a slow when you aren't in the area basically it does a lot more stuff.\n\nDamn...\n You right, you right","replies":[]}]}]},{"poster":"GigglesO","date":"2019-03-14T04:40:14.772+0000","up_votes":3,"down_votes":0,"body":"Non-tanks have too much cc. According to riot tanks are supposed to be the premier cc class.\n\nHowever almost every class has lots of cc so it’s either a poor excuse for tanks to not be durable... or every non-tank class should get cc nerfs.","replies":[]},{"poster":"Crescent Dusk","date":"2019-03-14T01:12:34.137+0000","up_votes":3,"down_votes":0,"body":"She shouldn't have a root to begin with given that she has an effective double dash and then a passive that stealths her at low health.\n\nIf you think she's toxic against adc's and mages, try playing less mobile assassins like Talon, Diana and watch how a Leblanc blows up half your health with electrocute, immediately swaps out, and if you tried to counterplay her swap by being close to her return location she just chains you and walks away, winning every trade and by midgame killing you because her Q is short enough cd to use again.\n\nIt's dumb crap like LeBlanc and Zed that ruins this game because you have champions that can dome massive amounts of frontloaded damage and peace out immediately out of retaliation while every other assassin has to commit to melee range and dies in the process while also being more easily peeled.\n\nHigh in combat mobility champs should never have the damage of less mobile assassins, especially if they have hard CC to boot.\n\nIf they're gonna keep her chain she should at least have the same cast time as Zoe's bubble (and honestly both their cast times should be increased, as should be Ahri's charm).","replies":[]},{"poster":"Anu3isII","date":"2019-03-13T22:58:06.437+0000","up_votes":3,"down_votes":0,"body":"By using her RE she practically gives up her Burst speed for more utility. It is a nice tool in the Early to Mid Game until she reaches the point where the ADC can burst her faster than she can...","replies":[]},{"poster":"Warlord Rhinark","date":"2019-03-14T06:58:47.663+0000","up_votes":2,"down_votes":0,"body":"The root duration wouldn't be that big of a problem if the chain wasn't so long.","replies":[]},{"poster":"Kjraider","date":"2019-03-14T02:40:43.682+0000","up_votes":1,"down_votes":6,"body":"Mages, especially mobile mages, are in an amazing(dare I say OP) place in general. You take a look at most elo's and top/mid(duh) and even support win/pick rates, and mages are well represented compared to ad/tanky variants in most cases. Mage items are dirt cheap, give great stats, and ultimately lead to most of them being able to 100 to 0 in a combo or less. Mage power creep is a problem all over the map, and I'd love to see it addressed in general.","replies":[{"poster":"Hemulen Magi","date":"2019-03-14T03:01:55.760+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kjraider,realm=NA,application-id=3ErqAdtq,discussion-id=7sO5RzAR,comment-id=000e,timestamp=2019-03-14T02:40:43.682+0000)\n>\n> Mages, especially mobile mages, are in an amazing(dare I say OP) place in general. You take a look at most elo's and top/mid(duh) and even support win/pick rates, and mages are well represented compared to ad/tanky variants in most cases. Mage items are dirt cheap, give great stats, and ultimately lead to most of them being able to 100 to 0 in a combo or less. Mage power creep is a problem all over the map, and I'd love to see it addressed in general.\n\nBlatantly untrue.  Go to any of the league statistic sites and you'll see that AD champions are very overrepresented in all lanes.  There isn't a single AP champion on the top 5 most overall played champions, and the only AP champions in the top 10 more played are {{champion:517}} and {{champion:25}}  who both have inflated pick rates caused by Sylas being the newest champion release and Morgana being a new rework release.\n\nThe most common picks in each position are:\ntop: {{champion:92}} \njng: {{champion:64}} \nmid: {{champion:238}}\nsup:{{champion:412}} \nbot: {{champion:81}}\n\nWhere are these overrepresented AP champions?\nAnd before you go \"oh 'magi' you must be a biased mage main\" you'll see that I actually play all classes if you check my match history, and my highest mastery champ is an AD juggernaut.  {{champion:83}} \nMy display name is referring to historical magi, as in Persian wisemen.","replies":[]}]},{"poster":"Nameless Drifter","date":"2019-03-14T13:44:15.086+0000","up_votes":2,"down_votes":2,"body":"LeBlanc has been ridiculous overpowered for quite a lot of seasons, even in pro play. They never did anything about it, or at least anything significant. Its curious that they nerf Urgot to oblivion but they dont do that to LB, when she is one the safest champions and one with the least mechanical need, to pull off wins.  \n\nRiot killed the wave clear power of mages last season, because apparently mages are not alowed to use spells, but they did kept assassins and burst Mages mostly untouched and some even buffed, along with the Ignite buff too. Its pretty obvious that they think assassins should be the ones dominating the seen, because it gives more \"flashy plays\" even though the quality of the pro play has been falling hard.","replies":[{"poster":"Poske","date":"2019-03-14T13:50:58.461+0000","up_votes":2,"down_votes":0,"body":"The ammount of shit I just read is outstanding","replies":[]}]},{"poster":"Nevrankroaton","date":"2019-03-14T06:26:41.602+0000","up_votes":2,"down_votes":1,"body":"She is a fucking shitty champ who should have never been reverted.\nI will enjoy her being garbage, old leblanc suck as hell to play as and play against.\nI stand by my bias, they wanted one of the most boring/shitty assassin to be back? There, now back to the gutter so her mains can reflect on their BS.","replies":[]},{"poster":"KFCeytron","date":"2019-03-14T02:37:36.481+0000","up_votes":2,"down_votes":1,"body":"And Malph can kill someone instantly as a tank. That's LoL these days.","replies":[]},{"poster":"Illidan is HOT","date":"2019-03-14T00:57:51.919+0000","up_votes":2,"down_votes":1,"body":"As a LeBlanc main I agree. What I would suggest is reducing root duration from 1.5 sec at all ranks to something like 0.7/0.9/1.1/1.3/1.5 sec depending on E rank. This way LB doesn't lose much 1v1 potential, is not as cancerous when her jungler comes anymore and is still able to peel herself with root in late game.","replies":[]},{"poster":"2Charmnot2Charm","date":"2019-03-14T00:36:31.611+0000","up_votes":2,"down_votes":1,"body":"I legit don't get why they never touch her chains. Seriously one of the main complaints about it is the fact that even if you flash away the tether range is still big enough to snare you.\n\nUnless you flash and use a dash you can not escape the snare unless leblanc bails out {{sticker:sg-shisa}}","replies":[]},{"poster":"Zullar","date":"2019-03-15T20:12:06.840+0000","up_votes":1,"down_votes":0,"body":"There's not enough burst &amp; mobility &amp; CC in league. They need to add more.","replies":[]},{"poster":"Sydney26","date":"2019-03-15T10:53:12.046+0000","up_votes":1,"down_votes":0,"body":"if u hit 2 spells","replies":[]},{"poster":"BlueSmurf2018","date":"2019-03-14T18:49:31.094+0000","up_votes":1,"down_votes":0,"body":"shes not an assasin, shes a mage. Why do i say this? zoe, anivia, xerath, and well, every mage in the game arent labled as assasins and leblanc is only labled this because of her mobility. Shes a mage and mages are broken.","replies":[]},{"poster":"Poske","date":"2019-03-14T13:49:27.380+0000","up_votes":1,"down_votes":0,"body":"Ahri can setup from a far to with a HARD CC and is ever since revert a better version of Le blanc","replies":[]},{"poster":"mOwNRachel","date":"2019-03-14T07:37:40.720+0000","up_votes":1,"down_votes":0,"body":"i dont understand why people complain so much about leblanc :/ i'm not a midlaner but still play a few champs there, in low diamond , and never had problem with lb. considering i'm not playing hard counter, (i play leblanc, Ahri, xerath), never lost as ahri, you have better wave clear, can charm her if she dash to you , always have minions advantage because as i said, better wave clear, on top of your passive for substain. and xerath just shove the wave , if she really commit use your e stun combo. you complain about her E, the width of this ability is very, very small, it's a skillshot not that easy to hit, why should i not be rewarded for landing it, just like ahri and xerath get rewarded for landing e? in term of pure damage she probably have one of the lowest burst of all assasins, zed have better burst, talon have better burst, fizz have better burst, diana have bigger burst... is she safer than other assasins? maybe, but i'd rather have a risky assains that get the job done than a LB that fails and leave the teamfight having done very little. you complain about lb but at least if she kill you, she had to land skillshot on you, what about ZED, that fail his 3 shuriken and still delete you with just R AA E ? that's balanced and well designed ?","replies":[]},{"poster":"Jennifer420","date":"2019-03-14T07:32:30.756+0000","up_votes":1,"down_votes":0,"body":"i think this root doesnt matter because by the time you'd get rooted you are already dead LOL","replies":[]},{"poster":"Akali is SO HOT","date":"2019-03-14T06:31:27.772+0000","up_votes":1,"down_votes":0,"body":"She's picked in pro because of her high mobility and high damage for assassinations.  Her root is good, but using RE is super situational which is why you don't really see them go for it that often.  She isn't  picked specifically for the reason that she can potentially root someone for 3 seconds.","replies":[]},{"poster":"Hemulen Magi","date":"2019-03-14T02:37:31.016+0000","up_votes":1,"down_votes":0,"body":"I think Riot wants to shift {{champion:7}} to an identity as a hybrid catcher + assassin (or burst-mage).  Her assassin/burst-mage identity is already strongly established, but her potential as a catcher is less established, so weakening her damage output and retaining her mobility+CC helps gradually define her secondary catcher class.  I think it's a good thing and makes LB more appealing to me personally.  If she could get slightly higher base defenses as compensation for the damage nerfs, I'd probably pick her up as a catcher support, and she'd still be plenty playable for mid laners as an assassin.","replies":[]},{"poster":"Bardmageddon","date":"2019-03-13T20:53:32.359+0000","up_votes":2,"down_votes":2,"body":"We already got plenty of assassins that jump in, burst down the carry and leave.\nAn assassin that can jump in, disable the enemy tank/bruiser is a lot more interesting than the generic assassin","replies":[]}]}