{"poster":"Darinon","date":"2015-11-20T21:21:53.707+0000","title":"Ich habe immer noch keinen Rahmen und kein Summoner Icon aber ich bin dennoch Silber Elo","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"Ich warte schon seit 2 Wochen vergebens auf meinen Silber Rahmen bzw. mein Silber Summoner Icon und deswegen wollte ich fragen ob Riot mich vergessen hat oder es ein Bug ist.","replies":[{"poster":"Believing","date":"2015-11-20T21:41:30.782+0000","up_votes":1,"down_votes":0,"body":"Es ist kein Bugg, es gibt bestimmt einen Grund warum du die Rewards noch nicht bekommen hast.\n1. Du wurdest in dem Zeitraum vom 01.08 - 11.11 gebannt.\n2. Du hattest zum Zeitpunkt des Seasonendes(11.11) eine Restriction\n3. Du hast nach dem 11.11 eine Restriction oder einen Bann bekommen.\n4. Du wurdest Permanent vom Rewardsystem ausgeschlossen weil du in den Season davor geboosted wurdest.\nWenn das alles nicht zu trifft schreib dem Support bitte ein Ticket. (Nicht wundern der Support braucht momentan etwas zum antworten, weil sie von Anfragen überschwemmt werden)\nHoffe ich konnte dir helfen!\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Darinon","date":"2015-11-21T07:41:28.075+0000","up_votes":1,"down_votes":1,"body":"Ok der 1ste punkt trifft zu","replies":[{"poster":"Believing","date":"2015-11-21T12:52:45.061+0000","up_votes":1,"down_votes":0,"body":"Dann sind deine Rewards weg :D sry","replies":[{"poster":"RIQT SUCKS BIG D","date":"2015-11-21T23:55:40.155+0000","up_votes":1,"down_votes":1,"body":"Man kann das Saisonende mit Weihnachten vergleichen, bei dem jeder seine Geschenke kriegt. Und wegen womöglich einer Sache im Jahr wird man von der Bescherung ausgeschlossen?? Glauben die Riotler wirklich, dass sich diese Spieler, die keine Geschenke bekommen haben sich mit gutem Verhalten in der nächsten Saison revanchieren??\n\nAus psychologischer Sicht löst eine zweifache Bestrafung für einen begangenen Fehler nur mehr negative Emotionen aus anstatt, wie sich die Riotler das womöglich vorstellen, eine positive Verhaltensweisenänderung des Spielers in der nächsten Saison. Aktionen wie diese lösen bei betroffenen Spielern Selbstzweifel und Gedanken von Inakzeptanz hervor die, die anstatt der guten Manieren, die Wut und Aggressionen von Spielern fördern.\n\nIch persönlich wurde vom 25.08.15- 08.09.15 gebannt, weil ich ''ty for the nice ss mid'' geschrieben habe, wie mir die ''Beweis-E-Mail'' zeigte. Habe ich deswegen kein Recht mehr auf Saison-Belohnungen ?  Ganz Ehrlich, einer sollte mir mal die Motivation, die hinter dieser Ausschluss-von-Belohnung-Aktion stecken sollte mal besser erklären. welp","replies":[{"poster":"Shiggyvara","date":"2015-11-22T09:01:44.603+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kwirk Elston,realm=EUW,application-id=ImBE6GqA,discussion-id=lQEa0HUT,comment-id=0000000000000001,timestamp=2015-11-21T23:55:40.155+0000)\n>\n> Man kann das Saisonende mit Weihnachten vergleichen, bei dem jeder seine Geschenke kriegt. Und wegen womöglich einer Sache im Jahr wird man von der Bescherung ausgeschlossen?? Glauben die Riotler wirklich, dass sich diese Spieler, die keine Geschenke bekommen haben sich mit gutem Verhalten in der nächsten Saison revanchieren??\n> \n> Aus psychologischer Sicht löst eine zweifache Bestrafung für einen begangenen Fehler nur mehr negative Emotionen aus anstatt, wie sich die Riotler das womöglich vorstellen, eine positive Verhaltensweisenänderung des Spielers in der nächsten Saison. Aktionen wie diese lösen bei betroffenen Spielern Selbstzweifel und Gedanken von Inakzeptanz hervor die, die anstatt der guten Manieren, die Wut und Aggressionen von Spielern fördern.\n> \n> Ich persönlich wurde vom 25.08.15- 08.09.15 gebannt, weil ich ''ty for the nice ss mid'' geschrieben habe, wie mir die ''Beweis-E-Mail'' zeigte. Habe ich deswegen kein Recht mehr auf Saison-Belohnungen ?  Ganz Ehrlich, einer sollte mir mal die Motivation, die hinter dieser Ausschluss-von-Belohnung-Aktion stecken sollte mal besser erklären. welp\n\nNunja, wenn der Flamer weiterflamt verliert er schlussendlich halt nicht nur seine Belohnungen, sondern auch seinen Account.\n\nDer einzige Grund aus dem dieses System leicht unfair sein könnte ist, dass sich Bronzespieler quasi keine Gedanken darum machen müssen, dass ihnen außer dem temporären Ban noch irgendetwas droht.","replies":[{"poster":"RIQT SUCKS BIG D","date":"2015-11-22T12:00:49.439+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=FTHGN,realm=EUW,application-id=ImBE6GqA,discussion-id=lQEa0HUT,comment-id=00000000000000010000,timestamp=2015-11-22T09:01:44.603+0000)\n>\n> Nunja, wenn der Flamer weiterflamt verliert er schlussendlich halt nicht nur seine Belohnungen, sondern auch seinen Account.\n> \n> Der einzige Grund aus dem dieses System leicht unfair sein könnte ist, dass sich Bronzespieler quasi keine Gedanken darum machen müssen, dass ihnen außer dem temporären Ban noch irgendetwas droht.\n\nAlso bin ich wegen einer Sache ( meiner Meinung nach unverdienten Sache ) in 365 nicht mehr berechtigt Belohnungen zu erhalten, sprich kein Icon, kein Rahmen und keinen Skin ? Na dann.. wenn ich für Riot ansehlich nichts mehr Wert bin sollte ich mal anfangen etwas zu machen, damit ich meinen 2 Wochenbann gerecht werde und feede mal im Gold-Ranked oder stell mich afk, anstatt meine Meinung ohne Schimpfwörter meinen Mitspielern mitzuteilen, wofür man , wie ich feststellen durfte, gebannt werden kann. Das System kann von Leuten, die 'einen schlechten Tag haben' nicht von dauerhaften Flammern unterscheiden. Ich kritisiere nicht nur spezifisch meine madige Situation sondern spreche das ganze Gremium von Riotlern an, damit sich da mal was ändert. Nur zu oft treffe ich auf Mitspieler die einen flamen, die afk gehen und feeden, trotzdem hab diese ihre Saison- Belohnungen erhalten und ich nicht?! Das ist doch absurd..   der Spaß am Spielen ist mir ja sowas von vergangen. Danke Riot.\nVielleicht werde ich in Season 6 mich für deine Belohnung revanchieren und das Spiel mal zeigen was richtiges BM ist.","replies":[]}]}]},{"poster":"Darinon","date":"2015-11-21T19:18:04.506+0000","up_votes":1,"down_votes":1,"body":"Na ja nächste Season ^^","replies":[]}]}]}]}]}