{"poster":"sin cos tan","date":"2016-06-19T05:40:38.803+0000","title":"Chroma Skins not showing [Client]","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"In champion select, my vayne chroma skins are not showing and can not pick them.\r\nPlay -&gt; Normals -&gt; Champion Select -&gt; Picks Vayne -&gt; Goes on skins -&gt; Dragonslayer -&gt; no chroma skins :(\r\nThis issue occurs occasionally. Screenshot attached.\r\n\r\nhttps://gyazo.com/83a94c1e80af1f42f1004d0bb9c08282","replies":[{"poster":"moonstones","date":"2016-06-20T18:08:44.998+0000","up_votes":1,"down_votes":0,"body":"Hiya, \n\nThanks for the report, and for adding a screenshot (makes things a lot easier). It looks like the chroma pack UI didn't load in (we'd had a similar issue with ward skin select). This is somehing we've been trying to track down, but it appears it's a weird scenario of loading in the client that doesn't have a 100% repro. Just to confirm, you aren't experiencing this every time you're loading into game attempting to use that chroma pack, correct?","replies":[{"poster":"Sirkind","date":"2016-06-21T13:27:47.047+0000","up_votes":1,"down_votes":0,"body":"Actually, I have the same problem he does. At least for me, I am experiencing this for all of my chromas ever time I try to load into a game. It doesn't work for Dynamic, Blind pick, and doesn't work for me in custom games as well. This is every time that I try to load into the game.","replies":[{"poster":"moonstones","date":"2016-06-21T16:57:53.951+0000","up_votes":1,"down_votes":0,"body":"Thanks for the additional context - I can follow up with the team today about it. :)","replies":[{"poster":"Sirkind","date":"2016-06-21T17:20:33.720+0000","up_votes":1,"down_votes":0,"body":"I thank you for your concern. Glad to see Rioters that care about us.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"moonstones","date":"2016-06-22T15:58:31.903+0000","up_votes":1,"down_votes":0,"body":"Of course! :) (This is also something in regards to the content I work on, so it's a bit easier to investigate!)","replies":[]}]}]}]}]}]}