{"poster":"Shinigami1332","date":"2017-11-15T18:45:09.182+0000","title":"Blaue essenzen pro lvl up","subforum":"Allgemeiner Chat","up_votes":7,"down_votes":0,"body":"Hi wollte mal fragen was habt ihr so aus euren Lvl Up kapseln bekommen? Ich selbst zwar erst 2 kapseln gehabt aber bei beiden hatte ich 3 bzw 4 champs die nur 90 blaue essenzen gaben und 1 bzw 2 die 270 (also die 1350er champs) gaben. also so im dreh 800 Essenzen. Wie siehts bei euch aus? War es bei mir einfach pech oder normal?","replies":[{"poster":"BlackFireCo","date":"2017-11-15T21:59:49.647+0000","up_votes":3,"down_votes":9,"body":"bei mir ganz unterschiedlich also mittlerweile lvl 47 von 46 auf 47 2 90 er und 1 630 er bekommen ...","replies":[{"poster":"necxqn","date":"2017-11-16T07:34:57.588+0000","up_votes":9,"down_votes":0,"body":"***","replies":[{"poster":"Janna best Waifu","date":"2017-11-16T14:03:46.505+0000","up_votes":6,"down_votes":1,"body":"das klingt stark nach exploit oder bugg oder du lügst.(im forum steht du bis level 38) der höchste spieler ist derzeit 45 und spielt 10-15 spiele am tag mit exp boosts. und schaft somit 2 level pro tag.  (siehe reddit).\n\n\nich selber bin level 40 mit exp boost und exp event code von 2014 (der stackt). spiele ca 8 spiele pro tag. \n\nkrieg ca 800 blaue essens pro level und 2000 auf 40. von 40 auf 41 dauert es aber deutlich länger 3k exp + (10 spiele + mit exp boost).","replies":[{"poster":"El Mananana","date":"2017-11-16T14:56:09.185+0000","up_votes":2,"down_votes":1,"body":"Er ist lvl 47, keine Ahnung wieso in alle disliken. Wenn man mal auf sein Profil gehen würde, könnte man es sehen. Aber ok.","replies":[{"poster":"Janna best Waifu","date":"2017-11-16T16:48:15.244+0000","up_votes":5,"down_votes":0,"body":"warscheinlich weil er vermutlich irgend nen trick ausnutzt. bzw premades hat die absichtlich im gegner team landen und sabotieren. Der höchste bekannte spieler is halt 45 bzw 46 jetz, und das der gute auf reddit.  Ich hab da noch ne andere vermutung, aber das halt ich für mich. weil wenn ich es hier reinschrieb, verstoß ich gegen die Terms of Uses. ich sag nur \"Custom 12vs12\"\n\n**-edited: p.s. wenn ich mir seine history anguck. - nice . hab mal den riot games support kontaktiert... Ou man wie kann man bitte so dreist sein, und ein system was grade ers eine woche auf dem markt ist so hart abusen.! **\n \nWie Maxim sagen würde \"Das Why der Woche!\"","replies":[{"poster":"El Mananana","date":"2017-11-16T18:16:56.746+0000","up_votes":3,"down_votes":0,"body":"Hab mir auch mal seine Match History angeschaut. Er grindet halt ziemlich stark mit Coop Spielen. Wer´s nötig hat ^^","replies":[{"poster":"BlackFireCo","date":"2017-11-19T14:57:13.812+0000","up_votes":2,"down_votes":1,"body":"spricht was dagegen ich lvl ja nur und bin halt gespannt was die belohnungen sind ...","replies":[]}]},{"poster":"SK Lara va Flava","date":"2017-11-16T17:01:01.723+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Luxienna,realm=EUW,application-id=YnZkMR0R,discussion-id=RY1LQsrm,comment-id=00000000000000000000,timestamp=2017-11-16T16:48:15.244+0000)\n>\n> warscheinlich weil er vermutlich irgend nen trick ausnutzt. bzw premades hat die absichtlich im gegner team landen und sabotieren. Der höchste bekannte spieler is halt 45 bzw 46 jetz, und das der gute auf reddit.  Ich hab da noch ne andere vermutung, aber das halt ich für mich. weil wenn ich es hier reinschrieb, verstoß ich gegen die Terms of Uses. ich sag nur &quot;Custom 12vs12&quot;\n> \n> **-edited: p.s. wenn ich mir seine history anguck. - nice . hab mal den riot games support kontaktiert... Ou man wie kann man bitte so dreist sein, und ein system was grade ers eine woche auf dem markt ist so hart abusen.! **\n>  \n> Wie Maxim sagen würde &quot;Das Why der Woche!&quot;\n\n+1\n\nGenau wie meine Vorposterin es gesagt hat. Der Spieler erstellt sich irgendwelche Accounts bzw Spielt mit accounts die unter level 30 sind im Custom Botgame und läst sich hochfeeden, bzw. profitiert von dem Bonus , das er Exp kriegt, da die anderen im Team noch nicht stufe 30 erreicht haben, bzw. grade erst level 30 geworden sind.\n\nDas System/Im Support steht eindeutig geschrieben, das Botgames deutlich weniger Exp geben, Dadurch das er aber \"Smurfs\" im team hat, wird er nicht gepunished, da Spieler die unter level 30 sind Keinen Malus bekommen. \n\nZiemlich Schwache Leistung!\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"BlackFireCo","date":"2017-11-19T14:56:51.424+0000","up_votes":2,"down_votes":2,"body":"Ach so cop games sind verboten ist klar ich versteh euch echt net xD","replies":[{"poster":"El Mananana","date":"2017-11-20T08:08:17.412+0000","up_votes":1,"down_votes":1,"body":"Mach dir nichts draus die verstehen es halt nicht wirklich, sind wahrscheinlich neidisch oder einfach nur ignorant. Mir persönlich geht es um den Spaß, aber wenn du halt lieber grindest ist das auch ok. \n\nDer Beweis, dass du nich hackst, cheatest oder was weiß ich: \nhttps://www.reddit.com/r/leagueoflegends/comments/7dw0x9/til_highest_level_player_has_level_83_and_hes/","replies":[{"poster":"BlackFireCo","date":"2017-11-20T19:07:58.137+0000","up_votes":1,"down_votes":0,"body":"Ja kenne ihn hab ihn auch in liste beste beispiel und wie gesagt ich geh jeden tag 10 stunden arbeiten bin jetzt 55 das ist garnix schaut der raphael ist 89 also bitte da geht noch einiges mehr wäre auch so hoch wenn ich die zeit hätte","replies":[{"poster":"El Mananana","date":"2017-11-20T20:49:56.801+0000","up_votes":1,"down_votes":0,"body":"Finds halt lustig wie uns alle downvoten nur weil sie es nicht glauben wollen bzw. nicht genug Toleranz/Respekt übrig haben. Naja ist halt traurig.","replies":[]}]}]}]}]},{"poster":"BlackFireCo","date":"2017-11-19T14:55:43.379+0000","up_votes":2,"down_votes":2,"body":"Ich verstehe euch alle nicht damit hier alle aber mich mal verstehen ich hab pro sieg boost aus dem itemshop und tagesboost kriege pro game ziwschen 300 und 400 punkte daher geht das so schnell was den bitte für ein trick bin mittlerweile 50  was soll riot da machen ich lvl einfach nur lol ...","replies":[]}]}]}]},{"poster":"BlackFireCo","date":"2017-11-19T14:58:28.313+0000","up_votes":2,"down_votes":1,"body":"So hard suchte ich nicht wie du denkst sonst wäre ich schon lvl 100 ^^ erlich","replies":[]}]},{"poster":"Shinigami1332","date":"2017-11-16T13:09:55.977+0000","up_votes":6,"down_votes":1,"body":"nen 630er wäre mir viel lieber da fehlt mir wenigstens was und somit könnte ich die billiger kaufe als splitter :D","replies":[]},{"poster":"zoroyashie","date":"2017-11-16T10:12:27.296+0000","up_votes":2,"down_votes":6,"body":"Respekt.\nEin wahrer Gamer wie er wahrscheinlich... ok gut du bist Platin..`^_^\nHeeii...... Hoch lebe Leagueoflegends.","replies":[{"poster":"BlackFireCo","date":"2017-11-19T14:57:37.675+0000","up_votes":2,"down_votes":1,"body":"^^ ich war s3 platin bald wieder rankeds :)\naber danke","replies":[]}]}]},{"poster":"Dr Ogre","date":"2017-11-21T08:43:01.737+0000","up_votes":2,"down_votes":0,"body":"Also wer hier behauptet, dass man genug blaue Essenzen nach einem Level Up erhalten würde, dem muss ich stark widersprechen. Zumindest bei mir ist es so, dass ich bisher pro LVLUP Ø ca. 1000 blaue Essenzen erhalten habe. Das macht bei 5 Leveln = 5000 BE und dafür muss ich mir sowohl Champions Mastery Stufen (6/7) + wenn es überhaupt möglich sein soll, weitere Champions.... Das heißt ich habe, sage und schreibe, nach 2 Wochen einmal meinen Ornn von 6 auf 7 geupgraded und habe jetzt noch 1000 BE über... COOL! \n\nUnd selbst jetzt nach dem Patch, wo man täglich 50 BE erhalten kann... Dann mach das alle 2 Wochen weitere 700 BE. Ich weiß nicht, ob das alles so sinnig ist bisher! Lieber 100 BE pro Tagessieg oder gar 150... Aber 50 machen mMn den Kohl nicht fett!","replies":[{"poster":"Qbert","date":"2017-11-21T11:19:07.099+0000","up_votes":2,"down_votes":0,"body":"1. musst du die Champ-Masteries nicht mit BE kaufen, es gibt noch eine andere Möglichkeit -> Champ-Shard\n2. stimme ich dir zu, sie ziehen 175XP beim Sieg des Tages ab, dafür bekommen wir 50BE ... da alle BE-Preise in den Tausendern liegen, finde ich das schon fast frech.\n500 BE hätte ich verstanden, aber 50 BE 1x täglich, das hätten sie sich auch sparen können.","replies":[]}]},{"poster":"Totenacker","date":"2017-11-16T20:15:23.598+0000","up_votes":2,"down_votes":0,"body":"Level 35, zwei mal schon kayle und amumu, gg","replies":[{"poster":"Shinigami1332","date":"2017-11-17T16:55:18.370+0000","up_votes":1,"down_votes":0,"body":"bei mir war es 2 mal poppy und nunu und auch die anderen 450er wenigstens 1 mal :D","replies":[]}]},{"poster":"JYG","date":"2017-11-16T21:10:01.637+0000","up_votes":1,"down_votes":0,"body":"nur eher nicht so gute sachen QQ","replies":[]}]}