{"poster":"SGTMadBull","date":"2018-11-28T18:16:07.915+0000","title":"Wie spielt man gegen Pyke?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Pyke ist ein echter Albtraum!\r\n\r\nWas mach man gegen diesen Champion?\r\n\r\nVG\r\n\r\nSGT","replies":[{"poster":"Vorzüglich","date":"2018-11-28T18:25:04.304+0000","up_votes":3,"down_votes":0,"body":"Ich gehe mal von deinem Spiel aus wo do Vel`koz gespielt hast, also in der Support Rolle.\n\nMorgana, ist die einfachste Antwort.\n\nIch persöhnlich spiele Zilean gegen ihn. Damit lässt sich seine Ult sehr einfach rausnehmen.\n\nWenn Du natürlich probleme hast, mit seinem Engage oder seinen Hook nicht dodgen kannst, solltest Du an deinem positioning arbeiten.\n\nAm besten baust du \"Mikaels Schmelztiegel\" und \"Befreiungsschlag\" damit kannst Du viel seines Schrecken nehmen.\n\nVG","replies":[{"poster":"ToxicRedPanda","date":"2018-11-28T18:41:00.961+0000","up_votes":1,"down_votes":0,"body":"Besser als mein Tpp, der wäre Pyke einfach bannen.","replies":[{"poster":"Vorzüglich","date":"2018-11-28T18:47:38.958+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ToxicRedPanda,realm=EUW,application-id=Wj1wcocU,discussion-id=E0lBJRN7,comment-id=00010000,timestamp=2018-11-28T18:41:00.961+0000)\n>\n> Besser als mein Tpp, der wäre Pyke einfach bannen.\n\nBannen kann wirklich eine gute Antwort sein. Besonders wenn man spezielle Comps. spielt.\nVon daher guter Einwand. \nIch persöhnliche habe Pyke aber nicht auf meiner Top 10 Ban list.","replies":[{"poster":"ToxicRedPanda","date":"2018-11-28T21:36:19.102+0000","up_votes":1,"down_votes":0,"body":"Ich bin aktuell Fan davon ihn zu picken, finde ihn zumindest in der Lane aktuell sehr stark. Kann auch nur mein persönliches Empfinden sein, aber ich glaub der braucht ein paar Nervs.","replies":[{"poster":"Vorzüglich","date":"2018-11-29T13:53:41.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ToxicRedPanda,realm=EUW,application-id=Wj1wcocU,discussion-id=E0lBJRN7,comment-id=0001000000000000,timestamp=2018-11-28T21:36:19.102+0000)\n>\n> Ich bin aktuell Fan davon ihn zu picken, finde ihn zumindest in der Lane aktuell sehr stark. Kann auch nur mein persönliches Empfinden sein, aber ich glaub der braucht ein paar Nervs.\n\nIst ein Champ der meiner Meinung nach sehr viel Spielverständnis benötigt. \nDieses Wissen aber auch belohnt. Darin liegen meiner Meinung nach auch seine stärken und schwächen begründet.\n\nAuf guten Spielern durchaus ein Schrecken, würde ihn auch eher nerfen als buffen.","replies":[{"poster":"ToxicRedPanda","date":"2018-11-29T15:16:48.055+0000","up_votes":1,"down_votes":0,"body":"Ich habe wirklich Probleme mit ihm ausserhalb der Lane. Wenn die Lane gut läuft geht danach noch was, aber irgendwann ist für mich nicht möglich was großartiges zu erreichen. Hättest du da eventuell einen Tipp für?","replies":[{"poster":"Vorzüglich","date":"2018-11-29T22:38:15.684+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ToxicRedPanda,realm=EUW,application-id=Wj1wcocU,discussion-id=E0lBJRN7,comment-id=000100000000000000000000,timestamp=2018-11-29T15:16:48.055+0000)\n>\n> Ich habe wirklich Probleme mit ihm ausserhalb der Lane. Wenn die Lane gut läuft geht danach noch was, aber irgendwann ist für mich nicht möglich was großartiges zu erreichen. Hättest du da eventuell einen Tipp für?\n\nDu spielst auf Plat. Elo?\n Ich bin selbst derzeit nur bis Gold III unterwegs. Aber im grunde versucht ja jeder Pyke Spielmacher zu sein.\nAls Pyke willst Du ja ahead sein. Dazu musst auch mal \nroamen...sprich trappen und baiten gerade im early Game, sind eine gute Wahl auch gegen Pyke. \n\nGerade das Early Game und das Mid bevor dem gegroupe also stärker ausnutzen um ihn gezielt 2vs1 oder 3vs2 rausnehmen.\n\nIm Late wird es kniffliger, im grunde ist er davon abhängig das sein Team SEIN Ziel stark focusiert (nach dem hook) oder er schaut danach welcher feind  ist gerade low HP für seinen Execute.\n\nSprich ihr macht den switch bei geringer HP von front zur backlane gezielter oder ihr versucht seine Ult gezielt zu baiten und zu verhindern, wie gesagt mit Redemtion z.B.\n\nIn den Gegner hineinversetzen und dann wird das schon...ist die ult erst raus, ist pyke halb so wild.","replies":[{"poster":"ToxicRedPanda","date":"2018-11-30T00:15:11.154+0000","up_votes":1,"down_votes":0,"body":"> Du spielst auf Plat. Elo?\n\nSchön wäre es, bin Silber :D\n\nSorry für den Rest habe ich aktuell zu vielm getrunken um was zu verstehen","replies":[{"poster":"Vorzüglich","date":"2018-11-30T00:22:13.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ToxicRedPanda,realm=EUW,application-id=Wj1wcocU,discussion-id=E0lBJRN7,comment-id=00010000000000000000000000000000,timestamp=2018-11-30T00:15:11.154+0000)\n>\n> Schön wäre es, bin Silber :D\n> \n> Sorry für den Rest habe ich aktuell zu vielm getrunken um was zu verstehen\n\nkurz gesagt: spiele selbst mal Pyke, dann bekommt ein Gespür für sein Vorgehen und solltest ihn dann auch  besser countern können.","replies":[{"poster":"ToxicRedPanda","date":"2018-11-30T00:26:37.042+0000","up_votes":1,"down_votes":0,"body":"Ich spiel ihn aktuell relativ oft, aber im betrunkenen Zustand empfehle ich doch Blitzcrank.\n\nAuch Queen lohnt sich, nicht nur wenn man was getrunken hat. Ist im allgemeinen eine großartige Band.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Bruder mûss Los","date":"2018-11-30T10:54:29.836+0000","up_votes":1,"down_votes":0,"body":"Ganz einfach - **B a n n e n** \n\nPS: Ich hasse diesen champ auch!...\n\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"StephaniewQlZj","date":"2018-11-29T08:57:09.372+0000","up_votes":1,"down_votes":0,"body":"einfach ein tank mit cc picken, sowas wie ali, leona usw. morgana geht auch. nicht hooken lassen und auf die ulti aufpassen, ohne ult ist er recht nutzlos.","replies":[]},{"poster":"SSI CptHaunted","date":"2018-11-29T07:18:53.193+0000","up_votes":1,"down_votes":0,"body":"Genau wie gegen Morgana, Thresh, Blitz etc auch, möglichst immer hinter Minions bleiben damit er niemanden hooken kann und wenn er zu nah rankommt braucht man nur etwas Hard-CC und nen ADC der auch im Early schon etwas Schaden macht. Jhin + Morgana/Leona wäre z.B. eine Combo. Zugegeben, in meiner Elo werden vermutlich nicht so viele gute Pyke-Spieler zu finden sein, ich für meinen Teil spiele sogar ungern mit nem Pyke als Support, da viele ihre Q nicht treffen, danach trotzdem ihre E agressiv verwenden und dann sterben.","replies":[]},{"poster":"Holokom","date":"2018-11-28T21:13:30.474+0000","up_votes":1,"down_votes":0,"body":"Ok, wichtigste Sache vorweg...Riot liebt ihn und will ihn im moment unbedingt viable machen....nach 5 patches hintereinander gebuffed und immer noch mittelmaß...Assasins als Support sind einfach schlecht, seine einzigste chance ist die Lane zu snowballen. Also spiel etwas womit du praktisch gegen ihn AFk gehst so das er nichts machen kann.  Karma, Janna , Lulu , Morgana sind alle großartig da sie in der Lane alle nix machen wollen. \nTanks funktionieren auch alle da sie super gegen sein itembuild ankommen. Ansonsten...bring deinem ADC einfach bei nicht zu versuchen zu traden, spielt afk super passive und wartet bis der Jungler kommt...und geht dann auf den adc und ignoriert pyke...er kommt eh immer weg.","replies":[{"poster":"7deadLeeSlnz","date":"2018-11-28T22:12:14.379+0000","up_votes":1,"down_votes":0,"body":"> Riot liebt ihn und will ihn im moment unbedingt viable machen\n\nWas bedeutet viable in deinen Augen ? Seine 50+% WR bei einer 10+%PR selbst auf Master+? Das er bei den Wolds geepickt/gebannt wurde? Oder doch, dass ihn selbst Pro-Spieler gerne spielen?\n\n> nach 5 patches hintereinander gebuffed\n\nGut, dass insgesamt erst bei 4 Patches bei ihm etw. verändert wurde.\n\n\nWie gut Pyke ist, darüber kann man sich streiten. Schlecht ist er jedoch bestimmt nicht. \nEr hat mit einem Hoock und Stun 2x HardCC dabei, ähnlich wie Tanks; jedoch tauscht er Robustheit für Dmg ein.","replies":[]}]},{"poster":"sN00Bdogg","date":"2018-11-28T21:41:50.346+0000","up_votes":1,"down_votes":0,"body":"Ich weiss nicht, aber man hört ihn doch mmer kommen. Also einfach ausweichen oder ?","replies":[]},{"poster":"OSaftKiller","date":"2018-11-28T18:19:42.095+0000","up_votes":1,"down_votes":0,"body":"CC, Töten, evtl. Zähigkeit mitnehmen (Präzision Baum), Rüstung.","replies":[]}]}