{"poster":"Asmadred","date":"2015-02-12T19:22:04.629+0000","title":"Tanks in der neuen Seson","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hallo,\r\n\r\nzur Info vorab, ich spiele im Silberbereich und war in der vorherigen Seson silber 1 (mehrfach in der Promo zu gold 5) nun dümpel ich wieder (nachdem ich mich aus bronze 1 rausgeprügelt habe) in Silber 3 (ja für die welche nach sehen ich habe es nicht geschafft meine Promo zu carryn)\r\n\r\nSo nun aber zum eigentlichen Thema: Ich empfinde das Tankdasein mehr und mehr als Sinnfrei, ich meine ich weiß das ab 150 Rüstung so in etwa der %satz welcher normalen Schaden verringert recht gering ausfällt in der regel kaufe ich Sonnenfeuer und Randiums beide geben sehr gut Rüstung und Leben, Schuhe in der Regel Merkurys oder ninja tabbies. Wenn ich dann noch sehe im gegnerteam rennen viele mit Atackspead rum hau ich noch einen Dornenpanzer rein womit wir dann 4 Itempletze voll haben und wenn ich dann Jungler bin (versuche ich meistens zu sein um mehr Kontrolle im spiel zu haben) ist da noch das liebe Jungelitem also item Nummer 5 was dann bedeutet das ich sage und schreibe 1 Item gegen Magie haben kann was bei AD-lern nun eher rar  ist wie ich finde sprich Geistessicht, Schleier und das Magieschwert dessen Name mir gerade entfallen ist, das was einem einen Schild gibt wenn man Low Life wird. So nehmen wir dann mal an ich brauche keinen Dornenpanzer dann habe ich 2 Items frei...\r\n\r\nwas dann die Frage aufwirft was will ich haben? Dmg? Dann das Schwert und den Schleier...bei Leben halt Geistessicht und Schleier.\r\n\r\nSo nun das alles klingt für mich eigentlich gut im normalfall also gesunde M-resie und Rüstung, tja aber die Geger sind ja nun meistens auch nicht so hirntot, sprich sie bauen Blade, Last wisper, Schwarzes Beil ect pp die üblichen verdächtigen halt...wenn dann noch ne Vayne dabei is schauts eh finster aus...Die meisten werden nun eh schon lange wissen worum es mir geht, ich finde das Tanks derzeit zu schnell down bekommen werden können, ich meine von meiner Logik aus sollte ein Assa eigentlich nicht so ohne weiteres in der Lage sein einen Tank weckzubursten (nein ich war nicht im Nachteil, meistens) Von daher würde ich gerne den Rat erfahrenner höherrangiger Tankspieler einziehen...wie seht ihr das und was macht ihr dagegen?\r\n\r\nmfg Asmadred","replies":[{"poster":"BadabingBadaboom","date":"2015-02-13T13:55:11.601+0000","up_votes":1,"down_votes":0,"body":"Tanks fallen meiner Meinung im lategame extrem ab, die fungieren nur noch als Meatball, darum versuch einfach schon in Midgame zu finishen, ansonsten bist du auf deine Mates angewiesen :)","replies":[]},{"poster":"iJUKEuQQ","date":"2015-02-13T12:02:24.619+0000","up_votes":1,"down_votes":0,"body":"die aktuelle meta favourisiert champs, die ihren powerspike mit 2 items haben, also sehr früh im spiel haben.reine tanks werden eher useful im very lategame.daher erscheinen pure tanks gerad einfach sehr schwach, da sie mit 2 tanky items zwar nicht so schnell sterben, aber auch ziemlich nutzlos und  in der regel ignoriebar sind. tanky bruiser hingegen können zb den adc zerlegen und sterben hingegen auch nicht so einfach.was beduetet dies für uns jetzt?\ngenau meide reine tanks es gibt immer ausnahmen aber schau doch einfach mal in die lcs rein, da wird sehr viel klar warum was gerad zur zeit gut ist.lg","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-02-12T22:06:45.863+0000","up_votes":1,"down_votes":0,"body":"das Problem für reine Tanks ist halt... du spielst bei LoL halt nicht gegen irgendwelche stupiden Bots, die das Ziel mit der am beeindruckendsten aussehenden Rüstung (ernsthaft, bei Dragon Age wird genau DAS als Tipp angegeben) angreifen... sondern gegen Spieler, die sich teilweise auch intelligent anstellen...\n\nMan muss halt seinen Gegner auch einen Grund geben, den Tank zu fokussieren... deswegen macht Randuims into Sunfire into Thornmail nicht sonderlich viel Sinn... da die gegnerischen AD Carries die dann einfach nicht mehr angreifen und du komplett ignoriert wirst... an der Stelle sei nebenbei auch noch mal [dieses wunderschöne Video erwähnt](https://www.youtube.com/watch?v=0UIE_dyyfKU&index=4&list=PLcRwqrhsTZgCntIwpp6EAwbcFDwHrwTpJ), dass einem erklärt, dass reines Rüstung Stacken gar nicht so viel bringt...\n\nEs sei denn... du willst Tower Tanken... Ein 6 Item Full Tank Mundo stellt sich halt im Lategame stundenlang unter die Nexus Towers... und die sind halt klüger als Mundo und geben irgendwann nach... damit kann man nebenbei auch Spiele gewinnen... man muss dann halt als Team wirklich die Tower und Inhibitoren fokussieren... Und Mundo ist halt DER Tank schlechthin, der am Ende einfach nur da hin geht, wo es ihm passt... und von nichts tot zu kriegen ist... \n\nAn sonsten... musst du halt als Tank entweder...\nNe AOE Initiation haben, die am besten als Wombo-Combo funktioniert. Malphite into Yasuo oder Amumu into Kata Ults... deine Tankyness stellt sicher, dass du zu den High Priority Zielen kommst, dein CC stellt sicher, dass dein Team seine Skills anwenden kann...\n\nEinen AOE Effekt, den der Gegner nicht oder nur kaum ignorieren kann... Maokais Ulti reduziert den angerichteten Schaden aller Champs im Umkreis um 20%... den kann man auch nicht einfach bis zum Ende des Kampfes durchlaufen lassen, da muss man irgendwie drauf reagieren...\n\nGenügend Schaden machen, so dass der Gegner dich nicht komplett ignorieren kann... deswegen baut man auf Irelia und Jax als erstes die Trinity Force und dann die Tank-Items... dann kannst du halt in den Gegner reinspringen und die können dich trotzdem nicht ignorieren...","replies":[]},{"poster":"Ragequit Account","date":"2015-02-12T20:32:06.263+0000","up_votes":1,"down_votes":0,"body":"Richtige Tanks werden seit Ewigkeiten kaum noch gespielt.\nOfftank Bruiser sind aber schon sehr lange viable und waren zeitweise auch absolut Dominant. Man denke nur an Anfang S4 zurück, wo Renekton, Shyvana in nahezu jedem Spiel waren. Jax, Trundle, Mundo und Irelia haben das ganze dann eigentlich komplettiert.\nAls sich die tanky bruiser Meta dem Ende zuneigte, kam mit Gnar ein neuer Toptier offtank.\nIm Jungle werden überwiegend immernoch tanky bruiser gespielt. Lee, J4, Vi, Reksai, Rengar...\n\nProbleme haben eher die Fulltanks.","replies":[]},{"poster":"Yra","date":"2015-02-12T20:09:43.248+0000","up_votes":1,"down_votes":0,"body":"Wie oben gesagt sind Tanks zum Peelen da d.h. sie versuchen den Gegner solange wie möglich Festzuhalten \ndamit der Carry gefahrlos den Gegner töten kann. \nIm Idealfall überlebt man den TF (mit den Carrys).\nMann muss  mit dem vorhandenen CC (Dis)engagen können um Stunns usw. abzufangen.\nIch selber habe schon mit Maokai Teams gecarryt,\nindem ich den ganzen Schaden auf mich gezogen habe und meine Mates beschützt habe.\nMan muss als Tank immer im Team spielen sonst ist man useless, zudem muss man wissen was man focusen soll.\nFalls man den richtigen Zeitpunkt zu Engagen nicht weiß ist man Tod.","replies":[{"poster":"I am Bekkz","date":"2015-02-12T20:23:31.768+0000","up_votes":1,"down_votes":0,"body":"Kann dir da nur Recht geben. Habe auch schon Games mit Malphite gecarried weil die Ulti auf Adc, Apc + Supp mit der gefolgten Yasuo Ulti das ganzen Team zerstört hat ^^","replies":[]}]},{"poster":"I am Bekkz","date":"2015-02-12T19:51:09.186+0000","up_votes":1,"down_votes":0,"body":"Tanks sind Spielbar, Nützlich und vieles Mehr. Die meisten Tanks bringen viel CC zum Peelen ({{champion:54}} {{champion:111}} {{champion:154}} ) Wichtig ist, die richtige Balance in den Items zu schaffen. {{item:3143}}  und {{item:3065}}  sind auf fast allen Tanks ein Muss. Man darf aber auch nicht nur Tankkram bauen, da dadurch der Schaden des Tanks so ziemlich 0 ist und 4 Tankitems (Fulltank) oder 2 Tankitems (meist Bruiser) reichen, denn Tank ist bei LoL nciht das selbe wie z.B. bei MMORPG´s sie sollen einstecken, aber auch ein wenig austeilen, denn im Normalfall versucht das gegnerische Team deine Carries zu töten da deren Schaden höher ist. Wenn du dich als Tank aber in den Vordergrund stellst, müssen die erst an die vorbei d.h. viele CD´s werden genutzt und meist auch schon einige signifikante Ultimates. Damit ist dein Job auch schon getan, da du viele Skills (evtl auch Summs) auf dich gezogen hast und deine Carries nun freie Bahn haben =) Beim Tank zählt wie beim Supporter nicht wie viele Kills er hat. Sondern eher die Assists, denn die zeigen (wie beim Supp), dass du das Killgold lieber denen in deinem Team gibst, die es besser gebrauchen können. Wenn der Jung auf Top nen Kill bekommt (weil du Tank bist) und der gegnerische Jungler nicht ist 1. dein Jungler stärker und seine Ganks sind besser und 2. du hast dadurch keinen Nachteil denn der nächste Gank wird kommen {{summoner:31}} \n\n{{item:3156}}  Ist übrigens eher für Bruiser als wie für Tanks. Ein Tank preferiert da eher {{item:3065}}  oder {{item:3190}}  (Dieses baut man aber nur wenn weder der Jungler noch der Support eins haben, sprech dies also vorher mit dem Team ab)\n\nEDIT: Zum Dornenpanzer. Bau den erst nach einem Item wo Leben drauf ist (Omen z.B.) und auch nur wenn alle Gegner AD (Auto Attack) basierend sind.\nUnd ich geb dir mal eine Kruze auflistung an Items die man gut auf Tanks bauen kann, wenn man das Standartzeug schon hat.\n{{item:3025}}  Gibt Rüstung, Mana und einen nützlichen Slow auf den nächsten Autoattack nach einer Fähigkeit\n{{item:3116}}  Bevorzugt auf Malphite und Maokai. Diese haben zwar schon jeweils einen Slow, profitieren aber von der AP und dem Leben und der Extraslow ist nicht zu verachten\n{{item:3110}}  Sehr gut gegen Master Yi, Fiora, alle Adc´s und auch Yasuo + es gibt einem Gute Stats mit Mana und Rüstung\n{{item:3800}}  Eigentlich ein Supportitem, welches aber in den Händen eines Tanks sein Potential nochmal zeigt. Neben dem CC des Tanks, der Fähigkeit zu peelen und Schaden zu fressen, kann man mit diesem Item beeinflussen wie ein Kampf ausgeht da die Movespeed deinem Team eine Möglichkeit gibt schnell die Position zu wechseln, Skillshots auszuweichen oder damit du selber schneller bist und eine Rakete von Jinx schlucken kannst, die sonst deine Midlane gekillt hätte (im Teamfight) ","replies":[{"poster":"Asmadred","date":"2015-02-12T20:07:17.074+0000","up_votes":1,"down_votes":0,"body":"Danke der erste Kommentar mit Sinn :) Zu den MMoRPG´s ja da helfen ja die Spots und so das die mobs an einem Kleben in LoL rennen die halt auch mal an einem vorbei...das problem ist das wenn ich als Tank mehr Offtank baue das ich dann wiederum unter dem Poke und Haress des Feindes zugrunde gehen kann ... zu meist sind auch die Teammats auch zu feige etwas zu unternehmen wenn der Kampf losgeht, so erlebe ich es offt das wir die gegner quer über die Karte Jagen bis zu einem Tower da stoppen meine und rennen im Kreise lassen sich von deren Skills zumeist 50% oder 60% life kloppen und wundern sich dann das die gegner angreifen...ich sehe darin zumeist einfach Zeit und Farmverschwendung.\n\nVieleicht nehme ich aber auch den falschen Champ fürs Tanken (zumeist Jarven und Xin, ja Xin ist eigentlich eher als DD gedacht aber wenn du ne riven, ahri, sona und ka ne Cait hast im team bleibt einem leider nicht viel anderes über -.-)","replies":[{"poster":"I am Bekkz","date":"2015-02-12T20:13:54.851+0000","up_votes":1,"down_votes":1,"body":"Jarvan ist mehr Bruiser als wie Tank. Die Champions die eher als Tank gedacht sind und keine Angst vor Riven, Ahri etc haben sind: Malphite, Skarner, Nasus, Dr Mundo, Maokai, Nautilus, Shyvana u.a \nDa du eher Xin und J4 spielst empfielt es sich, den Bruiser weg zu gehen. Stiefel + 4 Dmg Items und 2 Tankitems (Bei Xin ist z.B {{item:3153}}  und {{item:3142}}  sehr stark). Dein Job wäre dann in den Kampf zu engagen wenn sich eine Möglichkeit ergibt und in kurzer Zeit so viel dmg zu machen wie möglich am besten auf Adc oder Apc (Jungler ist auch eine gute Prio weil man danach leicht für Drake oder Baron gehen kann) Leider bringt das alles nichts wenn dein Team den \"Follow up\" nicht hinbekommt. Analysier am besten für 4-5 sekunden die Lage und engage wenn der Gegner einen wichtigen skill verkackt (Thresh/Blitz hook, Ahri Charm, Sona Ult etc) Dann ists meisten GG ^^\n\nUnd die Sache mit dem Team ist leider unvermeidbar. Viele Spieler haben Angst einen All in zu wagen und werden vom Poke zerrissen. Das liegt dann aber nicht an die sondern an deren nicht vorhandener Geduld und der Fähigkeit Skillshots zu dodgen","replies":[]}]}]},{"poster":"Kugelmacher","date":"2015-02-12T19:29:59.431+0000","up_votes":1,"down_votes":0,"body":"Ich spiele fast nie Tanks deshalb kann ich nicht so mitreden, aber war der Tank nicht immer ne stumpfe Rolle? Macht es nicht auch einen Tank aus, einen Build zu haben nicht viel zu überlegen und sich in den Gegner/Baron/Dragon reinzustellen?","replies":[{"poster":"Asmadred","date":"2015-02-12T19:54:50.867+0000","up_votes":1,"down_votes":0,"body":"Öm nein?... Der Tank ist für den Schuz der Gruppe zuständig, sprich er verteidigt die Carrys oder eröffnet den Kampf wobei er dann versucht die feindlichen DD´s in irgendeiner Form daran zu hindern Schaden auf die eigenen Leute zu machen...\n\nin Star wars denken das übrigens auch immer alle das der Tank eine total stumpfe rolle hat ","replies":[{"poster":"Kugelmacher","date":"2015-02-12T20:04:26.368+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt, ich spiele Support, da ist außer Alistar nicht so viel gerade nett. (Und ich bin super schlecht als Alistar mit dem durch die gegend schießen hehe :( )","replies":[]}]}]},{"poster":"Marauth","date":"2015-02-13T08:20:26.678+0000","up_votes":1,"down_votes":1,"body":"Tanks können in LoL extrem stark sein... Aber nur, wenn dein Team mitspielt.\n\nWie sonst hätte folgende Situation ein erfolg werden können.\n[Einen Alistar und Malphite unterm Tower diven? Reiner selbstmord, aber hat geklappt damals :D](https://www.youtube.com/watch?v=aF8DMdJl2C8)\n\nUnd hier bgeinnt das Problem. LoL \"mutiert\" zum Solo-Match. Teamplay steht erst an 2. Stelle. Erst Lane gewinnen, dann Gegnerteam zerlegen... so macht LoL als MOBA auf dauer keinen Spaß.","replies":[]},{"poster":"VuMpX","date":"2015-02-12T23:59:09.706+0000","up_votes":1,"down_votes":1,"body":"Ich finde das nur die meta Tanks scheiße sind.\nAlso i zocke öffters shen auf full tank und der geht ab wie n Zäpfchen. \nDu kannst deinem Team lifesteal geben,kannst agro ziehen(taunt) und bist kaum Tod zu kriegen.\nAusserdem hast du die beste Retter skill im Spiel.\n\n\nMir ist auch aufgefallen,  das die Leute shen nach dem aussehen beurteilen und nicht erkennen dass er n tank ist.\nAlso ich werde immer ge fokussiert.","replies":[]},{"poster":"Dermel","date":"2015-02-12T19:37:19.471+0000","up_votes":1,"down_votes":4,"body":"Sorry für diesen qualifizierten Beitrag aber es muss einfach ein Spruch kommen: ICH BIN EIN TANK-HOLT MICH HIER RAUS !!! {{champion:59}} {{champion:33}} {{champion:54}} {{champion:57}}. Ich hoffe trotzdem, dir weitergeholfen zu haben. Ich Spiel an Tanks eigentlich nur Malphite Toplane und Leona support.\nDein Thresh-Q failer Dermel{{summoner:3}}","replies":[]}]}