{"poster":"Razek Fury","date":"2015-12-18T15:11:33.810+0000","title":"League of legends es una mente cerrada","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":4,"body":"Saben, no vengo a quejarme ni a llorar por sobre la leche derramada solo quiero dejar un mensaje porque quiza a alguno de ustedes les pase en algun momento.\r\n\r\nbueno el tema es que fu&iacute; suspendido por 2 semanas, no dire mucho el porque a&uacute;n, la cosa es que yo como jugador al momento de ser suspendido ped&iacute; a traves de un mensaje al soporte que me dieran las Razones de porque exactamente me suspendieron y me manden las pruebas de ello, la cosa es que se niegan a decirme las pruebas por las cuales fu&iacute; suspendido.\r\n\r\nLa cosa es que a traves del corto tiempo que he estado jugando lol me he dado cuenta que existe una gran comunidad toxica en LAS, en donde uno les dice algo positivo como &quot;usa este item para que puedas enfrentar mejor al enemigo&quot; y se enojan, te putean, te dicen que te van a reportar y al final de la partida lo hacen y puede que te llegue un aviso de abuso verbal y te hacen prometer que jam&aacute;s lo haras.\r\n\r\nTambien pasa que es todo lo contrario, juegas solo sin hablar con nadie, haces tu &quot;trabajo&quot; protegiendo la linea y pusheando lo mas posible, en pocas palabras haces una buena partida, pero llega el momento en que te equivocas o te mueres por un gankeo del enemigo que a veces supera en numero de enemigos, ejemplo: &quot;mid, jg&quot; gankeando bot, donde claramente es un 4 vs 2 y terminas muriendo porque la torreta ni siquiera puede protejerte en esos casos y al final te terminan diciendo &quot;oro al pe2&quot;, &quot;como llegaste a oro&quot;, &quot;bot de mier...&quot; y tambien terminan reportandote por eso.\r\n\r\nen mi caso paso algo ridiculo, y no creo que haya pasado, la cosa es que me suspendieron porque supuestamente hice &quot;MMR Boost&quot; y es chistoso porque hace poco tiempo atras me toco jugar una partida en donde carri&eacute; a todos porque era el unico oro y me habian emparejado con un plata 5 y 3 bronces, y en el otro equipo habian 2 oros y los otros 3 eran bronces, la cosa es que gane la partida y un tipo me agrego y onda crei que a lo mejor le habia gustado como jugaba y todo eso la cosa es que despues me tocaron partidas desastrozas en donde habian 2 afks o 2 trolls o simplemente tipos que se tiran de cabeza para morir y terminaba perdiendo esas partidas, al final el tipo que me agrego me habl&oacute; despues y me dijo que me hablaba desde las oficinas de &quot;riot&quot; y me iba a reportar por &quot;Eloboost&quot; y me iba a publicar en los foros para que me sancionen permanentemente, no le tome importancia pero aun asi me tome la molestia de reportar este hecho lo cual me respondio riot que ellos no entregaban los mensajes asi y blablabla, la cosa es que segui jugando hasta hace poco donde me encuentro con la sorpresa de que fuy suspendido por &quot;MMR Boost&quot; y como lo dije al principio, pedi explicaciones y no me las dan, divagan en su informacion y me dicen que el &quot;caso esta cerrado&quot;.\r\n\r\nentonces eso, solo quiero decir que &eacute;s poco creible la justicia que impone riot y que al final toca que te venga un troll que te este viendo todas las partidas para crear un informe con tus malas partidas y eso usarlo como prueba en contra tuya para que simplemente te jodan el juego.\r\nlo que molesta, no es que ni siquiera se tomen la molestia de pedirte una explicacion, simplemente hacen las cosas te guste o no y te dan las sanciones segun su criterio lo cual es un criterio infantil de que &quot;si uno o 2 o mas personas te reportan por lo mismo entonces estas frito&quot;\r\n\r\nPD: si quieren puedo mostrar quien fue y cuales son los mensajes que me llegaron despues, ya me da igual porque no jugare mas esta mierda{{summoner:4}} {{champion:18}} {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ZanahoriaAsesina","date":"2015-12-19T16:04:19.007+0000","up_votes":3,"down_votes":0,"body":"Ya habías creado la misma discusión hace unos días así que no entiendo el re-post, pero bueno eso no tiene mucha importancia.\n\nLo importante y lo que me llamo la atención fue tu historial de partidas de clasificatorias y tu historial de partidas normales.\n\nEn clasificatorias usas:{{summoner:14}} {{summoner:4}}  En normales usas:{{summoner:4}} {{summoner:14}} \n\nParece un detalle menor y capaz es cabala tuya pero bueno, es algo que llama la atención ya que los jugadores no suelen cambiar los hechizos de lugar, es una comodidad personal, como ser zurdo o diestro.\n\nSlds.","replies":[{"poster":"Razek Fury","date":"2015-12-19T17:51:04.148+0000","up_votes":1,"down_votes":3,"body":"cuando comence a jugar usaba los hechizos  destello F y lo otro D, en opinion mia me gusta mas usar la F para otros hechizos a diferencia del destello porque juego normales y en normales apenas lo ocupo, pero en rankeds es totalmente distinto porque ahi tienes que jugar a la defensiva no a la ofensiva.\nal menos yo uso asi los hechizos en rankeds y en normales no es nada raro\nla forma de jugar en rankeds es asi en defensivo\ny en normales ofensivo porque juegas con gente posiblemente mas de tu nivel.\n\npara que me entiendas mejor, en rankeds corro el peligro que me toquen desde platinos hasta bronces o incluso diamantes o challengers por los DUO y siempre uso modo defensivo en esos casos aunque me toquen bronces, porque no sabes si esta jugando un tipo challenger esa cuenta (como eloboost) así me enseñaron...\n\npero en normales es totalmente distinto porque estare a la ofensiva porque lo unico que importa ahi es ganar para que te toque gente mas de tu categoria por el MMR cosa que tambien me enseñaron.\n\nPD: si enserio el \"sistema\" de riot me terminó sancionando por esa forma de jugar entonces 1 razon mas para mandarlos a la mierda, sistema automatico inepto.\n\nPD2: no he hecho repost .-. solo respondi los comentarios\nsaludos!\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ZanahoriaAsesina","date":"2015-12-19T19:38:13.844+0000","up_votes":2,"down_votes":0,"body":"Primero, este es el enlace de tu otra discusión \"http://boards.las.leagueoflegends.com/es/c/charlas-generales/wrxI55LG-league-of-legends-es-una-mente-cerrada \" tu discusión anterior estaba en charlas generales y esta en comportamiento del jugador capaz te lo movieron y nada más, pero como dije anteriormente no es lo importante.\n\nSegundo, a lo que me refiero con los hechizos de invocador es que es algo que llama la atención pero es poco probable que te sancionen usando eso como una prueba.\n\nTampoco me voy a poner a debatir si sos culpable o no, no es mi trabajo, simplemente me llamo la atención las diferencias que hay entre tus partidas normales y clasificatorias.\n\nComo la diferencia de súbditos que mataste, los centinelas que colocaste, los hechizos de invocador y los campeones que usaste.\n\nSuerte.","replies":[{"poster":"Razek Fury","date":"2015-12-19T21:34:42.647+0000","up_votes":1,"down_votes":1,"body":"ah si, pobre annie y kayle los tengo botados u.u solo ya no me interesa la linea media y mucho menos jugar con kayle, lo encuentro inutil en cuanto a vayne que es adc y es lo que mas uso ehm... lo reembolse por error x'D!\ntodos los demás ocupo en especial ahora tristana xd\nbueno la ocupaba...\npero entiendo tus preocupaciones y tengo las respuestas para eso, solo que no tendran mucha validez, por eso simplemente pedia un juicio justo de todas formas, gracias por la buena actitud \n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":" Acantha","date":"2015-12-18T15:22:27.411+0000","up_votes":3,"down_votes":1,"body":"No juegues, a nadie le interesa tu vida ni tus historias :p","replies":[{"poster":"Bienzahar","date":"2015-12-18T18:16:23.933+0000","up_votes":1,"down_votes":0,"body":"Comentario infantil, por gente como tu esta el server así.","replies":[{"poster":" Acantha","date":"2015-12-18T21:46:26.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=piter9z,realm=LAS,application-id=PJAKt7ph,discussion-id=u8GokEAU,comment-id=00000001,timestamp=2015-12-18T18:16:23.933+0000)\n>\n> Comentario infantil, por gente como tu esta el server así.\n\n¿Por gente como yo esta el server así?, perdón pero jamas me has visto jugar, ademas, que, acaso flameo o algo?, solo doy mi opinión...si el server esta así bueno, reclamale a Riot Games y no a mi :p\nY vasta con ver tu historial y mejor no hablar :p","replies":[]}]},{"poster":"Razek Fury","date":"2015-12-18T15:24:21.569+0000","up_votes":1,"down_votes":4,"body":"El que quiere lo toma y el que no da igual","replies":[]}]},{"poster":"ikhor","date":"2015-12-18T16:01:00.715+0000","up_votes":2,"down_votes":1,"body":"Acabo de revisar tus partidas anteriores y noté algo...\ntené en cuenta que no deberías hacer dúo con alguien que fue eloboosteado.","replies":[{"poster":"Razek Fury","date":"2015-12-19T15:12:16.612+0000","up_votes":1,"down_votes":1,"body":"quien fue eloboosteado? D:\njugue varias partidas duo D:!","replies":[]}]},{"poster":"ikhor","date":"2015-12-18T15:56:35.838+0000","up_votes":2,"down_votes":1,"body":"No entiendo para que toooodo este texto si vas a terminar diciendo que el juego es una mierda y no vas a jugar más.\nNo es más fácil dejar de jugar y listo?","replies":[{"poster":"Razek Fury","date":"2015-12-19T15:16:09.814+0000","up_votes":1,"down_votes":1,"body":"fue un desahogo, es primera ves que me ocurre esto en un juego...","replies":[]}]},{"poster":"The Inkanus","date":"2015-12-18T15:25:03.133+0000","up_votes":2,"down_votes":1,"body":"Si te banean por MMR Boost no tiene nada que ver con flamers, trolls y AFK, me parece. Es porque vieron incoherencias en tu ascenso/descenso de ligas que dan a entender que otra persona jugó clasificatorias por vos, o vos jugaste por otros.","replies":[]},{"poster":"Friik","date":"2015-12-22T22:24:28.989+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/0xZxV0Zq-solamente-yo-pienso-que-esto-no-va-mas-teamwork-op-mejorando-las {{item:3151}}  TU VOTO CUENTA {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Shappaw","date":"2015-12-18T23:38:34.804+0000","up_votes":1,"down_votes":0,"body":"Leí la frase \"me suspendieron\"... dejé de leer y me fuí a otra cosa.\n\nQué bien se siente saber que el sistema funciona como corresponde.","replies":[{"poster":"Razek Fury","date":"2015-12-19T15:16:53.350+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Ryuushin","date":"2015-12-18T15:58:06.009+0000","up_votes":1,"down_votes":1,"body":"hay varios casos de banneos por falsos eloboost y debido al sistema de emparejamiento adoptado se crea sospecha de eso","replies":[{"poster":"Razek Fury","date":"2015-12-19T15:18:26.956+0000","up_votes":1,"down_votes":1,"body":"si el sistema lo dice entonces pss, me autoeloboostie {{champion:83}}  jajaja","replies":[]}]}]}