{"poster":"RauchWoIke","date":"2015-06-23T18:41:02.619+0000","title":"Garen - E nach Lulu W nicht abgebrochen","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"W&auml;hrend Garen seine E anktiviert hat und von Lulu&acute;s W (Polymorph) getroffen wird bricht diese nicht ab und mach weiter Schaden.","replies":[{"poster":"Balmung","date":"2015-06-23T20:23:08.202+0000","up_votes":1,"down_votes":0,"body":"Garen's E ist kein Channel, ergo wird er auch nicht abgebrochen. Ist viel mehr ein Zustand in welchem sich der Char befindet.","replies":[{"poster":"RauchWoIke","date":"2015-06-23T20:24:42.942+0000","up_votes":1,"down_votes":0,"body":"Ja das mag sein aber das er sich als hase weiter dreht mag ich zu bezweifeln ^^","replies":[{"poster":"Balmung","date":"2015-06-23T20:48:18.994+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=40zfXQqX_Zc\n\nSelbst Siv hat das vor 3 Jahren in nem Video erwähnt ;P","replies":[{"poster":"RauchWoIke","date":"2015-06-23T21:08:46.062+0000","up_votes":1,"down_votes":0,"body":"Ja in den Video sieht man ja wie \"Dumm\" es eigentlich ist das er im Lulu W weiter dreht ^^","replies":[]}]}]}]},{"poster":"PiXeL FuNKY","date":"2015-06-23T19:20:46.117+0000","up_votes":1,"down_votes":0,"body":"Wenn du mit nen Mordekaiser einen sich drehenden garen (e) ultest dann dreht sich der garen auch noch weiter aiuch wenn garen mit aktivierter e gestunnt wird dreht er sich weiter etc defakto kein bug","replies":[{"poster":"RauchWoIke","date":"2015-06-23T19:34:37.761+0000","up_votes":1,"down_votes":0,"body":"Naja wenns nur 3 Sek sein sollen und morde den ultet dreht sich der ja ganzezeit und nicht nur 3 sek soweit ich weiß, ist ja eig. ziemlich unfair wenn man bedenkt das es nur bei Garen ist wenn ich recht weiß.","replies":[{"poster":"PiXeL FuNKY","date":"2015-06-23T20:19:46.531+0000","up_votes":1,"down_votes":0,"body":"du meinst wenn garen seine e macht dann sofort geh wt wird das er sich weiter dreht oder garen macht e kurz bevor sie aufhört wird er ge wt und dreht sich dann noch weiter obwohl die schon vorbei ist?","replies":[{"poster":"RauchWoIke","date":"2015-06-23T20:23:00.918+0000","up_votes":1,"down_votes":0,"body":"kurz nachdem der É angemacht hat die Lulu W unterbricht nicht also dreht er als hase weiter xd","replies":[{"poster":"PiXeL FuNKY","date":"2015-06-23T20:24:39.426+0000","up_votes":1,"down_votes":0,"body":"dann ist das normal weil auch wenn garen e macht gestunnt wird dreht er sich weiter weil seine abklingkzeit noch nicht vorbei ist ist genau das gleiche mit sawin machst du deine ult wirst ge wt und dann bist du ja auch nicht wieder normal sondern immer noch inc der ult","replies":[{"poster":"RauchWoIke","date":"2015-06-23T20:27:40.156+0000","up_votes":1,"down_votes":0,"body":"Ja swain Ult ist ja auch eine Werwandlung der E von Garen würd ich sagen ist ein Normaler Spell","replies":[]}]}]}]}]}]}]}