{"poster":"MisterYasin52","date":"2018-06-19T17:48:30.708+0000","title":"Ehrungsstufen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo alle zusammen.\r\nMein erster Post, so auf den ersten Blick keinen anderen Thread gesehen der mir eine Antwort bieten k&ouml;nnte also bitte /flameoff ;D\r\n&quot;Ehrungsstufe 2.3&quot; also kurz vor der Stufe 3, ist mein aktueller Standpunkt. Seit l&auml;ngerem bin ich dort auch schon.\r\nIch frage mich deswegen so einige Dinge.\r\nBrauche ich eine gewisse Anzahl einer bestimmten Ehrung an der Stelle oder eher eine gewisse Gesamtanzahl and Ehrungen generell.\r\nAls Zielorientierter Spieler interessieren mich solch spezifischen Dinge ganz besonders, weil ich gezielt an Quests und genau solche Systeme rangehe um dementsprechend die Auszeichnungen und Belohnungen zu erlangen.\r\nWei&szlig; &ouml;rgendjemand etwas genaueres dazu ?\r\nVielen Dank im Vorraus und mit allerfreundlichsten Gr&uuml;&szlig;en aus der H&Ouml;LLE;\r\nMister Y.","replies":[{"poster":"Mjölnir Kind","date":"2018-06-20T09:09:46.896+0000","up_votes":1,"down_votes":0,"body":"Bitte beachte, dass das System manchmal Chat-Verläufe markieren kann, in welchen du nicht so ganz freundlich warst. Somit wird dein Fortschritt stark verhindert, obwohl du keine Verwarnungen oder Strafen für diese Chat-Logs kriegen wirst.","replies":[{"poster":"MisterYasin52","date":"2018-07-31T16:14:46.112+0000","up_votes":1,"down_votes":0,"body":"Oh sehr interessant. danke für die info da werde ich mal mehr drauf acht geben dann gehts wahrscheinlich auch schneller vorran.\nsowas zu wissen ist aber mal eine sache für dich.. bezweifle, dass es einfach oberflächlich irgendwo steht.","replies":[]}]},{"poster":"recon","date":"2018-06-19T17:56:15.077+0000","up_votes":1,"down_votes":0,"body":"Alles was zum System bekannt ist, findest du hier im FAQ: https://support.riotgames.com/hc/de/articles/115008474148\nWie viele Ehrungen oder Spiele man für eine Stufe braucht ist nicht bekannt.","replies":[]}]}