{"poster":"WitherTime","date":"2018-12-02T20:09:37.567+0000","title":"League Bewertungssystem","subforum":"Champions & Gameplay","embed":{"description":null,"url":"https://imgur.com/c8S9Ljb","image":"http://imgur.com/c8S9Ljbs.png"},"up_votes":2,"down_votes":2,"body":"Ich wei&szlig; nicht, aber mit solchen Stats h&auml;tte ich nicht gedacht, dass ich nur ein S- bekomme, irgendwie ist dieses ganze System un&uuml;bersichtlich... Gibt es da irgendwas offizielles, an dem man sich richten kann?","replies":[{"poster":"Allerbester Biss","date":"2018-12-02T20:34:14.381+0000","up_votes":6,"down_votes":0,"body":"0 Wards \n0 Farm","replies":[]},{"poster":"Sirrkas","date":"2018-12-02T20:54:59.991+0000","up_votes":4,"down_votes":0,"body":"Es geht halt nicht nur nach KDA. Alle deine Stats werden berücksichtigt. Auch zerstörte Wards, Schaden, Turmschaden etc.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-12-02T21:16:13.982+0000","up_votes":3,"down_votes":0,"body":"> Gibt es da irgendwas offizielles, an dem man sich richten kann?\n\nJa. Das Stat-Register in deinem Profil. (Sind 13 oder 14 Bewertungskriterien)","replies":[]},{"poster":"Pure Cynicism","date":"2018-12-02T21:30:31.215+0000","up_votes":2,"down_votes":0,"body":"6,1 CS pro Minute ist nun mal nicht gut, sondern Durchschnitt. Außerdem war dein Schaden relativ zu deinem Gold gesehen auch nicht hoch. Die Lux hatte mehr Schaden bei rund 4k weniger Gold.","replies":[{"poster":"Alustus","date":"2018-12-02T23:36:31.059+0000","up_votes":1,"down_votes":3,"body":"Naja ist aber normal bei ADC.\nDie kommen erst etwas später auf ihre dmg Werte, wesshalb sie momentan im Solo Normal/Ranked nicht so stark sind. (spiele sehr kurz)","replies":[{"poster":"SuicidePlank","date":"2018-12-03T07:24:40.158+0000","up_votes":2,"down_votes":0,"body":"Kurze Frage, kennst du Draven, Jhin oder Ezreal?","replies":[{"poster":"Alustus","date":"2018-12-03T12:22:57.400+0000","up_votes":1,"down_votes":1,"body":"Er hat Tristana gespielt.\nUnd ja ich hätte sagen sollen Hypercarries.","replies":[{"poster":"SuicidePlank","date":"2018-12-03T12:31:41.990+0000","up_votes":1,"down_votes":0,"body":"Tristana macht auch schon ziemlich bösen Schaden im early und mid Game.","replies":[{"poster":"Alustus","date":"2018-12-03T12:49:00.137+0000","up_votes":1,"down_votes":0,"body":"Im vergleich zu einem APC Midlane aber nicht.\nEs ist jetzt nicht ungewöhnlich das eine gefeedete Lux in einem 20 Minuten game mehr Schaden macht als eine gefeedete Tristana.\n\nMir geht es hier nicht darum zu sagen ADC sind scheiße und machen keinen Schaden, sondern einfach nur das es für mich normal ist das zu diesem Zeitpunkt normal ist das eine Lux, ein besseres Gold/Dmg value hat.\n\nIch habe mit Brand Support auch meistens am meisten dmg vom Team obwohl ich viel weniger Gold habe, das ist jetzt für mich kein Grund dafür zu sagen das der ADC kein S verdient hat.\n(Also rein auf den dmg bezogen)\n\nEdit:\nZumal die gegner {{item:3191}} gekauft haben aber keine MR.","replies":[{"poster":"SuicidePlank","date":"2018-12-03T12:57:33.080+0000","up_votes":1,"down_votes":0,"body":"Ja, wenn die Lux etwa die selbe Summe an Kills hätte. Aber sie hatte sieben(!!) weniger.\n\nWenn du als 14/1 Tristana weniger Schaden machst als die 7/2 Lux, ist das bad, das hat nichts mit höherer Gold/DMG Value zutuen, da Tristana ungefähr 2100 Gold mehr hat als sie.\n\nAch, du machst mit einem Damage Supporter der %HP Schaden macht viel Schaden, auch ohne Gold weil du Base DMG hast?","replies":[]}]}]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2018-12-03T02:12:01.179+0000","up_votes":3,"down_votes":1,"body":"Du fragst dich ja, warum das \"nur\" nen S- ist. Also nicht Summa cum laude. Absolut überragend.\n\nIch frage mich ja da sofort, wie der Jihn, der wesentlich mehr Zeit in der Basis verbracht hat als du, mehr Minions gefarmt hat als du. In einem von dir perfekten Spiel sollte dies für ihn unmöglich sein...","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2018-12-03T14:15:25.538+0000","up_votes":1,"down_votes":0,"body":"14k dmg, und schlechten farm = warum sollte das ein S sein? der Yi hatte 11k dmg mehr. Gute stats alleine reichen nicht, dann kann ja jeder nur lasthitten und safe spielen\n\n+ 12k gold zeigt auch das du wahrscheinlich 2 leute einfach nur abgefarmt hast und nicht das ganze gegnerteam","replies":[]}]}