{"poster":"Macskakaja","date":"2016-06-09T08:48:41.661+0000","title":"SkinPreview legális-e ?","up_votes":2,"down_votes":0,"body":"Hát ez egy olyas fajta program amivel lehet custom skineket be rakni,hudokat és töltőképernyőket . Ez mind szép és oké de van egy affajta \"sötét\" oldala ennek az egésznek mert a riot eredeti skinjeit is be lehet pakolni pl:Programm{{champion:127}} . Mivel a felhasználómat nem akarom kockára tenni emiatt ezért inkább fórumon kérnék segítséget .Egyébként ezen a linken meg lehet tekinteni mi is ez a SkinPreview:https://www.youtube.com/watch?v=iq94w2bR8PQ","replies":[{"poster":"Politely Pink","date":"2016-06-09T09:46:14.368+0000","title":null,"up_votes":3,"down_votes":0,"body":"Ha valaki a skin modeljét akarja megtekinteni, akkor ott van a Lolking 3D model viewer-je. ott forgathatod is a karaktert, zoomolhatsz is rá, tehát ott is meg tudod nézni, hogy játékban hogyan nézne ki felülnézetből. Az legális.","replies":[]},{"poster":"Temp65432","date":"2016-06-09T11:45:14.136+0000","title":null,"up_votes":2,"down_votes":0,"body":"nézd meg [EZT](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/3A99YwaE-a-harmadik-faoltl-szaarmaza-programokat-illeten-mi-engedaolyezett-aos-mi-nem), hátha segít a tisztánlátásban ^^ Ha a forrást nézed, ott kicsit részletezik is, hogy a textúrát kicserélő programok engedélyezettek, így elméletileg nem lenne szabad, hogy probléma legyen belőle (az MKJOGO-t nem a skinek miatt nem engedik a cikk szerint...mármint az eredeti forrást nézve)","replies":[{"poster":"M4dr4c","date":"2016-06-09T11:56:18.606+0000","title":null,"up_votes":1,"down_votes":1,"body":"Viszont, ha be lehet tenni a tényleges LOL skineket is, akkor teljesen már kategória lesz az egész, mert az jogvédett tartalom illetéktelen használata.","replies":[]}]},{"poster":"Muffinpantsu","date":"2016-06-09T09:50:01.756+0000","title":null,"up_votes":2,"down_votes":0,"body":">  A külső féltől származó programokkal mindig nagyon óvatosan kell eljárni. Kifejezetten bátorítjuk a szabályzatot nem sértő külső programok fejlesztőit. Nem vagy teljesen biztos a dologban? Akkor ne kockáztass. Nem éri meg kockáztatni a fiókodat.\n\nEzt [innen](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/ZE7diPc1-felfaggesztaosek-az-mkjogomklol-kapcsaan) vettem és igazából szerintem bőven lefedi a kérdésed. \nNeked kell eldöntened, hogy számodra mennyit ér a fiókod, én biztosan nem próbálnám ki. :)","replies":[]},{"poster":"Teemo Jenkins","date":"2016-06-09T17:02:22.493+0000","title":null,"up_votes":1,"down_votes":1,"body":"1, Az MK jogo -t nem a skinek miatt tilos használni, Arwyll el is magyarázta régebben egy streamjén, hogy azzal alapvetően nincs probléma, hogy beállítasz egy olyan skint amit csak te látsz, az mk jogo -val az a probléma, hogy másra is képes.\n2, A Riotnak se az a célja, hogy mindenkit kibannoljon, nincsenek olyan embereik akik annál több fizetést kapnak minél több embert bannolnak ki, csak akkor szoktak kitiltani, ha olyan dolgot csinálsz amit már többször is elmondtak, hogy tilos.\n3, Ettől függetlenül természetesen még nem biztos, hogy nem fognak kitiltani, de a legegyszerűbb módja annak kiderítésére, hogy használhatod-e a programot az, ha megkérdezed a Supporttól. (Ha megteszed ki is rakhatnád ide a választ, hogy mindenki lássa)\n\nAhogy már mások is írták, nyilvánvalóan nem érdemes kockáztatni, csak akkor használj harmadik féltől származó programokat, ha biztos vagy benne, hogy a Riot engedélyezi.","replies":[]},{"poster":"Mind The Gap","date":"2016-06-09T16:38:46.145+0000","title":null,"up_votes":1,"down_votes":1,"body":"Mivel eredeti modelleket/textúrákat is használ, ezért igen, tilos és végleges tiltással büntetendő.","replies":[]},{"poster":"M4dr4c","date":"2016-06-09T08:53:27.833+0000","title":null,"up_votes":1,"down_votes":1,"body":"Szerintem tilos. Ha MKLOL az, akkor ez is.","replies":[]}]}