{"poster":"Buff Morgana","date":"2016-11-18T22:18:30.315+0000","title":"Come giocare toplane?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Inziando a Giocare Yasuo top per le prime volte mi sono ritrovato a giocare contro un teemo che andava solamente di poke fastidiosissimi tanto da schiacciarmi alla mia torre... idem (sicuramente per&ograve; pi&ugrave; gestibile) con gnar\r\nLa mia domanda &egrave; come faccio a farmare evitando i poke? Non ce la faccio\r\n(Questa domanda non vale solo per Yasuo, ma anche per Nasus/Garen che vorrei giocare ma evito per questo motivo)","replies":[{"poster":"Térence Fill","date":"2016-11-22T16:48:02.792+0000","up_votes":2,"down_votes":0,"body":"Prima di tutto impara a giocare la Top Lane con un vero Top Laner, e smetti di pickare Yasuo solo perchè ha un set di abilità broken come la morte (e non sto parlando di difficoltà, ma di SET DI ABILITA') e pur essendo ottimale in Mid lane può andare a giocare qualsiasi ruolo egli voglia.\n\nQuando avrai imparato questa parte, passeremo alla prossima.\n\n#PiuttostOlaf","replies":[]},{"poster":"uFere","date":"2016-11-19T13:31:54.450+0000","up_votes":1,"down_votes":0,"body":"Il buon teemo è forte solo perché è ranged, si può dire che counteri tutti i champ che abusano di aa, controlla sempre la sua build, vedi se sceglie di andare ap o di as, in base a quello che builda, builda molta resistenza, se giochi {{champion:80}} puoi pokkarlo a morte e finirlo con una combo WEQ, {{champion:14}} Validissimo counter di teemo, la sua E slowa e hai tutto il tempo di caricarti una Q se lo slowi prima, se proprio vuoi infierire, caricati anche la ulti e sbattiti contro teemo, mi raccomando di attivare prima la w e poi di ultare, te lo dico da giocatore medio/esperto di sion ;) \nCon sion potresti prima attivare lo scudo con w, slowarlo (anche se lo pokki con un minion dato che la sua E funziona anche sui minion), caricare la Q e osservare il cancro con la cerbottana scoppiare\nIn sintesi:\nW,E,Q,W\nSe hai la ulti: W,R,E,Q,W e scrivi un chat Rekt Teemo per fargli capire chi comanda hahaha","replies":[]},{"poster":"Dreggarr","date":"2016-11-18T22:31:18.869+0000","up_votes":1,"down_votes":0,"body":"Incuriosito visto che succedeva la stessa cosa a me ho iniziato a giocare teemo. Teemo a mio parere può counterare la maggior parte dei top però il tutto sta nelle capacità del giocatore... io con teemo ho vinto lane contro dei garen senza mai subire una kill in 1v1 altre volte invece sono stato umiliato da un darius (proprio questa sera son stato asfaltato da un darius con 100game in ranked con darius) quindi si teemo punta molto sui poke, quindi se tu hai un champ melee devi sapere che 1- non puoi farmare tutti i cs perchè se ti avvicini ti becchi danni gratis 2- se ti spinge sotto torre impara a farmare sotto torre con quel champ (un teemo da solo non va mai in dive) 3- Se ad esempio stai giocando un garen non andare di black cleaver come primo item ma punta alla resistenza magica cosi da resistere meglio ai poke e poter farmare meglio e chiedere aiuto al jungler... ricorda che un teemo non ha escape (tranne le trappole di funghi che son veramente una figata hahaha che mentre rallentano può tentare di scappare) e un'altra cosa... ricorda che un garen con 3 item a mio parere in team fight è 100 volte piu utile di un teemo con 4 item perchè uno può tankare per il team l'altro invece se gli va bene butta qualche fungo e qualche freccia (sempre se non va a shottare l'adc di turno, e si... può farlo)","replies":[{"poster":"Buff Morgana","date":"2016-11-19T10:09:45.138+0000","up_votes":1,"down_votes":0,"body":"Quindi diciamo che non si può fare niente? Perché onestamente lo gioco anche io teemo e farmi molto ma molto easy rispetto a yas che è sempre essendo melee se le prende da un champ invece che mira solo ad autoattack... insomma bisogna saperlo usare alla fine penso no?\nGrazie comunque","replies":[{"poster":"Dreggarr","date":"2016-11-19T12:19:29.978+0000","up_votes":1,"down_votes":0,"body":"Beh yasuo è molto complicato come champ... non ascoltare chi ti dice che è un champ nabbo e troppo op perchè significa che non lo hanno mai usato. Yasuo ha delle meccaniche molto complicate a mio parere (si lo sto provando anche io ultimanente) e non è per niente facile da usare figurati contro un teemo che è un champ che countera la maggior parte dei champ da top. Quindi io ti consiglio fatti qualche game con teemo e vedi quando sei piu vulnerabile e quando NON puoi andare all in etc e quando te lo troverai contro saprai cosa vuole fare visto che l'hai usato pure te e magari invece di andare 0-10 vai 0-3 ma è sempre un buon risultato :) Poi ricorda che i jungler se possono evitano di gankare un teemo dopo il livello 6 perchè le sue trappole sono molto rognose sopratutto perchè spesso si mettono nel corridoio vicino alla torre e del river da dove arrivano le gank molto spesso...","replies":[]}]}]},{"poster":"The Fluffy Lamb","date":"2016-11-19T11:02:08.758+0000","up_votes":1,"down_votes":0,"body":"Io uso gnar molte volte e si, asfalto champ come garen.\n Basta toglierli 50%hp e poi tasformarsi.addio garen, Atrox a volte, Lux(non mi chiedete il perche era in top in solo XD), qualche volta sono riuscito pure con darius ma è gia piu difficile. \n\nConta anche che la passiva di gnar, dopo tre hit, toglie danno bonus a seconda della vita massima del target. \n\nTeemo basta gankarlo. Sarà forte in ranged, ma quando sei vicino a lui (Ahri) è carne da macello o meglio :sorcio da macello. \n\nGnar invece, se ha il flash è praticamente ingankabile se non si è veramente bravi. Almeno, io sono uscito con 3/4 di vita dai gank da talon, kata e (di grosso kulo) kha zix. ","replies":[]},{"poster":"ILoveTiramisu","date":"2016-11-19T08:54:57.104+0000","up_votes":1,"down_votes":0,"body":"Teemo è uno dei piu frustanti match-up in toplane. Quello che dovresti avere per riuscire a giocarci contro è una abilità da poke per lasthittare da lontano, come la E di Aatrox o quella di Sion. Partire di {{item:1054}}  può aiutarti a sopravvivere nei primi livelli, ma comporta meno AD per lasthittare, tienilo presente. Devi usare molto i brush nei primi livelli e ricordati che quando ti attacca i tuoi minion intervengono a difenderti. I primi item che buildi saranno difensivi, quindi meglio se stai usando un juggernaut (non garen, viene counterato da tutti i ranged) perche scalano bene di danno anche buildando un primo item salute.","replies":[{"poster":"Buff Morgana","date":"2016-11-19T10:10:11.080+0000","up_votes":1,"down_votes":0,"body":"Ho capito... grazie mille per la riposta comunque","replies":[]}]}]}