{"poster":"Bugima","date":"2016-08-22T06:19:28.457+0000","title":"Que hago en esta situación??","subforum":"Charlas Generales","up_votes":12,"down_votes":2,"body":"Estoy en una crisis gente necesito ayuda porfavor con esta preguntas y si alguien m&aacute;s le pasa: \nNunca sentiste que este no es tu mundo??\nComo si naciste en lugar o tiempo equivocado??\nNo ser&iacute;a mejor si se diera la posibilidad poder ir a otro comienzo??\nY si nunca llegase a pasar edto??\nTener la necesidad de escapar de esta realidad pero algo los mantiene atados a este mundo??\nSi es como la religio dice que el alma reencarna de forma cíclica porque mi alma siempre esta ubicada en los tiempos en la cual mi alma no halla lo que realmente busca??\nCuando mi alma reencarna no recordas nada de tu vida pasada  entonces de que te sirve vivir en un mundo donde sos alguien fugaz y no se reconoce tu existencia?\n\nPor último, como afrontó esto??\n\nSiento que necesito desahogarme y vengo a escribirlo aca ya que la comunidad siempre estuvo presente en varias cosas de mi vida y siempre ayude a quien pude pero hoy necesito yo. Como dice el dicho &quot;hoy por ti y ma&ntilde;ana por mi&quot;","replies":[{"poster":"Yellow Sphere","date":"2016-08-22T06:46:11.487+0000","up_votes":12,"down_votes":0,"body":"A ver, vamos por partes.\n\n* _Nunca sentiste que este no es tu mundo??_\n\nUna sola vez, de hecho la gente a mi alrededor es tan diferente a mí que pensé \"¿qué demonios hago acá?\".\n\n* _Como si naciste en lugar o tiempo equivocado??_\n\nNo sé lo tuyo, pero lo mío no era cuestión de espacio-tiempo. Me agrada haber nacido en el '90, ya que durante mi niñez pude disfrutar de todas esas cosas que ahora serían consideradas como \"retro\". Videojuegos, música, salir a la calle a jugar con los chicos y chicas del barrio hasta que nuestras madres nos llamaban a cenar de un grito... Para mí, esos recuerdos no tienen precio. Claro, los tiempos cambian, y de manera radical especialmente en esta época. Pero eso no quita, ultimadamente, que el pasado haya sido algo lindo en donde no había la tecnología que tenemos hoy en día, y aun así éramos felices.\n\n* _No sería mejor si se diera la posibilidad poder ir a otro comienzo??_\n\nHonestamente, si me dieran a elegir rehacer mi vida y nacer en la época en la que quisiese, me quedaría otra vez con el año 1990. Sin embargo, sí admito que sería cool tener los recuerdos de ahora y, cada vez que llega el momento de tomar una decisión drástica, recordar qué había pasado y \"tomar otro camino\", solo para ver hacia dónde lleva ese camino. No sé si se entendió, pero el concepto básico sería \"esta decisión ya la tomé en el pasado y ocurrió tal cosa, esta vez elegiré otra opción a ver qué pasa\".\n\n* _Y si nunca llegase a pasar esto??_\n\nEso ya es más difícil de responder. Personalmente prefiero no pensar en ello, y dejar que la vida siga su curso. Si hay algo que no me agrade de ella, simplemente trato de \"torcer\" ese curso lo más que pueda para que se adapte a mis comodidades cotidianas. Obviamente la mayoría de las veces no funciona, pero por lo menos te sentís una persona más \"fuerte\" por el simple hecho de que intentaste \"torcer el destino\".\n\n* _Tener la necesidad de escapar de esta realidad pero algo los mantiene atados a este mundo??_\n\nSolo cuando era adolescente. Cuando cumplí los 18 simplemente me dije \"ñe, ya me cansé de esto. Que la vida haga lo que quiera\". Supongo que dejar atrás esos caprichos y cuestiones eran un signo de que había madurado, por lo menos un poquito. En ese entonces tomé una decisión: solo voy a dejarme llevar hacia donde la vida quiera. Y en cuanto haya algo que no me guste, voy a intentar cambiarlo. No digo que fue la decisión más sabia del universo ni que ahora mismo sea una persona \"exitosa\", pero no me va tan mal como imaginaba hace unos años. ¿Soy una persona atada a este mundo? Diría que sí. Pero no me preocupa. Después de todo tengo a mi familia, tengo a mis amigos, tengo mis cosas, tengo a mis mascotas... Y ellos también están atados a este mundo.\n\nEspero haber ayudado aunque sea un poco.","replies":[{"poster":"LastHope17","date":"2016-08-22T08:27:54.706+0000","up_votes":2,"down_votes":0,"body":"Parecen cosas que dirian en una pelicula, entre el capitulo de Re:Zero que acabo de ver, y esto, lloré :'v {{item:3070}}","replies":[{"poster":"GonarD","date":"2016-08-23T00:15:07.900+0000","up_votes":1,"down_votes":0,"body":"jjajajajaa al fin le salio una a subaru :v","replies":[]}]},{"poster":"lÐEAÐ AÐ ŠHłNÿl ","date":"2016-08-22T07:35:07.868+0000","up_votes":2,"down_votes":0,"body":"gracias por ayudarme a mi tambien quede con la misma duda XD","replies":[]}]},{"poster":"deyzttEN","date":"2016-08-22T10:13:52.489+0000","up_votes":9,"down_votes":0,"body":"Tenes que salir a la calle y darte cuenta que sos nada. Un abrazo.","replies":[]},{"poster":"Bugima","date":"2016-08-22T14:45:50.999+0000","up_votes":3,"down_votes":0,"body":"Gracias a todos pero no es algo emocional o sea de echo me llevo bien con mi familia. El tema radica en el vacío que siento y que sólo siento que se soluciona viendo el cielo ya que cambia de un momento al otro. Trabajó y estudió pero me siento realmente vivo en los juegos online y viendo animes o películas ya que es otro mundo, es como entrar en la imaginación del otro y cuando lo ves y te gusta es como vivirlo de cierta forma.\n\n\nIgual me ayudaron banda con muchas dudas gracias","replies":[{"poster":"wazaco","date":"2016-08-22T16:33:52.195+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nixver,realm=LAS,application-id=v7qsfXsE,discussion-id=5BG8McsA,comment-id=0008,timestamp=2016-08-22T14:45:50.999+0000)\n\nEmpeza a bailar, o busca otra cosa para hacer, En fin, yo hago mas o menos lo mismo, no trabajo, pero si estudio y nada videojuegos y anime, sin embargo, uno tiende a drenar sus esfuerzos y emociones hacia eso que más hace, eso que le interesa y es ahi donde se va toda la energia y de donde pretende sacar alegrias. Pienso que solo jugar y ver animes es algo medio vago, no por que este mal, sino por que no te hace crecer, en cambio por ej, si haces dibujos de esos videojuegos o escribis sobre historias y te ayudas sobre animes que viste, la cosa cambia, te llena un poco mas. Te hacen avanzar hacia no sabes donde, te dan herramientas a futuro, y quien sabe quiza en algun momento te sirvan para hacerte mas feliz.\n\nNo se si me explico, la idea en si es: \n\nLo que uno haga, o empiece, termina por llevarse los esfuerzos de esa persona. Y depende de lo que sea te estanca o te hace crecer, o por lo menos algunas tienen un camino muchisimo mas largo que otra, inclusive... hay algunos caminos que nunca terminan.\n\nEj: yo jamas entre al foro... una vuelta hace 2 meses, subi una idea de campeon... y me re colgue... ahora no dejo de abrirlo y participo y etc's... es decir, intento esforzarme por esto, y dreno gran cantidad de tiempo poniendome al dia, o comentar cosas como esta :v ajaja, o fantasiar que esto de alguna manera puede cambiar el juego...\n\nSin embargo, todo ese tiempo lo estoy invirtiendo en algo quiza no tan importante, y deberia dejarlo, a por otras que me llenen mas como persona.\n\nEj Bailar, me encanta bailar (bailo tango), conoces banda de personas(quiza no sean tus amigos, pero si compañeros), y tenes experiencias charlas y formas de evolucionar dando mas sensaciones y vueltas a la vida.\n\nPienso de por que miramos tanto anime (incluyendome a mi tambien) es por que nos encantaria vivir algo asi, no se... es como decir que se valla todo a la mierda, como me gustaria que un sabado a las 2 de la mañana se me ocurra salir a pasear solo por el medio de la nada y que algo magico me lleve a algo que no pueda evitar.\n\nExitos, ojala te sirva. :)","replies":[]}]},{"poster":"Hachi","date":"2016-08-22T13:46:12.265+0000","up_votes":6,"down_votes":3,"body":"Que post más ridículo, bórrelo","replies":[]},{"poster":"Yoen","date":"2016-08-22T07:59:40.113+0000","up_votes":2,"down_votes":0,"body":"Creo que tienes una inquietud emocional, Tal vez disociativo.\npuede que me equivoque\no lo otro es una inconformidad en tu vida,\nque implica a que te cuestiones a ti mismo\na causa de lo mencionado.\n\nlo que explique lo resumí de esa forma xd\nno me quería alargar en el tema\n\nBuena suerte, desde luego","replies":[]},{"poster":"GonarD","date":"2016-08-23T00:22:10.173+0000","up_votes":1,"down_votes":0,"body":"la respuesta a todo esto, es ¿que pensas vos?\nse sincero con vos mismo y encontra vos solo las respuestas.\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Seven Teemo Army","date":"2016-08-22T17:18:06.939+0000","up_votes":1,"down_votes":0,"body":"Cuando tenia unos 13 años pase por lo mismo hasta que hice amigos :v","replies":[]},{"poster":"Bugima","date":"2016-08-22T15:00:41.798+0000","up_votes":1,"down_votes":0,"body":"Muchos dicen es un juego o es una serie pero nada más. Para otros es su trabajo o su vida o su forma de existir o su salida de la realidad. Es más que lo que la mayoria piensan","replies":[]},{"poster":"Mazer Rakham","date":"2016-08-22T13:46:17.593+0000","up_votes":1,"down_votes":0,"body":"Mira, tu vida es algo único e irrepetible. Tal vez ahora no te des cuenta porque estes pasando por un momento sensible en lo emocional, pero cuando seas más grande y mires atrás te darás cuenta de lo importante que fue cada momento, cada persona, cada obstáculo. Todo en la vida es causal, no casual. Por ejemplo, puede pasarte que gracias a una buena persona que esté siempre a tu lado conozco a una mala persona que te haga mucho daño, pero gracias a esa mala persona puede que conozcas a alguien realmente importante para vos. Entonces, si no hubieras conocido a esta persona que te hizo daño, quiza nunca hubieras conocido a alguien que sea realmente importante para vos. Piensa que todo es causa y efecto. Y que de todo lo malo siempre se saca algo bueno. Recuerda, no hay luz sin oscuridad y la oscuridad no existirÍa sin la luz.\n\nEspero haber sido de ayuda.\n\nUn abrazo!","replies":[]},{"poster":" Bad Moon Rising","date":"2016-08-22T12:42:53.877+0000","up_votes":1,"down_votes":0,"body":"~~Como pegan las flores vieja¡¡¡¡¡¡ ah flores.~~\n\nAveces me pasa lo que dices pero no le doy mucha importancia puede ser que tengas alguna inquietud en la vida,espero te pongas bien.","replies":[]},{"poster":"Summer Nights","date":"2016-08-22T12:25:29.765+0000","up_votes":1,"down_votes":0,"body":"Es algo común que la mayoría de los adolescentes piensan y pasan siempre, hay 2 posibilidades, simplemente te vas a dejar de sentir así y aceptar la rutina como normal y continuar como siempre, o vas a buscar una solución extremista que cambie un poco los hechos actuales. No obstante es algo perfectamente normal y común","replies":[]},{"poster":"D Godyr Gates","date":"2016-08-22T12:18:34.002+0000","up_votes":1,"down_votes":1,"body":"Yo personalmente busque refugio en Muchos libros de Filosofía y Budismo.\n\nTe enseñan a quererte a vos y entender como tu mente retorcida puede entrar en este mundo sin sentido.\n\nMe parece bien el desahogarte. Lamentablemente a veces no hay que pensar demasiado las cosas. \n\nQue pasaría si todos estarían pendientes de cosas mas profundas que el trabajo diario? Y si todos los días toda la gente se preguntara \"por que existimos\"?\nNadie podría seguir el ritmo de vida.\n\nLamentablemente aunque hayas querido nacer en la edad de piedra, estas acá. Estas vivo y tenes herramientas para cambiar lo malo de tu vida. Yo no se que estará pasando en tu vida para que te haga sentir esto, la verdad es muy profundo e inquietante lo que planteas.\n\nYo creo que necesitarias explicarnos con mas detalle si queres ayuda mas especifica. Se que es dificil confiar para escribir eso aca, pero creo que vendria bien.\n\nEs muy dificil ayudarte en cuanto a temas espirituales y de posición espacio/tiempo. Son temas que afectan y chocan según tu estabilidad mental y emocional.\n\nLo que tengo para decirte es: No te rindas. Cambia lo malo, genera una armonia. Vos sos griton, tu gente cercana no le gusta y te critica? GRITA MAS! Como te van a cambiar tu forma de ser?! Tu ser es lo que sos.\n\nSiempre con calma y hacia adelante. Sos Joven, todo tiene arreglo.\n\nMuchos dicen que todo tiene arreglo salvo la Muerte. La muerte ni siquiera necesita arreglo, es otro paso, otra transformación.","replies":[]}]}