{"poster":"Bugima","date":"2018-11-14T12:51:51.823+0000","title":"Ser main support en cada partida...","subforum":"Charlas Generales","up_votes":33,"down_votes":6,"body":"El problema que se ve a simple vista es que siempre hagas lo que hagas el rol de support esta menospreciado.\r\n\r\nVos podes haber fedeado a todo su team o salvado a todo el mundo pero siempre los creditos se los lleva el mid o el adc feed. No digo que este mal reconocer a los que juegan bien pero la mayoria de las veces nadie nota el trabajo de los supports.\r\n\r\nComo cuando la gente dice que supp es de carreados cuando perfectamente un support te puede carrear una partida con blit o bardo o rakan o hasta una janna\r\n\r\nTambien noto que esto es parte del juego pero siempre los support se quedan atras de nivel con respecto a todos pero eso es porque van 2 bot pero se queda muy atras en late como 2 niveles abajo\r\n\r\nTambien me molesta que cuando voy bot con janna tengo que bancarme comentarios machistas como anda a la cocina o cosas asi que me chupan un huevo porque soy hombre pero a las minas les debe tiltear. Las mandan a cocinar o les bardean por ser minas y eso conduce a demasiada toxicidad innecesaria\r\n\r\nAdemas de lo anterior tenes que lidiar con cada adc que es especial y no me refiero al nivel de juego sino a la actitud de que se muere 2vs1 cuando rotas y te culpa a vos o que no tiraste bien un hechizo y ya esta flameandote o capas te llevas un minion sin querer y te spamea se&ntilde;ales tanto que no queda otra que mutear\r\n\r\nNo se si alguien coincide conmigo o nota eso en las partidas","replies":[{"poster":"REXPAT","date":"2018-11-14T12:58:54.277+0000","up_votes":34,"down_votes":2,"body":"Los verdaderos Main support estan hechos para ayudar al adc y al team. Un buen support no busca reconocimiento ni aliento por parte de los demas. El support que realmente es dedicado con su rol se preocupa de hacer todo lo posible por sacar ventaja para su team.\n\nPor ultimo, el buen supp no le importa que lo flameen, trolleen, insulten o cualquier otra cosa. Los supp de calidad sabemos que es tan facil como mute y report. \n\n{{sticker:sg-ezreal}}","replies":[{"poster":"Annakiya","date":"2018-11-14T17:25:16.432+0000","up_votes":5,"down_votes":1,"body":"Mmm no tiene nada que ver ser buen soporte con dejarse flamear. Yo los muteo y report al final {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Sêrena","date":"2018-11-14T15:21:04.938+0000","up_votes":4,"down_votes":8,"body":"No tiene nada que ver ser buen supp con dejar que te flameen flaco, explícame qué tiene que ver. Ir mid jg top o lo que sea no tenés porque bancarte que te insulten, sos una persona como todos los demás, no hay porque bancarse el insulto del otro por ser supp","replies":[{"poster":"REXPAT","date":"2018-11-14T15:27:38.736+0000","up_votes":2,"down_votes":2,"body":"OMG Es enserio? No puedo creer que las palabras le afecten tanto a algunas personas. Ahora entiendo ese dicho: Las palabras duelen más que los golpes.\n\n{{sticker:sg-janna}}","replies":[{"poster":"Treant del DOTA","date":"2018-11-15T17:25:48.958+0000","up_votes":1,"down_votes":0,"body":"+1 Rexpat sos mi ídolo.","replies":[{"poster":"REXPAT","date":"2018-11-15T17:27:53.858+0000","up_votes":2,"down_votes":0,"body":"Eres un amors..\n{{sticker:sg-jinx}}","replies":[]}]}]},{"poster":"tigre05","date":"2018-11-14T15:27:45.259+0000","up_votes":6,"down_votes":2,"body":"un buen suport le importa un pepino si escriben solo usa el chat para timear sums","replies":[]}]},{"poster":"Sr Joe","date":"2018-11-14T20:45:10.456+0000","up_votes":3,"down_votes":1,"body":"En cierto punto concuerdo con el amigo Rexpat. Yo como support simplemente voy, hago bien mi trabajo, me siento satisfecho por mi desempeño o me preocupo de lo que tengo que mejorar y nada mas.\nSi alguien quiere reconocer mi trabajo, bien. Si alguien no quiere reconocer mi trabajo, da igual, yo lo sigo haciendo y no busco que me digan una felicitación por cada buen inicio o cada zona que tenga wardeada o por la ventaja que le hice a mi team, después de todo solo estoy haciendo lo que me corresponde.\nLo mismo si soy el top o el mid, hago mi trabajo y con hacer bien mi trabajo me doy por pagado dandome igual que me feliciten o no.\nSi te flamean o insultan, para eso tienes el boton de muteo y los reportes a final de partida. No es algo que solo los \"main supp\" saben, es algo que todo el mundo sabe o debería saber.","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:43:47.051+0000","up_votes":2,"down_votes":0,"body":"+1","replies":[]},{"poster":"Treant del DOTA","date":"2018-11-15T17:18:08.077+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]},{"poster":"tacito92","date":"2018-11-14T17:08:42.852+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=REXPAT,realm=LAS,application-id=v7qsfXsE,discussion-id=znbYrrvw,comment-id=0000,timestamp=2018-11-14T12:58:54.277+0000)\n>\n> Los verdaderos Main support estan hechos para ayudar al adc y al team. Un buen support no busca reconocimiento ni aliento por parte de los demas. El support que realmente es dedicado con su rol se preocupa de hacer todo lo posible por sacar ventaja para su team.\n> \n> Por ultimo, el buen supp no le importa que lo flameen, trolleen, insulten o cualquier otra cosa. Los supp de calidad sabemos que es tan facil como mute y report. \n> \n> {{sticker:sg-ezreal}}\n\nNos mesclamos entre las sombras para suportear lo incarreable(?) asadas estoy jodiendo xD\n{{champion:40}}","replies":[]},{"poster":"Bugima","date":"2018-11-14T13:00:47.436+0000","up_votes":6,"down_votes":4,"body":"> [{quoted}](name=REXPAT,realm=LAS,application-id=v7qsfXsE,discussion-id=znbYrrvw,comment-id=0000,timestamp=2018-11-14T12:58:54.277+0000)\n>\n> Los verdaderos Main support estan hechos para ayudar al adc y al team. Un buen support no busca reconocimiento ni aliento por parte de los demas. El support que realmente es dedicado con su rol se preocupa de hacer todo lo posible por sacar ventaja para su team.\n> \n> Por ultimo, el buen supp no le importa que lo flameen, trolleen, insulten o cualquier otra cosa. Los supp de calidad sabemos que es tan facil como mute y report. \n> \n> {{sticker:sg-ezreal}}\n\nYo no busco reconocimiento man nisiquiera que digan el rol es mejor o el mas dificil solo que se tome conciencia que es algo mas que \"linea de carreados\"","replies":[]},{"poster":"Diamond Instinct","date":"2018-11-14T14:11:48.625+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=REXPAT,realm=LAS,application-id=v7qsfXsE,discussion-id=znbYrrvw,comment-id=0000,timestamp=2018-11-14T12:58:54.277+0000)\n>\n> Los verdaderos Main support estan hechos para ayudar al adc y al team. Un buen support no busca reconocimiento ni aliento por parte de los demas. El support que realmente es dedicado con su rol se preocupa de hacer todo lo posible por sacar ventaja para su team.\n> \n> Por ultimo, el buen supp no le importa que lo flameen, trolleen, insulten o cualquier otra cosa. Los supp de calidad sabemos que es tan facil como mute y report. \n> \n> {{sticker:sg-ezreal}}\n\n\"Por ultimo, el buen supp no le importa que lo flameen, trolleen, insulten o cualquier otra cosa. Los supp de calidad sabemos que es tan facil como mute y report.\"\n Cambia \"supp\" por \"jugador\", por que eso que dices se puede aplicar perfectamente a todas las lineas.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"REXPAT","date":"2018-11-14T14:20:17.370+0000","up_votes":2,"down_votes":1,"body":"Como me gustaría pensar que es así, como me gustaría...\n{{sticker:sg-janna}}","replies":[]}]}]},{"poster":"Bud Dicec","date":"2018-11-14T16:21:17.940+0000","up_votes":8,"down_votes":0,"body":"A mi me encanta cuando juego con un buen support. Como no hay tantos buenos soportes, cuando hay uno bueno se nota mucho la diferencia.","replies":[{"poster":"Lycanroc","date":"2018-11-15T14:07:24.544+0000","up_votes":1,"down_votes":0,"body":"También se nota mucho cuando juegas con un mal supp, es horrible.","replies":[]}]},{"poster":"TortugaConMuleta","date":"2018-11-14T15:41:52.868+0000","up_votes":8,"down_votes":1,"body":"Soy main sup, y leí hasta (comentarios machistas), y ahi deje de leer","replies":[{"poster":"Dog Bulling","date":"2018-11-14T17:09:47.018+0000","up_votes":4,"down_votes":2,"body":"Más que machistas, irrespetuosos diría. El soporte es básicamente la niñera de 4 malcriados, y debe hacer casi de todo por ellos para que puedan jugar sin inconvenientes, sin siquiera recibir un trato digno.","replies":[]},{"poster":"AavatarisII","date":"2018-11-15T12:44:38.522+0000","up_votes":1,"down_votes":4,"body":"Me cargan las feminazi y sus victimizaciones, pero en este caso tiene razón con lo de tratar al rol de supp como rol para mujeres y, si, repetir comentarios \"machistas\" (con intención ofensiva) al respecto.\n\n...y soy hombre, simplemente abogo por el RESPETO","replies":[{"poster":"Annie Botz","date":"2018-11-15T14:27:03.394+0000","up_votes":2,"down_votes":1,"body":"Amigo, hay comentarios y comentarios, no puedes tratar algo como ''soy main cocina'' (haciendo referencia a que eres main soporte) por tener un score 1/0/20 como algo ofensivo, es que si lo comparas con alguien que realmente quiere ofender ese comentario se queda chico, es una talla nada más. Lo típico que dicen es: ese es un comentario machista bla bla bla. Si yo te digo \"hace años no salgo de mi cueva\" (por jugar mucho) seguramente nadie se va a ofender a pesar de que el comentario es** lo mismo** pero uno se mete con la persona en general y el otro más con el género, ¿Por qué uno se siente más ofendido que el otro?\n\nTe invito a leer un poco más para que veas que pareciera el apogeo del liberalismo, porque no puedes comentar nada sin que alguna persona, raza, género, país, religión o pensamiento se sienta ofendido. La libertad de expresión empezó desde que la mujer pudo decir lo que pensaba (en el voto), luego está el LGTB que tomó fuerza y pudo integrarse a la sociedad, todo bien hasta ahí, ahora todos esos derechos que ganaron algunos lo tergiversaron y se creen son intocables, por ejemplo cito textual el piropo de un trabajador \"Coma más ensalada para que conserve su linda silueta\", a ese comentario le correspondió un parte porque la persona hizo la denuncia por un comentario de ese nivel. Antes los piropos eran realmente groseros y no se les sancionaba pero ahora son un chiste en relación al pasado, aunque ahora si los sancionan, totalmente sinsentido. \n\nYa no puedes decirle \"linda\" a una mujer porque se ofende y te puede denunciar. Ganaron derechos pero algunas se aprovechan de eso, en exceso. \n\nSé que me desvíe del tema pero para terminar quiero comparar 2 puntos, si a mi no me ofenden los comentarios de otros y yo le respondo lo mismo pero éste se ofende ¿él es la víctima? ¿o yo?\n\nAhora la misma situación pero con un enfoque menos general, una chica me dice por el juego que vaya a trabajar y que no sea un vago por estar jugando y yo le digo que vuelva a la cocina ¿se le da otro enfoque porque es mujer? Lo digo porque al parecer así funciona el mundo actual.","replies":[]}]}]},{"poster":"Only Clässic VG","date":"2018-11-14T13:02:15.677+0000","up_votes":5,"down_votes":0,"body":"No hay honor que me guste mas dar que el de un soporte que dio todo de si para ganar una partida.","replies":[]},{"poster":"Metalark","date":"2018-11-14T15:47:00.880+0000","up_votes":3,"down_votes":0,"body":"En mi experiencia como masterchef jajaja me dio lo mismo lo del honor si me lo daban bien y si no me da lo mismo total estoy en honor 5 desde hace meses y no pedia a gritos honores, y con respecto a los que se quejan, flamean, dicen palabras despectivas, te desprecian y cosas asi tambien me da lo mismo, cuando me toca un team agradable donde uno pueda escribir y no te manden junto con tu mama a cierto lugar, escribo para agradar tambien pero cuando ya hay uno que insulta y demas lo muteo de todos lados y al final un lindo reporte y por ultimo lo bloqueo nada de otro mundo; ademas, siempre que voy supp la ventaja la busco en el que este carreando (no siempre sera el adc, es mas, a veces ni adc hay sin mencionar a los que les gusta jugar en blanco y negro) y de esa forma hay mas probabilidades de ganar ademas de otros factores. Pero como buen supp nunca me queje de honor, comentarios ni nada.","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-11-14T14:15:30.931+0000","up_votes":3,"down_votes":0,"body":"Es que los adc generalmente tienen problemitas, por ahi tomaron lavandina de chicos, o se golpearon la cabeza contra el bidet, o a lo mejor tienen tios santiagueños. Entonces vos cuidalos no mas, como si fuesen chicos especiales. Si jode mutealo y reportalo","replies":[]},{"poster":"Nadanada12395","date":"2018-11-16T00:17:47.906+0000","up_votes":2,"down_votes":0,"body":"1. En un juego lleno de egoistas egocentricos nadie obtiene el reconocimiento que se merece; no es cuestion de posición, hay gente que no quiere ver que alguien esta haciendo mas que ellos y ya, cualquier jugador decente y humilde se da cuenta de lo que hace el support.\n2. El support no carrea, ayuda a carrear.\n3. Si te quedás under lvl algo estás haciendo mal, no tenes por qué tener lvl más bajo que tu adc, que también lleva linea doble.\n4. Mancos y flammers tocan en todas las lineas.","replies":[]},{"poster":"pegiiz","date":"2018-11-15T03:04:22.353+0000","up_votes":2,"down_votes":0,"body":"yo maineo support, llegue a diamante jugando janna only practicamente y nunca nadie me bardeo ni me dijo nada de anda a la cocina, seguro sos malo y esperas que te traten especial por jugar support, no capo, no sos especial, es un rol mas","replies":[]},{"poster":"LordClaus98","date":"2018-11-14T16:30:58.274+0000","up_votes":2,"down_votes":0,"body":">machistas\nxD","replies":[]},{"poster":"Fenrito","date":"2018-11-14T19:26:48.867+0000","up_votes":3,"down_votes":1,"body":"Por experiencia propia ( al menos en aram) la mayoria de oros, platinos y diamantes que me tocan y juegan MAL, les miras el historial y eram main yasuo/zed/lee (lo clasico) o mains janna/nami/sona. \n\nMuchos \"main supp\" estan acostumbrados a solo hacer trades safe, usar campeones de mecánicas minimas, ser shield bots o simplemente a \"robar elo\" de un amig@/prim@/herman@/novi@ que los carrea y a la hora de salirse de su zona de confort son un desastre.\n\nPor otro lado, ya cansa un poco la idea de que los supp son infravalorado en bronce/plata/oro (próximamente en hierro) y necesitan apoyo moral, es parte de jugar ese rol en elo bajo y junto al jg son los culpables que tu mid/top/adc no salga 999/0/0 al minuto 8. Es algo propio de ese nivel de juego, a medida que mejoras DEBERÍAN de apreciarte mas (menos al jg que a ese lo flammean siempre xD) y queda en uno aceptar ese destino\n\nEn resumen \"la mayoria son carreados hasta diamante y deberían dejar de llorar por cosas que son inevitables\"\n\nPD: antes que me flameen, yo era empecé a jugar siendo main supp y lo deje con el tiempo hasta que conocí a pyke y volvió mi interes en el rol. Miren mi historial que lo poco que rankeaba era de supp y algo de top","replies":[]},{"poster":"L9 Letalis Umbra","date":"2018-11-14T18:28:41.126+0000","up_votes":3,"down_votes":1,"body":"Si no te llevas el reconocimiento entonces no eres main supp simplemente xd\npartida que yo vaya de supp saco mínimo 2 honores y que me chupen las botas todo el match,\nquizás te enfoques tanto en brillar que olvidas cual es tu funcion en la partida","replies":[]},{"poster":"Puynsi","date":"2018-11-14T15:34:43.612+0000","up_votes":3,"down_votes":1,"body":"Loco a quien le importa el reconocimiento, mientras no la caguen cuando les estas tirando 3 items activos y tus summs + el peel con tus habilidades todo bien.","replies":[]},{"poster":"Mioen","date":"2018-11-14T13:14:38.079+0000","up_votes":3,"down_votes":1,"body":"No lo se, siendo soporte durante tanto tiempo siento que ya me da un poquito igual el honor. Si me lo dan genial, si no es el caso, bueno que mas da.\n\nCreo que con el tiempo te dan ganas de mandar a todo el mundo a curtir. Pero nunca se los decis por que uno sabe que esta mal.\n\nHay partidas en las que te puedes dejar llevar, y hay partidas en las que puedes charlar con el resto.\n\n----------\nPor lo general un soporte que es carismatico en el chat y hace bien su trabajo se lleva un honor casi asegurado.\nCosas como...\n\nVieja, que bueno soy.\nBuenisima yogurisima.\nTe quiero.\nMuy buena ADC, pero acordate que el carry soy yo.\nWP ADC\n\nSon palabras que me aseguran el honor al final de la partida. Claro que estas frases las tiro cuando estoy de humor.\n\n\nSino en partida solo comunico.\nWP GG/ BG\nMIA\nSS\nNO summs\n\nDepende mucho de los compañeros.","replies":[]},{"poster":"SiroBoss286","date":"2018-11-14T13:58:00.574+0000","up_votes":2,"down_votes":1,"body":"Soy main supp amigo y mi acción inicial es el muteall. En casos extremos muteo señales y listo. Nunca te van a reconocer, sólo cumplí tu misión y sentite un héroe ganes o pierdas. Sin ti, el adc no es nada. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"F47M4N","date":"2018-11-15T17:49:14.310+0000","up_votes":1,"down_votes":0,"body":"En mi experiencia como main supp puedo decirte que eso me pasaba mucho en low gold, mientras mas vas subiendo de liga mas valor le dan a tu esfuerzo, es cuestión no solamente de jugar bien, sino de también reconocer cuando un aliado hace algo bien, y los llevas a empatizar contigo. De esta manera no solo reducís la toxicidad (si es que tenes algún toxico) sino que también los otros van a ver que estás conectando cada hook, atinando cada stun, curando hasta a el cangrejo, o incluso salvando de situaciones difíciles a los carrys.\nLa vida de nosotros los mains cocina es dura, pero mas dura es la verdura así que aunque no te den honor al final de la partida, la próxima quiza si te lo den.{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Treant del DOTA","date":"2018-11-15T17:16:31.032+0000","up_votes":1,"down_votes":0,"body":"Nada que ver. Si el support juega muy bien y fue el carry del equipo, en la gran mayoría de las veces se lo reconoce. Y es la posición en la que se suele recibir más honor que en las demás.","replies":[]},{"poster":"Phaedra","date":"2018-11-14T15:15:06.320+0000","up_votes":1,"down_votes":0,"body":"Si coincido en que es un rol sebestimado por riot, ya que cuanto mas ayudas a tu team, menos exp y oro tenés. Vas a wardear y perdes exp, corres a mid ayudar, perdes exp, no podes farmear solo, porque que siempre recibis menos exp...\n\nPero lo que no coincido, es que sea subestimado por el resto de los jugadores. Siempre veo como le dan honor al suport, mientras que el que carrea no recibe nada....","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:51:20.741+0000","up_votes":1,"down_votes":0,"body":"Riot ya anunció que en la próxima Season implementarán funciones para que el rol de Support ya no sea una niñera por así decirlo o que dependa tanto del equipo, y que se le tomen más en cuenta. Ya que tiene un gran peso en la partida.","replies":[]}]},{"poster":"Annakiya","date":"2018-11-14T17:33:57.614+0000","up_votes":1,"down_votes":0,"body":"Por un lado es verdad siempre que haces buenas jugadas y tu adc sale 12/0 le dan honor a el jajaja Pero veces la gente se da cuenta y te dan honores. Hace poco me tocó un adc que me felicitaba todo y agradecía las veces que lo salvaba de una situación difícil.\nTambién hay veces donde el soporte es carreado xD porque todo el team es bueno y vos sólo pones wards jajaj me ha pasado. Y  hay otras partidas donde el soporte hace la diferencia sea por la iniciación, peel o los ward.\nSoy mina y juego desde la s3 y siempre jugué soporte y adc. Y me han dicho millones de veces el famoso \"anda a la cocina\" y cosas como esas jajaja no dejo que me tilte después de todo uno juega para uno mismo y cuando todo sale bien te sentís re bien {{sticker:sg-kiko}}. Aunque no creas top es casi igual a soporte. Hay jugadores de top que ganan su línea, van a mid y bot, fedean al mid o al adc y a veces los honores van a los carrys y no al top {{sticker:sg-lux-2}} pero bueno. Si haces una buena partida, ganas Y subís. Salimos todos ganando xD","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:49:21.142+0000","up_votes":1,"down_votes":0,"body":"> Por un lado es verdad siempre que haces buenas jugadas y tu adc sale 12/0 le dan honor a el jajaja Pero veces la gente se da cuenta y te dan honores. Hace poco me tocó un adc que me felicitaba todo y agradecía las veces que lo salvaba de una situación difícil.\n> También hay veces donde el soporte es carreado xD porque todo el team es bueno y vos sólo pones wards jajaj me ha pasado. Y  hay otras partidas donde el soporte hace la diferencia sea por la iniciación, peel o los ward.\n\n+1","replies":[]}]},{"poster":"Sêrena","date":"2018-11-14T15:18:41.379+0000","up_votes":2,"down_votes":2,"body":"Yo soy mujer y me bardean por el simple hecho de serlo, me dicen eso de que me vaya a la cocina, y yo tengo que cerrar el ciclo porque sino me reportan a mi. Juego supp y siempre que sale algo mal en la línea el adc me culpa a mi, o me voy dos segundos y ya me está flameando, si el adc se fedea es porque el supp lo carrea y después todos le dan honor a él, cuando uno mismo hizo que se fedee. Después están los adc que se piensan que solo los tenés que ayudar a ellos, o los team que quieres que ayudes en mid y bot a la vez, y sino ya es GG supp. \nComparto lo mismo que vos .","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:47:45.596+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"Hobo Samurai","date":"2018-11-14T21:59:16.152+0000","up_votes":1,"down_votes":0,"body":"Juega otros roles, mutea el chat, easy.\nMe llama la atención la tendencia marcada de las chicas de la comunidad para encajonarse en botlane. Por lo general si no son supports, son ADC, pero muy rara vez salen de ahí.\nEs como cuando una mina tiene una relación con un tipo que es agresivo y golpeador pero lo perdona porque \"la quiere mucho\" . Es una especie de Síndrome de Estocolmo.\nFuera de talla, lo veo muy seguido.\nEs preocupante.","replies":[]}]},{"poster":"Ye Qiu Mu Xiao","date":"2018-11-14T23:02:10.424+0000","up_votes":1,"down_votes":0,"body":"Soy Main supp y digo que ser supp es super sencillo. Yo no juego a \"ganarme el honor\" para la llavesita, solo juego para divertirme, y si fui yo el que carreó a todo el team, genial, perfecto, esa satisfacción de mejorar solamente es mía, y nadie me la dió con su \"honor\", sino que es gracias a mi esfuerzo. \nSi andas buscando que te  reconozcan como el jugador que eres, primero destaca en lo básico, ser humilde ante la victoria o derrota.","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:47:26.739+0000","up_votes":1,"down_votes":0,"body":"Concuerdo, +1","replies":[]}]},{"poster":"Dead Man Walking","date":"2018-11-15T13:29:16.583+0000","up_votes":1,"down_votes":0,"body":"Para Ser Main Support Debes Tener Músculos En Los Ojos, MÚSCULOS! {{champion:201}} {{champion:12}} {{champion:412}}","replies":[{"poster":"Zalvagzk","date":"2018-11-15T14:46:41.487+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}} Me hizo mucha gracia tu comentario. XDD","replies":[]}]},{"poster":"Zalvagzk","date":"2018-11-15T14:32:13.303+0000","up_votes":1,"down_votes":0,"body":"Mira, en base a mi experiencia. Juego desde season 4 y podré decirte que eso siempre ha pasado, y con todo tipo de soportes.. pero una de las grandes habilidades por así decirlo de los support es la gran paciencia, no digo que en todos los support (obviamente cada jugador es un mundo) pero en mi caso siempre tuve mucha paciencia con los adc, y jugando con todo tipo de supports, playmakers, peel, peel-agro, etc.\n\nEso del reconocimiento siempre me ha parecido que es una especie de falta de cariño o autoestima (es mi punto de vista). ¿Por qué?\nporque si tu sabes que juegas bien no necesitas que nadie te tiren flores o que te diga que lo haces bien, y que feliciten a tu adc, mid o top por fedearlo debería ser irrelevante. Personalmente cuando me flamean, insultan, ragean, como lo quieras llamar... simplemente muteo y sigo jugando normalmente, porque esa gente solo busca tiltearte y que le sigas el juego, y aunque los reporte y el sistema a veces no funcione muy bien en temas de baneos y report (todos ya sabemos por qué, no hace falta decirlo). En algún momento tendrán que banear a alguien. Ya sea por actitud negativa, muerte intencional, toxicidad, etc. los reporto igual. Es mi humilde opinión.\n\nCon respecto a lo de que \"los supps son carreados\" es prácticamente un meme.. todos sabemos que no es así el support es la linea que tiene mayor indice de rotaciones de todos, eso que quiere decir, que si tú tienes un adc malo, que no destaca o simplemente que no te da la confianza de que pueda carrear para así tú hacerle peel, simplemente empiezas a rotar.. pero de manera muy inteligente y sabiendo cuando hacerlo, de esa manera puedes carrear la partida haciendo que el mid, top, jg enemigo se tilteen, invadiéndolos, wardeando jg enemiga para invadirlos. Y también no necesariamente rotando, roameando, sino jugando supports muy agresivos, Zyra, Brand, Vel'koz, incluso Xerath que se estuvo viendo hace semanas, pero que ya va en decadencia de pickeo. \n\nSaludos, Un simple main Thresh.\n{{champion:412}}","replies":[]},{"poster":"HeavenGates","date":"2018-11-15T12:12:29.868+0000","up_votes":1,"down_votes":0,"body":"No sé en qué planeta jugas al lol pero como sup me han dado honor todo el team (tampoco es algo que pasa siempre) y si vas a rotar comunicaselo a tu adc tal vez el no se siente seguro solo en línea","replies":[]},{"poster":"Borriic III","date":"2018-11-15T10:43:51.036+0000","up_votes":1,"down_votes":0,"body":"Vieja yo juego un monton janna y la gente siempre me tapa en honores, de hecho muchas veces hasta el team rival pone \"gg honor janna carry\" ..y estamos hablando de LAS donde generalmente te putean 5 veces antes que toques el piso\n\naunque lo cierto es que si muchas veces la gente no valora al 100% la labor del soporte, usualmente si haces bien tu trabajo te lo reconocen (a diferencia x ejemplo de los pobres junglas que se comen bardo el 99% de las partidas aunque jueguen bien)\n\nla unica pela del rol de soporte es cuando tu mid es un cono y ,cuando como yo juegas mid/sup, te jode muchisimo saber que de ser tu el midlaner estarias stompeando y en vez de eso tienes que estar haciendo magia con tus limitados recursos para asegurarte que el adc pueda seguir vivo farmeando mientras te traen hasta al perro a la botlane con tal de matarlos","replies":[]},{"poster":"Zindey","date":"2018-11-15T02:52:57.981+0000","up_votes":1,"down_votes":0,"body":"Lo de que asocian el rol de support con ser una mina y  de paso aprovechan para soltarte sus machistadas es tan posta que duele","replies":[]},{"poster":"NO LO SONIE","date":"2018-11-15T02:10:42.083+0000","up_votes":1,"down_votes":0,"body":"Lo de que cuando uno rota y el adc muere, hay que tener en cuenta que con que campeon rotas y con que adc jugas. No es lo mismo rotar con Blitz, Thresh que con Soraka y tener de ADC a Kalista, Ezreal que a Jhin. \n[https://www.youtube.com/watch?v=MG9APirKfk4](https://www.youtube.com/watch?v=MG9APirKfk4)","replies":[]}]}