{"poster":"Kaitri","date":"2015-10-25T16:29:01.744+0000","title":"SKT oder KOO wer wirds?","subforum":"Esports","up_votes":1,"down_votes":0,"body":"ich hatte eig keine zweifel das skt gewinnt, aber nachdem koo (gerade) fnc zerst&ouml;rt auf sehr dominante weise, k&ouml;nnte es sen das koo das finale gewinnt?ich glaube immer noch das skt es wird aber diesmal wird das finale kein 3:0!","replies":[{"poster":"Avorox","date":"2015-10-25T18:43:03.825+0000","up_votes":2,"down_votes":0,"body":"SKT spielt derzeit konstant auf einem Niveau, das bei den Worlds dieses Jahr noch kein Team auch nur in einem einzigen Spiel gezeigt hat. Wenn KOO also nicht plötzlich riesige Fortschritte macht wird wohl SKT den zweiten Titel mit nach Hause bringen.","replies":[]},{"poster":"Regensburg","date":"2015-10-25T16:38:48.566+0000","up_votes":2,"down_votes":0,"body":"Man muss aber anmerken, dass FNATIC nicht richtig im Halbfinale angekommen ist, Huni sowie der Rest des Teams hat den Faden ins Spiel nicht gefunden, deswegen war es eig klar das es gegen KOO nix werden kann. Trotzdem sehe ich es genauso, SKT1 wird das Finale gewinnen!","replies":[{"poster":"Kaitri","date":"2015-10-25T16:43:07.182+0000","up_votes":1,"down_votes":0,"body":"es ist fraglich, fnc hat so gespielt wie in der 1. woche der groups, sie haben einen auf lgd gemacht. ka obs am druck lag oder sonstwas, ich finds nur sehr schade einfach weil sie besser hätten spielen können. selbst wenn sie 2:3 verloren hätten, hätte es spannender sein können","replies":[{"poster":"Essence Thief","date":"2015-10-25T18:40:55.645+0000","up_votes":2,"down_votes":0,"body":"Ich denke es hat viel damit zu tun das in Korea kein Bo1 gespielt wird wie in Eu oder Na, in der LCS hat man gewonnen oder verloren danach gehts nicht weiter, in der LCK sind es die Spieler gewohnt auch mal das erste Spiel zu verlieren und danach nicht gleich as Handtuch zu werfen. Man hat ja gesehen wie ausgeglichen das erste Spiel war, danach ist FNC halt zusammengebrochen weil sie es nicht so gewohnt sind wie KOO.","replies":[]}]}]},{"poster":"Sahnepuffelchen","date":"2015-10-25T17:16:03.918+0000","up_votes":2,"down_votes":0,"body":"SKT T1 war bisher konstant gut, und ich kann mir vorstellen, dass sie für das Finale noch einige Picks in der Hinterhand haben. Vor allem Faker hat einen riesigen Championpool, von dem wir bisher nicht viel gesehen haben. Ich bin sehr gespannt und denke auch, dass SKT T1 die World Championship gewinnen wird. \n\nMfG Sahnepuffelchen","replies":[]},{"poster":"Gundarion","date":"2015-10-27T00:01:25.547+0000","up_votes":1,"down_votes":0,"body":"Schönen guten Abend ,\nich hoffe das KOO Tigers das macht da mir das Team einfach sympatischer erscheint als diese hocheingebildeten SKT Typen die wenn sie ins Finale einziehen noch nicht mal ein Mundwinkel verziehen.Gerade Faker ist einfach unsympatisch und bei weitem nicht der Überspieler für den er gemacht wurde.Die Bot und Toplane von SKT ist weitaus stärker wie der Midlane Egoist Faker.\n\nAber leider wird es wohl SKT,aber alles in allem fand ich diese WM die langweiligste und schwächste die ich bisher gesehen habe da Riot mit dem Juggernaut Patch und Co. kurz vor der WM einfach alles kapuut gemacht haben.Über 90% banrate auf Gangplank und Mordekaiser dann wurde noch Gragas rausgenommen da konnte man Teambasierte Bans einfach nicht mehr mit reinbringen was meiner Meinung nach alles zu berechenbar gemacht hat.Dann könnte man die Bans auch einfach weg lassen.In den frühren Weltmeisterschaften war die Pick und Ban Phase echt immer spannend aber bei diesen Worlds wusste man nach zwei Spielen 4 von 6 Bans.\n\nNaja ich hoffe Riot wird da zur neuen Season wieder was ändern.\n\nIn diesem Sinne ein gute Nacht\n\nMFG Gundarion\n\nP.S Wer Rechtschreibfehler gefunden hat.GLÜGWUch du darfst sie behalten. :D","replies":[{"poster":"0wOOvOOw0","date":"2015-10-27T11:00:30.578+0000","up_votes":1,"down_votes":0,"body":"Leider muss ich deine Meinung teilen das RIOT mit dem Juggernaut Patch alles zerstört hat. Die spannende Atmosphäre die man von Worlds kennt, die PICKS&BANNS gehörten zu meinen favorisierten stellen - leider nicht bei dieser WM! Du hast absolut recht...\n\nSchade RIOT {{item:3151}}","replies":[]},{"poster":"Kaitri","date":"2015-10-27T00:39:50.590+0000","up_votes":1,"down_votes":0,"body":"kann ich so ziemlich alles bekräftigen, nur darf man faker das nicht übel nehmen. manche menschen zeigen halt keine emotionen und faker ist schon viel mehr aus sich rausgekommen als in season 3.","replies":[]},{"poster":"Spicavius","date":"2015-10-27T00:25:01.783+0000","up_votes":1,"down_votes":0,"body":"Ich sehe das ähnlich, doch man muss auch sagen, dass vor dem Patch die Banns/Picks auch eintönig waren.\nIch denke , das Riot einfach die komplette Meta mal übern Bord werfen wollte, damit die Worlds spannender werden.\n\nNaja vllt sind die auch einen Schritt zu weit gegangen^^.\n\nBtw ich denke auch, dass es SKT wird. Ich denke wir haben nur die Spitze des Eisberges gesehen, was Faker so alles anstellen kann.\n\nIch persönlich habe sogar so ein Gefühl, dass er ungefähr die \"typschen\" Spielweisen der Challenger/LCS Spieler durchschaut hat (als ob ein Challenger Spieler den Schritt eines Goldspielers komplett vorhersehen kann)\nSo in etwa denke ich auch über Faker, der Messi unter dem E-Sport :P\n\nZum Thema, dass Faker nicht mal eine Emotion zeigt.\nIch denke das liegt an dem Drill der Professionalität, den die in Korea abbekommen haben.\nNach dem Motto  Emotionen = Unprofessionel.\nWer Emotionen zeigt / hat kA^^ spielt schlechter (?) Das wäre meine Meinung zu den Emotionen.","replies":[]}]},{"poster":"0wOOvOOw0","date":"2015-10-27T10:56:40.157+0000","up_votes":1,"down_votes":0,"body":"Ehrlich gesagt, ich hatte KOO bis jetzt immer unterschätzt, nachdem sie mein Team (FNATIC) aber so zerstört haben {{summoner:4}}  und ich sie das erste mal wirklich aufmerksam beobachtet habe bin ich eher überzeugt das sie beste Chancen auf den Titel haben!!! Mit einem konstant guten Gameplay, viel Sicht, gutes Laning und zerstörenden Teamfights sind sie SKT meiner Meinung nach doch ein bisschen überlegen! Ich denke es wird ein Spannenden Finale, das hoffentlich bis Game 5 of the Worlds Final gehen wird. ( Ich höre Deficio schon schwärmen ) Ich bin allerdings auf der Seite von KOO.","replies":[]}]}