{"poster":"SableyeCG","date":"2017-05-12T12:09:03.470+0000","title":"Fuerza Trabajadores de Riot","subforum":"Charlas Generales","up_votes":17,"down_votes":6,"body":"Cabros porque son tan pesados con los pobres rioters ellos solo hacen su trabajo ademas muchos los critican sin saber siquiera lo que hacen tengan un minimo de respeto por los cabros y de paso riot envienme una cajita por chup4 pic# haha. no pero en serio miren yo gane 2 partida y no me dieron pL mande un reporte a riot a las pocas horas despues me respondieron y me quede tranquilo sean empaticos ponganse en el lugar de ellos {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Tortuguita","date":"2017-05-12T12:16:05.082+0000","up_votes":3,"down_votes":3,"body":"Exactamente eso , no pueden exigir algo que no tuvieron que pagar por ello... es totalmente desubicado.\n\nPuedes recomendar y expresarte , pero no de la forma que lo hacen por estos lares.","replies":[{"poster":"UlicesOne","date":"2017-05-12T13:16:46.963+0000","up_votes":5,"down_votes":0,"body":"Pero es free to play gracias a que tiene toda una comunidad que lo apoya y gracias a eso se sigue mantiendo (mas alla de las microtransacciones que tambien las paga el usuario obviamente) La gente tiene todo el derecho de quejarse si algo esta realmente mal y siempre y cuando tengan un transforndo y un argumento para quejarse.\nEl hecho de que sea Free to Play no los hace inmune a las quejas por ser gratis, es igual a un juego pago porque esta mantenido POR LA GENTE y sin la gente no es nada el juego","replies":[{"poster":"Yazzy","date":"2017-05-12T14:42:43.936+0000","up_votes":1,"down_votes":0,"body":"No lo hace inmune a QUEJAS, pero todo debería ser inmune a INSULTOS.\n\nInsultan y rompen todo de la bronca como si verdaderamente estuvieran pagando un servicio. Como el video del tipo que va a Telecentro con el codificador super enojado ([video acá, si no lo viste](https://www.youtube.com/watch?v=-qP0IjUbU6s) )), porque está pagando por un servicio que funciona mal y le quiso dar de baja. Todos se creen que tienen derecho a reclamar un servicio como si fuera de pago mensual. (Ahí si habría problemas, imaginate que pagas una suscripción mensual y no podés jugar por 2 semanas. Escándalo)\n\nRiot necesita de nuestras quejas para mejorar, necesita nuestras críticas. Pero enojarse directamente con sus empleados por \"hacer mal su trabajo\" como si nosotros estuviésemos pagándoles el sueldo? Me parece inapropiado","replies":[]}]}]},{"poster":"EseBwoy","date":"2017-05-12T13:27:44.619+0000","up_votes":2,"down_votes":0,"body":"Básicamente es lo mismo que vemos en todas las partidas... Toxicidad pura.\nUna lástima. Tienen que pensar a parte que no están hablando de cualquier \"tontito\" (Sin ánimos de ofender a absolutamente nadie)\nEstamos hablando de una empresa, de gente que vive de esto y estudió para ello, ingenieros, diseñadores, programadores, etc.\nSí, que toman \"malas decisiones\" a veces, puede ser, como cualquier empresa. De eso se trata, de tomar decisiones, algunas salen bien y otras no.\nPero los usuarios deberían (Y deberíamos, también me incluyo, no suelo comentar pero si me tilteo bastante) bajar un cambio.\nPorque después exigimos mucho respeto también.\nCoincido con que tenemos el derecho a reclamar (En este caso, que se den los LP, las partidas están en el historial, por ejemplo), pero una cosa es reportar un bug, y otra es atacar a mansalva.\nNo va solo para la toxicidad contra Riot. No se olviden que ES UN JUEGO, deberían dejar la agresividad para otro lado.\nSaludos.","replies":[{"poster":"Soohobbit","date":"2017-05-12T13:49:34.242+0000","up_votes":3,"down_votes":0,"body":"Hace rato que no leo un post de alguien normal que no está prendido fuego.","replies":[]}]},{"poster":"SebastjjaN","date":"2017-05-12T13:14:52.137+0000","up_votes":2,"down_votes":0,"body":"Es freetoplay, pero hay gente y marcas que invierte dinero en el juego, ya sea para torneos o algunas otras cosas. Si el server de LAS anda siempre para el culo, ya no querran organizar nada. Y eso a RIOT, no le conviene.","replies":[]},{"poster":"Tortuguita","date":"2017-05-12T12:11:04.144+0000","up_votes":4,"down_votes":3,"body":"Te falto algo en mayusculas y negrita , FREE TO PLAY.\n\nAdios Señores.","replies":[{"poster":"SableyeCG","date":"2017-05-12T12:14:55.398+0000","up_votes":1,"down_votes":2,"body":"que tiene que sea free to play?  \nes decir que no se deberian quejar porque es free to play? toda la razon xD","replies":[]}]},{"poster":"erwinchelo","date":"2017-05-12T13:18:21.519+0000","up_votes":1,"down_votes":0,"body":"Meh...","replies":[]},{"poster":"Nuke","date":"2017-05-12T17:08:58.335+0000","up_votes":1,"down_votes":1,"body":"Y cuando lo digo yo... Ahhh... Ahi soy un chupamedias :v","replies":[{"poster":"Ks Erwyn","date":"2017-05-13T04:23:10.877+0000","up_votes":1,"down_votes":1,"body":"https://k38.kn3.net/taringa/1/2/3/9/0/2/49/lingeracroto/C59.gif","replies":[]}]},{"poster":"Picky Jones","date":"2017-05-12T14:24:24.068+0000","up_votes":1,"down_votes":1,"body":"Es lógico que todo el mundo este prendido fuego con los Rioters, es lo mas normal...\nSacaron antes de tiempo el cliente con la escusa de \"Hemos mejorado mucho el rendimiento...\" cuando sigue funcionando igual de mal... \nClaramente todos estos bugs vienen por lo del cliente nuevo, no estaban preparados para que TODOS los jugadores estemos desde el mismo cliente cuando esta TAN MAL OPTIMIZADO...\nY me parece que por mucho que pongan en mantenimiento el servidor, y por muchas horas que estén trabajando, no va a durar mucho sin volver a bugearse.{{sticker:slayer-jinx-unamused}}","replies":[]}]}