{"poster":"MeehrBluee ","date":"2019-01-14T09:25:27.409+0000","title":"NASUS TOTAL BROKEN","subforum":"Champions & Gameplay","up_votes":5,"down_votes":6,"body":"Kann mir keiner sagen das Nasus nach dem letzten Buff nicht total broken ist. Der haut ohne feed direkt 2 leute mit 4 schlägen weg. Den kannst du nicht mal ganken, da geht nichts. 1,3k dmg with level 6 mit einem Q oder was das da ist. WAS IST DAS? TOTAL BUSTED.  Alte nicht normal. Alle nasus games verloren. jeder idiot spielt den jetzt. Willkommen zum perma Ban.","replies":[{"poster":"DrakoniaDRK","date":"2019-01-14T15:32:13.495+0000","up_votes":2,"down_votes":0,"body":"Nasus wurde stärker gemacht ja, er bekommt mehr Staks wenn er einen Cannon Minion tötet. Nasus ist ein cooler und starker Champ aber nicht broken. Er hat auch seine Counter wo er echt in Schwierigkeiten geraten kann. Setz ihm einen Teemo vor die Nase oder einen Darius der immer wieder drauf hauen kann auf Nasus, auch Garen würde gehen oder eine Vayne. Vorausgesetzt du beherrscht das Laning und auch das poken. Nichts ist unmöglich. \nVermutlich hattest du sehr gute Nasus Spieler gegen dich die das Laning und auch den Rest sehr gut beherrschen und vor allem ihren Champion. \n\nUnd wenn du ein Problem mit Nasus hast dann gibt es eine Möglichkeit = Bannen. Wobei dann vermutlich ein anderer Spieler mit einem anderen Champ gegen dich spielt und dich auseinander nimmt und du dann den nächsten Post eröffnest und sagst der und der Champ ist broken.","replies":[]},{"poster":"Qbert","date":"2019-01-14T09:38:20.038+0000","up_votes":2,"down_votes":0,"body":"Gestern zwei Spiele mit Nasus im Gegnerteam im Jungle gehabt ... beide gewonnen ... kann deine Aussagen nicht nachvollziehen.","replies":[{"poster":"Necromant","date":"2019-01-14T09:57:54.466+0000","up_votes":2,"down_votes":1,"body":"Low Elo -> Nicht gegen spielen können, da sich kein Wissen aneignen -> Champion muss broken sein\n\n\\- Ende -","replies":[{"poster":"Veezey","date":"2019-01-14T14:20:42.898+0000","up_votes":2,"down_votes":0,"body":"Mach ich auch so :)","replies":[]},{"poster":"Cenâreth","date":"2019-01-15T11:22:22.666+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Necromant,realm=EUW,application-id=Wj1wcocU,discussion-id=QdIAjEcW,comment-id=00000000,timestamp=2019-01-14T09:57:54.466+0000)\n>\n> Low Elo -&gt; Nicht gegen spielen können, da sich kein Wissen aneignen -&gt; Champion muss broken sein\n> \n> \\- Ende -\n\nVersteh eh nicht wie ein Nasus Jungle überhaupt noch verlieren kann... *ironie off*","replies":[]},{"poster":"ImTheFox115","date":"2019-01-14T11:09:38.903+0000","up_votes":1,"down_votes":0,"body":"Lernen ist aber auch schwer...\nVorallem Fehler machen und diese dann wirklich in jedem Game wiederholen und es einfach nicht sein lassen können...","replies":[]}]}]},{"poster":"Asulia","date":"2019-01-14T10:14:29.427+0000","up_votes":2,"down_votes":0,"body":"Echt, Ich häng bei dem mit dem Wissensstand noch auf anno dazu mal, bin scho ganz verwundert das der auf AD gespielt wird. \nHier ändert sich alles so schnell, im Rechnungsrahmen eines alten Mannes, Ich hab irgendwann aufgehört und kauf mir brav den Mist von 14 , superspießer halt,  wenn es neue Items etc gibt brauch Ich 2 Jahre bis Ich die im Shop oder durch Zufall entdecke lach.\nUnd in 5 min hab Ich das ganze eh wieder vergessen und in nem halben Jahr dann so, oh nasus is broken lass ma zocken.","replies":[{"poster":"Qbert","date":"2019-01-14T10:42:18.256+0000","up_votes":2,"down_votes":0,"body":"armes, altes Asulia ... setz dich lieber auf deinen Ohrensessel, decke dich zu, trink dein Tee und schlummere etwas :D","replies":[{"poster":"Asulia","date":"2019-01-14T10:51:54.135+0000","up_votes":2,"down_votes":0,"body":"Mach ich doch eh, das ist ja das Problem, was meinst wie oft Ich den Leverbooster^^ bekomme, weil das passiert.\nEben noch am Tower und im nächsten Moment im Land der Elfen und Feen..^^","replies":[]}]},{"poster":"Cenâreth","date":"2019-01-15T11:23:12.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Asulia,realm=EUW,application-id=Wj1wcocU,discussion-id=QdIAjEcW,comment-id=0002,timestamp=2019-01-14T10:14:29.427+0000)\n>\n> Echt, Ich häng bei dem mit dem Wissensstand noch auf anno dazu mal, bin scho ganz verwundert das der auf AD gespielt wird. \n> Hier ändert sich alles so schnell, im Rechnungsrahmen eines alten Mannes, Ich hab irgendwann aufgehört und kauf mir brav den Mist von 14 , superspießer halt,  wenn es neue Items etc gibt brauch Ich 2 Jahre bis Ich die im Shop oder durch Zufall entdecke lach.\n> Und in 5 min hab Ich das ganze eh wieder vergessen und in nem halben Jahr dann so, oh nasus is broken lass ma zocken.\n\nWas soll ich sagen, hatte gestern einen Garen ADC Botlane auf Stormrazor first item, man lernt halt immer dazu.","replies":[]}]},{"poster":"Ribenji","date":"2019-01-23T17:06:04.855+0000","up_votes":1,"down_votes":0,"body":"Nasus ist das gleiche wie immer, das größte kiteopfer auf diesem Planeten, setzt ihm ne Janna ins gegnerteam und der macht NICHTS mehr. Ähnlich wie Garen oder Yi, den auch viele als Op noob Champ betiteln, haste auch nur einen cc ist er nutzlos.","replies":[]},{"poster":"Carina","date":"2019-01-15T15:08:59.682+0000","up_votes":1,"down_votes":0,"body":"Ich stimme dir zu!\nUnd zwar weil ich in letzter Zeit viel Nexus Blitz gespielt habe. Im ersten Spiel wo ein Nasus dabei war hat er nach 10 Minuten alles zerlegt. Im zweiten Spiel gegen einen Nasus ist mein Team nur auf ihn gegangen. Er war first blood (unter seinem Jungle Turm). Er ist 10 mal gestorben. Er hat aus Frust angefangen zu flamen. Und trotzdem haben wir verloren, weil der dude nach 20 Minuten vorm laufenden Nexus stand und mit einem Q 90% Leben von jedem meiner Teammitglieder abgezogen hat und sich dabei noch krass geheilt hat.\n\nIhn vom Farmen abhalten mag im SR funktionieren, da halte ich ihn auch für relativ balanced. Aber wie mache ich das effektiv in Nexus Blitz wenn Nasus Jungler ist? Counterjunglen geht da nicht und seine Items bekommt er durch das passive Gold so wie so. xD\n\nAber naja, ich schätze Nexus Blitz ist eh ein Funmode, der auch bald wieder verschwindet, also von da her ... ¯\\_(ツ)_/¯","replies":[{"poster":"Sirrkas","date":"2019-01-15T16:57:32.741+0000","up_votes":1,"down_votes":0,"body":"Bei mir hat die letzten Tage das Team mit Nasus fast immer verloren. Wenn er bei mir ist, counterjungelt der Gegner ihn. Wenn er bei den Gegnern ist, schalten wir ihn im Teamfight aus oder fangen ihn ab.","replies":[]}]},{"poster":"PlsLoLMMO","date":"2019-01-14T14:43:43.229+0000","up_votes":1,"down_votes":0,"body":"1. Nein nicht jeder Idiot spielt ihn  denn er hat eine pickrate von 6,2% auf deiner Elo was weit von \"jeder\" entfernt ist ..... zumal JEDER nur in OfA möglich wäre\n2. Zeig mir n Nasus der mit lvl 6 1,3k pro Q drückt. Dann muss dein Team schon ordentlich Arbeit reingesteckt haben.\n3. Nasus ist n richtiges Gankopfer sogar erst recht bis lvl 6 und sogar einen großteil darüber hinaus. Wenn du zu schlecht bist dann kann der Nasus einfach nix für.\n4. Perma bann ist er ebenfalls nicht  mit fast 2% banrate auf deiner Elo\n5. Dein Op.GG naja ... sagen wir mal du bist berechtigt s4\n\nBtw als nida kannste nasus freeganken bis min 20","replies":[]},{"poster":"Staatsanwalt","date":"2019-01-14T10:04:23.728+0000","up_votes":1,"down_votes":1,"body":"Mit Aatrox ist er easy klein zu halten. Hätte ich nicht gerade 1 Leaver, 2 afk und nen Troll gehabt, hätte ich easy gewonnen.","replies":[]}]}