{"poster":"Yoda1285","date":"2018-08-07T18:39:08.539+0000","title":"Matchmaking für Support Mains","subforum":"Champions & Gameplay","up_votes":4,"down_votes":4,"body":"Hallo liebe Community, hallo Riot Games\r\n\r\nIch spiele zum gr&ouml;&szlig;ten Teil Support und liebe diese Rolle. Mein Main Champion ist Nami (knapp 500k Mastery Punkte).\r\n\r\nLeider habe ich h&auml;ufiger das Problem mit ADCs spielen zu m&uuml;ssen, welche durch das Matchmaking System automatisch zugewiesen werden (Auto-Fill).\r\nSupport ist nach wie vor die unbeliebteste Rolle in League of Legends und ich finde es ein Unding als freiwilliger Spieler dieser Rolle mit Leuten belastet zu werden, die keine Ahnung haben wie man ADC spielt!\r\n\r\nWenn Leute die einmalig Support spielen, bei den n&auml;chsten Matches vom Auto-Fill gesch&uuml;tzt sind und garantiert das spielen k&ouml;nnen was sie m&ouml;chten, dann sollten Leute die freiwillig Support spielen nicht mit Auto-Fill Spielern &#039;bestraft&#039; werden!\r\n\r\nEs ist hart genug als Main-Support im Ranglisten Modus nach oben zu kommen und auch wenn nicht jeder Auto-Fill ADC schlecht ist, so ist es doch eher die Regel. Wenn ich ein Spiel mit 30 Minuten werte in dem ich meine Zeit und Nerven verschwende ist es mir lieber eine Minute oder 2 l&auml;nger in der Warteschlange zu sein. (Es sollte zumindest eine Oprtion im Client geben um das Matchmaking mit Auto-Fill Spielern ein und ausschalten zu k&ouml;nnen.)\r\n\r\nAlles Gute und bleibt Cool bei dem Wetter. :-)\r\n\r\nHanBrolo85","replies":[{"poster":"NamiCurry","date":"2018-08-07T19:03:23.957+0000","up_votes":5,"down_votes":0,"body":"Filled adcs sind gar kein Problem, viiiiiiel schlimmer sind da autofilled Jungler, die gar keine Ahnung der Position haben. Dann kannste gleich leaven.","replies":[{"poster":"Yoda1285","date":"2018-08-07T20:23:27.037+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht um Auto-Fill an sich.\n\nEs geht darum das andere Leute die gefillt werden oder freiwillig mal eine Runde Support spielen danach 3 Spiele lang belohnt werden. Wenn ich aber generell Support spiele habe ich das nicht. Supports werden als einzige nie belohnt.","replies":[{"poster":"Alpacana","date":"2018-08-07T20:33:30.870+0000","up_votes":4,"down_votes":2,"body":"Genau genommen wirst du doch jedes Spiel belohnt, da du jedes Spiel deine Rolle bekommst?","replies":[]}]}]},{"poster":"Alpacana","date":"2018-08-07T19:12:32.146+0000","up_votes":4,"down_votes":1,"body":"Hm also vorne weg: Ich bin auch Support Main (1.1m auf Thresh) und sehe das ganz und gar nicht so. Klar hat man ab und zu Games wo man am liebsten ins Gegnerteam wechseln möchte weil dein Adc wie ein geboosted Stück hängengebliebener Schei.....lassen wir das. Ja, ab und an hat man einfach schlechte Spiele. Die wirst du mit Sicherheit aber auch haben, da werden sich Leute auch denken \"Omg..schon wieder ein Autofilled-Support\", so ist das nunmal. Man kann einfach nicht durchgehend perfekt spielen (das wäre ja auch langweilig, wenn jeder perfekt spielt, wer gewinnt dann das Spiel?).\n\nIch weiß nicht genau wieso es härter sein soll \n > im Ranglisten Modus nach oben zu kommen\n \n, man kann meiner Meinung nach als Support genauso hart carrien wie auf jeder anderen Rolle auch, man muss nur wissen wie es geht.\nDie Leute die tatsächlich autofilled sind spielen wahrscheinlich auch eher schlecht, da gebe ich dir durchaus recht. Selbst dann wirst du aber ab und an immernoch ein paar dabei haben die selbst dann noch besser als der gegnerische Adc spielen.\n\nIch glaube jeder von uns würde lieber 1 oder 2 Minuten länger in der Warteschlange bleiben um zu gewinnen (das ist doch eigentlich was du meinst, nicht?).\n\nZu der Option im Client für das Autofill-Ding:\nDas würde einen ähnlichen Effekt wie damals bei Teambuilder hervorrufen.\nEs würde damit anfangen, dass die Warteschlagen vielleicht beide gleich auf mit Spielern gefüllt werden (und selbst dann sind 1-2Minuten mehr weit untertrieben, bei Teambuilder waren es damals bis zu 20 Minuten in einem Normal Game). Daraus würde resultieren, dass Leute die eben **mit** Autofill-Spielern spielen zu der Queue **ohne** Autofills rübergehen, aus einem verständlichen Grund. Die Queues sind gleich, warum sollte man dann also wählen mit einem Autofill zu spielen). Das würde dann solange weitergehen bis wieder **jeder** die Queue ohne Autofills spielt, da man in der anderen Queue immer weniger Spieler haben wird wodurch die Queue in das Unendliche ansteigt. Sobald das passiert ist wirst du im Grunde den alten Teambuilder wiederhaben wo niemand Support spielt (Support ist nunmal eine unbeliebte Rolle) und du wieder einmal extrem hohe Queue-Zeiten haben wirst.\n\nFür dich/uns als Support-Main mag das Ganze vielleicht ganz nett sein weil wir wahrscheinlich schneller unsere Games finden, aber für die restlichen 80% der Lol-Spieler ist es einfach nur Schei**. \n\nAlles in Allem: Wurde schon getestet, lohnt sich für Riot nicht, wird also nicht passieren.","replies":[{"poster":"Yoda1285","date":"2018-08-07T20:50:43.887+0000","up_votes":1,"down_votes":0,"body":"Ich habe gerade mal geschaut. In deiner ELO ist vieles was du sagst sicherlich richtig, aber im Bereich bis Gold sollte es ohne lange Wartezeiten möglich sein.\n\nIch meine auch nicht, dass alle ADCs die autofilled sind scheiß Spieler sind. Es geht mir darum, dass jede andere Rolle belohnt wird wenn man gefillt wurde. Supports sind immer \"gearscht\" und bekommen das was gerade an Leuten da ist, obwohl sie schon die unbeliebteste Rolle spielen. Zumindest sollte man wie z.B. 3 Spiele keine Auto-Fill Leute bekommen wenn man support gespielt hat.","replies":[{"poster":"Alpacana","date":"2018-08-07T21:03:11.371+0000","up_votes":1,"down_votes":0,"body":"Nein, mein Beispiel beschreibt das ganz schön. Bei Teambuilder waren es damals bis zu 7Min Queue in Normal Games, der beliebtesten Queue. In Ranked denke ich wären das nochmal ein bisschen mehr, geschweige denn bei Higher Elo, das will ich mir gar nicht vorstellen.\n\nZu deinem anderen Punkt:\nSeien wir mal ehrlich. Ist nicht im Grunde einer immer \"gearscht\"? Entweder bekommt der Adc einen autofilled Support (kennen ja die meisten hier nur zu gut), oder du spielst selber Support und bekommst halt ab und an mal einen Adc geautofilled.\nDabei denke ich aber eher, dass die Adcs mehr \"gearscht\" sind, da sie mehr autofilled Supports bekommen als Supports autofilled Adcs (hab dazu keine Statistik, ist nur mein Gefühl).\nAlso sollten wir uns mal nicht so anstellen und lieber die Adcs bemitleiden ;)","replies":[]}]}]},{"poster":"Hempel","date":"2018-08-10T10:51:57.386+0000","up_votes":1,"down_votes":0,"body":"Hab vor ein paar tagen einen richtigen Thriller gehabt! :D\n\nhttps://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/3722280991/230851564?tab=overview\n\nZu 80% verkackt die Toplane ein ganzes Spiel. Ist zumindest meine Auffassung. \nBin jetzt auf Silber 4 runter und hab kein bock mehr auf Rankd! \nIch nehme mir jetzt einfach die Zeit bis zur nächsten Season und spiel Blind und Autofill.\nHab nach 2 Jahren Spielzeit so viele Champs nicht gespielt,  wodurch mir der Zustand auf der Botlane gefällt. \nScheiße ist es auch wenn man selbst als erstes die Champs pickt und die gegnerische Bot zuletzt.","replies":[]},{"poster":"Rv Sabo","date":"2018-08-07T19:06:29.289+0000","up_votes":1,"down_votes":0,"body":"Du sagst genau dass was Adcs schon seit Jahren mitmachen müssen ... genau Autofilled Supporter in jedme 2. Spiel. Zudem sind Marksmans zurzeit die unbeliebteste Rolle weswegen du auch so häufig mit Autofilled Adcs gematcht wirst. Ah ja und btw zur zeit weiß ein \"main Support \" in Plat nichtmal wie man einen Marksman beschützt....","replies":[{"poster":"Yoda1285","date":"2018-08-07T20:18:34.207+0000","up_votes":1,"down_votes":1,"body":"https://www.leagueofgraphs.com/champions/main-stats\n\nhttp://i.imgur.com/r6fH5tf.png\n\nMan kann halt einfach auch nicht jeden Marksman beschützen. Das scheint so eine Ego-Krankheit der ADCs zu sein, die für ihre Fehler immer den Support zur Rechenschaft ziehen.\nDurfte mir gerade wieder von meinem ADC anhören, dass ich ihn doch nie heilen würde. Er ist jedes Mal vor dem Team gelaufen und hat sich mitten in die Ultis von Graves, Fiddlesticks und Vel'Kez gestellt. Eine Stopwatch oder einen GA zu kaufen ist ihm leider nicht eingefallen. Damage ist viel wichtiger! xD","replies":[{"poster":"Cenâreth","date":"2018-08-07T21:26:10.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HanBrolo85,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=00010000,timestamp=2018-08-07T20:18:34.207+0000)\n>\n> https://www.leagueofgraphs.com/champions/main-stats\n> \n> http://i.imgur.com/r6fH5tf.png\n> \n> Man kann halt einfach auch nicht jeden Marksman beschützen. Das scheint so eine Ego-Krankheit der ADCs zu sein, die für ihre Fehler immer den Support zur Rechenschaft ziehen.\n> Durfte mir gerade wieder von meinem ADC anhören, dass ich ihn doch nie heilen würde. Er ist jedes Mal vor dem Team gelaufen und hat sich mitten in die Ultis von Graves, Fiddlesticks und Vel&#x27;Kez gestellt. Eine Stopwatch oder einen GA zu kaufen ist ihm leider nicht eingefallen. Damage ist viel wichtiger! xD\n\nDas ist quatsch, du hast als Support die Pflicht deinen ADC zu unterstützen auf der Lane und dass Team hat die Pflicht ihn ebenfalls zu safen allen voran die Tank/Bruiser oder auch Assassins.\n\nDass was du beschreibst ist kein ADC, keine top, kein jungler, kein midlaner dass ist einfach nur ein Mensch mit ADHS Problemen und der wahrscheinlich dass Spiel gar nicht gewinnen will grundsätzlich sollst du deine ADCs auch safen aber sie auch unterstützen mit Dmg oder eben mit Stuns, roots, oder anderen Kram, dass sieht Riots Prinzip vor","replies":[{"poster":"VIP tombtomb","date":"2018-08-07T23:08:58.371+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=000100000000,timestamp=2018-08-07T21:26:10.069+0000)\n>\n> Das ist quatsch, du hast als Support die Pflicht deinen ADC zu unterstützen auf der Lane und dass Team hat die Pflicht ihn ebenfalls zu safen allen voran die Tank/Bruiser oder auch Assassins.\n> \n> Dass was du beschreibst ist kein ADC, keine top, kein jungler, kein midlaner dass ist einfach nur ein Mensch mit ADHS Problemen und der wahrscheinlich dass Spiel gar nicht gewinnen will grundsätzlich sollst du deine ADCs auch safen aber sie auch unterstützen mit Dmg oder eben mit Stuns, roots, oder anderen Kram, dass sieht Riots Prinzip vor\n\nIch finde nicht, dass man als Supporter den ADC direkt unterstützen/beschützen muss. Man soll die Botlane gewinnen, dass geht aber auch anders.","replies":[{"poster":"Cenâreth","date":"2018-08-09T08:59:48.858+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CGI tombtomb,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=0001000000000000,timestamp=2018-08-07T23:08:58.371+0000)\n>\n> Ich finde nicht, dass man als Supporter den ADC direkt unterstützen/beschützen muss. Man soll die Botlane gewinnen, dass geht aber auch anders.\n\nNa dann kann ich ja demnächst auf die top roamen und dort aushelfen, wenn deiner Meinung nach der Supp nicht auf der Bot supporten soll.","replies":[{"poster":"VIP tombtomb","date":"2018-08-09T09:34:04.278+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=00010000000000000001,timestamp=2018-08-09T08:59:48.858+0000)\n>\n> Na dann kann ich ja demnächst auf die top roamen und dort aushelfen, wenn deiner Meinung nach der Supp nicht auf der Bot supporten soll.\n\nNaja, wenn du richtig lesen würdest, würde dir auffallen, dass etwas ganz anderes geschrieben habe. Ich meinte, dass man den ADC durchaus mal opfern kann um overall besser da zu stehen. Es muss nicht das Ziel des Supporters sein, dem ADC den hintern abzuwischen, gibt schließlich genug andere Rollen, die auch mit DMG carrien können. \nRoaming ist zudem jetzt bei aller Liebe nichts ungewöhnliches...","replies":[]}]},{"poster":"Rv Sabo","date":"2018-08-08T10:48:42.876+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CGI tombtomb,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=0001000000000000,timestamp=2018-08-07T23:08:58.371+0000)\n>\n> Ich finde nicht, dass man als Supporter den ADC direkt unterstützen/beschützen muss. Man soll die Botlane gewinnen, dass geht aber auch anders.\n\nDu musst auch den Adc nicht direkt supporten wenn er es nicht nötig hat oder es besser für dass Team ist wenn der Adc stirbt dafür dass Team gewinnt. Jedoch weiß kein Supporter mehr wie man einen Marksman gegen Assasinen beschützt. Liegt wahrscheinlich an den Dmg Supportern die nur Dmg machen können jedoch nicht peelen. \n\nJedenfalls finde ich dass es positiv wäre wennman Adcs so ändert dass sie weniger auf andere Spieler angewiesen sind. Weniger tilt weniger flame...","replies":[{"poster":"Cenâreth","date":"2018-08-09T09:00:27.590+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JG Guntwin,realm=EUW,application-id=Wj1wcocU,discussion-id=ozhKEtXn,comment-id=00010000000000000000,timestamp=2018-08-08T10:48:42.876+0000)\n>\n> Du musst auch den Adc nicht direkt supporten wenn er es nicht nötig hat oder es besser für dass Team ist wenn der Adc stirbt dafür dass Team gewinnt. Jedoch weiß kein Supporter mehr wie man einen Marksman gegen Assasinen beschützt. Liegt wahrscheinlich an den Dmg Supportern die nur Dmg machen können jedoch nicht peelen. \n> \n> Jedenfalls finde ich dass es positiv wäre wennman Adcs so ändert dass sie weniger auf andere Spieler angewiesen sind. Weniger tilt weniger flame...\n\nDa wäre der Patch zuvor optimal gewesen.","replies":[]}]}]}]}]}]},{"poster":"OPChampsSucks","date":"2018-08-07T23:00:39.313+0000","up_votes":2,"down_votes":2,"body":"Ist halt ein Thema das mich persönlich sehr interessiert aber wo ich mir selbst uneinig bin.\n\nEinerseits finde ich Autofill super.\n\nMan lernt dadurch jede andere Rolle potenziell zu spielen, man lernt sich anzupassen , ggf lernt man dadurch besser mit seinem Team zu kommunizieren sobald man nicht in einer Elo mit IQ-200 ist.\n\nAndererseits wird man dadurch unter anderem zu einer stark gewichtigen Rolle die wenn sie nicht gespielt werden kann das spiel alleine verlieren könnte. was dann mit flame reports usw zusammenhängen könnte.  Ich selber hatte als ich das 1. mal autofill adc als support main war am Ende einen score von 1:23 oder 24 glaube ich. Natürlich war das absolut my bad und ich habe mich so hart bei meinem Team entschuldigt einfach weil ich das Game zu 900% solo verloren habe. \n\nIch finde aber das diese Erfahrungen wertvoll und notwendig sind. Ich hab dadurch gesehen das ich eigentlich überhaupt keine Ahnung von League of Legends hatte sofern es zu schwierigen Situationen kommt wo entscheidungen gefragt sind.  Und nach und nach hat man sich auch in diesen Rollen einfach immer mehr und mehr verbessert.  Ich finde auch einfach das Spieler die das Ziel haben besser werden zu wollen sprich Ranglisten-Games spielen sich mit autofill abfinden sollten. Ein guter Spieler spielt auf gleichem Niveau egal ob er nun supporter oder Adc oder Midlaner spielt. Er passt sich einfach dem Match entsprechend an kann diese unerfahrenheit auf der Lane aber einfach durch generell sehr starkes Gameplay trotzdem weiterhin ausgleichen. Ich erwarte sogar eigentlich das jeder Gold 5+ Spieler mindestens 3 Positionen spielen kann und alles über Plat 5 alle Positionen spielen können sollte und deswegen finde ich das Autofill-System eigentlich sogar recht profitabel. Viele leute sehen immer nur die Schattenseite und zwar ein entsprechend schwierigeres Match , sehen aber die Vorteile nicht. Man sollte sich mehr Gedanken dazu machen wie wertvoll so ein System fürs spielerische Können eigentlich sein kann.\n\nIch selbst habe dadurch mittlerweile 4 Positionen statt ursprünglich eine die ich fast vollständig beherrsche. Bei adc haperts trotzdem ein wenig da mein Game laggt beim kiten aber ansonsten könnte ich vllt sogar mittlerweile alle 5 Positionen abdecken. \n\nEin weiterer Vorteil ist durch dieses breite spektrum einfach auch das du leuten anbieten kannst eine Rolle zu übernehmen die entsprechende Spieler nicht können weil diese zb ebenfalls autofill sind. So etwas finde ich einfach extrem wichtig und das stärkt auch einfach die Kommunikation im Team selber.\n\nWenn du bereits in der Champselect mit deinem Team über Autofill-Positionen traden kannst dann wirst du das Game mit hoher Wahrscheinlichkeit gewinnen weil die Kommunikation einfach spitze ist und bis Dia 5 gewinnt die Kommunikation im Team locker in 80% der Games.\n\n\nDa ich aber vom Thema abweiche und worum es dir eigentlich geht:\n\nJa als supporter ist das leben schon schwer .. autofill adc´s sind keine schöne Sache aber auch hier ist es für mich das gleiche: Mach das beste aus der Situation, Nutze deinen Nachteil zu deinem Vorteil. Klingt paradox funktioniert aber. Nimm ein schwieriges match entgegen und verbessere so deine Entscheidungen. Du wirst immer ungewöhnlichere aber wertvollere Entscheidungen treffen und dein Team auf kurz oder lang häufig zum Sieg führen. Das ist auch einfach absolut notwendig um sich zu verbessern.\n\nJedes Game kann man nunmal nicht gewinnen das ist völlig normal aber man kann trotzdem viel aus den Games mitnehmen.","replies":[{"poster":"Yoda1285","date":"2018-08-08T03:32:31.778+0000","up_votes":1,"down_votes":0,"body":"Ich habe noch einmal darüber nachgedacht.\n\n- Es ist sicher wichtig auch die verschiedenen Rollen kennen zu lernen, aber ich bin mir nicht sicher ob dies im Ranglistenmodus der Fall sein muss. Wenn wir das ganze mal als ernsthaften E-Sport sehen, dann ist sicher auf dem 'Spielfeld' nicht der richtige Platz um mal etwas ganz neues zu testen. Dafür gibt es den Trainingsplatz!\n\n- Ich habe schon häufiger vorgeschlagen den Ranglistenmodus Personenbezogen zu machen oder dafür eine eigene Rangliste zu erschaffen. Jeder kann sich mit seinem Namen registrieren und hat einen Account für die Liga. Keine Smurfs mehr etc.. Das würde vieles angenehmer machen in meinen Augen, da es mehr Ernst in die Sache bringt.\n\n- Das Spiel unterliegt so vielen Veränderungen, dass es sogar für sogenannte 'One-Tricks' immer neue Dinge gibt. Ich sehe nichts verwerfliches daran nur einen Champion zu spielen. Es mag sogar Vorteile haben die vielen verschiedenen Match-Up's zu studieren und seine Spielweise mit dem einen Champion zu perfektionieren.","replies":[]},{"poster":"Yoda1285","date":"2018-08-08T01:03:06.883+0000","up_votes":1,"down_votes":0,"body":"Ist ein streitbares Thema, aber deine Antwort finde ich sehr gut.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Send Νudes","date":"2018-08-07T21:52:28.064+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Yoda1285","date":"2018-08-07T22:33:45.528+0000","up_votes":1,"down_votes":0,"body":"Ich denke nicht, dass es gute und schlechte Rollen gibt. Jeder kann die Rolle und den Champ finden den er mag.","replies":[]}]},{"poster":"Cenâreth","date":"2018-08-07T21:20:35.039+0000","up_votes":1,"down_votes":0,"body":"Glaub mir dass wird sich nächstes Jahr mit dem neuen Ranked System auch nicht ändern. Dass liegt nicht daran dass die Leute autofilled sind, sie wollen sich einfach nicht verbessern. Ich habe heute 4 Spiele gehabt  davon einen, der nicht Support spielen wollte, der meinte er würde lieber Mid oder Top spielen im Ranked, Moral der Story der konnte nicht mal Annie ordentlich in der Mitte spielen und hat so dermaßen reingeinted dass wir nicht mal auf der Botlane carryen konnten.\n\nIch hab an Riots Umfrage teilgenommen, ich weiß dass ich dass was ich dort als Feedback zurückgegeben habe sicher nicht kommen wird, oder sich was überlegt wird.\n\nIst schon schlimm genug wenn wieder NS Wiederbetätigung im Spiel auftaucht ob im Chat oder im Namen.","replies":[]}]}