{"poster":"Pretty Dhizi","date":"2015-07-10T05:33:03.957+0000","title":"Petition to remove Sated Devourer and return its prior status until it is BALANCED.","subforum":"Gameplay","up_votes":191,"down_votes":73,"body":"Just something I&#039;m wanting to get out, but these constant introductions of items that damage the gameplay for others, both in ranked, and normal matches, are just really starting to get a little out of hand. Sated Devourer in its current state should&#039;ve never been removed from the PBE, Riot should&#039;ve learned their mistake with its prior item. Currently, the Sated Devourer is...Let&#039;s be honest, making certain champions far more destructive than they should be -- Udyr, Yi, Shyvana, Jax, Nocturne, and quite a few others. For all that I can imagine, Sated Devourer should&#039;ve been kept in the PBE for another cycle to make sure it was actually HEALTHY..It is not, at all. For a Yi to be able to do 400 true damage in a second? Jax to land 2 empowered strikes in one second? The list does generally go on. But this item brings a lot of issues. With the ban-limit set to 3, a large portion of champions that can abuse the item are still left remaining, even when 6 bans can occur..There are a lot of choices a player can make -- you can&#039;t always ban those 6 sole champions forever. \n\nBut the issue is, Sated in its current state is so unbelievably broken, there is no reason NOT to abuse it and use it ranked play for a free win. It&#039;s literally freelo in a sense. The passive it provides gives a small range of champions full control and unlimited dominance in almost all situations. Most tend to couple it with Blade of the Ruined King for even MORE, benefit -- which further shows how quickly this item was rushed out. I participated in the PBE during the time it was introduced, and the times it was present, it was always the most unhealthy item i&#039;ve seen in a year now. This item is not yet balanced, fair, nor well-placed in its current state.\n\nI&#039;d like to petition that Sated Devourer be reverted to its prior state, removed from the current-live patch, and returned to the PBE for further, DEEPER, more logical balancing. \n\nSo I&#039;d just like the communities opinion. Do you Find that the item Sated Devourer is balanced? Do you think it should be reverted to its prior state until it is balanced properly? Or do you think it&#039;s healthy, and that it is completely fair and appropriate to be used in its current state?\n\nIf you vote, please explain why and what you voted for!\n\nP.S. -- If you vote the 'Why? Devourer is Healthy.' option without explaining why, I/the community will assume you're a Jax/Yi/Udyr freelo padder who doesn't want the OP item taken away even though it's destructive to gameplay.","replies":[{"poster":"Neo Cyrus","date":"2015-07-10T07:05:27.632+0000","up_votes":22,"down_votes":3,"body":"Trust me when I tell you that they do NOT listen to PBE feedback at all. That's why shit like this gets through every fucking time.","replies":[{"poster":"Kingsgrave","date":"2015-07-10T12:19:05.027+0000","up_votes":7,"down_votes":14,"body":"> [{quoted}](name=Neo Cyrus,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0006,timestamp=2015-07-10T07:05:27.632+0000)\n>\n> Trust me when I tell you that they do NOT listen to PBE feedback at all. That's why shit like this gets through every fucking time.\n\nWhy would they? Changes aren't put on there for feedback purposes. Why would they care what 1-2% of the playerbase thinks about changes?","replies":[{"poster":"Neo Cyrus","date":"2015-07-10T13:18:37.816+0000","up_votes":9,"down_votes":13,"body":"I've never seen you post something that wasn't derpy.","replies":[{"poster":"Angry Monster","date":"2015-07-10T13:25:11.894+0000","up_votes":6,"down_votes":10,"body":"HE(CynicalGiant ) is right the PBE is bug testing. Not to listen to player feed back on balance. Riot has said many times player feed back is never used for balance feed back.","replies":[{"poster":"Neo Cyrus","date":"2015-07-10T13:28:36.826+0000","up_votes":23,"down_votes":1,"body":"When the overwhelming majority tell you it's insanity, it's probably a good idea to check it out.","replies":[{"poster":"Myozthirirn","date":"2015-07-10T20:51:01.092+0000","up_votes":6,"down_votes":10,"body":"And when the overwhelming majority is wrong 90% of the time you stop listening.\nBecause face it, the comunity cries for almost everything.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T20:56:24.189+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Myozthirirn,realm=EUW,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=000600010000000000000001,timestamp=2015-07-10T20:51:01.092+0000)\n>\n> And when the overwhelming majority is wrong 90% of the time you stop listening.\n> Because face it, the comunity cries for almost everything.\n\nI dunno. Can you REALLY disvalue Yi doing 400 true damage at level 6 in 1 second?","replies":[{"poster":"Partholonian","date":"2015-07-11T00:48:36.441+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0006000100000000000000010000,timestamp=2015-07-10T20:56:24.189+0000)\n>\n> I dunno. Can you REALLY disvalue Yi doing 400 true damage at level 6 in 1 second?\n\nHe would need something like 800 bonus AD to do that.  Assuming his passive is up (i.e. he got to build it and then jump you within 4 seconds), he will get one regular attack, one from his passive and one from Phantom Hit (he can't proc Phantom Hit on both swings).  At level 6 he has at most 3 ranks, so that's 60 + 45% bonus AD.\n\nAnd that's if you can actually finish a sated devourer at level 6, which I pretty strongly doubt.  There aren't going to be more than two dragons that early, so even if you get them both, that still leaves what, 30 camps?  Do they even respawn that fast?\n\nAt level 9 with rank 5 Wuju Style, it'll be 90 + 60% AD, to get that to 400 would take \"only\" 500 bonus AD from the four slots that aren't devourer or boots.  This is if you don't mind being made of paper, of course.  And if you reach full build at level 9 -- I think that qualifies as ridiculously fed.","replies":[{"poster":"Fancifulfire","date":"2015-11-08T23:02:51.999+0000","up_votes":1,"down_votes":0,"body":"It's not even that. It's the fact that since without sated, he can land 3 basics for a double basic, then it's every other basic, but with sated dev since during the double attack, the second attack still counts toward another. With phantom strike you will basic twice, then double basic every attack, he can land faster basics than anyone in the game, his ult gives him insane move speed and attack speed. Not to mention the fact that his q is an untargetable teleport that in which it's cooldown is reduced every basic, and when you double basic every attack you make you can reduce the cooldown to nearly nothing, you'll become an untargetable menace that constantly drops the entire enemy team with no chance for them to escape since you can't be slowed which is like 70% of the entire champion roster's cc. So you can infinitely chase with q, ult to move insanely fast to catch up if you get caught in some form of stun or snare. Either they nerf dev, or remove it entirely, I'd prefer they remove it but, eh. My opinion. The point is it's TOO strong.","replies":[]}]}]}]}]}]}]}]},{"poster":"Pretty Dhizi","date":"2015-07-10T07:06:24.664+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Neo Cyrus,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0006,timestamp=2015-07-10T07:05:27.632+0000)\n>\n> Trust me when I tell you that they do NOT listen to PBE feedback at all. That's why shit like this gets through every fucking time.\n\nOh yeah, i'm aware. I've been active in the PBE for a year-half now, and they never listen to anyone. It's downright pathetic that they're so clueless at times.","replies":[]}]},{"poster":"KVbqbFsC8e","date":"2015-07-10T06:56:53.278+0000","up_votes":16,"down_votes":3,"body":"I voted yes. This shouldn't even be a question.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T06:59:34.632+0000","up_votes":4,"down_votes":8,"body":"> [{quoted}](name=The Big Piece,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0005,timestamp=2015-07-10T06:56:53.278+0000)\n>\n> I voted yes. This shouldn't even be a question.\n\nMhm. That's my opinion. As usual, Riot didn't listen to their PBE community, and pushed out something that wasn't close to ready..","replies":[{"poster":"Kuroi86","date":"2015-07-10T20:36:26.079+0000","up_votes":3,"down_votes":0,"body":"Common mistake people make.\nPBE is for trying to find bugs, not for balancing.\nAnd no, not even PBE can find all of them.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T20:40:34.103+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=000500000000,timestamp=2015-07-10T20:36:26.079+0000)\n>\n> Common mistake people make.\n> PBE is for trying to find bugs, not for balancing.\n> And no, not even PBE can find all of them.\n\nPBE SHOULD, be used, for balancing. It's the perfect environment to DO so. There isn't anything stopping them from using it for both bugchasing AND balancing.","replies":[{"poster":"Partholonian","date":"2015-07-11T00:52:21.689+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0005000000000000,timestamp=2015-07-10T20:40:34.103+0000)\n>\n> PBE SHOULD, be used, for balancing. It's the perfect environment to DO so. \n\nNo, it isn't.  There's like 0.1% of the playerbase or less, and most of those are farting around on champions they don't even know or trying experimental builds.  It's nearly useless for balance information.\n\nEven the first week after a patch on *live* isn't that great for balance information: people don't know yet how to react to Devourer users, punish hard-farming, how much to respect the Devourer once it comes out, etc.","replies":[]}]}]}]}]},{"poster":"Rogue of Time","date":"2015-07-10T08:30:44.497+0000","up_votes":10,"down_votes":0,"body":"This item basically pushes champs that were previously not very viable (on-hit Diana, Phoenix Udyr, etc.) into a viable state in terms of competitive builds, but it unfortunately takes characters that were already viable (Xin Zhao, Shyvana, Master Yi, Kayle) and pushes them to ridiculously overpowered states with ONE item. Combine it with the fact that it stacks with Blade of the Ruined King's on-hit effect and it basically makes the game unplayable for anyone going against an on-hit champ without using an on-hit champ themselves. I'm hoping to never see a Vayne carrying a Blade of the Ruined King and a Sated Devourer down bot lane anytime soon!\n\nEDIT: A better way to help the characters that are not viable is to simply push them to viability by adjusting their on-hit effect to make them a lot better. For example, making Diana's passive or Udyr's Phoenix proc after every two hits once they hit a certain rank or hit a certain level. That would limit early game power so they're not unbalanced but keep the characters that are already competitive balanced. On-hit champs need help to be viable at this moment, but this is not the way to do it.","replies":[]},{"poster":"Packun Flower","date":"2015-07-10T05:33:19.184+0000","up_votes":13,"down_votes":3,"body":"Signed. This item should have never ever been allowed to hit live server.","replies":[]},{"poster":"Lt Streko","date":"2015-07-10T12:18:36.544+0000","up_votes":10,"down_votes":3,"body":"I can't even enjoy league anymore because of sated. I'm actually putting the game down until it's removed/fixed.","replies":[{"poster":"Curl0","date":"2015-07-12T00:23:54.393+0000","up_votes":2,"down_votes":0,"body":"Totally agree with you and I think I might do the same... the last few games I was playing (trying out Tahm) were horrible.. We either won super easy because jungle carried.. or the opposite team did so and yea.. but the majority of the games I just lost.. no matter how good we played to be honest.. It's just unhealthy.. no fun.  All my games literally ended up by one team having an EXTREME power spike.. there just are no exciting team fights or whatsoever because they usually end in like 2 seconds being aced by the jungler..    In short:  I just can't enjoy playing with that Item being ingame.\n\nEdit: Wanted to add that the fact that I literally played all my games with teams consisting of Shyvana, Yi, Vayne or Kayle does not contribute to the game being more fun....  much diversity ...","replies":[]},{"poster":"The A lister","date":"2015-07-11T02:48:22.275+0000","up_votes":2,"down_votes":2,"body":"I disagree with this and i tell you why Cinderhulk was an op item when it first came out. Warrior before that while the ap jg item was a fail for jgers themselves I think its time to give some love to farming jgers. And anyways the item will get nerfed next patch.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-11T03:02:15.484+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=The A lister,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=000c0000,timestamp=2015-07-11T02:48:22.275+0000)\n>\n> I disagree with this and i tell you why Cinderhulk was an op item when it first came out. Warrior before that while the ap jg item was a fail for jgers themselves I think its time to give some love to farming jgers. And anyways the item will get nerfed next patch.\n\nThat's horrible logic. For an item to repeat a trend of failure and stupidity and for you to agree that it should, is stupid. The AP item had 20% CDR and a large chunk of AP..How is that a failure? That's a huge assist for many champions. 20% cooldown items are rare lately.","replies":[]}]}]},{"poster":"Eldem","date":"2015-07-10T08:05:22.199+0000","up_votes":10,"down_votes":18,"body":"I think moronic polls like this and other threads calling for champs or items to be deleted or nerfed into the stone age is exactly why Riot should not listen to this forum and rarely to its community. Everyone here claims to want diversity and bitched about the meta. But as soon as something that comes out which is new, buffs a previously lackluster play style, or forces you to adapt how you play the whole community bitches and moans and claims for instant nerfs or removal. \n\nPersonally I feel anyone who says the phrases remove, or toxic game play should lose any ability to put forth input.","replies":[{"poster":"101100111000","date":"2015-07-10T08:07:17.545+0000","up_votes":10,"down_votes":0,"body":"There's a difference between buffing a new playstyling into viability, and buffing it into oppressiveness.","replies":[{"poster":"Eldem","date":"2015-07-10T08:13:44.083+0000","up_votes":3,"down_votes":20,"body":"> [{quoted}](name=AtrocityEyes,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=00080000,timestamp=2015-07-10T08:07:17.545+0000)\n>\n> There's a difference between buffing a new playstyling into viability, and buffing it into oppressiveness.\n\nIts not oppressive, you all claim literally every thing which is released is oppresive","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T08:43:49.032+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Eldem,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=000800000000,timestamp=2015-07-10T08:13:44.083+0000)\n>\n> Its not oppressive, you all claim literally every thing which is released is oppresive\n\n400 true damage in 1 second is oppressive. This is Yi with Sated Devourer and his Wuju style activated.\n\n410 true damage in 5 seconds is not oppressive. This is Ignite at level 18.\n\nSee what we're getting at?","replies":[{"poster":"IS1a442cd69a169ed293a39","date":"2015-07-10T14:27:36.105+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0008000000000000,timestamp=2015-07-10T08:43:49.032+0000)\n>\n> 400 true damage in 1 second is oppressive. This is Yi with Sated Devourer and his Wuju style activated.\n> \n> 410 true damage in 5 seconds is not oppressive. This is Ignite at level 18.\n> \n> See what we're getting at?\n\nTo be honest, AD can do more than that 1 second late game, but I can see your point.","replies":[{"poster":"Anidan","date":"2015-07-10T17:20:12.903+0000","up_votes":2,"down_votes":0,"body":"In fairness, he's also AD so he's doing pretty hefty physical damage on top of that. The item is pretty crazy on him. People called it that it'd be ridiculous as soon as the item was proposed. It might actually be _too_ strong on the people it's meant to benefit. On the brightside, that means it can be toned down, such as double strike every 3-5 strikes instead every other or something that isn't this fast.\n\nThe idea isn't broken, but the implementation was. Every other hit is pretty damn strong.","replies":[]}]}]}]}]}]},{"poster":"Crossette","date":"2015-07-10T08:47:11.363+0000","up_votes":5,"down_votes":0,"body":"Vayne procs her W once every 2 basic attacks.\n\nThat's fucking stupid.","replies":[]},{"poster":"Immp","date":"2015-07-10T16:20:24.321+0000","up_votes":6,"down_votes":1,"body":"I said no, because they are tweaking all the jungle items, and I am sick of seeing {{item:3709}}{{item:3717}}{{item:3721}}{{item:3725}} on everyone, the jungle needs some diversity. But really it is not like riot will change this item because of this thread. Like be logical. But nice idea and I do think the item needs a slight nerf.","replies":[{"poster":"Lt Streko","date":"2015-07-11T05:22:34.774+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SwordsOfDeath,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0018,timestamp=2015-07-10T16:20:24.321+0000)\n>\n> I said no, because they are tweaking all the jungle items, and I am sick of seeing {{item:3709}}{{item:3717}}{{item:3721}}{{item:3725}} on everyone, the jungle needs some diversity. But really it is not like riot will change this item because of this thread. Like be logical. But nice idea and I do think the item needs a slight nerf.\n\nPeople use poachers?","replies":[{"poster":"Immp","date":"2015-07-12T00:28:15.063+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lt Streko,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=00180001,timestamp=2015-07-11T05:22:34.774+0000)\n>\n> People use poachers?\n\nYes the one percent, mostly olafs","replies":[{"poster":"Lt Streko","date":"2015-07-12T06:09:59.864+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SwordsOfDeath,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=001800010000,timestamp=2015-07-12T00:28:15.063+0000)\n>\n> Yes the one percent, mostly olafs\n\nPeople use olaf?","replies":[]}]}]}]},{"poster":"Hissael","date":"2015-07-10T23:24:19.290+0000","up_votes":4,"down_votes":0,"body":"It's not broken, it is completely out of this world. This item is the most frustrating item I've seen in a while. It's just stupid, and needs to be reworked immediately.","replies":[]},{"poster":"HotN1ps","date":"2015-07-27T19:50:48.748+0000","up_votes":3,"down_votes":0,"body":"Voted Yes\n\nI've been on too many teams that out scaled, out played, and took all our primary objectives; only to have an opponent get \"sated\" and faceroll roll our entire team without even trying.  I'm personally not bothering with soloque until Riot, fixes it or just takes it out completely. Doesn't seem to matter how far ahead you are either.  No amount of Attack speed reduction seems to help.","replies":[]},{"poster":"Hitchhiker007","date":"2015-07-10T20:59:47.268+0000","up_votes":3,"down_votes":0,"body":"This situation is just like Feral Flare all over again. The deep problem that Feral Flare and Devourer have in common (despite it's promotion of unhealthy team mechanics, i.e. farming the jungle constantly without minding for your team) is that it severely lacks counter-play. Devourer is supposed to be used by auto-attacking junglers, but I'm not sure that Riot expected all the consequences of the mechanics that are involved with it. It is a problem that urgently needs to be fixed.","replies":[]},{"poster":"M Schumacher","date":"2015-07-10T16:13:43.555+0000","up_votes":3,"down_votes":0,"body":"We told Riot it was broken when it was first put on the PBE. What did they do? Ignore feedback like they ALWAYS do.","replies":[]},{"poster":"Brightnite","date":"2015-07-10T20:54:58.393+0000","up_votes":4,"down_votes":3,"body":"I voted no, if they never see the item work with the majority of players how are they gonna know if its balanced or not? statistics generally works better when you have a higher pool of numbers. Once they see how it affects it they will balance it accordingly. Sure right now that a lot of people use it SD could seem broken but... what matters is how it does once people counter it. I honestly think it could bring a healthier array of gameplay forcing people to do things they never do like early aggressive wards, counter jungling, things of the sort. Instead of the game always being the same laning phase > gank > do this do that > group > win type of deal.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T21:01:40.684+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=Brightnite,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0021,timestamp=2015-07-10T20:54:58.393+0000)\n>\n> I voted no, if they never see the item work with the majority of players how are they gonna know if its balanced or not? statistics generally works better when you have a higher pool of numbers. Once they see how it affects it they will balance it accordingly. Sure right now that a lot of people use it SD could seem broken but... what matters is how it does once people counter it. I honestly think it could bring a healthier array of gameplay forcing people to do things they never do like early aggressive wards, counter jungling, things of the sort. Instead of the game always being the same laning phase > gank > do this do that > group > win type of deal.\n\nSo..Basically it's..\n\nEnemy picks Jungle Yi/Udyr/Jax\nEveryone knows they're going to build an item that power spikes them to unbeatable games after 30 stacks\nBest win this game in 15 minutes which is **_DEFINITELY_** a feasible amount of time to win, right?\nOh no, we didn't win in 15, now he has the power spike that seals the game for us since we couldn't harass him in jungle enough.\nHis wins via scaling bonuses thanks to a sole item.\n\nI wouldn't call that 'healthy' since it's a _**FORCED **_ response to an item purchase.","replies":[{"poster":"Brightnite","date":"2015-07-10T21:13:13.525+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=00210000,timestamp=2015-07-10T21:01:40.684+0000)\n>\n> So..Basically it's..\n> \n> Enemy picks Jungle Yi/Udyr/Jax\n> Everyone knows they're going to build an item that power spikes them to unbeatable games after 30 stacks\n> Best win this game in 15 minutes which is **_DEFINITELY_** a feasible amount of time to win, right?\n> Oh no, we didn't win in 15, now he has the power spike that seals the game for us since we couldn't harass him in jungle enough.\n> His wins via scaling bonuses thanks to a sole item.\n> \n> I wouldn't call that 'healthy' since it's a _**FORCED **_ response to an item purchase.\n\nbecause other champions dont force you to do things? and what champion can stack a full SD in 15 minutes while being harassed? Besides that you respond to different things in different ways. Bot lane got fed? your sort of forced to build armor or get deleted. Kat got fed? build MR. Its all about actions and reactions. that item actually works out against udyr/jax/yi cause now they are more dependent on farming or doing ganks or falling behind further. Its hard to solo carry a game as a 1 vs 5 cause the enemy rek sai snowballed every lane. SD can be beaten just have to figure out a reliable way of doing it. The item is strong atm but it will get balanced soon, but if its never used how is riot gonna know how to balance it? how are they gonna know what its actual effect is?","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T21:40:54.933+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Brightnite,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=002100000000,timestamp=2015-07-10T21:13:13.525+0000)\n>\n> because other champions dont force you to do things? and what champion can stack a full SD in 15 minutes while being harassed? Besides that you respond to different things in different ways. Bot lane got fed? your sort of forced to build armor or get deleted. Kat got fed? build MR. Its all about actions and reactions. that item actually works out against udyr/jax/yi cause now they are more dependent on farming or doing ganks or falling behind further. Its hard to solo carry a game as a 1 vs 5 cause the enemy rek sai snowballed every lane. SD can be beaten just have to figure out a reliable way of doing it. The item is strong atm but it will get balanced soon, but if its never used how is riot gonna know how to balance it? how are they gonna know what its actual effect is?\n\nIt's strong currently because of a very sole reason -- double proccing on-hits without diminishing returns is critically overkill. Yi's got his Q on a 1 second cooldown when he gets sated because it resets his alpha strike each time he double-strikes. Udyr gets more on-hit damage and coupled with that, if he starts with a stun, he can quickly go pheonix and throw out 3 strikes (which has to only be 2 with sated) to chunk away a large portion of health, and can rapidly do this in quick succession because of his high movement speed. Past that, he's also innately tanky and can stick to a person like glue. Jax completes sated and can outduel any champion facing against him that is attack-reliant, the only people that have a smidget of a chance against him are mostly AP casters, long-range casters, or extremely kite-requiring carries like Vayne, Kalista, etc.\n\nI don't think an ITEM should set rules for engagement. Champion kits should, that's how you identify/know how to play against them. One item changing how you approach a champion..Is a little busted, right? This is only my opinion though. And 15 minutes was just an exaggeration. More realistically, it's 20-25 depending on dragon control and scuttle crabs + ganking efficiency -- and you have to admit, the era of invading jungle? It's long dead and gone. No one uses poachers blade, no one takes that type of risk of invading because it rarely pays off, and there is a VERY SMALL pool of champions who can do it successfully. AKA, Lee Sin, Udyr, Nunu, and so on. So honestly, 15 minutes is a good possibility since Yi/Jax/Udyr/Nocturne have GREAT camp clearing speeds! Let alone the fact that they ALL gank amazingly well, and all have superb dragon/objective control due to their mobility and effective damage.\n\nPBE tried to beat Sated Devourer. Live servers are now trying to beat it. And the issue is? It's not an item that can be beaten because it's past the levels of broken -- more so than feral flare was. At LEAST in its current state, it is broken. There have been over (I can bet/promise) 5000+ games played where Sated Devourer has been used, and most have most likely resulted in losses for the team that didn't have the item, because it gives champions utmost dominance in duels, objective control, and sustain -- since it's most often coupled with BoTR. \n\nIf invading was a feasible option, i'd definitely recommend it. But when all it does is prolong the inevitable, what's the point? All you can rely on is an early, lackluster win, or losing after 40 minutes of fighting all because one guy can destroy most of the team because he's dealing double to triple his average damage output he has naturally with a build excluding Sated Devourer.","replies":[{"poster":"Brightnite","date":"2015-07-10T21:58:02.578+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0021000000000000,timestamp=2015-07-10T21:40:54.933+0000)\n>\n> It's strong currently because of a very sole reason -- double proccing on-hits without diminishing returns is critically overkill. Yi's got his Q on a 1 second cooldown when he gets sated because it resets his alpha strike each time he double-strikes. Udyr gets more on-hit damage and coupled with that, if he starts with a stun, he can quickly go pheonix and throw out 3 strikes (which has to only be 2 with sated) to chunk away a large portion of health, and can rapidly do this in quick succession because of his high movement speed. Past that, he's also innately tanky and can stick to a person like glue. Jax completes sated and can outduel any champion facing against him that is attack-reliant, the only people that have a smidget of a chance against him are mostly AP casters, long-range casters, or extremely kite-requiring carries like Vayne, Kalista, etc.\n> \n> I don't think an ITEM should set rules for engagement. Champion kits should, that's how you identify/know how to play against them. One item changing how you approach a champion..Is a little busted, right? This is only my opinion though. And 15 minutes was just an exaggeration. More realistically, it's 20-25 depending on dragon control and scuttle crabs + ganking efficiency -- and you have to admit, the era of invading jungle? It's long dead and gone. No one uses poachers blade, no one takes that type of risk of invading because it rarely pays off, and there is a VERY SMALL pool of champions who can do it successfully. AKA, Lee Sin, Udyr, Nunu, and so on. So honestly, 15 minutes is a good possibility since Yi/Jax/Udyr/Nocturne have GREAT camp clearing speeds! Let alone the fact that they ALL gank amazingly well, and all have superb dragon/objective control due to their mobility and effective damage.\n> \n> PBE tried to beat Sated Devourer. Live servers are now trying to beat it. And the issue is? It's not an item that can be beaten because it's past the levels of broken -- more so than feral flare was. At LEAST in its current state, it is broken. There have been over (I can bet/promise) 5000+ games played where Sated Devourer has been used, and most have most likely resulted in losses for the team that didn't have the item, because it gives champions utmost dominance in duels, objective control, and sustain -- since it's most often coupled with BoTR. \n> \n> If invading was a feasible option, i'd definitely recommend it. But when all it does is prolong the inevitable, what's the point? All you can rely on is an early, lackluster win, or losing after 40 minutes of fighting all because one guy can destroy most of the team because he's dealing double to triple his average damage output he has naturally with a build excluding Sated Devourer.\n\nTo all that i say.... so the item is strong.... im not saying its not. But! should it get deleted and sent back to the PBE because of that? PBE player base is a lot smaller than all the servers player bases. To show how strong this item is it needs to be tested and thats what riot is doing. If its just deleted and sent back to the PBE how are they gonna know how to balance it? They need numbers and figures to see how its interacting with everything else. how do massive early game powerhouses hold up against it? how do late game beasts do against people with it? They need to know those interactions to balance it.\n\n Was Ekko balanced when he came out? Not very well..... no mana ult... passive was way to strong early game... he had too much burst for the insane amount of things his kit allowed. But even so people learned to play against it. in time riot saw where to cut things down and how to reduce his power to make him a lot more manageable. Thats what i feel is gonna happen within a week or two of SD being released, but if they just remove it... how would they ever get the information to balance it?\n\nAs an aside, i might be a bit biased. Personally i like the item because its opening up doors to jungling for junglers who didnt appear at all before. Dev was basically the worst jungle item there was. CH beat out everything to the point where even yi jungles would take it. Runeglaive became strong enough to compete for certain pics. Warrior had people who took it sometimes but.... Dev was just hardly picked up. Sure it was a good late game item but it forced you to ignore a lot of your team for most of the match. It just had no incentive to get you to do anything other than farm. So even though i feel the items strong and needs rebalancing im happy its at least being used after a half year of not being touched lol.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T22:07:46.761+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Brightnite,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=00210000000000000000,timestamp=2015-07-10T21:58:02.578+0000)\n>\n> To all that i say.... so the item is strong.... im not saying its not. But! should it get deleted and sent back to the PBE because of that? PBE player base is a lot smaller than all the servers player bases. To show how strong this item is it needs to be tested and thats what riot is doing. If its just deleted and sent back to the PBE how are they gonna know how to balance it? They need numbers and figures to see how its interacting with everything else. how do massive early game powerhouses hold up against it? how do late game beasts do against people with it? They need to know those interactions to balance it.\n> \n>  Was Ekko balanced when he came out? Not very well..... no mana ult... passive was way to strong early game... he had too much burst for the insane amount of things his kit allowed. But even so people learned to play against it. in time riot saw where to cut things down and how to reduce his power to make him a lot more manageable. Thats what i feel is gonna happen within a week or two of SD being released, but if they just remove it... how would they ever get the information to balance it?\n> \n> As an aside, i might be a bit biased. Personally i like the item because its opening up doors to jungling for junglers who didnt appear at all before. Dev was basically the worst jungle item there was. CH beat out everything to the point where even yi jungles would take it. Runeglaive became strong enough to compete for certain pics. Warrior had people who took it sometimes but.... Dev was just hardly picked up. Sure it was a good late game item but it forced you to ignore a lot of your team for most of the match. It just had no incentive to get you to do anything other than farm. So even though i feel the items strong and needs rebalancing im happy its at least being used after a half year of not being touched lol.\n\nAgain, I didn't say 'delete'. Reverted, and stepped back once until it can be tested/balanced further in PBE. Even though PBE playerbase is smaller, you get all the help you can there, even though the communities opinions are most often ignored. \n\nhow do early powerhouses fight it? they gang up on the individual when he's low from farming jungle. Even then, it's risky and difficult sometimes.\nLate game? they have BoTR and enough attack speed + double on-hit proc to sustain and fight nearly forever.\n\nEkko is a champion. Not an item. And yes, he was imbalanced when brought out. But the PBE community tried to say over and over again \"This item is too powerful. Its not ready for release yet!\" And that was ignored.\n\nEven then, the prior devourer WAS used..and was great on a few select champions, and it wasn't gamebreaking. Just because the other two items got raised to powerful levels didn't mean we needed a game-breaker next. They should've nerfed Cinderhulk down a tone, same for Runeglaive, rather than champions itself.","replies":[{"poster":"Brightnite","date":"2015-07-10T22:23:38.974+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Azukoto,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=002100000000000000000000,timestamp=2015-07-10T22:07:46.761+0000)\n>\n> Again, I didn't say 'delete'. Reverted, and stepped back once until it can be tested/balanced further in PBE. Even though PBE playerbase is smaller, you get all the help you can there, even though the communities opinions are most often ignored. \n> \n> how do early powerhouses fight it? they gang up on the individual when he's low from farming jungle. Even then, it's risky and difficult sometimes.\n> Late game? they have BoTR and enough attack speed + double on-hit proc to sustain and fight nearly forever.\n> \n> Ekko is a champion. Not an item. And yes, he was imbalanced when brought out. But the PBE community tried to say over and over again \"This item is too powerful. Its not ready for release yet!\" And that was ignored.\n> \n> Even then, the prior devourer WAS used..and was great on a few select champions, and it wasn't gamebreaking. Just because the other two items got raised to powerful levels didn't mean we needed a game-breaker next. They should've nerfed Cinderhulk down a tone, same for Runeglaive, rather than champions itself.\n\nI'd like to petition that Sated Devourer be reverted to its prior state, removed from the current-live patch, and returned to the PBE for further, DEEPER, more logical balancing.\n^ what you said in original post. if it gets reverted to its old state that means we have devourer again and not SD problem. again from statistics larger pools are better. \n\nEkko is a champion? im not saying hes not? what? im saying IF these things never go live how is riot gonna know just how strong these items and champions are? Also from everything ive ever heard about PBE its a testing ground for bugs... not for viability not for balancing but to work out problems with the coding. Wish they would figure out how to fix minions being lcs body blockers but thats another thing. \n\nIs SD game-breaking? idk.... strong duelers being strong? maybe cause your building armor vs their mixed dmg? ive played a few games with it and against it since it came out. Yesterday i played jax with it into a kayle with it. we kept counter ganking each other and the two of us didnt complete it till 30 minutes by which point everyone else was far ahead and we werent that useful. Sure people with nice clear speeds can get it earlier but at the sacrifice of their teams. Weed-wick was game breaking it didnt matter if you were fed if you were behind cause once ww came by he was easily able to 1 vs 2 you.\n\nHonestly i think this is just people reacting negatively to change even though thats what they claim they want. Making all 4 jungle items viable opens up the doors to a lot of junglers, different team comps, different play styles. Thats what i think riots going for, but if the moment they make one item and try something new with it and everyone starts crying..... lol i see why they would ignore the PBE people.","replies":[{"poster":"Pretty Dhizi","date":"2015-07-10T23:14:12.233+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Brightnite,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=0021000000000000000000000000,timestamp=2015-07-10T22:23:38.974+0000)\n>\n> I'd like to petition that Sated Devourer be reverted to its prior state, removed from the current-live patch, and returned to the PBE for further, DEEPER, more logical balancing.\n> ^ what you said in original post. if it gets reverted to its old state that means we have devourer again and not SD problem. again from statistics larger pools are better. \n> \n> Ekko is a champion? im not saying hes not? what? im saying IF these things never go live how is riot gonna know just how strong these items and champions are? Also from everything ive ever heard about PBE its a testing ground for bugs... not for viability not for balancing but to work out problems with the coding. Wish they would figure out how to fix minions being lcs body blockers but thats another thing. \n> \n> Is SD game-breaking? idk.... strong duelers being strong? maybe cause your building armor vs their mixed dmg? ive played a few games with it and against it since it came out. Yesterday i played jax with it into a kayle with it. we kept counter ganking each other and the two of us didnt complete it till 30 minutes by which point everyone else was far ahead and we werent that useful. Sure people with nice clear speeds can get it earlier but at the sacrifice of their teams. Weed-wick was game breaking it didnt matter if you were fed if you were behind cause once ww came by he was easily able to 1 vs 2 you.\n> \n> Honestly i think this is just people reacting negatively to change even though thats what they claim they want. Making all 4 jungle items viable opens up the doors to a lot of junglers, different team comps, different play styles. Thats what i think riots going for, but if the moment they make one item and try something new with it and everyone starts crying..... lol i see why they would ignore the PBE people.\n\nI would agree with keeping it in this patch. IF, it didn't damage ranked gameplay. It completely destroys it. I just beat a Sated Devourer Shyvana -- And it took EVERYTHING, to take her down. She had BoTR and Sated, and then straight tank, and could melt me as Khazix with 208 armor and 143 MR, and 3.4k health. We had to dedicate our entire team to killing her when she was alone. It was difficult. Not impossible, but EXTREMELY difficult. Mixing resistances  doesn't change the fact that it is % health damage from BoTR and Shyvanas on-hit bonus melting away the value of armor and health. It's STILL unreasonably large portions of health being chunked off instantly and quickly.\n\nWhen I said 'Ekko is a champion' I meant you were using ambiguous comparisons. An item =/= Champion. His KIT was part of the power issue. This ITEM, AMPLIFIES kit issues to game-breaking levels.\n\nPBE is a smaller portion of the playerbase that gets first-hand tryouts on all items released. It SHOULD be used for balancing along with bug-hunting, but it isn't, because Riot is close-minded and unwilling to trust their community because they assume their actions are always the right ones. They then go back and revert stuff, delete, and ruin many things that were fine, only to save-face and say that 'the item isn't the problem, XXX's kit was!'\n\nYou just did confirm one thing though -- WW was game breaking. Because of an item amplifying his kit to destructive levels. That's what Sated is doing to a dozen or so champions. He can be behind but so long as he has a double-proc passive activating, ALONG with BoTR, he can sustain and completely eliminate 50% of a targets health with his ultimate alone. Shyvanas on-hit % damage doubles + BoTR doubles, Yi does 2x amount of true damage in a smaller timeframe. It's **destructive** to healthy gameplay for those reasons.","replies":[]}]}]}]}]}]}]}]},{"poster":"Pretty Dhizi","date":"2015-08-01T09:11:58.383+0000","up_votes":2,"down_votes":0,"body":"Bump. Should I mention this jungle item killed most jungle diversity straight-up, too?","replies":[]},{"poster":"PantyCraze","date":"2015-08-01T02:02:49.731+0000","up_votes":2,"down_votes":0,"body":"I completely agree.. The whole point of this season was to make the jungle more diverse.. it started off that way and now its like there is only one way to jung anymore.. you can only build sated devourer or you lose...","replies":[]},{"poster":"Pretty Dhizi","date":"2015-07-27T20:29:51.350+0000","up_votes":2,"down_votes":0,"body":"We've reached over 650 votes, 412 for sending it back for balancing..Still no red.","replies":[]},{"poster":"starly135","date":"2015-07-16T23:39:23.132+0000","up_votes":2,"down_votes":0,"body":"There's a lot of interesting interactions with this, but I don't think any of them are healthy... You see Vayne and Vi building it now as it procs their respective w's in 2 hits, particularly with these two as they both have an auto attack reset meaning they can do a chunk of your HP with no risk and no counter but the time it takes to fire off the attacks. However these two don't scale well with the stats, partially why it isn't healthy, as their just going for the unique effect rather than a calculated build that requires thought and counter play. Jax however is the problem as he already scaled okay with the old enchantment, but now after he hits off his first ultamate passive proc he can then proc it every 2 auto's, which is extremely quick to get and extra 220(+) due to his build and kit giving him high attack speed and an auto reset.\n\nMaybe I'm just being whiny but I don't believe this item is healthy for the game.","replies":[]},{"poster":"LadyRenly","date":"2015-07-11T05:23:38.567+0000","up_votes":1,"down_votes":5,"body":"It is balanced. Yes, I may have just gotten my first ever pentakill, but the fact remains: Every match  I play, I pray to God my team doesn't feed hard, because my presence will be nonexistant the first while","replies":[{"poster":"Pretty Dhizi","date":"2015-07-11T06:09:07.340+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LadyRenly,realm=NA,application-id=3ErqAdtq,discussion-id=pcRNfwTJ,comment-id=003a,timestamp=2015-07-11T05:23:38.567+0000)\n>\n> It is balanced. Yes, I may have just gotten my first ever pentakill, but the fact remains: Every match  I play, I pray to God my team doesn't feed hard, because my presence will be nonexistant the first while\n\n..Uh-huh? Rrrrrrrriiiiiiight.","replies":[]}]}]}