{"poster":"Pured","date":"2017-01-09T06:51:46.443+0000","title":"When Should I Not Play Janna?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"{{champion:40}} is my support champion.\r\nI consider myself a good {{champion:40}} ... despite not being close to challenger.\r\n\r\nI would also like to play other champions like {{champion:53}} and {{champion:412}} ... but I feel {{champion:40}} is always the better pick.\r\n\r\nI think I&#039;m extremely biased and would like to know if {{champion:40}} really is better, or if there are cases where other champions are better.\r\n\r\nI&#039;m primarily thinking about my and the enemy team&#039;s composition.","replies":[{"poster":"Captain Fortune","date":"2017-01-09T10:25:33.588+0000","up_votes":1,"down_votes":1,"body":"Greetings Pured, \n\nYou are right that it comes down to both your team and enemy team composition. From my understanding Janna is usually picked to counter an enemy team comp rather than mainly picked to fit with her own with the way that her kit works. Janna works really well against engage, being able to disengage and peel extremely well in a fight to set up for better positioning. On top of this she works with almost any bot lane partner.\n\n---\n\n\nSo the question is when should you not pick Janna? I think that with this in mind since she will work with almost any bot lane, you should for times that your team needs a role to be filled that Janna cannot. An example of that would be if your team needs catch potential, maybe a Blitzcrank would work better. Your team needs more flat engage? Try something like a Leona. More AOE in a team fight a long with buffs, something like a Sona will work extremely well in that situation. \n\nAlong with this you should also consider if the role of disengaging has already been taken care of by another member of your team. Have a look at the champions on your team and think about the roles that you think Janna covers, if you think they have already been covered, then it might be better to pick a different champion. This is mainly because disengage for example can most of the time be covered by 1-2 members in a team, any more you are putting too much priority on that and won't have any real power when it comes down to the actual 5v5 team fights.\n\n---\n\nIn my opinion I am always a big fan of pick what you are comfortable with for climbing in solo queue instead of what works best for your team. If you are confident in a champion that you think will work better in the situation than Janna go for it. However if you don't feel confident enough in your ability to do what you need to do, you will most likely be more effective on a champion that you know how to play. This is something to always keep in mind ^^\n\n---\n\nI hope that this helps, if there is anyway I can help or any other questions I can answer let me know! Good luck in your games!\n\n~Elam","replies":[{"poster":"Pured","date":"2017-01-09T10:41:02.968+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2017-01-09T09:48:11.637+0000","up_votes":1,"down_votes":0,"body":"If your team has no tanks, then I believe Janna is off the table.\nA healthy team needs at least 1, but preferably 2 tanks, and if no one else is man enough to pick any, then I'm afraid it falls to you as a support to even it out.\nJanna is an awesome champion, and she is very strong, but no matter how you slice it, her shields just can't replace a true tank.\n\nBut if your team already has 2 tanks, then I don't see any reason that Janna should be an unacceptable support pick, (Provided there isn't some obvious reason, specific to the situation.)","replies":[{"poster":"Pured","date":"2017-01-09T10:37:15.637+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply.","replies":[]}]},{"poster":"Klavinmour","date":"2017-01-09T07:39:13.031+0000","up_votes":1,"down_votes":0,"body":"If I'm playing Rengar, I'd love it if you didn't play Janna.\n\nWhy?\nBecause she counters assassins, especially ones like Rengar who need their initiation to be successful, and have no alternate way to jump back on their target.","replies":[{"poster":"Pured","date":"2017-01-09T08:35:06.585+0000","up_votes":1,"down_votes":0,"body":"I auto-lock Janna when I see a Rengar...","replies":[]}]}]}