{"poster":"Krumblore","date":"2018-01-06T06:03:43.306+0000","title":"The Preseason Update","subforum":"Miscellaneous","up_votes":1,"down_votes":4,"body":"So I&#039;d like to rant a little bit, as somebody who doesn&#039;t own all of the champions yet, the preseason update has royally screwed me. I love the new runes and I think that they are a much better choice than the old ones (obviously some adjustments to make though), but my beef is particularly with the new Blue Essence system. I literally cannot buy any champions anymore. What used to be a 20 game grind to get like a 6300IP champ is now a 3 month grind to get a 3150BE champ. The pricing is broken and the level up capsules don&#039;t reward anybody with anything, I am constantly getting the smallest amounts of BE and 450BE champs that I already own. It is only now that these changes are affecting me as beforehand I had an unholy amount of BE from the runes conversion. Not to mention the &quot;First Win of the Day&quot; mission, it only gives 50BE. Meaning that if you were to start from 0BE you&#039;d have to play 1 game everyday for a week just to get a 450BE champion. Compared to playing only like 4 games before the update went live. It feels like Riot has simply made the game &quot;Pay to Win&quot;. Not to mention upgrading champions from lvl 5 and onward, it costs 3250BE! Seriously its already hard enough just to get the lvl 6 and 7 tokens but adding that ridiculous amount of BE on top of that is just stupid. In my opinion the game needed the new runes and possibly even the infinite leveling, but not the IP to BE conversion. \r\nThanks.","replies":[{"poster":"Broken Scripts","date":"2018-01-06T09:34:57.488+0000","up_votes":2,"down_votes":0,"body":"I legit got enough BE to buy a 6k champ after 3 days. That was with getting multiple 450 champs in the thing.","replies":[{"poster":"esp","date":"2018-01-07T04:08:47.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broken Scripts,realm=OCE,application-id=Ntey9fRZ,discussion-id=djsTYBjy,comment-id=0000,timestamp=2018-01-06T09:34:57.488+0000)\n>\n> I legit got enough BE to buy a 6k champ after 3 days. That was with getting multiple 450 champs in the thing.\n\nIs this meant to be good? I'm legit curious and trying to compare it with the old system.","replies":[]}]},{"poster":"esp","date":"2018-01-07T04:07:55.341+0000","up_votes":1,"down_votes":0,"body":"I was level 25 with xp and ip boost before season ended, with the IP system in place. I came back a couple weeks ago to find I don't get any BE after every win OR loss. I'm level 25, 5 levels away from level 30. This means I only  get 5 champion capsules once I am 30. 3 of which contained no champ shards and only about 450-750 BE. I am now level 40 with only 6 champions (I dust a lot of shards to buy champs I think will be fun instead of using the trash capsules give you). Had I not dusted them it wouldn't have made much of a difference in champions, Maybe I'd have about 5 more but my BE was still be quite low.\n\nIt's not necessarily the BE system that's made me unhappy, it's that our source of in-game currency is only gained when you level. Even win of the day bonus only gives you 50 be... IP bonus was like 200.","replies":[]}]}