{"poster":"MaxTrey","date":"2016-04-09T23:39:14.087+0000","title":"Tengo un tipo de lag extraño","subforum":"Problemas Técnicos","up_votes":28,"down_votes":2,"body":"En estos &uacute;ltimos d&iacute;as he tenido problemas de lag, pero no normales (de esos que te sube el ping) sino de que mi ping sigue manteni&eacute;ndose igual que siempre pero me funciona como si tuviera mil de ms, no puedo ver que la vida de los campeones, minions, etc bajen y todo se mueve teletransportandose.\r\nHe probado a jugar personalizadas y funcionaba bien pero cuando entro a jugar con mis amigos alguna normal empieza a hacer esto el juego.\r\nHe probado abrir internet y otras cosas para comprobar si el problema era mi internet y todo funciona correctamente.\r\nSinceramente no se que hacer ante esta situaci&oacute;n, si alguno sabe la soluci&oacute;n por favor d&iacute;ganmela.\r\nGracias a todos de antemano.","replies":[{"poster":"Tio Gringo","date":"2016-04-09T23:51:44.984+0000","up_votes":8,"down_votes":1,"body":"yo estoy en una partida y me pasa lo mismo, tiro las habilidades y no las tira, los campeones se teletransportan, los minions no mueren, el internet anda a la perfeccion","replies":[{"poster":"ESK Zero","date":"2016-04-09T23:59:21.761+0000","up_votes":3,"down_votes":0,"body":"ME PUSIERON COLA DE BAJA PRIORIDAD, TY RIOT XDDD","replies":[]},{"poster":"EU Shaco bot","date":"2016-04-10T22:54:19.001+0000","up_votes":2,"down_votes":0,"body":"a mi  tambien me pasa lo mismo   ,  el parche 6.6 tenia problemas con los fps q en team fight se me bajaban hasta 06  y 10 fps  , por que mi computador es MAc  si mac como los iphones  , pero  ese era problema de los fps para ese parcche para todos los MAC  del mundo q juegan lol  ,  pero  ayer y  hoy me esta pasando algo  muy raro   los  miniom y champ se quedan pegados y  no se mueven  asi ni puedo jugar   nada    es  muy malo   ayudenme pls","replies":[]}]},{"poster":"Treek","date":"2016-04-10T02:23:44.195+0000","up_votes":6,"down_votes":1,"body":"Pais: Chile\nCompañia: VTR\n\nAqui igual, acabo de entrar a una ranked y todo mal. Tengo 15-16 ms pero todo cortado\n- los champs se teletransportan\n- cuando escribo por chat los mensajes no salen o salen luego de 1 a 2 minutos con desfase entre ellos\n- llegé a la base enemiga full vida y luego me teletransporté a mi base magiamente\n\nreinicié lol, PC, router y nada\nespero Riot tome en cuenta esto, probablemente es un problema con el proveedor de internet\nPS: NO derrota evitada :c","replies":[{"poster":"Nyán","date":"2016-04-10T16:11:53.922+0000","up_votes":1,"down_votes":0,"body":"Parece que VTR estaba teniendo problemas. Ayer ni podía entrar a la página de vtr.com","replies":[{"poster":"Le Terrible","date":"2016-04-10T22:26:38.151+0000","up_votes":1,"down_votes":0,"body":"yo uso movistar :s.","replies":[]},{"poster":"Tio Gringo","date":"2016-04-10T19:19:12.810+0000","up_votes":1,"down_votes":0,"body":"no es VTR si ese es de Chile, yo soy de Argentina y tengo cablehogar, me anda muy mal, mis ms son 67-68 pero me anda horrible","replies":[{"poster":"Nyán","date":"2016-04-10T21:16:34.962+0000","up_votes":1,"down_votes":0,"body":"Por lo general VTR es pésimo, así que no me sorprende si tiene problemas y encima están los problemas del servidor. Mi punto es que el problema no necesariamente es exclusivo de VTR :p","replies":[]}]}]}]},{"poster":"GodDragonSlayerX","date":"2016-04-10T02:28:56.355+0000","up_votes":3,"down_votes":0,"body":"a mi tambien me pasa lo mismo tengo VTR tengo 30 ms pero hay un lag del demonio espero que rito al menos coloque un aviso en el cliente diciendo que hay problemas en el servidor","replies":[{"poster":"Tio Gringo","date":"2016-04-10T19:19:49.895+0000","up_votes":1,"down_votes":0,"body":"yo soy de argentina y estoy igual q vos","replies":[{"poster":"EU Shaco bot","date":"2016-04-10T22:57:05.011+0000","up_votes":1,"down_votes":0,"body":"que onda  \ntenia un macboo  y   tenia problemas en el parche 6.6   de   q se me bajaban los fps  solo en team fight  , lo sulucione solo jugando con  el minimo de  gaficos !!!\nsi el minimo 1!!!!!   se ve todo cuadrado pero igual me la bancooo y ahora este lag rarooo  q dios  riot  q quieres de nosotros !!","replies":[]}]}]},{"poster":"Wualalo","date":"2016-04-11T03:15:56.732+0000","up_votes":2,"down_votes":0,"body":"Y como siempre los moderadores del foro están para servirnos, este foro no es mas que una puta mascara para \"callarnos un rato\"","replies":[]},{"poster":"Candado3","date":"2016-04-10T02:32:39.391+0000","up_votes":2,"down_votes":0,"body":"Me sucede lo mismo tnego VTR y el juego patina normalmente juego con 22 ms.\nCreo que debe ser VTR porque mi hermano se le murio su partida csgo.","replies":[]},{"poster":"ESK Zero","date":"2016-04-09T23:45:44.729+0000","up_votes":1,"down_votes":0,"body":"Yo igual, de hecho estoy en partida, y no veo nada, leo los mensajes de ambos equipos media hora después, en ambos equipos hay desconectados, yo me puedo mover, pero tirar habilidades es IMPOSIBLE, riot ayuda por favor.","replies":[{"poster":"PlaŹma","date":"2016-04-10T00:12:34.505+0000","up_votes":2,"down_votes":0,"body":"la jg esta viva y no la vemos =(","replies":[]}]},{"poster":"xTwinkkS","date":"2018-06-03T03:41:31.004+0000","up_votes":1,"down_votes":0,"body":"Alguien sabe si este chico arregló el problema, me está pasando lo mismo en pleno 2018 tengo entre 30 y 60 FPS pero parece que juego con +500. Alguna solución?","replies":[]},{"poster":"estronjold2016","date":"2018-01-22T00:49:25.372+0000","up_votes":1,"down_votes":0,"body":"lo mio tambien como que el campion no se me mueve pero entre jageado  y estoy en plena tinfay y se me pega  no se que sera","replies":[]},{"poster":"Maestruli0195","date":"2017-08-16T16:16:30.015+0000","up_votes":1,"down_votes":0,"body":"Me pasa exactamente lo mismo y ya informe de esto a Riot pero no me dan solucion. Ya hace varios dias que me sucede esto y no se que mas hacer. Alguno sabe como puedo solucionar este problema? Aiuuuuudaaaaaaaaaaaaaaaaaaa","replies":[]},{"poster":"Sakura Star","date":"2016-04-12T16:25:06.801+0000","up_votes":1,"down_votes":0,"body":"\"Vtr chile\" , te pensas que se de donde carajos es tu conexion? xD\nAl menos podian ser claros para los que \"no viven en chile\".\nY lee por favor lo que dije de fibertel, señor cegera.\nNo me cabe duda que los que van al colegio en chile son cada ves mas ciegos que un pobre que nacio ciego.","replies":[]},{"poster":"Green jester","date":"2016-04-11T02:03:10.562+0000","up_votes":1,"down_votes":0,"body":"Se llama packet loss, supongo que tienes VTR, lo peor de todo es que los muy incompetentes le hechan la culpa al server, seria bueno que un rioter aclarara eso","replies":[{"poster":"Sakura Star","date":"2016-04-11T02:46:09.574+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Green jester,realm=LAS,application-id=X54mVVp0,discussion-id=AGA07Kue,comment-id=001d,timestamp=2016-04-11T02:03:10.562+0000)\n>\n> Se llama packet loss, supongo que tienes VTR, lo peor de todo es que los muy incompetentes le hechan la culpa al server, seria bueno que un rioter aclarara eso\n\nVTR que es tu conexion de internet en tu zona? ._. \nPorque no ponen el nombre del ISP como se debe,digo...\nEntonces deberias poderme explicar como sin perdida de paquetes, y con transmision de 4 paquetes en el ping tracert(que no tiene perdidas), me dan ping jump de 5000+ \nMe parece que aca no anda bien algo aparte no soy la unica que se esta quejando ...\nHace 2 semanas atras me paso algo parecido, es mas este lag mounstroso lo comence a tener el dia de la \"dichosa actualizacion de draven\"...antes tenia ese lag pero no era tan notable, se volvio peor despues de ese update....\nLo peor es que probando conexiones en otros lados, incluyendo mediciones de las pc de mis hermanastros en dos lugares distintos, no les tocaba ni una sola ves el lag...\nO sea...¿sabes explicar que pasa o estas saliendo a defender como pato a cuerda?....","replies":[{"poster":"Green jester","date":"2016-04-12T06:34:49.473+0000","up_votes":1,"down_votes":0,"body":"eh? VTR es el nombre del isp...y no estoy defendiendo a nadie, si quiers explicaciones pideselas a tu proveedor, wtf contigo O.o","replies":[]}]}]},{"poster":"Faker Hembra","date":"2016-04-11T22:37:10.112+0000","up_votes":1,"down_votes":0,"body":"amigo a mi me paso igual en una partida hoy estaba con ms y fps normales y no podia ver la vida de los minions y campeones...todo se veia cortado :/ {{item:3070}}","replies":[]},{"poster":"Aven","date":"2016-04-11T06:08:53.835+0000","up_votes":1,"down_votes":0,"body":"tengo un delay asqueroso recien surrendeamos por eso es imposible jugar te marca 50 ms y te anda como si tuvieras 500+ es un asco ensima se corta la conexion y para colmo lo peor es que te dicen troll y de todo como si yo perdiera lp por que me gusta que gente ignorante riot pls hace algo (tengo fibertel  si alguno es de arg y tiene la misma compania y le pasa lo mismo por favor que me lo diga asi vemos si es fibertel o es riot )","replies":[{"poster":"Sakura Star","date":"2016-04-11T21:10:29.431+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WindSlashGG,realm=LAS,application-id=X54mVVp0,discussion-id=AGA07Kue,comment-id=0020,timestamp=2016-04-11T06:08:53.835+0000)\n>\n> tengo un delay asqueroso recien surrendeamos por eso es imposible jugar te marca 50 ms y te anda como si tuvieras 500+ es un asco ensima se corta la conexion y para colmo lo peor es que te dicen troll y de todo como si yo perdiera lp por que me gusta que gente ignorante riot pls hace algo (tengo fibertel  si alguno es de arg y tiene la misma compania y le pasa lo mismo por favor que me lo diga asi vemos si es fibertel o es riot )\n\nAyer me reconfiguraron dos veces el WIFI de fibertel por errores extraños.\nAhora estuve bien, pero...aun asi tuve un par de partidas mas con 400-6000ms.\nRevise varias veces con varios medidores y la medida de internet dio arriba de lo que tengo(12 megas)\nPor lo cual estaba en buen funcionamiento en ese momento.\nAunque asumo que el sabado y domingo habia mas gente, aun asi habria que hacerle algun checkeo al server...\nA ver si no esta tirando algun problema, porque al preguntar en fibertel, me dijieron que habian dos opciones.\nSi la conexion esta andando bien, puedo abrir otras cosas y solamente es el juego, probablemente sea el propio server.\nPero si no logro abrir nada, ya es porque es problema del modem, pero  estoy segura que le falta algun mantenimiento...\nO checkeo de estado...","replies":[]}]},{"poster":"Jingle Bellss","date":"2016-04-11T04:11:23.474+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo, se me mueve solo el champ o los ataques no se ven y eso","replies":[]},{"poster":"PirncipeDeReyes","date":"2016-04-11T02:01:21.498+0000","up_votes":1,"down_votes":0,"body":"Pls , alguna solucion, yo soy de argentina y me pasa eso, no se que pasa se me bugea todo, minioms sin vida tiro habilidades y no las tira deley en el chat pls riot dame alguna solucion o algo.","replies":[]},{"poster":"Sakura Star","date":"2016-04-11T01:49:40.407+0000","up_votes":1,"down_votes":0,"body":"Recien tuve lo mismo, pero habia un usuario con Varus que se me acercaba y me tiraba un lag mounstroso....\nUfff... no se que onda pero no se puede jugar asi....jugue bien varias horas entre las 18 y las 22 hrs....\nAhora las 22:50pm argentina, me esta haciendo pedazos el lag...","replies":[]},{"poster":"YeezY One","date":"2016-04-11T01:27:16.538+0000","up_votes":1,"down_votes":0,"body":"Alguna solucion temporal ? se les arreglo ? me da miedo jugar ranked ya que he perdido 2 por culpa de esto ( me he ido afk ya que es imposible jugar )","replies":[]},{"poster":"rheka","date":"2016-04-10T23:31:38.530+0000","up_votes":1,"down_votes":0,"body":"el mismo problema espero que alla algun arreglo es frustrante","replies":[]},{"poster":"matiah2ignacio","date":"2016-04-10T03:19:15.260+0000","up_votes":1,"down_votes":0,"body":"a mi igual me pasa, tengo que reloguear ejecutar como administrado y a veces se soluciona","replies":[{"poster":"EU Shaco bot","date":"2016-04-10T23:00:00.710+0000","up_votes":1,"down_votes":0,"body":"a mi tambien y eso q tengo un macboo pro \n  el parche 6.6 me jodiooo todo  riot con los fpos en tf se me bajaban   y ahora esto : (","replies":[]}]},{"poster":"Fideo con mantek","date":"2016-04-10T19:27:29.315+0000","up_votes":1,"down_votes":0,"body":"Adhiero con toda violencia, ahora mismo jugué dos partidas con ese problema. Y no era el único varios entran tarde o se quedan afks.","replies":[]},{"poster":"DeathNote","date":"2016-04-10T03:12:19.669+0000","up_votes":1,"down_votes":0,"body":"creo que ah muchos le pasa este tipo de bug\no es vtr o el juego unas de las 2\nespero que solucionen luego el problemas \ny como dicen mis compañeros loleros \nes un asco jugar asi \nespero que lean este post o el e mis compañeros \ny eso ps \nsadkasjda\ncuando llega urf","replies":[{"poster":"Tio Gringo","date":"2016-04-10T19:22:31.481+0000","up_votes":1,"down_votes":0,"body":"Yo creo q es el juego, soy de Argentina, aca no está vtr y estoy igual q todos ustedes","replies":[]}]},{"poster":"Elyasviel","date":"2016-04-10T16:42:13.118+0000","up_votes":1,"down_votes":0,"body":"Me pasa exactamente igual, y va desde que pusieron ascensión.","replies":[]},{"poster":"Yügenn","date":"2016-04-10T06:00:04.232+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo hace unos dias, pero solamente a partir de las 10, muy raro.","replies":[]},{"poster":"MLJ SebA","date":"2016-04-10T05:00:41.699+0000","up_votes":1,"down_votes":0,"body":"A mi también me pasaba con vtr casi todos los días, me cambie de compañía y hasta ahora no me ha pasado más.\nAsí que debe ser problema de vtr.","replies":[]},{"poster":"MaxiMix","date":"2016-04-10T03:59:11.798+0000","up_votes":1,"down_votes":0,"body":"Lol todos tienen vtr XD \nme pasa lo mismo y me dura como 5 minutos pero tengo que estar relogeando todo el rato\n ;( no e perdido ninguna partida en la que me dio ese lag, pero igual es molesto y no creo que sea vtr...\nojalas que no sea vtr","replies":[]},{"poster":"Kumiho chan","date":"2016-04-10T03:38:21.431+0000","up_votes":1,"down_votes":0,"body":"estamos muchos en las mismas :/ {{summoner:3}}  <------------ vtr o el server descripcion grafica","replies":[]},{"poster":"Zyps","date":"2016-04-10T03:34:48.828+0000","up_votes":1,"down_votes":0,"body":"tengo el mismo problema y creo que ya me reportaron como 20 veces por eso, no funciona relogear, ni reiniciar, nada gg rito","replies":[]},{"poster":"Klusterx","date":"2016-04-10T03:33:48.095+0000","up_votes":1,"down_votes":0,"body":"gg rito","replies":[]},{"poster":"pandruu","date":"2016-04-10T02:52:20.246+0000","up_votes":1,"down_votes":0,"body":"No es bueno jugar ahora con este problema jijijiji chau y a jugar otros juegos jiijjiij","replies":[]},{"poster":"Trollpick Master","date":"2016-04-10T02:48:01.334+0000","up_votes":1,"down_votes":0,"body":"Tengo Fibertel, en la zona de La Plata, Buenos Aires, y estoy en la misma situación que vos. El lag fantasma este es insoportable, se cuelga en plena ranked a pesar de tener latencia de 40ms y 120fps ambos fijos.","replies":[]},{"poster":"CabronMartinez","date":"2016-04-10T02:32:44.521+0000","up_votes":1,"down_votes":0,"body":"me pasó lo mismo recién jugando ascensión, vtr viña del mar 40 megas.\nMe da miedito jugar ranked >_<{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Treek","date":"2016-04-10T02:35:12.462+0000","up_votes":1,"down_votes":0,"body":"no lo hagas, no hay derrota evitada","replies":[]}]},{"poster":"iDark Beast","date":"2016-04-10T02:16:03.551+0000","up_votes":1,"down_votes":0,"body":"No eres el unico, nos esta pasando a muchos y no es culpa del internet ni nada, ojalá este post lo lea algun rioter  y nos digan por que esta pasando, sinceramente no jugaré hasta tener respuesta de algo.  :(","replies":[]},{"poster":"darkdamus","date":"2016-04-10T02:08:21.198+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo{{item:3070}}","replies":[]},{"poster":"Le Terrible","date":"2016-04-10T02:06:52.098+0000","up_votes":1,"down_votes":0,"body":"a rito no le importa, no te calientes la cabeza buscando respuestas por parte de riot.\n\nhace dias que pedi ayuda o una respuesta por el mismo tema pero nada.","replies":[]},{"poster":"JhinnLottusFlow","date":"2016-04-10T01:58:48.816+0000","up_votes":1,"down_votes":0,"body":"Me paso exactamente lo mismo!!! Ya reporte este bug, Estaba en plena ranked con leBlanc y Por suerte la gane porque ya me habia fedeado demaciado... Espero Riot haga algo luego... Suerte!!!","replies":[]}]}