{"poster":"friendlyFerret","date":"2018-08-22T10:44:11.459+0000","title":"Wireless NBN ping times (experience)","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Looking for some input from players using wireless NBN. How did it affect your ping upgrading from adsl2? I can upgrade but reluctant if it&#039;s bad..","replies":[{"poster":"Project Xayah","date":"2018-08-22T12:28:25.235+0000","up_votes":2,"down_votes":0,"body":"When I made the transition from ADSL2 to NBN, it was because I had moved from one of the northern suburbs of Melbourne to a rural town that had Fibre to Node NBN, so my experience may not be as accurate as someone who transitions while remaining at their current location (and may or may not be as \"good\" as in an urban setting). That said, ever since I moved my ping has consistently been ~25 under normal circumstances, getting to ~50 with mild connection issues, for Australian based servers. The only times I've ever had real issues with ping in that time is when there were major issues with my ISP, the NBN itself, or the specific game I was playing/site I was browsing at the time. Prior to the move, my ping was easily double what it is now.\n\nSo far as download/upload speeds are concerned, I had something like 5Gb/1Gb respectively, which became 10+Gb/2+Gb after the transition to NBN, and has steadily increased in that time (without changing internet plans) to 20+Gb/3+Gb respectively. Have rarely had issues with the NBN equipment itself, and is usually easily resolved with \"generic\" fixes (such as the \"first step\" of \"have you tried turning it off and on again?\"). Personally, I'd say it's definitely worth considering if it's not going to cost much/any more than your current ADSL2 plan, because you'll get generally better internet, and you'll probably have to make the transition at some point anyway. That said, it might be worth doing some research and seeing how others in your area have been affected by transitioning to NBN, as there *might* be area specific issues to consider.","replies":[{"poster":"friendlyFerret","date":"2018-08-22T12:45:44.825+0000","up_votes":1,"down_votes":0,"body":"Thanks so much for your detailed response I really appreciate it ^.^, I'm in a semi-rural area (monbulk, outer eastern suburbs) and they are not offering anything to us except 'wireless NBN' which  Iguess is like 5g or something. If it was FTN I wouldn't be as worried. Thanks for the advice ^_^","replies":[]}]}]}