{"poster":"Neostac","date":"2018-04-27T13:38:04.931+0000","title":"0 ping im loading screen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"habe ungef&auml;hr 2 monate nicht gespielt gehabt und nachdem ich die neuen patches installiert hatte wollte ich ein spiel starten. Bei der championauswahl verlief noch alles normal doch als ich dann im loading screen war, war meine ping die ganze zeit &uuml;ber 0 und ich hatte durchgehend 0%. Nach so ner halben minute wechselt der cursor vom normalen league cursor zum pc cursor und es kam die Meldung &quot;Verbindung zum Internet verloren. Bitte versuches erneut.&quot; Das komische dabei ist, dass ich durchgehend eine gute internet verbindung hatte und meistens komme ich dann auch mit dem ersten reconnect ins game. W&auml;re cool wenn mir jemand helfen kann.","replies":[{"poster":"iTrash","date":"2018-04-28T13:02:52.930+0000","up_votes":1,"down_votes":0,"body":"Schonmal das HRT probiert?\nhttps://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool\n\nKann an sich aber viele Gründe haben, dass es nicht geht.\n\nWenn du dich neu verbunden hast, ist dann die Verbindung stabil?","replies":[{"poster":"Neostac","date":"2018-04-28T18:18:47.710+0000","up_votes":1,"down_votes":0,"body":"Hab das HRT schon aber probiere es damit nochmal. Habe LoL auserdem auch schon mal neu installiert problem blieb aber. Wenn ich aber dann mal im spiel bin laüfts flüssig.","replies":[]}]},{"poster":"Izaya Kumiho","date":"2018-04-27T14:10:14.858+0000","up_votes":1,"down_votes":0,"body":"Lässt deine Firewall denn auch das Spiel durch?","replies":[{"poster":"Neostac","date":"2018-04-27T17:26:12.224+0000","up_votes":1,"down_votes":0,"body":"Ja. Wie gesagt komme ich dann beim reconnecten meistens direkt ins spiel aber da hat es halt schon angefangen","replies":[{"poster":"Izaya Kumiho","date":"2018-04-27T18:18:37.977+0000","up_votes":1,"down_votes":0,"body":"oh huch. hast du deinen beitrag überarbeitet,oder habe ich das überlesen? D:\nnaja dann weiss ich auch nicht woran es liegen könnte...","replies":[{"poster":"Neostac","date":"2018-04-27T21:11:18.471+0000","up_votes":1,"down_votes":0,"body":"Ok schade trotzdem danke","replies":[]}]}]}]}]}