{"poster":"Nojusticee","date":"2015-06-12T03:50:52.275+0000","title":"Can someone explain this to me?","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"probably the most one sided match ive ever had youll realise that i had more farm than trist and rumble and i WENT AFK LOL matchmaking isnt  broken they said. did i forget so say this happened after winning streaks you can see my previous posts about this shit matchmaking. pretty much you get punished for going on winning streaks how sad.","replies":[{"poster":"JasonWazza","date":"2015-06-12T04:53:56.766+0000","up_votes":2,"down_votes":0,"body":"It's cute how players like you have to put it down to riot being out to get you instead of you just being bad.\n\nEDIT: Just as a point, i went from S5 to G5 in under 200 games, you have 600 games and have to blame your team for your ego's sake.","replies":[{"poster":"Nojusticee","date":"2015-06-12T07:08:38.170+0000","up_votes":1,"down_votes":0,"body":"Congratulations but ill let you know something about 100-150 of those losses are from dcs/afks/trolls and bad matchmaking so please youre not as unlucky as me. and you need some Luck in soloque btw.","replies":[{"poster":"JasonWazza","date":"2015-06-12T07:13:16.442+0000","up_votes":1,"down_votes":0,"body":">but ill let you know something about 100-150 of those losses are from dcs/afks/trolls\n\nMeaning your probably a bit of a douche and are the reason they afk or start trolling.\n\nYour blaming a third to a half of your losses onto something your most likely causing, and think your still good.\n\nNice work keeping your ego in check though.","replies":[{"poster":"Nojusticee","date":"2015-06-12T07:19:25.609+0000","up_votes":2,"down_votes":1,"body":"because all AFK/Trolls Are Caused By the Players and not the Troll themselves? or the ones who just Afk Right of the Bat do you know how retarded you sound right now? Lol i Dont know how retarded you are but why would i flame someone? why would i risk a loss over a argument?","replies":[{"poster":"JasonWazza","date":"2015-06-12T07:25:51.550+0000","up_votes":1,"down_votes":0,"body":"If you want to say that in 15-25% of your games that there is an AFK/Troll/DC i'm sorry but the main thing that is common in all those games is you.\n\nGiven your attitude on boards you probably are a rager in game.\n\nNot to mention you just admited on boards to going afk, so you clearly are a douche.\n\nBut it's always the teams fault and never yours, and with that mentality you won't get anywhere.","replies":[]}]}]},{"poster":"Yondas","date":"2015-06-12T08:33:29.780+0000","up_votes":1,"down_votes":0,"body":"Yea Soooo true only reason I'm in diamond and not challenger is because of my 140 loses 100 of them have been because my teams so stooopid and we throw the game after i was 17/2 on fizz at 3 minutes in because they dont listen to me and then I go afk because I cant take their stooopidnuss so we lose. Like honestly If this wasnt a team game I would be best player oce but these teams always holding me back and It's not like I ever make a mistake because I dont you know. IM such a good player and this one time I vsed a challenger bot lane and we beat them and it wasnt because they played heimer adc and eve support, it was because I am a challenger level player. /S","replies":[]}]}]},{"poster":"shalexade","date":"2015-06-12T04:50:41.076+0000","up_votes":2,"down_votes":0,"body":"\"winning streaks\" implies that you've one more than just 1 game.\n\nOP.GG is pretty good at measuring MMR, and for that game, has you guys ahead.\n\nRumble got owned, and Fizz appears to have roamed better than you.\n\nSuck it up and move on.","replies":[{"poster":"Nojusticee","date":"2015-06-12T07:05:57.747+0000","up_votes":1,"down_votes":0,"body":"Im Playing as Hecarim Not As Zed","replies":[]}]},{"poster":"oops","date":"2015-06-12T14:18:41.673+0000","up_votes":1,"down_votes":0,"body":"People who are unranked could of been gold+ last season...","replies":[]},{"poster":"Yondas","date":"2015-06-12T08:29:35.332+0000","up_votes":1,"down_votes":0,"body":"What exactly am I looking at? How this matchmaking is within 12 mmr and is one of the most fair games possible mmr wise? Or am I looking at your 700 games in silver?","replies":[]}]}