{"poster":"Bolwinkel","date":"2015-09-09T00:25:23.131+0000","title":"PROJECT: Yasuo","subforum":"[ARCHIVED] Miscellaneous","up_votes":8,"down_votes":2,"body":"Can people who bought the PROJECT: Yasuo skin get the first strike border on him?\n\nEdit: A while back Riot gave the original owners of some 34 skins (now legacy) a border to show they originally owned them. So why can't those who bought Project: Yasuo within a few days of it's release get a first strike border on him? Link http://www.surrenderat20.net/2013/10/plan-for-vintage-limited-edition-skins.html","replies":[{"poster":"ham døg","date":"2015-09-09T00:27:01.071+0000","up_votes":2,"down_votes":3,"body":"Theres no first strike on yasuo...","replies":[{"poster":"moonstones","date":"2015-09-09T00:30:07.558+0000","up_votes":7,"down_votes":14,"body":"This is correct. PROJECT: Yasuo does not have a First Strike loading screen. At this time, there are no plans to give him one.","replies":[{"poster":"Bavacavalata","date":"2016-07-20T19:23:19.786+0000","up_votes":1,"down_votes":0,"body":"do you have one now in 2016?","replies":[{"poster":"moonstones","date":"2016-07-20T19:30:00.308+0000","up_votes":2,"down_votes":0,"body":"Oh! Yes, there is a PROJECT: Yasuo border now!","replies":[{"poster":"Bavacavalata","date":"2016-07-20T21:24:55.693+0000","up_votes":1,"down_votes":0,"body":"I'm not educated on how to get it, so when it comes out, how do I get one, if I am eligible to get one","replies":[{"poster":"moonstones","date":"2016-07-21T19:58:45.841+0000","up_votes":1,"down_votes":0,"body":"Yasuo is getting First Strike treatment but we'll be giving it to all PROJECT: Yasuo owners, including those who purchase when this is live.","replies":[{"poster":"Harukishi","date":"2016-07-24T17:59:30.294+0000","up_votes":1,"down_votes":0,"body":"Will Yasuo be getting a project icon as well?","replies":[{"poster":"moonstones","date":"2016-07-26T21:28:19.081+0000","up_votes":1,"down_votes":0,"body":"No, but these are the icons that are coming out this patch. \n\nhttp://imgur.com/a/zbgka","replies":[{"poster":"Harukishi","date":"2016-07-27T03:34:57.964+0000","up_votes":1,"down_votes":1,"body":"Is there a specific reasoning as to why he is the only skin in this line not getting an icon?","replies":[]}]}]}]}]}]}]},{"poster":"Bolwinkel","date":"2015-09-09T01:00:33.707+0000","up_votes":5,"down_votes":1,"body":"Ok, I was just wondering since he is part of the whole PROJECT.","replies":[]},{"poster":"Stars Shaper","date":"2015-09-09T08:19:39.851+0000","up_votes":3,"down_votes":1,"body":"Are there plans to make him part of the epic feeling of all the others project skins? It seems pretty unfair to leave him out.","replies":[{"poster":"moonstones","date":"2015-09-09T17:03:16.466+0000","up_votes":4,"down_votes":8,"body":"Currently, we do not have plans to do so.","replies":[{"poster":"Ultîma","date":"2015-09-09T18:33:19.921+0000","up_votes":2,"down_votes":1,"body":"Hey Katey, is it at least being considered? Adding a texture at the loading screen that doesn't require localization (no words) doesn't seem like it would be a big resource investment for how much it would make Project: Yasuo owners happy =/","replies":[{"poster":"moonstones","date":"2015-09-10T00:07:03.899+0000","up_votes":2,"down_votes":4,"body":"At the moment, we aren't considering this.","replies":[{"poster":"Stars Shaper","date":"2015-09-11T19:54:10.032+0000","up_votes":2,"down_votes":1,"body":"Then I would suggest not to release any skin that would be part of a skin line if it was released in the near future.","replies":[{"poster":"moonstones","date":"2015-09-11T20:45:20.344+0000","up_votes":1,"down_votes":2,"body":"We we created PROJECT: Yasuo, we didn't have any other PROJECT skins in development. There was a year gap between the release of PROJECT: Yasuo and the new PROJECT skins. \n\nThis is definitely feedback we can consider for future lines of skins, though.","replies":[{"poster":"Stars Shaper","date":"2015-09-11T21:52:01.438+0000","up_votes":1,"down_votes":0,"body":"You had a really productive spree with the new skins then, happy about that.\n\nBut consider also old skins of the same line for the next time because feeling left out of your own skin line is really depressing. It doesn't have to be the same thing for every1. I didn't want the screen border for Yasuo (even fi I wouldn't have said no if that had been the case xD) but make said guy/gal have a role in it and not just an out of focus appearance in the splash art.","replies":[{"poster":"moonstones","date":"2015-09-11T23:49:32.531+0000","up_votes":2,"down_votes":3,"body":"Based on the player reaction to this, it's something we'll be mindful of/consider if we plan to do something like this in the future.","replies":[{"poster":"Stars Shaper","date":"2015-09-12T08:31:28.540+0000","up_votes":1,"down_votes":0,"body":"Glad to hear that.\n\nAnyway, the Project skins are really good and I'm having a good excuse to play Yasuo :P You did a good job overall^^","replies":[]}]}]},{"poster":"GhostOfShrimpmas","date":"2015-09-11T21:13:02.998+0000","up_votes":1,"down_votes":0,"body":"So, if I could ask, what was the reasoning behind making the PROJECT skins the same skin line as Yasuo, but not including him in the event? Was it just assumed that most people wouldn't care?","replies":[{"poster":"moonstones","date":"2015-09-11T22:52:13.895+0000","up_votes":2,"down_votes":2,"body":"It's not that we thought people wouldn't care. It was something that was brought up. Ultimately, we decided that he would not be part of this promotion.","replies":[]}]}]}]},{"poster":"Bavacavalata","date":"2016-07-20T19:08:06.739+0000","up_votes":1,"down_votes":0,"body":"is there any now that there are 3 more","replies":[{"poster":"moonstones","date":"2016-07-20T19:22:10.964+0000","up_votes":1,"down_votes":0,"body":"I'm not sure what you're referring to here, would you mind clarifying?","replies":[]}]},{"poster":"Bolwinkel","date":"2015-09-11T05:47:39.913+0000","up_votes":1,"down_votes":2,"body":"Why is it that this happened http://www.surrenderat20.net/2013/10/plan-for-vintage-limited-edition-skins.html to the original owners of some legacy skins but this isn't being planned for yas?","replies":[{"poster":"moonstones","date":"2015-09-11T19:38:06.204+0000","up_votes":1,"down_votes":1,"body":"PROJECT: Yasuo isn't a limited/legacy skin.","replies":[]}]}]}]},{"poster":"Stars Shaper","date":"2015-09-10T07:25:03.201+0000","up_votes":1,"down_votes":0,"body":"Sorry my other comment wasn't to be ironic or anything, I just misread xD\n\nWell... It feels a little weird and not right since Yasuo was the first of the project skinline. If it ever was in plan that said line would have an event and such then you could've waited for the skin to be released. If there wasn't any plan (of which I doubt though because you don't have 6 skins ready in such a short time without planning) it would still be fair to give Yasuo some space in it.","replies":[]}]}]}]}]},{"poster":"Baron Von Bangin","date":"2015-09-10T18:09:21.502+0000","up_votes":1,"down_votes":1,"body":"The problem with going back and giving a border to the people who first bought PROJECT:Yasuo is the sudden implementation of an \"exclusive\" element that didn't exist at the time of release. Such bonuses might have influenced potential buyers for collection/status reasons.  Suddenly adding a collectors element to the skin that didn't exist prior wouldn't be fair to those that would have purchased the skin had they known about an exclusive feature.\n\nThat being said, I wouldn't be adverse to them adding a purchasable first strike border to his splash during the time of the \"First Strike\" event.","replies":[{"poster":"Bolwinkel","date":"2015-09-11T05:48:12.576+0000","up_votes":2,"down_votes":1,"body":"http://www.surrenderat20.net/2013/10/plan-for-vintage-limited-edition-skins.html","replies":[{"poster":"Baron Von Bangin","date":"2015-09-11T19:33:00.567+0000","up_votes":2,"down_votes":1,"body":"I knew this would come up.  \n\nPROJECT: Yasuo is different from a limited Edition Skin.  Limited edition skins had the exclusivity _the moment they were announced and released_.   PROJECT: Yasuo did not.  That skin was never intended to be a collector's item like limited edition skin were.  Changing some thing that was _supposed_ to be special into something available to everyone made them go back and give something additional to the people that bought it during the initial deal, when it was supposed to be unavailable after purchase. \n\nThis is different from PROJECT: Yasuo.  When it was released, Riot never made any claims that if it was bought during its first week or when it first came out it would have some kind of special border or would only be available during that time.  Going back and making it special to previous buyers _when it was never advertised as such_ doesn't make sense. It would have to have had this feature on release, and not having it could very well have been an influencing factor for potential buys to _not_ drop RP on it.  \n\nPROJECT: Yasuo is not a limited edition skin and does not get the limited edition skin treatment. Sorry. \n\nSimilar, but key differences.","replies":[]}]}]}]}