{"poster":"Therzamiel","date":"2015-06-13T19:42:26.751+0000","title":"Dominion Punkte","subforum":"Karten & Spielmodi","embed":{"description":"Jedes Match erzählt seine eigene Geschichte; schaue in den neuen Matchverlauf von League of Legends, um zu sehen, wie diese ausgeht, und um andere an deinen Geschichten teilhaben zu lassen!","url":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2153533348/27315394?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"sehr geehrte Community\r\n\r\ngerade hab ich ein Dominionspiel gespielt und am Ende ist mir was aufgefallen. Normalerweise geb ich nicht viel auf die Platzierung, aber in dem Fall war das ja irgendwie so offentischtlich komisch und merkw&uuml;rdig, dass ich mich entschlossen hab mal die Community nach der Punktevergabe zu fragen.\r\nin dem besagten Spiel hatte ein Shaco genau gleich viel Punkte wie ich, obwohl ich ihm in allem &uuml;berlegen war, au&szlig;er dem Schaden auf Champions, da hatte er um die 2000 mehr. \r\nWir hatten die gleichen Stats nur hatte ich einen Assist mehr, zudem hatte ich mehr T&uuml;rme eingenommen und neutralisiert als er, hatte mehr Gesamtschaden und mehr Minions. Ich hatte das Schild aus der Mitte, er nicht (hat er mir selbst gesagt [wei&szlig; auch gar nicht ob das &uuml;berhaupt Punkte gibt]). Warum haben wir gleich viele Punkte obwohl ich nahezu &uuml;berall mehr hatte (au&szlig;er beim erlittenen Schaden). Ich habe auch schon im Lolwiki geschaut und hier, aber nirgends habe ich etwas gefunden, was mir sagt wof&uuml;r genau es Punkte gibt. (au&szlig;er f&uuml;r die Heilteile, da gibts zwei, aber mit nem theoretischen Punktevorsprung von 120 Durch T&uuml;rme h&auml;tte er 60 Heilteile nehmen m&uuml;ssen was sehr stark anzuzweifeln ist, da die Dinger nicht sek&uuml;ndlich spawnen).\r\nKann mir jemand erkl&auml;ren, warum wir gleich viele Punkte haben?\r\n\r\nlg.","replies":[{"poster":"erzi222","date":"2015-06-16T17:15:50.034+0000","up_votes":1,"down_votes":0,"body":"okay sry das letzte hatte ich nicht gelesen :'D ! ...\n\nich weiß noch das es punkte gibt, ich denke immer so 5 waren es?! ka.\nauf jedenfall gibt es punkte wenn man eingenommene basen beschützt, im prinzip heißt das du läufst zu einer der eingenommenen felder in bestimmten zeitintervallen und dann taucht da ne nachricht auf bei der es heißt das du punkte bekommst fürs beschützen.","replies":[]},{"poster":"Therzamiel","date":"2015-06-16T09:37:50.730+0000","up_votes":1,"down_votes":0,"body":"Ich hab doch shcon gesagt, dass das nicht infrage kommt, kein Mensch sammelt 60 Heildinger ....","replies":[]},{"poster":"erzi222","date":"2015-06-15T22:01:14.834+0000","up_votes":1,"down_votes":0,"body":"er hat mehr heal spots eingesammelt als du? die geben auch punkte","replies":[]}]}