{"poster":"NerfAutoFill","date":"2016-11-21T20:40:27.683+0000","title":"para todos los amantes de lux SUPORT","subforum":"Charlas Generales","up_votes":9,"down_votes":23,"body":"Recuerden que son SUPORTS Y tienen que comprar{{item:2049}} para tener vision del mapa.\r\n\r\nNo tienen porque rushear morelo luden o el item que sea que les de dano y no sacar wards en ningun momento de la partida.\r\n\r\nPara hacer dano ya esta el  mid, no ustedes.\r\n\r\nAdemas partamos que no sirve para dar peel y estan forzando a uno mas de su team a que se quede con la back tratando de proteger al adc.\r\n\r\nY si de paso al adc pickea algo sin movilidad posiblemente va a ser el primero en morir en todas las tfs.\r\n\r\nSaquense de la cabeza que lux suport carrea porque es mas inutil que morde bot.","replies":[{"poster":"Sir Crucifix ","date":"2016-11-21T20:46:19.631+0000","up_votes":8,"down_votes":2,"body":"Para hacer dano ya esta el mid, no ustedes (support) \n\nven como odio ser support , te ningunean te basurean te insultan","replies":[{"poster":"Tazztania","date":"2016-11-21T20:59:59.351+0000","up_votes":3,"down_votes":0,"body":"support carrea ganando partidas, no sacando el mejor kda sin poder tirar torres.\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Nuke","date":"2016-11-21T23:42:19.645+0000","up_votes":1,"down_votes":0,"body":"Y... Una cosa es que no te guste el Rol, otra que te insulten por cosas que no tenes la culpa.\nSi troleas, obviamente te insultaran","replies":[]}]},{"poster":"Desaroll","date":"2016-11-21T22:32:21.857+0000","up_votes":4,"down_votes":0,"body":"Hayo!\n\nLux support es un pick viable, según la composición, como todo en este juego.\n\nPor ejemplo, si Lux pickeó primero, y luego el adc pickea algo sin movilidad, ¿No es culpa del ADC?\n\nLa composición del equipo es un trabajo en equipo.\n\nLuego sí, la build ya es un tema mucho más discutible. El no hacerse piedravidente cuando tu team espera que lo hagas y pongas wards, es una falta más grave.\n\nLuego, el soporte no es la niñera del adc. Si el adc no sabe jugar, o cuidarse, el soporte hará lo que crea conveniente para ganar la partida.\n\nSuerte!","replies":[{"poster":"DeaD FalcoN","date":"2017-10-07T15:26:35.645+0000","up_votes":1,"down_votes":0,"body":"Considero que si el ADC pickea algo sin movilidad mas alla de quien pickea primero, deberia ser conciente de su devilidad y no ir tan agresivo. En BRONCE en tema de la composicion de equipo no es tan importante. Ya que a duras penas manejan las mecanicas de los champs (le paso a un amigo...)","replies":[{"poster":"Desaroll","date":"2017-10-07T19:27:38.838+0000","up_votes":1,"down_votes":0,"body":"Es posible, pero yo hablo de lo que puedes hacer como jugador para aumentar tus chances de ganar.\n\n¿La culpa puede ser de otro? Claro. Pero la derrota te la llevas tu, así que siempre busco la forma de cubrir las debilidades, y no asumir que el otro sabrá cubrirlas.\n\nSi tu adc elige algo sin movilidad, y el otro equipo saca un Rengar, probablemente elija ir algo que me deje salvarlo para cubrir esa debilidad que tendremos. Obviamente, si luego veo que a pesar de eso no logro ayudarlo (Por que es malo, se para mal, el rengar está feed, lo que sea), mi foco irá a proteger a otro.\n\nEs un juego en equipo. Mientras más debilidades de tus aliados cubras, más chances de ganar ;-)\n\nSuerte!","replies":[]}]}]},{"poster":"Krilin Noda Oro","date":"2016-11-21T20:47:55.731+0000","up_votes":3,"down_votes":0,"body":"No creo que {{champion:82}}  bot sea tan inútil.","replies":[{"poster":"KShyGuy","date":"2016-11-27T03:06:11.072+0000","up_votes":1,"down_votes":0,"body":"Nadie es inutil","replies":[]}]},{"poster":"Mazoku","date":"2016-11-21T20:46:18.477+0000","up_votes":2,"down_votes":5,"body":"Como juego bastante lux support aca van mis comentarios:\n\n> Recuerden que son SUPORTS Y tienen que comprar para tener vision del mapa.\n\nSuelo comprarlo dependiendo de la partida.\n\nPrefiero que mis aliados compren pinks si quieren mas map control cuando vamos ganando y cuando vamos perdiendo generalmente lo termino comprando.\n\n> No tienen porque rushear morelo luden o el item que sea que les de dano y no sacar wards en ningun momento de la partida.\n> \n> Para hacer dano ya esta el mid, no ustedes.\n\nEl mid tambien esta ahi para comprar pinks. No entiendo por que la gente reclama \"compra piedra de vision\" cuando compran menos de 3 pinks por partida.\n\nEl trabajo de una lux support es ser un segundo APC. Si eso implica no comprar el item de wards y que tus aliados ayuden a solventar ese problema then so be it.\n\n> Ademas partamos que no sirve para dar peel y estan forzando a uno mas de su team a que se quede con la back tratando de proteger al adc.\n\nEl trabajo del support no es solo dar peel al adc.\n\n> Saquense de la cabeza que lux suport carrea porque es mas inutil que morde bot.\n\nViene de un main adc imagino? La lux support tiene casi el mismo impacto que el ADC a lo largo de la partida si promediamos el early, mid y late si es pickeada correctamente.\n\nInutil para el ADC, util para el team.","replies":[{"poster":"NerfAutoFill","date":"2016-11-21T21:26:19.260+0000","up_votes":1,"down_votes":4,"body":"Main mid, esta injugable bot. pero todas las lux que me tocan o tenga en contra no terminan siendo utiles para el equipo.","replies":[{"poster":"Mazoku","date":"2016-11-21T21:28:10.287+0000","up_votes":2,"down_votes":1,"body":"> esta injugable bot\n\nDe hecho esta perfecta de support.\n\nYay! Sigamos haciendo afirmaciones sin ningun argumento para sostenerlas!","replies":[{"poster":"Nuke","date":"2016-11-21T21:48:01.987+0000","up_votes":1,"down_votes":1,"body":"El tiene argumentos y fundamentos, no se de que hablas \n\n>> [{quoted}](name=grillovsky,realm=LAS,application-id=v7qsfXsE,discussion-id=UydBIoMA,comment-id=0006,timestamp=2016-11-21T21:25:07.590+0000)\n>\n> o sea segun ustedes esta bien que el adc se quede sin peel?\n> \n> No comprar pierda esta bien?\n> \n> La diferencia entre todoooooooos los suports que me dijeron es que ambos apotan muchisima mas utilidad que lux.\n> \n> Zyra plantas cada 2.3 y un ulti que levanta a todo el team, karma escudo a todo el team o un buen burst cada 20 30 segs, brand dano por %% de vida a todo el team.\n> \n> Lux un snare y un escudito tipo boomerang que esta mas nerfeado que kalista y lento.\n> \n> Segun champion gg tiene 45% de win rate. pero les parece worth llevarla bot?\n> \n> http://champion.gg/statistics/#?search=lux\n> \n> no se como tratan de justificar que sirve.","replies":[{"poster":"Mazoku","date":"2016-11-21T21:53:52.214+0000","up_votes":2,"down_votes":1,"body":"Saludos!\n\nTirar un comentario al aire y despues pretender que yo lo lea cuando no esta incluido en la conversasion es bastante tonto por decir algo no ofensivo.\n\nEl a mi no me presento ningun argumento en respuesta a los que yo plantie. Si quiere hacerlo (o vos) sos mas que bienvenido.","replies":[{"poster":"Nuke","date":"2016-11-21T22:24:06.563+0000","up_votes":1,"down_votes":1,"body":"¿No aporto ningun argumento?\n\n>pero todas las lux que me tocan o tenga en contra no terminan siendo utiles para el equipo.\n\nEsto es un argumento de por si. Que sea pesimo o perfecto es algo tuyo.\nY si preguntas por mi opinion, bueno... Para mi el argumento no es valido, porque no puedes guiarte por la cantidad en lo personal si no son cifras verdaderas con prubas. (Asi como un egocentrico una vez me puso que el \"99,9% de la comunidad de LoL quiere que vuelva Reclutamiento normal\", pero eso es otro tema).","replies":[{"poster":"Mazoku","date":"2016-11-21T23:07:41.285+0000","up_votes":2,"down_votes":1,"body":"> Esto es un argumento de por si. \n\nEs una observacion no un argumento. Sabes la diferencia?","replies":[{"poster":"Nuke","date":"2016-11-21T23:39:36.419+0000","up_votes":2,"down_votes":1,"body":"_\"1.Razonamiento que demuestra, refuta o justifica algo.\"_ \nEra necesario mostrarte el significado en concreto, el  objetivo.\nUna observacion puede ser un argumento, porque es como que le diga:\n\n_\"¿Por que Lux no es útil para el equipo?\"_  y el justifica:\n\n>Todas las lux que me tocan o tenga en contra no terminan siendo útiles para el equipo.","replies":[{"poster":"Mazoku","date":"2016-11-22T03:49:52.397+0000","up_votes":2,"down_votes":0,"body":">  \"1.Razonamiento que demuestra, refuta o justifica algo.\"\n> Era necesario mostrarte el significado en concreto, el objetivo.\n> Una observacion puede ser un argumento, porque es como que le diga:\n> \n> \"¿Por que Lux no es útil para el equipo?\" y el justifica:\n\nEfectivamente segun esa definicion eso no es un argumento sino una observacion (o una afirmacion si queres verlo asi).\n\nEl no dijo \"me tocan siempre lux support inutiles y por ende son inutiles\" sino que simplemente dijo \"las lux support que me tocan son inutiles\".","replies":[{"poster":"NerfAutoFill","date":"2016-11-27T02:56:37.389+0000","up_votes":1,"down_votes":1,"body":"te lo digo devuelta mazo, y te lo \"fundamento\"... lux suport se queda atras en peel dmg utilidad.\n\nMe sorprende vos que hayas cambiado tanto.","replies":[{"poster":"Mazoku","date":"2016-11-27T11:30:26.908+0000","up_votes":2,"down_votes":0,"body":">  lux suport se queda atras en peel dmg utilidad.\n\nCon respecto a quien?\n\n> Me sorprende vos que hayas cambiado tanto.\n\nDe que hablas?","replies":[]}]}]}]}]}]}]}]},{"poster":"NerfAutoFill","date":"2016-11-21T21:30:01.328+0000","up_votes":1,"down_votes":3,"body":"fundamente arriba de todo. volve al doto mazoku te extrannan","replies":[{"poster":"Mazoku","date":"2016-11-21T21:30:43.860+0000","up_votes":1,"down_votes":0,"body":"Y yo presente contra argumentos a todo lo que dijiste.\n\nEl que calla otorga.","replies":[{"poster":"Nuke","date":"2016-11-21T21:43:28.641+0000","up_votes":1,"down_votes":1,"body":"¿Esta perfecta de supp?... Dijiste... ¿¡\"DE SUPP\"!?... Pera que me pongo mis lentes.\nhttp://1.bp.blogspot.com/_PNzmZtaP0zo/TSv2IHAJAcI/AAAAAAAAAJM/YDXvJDvdGhA/s1600/Gafas+dormir+homer.jpg\nEmmm... Imposible.. La humanidad no puede estar tan mal...\n\nYa hablando enserio, Lux supp solo hace KSs, daño (Mucho daño, siempre porque se compran todos los items de AP en la tienda, y si no es tan descarada, te compra la piedra de Vision hasta el minuto 20) y un escudo de 100 de vida. Si me vas a justificar que es supp por el stun, te puedo decir que Vel, Ryze y Annie son supps... Pero todos sabemos que no lo son: Claro esta.\n\nHaciendo daño y KSs, carreas partidas. Pero hacete la idea que no sos el soporte, no cumplis tu Rol, el cual es ser UTIL (Haciendo peel, zoneando, escudando, curando, controlar la vision para que tu ADC farmee tranquilo...) y si te haces daño, no haces nada de estas cosas. Simplemente le jodes la partida a quien quiera ser un ADC con un supp que sea bueno, que cumpla su Rol.\n\nSi vos vas con por lo menos 5/4 items de utilidad, tenes mi aceptacion.\nPero si no es asi, hay que diferenciar entre SOPORTE COMO LA GENTE y MID SECUNDARIO.\n\n¡Un saludo y nos vemos en los campos de la Justicia! {{champion:33}}\n\nPD: ADC = Attack Damage Carry: EL... Espera... EL, y repito EL carrea, no vos. Utiliza AD.  El soporte lo ayuda a ello.\n Una vez mas, repeti conmigo:\nE\nL\n\nC\nA\nR\nR\nE\nA","replies":[{"poster":"Mazoku","date":"2016-11-21T21:51:02.679+0000","up_votes":2,"down_votes":1,"body":"> Emmm... Imposible.. La humanidad no puede estar tan mal...\n\nConcuerdo. Alguien que no entiende el potencial de lux support merece estar en bronce! A ver tu luga (busco en lolskill).... deja, no dije nada. Todo es como deberia ser.\n\n> Ya hablando enserio, Lux supp solo hace KSs\n\nComo haces KS si las kills en lux supp son bien aprovechadas? Lux support por definicion no puede hacer KS.\n\n> i me vas a justificar que es supp por el stun, te puedo decir que Vel, Ryze y Annie son supps... Pero todos sabemos que no lo son: Claro esta.\n\nEs support porque puede aportar una exelente cantidad de daño magico al equipo, ser MUY util en una dual lane y escala bastante bien con relativamente pocos items.\nAnnie y vel son otros supports exelentes en ciertas circunstancias.\n\n>  Pero todos sabemos que no lo son: Claro esta.\n\nPueden funcionar de supports. Aparentemente vos no sabes esto y traspolas tu falta de conocimiento al resto.\n\n> el cual es ser UTIL \n\nY lux support no es util? LOL\n\nYa con el simple hecho de forzar resistencia magica cuando todo tu team es AD (que es generalmente cuando queres pickear lux supp) estas incrementando la performance de todo tu equipo.\n\nRepito, con el simple hecho de existir ya mejoras la performance de tu equipo. Algo que no se puede decir de por ejemplo un braum.\n\n> Pero si no es asi, hay que diferenciar entre SOPORTE COMO LA GENTE y MID SECUNDARIO.\n\nExacto! Como dije al principio, lux es un APC que funciona bastante bien en la botlane. Como annie o vel.","replies":[{"poster":"Nuke","date":"2016-11-21T23:13:04.514+0000","up_votes":1,"down_votes":1,"body":"Saludos, gracias por responder. No eres un sinverguenza que no teme proponer fundamentos que defiendan su causa, como me ha tocado algunas veces.\n\n>Concuerdo. Alguien que no entiende el potencial de lux support merece estar en bronce! A ver tu luga (busco en lolskill).... deja, no dije nada. Todo es como deberia ser.\n\nNo estoy seguro si mi detector de sarcasmo fallo, o me estas alagando. Porque me estas diciendo que si valoro su potencial (Porque no soy Bronce... Si Plata V no lo ves como un Bronce I), pero no tiene mucho sentido porque si fuera asi no defenderias tu posicion...  En caso de que sea la primera, diria que tuve en cuenta mi punto de vista, las pocas veces que fui ADC u otra linea cualquiera, donde ves al ADC 2/9/20 y el Soporte 15/2/5... Y te preguntas \"¿La Cait troleo y fue supp con un ADC o la Lux troleo y autolokeo Lux APC?\"... Si te parece que el punto de vista externo no es valido, te felicito, tienes personalidad. Pero en mi opinion, me parece que un punto de vista externo es mas sincero que uno que experimenta la supuesta injusticia.\n\n>Como haces KS si las kills en lux supp son bien aprovechadas? Lux support por definicion no puede hacer KS.\n\nNo tienes derecho a quedarte con el Oro siendo supp cuando tu ADC tiene la capacidad de agarrarla. Si son bien aprovechadas o no, eso me da igual: Que tu ADC junte el Oro porque casi seguro lo aprovecha AUN MEJOR.  No, como definicion no: Porque justamente, es supp. Pero arruina mucho la experiencia de juego, lo claro en el ultimo punto.\n\n>Es support porque puede aportar una exelente cantidad de daño magico al equipo, ser MUY util en una dual lane y escala bastante bien con relativamente pocos items.\nAnnie y vel son otros supports exelentes en ciertas circunstancias.\n\nCuando yo voy ADC, no quiero un soporte que haga daño para llevarse el Oro o me deje bulnerables a mis rivales. Yo quiero uno que me defienda, pueda prevenir gankeos y deje inutilizados a mis rivales, que para mi, no es comparable con lo anterior. Y si, items de AP. ¡Pero te digo que sos supp, no te hagas {{item:3285}} {{item:3020}} {{item:3089}} por Dios!\n\n>Pueden funcionar de supports. Aparentemente vos no sabes esto y traspolas tu falta de conocimiento al resto.\n\nNo... No no no... Amigo, aun asi si sabia que la gente (Muy bruta por cierto) usaba esos picks, hubiera puesto lo mismo con el fin de que el que sea el causante de ese \"Meta\" (De dudosa existencia, por cierto) lo deje a un lado y pueda dejar jugar tranquilos a los ADCs.\n\n>Y lux support no es util? LOL\n>\n>Ya con el simple hecho de forzar resistencia magica cuando todo tu team es AD (que es generalmente cuando >queres pickear lux supp) estas incrementando la performance de todo tu equipo.\n>\n>Repito, con el simple hecho de existir ya mejoras la performance de tu equipo. Algo que no se puede decir de por >ejemplo un braum.\n\nHay soportes con mucha mas utilidad. Yo si veo una Karma, que tiene 2 items de AP en late, saco rapido mi Velo de Banshee. Como mucho probocas que saque un item mas de MR, pero no mas (Obviamente, si soy tanque, porque si voy con Rengar no me esfuerzo en tener resitencias muy avanzadas mas que {{item:3111}} y{{item:3156}} ). \n  Es como que yo te diga que Teemo es supp porque los enemigos necesitan comprar Pinks  (O para los mas actualizados, {{item:2055}} ) para evitar sus setas a todo momento.\n\n> Exacto! Como dije al principio, lux es un APC que funciona bastante bien en la botlane. Como annie o vel.\n\nEstas admitiendo que ~~jodes~~ arruinas las partidas de los ADCs. Si yo quiero ir ADC, es porque quiero ser el que carrea, el de kills, el de daño y mas importante. Vos, si pedis supp, esperas ayudar al ADC a cumplir su objetivo, cueste lo que cueste. No vallas supp para sacarle las kills/farm o darle una mala experiencia porque no haces nada para ayudarlo (O ni la mitad de lo que harias con un soporte normal)\nPedi mid, asi de este modo vas a la linea, robas las kills que quieras, farm para vos solo, carreas tambien y por sobre todo, no das una mala experiencia al juego de los demas.\nRepito, Vel o Annie son casos muy  exagerados, y como lo vuelves a mencionar, me parece que lo dices de verdad.\n\nTengo algunas preguntas, como que es el \"Performance\" (Por lo que vi en Google, es algo asi como el rendimiento general), ¿Como usas vos a Lux soporte? ¿Como crees que ayudas al ADC de la forma en la que vas? y ¿Te dio mucho palo leer esto? La proxima intentare ser puntualista y dejar el tema cerrado lo antes posible.\n\n¡Un saludo y nos vemos en los campos de la Justicia! {{champion:33}}","replies":[{"poster":"Mazoku","date":"2016-11-22T04:02:40.681+0000","up_votes":2,"down_votes":0,"body":"> No tienes derecho a quedarte con el Oro siendo supp cuando tu ADC tiene la capacidad de agarrarla. \n\nPor que?\n\n> Si son bien aprovechadas o no, eso me da igual: Que tu ADC junte el Oro porque casi seguro lo aprovecha AUN MEJOR. No, como definicion no: Porque justamente, es supp. Pero arruina mucho la experiencia de juego, lo claro en el ultimo punto.\n\nSeguis sin explicar el por que. El support tiene mas impacto que el ADC en 2/3 de la partida (early y mid vs late). Sinceramente el oro en lux se ve igual o mas aprovechado en el supp que en el adc por gran parte del game.\n\n> Cuando yo voy ADC, no quiero un soporte que haga daño para llevarse el Oro o me deje bulnerables a mis rivales. Yo quiero uno que me defienda, pueda prevenir gankeos y deje inutilizados a mis rivales, que para mi, no es comparable con lo anterior. Y si, items de AP. ¡Pero te digo que sos supp, no te hagas    por Dios!\n\nQue picartdia! Cuando juego lux support juego para todo el equipo, no solo para el ADC. No me interesa en lo mas minimo lo que hagas vos como ADC, yo estoy ahi para ganar no para jugar para vos.\n\n> Hay soportes con mucha mas utilidad. Yo si veo una Karma, que tiene 2 items de AP en late, saco rapido mi Velo de Banshee. Como mucho probocas que saque un item mas de MR, pero no mas (Obviamente, si soy tanque, porque si voy con Rengar no me esfuerzo en tener resitencias muy avanzadas mas que  y ).\nEs como que yo te diga que Teemo es supp porque los enemigos necesitan comprar Pinks (O para los mas actualizados,  ) para evitar sus setas a todo momento.\n\nTeemo support es otro supp viable. Sigo sin entender tu punto. El teemo supp forza al adc a comprarse mercurial o banshee, en vez de otros items defensivos. Eso le da via libre a tus carrys de daño fisico a tener una mayor efectividad a la hora de matar al adc enemigo. Ni hablar del resto.\n\n> Estas admitiendo que jodes arruinas las partidas de los ADCs.\n\nSi el ADC es malo si.\n\n> Si yo quiero ir ADC, es porque quiero ser el que carrea, el de kills, el de daño y mas importante. \n\nEntonces serias uno de esos ADC que no entienden nada del juego.\n\n> No vallas supp para sacarle las kills/farm o darle una mala experiencia porque no haces nada para ayudarlo (O ni la mitad de lo que harias con un soporte normal)\n\nPor que? Si yo soy mas relevante al tener mas daño que el ADC por como dije 2/3 de la partida. Por que el ADC tiene que llevarse todas las kills?\n\n> Pedi mid, asi de este modo vas a la linea, robas las kills que quieras, farm para vos solo, carreas tambien y por sobre todo, no das una mala experiencia al juego de los demas.\nRepito, Vel o Annie son casos muy exagerados, y como lo vuelves a mencionar, me parece que lo dices de verdad.\n\nO puedo pedir support.\n\n> ¿Como crees que ayudas al ADC de la forma en la que vas? \n\nEste es el principal problema: Vos ves al support como la perra del ADC cuando la realidad es que el ADC es la perra del support por la mayoria del game.\nEarly game el ADC NO MARCA EL TEMPO DE LA PARTIDA, es el support el que define la botlane. Mid game el adc es todavia muy squishy y tiene poco daño (sin cc generalmente) como para hacer una diferencia. Es el support el que brilla en mid game.\nLate game el ADC solo aporta daño, mientras que el support boostea la performance del equipo.\n\nComo veras yo prefiero un trillon de veces mas tener un supp platino y un adc bronce que un adc platino y un supp bronce. El segundo caso es casi garantia de una partida en la cual la botlane va a feedear.","replies":[{"poster":"Nuke","date":"2016-11-22T13:24:05.475+0000","up_votes":1,"down_votes":1,"body":"Te la hago corta, porque mas no tengo que decir.\n\nLo que pasa aca es que estamos en una conversacion OBJETIVA (Es decir, que el soporte no ayuda al ADC, pero si al team) con dos opiniones SUBJETIVAS (Que para mi es horripilante, pero para vos es muy obvio).\n Tenemos buenos argumentos, pero de nada sirve si el otro no opina igual.\n\nLo mio se trata de que no quiero ser egoista, no arruinarle la partida a alguien que tenia otras intenciones al pikear ADC. A mi siempre me enseñaron:\n\n SUPP: Utilidad, el carry indirecto. (Ayuda al ADC para que EL carree).\nADC: Un tirador que se  equipa daño de ataque y carrea gracias a su supp.\n\nSi, veo al supp como \"La perra del ADC\", es verdad. Me da igual que vos seas bueno, carrees y toda la cosa... Yo quiero carrear por que para algo pedi ADC. (Repito, al parecer la definicion de ADC que me dieron, que por cierto esta en el nombre... No es valida).\nSi, tambien pienso que prefiero un SUPP Platino y un ADC Bronce, porque... El supp tiene la posibilidad de carrearlo.\n\nEStoy en Plata V, promocion hasta Plata IV. Cuando suba de liga me contacto con vos y te digo una de estas dos cosas:\n_\"- Amigo, tenias razon todo este tiempo: El soporte es el que carrea DIRECTAMENTE\"_\n\no si no...\n\n_\"-Estoy en Platino y sigo compartiendo con muchas personas de mi ELO la misma definicion que aprendi en Plata\"_\nClaro esta: Si subo a Platino JAJAJAJAJAJJAJA... Es poco posible pero bueno.\n\nMe entretube contestando y leyendo tu punto de vista. Es algo sorprendente que hayan tantas opiniones en el Mundo, me gustaria poder conocerlas a todas. Simplemente divertido, poder debatir con personas de dos dedos de frente, poco comun con mi dia a dia.\n\nPD: Me sorprendi con tus Mega-Picks \"\"\"\"\"\"\"\"\"\"\"SOPORTE\"\"\"\"\"\"\"\"\"\"\"\"\"\" Tan OP. \nSin mas que decir, gg wp y...\n\n¡Nos vemos en los campos de la Justicia! {{champion:33}} {{champion:107}} {{champion:121}}","replies":[{"poster":"Mazoku","date":"2016-11-22T15:52:28.951+0000","up_votes":2,"down_votes":0,"body":">   A mi siempre me enseñaron:\n> \n> SUPP: Utilidad, el carry indirecto. (Ayuda al ADC para que EL carree).\n> ADC: Un tirador que se equipa daño de ataque y carrea gracias a su supp.\n\nAhi encontramos un problema bastante heavy. Capas por eso yo subi a platinoob PRACTICANDO SUPPORT y vos estas en bronce.\n\n> Claro esta: Si subo a Platino JAJAJAJAJAJJAJA... Es poco posible pero bueno.\n\nHacelo, pero hacelo jugando support y adc. Como yo. Tranquilamente por ejemplo podrias subir jugando trynda top y no moviendote de la linea en todo el game (despues de todo es bastante facil subir y no requiere mucho game sense para llegar a platinoob).\n\nLo bueno de practicar todos los roles es que podes sacarte de la cabeza cosas como \"La jungla le pertence al jungla\" o \"el segundo blue es del mid\" y empezas a pensar y jugar mas para el equipo que a respetar reglas bobas.\n\nLo malo es que tu liga va a ser una bosta en el corto plazo. Yo estoy en platino 5 porque considero esa liga un minimo para practicar. No me enorgullese ser platino 5, me enorgullese haber llegado ahi practicando casi 60 champions esta season.\n\n> Me entretube contestando y leyendo tu punto de vista. Es algo sorprendente que hayan tantas opiniones en el Mundo, me gustaria poder conocerlas a todas. Simplemente divertido, poder debatir con personas de dos dedos de frente, poco comun con mi dia a dia.\n\nYo tambien, se aprende bastante.\n\nSaludos y suerte!","replies":[]}]}]}]}]}]}]}]}]},{"poster":"KShyGuy","date":"2016-11-27T03:07:58.969+0000","up_votes":1,"down_votes":0,"body":"Peor hay buenas lux soporte. No por que la mayoria de sonas con las que juego la manquean como campeonas  significa que Sona sea un mal supp. Simplemente no saben posicionarse correctamente, y ya.","replies":[{"poster":"NerfAutoFill","date":"2016-11-27T03:23:35.391+0000","up_votes":1,"down_votes":1,"body":"http://champion.gg/champion/Sona/Support\n\nhttp://champion.gg/champion/Lux/Support\n\nhttp://www.lolskill.net/summoner/LAS/KShyGuy","replies":[{"poster":"KShyGuy","date":"2016-11-27T03:39:24.326+0000","up_votes":2,"down_votes":0,"body":"No tienes que restregarme en la cara mi elo bajo. Yo mas que nadie estoy consciente de que soy malo en el juego, pero no me avergüenza ese hecho. Y lo de sona solo era un ejemplo para decir que no por que un grupo de jugadores jueguen un campeon mal en un rol especifico significa que este no sea bueno en ese rol. \nSaludos {{champion:62}} \nPD: El tratar de hacer la opinion de una persona menos relevante por su elo, no te llevara a nada mas que ser visto como alguien arrogante en la comunidad, tratando la opinion de una persona sobre un tema dependiendo de su elo.","replies":[{"poster":"NerfAutoFill","date":"2016-11-27T04:09:43.950+0000","up_votes":1,"down_votes":1,"body":"en tu elo no saben frenar un yi...\n\nEs complicado que no me madee o me ponga arrogante:/ perdon si te ofendiste","replies":[]}]}]}]}]}]},{"poster":"Runth","date":"2016-11-21T20:57:33.427+0000","up_votes":3,"down_votes":1,"body":"lux supp? free kills","replies":[{"poster":"Nuke","date":"2016-11-21T21:34:46.569+0000","up_votes":1,"down_votes":4,"body":"Tu ADC necesita kills, no vos.\nDeja de arruinar las partidas de la gente que solo quiere jugar...","replies":[{"poster":"Runth","date":"2016-11-21T21:37:28.139+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=XNuke69,realm=LAS,application-id=v7qsfXsE,discussion-id=UydBIoMA,comment-id=00050000,timestamp=2016-11-21T21:34:46.569+0000)\n>\n> Tu ADC necesita kills, no vos.\n> Deja de arruinar las partidas de la gente que solo quiere jugar...\n\nhasta una leonas sin daño puede matar a esa campeona de cristal","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2016-11-21T20:48:38.217+0000","up_votes":3,"down_votes":1,"body":"Lux Support es del estilo de Zyra, Karma y Brand Support, depende de quien lo use va a carrear. Personalmente carreo con Lux Support (me armo mitad utilidad mitad daño, al igual que Karma, Zyra y Brand). Armo la piedra vidente SIEMPRE, saco un Rylai, termino el ítem de soporte y tengo Fantasmitas para atrapar enemigos, la Q para rootear (así combear) y la W para escudar al aliado.\n\nSirve armarla así, una vez probé Lux Tanque y de igual manera rinde porque es un champ con bastante daño Base (encima Buffeado actualmente).","replies":[{"poster":"NerfAutoFill","date":"2016-11-21T21:27:21.393+0000","up_votes":1,"down_votes":2,"body":"lo unico bufeado fue el slow y la pasiva hace un poco mas de dano. y RARA vez veo a una lux aplicarla 2 veces seguidas.","replies":[{"poster":"Hwaxinghz","date":"2016-11-21T21:30:21.622+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=grillovsky,realm=LAS,application-id=v7qsfXsE,discussion-id=UydBIoMA,comment-id=00030000,timestamp=2016-11-21T21:27:21.393+0000)\n>\n> lo unico bufeado fue el slow y la pasiva hace un poco mas de dano. y RARA vez veo a una lux aplicarla 2 veces seguidas.\n\nNo me viste a mi entonces ;)","replies":[]}]}]},{"poster":"Dildo de Moria","date":"2016-11-21T20:55:47.796+0000","up_votes":3,"down_votes":5,"body":"Si yo siendo support saco un item que me da AP es porque VOS no me sabes carrear (al menos en mi caso que creo tener incorporado el rol).","replies":[{"poster":"Nuke","date":"2016-11-21T21:49:57.370+0000","up_votes":1,"down_votes":1,"body":"Un item de AP no hace daño. Tranuilo.\nPero tene mas paciencia con el ADC antes de sacar la tipica:\n{{champion:99}} -----> {{item:3089}}  {{item:3089}}  {{item:3089}}  {{item:3089}}  {{item:3089}}  {{item:3089}} {{item:3363}}","replies":[{"poster":"Kokoro Chacarero","date":"2016-11-27T03:56:27.022+0000","up_votes":1,"down_votes":0,"body":"Hola soy Darius y me armo un Rabadon porque somos todos AD y nos falta daño mágico, aunque no tenga ninguna habilidad que haga daño magico y escale con AP al mismo tiempo.\n\nMe pasó en un aram.\n{{sticker:zombie-brand-facepalm}} \n\nLa gente aveces tiene nociones muy burdas sobre el juego.","replies":[{"poster":"Nuke","date":"2016-11-27T06:28:18.330+0000","up_votes":2,"down_votes":1,"body":"Jajajaja. El sangrado es daño magico, pero no se si escala por el. Aun asi muy gracioso, un amigo un dia me dijo \"¿Hay algo mas troll que Pantheon AP?\"\nAy, Cordobez, nunca te olvidare {{champion:35}}","replies":[]}]}]}]},{"poster":"DeaD FalcoN","date":"2017-10-07T15:18:04.237+0000","up_votes":1,"down_votes":0,"body":"Hola me gusta mucho el rol de support. Soy Bronce 3 (si ya se que soy malo... jajaj pero no por eso mi opinion vale menos... no? cierto? Jajaj) bueno dejo mi aporte. \nJuego bastante lux y opino que POKEANDO con la E (siempre ACOMPAÑADO luego por un AUTOATACK para aprovechar la PASIVA) y una Q (SIN OLVIDAR el AUTOATACK) bien puesta puede darte la ventaja en EARLY y ni hablar en MIDGAME con el comba Q + R + AA. \nPero  aclaro INICIAR con LUX seguida por su ADC te da la ventaja (hacrr KS no es de support, personalemte trato de que las kills se las lleve el ADC no me interzan porque no corresponde, pero si no veo una kill segura ya fue el que lo mata lo mata).\nLa E sirve mucho (no solo para el POKE) podes usarla para ZONEAR posicionando al enemigo serxa del rio para los gankeos y/o evitandole el farm al tiempo que lo relentizas y dañas si coninua con el farmeo.. tambien obtenes vision por un instante al utilizarlo en los BUSHES). seguramente olvido algo.\n\nAl ser soporte fija hay que comprar PIEDRA VIDENTE. y un REDGUARD.\n\nY esta bien hacese AP pero busca que tus objetos no sean solo AP (NO EXCLUSIVAMENTE AP)\n\nyo soy muy spellcaster por lo tanto hago MORELLO, luego LITCHE. REDENCION es un buen objeto pero no comence a usarlo. (Mala mia)\nAhora si veo que no me quedo sin mana opto por LITCHE como segunto objeto y pebetero como 3er objeto.\nLa build es muy personal y depende mucho de la partida pero esa es mi AERLY BRONZA BUILD. \n\nPara FINALIZAR... considero que es un support agresivo lux y que su W sirve mas que nada en el LATE no tiene mucha utilidad en el EARLY (salvo al tiempo que te gankean que se lo podes poner a 3 CHAMPS si lo haces bien) porque es un escudo devil al principio y escala poco para mi gusto (20% AP) con RABADON si llegas muy bien al LATE ya mejora mucho. En lo personal priorizo E-Q.","replies":[]},{"poster":"NerfAutoFill","date":"2016-11-21T21:25:07.590+0000","up_votes":4,"down_votes":4,"body":"o sea segun ustedes esta bien que el adc se quede sin peel?\n\nNo comprar pierda esta bien?\n\nLa diferencia entre todoooooooos los suports que me dijeron es que ambos apotan muchisima mas utilidad que lux.\n\nZyra plantas cada 2.3 y un ulti que levanta a todo el team, karma escudo a todo el team o un buen burst cada 20 30 segs, brand dano por %% de vida a todo el team.\n\nLux un snare y un escudito tipo boomerang que esta mas nerfeado que kalista y lento.\n\nSegun champion gg tiene 45% de win rate. pero les parece worth llevarla bot?\n\nhttp://champion.gg/statistics/#?search=lux\n\nno se como tratan de justificar que sirve.","replies":[{"poster":"Kokoro Chacarero","date":"2016-11-27T03:50:30.896+0000","up_votes":1,"down_votes":0,"body":"Hurr durr pero con lux puedo cheesear kills y ganar porque los demás se comen skillshots, andan sin visión y les snowballeo el early y mid porque no hay tanques ni items dfensivos en los adc hurr durr lux support op\n\nPasa que la gente sigue viendo el LoL como team death match.\n  Hago daño y saco kills -------> estoy carreando papu soy feiker","replies":[]},{"poster":"Nuke","date":"2016-11-21T21:48:24.288+0000","up_votes":1,"down_votes":1,"body":"gg wp","replies":[]}]},{"poster":"Eicci ","date":"2016-11-22T11:40:06.910+0000","up_votes":1,"down_votes":0,"body":"Use mucho lux sup y en ese rol saqué m7 y si sirve dependiendo de la composición y habilidad del equipo. Personalmente yo si me hacía el ítem de suport y los wards. Si veía que mi adc era malo me hacia full magia y carreaba. Algunos se van a enojar y otros no te van a decir nada. Lo importante es que el equipo se lleve la kill y ganar. Cuantas partidas he visto que el sup juega mejor y se lleva mas kills que el adc y no se le dice nada.","replies":[]}]}