{"poster":"Suppört 0r Feed","date":"2019-08-03T08:11:26.499+0000","title":"Doppio topic (attitude/gameplay)","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti, come da titolo apro un solo thread ma con due argomenti diversi e separati tra loro, quindi potete rispondere anche a uno solo...\n\n[ATTITUDE]\nAllora, tempo fa (credo l anno scorso o due anni fa) mi avevano dato il softban con il reset dell onore ecc, e da quel giorno sono quasi del tutto reformed. Quasi del tutto intendo dire che non scrivo piu nulla in chat, non parlo con nessuno, non tilto non mi arrabbio con i compagni ma cerco sempre di lasciar scorrere e amen, tanto alla fine è un gioco e non si deve vincere per forza, soprattutto non per un bordino colorato di pixel.\nHo scritto 'quasi del tutto'... perchè ancora ad oggi quando per esempio vedo qualche compagno che sbaglia qualcosa (O IO PENSO CHE STIA SBAGLIANDO) gli pingo mille volte i punti interrogativi.... e stanotte ci ho pensato e probabilmente lo fanno tiltare... anche perchè sono convinto che lui non mi muti i ping e comunque facendo così do fastidio a tutta la squadra. Inoltre se mi muta i ping non vede piu i miei SS oppure le mie relative call... di conseguenza gradirei qualche piccolo consiglio o esperienza personale per smettere anche con queste stupide scenate da BM che pingano duemila volte... grazie.\nedit: ovviamente proverò da oggi stesso a smettere da solo\nPS: anche perchè noto che alcuni game nonostante li carrio io non mi onorano neanche una volta :( {{item:3070}} \n\n[GAMEPLAY]\nHello hellooooo allora, mi sono da poco avvicinato a Swain. Potete guardare il mio op,gg penso di aver fatto 6-7 ranked perdendone una sola... \nin questa ultima ranked c'era la Neeko mid avversaria che con un giro di skill mi shottava (la cappa della magia l'avevo comprata a game gia perso praticamente, però avevo i boots mr)\nLa domanda è: cosa è meglio buildare per avere un po di tanky? La spirit visage mi potenzia la ulti? Per avere più sustain ci potrebbe stare una hextech gunblade?\nPoi le rune... io ora uso la presa dell'immortale ma ho visto alcuni video in cui usano lo scatto fasico... qual'è meglio?\nInoltre vorrei sapere in un teamfight come mi dovrei posizionare? e chi focussare? Devo stare frontline avendo comunque circa 3k hp oppure aspettare che i nemici abbiano usato un po di summoners e spell? perche comunque come dicevo all'inizio mi sono trovato un po squishy.\n\ngrazie ragazzi e buon game","replies":[{"poster":"Luckynanix","date":"2019-08-03T08:21:07.568+0000","up_votes":1,"down_votes":0,"body":"Pinga solo quando serve o se proprio uno inta malamente uno due ping li puoi fare ma per il resto non c'è molto da dire","replies":[]}]}