{"poster":"fabseN no tilt","date":"2016-09-30T20:23:28.372+0000","title":"Team Quickplay sucht einen Plat 2 + Support mit Erfahrung","subforum":"Clans & Teams","embed":{"description":"Und da sind wir! Die Quickplay Gaming Community hat sich am 01.08.2016 erfolgreich gegründet! Um allen Besuchern einen kleinen Überblick zu verschaffen, wollen wir unsere Ziele möglichst transparent zur Schau stellen. Größte Priorität hat zur Zeit natürlich die Membersuche in all unseren Bereiche.","url":"http://quickplay-gaming.net/","image":"http://quickplay-gaming.net/admin/upload/upload_background/1474046910-Header.jpg"},"up_votes":1,"down_votes":0,"body":"Quickplay-Gaming Main-Team sucht einen Support [Plat 2+]\r\n\r\nWie schon oben erw&auml;hnt, suchen wir (das Main-Team von dem Multi-Gaming Clan Quickplay-Gaming) einen Support.\r\n\r\nWir repr&auml;sentieren unseren Clan als erstes Team bei Turnieren sowie anderen Events im Bereich League of Legends. \r\n\r\nWir drei kennen uns bereits seit einigen Jahren und haben schon gemeinsam Teamerfahrung gesammelt (unter anderem Einzug ins Halbfinale bei King of \r\nSpandau sowie das Gewinnen von anderen kleineren Turnieren, bzw Top4-Platzierungen).\r\nJedoch fehlt uns nach mehreren Tryouts in den letzten Wochen immer noch die passende Botlane.\r\n\r\nWas erwarten wir von euch?\r\n\r\nSupport auf Main-Position \r\nentsprechende Gameknowledge (ideal w&auml;re das Einbringen des Supporters im Bereich Shot-Calling, sowie das Aufbauen von Synergie mit unserem Jungler in den Bereichen, Warding, Mapcontrol, Roaming etc.\r\nMeta Picks, beziehungsweise das Anpassen der Picks an die jeweilige Spielsituation (das hei&szlig;t OneTrickPonys sind eher ungern gesehen)\r\nCalls ausgehend von unserer Botlane \r\nDie M&ouml;glichkeit mindestens 3x in der Woche ab 18 Uhr zu Trainieren ( das hei&szlig;t: Teamranked, Scrims, Replays anschauen, League of Legends Theorie)\r\nSowie das Ziel sich in LoL zu improven und st&auml;ndig weiterzuentwickeln \r\n\r\nWas hat unsere Community euch zu bieten?\r\n\r\n\r\nEinen Teamspeak-Server, sowie Gameserver f&uuml;r Spiele, wie Minecraft, mit ~100 aktiven Membern\r\nErfahrene CS:GO- und LoL-Spieler, die euch gerne bei Bedarf unterst&uuml;tzen &rarr; Coaching\r\nAufstiegsm&ouml;glichkeiten innerhalb der Community \r\nErfahrene Leader der einzelnen Bereiche\r\nInterne 1v1 Turniere \r\nFun Modus 5v5 Mit Urf &amp; co.\r\n\r\nWenn ihr Interesse habt dann schreib einfach hier drunter, oder Addet mich einfach in LoL (hi im mnL).\r\nIhr k&ouml;nnt auch einfach auf den Ts3 Server von uns Vorbei schauen, ihr werdet dann direkt an uns weitergeleitet. IP: ts.quickplay-gaming.net\r\n\r\n\r\nMit freundlichen Gr&uuml;&szlig;en,\r\n\r\nhi im mnL","replies":[]}