{"poster":"NISEEL DOG","date":"2018-07-01T21:29:09.628+0000","title":"\"AR\" URF.","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"I need an answer, and one that explains it to the T.\r\nIf I go over all my matches and place them together; I see that I have gotten the same.. 10-15 champions over, and over even after using rerolls like they have gone out of fashion.\r\nWhy is there still a &quot;Favored&quot; random picks with a higher chance to be seen? There are over 120+ Champions and not seeing every single one of those is disgusting, it&#039;s not &quot;AR URF&quot; At all if there&#039;s only 30 champions at best seen on the rift, there&#039;s no fun in it if we can&#039;t get those champions; the ones that are never seen.\r\n\r\nI&#039;d love to see OLD Urf where you could pick anything troll, **** I would love to go back to the Ban Pick Phase of URF, something where I can see other champion pools.\r\n\r\nFor an EVENT that comes out barely enough as it is, this should be more &quot;fun&quot; and have more champion pools.\r\n\r\nAnd the proof behind this is; many, many urf games between accounts of different champions just to make sure it wasn&#039;t me being unlucky.\r\n\r\nSO why is this happening exactly?","replies":[{"poster":"GoForkYourself","date":"2018-07-09T10:32:08.010+0000","up_votes":2,"down_votes":0,"body":"ive got 50-70 games so far this URF. I have seen... Nautilus, kai'sa and Ivern once, with ivern only in champ select, not in game. While Ryze and Sona are clearly disabled (which is stupid as hell, Sona is no less broken than Wukong or Garen, and ryze is... well, just another champ with his new skills).\nI know that people reroll to get their favoured OP champions, but even if they just leave it as equal chances for EVERY champ.\nThe entire point of URF is that it is unbalanced and silly\nI disagree with letting us pick, AR is better... with a few tweaks\n1: earlier surrender - 15 minutes for a unanimous is way too long. most URF games are decided by 10 minutes (and the winning side rarely wants to end)\n2: EVERY champ with same chances\n3: possibly lower kill gold value, or a faster value dropoff for people that are getting farmed (a 0-10-0 should be worth as much as a ranged minion, really. what are they gunna do vs a 25-0 hecarim?)","replies":[{"poster":"Project Xayah","date":"2018-07-09T13:05:10.799+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FarCough,realm=OCE,application-id=Ntey9fRZ,discussion-id=PeNAuXZo,comment-id=0002,timestamp=2018-07-09T10:32:08.010+0000)\n>\n> The entire point of URF is that it is unbalanced and silly\n> I disagree with letting us pick, AR is better... with a few tweaks\n> 1: earlier surrender - 15 minutes for a unanimous is way too long. most URF games are decided by 10 minutes (and the winning side rarely wants to end)\n> 2: EVERY champ with same chances\n> 3: possibly lower kill gold value, or a faster value dropoff for people that are getting farmed (a 0-10-0 should be worth as much as a ranged minion, really. what are they gunna do vs a 25-0 hecarim?)\n\nDefinitely agree with this. URF is *supposed* to be unbalanced, silly and just for fun, but for some reason there are way too many people try-harding it. People need to realise that just doesn't go with a mode such as URF, whether it's AR or not.\n\nRegarding the suggested tweaks:\n\nI can certainly agree with a reduction on the minimum time for surrender votes. URF is not normals, and has a *much* faster pace, it should have a surrender vote \"timer\" that reflects that, in similar way as ARAM. Perhaps the votes could be brought back by 5 minutes, allowing unanimous at 10 mins and majority at 15.\n\nWhenever it comes to AR pick modes, I am *always* of the opinion that they should have *every* champion be free to play. For one thing, it gives *every* player an equal opportunity for any given champ, with the added bonus of preventing things like \"ARAM accounts\", which have champ pools designed specifically around what is powerful for these modes.\n\nGoing back to the same basic point as the surrender votes, URF is a much faster paced mode, it makes sense to have kill-gold values that reflect that. A player can die anywhere between 3-10 times faster (based on personal experience, and everything I've seen about the mode) in URF than they can in normals, and that *quickly* accounts to a lot of gold, and a lot of power for the killer. It's a change I can certainly agree needs to be considered.","replies":[]}]},{"poster":"Project Xayah","date":"2018-07-02T02:56:09.684+0000","up_votes":1,"down_votes":0,"body":"I'm going to tell you a short, true story.\n\nEvery time ARURF hit's the rift, I see about a dozen or so players complaining about exactly this. You know what I don't see? The other several hundred thousand players saying *anything* about this. The queue is random, but that doesn't *always* translate to a \"true random\" experience.\n\nThink about it like a bell curve (if you don't know what that is, just google it. It's a fairly simple concept). On the one side, you have (few) players who will see the same champs a lot more often, on the other side you will (few) have players who struggle to see the same champion appear a second time, and in the middle you will have the players who will see some champions a lot, but also see other champions with reasonable frequency. That \"centre point\" is what the bulk of the players would experience. *Keep in mind, this is just an example. The specifics of it could be different.*\n\nPersonally, I have no trouble getting a more \"random\" experience than players such as yourself complain about. It's not like I've seen a whole new set of champs each time I've played, but the most I've seen any given champ, this time around, is twice (specifically Sivir and Kai'Sa), and that usually holds true for every instance of ARURF.\n\nYou can think of it like flipping a coin. Do it 10 times and it could very well come out with 8 head and 2 tails, which wouldn't suggest it's somewhat \"random\", but someone else doing it those same 10 times could come out with 5/5, which *would* suggest it's somewhat \"random\".","replies":[{"poster":"BearGrillz34","date":"2018-07-02T06:00:20.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HeartVine,realm=OCE,application-id=Ntey9fRZ,discussion-id=PeNAuXZo,comment-id=0001,timestamp=2018-07-02T02:56:09.684+0000)\n>\n> I&#x27;m going to tell you a short, true story.\n> \n> Every time ARURF hit&#x27;s the rift, I see about a dozen or so players complaining about exactly this. You know what I don&#x27;t see? The other several hundred thousand players saying *anything* about this. The queue is random, but that doesn&#x27;t *always* translate to a &quot;true random&quot; experience.\n> \n> Think about it like a bell curve (if you don&#x27;t know what that is, just google it. It&#x27;s a fairly simple concept). On the one side, you have (few) players who will see the same champs a lot more often, on the other side you will (few) have players who struggle to see the same champion appear a second time, and in the middle you will have the players who will see some champions a lot, but also see other champions with reasonable frequency. That &quot;centre point&quot; is what the bulk of the players would experience. *Keep in mind, this is just an example. The specifics of it could be different.*\n> \n> Personally, I have no trouble getting a more &quot;random&quot; experience than players such as yourself complain about. It&#x27;s not like I&#x27;ve seen a whole new set of champs each time I&#x27;ve played, but the most I&#x27;ve seen any given champ, this time around, is twice (specifically Sivir and Kai&#x27;Sa), and that usually holds true for every instance of ARURF.\n> \n> You can think of it like flipping a coin. Do it 10 times and it could very well come out with 8 head and 2 tails, which wouldn&#x27;t suggest it&#x27;s somewhat &quot;random&quot;, but someone else doing it those same 10 times could come out with 5/5, which *would* suggest it&#x27;s somewhat &quot;random&quot;.\n\nIt's because hardly anybody goes on the boards. Everytime I all chat \"Who hates arurf and would prefer normal urf with bans\" EVERYONE from both teams say YES I HATE ARURF. \n\nThey just don't do anything about it cause they either cbf'd or don't go on reddit/boards.","replies":[{"poster":"Project Xayah","date":"2018-07-02T06:50:12.775+0000","up_votes":1,"down_votes":0,"body":"Hating ARURF isn't the same as *constantly* getting the same champions in an All-Random pick-type mode. There are plenty of reasons that people hate ARURF, and it's not just because of that.\n\nBesides, where in the hell did I say that these \"complainers\" were strictly on the boards?","replies":[]}]}]},{"poster":"BearGrillz34","date":"2018-07-02T01:19:17.167+0000","up_votes":1,"down_votes":0,"body":"Same here. I'm getting sick and tired of this.\n\nI vs the same champs, I get the same champs. This isn't random at all!\n\nJust let us ** pick our champs please... Jesus christ","replies":[]}]}