{"poster":"Banana Joes","date":"2015-12-21T09:39:50.253+0000","title":"afk intenzionale ranked game","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Salve ragazzi,\nieri in ranked giorcando con nami mi &egrave; successo di ritrovarmi 8/1/10\n, nel momnento in cui &quot; stealo&quot; (molti saprano come funziona la w di nami), la kill il nostro top esce ed inizia ad insultare in privato, possiedo il video di cio che &egrave; successo e vorrei in qualche maniera far punire codesto player.\nin quanto ha fatto perdere un team lasciandoci in 5 vs 4 e mettendomi di mal umore per cui non ho potuto dare il massimo di me.\nspero la riot non accetti questo tipo di comportamento.\nRingrazio chi mi dira le istruzioni da seguire^^","replies":[{"poster":"Easlay","date":"2015-12-21T13:35:27.422+0000","up_votes":2,"down_votes":0,"body":"ignora, anche se frustrante. Ci sono i periodi no (oggi 4 ranked di fila con il flamer di turno che poi prende e va afk), ma basta non rodersi il fegato e prenderlo per un gioco","replies":[]},{"poster":"Banana Joes","date":"2015-12-21T10:05:56.179+0000","up_votes":2,"down_votes":0,"body":"^^ grazie ragazzi adesso punto al platino^^ ieri mi ha pure detto che essendo support non posso che essere carriato, vabbeh^^","replies":[]},{"poster":"Banana Joes","date":"2015-12-21T09:59:31.878+0000","up_votes":1,"down_votes":0,"body":"Per questo nessuno va support, amo quel ruolo ma uno  che esce e mi insulta solo per usare la mia w. beh non ho parole","replies":[{"poster":"Dr LouD","date":"2015-12-21T10:02:47.155+0000","up_votes":2,"down_votes":0,"body":"Brutta la vita del jungler/support\nGanki/aiuti e..\nSe aiuti e prendi la kill sei noob, se lasci la kill e l'alleato crepa, sei noob perche non hai aiutato\n\nWut","replies":[]}]},{"poster":"Brillabong","date":"2015-12-21T12:32:17.636+0000","up_votes":1,"down_votes":0,"body":"Ti capisco e anche secondo me il report non è che un piccolo fastidio, proprio poco fa ho finito una partita di-sa-stro-sa ranked con troll doppio mid e gente in top e in bot che ha iniziato ad andare Afk insultando tutti a caso. Premesso che sono entrato da poco nelle ranked il gioco mi appassiona di brutto e vedere gente così non fa altro che venire la voglia di disinstallare tutto subito e spaccare il pc. Da quanto fatto vedere con le nuove code una parte del disagio dovrebbe sparire ma vedremo.\nNon posso stare senza LOL","replies":[]},{"poster":"I Love Juventus","date":"2015-12-21T12:29:15.238+0000","up_votes":1,"down_votes":0,"body":"È arrivato er piagnina","replies":[]},{"poster":"DeDiam0nd","date":"2015-12-21T12:01:15.184+0000","up_votes":1,"down_votes":0,"body":"anche a me è capitato..ignora e vai avanti.\nIo ho avuto un adc che ha terminato 0/20 facendosi killare intenzionalmente,...che ci vuoi fare bisogna saper accettare il gioco dove è frequentato da tanti bimbiminchia,..la forza nelle Solo Q si vede anche dal saper carriare questi individui..","replies":[]},{"poster":"Banana Joes","date":"2015-12-21T10:40:38.332+0000","up_votes":1,"down_votes":0,"body":"OVVIAMENTE bloccato perche??\n^^","replies":[]},{"poster":"AnDGames","date":"2015-12-21T10:35:40.690+0000","up_votes":1,"down_votes":0,"body":"ma l'hai bloccato? ce l'hai tra gli amici? \n\n{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Banana Joes","date":"2015-12-21T09:48:55.666+0000","up_votes":1,"down_votes":0,"body":"Lo spero perche gente del genere non merita di giocare. escono insultano e beh non so cosa poteva fare di peggio, ah si aveva pure feedato la lane","replies":[]},{"poster":"Dr LouD","date":"2015-12-21T09:45:53.634+0000","up_votes":1,"down_votes":0,"body":"Basta il report","replies":[]},{"poster":"Firenheit","date":"2015-12-21T09:55:34.383+0000","up_votes":1,"down_votes":1,"body":"Non preoccuparti, alle peggio dovrà aspettare minuti prima d'iniziare una partita le prossime 5 partite, alle peggio o altrimenti non avrà alcuna punizione perché \"è la prima volta che lo fa\" :)\n\nDobbiamo essere fieri di questo sistema, scoraggia chiunque a trollare/andare AFK :)","replies":[]}]}