{"poster":"Send Nuggets","date":"2017-02-10T08:18:02.908+0000","title":"Cola Reclutamiento, ¿dónde nos encontramos? Kappa","subforum":"Off-topic y temas personales","up_votes":13,"down_votes":1,"body":"Hola a todos,\r\n\r\nResumen: a comienzos de la Pretemporada 2017, tanto LAS como otras regiones deshabilitamos la cola Normal de Reclutamiento con el fin de asegurarnos que las nuevas colas Clasificatorias Solo/D&uacute;o y Flexible contaran con &iquest;buena salud? Hace unas horas, el equipo de EUNE anunci&oacute; que volver&iacute;an a habilitar las colas Normales de Reclutamiento por periodos de 12 horas cada d&iacute;a. Regresarlas en LAS posiblemente sea la mejor decisi&oacute;n, pero representar&iacute;a un riesgo a la salud de las colas que a&uacute;n estamos evaluando, es decir, conoces Maze Runner? lo de C.R.U.E.L? Bueno, parecido, estamos haciendo un experimento social, i mean, quitamos su cola favorita y pusimos una innecesaria, pero tranquilos, es para evaluarlas. Kappa.\r\n\r\nEstado actual\r\n\r\nHace unas horas, el equipo del servidor de Europa del Noreste (EUNE) no se puso la gorra y anunci&oacute; en sus foros que la cola de Reclutamiento se volver&iacute;a a habilitar de forma diaria y durante periodos de 12hs. Esta decisi&oacute;n es el resultado de una investigaci&oacute;n (&quot;investigaci&oacute;n&quot; sonaba bien viste, nos hace sentir bien, pero as&iacute; somos ;P) para determinar si era posible dar respuesta a los jugadores afectados por este cambio, (tuvimos mas de mil quejas semanales pero #YouOnliLiveOnes sabes) y sin afectar la salud general de las colas en el servidor. Kappa2\r\n\r\nComo ya saben, toda nuestra comunidad tambi&eacute;n lo manifest&oacute; (y al d&iacute;a de hoy lo sigue haciendo) la necesidad de traer de regreso la cola Normal de Reclutamiento. Los motivos incluyen:\r\n\r\nJugadores que no desean tener una experiencia tipo Reclutamiento en una cola de clasificatoria porque no les interesa el aspecto competitivo que conlleva una clasificatoria.\r\n\r\nJugadores que consideran que Normal Oculta no es una buena cola de reemplazo para Reclutamiento\r\n\r\nJugadores que desean una experiencia tipo Reclutamiento para practicar antes de comenzar a jugar clasificatorias.\r\n\r\nJugadores que no tienen ganas de soportar a gente que no se toma en serio la cola y se ponen a probar campeones\r\n\r\nJugadores que no tienen ganas de gritar su linea como animales antes de poder jugar una partida en paz y el que entre primero gana, you know, en realidad podemos hacer lo que queramos porque igual vas a seguir jugando, tu alma nos pertenece. Me voy a rankear con otros rioters, miren, no se porque hago el post, dios mio que calor.\r\n\r\nNosotros, al igual que las otras regiones, hemos venido realizando el mismo trabajo de monitoreo de EUNE (es posta, estamos trabajando) y a&uacute;n estamos evaluando el mejor camino a tomar (usamos internet explorer y aun no nos llegan sus quejas de hace meses :c). Es importante que tengan en cuenta que las condiciones de nuestro servidor en t&eacute;rminos de n&uacute;mero de jugadores, horarios de actividad y uso de las colas son diferentes a las de Europa, pero aun la mayoria de LAS estuvo desconforme y nuestros datos iniciales muestran que distribuir a la base de jugadores en m&aacute;s colas podr&iacute;a tener un efecto negativo en los emparejamientos y los tiempos de espera. Podr&iacute;amos volver a las colas de antes, eso seria buena idea, pero baf, que paja.\r\n\r\nSiguientes pasos\r\n\r\nSabemos que existe una necesidad que a&uacute;n no ha sido resuelta del todo para todos los jugadores. Apenas resolvamos cu&aacute;l ser&iacute;a el mejor camino para todos (si, todav&iacute;a no lo hemos hecho &iquest;que loco no?) les compartiremos una actualizaci&oacute;n. Lo importante a la hora de tomar una decisi&oacute;n, como la de reabrir la Cola Reclutamiento, es que esta acci&oacute;n no repercuta negativamente en la experiencia de juego al emparejarse en dicha cola o en las dem&aacute;s. Baf, mira, sabemos que eso no va a pasar, es que, imaginen a alguien en los foros quej&aacute;ndose por eso JAJAJAJAJA, vaya prank.\r\n\r\nMientras tanto, nos gustar&iacute;a conocer la experiencia que han tenido los jugadores de reclutamiento hasta el momento con la Cola Flexible (como ya dijimos, usamos explorer y aun no llegan sus quejas :C). &iquest;Qu&eacute; tal est&aacute;n los tiempos de espera? &iquest;Qu&eacute; opinan de la experiencia de jugar con campeones que a&uacute;n no dominan en esta cola? &iquest;C&oacute;mo perciben el emparejamiento? &iquest;Y qu&eacute; hay del nivel competitivo y seriedad con la que se la toman los jugadores? Sus comentarios ser&aacute;n una buena forma de mantener una conversaci&oacute;n constructiva para los equipos de Riot que trabajan en mejorar el dise&ntilde;o de las colas.\r\n\r\n\r\nhttp://gph.is/2cO5JGU","replies":[{"poster":"Thails SirYordle","date":"2017-02-11T04:25:59.974+0000","up_votes":2,"down_votes":0,"body":"Te la trivagomamaste prro","replies":[]},{"poster":"Cyclosarin","date":"2017-02-10T11:10:35.012+0000","up_votes":2,"down_votes":0,"body":"Yo, hasta el dia de hoy, sigo sin entender porque han quitado normal draft, dejado la basura de blind pick e inventar algo tan inútil como las flex.\nEra todo TAAAAAN fácil y lógico en el 2015:\n\nRankeds Duo/SoloQ\nRankeds en equipos (con nombre, propio MMR, podian jugar los diamantes con sus amigos bronces competitivamente, propias estadisticias y una página, en el cliente, para ellos, algo muy divertido realmente)\n\nNormal Draft\nBlind Pick\n\n4 modos de juego y todo funcionaba bien o, al menos, mejor que ahora. Es cierto que tal vez habia que esperar un poco en las normal draft, pero tampoco era una locura, lo maximo que esperé, y fue muuuuy raro, fuerons unos 7/8 minutos, pero en general en menos de 3 minutos ya estaba jugando. Y, si consideamos que el servidor, desde 2015 a 2017 ha crecido exponencialmente, todas esas colas tendrian muchisima mejor salud.\n\nEn fin, no creo que haya una explicación, con argumentos reales, para decirme que esas colas y modos de juegos funcionan peor que las actuales, pero me encantaria saber la opinión de los Rioters","replies":[{"poster":"WilfreCheesemice","date":"2017-02-10T15:12:03.184+0000","up_votes":2,"down_votes":0,"body":"Tienes razón, a mi me gusta blind pick, también draft pero es la cola que aprendí a jugar. es cierto que es tóxica, pero es tan fácil como poner las 4 colas como en season5 y todos felices.","replies":[]}]},{"poster":"lordeman10","date":"2017-02-11T22:21:55.414+0000","up_votes":1,"down_votes":0,"body":"https://gifigif.com/wp-content/uploads/2017/02/giphy-1-7.gif\n\nque actoraso","replies":[]},{"poster":"martincarp","date":"2017-02-10T11:13:28.547+0000","up_votes":1,"down_votes":0,"body":"Good effort dude, me sacaste algunas risas, +10 y fav pa.","replies":[]},{"poster":"Kuma no Michi","date":"2017-02-10T08:38:02.444+0000","up_votes":1,"down_votes":0,"body":"ME ENCANTÓ ME MORI DE RISA JAJAJAJAJAJAJAJAJAJAJAJAJA +1","replies":[]}]}