{"poster":"Alphant","date":"2018-02-20T12:27:39.692+0000","title":"Jinx - Conceptos de skins","subforum":"Creaciones de la comunidad","embed":{"description":"Three skins concepts for jinx 1) Resistance Jinx 2) Ops Arctic Jinx 3)Demon Jinx","url":"https://www.artstation.com/artwork/O5EeJ","image":"https://cdnb.artstation.com/p/assets/images/images/009/288/137/large/emmanuel-martinez-todas-copia.jpg?1518125779"},"up_votes":15,"down_votes":1,"body":"Buenos d&iacute;as comunidad.\r\nQuer&iacute;a compartirles estos conceptos de skins que he hecho  para Jinx.\r\nActualmente tengo 11 conceptos creados, pero, por el momento, s&oacute;lo tengo publicados estos tres.\r\nEspero les gusten y puedan darme sus opiniones al respecto.\r\nQuiero comentarles tambi&eacute;n que la Jinx rebelde fue pensada para el Riot Contest Art 2017 que se llev&oacute; a cabo en la p&aacute;gina de Polycount.\r\nLa he pensado como compa&ntilde;era de Illaoi, antes de saber el nombre de su futura nueva skin.\r\nLes dejar&eacute; tambi&eacute;n link para que puedan ver el splash art. Obviamente no tiene el nivel que muchos otros concursantes, pero hice mi mayor esfuerzo y prometo mejorar.\r\nGracias por haberse tomado un momento de su tiempo para ver los conceptos.\r\n\r\nSplash art Jinx Rebelde:\r\nhttps://www.artstation.com/artwork/enPLG \r\n\r\nSaludos a todos.\r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"ImperfectIvo","date":"2018-02-20T18:17:03.855+0000","up_votes":1,"down_votes":0,"body":"Mi favorita es Demon {{champion:222}}, se ve genial, el concepto va muy bien el campeón (si hicieron una de {{champion:254}} tranquilamente podrían seguirla con {{champion:222}} porque no pega mucho con {{champion:51}}) Es una skin candidata a ser oficial\n\n-_-\n\nApoyo la idea de que haya mas skins del estlo \"Resistencia {{champion:51}} \" o \"Imperial {{champion:99}}\" (temática militar, aunque recientemente salió {{champion:50}} que es como el milico supremo en su máxima expresión) {{champion:222}} de la resistencia me parece un concepto erróneo, porque es una rebelde sin causa que destruye cosas sin un motivo particular, eso implica 0 disciplina. Si le diesen una skin de guerra, tendría que ser algo así como \"{{champion:222}} Terrorista\".\nSi vamos al caso, \"Star Guardian {{champion:222}} \" tampoco tiene que ver, pero sigue teniendo su esencia, es decir, ser una amante de la destrucción, pero con mucha mas cordura. Para hacer \"JInx Resistencia\" tendrían que convertirla en una especie de {{champion:51}}, sería un embole.\n\n-_-\n\nMe gusta mucho el splash-art de {{champion:222}} rebelde, se nota que le pusiste mucho tiempo y prestaste atención a los detalles, te admiro!\nLa skin es similar a \"Jinx ejecutora\" con toques de las \"Skin Comando\" \nA juzgar por el fondo y el ambiente, se parece al ambiente de Piltover pero algo mas futurista y macabro, como si {{champion:112}} creador hubiese gobernado la ciudad y transformado a muchos en robots. Podrían hacer una historia en donde Jinx y algunos más se rebelan contra su mandato y se niegan a ser convertidos en robots.\n\n-_-\n\nCambiando un poco de tema, siempre soñe que algún día le iban a dedicar a un personaje de un Anime (Mira Nikki) una skin de {{champion:222}}. Ese personaje esta en un Anime que ya le dedicaron a otro personaje 1 referencia en una skin y en un sticker (Yuno)\nhttps://imgur.com/Tb6YS8X {{sticker:sg-jinx}} \n\nhttps://imgur.com/1TEgFIy (El pelo es casi igual al de Yuno) \nhttps://imgur.com/8a2WQ4w\n\nYep, estoy hablando de Uryuu Minene, la terrorista (¿Te suena {{champion:222}} ?)\nVamos, el único personaje que le agarras verdadero cariño de todo el Anime (Yuki es detestable hasta el final, Yuno no me termino de cerrar y el resto no están muy desarrollados)\nhttps://imgur.com/BoUKAOq\nhttps://imgur.com/Sgxma3U\n\nOjala cumplas con publicar los otros conceptos, ya los quiero ver {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Alphant","date":"2018-02-20T21:38:00.440+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por tu comentario, la verdad es que me sorprendió jaja\nPensé en Jinx rebelde por el motivo de que es un persona desenfrenado al que le gusta la destrucción y ese tipo de cosas. Entonces, que tal si Jinx se vuelve parte de la resistencia contra las máquinas? Y si sacara las piezas de los blindajes bélicos e hiciera con ellos sus propias arma?\nDe ahí decidí que con tal de sentir la pasión de derribar cosas, sería capaz de arriesgar su vida.\nA quien no me gustaría agarrar un lanzamisiles y derribar robots que están destruyendo la ciudad?","replies":[{"poster":"ImperfectIvo","date":"2018-02-20T22:00:12.258+0000","up_votes":1,"down_votes":0,"body":"Exacto, tal y como entro en el grupo de Star Guardian, forma parte de \"la resistencia\" pero a su manera (te dejo a tu criterio si queres ponerle o no un uniforme del estilo resistencia o un look simple)\nLas armas podrian ser las mismas, Carapescado, Zap y \"PowPow\" ya tienen su propia historia, quizá unos agregados futuristas a las armas como para hacer parecer que fueron mejoradas sería ideal {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Alphant","date":"2018-02-20T22:18:25.762+0000","up_votes":1,"down_votes":0,"body":"No pensé en hacerle un atuendo tipo guerrilla, directamente ropa maltratada, mangas rotas, remera agujereada, etc. En lugar de su particular tatuaje, le deje marcas de  tintura negra o grasas, sea lo que sea.\nFue algo complicado ya que Jinx Ejecutora tiene una chaqueta  también, entonces pensé \"podría hacerla con sólo la remera?\" Y luego me di cuenta que sin remera podria verse algo vacía, necesitaba algo más. Le hice un chaleco bien arreglado, pero estaba muy cuidado para estar en un ambiente muy destructivo, por ende decidí \"romper\" sus mangas.\n\n------\n\nCambiando de tema, tengo las demas skins listas, pero me faltan sus armas pasar a limpio. Ni bien las haga en la pc, las publico.","replies":[]}]}]}]},{"poster":"Jinxie","date":"2018-02-20T13:50:22.649+0000","up_votes":1,"down_votes":0,"body":"Demon {{champion:222}} Jinx y Resistence {{champion:222}} Jinx estaaaaaaaaaan op","replies":[{"poster":"Alphant","date":"2018-02-20T14:28:22.832+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias jejeje mas adelante subiré los otros 8 conceptos\n{{sticker:sg-jinx}}","replies":[]}]}]}