{"poster":"Tychusfindlay918","date":"2018-01-28T05:58:23.264+0000","title":"So a rioter said that sometimes they're willing to sacrifice immediate balance...","subforum":"Gameplay","up_votes":62,"down_votes":81,"body":"So that unique or otherwise horrifically underpowered champions can see play.\r\n\r\n{{champion:20}}\r\n\r\nWell guess what, that&#039;s a horrible fucking philosophy.","replies":[{"poster":"Lùmen","date":"2018-01-28T12:29:39.890+0000","up_votes":56,"down_votes":2,"body":"You literally took it out of context. Good on you..","replies":[{"poster":"Davaken","date":"2018-01-28T16:53:08.463+0000","up_votes":19,"down_votes":0,"body":"Welcome to the Boards, where every Rioter is scared to say anything because what they say will be taken out of context or misunderstood, and then when they do actually say something, it is taken out of context or misunderstood.","replies":[]},{"poster":"Velzard of Koz","date":"2018-01-28T16:38:30.199+0000","up_votes":12,"down_votes":0,"body":"He didn't per se take it out of context, he just collossally missed the point.","replies":[]},{"poster":"Lios Ashenblade","date":"2018-01-28T17:31:06.203+0000","up_votes":7,"down_votes":0,"body":"This just in, Rioter seen eating at taco bell, confirmation that riot discriminates against burger chains","replies":[{"poster":"Terozu","date":"2018-01-28T17:34:00.355+0000","up_votes":4,"down_votes":0,"body":"Lmfao.\n\nRioter seen shopping at Wal-Mart, Riot discriminates against all other stores.","replies":[{"poster":"Lios Ashenblade","date":"2018-01-28T17:42:31.666+0000","up_votes":5,"down_votes":0,"body":"Target to pull League of Legends cards off shelves","replies":[]}]}]}]},{"poster":"Riot MapleNectar","date":"2018-01-28T18:04:21.964+0000","up_votes":47,"down_votes":2,"body":"Interesting point of view. If you don't mind me asking, could you show me where I said that in my post regarding nunu?","replies":[{"poster":"Yoona Senpai","date":"2018-01-28T18:21:11.980+0000","up_votes":40,"down_votes":1,"body":"So sad how Maple Nectar writes a fucking bible explaining the intricate processes of making changes to the game and this person disgustingly summarizes everything he said in one sentence that's extremely biased. Could've linked the post Nectar commented on or at least say \"Maple Nectar\" instead of simply saying \"a Rioter\". Obviously didn't do that because any reasonable person would've seen how biased the OP was after reading Nectar's long explanation. The OP is farming for upvotes and not contributing anything constructive.","replies":[{"poster":"GayFluffyUnicorn","date":"2018-01-28T20:19:44.613+0000","up_votes":3,"down_votes":9,"body":"Not trying to pick sides here but mentioning maple could have easily lead to the deletion of the post because \"witch hunt\". \nI wouldnt mention a rioters name in any case either.","replies":[{"poster":"Yoona Senpai","date":"2018-01-28T21:49:58.972+0000","up_votes":5,"down_votes":0,"body":"People quote Rioters all the time bud. They even quote themselves sometimes to save time explaining the same thing twice and post a link. \nHowever, as a provider of information, it's responsible to present a valid source (a link) to support a claim. In this case, he made a very aggressive claim without a clear source. \nIf the OP had said he disagreed with \"the philosophy\" (mentioned in his post) without the aggression he expressed and quoted Maple's comment, there is nothing wrong with that. You can quote a Rioter to further question and start a constructive conversation. \nA witch hunt would be so immature and irrelevantly out of the picture.  \n\nBesides, Maple himself appeared in this post (when the post had 40+ upvotes, now 0) and basically said \"hey i'm the one who you are referencing right? whats the problem?\" when the OP didn't even mention his name. A \"witch hunt\" is impossible if the \"witch\" appears confidently claiming that he is the \"witch\" before the hunt happens. \n\nAlso the OP made a aggressive claim that degraded a Rioter (which degrades Riot as well) without any referencing. That's just stupid. \nAnd a Rioter comment is available to anyone to read, the idea of a witch hunt because someone mentions a comment that has already been publicly read is also stupid. Not mentioning the Rioter's name and link to the post they made when making an aggressive claim specifically directed to a particular Rioter (Maple knew it was himself duh) is also meaningless and stupid.","replies":[]}]}]},{"poster":"Sqkerg","date":"2018-01-28T18:07:31.649+0000","up_votes":9,"down_votes":0,"body":"I respect your commitment, but don't even bother dude, hes just looking for something to complain about and he found this line which he can take out of context and twist into something that fits his agenda.","replies":[{"poster":"Riot MapleNectar","date":"2018-01-28T18:18:26.467+0000","up_votes":22,"down_votes":1,"body":"Generally agree, but I really want the boards to be a place where players can come and have deep discussion about gameplay (regardless of how they feel about it). Doing so requires us calling out those who want to reach for the lowest standard and resort to clickbait for upvote farming. If I stumbled into the gameplay section for the first time and saw half the types of posts that make it to the front page here, I'd probably be less inclined to actually want to participate in the community. We can be better than that","replies":[{"poster":"Beerstein","date":"2018-01-28T18:25:24.731+0000","up_votes":4,"down_votes":13,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=000d00000000,timestamp=2018-01-28T18:18:26.467+0000)\n>\n> Generally agree, but I really want the boards to be a place where players can come and have deep discussion about gameplay (regardless of how they feel about it). Doing so requires us calling out those who want to reach for the lowest standard and resort to clickbait for upvote farming. If I stumbled into the gameplay section for the first time and saw half the types of posts that make it to the front page here, I&#x27;d probably be less inclined to actually want to participate in the community. We can be better than that\n\nSo what you're saying is our opinions are invalid unless they align with your own? (Sorry couldn't find blank meme xD) Edit: I knew this would go over peoples heads, don't care, was worth.","replies":[{"poster":"Riot MapleNectar","date":"2018-01-28T18:56:47.729+0000","up_votes":6,"down_votes":1,"body":"If people didn't watch the interview they probably missed the message :P","replies":[{"poster":"LongHair Fox","date":"2018-01-28T22:38:36.680+0000","up_votes":1,"down_votes":0,"body":"So what you're saying is that we should ban people that didn't watch the interview?\n\n\n(Sorry that was forced)","replies":[]}]}]},{"poster":"P A C C S U","date":"2018-01-29T17:16:57.803+0000","up_votes":1,"down_votes":0,"body":"Solution: Only answer to posts with deep discussion and ignore the rage posts. Some people make rage posts because often in the most debated posts with reasonable discussions and point of views, don't get any form of answers from Riot. By participating more often on the posts with good behaviour and ignoring the upvote farming posts, Gameplay-cateogory might become a better place.","replies":[]},{"poster":"rtbf221651412","date":"2018-01-29T02:24:24.304+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=000d00000000,timestamp=2018-01-28T18:18:26.467+0000)\n>\n> Generally agree, but I really want the boards to be a place where players can come and have deep discussion about gameplay (regardless of how they feel about it). Doing so requires us calling out those who want to reach for the lowest standard and resort to clickbait for upvote farming. If I stumbled into the gameplay section for the first time and saw half the types of posts that make it to the front page here, I&#x27;d probably be less inclined to actually want to participate in the community. We can be better than that\n\nOwning the trolls is better than ignoring the trolls.\n\nSee what I did there?","replies":[]}]},{"poster":"Roaranor","date":"2018-01-29T00:55:24.397+0000","up_votes":1,"down_votes":0,"body":"Thing is, when they don't address these types of posts then the players take their their own misinterpretations as fact.","replies":[]}]},{"poster":"GrReaper96","date":"2018-01-28T18:12:28.110+0000","up_votes":15,"down_votes":0,"body":"http://i0.kym-cdn.com/photos/images/newsfeed/001/335/192/b62.jpg","replies":[{"poster":"Riot MapleNectar","date":"2018-01-28T18:15:46.364+0000","up_votes":8,"down_votes":1,"body":"This made me lol way harder than it should have. Perfect use of the meme :P","replies":[{"poster":"Absoluence","date":"2018-01-29T03:20:51.302+0000","up_votes":1,"down_votes":0,"body":"MMORPG please!","replies":[]}]}]},{"poster":"The Yetii Rider","date":"2018-01-28T21:54:58.778+0000","up_votes":1,"down_votes":0,"body":"Since you ARE here talking about Nunu, though, please give me some insight. As a Nunu player, I have **always** associated Nunu with being a tank. Even after he lost his on-hit damage and his base AD and AD per level were raised to compensate, which made Titanic Hydra a much better item on him, I still played Nunu as a tank. I only stopped playing Nunu as a tank when Strength of the Ages was removed and replaced with Courage of the Colossus, at which point I was stuck with Grasp of the Undying and started building a more offensive Nunu package. Thankfully, Bond of Stone was replaced with Stoneborn Pact and that solved that issue.\n\nIf Nunu, as a tank, is struggling, the answer should not be to give him more damage. Tanks do not need more damage, that's what the tank update was all about. So this change makes me think that Riot does not, in fact, perceive Nunu to be a warden at all. Why is Nunu being pushed in this juggernaut/fighter style direction?","replies":[{"poster":"DeathBurst","date":"2018-01-29T15:25:08.025+0000","up_votes":1,"down_votes":0,"body":"> Why is Nunu being pushed in this juggernaut/fighter style direction?\n\nI guess the answer is a sum of various factors.\n\n* **\"this juggernaut/fighter style direction\"**: It's not that much of a Fighter direction. More like a Support'ish direction, but while being an early game Jungler, not a laning Support. Think Ivern. (Not saying that's what Nunu IS, just saying that's how Riot perceive him.) Even before the recent patch, he had a big single target slow to impair the enemy ADC and a big AS buff for his own ADC.\n* **\"Why being pushed in this direction\"** (whatever it actually is):\n    * Because Nunu needed **some** attention, and this is original and an interesting experiment. Because at least Nunu will be played, and not forgotten in Limbo.\n    * Because Riot is trying to shake the meta and loosen the bonds between roles and positions. This new Nunu with an AP amp could serve as a Jungle Support with a Mage farming Bot and a Diver/Assassin playing Support for a kill lane, for instance.\n\nBut anyway, I agree that Riot probably does not perceive Nunu as a Warden.","replies":[]}]},{"poster":"Absoluence","date":"2018-01-29T03:18:07.416+0000","up_votes":1,"down_votes":0,"body":"OP just got busted!","replies":[]},{"poster":"nm1010","date":"2018-01-28T21:37:06.028+0000","up_votes":1,"down_votes":0,"body":"I listened to that interview on beyond the rift and I wasn't fully paying attention, but wasn't this almost exactly what was said? The playtesters talked about how Nunu was obviously insanely broken, but the live balance team was like \"well we will just put it out anyway\". I was pretty distracted while watching, but the point OP was making does sound very familiar. \n\nI went ahead and found the video. The quote from live balance team (according to the interview) \"We agree Nunu's numbers may be too high, but let's just ship it and see what happens\"\n\nhttps://www.twitch.tv/videos/222169348?t=09h42m48s\n\nSo not really balance for the sake of seeing play, but certainly balance decisions to stir things up lol.","replies":[]},{"poster":"Jmman","date":"2018-01-28T18:50:05.721+0000","up_votes":1,"down_votes":0,"body":"Funny thing is you have to start somewhere.  Buff too small and every yell what is this not going to help.  Buff to big and OMG OP!!!!\n\nBut I really like the fact that you did send something threw.  This mean it will give you a gauge on how to balance him.  Chances are you aren't going to hit the sweet spot first go around.  And I love the idea of adding more game play.  \n\nMy only wish is that you do more and quicker.  Sure I understand you have to play something out to see how they did.  Just a always coming up with 5 buff / nerfs / QoL changes per patch would go a long way to balancing and show your always balancing.  just an idea.\n\n{{sticker:slayer-pantheon-thumbs}} from me for actually doing things instead of talking about it.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2018-01-28T18:48:13.388+0000","up_votes":1,"down_votes":0,"body":"Another point versus your philosophy: Rioters don't have the time to fix mistakes. After these Nunu changes, is the Rioter responsible for them going to stick around and make sure that he is balanced in the long term? No, he's going to move on to the next project and Nunu is now in the hands of the patch to patch balance team who can only give him slaps on the wrist and tune down his numbers.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2018-01-28T18:39:59.709+0000","up_votes":1,"down_votes":0,"body":"Normally I would agree with you that things shouldn't be taken out of context, but I don't necessarily think that that's what's happening here. Yes, the post is low effort, but the gist of it rings true. You are ready to sacrifice immediate balance for the chance to offer interesting and compelling Gameplay and would rather 'balance' that Gameplay if necessary at a later time. You hope that will be a few days at most if something is extremely out of line, but hot-fixes aren't always viable and you run the risk of not being able to actually balance that new Gameplay with numbers, so sometimes you'll risk sacrificing balance for two weeks to eternity instead. That's the same risk you run with any change, though. We're just hoping you make less volatile changes. You received feedback that Nunu was too strong a week before the Patch hit, so why didn't you use the hot-fixed version of his Q damage from the get-go? The OP's opinion on the matter is that your philosophy is bad, but you're unconvinced. The biggest mistake here would then be that the OP didn't offer a discussion on why he thinks it is bad, instead of him slightly twisting your words around, if he even did that.","replies":[]},{"poster":"LOSINGISMYPRIDE","date":"2018-01-28T18:30:51.565+0000","up_votes":1,"down_votes":0,"body":"The problem is that nunu was good before because he could take objective easily . Now he get better jungle clear and even more steroid so its almost comparable to lulu and ardent censer but with even more steroid . I remember when i was pretty much mained sivir and you went buffing her lvl 1  Q with 30 damage and just 2 hours later riot say we did a buff way overboard and are srry while this passed the PBE . Galio was a monster and could one shot everyone with his Q . Ah also the time you buffed zed with the we know that zed doing pretty well in this season but here a buff because why not . \nAnyways youre in the right to choose how you want to balance your game but if its game breaking its kinda of your fault at this point .","replies":[]},{"poster":"Spideraxe","date":"2018-01-28T18:26:22.553+0000","up_votes":1,"down_votes":0,"body":"OT Hey Maple I was wondering if you could explain your role as a producer on the Live team, if DCap is lead designer and he oversees the design craft and gives feedback on balance changes","replies":[]}]},{"poster":"AFilthyCaitMain","date":"2018-01-28T06:47:26.563+0000","up_votes":28,"down_votes":4,"body":"no. this is not what was said. They said they would do it to make boring kits more fun instead of just balancing numbers.","replies":[]},{"poster":"ExHentai","date":"2018-01-28T06:02:37.780+0000","up_votes":36,"down_votes":14,"body":"They are also willing to sacrifice immediate balance so that horrifically overpowered champions can see even more play. {{champion:3}}","replies":[{"poster":"Iffy Jarl","date":"2018-01-28T10:04:05.496+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=ExHentai,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=0000,timestamp=2018-01-28T06:02:37.780+0000)\n>\n> They are also willing to sacrifice immediate balance so that horrifically overpowered champions can see even more play. {{champion:3}}\n\nTOTALLLY agree picked up galio after the rework fukn amazing and they actually BUFFED him last patch by adding scaling damage to his taunt you know you are doing something sketchy when u buff something and even the fans of that thing are like \"uhmm u sure about that?\"","replies":[{"poster":"Sahn Uzal","date":"2018-01-28T14:01:16.911+0000","up_votes":5,"down_votes":1,"body":"Because he had a 40% winrate when they buffed his taunt?\nI didn't like the Taunt buffs because I believe non damaging abilities are good design. (For example, have you ever seen a Warwick use his E for anything other than it's intended purpose? Or a Yasuo's windwall? Or a Darius' hook? )\nbut he definetly needed the help at that point.","replies":[{"poster":"Ralanr","date":"2018-01-28T18:34:53.005+0000","up_votes":1,"down_votes":1,"body":"I still hate that they pushed him from a tank to a bruiser. It feels like he needs too much AP to function.","replies":[{"poster":"M15T3RJ","date":"2018-01-28T20:24:56.637+0000","up_votes":1,"down_votes":0,"body":"Honestly, I've been playing a lot of Galio mid within the past month or two, and from my experience you really only need {{item:3001}} {{item:3151}} to function as a significant damage threat. E a target, passive auto, q, w, passive auto again, and your target's probably gonna be pretty chunked considering you have {{item:3151}} with it's passives and you're gonna be within {{item:3001}} range the entire time. After those items you can build full tank and still function really well as a tank and a damage threat.","replies":[]},{"poster":"Terozu","date":"2018-01-28T20:20:26.125+0000","up_votes":1,"down_votes":0,"body":"...Bruisers arent a character class in lol.  And in any other game a bruiser is defined as someone who heals themself while dpsing.  Like Darius or Warwick.\nWho fyi are both fighter, Darius subclassed juggernaut and Warwick a diver.\n\nBasically your comment makes no sense.  He's an anti mage magic damage tank.  Hence why he gets damage from MR.\nHe's most likely classified as a hybrid Tank subclass warden and Mage subclass battle mage.\nDue to being tanky and having aoe abilities withh cc.  Like Anivia mixed with Leona.","replies":[]}]}]},{"poster":"XeroKimo","date":"2018-01-28T14:00:21.567+0000","up_votes":2,"down_votes":0,"body":"I'm pretty sure it was a re-shift of power, and not a buff\n\nThey took some power off his Q and passive and added damage to W","replies":[{"poster":"Iffy Jarl","date":"2018-01-28T20:08:26.864+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XeroKimo,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=000000010000,timestamp=2018-01-28T14:00:21.567+0000)\n>\n> I&#x27;m pretty sure it was a re-shift of power, and not a buff\n> \n> They took some power off his Q and passive and added damage to W\n\npretty sure they didn't even touch his q also what is with this new reply system is anyone seeing this or is it just me?","replies":[]}]}]},{"poster":"SangreDeNoche","date":"2018-01-28T06:13:59.005+0000","up_votes":4,"down_votes":11,"body":"> [{quoted}](name=ExHentai,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=0000,timestamp=2018-01-28T06:02:37.780+0000)\n>\n> They are also willing to sacrifice immediate balance so that horrifically overpowered champions can see even more play. {{champion:3}}\n\n-86% Win rate\n\nRiot: WORKING AS INTENDED GUYS, HE'S SUPPOSED TO 1 SHOT WITH HIS AOE TORNADO THAT COMES IN FROM 2 SIDES","replies":[{"poster":"Sqkerg","date":"2018-01-28T17:49:49.449+0000","up_votes":3,"down_votes":0,"body":"Okay, I get you don’t like him, but don’t just straight up lie. He never had an 86% winrate","replies":[{"poster":"SangreDeNoche","date":"2018-01-29T02:21:40.389+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Sqkerg,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=000000000000,timestamp=2018-01-28T17:49:49.449+0000)\n>\n> Okay, I get you don’t like him, but don’t just straight up lie. He never had an 86% winrate\n\nlol you weren't paying attention then. Look up one of the many galio one-shot montages.","replies":[{"poster":"Sqkerg","date":"2018-01-29T04:38:17.927+0000","up_votes":2,"down_votes":0,"body":"I don't care if he could oneshot people, that doesn't mean he had an 86% winrate.","replies":[]}]}]}]}]},{"poster":"PePsiLemoNN","date":"2018-01-28T16:04:03.230+0000","up_votes":10,"down_votes":0,"body":"- Rioter posts a long-ass comment about how they make changes.\n- Random upvote farmer takes ONE line of what the rioter said completely out of context.","replies":[]},{"poster":"Wulf Helhammer","date":"2018-01-28T06:15:20.142+0000","up_votes":4,"down_votes":1,"body":"Could I get a link to where that was said?","replies":[{"poster":"Marshbouy","date":"2018-01-28T14:02:51.238+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=BobaFlautist,realm=NA,application-id=3ErqAdtq,discussion-id=qgPXfKtQ,comment-id=0003,timestamp=2018-01-25T23:28:00.560+0000)\n>\n> Well it seems like they&#x27;ve been more willing to sacrifice immediate balance for interesting gameplay - someone like Nunu, or Swain, or Galio, they&#x27;d rather give them something ridiculous to make them interesting and then tune the rest of the kit around it instead of leaving a kit boring and tweaking numbers until it&#x27;s 50% winrate.\n> \n> And if the change causes problems, they totally are willing to revert after fiddling with the details a bit to try to get it right - Vayne Q critting, for example.\n> \n> It makes the game balance more volatile, for sure, but I prefer this to &quot;Don&#x27;t touch the kit, you might break it! Just add or subtract 5 to/from some number, check the winrate, and repeat.&quot;\n\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qgPXfKtQ,comment-id=00030002,timestamp=2018-01-26T04:32:36.379+0000)\n>\n> You summed it up pretty well, but I&#x27;ll throw in my two cents from the perspective as one of the team leads. \n> \n> From a process perspective:\n> \n> When we&#x27;re working on a patch, we have about two work weeks to choose our targets, dig into a shit ton of data, come up with a few paperkits, implement said paperkits, test them, get feedback, iterate, test again, finalize iterations, and get in for actual bug testing and localization lock (for things that are changing tooltips and need to be translated). What this usually amounts to is that we have from ~Wednesday afternoon to the following Friday to get our changes through the various development stages and into the next patch. After we lock on the Friday, we have the following Monday/Tuesday for any final power tuning and bug fixing before the entire patch gets &quot;locked&quot; and no more changes can be submitted. From there it goes into extensive bug testing internally, at vendors, and in partner regions to ensure all big bugs have been caught and fixed before we go Live the following Tuesday-Wednesday. This means that from the time we start working on a task, it takes 3 weeks before that change will actually get shipped live (which is one of the factors in it feeling like it takes a long time for things to get changed).\n> \n> Now, not all of our work is targeted on a 2 week cadence, there are times where we have some larger work on our plates for a few sprints/months before it ships, but the bulk of our work gets run through the rapid two week cadence. When we&#x27;re already working on a fast schedule, one of the things that can drag down any team in any organisation is having too much work in progress. It&#x27;s something you need to be hyper aware of, as having too many things on the go at once is likely to lead to a lot of stuff falling through the cracks, or burnout because of people trying to deal with the overhead of each individual piece of work they have on their plate. What this means at Riot is that the specific designer may have 4-5 tasks of varying sizes on their plates for a given patch, and each of those tasks requires investigation, ideation, implementation, playtesting and gathering feedback, iterating based on said feedback, fixing bugs, writing patch notes etc. Anything that bleeds over to the next sprint adds to the overhead they need to manage the following sprint (including adding another testpoint to playtests that are already crowded with changes from all the teams in core gameplay). While breaking things up as you suggest would lead to smoother releases, it also just doesn&#x27;t scale well in a real world development scenario (that&#x27;s not intended to sound condescending). \n> \n> What this means from a product perspective:\n> \n> One of the things that we try to aim for with our larger changes is offering interesting and compelling gameplay that alters the way players may think about when to pick a specific champion, how to build them, or where they could play them. Things like; what if you could take Nunu bot lane with an Azir or Kayle instead of just in the jungle when you have a hyper scaling adc? Or what if you could take Morgana or Zyra in the jungle if you got autofilled jungle as a support main but your team was entirely physical damage? These types of changes tend to err on the riskier side of the equation because we&#x27;re trying to balance for a lot of factors. Things like what will this look like in pro play? What about Diamond? Will this be pubstompy in Bronze? Would this be something players find exciting or interesting? The list goes on and on, but at the end of the day, sometimes we have to take our best guess which is informed by the few playtests we get, trust our gut, and go with it. Can this result in us having some releases where we sit back, see the results of a change and think &quot;damnit we did it again&quot;. Yep. But does that make me question whether we should have held onto a change for an additional 2 sprints to try and eke out even a tiny bit more value from playtests to give us the confidence in a direction or present tuning? Very very rarely. When all is said and done, the data that we get from our changes being out in the wild for even an hour gives us far more information than we can get from our playtests. This means that we can adjust a champion to be right around where we&#x27;re happy with a day or two after release as opposed to holding onto them and carrying the overhead cost of managing the task through the various dev stages for another month to get us to the same result (maybe). While people tend to look at them as massive misses on our part (which they are), I&#x27;m fine accepting that cost as long as we&#x27;re willing to own up to it when we do and hotfix them when necessary. At the end of the day as a lead I&#x27;m accountable for the results of my team, and if needing to do hotfixes was causing players to churn from the game or completely lose all faith in Riot then I&#x27;d definitely revisit this as a philosophy, but  as that hasn&#x27;t materialised so far my tendency is to lean towards iterating quickly as opposed to drawing changes out over a long period of time. \n> \n> @OP:\n> To be entirely clear, your thoughts aren&#x27;t wrong. If we wanted to go for the smoothest releases possible, we could easily adjust to releasing changes the way you suggest (1/4 or 1/2 at a time). The primary benefit there would be we&#x27;d have less egregious cases like Nunu crop up, and the primary cost would be that we&#x27;d be able to do net fewer changes as we adjust our workload to account for carry over tasks. It could be that the trade-off is worth it,  though for now I&#x27;m not convinced. In my mind the worst case right now is that we end up having champs like Nunu be strong for a day or two, people get to see them pop off with some fun synergies, and then we get him to a spot we&#x27;re roughly happy with - which is ideally far better than he was before.\n> \n> That being said...\n> \n> One of our hopes with changing our patching cadence to be a large patch followed by a small patch is that we get additional breathing room to work on larger projects rather than trying to bundle everything into a standard patch. By changing our small patches to have significantly fewer changes than what players are currently used to, it grants us significantly more bandwidth to work on the larger term stuff that hopefully has a larger impact on the overall state of League. \n> \n> Hopefully the above reasoning makes some amount of sense. I have this awful tendency of writing fucking bibles on the boards :P. Let me know if anything needs additional clarity.\n\nsource https://boards.na.leagueoflegends.com/en/c/gameplay-balance/qgPXfKtQ-nunu-is-a-perfect-example-of-why-people-bitch-about-the-balance-team","replies":[]},{"poster":"EssenceOfPoo","date":"2018-01-28T14:58:32.650+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=The Wolf King,realm=NA,application-id=3ErqAdtq,discussion-id=VAjXce86,comment-id=0001,timestamp=2018-01-28T06:15:20.142+0000)\n>\n> Could I get a link to where that was said?\n\nit's called OP's ass. Look it UP...or maybe not, it's probably full of s**t\n\n{{sticker:sg-miss-fortune}} ","replies":[]},{"poster":"Lùmen","date":"2018-01-28T12:33:20.159+0000","up_votes":6,"down_votes":1,"body":"FYI, he took what the Rioter said out of context. I couldn't find the source, but I know for a fact that he or she had a better justification for this philosophy.","replies":[]}]},{"poster":"SEKAI","date":"2018-01-28T10:14:57.537+0000","up_votes":3,"down_votes":10,"body":"They are also willing to sacrifice immediate balance, so that already nerfed into the ground champs will see even less play.{{champion:11}}","replies":[{"poster":"Ariel the Cruel","date":"2018-01-28T12:29:55.473+0000","up_votes":10,"down_votes":1,"body":"To be fair, Yi has a bit of a polarization problem.\nWhen anything more than weak in high elo play, he wrecks low elo play.","replies":[]}]}]}