{"poster":"PromoHengst","date":"2015-08-31T14:12:39.034+0000","title":"Ritos Bestrafungssystem","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Guten Tag, Habe vor 5 Monaten einen langen Chat Restrict bekommen, weil ich geflamt habe. Nach dem Restrict hab ich vielleicht mal alle 20 Games sowas wie noob oder idiot geschrieben, weil es dann mal wieder soweit war und ich mal wieder so einen &quot;netten&quot; Mitspieler hatte. Seit dem schreibe ich gar nichts mehr und wenn nur ss, drake timer... . Oder ich Spamme GJs oder chill chill chill, wenn gerade die Moral des Teams in Keller geht. So, jetzt hatte ich die Tage ein echt mieses Spiel, wo ich selbst mit Xin sehr hart gefailt habe. Daf&uuml;r habe ich mich auch dann entschuldigt. Allerdings meinte mein komplettes Team es w&auml;re besser mich zu flamen und das 24/7 und ab dann war Schluss bei mir und ich habe mehr geflamt als noch gespielt. So jetzt hab ich wieder so&acute;n Restrict am Hals, wobei mir das am Allerwertesten vorbei geht, dann schreib ich halt nicht, dann lasst die anderen rumflamen bis der Arzt kommt, ich antworte nicht drauf. Jetzt macht Rito aber noch Einen drauf und gibt mir einen Ranked Bann, denk ich mir Okay, dann ist das halt so. \r\nJetzt kommt aber das Ding, auf mehrere Anfragen an den Support (vor 5 Monaten und jetzt), ob ich mal die F&auml;lle sehen kann, warum ich einen Bann bekommen habe(Die kriegt man ja, wenn man vom Tribunal bestraft wird). JEDES Mal kriege ich die gleiche d&auml;mliche Antwort &quot;Du solltest in Zukunft erstmal gar nichts mehr schreiben&quot;. Wie kann dieses Antwort mir mit meinem Problem weiterhelfen?! Wenn ich mich bessern soll, dann sollte man mir mithilfe der F&auml;lle GENAU zeigen was ich falsch gemacht habe. Wo die Grenzen sind ? Wenn ich nicht kommuniziere, weil Rito mir r&auml;t gar nichts zuschreiben, werde ich f&uuml;r &quot;Verweigert Kommunikation mit Team&quot; Reportet. Also entweder bin ich an einen Support Mitarbeiter gelandet, der mein Problem nicht versteht, oder Ritos System weist L&uuml;cken auf. Ich habe sowieso das Gef&uuml;hl, das Rito nach den Anzahl der Reports handelt, anstatt von Fall zu Fall. \r\n&Uuml;ber eure Meinung w&uuml;rde ich mich freuen.\r\n\r\nMfg \r\n\r\nP.S. Hier geht es nicht drum, ob ich den Bann verdient habe oder nicht. Der Obere Teil dient nur zu Beschreibungs des Falls. Hier geht es um Ritos System Toxische Mitspieler zu bestraften.","replies":[{"poster":"Der Großmugister","date":"2015-08-31T14:17:17.078+0000","up_votes":3,"down_votes":0,"body":"Dass keine Chatlogs bei Restrictions mit geliefert werden ist Mist, das hat Riot schon erkannt und ändert es! Dass es nicht schon gemacht wird, ist aber durchaus ein berechtigter Grund zur Beschwerde, hier bin ich voll auf deiner Seite.\n\nKommunikationsverweigerung ist ein \"toter\" Report, wie schlechter Spieler, der bewirkt rein gar nichts. Den gibt es nur als Placebo oder evtl. für Riot-interne Statistiken.\n\nWenn du doch weißt, dass du dich daneben benommen hast, was willst du dann noch vom Support wissen?!\nDie einzige Lösung ist, dass du dich zusammenreißt und NIE WIEDER ausfallend wirst, da darf es auch keine \"ausrutscher\" geben, Ende!","replies":[{"poster":"Shiggyvara","date":"2015-08-31T15:39:33.558+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=KJ1eKkEL,comment-id=0000,timestamp=2015-08-31T14:17:17.078+0000)\n>\n> Dass keine Chatlogs bei Restrictions mit geliefert werden ist Mist, das hat Riot schon erkannt und ändert es! \n\nMit der Eröffnung des BER ist dann auch mit Reformkarten für RR und CR zu rechnen :)","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-08-31T15:11:08.869+0000","up_votes":1,"down_votes":0,"body":"wieso schreibst du den Support an, wenn du in deinem Text doch zugibst, dass du bereits weißt, was du falsch gemacht hast. Ich zitiere: \"ich habe mehr geflamt als noch gespielt.\" Wer so ein Verhalten an den Tag legt, muss doch irgendwie damit rechnen, dass er bestraft wird... Auch wenn es nur in einem Spiel vorkommt. Vor allem, wenn er schon vorbestraft ist, also am eigenem Leib erfahren hat, dass das System funktioniert.\n\nDie eigentlich vernünftige Reaktion wäre gewesen: Das Spiel ist eh verloren, aber ich weiß ja, dass die Spieler, die mich jetzt flamen wahrscheinlich ihre gerechte Strafe bekommen, wenn ich sie am Ende reporte. Also stehe ich über ihren Beleidigungen, mute sie und schreibe ihnen nichts zurück, dann passiert mir auch nichts.","replies":[{"poster":"PromoHengst","date":"2015-08-31T15:21:47.163+0000","up_votes":1,"down_votes":1,"body":"Ich habe den Support angeschrieben wegen der chatlogs. Mal davon abgesehen, dass das eine falsche Reaktion war, habe ich das Gefühl, dass Reporten nicht viel bringt außer das ich nicht mehr mit diesen Spielern gemachted werde. Dafür kommen andere Spieler ins Game um die ich lieber einen Bogen machen würde.","replies":[{"poster":"Der Großmugister","date":"2015-08-31T15:44:25.205+0000","up_votes":2,"down_votes":0,"body":"Du wurdest bestraft und denkst dennoch dass Reports keine Auswirkungen haben?!\nTut mir Leid aber das ist einfach sinnlos :D","replies":[]},{"poster":"Humpelstilzche","date":"2015-08-31T16:01:25.491+0000","up_votes":2,"down_votes":1,"body":">  habe ich das Gefühl, dass Reporten nicht viel bringt\n\nBist du selbst nicht der lebende Gegenbeweis? \nDu flamest immer wieder ---> Du wurdest reported --> Du wurdest bestraft.\nHaargenauso und nicht anders soll das funktionieren. \n\n> dass Reporten nicht viel bringt außer das ich nicht mehr mit diesen Spielern gemachted werde\n\nEine solche Funktion haben Reports nicht. Reports haben keinerlei Einfluss auf das Matchmaking.","replies":[{"poster":"PromoHengst","date":"2015-08-31T16:10:56.764+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=KJ1eKkEL,comment-id=000500000002,timestamp=2015-08-31T16:01:25.491+0000)\n>\n> Bist du selbst nicht der lebende Gegenbeweis? \n> Du flamest immer wieder ---> Du wurdest reported --> Du wurdest bestraft.\n> Haargenauso und nicht anders soll das funktionieren. \n> \n> Eine solche Funktion haben Reports nicht. Reports haben keinerlei Einfluss auf das Matchmaking.\nIch meine damit, dass man immer solche Leute hat!!!\n\nIch habe mal gelesen, dass wenn man einen reported, die Chance groß ist nicht noch einmal mit solchen Leuten gemachtched wird.","replies":[{"poster":"Humpelstilzche","date":"2015-08-31T16:16:20.141+0000","up_votes":3,"down_votes":1,"body":"Da hat dir jemand Käse erzählt, das ist nicht korrekt.","replies":[]}]}]},{"poster":"hshtagniemehrcdu","date":"2015-08-31T15:48:19.128+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=PromoHengst,realm=EUW,application-id=KYnfKGf0,discussion-id=KJ1eKkEL,comment-id=00050000,timestamp=2015-08-31T15:21:47.163+0000)\n>\n> Ich habe den Support angeschrieben wegen der chatlogs. Mal davon abgesehen, dass das eine falsche Reaktion war, habe ich das Gefühl, dass Reporten nicht viel bringt außer das ich nicht mehr mit diesen Spielern gemachted werde. Dafür kommen andere Spieler ins Game um die ich lieber einen Bogen machen würde.\n\nReports haben keinen Einfluss auf das Matchmaking.\nEbensowenig wie Mute/Block List, oder das hinzufügen zur Freundesliste.","replies":[]}]}]},{"poster":"HyperionCH","date":"2015-08-31T14:29:00.452+0000","up_votes":1,"down_votes":0,"body":"Ja, die Schwäche ist derzeit, dass Spieler mit einer CR/RR keinen chatlog kriegen (erst ab 2-Wochen-ban).\n\nDas Problem ist:\nDie Chatanalyse läuft während deiner CR weiterhin und beobachtet alles. Hast du dich nicht benommen, spricht es erneut eine CR (bzw. auch eine RR) aus.\nRiot müsste also einige Dutzend chatlogs zustellen, da diese chatlogs alle zur erneuten CR (+RR) führten. Aber keine würde so viele chatlogs durchlesen.\nAlternativ könnte Riot Stichproben liefern, damit die Menge annehmbar ist. Aber was passiert, wenn z.B. die Stichproben nur chatlogs beinhaltet, die völlig in Ordnung sind (weil man nicht immer flamet)? Klingt also auch nicht nach einer guten Lösung.\n\nAber Riot arbeitet daran, dass es irgendwie doch noch chatlogs gibt.\n\nOb chatlogs etwas bringen für den Spieler, ist eine andere Frage. Man sieht es ja bereits bei den 2-Wochen-bans. Da zeigen die chatlogs wirklich viel Toxiness, aber jener Spieler findet dies trotzdem als \"normal\" und sieht sich unschuldig bestraft.\n\nNatürlich gibt es viele Spieler, die wirklich die chatlogs durchlesen würden und auch ihr Fehlverhalten erkennen.\nJenen Spielern spreche ich aber auch einen gesunden Menschenverstand zu. Sie könnten sicherlich auch ohne chatlogs herausfinden, welches Spielverhalten sie zukünftig nicht mehr aufzeigen sollten.","replies":[{"poster":"Der Großmugister","date":"2015-08-31T14:35:46.999+0000","up_votes":1,"down_votes":0,"body":"Also ich würde mich schon als Fan von Riot beschreiben. Aber was die Chatlogs angeht, hab ich da deutlich weniger Verständnis für als Du.\nDas System erkennt die toxischen Stellen ja bereits, ansonsten würde es ja nicht arbeiten können.\nDaher sollte es doch (nach meiner Laienmeinung) kein Problem sein, dem System zu sagen, es soll sich, wenn es etwas negativ bewertet, auch merken, im Chat welches Spieles es das getan hat.\nDann könnte man dem Betroffenen einfach die Chatlogs aller Spiele liefern, in denen das System was gefunden hat.","replies":[{"poster":"HyperionCH","date":"2015-08-31T14:51:53.529+0000","up_votes":2,"down_votes":0,"body":"Das Problem ist hier sicherlich, dass es unterschiedliche toxische Spieler gibt.\n\nEinige sind nur in wenigen Games toxisch, aber dann jedoch sehr.\nAndere sind immer wieder toxisch (jedes 2. Game -> wenn man am verlieren ist), jedoch jeweils \"nur\" wenig Toxiness (im Vergleich zum ersten Beispiel).\n\nJener vom ersten Beispiel (flamet seltener, jedoch dafür sehr toxisch) kann man sicherlich ein recht guter chatlog erstellen, der die Toxiness aufzeigt. Von den z.B. 60 chatlogs (Games) braucht man vielleicht 3-5 chatlogs, die das Sytem als toxisch ansieht. Die stellt man dann zu.\n\nBeim zweiten Fall wird es heikler. Von den z.B. 60 kontrollierten Games/chatlogs sind wohl so 30 toxisch, jedoch nur \"geringfügig\" toxisch. Von diesen 30 chatlogs einfach 3-5 chatlogs dem Spieler zuzustellen, ist möglicherweise nicht hilfreich.\nDenn sie zeigen nicht, dass man dies ständig macht und welche Aussagen man wirklich unterlassen sollte. Auch wenn der Spieler dann hier im Forum diese chatlogs postet, würden einige sagen: \"Im Vergleich zu anderen Fällen (\"Beispiel 1\") finde ich dies harmlos.\"\nDass die Strafe gleich hoch ist, obwohl die Toxiness unterschiedlich ist, wird dann nicht verstanden (Grund: die Häufigkeit der Toxiness ist - umgekehrt - auch unterschiedlich)\n\nWie gesagt:\nIch finde es auch als Schwäche, dass es keine chatlogs für Spieler mit CR/RR gibt.\nAber die chatlogs brauchen eine gute Qualität (bezüglich dass sie dem Spieler aufzeigen, dass sie ihr Spielverhalten nicht korrekt ist). So lange dies nicht gewährleistet wird, ist es deshalb leider besser, keine chatlogs zu senden.","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2015-08-31T14:51:26.389+0000","up_votes":2,"down_votes":0,"body":"> dann war Schluss bei mir und ich habe mehr geflamt als noch gespielt\n\nDann sollte die Strafe ja nicht unerwartet kommen. Du wurdest mehrfach für dein Geflame bestraft und trotzdem lernst du nicht dazu flamest schon wieder. Selbstverständlich wirst du dafür bestraft. \n\n> JEDES Mal kriege ich die gleiche dämliche Antwort \"Du solltest in Zukunft erstmal gar nichts mehr schreiben\"\n\nIch bin mir sehr sicher, dass der Support das nicht geschrieben hat. Sicherlich ist nicht zu chatten EINE Option, aber keinesfalls die einzige. \n\n> Wenn ich nicht kommuniziere, weil Rito mir rät gar nichts zuschreiben, werde ich für \"Verweigert Kommunikation mit Team\" Reportet\n\nDas ist ein Placebo-Report. Es wurde noch nie(!) ein Spieler für \"no communication\" bestraft. Es steht dir frei nicht zu kommunzieren. \n\n> Also entweder bin ich an einen Support Mitarbeiter gelandet, der mein Problem nicht versteht, oder Ritos System weist Lücken auf\n\nFrag im selben Ticket (nicht ständig neue Tickets spammen!) nach, warum genau du bestraft wurdest. Irgendwann wirst du dann an einen Player Behavior Expert/Specialist weitergeleitet, der dir genauere Einsichten geben kann. Aber da du ja bereits erwähnt hast dass du geflamed hast, kannst du dir die Mühe sparen: Du wurdest für Flaming bestraft, da besteht kein Zweifel. \n\n>  Ich habe sowieso das Gefühl, das Rito nach den Anzahl der Reports handelt, anstatt von Fall zu Fall\n\nDies ist nicht der Fall. Basis für die Strafe ist IMMER die Analyse des Chats. Kein Flame ---> Keine Strafe, auch wenn du eine Millionen Reports bekommen hast. Reports lösen lediglich die Analyse deines Chats aus, nichts weiter.","replies":[]},{"poster":"Kaitri","date":"2015-08-31T17:23:52.697+0000","up_votes":1,"down_votes":0,"body":"also wenn du logs willst, dann mach genau so weiter wie bis jetzt!\ndann kriegst du bald n 14 tage bann und DANN kriegst du chatlogs! bist aufn guten weg zu deinen chatlogs. dir gehts eh am arsch vorbei wenn dein chat gesperrt ist und ranked auch, die 14 tage sollten dir dann genauso egal sein.","replies":[]},{"poster":"Sumday","date":"2015-08-31T14:54:11.474+0000","up_votes":1,"down_votes":5,"body":"Wer mit Xin failed gehört gebannt","replies":[]}]}