{"poster":"fIsTtLsTiCkS","date":"2016-02-09T07:29:24.516+0000","title":"RIOT! EUER ERNST?! GIBT MIR MEINEN ACCOUNT ZURÜCK!","subforum":"Hilfe & Support","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/a0w095","image":"http://i.imgur.com/o8wYe51.png"},"up_votes":1,"down_votes":0,"body":"&gt; Hallo Riot! Mein Account wurde vor 2-3 Tagen von franz&ouml;sischer Seite aus gehackt (http://prntscr.com/a0w0r9)! Ich habe eine E-Mail an euch gesendet mit GOTT VERDAMMTEN BANK DATEN MEINES ACCOUNTES! MIT ZUR&Uuml;CKGEGEBENEN CHAMPS UND VERSCHICKTEN GESCHENKEN UND DAS IST DIE ANTWORT?! \r\nIch habe euch die E-Mail der Erstellung gegeben und alles was ihr wolltet und jetzt wimmelt ihr mich ab?! Ich will meinen Account wieder!\r\nAnsonsten werde ich einen Anwalt aufsuchen der das kl&auml;rt, ich habe nicht verbrochen und mein Account wurde DEFINITIV GEHACKT!","replies":[{"poster":"WASDowningpower","date":"2016-02-09T09:57:03.148+0000","up_votes":1,"down_votes":0,"body":"Alleine schon für den Betreff hier im Forum sollte Riot sich das nochmal überlegen... Desweiteren wie bereits von anderen gesagt hilft hier oftmals richtiges Lesen!","replies":[]},{"poster":"fIsTtLsTiCkS","date":"2016-02-09T08:52:20.169+0000","up_votes":1,"down_votes":0,"body":"Ich weis nun welche E-Mail gemeint ist, Riot ist ein Fehler unterlaufen, anstatt \"net\" war es \"de\" also nicht direkt meine Schuld :). Ich denke das ist nun geklärt da ich genau weiß welche E-Mail Adresse es ist und ich habe auch noch Zugang zu dieser. Vielen Dank für eure Hilfe!","replies":[]},{"poster":"fIsTtLsTiCkS","date":"2016-02-09T07:51:25.467+0000","up_votes":1,"down_votes":0,"body":"Ich habe Riot jetzt geantwortet. Mal schauen was passiert.. ich dreh durch wenn ich den Account nicht wieder bekomme.","replies":[]},{"poster":"pn Garamoth","date":"2016-02-09T08:04:34.782+0000","up_votes":1,"down_votes":0,"body":"Du hattest geschrieben das in dem Account viel Geld steckt. Auf welche arten hattest du denn Riot Points aufgeladen? Falls du keinen Zugriff mehr auf die Ursprüngliche E-mail Adresse hast helfen manchmal auch Transaktionsnummern von Paypal Zahlungen oder die Codes der benutzten Paysafe Karten um dich als rechtmäßiger Eigentümer des Accounts zu verifizieren.","replies":[]},{"poster":"Sihari","date":"2016-02-09T07:40:35.822+0000","up_votes":1,"down_votes":0,"body":"So wie es für mich aussieht, wollen sie, dass du dein Passwort mit eben jener E-Mail Adresse anforderst, die dort gemeint ist. Sie geben dir sogar einen Tipp, welche es ist! \nDein nächster schritt sollte nun eine Antwort auf diese Mail sein, in der du die Adrresse ausschreibst. Wenn du darauf keinen Zugriff mehr hast, dann musst du das sagen und sie werden dir bestimmt dein Passwort auch anders zusenden können.\nLies also bitte erstmal richtig, hab etwas Geduld und dann wird alles gut c;","replies":[]},{"poster":"Humpelstilzche","date":"2016-02-09T07:38:24.137+0000","up_votes":1,"down_votes":0,"body":"Der Riotmitarbeiter tut in diesem Ticket lediglich seinen Job. Riot muss sichergehen dass nur der orginale Ersteller des Accounts Zugriff auf diesen hat. Und das läuft nunmal über die entsprechende Email. \nStell dir vor jemand klaut deinen Account und verwendet ihn für ein Jahr. In dieser Zeit kauft er RP, gibt Champs zurück und verschickt Geschenke. Dieser Typ kann also die selben Daten angeben wie du, obwohl er den Account geklaut hat. Was er aber nicht kann (denn das kann nur der orginale Ersteller) ist auf die ursprüngliche Email-Adresse zugreifen. Und genau deshalb fragt Riot dannach, denn ansonsten kann wirklich jeder daher kommen und sagen \"Das ist jetzt mein Account\".\n\nWenn du keinen Zugriff mehr auf deinen Mail Account hast ist das sehr ärgerlich, aber auch nicht Riots Schuld.","replies":[]}]}