{"poster":"Evil Within Act","date":"2015-12-02T13:27:44.759+0000","title":"LA GIUSTIZIA DELLE RANKED","subforum":"Discussioni generali","up_votes":0,"down_votes":18,"body":"IO MI CHIAMO SU LOL EVIL WITHIN ACT, SONO ARGENTO 4 E GIOCO TANTO PER MIGLIORARE IL MIO STILE DI GIOCO E SALIRE DI ELO. SONO UN RAGAZZO AMBIZIOSO. IL PROBLEMA CHE VI PONGO &Eacute; IL SEGUENTE: IO FACCIO UNA RANKED, MI FEEDO MID ARRIVANDO AD UNO SCORE PARI A 8-0 MA IN SQUADRA HO DUE TROLLER CHE ALLA FINE DELLA PARTITA AVRANNO 2 SCORE RISPETTIVAMENTE 3-11 E  3-15 E QUINDI QUANDO ARRIVO IN LATE MI (SCUSATE IL TERMINE) SFONDANO IL CULO. FINISCE LA PARTITA, LOL MI DA COME VOTO A+ MA MI TOGLIE 26 LP E ORA RISCHIO DI SCENDERE IN ARGENTO 5. IO HO REPORTATO QUESTI DUE TROLLER MA SINCERAMENTE A ME NON IMPORTA TANTO SE AVRANNO DRAFT DA FARE O CHAT LIMITATA; A ME INTERESSA SOLTANTO IL MIO RANK. QUINDI VI CHIEDO PERCH&Eacute; DEVO ESSERE GIUDICATO A+ PER AVER GIOCATO BENE  MA POI MI SCALANO GLI LP PER AVER PERSO LA PARTITA A CAUSA DI 2 TROLLER? SE NECESSARIO POSSO MOSTRARVI ANCHE LA FOTO CHE HO FATTO AL TERMINE DELLA PARTITA PERCH&Eacute; MI SONO STANCATO DI ESSERE GIUDICATO IN QUESTO MODO ASSURDO.","replies":[{"poster":"Dantazzo","date":"2015-12-02T14:11:46.774+0000","up_votes":6,"down_votes":0,"body":"Fammi indovinare, tu vai 8/0 perchè sei pro e batti un avversario fortissimo, i tuoi compagni vanno 0/8 perchè sono troll e feeddano gli scarsi.","replies":[]},{"poster":"Demi97","date":"2015-12-02T13:39:53.637+0000","up_votes":3,"down_votes":1,"body":"Innanzitutto leva il caps e comunque ti è capitato questo su una partita, ma nelle altre? Non che i tuoi scoore siano dei migliori eh.. vedo una partita con karma 2/10, stavi trollando anche te? Se scendi significa che ti meriti di scendere, se sali ti meriti di salire, se resti in stallo hai raggiunto il tuo elo massimo e devi migliorare.","replies":[{"poster":"Andreiv14","date":"2015-12-02T15:12:42.534+0000","up_votes":1,"down_votes":0,"body":"Sulla prima parte sono d'accordo con te, ma non puoi dire niente sui suoi score. Inanzi tutto hai preso una partita di quasi un mese fa, dopo altre 20 partite giocate. Ci sta che uno giochi male una volta su 20. Capita anche ai pro una brutta partita (tra l'altro era supp quindi è normale avere un brutto rapporto kill/death perché sono gli assist che contano) e mi sembra eccessivo accusarlo di troll. Magari deve imparare ad aiutare la squadra perché da solo non si può vincere. Se lui è forte dovrebbe aiutare la sua squadra a vincere e lamentarsi di meno.\n{{champion:7}} \"Trust me!\"","replies":[{"poster":"Demi97","date":"2015-12-02T15:16:14.464+0000","up_votes":4,"down_votes":0,"body":"Ciò che intendevo dire è che lui ha dato dei troll a due suoi compagni di team che magari hanno avuto una brutta partita dopo 20 di buone, stesso che può succedere a lui, come può succedere a chiunque","replies":[{"poster":"Andreiv14","date":"2015-12-02T15:19:19.367+0000","up_votes":4,"down_votes":0,"body":"I agree, infatti la gente dovrebbe lamentarsi di meno e divertirsi di più. ;)","replies":[]}]}]}]},{"poster":"Sìrjohn","date":"2015-12-02T13:40:03.508+0000","up_votes":3,"down_votes":0,"body":"Mi sai che ti sei dimenticato il caps attivo.\n\nIl voto a fine partita non conta niente, conta solo se vinci o perdi. \n\nSe sei così fiddato in early game e in late perdi, significa che il tuo feed non è stato sfruttato al meglio.\n\nCi sono partite (poche) dove anche se dai il massimo e fai zero errori comunque non riuscirai a trascinare gli altri cani morti, ma ribadisco sono davvero poche poche.\n\nSe vuoi dei riconoscimenti per la tua prestazione singola questo gioco non fa per te.","replies":[]},{"poster":"Frattaglia","date":"2015-12-02T15:47:56.311+0000","up_votes":2,"down_votes":0,"body":"Fai questo score in tutte le partite e vedi che ne vincerai molte di più.\nChe poi il KDA conta relativamente, dato che il gioco si basa sugli obiettivi.","replies":[]},{"poster":"LKV2","date":"2015-12-02T14:43:17.836+0000","up_votes":2,"down_votes":0,"body":"Guarda non vado nemmeno a vedere il profilo o partite/ caxxate varie.\nil concetto é semplice: se stompi SEMPRE la mid e vai SEMPRE 3/0/0 oppure 4/1/0 (o cose simili) allora il 60% delle partite le vinci per forza e quindi sali (Win>Lose).\nPiangere perché UNA VOLTA hai stompato la lane e hai perso ci sta, come ci sta di feedare come cani la tua lane e poi vincere perché gli avversari dormono.\n#BASTAPIANGERE\nonly trolls in my team\nopponents are all \"ciallengiour\"\njungler no gank.","replies":[]},{"poster":"Lee Pugno Divino","date":"2015-12-02T14:18:24.242+0000","up_votes":2,"down_votes":0,"body":"Non lo so.. hai mai pensato di roamare??","replies":[]},{"poster":"Chroniicles","date":"2015-12-02T15:51:48.689+0000","up_votes":1,"down_votes":0,"body":"Se sei forte sali!!","replies":[{"poster":"Evil Within Act","date":"2015-12-04T23:08:42.200+0000","up_votes":1,"down_votes":0,"body":"Se sei fortunato sali!!*","replies":[]}]},{"poster":"Evil Within Act","date":"2015-12-04T23:07:51.895+0000","up_votes":1,"down_votes":0,"body":"Io chiedo solo se a vostro parere questo metodo di giudizio è valido perché facendo un esempio cretino sarebbe come mettere messi in una squadra di serie c che perde sempre e quindi dire che anche messi è scarso perché non riesce a far vincere la squadra (ci tengo a sottolineare che ho fatto solo un esempio con messi e la squadra di serie c - non mi reputo migliore di nessuno). E la coerenza credo debbia esistere in ogni cosa: nell'assegnare A+ ad uno e togliergli 26 LP non c'è n'è coerenza ne coesione. :)","replies":[]},{"poster":"PrinceUsuiTakumi","date":"2015-12-03T09:56:41.284+0000","up_votes":1,"down_votes":0,"body":"Se sei forte sali{{champion:35}}  evidentemente ranked non fa per te{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"ForFockSake","date":"2015-12-02T22:05:48.477+0000","up_votes":1,"down_votes":0,"body":"Devi carryare..fattelo dire da un nabbo in s4..sei midlaner hai 8 kill? E il roammare? Fossi un adc nella s5 o un support in tutte le season ti capirei, da sapport è piú difficile carryare, e nella s5 o eri una vayne pro, o eri tristana o jinx, il resto era fuffa..ma il mid laner fiddato o può vincere da solo soprattutto in questo elo , soprattutto se sei pro , avevi un vantaggio e te lo sei giocato, so che è dura e demotivante, ma i nabbi in team li troverai sempre, sta a te gestirteli meglio, ","replies":[]},{"poster":"Mar15ste","date":"2015-12-02T16:52:58.425+0000","up_votes":1,"down_votes":0,"body":"E se avessi vinto cosa avrebbero dovuto dire gli avversari?\n\"Io mi sono feedato, ma il mio midlaner era un troll ed ha dato un sacco di kill a quello avversario\"","replies":[]},{"poster":"l  Ferox  l","date":"2015-12-02T16:06:27.542+0000","up_votes":1,"down_votes":0,"body":"Capslock\nGliAltriFannoSchifo, IoEsserePro\nLagga, MaledettaRiot\n\ne altre cagate che tocca leggere in ogni post in cui qualcuno si lagna ...","replies":[]},{"poster":"I Homura I","date":"2015-12-02T14:20:06.065+0000","up_votes":1,"down_votes":0,"body":"My eyes....","replies":[]},{"poster":"DjangoUnchaìned","date":"2015-12-02T13:57:41.830+0000","up_votes":1,"down_votes":2,"body":"Si dai posta la foto!!! posta la foto!!!la foto!!!!!foto!!!\n","replies":[]}]}