{"poster":"Ulphurus","date":"2016-10-17T16:37:11.250+0000","title":"De oro a Diamante en una temporada y te lo cuento.","subforum":"Guias y consejos","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/cvgdn5","image":"http://image.prntscr.com/image/4d5a37c4c64c4067b721a547bc58b939.png"},"up_votes":25,"down_votes":15,"body":"Buenas, soy un jugador promedio que desde comienzo de temporada estaba estancado en oro 5 con 0 pl ,casi bajando a plata. Hago este post demostrar que cualquiera puede subir de division a pesar de la gente troll y los afk o gente con una muy mala actitud. Que si tocan en todas las partidas, en todas las divisiones. En todas mis ranked jugadas en esta temporada juge con la mentalidad de que debo mejorar y a pesar de perder partidas por diversos ,motivos me di cuenta que no importa de quien sea la culpa sino de como puedes mejorar esa situacion o como pudiste haberlo hecho mejor. Mejore mi toma de decisiones y mis mechanics. actualmente lidiando con todo elo de platino que es donde vi la gente con peor actitud del juego logre, llegar a diamante. No en todas las partidas que jueges podras ganar, pero si en todas podras mejorar.      \r\n   {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ZARJOR","date":"2016-10-17T20:30:05.887+0000","up_votes":19,"down_votes":0,"body":"Hola, no es por ser malo onda , pero encuentro que el merito no es mucho tomando en cuenta que subiste a diamante con una premade de 2 a 3 personas. Hubiese sido mucho mayor merito haber subido solo en base a tu habilidad y aprendizaje en el proceso.\nMi humilde opinión , no se lo tomen mal.","replies":[{"poster":"FedecarboneroUY","date":"2016-10-17T22:05:55.096+0000","up_votes":5,"down_votes":0,"body":"En seasons pasadas no hubiera sido posible todo esto.","replies":[]},{"poster":"Ulphurus","date":"2016-10-17T20:54:24.167+0000","up_votes":2,"down_votes":18,"body":"Esque yo queria jugar mayoritariamente solo q , pero mis amigos insistian y no podia dejarlos tirados","replies":[{"poster":"Psilocybes","date":"2016-10-18T05:59:44.676+0000","up_votes":3,"down_votes":9,"body":"No le des bola amigo, eso se llama **envidia**. No deben tener amigos con los cuales jugar o tienen pero son mancos seguramente y no juegan para no bajar. El juego te da herramientas para aprovechar y usar y vos las usaste. Te felicito por llegar a diamante y a seguir mejorando","replies":[{"poster":"BestAhriCuba","date":"2016-10-18T14:17:44.894+0000","up_votes":3,"down_votes":1,"body":"Si, todos lo felicitamos pero no es un logro tan dificil al hacerlo con amigos, no solo por la ventaja tactica que te da jugar con premades sino porque no tienes que enfrentarte a trolls/flammers y en todas las partidas vas a tener un buen team en el que puedes confiar, por supuesto que son las herramientas que te da el juego el no hizo trampa ni nada por el estilo, pero riot ya reconocio que ese sistema de poder jugar con toda la gente que quieras fue un fracaso y por eso la season que viene van a traer de vueta la soloq.","replies":[{"poster":"Psilocybes","date":"2016-10-20T13:09:54.301+0000","up_votes":1,"down_votes":0,"body":"Si no es tan difícil me imagino  que vos tambien lo lograste, jugando con tu gente subiendo 2 divisiones. SI juega premade te empareja contra otras premade asi que no es vos y tus amigos contra 5 soloq. De echo van a poner la cola soloQ y la dinamica va a seguir con otro nombre. SI no suben es por que no lo merecen y tienen las habilidades","replies":[{"poster":"BestAhriCuba","date":"2016-10-21T09:20:40.350+0000","up_votes":1,"down_votes":0,"body":"Ademas mira el perfil del creador del post, subio jugando con janna support y no es por desvalorizar el rol de un support pero como dice dopa/apdo: \"Janna is a good champion to get carried\" es un campeon que siempre va a ser util no importa como le valla siempre podra aportar cc para proteger al que esta carreando la partida, el problema seria cuando tu adc y apc son malisimos entonces no te sirve protegerlos y tu tampoco puedes marcar la diferencia o ganar la partida tu solo, pero ese es un problema de soloq si siempre vas a jugar con un adc que sabes que juega bien no tienes de que preocuparte y ¿a que va eso de si no suben es porque no lo merecen y tienen las habilidades? por supuesto que no lo merecemos ¿quien te dice lo contrario?","replies":[{"poster":"Psilocybes","date":"2016-10-21T17:41:30.692+0000","up_votes":1,"down_votes":0,"body":"No voy a seguir un charla sin sentido, das argumentos que no tienen nada que ver con el tema. Alguien que sabe jugar carrea con lo que sea en cualquier lado, tu problema es que jugo con janna? Que sabes los desengage que hizo, si salvo al adc, si zoneeo a la bot lane rival con el tornado, si hizo un insec con la ulti? **Critican por criticar, ven a alguien que hizo algo que ustedes no pudieron y tratan de bajarle el merito**. El juego dio la posibilidad de jugar con amigos, y las cosas lamento decirte en este mundo cuando se puede obtener una ventaja se la obtiene sino te pasan por arriba amiguito. El sistema funciona, todos están donde merecen estar independientemente si jugar soloQ, con 2 3 4 amigos o con tu hermano el sin brazos no importa eso. \n> ¿a que va eso de si no suben es porque no lo merecen y tienen las habilidades? por supuesto que no lo merecemos ¿quien te dice lo contrario?\n\nUstedes mismo lo dicen posteando aca \"no man no vale jugaste con amigos, te carrearon, gg izi la wea\" y toda las pelotu3ces que dicen. Como si el sistema fuera injusto con ustedes y merecen algo mas que lo que tienen.\nEl tema de cambio de fomato en partidas clasificatorias viene de la mano con que el LoL se esta muriendo, es la realidad. A todos los juegos le paso, les pasa y les pasara. La Dynamic nunca fue bien vista y ante la baja de jugadores tienen que hacer lo que la comunidad quiera para evitarlo, Vease \"teemo demonio\" \"pantheon panadero\" \"rotacion de URF\" y todo eso. No tiene nada que ver con que no funcione el sistema.\nUn saludo y exitos en el juego y lo demás.","replies":[{"poster":"BestAhriCuba","date":"2016-10-21T18:15:25.650+0000","up_votes":1,"down_votes":0,"body":"Yo no estoy de acuerdo con ese razonamiento pero eso no quiere decir que no lo respete.\n\n>  El juego dio la posibilidad de jugar con amigos, y las cosas lamento decirte en este mundo cuando se puede obtener una ventaja se la obtiene sino te pasan por arriba amiguito. \n\nPara mi eso de jugar con amigos, la idea era buena pero fue muy mal ejecutada por lo tanto fue un error de parte de riot y por supuesto que la gente se aprovecho de ello para subir elo, como paso con todos los bugs que tardaron en parchear y la gente se aprovecho de ellos para subir elo como loco. Estoy de acuerdo en que el sistema funciona pero no todo el mundo esta en donde merece los eloboosteados existen, el negocio de pagar dinero para que alguien te carree ha crecido exponecialmente en esta season en parte gracias a la dynamicq. \n\n> Ustedes mismo lo dicen posteando aca \"no man no vale jugaste con amigos, te carrearon, gg izi la wea\" y toda las pelotu3ces que dicen\n\nYo nunca dije nada de eso y te repito lo felicito al pibe que hizo el post solo digo que no es tanto el merito como si lo hubiera hecho en la season pasada, no estoy celoso, ni le tengo envidia, el pibe tampoco se puso a presumir ni a restregar que subio a diamante ni nada por el estilo. Quizas te di a entender que estoy diciendo que yo soy mejor que el pero no estoy en diamante porque juego soloq y el juega dynamicq, nada que ver yo estoy contento con mi liga y se que merezco estar en ella.\n\nLa dynamic q solo duro una season porque fue una BASURA de sistema, esta temporada ha sido la peor (almenos para mi)  en cuanto a clasificatorias desde tener que esperar 20 minutos a que encuentre una partida para que sea un remake hasta ser flameado y reportado hasta la saciedad por premades toxicas ya estoy harto y no quiero jugar una sola ranked mas con esta mierda de sistema. Esto fue lo peor que ha hecho riot en cuanto a jugabilidad, si por lo menos tengo que soportar eso a cambio de que disminuya la toxicidad del server, pero no seguis encontrandote la misma cantidad de flamers en todas las partidas. Pero bueno eso ya es otro tema.\nSaludos y suerte.","replies":[]}]}]},{"poster":"BestAhriCuba","date":"2016-10-20T14:19:41.024+0000","up_votes":1,"down_votes":0,"body":"Si el emparejamiento fuera perfecto y esa regla de que cuando juegas premade te empareja con otra premade del mismo tamaño la dynamic q habria sido un exito, he jugado algunas partidas con premades en esta season y en la unica ocasion que puedo asegurar que eso se cumple es cuando juegan 5 personas en premade ahi estoy 100% seguro que te empareja con otra premade de 5. Pero si armas una premade de 3 o 4 personas en el 80% de las veces te va a tocar contra soloplayers o contra una premade de 2. Una tarde me quede a viciar con un amigo y el invito a los de su club, eramos 4 comunicados por skype estuvimos jugando desde las seis de la tarde hasta la 1 de la mañana y las ganamos todas, absolutamente todas invadiamos a lvl 1 sacabamos primera sangre y de ahi nos moviamos en grupo hacia una linea he ibamos tirando torres y cazando gente en la jungla enemiga. Ami no me gusta realmente jugar en premade y no subi 2 divisiones asi, pero las pocas partidas que juge con amigos subi de oro 4 a oro 2 en un instante. Y como soloplayer nunca me he encontrado premades de 5, pero si premades de 4 en el team enemigo super organizadas que me han stompeado mientras que todo mi team estaba flameandose entre si.\n\nEn un principio habian dicho (en el video de la mesa redonda) que soloq no iba a volver nunca mas y se iban a enfocar de lleno a mejorar la dynamic, ahora dicen que la dynamic fue un experimento fallido y que van a traer la soloq de vuelta y la dynamic por separado y como la dynamic q depende de los soloplayers dicen que si todos los soloplayers se van a jugar soloq van a eliminar la dynamic q permanentemente.","replies":[{"poster":"Ulphurus","date":"2016-10-20T23:35:09.048+0000","up_votes":1,"down_votes":0,"body":"Como sabes cuando son premade ???  yo antes lo veia en la pagina de lolskill pero ahora ya no sale, apenas  los reconosco cuando los veo en el mismo club.","replies":[{"poster":"BestAhriCuba","date":"2016-10-21T01:32:19.159+0000","up_votes":1,"down_votes":0,"body":"en la pagina op.gg en el perfil de cada jugador te dice con quien han estado jugando en partidas anteriores, entonces mientras estas en seleccion de campeon ves si tus enemigos han estado jugando recientemente entre ellos, si es asi es porque son premade. Si es la primera vez que ese grupo de personas estan jugando juntos creo que no tienes forma ( o almenos yo no la he encontrado) de darte cuenta que estas jugando contra una premade.","replies":[]}]}]}]}]},{"poster":"Reverze","date":"2016-10-18T16:59:23.519+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Psilocybes,realm=LAS,application-id=8sKIclmi,discussion-id=NQ20Mmuk,comment-id=001000000000,timestamp=2016-10-18T05:59:44.676+0000)\n>\n> No le des bola amigo, eso se llama **envidia**. No deben tener amigos con los cuales jugar o tienen pero son mancos seguramente y no juegan para no bajar. El juego te da herramientas para aprovechar y usar y vos las usaste. Te felicito por llegar a diamante y a seguir mejorando\n\nBuen concepto. Los amigos son herramientas, y riot te las \"dio\". Luego la gente se enoja porque nuestros paises van cada vez peor mientras el mundo entero avanza... \n\nLo mejor es que la gente que juega MierdQ no solo que no aprende nada, sino que te restriegan en la cara que llegaron a donde están EN PREMADE... Lamentable esta season, más aún riot...","replies":[{"poster":"Psilocybes","date":"2016-10-20T13:06:36.718+0000","up_votes":1,"down_votes":0,"body":"Me referia a la herramienta era \"jugar con amigos\" pero bueno que se le puede pedir a gente como ustedes, Si no suben es por que no tienen las habilidades y punto. Lo demás son escusas","replies":[]},{"poster":"N7 Andr0med4","date":"2016-10-19T00:22:21.552+0000","up_votes":1,"down_votes":0,"body":"esto me huele a carro pero a full a más no poder.","replies":[]}]}]}]},{"poster":"HeroFreezer","date":"2016-10-18T23:57:54.238+0000","up_votes":1,"down_votes":0,"body":"La verdad que sos mala onda si jaja, el tipo cuenta contento sus logros y vos lo tiras abajo. Te cuento que por mas que lo alla hecho con premade el sistema tambien lo va a emparejar con otros premades y si el no pone lo suyo por mas que sus amigos sean faker no lo levantan ni con una grua.","replies":[]}]},{"poster":"cojien dote","date":"2016-10-17T19:46:14.452+0000","up_votes":12,"down_votes":0,"body":"Jugaste solo o en premade?","replies":[{"poster":"Reverze","date":"2016-10-18T17:00:17.547+0000","up_votes":2,"down_votes":1,"body":"MierdQ cof cof {{champion:119}}","replies":[]}]},{"poster":"Watta","date":"2016-10-17T22:57:23.244+0000","up_votes":10,"down_votes":0,"body":"no cuenta si sos carreado :)  denunciado","replies":[]},{"poster":"nkosan","date":"2016-10-17T23:11:26.571+0000","up_votes":9,"down_votes":0,"body":"na man si subis en premade es un chiste, eso es de careados, yo si la sufrí de plata 4 hasta diamante jugando solo y teniendo que aguantar a premades abusando de su comunicacion en ranked, eso es ser diamante! lo demas son tonterias izi sry","replies":[{"poster":"MLCPWhatsApp","date":"2016-10-23T01:49:08.484+0000","up_votes":1,"down_votes":0,"body":"Olvidat3.... yo pase la misma..","replies":[]}]},{"poster":"Juanci","date":"2016-10-17T23:44:07.394+0000","up_votes":8,"down_votes":0,"body":"> No en todas las partidas que jueges podras ganar, pero si en todas podras mejorar.\n\nhttp://k30.kn3.net/taringa/8/B/B/6/F/4/vagonettas/FB7.gif\n\nLo mejor que leí en el foro hoy","replies":[{"poster":"chÍkorita","date":"2016-10-18T22:02:03.350+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TReads,realm=LAS,application-id=8sKIclmi,discussion-id=NQ20Mmuk,comment-id=0017,timestamp=2016-10-17T23:44:07.394+0000)\n>\n> http://k30.kn3.net/taringa/8/B/B/6/F/4/vagonettas/FB7.gif\n> \n> Lo mejor que leí en el foro hoy\n\nx2","replies":[]},{"poster":"Dresz","date":"2016-10-18T21:27:33.103+0000","up_votes":1,"down_votes":0,"body":"Todo lo que dijo fue bueno jajaja","replies":[]},{"poster":"Ulphurus","date":"2016-10-18T00:12:32.551+0000","up_votes":1,"down_votes":0,"body":"jajaa <3","replies":[]}]},{"poster":"Thurdock","date":"2016-10-17T19:12:42.072+0000","up_votes":3,"down_votes":0,"body":"Gracias por contarmelo, me hubiera venido mejor un consejo y no una historia muy por arriba que parece más algo de superación y autoayuda, pero gracias igualmente.","replies":[]},{"poster":"Exorsus","date":"2016-10-19T13:28:47.661+0000","up_votes":2,"down_votes":0,"body":"No tiene mérito subir en un grupo de muchos, no aprendes nada y te dejas carrear, cuando subas por tu cuenta ahí recién puedes alardear y gritar que has subido de oro a diamante en una season, pero en un grupo de 3,4,5 no tiene gracia, lo bueno es que la próxima season se te acaba la mentira :)","replies":[]},{"poster":"Paradisia","date":"2016-10-18T14:07:12.294+0000","up_votes":2,"down_votes":0,"body":"\"No en todas las partidas que jueges podras ganar, pero si en todas podras mejorar.\" Me llego al cora{{item:3070}}","replies":[]},{"poster":"Ashakiel","date":"2016-10-18T02:53:40.427+0000","up_votes":2,"down_votes":0,"body":"Yo de plata 5 a diamante 5 :v","replies":[]},{"poster":"LGBT Valentina","date":"2016-10-17T22:16:21.970+0000","up_votes":2,"down_votes":0,"body":"Yo empeze en s3, a 2 meses antes de que terminara la temporada, llegue a gold 5 (cuando ya habian entregado las recompensas, osea no las tenia)\nLa s4, fui diamond 5\nLa s5, rankie poco y quede d2 o d1, no me acuerdo\nAhora, recien baje de master\n\nSiempre jugue solo, recien ahora estoy haciendo duo con un amigo \n\nBronze-silver es lo mismo y gold a diamond 3-4 es EXACTAMENTE lo mismo, es mas en mi smurf suelo darme cuenta que los platinos juegan mejores que los diamantes \n70% de los diamond, son diamond 5 y CASI TODOS son carried o elooboots, x eso es el peor elo hell de todos. Hay gente que ni sabe dar last hit\n\nLo unico que veo ultimamente, es que el nivel empeora y personalmente, pienso que hay que poner una liga entre platino y diamond o poner mas tiers entre las ligas\n\nPero de todas formas, felicitaciones\n\nCualquiera que quiera subir a diamond 5. Puede lograrlo de la siguiente forma:\n1: Mira tu errores, no los del otro. No le enseñes a jugar al otro o no le señales su error, nunca mas lo vas a ver y probablemente se lo tome a mal\n2: Usa el champ que quieras en la lane que quieras. Lo importante es sentirse seguro y divertirse, cuando maineas un champ no solo tenes claro que hacer en linea, podes poner atencion en el resto del mapa (tp-objetivos, etc)\n3: En el menu dentro del juego, hay una opcion hermosa llamada:\ndeshabilitar chat ALL (global), osea no podes escribir en ALL ni leer lo que el enemigo pone. Es 100% recomendable\n\n\nY les recomiendo fuertemente, aprovechar la toda la experiencia que acumulen. Por que cuando lleguen a diamond 5, el ultimo elo hell y es lo peor que existe\nEl problema de diamond 5, es que cuando salis. En d2-d1 hay una diferencia de nivel impresionante, osea te rompen el orto (me paso varias veces)","replies":[{"poster":"MLCPWhatsApp","date":"2016-10-23T01:54:40.658+0000","up_votes":1,"down_votes":0,"body":"Ajjjaja la posta de la posta... en d5 son mas mancos.... yo te digo..  soy platino 5 y me subi solito... y como tengo el elo alto me emparejan con y contra 2 o 3 diamantes 5 siempre .. y son de mancos.....   \n\nDespues tengo muchos amigos q son challenger ya hace rato y ponele juego yo platino 5 y 3 challenger y nose en el emparejamiento toca siempre un master o diamond elo alto y al frentr obvio toca algo parecido y  te digo que me deslomo diveando , flasheando, tryhardeando q se yo hago de todo pero te dan cada garchada es algo que la verdad me gusta vivir.... se aprende mucho viendo a elos mas altos que vos\n\nA este loco a lo mejor le pasa lo mismo... eso es positivo","replies":[]},{"poster":"HeroFreezer","date":"2016-10-19T00:00:53.336+0000","up_votes":1,"down_votes":0,"body":"El mejor comentario por lejos {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Celta","date":"2016-10-18T02:37:31.201+0000","up_votes":4,"down_votes":2,"body":"mechanics o mecanicas? creo que estamos en LAS no en NA o me equivoco?","replies":[{"poster":"JustoxGames","date":"2016-10-18T17:16:21.096+0000","up_votes":2,"down_votes":1,"body":"¿y eso que tiene que ver? Se entiende igual y queda mejor. Le decimos \"lol\" no, \"Ldl\"","replies":[{"poster":"Celta","date":"2016-10-19T04:18:57.441+0000","up_votes":1,"down_votes":0,"body":"No somos países spanglish, hablamos en español, en na dicen así, acá decimos mecánicas.","replies":[{"poster":"JustoxGames","date":"2016-10-19T13:08:54.339+0000","up_votes":1,"down_votes":0,"body":"Entonces deberiamos comenzar a cambiar todos los terminos de lol, comenzando por el ss, hasta el colddown, etc.\nPD: Nos vemos en la liga de leyendas","replies":[]}]}]}]},{"poster":"JustoxGames","date":"2016-10-18T17:19:14.484+0000","up_votes":2,"down_votes":1,"body":"Que asquito toda la gente criticándote por haber subido, jugando con amigos, Yo invito mis amigos a las partidas y tenemos el mismo chat que ellos, y los mismos pings, no cambia nada, es solo otra escusa para cuando pierdes.","replies":[]},{"poster":"Support KR","date":"2016-10-17T17:17:14.515+0000","up_votes":1,"down_votes":1,"body":"felicidades bro!!!, yo juego league of legends de esta season, y me tomo los juegos muy enserio competitivamente logrando llegar a actualmente a oro 1 jugando solo soporte, parti en bronce 2 sin saber nada pero absolutamente nada del game, autocriticandome analizando errores aprendiendo los calls etc... logre subir muy rapido","replies":[{"poster":"Ulphurus","date":"2016-10-17T19:44:35.365+0000","up_votes":2,"down_votes":1,"body":"Cuando de verdad me tome enserio el juego de manera competitiva como tu, fue el momento en que empeze a subir","replies":[]}]},{"poster":"LICENZED","date":"2016-10-17T16:43:43.652+0000","up_votes":2,"down_votes":1,"body":"Gracias por contarnos tu experiencia. La verdad, a mi me anima.\n\nLo intentaré la siguiente season.","replies":[]},{"poster":"Hide On Penywise","date":"2016-10-18T14:59:42.928+0000","up_votes":1,"down_votes":0,"body":"en la otra temporada se verán los que son cabrones en el juego .... me ha costado mucho salir solo de bronce, silver y ahora oro 5 ,  ...... y puedo decir que cuesta mucho salir solo .{{summoner:13}}","replies":[]},{"poster":"KzG Arconte","date":"2016-10-19T06:41:36.248+0000","up_votes":1,"down_votes":0,"body":"tremendo carrito se hicieron de premades, malditos XD {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Informconf","date":"2016-10-17T17:36:19.374+0000","up_votes":1,"down_votes":1,"body":"Buena onda tus ganas de superarte, ahora dejame a mi y a los otros perros a quienes les chupa 3 huevos y sienten que malgastaron años y dinero en este juego de mierda :DD","replies":[{"poster":"JustoxGames","date":"2016-10-18T17:20:57.522+0000","up_votes":1,"down_votes":0,"body":":D","replies":[]}]},{"poster":"Zero Fox","date":"2016-10-18T08:42:36.092+0000","up_votes":1,"down_votes":0,"body":"Pues felicitaciones! =P también subi diamante jugando un 75% de las partidas solo, utilizando solo pantheon en jungla, mid y top, que es mi main, me cree esta cuenta en junio y hace 1 semana llegue diamante, tarde unas 230 ranked para estar ahi.\n\nConcuerdo que platino es la liga mas toxica, muchos se creen faker y no aceptan criticas, después en oro fue donde mas me divertí, las partidas estaban buenas.\n\nAhora en diamante esta bueno, hay gente que juega bien, pero también hay otros que tienen el nivel de un bronce 5 y no entiendo que hacen jugando en esta liga.","replies":[{"poster":"Ulphurus","date":"2016-10-18T16:18:36.772+0000","up_votes":1,"down_votes":0,"body":"He escuchado mucho que los diamantes 5 son en su mayoria eloobosteados, nose me parece una explicacion bastante logica, yo con mi janna en su momento llegue a tener 70% win rate, ahora lo baje a 68% con mas de 100 partidas jugadas","replies":[]}]}]}