{"poster":"Hallbuster","date":"2017-04-02T03:42:04.264+0000","title":"When my team steals all my kills and then calls me a feeder.","subforum":"Gameplay","up_votes":5,"down_votes":1,"body":"What am I supposed to do?","replies":[{"poster":"Limmie","date":"2017-04-02T03:50:00.128+0000","up_votes":3,"down_votes":0,"body":"Mute them.","replies":[{"poster":"qViolet","date":"2017-04-02T04:30:50.725+0000","up_votes":3,"down_votes":0,"body":"This guy gets it. Mute them and play your best. While it is preferable you get the kills if you're a carry, if you don't, that's fine. A kill is a kill, and no one is entitled to kills.\n\nMute, play your best, get out of ELO where kids argue all day, eventually get to good players and have teammates who want you to have the kill when you're the carry, profit.","replies":[]}]},{"poster":"FantasySniper","date":"2017-04-02T04:20:17.528+0000","up_votes":2,"down_votes":0,"body":"Build on schedule, watch them waste their gold and streaks, and lose guilt-free knowing it wasn't your fault if they couldn't use their lead.","replies":[]},{"poster":"Irelia Bot","date":"2017-04-02T06:32:18.357+0000","up_votes":1,"down_votes":0,"body":"you feed \n\nDuh","replies":[]},{"poster":"Kilanost","date":"2017-04-02T06:31:45.357+0000","up_votes":1,"down_votes":0,"body":"Stop dying.  You have a lot of games with 10+ deaths.  Granted you have a lot of games with 10+ kills as well but its better to go 3/2 than it is 15/10.  here is why:\n\nWhen you die a lot to get kills, you are getting stronger relative to the rest of the enemy team, but the rest of your team is getting weaker compared to the rest of the enemy team.  At the same time, when you get kills, you're reseting your kill value back to full and possibly even getting a bounty.  You give all that to the team to kill someone who possibly is on a 3x death streak and you're only getting like 250 gold.  If you get the solo kill and they have an assist, youve given the enemy team 450 gold to make 250.  And it gets even worse if you have a bounty","replies":[]},{"poster":"BigBellBrute","date":"2017-04-02T04:14:04.992+0000","up_votes":1,"down_votes":0,"body":"Well if they're stealing your kills you should have a lot of assists right?","replies":[]}]}