{"poster":"Samuraisub","date":"2015-09-07T21:04:39.557+0000","title":"Suche nette gute Teams","subforum":"Clans & Teams","up_votes":1,"down_votes":3,"body":"Hallo Leute,\nIch suche ein nettes Premade Team mit den ich zuk&uuml;nftig spielen kann. Mir w&auml;re am liebsten wenn diese min. Silber sind und alle Rollen gut beherrschen. Ich habe es satt die ganze Zeit mit schlechten Teams zu spielen. Ich wei&szlig; man soll nicht immer alles auf die Teams schieben, aber LoL ist ein Teamspiel und wenn man kein Teamwork hat kann man das Spiel gleich in die Tonne hauen. Ich meine kennt ihr auch nicht das Gef&uuml;hl ihr k&ouml;nnt nicht Premade spielen weil Freunde \"grad\" nicht k&ouml;nnen, ihr dr&uuml;ckt Solo Queue und Boom ein Team mit einem &uuml;bertrieben Feeder ein Flamer und das beste nicht normale Feeder oder Flamer, Nein sondern Feeder und Flamer die 0 Teamwork zeigen. Wenn sie kein Skill haben ist es mir egal weil das kann man mit der Zeit noch schaffen, doch wenn sie von Anfang an nicht gewillt sind im Team zu arbeiten dann ist das f&uuml;r die Katz. Und ich man kann nicht alleine f&uuml;r sein Team carryn, ich hab es zig male versucht immer wenn ich 1/0 - 3/0(Oder sagen wir mal ich habe positive KD und Farm) steht die Bot Lane extrem schlecht oder sonst w&auml;r auch immer. Und wenn der ADC suckt dann ist das besonders eklig weil er eigentlich die konstante Schadensmenge ist die man in Teamfight ben&ouml;tigt. Ich m&ouml;cht nicht sagen das ich perfekt bin, ich mach auch Fehler aber ich w&uuml;rde mal zu gerne wieder ein Team haben mit einwandfreien Spieler die nicht zu flamen. Da frag ich mich ob ich nicht besser in die Bronze League reingesteckt werden soll weil Silber der gleiche Mist ist. Es gibt immer ein Gegner Team mit perfekten Teamwork und ein Team das man nicht Team nennen kann. Nimmt mir es nicht &Uuml;bel das ich eure Zeit mit den Text verschwendet habe. W&uuml;rd mich freuen wenn es jemand gibt der es genauso sieht. Ich bin pers&ouml;nlich kein Flamer und einer der Teamwork zeigt, feeden kann ich auch aber ich mach das selten weil ich wenn ich es tue sehr safe playen kann... . \nIch brauche ein GUTES TEAM {{item:3070}} {{champion:32}} {{item:3070}}  PLS!!! \nIch vermisse die Zeiten wo ich noch gute Teams hatte und ich habe ja oft noch welche, aber in letzter Zeit h&auml;ufen sich die Anzahl von schlechten Teams","replies":[{"poster":"Maexle","date":"2015-09-07T22:54:11.279+0000","up_votes":4,"down_votes":0,"body":"Du suchst wirklich nette Leute in LoL? o.O Das wird schwer aber viel Erfolg bei der Suche {{champion:17}}","replies":[{"poster":"Samuraisub","date":"2015-09-08T20:20:21.267+0000","up_votes":2,"down_votes":0,"body":"Danke, hat erst wieder mal ein gutes Team und hatte wirklich mal wieder Spaß. Leider kommen und gehen gute Teams und gleich danach kam wieder das typsiche DOOM Team...{{champion:32}}","replies":[]}]}]}