{"poster":"Sabrewolf","date":"2019-01-23T20:55:55.334+0000","title":"USARE IL GUARDIANO DELLA LANDA","subforum":"Aiuto e supporto","up_votes":1,"down_votes":5,"body":"al di l&agrave; dell&#039; utilit&agrave; o meno di prendere il guardiano della landa\r\nSONO STUFO DI GENTE CHE MI RUBA LO STEMMINO E NON LO USA!!!!!!!!\r\nNON &egrave; POSSIBILE NEL ULTIMA PARTITA L&#039;HO LASCIATO AL JUNGLER    E NON L&#039;HA USATO!!!!!!!\r\nCAPISCO QUANDO FACCIO IO IL JUNGLER E VIENE IL MIO TOP A RUBARMELO POI MAGARI NON SA NEMMENO SE SI MANGIA.....MA IL JUNGLER?!??!?!???!\r\n va be per chiunque non lo sapesse ucciso il guardiano della landa lascia gi&ugrave; la sua runa stemmino o come si chiama, se lo raccogliete al posto della ward compare un robino viola, ci cliccate su ed dopo una breve canalizzazione, ESCE UN MOSTRO PAZZESCO CHE TIRA GI&ugrave; LE TORRI NEMICHE TANTO PER FARE QUALCOSA. quindi se lo prendlete USATELO PER LA MISERIA!!!!!!!!!!!!!!!!!!!\r\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Sabrewolf","date":"2019-01-25T08:31:32.838+0000","up_votes":1,"down_votes":2,"body":"Stando all'inquietante sito spia io non sapendo farmare e con una build senza senso usando kled faccio dal 50 al 70% delle kill della squadra. Quando tu il 70% lo fai solo quando dormi! PS molla tu la banana che diventi cieco","replies":[{"poster":"Gandogar95","date":"2019-01-26T16:57:30.779+0000","up_votes":1,"down_votes":0,"body":"Veramente stando allo stesso sito la tua partecipazione (partecipazione e non kill,le kill stanno sul 20%) kill media é sul 40-45% (senza contare che per quanto Buildi a cazzo o con un farm indecente ti basta fare una qualsiasi cosa per prendere assist e quindi aumentare la partecipazione kill) . Prendendo più parametri che danno una  visione corretta nel complesso,quindi non farmi, non pushi,Buildi a cazzo,non prendi obbiettivi,usi i champ in una lane errata,Feedi spesso e non partecipi nemmeno così positivamente alle kill. Non male m8. Ma tranquillo, stai giocando con quelli al tuo livello quindi é bilanciata la cosa. Se e quando imparerai a capire che di questo gioco non ci capisci una mazza sarà il momento in cui potrai iniziare a imparare. Nel frattempo cazzeggia pure,ma di conseguenza aspettati di giocare con altri player che cazzeggiano. Byebye","replies":[{"poster":"Sabrewolf","date":"2019-01-29T10:42:25.074+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Gandogar95,realm=EUW,application-id=98NGV4Al,discussion-id=attEBVPw,comment-id=00020000,timestamp=2019-01-26T16:57:30.779+0000)\n>\n> Veramente stando allo stesso sito la tua partecipazione (partecipazione e non kill,le kill stanno sul 20%) kill media é sul 40-45% (senza contare che per quanto Buildi a cazzo o con un farm indecente ti basta fare una qualsiasi cosa per prendere assist e quindi aumentare la partecipazione kill) . Prendendo più parametri che danno una  visione corretta nel complesso,quindi non farmi, non pushi,Buildi a cazzo,non prendi obbiettivi,usi i champ in una lane errata,Feedi spesso e non partecipi nemmeno così positivamente alle kill. Non male m8. Ma tranquillo, stai giocando con quelli al tuo livello quindi é bilanciata la cosa. Se e quando imparerai a capire che di questo gioco non ci capisci una mazza sarà il momento in cui potrai iniziare a imparare. Nel frattempo cazzeggia pure,ma di conseguenza aspettati di giocare con altri player che cazzeggiano. Byebye\n\nMi vene il dubbio: giochi a livello professionale? Ti guadagni da vivere con lol? Anche se ti credi il campione del mondo sei uno come tanti! ti prendi troppo sul serio! E comunque non capisco come fai a tirartela tanto neache tu sei un gran che","replies":[{"poster":"Gandogar95","date":"2019-01-29T12:21:06.270+0000","up_votes":1,"down_votes":0,"body":"Non mi credo il campione del mondo e ne gioco professionale,tanto più che non citato la mia skill elo o quant'altro. Ho fatto solo un'analisi oggettiva di come giochi e spiegandoti pacatamente che se giochi da scimmia il sistema ti fa giocare con le scimmie,quindi se pretendi di avere un team con mezzo cervello devi prima utilizzarlo anche tu.\nInoltre Non sono io ad aprire lamentele inutili per lagnarmi dell'incapacità del mio team; evidentemente quello che si prende troppo sul serio non sono io qui.\nNon ti rispondo per sfotterti o quant'altro,ma per spiegarti che ti stai tirando la zappa sui piedi da solo. Inoltre, aggiungo che nel momento in cui (se) lo capirai,sono disponibilissimo a perdere mezz'ora in game a spiegarti almeno i fondamentali di lol","replies":[{"poster":"Sabrewolf","date":"2019-02-01T21:39:58.109+0000","up_votes":1,"down_votes":0,"body":"intanto scimmia sarai tu.\ne poi sei silver non è tutto sto gran che.\nTi spiego come gioco\npremetto che se gioco top è per il guardiano della landa! perché da jungler non mi aiuta mai nessuno a ucciderlo e me ne posso anche fare una ragione, quel che è peggio è che quando lo sgancio in corsia i miei alleati quasi sempre smettono di spingere e lasciano me e il guardiano a domandarci come mai. Tra l'altro non mi sono ancora risposto, credo perché considerano che gli rubo la torre. \n\nil mio era uno sfogo, anche perché il jungler mi aveva fatto innervosire dicendo di farmi report perché gli rubavo le kill e gli avevo rubato lo stemmino del guardiano, nessuna delle 2 vera, almeno per me rubare una kill è stare tutto il tempo in un cespuglio e saltare fuori solo per il colpo di grazia se partecipo non è rubata ( mi ha irritato tanto che me lo ricordo ancora adesso).\n\ncomunque non spingo perché SE il jungler mi caga e SE riusciamo a uccidere il top avversario, la mia R è comodissima per andare a prendere anche il mid! Se no la uso per raggiungere il jungler se è in uno sconto nella giungla top.\n\na 10 minuti in qualunque caso rompo le palle al jungler con sto benedetto guardiano che è fortissimo e quasi nessuno lo usa, in 2 si uccide in un attimo e così siamo almeno in 2 a spingerlo, tirato poi su una torre con l'armatura prendiamo pure un sacco di soldi.\n(ammesso che il top avversario non si fortissimo e mi uccida 3 volte in 5 minuti o cose del genere)\n\nla mia build senza senso come dite voi è tutta basata sulla velocità d'attacco, dato che kled colpendo i campioni nemici accumula punti per risalire su skarl così riesco a gestire anche alcuni 1 vs 2\n\nultime cose \nDirmi senza offesa prima di offendere è una cosa che non sopporto! \n\nPenso che se ti sei unito alla discussione è solo per fare polemica, insieme a me, i tuoi commenti da qualunque punto li guardo hanno poco di obbiettivo\n\nultimo ogni tanto uso kled in mid perché avvolte becco qualche furbone che si mette in top con un campione mid e poverini li maciullo sempre, ma in mid non mi riesce cosi bene\n\nti aggiungo cosi una partita ce la facciamo\nfacevo prima a scrivere un poema","replies":[{"poster":"Gandogar95","date":"2019-02-02T10:11:05.962+0000","up_votes":1,"down_votes":0,"body":"Lol.\n1- Qui non sono silver ma G2 nonostante sia appena iniziata la nuova season (imparare a usare op.gg oltre che per spiare gli utenti, ti può dare una marea di informazioni utili). Questo inoltre é solo il profilo secondario dove sto cercando di fare il diamond solo con troll pick (con il principale lo ho già preso da un paio di anni,non riuscendo peró da buon nabbo a superare il vecchio D4))\n2- non ho mai detto senza offesa. Il mio intento era proprio quello di farti capire che giochi con gente da schifo semplicemente perché fai schifo pari pari a loro. Di conseguenza se vuoi giocare con gente che non piange per le kill rubate e ha mezza idea di come si giochi,devi in primis imparare tu \n3-addami pure,appena ti vedo in game provo a spiegarti meglio. Ti chiedo solo di cercare di sfruttare quel lasso di tempo per tentare di imparare (e dove ti spiegherò nel dettaglio perché la tua metodica di build e di gioco sia inefficace)","replies":[]}]}]}]}]}]},{"poster":"Lezz95","date":"2019-01-24T00:31:17.147+0000","up_votes":1,"down_votes":0,"body":"se nessuno dei tuoi compagni non lo sa usare è perchè probabilmente giochi con gente scarsa, ovvero del tuo livello (senza offesa).\nDi fatto questo [(clicca qui)](http://euw.op.gg/summoner/userName=Sabrewolf) spiega il fatto del perchè nessuno lo usa.\nsei unranked e la tua ultima partita con kled top avevi 57 cs (minions) a 27 minuti. che prettendi? di giocare con diamanti? \n\ngioca di piu e incomincia a rankare e vedrai che la gente di elo alti sa sicuramente che cosa è un herald e di come si usa. anche perche un CC durante la canalizzazione annulla l'attivazione dell'herald e ciao ciao.\n\nWelcome to the Hell.","replies":[{"poster":"Sabrewolf","date":"2019-01-24T08:05:02.622+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Lezz95,realm=EUW,application-id=98NGV4Al,discussion-id=attEBVPw,comment-id=0001,timestamp=2019-01-24T00:31:17.147+0000)\n>\n> se nessuno dei tuoi compagni non lo sa usare è perchè probabilmente giochi con gente scarsa, ovvero del tuo livello (senza offesa).\n> Di fatto questo [(clicca qui)](http://euw.op.gg/summoner/userName=Sabrewolf) spiega il fatto del perchè nessuno lo usa.\n> sei unranked e la tua ultima partita con kled top avevi 57 cs (minions) a 27 minuti. che prettendi? di giocare con diamanti? \n> \n> gioca di piu e incomincia a rankare e vedrai che la gente di elo alti sa sicuramente che cosa è un herald e di come si usa. anche perche un CC durante la canalizzazione annulla l&#x27;attivazione dell&#x27;herald e ciao ciao.\n> \n> Welcome to the Hell.\n\nNo nessuna offesa figurati è che io ho una vita e non intendo sprecarla tutta su un gioco come fai te senza offesa ovviamente","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-01-24T11:38:50.095+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sabrewolf,realm=EUW,application-id=98NGV4Al,discussion-id=attEBVPw,comment-id=00010000,timestamp=2019-01-24T08:05:02.622+0000)\n>\n> No nessuna offesa figurati è che io ho una vita e non intendo sprecarla tutta su un gioco come fai te senza offesa ovviamente\n\nGiochi da scimmia e pretendi di non giocare con le scimmie. Una persona normodotata solitamente impara dopo un mesetto di gioco a farmare più di 2.5 cs/m e a seguire almeno almeno le build consigliate (visto che le tue inventate non hanno mezzo senso), non é un incapacità data dal \"ma io ho  una vita\". Oltrettutto giochi circa 6-7 game al giorno, quindi di tempo in realtà ne investi pure molto","replies":[{"poster":"Sabrewolf","date":"2019-01-24T23:59:40.166+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=V3LK0ZMAST3R,realm=EUW,application-id=98NGV4Al,discussion-id=attEBVPw,comment-id=000100000000,timestamp=2019-01-24T11:38:50.095+0000)\n>\n> Giochi da scimmia e pretendi di non giocare con le scimmie. Una persona normodotata solitamente impara dopo un mesetto di gioco a farmare più di 2.5 cs/m e a seguire almeno almeno le build consigliate (visto che le tue inventate non hanno mezzo senso), non é un incapacità data dal &quot;ma io ho  una vita&quot;. Oltrettutto giochi circa 6-7 game al giorno, quindi di tempo in realtà ne investi pure molto\n\nQuel sito è inquietante roba da grande fratello, non ho capito cosa ve ne fate che non siete neanche in grado di leggerlo. Che tu non capisca la mia build non mi sorprende! Se poi non gioco come un minion gigante che arriva e spinge da demente tutto il tempo come fai tu, è una mia scelta! Dato che sulla mappa ci sono anche dei obbiettivi, da aiutare il jungler e aiutare le altre corsie cose evidentemente per te sconosciute","replies":[{"poster":"Gandogar95","date":"2019-01-25T02:19:02.876+0000","up_votes":2,"down_votes":1,"body":"Chiunque abbia una minima conoscenza di LOL non é in grado di capire quella build,visto che non ha un minimo senso,così come l'omettere totalmente il farm per cazzeggiare in giro. \nFidati di quello che ti dicono m8,tu di questo gioco non c'hai ancora capito mezza virgola; non é grave,basta mettere giù la banana e cercare di imparare \n","replies":[]}]}]}]}]},{"poster":"Jiro is my waifu","date":"2019-01-23T22:32:50.107+0000","up_votes":1,"down_votes":0,"body":"Si chiama herald, o messaggero della landa","replies":[]}]}