{"poster":"Xandrer","date":"2018-09-02T15:36:36.479+0000","title":"\"Scegliere\" le persone con cui giocare","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Salve, quello che voglio chiedere potrebbe sembrare da razzisti, ma non lo sono e non so un altro modo per chiederlo :D. Esiste la possibilita&#039; di scegliere di non giocare piu&#039; con persone di un certo paese, in particolare francesi? (oltre al modo di invitare amici in gruppo)\r\nNon e&#039; che ho qualcosa con loro, ma fino adesso, TUTTI quelli con cui ho giocato sono troppo sensibili a questo gioco.\r\nIn una partita premade con 4 francesi in cui tutti se ne stavano per i cazzi loro, nessuno dava nessun avviso quando non vedevano i nemici nella loro lane, il jgl non gankava mai (non solo la mia lane, nemmeno le altre, se ne stava leteralmente nella sua jgl e si muoveva solo per prendersi qualche kill quando uno dei nemici era quasi morto dopo un combattimento con uno dei suoi compagni), l&#039;adc non riusciva a fare un minimo di danno e io come supporto gli ho salvato le chiappe in 4v2 e 3v2 finendo per crepare una mare di volte, dato che quello che riusciva a fare meglio con vayne era scappare e a fine partita tutti si lamentavano che il game era perso per colpa mia. Ho detto va beh sara&#039; che avranno delle giornate no di lol, ma anche l&#039;altro team diceva che non ho giocato male.\r\nIn un&#039;altra partita (sempre con un team di francesi) si sono arresi perche&#039; in UN SOLO fight (al minuto 20 mi pare) non ero con loro e sono morti tutti, noi eravamo in vantaggio di torri 9-5 e i nostri avversari avevano un vantaggio solo di 12 kill. La partita non era ancora persa perche&#039; ero feedato di brutto per colpa del jgl avversario e loro avevano solo 1 feedato. Alla fine della partita in chat, dicono la stessa cosa, solo colpa mia.\r\nOra non e&#039; che ho qualcosa contro di loro, anche a me al minuto 10 mi capita di dire ff al 15 se mi capita di giocare male o di vedere qualcuno che gioca male, ma se poi vedo che ci riprendiamo col gioco di squadra non e&#039; che mi fisso sul ff. Questi sono troppo strani e non mi riferisco solo a questi di cui ho parlato ora, ma di tutti quelli con cui ho giocato.","replies":[{"poster":"badabozzi","date":"2018-09-02T19:38:30.386+0000","up_votes":1,"down_votes":0,"body":"i premade di 4 persone sono sempre tossiche. Ti consiglio appena li identifichi di mutarli completamente al primo accenno di tossicità e giocare per conto tuo. Non star li a farti venire il sangue amaro. E si molti francesi sono ingestibili ma non ha senso far di tutta l'erba un fascio","replies":[]},{"poster":"Pellah","date":"2018-09-02T16:54:13.738+0000","up_votes":1,"down_votes":0,"body":"Dovrebbero creare un orario di gioco:\"Prima della 3 PM i francesi non possono entrare in ranked\"\nBADUM-TSS\n\n\nComunque, credo sia un atteggiamento comune quando ti trovi in un game con 4 premade: giocano tra di loro, ti isolano e ti incolpano di qualcosa.\nPer il resto, togliendo se sia razzista o meno, penso che dipenda da caso a caso, alcuni giocatori si beccheranno più frequentemente i giocatori positivi di una certa etnia mentre altri quelli negativi. Conta poi che tu puoi analizzare solo quelli che tu puoi identificare come francesi (perché ad esempio scrivono in francese in chat), non ci sta una bandierina accanto al nome che ti dice da dove proviene la gente. Magari il 90% dei giocatori francesi con cui hai giocato e che non hai potuto identificare si è comportato in modo molto amichevole oltre che a giocare bene, chissà! ¯\\_(ツ)_/¯","replies":[]}]}