{"poster":"Wingslash","date":"2016-04-07T12:53:52.178+0000","title":"Veigar UPDATE ( Überlegungen,Feedback erwünscht! )","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Wie ihr vielleicht gelesen habt wird Veigar mit gro&szlig;er Wahrscheinlichkeit ver&auml;ndert - Mitte der Saison - ich habe mir ein paar Gedanken gemacht wie er sich vielleicht neu in die Kluft wagen k&ouml;nnte.\r\n\r\nQ - Balefull Strike\r\nPassive: Pro get&ouml;teten 15 get&ouml;tete Vasallen / Monster erh&auml;lt er 1% Abklingzeit Verringerung (trifft bis zu zwei Ziele), das Maximum an Abklingzeit Verringerung die er dadurch bekommen kann sind 20%.\r\n.\r\nActive: Veigar entl&auml;d einen Teil seiner dunklen Energie und f&uuml;gt dem Gegner 60/115/165/210/245 (+70% seiner F&auml;higkeitsst&auml;rke) als magischen Schaden zu.\r\n.\r\nW - Dark Matter \r\nActive: Veigar l&auml;sst eine Art Loch unter einem Gegner erscheinen woraus ein Amethyst nach 0,5 erscheint welcher dem Gegner 80/120/180/270/405 (+20% seiner F&auml;higkeitsst&auml;rke) als magischen Schaden verursacht und ihn f&uuml;r 0,5 Sekunden in einen Knock-up versetzt.\r\n.\r\nE - Event Horizon \r\nPassive: Veigar erh&auml;lt pro verb&uuml;ndeten Champion in der N&auml;he eine Zusatzpassive welche seine F&auml;higkeiten Gegner um 5/10/15/20% verlangsamen.\r\n.\r\nActive: Veigar l&auml;sst eine dunkele Wolke erscheinen welche dem Gegner 30/75/120/165/210 (+100% seiner F&auml;higkeitsst&auml;rke) als magischen Schaden verursacht und den Gegnerischen Champions einen Debuff versetzt die er trifft, dieser Debuff verlangsamt Gegner um 30% f&uuml;r 1/1,2/1,4/1,6/1,8 Sekunden.\r\n.\r\nR - Primordial Burst\r\nActive: Veigar sendet eine unglaubliche Anzahl von konzentrierter negativen Energie aus und l&auml;sst sie auf einen Gegner abprallen welche dem Gegner 300/450/600 (+80% seiner F&auml;higkeitsst&auml;rke) als magischen Schaden zuf&uuml;gt.\r\n.\r\nPassive - Equilibrium\r\nPassive: Veigar erh&auml;lt pro 1% Bonus Abklingzeit Verringerung 3 AP und 10 Mana.\r\n.\r\n.\r\nW&uuml;rde mich sehr freuen wenn ihr euer Feedback dazu abgeben w&uuml;rdet/k&ouml;nntet, bin sehr gespannt auf eure Reaktion hierzu \r\nVielen Dank f&uuml;r Ansehen dieses Posts \r\nMFG Karsten Carried{{champion:45}}","replies":[{"poster":"OT Riku","date":"2016-04-07T20:35:10.926+0000","up_votes":1,"down_votes":0,"body":"Alles klar ich werde vaigar Main wenn er so reworked würde xD","replies":[{"poster":"Wingslash","date":"2016-04-07T20:43:40.264+0000","up_votes":1,"down_votes":0,"body":"Fehlt da nich das Kappa or is das ernst gemeint :D {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"OrangeBubble","date":"2016-04-07T14:59:45.723+0000","up_votes":1,"down_votes":0,"body":"Soweit ich weiß, wird Veigar kein Rework bekommen. \nVeigar ist sowieso einzigartig.\n\n\nAußerdem hat dein Rework NICHTS mehr mit Veigar zu tun und ein Rework sollte aber KERNTEILE eines Champions beibehalten. \n\nUnd sind wa doch mal ehrlich, wer will einen AoE Cage Stun Gedönst gegen ein ollen Slow tauschen? Niemand. \n\nAoE Cage > all, eines der besten Zoning Tools, die es in Lol gibt.","replies":[{"poster":"Wingslash","date":"2016-04-07T16:26:31.048+0000","up_votes":1,"down_votes":0,"body":"Also erstmal danke für dein Statement hier.\nVeigar soll eine Bearbeitung erfahren in der mittleren Season hat Riot auch bestätigt \"Wir sind immernoch am Überlegen, welche Magier das genau treffen wird, aber die wahrscheinlichsten Kandidaten sind: Veigar, Annie, Ziggs, Anivia, Xerath, Syndra, Fiddlesticks und vielleicht noch ein paar andere.\" dass es so kommen wird. Des weiteren mag es sein dass \"mein Veigar?\" nichts mit dem alten zu tun hat, aber sind wir mal ehrlich hat der neue Taric was mit dem alten zu tun. Es soll sich ja nicht die Art des Champions ändern sondern ihn einfach schwieriger und weniger \"OP\" machen. \n\nMit dem Slow versteh ich nicht ganz was du meinst, klar dein Stun geht verloren aber du hast dennoch einen Knock-up und durch Teamfights slowst du jedes Ziel! man kann sich nun mal nicht aussuchen zu was die Fähigkeiten werden^^ \n\nDer Cage hat aber nichts mit Lol zu tun das ist einfach nur Schikane wer will denn gegen einen Champ spielen bei dem man entweder aus einem spell rausflashen muss oder man tot ist so geht der Spaß für beide verloren.\n\nMFG Karsten Carried{{sticker:slayer-jinx-catface}}","replies":[{"poster":"OrangeBubble","date":"2016-04-07T16:42:34.560+0000","up_votes":1,"down_votes":0,"body":"Ja, der neue Taric hat was mit dem alten zu tun.\nSein primäres Skillsetup wurde bebehalten.\nSo hat er immernoch seinen Heal, nur ist der nun AOE und kann mit seinem Seelenpartnerzeugs doppelt angewendet werden.\nEr bekommt passiv immernoch Resistenzen, aber er hat nun auch die Möglichkeit einen Seelenpartner zu definieren (Keine Ahnung wie der Seelenpartner jetzt genau heißt, aber glaub, man weiß, was ich meine)\nEr hat immernoch seinen Stun, der aber nun ein Skillshot ist und vor allem das Ding ist stärker.\n\nEinzig seine Ult wurde komplett geändert. \n\nAlso ja, er hat noch was mit dem alten zu tun, er ist nu jetzt ineraktiver ;)\n\nDer Cage ist eines der Core Fähigkeiten von Veigar. Man spielt ihn eigentlich nur wegen dem und weil seine Ult einfach awsome ist.\nZumal man nun auch schnell aus dem Käfig rausrennen kann, hat ja ein Delay ;) Der Cage ist auch eine Einzigartige Fähigkeit, die es in der Form in LoL kein zweites Mal gibt!\n\nDie 6 großen Reworks werden Vladimir, Brand, Cassiopeia, Zyra, Vel'Koz und Malzahar sein.\n\nDie anderen Magier kriegen auch eine signifikante Änderung an ihren Skills bzw. Grundwerten, werden aber NICHT komplett verändert.\nDaher glaube ich nicht, dass sie Veigar signifikant verändern, da er schon eine einzigartige Position einnimmt ;)\n\nAber wenn du unbedingt willst, dass Riot deinen Vorschlag auch wahrnimmt, gebe ich dir den Tipp, das ganze in englische zu übersetzen und im NA Forum sowie auf Reddit zu posten :) Da bekommt es dann auch von Riot Aufmerksamkeit. \n\nHier noch die Quelle zu den 6 Magier Reworks.\n\nhttp://www.surrenderat20.net/2016/01/red-post-collection-mid-year-mage.html","replies":[{"poster":"Wingslash","date":"2016-04-07T16:58:58.504+0000","up_votes":1,"down_votes":0,"body":"Riot hat das -  für mich zumindest - schlecht beschrieben, sie meinten dass sie diese champion wie bei dir erwähnt ein großes rework erfahren werden aber auch andere champions kleinere aber was sie mit den champions die bei mir genannt wurde vorhaben weiß keiner. Der Cage ist wirklich eine sehr spezielle Fähigkeit sie hat den effekt zu Zonen und wirklich einen sehr guten Stun rauszubringen ABER ich würde mich ebenso freuen wenn Veigar dies nicht mehr hätte um auch den Schwierigkeitsgrad anzuheben. Ebenso würde ich mir sehr wünschen ihn wieder als Support zu sehen was auch einmal sehr im Trend war durch \"meinen Slow und den Knock-Up\" wäre er auch sehr in der Lage diese Rolle wieder ausführen zu können. \n\nZu Reddit oder dem NA Forum, dabei bin ich mir sehr unsicher erstens will ich erstmals wissen wie es bei einer kleineren Gruppe also den Deutschen ankommt und zweitens bin ich mir auch nicht sicher ob dieses Rework wirklich auch übernommen werden kann geschweigedenn ob es überhaut gut ist! aber ich will dir auch noch danken für deinen Beitrag der mir auch sehr hilft verbesserungen vorzunehmen. (hatte auch schon sehr viel Championideen aber sie noch nie wirklich gepostet das hier ist mein Erster :) ) \nLG Karsten Carried","replies":[]}]}]}]},{"poster":"Lohbar","date":"2016-04-07T14:07:32.984+0000","up_votes":1,"down_votes":0,"body":"Naja, der Champion hätte halt mit Veigar nicht mehr viel zu tun. Und in der aktuellen Meta wäre das nen neuer Tank und kein Midlaner/Mage mehr. 405 Basisschaden dürfte fast der höchste Grundschaden einer nicht-ultimativen Fähigkeit im ganzen Spiel sein. Dazu fast keine Skalierungen ( 0,2 und 0,7 sind jetzt nicht herrausragend), dafür aber ein slow auf jeder Fähigkeit und einen Stun. Und dank der Passiven nur 1 CDR Item nötig. \n\nUnd weil ich nicht sicher bin ob ichs richtig verstanden habe: Die 20% slow sind pro Verbündeten? Also 80% slow in nem Teamfight auf jeder Fähigkeit?","replies":[{"poster":"Wingslash","date":"2016-04-07T16:11:29.706+0000","up_votes":1,"down_votes":0,"body":"Ich geb dir recht er hätte durch meine Änderung die Möglichkeit als Tank gespielt zu werden.\nDas mit dem Grundschaden is so gedacht dass er auch im Midgame eine größere Chance zu dominieren sprich den W max. . Was die Skalierung angeht bin ich der Meinung dass er sowieso schon sehr viel Schaden macht durch die Slows und durch die anderen CC´s würde dieser Champ sich ebenso durch eine Schwierigkeit auszeichnen die Veigar - muss ich zugeben - im moment nicht hat wenn wir ehrlich sind ist Veigars E Ability einfach nur etwas dass du benutzen kannst damit der Gegner flasht weil du meist den Aufenthalt darin nicht überlebst, die Q gebe ich zu ist total in Ordnung von Veigar im Moment, aber ich habe mir einfach nur Gedanken gemacht. Riot meinte dass sie mehr mit Cooldowns arbeiten wollen. \n\nZu deiner Frage nein 5% pro Mitstreiter werden gewährt was am Schluss zu 20% wird (nicht viel aber ein netter Bonus ;) ).","replies":[{"poster":"Bergelmir32","date":"2016-04-07T16:24:21.436+0000","up_votes":1,"down_votes":0,"body":"Veigars E ist eines der besten Zoning Tools im ganzen Spiel.","replies":[{"poster":"Wingslash","date":"2016-04-07T16:30:20.974+0000","up_votes":1,"down_votes":0,"body":"Mag sein aber Veigar scheint nicht gerade der Held in der Kluft zu sein der am besten ankommt mit Zoning ( hust* Gangplank hust*) er ist in der lage Flashe´s zu baiten oder jemanden einfach noch zu töten durch den 2 sekunden stun aber es ist einfach erstens seit dem nerv der zu verzögertem erscheinen führt und zweitens der cooldown was diese fähigkeit auch verwundbar macht  wenn du verstehst was ich meine ^^{{item:2050}}","replies":[]}]}]}]},{"poster":"Twace","date":"2016-04-07T13:36:18.577+0000","up_votes":1,"down_votes":0,"body":"Riot will die Magier einzigartiger machen und ich denke Veigar ist dies schon mit seiner Q und Ult.\nAußerdem soll es bei Veigar kein großes Rework sein und seine Fähigkeiten verändern, sondern es soll seine Stärken und Schwächen mehr zum Ausdruck bringen. (z.B dass die W länger braucht bis sie ankommt, dafür hat die Ult dann aber eine bessere Skalierung. Dies würde seine Stärke gegen immobile APCs stärken und er würde eine noch größere Schwäche gegen Assassins haben)\n\nTrotzdem finde ich dass die Fähigkeiten die du dir ausgedacht hast zu einem anderen, neuen Champion passen würden!\nFalls ich auf irgendetwas nicht geachtet hab weist mich bitte daraufhin!\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Wingslash","date":"2016-04-07T16:19:21.634+0000","up_votes":1,"down_votes":0,"body":"Erstmal danke fürs durchlesen.\nVeigar soll kein großes Rework bekommen, naja die Meinung ist gespalten - Riot hatte mal erwähnt wenn sie einen Champion entfernen MÜSSTEN wäre es Veigar - mich würde es sehr ansprechen einen Champion dieser Art zu spielen wir ich ihn hier erwähnt habe.\nDer Skilllevel welcher dann hierfür benötigt wird wäre ebenso höher weil man muss zugeben Veigar ist einfach Point and Klick E drauf WQR und naja gefinished egal ob adc oder tank geschweigedenn APC´s. \n\nDanke dass dir meine Fähigkeiten gefallen die Ich mir ausgedacht habe, wollte auch etwas mit Cooldown Reduction mit rein bringen da Riot die Items mehr auf CDR basierter ändern wollen und dann könnte man ihn als wohl einzigen AP Champ wirklich nur noch mit einem cdr item zocken (Ryze, Cassio lassen wir mal aus da diese zu viel mit anderen Items gebaut werden um Mana und Leben zu stärken, Veigar sollte dann eher auf Oneshot gebaut werden auch wenn er dadurch selber leicht tötbar ist) {{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"MATRIX LORD ZIP","date":"2016-04-07T16:03:35.984+0000","up_votes":1,"down_votes":0,"body":"Ich finde das Rework obwohl es keines geben wird ganz ok für einen neuen Champ.\nAber das er keine Ap mehr stacken könnte würde ihn nicht mehr unique machen.","replies":[]}]}