{"poster":"SeSampa","date":"2015-08-10T18:31:13.210+0000","title":"Hilarious Toxic Player","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Ich habe gerade eine Runde ARAM gespielt und bin auf diesen Spieler getroffen, die Frage die mir als erstes einf&auml;llt ist wieso ein solcher Spieler &uuml;berhaupt noch einen aktiven Account hat oder zumindestens mal noch Zugriff auf den Chat. Wusste nicht das man in LoL Screenshots mit F12 machen kann deshalb hab ich das ganze mitm Handy gemacht sollte aber trotzdem erkennbar sein was er schreibt.\nDas ist im &uuml;brigen der komplette Chat von Anfang bis Ende und in der Lobby als auch im Endscreen hat niemand etwas geschrieben. Habe die Namen unkenntlich gemacht, da es sonst wom&ouml;glich Probleme mit den AGBs geben k&ouml;nnte wegen Namecalling.\n\nHier der Link zum Chat:\nhttp://imgur.com/MhJkUhY","replies":[{"poster":"Kaitri","date":"2015-08-10T20:25:08.019+0000","up_votes":4,"down_votes":0,"body":"sehen wir davon ab das du im all chat zu reports aufgerufen hast, wofür viele leute eine chatsperre kriegen, erkenne ich jetzt nichts witziges hier.\nnur ein fehlverhalten von dir und der elise.\ndie frage ist also warum du und er noch auf den chat zugreifen können","replies":[{"poster":"SeSampa","date":"2015-08-10T21:37:12.107+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Kaitri,realm=EUW,application-id=KYnfKGf0,discussion-id=OmGZvwMd,comment-id=0004,timestamp=2015-08-10T20:25:08.019+0000)\n>\n> sehen wir davon ab das du im all chat zu reports aufgerufen hast, wofür viele leute eine chatsperre kriegen, erkenne ich jetzt nichts witziges hier.\n> nur ein fehlverhalten von dir und der elise.\n> die frage ist also warum du und er noch auf den chat zugreifen können\n\nWieso sollte ich denn eine Chatsperre bekommen es ist doch nicht verboten bei einem falschen Spielerverhalten die andern Spieler zum Report aufzufordern.","replies":[{"poster":"Patter91","date":"2015-08-10T21:38:27.827+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SeSampa,realm=EUW,application-id=KYnfKGf0,discussion-id=OmGZvwMd,comment-id=00040000,timestamp=2015-08-10T21:37:12.107+0000)\n>\n> es ist doch nicht verboten bei einem falschen Spielerverhalten die andern Spieler zum Report aufzufordern.\n\nDoch.","replies":[]},{"poster":"Tokogawaruf","date":"2015-08-10T21:57:49.634+0000","up_votes":3,"down_votes":0,"body":"versuche es immer aus der Sicht der anderen zu sehen. Mich persönlich nerven beide, der Flamer und der Reportschreier. Beides prägt mein Bild dieser Spieler negativ. Praktisch alle stimmen mir in diesem Punkt zu und ich habe das auch nicht als Erster zur Sprache gebracht. Des steht sogar in den Regeln bei negativem Verhalten.\n{{champion:119}} {{summoner:6}}","replies":[]},{"poster":"Kaitri","date":"2015-08-10T22:59:51.805+0000","up_votes":3,"down_votes":1,"body":"doch ist es. \n\"report\" ist das von negativen spielern am meisten genutzte wort. und damit toxic. und der hauptgrund warum leute chatsperren kriegen.\n\naußerdem kommt es auf qualität nicht auf quantität der reports an. bei der elise würde 1 report reichen, alle andern in deinem team könntest du 100 mal reporten, sie haben nichts getan also hat es keinen sinn.","replies":[]}]}]},{"poster":"Fermi Paradox","date":"2015-08-10T19:00:17.107+0000","up_votes":3,"down_votes":0,"body":"http://i.imgur.com/eUAyHjI.png\n\nauch sehr amüsant. Das ganze Game hat keiner was gesagt, nicht mal im /all chat...und dann gings plötzlich los^^","replies":[{"poster":"Tokogawaruf","date":"2015-08-10T22:03:10.311+0000","up_votes":3,"down_votes":0,"body":"Gilluette Rasur? Vayne op Guide confirmed?\nDeine Reaktionen waren hier das wahre Chat Gold, ich schmeiß mich weg eh\n{{champion:119}} {{summoner:6}}","replies":[]}]},{"poster":"Perfect Idea","date":"2015-08-10T22:01:10.429+0000","up_votes":2,"down_votes":0,"body":"Wie kannst du denn einen Chatbann haben wenn du im All-Chat schreiben kannst? :D","replies":[]},{"poster":"WhisperedFire","date":"2015-08-10T18:57:40.728+0000","up_votes":1,"down_votes":0,"body":"Hey,\nsolche Spieler sind leider ein Teil des Games. Das Einzige und Beste was man da machen kann: Reporten.\nIch gehe davon aus, dass dieser Spieler oft toxisch ist. Das heißt, dass er oft reportet werden wird und damit seine gerechte Strafe erhält.\nEin Freund von mir hat auch mal Screens an den Support gesendet. Diese meinten, berechtigt, dass sie da nichts machen, weil es den Reportbutton gibt und es ein System dafür gibt. Reports sind da das Beste ;)\n\nHoffen wir darauf, dass solche Spieler mit der Strafe dazu lernen und sich verbessern.\n\nGruß, WhisperedFire {{summoner:14}}","replies":[]},{"poster":"Hamrio","date":"2015-08-10T18:45:13.001+0000","up_votes":1,"down_votes":0,"body":"Ist echt shcade ,dass es solche spieler gibt die stellen die gute League player in ein schlechtes licht. \np.s: screenshot geht drücke F12 (bei mir freezt das bild dann kurz) und dann musst du einfach den Riot games ordner suchen ,dann den league ordner suchen  und dann auf screenshots klicken\nEdit: hat grad schon jemand gepostet","replies":[]},{"poster":"e621 Rengar","date":"2015-08-10T18:39:47.044+0000","up_votes":1,"down_votes":0,"body":"LoL Screenshot ist F12 welcher dann im Ordner von LoL ist :D\n\nNaja  er wurde wohl nicht zu oft ausfällig damit das System meint  er ist reif für CR / Bann","replies":[{"poster":"SeSampa","date":"2015-08-10T18:43:31.029+0000","up_votes":1,"down_votes":1,"body":"Ah gut zu wissen Danke ;)\n\nJoa wobei man sagen muss jemand der so flamed macht das nicht weil er ein Spiel mal schlechte Laune hat, das sind ja Leute die flamen einfach jedes Spiel.","replies":[]}]}]}