{"poster":"trumbu","date":"2017-10-09T13:05:58.301+0000","title":"travato un sito sospetto che dice di regalare rp come posso segnalarlo?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Questo pomeriggio un mio amico mi ha inviato un link(immagino che gli abbiano rubato l&#039; account) in cui regalavano rp e lo spacciavano per il sito ufficiale di league of legends,il link in questione e&#039; questo (http://gameinfo.euw.leagueoflegends.com/it/game-info/champions/yasuo/ ), cosa devo fare per segnalarlo?\nVi ringrazio in anticipo per le vostre risposte,buona giornata e buone ranked.\n{{sticker:vlad-salute}}","replies":[{"poster":"oO0oMo0Oo","date":"2017-10-09T13:11:17.976+0000","up_votes":2,"down_votes":2,"body":"di sicuro ti censureranno il link e poi non faranno nulla come al solito.\ninutile che posti queste cose, lo avevo fatto pure io in passato.","replies":[{"poster":"Floppyz","date":"2017-10-09T13:43:05.197+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=oO0oMo0Oo,realm=EUW,application-id=MJVj50Jw,discussion-id=0MgTqoop,comment-id=0000,timestamp=2017-10-09T13:11:17.976+0000)\n>\n> di sicuro ti censureranno il link e poi non faranno nulla come al solito.\n> inutile che posti queste cose, lo avevo fatto pure io in passato.\n\nPer forza che censuriamo il link, altrimenti qualche tonno ci casca. Cerchiamo di non sparare sempre a zero tanto per farsi vedere.\n\nPer segnalare il sito invece procedi come indicato qui: https://boards.euw.leagueoflegends.com/it/c/aiuto-e-supporto-it/e2R1m0mR-aiutateci-a-ridurre-i-casi-di-phishing","replies":[{"poster":"oO0oMo0Oo","date":"2017-10-09T18:11:59.003+0000","up_votes":2,"down_votes":1,"body":"qualcuno oggi si è alzato con la luna storta.\nComunque i link ci rimangono anche dopo una segnalazione, non sparo puttanate.\nforse ho esagerato con il \"come al solito\" ma ineffetti non vi ho mai visti a fare qualcosa dopo che uno reportava un link, oltre che cambiare il link in uno di quelli di \"teemo satana\" la vostra maskot se si scrive cosi.\nQuesta volta ho notato comunque che c'è stata più volontà di risolvere il problema in questione. (secondo me causata dal mio commento arrogante, che alla fine è servito per avere una risposta più concreta del solito \"link cambiato\").\nMi trovo leggermente soddisfatto di questo.\nSpero di non essere mai più arrogante, non era mia intenzione.","replies":[{"poster":"Floppyz","date":"2017-10-09T18:25:31.223+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=oO0oMo0Oo,realm=EUW,application-id=MJVj50Jw,discussion-id=0MgTqoop,comment-id=000000000000,timestamp=2017-10-09T18:11:59.003+0000)\n>\n> qualcuno oggi si è alzato con la luna storta.\n\nForse, ma non io. :P In compenso, penso tu possa capire che non fa piacere ricevere critiche basate su fatti che non hanno riscontro nella realtà.\n\n> Comunque i link ci rimangono anche dopo una segnalazione, non sparo puttanate.\n\nPurtroppo non è per niente semplice la procedura per far chiudere un sito web. Pensa a tutti quelli illegali e famosi che distribuiscono film e musica, quanti anni sono che il governo, la SIAE (per non parlare dei corrispettivi enti esteri) le major e via dicendo ci fanno la guerra? Eppure sono ancora lì.\n\n> forse ho esagerato con il &quot;come al solito&quot; ma ineffetti non vi ho mai visti a fare qualcosa dopo che uno reportava un link, oltre che cambiare il link in uno di quelli di &quot;teemo satana&quot; la vostra maskot se si scrive cosi.\n\nSe qualcuno non sa come segnalarli, oltre a censurare il link, indichiamo sempre quel form di segnalazione, non è una novità. Purtroppo noi come emissary non abbiamo a disposizione altri strumenti per intervenire: una volta segnalato, se ne occupa Riot, ed è una procedura di cui noi non abbiamo né controllo né visione.\n\nIo ci ho messo il link di Yasuo perché venero (nostro signore) Teemo (sempre sia pickato). Cosa ne pensi tu?\n\n> Questa volta ho notato comunque che c&#x27;è stata più volontà di risolvere il problema in questione. (secondo me causata dal mio commento arrogante, che alla fine è servito per avere una risposta più concreta del solito &quot;link cambiato&quot;).\n\n> Mi trovo leggermente soddisfatto di questo.\n\nCome dicevo questa è la prassi in questi casi, essere più o meno aggressivi non ci rende più o meno inclini a dare una mano, quando ne siamo in grado. :)\n\n> Spero di non essere mai più arrogante, non era mia intenzione.\n\nOk. Tanto per esser chiari la mia risposta era dettata dal fatto che non è la prima volta che veniamo accusati di non fare una mazza, e dopo un po' è scocciante. :P","replies":[{"poster":"Sexy Win","date":"2017-10-09T18:43:43.334+0000","up_votes":1,"down_votes":0,"body":"Scrivi troppo per cose futili.\nOgni tuo commento dovrebbe essere dotato di un TL;TR.\nNon mi interessa dell'odio di certe persone ma il buonsenso mi direbbe di ignorare chi shitposta.","replies":[{"poster":"oO0oMo0Oo","date":"2017-10-09T20:33:29.374+0000","up_votes":1,"down_votes":0,"body":"ti riferisci a me o a ciack?","replies":[{"poster":"Sexy Win","date":"2017-10-09T23:21:43.392+0000","up_votes":1,"down_votes":1,"body":"Ci sta la gerarchie dei commenti apposta.\n[Questo](https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/0MgTqoop-travato-un-sito-sospetto-che-dice-di-regalare-rp-come-posso-segnalarlo?comment=00000000000000000000) era per ciak.\n[Questo](https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/0MgTqoop-travato-un-sito-sospetto-che-dice-di-regalare-rp-come-posso-segnalarlo?comment=0000000000000001) è per te.","replies":[]}]}]},{"poster":"oO0oMo0Oo","date":"2017-10-09T20:32:41.795+0000","up_votes":1,"down_votes":0,"body":"rip. comunque... ho una domanda da fare.\ncome fai a prendere un argomento nel riquadro del commento di un'altro?\nme lo sono sempre chiesto ma sono nabbo avvolte {{sticker:cass-cry}}","replies":[]}]},{"poster":"Sexy Win","date":"2017-10-09T18:42:22.323+0000","up_votes":1,"down_votes":0,"body":"Sinceramente a me non piace ciak come persona perchè mi bannò a caso dal forum , però in questo caso , restando oggettivo il suo commento è intoccabile. Mentre il tuo è solo polemica","replies":[]}]}]}]}]}