{"poster":"Droogzy","date":"2015-06-04T04:20:26.113+0000","title":"Watched the Video of Faker meets Ekko.","subforum":"Gameplay","up_votes":58,"down_votes":5,"body":"13:36 into the video\n\n\"Really explosive damage, with W or his ult, plus now he has huge survivability which has always been a weak point for assassins.\"\n\n\"So basically, all the advantages of an assassin, without any of the drawbacks of an assassin.\"\n\n(Subtitles translations)\n\nI think for me this sums up my frustration with Ekko and I'm gonna assume for many others as well, this is just an honest question I have, why is an assassin allowed to have such an incredibly high level of survivability?\n\nNevermind the ult cost. Nevermind the massive damage it does. Nevermind the insane AP ratio he has. I can accept that, he is an assassin, assassins are suppose to make quick work of his enemies, I can get behind that no problem.\n\nBut why on top of that is he capable of innate healing with the ultimate (On top of an AoE nuke) and a shield which correct me if I&#039;m wrong, but has the highest AP scaling for a shield in the game now? It just seems you took the frustration of playing against a Zed and LeBlanc with their extended level of safety and twisted it into a new type of champion. \n\nDespite that however, I can say I can get behind healing aspect of the ultimate, he goes back in time and thus reverses some of the damage done to him, thematically, it does make sense...but that in combination with an AoE nuke and no mana cost?  \n\nSo why is it in the midst of discussion about the unhealthy level of safety that Zed and LeBlanc have (granted Zed&#039;s got knocked down a peg effectively and LeBlanc is the next target), you release another champion that essentially exemplifies this problem?\n\nI&#039;m not mad, I&#039;m not raging, I&#039;ve seen both good Ekko&#039;s and bad Ekko&#039;s. I will digress, I&#039;ve yet to play as him, and usually when I do start playing a champion, that&#039;s how I usually start to understand how to play against them.\n\nBut its just an observation I have noticed playing against/for Ekko that he just exemplifies some of the biggest problems as far as player interaction goes...but yet he was released as so anyways. \n\nHonest question, does the champion development team pay attention to the board in their decision making for champion development?\n\nNot trying to be insulting... I&#039;m just trying to get a bearing as to how this champion came about despite all this discussion we&#039;ve seen on the board about safety in relationship to damage output and it seems Ekko is on the rather overbearing side and falls more in line with the likes of LeBlanc and Zed  before his 1 second delay added onto his nerf. I know boards are only considered to be a very high minority of the population of LoL, but nonetheless, the discussion should be taken into consideration. \n\nHell, I was watching an LCS, I can&#039;t remember what interview or what Riot employee interviewer said it, but Ekko came up in the discussion and even the Riot employee hinted rather strongly he thinks Ekko is currently in an over tuned state. \n\n\n\n\nFor me though this led to some thinking about champion design, I'm curious to know how some of the process of champion ability selection takes place with those that have intensive survivability. When I thought about it, I realized that there exists champions which had some level of invincibility/massive healing built into their kit, are further complemented by healing from other sources, specifically Kayle and Tryndmere. \n\nFor me, I'm just curious, is the pairing of invincibility/survivability with healing something that is seen as a healthy mechanic? I guess at first glance to me, if a champion has some form of intensive survivability, whatever it is, trades it off for little healing in other abilities, but this doesn't necessary seem to be the case for some champion. And funny enough Tryndmere and Kayle have also been deemed as being frustrating to play against at time. \n\nI&#039;m heading to bed now, so I won&#039;t be responding until morning, I would appreciate it being civilized in the meantime.","replies":[{"poster":"vC48YNoGbJ","date":"2015-06-04T04:25:47.879+0000","up_votes":20,"down_votes":2,"body":"Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.","replies":[{"poster":"Droogzy","date":"2015-06-04T04:29:02.344+0000","up_votes":12,"down_votes":2,"body":"> [{quoted}](name=Perfect Blue,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0000,timestamp=2015-06-04T04:25:47.879+0000)\n>\n> Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.\n\nI'm fully aware he is despised on the board, which exactly why I'm asking, a lot of the dissenting views about Ekko comes from the fact that he has so much survivability tied in his kit as an assassin. And honestly, looking at his kit and game play style and looking at the discussion on the board, I guess I feel that the feelings for Ekko of intensive hatred should have been immediately obvious.\n\nFor me the question is why was it not evident to champion development.\n\nI actually have PBE access, to this day I have never attempted to utilize it. \n\nWhy? Because I know any feedback I give is just going to be largely ignored. ","replies":[{"poster":"YOU BEEN WARNED","date":"2015-06-04T09:51:00.312+0000","up_votes":12,"down_votes":0,"body":"I have given feedback over four times [ have PBE access ], ignored every single time.","replies":[{"poster":"Orbv","date":"2015-06-05T15:42:40.771+0000","up_votes":2,"down_votes":0,"body":"I gave feedback on 2 bugs with a few ultimates, and then with base dmg changes that were over nerfed. Every change was still made despite having to be reverted in Live. And then the 2 bugs were corrected close to 9 months later........","replies":[]}]},{"poster":"Glamazon","date":"2015-06-05T00:47:19.816+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Droogzy,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00000000,timestamp=2015-06-04T04:29:02.344+0000)\n>\n> I'm fully aware he is despised on the board, which exactly why I'm asking, a lot of the dissenting views about Ekko comes from the fact that he has so much survivability tied in his kit as an assassin. And honestly, looking at his kit and game play style and looking at the discussion on the board, I guess I feel that the feelings for Ekko of intensive hatred should have been immediately obvious.\n> \n> For me the question is why was it not evident to champion development.\n> \n> I actually have PBE access, to this day I have never attempted to utilize it. \n> \n> Why? Because I know any feedback I give is just going to be largely ignored.\n\nPBE isn't for feedback. It's to play the new champ early on stream and gain tons of views duh","replies":[]}]},{"poster":"Sire Hippington","date":"2015-06-04T11:20:30.919+0000","up_votes":8,"down_votes":0,"body":"The problem is that PBE doesn't quallify for very good balance feedback. The playerbase on  PBE is rather small, so matchmakeing sucks, you often can find guys that are bronze on their main in the same match as guys that are platin or even diamond\nAdditionally, it's only a NA server, so PBE players from EU suffer a high ping, and playing an reactive assasin like ecco qith ~0.3sec delay in average doesn't work to well.\ndespite that, many (kinda obvious)problems still get noticed by the PBE-community, but are apparently ignored. Like Essencereaver beeing a bad item at release, or reworked nida beeing to strong.\nNida-rework recived some nerfs after release, Essencreaver was buffed 2 times...","replies":[]},{"poster":"TotalJerk","date":"2015-06-04T06:01:31.413+0000","up_votes":3,"down_votes":0,"body":"Not just the boards, the response I've seen to him in terms of balance is almost universally negative.","replies":[{"poster":"Vistha Kai","date":"2015-06-04T10:50:36.705+0000","up_votes":5,"down_votes":0,"body":"And if it's not negative the person is obviously trolling.\n\nNo, seriously. I haven't see one \"Ekko is balanced\" or \"Ekko needs a buff\" thread that was more than \"hurr durr I'm a potato and you suck\" ones.","replies":[]}]},{"poster":"Meep Man","date":"2015-06-04T13:42:10.090+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Perfect Blue,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0000,timestamp=2015-06-04T04:25:47.879+0000)\n>\n> Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.\n\n1. Feedback is given. Trust me!\n2. Not a lot of champions are released under or overpowered. People just overreact. For example, Bard wasn't 35% win rate weak on release at all. He just was hard to play and therefore people spammed for buffs since they didn't know how to play him. Same goes for Ekko. He might be slightly abive average, sure, but no where near what people describe him as.","replies":[{"poster":"DirkTarTar","date":"2015-06-05T00:02:20.051+0000","up_votes":2,"down_votes":0,"body":"But that doesn't discount the fact that Bard severely needed buffs","replies":[]},{"poster":"3TWarrior","date":"2015-06-07T14:33:00.064+0000","up_votes":1,"down_votes":0,"body":"\"hard to play\" he's easy to play, he just can't do what other supports can.  His style of supporting is in a league of legends all its own.  He has everything a person needs:  a stun, a heal, a movement speed boost, a (sort of) dash, and his ult can freeze towers for the free kill on the weakened carry\n\nhe's definitely not easy to play, but he sure is easy to figure out.  His mechanics could use work though because his targeting is off and often gives a shorter jump through a wall than you want because it uses some sort of perceived destination instead of actual destination.\n\n\nhe's a positioning and early carry support and is the only champ to let other champs move through terrain if they can't, otherwise, he's not meant for late game other than his E and Q stun, though his ult can hit a large amount of the enemy team if everyone lets him do his job and THEN moves in\n\n\n\n\n\ncompare this to ekko...ekko is a champ that the enemy team  literally has to kill BEFORE they can engage your team...what kind of champ composition is that?  \"hey guys, if we dont' find and kill ekko, he'll kill us all!\"  aoe stun as large as nasus E, a high shield, a passthrough long range ability, a long range slow, low hp assassination, etc (post unfinished due to time constraints)","replies":[]}]},{"poster":"Earl Eulrich","date":"2015-06-04T14:29:50.532+0000","up_votes":2,"down_votes":0,"body":"for the most part it´s ignored. PBE is mostly used to find bugs (and to be fair, for europeans playtesting mostly is suboptimal due to high ping - though even with a high ping it had been noticed that the guy was severly overtuned and they are nerfing the wrong things).","replies":[]},{"poster":"Malix Farwin","date":"2015-06-06T22:42:17.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Perfect Blue,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0000,timestamp=2015-06-04T04:25:47.879+0000)\n>\n> Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.\n\nI do believe reading somewhere that Riot doesn't take PBE players feedback so that would probably explain why he is released. At least someone would of said something.","replies":[]},{"poster":"AFK Push","date":"2015-06-05T19:12:28.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Perfect Blue,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0000,timestamp=2015-06-04T04:25:47.879+0000)\n>\n> Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.\n\nBecause not enough testing actually gets done. When a new champ or skin comes out people are more worried about \"trying it out\" rather than actual testing. On top of this, the pbe is usually blind pick so you have a bunch of children fighting over the coveted new champ/skin/rework etc.","replies":[]},{"poster":"Learnding","date":"2015-06-05T18:59:22.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Perfect Blue,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0000,timestamp=2015-06-04T04:25:47.879+0000)\n>\n> Do you even read boards? Ekko is widely despised by those who don't play him and even some who do haha. My biggest question is why champions are released severely under or overpowered. Are PBE players just too nice to give actually useful criticism, or are their criticisms ignored? That's my question.\n\nWhat PBE testers?\nLike who do you think is honestly testing the PBE?  Half of the testers are streamers that only play the PBE when a new champ is out, and the other half are randoms that Riot allowed in, that never even went on the PBE to begin with.","replies":[]}]},{"poster":"Lost In Time","date":"2015-06-04T05:10:36.987+0000","up_votes":4,"down_votes":29,"body":"Ekko's damage is exceptionally sub-par and unreliable for an assassin.\n\nI can build glass cannon and still get out-damage by a two damage item Nocturne. Or any ADC. Or any other assassin.\n\nThis is what he trades for utility. He is, basically, the Ashe of assassins. Yeah, he'll do damage but almost anyone in the same class can do it better.","replies":[{"poster":"Vistha Kai","date":"2015-06-04T10:53:54.545+0000","up_votes":23,"down_votes":0,"body":"That didn't stop you from going 13/3/5 playing aganist that Nocturne.","replies":[]},{"poster":"iTams","date":"2015-06-04T06:41:16.562+0000","up_votes":17,"down_votes":6,"body":"Lmfao","replies":[{"poster":"Lost In Time","date":"2015-06-04T07:00:23.915+0000","up_votes":3,"down_votes":26,"body":"> [{quoted}](name=iTams,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00020000,timestamp=2015-06-04T06:41:16.562+0000)\n>\n> Lmfao\n\nLevel 11 with no claims randomly downvoting shit.\n\nLmfao indeed.","replies":[{"poster":"Ulquiorra995","date":"2015-06-04T16:55:18.234+0000","up_votes":10,"down_votes":0,"body":"\"This guy effectively proven that I'm highly biased in my statement. Better insult him, that will surely make me win an argument.\"","replies":[{"poster":"Lost In Time","date":"2015-06-05T08:52:30.647+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Ulquiorra995,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0002000000000000,timestamp=2015-06-04T16:55:18.234+0000)\n>\n> \"This guy effectively proven that I'm highly biased in my statement. Better insult him, that will surely make me win an argument.\"\n\nlvl 19.","replies":[{"poster":"Izbiz","date":"2015-06-05T13:58:03.006+0000","up_votes":2,"down_votes":0,"body":"\"This guy effectively proven that I'm an ass. Better insult him, that will surely make me win an argument.\"","replies":[]}]}]}]}]},{"poster":"Abyssphere","date":"2015-06-04T15:14:01.439+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Flarefox,realm=OCE,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0002,timestamp=2015-06-04T05:10:36.987+0000)\n>\n> Ekko's damage is exceptionally sub-par and unreliable for an assassin.\n> \n> I can build glass cannon and still get out-damage by a two damage item Nocturne. Or any ADC. Or any other assassin.\n> \n> This is what he trades for utility. He is, basically, the Ashe of assassins. Yeah, he'll do damage but almost anyone in the same class can do it better.\n\nUnreliable perhaps but subpar? Not a chance. His passive, Q and E together have 681 (+ 170% AP) scaling at level 18, before you include the Luden's and Lich Bane proc on E, which adds 184 (+ 65% AP) scaling to just that combo. Your basic abilities do 865 (+ 235% AP) with that build and all that takes is a double Q and E. Then you take into account your W passive which with 450 AP will deal 15% missing health on each auto attack you use on someone with less than 30% of their maximum health, so you can just auto them a few times after your basic burst is done and your damage spikes further.\n\nAnd obviously you have your ult doing 500 (+ 130% AP). Unreliable? Absolutely, but given how massive its AOE is that doesn't balance it imo.\n\nEkko doesn't have low damage, it's just not all as upfront as most assassins and it's more difficult to quantify because a fair bit is tied up in his % missing health autos.","replies":[{"poster":"PKnowledge","date":"2015-06-05T00:26:55.148+0000","up_votes":1,"down_votes":0,"body":"First thing first, I'm not trying to say that Ekko is fine the way he is.\n\nBut 681 (+170% AP) is really not that great for a burst. It's pretting common numbers for magus. Annivia Q+E  is 710 (+200% AP), and CD are nearly the same. Cassio can hit for 700 (+200%) with Q+W+W+W (< 2s burst). Lux is at 770 (+170%) for Q+E+Passive (nearly same CD too). Vel'koz is at 700 (+170%) with Q+E+W without passive. Even Cho goes 600 (+ 200%) with Q+W+AA.\nAnd unlike most of them, you can't use your ult to burst when you want.\n\nSo yeah, he has a great synergy with Luden's and Lich Bane, but for someone made to assassinate, that's not a huge burst unless you're under 30%/you walked into the ghost.\n\nThey obviously need to do something about that ult thought, like adding a mana cost and being sure that enemies can always see were the ghost is. You should only be hit if you're CC'd or stupid enough to get close, not because you lost vision on him for a second.","replies":[{"poster":"Ratbert","date":"2015-06-05T00:33:06.491+0000","up_votes":2,"down_votes":0,"body":"You missed the part where none of them have a dash and blink attacked to their damage or any mobility at all for that matter. It is incredibly odd when mobility is supposedly a trade-off for damage.","replies":[{"poster":"PKnowledge","date":"2015-06-06T12:23:58.445+0000","up_votes":1,"down_votes":0,"body":"I was only talking about damages. And the part about mobility being a trade-off for damage is not something riot seems to care about. I mean, Zed, LB, Akali, Yasuo, Ahri, Katarina, Kalista and Riven have both.\nThey all have an overloaded kit, Ekko included (Not that much for Katarina and Ahri), and they don't need to worry about resources.\nBut if I had to choose, I would rather lane against Ekko than the others. No sustain, no hard poke, and no insta-kill unless you get close to his ghost/stay with no health. Well, I guess he can push and roam, but they all can.\n\nDon't get me wrong : It's still really stupid to keep making champ that have that much in a kit, but of all the overloaded kits, I don't find him that obnoxious to play against (Well, at least I won't once his ult will actually stop doing this much for no cost)","replies":[{"poster":"Ratbert","date":"2015-06-06T13:48:36.238+0000","up_votes":1,"down_votes":0,"body":"Ekko has poke, Q.\nEkko has rather unreliable, but heavy sustain, W.\nEkko's full combo deals so much damage it might as well be an instakill.\n\nBesides, no one on that list has a combination of all three besides zed.","replies":[{"poster":"PKnowledge","date":"2015-06-06T22:25:47.826+0000","up_votes":1,"down_votes":0,"body":"One medium-range spell is not \"hard poke\". Lux, Ziggs and Xerath can poke heavily, not Ekko. \nA one sec shield with a 3 sec delay and 16sec CD is not really what I call sustain. Nothing to compare with Riven, Yasuo or Ahri.\nIf you add Ekko's ult in the combo, then yes, he'll outdamage a lot of them (Well, not LB, Kat or Zed). But you can land your ult only if the enemy is willing to take it since he can see where it'll go.\n\nSure, he can do a lot of things and that's unfair. But the way he does it allow far more counterplay than the others, and you won't loose your lane if you make no mistake. (And by mistake I do not mean getting in range like it's the case for LB, Kat or Akali.)","replies":[{"poster":"Ratbert","date":"2015-06-07T03:02:46.852+0000","up_votes":1,"down_votes":0,"body":"Ekko's q is not a \"medium range\" spell. It has 25 range less than lux e and will deal atrocious damage at level 1 anyways. You compare siege mages to an assassin to say he cannot poke, yet he outpokes the rest of the assassins who apparently have as much poke as dedicated siege mages.\n\nZed LB and Kata have less sustain than ekko by virtue of actually having none, so really ekko's in the middle when it comes to sustain. Besides, ekko has that ult heal anyways.\n\nIf you manage to lose lane by just being in range against akali or kata, and let them full combo you you deserve to lose lane. You will lose lane against ekko if you dare to even be in lane if you see his w or be in the massive range of his ult.","replies":[{"poster":"Lost In Time","date":"2015-06-07T07:22:00.183+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ratbert,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00020002000000000001000000000000,timestamp=2015-06-07T03:02:46.852+0000)\n>\n> Ekko's q is not a \"medium range\" spell. It has 25 range less than lux e and will deal atrocious damage at level 1 anyways. You compare siege mages to an assassin to say he cannot poke, yet he outpokes the rest of the assassins who apparently have as much poke as dedicated siege mages.\n\nExcept it IS a medium range spell.\n\nIt's 700 range at max speed, and travels slower than a Wither-inflicted target for the last 300 units.\n\nLux can fire that thing at 1100 range (from centre) + 150 added range (the radius) at a very fast speed, which is nearly half of Ekko's \"hit-able\" range.\n\nAlso, 100 mana, max rank. If he rushes Luden's over Morello's, he won't be wave-clearing very well. I'd complain about Zed's or Kat's \"free\" waveclear any day before Ekko.","replies":[{"poster":"Ratbert","date":"2015-06-07T18:54:14.544+0000","up_votes":1,"down_votes":0,"body":"1075 is not \"medium range\". You could have a 3k range spell that travels at 100 units a second after 700 range and it would not be \"short range\".\n\nOh yeah, lux e costs 130 mana at max rank, will always cost more than ekko's q, is her only waveclear spell, and deals tickle damage before your third point in it. As a plus, if you pay attention, you can quite reliably dodge it by not standing near your casters.\n\nIf lux doesn't pool like half her laning gold into mana, she runs out in a rotation or two.","replies":[{"poster":"Lost In Time","date":"2015-06-08T07:41:58.856+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ratbert,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=0002000200000000000100000000000000000000,timestamp=2015-06-07T18:54:14.544+0000)\n>\n> 1075 is not \"medium range\". You could have a 3k range spell that travels at 100 units a second after 700 range and it would not be \"short range\".\n> \n> Oh yeah, lux e costs 130 mana at max rank, will always cost more than ekko's q, is her only waveclear spell, and deals tickle damage before your third point in it. As a plus, if you pay attention, you can quite reliably dodge it by not standing near your casters.\n> \n> If lux doesn't pool like half her laning gold into mana, she runs out in a rotation or two.\n\nYou mean {{item:3028}}?\n\nLearn to CS if you think that's \"pooling\" half of her laning power into mana, rofl.","replies":[{"poster":"Ratbert","date":"2015-06-08T20:15:49.849+0000","up_votes":1,"down_votes":0,"body":"Cause chalice means unlimited mana right? After those mana regen nerfs right??? Oh wait. You did not seem to address my first two points either.\n\nBesides, I never said power, but gold. 880 gold is about 35 cs which is around half of what you can get in 10 minutes. If your partner pushes, lux will lose without casting spells. GUESS WHO WILL RUN OUT OF MANA FIRST?\n\nLearn to cs with ekko then. He even has an on hit execute for free on his w.","replies":[{"poster":"Lost In Time","date":"2015-06-09T05:09:44.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ratbert,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=000200020000000000010000000000000000000000000000,timestamp=2015-06-08T20:15:49.849+0000)\n>\n> Cause chalice means unlimited mana right? After those mana regen nerfs right??? Oh wait. You did not seem to address my first two points either.\n> \n> Besides, I never said power, but gold. 880 gold is about 35 cs which is around half of what you can get in 10 minutes. If your partner pushes, lux will lose without casting spells. GUESS WHO WILL RUN OUT OF MANA FIRST?\n> \n> Learn to cs with ekko then. He even has an on hit execute for free on his w.\n\nMana regen nerfs, again, seriously? No one competitively chose the abyssal amount of regen over the MS mastery or defense.\n\nIf you seriously think Chalice doesn't trivialize mana, then I don't think you're playing the same game as I.\n\nAlso, his on-hit execute does jack all for CSing - you still have to CS the same as any other mage under the tower (i.e. caster minions, you hit, tower hit then you CS it)\n\nAnd yes, I know this as a fact.","replies":[{"poster":"Lost In Time","date":"2015-06-10T02:48:41.625+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ratbert,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00020002000000000001000000000000000000000000000000000000,timestamp=2015-06-09T20:19:14.832+0000)\n>\n> As in the nerfs to regen from way back.\n> \n> Chalice doesn't trivialize mana as a manaless ult, or manalessness in general. You still must pour in half your cs gold into it to be on equal footing with those things above. GUESS WHAT EKKO HAS? It's boggling to think that you think ekko has no waveclear because he can't always rush ludens when no other mana mage can. Why can't ekko just \"build chalice\" and \"trivialize\" mana?\n> \n> Most AP mages cannot farm all or even most of the caster minions if they are full health under tower EXCEPT those with additional on hit damaging effects like EKKO! Typically, you are forced to choose one or two to get. If you think on hit executes do jack for csing, you're very very wrong.\n\nFor fucks sake, do you not listen - THE ON HIT EXECUTE WILL NOT HELP YOU CS CASTER MINIONS LIKE IT DOES WITH ZED. I have played many, many games as Ekko, the execute will still not be enough to kill them, you have to do the same thing all other mages do. I don't care what you think, THIS IS HOW IS HAPPENS.\n\nWant to know another fun fact? Almost all mages beyond Anivia/Lux can go double dorans -> Luden's and waveclear without worrying about mana. Go ahead, try it. It's not just an Ekko issue. \n\nBesides, isn't the point of CSing to spend money on items? Why are you making it sound like a bad thing to spend your CS gold into mana, which allows to you harass for longer? \"OMG ADCs have to spend 10 mins farming for a BF sword instead of defense vs tanks!\" <- your logic.","replies":[]},{"poster":"Ratbert","date":"2015-06-09T20:19:14.832+0000","up_votes":1,"down_votes":0,"body":"As in the nerfs to regen from way back.\n\nChalice doesn't trivialize mana as a manaless ult, or manalessness in general. You still must pour in half your cs gold into it to be on equal footing with those things above. GUESS WHAT EKKO HAS? It's boggling to think that you think ekko has no waveclear because he can't always rush ludens when no other mana mage can. Why can't ekko just \"build chalice\" and \"trivialize\" mana?\n\nMost AP mages cannot farm all or even most of the caster minions if they are full health under tower EXCEPT those with additional on hit damaging effects like EKKO! Typically, you are forced to choose one or two to get. If you think on hit executes do jack for csing, you're very very wrong.","replies":[]}]}]}]}]}]},{"poster":"PKnowledge","date":"2015-06-07T13:18:13.859+0000","up_votes":1,"down_votes":0,"body":">Ekko's q is not a \"medium range\" spell. It has 25 range less than lux e and will deal atrocious damage at level 1 anyways. You compare siege mages to an assassin to say he cannot poke, yet he outpokes the rest of the assassins who apparently have as much poke as dedicated siege mages.\n\nIt is a medium range. And the only one he has. That's not hard poke, no matter what you say.\nZed and Katarina outpoke him because it's free. Not that it's hard poke either, but still way more annoying that someone who will spend mana and use his only waveclear.\n\n>Zed LB and Kata have less sustain than ekko by virtue of actually having none, so really ekko's in the middle when it comes to sustain. Besides, ekko has that ult heal anyways.\n\nZed get sustain as soon as he get lifesteal. Sure, Ekko can heal with ult. But I think I already said that his ult is doing too much. \nA shield every 14sec and a heal that need to use ult is not something that will annoy me.\n\n>If you manage to lose lane by just being in range against akali or kata, and let them full combo you you deserve to lose lane. \n\nWell, I was wondering when the \"that's because you're doing something wrong\" would come. I'm not talking about loosing lane, but about getting deleted. With no hard CC, you can't prevent Akali to kill you if she's not behind. Sure, you can win lane if you deny her enough before 6, but that's not the point. It's still annoying to see she's unstoppable unless you hard CC her or keep your distances. \n\n>You will lose lane against ekko if you dare to even be in lane if you see his w or be in the massive range of his ult.\n\nWell then, if you get hit by his ult, you deserve to loose lane. See, I can do it too. I already explained that his burst without ult is not better than other midlaner bursts. As long as you don't get stunned, you can trade him.\n\nOnce again, I don't think he's balanced or that his kit is fine. I think he's fine to play against, and that I would rather have him than Zed/LB/Kat/Riven in lane.","replies":[]}]}]}]}]},{"poster":"Llanite","date":"2015-06-05T04:45:53.913+0000","up_votes":1,"down_votes":0,"body":"His dash only has 120+ 0.2 which is pretty low considering every basic spell does at least 240+0.7","replies":[{"poster":"Abyssphere","date":"2015-06-05T10:33:17.272+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Llanite,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00020002000000000000,timestamp=2015-06-05T04:45:53.913+0000)\n>\n> His dash only has 120+ 0.2 which is pretty low considering every basic spell does at least 240+0.7\n\nIt's that low because it can simultaneously proc Luden's + Lich Bane, and after a double Q it's all you need to proc his passive. His E's damage looks negligible on its own but it's a massive enabler. If you've hit someone with two Qs your E will do 501 (+ 155% AP) (+ 175% AD) (this is calculated from E damage, level 18 passive, standard AA damage, Lich Bane + Luden's procs). The only part of that that's close to negligible is the 175% AD.","replies":[]}]}]},{"poster":"Abyssphere","date":"2015-06-05T10:40:27.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PKnowledge,realm=EUW,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=000200020000,timestamp=2015-06-05T00:26:55.148+0000)\n>\n> First thing first, I'm not trying to say that Ekko is fine the way he is.\n> \n> But 681 (+170% AP) is really not that great for a burst. It's pretting common numbers for magus. Annivia Q+E  is 710 (+200% AP), and CD are nearly the same. Cassio can hit for 700 (+200%) with Q+W+W+W (< 2s burst). Lux is at 770 (+170%) for Q+E+Passive (nearly same CD too). Vel'koz is at 700 (+170%) with Q+E+W without passive. Even Cho goes 600 (+ 200%) with Q+W+AA.\n> And unlike most of them, you can't use your ult to burst when you want.\n> \n> So yeah, he has a great synergy with Luden's and Lich Bane, but for someone made to assassinate, that's not a huge burst unless you're under 30%/you walked into the ghost.\n> \n> They obviously need to do something about that ult thought, like adding a mana cost and being sure that enemies can always see were the ghost is. You should only be hit if you're CC'd or stupid enough to get close, not because you lost vision on him for a second.\n\nYou don't need to explain your position on Ekko, I'm not approaching this debate from the POV of someone who hates Ekko. I just really like comparing numbers like this :) I just don't think you can discount the amount added by his items. While adding in items always muddles things up (Lux and Cass will probably get Luden's procs in themselves, Lux may even get Lich Bane), I think Ekko's synergy is too strong to be ignored.\n\nNormally \"this niche item adds X to a champ's burst\" is something I'd discount because a lot of items like this lead to you having a reduced AP total (e.g. Diana's Nashor's Tooth could have been an item with much higher AP, so it both adds to and takes away from her damage) but Lich Bane is Ekko's mana item and comes with 80 AP, which is identical to Morellonomicon and 20 higher than Grail, so he loses no damage there. And Luden's has the highest amount of AP in the game an item can have so again, he's not losing any \"standard\" damage by getting those extra numbers unless he's sacrificing a Deathcap to get that item (which he shouldn't be). Given how popular Luden's is right now I am happy to discount it because of how it distorts burst in general but Lich Bane I'd consider almost intrinsic to his kit.\n\nI am not sure I'd call his damage obscene or anything (ult aside...), but I think he has quite good numbers honestly.","replies":[{"poster":"PKnowledge","date":"2015-06-06T11:16:41.643+0000","up_votes":1,"down_votes":0,"body":"Yes, that's some good numbers he has, and if they nerf them cautiously it will be great. \n\nAbout Lich Bane and Luden's, I think it's the other way around. It's not that Ekko as too much synergy with those items, it is that a lot of champions lack synergy with the items they have to build.\nI think we need more items, so that synergies can be created. What we have now are items that either work well with nearly anyone because they're so strong  ({{item:3285}}  {{item:3157}} {{item:3078}} {{item:3031}})\nor items that you need to buy even if you have no synergy because there is no alternative ( {{item:3174}} {{item:3135}} {{item:3165}} {{item:3152}} )\n\nI think we need more situational items, not more must-buy ones. Then maybe we could have nice synergy with every champion, not only a few.( I totally hate it when Akali/Fizz can burst you with just one item because they have such a strong synergy, but I have to buy Athen's because need mana :/)","replies":[]}]}]}]}]},{"poster":"Rebonack","date":"2015-06-04T15:04:13.182+0000","up_votes":5,"down_votes":0,"body":"I think it's worth pointing out that OLD Eve was the original Skirmisher.\n\nMuch lower burst/sustained damage than other champions in her class?  Check.\n\nHigh mobility and very slippery?  Check.\n\nHard CC?  Check.\n\nGiant heal on her no-cost Ult?  Check.\n\nTheir play style was pretty similar, too.  Dive in, chunk someone, back off to wait on cooldowns, dive back in, get healed up.\n\nAnd we all remember what happened to OLD Eve, right?","replies":[]},{"poster":"MrBuffington","date":"2015-06-04T15:59:05.484+0000","up_votes":6,"down_votes":1,"body":"I think it's easy to isolate elements of a champions kit and criticize their use in conjunction, without looking at the champion as a whole, and where they fit in the game. Ekko isn't meant to be LeBlanc or Zed, the fact that he does currently have high damage is a result of overtuning, which is very common and generally non-intentional simply because Riots play test groups are much smaller than the entire player base. When Riot says Ekko does well in extended engages, really what they're saying is Ekko (should) not have the burst to one shot people the way Zed or LeBlanc can, and thus is given tools for prolonged engagements.\n\nAs far as pairing of mechanics, it depends on execution and not, again, just listing aspects of a champions kit. Ekko more or less has the same invulnerability that Master Yi does during alpha strike, or that Maokai does during twisted advance, and both those champions have strong healing not tied to an ultimate. Kayle and Tryndamere ult are unfair comparisons because of the duration, moreover their heals are also not tied to an ultimate. You can argue Fiddlesticks and Warwick have a split second of untargetability when they ult, and their healing is some of the strongest in the game. Heck, just listing elements of a champions kit, Bard technically has invulnerability with his ult and has healing.\n\nMy point here is it's easy to spin arguments if you're just listing off ambient qualities of a champion, but you have to look at them as a whole and how they function and interact in a game to actually understand them. I don't think, from a design perspective, the question is whether or not something is unhealthy, it's how those elements can be tuned in a way that makes them healthy or not, and whether that's valuable for the game.\n\nFor the record, I think Ekkos numbers are overtuned, but I don't think there is an inherent issue with what his kit brings to the game.","replies":[]},{"poster":"Old Man Teeto","date":"2015-06-04T11:33:16.689+0000","up_votes":6,"down_votes":1,"body":"Ekko is overtuned.\n\nHe's far more reliable than he looks like on paper, with enough additional power tacked on designed to reward players for proper execution.\n\nSince the actual execution is far easier, that extra power is overkill.  I feel Ekko is similar to Elise where she had extra strengths in her kit that weren't needed and slowly trimmed back.","replies":[]},{"poster":"PerishSoftly","date":"2015-06-04T18:54:53.411+0000","up_votes":1,"down_votes":3,"body":"There are two shields that out-scale Ekko's, neither of which have the CC that his do.\n\n{{champion:64}} has a 200+80% AP shield that shields two targets for a total distributed shield of 400+160% AP. Additionally, it's a gap-close/escape that can target wards and minions.\n\n{{champion:98}} Shields his target for up to 800 + 135% AP and global teleports, but doesn't shield himself.","replies":[{"poster":"Godhri","date":"2015-06-04T20:17:05.608+0000","up_votes":3,"down_votes":0,"body":"Only in the sense of numbers. Neither of those have viable AP builds as opposed to Ekko whose shield can block up to 1000 damage at 600+ AP.","replies":[]}]},{"poster":"Melledoneus","date":"2015-06-04T14:05:45.990+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Droogzy,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=,timestamp=2015-06-04T04:20:26.113+0000)\n>\n> 13:36 into the video\n> \n> \"Really explosive damage, with W or his ult, plus now he has huge survivability which has always been a weak point for assassins.\"\n> \n> \"So basically, all the advantages of an assassin, without any of the drawbacks of an assassin.\"\n> \n> (Subtitles translations)\n> \n> I think for me this sums up my frustration with Ekko and I'm gonna assume for many others as well, this is just an honest question I have, why is an assassin allowed to have such an incredibly high level of survivability?\n> \n> Nevermind the ult cost. Nevermind the massive damage it does. Nevermind the insane AP ratio he has. I can accept that, he is an assassin, assassins are suppose to make quick work of his enemies, I can get behind that no problem.\n> \n> But why on top of that is he capable of innate healing with the ultimate (On top of an AoE nuke) and a shield which correct me if I&#039;m wrong, but has the highest AP scaling for a shield in the game now? It just seems you took the frustration of playing against a Zed and LeBlanc with their extended level of safety and twisted it into a new type of champion. \n> \n> Despite that however, I can say I can get behind healing aspect of the ultimate, he goes back in time and thus reverses some of the damage done to him, thematically, it does make sense...but that in combination with an AoE nuke and no mana cost?  \n> \n> So why is it in the midst of discussion about the unhealthy level of safety that Zed and LeBlanc have (granted Zed&#039;s got knocked down a peg effectively and LeBlanc is the next target), you release another champion that essentially exemplifies this problem?\n> \n> I&#039;m not mad, I&#039;m not raging, I&#039;ve seen both good Ekko&#039;s and bad Ekko&#039;s. I will digress, I&#039;ve yet to play as him, and usually when I do start playing a champion, that&#039;s how I usually start to understand how to play against them.\n> \n> But its just an observation I have noticed playing against/for Ekko that he just exemplifies some of the biggest problems as far as player interaction goes...but yet he was released as so anyways. \n> \n> Honest question, does the champion development team pay attention to the board in their decision making for champion development?\n> \n> Not trying to be insulting... I&#039;m just trying to get a bearing as to how this champion came about despite all this discussion we&#039;ve seen on the board about safety in relationship to damage output and it seems Ekko is on the rather overbearing side and falls more in line with the likes of LeBlanc and Zed  before his 1 second delay added onto his nerf. I know boards are only considered to be a very high minority of the population of LoL, but nonetheless, the discussion should be taken into consideration. \n> \n> Hell, I was watching an LCS, I can&#039;t remember what interview or what Riot employee interviewer said it, but Ekko came up in the discussion and even the Riot employee hinted rather strongly he thinks Ekko is currently in an over tuned state. \n> \n> \n> \n> \n> For me though this led to some thinking about champion design, I'm curious to know how some of the process of champion ability selection takes place with those that have intensive survivability. When I thought about it, I realized that there exists champions which had some level of invincibility/massive healing built into their kit, are further complemented by healing from other sources, specifically Kayle and Tryndmere. \n> \n> For me, I'm just curious, is the pairing of invincibility/survivability with healing something that is seen as a healthy mechanic? I guess at first glance to me, if a champion has some form of intensive survivability, whatever it is, trades it off for little healing in other abilities, but this doesn't necessary seem to be the case for some champion. And funny enough Tryndmere and Kayle have also been deemed as being frustrating to play against at time. \n> \n> I&#039;m heading to bed now, so I won&#039;t be responding until morning, I would appreciate it being civilized in the meantime.\n\nThe nerf to Luden's should hit his burst potential a bit, but I have a question for Riot.\n\nWhy the hell does {{champion:245}} have more base MR stats than every tank in the game? Seriously, check his stats.\n\nAlso, his burst potential is literally what Riot tried to avoid with their \"utility assassin\" gimmick. Sure, let him do damage. But make his rotation a little less damaging, since the CC is high enough as is.","replies":[{"poster":"Sightless66","date":"2015-06-04T14:39:57.048+0000","up_votes":1,"down_votes":0,"body":">Why the hell does have more base MR stats than every tank in the game? Seriously, check his stats.\n\nWhat does that mean? I just looked at his stats, and he doesn't. He's got 32.1 - 52.4. That's the only type of scaling MR there is. There is either that, or 30 flat. Every tank but Singed, Maokai and Shen has that scaling MR (Shen will be getting that scaling MR). How does he have more than tanks?","replies":[{"poster":"Melledoneus","date":"2015-06-05T15:35:21.829+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sightless66,realm=NA,application-id=3ErqAdtq,discussion-id=d9FszN4l,comment-id=00080000,timestamp=2015-06-04T14:39:57.048+0000)\n>\n> What does that mean? I just looked at his stats, and he doesn't. He's got 32.1 - 52.4. That's the only type of scaling MR there is. There is either that, or 30 flat. Every tank but Singed, Maokai and Shen has that scaling MR (Shen will be getting that scaling MR). How does he have more than tanks?\n\nMainly tanks get that kind of scaling MR. It just kind of irks me how Shen gets a lower scaling MR than usual tanks, but Ekko can just have it because he can. Sure, his base HP is low, but his MR should not be that high if he is supposed to be squishy.","replies":[{"poster":"Sightless66","date":"2015-06-05T15:57:30.379+0000","up_votes":2,"down_votes":0,"body":"It's not just mainly tanks though. Almost every melee champion gets scaling MR, while ranged champions don't. Tanks, fighters, bruisers, melee carries; most melees get scaling MR. Even squishy champions like Fiora and Yi have scaling MR. They are squishy, but they are still melee, so they need a bit of defensive help. It's just a few old designs that lack scaling MR (This is because years ago it was necessary for some tanks to not have scaling MR or they would just run over mages. MR itemization was stronger at the time). Yasuo is the only new design that lacks scaling MR, and that was specifically because his shield is an extremely reliable defensive ability.\n\nShen is getting scaling MR next patch. That annoyance will go away soon.","replies":[]}]}]}]}]}