{"poster":"waiting for WoW","date":"2017-07-28T21:59:13.413+0000","title":"Yikes the troll pole is getting buffed.. am I reading this right?","subforum":"Gameplay","up_votes":92,"down_votes":10,"body":"Nerf Mages\r\n\r\nBuff Troll Pole\r\n\r\nMid Lane in 2017","replies":[{"poster":"Shadòw","date":"2017-07-28T22:10:42.412+0000","up_votes":90,"down_votes":2,"body":"\"Fizz fares pretty well against mages when his cooldowns are up, so we’re giving him the tools to engage more often.\"","replies":[{"poster":"press R now","date":"2017-07-29T02:43:44.128+0000","up_votes":51,"down_votes":0,"body":"> [{quoted}](name=Shadòw,realm=EUW,application-id=3ErqAdtq,discussion-id=ZfafJZEJ,comment-id=0001,timestamp=2017-07-28T22:10:42.412+0000)\n>\n> &quot;Fizz fares pretty well against mages when his cooldowns are up, so we’re giving him the tools to engage more often.&quot;\n\nI love how riot is going to pay for that statement for the next 6 patches","replies":[{"poster":"NiceTryVi","date":"2017-07-29T15:02:24.087+0000","up_votes":4,"down_votes":0,"body":"ill be surprised if its only 6. this has the potential to become the new meme for a long time","replies":[]},{"poster":"Knalxz","date":"2017-07-29T12:04:53.544+0000","up_votes":3,"down_votes":0,"body":"It was like someone told the guys who make patch notes to quickly think of some bullshit off the top of their heads to explain why the wanted to buff their main and that's what just burst from the mouths as if their teeth were using dynamite to escape.","replies":[]},{"poster":"MeDicenWera","date":"2017-07-30T06:23:40.126+0000","up_votes":1,"down_votes":0,"body":"6 patches? They should get memes for life for that statement.","replies":[]}]},{"poster":"AirKingNeo","date":"2017-07-29T06:30:14.689+0000","up_votes":5,"down_votes":0,"body":"M E T A\nE\nT\nA","replies":[]},{"poster":"BakedLotion","date":"2017-07-29T15:16:13.253+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Shadòw,realm=EUW,application-id=3ErqAdtq,discussion-id=ZfafJZEJ,comment-id=0001,timestamp=2017-07-28T22:10:42.412+0000)\n>\n> &quot;Fizz fares pretty well against mages when his cooldowns are up, so we’re giving him the tools to engage more often.&quot;\n\n\"Fizz is going to thrive in this new mid lane meta, so we're going to give him the tools to contend with other midlaners\"","replies":[]},{"poster":"YFisfabulousBRUH","date":"2017-07-29T16:45:18.183+0000","up_votes":1,"down_votes":0,"body":"\"Fizz is doing good, so we're gonna make him do BETTER! So you can't do your pesky zhonyas and walk away unharmed!\" RITO WHY","replies":[{"poster":"Glory ln Death","date":"2017-07-29T17:16:16.985+0000","up_votes":1,"down_votes":0,"body":"I mean, have you seen Sion's buffs on the PBE?","replies":[{"poster":"YFisfabulousBRUH","date":"2017-07-30T17:55:25.993+0000","up_votes":1,"down_votes":0,"body":"Im at this point where im deliberating whether to quit league or not since it's become something im not really fond of and i've become a toxic POS in chat.\n\nWhat happened to sion?","replies":[{"poster":"Glory ln Death","date":"2017-07-30T17:58:55.976+0000","up_votes":1,"down_votes":0,"body":"Just, he's doing pretty well in both top lane and support, but he's getting some pretty significant buffs on the PBE. W passive health stacking increased from 2 -> 3 health per small unit (unchanged for large units), and his ult's maximum damage was increased from 300/600/900 to 400/800/1200, with the minimum damage unchanged.","replies":[]}]}]}]}]},{"poster":"Lauchmelder","date":"2017-07-28T22:03:05.004+0000","up_votes":42,"down_votes":1,"body":"\"We liked how skill reliant Fizz' E was when it came to dodging skillshots, so we wanted him to do it more often.\" - Rito 2k17","replies":[]},{"poster":"The Yetii Rider","date":"2017-07-29T03:39:51.159+0000","up_votes":34,"down_votes":1,"body":"\"We've noticed that opponents of Fizz haven't been slitting their wrists nearly as often as they did last season. We feel that a healthy dose of suicide is important for mid lane players, so we'll be buffing Fizz's E cooldown only in the early game to make your lives that much harder.\"","replies":[]},{"poster":"Limrick","date":"2017-07-29T01:55:39.870+0000","up_votes":23,"down_votes":2,"body":"Buff the most toxic ability in the game, hell yeah.","replies":[{"poster":"Cosmic Warper","date":"2017-07-29T19:35:13.595+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Limrick,realm=NA,application-id=3ErqAdtq,discussion-id=ZfafJZEJ,comment-id=0005,timestamp=2017-07-29T01:55:39.870+0000)\n>\n> Buff the most toxic ability in the game, hell yeah.\n\nthere are much worse abilities lol","replies":[{"poster":"sir d wreck","date":"2017-07-30T00:15:58.389+0000","up_votes":1,"down_votes":0,"body":"Like Yasuo's wall?","replies":[]}]}]},{"poster":"An Enemy Sutando","date":"2017-07-29T01:39:03.337+0000","up_votes":23,"down_votes":2,"body":"#LC$BigPlay$Patch","replies":[{"poster":"Cavesloth","date":"2017-07-29T02:27:23.745+0000","up_votes":2,"down_votes":1,"body":"They wanna make that PAAAAAAAAAAAYYYYYYPPAAAAAHHHH.","replies":[]}]},{"poster":"SH Azykan","date":"2017-07-29T03:21:30.254+0000","up_votes":6,"down_votes":4,"body":"{{champion:163}} {{champion:134}} are strong right now, to the point of overbearing in pro games vs most other picks\nthey cant buff AD assassins while they are working on lethality changes (though if they nerfed duskblade and gave zed and talon QoL changes I wouldnt argue that they would be in a good spot) who would normally be able to be used as answers\nFizz is the next syndra counter to keep her in check, but even he is struggling vs her (and other mids) when he should be able to force something on her.\nif they nerf syndra because of pro play she becomes a meme in solo queue, so bringing some of her counters back into the meta is probably the direction that they feel is overall better for gameplay.","replies":[{"poster":"LightIsMyPath","date":"2017-07-29T04:35:18.334+0000","up_votes":9,"down_votes":0,"body":"But they nerfed syndra too...","replies":[{"poster":"MrryZ","date":"2017-07-29T13:55:15.482+0000","up_votes":4,"down_votes":0,"body":"Nerfed taliyah too didnt they?","replies":[]}]},{"poster":"Sraeg2013","date":"2017-07-29T12:26:48.351+0000","up_votes":2,"down_votes":1,"body":"Syndra isn't strong \"right now\".\nWhen she becomes meta it means that picks that usually crowd her out are weak and/or underplayed.\n\nIt's a testament of fucky balance, if anything.\n\nBuffing Fizz isn't going to do shit, **because Syndra is already his best matchup**\n_(we are talking about a difference of winrate at +5.6% in Gold+ and +4% in Plat+)_\nand Taliyah is second\n_(Technically 3rd and 4th respectively, but let's face it. Who the fuck cares about Ryze and Azir?)_","replies":[]},{"poster":"GayFluffyUnicorn","date":"2017-07-29T20:19:29.384+0000","up_votes":1,"down_votes":0,"body":"Fizz isn't a champ i want to have back in the meta in my soloQ games. \nSeems like i have to completely stop playing league now in the next few months seeing how they want to buff fuckin yasuos windwall, bring fizz and ekko back. \nADCs are still overpowered as fuck together with support itemization. \nNoone seems to care about lethality on riven, kha and a few others. \nLike idk what to play anymore.","replies":[]}]},{"poster":"JustMonika13","date":"2017-07-29T01:47:04.125+0000","up_votes":8,"down_votes":1,"body":"... Why?","replies":[{"poster":"MrryZ","date":"2017-07-29T13:54:48.259+0000","up_votes":5,"down_votes":1,"body":"New skin","replies":[]}]},{"poster":"Elikain","date":"2017-07-29T19:36:05.895+0000","up_votes":6,"down_votes":0,"body":"I don't believe Fizz needs a buff specifically to troll pole.\nThat skill itself (when up frequently) allows him to do a lot of untargetable shenanigans and actually chunk people from just basic skills. Not to mention that troll pole is the freaking skill with a lot of base damage and AP ratio itself so Fizz is getting rewarded with 4 things when he levels that skill first:\n\n- Frequent engages\n- no loss in damage\n- AoE clear\n- untargetable shit that squishies can't deal with\n\nYou just can't harass this fucker if every time you want to do something, he just says \"fuck your damage\" and renamon's your face with 2 skills. So you're either dead or can't fight him anymore.\n\nIf he's getting his mobility buffed, at least the same damage on that mobility should be nerfed to compensate. We really don't need an untargetable AP assassin never getting a single scratch on him and with everyone being afraid to engage him unless a full team is present.","replies":[{"poster":"Chess1","date":"2017-07-29T19:47:17.563+0000","up_votes":1,"down_votes":0,"body":"its  10 at max rank again though? and i doubt u get more than 10% cdr before than.","replies":[{"poster":"Elikain","date":"2017-07-29T21:05:32.951+0000","up_votes":1,"down_votes":0,"body":"Sorry, what are Fizz's changes again?\nCan't seem to find them. Are they on PBE now?","replies":[{"poster":"Chess1","date":"2017-07-29T23:07:31.184+0000","up_votes":1,"down_votes":0,"body":"18/16/14/12/10 ------> 16/14.5/13.5/11.5./10 i think","replies":[{"poster":"Elikain","date":"2017-07-30T15:14:10.552+0000","up_votes":1,"down_votes":0,"body":"Well, i made a one mistake i vowed i wouldn't make and that is to preemptively talk about a balance change before i actually read what it was. _**In the end, this really isn't a big deal.**_ Only his early game was slightly buffed to foster a tiny bit more frequent engages or riskier plays (knowing you'd have a dodge skill a bit sooner) while his late game is unaffected.\n\nYea i, like everyone else, has a problem with Fizz in general but in terms of how lightly they've buffed him, i don't think he'd be the FOTM pick just because of this change. And i don't believe he should be dumpstered just because i don't like playing against him. Play against him long enough and you'd get around his play style and manage to figure out a counter strategy that would keep him at bay.","replies":[]}]}]}]}]},{"poster":"PaffWasTaken","date":"2017-07-29T21:58:28.946+0000","up_votes":4,"down_votes":0,"body":"EA Entertainment: Hey Riot, I heard that you like to disappoint and ignore your community, could you teach me how to do it effectively like you?\nRiot: Just Watch and learn fam","replies":[{"poster":"Elikain","date":"2017-07-30T15:17:04.017+0000","up_votes":1,"down_votes":0,"body":"That depends on how you look at this.\nIf you believe Riot should only listen to us when it comes to nerfing the picks you (or someone else) find frustrating, then no. They should not listen to us whine and make changes based on these \"facts\". Whining about something is not a fact but it may be an indicator that something isn't right.\n\nWhat you do in that case is investigate the cause of the whining, not rush in with the nerf hammer and start bashing skulls in to appease to the community of people who know nothing about game balance, all for the sake of making them happy by ruining the game in the process.","replies":[{"poster":"PaffWasTaken","date":"2017-07-31T00:28:45.582+0000","up_votes":1,"down_votes":0,"body":"I actually don't really care if Riot dosen't do what the community wants, just as long as they do good things. But lately they both IGNORE the community and makes random changes to the game hoping it'll get better, while it does quite the opposite. Yes, a completely community-driven League Of Legends would be bad, but atleast it would be better than a team of workers who looks like they are still playing in Season 5 while just pointing at random champs and say \"that champ needs that change, because (insert weird reason to hide that there's no reason at all here)\"","replies":[{"poster":"Elikain","date":"2017-07-31T00:42:46.738+0000","up_votes":1,"down_votes":0,"body":"What are the examples of \"ignored\" community suggestions and buffing/nerfing random things? Because i can tell you that Meddler doesn't walk into a meeting about game balance and shouts \"buff Annie\" while taking a sip of his martini and expects things to get done because he said so.\n\nThere's definitely proper procedure to follow and even discuss things but Riot still does make balance changes and decisions based on their own data about the game. They also take our opinions into consideration but they don't have to act on them if that isn't the right direction.","replies":[{"poster":"PaffWasTaken","date":"2017-07-31T01:29:12.653+0000","up_votes":1,"down_votes":0,"body":"http://i.memeful.com/media/post/Wwl87wE_700w_0.jpg\n\n*clears throat*\n\n{{champion:268}}  getting nerfed to hell by riot almost 5 patches in a row while the community was screaming \"stop, it's already dead!\"\n{{champion:90}} {{champion:82}} {{champion:154}} {{champion:113}} {{champion:7}}  and many more who got reworked and then the community who mained them literally and clearly said to riot \"we don't like those changes, please revert them\", which Riot replied with \"Lol how about we change them even more each patch until you like them?\"\n{{champion:34}} who got changes a while ago to make her more \"controlmage type\". Don't know much about this one but I saw some angry mains commenting on this patch and the boards to scream their fury against Riot\n\nAP {{champion:96}} who got \"killed\" some months ago\n\nThe good ol'Turrets, who caused thousands of threads like \"wtf are you waiting for to buff turrets riot\" to appear on the boards, which caused Riot to literally say \"meh, we like them like this ¯\\_ツ_/¯\"\n\n{{champion:31}}  who got changed quite massively in the past patches while noboddy asked to, but hell, it sounded funny to riot so why not?\n\nThe whole Assassin rework, which was rated as a pure failure by the community, just got worse and worse each patch (riot litteraly said that this patch was meant to make assassins more \"counterable\" by giving their combos larger Windows to be countered and to make them generally less \"spam all your keys at the same time and it works\", but instead they gave more burst and speed to assassin's...logic?)\n\n{{champion:203}} , who is some of the champs with the biggest potential to be a great character to player, while not being one at all at the moment. I don't remember Riot ever mentioning them outisde of their \"buff and nerf\" routine on them, but hell, I do see people complaining about their awfully wasted potential\n\nRotating game modes, which makes every community members say \"that was supposed to give diversity to featured gamemodes, so why the hell Riot are you making them more and more repetitive?\"\n\nThe {{champion:83}} very{{champion:266}} numerous{{champion:50}} number{{champion:6}} of{{champion:427}} champions{{champion:136}} who{{champion:164}} should've{{champion:163}} get a{{champion:3}} new{{champion:39}} skin{{champion:24}} already\n\nNormally I would've mention Urf too, but it seems we'll have ARURF soon, but I doubt we'll ever see it again after this soooo....\n\n{{item:3147}} {{item:3814}} {{item:3142}} lethality, which is already too damn strong and that already causes many tears among the community, but that keeps getting stronger and stronger\n\n{{champion:13}} getting reworked (he already got reworked and was already somewhat healthy, people were asking for Warwick and Urgot's rework but no, cupidity from Riot to say \"no, we are working on ryze for no reasons at all. hahah\")\n\n{{champion:72}}  isn't really mentionned these days, but that's the reason why I'm talking about him: he is dead. The community just forgot about him, and that's whats gonna happen to every champs who got reworked by riot in class updates and got therefore destroyedL they'll either be forgotten like skarner, or broken enought to need either a huuuuuge nerf (then getting ignored) or needing a whole new rework\n\n{{champion:266}} ... no need to explain\n\nI could mention a lot of other things that Riot did wrong. I could also mention how the community reacted very badly to all of those. But that's more than enought to realise that Riot listen to it's community when it wants to: if what the community tells isn't approved by them, they'll just ignore it","replies":[{"poster":"Elikain","date":"2017-07-31T02:14:39.085+0000","up_votes":1,"down_votes":0,"body":"You are working with so much outdated information that it would take me an entire thread to explain to you. Unfortunately, i don't have the time nor patience to do it so i'll be brief with every \"problem child\" you mentioned:\n----\n{{champion:268}} is on Riot's radar for a potential update soon as his kit is not easy to balance. He has so many outlets that no matter where Riot hits him, he still stands up and wrecks everyone's shit in pro play and then the same thing happens in every other ELO. His kit doesn't have any balance levers where Riot can turn them to make him viable.\n\n{{champion:82}} i'm not even going to acknowledge this complaint nor the {{champion:72}} one. They were first among the class updates which weren't successes at all. But they weren't worse either. So there's no point in reverting things. From this failure, Riot learned and expanded their teams for updates and reworks, which lead to more healthier designs. As of a few weeks ago, Riot has announced that they won't be doing more class updates but rather potential updates to specific champions they find a good direction for.\n\n{{champion:90}} {{champion:154}} {{champion:113}} are better then they were. The complaints coming from their supposed \"mains\" is because they got changed. Not because there's anything wrong with them. The whole point about the crocodile tears they're shedding is that they want to complain how their kits are bland and uninteresting and then when their changes happen, now it's a problem that 1% of their kit is no longer the same and hurr durr they have to adapt. Pointless and useless complaints. Malzahar was a legit one and Riot made him a mid laner again. That was the one thing the community asked for and they've got that exact thing. No longer a forced support.\n\n{{champion:7}} as far as i recall, i think Riot has said some minor work on her is going to be done.\nNot sure when.\n\nNobody played AP {{champion:96}} and i see no point in making an argument that his \"alternative\" build has been weakened. His AD is and has been far superior to this and i've seen my brother play AP Kog without any problems. His combo is still spit + ult spam. Now he's also a legitimate bot laner. Before he wasn't even that.\n\n{{champion:34}} is fine. I've played her, my brother played her and since i'm not her hardcore main, my feelings are less biased. I saw no major changes to her playstyle and she has still retained her control mage ability, even to a higher degree after her changes.\n\n>Rotating game modes\n\nRiot already explained it. Some modes aren't ready for the new client, some are. You ask for something that hasn't been ported to the new client yet and nobody apparently listens to Riot when they respond. That's typical for an average boards lurker.\n\nDon't really care about how many tears Lethality has caused among the community. It's working as intended, for the class that was intended for (AD casters). Ranged AD casters (Jhin and MF) can pick it up too and i see no issue with that whatsoever. Ranged classes have weaker interactions with Duskblade specifically.\n\n{{champion:13}} complaint is dumb. He has been reworked and so were {{champion:19}} and{{champion:6}}.\nThe only difference was \"when\". And i don't care when this is as long as the reworks are fine. Both Urgot and WW seemed to have hit the ideals the majority of us wanted so i don't acknowledge this complaint as valid at all. Ryze's previous iteration wasn't healthy as the whole idea of a tank mage was to stock up on HP and MP, not build armor.\n\n{{champion:266}} update has been announced already and now he is in a way better spot than he has ever been to. The fact that you haven't mentioned this just leads me to believe you're just talking the complaints into question, not their actual resolutions. You could mention other things that Riot did wrong but you could also mention things Riot did right. Unfortunately, you mentioned none of those so i did it for you.\n----\nIf you're here to tell me that there complaints at all, well no shit. There are always going to be complaints about everything as Riot can't please every player individually with their changes. And when they sit on their ass and do nothing, that still bothers people. So no matter what direction they go with, there are always going to be people unhappy with Riot's decision.","replies":[]}]}]}]}]}]},{"poster":"Ultrios","date":"2017-07-29T12:11:50.631+0000","up_votes":2,"down_votes":8,"body":"I don't think Fizz is doing well right now TBH.\n\nI am a fizz main currently. I probably just suck so take what I think with a grain of salt.\n\nRight now his damage burst is incredibly delayed. You have to hit ult, you have to wait for your ult to pop, and then you have to wait for you W to stack for a few seconds to even do damage there barring latching your ult. The fact that your ult takes SO long to pop means with all the shields in the game, a good support will negate a ton of it.\n\nYour W is pretty meh even at full stack usage until late game due to the \"tank fizz\" nerfs earlier in the year.\n\nCurrently Fizz in lane is horrible. I hate myself for playing him but I love him. You can't trade with anyone meta currently and win. Ori will beat you EVERY SINGLE TIME no matter what in lane. You can't even all in her with ult because she's tanky Ori and will have barrier. Aside from that, she can poke your ass out of lane nonstop pre-6. and you cant burst her down post 6, maybe you can back her. Basically you auto lose lane. You'll be at your turret and probably cant even engage in a gank because you're so poked down.\n\nVladimir pokes your ass into oblivion and you can't all-in a good one. Sitting at turret dying or getting backed and waiting for a gank.\n\nEkko getting buffs and Ekko auto wins lane. He can even turret dive you pretty early. All you can do is juke and farm your best.\n\nSyndra will kill you, do the same thing in lane.\n\nTalon and zed do the same thing.\n\nSo as Fizz you have to try to just survive laning phase to get to end game currently. That means you wont be fed. And you have to get into melee range. And that means you NEED to use your E offensively to try to secure any kill, which means you're taking super high risks and burning your escape and still may not secure a kill with your full burst combo.\n\nSure a fed Fizz is scary. But any half decent player can currently keep Fizz from getting fed. AP Fizz wasn't the problem, it was tank fizz. they nerfed both.","replies":[{"poster":"Sraeg2013","date":"2017-07-29T12:33:31.774+0000","up_votes":6,"down_votes":1,"body":"If Syndra can kill you as Fizz, then I'm sorry, but you need to improve.\n\nHonestly, Fizz can kill Syndra at level 3 and it only gets worse for her.\nMaybe, just maybe she can kill you in return at 6, but that's about it.","replies":[{"poster":"OHminus","date":"2017-07-29T12:41:45.111+0000","up_votes":5,"down_votes":1,"body":"No she can't\n\nAny good Fizz player will E her ultimate/stun, and Syndra isn't mobile enough to avoid Fizz's damage that comes thereafter.\n\nFizz is in a very good spot atm because all his winning matchups are \"meta\" (Syndra, Taliyah, Ahri, etc)","replies":[{"poster":"Ultrios","date":"2017-07-29T14:00:17.551+0000","up_votes":2,"down_votes":4,"body":"So she can poke the crap out of you early lane and bully/abuse you like mad. Post 6, she should have the advantage unless the jungle comes to help you. She can flash your ult if shes good enough. She can all in you at that point. You can choose to either E her stun OR her ultimate. You don't get to E both. You are left having to E her stun which means timing and guessing right with a good reaction time and that isn't always possible. If you don't E her stun, she's going to ult you anyways.\n\nIf you E her stun from a long ways off, you don't get your E damage and slow. Unless you land her ultimate.\n\nSo you have to E her stun and hope to all in her. She's going to get that ult damage off unless she misses her stun somehow, which doesn't happen often.\n\nNow lets talk late game fighting. Sure, you can blow her up. Any decent Syndra has an early zhonya though. So you ult her or engage, she zhonyas. Her team peels her, you lose.\n\nYeah...\n\nTell me at what point does Fizz win this matchup outside of low ELO?","replies":[{"poster":"Sraeg2013","date":"2017-07-29T15:10:40.631+0000","up_votes":3,"down_votes":0,"body":">So she can poke the crap out of you early lane and bully/abuse you like mad. \n\nShe can poke the crap out of Fizz... if he just sits there and takes it.\n\n>She can flash your ult if shes good enough. \n\nFlash has a 300 seconds cooldown.\nFizz's ult begins at 100.\nNot to mention Fizz can dive Syndra at any point where she has less than ~80% HP.\n\n>You are left having to E her stun which means timing and guessing right with a good reaction time and that isn't always possible. \n\nAre you telling me that using the trollpole is hard? Oh my god.\n\n>Any decent Syndra has an early zhonya though.\n\nZhonya is a crappy situational item.\nSyndra will always rush Morellonomicon and Sorcs meaning the earliest she can buy and use Zhonya is around 20 minute mark ASSUMING she wasn't completely shat on in the lane.\n\n>If you don't E her stun, she's going to ult you anyways.\n\nUnless you aren't in melee range, she spends half the duration of the stun getting into the range of the ult.\nAdd ~0.25s cast time and you will easily be able to dodge most of it.\n\n>Tell me at what point does Fizz win this matchup outside of low ELO?\n\nIn EVERY ELO, son.\nFizz vs Syndra matchup has an average winrate difference of 5% in favour of Fizz.\nIn Diamond+ it's 4.5%.\nPlatinum is the only ELO where it falls below 4% and is currently at 3.9%.","replies":[{"poster":"OHminus","date":"2017-07-29T20:59:30.766+0000","up_votes":2,"down_votes":0,"body":"THIS\n\nexactly this. \n\nPeople telling me Fizz doesn't counter Syndra because he's melee and she's ranged. What, you're telling me Pantheon doesn't beat Gnar/Kennen? Lul.","replies":[]}]}]},{"poster":"GayFluffyUnicorn","date":"2017-07-29T20:20:44.454+0000","up_votes":1,"down_votes":1,"body":"Syndra not mobile? \nConsidering she has NO cast animations and can freely move during every single spell i'd say she is pretty fuckin mobile.","replies":[{"poster":"OHminus","date":"2017-07-29T20:58:13.722+0000","up_votes":2,"down_votes":0,"body":"Yea mate let's see a Syndra running away from a Fizz. Or a Kassadin. Or an Ahri. \n\nThe best she can do is try to burst them down. But Fizz E completely negates any burst, so Fizz wins the matchup. It's that simple.\n\nAnd before anyone tells me Fizz loses pre 6 because Syndra can poke him down - Fizz can all in at level 3 by Qing Syndra (or a nearby minion) autoing, pressing E to dodge anything the Syndra throws at him, and then proccing the W proc. If she's low enough, he can ignite. If not, he can back away, knowing he won the trade. \n\nFizz will surely be down cs between evenly skilled players, but the thing is Fizz doesn't need the items for the level 6 all in. He hits his shark on Syndra? Game over.","replies":[]},{"poster":"Sraeg2013","date":"2017-07-30T00:45:23.392+0000","up_votes":1,"down_votes":0,"body":"Not having cast animation on 2 out of 4 spells isn't going to help when your enemy has TWO dashes, has higher movements speed and ignores unit collisions.","replies":[]}]},{"poster":"Dani El Pezglobo","date":"2017-07-29T13:18:32.124+0000","up_votes":2,"down_votes":0,"body":"as a main ahri i must say fizz is pretty ez match up once u got lv 6 i mean , hard u kill each other , but ahri are better roaming and better on tf. so no point on pick fizz vs her , since she can go back with her ult","replies":[]},{"poster":"Elikain","date":"2017-07-30T15:18:44.560+0000","up_votes":1,"down_votes":0,"body":"Fizz's troll pole isn't a Zhonya's effect.\nHe cannot avoid the damage from Syndra's ult if it's already locked on to him. Just like he can't avoid Ignite burning him to a crisp while he's up there, pondering on his choices in life.","replies":[]}]}]}]},{"poster":"AirKingNeo","date":"2017-07-29T06:30:48.224+0000","up_votes":6,"down_votes":2,"body":"It's just 2 seconds early ranks. It is pretty good buff for the kinda weak midlane fish.","replies":[]},{"poster":"xelaker","date":"2017-07-29T17:22:30.107+0000","up_votes":3,"down_votes":0,"body":"Gotta sell that new skin, come now Riot is a business.","replies":[]},{"poster":"Synnx7","date":"2017-07-29T09:37:39.438+0000","up_votes":5,"down_votes":2,"body":"#Favoritism\nAnd fuck no, i wont watch that boring ass LC$ farm ville for 30minutes , passive playing","replies":[]}]}