{"poster":"SPINACIOCOTTO","date":"2015-05-17T16:04:14.856+0000","title":"cerco persona che mi insegni a junglare come si deve","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"come letto dal titolo cerco un insegnate che mi insegni a junglare come si deve... \r\nse potete scrivete qua sotto quando potete \r\ngrazie in anticipo","replies":[{"poster":"JollyJack360","date":"2015-05-18T17:04:49.499+0000","up_votes":1,"down_votes":0,"body":"Posso consigliarti un youtubers itaiano, si chiama supercaster92 non puoi sbagliare, su facebbok risponde sempre","replies":[]},{"poster":"PolloPowa","date":"2015-05-18T08:18:27.108+0000","up_votes":1,"down_votes":0,"body":"Vai ww o nunu jungler sono forti in jungle pee chi è alle prime armi\n\nXin anche lui è forte buono per gli inizi.","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-18T12:32:12.899+0000","up_votes":1,"down_votes":0,"body":"grazie mille li provero sicuramente ma preferisco i jungler assassini","replies":[]}]},{"poster":"ILoveTiramisu","date":"2015-05-17T16:32:49.576+0000","up_votes":1,"down_votes":1,"body":"Imparare a junglare? Io di solito per pickare un campione in un ruolo metto insieme tutte le informazioni che conosco e poi seleziono i campioni che corrispondono di piu ad essa.\nUn jungler per carriare deve essere forte nei gank, prendere obbiettivi, junglare decentemente, e wardare la mappa durante la laning phase.\nDetto questo, se io dovessi giocare un jungler, la cosa che voglio di piu è gankare botlane per poi prendere il drago. Essendo in meta l oggetto da tank jungler, il campione che preferisco di piu è nautilus. Appena la meta tank scompare, ritorno a giocare Vi, molto di piu.\n\nQuindi, prima ganko top o mid, la lane messa meglio, dove ce piu possibilità di kill per CC, danno o nemico squishy etc. (Al primo recall, piazzo una pink nella jungla per proteggere la bot e un po la mid). Appena stanno per respaonare i buff, al settimo minuto circa è il momento di fare 1-2 buff e camperare bot per il drago. Non fai nulla, allora gli piazzi una ward per evitare il jungler nemico lo faccia(Meglio prevenire che curare).\n\nMai gankare lane che stanno perdendo di molto.\nMentre fai i buff, controlla molto la mappa, e se individui il jungler nemico pinga il pericolo nella lane.","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-17T16:47:54.981+0000","up_votes":1,"down_votes":1,"body":"grazie mille per i consigli... shaco secondo te regge il meta?","replies":[{"poster":"ILoveTiramisu","date":"2015-05-17T19:14:51.252+0000","up_votes":1,"down_votes":0,"body":"Shaco? Io personalmente non lo gioco, ma vedo dei shaco carriare partite in un modo allucinante ed è molto rischioso se la partita va per le lunghe. Non è in meta, ma alcuni campioni carriano fino a platino, qualche volta anche oltre. Evitalo in 5v5 team ranked comunque.\n\nUn campione che assomigli molto a  shaco come stile di assassinio è Rengar. Leggendo che sei ancora al 18, consiglio fortemente Amumu.","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-17T19:59:21.485+0000","up_votes":1,"down_votes":0,"body":"sion come lo vedi?","replies":[{"poster":"ILoveTiramisu","date":"2015-05-18T06:43:32.205+0000","up_votes":1,"down_votes":0,"body":"Sion non lo mai provato e lo vedo poco, non ho un vero giudizio.\nIo gioco solo naut e vi, ma se vuoi un parere questi sono considerati i migliori jungler: https://www.youtube.com/watch?v=jx8q4V8bWKw","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-18T12:31:28.347+0000","up_votes":1,"down_votes":0,"body":"grazie mille","replies":[]}]}]}]},{"poster":"ViaMalinconiaN9","date":"2015-05-17T17:02:07.257+0000","up_votes":1,"down_votes":2,"body":"Shaco pulisce molto velocemente la giungla, è h dei nice gank, ma non da nessun'aiuto nei tf, cmq credo che non sia in meta, infatti la meta in jg sono i JunglerTank","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-17T17:04:32.377+0000","up_votes":1,"down_votes":1,"body":"al momento sono liv 18 e molti throwano","replies":[]}]}]}]},{"poster":"BioS iP","date":"2015-05-17T16:26:14.915+0000","up_votes":1,"down_votes":1,"body":"ti serve per solo Q o per team ranked?\nnel primo caso posso darti solo un paio di dritte; nel secondo caso posso spiegarti qualcosa in più.\n\nIn ogni caso, guarda questo canale di youtube\nhttps://www.youtube.com/channel/UCNCLrmQg3cHNPRAf7m3qrBg\n\nE' ottimo per i jungler alle prime armi o per chi vuole vedere come approcciarsi per la prima volta ad un champ","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-17T20:00:04.918+0000","up_votes":1,"down_votes":0,"body":"grazie mille","replies":[]}]},{"poster":"Heavenly Yasha","date":"2015-05-17T19:35:08.073+0000","up_votes":1,"down_votes":0,"body":"Se ti serve una mano aggiungimi in game. Provo a darti un po' di consigli","replies":[{"poster":"SPINACIOCOTTO","date":"2015-05-17T19:59:44.258+0000","up_votes":1,"down_votes":0,"body":"ok grazie poi vedremo di organizzarci quando siamo online","replies":[]}]}]}