{"poster":"SuperJediNinja","date":"2015-09-09T02:13:39.089+0000","title":"The new skins don't have the 975 temporary discount.... :/","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":4,"body":"Ill just wait until the new champion comes out","replies":[{"poster":"Guy Fox Teemo","date":"2015-09-09T02:14:43.606+0000","up_votes":5,"down_votes":0,"body":"They will have the Temporary discount during 17th - 24th of Sept. Currently they're priced at 1350 RP (And Yi at 1820 will be always) because if you buy them now you get a special loading screen border.","replies":[{"poster":"moonstones","date":"2015-09-09T16:56:27.512+0000","up_votes":3,"down_votes":0,"body":"Yup! This is correct. If you're not interested in the border, and are just looking for the skin, they'll be on sale next week!","replies":[]},{"poster":"SuperJediNinja","date":"2015-09-09T02:15:40.814+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkSoul245,realm=NA,application-id=cIfEodbz,discussion-id=7cEPkmmA,comment-id=0000,timestamp=2015-09-09T02:14:43.606+0000)\n>\n> They will have the Temporary discount during 17th - 24th of Sept. Currently they're priced at 1350 RP (And Yi at 1820 will be always) because if you buy them now you get a special loading screen border.\n\nIt's just a loading screen! I can wait  :D","replies":[]}]},{"poster":"Merxamers","date":"2015-09-09T17:01:07.335+0000","up_votes":2,"down_votes":3,"body":"Riot's experimenting with what they can get away with, just like when they made new champions much more expensive during the first week of launch. Expect this to be the norm for 1350 RP skins, until one day they're never discounted to 975 RP.","replies":[{"poster":"Guy Fox Teemo","date":"2015-09-09T21:16:16.751+0000","up_votes":1,"down_votes":0,"body":"So, because someone doesn't want to give a discount on something it's bad ? O.o these skins are 1350 Tier the fact that they're even going on sale is amazing. Since that's they're only source of income","replies":[{"poster":"Merxamers","date":"2015-09-09T21:24:47.521+0000","up_votes":2,"down_votes":1,"body":"1350 skins being on sale the first week is the NORM; you shouldn't be impressed by it. This is like when Apple introduced 'tiers' of mp3 prices, which ended up making every song worth owning $1.29 instead of $.99. Just you wait; they'll do this for every 1350-tier skin set from now on because they know they can make more money","replies":[{"poster":"Guy Fox Teemo","date":"2015-09-09T22:08:42.569+0000","up_votes":2,"down_votes":1,"body":"It's a good thing it's the norm otherwise they'd never go on sale be happy they go on sale in the first place. Be happy this game cost you $0 to enjoy all its content besides cosmetics","replies":[{"poster":"Merxamers","date":"2015-09-09T22:37:33.048+0000","up_votes":2,"down_votes":1,"body":"Not sure where your unflinching loyalty to an incredibly wealthy business comes from, but i don't think i should be complacent or silent towards what i see as questionable business practices. Enjoy the higher prices for everything, i guess.","replies":[{"poster":"Guy Fox Teemo","date":"2015-09-09T23:12:02.073+0000","up_votes":1,"down_votes":0,"body":"They are an incredibly wealthy business , that doesn't mean they have to sell their products for cheaper, they already give the main project 100% COMPLETELY free, only thing you can't obtain without real money are cosmetics to make your champion look different, if you think thats greedy, I suggest you go play console games, where you have to pay 60$ for the game then another $20 for a dlc, (And thats just one DLC) and another $20 to get a different dlc, then there are game where you just pay to win. Literally.\n\nPeople need to stop with this greedy Riot claim, its ridiculous when the game is completely free and because they charge money for things as simple as chroma's or icon's people flip a bitch because they don't get everything for free.\n\nWell sorry bud Riot needs to make money someway. Be greatful that they do sales/bundles at all for anything.","replies":[{"poster":"Merxamers","date":"2015-09-09T23:21:52.114+0000","up_votes":1,"down_votes":0,"body":"Again with the 'be grateful'; why should i have to be grateful? They're presenting a product funded by people giving them money. I'm not happy with a practice, so i'm raising my objections. Are you an employee? Because i honestly can't fathom why you have such zealous loyalty towards them.","replies":[{"poster":"Guy Fox Teemo","date":"2015-09-09T23:29:56.661+0000","up_votes":1,"down_votes":0,"body":"The price of the product is 1350 RP, as an added BONUS you get a cool loading screen border OR you could wait one weak and get a 30% discount. I don't see how this is a bad deal.","replies":[]}]}]}]}]}]}]},{"poster":"Sukishoo","date":"2015-09-09T22:11:00.499+0000","up_votes":1,"down_votes":0,"body":"So they'll become another Legendary skin category? Ehh... no thanks.","replies":[]}]},{"poster":"lightdragoon88","date":"2015-09-09T22:20:29.340+0000","up_votes":2,"down_votes":1,"body":"sigh...","replies":[]},{"poster":"Havenscythe","date":"2015-09-09T02:20:09.239+0000","up_votes":1,"down_votes":0,"body":"Yeah what the fuck greedy as riot","replies":[]}]}