{"poster":"byPown","date":"2015-04-22T19:16:02.346+0000","title":"Ayuda! Tengo 4 FPS in game nose que pasa!","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Formatie mi pc despues instale nuevamente el lol y me encuentro con la sorpesa de que tengo que jugar con 4 fps y se me hace imposible , nose a alguien que le aya pasado lo mimso y me ayude necesito volver a mi vicio D: naa. pero necestio arreglarlo porfavor!","replies":[{"poster":"Desaroll","date":"2015-04-22T19:18:55.950+0000","up_votes":4,"down_votes":0,"body":"Has instalado los drivers de la placa de video?\n\nSi no, es tu procesador el que está procesando el video, y por eso los bajos fps.\n\nSuerte.","replies":[{"poster":"Katawina UY","date":"2015-04-22T19:53:20.411+0000","up_votes":1,"down_votes":0,"body":"Te aviso que esto parece ser un bug de el parche, yo tengo los drivers actualizados. Tengo drivers, windows, lol reinstalado todo nuevito y pase de 60fps clavados y sin variaciones en calidad muy alta a tener que usar todo en muy bajo para que no se me bajaran y me jodiera la partida.","replies":[{"poster":"Desaroll","date":"2015-04-22T19:58:23.349+0000","up_votes":3,"down_votes":0,"body":"Tu caso es diferente. El que posteó este mensaje dice que fue \"después de un formateo\".\n\nLa causa mas probable son los drivers, no un parche. Total, si tiene los drivers, hay tiempo para echarle la culpa al parche.","replies":[]}]}]},{"poster":"Score","date":"2015-04-23T00:40:29.864+0000","up_votes":2,"down_votes":0,"body":"1.- Instalar drivers de video\n2.- Actualizar Directx","replies":[]},{"poster":"Lautiko","date":"2015-04-23T04:32:16.399+0000","up_votes":1,"down_votes":0,"body":"1ro - No entres a ranked.\n2do- Deberoas fijarte los recursos de tu pc.\n3ro- cerrar aplicaciones y procesos.\n4to- si no hay solucion esperar a que rito lo arregle.\n\n{{champion:17}}","replies":[]},{"poster":"Jonshi","date":"2015-04-22T23:55:23.323+0000","up_votes":1,"down_votes":0,"body":"Drivers... Esos problematicos drivers...\nTenes una integrada? Si es asi sacale el filtro antisolapamiento y la sincronizacion vertical. Luego sacale lo que te consuma rendimiento (si queres sacar el sonido es a voluntad tuya)","replies":[]},{"poster":"VampiroMedicado","date":"2015-04-22T21:53:40.651+0000","up_votes":1,"down_votes":0,"body":"Estupidos y sensuales parches! :D","replies":[]}]}