{"poster":"Luckycrit","date":"2017-02-06T17:58:03.603+0000","title":"Welchen Champion mainen (ausweich mid or top)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo community, \n\nich suche einen champion, den ich mir gut aneignen kann, falls ich mal eine Ausweichrolle (Top mid)bekomme. Dieser Champion sollte vielleicht viele Guides  haben vielleicht ein OTP bestenfalls deutsch, so dass ich schnell damit auch carrien kann. Der Champion soll in Platin Spielbar sein(Ja ich wei&szlig; alles ist in Platin spielbar), ich m&ouml;chte damit aber auch effektiv und gut carrien k&ouml;nnen. Das k&ouml;nnen outmeta picks sein alles ich will einfach nur impact haben wenn ich mal eine andere Rolle bekomme. Ich habe jetzt 4 games verloren weil ich einfach meine Rolle nicht bekam(adc) und ich dadurch nicht carrien konnte oder 0 impact aufs spiel hatte. Ich besitze einfach weitaus nicht den Skill mit dem ich auf dem ADC habe. Ob dieser Champion top oder mid wird ist mir egal ich bevorzuge aber Mid weil ich dort ein bisschen besser vom decisionmaking bin. Auf top f&uuml;hle ich mich immer so verloren.. Aber letzendlich ist es egal. Ich habe kein Problem damit ein Champion zu &uuml;ben so lange es sich lohnt und halt stark bevorzugt wenn es ein OTP auf Youtube gibt  oder halt viel Stuff zum üben . \n\nIch bin SoloQ Spieler btw!","replies":[{"poster":"ELOW Cronos","date":"2017-02-07T08:43:49.347+0000","up_votes":2,"down_votes":0,"body":"Also auf der Top fällt mir jetzt sowas wie Maokai oder Malph ein, da generell einfach zu spielen und immer guten Impact im Teamfight. Da du ADC Main bist könntest du dich natürlich auch an etwas wie Quinn oder Vayne Top versuchen. \n\nIch denke allerdings das einem ADC die Mitte von der Spielweise mehr liegt. Hier währen wohl eher einfache Picks wie Twisted Fate, Annie, Viktor, Ryze oder sehr safe Picks wie Ahri oder Lissandra zu bevorzugen. Natürlich währe für dich als ADC ev auch sowas wie Ezreal, Varus oder Corki (wobei dieser aktuell Mitte sehr stark ist) geeignet.","replies":[{"poster":"xSyruSx","date":"2017-02-07T13:35:03.987+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sergeant Cronos,realm=EUW,application-id=Wj1wcocU,discussion-id=wBoWXxtu,comment-id=0004,timestamp=2017-02-07T08:43:49.347+0000)\n>\n> Also auf der Top fällt mir jetzt sowas wie Maokai oder Malph ein, da generell einfach zu spielen und immer guten Impact im Teamfight. Da du ADC Main bist könntest du dich natürlich auch an etwas wie Quinn oder Vayne Top versuchen. \n> \n> Ich denke allerdings das einem ADC die Mitte von der Spielweise mehr liegt. Hier währen wohl eher einfache Picks wie Twisted Fate, Annie, Viktor, Ryze oder sehr safe Picks wie Ahri oder Lissandra zu bevorzugen. Natürlich währe für dich als ADC ev auch sowas wie Ezreal, Varus oder Corki (wobei dieser aktuell Mitte sehr stark ist) geeignet.\n\nOb man {{champion:4}}  einem eher unerfahrenen Midlaner so einfach empfehlen kann, halte ich nicht für gut. Er hat fast NUR schlechte Lane Matchups bzw. fast nur unsichere Matchups. Diese können dich auf der Lane oft easy killen und dich als {{champion:4}} so weit zurückhauen, dass du vielleicht irgendwann ab Minute 40 so halbwegs an Relevanz gewinnst.\n\nSowas wie {{champion:103}} {{champion:1}} {{champion:112}} {{champion:115}} ist da schon besser. Die haben stellenweise nicht so viele schlechte Matchups und sind auch durch Ihr Skillset sicherer als {{champion:4}}.","replies":[{"poster":"Luckycrit","date":"2017-02-08T11:41:33.241+0000","up_votes":1,"down_votes":0,"body":"TF ist mir kurzfirist zu hart, Annie macht 0 spaß und  wird schnell outplayed, Ahri ist nicht so in meine interesse. wobei Viktor und Ziggs mir sehr zu sprechen aber ich habe gerade bei Ziggs Angst, dass mein Manapool suckt..","replies":[]}]}]},{"poster":"Nycaria","date":"2017-02-06T18:05:26.214+0000","up_votes":2,"down_votes":0,"body":"Spiel doch einfach Corki, wenn du Mitte kommst. Er ist ja quasi ein ADC und momentan auch relativ stark.","replies":[]},{"poster":"lIlIIlIIlIlIlIl","date":"2017-02-06T17:58:23.025+0000","up_votes":2,"down_votes":0,"body":"Ekko","replies":[{"poster":"Luckycrit","date":"2017-02-06T18:19:44.124+0000","up_votes":1,"down_votes":0,"body":"Hört sich gut an hast du irgendwelche Guides oder so ? Mid oder to?","replies":[{"poster":"lIlIIlIIlIlIlIl","date":"2017-02-06T19:06:08.380+0000","up_votes":1,"down_votes":0,"body":"Nein, spiel ihn einfach wer schaut denn heutzutage noch Guides :D\nhttp://champion.gg/champion/Ekko","replies":[{"poster":"Luckycrit","date":"2017-02-08T11:43:44.925+0000","up_votes":1,"down_votes":0,"body":"Naja, ich liebe Videos wie so was https://www.youtube.com/watch?v=BhkGFKnaD0U um mir ein erweitertes Wissen über ein Champion anzueignen klar kann es sein das ich so was nach paar games selber rausfinde, aber wieso sollte ich time wasten und das Wissen nutzen was schon gegeben wird (durch das Internet). Erst durch ein vernünftigen Guide konnte ich vieles ausschöpfen was ich vorher nicht konnte. Ich weiß nicht wieso du davon ab rätst.","replies":[]}]}]}]},{"poster":"Cayce","date":"2017-02-06T18:28:47.997+0000","up_votes":1,"down_votes":0,"body":"Könntest für midlane theoretisch Varus überlegen, dieser ist aber eher für Teamranked geeignet, als für soloq. Im Zweifelsfall Annie picken, die ist idiotensicher. Toplane würd mir Quinn einfallen, genug Randoms pingen überhaupt kein SS und mit guten Roams kann man dann nen Spiel carrien.","replies":[{"poster":"Luckycrit","date":"2017-02-08T11:45:01.188+0000","up_votes":1,"down_votes":0,"body":"Quinn ist okei, aber das Roaming von ihr ist so ziemlich das beste aber auch das schwerste, außerdem fällt mir sehr schwer mit Quinn im lategame useful zu sein ich bin komplett nonexistent als Quinn ..","replies":[{"poster":"Cayce","date":"2017-02-08T17:28:19.417+0000","up_votes":1,"down_votes":0,"body":"Kann dir da leider keine weiteren Tipps geben, ich spiel nicht freiwillig Toplane und die paar games, die ich auf Quinn hab, waren im Jungle ^^'","replies":[]}]}]},{"poster":"Shieldon","date":"2017-02-06T20:49:58.977+0000","up_votes":1,"down_votes":0,"body":"Zu der Toplane muss man halt sagen, dass sie einfach ziemlich stumpf ist von den Champions her.\nWenn du dich auf ihr \"verloren fühlst\" kann ich das gut nachvollziehen, da du ja Main Adc bist. Ich würde dir empfehlen immer für Moakai oder Nautilus zu gehen, da die beide sehr gut in der Meta sind und du sie auch ohne viel Training auf einem guten lvl spielen kannst. Besonders Maokai hat eine sehr starke Laningphase und ist ein guter Teamfighter. Solltest du ahead kommen kannst du das Game relativ gut snowballen und beachte Möglichkeiten für einen TP auf die Botlane. Falls du nicht in der Promo bist würde ich dir aber raten, dass du Toplane bei Autofill einfach dodgen solltest, da sie deiner Mainrolle gar nicht ähnelnt. Besser -3lp als -15lp.  Nauti Maokai Runen: 15ap,15as,9armor und in den Glyphs kannst du varrieren zwischen ap,mr,scaling cdr. Midlane würde ich vermutlich einfach für Annie oder Syndra gehen.","replies":[{"poster":"Luckycrit","date":"2017-02-08T11:46:15.971+0000","up_votes":1,"down_votes":0,"body":"Du hast recht, das einfache leaven sollte ich in Betracht ziehen. Darauf kommt man irgendwie nie wenn man davon kein Freund ist. Aber ganz ehrlich ich verliere selber lieber 3 Punkte also für das ganze Team 4x15 + 15 Punkte von mir zu nehmen.","replies":[]}]},{"poster":"Luckycrit","date":"2017-02-07T15:56:24.362+0000","up_votes":1,"down_votes":0,"body":"Wäre mir mal corki vorher eingefallen er ist wirklich sehr stark. Auf Top ist halt alles anders und da kann ich nur Twitch und Twitch top meh.. Wenn ich einmal meine lane verliere kann ich mir gleich den Strick nehmen.  Annie habe ich gespielt aber da sie nicht so hohe Range hat und ich meistens gegen High plat oder Dia spiele wissen die genau wie Annie funktioniert, hatte das Lane gegen Orianna sie hat einfach dauergepusht und ist roamen gegen oder hat das fog of war ausgenutzt das hat mich komplett auseinandergenommen. Obwohl ich 0/0 stand stand ORianna 4/0 und hat mich dann komplett outzouned...","replies":[]},{"poster":"Bodycounter","date":"2017-02-07T12:14:45.044+0000","up_votes":1,"down_votes":0,"body":"Wieso spielst du in der Midlane nicht einfach klassiche Caster von der Botlane? Dazu gehören Ezreal, Corki, Kog'Maw oder Varus. Insbesondere Corki kann ich dir auf Grund seines gemischten Schadens empfehlen. Seine erste Powerspike mit Trinity Force ist enorm und gute Roams mit seinem Package.\n\nAnsonsten: **Ziggs** ist derzeit sehr stark.","replies":[]}]}