{"poster":"Luckycrit","date":"2016-10-24T16:41:25.174+0000","title":"Irgend ein Midlane Champion (empfehlen) (otp)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo, ich tummel mich zur Zeit auf Platin 5 rum und muss 2 Lanes Picken da ich Ungl&uuml;cklicherweise nur Sup und ADC kann und Sup nicht w&auml;hlbar ist wenn man auch gerne ADC spielen will. Muss ich mir wohl eine 3te lane aneignen. \r\n\r\nK&ouml;nnt ihr mir irgend ein Champion empfehlen, wo ich schnell Erfolge erziele wenn ich mich dran Setze und lese. Besten falls gut Erkl&auml;rt maybe gestreamt guter Guide. Irgendwas so das es mindestens f&uuml;r Platin reicht. Ich Spiele aber sehr ungerne sehr Mechanische Champions wie Le blanc oder Zed/Yasuo. Ich m&ouml;chte ein Sneaky Champion der stark ist ohne 1 Jahr lang daf&uuml;r zu &uuml;ben.  Ich lass mich aber von allem &uuml;berzeugen gerne nehme ich auch Tipps von guten Midlanern(Auch du Pers&ouml;nlich angesprochen) an Videos einfach alles ich will aber wirklich nur 1 Champion &uuml;ben.","replies":[{"poster":"Locratorix","date":"2016-10-27T09:30:09.138+0000","up_votes":1,"down_votes":0,"body":"Orianna eventuell auch. Also ich spiel sie selber sehr gerne und halte sie nicht für allzu schwer, obwohl ständig überall alle unterschiedlicher meinung sind was ihre schwierigkeit angeht.","replies":[]},{"poster":"Gevurahh","date":"2016-10-25T17:01:08.117+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir Viktor zum einen und Gangplank zum anderen empfehlen. Viktor hat ein riesiges Potenzial und ist nicht übermäßig schwierig zu lernen, macht dafür richtig Spaß mit seinem Burst. Für Gangplank braucht man schon deutlich mehr Übung, aber ich finde es lohnt sich. Mir hat seit langem kein Champ mehr so viel Spaß gemacht wie Gangplank und ein weiterer Vorteil ist, dass man ihn auch Top spielen kann. Allerdings bevorzuge ich ihn in der Mitte, da er am Anfang ziemlich schwach ist; umso länger das Game, desto besser für Gangplank! Er ist auf jeden Fall einen Versuch wert.\n\ngevurah","replies":[{"poster":"haha weed lol xd","date":"2016-10-26T06:12:44.523+0000","up_votes":1,"down_votes":0,"body":"GP macht echt Spaß aber die Nerfs haben ihm echt geschadet. Oneshotten kann er erst sehr spät und wenn man mal behind ist kommt man kaum mehr back ins Game. \n\nKann carryn, ja, aber das Risiko ist einfach ziemlich groß. Wenn das spiel aber ausgeglichen ist und man seine 3-4 Items hat, kann ne gute Barrelkette den Fight entscheiden. ","replies":[]}]},{"poster":"EzTwitch","date":"2016-10-25T14:56:30.329+0000","up_votes":1,"down_votes":0,"body":"Gott zum Gruße, \n\nich bin ein ziemlicher Noob, es kann also durchaus sein, dass der folgende Post Fehlinformationen und Quatsch enthält. Dies nur als Vorwarnung.\n\nDa du auch gerne ADCs spielst, wären mir jetzt spontan Azir oder Cassio eingefallen. In Teamfights kommt es, wie bei ADCs hier sehr stark auf Positioning an, dies solltest du bereits einigermaßen beherrschen, bzw. du trainierst es durch spielen dieser Champs weiter. Problem ist natürlich, dass die Beiden ultraschwer sind. Die Zeit, die du investierst wird dir meiner Meinung nach jedoch auch auf der ADC-Position von nutzen sein.\n\nAnsonsten spiele ich persönlich auch gerne Ziggs. Er hat viel Poke, kann mit seiner Sprengladung Leute wegstoßen und schnell Türme einreißen und allgemein ist der Dmg aucht nicht zu verachten","replies":[{"poster":"Luckycrit","date":"2016-10-25T16:33:42.052+0000","up_votes":1,"down_votes":0,"body":"Das die 2 Champions ausgenommen Azir ist höchstens noch im competitive Bereich sehr gut,  ziemlich gut sind keine Frage aber hat zu viele Mechanics und genießen zu lange Zeit...","replies":[]}]},{"poster":"LegendaryXenon","date":"2016-10-25T05:26:32.099+0000","up_votes":1,"down_votes":0,"body":"Annie","replies":[{"poster":"Luckycrit","date":"2016-10-25T16:32:36.535+0000","up_votes":1,"down_votes":0,"body":"LW &  lowrange einfach nein.","replies":[]}]},{"poster":"chatblocked","date":"2016-10-25T10:27:10.828+0000","up_votes":1,"down_votes":0,"body":"Wenn du nur einen Champ lernen willst such dir nen Lanebully.","replies":[{"poster":"Luckycrit","date":"2016-10-25T16:32:11.886+0000","up_votes":1,"down_votes":0,"body":"z.B? Begründung? Wie kommst du zu dieser Aussage/Empfehlung?","replies":[]}]},{"poster":"haha weed lol xd","date":"2016-10-24T16:47:18.863+0000","up_votes":1,"down_votes":0,"body":"Malzahar lol. \n\nwenn du aber während der Lane nicht unbedingt einschlafen willst wäre wohl Vel'Koz was für dich. Seine Lernkurve ist moderat und hat ziemlich hohes carry potential. Hat eigentlich wenig bis keine schlechten Lanes wenn gut gespielt ( außer Fizz aber das ist die Ausnahme die die Regel bestätigt ). \n\nBuild ist ziemlich  statisch Morellos - Maske into Rylais danach Spielabhängig. Bietet weniger zoning als Viktor dafür besseren Burst aber erst später gleich guten Waveclear. Kann sich gut gegen Cassio und Vladimir halten, kann sich gegen engage wehren dank verlässlichen AoE CC ist aber während der Ultimate verwundbar. Seine Passive ballert ordentlichen Truedamage raus und ne Ultimate auf einen research'ten Gegner kann schon mal 1.5k Truedamage erzeugen. Seine Range ist ungefähr zwischen Orianna und Azir. Dafür aber ziemlich unmobil ( Viktor hat Q MS Buff, Orianna W MS Buff ). Also ganz klare Stärken und Schwächen \n\nSpielt sich eigentlich wie ne lila Orianna. \n\n","replies":[{"poster":"Luckycrit","date":"2016-10-24T17:13:01.954+0000","up_votes":1,"down_votes":0,"body":"Lustigerweise ist durch den Champion Vel koz der Post entstanden habe gerade so auf die Mütze bekommen, dass es mich einfach so gefrustet hat das ich nur durchschnittlich mitte kann bzw niemals carrien kann, obwohl mein Team gut genug gespielt hat um das zu gewinnen. Ich denke Vel Koz ist ein cooler Champion, auch manamanagement und die Skillshots sind genau mein Ding. nur mache ich mir sorgen wegen der Ultimate + Positioning.","replies":[{"poster":"Luckycrit","date":"2016-10-24T17:13:50.964+0000","up_votes":1,"down_votes":0,"body":"Und Kayle kann ich ziemlich gut und der ist gut gegen Fizz brauch zwar noch ein bisschen Übung aber einer meiner Lieblings picks in der Mitte das wäre echt cool.","replies":[{"poster":"haha weed lol xd","date":"2016-10-24T17:17:40.907+0000","up_votes":1,"down_votes":0,"body":"Wer jetzt kayle oder Vel koz ? Spiele beide eigentlich","replies":[{"poster":"Luckycrit","date":"2016-10-24T17:42:09.722+0000","up_votes":1,"down_votes":0,"body":"Ich meinte nur, falls ich gecounterpicked werde und noch nicht mitte gepickt habe, dass ich Kayle als sekundäre Option nehmen könnte weil den kann ich schon ein bisschen aber dann hats sich auch mit der Midlane...","replies":[{"poster":"haha weed lol xd","date":"2016-10-24T17:55:05.734+0000","up_votes":1,"down_votes":0,"body":"Ja Vel'Koz und Kayle sind solide Carrylaner. Kayle hat das Azir syndrom und hat ne ultra Winrate im moment, Items sind so günstig grade für sie und sie kann wirklich solo carryn. \n\nUnd vel'koz bringt halt Utility, Damage, sichere Lane alles was man will eigentlich.","replies":[]}]}]}]},{"poster":"haha weed lol xd","date":"2016-10-24T17:25:02.824+0000","up_votes":1,"down_votes":0,"body":"Yup die Ult ist der knackpunkt. Sie hat ne ziemlich hohe Range wodurch du mindestens bis hin zur Backline durch kommst. DuoQ mit einem Jungler oder Toplaner der gerne Tanks spielt damit du ne ordentliche Frontline hast. Ban Kennen jedes Spiel und das einzige worüber du dich dann noch sorgen müsstest sind Assassinen und Diver aber die werden relativ selten gespielt ( sprich sowas wie Wukong, Nocturne, Rengar etc ) \n\n[Hier ein Video was ich mal ich glaub für nen Reddit Thread oder so kurz gemacht habe weiß nicht mehr genau.](https://www.youtube.com/watch?v=ER7jJa_BcBs)\n\n\nDas ist noch der alte Vel'Koz. Der neue Vel'Koz macht aber ähnlich viel Schaden. ","replies":[{"poster":"Luckycrit","date":"2016-10-24T17:43:14.213+0000","up_votes":1,"down_votes":0,"body":"Ja so sah das bei uns auch aus Komplett auseinander genommen. Bin gestorben weil ich sein schaden komplett unterschätzt habe.","replies":[]}]}]}]}]}