{"poster":"Leu07","date":"2015-07-13T21:26:17.183+0000","title":"About Cassiopeia","subforum":"[ARCHIVED] Miscellaneous","up_votes":3,"down_votes":0,"body":"I just want to clear some doubts about the current state of Cassiopeia and how  some of the little but important changes that the game has had lately are afecting her, to all those Cassiopeia fans and to those who are interested in her.\r\n\r\nFirst, When is Riot Stashu going to say hello on boards and at least tell everyone that he will not continue to work on Cassiopeia and make her more a poison mage like he promised?\r\n\r\nSecond, The latest changes to the ap items were very interesting, they seemed to promise a little buff to Cassiopeia -in exchange for more gold and hence, more time to scale- specially the likes of {{item:3116}} {{item:3040}} , {{item:3151}} and {{item:3089}} . All of those Items synergyze well with Cassiopeia, they are all a bit more expensive now but more powerful (more ap for seraph's, liandry's and rabadon and more slow for Rylai's); However, Cassiopeia seems to be dropping in win rate (according to lolking) she is now sitting on a 46,45% winrate, and she's even dropped some of her pick rate. I'm really a bit surprised for this numbers, if someone could explain me why this has happened please comment. \r\n\r\nThird, I think Cassiopeia should have an ability icon update, it seems that all of the latest champion reworks have had it. Cassiopeia's ability icons are not that bad, but could need an update, it would just make it fair for the Cassiopeia players, The passive icon in particular looks ugly. So Riot, if you could find the time to update those icons, I would really aprecciate it, and many others too. Also, the poison indicator (the purple bubling thing that indicates if a unit or champ is poisoned) looks very outdated.\r\n\r\nI hope I get some feedback, have a nice day!","replies":[{"poster":"Oerba No Naja","date":"2015-08-07T05:11:50.439+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/Vep70K9u-some-cassio-balances-change-3    take a look \n\nher winrate dropped with her mana costs / sustain nerfs","replies":[]},{"poster":"ChainedUp","date":"2015-07-17T05:28:36.392+0000","up_votes":1,"down_votes":0,"body":"She is very strong but some mid lane mages just out right out range her. Things like {{champion:81}}  {{champion:96}} {{champion:112}}  {{champion:268}} even {{champion:103}}  all are very common picks at higher elo. She's a very close range mage and doesn't really excel without punishing the other mid laner. Also she has to go tear which does delay damage during the early game very significantly, which affects mid laners that have very high base damage and can trade without the punishment as a cass with ap items. She also suffers from mobility issues and with junglers like {{champion:421}}  {{champion:79}}  and even  {{champion:102}} can punish that by jumping on her.\n\nOverall i love playing her but with all the item changes she is still a late game monster you just have to keep in mind everyone else now has those items which changes a lot of the  APCs entirely as far as viability goes now.","replies":[]},{"poster":"captain cobra","date":"2015-07-14T05:35:37.109+0000","up_votes":1,"down_votes":0,"body":"I think she is still good.","replies":[{"poster":"Leu07","date":"2015-07-14T05:47:05.600+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=captain cobra,realm=NA,application-id=cIfEodbz,discussion-id=NgTPEjz2,comment-id=0000,timestamp=2015-07-14T05:35:37.109+0000)\n>\n> I think she is still good.\n\nMe too, that's why it is so curious, if she feels good, in paper she should be good because the changes benefit her, then why are her numbers going down?","replies":[{"poster":"captain cobra","date":"2015-07-15T02:59:19.972+0000","up_votes":1,"down_votes":0,"body":"Maybe the bronze players have discovered her. She is a pretty high skill champion. I can't really talk though because I am S4 :'(","replies":[]}]}]}]}