{"poster":"FF 15 Pls","date":"2017-03-27T18:12:51.590+0000","title":"¿ Es reportable esto?","subforum":"Comportamiento del jugador","embed":{"description":null,"url":"http://imgur.com/GoLuRSq","image":"http://imgur.com/GoLuRSqs.png"},"up_votes":31,"down_votes":0,"body":"Les comento era una partida clasificatoria &iacute;bamos estopmeando todo, el marcador era de 17 a 6, en lo que el mi jg dice para hacer baron, luego el escribe por general - Vengan les regalare el baron esto esta muy aburrido- el nos dice que es una baiteada pero cuando aparece el primer enemigo el jg con smite listo se va a hacerse el sapo y smitea el sapo, el baron estaba a 500 de vida llega el  veigar le tira la W y lo roba y mi jg escribe por general -Esto va estar divertido- nosotros tilteado por lo que hab&iacute;a hecho el lee, le preguntamos porque hizo eso y nos contesta -Estaba muy aburrida la partida son unos carreados si no saben jugar bajo presi&oacute;n-. Luego nos flamea diciendo que regalamos la partida y perdimos.","replies":[{"poster":"ZanahoriaAsesina","date":"2017-03-27T18:15:22.180+0000","up_votes":34,"down_votes":1,"body":"Absolutamente.","replies":[]},{"poster":"Nuke","date":"2017-03-27T18:17:28.789+0000","up_votes":18,"down_votes":0,"body":"Ok. Ademas de reportable por Actitud antideportiva y abuso verbal, asistio al enemigo. Y mira que hay que ser~~ basura de persona~~, permiteme decirlo, para poner:\n\n> Vengan les regalare el baron esto esta muy aburrido- el nos dice que es una baiteada\n\n**EL EQUIPO ENEMIGO HA MATADO AL BARON**\n\ny despues pone:\n\n> Estaba muy aburrida la partida son unos carreados si no saben jugar bajo presión\n\n{{sticker:zombie-brand-facepalm}} \n\nQue verguenza me da ser de la misma especie que este tipo ahora mismo.","replies":[]},{"poster":"TSW Rorschach","date":"2017-03-27T18:47:47.912+0000","up_votes":13,"down_votes":0,"body":"Que bronca me da cuando en las ranked dicen \"Vamos a hacerlo divertido\".\nLa idea es ganar, no darle oportunidades al enemigo {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Nerf Aery","date":"2017-03-27T21:36:49.283+0000","up_votes":6,"down_votes":2,"body":"\"Es un juego, toda tu vida se rige por un jueguito?\" o te dan esas respuestas de pibe especial.","replies":[{"poster":"Benja God","date":"2017-03-28T00:16:02.640+0000","up_votes":2,"down_votes":4,"body":"Sabes que es un juego COMPETITIVO?","replies":[{"poster":"CordobezEverdeen","date":"2017-03-28T01:00:23.573+0000","up_votes":3,"down_votes":0,"body":"Comprensión lectora.\nLee 2 veces lo que dice Keyra y te daras cuenta que esta en contra de estos trolls...","replies":[]},{"poster":"Nerf Aery","date":"2017-03-28T00:59:42.539+0000","up_votes":3,"down_votes":0,"body":"Y vos sabes leer? Claramente te falta comprensión lectora, lo que puse entre comillas, es la respuesta que te suelen dar los 0/8 en ranked, yo si juego normal/aram/el evento de turno, no me caliento si pierdo, es mas, entro con 3 mas en skype y nos cagamos de risa de lo jodido que la cagamos, ahora. Si es ranked, no me calienta perder porque el otro team se haya movido mejor, hayan hecho mejores jugadas o hayan coordinado mejor, me jode perder por pibes que no se dejan carrear o en el peor de los casos, les da igual ganar o perder. Ellos se lo toman en joda la ranked, yo juego para ver si puedo subir a platino al menos.","replies":[]}]}]}]},{"poster":"Corchito","date":"2017-03-27T18:17:14.462+0000","up_votes":2,"down_votes":28,"body":"***","replies":[{"poster":"FF 15 Pls","date":"2017-03-27T18:24:35.728+0000","up_votes":4,"down_votes":0,"body":"El le campeo al top nomas, solo apareció en mid y bot para tirar una q o r y hacer ks al adc, lo mismo en mid incluso le dijeron porque ks si ya la estaba por matar\nPD: Lee b5 33 pl","replies":[{"poster":"Riche Samą","date":"2017-03-27T21:34:56.693+0000","up_votes":12,"down_votes":0,"body":"Temanle al hombre que no tiene nada que perder {{champion:110}}","replies":[]},{"poster":"Corchito","date":"2017-03-27T18:27:57.612+0000","up_votes":1,"down_votes":5,"body":"Quería ponerse a prueba para saber si podía subir a bronce 4 {{champion:432}}","replies":[]}]},{"poster":"Nuke","date":"2017-03-27T18:22:49.430+0000","up_votes":6,"down_votes":12,"body":"When quieres boludear un poco y vas a tu smurf para que no te caiga el bann en la principal.\n\nhttps://i.ytimg.com/vi/fxobA3YJCpk/maxresdefault.jpg\n\n#La vieja confiable","replies":[{"poster":"FedecarboneroUY","date":"2017-03-27T23:42:07.076+0000","up_votes":5,"down_votes":0,"body":"En realidad lo hace porque no le da la cara para hablar con la principal :v\n\n1. {{champion:432}} {{champion:432}} {{champion:432}}","replies":[]}]}]},{"poster":"Harvey Birdman","date":"2017-03-28T02:20:25.335+0000","up_votes":4,"down_votes":0,"body":"El rodillazo en la boca que le doy a ese Lee Sin, no puedes darle ventaja al enemigo para hacerlo más \"divertido\" si no conoces a tus compañeros.\nLo reportaría 14 veces.","replies":[]},{"poster":"Geeik","date":"2017-03-27T19:25:03.908+0000","up_votes":4,"down_votes":0,"body":"Reportable por feedear al enemigo, y por actitud poco deportiva {{sticker:slayer-jinx-wink}} .\nPor esa gente la comunidad no mejora","replies":[]},{"poster":"Mazoku","date":"2017-03-27T18:30:11.498+0000","up_votes":3,"down_votes":13,"body":"***","replies":[{"poster":"Corchito","date":"2017-03-27T18:32:37.101+0000","up_votes":8,"down_votes":1,"body":"Podría ser peor, podría estar atrapado en platino hace mucho tiempo :O","replies":[{"poster":"Mazoku","date":"2017-03-27T18:33:36.634+0000","up_votes":2,"down_votes":11,"body":"Eso es lo bueno de platino. Si sos un jugador decente podes practicar 60 champs o mas por temporada y no bajar jaja.","replies":[{"poster":"Riche Samą","date":"2017-03-27T21:33:21.311+0000","up_votes":2,"down_votes":0,"body":"Porqué te llenan de negativos, jaja. Como me hiciste reir +10 reco y fav {{item:3903}}","replies":[{"poster":"Nerf Aery","date":"2017-03-27T21:37:24.181+0000","up_votes":4,"down_votes":1,"body":"Porque viene del dota, por eso lo empoman a negativos.","replies":[{"poster":"Mazoku","date":"2017-03-27T21:41:52.006+0000","up_votes":1,"down_votes":4,"body":"Sinceramente lo dudo... no muchos ven el perfil de un usuario antes de decidir si un comentario merece like/dislike.\n\nAdemas, dar negativo por venir de un juego que fomenta el uso de league of legends es algo tonto jaja.","replies":[{"poster":"Nerf Aery","date":"2017-03-27T23:21:51.045+0000","up_votes":2,"down_votes":0,"body":"Fijate que había un post donde decía que la comunidad era hipócrita e ignorante. Yo adhiero 100% con ese post, hay muy pocos, por no decir que los cuento con los dedos de una mano, con los que podes charlar bien sin que se sientan ofendidos.","replies":[{"poster":"Mazoku","date":"2017-03-28T00:37:24.025+0000","up_votes":1,"down_votes":5,"body":"Y bue, considerando como riot maneja las cosas... es una dictadura de los ofendidos. Se que es triste ver el juego que amo convertirse en algo asi pero es lo que hay.","replies":[{"poster":"Nerf Aery","date":"2017-03-28T01:05:40.618+0000","up_votes":3,"down_votes":1,"body":"Esto en Ombu no pasaba, nos puteábamos entre todos y nadie lloraba cuan princesa de disney.","replies":[{"poster":"Mazoku","date":"2017-03-28T01:53:52.247+0000","up_votes":2,"down_votes":3,"body":"Y para poner una frutilla arriba del postre, me banearon por mi primer comentario (en el cual mencionaba que mas no podia bajar). Hasta la verdad censuran...","replies":[{"poster":"7overtherainbow7","date":"2017-03-28T02:14:47.501+0000","up_votes":4,"down_votes":0,"body":"No quiero sonar sarcástico ni ofenderte, pero podrías leer el mensaje que te enviamos otra vez y compararlo con tu comentario borrado.\nPodemos estar de acuerdo o no en que le dijiste la \"verdad\", el problema radica en si era necesario decir esa \"verdad\" y en como le dijiste esa \"verdad\". \n\n¡Saludos!","replies":[{"poster":"Mazoku","date":"2017-03-28T02:38:17.215+0000","up_votes":1,"down_votes":3,"body":"No me ofendo bro, lei nuevamente y mi posicion no cambia.\n\nCreo que hubiera sido mejor decirle \"Estas en la liga bronce y estas criticando el accionar de un compañero. Que te haces el malote? bobo.\"\n\nAlgo asi hubiera sido mejor? Despues de todo estoy emulando las palabras de riot y estoy expresando mi opinion de la mejor manera posible.","replies":[{"poster":"7overtherainbow7","date":"2017-03-28T02:54:47.660+0000","up_votes":3,"down_votes":0,"body":"Ese mensaje necesita un rework urgente.\nAhora, Me parece que la frase que sugeriste (sin las palabras de Riot) esta mejor expresada que tu comentario borrado. Aún así sigo considerando que es una verdad que no aporta mucho al debate que plantea la discusión.","replies":[{"poster":"Mazoku","date":"2017-03-28T03:01:10.880+0000","up_votes":1,"down_votes":2,"body":"Entonces fue borrado por off-topic y no por ser \"un bobo fastidioso o un malote\"? Dos insultos hacia mi, cabe recalcar.\n\nSin embargo no me molestan los insultos de desconocidos, lo que me molesta es la hipocrecia. Censurar a algunos por \"comentarios ofensivos, off-topic, etc\" pero no a todos. Hacen reglas que ni ellos pueden cumplir.\n\nSinceramente disfruto demaciado los foros como para dejarlos a pesar de que este ande medio muerto. Supongo seguire jugando a la ruleta rusa de los bans.","replies":[]}]}]}]},{"poster":"Nerf Aery","date":"2017-03-28T01:58:49.242+0000","up_votes":3,"down_votes":1,"body":"Fijate cada comentario mío, de 10, 8 tienen votos negativos. Hay una frase que dice \"la verdad no ofende\" pero al parecer no se aplica por estos lares :3.","replies":[]}]},{"poster":"GameMode","date":"2017-03-28T04:39:13.089+0000","up_votes":2,"down_votes":0,"body":"Lo que vos decís es la posta, juega gente muy susceptible y los de Riot quiere que sean así, no existe la maña. No existe la rivalidad, son todos sensibles y donde le cerraste la boca a uno te reporta. Aún habiendo entrando en tu juego o vos en el de él. \n\nY cuando digo \"juego\" me refiero a ese juegiño que se genera en las rivalidades.","replies":[{"poster":"Nerf Aery","date":"2017-03-28T05:18:40.268+0000","up_votes":3,"down_votes":1,"body":"Cuando Gaussrik hizo la encuesta del \"juga bien\" se originó por una charla que tuvo conmigo, él decía que yo estaba errado en mi forma de actuar y que la comunidad pensaba muy diferente a mi. Finalmente, mas de la mitad de los votos, vinieron a mi forma de pensar, por consiguiente creo que no estaba tan errado como él decía :).\n\nPor otro lado, charlando con un jugador me dijo hace unos días \"vos no sos alguien tóxico, usas las palabras de la manera adecuada y aplicas la lógica a lo que decís, los otros no entienden y por eso te tiran negativos\" y como dije en el post de Callejerokiller, el 90% de lo que es el foro es ignorante e hipócrita y en vez de esmerarse por crecer como personas, aprender o en el peor de los casos, agregarte y preguntarte \"por qué pusiste tal o cual cosa\" prefieren tirar un negativo y listo. Eso se llama, mi estimado, ser mediocre.\n\nQue soy agresivo con la palabra y soy un tanto crudo, no te lo voy a negar. Hace unos días me agregó un amarillo y los primeros diez minutos de charla, le fui con los tapones de punta, ahora si lo veo lo saludo y charlamos lo mas bien. Ésto podría dejarnos en una pregunta, yo soy tan tóxico como dicen varios, o es que ellos son muy sensibles a las palabras? Y no creo que nadie se haya muerto por un par de palabras \"fuertes\".","replies":[{"poster":"GameMode","date":"2017-03-28T06:16:56.921+0000","up_votes":2,"down_votes":0,"body":"Lo que pasa es que reportar por flameo es una boludes ENORME, no recuerdo enserio, ningún juego en el cual se reporte por flameo. Es que no existía tal cosa.\n\n Todos los juegos online que jugué censuraban los insultos más usados o en otros casos se te muteaba por X cantidad de tiempo. Pero te permitían \"pelearte textualmente\" con ese rival que le tuviste bronca toda la partida ya sea porque jugo mejor que vos, etc, etc. \n\nY lo bueno de esto, es que la otra persona también te hacia sacar o enojar para que juegues peor, no te decía \"reportado imbécil mira que me vas a decir eso\" o saltaba otro jugador de la partida COMO PASA EN EL LOL que todos son RECONTRA BOTONES y dicen \"Report x9 es un flamer, ai dios yo soy newbie el unico juego que conozco es lol\".\n\nLa maña es buenisima, en este juego \"competitivo\" entre comillas, no lo permiten. Por eso uno se guarda la bronca pero cuando se cruza con personas trolls o afks que esos si son los que joden la partida, no les pasa nada. \n\nPero bueno hay \"gente\" también entre comillas porque para mí son imbéciles o pibes downs que se sienten ofendidos por palabras que hay en un chat de un juego y les afecta.","replies":[{"poster":"Nerf Aery","date":"2017-03-28T06:47:13.152+0000","up_votes":2,"down_votes":0,"body":"Si se ofenden por unas palabras, imaginate como quedarían si les pegaría una stompeada con Nami o Janna XD. Tengo la esperanza, de que ésto cambie en algún momento para mejor, si quieren forjar una utopía, lo están haciendo de la manera errónea.","replies":[{"poster":"Mazoku","date":"2017-03-28T16:30:00.933+0000","up_votes":2,"down_votes":0,"body":"Ni ellos saben como lograr su utipia. De seguro ni saben que por definicion es imposible.\n\nFijate mas arriba como lo deje calladito a un moderador del foro al señalar la cencura que es evidente por estos pagos y las contradicciones internas de su sistema.","replies":[]},{"poster":"Mazoku","date":"2017-03-28T17:36:08.697+0000","up_votes":1,"down_votes":0,"body":"No les interesa realmente la utopia, ese es el punto. Dicen que si, pero si quisieran harian las cosas como corresponde. Son hipocritas.\n\nEso es lo que me molesta, que los encargados de la comunidad no lo admitan.","replies":[]},{"poster":"Nerf Aery","date":"2017-03-28T17:23:16.204+0000","up_votes":1,"down_votes":0,"body":"Podría limpiar el foro y poner a todos en línea si me dieran la posibilidad, te eliminaría a los trolls, afk y flamerinos. Y realmente les daría la utopía que tanto desean.","replies":[]}]}]},{"poster":"Ch4puLin","date":"2017-03-28T11:07:25.423+0000","up_votes":1,"down_votes":0,"body":"Y qué te hace suponer que vos sos el que sabe y el otro es un mediocre que no entiende? Hmmm","replies":[{"poster":"Nerf Aery","date":"2017-03-28T13:01:27.715+0000","up_votes":1,"down_votes":0,"body":"Porque si entendieran, no se ofenderían por nimiedades, tan fácil como eso.","replies":[]}]}]}]}]}]}]},{"poster":"FedecarboneroUY","date":"2017-03-27T23:43:03.533+0000","up_votes":1,"down_votes":1,"body":"Vos no eras el que tenía problemas del corazon? :v","replies":[]}]}]},{"poster":"Mazoku","date":"2017-03-27T21:38:28.793+0000","up_votes":3,"down_votes":2,"body":"Porque la mayoria de la comunidad es bronce y aparentemente se sienten ofendidos cuando les decis que no pueden bajar mas jaja....","replies":[]}]}]}]}]},{"poster":"KarmaUnder","date":"2017-03-27T23:36:05.931+0000","up_votes":2,"down_votes":0,"body":"pasame la repe :V","replies":[]},{"poster":"I Love KaiSa","date":"2017-03-27T18:18:14.052+0000","up_votes":2,"down_votes":19,"body":"Por lo menos escribí bien la historia para que se crean la  mentira. La E de veigar es un stun.\n\n>  llega el **vaygar** le tira la E y lo roba\n\nCito para no quedar como tonto si llegas a editar el tema.","replies":[{"poster":"TeamSayori","date":"2017-03-28T05:47:30.112+0000","up_votes":1,"down_votes":0,"body":"y te llenan a negativos xD","replies":[{"poster":"I Love KaiSa","date":"2017-03-28T16:58:02.771+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ggb3 yey,realm=LAS,application-id=PJAKt7ph,discussion-id=Zkp40vvG,comment-id=00030001,timestamp=2017-03-28T05:47:30.112+0000)\n>\n> y te llenan a negativos xD\n\nComo si tuviera relevancia en la vida de alguien el que algunas personas se ofendan por cualquier cosa.","replies":[]}]},{"poster":"FF 15 Pls","date":"2017-03-27T18:20:18.163+0000","up_votes":4,"down_votes":0,"body":"Desconozco las habilidades del  veigar por eso gracias","replies":[]}]},{"poster":"KingLeoricxd","date":"2017-03-28T00:38:15.593+0000","up_votes":1,"down_votes":0,"body":"la Q y la W  de veigar pegan muchisimo si farmean bien eh llegado a pegar con veigar 1500 solo con la W","replies":[]},{"poster":"Cafe con Espuma","date":"2017-03-27T23:05:06.917+0000","up_votes":1,"down_votes":0,"body":"Me hago 4000 cuentas y lo reporto","replies":[]},{"poster":"Blindarelli T","date":"2017-03-27T22:07:58.416+0000","up_votes":1,"down_votes":0,"body":"Pero obvio que es reportable papu, flamealo de todas las maneras posibles reportalo por 20 maneras, agregalo y flamealo mas y despues cerra tu cuenta. Sos ininmputable hermano, 15 dias de ban de chat y salis.","replies":[]},{"poster":"Fransoi ","date":"2017-03-27T20:49:51.144+0000","up_votes":1,"down_votes":0,"body":"Ayudo al rival osea si es report","replies":[]}]}