{"poster":"zBrujo","date":"2017-03-22T19:43:57.451+0000","title":"Baneo por error (Porfavor ayuda de un Rioter)","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Hola!\r\nFavor ayuda, me banearon mi cuenta por uso de programas de terceros, sin embargo, yo no he utilizado nunca un programa que afecte o intervenga en el funcionamiento o resultados en el juego, tampoco he prestado mi cuenta.\r\nTengo mas de 3 a&ntilde;os con esta cuenta y he invertido mucho tiempo, asi como tambien dinero.\r\n\r\nEnvi&eacute; un ticket al soporte pero segun ellos el baneo es justificado pero nada mas, ni siquiera me dicen que programa es, porque insisto, no he usado nunca un programa que afecte la jugabilidad, los resultados, la tienda o lo que sea.\r\n\r\nMuchas gracias.\r\n\r\nzBrujo.","replies":[{"poster":"9081913DEL1","date":"2017-03-22T19:58:48.728+0000","up_votes":1,"down_votes":0,"body":"Programas de terceros en cualquier circunstancia que actuen, sea cambiando un skin, informando algun dato extra, por minimo que sea, cambiando el hud, la presentacion, acelerando una carga, cualquier extension, o carga adicional a los procesos y archivos de lol y/o su modificacion son sancionales.\n\nQue riot tenga a su discrecion el poder tomar o no acciones sobre estas cuestiones no implica la libertad de uso de cualquier programa que influya o no sobre resultados de partidas.\n\nEs decir, si tenes otra cosa abierta que tenga que ver o no con lol, y riot ve que no deberias eres sancionable.\n\nOtros juegos ~~OP7~~ te banean si tienes instalados programas como CHEAT ENGINE, aun si no los estas usando mientras ejecutas el juego.\n\nSi tienes alguna duda, el soporte es quien podra ayudarte con mas certeza, pero te adelanto que no se dan datos sobre la deteccion de programas (cuestion de seguridad) y que si el soporte esta seguro, no cambiaran el veredicto.\nAl ser un juego free to play, siempre puedes crear una nueva cuenta. Es mas eficiente que dejar cuentas funcionando con la posibilidad de romper las reglas \"por las dudas\". \n\nSaludos!","replies":[]},{"poster":"Excorpion","date":"2017-03-22T19:51:35.345+0000","up_votes":1,"down_votes":0,"body":"El sistema es automático, si alguna vez usaste algo tu cuenta queda marcada, esto incluye, donde hayas usado tu cuenta, y como la hayas usado, por ejemplo, haberla usado en el pc de un amigo, o en un ciber.\nDe todos modos, el ban por programas de terceros es sentencial, no es recuperable de ninguna forma cuando es verdadero.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-03-22T19:48:16.012+0000","up_votes":1,"down_votes":0,"body":"La verdad, no hay modo que sepamos si eres inocente o no, y el soporte no da pruebas.\n\nNo conozco medio posible para revertir esto.","replies":[]}]}