{"poster":"nelogis","date":"2019-11-13T07:39:11.319+0000","title":"I can't think of a single champion that wants Omnistone","subforum":"Gameplay","up_votes":23,"down_votes":5,"body":"\"Here are some random Keystones lmao have fun\"\r\n\r\nWhat champion in this game actually wants Electrolute / Phase Rush / Afterschock at the same time?\r\n\r\nEvery champ has an ideal Keystone, if that Keystone is Afterschock you just pick Afterschock.\r\nEven champions that have NO keystones to use just go for a general Keystone like Electrolute or Unsealed Spellbook.\r\nEven if you WANT to have 2 keystone at the same time you sure as hell don't want the other 10 too.\r\n\r\nThere isn't a single champ that wants this, not a single one. Around 150 champions in the game and the rune is designed for 0 of them.\r\n\r\nI wouldn't even give a damn about this Keystone if it didn't remove an actual Keystone people use, just put this as the 4th Keystone in inspiration as a \"for fun Keystone\" because that's what it is.\r\n\r\nThink about it, you leave Ezreal in the dirt, you remove a GP / Lucian / Sona / Draven / Fiora / Illaoi / Udyr / Nasus playstyle and for WHAT?!\r\n\r\nFor this piece of garbage nobody would want to use.","replies":[{"poster":"Stephenizgod","date":"2019-11-13T09:22:47.608+0000","up_votes":21,"down_votes":2,"body":"As if Klepto isn't just as bad... Those champs don't rely on Klepto, they abuse it. Plain and simple. All of those champs can use other keystones just as well, they just prefer Klepto because, again, they are abusing it. It basically takes Late game champs and brings their powerspikes into the Mid game, which is a huge freaking problem, specially in Top lane where they are either beyond oppressive or the most boring lanes you can do nothing about.  \n\nOmnistone seems like a really poor change to be fair, but Kleptomancy needs to leave the game for good.","replies":[{"poster":"nelogis","date":"2019-11-13T09:42:19.751+0000","up_votes":3,"down_votes":15,"body":"> Those champs don't rely on Klepto, they abuse it\n\nIn what way are they abusing it?\nThey are using it for its intented purpose, it's like saying tanks abuse afterschock because they gain huge amount of resistances to trade easily.\nIt's what afterschock is made for.\n\n> All of those champs can use other keystones just as well, they just prefer Klepto because, again, they are abusing it.\n\nNo Klepto isn't the main Keystone on Udyr / Luc / Fiora / Illaoi / Sona / Draven, they can however spec into it for example when playing against a tank matchup.\n\nThey spec into it, they normally use another one.\n\n> It basically takes Late game champs and brings their powerspikes into the Mid game, which is a huge freaking problem\n\nSpare me with this shit, the concept of late game has been thrown out of the window, look at Vayne, she doesn't use this rune and still becomes a hypercarry with 2 items.\n\nTristana going mid and finding success which is insane for a late game hypercarry\n\nTwitch going jungle as a late game hypercarry and every lane having to sit back at the tower until he eventually shows himself somewhere\n\nLate game hypercarry powerspikes already happen in mid game with or without this rune.\n\n> in Top lane where they are either beyond oppressive or the most boring lanes you can do nothing about.\n\nStuff like Vayne or Kennen going top with Klepto has to do with the fact that uninteractive ranged damaged in top is way too effective.\n\nFor that to be fixed you need to buff dorans shield to give a melee only bonus that has damage reduction towards auto attacks or single target spells, not by removing klepto.\n\n> Omnistone seems like a really poor change to be fair, but Kleptomancy needs to leave the game for good.\n\nAh so ranged tops have been a problem with it so the entire game needs Klepto removed? what?\n\nEz hasn't been a problem with it post nerf, mid lane has no klepto problems, ADC has no klepto problems, jungle has none and support doesn't have them either.","replies":[{"poster":"Stephenizgod","date":"2019-11-13T18:48:07.761+0000","up_votes":3,"down_votes":2,"body":">In what way are they abusing it?\nThey are using it for its intented purpose, it's like saying tanks abuse afterschock because they gain huge amount of resistances to trade easily.\nIt's what afterschock is made for.  \n\nAftershock works the exact same for every champ that uses it, it was designed for Tankier champions, so no they are not abusing it. However before it was nerfed, certain champions who were not supposed to be using it were abusing it. Abusing something in this context means, using something better than it was intended to be used. Klepto was not meant to be used to make Late game champions into Mid game champions, it is destroying balance.  \n\n> No Klepto isn't the main Keystone on Udyr / Luc / Fiora / Illaoi / Sona / Draven, they can however spec into it for example when playing against a tank matchup.\n\n>They spec into it, they normally use another one.  \n\nPretty much every champion can use every Keystone what is your point? We are of course talking about the champions you claimed \"relied\" on Klepto, so I don't understand why you are bringing up champions that can possibly use it. All those champions have many different possible Keystones and removing Klepto would have 0 impact on them.  \n\n>Spare me with this shit, the concept of late game has been thrown out of the window, look at Vayne, she doesn't use this rune and still becomes a hypercarry with 2 items.\n\n>Tristana going mid and finding success which is insane for a late game hypercarry\n\n>Twitch going jungle as a late game hypercarry and every lane having to sit back at the tower until he eventually shows himself somewhere\n\n>Late game hypercarry powerspikes already happen in mid game with or without this rune.  \n\nVayne doesn't become a carry until later in the game unless she gets fed or is allowed to free farm. I rarely see Vayne but when I do, she gets chain ganked because she is useless. Tristana going mid is another case of abuse, she shouldn't be going mid. Twitch jungle was a big deal a while back, but now its fallen off now its a very niche pick that can be countered with awareness and aggressive counter jungling. You are describing exactly what I am talking about, please point out where I said Klepto was the only source of abuse? What because Tristana Mid was a thing a couple patches ago, we shouldn't remove other forms of imbalance? Get rid of it all.  \n\n>Ah so ranged tops have been a problem with it so the entire game needs Klepto removed? what?\n\n>Ez hasn't been a problem with it post nerf, mid lane has no klepto problems, ADC has no klepto problems, jungle has none and support doesn't have them either.  \n\nYes! What the hell are you talking about? It is a huge problem only in Top and Ezreal, those are the only places it is used and it is breaking in the game in those spots... You don't see it Mid because no mid laner uses it... You don't see it in the Jungle because no Jungler uses it... It is breaking Top lane and making Ezreal a nightmare too early into the game. This is the exact reason things get nerfed. I am not sure what your point is.","replies":[{"poster":"nelogis","date":"2019-11-14T13:52:35.074+0000","up_votes":1,"down_votes":0,"body":"> Aftershock works the exact same for every champ that uses it, it was designed for Tankier champions, so no they are not abusing it. However before it was nerfed, certain champions who were not supposed to be using it were abusing it. Abusing something in this context means, using something better than it was intended to be used. Klepto was not meant to be used to make Late game champions into Mid game champions, it is destroying balance.\n\nAh then thell me what is klepto being used for then? Lane sustain?\nOnly Keystones that gives you gold, level ups and almost no reliable combat stats\n\nSeems like a keystone to help get your items quicker and scale faster.... which in return you know... makes it so you spike quicker. \n\nOr do you use Klepto to get oracles and spot invisible units?\n\n> Pretty much every champion can use every Keystone what is your point? We are of course talking about the champions you claimed \"relied\" on Klepto, so I don't understand why you are bringing up champions that can possibly use it. All those champions have many different possible Keystones and removing Klepto would have 0 impact on them.\n\nAh yeah who doesn't know Lethal Tempo Vladimir.\nThe only champ that relies on Klepto is Ezreal. \n\nBy your logic we shouldn't let champs decide what keystone they want and just give them one! Who gives a shit about alternative playstyles, as soon as you lock in a champ it auto locks a keystone for you, sounds like fun!\n\nBy removing Klepto you are removing a bunch of alternative playstyles for the reason of adding this useless crap.\nThe reason is pissing me off, if this new rune at least gave the game other alternative playstyles that champs can work with instead of a steaming pile of horse shit I wouldn't care.\n\nBut it doesn't that's why I care.\n\nI hate when alternative playstyles get removed, I also hate the removal of splitpush items, yeah dude we haven't had enough 5 v 5 deathballs at dragon pit we need more of them!\n\n> Vayne doesn't become a carry until later in the game unless she gets fed or is allowed to free farm. I rarely see Vayne but when I do, she gets chain ganked because she is useless. Tristana going mid is another case of abuse, she shouldn't be going mid. Twitch jungle was a big deal a while back, but now its fallen off now its a very niche pick that can be countered with awareness and aggressive counter jungling. You are describing exactly what I am talking about, please point out where I said Klepto was the only source of abuse? What because Tristana Mid was a thing a couple patches ago, we shouldn't remove other forms of imbalance? Get rid of it all.\n\nWhat does this have to do with what I said?\n\nYour argument: Klepto makes it so late game hypercarries scale way too fast\n\nMy Argument: Klepto has nothing to do with it but rather that Riots balance team is the equivalent of monkeys drooling on themselfes.\n\nYour argument: Late game carries going mid / jungle is another abuse case\n\na) you just said it yourself that it has nothing to do with Klepto\nb) Late game hypercarries going to other lanes is again the work of riots \"balance\" team, has nothing to do with Klepto\n\nSo why are we removing klepto?!\n\n> Yes! What the hell are you talking about? It is a huge problem only in Top and Ezreal, those are the only places it is used and it is breaking in the game in those spots... You don't see it Mid because no mid laner uses it... You don't see it in the Jungle because no Jungler uses it... It is breaking Top lane and making Ezreal a nightmare too early into the game. This is the exact reason things get nerfed. I am not sure what your point is.\n\nWhat part of klepto Ezreal is a problem?!\nWhat part of Ezreal stops becoming a problem when you remove klepto?!\n\nAnd don't tell me \"because he scales too fast\"\n\nAh so you're telling me Nasus going klepto is destroying top lane? I find it kind of hard to believe that.\n\nJust admit that the only real problem with this keystone are ranged tops like Kennen and Vayne.\n\nNobody gives a shit about Klepto melees in the top lane, absolutely nobody.","replies":[{"poster":"Stephenizgod","date":"2019-11-14T18:53:30.423+0000","up_votes":1,"down_votes":0,"body":"You don't understand why Klepto is a problem, I don't know how to explain it better but I will try one last time. Klepto allows certain champions to have a gold advantage when they already have an advantage in lane or later in the game. It isn't fun when Kayle, a supposedly late game champ, has 3 of her items when you only have 2 specially after she spent the whole laning phase poking the shit out of you for free. Ezreal is another problem, he does absurd late game damage the trade off being he has a weak early game. Well Klepto allows him to play incredibly safe because he can keep up in gold. It makes the lane a boring farm lane, one that he is going to win late game.  \n\nWhen a champion is able to get around their weaknesses like that with no trade-off, that is a problem. Klepto allows champions to do that, that is why its such a problem. A gold advantage on a hyperscaling champion turns them into unstoppable monsters like Kayle.  \n\nI am not sure how you are connecting Trist and Klepto here but Trist going mid is the same thing, it removes one of her weaknesses. Trist can easily kill you in lane by just jumping on you every time, she doesn't do that because jumping into 2 people in bot lane doesn't end well. However mid lane she can free farm, she out ranges the mid laners and she can pop them quick because they are squishy. Has nothing to do with Klepto, its just the same problem that Klepto has.","replies":[{"poster":"Nêeko","date":"2019-11-22T08:53:07.291+0000","up_votes":1,"down_votes":0,"body":"Just to be clear, there is a trade-off. There is a reason that no mid laners CAN really use Klepto, it is because in a lot of cases other runes are much more suited to kill in the early game. If one were to take Klepto mid, it would lose them a lot of early kill pressure. It is really on the jungler in most cases to farm someone using Klepto because of their early game shortcomings.\n\nSame thing if you look at it top. If Kayle is poking the shit out of you then you are most likely going to be having a wave coming towards you. That is when your jungler should be looking to gank, and ultimately it would be a lot harder to defend when you don't have other runes because Kayle will lack any sort of 1v2 kill potential early, that you might have with a different set of runes (i.e. Precision primary, domination secondary sort of deal).\n\nAnother thing I want to point out it I don't really have an opinion or \"side\" of this debate, just wanted to make sure everyone understands the facts.","replies":[{"poster":"Stephenizgod","date":"2019-11-22T10:19:05.581+0000","up_votes":1,"down_votes":0,"body":"Klepto isn't OP by itself, its very minor by itself tbh, it is what it does to hyperscaling champions that makes it OP. Thats why I made it a point to repeat that the champions that use Klepto are abusing it. They are gaining more benefit from Klepto than other champions by far and its causing balance issues with their scaling.  \n\nRegardless of Klepto, Kayle is going to be weak and an easy gank no matter what. However her powerspike is so much earlier with Klepto, it reduces the impact of her weak early game because at least she will always have more gold than her opponent. Normally you can bully her, but Klepto encourages her to bully you because there is no downside. She will hit her spike earlier than she is intended to and she is nearly unstoppable.","replies":[]}]}]}]}]}]}]},{"poster":"Summoner SpeII","date":"2019-11-13T07:46:18.641+0000","up_votes":10,"down_votes":1,"body":"I would give up my klepto gp for all the klepto ranged abusers top lane\n\nBut yea omni looks troll","replies":[{"poster":"nelogis","date":"2019-11-13T08:27:54.250+0000","up_votes":2,"down_votes":11,"body":"You're not just giving up Klepto GP for it, you're giving up a champ that fully relies on it and around 10 other user that like to spec into it","replies":[{"poster":"Neriticc","date":"2019-11-13T12:02:02.965+0000","up_votes":9,"down_votes":1,"body":"So when the majority of players are picking Grasp GP, yeah the champ is dead.","replies":[]}]},{"poster":"Daddy Ants","date":"2019-11-14T11:12:21.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Summoner SpeII,realm=NA,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=0001,timestamp=2019-11-13T07:46:18.641+0000)\n>\n> I would give up my klepto gp for all the klepto ranged abusers top lane\n> \n\nGrasp GP is cancer to play against also.","replies":[]}]},{"poster":"TheUrbanKitsune","date":"2019-11-13T07:45:42.571+0000","up_votes":9,"down_votes":3,"body":"Might be kinda cool on Gnar.\nBut yeah, not looking super useful.\nJust wait until preseason though, I'm sure some high--elo Korean player will find a way to make it busted on someone.","replies":[{"poster":"On My Kill List","date":"2019-11-13T08:48:25.398+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=TheUrbanKitsune,realm=NA,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=0000,timestamp=2019-11-13T07:45:42.571+0000)\n>\n> Might be kinda cool on Gnar.\n> But yeah, not looking super useful.\n> Just wait until preseason though, I'm sure some high--elo Korean player will find a way to make it busted on someone.\n\nits random.\nyou have no control over what you get.","replies":[{"poster":"Akali is SO HOT","date":"2019-11-13T17:11:47.640+0000","up_votes":4,"down_votes":0,"body":"Out of all the champs in the game I think Gnar can use all of the keystones to at least some degree. It's bad, but just less bad on Gnar specifically.","replies":[{"poster":"TheUrbanKitsune","date":"2019-11-13T19:35:59.702+0000","up_votes":2,"down_votes":0,"body":"Exactly, thank you, that was my point.\nThis person instead chooses to question my intelligence by assuming I don't know what the keystone I'm trying to have a discussion about does.\nTo reiterate a point I made in another response, if Riot was insane enough to make it a keystone they will be insane enough to buff it until it's worth using.\nThey don't like to admit when they've made an oopsy, instead they usually just throw numerous arbitrary buffs or nerfs at the issue until it becomes an even bigger dumpster fire that requires special attention.","replies":[]}]},{"poster":"TheUrbanKitsune","date":"2019-11-13T19:29:02.300+0000","up_votes":2,"down_votes":1,"body":"uh, yeah?\nI'm aware.\nMy statement stands.\nLike I said, I personally don't think it'll be all that great.\nBut I also think if Riot was insane enough to make it a keystone they will be insane enough to buff it until it's worth using.\nAlso, Klepto was very random as well. There are a number of things in League that are RNG as fuck.\nThanks for assuming I didn't know what the fucking keystone I am discussing does though. xDD\nPretty rude and ignorant of you.","replies":[]}]}]},{"poster":"l Ryden l","date":"2019-11-13T17:51:20.244+0000","up_votes":4,"down_votes":0,"body":"We don't know until we give it a chance.\n\nThat's how all new features play out.\n\n1) Feature is announced\n2) Boards shit on new feature\n3) Some kid in Korea big-brains a build out of 'shitty feature' \n4) Korean kid nets huge wins out of build\n5) Boards player hail troll build as meta\n6) Build needs to be nerfed because it wasn't actually shitty\n\nJust saying, Glacial Augment + Ingenious hunter wasn't a thing until people saw it happen. And until they everyone said Glacial Augment was total garbage. But that never stopped Glacial Augment from finding success.","replies":[]},{"poster":"AlienPrimate","date":"2019-11-13T20:57:13.051+0000","up_votes":3,"down_votes":0,"body":"I will be trying it on Taric for top/jungle.  He gets benefit from every keystone and there are still Taric mains who argue which keystone is the best on him.  Here is the list of what I believe best to worst on him and why.  For those who don't want to take the time to read through everything, Taric can very easily proc and make at least minimal use out of any keystone.  Early game, the offensive scaling runes like dark harvest, electrocute, and arcane comet can still be useful but they will fall off late game.  Every other keystone is actually pretty good and add something to his kit.\n\nGuardian - as a support role, the extra shielding provides some safety before Taric's ult activates and the speed buff is nice to line up his stun\n\nPress the attack - PTA has no scalings so it is equally effective on everyone depending on how well they can proc it.  Taric's passive makes it extremely easy to proc and is good because his lack of offensive stats in a general build are great with its level scaling nature.\n\nAftershock - Taric scales on armor.  What more is there to say?\n\nGrasp of the undying - Grasp is great in a melee vs melee top lane matchup where he can consistently proc it to scale up his health for more late game presence as a tank.\n\nGlacial Augment - Taric struggles sticking to people because he has a self stun when casting his abilities as well as being one of only 4 champions in the entire game with absolutely no mobility.  This helps him stay on his target and its synergy with Righteous glory which is already a really good item on him is a bonus.\n\nFleet Footwork - The added sustain and speed buff is welcome in melee vs ranged matchups in a solo lane.  Taric also procs it frequently with his doubled attack speed.\n\nKleptomancy - Just look up Taric's passive. (not that this matters for the current discussion though)\n\nUnsealed Spellbook - there are other mains who use this and I can see the appeal but I just don't like it on anyone in general.\n\nThe rest of the keystones are a little less desirable but still have their use.\n\nPhase Rush - Similar to glacial augment, this makes sticking to people easier and I actually think this is better as a keystone.  The problem with it is that the rest of the sorcery choices are very lack luster for him.  The same holds true for the other sorcery keystones.\n\nSummon Aery - bonus damage and shielding from his kit while being in melee range for quick reset of it makes this pretty strong for later in the game once he has items.  If this were in a different tree, I would consider using it.\n\nPredator - this can make for interesting engages.  Taric struggles engaging fights by himself but predator makes it possible.\n\nConqueror - Taric is great in a sustained fight so stacking it up can be very strong.  However, Taric already beats most tanks because of his sustain so conqueror isn't all that appealing to him.\n\nLethal Tempo - Taric literally doubles his attack speed meaning he can get absurd attack speed with this rune.  As a max attack speed test, I had 11.4 attacks per second on him.  This isn't all that useful though because of his reliance on casting every 2 autos.\n\nHail of Blades - Same as lethal tempo\n\nElectrocute - like PTA, Taric can proc it really easily but PTA is just better on him because electrocute relies on offensive stats to scale into late game\n\nDark harvest - Probably the worst keystone on Taric for similar reasons as electrocute\n\nArcane comet - My last choice keystone.  Taric can reliably proc it, but like dark harvest and electrocute it still relies on offensive stats to scale into late game.  The reason this is below dark harvest is because as stated already, there is nothing to be desired from the entire sorcery tree.","replies":[{"poster":"EATARI","date":"2019-11-13T22:28:03.152+0000","up_votes":1,"down_votes":0,"body":"Some really good points here. This actually sounds really interesting to play, especially considering that some of the worse runes for Taric don’t appear with Omnistone. (Like DH) If Omnistone is released in its current state, I’ll absolutely try this out.","replies":[]}]},{"poster":"ITZ ICY","date":"2019-11-13T10:08:03.536+0000","up_votes":2,"down_votes":0,"body":"Idk about Omnistone, but I'm really, immensely happy that riot decided to delete klepto.","replies":[]},{"poster":"Soul Dealer","date":"2019-11-13T07:59:32.629+0000","up_votes":2,"down_votes":1,"body":"There is a champ that this could be good on: Jax. Jax benefits from more keystones then most champs so if you did a specific build tailored towards this rune it might be viable on him. As a Jax main I will be experimenting with this in norms to see if I can find a viable build.","replies":[{"poster":"nelogis","date":"2019-11-13T08:31:59.556+0000","up_votes":1,"down_votes":2,"body":"Aight imagine this\n\nYou get Aery into Comet into Afterschock into Phase rush into Predator into Fleet Footwork into Lethal Tempo\n\nDoesn't look better than just going Conq does it? Also the general sense that Jax really likes the precision tree in so him going Inspiration as the main tree is also a \"tax\" you have to pay to get the \"bonuses\" from Omnistone\n\nAgain, I don't see a reason why a champ would want to get 7 sub-optimal or straight up troll runes to maybe get 3 that kinda work on him.\n\nAlso why not just make a 4th keystone for the tree if this rune just HAS to be in the game? Why remove something people actually use for this?","replies":[{"poster":"Soul Dealer","date":"2019-11-13T11:00:40.416+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=nelogis,realm=EUW,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=00020000,timestamp=2019-11-13T08:31:59.556+0000)\n>\n> Aight imagine this\n> \n> You get Aery into Comet into Afterschock into Phase rush into Predator into Fleet Footwork into Lethal Tempo\n> \n> Doesn't look better than just going Conq does it? Also the general sense that Jax really likes the precision tree in so him going Inspiration as the main tree is also a \"tax\" you have to pay to get the \"bonuses\" from Omnistone\n> \n> Again, I don't see a reason why a champ would want to get 7 sub-optimal or straight up troll runes to maybe get 3 that kinda work on him.\n> \n> Also why not just make a 4th keystone for the tree if this rune just HAS to be in the game? Why remove something people actually use for this?\n\nIt had to be removed because ranger champs kept abusing it (just like they abuse everything) and their was little to no counterplay to them doing that. The problem was not so much kelpto as it was the inherent issue of melee champions not having enough reliable ways to punish punish ranged champions for sitting back and farming Klepto profs off of them.","replies":[{"poster":"nelogis","date":"2019-11-13T11:56:22.543+0000","up_votes":1,"down_votes":2,"body":"So the entire argument I heard for removing klepto in this post is because \"ranged tops\"\n\nif ranged tops are an issue with klepto (a little hint, they are an issue without this rune aswell) then why not... I don't know... deal with ranged tops?\n\nAlso I don't get why you are listing Rengar as an example he is melee","replies":[{"poster":"Soul Dealer","date":"2019-11-13T20:25:30.486+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nelogis,realm=EUW,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=0002000000010000,timestamp=2019-11-13T11:56:22.543+0000)\n>\n> So the entire argument I heard for removing klepto in this post is because \"ranged tops\"\n> \n> if ranged tops are an issue with klepto (a little hint, they are an issue without this rune aswell) then why not... I don't know... deal with ranged tops?\n> \n> Also I don't get why you are listing Rengar as an example he is melee\n\nI never mentioned rengar. I would love for riot to deal with ranged tops but the refuse to for whatever reason so this is what they decided to do instead.","replies":[]}]}]}]}]},{"poster":"Makarakarn","date":"2019-11-14T22:31:53.738+0000","up_votes":1,"down_votes":0,"body":"I mean I never really liked Klepto, but I agree this rune is pretty pointless.","replies":[]},{"poster":"Minimac2000","date":"2019-11-14T21:56:18.710+0000","up_votes":1,"down_votes":0,"body":"You can't get aftershock or predator from it but yeah, basically noone","replies":[]},{"poster":"Akali Prime","date":"2019-11-14T21:40:10.609+0000","up_votes":1,"down_votes":0,"body":"{{champion:235}} maybe? since shes an adc/supp hybrid, can cast  on allies, has ap scalings, etc.","replies":[]},{"poster":"Posui Gart","date":"2019-11-13T14:51:47.049+0000","up_votes":1,"down_votes":0,"body":"Garen is ok with anything, now that his E is on-hit and scales with AS\nUrgot can also use most of them fine. Sure, he would be bad at using Hail of blades/Lethal tempo, but not to the point of being useless with them\nPerhaps some other melee AA champions can use that\n\n> Think about it, you leave Ezreal in the dirt, you remove a GP / Lucian / Sona / Draven / Fiora / Illaoi / Udyr / Nasus playstyle and for WHAT?!\nFor this piece of garbage nobody would want to use.\n\nIts not \"ok here is an interesting rune, what should we remove to put it in?\"\nIts \"klepto must be removed, what should we put in instead so that inspiration is not left with 2 keystones\"\nBecause klepto is a mistake and should have never existed.\nAnd Ezreal deserves to be in dirt for some time. A safe, long-range, mobile ADC should be weak in some other point","replies":[{"poster":"Champion Chrome","date":"2019-11-14T00:41:19.974+0000","up_votes":1,"down_votes":0,"body":"Ez has one of the weakest early games of any adc as well as one of the weakest late games of any adc, because he takes mana items early on and gets out-scaled by crit adcs late. He's just a much worse Kai'sa, but I still love him.","replies":[{"poster":"Daddy Ants","date":"2019-11-14T11:15:14.785+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Champion Chrome,realm=NA,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=00090000,timestamp=2019-11-14T00:41:19.974+0000)\n>\n> Ez has one of the weakest early games of any adc as well as one of the weakest late games of any adc, because he takes mana items early on and gets out-scaled by crit adcs late. He's just a much worse Kai'sa, but I still love him.\n\n?\n\n>  Ez has one of the weakest early games of any adc\n\nI disagree.\n\nConsidering he can farm at over 2x the range of any other ADC, runs kleptomancy and has a low cooldown blink that has it's cooldown reduced by hitting things with Q.\n\nHis early game before first recall is bad yes, but after that he's fine early.\n\n{{champion:67}} {{champion:29}} {{champion:96}} are what I call weak in lane.","replies":[{"poster":"Champion Chrome","date":"2019-11-14T12:58:31.071+0000","up_votes":1,"down_votes":0,"body":"he's got range and poke, but he can't just go and fight. he relies on extended poking periods to lower the opponent to a range where he can all-in. supports help, but on his own he is on the weak side. I agree with the other adcs you listed, though.","replies":[]}]}]}]},{"poster":"preternatural","date":"2019-11-14T11:25:10.123+0000","up_votes":1,"down_votes":0,"body":"um\ni can actually think of some wild shit you can do on ekko with omnistone lol.","replies":[]},{"poster":"Hi im 12","date":"2019-11-14T01:59:26.417+0000","up_votes":1,"down_votes":0,"body":"seems like something that only junglers will use, seems good on warwick tho","replies":[]},{"poster":"Metal Janna","date":"2019-11-14T01:42:56.836+0000","up_votes":1,"down_votes":0,"body":"> What champion in this game actually wants Electrolute / Phase Rush / Afterschock at the same time?\n\nOrianna.","replies":[]},{"poster":"hazerddex","date":"2019-11-13T19:43:07.212+0000","up_votes":1,"down_votes":0,"body":"it's a lazy effort to replace kelpto  they didn't have any idea's so they just put in a random button instead. \n\nthis doesn't help champions that actually need it either.\n\n{{champion:81}}  is dead in season 10","replies":[{"poster":"Champion Chrome","date":"2019-11-14T00:38:38.584+0000","up_votes":1,"down_votes":0,"body":"he gets new conq for better trades... but he'll most likely need some buffs. I personally would like a new passive because although his passive is not bad, it doesn't synergize with his kit as well as most other champs. I'd be willing to trade ranged IBG for this (prefer triforce anyway). Still, he was already kinda weak, and his expensive build will drag him down more without klepto gold.","replies":[]}]},{"poster":"thaBeast","date":"2019-11-14T00:24:00.222+0000","up_votes":1,"down_votes":0,"body":"i think its good on champs that have lots of viable key stones or a champ that doesnt have any good key stone but i can't think of any rn","replies":[]},{"poster":"Saezio","date":"2019-11-14T00:11:13.203+0000","up_votes":1,"down_votes":0,"body":"Maybe it's riot's way to detect inters and trolls. If you pick the rune you are banned.\n\n./wishfullthinkingintensifies","replies":[]},{"poster":"Sir Gusi","date":"2019-11-13T20:31:24.699+0000","up_votes":1,"down_votes":0,"body":"{{champion:103}} {{champion:36}} {{champion:427}} {{champion:223}} {{champion:17}} {{champion:1}}  are champs im going to try it on","replies":[]},{"poster":"LightswornLance","date":"2019-11-13T20:11:14.448+0000","up_votes":1,"down_votes":0,"body":"Pantheon can use pretty much all those keystones, ryze kinda can too.","replies":[]},{"poster":"Jaquie et Michel","date":"2019-11-13T20:00:05.696+0000","up_votes":1,"down_votes":0,"body":"{{champion:61}}","replies":[]},{"poster":"Sałem","date":"2019-11-13T19:05:25.463+0000","up_votes":1,"down_votes":0,"body":"TF can use it and proc almost all of them and have a good use. has stun slow to prock aftershock electrocute etc. That is all I can think of tbh.\nOnly few people attempted to test it on high level of play on pbe and some pros think that tf is the only one that can benefit most of it.","replies":[]},{"poster":"TheBigBoyMcCoy","date":"2019-11-13T18:42:45.300+0000","up_votes":1,"down_votes":0,"body":"Quinn would dominate with this keystone. It's been discussed multiple times that this would be very beneficial to her.","replies":[]},{"poster":"Shynana","date":"2019-11-13T16:55:59.978+0000","up_votes":1,"down_votes":0,"body":"man i can see a future buff later on being, \npatch 10.3 Omnistone grants additional effects on selected rune.\nAftershock, gain a shield according to 3% of your max health\nAery, Hitting an enemy champion grants you or closes ally a shield based on damage of aery.\nGrasp, gain 15 hp\nPress of the Attack, When procs, no longer does scaling damage. (instead of 8% will be 12% when proc at any point of the game).\nElectrocute, when proc deal damage to other enemy champions within a 200 range radius, only 25% of the damage will be done to other champions based on the damage that was proc of the first target.\nPhase rush, 1 ability or basic attack will proc phase rush.\nFleet,  movement speed duration doubled, critical strikes double the healing effectiveness.\nPredator, when an ability would be used to deal predator damage, gain movement speed to half that amount for 1.5 seconds.\nGlacial, single target abilites will apply glacial as if you auto an enemy champion\nLeathal Tempo, 110% attackspeed instead of the scaling attackspeed at any given point of game.\nHail of blades, in a single auto will do damage as if it was 3 auto attack. (you get 3 hail of blades proc) Melee champions - 1 auto damage done, 2 and 3 damage reduced by 60%\nrange 1 auto damage done, 2 and 3 reduced by 80%\nGuardian - can proc on yourself, but only shielding of that of 25%, and the movment speed haste 10% of it.","replies":[]},{"poster":"NaughtyWord","date":"2019-11-13T16:38:09.350+0000","up_votes":1,"down_votes":0,"body":"I think a few hybrid champs might make use of it.  I mean champions that can build both AP and AD reliably, maybe {{champion:96}}?\n\n\nPersonally, I think it should be similar to unsealed spellbook, where you can change what keystone you have on the go depending on the game situation.  Even then, I don't see it being widely used.","replies":[]},{"poster":"Sirsir","date":"2019-11-13T14:55:19.434+0000","up_votes":1,"down_votes":0,"body":"Memestone\n\nIt will be used by people who aren't really trying, show up in a few highlight videos where it gave an amazing combo, and inevitably break the game when a pro finds a champ that can actually use almost ALL the keystones well and is suddenly a nightmare out of nowhere (Urgot?)","replies":[{"poster":"Summoner SpeII","date":"2019-11-13T16:19:25.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirsir,realm=NA,application-id=3ErqAdtq,discussion-id=RRx2yi2s,comment-id=000a,timestamp=2019-11-13T14:55:19.434+0000)\n>\n> Memestone\n> \n> It will be used by people who aren't really trying, show up in a few highlight videos where it gave an amazing combo, and inevitably break the game when a pro finds a champ that can actually use almost ALL the keystones well and is suddenly a nightmare out of nowhere (Urgot?)\n\nwhat happens when u get the guardian rune and ur jungler is far away lol","replies":[{"poster":"Sirsir","date":"2019-11-13T16:25:41.186+0000","up_votes":1,"down_votes":0,"body":"As top or mid, you're locked out of a keystone for 45 (?) seconds.\n\nAs jungler you start looking for dives. \n\nAs support... well...","replies":[]}]}]},{"poster":"BLIGHTBRINGER","date":"2019-11-13T14:24:12.207+0000","up_votes":1,"down_votes":0,"body":"I agree with your point however after giving a deep thought I started to think that maybe someone like Fiora/Camille could use it.\n\nBecause Currently both Fiora and Camille abuse Kleptomancy/Grasp of the Undying/Conqueror/Press the Attack\n\nThere are certain Champs who can be good with this who can always stay on top of their targets.\n\nBut at the end of the day this Rune is just pointless. They couldn't think of any Rune Concepts at that time that could replace Kleptomancy and remain healthy without causing another game impacting meta.","replies":[]}]}