{"poster":"nelogis","date":"2018-02-12T18:49:23.119+0000","title":"(Champion concept: Joke) RNGesus the lord of dice!","subforum":"Memes & Games","up_votes":23,"down_votes":1,"body":"Hello ladies and gentleman, Nunu one tricks and Lissandra mains!\n\nI wholeheartedly welcome you (other than Mark, fuck you Mark, yes I still remember it) to my totally serious champion concept!\n\nBefore I get started I would like to remind you that, since the last accident that had absolutely nothing to do with me, tomatoes are prohibited during the shows.\n\nNow without further ado let&#039;s get right into the splash art and lore shall we!\n\n#Splash art\n\nhttps://ih1.redbubble.net/image.66512091.3091/flat,1000x1000,075,f.u1.jpg\n\n#The Lore\n\nIt was a dark time in Runeterra (relatively more dark, yes the world in Runeterra is dark almost all the time but at that time it was even more dark with like shadows&rsquo;n shit) when the Morellonomicon was written. The writer has been long forgotten but the book has prevailed through the onslaught of shadows. These unholy written pages were the solution to stop the maddened maddening madness (now that&#039;s a tongue twister amirite! Aight I&rsquo;m going to stop this live-in between commentary) that has lived for far too long. Fight fire with fire that was the idea (what a stupid idea... yeah sorry that was the last one I promise)\n\n_From the diary of a long forgotten adventurer:_\n\n**Day 1:** Alright so I&#039;m heading off to find the book! Got the I-hextech flashlight to explore caves and I packed some supplies, nothing too fancy just some cheese sandwiches, chicken sandwiches, pork sandwiches, molten cheese sandwiches, roast beef sandwiches, double pork with molten cheese sandwiches, BBQ sandwiches, sandwich sandwiches, quadruple cheese sandwiches and an apple. \n\n**Day 2:** I ran out of sandwiches\n\n**Day 4:** Some guy sold mushrooms for a price I couldn&#039;t say no to (and I was starving... so....). I don&#039;t know why but these things really keep me away from feeling any hunger! At least that&#039;s what that red lizard told me.\n\n**Day 7:** I can feel the book. It calls to me. But my senses have been betraying me lately. This could also be a trick to kill me. Who knows what measurements were taken to protect the book from wrong hands.\n\nLater edit: AAY LMAO that frog can talk.\n\n_Note to me: Don&#039;t buy mushrooms from that little rat again._\n\n**Day 16:** It screams, I can&#039;t ignore it anymore it screams too loud! I was told the book resisted the madness but I start to question if it resisted or swallowed it whole.\n\n**Day 27:** I fell into a dark pit that is dark. It&#039;s really dark here and I can barely write this down. Point is, I can&#039;t see shit (No seriously I stood in shit and couldn&#039;t see it) and the batteries on my I-hextech flashlight ran out. Playing with it the whole trip wasn&#039;t my best idea but I regret nothing the different color modes from the flashlight were just too cool.\n\nAlso I think I broke my leg when I fell down. I&#039;m no doctor by any means but I think this white thing shouldn&#039;t come out but again who am I to know stuff like this.\n\n_Note to me: These mushrooms weren&#039;t that bad of an investment after all_\n\n**Day 43?:** I have no idea if this is the actual book or the mushrooms playing tricks again. Either way there is also a naked man rubbing toothpaste into his face right next to the book so I&#039;m guessing mushrooms.\n\nLater edit: Well I was right one of them was an imagination. Unfortunately it was the book... whoever reads this don&#039;t ask.\n\n**Day who gives a crap:** I don&#039;t know how long I have been wandering in this cave or if I actually just didn&#039;t walk in a circle this whole time. Anyway I&#039;m out of mushrooms and the whispering hasn&#039;t stopped. When I try to listen to it they just stop talking as if they knew I&#039;m trying to listen but if they know that I know that they know then that would be a situation where I could know that they know that I know that they know which would lead to a position favorable to me.\n\n_The next part is hardly readable and has no indication on which day it was added (The part was also very vulgar so I went ahead and censored everything and no I&#039;m not going to post the uncensored part so don&#039;t even ask):_\n\nHoly #### filled #### #### stuffed up my #### with #### #### and their #### hanging out! What the actual #### is this #### abomination of a #### #### that came out of this #### god #### forsaken #### book!\nHis #### head is a #### slot machine with #### #### as eyes and a #### as his ding dong!\n\nMorello #### was supposed to safe #### us! Now there is just a #### crawling #### ghost infecting and destroying everything upon #### touch!\n\nLater edit: I think this is my last entry, the monster has seen me and.... and it wants to play....\n\nTell my wife that she is a terrible sandwich maker\n\nMiroslav Bienski Stroflofski Iknomikrinov\n(Hey that&#039;s his name! Not so forgotten after all ey?)\n\nIf I had to guess then I think the idea &quot;fight fire with fire&quot; only works if your fire is way bigger than the enemies fire.\n\nNow that was an interesting lore if I say so myself! (Interesting as in &quot;what the actual fuck&quot; type of thing you kno). Don&#039;t leave just yet though! Now we get to the abilities and I&#039;m going to tell you right away you don&#039;t want to miss that!\n(In case you actually somehow miss it you can just scroll upwards a few times and re-read it. To scroll upwards place your hand comfortably above your mouse (preferable not a biological one). Then proceed to place your middle finger on top of the scroll thingy that can be located around the middle area of your mouse. Pull your finger backwards (or vice versa to scroll upwards) while maintaining a hard enough grip so the scroll thingy scrolls. Take your finger away from the scroll thingy and repeat until you are on your desired place to start re-reading).\n\n#Abilities:\n\n**Passive: **\n**Random Overload!**\n\nYour abilities have a chance to recast themselves up to a maximum of 4 times.\n\n1. Cast: 100% (ability is casted)\n2. Cast: 50%\n3. Cast: 25%\n4. Cast: 12.5%\n\n_Note: So for example you ult as Veigar then there is a 50% chance a second one is fired right off the bat then a 25% chance for a third one and lastly a 12.5% chance for a forth one._\n\n**Randomize attributes!:**\n\nRNGesus starts the game with 0 AD / 0 Armor / 0 MR.\nThen 130 points are randomly split towards these stats.\n\n**Q: Slot machine!**\nCost: 20 to 80 mana (random)\nCooldown: 15/13/11/9/7 seconds\n\nRNGesus plays a round on the slot machine and enhances his next 3 auto attacks based off the outcome. This effect works multiplicative with **Random Overload**\n\nFirst outcome decides the effect:\n\n- Overheat (30% chance): Deal an additional 20/30/40/50/60 (+40% AD) physical damage.\n- Galvanized (30% chance): Gain 75% life steal\n- Iced (30% chance): Slow for 1 seconds for 10%\n- Gold (10% chance): Gain 50 gold\n\nSecond outcome decides the strength of the effect:\n\n- Bronze (60% chance): The effect x 0.5\n- Silver (30% chance): The effect x 1\n- Gold (10% chance): The effect x 2\n\n_Note: So you just rolled Iced, Gold and 3 casts that means the next 3 auto attacks have the effect: Slow enemies for 6 seconds for 60% also I should maybe mention that he is ranged.... yeah that might be an important detail_\n\n**W: RNGrenades!**\nCost: 30 to 70 mana (random)\nCooldown: 10/9/8/7/6 seconds\n\nRNGesus throws out 2 RNGrenades.\n\nThey either:\n\n- Explode right away dealing 60/80/100/120/140 (+60% AP) magic damage\n- Connect and create a wall that enemies can&#039;t pass but allies can walk through gaining 10/15/20/25/30% movement speed\n- Connect and create a portal that everyone can use to travel between them\n\n**E: Role the dices!**\nCost: 50 to 100 mana (random)\nCooldown: 15/13/11/9/7 seconds\n\nRNGesus throws 2 dices into the air, catches them and rams them together to release the RNG inside of them dealing 20/50/80/110/140 (+50% AP) OR (+70% AD) magic OR physical damage in a line in front of him.\n\nEnemies struck either:\n\n- Get stunned for 1.5 seconds\n- Gain **Let me take the wheel** for 4 seconds\n- Get silenced and blinded for 2 seconds\n\n**R: RNG for everyone!**\nCost: 0 to 150 mana (random)\nCooldown: 50 to 150 seconds (random)\n\nRNGesus channels the RNG inside him and releases it in a giant explosion dealing 100/300/500 (+60% AP) OR (+80% AD) magical OR physical damage. Struck champions gain **Let me take the wheel** for 6 seconds (works additive with **Random Overload**)\n\n**Let me take the wheel:**\n\n- Auto attacks have a 50% chance to hit the wrong target\n- There is a 50% chance that the wrong spell gets casted.\n\n#Playstyle\n\nAs one of the first champions classified as a full tank assassin engage control back-line cc fighter ranged ADC artillery mage disengage frontliner lane bully mobile battlemage healer disrupter juggernaut instigator skirmisher kite mage aggro-control tank jungler true damager tank shredder lock down mage RNGesus fills every niche in the game if you are lucky enough. \n\nA good RNGesus will ask himself at every start of the game what to build. It is risky to go a single damage rout since it isn't guaranteed that you get the scaling off of that damage route or not. Going tank can also be iffy if you get 110 base AD and 10 of each resistance.\n\nWith that he has a healthy back and forth since you and the enemy won't know what the hell to build to counter eachother.\n\nOh baby if this doesn&#039;t sound like an ineractive and fun champion to play as and against then I don&#039;t know what does! You know what&#039;s my personal favorite? When you are playing against Karthus and he casts ult instead of Q! \n\nAlso this champion will only be obtainable throught the lootbox system in League!\n\nWell that was it folks! Hope you enjoyed your stay here, enjoyed the show and most importantly, enjoyed the champion concept!\nThis... came to a relative abrupt ending huh... wait you.. you are still here well I uhhh.... don&#039;t have anything to show you uhh...\n\nhttps://memegenerator.net/img/instances/500x/80480252/any-questions.jpg\n\nAight k thx bye!\n\n#The End\n\nOh before I forget! If you enjoyed this concept you might want to check out my other concepts (they are done on a more serious note). Yes I like to timmy my jimmy jhonsons but who doesn&#039;t like to do that come on. \n\nWish everyone a great day other than you Mark.\n\n**Champion concepts:**\n\n[Champion concept (Battlemage): Mug&#039;gri the hopes End](https://boards.na.leagueoflegends.com/de/c/skin-champion-concepts/zrgkg4LE-champion-concept-battlemage-muggri-the-hopes-end)\n[Champion concept (Juggernaut): Beauty de Morknaut](https://boards.na.leagueoflegends.com/de/c/skin-champion-concepts/cge9TksE-champion-concept-bruiser-diver-beauty-de-morknaut)\n\n**Rework concepts:**\n\n[Rework concept: Mordekaiser the iron revenant](https://boards.na.leagueoflegends.com/de/c/skin-champion-concepts/Bh1zovE1-rework-concept-mordekaiser-the-iron-revenant)","replies":[{"poster":"meatiestmacroc","date":"2018-02-12T18:53:50.778+0000","up_votes":16,"down_votes":0,"body":"It's all fun and games until you see a guy with 130 base AD","replies":[{"poster":"Skins Project","date":"2018-02-13T00:17:02.880+0000","up_votes":1,"down_votes":2,"body":"That'd be bad tho sorta...\n\nMost champions have about 50-60 base ad and about 50% resistance from base armor. \n\nSO 130 reduced by 50% is about 65 dmg, while you still do 50-60 dmg.\n\nI'm presuming the abilities are based off of bonus ad not base btw.\n\nWhen you factor in minions and w/e it's about balanced dmg wise.\n\nThen when there's ganks and whatever it's basically bad bad bad.","replies":[]}]},{"poster":"Voidzilla","date":"2018-02-13T06:42:25.689+0000","up_votes":6,"down_votes":0,"body":"This right here is the standard that all Champions should be designed around - both fan-made and official concepts. I see absolutely no flaws with this, as this is as perfect a Champion - no - _any _ MOBA character gets. Visually, thematically, and gameplay-ly a 10/10.\nPlus that lore. So engaging, so nuanced, so many questions answered about League lore yet still leaves much to be excited about. My biggest take away is that Runeterra does indeed have roast beef sandwiches. I've been wondering about that since this game was released.\nYou should send this as part of your portfolio to Riot. I'm sure they'll hire you right away to create masterpieces like this.\n\nAlso, is that picture of what looks like Shrek RNGesus's release skin? If so, then I'm 92.88-289% (random) sold on this idea.","replies":[]},{"poster":"Dorans Pants","date":"2018-02-13T00:47:48.074+0000","up_votes":6,"down_votes":0,"body":"wow with this champ I could play league and Hearthstone at the same time.\n{{sticker:fiora-cool}} neat","replies":[]},{"poster":"Mhihnj","date":"2018-02-13T04:35:52.748+0000","up_votes":5,"down_votes":0,"body":"i want karthus to have this passive. Imagine casting 4 ults in rapid succession.","replies":[{"poster":"nelogis","date":"2018-02-13T07:31:48.953+0000","up_votes":3,"down_votes":0,"body":"or Ziggs turning the map into a warzone","replies":[]}]},{"poster":"Master Noct","date":"2018-02-13T05:11:18.256+0000","up_votes":4,"down_votes":0,"body":"_*health vanishes multiple times*_\n\nWhat the **fuck** is going on?!","replies":[]},{"poster":"MuffledGarbage","date":"2018-02-13T16:37:50.285+0000","up_votes":1,"down_votes":0,"body":"To be honest, the passive could be interesting if it was set on a damage-amp spell.\n\nLike a skillshot that could recast itself if it hit's a specific part of an enemy(think Fiora's passive in terms of parts)","replies":[]},{"poster":"E Man forever","date":"2018-02-13T16:07:44.325+0000","up_votes":1,"down_votes":0,"body":"I would change the base stats on his passive where he should be guaranteed a certain amount of base stats and then add an RNG bonus","replies":[]},{"poster":"Mordepool","date":"2018-02-13T05:08:40.101+0000","up_votes":1,"down_votes":0,"body":"https://slm-assets2.secondlife.com/assets/10945312/thumbnail/58203882.jpg?1421596351","replies":[]},{"poster":"Evewynn","date":"2018-02-13T01:24:58.667+0000","up_votes":1,"down_votes":0,"body":"This is my new lord and savior.","replies":[]},{"poster":"D3m37r1","date":"2018-02-13T00:54:59.080+0000","up_votes":1,"down_votes":0,"body":"There should be some bad RNG too. Also your runes  should be randomized too .","replies":[]},{"poster":"Netorare","date":"2018-02-12T22:52:00.124+0000","up_votes":1,"down_votes":0,"body":"This champion would be a lots of fun but too bad people whine about rng in a MOBA, yes card games in general i get it, MMORPGS i get it..but in a MOBA trash like seriously...\n(riot please make this champion real)","replies":[]},{"poster":"wildfox99","date":"2018-02-12T21:47:14.732+0000","up_votes":1,"down_votes":0,"body":">W: RN-Grenades!\nCost: 30 to 70 mana (random)\nCooldown: 10/9/8/7/6 seconds\n\n>RNGesus throws out 2 lucky grenades.\n\n>They either:\n\n  >  Explode right away dealing 60/80/100/120/140 (+70% AP) magic damage\n    Connect and create a wall that enemies can't pass but allies can walk through gaining 10/15/20/25/30% movement speed\n    Connect and create a portal that everyone can use to travel between them\n\n\nwhat if they would either do damage to both allies and enemies or buff them (like heal,bonus stats,idk),so everyone stands on them and if you are lucky,you get the buff instead of the damage/enemies get the damage instead of the buff,either you fked up","replies":[]}]}