{"poster":"Mînks","date":"2016-01-13T11:25:37.651+0000","title":"Summoners Inn Teamspeak Cup #2 | 970 vs HKD | Achtelfinale [German]","subforum":"Streams & YouTube","embed":{"description":"League of Legends| In diesem Video zeige ich euch Achtelfinale des Summoners Inn Teamspeak Cups #2 aus meiner Sicht (Toplane Poppy für Team 970). |Community| Wenn euch das gefällt und Ihr mehr sehen wollt, könnt Ihr mir gerne auf Diversen Plattformen folgen.","url":"https://www.youtube.com/watch?v=PCqQgUgm9M4","image":"https://i.ytimg.com/vi/PCqQgUgm9M4/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Yo Leute, ich habe das Achtelfinale vom Summoners Inn Cup #2 hochgeladen. Das Video ist aus der Sicht von mir (Poppy Toplane f&uuml;r 970). Viel Spa&szlig; beim schauen :)","replies":[{"poster":"ADONIS nyx","date":"2016-01-13T12:33:57.137+0000","up_votes":2,"down_votes":0,"body":"Das FB in der 7 min auf der dc Kalista hätten die verhindern können man kann last hitten udn dann ein S drücken und mit A den last hit machen dadurch zielt man und stoppt eigentlich wäre es so dann ein Execute geworden ;) spielt ihr so oder habt ihr noch Leute im Hintergrund?","replies":[{"poster":"Mînks","date":"2016-01-13T16:46:56.197+0000","up_votes":1,"down_votes":0,"body":"Was genau meinst du mit \"Leute im Hintergrund\"?^^ Das kann man in mehrere Sachen interpretieren^^","replies":[{"poster":"ADONIS nyx","date":"2016-01-13T17:10:05.829+0000","up_votes":1,"down_votes":0,"body":"Leute im Hintergrund einen subspieler Trainer Analyst Coach? Das meine ich mit Leuten im Hintergrund {{champion:17}}\nOder dachtes ich emine Familie Verwante Freundin {{summoner:3}} ","replies":[{"poster":"Mînks","date":"2016-01-13T18:04:25.328+0000","up_votes":1,"down_votes":0,"body":"Dachte mir schon das du das meinst, aber ist ja nie sicher bei so leicht mehrdeutigen Bezeichnungen :D\n\nÄhm ja ich z.B. bin nur Substitute bzw habe das Team eigentlich schon verlassen vor längerer Zeit. Aber bis ich ein neues passendes Team gefunden habe helfe ich den Jungs noch aus.\n\nNe Art Managerin z.B. haben die Jungs (nichts weltbewegendes^^), Coach z.B. haben die keinen.","replies":[{"poster":"ADONIS nyx","date":"2016-01-13T20:03:58.093+0000","up_votes":1,"down_votes":0,"body":"hi ach so ok wenn ich dich fragen darf was ist deine Mainrolle? (die ist aus den Videos nicht mir so ganz schlüssig) aber das ist doch gut das ihr euch versteht troz deines austritts :)","replies":[{"poster":"Mînks","date":"2016-01-14T12:33:52.106+0000","up_votes":1,"down_votes":0,"body":"Meine Mainrolle ist Ad-Carry aber alles in allem bin ich ein Allrounder. Ad-Carry ist aber mit Abstand die stärkste Rolle von mir.\n\nJa man muss sich ja zum Glück nicht immer im Bösen trennen :)","replies":[{"poster":"ADONIS nyx","date":"2016-01-14T18:20:14.802+0000","up_votes":1,"down_votes":0,"body":"Ach so ok das klingt cool AD-Curry :D","replies":[]}]}]}]}]}]}]}]}