{"poster":"Averth","date":"2019-02-19T04:01:26.271+0000","title":"LRF Contest || Taking a Breath","subforum":"FanFiction","up_votes":1,"down_votes":0,"body":"Taking a Breath\r\n\r\nThe Lunar Revel, a sacred event for the Ionian people to celebrate a New Year as well as acting as a warding ceremony against some of the more malignant spirits. This year the city of Fae&rsquo;lor, a coastal town located on a small island slightly off the mainland, had been chosen to host the prestigious event. The once quaint town now shimmered with a ruby glow as the streets bustled with locals and foreigners alike, all of which were enraptured by the sheer variety of different stalls lining the walkways. It truly was a time for all to celebrate&hellip; well, all but one.\r\n\r\n ***\r\n\r\nThe cacophonous sounds of laughter and music once again forced Irelia&rsquo;s eyes open to gaze upon the glimmering town. She had fled to the outskirts of the city in order to escape the ceaseless noise and perhaps practice some meditation, however, even atop the rolling hills at the borders of the settlement the noise felt no duller than when she had been directly among the festivities. With a scowl Irelia attempted once more to calm her mind, blades idly drifting around her seated form like leaves in a soft autumn breeze.\r\n\r\nFrom her actions one might come to the conclusion that Irelia had no love for the traditional celebration of the Revel. This, however, was not the case. There was once a time when Irelia would partake in the festival with as much excited jubilation that the rest of the townspeople displayed. The Noxian incursion into Ionia had put a swift end to those times. Even now, after having long since repelled the invaders, she could feel the cold tendrils of anxiety clawing at the edge of her mind. Her blades began to quiver almost imperceptibly at the thought of the Noxians, as though a predator were preparing to pounce on its unsuspecting prey. Noticing her thoughts were beginning to slip, Irelia swiftly reined them back to focusing on her meditation. Karma had warned her on dwelling too long on such troubling thoughts.\r\n\r\nKarma. The scowl on Irelia&rsquo;s face deepened at the thought of the priestess. That woman&rsquo;s incessant nagging was the whole reason she was stuck here in the first place. \r\n\r\n&lsquo;You need to take some time off to recuperate your body and your spirit.&rsquo; she recalled Karma telling her. Irelia nearly scoffed at the thought of those words. Though they were usually at odds with one another over how to deal with the looming, ever-present threat of Noxus, Irelia had, begrudgingly, come to develop a sliver of admiration for her rival. Even if Karma&rsquo;s insistence on finding a pacifistic solution for everything made Irelia want to strangle her on most days, she could not deny that Karma acted in ways she believed would be best for the people.\r\n\r\nWith a defeated sigh, Irelia lay herself back against the lush grass of the hill. It was increasingly apparent to her that her mind was far too active tonight to allow for any worthwhile meditation. A quiet groan escaped her lips as she suddenly became aware of the stiffness in her shoulders and neck. Perhaps there had been a&hellip; small amount of merit in Karma&rsquo;s advice.\r\n\r\nAn earth-shattering boom forced Irelia&rsquo;s attention towards the heavens. The fireworks display had commenced. The once blank canvas of the night sky was now painted with vibrant explosions of colour followed by an eruption of cheering from the amazed onlookers. Even Irelia could not keep the faintest of smiles from her face at the sight of the majestic spectacle. If she remembered correctly, Jinx was always in charge of the fireworks show and every year the loose cannon would attempt to outdo herself. This year proved no exception. Eventually, as the fireworks began to die down, Irelia raised herself up to her feet and began to slowly trek back towards the town. Maintaining a sour mood was doing her no favours. Perhaps there was some enjoyment to be had out off tonight after all. \r\n\r\n&lsquo;And besides,&rsquo; she thought to herself as the music from the town began to grow louder, &lsquo;it&rsquo;s been such a long time since I danced for myself.&rsquo;","replies":[]}