{"poster":"giobbotta","date":"2015-07-02T08:53:06.836+0000","title":"virus / riot bot system","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ciao  a tutti, \r\n\r\nsono  un giocatore assiduo delle 3v3 e ultimamente ci sono solo bot automatici in entrambe le squadre; mi spiego meglio:\r\n\r\nnon si tratta di troll o giocatori estremamente incapaci ma di vere e proprie AI. Vengono scelti infatti sempre i campioni in free rotation, non parlano mai, spesso non comprano item,  vanno dritti di attacco bianco e qualche spell. Sono una brutta copia dei bot livello principiante che si affrontano nel CO-OP vs AI.\r\nUn tizio in game mi ha detto che &egrave; un sistema della riot random per testare le abilit&agrave; dei giocatori, ma mi sembra una gran cazzata. Qualcuno pu&ograve; darmi delucidazioni in merito?si tratta di un virus sistemico? Praticamente non si pu&ograve; pi&ugrave; giocare una 3v3 \r\n\r\ngrazie\r\nbotta","replies":[{"poster":"italianotv","date":"2015-07-03T21:53:52.249+0000","up_votes":1,"down_votes":0,"body":"ok anche io li incontro, sono smurf li odio rendono la partita senza gusto, all'inizio ne abusavo, ho smesso mi sentivo uno schifo, vanno sotto torre entrano e escono sui 0.40 0.50 min e scrivono solo Gj ( g maiuscola ) ps pensavo erano nabbi, un moi amico mi ha detto che erano bot programmati '' mezzo minion''","replies":[{"poster":"giobbotta","date":"2015-07-06T09:06:33.442+0000","up_votes":1,"down_votes":0,"body":"ho capito ragazzi, giocare ad un videogame = divertimento. Fino ad un pò di tempo fa erano davvero pochi questi account smurf, ora ci sono nel 99% delle partite. \n\nComplimenti alla community più bella e adulta del panorama videoludico attuale. D'altronde c'era da aspettarselo.. il comportamento di una community di videogiocatori rispecchia il comportamento di una community reale.... a buon intenditor poche parole\n\nsaluti\nGio","replies":[]}]},{"poster":"UnknownEV","date":"2015-07-02T08:55:43.538+0000","up_votes":1,"down_votes":0,"body":"Sono bot per far livellare l'account al 30 o.o\ncapita anche nelle dominion (tirano dritto stanno fermi) ecc..","replies":[{"poster":"giobbotta","date":"2015-07-02T10:41:38.608+0000","up_votes":1,"down_votes":0,"body":"ho capito ma per livellare c'è la modalità apposta co-op vs IA. Cioè o faccio partire ranked o niente?\n\nboh","replies":[{"poster":"UnknownEV","date":"2015-07-02T10:48:07.123+0000","up_votes":1,"down_votes":0,"body":"eh? xD\nTi ho appena detto che sono degli account bot, li mettono li per ricevere più punti... gioca con gli amici e via.","replies":[{"poster":"italianotv","date":"2015-07-03T21:54:54.873+0000","up_votes":1,"down_votes":0,"body":"le coops vs ia danno meno pi e exp, hai ragione caro ^^","replies":[]}]}]}]}]}