{"poster":"HC Rocket","date":"2015-03-16T19:42:38.536+0000","title":"[Idee] LoL-Map auf iPad (Tablet)","subforum":"Karten & Spielmodi","up_votes":6,"down_votes":1,"body":"Guten Abend Beschwörer,\n\nheute möchte ich euch eine Idee präsentieren, die mir schon lang im Kopf rumschwirrt und ich auch schon einige Male erwähnt gesehen habe. Anstatt der kleinen Minimap soll man mit dieser Version, der Map, nun wirklich den Durchblick erhalten. Es handelt sich um die Minimap fürs iPad (Tablet). Wie Watch Dogs es schon probiert, so finde ich, wäre es an der Zeit, dass ein Spiel wie LoL gern nachziehen könnte.\n\n**Hier zunächst ein Beispielbild zu watchdogs:**\nhttp://www.overtice.com.br/wp-content/uploads/2012/06/Watch-Dogs-Tablet-1.jpg \n\nIn meinen Augen stellt dieses Plattform übergreifende Spiel einen echt guten Vorreiter dar. Es gibt schon einige Apps für LoL, welche es einem ermöglichen, über das Handy mit den Freunden zu schreiben oder zu sehen was sie machen oder ich weiß noch früher, als die ersten Jungle-Timer Apps das Tageslicht erblicken. Ich möchte mit meinem Vorschlag euch zu einer Diskussion anregen: Was haltet ihr persönlich, von einer Live-Map auf Tablets?\n\n**Hier ein paar Features, die jene Map enthalten sollte:**\n\n* in-Game Karte (live)\n* KDA Anzeige\n* Spielzeit\n* FPS\n* Pings (+Sounds)\n* außerhalb des Spiels (Chatfunktion, Masteries bearbeiten etc.)\n* Ganz nach dem Motto: \"As Simple as ABC\", die Karte aus dem Bildschirm schieben und schon erscheint sie auf dem iPad (Tablet).\n...\n\nHabt ihr vielleicht noch Ideen, wie mahn diese Liste erweitern könnte oder positives oder negatives an dieser Idee auszusetzen, dann freue ich mich schon auf Eure Kommentare.** Ich bitte euch: Nicht flamen, keine unnötigen Kommentare etc. (hebt euch das für LoL auf, wo Ihr Ranked/Chat-Sperren erhaltet) **\n\n\n**!!! Ganz wichtig !!!**\nHier meine Vorstellung zu der Map (auch nochmal im Anhang zu finden):\n\nhttp://i.imgur.com/KrnBwWf.jpg\n\n (Produkt von 10min. Langeweile :D )\n\n\n\n___________________\n___________________\n\n**Checkt auch: **\n__________________\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/joLB31hI-sponsore-anpassbare-clanbereiche-von-5-9-slots-auf-teamspeak\n\nFalls ihr ein Clan seid und ein zu Hause unter Gamern sucht.","replies":[{"poster":"legofreak1","date":"2015-03-16T21:54:13.199+0000","up_votes":5,"down_votes":1,"body":"So etwas bietet Spieler, die dieses System nutzen können, einen deutlichen Vorteil Spielern gegenüber, die dies nicht können. Indem man also Geld für bessere Hardware ausgibt, kann man sich im Spiel einen Vorteil verschaffen. Ich zweifle die Einführung eines solchen Systems also sehr an.","replies":[{"poster":"HC Rocket","date":"2015-03-16T22:26:17.784+0000","up_votes":1,"down_votes":0,"body":"Ja, daran hatte ich auch schon gedacht. Natürlich wäre das ein nicht zu verachtender Vorteil, wobei ich mir auch einen 4k Fernseher hinstellen kann, mit ordentlicher Diagonale und schon hast du ebenfalls weitaus mehr Platz als jemand, der auf Laptop spielt. Ebenfalls eine Hardware Frage. Genauso ist es eine Hardware Sache, ob du einen super duper Gaming PC besitzt oder einen Laptop/Uralt-PC, welcher 10FPS, mit Hängen und Würgen auf den Bildschirm zaubert.","replies":[{"poster":"Kiun","date":"2015-03-17T00:21:38.084+0000","up_votes":1,"down_votes":0,"body":"Das sind Hardcore Fälle und trotzdem wäre das ein Vorteil dem ein Spieler ohne Tablet gnadenlos ausgesetzt ist.","replies":[{"poster":"HC Rocket","date":"2015-03-17T15:39:27.428+0000","up_votes":1,"down_votes":0,"body":"@Get Caked\n\nDa kommt folgendes ins Spiel:\n\n> [{quoted}](name=LordZanza131,realm=EUW,application-id=cGRapXds,discussion-id=5REgxJLi,comment-id=0002,timestamp=2015-03-17T00:00:11.631+0000)\n>\n> Warum nur auf den Tablets könnte doch auch auf dem Handy funktionieren oder nicht?\n\nGenau, mit Handy's könnte das auch kompatibel sein. Auch dort hat jeder ein unterschiedliches und so wären hier z.B. Samung Note oder iPhone 6+ User ebenso im Vorteil.\n\n\nHier eine wirklich gute Aussage und ein Beispiel dafür, dass es ganz im Auge des Betrachters liegt, ob es nun einen Vorteil darstellt oder einen Nachteil:\n\n> [{quoted}](name=Rirol,realm=EUW,application-id=cGRapXds,discussion-id=5REgxJLi,comment-id=00010001,timestamp=2015-03-17T13:10:39.731+0000)\n>\n> Ich sehe das Eher als Nachteil. Bei einem schnellen Spiel, wie LoL, habe ich doch nicht wirklich die Zeit vom Hauptgeschehen (Monitor), auf ein Zweitgerät das Rechts oder Links neben meinem Monitor zuschauen. Oft geht es doch um Sekundenbruchteile. \n> Die Map auf dem Monitor hab ich bei meinem 24\" immer im Blickfeld ohne den Kopf zu bewegen.","replies":[{"poster":"Kiun","date":"2015-03-19T02:58:15.471+0000","up_votes":1,"down_votes":0,"body":"Ob Nachteil oder Vorteil bleibt jedem selbst überlassen, dass es ebenso ein Vorteil sein kann sollten wir hier nicht bestreiten (ansonsten bringt dir das ganze Feature nichts).\n\nDie Map auf einem kleinem 5\" Handy oder auf einem iPad ist ein großer Unterschied, wieso sollte jedem klar sein und auch hier gilt: Wer kein Smart Phone hat (es gibt auch welche die mit 13 noch keins haben) der ist hier im Nachteil","replies":[]}]}]}]},{"poster":"Rirol","date":"2015-03-17T13:10:39.731+0000","up_votes":1,"down_votes":0,"body":"Ich sehe das Eher als Nachteil. Bei einem schnellen Spiel, wie LoL, habe ich doch nicht wirklich die Zeit vom Hauptgeschehen (Monitor), auf ein Zweitgerät das Rechts oder Links neben meinem Monitor zuschauen. Oft geht es doch um Sekundenbruchteile. \nDie Map auf dem Monitor hab ich bei meinem 24\" immer im Blickfeld ohne den Kopf zu bewegen.","replies":[]}]},{"poster":"HC Rocket","date":"2015-03-19T16:14:35.955+0000","up_votes":1,"down_votes":0,"body":"@Get Caked\n\nKlar, wie gesagt, alles Anischtssache.\n\nHaha und das mit den 13 jährigen ^^ Wäre schön, wenn es so wäre. In meiner/deiner Generation war es vllt nicht so. Bestes Beispiel, Bruder von nem Freund - gerade 7. Klasse und so jeder min. ein Android-Handy. Das ist heutzutage kein Argument mehr. Genau wie die Hardware beim Computer eine viel wichtigere Rolle spielt, habe bis vor ein paar Monaten auf einem 10 Jahre alten XP gespielt und jeder kann mir sagen, was er will...nachdem ich aufgerüstet habe, hat sich das Spiel komplett verändert, keine mini Map, weil auch es einen neuen Bildschirm dazu gab und keine FPS-Einbrüche, keine Laggs nichts mehr. \nIch finde das albern zu argumentieren, dass die ohne Tablet/Smartphone, Nachteile haben. Unter den LoL-Zockern besitzen locker gerade mal 2/10 Haushalte, kein Tablet oder Smartphone, wenn es nicht sogar mehr sind, die eins zu Hause haben.","replies":[]},{"poster":"SenpaiLoveLoli","date":"2015-03-17T13:00:09.118+0000","up_votes":1,"down_votes":0,"body":"Fürs Spiel Find eich das nicht so knorke\n\nAber wenn man Freunden beim Spielen zuschauen könnte fände ich das gut.\nIngame ist es aber unfair","replies":[{"poster":"HC Rocket","date":"2015-03-17T15:42:22.889+0000","up_votes":1,"down_votes":0,"body":"@senpailove\n\nDas mit dem zuschauen finde ich auch eine wirklich gute Idee.\nWie gesagt, ob unfair oder nicht, das wird wahrscheinlich immer im Auge des Betrachters liegen.","replies":[]}]},{"poster":"DarkRaín","date":"2015-03-17T00:00:11.631+0000","up_votes":1,"down_votes":0,"body":"Warum nur auf den Tablets könnte doch auch auf dem Handy funktionieren oder nicht?","replies":[{"poster":"HC Rocket","date":"2015-03-17T15:40:53.904+0000","up_votes":1,"down_votes":0,"body":"@lordzanza\n\nNatürlich könnte man darüber auch nachdenken, muss man nur schauen, ob es sich bei den meisten Handy's überhaupt lohnen würde, da die Map ja nicht super winzig ist. ;)","replies":[]}]},{"poster":"Infinitohit","date":"2015-03-16T19:55:32.871+0000","up_votes":1,"down_votes":0,"body":"Darüber hab ich mir auch mal Gedanken gemacht gute Idee :)","replies":[{"poster":"HC Rocket","date":"2015-03-16T20:27:11.451+0000","up_votes":1,"down_votes":0,"body":"Dankeschön und ich denke auch, dass sich schon einige mal drüber Gedanken gemacht haben. ^^\nIch hoffe einfach, dass sowas in der Art kommt, denn sowas macht Spiele einzigartig (zur Zeit noch).","replies":[]}]}]}