{"poster":"zeeedom","date":"2017-08-24T03:53:58.943+0000","title":"I was wrongfully banned for such a small thing was considered \"toxic\"","subforum":"Player Behavior","up_votes":1,"down_votes":7,"body":"I was playing league after a 2 week ban which was given to me rightfully so. I was being toxic and I had been angry that day so I got that ban and I moved on; then, I was excited when I got unbanned so I could play again. Funny thing is, I got put with 2 people in the same group who were obviously biased for eachother&#039;s opinions; so what had happened is I was playing normally until one of these people in this little duo were dying. He was running away from enemy team while I tried to help him very clearly, but even so, after he died which I could NOT CONTROL, he started flaming me constantly. He was swearing at me nonstop and after a minute he finally shut up. His other little friends were feeding enemy team and we lost that round. His friend was obviously not willing to reason with me in any kind of way so he instantly reported me along with his other friend after the game for the same reason I think. And this is where the problem lies for the penalty system. I do not get how you can get banned for 2 weeks and then get banned permanently the next time you get reported. I got banned for 2 weeks and instead of maybe a month or something around that, I get banned forever? Is this a joke? My account didn&#039;t have much but I was a veigar main with mastery 6 on it and I had final boss veigar skin, so I was doing pretty nice, and I had lots of fun playing. That all gets wasted when you get reported by 2 people for the same reason and then riot employees think they are in the right without even reviewing the logs? It really is pathetic, and a waste of my time playing on league. It&#039;s even more annoying how riot does not lift bans, yet they don&#039;t actually take time to think about who is in the wrong.\n\nHow can I say this? In less than 5 minutes of me being reported, I got a message saying I got banned. Permanently. Not even a 2nd chance. Sure you get chat restrictions, but those are different. At least you still get to play the game. I really hope there is a way I can get unbanned, throughout the entire game I did not even insult the 2 people a SINGLE time. Riot is out of their minds.\n\n\n\ntl;dr, I got wrongfully perma banned because 2 people who were even more toxic than me reported me at once, hence making it look like I was in the wrong. Mods did not even look over the logs, probably.\n\n(EDIT) realized that it isnt determined by humans, it's determined by ai. what a joke, riot depends on a single robot to carry out all bans\n\nIs there any way I can get unbanned?","replies":[{"poster":"MagicFlyingLlama","date":"2017-08-24T03:59:09.928+0000","up_votes":6,"down_votes":0,"body":"you got permbanned by lv21?\n\nCongratulations for joining what is probably the top 0.01% of most toxic league players. Trash was taken out, nothing of value was lost.\n\nYou may want a reality check and rethink what \"a small thing\" means.\n\nAnd there is no chance of getting your account back. You got multiple warnings, you ignored them, so you got banned because you are clearly too stupid, naive or arrogant to change your behavior.","replies":[{"poster":"zeeedom","date":"2017-08-24T04:05:23.954+0000","up_votes":1,"down_votes":5,"body":"Didn't i just write an entire paragraph explaining why I was perm banned falsely? Are you illiterate? Why don't you read the damn letters i typed out before instantly assuming I'm some 100% toxic person? This is the first league account i've ever made, so you think I know this stuff?","replies":[{"poster":"Kei143","date":"2017-08-24T05:31:13.774+0000","up_votes":2,"down_votes":0,"body":"I just read over your logs, your punishment was not a mistake.","replies":[]},{"poster":"Chermorg","date":"2017-08-24T11:02:03.886+0000","up_votes":1,"down_votes":0,"body":"As did I. You were warned previously. You didn't improve your behavior. Thus you got permabanned.","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-08-24T19:42:45.326+0000","up_votes":1,"down_votes":0,"body":"I read it, and your behavior sort of proves the \"100% toxic\" part. Your logs also provide further proof of the fact you have no self-control or respect.\n\nBan was 100% deserved. Reports do not get a player banned, mark them in any way, or count against them.\n\nAll they do is trigger a review of their behavior, and is it was found lacking, they are punished.\n\nIt is unfortunate that you are too immature to take responsibility for your own actions, things like this will just keep happening to you until you grow a pair and get your shit under control instead of acting like a spoiled brat.","replies":[]}]}]},{"poster":"Icy Hot Shoto","date":"2017-08-24T03:58:52.589+0000","up_votes":1,"down_votes":0,"body":"Log(s), please.","replies":[{"poster":"zeeedom","date":"2017-08-24T04:10:26.886+0000","up_votes":1,"down_votes":2,"body":"ignore the cringe beginning text, its bad it was just banter with enemy team, you can see the text progressively get worse as my teammate starts flaming me lol\n\n\nGame 1\nzeeedom: my name jeff???????????????????\nzeeedom: me llamo jeff\nzeeedom: ahh yes yes taco\nzeeedom: burrito burrito ayy delicious sombrero\nzeeedom: no\nzeeedom: no\nzeeedom: missed like 30 skillshots killing myself now :)\nzeeedom: garen is feeding\nzeeedom: are you serious\nzeeedom: trying to help stop feeding how are you mastery 7\nzeeedom: dont go top\nzeeedom: yes you are\nzeeedom: also reporting\nzeeedom: i tried to w him and i used an ult on him\nzeeedom: lol\nzeeedom: enjoy your mute after game'\nzeeedom: garen\nzeeedom: kill them\nzeeedom: did you install league 10 minutes ago\nzeeedom: yeah i figures\nzeeedom: figured\nzeeedom: you seem pretty new too buddy\nzeeedom: you should learn how to play by mastery 7\nzeeedom: less deaths\nzeeedom: blatantly runs into people\nzeeedom: idk\nzeeedom: lol your really triggered arent you\nzeeedom: you seem like the type that will enjoy a chat restriction\nzeeedom: so toxic\nzeeedom: you spend too much time on this game\nzeeedom: ok mr 3 deaths and no kills\nzeeedom: i've said nothing that insulted him lol\nzeeedom: he swore me out like a 12 year old multiple times\nzeeedom: just because your in the same group doesnt mean your friend is not any less hardheaded\nzeeedom: what does garen have to do with this he wasnt even involved in the first place\nzeeedom: he flamed me because i tried to help him but like the average toxic player said i didnt help him\nzeeedom: welp gg kha zix, jinx, and garen fed this entire game\nzeeedom: lol i was put with a mastery 7 and 6 player and they both fed you guys hardcore\nzeeedom: gg","replies":[{"poster":"Kei143","date":"2017-08-24T05:38:31.425+0000","up_votes":3,"down_votes":0,"body":"you harassed him non-stop throughout the game, which you have 100% control over. This is a valid report.","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-08-24T19:44:22.809+0000","up_votes":1,"down_votes":0,"body":"The random shit about the burrito is probably the least cringe-inducing thing you said all game.\n\n{{sticker:zombie-brand-clap}}","replies":[]}]}]},{"poster":"Avarist","date":"2017-08-24T05:42:54.429+0000","up_votes":1,"down_votes":0,"body":"Getting perma'd by level 21 is actually really impressive in a twisted sort of way.\n\nIf you decide to make a new account just use /mute all, and don't fight with anybody. Self defence is not necessary ingame when you can just mute people and carry on unharmed.","replies":[{"poster":"zeeedom","date":"2017-08-27T14:21:14.416+0000","up_votes":1,"down_votes":0,"body":"i feel proud about that for the same reason, but yes i will just make a new account and mute everyone i have a rare case of retard in my personality\n\nmaking this thread was 100% useless and i now realize why lol\n\nthanks for the info to everyone else who replied, i dont know how the ban/punishment system works so i just did whatever i wanted, i'll just stfu next time tbh\n{{champion:45}}","replies":[]}]},{"poster":"Squidwards House","date":"2017-08-24T16:15:39.072+0000","up_votes":1,"down_votes":0,"body":"zeeedom: you seem like the type that will enjoy a chat restriction\n\nLOOOOL and you seem like the type that doesnt learn after having at least 2 chatrestricts himself.","replies":[]},{"poster":"Beas7ie","date":"2017-08-24T13:32:36.655+0000","up_votes":1,"down_votes":0,"body":"I just read the logs.  \n\nWhile I've seen far worse, that game definitely warranted punishment.  Normally it probably would be just a chat restriction but you just came off a 14 day ban.  You asked for a \"second chance\" but by the time you get to the 14 day level, you've already blown through about 4 or 5 \"chances\".  \n\nThat 14 day ban(and the clearly tell you this) is your \"final warning\" and ANY recent punishment after making that level is an insta perma.","replies":[]},{"poster":"TheEvilQueen135","date":"2017-08-24T12:55:25.729+0000","up_votes":1,"down_votes":0,"body":"1. 14 day ban means next is perma and they tell you that.\n2. your chat logs are considered toxic\nand for 3 (what i think is most important). Riot does not care what the CONTEXT is or who STARTED anything. they care about behavior. you act poorly you get punished, they act poorly they get punished. both sides can be reported.","replies":[]},{"poster":"Shadowynn","date":"2017-08-24T05:59:20.177+0000","up_votes":1,"down_votes":0,"body":"Anger is no reason for you to be toxic.","replies":[]},{"poster":"YerroFever","date":"2017-08-24T05:36:44.319+0000","up_votes":1,"down_votes":0,"body":"First: after 14 day bans, you're given the warning that your NEXT punishment is a permaban. That means that regardless of what your infraction is, no matter how minor it is, your NEXT punishment is a permaban.\n\nSecond: Regarding your chat log\n\nNot sure what the context of the first few lines are but it sounds racist...\n\nThen you go on to harass someone regarding their skill\n\nYou did get your warning on the 14 day reform card that you were going to be permabanned on your next infraction. I'd say this counts as harassing someone... thus why you're permabanned.","replies":[]},{"poster":"Kei143","date":"2017-08-24T05:30:49.482+0000","up_votes":1,"down_votes":0,"body":"When you got 14-day banned, you are treading on thin ice and your next punishment (even the mildest things that warrant a punishment) will be a permaban (which was clearly written in you reform card).","replies":[]},{"poster":"Dragondoot","date":"2017-08-24T04:01:40.676+0000","up_votes":1,"down_votes":0,"body":"Shoulda muted them both","replies":[]}]}