{"poster":"ILoveDamian","date":"2017-03-12T23:24:19.206+0000","title":"Suche Hobby Coach (  Jungle )","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Ich bin seit ca 3 Wochen jungler und suche einen Hobby coach der mich ab und zu mal coacht. Du solltest bereit sein mit mir die Basics durchzugehen sprich die einzelnen Champs matchups spielweise etc. Gelegentlich f&auml;nde ich es gut wenn du mir mal ingame zusiehst ^^ Ich freu mich auf euch \r\n\r\nMfG LeftKonoha4RP","replies":[{"poster":"BMG Seddy","date":"2017-03-13T02:35:56.398+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeftKonoha4RP,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=,timestamp=2017-03-12T23:24:19.206+0000)\n>\n> Ich bin seit ca 3 Wochen jungler und suche einen Hobby coach der mich ab und zu mal coacht. Du solltest bereit sein mit mir die Basics durchzugehen sprich die einzelnen Champs matchups spielweise etc. Gelegentlich f&amp;auml;nde ich es gut wenn du mir mal ingame zusiehst ^^ Ich freu mich auf euch \n> \n> MfG LeftKonoha4RP\n\nHi :)\n\nIch bin Main Jungler und Supporter und kenne mich im Jungle sehr gut aus (siehe meine letzten Plays mit Shaco).\nIch beherrsche viele fortgeschrittene Themen die den Jungle betreffen und kann dir alles beibringen was ich weiß.\n\nMeine einzigen Anforderungen an dich wären:\n\n- Teamspeak oder Skype\n- funktionierendes Headset\n- Keine geflame von wegen \"nur meine Mates sind an allem schuld\"\n- und hohe Lernbereitschaft da ich meine zeit dafür aufopfere ^^\n\nAdde mich einfach ingame: ResearchX16\n\nKomm einfach auf mich zu ich coache dich NUR wenn du auch sagst das du gecoached werden möchtest andernfalls wirst du ignoriert damit du bescheid weißt ;)","replies":[{"poster":"Hellosager","date":"2017-03-13T06:52:05.884+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ResearchX16,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=0000,timestamp=2017-03-13T02:35:56.398+0000)\n>\n> Hi :)\n> \n> Ich bin Main Jungler und Supporter und kenne mich im Jungle sehr gut aus (siehe meine letzten Plays mit Shaco).\n> Ich beherrsche viele fortgeschrittene Themen die den Jungle betreffen und kann dir alles beibringen was ich weiß.\n> \n> Meine einzigen Anforderungen an dich wären:\n> \n> - Teamspeak oder Skype\n> - funktionierendes Headset\n> - Keine geflame von wegen &quot;nur meine Mates sind an allem schuld&quot;\n> - und hohe Lernbereitschaft da ich meine zeit dafür aufopfere ^^\n> \n> Adde mich einfach ingame: ResearchX16\n> \n> Komm einfach auf mich zu ich coache dich NUR wenn du auch sagst das du gecoached werden möchtest andernfalls wirst du ignoriert damit du bescheid weißt ;)\n\nSorry, aber Bronze 4 und solche Builds. Da würde ich mich nicht coachen lassen.","replies":[{"poster":"BMG Seddy","date":"2017-03-14T00:21:48.620+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellosager,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=00000000,timestamp=2017-03-13T06:52:05.884+0000)\n>\n> Sorry, aber Bronze 4 und solche Builds. Da würde ich mich nicht coachen lassen.\n\n1. Dich hat keiner gefragt, wenn du ihm antworten willst dann mach das aber versuche mich nicht schlecht zu machen nur weil ich einem Jungle Anfänger helfen will.\n2. Dann erklär mir mal was an meinen Junglebuilds nicht stimmt und dann können wir weiter reden.\n3. Habe ich in letzter zeit mit 5er Premates getrollt aber das sollte dich nichts angehen ^^\n\nWenn du besser bist dann biete deine Hilfe an anstatt mich wegen meiner Elo schlecht zu machen und zu meinen Builds, ich selbst wurde von Platin und Diamant Premates gecoached und die haben mir diese (aus deiner Sicht anscheinend schlechte) Builds für den Jungle beigebracht und ich bin (anders als du) hilfsbereit und möchte jemandem helfen der ebenfalls Jungle lernen will.\nFalls du also meinst das Diamant Leute mit diesen Builds schlecht sind dann zeig mir bitte das du besser bist bevor du so ein Müll in den Raum wirfst ^^","replies":[{"poster":"Hellosager","date":"2017-03-14T07:09:14.682+0000","up_votes":2,"down_votes":0,"body":"Ich glaube kaum, dass dir Diamantspieler empfehlen werden, auf so gut wie jedem Champion eine Träne zu stacken.\nTräne auf Shaco...? Bitte...\nVolibear 0 Magieresistenz gegen nen 24 Kills Ekoo.\nAmumu 0 Magieresistenz gegen 2 AP's, aber wenigstens nen Iceborn Gauntlet.\nÜber Viktor Jungle mit Träne reden wir mal lieber nicht.\n\nNa ja und nen Main Jungler würde wohl deutlich mehr Jungle spielen behaupte ich.\n\n> [{quoted}](name=ResearchX16,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=0000,timestamp=2017-03-13T02:35:56.398+0000)\n\n> Ich beherrsche viele fortgeschrittene Themen die den Jungle betreffen\n\n^--- Und sorry, aber das kann ich dir einfach nicht glauben. Dann müsstest du deutlich mehr Jungle spielen und wärst sehr wahrscheinlich nicht Bronze 4.","replies":[{"poster":"BMG Seddy","date":"2017-03-14T11:43:41.727+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellosager,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=0000000000000000,timestamp=2017-03-14T07:09:14.682+0000)\n>\n> Ich glaube kaum, dass dir Diamantspieler empfehlen werden, auf so gut wie jedem Champion eine Träne zu stacken.\n> Träne auf Shaco...? Bitte...\n> Volibear 0 Magieresistenz gegen nen 24 Kills Ekoo.\n> Amumu 0 Magieresistenz gegen 2 AP&#x27;s, aber wenigstens nen Iceborn Gauntlet.\n> Über Viktor Jungle mit Träne reden wir mal lieber nicht.\n> \n> Na ja und nen Main Jungler würde wohl deutlich mehr Jungle spielen behaupte ich.\n> \n> ^--- Und sorry, aber das kann ich dir einfach nicht glauben. Dann müsstest du deutlich mehr Jungle spielen und wärst sehr wahrscheinlich nicht Bronze 4.\n\nIch wurde gecoached wie man Jungle spielt es geht hierbei um den Jungle nicht um die Items.\nIch selbst probiere grad rum und das darf ich wohl auch machen.\nViktor Jungle war nur ein Trollpick wie gesagt das hat dich nicht zu interessieren das ist meine Sache.\n\nWenn ich ihn coachen würde, dann würde ich einfach nur das nachplappern was highelo Premates mir beigebracht haben und das ist auch genau so wie man Jungle spielen sollte.\n\nUnd höchswahrscheinlich bin ich Bronze 4 da ich nicht den ganzen tag Rankeds zocke weil ich habe noch ein Privatleben falls du so etwas kennst.\nWie ich schon sagte kenne ich mich im Jungle sehr gut aus, ich weiß welche Champs gut im Jungle sind, kenne diverse Routen, weiß welche Items man sich als Starter holt und auch unterstützende Items und kenn auch den begriff Counterjungle und aj ich weiß auch wie das funktioniert falls du dich das fragst.\nIch denke mal um einen Jungle Anfänger zu coachen reicht das völlig aus und wie gesagt wenn ich deiner Meinung nach so schlecht bin dann biete entweder du dein coachen an oder schreib erst gar nicht so ein Müll, danke.\n\nIch verstehe auch gar nicht warum du jetzt versuchst mich schlecht zu machen obwohl ich nur helfen will, das was du da von dir gibst weicht einfach nur vom Thema ab. Hier wird nach einem Coach gesucht aber Hauptsache zu viel labern und andere fertig machen, beste Einstellung in der Platin Elo ^^","replies":[{"poster":"Hellosager","date":"2017-03-14T12:04:11.402+0000","up_votes":2,"down_votes":0,"body":"Du hast gefragt was ich auszusetzen habe an deinen Builds, ich habe dir die Antwort gegegeben.\nPrivatleben kenne ich selbstverständlich nicht (könntest mich ja coachen) und Bronze 5 (mittlerweile) liegt garantiert daran, dass du zu wenig Ranked spielst - mein Fehler.\nAber ich denke wir haben ein unterschiedlich Verständnis von \"sehr gut auskennen\". Das was du nennst, ist wie zu sagen: \"Ich weiß, dass man Midlane mit Dorans startet und lasthitten muss\". \n\nHauptsache richtig gut im Jungle auskennen, Bronze 5 sein, aber der Grund ist nur, dass du nicht zum zocken kommst :D\n\nPS: Ich gebe gern zu, dass ich mich etwas unhöflich ausgedrückt habe, aber das diskutieren macht mir Spaß.","replies":[{"poster":"Talon ADC","date":"2017-03-14T15:04:01.589+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Mortiferum","date":"2017-03-14T17:41:58.441+0000","up_votes":2,"down_votes":0,"body":"Tut mir leid, dass ich mich hier einmische mich würde nur interessieren welche Gründe das wären.\nEs gibt Spieler in niedrigen Elos mit einem guten Spielverständnis aber um in Platin zu spielen muss man denke ich dennoch ein gutes Spielverständnis haben. Prinzipiell finde ich es gut wenn in Foren Hilfe angeboten wird, aber trotzdem bin ich nicht sicher ob es hilfreich ist sich Jungletipps geben zu lassen wenn der \"Coach\" immer noch herumexperimentiert mit Items oder sogar gezielt in Spielen trollt und es auch zugibt. Ob man so etwas noch als Hilfe ansehen kann ist fraglich. Auch ich kenne mich nicht gut genug mit dem Spiel aus um darauf beruhen zu können, dass meine Meinung zu 100% richtig ist (ich denke das können nur sehr wenige). Vielleicht geht es ja nur um die Junglebasics, welche er vielleicht gut erklären kann. Sollte das Ziel des Posts aber eine wirkliche Verbesserung mit dem Ziel, ehrgeizig mit besseren Spielern spielen zu können und diesen Konkurrenz machen zu können, sein so denke ich würde ich eher (Metapher) von einem Delphin Schwimmen lernen als von einem Pottwal.","replies":[{"poster":"BMG Seddy","date":"2017-03-14T23:54:11.047+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mortiferum,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=00000000000000000000000000000000,timestamp=2017-03-14T17:41:58.441+0000)\n>\n> Tut mir leid, dass ich mich hier einmische mich würde nur interessieren welche Gründe das wären.\n> Es gibt Spieler in niedrigen Elos mit einem guten Spielverständnis aber um in Platin zu spielen muss man denke ich dennoch ein gutes Spielverständnis haben. Prinzipiell finde ich es gut wenn in Foren Hilfe angeboten wird, aber trotzdem bin ich nicht sicher ob es hilfreich ist sich Jungletipps geben zu lassen wenn der &quot;Coach&quot; immer noch herumexperimentiert mit Items oder sogar gezielt in Spielen trollt und es auch zugibt. Ob man so etwas noch als Hilfe ansehen kann ist fraglich. Auch ich kenne mich nicht gut genug mit dem Spiel aus um darauf beruhen zu können, dass meine Meinung zu 100% richtig ist (ich denke das können nur sehr wenige). Vielleicht geht es ja nur um die Junglebasics, welche er vielleicht gut erklären kann. Sollte das Ziel des Posts aber eine wirkliche Verbesserung mit dem Ziel, ehrgeizig mit besseren Spielern spielen zu können und diesen Konkurrenz machen zu können, sein so denke ich würde ich eher (Metapher) von einem Delphin Schwimmen lernen als von einem Pottwal.\n\nWenn mal wieder alle ihre Eier chillen würden, wäre es sehr nett, danke.\nIch habe lediglich gesagt das ich einen Trollpick gewählt habe was jetzt auch nicht jeden Tag bzw. ziemlich selten vorkommt (bisher nur 2 mal das ist denke ich kein Grund mich gleich als super schlecht abzustempeln).\nIch bin Bronze 5 und nicht weil ich 0 Ahnung vom game habe sondern weil ich skilltechnisch nicht gerade der beste bin und auch nicht carrien kann das ist alles. Die Junglebasics und viele fortgeschrittene Themen wie das Counterjunglen beherrsche ich und diese würde ich auch coachen wenn es jemand verlangt das sollte aber nicht an der Spielqualität des jenigen scheitern das es meine eigene Spielqualität ist wenn ich bronze 5 bin (keine Skills).\nUnd tut mir total leid dass ich die letzten Spiele ein wenig herumexperimentiert habe um mich ein wenig zu verbessern aber ich sehe gerade das ich mich als Bronze Spieler nicht verbessern darf (geile Logik wirklich Leute).\nAuch als Platin oder Diamant probiert man hier und da noch rum und versucht sich zu verbessern deswegen verstehe ich euer Problem gerade nicht.\nIch wurde hauptsächlich von einigen Diamant und Platin Spielern gecoached, habe in den ersten 3 Monaten in Lol einen Master Premate kennengelernt der mir Tipps zu Items gegeben (er kommt aber leider nicht mehr on warum auch immer).\n\nIch kenne mich bestens im Jungle aus und könnte sogar Leute in High Elo coachen die noch nie gejunglet haben das wäre kein Problem für mich.\nWas mich nur nervt sind so asoziale Leute die hier her kommen um mich schlecht zu machen nur weil ich jemanden helfen will und das nur weil ich in Bronze bin und das Verhalten ist einfach nur niveaulos.\nWenn ihr ja alles wisst und nicht üben müsst verstehe ich nicht warum ihr noch nicht Challenger seid, lasst euch das mal durch den Kopf gehen.\n\nEs gibt viele Items und viele Champs dazu gibt es zigtausend Varianten wie man einen Champ spielen kann und jeder hat andere Strategien wie er ein Spiel gewinnt und andere Vorangehensweisen in verschiedenen Situationen, diese haben aber nicht mit dem Spiel zu tun sondern nur mit dem jenigen selbst.\nShaco mit Traäne wollte ich einfach nru mal austesten und einige Male damit spielen da ich anders als andere, meine eigenen Strategien entwickle anstatt diese zu kopieren und ja vielleicht sind diese nicht die besten aber versuchen darf man das ich meine ich spiele erst seit einem Jahr und nicht schon seit Season 1.\n\nUnd falls ihr es noch nicht bemerkt habt, es wird immer noch nach einem Coach gesucht der jemanden im Jungle weiterhilft und komischerweise ist der Bronze Spieler (ich) der einzige der hilfsbereit genug ist um ihm zu helfen während die \"Oberbosse\" Mit einem Schw* vergleich im Forum ankommen von wegen du bist Bronze ich bin Platin ich weiß alles. Das ist einfach nur noch asozialer Spam in diesem Thema geht es eigentlich um etwas ganz anderes und es interessiert da niemanden wer bronze und wer Platin und Holz oder Plastik ist, das wollte hier niemand wissen oO","replies":[{"poster":"jugglingDeath","date":"2017-03-15T23:20:51.743+0000","up_votes":2,"down_votes":0,"body":"Hallöchen,\n\nhab hier eure lustige Diskussion gesehen und wollte nur mal meinen Senf dazugeben (ich weiß unnötig, aber hab nichts besseres zu tun gerade ;) ). Ich kann verstehen, dass man sich verletzt fühlt wenn man Hilfe anbietet und dann jemand ankommt und die angebotene Hilfe kritisiert. Allerdings war hier das Ziel nicht dich dumm zu machen, sondern dem Hilfe-Suchenden auf einige Dinge hinzuweisen, auf die er achten sollte. Sorry aber ich würde auch von keinem Hilfe nehmen, der Träne auf Shaco baut (da spielst du halt einfach mit nem Item-Slot weniger). Die anderen haben außerdem nie gesagt, dass sie keine Hilfe anbieten würden. Aber an sich will ich dich gar nicht in deiner Rage unterbrechen, also noch viel Spaß beim Träne bauen, trollen und \"coachen\". Schönen Tag noch","replies":[{"poster":"BMG Seddy","date":"2017-03-15T23:55:05.151+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jugglingDeath,realm=EUW,application-id=ElKI1ocy,discussion-id=PvsMvBzL,comment-id=0000000000000000000000000000000000000000,timestamp=2017-03-15T23:20:51.743+0000)\n>\n> Hallöchen,\n> \n> hab hier eure lustige Diskussion gesehen und wollte nur mal meinen Senf dazugeben (ich weiß unnötig, aber hab nichts besseres zu tun gerade ;) ). Ich kann verstehen, dass man sich verletzt fühlt wenn man Hilfe anbietet und dann jemand ankommt und die angebotene Hilfe kritisiert. Allerdings war hier das Ziel nicht dich dumm zu machen, sondern dem Hilfe-Suchenden auf einige Dinge hinzuweisen, auf die er achten sollte. Sorry aber ich würde auch von keinem Hilfe nehmen, der Träne auf Shaco baut (da spielst du halt einfach mit nem Item-Slot weniger). Die anderen haben außerdem nie gesagt, dass sie keine Hilfe anbieten würden. Aber an sich will ich dich gar nicht in deiner Rage unterbrechen, also noch viel Spaß beim Träne bauen, trollen und &quot;coachen&quot;. Schönen Tag noch\n\nGanz ehrlich eure \"Kritik\" und diese Diskussion hier zieht sich immer weiter in Richtung niveaulos und asozial. Es geht hier immer noch um die Jungle Basics die ich beherrsche sonst würde ich doch nicht meine Hilfe anbieten man -_- Es geht hier nicht darum das er Shaco mit Träne bauen soll sondern um den Jungle und zwar ganz allein NUR um den Jungle und wenn ich meine Hilfe anbiete dann hat sich da niemand einzumischen, man könnte auch einfach schreiben \"ich biete dir Hilfe an\" anstatt \"ne sry ders Bronze der hat 0 Ahnung\" das ist doch einfach nur noch asozial alter oO\nWenn ihr eure Hilfe anbieten wollt dann schreibt es auch vernünftig und klar verständlich anstatt die ganze zeit auf mir rum zu hacken wegen Shaco Träne denn es geht hier um jemanden der Hilfe für den Jungle benötigt -> IMMER NOCH!\nUnd ich war bisher der einzige der vernünftig, zivilisiert und klar verständlich Hilfe angeboten hat während ihr die ganze Zeit über nur spamt.\nUnd wie oft noch! Ich habe an eine Spielweise mit Shaco gedacht die ich mit Umarmung des Seraphen üben wollte um zu schauen ob das funktioniert das ist kein Troll und verdammt nochmal meine eigene Sache (nichts was ich jemanden beibringen würde weil es nicht üblich ist!). Und um dich zu berichtigen da spiele ich nicht mit einem Itemslot weniger sondern der Itemslot ist mit Umarmung des Seraphen besetzt.\n\nIhr kennt mich nicht mal, guckt einfach auf mein Profil, sagt der ist Bronze der ist schlecht und wirft mich mit allen anderen Bronze Spieler in einen Topf und tut so als sei es ein Schwerverbrechen als Bronze Spieler seine Hilfe anzubieten.\nWas ich mache ist meine Sache da hat sich niemand einzumischen Leute entweder bietet eure Hilfe an und antwortet auf das Thema oder schreibt gar nichts!\nUnd lasst mich verdammt nochmal in Ruhe oO","replies":[{"poster":"Hellosager","date":"2017-03-16T06:53:20.763+0000","up_votes":3,"down_votes":0,"body":"OK überzeugt","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"L057MYC0D3","date":"2017-03-16T01:00:14.063+0000","up_votes":1,"down_votes":0,"body":"Heyho, eventuell wäre unsere Community etwas für dich. Wir bieten Coaching, Teambetreuung sowie Turniere an. Aktuell sind wir um die 130+ aktive Mitglieder & sind in allen Elo's von Unranked-Master vertreten. Bei uns findet immer jeder jemanden zum Spielen sei es für Normals, Rankeds oder auch Customs. Gerne laden wir Dich zu einem Gespräch auf dem Teamspeak ein.\n\nUnser Post im League of Legends Forum: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/kEcOcEk2-rift-guardians-sucht-mitglieder-teamerstellung-community-coaching-overwatch","replies":[]}]}