{"poster":"Unamed1","date":"2015-03-02T15:00:12.926+0000","title":"Twisted Treeline Strategies","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Ich und zwei Freunde wollten mit einem Ranked Team 3vs3 starten. Nachdem wir unser erstes Spiel aber zunächst gnadenlos verloren hatten, wollten wir uns erstmal über die Meta informieren. Dabei haben wir festgestellt das die meisten High-Elo Spiele mit einem Top-Lane Supporter ausgetragen werden. Unsere momentanen Gegner aber spielen fast alle mit Jungler, hat man dadurch mit der viel höheren Farm nicht einen Vorteil?\r\nMeine Fragen sind also:\r\nWarum spielen die Challenger ohne Jungler?\r\nUnd wie muss man vorgehen um die Supporter Strategie gegen die Jungler Strategie auszupielen?","replies":[{"poster":"ArgRIB","date":"2015-03-08T11:43:19.595+0000","up_votes":1,"down_votes":0,"body":"Ich spiele zwar nicht Rankeds und bin auch nicht so großartig, aber ich spiele gern alle Karten von LoL, also auch 3v3.\nNun, seid ich in einem Spiel von einem gegnerischen Jungler so richtig auf die Nuss bekommen habe, spiele ich selber Jungle in 3v3.\nJa, es gibt schon einiges an Goldvorteil, allerdings nur, wenn die Lanes auch mal 5 Minuten ohne Hilfe auskommen.\nVon daher hängt es (wen wunder es) von den Mitspielern ab.","replies":[]},{"poster":"InfectedGreed","date":"2015-03-04T12:28:56.070+0000","up_votes":1,"down_votes":0,"body":"Heyho,\n\nich hab letzte Saison ein paar Rankeds(etwa 70) mit Freunden gemacht.\n\nDie Meta spielt erstmal keine Rolle, solange ihr selbst nicht auf Challenger Niveau seid. Daher kann ich dir auch nicht sagen warum die Challenger ohne Jungle spielen.\n\nWir haben in 90% der Fälle mit Jungler gespielt.\n\nProblem in TT mit dem Jungle ist der Respawn-Timer, als Jungler kriegst du nämlich deine 3 Camps Clear und mußt erst auf Respawn warten oder ganken gehen.\nGanken geht aber nicht immer, daher hat man desöfteren eine Leerzeit in der man eigtl. nicht viel machen kann. (das könnte ein bzw. der Grund sein warum die ohne Jungle spielen.\n\nAber selbst das ist nur grob umschrieben, denn letztendlich verläuft jedes Game anders und man kann nicht stur an seinem Schema festhalten.\n\n\nWir haben damals hauptsächlich Bruiser gespielt, aber man muss schon drauf achten das man nicht mit 3xAP oder 3xAD ins Spiel startet, da man sonst einfach zu kontern ist.\n\nIch war damals Main Wukong, der eine Freund hat oft Annie gespielt und der dritte hat dann das gepickt was uns gegen das gegnerische Team gefehlt hat.\n\nz.b. Sejuani für noch mehr CC oder Trynda für den DMG.\n\n\nViel wichtiger ist aber das Absprechen im Teamspeak/Skype was auch immer nutzt.\n\n\nTT ist schneller als Summoners Rift, verzeiht weniger Fehler und erfordert viel mehr Teamplay und Unterstützung(Die Altare halten, zurückgewinnen etc..)\n\ngreets","replies":[]}]}