{"poster":"itzJonzy","date":"2017-07-15T09:18:02.666+0000","title":"Botlane Partner gesucht zum Elo climben","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Ho League Community\r\n\r\nWie aus dem Titel schon zu entnehmen suche ich einen Partner f&uuml;r die Botlane. Ich bin es leid st&auml;ndig mit Trollen und Feedern auf die Botlane gezwungen \r\nzu werden deswegen wende ich mich nun verzweifelt ans Forum auf der Hoffnung einen gleichgesinnten zu finden. Nun erstmal zum wichtigen: Ich befinde mich derzeit in der Silber Elo in Silber 5 war jedoch schon Solo bis auf Silber 3 gekommen. Ich kann sowohl ADC als auch Support spielen und stelle es dir frei was du lieber spielst. Wenn es zeitlich passt w&uuml;rde ich gerne jeden Tag mindestens ein Ranked spielen. Du solltest spiel erfahren sein, nicht zu schnell tilten und eine gewisse &Uuml;bersicht &uuml;ber das spiel (Macroplay) haben. Du solltest am besten eine gewisse Reife besitzen und f&uuml;r bessere Kommunikation Zugang zu Teamspeak oder Skype. \r\n\r\nNun nochmal kurz zu mir:\r\nIch bin Basti, 19 Jahre alt und spiele League seit Season 3. Seit ca Season 5 hat mich dann der Ehrgeiz zum Ranken gepackt. Ich habe relativ viel Erfahrung,\r\nda man mich schon auf so ziemlich jeder Lane finden konnte. Ich habe mich im Ranked schon als Jungle, Support und ADC recht erfolgreich durch geschlagen jedoch reichte es dann oft nicht zum carrien. Mein lieblings Support ist Braum was man auch am Level 7 erkennen kann. Als ADC spiele ich gern Miss Fortune und Caitlyn.\r\n\r\nFalls du LLust bekommen hast die Botlane mit mir zu Rocken dann lass es mich einfach wissen. Schreib mir hier oder melde dich Ingame bei mir. Dort findest du mich auch als itzJonzy.\r\n\r\nNun denn vielleicht findet sich ja wer.","replies":[{"poster":"Abarzdonhades","date":"2017-07-15T12:29:33.870+0000","up_votes":2,"down_votes":0,"body":"Hi, ich bin im Moment G5 ADAC und würde gerne mit dir zocken.  Ich spiele seid S4 und bin konstant im Bereich S2-g3 seid Ende Season 5 ( auf 4 acts. ). Für mehr Infos schreib mich einfach an. Habe Teamspeak, Discord und Skype. IGN Abarzdonhades","replies":[]}]}