{"poster":"ChuMbeKE21","date":"2015-02-01T19:36:27.425+0000","title":"¡¡¡BASTA DE LEAVE BUSTER ¡¡","subforum":"Charlas Generales","embed":{"description":null,"url":"http://support.leagueoflegends.com/forums/210177-tech-support","image":null},"up_votes":1,"down_votes":9,"body":"creo yo que todos estamos cansado de esta injusticia de riot contra nosotros los jugadores del lol como es posible que tendramos que esperar 20. minutos para ingresar a cola ¡¡¡¡ Son unos invesiles esta bien que lo sancionen con 5 minutos pero para que 20 no lo entiendo quiero que lo cambien o no jugare mas Y mas ensima que te sancionen por abandonar una partida puede ser que se te alla caido la conexion ETC.  y te sancionen esto TIENE K PARAR APOYENME SI CREEN K DEBE ACABARSE LOS 20 MINUTOS DE LEAVE BUSTER .......","replies":[{"poster":"LuciusMagnum","date":"2015-02-01T19:39:00.692+0000","up_votes":2,"down_votes":0,"body":"no, me parece perfecto el sistema sino estaria lleno de afks. Lo que me parece horrible es tu ortografia","replies":[{"poster":"ChuMbeKE21","date":"2015-02-01T19:45:17.834+0000","up_votes":1,"down_votes":2,"body":"aver aver esta biem que sean 5 minutos pero no 20 no lo crees y que se van a afk es por algun error de conexion y si se van a proposito reportenlos para eso sirve los baneos pero 20 minutos nadie esperaria tanto yo sako los 5 partidas y dsp me pasa un error de conexion y me dan 5 mas esto es el coLMO","replies":[{"poster":"Pascut","date":"2015-02-01T19:46:06.198+0000","up_votes":2,"down_votes":0,"body":"El leavebuster no te sanciona por una partida, vos te fuiste bastantes veces que es otra cosa","replies":[{"poster":"ChuMbeKE21","date":"2015-02-01T19:48:37.786+0000","up_votes":1,"down_votes":1,"body":"YO ME SALI UNA SOLA VES Y YA ME DIO 20 MINUTOS","replies":[{"poster":"Excorpion","date":"2015-02-01T19:57:55.871+0000","up_votes":2,"down_votes":0,"body":"Leave buster no te manda a la cola de 20 min por abandonar una partida... es más que seguro que has abandonado más antes y has recibido sanción por ello...","replies":[]}]}]}]}]},{"poster":"Excorpion","date":"2015-02-01T19:50:30.245+0000","up_votes":2,"down_votes":0,"body":"Si se te cae la conexión es culpa interna tuya no de Rito... fue un acuerdo legal que firmaste antes de empezar el juego, no puedes retractarte...\nademás esta en tu código de invocador...\nSi leavebuster te pilló no es primera vez que abandonas una partida... más aún cuando te manda a las colas de 20 min\nsignifica que no abandonaste pocas partidas, o que ya lo has hecho en el pasado de manera seguida...\n\nSi tomas un acuerdo y luego lo rompes no eres gente de palabra, no se puede confiar en tí, y tu sanción está bien puesta...","replies":[]},{"poster":"HotSjokzGG","date":"2015-04-27T15:04:28.771+0000","up_votes":1,"down_votes":0,"body":"jajajajaajjaja que gran mentira tu post!\nsi abandonas 1 partida con suerte te salta un cartel en donde el castigo es escribir correctamente \"estoy de acuerdo.\"\ntu eres el tipico AFK que abandona todas las partidas y nadie quiere tenerte en su team.\no por ahi ocurrio un misterioso y milagroso bug que solo te ocurre a ti y que con 1 sola partida te penaron con 20 minutos de leavebuster por partida. tal vez tu historial esta equivocado y tambien se buggeo y aparece abandonos en reiteradas veces que \"nunca abandonaste\"\nmanda tiket al soporte y suerte!. aunque dudo que te crean, y de paso ya te aviso que no le sacan el castigo a nadie\nLo siento pero tendras que comerte el garron de esperar esos 20 minutos. asi como nosotros nos comemos el garron de jugar con un afk en el team","replies":[]},{"poster":"MatiasZERO","date":"2015-03-14T13:48:34.519+0000","up_votes":1,"down_votes":0,"body":"Esta misma gente es la que se tira 1v5 en el juego, y luego dicen por chat \"gg team\"...","replies":[]},{"poster":"Gladiator314","date":"2015-03-14T09:45:37.987+0000","up_votes":1,"down_votes":0,"body":"es muy cierto es horrible eso urgentemente tendrian que sacar eso del leaver buster las mayorias de las veses que juego se me sale por la coneccion :/ y no me deja jugar por el leaver buster","replies":[]},{"poster":"Shiny Teemo","date":"2015-02-01T21:55:42.543+0000","up_votes":1,"down_votes":0,"body":"Para llegar a la sanción de 20 minutos hay que abandonar muuuuchas partidas y pasar por las sanciones mas pequeñas, por lo tanto esta bien.","replies":[]},{"poster":"Mr Bard Times","date":"2015-02-01T19:47:00.356+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=_n5E7feJHw0","replies":[]},{"poster":"Pascut","date":"2015-02-01T19:43:27.012+0000","up_votes":1,"down_votes":0,"body":"Nope, el sistema esta perfecto así","replies":[]}]}