{"poster":"Fayzth","date":"2019-07-25T02:57:56.345+0000","title":"Alyssa - Die Arkanzauberin","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"Hey Leute,\r\n\r\nIch hab mal ein ein Paar Ideen zusammen geworfen und bin auf ein meiner Meinung nach interessantes Skillkonzept gekommen.\r\nDie Idee war dabei ein Kit zu erstellen, welches verschiedene Kombinationsmöglichkeiten für verschiedene Situationen mitbringt, allerdings niemals zu \"opressive\" ist. Die Fähigkeiten sollten einfach zu verstehen sein und nicht völlig überladen (wobei das W schon hart an der Grenze ist), und sollten immer \"outplaymöglichkeiten\" bieten. \r\n\r\nDenkt bitte daran das es sich hierbei nur um einen frühen Entwurf handelt, aber ich bin gespannt wie eure Meinung zu diesem Konzept ist.\r\nAlso dann, viel Spaß mit Alyssa... (übrigens, das Bild ist nicht von mir. Es ist einfach von Google geklaut, traf aber ganz gut wie ich sie mir Vorgestellt habe :)\r\n\r\n\r\nhttps://imgur.com/a/GyKC8O5\r\n\r\n\r\n ##Rolle\r\n\r\n- \"Poke\" Magier mit hoher Reichweite und Konstantem Schaden\r\n\r\n\r\n ##Fähigkeiten\r\n\r\nP - Arkane Brillianz: Wenn Alyssa mit einem arkanen Fragment interagiert erhält sie 5% zusätzliche Fähigkeitsstärke für 8 Sekunden. \r\n                      \r\nDieser Effekt ist bis zu 3 mal stapelbar.\r\n\r\n\r\nQ - Arkanschlag: Alyssa verschießt ein arkanes Projektil welches 90/130/170/210/250 + 0,7 x Fähigkeitsstärke Schaden verursacht, welcher jedoch mit jedem getroffenem Gegner um 10% verringert wird, bis zu einem Minimum von 50%. Am Ende des Flugweges des Projektils entsteht ein arkanes Fragment, welches mit ihren anderen Fähigkeiten interagiert.\r\n  \r\nDiese Fähigkeit kann bis zu 1,5 Sekunden aufgeladen werden, um die Reichweite zu erhöhen.\r\n                 \r\nReichweite: 400-1050 Einheiten\r\n                 \r\nAbklingzeit: 10/9/8/7/6 Sekunden\r\n                 \r\nManakosten: 80/85/90/95/100\r\n      \r\n\r\nW - Barriere/Kraftwelle: Alyssa schützt sich mit einem Schild aus arkaner Energie, welcher bis zu 50/65/80/95/110 + 0,3 x Fähigkeitsstärke MAGISCHEN Schaden absorbiert. Diese Fähigkeit kann Reaktiviert werden um eine Kraftwelle auszusenden, welche alle getroffenen Ziele um 300 einheiten zurückwirft und diesen 80/110/140/170/200 + 0,4 x Fähigkeitsstärke Schaden zufügt. Bei der Reaktivierung wird der Schild zerstört. \r\n\r\nSollte W - Kraftwelle ein arkanes Fragment treffen, explodiert dieses, fügt allen Gegnern in einem Radius von 350 Einheiten Schaden zu und verlangsamt diese 3 Sekunden lang um 40%\r\n                         \r\nReichweite: 650 Einheiten\r\n                         \r\nAbklingzeit: 20/19/18/17/16 Sekunden\r\n                         \r\nManakosten: 80 auf allen Rängen\r\n\r\n\r\nE - Kraftentzug: Alyssa entzieht dem Ziel Kraft, wodurch diesem 80/100/120/140/160 + 0,35 x Fähigkeitsstärke Schaden zugefügt wird und sie 15% ihres fehlenden Manas wiederherstellt. \r\n \r\nDiese Fähigkeit kann auch auf arkane Fragmente eingesetzt werden. Sollte dies der Fall sein erhält Alyssa 2 Sekunden lang 30% Bewegungsgeschwindigkeit.\r\n                \r\n Reichweite: 600 Einheiten\r\n                 \r\nAbklingzeit: 10 Sekunden auf allen Rängen\r\n                \r\nManakosten: 0 auf allen Rängen\r\n\r\n\r\nR- Arkanes Gefängis: Alyssa verschießt ein arkanes Projektil welches den ersten Getroffenen Champion für 2 Sekunden Betäubt und diesem 300/375/450 + 0,6 x Fähigkeitsstärke Schaden zufügt.\r\n                     \r\nSollte dieses Projektil ein Arkanes Fragment treffen, explodiert dieses und betäubt ALLE Gegner in einem Radius von 450 Einheiten.\r\n                     \r\nReichweite: 1000 Einheiten\r\n                     \r\nAbklingzeit: 160/140/120 Sekunden\r\n                     \r\nManakosten: 100 auf allen Rängen\r\n\r\n\r\n\r\n---\r\n\r\nAlso dann, ich hoffe es hat euch gefallen.\r\nSchreibt mir doch mal eure Meinung :)\r\n\r\nMfg Fayzth","replies":[{"poster":"TheGanera","date":"2019-07-25T10:36:09.042+0000","up_votes":3,"down_votes":0,"body":"Zuallererst möchte ich mich dafür bedanken, dass du \"stapelbar\" und nicht \"stackbar\" geschrieben hast. Nachdem das geklärt wäre, habe ich folgendes anzumerken:\n\n* Ich halte die Menge an Fähigkeitsstärke, die Alyssa durch ihre passive Fähigkeit erhält, für zu gering. Überhaupt erachte ich persönlich den simplen Gewinn von Fähigkeitsstärke als etwas zu stumpf oder langweilig. Rein formal muss ich hier auch noch darauf hinweisen, dass der Begriff \"Interaktionen\" für mich uneindeutig ist. Ich bin mir noch immer nicht gänzlich sicher, ob auch das erschaffen der arkanen Fragmente eine Interaktion darstellt. Sollte dem, wie ich erwarte, nicht so sein, schlage ich vor das Wort in \"verbraucht\", \"zerstört\" oder ähnliches zu ändern.\n* Bei \"Arkanschlag\" muss ich sofort an Xeraths Q-Fähigkeit denken. Überhaupt ist es etwas ungünstig, wenn sowohl Thema als auch Klasse eines neuen Konzepts sich bereits im Spiel befinden.\n* Ich habe zwei grundlegende Probleme mit der Fähigkeit \"Barriere/Kraftwelle.\"\nDas erste ist, das einem Magier dieser Kategorie eine defensive Fähigkeit derartiger Effektivität meines Erachtens nach nicht steht. Sollte man es doch mal geschafft haben, nahe genug an Alyssa heranzugelangen, um sie in Bedrängnis zu bringen, erweist sich eben jene Bedrängnis durch einen Schild gefolgt von einem Zurückstoßen und anschließender Verlangsamung schnell als Illusion (zumal auch \"Arkanes Gefängnis\" ihr Zugang zu schwerer Massenkontrolle gewährt).\nDank ihrer passiven Fähigkeit ist es für Alyssa von höchster Wichtigkeit mit ihren arkanen Fragmenten zu interagieren. Nun hat sie aber eine klar defensive Fähigkeit, gedacht, soweit ich das erkennen kann, für den Selbstschutz, die sie aber gleichzeitig benötigt, um Komulationen von \"Arkane Brillianz\" zu generieren. Was soll sie also tun? Entweder, sie verzichtet stets auf Schaden, was unbedfriedigend scheint, oder, sie setzt \"Barriere/Kraftwelle\" ein, ohne das sich Gegner im Wirkungsradius befinden. Beides erachte ich als unschön.\n* \"Kraftentzung\" kommt mir etwas banal vor. Dazu folgt später mehr.\n* An \"Arkanes Gefängnis\" habe ich wieder zwei Aspekte zu bemängeln. Erstens ähnelt diese ultimative Fähigkeit für mich zu sehr der Sejuanis. Und zweitens verfügt dieser Champion bereits über die Möglichkeit eine zirkelförmige Explosion (oder Kraftwelle) auszulösen. Hier wäre wieder etwas aufregenderes nett.\n* Mein Hauptproblem mit dem Konzept ist, dass es, soweit ich das erkennen kann, auf mich kaum wie ein neuer eigenständiger Champion wirkt. Die meisten Fähigkeiten beinhalten einfach nur Schaden und etwas Massenkontrolle. Mir fehlt da etwas Charakter. Es geht hierbei nicht darum, Dinge so kompliziert wie möglich zu gestalten. Stattdessen sollte ihnen eine gewisse Komplexität zu Grunde liegen. Als Beispiel führe ich die Q-Fähigkeit von Tahm Kench an. Für sich genommen außerordentlich simpel, doch in Kombination mit der seiner passiven Fähigkeit oder seiner W-Fähigkeit entfaltet sie Schönheit. \nMein Verbesserungsansatz wäre eine verstärkte Beschäftigung mit den Fragmenten und ihrer Positionierung. \n\nAbschließend möchte ich noch lobend und freudig überrascht bemerken, dass dieses Konzept für ein Erstlingswerk erstaunlich konsistent war.","replies":[{"poster":"INoKami","date":"2019-07-25T15:22:04.907+0000","up_votes":2,"down_votes":0,"body":"Warte... wir haben jetzt einen dritten, der Bewertungen schreibt?\nJa, ist denn heut´ schon Weihnachten?! :D","replies":[]},{"poster":"Fayzth","date":"2019-07-25T16:32:49.054+0000","up_votes":1,"down_votes":0,"body":"Hey :)\n\nvielen dank erstmal für deine netten Worte und konstruktive Kritik. Bin schon kräftig am überlegen wie ich das Kit ändern kann, sodass es sich nach mehr anfühlt. Leider fällt es mir schwer auf etwas zu kommen was sich nicht wie \"geklaut\" oder wie Ryze-Rework Nummer 32 anfühlt.\n\nAber sobald ich was habe Poste ich es hier rein/überarbeite den Post :)","replies":[{"poster":"Amycos Cyrus","date":"2019-07-25T17:39:16.849+0000","up_votes":1,"down_votes":0,"body":"Grundsätzlich mach dir nicht so viele Gedanken über das \"geklaut\".\nThe Ganera hat ja nicht explizit gesagt, dass das Kit geklaut wirkt, das wesentliche Problem besteht eher darin, dass die Fähigkeiten sehr allein stehend wirken. Daher überleg dir eher, wie du den Fragmenten eine zentralere Position gibst, ohne den Spieler zu zwingen wesentliche Aspekte nur zum Erhalt der Passiven in den Sand zu setzen. (Das wurde im Bezug auf die W ebenfalls bereits erwähnt)\n\nEin weiterer Aspekt, der mir aufgefallen ist, ist dass du nicht einmal charakterisierst, was diese Fragmente überhaupt sind. Handelt es sich um Objekte, wie die Syndra-Bälle (Besitzen keine Hitboxen/Leben etc.) oder eher um eine Größe wie die Illaoi-Tentakel (besitzen Hitboxen/Leben etc.)\n\nDas Konzept wirkt aufgrund er fehlenden Zusammenhänge wie die Summe anderer Champions. Natürlich interagiert jede Fähigkeit irgendwie mit der Passiven, aber wie agieren die Aktiven untereinander. (Auch dies war am Bespiel der Q-W-Kombination von Tahm angesprochen)","replies":[]},{"poster":"TheGanera","date":"2019-07-25T17:24:42.969+0000","up_votes":1,"down_votes":0,"body":"Du könntest ja tatsächlich eine Überarbeitung von Ryze verfassen. Falls du es noch nicht gelesen hast, was ich ob deiner relativ strukturierten Arbeit und der Verwendung des Wortes \"Skillkonzept\" stark bezweifle, könnten dir folgende Richtlinien als Denkanstöße dienen: [[How To] Richtlinien zum Erstellen eines Championkonzepts](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/biMI3xbE-how-to-richtlinien-zum-erstellen-eines-championkonzepts)","replies":[]}]}]}]}