{"poster":"TheJumpingMan","date":"2016-06-01T02:40:26.701+0000","title":"Bronze is..... *sigh","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"I wish I could get out of Bronze. It just frustrates the shit out of me. So Im currently stuck in Bronze 3. After being demoted 2 times... and I just think to myself at times... what is going on inside these people&#039;s heads. Granted I&#039;m not the best player, I have a lot of rough games. Due to the fact that my lakers are not the best. I try to ping them and tell them what to do. And all that ends up happening is them dying to a jungle gank, to a 1v1, or strait up just diving for no reason. And then this leads to their laner snowballing and killing everyone else. Im just here in top lane while everyone dies... I do teleport down bot lane and get them kills.. but that isn&#039;t enough. they just get blown up in fights because of their lack of knowledge of positioning. And my team loses an objective. I try my hardest to get my team snowballed.. but It never seems to work. I shot call, pressure the names, and collapse when the enemy is out of position. And I even wave manage my wave (freezing it, etc.). I just really wish bronze didn&#039;t exist... I just want silver this year. And to top it all off it fucks my placements next season because i got demoted 2 fucking times... I hate this game sometimes. The most when I lose. 90% of you people are gonna ignore this. W/E no one even pays attention to what I say.... Bronze sucks for me.  {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Vanilla Bread","date":"2016-06-01T04:54:37.557+0000","up_votes":2,"down_votes":1,"body":"focus on yourself if you were that good then you wouldnt be in bronze","replies":[]},{"poster":"FideiAngelus","date":"2016-06-01T04:45:44.280+0000","up_votes":2,"down_votes":1,"body":"I think your mentality is wrong. IF bronze didn't exist, you'd just be in silver complaining about how silver shouldn't exist and you want to get into gold.  Furthermore, yes its a team game, which means you have to play cohesively. There are a lot of games I lose because people are busy typing and arguing about every single mistake. The way to win is just let mistakes go by and focus on helping each other win. A lot of the times, losing teams have the wrong attitude and start letting their teammates die because\n1) you hate that guy because he's arguing with you\n2) you think there's no way to win so might as well let him die\n3) you think you're better than them so you should just let them die to point out their bad positioning\n\nIt's all about working together to win. If someone gives up first blood or dies 4 times in a row, don't go pointing out their mistakes or thinking you've lost. Just try hard to win your lane and win the team fights. Don't let other lanes tilt you. If people are arguing, just play your best and don't join in. If you're playing badly, take a break. Just improve on yourself and you'll be able to win more.\n\nIf you're dominating your lane, buy a pink and use your trinket in enemy jungle. It helps a lot if you can ping the jungler so your teammates can react to it","replies":[]},{"poster":"Dracuula","date":"2016-06-01T04:11:51.326+0000","up_votes":1,"down_votes":0,"body":"I'm looking at your match history and in nearly every loss you have more deaths than kills. If you were truly meant to get out of bronze 3 then you wouldn't rely on your team to do it for you. \n\nI was placed in Bronze 3 because that's where I'm meant to be, but I'm slowly moving my self out of it and I'm currently bronze 2 and the only way I've been doing that is carrying my self out.","replies":[{"poster":"YellowBrickRoad","date":"2016-06-01T05:46:47.778+0000","up_votes":1,"down_votes":0,"body":"placement doesn't really matter tbh. i placed b3 in s5 on my other account, b1 on this account and now im b5\n\nI highly doubt i actually got worse at the game in the last year.","replies":[]}]},{"poster":"YellowBrickRoad","date":"2016-06-01T05:44:28.164+0000","up_votes":1,"down_votes":0,"body":"ima go with feeders, i can deal with an uncoordinated team, or even an afk, and ragers are nothing.\n\nBut when you have a 20/2 darius barreling down a lane dunking people i dont care how hard you dominated your own lane and farmed and pushed towers, you are gonna get dunked.","replies":[]}]}