{"poster":"RaiDemon","date":"2018-12-16T19:55:43.767+0000","title":"Wo bleibt die Motivation?","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":2,"body":"Hallo!\r\n\r\nIch frage mich immer wieder &quot;Wo bleibt die Motivation der Spieler h&auml;ngen?&quot;. Ich bin neu im hohen Platin Bereich, und je h&ouml;her ich komme desto mehr f&auml;llt mir auf das Spieler einfach selbst nach 5 Minuten schon aufgeben wollen. Klar, ich habe oft geh&ouml;rt &quot;wenn dich das wundert warst du ja nie im hohen Elo Bereich und blablabla&quot;. Aber jetzt mal im ernst. Wozu spielt man denn ranked Games? Eben um sein bestes zu zeigen und aufzusteigen, wo ist denn der Sinn wenn man nach 5 Minuten schon aufgeben will obwohl es sehr wohl Chancen gibt zu gewinnen? Aber die meisten entscheiden sich eher aufzugeben und tilten dann wie verr&uuml;ckt. Seine Chancen wegwerfen nur weil die eigene Lane nicht gut lief ist irgendwie nicht der Sinn dieses Games..Vor allem der Moment wo ich gelernt habe nicht zu tilten bei egal was grade ist, steige ich auch auf, und bin in kurzer Zeit von Plat 5/4 auf Plat 1 sogar mit Diamond Promo gekommen...Kann mir das jemand erkl&auml;ren, jetzt wo ich neu in dieser Elo spiele? Es ist schon frustrierend zu sehen wie schnell Spieler einen gut m&ouml;glichen Sieg wegwerfen.. :/ Vor allem weil man nicht immer heftige 20/0 stehen muss um einen Sieg zu erlangen da das Game viel mehr als Kills ist..Und die meisten geben schon bei 0/3 auf..\r\n\r\nGr&uuml;&szlig;e RaiDemon {{sticker:sg-miss-fortune}}","replies":[{"poster":"Awsane","date":"2018-12-16T23:59:05.144+0000","up_votes":3,"down_votes":0,"body":"> Ich bin neu im hohen Platin Bereich\n\nIch glaube (Achtung nicht wissen) die meisten Spieler in dieser Elo sind resigniert.\nWeil träume ausgeträumt wurden. Ich glaube der Großteil der Platinspieler sind keine frischen Spieler sondern alte Hasen, die schon mal bessere Zeiten gesehen haben. Und diese Spieler sind von allem möglichen frustriert, aber vor allem von sich selber, weil sie eben es doch nie nach Master geschafft haben und weil sie momentan nicht mal Dia sind. Und wenn es dann in einem Spiel nicht den Erwartungen entsprechen läuft haben diese Spieler schnell auch keine Lust weiterzuspielen. Für diese Spieler steht sowieso nicht mehr so viel auf dem Spiel. Wenn sich so ein alter Hase kurzzeitig mühe gibt kommt er relativ schnell nach Platin, aber bis nach high Dia isses dann eben doch noch deutlich anstrengender.\n\nNicht umsonst gibt es mittlerweile Streams die sich sowas wie Platin/dia Pleb, in die Jahre gekommen washed out etc pp selber nennen. Das ist genau die oben beschriebene Haltung.\n\nViele Hegen zu LoL eine Hassliebe, das man nur spielt weil man es doch recht gut kann und oder der soziale Status (Freundesgruppe) daran hängt.","replies":[{"poster":"ImTheFox115","date":"2018-12-17T05:45:38.596+0000","up_votes":1,"down_votes":2,"body":"Nicht zu vergessen die Spieler die seit 5 Seasons Platin sind und nie nach Dia kommen XD","replies":[{"poster":"Qbert","date":"2018-12-20T07:09:53.793+0000","up_votes":2,"down_votes":0,"body":"hey, das geht mir auch so >:( \n\nIch bin auch zwischendurch frustriert, aber ich gebe trotzdem nicht auf oder trolle dumm rum ... hätte ich doch nur mehr Zeit und bessere Augen! >.<","replies":[{"poster":"RaiDemon","date":"2018-12-20T18:41:52.389+0000","up_votes":2,"down_votes":0,"body":"Ja, zweimal war ich in der Dia Promo weil ich eine dicke winrate hatte bzw winstreak. Aber der Moment wo ich in der Promo immer bin bekomme ich nur noch Leute die flamen, afk gehen oder inten und das geht so bis ich fast auf 0 LP wieder bin. :/","replies":[]}]}]},{"poster":"RaiDemon","date":"2018-12-20T01:11:25.135+0000","up_votes":2,"down_votes":0,"body":"Es ist nur so frustrierend. Zudem war ich schon 2 mal in meiner Diamond Promo die Woche und jedes mal intet, flamed oder jemand geht afk ^^ Es ist halt traurig zu sehen wie die Spieler nichtmal in Rankeds Motivation finden..Selbst wenn man Chancen hat :/ Was auch immer daran verwerflich ist wenn jemand viele Rankedgames in einer Elo hat, jeder braucht so seine Zeit. Aber das liegt dann leider an dem großteil der Community. Lese immer wieder wie sich Leute so gegenseitig flamen : \"ha you're a noob 300 games in Plat you are just sad cuz you're hardstack hahahaaha\"..Und ich sitze in dem Spiel und denke \"Man es gibt doch wichtigeres zu tun jetzt als die Spiele von dem Spielern nachzusehen\" ^^ Außerdem hat diese Person vielleicht 900 Games weil sie sich aus den tiefsten Löchern hochgecarried haben? Das ist dann eher Lobenswert!","replies":[]}]},{"poster":"Pure Cynicism","date":"2018-12-17T09:25:01.389+0000","up_votes":2,"down_votes":0,"body":"Ich fand Platin eigentlich deutlich entspannter als Gold. Kann aber auch nur meine persönliche Wahrnehmung sein.","replies":[{"poster":"RaiDemon","date":"2018-12-20T01:14:19.796+0000","up_votes":2,"down_votes":0,"body":"Ja durch Platin durch war es auch relativ entspannt aber jetzt ab Platin 1 wird es wieder schlimmer\n {{sticker:sg-lulu}}","replies":[]}]},{"poster":"ImTheFox115","date":"2018-12-17T05:44:47.269+0000","up_votes":2,"down_votes":1,"body":"Wenn du noch höher kommst, wird das ein noch größeres Problem xD\n\nIn meinen Games (Dia2) wird meiner Meinung nach noch härter getrollt... \nVorsllem Jgler sind heftigst betroffen...","replies":[{"poster":"RaiDemon","date":"2018-12-20T01:12:56.751+0000","up_votes":2,"down_votes":0,"body":"Ja merke schon in den Dia Promos wie verrückter das Game immer wird :/ Hab schon zweimal die Promos nicht geschafft \n{{sticker:sg-soraka}}","replies":[]}]},{"poster":"7Soraka7","date":"2019-01-20T02:19:13.349+0000","up_votes":1,"down_votes":0,"body":"Das Ranked System ist voll versift und von Champbalance kann man hier nicht Sprechen. Spiel zum Spaß und wenn es Dir kein Spaß mehr macht einfach ausmachen und was sinnvolles tun. Das game ist Totgepatcht, Spiel Fotinit da gehts noch spaßmäßig ab!","replies":[]},{"poster":"SuicidePlank","date":"2018-12-16T19:59:48.353+0000","up_votes":3,"down_votes":3,"body":"Naja, wenn mein Midlaner 0/5 steht, der Gegner Mitte Yasuo/Talon/Karthus/Neeko hat und wir early/midgame sind und trotzdem aufs Maul bekommen..dann habe ich schon wenig Hoffnung das wir das Spiel noch drehen. \nEs gibt Spiele bei denen es einfach sehr schnell entschieden ist und ich für meinen Teil verschwende meine Zeit nicht gerne auf diese, nur um weiterhin abgefarmt zu werden.","replies":[]}]}