{"poster":"KatabaticWind","date":"2016-05-05T08:31:32.733+0000","title":"Native Notifications","subforum":"Client Discussion","up_votes":6,"down_votes":0,"body":"I have always wondered why there is still no way to see what&#039;s happening in the client while it&#039;s out of focus. Sometimes I&#039;m looking something up, setting up a call, or some other reason for the launcher to not be in focus&mdash;but I don&#039;t know why it&#039;s beeping without switching to it.\r\n\r\nI&#039;m really hoping for a future update to take advantage of the OS X &amp; Windows 10 system notifications (banners/toasts) for things such as chat, invites, friend requests, online friends, game updates (those &quot;!&quot; notifications on the top left), etc&hellip;\r\n\r\nBeing able to see a chat message and even use the built in response option with notifications would make it so much easier to see what&#039;s going on while still setting up. Using notification buttons to accept/decline an invite for a game or friend request is also one of the most useful notifications as well.\r\n\r\n\r\nHope to see this feature in a future update!\r\n\r\n~Thanks!","replies":[{"poster":"Riot a huevo","date":"2016-05-14T03:11:43.378+0000","up_votes":3,"down_votes":0,"body":"We definitely have these things in our radar and we are discussing how to improve the client notifications.","replies":[{"poster":"KatabaticWind","date":"2016-06-03T06:23:21.564+0000","up_votes":1,"down_votes":0,"body":"Thanks. ~~I still would prefer to have the in client notifications when the launcher is in focus and only display native notifications when it's out of focus.~~\n\nEdit: I have the alpha client now. In client toasts are gone and there's now an even better system for notifications while using the client. Hopefully macOS banners and Windows toasts can be added for when not in focus (using a different app).","replies":[]}]},{"poster":"yolabas","date":"2016-05-06T15:23:10.500+0000","up_votes":2,"down_votes":0,"body":"Something else is that maybe the game icon could flash differently based on the type of notification it is? Currently, if I'm multitasking and also trying to find people to league with, every notification doesn't hold the same importance. If I see the \"L\" flashing on the toolbar, it could be a random message from someone and I'm okay waiting a while to respond, or it could be a game invite, which is time sensitive.\n\nI'm not sure if toasts are the best way to do that (I personally hate that method of notification, so I'm biased), but definitely have some sort of \"ping sort\" so that we know what the client is trying to tell us.","replies":[{"poster":"KatabaticWind","date":"2016-05-08T07:44:07.197+0000","up_votes":1,"down_votes":0,"body":"Banners on Mac are the standard way of notifications now; replacing Growl. So they are the best way when comparing Growl vs. \"native\" notifications.","replies":[]}]}]}