{"poster":"AXSUS","date":"2019-01-07T01:33:22.626+0000","title":"¿Por que si salgo positivo o no fedeo no puedo ganar partidas? :'v","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"En mi historial de partida sucede lo del titulo, no se que mas hacer para ganar partidas\r\n\r\nhttp://las.op.gg/summoner/userName=AXSUS veanlo ustedes mismos y ayudenme a mejorar\r\n\r\nPor adelantado gracias :D","replies":[{"poster":"WhiteMax","date":"2019-01-07T03:40:26.508+0000","up_votes":3,"down_votes":2,"body":"La partida se gana rompiendo el nexo. No se trata de quien saca el mejor score o feedea menos.","replies":[{"poster":"AXSUS","date":"2019-01-07T13:49:23.380+0000","up_votes":1,"down_votes":1,"body":"Si pero si nadie quiere hacer objetivos y una vez que matan a alguien siguen la kill y se mueren yo no puedo hacer nada","replies":[{"poster":"WhiteMax","date":"2019-01-07T15:04:12.072+0000","up_votes":2,"down_votes":0,"body":"Ese es el problema del juego actualmente, ya no se puede carrear solo como en temporadas anteriores, ahora dependes minimamente que el team rival sea malisimo y/o los carreados quieran cooperar.","replies":[{"poster":"AXSUS","date":"2019-01-07T22:55:22.371+0000","up_votes":1,"down_votes":0,"body":"siguiendo esa logica nunca voy a poder hacer nada por que hago lo mejor que puedo dentro de mi nivel de juego","replies":[]}]}]}]},{"poster":"Lycanroc","date":"2019-01-07T02:13:51.264+0000","up_votes":2,"down_votes":0,"body":"No tomas buenas decisiones, no puedo decir cuales porque no podemos ver tu partida. Pero seguro es falta de macro","replies":[{"poster":"AXSUS","date":"2019-01-07T02:50:54.969+0000","up_votes":1,"down_votes":1,"body":"Me podrias ayudar con el Macro we ? :D","replies":[{"poster":"Lycanroc","date":"2019-01-07T07:41:36.388+0000","up_votes":1,"down_votes":0,"body":"No me considero adecuado para enseñar eso la verdad, no me considero el mejor para enseñar como llevar una partida a la victoria solo, ya que siempre juego en premade. Podría decirte mil cosas sobre objetivos y aprovechar errores enemigos, pero carrear personas  es muy algo complicado de hacer que no manejo bien (más porque la mayoría de mains champ son de tf). No es que no quiera ayudarte, pero seria muy hipócrita de mi parte, ya que hasta a mi me cuesta ese aspecto.\nSolo un consejo: Trata de orientar el juego a los \"que mejor juegan\" en tu equipo.","replies":[]}]},{"poster":"AXSUS","date":"2019-01-07T02:50:09.670+0000","up_votes":1,"down_votes":0,"body":"Si, me falta mejorar eso, yo coopero, hago objetivos pero cuando mi equipo ve que estamos ganando siguen la kill o hacen jugadas arriesgadas y quedamos con uno o dos menos, y no podemos 5vs3 eso pasa en mi ultima partida fijate, yo aun cuando fedeo trato de ser de utilidad, por ejemplo fedeo con vayne pero trato de meter el stun y sacar alguna que otra kill o como no doy oro hago objetivos o tiro torres o baiteo","replies":[]}]},{"poster":"shy1","date":"2019-01-07T07:12:39.839+0000","up_votes":2,"down_votes":4,"body":"Por que no sabes jugar correctamente para carrear una partida. {{sticker:vlad-salute}}","replies":[{"poster":"AXSUS","date":"2019-01-07T13:50:30.187+0000","up_votes":3,"down_votes":1,"body":"Vos sabes jugar correctamente? si yo trato de hacer todos los objetivos pero nadie acompaña el juego se vuelve un 1vs9","replies":[]}]},{"poster":"yyu","date":"2019-01-07T20:23:28.238+0000","up_votes":1,"down_votes":0,"body":"Trata de jugar con un duo","replies":[]},{"poster":" Acantha","date":"2019-01-07T01:35:23.683+0000","up_votes":2,"down_votes":2,"body":"Por que es un juego en equipo y por mucho que juegues a nivel **PRO 4K NATIVO** aun están tus otros 4 compañeros que deben cooperar...y tu cooperar con ellos.\n{{sticker:sg-jinx}}","replies":[{"poster":"AXSUS","date":"2019-01-07T01:38:42.898+0000","up_votes":1,"down_votes":3,"body":"Yo coopero, hago objetivos pero cuando mi equipo ve que estamos ganando siguen la kill o hacen jugadas arriesgadas y quedamos con uno o dos menos, y no podemos 5vs3 eso pasa en mi ultima partida fijate","replies":[]}]},{"poster":"AXSUS","date":"2019-01-07T01:49:06.098+0000","up_votes":1,"down_votes":3,"body":"Cabe aclarar que yo sigo las jugadas mas coherentes, pero cuando hago quiero que hagan baron o como se ponen a farmear la jg y si soy una kaisa a media build no me puedo hacer el baron por eso quiero su opinion asi me ayudan a mejorar.\n\nEl comentario de Yami es la dinamica del juego por eso no le veo sentido alguno.","replies":[]}]}