{"poster":"Levesente","date":"2017-07-05T19:42:29.659+0000","title":"Nem tudok kijutni bronzból","up_votes":2,"down_votes":5,"body":"Most pedig j&ouml;nn a tipikus bronz sz&ouml;veg hogy a &quot;CSAPAT A ROSSZ&quot; igen az mert topon vagyok {{champion:240}} el mindig siker&uuml;l ugy kezdeni kb hogy 4/0 ban vagyok csak ut&aacute;na elkezd valamelyig lane feedelni &eacute;s v&eacute;ge az eg&eacute;sz meccsnek.\r\nSz&oacute;val ki mi alj&aacute;n ?","replies":[{"poster":"M4dr4c","date":"2017-07-05T20:06:37.955+0000","title":null,"up_votes":5,"down_votes":1,"body":"Először is tanulj meg farmolni. Minden játékban messze rosszabb a farmod, mint ami kellene. Nem mondom, hogy LCS szintet hozzál, de ha olyan hősöket választasz, akiknek nagyon kell a pénz, akkor ennél jobban kell teljesíteni mindenképp.\nA másik dolog, ha megnyerted a topot, akkor menj és gankelj. Segíts megnyerni a többi lanet is, verjétek be a tornyokat.\nWardolj sokat. Ez már rég nem a support feladata, hanem mindenkié. Nagyon fontos, hogy lássátok mi is történik épp.","replies":[{"poster":"TechNoob","date":"2017-07-06T14:27:00.008+0000","title":null,"up_votes":2,"down_votes":2,"body":"nekem milyen a farmom? :P Egyszer az egyik repülő hőssel volt 500+ minionom :D","replies":[{"poster":"M4dr4c","date":"2017-07-06T15:14:29.503+0000","title":null,"up_votes":2,"down_votes":1,"body":"Honnan tudjam milyen a farmod. Trágyázod? ;)","replies":[{"poster":"TechNoob","date":"2017-07-06T19:52:00.369+0000","title":null,"up_votes":1,"down_votes":1,"body":"Majd küldök répát meg káposztát :D Igazi első osztályú és bio farmról való! xD (Alistar kiváló minőségű trágyát képes adni)","replies":[]}]}]}]},{"poster":"Haruszame","date":"2017-07-05T20:05:49.221+0000","title":null,"up_votes":3,"down_votes":0,"body":"Amikor topon 4/0-ban vagy, az ellenfél csapatánál 4 játékos gondol arra, hogy a top már megint feedel.","replies":[]},{"poster":"jorrgi","date":"2017-07-06T07:57:28.345+0000","title":null,"up_votes":2,"down_votes":0,"body":"Sírás helyett tanulj meg játszani. \"Ha magadra koncentrálsz , nem lesz időd másokat kritizálni\" - Lakatos Brendon a hely gyúróterem királya.","replies":[]},{"poster":"Rantnad","date":"2017-07-05T20:38:29.128+0000","title":null,"up_votes":2,"down_votes":0,"body":"Bronzban híresen nincs csapatmunka (ami gold tetejéig sokat nem javul). Nem tudom, hogy melyik várólistán akarsz feljebb jutni, de össze kellene szedned olyan ember(eke)t, aki(k) azért tud(nak) egy szinten játszani (legalább annyira, hogy csapatban tud(nak) mozogni). Ha másra nem is, legalább bronzból ki fogsz tudni jutni.","replies":[]},{"poster":"Ia Cthulhu","date":"2017-07-05T19:48:14.797+0000","title":null,"up_votes":3,"down_votes":4,"body":"Ha topot játszok, akkor mid meg bot feedel.\nHa midet játszok, akkor top meg bot feedel.\nHa botot játszok, akkor top meg mid feedel.\nHa jungelt játszok, akkor meg minden lane feedel.\n\nNem mondom azt, hogy %%%%% jó játékos vagyok, mert nem, de ha csak rajtam múlna -- vagy legalább nem lennének full %%%%%%áltak azokkal akikel összedob -- 10-ből 8 meccset simán megtudnánk nyerni. A maradék kettőt azt én cseszném el, bevallom. De 10-ből jó ha 2-t meglehet nyerni mert olyan csapatösszeállítások vannak, hogy no comment.\nÉs persze rálehet fogni, hogy másnak bezzeg sikerült kijutni csak te vagy szar, de azért ez nem fedi le a valóságot. Inkább szerencse kérdése a dolog. Mondjuk ha annyira akarnék akkor kitunék jutni bronzból, mert már sikerült nem nagy dolog csak 2-3 champet kell folyamatosan spammelni amivel tudsz játszani és 1v9-be carryzed. Ez viszont %%%%% unalmas, így marad bronz.","replies":[{"poster":"The One ESCANOR","date":"2017-07-06T05:40:32.417+0000","title":null,"up_votes":1,"down_votes":0,"body":"Aha szóval inkább maradsz bronzba mert unalmas lenne climbolni xD Persze ennyi erővel akkor bárki kitud jutni csak biztos unalmas neki ,ezért flamel és nyit témákat fórumra hogy nem tud kijutni :)  Te meg elsőnek tanulj meg buildelni mert aki full ap supportot játszik max 1 support itemmel az meg is érdemli hogy elo hell alján maradjon.","replies":[{"poster":"Ia Cthulhu","date":"2017-07-06T08:16:32.025+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem tudom, hogy te hogy vagy vele, de 1-2 hőst tolni folyamatosan %%%%% unalmas és elveszi a szórakozást a játékból.","replies":[{"poster":"FranklinDelanoR","date":"2017-07-06T10:26:01.343+0000","title":null,"up_votes":2,"down_votes":1,"body":"Szerintem Bronzból nem csak 1-2 hőssel lehet kijutni, az inkább silver, gold ban lehet sikeres. A bronz szint az tényleg ismeret és skill hiány, saját tapasztalatból is mondom. Lásd többen mondták nem tud farmolni, wardolni, buildelni stb... De ez csak a legkevesebb ezektől függetlenül még simán képviselhet valaki bronzos szintet. Pl: Nem tud csapatban játszani, tipikus bronzos hiba, hogy vlki megöleti magát 1v5 -be hogy elhozzon egy amúgy felesleges killt. Tanként nem a carryt védi meg, hanem ész nélkül megy előre. ADC ként azt hiszi, hogy ő a tank és neki kell kezdeményeznie és elől lennie.\nRossz csapatharcokat kezdeményez, úgy bebaiteli a csapatát, hogy garantált legyen az Ász, ami a játék végén egyenlő a vereséggel.\nNem ismeri a hősöket. Simán, hoz egy Kyle ellen Zedet, mert ő tud a legjobban Zeddel játszani. Nem ismeri fel melyik ellenfél veri meg őt 1v1-be és melyik nem. 1-2 ösvényt ismer azon tud játszani, ezzel nem csak az a baj, ha autofillt kap akkor kikapnak, hanem nem ismeri más ösvények játékstílusát, erősségeit és gyengeségeit.","replies":[]}]}]}]},{"poster":"Max Stirner","date":"2017-07-06T08:07:29.192+0000","title":null,"up_votes":1,"down_votes":0,"body":"De ARANYOS! (Lásd: LoL Állatfajok)","replies":[]},{"poster":"Storiaron","date":"2017-07-05T20:20:11.752+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha rossz a farmod, akkor ameddig nem javul(ez jön a tapasztalattal, de ugye lehet külön erre gyakorolni)néznék a helyedben egy erős split push champet. Mondjuk Yorick/Trynda esetleg, ők nem függenek a csapatuktól, és bronzban nem is tudnak reagálni majd az ellenfeleid, ha jól tudsz splitelni. \n\nDe amúgy itt majd mindenki megfogja említeni a farmot/visiont/halálok számát és ilyesmit, szóval azt így külön nem írom le.","replies":[]},{"poster":"TechNoob","date":"2017-07-06T14:26:09.710+0000","title":null,"up_votes":1,"down_votes":3,"body":"Ez van! Ne rankedez, amúgy sincs semmi értelme csak arra jó hogy felidegesítsen. Én Szigorúan csak normalozok!","replies":[]}]}