{"poster":"marting141","date":"2015-05-31T23:54:27.538+0000","title":"Porque hexakill?","subforum":"Charlas Generales","up_votes":2,"down_votes":18,"body":"Sin dudas que hexakill es peor por lejos que urf, en mi caso empece a jugar en el mes que salio urf, y no lo pude disfutar al maximo, vuelve alguna vez?? porque no dejarlo en personalizadas y que no se ganen pi?  hay necesidad de poner hexakill y no urf? porque no se  habilita urf un finde por mes? simples sugerencias  y espero respuestas jaja","replies":[{"poster":"ALEXKOND","date":"2015-06-01T07:10:58.232+0000","up_votes":2,"down_votes":0,"body":">Sin dudas que hexakill es peor por lejos que urf\n\nHonestamente, me divierte mucho más jugar Hexa en TT que URF. \n\n>porque no dejarlo en personalizadas y que no se ganen pi?\n\nPorque al igual que Hexa, es un modo de juego TEMPORAL. Luego de un tiempo se saca, te guste o no.\n\n>hay necesidad de poner hexakill y no urf?\n\nSi no hubiese necesidad no lo pondrían ¿No te parece?\n\n>porque no se habilita urf un finde por mes?\n\nPorque ya se habilitó el tiempo suficiente y necesario. Si llegaste tarde y el tren ya partió ¿De quien es la culpa?","replies":[]},{"poster":"LuciusMagnum","date":"2015-06-01T01:28:54.177+0000","up_votes":2,"down_votes":0,"body":"esa es tu opinión. Yo personalmente prefiero el hexakill","replies":[]},{"poster":"marting141","date":"2015-06-02T02:52:51.635+0000","up_votes":1,"down_votes":0,"body":"yo se que es un temporal, pero ahi mi pregunta, porque es temporal? no debe ser porque si nomas","replies":[]},{"poster":"Runth","date":"2015-06-01T07:22:51.596+0000","up_votes":1,"down_votes":0,"body":"Hexakill aqui... mejor pensar que ese modo no existe, porque aburre","replies":[]},{"poster":"Cpt Miau","date":"2015-06-01T01:32:52.325+0000","up_votes":1,"down_votes":0,"body":"No todos quieren urf, en mi opinion, ese modo de juego no es divertido, no le encuentro la gracia a cabecear el teclado como retrasado viendo como muere gente, prefiero 100 veces mas jugar normales que urf.","replies":[]},{"poster":"Pascut","date":"2015-06-01T00:49:44.710+0000","up_votes":1,"down_votes":0,"body":"Yo quiero mi Ascensión T_T","replies":[]},{"poster":"F0RZAKEN","date":"2015-06-01T00:11:19.418+0000","up_votes":1,"down_votes":0,"body":"http://las.leagueoflegends.com/es/news/community/q/respuestas-preguntas-sobre-urf","replies":[]}]}