{"poster":"Snop Dooge","date":"2016-08-16T23:43:10.885+0000","title":"Is low jungle cs ok in certain circumstances?","subforum":"Gameplay","up_votes":3,"down_votes":0,"body":"For example, I had a Zac game in which i focused ganking which heavily snowballed my LB into a carry win, had 12 assists, but only had 64~ CS.** Is having this low an amount ok** as long as i make up for it with **lane pressure/counter-ganks** etc? Or should I aim to improve my jungle farming?   {{champion:154}} {{champion:11}}  &lt; my jgl mains","replies":[{"poster":"Shadòw","date":"2016-08-16T23:46:36.423+0000","up_votes":3,"down_votes":1,"body":"who cares as long as you win","replies":[{"poster":"Riot Sotere","date":"2016-08-16T23:58:17.740+0000","up_votes":6,"down_votes":0,"body":"This for sure. There're a lot of low economy jungle strategies that aren't super meta right now, but still can be effective.  Rammus goes through stages of this, and Nunu in my opinion always functions best this way.  There is definitely an amount of pressure you can create on the map that makes up for missing out on some of that income.  Most of that time, the pressure costs the enemy team an equal or greater amount of income (or at least a more valuable amount).  \n\nKeep doing what works for you. :)","replies":[{"poster":"HexaDecimel","date":"2016-08-17T00:53:13.703+0000","up_votes":2,"down_votes":1,"body":"Hey Sotere,\n\nI don't know if this would be your area, but I just played a warm up match in player vs AI. It honestly felt like the bots were broken. Their AI was way worse then usual and I have never seen them perform this badly. It seems like the AI for bot matches is seriously broken.\n\nI have played a lot of bot matches and never seen it this bad.\n\nWas something changed with the update today?","replies":[{"poster":"Riot Sotere","date":"2016-08-17T01:24:49.077+0000","up_votes":2,"down_votes":0,"body":"Not intentionally. Was there a specific instance that stood out to you or a champion (bot) that was really weird? Can look into it, though my expectation is nothing should have been changed. Not in the update today or the last patch, so far as I'm aware.","replies":[{"poster":"HexaDecimel","date":"2016-08-17T01:40:28.978+0000","up_votes":1,"down_votes":0,"body":"All of the bots were missing every skill shot and running under turrets. Normally they are actually pretty good at landing abilities or running away when taking damage. One Ryze bot kept running into a group of enemy minions and dying. Several other players commented that they were acting really weird. Tristana kept using her rocket jump but wouldn't go anywhere. Just stuff like that. I am use to bad bots, but these were worse lol.","replies":[]}]}]},{"poster":"Angry Monster","date":"2016-08-17T01:42:57.392+0000","up_votes":1,"down_votes":0,"body":"I am going to say that while you are right, the grading system seems to teach the opposite and punishes for doing so.\n\nThe grading system encourages grind behavior (kills, assists, and creep farming) instead of clean winning.\n\nCausing high feels bad moments for winning.","replies":[]}]},{"poster":"Snop Dooge","date":"2016-08-16T23:52:33.529+0000","up_votes":1,"down_votes":0,"body":"gg","replies":[]}]},{"poster":"TheSingularity","date":"2016-08-17T02:15:37.512+0000","up_votes":2,"down_votes":0,"body":"For sure it's okay. As long as you're being proactive. Which you most certainly werein that zac game.\n\nMy cs as naut jg is cringe worthy 99% of the time. However an average score would be 1/2/8 with eh cs.\nIt's not about how often you cs, but how you utilize your time when you aren't.\n\nIf you have eh cs and score average of 0/2/1 then perhaps your decision making and time management need some work. \n\nCan give some insight for zac as he's one of mah baes. (Might improve ur cs while maintaining ur pressure)\nDo ur 3 camps blue buff side and look to gank. \nIf it fails/you don't gank get scuttle crab and check again for gank opportunities. Generally the 2 closest lanes (if one doesn't work, try the other)\nAfter gank/scuttle do ur red side (only do krugs if ur already heading top/bot respectively), get scuttle and check for more ganks.\nRinse and repeat dude\nAs long as you apply succcessful pressure  (you make em use summoners or kill em) you're doing great.","replies":[]},{"poster":"Toplane Fencer","date":"2016-08-17T07:01:54.795+0000","up_votes":1,"down_votes":0,"body":"With Zac it's probably fine but with Yi you need either farm or kills as he is very item dependant.","replies":[]},{"poster":"The Deckowner","date":"2016-08-17T03:53:30.520+0000","up_votes":1,"down_votes":0,"body":"When I play cheese junglers like Blitz naut thresh I dont give a fuck about csing, ganking is all I do.","replies":[]},{"poster":"Champion Skin","date":"2016-08-17T03:15:04.586+0000","up_votes":1,"down_votes":0,"body":"Well jungle CS is hard to say...\nlike 4 CS might be a raptor camp... or 4 gromps/scuttle crabs","replies":[]},{"poster":"BloodyTompon","date":"2016-08-17T02:35:18.781+0000","up_votes":1,"down_votes":0,"body":"Not if you're a Kantian.","replies":[]},{"poster":"Angry Monster","date":"2016-08-17T01:48:54.047+0000","up_votes":1,"down_votes":0,"body":"Several schools of thought here. Are you here for a letter grade or for a win. If win nothing maters but the win and get there any way possible.\n\nIf you are grade farming, low CS game play is punished big time. People that have been farming even when they should not be have been incentivized and rewarded by the system.\n\nAlso low CS numbers are low hanging fruit for people to being up in game to blame why they loss.","replies":[]},{"poster":"DunkinNoobs","date":"2016-08-17T01:30:35.270+0000","up_votes":1,"down_votes":0,"body":"With how long respawn timers are now, leaving camps up is usually a bad idea. Farm the camps and then gank while you wait for camps to respawn.","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-08-17T00:52:30.228+0000","up_votes":1,"down_votes":0,"body":"mainly if you play tank junglers after a while staying in lane and ganking is a lot more worthwhile than farming it up in the jungle. since the jungle creeps get tankier and u don't have any damage.","replies":[]},{"poster":"DeltaRaven","date":"2016-08-16T23:56:06.131+0000","up_votes":1,"down_votes":0,"body":"Jungling is all about rotations, just look to maximize your experience gain, a good jungler can be level 6 at between 6-7 minutes into the game. Just clear camps when you have the opportunity and if you get a lead, you don't have to do anything stupid, you can just farm and scale and look for the best opportunities to get objectives, that's my way of jungling.\n\nLow farm is ok, but farm is something you should look to keep up if possible","replies":[]}]}