{"poster":"JustusLA","date":"2016-11-09T17:25:53.312+0000","title":"Unübersichtlichkeit: Der Weg der Beschwörer","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe mich mal eben durch meine Einstellungen hindurch geklickt und mir ist mal so aufgefallen, dass es ja noch die Richtlinien von League of Legends gibt: Der Weg der Beschw&ouml;rer\r\n\r\nNun wollte ich ihn eigentlich lesen, jedoch hat mir der Aufbau, wie er in den Einstellungen aufgebaut ist, total die Motivation genommen.\r\nMan findet den &quot;Weg der Beschw&ouml;rer&quot; unter den Profil _&quot;Einstellungen&quot;_ und dann _&quot;Weg der Beschw&ouml;rer&quot;_ \r\n\r\nDort ist die Textgr&ouml;&szlig;e viel zu klein und die K&auml;stchen, wo der Text steht, auch sehr klein. An sich ist die Methode, dass die einzelenen Kapiteln aufklappen ganz &Uuml;bersichtlich und sch&ouml;n anzusehen, wenn dadurch halt nur kein Platz geklaut werden w&uuml;rde. So steht es sich selbst im Wege und, statt die &Uuml;bersichtlichkeit zu verbesseren, verschlimmert es nur.\r\n\r\nIch w&uuml;rde deswegen vorschlagen einfach das Feld in dem die Einstellungen sind insgesamt zu vergr&ouml;&szlig;ern, um so einfach mehr Platz zuschaffen. So liest das auch jemand mal durch wenn es ihn zuf&auml;llig dahin verschl&auml;gt. Eigentlich w&uuml;rde ich es mir auch w&uuml;nschen, wenn der Weg der Beschw&ouml;rer irgendwo besser hervorgehoben werden w&uuml;rden. Zumindestens habe ich das bisher nicht irgendwo anders gesehen.\r\n\r\n(Rechtschreibfehler k&ouml;nnten vorhanden sein, bei mir leuchtet jedes Wort rot)","replies":[{"poster":"legofreak1","date":"2016-11-09T17:27:36.350+0000","up_votes":1,"down_votes":0,"body":"Hier gibt es den auch nochmal in schön:\nhttp://gameinfo.euw.leagueoflegends.com/de/game-info/get-started/summoners-code/\nBesser wäre es natürlich, er ist dort verlinkt, anstatt in dieser Form der Anzeige, wie von dir beschrieben.","replies":[{"poster":"JustusLA","date":"2016-11-09T17:49:13.131+0000","up_votes":1,"down_votes":0,"body":"Das stimmt dort ist es wirklich gut gestaltet.\nDann wäre es auch einfach gut es aus den Einstellungen zu entfernen oder wie du schon meinst es zu verlinken","replies":[]}]}]}