{"poster":"22benger","date":"2015-05-03T14:02:33.910+0000","title":"Jinx és Vi","up_votes":1,"down_votes":0,"body":"Jinx &eacute;s Vi testv&eacute;rek? Mert valahol azt &iacute;rj&aacute;k igen valahol meg azt hogy nem! Most akkor hogy is van?","replies":[{"poster":"Razer1912","date":"2015-05-03T16:23:43.620+0000","title":null,"up_votes":1,"down_votes":0,"body":"Valakinek ismerős az a felvetés hogy Vi kisbaba korában ellet szakítva a családjától? Viszont Jinx akkora már 5-6 éves volt így ő emlékszik Vi re viszont Vi nem úgyanis kisbaba korára senki nem emlékszik + Jinxnek a játékban van egy kis mondata a játékban Vi hez ami arra utal hogy testvérek.\nSzóval Vi Jinx testvérek Vi kicsibaba korában elszakadt tölük ezért nem emlékszik a nagyobbik növérére jinx-re viszont jinx emlékszik Vi re\nLehet bonyolultnak hangzik.\nDe én így tudom :D","replies":[{"poster":"Shikaichi","date":"2015-05-03T16:43:55.594+0000","title":null,"up_votes":1,"down_votes":0,"body":"Akkor a magyar fordítás rossz, mert ott azt mondja Jinx, hogy nővére van. \n\"Azt mondod én vagyok a bolond? Látnod kéne a nővéremet.\"","replies":[{"poster":"M4dr4c","date":"2015-05-03T16:55:39.948+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az eredetiben sister van, ami csak lánytestvér korkülönbség meghatározása nélkül.","replies":[{"poster":"Shikaichi","date":"2015-05-03T17:11:56.384+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen tudom.\nDe ha a fentebb írtak igazak, akkor a magyar fordítás nem helyes. Persze nem tudni, hogy valóban igaz e, mert én is most hallom először. Valaki azt mondja, hogy a Riot megerősítette, hogy testvérek, van, aki azt, hogy erről szó sincs. Szerintem ez örök titok marad, hacsak nem linkel ide valaki valami fórumot, ahol a Riot leírta az igazságot.","replies":[{"poster":"Sadraal","date":"2015-05-03T18:57:23.696+0000","title":null,"up_votes":1,"down_votes":0,"body":"[Jinx](http://leagueoflegends.wikia.com/wiki/Jinx/SkinsTrivia) és [Vi ](http://leagueoflegends.wikia.com/wiki/Vi/SkinsTrivia) részletei között sincs egyértelmű utalás a kapcsolatukra.\n\nSzerény véleményem szerint nem testvérek, az oka pedig baromi egyszerű! Vegyünk alapul néhányat a játék testvérpárjai közül:\n{{champion:122}} & {{champion:119}} - Hasonlítanak kinézetre és valahol legbelül is.\n{{champion:86}}  & {{champion:99}} - Annak ellenére, hogy fiú-lány párosítás, szerintem hasonlítanak egymásra, ez főleg a régi splash artokon látszik.\n{{champion:55}} & {{champion:69}} - Ugyan a szerencsétlen nővérke veszített emberi mivoltából, de ettől függetlenül közöttük is nagy a hasonlóság.\n\nRajtuk kívül persze vannak még tesók a játékban, de mindegyiknél odafigyelnek a tervezők, hogy érzékelhető legyen a kapcsolat a karakterek között. Vi és Jinx között ez a kapcsolat egyáltalán nem érzékelhető, ezt pedig az elejtett kis megjegyzések is alátámasztják, amiket Jinx leírásánál is feltüntetnek.","replies":[{"poster":"ßΞNGΛR","date":"2015-12-08T14:06:57.242+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ezt a teóriád megcáfolnám. Dariussal és Dravennel kapcsolatban igazad van, de nékik a Lore-jukban le is van írva, hogy testvérek.\nGaren és Lux nem testvérek. Mindketten Demaciai hősök így ugyanazért harcolnak de nem testvérek.\nKatarina és Cassiopeia se testvérek. Katarinának egy \"testvére\" van (nem vérszerinti, hanem amolyan befogadott) és ez Talon. Ez szerepel Talon Lore-jában és ott van a végén egy idézet Katarinatól.","replies":[{"poster":"Sadraal","date":"2015-12-08T22:14:01.446+0000","title":null,"up_votes":3,"down_votes":0,"body":"Akkor most nyisd meg ezt a linket:\nhttp://i.imgur.com/XIkOC1c.png\n\n* Garen és Lux Crownguard, a Crownguard-ház tagjai, hivatalosan is testvérek - mivel több forrásban is feltüntetik. \n* Katarina és Cassiopeia Du Couteau, a noxusi Du Couteau család tagjai, szintén testvérek. Talon csak nagy vonalakban nevezhető testvérnek, egy elég kellemetlen választás elé állították, így került a család szolgálatába.\n\nMinden elismerésem, amiért ilyen lelkesen olvasgatod a kliensben elérhető előtörténeteket, de nekem elhiheted, rengeteg információ nem szerepel ott ;)","replies":[]}]},{"poster":"Shikaichi","date":"2015-05-03T19:20:25.021+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ha testvérek lennének, akkor nagyon ég és föld lennének, mind külsőre, mind belsőre. Külsőre is, Jinx kék hajú, pink szemű, alacsony, vékony, kevés ruha van rajta, távolsági harcos. Míg Vi pont a szöges ellentéte, mert pink hajú, kék szemű, magas, izmos, páncélos, közelharcos. Aki ARAM-ozott már Vi-vel, és lila oldalra került, az már lehet találkozott a boltos, Lyte megjegyzésével: Úgy nézel ki, mint a nővéred! Jinx viszont egyáltalán nem néz ki úgy, mint Vi. Úgyhogy lehet mindkettőjüknek van testvére, csak nem ismerjük őket. \nNah, ennyit szedtem most össze az internetről. :)","replies":[{"poster":"Razer1912","date":"2015-05-03T20:17:26.447+0000","title":null,"up_votes":1,"down_votes":0,"body":"Viszont akkor ha már keressük az összefüggéseket a múltjuk közel áll egymáshoz a jelenjük eltávolodott viszont. Vi és Jinx is bünőző (volt). Csak Vi  Caitlyn miatt rendőr lett piltoverben :D","replies":[{"poster":"M4dr4c","date":"2015-05-03T20:25:12.225+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez azért kicsit erőltetett kapcsolat, valahogy nem érzem, hogy minden bűnöző kapcsolatban állna egymással. ;)","replies":[{"poster":"Razer1912","date":"2015-05-03T22:12:37.835+0000","title":null,"up_votes":1,"down_votes":0,"body":"Twitchről és evelynről is készült egy kép együtt + még skin is.\nMeg se kérdezd hogy jön ez ide 0:12 van szal csak írtam :D","replies":[{"poster":"M4dr4c","date":"2015-05-03T23:13:04.464+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha nagyon troll akarnék lenni, akkor most felvetném, hogy ők is bűnözők azon a splashen, szóval ők is Vi testvérei. :D","replies":[{"poster":"Sadraal","date":"2015-05-05T16:57:56.271+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez nyilvánvaló :D","replies":[]}]}]}]}]}]}]},{"poster":"Rindell","date":"2018-01-02T17:14:50.069+0000","title":null,"up_votes":1,"down_votes":0,"body":"De helyes. A nővér amúgy nem feltétlenül jelent idősebb lánytestvért, hanem simán lánytestvért is. Ugyanúgy, ahogy a fivér fiútestvért. Ezért hivják az apácákat nővéreknek.","replies":[]},{"poster":"M4dr4c","date":"2015-05-03T18:16:25.924+0000","title":null,"up_votes":1,"down_votes":0,"body":"Gyors keresés után nem találtam se megerősítést se cáfolatot Redtől.","replies":[]}]}]}]},{"poster":"M4dr4c","date":"2015-05-03T16:40:15.949+0000","title":null,"up_votes":2,"down_votes":0,"body":"Valahogy nem tudom elhinni, hogy Jinx 5-6 évvel idősebb lenne Vinál. Inkább tűnik fiatalabbnak pár évvel. Ettől még lehet igazad persze.","replies":[{"poster":"New Dawn","date":"2015-05-03T18:43:01.978+0000","title":null,"up_votes":1,"down_votes":0,"body":"ja.. szerintem is jinx a fiatalabb :D","replies":[]}]}]},{"poster":"M4dr4c","date":"2015-05-03T14:12:26.048+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem testvérek szerintem. Különben az a rész, ahol Vi már a rend oldalán kergeti Jinxet teljesen értelmetlen lenne, hisz pontosan tudná ki van ellene.","replies":[]}]}