{"poster":"Good Bye 13900ip","date":"2016-11-29T13:15:39.040+0000","title":"El blind pick y los viejos problemas de siempre: El retroceso en la evolución del LoL","subforum":"Charlas Generales","up_votes":86,"down_votes":3,"body":"Bah.. que mas que decir que no haya mencionado antes alguien, verdad?\r\n\r\nEsta temporada me siento excesivamente carente de emocion para jugar. Quizas a nivel personal de que ninguno de mis personajes que usaba se sienta igual; por encima de los cambios que hayan hecho que tampoco fueron tantos, entras a la partida y league of legends sigue siendo el mismo league of legends de la temporada pasada (quitando esos jayce asesinos que no tenian sentido).\r\n\r\nPero bueno... entre los cambios de pretemporada, el unico que recrimito, y una de las desiciones mas ESTUPIDAS que hizo riot en a&ntilde;os que vengo jugando, es retirar la cola dinamica de las partidas normales.\r\n\r\n&quot;Eliminamos la cola de reclutamiento en Normales, ya que la otra es mas popular&quot;\r\n\r\nCorrecto, dame otro punto a favor del Blink pick para que eliminar el reclutamiento normal sera una opcion aceptable? Ah, que es mas popular nomas? no ofrece nada mas o soluciona problemas? que es menos deportivo? Debe ser una broma...\r\n\r\nCrei que podria ser aceptable jugar las blink pick de siempre, pero es un aborto en vida entrar y tratar de jugar esta cola tan estupida.\r\n\r\nDepender de que tu PC e internet sean suficientemente buenos para no entrar ultimo y te toque el 90% de las veces soporte\r\nDepender de que LOS ALIADOS tengan un internet y pc suficientemente decentes como para que vean tu mensaje o no lo vean despues de el de ellos.\r\nDEPENDER DE QUE TUS ALIADOS NO SEAN UNA PREMADE DE TROLLS QUE ENTRAN A LA PARTIDA Y DICEN &quot;Mira, vas a ir la linea que te digamos nosotros porque se nos canta el forro del ort* y vamos a decir que vimos a nuestro compa&ntilde;ero, que siquiera se conecto aun, que el canto ADC primero&quot;\r\nDepender de que, ademas de todo lo anterior dicho, TUS ALIADOS RESPETEN LA LINEA QUE PEDISTE.\r\nNi voy a detallar todo el retroceso que conlleva ELIMINAR EL MODO RECLUTAMIENTO de las colas normales, porque es decir algo que muchos dijeron y que Riot LATAM hizo ojitos a otro lado.\r\n\r\nNo hay un pingo de excusa de haber hecho eso. &quot;Personajes estaban permanentemente baneados&quot; SACA EL BAN DE LAS NORMALES ENTONCES, EL DRAF PICK NO ESTA POR LOS BANEOS, ESTA POR LA SELECCION DE ROLL. Como vas a eliminar el unico y apestoso avance que hicieron bien en 7 a&ntilde;os, que es poder seleccionar fluidamente tu roll antes de la partida.\r\nVuelven a una cola primitiva, que gana el que tenga los dedos mas rapido del oeste, y mismo asi 2/3 de la partidas que veo, ya sea aliado o enemigo, tenes a un amargado o troll que no le gusto lo que le toco. Vuelven a un sistema mediocre y disfuncional que esta desde antes del 2010. Es una verg&uuml;enza.\r\n\r\nLe estoy dando una minima oportunidad a League of Legends para no dejar esta temporada, y riot tona una decisi&oacute;n tan estupida como esta.\r\n\r\nPara colmo, siquiera vale la pena &quot;salirse de la seleccion de capeon&quot; porque otro esta llorando que dice que vio que el gano. Porque SALIRSE DE LA SELEC CHAMP TIENE MAS SANCI&Oacute;N QUE QUEDARSE AFK DURANTE 20 PARTIDAS.\r\n\r\nEste es el tipo de gente que te terminas encontrando en las Blink Pick.\r\nEsta antideportividad, y enfoque a los casuales y gente que no le importa un carajo el juego es a lo que apunta riot esta temporada?\r\n\r\nhttp://oi67.tinypic.com/2118fva.jpg\r\n\r\n\r\nHablan de el fracaso del proyecto de hacer que las rankeds sean de equipos preorganizados siempre, de que intentaran hacerlo mas transitorio. Y despues te sacan el unico rasgo de formalidad en las normales para que los casuales y esa misma gente que da problemas en las rankeds siga siendo un problema en todos los hambitos del lol. No se si pensar que rodaron cabezas de los que propusieron el primer proyecto y contrataron unos pasantes para la desicion de eliminar el Draf Pick.\r\n\r\n\r\n\r\nPD: Rioters: Antes de reclamar que &quot;aparecen nombres de otros jugadores&quot; en la imagen, podrian bien usarla para aplicar la sancion correspondiente. Porque ese botonsito mediocre de final de partida, el 99.7% de las veces queda en nada, y casi todo el resto, en palmaditas en la espalda","replies":[{"poster":"Sirek","date":"2016-11-29T13:47:20.814+0000","up_votes":17,"down_votes":0,"body":"Es una lata, yo jugaba bastante con las Normal con Reclutamiento, ahora ya no me motiva jugar LOL por esta razón. Es esa como que quieres llegar a la casa a jugar pero te acuerdas de lo que es la Blind Pick y me pongo a jugar Project Cars.","replies":[]},{"poster":"100demondiola","date":"2016-11-29T13:52:51.542+0000","up_votes":15,"down_votes":0,"body":"Hace un ratito jugué la primera normal y en el equipo enemigo había dos junglas (uno con la maestría de buffar escudos y curaciones de los supp, siendo skarner), y una poppy quejándose en el /all, diciendo que supuestamente había ganado jg y había tenido que ir supp. Fueron sin adc, y seguramente no lo hayan pasado bien, estuvieron todo el early discutiendo por el /all, unos pidiendo report para unos, los otros pidiendo para los demás... y esto está pasando en la mayoría de las partidas normales que he jugado. Si tenés suerte te toca gente que va cualquier otro rol y no tiene problema, pero todos sabemos que esos son los casos menos probables.\n\nCoincido totalmente en que para una vez que había algo bueno en las normales, lo quitaron sin sentido. Y encima tuvieron la cara de decir que para banear y usar el modo reclutamiento de preselección del rol estaban las Flex... o sea, ni siquiera los rioters le dan importancia a las flex? xD Y más allá de eso, los que no tenemos ganas de rankear o de jugar por jugar, nos tenemos que bancar los flammeos y trolleos de selección de campeón?\n\nRito pls.","replies":[{"poster":"wintermoon","date":"2016-11-30T15:01:05.006+0000","up_votes":1,"down_votes":0,"body":"te cuento:Soy bronce 4 y este tipo de gente me suelte tocar,yo cuando entro digo lo que quede entonces un tipo con una tostadora como pc entra tardisimo autolockea illaoi y pide adc.Recien ayer fue la primera y ultima vez que no se pelearon las lineas,como siempre fui lo que quedaba y ganamos,tuvimos todos una muy buena partida","replies":[]},{"poster":"Runth","date":"2016-11-29T19:22:12.755+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bolger,realm=LAS,application-id=v7qsfXsE,discussion-id=VKiywiej,comment-id=0001,timestamp=2016-11-29T13:52:51.542+0000)\n>\n> Hace un ratito jugué la primera normal y en el equipo enemigo había dos junglas (uno con la maestría de buffar escudos y curaciones de los supp, siendo skarner), y una poppy quejándose en el /all, diciendo que supuestamente había ganado jg y había tenido que ir supp. Fueron sin adc, y seguramente no lo hayan pasado bien, estuvieron todo el early discutiendo por el /all, unos pidiendo report para unos, los otros pidiendo para los demás... y esto está pasando en la mayoría de las partidas normales que he jugado. Si tenés suerte te toca gente que va cualquier otro rol y no tiene problema, pero todos sabemos que esos son los casos menos probables.\n> \n> Coincido totalmente en que para una vez que había algo bueno en las normales, lo quitaron sin sentido. Y encima tuvieron la cara de decir que para banear y usar el modo reclutamiento de preselección del rol estaban las Flex... o sea, ni siquiera los rioters le dan importancia a las flex? xD Y más allá de eso, los que no tenemos ganas de rankear o de jugar por jugar, nos tenemos que bancar los flammeos y trolleos de selección de campeón?\n> \n> Rito pls.\n\neres el ziggs verdad?, te contare mientras estaba en seleccion de campeon, la poppy queria ir jg y lo canto primero, pero k6 con mucho ego , pick el champ y ahi empezo el desorden de la composicion, asi q tenia 2 opciones, dodgearme o hacer la misma jugada q hizo el, pero averiguar si es bueno su rol o no, pickie skarner con una maestria mala sin importar lo q va a pasar y al ver jugar el k6 ahi cayo la boca del lobo, fue a trollear y no coopero su juego.\n\nla partida duro mucho y la verdad deseo olvidarlo, este modo old school mas desbalanceado esta metagame q antes no era lo q es antes del año 2012","replies":[{"poster":"Taxonometrist","date":"2016-11-30T08:32:20.451+0000","up_votes":1,"down_votes":0,"body":"¿Vos estas diciendo que como el otro lockeo vos deciste lockear el mismo rol y ademas llevar una maestria que sabias que estaba mal? Loco..  yo ya no entiendo en que piensa la gente la verdad. No tiene el minimo sentido lo que decis, sos tan troll como el K6. Si alguien pickea lo que cantaste tenes dos opciones: quiteas o pickeas lo que falta. En ese modo de juego es asi de duro.","replies":[]}]}]},{"poster":"LoLGas5","date":"2016-11-29T18:11:57.438+0000","up_votes":8,"down_votes":0,"body":"Sigo pensando que blind pick ya no debería existir más, solo trae problemas y toxicidad.\n¿que es más rápido para encontrar partida? No me importa esperar 15 min por una partida decente.\n¿es la más popular? ¿Solo porque sea popular les da el derecho de dejar solo este modo tan anticuado? Nunca voy a entender su \"buena\" decisión.\n¿ganar tu rol por mejor PC o internet? patético.\n\nen la semana juego solo 3 o 4 partidas normales en este modo y me canso, me quita TODAS LAS GANAS  de jugar al lol.","replies":[{"poster":"Benja God","date":"2016-11-29T20:43:35.416+0000","up_votes":3,"down_votes":1,"body":"Pero si la quitan no va a desaparecer la toxicidad ni los problemas \n\nSiempre va a existir alguien que no este conforme con su linea y va a lo típico \"(inserte linea que todos quieren, menos supp) o troleo\" :/","replies":[{"poster":"LoLGas5","date":"2016-11-30T14:09:59.870+0000","up_votes":2,"down_votes":0,"body":"Va a ver gente disconforme pero la toxicidad se redujo mucho con la cola de reclutamiento normal. Era muy raro ver peleas o trolls.","replies":[]}]},{"poster":"StephenLegends","date":"2016-11-30T03:12:43.533+0000","up_votes":1,"down_votes":0,"body":"No puedes imponer esperar 15 minutos mientras que más de la mitad del server prefiere jugar una partida rápida mientras que otra gente quiere una buena(tu caso). En mi opinión prefiero que pongan las dos colas tal y como estaba, era mucho mejor así.","replies":[]}]},{"poster":"Silent Bob","date":"2016-11-29T22:34:44.491+0000","up_votes":4,"down_votes":0,"body":"Yo era un jugador de aram por que no tenia ganas de pelearme con inadaptados para jugar una normal, hasta que sacaron el draf pick, la verdad que hacia la selección mas fácil.\n\nNo te peleabas con nadie, yo por lo menos si me tocaba supp, no tenia problema. Sacaba jg por que soy malisimo. Y listo, era menos estresante todo.\n\nAhora cada vez que quiero jugar una normal tengo que andar discutiendo o si no tenes ganas de pelear esperar al final y jugar la mayoria de las veces supp. O lo que quede. \n\nY no es venir al foro a desquitarse, es dar la opinión de algo que esta bueno y que tendrían que volver a incluir en el juego.","replies":[]},{"poster":"Runth","date":"2016-11-29T19:25:25.642+0000","up_votes":4,"down_votes":0,"body":"y no jugare soporte ese modo, por huelga hasta q termine las rotacion de los soportes\n\nporque llevo años ese rol frustante","replies":[]},{"poster":"Icesoul","date":"2016-11-29T19:23:44.999+0000","up_votes":3,"down_votes":0,"body":"Ni hablar de las composiciones basuras que hacen, todo suma, es que no tiene nada bueno, será mas popular pero el tiempo que no esperas se compensa en la partida, porque terminas jugando minimamente una partida de 20 min que no valio la pena jugar.","replies":[]},{"poster":"Satan is kawaii","date":"2016-11-29T19:06:50.141+0000","up_votes":3,"down_votes":0,"body":"Por desgracia parece que no van a arreglar, hace rato que no toco el lol para jugar una normal tranqui. Lo abro para actualizarlo y lo uso de messenger porque muchos amigos siguen ahí pero perdi el interés en jugar :s","replies":[]},{"poster":"Nisman on bush","date":"2016-11-29T16:38:15.357+0000","up_votes":3,"down_votes":0,"body":"yo no jugaba normals blind pick desde que pusieron las flex y sacaron reclutamientos me metia a jugar cn bots para la primer victoria y fue ayer y antes de ayer me meti a jugar y aunque estaba medio manco por no jugar banda de tiempo normales me encontre con lo peor de lo peor, doble jg doble miid puteadas x todos lados trolls afk a dos manos, sinceramente ya ni ganas de jugar tengo es asqueroso como esta ahora, gracias riot (pd no me gusta jugar rankeds y no tengo porque jugarlas obligadamente para no fumarme la cola toxica normal)","replies":[]},{"poster":"Sthask Vermillio","date":"2016-11-30T16:16:56.833+0000","up_votes":1,"down_votes":0,"body":"Para jugar el blind hay que tener 5 buenos amigos, pero quien los tiene? :'v","replies":[{"poster":"FedeFefa","date":"2016-11-30T20:49:54.485+0000","up_votes":2,"down_votes":0,"body":"4 :v","replies":[{"poster":"Sthask Vermillio","date":"2016-11-30T20:59:57.353+0000","up_votes":1,"down_votes":0,"body":"Verdad 4 :v","replies":[]}]}]},{"poster":"Master Revan","date":"2016-11-30T01:28:12.512+0000","up_votes":2,"down_votes":0,"body":"\"Pero es que es más popular....\"\n\nSí, así también un profesor que no exija nada a sus estudiantes es más popular que uno que enseñe y que pretenda que haya ciertos resultados\n\nLo popular no siempre es lo mejor, para buscar ejemplos, en política hay muchos XD\n\nPienso que lamentablemente Riot central determina estas cosas, y los Rioters de Las siguen sus directivas\n\nY decimos... no tienen la culpa... claro, pero tampoco han ganado nunca nada para nuestra región.","replies":[]},{"poster":"Ken Bread","date":"2016-11-29T15:09:49.251+0000","up_votes":2,"down_votes":0,"body":"Hace un ratito jugue una partida con {{champion:64}} Jungla y tube doble mid un Yasuo y una Syndra...Lo gracioso esque ganamos igual :P","replies":[{"poster":"spitfire1945","date":"2016-11-29T19:17:19.884+0000","up_votes":2,"down_votes":0,"body":"Se, eso se ve a cada rato, ayer jugue una en top y me toco un doble top, una Riven y  Trundle, jugue pasivo los primeros niveles y después los reventé, muchos no saben lo importante que es el farm y jugar doble les quito experiencia + el plus de toda la jungla free. Les pasamos el trapo pobres. Cuando se acordaron de junglear era tarde.\n Pero ahora es moneda común estos casos. también me toco un equipo que había quedado libre el puesto de adc (¡si! ¡ Teníamos un soporte!) pero como al flaco no le iba ir adc fue con jax a bot -troll.  Es una kgada todo, queres invertir un tiempo para jugar y está lleno llenito de troll picks o gente que le toco un puesto que no maneja y chau, se pierde tu buena experiencia de juego.","replies":[{"poster":"Ken Bread","date":"2016-11-30T00:13:38.821+0000","up_votes":2,"down_votes":0,"body":"El doble mid estubo en mi equipo xd no en el contrario nuestro adc estaba solo en bot y aun asi ganamos","replies":[]}]}]},{"poster":"ichigo rin","date":"2016-11-29T22:45:45.387+0000","up_votes":2,"down_votes":0,"body":"rito escuchanos por la cresta {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Hera93","date":"2016-11-29T22:26:15.422+0000","up_votes":2,"down_votes":0,"body":"A mi particularmente el cliente nuevo me anda SUPER lento en mi máquina y al no tener el reclutamiento termino jugando supp el 99% de las veces y si bien es un rol que me gusta, jugarlo en absolutamente todas las partidas ya me resulta aburrido.\nOjala algún rioter lea el post y se replanteen volver a poner el modo reclutamiento","replies":[]},{"poster":"Lysaru","date":"2016-11-29T20:55:00.119+0000","up_votes":1,"down_votes":2,"body":"> unico y apestoso avance que hicieron bien en 7 años\n\nparen el mundo, aqui me bajo.","replies":[{"poster":"Good Bye 13900ip","date":"2016-11-30T09:27:29.591+0000","up_votes":2,"down_votes":0,"body":"Te subrayo que esta dentro del contexto de \"seleccion de campeones\" o te pago un curso online de comprensión lectora?","replies":[{"poster":"Lysaru","date":"2016-12-02T02:46:46.251+0000","up_votes":1,"down_votes":1,"body":"ah pero yo veo que el post trata de la eleccion de las lineas y no de la fase de PyB que seria la de \"seleccion de campeones\"\n\nsegui participando.","replies":[{"poster":"Good Bye 13900ip","date":"2016-12-03T10:25:06.410+0000","up_votes":1,"down_votes":0,"body":"\"veo que el post trata de la eleccion de las lineas XXXXXXXXX..... que seria la de seleccion de campeones\"...\n\nEmmm te pediria que dejes al faso a un lado, abras la ventan que salga el humo, comete algo por el bajo, espera un par de horas y despues veni a comentar, amigo. Que es lo minimo que puedo pensar que estas haciendo al leerte.\n\nCuando seleccionas la linea? despues de seleccionar el campeon y entrar a la partida como en el lol rojo? Animal.","replies":[]}]}]}]},{"poster":"BiXe","date":"2016-12-03T11:18:37.947+0000","up_votes":1,"down_votes":0,"body":"No es que siempre hay trolls en el blind pick, a veces hay afk pero solamente es 9 de cada 10 partidas. Pero Riot dice que es la mejor opción porque la otra cola no servía ... eso o el programador con medio brazo que tienen no sabe como hacer para dejar en el launcher la opción de blind pick normal / reclutamiento y ranked / flex y solo Q. \nTendrían que haber puesto simplemente categoria \"normal\" y las dos colas para elegir\n\"ranked\" y las dos colas para elegir\ny en el momento que hay \"poca gente\" (que desactivan las rankeds) sacar la cola \"normal - reclutamiento\" y dejar la \"normal - oculta\" \n\nPero parece que el analisis de software no viene muy bien en esa empresa ...","replies":[]},{"poster":"FurchiDC","date":"2016-11-30T03:58:39.157+0000","up_votes":1,"down_votes":8,"body":"Estoy de acuerdo con mucho de lo que planteas. Era un jugador que solo jugaba Draft, y antes de eso Team Builder, jamás usé Blind más que para jugar en premade de a 5. \n\nLo que más sufro ahora, y por lo que no juego Blind (salvo en premade) es no poder banear lo roto, ni poder pickear mi línea. Me la paso jugando ARAM o modos de Rotación hasta que una premade me invita. \n\nAhora ya dada mi opinión te vengo a explicar por qué la retiraron aunque no sea de nuestro agrado. En este post lo explico dentro de lo posible:  http://boards.las.leagueoflegends.com/es/c/charlas-generales/v77fkv9h-deberaua-volver-draft\n\nEspero que te haya ayudado y ánimo que nos van a mejorar Blind cuando termine la beta del cliente nuevo :D. O eso tengo entendido xD.\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Good Bye 13900ip","date":"2016-11-30T09:26:21.147+0000","up_votes":1,"down_votes":0,"body":"Te respondo por aqui los primeros 4 puntos que diste\n\n- Sobre los jugadores de nivel bajo con pocos campeones (tecnicamente, 16) es mas simple que hacer pan con manteca: De primeras, sigo sin entender porque los campeones bas (450 ip) no vienen incluidos con la cuenta, instantaneamente tenes un aprox de 10 campeons, muchos sumamente simples, ideal para personas que recien van aprendiendo a jugar. Siguiendo por los 10 de la rotacion semanal, ya tenemos unos 20 campeones. Y ademas, el hecho que se requiere mas de 2 millones de puntos de influencia para tener todos los campeones, runas y paginas... aunque riot este sacando 3 campeones por año, ya debe plantearse una solucion con el tema de los campeones. \nEste punto es arcaico, porque el problema de la falta de campeones para un draf pick, ya es porque el sistema ya esta obsoleto en lo que a cuentas nuevas se refiere.\n- Para las personas que no se toman el juego seriamente no es lo mismo que personas que no les improta que linea ir. Yo soy una persona que juega las 5 lineas indiferente de cual me toque, pero no soy quien no se toma enserio. Hay muchisimos only mid que jamas se lo toman medianamente enserio. Pero volviendo al punto, la seleccion de Roll tenia bien clarito y grandem ocupando casi el 50% de la interfase de seleccion, el boton \"Comodin\" o \"aleatoreo\". Que te toca soporte la mayoria de las veces? es lo mismo que no cantar linea en las blind picks. \nAdemas, una persona que no le improta que roll ir, tenga LA OPCION de elegir un roll, no es un problema. Que alguien que quiere ir X roll, tenga que ir otro completamente diferente, si lo es.\n- Los trolls y los que entran a molestar es un problema de todas las colas, pero esto aumenta exponencialmente por la tension y frustracion que genera la fase de seleccion de la Blind Pick. Desde actitudes mas discretas como terminar jugando \"de mala manera\" a algo mas activo como trollear sin medidas. Cuyo caso, si te refieres a \"los trolls en gral\" de league of legends. Ya es problema del ineficiente sistema de baneos de Riot\n- El problema de la demora de cola en las Daft era uno, solamente uno, ni pocos soportes ni nada: SEGUIAN EXISTIENDO LAS BLIND\n\n\nEl unico factor que NO deberia haber en las Draft normales, es el sistema de Baneos, porque si consideramos a las normales como COLA DE ENTRENAMIENTO Y CASUALES, el sistema de banear campeones no deberia tener lugar. Pero eso es tan simple como colocar un par de 0 en un archivo del cliente. Las draft no son superiores a las blinds por alguna razon divina, sino porque las blinds no solo no aportan nada que no pueda hacerlo las draft, sino que atrae problemas tecnicos y sicologicos que repercuten en la partida\n\nPor comodidad de la costumbre, por indiferencia. Esos son los motivos del uso de la BLIND PICKS. \nDe las personas que conozco que juegan league of legends, los unicos que me dijeron \"esta bien que solo haya normales\" son los que complementaron su opinion con: \"sino no podes trollear, porque se salen cuando ven tu pick\" o similares","replies":[{"poster":"FurchiDC","date":"2016-12-01T03:05:23.667+0000","up_votes":1,"down_votes":0,"body":">_...sigo sin entender porque los campeones bas (450 ip) no vienen incluidos con la cuenta... ...el problema de la falta de campeones para un draf pick, ya es porque el sistema ya esta obsoleto en lo que a cuentas nuevas se refiere._\n\nSí estoy de acuerdo, los campeones base deberían venir con la cuenta. Ya se dieron cuenta que las Runas tier 2 debian ser gratis (o 1 PI como ahroa) quién sabe, tal vez pronto pongan los campeones de 450 PI en 1 PI. \n\n>_una persona que no le improta que roll ir, tenga LA OPCION de elegir un roll, no es un problema. Que alguien que quiere ir X roll, tenga que ir otro completamente diferente, si lo es. _\n\nDe acuerdo 100%.\n\n>_ esto aumenta exponencialmente por la tension y frustracion que genera la fase de seleccion de la Blind Pick._\n\nTambién de acuerdo 100%.\n\n>_es problema del ineficiente sistema de baneos de Riot_\n\nEl problema no es que el sistema de baneos sea ineficiente, sino que la gente no reporta. Casi siempre salen de la pantalla final enojados y no hacen los reportes correspondientes. O si tocó el troll en el enemigo le dan honores en vez de reportarlo, sin darse cuenta que en la próxima partida les puede tocar con ellos.\n\nSi una persona trollea seguido, y en todas esas partidas lo reportan, se va con un ban 100% asegurado. Hay que reportar para que el sistema lo detecte. \n\nA diario aparecen cryposts de baneados por flamer, troll o eloboost. Y tené en cuenta que solo un pequeño porcentaje de la comunidad de LoL utiliza el foro.\n\n>_El problema de la demora de cola en las Daft era uno, solamente uno, ni pocos soportes ni nada: SEGUIAN EXISTIENDO LAS BLIND_\n\nEstoy de acuerdo, sin embargo hay que buscar una solución para las cuentas de lvl bajo y con menos de 16 campeones antes de sacar esa cola. \nEn lo personal jamás tuve colas largas en normal Draft, máximo 2 min - 2 min y medio.\n\n\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]}]},{"poster":"Poison Noob","date":"2016-11-30T23:37:45.073+0000","up_votes":1,"down_votes":0,"body":"Estaria bueno q los rioters dejen de hacerse los boludos y contesten, no se cuanto les cuesta volver a ponerla, preferible esperar 5 min de cola q 5 minutos de ban por salirte","replies":[]},{"poster":"SKT T1 MUNDO","date":"2016-11-30T14:23:26.528+0000","up_votes":1,"down_votes":0,"body":"Solo les diré esto independiente si riot hace algo al respecto: SON NORMALS, comprendan eso, si quieren \"seriedad\" jueguen rankeds, las normals son solo para mejorar, si les importa ganar en ese modo estan mal...","replies":[{"poster":"Good Bye 13900ip","date":"2016-11-30T18:00:51.919+0000","up_votes":1,"down_votes":0,"body":"Que te importe ganar es indiferente a querer mejorar. \nNo se entra a rankeds para entrenar o practicar cosas nuevas. Para ello es las normales.\nPara jugar a lo casual y trolleando, esta formar un equipo de amigos. Que por nada se hace incapie en la socializacion\n\nAD: ademas, se trata de crear un ambiente placentero en la partida. Evitar factores que creen tension o generen probelmas. El hecho que haya gente un poco bastante jodida de la cabeza que entra a partidas a trollear, y que haya gente aun mas jodida que disfrute verlos, no significa que sea una actitud aceptable, incluso en normales.","replies":[]}]},{"poster":"Zesc","date":"2016-11-30T16:20:20.182+0000","up_votes":1,"down_votes":0,"body":"Estaría bueno ver si los Rioters cambiaron de opinion o si planean algo...","replies":[]},{"poster":"Nísta","date":"2016-11-30T15:00:57.596+0000","up_votes":1,"down_votes":0,"body":"y qué importa si fuma faso esta todo bien diria yogurisimo","replies":[]},{"poster":"Eicci ","date":"2016-11-30T12:32:09.977+0000","up_votes":1,"down_votes":0,"body":"+1 y te aplaudo de pie capo toda la razon","replies":[]},{"poster":"Una Nutrinha","date":"2016-11-30T12:30:38.662+0000","up_votes":1,"down_votes":0,"body":"Yo no entiendo porque la sacaron...\nSi queres jugar rapido pero cualquier cosa tenes Blind Pick\nSi queres jugar bien, sin toxicidas, tenes reclutamiento\nSi queres jugar ranked en equipo tenes la flex\ny si queres jugar solo/duo q tenes la ranked normal...","replies":[]},{"poster":"Sephyyr","date":"2016-11-30T11:49:29.345+0000","up_votes":1,"down_votes":0,"body":"me parece una correcta forma de jugar al league of legends jeje","replies":[]},{"poster":"elcubitop","date":"2016-11-30T05:40:14.133+0000","up_votes":1,"down_votes":0,"body":"si ahora no me motiva jugar mucho al lol hace poco descubri por que siempre que insultal a alguien lo llaman chleno de mierda y es por que desde la nueva actualisacion me encuentro en todas y si dije en todas las partidas chilenos que eh no tengo nada contra ellos pero siempre dicen manco ql de mierda wea ogala teh pudra en el infierno negro bolita :V wtf antes solo me encontraba a esa gente una de cada 8 partidas ahora si o si en todas las que juego hay trolls flamers chilenos, y diamantes con premades que flamean,trollean y autolockean no entiendo y el auto emparejamiento es horrible te salen platinos maestros que si entan en tu equipo ok bien tienes suerte pero si estan en el otro equipo se fedean muy facilmente debido a los bronces o los oros con complejo de challenguer,no se que pasa ahora pero igual como todos estan diciendo a que juegos juegan hasta que el lol deje de explotar de esta gente,estoy esperando la nueva expancion de hearstone gadgetzan :v ojala jueguen tranquilos","replies":[]},{"poster":"Blaze Highwind","date":"2016-11-30T02:00:09.975+0000","up_votes":1,"down_votes":0,"body":"yo porque eso solo juego ranked porque en las normales se crea conflicto entre jugadores y eso es fome para la gente que quiere jugar serio y superarse ya po rito ponte las pilas como había dicho varias veces los cambios van de mal en peor.{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Benja God","date":"2016-11-29T20:40:26.103+0000","up_votes":2,"down_votes":4,"body":"Tanto que se quejan, ni que el LOL fuera el único juego que puedan jugar\n\nSe que es un pensamiento pesimista, pero venir a desquitarse a los foros no ayuda nada\n\n{{sticker:zombie-nunu-bummed}} ","replies":[{"poster":"SphinxZeld","date":"2016-11-29T23:16:34.043+0000","up_votes":1,"down_votes":0,"body":"aveces si escuchan como los rework de yorick y eso :V {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Fransoi ","date":"2016-11-29T15:23:33.995+0000","up_votes":1,"down_votes":0,"body":"el otro dia gane adc,tenia de supp una sona y en frente una vayne pero sin supp y dije tiraran remak o como sea y de la nada nos gankearon los jg xD","replies":[]},{"poster":"pablopablopablo","date":"2016-11-29T21:47:24.797+0000","up_votes":1,"down_votes":1,"body":"Está bien, me parece entendible que estés enojado porque tenes que jugar en la única cola que hay para normales y no haya otra opción pero no me parece razón para decirle \"dat estupido\" a una persona X en el chat... o decirle que tiene droga en la cabeza, ciertamente no me parece correcto.","replies":[]}]}