{"poster":"invisibleDjihad","date":"2015-03-02T14:39:36.923+0000","title":"leaverbuster verbesserung","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Ein Freund von mir ist bzw war im neuen leaverbuster. Was mich ziemlich aufgeregt hat wenn wir die 10 min gewartet haben und jem die queue geleftet ist mussten wir von neuen 10 min Warten auch wenn einer nicht angenommen hat... Vielleicht könnte man den leaverbuster so überarbeiten das er nicht sich immer wieder resetet... Auch wenn dies eine Bestrafung sein soll kann es wirklich ziemlich nervig werden","replies":[{"poster":"hshtagniemehrcdu","date":"2015-03-02T14:47:04.812+0000","up_votes":4,"down_votes":0,"body":"Geleftet?\nVerdient!\n\nUnd: Eine Bestrafung SOLL Lästig sein.","replies":[{"poster":"Gorantharon","date":"2015-03-03T10:33:06.061+0000","up_votes":8,"down_votes":0,"body":"Für geleftet sollte man keine 10 Minuten Warteschlange, sondern einen Schultag bekommen.","replies":[{"poster":"tortenmaker","date":"2015-03-03T10:36:42.729+0000","up_votes":1,"down_votes":0,"body":"Das findee ich sehr gut xDDDDD.\nOh Gott ich kann nicht mehr nice one XD\n10 / 10","replies":[]}]}]},{"poster":"Lisic","date":"2015-03-03T05:36:29.436+0000","up_votes":1,"down_votes":2,"body":"Ich habe auch einen Freund der vor kurzem angefangen hat League zu spielen. Durch ihn hörte ich das erste mal vom Leaverbuster und bin enttäuscht davon. Ich kann mir schon denken welche Wirkung dieses Tool haben soll, aber ich denke es wirkt abschreckend auf neue Spieler. Ich habe die Spiele anfangs sogar mit ihm gespielt, er hat halt sehr lange für das einkaufen gebraucht und wurde anscheinend nach dem Spiel für das AFK sein oder ähnlichen reportet. Er war halt auch auf der Lane gerne mal am Tower, statt vorne bei den Minnions.\n\nZusammenfassend, geleaved hat er nicht. Es hat seine Zeit gedauert bis er hinter das Item-System gestiegen ist.","replies":[{"poster":"eingew","date":"2015-03-03T08:00:02.204+0000","up_votes":3,"down_votes":0,"body":"Der Leaverbuster funktioniert ohne Reports. Für einen solchen einzelnen Leave wird man nicht bestraft. Sofern das also nicht öfter auftritt passiert ihm gar nichts.","replies":[{"poster":"tortenmaker","date":"2015-03-03T10:41:45.820+0000","up_votes":2,"down_votes":0,"body":"Da geht es ja auch nur darum das er ziehmlich lange laut der Aussage in der Base stand weil er lange gebraucht hat um hinter das Systems des Einkaufens zu kommen. Wenn dies am Anfang öfter passiert und in mehreren Spielen kann es passieren das das System in als afk ansieht. Auch wenn er dann wirklich sehr lange für das Einkaufen brauchen muss wäre dies dann aber ein Fehler im System der zu einer ungerechten Strafe führen würde.\n\nAllerdings kann man auch so Argumentieren das er dies ja im Botgame wo er alleine mit dir oder eben ganzalleine ist. Dort kann er sich dann mit den Mechaniken von LoL auseinandersetzen ohne dem Gegner zu Helfen und dem eigenen Team zu schaden.\n\nM.F.G\nTortenmaker{{champion:201}}","replies":[{"poster":"eingew","date":"2015-03-03T13:47:13.486+0000","up_votes":1,"down_votes":0,"body":"Wenn die Mitspieler drunter leiden ist das leider eine größere Menge, als die, die in dieser Hinsicht ungerechtfertigt vom Leaverbuster bestraft würden...","replies":[]}]}]}]},{"poster":"Wusel","date":"2015-03-02T15:46:03.506+0000","up_votes":1,"down_votes":0,"body":"Wenn die 10 Minuten rum sind, werden sie nur neu gestartet wenn entweder du oder er die Queue verlässt. Ansonsten sucht es \nweiter.","replies":[{"poster":"CrystalAmplifer","date":"2015-03-23T19:23:25.590+0000","up_votes":1,"down_votes":3,"body":"das tut es nicht ich darf jetzt 5 spiele je 20 min warten und werde auch das spiel aufhören ich hatte 2 mal nen dc und wurde reportet als leaver und des war in der woche 2 mal  sehr geil das spiel wird immer blöder ich werde 100 pro aufhören es nervt echt insgesammt 100 min zu warten bevor man 1 spiel spielt das gerade mal 30 min dauert der leave buster ist echt scheiße 5min würde gehen aber nicht 20","replies":[{"poster":"eingew","date":"2015-03-23T19:42:22.084+0000","up_votes":1,"down_votes":0,"body":"Wenn du nicht leavest musst du auch nicht warten.","replies":[]},{"poster":"Xantarian","date":"2015-03-25T00:55:30.962+0000","up_votes":1,"down_votes":0,"body":"Bis morgen dann","replies":[]},{"poster":"Temudschinn","date":"2015-03-25T10:22:50.225+0000","up_votes":1,"down_votes":0,"body":"Du nervst dich also über leaver und gleichzeitig darüber, dass leaver bestraft werden damit es weniger gibt? Also entweder du verlangst straffreies leaven und findest dich mit regelmässigen 4v5 matches ab oder du willst ausgeglichene Spiele und erträgst die Strafe, wenn du selber mehrfach Spiele verlässt.","replies":[]}]}]}]}