{"poster":"F1stFace","date":"2017-12-27T02:51:52.914+0000","title":"Appbounty","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Appbounty is an app i recently discovered. In it if you achieve enough play points it allows you to spend your points on a league rp card. Now these points are hard to obtain so i have learned it is not a scam. However, I am curious as if I were to use one of these gift cards if it would be against rules of such. Please respond whether or not i am allowed to redeem a gift card from Appbounty, thank you","replies":[{"poster":"pachiporomari","date":"2017-12-27T23:38:18.277+0000","up_votes":1,"down_votes":0,"body":"Kokua pretty much hit the nail on the head. You could get into big trouble trusting sites like this one. :/\n\nI would honestly just avoid the mess altogether. Usually if it's too good to be true... Then it's too good to be true!\n\nThat's probably not the answer you wanted to hear. Trust me, I know everyone wants free stuff, but I also don't want you getting in trouble for something that could easily be prevented by not falling for a scam. Hopefully our insight on the situation helped you make the most responsible decision! :)","replies":[]},{"poster":"Kokua","date":"2017-12-27T04:00:24.429+0000","up_votes":2,"down_votes":0,"body":"The scary thing about these type of things are possible reverse charges. Meaning, they pay for it, give it to you, then claim it was unusable and get a refund or get a new card / code. Then they make it look like you're the bad guy, since you're the one who redeemed it. Afterwards, the RP obtained from the card would be deducted from your account, and if you already spent some and don't have enough to return, your account could be locked until that amount gets paid.\n\nEven if this specific service isn't a scam, from what I've been reading, you don't earn much at all from it, and it sounds like it takes a lot more time and effort than it's worth. It may be a legitimate service, but always use caution, and never put your information out where it shouldn't be. If you do decide to use this and redeem some RP cards, I would suggest holding the RP for a week before deciding to use it.","replies":[]},{"poster":"F1stFace","date":"2017-12-27T02:52:46.710+0000","up_votes":1,"down_votes":0,"body":"sorry about my grammar i was in a rush","replies":[{"poster":"F1stFace","date":"2017-12-29T18:40:44.428+0000","up_votes":1,"down_votes":0,"body":"Thank you for the response, I just have one question. Not to distrust you or anything but I was wondering why, if you've heard of him, tilterellia was sponsoring this program and even said he uses it. Is it possible he's not realizing  that it's a scam. Or that it can get him in trouble.","replies":[]}]}]}