{"poster":"Maraudaur","date":"2016-07-20T05:31:44.359+0000","title":"Cool profile on two of our local university clubs","subforum":"Clubs","up_votes":2,"down_votes":0,"body":"http://oce.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/unsw1.jpg?itok=2XLTFlej\r\n\r\nCheck out these latest stories about two of our University clubs\r\n\r\nQUT - http://oce.leagueoflegends.com/en/news/community/university/profile-qut\r\n\r\nand\r\n\r\nUNSW - http://oce.leagueoflegends.com/en/news/community/university/profile-unsw-lolsoc","replies":[{"poster":"Yasei Doubutsu","date":"2016-07-20T06:21:58.850+0000","up_votes":1,"down_votes":0,"body":"I'm glad out local universities are doing this, and kicking some butt.\n\nHay this just came to me, Maraudaur can you (Or someone else) \nLike this (Profiles for our university clubs/teams)\nDo profiles or spotlights of other things?\n\nI think the Introduction to the Wrenchman, Emissaries and Instructors count.\n\n----\n\nI hope more universities get on-board with this.","replies":[{"poster":"Maraudaur","date":"2016-07-21T01:03:15.138+0000","up_votes":1,"down_votes":0,"body":"What kind of spot lights are you looking for? I can definitely start up a series on the boards if you think this is cool =)","replies":[{"poster":"Yasei Doubutsu","date":"2016-07-21T03:18:33.318+0000","up_votes":1,"down_votes":0,"body":"Well I've been thinking this for a while.\nHere are some of the suggestions.\n\nOCE rioter spotlights-\nGive the community a chance to get to know our rioters, and give our rioters a chance to know the community.\n\nRandom board member spotlight-\nSome of our board members have been active since 2009-2010 (Me included)\nOr some of our current ones are just active all the times, that their names stick out compared to everyone else's.\nSome are aggressive, some are passive, But without either of their feedbacks or comments we could never move forward.\n\nI've noticed ALOT more people trying to Advertise themselves on the forums (I just do it for fun, but hay it never hurts)\nI don't know many of them, I only know a few.\n\n(Feel free to edit this @Riot to add in ones I've missed, or anyone else feel free to comment your link)\n\nJonius does great musical work based on league or even some things his worked on his own (That's pretty cool)\nhttps://www.youtube.com/channel/UCUwcJ5V5F7eGZUbEq3vV-WA\n(The first guy I did my series on)\n\nFitzky is new, but he's got some of the basics down.\nhttps://www.youtube.com/channel/UCYXmP-GOGdhpw0H4DLV23tQ\n\nShorty had one, but all content seems to have been removed?\nHe wasn't that good, but he had the best attitude to any game.\n\nI know I've missed some, but what do you think?","replies":[]}]}]}]}