{"poster":"Maraudaur","date":"2017-10-04T07:09:56.530+0000","title":"Queue changes (Draft update + Ranked change)","subforum":"Announcements","up_votes":13,"down_votes":1,"body":"https://i.imgur.com/S6Y3cSn.png\n\nHi Summoners,\n~~~\n#Normal Draft\n\n**TL;DR**\nAfter two weeks the test has gone reasonably well. For the remainder of the test period we will be expanding the times and days Normal Draft is available. From 05/10/2017 until 19/10/2017 Normal Draft will be on EVERYDAY from 3pm to 1am AEDT. \n~~~\nI wanted to provide an update around how the test is going so far and what we are going to be doing for the remaining two weeks of the test.\n\nAs we mentioned in the [original announcement](https://boards.oce.leagueoflegends.com/en/c/announcements/WEAy3U0l-normal-draft-test-coming-to-oceania) the test will run until the 19th of October (can&rsquo;t believe we are halfway through already!). We have had Normal Draft enabled for 2 weeks now, Thursday to Sunday between 6pm and 11pm AEST/AEDT. What we have seen so far is that players have really been enjoying Draft when it is available and it is currently hovering around 17% of total normal games from a usage standpoint (when comparing the two queues while Draft is open).\n\nThe first two weeks have shown us how it looks when it is in a conservatively windowed format and what we want to do for the remaining two weeks is try an aggressive windowed test. We will be expanding the days and times it is available to see what kind of impact this has on the queue (and other queues).\n \n##**So from 05/10/2017 until 19/10/2017 Normal Draft will be on EVERYDAY from 3pm to 1am AEDT**. \n\nWhile this is an aggressive change, we wanted to take the opportunity of this test period to see how it goes. I want to be clear that this does not guarantee that Draft will stay available in the same state after the test is over.\n \n-Note remember to lock in your picks and bans in Draft!\n\n~~~\n#Ranked changes\n\nWe also have some changes to Ranked queue times. It&rsquo;s been awhile since we reviewed the state of our Ranked queues. \n\n##**We have made Solo/Duo queue available 24/7 and adjusted the Flex queue disabled times to be between 5am - 8am each day effective immediately.**##\n\n**Solo queue context**: After reviewing the long-term experience in the queue, we now feel comfortable that turning on Solo/Duo queue 24/7 will not have a negative impact on the health of the Solo/Duo queue or any other queue. \n\n**Flex queue context**: Until now, we&rsquo;ve had disabled times for both Solo/Duo and Flex. When we originally set these disable times, we didn&rsquo;t want to have both ranked queues unavailable at the same time. This meant that we spread the disable time evenly across both modes during the quietest time of the day (4 AM - 10 AM AEST).  \n\nGiven that we&rsquo;ve been able to confirm that having Solo/Duo on 24/7 should not cause any issues - and long term data around when and how players take part in Flex Queue, we&rsquo;re comfortable with not changing the number of hours Flex Queue is available. Instead, our plan is  moving it&rsquo;s disable time to cover the 3 least active hours of the day (5AM-8AM)\n\nIf we do begin to see any major queue time or matchmaking concerns for either Solo/Duo or Flex, such as degraded quality of games outside of the quieter hours, then we&rsquo;ll revisit this decision and adjust again if necessary.\n\nIf you want full info about when which queues are on check out the [Queue Schedule post](https://boards.oce.leagueoflegends.com/en/c/announcements/wgM0WBsO-queue-schedule-updated-feb-8th).\n\nOnce again keep sharing your feedback and showing us your favourite queue by playing it. Thank you for your continued support and good luck on the Rift!","replies":[{"poster":"3Bies","date":"2017-10-04T08:05:48.839+0000","up_votes":9,"down_votes":0,"body":"Well, I'll enjoy it while it's there!\nBtw: I'm not trying to promote this but I think this should be added into league https://boards.na.leagueoflegends.com/en/c/gameplay-balance/brOmRL97-team-leaverbust-choice-options\n{{sticker:slayer-pantheon-thumbs}}  ","replies":[]},{"poster":"Vegathron","date":"2017-10-04T07:36:23.234+0000","up_votes":9,"down_votes":1,"body":"I LOVE draft and have been playing it whenever i can. \n\nI would however make a suggestion.\n\nenable auto lockin if your hovering a champ when the timer goes off. this isnt ranked, people are more distracted and ive had a premade wait 15 mins then give up because one of the 5 people didnt lock a champ each time (since they are used to blind)\n\nthere is no real reason to force a dodge just because you forgot to lock a champ, and it turns alot of people i know away (they also dont play ranked so arent used to it from there either)\n\nother than that, awesome news! more draft is always welcome! (feel free to delete blind tbh XD)","replies":[{"poster":"Gehirn","date":"2017-10-04T10:11:12.606+0000","up_votes":5,"down_votes":0,"body":"Hi Vegathron,\n\nWhat you're describing is exactly the pattern of behaviour we saw when we first introduced lock-in requirements to ranked queues (draft normals has always had this as well, OCE just didn't have draft normals back then).\nFor the first couple of weeks, players were accidentally dodging games continuously despite the lock-in warning popups that came with the change, and feedback was that it was a terrible and unnecessary change.\n\nBut we stuck with it and sure enough after those first couple of weeks, players learned to lock-in their picks. Locking in picks led to massive decreases in time taken in champ-select and how long it takes to go from the play button to the game loading screen. Players getting into game faster, means getting out of game faster, which means getting into their next game faster.\nHaving less players sitting in a passive state waiting for the champ select timer to countdown when they already know what they want to play, means more players either in game or in queue. Which in turn means better matchmaking and lower queue times as there is a larger pool of players to match.\n\nSo while I get that for now it is a bit of an annoyance to see players dodge because they forgot to lock in, it won't take long for everyone to start remembering to lock-in, and when they do it will be worth it.","replies":[{"poster":"Vegathron","date":"2017-10-04T10:54:06.691+0000","up_votes":4,"down_votes":0,"body":"makes sense thanks for the reply=)","replies":[]}]},{"poster":"Fuszin","date":"2017-10-04T15:22:06.484+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vegathron,realm=OCE,application-id=3fteLeTW,discussion-id=glATfXAE,comment-id=0000,timestamp=2017-10-04T07:36:23.234+0000)\n>\n> I LOVE draft and have been playing it whenever i can. \n> \n> I would however make a suggestion.\n> \n> enable auto lockin if your hovering a champ when the timer goes off. this isnt ranked, people are more distracted and ive had a premade wait 15 mins then give up because one of the 5 people didnt lock a champ each time (since they are used to blind)\n> \n> there is no real reason to force a dodge just because you forgot to lock a champ, and it turns alot of people i know away (they also dont play ranked so arent used to it from there either)\n> \n> other than that, awesome news! more draft is always welcome! (feel free to delete blind tbh XD)\n\nI think this is a good idea BUT in the sense of Draft Mode being a great gateway to how Ranked game play works and it also being the closest actual thing to Solo/Duo for a player without the 20 champion minimum requirement , This could be the way Riot has intended it to be. But i could be mistaken! Removing this feature could just cause the same issue to occur more in Ranked games down the line.","replies":[]}]},{"poster":"SulkyJoe","date":"2017-10-06T12:18:16.478+0000","up_votes":4,"down_votes":0,"body":"Just got on OCE server, it's before 11:20pm AEDT, and normal draft just went down at 11pm.  Might need to actually implement this still?","replies":[{"poster":"Maraudaur","date":"2017-10-08T03:18:31.258+0000","up_votes":2,"down_votes":0,"body":"Hey that seems weird. I will investigate!","replies":[]}]},{"poster":"Nightjar","date":"2017-10-04T10:45:37.790+0000","up_votes":4,"down_votes":0,"body":"I always feel I have better games when I play late at night. \nI dunno, maybe it's the sleep deprivation stopping the jitters, the reduction in packetloss due to being offpeak, other players being drowsy and easier to outplay, or the lack of distraction you can achieve in a pitch black room with only glimmer of the moonlight that tries to creep under the hem of your curtain.\n\nAnyway thnx riot.","replies":[{"poster":"Vyndrae","date":"2017-10-04T16:52:26.311+0000","up_votes":1,"down_votes":0,"body":"OR the fact that with the exception of Friday and Saturday night all the school age teens are in bed instead of playing, which makes for a more mature group of players online (with some exceptions of course lol).","replies":[]}]},{"poster":"Battrazlok","date":"2017-10-04T14:36:27.470+0000","up_votes":3,"down_votes":0,"body":"As a nightshift worker this is the single best news regarding ranked i could hope for ^.^","replies":[]},{"poster":"Life after Death","date":"2017-10-06T13:33:36.034+0000","up_votes":2,"down_votes":0,"body":"Normal draft isn't up at the moment, it's not 1am either. Why's that?","replies":[{"poster":"Maraudaur","date":"2017-10-08T03:18:56.193+0000","up_votes":2,"down_votes":0,"body":"Hey that seems weird. I will investigate!","replies":[]}]},{"poster":"DarkImagination","date":"2017-10-05T11:15:15.060+0000","up_votes":2,"down_votes":0,"body":"I've been loving normal draft pick whenever it is available and I'm glad they changed it to be available EVERYDAY instead of Thursday to Sunday (even though its just testing). I like to be able to ban champions I hate playing against and I definitely prefer to play normal draft pick compared to blind pick. Since normal draft pick is a \"new\" queue to the OCE server, I think that it will rise with popularity with time. Anyway, I hope Riot will make this an actual queue in the near future. {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"101Evsey","date":"2017-10-04T09:23:43.902+0000","up_votes":1,"down_votes":0,"body":"I love the draft pick and have been looking forward to this since you first announced the idea. HOWEVER, it has never been online when I can play as I can only play during the day. So it is only available during hours school students can play is stupid as you are losing a majority of people who also want to try it. The only time we can play draft pick is in ranked and not all of us want to be that competitive. PLEASE if you are going to do draft pick in normals have it up all the time or don't do it at all as it is just unfair. You wanted feedback, you got mine now.","replies":[{"poster":"Zaps","date":"2017-10-04T10:36:21.211+0000","up_votes":2,"down_votes":0,"body":"**_If it was possible to have a consistently positive experience with these modes, right now, with them being active all of the time, we would do it in a heartbeat._**\n\nThe way that we choose the times to have modes active is around the times that the most players are active and playing games. \n\nOur core goal with the timing game modes is to maximize the amount of modes that are available for as many players as possible without it having significant problems with the quality of matchmaking / time to get a game. \n\nI know it sucks to miss out on this (I really do, my favourite modes in League have been Dominion and Twisted Treeline) - but we're doing it this way to get as many players as possible to play as much as possible. The good news is, the more that people play this mode, the more we're able to stretch the time that the mode is active. \n\nWe plan to constantly keep an eye on the state and activity of the queue - and increase the active time as aggressively as we can.","replies":[{"poster":"101Evsey","date":"2017-10-05T23:14:55.183+0000","up_votes":1,"down_votes":0,"body":"Fair enough. Thank you for replying :)","replies":[]}]}]},{"poster":"KDAs","date":"2017-10-12T04:46:33.967+0000","up_votes":1,"down_votes":0,"body":"Question - With Ranked Twisted Treeline, how come you guys aren't giving it more up time considering that It involves a end of season reward ??\nHint: I LOVE TWISTED TREE LINE <3 Thanks for it  :)\n\nEDIT 1: I can understand that if you have it up for 5 hours to improve the health of the queue, but I mean I feel like since it contains an end of season reward bonus I feel like that it should be given just a couple more days of up time.  ( In terms of Ranked )","replies":[{"poster":"Maraudaur","date":"2017-10-12T07:38:18.608+0000","up_votes":1,"down_votes":0,"body":"There's some great context in this thread - https://boards.oce.leagueoflegends.com/en/c/miscellaneous/AhNAAq06-can-oce-please-be-considered-a-region-that-doesnt-have-ranked-tt-enabled-for-end-of-season-rewards","replies":[]}]},{"poster":"Iliketurtle","date":"2017-10-10T19:04:26.163+0000","up_votes":1,"down_votes":0,"body":"Dear Riot\n\nYou have answer the rank calling. I can FINALLY play solo/duo without waiting for 6-9pm NZ everyday. Time to climb the leaderboard!  \n\nThank you very much\n\nBy your boi Koo998/Iliketurtle","replies":[]},{"poster":"dyshendra","date":"2017-10-10T06:55:44.912+0000","up_votes":1,"down_votes":0,"body":"is there plan to address the huge number of leavers in champ select for this q? - takes 5-6 lobbies before getting into a game ( I suspect because there is slim-no penalty for dodging if you don't get your champ/dont like your team comp/don't like your lane opponent), and the game is necessarily going to be any good due to the usual norms troll behaviours.","replies":[]},{"poster":"Larryy","date":"2017-10-09T18:32:55.741+0000","up_votes":1,"down_votes":0,"body":"please leave ranked solo on 24/7!","replies":[]},{"poster":"King Mike II","date":"2017-10-04T22:27:20.442+0000","up_votes":1,"down_votes":0,"body":"thank you so much for making solo q 24/7, i can finally do all nighters on my days off.","replies":[]},{"poster":"J Î Ñ X  ","date":"2017-10-04T12:55:10.724+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-jinx}}","replies":[]},{"poster":"Crumm","date":"2017-10-04T10:26:50.391+0000","up_votes":1,"down_votes":0,"body":"Would it be possible for flex 3v3 to be a all round thing? hate having to wait for the weekends to play it","replies":[]},{"poster":"PurpIe","date":"2017-10-04T10:26:19.911+0000","up_votes":1,"down_votes":0,"body":"I don't really play draft norms as much as I would've liked. Probably due to the time restraints on when the queue is live.\n\nHowever, this will definitely get me playing more norms since I actually get my role :D","replies":[]},{"poster":"tastical","date":"2017-10-04T10:17:16.513+0000","up_votes":1,"down_votes":0,"body":"I'm so happy this is happening but find most people don't know how it works and it can take 5 plus attempts to get a game","replies":[]},{"poster":"GeneralKenobi","date":"2017-10-04T09:34:15.411+0000","up_votes":1,"down_votes":0,"body":"Saw the announcement that draft normals has been extended:\n{{sticker:zombie-nunu-hearts}} \nLogged in immediately.\nPress 'Play' and only then realised it was to start 5/10 (tmmr)\n{{sticker:sg-soraka}} \nAnyways, this is great news and I really wish this can be enabled full time eventually.","replies":[]},{"poster":"Bush on Fire","date":"2017-10-04T08:12:43.498+0000","up_votes":1,"down_votes":0,"body":"can i get a heads up for when the season ends","replies":[{"poster":"PV Amnusia","date":"2017-10-04T09:06:05.750+0000","up_votes":1,"down_votes":0,"body":"I believe this season (2017) should end close to or on November 9th.","replies":[]}]},{"poster":"TechReck","date":"2017-10-04T07:56:45.294+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}}  Sounds good","replies":[]}]}