{"poster":"Maraudaur","date":"2016-05-24T02:38:59.448+0000","title":"2016 Shurima Art Contest","subforum":"Player Creations","up_votes":17,"down_votes":0,"body":"http://i.imgur.com/IWfNrED.jpg\n\nWe&rsquo;ve recently been releasing a lot of updated lore bios for our favourite Shuriman champions. We&rsquo;ve gone through scenes of betrayal, redemption, discovery, mystery and much much more. Now we want to see how you&rsquo;ve interpreted the vistas and experiences our champions have gone through. We want you to depict a scene from one of the stories from our recent Shurima lore releases.\n\nHaven&rsquo;t had a chance to read some of the lore yet? Check it out here - http://oce.leagueoflegends.com/en/featured/shurima/intro \n\nThere are a lot of cool scenes we want to see illustrated, below are a few examples;\n> \n>  &ldquo;Whispering winds from the heart of the desert speak of mighty cities rising from the earth, of a golden warrior marching at the head of an army of sand.&rdquo;\n>  \n>  &ldquo;Xerath stood in the shadow of the monolithic Sun Disc, knowing that an empire-destroying doom was but seconds away.&rdquo;\n>  \n>  &ldquo;The dawn sun reflected blindingly off Azir&#039;s flawless golden armor. In that instant, he knew that the traitor still lived. He sensed the magus&rsquo;s essence in the air that he breathed.\n>  \n>  Azir lifted a hand, and an army of his elite warriors rose from the sands at the base of the Stairs of Ascension.&rdquo;\n>  \n>  &ldquo;Stars guided the pair&rsquo;s sojourn across the desiccated expanse. The old jackal no longer wore the armor of the Ascended. The golden monuments lay buried with the past. Now a hermit dressed in tattered fabric, Nasus scratched at his matted fur before slowly raising his head to observe the night sky.&rdquo;\n\n**How winners will be selected?**\nWe&rsquo;ll select the shortlist based on the quality of the submission, originality of the piece and whether the entry follows the contest rules! Players will then get to vote and decide who the 10 winners are.\n\n**Dates**\nEntry submissions open now and close 20th of June at 12:30 PM AEST\nThe shortlist will be announced on the 22nd of June and voting will close on the 24th of June with the top 10 winners announced once votes are counted.\n\n**Submission methods**\n[Woobox ](http://woobox.com/3wbdsx)\nPublic Twitter/Facebook/Instagram post with the hashtag &ldquo;#ShurimaArt&rdquo;\n\n**Prizes**\nShortlisted entries will get - 10 Hextech chests and keys\nTop 10 voted will get - Taliyah Skin OR Mystery Skin + 5 more hextech chests and keys \n\nRules\nhttps://woobox.com/offers/rules/3wbdsx\n\nIf you have any questions after reading the rules let me know in the comments below!","replies":[{"poster":"Sarge","date":"2016-05-25T03:40:08.218+0000","up_votes":11,"down_votes":0,"body":"> [{quoted}](name=Maraudaur,realm=OCE,application-id=hIjvqaz6,discussion-id=GV39d3IN,comment-id=,timestamp=2016-05-24T02:38:59.448+0000)\n\n> \n> If you have any questions after reading the rules let me know in the comments below!\n\nHi Marauder, I've read the rules and looked at the proper channels to submit my work, but I would really appreciate your personal unbias feedback on my work so far.\n\nhttps://gyazo.com/5a4b0b24efb2dccc4988923030546507\n\nIts more of a literal interpretation of the lore - let me know your thoughts / constructive critisisms before I submit my final version through Woobox.\n\nCheers\nSarge","replies":[{"poster":"Maraudaur","date":"2016-05-25T06:26:20.024+0000","up_votes":4,"down_votes":0,"body":"WOW\n\nhttps://media.giphy.com/media/YVOgV17Hqyvte/giphy.gif\n\nI give it a 5/7","replies":[]},{"poster":"Zwby520","date":"2016-05-25T04:45:13.250+0000","up_votes":3,"down_votes":0,"body":"Haha, I hope you win mate!","replies":[]}]},{"poster":"Captain Skyrays","date":"2016-06-21T00:26:33.488+0000","up_votes":3,"down_votes":0,"body":"Welp, I just messed up hard. :< More or less devastated.\n\nI didn't realize the deadline was in Austrialian hours (AEST) as opposed to the server I'm on, NA — east coast, midwest, or west coast: I thought AEST was short for \"American Eastern Standard Time\" (I know, that was silly on retrospect). All in all, I found out about this contest extremely late, hereby in my company is a work of art without a functional Woobox link for submission.\n\nIs there by any means or measure to still submit my piece? I'd be happy to toss over a Dropbox link or send an attachment as seen fit. By NA standards it's June 20th around 8:30PM where I am, not yet midnight (before 11:59PM, as seen in the fine print).\n\nThe file is 2339x1654px at 200 dpi saved as a JPEG under 5MB, as per specification.\nhttps://www.dropbox.com/s/drh0uhc22sxiexy/Renekton%27sDarkness.jpg?dl=0\n\nEDIT: A short warring with passwords later, I have since added it to Instagram as well.","replies":[{"poster":"Maraudaur","date":"2016-06-21T02:28:18.907+0000","up_votes":2,"down_votes":0,"body":"Hey Captain Skyrays, unfortunately this competition is only for Oce players. However you made a pretty awesome piece of art and I hope you continue to create more of this in future! You will find a small token of our appreciation in your hextech inventory.","replies":[{"poster":"Captain Skyrays","date":"2016-06-23T21:46:41.536+0000","up_votes":1,"down_votes":0,"body":"After too long of a delay, I needed to come back and gracefully bow in my gratitude. The small token went on to be several wholly unpredicted RNG dreams stitched in one; there was bountiful laughter and near tears in the unraveling, hereby new sentimental cornerstones. Thank you. <3","replies":[]}]}]},{"poster":"Fren","date":"2016-05-24T06:48:10.150+0000","up_votes":3,"down_votes":0,"body":"If only i had any artistic skill at all {{item:3151}}","replies":[]},{"poster":"Khronix","date":"2016-06-02T12:58:11.176+0000","up_votes":1,"down_votes":0,"body":"Hey, this is the first art contest I'm entering and I was wondering, is it alright if we post our submition to deviantart before the contest winners are announced? And also I read that the maximum file size is 5mb... Which is gonna be a problem cause I completely missed that part and rushed to make my entry and so I ended up starting on a really big high res canvas on Photoshop (6gb at the moment) which I'm guessing will probably be 50-100mb when I save the final in .jpeg form and it's kinda too late to restart. That being said, can I just submit a link to my deviantart with the image in full size there or is that not allowed?","replies":[{"poster":"Maraudaur","date":"2016-06-02T22:25:12.131+0000","up_votes":1,"down_votes":0,"body":"yup thats fine. in the deviant art desc make sure you mention its for this contest","replies":[{"poster":"Khronix","date":"2016-06-03T00:17:20.496+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maraudaur,realm=OCE,application-id=hIjvqaz6,discussion-id=GV39d3IN,comment-id=000c0000,timestamp=2016-06-02T22:25:12.131+0000)\n>\n> yup thats fine. in the deviant art desc make sure you mention its for this contest\n\nStill a bit confused, So I upload it to my deviantart with \"an entry I made for oce's shurima art contest\" in the description and then what? do I still upload a smaller bad quality version to the woobox thing or can I just email you the final piece or a link to the deviantart page or post the devianart image link here?","replies":[{"poster":"Maraudaur","date":"2016-06-03T00:23:15.963+0000","up_votes":1,"down_votes":0,"body":"Upload a smaller version to the competition. In the caption you can put the link to your deviant art upload.","replies":[{"poster":"Khronix","date":"2016-06-16T08:57:27.056+0000","up_votes":1,"down_votes":0,"body":"Can you confirm if my entry made it? my pc crashed D:","replies":[{"poster":"Maraudaur","date":"2016-06-17T05:14:38.993+0000","up_votes":1,"down_votes":0,"body":"whats it look like? maybe link it here and I will let you know if I see it in the list of submissions","replies":[{"poster":"Khronix","date":"2016-06-17T07:37:50.348+0000","up_votes":1,"down_votes":0,"body":"http://korruptedsky.deviantart.com/art/Behold-the-deserts-wrath-615668551","replies":[{"poster":"Maraudaur","date":"2016-06-17T14:36:01.787+0000","up_votes":2,"down_votes":0,"body":"Yup got it!","replies":[]}]}]}]}]}]}]},{"poster":"Fusha","date":"2016-06-19T11:19:51.201+0000","up_votes":1,"down_votes":0,"body":"There's no way you're gonna save out a 50mb jpeg unless your canvas is like 30,000x30,000 pixels or something... and you can just resize the image in photoshop whenever you want or on export. Getting it to 5mb should not be an issue or cause you to loose much quality.","replies":[{"poster":"Khronix","date":"2016-06-20T00:23:23.906+0000","up_votes":1,"down_votes":0,"body":"it was 20x30 inches with 900 ppi lol, I got it to look decent though unless you zoom in a lot","replies":[]}]}]},{"poster":"Kawii","date":"2016-05-31T10:28:28.040+0000","up_votes":1,"down_votes":0,"body":"I'm thinking of drawing Amumu in the woods looking for friends (got idea for the video The Curse Of The Sad Mummy), but he's not a 'recent' champ, can I still draw him? {{champion:32}}","replies":[{"poster":"Maraudaur","date":"2016-06-01T01:35:16.871+0000","up_votes":1,"down_votes":0,"body":"Hey dude,\n\nYou can definitely draw about Amumu. But it needs to be a scene from the latest shurima lore releases, which you can find here\n\nhttp://oce.leagueoflegends.com/en/featured/shurima/intro\n\nThere is a Amumu bio there for you =)","replies":[{"poster":"Kawii","date":"2016-06-06T05:20:35.492+0000","up_votes":2,"down_votes":0,"body":"Ok thanks a lot! I just posted my entry. It's called 'The Mummy Who Wanders The Desert' I hope it fits all the needs! I posted it on woobox but it didn't scan the full drawing.. so I posted it on dev. ---> http://kawiidigital.deviantart.com/art/The-Mummy-Who-Wanders-The-Desert-613555333 \n\nThanks for hosting it, I had a lot of fun drawing it! ^w^","replies":[]}]}]},{"poster":"soapyharvest","date":"2016-05-24T09:39:47.556+0000","up_votes":2,"down_votes":0,"body":"yessssss, will be starting my entry asap \n\nyou guys should do more art competitions! :)","replies":[]},{"poster":"hyojeong","date":"2016-05-24T08:00:37.530+0000","up_votes":2,"down_votes":0,"body":"YEY PHOTOSHOP","replies":[]},{"poster":"soapyharvest","date":"2016-07-17T04:54:19.199+0000","up_votes":1,"down_votes":0,"body":"Hi! My entry was shortlisted and I still haven't gotten any prizes\n\nI was told the winners were emailed but it seems I didn't receive it \n\nThis was my entry https://www.facebook.com/LeagueOfLegendsOceania/photos/a.688661317941961.1073741875.243324295809001/688661677941925/?type=3&theater\n\nthanks :)","replies":[{"poster":"Maraudaur","date":"2016-07-20T00:10:59.363+0000","up_votes":1,"down_votes":0,"body":"Hey did you receive an email from me to the email address you put with your submission?","replies":[]}]},{"poster":"soapyharvest","date":"2016-06-30T12:49:36.084+0000","up_votes":1,"down_votes":0,"body":"when will the winners of this be announced?","replies":[{"poster":"Maraudaur","date":"2016-06-30T23:26:55.256+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nWe've announced the winners here - http://boards.oce.leagueoflegends.com/en/c/player-creations/eYNKkieR-shurima-art-contest-top-10\nAnd short list before that - http://boards.oce.leagueoflegends.com/en/c/player-creations/0EXHmFRE-shurima-art-contest-shortlist","replies":[]}]},{"poster":"ironhunt","date":"2016-06-21T15:18:15.686+0000","up_votes":0,"down_votes":0,"body":"I did a shurima art and posted it on facebook hash tagging it \nhow can i get to know that my art has been selected !!!!","replies":[{"poster":"Maraudaur","date":"2016-06-22T00:09:50.645+0000","up_votes":1,"down_votes":0,"body":"Shortlist being announced soon!","replies":[]}]},{"poster":"Zookie","date":"2016-06-19T14:21:23.713+0000","up_votes":1,"down_votes":0,"body":"Just wanted to double-check that my submission sent through! Submitted through the link above and is titled 'The Emperor's way' - has a picture of Azir standing on a paved road with Shurima in the background and the sun shining down on him around the sun disk.  \n\nLike another person on here, the thumbnail of it was cut off (should be able to see the swirls of sand to the left of Azir since there is a gap between him and the edge of the picture and on the other side, should be able to see part of the city and about 1/4 of the sun disk). Just wanted to check that the full picture was submitted?","replies":[{"poster":"Maraudaur","date":"2016-06-20T00:19:23.873+0000","up_votes":1,"down_votes":0,"body":"Can you post a link to it here so I can double check?","replies":[{"poster":"Zookie","date":"2016-06-20T00:43:46.388+0000","up_votes":1,"down_votes":0,"body":"You can see it [here](http://gadzooks97.deviantart.com/art/The-Emperor-s-Way-616440090)\nUploaded  it on deviantart just so it can be seen in the full width.","replies":[{"poster":"Maraudaur","date":"2016-06-20T01:51:21.074+0000","up_votes":1,"down_votes":0,"body":"Got the submission","replies":[{"poster":"Zookie","date":"2016-06-20T01:52:50.605+0000","up_votes":1,"down_votes":0,"body":"Thanks! :)","replies":[]}]},{"poster":"Daxt","date":"2016-06-20T01:26:51.208+0000","up_votes":1,"down_votes":0,"body":"I'm guessing the general consensus here is that the thumbnail has been cropped for display purposes? This has happened to mine as well :/","replies":[]}]}]}]},{"poster":"soapyharvest","date":"2016-06-19T09:00:48.205+0000","up_votes":1,"down_votes":0,"body":"is it possible to resubmit entries? I changed mine slightly since I entered it and I feel like it looks a lot better \n\nmy entry currently looks like this: https://scontent-syd1-1.xx.fbcdn.net/t31.0-8/13502863_1098723016855418_714582387689228294_o.jpg","replies":[{"poster":"Maraudaur","date":"2016-06-19T11:12:00.538+0000","up_votes":1,"down_votes":0,"body":"Yup go ahead and submit your new entry","replies":[]},{"poster":"Wuks","date":"2016-06-19T09:46:46.149+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=soapyharvest,realm=OCE,application-id=hIjvqaz6,discussion-id=GV39d3IN,comment-id=000e,timestamp=2016-06-19T09:00:48.205+0000)\n>\n> is it possible to resubmit entries? I changed mine slightly since I entered it and I feel like it looks a lot better \n> \n> my entry currently looks like this: https://scontent-syd1-1.xx.fbcdn.net/t31.0-8/13502863_1098723016855418_714582387689228294_o.jpg\n\nI don't think it should be a problem, so long as you stay within the submission deadlines!","replies":[]}]},{"poster":"Hyoton","date":"2016-06-05T04:53:07.939+0000","up_votes":1,"down_votes":0,"body":"Does it have to be a part of the recent update to the shuriman lore eg. addition of taliyah , or does the entry just have to be revolved around any part of the shuriman lore eg. cassiopeia betraying sivir.","replies":[{"poster":"Maraudaur","date":"2016-06-05T13:02:28.249+0000","up_votes":1,"down_votes":0,"body":"Hey Hyoton, \n\nWe are looking for art based off of the recent stories.","replies":[{"poster":"Hyoton","date":"2016-06-06T03:11:51.715+0000","up_votes":1,"down_votes":0,"body":"so anything from bloodline is alright?","replies":[{"poster":"Maraudaur","date":"2016-06-06T04:01:28.615+0000","up_votes":1,"down_votes":0,"body":"Bloodline is a okay","replies":[]}]}]}]},{"poster":"Autumn Luck","date":"2016-05-28T04:57:28.441+0000","up_votes":1,"down_votes":0,"body":"Hey Maraudaur, \nI have a question regarding submitting the final art piece. I tried to submit one then and after i submitted it an thumbnail preview of it shows however it is missing the sides of the work, even though i checked and it is definitely within the pixel size limits set (I tried smaller and larger than the pixel size suggestions). Is this normal and it simply displays slightly off or am I doing something incorrectly?","replies":[{"poster":"Maraudaur","date":"2016-05-29T23:24:19.168+0000","up_votes":1,"down_votes":0,"body":"Which entry was yours? I can have a look for you.","replies":[{"poster":"Autumn Luck","date":"2016-05-30T10:07:25.682+0000","up_votes":1,"down_votes":0,"body":"Its called \"The desert winds of Shurima\" - digital painting with Azir looking out over the desert towards the city (sorry don't know how to explain it more precisely)","replies":[{"poster":"Maraudaur","date":"2016-05-31T07:25:32.661+0000","up_votes":1,"down_votes":0,"body":"Its come through alright. Thanks for your entry!","replies":[{"poster":"Autumn Luck","date":"2016-05-31T12:04:05.501+0000","up_votes":1,"down_votes":0,"body":"Ok :D Thank you for checking :)","replies":[]}]}]}]}]},{"poster":"Zookie","date":"2016-05-29T10:00:22.519+0000","up_votes":1,"down_votes":0,"body":"Already started my artwork for this! I've always wanted to enter one of the art contests and I love the Shurima lore so this was the perfect chance. Very excited. I do have two questions though - \n\n1) How many artworks get shortlisted? Is there a specific number or is it dependent on how many apply?\n\n2) The post also mentions a \" grand prize winner \"? Is this just referring to the 10 winners who get the most votes or is this something different? \n\nThanks!","replies":[{"poster":"Maraudaur","date":"2016-05-29T23:25:19.266+0000","up_votes":1,"down_votes":0,"body":"hey man, excited to see your work!\n\n1) more than 10 =P depends on how many great artworks we get\n\n2) that refers to the 10 winners, I can see how that may be a bit confusing. Let me edit that bit to make it a bit more clear.","replies":[{"poster":"Zookie","date":"2016-05-30T03:20:46.193+0000","up_votes":1,"down_votes":0,"body":"Ok! Thanks for clearing up the confusion","replies":[]}]}]}]}