{"poster":"xXPsyk0TeRoRisTX","date":"2015-02-24T19:29:07.257+0000","title":"Antika - Der Verlorene Sohn der Schatteninseln","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Das hier ist Antika: \n\nGut also, hab mir da was überlegt. Die Passive könnte sein, umso mehr AD man hat umso Weniger AP kann man haben. Wenn man zb. 200 AD hat und eigentlich durch trinity force noch 30 AP das man eben nur 20 AP hat. Und vielleicht könnte man auch einen eigene Gegenstände für \"Antika\" (Ich mag den Namen^^) bereitstellen zb. der neue Gegenstand könnte \"Amulett der Kriegskunst\" das heißt das der Champ sich eben auf den Schwertkampf Spezialisiert und Zusätzlichen Angriff und Lebensregenration bekommen würde. Die Passive von dem Gegenstand könnte man Weglassen oder ihr eben je nach Stufe einen Prozentsatz mehr AD geben. auf stufe 1 vielleicht 2% und auf Stufe 4 12-15 %. Das kann man bei der W, also dem Bogen, mit Angriffsgeschwindigkeit machen und bei der E eben mit AP. Ich hab mir das so gedacht das man je nach Situation Items Kaufen kann also wenn man zb. im Ranked First pick ist sich auf seinen Gegner einstellen zu können, eben Flexibel Spielen zu können. Man gibt ihr dann geringe Startwerte, und sie Skalliert dann nur bei der Q mit der Stufe, bei den anderen mit Gegenständen. Die Ultimative würde ich mit den Beschwörungen Lassen. Also man hat sie wie bei Nidalee gleich am anfang nur hat sie mehr Cooldown. Sehr viel mehr. Sie würde so Funktionieren: Man drückt R und dann auf die Beschwörung die man gerne hätte. Also R dann Q,E,W etc. dann muss man damit 1 minute Klar kommen dann Senkt sich das immer mehr. Für jede Beschwörung gibt es dann andere Fertigkeiten. Sie soll übrigens ein Burst champion wie riven werden.\n\nWas die einzelnen Beschwörungen dann als Fähigkeiten haben sollen Liste ich mal hier auf:\n\nBei der Q (Schwert):\n\nQ= ein Verstärkender Angriff der 100% mit AD skaliert\nW= ein Skillshot, Skaliert mit 40% AD, Markiert den Gegner wenn man ihn mit der Q trifft wird er Verlangsamt.\nE= Sprintet zur vorgegebenen Stelle ohne Einheiten oder Terrain Kollision, Verursacht Schaden auf der Laufbahn, Skaliert 120% mit AD\n\nBei der W(Bogen):\n\nQ= Verursacht Absoluten Schaden an Champions (Vielleicht 10% vom Maximalen Leben vom Ziel Max. 400 Bei monstern) ODER Skalliert mit AD oder AP oder mit beiden\nW= Verursacht zusätzlichen Magischen Schaden, Skalliert mit AP, Kostet mana Pro Schuss (Muramana^^)\nE= Kann nicht Verlangsamt oder Bewegungsunfähig gemacht werden, erhält zusätzliches Angriffstempo\nHabe bei den Fähigkeiten hier ein wenig an Kayle gedacht^^\n\nBei der E(Magier)\n\nQ= Skillshot Skalliert 100% mit AP, Verlangsamt Ziel und Markiert Autoattacks oder Fähigkeiten Verursachen Schaden je nach Maximalen Leben des Ziels\nW= Springt hoch zur Zielposition, Betäubt gegner Falls markiert, wenn nicht dann wird er Verlangsamt. Skalliert 80% mit AP\nE= Verursacht Flächenschaden, Markiert alle gegner die getroffen wurden, wenn einer schon markiert worden ist wird er festgehalten. Skalliert 50% mit AP\n\nDie Passive, kann sein je mehr AP desto weniger AD und andersrum (AD wert kann jedoch nicht unter den Grund Angriffschaden fallen).\n\nFänds übrigens cool wenn man den Gegenstand für Antika sehen würde, das Amulett die Armschienen, was auch immer teil vom charakter werden würde.\n\n\nGeschichte (Von Cha0sS0rcerer):\n\nHier ist die Lore von Antika:\n\nEs gab einmal eine Zeit, in der die Schatteninseln noch nicht von den Schatten besetzt waren, Es herrschte eine friedliche Landschaft in der die Gärten und Wälder mit den schönsten Blumen gesäumt waren. Diese Idylle wurde von einem mächtigen und stolzen Volk bewacht. Sie nannten sich die Wächter. Die Wächter verteidigten ihr Land mit den drei mächtigsten Waffen: Das Schwert, der Bogen und die Magie. Niemand war mächtig genug um alle Waffen zu kontrollieren. Selbst der Anführer hatte die Macht dazu nicht. Der Anführer, namens Mata, führte das Volk mit Weisheit und Stärke. Er und seine Frau hatten einen überaus begabten Sohn, sein Name war Antika.\nSein Vater, ein mächtiger Schwertkämpfer und seine Mutter, eine starke Bogenschützin, hatten für ihn das Schwert bestimmt. Doch da sich Antika nicht zwischen dem Nahkampf des Schwertes, der Sicherheit des Bogens und der Kraft der Magie entscheiden konnte, übte er die Magie und das Bogenschießen heimlich aus. Antika begriff seine Begabung schon früh, nachdem er feststellte, dass er nicht wie andere pure Angst empfand während er die Kräfte aller drei Waffen gleichzeitig benutzte.\nAls dann bald die dunklen Mächte die Schatteninseln umwucherten musste Antika wie alle anderen auch in den Krieg ziehen. In den Kämpfen hob er sich von allen anderen gleichaltrigen ab, wobei er bewusst immer nur den Schwertkampf einsetzte, um sein Geheimnis zu bewahren. Als sein Vater und seine Mutter in der schlimmsten Schlacht aller fielen, sah sich Antika das erste Mal der Verantwortung als Stammesoberhaupt gegenüber. Als nur noch wenige zurückblieben, befahl er sich in die alten Ruinen seines Volkes zurückzuziehen.\nBald ging ihnen jedoch der Proviant aus und da Antika seine Kameraden nicht gefährden wollte verließ alleine die Ruinen. Dies war seiner Meinung die eine einzige Möglichkeit. Doch schon bald hatten ihn die Schatten eingekesselt. So fiel er in einen Fluss.\nAls er wieder aufwachte lag er auf dem Boden eines alten Tempels der Götter seines Volkes. Als er versuchte aufzustehen, fühlte er in seinem Körper eine unheimliche Kraft. Sie war zugleich berauschend wie auch beängstigend. Er fühlte regelrecht die Anwesenheit der Götter in sich. Als er Tempel verließ, fühlte er sich stärker denn je.\nAls er auf dem Weg zu den Ruinen jedoch die verwelkte Natur sah, wie lange er in dem Tempel gelegen hatte. Er befürchtete das schlimmste. Als er bei den Ruinen ankam, war sie verschlossen. Mit letzter Hoffnung stemmte er das Tor auf und fand seine Freunde alle tot vor. In purer Rache kämpfte er sich bis nach Valoran vor. Dort hörte er von der Liga der Legenden. Er sah in ihr eine Chance gegen die Monster der Schatteninseln zu kämpfen und die Wächter zu rächen.\n\nBei der Geschichte hat mir Core1808 geholfen Vielen Dank\n\nHier der Link zum Original, auch von mir: \n\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/qAZZHxJT-champion-idee-inspiriert-von-skyrim-d\n\nEnglish Translation incoming","replies":[]}