{"poster":"Fredrick Zoller","date":"2016-11-14T19:07:13.378+0000","title":"A esto le digo prepotencia...","subforum":"Charlas Generales","up_votes":2,"down_votes":17,"body":"voy Yasuo top, mi main desde lvl 15(para que no digan ayayay lo usas porque est&aacute; roto, en ese entonces no sab&iacute;a que estaba roto, no sab&iacute;a ni que hac&iacute;a de hecho xD) y bue, me toca contra una Poppy. A lvl1 cae el lee lvl2 y con red y escondiendome en los minions le hago quemar flash, y despu&eacute;s que se va mat&oacute; a la Poppy. En eso me pongo a backear en un bush y por joder tiro la maestr&iacute;a, pero resulta que en bush hab&iacute;a un wards, as&iacute; que la Poppy, que me hab&iacute;a visto se puso a flamear como si no hubiera un ma&ntilde;ana, &quot;izi champ, no tenes manos, manco qlo, bla bla bla&quot; y yo, por joderla un poco la empec&eacute; a matar y a sacar la maestr&iacute;a, al flameo general de la Poppy se le suma un Lee Sin y una Lux &quot;Yasuo sin mec&aacute;nicas, champ de manco, etc etc&quot; y yo segu&iacute;a a mi bolo, 9/3. Pasan los minutos y resulta que ten&iacute;amos una katarina afk desde minuto uno, y jugando todos para la risa, ni ganas de cerrar la partida. Lleg&oacute; el late y obviamente nos ganaron, eran uno m&aacute;s. Pero lo que realmente quiero comenta es la actitud de los rivales: izi game, izi top, izi Yasuo main bronce manco bla bla bla. Y les digo &quot;ganaron porque katarina est&aacute;ba afk y en late es obvio que se nota que sean uno m&aacute;s&quot; y me dicen &quot;ahora decilo sin llorar&quot; y yo me quedo en plan, wtf, ustedes lloraron toda la partida y yo soy el... En fin, da igual, que panda de prepotentes xD Incluso fui el que m&aacute;s da&ntilde;o hizo del game, pero ojo, que Yasuo m&aacute;s manco. En fin. Gracias por leer, espero no haberlos aburrido :) Paz.\r\n\r\nP.D. Ya hab&iacute;a posteado esto, pero estoy en el celu y no me di cuenta y lo puse en Gu&iacute;as y Consejos, lol","replies":[{"poster":"skysoul fenrir","date":"2016-11-14T19:17:23.295+0000","up_votes":1,"down_votes":0,"body":"yasuo apenas si tiene mecanicas :v es como una riven practicamente, si queres algo con mecanicas de verdad que demuestre respeto entre los jugadores juga a azir, asi de paso te ahorras toda la arena, yo tambien compre al champ y despues de 3 partidas no lo toque nunca mas por lo asqueroso que es, por que si matas con yasuo es como matar siendo maestro yi, en otras palabras, es un campeon roto por que de base lo volvieron roto a posta, no por que sus mecanicas se lo permitan v: ","replies":[{"poster":"Im Zoe Sorry","date":"2016-11-14T20:26:51.783+0000","up_votes":1,"down_votes":0,"body":"Riven?\nUsar **bien** a Riven es mas dificil de lo que crees.","replies":[{"poster":"skysoul fenrir","date":"2016-11-14T22:23:55.051+0000","up_votes":2,"down_votes":0,"body":"http://imgur.com/kxKgqD7 esta imagen habla por si sola :v","replies":[{"poster":"Im Zoe Sorry","date":"2016-11-15T00:27:48.817+0000","up_votes":1,"down_votes":0,"body":"Dije usar bien, no spamear Q. Cualquiera puede agarrar una riven y spamear Q.","replies":[]}]}]},{"poster":"Zoliza","date":"2016-11-14T22:32:05.468+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=skylightwolf777,realm=LAS,application-id=v7qsfXsE,discussion-id=NBtMXgoZ,comment-id=0002,timestamp=2016-11-14T19:17:23.295+0000)\n>\n> yasuo apenas si tiene mecanicas :v es como una riven practicamente, si queres algo con mecanicas de verdad que demuestre respeto entre los jugadores juga a azir, asi de paso te ahorras toda la arena, yo tambien compre al champ y despues de 3 partidas no lo toque nunca mas por lo asqueroso que es, por que si matas con yasuo es como matar siendo maestro yi, en otras palabras, es un campeon roto por que de base lo volvieron roto a posta, no por que sus mecanicas se lo permitan v:\n\nUn bronce diciendo que riven no tiene mecanicas JAJAJAJAJAJAJ.... Perdon me tente xD","replies":[{"poster":"skysoul fenrir","date":"2016-11-14T22:38:04.131+0000","up_votes":2,"down_votes":1,"body":"un oro que se cree superior a un bronce JAJAJAJAJAJAJAJAJ... perdon me tente xdxdxdxddd","replies":[{"poster":"Zoliza","date":"2016-11-14T22:40:03.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=skylightwolf777,realm=LAS,application-id=v7qsfXsE,discussion-id=NBtMXgoZ,comment-id=000200020000,timestamp=2016-11-14T22:38:04.131+0000)\n>\n> un oro que se cree superior a un bronce JAJAJAJAJAJAJAJAJ... perdon me tente xdxdxdxddd\n\nPrimero: Esta cuenta es platino.\nSegundo: Es mi smurf.\nTercero: 2W 14L , bronce 3 JAJAJAJA... Perdon me tente de nuevo.","replies":[]}]}]},{"poster":"Fredrick Zoller","date":"2016-11-14T19:28:53.519+0000","up_votes":1,"down_votes":0,"body":"Tengo a Azir en M6, la cosa es que después de los nerfeos no lo consigo hacer funcionar. Flash y heal, fantasmal, ignite, tp. Build offtanque, full damage, nose, se me hace super complejo jugarlo ahora, no es tan útil y empieza a pegar después de minuto 30 si solo farmeas. Y Yasuo, es cierto que no es de lo más complejo(Riven si, usar a Riven al 100% es digno de respeto, Boxbox, Lordmasterking, Adrián, Bestrivenna, son dioses) pero compararlo con maestro yi es medio pedorro, hay que saber sacar el máximo provecho al dash, para saltar muros, tradear sin recibir casi daño, dar el básico antes de ultear, el combo E+Q+ Flash+Aa+R. La Q después de impactar el tornado a máx rango para ultear y tener el tornado cargado nada más caer... Tiene sus triquiñuelas, y es muy divertido aprender a usarlas todas (creeme, la primera vez que hice el Eqflash quede con cara de pendejito de 12 años enamorado como por dos horas xD)","replies":[]}]},{"poster":"CKats Hellville","date":"2016-11-14T19:12:53.036+0000","up_votes":2,"down_votes":0,"body":"Creo que la maestria de campeones es algo que empezo siendo bueno pero ahora se hizo medio denso.. Por cada play que hace la gente se tira una maestria..  (por eso tengo el icono de tsm para que se spamee eso)","replies":[{"poster":"Fredrick Zoller","date":"2016-11-14T19:30:31.056+0000","up_votes":1,"down_votes":0,"body":"T S M, T S M, T S M!!!","replies":[]}]},{"poster":"Dildo de Moria","date":"2016-11-14T21:30:02.773+0000","up_votes":1,"down_votes":0,"body":"No justifico el flammeo, pero qué necesidad de provocar?","replies":[{"poster":"Fredrick Zoller","date":"2016-11-15T16:08:23.059+0000","up_votes":1,"down_votes":0,"body":"Cómo se pudo tan mad por tirar la maestría, la seguí tirando como estrategia de tilt xD","replies":[{"poster":"9081913DEL1","date":"2016-11-16T20:24:19.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MagomZeta,realm=LAS,application-id=v7qsfXsE,discussion-id=NBtMXgoZ,comment-id=00060000,timestamp=2016-11-15T16:08:23.059+0000)\n>\n> Cómo se pudo tan mad por tirar la maestría, la seguí tirando como estrategia de tilt xD\n\ny la estrategia de tilt termino funcionando mas para el oponente que para ti =P","replies":[]}]}]},{"poster":"9081913DEL1","date":"2016-11-14T20:26:44.967+0000","up_votes":1,"down_votes":0,"body":"De onda, perdiste una partida por estirarla teniendo ventaja. Eso es no pensar. Si vas ganando tenes que cerrar la partida. Ninguna guia dice que el juego se gana con kills. Podes espamear la maestria 500 veces, mientras no toques el nexo sos igual de amenazante que un ward.\n\nIzi, y si, muy dificil no fue, no se necesito mecanicas, estrategias, composiciones, solo esperaron a buildear y cerraron el game XD. Eso es izi.\n\nSaludos.\n\nP.D.: Main yasuo <jajaAJJAJAJAJJAJAJAJJAJAJAJJAJAJaa","replies":[{"poster":"Fredrick Zoller","date":"2016-11-15T16:07:11.073+0000","up_votes":1,"down_votes":0,"body":"Era una normal y me estaba divirtiendo, no tryhardeaneo ni nada. Me daba igual si la ganaba o la perdia, solo que me dio gracia que lloraron toda la partida y al final dicen izi.","replies":[{"poster":"9081913DEL1","date":"2016-11-15T16:22:31.864+0000","up_votes":1,"down_votes":0,"body":"Tu actitud es exactamente la misma poniendo un post por ese motivo cuando la partida la perdiste. Con que criterio sos mejor jugador si no ganas la partida?\n\nTiltear al oponente es una de las estrategias mas usadas de lol. y evidentemente funciono.\n\nSaludos.","replies":[{"poster":"Fredrick Zoller","date":"2016-11-16T19:51:28.678+0000","up_votes":1,"down_votes":0,"body":"Ganar o perder.. A eso se redujo este juego? Algunas de las mejores partidas que he jugado las he perdido, y acabo de ganar una partida 1-12 con Kindred... Ganar ye hace mejor jugador? No. Lo que aprendes en cada game es lo que te hace mejorar. Y el post lo puse para contar la experiencia, lo hice acá, pero tanto podría haberlo hecho en un grupo de FB o contárselo a un amigo. No siempre que alguien postea algo es para quejarse...","replies":[{"poster":"9081913DEL1","date":"2016-11-16T20:23:14.919+0000","up_votes":1,"down_votes":0,"body":"En realidad te estas quejando de que se burlaban de ti. \nQuien es mas listo el que tira una partida ganada o el que gana una partida perdida?\nEs logica my friend.\n\nSaludos.","replies":[]}]}]}]}]},{"poster":"Zevko","date":"2016-11-14T20:50:33.995+0000","up_votes":1,"down_votes":0,"body":"si bajsa a bronce 5, tenes oficialmente el peor perfil de la historia de este juego","replies":[{"poster":"Fredrick Zoller","date":"2016-11-15T16:36:33.422+0000","up_votes":1,"down_votes":0,"body":"Yo soy feliz","replies":[]}]},{"poster":"Pascut","date":"2016-11-15T16:13:51.633+0000","up_votes":1,"down_votes":0,"body":"https://cdn.meme.am/instances/500x/65983301.jpg","replies":[]},{"poster":"TSW Rorschach","date":"2016-11-14T19:48:50.019+0000","up_votes":1,"down_votes":1,"body":"Para mí que te pusieron negativos por ser main Yasuo y se pasaron por el arco del triunfo el resto del post :v","replies":[{"poster":"Fredrick Zoller","date":"2016-11-15T16:05:46.376+0000","up_votes":1,"down_votes":0,"body":"Y bue, cosas que pasan.","replies":[]}]},{"poster":"Fahrenwolf","date":"2016-11-14T22:28:01.326+0000","up_votes":1,"down_votes":0,"body":"La mayoria de la gente acusa a otra para hacerse sentir mejor a ellos mismos, solo no caigas en esa misma actitud :D\n\nDecir izi es para la gente que le gusta inspirar pena XD","replies":[]},{"poster":"Akusai","date":"2016-11-14T19:11:48.842+0000","up_votes":1,"down_votes":0,"body":"bueno prepotencia tambien podria ser \"tirar la maestria por joder\". Hay gente que la espamea al dar un paso, morir, matar un minion, comer un sanguche de milanesa, etc","replies":[{"poster":"Fredrick Zoller","date":"2016-11-14T19:30:00.803+0000","up_votes":1,"down_votes":0,"body":"Claro pero la primera vez la tire sin saber que me estában viendo, y como se pusieron tan nerviosos pensé que sería una buena estrategia de tilt xD","replies":[]}]}]}