{"poster":"Fredrick Zoller","date":"2016-02-02T14:26:33.815+0000","title":"Vamo' arriba Riot","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Es necesario que diga lo roto que esta el nuevo campe&oacute;n, o no se han dado cuenta de lo est&uacute;pido que es el da&ntilde;o que puede llegar a hacer... Osea, esta mezcla de Shander Choen y V el Terrorista tiene un da&ntilde;o rid&iacute;culo en todas las faces del juego, la pasiva le da un critico asegura, hasta ac&aacute; bien, que tambien hace da&ntilde;o extra, por que? porque soy guay... por que no puede ser un critico normal como el de Fiora o Shaco... na, tiene que hacer da&ntilde;o extra.. y ya ni hablemos de las trampas, que las muy asquerosas te bajan media vida(al menos es f&aacute;cil esquivarlas). He visto a algunos ir con 800 y 900 de AD... en un ap, vale, tiene la limitaci&oacute;n del mana y los cds, pero que venga un &quot;ADC&quot; (Lo he visto hasta en la JG) y que de un b&aacute;sico te  baje toda la vida, no da. No se, no soy programador ni nada, pero hay ciento y tantos campeones, que les cuesta comparar a los nuevos con esos, ver los ratios que tienen, la escalada en las habilidades y despu&eacute;s balancear en base a eso, no decir &quot;Su AS y Critico le da da&ntilde;o&quot;\r\ny que llegue este se&ntilde;or a los 900 de AD... Y ya no hablemos del R, algo as&iacute; como una mezcla de Lux, Xerath y Caitlyn... pero con 900 de AD. Vi a uno matar a una Soraka en la fuente... bueno, ya me descargue, RITO NERF!","replies":[{"poster":"Khimea","date":"2016-02-02T14:29:17.007+0000","up_votes":1,"down_votes":0,"body":"Todo campeon nuevo esta roto siempre, es cuestion de tiempo a que lo nerfeen.\nAclaracion: El critico pega 25% menos (o algo asi) que lo normal de otro champ","replies":[{"poster":"Fredrick Zoller","date":"2016-02-02T22:41:54.884+0000","up_votes":1,"down_votes":0,"body":"El critico de Yasuo tambien pega menos, pero este no tiene un golpe critico asegurado y aumentado con daño mágico cada 4 autos :/","replies":[]}]}]}