{"poster":"Fredrick Zoller","date":"2016-08-22T16:54:44.601+0000","title":"Es tóxico?","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Coment&eacute; esto en otra pregunta, pero me pareci&oacute; interesante compartirlo con ustedes: \r\n\r\nSiempre tuve la duda, se puede reportar por spamear la risa o las bromas o la chapa de maestria, para burlarse del rival? Y si es asi, como puedo probarlo? Y si es reportable, y Riot sabe que se usa para ser t&oacute;xico, por que existe? A Riot le gusta la comindad t&oacute;xica? Que opinan?","replies":[{"poster":"SlayerAhri","date":"2016-08-22T17:22:27.841+0000","up_votes":1,"down_votes":0,"body":"Si el rival dice \"gg izi\" ya es reportable, pero la maestria, la risa y el taun del campeon no lo son.","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T17:45:32.259+0000","up_votes":1,"down_votes":0,"body":"Es una burla, osea, una falta de respeto al rival, no es menos reportable que poner izi","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2016-08-22T17:50:23.006+0000","up_votes":1,"down_votes":0,"body":"Si se consideraran como tóxicos, no serían complementos del juego.","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T17:54:49.098+0000","up_votes":1,"down_votes":0,"body":"Por eso pregunto, a Riot le importa la toxicidad de la comunidad? O solo le intetrsa llenarse la cuenta de Dolares? Toda falta de respeto es tóxica, y cuando se usan estas opciones para burlarse del rival, no es menos tóxico.","replies":[{"poster":"Yo soy IronManX","date":"2016-08-22T23:43:02.565+0000","up_votes":1,"down_votes":0,"body":"hay veces que llego a pensar que a riot le da igual la toxicidad de server y si, después de que riot cambio de dueño, porque creo que ahora las acciones son totalmente coreanas (creo en realidad no me he informado bien) solo le interesa ganar mas y mas dinero, antes al menos regalaban una que otra cosa, por ejemplo el marco de las skin proyecto de ahora las vendieron por asi decirlo, ya que antes cuando salieron las skin de yi, leone, zed lucian, fiora venían incluidas en la compra, con eso te das cuenta que a riot si solo le interesa la pasta ahora","replies":[]},{"poster":"ANYASZOMORÍTÓK","date":"2016-08-22T17:58:09.265+0000","up_votes":1,"down_votes":0,"body":"Las risas y otros emotes se pueden mutear, lo de la maestría no. Ahora, si consideras que spamear cualquiera de esas cosas es algo \"tóxico\" es porque sos muy susceptible para este juego y sobre todo este servidor. Toxicidad es insultar, trollear, feedear a propósito y esas cosas si son motivo de sanción, no spamear un triste emote.","replies":[]}]}]}]}]},{"poster":"efukt","date":"2016-08-22T17:07:03.795+0000","up_votes":1,"down_votes":0,"body":"para nada, solo puedes comprobar toxicidad mediante el chat","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T17:11:24.616+0000","up_votes":1,"down_votes":0,"body":"Pero si se usan para burlarse del rival no es tóxico?","replies":[{"poster":"A Noxian Beauty","date":"2016-08-22T17:57:24.405+0000","up_votes":1,"down_votes":0,"body":"oye porfiado ya te dijeron que no es reportable,el tipo puede deletearte,bailar arriba de tu cadaver mientras spamea risa y maestria y no puedes hacer nada,esta en su derecho mientras no insulte por chat.","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T18:22:43.253+0000","up_votes":1,"down_votes":1,"body":"Entonces tenes el,criterio en el culo si pensas que eso que acabas de decir es menos reportable que escribir por chat.","replies":[{"poster":"A Noxian Beauty","date":"2016-08-22T23:15:30.695+0000","up_votes":1,"down_votes":0,"body":"[](https://gyazo.com/0b55e541bf686f51cacdcad505e9a915)\n\ny ahora reporto tu comentario a los rioters por insultos {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"ANYASZOMORÍTÓK","date":"2016-08-22T19:55:05.779+0000","up_votes":1,"down_votes":0,"body":"Jajajjajaja ¿Y qué vas a escribir en el reporte? \"Lo reporto porque soy un blandito y me molesta que me maten y bailen sobre mi cuerpo\".","replies":[]}]}]}]}]},{"poster":"EntrandoEnEsa","date":"2016-08-22T19:43:26.319+0000","up_votes":1,"down_votes":0,"body":"Amigo, nosotros no hicimos las reglas, solo te las contamos. Si no te dice nada en el chat riot no va a dar bola al reporte. Vos podras considerar que es tóxico reirse y mostrar maestria, estas en tu derecho, pero no vas a lograr nada reportando eso. Espero que quede claro. Saludos","replies":[]},{"poster":"Lunari Red Mask","date":"2016-08-22T17:22:08.790+0000","up_votes":1,"down_votes":0,"body":"Hombre, sí vas a jugar league of legends, tenes que tener paciencia y tolerancia. La gente que juega con tolerancia cero la pasa mal, incluso son reportados por tóxicos y flammers. Mayoritariamente los reportes son míos. Saludos.","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T17:51:31.271+0000","up_votes":1,"down_votes":0,"body":"Tolerancia? En serio? Hay que tolerar las faltas de respeto o las burlas de esos infraseres? Si toleras y no les decis nada les estas dando a entender que esta bien, les das poder y seguridad, que es lo que les falta, ya que normalmente los que hacen esto son personas tristes y repudiables, debiles, y buscan expiar su frustración haciendo miserables a los demas, si lo toleras, les das cancha, estas cediendo a su mediocridad, es como el abusivo patético del patio del colegio, si no le desis nada, va a,seguir haciendo lo que quiere, por que es débil y estúpido.","replies":[{"poster":"Lunari Red Mask","date":"2016-08-22T18:04:54.318+0000","up_votes":1,"down_votes":0,"body":"Pues bien, pero caer en responderles de la misma forma lleva a que te conviertas en la misma cosa que ellos. Puedes sí, decirles que paren o los muteas, y puedes sí, decirles que los reportaras por su comportamiento. Ahora yo prefiero saltear esa parte y pasar al reporte directo y silencioso. Cada uno que haga lo que quiera que yo no soy padre de nadie, ni me puedo responsabilizar de como se educa hoy en día a las personas.","replies":[]}]}]},{"poster":"arielsebastian","date":"2016-08-22T17:00:07.547+0000","up_votes":1,"down_votes":0,"body":"Esto, no es una toxicidad ni nada, estan hechas, para demostrar algo ingame, sin faltarle al respeto al rival, que quiere decir esto?\nRIOT incluyo una forma de mostrarle a tu rival o a tus compañeros, tu habilidad, sea a favor o en contra.\n\nSe llama, fomentar la competitividad","replies":[{"poster":"Fredrick Zoller","date":"2016-08-22T17:05:02.429+0000","up_votes":1,"down_votes":0,"body":"Pues mas allá de fomentar la competitividad es molesto, que te maten ya de por si es tilteante, pero que luego saque una Maestria y se ria, aun cuando juega, nose, garen, es bastante molesto, se esta burlando de ti.","replies":[{"poster":"nostrade","date":"2016-08-22T17:19:16.158+0000","up_votes":1,"down_votes":0,"body":"Las risas puedes silenciarlas muteando al rival que las spamea.","replies":[]}]}]}]}