{"poster":"QuiNSonG","date":"2016-01-14T06:29:16.553+0000","title":"NOT FUNNY - ZAC's hidden nerf on (E) Elastic Slingshot","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"Okay, the devs TOTALLY didn&#039;t think about it when they changed what happens when you mouse over your cursor over the abilities, because mousing it over Zac&#039;s Jumpshot ability (E) now doesn&#039;t show the Slingshot&#039;s maximum range at that level anymore, and that REALLY stuffs up his gameplay not knowing exactly how far the range is at times you really want some confirmation.\r\n\r\nRiot please please please revert it back to the original!!!","replies":[{"poster":"Gasmanv2","date":"2016-01-15T04:30:24.877+0000","up_votes":2,"down_votes":0,"body":"I agree. Nothing in the notes about this being changed, but completes ruins his potential ganking ability!!! Please revert this back!!!","replies":[]},{"poster":"IphStich","date":"2016-01-15T00:19:42.246+0000","up_votes":2,"down_votes":0,"body":"Wait, what did they change? What happens when you mouse over abilities now?","replies":[{"poster":"QuiNSonG","date":"2016-01-26T11:18:50.254+0000","up_votes":1,"down_votes":0,"body":"You just see a mini cone of his minimum jump range, regardless of what level his E ability is.","replies":[{"poster":"ScrubCloud","date":"2016-01-26T12:04:48.292+0000","up_votes":1,"down_votes":1,"body":"ITS A BUG, THEY'RE PATCHING IT NEXT PATCH SO PLS","replies":[]}]}]},{"poster":"Brucey","date":"2016-01-14T08:59:43.976+0000","up_votes":3,"down_votes":1,"body":"Noticed it last game when trying out the new ap item on him and it kinda screwed me as i would think it would reach but it didn't cause there was no showing of the maximum range, Please riot fix this","replies":[]},{"poster":"QuiNSonG","date":"2016-01-26T11:20:22.836+0000","up_votes":1,"down_votes":0,"body":"Not sure if Riot Oceania can change or has a say in anything, but I'm hoping Zac players all around the world are helping each other revert back to the optimal mouse scroll over E ability cone silhouette thing. It's really affecting optimal Zac plays.","replies":[]}]}