{"poster":"alonso1983","date":"2017-02-09T03:29:22.290+0000","title":"Coscu y otra cuenta prestada","subforum":"Comportamiento del jugador","embed":{"description":"Twitch is the world's leading video platform and community for gamers. More than 45 million gamers gather every month on Twitch to broadcast, watch and chat about gaming. Twitch's video platform is the backbone of both live and on-demand distribution for the entire video game ecosystem.","url":"https://www.twitch.tv/videos/120728964","image":"https://static-cdn.jtvnw.net/v1/AUTH_system/vods_c901/coscuuu_24472907088_598227195/thumb/thumb0-480x320.jpg"},"up_votes":16,"down_votes":2,"body":"bueno este jugador no para de conseguir cuenta y tratando de burlarse de ustedes se&ntilde;ores riot, es mas dejo un video para que lo puedan detectar ustedes mismos, tenemos que acabar con este tipo de personas que solo ensucian este hermoso juego.","replies":[{"poster":"Ks Erwyn","date":"2017-02-09T03:36:44.813+0000","up_votes":10,"down_votes":9,"body":"pobre tipo, victima de este sistema opresor, dictatorial y mal estructurado que es RIOT :V","replies":[{"poster":"alonso1983","date":"2017-02-09T04:06:53.408+0000","up_votes":5,"down_votes":4,"body":"no lo defiendas, ese coscu es un trol y flamer","replies":[{"poster":"Ken Bread","date":"2017-02-09T11:49:08.711+0000","up_votes":6,"down_votes":0,"body":"Amigo te recomiendo arreglar el detector de sarcasmo :u","replies":[]}]},{"poster":"Nuke","date":"2017-02-09T13:52:23.587+0000","up_votes":2,"down_votes":0,"body":"Stos machirulos... Deberia dejar de existir el patriarcado.","replies":[]}]},{"poster":"alonso1983","date":"2017-02-09T03:55:40.257+0000","up_votes":6,"down_votes":0,"body":"atencion atencion coscu se compra cuenta level 30 y despues le cambie el nick.\nahora se llama elsa cowea\nhttps://clips.twitch.tv/coscuuu/HomelyButterflyStoneLightning","replies":[{"poster":"DemianBJ","date":"2017-02-11T22:13:01.167+0000","up_votes":1,"down_votes":0,"body":"no es comprada, no hables pavada, esa la cuenta la tiene hace mucho junto con la que le banearon.","replies":[]},{"poster":"WilfreCheesemice","date":"2017-02-09T16:43:46.698+0000","up_votes":1,"down_votes":0,"body":"\"Lo khe phása ezke esh um p3rsonageh, el no ez azzzy\"","replies":[]}]},{"poster":"Mazer Rakham","date":"2017-02-09T04:07:09.427+0000","up_votes":5,"down_votes":0,"body":"No hay que darle bola, cuando lo dejen de seguir sus lacayos porque perdieron tiempo y dinero va a dejar de existir. Darle publicidad (aunque sea mala), es alimentar al troll. Es un nene de pecho que quiere llamar la atención porque papi y mami no se la dieron de niño.","replies":[{"poster":"Nuke","date":"2017-02-09T13:51:40.302+0000","up_votes":2,"down_votes":1,"body":"Lo estamos Difamando, no haciendo famoso.","replies":[{"poster":"Mazer Rakham","date":"2017-02-09T16:41:19.527+0000","up_votes":3,"down_votes":0,"body":"La mala fama es un tipo de fama también...","replies":[]}]},{"poster":"LCI Insight","date":"2017-02-09T17:30:48.573+0000","up_votes":1,"down_votes":0,"body":"No podemos esperar que esos \"lacayos\" dejen de seguirlo. Por algo comenzaron a seguirlo, por algo lo siguen siguiendo y por algo no lo dejarán. El delicado \"Sentido de pertenencia\" es más potente en cierta edad y más masivo.\n\nUn jugador con las actitudes que tiene y el fácil acceso a su seguimiento debe recibir las sanciones que cualquier otro jugador con su tipo de conductas.","replies":[{"poster":"Mazer Rakham","date":"2017-02-09T17:49:15.157+0000","up_votes":1,"down_votes":0,"body":"Lo de las sanciones es obvio y estoy completamente de acuerdo, pero creando post tras post tras post diciendo \"Coscu esto, Coscu lo otro\" lo único que consiguen es seguir dandole fama. Cuando se den cuenta los pibes que lo siguen que lo único que obtienen es pasar vergüenza y que los padres les corten los víveres, este pibito ya no va a tener de qué alimentarse. En la adolescencia el \"sentido de pertenencia\" es volátil, fugaz... un día son rochos, al otro chetos, al otro escuchan dubstep, la semana siguiente otakus antisociales, únicos y diferentes... Cuando papá les empiece a sacar el módem por la noche o mamá deje de prestarles la tarjeta de crédito para gastar en juegos se van a dar cuenta que sólo perdieron tiempo y dinero de los padres. Van a dejar de seguirlo y listo. Sino, algún dia va a aparecer alguien que les diga que Coscu es un idiota y mas idiotas los que lo siguen y porque esa persona les gusta o la admiran de repente se van a olvidar que alguna vez le dieron su cuenta de LOL a un extraño de internet que misteriosamente ni saben quién es ni de donde salió.","replies":[{"poster":"LCI Insight","date":"2017-02-10T17:37:40.273+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo con lo de que quizás debiese usarse una vía más privada (Algún contacto directo entre un jugado que quiere dejar en antecedente que este player sigue adquiriendo cuentas, me parece un mal uso del foro, quizás sea más recomendable que usen tickets nomás)\n\nPor otro lado, y aunque quizás ya nos estamos alejando del tema principal xD, discrepo con lo del sentido de pertenencia, sobre todo en la adolescencia (De la cual no estamos hablando de 1 o 2 años). Hay que considerar que desde temprana edad ya hay niños identificándose con ídolos y de esta generación son estos los nuevos. Ya para la adolescencia hay una identificación diferente, desde este sentido de pertenencia que ojo, no siempre esta tan fugaz, volátil. El sentido de pertenencia hace que, como hemos visto en algunos comentarios, no hace que si alguien dice que la gente que sigue a coscu es tonta yo dejo de seguirlo, por lo general refuerza el sentido de pertenencia y salen estos comentarios de gente defendiéndolo, porque es algo casi personal.\n\nNo todos los padres tampoco ponen límites a sus hijos y educan respecto a conductas que vienen desde el hogar y la familia a la base de el comportamiento que nosotros podemos ver solo en su faceta de videojugadores. Eso de creer que en su mayoría son niños mimados con padres muy permisivos es una generalidad. \n\nLo comento desde mi experiencia como psicólogo infanto-juvenil. \n\nPero en definitiva (Y después de este enorme paréntesis xD jajaja) , sí, estoy absolutamente de acuerdo de que quizás sea bueno publicar un método menos polémico para denunciar a jugadores de este tipo que son baneados y acceden rápidamente a nuevas cuentas.","replies":[]}]}]},{"poster":"La corrupción","date":"2017-02-09T16:07:09.412+0000","up_votes":1,"down_votes":0,"body":"No papa, esa gente no se va a dar cuenta nunca de que pierden tiempo","replies":[{"poster":"Mazer Rakham","date":"2017-02-09T16:41:41.802+0000","up_votes":1,"down_votes":0,"body":"Pero los padres si de que pierden plata \n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"La corrupción","date":"2017-02-09T17:03:11.031+0000","up_votes":1,"down_votes":0,"body":"No...","replies":[]}]}]}]},{"poster":"CKats Hellville","date":"2017-02-09T03:33:15.248+0000","up_votes":5,"down_votes":1,"body":"que tipo mas desagradable","replies":[{"poster":"alonso1983","date":"2017-02-09T03:35:52.515+0000","up_votes":2,"down_votes":0,"body":"ese coscu es un trol","replies":[{"poster":"Sabishy","date":"2017-02-09T15:13:13.820+0000","up_votes":1,"down_votes":0,"body":"Lo peor de todo es la gente que lo sigue y hace exactamente lo mismo u.u","replies":[]}]}]},{"poster":"RING0","date":"2017-02-09T14:59:40.025+0000","up_votes":3,"down_votes":0,"body":"lo mas triste de todo esto es que pertenece a un equipo y va a eventos presenciales siendo que hace este tipo de cosas","replies":[]},{"poster":"alonso1983","date":"2017-02-09T03:40:46.184+0000","up_votes":3,"down_votes":0,"body":"{{summoner:4}} \nmiren miren pero si es un flamer y esta comprobado\nhttps://clips.twitch.tv/coscuuu/LivelyKangarooShibeZ","replies":[{"poster":"TheChampion1","date":"2017-02-10T22:35:36.237+0000","up_votes":1,"down_votes":0,"body":"una pregunta vos no lees lo que puso o que?\n\ntranca borrame el post que sabes que tengo razon saluditos","replies":[]}]},{"poster":"TheSystruction","date":"2017-02-09T04:22:06.862+0000","up_votes":2,"down_votes":34,"body":"dejenlo tranquilo al pibe, no les hizo nada a ustedes, y los rioters tambien, dejense de niñerias, que porque lo odien no significa que deban banearlo, sean justos con todos los jugadores por igual y dejenlo, si el sistema automatico lo banea, en buena hora, pero sino dejenlo, total el pibe les atrae audiencia que de otro modo no tendría este server, es lo que vende acá, sino miren el éxito del barba. Encima baneandolo por cualquier cosa hacen que el pibe se crea el centro del mundo, dejen a este chavon en paz, ya fue, no es Tyler1","replies":[{"poster":"alonso1983","date":"2017-02-09T04:24:53.466+0000","up_votes":9,"down_votes":0,"body":"mirennnnnn llegaron los hijos pequeños del trol coscu, no lo defiendas man, si coscu es un trol","replies":[{"poster":"TheSystruction","date":"2017-02-09T05:04:36.092+0000","up_votes":2,"down_votes":15,"body":"***","replies":[{"poster":"Nuke","date":"2017-02-09T13:50:59.337+0000","up_votes":4,"down_votes":0,"body":"Dejemos que siga trolleando, flameando como Brand y que siga banneando las cuentas de sus subscriptores.","replies":[{"poster":"LCI Insight","date":"2017-02-09T17:35:38.635+0000","up_votes":2,"down_votes":0,"body":"Oye buen punto xD Quizás nos está haciendo un favor... le prestan cuentas las personas que abalan su conducta y probablemente la repitan. Eventualmente el nos facilita banear las cuentas de esta gente hasta que eventualmente no se quede con ninguna :O.\n\nCon mayor razón hay que reportar y dejar antecedentes de cualquier cuenta nueva, así aceleramos el proceso de baneo masivo xD!","replies":[]}]},{"poster":"LCI Insight","date":"2017-02-09T17:33:24.097+0000","up_votes":1,"down_votes":0,"body":"Él, cumple con varios criterios de conducta anti-deportiva, da lo mismo si me cae mal o no. El DEBE SER SANCIONADO, no me importa que no me empareje con el, pero el juega con jugadores positivos, amigables, coolaboradores y con actitud de camaradería. Esta persona ~~basura~~ tiene un impacto negativo en la experiencia de juego de cualquier persona con la quien sea emparejado. {{champion:201}}","replies":[]}]},{"poster":"Mioen","date":"2017-02-09T12:35:57.067+0000","up_votes":1,"down_votes":7,"body":"Nadie lo defiende al flaco, pero la gente se esta llendo a la mierda creando post sobre el chabon por algo tan estupido. Juro que llevo viendo bastantes post de mierda con el tema de bannearon al Coscu.\n\nY saben que son de gente alegrandose por que lo bannearon. Saben hasta cierto punto lo puedo entender, pero que creen tantos post con este proposito es una estupidez.","replies":[]}]},{"poster":"Nuke","date":"2017-02-09T13:50:13.864+0000","up_votes":8,"down_votes":0,"body":"> dejenlo tranquilo al pibe, no les hizo nada a ustedes\n\n¿Y que? No somos egoistas. A nosotros no, pero a muchisimos mas que no somos nosotros, si. \n\n> que porque lo odien no significa que deban banearlo, sean justos con todos los jugadores por igual y dejenlo\n\n¿¡SOLO PORQUE LO ODIAMOS!? .__.\n\nPresta cuentas, trolea, flamea a mas no poder. No es solo porque lo odiamos, es porque infringe el codigo de invocador al limite.","replies":[{"poster":"TheSystruction","date":"2017-02-09T16:02:37.364+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=XNuke69,realm=LAS,application-id=PJAKt7ph,discussion-id=EM8jZpff,comment-id=00050001,timestamp=2017-02-09T13:50:13.864+0000)\n>\n> ¿Y que? No somos egoistas. A nosotros no, pero a muchisimos mas que no somos nosotros, si. \n> \n> ¿¡SOLO PORQUE LO ODIAMOS!? .__.\n> \n> Presta cuentas, trolea, flamea a mas no poder. No es solo porque lo odiamos, es porque infringe el codigo de invocador al limite.\n\nque lo baneee el sistema, es jugador común, y si les siguen baneando las cuentas a los suscriptores, es porque ellos se la prestan y son conscientes de los riesgos, el problema lo tienen ellos :( no uno,simplemente no te metas en donde no te incumbe, si hace todo eso, el sistema lo va a castigar tarde o temprano, de seguro los rioters ya deben estar pensando en un ban de IP , lo que sucede es que es complicado porque el internet se comparte de a pares :/ y dudo que sepas mucho al respecto asi que simplemente con un reporte al soporte del juego es suficiente, y si haces esa buena acción, listo, sos un heroe, pero no vengas a toxiquear en el foro, se un poco vivo, asi se te ve como a un heroe del server y no como a un resentido :( {{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Hiccup Haddock ","date":"2018-11-16T20:19:10.430+0000","up_votes":1,"down_votes":0,"body":"we mira como hateaban hace 2 años ajaj ahora todos estos deben ser fan del cusco","replies":[]},{"poster":"TheChampion1","date":"2017-02-10T22:28:31.551+0000","up_votes":1,"down_votes":0,"body":"Dios mio otro mas con lo mismo yo no entiendo que les molesta a ustedes que juege en las tanta envidia le tenes por un par de personas  que lo miran, para que le das mas mecha, si vos seguis posteando sobre el mas ganas de hacerlo va a tener y con eso vas a llegar a volverte loco mas o menos \n\nPD:Son cuentas compradas no prestadas salu3","replies":[]},{"poster":"Zota","date":"2017-02-09T23:16:14.957+0000","up_votes":1,"down_votes":0,"body":"que casualidad que todas las personas que quieren que coscu sea baneado son iguales.....","replies":[]},{"poster":"Rroncon","date":"2017-02-09T16:24:16.221+0000","up_votes":1,"down_votes":0,"body":"PREGUNTA:\nLe aplicaron la permaban al estilo tyler1? osea que si se crea su propia cuenta se la van a banear aunque no haga nada? o todavia no?","replies":[]},{"poster":"PATH Kamui","date":"2017-02-09T14:34:04.076+0000","up_votes":1,"down_votes":0,"body":"Alguien me ilustra y me  dice quien  demonios es este tipo ????","replies":[]},{"poster":"NO SOY EL PELAO","date":"2017-02-09T04:23:47.752+0000","up_votes":1,"down_votes":16,"body":"***","replies":[{"poster":"alonso1983","date":"2017-02-09T04:32:21.733+0000","up_votes":4,"down_votes":0,"body":"sabias que riot son una comunidad que se envia informacion mutua. ademas este trol al que todos lo defienden en LAS no puede jugar por que no lo soportan. es mas es un trolsito que mas encima lo baniaron de BR ayer, es un trolllllllllllllllll","replies":[]},{"poster":"Nuke","date":"2017-02-09T13:42:11.389+0000","up_votes":1,"down_votes":0,"body":"Ibas RE bien, hasta que pusiste:\n\n>como tu existencia\n\nuna pena, ya crei que habria un comentario coherente defendiendolo.","replies":[]}]},{"poster":"Banjo","date":"2017-02-09T04:23:32.370+0000","up_votes":2,"down_votes":24,"body":"Arruina tu experiencia?, te lo encontraste en una ranked y te trolleo?, como sabes todo eso de coscu? lo estas viendo.\nTe recomiendo ignorarlo si tanto te molesta, asi dejas de pensar en el.\nsaludos","replies":[{"poster":"Nuke","date":"2017-02-09T13:47:16.790+0000","up_votes":5,"down_votes":0,"body":"> asi dejas de pensar en el.\n\n¿Cuando dijo alguien que le molesta en lo personal? Lo que pasa es que no somos tan egoistas para dejar a un troll al que le prestan cuentas y decir:\n\n> \"No me preocupo, a mi no me paso nada y ademas esta en otro server\".\n\nQueremos que no arruine la experiencia de tantos invocadores, queremos limpiar la comunidad, hacerselos saber a Riot para que tomen cartas al asunto, asi como las tomaron con aquellos de Rebirth.","replies":[]}]}]}