{"poster":"XMasterLasheronX","date":"2017-03-09T04:09:23.634+0000","title":"La duda que tengo sobre ''Los Nuevos Backs''","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Hola. Como dice el titulo tengo la duda de Porque &#039;&#039;los nuevos backs&#039;&#039; por decirlo asi de campeones que no tienen animacion de retirada Ahora son solo animaciones de Bailes,risas entre otros Y eso es lo que dice el titulo \r\na riot se les acabaron las ideas o cuesta Mucho Hacer Animaciones Personalizadas para cada champ \r\nPorque en mi opinion personal Me gustaba mas que se quedara quietito mientras me retiraba a base","replies":[{"poster":"TSW Rorschach","date":"2017-03-09T04:21:05.438+0000","up_votes":2,"down_votes":0,"body":"Algunos quedaron bien con las animaciones de inactividad, como {{champion:22}}. Pero la mezcla del Taunt y la risa de {{champion:114}} se me hizo horrendo, y así tenés varios ejemplos. Creo que no hacía mucha falta sacarse esas animaciones, con hacer un mini movimiento como los backs de {{champion:122}} {{champion:55}} {{champion:75}}, a mi me hubiera parecido perfecto :/","replies":[]},{"poster":"SenpaiDeathx","date":"2017-03-09T13:15:18.718+0000","up_votes":1,"down_votes":0,"body":"ahhh pero el back en las skins con, con luces, rashos laser, mujerzuelas y gatitos !! xDD","replies":[{"poster":"XMasterLasheronX","date":"2017-03-09T18:38:38.264+0000","up_votes":1,"down_votes":0,"body":"#Y MAS GATITOS !!! >:3","replies":[]}]},{"poster":"Dyaebl","date":"2017-03-09T15:15:13.119+0000","up_votes":1,"down_votes":0,"body":"> cuesta Mucho Hacer Animaciones Personalizadas para cada champ\n\n↑","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-03-09T11:55:56.273+0000","up_votes":1,"down_votes":0,"body":"Se aviso que no se crearían nuevos backs (al menos ahora), y se reciclarían animaciones acorde al campeón.\n\n\nPersonalmente me dejo con bastante gusto a poco.","replies":[]},{"poster":"Mobius One","date":"2017-03-09T04:12:58.315+0000","up_votes":1,"down_votes":0,"body":"Generalmente son las animaciones de inactividad, cosa que nosotros (casi) nunca veíamos, por lo que le dieron otro uso. Aunque algunos tienen otra animación para el recall (como el baile o provocación) para mí es mejor eso antes de que se queden quietos... Aunque hay campeones como {{champion:77}}  o {{champion:20}} que necesitan rework visual entero, una animacioncita para el recall no basta para nada.","replies":[]}]}