{"poster":"XMasterLasheronX","date":"2017-03-29T02:51:58.209+0000","title":"Personajes de Otros Juegos en League of Legends | Ornstein El MataDragrones | Spoiler alert","subforum":"Creaciones de la comunidad","up_votes":6,"down_votes":2,"body":"#Ornstein El MataDragones \nhttps://i.ytimg.com/vi/Q3QwL0kJaRY/hqdefault.jpg\n#Historia\nOrnstein Formaba parte de los 4 Caballeros de Gwyn. un grupo de guerreros que fueron nombrados con tal Cargo gracias a sus tremendas Habilidades de combate. a Ornstein le acompa&ntilde;aba Gough Ojo de Halcon,Ciara la espada del Se&ntilde;or y por supuesto Artorias del Abismo. estos 4 caballeros fueron una pieza clave en la batalla contra los Dragones eternos Especialmente Ornstein el cual era un experimentado asesino de dragones. Gracias a Ornstein se consiguio una Importantisima Victoria que dejaria a los dioses como los seres mas Poderosos sobre la Faz de la tierra dejando a los dragones relegados a una existencia limitada a unos pocos con suerte y viendo como el Primogenito de Gwyn abandonaba a su padre para aliarse con los dragones Por una Causa desconocida. lo cual evidentemente enfurecio a su padre que lo Desterro y borrando su nombre y referencia de los anales de la historia tras esta victoria los dioses asentaron sus dominios en Anor Londo la Majestuosa ciudad desde la cual los dioses Gobernarian Toda la tierra que Ba&ntilde;ara la Luz y la cual enfundaba respeto a todo aquel a que se implemente a escuchar su nombre.\nAnor Londo fue una ciudad Prospera durante Muchisimos a&ntilde;os Hasta que finalmente la Amenaza de que la primera llama se estaba apagando hizo su aparicion. en este momento Los dioses Sintieron Miedo de Verdad sintieron que su Era se Acabara y que formaba parte de un ciclo natural cosa que Gwyn no estaba dispuesto a permitir lo cual partio al horno de la primera llama para buscar una solucion y asi perpetuar la era de la luz\ncon el paso del tiempo Gwyn No regresaba. La Llama seguia apagandose y la ciudad empezo a decaer ya que los dioses comenzaron a abandonar Anor Londo Poco a Poco Incluso la hija de Gwyn. Gwynevere Se fue acompa&ntilde;ada de su prometido Flann (&lt;--Wtf) Ornstein Por supuesto no iba a ser menos solo tenia miedo de lo que podia pasar si la llama se apagase si no que ademas tenia un sentimiento de Pena de Nostalgia hacia su antiguo Mentor. &iquest;que fue del hijo Mayor de Gwyn? &iquest;que habia sido de su Fiel Maestro? &iquest;Porque se habia aliado a los Dragones y traicionado a los de su especie? Ornstein no pudo contener el Impulso de Abandonar Anor Londo Dejando su Alma a Gwyndolin El unico dios que permaneceria en la ciudad Para que este tambien pueda crear una Ilusion de su cuerpo con ese alma y que de ese modo podria seguir Custodiando la Ciudad Sagrada Mientras estaba ausente. Ornstein Aprovecho la huida de Gwynevere para abandonar la ciudad Muy Posiblemente con ella. Ornstein sabia que los dioses tenian los dias contados. Pues Gwyn no solamente no pudo avivar la llama si no que callo derrotado por un no muerto Procedente del Refugio de los No Muertos. tras esto Ornstein siguio con su viaje el cual desconocemos cuanto tiempo pudo durar Pero se dice que su viaje fue demasiado largo ya que llego a las tierras de lothric. su camino le llego hasta el pico del ArchiDragon si su mentor se habia aliado a los dragones tiempo atras que mejor sitio que este para ir a buscarlo. unas ruinas en las cuales reciden Los Pocos Dragones y Wyverns supervivientes  a la masacre de Gwyn. Al Llegar aqui encontro lo que buscaba. alli estaba el Rey sin nombre. un guerrero anta&ntilde;o Poderosisimo y majestuoso Relegado ahora a una posici&oacute;n de exilio y soledad en unas ruinas alejadas de la civilizaci&oacute;n. Ornstein era conocedor de los rumores que abundaban de la existencia del camino del Dragon. una especie de ritual mediante el cual Los Mas aptos Podrian llegar a uno de esos enormes e inmortales seres. sus intenciones estaban claras. Encontrar a su mentor ya de Nada le servia el titulo de &#039;&#039;*Asesino de Dragones*&#039;&#039;  Pues nunca mas lo volveria a usar. se aliaria con su se&ntilde;or y lucharia Codo con codo con el para el resto de los Tiempos. Decidido esto Ornstein cumplio la senda del dragon y entrego su vida al rey sin nombre con su nuevo nombre y apariencia &#039;&#039;*El Rey de la Tormenta*&#039;&#039; \n#Habilidades \nEsta vez no habra habilidades porque soy un Flojo de Mier** \n#Pelea\n(Dato: recuerden que este no es el verdadero ornstein esta es su alma.. bueno Voy a dar un paseo con Gwynevere y Flann :v)\nhttps://www.youtube.com/watch?v=JjbtHwyTRdw","replies":[{"poster":"Kaminari1","date":"2017-03-29T10:48:03.312+0000","up_votes":1,"down_votes":0,"body":"Bola, ya te me pusiste en vago justo cuando le tocaba el turno a Ornstein hjajajaja Es una de las peleas que mas me costo cuando lo jugaba solo D:{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"XMasterLasheronX","date":"2017-03-29T16:36:15.873+0000","up_votes":1,"down_votes":0,"body":"te escribi la historia de Ornstein y su final. Basicamente me escribi la Biblia ahí xd\nque te parece que el proximo personaje sea la Bruja de Izalith ?\n(editado): No juegues solo xd siempre tendras a Solaire \nPD: Praise The Sun!!!11 {{item:3069}} ","replies":[{"poster":"Kaminari1","date":"2017-03-29T21:11:30.929+0000","up_votes":1,"down_votes":0,"body":"Es buena esa de la Bruja de Izalith ^^ \ny no saco a Solaire por que es re fruta jajaaj","replies":[{"poster":"XMasterLasheronX","date":"2017-04-03T23:28:00.046+0000","up_votes":1,"down_votes":0,"body":"que dices? si solaire es un tanke andante es como una mezcla de Zac,Garen,Darius y Trundle creo que lo nerfearon despues porque EL SOLO se podia hacer las Gargolas","replies":[{"poster":"Kaminari1","date":"2017-04-18T14:44:33.712+0000","up_votes":1,"down_votes":0,"body":"Decia que era una frutada por que es super op y le habian bajado el daño por que en la batalla de Orntein Y Smough se lo cargaba solito a cualquiera de los dos y eso que Ornstein tiene bastante defensa al relampago jaja","replies":[]}]}]}]}]},{"poster":"Ahegao best Drug","date":"2017-03-29T10:02:18.504+0000","up_votes":1,"down_votes":0,"body":"Desde mi punto de vista, basaron la skin de xin zhao matadragones en Ornstein.\n\nPreferiria tener a Artorias en el lol, dar saltos con un espadon y girar y tambien que la ulti haga una explocion de oscuridad y te potencie los stats durante un tiempo o que invoque a Sif.","replies":[{"poster":"rokushoger","date":"2017-03-29T13:18:16.815+0000","up_votes":1,"down_votes":0,"body":"Si pusieran a Artorias en lol y no invoca a Sif de alguna forma podría jugar que iría hasta norteamerica a cachetear a Tryndramere con mis propias manos.","replies":[{"poster":"XMasterLasheronX","date":"2017-04-03T23:29:02.091+0000","up_votes":1,"down_votes":0,"body":"Pero no tienes manos eres Main yasuo,riven y teemo \nRoku:ah verda' :v\nPD:es una broma no te lo tomes a mal Xd","replies":[{"poster":"rokushoger","date":"2017-04-04T10:57:51.048+0000","up_votes":1,"down_votes":0,"body":"No pasa nada hombre, no soy tan sensible XD\n\nAdemás, nada más lejos de la verdad, es decir, si llego a agarrar una riven seguro que piensan que soy un troll, que bicha que no puedo manejar ni de broma!\n\nEl que si me gusta de ahí es Teemo, pero estoy lejos de ser main de él.","replies":[]}]}]}]},{"poster":"XMasterLasheronX","date":"2017-03-29T03:29:17.842+0000","up_votes":1,"down_votes":0,"body":"Cual quieren que sea el proximo BOSS DE DARK SOULS PARA EL POST OOOOOUUUUU YEAH (▀̿Ĺ̯▀̿ ̿)","replies":[{"poster":"rokushoger","date":"2017-03-29T13:18:49.624+0000","up_votes":1,"down_votes":0,"body":"La bruja de izalith","replies":[]}]},{"poster":"Kyousuke","date":"2017-03-29T03:47:51.379+0000","up_votes":1,"down_votes":0,"body":"gwyndolin el sol oscuro!!!","replies":[]},{"poster":"CoronavirusC0V","date":"2017-03-29T02:56:30.278+0000","up_votes":1,"down_votes":0,"body":"supongo que pondras la embestida esa que te hace el joput4 y apenas logras esquivar como una skill no? {{item:3087}} ","replies":[]}]}