{"poster":"Euro4 Diesel","date":"2017-07-08T20:50:23.836+0000","title":"Excellence-Gaming sucht Jungler!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Tag liebe Community,\r\n\r\nmein Name ist Torben &quot;xTurbo&quot; und wir sind auf der Suche nach einem Jungler f&uuml;r unser Ranked-Team.\r\n\r\nErstmal was zu uns: Wir sind ein Community Clan der seit ungef&auml;hr 3 1/2 Jahre besteht, und wollen jetzt ein League of Legends Team gr&uuml;nden womit wir vielleicht in naher Zukunft an einigen Turniere teilnehmen wollen. Wir sind sehr Freundliche und Nette Leute die aber hin und wieder einen B&ouml;sen Spruch raushauen womit wir auch versuchen andere Zum ausrasten zu bekommen. Im Moment spielen wir alle in im SoloQ im bereich von Gold 1 - Platin 1 und spielen unsere Rollen schon ein paar tage L&auml;nger. Soviel erstmal zu uns.\r\n\r\nWelche Voraussetzungen solltet ihr erf&uuml;llen: \r\n\r\nNat&uuml;rlich solltet ihr Jungler Main sein und am Liebsten einen ausreichenden Champion Pool besitzen,\r\nihr solltet nicht Flamen und nicht das Ganze Team mit runter ziehen(nat&uuml;rlich hat jeder mal nen schlechten Tag aber nicht 24/7 :) ),\r\nEuer Rank sollte schon gerne Platin sein,\r\nTeamspeack und ein Ordentliches Mikro w&auml;re nicht schlecht,\r\nIhr solltet Abends in der Woche und am Wochenende Zeit finden f&uuml;r Training etc.(Steht noch nichts fest)\r\nWir w&uuml;rden es auch gerne sehen wenn ihr zumindest 18 seit.\r\n\r\nFalls ihr auf irgendeine weise Interesse habt k&ouml;nnt ihr mich gerne im Spiel unter dem Namen \r\n\r\nExG420 xTurbo Adden und mir einfach schreiben.\r\n\r\nIch w&uuml;nsche euch noch ein Sch&ouml;nen Tag \r\nMit freundlichen Gr&uuml;&szlig;en euer xTurbo :)\r\n\r\nPs. Falls der Text komisch zu lesen war und Fragen auftauchen Mich einfach anschreiben.","replies":[{"poster":"Dönersaurier","date":"2017-07-09T08:05:26.158+0000","up_votes":1,"down_votes":0,"body":"Bin zwar nur Gold 3, aber ein guter und ehrgeiziger Spieler =)","replies":[]}]}