{"poster":"GreenFox85","date":"2019-08-25T21:25:14.802+0000","title":"Impetus The Archemage","subforum":"Concepts & Creations","up_votes":0,"down_votes":0,"body":"Impetus is a champion I have had in my head for a while however I know it would take a lot of work to get right without being broken are too weak however it is a unique playstyle that isn't in league yet which it thinks a lot of players would enjoy playing a champ like this.\n\n(Story)\n\nBio: Impetus was an Archmage who taught people magic spreading it far and wide believing in the good it can be used in Magic while teaching them the dangers as well. Soon he started a college teaching many people about magic. However, this got some people to fear the college to get them to all hate it. Viewing the magic has evil, Demacia came believing them to be evil and slaughtered many taking the children into their town to raise away from magic. Impetus grew cold and begin to hate people, he had found purpose and they had destroyed it all of it. He swore vengeance on all who had slaughtered his people.\n\n(Stats)\n\nHealth: 515 - 1671  (+68 per level)\nHealth regen: 1.5 (+0.25 per level)\nMana: 200 - 769 mana (+33.5 per level)\nArmour: 30 - 70 (+2.35 per level)\nMagic resist: 25 - 50 (+1.5 per level)\nAttack damage: 32 - 45 (+0.75 per level)\nMovespeed: 315\n\n(Pros and cons)\n\nStrength: Versatility, able to adapt to the match has it progresses \nWeakness: Assassins, And people who can close in gaps easily and who can eat up cc.\n\nEarly game\nHigh Damage\nLow Versatility\nLow Mana\n\nMid Game\nMid Damage\nHigh Versatility\nDecent Mana\n\nLAte Game\nLow damage\nHigh team fight potential\nHigh Versatility\nHigh Mana\n\nPlayStyle: Mage\nLow Attack\nLow defense \nLow Magic Resistance\nLow Armor\nHigh Magic Attack\n\n(Abilities)\n\nPassive: SpellBook\nHAs a master of Spells when he is at his home tower He can alter his spells before going into battle. CHanging them to fit the match at hand however it replaces the current spell. When leveling instead of increase a spell's damage he learns new spells. (I.E. Level 1 he can learn fireball\nbut he cants switch it until level 2 by learning Earth spike. These are to help balance him out.)\n\nQ : Fireball / Zephyr /  Earth SPike / Water Wave \nCooldown 12 seconds           \n\n      Mana 60\n      Fireball         50 Damage + 75% AP Damage  Burst effect damage around target\n     \n      Mana 40 \n      Zephyr          25  Damage + 60% AP Damage Causes 25% Slow\n      \n      Mana 70\n      Earth Spike  35 Damage + 50% Ap Damage Roots for 1 second\n   \n     Mana 60\n     Water Wave 20 Damage + 20% Ap Damage Pulls enemy closer to self\n \nW: Flame Strike / Winds Blessing / EArth Wall / Water Burst\nCooldown 10 Seconds         \n\n    Mana 80\n    Flame Strike        50 + 50% Ap Damage goes forward in a line dealing damage to all it passes.\n   \n    100 Mana then 3% of mana to hold\n    Winds Blessing    Heal for 50 then 15% AP Per second\n\n    40 Mana\n    Earth Wall           Create a wall made of earth\n   \n   70 Mana\n    Water Burst      Burst water around you dealing 45 + 60% Ap Damage Knocking back all enemy around you a small distance.        \n\nE: Flame Sprint / Winds Whispers / Earthern Grasp / Waters Tide\nCooldown 18 Seconds\n\n     Mana  120 \n     Flame Sprint      Gain a burst of movement speed that is 50 + 25% of your Ap leaving a trail of fire that damages champions by 10 true damage\n     slowing them for 35% movement speed Lasts for 3 seconds\n\n     Mana  90 \n     Winds Whispers       Wend out a wave of wind forward knocking Impetus back and all enemies away deal 150 % 25% Damage.\n\n     Mana  150 \n     Earthern Grasp       Send out a chain made of earthen magic, Pulls enemies or Allies to you. Enemies take 50 + 25% Damage\n     Allies gain a shield by 75 + 20 % of Ap.\n  \n     Mana   75\n     Waters Tide     Shoot out a wave of water (Similiar to Kog Maw E) Speeds up allies by 25% Movement speed and slows enemies by 50% \n     Movement speed.\n\nR:   Elemental Armor / Elemental Blast / Elemental Blessing\n\n     Mana 250\n     Elemental Armor     Armor and Magic Resistance increase by 125% of your armor for the next 5 Seconds\n\n     Mana 250\n     Elemental Blase       Shoot out a large blast of elemental energy for the next 5 seconds it deals 200 + 75 % Ap Damage every second can now change direction but applies a 75% Slow to all enemies caught.\n\n     Mana 250\n     Elemental Blessing    Create a ring of energy for the next five seconds that heal all allies in the ring by 25% AP + 10% Missing ally health + 25% movement speed.\n\n\nAnd Feedback is appreciated","replies":[{"poster":"BlackKnightJack","date":"2019-08-26T03:08:53.899+0000","up_votes":1,"down_votes":0,"body":"...So he's Qiyana if she were an avid Runescape player?","replies":[{"poster":"GreenFox85","date":"2019-08-26T05:23:35.336+0000","up_votes":1,"down_votes":0,"body":"Not really the ideal is he has a spell for any situation while it might be strong at first he can switch depending but only once he backed, Qiyana has to be in certain terrain and only changes her Q from what i Know. While similar to her Q still I believe this champion would still have a unique feel to it. Probably Mid or SUpport. Though was a good joke bud &lt;3","replies":[]}]}]}