{"poster":"Best KhaZix Void","date":"2015-08-14T19:28:24.059+0000","title":"What if evolving Kha'Zix's ultimate turned it into a charge system?","subforum":"Gameplay","up_votes":94,"down_votes":7,"body":"where instead of activating it and having a limited amount of time to reactivate the next 2 stealths, the ultimate was like Akali ult, he&#039;s able to cast 1 whenever and he gains another charge after a certain amount of time? It&#039;d give a little more incentive to evolve it for players looking to up their mobility and kind of increasing his long term assassination potential, since your opportunity for burst is a lot more circumstantial than most other assassins.","replies":[{"poster":"RiotRepertoir","date":"2015-08-15T02:31:16.720+0000","up_votes":32,"down_votes":0,"body":"This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n\nIs someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.","replies":[{"poster":"BakedLotion","date":"2015-08-15T02:36:42.113+0000","up_votes":17,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a,timestamp=2015-08-15T02:31:16.720+0000)\n>\n> This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n> \n> Is someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.\n\nHis R is usually evolved last, or not evolved at all. It's between W and R since both of them are actually insanely weak right now. \nRight now, it's Q or E first and then the one you didn't choose gets evolved second. \nEvolving his R gives almost nothing.","replies":[{"poster":"I Main Swain","date":"2015-08-15T14:48:22.338+0000","up_votes":3,"down_votes":0,"body":"they should make it so additional spikes just deal half damage to the same target, or have the heal apply from a distance when you evolve.","replies":[]}]},{"poster":"Kitsuki05","date":"2015-08-15T03:34:59.960+0000","up_votes":14,"down_votes":0,"body":"Instead of just making his evolved R \"using stealth multiple times oooo~\", I think it should turn the skill into something more dynamic. It would be a lot more interesting to see khazix's evolved R make him \"phase\" in and out of stealth fluidly for the duration, like how Akali functions with her shroud. Any time he uses a skill or attacks, he's shortly revealed, but quickly disappears once more. Every evolution should change an aspect of Kha's playstyle, and the evolved stealth mechanic should do no less.","replies":[{"poster":"Kuroi86","date":"2015-08-15T06:22:32.819+0000","up_votes":2,"down_votes":0,"body":"I kinda like that idea.\nEvolving different skills in different orders changing his combat style in various ways.\nQ being a more up front fighter, W being more sustain oriented combat, E being more mobile hit and run style and R being more about slipping between enemies and picking them off.","replies":[]},{"poster":"LeeDark","date":"2015-08-15T18:05:17.955+0000","up_votes":3,"down_votes":3,"body":"This largely lacks counterplay beyond \"buy a pink.\"  With Akali, at least you know she is limited to the circle that represents her shroud.  Kha'zix would have more freedom, allowing him to strike without retaliation.  PERHAPS with a mechanic that gives him a short fade time that is delayed further by damage, but given how short the duration of the stealth would have to be to make this balanced, that would pretty much defeat the purpose.","replies":[{"poster":"Kitsuki05","date":"2015-08-15T21:15:35.090+0000","up_votes":3,"down_votes":4,"body":"1. ward further away so you see him before he stealths\n2. aoe burst in his general vicinity\n3. single target CC as soon as he appears\n4. running away faster than him for the one second duration that his stealth lasts\n\nthis suggestion is no less uncounterable than the current iteration of his ultimate unevolved.","replies":[{"poster":"LeeDark","date":"2015-08-15T21:21:38.209+0000","up_votes":3,"down_votes":3,"body":"No, because if he reenters stealth automatically, then you can stun him and get nothing out of it because he goes back into stealth.  Unless damage or CC delays the stealth fade, in which case there is no point to the buff because the duration of his stealth has to be short, so the delay would use up any stealth time he has left.\n\nFurthermore, taking away control of the ability is not the way to make Kha'zix a more well-balanced champion.","replies":[{"poster":"Kitsuki05","date":"2015-08-15T22:01:28.500+0000","up_votes":3,"down_votes":1,"body":"You still have to choose when to activate the stealth, so no loss of control in any way. Also what you get out of stunning him is you counter his ultimate. He effectively does nothing for the duration of his ability, plus anyone who's been paying any attention could follow up on him because he'll be standing in the same spot.","replies":[]}]}]}]}]},{"poster":"Luthor Harkon","date":"2015-08-15T03:06:41.060+0000","up_votes":9,"down_votes":0,"body":"Currently Kha'Zix role is an assassin that evolves based on the situation that he is currently facing. However his only realistic options are Q or E for obvious reasons like giving him dueling potential, clean up, or for snowballing a lead. However W evolve just increases the already weak slow to a barely noticeable 50% which is barely worth the mana to use unless you need to fill a poke role in which there are better champions for that job. So we have already established that his W evolution is a tad bit lack luster now let's move onto his ultimate evolution. The biggest perk to this evolution is that you basically change colors. Sure a third stealth is nice for an additional second which is nice resulting in a over all 6 seconds of stealth which sounds strong on paper. However due to a previous nerfs to his ultimate evolution back when it gave 50% damage reduction was to increase the stealth delay. Since then the damage reduction has been removed from his ultimate, but it did not receive another incentive to ever evolve it. So now we are left with 2 strong evolution choices, a meh one, and a below average color change. Now if charges were added to the evolution of his ultimate or ultimate in general it would be a welcomed change for kha'zix players. Currently his ult is all or nothing either you use all charges at once or you essentially waste them. Adding charges to this would allow for more diversity in your options allowing for more juking and maneuverability. It would truly add a whole new depth to kha'zix evolution options based on how the player wants to go about the different stages of the game they are in. \n\nTLDR: Kha'Zix essentially has two evolution options with other added little buffs to the other evolved  abilities. This change would actually change how the ability functions which is essentially what his evolution should do, they should evolve how he plays the game.","replies":[{"poster":"Crowe Stalker","date":"2015-08-15T03:32:17.749+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Boomblahbla,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a0005,timestamp=2015-08-15T03:06:41.060+0000)\n>\n> The biggest perk to this evolution is that you basically change colors.\n\nAt first I was going to upvote just for this (I personally believe Mecha Kha'zix was wrong, he'd totally be a Battlecast and _to hell with anyone that thinks otherwise!_) but then I actually read your arguments and am upvoting all of it.","replies":[{"poster":"RUNAAANS HYDRAA","date":"2015-08-16T01:29:39.154+0000","up_votes":2,"down_votes":0,"body":"That's the ONLY reason I ever want to evolve R, so that he can join the rest of his Void-brethren in The Glorious Evolution.","replies":[]},{"poster":"Luthor Harkon","date":"2015-08-15T05:28:45.360+0000","up_votes":2,"down_votes":0,"body":"The true mvp","replies":[]}]}]},{"poster":"Auroramancer","date":"2015-08-15T12:56:07.147+0000","up_votes":7,"down_votes":0,"body":"Hey Repertoir, thanks for posting in a thread about this.\n\nHere are my thoughts/answers to your questions:\n1.) I feel that Kha'zix's evolution order is dependent on the compositions of both teams, as well as what role he is filling. \n\n**From a role standpoint**: I don't like playing Assassins because I struggle with the Assassin playstyle; I'm much more comfortable playing Fighters. That said, Kha'zix's R evolution helps me emulate the Fighter style with him in top lane (by means of skirmishing and giving me a lot of all-in strength), and I can stand toe-to-toe against Fighters through early-mid game. His R evolution is a very viable option against Fighters, though sometimes I'll evolve Q first against Fighter players that are very aggressive and leave their minions often. \n\n**From a team composition standpoint**: If I'm jungling Kha'zix, my first evolution will be very dependent on how easy ganks will be to pull off. If my team is frequently pushing hard (thus, there will be small windows of time to kill the enemy laner without using hard Crowd Control), then I'll evolve my R so that I can proc my passive's slow a lot during the gank and so I'll have a longer duration stealth to close the gap for the gank's surprise factor. If ganking will be easy (if my teammates let themselves be pushed in or have hard Crowd Control), I'll evolve E just to get in there right away and start dealing damage to secure a kill. \n\n2.) Is his R evolution worthless? **In my personal opinion, no**. In the opinions of many other players, yes. \n\nAgain, because I love the Fighter playstyle, Kha'zix's R evolution is my favorite, because it allows me to skirmish with my target. And being successful with R evolution is mentally rewarding. I didn't just kill my opponent because they stuck around too long @ low HP and I was able to Wing-jump in for some burst damage (playing off your opponent's lack of skill/perception); I was able to kill them through skillful movements while stealthed, making frequent use of my passive's slow and bonus damage, and dodging my target's retaliation with the use of the stealth duration. \n\nI think R evolution is less valuable to those who want to play Kha'Zix as an assassin, and more valuable to those who want to play Kha'Zix as a Fighter or a split-pushing duelist. \n\n3.) Some things I think would be good/bad on the charge system for his ult. \nThe Good:\n-There are cases where Kha'Zix often just needs to use one charge of stealth to dodge around an incoming gank or enemy retaliation, but then the enemies back off and there is no need to use the second or third charge. That feels bad. The charge system would fix this.\n-It will give Kha'Zix players more versatility in how they use it. Know you won't need to use your ult for awhile? Use it for the movement speed to get back to lane faster, or between jungle camps. And if you just need one charge for a gank, then you can use the other charge(s) later for another gank. There are other possibilities.\n\nThe Bad:\n-Counterplay against Kha'Zix will be harder. Cross-lane communications of \"Kha'Zix ult down\" will no longer be valid. You can no longer have the safety of knowing his ultimate is on cooldown. Which brings me to another point.\n-The charge system will increase Kha'Zix's perceived threat. Because it's likely that he'll always have a charge available, who will want to engage him? Players will be less brazen against him, and it will make it harder for Kha'Zix players to actually pull off successful ganks/skirmishes. \n\nI'm not sure whether the charge system or his currently evolved ultimate would be better. On the charge system, would the cooldown between consecutive uses be increased? Would the mana cost just be greatly reduced per charge consumption, or would it be free? Or would it stay the same O_O? What playstyle does the charge system cater to more?\n\nWhatever the ramifications of the charge system would be, I'm definitely comfortable with where it is at. I like that it helps me play him like a Fighter, and I wouldn't want that to be taken away.","replies":[]},{"poster":"lightdragoon88","date":"2015-08-15T03:12:26.808+0000","up_votes":8,"down_votes":1,"body":"Honestly comparing Kha'zix ult to Rengar ult....Kha'zix is really lackluster.\n\nI actually get more excited to evolve his QWE over actually getting his ult.","replies":[]},{"poster":"Kouga","date":"2015-08-15T11:45:53.415+0000","up_votes":6,"down_votes":0,"body":"As a former regular jungle bug:\n\nWell, first off, I always felt like Khaz didn't (for me) deliver on the \"adaptive evolving bug\" fantasy as strong as he could have because every game will end with 3 out of 4 evolutions (only 4 of 4 if they have a particularly stupid rengar). But that just means that whatever evolution is \"weakest\" doesn't get picked. That, in turn, means that every Kha'Zix game ends the same. What I wish they would have done was allow you to evolve them *up to three times* **each**. So you could, for example, evolve E-Leap 0-3 times, gaining increasing range each time (and maybe getting a special \"effect\" if you put all 3 in one). But then you'd have drastically different bugs. Need gank potential? Rank E. Need raw damage? Rank Q. Need durability? Rank W. Need stealth (for safety or for ganks)? Rank R. Then you would have a bug that could actually adapt to different games.\n\nBut I digress.\n\nAs for his current R - it would definitely make it feel much better to have a Charge system for it. There are times when I only *need* to use his R once. Maybe I'm escaping, and I use it to juke - enter bush, stealth in a different direction, by the time they notice I'm already gone. Or, I'm using it to catch up to/proc my passive on a fleeing enemy. I don't always need that many uses. So having it on a charge system would let me feel like I can use it in less dramatic situations. I could use it every time I go into gank, because I know I'll have more charges by the time I gank again. Rather than, \"Can I gank with just my E here, or do I need to blow my ult?\"\n\nI do think it would make him stronger, without a doubt, but I don't think he's in such a strong place that it'd be a big issue.\n\nFor me it'd just be a straight up buff, but it wouldn't impact my evolution choices because I never rank W. Why does anyone rank W? You don't gain any healing, a target can only take damage from 1 spike. Sure you can slow multiple targets but Kha'Zix is not a multi-target hunter. He is a solo target assassin, and if I'm going for 1 person, I should just be good enough with a skill shot to land my W as is. Stupid evolution.","replies":[]},{"poster":"Best KhaZix Void","date":"2015-08-15T12:14:22.478+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a,timestamp=2015-08-15T02:31:16.720+0000)\n>\n> This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n> \n> Is someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.\n\nEvolving R feels worthless simply because of how vision works in season 4/5, it doesn't give you something dramatic like the conical skillshot spread of his evolved W, the huge damage of his Q, or the reset of his E, the damage reduction on his ult is what pushed it to be the 3rd, and even the first evolution when it was on the ult. He was overbearing and got nerfed for good reason, but, correct me if i'm wrong,  I think that left riot afraid to buff his ult out of the fear of the monster that once was.\nThe problem right now, is that when you evolve your ult, what are you really getting against smart players? The sweeper trinket is all you need to counter his ult, and if multiple people get it, along with pink wards, it's almost completely useless as an evolution, given you're forced to use all 3 charges within that narrow window, one which could be completely blocked out by the enemy vision game. Why would you give up  a point on something so easily countered when you could have the AOE 50% slow that's almost as wide as a lane?","replies":[{"poster":"RiotRepertoir","date":"2015-08-16T06:37:08.354+0000","up_votes":5,"down_votes":0,"body":"Really appreciate all the conversation in this thread, everyone. From what I've read here, it seems that R evolution pretty unanimously feels underwhelming, but people occasionally evolve it over W. Not sure if/when we might get a chance to put some work into evaluating Kha'Zix evolutions again (with season coming to an end and all), but if we do get that chance, I feel like I at least have some really good starting points to reference. Thanks a bunch!","replies":[{"poster":"Best KhaZix Void","date":"2015-08-16T18:57:33.576+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a001a0000,timestamp=2015-08-16T06:37:08.354+0000)\n>\n> Really appreciate all the conversation in this thread, everyone. From what I've read here, it seems that R evolution pretty unanimously feels underwhelming, but people occasionally evolve it over W. Not sure if/when we might get a chance to put some work into evaluating Kha'Zix evolutions again (with season coming to an end and all), but if we do get that chance, I feel like I at least have some really good starting points to reference. Thanks a bunch!\n\nI appreciate the attention repertoir, sacrificing your time for a lowly bug main like myself,\nKeep us updated if you can, I'd love to hear insight on any changes should they hit the PBE.","replies":[]},{"poster":"Dies to Wolves","date":"2015-08-17T04:11:51.255+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a001a0000,timestamp=2015-08-16T06:37:08.354+0000)\n>\n> Really appreciate all the conversation in this thread, everyone. From what I've read here, it seems that R evolution pretty unanimously feels underwhelming, but people occasionally evolve it over W. Not sure if/when we might get a chance to put some work into evaluating Kha'Zix evolutions again (with season coming to an end and all), but if we do get that chance, I feel like I at least have some really good starting points to reference. Thanks a bunch!\n\ni'd like to add, I feel W evo is usually stronger, but I prefer R evo just because it's way more fun (his W is boooooooooooring), so I just go R anyways.","replies":[]}]}]},{"poster":"Márksmán","date":"2015-08-15T03:04:11.568+0000","up_votes":5,"down_votes":0,"body":"Just wanted to give my 2 sense as a exclusive kha/rengar (plat elo) player. But i feel ult is usless to evolve in every situation. q and e are just way to good to not evolve. and unless your outlandishly fed and go triforce, most people go cleaver for 20 perc cdr and HUGE armor shred with the w aoe, i mean like isnane shred and poke to easily get resets","replies":[]},{"poster":"Teridax68","date":"2015-08-15T03:34:41.243+0000","up_votes":5,"down_votes":1,"body":"Have you considered giving his evolutions a structure similar to the one on {{champion:112}}? As in, each rank would let him evolve a basic ability (and a basic ability only) and upgrading all three would automatically evolve his ultimate. The reason why his evolution order gets jumbled so much with each tweak, and one of the issues with his evolutions, is that so far there's inevitably this one evolution that just gets consistently left out once people figure out which ones are the best (and I imagine it must be a pain to balance each evolution around each other). I'm not too big a fan of having Kha's evolved R turn into a charge system, but I do think he needs to have all four evolutions unlock over the course of a single game, as I think it would likely make his evolutions a lot less trouble to handle. Evolved R is the least popular one right now simply because it just doesn't do as much as the others, and if Kha were allowed to just pick it along with the rest he might not even need a buff to that evolution.","replies":[{"poster":"Kitsuki05","date":"2015-08-15T03:43:23.569+0000","up_votes":6,"down_votes":1,"body":"While it might not exactly be currently implemented, the whole point to limiting the number of Kha'zix's evolutions was that they're supposed to significantly alter his gameplay. He \"evolves\" to meet the challenge he is currently faced with. But when some of them are lack luster, he becomes the same two upgrades every game. The power in his evolutions should come at the opportunity cost of not gaining the others.\n\nMeanwhile, Viktor is supposed to be \"advancing\" his upgrades just improve on what the skills already do, so it'd make sense that he should eventually get all of the upgrades.","replies":[{"poster":"Teridax68","date":"2015-08-15T04:00:59.061+0000","up_votes":3,"down_votes":0,"body":"Viktor's passive is the Glorious Evolution, and I imagine Kha would also want to evolve into the ultimate predator, so they do share a theme that extends beyond their evolution point system.\n\nThe issue I take with Kha's current system is that his evolutions are forced to be equally powerful relative to each other, which is an extremely tricky, if not impossible, balancing act that places unnecessarily strict demands on their design and has thus far invariably led to a mini-meta in which an evolution always gets left out, which in turn led to a set of changes that simply set a different order and so on. By contrast, Viktor can afford to have augmentations that vary wildly in power (upgraded E is by far the best in most cases, and the augment to R isn't too spectacular) and still be in a good spot even if people tend to follow a single upgrade path. Allowing Kha to get all four evolutions would likely not affect his evolution order too much, since his evolved R gets left out anyway, and so would still let him adapt to the situation while not having to end up with the same ability left out. There's also perhaps an issue with Kha's evolutions varying a bit too much in popularity depending on their situationality (Q completely dropped out in popularity when his isolation mechanic got nerfed, for example), but that's something a full complement of evolutions would likely help stabilize as well, as Kha could afford to pick a risky evolution at an opportune time and still be able to fill out on more consistent options later on.","replies":[{"poster":"Kitsuki05","date":"2015-08-15T04:05:02.879+0000","up_votes":3,"down_votes":0,"body":"The different evolutions don't even have to be equally balanced _so long as their effects alter his gameplay differently to a significant degree_ for example if, for some reason, Kha'zix didn't need multiple longer ranged jumps in a game, there would be no point in taking that evolution over others that improve his non-mobility-related combat. The problem is that Kha'zix just doesn't really live up to that expectation. He came out before Riot really refined the whole idea of skills upgrading and evolving, and he hasn't really been readdressed.","replies":[{"poster":"LeeDark","date":"2015-08-15T18:25:05.660+0000","up_votes":2,"down_votes":1,"body":"The thing is he will always need longer jumps.  The Leap evolution is the only truly successful one in his kit.  It has held its usefulness throughout because of its utility.  Q and W are both entirely damage oriented, so whichever one does more damage is going to be the most important.  And R used to have utility, but it had way too much utility, and instead of just nerfing it, they removed that utility entirely, making it mostly useless.\n\nViktor actually suffers from the same problem, though on a much smaller scale.  He is guaranteed to get all his upgrades if the game goes on long enough, so the order is all that matters to him.  Still, since he only has ONE damage upgrade in his evolutions, is it any surprise that it is the first upgrade purchased almost ALL the time?\n\nIf all four evolutions were purely utility, then there would be a serious questions about which you need in any given game.  The charge system suggested by the OP is a purely utility upgrade.  If you keep two charges, but the only thing that changes is how you can spread them out, it becomes a serious contender against Leap as a ganking tool.  One helps you avoid wards by going over walls, the other gives you an potential escape mechanism or a little more damage from your passive.","replies":[]}]},{"poster":"ChaoticPinecone","date":"2015-08-15T05:10:43.779+0000","up_votes":2,"down_votes":0,"body":"Thematically, i love how Kha is - he only evolves into the ultimate predator if he kills Rengar. \n\nThe problem i have with Viktor is that his evolution choices are nice, but completely unnecessary. Not in terms of power, as they give him a lot of his damage, but in order. You can take away the choice from the player, automatically giving the first upgrade to his hexcore to his E, second to Q, and third to W/R and make practically no change to his play.\n\nAt least Kha can get some choices. He can choose the waveclear with his W, isolated damge with Q, resets with E, or elusiveness with R. And theres a true choice to it - if youre stomping lanes with your ganks, you can upgrade the Q damage. If youre skirmishing really early (or dont have many opportunities for isolation), you can upgrade the E. Or if you choose to AFK farm, you can upgrade the W.","replies":[]}]}]},{"poster":"Mistress Madoka","date":"2015-08-15T14:41:11.452+0000","up_votes":1,"down_votes":2,"body":"He can get all 4 Evolutions, though.\n\nAs long as there's a Rengar on the enemy team","replies":[{"poster":"Crowe Stalker","date":"2015-08-15T21:34:47.414+0000","up_votes":2,"down_votes":0,"body":"That's really not that common honestly.","replies":[]}]}]},{"poster":"Variks the Loyal","date":"2015-08-15T03:21:58.239+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a,timestamp=2015-08-15T02:31:16.720+0000)\n>\n> This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n> \n> Is someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.\n\nLeveling R isn't necessarily worthless. I level it instead of W sometimes.\n\nI think the issue is that his evolved Q and E simply have too much power. The utility of E and the damage of Q make them absolute MUST evolves.\n\nIf his evolved Q and E were reworked, then Kha'Zix could be more of a 'versatility assassin' who can fit most situations through his evolutions. I don't know what to change about them, but I have a few ideas.\n\nI think his E should always be able to reset, baseline, unevolved. And then, reduce/remove the AoE damage, and regrant it upon evolution. Or something.\n\nAs for Q... Well, not sure. The increased range is pretty cool. Maybe something related to his passive? Maybe evolving Q could increase the slow from Unseen Threat? Or convert it to physical damage?","replies":[{"poster":"Crowe Stalker","date":"2015-08-15T03:40:45.303+0000","up_votes":1,"down_votes":0,"body":"Maybe his evolved Leap could also remove the Landing Delay? There's currently a delay when landing from your Leap before you can do anything (.25 seconds unevolved, .5 when evolved) which is almost like a built in stun for jumping in. Leap's AoE Damage could be reduced to 150 units and then upped to 300 units when evolved.\n\nMaking his Q give an AD scaling on his Unseen Threat passive would be pretty nice.","replies":[{"poster":"Variks the Loyal","date":"2015-08-15T21:36:39.576+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kuronan,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a00080000,timestamp=2015-08-15T03:40:45.303+0000)\n>\n> Maybe his evolved Leap could also remove the Landing Delay? There's currently a delay when landing from your Leap before you can do anything (.25 seconds unevolved, .5 when evolved) which is almost like a built in stun for jumping in. Leap's AoE Damage could be reduced to 150 units and then upped to 300 units when evolved.\n> \n> Making his Q give an AD scaling on his Unseen Threat passive would be pretty nice.\n\nI also think making Evolved Leap do bonus damage to minions and monsters would be effective. Using it, plus Tiamat/Hydra in the air would clear out a wave of minions or a weakened camp, thus isolating any nearby enemy champions.","replies":[]},{"poster":"LeeDark","date":"2015-08-15T18:09:04.352+0000","up_votes":1,"down_votes":0,"body":"That delay was purposely added because Leap > Void Spikes > Hydra was a ridiculous combo that had almost no counterplay because he was in the air and very hard to target, completing the combo and landing all the damage where he would land on you before before you could respond.","replies":[{"poster":"windwolf777","date":"2015-08-16T19:33:06.209+0000","up_votes":1,"down_votes":0,"body":"But I have a question, was that nerf before or after they made turrets count as allies for isolation and made the isolation area bigger?","replies":[]}]}]}]},{"poster":"CoolKnightST","date":"2015-08-16T13:46:29.923+0000","up_votes":2,"down_votes":0,"body":"I actualy think the charge system for ult would help him a lot while building full damage. It would make him more healthy in my opinion. I would suggest something like this:\n\n* Charge system based on rank (I = 1 charge, II = 2 charges, III = 3 charges)\n* Evolving R now increase the speed buff massively","replies":[{"poster":"Best KhaZix Void","date":"2015-08-16T18:47:56.297+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CoolKnightST,realm=EUW,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a0025,timestamp=2015-08-16T13:46:29.923+0000)\n>\n> I actualy think the charge system for ult would help him a lot while building full damage. It would make him more healthy in my opinion. I would suggest something like this:\n> \n> * Charge system based on rank (I = 1 charge, II = 2 charges, III = 3 charges)\n> * Evolving R now increase the speed buff massively\n\nI really like this idea too, sounds amazing.","replies":[]}]},{"poster":"Glitter Spitter","date":"2015-08-15T13:45:34.605+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a,timestamp=2015-08-15T02:31:16.720+0000)\n>\n> This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n> \n> Is someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.\n\nI only evolve my R in some normal matches because it looks badass, then i think to myself damn i wish i didnt waste a power spike for a visual buff :/","replies":[]},{"poster":"HadesBlades","date":"2015-08-15T03:04:15.172+0000","up_votes":3,"down_votes":0,"body":"I don't play Kha'zix much if at all but I do know the mechanics and the feel of him when i have played him. When jungling as him I always value leveling my Q and E first so my ganks are secure and my clear faster. When it comes to W and R I usually just like to level W because it gives more sustain and its an AOE ability that can do damage while also healing me in combat. R just feels so useless to level. The stealth and movement speed are nice that he gets from his R, but it is just so easy to pink or use a red trinket that there is no use to level R. His R really brings more of a disengage when I use it, so it doesn't really feel oppressive when fighting, unlike akali who dashes 3 times+ if she gets a kill or assist. \n\nHaving a charge system would give him more of a dynamic play that allows him to maybe disengage and engage if he times them correctly and knows how to imply when to use it. In all honesty this doesn't seem to game breaking or a power shift to him in the jungle. His current state I would say is fair, but also on the weak side. This tweak I think will add on a interesting play style for the few Kha'zix mains that are left","replies":[]},{"poster":"Meeks011","date":"2015-08-16T07:08:24.535+0000","up_votes":2,"down_votes":0,"body":"His R doesn't really give anything. 2 seconds of stealth with a bit of movement speed on an 80 seconds cooldown. It really isn't worth the 100 mana. The evolve points are really the only reason to max it. If you didn't get evolve points then it would pretty much be a waste to put points into it.","replies":[]},{"poster":"RUNAAANS HYDRAA","date":"2015-08-16T01:26:14.775+0000","up_votes":2,"down_votes":0,"body":"Evolving R feels completely worthless at the moment. With the new HUD I've _accidentally_ evolved R a couple times now. It'd be nice if you could pick your evolution while dead.","replies":[]},{"poster":"Profirix","date":"2015-08-15T21:52:49.203+0000","up_votes":2,"down_votes":0,"body":"Removing the damage reduction on the evolved R without providing some form of compensation absolutely destroyed the reason to ever evolve it.  An extra second of stealth per cast and an additional cast?  Definitely not as valuable as a reset-able leap or a massive boost to isolation damage or even an increased slow.\n\nHis R for sure needs some kind of change to give players a reason to evolve it; not necessarily by increasing its damage potential, but by offering some other mechanic to improve some aspect of Kha'zix that might be more beneficial than the other upgrades in certain situations.  Similarly, his W does not offer enough of a reason to upgrade it over say Q or E.","replies":[]},{"poster":"LeeDark","date":"2015-08-15T17:59:56.103+0000","up_votes":2,"down_votes":0,"body":"How would it be dangerous?  Let's assume, for the moment, that nothing else changes.  His ult still has the same cooldown, still stealths for the same duration, etc.  WORST case scenario, he gets ONE stealth every third cooldown, essentially cutting the cooldown of his non-evolved ult, but also essentially cutting the number of times he could stealth consecutively in half.  If he uses up more consecutively, he is essentially increasing the cooldown of his ult.  This is only dangerous if he is a viable initiator (which he really isn't, currently) since he would be able to use a single stealth to initiate and only use the second in dire circumstances, allowing him to initiate once every 30 seconds or so.\n\nAnd that is assuming NOTHING else changes.  The OP seems to indicate that this charge system would replace the current 3 uses by making the \"2 consecutive use\" ult into a \"2 use whenever you want\" ult.  If this is the case, he gets ONE chance to stealth in as an initiation.  If it fails and he has to stealth out, he is stuck with the full cooldown of the ult.  If he is successful, he gets to save a stealth usage to capitalize later, OR is allowed to initiate again later and have an available escape.\n\nThis promotes a risk/reward style of gameplay, something Kha'zix has always had.  Do you use to the second charge for safety and get less reward because of that, or do you hold it as long as possible to get the most efficiency out of your ult?  Currently, you HAVE to use the stealth charges or else lose them.  The only risk and reward calculation is whether or not to stealth and stay or stealth and leave.\n\nThis change would also make the R evolution more valuable.  The inherent value of the charge system is that you can get more uses out of the ult in the long run, so this is devalued by evolving R last.  The sooner you evolve to the charge system, the more efficient your ult becomes.  Evolving it first for more constant map pressure in the early and midgame could actually become a viable strategy.  At level 6, evolved R could have an effective cooldown of 50 seconds, allowing you strong ganks once a minute.  ","replies":[]},{"poster":"Woodsy2575","date":"2015-08-15T11:35:21.000+0000","up_votes":2,"down_votes":0,"body":"As a Kha'Zix main from back when I started in season 3 and fell in love with him as a champion, I makes me really sad to see him in the state that he's been nerfed to. The jungle and tank changes were just the nail in the coffin after the long string of nerfs he got hit with in season 4. \n\nHis ult evolution is clearly the worst when compared against the rest of the options, as it provides far less in the way of utility. What was problematic about it before was that it provided some tank stats on activation, but that was too strong and he dominated the meta at the time. Maybe if it provided more on on activation in addition to the third use, like maybe a higher speed boost so he can slip in and out of the fight while still doing his job, but still being squishy enough to prioritize when he unstealths.","replies":[]},{"poster":"Taste Your Fear","date":"2015-08-15T09:25:55.899+0000","up_votes":2,"down_votes":0,"body":"Evolving R is useless in almost every situation. The evolved W isnt that good too. Q/E are a must to evolve. I think that his evolved W should have 2 seconds less cooldown, or reduced cooldown based on how many enemies are hit. His evolved R would be way better too if it had charges.","replies":[]},{"poster":"RottedApples","date":"2015-08-15T03:33:46.620+0000","up_votes":2,"down_votes":0,"body":"Q should be evolved first in pretty much every situation, the damage boost is too big to not evolve it first, unless you are in like an aram or something and need mad hops to get in and get out. \n\nLeap is the next most important (although it is my personal favorite) because the range and reset is huge for you.\n\nThen spikes/ult are basically a toss up, I'd go for spikes in nearly all cases but if fights are kinda hairy a 3rd ult charge can be more useful.\n\nI don't think this ult change would change how I evolve. A charge system would be nice early on though so you can gank lanes non stop every time you get an ult charge but if I'm going to evolve it first I miss out on way too much in q and e and by the time i would get it otherwise we would be in teamfighting stage so it may not be super useful outside of picks, unless teamfights are happening super often and I always need a charge up.\n\nI used to play kha more a long time ago but I haven't touched him in quite a while so this is just my 2 cents.","replies":[]},{"poster":"Nutty","date":"2015-08-15T08:04:37.598+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yBOFTuRx,comment-id=000a,timestamp=2015-08-15T02:31:16.720+0000)\n>\n> This seems really cool, but pretty dangerous too simply given how much power that is. Of course, tuning could be adjusted as needed, and Kha'Zix isn't really the powerhouse currently that he's been in the past, so maybe that's not even such a big deal. I can definitely see why it's a compelling idea, but I wonder if moving toward a charge direction would have similar snowball problems as Akali R. That said, you're not suggesting more charges on kill/assist, and maybe that's where most of Akali's R abuse cases have historically come from. But yeah, really interesting...\n> \n> Is someone could enlighten me as a non-Kha'Zix main, would this dramatically change the dynamic of how he evolves his skills? Does evolving R feel worthless at the moment? One of the issues I know has always existed on Kha'Zix is that the strengths of his evolutions, and thus the order in which players might rank them, can get jumbled around quite a bit whenever they're tweaked.\n\nD1 khazix only player. honestly his W just needs to not be worthless... Increase damage / lower cooldown and kha would be perfect. Please dont over buff him to where he is banned.","replies":[]},{"poster":"Xyren5","date":"2015-08-15T02:55:17.431+0000","up_votes":2,"down_votes":1,"body":"I only play a little Kha'Zix but honestly I don't think much would change. E and Q evolution are an absolute **must have** and W provides a lot of utility and AOE damage which is useful in those post level 16 fights. I think if his ult evolution doesn't provide any significant combat effectiveness or incredible utility then it will still be avoided.","replies":[]}]},{"poster":"Prospector Pete","date":"2015-08-14T21:56:22.779+0000","up_votes":6,"down_votes":0,"body":"That would be really awesome! Even bugs need love <3 {{champion:121}}","replies":[]},{"poster":"idoki","date":"2015-08-14T20:15:09.674+0000","up_votes":3,"down_votes":12,"body":"That would make the ability OP.\nThe whole point of forcing you to sacrifice all of your charges at once is to limit the ability by an actual cooldown. Removing that cooldown and changing it into an ammo system tremendously increases the ability's versatility and removes any kind of risk-reward values that the ability had, which doesn't make any sense since high risk - high reward is what defines assassins.","replies":[{"poster":"HighH1","date":"2015-08-14T20:37:22.724+0000","up_votes":9,"down_votes":1,"body":"'high risk - high reward is what defines assassins'\n{{champion:92}}  {{champion:238}} {{champion:157}} {{champion:7}}{{champion:84}}  It's so risky they can dive into a team or turret but get out because of how much mobility they have","replies":[]}]}]}