{"poster":"pen1sforthewin","date":"2016-05-30T10:16:56.555+0000","title":"Ist das fair eingestuft?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Hallo erstmal. Ich habe eine Frage, findet ihr es fair das ich mit 8 von 10 gewonnen Spielen in Silber VI komme? Ich war die Saison davor also S5 Silber 4 und hatte in diesen Einstufungsspielen deutlich weniger gewonnen :/ Ich hoffe ihr k&ouml;nnt verstehen was mich bedr&uuml;ckt ..{{sticker:zombie-brand-clap}}","replies":[{"poster":"NoTeamFound","date":"2016-05-30T10:28:13.628+0000","up_votes":2,"down_votes":0,"body":"schätz dich glücklich, ich wurde mit 8w, 2l, in bronze 1 eingestuft. aber egal hab mich dadurch saumässig verbessert und bin jetzt in platin angekommen. Road to dia inc!","replies":[]},{"poster":"Megamaexx","date":"2016-05-30T10:27:02.112+0000","up_votes":2,"down_votes":0,"body":"Find ich schon fair. (Ich nehme einfach mal an \"Silber VI\" sollte \"Silber IV\" heißen)\nDu hast bewiesen, dass du es wert bist, auf deinem alten Stand weiterzumachen.  Die Anzahl der Siege ist übrigens nicht sonderlich aussagekräftig, da die Elo deiner Mit- und Gegenspieler deine Startelo bestimmt.\nFalls es dich tröstet, ich war letzte Season Gold V und musste auf Silber IV starten.","replies":[]},{"poster":"HoloHoroHolo","date":"2016-05-30T10:23:35.078+0000","up_votes":2,"down_votes":0,"body":"Allgemein wurden fast alle Spieler niedriger eingestuft (weniger Ausnahmen denke ich).\nErgo kannst du froh sein, dass du dein Silber 4 gehalten hast. Habe von einigen Platin 5 leuten gehört die nach Silber geschickt wurden. Viele kamen Bronze etc.\n\nKurz: Sei happy \"so hoch\" im Verhältnis eingestuft worden zu sein.\n\nPS. Nein keiner weiß genau wie das funktioniert mit der Einstufung.\n\nPPS. Ich bin überrascht, dass so spät noch Leute ihre einstufungsspiele machen, dachte hat schon jeder lol :D\n\nLG\nSPicy","replies":[{"poster":"Sirrkas","date":"2016-05-30T11:20:09.598+0000","up_votes":1,"down_votes":0,"body":"Ich fange meine Rankeds meistens auch erst im Frühling an. Die interessieren mich eher weniger.","replies":[]}]},{"poster":"Wernicke","date":"2016-05-30T13:41:08.289+0000","up_votes":1,"down_votes":0,"body":"Dieser Acc ist mit 8/2 gleich wieder in Bronze 5 eingestuft worden xD","replies":[]},{"poster":"Living Tempest","date":"2016-05-30T11:39:49.882+0000","up_votes":1,"down_votes":0,"body":"Ich kam mit 3/7 in Platin 5 :)","replies":[]},{"poster":"Pure Cynicism","date":"2016-05-30T11:17:30.589+0000","up_votes":1,"down_votes":0,"body":"Ich kam mit 5/5 von Gold 1 zu Silber 1. Also alles im Rahmen bei dir.","replies":[]},{"poster":"pen1sforthewin","date":"2016-05-30T10:49:36.274+0000","up_votes":1,"down_votes":0,"body":"Oke danke an alle für die Antworten, ich war mir nur nicht im klaren ^^","replies":[]}]}