{"poster":"NiceGuy Yasai ou","date":"2015-02-07T16:21:13.629+0000","title":"Bekomme keine bestätigungs E-Mail","subforum":"Hilfe & Support","up_votes":8,"down_votes":1,"body":"Mein Account wurde gehackt und ich habe versucht, dass Passwort zu ändern aber es kam keine Email bei Web.de an. Weder im Spam Ordner noch im normalen Ordner! Ich habe den Support angeschrieben, aber es kam keine bzw. unzureichende Antwort an. Ich habe auch Beweise in Form von Screenshots und seinem League of legends inGame Namen!\r\n\r\nIch brauche eine schnelle Antwort, weil er sich permanent einloggt und meine RP und IP ausgeben hat!\r\n\r\nmfg. Yasai Kori","replies":[{"poster":"tiellevetolv","date":"2015-02-07T16:24:11.617+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"NiceGuy Yasai ou","date":"2015-02-07T16:25:48.871+0000","up_votes":2,"down_votes":0,"body":"Ja ich bin mir sicher, dass er sie nicht geändert hat.","replies":[{"poster":"tiellevetolv","date":"2015-02-07T16:29:22.200+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"NiceGuy Yasai ou","date":"2015-02-07T16:30:39.305+0000","up_votes":4,"down_votes":0,"body":"Vielen Dank :)","replies":[{"poster":"eingew","date":"2015-02-07T17:08:38.633+0000","up_votes":2,"down_votes":1,"body":"Du kannst dem Support auch jetzt schon schreiben... Ich weis nicht, was du geschrieben hast, sodass der Support dir nicht geholfen hat, deshalb würde ich dir einfach vorschlagen ein zweites Ticket zu erstellen, indem du ruhig und sachlich dein Problem schilderst.","replies":[{"poster":"NiceGuy Yasai ou","date":"2015-02-07T17:14:07.350+0000","up_votes":1,"down_votes":1,"body":"Ich hab schon 3 Ticktes geschrieben. Zwei auf deutsch und Eine auf englisch. Und ich habe mein Problem ruhig und sachlich geschildert.","replies":[{"poster":"Cyele","date":"2015-02-07T17:22:25.619+0000","up_votes":2,"down_votes":1,"body":"Warte einfach ab. Die Supporter brauchen nunmal ein wenig Zeit um sich des Problems anzunehmen und was zu machen. ^^ Da immer wieder neue Tickets aufzumachen ist kontraproduktiv. Ich würde es ein Stück weit gelassen sehen -> wie schon jemand schrieb, alle Acc-Vorgänge innerhalb der Hacking-Zeit kann man rückgängig machen.","replies":[]}]}]}]}]}]}]},{"poster":"Cyele","date":"2015-02-07T17:05:45.967+0000","up_votes":2,"down_votes":0,"body":"Hab mich schon gewundert, warum du ständig deinen Namen änderst und mich \"vollspamst\". LOL, da ist wohl jemand auf ne Phishing-Seite hereingefallen. :P","replies":[]},{"poster":"domingoo","date":"2015-02-08T02:16:28.061+0000","up_votes":1,"down_votes":0,"body":"sollte es dein Account sein weißt du doch bestimmt noch deine früheren Aktivitäten\nWas gefragt wird \n- Dein Kontoname (mit dem du dich anmeldest):\n- Dein Beschwörername (den andere im PvP.net sehen)\n- Email Adresse bei der Erstellung des Kontos:\n- Aktueller Server:\n- Eine Liste der Orte, von welchen auf das Konto zugegriffen wurde (Ort/Land):\n- Deine letzte IP-Adresse, mit der du League of Legends gespielt hast ( http://whatsmyip.net/ ):\n- Den Internetanbieter, den du bei der Erstellung des Kontos genutzt hast:\n- Eine Liste der Orte, von denen aus du RP-Käufe getätigt hast (Ort/Land):\n- Die ersten 5 Champions, die du auf diesem Konto erworben hast:\n- Der erste Spielinhalt, den du mit RP gekauft hast (falls du dies getan hast):\n- Wie bist du in den Besitz dieses Kontos gekommen:\nAlso alles cool \nLG","replies":[{"poster":"NiceGuy Yasai ou","date":"2015-02-08T13:47:21.650+0000","up_votes":1,"down_votes":0,"body":"mach ich vielen Dank.","replies":[]}]},{"poster":"Hakkuu","date":"2015-02-07T18:39:44.611+0000","up_votes":1,"down_votes":0,"body":"Schreib gleich den Support an. Hier im Forum wird dir wohl kaum jemand helfen können.\nDie brauchen manchmal etwas länger.","replies":[]}]}