{"poster":"LatetotheRace","date":"2018-03-10T20:58:35.341+0000","title":"Revert Mordekaiser now? Please?","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"Yet another revert to the list.\r\nLeblanc.\r\nRengar.\r\n~~Mordekaiser~~\r\n\r\nMorde's rework left him in the worst state by far making him literally too big to fail kit wise, until you lower the numbers. \r\nHe's kit is so number reliant there's almost no real mechanic reliance. It's just try and burst kill your target until it either out plays, kills, or simply out runs you with little to no effort...\r\nCan we please rework him yet? \r\n\r\nP.S. I miss my first and most favorite main...","replies":[{"poster":"Kelg","date":"2018-03-10T22:17:36.392+0000","up_votes":2,"down_votes":0,"body":"Just wait until 2024 when Morde gets his VGU baka","replies":[]},{"poster":"BattleOoze","date":"2018-03-10T22:51:36.622+0000","up_votes":2,"down_votes":3,"body":"The new morde is 10x better than the old one.","replies":[{"poster":"LatetotheRace","date":"2018-03-11T05:50:25.980+0000","up_votes":2,"down_votes":1,"body":"Explain if you don't mind.","replies":[{"poster":"BeatzBoyFTW","date":"2018-03-11T05:56:35.967+0000","up_votes":3,"down_votes":1,"body":"- Free XP gains through duo lanes &amp; teamfights.\n- Summons a freaking Dragon with his ult.\n- Better sustain compared to his old one, where the old one just shreds HP and Will of the Ancient was removed.\n- Has better dueling power with his new Q and sustainable/DoT damage W.","replies":[{"poster":"LatetotheRace","date":"2018-03-11T07:14:43.720+0000","up_votes":2,"down_votes":2,"body":"\"Free XP gains through duo lanes & teamfights.\nSummons a freaking Dragon with his ult.\"\n\nThis is only a shitty tag-on to make him remotely viable bot lane. Nothing more.\n\n\"Better sustain compared to his old one, where the old one just shreds HP and Will of the Ancient was removed.\"\n\nThis I 100% agree on, but keep in mind with the domination tree you can get s\nspellvamp, along with Gunblade, but will of the ancients was preferable. So you could probably make it work today.\n\n\n\"Has better dueling power with his new Q and sustainable/DoT damage W.\"\n\nYou also have to keep in mind he has the lowest possible movement speed, and even with {{item:3116}} it's not terribly difficult to just stop him from landing his Q's. (Not to mention the removal of Bonus movement speed from mage items hurt him even more.) I will agree that the W can be really powerful when used correctly, but he also lost the bonus Mr/Armor and easier lane harass with his old W.","replies":[{"poster":"BeatzBoyFTW","date":"2018-03-11T08:12:42.021+0000","up_votes":1,"down_votes":0,"body":"> This is only a shitty tag-on to make him remotely viable bot lane. Nothing more.\n\nAnd what difference is Morde having these kits compared to the old Morde that has NOTHING? Bot lane or not, these are still relevant when laning phase is over.\n\n> This I 100% agree on, but keep in mind with the domination tree you can get s\nspellvamp, along with Gunblade, but will of the ancients was preferable. So you could probably make it work today.\n\nThe idea  of **forcing** Morde to put points into certain Rune Page and then buys a specific item to gain those sustain is just too demeaning. With the natural sustain Morde has now, he has a ton of space & extra income to invest on other AP items already.\n\n> You also have to keep in mind he has the lowest possible movement speed, and even with {{item:3116}}  it's not terribly difficult to just stop him from landing his Q's. (Not to mention the removal of Bonus movement speed from mage items hurt him even more.) I will agree that the W can be really powerful when used correctly, but he also lost the bonus Mr/Armor and easier lane harass with his old W.\n\nThe DoTs he's dealing with W can withstand more damage since it still builds shield over time (_and gains bonus sustain by ending his W_), plus his triple Q hits can help to build more shields over time. All these were already compensated of not having the Armor & MR his W used to have.","replies":[]}]}]},{"poster":"BattleOoze","date":"2018-03-13T14:43:23.381+0000","up_votes":1,"down_votes":0,"body":"He has innate sustain, more mobility, his ult scales with ad ap and hp, he can take control of dragons to seige, he can take more exp than usual in duo lane (a bonus but not important for solo lane), his q does way more damage than before, and he can heal allies and himself while boosting the MS of either depending on whos tailgating who. His visuals are so much better as well, doesnt look like a toy anymore compared to before... i mean the list goes on hes just much better. his passive is now shown on your HP bar for clarity of how big it is... i mean what benefits are there of the older morde? hes more viable now than before and even saw some pro play (although barely).","replies":[]}]}]},{"poster":"Yásùõ","date":"2018-03-10T21:50:07.503+0000","up_votes":1,"down_votes":0,"body":"Since the mordekaiser rework, I'm hoping for the day Morde becomes the old one again. Some stuff can stay same ( dragonpassive and shield decays until 25%) but PLEASE the rest has to be reverted. Back to old basestats, back to the old E damage and also to the Q, everything....","replies":[]},{"poster":"Kai Guy","date":"2018-03-10T21:07:09.921+0000","up_votes":1,"down_votes":0,"body":"Hold the phone, Morde deserves a rework of epic metal proportions, a revert will not capture how bad ass he can be. This coming from a guy who quit playing morde because of the rework. I loved shield for days huehuehue #1 and all but there's a lot of untapped potential that's lost if its just reverted.","replies":[{"poster":"LatetotheRace","date":"2018-03-10T21:22:24.733+0000","up_votes":1,"down_votes":0,"body":"I don't disagree, but I'd rather play his old kit in the meantime...","replies":[]}]},{"poster":"SmurfBlanc","date":"2018-03-10T21:10:49.495+0000","up_votes":1,"down_votes":0,"body":"I actually liked playing against morde before his rework.  I never played him because his playstyle doesn't mesh with mine, and he had some pretty clear weaknesses in his lack of mobility and CC, but he was still a strong and mostly balanced champ that I never see played anymore at all, which is a shame.\n\nI think he was by far Riot's worst rework to date, and speaking as a LB player, if anyone deserves a revert, its Morde.","replies":[]},{"poster":"Ahristocats","date":"2018-03-10T23:08:50.554+0000","up_votes":2,"down_votes":2,"body":"why?\n\nold morde was garbage","replies":[]}]}