{"poster":"BMO Chop","date":"2020-02-22T10:47:54.436+0000","title":"Server Probleme in den letzten  2 Tagen + Clash","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallihallo Beschwörer!\n\nWie ihr mit Sicherheit schon bemerkt habt, hat es EUW gestern Abend das zweite Mal in Folge von 22 Uhr bis 4 Uhr erwischt.\n\nUns ist absolut bewusst wie unglücklich und frustrierend dies, gerade vor Start des Clash ist. \nNach momentanen Infos scheint es das gleiche Problem wie den Tag zuvor gewesen zu sein, was es einfacher macht, dem Problem auf den Grund zu gehen. \n\nWir entschuldigen uns zutiefst für die erneuten Ausfälle und arbeiten hart an einer Lösung, um dies zukünftig zu vermeiden. \nDie Loss Prevented Funktion wurde sofort aktiviert und es sollten keine LP bei Niederlagen verloren, und die hälfte der normalen LP bei einem Sieg erhalten worden sein.\n\nSolltet ihr jegliche Leaverbuster bekommen haben, sagt uns bitte bescheid, dann heben wir diese natürlich auf!\n\n**Clash**: Aufgrund der anfallenden Probleme ist Clash auf das nächste Wochenende verschoben! Die Serverproblem sind nicht durch Clash selbst entstanden, können aber durch den starken Traffic durch Clash verschlimmert werden. Deshalb die Entscheidung es um eine Woche zu verschieben!\n\nWir hoffen, dass nun alles wieder rund läuft und wünschen euch ein angenehmes Wochenende!\n\n{{sticker:sg-zephyr}}","replies":[{"poster":"Ahris Man","date":"2020-02-23T17:50:19.796+0000","up_votes":1,"down_votes":0,"body":"Ich finds gut das Clash 1 Woche verschoben wurde. \n\nAls Kölner war man dieses Wochenende eh nicht ansprechbar und nächste Woche kann ich mitspielen {{sticker:sg-ezreal}}","replies":[]},{"poster":"Kryogonal","date":"2020-02-23T08:40:45.039+0000","up_votes":1,"down_votes":0,"body":"\" Die Serverproblem sind nicht durch Clash selbst entstanden, können aber durch den starken Traffic durch Clash verschlimmert werden. Deshalb die Entscheidung es um eine Woche zu verschieben!\"\n-Doch es liegt an Clash bzw. dass Teamranked entfernt wurde und FlexQ kein guter Ersatz ist. Seit 3 Jahren wird Clash immer wieder groß angekündigt und die Leute wollen gerne in so einem Turnierformat mitmachen, vorallem da es von Rito direkt ist und es nicht über andere läuft (bequemer etc.).\nDadurch sind viele auch willig sich an dem Tag freizuhalten bzw. die Tage vorher zu spielen um wieder reinzukommen, daraus folgt der größere Andrang.\nLetztes Jahr wurde ja im Nov/Dez auch zwei Wochen hintereinander Clash gespielt, die erste Woche war auch mit Serverproblemen übersäht aber Woche 2 war dann schon besser. Und an sich sollte Riot damit doch rechnen, wenn sie dies immer ankndigen die Leute wollen das spielen und ihren Spaß in einem \"echten\" Teamranked haben. Da ja die Zeitbeschränkung ist auf den Abend ist es ja klar, dass dann alle sich einloggen. Die Probleme am Do und Fr abend sind ja auch logisch --> Feierabend Schulschluss man kommt nach hause alles erledigt und alle Freunde haben Zeit um sich einzuspielen. Wie da keiner auf die Idee kommt das seit 3 Jahren zu antizipieren ist mir ehrlich gesagt schleierhaft. Ich könnt mir aber auch vorstellen wenn Riot sagt ok alle 2 Wochen findet Clash statt ungeachtet von Serverproblemen, dass sich die Probleme von allein lösen lassen könnten, weil dann der Spielerandrang zurück gehen könnte, weil jeder weiß, dass es auch in 2 Wochen nochmal Clash geben würde.\nNaja ich hab meinen Senf dazu gegeben, bin aber immernoch der Meinung \n{{sticker:slayer-jinx-catface}} #bringbackTeamranked{{item:3046}} \n\nMfG\nKryo","replies":[]},{"poster":"SeaHorseCalamity","date":"2020-02-23T02:24:58.329+0000","up_votes":1,"down_votes":0,"body":"Es ist natürlich schon ein sehr witziger Zufall, dass es jedes Mal, wenn Clash erscheint, zu Problemen kommt.\nMeine Kumpels reden immer wieder von einem Serverclash...\n\nAber ich glaube fest daran, dass es eines Tages funktionieren wird {{sticker:sg-miss-fortune}}","replies":[]},{"poster":"ChRiis6715","date":"2020-02-22T16:25:36.150+0000","up_votes":1,"down_votes":0,"body":"Die Entscheidung ist wohl richtig! Trozdem finde ich die Entscheidung auch nicht gut da bestimmt einige Spieler (ich gehöre dazu) Arbeitszeiten für Clash verschoben oder sogar urlaub genommen haben und das nicht an 2 Wochenenden machen können und somit Clash für diese Spieler ins Wasser fällt... \nGrade wenn man als Team schon einige Tage oder Wochen auf Clash hinarbeitet.\n\nAber wie gesagt die Entscheidung ist die richtige denke ich weil Clash zu starten trotz der Probleme ist auch nicht optimal:D","replies":[]},{"poster":"ErgusTV","date":"2020-02-22T13:40:04.242+0000","up_votes":1,"down_votes":0,"body":"Ich hab gar keine lp für einen sieg bekommen","replies":[]}]}