{"poster":"playing sol","date":"2016-07-26T20:44:12.866+0000","title":"League of legends patch 6.15 issues! Help !","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Well so i was playing league before the update around 3 am i was on it playing matches, and i got off to sleep, i come back and theres an update so when i try to update it i got the update failed error, i fixed it by putting the S_OK file in lol_game_client folder, which fixed it and updated my game, but now when i log in i get something saying client version rejected by servers?? idk whats going on and this is the only thing i like to play someone please help me fix it","replies":[{"poster":"playing sol","date":"2016-07-26T21:11:55.173+0000","up_votes":1,"down_votes":0,"body":"Update- now its not even going to the login after the repair, its just giving me an \"update failed\" error!","replies":[{"poster":"Porocles","date":"2016-07-26T21:52:06.929+0000","up_votes":2,"down_votes":1,"body":"It sounds like you may have a corrupt patcher that's not launching the game properly.  Changing files around like this can also cause issues as the game won't be able to find necessary assets.  As Rineyy suggested, please go over our [Patching Issues](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues) guide to get this fixed up.  You may need to force a re-patch, with the instructions included with the guide.  Once you go over each step, let me know if your issue persists and I'd be happy to help!","replies":[{"poster":"playing sol","date":"2016-07-26T21:54:41.099+0000","up_votes":1,"down_votes":0,"body":"i repatched the game by going to the question mark on the top right corner and clicking repair but after a while (10-20 minutes) it just gives me the update failed error, thus making me reinstall the game to no avail again.","replies":[{"poster":"Porocles","date":"2016-07-26T22:03:16.625+0000","up_votes":1,"down_votes":0,"body":"Thanks for following up with me.  If instructions in the guide were unable to help, reach out to our tech team who can help out and dig deeper.  [Submit a ticket](https://support.riotgames.com/hc/en-us/requests/new), and gather a set of logs provided by our [Hextech Repair Tool ](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs) to help provide more context.  We'll respond to your ticket asap and help out with your specific case!\n\nJust as a heads up, repairing is not the same as re-patching.  You can force a re-patch by following [these instructions](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues#wq4).","replies":[{"poster":"playing sol","date":"2016-07-26T22:15:56.873+0000","up_votes":1,"down_votes":0,"body":"I have submitted a ticket, do i just wait? new to this haha, and thank you so much for the help!","replies":[{"poster":"Porocles","date":"2016-07-26T22:20:21.242+0000","up_votes":1,"down_votes":0,"body":"Awesome!  Indeed, our tech team will reach out to you as soon as possible.  There is a little bit of wait right now, but you'll be in good hands!  It's been a pleasure, and thanks for your patience.  :D","replies":[]}]}]},{"poster":"playing sol","date":"2016-07-26T22:02:25.689+0000","up_votes":1,"down_votes":0,"body":"im also getting an error saying \"LoLPatcher.exe - Corrupt File\" even though i reinstalled the game, ive been getting this error before this update, and the game ran fine with this error since it only came up in the in game store, but i feel as this is preventing the update?? Oh and when i repair the launcher, the error box for the lolpatcher corrupt file, is actually popping up every 2 seconds, it pops up from next to my battery icon on my computer","replies":[]}]}]},{"poster":"Kürama","date":"2016-07-26T21:25:02.556+0000","up_votes":1,"down_votes":0,"body":"[Visit Heimy’s Workshop to patch these issues.](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues)\n\nhttp://vignette3.wikia.nocookie.net/leagueoflegends/images/c/c5/Heimerdinger_PiltoverCustomsSkin_old.jpg/revision/latest?cb=20120118075912","replies":[]}]},{"poster":"Kürama","date":"2016-07-26T20:47:38.925+0000","up_votes":1,"down_votes":0,"body":"Repair the game by clicking the question mark icon to the top right of the patcher. Select \"Repair\" and let the patcher scan and repair corrupt game files. When the process is completed, you'll see the orange \"Launch\" button.","replies":[]}]}