{"poster":"Yuumi or Lose","date":"2015-02-01T21:10:08.334+0000","title":"Riot please make Ohmwrecker useful.","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"{{item:3056}} You see that icon there? Do you know what that is? Probably not. Fun Fact: Ohmwrecker has been with us for 3 seasons. Weird right!? Well that's too bad because nobody uses the item because of how useless it is. It's basically a trap item that will have someone wonder what they can do with it and try to squeeze any use out of the item and end up behind because of the purchase. Basically a tank item with an active that allows you to deactivate an enemy turret for 3 seconds. Here are some glaring issues with this item.\r\n\r\nThe stats on it are mediocre in which you're better off purchasing other tank items.\r\n\r\nThe active allows you to deactivate an enemy turret for 3 seconds with a 2 minute cooldown but by the time you can purchase Ohmwrecker to make use of it, you're already tanking turrets efficiently with other tank items that carry on late game.\r\n\r\nOhmwrecker becomes useless late game when all enemy turrets are gone rendering the active useless. Ohmwrecker becomes more and more useless as the game carries on which is unsatisfying and unrewarding.\r\n\r\nThe item has been with us for three seasons and barely gets any play while other items that got removed has seen more play than Ohmwrecker.\r\n\r\nMy opinion to make it better is make it cheap and give it an extra passive. OR EVEN REPLACE IT. Give it a supportive passive that benefits in the long run. At least give it a secondary active that you can use on your own towers to make it invulnerable like the summoner spell Fortify to fight off siegers or split pushers.","replies":[{"poster":"Yuumi or Lose","date":"2015-02-01T23:14:09.294+0000","up_votes":1,"down_votes":0,"body":"Honestly it needs a secondary passive or a secondary active. The items kinda works against itself as it becomes more and more useless with every turret you take out and becomes virtually nonexistent. Give it a supportive aura or something. Anything that can promote sieging. I hope reds can read and balance this item out. :( And better stats. Turn it into an ap item that way tanks can purchase better tank items and tank turrets more efficiently and ap casters can use this is a siege/poke item.","replies":[]},{"poster":"Duke Anax","date":"2015-02-01T22:36:24.235+0000","up_votes":1,"down_votes":0,"body":"I like {{item:3056}} on {{champion:12}}, the item was practically made for him and he can easily rush it.\n\nHowever most other champs can't, because it's a purely defensive item and they need to get some damage first.\nSo it would be nice to replace {{item:3067}} with something a little more offensive like {{item:3044}} or {{item:3108}}{{item:1028}} ","replies":[{"poster":"Duke Anax","date":"2015-02-01T23:07:18.949+0000","up_votes":1,"down_votes":0,"body":"Or something alltogether different:\njust remove the {{item:3067}} alltogether and make it a lower tier item:\n\n>{{item:3056}}  = {{item:2053}} + 500g = 1500 g\n> 45 Armor\n> 100% health regenration\n> Passive: point runner\n> Active: disable turrets\n\nThat way, pretty much anyone can get it at any point of the game.\n\nThen make two enchantments from {{item:3044}} and {{item:3108}}{{item:1028}} to beaf it up later.","replies":[]}]},{"poster":"InsaneSamurai","date":"2015-02-01T21:40:59.535+0000","up_votes":1,"down_votes":0,"body":"I think the stats should be buffed a bit and/or perhaps add something to the active that makes it useful when not taking a turret.  Many times, if you push lanes correctly, it doesn't even matter if you have this or not for the active.  At that point you're just rocking a low stat item that doesn't do anything.  It's neat for the final nexus push, but still not comparable to other tank items.\n\nI used it on Rek for a while because before last patch she was so damn OP it didn't matter :)  I do think that's one of the best champs to use the active on, and even then it was pretty lackluster.","replies":[]},{"poster":"CharQueen","date":"2015-02-01T21:12:58.755+0000","up_votes":1,"down_votes":0,"body":"Everytime I've played Jungle or Top, I have always glanced upon that strange item and thought, \"What idiot is going to buy this P-O-S?\"\n\nIf it were cheaper and made a turret friendly instead of shut off, it would be a pretty cool purchase.","replies":[]}]}