{"poster":"Last Grin","date":"2017-05-18T17:54:50.795+0000","title":"Reparar Cliente (luego de empezar una partida)","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Buenas. Quer&iacute;a saber si a alguno le pas&oacute; lo mismo que a mi:\r\nEntr&eacute; a jugar una normal, seleccionamos campeones y todo normal, como siempre. Al momento de cargar la partida se me cerr&oacute; la ventana de carga y sin autorizaci&oacute;n m&iacute;a, el cliente comenz&oacute; a &quot;repararse&quot;, todo mientras la partida seguramente ya hab&iacute;a empezado.\r\n(En este mismo momento me ocurri&oacute; lo que estoy escribiendo, mientras aun se repara mi juego)\r\n\r\n&iquest;Es normal que pase esto o tendr&eacute; que hacer algo para que no vuelva a pasar?","replies":[{"poster":"not fall","date":"2018-04-30T10:50:56.029+0000","up_votes":1,"down_votes":0,"body":"Muy buenos dias.\n\nSe me esta presentando este mismo error con la diferencia que aplique varias de las tecnicas que aqui utilizaron cuando\nlo realice por primera vez junto con la herramienta Hextech me funciona pero cuando apago la PC el error Vuelve a saltar.\nLo explico entro a la selecion de campeon elijo y cuando sale la panatalla de cargar partida no se me cargan ni el ping de una vez \nse paraliza la pantalla y {{summoner:4}} salta el error bug  estoy muy desesperado y {{summoner:3}}  por no poder jugar por suerte hago esto en jugo 1vs 1 contra bots y en varias ocaciones he dejado buenas partidas tiradas por este condenado error.\n\nNecesito de su ayuda por favor\n\n\nSaludos.","replies":[]},{"poster":"XFacuuu","date":"2018-03-27T01:46:14.785+0000","up_votes":1,"down_votes":0,"body":"Ami me viene pasando muy seguido desde hace como 4 meses \nLo peor es que me pasa en partidas clasificatorias y me dan cola de 20 por algo que yo no tengo la culpa digamos tengo un pc buena que me corre el lol a buenos FPS un internet estable pero no entiendo la razon a esta causa no se si alguien ya lo soluciono","replies":[]},{"poster":"bebotril","date":"2018-03-25T20:14:25.308+0000","up_votes":1,"down_votes":0,"body":"ami me pasa lo mismo nesesito ayuda cada 1 partida se me rompe el laucher y dice reparar una bronca tengo ya lo elimine y lo desintale de nuevo no se que pasa sigue el mimo error necesito ayuda se esta reparando es como la decima ves que me pasa lo mismo alguien que me ayude","replies":[]},{"poster":"luffy3D","date":"2018-02-21T04:12:49.212+0000","up_votes":1,"down_votes":0,"body":"me pueden  ayudar cuando veo la tienda de objetos se me desaparecio lo de abajo ahora solo veo la tienda como lo soluciono","replies":[]},{"poster":"IPermenfi","date":"2017-10-23T19:51:39.396+0000","up_votes":1,"down_votes":0,"body":"Ami  me paso cuando quiero jugar lol me dice\n{{champion:32}}  reparar","replies":[]},{"poster":"Excorpion","date":"2017-05-18T17:55:59.707+0000","up_votes":1,"down_votes":0,"body":"Deberías ponerte en contacto con soporte para ver el problema.","replies":[{"poster":"Last Grin","date":"2017-05-19T00:48:58.088+0000","up_votes":1,"down_votes":0,"body":"Si, veré si mando un ticket, gracias!","replies":[]}]},{"poster":"Sonya Kyron","date":"2017-05-18T21:12:07.413+0000","up_votes":1,"down_votes":0,"body":"si, es normal, suele pasar cuando uno tiene el cliente abierto en el menú, durante la actualización de fase, o suspende la maquina, te voy a dar un ejemplo mas claro:\n\nEntro a partida un martes esta todo perfecto juego perfecto, al terminar la partida salgo al menú y estoy viendo las noticias de que todo anda bien y que el miercoles se actualizara el cliente. Voy a inicio SUSPENDER EL EQUIPO, luego de eso espero 24 o 48 horas, las que sean necesarias para que el cliente este actualizado (pero el mio no), luego de eso reactivo la PC, el cliente me figura logueado y como si todo estuviera OK (pero no lo esta) hay 200 MB que no actualice y 1.6GB de archivos que deberían haber cambiado pero no cambiaron, entro a selección de campeón todo perfecto, luego de eso ingresa al menú de partida, en ese momento el servidor checkea que mi cliente no es de la versión correcta y se cierra para actualizar, en el log figurara, rechazado por el servidor por tener cliente con versión distinta, luego de bajar los 200MB y actualizar los 86 archivos (1.6GB) lograre entrar en partida, ahora si tenemos una maquina ultrarapida y buena conexión de internet, entraremos como todos, pero si la maquina es bajos recursos y la conexión esta por debajo de los 20MB, entonces seguramente concluya en un remake.","replies":[{"poster":"Last Grin","date":"2017-05-19T00:48:37.038+0000","up_votes":1,"down_votes":0,"body":"Gracias!","replies":[]}]},{"poster":"Kyo Hatori","date":"2017-05-18T17:57:46.748+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=X54mVVp0,discussion-id=INIRJJy2,comment-id=0002,timestamp=2017-05-18T17:55:42.946+0000)\n>\n> Holas, revisa ese comentario, es tu mismo problema creo.\n\n\nfijate si te sirve","replies":[{"poster":"Kyo Hatori","date":"2017-05-18T17:58:11.601+0000","up_votes":2,"down_votes":2,"body":"Ve a tu carpeta de league of legends: C:\\Riot Games\\League of Legends\nBorra el archivo LeagueClient.exe\nejecuta el archivo lol.launcher.admin.exe","replies":[]}]}]}