{"poster":"Scimitary","date":"2015-09-13T10:25:38.338+0000","title":"Why Yi Makes Solo Queue Boring","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":3,"body":"Hello friends\n\nEver since PROJECT: Yi came out everyone has been trying out the new skin. So, of course more Master Yi&#039;s are being used. If, IF he gets a lead he snowballs, hard. He becomes so unbelievably strong that he can vaporize anyone who he can come in to contact with. \"Oh, but you can just run away.\" I hear you say. Well this would be true but his ultimate makes him speedy Gonzales on crystal meth. He goes a sonic speeds and it lasts suuuuper long. And, he seems to have it every single time he needs it. Not to mention sated devourers on him. He has a pesky gap close (His \"Alpha Strike\") to top it off. \n\nNow to the point. He is so strong if you were to walk out of base by yourself he is already onto you. You see him. He Q&#039;s. Autos you once or twice and the dreadful audio clip of \"You have been slain\" chimes. This makes the game boring, knowing that there is nothing you can do about it unless you land your CC before he Q&#039;s you and even then you might not kill him before he is released from his binding. So you die, he wins and it feels like you can do nothing about it.\n\nThis obviously makes the game boring for us that OPPOSE him.\n\n{{item:2054}} Have a cookie friends.]\n\nDue to popular demand I am adding the fact that \"the damage reduction on his W when he dives you and then meditates the last tower shot b4 he runs out of tower range to survive the dive after slicing you out of existence on the rift\" is frustrating.","replies":[{"poster":"The Spawn Man","date":"2015-09-13T10:47:59.843+0000","up_votes":2,"down_votes":0,"body":"Thornmail. Randuin's. Frozen Heart. Zhonya's. Anything that can kill squishies. There are plenty of ways to kill/limit Yi just in item builds alone, not even mentioning game play.","replies":[]},{"poster":"Garens Harem","date":"2015-09-15T05:40:50.532+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]},{"poster":"WhisperPan","date":"2015-09-15T05:37:56.710+0000","up_votes":1,"down_votes":0,"body":"Hard cc dammit. Don't know how many times I was thanked when I used to play Malzahar, after some pre-game jeering, when yi ult'd. because so would I.","replies":[]},{"poster":"Project Xayah","date":"2015-09-13T13:52:01.428+0000","up_votes":1,"down_votes":0,"body":"> He becomes so unbelievably strong that he can vaporize anyone who he can come in to contact with.\n\nExcept Quinn. Yi is Quinn's b!tch.","replies":[]},{"poster":"HeIblinde","date":"2015-09-13T10:31:40.947+0000","up_votes":1,"down_votes":0,"body":"you forgot to mention \nthe damage reduction on his W when he dives you and then meditates the last tower shot b4 he runs out of tower range to survive the dive after slicing you out of existence on the rift \n:D","replies":[]},{"poster":"MianValentino","date":"2015-09-13T10:26:21.102+0000","up_votes":1,"down_votes":0,"body":"Bum","replies":[{"poster":"MianValentino","date":"2015-09-13T10:27:59.937+0000","up_votes":1,"down_votes":0,"body":"{{champion:11}}","replies":[]}]}]}