{"poster":"ProdirexPlay1","date":"2017-07-11T07:28:05.145+0000","title":"Nerfear el combo Jhin y Morgana","subforum":"Charlas Generales","up_votes":2,"down_votes":10,"body":"Riot ese combo tiene que ser nefeado, me acabo de enfrentar a ellos y es rid&iacute;culo perder linea porque apenas Morgana da una q jhin te meta la w y te dejen stuneado lo suficiente para matarte y de sobra tanto en linea como en una tf, habia un post en reddit donde se quejaban justamente de lo mismo y reci&eacute;n ahora entiendo lo molesto e injusto que puede llegar a ser.","replies":[{"poster":"Armo pelopinchos","date":"2017-07-11T08:45:26.842+0000","up_votes":5,"down_votes":0,"body":"Hola.\n\nDesde mi opinión, no tendría sentido nerfear la sinergia de dos campeones porque sea molesto, a fin de cuentas es la idea. Es como decir, \"nerfeen el combo Yasuo - Malpithe\" ¿En qué se basaría la parte estratega del juego entonces?\n\nYo lo que haría sería : Empezar a practicar zamba para mejorar las caderas y esquivar la Q de Morgana (es MUY predecible), pararme atrás de los minions y si todo esto falla PICKEAR SIVIR.\n\nLo dije en broma y en enserio, saludos.","replies":[]},{"poster":"stonerock","date":"2017-07-11T07:31:29.848+0000","up_votes":3,"down_votes":0,"body":"Cuando te enfrentes a un kogmaw/lulu te vas a querer matar si esa linea te trae problemas xD","replies":[{"poster":"Charlôtte","date":"2017-07-11T17:46:17.856+0000","up_votes":1,"down_votes":0,"body":"Shh... que si no me la nefean","replies":[]},{"poster":"rokushoger","date":"2017-07-11T11:12:44.244+0000","up_votes":1,"down_votes":0,"body":"Eso si que es para pegarse un tiro.","replies":[]}]},{"poster":"Lucio22","date":"2017-07-11T10:18:58.761+0000","up_votes":2,"down_votes":0,"body":"cuando no tenes idea que ni jhin ni morg stunean, pero te queres sentir popular y quejarte igual, no?","replies":[{"poster":"LuKuRa","date":"2017-07-11T18:02:45.271+0000","up_votes":1,"down_votes":0,"body":"es un Root (o Rut) lo que hacen :p","replies":[{"poster":"Lucio22","date":"2017-07-11T20:13:57.460+0000","up_votes":1,"down_votes":0,"body":"Se, pero le dicen stuneado sin saber...\nComo cuando dicen que leo tiene 3 stuns y en realidad son 2 y un root","replies":[]}]}]},{"poster":"Charlôtte","date":"2017-07-11T17:48:00.691+0000","up_votes":1,"down_votes":0,"body":"Si a eso le llamás combo... te faltan muuchos duos que enfrentar :v","replies":[]},{"poster":"scachthach","date":"2017-07-11T17:40:25.684+0000","up_votes":1,"down_votes":0,"body":"Hay una morgana del otro lado? Facil,que tu suport sea soraka. O sino malzahar. O incluso otra morgana.\nSino esta el fajin de mercurio","replies":[]},{"poster":"XxBebesitohxX","date":"2017-07-11T12:54:38.275+0000","up_votes":1,"down_votes":0,"body":"es lo mas facil depende del supp que usas tambien puedes sacar items que quitan los stuns o usar hechizos de invocacor  de sacan todos los stuns aunque claro el uso es limitado pero va en tu habilidad","replies":[]}]}