{"poster":"Rubeido Montain","date":"2016-02-29T05:20:55.691+0000","title":"there should be an AP maw/steraks/blackcleaver etc.","subforum":"Gameplay","up_votes":9,"down_votes":4,"body":"as the title suggest. they need to have AP versions of those kinds of items. the maw steraks blackcleaver titanic hydra and so on, all need AP version, when i go up against a zed who can build maw and tank me, but i cant build an ap version that gives me a physical shield so i can tank him. thats not balanced at all. the same goes with all those other items, AD gets all the good stuff, and its breaking the game with graves who can be immortal. \r\n\r\nis AP dead? should we just retire all of our ap champs because riot is just going to keep making more and more broken toys for AD? where is our AP duskblade? where is my AP tank who can have stats like a darius or garen? if they can be immortal and deal enough damage to 100-0 someone in 2 seconds. why cant i have that kind of power with mordekaiser or vlad or cho? where is my swain who has 300 armor/mr 4-5k hp and infinite sustain with 800 ap? you can laugh and say that its funny, or that it would be broken or to OP, but yet they allow it for AD. why should these champs be any different? where is my mordekaiser who can keep an infinite absorb shield up? but its ok for yasuo or yi to have lifesteal that makes them immortal?  \r\n\r\nbut where does it end? will it spiral out of control until every champion is immortal? where games can never end because every champion is unable to die? riot. why is this allowed? you wont nerf tryn ult. but youll take silence away from kassadin, you will allow blitz to have a movement speed ability and a grab, with a knockup and a silence. but you wont allow leona to proc her own passive, cuz that would be to strong? common riot. you dont have a clue what your doing and your game is spiraling out of control. the state of balance is at the all time low in the 4 years ive been playing this game. you throw in an item the duskblade, but they didnt need any new items. they had infinity edge already, they had maw, deaths dance, and so on. you feed them new toys but you wont give AP anything good. AD is already super powered, why give them more stuff? just take those same items, give them AP instead of AD and call it balanced, that would be better than what your doing now.","replies":[{"poster":"I am Pacman","date":"2016-02-29T06:05:56.369+0000","up_votes":2,"down_votes":1,"body":"They are doing an ap item update with the immobile mage update.  Also your are comparing items from different roles.  How the hell would an ap champ apply 6 stacks of %pen of the ap black cleaver. At max some champs could do 4 and then dots champs like swain would shred.  \n\nI could go through every point here to explain further (like how vlad is not only ranged but also a sustain oriented champ and should not be 100-0 champs because of his limited counter play).  \n\nfck it why not\n\n1st paragraph:  Mage update coming with ap item update,  Comparing different items designed for different roles,  look at steraks on adcs, you really want a shred item on mages that could reduce another 30% of your mr on top of void?  zhonyas is the maw equivalent but instead of 300 dmg shield you have to time it right to avoid the damage.\n\n2nd paragraph: First off neither darius nor garen can one shot someone in 2 seconds unless stupid fed (and even then just kite them to death), darius takes time to ramp up his passive stacks and garen is all melee, just kite him (if you get caught by bushren then its your fault). Morde was supposed to be the ap equivalent with the juggernaut update but you can't have him because riot doesn't know how the hell to do it yet.  Vlad see above.  Cho can do that, go rod and rylias for tanky and then build ap. His full combo can easily 100-0 squishies.\n\nYasou is definitely not a problem right now, and while i hate the devourer, rageblade, titanic build yi does its not because of sustain but rather the raw amount of mixed dmg being pumped out (really hard to itemize against true ad and magic). Sure frozen heart and randuins exist but the real counter is crowd control. I just find yi irritating.\n\n3rd paragraph:  Lot of weird complaints in this one.  \n\nTrynd doesn't need a nerf right now, his ulti is something that can be played around and he has a shitty laning phase vs a lot of the strong top laners right now.\n\nKassadin was overbearing as fuck with his silence, litterally nothing you could do against him. Needed it removed just like talon and leblanc.\n\nBlitz is also fine, his move speed slows him after its over and his pull suffers from the free engage of a ali, naut, amumu, etc. Just pick them\n\nLeona procing her own passive would allow her to jungle and top lane and simply put there is no reason to allow that. She is already great as a support who is is balanced right now.\n\nDuskblade needed to be added, during preseason and start of season 6 assassins sucked balls. It might be a tad strong now but at least they have something to nerf that only ad assassins buy and aren't accidentally nerfing adc items at the same time. (also no one buys ie on assassins)\n\nFinally, mages are getting an item update so you got that to look forward to. \nDam that wall of text. \n\nTL;DR stop complaining about things that aren't a problem or are getting fixed.","replies":[]},{"poster":"jmaishere","date":"2016-02-29T17:39:35.195+0000","up_votes":1,"down_votes":0,"body":"they already have {{item:3091}} as a parallel to black cleaver","replies":[]},{"poster":"Chaos Milk Tea","date":"2016-02-29T17:34:19.452+0000","up_votes":1,"down_votes":0,"body":"A mage's job is to do continual bursts of damage, often in aoe.  This allows you to peel or CC clumps of champions, or even 100>0 the adc late game.  Mages have a lot of strengths that other groups of champions don't.  Sure it doesn't show up as much in a solo lane, but mages feel pretty op in team fights when the likes of {{champion:112}} {{champion:34}} and {{champion:101}} are blasting large chunks of your team.","replies":[]},{"poster":"PiVoRx","date":"2016-02-29T12:12:44.542+0000","up_votes":1,"down_votes":0,"body":"AD{{item:3157}}","replies":[]},{"poster":"Burnt Iron King","date":"2016-02-29T06:36:31.827+0000","up_votes":1,"down_votes":0,"body":"Oh god.\nTanky AP items.\nYes please!","replies":[]},{"poster":"Paladin 0f Life","date":"2016-02-29T05:27:22.690+0000","up_votes":1,"down_votes":0,"body":"We have rylais, liandry, abby and zhonna. That's it. Vs sterack, fzn mallat, statick, LDR, maw, Bc, yommu, titanic, ravenous, whatever the fuck iceborn is now, bork. I mean yeah the point. Shouldn't be hard to point out","replies":[]},{"poster":"Lauchmelder","date":"2016-02-29T06:06:56.110+0000","up_votes":2,"down_votes":2,"body":"We used to have an AP duskblade. It was called DFG and got removed because it was \"unfair\"","replies":[]}]}