{"poster":"Trucy Wright","date":"2019-11-21T21:59:24.087+0000","title":"¿Alguna ayudita relacionada al amor?","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":0,"body":"Pues... Resulta que, debido a mi increíble sutileza (no), una chica que me parece sumamente hermosa en todo su ser se enteró de que... bueno, ya saben. Me da un poco de ¿esperanza? que no se lo haya tomado a mal, aunque si fue una sorpresa. De todas formas, no sé qué hacer desde este punto. Cabe recalcar que hablamos por wpp por ahí pero es bastante... simple, para hablar, y por ahí muuuuuucha bola no me da. IDK what to do.","replies":[{"poster":"scachthach","date":"2019-11-22T04:50:06.633+0000","up_votes":1,"down_votes":0,"body":"no le deas vueltas al asunto. todo puede salir bien o mal, no importa, lo que importa es que lo intentes, sin miedo. y si sale mal, cito a lux: \"perder es una oportunidad para brillar con mas fuerza\".","replies":[]},{"poster":"9deEspadas","date":"2019-11-22T00:48:25.689+0000","up_votes":1,"down_votes":0,"body":"No se trata tsnto de como hacerle saber a la otra persona que te gusta, sino de como encararla al frente, uno de un dia para el otro no va a estar de novio solo por pedirselo a otra persona, hay que probar, una salida, cita, mates en el parque, una joda, todo es valido, y va a ser bastante instintivo una vez hecho eso uwu","replies":[]},{"poster":"LeeSinHabilidad","date":"2019-11-21T22:31:12.014+0000","up_votes":3,"down_votes":3,"body":"Si estás leyendo este mensaje desde tus actualizaciones, copialo ahora porque es probable que cuando le hagas click para responder, lo hayan borrado. \n\nLa cosa es que venís a pedir ayuda amorosa a un foro de lol. Pero bueno, como sos una persona agradable voy a cantarte la posta.:\n\nO amiga o amigarcha. Las dos no. Si te hacés el buenito y le hacés favores no vas a llegar a ningún lado. La onda es conectar con ella sin caer en la falsedad de que te empiece a gustar el rock nacional porque ella escucha Cerati o como se escriba el apellido del apio ese. Así que el primero consejo es \"Saber si querés cagar la amistad o no\" . \nEl segundo es el mismo que el primero, conectá con ella de alguna manera. Conectar, repito, no es imitar lo que hace ella ni decirle \"ay que lindo tu perrito\" y resulta que tiene un perro que es más feo que vieja con minifalda arriba de la escalera. Y vos sosteniendo la escalera., Conectar es abrir los sentidos y escuchar lo que te dice. Comprenderlo. Las minas te hablan de tantas cosas que te aburren pero a veces podés escuchar y conectar ( simpatizar y entender) lo que cuenta. Eso da pie a que te cuente más. Y una vez termina la conversación, te lleva a más. \"Más\" no quiere decir que te va a invitar a repasar el kamasutra cuando terminen de hablar. \"Más\" significa que va a encontrar más confianza en tenerte cerca. Tu presencia es lo que va a valorar y va a necesitarla. \nTercer y último consejo. Dejá que ella guíe, más bien, no fuerces las cosas. Seguí lento pero sin pausa. Y solamente comele la boca en un momento de dudas. Y cuando vos dudes de si es momento para comerle la boca o no, quiere decir que es momento. Hacelo. No seas dormido. Si no lo hacés te vas a arrepentir después. Cumplí bien la primer fase de este consejo antes que la última.","replies":[]},{"poster":"BoxBoxFanboy","date":"2019-11-21T22:01:52.617+0000","up_votes":1,"down_votes":3,"body":"No se amigo, yo te diria que si ya sabe te tires de cabeza al bardo pero seguro terminas friendzoneado. \nOtra que podrías hacer es charlarle como si nada y si ella te saca el tema le decis de nazi","replies":[]}]}