{"poster":"Trucy Wright","date":"2019-09-02T17:05:54.598+0000","title":"¿Cómo lidio con mi intolerancia?","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":2,"body":"¡Hola, muy buenas! Hago esta discusión debido a que últimamente se me dificulta mucho lidiar con la constante intolerancia que siento hacia la mayoría de cosas. Tanto en vida real como en la internet, al ver a individuos con ciertas características siento ese deseo de decirles cosas malas sin ninguna razón más que esa misma característica de hacerlo. Esto se vuelve tedioso al tener que sociabilizar con estas personas o, en el caso de Internet, tener que jugar o leer a estos individuos.\r\n\r\nAlgunos ejemplos de lo que últimamente me provoca esta sensación de odio son: \r\n1. Furries\r\n2.  Otakus\r\n3.  Sadboys/girls\r\n4.  Pseudocientíficos/pseudofilósofos internautas\r\n5.  Moralistas\r\n6.  gente infantil/adolescentes\r\ny por último y de forma extremadamente irónica:\r\n7.  Gente que se queja de todo\r\n\r\n\r\nEn fin, me gustaría que me dieran formas de dejar de sentir tanta intolerancia que termina siendo dañina para el contacto con el resto de personas, ya que yo termino cayendo por lo menos en 2 categorías de las anteriormente mencionadas sin mencionar aquellas otras que no se encuentran. Desde ya, muchas gracias.","replies":[{"poster":"EntrandoEnEsa","date":"2019-09-02T17:33:14.765+0000","up_votes":5,"down_votes":1,"body":"[](https://pbs.twimg.com/media/D9S_ykaXYAA293z.jpg)\nhttps://pbs.twimg.com/media/D9S_ykaXYAA293z.jpg","replies":[{"poster":"Trucy Wright","date":"2019-09-02T20:23:14.442+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EntrandoEnEsa,realm=LAS,application-id=J8qpiO2I,discussion-id=foIPAbZv,comment-id=0001,timestamp=2019-09-02T17:33:14.765+0000)\n>\n> [](https://pbs.twimg.com/media/D9S_ykaXYAA293z.jpg)\n> https://pbs.twimg.com/media/D9S_ykaXYAA293z.jpg\n\nretweet","replies":[]}]},{"poster":"Nabuze","date":"2019-09-02T18:07:09.374+0000","up_votes":2,"down_votes":0,"body":"Podrías intentar hacer algún deporte.\nO comprarte la bolsa de arena y los guantes y darle hasta que te canses(?\n\nPor lo general los deportes sirven para relajarse y levantar el autoestima =w=\n\nAhora no tiene chiste odiar todo porque cada uno tiene sus preferencias tampoco digo que aceptes todo pero solo respeta a los demás para que te respeten de igual forma.","replies":[]},{"poster":"Tenken","date":"2019-09-02T17:40:48.584+0000","up_votes":2,"down_votes":0,"body":"Bueno, por lo que veo, simplemente estás lidiando con las modas de hoy en día; aunque, yo quitaría de esa lista a los Furries y a los Otakus, ya que, aunque el segundo fandom tenga gente con una actitud más toxica e infantil, es simplemente un fandom más.\n\nLo demás es algo con lo que lamentablemente se lidia todos los días, se me viene a la mente una frase que oí hace un tiempo, y es que nadie quiere parecer el \"tonto\" del grupo, por eso hay tanto adolescente y hasta adultos haciendo análisis psicológicos, formando parte del movimiento del momento o usando tecnicismos que ni siquiera saben que significan. Eso es algo bastante popular en estos últimos años.\n\n------------------\n\nAhora, la única forma de lidiar con la intolerancia hacia ciertas cosas (Y con esto, estoy dando mi punto de vista basado en la experiencia); es utilizar tu energía en otras cosas; es decir, pensar en tus prioridades. Después de todo, eso solo depende de ti.\n\n¿Prefieres gastar tu tiempo en responder o mirar conductas que te desagradan, o simplemente pasar de largo y concentrarte en cosas que te ayuden a tu desarrollo, física y/o mentalmente?\n\nSi bien, Internet es un sitio donde cualquiera puede hacer lo que se le da la gana, también es algo que puedes tener a tu favor, que es simplemente ignorar los comentarios, mensajes o temas que te generen algo negativo.\n\nComo alguien con un nivel de estrés alto (Por cosas fuera de Internet, específicamente, el ambiente ruidoso que me rodea), he visto durante un tiempo, consejos que tienen aspectos en común para el desarrollo personal, y una de esas, es alejarse de la toxicidad.\n\nY si hablamos de algo que puedes hacer con tu cuerpo, inmediatamente, es respirar profundo (Puede sonar cliché), mantener el aire durante unos segundos, y después exhalar, si lo haces durante un par de minutos, notarás que te sientes mejor, tus ojos comienzan a lagrimear (Cosa que ayuda para quien tenga ojo seco, yo, para variar) y que hasta te empieza a dar sueño. Así que inténtalo, es posible que te sirva.\n\nOjalá que mi respuesta te ayude en algo, después de todo, la tolerancia es algo que se va construyendo con los años, es parte del aprendizaje.\n\nSaludos y suerte! ( ^ 3^)https://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]},{"poster":"xaxesis","date":"2019-09-02T17:21:33.653+0000","up_votes":2,"down_votes":0,"body":"todo comienza con la respiracion, relajacion, contar hasta 10, tomar agua, etc etc etc. Pero en tu caso mejor ve al psicologo son muchas cosas que odias poco mas y te odias a ti mismo","replies":[]},{"poster":"Meluxg","date":"2019-09-10T00:10:17.609+0000","up_votes":1,"down_votes":0,"body":"Anda al psicologo man","replies":[]},{"poster":"LaReinaPingüino","date":"2019-09-03T00:19:29.747+0000","up_votes":1,"down_votes":0,"body":"Psicólogo y no lo digo en mala, pareces tener demasiado bajo tu nivel de tolerancia. Todos tenemos cosas q nos molestan perocuando nos afectan demasiado y se vuelve un problema ya no es normal y sale mejor buscar ayuda. Una cosa es q te moleste algo pero si está afectando tu calidad de vida... tal vez sea síntoma de otros problemas","replies":[]},{"poster":"Lil Rakjan","date":"2019-09-02T20:04:35.959+0000","up_votes":1,"down_votes":0,"body":"Desintalando Lol","replies":[]}]}