{"poster":"ivictoo","date":"2016-11-22T14:33:50.871+0000","title":"Baneo sin explicacion","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":6,"body":"Bueno me borraron el post en charlas generales ya que lo iba a ver mucha mas gente que aca pero lo republico,espero que sean tan rapidos para responderme la duda como para borrarme el post por estar en un foro erroneo.\r\nBaneo sin explicacion\r\n(ACLARO,antes que nada esta no es mi cuenta principal,tengo miedo que me terminen baneando mi cuenta principal solo porque quieren)\r\n\r\nBueno, vengo a quejarme el foro para que todos vean como de un dia para el otro te pueden banear la cuenta y riot se limpia las manos sin darte la mas minima explicacion,para que vean que te dejan sin nada y ni siquiera se justifican.\r\n\r\nLes cuento,ayer riot me baneo la cuenta, sin dar explicacion , me mandaron un mail diciendo &quot;ciertas acciones en tu cuenta violan los terminos de servicio de league of legends, bla bla bla&quot; en pocas palabras me habian baneado por 14 dias por &quot;ciertas acciones&quot; que ni siquiera explican,resulta que les mando otro mail pidiendoles explicacion y me responden que fue por elo boost &quot;tras una exaustiva investigacion por parte del equipo de soporte de jugador de riot hemos decidido suspender tu cuenta por incurrir en la practica conocida como elo boost&quot; les mande OTRO mail pidiendo explicacion a lo que me respondieron simplemente dandome la explicacion de lo que era el elo boost y no respondiendo como saben que yo supuestamente compre un elo boost.\r\n\r\nSupuse que seria porque tengo mas de una pc y quizas ven que mi cuenta cambia de ip o algo,pero ni me respondieron la mas minima explicacion,\r\nde verdad riot das pena,me baneas por 14 dias y no eres capaz de darme la explicacion de porque segun ustedes me elo boostearon, no me dieron ni una prueba,me da lastima por la gente como yo que no puede hacer nada frente a sus argumentos ridiculos de &quot;tras una exaustiva investigacion por parte del equipo de soporte de jugador de riot hemos decidido suspender tu cuenta por incurrir en la practica conocida como elo boost&quot;\r\n\r\nAsi que aqui va un post mas para mostrar lo que es riot una empresa que no le importan sus clientes y que solo hace lo que quiere, al menos aca en LAS que me imagino que su equipo de riot son 3 monos que estan en la pc y cuando ven que alguien tiene una buena racha de partidas ya tiene que ser elo boost,claro, como los rioters son todos gold si sos mas que ellos ya tenes que ser eloboost,da pena este servidor,asi que ya saben gente, el dia de ma&ntilde;ana les banean la cuenta sin siquiera darles una explicacion y no van a poder hacer nada.","replies":[{"poster":"9081913DEL1","date":"2016-11-22T15:12:43.310+0000","up_votes":4,"down_votes":0,"body":"Riot te puede banear sin motivo, no es que sean hdps, pasa que vos aceptaste eso al crear la cuenta!!!!!\n\nDe ahi en adelante todo crypost por un baneo es nulo. Asi tengas razon no la tenes, porque aceptaste de arranque que asi sea.\n\nTenes otras cuentas en el mismo elo?\nSaludos.","replies":[{"poster":"ivictoo","date":"2016-11-22T15:20:15.598+0000","up_votes":1,"down_votes":4,"body":"de verdad te pueden banear sin motivos? donde dice eso, en las letras chicas donde pongo \"acepto\"?\nla verdad ya no se que esperar de esta empresa rata","replies":[{"poster":"Akusai","date":"2016-11-23T00:47:18.503+0000","up_votes":1,"down_votes":0,"body":"no dice que te pueden banear sin motivos sino que pueden banearte y no decirte el porque ni siquiera avisarte de antemano nada. Oviamente motivos hubo pero si es por eloboost nunca te van a decir como porque si alguien sabe la forma mas facil va a ser burlarla.","replies":[]}]}]},{"poster":"Lomby","date":"2016-11-22T14:39:50.684+0000","up_votes":2,"down_votes":1,"body":"Son asi, no hay con que darle.\n\nsuerte.","replies":[{"poster":"ivictoo","date":"2016-11-22T14:41:29.509+0000","up_votes":1,"down_votes":2,"body":"Es una pena LAS, solamente en este servidor nos tratan asi.","replies":[]}]},{"poster":"Exit","date":"2016-11-23T01:19:08.698+0000","up_votes":1,"down_votes":0,"body":"banea4","replies":[]},{"poster":"Rapperrr","date":"2016-11-22T14:39:30.408+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/k2RpesYI-ola-de-suspensiones-por-eloboost","replies":[{"poster":"ivictoo","date":"2016-11-22T14:42:05.193+0000","up_votes":1,"down_votes":1,"body":"no quiero faltar el respeto ni parecer agresivo, pero acaso leiste el post? ya me pasaron eso cuando mande ticket,no entiendo en que me ayudas.","replies":[{"poster":"Rapperrr","date":"2016-11-22T14:51:23.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ivictoo,realm=LAS,application-id=PJAKt7ph,discussion-id=wGLkUdwL,comment-id=00020000,timestamp=2016-11-22T14:42:05.193+0000)\n>\n> no quiero faltar el respeto ni parecer agresivo, pero acaso leiste el post? ya me pasaron eso cuando mande ticket,no entiendo en que me ayudas.\n\nQue es un nuevo sistema y puede ser delicado quizas le prestaste 1 sola ves la cuenta a un amigo para que juegue o pruebe algo y pum te cayo el ban","replies":[{"poster":"ivictoo","date":"2016-11-22T15:05:28.195+0000","up_votes":1,"down_votes":1,"body":"No la preste amigo, ni la pienso prestar ni nadie sabe mi contraseña,y a menos que riot tenga pruebas para probar lo contrario no pueden banearme solo porque les parece, es ridiculo, es como si mañana viene un juez y te dice,a la carcel por 10 años , preguntas porque y te dice porque violaste una ley y listo nada mas.","replies":[]}]}]}]},{"poster":"Salvor","date":"2016-11-22T14:38:05.333+0000","up_votes":1,"down_votes":0,"body":"Los rioters no son golds, la mayoría bronce y plata como la comunidad xD","replies":[{"poster":"ivictoo","date":"2016-11-22T14:40:26.835+0000","up_votes":1,"down_votes":2,"body":"Da PENA, PENA da este servidor, no me lo puedo creer .","replies":[]}]},{"poster":"benjaminlolxzxzx","date":"2016-11-22T14:39:05.129+0000","up_votes":1,"down_votes":1,"body":"Tenes toda la razon, ojala te ayuden amigo","replies":[]}]}