{"poster":"Dam Its Rengar","date":"2015-02-09T16:54:17.686+0000","title":"[Idea de Campeón] Fafnir, las Cadenas de la Opresión","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":3,"body":"**Aviso importante: Este concepto es uno de todos los 10 conceptos (incluyendo a Daziel) que tengo y que además son viejos. He dicho que este sería mi último concepto, pero... La verdad, algo me animó a volver a hacer conceptos, y por esa misma razón, mi concepto mas recientemente hecho/publicado (Daziel, el Traidor, hace 4 días), está aquí mismo en el subforo de Creaciones de la Comunidad. :)\r\nLa verdad es que me animé a publicar mis demás conceptos olvidados en el nuevo foro... Y esos viejos conceptos están todavía en el viejo foro, así que creo que ahora ya tendrán \"respondidas\" sus dudas acerca de algo que he dicho en mi concepto de Daziel el Traidor, de que yo tenía otros conceptos más.\r\nFafnir, fue el \"último\" concepto que he dicho que iba a hacer, pero no fue así. Algo me animó a volver a hacer conceptos, así que... :)\r\nAdemás, creo que después voy a publicar mis demás conceptos, pero no lo sé. Algunos de ellos no recibieron tantos votos positivos en el viejo foro, así que podría decirse que esos mismos conceptos no los publicaré. En fin, empecemos ;) (Y tambien, quiero aclarar que este concepto no tiene Lore aún, y me es difícil pensar en un Lore apropiado para este tipo de Campeón. Por cierto, el concepto es original, o sea, no se le ha realizado cambios todavía. Así que si algo necesita ser \"nerfeado\" o bien equilibrado, agradecería que me lo dijeran en la sección de comentarios.**\r\n\r\nFafnir, Las Cadenas de la Opresión (Pueden darme ideas de nombre, ya que Fafnir no me gusta. Y no puedo pensar en un nombre apropiado)\r\nRol Primario: Luchador\r\nRol Secundario: Tanque\r\nPoder de Ataque: 6/10\r\nPoder de Defensa: 5/10\r\nPoder de Habilidad: 3/10\r\nDificultad: 6/10\r\n\r\nEstadísticas:\r\n\r\nVida: 467 (+84 por nivel)\r\nRegeneración de Vida: 6.1 (+0.65 por nivel)\r\nManá: 207 (+51 por nivel)\r\nRegeneración de Maná 4.3 (+0.55 por nivel)\r\nDaño de Ataque: 50 (+3.07 por nivel)\r\nArmadura: 23 (+3.7 por nivel)\r\nResistencia Mágica: 30 (+0 por nivel)\r\nVelocidad de Ataque: 0.662 (+2.68 por nivel)\r\nVelocidad de Movimiento: 340\r\n\r\nTipo de Ataque: A distancia (alcance 525)\r\nTipo de Arma: Hojas Rayas, o mas bien, unas como estas:\r\nhttp://www.gamer.ru/system/attached_...-black-700.jpg\r\n\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nHabilidades:\r\n\r\nPasiva:\r\nSello de Opresión\r\n70/80/90/100 segundos de enfriamiento\r\n\r\nPasiva: Siempre que esta habilidad no esté en enfriamiento, cada vez que Fafnir muera dejara marcado en el lugar de su muerte (antes de morir) un sello especial que durara solo 25/35/45/65 (En los niveles 1/6/11/16) segundos. Al ser marcado el sello, Fafnir puede activar la habilidad dándole doble click izquierdo solamente después de reaparecer en la plataforma.\r\n\r\nActiva: Con un retraso de 4.5/4/3.5/3 (dependiendo del nivel de la habilidad definitiva de Fafnir) segundos, Fafnir vuelve inmediatamente al lugar de su muerte pero a cambio, después de trasladarse, Fafnir quedará inmovilizado durante 2 segundos, aunque no podrá ser atacado durante ese tiempo. Después de la inmovilización, Fafnir será apresado por sus cadenas, perdiendo durante 7 segundos un 8% de su vida máxima pero ganando una bonificación de infligir la misma cantidad de su vida máxima perdida como daño mágico adicional contra su asesino. Este efecto se mantiene durante 14/21/28/35 segundos (en los niveles 1/6/11/16).\r\n\r\nAdemás, los enemigos cercanos a un radio de 600 del sello tendrán un signo de exclamación arriba indicando que Fafnir está usando esta habilidad.\r\n\r\n\r\nOpresión Gobernante/Reino de Opresión (Q)\r\n\r\nOpresión Gobernante:\r\n3/2.75/2.5/2.25/2 segundos de enfriamiento\r\nCosto: 15/18/21/24/27 maná\r\nTipo de Habilidad: Sin objetivo\r\nAlcance: 725\r\n\r\nPasiva: Cada vez que la habilidad golpee a un campeón enemigo, ese campeón recibirá una acumulación de \"Opresión Inminente\" hasta un máximo de 3 acumulaciones. A las tres acumulaciones de \"Opresión Inminente\", el campeón enemigo afectado queda inmovilizado en su posición durante 1.75 segundos y luego de la inmovilización, si recibe otro golpe de la habilidad en un plazo de 3 segundos, se reiniciaran las acumulaciones de \"Opresión Inminente\" y ganará una acumulación de \"Opresión Tiránica\", con lo que con cada otro golpe subsiguiente después del primero y después de ser inmovilizado ganará otra acumulación, hasta un máximo de 3 acumulaciones de \"Opresión Tiránica\".\r\n\r\nLas acumulaciones de Opresión Inminente duran 4.5 segundos.\r\n\r\nActiva: Las hojas de Fafnir son liberadas y giran en 180° (cada hoja) alrededor de un radio de 725 a Fafnir y infligiendo cada una 15/30/45/60/75 (+20% Daño de Ataque) de daño mágico y aplicando una acumulación de \"Opresión Inminente\". \r\n\r\nLas hojas pueden golpear a una cantidad ilimitada de objetivos, pero no se aplica a los campeones, es decir, un mismo campeón enemigo que haya sido golpeado por una hoja no puede ser golpeado por la otra. El efecto no se aplica a los monstruos y súbditos.\r\n\r\nReino de Opresión\r\n----- segundos de enfriamiento\r\nCosto: -----\r\nTipo de Habilidad: Pasiva\r\nAlcance: -----\r\n\r\nEste efecto SOLO se aplica junto a Opresión Gobernante, pero SOLO reemplaza a los efectos provocados en los enemigos golpeados por la habilidad después de haber sido inmovilizados.\r\n\r\nPasiva: Cualquier campeón enemigo que tenga 3 acumulaciones de \"Opresión Tiránica\", le aparecerán unas hojas-rayas mágicas alrededor de su cuerpo que lo suprimirán y lo harán sangrar por 15/25/35/45/55 (+90% Daño de Ataque) de daño mágico a lo largo de 4 segundos, además lo harán incapaz de realizar ataques básicos durante 1.75 segundos y recibirá 3/6/9/12/15% mas daño de los golpes subsiguientes de la habilidad Opresión Gobernante. La duración de las acumulaciones de \"Opresión Tiránica\" es de 2.25 segundos.\r\n\r\nAunque, la habilidad Opresión Gobernante SOLO tiene un numero limite de golpes consecutivos hacia un mismo objetivo, y después de que ese enemigo reciba el limite máximo de golpes consecutivos permitidos de la habilidad, no podrá volver a ser afectado por la habilidad durante un tiempo.\r\n\r\nLimite de Golpes: 7/8/9/10/11 Tiempo de invulnerabilidad a la habilidad: 30/25/20/15/10\r\n\r\n\r\nOpresión Inerrable (W)\r\n23/21.5/20/18.5/17 segundos de enfriamiento\r\nCosto: 70/70/70/70/70 maná\r\nTipo de Habilidad: Punto objetivo\r\nAlcance: 525\r\n\r\nFafnir usa sus cadenas para crear en el punto objetivo un muro de cadenas mágicas impasable que, además de impedir que los enemigos pasen por ella, bloquea un numero limitado de proyectiles enemigos y que dura 4 segundos. Además, si el muro es destruido al bloquear el limite permitido de proyectiles, las hojas de Fafnir se debilitaran, reduciendo el daño infligido por sus ataques y habilidades en un 30/27.5/25/22.5/20% durante 5 segundos.[/B]\r\n\r\nLongitud del Muro: 300/375/450/525/600 Limite de proyectiles bloqueados: 2/3/4/5/6\r\n\r\n\r\nCadenas de Protección (E)\r\n30/28/26/24/22 segundos de Enfriamiento\r\nCosto: 40/40/40/40/40 maná\r\nTipo de Habilidad: Activación\r\nAlcance: -----\r\n\r\nPasiva: Cuando Fafnir tiene mas de 150 armadura, las hojas de Fafnir se reforzarán y le otorgaran pasivamente a Fafnir un efecto que siempre que Fafnir vaya a recibir un golpe critico, el daño total que recibirá Fafnir por el golpe se reducirá en un 10/20/30/40/50% y devolverá al atacante la mitad del daño total negado en daño mágico.\r\n\r\nCuando Fafnir tenga sus hojas debilitadas, la reducción de daño bajará a 5/10/15/20/25%.\r\n\r\nActiva: Durante 3/4/5/6/7 segundos, Fafnir recibe un efecto que reduce todo el daño mágico y físico que reciba en un 6/12/18/24/30% a cambio de perder un 20% de su daño de ataque total mientras dure.[/B]\r\n\r\n\r\nCaos Tiránico (R)\r\n110/100/90 segundos de enfriamiento\r\n100/100/100 maná\r\nTipo de Habilidad: Activación\r\nAlcance: -----\r\n\r\nEsta habilidad puede ser aprendida en el nivel 1, por lo que no se necesita un punto de mejora. Aunque, en nivel 1 esta habilidad no puede ser activada.\r\n\r\nActiva: Fafnir usa todo el poder de sus cadenas, y mientras tanto durante 11 segundos, Fafnir tendrá dos nuevas hojas-rayas y estas girarán en torno al cuerpo de Fafnir, protegiendolo. Durante este tiempo, todo tipo de daño dirigido a Fafnir será devuelto a su atacante, pero el daño será reducido en 50%. Además, mientras dure la activación, las hojas de Fafnir no se debilitarán con el efecto de su habilidad \"Opresión Inerrable\", y además los efectos de las acumulaciones \"Opresión Tiránica\" de su habilidad \"Opresión Gobernante\" aumentarán en 30/40/50%. También, mientras dure, la habilidad infligirá 30/50/70 (+25% Poder de Habilidad) de daño mágico por segundo a todos los enemigos que estén cerca a Fafnir en un radio de 250.\r\n\r\nAdemás, al final de la duración de la habilidad, las hojas giratorias de Fafnir se dispersaran y infligirán desde 75/125/175 (+20% Daño de Ataque) a 150/250/350 (+40% Daño de Ataque) de daño mágico a todos los enemigos alrededor en un radio de 650. El daño depende de cuanta vida les quede.\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nAcepto criticas de cualquier tipo. También, espero que comenten vuestras opiniones si es que tienen alguna. ;)","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T18:22:36.287+0000","up_votes":2,"down_votes":0,"body":"No lo leí todo por fiaca xD creo que hay que manejar bien las pasivas (Operación X) para saber cuando tirar cada habilidad y causar mas daño, al mismo tiempo de ir acumulando marcas. Me suena mas a mujer que a hombre, no se xD respecto al nombre, un nombre mas raro, le quedaría mejor, aunque con cambiar de lugar algunas letras creo que bastaría (Por ejemplo, Fanlier, aunque me vino a la cabeza \"Nirvelia\", estoy loca, lo se xD)\nSaludos ! {{champion:89}}","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T18:29:44.024+0000","up_votes":1,"down_votes":1,"body":"Jaja. De hecho, lo que pasa es que tienes razón con lo de saber cuando tirar cada habilidad. Por eso mismo, la dificultad podría ser mayor a 6 xD. Jaja es que originalmente lo tuve pensado como hombre... mujer no sé, no creo que venga bien jaja... \n\nSobre el nombre, lo que pasa es que durante la creación de este concepto, no pude pensar en un mejor nombre y lo único que se me vino a la mente fue Fafnir. Jaja creo que estas un poquito loca (? jeje. Igual, gracias por sugerir un nombre ^^\n\nSaludos también {{champion:201}}","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T18:35:28.859+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Starkyller,realm=LAS,application-id=J0mxKtkB,discussion-id=sAhdLwpH,comment-id=00010000,timestamp=2015-02-09T18:29:44.024+0000)\n>\n> Jaja. De hecho, lo que pasa es que tienes razón con lo de saber cuando tirar cada habilidad. Por eso mismo, la dificultad podría ser mayor a 6 xD. Jaja es que originalmente lo tuve pensado como hombre... mujer no sé, no creo que venga bien jaja... \n> \n> Sobre el nombre, lo que pasa es que durante la creación de este concepto, no pude pensar en un mejor nombre y lo único que se me vino a la mente fue Fafnir. Jaja creo que estas un poquito loca (? jeje. Igual, gracias por sugerir un nombre ^^\n> \n> Saludos también {{champion:201}}\n\nJeje, claro... poquito... okno :v xDD\nCuando leí cadenas de la oprecion se me vino en mente alguien parecida a syndra, oscuro y con ese toque tan kawaii que tiene. Pensé en mujer porque hombre es como que no me lo imagino xD \nY si, tengo complejo de imaginar todo en anime eue \n\nSaludos para ti también {{champion:134}}","replies":[{"poster":"Dam Its Rengar","date":"2015-02-28T16:53:56.045+0000","up_votes":1,"down_votes":0,"body":"Por cierto, Nakomy, no sé si podrías ayudarme pero...\n\nDe verdad te agradecería si me pudieras hacer 2 dibujos de 2 de mis campeones, los cuales quiero publicarlos en NA, y en NA hay mas posibilidades de que un concepto pueda ser visto por un Rioter si tiene un dibujo/splash art de como podría verse/ser. \n\nNo lo sé realmente, pero igual... te lo agradecería mucho. Ambos que quiero publicar son: Daziel el Traidor y Zanir la Espada Llameante. No sé si has visto el de Zanir, pero igual... por favor te lo pido c:\n\nEs lo único que te pido con sinceridad... aunque de verdad me molesta pedir dibujos sin nisiquera tener un boceto o una descripción de como debería ser. \n\nI hope you reply this. \n\nSaludos {{champion:201}}","replies":[]},{"poster":"Dam Its Rengar","date":"2015-02-09T18:38:50.715+0000","up_votes":1,"down_votes":0,"body":"Jaja es que de hecho \"las\" puede ser muy distinto, tal como en el caso de Varus, el cual su subnombre es La flecha de la perdición (o no me acuerdo bien) xd\nJaja supongo (?\n\nSaludos igualmente {{champion:104}}","replies":[]}]}]}]},{"poster":"Altare","date":"2015-02-12T20:01:20.244+0000","up_votes":1,"down_votes":0,"body":"Sos el único que hace las sugerencias perfectamente y muchos saltan a hacer bardo, me gusto el campeon. Sería algo tipo Cratos pero con el pelo sedoso de Udyr :o","replies":[{"poster":"Dam Its Rengar","date":"2015-02-12T23:57:49.418+0000","up_votes":1,"down_votes":0,"body":"Gracias ^^ \nLo que sé es que siempre hay gente diferente, gente con preferencias, etc. Por eso, si a alguien no le gusta una sugerencia, sea diferente o ideada de otra sugerencia, pues no les gusta. \n\nQue bueno que te haya gustado :)","replies":[]}]},{"poster":"Nakomy Gird","date":"2015-02-09T18:48:52.719+0000","up_votes":1,"down_votes":0,"body":"Hay muchos cambios en Las, mas con los campeones que son de cierta cosa, o tienen cierta cualidad, y enseguida la comunidad lo cambia xD (Taric y Ezreal, (Ezreal es solo mio, okno)) \nMe gusto mucho igual la idea del campeón, de echo, parece como un pricionero de la oscuridad (Dat novelista (pero si no veo novelas xDDD)) y podría tener mas facilidades de diseño y logre lore en caso de ambos sexos (Quizá si fuera mujer, tendría un lore mas bien triste y de dolor por pérdidas \"amorosas\", y si fuera hombre con un sentimiento mas oscuro y de venganza, algo así como Varus) (Por cierto la skin de varus esta zukiztrukiz xD)\n\nSaludos {{champion:16}}","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T18:59:37.058+0000","up_votes":1,"down_votes":0,"body":"{{champion:110}}  Buscacorazones y {{champion:44}}  Armadura de la Quinta Era = El nuevo duo bot perfecto. xD\n\n{{champion:81}}  ha sido engañado (?","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T19:09:29.916+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Starkyller,realm=LAS,application-id=J0mxKtkB,discussion-id=sAhdLwpH,comment-id=00020000,timestamp=2015-02-09T18:59:37.058+0000)\n>\n> {{champion:110}}  Buscacorazones y {{champion:44}}  Armadura de la Quinta Era = El nuevo duo bot perfecto. xD\n> \n> {{champion:81}}  ha sido engañado (?\n\nEl rubio necesita una skin de Busca corazones :v\n(Pd: me estoy quedando sin batería en la tablet y dentro de un ratito mi hermano deja la pc xD si me oudes mandar el concepto de Daziel lo iré dibujando)\n\nSaludos {{champion:16}}","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T19:19:59.473+0000","up_votes":1,"down_votes":0,"body":"Emm como así? xD\n\nSaludos ewe'","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T19:30:17.425+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Starkyller,realm=LAS,application-id=J0mxKtkB,discussion-id=sAhdLwpH,comment-id=0002000000000000,timestamp=2015-02-09T19:19:59.473+0000)\n>\n> Emm como así? xD\n> \n> Saludos ewe'\n\nMe refiero a que si me dibujas un boceto de al menos su posición, algo como la imagen sin ningún detalle, solo el contorno (Cabeza, brazos, piernas, torsi, etc) sin NINGUN detalle cuando mi hermano salga de la PC lo voy dibujando (Como lo que hise con Yhu'Rath) además así no pierdes mucho tiempo ;) para mandarmelo publica en un comentario o crea otro post que diga que es el diseño de daziel sin terminar y eso xD\n\nSaludos!","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T19:45:53.000+0000","up_votes":1,"down_votes":0,"body":"Ahh ya entendí xD.\n\nLo que pasa es que, aún no he podido pensar en como podría ser. Me es difícil pensar en como podría ser un desterrado, además de que sea diferente a Yasuo. También, me es más difícil debido a que usa dagas, y los asesinos de verdad usan dagas, además de una posición de combate como la de Katarina. Y según recuerdo, hay películas en las que los asesinos son de aspecto sombrío y oscuro, principalmente con una mirada de desprecio. \n\nSobretodo, tampoco sé si Daziel debería ser un Ninja o un Samurai, pero igual... Mira, creo que esto puede ayudar con el dibujo: http://cinescopia.com/los-heroes-y-heroinas-mas-rudos-del-cine-segun-el-arquicruz-primera-parte/2014/06/\n\nSolo mira al primero (Raizo, de la película Asesino Ninja), aunque de hecho da mucho de lo que pensar siendo que Daziel usa dagas.","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T20:07:40.348+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Starkyller,realm=LAS,application-id=J0mxKtkB,discussion-id=sAhdLwpH,comment-id=000200000000000000000000,timestamp=2015-02-09T19:45:53.000+0000)\n>\n> Ahh ya entendí xD.\n> \n> Lo que pasa es que, aún no he podido pensar en como podría ser. Me es difícil pensar en como podría ser un desterrado, además de que sea diferente a Yasuo. También, me es más difícil debido a que usa dagas, y los asesinos de verdad usan dagas, además de una posición de combate como la de Katarina. Y según recuerdo, hay películas en las que los asesinos son de aspecto sombrío y oscuro, principalmente con una mirada de desprecio. \n> \n> Sobretodo, tampoco sé si Daziel debería ser un Ninja o un Samurai, pero igual... Mira, creo que esto puede ayudar con el dibujo: http://cinescopia.com/los-heroes-y-heroinas-mas-rudos-del-cine-segun-el-arquicruz-primera-parte/2014/06/\n> \n> Solo mira al primero (Raizo, de la película Asesino Ninja), aunque de hecho da mucho de lo que pensar siendo que Daziel usa dagas.\n\nCuando lei la historia de Daziel me lo imaginaba como Cloud pero con dagas xD Voy a tratar de hacerlo lo mas \"asesino despiadado\" posible xD\nSaludos!\n\nPd: Ya estoy en la PC xD","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T20:10:11.773+0000","up_votes":1,"down_votes":0,"body":"Cloud de FFVII? Jaja :D xD\nJeje vale :) Y sobretodo, gracias por querer ayudarme con el dibujo para mi concepto :D\n\nPD: Cuando te logees al LoL acepta mi solicitud xD","replies":[{"poster":"Nakomy Gird","date":"2015-02-09T20:17:36.667+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Starkyller,realm=LAS,application-id=J0mxKtkB,discussion-id=sAhdLwpH,comment-id=00020000000000000000000000000000,timestamp=2015-02-09T20:10:11.773+0000)\n>\n> Cloud de FFVII? Jaja :D xD\n> Jeje vale :) Y sobretodo, gracias por querer ayudarme con el dibujo para mi concepto :D\n> \n> PD: Cuando te logees al LoL acepta mi solicitud xD\n\nSi xDD para darle un toque mas kawaii xD aunque tendre que darle una mirada mas fria para captar mas al campeon >.<\nAhora estoy ayudando con la skin de Nami Veraniega, cuando la termine o me aburra me logueo xD\nSaludos!","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T20:24:01.911+0000","up_votes":1,"down_votes":0,"body":"Ahh xD y jaja vale :)\nJaja está bien :D \n\nSaludos {{champion:201}}","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"KniveZ1401","date":"2015-02-09T17:39:22.478+0000","up_votes":1,"down_votes":0,"body":"Me suena a anime fafnir","replies":[{"poster":"Dam Its Rengar","date":"2015-02-09T17:43:35.990+0000","up_votes":1,"down_votes":0,"body":"No sé, yo no conozco animes en donde haya algún personaje que se llame Fafnir.\n\nPero igual, he dicho que no me gusta el nombre, por lo que dije también que pueden darme sugerencias de nombres.","replies":[]}]}]}