{"poster":"Clostridium","date":"2016-01-04T17:18:32.040+0000","title":"No diré que siempre es así, pero si te flamean es por algo el 90% de las veces por decir un número.","subforum":"Charlas Generales","up_votes":2,"down_votes":24,"body":"Mirando la gente que siempre se queja del famoso flameo que yo tb cometo en ocasiones he notado que mucha gente reclama el flameo el acoso es que que son tan toxicos etc etc etc.\n\nDe hecho a mi tb me flamean y jamas me quejo de la toxicidad que me pegan porque casi siempre es porque la estoy vendiendo, poco me flamean la verdad porque suelo sacar buenos scores, si sacas buenso scores creeme no te flamearan, y asi lo veo todos los d&iacute;as que juego.\n\nLo peor es que los que mas se quejan del famoso flameo son los primeros en joder al jg y en sacar scores malos; no puedes decir que la comunidad es flamer si te metes a rankear y el 80% de las veces te tienen que carrear; cuando tomas las mejores lineas y sales reiteradamente con scores negativos o cuando es evidente mirando tu historial que sacas malos resultados osea de tus 20 partidas en historial tienes 18 con scores negativos y esperas que no te flameen osea p&eacute;gate la ubicada. \n\nY esto es como conclusi&oacute;n si te viven flameando es por algo, y miralo con un ejemplo somple si estas trabajando en ventas por poner un ejemplo y te mandan 20 clientes y 18 se quejan de tu atencion hay algo raro no?.\n\nEso si vas a jugar ranked la gente quiere ganar no jugar 100% por diversi&oacute;n si quieres solamente divertirte y jugar como se te plasca ten presente que te van a flamear es evidente jodes el tiempo y la cuenta de otra persona y para eso aparte estan las normales.\n\nAhora yo flamer toxicos de la nada y sin ninguna motivacion creo que un mes he visto solo uno y creo que lo reporte, pero la gran mayoria de LOS FLAMEO ES A GENTE JUEGA MUY PERO MUY MAL BORDEANDO YA LO OFENSIVO, y si despues miro su historial todo me calsa el tipo de queja del flameo porque realmente lo retan en todas las partidas.\n\nConclusion si mejoras tu juegas y rankeas bien y sacas scores decentes creeme que te flamearan MUY MUY MUY POCO.\n\nAhora el flamep sirve NO!!!, pero pa que andamos con cosas hay partidas que uno sabe que por nivel de juego de tu team no ganaras ni con las mas buena onda posible y te dedicas a sacar un poco de score y por ultimo flameas poco jajajajajaj","replies":[{"poster":"Sir DaL","date":"2016-01-04T17:56:50.319+0000","up_votes":17,"down_votes":1,"body":"No necesariamente Clostridium, para empezar, tengas o no la culpa, **nada justifica al flameo**, es una descarga que no aporta nada y es reportable.\nHay veces, que independientemente de tu score, las manos te fallan en una jugada, o simplemente tomas una decision incorrecta.\n\nLlegado el caso hay 2 caminos que tu compañero puede tomar:\n- El flameo (incorrecto ya que probablemente lo reportes, y genera una mala experiencia)\n- El comentarte amablemente que, según tu punto de vista, se puede mejorar o evitar realizando X acción (es una buena experiencia, le enseñas algo, y no recibirás un reporte o respuesta agresiva)","replies":[{"poster":"Chillout","date":"2016-01-04T18:19:44.658+0000","up_votes":2,"down_votes":1,"body":"Juego desde la temporada 2 y nunca pude subir de bronce porque aparte de que no tengo el nivel, ocasionalmente me toca gente flamer etc.\nAHORA:\n\n1 Flameando no ganas nada, es mas te distraes escribiendo.\n2 El que flamea seguramente se quede en la misma liga en la que esta\n3 Para algo esta el report\n4 Hay un boton de mute\n5 El 90% de las personas son buenos jugadores (en el sentido de no flamear etc) 1 jugador de cada 10 (sino menos) es el toxico, lo digo para que no empiezen con que la comunidad es mala y que se yo porque los otros 9 no se merecen el cartelito de \"la comunidad de las es un asco\". \n\n{{summoner:13}}","replies":[{"poster":"CA LautaroG20","date":"2016-01-04T19:25:52.502+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Solari22,realm=LAS,application-id=v7qsfXsE,discussion-id=2OBYFhK7,comment-id=00010000,timestamp=2016-01-04T18:19:44.658+0000)\n>\n> Juego desde la temporada 2 y nunca pude subir de bronce porque aparte de que no tengo el nivel, ocasionalmente me toca gente flamer etc.\n> AHORA:\n> \n> 1 Flameando no ganas nada, es mas te distraes escribiendo.\n> 2 El que flamea seguramente se quede en la misma liga en la que esta\n> 3 Para algo esta el report\n> 4 Hay un boton de mute\n> 5 El 90% de las personas son buenos jugadores (en el sentido de no flamear etc) 1 jugador de cada 10 (sino menos) es el toxico, lo digo para que no empiezen con que la comunidad es mala y que se yo porque los otros 9 no se merecen el cartelito de \"la comunidad de las es un asco\". \n> \n> {{summoner:13}}\n\nUno diría \"ignóralos\" \"mutealos\" pero en mi experiencia si no les haces caso carrearan a tu equipo a la derrota... (Se convierten en feeders) esa sensación de querer ayudar y que por culpa de 1 no puedas... Si, esa sensación es la que te da un flammer.... Veo que eres algo veterano en esto... ¿Qué debo hacer si no quiero perder por culpa de un flammer? \n\nCualquier cosa me sirve :(","replies":[{"poster":"Chillout","date":"2016-01-04T20:35:23.826+0000","up_votes":1,"down_votes":0,"body":"Ninceramente no me siento QUIEN para darte consejos, soy otro como los demas, tambien mientras juego me caliento con el que esta feedeando/flameando/akf. Pero hace bastante que juego ranked (400 por temporada aprox) y trato de dodgear cuando veo que va a haber alguien que va a flamear, Si hay un flamer le digo a mi equipo que lo mutee y trato de ayudarlo, al no recibir feedback porque esta muteado no te molesta lo que te diga, y por ultimo saber antes de entrar a cualquier partida 2 cosas. La primera es que no todas las partidas se pueden ganar. Hay un 10% (segun mi opinion) que son imposibles 40% remontables 50% Win. Y la segunda es que LAMENTABLEMENTE 1 de cada 10 jugadores es flamer/toxico/afk. \n\nYo siempre digo lo mismo, a mi no me molesta un jugador 0/10 con ganas de ganar, me molesta un 5/0 que cuando alguien se muere empieza GG chau report etc. Al 0/10 lo podes ayudar. Al 5/0 no.\n\nOjala te sirva mi escaza experiencia. A mi me llevo de BV a B1 en esta temporada.  {{summoner:31}}","replies":[]}]}]},{"poster":"ZeNch","date":"2016-01-04T23:33:56.926+0000","up_votes":1,"down_votes":0,"body":"oh sir dal, un honor verte denuevo, ya estab celoso viendo respuestas tuyas en lan y nada x aca {{item:2054}}  (esta es diet seguro que entre las vacasiones y las fiestas la necesitas) =D","replies":[]}]},{"poster":"JACKY FANBOY","date":"2016-01-04T17:21:31.665+0000","up_votes":2,"down_votes":1,"body":"El flameo no esta permitido cual sea la circunstancia,es un juego para divertirse\nme salen trolls, afks y gente que no tiene una buena partida\n¿que hago?\nTroll: me rio con ellos (pero no trolleo), solo me dan risa\nAfk: hago cosas que no haria en otras partidas, pruebo builds,    jugadas\nGente que tiene una mala partida: lo animo para que siga jugando, lo gankeo y le ayudo a ganar linea\n\nen lo personal (99%) el flamer es el \"main\" riven, vayne o yasuo que se tira 1 vs 5 y flamea al resto por no seguirlo","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T17:25:15.026+0000","up_votes":2,"down_votes":0,"body":"los que no flammean son los main Illaoi que se tiran 1vs5 y se solea a los 5 xD\nno, pero es cierto, la mayoria de los mains vayne, riven o yasuo son muy flammers .-.\naguante Azir vieja {{champion:268}}","replies":[{"poster":"JACKY FANBOY","date":"2016-01-04T18:52:00.859+0000","up_votes":1,"down_votes":0,"body":"Aguante thresh Mami","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T21:00:06.405+0000","up_votes":1,"down_votes":0,"body":"maineo Tresh, pero me gusta Azir tambien xD","replies":[]}]}]},{"poster":"Clostridium","date":"2016-01-04T17:24:33.279+0000","up_votes":1,"down_votes":4,"body":"Tu concepto esta bien pero en mi liga el 99% de la veces las riven y los yasuos son fatales de malos y tb los flamena a ellos y mucho  SOBRE TODO A LAS RIVEN; que a menos sean smurf lo que se nota mucho, porque so no lo son pecan de ser malisimas.\n\nCreo que en mi liga plata lo peor es siempre: lee sin, riven, teemo, yasuo y zed que we..... mas malos y cuando son buenos se nota mucho el eloobost a la cuenta. \n\nRARA VES ESTOS CHAMP SON BUENOS USADOS POR UN PLATA DE VERDAD JAJAJAJAJAJ","replies":[{"poster":"Jian","date":"2016-01-04T17:44:17.764+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"IVO723","date":"2016-01-04T20:41:14.135+0000","up_votes":1,"down_votes":0,"body":"te olvidaste de los zed q trollean si les va mal :D","replies":[]},{"poster":"Clostridium","date":"2016-01-04T17:48:46.542+0000","up_votes":1,"down_votes":1,"body":"Dije que eran malos en plata y que siempre lso flamean","replies":[{"poster":"CA LautaroG20","date":"2016-01-04T19:33:09.842+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Clostridium,realm=LAS,application-id=v7qsfXsE,discussion-id=2OBYFhK7,comment-id=0000000000000000,timestamp=2016-01-04T17:48:46.542+0000)\n>\n> Dije que eran malos en plata y que siempre lso flamean\n\nYo juego Riven y Teemo pero por diversión... Sinceramente se lo malo que soy con ambos y, sin embargo, me gusta practicar... Siempre he oído eso de que las riven y vayne son flammer... Pero, en lo personal jamás tuve la oportunidad de ver una riven o vayne flammer, es más...\n\n\nSe me hace tan raro que me lo tomo en broma... Cuando me emparejan con flammers he llegado a decir: He, yo soy el que usa a riven, déjame el flammeo a mi (solo de broma.... Todos los flammers que leyeron eso se enojaron más :v)\n\nQuizás, tuve suerte... Pero mi mejor amigo es main vayne y, si bien no siempre juego con el, no es de flammear en sus emparejamientos...\n\nCreo que tuve suerte pero, sin embargo, también creo que depende más de la persona... (He visto a miles de personas flammear cuando perdían y decir en /all \"Reporten a mi shaco, solo gankeo en early luego no más\" o \" reporten a mi yasuo no me salvó con el muro cuando lux tiro últi\" y si, la última me ha tocado)\n\nBueno... No tengo nada más que decir... \n\nSuerte =D","replies":[]}]}]}]}]},{"poster":"LMDF 3MP3R4D0R","date":"2016-01-04T18:23:06.334+0000","up_votes":2,"down_votes":1,"body":"todos tienen derecho a jugar ranked, de ultima el q te empareja con gente mejor q vos es el sistema, asi q no hay ninguna excusa para bardear al q le esta yendo mal. los q si son \"flameables\" son los degenerados q entran para arruinar la experiencia de otros, esos q dicen q no les importa ganar o q quieren hacer perder a otro por considerarlos malos y demas. lo unico q se puede hacer si se ponen densos con el chat es mutear a todo el mundo y jugar lo mejor q se pueda, o ir a jugar a un juego de a 1 solo si no sos capaz de entender q la gente suele portarse como idiota y sobre todo si esta atras de una computadora jaja.","replies":[]},{"poster":"N1725","date":"2016-01-04T20:35:30.332+0000","up_votes":1,"down_votes":0,"body":"Lo mejor es no perder tiempo ni concentración escribiendo y seguir jugando nomas.\nSino el chat se convierte en una discusión sin sentido","replies":[]},{"poster":"Galiers","date":"2016-01-04T18:26:32.334+0000","up_votes":1,"down_votes":0,"body":"naaaaa \n\nadc se come el gancho de blitz/thresh -> muere -> flamea al sup \ncarri no backea con baja vida -> llega jg enemigo lo mata -> flamea  a su jg o al sup\nadc tiene 2 cargas en su trinket de wards -> lo gankean por no tener visión -> flamea al sup por no poner wards (estando los 3 wards del sup puestos)\nle tiras todo a tu adc (escudos, heals, items, etc) -> pelea estatico, no se mueve y muere -> culpa al sup por no hacerle peel\nX linea hace focus al sup o tanke mientras el carrie enemigo lo hace bolsa -> flamea al sup o al que tenga al lado por no ayudarlo con la kill\ncomo sup tiras todo tu kit de habilidades y unos basicos -> te llevas el kill -> adc flamea por KS estando en 5 de hp\nx linea tiene pusheado y lo campean a cada rato -> flamea al jg por no ayudarlo","replies":[{"poster":"CA LautaroG20","date":"2016-01-04T19:40:35.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Galiers,realm=LAS,application-id=v7qsfXsE,discussion-id=2OBYFhK7,comment-id=0004,timestamp=2016-01-04T18:26:32.334+0000)\n>\n> naaaaa \n> \n> adc se come el gancho de blitz/thresh -> muere -> flamea al sup \n> carri no backea con baja vida -> llega jg enemigo lo mata -> flamea  a su jg o al sup\n> adc tiene 2 cargas en su trinket de wards -> lo gankean por no tener visión -> flamea al sup por no poner wards (estando los 3 wards del sup puestos)\n> le tiras todo a tu adc (escudos, heals, items, etc) -> pelea estatico, no se mueve y muere -> culpa al sup por no hacerle peel\n> X linea hace focus al sup o tanke mientras el carrie enemigo lo hace bolsa -> flamea al sup o al que tenga al lado por no ayudarlo con la kill\n> como sup tiras todo tu kit de habilidades y unos basicos -> te llevas el kill -> adc flamea por KS estando en 5 de hp\n> x linea tiene pusheado y lo campean a cada rato -> flamea al jg por no ayudarlo\n\nEsto si lo he visto bastante... Es triste, pero es verdad... En lo personal soy pésimo supp (si, lo sé, soy el único al que el rol de supp le parece difícil en el mundo pero es por qué es mucha responsabilidad para mí... Puedo ser adc y quedarme atrás, puedo ser tank y defender al adc, puedo ser jg y gankear, puedo ser mago y hacer un burst impresionante.... Pero la responsabilidad del supp es algo con lo que no puedo :/) así que no tengo mucha experiencia en el rol... Aunque debo afirmar, las cosas que dicen son más que comunes...\n\nY si no pasa eso es que el adc es premade con el supp y ambos flamearan al jg... :/\n\n\nO el adc es un buen adc que aunque pierda sabe afrontar que el juego es de equipos y se da cuenta de que quizás el problema no es solo de los demás... \n\nBueno, esa es mi opinión quizás no está acertada pero es todo lo que puedo decir.\n\n\nSuerte.","replies":[]}]},{"poster":"Starleon","date":"2016-01-04T19:36:48.077+0000","up_votes":1,"down_votes":0,"body":"Esta pregunta va para las personas Flamers: ¿Cuando vas a la casa de alguien te pones a insultar? Se puede aplicar a League of Legends, en este caso dicha companìa te brinda un juego para divertirte y como requisito te pide que solo respetas sus reglas. \n","replies":[]},{"poster":"Kyousuke","date":"2016-01-04T19:00:16.106+0000","up_votes":1,"down_votes":0,"body":"... NADA justifica el insultar a alguien, no hay necesidad ya que puede tener una mala partida o estar practicando algún campeón y le salio mal la parida. no tiene nada que ver que la gente juegue bien o mal si flammea es por que es un sub-normal que se enoja por cualquier cosa, yo jugué partidas en la que jugué mal y no falto el típico retarded que empieza \"report bla bla bla por manco\" \"malo ql la wea qweugasudksaiu\" pero tambien encontre gente que no hablaba y venia a ayudar, trataba de hacer objetivos o ir a otras lineas para que el resto gane y yo nunca flammee por que perdí la linea, jugue tranquilo y lo mejor que podía y listo.\ncomo dije al inicio NADA justifica el insultar a alguien, es como si fueras a la escuela teniendo 2 años te equivocas en una cuenta y la maestría te insultar y te pega, que sentiría el chico al suceder eso?. el insulto es violencia y la violencia NUNCA es buena bajo ninguna circunstancia","replies":[]},{"poster":"Essos","date":"2016-01-04T18:31:13.179+0000","up_votes":1,"down_votes":0,"body":"Y aun asi nada justifica el flameo, asi que es totalmente sancionable.","replies":[]},{"poster":"Silver000","date":"2016-01-04T18:06:34.952+0000","up_votes":1,"down_votes":0,"body":"no se flamea","replies":[]},{"poster":"MFT Sirius White","date":"2016-01-04T19:42:04.224+0000","up_votes":1,"down_votes":1,"body":"Digan lo que digan tenes razon, no le hagas caso a los votos","replies":[]}]}