{"poster":"Clostridium","date":"2017-06-05T22:51:36.444+0000","title":"La culpa es del jg!!!! jugar esta es linea es recibir flameos gratis!!!","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Hablemos de la culpa es del jg:\n\nRealmente se pierde linea porque el jg es malo o es porque juegas mal tu linea???, yo dir&iacute;a por experiencia de junglero de segunda opci&oacute;n es todo lo contrario y resumo porque pierden linea:\n\nTOP:  el top pierde linea porque saca un campe&oacute;n dif&iacute;cil de llevar en la linea o porque juega mal la linea expliquemos esto:\n\nQue debe hacer un top?: primero mantener linea, segundo romear con tp si puede, segundo dependiendo de la habilidad stompear linea (dependiendo de la habilidad esto siempre circunstacial), wardear el red si el jg parte en blue, cuidar heraldo.\n\nEn top una kill de ventaja te puede costar la linea, porque es una linea que por regla general el jg no tiene prioridad de gankear salvo tu oponente sea un campe&oacute;n f&aacute;cilmente deleteable; aqui va algo super importante relacionado y que siempre escucho decir es que me campean en top, pero claro si sacas un campe&oacute;n est&aacute;tico y blando es obvio que te van a campear.\n\nSi mueres o no cumples con lo minimo que es lo anterior pierdes linea porque el jg es el culpable???? yo creo que no cierto.\n\nCuando vamos top y pikeamos cosas que sabemos son de alto de riesgo y que a menos ganemos linea solos nos tiraran las torres sin mas nada que hacer es culpa del jg o es culpa m&iacute;a, cuando  me hago autocounter pensando que el jg obligadamente levantara carpa es cupla tuya o del jg?..... mmmmmm... que es lo mas logico.\n\nMID: que pasa si voy mid y no pongo ward, y me matan, que pasa si no tengo control de la linea y no genereo la presi&oacute;n m&iacute;nima para que el otro mid no haga roming es culpa del jg???...\n\nBOT: que pasa si mueren reiteradamente y sacan los dragones es culpa del jg o debe hacer milagros y robarlos frente 3 o 4 oponente concentrados en su misi&oacute;n de hacer drag&oacute;n.\n\nEs culpa del jg o es culpa del bot que se arma ap en ves de comprar ward, o del adc que se tira a lo loco o del soporte que por tener stun cree que hara una kill asi de facil por solo hehco de tirarse.\n\nO lo peor jugar push y despues quejarse de que los campean y los matan reiteradamente.\n\nHay ciertas cosas basicas que no estan en poder del jg y son que las lineas sean jugadas como corresponde.\n\nQue no puede hacer un jg para que tengamos claro y que puede hacer: hablo de mi nivel.\n\nprimero: puede elegir un campe&oacute;n con el que gakear sea f&aacute;cil y mas o menos efectivo, EL JG PUEDE GANKEAR SI JUEGAS PUSH???, por regla general no puede, son muy pocos los junglas que pueden entrar en lineas pusheadas (lee sin, j4, panteon, shaco, gragas) sin morir a lo tonto en el intento, osea preguntemos nuevamente es culpa de jg que no te gankeen y te maten?.\n\nsegundo: sacar campeon con early para ayudar estompear, si un jg puede hacer esto, saco pante&oacute;n me fedeo y carreo si el team no fedea, puedo matar facil y hacer objetivos.\n\ntercero: sacar tanques con ceceo para gankear y sacar una tf mas fuerte si tb se puede es bueno.\n\ncuarto: solear objetivos aprovechando las rotaciones locas del oponente si tb debe hacerlo.\n\nquinto: farmear en su jg, si el jg debe farmear un jg sin farm no tiene level sin level esta feura de  juego y no ayuda en nada.\n\nEL JG DEBE GANAR TU LINEA NO!!!, ESA ES LA RESPUESTA GENERAL,  el jg dbe hacer todo esto mientras tu solo farmeas en tu linea, todos los junglas salvo tipos muy malos tratamos de hacer esto, pero no siempre se puede y saben cual es la princiapl raz&oacute;n es que ustedes mueren o est&aacute;n push.\n\nExiste un promedio mas o menos standar de los que debe gankear un jg y se habla de un gank exitoso cada uno cada 10 min y que se entiende por gank exisitoso matar o sacar sumon, en resumen y volvemos a pregunta, es culpa del jg que pierdas linea y la respuesta sigue siendo NOOOOOO!!!!\n\nLa linea la tiene que ganar o mantener el que juega la linea, el jg puede ayudar pero no determina como tu juegas, el jg no te da sus manos y no \"MERECE\" tu flameo si la jodes una y otra ves, mira todo lo que tiene que hacer, ES DE LAS LINEAS MAS JODIDAS Y MAS INGRATAS DE JUGAR, aparte de ser dificil te flamean una y otra ves por cosas que escapan de tus manos.\n\nEL UNICO JG QUE PODEMOS DECIR ES MALO EN MI OPINION ES EL SIGUIENTE:\n\n1.- GANKEA Y MUERE BAJO TORRE\n2.- GANKEA SIN VIDA Y SIN MANA.\n3.- FARMEA MEDIA HORA SIN HACER NADA MAS\n4.- NO PONE WARDS.\n5.- HACE CONTRA JUNGLA Y TERMINA MURIENDO EN LA OTRA JG REITERADAS VECES FEDEANDO Y DANDO A ASISTENCIAS AL OTRO TEAM.\n6.- FARMEA EN DRAGONES Y BARONES O HACE CUALQUIER COSA.\n7.- HACER PING DE GANK Y NO HACERLO\n8.- DEJAR MORIR UN COMPAÑERO A TU LADO MIENTRAS HACES ALGÚN CAMPAMENTO.\n\nEstas cosas podrian ser consideraciones de ser mal jg, pero campear o hacerte ganar no e necesariamente una funci&oacute;n de jg, menos si juegas mal como lo menciones anteriormente.\n\nCUANDO JUEGAS UNA LINEA DEBES PARTIR DE LA BASE QUE EL JG ES UN SOPORTE O TE AYUDA A TI O NO, PUEDE DAR PRIORIDAD OTRA LINEA O ES UN DRAGONSLAYER, el principal obligado en ganar linea y no comerse los ganks eres t&uacute; no el jg....\n\nASI QUE SALVO COSAS COMO LAS ENUMERADAS Y OTRAS EL JG NO TIENE LA CULPA DE TU DERROTA ERES T&Uacute;... DEJEN DE FLAMEARLOS, paren de culparnos a los jugamos jg loco, no pueden jugar una linea sin morir y farmear y culpan a un jugador que tiene que hacer todo eso mientras tu solo farmeas y soy MAIN MID por eso lo digo, top empeicen a juagr jg haber si es tan facil y vean si somos omnipresentes como piensan, porque jugar top me perdonana es la linea mas facil y aun asi la venden, los mid la vendemos menos como casi siempre somos medios fanaticos de nuestro kda solemos seimpre morir poco es la verdad.\n\nDel BOT NO HABLO MUCHO POR QUE EN MI ELO SOLEMOS SER COMODINES ASI QUE NO SE PUEDE PEDIR TANTO TAMPOCO, cuando me toca soporte al menos trato de hacerlo lo mejor posible lo mismo adc, pero dentro de lo malo q soy en bot veo que el oponente anda por las mismas asi que deben  ser comodines tb jajajajaja.","replies":[{"poster":"Top Right Click","date":"2017-06-05T23:06:22.867+0000","up_votes":2,"down_votes":0,"body":"La vida es simple:\nSi no te gankean en 10 minutos, róbale los pajaros y golmens","replies":[{"poster":"Clostridium","date":"2017-06-05T23:13:24.196+0000","up_votes":2,"down_votes":0,"body":"ES UN GANK EFECTIVO CADA 10 MINUTOS EN ALGUNA DE LAS LINEAS NO EN TODAS.... \n\nAhora los pajaros siempre han sido del mid si peude hacerlos y lso golems del top eso no es nada malo que lo digas.","replies":[{"poster":"kiuhm","date":"2017-06-05T23:16:21.980+0000","up_votes":5,"down_votes":0,"body":"Me llegas a robar los golems o los pollos voy a tu linea y te quito los minions por vivo. La jg es del jg. Mi jg, mis reglas, milanesa.","replies":[]}]}]},{"poster":"Gexz Arg","date":"2017-06-05T22:54:24.593+0000","up_votes":2,"down_votes":0,"body":"/mute all y que juegue como mejor le salga","replies":[]},{"poster":"IvVicious","date":"2017-06-06T04:05:09.767+0000","up_votes":1,"down_votes":0,"body":"Algo que me molesta mucho en las partidas es ver a un mid/adc que va 0/48 quejándose porque el jungla no les deja el blue o el red. Loco, si vas como el tuje no vas a empezar a ganar lane mágicamente por tener un buff; al contrario, seguro se lo vas a regalar al team enemigo haciéndonos el trabajo más difícil a todos.\nEs más fácil flammear al resto a darse cuenta de lo mal que hacen las cosas.","replies":[{"poster":"Clostridium","date":"2017-06-06T04:21:09.233+0000","up_votes":1,"down_votes":0,"body":"EXACTO....","replies":[]}]},{"poster":"Sir Crucifix ll","date":"2017-06-06T02:11:13.363+0000","up_votes":1,"down_votes":0,"body":"Si y no","replies":[]},{"poster":"Fransoi ","date":"2017-06-05T23:14:36.599+0000","up_votes":1,"down_votes":0,"body":"Hace lo que sigue anda a gank marcale que el se tire y cuando se tira te vas xD","replies":[{"poster":"Clostridium","date":"2017-06-05T23:20:25.335+0000","up_votes":1,"down_votes":0,"body":"si esto tb lo encuentro de un mal jg, pingear que se tira y recular jajaja es tipica del jg pende jo jajajajaj o que se queda fareando en su jg y tu mueres al ladode el jajaja esas dos las agrego.","replies":[]}]},{"poster":"WhiteMax","date":"2017-06-06T00:57:44.033+0000","up_votes":1,"down_votes":1,"body":">  wardear el red si el jg parte en blue, cuidar heraldo.\n\n> En top una kill de ventaja te puede costar la linea, porque es una linea que por regla general el jg no tiene prioridad de gankear \n\nTe cuido la Jg y asi me lo pagas? no te quiero ver llorando si el Top rival roamea, yo avise y prefiero hacer objetivos (torre :v).","replies":[]}]}