{"poster":"TH3 R3AP3R","date":"2015-12-28T14:05:59.528+0000","title":"Shorter Surrender timers and dual client support","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Just wonder it Riot is going to implement shorter surrender timers on summoners rift and dual client support in 2016?\r\n\r\nAs to the surrender timer, i believe the timer should be reduced to 15 minutes (on SR) due to the way the new changes that are basically making games snowball  more than ever before..not to mention the constant battle players have with the Matchmaking System which can be out of whack most of the time esp under plat level elo. Also not to mention the small amount of champions atm that are basically OP AF atm that make games, esp normals even more  harder and enjoyable to try and have a decent game as there is no more patches til season 6 arrives.\r\n\r\nAs to dual clients...its basically a short gap to combat the long surrender timers.\r\n\r\nExplain to make why I just had 15 games...I won 5, lost 10...out of the 5 i won 4 were nexus kills (all pre 30-35 mins), one was a FF..cool. The 10 losses...only one was a FF...an 35 min FF to be exact, and the other 9 games...i had to watch my nexus burn at the 40+ min mark?...while atleast 7 of those game were basically lost at 10 minutes? I dont know what it is....its like ppl see my name and be like &quot;nope..not FF this game..feed or not&quot;. Its so boring..you either afk or feed...thats its...and esp with preseason..the meta to crazy snowball..you can barely 4v5 anymore.\r\n\r\nI just would like to see a change in timer, or have dual client support so I can start up the next account and queue up and not waste my valuable time with feeders and afkers or riots bad MMing system.\r\n\r\nNotes..1) To the replies that say &quot;not all games like that...you get short games and longs games equally and randomly&quot;....dude over 90% of my games are like this...I rarely ever get a team that surrenders (while we losing badly)...idk why..its a waste of my time, esp when ppl constantly feed and dont surrender and the other team while fed dont push.\r\n\r\n2) To the ppl that be like &quot;oh...but its &#039;fun&#039; why should we surrender?, we having fun...having fun feeding and trolling you&quot;.....true...have fun but dont spoil other ppl enjoyment by intentionally feeding which what you are doing.you are half the problem and the reason most ppl afk in games.  My fun is to try and win, if there is no way in doing that, its not fun, there is no incentive when you basically get one shotted if your team has feed the other team...what is the fun in that? And yet again this also supports the current meta we are all facing..games are getting alot more one sided than ever before.\r\n\r\nTo the shorter 15 minute FF timer..there is really no disadvantage to it....I cant see any reason not to have it, it gives ppl that are on the rough end of the stick to press yes earlier on and start again. To those who say &quot;oh...shorter timer, there will be even more shorter games now&quot;...no there wont, maybe at higher elo but under plat...where 90% of the community is at...most of you don&#039;t surrender anyway, no matter if you 0/20 or what, you still will need over 66% of the vote to pass, atleast give some of us sensible ones that have a idea of the game a choice...personally i&#039;d love to see a 10 min timer..but a 15 minute timer is a start.\r\n\r\nthank you","replies":[{"poster":"Tele","date":"2015-12-28T22:01:15.315+0000","up_votes":1,"down_votes":0,"body":"What do you mean by your dual client system? Do you want to queue up while still in-game?","replies":[{"poster":"Omni Presents","date":"2015-12-30T11:12:07.747+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"TH3 R3AP3R","date":"2015-12-30T21:16:05.296+0000","up_votes":1,"down_votes":0,"body":"Thanks for you comment..but by saying you have over 5 year of loL exp shows me you still have no idea what your on about. These games that are lost at 10 minutes but go for 40 is because none of the other team will push and just want kills, and our team is that fair behind we cant fight anyway and get one shotted. \n\nYou say...'you can win still'...yer if they all DC and go afk...which never happens. But then you say... \"you can still win though..try\"..ok then. Ill walk out of the base, do my thing, push lane, follow team, whatever...boom, one shotted....rinse and repeat, one shotted,...oh like now my team accuses me of feeding :/. So i got a few choices, afk and get reported, feed and get reported, or 'sit there and wait for your nexus to burn' cause my team mates are too arrogant to press yes to surrender therefore wasting my time when I could of be queued up for another game. \n\nBring in shorter FF timers and I wouldn't of mentioned dual client support, it really all I ask and there is no disadvantage of it. Not sure why riot hasn't put it in.","replies":[]}]}]}]}