{"poster":"LucaValur","date":"2016-03-02T18:36:22.907+0000","title":"Koi Nami Chroma Missing Particles - Please Fix","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"So since I bought the Koi Nami Element chroma, I haven&#039;t really used the original skin until a couple days ago. Then I noticed that the water underneath Nami when she moves around has a pinkish/purple kind of hue and it looks really really nice on the original ski, but that effect is missing in the chromas.\r\n\r\nRiot I really hope you can add this effect to the other chromas because I think it makes the skin look a lot nicer - not to mention the fact that people payed extra RP for the chroma pack, just to have it missing elements from the original skin.\r\n\r\nHere are some pictures so you can see what I&#039;m talking about.\r\nhttp://imgur.com/a/X9BgB\r\n\r\nPlease note that it is not only when Nami uses her E. I only did this so that you can see more of the water.","replies":[{"poster":"LucaValur","date":"2016-07-26T20:37:09.408+0000","up_votes":1,"down_votes":0,"body":"Hey, I saw in the 6.15 patchnotes that you guys \"fixed\" the Koi Nami Chroma particles, though I just played her and there seems to be no change. Could you please look into this again?","replies":[]},{"poster":"LucaValur","date":"2016-03-08T23:16:15.852+0000","up_votes":1,"down_votes":0,"body":"Just checking in to see if you guys found out why this was happening, or if you found a way to fix it.\n\nThanks again :)","replies":[]},{"poster":"moonstones","date":"2016-03-02T19:19:29.582+0000","up_votes":1,"down_votes":0,"body":"Hey LucaValur! \n\nThis is an awesome bug report! We'll take a look and see what's causing the base particles to play.","replies":[{"poster":"LucaValur","date":"2016-03-03T01:32:51.187+0000","up_votes":1,"down_votes":0,"body":"Wow thank you so much!  I really appreciate it :)","replies":[{"poster":"moonstones","date":"2016-03-03T17:16:24.416+0000","up_votes":1,"down_votes":0,"body":"Of course!","replies":[]}]}]}]}