{"poster":"spicystats","date":"2017-01-04T20:31:35.922+0000","title":"A question about warmogs","subforum":"Gameplay","up_votes":3,"down_votes":0,"body":"I played an ARAM and built warmog&#039;s for the regen recently. \r\n\r\nI noticed after that I don&#039;t really see it built much in my games unless its an ARAM or the user is Soraka / Mundo / Tahm Kench / Garen.\r\n\r\nI don&#039;t really know what to think of it, maybe its niche? Was there a time when this item was really popular or I guess you&#039;d notice it built really often? Problematic even? What made it like that? What do you guys think of it&#039;s state right now?","replies":[{"poster":"nm1010","date":"2017-01-04T20:37:07.356+0000","up_votes":2,"down_votes":0,"body":"Warmogs gives a way to counter seige/poke comps, no one needs a seige/poke comp right now since\n\n1. It's not needed with weak towers and baron easy to take quickly.\n\n2. A water drag does the same thing (albeit much worse) without taking an item slot or any gold.","replies":[{"poster":"TTK Dreadnought","date":"2017-01-04T20:40:30.174+0000","up_votes":2,"down_votes":0,"body":"well. the 8sec CD on warmog doest hold up to a 2-4sec poke spell.\n\nand water drag is better IMO because it also gives mana.","replies":[{"poster":"nm1010","date":"2017-01-04T20:44:37.470+0000","up_votes":3,"down_votes":0,"body":"Back in the day when warmogs was strong it was because you dodged 80% of the poke, but the other 20% would do 50% of your hp. Dodging the 80% let you regen back up.\n\nWater drag is good enough, its just %missing hp/mana so you never get topped off though.","replies":[{"poster":"spicystats","date":"2017-01-04T21:03:16.394+0000","up_votes":1,"down_votes":0,"body":"Were seige / poke comps common when warmogs was bought? I looked at its item history and this item wasn't always the same, so who built this item then?\n\nI'd try to look this up but not really sure how to outside of asking people that played with warmogs when it was popular :/.\n\nHow'd you use warmogs when popular? Just survive with its regen? Engage in big trades and take turrets? Have someone hold and split? It gave enough tanky stats?\n\nDo you think the baron buff change made warmogs less common? Like it buffs minions now instead of just massive buffing the people that got it right? So...stopping seiges is very hard?","replies":[{"poster":"nm1010","date":"2017-01-04T21:10:15.082+0000","up_votes":1,"down_votes":0,"body":"It was in combat regen and yes it was popular back in season 3 I think, Jayce, nidalee, lux, and ziggs poking forever at towers to get you to back off so they could take them. Basically it would take upwards of 4-6 minion waves of seiging to get people off towers so the regen was amazing as you were in constant poke wars for 2-3 minutes at a time. Mainly bruisers/tanks bought it, but it wasn't uncommon on adcs either since there was no x amount of health needed for the passive.\n\nBaron definitely made it less common because you don't need to get 4-5 people hitting towers to take them anymore with the buffed minions being so tanky and destroying towers on their own.\n\nI did suck back then so maybe I am misremembering some of the stronger picks, but I'm pretty sure the LCS used the same type of strategies.","replies":[]}]}]}]}]},{"poster":"MagicFlyingLlama","date":"2017-01-04T20:51:12.592+0000","up_votes":2,"down_votes":0,"body":"http://forums.na.leagueoflegends.com/board/showthread.php?t=2122017","replies":[{"poster":"spicystats","date":"2017-01-04T21:31:01.903+0000","up_votes":1,"down_votes":0,"body":"This item was commonly built with \"atma's impaler\" before May 2012?!\n\nI've never heard of \"Atmog's\" :/. It looks like atma's impaler is very similar to today's titanic hydra though. There was a strategy where you'd stack heath items with it and hurt a lot?\n\nI guess that's kind of similar to today's titanic hydra users, except titanic hydra is 3500 and atma's was 2300 but they gave different stats so...\n\nWarmog's was killed in popularity for the same reason the hp stacking was killed in popularity? I guess warmog's might still be decent if you tried to hp stack today which I guess is what Mundo / Garen / Kench do.\n\nI think Kench / Mundo use titanic sometimes so I guess that's similar to what happened before.\n\nThanks for the link, I didn't come across that or know to look up atmogs :).","replies":[]}]},{"poster":"Mountain Warden","date":"2017-01-04T20:49:30.298+0000","up_votes":2,"down_votes":0,"body":"The conditions for me to build warmogs is that the other team puts out a lot of true damage. If you have a vayne and a darius on the other side, then that item is worth it. But keep in mind that in Aram, you have to die to buy stuff. Unless you're at minute 35 with a full build and dying means loosing the game, there's little purpose for an item that will keep you sustained forever. At least, that's the way I see it.","replies":[{"poster":"ProfDrDeath","date":"2017-01-04T22:28:27.226+0000","up_votes":1,"down_votes":0,"body":"{{champion:16}} .","replies":[]},{"poster":"spicystats","date":"2017-01-04T21:36:45.153+0000","up_votes":1,"down_votes":0,"body":"If they put a lot of true damage I guess buying health might be better then buying resistances so warmogs has more value?\n\nIt has value in aram because you can be healthy, but yeah this has limits. You want to die to get items and at some point warmog's won't be enough to keep you alive through a fight so you wont regen after it.\n\nThere's a small period where the ability to stay healthy I guess means you can die less, but I don't really know how much value that is. Maybe I'm over valuing its worth on aram and it'd be better if I bought something that gives resistances instead unless there's a ton of true dmg.","replies":[]}]},{"poster":"Azure Hamster","date":"2017-01-04T20:33:38.117+0000","up_votes":2,"down_votes":0,"body":"It didn't used to require being out of combat 8 sec (or however long) to trigger its health regen. Since that happened, fewer champs can use it. That's my read on it, anyway.\n\n{{champion:51}}","replies":[{"poster":"TTK Dreadnought","date":"2017-01-04T20:37:26.800+0000","up_votes":2,"down_votes":0,"body":"or its better to simply recall.","replies":[{"poster":"Azure Hamster","date":"2017-01-04T20:41:02.242+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Technolians,realm=NA,application-id=3ErqAdtq,discussion-id=PPUPQuez,comment-id=00000000,timestamp=2017-01-04T20:37:26.800+0000)\n>\n> or its better to simply recall.\n\nI don't know... recall dumps you back at base. With Warmog's, you can still drop in ranged attacks and you're still there and don't have to walk back; you just have to avoid taking damage.\n\n{{champion:51}}","replies":[{"poster":"spicystats","date":"2017-01-04T21:15:58.284+0000","up_votes":1,"down_votes":0,"body":"I can agree backing might loose you a turret or an objective, so recalling isn't I guess \"a regen option with no drawbacks\". Another person mentioned seiging so maybe the champions that seiged turrets, if they had to back couldn't pressure the turret ya know?\n\nWhen I read the stuff on warmogs earlier it looks like its passive wasn't as strong as the current one tho. \n\nThe exact text for the old warmogs is:\n\n> Unique passive - Restores 1% of maximum health every 5 seconds. Health restore increases to 3% of maximum health if damage hasn't been taken within 8 seconds.\n\nI stole this from the wiki.\n\nIt doesn't have a requirement so you can build it first, but I think the current warmog's regen is a lot stronger when it starts working.\n\nBut based on what you've said, earlier you could build it on ranged champs and still benefit from the regen? So a champion like gnar would like it or am I getting the wrong picture?\n\nDo you think you'd build it on non-tanks as well then? If you didn't need 3000 hp to use it maybe a lux could poke with it or something until she's back to full.","replies":[{"poster":"Azure Hamster","date":"2017-01-04T22:24:55.663+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=spicystats,realm=NA,application-id=3ErqAdtq,discussion-id=PPUPQuez,comment-id=0000000000000000,timestamp=2017-01-04T21:15:58.284+0000)\n>\n> Do you think you&#x27;d build it on non-tanks as well then? If you didn&#x27;t need 3000 hp to use it maybe a lux could poke with it or something until she&#x27;s back to full.\n\nI'm really not sure. I'm not enough of an expert on itemization to answer this properly. I just remember building it more often on non-soraka tank-types. I still like it for Soraka or Garen.\n\n{{champion:51}}","replies":[]}]}]}]}]},{"poster":"Erockandroll","date":"2017-01-04T20:42:16.940+0000","up_votes":2,"down_votes":1,"body":"Warmog's is good at what it does, it offers a large amount of out of combat sustain, that scales with maximum HP, provided that you have at least 3k.\n\nThus begs the question, how useful is it to have that out of combat sustain? Well, not as useful on SR, you can always recall and heal at the fountain. And otherwise, doesn't really have much use in the current meta. (I could see that change if we ever return to a poke/siege meta) \n\nOf coarse in ARAM, it's useful because you can build it, in lieu of fountain sustain.","replies":[{"poster":"spicystats","date":"2017-01-04T20:58:46.745+0000","up_votes":1,"down_votes":0,"body":"The thing is on summoner's rift I thought out of combat sustain was most important when your laning, because that's when kills happen because of lack of regen or poor trades right (I might be wrong here idk)? And recalling then is risky because towers might get taken.\n\nWarmog's requires a lot of hp before you can proc its passive which kind of breaks what I thought happened. Laning phase will be over by the time you can get the passive to work :/.\n\nA previous poster said it was strong when seige / poke comps were really common, so I guess that goes in line with when out of combat sustain is useful? \n\nRecalling in that case might give the team enough time to take a turret. I guess a team can hold by a turret with warmog's regen while someone split pushes, or I guess its a last resort option when your team lacks hard engage to beat poke-ish teams.\n\nI think its wonderful in aram because out of combat regen is the only source of regen since we don't have fountain sustain.\n\nIs the 800 HP simply not good for a tank compared to other items for becoming tanky? I thought maybe warmog's would be considered for some people just because of the hp it gives :/.","replies":[]}]},{"poster":"Lovelle","date":"2017-01-05T01:03:39.002+0000","up_votes":1,"down_votes":0,"body":"Warmogs is a shadow of what it used to be a long time ago. I kind of like that it gives CDR now though. \n","replies":[]}]}