{"poster":"Gostem","date":"2019-01-11T01:43:50.330+0000","title":"El sistema de honor y el polemico \"Prestigio\"","subforum":"Charlas Generales","up_votes":13,"down_votes":1,"body":"Primero que nada saludo de manera humilde a quien sea que lea este enunciado, a de comunicar de forma abierta mi descontento con el actual sistema de honores, pues tras experimentarlo ya por 2 largos a&ntilde;os y completar la meta a alcanzar, digase, el nivel de honor 5, siento que no hay una recompenza real detras de todo este chiste de sistema, suelo recibir aunque sea un honor en cada partida y aun asi nunca e tenido menos de 12 cofre (actualmente poseo 15), cabe recalcar que menciono lo de las cajas porque la cantidad de llaves son infimas, comprendo que sea una empresa y que quiera mi dinero pero siendo unas de las 10 empresas que mas dinero generan en el mundo de los juegos actualmente siento que es tiempo que empiezen a mostrar algun rastro de interes en sus jugadores. Saben bien de lo que hablo, no hay una sola encuesta que trate de manera positiva a riot games, alzar el rp fue la primera de muchas faltas de interes en tus jugadores.\r\n\r\nY respecto a lo del prestigo..... Que te puedo decir, como pueden hacerle esto a sus jugadores, enserio es ridiculo aun si lo dicen en el dia de los inocentes creria que es una broma de mal gusto (de mal gusto porque siendo riot y mientras sea cara es posible y paso) ; pero es que dios no tengo una forma de expresarme de forma respetuosa ante esta situacion, mas de 100 dolares una miserable skin, riot llevo a&ntilde;os jugando, a&ntilde;os, nunca e recibido una recompesa real por ser leal al juego ni tampoco nunca lo busque pero una miserable sensacio de aprecio, un poco de cari&ntilde;o por parte de los rioters seria algo muy agradable.\r\n\r\nNada mas que decir, adios.","replies":[{"poster":"Lygnus dwarf","date":"2019-01-11T02:06:05.665+0000","up_votes":5,"down_votes":0,"body":"No lo defiendo, pero al menos yo e recibido 3 skins por parte de riot(lee sin muay thai, vi galante, y la otra no me acuerdo cual es)\nPero en lo de las skins prestigio tienes razon, cuando lei la implementacion de esa variante, decian que querian que la skin rara del juego, lo alcanzaran los jugadores dedicados y que si querian tenerla, por eso el pase y como 500 victorias para tenerlas (asi lo hice con las dos kda solo por 6.000 pesos chilenos(que es poco)), pero ahora los que tendran la skin prestigiosa seran puramente los que tienen mas dinero y los que tienen recursos casi ilimitados para gastar.\n¿Donde quedo el esfuerzo que querian ver en los jugadores para tener una skin “unica”?","replies":[{"poster":"Gostem","date":"2019-01-11T02:39:19.514+0000","up_votes":3,"down_votes":0,"body":"Recuerdo cuando implementaron las misiones, alfinal con mucho esfuerzo te daban tu skin (mentira tu fracmento), y todos nos sentimos realizados ahora es un chiste y el premio gordo como tu digiste se torna hacia jugadores con recursos exageradamente altos, tendremos realmente aliados en el olimpio en las oficinas de riot o es que no hay un solo jugador real alla arriba que entienda a esta comunidad?","replies":[{"poster":"FC Fupu","date":"2019-01-11T16:27:17.067+0000","up_votes":1,"down_votes":0,"body":"LAS no es tomada como comunidad, no tenemos ni voz ni voto en lo que respecta del lol, todos los post quejándose de esto solo funcionan para descargarse y nada mas. \n\nVos mismo lo podes ver viendo el estado del servidor","replies":[]}]},{"poster":"Aurum Ataraxia","date":"2019-01-11T03:35:41.885+0000","up_votes":1,"down_votes":0,"body":"No puedo estar más de acuerdo, si no cambian el sistema de prestigio después de un evidente rechazo por parte de la comunidad, se demostrará realmente el objetivo de Riot para con el juego.","replies":[{"poster":"BlackFlág","date":"2019-01-11T07:06:30.113+0000","up_votes":1,"down_votes":0,"body":"toda empresa busca generar dinero.","replies":[{"poster":"Aurum Ataraxia","date":"2019-01-11T15:36:18.056+0000","up_votes":1,"down_votes":0,"body":"Una cosa es buscar dinero y otra es verles la cara de bobos a la comunidad. Este sistema es una demostración de falta de respeto hacia la mayor parte de la comunidad.","replies":[]},{"poster":"SpectreChazer","date":"2019-01-11T13:43:17.073+0000","up_votes":1,"down_votes":0,"body":"Por qué crees que todo el mundo tiene a EA como la peor empresa? Exacto por políticas abusivas como esta...","replies":[]}]}]}]},{"poster":"Osorkon21","date":"2019-01-11T03:34:25.061+0000","up_votes":2,"down_votes":1,"body":"El honor no es un sistema de super recompensas amigo, es mas un sistema de castigo para los tóxicos, y si te dan muchas recompensas...\n\nHay que tener en cuenta que un jugador toxico no recibe llaves ni cofres gratis y tampoco recompensas de final de temporada (oro +) por estar en honor 0, en cambio con honor 5 recibes mas de 1 llave al día y sacas un cofre con cada nuevo campeón que saques S, lo que te da la oportunidad de tener un nuevo skin cada 2 días... eso no te parece recompensa?\n\nAdemas de eso tmb adornos gratis en pantalla de carga, recompensas de fin de temporada por tu liga y nuevas recompensas de final de temporada por tu nivel de honor...\n\nQue mas queres simplemente por respetar los códigos de conductas que siempre deberías respetar sin premios???\nTe están regalando muchísimas cosas que no deberían regalarte y todavía te quejas diciendo que \"no son recompensas\"","replies":[{"poster":"Marx we need you","date":"2019-01-11T03:54:41.631+0000","up_votes":1,"down_votes":0,"body":"A ver amigo, tampoco hay que exagerar, el sistema no te da la posibilidad de tener una skin cada dos días, te da la posibilidad de sacar una skin aleatoria cada tres fragmentos (solo tomando en cuenta el método más rápido, el reroll), y ya me gustaría a mi sacar una llave todos los días. He sacado muchas skin con artesanía (probablemente  unas 30 o por ahí) pero es verdad que su progreso  es muy lento, eso puede parecer duro, especialmente a los nuevos jugadores que no estuvieron en la época cuando si tenías un skin era porque directamente maineabas el champ y Riot no regalaba ABSOLUTAMENTE NADA. Estoy de acuerdo en que el sistema de Honor es más un sistema de castigo, pero vamos, que con lo que hicieron a final de temporada (perdonar a los jugadores tóxicos, dándoles igualmente las recompensas) su efectividad es cuestionable.","replies":[{"poster":"Osorkon21","date":"2019-01-11T08:59:16.020+0000","up_votes":1,"down_votes":0,"body":"Bueno, llaves todos los días te dan,  desde honor 3 si recibís honores te dan llaves al otro día, y cofres podes sacar muy fácilmente, eso te da cerca de 4  fragmentos a la semana, usando el método de mezclar los baratos y convertir en escencia los caros te sacas con suerte 1 skin que realmente te gusta por semana... yo juego desde la Primera temporada y mi main acc tenia 1 solo skin que me regalo mi primo para mi cumpleaños hasta el momento en que apareció el sistema de cofres 1 solo en 5 o 6 años ya que como dijiste \"no regaban NADA\"\n\nEntonces partiendo desde eso Recompensas tenes sobradas recompensas solo por no ser toxico... no se puede decir que no se \"recibe una recompensa real\" como en el post\n\nPasando de eso sabes lo difícil que es subir de honor 0 bloqueado a honor 2 en 1 mes? Dudo que muchos lo hayan logrado\n\nLos que lograron eso tuvieron un cambio MUY grande en su comportamiento dentro del juego, ese es el objetivo de los castigos que los jugadores tóxicos cambien su actitud.\n\nlas recompensas estan, los castigos tmb no los nieguen","replies":[]}]}]},{"poster":"SBL Nightel","date":"2019-01-11T11:11:06.828+0000","up_votes":1,"down_votes":0,"body":"Con respecto a las skins prestigiosas tenes toda la razon, es increible que algo muy parecido a un chroma valga tanto dinero. Pero bueno, el castigo a Riot se lo hace no comprando ni una de esas capsulas.\n\nCon respecto al punto de honor, yo creo que el sistema esta bien. Te recompensa el buen comportamiento y te permite tener skins sin gastar un solo peso. Imaginate que si te daria mas fragmentos o mas cofres Riot perderia mucha ganancia ya que la gente dejaría de comprar.\n\nObviamente no defiendo la suba de precios que fue descarada ya que a la mayoría en Argentina se le hacia dificil comprar con los precios que estaban despues del aumento de mitad de año, ahora casi imposible.\n\nSaludos.","replies":[]},{"poster":"Poro Travieso","date":"2019-01-11T07:36:46.310+0000","up_votes":1,"down_votes":0,"body":"No es para tanto lo del prestigio habiendo tantos skins","replies":[]},{"poster":"PússySlap","date":"2019-01-11T05:03:02.027+0000","up_votes":1,"down_votes":0,"body":"tranqui tendras tu ww o xin dorado repito tranqui","replies":[]}]}