{"poster":"Olandèse Volante","date":"2016-10-24T20:34:40.732+0000","title":"SSG vs SKT","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Chi vincer&agrave; alla fine secondo voi e perch&egrave;?\n(sarà bellissimo rileggere tutto quel che avevate detto prima della finale dopo che sarà finita. prevedo tante risate!)","replies":[{"poster":"SickAnto","date":"2016-10-24T20:39:46.880+0000","up_votes":3,"down_votes":0,"body":"Dicono quasi tutti che vinceranno gli SKT perché troppo superiori ma io spero ai SSG semplicemente perché non voglio altre skin SKT >.>","replies":[{"poster":"Ste the ripper","date":"2016-10-24T23:07:46.076+0000","up_votes":1,"down_votes":0,"body":"Beh in season 4 ci sono state le ssw ora ti brccheresti le ssg","replies":[]},{"poster":"Sexy Win","date":"2016-10-24T21:50:05.673+0000","up_votes":1,"down_votes":0,"body":"ahaha","replies":[]}]},{"poster":"Jihyobda","date":"2016-10-25T11:22:23.200+0000","up_votes":2,"down_votes":0,"body":"se è bella la metà di quella che è stata ROX vs SKT non mi frega chi vince eheh xD","replies":[]},{"poster":"Ultan","date":"2016-10-25T10:33:43.724+0000","up_votes":2,"down_votes":0,"body":"La forza dei team in competitive di quest'anno è soprattutto nel punire gli errori del team avversario (In questa season è molto più accentuato rispetto agli anni passati). Sia SKT che SSG hanno dimostrato di punire duramente anche i più piccoli errori/sviste. Sarà una bella finale, tuttavia...basta skt hanno rotto, Faker per quanto possa essere forte è un bambino viziato tutto il team deve ruotare intorno a lui, se viene chiuso una volta in 1v2-3 SUBITO tutto il team campera mid per farlo recuperare e farlo feedare, non esiste nessun'altro solo Faker...e per certi versi dopo un po' e noioso pure da guardare. Se Faker non si feeda al 60% perdono il game. I SSG sono molto più compatti è cercano di distribuire tutto il vantaggio in tutte le lane, perciò io tifo SSG! :)","replies":[]},{"poster":"PND Magretto","date":"2016-10-25T14:00:12.717+0000","up_votes":1,"down_votes":0,"body":"Vincono gli skt,non hanno dimostrato grandi debolezze e se nemmeno i rox sono riusciti a batterli allora nessuno può,prevedo SKT 3-1SSG","replies":[]},{"poster":"Ste the ripper","date":"2016-10-24T23:11:56.587+0000","up_votes":1,"down_votes":0,"body":"Nei pick'em ho messo ssg perché erano in forma nella fase a gironi e avevano chiuso il campionato lck in crescendo, mentre gli skt non erano sembrati brillanti né in campionato né ai gironi.\nTuttavia dopo la schiacciante prova di forza sui rox dove si è visto davvero un livello di gioco altissimo tutti si sono convinti che gli skt vinceranno.\n\nGli ssg sono in einstreak da 10 partite, ma se gioca bengi credo anche io vinceranno gli skt, anche perché crown secondo me non è niente di speciale e ruler non può competere con bang.\nSarà di sicuro una serie interessante","replies":[]},{"poster":"ilsimptico","date":"2016-10-24T21:43:25.728+0000","up_votes":1,"down_votes":0,"body":"SKT 4 Ever","replies":[]}]}