{"poster":"wop","date":"2015-04-15T14:35:43.830+0000","title":"B.F. Sword should not be a basic item.","subforum":"Gameplay","up_votes":5,"down_votes":10,"body":"I think B.F. Sword should build out of at least two if not three smaller ingredients. When you think about it, {{item:1038}} costs way more than {{item:3134}} {{item:3086}} {{item:3093}} and these items have ingredients. Saving for a B.F. sword can get kind of annoying. This also goes for{{item:1058}}. These items can be a pain to save for, and saving for them puts you behind on stats, compared to someone who builds some other stat, like HP, armor (cough tank meta), or attack speed. \r\n\r\nMaybe you could make B.F sword build like this: {{item:1036}} -&gt;{{item:1037}} -&gt;{{item:1038}} , and NLR could build like this: {{item:1052}} -&gt;{{item:1026}} -&gt; {{item:1058}}","replies":[{"poster":"Saianna","date":"2015-04-15T14:46:13.993+0000","up_votes":5,"down_votes":1,"body":"No, It shouldn't work like that..\n{{item:1038}} & {{item:1058}} are meant to increase your champs power by alot. Also both of them build into end-game items.\nThey are supposed to be bought with empty inventory slots in mind. \n\nSomeone gave far better argument than mine in similar thread some time ago. You should check it.","replies":[{"poster":"wop","date":"2015-04-15T15:36:54.592+0000","up_votes":1,"down_votes":2,"body":"Maybe this was the intention, but currently they are not really built into late game items. They are usually bought early on, and build into items that many players \"rush\"","replies":[{"poster":"Saianna","date":"2015-04-15T15:47:00.484+0000","up_votes":1,"down_votes":0,"body":"Because it's worth it to rush them..\nIf we had good early-mid gears that could be taken instead of B.F then ppl would rush it.\n\nWe all are slaves to efficiency. We'll follow anything with greatest pros to cons numbers.\n\nFor example with old statikk (was it some sparkle or something like that) it was almost must-have for any AA champion. People bought it because it was worth it.","replies":[{"poster":"wop","date":"2015-04-15T16:01:35.550+0000","up_votes":1,"down_votes":0,"body":"That's exactly what I'm saying. Maybe I'm not being clear, although I hope I am. What I mean is, since people currently build them early in the game, why not make them upgrades from weaker items, so that there is a steady increase in power? This way, people can buy items they need for other end game items, instead of having to save for each item. I know when I play AP champs, I buy {{item:1026}} {{item:3191}} {{item:3113}} before I start saving the butt ton of gold it takes to get three {{item:1058}} . If NLR and BFS were built from smaller items it would be better for everyone. I don't get what's the con about that","replies":[{"poster":"Saianna","date":"2015-04-15T16:11:52.535+0000","up_votes":1,"down_votes":0,"body":"You already have different items to build for steady increase of power.\nThose endgame items like {{item:3089}} ,{{item:3157}}  & {{item:3031}}  are supposed to be built to give you huge advantage after you have finished building base items.\n\nImo it should stay as is. Otherwise people would just rush to end items even faster.","replies":[]}]}]}]}]},{"poster":"Strawberrycocoa","date":"2015-04-15T14:59:04.443+0000","up_votes":3,"down_votes":0,"body":"It might be nice to acquire the AD or AP steadily instead of in a big spike. But I don't know if needing smaller items to build into Pickaxe or Wand is necessary, honestly.","replies":[]},{"poster":"Stray Kat","date":"2015-04-15T16:09:35.401+0000","up_votes":2,"down_votes":0,"body":"The whole point is that NLR and BFS both build into the 3/4 strongest items for their chosen purposes.  No other items offer 120 AP or 80 AD without building from one of the two(To the best of my knowledge, on SR, except the stacking items).  \n\nYou can either choose to buy the cheaper components, like a Book or Wand, for some earlier(Cheaper) power, and have them build into things with Less than 120 AP/80 AD, but having a piece sooner - OR you can wait for the 1550/1600 to get a BFS/NLR, and have to wait longer for that power, but gain the ability to build them into even bigger items.  \n\nNLR and BFS are (Nearly) the strongest items each for AP/AD, other than the items they build out of.  NLR gives more AP than a Void Staff, which builds out of basically what you're suggesting NLR should.  Having them build out of stuff would make it a no-brainer to go for them over other items, due to being able to pay 800 gold at a time, rather than the large chunk that often convinces you to work on a smaller(I.E. Weaker) Item.","replies":[]},{"poster":"FarRockBF","date":"2015-04-15T14:47:14.869+0000","up_votes":2,"down_votes":1,"body":"This was intentional. You can chose the risk of staying in lane for a long time to earn {{item:1038}}  or {{item:1058}} , but you will likely be out of {{item:2003}}  and a big risk there. Or you could back early for a {{item:1053}} or a {{item:3108}}  for example, which are easier and less risky buys but not as powerful when you return. This also forces you to really nail your CS game.\n\nTLDR; Big risk = big reward, avoid risk = less reward","replies":[]},{"poster":"4nth0l0gy","date":"2015-04-15T14:46:39.249+0000","up_votes":1,"down_votes":0,"body":"Itemizing for big damage is supposed to be difficult. Unlike tanks, who have to build reactively to the damage their opponents are throwing, damage dealers get to build actively. While tanks need every bit of help they can get to survive, a damage dealer doesn't *need* more damage as badly. If you want the payoff of a {{item:1038}}, it's going to take some work to get there, because you could just as easily settle for {{item:1036}} or {{item:1037}} instead. \n\n...I don't feel like I explained that very well, but I assure you there is a good reason why {{item:1038}} does not have components.","replies":[{"poster":"wop","date":"2015-04-15T15:43:36.988+0000","up_votes":1,"down_votes":0,"body":"I somewhat get what you are saying, but I disagree. Tanks probably need the least itemization to be tanky, that's why they are tanks because they have high base defensive stats. But with damage dealers, they don't really have any outstanding impact without items. I don't mean to make them easier or anything like that to obtain. I mean for such expensive items, I don't think they should be without a recipe. It really hampers those people who need AD/AP. They have to stay in lane with a ton of gold to increase their stats, instead of building steadily.","replies":[]}]}]}