{"poster":"Cyper","date":"2015-08-01T07:57:12.344+0000","title":"Suche Leute für Teamranked Elo EGAL! (FUN TEAM)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hey ich und ein freund haben lust mal wieder Teamranked zu spielen und suchen daf&uuml;r ein paar leute.\r\nDa wir aus Spass spielen ist uns die elo eigentlich ziemlich egal, lanes sind auch egal (m&uuml;ssen uns dann organisieren Wenn wir alle da sind man kann ja auchmal lanes tauschen)\r\nWir suchen 3 Leute \r\nMein Freund w&uuml;rd gerne adc/jungle spielen\r\nIch w&uuml;rde top/jungle/mid/adc gehen (Man kann ja wiegesagt tauschen)\r\nDabei ist es egal ob ihr die Lanes maint oder nicht (Trolls sind nichtso gern gesehen, spielen zwar aus spass aber wem macht es spass einen teemo jungle zu haben der 0/20 steht?)\r\nWas wir nicht m&ouml;gen sind Flamer oder leute die Nach 20 Minuten direkt surrendern wollen auch wenns mal schlecht aussieht kann man noch gewinnen!\r\n\r\nAlso wenn ihr lust habt added mich einfach ingame oder schreibt hier rein!","replies":[{"poster":"Maexle","date":"2015-08-02T00:06:44.643+0000","up_votes":1,"down_votes":0,"body":"Junge unterschätze {{champion:17}} Jungle nicht ja? Das funktioniert bis Platin ziemlich gut ;D","replies":[]},{"poster":"SuchiKing","date":"2015-08-01T10:57:23.177+0000","up_votes":1,"down_votes":0,"body":"Hey Cyper, würde auch gerne mit euch ein paar runden spielen :)\n\nKann soweit alle Rollen besetzen, nur die ADC rolle ist meine schlechteste :D\nAnsonsten bin ich main Supp und spiele soweit alles außer Zilean oder Sona \n\nSkype bzw TS sind auch kein PRoblem, beides vorhanden :)\n\nWürde mich über Add freuen :)\nIng: SuchiKing\n\nMfg SuchiKing :D","replies":[]},{"poster":"Takazuya","date":"2015-08-01T08:44:51.863+0000","up_votes":1,"down_votes":0,"body":"Servus Cyper, würde mich gerne anschließen bei Euch 2\nda ich keine lust mehr habe auf Random´s \nund man nicht weiß mit wem man im Team ist.\n\nIch würde gerne Top spielen... kann auch gerne auch mal abwechseln mit jungle und adc\nwürde mich freuen wenn du mich adden würdest im Game\n\nund wir alles weitere im Skype oder im TS sprechen\n\nGrüß Takazuya","replies":[]}]}