{"poster":"Cottone","date":"2015-08-12T08:41:21.390+0000","title":"Domanda sulle macro","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"E&#039; bannabile usare le macro per communicare in chat oppure per premere pi&ugrave; tasti contemporaneamente/in rapida successione?","replies":[{"poster":"Whommy","date":"2015-08-12T10:42:04.093+0000","up_votes":2,"down_votes":0,"body":"io ad esempio ho in macro tutte le posizioni con i tasti logitech G1-2-3-4-5 per il blind.\n\nG-6 per spammare GPRS, sul mouse un tasto per ward e un tasto per il self W/E dipende dai champ.","replies":[]},{"poster":"miki2212","date":"2015-08-12T09:19:22.396+0000","up_votes":2,"down_votes":3,"body":"no, certo che no: le macro NON influiscono in alcun modo sul gioco, e non devi modificare il client per poterle usare.","replies":[{"poster":"Firenheit","date":"2015-08-12T10:43:45.162+0000","up_votes":2,"down_votes":1,"body":">le macro NON influiscono in alcun modo sul gioco\n\nR.I.P.","replies":[{"poster":"miki2212","date":"2015-08-12T18:15:20.655+0000","up_votes":1,"down_votes":2,"body":"spiegami un attimo il motivo per cui dovrebbero essere vietate, dai.","replies":[{"poster":"Firenheit","date":"2015-08-12T19:11:36.560+0000","up_votes":2,"down_votes":1,"body":"Dovrei perdere tempo con chi pensa che le [macro](https://it.wikipedia.org/wiki/Macro_(informatica)) non portano vantaggio?","replies":[{"poster":"miki2212","date":"2015-08-13T09:51:17.159+0000","up_votes":3,"down_votes":1,"body":"giusto, tirati indietro. ggwp, bella l'argomentazione che hai fatto a riguardo. P.S. non ho mai visto ban per uso di macro o annunci sul forum che dicono \"macro vietate\", e le macro non portano VANTAGGIO, ma COMODITA'; prima trova la differenza tra le due parole, poi ne riparliamo.","replies":[]},{"poster":"DeathJehuty","date":"2015-08-12T19:22:12.581+0000","up_votes":2,"down_votes":1,"body":"giocare con lo smartcast porta \"vantaggi\"...cosa cambia se uno ha le macro?","replies":[{"poster":"Firenheit","date":"2015-08-12T21:17:12.203+0000","up_votes":1,"down_votes":1,"body":"Madonna ragazzi.","replies":[{"poster":"DeathJehuty","date":"2015-08-12T22:02:34.214+0000","up_votes":2,"down_votes":2,"body":"Che vantaggi ho io con le macro tralasciando la comodità?\nPs.: se la riot ritenesse l'utilizzo di macro vantaggiose avrebbero fatto qualcosa a riguardo..ma per fortuna alla riot lavorano persone con un minimo di sale in zucca ","replies":[]}]}]}]}]},{"poster":"Ucr0niA","date":"2015-08-12T12:39:32.688+0000","up_votes":4,"down_votes":2,"body":"Come avesse detto \"Gli anabolizzanti non influescono minimamente sullo sport\".","replies":[{"poster":"DeathJehuty","date":"2015-08-12T22:01:21.130+0000","up_votes":1,"down_votes":3,"body":"ma che esempi sono...oramai mouse a tastiere con con macro le vendono anche dai cinesi quindi se pensate che sarete piu forti con le macro compratevi l'atrezzatura\nIl fatto che io per usare una pozza premo un tasto sul mouse invece che il 2 sulla tastiera è un fatto di comodità, non è che ti dia potere aggiunto eh, poi se voi siete ancora al livello di fare flash al posto di G per pingare non è colpa di nessuno...{{summoner:3}}","replies":[{"poster":"Firenheit","date":"2015-08-13T08:32:33.681+0000","up_votes":2,"down_votes":0,"body":">Il fatto che io per usare una pozza premo un tasto sul mouse invece che il 2 sulla tastiera è un fatto di comodità\n\nEcco, non sapete cosa è una macro.","replies":[{"poster":"miki2212","date":"2015-08-13T09:56:28.121+0000","up_votes":1,"down_votes":1,"body":"i tasti macrabili, anche chiamati \"macro\", sono dei tasti configurabili per eseguire determinate azioni. Questi tasti sono configurabili sia con programmi esterni, e in questo caso in qualsiasi programma eseguiranno quella determinata istruzione, oppure direttamente dal gioco stesso. In league of legends esiste una schermata di configurazione dove tu puoi configurare appunto proprio questi tasti: ad esempio, se nella casella \"lancio rapido su se stessi\", alla seconda spell, tu metti un tasto macrabile non avrai vantaggio: avrai soltanto la comodità giocando, per esempio, lee sin; infatti non dovrai muovere il mouse sopra di te e poi premere w, ma basterà premere quel tasto.","replies":[{"poster":"Firenheit","date":"2015-08-13T10:15:22.742+0000","up_votes":1,"down_votes":1,"body":"Allora, visto che non sapete niente e parlate, ti spiego: \n-Il lancio rapido NON è una macro. \n-Le macro permettono di fare una serie di azioni premendo un tasto solo. \nEsempio? Premere L per eseguire QWER. Questo è una macro.\n*Usare la pozione col tasto sul mouse NON è una macro a differenza di quel che ha detto l'altro utente sulla tua stessa linea di pensiero.* \n-Usare il cast rapido, invece, permette di non visualizzare il piattello di tiro, saltando un'operazione; non è una macro perché NON fai due azioni in una, il piattello non ti appare al lancio. \n\n-E sai perché nelle impostazioni puoi usare Alt+Q impostando A? \nPerché non cambia il gameplay!\n Ma sai di quali macro si parla in LoL? Combo di Kata , l'insec di Lee Sin e altre, e *din don* queste portano vantaggio a chi le usa e modificano il gameplay.\n\nOra, se hai capito il concetto siamo tutti felici, altrimenti affari vostri, se avete bisogno di una macro per premere QWE mi dispiace per voi :/","replies":[{"poster":"DeathJehuty","date":"2015-08-13T12:33:38.574+0000","up_votes":2,"down_votes":1,"body":"Ti rendi conto  che rende piu complicato giocare avendo le combo sulle macro?  Hai presente come funziona LoL vero..ci hai gia giocato si? \nMettiamo che tu giochi cata..premi sempre QWE in rapida succesione? no ..non credo, quindi di conseguenza non credo che ci sia un senso nel utilizare le macro in questo modo...ma tu continua pure a ritenere il contrario {{champion:432}}","replies":[{"poster":"Firenheit","date":"2015-08-13T12:40:33.152+0000","up_votes":1,"down_votes":1,"body":">Mettiamo che tu giochi cata..**premi sempre** QWE in rapida succesione? no \n\nEnnesima dimostrazione che non sai cosa è una macro e come funziona.\nP.s.\n>-ci hai gia giocato si?\n-**c**ata\n\nKappa :)\n\n>Ps: le macro si possono utilizzare anche con tastiere normali sprovviste dei tasti magici M...ti basta scaricare uno dei tanti hot key recorder che trovi su internet da boh...anni e anni..quindi vai, **ora puoi essere avvantaggiato** pure tu :)\n\nLa risposta sta nell'affermazione :)\n---\n*La prossima volta, informati e potrai avere una discussione seria :)\nCya~*","replies":[{"poster":"DeathJehuty","date":"2015-08-13T13:08:33.963+0000","up_votes":2,"down_votes":1,"body":"Guarda, puoi in insistere quanto vuoi, cio non toglie che le situazioni sono infinite in LoL, e sinceramente giocare con combo sulle M* mi porterebbe solo a fare cagate, FINE\nQuasi quasi ti spedisco la mia vecchia roccat e tolgo tutti i tasti standard e ti lascio solo le MACRO laterali...voglio proprio vederti :)","replies":[{"poster":"Firenheit","date":"2015-08-13T14:07:01.109+0000","up_votes":1,"down_votes":1,"body":">  cio non toglie che le situazioni sono infinite in LoL, e sinceramente giocare con combo sulle M* mi porterebbe solo a fare cagate,\n\nProprio non ti vuoi azzardare e informarti su come funzionano, eh? \nMa chi insiste, mica mi spreco a insegnare la matematica al muro.","replies":[{"poster":"DeathJehuty","date":"2015-08-13T15:39:05.662+0000","up_votes":1,"down_votes":1,"body":"Ahahha puoi cercare di arrampicarti sugli specchi..ce poco cosa spiegare...le cose so come stanno...ma inizio a credere che tu non capisca veramente nemmeno cio che tu dici","replies":[{"poster":"Firenheit","date":"2015-08-13T15:44:59.806+0000","up_votes":1,"down_votes":0,"body":">Ahahha puoi cercare di arrampicarti sugli specchi\n\nVeramente ti sto solo dicendo che dovresti rivederti le macro perché da ciò che hai scritto è evidente che non hai idea di come funzionano.\nRibadisco,  fa quello che ti pare, se non trovi che siano scorrettesono affari tuoi, ne risentirà solo che la tua reputazione.\nA me frega meno di zero :)\n*Sei forte, sei bravo, continua così ;D*","replies":[{"poster":"DeathJehuty","date":"2015-08-13T16:13:33.890+0000","up_votes":2,"down_votes":1,"body":"ma non credo sia difficile da capire cosa facciana le macro..ho sia tastiera che mouse con macrokey. Io su M1, M2,M3,..posso anche settarmi la combo Q,E,W (esempio), ma non e che mi dia un vantaggio ne nulla..io quando premero M1 mi fara sempre Q,E,W,...e dopo?\nIo ti giuro non capisco come questa discussione sia andata cosi a lungo XD\nA me nemmeno cambia la vita, ma per il semplice fatto che so che nessuno usa le macro key per combo..e semplicemente una cosa senza senso...\nSe ci fosse anche un minimo dubbio sul portare vantaggio ai giocatori credo che la riot avrebbe gia affrontato il tema...non lo fa per il semplice motivo che il problema non sussiste XD","replies":[]}]}]}]}]}]},{"poster":"DeathJehuty","date":"2015-08-13T12:37:27.985+0000","up_votes":2,"down_votes":1,"body":"Ps: le macro si possono utilizzare anche con tastiere normali sprovviste dei tasti magici M...ti basta scaricare uno dei tanti hot key recorder che trovi su internet da boh...anni e anni..quindi vai, ora puoi essere avvantaggiato pure tu :)","replies":[]}]},{"poster":"miki2212","date":"2015-08-13T13:08:11.498+0000","up_votes":2,"down_votes":1,"body":"aspetta un attimo: \n> il lancio rapido su se stessi non è una macro\n\nquesto non ti risparmia delle azioni? secondo la tua definizione la macro è qualcosa che ti permette di eseguire una serie di azioni con un tasto solo; quindi usando il lancio rapido non ti eviti comunque un click? la tua logica non sta in piedi, dude{{champion:36}}","replies":[{"poster":"DeathJehuty","date":"2015-08-13T13:46:23.611+0000","up_votes":2,"down_votes":1,"body":"No allora, lui ha ragione, una macro è esempio premo M1 e questo digita la mia pasword (quindi una combinazioni di tasti racchiuse in un tasto solo)...ma cio non toglie che giocare con una composizioni di macro sui M per le combo è stupido e scomodo, proprio per il fatto che le situazioni su lol sono infinite..magari sul momento devo solo premere Q, quindi devo passare dai tasti laterali M ai tasti standard in velocita...ce è una cosa impensabile,...lui ha le idee confuse ma non credo abbia una tastiera con le macro...non si rende conto delle cavolate che sta dicendo","replies":[{"poster":"miki2212","date":"2015-08-14T12:40:35.962+0000","up_votes":1,"down_votes":0,"body":"quoto.è come se giochi thresh e metti la macro \"q q\", ma in quel caso non ti serve qq ma solo una q.....inutile.","replies":[]}]}]}]}]}]}]},{"poster":"Firenheit","date":"2015-08-12T12:52:34.936+0000","up_votes":1,"down_votes":1,"body":"Esattamente.","replies":[]}]}]}]}]}