{"poster":"Cottone","date":"2015-11-15T21:25:53.138+0000","title":"Spiegatemi alcune cosucce della 5.22","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Allora volevo chiedervi perch&egrave; la Spada dell&#039;Occulto &egrave; stata tolta, mentre &egrave; stato buffato il {{item:3041}} ?\r\nE\r\nPerch&egrave; hanno tolto le Ombre Gemelle in ARAM? Se io sono {{champion:45}}  e l&#039;avversario ha {{champion:17}}  io che mi compro?","replies":[{"poster":"Heavenly Yasha","date":"2015-11-15T21:27:51.013+0000","up_votes":6,"down_votes":0,"body":"Tu sì che hai fatto luce su ciò che non va nella 5.22","replies":[{"poster":"DeathJehuty","date":"2015-11-15T21:44:55.363+0000","up_votes":1,"down_votes":0,"body":"y","replies":[]}]},{"poster":"Giovarco","date":"2015-11-16T08:08:27.790+0000","up_votes":2,"down_votes":0,"body":"Bella domanda.\n\nQuello che mi chiedo io, invece, perché NON rimuoverlo? E' stato sempre un oggetto situazionale e quei pochi che lo prendevano e riuscivano a feddarsi erano troppo sgravi. Un esempio a caso è {{champion:107}}, che con il massimo degli stack aveva la MS ancor più aumentata.\n\nSinceramente parlando, ora come ora è difficile capire la direzione che prenderà questa season (non buona se continua così), quindi aspettiamo e vediamo.","replies":[{"poster":"Elle C","date":"2015-11-16T12:09:16.366+0000","up_votes":2,"down_votes":0,"body":"Perché non buona? Lol c'è questa parte della comunity che gira con il paraocchi e non riesce a vedere la bellezza di questi cambiamenti... Sono troppo occupati a lamentarsi del mini nerf al loro champ preferito invece che informarsi e cercare nuove combinazioni strategiche per adattare i loro main e sfruttare i cambiamenti a loro vantaggio... Cosa c'è che non va secondo te nella preseason? .-. Le cose attualmente sbilanciate sono già state riconosciute dalla riot e verranno nerfate alla prossima patch... Ovviamente mi riferisco alla maestria e a graves... E non tirarmi fuori la storia degli oggetti ap per favore perché dimostreresti di non aver nemmeno letto la patch con attenzione...","replies":[{"poster":"Giovarco","date":"2015-11-16T17:14:16.641+0000","up_votes":1,"down_votes":0,"body":"A me son piaciuti i cambiamenti della preseason. Quello che non mi piace e vedermi Tryndamere e Graves ogni singola partita dominare. Senza contare altri piccoli abusi su oggetti che sono segretamento OP, come la {{item:3124}} sui melee.","replies":[{"poster":"Elle C","date":"2015-11-17T15:14:16.894+0000","up_votes":1,"down_votes":0,"body":"Jax è broken comunque con o senza guinsoo e trynda e graves sono già stati beffati sul pbe quindi ti lamenti di niente...n per ora semplicemente banali... Yasuo trynda soraka tre ban partita serena","replies":[]}]}]}]},{"poster":"twitchtv Vodky","date":"2015-11-16T15:25:11.968+0000","up_votes":1,"down_votes":0,"body":"Buffato il Mejai? é sempre il solito caro mio e ti sfido a rimanere vivo per tutto il game senza perdere stack..","replies":[{"poster":"Cottone","date":"2015-11-16T17:01:32.689+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Albo,realm=EUW,application-id=MJVj50Jw,discussion-id=OrOqzEFl,comment-id=0002,timestamp=2015-11-16T15:25:11.968+0000)\n>\n> Buffato il Mejai? é sempre il solito caro mio e ti sfido a rimanere vivo per tutto il game senza perdere stack..\n\nSecondo me con una build path più semplice si ha un piccolo buff.\nComunque mi interessava di più la parte sulle ombre gemelle.","replies":[]}]}]}