{"poster":"TheKillerLannyXD","date":"2017-04-03T00:31:11.241+0000","title":"RIOT pls, tema importante sobre reembolsos","subforum":"Problemas Técnicos","up_votes":1,"down_votes":5,"body":"me paso algo hace ya tiempo pero no estaba muy enterado de los foros y a muchas personas les ah pasado.\r\nlo comento porque hace poco en el &quot;PREGUNTALE A RIOT&quot; surgi&oacute; el tema de los  reembolsos.\r\n\r\nhace mucho me hackearon la cuenta (tuve que cambiar la contrase&ntilde;a) y me gastaron los 2 reembolsos que me quedaban y todo el pi que estaba ahorrando (rembolsaron mis 2 mejores champs y me compraron a {{champion:6}} ,{{champion:92}} y el {{champion:83}} de antes del rework)\r\n\r\n*&iquest;porque les cuento esto?\r\nMucha gente gasto 1 o 2 reembolsos de forma inexperta, erroneamente o sin querer (o su hermano menor agarro la PC y trolleo a su hermano mayor) y esto llevo a la comunidad a la nescesidad de pedir mas reembolsos o que le devolvieran los reembolsos que les gastaron o que perdieron por culpa de situaciones como la mia.\r\n\r\ntenganlo en cuenta riot, pls\r\n\r\nPD: recupere a los champs pero me quede con riven y me da asco &iquest;me pueden devolver el pi y sacarme el champ? XD","replies":[{"poster":"Tecnicomando","date":"2017-04-03T00:54:59.884+0000","up_votes":1,"down_votes":0,"body":"EL hackeo no existe, si entregar las cuentas de manera voluntaria...\n\nSalu2","replies":[{"poster":"TheKillerLannyXD","date":"2017-04-03T01:17:09.231+0000","up_votes":1,"down_votes":0,"body":"fue hace mucho. yo nunca comparti mi contraseña y ningun amigo la sabia. a demas me habian cambiado el estado.\nA otro amigo le paso lo mismo y se enojo y desinstalo el lol porque le gastaron el RP que se guardo para las ofertas.\nAhora esta el sistema anticheat pero antes no estaba\n\nigual entiendo que no me creas. no a todos les pasa. nadie me creia hasta que les mostraba las fotos del historial de compra. esa misma tarde que paso fui a lo de un amigo y le dije \"chabon, me hackearon la cuenta\" me dijo lo que dijiste vos y le dije todo lo que paso. depues cuando vio que no jugaba con los campeones que jugaba con mis champs habituales vino a mi casa y yo estaba en el lol y me dijo \"en serio te hackearon?\" por eso te entiendo","replies":[{"poster":"Tecnicomando","date":"2017-04-03T11:56:47.995+0000","up_votes":1,"down_votes":0,"body":"EStimado mi trabajo gira entorno al mundo digital, y si bien el hakeo es viable, no creo que alguien en su sano juicio gaste dias burlando seguridad para  acceder a una cuenta sin relevancia a ,Gastar reembolsos¡?\n\nLo que si existe es:_\n\nIngeniería social\n\nCompartir la cuenta\n\nInstalar el juego pirata de moda e instalar un keylogger de gratis (o ir a un ciber y no verificar con todas las herramientas gratis que hay online, que ese equipo tiene keylogger)\n\nEn esos 3 casos el único responsable es el usuario y por lo mismo rito jamas va a hacer nada...\n\nEs como si te compraras un auto y reclamas al fabricante por que al bajarte al abrir el garaje ,dejando el motor andando y la puerta abierta ,te lo roban","replies":[]}]}]},{"poster":"AuroraExecution","date":"2017-04-03T00:32:51.787+0000","up_votes":1,"down_votes":0,"body":"no","replies":[{"poster":"TheKillerLannyXD","date":"2017-04-03T00:34:34.223+0000","up_votes":1,"down_votes":0,"body":"ok{{item:3070}} \n\nque opinas de los reembolsos?","replies":[]}]}]}