{"poster":"marlaxius","date":"2015-03-22T22:01:15.384+0000","title":"Supporter Runen","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Halle zusammen, \r\n\r\nich spiele ja jetzt schon eine Weile LoL und hab auch mit Ranked angefangen. Ab und an ( und auch gerne ) spiele ich auch Supporter.\r\nFür mich stellt sich immer nur die Frage, welche Runen ich genau nehmen soll. Ich bin mir dabei sehr unsicher und möchte auch nicht so viel Geld für Runenseiten ausgeben. \r\nIch nehme für die Glyphen immer MR und für die Siegel Scaling Mana, wobei ich aber immer wieder sehe das dafür Health genommen wird, was ich aber irgendwie nicht nachvollziehen kann. Für die Essenzen habe ich auch immer Armor drin und für die Zeichen auch, aber dafür möchte ich mir jetzt Hybrid Penetration holen. Ich spiele meistens Morgana, Janna, Nami, Annie und Taric.\r\nÜber Tipps, würde ich mich freuen, da ich einfach nicht weiß für wen welche Runen jetzt optimal sind.\r\nDanke im Voraus!","replies":[{"poster":"Sorr0x","date":"2015-03-23T09:31:06.355+0000","up_votes":1,"down_votes":0,"body":"Hab das gleiche Problem. :)\n\nWürde gerne das erste mal richtig in ranked Games einsteigen und mir dafür eben ein paar Runenseiten \"vorbereiten\", aber da jeder anders spielt kann man wohl schlecht nach einem Muster gehen, welches für Supporter genau zugeschnitten ist. \n\nHabe gestern beispielsweise mal Morgana angetestet und komme gut mit ihr klar. Weiß jetzt nur nicht, ob ich Sie lieber mit Armor Pen/Magic Pen,Armor,Ability Power,Movement Speed oder mit Armor Pen,Armor,MR, Movement Speed spielen soll. :)\n\nSpiele auch gerne Nami, hier hab ich das gleiche Problem. \n\nBei Braum/Leona z.B. spiele ich Armor/Health/Mr/Armor\n\nAn die erfahrenen ranked Supporter: Spielt ihr mit den gleichen Masteries oder passt ihr die von Supporter zu Supporter bzw. Spiel für Spiel neu an?","replies":[{"poster":"Lady Yunalesca","date":"2015-03-23T11:01:41.458+0000","up_votes":1,"down_votes":0,"body":"masteries checke ich meist jedes game auch wenn ich da ca.4 oder 5 seiten habe \nmeistens schaue ich nur was im defensiven baum geändert werden kann/muss zum beispiel ob ich auf der botlane/gegner team mehr magischen oder ad schaden hab etc.\nwenn unser team viele slows hat und ich thresh spiele nehme ich oft den Punkt Opression in defense \nall sowas:)\nfür ap supporter nehme ich meistens 9/0/21 masteries oder 0/9/21 wenn die lane richtig ekelig wird zb cait thresh oder ähnliches.\nbei leo gehe ich meist 4/5/21 wobei ich mir da einfach noch die cdr aus dem angriffsbaum hole,erlaubt mir einfach öfter zu engagen etc oder eine defensivere Seite wie 0/16/14 wenn du dir sicher bist dass ihr viel kill pressure habt geht wohl auch 9/18/3 wobei du halt auf viel gold verzichtest.genau so geht aber 0/9/21 \nMan hat viel Entscheidungsfreiheit als Support daher ist es nützlich jedes spiel darüber nachzudenken welche masteries wohl am besten wären \n\n\nZu den Runen,normalerweise ist hybrid pen am besten da du sowohl mit deinen Fähigkeiten als auch mit deinen Autoattacks harrassen willst\nMovementspeed runen  benutze ich eig gar nicht,hilft mir nicht viel auf der lane und wenn ich mvmt speed brauche habe ich ja masteries oder halt mobi boots\nAmor solltest du immer drinhaben,es reduziert ja immerhin ad-schaden wie Autoattacks,minion dmge,tower dmge etc.\nkannst dich auch mal bei den Pro spielern umschauen was sie so benutzen :)\nFür Tank Supporter würde ich übrigens nie Fulltank runenseiten benutzen!\nSie sind an sich schon tanky zb leo viel base health Amor/mr buff mit ihrem w etc\nda ist es angebracht irgendwo schaden herzubekommen zb durch ad Quints \nsonst bist du nur tanky steuerst aber keinen schaden in einem trade bei :)","replies":[]}]},{"poster":"Armaderschaden","date":"2015-03-23T10:07:45.513+0000","up_votes":1,"down_votes":0,"body":"Ich verwende je nach Support Champion unterschiedliche Runenseiten, deswegen habe ich mir auch mittlerweile 5 von denen erstellt.^^\n\nHauptrunen sind da:\nGelb = 8/Flat HP (jeweils 9 mal)\nEssenzen = 2 Rüstungsessenzen (die sollte man als Support immer drin haben da Sie auf fast die gleichen Rüstungswerte ergeben, als wenn wir 9 mal Rüstungsrunen auf Gelb einsetzen)\n1 variable Essenz = kann alles sein du kannst noch eine Rüstungsessenz einsetzen, wo du dann noch mehr Rüstung und Standfestigkeit hast, eine AP Essenz für AP Supporter oder Leben\nBlau = MR, Manareg, CDR, AP (hier unterscheiden wir je nach Support und Spielstil, auf Champs wie Sona, Morgana oder Annie lohnen sich auf jedenfall AP Runen, bei Tanks MR und bei Champs wie Nami oder Janna bevorzuge ich eine Mischung aus 6 mal Cooldownreduction, Manareg oder MR)\nRot = Rüstung, AD, Durchdringungsrunen (Rüstung ist klar billig und kann man selbst für den Anfang nehmen für Tanks aber wichtig, AD kann für Champions wie Thresh wichtig sein um besser mit Relic Shield arbeiten zu können und Druchdringungsrunen speziell Magie ist für AP Supports sehr gut, dabei halte ich die hybrid Durchdringungsrunen für eine bessere Wahl)\n\nHoffe das verschafft dir einen kleinen Überblick, für den Anfang wenn du dich noch nicht auf einem Spielstil festgelegt hast würde ich dir Standardseiten wie Rot(Armor), Gelb(Leben), Blau(MR), und Essenzen (Rüstung) empfehlen und erst danach wenn du einige Runenseiten hast sich spezialisieren.","replies":[]},{"poster":"BìgM","date":"2015-03-23T09:59:19.826+0000","up_votes":1,"down_votes":0,"body":"Ich besitze momentan 3 Support-Seiten.\n\nDavon eine ganz alleine für Thresh für die Bonus AD.\n\nDann eine Tankige mit Full Resi Runen + Life für z.B. Leona/Braum/Gragas o.Ä.\n\nund eine für Janna/Nami/Sona/Zyra und alles andere was ein bisschen mit AA's poken kann.\nDie ist mit hybrid-pen bestückt und hat zusätzlich eine Mischung aus MR und Mreg in blau.\n\nMeine Masteries passe ich zwar eigentlich für jedes Spiel und jeden Support neu auf das Spiel an,\nmeistens lande ich aber bei 0/9/21.\nIn ganz wenigen Fällen, wenns das Matchup hergibt, auch mal offensive 9/0/21.\nBei tankigen Varianten ist auch eine 0/14/16 möglich.","replies":[]},{"poster":"Lady Yunalesca","date":"2015-03-23T08:29:21.953+0000","up_votes":1,"down_votes":0,"body":"Ich habe momentan 6/7 Support Runenseiten oder so,2 generelle für poke lastige Supporter wie Nami,Sona,lulu und eine für Leona,thresh etc.\nHybrid penetration  ist für so ziemlich jeden Supporter gut,benutze ich auch bei fast allen Seiten.Ansonsten benutze ich höchstens noch ad reds.\nin blau größtenteils mr und ein wenig mana regen,und wenn nicht viel ap dmge da ist habe ich eine seite mit ap+mana reg in blau.\nDu brauchst auf jeden Fall Amor Quints und Health +8  seals,entweder habe ich in den gelben voll hp und in den quints amor,oder mische in den gelben hp und amor.\ndie meisten nicht tank supporter sind halt sehr squishy und daher brauchst leben damit nicht direkt getötet wirst ^^\nGold income Runen braucht kein Mensch,dafür hast du deine masteries und ein Golditem,daher gibt es weit aus effektivere Sachen.\nWie gesagt auf einer Runenseite kann man schlecht für alle supports was passendes finden^^\n\nKann dir höchstens ein paar Beispiele nennen\n\nLeona/Braum/thresh benutze ich häufig:\n* ad red\n* Amor yellow\n* mr blue\n* ad Quints\ndiese supporter bringen an sich schon eine gewisse tankiness mit deswegen verzichte ich meistens auf Lebens Runen :) auch hier könnte man anstatt ad red hybrid penetration nehmen passt beides gut\n\nauf Nami/sona/lulu\n* 5x amor yellow,4 x hp\n* hybrid pen in rot\n* 3-4 x mana regen in blau,rest magie resi\n* 3x ability power in Quints\n\nAnsonsten habe ich noch eine Seite die auf Full-tank ausgelegt ist die ich allerdings eher selten benutze\neine seite mit cdr für zum Beispiel morgana\neine mit scaling mr und ad,hybrid pen\neine seite ohne mr dafür ap\netc etc\nHoffe konnte etwas helfen :)","replies":[]},{"poster":"IKartoffelI","date":"2015-03-23T05:52:48.539+0000","up_votes":1,"down_votes":0,"body":"Ich spiel bestimmte Supporten gerne mir Ad in rot (poke durch aa) und nen mix aus manareg und mr in blau. Gelb immer Rüstung und Quints grade Gold/sek aber das änder ich wahrscheinlich.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-03-23T01:56:51.005+0000","up_votes":1,"down_votes":0,"body":"Also ich habe mittlerweile 5 unterschiedliche Support Runenseiten... wenn man es übertreiben will... \nWas die alle gemeinsam haben: Rüstungs-Siegel...\nAber: Meine Support AP Runen nutze ich mittlerweile auch für allgemeine AP vs AD Set Ups auf Mid und Top. Du musst dir (Da du keine Gold Essenzen mehr als Standart brauchst) nicht unbedingt Gedanken über Support-Runen, sondern über \"welche Runen nutze ich in welchem Match Up?\" machen...","replies":[]},{"poster":"Aenrikr","date":"2015-03-23T01:07:19.849+0000","up_votes":1,"down_votes":0,"body":"Ich spiele Main Support, meine Antwort wird dir aber nicht gefallen ^^\n\nAktuell habe ich schon 3 Seiten nur für meine Supporter.\n\nFür Tanky Supports wie Taric, Leona, Thresh und Braum empfehle ich Rüstungszeichen, Lebenssiegel, Glyphen der Magieresistenz und Rüstungsessenzen.\n\nBei Supports die ich aggressiv spiele, wie z.B. Zilean, Nami und Sona, verwende ich die gleichen Runen, nur die Zeichen bestehen dabei aus Hybriddurchdringungsrunen.\n\nSpeziellere Supporter wie Janna und Bard setze auch mit den Tankyrunen ein, allerdings benutze ich bei diesen Essenzen der Bewegungsgeschwindigkeit statt Rüstung um ihr Roaming zu unterstützen.\n\nMit dieser Aufstellung müsstest du allerdings alle deine Runenseiten für den Support verwenden und könntest damit allerhöchstens noch nen Tank auf der Toplane spielen. Such dir also erstmal einen bestimmten Support-Typ aus für den du eine Runenseite verwenden möchtest.\nWenn du dann später mal ein Paket Runenseiten kaufst, kannst du immer noch differenzieren ^^\nUnd irgendwann kommst du wie ich an den Punkt, wo nicht einmal das mehr genug ist XD","replies":[]},{"poster":"Däif","date":"2015-03-22T22:55:15.829+0000","up_votes":1,"down_votes":0,"body":"Adde mich ruhig Ingame, dann kann ich dir besser helfen. Bin zwar kein Main Supporter (mehr), aber bin auf der Position trotzdem sehr erfolgreich (in meiner Elo)","replies":[]}]}