{"poster":"President Swa1n","date":"2016-10-22T18:10:13.044+0000","title":"Genuine Question: What do you Suggest be Done About Ranged Champions Apparently Having An Advantage?","subforum":"Gameplay","up_votes":5,"down_votes":2,"body":"Please give specific solutions, I genuinely want to know.","replies":[{"poster":"Commit Sudoku","date":"2016-10-22T18:16:17.532+0000","up_votes":4,"down_votes":0,"body":"Nothing (atleast for a few patches). These champions aren't inherently broken there counters fell out of the meta making them strong. It is a new meta people just need to learn to adapt. Remember Tank-Cinderhulk meta people complained because they didnt adapt eventually things were buffed/nerfed and the Assassin meta came back then they were buffed/nerfed and the FeralFlare meta came in and so on and so forth it is simply another phase in league. Everything is a PHASE in league the game changes literally every 14 days I don't understand why people are like how could this happen league will never be \"balanced\" and honestly that is the appeal. If everything was balanced shit would be so boring. League is always changing giving us gameplay that isnt stagnant as long as things aren't \"OP\" for too long it is fine. It's only been 2 or 3 patches of ranged meta its been fighter tops and tank supports for 6 months before that.","replies":[{"poster":"President Swa1n","date":"2016-10-22T20:18:31.678+0000","up_votes":1,"down_votes":0,"body":"TBH, I haven't been too sure myself whether is an issue. I realize there are circlejerks, but this one somewhat convinced me for some reason.\n\nOverall, I think you have the right idea.","replies":[]}]},{"poster":"Wulf Helhammer","date":"2016-10-22T18:12:18.756+0000","up_votes":6,"down_votes":2,"body":"Teach people how to play better instead of complaining","replies":[{"poster":"DunkinNoobs","date":"2016-10-23T00:03:46.058+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AvantelWings,realm=NA,application-id=3ErqAdtq,discussion-id=uQx0373m,comment-id=0000,timestamp=2016-10-22T18:12:18.756+0000)\n>\n> Teach people how to play better instead of complaining\n\nBingo. There are things you can do to make playing a melee champ vs a ranged champ more equitable. Most people suck at those things if they even know what they are and therefore get shit on. I actually played against a Riven today who complained about how bullshit my poke is when she went 12/18/0 masteries, hp/lvl seals, and started longsword refillable. Like come on dude, at least do your part before you start complaining. That's like the morons that go no MR and Armor seals against Leblanc and then complain her early game is so good.","replies":[]}]},{"poster":"CerealBoxOfDoom","date":"2016-10-22T19:53:39.074+0000","up_votes":3,"down_votes":0,"body":"Nothing at all\n\nranged or melee will always have an overall advantage and it doesn't actually matter as long as there are situations in which melee can gain advantage and there are situations where this can be somewhat forced (i.e. league does not become a 1v1 game)\n\nAs long as league is a team game there is no actual problem with ranged having an advantage. The reason for this is complicated and has decades of history behind it","replies":[]},{"poster":"Ralanr","date":"2016-10-22T18:15:20.653+0000","up_votes":3,"down_votes":0,"body":"Bad Ideas: \n\nreduce their defensive stats by 25-50% to enforce the strong desire to keep their distance. That way it's easier to punish them when they get caught out. \n\nHave tenacity only work half as well for them. Though this punishes immobile marksmen more. \n\nForce ranged AA's to require aim (this is god awful stupid though). \n\nThose are all ideas that I consider really bad. I'm honestly not sure how to deal with it on a full scale.","replies":[]},{"poster":"Calabok","date":"2016-10-22T19:06:48.980+0000","up_votes":2,"down_votes":0,"body":"there is nothing to fix for there is no issue.","replies":[]},{"poster":"ForgiveColour","date":"2016-10-22T18:40:40.968+0000","up_votes":2,"down_votes":0,"body":"Revert the buff on kennen jayce and rumble","replies":[]},{"poster":"Sasogwa","date":"2016-10-22T23:14:20.357+0000","up_votes":2,"down_votes":1,"body":"Nerfing ranged champions base AD\nBuffing Doran's shield and make it slightly biased against ranged champions\nNerfing lategame melting of ADC's by reducing Dominiks/Mortal's to 40%\nChanging Rylais","replies":[]},{"poster":"Teridax68","date":"2016-10-22T22:07:34.157+0000","up_votes":1,"down_votes":0,"body":"As CerealBoxOfDoom mentioned, League has always been a state where either ranged or melee have had an advantage over the other. Up until around Preseason 4, melee champions had the advantage, because they had easy access to tremendous amounts of both damage and durability, which turned them into brick walls capable of resisting most incoming damage, while essentially auto-winning fights against ranged opponents if they were in melee range. Since then, tanky items have deflated significantly, and tanky DPS itemization has also been transformed to give fewer free stats. As a result, melee champions as a whole have become much more vulnerable to poke and harass, which makes them suffer against ranged champions in lane.\n\nI think the fundamental issue at the moment is that, while ranged champions have a significant advantage over melee champions (i.e. range), one that no melee champion can gain through any means, the reverse isn't true. Melee champions tend to have greater overall base stats than ranged champions, but that advantage isn't consistent or definite: for any given base stat, there are some ranged champions with equal or greater base stats than some melee champions, and there are a host of items that let ranged champions exceed the base stat values of any melee champion. This also extends to abilities and innate defenses, and while melee champions tend to be more resilient and more mobile, there are many ranged champions with sustain, shields, dashes, or blinks. Effectively, even though melee champions tend to have some kind of compensation for not being ranged, they cannot claim to have any one, clear melee-only strength.\n\nPersonally, I think the one advantage melee should have over ranged is movement speed. Even the slowest melee champion should, as a baseline, be able to move faster than a ranged champion, which should mean that while ranged champions should have an initial advantage in their ability to strike first, melee champions should have more options when it comes to entering and exiting fights. Because of this, I think the solution should be to buff the base movement speed of every melee champion, and deflate the rest of their base stats accordingly: because melee champions would be guaranteed to reach ranged champions in most cases, they wouldn't need to auto-win combat against ranged when within melee distance, and so would need less base durability and damage to function. This would also answer some other issues: many melee champions have MR growth purely as a melee standard, for example, when they're intended to be vulnerable to magic damage. Many Slayers, i.e. squishy melee champions, have higher base health than most squishy ranged champions, which makes them synergize more with tanky itemization than they're supposed to. With higher base movement speed and fewer other base stats, they could be comfortably shifted to the same health/armor class as their ranged counterparts.","replies":[]},{"poster":"Big Lincoln","date":"2016-10-22T18:38:19.282+0000","up_votes":1,"down_votes":1,"body":"item penalties like Ghostblade used to have, put them on masteries as well like the old double edged sword \n\nbase stats\n\nnew masteries that are stronger vs ranged harass\n\nbuff doran's shield","replies":[{"poster":"LoLKiru","date":"2016-10-22T19:05:48.358+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=3ErqAdtq,discussion-id=uQx0373m,comment-id=0005,timestamp=2016-10-22T18:38:19.282+0000)\n>\n> item penalties like Ghostblade used to have, put them on masteries as well like the old double edged sword \n> \n> base stats\n> \n> new masteries that are stronger vs ranged harass\n> \n> buff doran&#x27;s shield\n\nBuffing dorans shield is honestly the easiest fix to the issue, and it doesn't need to be a general buff either (since just flat out buffing it made it mandatory on EVERYONE)\n\n\"If you are a melee unit: You take XX Reduced damage from ranged basic attacks (Excluding Tower Fire damage from Epic Monsters) in addition to the above bonuses\"","replies":[{"poster":"President Swa1n","date":"2016-10-22T20:20:55.231+0000","up_votes":1,"down_votes":0,"body":"I may be wrong, but I believe people will continue complaining after this. For example:\n\n\"Riot, why is it necessary for melee champions to spend 450 Gold on an item with no build path just to be able to SURVIVE against ranged champions?\"\n\nPersonally, I myself am not too sure whether there is an issue here at all.","replies":[]}]}]},{"poster":"Selegun","date":"2016-10-22T19:50:19.097+0000","up_votes":1,"down_votes":0,"body":"I would like to see some nerfs to ranged base HP regen.  This would help keep damage on those types of characters since they will just buy lifesteal and potions to keep them topped off.","replies":[]},{"poster":"ZephyrDrake","date":"2016-10-22T18:45:08.578+0000","up_votes":1,"down_votes":0,"body":"the only thing that needs to be done is to nerf Jayce since he is overtuned atm","replies":[]},{"poster":"Hrd2H1t","date":"2016-10-22T22:55:18.809+0000","up_votes":1,"down_votes":1,"body":"Make {{item:1054}} actually worthwhile","replies":[]},{"poster":"DarkRitual","date":"2016-10-22T18:34:10.425+0000","up_votes":1,"down_votes":1,"body":"Mastery that increases the effectiveness of Bonus Armor against ranged attacks.","replies":[]},{"poster":"AcidTheWarlock","date":"2016-10-22T18:13:40.805+0000","up_votes":1,"down_votes":4,"body":"Better base stats on melees and weaker items/masteries on ranged.","replies":[]}]}