{"poster":"TheFlamingHero","date":"2019-09-25T13:02:41.916+0000","title":"COMPORTAMENTO INAMMISSIBILE","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Dopo 6 Ranked giocate con altrettanti troll(Si ho preso 1 troll o 2 in ogni partita) Ho scritto nel post partita seguenti parole \"Enjoy Your Ban Kiddo\", il giocatore che era rimasto afk dopo aver volontariamente intato il game non ha subito alcuna ripercussione mentre a me è stata bloccata la chat, state scherzando spero, è un offesa a tutta la community di LOL, con queste parole voglio solo dire che se i Rioter non sanno fare il loro lavoro non vedo alcun senso nel dargli dei soldi, è oggettivo e non un offesa che facciate schifo nel vostro lavoro spero che vi sottopaghino.","replies":[{"poster":"Retardo DiCaprio","date":"2019-09-25T13:27:39.469+0000","up_votes":6,"down_votes":0,"body":"Onestamente sarebbe più facile se condividessi il log che ti viene mandato per il restrict, perchè mi pare estremamente difficile che tu abbia ricevuto un chat restrict per un solo messaggio in post-game.\n\nIn generale: Non sono i Rioter che bannano ma un sistema automatico che segue un algoritmo (il che rende ancora più difficile credere che tu ti sia limitato a scrivere solo quel messaggio in post-game per essere punito). Qualunque cosa tu abbia scritto il sistema l'ha individuata e ha proceduto. Riguardo agli inting e gli afker, il fatto che abbia \"volontariamente intato\" è da dimostrare e come penso tutti siate in grado di comprendere è molto più difficile dimostrare che qualcuno stia intando (invece di semplicemente giocare male) piuttosto che difendersi davanti ad un log con la prova concreta delle proprie colpe. \n\nL'unica cosa che posso consigliare e che non smetto di ripetere è questa: se avete qualcuno che inta o va afk e avete paura che il sistema non lo individui perchè è estremamente difficile per una macchina capire le \"intenzioni\" delle persone, mandate un ticket al supporto e fate visionare il game da un Rioter, solo così riuscirete a concludere qualcosa. I post lamentela sul forum non aiutano nessuno, per quanto possa farvi piacere sfogarvi con tutti.","replies":[{"poster":"andryex12","date":"2019-09-25T15:54:19.590+0000","up_votes":1,"down_votes":0,"body":"> Onestamente sarebbe più facile se condividessi il log che ti viene mandato per il restrict, perchè mi pare estremamente difficile che tu abbia ricevuto un chat restrict per un solo messaggio in post-game.\n\n\n\nnon è DIFFICILE...è IMPOSSIBILE","replies":[{"poster":"Retardo DiCaprio","date":"2019-09-25T16:23:46.662+0000","up_votes":1,"down_votes":0,"body":"Non mi piace dire impossibile, errori e bug in queste cose possono capitare e non escludo mai al 100% che possa essere successo, però mi limito al 99.99999%.","replies":[]}]}]},{"poster":"Térence Fill","date":"2019-09-25T13:07:33.123+0000","up_votes":3,"down_votes":2,"body":"Ora ti verrà risposto (da tantissimi/e) che, semplicemente, dovevi reportarlo senza stare a scrivere nulla. Ed il Chat Restriction è giusto perché hai sfogato la tua frustrazione in 4 parole (cosa assolutamente NON necessaria e totalmente inutile ed insensata).\n\nE non potrai aggiungere altro perchè, di fatto, è così.","replies":[{"poster":"MindFlamer","date":"2019-09-25T13:33:50.047+0000","up_votes":1,"down_votes":1,"body":"O fare come ha detto %%%%%%o DiCaprio qua sopra, mandare un ticket al supporto sperando visionino un game. Perché come è stato appunto detto ogni volta, non ci si becca una punizione per solo quattro parole. O non è vero che ha scritto solo questo, o è stata semplicemente la goccia che ha fatto traboccare il vaso.","replies":[{"poster":"Térence Fill","date":"2019-09-25T14:14:47.568+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pirata Fred,realm=EUW,application-id=MJVj50Jw,discussion-id=eTu9XZrd,comment-id=00000000,timestamp=2019-09-25T13:33:50.047+0000)\n>\n> O fare come ha detto %%%%%%o DiCaprio qua sopra, mandare un ticket al supporto sperando visionino un game. Perché come è stato appunto detto ogni volta, non ci si becca una punizione per solo quattro parole. O non è vero che ha scritto solo questo, o è stata semplicemente la goccia che ha fatto traboccare il vaso.\n\nEsattamente.\n\nTanto la soluzione resta una: /mute all.\n\nE non premere alcun tasto in Chat.","replies":[]}]}]},{"poster":"KÐβ Śarah Iημ","date":"2019-09-25T18:26:16.530+0000","up_votes":2,"down_votes":1,"body":"Non puoi sapere che non è stato penalizzato. Come viene spiegato ogni 2/3 post, la notifica non arriva ogni volta che il sistema prende provvedimenti.","replies":[]},{"poster":"The Last Dotz","date":"2019-09-25T13:50:22.992+0000","up_votes":2,"down_votes":2,"body":"Abbiamo accettato la tua dichiarazione e provvederemo a bannare il giocatore in questione. \n\nCi dispiace per il suo comportamento sgradevole nei tuoi confronti.","replies":[]}]}