{"poster":"The Eve of Night","date":"2018-05-18T18:51:40.176+0000","title":"Welp, That Killed Jungle Diversity and any Interest I Had Playing This Game","subforum":"Gameplay","up_votes":107,"down_votes":22,"body":"From my summoner name you could ascertain quite easily who my favorite champion is. And guess what that champion sucks at? If you answered &#039;early dueling&#039; you would be correct. Surprisingly, I&#039;m not even really mad about the change or exploding into a toxic fit of rage like most others are. I&#039;m just...disappointed. I won&#039;t be playing League of Legends this patch or any future patch until jungle diversity is restored. I just can&#039;t be bothered. I don&#039;t find any of the early dueling champions fun and I will not gimp my teammates because I want to make Evelynn work. Balance team said they want to expand jungle diversity and end up doing the exact opposite. There was a post earlier this week on the board thanking riot for everything that they have done. I&#039;ve had a lot of fun over the years but...I can&#039;t bring myself to thank them for anything at the moment. I&#039;ll get over it eventually but I still won&#039;t be playing. I wish every other player out there the best of luck. \n\n\n\n{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"Counter Clown","date":"2018-05-18T19:02:52.027+0000","up_votes":40,"down_votes":13,"body":"Early Champions sucks now... Counterjungle and youre afk.... Riot Games Sucks... Garbage Changes..... They really want us to play another games.","replies":[]},{"poster":"Wild Geese","date":"2018-05-18T22:43:17.124+0000","up_votes":21,"down_votes":2,"body":"I don't understand how they can say \"we want to increase jungle diversity\" while at the same time they remove the attackspeed from machette, and then say they're going to followup by increasing attackspeed of \"junglers\" if they have a problem.\n\nWaittt- what???","replies":[]},{"poster":"Salson","date":"2018-05-18T22:00:49.993+0000","up_votes":16,"down_votes":28,"body":"I borderline quit League until I heard of the Jungle changes some 2 weeks back.\n\nNow I'm back, and it's a blast getting to lane again without some ass trying to ruin my game by forcing 2v1s.\n\nSo to each his own I guess.","replies":[{"poster":"Feed or Famine","date":"2018-05-18T22:47:12.973+0000","up_votes":23,"down_votes":2,"body":"as a laner, I can see the changes being good. As a jungle main, they are pretty bad, not gonna lie. Tanks aren't viable, scaling junglers are mostly bad, so all that's left are early skirmishers, counter jungle focused champions like shaco, and objective control champs, which is pretty much just Nunu","replies":[{"poster":"Salson","date":"2018-05-18T23:41:26.592+0000","up_votes":12,"down_votes":2,"body":"Makes sense, your role did get nerfed.\n\nBut honestly, feels like most champs that needed nerfs last patch, still need them.\n{{champion:121}} {{champion:104}} {{champion:5}} {{champion:77}} {{champion:35}} \nThis bunch, right?","replies":[{"poster":"Feed or Famine","date":"2018-05-19T05:13:40.089+0000","up_votes":1,"down_votes":1,"body":"Besides Kha and maybe graves, I wouldn't say that they need nerfs. Or, at least, maybe they do now. But honestly, even if they do get nerfed, it will just bring up slightly less op assassin/skirmish junglers to the forefront, it won't change the meta.","replies":[{"poster":"Battalion","date":"2018-05-19T22:27:50.154+0000","up_votes":1,"down_votes":0,"body":"Graves is ridiculous right now. Also Kha'zix is pretty insane since the meta is for him, but other than that I think Shaco is fine if people ward up.","replies":[]}]}]}]}]},{"poster":"Mr Noggenfogger","date":"2018-05-19T00:10:05.367+0000","up_votes":13,"down_votes":0,"body":"It must suck for your main to be at a 49.97% win rate","replies":[{"poster":"saltran","date":"2018-05-19T06:41:57.655+0000","up_votes":3,"down_votes":0,"body":"Literally unplayable.","replies":[]},{"poster":"Feed or Famine","date":"2018-05-19T23:00:45.011+0000","up_votes":1,"down_votes":0,"body":"same doe","replies":[]}]},{"poster":"Cavesloth","date":"2018-05-18T20:34:26.055+0000","up_votes":17,"down_votes":5,"body":"I left league awhile ago, I keep checking in to see if they fixed the problems, but they keep creating new reasons I shouldn't come back. Oh well I guess I just need to get better at Fortnite.","replies":[{"poster":"Tomoe Gozen","date":"2018-05-19T16:48:26.847+0000","up_votes":1,"down_votes":3,"body":"Posts like yours have no place here.\nI personally don't care what game you play in your past time or what's your League replacement. No one asked you and volunteering this information made me think that you're here to more or less threaten Riot and dangle that carrot like they could get you back if they met your demands.\n\nIf you want to participate in further discussions, keep them League related and at least provide something of substance so that people who want to talk about League, can respond to you without wasting their time.\n\nIf you actually replaced League with Fortnite a while back, this statement \"i guess i just need to get better at Fortnite\" should've been a natural order of business if you're spending time playing a different game. Unless you really didn't give a damn about that game and was just wasting your time pretending like League doesn't matter to you anymore. Which is again proven by the fact that you're a lurker here that you had to announce you're lurking and how some other game fulfills the hole in your heart \"until Riot fixes it\".","replies":[{"poster":"Cavesloth","date":"2018-05-20T20:43:47.510+0000","up_votes":1,"down_votes":0,"body":"That would require Riot to listen to the community, they didn't when I DID comment on and post on things of substance and took their surveys and tried to get them to listen, but Riot DOES NOT CARE about substance unless it has to with the LCS and \"Muh big plays!\". This thread is about a person leaving League because they are unhappy with it, this is EXACTLY the place to post what I posted. \n\nAnd yes, for a long time I WAS hoping Riot would fix the issues, and I really am not the biggest fan of Fornite (its just ok, not great but at least they try to keep the game fresh every few patches without completely reinventing the wheel like Riot attempts to), if my comp could run something better I'd play it. But I gave up hope Riot pulling their head out of their ass a long time ago. I come here to see how far they will fall before they figure it out, like a spectator watching a horrible train wreck, I just cannot look away.","replies":[{"poster":"Tomoe Gozen","date":"2018-05-21T12:25:54.305+0000","up_votes":1,"down_votes":0,"body":"Feedback and surveys do not guarantee that Riot will do what you want them to do.\nGiving feedback isn't like making a demand in written form. Do not treat it as such.\n\nYou didn't manage your expectations and think that you, as a player, has the ability to make changes to League on a level of developers by simply asking for them on their forums. Riot doesn't work for you, it's their game. And i also urge you to recheck your statement about \"Riot not caring about the community\" when you have replays, runes, new client, practice mode, etc. in the game - which are the direct results of us asking for it and them delivering (albeit a bit later). Then Marksmen adjustments in 8.10. 11 and 12, Fighter adjustments and new items, gold spread out from team gold to solo gold (solo cary potential) - everything that people yet again asked for.\n\nIt's funny how confirmation bias works.\nYou only remember when it's convenient for you to remember or if specifically your needs are being met. You're not the only player in this community, Riot has to work for the benefit of many, not few. The one who needs to pull their head out of their ass is frankly, you.\n\nAnd one more thing, the issues you speak of are a still under a big question mark because you still didn't elaborate what you think are the problems League faces/has. I'm not clairvoyant nor should i be required to look up your post history \"a few years back\" in order to be up to speed. if you wanted to discuss something of substance, you should've/could've started with that and not with a vapid reply like yours.\n\nJust because someone makes a thread \"I eat shit for breakfast\" and it's in some magical way allowed to stay, it doesn't mean you have to share your experiences. At least have the common decency to know what you should and shouldn't be encouraging on the boards. If you want to express your displeasure in the direction League has gone in, be my guest but when you're writing such posts, you still need to understand that it shouldn't be written as an empty threat to Riot or talking shitabout them either.\n\nIf you want a discussion, it can't be about your feelings.\nIt has to be about the changes that you don't like so that people can tackle it from a few more different points of view. Too bad that many of the board-goers still haven't even grasped the basics of writing such posts.","replies":[{"poster":"Cavesloth","date":"2018-05-22T02:45:45.222+0000","up_votes":1,"down_votes":0,"body":"Wow just wow, I can't stop laughing, you picked the wrong thread and the wrong guy to try to have a serious discussion.\n\nThere was a time when I cared enough about League to debate a fanboy like yourself, making points about how the shit they are doing is not only bad game design, but so woefully ignorant of basic human behavior but that time is LONG gone. \n\nI was a HARDCORE addict (like relationship ending level addiction), earning every possible chest, doing every mission, but once the preseason rolled around and the snowbally shit went completely out of control, I held out for much longer than I should have (3 excruciating months), I can't help it, I'm Austistic, I don't like to change games, but the shit they crapped out, geezus f-ing christ its like they made the perfect game for masochists, and I ain't about pain man, if that's your bag more power to ya. And I could break free from it, that should be a wake-up call. When the hardcore addicts can break free from your game, you shit the bed hard my friend.\n\nLeague is dead to me, I'm just here to watch it slowly burn up like a fat alcoholic that fell asleep smoking.","replies":[{"poster":"Tomoe Gozen","date":"2018-05-22T11:15:34.351+0000","up_votes":1,"down_votes":0,"body":"If you didn't care, you wouldn't be here complaining about how you don't care.\nEspecially in front of an audience. You're not lying to me, you're only lying to yourself.\n\n>League is dead to me\n\nIt clearly isn't, if you have to say it out loud when no one asked you.\nThe fact that you have to affirm your attitude to yourself by telling a group of strangers that you \"don't care\" means the exact opposite. No one asked you, no one cares, no one knows who you are. You could've as easily \"not cared\" in silence and it wouldn't have made a difference, except sparing the rest of us a headache. And don't take this as an insult. I'm also a random stranger to you and everyone else.\n\nIf i adopted the same attitude, went around \"leaving League\" posts trying to \"share\" my vapid wisdom, pestered Rioters about their \"shit\" game and at every opportunity said how \"League is dying\" - i would've been labeled as a salty butthole that can't fucking let go. Not as someone that is clearly over with League.\n\n\nThe fact that you stopped playing doesn't mean anything. Players come and go to every game as massive as League so you stopping your login streak you had going for years means absolutely nothing on a grand scale of things. People leave for various reasons, among them being game balance they disagree with.","replies":[{"poster":"Cavesloth","date":"2018-05-24T15:21:00.694+0000","up_votes":1,"down_votes":0,"body":"Dude don't even know where to begin with you lols, you're too funny man.","replies":[]}]}]}]}]}]}]},{"poster":"YOU SO BAD","date":"2018-05-19T06:44:58.020+0000","up_votes":1,"down_votes":4,"body":"Plays a jungle champion as main and complain about not being able to duel early? Your doing something wrong if you solo dueling anyone as a jungler. just saying.","replies":[{"poster":"F1SHEYES","date":"2018-05-19T07:05:06.049+0000","up_votes":6,"down_votes":0,"body":"New scuttle forces solo dueling since side lanes are usually too focused on their own problems.","replies":[{"poster":"YOU SO BAD","date":"2018-05-19T07:09:45.256+0000","up_votes":2,"down_votes":8,"body":"> [{quoted}](name=F1SHEYES,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=00180000,timestamp=2018-05-19T07:05:06.049+0000)\n>\n> New scuttle forces solo dueling since side lanes are usually too focused on their own problems.\n\nwrong. \n\nIf your not good a dueling you counter jungle while your enemy takes scuttle \n\nor you just give them it and gank a lane as you know where the enemy jangler is. \n\nor you know where the jungler is and you counter gank  his gank after he takes scuttle\n\nAnd then if you still want vision by the scuttle you just use a ward. \n\nThere are tons of options.\n\nJungler diversity was way better when there were 0 scuttles in the game.  \n\nScuttle was only added to increase objective awareness.","replies":[{"poster":"Risen29","date":"2018-05-19T07:53:33.134+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=YOU SO BAD,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=001800000000,timestamp=2018-05-19T07:09:45.256+0000)\n\n> or you just give them it and gank a lane as you know where the enemy jangler is. \n\nWhat ignorance. \nThe whole point of the scuttle changes was to stop you from doing that.\nThe jungler who gets scuttle is usually the one who has the ability to gank, because he's the one that will be healthier and hit level 3 sooner. \n\n> or you know where the jungler is and you counter gank  his gank after he takes scuttle\n\nNot going to happen when you're down in levels and at lower health.\n\nDefinitely not going to happen if you have a jungler who is weak at early dueling. \n\n> If your not good a dueling you counter jungle while your enemy takes scuttle \n\nDoesn't work for junglers who don't have strong and healthy early clearing ability. \n\n\nThis is all why viable jungling champions have narrowed down to those who are both good at early clears and good at early dueling.\nThey were already strong before, and farming/tank junglers were already weak before, so these changes have made the gap only more extreme. \n\nThese changes also haven't done a damn thing to prevent those level 3 ganks, other than maybe slow them down a tad. So maybe you get ganked in top lane at the 3:30 mark instead of the 2:40 mark. But it is still going to happen just the same. \n\n> Jungler diversity was way better when there were 0 scuttles in the game.  \n\nWhat bizzare planet are you living on that would lead you to ever conclude that more junglers are viable now than before?\n*Checks op gg*.\nOh, I see.\nYes, bronze 4 is a completely different planet. \nAt that elo you could jungle with ashe and still win. \n\nNone of these things matter in bronze 4 because the players are so bad at farming and pathing that things like scuttle experience are completely irrelevent. They don't play the game at close enough margins for small advantages like that to mean anything. Players at that level also make so many mistakes that any small advantages they did gain would be wiped out by 10 times more mistakes anyway. \n\nAt high elo it's a completely different story. The jungler who gets ahead can shut down the other one and never let them recover by gaining that early exp lead.\n\n\n","replies":[{"poster":"Trias000","date":"2018-05-19T16:04:15.103+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Risen29,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=0018000000000000,timestamp=2018-05-19T07:53:33.134+0000)\n>\n> The jungler who gets scuttle is usually the one who has the ability to gank, because he&#x27;s the one that will be healthier and hit level 3 sooner.\n\nHealthier - yes. Level 3 sooner - no. Scuttle crab gives the same exp as gromp.","replies":[{"poster":"Risen29","date":"2018-05-19T16:37:00.898+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Trias000,realm=EUNE,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=00180000000000000001,timestamp=2018-05-19T16:04:15.103+0000)\n>\n> Healthier - yes. Level 3 sooner - no. Scuttle crab gives the same exp as gromp.\n\nBeing forced to take damage from a fourth camp instead of taking scuttle to heal up can make all the difference in whether or not you'll gank.","replies":[{"poster":"Trias000","date":"2018-05-19T17:31:35.732+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Risen29,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=001800000000000000010000,timestamp=2018-05-19T16:37:00.898+0000)\n>\n> Being forced to take damage from a fourth camp instead of taking scuttle to heal up can make all the difference in whether or not you&#x27;ll gank.\n\nRead my comment again. Will you get level 3 earlier than the enemy jungler if you take the scuttle crab? No, you won't.\nI never said anything about ganking.","replies":[]}]}]},{"poster":"YOU SO BAD","date":"2018-05-19T08:05:06.900+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Risen29,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=0018000000000000,timestamp=2018-05-19T07:53:33.134+0000)\n>\n> What ignorance. \n> The whole point of the scuttle changes was to stop you from doing.\n> The jungler who gets scuttle is usually the one who has the ability to gank, because he&#x27;s the one that will be healthier and hit level 3 sooner. \n> \n> Not going to happen when you&#x27;re down in levels and at lower health.\n> \n> Definitely not going to happen if you have a jungler who is weak at early dueling. \n> \n> Doesn&#x27;t work for junglers who don&#x27;t have strong early clearing ability. \n> \n> \n> This is all why viable jungling champions have narrowed down to those who are both good at early clears and good at early dueling.\n> They were already strong before, and farming/tank junglers were already weak before, so these changes have made the gap only more extreme. \n> \n> These changes also haven&#x27;t done a damn thing to prevent those level 3 ganks, other than maybe slow them down a tad. So maybe you get ganked in top lane at the 3:30 mark instead of the 2:40 mark. But it is still going to happen just the same. \n> \n> What bizzare planet are you living on that would lead you to ever conclude that more junglers are viable now than before?\n> *Checks op gg*.\n> Oh, I see.\n> Yes, bronze 4 is a completely different planet. \n> \n> At that elo, you could jungle with lucian and still win. None of these things matter in bronze 4 because the players are so bad at farming and pathing that things like scuttle experience are completely irrelevent. They don&#x27;t play the game at close enough margins for small advantages like that to mean anything.\n\nYou dont know me. Lol and nothing you said is valid at all as you now just raging about the rank this forum account has. \n\nThere are so many things wrong with your replys im not even going to bother.","replies":[{"poster":"Risen29","date":"2018-05-19T14:41:20.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YOU SO BAD,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=00180000000000000000,timestamp=2018-05-19T08:05:06.900+0000)\n>\n>There are so many things wrong with your replys im not even going to bother.\n>\n> You dont know me. Lol and nothing you said is valid at all as you now just raging about the rank this forum account has.\n\nThe typical internet scoundrel's cop out.\nYou can't respond because you don't know what you're talking about. \n\nYou're also not fooling anyone with your claims of being a forum account when you've played  12 normal games on it in the last two days and this is your third season in a row being placed in bronze.","replies":[{"poster":"F1SHEYES","date":"2018-05-19T15:59:37.891+0000","up_votes":1,"down_votes":0,"body":"To secure scuttle I usually go buff->scuttle->wolves->buff","replies":[]}]}]}]}]}]}]},{"poster":"koshkyra","date":"2018-05-18T23:00:41.234+0000","up_votes":3,"down_votes":7,"body":"***","replies":[{"poster":"ninjaroxas","date":"2018-05-18T23:49:02.114+0000","up_votes":8,"down_votes":1,"body":"Eve can't do much at level 2","replies":[{"poster":"KlydeFrog","date":"2018-05-19T00:56:37.643+0000","up_votes":3,"down_votes":6,"body":"Nothing changed on eve lol still tge same lvl 6 powetspike sooo nit sure what he is crying about","replies":[{"poster":"The Eve of Night","date":"2018-05-19T01:13:21.954+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=KlydeFrog,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=000800000000,timestamp=2018-05-19T00:56:37.643+0000)\n>\n> Nothing changed on eve lol still tge same lvl 6 powetspike sooo nit sure what he is crying about\n\nDuring this patch the game is decided way before you hit lvl6.","replies":[{"poster":"Terozu","date":"2018-05-19T02:31:21.356+0000","up_votes":4,"down_votes":3,"body":"Wait, so checking statistics she has the second highest winrate in jG at the moment.\n\nI don't understand why you're being so dramatic over this, she's been in the top 7 champ pool in jungle since her rework, even if this did dumpster her, which it didnt, she would deserve it by now.","replies":[{"poster":"Tik115","date":"2018-05-19T12:04:14.795+0000","up_votes":2,"down_votes":0,"body":"not sure where you're getting that stat from, she's no higher then 4th in diamond and it just gets worse the lower you go.","replies":[]}]},{"poster":"Terozu","date":"2018-05-19T02:26:33.627+0000","up_votes":3,"down_votes":4,"body":"But level 1 and 2 Eve has some of the highest DPS in the game and is an excellent dueler at those early stages.\n\nNot to mention her charm mixed with smite lets her burst down scuttlers far quicker than almost anyone but Nunu.\n\nI don't like the changes, but don't see why you seem to think Evelynn would have a hard time here.","replies":[{"poster":"KlydeFrog","date":"2018-05-19T14:59:22.838+0000","up_votes":1,"down_votes":0,"body":"Ivern begs to differ","replies":[]}]}]}]}]}]},{"poster":"mack9112","date":"2018-05-18T22:41:11.496+0000","up_votes":2,"down_votes":10,"body":"Most champions are still viable in the just got the game just is atba much slower pace now which I welcome. More power in the hands of the laners","replies":[{"poster":"Feed or Famine","date":"2018-05-18T22:52:14.107+0000","up_votes":10,"down_votes":2,"body":"No, they are not. As a tank, you have a very hard time contesting anything early, which means you fall behind. And then keep falling behind, because the enemy jungle is snowballing  and 2-3 lvls ahead by level 10. \n\nIf you are playing against a champion that is equally not meta, then maybe, yeah. But tell me most champs are viable after you play someone like Sej or Zac into any of the top 5 junglers and watch as you are just laughably useless.","replies":[{"poster":"mack9112","date":"2018-05-19T02:26:20.918+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=OctaGunslinger,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=00060000,timestamp=2018-05-18T22:52:14.107+0000)\n>\n> No, they are not. As a tank, you have a very hard time contesting anything early, which means you fall behind. And then keep falling behind, because the enemy jungle is snowballing  and 2-3 lvls ahead by level 10. \n> \n> If you are playing against a champion that is equally not meta, then maybe, yeah. But tell me most champs are viable after you play someone like Sej or Zac into any of the top 5 junglers and watch as you are just laughably useless.\n\nI play Zac and do just fine :)","replies":[{"poster":"Feed or Famine","date":"2018-05-19T05:10:48.898+0000","up_votes":3,"down_votes":1,"body":"I was a Zac/sej main until this patch. Wouldn't touch them with a 10 foot pole now.","replies":[{"poster":"mack9112","date":"2018-05-19T15:39:40.887+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OctaGunslinger,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=0006000000000001,timestamp=2018-05-19T05:10:48.898+0000)\n>\n> I was a Zac/sej main until this patch. Wouldn&#x27;t touch them with a 10 foot pole now.\n\nThat's a shame","replies":[]}]}]}]}]},{"poster":"Usefully Useless","date":"2018-05-19T04:58:11.420+0000","up_votes":3,"down_votes":0,"body":"This is classic Riot. Head the game in different directions, not better ones.\n\nEvery huge change has just shifted the power to other areas, not balanced the game.\n\nApparently the term \"balance\" means make certain roles / subroles obsolete for certain timelines.\n\nScrew this game, I can get mad at Fortnite without worrying about leaverbuster.","replies":[]},{"poster":"Velasan","date":"2018-05-19T02:37:10.413+0000","up_votes":3,"down_votes":0,"body":"The consistent problem with all the recent changes is that instead of letting people play the game their own way they keep trying to force everyone to contest things all over the map.\n\nFirst blood tower\nHerald\nIncrease to cannon minions\nElemental drakes\n\nAnd now scuttle crabs.  No one anywhere was like, \"dang I want to fight more over scuttle crabs.\"  It's bad enough that the team that is ahead gets a huge amount of vision control with scrying plants and the scuttle, now it also gives up a huge amount of gold and exp.\n\nI want them to focus on what makes the game fun for players and stop trying to force everything.  Scuttle crab changes are just Skarner Spires 2.0, no one wants to play all these mini games.","replies":[]},{"poster":"ยบ Kindred ยบ","date":"2018-05-19T16:05:35.099+0000","up_votes":1,"down_votes":0,"body":"I sure do love my self getting gang banged as {{champion:203}} aspecially since it actully tells you where you are going to be :^)","replies":[{"poster":"UragirimonoX","date":"2018-05-19T19:42:47.547+0000","up_votes":2,"down_votes":0,"body":"Fukin preach my dude, kindred has been analed brutally by this patch, im not sure what made riot hate the jg so much but this is ridiculous","replies":[]}]},{"poster":"WillSmiteforfood","date":"2018-05-19T13:06:19.818+0000","up_votes":2,"down_votes":0,"body":"I was a Xin main before the patch and  even I hate this patch despite it pretty much making Xin a god tier jungler now especially with the phase rush buff.  It is literally just terrible design and maybe the dumbest change I have ever seen made to this game. I'm glad it takes years for them to fix how busted ADCs are but takes them one patch to destroy the jungle.","replies":[]},{"poster":"Packun Flower","date":"2018-05-19T02:12:06.225+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=The Eve of Night,realm=NA,application-id=3ErqAdtq,discussion-id=oKy2L9rL,comment-id=,timestamp=2018-05-18T18:51:40.176+0000)\n>\n> they want to expand jungle diversity and end up doing the exact opposite.\n\nThis. Riot does this with every big rework or change they have planned. They did it with the assassin update, they are doing it with the ADC update and they did it with the jungle update.\n\nAnytime Riot says its going to do one thing you can expect them to pull a complete 180 and do the opposite,  their sense of balance is so twisted at this point they can't even tell what's a buff and what's a nerf anymore.","replies":[]},{"poster":"KlydeFrog","date":"2018-05-19T00:57:26.082+0000","up_votes":2,"down_votes":0,"body":"Riot can nerf buff junfle items and monsters and ivern laughs because he will forever be uneffected by anything","replies":[]},{"poster":"Moon Mom","date":"2018-05-19T05:38:45.995+0000","up_votes":3,"down_votes":1,"body":"Tons of high elo players like sunset are doing just fine with eve though. Have you considered looking into how they path and mimicking, or applying that knowledge to your game?","replies":[]}]}