{"poster":"Maegraeth","date":"2015-11-09T21:32:45.262+0000","title":"[GAMEPLAY] Allied Tahm Kench/Quinn Devour/Tag Team bug","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"[GAMEPLAY] Allied Tahm Kench/Quinn Devour/Tag Team bug\r\n\r\nPlaying as Quinn in an ARAM with allied Tahm. Used Quinn&#039;s R so was in Valor form and upon Tahm Kench using Devour and &#039;releasing&#039; me, I was stuck in Valor form for the rest of the match. The R icon was frozen and re-activating wouldn&#039;t cancel Valor as it should. Effect didn&#039;t go away upon death so was stuck in Valor form for the rest of the match.\r\n\r\n1.) Use Quinn&#039;s Tag Team\r\n2.) Allied Tahm Kench used Devour on Quinn whilst in Valor form.\r\n3.) Tahm kench released Quinn/Valor.\r\n4.) Tag team frozen for the remainder of the match. Cannot release Valor form and glitch does not go away upon death.\r\n\r\nI&#039;ve only experienced this once but better report now rather than forget about it.","replies":[{"poster":"moonstones","date":"2015-11-10T17:55:25.680+0000","up_votes":1,"down_votes":0,"body":"Hiya Maegraeth,\n\nThanks for the report! We're aware of this issue and are working on a fix. ^-^","replies":[]},{"poster":"Kazekirin","date":"2015-11-09T21:43:50.848+0000","up_votes":1,"down_votes":0,"body":"same thing just happened to me. \nquinn in valor form was eaten by allied tahm kench (Tahm was knocked up while spliting Valor out)\nafter that there was no way to change to Quinn form, unfortunately there was no speed buff for her","replies":[]},{"poster":"Maegraeth","date":"2015-11-09T21:41:26.484+0000","up_votes":1,"down_votes":0,"body":"Valor will still be there don't worry lol He'll carry Quinn around which, imo...is WAY cooler..haha. But yea it is frustrating to be a squishy melee birb when you've been plugging away merrily all match. T_T","replies":[]},{"poster":"Xaytsr","date":"2015-11-09T21:38:52.002+0000","up_votes":1,"down_votes":0,"body":"tbh I probably wouldnt mind that... *goes to try recreate bug to enjoy playing as Valor* \nAlso just reminded me that we are gonna be loosing the Valor form T_T","replies":[]}]}