{"poster":"Mokuto Bunshi","date":"2018-12-29T02:55:56.111+0000","title":"You want to change the conquerer situation? Maybe fix top lane too? Lets talk then...","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"To talk about conqurer we need to talk about top lane, specifically, tanks the thing it was made to combat...(I&#039;ll get to that, bear with)\r\n\r\n\r\nConquorer in essence was riots excuse to allow bruisers to be viable vs tank WITHOUT making bruisers (especially black cleaver bruisers) \r\nviable through their kits or their itemization.\r\n\r\nSo here is what it caused (so we can think of a solution): \r\n\r\nA): Bruisers now all take it vs any tank and crush them in lane, making us shift away from a tank meta (kinda good) \r\nAND making most top tanks non-viable (very bad).\r\n\r\nB): People who AREN&#039;T Bruisers (ALA Yasuo) are taking it and doing more damage than they should be which is causing frustrations in lanes other than the ONE LANE it was meant to add counter play to.\r\n\r\nOkay, so thats the issue. A is a problem and so is B.\r\n\r\nIf we go the path of removal, that wont JUST gimp bruisers/divers/fighters etc but ALSO shift us back to a tank meta... that doesn&#039;t mean the one-shots will magically disappear, because don&#039;t forget, last tank meta the tanks were able to do too much damage as well...\r\n\r\nSo What you NEED is two fold after removal: \r\nStep1: \r\nBuff the bruisers individually OR (what I&#039;d prefer) give them their own items \r\n(name a bruiser build made of all bruiser items ... I DARE YOU after {{item:3071}} and {{item:3748}} or maybe {{item:3078}} and{{item:3053}} you either dip into damage champions stuff or tanks&#039; Largely because they dont all synergise together you can pick at most 3 of these and it makes sense on SOME champions... I digress). \r\nKeep in mind, the removal of damage from conq and items tied to health/resistances (all health would mean tanks&#039; % damage is far too effective) and off-tankyness will reduce damage overall with the target keeping bruisers about where they are in power with more tank and less shank. Make the ones that do have damage do a stat check on YOU (titanic hydra) or your OPPONENT (BoRK) to be more effective with health% scalings. But not explode squishies.\r\n\r\nThen wait 1-2 weeks and check on win rates/issues/outlying situations pre step 2. \r\n\r\nStep2:\r\nThis will inevitably leave tanks in the cold making step two very important. Re-buff tanks with a mindset of TANKING through itemization... What do I mean? There is more than 1 reason people don&#039;t play tanks. #1 is they are not good, sure, but once they are good again #2 becomes the bigger problem. THEY ARE BORING  WITH MINOR SKILL EXPRESSION. I play top lane but main Kled even though my power fantasy is playing the tough guy in the front... why him and not a tank? because top tanks are BORING. You can&#039;t assume that because tanks are good again top laners will play them for you if they don&#039;t WANT TO, this IS a video GAME and not completely a sport (no matter how much Riot thinks it is, people get good at what they LIKE). Humans do what they enjoy.\r\nSo we have made the statement that expressive and fun tanks are generally the exception and not the rule...\r\n\r\nLet me show a correlation about tanks that should make a lot of sense. (Going a bit away from the conq topic here so look for it again below at       &quot;(back on topic)&quot;)\r\n\r\nlets name some high win rate top lane tanks...\r\nand rate them on 2 things, fun (subjective) and skill expression (measurable to some degree):\r\nWe will not be including juggernauts because they aren&#039;t all inclusive of what we want. They can build more damage on occasion for max efficiency[not saying they should/shouldn&#039;t to be clear, that&#039;s another story] as opposed to say, Ornn who has no damage scalings really.\r\n\r\n1st place is Sion{{champion:14}} \r\nA Vanguard with a 52.36% TOP win rate as of 12/28/2019\r\n\r\n2nd place is Galio{{champion:3}}  (I think you can already see where i going here...)\r\nA Warden with a 51.10% TOP win rate as of 12/28/2019\r\n\r\n3rd place is Malphite {{champion:54}} \r\nA Vanguard with a 51.09% TOP win rate as of 12/28/2019\r\n\r\n4th place is Maokia {{champion:57}} \r\nA vanguard with a 50.69% TOP win rate  as of 12/28/2019\r\n\r\n5th place is Poppy {{champion:78}} \r\nA Warden with a 49.76% TOP win rate as of 12/28/2019\r\n\r\n(Source: http://na.op.gg/champion/statistics sorted by win rate&gt;top on 12/28/2019)\r\n\r\n\r\nNow lets look at skill expression first You may have seen Tilterella videos, a player who consistently can get to challenger with Sion.\r\nWhats his skill expression look like?\r\nHis passive lets him do damage after he dies, much like Karthus or Kog&#039;maw, the catch is that he can still auto attack and when doing so he gains back some health that is rapidly degenerating.\r\n\r\nExamples of skill expression: \r\n{{champion:14}} Sion starting top and dying lvl 1 t counter jungle which ever camp is top making full use of excecution mecanics.\r\nInting Sion (love it or hate it it takes SOME KIND of expression to do right, kinda like a proxy singed)\r\n\r\nand this is JUST his passive\r\nQ:\r\nUsing bush/vision strats to get an otherwise unrealistic max charge hit without landing his slow\r\nE:\r\nRanged Skill shot dependent on environment\r\nR:\r\nYou can use terrain to make turns that should be impossible, \r\nyou can jump enemy terrain using the dash at the end of the cast \r\n(yes, there is a dash there)\r\n\r\nSo, thats a decent chunk of skill expression... he also happens to be THE MOST played top tank at 6.52% play rate top... and the 10th most played ANYTHING top... funny... coincidence? Maybe?\r\n\r\nOkay now for {{champion:3}} Galio!\r\nPassive:\r\nEmpowered AOE auto attack affected by abilities you hit.\r\n&quot;Colossal Smash&#039;s cooldown is reduced by 4 seconds every time Galio hits a unique enemy champion with an ability.&quot;\r\nmaking you want to land some combination of Smash&gt; pick two of 2 Q or W or E&gt;smash That remaining abilities.\r\n\r\nW: Can initiate an entire team fight\r\n\r\nE: Possible to cast backwards in a little over melee range to acoind windup completely. Cal also be used to dodge skill shots (See faker in worlds Galio dodge)\r\n\r\nOkay, so not including the Q being 2 skills shots and the R being like shen ult for map awarness but also hard to land... thats his kit... and again, very expressive. ESPECIALLY for a warden class! A class meant for tanking, defending and peeling\r\n\r\nOkay lets go to {{champion:54}} Malphite.\r\n\r\nPassive: Gain a sheild passively\r\nQ: do damage and steal speed\r\nW: do small AOE damage based on how tank you are (armor), Note this is NOT an auto cancel. You will be locked into an animation\r\nE: Do an AOE, cripple enemies, now they do less.\r\nR: Can have a unique casting method animation over walls to massively increase flight speed and allow for engages that are unexpected to too fast to react to even when in vision over a wall.\r\n\r\nOkay... thats... way less, but theres still that game changing ult...\r\n\r\nOkay next is {{champion:57}} Maokai!\r\n\r\nPassive: &quot;Each time Maokai casts an ability or is struck by an enemy&#039;s ability, Sap Magic&#039;s cooldown is reduced by 4 seconds&quot;\r\nHey, that sounds like Galio! Good sign! Especially for a vanguard!\r\n\r\nQ: Knock people back and they are slow now\r\nOkay...\r\nW: Be untargetable, hold a guy down so you can kinda knock em towards your team with Q\r\nE: Throw a mine thats like teemo shrooms but they work better in bushes.\r\nSo, it does pretty much everything...\r\nR: Bigger nami ult that starts slower and roots.\r\n\r\n...Thats uh, pretty bad for a vanguard... I mean your whole combo is W+Q and E if they heppen to wander to a bush, both your E and R are fire and forget...\r\n\r\nLets do {{champion:78}} poppy now:\r\n\r\nPassive: Periodic ranged attack that ricochets her sheild off the enemy making her have to go pick it up before the enemy does.\r\nCool, another great passive\r\n\r\nQ: Smash the ground, slow, do the same damage again after 1 second.\r\nThats a thing. I think you fully understand it by the description.\r\n\r\nW: Has a passive that makes you tankier. Makes an AOE that makes you faster, but more importantly makes it so enemies cant dash in range of you like a moving miasma.  \r\nPretty cool for the amount of timing you can have on it.\r\n\r\nE: Vayne E that stuns for longer using your whole body.\r\n\r\nR: Ejects enemies from the fight.\r\nUseful for running away, making a front line get out of your sight or a back line let you finish killing a front liner... The tricky part is landing it.\r\nNot bad for a warden I guess... to be expected of a more recent rework as well... but kind of the exception and not the rule.\r\n\r\nOkay lets talk about fun through said expression\r\n\r\n{{champion:14}} Sion\r\nA Vanguard\r\nYeah, he FEELS like a vanguard, I am the first guy to get in there and get my hands dirty. I run in smash em, kick the puny flies (minions) out the way, charge up my shield (which I then explode!) and SMASH them for the CC massive damage and ability for my team to follow up and engage while also doing great damage and burning a few cooldowns. \r\n6.52% Play rate top... HMMM I wonder why...\r\n\r\n{{champion:3}} Galio \r\nA Warden\r\nSOMEONES IN TROUBLE. Dash in through the sky DECIMATING the battle field and knocking up enemies all the while peeling for my team and defending the person who was approaching the jaws of death (not very well though considering its just resistances and conqueror [our topic] exists for divers...). BANK I&#039;m in the fight faster than a speeding shen and I Deck the target with MY E W or even flash&gt;W And counter engage, and Q for damage all while smashing anything I can get my passive on in melee range. Took me a long time to learn when it was best to engage like this but BOY was it worth it!  \r\n1.16% Play rate top... usually picked into heavy mage comp like mage bot carry or mid + an AP top. Fun yes, but also niche. Occasionally played heavy AP because of his re-balance and NOT as tanky as he once was.\r\n\r\n{{champion:54}} Malphite \r\nA Vanguard\r\nBOOM! Only seconds ago I told my team, WE&#039;RE GOING IN! And now the enemies are in flight in an un-cleanseable dance of doom!! \r\nokay SO I guess I just tank and Q someone till I can WE right...? Should I E the ADC?  Ill just press these on the target and wait...\r\n3.74% Play rate top, viable as long as they have an adc, good against many AD tops, of which there are quite a lot. \r\nDecent pick, played for that BOOM moment, but INTERESTINGLY often played FULL AP with good winrates on AP items \r\n(Source http://na.op.gg/champion/malphite/statistics/top &gt;items)\r\n\r\n\r\n{{champion:57}} Maokia\r\nA vanguard\r\nWhere did I leave that sapling again? OH! Its fight time! Wait for me guys, I&#039;ll let my Slow ~~nami ult~~ roots that I ot reworked into my kit start this fight off right! Okay! Half the enemy are rooted, Ill &quot;insec&quot; the target... hmm it didn&#039;t really move, That&#039;s okay lemme check an E! ...aaand it hit a minion/jungle camp... yeah i&#039;m out of buttons fellas...\r\n1.16% Hes not niche like galio... AND hes a vanguard... right? I wonder why hes so under picked then... *insert thinking HMMMMM meme here*\r\n\r\n{{champion:78}} Poppy\r\nA Warden\r\nOkay FIGHT time, i&#039;m close enough to make a difference/I&#039;m not, BETTER use My W to close that gap!\r\nI Jump into the fray keeping an eye on my squishies to make sure they dont get jumped. AN ASSASSIN/DIVER! Run to the squishy to stop the dash! OR, I used my W I&#039;m gonna jump the assailant before they jump my back line! I pin em to a wall and punish them with Q... its going well, use a tap of my ult to lock down some enemies OR \r\nDamage to our diver has been done. Its getting bad, lets save as many as we can Ult their team and remove their fighting power and we make a break for it.\r\n(OR, more commonly, &quot;poppy please dont use ult unless _**I**_ an about to die&quot;)\r\n4.95% Easy champ with fun mechanics in and out of lane, good agency and for a warden, isn&#039;t a Galio but is more general and quite fun.\r\n\r\n\r\nKeep in mind, every other top lane tank has a less than 3.74% pick rate (starting at 2.02% with SINGED of all people!)\r\n\r\n(back on topic)\r\nWhat I am saying is, you removing or fixing conqueror IS NOT gonna bring all the tanks back... People who follow the meta for elo? Sure, but actual dedicated tank players? Can you name 3 well known tank players that stream?\r\nI can name a bunch of ADC&#039;s (that characters not the whole position/lane) Double lift, Gosu, Tyler 1, imaqtpie... all of them master/challenger players.\r\n\r\nTanks second issue after not being able to build against conq is that they are not very fun many times... so even if conq is removed whos gonna play the tanks? Your friendly neighborhood bruiser player? (I sure aint).\r\n\r\nWhat can be done??\r\n\r\nWell as far as FUN some tanks need kit changes, but for many a few things can be changed with just items.\r\n(This is what a preseason is for IMO)\r\nTry stuff like an item that absorbs damage and gives a % of it to an ally as a BUFF for 4 seconds or use it on your self to give you bonus resistance to that kind of damage ratio for 10 seconds.. call it... adaptive vest or some junk, incentivising body blocking on wardens. (Give this item NO DAMAGE)\r\nSomething Like an item that states: \r\nFor every enemy you hit with abilities below your 50% health mark apply berserkers last breaths.\r\nberserkers last breaths: for enemy you hit with an ability you land refund 1 second to your the ability that landed.\r\n2 seconds if below 20% health. (Give this item NO DAMAGE)\r\n\r\nThis would incentivise vanguards to go HAM and hitting as MANY enemies as possible but would NOT reward defensive plays such as shielding your self (Sion for example would want to use his shield offensively after dropping below 50%).\r\nIf its TOO good then nerf it with saying CC is reduced (enemy has tenacity VS YOU after first hit) to make it appeal less to CC champions looking for a for every chain.\r\n\r\nThings like randuins, locket and righteous glory should be the gist with most tank items.\r\n\r\nBruiser ALREADY had good items like spear of shojin (kinda on the fence with new atmas tbh). Add some more that work like gage but dont scale on base damage for the non juggernauts (incentivising Kled, Irelia, maybe even Yas etc to go off tanky top).\r\n\r\nIf this is done we have a chance at a game that at least in this lane makes more sense.\r\n\r\n\r\nIf we go the path of re balancing The rune how ever then you have 3 things you can fix.\r\nThe AD, The true damage or the activation method...\r\n\r\nThe AD REMOVE IT. Its not needed, but at the same time make sure the true damage is still enough so that bruisers can fight tanks without brusier vs tank items (where a bruiser can last in a 1v1). Tanks will still need the new items. Also, now that its mostly a true damage rune, you cant explode squishies as well because they have mush closer to 0 resistances anyhow.\r\n\r\nThe true damage REDUCE THAT WAY down. Maybe this one isn&#039;t as good even though its an option; it wont fix the yasuo problem, but other than on him (don&#039;t forget he has built in armor shred...)  at least you can build against it confidently now. If you do this tanks will be fine, but bruisers will likely need better items as a compensation for the power down to be able to keep up with tanks.\r\n\r\nKeep as is but make it so the stars have to align to proc it. Increase the duration of the wait/ make it increase over time once its proced/ dont let it get primed off minions, all these options are doable but tbh make this odd rune EVEN WORSE with its use cases being clear...\r\n I suggest staying away from this entirely.\r\n\r\nIn closing, this may SOUND like a LOT of work! And it SHOULD BE! We have been digging this whole for a lot of seasons now. So it gonna take a LOT of stuff in the form of WORK to fill it. You can&#039;t keep doing the same thing and expect it to be A-okay when it hasn&#039;t worked before and isn&#039;t working now.\r\n\r\n\r\nTanks for sticking through the long read with me. \r\nI know that all I really said was make more top lane items, remove conq because reasons; but it takes a bit of explaining as to why.\r\nLike explaining that conq was the BAD part of a bruiser buff that made it through first cause it was easier to ship than the items and now everyone is suffering for it. The reason that {{item:3161}} never shipped was because a certain... AD champion {{champion:202}} champion made it very ... interesting to balance... and atmas made {{champion:14}} and BEAST.. IMO make shojin melee only OR release as is and tweak something else and just plain nerf Sions scalings as hes already very good. We could just use the items...\r\n\r\nJust my 10 cents on a lane that could fix some of the games problems... heck we already gets some of the games problem children up here ALA {{champion:112}} \r\nMokuto out!\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}