{"poster":"Franketox","date":"2017-03-13T19:42:03.784+0000","title":"algun platino diamante que pueda responder mis dudas por favor!!","subforum":"Guias y consejos","up_votes":4,"down_votes":1,"body":"que alguien me responda como peudo hacer pra subir si hago bien las cosas que cual es mi error te puedo jugar bien cualquier linea maineo especificamente top o mid pero juego bien en jungla adc sup etc rpboe con las 5 lineas respondanme es normal tener un kda con fiora de 9 4 10  230 cs por game y ir 7 win 8 loss y asi me pasa con todo pongo wards pusheo solo con wards defiendo cuando hay que defender tipo buenos tps para las tf o defender las demas lienas pero claro cuando me quiero dar cuenta van 15  20 min de partida yo voy 3 1 pero los demas van 0 4 2 7 etc los invito a que vean mi match history y me digan cual es mi error por uqe me caga tanto el emparejamiento y como puedo hacer para subir la cuenta que solucion me pueden dar desde ya muchas gracias a todos por darle bola a mi post","replies":[{"poster":"Americans","date":"2017-03-13T20:00:34.452+0000","up_votes":3,"down_votes":0,"body":"Si haces bien las cosas pero perdes es que no estas haciendo las cosas bien.\n\nPor lo que estas diciendo cometes errores de los cuales no te das cuenta, ya sea porque no queres poner el esfuerzo en verlos o simplemente no podes. La forma mas facil de ver y reconocer estos errores es que veas tus propias replays. Cuando uno se ve como juega va a notar muchos errores que paso de largo, desde como manejar la wave, los trades, el posicionamiento de los wards, las tfs, el focus, build, desiciones, etc.\n\nLa gran parte de errores que un jugador comete no se pueden ver por el kda, el cs o el match history, se ven el juego y por eso tenes que revisar tus games.\n\n\nSos silver 4 con 42% de winrate, definitivamente hay un monton de cosas en las que podrias mejorar, asi que no te desanimes.","replies":[{"poster":"Franketox","date":"2017-03-13T20:26:57.757+0000","up_votes":1,"down_votes":0,"body":"tenes razon osea errores tengo seguro no digo que no tengo errores pero no tengo los mismos erroers que los demas mi linea aseguro ganar siempre al minuto 20 con fiora siempre voy 3 o 4 0 ytengo 140 de farm aprox mientras el rival no llega a los 100 y va 0 2 o 0 3 al menos pero no pierdo por hacer bien o mal las cosas sino que a la hora de las tf soy el unico que tiene damage para deletear por que el mid y el adc siepre van 2 7 1 9 y tiene muchois menos items que el resto osea de que tengo erroes y muchos no tengo la menor duda pero los errores que tengo estoy seguro que son de oro al menos la season pasada era oro ahora soy plata y no peudo subir auqnue juegue mejor que el resto te invito a q me agregues y me spectees una partida y me digas tenes muchisimos erroes para mejorar pero igualmente no mereces ser plata 4 por la forma de jugar que tenes","replies":[{"poster":"Americans","date":"2017-03-13T22:28:03.045+0000","up_votes":1,"down_votes":0,"body":"Entonces seguramente no sepas aprovechar tu ventaja.  Es imposible que tu mid y adc siempre salgan mal. Vi en tu historial 3 games con fiora y en solo uno tu mid/adc salieron mal.\n\nSigo sin saber si realmentes buscas alguien que te diga que hacer para mejorar, o alguien que te reafirme que jugas mejor que los de tu liga. Yo nunca voy a ser el segundo. Podria espectearte pero no maineo ni fiora ni top, asi que mucho no te puedo ayudar, pero lo que ya te dije que te va ayudar si o si es ver tus propias replays.\n\nDe todas formas te puedo espectear un game y ver que onda, pero no soy analista ni main top.","replies":[]}]},{"poster":"Franketox","date":"2017-03-13T20:23:53.205+0000","up_votes":1,"down_votes":0,"body":"tenes razon osea errores tengo seguro no digo que no tengo errores pero no tengo los mismos erroers que los demas mi linea aseguro ganar siempre al minuto 20 con fiora siempre voy 3 o 4 0 ytengo 140 de farm aprox mientras el rival no llega a los 100 y va 0 2 o 0 3 al menos pero no pierdo por hacer bien o mal las cosas sino que a la hora de las tf soy el unico que tiene damage para deletear por que el mid y el adc siepre van 2 7 1 9 y tiene muchois menos items que el resto","replies":[]}]},{"poster":"lordeman10","date":"2017-03-14T01:44:34.320+0000","up_votes":1,"down_votes":0,"body":"siempre hay algo más de donde tirar, busca videos en yt que te habran la cabeza","replies":[]},{"poster":"Font","date":"2017-03-14T01:16:28.542+0000","up_votes":1,"down_votes":0,"body":"Limitate a jugar 2 campeones en top (que supongo que es tu linea principal) y 1 en el restro de lineas, parece que uno de  tus problemas es que jugas demasiada variedad de campeones para tu nivel, lo cual no conviene ya que te deberias preocupar mas por la toma de decisiones que por tus mecanicas.\n\nIntenta ver streams de pros y preguntate que harias vos, fijate que hacen ellos y pensa en porq hacen lo que hicieron.","replies":[]},{"poster":"Zantuscat","date":"2017-03-14T00:20:11.958+0000","up_votes":1,"down_votes":0,"body":"Hola, uno de los problemas que puedes tener es que estas manejando mal el macrojuego (objetivos, rotaciones, tps y distintas cosas xd), pero estas teniendo un buen microjuego con fiora (trades y mecanicas del champ), por lo que te recomiendo es jugar con fiora a muerte, porque como ya lo manejas de buena forma, solo empezaras a mejorar tu macrojuego","replies":[]},{"poster":"Skeleton45","date":"2017-03-13T22:46:06.044+0000","up_votes":1,"down_votes":0,"body":"Si te va mal con Fiora juga otros campeones lo mas probable es que no sepas aproveches tu ventaja y seas malo en las tf.","replies":[{"poster":"Skeleton45","date":"2017-03-13T22:48:48.804+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skeleton45,realm=LAS,application-id=8sKIclmi,discussion-id=Qf56QZGd,comment-id=0004,timestamp=2017-03-13T22:46:06.044+0000)\n>\n> Si te va mal con Fiora juga otros campeones lo mas probable es que no sepas aproveches tu ventaja y seas malo en las tf.\nAdemas Fiora no es Pantheon que si no ganas antes del min 35 es gg ,te la dan vuelta.\nFiora tiene un kit Re fuerte algo estas haciendo mal ,trata de que cuando mueras o cometas un error ,analizar que es lo que podrias haber hecho mejor.","replies":[]}]},{"poster":"Skeleton45","date":"2017-03-13T22:40:18.271+0000","up_votes":1,"down_votes":0,"body":"Lee mi post que dice: \"No podes subir de liga? \",Pickea algunos de los campeones que ahi recomiendo y aprende a usarlos,son freelo.\nSi tenes 46% winrate como dijo Americans es porque sos malo .","replies":[]},{"poster":"Chisolin","date":"2017-03-13T19:53:55.475+0000","up_votes":1,"down_votes":0,"body":"Yo veo tu historial bastante normal, victorias y derrotas como todos, quizá eso signifique que estas en donde tu nivel te permite estar","replies":[{"poster":"Franketox","date":"2017-03-13T20:21:49.564+0000","up_votes":1,"down_votes":0,"body":"nose si tan asi fijate las partidas perdidas que hago todo para carrearlas y pierdo pero no pierdo por ser yo el que jugo mal t salgo con jinx 25 6 y pierdo por que estoy jugando solo lo mismo me pasa con fiora y fizz pierdo partidas ue termino 15 5 14 6 todso kda asi y pierdo igual por que los demas salen  0 7 2 10 y las que gano la mayoria tmb las gano por que practicamente las carrie yo por los kda deberia tener un 60% win ate no un 42","replies":[]}]},{"poster":"ZyXEL 001","date":"2017-03-13T19:48:09.603+0000","up_votes":1,"down_votes":2,"body":"http://www.risasinmas.com/wp-content/uploads/2014/01/los-signos-de-puntuacion.jpg\n\n","replies":[{"poster":"Yitán","date":"2017-03-13T20:22:01.732+0000","up_votes":1,"down_votes":0,"body":"que feo meme","replies":[]}]}]}