{"poster":"ddongmoriya","date":"2018-11-13T12:30:56.691+0000","title":"Inting Nunu support that hasn't been banned. Why is this still happening?","subforum":"Player Behaviour","embed":{"description":null,"url":"https://imgur.com/h93FgIr","image":"http://imgur.com/h93FgIrs.jpg"},"up_votes":2,"down_votes":0,"body":"Saw this nunu in a game tonight. Picked nunu support with smite and didn&#039;t say anything except &quot;incoming&quot; in /all chat as he w&#039;d into lane to die to the enemy. Spent half the game following xin zhao around stealing camps and buffs then proceeding to give the enemy laners the buffs. He inted every lane and has been doing this for 9 games over today and yesterday. I get ranked season is essentially over but shouldn&#039;t our reports of someone so blatantly trolling get some attention? {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Socon","date":"2018-11-13T12:37:51.274+0000","up_votes":4,"down_votes":1,"body":"Because riot only cares about chat.","replies":[]},{"poster":"Jag1811","date":"2018-11-14T03:30:41.814+0000","up_votes":2,"down_votes":0,"body":"Riot focus on banning people for toxicity in chat, because its easy.\n\nThey really dont care about the quality of the game.\n\nEasy bans in chat means people create more accounts, then grab a riot card to buy skins yet again for their fav characters = profit. Good business model tbh","replies":[{"poster":"Ninox","date":"2018-11-14T07:47:26.830+0000","up_votes":2,"down_votes":2,"body":"If you are dissatisfied with an experience are you more or less likely to spend money to support that experience?\n\nBans don't encourage people to spend money. If you're spending money after a perma ban it's either because you've reformed and won't be hit again or you have enough money that you don't care if you lose it, which doesn't apply to the majority.\n\nBans do not equal profit.","replies":[{"poster":"RP1TUP","date":"2018-11-18T00:30:05.214+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=T8eq2lFQ,discussion-id=o6nmEEyt,comment-id=00010000,timestamp=2018-11-14T07:47:26.830+0000)\n>\n> If you are dissatisfied with an experience are you more or less likely to spend money to support that experience?\n> \n> Bans don&#x27;t encourage people to spend money. If you&#x27;re spending money after a perma ban it&#x27;s either because you&#x27;ve reformed and won&#x27;t be hit again or you have enough money that you don&#x27;t care if you lose it, which doesn&#x27;t apply to the majority.\n> \n> Bans do not equal profit.\n\nBeen telling myself that shit for years. Riot only gives a fuck about Money. They couldn't give two shits about what people say on servers. As long as the money is rolling in, they're happy. Hence the reason I encourage all my friends who do play, not to spend a single dollar on this game.","replies":[]}]}]},{"poster":"jadelink","date":"2018-11-14T11:09:23.661+0000","up_votes":2,"down_votes":0,"body":"Chat is easy to search and ban through automation, most of the way.  This stuff is a lot harder to pick up, you have to watch the games to tell the trolls from every idiot trying out akali in ranked.","replies":[]}]}