{"poster":"RomantischesBein","date":"2016-07-14T23:55:47.295+0000","title":"HILFE !! TASTENKÜRZEL RPOFI GESUCHT!!","subforum":"Hilfe & Support","embed":{"description":"Kostenlos Bilder hochladen. Bilder Upload ohne Anmeldung","url":"http://www.bilder-upload.eu/show.php?file=1caf3d-1468540598.png","image":null},"up_votes":0,"down_votes":1,"body":"Hallo erstmal,\nund jetzt gleich zur Sache, ich hab ein RIESEN Problem. Undzwar ist seit dem vorletztem Spiel ein Problem aufgetreten, welches mir das spielen erschwert !! Ihr kennt doch diese Leiste &uuml;ber jedem Fenster wo man das entsprechende Fenster mit einem der Buttons rechts entweder schlie&szlig;en, minimieren, oder auf die Bildfl&auml;sche anpassen kann oder? ja exakt dieses Fenster ist nun bei mir im Spiel aufgetaucht und sie brachte in diesem Fall ein riesen Handycap mitsich: Ich kann das sichtfeld mit der Maus nicht weiter als bis zum unteren Rand meines sichtfeldes ziehen und somit das Sichtfeld nicht verlagern. Nach oben, links und rechts geht es aber. Um auch nach unten gehen zu k&ouml;nnen muss ich einmal &#039;Z&#039; dr&uuml;cken um das Sichtfeld auf mein Spieler zu begrenzen aber so l&auml;sst sich schlecht spielen weil man kaum was sieht.. Ich sch&auml;tze mal es handelt sich um irgendeine Tastenkombination mit der ich dieses Missgeschick unwillentlich verursacht habe und mit der ich es wieder weg bekomme. Ich hoffe einer von euch kann helfen ich w&auml;re euch unendlich dankbar !!\n\nPS: Im Link ist ein Bild auf dem man den oberen Balken ein wenig sehen kann. Schon ausprobiert hab ich: LoL Neustart; einmal verzweifelt queerbeet alle Tasten gedrückt.\n\nLiebe Gr&uuml;&szlig;e","replies":[{"poster":"Call me Br00t","date":"2016-07-15T09:56:06.829+0000","up_votes":1,"down_votes":0,"body":"Alt + Enter sollte es auch tun","replies":[]},{"poster":"Enderized","date":"2016-07-15T01:20:08.057+0000","up_votes":1,"down_votes":0,"body":"Guten Abend RomantischesBein\n\nDu hast wohl irgendwie den Fenstermodus von LoL aktiviert.\nDiesen änderst du einfach in deinen Anzeigeeinstellungen (Oder Grafik... wie auch immer es hieß) in dem du den Anzeigemodus von ''Fenster'' auf ''Vollbild'' umstellst.\n\nMit freundlichen Grüßen\nEnderised (ehem. Sabaton marches)","replies":[{"poster":"Xipiz700","date":"2016-07-15T07:42:54.316+0000","up_votes":1,"down_votes":0,"body":"Generrel kann man auch durch das Drücken des Mausrades scrollen.","replies":[{"poster":"Enderized","date":"2016-07-15T09:45:40.073+0000","up_votes":1,"down_votes":0,"body":"Ich glaube das war nicht die Intention des TE :)","replies":[]}]}]}]}