{"poster":"Setouchiha","date":"2018-02-07T19:06:26.410+0000","title":"otra ves banned pero esta vez T_T","subforum":"Charlas Generales","up_votes":0,"down_votes":23,"body":"Hola rioters esta vez si q se pasaron supuestamente soy un troll xq me toco adc y mi supp mi pikea graves supp me roba farmeo y kill y yo troleo como no enojarme si me trolean linea y em banean chata mi xq se qm e enoje y el supp andie le hizo nada  ya cansa\r\ngracias esperoq la proxima no sean tan injustos y vena el problema","replies":[{"poster":"Ghost Project","date":"2018-02-07T19:36:43.300+0000","up_votes":6,"down_votes":0,"body":"Mira el lado bueno, tendrás mas tiempo para estudiar gramática","replies":[]},{"poster":"Pollo al Ornno","date":"2018-02-07T19:18:49.178+0000","up_votes":4,"down_votes":0,"body":"U\nN\nO\n\nM\nE\nN\nO\nS\n\n:D","replies":[]},{"poster":"Katastrofica","date":"2018-02-07T19:35:58.278+0000","up_votes":3,"down_votes":0,"body":"No se preocupen, yo tengo un doctorado y 8 títulos universitarios en... ¿traductorado? (Supongo que así se dice)\n\n\n> [{quoted}](name=Setouchiha,realm=LAS,application-id=v7qsfXsE,discussion-id=h0mEEVn9,comment-id=,timestamp=2018-02-07T19:06:26.410+0000)\n>\n> Hola rioters, esta vez si que se pasaron.\nMe tocó un Graves soporte que me robaba farm y kills; así que decidí trollear, porque el me trolleo primero. (O algo así, no entendí muy bien la verdad)\nPara peor me banean el chat a mi porque me enoje pero al supp no lo banean (Después dice algo que no comprendí del todo)\nGracias espero que la próxima no sean tan injustos bla bla bla\n\nResumen: El tipo flammeo toda la partida a su soporte y se enoja porque lo banean a el.\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"BuenardoOHiggïns","date":"2018-02-07T19:18:52.911+0000","up_votes":3,"down_votes":0,"body":"Váyase por la sombra {{champion:238}}  JAJA la sombra...  no?","replies":[]},{"poster":"LaChopi","date":"2018-02-07T21:04:41.514+0000","up_votes":1,"down_votes":0,"body":"No se cuál es tu punto. Flammeaste y ya está. El baneo está justificado. \nY aprende a escribir hdp xd Ni el título se entiende ","replies":[]},{"poster":"Juice Wrld","date":"2018-02-07T19:47:48.263+0000","up_votes":1,"down_votes":0,"body":"Fue normal game, era para tanto? :/","replies":[]},{"poster":"Sergan","date":"2018-02-07T19:37:50.515+0000","up_votes":1,"down_votes":0,"body":"1ª En serio costo leer lo que quiziste decir, por tu bien mejora un poco tu redaccion.\n2ª Y claro, si te trolean la linea no hayas mejor que trolear, si la situacion ya es mala con un trol contigo fueron dos, asi que considerando eso, probablemente te cayeron tres reportes validos de los demas del equipo.\n3ª Considerando el punto anterior, de \"injusto\" no tiene nada, lo injusto es que puedas seguir creando cuentas para continuar arruinando partidas.\n4ª Das a entender que no es primera vez que te banean y segun veo planeas seguir creandote cuentas, quizas no seria bueno comenzar a cambiar la actitud mas considerando que cada vez habra menos tolerancia a las cuentas creadas por permabaneados?","replies":[]},{"poster":"Setouchiha","date":"2018-06-14T23:09:19.112+0000","up_votes":1,"down_votes":1,"body":"Primero q nunca me banearon la cuenta si te crees tan pro e  gramatica q haces jugando al lol podrias estar dando clases otra q si escribi con faltas es q la calentura de tener  aguantar estupideces te hace escribir mal ta gracias x el comentario y siempre recibo honor en partida xq juego bien pero me tiltea el tema de tener q aguantar troll x eso tengo cuenta bann x 14 dias mientras q el q trolea partidas no le hacen nada pero da igual la proximas partidas juego muted all oponent y ta resuelto..gg","replies":[]}]}