{"poster":"Gίn","date":"2015-11-23T17:56:10.941+0000","title":"Tippek, avagy segítség profiktól?","up_votes":2,"down_votes":0,"body":"&Eacute;n silver 5 vagyok jelenleg, bronze 5-ből mentem fel silver 3-ba &eacute;s egyszerűen le&aacute;lltam, elkezdtem visszaesni.. bronzeban hihetetlen&uuml;l sokat ing&aacute;ztam, &eacute;s tudom hogy az&eacute;rt vagyok itt mert nem vagyok el&eacute;g j&oacute; &eacute;s jobbnak kellene lennem, de ez t&eacute;nyleg nem k&ouml;nnyű. Egyszer kaptam egy diamondos velkoz-t midre &eacute;s csak &aacute;multam hogy mit csin&aacute;l, a kedvenc laneim a top/mid/adc adc-zni az&eacute;rt nem szeretek mert ha a support rossz nekem v&eacute;gem, miden sokszor kapok olyat aki jobb mint &eacute;n, vagy counterpick akkor pr&oacute;b&aacute;lok safe-ba j&aacute;tszani de nem megy, van valaki akit nagyon le szeretn&eacute;k hagyni, hogy jobb legyek n&aacute;la de egyszerűen nem megy. Minden szabadidőm amit csak tudok ( N&eacute;ha elmegyek haverokkal vagy ahova h&iacute;vnak ) De azon k&iacute;v&uuml;l t&eacute;nyleg minden szabadidőmet a lol-nak &eacute;s a tanul&aacute;snak szentelem. K&ouml;sz&ouml;n&ouml;m hogy megn&eacute;zted, ha van 1-2 tipped annak nagyon &ouml;r&uuml;ln&eacute;k, k&ouml;sz&ouml;n&ouml;m :)","replies":[{"poster":"Temp65432","date":"2015-11-23T23:30:06.254+0000","title":null,"up_votes":6,"down_votes":0,"body":"Háááát pár örökérvényű, nagyon sablonosnak tűnő, de amúgy igaz tippek:\n1) Ilyen hogy lolcounter meg lolskill meg anyámkínja felejtős. A counterekkel ráérsz akkor foglalkozni, amikor ott ülsz lcsen, addig semmit nem érnek. Vannak olyan pickek amik egy adott karakter életét meg tudják nehezíteni, ne foglalkozz vele. Ha tudsz alkalmazkodni az enemy játékstílusához, akkor nyersz, ha counter,ha nem\n2) Soloq a throwok kicsiny hazája, használd ki az enemy hibáját, játsz agresszíven. Ha előnyöd van , mélyítsd el. Minnél jobban elhúzol az enemytől annál jobban elkedvtelenedik, annál több hibát vét,ami neked csak jó. Pl: tiéd a firstblood, visszajön, 2szintel nagyobb vagy nála, mássz a képébe, allinezz, hogy megint vissza kelljen menni. Használj snowball karaktereket, amiknek elég egy kis lendület és elhúz\n3) ennek az ellentéte is igaz, ha hátrányba kerülsz, ne próbálj meg tradelni, minden egyes bázison/torony alatt töltött másodpercel kevesebb az esélye annak hogy nyersz\n4) Wardolj. A trinket nem dísz, 15000x lett olcsóbb a vision a játék alatt. Már ott tart a dolog hogy teljesen ingyenes, használd. Pinket is vegyél amikor csak van felesleges 75goldod,megéri, nem tűnik el, ha pusholsz nem tudja leverni az enemy, és megment...SOKSZOR MEGMENT.\n5) Ne azzal törődj hogy a társad mit csinál, arra koncentrálj hogy te legyél jó. Feedel a topos, rakd oda magad jobban.\n6) Nézz ki egy karaktert ami tetszik, tanuld meg. Ha egy karakterrel elmélyíted a tudásod, a többit is jobban fogod használni, mert megtanulsz koncentrálni az apró dolgokra pl hogy milyen sorrendben nyomod el a skilleket, mennyi a cast time, mikor tudod megszakítani és mikor nem. Ha egyel profi vagy, akkor a többit is jobban fogod tudni használni, hiába nem gyakorlod.\n\nPár lane specifikus tipp:\n7) mid: Ha veszíted a lanet, ne feedeld tovább az enemyt, 1-2 skillel told a pofájába a lanet és roamozz. Lehet hogy neked nem lesz annyi farmod, de inkább a társaidnak segíts mint hogy szarráfeedeld az enemyt. Ha úgy érzed már a picknél hogy olyan karaktert voltál kénytelen választani ami nem áll kézre, esélyes hogy nem fogod nyerni a lane, hozz bátran tp-t. Az ignite nem kőbe vésett szabály\n8) Jungle: Nézz ki egy lanet, amiben látod a lehetőséget, (Carry képes karakterek, jó mentalitású játékosok stb stb) és babysittel, Pécézz ki magadnak egy enemyt, szopasd szét a fejét, hogy a társai őt flameljék. 4x legankeled midet, az enemy 0:5ös, tuti hogy elkezdik szapulni, és akkor oda a teamwork, oda a map awarness, minden oda. Neked pedig nyert ügyed van. Ezenfelül WARDOLJ!!!!! te vagy a másodlagos support a játékban, te jutsz el a legtöbb helyre, ahol deep wardokat tudsz elhelyezni. Beraksz egy wardot az enemy jungleba és látod hogy merre megy, nem érhet titeket meglepetés. Objective mindenek felett, baron,drake,rift herald győzelemhez vezet.\n9) Support: WARDOOOOLLJJJj!!!!!!.Ezenfelül, ha megnyered a lanedet, beszeditek boton a tornyot, nem kell az adc %%%%ében lenni a nap 24órájában, hidd el tud lasthitelni anélkül hogy fognád a kezét. Menj el topra-midre roamolni, esetleg counterjunglezz a junglereddel. Fő az hogy az adc-d megkapja a max expt és hogy felbaszd az enemyt. Aki ideges nem tud játszani, aki nem tud játszani, az veszít\n10) Adc: Farm mindenek előtt. Az emberek nem tudnak lasthitelni. Ezt használd az előnyödnek, kb 20 creep=1kill, ha elhúzol farmban, nyersz. Thats it. Próbálj meg pozícionálni, ha elkapódsz nincs az a support ami megvédjen téged, magadat kell megvédened. \n11) Top: Ha nyersz pusholj, Ha nem nyersz, akkor méginkább. A splitpush az a dolog amivel silverben az emberek nem tudnak mit kezdeni. pickelsz egy pushert, az inhibitornál jársz mire a team észbekap. ÉS mindezt okosan tedd..splitpush nem szinonimája a feedelésnek.\n\nSok sikert summoner, remélem tudtam segíteni. Ha kérdésed van segítek{{sticker:slayer-jinx-wink}} \n\n\n\nEDIT: és mivel már ennyire belejöttem az írásba pár ilyen trükk ami növeli a finommotoros készségeidet: \n-orbwalking\n-attack move\n-walljumping (főleg a kis ranges ugrásokkal mint fiora,riven,nidalee)\n-advanced warding (tribush,riverbush) avagy pattanó wardok\n-quickcast/normalcast\n\nEDIT #2: MINDEN TIPPEK ŐSANYJA!!!! MOBAFIRET FELEJTSD EL, NEM HASZNÁLJUK! SOHA!!! Tanuld meg a buildedet az enemy teamcomphoz alakítani, ha full ad nem veszel magic resistet, még ha az atya úristen mondja sem. Hiába mondja neked xy hogy vedd meg ezt meg azt,használd az agyad. Arra van. Ha tank van botrkt veszel, ha sok az ad , armort etcetc. Nincs olyan hogy fix build!\n","replies":[{"poster":"Invisible Dye","date":"2015-11-24T05:00:17.072+0000","title":null,"up_votes":2,"down_votes":0,"body":"Grat, jó leírás, örömmel olvastam végig, köszi :)\n\nEgy annyit fűznék hozzá az egészhez, hogy lane-en figyelj oda, hogy az ellenség mikor használ el egy képességet és lehetőség szerint akkor támadd amikor az cd-n van, (a hősök többségénél) ez nagyban megnöveli az esélyt egy sikeres trade-hez, gankhez, és persze ugyanígy fordítva, ha képességet használsz farmoláshoz számíts a támadásra.\nAmikor hibát vétesz és nem tudtál jelezni, hogy az ellenség megy ide vagy oda, tehát, ha már megtörtént a baj, ne kezdj el feleslegesen rohangálni, ha van rá esélyed pusztítsd a tornyot, persze csak ésszel ;)","replies":[{"poster":"Gίn","date":"2015-11-24T06:22:05.178+0000","title":null,"up_votes":1,"down_votes":0,"body":"Általába meg is szoktam nyerni a lanem, attól függ ki ellen vagyok kivel, ha csak hülyéskedek normálon, vagy rankedon nem normális csapatom van akkor már nem próbálkozok annyira de rankedon általába adc-vel lehozom botot ha van supportom aki csinál valamit, miden meg ha nem yasuozok hanem pl: akali akkor se szokott rosszul menni. Yasuo-val azért nem megy mert rettenetesen célzok ezt gyakorlom jelenleg mert eddig mindig olyan karikkal játszottam akivel nem kellet célozni túlságosan. és még az a problémám hogy teamfightokba egyszerűen sokszor nem bírok odafigyelni mert nagy lesz az adrenalin és nem gondolkodok.. tipp?:D","replies":[{"poster":"Temp65432","date":"2015-11-24T07:12:22.587+0000","title":null,"up_votes":1,"down_votes":0,"body":"1) nem jó a hozzáállás. Nem akkor nyersz hogyha olyan supportod van aki csinál valamit? előszöris nem létezik olyan support ami nem csinál semmit (kivéve ha afk).  Akkor nyersz ha jól tudsz összedolgozni a supportal.\n2) Célzásról annyit, hogy próbáld meg megfigyelni minden karakter skilljének a traveltimeját, meg azt hogy pontosan meddig megy el (én anno képernyőn lemértem nagyjából :'D ) . A szélessége a skillshotnak nem igazán lényeges, úgyis mindig a közepével találod el. ÉS ha nem lősz mellé minden második skillt, az nagyban elősegíti az ideális mana managmentet...ergó nem fogysz ki a kraftból\n3) azzal hogy rohangálsz össze vissza nem nagyon lehet mit kezdeni. Figyelj a focusra , meg hogy ne te legyél az első aki bemegy....adrenalin? hát, én még nem izgultam egy lol menet alatt sem, szal arról nem tudok nyilatkozni","replies":[]}]}]},{"poster":"Toyás","date":"2015-11-25T21:41:02.059+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nemolvastam végig minden hozzászólást, így ha már említették ezer bocsi. Szóval. Kommunikáció! Csapatjáték lenne ez a LoL, játsz hát csapatban. Elhasználta valamelyik summoner spelljét vagy esetleg egy nagy cd-s meghatározó spelljét enemy? Tudasd a jungeleseddel, teameddel, igy tudják, hogy éppen kik sebezhetőek a térképen. Pl. Darius elhasználta a flashét egy tradeben vagy bármilyen más akcióban? \"Darius F down\" a chatre, és ha a jungelesnek van esze kihasználja az immobilitását. Ez fordítva is igaz lehet, amennyiben az adott meccsen te töltöd be a jungeles szerepét. Ha kell kérd a csapattársaid, hogy informáljanak téged az ellenfelek nagyobb cdjeiről.","replies":[]},{"poster":"Gίn","date":"2015-11-24T06:19:38.238+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi ez jól jött nagyon,nekem a helyezkedéssel van sokszor gondom, mert ha nincsen megfeedelve az ellenség és nem 1 hitel engem akkor általában jól teljesítek teamfight-ban viszont bátyám is platinum IV-es és ő is mondja hogy összevissza megyek rossz helyekre ahova nem is kéne, főleg mikor jungleznem kell. Erre van valami tipped? És tényleg köszi, ez rettenetesen sokat segített :D","replies":[{"poster":"Temp65432","date":"2015-11-24T07:08:05.569+0000","title":null,"up_votes":1,"down_votes":0,"body":"Próbálj meg egy jungle őőőő patternt, rotációt (?) építeni magadnak, és tudatosan úgy csináld a dolgod...ez későbbiekben nem fog működni, de az elején sokat segít hogy figyelj a kommunikációra meg arra hogy melyik lane van pusholva, hol van gankelési lehetőség. Pár példa:\n-amumu: frog-blue-red-gank top-scutter-gank mid (hey guys i take buff, and gank top on 3, let him push)\n-leesin: blue-enemy red (firstblood)-wraiths-scutter-bot gank (i go counterjungle, and then gank bot. watch for tribush wards)\nezek álltalában a legtöbb karakternél más más, mert mindenkinek más a clear speedje, meg nem mindegyik karakter tud ugyan annyi campet beszedni mielőtt vissza kell mennie . Arra figyelj, hogy most az item changek miatt ezek most változnak, szóval először ki kell tapasztalni. Custom game erre tökéletes btw.\n\nEDIT: az elejéről meg annyi, hogy akkor is tenned kell a dolgod ha egyhitelnek. Arra való a pozícionálás meg a defenzív itemek...Alakítsd a buildet az enemyhez, azért van 150000millió item ,hogy legyen miből válogatni","replies":[{"poster":"Gίn","date":"2015-11-24T13:26:05.871+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi jól jöttek a tippek :D","replies":[]}]}]}]},{"poster":"Temp65432","date":"2015-11-24T23:39:15.774+0000","title":null,"up_votes":3,"down_votes":0,"body":"Tehát csak a tisztánlátás végett, hogy mik is azok amiket korábban említettem ( orbwalking, attack move)\n\n1) Orbwalking: Az alap koncepciója az a dolognak, hogy van minden karakternek egy auto attack animációja (egyszerűség miatt ashe : Felemeli az íjat,felhúzza,**KILÖVI**,leengedi az íjat. Mint látszik , van az a mozdulat amikor már a lövedék elhagyta a karaktert, és már csak a sallang marad. Ezt a felesleges mozdulatsort meg lehet szakítani anélkül, hogy az bármiben befolyásolná magát az attackot. Ez a gyakorlatban úgy néz ki, hogy abban a pillanatban amikor a lövedék megjelenik , te kattintasz valahova, és ezzel belemozdulsz. Arra kell figyelni, hogy minden karakternek más az animációja, azaz mindengyiknél máskor kell kattinani. Ha túl korán kattintasz akkor megszakítod a támadást, és nem fogsz lőni, ha túl későn , akkor pedig értelmét veszíti a dolog. Ezt közelharcos karaterekkel is meg lehet csinálni, de ott egy fokkal nehezebb, mert nem látszik maga a lövedék, így nincs visszajelzésed , hogy mikor mozdulhatsz.\n\n2) Attack move: Aki valaha játszott startégia játékokkal, azoknak ismerős lehet a dolog. Legjobban ezt a taktikát a patrolozáshoz, azaz őrjáratozáshoz tudnám hasonlítani. A trükk lényege, hogy kijelölöd a karakternek, hogy hova menjen, viszont, ha az oda tartó úton az attack rangeén belül bármilyen ellenséges egység tartózkodik, akkor megáll és automatikusan elkezdi lőni. Ez arra jó, hogy nem kell mindig az ellenségre kattintanod, hanem egyszerre tudsz mozogni és támadni. Ezt a lolba be lett építve, A betű lenyomásával érhető el az opció. Ha elsajátítod az orbwalkolással, és megtanulod egyszerre használni, akkor tökéletesen fogsz tudni úgy támadni, hogy közbe mozogsz, esetleg menekülsz.","replies":[]},{"poster":"Norb Cena","date":"2015-11-23T18:07:09.614+0000","title":null,"up_votes":2,"down_votes":0,"body":"Itt egy tipp:\n> Minden szabadidőm amit csak tudok ( Néha elmegyek haverokkal vagy ahova hívnak ) De azon kívül tényleg minden szabadidőmet a lol-nak és a tanulásnak szentelem.\n\nEz %%%%% nagy hiba - mármint a LoL része (még mielőtt valaki lecsapta volna).","replies":[{"poster":"Temp65432","date":"2015-11-24T10:24:29.771+0000","title":null,"up_votes":1,"down_votes":0,"body":"a tanulás része is {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"skippersd","date":"2015-11-24T14:40:23.774+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szervusz!\n\nMég nem említett ötlet, s az én egyik kedvenc trükköm, az hogy egy lanen 2 db hős legyen, akiket nagyon ismersz, és azt is tudod, hogy a kettő hogyan játszik egymás ellen. Konkrét példával, miden nekem van két kedvenc hősöm, Diana s Ahri. A kettő elég eltérő, így valamelyik mindenképp alkalmas lesz bármilyen csapatba (ahri amúgy is baráti ebből a szempontból, hiszen minden csapatba úgy-ahogy beleillik), és bármilyen ellenfél ellen (ie: Zed ellen Dianát hozok, nem ahrit). S mivel nagyon jól ismerem mindkettőt, bátran hozok Ahri ellen Dianát, s fordítva, hiszen ha a hőst nem is, a matchupot jobban ismerem mint az ellenfél.","replies":[{"poster":"Gίn","date":"2015-11-25T05:00:59.894+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi :D","replies":[]}]},{"poster":"Vasipari Béla","date":"2015-11-23T18:16:34.497+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igazából általános, de hatékony tippeket nehéz adni, de azért megpróbálok. \nElőször is, a hozzáállás, amit mindenki meg szokott említeni: a célod a fejlődés legyen:\n-Figyeld a saját játékodat (hasznos, ha készítesz replayt), és próbáld meg felfedezni a hibákat, mit csinálhattál volna jobban  \n-Ha a játékban van egy hozzád képest jobb játékos, akkor figyeld a játékát, és próblj ellesni trükköket\n-Próbálj egyszerre egy hősre és egy szerepkörre koncentrálni, így metódikusan lehet szépen lassan tanulni. Példák:\n    -Nasus megtaníthatja a torony alatti farmolást, a minonhullámok kezelését, a splitpusht, a teleport használatát\n    -Fizz megtaníthatja a tradelést, a roamolást, a nehéz lanek kezelését és a powerspike-ok kihasználását\n+Ha értesz kicsit angolul, akkor ezt is ajánlom: https://www.reddit.com/r/summonerschool","replies":[{"poster":"Gίn","date":"2015-11-23T20:26:04.034+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi a tanácsot, hasznos volt :D","replies":[]}]},{"poster":"Gίn","date":"2015-11-23T18:16:25.679+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen, tényleg elég hülyén fogalmaztam, elmegyek haverokkal ha hívnak, sportra nem járok és más játékkal se játszok. Szóval mikor számítógépezek akkor csak lolozok, néha írogatok haverokkal ha írnak. De tényleg bocsánat a hibákért.","replies":[]},{"poster":"Gίn","date":"2015-11-23T17:57:58.116+0000","title":null,"up_votes":1,"down_votes":0,"body":"Bocsánat a sok helyesírási hibáért, nem figyeltem rá túlságosan :D","replies":[]}]}