{"poster":"BestPlay","date":"2016-02-26T01:48:52.591+0000","title":"Es posible que las skins viejas legendarias sean actualizadas?","subforum":"Problemas Técnicos","up_votes":12,"down_votes":1,"body":"Es que me salio twisted fate magnifico xD","replies":[{"poster":"Lauthkz","date":"2016-02-26T02:07:53.470+0000","up_votes":4,"down_votes":0,"body":"Ojalá, cosas como Firefighter Tristana o Annie in Wonderland merecen un poquito de cariño; hasta a mi parecer Pulsefire Ezreal necesita unos retoques :b","replies":[{"poster":"Kyousuke","date":"2016-02-26T02:09:12.373+0000","up_votes":1,"down_votes":0,"body":"y los de jarvan y xin que son semi-legendarias y no cambian nada XD","replies":[]}]},{"poster":"Numerítos","date":"2016-02-26T04:22:16.910+0000","up_votes":3,"down_votes":0,"body":"galio cancerbero es legendaria y no tiene ni animacion de back ni animacion de ctrl+1 ademas que tiene un bug que al usar ataques basicos su voz cambia a la de aspecto principal...","replies":[{"poster":"Rockylinch","date":"2016-02-26T15:48:08.512+0000","up_votes":2,"down_votes":0,"body":"Si tomas en cuenta del año en que salió, cuando las animaciones deback no existían, es bastante buena.","replies":[]}]},{"poster":"Smeiker","date":"2016-02-26T03:40:40.556+0000","up_votes":2,"down_votes":0,"body":"Exacto, la pulsefire de ezreal para ser una skin definitiva le falta mucho comparada con las actuales como udyr o sona.","replies":[{"poster":"BOT Yásuo","date":"2016-02-26T13:03:21.828+0000","up_votes":1,"down_votes":0,"body":"Ezreal lo comparas con el skin que va a salir nuevo de Annie Hextech y te dan ganas de llorar, un skin que no mejoró en lo más mínimo y tiene un precio ridículo.\n\nNo se, creo que si cambian visualmente al campeón a la larga van a mejorar al skin también, pero es algo que va a llevar muucho tiempo.","replies":[]}]},{"poster":"josuke","date":"2016-02-26T02:16:43.692+0000","up_votes":2,"down_votes":1,"body":"no, a menos que reworken al campeon tipo {{champion:14}} o {{champion:78}}","replies":[]},{"poster":"l Gally l","date":"2016-02-26T13:29:23.096+0000","up_votes":1,"down_votes":0,"body":"\"Es que me salio twisted fate magnifico xD\" Por Dios... Que manera de reirme con esa descripción, solo por eso te doy +1\nPero tambien tienes razon, hace tiempo que {{champion:18}}  fue reworkeada, pero los splash arts de sus skin no y son horriblemente feos.\nY bueno... Porque me salió {{champion:18}} Guerrillera xD","replies":[]}]}