{"poster":"Chadono","date":"2019-03-19T14:36:41.064+0000","title":"Schonmal mit einer 17/1 Botlane verloren?","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Ja, wenn Top und Jungle zusammen 22 mal sterben gehen. (siehe: https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3967546148/221631973?tab=overview )\r\n\r\nHabe vor einigen Tagen mal wieder mit SoloQ angefangen und es macht wirklich selten Spaß. 90% der Spiele sind Stomps, die eigene Perfomance ist meist völlig nebensächlich, denn entweder ist im Gegnerteam eine Landmiene oder du hast sie im eignen Team. Das Spiel ist praktisch schon entschieden, bevor die Laningphase rum ist.\r\nAuch das letzte Spiel war over, bevor es richtig losging, der Gegner hatte einen 10/1 (am Ende 22/2) Kha im Jungle. Was willste da noch machen.\r\n\r\nZudem hatte ich noch nie so viele Smurfs in meinen Games, die trotz einer Winrate von 60%+, mit mir in Low Silver gematched werden. \r\nFrustrierend.\r\n\r\nIch beschwere micht nicht, dass ich verliere. Ich verdiene den Lose in vielen Games. Trotzdem bin ich mit einer Winrate von 43% nach Silver 4 geclimbed, obwohl ich locker Bronze sein müsste, nachdem ich Monate kaum gespielt hatte. Die Art wie die Spiele ablaufen macht schlicht keinen Spaß. Ich werde mich kaum verbessern, wenn das Game nach ein paar Minuten entschieden ist, da der eigene oder der gegnerische Kha alles oneshottet.","replies":[{"poster":"xxAskaniaxx","date":"2019-03-20T20:33:22.050+0000","up_votes":2,"down_votes":0,"body":"Die schlauen Kommentare von bla bla Team hin oder her kann ich echt nicht mehr hören oder lesen.... Problem ist einfach das dass Matchmaking gefixed werden muss und zuviele geboostete Spieler und Smurfer unterwegs sind. Riot interessiert sich weder für die Geboosteten, noch für dich Smurfes und schon gar nicht für die Ausdrucksweise mancher Spieler im Chat. Das gesamte Unternehmen ist einfach auf Profit ausgerichtet mit ihren tollen Skins und was man nicht alles kaufen kann.... Es ist egal in welche Elo du schaust oder welchen bekannten Lol-Streamer du zu schaust, überall das gleiche egal ob in High-Elo oder Low-Elo! Der Alibi-Reset welcher von Riot nun durch geführt werden musste ist doch auch lächerlich! Season 9 ist bisher die schlimmste Season die ich gespielt habe! Das Matchmaking gehört dringend überarbeitet, die Leute die flamen gehören rigeros gebannt und fertig. Geboostete Spieler oder Smurfer auch gleich weg damit! Würden diese Faktoren einmal stimmen, dann könnt ihr hier auch mit eurem \"verbessern\" und \"Team\" Tipps kommen. Schon alleine der Einfall einen Chat im Loadingscreen zu machen ist für mich unverständlich bei einer solchen Community. Der sagenhafte Einfall pro Lanes Elo zu verteilen wurde auch schnell unter den Teppich gekehrt und warum??, weil es einfach nur Schrott ist was sie sich da wieder einfallen haben lassen. (verzeiht die offenen Worte) Dieses Game wird niemals fair sein denn dann kommt die Aussage mit den \"Wartezeiten\"! Ich bin es tatsächlich leid die müden Aussreden eines Unternehmens zu hören welches MRD. verdient! Weitere Fails sind nicht nur im Ranked-System, Matchmaking, nein Clash ist jedesmal ein reinfall, Champs werden gebufft und generved nach belieben und sogar der Client is buggy! Vielleicht sollte man mal die Dinge auch angehen bevor man wieder auf irgendwelche geisten Ergüsse kommt die dieses (eigentlich tolle Spiel) noch unspielbarer machen! Bitte verzeiht das ich mal hier offen die \"Problemchen\" anspreche!! Lg und viel \"SPASS\" beim Flamen, Trollen, Inten und AFK gehen :P :D ","replies":[]},{"poster":"Pure Cynicism","date":"2019-03-19T16:37:35.364+0000","up_votes":3,"down_votes":2,"body":"- LoL ist ein Teamspiel. Du gewinnst und verlierst als Team. Schlechte Spieler gewinnen dank ihres Teams und gute Spieler verlieren ebenfalls dank ihres Teams. Das ist aber nicht nur bei LoL der Fall, sondern bei JEDEM Teamspiel, sei es nun Overwatch, WoW, CS oder Battlefield oder zB auch Fußball und Handball. Gleichwohl kannst du durch gute Leistungen die Wahrscheinlichkeit eines Sieges deutlich erhöhen. Auch das gilt für jedes Teamspiel.\n\nFolglich ist dein Problem nicht LoL, sondern das Genre. Wenn du ausschließlich aufgrund deiner eigenen Leistung gewinnen willst, bleiben dir nur 1-1 PvP-Spiele, so was wie Starcraft 2 oder Fifa zB. \n\n- Du kannst dir aber nicht erlauben, mit schlechten Leistungen dich über gute Spieler des Gegners zu beschweren, wie den 22-2 Khazix. In diesem Spiel hast du selbst nämlich äußerst bescheiden gespielt. Umgekehrt hast du auch als reiner Splitpush-Tryndamere einen deutlichen Anteil am Sieg, wenn du mal eine Sekunde über das Makrogame nachdenkst. Gibt nicht umsonst High Elo Spieler, die in Low Elo nur splitpushen.\n\nLetztlich ist aber dein Problem deine Mentalität. Ich stimme dir zu, dass LoL keinen Spaß macht, wenn man nur gewinnen will. Aber auch das betrifft jedes Teamspiel. Solange du also nicht versuchst, auch an schlechten Spielen Spaß zu haben, wirst du an Teamspielen keinen Spaß haben.","replies":[{"poster":"Chadono","date":"2019-03-19T17:43:13.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verwaltungsakt,realm=EUW,application-id=ip27PlEH,discussion-id=3Y2oO5PK,comment-id=0001,timestamp=2019-03-19T16:37:35.364+0000)\n>\n> - LoL ist ein Teamspiel. Du gewinnst und verlierst als Team. Schlechte Spieler gewinnen dank ihres Teams und gute Spieler verlieren ebenfalls dank ihres Teams. Das ist aber nicht nur bei LoL der Fall, sondern bei JEDEM Teamspiel, sei es nun Overwatch, WoW, CS oder Battlefield oder zB auch Fußball und Handball. Gleichwohl kannst du durch gute Leistungen die Wahrscheinlichkeit eines Sieges deutlich erhöhen. Auch das gilt für jedes Teamspiel.\n> \n> Folglich ist dein Problem nicht LoL, sondern das Genre. Wenn du ausschließlich aufgrund deiner eigenen Leistung gewinnen willst, bleiben dir nur 1-1 PvP-Spiele, so was wie Starcraft 2 oder Fifa zB. \n> \n> - Du kannst dir aber nicht erlauben, mit schlechten Leistungen dich über gute Spieler des Gegners zu beschweren, wie den 22-2 Khazix. In diesem Spiel hast du selbst nämlich äußerst bescheiden gespielt. Umgekehrt hast du auch als reiner Splitpush-Tryndamere einen deutlichen Anteil am Sieg, wenn du mal eine Sekunde über das Makrogame nachdenkst. Gibt nicht umsonst High Elo Spieler, die in Low Elo nur splitpushen.\n> \n> Letztlich ist aber dein Problem deine Mentalität. Ich stimme dir zu, dass LoL keinen Spaß macht, wenn man nur gewinnen will. Aber auch das betrifft jedes Teamspiel. Solange du also nicht versuchst, auch an schlechten Spielen Spaß zu haben, wirst du an Teamspielen keinen Spaß haben.\n\nJap ich spiele schlecht (ewig nicht mehr ernsthaft gespielt, keine Ahnung von neuen Champs usw.). Trotzdem bin ich mit einer Winrate von deutlich unter 50% von Bronze nach Silver aufgestiegen. \nWas will mir das Ranked-System damit sagen? \"Du spielst schlecht, du bist immer wieder der Grund, warum dein Team verliert, hier sind noch stärkere Gegner, Viel Spaß\"?\n\nCS ist dabei völlig anders finde ich. Einige wenige schlechte Spiele reichen, um sofort im Ranking zu droppen, sodass man da wieder in seiner Elo spielt. \nUnd wenn da einer Unsinn macht gibts einen Vote-Kick und wir gewinnen mit einem Bot, da Skill eines Einzelnen hier viel schwerer wiegt als in LoL. Während in CS meistens das Team mit dem besten Spieler gewinnt, gewinnt in LoL meistens das Team, das nicht den schlechtesten Spieler auf der Map hat.","replies":[{"poster":"Pure Cynicism","date":"2019-03-19T17:50:16.796+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chadono,realm=EUW,application-id=ip27PlEH,discussion-id=3Y2oO5PK,comment-id=00010000,timestamp=2019-03-19T17:43:13.445+0000)\n>\n> Was will mir das Ranked-System damit sagen? \"Du spielst schlecht, du bist immer wieder der Grund, warum dein Team verliert, hier sind noch stärkere Gegner, Viel Spaß\"?\n> \n\nEs will dir sagen: Du bist ein Spieler, der bisher immer in mittlerem Silber unterwegs war. Daher bekommst du bei einem Sieg viel LP und verlierst bei einer Niederlage wenig LP, damit du - auch wenn es mal schlecht läuft - die Chance hast, dein altes Ranking wiederzuerlangen. Aber klar: Wenn die Winrate so bleibt, wirst du schnell droppen. \n\n> CS ist dabei völlig anders finde ich. Einige wenige schlechte Spiele reichen, um sofort im Ranking zu droppen, sodass man da wieder in seiner Elo spielt. \n> Und wenn da einer Unsinn macht gibts einen Vote-Kick und wir gewinnen mit einem Bot, da Skill eines Einzelnen hier viel schwerer wiegt als in LoL. Während in CS meistens das Team mit dem besten Spieler gewinnt, gewinnt in LoL meistens das Team, das nicht den schlechtesten Spieler auf der Map hat.\n\nHab ich andere Erfahrungen gemacht. Zum einen finde ich das Matchmaking - als Silber Elite - Spieler - fragwürdig. In manchen Matches gehe ich am Ende 3-26, in anderen wiederum bin ich 1. oder 2. mit umgekehrter KD. Aber du hast in dem Punkt Recht, dass du besser carryn kannst. Das Gold bzw. Geld spielt eine viel geringere Rolle als in LoL und ein guter Spieler kann locker vor seinem Tod drei Gegner mitnehmen. Elemente wie XP oder Scaling fallen ebenfalls raus.\n\nDer Votekick ist aber auch so eine Sache. Ich hab mal als 2. bester Spieler in dem Match die Bombe nicht schnell genug gefunden und wurde dafür gekickt. Ob der Bot besser als meine drei Mates gewesen wäre, die schlechter als ich waren? Fraglich. Bin froh, dass es so was in LoL nicht gibt.","replies":[{"poster":"Chadono","date":"2019-03-19T18:11:28.762+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verwaltungsakt,realm=EUW,application-id=ip27PlEH,discussion-id=3Y2oO5PK,comment-id=000100000000,timestamp=2019-03-19T17:50:16.796+0000)\n>\n> Es will dir sagen: Du bist ein Spieler, der bisher immer in mittlerem Silber unterwegs war. Daher bekommst du bei einem Sieg viel LP und verlierst bei einer Niederlage wenig LP, damit du - auch wenn es mal schlecht läuft - die Chance hast, dein altes Ranking wiederzuerlangen. Aber klar: Wenn die Winrate so bleibt, wirst du schnell droppen. \n\n\nNa gut, ich freue mich, dass das Ranked-System so viel Vertrauen in mich setzt und werde versuchen es nicht zu enttäuschen, indem ich zukünftig wieder Silver-Niveau erreiche :D\nAber erstmal ein paar Tage Pause, getilted spiele ich wirklich mies... Muss halt damit klar kommen, dass ich nicht jedes einzelne Spiel entscheiden kann. Manche Spiele werden schlicht ohne mich entschieden.","replies":[]}]}]},{"poster":"SSI CptHaunted","date":"2019-03-21T09:35:45.868+0000","up_votes":1,"down_votes":0,"body":"Das ganze mit Fußball zu vergleichen ist wohl ein bisschen weit hergeholt, schließlich sitzen die schlechten Spieler meist auf der Bank oder in der 2. Mannschaft die 3. Kreisklasse spielt.\n\nIch denke nicht einmal, dass das Problem die Mentalität ist. Ich wage zu behaupten, dass es relativ normal ist, dass es einem deutlich mehr auffällt wenn man gut spielt und trotzdem verliert als wenn man gut spielt und gewinnt/schlecht spielt und verliert/schlecht spielt und trotzdem gewinnt. Kein normaler Mensch hat Spaß an schlechten Spielen, man muss sie nur abhaken können.","replies":[]},{"poster":"00 M4ddin 00","date":"2019-03-20T06:34:12.229+0000","up_votes":1,"down_votes":0,"body":"Naja in richtigen Teams werden schlechte Spieler mit besseren Spieler ersetzt :) beim fussball zb. \n\nAlso ist es nur fair wenn ich mir nen starken Mate dazu hole ^^","replies":[]}]},{"poster":"SnapIntoASlimJim","date":"2019-03-19T14:45:43.393+0000","up_votes":2,"down_votes":0,"body":"https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3966249941/21688712?tab=overview\n\nShit happens. Was DU tun kannst ist deine Spielwiederholungen nach dem Spiel und einer kleinen Pause nochmal anzuschauen und für dich selbst zu analysieren. \nDu kennst es ja sicher, wenn man Streamern usw. zuschaut und dann seine \"Pro-Kommentare\" abgibt a la: \"Wasn Noob ich hätte das lieber so und so gemacht\" . \nUnd genau das tust du am Besten mit deinen eigenen Spielen und kommentierst dich selbst mal.\nDadurch zwingst du dich selbst quasi über das Spiel nachzudenken wodurch du besser wirst und die Spiele werden sich dann ganz anders anfühlen, weil du einfach einen Battleplan hast, noch vor Gamestart. \n\n\n\nKleiner Nachtrag, der mir eben noch so eingefallen ist. Du kannst auch auf https://euw.op.gg/statistics/champion/ die Winrates der Champions ansehen und evtl. deinen Championpool um einige der Picks mit höherer Winrate erweitern.\nDie Winrate ist ja nicht einfach so aus Spaß so hoch auf diesen Champions. Nur bitte nicht im Ranked first timen. xd\n\nWünsche dir dabei viel Erfolg und verbleibe mit freundlichsten Grüßen. {{champion:43}}","replies":[{"poster":"Chadono","date":"2019-03-19T15:34:50.761+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SnapIntoASlimJim,realm=EUW,application-id=ip27PlEH,discussion-id=3Y2oO5PK,comment-id=0000,timestamp=2019-03-19T14:45:43.393+0000)\n>\n> https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3966249941/21688712?tab=overview\n> \n> Shit happens. Was DU tun kannst ist deine Spielwiederholungen nach dem Spiel und einer kleinen Pause nochmal anzuschauen und für dich selbst zu analysieren. \n> Du kennst es ja sicher, wenn man Streamern usw. zuschaut und dann seine \"Pro-Kommentare\" abgibt a la: \"Wasn Noob ich hätte das lieber so und so gemacht\" . \n> Und genau das tust du am Besten mit deinen eigenen Spielen und kommentierst dich selbst mal.\n> Dadurch zwingst du dich selbst quasi über das Spiel nachzudenken wodurch du besser wirst und die Spiele werden sich dann ganz anders anfühlen, weil du einfach einen Battleplan hast, noch vor Gamestart. \n> \n> \n> \n> Kleiner Nachtrag, der mir eben noch so eingefallen ist. Du kannst auch auf https://euw.op.gg/statistics/champion/ die Winrates der Champions ansehen und evtl. deinen Championpool um einige der Picks mit höherer Winrate erweitern.\n> Die Winrate ist ja nicht einfach so aus Spaß so hoch auf diesen Champions. Nur bitte nicht im Ranked first timen. xd\n> \n> Wünsche dir dabei viel Erfolg und verbleibe mit freundlichsten Grüßen. {{champion:43}}\n\nDanke für deine Antwort und die Tipps, aber ich glaube ich verabschiede mich erstmal wieder aus LoL. Hab zwar gerade eins als Tryn gewonnen (hab nichts gemacht außer zu farmen), dafür verliere ich jetzt wieder eins, weil die Botlane geragequitted ist.\n\nDas ist nicht die Art und Weise, auf die ich meine Freizeit verbringen möchte, da mich das, obwohls nur ein Spiel ist, doch immer wieder tilted und ärgert.","replies":[{"poster":"Clawler","date":"2019-03-19T15:51:54.589+0000","up_votes":2,"down_votes":0,"body":"I feel u bro. zurzeit ist echt schlimm mit quittern etc.","replies":[]}]}]},{"poster":"Nordwolf87","date":"2019-03-20T11:52:10.313+0000","up_votes":1,"down_votes":0,"body":"Ehrm\n....\nDie Botlane (ADC + Supp) in dem verlinkten Game stand am Ende 18/17/26. Die Sivir stand 17/11 der Blitz 1/6. Das sind jetzt keine Stats die einen Win garantieren bzw einen Lose überraschend erscheinen lassen.\n\nKann es sein, dass dir im Titel eine 1 verloren gegangen ist? Oder hast du das falsche game verlinked?","replies":[{"poster":"Chadono","date":"2019-03-20T19:01:25.812+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nordwolf87,realm=EUW,application-id=ip27PlEH,discussion-id=3Y2oO5PK,comment-id=0003,timestamp=2019-03-20T11:52:10.313+0000)\n>\n> Ehrm\n> ....\n> Die Botlane (ADC + Supp) in dem verlinkten Game stand am Ende 18/17/26. Die Sivir stand 17/11 der Blitz 1/6. Das sind jetzt keine Stats die einen Win garantieren bzw einen Lose überraschend erscheinen lassen.\n> \n> Kann es sein, dass dir im Titel eine 1 verloren gegangen ist? Oder hast du das falsche game verlinked?\n\nDie Sivir kam tatsächlich 17/1 aus der Laningphase. Und hat dann absolut nichts mehr gemacht :D","replies":[]}]},{"poster":"00 M4ddin 00","date":"2019-03-20T06:32:03.492+0000","up_votes":1,"down_votes":0,"body":"Gestern mit einer 14/2 Botlane verloren top und jungel zusammen 24 Tode :) \nIch stand leider aber auch nur 1/2 oder 1/3 :(","replies":[]}]}