{"poster":"Inguz","date":"2016-08-13T00:53:00.759+0000","title":"Unclear ban Reasons","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hi guys, I just got an email saying:\n&quot;Greetings (account name here),\nActions that have been performed on your account are in violation of the League of Legends Terms of Use. You can review these terms at http://www.leagueoflegends.com/legal/termsofuse\nDue to the severity of this violation, your League of Legends account has been banned until Mon Feb 22 22:22:22 UTC 9002\nIf you have any questions, contact our Player Support team at https://support.leagueoflegends.com/home\nRiot Games Player Support&quot;\n\nSome minutes after this one I get:\n&quot;Your account: (account name here) was banned due to the use of malicious 3rd party programs or modifications to your League of Legends client. We believe that all players should play on equal footing in an effort to promote competitive sportsmanship. You should be aware that modifying your League of Legends client is against the Terms of Use: http://na.leagueoflegends.com/en/legal/termsofuse. We hope you can see that it is unsatisfying to play against other players who are using a tool to gain an advantage over others. &quot;\n\nHowever when I try to get into my account it says I&#039;m permanently banned, but I have no freaking idea of what they are talking about! I&#039;ve been playing with this account since Season 1, never used any weird 3rd party software with the game other than the ones allowed by riot :( , also I haven&#039;t installed any new software lately other than a couple of games from steam (which I doubt is the problem)\n\nSo just to be clear, the only third party software I use for league of legends is Discord and LSI for recording games and (I checked beforehand) both are perfectly allowed according to http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/5dmkJinG-3rd-party-applicationsmodifications-whats-allowed-and-what-isnt, I would expect at least getting a first warning with more information on what riot believes is a malicious 3rd party software so if it happens to be something in my computer that might be creating this issue I&#039;d like to know before I get banned; Also I believe it&#039;s unfair for a first infringement without notice, I&#039;ve never had this kind of issue before and I&#039;m already pissed off for getting my account banned, you are just pushing me to create another account and put money there to level it up quickly to play with my friends, and that&#039;s simply not fair, it feels like &quot;wait for 7000 years to play again or give us money to boost xp in a smurf account&quot;.\n\nHas anyone been in this situation before?\n\nPS: I&#039;ve created a ticket yesterday and no answer so far","replies":[{"poster":"Inguz","date":"2016-08-13T21:31:22.613+0000","up_votes":1,"down_votes":0,"body":"Answer from riot support:\n> We won't be able to go into the specifics of an account's exploit abuse, as divulging this information could compromise future investigations. Let me know if you have any other questions or concerns.\n\nBasically ignored my case, \"we banned you for 7000 years because of cheats, can't tell you why really but trust us\", they are really convinced I've cheated and apparently are not interested in listening to any input {{champion:32}} \n\nSeriously... I have all my games from this year recorded (which are no that many), if I can get pinpointed the games in which such violation happens I can provide a repetition to prove nothing funky is going on there, let's see what happens.","replies":[{"poster":"SephirothSG","date":"2016-08-14T04:17:31.532+0000","up_votes":1,"down_votes":0,"body":"Could you please provide me your ticket number?","replies":[{"poster":"Inguz","date":"2016-08-14T04:49:14.570+0000","up_votes":1,"down_votes":0,"body":"Absolutely: **22855810**\nI know permabans are usually not lifted, but I'd like to demonstrate if possible that I've never cheated.\nThanks for your attention.","replies":[{"poster":"SephirothSG","date":"2016-08-14T15:08:57.558+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nI passed your ticket on to have another set of eyes take a look to ensure nothing was missed.\n\nPlease refer to your ticket for further correspondence.\n\nNote that whatever the outcome of this, the results are FINAL.","replies":[]}]}]}]},{"poster":"SephirothSG","date":"2016-08-13T04:10:39.595+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\n>PS: I've created a ticket yesterday and no answer so far\n\nPlayer Support is currently backlogged and replies may take longer than normal, expect to receive an initial reply in 48 hours or so after ticket creation.\n\n>So just to be clear, the only third party software I use for league of legends is Discord and LSI for recording games and (I checked beforehand) both are perfectly allowed according to http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/5dmkJinG-3rd-party-applicationsmodifications-whats-allowed-and-what-isnt\n\nThe linked list is merely a guideline of what has and hasn't resulted in bans in the past or currently, there is no official list of allowed/disallowed third party software. Riot may action on any tool they deem to provide an unfair advantage to players at any time. \n\nA direct quote from the ToS below stating that ANY third party software is technically disallowed and may result in a ban at any time. (One line has been bolded for clarity)\n\n>J. Using any unauthorized third party programs, including but not limited to \"mods,\" \"hacks,\" \"cheats,\" \"scripts,\" \"bots,\" \"trainers,\" and automation programs, **that interact with the Software in any way, for any purpose**, including, without limitation, any unauthorized third party programs that intercept, emulate, or redirect any communication between the Software and Riot Games and any unauthorized third party programs that collect information about the Game by reading areas of memory used by the Software to store information;","replies":[{"poster":"Inguz","date":"2016-08-13T05:51:48.594+0000","up_votes":1,"down_votes":0,"body":"Thanks SephirothSG for your reply, regarding the quoted text from the ToS I agree on your comment however it's based on riot answers, Discord is just a voice chat application, nothing magical about it when you play with friends, not a cheat either as competitive teams use it; Regarding LSI, it doesn't interact with the game itself but with content consumed from published riot APIs so any information pulled by that application is perfectly legal, and furthermore, the only useful feature is the game recording for later review, so again, no immediate advantage gained ingame.\n\nWhat puzzles me from your comment is this\n> Riot may action on any tool they deem to provide an unfair advantage to players at any time.\n> ANY third party software is technically disallowed and may result in a ban at any time.\n\nSince no \"official list\" is published, riot can choose just to permaban my 6 years old account with no warning based on an arbitrary non-public decision? that seems rather harsh right? specially when you consider we don't really know what half of the processes running in my computer are doing, why not just maintain a list so it's easier to validate that? even better, if riot monitors running processes it can just warn \"oi, that thing you are using goes against ToS, remove it or face the consequences\", do you know if this is somewhere in the backlog?\n\nCheers!","replies":[{"poster":"SephirothSG","date":"2016-08-13T05:59:47.556+0000","up_votes":1,"down_votes":0,"body":">Since no \"official list\" is published, riot can choose just to permaban my 6 years old account with no warning based on an arbitrary non-public decision? that seems rather harsh right? \n\nThere is always room for false positives, it IS possible you were banned wrongly which is why you should refer to your ticket for further correspondence with Player Support regarding your ban.\n\nRegarding LSI, while as I said Riot may not be actioning on it at the moment, these things can change at any time.\n\nHere is a quote regarding LSI from Riot Tamfail\n\n>\"Officially, we're not sanctioning anything -- Duowan, Elobuff and similar websites are all violations of our terms -- we have just chosen (and we have full discretion here) not to enforce.\" -- Tamfail (September 10, 2012)","replies":[{"poster":"Inguz","date":"2016-08-13T21:33:40.314+0000","up_votes":1,"down_votes":0,"body":"True, but then Sargonas said \n> Totally fine to use it. We worked with LSI directly to ensure that their features fit within our 3rd party guidelines. - Riot Sargonas (NA) - 11 months ago\n\nThis is the kind of problems not having an official list creates :(","replies":[]}]}]}]}]}