{"poster":"Darling HxH","date":"2018-08-13T16:35:52.151+0000","title":"Reporting an actual troll","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Hey today I had a disgusting experience while playing ranked, first I had a game and the enemy supp was a cho  and feed he pretty much will not do absolutely anything,  he keeps saying he is just having a bad game bla bla bla,  still I reported him for inting eventhough he was on the other team because it wasn't even fun to win a game like that, then for the disgrace on me, he was in my team next game, i didnt realize it was him but as soon as the game started I got it, he picked nasus supp, afk for 2 30 mins before we could remake, then he afk for 5 mins under tower getting killed and as soon as he spawns he will go under tower stay still and get killed. This is clearly a troll, I have some footage of both games I am wondering to who should i send this to because is not fair that ppl is actually going back in divisions and losing lp because of ppl like him, I rather have him flaming me or pin marking me but actually playing or at least trying than he just staying under turret going ap nasus and just wondering around the base. This is his summoners name just in case any of you guys has the disgrace of finding him, the troll goes under the name of Dangerous You pls report him if he keeps behaving like this, just really ruins the game for everyone","replies":[{"poster":"Bookbash","date":"2018-08-13T21:03:17.479+0000","up_votes":2,"down_votes":0,"body":"Normally I wouldn't reply to such a thread, but due to a recent experience I'll give you my take on the matter.\n\nIn a recent game a troll was on our team. Someone who was intentionally griefing the game. There is plenty of proof of this, I won't bore you with all of the details. The point is that after finishing the game and checking the player out, they had done this before, but not in every game (they would choose their moments). Because of this and the experience in game where I was behaving (didn't say a single bad thing to the player, or ping spam them, just sucked it up), I decided to send in a ticket to Riot support.\nIn this ticket that took me 30 minutes to draft up, I listed pretty much everything that happened during champ select, the game itself and the after match screen. I even uploaded the replay file (15mb or so) for the Riot member to look over. I mentioned their history. I listed the points where the player themselves openly admitted to trolling before, in and after the game, and also said words to the effect like \"nothing will happen\", i.e. they were flaunting their trolling.\n\nThis is the reply that I got:\n\n> Hello Bookbash,\n> \n> Thank you for this report! We can’t often take action on reports sent to us through tickets, but we created the Instant Feedback System to help us track when a player is consistently hurting others.\n> \n> Even if you couldn’t use the report feature for this game, please keep using it when you can. Reports you make provide us with valuable tracking information and help to escalate players to our attention for investigation. Each report brings violators of the Summoner's Code one step closer to punishment and, hopefully, toward reformed behavior.\n> \n> You’ll occasionally, but not always, get messages from the IFS letting you know that a player you reported has been punished. Keep reporting inappropriate behavior and we’ll make sure negative actions have consequences!\n\nAfter mentioning in the report that I took a long time to write the report, but its also a pain to even sign into the support site with all of these anti-bot measures, and providing all of the details, to get such a reply indicated clearly to me that Riot Game do not want anything to do with fixing trolling behaviour. They prefer to leave it up to their automated system that is quite simply flawed.\n\n**TLDR: The only thing that you can do is use the report system in game. Riot do not care about investing human resources into fixing trolling behaviour.**\n\nSorry about that, but it's things like this that give rise to players believing that reports do nothing. Unless they are taking a bad rap on Reddit or other social sites, they simply don't care.","replies":[{"poster":"Ninox","date":"2018-08-14T02:17:31.598+0000","up_votes":2,"down_votes":2,"body":"Support can't give you any details about another player's accounts, even implicitly. It's a long standing policy and largely privacy related, this is why you get generic responses to report tickets, it *does not* mean they haven't looked at it.","replies":[{"poster":"JesusForgotHisGA","date":"2018-08-17T03:52:14.935+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=T8eq2lFQ,discussion-id=JZRvtUh0,comment-id=00000001,timestamp=2018-08-14T02:17:31.598+0000)\n>\n> Support can't give you any details about another player's accounts, even implicitly. It's a long standing policy and largely privacy related, this is why you get generic responses to report tickets, it *does not* mean they haven't looked at it.\n\nIt means they looked at it and from the drop down menu selected the standard response then moved onto the next ticket.\n\nIt's no secret this game is full of trolls that run rampant with little to no consequences.","replies":[{"poster":"Bookbash","date":"2018-08-18T04:36:22.742+0000","up_votes":1,"down_votes":1,"body":"Correct. Let's have a look at the troll's recent games:\n\n[Recent Games](https://i.imgur.com/CGbRCna.jpg)\n\nNow according to the player themselves (and it's in the report send to support), he was Silver 2 before he started trolling. When I played with him he was Silver 5. But yeah, generic response.","replies":[]}]},{"poster":"Bookbash","date":"2018-08-14T18:17:53.641+0000","up_votes":2,"down_votes":0,"body":"> We can’t often take action on reports sent to us through tickets\n\nPlayer is still playing, still feeding and trolling. I got all the details I need to know what happened with their account.\n\n**NOTHING.**","replies":[]}]},{"poster":"Darling HxH","date":"2018-08-13T23:56:50.542+0000","up_votes":2,"down_votes":0,"body":"Yeah I know most of people that behave like this don’t do it often and it’s probs a way to relieve frustration or whatever man, but this guy my team checked his history and legit they guy has a 20% win rate in ranked and all his history is he going supp with some random champion and just feedin like crazy or sometimes he has some good scores but if you check the stats is like he wasn’t even in lane for most of time, so I just wonder how come rito games don’t take matters like this into their hands, I guess is because he didn’t flame or anything but just straight up trolling, system won’t recognise him as a troll but come on, so disappointed that I’ve been playing for years and stuff like this keeps happening. GG riot","replies":[]}]},{"poster":"phantom9399","date":"2018-08-18T10:24:13.761+0000","up_votes":1,"down_votes":0,"body":"Let me just put this here:\n\nhttps://boards.oce.leagueoflegends.com/en/c/player-behaviour/cO7ApjMl-memes\n\nBy the way still going strong with honor level 2 now #exploitingloopholes #honorlevel2wtf #keyspamfordays #ruiningpeoplespromos1gameatatime","replies":[]},{"poster":"Bifgoot","date":"2018-08-14T03:56:29.265+0000","up_votes":1,"down_votes":0,"body":"I was in this game as well playing adc.. he picked nasus support, which would be totally fine if you actually played the game! he sat undertower for the first like 10mins then he suddenly started to play again, he said its because he had an emergency and had to go help, however everytime i was about to kill the enemy adc or support he'd walk out ks with his e and go afk again. not a fun experience, and by the looks of his account its a bought account and he has won 2 games or so... and when he came back he said hes new and ra ra ra, this guys just a troll and should honestly be banned!","replies":[]}]}