{"poster":"HiiiiiPower","date":"2016-10-19T11:39:32.378+0000","title":"saison 2017","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Wei&szlig; einer genauer, wie das mit der Solo/Duo Flexi Q abl&auml;uft?\n\nGibt es wirklich Solo/Duo oder verschmilzt das schlussendlich doch wieder nur mit der  Flexi, weil man ja auch Solo in die Flexi Q gehen &quot;kann&quot;, aber im Endeffekt ist es doch genau gleich wie jetzt. Spielst halt Solo oder in der Dynamic für die \"Solo Q\" Wertung / Liga....Flexi Q ist ja auch erst dann Teamranked, wenn man als Team reingeht.","replies":[{"poster":"Nivoras","date":"2016-10-19T15:42:56.016+0000","up_votes":1,"down_votes":0,"body":"Wenn du Solo-/DuoQ spielst, werden alle anderen im Spiel ebenfalls nur alleine oder zu zweit gequeued haben. Die FlexQ läuft dann halt wie jetzt die DynQ (ich verstehe den sinn der Umbenennung nicht tbh), weil es zwei verschiedene Warteschlangen sind, wie zB jetzt Normal, Ranked und TR verschiedene Warteschlangen sind. \nLediglich im TR kann es passieren dass du nicht den Modus bekommst den du willst sondern im Aram landest, nur Rito weiß wieso, bei solo und Flex Q sollte das aber nciht der Fall sein :D","replies":[{"poster":"HiiiiiPower","date":"2016-10-20T07:33:56.108+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nivenor,realm=EUW,application-id=7hciEY9w,discussion-id=wgFYra7X,comment-id=0001,timestamp=2016-10-19T15:42:56.016+0000)\n>\n> Wenn du Solo-/DuoQ spielst, werden alle anderen im Spiel ebenfalls nur alleine oder zu zweit gequeued haben. Die FlexQ läuft dann halt wie jetzt die DynQ (ich verstehe den sinn der Umbenennung nicht tbh), weil es zwei verschiedene Warteschlangen sind, wie zB jetzt Normal, Ranked und TR verschiedene Warteschlangen sind. \n> Lediglich im TR kann es passieren dass du nicht den Modus bekommst den du willst sondern im Aram landest, nur Rito weiß wieso, bei solo und Flex Q sollte das aber nciht der Fall sein :D\n\nNaja, ich finde es schade das Teamrankedspieler erneut mit Füssen getreten werden. Ich hatte bisher leider noch nicht das Glück, kontinuierlich mit ein und demselben Team über einen längeren Zeitraum zu zocken. Diese Season habe ich es für die Wardskins getan und es hat mir durchaus mehr Spass gemacht, aber das setzte sich aus immer anderen Partnern oder auch mal 3v3 Rankeds zusammen. Im Teamranked möchte man auch gegen andere Teams zocken und nicht einfach nur gegen 5 DynQ Leute, die sich gerade so zusammengefunden haben (gut das kannste im Teamranked teilweise genauso vorfinden).","replies":[{"poster":"Nivoras","date":"2016-10-20T13:41:42.802+0000","up_votes":1,"down_votes":0,"body":"Darauf bin ich jetzt nicht eingegangen um eben nicht wieder rumzunörgeln wenn Riot schon versucht es uns recht zu machen^^ An sich hast du aber recht, es ist für Leute die TR spielen nicht unbedingt die beste Lösung. Weniger wegen deinem Punkt, weil ich auch genug Leute kenne die im TR einfach ständig neue Teams mit anderen Leuten  erstellen, sondern viel mehr wegen der Elo. Ich kann nicht mehr mit meinem Team spielen, weil die 2x Plat und 2x Dia sind, und meine Chancen mit Gold 4 schnell Plat zu kommen doch nicht allzuhoch sind, und TRs machen schon mehr Spaß wenn man eben so zu fünft ist und dieses competitve Gefühl hat als wenn man, obwohl man eigentlich eingespielt ist, nur in Normals spielen kann. ^^","replies":[]}]}]},{"poster":"TerrorRaven","date":"2016-10-19T11:41:41.638+0000","up_votes":1,"down_votes":0,"body":"Solo/DuoQ und FlexiQ werden getrennt voneinander laufen. Die FlexiQ ist eine Mischung auf Teamranked und der DynQ.","replies":[]}]}