{"poster":"AnySkywalkeR","date":"2018-03-03T03:39:49.644+0000","title":"Bajos Fps, latencia alta después del parche 8.4?","subforum":"Charlas Generales","embed":{"description":"everything was fine until yesterday evening, i had 144fps and stable. today right after i patched 8.4 i noticed a huge fps drop. asking around other people are having the same problem. can the technical NA department fix this? how can LoL, the game that runs even on toasters, be so badly optimized?","url":"https://boards.na.leagueoflegends.com/en/c/help-support/lkIv6dGo-drastic-fps-drop-right-after-patch-84","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":3,"down_votes":0,"body":"Hola pros &iquest;como est&aacute;n?\nLes cuento mi caso tengo una pc buena un i7 6600k una gtx 1050ti 16gb de RAM, 500Gb SSD en fin, el lol siempre me corre a 144 Fps y a 60ms (normalmente) el problema es el siguiente, despu&eacute;s de la actualizaci&oacute;n 8.4 el lol me corre a 90 Fps 80 en las team fight as&iacute; con todos los efectos de las habilidades me baja a 30 Fps y nose por que&iquest;? ha prob&eacute; bajando las gr&aacute;ficas a m&iacute;nimo y es lo mismo nada cambia, el ms dice ser 60 pero se siente como de 200 de vez en cuando y es molestos cambie de net miles de veces y no cambia nada lei un post en ingl&eacute;s del servidor de NA y a muchos les pasa lo mismo podr&iacute;an ayudarme a por lo menos que rito se de cuenta de este problema y tambi&eacute;n si a alguien le pasa lo mismo me lo haga saber, para no sentirme solito :v","replies":[{"poster":"Runth","date":"2018-03-03T19:33:46.874+0000","up_votes":1,"down_votes":0,"body":"la llegada de los drivers de 4k, empezaron a caerse los bajos fps q afectaron a cualquier juegos q tienes, q eso obligas a comprar mas memorias ram a tu cpu para solucionar este enrollo, pero si no puedes hacerlo, recomiendo actualizar el driver de tu tarjeta casi siempre y cuando ya empiezas a configurarlo, saca algunas de las graficas q son innecesarias, porque eso come fps a la memoria\n\npero los ms no se arregla, ya q eso depende de tu internet xD , el cable q usas y el trafico","replies":[]},{"poster":"Hwaxinghz","date":"2018-03-03T12:59:55.929+0000","up_votes":1,"down_votes":0,"body":"Actualiza los Drivers de la [Placa de vídeo](http://www.nvidia.es/download/driverResults.aspx/131475/es), el [Directx](http://www.directx.com.es/), [Placa de Red](https://www.youtube.com/watch?v=t6jYPYeBo9g), Windows (Si es el 7, tendrás que verificar la [lista negra de actualizaciones](https://www.taringa.net/comunidades/serviciotecnico/9599849/Lista-negra-actualizaciones-win7-Pirata.html) antes de instalarlas con Windows Update), Visual C++ redistributable 2005-2008-2010-2012-2013-2015 [(Para 32 y 64 bits)](https://www.itechtics.com/microsoft-visual-c-redistributable-versions-direct-download-links/), [Configura bien tu Internet](https://support.riotgames.com/hc/es-419/articles/201752664) y [Repara el Juego](https://support.riotgames.com/hc/es/articles/224826367-Resoluci%C3%B3n-autom%C3%A1tica-de-problemas-Herramienta-de-reparaci%C3%B3n-hextech) (Me imagino que lo tienes instalado en el SSD)\n\nEn cada apartado te añadí un link que te llevará a la descarga OFICIAL de los drivers (Menos del de Red que varía según tu placa madre).\n\nSi con esto sigues teniendo problemas del Juego, tendrás que verificar si tu PC tiene [Parking](https://www.taringa.net/posts/ebooks-tutoriales/18571808/Deshabilitar-Core-Parking-Limite-del-Procesador-en-Windows.html) (que apaga los núcleos del Procesador), y si es así, con ese tutorial podrás hacer que tu PC funcione mejor.\n\nOtra cosa que puedes hacer es [Utilizar MSI AFTERBURNER](https://www.crazymen.net/reducir-temperatura-msi-afterburner/) para encender los ventiladores de la GPU al 50-75% permanentemente, así evitar un sobrecalentamiento.\n\nSi tienes DUDAS avísame y vemos.","replies":[]},{"poster":"kmusdarck","date":"2018-03-03T04:04:53.500+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa lo mismo, me tiraba unos 120 estables (poniendo el limite), ahora anda en 60/70","replies":[]}]}