{"poster":"Lowgdog","date":"2018-08-04T00:15:42.973+0000","title":"Performance on high end machines need to be addressed.","subforum":"Gameplay","up_votes":4,"down_votes":1,"body":"It&#039;s 2018 and there is still issues with stuttering, hitching, freezing, and random bugs that occur due to in game engine issues. When is it going to be addressed because playing on a GTX 1080 + i5-8600k should not feel this horrid. I have cleaned drives, reinstalled, checked Nvidia control panel, and the list goes on yet there is nothing that can remedy how badly the game runs for anyone","replies":[{"poster":"SSmotzer","date":"2018-08-04T17:10:35.954+0000","up_votes":2,"down_votes":0,"body":"Have you tried messing around with the cfg files?\nHave you tried running it in windowed, or boarderless windowed?\nHonestly, there are any number of things that could be causing this.","replies":[{"poster":"Lowgdog","date":"2018-08-04T17:21:03.853+0000","up_votes":1,"down_votes":0,"body":"Borderless windowed is somewhat stable, but not that much better than fullscreen. On cfg files, I think it goes deeper than the surface. League is running on a very old software and I think we are seeing it reach a time for change. I do not think I have the obligation to fix the issue if this has been a Riot side issue for awhile now. I am just bringing it up because it was just recently fixed for a little bit and now its back","replies":[{"poster":"SithesisLord","date":"2018-08-04T21:10:20.757+0000","up_votes":2,"down_votes":0,"body":">League is running on a very old software and I think we are seeing it reach a time for change.\n\nLeague may be running on old software that has been steadily upgraded as the patches go by, but that´s not the problem with League's poor performance.\n\nThe client being built on a Chromium framework is.","replies":[{"poster":"Lowgdog","date":"2018-08-04T23:41:18.850+0000","up_votes":1,"down_votes":0,"body":"It's also funny to note that client issues have been going insane lately so I have no idea when they will address it","replies":[]}]}]}]},{"poster":"Khristophoros","date":"2018-08-04T01:34:50.509+0000","up_votes":1,"down_votes":0,"body":"Have you tried disabling vsync?","replies":[{"poster":"Lowgdog","date":"2018-08-04T02:32:28.211+0000","up_votes":1,"down_votes":0,"body":"V-sync has been off. Never had this issue with older hardware like a 750. Ever since I used the higher end graphics cards League runs like trash. You can watch any major streamer and see that their fps dips relatively hard as well","replies":[{"poster":"Khristophoros","date":"2018-08-04T05:08:34.867+0000","up_votes":2,"down_votes":0,"body":"Damn this is disappointing to hear because I am planning to upgrade soon.","replies":[{"poster":"Lowgdog","date":"2018-08-04T17:08:45.376+0000","up_votes":1,"down_votes":0,"body":"I'd definitely consider it still. League should not bar you from enjoying other games. What did you plan on getting? I really enjoyed my 1070 but now I am pretty satisfied with a 1080 especially after all the price dips. I usually play games like Rainbow Six, Fortnite, League, Overwatch and whatever else I'm feeling. I just hope League gets optimized a little more because I might end up getting more RAM to see if it helps any with stability.","replies":[{"poster":"Khristophoros","date":"2018-08-04T19:28:28.195+0000","up_votes":2,"down_votes":0,"body":"Not sure if I'll wait longer or just grab a 1080 soon.","replies":[]}]}]}]}]},{"poster":"MagicFlyingLlama","date":"2018-08-04T00:29:44.653+0000","up_votes":1,"down_votes":1,"body":"Totally fine on my end except for rare freezes in ARAM only. Send a log or bug report if you want it addressed.","replies":[{"poster":"Lowgdog","date":"2018-08-04T02:34:41.339+0000","up_votes":1,"down_votes":0,"body":"Whats your rig? Also, it's not a matter of what I want. It's a matter of what Riot should look into instead of pumping out all these new changes and what not. If Ubisoft can do something like Operation Health for R6, then Riot can address some of the problems that have been overlooked. Plus, it's happens to plenty of people so just because your end is unaffected does not mean the problem doesn't exist.","replies":[{"poster":"MagicFlyingLlama","date":"2018-08-04T02:48:30.294+0000","up_votes":1,"down_votes":1,"body":"My point is it happens to a very small (but vocal) number of players, and riot cant do anything about it unless those players submit logs and specs so they can identify a common cause in hardware or software.\n\nIf it happened to even 10%, the boards would be a screaming mob. People dont post to say everything is nominal.","replies":[{"poster":"Lowgdog","date":"2018-08-04T17:06:28.832+0000","up_votes":1,"down_votes":0,"body":"Oh yeah, I agree. I used to have the same issues on my 1070 so I wouldn't even be surprised if it's a problem with the Pascal series of cards.  I will probably submit something and have them look into it because I play different games and League/Fortnite are the only games right now that are giving stutters.","replies":[{"poster":"MagicFlyingLlama","date":"2018-08-04T20:16:58.596+0000","up_votes":1,"down_votes":1,"body":"I know tons of people with pascal cards and no issues, myself included.\n\nIf it was something that obvious and easily replicated, chances are it would be fixed already. It could be a specific driver or setting, though.","replies":[{"poster":"Lowgdog","date":"2018-08-04T21:07:06.747+0000","up_votes":1,"down_votes":0,"body":"Like I said for the second time, just because you know 'tons' of people or dont have the issue yourself doesn't mean its non existent","replies":[{"poster":"MagicFlyingLlama","date":"2018-08-04T21:22:27.711+0000","up_votes":1,"down_votes":1,"body":"I never said it was.\n\nYou shit ultra-defensive attitude wont get you help, though.","replies":[{"poster":"Lowgdog","date":"2018-08-04T23:40:01.671+0000","up_votes":1,"down_votes":0,"body":"And replying with the notion that you're not having the issue wont help either. If it doesnt bother you, scroll right on down to see someone elses post. If im responding to you trying to be constructive and theorize possible issues, dont keep saying ahh could be anything because im not struggling with it. Ok well if it doesnt bother you, you can happily fuck right off :)","replies":[{"poster":"MagicFlyingLlama","date":"2018-08-04T23:47:05.347+0000","up_votes":1,"down_votes":0,"body":"Go swing your dick elsewhere. You obviously dont want to solve the issue, of you would not be losing your shit all over a logical discussion.","replies":[]}]}]}]}]}]}]}]}]}]}