{"poster":"TexMex406","date":"2017-02-22T09:37:03.286+0000","title":"High Ping und LAAAAAG","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nwer kennt es nicht. Ein Toplaner, der nach 15Minuten 9CS hat, weil er einen HighPing hat.\r\nDer ADC, der dem gegnerischen ADC beim snowballen hilft und sein Versagen dann auf Lags schiebt. \r\n\r\nNaja ich will jetzt nicht zu sehr rumheulen, weil am Ende bringt es leider nichts!\r\n\r\nDazu jetzt mein Vorschlag:\r\n\r\nKann man Leuten mit einem Ping von +X nicht einfach das betreten der Solo/Duo Warteschlange untersagen?\r\nUnd Leute die regelm&auml;&szlig;ig im Ranked disconnecten eine Sperre f&uuml;r Ranglistenspiele auferlegen, die erst verschwindet, wenn er/sie X-Normals gemacht hat ohne Probleme. (Sowohl f&uuml;r Leaver als auch f&uuml;r Internetprobleme)","replies":[{"poster":"CrasenEX Neeko","date":"2017-02-22T10:15:16.939+0000","up_votes":1,"down_votes":0,"body":"Nein kann man nicht. Jeder kann mal nen High-Ping haben. Das muss nicht unbedingt dauerhaft sein. Es kann auch am Anbieter o.ä. liegen. \nIch selbst hatte erst vor kurzem nen High-Ping und weiss immernoch nicht wieso das passiert ist. Wenn es passiert dann passiert das eben. Dagegen kann man nichts machen. \nSo eine Sperre für ranked spiele würde sich negativ auf das Spiel auswirken. Zumindest seitens Riot. \nUnd niemand würde sein eigenes Geschäft mutwillig schädigen. Das heisst, dass es so etwas niemals geben wird.","replies":[{"poster":"TexMex406","date":"2017-02-22T10:35:44.153+0000","up_votes":1,"down_votes":0,"body":"Verstehe nicht was ein kurzfristiger, einmaliger High Ping mit meinem Vorschlag zu tun hat.\n\nIst ja okay, dass jeder mal einen High-Ping hat, aber mit einem wissentlichen High-Ping hat man einfach nichts im Ranked verloren.","replies":[{"poster":"AI Yjuq","date":"2017-02-22T15:23:07.148+0000","up_votes":1,"down_votes":0,"body":"\"[...] aber mit einem wissentlichen High-Ping hat man einfach nichts im Ranked verloren.\"\nUnd wo würdest du da das cap setzen deiner Meinung nach? Ich selber spiele mit um die ~100ms konstanten Ping.\nHab bisher damit noch keine Probleme gehabt. >.>","replies":[{"poster":"TexMex406","date":"2017-02-23T08:33:49.131+0000","up_votes":1,"down_votes":0,"body":"100ms ist ja noch spielbar, aber ab 200-300 hat man schon deutliche Nachteile.","replies":[]}]}]}]}]}