{"poster":"BlazeDeeGaming","date":"2020-02-25T00:08:27.023+0000","title":"Gebannt wegen einem premade Team...","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":18,"body":"Nun es ist passiert...\r\nnun wurd ich Opfer einer Permanenten Sperre aufgrund provozierte Aufreger von meinen \"Mitspielern\" die sich von anfang bis ende im Match so giftig daneben benahmen das mir halt der Hut hochging....keine Hilfe vom lanemate bis hin zum absichtlichen Feeding der Gegner um mich mit diesem auf der Lane zurückzulassen. natürlich regt man sich deswegen auf wenn man dauernd angelacht/emote spammed wird, dir jeglichen Match Spaß versaut wird weil sich 4 freunde ein Spaß daraus machen einen random Spieler (mich) eines der einzigen 2 Matches zur Hölle macht das ich halt am Abend mal spielen kann...\r\n\r\nJa dafür werde ICh dann auch noch bestraft das ICH opfer solcher Spieler werde....naja was solls das war das letze mal das ich überhaupt den Kram von Riot Games jemals noch anfassen werde. Solche Inkompetenz muss man nicht finanzieren indem man sich hier und da mal paar Riot Points kauft um nur im nächsten match von der ach so tollen \"Community\" hier bannen lässt weil se mit ihrem Leben nicht klar kommen und lieber in einem Online Game zufällige fremde Spieler das Spiel versauen müssen.\r\n\r\nWünsche euch weiterhin viel Spaß und hoffe das Ihr nicht auch ein opfer solcher Unsozialen griefer werdet wie meiner einer der durch gezielte Provokation gemobbt wurde und dann noch von diesem Saftladen Riot Games eins oben drauf bekommt während sich diese \"Community\" auf die Schulter klopft und wieder ein gelegenheitsspieler ausm game gegrieft hat auf dreckige art und weise....","replies":[{"poster":"Eroticat Nimar","date":"2020-02-25T01:45:17.996+0000","up_votes":10,"down_votes":1,"body":"Du scheinst ein sehr emotionaler Mensch zu sein.\nVielleicht sind Singleplayer Spiele eher was für dich.","replies":[{"poster":"JustA kleo","date":"2020-02-25T19:06:16.572+0000","up_votes":2,"down_votes":0,"body":"ich glaube online spielen viele leute gerne die \"jeder hasst mich ich bin ein opfer\" karte aus.","replies":[]}]},{"poster":"Aymira","date":"2020-02-25T00:41:08.767+0000","up_votes":7,"down_votes":0,"body":"Gebannt wegen einem Premade Team?\n\nDen Titel könntest du dann auch \"Gebannt wegen meines eigenen Fehlverhaltens\" nennen. Und ich sag dir auch, wieso. \n\n> nun wurd ich Opfer einer Permanenten Sperre aufgrund provozierte Aufreger von meinen \"Mitspielern\" \n\nSie haben dich also provoziert. Kein feinstes benehmen dieser \"Premade Truppe\" jedoch liegt es dann an dir, wie du mit der Situation umgehst.\n\n> die sich von anfang bis ende im Match so giftig daneben benahmen das mir halt der Hut hochging...\n\nGut, Emotionen sind menschlich. Und das man sich darüber aufregt kann ich durchaus verstehen. \nWas ich allerdings nicht verstehen kann ist, wieso du diese Emotionen dann ins Spiel getragen hast. \n\nDas Fehlverhalten derer, die dich provozieren hat im Spielchat nichts verloren, genau so wenig wie emotionale, eventuell beleidigende Ausdrücke deinerseits.\n\n> Ja dafür werde ICh dann auch noch bestraft das ICH opfer solcher Spieler werde...\n\nJa, wurdest du. Es war aber deine Entscheidung auf die scheiße die verzapft wurde aufzuspringen. Hättest du nämlich all deine Emotionen aus dem Spiel heraus gehalten, dann wäre der Account nun noch aktiv. Vermutlich ¯\\\\\\_(ツ)_/¯ \n\n> Solche Inkompetenz muss man nicht finanzieren indem man sich hier und da mal paar Riot Points kauft um nur im nächsten match von der ach so tollen \"Community\" hier bannen lässt weil se mit ihrem Leben nicht klar kommen und lieber in einem Online Game zufällige fremde Spieler das Spiel versauen müssen.\n\nDas Geld welches du in das Spiel \"investierst\" schützt dich vor Strafen nicht. Und Inkompetenz würde ich Riot auch nicht vorwerfen. Schließlich haben sie jemandem aus dem Spiel entfernt, der sich scheinbar daneben benommen hat. \n\n***\n\nJetzt noch etwas zum Schluss. \nWenn du der Meinung bist, dass du zu Unrecht bestraft wurdest, dann wende dich an den Support oder wahlweise, disktutier hier im Forum mit uns darüber, indem du deinen Chatverlauf unverfälscht offenlegst. \n\nDes Weiteren. Einen permanenten Bann bekommt man nicht einfach so (außer bei offenen Zahlungen und Drittanbietersoftware). \nEs gibt die sogenannten Strafstufen \n\n* 10 Spiele Chateinschränkung\n* 25 Spiele Chateinschränkung \n* 14 Tage Sperre \n* Permanente Sperre \n\nHierbei ist es möglich Strafstufen zu überspringen, zum Beispiel direkt auf einen 14 Tage Bann zu kommen, zum Beispiel durch Hetzrede.\n\nEgal wie es ist. Du wirst, wenn du nun permanent gebannt wurdest, schon mindestens eine dieser Strafstufen gesehen haben. Und in der Meldung zum 14 Tage Bann steht ausdrücklich geschrieben, das jedes weitere Fehlverhalten dafür sorgt, dass dein Account permanent gesperrt wird. \n\nWorauf ich also hinaus will: Ich glaube nicht, dass diese 4 Spieler dafür gesorgt haben, dass du nun gesperrt bist. Ich glaube eher, anhand der Sachlage die mir hier offen liegt, das du allgemein nicht besonders nett bist, da du bereits mindestens eine andere Strafe abgesessen hast. \n\nDie Chance sich zu bessern hättest du also nutzen können und vielleicht auch sollen. \n\nMfg","replies":[{"poster":"Eroticat Nimar","date":"2020-02-25T01:44:27.154+0000","up_votes":4,"down_votes":0,"body":"Immer wieder beeindruckt davon wie viel Zeit du solchen Leuten widmest.","replies":[]},{"poster":"BlazeDeeGaming","date":"2020-02-25T10:59:37.027+0000","up_votes":1,"down_votes":1,"body":"Es gehören immer mehrere Parteien dazu sich \"zu bessern\"\n\nNatürlich gab es schon Accountstrafen bei mir die aber über JAHRE versetzt gewesen waren und Ich ticke nur aus wenn es extrem ist wie meine Mitspieler aktiv gegen mich vorgehen wie dieses Team aus Freunden das absichtlich auf mich los ist da sie vielleicht einfach nur sauer waren das Ich eine bestimmte Rolle oder ihren Erwartungen nicht gerecht wurde? Wer weiß das schonw as in den köpfen solcher Versager vor sich geht.\n\nDa Ich ja immer wieder Pausen eingelegt habe über Monate hin hab ich das auch generell gut vorgebeugt das Ich zu überreagiere und wie gesagt Ich schaffe Abends mal maximal 2 Spiele zu spielen und innerhalb der Woche höchstens 6-7 Matches....Arbeit als Pfleger lässt mir da nunmal nicht sonderlich viel Spielraum du verstehst? Nun ja dennoch danke für deine Aussage die viel text beinhaltet aber nur eines aussagt:\n\nIch bin an allem Schuld und nicht die Community, die solche Kindsköpfe wie die 4 letzen Mitstreiter hervorbrachten um hart arbeitende,emotional und lebensfreudige Menschen wie mich zur Sau machen für absolut keinen Grund. Danke vielmals dafür.\n\nMein geld hab ich jedenfalls wiederbekommen von zwei Tagen und Riot games sowie seine Werbung und Websiten werden ab heute in der Router Funktion für blockiernende Website/Dienste hinzugefügt. Ich bin endgültig durch mit diesem Assozialen Verein.\n\nSiehst du ja schon an so vielen kommentaren anderer hier wie geistesgestört die meisten mittlerweile doch sind. Entschuldige für die Ausdrucksweise aber mir kann ja nix schlimemres mehr passieren da ich ja eh gebannt wurde von so nem Saftladen der lieber die Toxic Community pflegt als da die wirklichen Schuldigen auszumerzen","replies":[{"poster":"Aymira","date":"2020-02-25T19:35:58.974+0000","up_votes":1,"down_votes":0,"body":"> Es gehören immer mehrere Parteien dazu sich \"zu bessern\"\n\nGenau, nur ob andere sich bessern liegt nicht in deiner Macht. Wenn die der Meinung sind, sie riskieren Strafen ist das deren Sache. \nWenn du deinen Account behalten willst, sollte man sich selbst fragen \"ob es mir das wert ist\". ¯\\\\\\_(ツ)_/¯ \n\n> Natürlich gab es schon Accountstrafen bei mir die aber über JAHRE versetzt gewesen waren\n\nAn dem Punkt völlig irrelevant, wie lange die Strafen her sind. Die Milderung der Strafstufen erfolgt nicht nach Zeit, sondern nach gespielten spielen. Spielst du also wenig, brauchst du länger um wieder eine Strafstufe zu sinken... \n\n> Da Ich ja immer wieder Pausen eingelegt habe über Monate hin hab ich das auch generell gut vorgebeugt das Ich zu überreagiere\n\nNur leider hat es am Ende dann trotzdem nicht gereicht. Vermutlich wäre es für dich einfach sinniger gewesen den Chat komplett auszuschalten.\n\n> Ich schaffe Abends mal maximal 2 Spiele zu spielen und innerhalb der Woche höchstens 6-7 Matches....Arbeit als Pfleger lässt mir da nunmal nicht sonderlich viel Spielraum du verstehst?\n\nKann ich nur zu gut verstehen, aber ich für mich selbst lasse mich gerade dann, wenn ich eh schon keine Zeit für Videospiele habe von einem Haufen komischer Leute so dermaßen anstacheln, dass ich das Risiko eingehe meinen Account zu verlieren. \nIch wurde in meiner gesamten Zeit in Liga der Legenden nicht einmal bestraft, ich benehme mich einfach, völlig egal wie sich die anderen verhalten. \n\n> Ich bin an allem Schuld und nicht die Community\n\nFein bemerkt, du bist an deiner eigenen Strafe schuld. Ob die anderen eine Strafe davon getragen haben, oder ob sie das eventuell das erste Mal gemacht haben und demnach nur mit Chateinschränkungen davon gekommen sind, ist eine andere Sache. \n\nFakt ist und bleibt jedoch:\nHättest du dich rausgehalten, die anderen gemeldet, dann wäre der Account noch offen. \n\n> da ich ja eh gebannt wurde von so nem Saftladen der lieber die Toxic Community pflegt als da die wirklichen Schuldigen auszumerzen\n\nLeider bist du ein Teil der \"Toxic Community\". Also hat der \"Saftladen\" nur das richtige getan... ¯\\\\\\_(ツ)_/¯","replies":[]}]}]},{"poster":"Yuiwara","date":"2020-02-25T10:08:33.454+0000","up_votes":5,"down_votes":0,"body":"> Ja dafür werde ICh dann auch noch bestraft das ICH opfer solcher Spieler werde.\n\nWenn du genauso toxisch bist, sicher. Chatlogs wurden ja \"vorsichtshalber\" auch nicht mal gepostet...also klar, du \"opfer\" bist ja sooo \"unschuldig\".\n{{sticker:sg-lulu}}","replies":[]},{"poster":"lilCvnt","date":"2020-02-25T01:40:22.454+0000","up_votes":2,"down_votes":12,"body":"Generell gebe ich dir Recht, jeder Mensch hat das Recht auf Notwehr (Notwehr umfasst auch Tat bestände, sowie Beleidigung, Übergriffe und Ehrverletzungen), dabei gelten (eigentlich) die gleichen Gesetzt Online sowie Offline, aber als du die AGB's akzeptiert hast, hast du leider, in dem Bezug kein Anspruch dein Recht in Anspruch zunehmen.\n\nAuch wenn ich dir Recht gebe, man sollte , in solchen Situation, auf Notwehr zurück greifen dürfen,dies sieht Riot leider konservativer und verlangt von uns Spieler, die andere Wange hin zu halten. Daran müssen wir uns leider halten auch wenn dies ärgerlich ist. Ich kann dir noch den Tipp geben andere Regionen zu besuchen, da EUW bekannt ist für seine Toxizität. ^^","replies":[{"poster":"Megamaexx","date":"2020-02-25T06:00:50.504+0000","up_votes":5,"down_votes":1,"body":"> Auch wenn ich dir Recht gebe, man sollte , in solchen Situation, auf Notwehr zurück greifen dürfen,dies sieht Riot leider konservativer und verlangt von uns Spieler, die andere Wange hin zu halten. \n\nWenn sich in nem Club 2 Leute prügeln, werden beide rausgeschmissen. Wenn dann festgestellt wird, dass der eine ständig daran beteiligt ist, bekommt der Hausverbot.","replies":[{"poster":"lilCvnt","date":"2020-02-25T06:39:31.711+0000","up_votes":2,"down_votes":5,"body":"In deinem Beispiel gebraucht der \"Club\" von seinem Hausrecht, ähnlich wie Riot Games bei ihrem Spiel. Was ich aber anprangere ist, dass dieses System kein faires ist. (Man stelle mal sich beispielsweise vor, dass du im Club bist, irgendein Typ macht dich dumm an, du sagst dass er dich nicht nerven soll und Zack hat man eine Faust im Gesicht kleben. Daraufhin verteidigst du dich und schubst ihn bei Seite. Die Security sieht das und ihr beide fliegt raus, obwohl du dich nur verteidigt hast. Dies bezüglich habe ich ja auch das Strafgesetzt erwähnt, was die faire Nutzung der Notwehr einführt, in der man sich eben nicht alles gefallen lassen muss und Situationsgegeben auch verteidigen darf.)","replies":[{"poster":"OT Riku","date":"2020-02-25T07:25:40.506+0000","up_votes":4,"down_votes":2,"body":"Das schubsen ist keine Verteidigung, Verteidigung wäre gewesen wenn du dem security gesagt hattest was passiert ist. \nOder du den Typen so in den griff genommen hättest das er dir/anderen nichts tun mehr tun kann.\nGenauso wie notwehr ist in LoL halt mal komplett nicht zu gebrauchen. \nEs besteht ja zu keiner den gegenüber irgentwie auszuschalten um dich oder andere zu schützen (auf kosten sriner gesundheot) \n\nDie Verteidigung die du in lol hast ist Muten und Reporten.","replies":[{"poster":"lilCvnt","date":"2020-02-25T07:43:22.353+0000","up_votes":2,"down_votes":5,"body":"* Das stimmt so nicht, man muss immer mit dem angemessensten Maß agieren, bedeutet wenn ich angemacht werde und ich der Person sage dass sie aufhören soll sie dennoch weiter macht und wiederholte Maßnahmen meinerseits umgeht und mich weiter triezt dann darf man sogar zur Gewalt greifen. Und es muss nicht immer eine psychische Gefahr herrschen alleinigen eine Beleidigung und ein Angriff auf das Ehrgefühl reicht aus um in Notwehr zu agieren. muten ist nicht immer einer Option da die Person auch einfach deine Lane Trollen kann, deshalb meine Kritik","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T07:49:56.517+0000","up_votes":5,"down_votes":1,"body":"Deine Lane kann er auch trollen, auch wenn du ihn in \"Notwehr\" beschimpfst, was er dann wahrscheinlich sogar erst recht tut. Ergo, ist Muten und Reporten die einzige Möglichkeit sich zu wehren ;)","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:01:14.940+0000","up_votes":2,"down_votes":5,"body":"Muten und Reporten hat nichts mit Wehren zutun, da es nicht aktiv auf das Verhalten des Gegenübers einwirkt. Wenn ich mich wehre dann mache ich das mit dem Hintergedanken, dass mich die Person die ich mich zu verteidigen versuche den jeweiligen Akt mir gegenüber nicht mehr ausführen kann, sei es Beleidigung, psychische Übergriffe oder ein Angriff im Ehrgefühl.\n\nDa Muten aber das Verhalten des Gegenübers nicht einschränkt und reporten sehr unzuverlässig ist, werde ich in eine Opfer- Rolle gedrängt, da mir verboten wird mich zu wehren, andernfalls drohen mir Konsequenzen.\n\nMal Abseits könnte sich ja auch Riot bemühen, Optionen für geschädigte zu entwickeln und nicht nur auf das ewige \"mute sie doch einfach\" zurück zu stufen","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:07:57.178+0000","up_votes":5,"down_votes":1,"body":"Sobald du jemanden mutest bist du kein Opfer mehr, da er dir nichts mehr anhaben kann ;)\nDavon abgesehen sollte es einem egal sein, was irgendjemand fremdes, dem du höchstwahrscheinlich nie wieder begegnen wirst, zu dir sagt.\nWas soll es dir bitte bringen, wenn du jemanden beleidigst, der dich zuerst beleidigt hast? Denkst du nicht, dass du da nur Öl ins Feuer gießt? Da ist es besser einfach muten und sich aufs eigene Spiel zu konzentrieren, denn mit Beleidigungen und Chatabuse gewinnt man keine Spiele ;)\nUnd wenn du da nicht drüber stehen kannst, dann solltest du vielleicht lieber Singleplayer Games spielen ;)\n\nWie sollen diese Optionen deiner Meinung nach aussehen?","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:10:46.249+0000","up_votes":2,"down_votes":5,"body":"Das bestärkt aber mein Argument, wenn es egal ist dann sollte man dafür nicht bestraft werden","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:18:22.750+0000","up_votes":5,"down_votes":0,"body":"Und du hast mir noch nicht meine Fragen beantwortet ;)","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:23:05.157+0000","up_votes":2,"down_votes":5,"body":"bspw einen Spieler über Vote Kicken, aber die kreative Aufgabe liegt auch bei Riot und nicht bei mir.","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:41:01.035+0000","up_votes":5,"down_votes":0,"body":"Du willst also jemanden, der im Spiel plötzlich beginnt zu trollen (was auch immer einen Grund hat, btw.), aus dem Spiel werfen können, um dann erst recht 4 vs. 5 zu spielen? Sag mal denkst du überhaupt vorher über etwas nach bevor du es schreibst bzw. abschickst?\n\nWenn du selbst nicht eine gute Lösung hast, solltest du es auch nicht von jemand anderes verlangen!","replies":[]}]}]},{"poster":"LuffySenpai91","date":"2020-02-25T08:16:55.614+0000","up_votes":4,"down_votes":0,"body":"Nö, denn so ein Verhalten ist nicht gewinnfördernd und somit hat es nichts im Spiel verloren","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:19:57.031+0000","up_votes":2,"down_votes":6,"body":"Genauso wenig wie das Verhalten des Trolls. Dennoch muss ich mir das gefallen lassen, verstehst du jetzt das Dilemma ? Geschädigte haben keine Option sich zu wehren und Riot bietet auch keine.","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:37:53.537+0000","up_votes":4,"down_votes":1,"body":"Offensichtliches Trollen wird auch bestraft, nur ist es nicht so leicht zu unterscheiden, ob jemand trollt oder einfach nur schlecht spielt. \nBei mir ist es auch schon das ein oder andere Mal vorgekommen, dass unser Support mit mir durch den Jungle gelaufen ist und versucht hat mir die Camps zu klauen, nur weil ich die Botlane nicht ganken kam, weil sie nach 5 Minuten 0/5 stand und ich versucht habe, die anderen Lanes weiter nach vor zu bringen. Ich hab es ignoriert und den Großteil dieser Spiele sogar gewonnen, weil ich einfach weiterhin versucht habe zu gewinnen ;) Nach den Games hab ich die Trolle reportet (zusätzlich mit Ticket an den Support) und die meisten von denen hatten danach eine mindestens 2-wöchige Pause (lt. OP.GG).\nFür mich ein Zeichen, dass das System funktioniert :)\nUnd man kann auch Spiele gewinnen, auch wenn man einen Troll im Team hat. Man muss es nur wollen und die restlichen Mitglieder seines Teams motivieren und sich auf sein Spiel konzentrieren ;)","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:45:32.214+0000","up_votes":1,"down_votes":4,"body":"Dass man offensichtliche Trolle bannen kann ist mir klar, aber wie oft kommt das vor dass der Troll die Mitte runter rennt ? Es kommt viel öfter vor dass der Troll \"Soft-inted\" und dies ist von dem Support nicht aufdeckbar, da es ja die \"Chance\" besteht dass der Troll ganz zufällig einen Lag hatte und in 4 man flashed. \n\nMal Abseits gibt es auch keine Rechtsklarheit innerhalb des Spieles, man weiß weder was man sagen darf, noch was man Spielen darf. beispielsweise kann man für \"out-off Meta\" Strategien gebannt werden - siehe Nubrac vs NB3\n\nDann gibt es klare Fälle wo Spieler offensichtlich die Mitte runtergelaufen sind, im Stream eines großen Streamers und nichts gegen diese Personen eingeleitet wurde\n- siehe TF Blade türkischer Server","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T10:33:48.739+0000","up_votes":4,"down_votes":0,"body":"Ja weil man auch bei Riot von einem Mindestmaß an Hausverstand und Benehmen ausgeht und wenn man dies nicht besitzt sollte man dieses Spiel nicht spielen bzw. sich nicht wundern wenn man bestraft wird ;)","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T10:57:28.679+0000","up_votes":1,"down_votes":0,"body":"Mit Einverständnis der Eltern, ja ;) Also übernehmen da auch die Eltern die Verantwortung für das Handeln ihrer Brut ;)","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T10:42:14.591+0000","up_votes":1,"down_votes":0,"body":"Sogar das Gesetz geht davon aus, dass Kinder mit 14 Jahren bereits wissen wie man sich benimmt, sonst wären sie mit 14 Jahren nicht Strafmündig.\n\nAuf diesen Punkt kann ich nicht eingehen, da ich den Stream nicht gesehen habe und den Spieler auch nicht kenne","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T10:37:09.002+0000","up_votes":1,"down_votes":0,"body":"Er skaliert mit 80% AP auf seinem Schild. Auf seinen Restlichen Fähigkeiten mit 100% AD","replies":[]},{"poster":"lilCvnt","date":"2020-02-25T10:33:13.811+0000","up_votes":1,"down_votes":0,"body":"es hat ein 1.0 Scaling somit sogar gut. Es wäre sogar machbar was ist dein Punkt ?","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T10:30:00.523+0000","up_votes":1,"down_votes":0,"body":"Lee Sin hat nur auf seinem Schild ein AP Scaling, was nur die Schildstärke beeinflusst und wenn man jetzt nur AP Items baut werden seine übrigen Fähigkeiten im Verlaufe des Spiels useless und somit wirkt es sich aktiv negativ auf das Spiel aus und ist somit nicht erlaubt ;)","replies":[]},{"poster":"lilCvnt","date":"2020-02-25T10:18:24.639+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist dass dies nirgends steht oder klar artikuliert wird. Im Summers Code wird extrem Nebelhaft erklärt wie man sich verhalten soll.","replies":[]},{"poster":"HyperionCH","date":"2020-02-25T10:15:42.638+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lilCvnt,realm=EUW,application-id=KYnfKGf0,discussion-id=ELX3voot,comment-id=00010000000100000000000000000000000000000000000000000004,timestamp=2020-02-25T09:46:32.749+0000)\n>\n> Nach diesen Richtlinien könnte ich mit meinen 4 Premades ein Random dazu zwingen AP Lee Sinn zu spielen, weil das die \"Strategie ist die das Team möchte\" merkst du was das für ein Unsinn ist ...\n\nDer Grundsatz zählt natürlich immer noch, dass:\n\na) man niemanden zu einem konkreten Pick zwingen darf und kann und\nb) Strategien auch zielführend sein müssen (also zum Sieg führen sollen)\n\nEin Team (muss nicht einmal Premades sein) kann dem Jungler als Last Pick z.B. vorschlagen, einen AP-Champ zu picken, weil es sinnvoll ist (z.B. weil Top/Mid/ADC bereits alle AD sind).\n\nDaran muss ich aber kein Jungler richten. Wenn er keinen AD-Jungler kann, dann geht auch ein AP-Champ oder ein Tank.\nDenn für die Siegeschancen ist es nun einmal besser, wenn er einen Champ pickt, den er kann als irgendetwas First Time.\n\nSomit kann ein 4er Premade dem Jungler auch nicht zu einem AD-Lee Sin zwingen; obwohl dies kein Troll-Pick ist.","replies":[]},{"poster":"lilCvnt","date":"2020-02-25T10:12:04.972+0000","up_votes":1,"down_votes":0,"body":"Man weiß nicht ab wann es ein Trollpick ist und ab wann es Out of Meta pick ist. Es gibt keine Grenze es ist nicht Klar. Nirgends ist eine Definition gegeben was als Trollpick durchgeht und was nicht ….","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T10:07:43.066+0000","up_votes":1,"down_votes":0,"body":"AP Lee Sin ist auch keine Strategie, sondern ein Trollpick und wenn er dafür reported wird, wird er auch bestraft dafür.\nNehmen wir mal an ihr als 4er Premades schafft es einen Random zu zwingen diesen Trollpick zu spielen (was ich mal ganz stark bezweifle), werdet ihr als Premades diesen Spieler nach dem Game garantiert reporten und somit wird er auch bestraft. -> Also, nein, ist kein Unsinn ;)","replies":[]}]}]}]}]}]}]},{"poster":"BlazeDeeGaming","date":"2020-02-25T11:03:04.585+0000","up_votes":1,"down_votes":3,"body":"Die Leute zu muten führt auch zu Accountstrafen....leider\nDie LEute können dich immernoch melden für Kommunikationsverweigerung und das resultiert auch irgednwann in Accountstrafen, so wie es mal bei mir der Fall gewesen ist aber hey, Riot Games verzichtet halt gern auf Veteranen die das Game Spielen als es noch GOA published hatte....","replies":[{"poster":"Sirrkas","date":"2020-02-25T12:32:52.600+0000","up_votes":3,"down_votes":0,"body":">Die Leute zu muten führt auch zu Accountstrafen....leider\n\nDiese Aussage ist sehr falsch.\n\n>Die LEute können dich immernoch melden für Kommunikationsverweigerung und das resultiert auch irgednwann in Accountstrafen, \n\nDu wurdest unter Garantie noch nie für Kommunikationsverweigerung bestraft. Es macht auch wenig Sinn Leute zu bestrafen, wenn sie die Option haben, den kompletten Chat stumm zu schalten und sogar Pings zu deaktivieren. \n\nAber du kannst gerne einen Beleg dafür bringen, dass du für Kommunikationsverweigerung bestraft wurdest. Das wäre sehr interessant zu sehen.","replies":[]},{"poster":"Ráyleigh","date":"2020-02-25T11:04:35.468+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BlazeDeeGaming,realm=EUW,application-id=KYnfKGf0,discussion-id=ELX3voot,comment-id=00010000000100000000000000000001,timestamp=2020-02-25T11:03:04.585+0000)\n>\n> Die Leute zu muten führt auch zu Accountstrafen....leider\n\nÄm nein^^\nMuten ist Okay.\n\nSich zu weigern als Team zu spielen ist nicht okay.","replies":[]}]}]},{"poster":"lilCvnt","date":"2020-02-25T08:09:23.536+0000","up_votes":2,"down_votes":4,"body":"Außerdem wenn es denn so egal ist, warum erlaubt man es dann nicht einfach ? Der Spieler der getrollt wird kann sein Dampf ablasen und ist weniger geneigt passiv aggressiv das Spiel weiter zu spielen und im schlimmsten Fall seine Aggression in ein darauffolgendes Spiel weiter zu tragen.","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:15:00.664+0000","up_votes":5,"down_votes":1,"body":"Weil sich so ein Verhalten einfach nicht gehört! Da spielt es keine Rolle wer angefangen hat!\n\nWas redest du da bitte für einen Schwachsinn? Dampf ablassen kannst du indem du deinen Bildschirm anschreist, oder du machst nach dem Game eine Pause und gehst kurz raus an die frische Luft. Einfach Beleidigungen in den Chat schreiben bringt da gar nichts, außer dass noch mehr Beleidigungen zurückkommen, die du dann wiederum mit Beleidigungen und Diskussionen konterst. Da kannst du dann gleich AFK in der Base stehen bleiben, wenn du die ganze Zeit nur am Schreiben bist, anstatt zu spielen.","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:30:42.492+0000","up_votes":1,"down_votes":5,"body":"Im (STRAFGESETZ-BUCH) ist diese Option inbegriffen, inwiefern nimmst du dir nun das Recht raus allen anderen zu sagen, dass jeweiliges Recht \"Schwachsinn\" ist.\n\nWenn sich Leute in ihrer Ehre gekränkt fühlen sollen sie das Recht besitzen jeweilige Ehre zu beschützen und es ist egal ob du der Meinung bist (\"Ach das ist doch nur ein Spiel, als ob man da sich in der Ehre gekränkt fühlen kann\"). Es gibt nun mal Leute die es sehr wohl tun und die haben auch einen Schutz verdient und wenn Riot keinen anderen bietet als zurück zu schimpfen dann sind nicht die Spieler daran Schuld sondern Riot","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T08:45:37.660+0000","up_votes":4,"down_votes":1,"body":">  inwiefern nimmst du dir nun das Recht raus allen anderen zu sagen, dass jeweiliges Recht \"Schwachsinn\" ist.\n\nWeil im Strafgesetzbuch garantiert nicht steht, dass man seinen Dampf auf kosten anderer auslassen darf ;)\nDavon abgesehen wird es der Justiz ziemlich egal sein, ob du jemanden als Hurensohn oder dergleichen bezeichnest, aber Riot ist es nicht egal, deshalb wirst du auch bestraft, wenn du im Chat beleidigend wirst ;)\n\nWenn du jemanden beleidigst nur weil er dich beleidigt, dann verteidigst du nicht deine Ehre, sondern du besitzt dann keine Ehre, denn du begibst dich auf das niedrige Niveau herab, das dein Gegenüber besitzt ;)","replies":[{"poster":"lilCvnt","date":"2020-02-25T08:53:01.002+0000","up_votes":1,"down_votes":3,"body":"… Ich habe dir bereits zichmal erklärt wie der Gesetzesparagraph zu interpretieren ist und bin es langsam leid mich zu wiederholen. \n\n\"Wenn du jemanden beleidigst nur weil er dich beleidigt, dann verteidigst du nicht deine Ehre, sondern du besitzt dann keine Ehre, denn du begibst dich auf das niedrige Niveau herab, das dein Gegenüber besitzt ;)\" Strohmann-Argument ...  Habe ich nie behauptet ...","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T09:00:56.222+0000","up_votes":4,"down_votes":1,"body":"Du bist also Jurist und hast die Kompetenz einen Gesetzesparagraphen zu interpretieren? Nice :) Wenn ich mal juristischen Rat brauche, dann wende ich mich an dich ;)\n\nAchso, hast du nicht?\n> Wenn sich Leute in ihrer Ehre gekränkt fühlen sollen sie das Recht besitzen jeweilige Ehre zu beschützen...\nEs gibt nun mal Leute die es sehr wohl tun und die haben auch einen Schutz verdient und wenn Riot keinen anderen bietet als zurück zu schimpfen dann sind nicht die Spieler daran Schuld sondern Riot\n\nAus diesem Kontext lese ich heraus, dass du der Meinung bist, dass man durch Beleidigungen seine Ehre schützen dürfen sollte ^^","replies":[{"poster":"lilCvnt","date":"2020-02-25T09:10:28.669+0000","up_votes":1,"down_votes":6,"body":"\"Eine Beleidigung stellt hierbei einen Angriff auf die persönliche Ehre dar. Problematisch ist jedoch, dass für die Notwehr auch die Gegenwärtigkeit dieses Angriffs erforderlich ist. Ist eine einzelne Beleidigung einmal ausgesprochen, ist der Angriff bereits abgeschlossen und somit nicht mehr gegenwärtig. Hierbei wäre es nicht mehr durch Notwehr gerechtfertigt, sich gegen diese Beleidigung zu wehren. Ist es jedoch ein Schwall von Beleidigungen und hört dieser innerhalb von einer oder zwei Minuten nicht auf, darf man sich gegen diese Beleidigungen wehren; und das notfalls auch mit Gewalt. Natürlich ist darauf zu achten, dass eine Gewaltanwendung angemessen sein muss und beendet werden muss, sobald der Angreifer mit den Beleidigungen aufhört.\"\n\nDu kannst dich doch auf einfach selbst belesen ^^","replies":[{"poster":"HyperionCH","date":"2020-02-25T09:30:50.440+0000","up_votes":4,"down_votes":0,"body":"Ich weiss nicht wie es in Deutschland ist, aber bei Beleidigungen ist es in der Schweiz niemals angemessen, auf Beleidigungen mit Gewalt \"als Notwehr\" zu reagieren.\n\nIm Fall von LoL:\nWenn Beleidigungen nicht mehr zumutbar ist, kann man sich kurzfristig mit muten angemessen wehren und nach dem Game mit einem Report.\n\nSelber mit Flame zu reagieren (und sogar Gewalt anzudrohen -> durchführen wird schwer online^^), ist aber in der Schweiz nicht angemessen.\nEs würde mich wundern, wenn dies in Deutschland vom Gesetzgeber als angemessen gesehen wird. Hier bitte entsprechende Gesetzesartikel, Verordnungen oder Gerichtsentscheide nennen (so wie man eigentlich üblicherweise als Jurist antworten würde).","replies":[]},{"poster":"Ráyleigh","date":"2020-02-25T10:37:46.494+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=lilCvnt,realm=EUW,application-id=KYnfKGf0,discussion-id=ELX3voot,comment-id=0001000000010000000000000001000000000000000000000001000b,timestamp=2020-02-25T10:26:36.604+0000)\n>\n> Angemessenheit ist Kontext bezogen. Man kann nicht einfach allgemein sagen, ja das und das gilt nicht … wie du siehst ist das nicht mal so in unserem Gesetz dort ist auch alles erlaubt bis hin zur Gewalt ... Es beläuft sich auf den Kontext\n\nDas stimmt einfach nicht!\nUnd das haben dir die Leute hier auch immer wieder erklärt und aufgezeigt.\n\nDu solltest dich eventuell einfach mal mit einem Anwalt zusammen setzen und dich über unsere Gesetze aufklären lassen.\nIch glaube, das wäre für dich eine große Hilfe.\n\nAlles andere macht wohl keinen Sinn, da so sehr von deiner eigenen Meinung überzeugt bist das du alle Gegenargumente und Fakten nicht wahrnimmst.","replies":[]},{"poster":"HyperionCH","date":"2020-02-25T09:59:57.193+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=lilCvnt,realm=EUW,application-id=KYnfKGf0,discussion-id=ELX3voot,comment-id=00010000000100000000000000010000000000000000000000010001,timestamp=2020-02-25T09:33:34.652+0000)\n>\n> Der Paragraph heißt Notwehr …\n> Paragraph 32 StGB - Notwehr\n\nDa steht:\n\n> (1) Wer eine Tat begeht, die durch Notwehr geboten ist, handelt nicht rechtswidrig.\n>\n> (2) Notwehr ist die Verteidigung, die erforderlich ist, um einen gegenwärtigen rechtswidrigen Angriff von sich oder einem anderen abzuwenden.\n\nEs ist aus meiner Sicht nicht als Verteidigung erforderlich, bei Flaming zurück zu flamen (oder sogar mit Gewalt zu drohen oder zu antworten).\nEs gibt die Mute-Funktion und die Report-Funktion nach dem Spiel. Dies ist als Verteidigung völlig ausreichend.\n\nDu musst schon zumindest eine Verordnung oder ein Gerichtsentscheid liefern, die aussagen, dass mehr erlaubt ist.\n(Gilt auch im RL: ich bezweifle, dass Gewaltanwendung bei Beleidigungen als \"erforderliche Verteidigung\" angesehen wird).","replies":[]},{"poster":"lilCvnt","date":"2020-02-25T10:14:18.188+0000","up_votes":1,"down_votes":0,"body":"https://www.rechtsanwaelte-hannover.eu/2014/10/27/was-ist-eigentlich-durch-notwehr-gerechtfertigt/","replies":[]}]},{"poster":"lilCvnt","date":"2020-02-25T09:05:19.646+0000","up_votes":1,"down_votes":4,"body":"Guck deshalb ist es so schwer mit dir zu reden. Ich habe oben erwähnt, dass man das angemessenste Maß nutzen soll, bedeutet wenn jemand trollt, soll man ihn erst mahnen, dann soll man das nächst höherer Maß ergreifen was angemessen ist zum Beispiel ihn warnen dass man ihn reportet etc .pp es soll dem Verhalten angemessen sein. Bitte lese dir meine Text genau durch und dann schreib ...","replies":[{"poster":"LuffySenpai91","date":"2020-02-25T09:49:59.006+0000","up_votes":3,"down_votes":0,"body":"Ach und ich muss dir nichts vorkauen, nur weil du nicht einsehen willst, dass du in manchen Punkten nicht ganz richtig liegst?","replies":[]},{"poster":"LuffySenpai91","date":"2020-02-25T09:21:16.029+0000","up_votes":2,"down_votes":1,"body":"Nur blöd, dass es hierbei ums Beleidigen ging und nicht ums trollen ;) Du solltest lieber selbst das Geschriebene genauer durchlesen ;)\n\nUnd wenn jemand trollt, verletzt er dich nicht in deiner Ehre, also ist es auch nicht gerechtfertigt, dass du dich dagegen mit Beleidigungen wehrst ;)","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}