{"poster":"NewJera","date":"2019-12-18T21:22:56.311+0000","title":"Alguien que me Quiera suportear?","subforum":"Reclutamiento","up_votes":4,"down_votes":1,"body":"Oro +, Imposible jugar de adc, te quitan las ganas de existir los toxicos, soportes q te sacan veigar y te roban hasta las migas del pan del desayuno, Q Triste q es esto \r\n\r\n_**Moraleja,: No juegues adc **_","replies":[{"poster":"I am Nefay","date":"2019-12-18T23:10:29.559+0000","up_votes":2,"down_votes":1,"body":"yo soy main supp , lo peor del mundo es cuando los enemigos erran las skills y me tiro a pelear y el adc se queda farmeando porque dice \" preciso el farm\"  , los adc no entienden nada y se piensan que hay que hacer lo que ellos quieren cuando en realidad ellos tienen que hacer lo que el soporte dice porque el soporte es el que esta viendo el mapa y lo que hacen los enemigos y el adc esta viendo el farm y no mucho mas","replies":[{"poster":"HitmannKiller","date":"2019-12-19T00:02:26.988+0000","up_votes":1,"down_votes":0,"body":"tampoco es así, no siempre el adc tiene que seguir al sup y viceversa, se me hace que sos alto flammer, primero y principal es una linea de a 2 y eso siempre tiene problemas ya que aveces no se entienden mutuamente y termina pasando lo que tu dices, eso no quiere decir que vos o el adc tengan razón pueden tenerla ambos, o no. no siempre sale todo perfecto. todo depende del estilo y adaptarse también ej eres un sup que juegas agro y el adc que te toca le gusta ser paciente y jugar a late, tenes que adaptarte y jugar paciente o al revés. Aveces ni siquiera es necesario jugar agresivo si todo tu equipo va bien lo mejor es jugar pasivo. \nEso que pones \" en realidad ellos tienen que hacer lo que el soporte dice porque el soporte es el que esta viendo el mapa y lo que hacen los enemigos y el adc esta viendo el farm y no mucho mas\"  si bien tiene algo de sentido, no siempre es asi, eso es solo si usas un campeon de engage, si usas un healer no, pero el adc tiene la eleccion de elegir si te sigue o no, ej si juego adc no me gusta como juega el sup por que lo veo muy riesgoso lo dejo morir, esa elección no es trolear, aunque se enoje y flamme se valla de linea, etc. \n \"lo peor del mundo es cuando los enemigos erran las skills y me tiro a pelear y el adc se queda farmeando porque dice \" preciso el farm\". si tenes una oleada en torre es preferible la oleada a la kill, es discutible, en algunos casos específicos. \ncon esto no te digo que tu opinión esta mal, pero si hay que entender que hay que adaptarse también y no ser tan egocéntrico para creer que tu tienes la razón. \nEl mayor problema del adc es que es totalmente dependiente del sup en la face de lineas, pero el sup no depende del adc, pierdes linea el sup siempre puede rotar, sacar ventaja en otro lado, el adc no puede. el sup se enoja se va de linea a ayudar a los demás y el adc se tiene que qdar super por detrás no pude farmear lo matan, etc, y esto termina en todo el equipo flameando al adc. Esto que te digo lo hago aveces me voy y lo dejo, pero tienes que entender la perspectiva del adc, tenes q saber que si lo dejas después no esperes nada de el, toda decisión tiene una consecuencia. \n\"el adc esta viendo el farm y no mucho mas\". que crees que solo el soporte mira el mapa?.","replies":[{"poster":"I am Nefay","date":"2019-12-19T00:09:27.926+0000","up_votes":1,"down_votes":1,"body":"siempre tengo razon porque se de lo que hablo , si no se de que hablo no digo nada . pero la gente si piensa que tiene razon sin saber nada de nada","replies":[{"poster":"HitmannKiller","date":"2019-12-19T00:31:37.405+0000","up_votes":1,"down_votes":0,"body":"Mira que me encanta discutir, pero simplemente no comprendo a lo que quieres llegar, asi que aqui me despido tu ganas. Saludos y suerte.","replies":[]}]}]}]},{"poster":"andrespellss","date":"2019-12-19T00:32:59.125+0000","up_votes":1,"down_votes":0,"body":"agregame nick: pellss estoy a punto de promo a platino gogogo","replies":[]},{"poster":"GankForPack","date":"2019-12-19T00:31:21.876+0000","up_votes":1,"down_votes":0,"body":"A mí siempre me tocan los adc pacifistas que no le pegan un auto ni al cannon a 1hp :(","replies":[]},{"poster":"Not a Peruvian","date":"2019-12-18T23:36:38.262+0000","up_votes":1,"down_votes":0,"body":"Adc es la posición que más odio, más que nada porque no me gusta jugar tiradores y porque por lo general me tocaban soportes malos (nótese que fue en niveles bajos, cuando apenas empezaba a jugar por lo que es entendible). Pero fue tanto lo que me molestó que empecé a mainear soporte para que (por lo menos cuando juego yo) a mi adc le toque un soporte decente (o al menos intentarlo).","replies":[]},{"poster":"HitmannKiller","date":"2019-12-18T22:22:17.850+0000","up_votes":1,"down_votes":0,"body":"yo te dije que me agregues y no lo hiciste xD, soy sup, aunque en esta cuenta estuve probando de adc y subi a platino, eso te va a pasar siempre lo de los picks ap lo del farm bueno, ya eso es trolear y mas ahora que ni rinde farmear de sup ni oro dan los minions xD,","replies":[]},{"poster":"RikiFsn","date":"2019-12-18T21:52:07.216+0000","up_votes":1,"down_votes":1,"body":"JJAJAJA same, juego adc y es lo peor del mundo mientras carreas de chill tanto de top como de support o mid el adc tiene que lidiar con support que roban farm se suicidan te trollean etc xD, agregame y luego te supporteo que es mi segundo rol","replies":[]}]}