{"poster":"NsCzdr","date":"2017-10-15T20:42:14.963+0000","title":"Pierdo una partida y la siguente es peor","subforum":"Guias y consejos","up_votes":5,"down_votes":2,"body":"Que te hice Riot?\r\nPierdo una partida con un mal equipo y en la siguiente, el equipo es aun peor.\r\nDe Platino 5 a Oro 5 y la cosa sigue empeorando.\r\nNo es que Oro 5 sea mi nivel, sino que stompean a mi equipo y no puedo hacer nada.\r\nEs lo mas dificil que me toco pasar en este juego, gente que al minuto 10 ya van 2-7 y con este meta de ADC con Supports, me es imposible carrear a tanto desgraciado sin cerebro.\r\nQue tengo que hacer?\r\nEstaba feliz en Platino y de la noche a la ma&ntilde;ana Riot decidio emparejarme con Platas.\r\nTengo el MMR con 1000 puntos menos de los que empece la temporada.\r\nSera porque no le compre skins a Riot este a&ntilde;o?\r\nAlgo hice para que me sigan tocando gente sin 2 dedos de frente para jugar.\r\nSi alguien tiene una cuenta en BR para hacer DuoQ, pues Bienvenido sera.","replies":[{"poster":"x THE XENEIZE x","date":"2017-10-16T23:27:09.930+0000","up_votes":1,"down_votes":0,"body":"me paso lo mismo estoy en oro camino a platino... bvueno hoy me toco la rendición de ese camino, pase de oro 4 a oro 3, baje subi baje subi afks trolls mancos, no digo q yo sea un carreador q todas las partidas juego bien, pero no ando fedeando como loco si me va mal como muchos q no van ni 15min y van 1/7, que lloran culpan a los demás insultan y se va la partida al carajo... se me volvió imposible subir y ya no jugare mas Rank por un buen tiempo porque la verdad que termino amargándome y sacando el objetivo del juego que es divertirse y lo peor es que el juego se crashea ya me paso como 4 veces no te deja entrar vas al internet a otro juego y anda todo bien, pero claro riot dice que no te anda bien el internet y no puedes conectar, tiran  remake y ahí se van tus puntos... no se como esperan q suban de división con todo esto","replies":[]},{"poster":"JPablo01","date":"2017-10-15T22:37:09.830+0000","up_votes":1,"down_votes":0,"body":"Se llama tilt, y no es broma; cuando pierdo se que debo esperar al dia sgte porque se que la sgte voy a perderla y me voy a tiltear","replies":[{"poster":"NsCzdr","date":"2017-10-15T23:37:28.956+0000","up_votes":1,"down_votes":0,"body":"Si jugara mal seria tilt, pero no.\nNo puedes carrear a un tipo que muere 5 veces en 4m","replies":[]}]}]}