{"poster":"Deaeras","date":"2016-02-21T16:23:11.672+0000","title":"To those who say Jhin is a shit champ.","subforum":"Gameplay","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/f57529d913783c40df6ba2cb878f29fb","image":"https://i.gyazo.com/thumb/1200/_47f570c04b56487931be0cedf9f52c27-png.jpg"},"up_votes":1,"down_votes":2,"body":"I disagree.\r\n\r\nhttps://gyazo.com/9217b0e1ec38ce157a816787a6f12a2f","replies":[{"poster":"Droogzy","date":"2016-02-21T16:45:06.415+0000","up_votes":3,"down_votes":0,"body":"Judging from the fact that the highest damage output on the opposing team was a fricking Zac, this really doesn't tell me anything other than the team you played against was probably terrible.\n\nEven if the Zac was going full AP, he shouldn't be out damaging an Annie or Miss Fortune.\n\nThat and this is just one game. I just finished a game of Sion where I went 7-0-13, does that means he's in a good place? Heck no, dude still needs buffs. \n\nJhin has potential, but you're really not helping his case with this graph. Look at the overall graph data of Jhin, you'll notice his average damage output is around 25k really, which is not great in the slightest.\n\nI just noticed, the game in question lasted 45 minutes long.\n\n50k damage in 45 minutes? Thats literally nothing to tout as being strong for an ADC.","replies":[]},{"poster":"LatetotheRace","date":"2016-02-21T19:53:25.296+0000","up_votes":1,"down_votes":0,"body":"Yea jhin is a situational pick. He's both good and terrible. He relies on his support and team in early and late game respectively, he's just not much of a carry unlike the rest of the good marksmen atm.","replies":[]},{"poster":"Its All Skillzz","date":"2016-02-21T16:52:59.508+0000","up_votes":1,"down_votes":0,"body":"ive done 120k damage as ap ezreal. 50k is nothing special lol.","replies":[]},{"poster":"Narsicus","date":"2016-02-21T16:44:14.530+0000","up_votes":1,"down_votes":0,"body":"Wow, look at Jhin go. He certainly scored way higher than everyone else on this nameless metric.","replies":[]},{"poster":"lolipopevelynn","date":"2016-02-21T16:24:58.497+0000","up_votes":1,"down_votes":0,"body":"ive done triple that damage as kog and double that dmg as blue ez and nerfed graves.\n\nya he is shit.","replies":[{"poster":"Deaeras","date":"2016-02-21T16:34:16.649+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChristmasEvelynn,realm=NA,application-id=3ErqAdtq,discussion-id=pl4xAPMi,comment-id=0000,timestamp=2016-02-21T16:24:58.497+0000)\n>\n> ive done triple that damage as kog and double that dmg as blue ez and nerfed graves.\n> \n> ya he is shit.\n\nthats actually impossible, there is a 0% chance you did 150k dmg as anyone, and 100k as blue ez, even in a 60 min game.","replies":[{"poster":"Jorencice","date":"2016-02-21T16:43:57.546+0000","up_votes":1,"down_votes":0,"body":"I've played with a blue ez that dealt 124k damage in 43 minutes.\n\nCourse he's a challenger and we were playing normals but still. It IS possible.","replies":[]}]}]},{"poster":"Randomonium","date":"2016-02-21T16:40:53.055+0000","up_votes":1,"down_votes":0,"body":"http://champion.gg/champion/Jhin/ADC\n\nI think this is a much better judge of how good Jihn is rather than a single, random game.  His damage is middle of the pack and his win rate is one of the worst in the game.","replies":[]},{"poster":"Siyther","date":"2016-02-21T16:38:15.425+0000","up_votes":1,"down_votes":0,"body":"i always play will with jihn  i dont do that much dps though as i tend to play him as a more utility sytle adc and it works very very well. sure i get like  kills but like 15 or more assists lol. But i have yet to lose a game with him","replies":[]},{"poster":"FrankerX","date":"2016-02-21T16:36:39.386+0000","up_votes":1,"down_votes":0,"body":"did 67k with ad kog in a 34 min game. yup enemys were stupid they thought focusing tank is good idea. \n\nnot saying jhin is shit, i think his q and 4. aa and ult do some serious dmg, but his reloading takes way too long.","replies":[]},{"poster":"OhtheShinx","date":"2016-02-21T16:28:11.619+0000","up_votes":1,"down_votes":0,"body":"Man i can not believe that the image taken list can be that high.\nNice job jhin!","replies":[]},{"poster":"Jbels","date":"2016-02-21T16:55:20.668+0000","up_votes":1,"down_votes":1,"body":"Holy shit! Now show us how much of that was to champions!","replies":[]}]}