{"poster":"Spyke2G","date":"2015-05-22T18:05:27.954+0000","title":"MODIFICHE AGLI INCANTESIMI DELL'EVOCATORE - Analisi di un analista","subforum":"Campioni e gameplay","up_votes":6,"down_votes":3,"body":"Ciao community italiana, sono un analista di League Of Legends che studia (e gioca) fin dai tempi pi&ugrave; remoti della stagione 1.\r\nSono qui per proporre il problema riguardante la diversit&agrave; degli incantesimi dell&#039;evocatore.\r\nPrima che io inizi, sarei grato se nei commenti di sotto scriviate la vostra sincera opinione anche se negativa in modo tale da correggere il tiro e magari riproporre al mio team di ricerca eventuali soluzioni possibilmente migliori.\r\nIn aggiunta chiedo a tutti il massimo rispetto per il mio lavoro e quindi tutti coloro che non sono interessati o non sono esperti nel settore non commentino o down-votino questo post.\r\nIl post &egrave; gi&agrave; stato proposto nelle altre community con numerosi feedback.\r\n\r\n=== FASE 1 === ANALISI DELLA SITUAZIONE GENERALE ===\r\nTutte le SS (summoner spells) sono giocate a livello competitivo fatta eccezione per chiarezza e chiaroveggenza.\r\nIl perch&egrave; questi incantesimi siano inutilizzati sono:\r\n{{summoner:13}} : Da come &egrave; strutturato il mana in LoL questo incantesimo &egrave; superfluo e in aggiunta non fornisce statistiche di combattimento. \r\n{{summoner:2}} : Con l&#039;aggiunta del trincket blu, questo incantesimo &egrave; morto del tutto. Non esiste una vera ragione per cui un evocatore dovrebbe prendere chiaroveggenza perch&egrave; l&#039;incantesimo in se &egrave; forte (raggio globale+cooldown basso+ampia aria a lunga durata), ma pare che questa utility sia quasi obsoleta a confronto degli altri incantesimi.\r\nOltre al problema di questi due incantesimi obsoleti c&#039;&egrave; la questione &quot;Flash&quot;:\r\n{{summoner:4}}  &egrave; la summoner spell pi&ugrave; forte del gioco in quanto &egrave; unica e versatile e consente di creare forti combinazione con le abilit&agrave; dei campioni.\r\nA causa di questa utilit&agrave; cos&igrave; alta, nessun campione (con poche eccezioni) pu&ograve; rinunciare a Flash e cos&igrave; si limita la scelta delle SS ad 1 (nella maggior parte dei casi).\r\nDetto questo, Flash non &egrave; un incantesimo over power o broken e non c&#039;&egrave; motivo di depotenziarlo, ci&ograve; che bisogna fare &egrave; potenziare gli altri incantesimi simili dando una scelta all&#039;evocatore in base alla situazione e al suo stile di gioco.\r\n\r\n=== FASE 2 === DISCUSSIONI EMERSE DALLE ALTRE COMMUNITY ===\r\nProponendo un post simile alle community di altre lingue e raccogliendo i feedback, ci siamo resi conto di cosa quegli utenti volessero davvero e abbiamo cos&igrave; adattato i cambiamenti (che trascriver&ograve; tra poco) alle idee pi&ugrave; brillanti di quegli utenti.\r\nInizialmente credevamo che abbassare i tempi di ricarica di alcuni incantesimi sarebbe stata la soluzione, ma ci sbagliavamo. Per quanto alcuni incantesimi richiedono una minore ricarica, abbiamo deciso di dare un &quot;lusso&quot; hai campione che non hanno scatti,balzi,teletrasporti o forti modificatori della velocit&agrave; movimento. \r\nIn aggiunta proporremo alcuni incantesimi degli evocatori nuovi. L&#039;obiettivo &egrave; ampliare la scelta per ruolo e rimuovere il pensiero comune di &quot;Il toplaner ha bisogno di Teleport, il jungler di smite&quot; ecc...\r\nQui di seguito il link all&#039;ultimo post inglese: [](http://boards.euw.leagueoflegends.com/en/c/champions-gameplay-en/1NhnWhjR-summoner-spells-more-diversity-is-needed)\r\nN.B.: In questo post ci saranno numerosi cambiamenti rispetto a quel post.\r\n\r\n=== FASE 3 === CAMBIAMENTI ===\r\nFine delle premesse. Ora si passa ai cambiamenti. Partir&ograve; dagli incantesimi presenti nel gioco per poi passare ad eventuali proposte discutendo su ogni incantesimo (parte in corsivo).\r\n\r\n{{summoner:4}} : L&#039;effetto va bene ma per **i campioni che non hanno nessun tipo di mobilit&agrave; (gi&agrave; elencati i criteri) il cooldown di flash &egrave; di 240 secondi.**\r\n_Sembra una contraddizione rispetto al discorso fatto prima, ma finch&egrave; flash esiste nel gioco sarebbe dignitoso dare ai campioni immobili l&#039;oppurtunit&agrave; di reagire pi&ugrave; frequentemente alle combo nemiche. Fate presente che &egrave; una riduzione minima (solo 1 minuto) che per&ograve; nel contesto di un team fight potrebbe essere rilevante._\r\n\r\n{{summoner:6}} : Bonus velocit&agrave; movimento  27%, potenziato con di strosione 40% , **in pi&ugrave; dona il 50% di resistenza ai rallentamenti. Per il primo secondo la velocit&agrave; movimento &egrave; doppia. L&#039;efficacia di ghost &egrave; aumentata del 2% (max +24%)  ogni volta che il tuo campione attacca un campione nemico (con un attacco base o un incantesimo) che ha 25 (+5 x lv) armatura o resistenza magica in pi&ugrave; al propio campione (in base se il danno inflitto &egrave; magico o fisico). **\r\n_Con gli adeguati calcoli potrete notare che ghost donava un bonus movement speed medio di 89. Questo valore &egrave; molto basso se si pensa che pu&ograve; essere facilmente ridotto dai rallentamenti. Vorremmo rendere ghost un incantesimo che consente di kitare e marcare il lato &quot;sfuggente&quot; dell&#039;incantesimo. Questo cambiamento dovrebbe rendere ghost un incantesimo possibile anche sugli adc e alcuni ap mid che avrebbero cos&igrave; qualche chance in pi&ugrave; di giocare sulla schivata rendendo cos&igrave; per quei pochi secondi la vita difficile ai tank (che nel meta di adesso e nel futuro sono un problema). Anche i jungler che non costruiscono molta armatura e resistenza magica potrebbero usare ghost per scambiare i loro stat difensivi con uno stile pi&ugrave; aggressivo. _\r\n\r\n{{summoner:12}} : **Cooldown aumentato a 380s (300 se usato sulle torri o 200 se cancellato) **[Cooldown live 300s o 200s su torri o se annullato]. In aggiunta **se il campione che ha usato tp prende un uccisione o un assist entro i 20s dopo che ha usato tp, il cooldown di tp &egrave; ridotto del 25% (non comulabile).**\r\n_Questo cambiamento punisce il cattivo uso di tp, gli errori in caso di un fail e scoraggia il solo uso di tp per farmare le ondate di minion. _\r\n\r\n{{summoner:7}} : va bene cos&igrave; come &egrave;.\r\n{{summoner:21}} : **Cooldown ridotto a 180s** (Cooldown live 210s). In pi&ugrave; **Barriera conferisce il 10% di riduzione danni e il 15% di tenacia per i prossimi 5s**.\r\n_L&#039;obiettivo qui &egrave; enfatizzare la caratteristica offensiva di questo incantesimo e dare una motivo valido ed evidente per scegliere barriera anzich&egrave; guarigione. Secondo l&#039;analisi, guarigione &egrave; pi&ugrave; forte di barriera perch&egrave; ha una valuta complessiva di 690 che in aggiunta dona velocit&agrave; movimento, con questi cambiamenti invece, barriera &egrave; indiscutibilmente pi&ugrave; forte di guarigione per un buff personale. Inoltre barriera ha molto pi&ugrave; counterplay di guarigione a causa della durata, ed &egrave; per questo che abbiamo lievemente ridotto la ricarica._\r\n\r\n{{summoner:1}} : **Cooldown ridotto a 120s** (Cooldown live 180s). ~~Conferisce il 65% di riduzione degli effetti di controllo per 3s ~~ **Conferisce il 70% di riduzione degli effetti di controllo che decade rapidamente in 5s (70/50/35/25/20%).**\r\n_Per alcuni potrebbe sembrare un potenziamento non necessario. La verit&agrave; &egrave; che l&#039;eroe che usa purificazione &egrave; soggetto a molti effetti di controllo in particolare durante un teamfight e sopratutto molto spesso e non ogni 3 minuti. Purificazione &egrave; giocato contro team-comp con tantissimi effetti di controllo e su campioni con poche possibilit&agrave; di evitarli. Ridurne la ricarica di 1 minuto dovrebbe aiutare questa classe di campioni che durante questi anni &egrave; rimasta un p&ograve; nel buio. _\r\n\r\n{{summoner:3}} : probabilmente &egrave; la SS pi&ugrave; bilanciata del gioco.\r\n{{summoner:14}} : A causa del buff a purificazione, la** ricarica di ustione &egrave; ridotta da 210 a 200.**\r\n_Dando cos&igrave; poco tempo di ricarica ai counter degli incantesimi dell&#039;evocatore, ridurre lievemente la ricarica di ignite non &egrave; pi&ugrave; un problema. Se sarete spaventati di ustione, prenderete sicuramente purificazione._\r\n\r\n{{summoner:2}} :~~ Da visione di una zona nella mappa per 5s.~~ **Da visione di tutta la mappa per 5s e dona visione vera di un punto della mappa per 3s**.\r\n_Se vi sembra MOLTO forte, allora abbiamo raggiunto l&#039;obiettivo. Chiaroveggenza dovrebbe essere l&#039;incantesimo con pi&ugrave; utilit&agrave; del gioco e con l&#039;introduzione del trincket blue &egrave; purtroppo diventata ancora meno giocata e sinceramente &egrave; un peccato. Un evocatore che prende chiaroveggenza dovr&agrave; per&ograve; rinunciare ad incantesimi offensivi come ustione o sfinimento e quindi per quanto quest&#039;incantesimo sia molto forte, non ha poteri nei contesti di un teamfight._\r\n\r\n{{summoner:13}} : Ricarica AoE il 40% del mana massimo.**Finch&egrave; meditazione &egrave; in ricarica, il tuo campione rigenera l&#039;0.3% del suo mana mancante ogni secondo e ha i tempi di ricarica base ridotti del 10% per i prossimi 40s dopo l&#039;uso.**\r\n_Ora questo incantesimo ha stat di combattimento ed &egrave; pi&ugrave; che sufficiente per rendere questo incantesimo competitivo. Ricordo che ridurre i tempi base di ricarica non vuol dire aumentare il Cooldown-reduction._\r\n\r\n{{summoner:11}} : Sta ricevendo diversi cambiamenti e quindi non possiamo dare un verdetto.\r\n\r\nEd ora &egrave; il momento di introdurre qualche incantesimo nuovo/ di reworkare qualche vecchio incantesimo rimosso\r\nOPPRESSIONE [Nuovo]: Cooldown 240.\r\nOppressione marchia un campione nemico per 10 secondi riducendo di 1 (+1 x livello) armatura e resistenza magica. Il bersaglio marchiato perde il 4% della sua salute massima come danni magici ogni secondo.\r\n_Questo incantesimo ha come obiettivo ridurre la forza dei tank nei duelli 1v1. Questo incantesimo potrebbe essere considerato un altra faccia di ignite dove ignite &egrave; pi&ugrave; efficace contro i campioni con poca salute e oppressione contro i campioni con molta salute._\r\n\r\nRAPPRESAGLIA [Reworkato dal vecchio &quot;Rally&quot; della season 1]: Coodown 130s.\r\nCrea un portale invulnerabile e imbersagliabile che evoca un minion ogni 0.5 secondi per 6 secondi. Il portale dura 6 secondi. I minion seguiranno il campione che li ha evocati e attaccheranno il bersaglio degli attacchi base del campione. Questi minion hanno 100~525 salute [75 + (25 x livello)], 20~105 ad [15 (+5 x livellol)], 1.00 attack speed, 10 armor, -30 magic res e 475 velocit&agrave; movimento. I minion evocati infliggono il 70% dei danni in meno alle strutture e non possono attaccare inibitori e nexus. Le torri infliggono il doppio del danno a questi minion. I minion durano 1 minuto.\r\n_La strategia dietro Rappresaglia &egrave; il creare un mucchio di minion che combatteranno al fianco del campione durante gli scontri, lo aiuteranno a farmare e pulire i campi della giungla pi&ugrave; rapidamente e sono forze aggiuntive per attaccare le torri in carenza di minion neutrali alleati. Vista la grande velocit&agrave; movimento, questi minion faranno body-block al bersaglio dell&#039;attacco dando cos&igrave; protezione ai campioni. _\r\n\r\nMIRA [Nuovo]: Cooldown 150s.\r\nCampioni corpo a corpo: Aumenta il rubavita del 20% e dona +5 (+2 x livello) attacco per 10 secondi.\r\nCampioni a distanza: Dona +10% velocit&agrave; movimento e attacco per 10 secondi. Per la stessa durata aumenta il raggio d&#039;attacco dei campioni a distanza di (100/95/90/80/50/30) in base al raggio base del campione (650/625/600/575/550/525 o meno).\r\n_Mira &egrave; un ottimo incantesimo per i duellanti come Aatrox o Tryndamere e su adc come Cait, Ashe o Varus. L&#039;incantesimo &egrave; fatto in modo da avvantaggiare i carry con alto raggio. Per chi lo chiedesse, modificatori di raggio a causa di abilit&agrave; non influenza il valore che dona Mira._\r\n\r\nPRESIDIO [Resa disponibile anche nella summoner rif]: Cooldown 210s.\r\nDona ad una torre vicina invulnerabilit&agrave; per 2s e una rigenerazione di 100hp/5 per 10s. Ogni volta che una torre alleata viene distrutta, il tempo di ricarica di presidio si riduce permanentemente di 10s.\r\n_Presidio &egrave; un incantesimo puramente difensivo che serve per rallentare la partita mentre il team organizza un comeback. Presidio da un momento di aria fresca ad una partita in favore nemico ed infatti diventa pi&ugrave; forte se in svantaggio._\r\n\r\nFORTIFICAZIONE [Reworkato dal vecchio &quot;Fortify&quot; della season 1]: Cooldown 600s.\r\nChiude la propia base con un muro temporaneo di 60s respingendo fuori da essa ogni minion o campione nemico al suo interno. Tutte le torri all&#039;interno della base sono rigenerate. Se non ci sono campioni alleati in base, questo incantesimo non pu&ograve; essere usato o perde i suoi effetti. \r\n_L&#039;alta ricarica di fortificazione &egrave; necessaria per la forza di questo incantesimo. In pratica fortificazione contrasta strategie come lo split push o impedisce alla squadra nemica di chiudere una partita. Fortificazione respinge le unit&agrave; solo alla sua attivazione quindi campioni nemici con dash, flash ecc... possono passare tranquillamente. Considerate il muro come i portali sui lati della base. _\r\n\r\nSOFFOCAMENTO [Fu reworkato in sfinimento, noi invece ci abbiamo lavorato su per farne un nuovo incantesimo]: Cooldown 210.\r\nQuesto incantesimo ha un sistema a munizioni e parte con 2 cariche e ne pu&ograve; avere al massimo 3. Piazza una trappola che rivela l&#039;area circostante (stessa area di una ward). Se un campione passa vicino alla trappola (500 dalla trappola), il campione viene silenziato per 3s e rallentato del 25% per la stessa durata. Quel campione &egrave; anche rivelato per 10s. La trappola si attiva dopo 20s che &egrave; stata piazzata.\r\n_Crea delle zone di vantaggio con soffocamento! Potrebbe essere lo slogan di questa abilit&agrave;: la strategia dietro soffocamento &egrave; il controllo della giungla e degli obiettivi in generale dando forza ai campione da counterjungl che possono prendere un buon vantaggio da questa abilit&agrave;!_\r\n\r\nOSSERVATORE [Nuova]: Cooldown 300s.\r\nSeleziona una delle 4 giungle della mappa e invia una sentinella invisibile con 300 hp, 300 velocit&agrave; movimento, 0 ad, armatura o resistenza magica a visitare quella zona per 2 minuti. La sentinella rivela quella parte di mappa. Se un campione alleato si trova nella stessa zona della giungla della sentinella insieme ad un campione nemico, guadagna +50 velocit&agrave; movimento. La sentinella impedisce l&#039;attivazione di &quot;Falso&quot; in quella zona della giungla.\r\n_Osservatore &egrave; un altro incantesimo per il controllo della giungla diverso per&ograve; dagli altri. Infatti osservatore permette di controllare per un gran periodo di tempo un posto della mappa rendendo cos&igrave; l&#039;incantesimo ideale quando si prepara un baron o un drago._\r\n\r\nFALSO [Nuova]: Cooldown 120s.\r\nSeleziona un campo nella giungla nemica o il drago quando il campo &egrave; vuoto. Crea una copia di quel mostro della giungla che dona visione dell&#039;are circostante per 50s o finch&egrave; un campione nemico non lo uccide. Il falso mostro ha le stesse statistiche del mostro copiato ma non dona buff per smite e non dona oro al campione che lo uccide. Quando il falso mostro muore, esplode infliggendo il 10% della salute massima di quel bersaglio in danni puri ma questo incantesimo non pu&ograve; uccidere il campione nemico. Le pink ward e il trinket rosso rivelano la vera identit&agrave; del mostro copiato facendolo sparire all&#039;istante. Gli alleati non possono bersagliare o interagire in alcun modo con il mostro copiato. Il baron non pu&ograve; essere copiato.\r\n_Falso &egrave; un ottimo incantesimo per controllare le mosse nemiche o per creare dei falsi draghi. Anche questo incantesimo serve a giocare intorno al jungler nemico in particolare per rallentarlo e pianificare le proprie azioni di conseguenza._\r\n\r\nRESURREZIONE [Ripensata con simile effetto]: 300s.\r\nResuscita il campione nella posizione dove &egrave; morto dopo 2 secondi con il 30% della sua salute e mana e un buff del 100% alla velocit&agrave; movimento per 1s. Ogni volta che si usa resurrezione, la ricarica base &egrave; permanentemente aumentata di 30s.\r\n_Un  incantesimo che pu&ograve; cambiare le sorti di un teamfight ma di cui non ne si pu&ograve; fare abuso. Giocato male potrebbe regalare molto oro al team nemico._\r\n\r\nZONA ESPLORATA [Nuova]: Cooldown 210s.\r\nPiazza una ward invisibile che si attiva dopo 10s e da visione vera per 2 minuti. I campioni alleati a 2500 distanza o meno che si muovono verso quella ward hanno la loro velocit&agrave; movimento aumentata del 20% se sono fuori dal combattimento, altrimenti del 5%. Al negozio &egrave; disponibile un oggetto che ,al costo di 135 oro, resetta il cooldown di zona esplorata.\r\n_Piazzare ward invisibile che danno visione vera non era pi&ugrave; possibile, ora lo &egrave;. Ricordatevi che questa ward conta come ward invisibile._\r\n\r\nE questo &egrave; tutto per ora. Grazie in anticipo dei commenti. [no blamerino pleaserino]","replies":[{"poster":"Jay Kenton","date":"2015-05-22T19:31:14.079+0000","up_votes":2,"down_votes":0,"body":">  L'effetto va bene ma per i campioni che non hanno nessun tipo di mobilità (già elencati i criteri) il cooldown di flash è di 240 secondi.\n\nL'idea è meno malvagia di quanto possa sembrare; sorge un problema che così mi sembra poter dire, rendere impossibile questi cambiamenti se non a cambio di season: cambierebbe troppo i rapporti di forza tra campioni non mobili (non esistono più campioni immobili) e campioni mobili. Alcuni campioni non mobili hanno quantità di danni enormi allo stato attuale e diventerebbe problematico ottenere uno shotdown su di loro se avessero più mobilità dal Flash.\n\n> Cooldown aumentato a 380s (300 se usato sulle torri o 200 se cancellato)  + reset parziale\n\nOttima filosofia di cambiamento.\n\nQuelle che proponi tu hanno spunti interessanti, ma non credo siano implementabili.","replies":[{"poster":"Spyke2G","date":"2015-05-22T20:24:55.797+0000","up_votes":1,"down_votes":0,"body":"Ovviamente sono cambiamenti per il cambio season ;D\nGrazie del tuo commento.","replies":[]}]},{"poster":"RedmasterITA","date":"2015-05-22T19:27:45.629+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=,timestamp=2015-05-22T18:05:27.954+0000)\n>\n> {{summoner:4}} : L&#039;effetto va bene ma per **i campioni che non hanno nessun tipo di mobilit&agrave; (gi&agrave; elencati i criteri) il cooldown di flash &egrave; di 240 secondi.**\n> _Sembra una contraddizione rispetto al discorso fatto prima, ma finch&egrave; flash esiste nel gioco sarebbe dignitoso dare ai campioni immobili l&#039;oppurtunit&agrave; di reagire pi&ugrave; frequentemente alle combo nemiche. Fate presente che &egrave; una riduzione minima (solo 1 minuto) che per&ograve; nel contesto di un team fight potrebbe essere rilevante._\n\nNon so si sono fatti tanti bilanciamenti sui campioni , di solito i campioni meno mobili compensano con qualche altra caratteristica come danni o difese piu' elevate. Dare un flash veloce , quindi anche maggiori possibilità di scappare , a qualcuno che stato concepito per essere forte è immobile potrebbe far risultare quel campione troppo forte.\n\n\n> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=,timestamp=2015-05-22T18:05:27.954+0000)\n>\n>MIRA [Nuovo]: Cooldown 150s.\n>Campioni corpo a corpo: Aumenta il rubavita del 20% e dona +5 (+2 x livello) attacco per 10 secondi.\n>Campioni a distanza: Dona +10% velocità movimento e attacco per 10 secondi. Per la stessa durata aumenta il raggio d'attacco dei campioni a distanza di (100/95/90/80/50/30) in base al raggio base del campione (650/625/600/575/550/525 o meno).\n>Mira è un ottimo incantesimo per i duellanti come Aatrox o Tryndamere e su adc come Cait, Ashe o Varus. L'incantesimo è fatto in modo da avvantaggiare i carry con alto raggio. Per chi lo chiedesse, modificatori di raggio a causa di abilità non influenza il valore che dona Mira.\n\nTroppo op. Dare ancora piu' raggio a qualcuno come {{champion:18}} o {{champion:222}}  vuol dire farli sparare da nexus a nexus.\n\n> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=,timestamp=2015-05-22T18:05:27.954+0000)\n>\nFORTIFICAZIONE [Reworkato dal vecchio \"Fortify\" della season 1]: Cooldown 600s.\nChiude la propia base con un muro temporaneo di 60s respingendo fuori da essa ogni minion o campione nemico al suo interno. Tutte le torri all'interno della base sono rigenerate. Se non ci sono campioni alleati in base, questo incantesimo non può essere usato o perde i suoi effetti.\nL'alta ricarica di fortificazione è necessaria per la forza di questo incantesimo. In pratica fortificazione contrasta strategie come lo split push o impedisce alla squadra nemica di chiudere una partita. Fortificazione respinge le unità solo alla sua attivazione quindi campioni nemici con dash, flash ecc... possono passare tranquillamente. Considerate il muro come i portali sui lati della base.\n\nNo dai , non si puo' fare questa cosa farebbe durare le partite ore e ore....\n\n> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=,timestamp=2015-05-22T18:05:27.954+0000)\n>\nOSSERVATORE [Nuova]: Cooldown 300s.\nSeleziona una delle 4 giungle della mappa e invia una sentinella invisibile con 300 hp, 300 velocità movimento, 0 ad, armatura o resistenza magica a visitare quella zona per 2 minuti. La sentinella rivela quella parte di mappa. Se un campione alleato si trova nella stessa zona della giungla della sentinella insieme ad un campione nemico, guadagna +50 velocità movimento. La sentinella impedisce l'attivazione di \"Falso\" in quella zona della giungla.\nOsservatore è un altro incantesimo per il controllo della giungla diverso però dagli altri. Infatti osservatore permette di controllare per un gran periodo di tempo un posto della mappa rendendo così l'incantesimo ideale quando si prepara un baron o un drago.\n\nLa visione è troppo importante , non puoi dare ben 2 minuti di visione (sentinella visibile da tutti poteva anche starci) della giungla nemica per 2 minuti solo con una semplice skill.\n\n> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=,timestamp=2015-05-22T18:05:27.954+0000)\n>\nZONA ESPLORATA [Nuova]: Cooldown 210s.\nPiazza una ward invisibile che si attiva dopo 10s e da visione vera per 2 minuti. I campioni alleati a 2500 distanza o meno che si muovono verso quella ward hanno la loro velocità movimento aumentata del 20% se sono fuori dal combattimento, altrimenti del 5%. Al negozio è disponibile un oggetto che ,al costo di 135 oro, resetta il cooldown di zona esplorata.\nPiazzare ward invisibile che danno visione vera non era più possibile, ora lo è. Ricordatevi che questa ward conta come ward invisibile.\n\nMa questo è il prototipo di Giorgio per caso xD ? No sul serio giorgio basta , credo che qeusto incantesimo sia \"troppo forte\".\n\nIl resto per me è tutto accettabile , anche se credo che non ci sarà nessuno di questi cambiamenti xD\n\nComunque bel lavoro !","replies":[{"poster":"Spyke2G","date":"2015-05-22T20:24:24.649+0000","up_votes":1,"down_votes":1,"body":"Il mio compito è dare spunto. \nNon so se già giocavi a LoL quando hanno modificato Miss Fortune, quel rework è mio :)\nComunque il punto di dare un flash rapido ai campioni immobile è che al giorno d'oggi come nel futuro se un campione non ha difese non può essere giocato nel meta. \nPer esempio a me piace molto lo stile di brand o malzahar, ma per quanto infliggano tanti danni/ hanno molti CC non sono comunque una buona scelta perchè un ahri anche se fa la metà della metà dei danni e ha 1/3 dei loro CC, per il solo fatto che ha mobility la rende indiscutibilmente più forte nei contesti di un team fight dove si decidono le sorti di una partita.\nPer quanto riguarda mira, nelle note ho scritto che riguarda solo il raggio d'attacco base quindi a jinx e tristana verrebbe applicato il bonus di 50/30 raggio bonus e non 100.\nLa sentinella di osservatoe può essere counterata e liberata e considera che non compare sul posto in cui hai cliccato, ma deve viaggiare a 300 movimento per arrivarci.\nZona esplorata, come hai intuito tu, la avevo già proposta in season 4 su un precedente post come anche mira e il rework di clarity e forse è troppo forte, però devi considerare che prendendo zona esplorata dovrai rinunciare a flash o sfinimento ed è per questo che non la considererei op.\nComunque, grazie tante del tuo commento, lo apprezzo molto. (spero di averti risposto) :)","replies":[{"poster":"Nibbio Bianco","date":"2015-05-22T21:47:23.711+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=00010000,timestamp=2015-05-22T20:24:24.649+0000)\n>\n> Il mio compito è dare spunto. \n> Non so se già giocavi a LoL quando hanno modificato Miss Fortune, quel rework è mio :)\n> Comunque il punto di dare un flash rapido ai campioni immobile è che al giorno d'oggi come nel futuro se un campione non ha difese non può essere giocato nel meta. \n> Per esempio a me piace molto lo stile di brand o malzahar, ma per quanto infliggano tanti danni/ hanno molti CC non sono comunque una buona scelta perchè un ahri anche se fa la metà della metà dei danni e ha 1/3 dei loro CC, per il solo fatto che ha mobility la rende indiscutibilmente più forte nei contesti di un team fight dove si decidono le sorti di una partita.\n> Per quanto riguarda mira, nelle note ho scritto che riguarda solo il raggio d'attacco base quindi a jinx e tristana verrebbe applicato il bonus di 50/30 raggio bonus e non 100.\n> La sentinella di osservatoe può essere counterata e liberata e considera che non compare sul posto in cui hai cliccato, ma deve viaggiare a 300 movimento per arrivarci.\n> Zona esplorata, come hai intuito tu, la avevo già proposta in season 4 su un precedente post come anche mira e il rework di clarity e forse è troppo forte, però devi considerare che prendendo zona esplorata dovrai rinunciare a flash o sfinimento ed è per questo che non la considererei op.\n> Comunque, grazie tante del tuo commento, lo apprezzo molto. (spero di averti risposto) :)\n\nPotrei visualizzare la discussione sulla modifica a Miss Fortune, ne sarei molto interessato. \n\nAd ogni modo non credo che il cdr ridotto al cleanse sia una cosa buona, perché se fosse 120 secondi, sarebbe un ottimo counter contro molti campioni che hanno una ultimate cc e che dura all'incirca lo stesso, ad esempio Annie, Fizz, Zed, Cassiopeia, ecc... inoltre vorrei ricordarla che è una delle abilità preferite da Faker, infatti io non credo sia una brutta abilità, ma che sia una abilità veramente difficile da usare, perché ti permette di salvarti in diverse situazioni se subito dopo aver subito il cc riesci a utilizzarla nel più breve tempo possibile e comunque riesci a mantenere la mente lucida sul da farsi subito dopo averla utilizzata in poco tempo... in poche parole è un abilità dell'evocatore per giocatori veramente esperti. exhaust secondo me, invece potrebbe richiede anche un aumento del cd, visto che viene utilizzato delle volte anche in mid contro alcuni avversari. è uno degli incantesimi dell'evocatore più pericoloso perché non ti permette di fare quasi nulla per 2 secondi, che è tanto.","replies":[{"poster":"Spyke2G","date":"2015-05-23T05:59:55.245+0000","up_votes":1,"down_votes":1,"body":"Il post si trova sul PBE che é il posto dove testiamo e proponiamo principalmente perché é il modo piú rapido per comunicare con la riot (o via email). Essendo molto vecchio non so se é stato eliminato. Considera che era l'inizio della suason 4. Se ti puó interessare vedi anchr il post che ha fatto xSpyke (io sul pbr) riguardo al colpo critico e confronta con la passiva di Ashe ;)","replies":[{"poster":"Nibbio Bianco","date":"2015-05-23T07:16:34.976+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=0001000000000000,timestamp=2015-05-23T05:59:55.245+0000)\n>\n> Il post si trova sul PBE che é il posto dove testiamo e proponiamo principalmente perché é il modo piú rapido per comunicare con la riot (o via email). Essendo molto vecchio non so se é stato eliminato. Considera che era l'inizio della suason 4. Se ti puó interessare vedi anchr il post che ha fatto xSpyke (io sul pbr) riguardo al colpo critico e confronta con la passiva di Ashe ;)\n\nQuello su ashe non sono riuscito trovarlo, ma ho trovato quello su mf, e non è che proprio le tue idee abbiano cambiato miss, eh.","replies":[{"poster":"Spyke2G","date":"2015-05-23T12:49:35.518+0000","up_votes":1,"down_votes":0,"body":"Ne ho creato più di uno e spesso alcuni post li ho rimossi per farne altri. Il fatto è prendere spunto. Se non ricordo male avevo proposto l'ad scaling sulla W e la ulty che applicava gli stack della W, io direi che anche se non hanno fatto esattamente uguale, l'idea era quella ;)\nMa poi non ho capito, a cosa vuoi arrivare? Sei qui per aiutare o fare lamentele? è palese che riot non da per vero i valori proposti, e sai perchè, perchè esiste una cosa chiamata alfa test a cui purtroppo noi non possiamo accedere essendo privati.\nE non downvotare come i bimbi che mi pare tu non lo sia visto che stiamo avendo una discussione sana e tranquilla. Rispetto per prima cosa, grazie.","replies":[{"poster":"Nibbio Bianco","date":"2015-05-23T13:26:53.059+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TSB Shadow,realm=EUW,application-id=cAOZwaUi,discussion-id=qpAAuJzL,comment-id=000100000000000000000000,timestamp=2015-05-23T12:49:35.518+0000)\n>\n> Ne ho creato più di uno e spesso alcuni post li ho rimossi per farne altri. Il fatto è prendere spunto. Se non ricordo male avevo proposto l'ad scaling sulla W e la ulty che applicava gli stack della W, io direi che anche se non hanno fatto esattamente uguale, l'idea era quella ;)\n> Ma poi non ho capito, a cosa vuoi arrivare? Sei qui per aiutare o fare lamentele? è palese che riot non da per vero i valori proposti, e sai perchè, perchè esiste una cosa chiamata alfa test a cui purtroppo noi non possiamo accedere essendo privati.\n> E non downvotare come i bimbi che mi pare tu non lo sia visto che stiamo avendo una discussione sana e tranquilla. Rispetto per prima cosa, grazie.\n\nOh, ero solo curioso di vedere la discussione dei cambiamenti su mf, visto che comunque nonostante il rework non è cambiato molto ed è rimasto il peggior adc del gioco, volevo vedere anche un pò le idee che avevano avuto gli altri, non mi sto lamentando di nulla, ho soltanto detto che il thread che ho trovato le tue idee non erano state applicate alla mf attuale. E bimbo sei tu che dai peso ai downvote, io non ti ho downvotato.","replies":[{"poster":"Spyke2G","date":"2015-05-24T07:32:18.356+0000","up_votes":1,"down_votes":0,"body":"Aalora ti chiedo scusa; comunque non ho downvotato nemmeno io. Ho fraiteso, il fattk e che mi ě capitato spesso con gente che iniziava con discorsi belli per finire nel blame. Sono contento che non sei uno di quelli, evidentemente c'é stato un altro ragazzo che avrá downvotato ec... chiedo venia ancora.","replies":[]},{"poster":"Zedant","date":"2015-10-03T18:26:46.659+0000","up_votes":1,"down_votes":1,"body":"Miss Fortune peggior adc del gioco....ma e chog'mao{{champion:96}} !!!!!\nProva miss fortune ap e piu op che ad nei tf.","replies":[]}]}]}]}]}]}]}]},{"poster":"Zedant","date":"2015-10-03T18:23:49.700+0000","up_votes":1,"down_votes":0,"body":"La ressurezione l hanno tolta.","replies":[]},{"poster":"kirchhoff","date":"2015-05-22T21:24:33.172+0000","up_votes":1,"down_votes":0,"body":"Ho delle domande sul tuo lavoro:\nfate ricerche per privati o per la riot o per voi stessi?\n\nPer il resto, non commento sull'aggiunte di nuove magie (sono contrario a priori) ma solo su quelle esistenti.\nIl flash così proposto può essere usato anche offensivamente, un cd lungo predilige usarlo difensivamente, uno corto anche offensivamente (vedi urf).\nIl nerf al teletrasporto è carino (fosse un buff diventerebbe una urf 2 tutti con flash + tp).\nStrano che heal vada bene così ... cura 2 personaggi (singolarmente) di più di quanto barriera possa scudare ... (senza contare il movimento)\nPurtroppo cleanse è una pro pick (io sono un fan, ma è troppo scomoda da usare) e per usarla bene va accoppiata con flash (o alla lanterna di thresh) infatti spesso si lascia prendere mikael al supporto (il più grande nemico di cleanse). Propongo un immunità ai cc per 1 secondo seguente l'attivazione.\nSu smite non commento.\nChiaroveggenza è obsoleta da quando c'è il trinket blu e secondo me andrebbe tolta (uno o l'altro)\nClarity così come ora andrebbe tolto e come proposto renderebbe obsoleto il graal/morello\n\nPer quanto riguarda il tuo lavoro lo trovo interessante.","replies":[]},{"poster":"MyXanadu","date":"2015-05-22T18:43:07.330+0000","up_votes":2,"down_votes":2,"body":"wow complimenti, secondo me sono tutte bellissime idee e vorrei davvero vederle realizzate *_* \nl'unica che mi sembra davvero troppo forte è \"soffocamento\". praticamente ti dà 3 ward gratis! Addio gank proprio!","replies":[]}]}