{"poster":"DerZenitsu","date":"2016-03-16T00:48:43.713+0000","title":"Annie, Illaoi, Katarina,Fiora und andere broken Champs","subforum":"Champions & Gameplay","up_votes":3,"down_votes":19,"body":"Es gibt ne Menge Champions in LoL die echt einen Nerf vertragen k&ouml;nnten, unter anderem die oben genannten Champs.\r\n\r\nAber da das nicht passieren wird und wir gegen diese digitalen Krebserkrankungen spielen m&uuml;ssen w&uuml;rde ich gerne wissen was ihr gegen diese Champions unternimmt und was eure lieblings Champs gegen sie sind.\r\nIch bin Yasuo Main (der Champ der immer als OP betitelt wird und in skillosen H&auml;nden, also meinen,  einfach nur zerst&ouml;rt wird)  und habe sehr starke Probleme  gegen diese 3 oben genannten Champs\r\n\r\nErstmal is Katarina hier, und ich wage es kaum das zu sagen, das kleinste &Uuml;bel, denn sie ist immerhin squishy und hat keinen Stun der einen hindert sich zu wehren\r\n\r\nBei Annie gehen meine Kopfschmerzen aber schon los... Sie wird relativ tanky gebaut mit teilweise 2500 hp und hat Stuns oooooooooohhhhhneeeeee Ende, wobei ich mich immer schon in meinen Sessel lehne wenn sie mich engaged, denn entkommen ist sowieso unm&ouml;glich ohne das GESAMTE Itembuild ihr zu widmen. Hab ich schon erw&auml;hnt dass sie mit 2-3 F&auml;higkeiten enormen Schaden rausdr&uuml;ckt die sie nicht mal zielen muss? Denn das ist nicht grund genug sie broken zu nennen oder nicht? Und das alles auch noch von einer sicheren Distanz denn sie is auch noch ranged....\r\nBitte sagt mir was dieses kleine Monstrum aufh&auml;lt, denn ich spiele viele Normals und werde halt oft mit Yasuo gegen eine Annie gestellt und da JEDE Annie Schaden macht wie Rengar auf Crack, da sie am einfachsten zu spielen ist gibt&acute;s halt keine &quot;schlechten&quot; Annies... Sie zerst&ouml;ren einfach alle\r\n\r\nBei illaoi musste ich mich kurz beim schreiben aufs Klo begeben um das Essen der letzen 15 Jahre loszuwerden, denn sie bringt mich heftiger zum kotzen als Urgots Klassischer Skin\r\nlisten wir mal Illaois St&auml;rken auf\r\n+Lifesteal mit ihren Tentakeln bis zu 15 (?) % pro Tentakel (wovon sie immer 3 St&uuml;ck in der N&auml;he hat)\r\n+Tanky\r\n+Damage\r\n+Ihr W womit sie ihren Schadensoutput fast schon verdoppeln kann\r\n+Ultimative F&auml;higkeit ohne Flash fast schon unausweichbar\r\n+Early game bully/Mid Game Hyper Carry/Late Game Monster alles in einem\r\n\r\nund jetzt ihre Schw&auml;chen\r\n- 1 gegen 5 hat sie eine geringe Chance von 3% zu sterben, wenn man alle Tentakel verfehlt..... und sich kurz nen Kaffee machen geht\r\n\r\nAbseits meiner Frust erblicke ich aber auch Spieler, die diese Champs mit Leichtigkeit wegklatschen und sogar die Profis spielen diese Champs nicht also bitte verratet mir das Geheimnis des Universums oder anders gesagt, wie man diese Champions besiegt, also was soll man dodgen, wann sind sie verwundbar und wann sollte man sich fern halten und defensiv spielen.\r\n\r\nUnd bitte empfiehlt mir nicht Fiora oder andere OP Champs zu spielen, Ich m&ouml;chte Niemanden das antun &uuml;ber das ich mich hier beschwere und es ist nun Fakt dass Fiora im 1v1 unschlagbar ist und wenn ein spieler das vom Anfang der Runde an wei&szlig; dann beginnt schon der Frust und der Spielspa&szlig; schie&szlig;t in den Keller.... Ich spreche aus Erfahrung","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T06:01:50.275+0000","up_votes":4,"down_votes":0,"body":"Also zuerst mal habe ich eine kleine Frage: Kennst du die Fähigkeiten dieser Champs **genau** bzw hast du sie schon mal gespielt? Ich würde sonst mal ein Botgame machen und sie spielen, denn so kannst du die Schwachstellen herausfinden. \n\nAnnie stuns ohne Ende? Sie hat genau 1 Stun und zwar jede 4. Fähigkeit. Wenn sie ihren stun bereit hat kichert sie und hat so ein weisses Teil um sich. lvl 6 + darfst du nicht in ihre Range kommen, denn als Yasuo kannst du nur ihre q mit der wall abwehren. Der Tedddy also nicht und wenn er dich stunt -> rip\nIch bin auch Yasuo main und gegen Annie würde ich sobald sie ihren stun verbraucht hat(für einen q lasthitt, w farm, w verfehlt, q abgewehrt) dann hat sie für die nächsten 3 Fähigkeiten keinen Stun mehr und du kannst wenn wenn du full hp bist oder sie keine ult hat offensive spielen. Übrigens benutzt sie die q zum lasthitten(wie cassio ihre e) da sie die manakosten zurückerhält. Störe sie also dabei, benutze aber nicht unüberlegt die windwall.\n\nIch sehe annie übrigens nur sehr selten(in ranked und normals) ist also nicht broken bei mit.\n\nSo jetzt zu Illaio. Ich höre so viel Illaio ist op, illaio ist tanky und hat ultra dmg. Bedenke mal was passiert wenn du als einer der mobilsten champ von lol die Tentakeln ausweichen könntest? Berechne mal illaios aa schaden(ist praktisch nichts).\nGegen illaio als Yasuo ist wirklich das einfachste:\n\nWenn er seine q oder w Tentakeln schlägt: Durch in durch dashen und du hast gerade mal 1-3 Tentakeln ausgewichen. Wenn das zu schwer ist kannst wenn er die w macht auch ins Gebüsch gehen.(mach ich bei der Jax e immer) Denn so kann er dich nicht als Ziel auswählen und wenn er ins Gebüsch kommt einfach durch in durch dashen und mit dem Minions wegdashen.(beim maxen empfehle ich dir: q, e, w, q, e, e, q, e, q, e, q( die ult auf lvl 6, 12 und 16 und die w wenn du keine andere wahl hast)\n\nWarum so maxen? Weil die e die Abklingzeit des Dashes und des Ziels und der Schaden für die E verringert. Die q mal ab und zu damit du nicht zuwenig dmg machst.\n\nWenn illaio ihre ult und w macht oder eibfach ihre tentakeln, musst du einfach sobald sie zuschlägt mit der e durch sie oder einen Minion dashen und ihre e mit deiner w blocken. Das wars. \n\nKatarina: Letztens habe ich gerade ein 1 v 1 als Yasuo gegen einen Kata main gemacht. Ich habe nicht ez gewonnen, aber trozdem first blood gemacht, mehr farm und kills gehabt und gewonnen^^\n\nAlso unter lvl 6 ist sie absolut harmlos gegen Yasuo. Wenn sie ihre q trifft und dich angreifft ist das ein grosser Fehler von ihr. Denn somit hat sie kein escape mehr und steht vor Yasuo. Wenn sie das macht: Sofort bis zum Tower angreiffen.\n\nÜber lvl 6: Da kommt es darauf an gegen was für eine Kata du spielst. Wenn sie keine Ahnung von Countern hat und dich ultet während du die q bereit hast, kannst du die q auf sie schiessen, sie ulten und ihte ult wird abgebrochen. Du kannst aber auch von ihr wegdashen/flashen und die w benutzen um die gesamte ulti abzuwehren. \n\n**Was du ja nie machen darfst**: Wenn du deine q bereit hast und sie ihre q trifft(lvl6+), du in ihre e range kommst während du die q schiesst, kann sie mit der e **hinter** dich gelangen, die q ausweichen, dich verwirren, dich ulten(deine pasive ist schon von der q weg) und du bist zu 90% tot. \nAlso immer schön in range bleiben.\n\nMit Yasuo gibt es schlimmere Champs. Die schlimmsten sind ultra dmg AS meler lifesteal champs mit keinen skillshots. zB. Master Yi, Xin zhao, Trynda...\n\nHab mal als 21/2 Yasuo 200 cs gegen ein 5/7 master Yi 150 ca verloren der daraufhin ein 1 v 5 penta gemacht hat und schon mehrmals als 20/0 100 cs Yasuo gegen ein 1/3 Xin 80 cs.\nMfg\n\nPS: Wenn ich mal als Yasuo gegen Annie, Kata oder Ilaio spiele nehme ich das Spiel auf und sonst kannst du mal ein 1 v 1 mir machen.(ich könnte dann Annie oder Kata spielen und dir ein paar tipps geben)\n\nEdit: Fiora hab ich vergessen. Die muss ich leider zu Xin und Yi setzen. Mit der hab ich ebenso ein grosses Problem. Ihre w kann übeigens deine q und spmit auch deine ult blocken. Als Yasuo musst du dich einfach von ihr fernhalten und wenn du gegen sie auf der Toplane spielst, dann ändere dein assassin Build zu einem fighter build. Also weniger squishyness. Mehr kann ich dir nicht sagen:(\n\nNoch was zu annie: Hol ein Gank, denn sie hat kein escape und kann nur einen Stunnen solange ihr nicht nahe zusammen seid.\n\nWenn du noch fragen/Probleme mit broken champs oder Yasuo hast kannst du mich adden: Only4000","replies":[{"poster":"Teemo Main","date":"2016-03-24T05:09:04.559+0000","up_votes":1,"down_votes":2,"body":"zu Annie: Flash--> E--> Tibbers und du siehst den stun nicht kommen\nzu Illaoi: sie ist eine Frau \nKein AA dmg?  ich spiele sie auf 350 ad und 5k hp da macht sie schon ein wenig schaden. alleine Q 700 dmg alle 4 sekunden.\nmit der E falls man die seele platt macht is das todesschaden hab gestern eine Alistar seele unter den inhib tower gezogen und das hat 1,6k dmg übertragen :/\nkannst mal meine history anschauen hab die beiden gestern nur gespielt.\nauch 2 mal annie gegen yasuo.\n\nLg","replies":[{"poster":"StillYasuoMain","date":"2016-03-24T10:15:40.956+0000","up_votes":1,"down_votes":0,"body":"Bei Annie muss man halt einfach zählen. Also 1, 2 und 3. Und mit einem guten Ping und guten reactions kann man mit der e auf Annie die zu dir flasht gehen, tibbers somit ausweichen und annie ist ohne escape, ohne stun und ohne e ein free kill. Zugegeben finde ich es aber auch schwer mit Yasuo gegen Annie zu spielen. Im ranked halt einfach nicht Yasuo gegen Annie picken und in normals kann man gerade üben ohne IP zu verlieren.\n\nJa ich weiss Illaio ist eine Frau aber ich sage trozdem immer er. Kann aber auch DER Champion gemeint sein;)\n\nIllaio macht wessentlich weniger Schaden mit puren autoattacks als Yasuo. Ich finde Illaio den einfachsten Champion im 1 v 1, aber im Teamfight mit ihrer e und der ulti und so hasse ich sie, da meine Teamates nicht immer drandenken auszuweichen. Ist aber auch schwierig im Team zu kämpfen und gleichzeitig auszuweichen.\n\nDie e kann niemand killen es sein den man ist zu blöd und macht einen backport oder läuft in die Tentakeln rein. Aber nervig ist sie schon.\n\n\nLg","replies":[{"poster":"Teemo Main","date":"2016-03-24T10:33:10.819+0000","up_votes":1,"down_votes":0,"body":"Annie ist ja auch laut vielen Builds Yasuos Counter ;)\n\nAch ja wie meinst du das illaoi ist easy im 1 v 1 ? wenn man sie selbst spielt oder mit yasuo gegen sie im 1 v 1?\n\nDie größte stärke ist genau wie bei Yorick das sie keine Sau so richtig kennt zumindest in Bronze sieht man ja daran du machst die E und sie denken sie müssen aus dem Feld raus, ja dann ists GG ;)\nUnd ja ich liebe sie/ihn/es was auch immer Illaoi ist einfach fett :D","replies":[{"poster":"StillYasuoMain","date":"2016-03-24T10:47:10.976+0000","up_votes":1,"down_votes":0,"body":"Mit Yasuo gegen sie.\n\nJa das stimmt und da Illaio (bei mir) fast nie gespielt wird wundere ich mich auch nicht wenn man gegen sie verliert wenn niemand die Champion menüs liest...\n\nIch gehe auch aus dem Feld raus wenn sie mir viel dmg machen könnte. Ihre e ist dodgebar und kann 0-1000 Schaden(geshätzt) machen. Wenn du drin bleibst kann sie dir frei Schaden hinzufügen wie sie will und im Late wird die seele so oder so getötet und da ist weglaufen besser.","replies":[{"poster":"Teemo Main","date":"2016-03-24T11:03:34.204+0000","up_votes":1,"down_votes":0,"body":"ich schätze der DMG des E's wird am Leben des Gegners gerechnet jedoch ist mir noch nicht aufgefallen ob die Seele die selben HP hat wie der Chamo selbst.\nHabe da auch nichts in der Beschreibung gefunden geschweige denn ein Scaling","replies":[]}]}]}]}]},{"poster":"DerZenitsu","date":"2016-03-23T23:08:08.719+0000","up_votes":1,"down_votes":0,"body":"Komisch bei mir sind deine Probleme genau umgekehrt :D\n\nAlso zu Annie : Ich hab Annie wahrscheinlich 1 mal gespielt und das in ARAM, da ich sie halt uninteressant finde, deswegen kannte ich ihre Skills nicht wirklich gut aber danke für die Tipps die werden mir sicherlich helfen beim nächsten Mal\n\nZu Illaoi : Bei Illaoi ist die Sache dass ihr Damage output im early game meinen immer übertrifft und da kann ich noch so viel ausweichen und am Ende trifft sie ein Q und es macht so viel damage wie 3 Qs und 2 AAs von mir und ins Late game komm ich dann sehr schwach hin da ich weder farmen noch Kills kriegen konnte.... Ganks bringen bei Illaoi auch nicht viel, da sie einfach mal ein Double Kill abzieht\n\nZu Katarina : Da hab ich ja schon gesagt, dass sie das kleinste Übel von allen ist und gegen Katarina habe ich nicht wirklich 1v1 große Probleme\nNUR wenn wir im Teamfight sind und ich meine Windwall schon benutzen musste um Mates oder mich selbst zu retten, ergreifen Katas immer die Chance und mein ganzes Team wird in Sekunden ausradiert\n\nMit Yi, Xin und Tryndamere hatte ich überraschenderweise keine nennenswerten Probleme, weil ich sie für gewöhnlich immer outdamaged habe und Trynda kann man gut fernhalten mit dem Wirbelwind :D \nMir macht eher Olaf Angst xD\n\nLiegt wahrscheinlich an unseren Ligen und den Spielweisen darin ^.^","replies":[{"poster":"StillYasuoMain","date":"2016-03-24T10:40:57.674+0000","up_votes":1,"down_votes":0,"body":"Also ich habe Annie auch mal in einem normal und ein paar botgames gezockt, aber mir gefällt einfach ihre unmobility nicht. Einfach zu spielen ist sie aber nicht wirklich. Man muss bei ihr halt einfach alles ein bischen mit dem jungler und so vorausplanen. Also zB. sollte sie den stun bereit haben wenn der jungler kommt. Ich empfehle dir 1. Ihre spells zu zählen und 2. nicht yasuo gegen annie zu spielen. Also in normals würde ich es machen zum üben aber in rankeds nur wenn es nicht anders geht.\n\nBei Illaio sollte es mit einem guten Ping eigentlich nicht so schwer sein mit Yasuo zu dodgen. Vielleicht ist es besser wenn du die e auf sie benutzt um die w zu dodgen und die q einfach mit herumlaufen. Klar trifft sie mal eine q, doch in dieser Zeit soltest du ihr schon mehr dmg raushauen. Beim ganking würde ich nicht offensive und nahe zusammenstehend draufgehen, sondern von beiden Seiten und aufs Ausweichen gefasst kommen. Als Illaio released wurde bin ich als Gnar wenn sie noch 100 hp hatte auch einfach voll drauflos und gestorben wegen ihrem heal effekt. Du musst einfach IMMER safe playen gegen Illaio. Auch im teamfight\n\n\nBei Kata liegts halt auch wieder an dem teamplay. Wenn alle 5 nahe zusammenstehen geht das schnell. Wenn ihr aber darauf gefasst seid, dass sie ihre q+e+r combo macht könnt ihr sie wenn sie kommt einfach stunnen, rooten, knock up, silence und die Ulti wird abgebrochen. Bei Yasuo kannst du wie ich schon sagte die q draufmachen, ihre ulti wird abgerbochen, du ultest sie und gg.\n\nBei Olaf ist die Ulti einfach schlimm, da du ihn nicht mehr ulten kannst. Ich bin mir nicht sicher aber ich glaube wenn du seine q mit der w abwehrst wird die q zerstört und bei Olaf wieder auf CD. Falls sie nicht zerstört wird kannst du leider nichts machen als mit der e auszuweichen. \n\n\nWenn du immer noch Probleme gegen Fiora hast: Sie wurde 1. generft und 2. musst du sie einfach richtig outplayen und während ihre ulti irgendwie überleben ohne dass sie alle 4 punkte trifft. Du kannst übrigens ihre w mit deiner w block oder einfach durch sie durchdashen auch wenn das ein bischen unlogisch ist, da sie ja nicht als Ziel auswählbar ist aber ok...\n\nHier siehst du ein Beispiel im midgame:\n\nhttps://www.youtube.com/watch?v=qWVM1rf9q-c&feature=youtu.be","replies":[]}]}]},{"poster":"Alustus","date":"2016-03-16T00:56:11.720+0000","up_votes":3,"down_votes":0,"body":"Von den genanntwn champs kann ich nur fiora nachvollziehen","replies":[{"poster":"Decad3r","date":"2016-03-16T07:22:45.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=0000,timestamp=2016-03-16T00:56:11.720+0000)\n>\n> Von den genanntwn champs kann ich nur fiora nachvollziehen\n\nFiora ist lediglich ein Split Push und 1 vs 1 Monster. Wobei das auch auf einen Fed Tryndamere, Aatrox usw. zutrifft. Fioras W hat einen extrem hohen Cooldown. Gegen ein Team mit CC hat eine Fiora gar keine Chance. Wer kommt denn bitte auf die Idee im Late 1 vs 1 gegen Fiora zu kämpfen? Wer das macht ist selber Schuld.","replies":[{"poster":"GankMeOrLose","date":"2016-03-17T23:45:13.819+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Decad3r,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=00000001,timestamp=2016-03-16T07:22:45.518+0000)\n>\n> Fiora ist lediglich ein Split Push und 1 vs 1 Monster. Wobei das auch auf einen Fed Tryndamere, Aatrox usw. zutrifft. Fioras W hat einen extrem hohen Cooldown. Gegen ein Team mit CC hat eine Fiora gar keine Chance. Wer kommt denn bitte auf die Idee im Late 1 vs 1 gegen Fiora zu kämpfen? Wer das macht ist selber Schuld.\n\nFiora ist besser als die, die du genannt hast denn: sie hat prozentuallen TRUE damage (gegen den man nicht bauen kann und tanks schneller auseinanderenimmt als die anderen beiden), mehr monility, kann nur damage bauen und trotzdem dank den AA resets ein AS niveau von 2.0 und höher haben und die ultimate ist auch zum teamfighten gut was die anderen beiden nicht haben (aatrox ultimate hilft nur ihm)","replies":[{"poster":"SKT T1 1ND3R","date":"2016-03-18T00:51:24.467+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"GankMeOrLose","date":"2016-03-20T16:52:40.915+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SKT T1 1ND3R,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=0000000100010000,timestamp=2016-03-18T00:51:24.467+0000)\n>\n> Weißt du gegen wen Fiora nicht standhält? Master Yi. Zu Viel Hybrid Dmg, die Q zum Dodgen und ein Qss für die Fiora ult.\n\nDa gebe ich dir dir recht aber bin mir nicht sicher. Wäre sogar ein Interessantes Matchup (also jetzt mal an ein Lategame 1v1 gedacht) denn es ist die frage ob sich Master Yi gegen den damage von fiora der ja nicht gerade wenig ist, gegenheilen kann (BotRK & BT zb.). Würde mich echt interessieren.","replies":[]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2016-03-16T05:39:41.594+0000","up_votes":4,"down_votes":1,"body":"ähm... wisst ihr, was Fiora OP macht? Autoattack Resets. Wisst ihr, was wir alle nicht können? Auto Attack Resets ausnutzen.\n\nWenn du Fioras Skilline mit Autoattacks richtig ausnutzt, kommst du ohne Items auf nen Attack Speed von 2,0... Deswegen kannst du, wenn du das kannst, Fiora nur auf Damage bauen. Jetzt kannst du dir aber mal ausrechnen, wie viele Leute in deiner Elo diese Mechanik beherrschen. Lass es mich so sagen: selbst in meiner beherrschen das eher wenige (mich ausgeschlossen).\n\nUnd dass Illaoi OP sein soll... ähm... Geheimtipp: Spiele sei ein mal. Ein einziges Mal. Im 5vs5 Blind Picks. Dann verstehst du, wie sei funktioniert und damit auch, wie man sie kontert. Wenn du nicht gewillt bist, die 40 Minuten aufzubringen... nun ja... dann halt nicht.\n\nUnd Annie... QSS. Als Yasuo Main sollte das einfach sein. Hole dir einfach dieses Item und lerne es anzuwenden. Und ja, jetzt heulst du, dass du wegen dieses einen Champions deinen Itembuild anpassen musst... lass mich dir was verraten: Wenn ich nen Yasuo Mid im Gegnerteam habe, mache ich das auch. Ich passe meinen Itembuild immer auf die Gegebenheiten an. Es gibt ein Item, dass kaufe ich nur gegen Yasuo... aber deswegen heule ich nicht. Das ist eine der Grundmechaniken des Spiels: Es gibt nicht den einen immer perfekt funktionierenden Weg, du musst immer darauf achten, was deine Mit- und Gegenspieler machen. Deswegen ist das Spiel so interessant.","replies":[{"poster":"DerZenitsu","date":"2016-03-23T23:14:55.910+0000","up_votes":1,"down_votes":0,"body":"Du scheinst ein wenig wütend von meinem Kommentar zu sein... lass mich dir versichern, dass ungefähr 80% meines Posts nur lustig sein soll (Ich hab mich beim Schreiben etwas amüsiert :P)\nFiora hat auch ohne die AA resets ein etwas zu starkes Kit und beim spammen der Fähigkeiten kann man da schon aus Glück ein paar resets abziehen\nWas sie wirklich in meinen Augen OP macht ist ihr Parieren mit der sie jede Fähigkeit (Garen Ult,Wirbelwind, Darius ult, Jax Stun) einfach alles blocken kann und die CD der Fähigkeit scheint auch nicht allzu hoch zu sein, da es Games gab, wo ich Fiora in den ca. 40 minuten nicht einmal mit der Q knock uppen konnte","replies":[]},{"poster":"GankMeOrLose","date":"2016-03-17T23:35:00.234+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=0004,timestamp=2016-03-16T05:39:41.594+0000)\n>\n> ähm... wisst ihr, was Fiora OP macht? Autoattack Resets. Wisst ihr, was wir alle nicht können? Auto Attack Resets ausnutzen.\n> \n> Wenn du Fioras Skilline mit Autoattacks richtig ausnutzt, kommst du ohne Items auf nen Attack Speed von 2,0... Deswegen kannst du, wenn du das kannst, Fiora nur auf Damage bauen. Jetzt kannst du dir aber mal ausrechnen, wie viele Leute in deiner Elo diese Mechanik beherrschen. Lass es mich so sagen: selbst in meiner beherrschen das eher wenige (mich ausgeschlossen).\n> \n> Und dass Illaoi OP sein soll... ähm... Geheimtipp: Spiele sei ein mal. Ein einziges Mal. Im 5vs5 Blind Picks. Dann verstehst du, wie sei funktioniert und damit auch, wie man sie kontert. Wenn du nicht gewillt bist, die 40 Minuten aufzubringen... nun ja... dann halt nicht.\n> \n> Und Annie... QSS. Als Yasuo Main sollte das einfach sein. Hole dir einfach dieses Item und lerne es anzuwenden. Und ja, jetzt heulst du, dass du wegen dieses einen Champions deinen Itembuild anpassen musst... lass mich dir was verraten: Wenn ich nen Yasuo Mid im Gegnerteam habe, mache ich das auch. Ich passe meinen Itembuild immer auf die Gegebenheiten an. Es gibt ein Item, dass kaufe ich nur gegen Yasuo... aber deswegen heule ich nicht. Das ist eine der Grundmechaniken des Spiels: Es gibt nicht den einen immer perfekt funktionierenden Weg, du musst immer darauf achten, was deine Mit- und Gegenspieler machen. Deswegen ist das Spiel so interessant.\n\nDachte das anpassen des Itembuilds an das Spiel ist quasi ESSENTIELL und das sollte jeder wissen o.O","replies":[]}]},{"poster":"Good Guy Putin","date":"2016-03-16T02:54:49.149+0000","up_votes":4,"down_votes":1,"body":"Keiner der oben genannten Champs ist zu stark.","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T06:50:58.584+0000","up_votes":2,"down_votes":0,"body":"Das stimmt, aber wenn man die Champs nicht richtig kennt bzw nicht weiss wie man sie countert, sind sie gegen Yasuo und auch andere hard to play champs \"OP\".\nIch meine wenn man illaios tentakeln nicht ausweicht ist es ja kein Wunder, dass er mit der ult w obeshotted und sich dabei hochhealt.","replies":[{"poster":"Good Guy Putin","date":"2016-03-16T14:33:02.170+0000","up_votes":1,"down_votes":0,"body":"Ja gut, wenn man die Fähigkeiten der Champs nicht kennt, hat der Gegner sowieso ein Vorteil^^\nGegen Illaoi komme ich persönlich auch nicht gut klar, wenn ich nicht grade einen ranged Champ habe. Glück für mich, dass sie nicht so oft gepickt wird :D","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T17:50:11.142+0000","up_votes":1,"down_votes":0,"body":"Auf der **Lane** gibt es kein einfacher Champ als Illaio. Vorausgesetzt du spielst einen mobilen Champ. Das Counterwort lautet: Dodgen^^\n\nPS: Vielleicht auch nur weil ich meistens Yasuo, Gnar, Fiora oder singed auf der Toplane spiele:D","replies":[{"poster":"Good Guy Putin","date":"2016-03-17T16:14:12.733+0000","up_votes":1,"down_votes":0,"body":"Ja Fiora spiele ich auch gerne. Leider wird sie so oft gebannt. :D","replies":[{"poster":"StillYasuoMain","date":"2016-03-17T16:18:19.247+0000","up_votes":1,"down_votes":0,"body":"Das stimmt, find ich aber nicht unbedingt negativ xD","replies":[]}]}]},{"poster":"Laufea","date":"2016-03-16T15:07:35.689+0000","up_votes":1,"down_votes":0,"body":"Ich find es immer toll als Morgana gegen Illaoi anzutreten, die ist so schön kitebar und man kann sie schön im CC halten","replies":[]}]}]},{"poster":"GankMeOrLose","date":"2016-03-17T23:28:24.993+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Good Guy Putin,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=0001,timestamp=2016-03-16T02:54:49.149+0000)\n>\n> Keiner der oben genannten Champs ist zu stark.\n\nFiora ist jetzt nicht \"zu stark\" aber hat schon ein sehr hohe schwierigkeits stufe gegen sie zu spielen denn wenn du nicht als team spielst wirst du lategame gegen sie verlieren","replies":[]}]},{"poster":"Mariju Janna","date":"2016-03-16T04:47:48.843+0000","up_votes":2,"down_votes":0,"body":"Kata is hart bad sogar finde ich der E nerf hat sie zerstört.\nIhren Q buff den merkt man nicht mal kp aber ich find man kann sie aus fun in nem normal noch picken is aber nix mehr für ranked.","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T07:03:51.856+0000","up_votes":1,"down_votes":0,"body":"Naja in Teamfights und ADCs ausschalten ist sie aber nicht so useless. \n\nDas beste Team für sie ist: Top: Yasuo Mid: Kata Jungle: Amumu Support: Malphite ADC: Miss Fortune\n\nWenn du diese Kombo hinkriegst... xD","replies":[{"poster":"Alustus","date":"2016-03-16T09:45:22.796+0000","up_votes":1,"down_votes":0,"body":"würde als support eher {{champion:12}} nehmen hat fast die selbe wirkung ist aber  in der Lane besser","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T10:08:44.704+0000","up_votes":1,"down_votes":0,"body":"Stimmt:D","replies":[]}]}]}]},{"poster":"ü ö","date":"2016-03-16T02:57:17.641+0000","up_votes":2,"down_votes":0,"body":"Joa. Bei Fiora stimme ich dir auch zu. Beim Rest aber ganz ganz sicher nicht.\n\nErstmal zu Katarina:\n\nDas offensichtlichste, Katarina ist überhaupt nicht stark, einfach CC drauf und die ist weg. \n\nDas einzige was ich bei Illaoi ein wenig broken finde ist die R, die dir mal locker an die 1,5k DMG drückt wenn man nicht direkt rausrennt. Ansonsten ist allerdings auch dieser Champ nicht op.. einfach weg wenn sie r't. \n\nAnnie.. Ich hab Annie seit locker 50 Spielen nicht mehr gesehen, nicht als Mid und auch nicht als Support. Annie ist ohne Stun quasi ein permanenter Free Kill, mit Stun ist ihr all in zwar gar nicht schlecht, allerdings ist sie danach bis zum nächsten Stun wieder relativ nutzlos. Einfach ihren Stun rausbaiten und dann all in. Annie würde ich sogar eher buffen anstatt sie zu nerfen, damit sie mal wieder gespielt wird.","replies":[{"poster":"Alocas","date":"2016-03-16T14:46:37.382+0000","up_votes":1,"down_votes":0,"body":"*Annie ohne Stun freekill* ich musste herzlich lachen, danke dafür.\nJetzt mal zur Realität, Annie ist ein Solo q Monster.\n1. Mit Stun und ulti ist jeder apc und adc tot.\n2. Auch ohne Stun machst mit q - w combo bei jedem squishy 50-70% dmg. Das ist für dich free kill? und der q hat ne CD von 3 sek oder so. \n3. Annie hat in 8 sek den Stun wieder up.\nDas Problem an Annie ist die geringe Range und fehlende Mobilität","replies":[{"poster":"ü ö","date":"2016-03-16T15:15:55.334+0000","up_votes":1,"down_votes":0,"body":"Wenn Annie so ein SoloQ Monster sein soll, sag mir mal warum sie ab Gold aufwärts überhaupt gar nicht mehr gepickt wird. Weil sie verdammt schwach ist und gegen die aktuellen Meta Midlaner kaum eine Chance hat.\n\nWenn Annie fed ist oneshottet sie, das Problem ist aber dass sie nicht fed wird.","replies":[{"poster":"Alocas","date":"2016-03-16T17:09:29.844+0000","up_votes":1,"down_votes":0,"body":"Das hat verschiedene gründe, allen voran, sie wird halt nicht in der lcs gespielt. Auch der spielstyle von Annie mag nicht jedem gefallen, gibt champs die machen einfach mehr bock. Wieso sie in höheren elo nicht so gespielt wird, liegt einfach an der geringen Range, man muss im tf quasi Flash tibbers Stun haben, damit man an die carries ran kommt. \nDann zähl mal auf, gegen wenn sie aus der aktuellen meta keine Chance hat? Fällt mir eigentlich nur Lux ein.\nDu brauchst nicht fed sein, du brauchst Farm, geht mit Annie super. Hast du dein 150cs 20min Farm, was mit Annie kein Problem ist, hast du genug dmg.","replies":[{"poster":"SKT T1 1ND3R","date":"2016-03-18T01:00:50.738+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"GankMeOrLose","date":"2016-03-20T17:00:37.641+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=SKT T1 1ND3R,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=00020000000000000000,timestamp=2016-03-18T01:00:50.738+0000)\n>\n> Gibt ein paar Champs die man in Annie ganz gut reinpicken kann, zum Beispiel Morgana, Lux, Ori, Leblanc und wie in so ziemlich jedes Ap Matchup Kassadin (fairer Champ!). Und was ist bitte an einer Morgana fair, die den ganzen Tag die Lane reinpushen kann ohne dass man sie ganken kann und die mit einer Combo ebenso Leute Oneshotten kann. Ebenso Lux, beim groupen ist jede Q ein Kill fürs Team. Leblanc kann sowohl Tanks als auch Carries Onshotten mit relativ geringen Cds. Mit den meisten Mages braucht man nur Farm für viel dmg. Aber dagegen gibt es ja zum Glück einen Supporter, Solari, CC und Hardengage, der neue Hextrinker bzw Maw, der super gut ist für Adcs und Ad Assasins und ein indirekter Nerf an Ap Champs ist. Und speziell gegen Annie der eigene Jungler. Reksai Knockup into Leblanc E, Lux q, Morg q, Viktor w usw und annie ist tot. Und ohne Flash ist Annie relativ useless gegen die gegnerischen Carries, weil man gegen normale Gegner nicht einfach ranlaufen kann. Und im Gegensatz zu anderen Mages hat sie viel mehr Probleme die Frontline zu bursten bzw als utility Mage zu dienen.\n\n1. LeBlanc ist stark, ohne zweifel aber Tanks zu oneshoten? Nette Idee. Erzähl das mal dem 6000 HP Sion mit 200 MR.\n2. Morgana auf der midlane verliert sehr viele Matchups und sie hat auch nicht wirklich gute Aussichten gegen AD Assassins.\n3. Annie ist sehr gut selbst ohne Flash. Denn wenn die gegner groupen kann man cheesy eine 5 mann ult plus stun landen und das heißt in 90% der fälle GG\n4. Annie hat utility mit ihrem stun, aber ja nicht so viel wie andere mages","replies":[]}]}]}]}]},{"poster":"GankMeOrLose","date":"2016-03-17T23:31:40.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lee Keane,realm=EUW,application-id=Wj1wcocU,discussion-id=q8KYTOkj,comment-id=0002,timestamp=2016-03-16T02:57:17.641+0000)\n>\n> Joa. Bei Fiora stimme ich dir auch zu. Beim Rest aber ganz ganz sicher nicht.\n> \n> Erstmal zu Katarina:\n> \n> Das offensichtlichste, Katarina ist überhaupt nicht stark, einfach CC drauf und die ist weg. \n> \n> Das einzige was ich bei Illaoi ein wenig broken finde ist die R, die dir mal locker an die 1,5k DMG drückt wenn man nicht direkt rausrennt. Ansonsten ist allerdings auch dieser Champ nicht op.. einfach weg wenn sie r't. \n> \n> Annie.. Ich hab Annie seit locker 50 Spielen nicht mehr gesehen, nicht als Mid und auch nicht als Support. Annie ist ohne Stun quasi ein permanenter Free Kill, mit Stun ist ihr all in zwar gar nicht schlecht, allerdings ist sie danach bis zum nächsten Stun wieder relativ nutzlos. Einfach ihren Stun rausbaiten und dann all in. Annie würde ich sogar eher buffen anstatt sie zu nerfen, damit sie mal wieder gespielt wird.\n\nEine gute Katarina wartet in der Backline bis die meiste hard CC drausen ist und engaged so das sie SOFORT ihren reset bekommt und dann machst du auch nichts mehr. aber ja, CC un free kill. Nur die guten katas sind schwer gegen zu spielen","replies":[{"poster":"ü ö","date":"2016-03-18T00:10:41.630+0000","up_votes":1,"down_votes":0,"body":"Wenn du so argumentierst, kann ich dir auch sagen dass ein guter Tank sich mindestens einen CC Spell aufhebt bis Katarina engaget..","replies":[]}]}]},{"poster":"Wohltat","date":"2016-03-24T10:49:20.854+0000","up_votes":1,"down_votes":0,"body":"Schau Dir die Winrates der Champs auf http://champion.gg/ an. Keiner der Champs ist op. Shyvanna, Lux und Janna waren op. Das hat Riot aber gefixed, wie ich in diesem Video erkläre: https://www.youtube.com/watch?v=1Hk6-3Ym6_I","replies":[]},{"poster":"GankMeOrLose","date":"2016-03-17T23:26:44.881+0000","up_votes":1,"down_votes":0,"body":"Du spielst doch Yasuo oder? Dann spielt ihn Top gegen Illaoi. Versuch mit deiner e ihre Tentakel zu dodgen (sehr einfach mit übung) und schon hat sie nahe zu keinen damage output. Oder speil gnar. er kann sie kiten da sie keine mobility hat und zusätlich kann er mit dem jump entkommen und die tentakel in sicherheit clearen. kurz: mobility und range sind ihr feind","replies":[]},{"poster":"Frankydude","date":"2016-03-16T10:29:23.410+0000","up_votes":1,"down_votes":0,"body":"könntest ja auch andre Champs als Yasuo spielen, wenn du Probleme mit anderen Champs hast.\nNe Diana gegen ne Kata\nne Lulu in ne Illaoi oder bissi unkonventionell, aber nen Alistar in ne Illaoi\nund ne Lux in ne Annie\n\nnur wenn du nur mit einem Champ climben willst musst du schwachstellen rausfinden auch wenn du gecountert wurdest.\njeder hat seine eigene Spielweise, Zeichen dafür dasser Engage vorbereitet,Reaktionen auf aggressive Züge von dir, etc","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T11:48:13.351+0000","up_votes":1,"down_votes":0,"body":"Yasuo countert eigentlich Illaio und gegen Kata ist er gut gespielt auch nicht schlecht...","replies":[{"poster":"Frankydude","date":"2016-03-17T09:54:56.066+0000","up_votes":1,"down_votes":0,"body":"war ja mehr nen vorschlag, wenn ER  probleme als yasuo mit den champs hat .\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"StillYasuoMain","date":"2016-03-17T11:44:41.316+0000","up_votes":1,"down_votes":0,"body":"Klar aber eigentlich sollte er sowas als Yasuo Main mal überlegen..........","replies":[]}]}]}]},{"poster":"Nuix","date":"2016-03-16T06:52:19.493+0000","up_votes":1,"down_votes":0,"body":"Komisch, jedes Mal, wenn ich gegen Yasuo mitte spielen muß - also andauernd - denke ich das gleiche :)","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T10:14:59.296+0000","up_votes":1,"down_votes":0,"body":"Jedes mal? Was spielst du denn? Syndra?^^","replies":[{"poster":"Nuix","date":"2016-03-16T11:18:30.983+0000","up_votes":1,"down_votes":0,"body":"Velkoz","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T11:46:53.993+0000","up_votes":1,"down_votes":0,"body":"Na dann ist klar. Yasuo kann deine q, w und ulti ausweichen indem er durch dich hindurchdasht. Blocken kann er deine q und w(e bin ich nicht sicher). Ausserdem wird deine ulti von seiner ulti abgebrochen und wenn er durch dich hindurchdasht während der ulti bist du ein free kill für ihn. Spiel lieber nicht mehr Velkoz gegen Yasuo;)","replies":[{"poster":"Nuix","date":"2016-03-16T11:58:22.503+0000","up_votes":1,"down_votes":0,"body":"Velkoz ist mein Main und da oft Yasuo gepickt wird - egal ob vor oder nach mir - habe ich kaum ein Wahl :)","replies":[{"poster":"StillYasuoMain","date":"2016-03-16T13:09:44.583+0000","up_votes":1,"down_votes":0,"body":"Dann lern halt Cassiopeia, Fizz oder Azir...","replies":[]}]}]}]}]}]}]}