{"poster":"add me on ICQ","date":"2016-04-19T09:07:22.731+0000","title":"Im Ranked- und Draftmode sollte man mehr bannen können.","subforum":"Karten & Spielmodi","up_votes":4,"down_votes":7,"body":"damals gab es vielleicht einen Championpool von 60 und man durfte 6 bannen. Heute gibt es einen Pool aus 150 und MUSS 6 bannen.\r\n\r\nEs gibt einfach Champs bei denen der Loose einfach schon vorprogrammiert ist oder zumindest das Game abgefuckt ist. Malphite ist z.B. so ein Pick.\r\n\r\nAber was soll man tun? Mehr bannen lassen w&uuml;rde die endlos dumm gereworkte Queue nur noch verl&auml;ngern. Und Champs auf Permaban setzen w&auml;re einfach nur retarded. Aber &quot;nur&quot; 6 Champs bannen lassen geht auch nicht wie ich finde. :&lt;","replies":[{"poster":"Sirrkas","date":"2016-04-19T09:35:44.517+0000","up_votes":3,"down_votes":0,"body":"Damals gab es eher so 100 und man durfte 4 bannen.","replies":[]},{"poster":"Uranbrennstab","date":"2016-04-19T10:47:12.013+0000","up_votes":2,"down_votes":0,"body":"Dann Spiel malphite, wenn es ein free win ist. Wenn etwas op ist= selber spielen.\nAlternativ mal über counterpicks nachdenken.","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-04-19T09:31:11.902+0000","up_votes":2,"down_votes":0,"body":"ist halt ein bisschen ein dilemma... wenn man jetzt 5 champs bannen darf dauert es noch wesntlich länger, bis das spiel startet und wenn man z.B. die 10 meistgespielten champs bannt, sind die leute auch unglücklich.","replies":[{"poster":"Sirrkas","date":"2016-04-19T09:41:13.513+0000","up_votes":2,"down_votes":0,"body":"Einmal abgesehen davon, dass man dann einfach die nächsten 10 Champions als OP deklarieren würde.","replies":[]}]},{"poster":"Ochsi","date":"2016-04-20T11:21:52.703+0000","up_votes":1,"down_votes":0,"body":"> Es gibt einfach Champs bei denen der Loose einfach schon vorprogrammiert ist oder zumindest das Game abgefuckt ist. Malphite ist z.B. so ein Pick.\n\nDann müssten diese Champs ja ne 100%winrate haben :^)","replies":[]},{"poster":"I am Zynex","date":"2016-04-19T15:04:33.943+0000","up_votes":1,"down_votes":0,"body":"Ich finde 6 Banns aktuell ok, weil aktuell nicht mehr so viele Champions OP sind, dass sie ein muss Bann sind und danach einfach genug Champions auf einem Niveau sind, dass man deutlich mehr Bans bräuchte, um dann nicht künstlich Powerpicks zu kreieren.\n\nWas ich aktuell viel wichtiger finde ist, dass man anfangen sollte die Pick und Bann Phase cleverer zu spielen.\nDamit meine ich, dass man einfach möglichst früh Powerpicks dem gegnerischen Team wegnehmen sollte und auch klüger first picken sollte. Man sieht einfach momentan oft genug, dass jemand im eigenen Team z. B. Graves spielen möchte, man first Pick hat und der Champ trotzdem gebannt wird, ohne vorher zu klären ob man ihn first picken könnte.","replies":[]},{"poster":"Good Guy Putin","date":"2016-04-19T14:16:57.862+0000","up_votes":1,"down_votes":0,"body":"6 Banns reichen vollkommen aus. Ich weiß schon gar nicht mehr was ich bannen soll, wenn Ekko und Tahm gebannt sind xD","replies":[]},{"poster":"Maíko","date":"2016-04-19T14:13:45.167+0000","up_votes":1,"down_votes":0,"body":"Der einzige Champion der z.Z. wirklich gebannt, oder gepickt werden sollte ist Ekko.\n\nDie restlichen Bans kann man dann seiner Teamkomposition anpassen.\n","replies":[]},{"poster":"StillYasuoMain","date":"2016-04-20T11:16:55.746+0000","up_votes":1,"down_votes":1,"body":"Dann würde Yasuo womöglich bei mir der nächste Instaban werden:'(","replies":[]}]}