{"poster":"RedPannda","date":"2016-04-08T21:57:59.785+0000","title":"Help buying my first pair of good headphones.","subforum":"[ARCHIVED] General Discussion","up_votes":2,"down_votes":2,"body":"So I have never really been too picky about my sound, mostly because I have never had a computer that could handle games that need it like fps games. But I have a nice computer now and would like to get a nice pair of headphones for Overwatch so I can take advantage of positional sound and all that. I have been using a 20 dollar pair of made in God knows where headphones pretty much all my life so I don&#039;t really know what to expect. I have done a bit of research on reddit and some other sites trying to educate myself on the basics and I have narrowed my selections down to a few brands. Has anyone used any of these and maybe have some insight on how they work or maybe ideas for other options. \r\n\r\nhttp://www.amazon.com/Audio-Technica-ATH-AD700X-Audiophile-Headphones/dp/B009S332TQ/ref=sr_1_2?s=electronics&amp;ie=UTF8&amp;qid=1460152117&amp;sr=1-2&amp;keywords=audio+technica+ath-ad900x\r\n\r\nhttp://www.amazon.com/Technica-ATH-AD900X-Open-Back-Audiophile-Headphones/dp/B009S331VU/ref=sr_1_1?s=electronics&amp;ie=UTF8&amp;qid=1460152430&amp;sr=1-1&amp;keywords=audio+technica+ath-ad900x\r\n\r\nhttp://www.amazon.com/Sennheiser-HD-598-Over-Ear-Headphones/dp/B0042A8CW2/ref=sr_1_2?s=electronics&amp;ie=UTF8&amp;qid=1460152453&amp;sr=1-2&amp;keywords=sennheiser+hd+598\r\n\r\nI chose these three because they are open backed and from everything I researched this gave much better positional sound for gaming and I live alone so there is no need to worry about bothering anyone else.\r\n\r\nThe stats on the ad700/ad900 are almost identical, and almost all the reviews sound exactly the same. Trying to figure out if its worth the extra 50 bucks for the 900. \r\n\r\nMy max budget is $200 dollars but I would like to keep it down to $150 or less if possible. I would mostly be using these to play games like Overwatch/Battlefield/League. Some you tube music and movies but mostly for gaming use. \r\n\r\nThanks for advice. {{sticker:slayer-jinx-catface}}","replies":[]}