{"poster":"BobsMeUnclez","date":"2017-01-06T19:08:29.018+0000","title":"Constantly being stomped in games as a new player.","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"I have not long started to play LoL and am already extremely close to giving up with it as in every game I am constantly slaughtered, no matter how hard I try. I am always facing people who have other accounts in plat 3 and other high ranks, meaning their skill on the game is a LOT higher than mine, meaning I can&#039;t learn to control CS or the lane properly, nor how to get objectives properly without causing my own death. I feel there needs to be something done about this, as it just get&#039;s really annoying after being slaughtered all the time and having a 0% chance of winning. The past few games, I&#039;ve played ADC, and the other ADC is 50-60 CS above me within the first 10 minutes, and over 100-12- by 20 minutes, which means I have a MAJOR gold difference to them, causing me to be an easy kill and making it impossible for me to get anything on the game. So due to all this, I am at my wits end and am very close to walking away from the game for good.\r\n\r\nThere has to be something done about this, because I bet you have lost a lot of players due to these &quot;smurfs&quot; who find it enjoyable ruining the game for new players.","replies":[{"poster":"still kae","date":"2017-01-06T19:13:57.816+0000","up_votes":4,"down_votes":0,"body":"As a person who sometimes does extremely well in normal games and have subsequently played in ranked for many seasons, I can tell you that these 'plat smurfs' or 'diamond smurfs' are more than likely bronze-silver players.\n\nI hope this doesn't discourage you, the game takes time to learn well, as do all. But uh, when you run into a plat+ player, you're going to recognize the difference. It's one of those games where one guy is like 24-2 and you have no idea how he has 250 cs at 25 minutes.","replies":[{"poster":"Hauling Ashe","date":"2017-01-06T19:21:09.196+0000","up_votes":1,"down_votes":0,"body":"Exactly this. You will just have to face the fact that you are not good at the game for a while.\n\nActually, my opinion is that the hardest thing about League of Legends is not learning how to perform on your champion, but how everyone else's champions function. I _still_ do not understand exactly what a few champions do because I do not play them and I rarely see them on the enemy team. But when I do see them, sometimes they will pull some ability on me and I'll be left wondering what just happened.","replies":[{"poster":"Ralanr","date":"2017-01-06T19:24:03.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Titz n Ashe,realm=NA,application-id=3ErqAdtq,discussion-id=OFEMEKE7,comment-id=00000000,timestamp=2017-01-06T19:21:09.196+0000)\n>\n> Exactly this. You will just have to face the fact that you are not good at the game for a while.\n> \n> Actually, my opinion is that **the hardest thing about League of Legends is not learning how to perform on your champion, but how everyone else&#x27;s champions function**. I _still_ do not understand exactly what a few champions do because I do not play them and I rarely see them on the enemy team. But when I do see them, sometimes they will pull some ability on me and I&#x27;ll be left wondering what just happened.\n\nPretty much this imo. I feel like pros have to memorize all the cooldowns of every champion in order to know how to play against them at their level.","replies":[]}]}]},{"poster":"RookPusher","date":"2017-01-06T19:41:18.854+0000","up_votes":1,"down_votes":0,"body":"I'd personally play a lot of games with the bots first. Mostly because they aren't caustic jerks. You want to do what you can before you hit ranked. I'd play 100 bot games, watch some youtube videos, and then do 100 normal games. \n\nThis game is brutally awful to pick up on since there's no curve. If you read the wrong thing, you'll be attempting to last hit because you get map awareness. Before playing with real people, play games where you can do the absolutely wrong thing and still not lost, and still learn. \n\nI've been at this for 4 years, and I played the real DotA back in WC3 so I wasn't coming in blind. But when learning a new champ I always do this:\n\nWatch Champion Spotlight\nPlay a bot game (9 bots, and me). Surrender at 20 if you feel good using the combos. \nPlay a normal game. Let them know its your first time, say feedback is welcome. \nThen go Ranked (if you like the champ, I usually don't)","replies":[{"poster":"Hyperiön","date":"2017-01-06T20:57:03.638+0000","up_votes":2,"down_votes":0,"body":"If your telling people to take champions into ranked after 2 games, 1 of which is a bot game. Ima come out through your monitor and slap you.","replies":[{"poster":"RookPusher","date":"2017-01-06T21:01:48.631+0000","up_votes":1,"down_votes":0,"body":"Hahaha, no that's kind of fair. But in my defense, I think that's two more games than most people give it. \n\nTypical Bronze Player:\n\n* gets wrecked by Champ X\n* Loses\n* Buys Champ X\n* Joins ranked\n* Feeds\n* Rages","replies":[{"poster":"Hyperiön","date":"2017-01-09T13:29:11.687+0000","up_votes":1,"down_votes":0,"body":"Pretty much. Thats how I was when I first started. Except I didn't rage.","replies":[]}]}]}]},{"poster":"FioraWillCarry","date":"2017-01-06T20:24:57.939+0000","up_votes":1,"down_votes":0,"body":"I'm curious. Did you jump into PvP early ? I remember when I was new, I played a fuck tonne of Co-op vs AI. It took me a good long time to start playing vs humans. By the time I got around to it, I had no problems. I don't mean I was great or anything but I wasn't overwhelmed. I could get kills and outplay people and all that. Learning to play this is a gradual process. If you jumped into PvP without being ready, you're gonna be overwhelmed. Bots are good for practicing mechanics which is enough to survive under level 30.","replies":[{"poster":"BobsMeUnclez","date":"2017-01-06T20:31:24.075+0000","up_votes":1,"down_votes":0,"body":"I have spent about 3-4 weeks just playing against bots, but have gotten bored of it as it's just too easy. So no, I didn't jump straight into PvP, but I just feel that training on bots is a waste of time, as what you learn against a bot is completely different to what you need to learn against players. Bots become very predictable, to the point I know exactly which direction bots head from start to finish of a match, whilst players you can never properly predict where they are going or what they are doing.","replies":[{"poster":"FioraWillCarry","date":"2017-01-06T23:09:01.862+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BobsMeUnclez,realm=EUW,application-id=3ErqAdtq,discussion-id=OFEMEKE7,comment-id=000b0000,timestamp=2017-01-06T20:31:24.075+0000)\n>\n> I have spent about 3-4 weeks just playing against bots, but have gotten bored of it as it&#x27;s just too easy. So no, I didn&#x27;t jump straight into PvP, but I just feel that training on bots is a waste of time, as what you learn against a bot is completely different to what you need to learn against players. Bots become very predictable, to the point I know exactly which direction bots head from start to finish of a match, whilst players you can never properly predict where they are going or what they are doing.\n\nWell if bots have become easy then you should move to PvP. Beyond that, I don't know what to say. Maybe the general skill level of the population has risen since I was a noobie. I don't remember having difficulties when I started to play PvP.\n\nAnother thing though. I only played 1 champion in my total noob days. It was Akali. I played her anywhere I got, even support and ADC, although I didn't understand the meta or why I should play certain champs in certain positions. All I knew is that I loved that champ. Maybe you should do something similar. Play the shit out of one champ.","replies":[]}]}]},{"poster":"BobsMeUnclez","date":"2017-01-06T20:39:32.041+0000","up_votes":1,"down_votes":0,"body":"So, I'm going to change all of this to a completely different question. Any advice for a new player on how to better myself at the game? I know to go against bots, but is there a champ I can play that's hard to get CS with, which will get me used to getting the last kills, or another champ that is really hard to carry a game with, making the games longer and a little more challenging? I know I don't have a massive arsenal of champions, but I'm willing to try anything as I am really enjoying how this game is (Apart from the constant ass-whooping :P)","replies":[]},{"poster":"TenshouSNK","date":"2017-01-06T19:16:00.847+0000","up_votes":1,"down_votes":0,"body":"if you can get 5 kills in 10 minutes, that's better than 100 cs.","replies":[{"poster":"Ïnsidious","date":"2017-01-06T20:03:39.902+0000","up_votes":1,"down_votes":0,"body":"Thats a terrible habit, its better to learn to cs than get kills, because winning from snowball is easy, winning from behind is where cs comes in","replies":[]}]},{"poster":"swordofsun","date":"2017-01-06T20:08:55.731+0000","up_votes":1,"down_votes":0,"body":"I was in a similar spot when I started.  Learning /mute all probably kept me playing the game.  That and ARAM.  I'm still bad, but it kept me playing until I could get to a level where it wasn't flooded by smurfs.  Smurfts who are probably Bronze/Silver actually, they seem to get joy out of going against new players and stomping them.  Best to mute them until you're more confident in your skills/level past them.","replies":[]},{"poster":"BobsMeUnclez","date":"2017-01-06T19:26:35.769+0000","up_votes":1,"down_votes":0,"body":"I understand the journey is the adventure, and I completely agree with that. And I agree that I'm terrible at the game, but how am I supposed to learn anything if I never get given the chance to, because instead of having a 50-50 chance of winning a match up, I have a 95% chance of losing it. I really want to learn to play this, as I've seen how complex it really is, but it's hard to push myself forward when I feel like absolute crap at the end of every game because of how shocking I did.","replies":[{"poster":"Ïnsidious","date":"2017-01-06T20:00:47.418+0000","up_votes":1,"down_votes":0,"body":"Honestly I would suggest playing a solo lane. ADC is probably the most punishing role in the game, because if you fall behind you are out of the game, and even if you are ahead you will get caught out and fucking slaughtered because as a new player your positioning is probably not optimal. I started out playing midlane and top and it helped me a lot, because I could focus on myself and my opponent instead of myself, support, enemy adc and support. Those roles are also less punishing to play, because you can literally die in lane 3 times and you will still have your first tower up","replies":[{"poster":"BobsMeUnclez","date":"2017-01-06T20:08:33.509+0000","up_votes":1,"down_votes":0,"body":"There is 1 major downside to this though, and that's I HAVE to either play Supp or ADC as top, mid and jungle get taken. I know I'm a good jungler, because whenever I get the jungler position I end up carrying the game, same as mid. Top I'm not so good at. But because I have to play blind pick, the second I go into a match, jungler, top and mid are called by someone else, leaving me the bot lane where I get destroyed.","replies":[]}]}]},{"poster":"BobsMeUnclez","date":"2017-01-06T20:04:42.740+0000","up_votes":1,"down_votes":0,"body":"So even though I've spent the past 3-4 weeks of playing against bots to try and learn how to play it, all I can do is just continue playing against bots until I get bored, try to play normal people again, realize I suck at the game still, then rinse and repeat? Where's the fun in playing against bots when I am 100% sure I'm going to win by a landslide, meaning there is no competition in the win, nor is there the competition to get good CS. When playing an ADC in a bot game, it becomes rare for me to miss CS, to the point I am hitting 200 CS within 20 minutes, and yet in a normal game I can still only get to maybe 100 if I'm lucky, but normally around 60-80 CS by the 20 minute mark. I've constantly seen people getting 60-80 CS before the 10 minute mark, so i KNOW that it's absolutely terrible to only have that at the 20 minute. \n\nI feel that I've just wasted a month of my life to be at the same skill level as I was before, and I just can't understand why I'd drag myself through it again and again just to realise I still suck at the game and I'm never going to get better, because when I try against players, I'll always face the smurfs that just role over me, no matter how safe I play.","replies":[]},{"poster":"BobsMeUnclez","date":"2017-01-06T19:41:38.569+0000","up_votes":1,"down_votes":0,"body":"But I've also tried support, and when I do everything becomes my fault. \"Oh, you've ruined my lane now\", \"Why diidn't you dive with me you noob\", If I take 1-2 CS \"/all Report for taking all the CS\". I try to stay back, and lock people down when I can, but whenever it messes up, it becomes my fault, to the point I have had several people quit on me because I just suck at the game.","replies":[{"poster":"Divine Winds","date":"2017-01-06T19:48:17.566+0000","up_votes":1,"down_votes":0,"body":"thaaats support at low elo. Everyone either blames you or doesn't thank you.","replies":[]},{"poster":"Hauling Ashe","date":"2017-01-06T19:46:55.856+0000","up_votes":1,"down_votes":0,"body":"You are definitely playing with low tier players if they are saying those things. LOL\n\nIronically, only noobs usually call each other noobs. I haven't been called a noob in forever, and I've had my share of good and bad games.","replies":[]}]},{"poster":"BobsMeUnclez","date":"2017-01-06T19:22:18.678+0000","up_votes":1,"down_votes":0,"body":"In most games I've played to try and learn to CS properly (As my brother's play it and have given me the basic run down of things like CS and everything else), but when it hits 15 minutes and I'm at 50 CS cause I've been pushed out of the lane, whilst the other ADC is at 130-140 CS, it becomes difficult. I also don't know when to dive for a kill, and when to back off, so 910 times I die within the first 5 minutes, giving the other player even more of a lead, so I just feel useless at the game.","replies":[{"poster":"Hauling Ashe","date":"2017-01-06T19:28:20.801+0000","up_votes":1,"down_votes":0,"body":"When you are new, I cannot give more important advice than to just play safe. As an ADC, especially in the current meta, you will need to play in almost a paranoid state. When you push, always make sure there are allied minions between yourself and both enemies. Never push when you don't have the river brush warded.\n\nOne of the most painful lessons you will receive again and again and again as an ADC is how to not get Blitzcrank combo'd. (And even better players in high ranks still hate him.) The number one rule for an ADC is never do anything alone.","replies":[{"poster":"BobsMeUnclez","date":"2017-01-06T19:31:43.129+0000","up_votes":1,"down_votes":0,"body":"But that's hard to do when you also have a new Supp with you, who doesn't know how to play either. I've nearly always got the river warded, and I can't seem to get the hang of killing minions under the tower, even though I know it's 3 shots to kill a melee minion, and 2 shots to kill a ranged when they are under tower. I've done so much research into this game, because I like to be prepared before I play a game, But even if I play completely safe and never leave me tower, I still fall behind a hell of a lot, or they dive me under tower and I get destroyed before I can even move.","replies":[{"poster":"Hauling Ashe","date":"2017-01-06T19:43:26.646+0000","up_votes":1,"down_votes":0,"body":"What I like to do to practice my farming/warm up for ranked is start a custom game with one ranged AI enemy and just practice csing from different positions in lane. Start out in a lane without a bot, and farm regularly. You want to hit 100cs or better at the 12 minute mark. (This is often impractical in a real match because you will be trading with your opponent and losing some cs opportunities due to that. I average around 85-90cs by 12 minutes in a real game.)\n\nAfter that, move to the lane with the bot and let them keep pushing lane, and just practice farming from under your tower. Don't trade with them, in fact, you want them to harass you to make it a bit more realistic.","replies":[]}]}]}]},{"poster":"Pandemic Punch","date":"2017-01-06T19:38:21.937+0000","up_votes":1,"down_votes":0,"body":"ADC is one of the hardest roles to learn on a mechanical level. It is also (In my own opinion) the hardest role in the game to carry with.\n\nI recommend support to newer players. Then play mages or a easy champion like Morgana. You won't have to think about CSing at all in the support role, you can still engage in combat as soon as the laning phase starts, and you can allow yourself time to get better and more integrated with the game.","replies":[]},{"poster":"Azure Hamster","date":"2017-01-06T19:36:41.782+0000","up_votes":1,"down_votes":0,"body":"This is a big, hard complicated game to learn. Have patience, and always look to how you can improve your own game.\n\nSometimes is really is your team's fault, but you're still better off asking what you could have done better. Because your performance is the only thing you can control. :)\n\n{{champion:51}}","replies":[]},{"poster":"still kae","date":"2017-01-06T19:19:55.029+0000","up_votes":1,"down_votes":0,"body":"Let me continue that thought as it was probably not the brightest outlook. Okay, so I said I used to play, right? I was actually really good. Stutter-stepping ADC with a 3-4:0 KDA avg and a decent cs that could carry myself out of Bronze any day of the week. (I used to troll a li'l and drop myself by just playing casually sometimes to see if I could do it again)..\n\nI say that to say this: I took a few years break and im hot garbage now apparently. Bronze/Silvers are a lot better than they used to be and I obviously aren't as good as I used to be. It happens..\n\n\nAsk yourself this: if the destination was easy, would it be worth getting to?\n\nI have quit more games than I have been exceptionally good at than I care to admit to. I play MOBA's exclusively because in comparison I am bad at them, having been sponsored in FPS and reached what is I guess diamond something in MMO's.\n\nAnd am hot garbage here, thus I am here.\n\nI want the challenge. I want to climb. I've been good at the other genres as long as I can remember, and have carpal tunnel now from StarCraft (eff yewww blizzard am sue), so there goes sc2.\n\nRealize that the journey is the adventure, not the ending.","replies":[]}]}