{"poster":"Toshime","date":"2018-02-12T03:09:26.164+0000","title":"Lag (o ping alto)","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Hola, quer&iacute;a saber si alguien mas experimenta ping alto (entre 100 y 140) con su Internet y si es solo en LoL.\r\n\r\nNo se porque pero desde hace dos parches mas o menos (creo) tengo este ping pero es solo en el LoL, juego otras cosas como CS GO y normalmente los dos juegos los juego a 60 ms, no se si paso algo con mi Internet pero lo testee y esta todo correcto, mi internet de bajada es normal y mi ping es normal, LoL me anda a 100 o 150 ms, y es demasiado, CS GO me anda a 70, es jugable pero en LOL no, y para variar tengo micro-cortes\r\n\r\nA alguien mas le pasa eso? tienen alguna posible soluci&oacute;n? debo llamar a mi proveedor de Internet o es el juego?\r\n\r\nGracias por leer de todos modos\r\n{{sticker:vlad-salute}}","replies":[{"poster":"Xidalas","date":"2018-02-12T04:25:05.789+0000","up_votes":1,"down_votes":0,"body":"Yo tengo un problema parecido desde hace dos dias.\nRepare el cliente 2 veces, desinstale y volví a instalar y sigue el problema. \nyo tengo 30 ms/75 fps y por momentos se corta.\n\nPor el momento juego intermedio y principiantes para cumplir misiones.\n\nTe diría que mandes un ticket al soporte así toman tu reclamo.","replies":[{"poster":"Phaser","date":"2018-02-12T06:47:12.586+0000","up_votes":1,"down_votes":0,"body":"Yo mande un Ticket, y me dijeron\n\"Probaste usando DNS publica?\"\n\"Proba desactivando el protocolo IPv6 de tu configuracion de internet\"\n\"Fijate que tu antivirus o firewall no esten bloqueando la conexion a LoL\"\nSaben que? El juego NO esta bloqueado. Hace UN AÑO que vengo jugando con IPv6 y SIN DNS publico (deteccion automatica). Cambiar eso no arreglo nada, asi que volvi a la configuración normal. Y lo peor... Es que hoy pude jugar unas cuantas partidas bien... Pero masomenos a las 8pm, Boom! De nuevo el error. Aparte todos tienen los mismos problemas.","replies":[{"poster":"Xidalas","date":"2018-02-12T15:16:30.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Phaser,realm=LAS,application-id=X54mVVp0,discussion-id=0OwpIQfp,comment-id=00010000,timestamp=2018-02-12T06:47:12.586+0000)\n>\n> Yo mande un Ticket, y me dijeron\n> &quot;Probaste usando DNS publica?&quot;\n> &quot;Proba desactivando el protocolo IPv6 de tu configuracion de internet&quot;\n> &quot;Fijate que tu antivirus o firewall no esten bloqueando la conexion a LoL&quot;\n> Saben que? El juego NO esta bloqueado. Hace UN AÑO que vengo jugando con IPv6 y SIN DNS publico (deteccion automatica). Cambiar eso no arreglo nada, asi que volvi a la configuración normal. Y lo peor... Es que hoy pude jugar unas cuantas partidas bien... Pero masomenos a las 8pm, Boom! De nuevo el error. Aparte todos tienen los mismos problemas.\n\nPrácticamente nos dijeron lo mismo para decir al final que hay problemas de fps por la ultima actualización. Pero bueno el tema del ticket esta como respaldo por sí las moscas y además para avisar el soporte ya que no es lo mismo que uno mande un ticket solo a 1000.","replies":[{"poster":"Phaser","date":"2018-02-13T00:47:25.607+0000","up_votes":2,"down_votes":0,"body":"Eso es muy cierto, es preferible que 1000 personas manden un Ticket reportando EL MISMO sintoma, a que se quejen todos en los foros por algo que poray es un problema propio y no del juego. Espero que si hay mas jugadores con el mismo problema, salga alguna informacion al respecto.","replies":[]}]}]}]},{"poster":"fujiwara008","date":"2018-02-12T03:36:08.840+0000","up_votes":2,"down_votes":0,"body":"También me pasó o me pasa hoy no me a pasado... Pero es el juegos, general mente tengo 40 ms y subía a 2000 de ms pero no era el internet así que no te molestes en llamar al tu proveedor de internet... Lo que hice fue contactar a Riot y me dieron algunas soluciones adecuadas así que eso trata de contactar con ellos para que te ayuden \n\n\nNo es de gran ayuda pero suerte","replies":[]}]}