{"poster":"Cloudias","date":"2015-02-11T16:11:32.556+0000","title":"Perchè nerf ad Azir?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Sinceramente stavo provando a imparare Azir da un sacco di tempo, e il principale difetto che ho trovato è: fare la combo completa (w,aa,q,aa) è davvero molto difficile perchè la w AVEVA un range piccolo, e essendo un mago con poco burst dovevi PER FORZA fare quella combo, perchè la q in se non faceva molti danni. Con il suo nuovo nerf hanno reso il suo gameplay ancora più difficile, se non impossibile, prima dovevi usare litri di mana per una combo completa con danni decenti, ora usi lo stesso mana, con la probabilità di non fare nemmeno l'attacco base col soldato appena lo spawni con la W, e facendo in totale meno danni perchè anche la Q è stata nerfata. {{champion:268}} {{item:3070}}","replies":[{"poster":"Vileblood Pyke","date":"2015-02-11T17:54:32.513+0000","up_votes":1,"down_votes":0,"body":"Perché nerfare Azir?\n\n\"Gli ipercarry, di solito, sono definiti da un inizio/metà partita più deboli (pensate a Tristana e Jax), perché poi **crescono con i loro oggetti chiave e le abilità**. I bulli in corsia funzionano al contrario: sono **potenti subito**, per poi sfumare a fine partita (come Renekton e Quinn). \n\nPoi c'è Azir, che fa entrambe le cose.\" {{champion:268}}","replies":[]},{"poster":"Lord Valotz","date":"2015-02-11T17:05:54.579+0000","up_votes":1,"down_votes":0,"body":"Secondo me la potenzialità di un buon Azir sta nell'impedire totalmente al proprio nemico di farmare durane la fase di lane grazie al suo range ed ai suoi soldatini, penso che i danni derivino dal logoramento dell'avversario. Poi in un teamfight prova a combatterlo con un azir che ti evoca 3 soldati di sabbia ti zona di ulti ed in più può pure lanciarti in aria. In ranked è uno dei campioni più bannati, anche se come dici è veramente uno dei campioni più difficili da giocare, se non proprio il più difficile in assoluto.","replies":[]}]}