{"poster":"Somnium Tristi","date":"2018-04-15T07:57:23.246+0000","title":"Placementspiele","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Warum ist dieses System, wie neue Spieler in das Ligensystem eingef&uuml;hrt werden, so bescheuert?\r\nStatt einfach in der untersten Liga anzufangen, um sich dann hochzuarbeiten wird man in den ersten Spielen nur st&auml;rkeren Spielern zugeteilt um da einfach unterzugehen.\r\nNat&uuml;rlich ist das auch sehr erfreulich f&uuml;r die Mitspieler, die ihren Unmut nur allzu gerne kundtun.\r\nEs ist wirklich motivierend wenn man sich st&auml;ndig beleidigen lassen muss.\r\nEinsteigerfreundlich ist wirklich was anderes.","replies":[{"poster":"CYPHΕR","date":"2018-04-17T08:38:04.707+0000","up_votes":1,"down_votes":0,"body":"Liegt einfach daran, dass die Mitte der Spielerverteilung im Ranked eben etwa bei Silber 3 liegt, d.h. 50% der Spieler sind besser und 50% der Spieler sind schlechter. Dazu kommt, dass sich in Silber insgesamt etwa 50% aller gerankten Spieler befinden. In Bronze befinden sich nur die unteren 20% der gerankten Spieler.\n\nRein aus mathematischer Sicht ist es also am wahrscheinlichsten, dass neue Spieler sich ebenso skilltechnisch im Silberbereich wiederfinden. Wieso sollte man sie also in Bronze V starten und sie damit das Matchmaking stark negativ beeinflussen lassen, wenn man doch schon ziemlich genau sagen kann, dass sie dort skilltechnisch nicht hineinpassen werden?","replies":[]},{"poster":"HyperionCH","date":"2018-04-15T10:42:13.567+0000","up_votes":1,"down_votes":0,"body":"Wenn man ab Bronze 5 beginnt, müssten dies auch smurfs.\n\nDann ist es für Bronze und Silber Spieler (die nicht smurfs sind) nahezu unmöglich zu climben.","replies":[{"poster":"Pure Cynicism","date":"2018-04-15T10:55:03.114+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=ip27PlEH,discussion-id=saKwLr94,comment-id=0001,timestamp=2018-04-15T10:42:13.567+0000)\n>\n> Wenn man ab Bronze 5 beginnt, müssten dies auch smurfs.\n> \n> Dann ist es für Bronze und Silber Spieler (die nicht smurfs sind) nahezu unmöglich zu climben.\n\nDas Argument hört man ja oft. \"Ich kann nicht climben, weil dort unten nur Smurfs sind\". Ein Blick auf die Rangverteilung widerlegt aber diesen Glauben. Nur 10% aller Spieler sind Platin+ und damit so gut, dass sie dort unten 1-5 carryn könnten. Aber längst nicht alle dieser Spieler haben überhaupt einen Smurf. Insofern ist die Wahrscheinlichkeit, einem Smurf zu begegnen, relativ gering.","replies":[{"poster":"HyperionCH","date":"2018-04-15T13:31:10.524+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IQuinnToWin,realm=EUW,application-id=ip27PlEH,discussion-id=saKwLr94,comment-id=00010000,timestamp=2018-04-15T10:55:03.114+0000)\n>\n> Das Argument hört man ja oft. &quot;Ich kann nicht climben, weil dort unten nur Smurfs sind&quot;. Ein Blick auf die Rangverteilung widerlegt aber diesen Glauben. Nur 10% aller Spieler sind Platin+ und damit so gut, dass sie dort unten 1-5 carryn könnten. Aber längst nicht alle dieser Spieler haben überhaupt einen Smurf. Insofern ist die Wahrscheinlichkeit, einem Smurf zu begegnen, relativ gering.\n\nDie Wahrscheinlichkeit ist im jetzigen System auch so gering, weil smurfs nach den Placements meist auch bereits Gold sind.\n\nWürde man das System wie vorgeschlagen ändern, wären smurfs nach den Placements high Bronze bis low Silber. Da würden auch Gold-smurfs die Games beeinflussen.\nWie viel stärker der Einfluss ist, kann ich nicht einschätzen. Jedoch besteht ein unnötiger negativer Einfluss, weshalb das jetzige System klar besser ist.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2018-04-15T11:09:07.033+0000","up_votes":1,"down_votes":0,"body":"Weil es einerseits das Elo System ruinieren würde. Und ja, die Details übersteigen meine Mathematik-Fähigkeiten. Aber wenn jeder Spieler, der in den Wettbewerb einsteigt, erst Mal den Durchschnitt um 600 bis 800 Punkte nach unten zieht, bricht das ganze System, welches darauf basiert, dass der Durchschnitt aller Spieler auf 1.200 Punkte kommt, zusammen...\n\nUnd der 2. Grund: Die meisten Spieler erreichen in ihrem Leben nie Bronze V. Das ist eine absolute Minderheit. Selbst Bronze III... es gibt durchaus LoL Spieler (und nicht nur Smurfs...) die niemals Silber verlassen. \nIch gucke ja hin und wieder Bronze V Spiele... und es ist das absolute Chaos. Es ist immer wieder echt faszinierend, was da abgeht. Warum sollte man das einem Neuling mutwillig antun? \n\nNatürlich  ist der Einstieg in ein laufendes Ligensystem immer schwierig. Weil es, egal wie man es anstellt, nur verdammt wenige Spieler gibt, die direkt dort einsteigen, wo sie hingehören. Das würde aber halt auch garantiert passieren, wenn jeder in Bronze V anfängt...","replies":[]},{"poster":"Pure Cynicism","date":"2018-04-15T08:06:03.853+0000","up_votes":1,"down_votes":0,"body":"In welchem anderen PvP-Spiel musst du denn keine Placements machen? Persönlich kenne ich nur noch OW und CS und bei beiden Spielen ist es dasselbe Prozedere. \n\nAußerdem hast du jetzt schon 8 Spiele gemacht. Bei deinem aktuellen Verlauf solltest du schon im mittleren Bronze angekommen sein. Das heißt, du bist bald ganz unten angekommen. So wie du es dir wünschst und wie es für Neulinge zu erwarten ist.","replies":[]}]}