{"poster":"dadimplayingrn","date":"2016-03-22T05:54:59.024+0000","title":"it must be true","subforum":"Gameplay","up_votes":3,"down_votes":2,"body":"every bronze game, it doesn&#039;t matter anymore, it doesn&#039;t matter how good you go, or how good you are, you NEED to understand, your TEAM, will never engage. EVER. you have to carry your games, you have to do whatever it takes to carry your team, playing like a female dog, and taking kills to snowball and carry, screw whatever your team says or complains about, you need to get fed and do your own thing. do what you need it&#039;s your elo.\r\n\r\ni played two ranked games today and realized i can&#039;t play my favorite champs anymore, cause my team won&#039;t engage when it comes to fights, i need to play champs that i can tank and do dmg and 1v4 and 1v5 if need be, cause it&#039;s not about a team game anymore this patch, season six isn&#039;t a good season imo. the death timers are too long, the turrets don&#039;t protect anymore, it&#039;s all about who slips up and taking them out then destroying the rest since you just danced under tower for 5mins till that one person messed up,\r\n\r\n\r\nyou can all say attitude around this is poor or whatever but i realized after a few games that it&#039;s my elo and none of these people are coming with me, only i am and i am gonna do whatever i can to get myself out, and after those two games i&#039;ve been winning some more and losing less.,,\r\n\r\njust some stuff i realized today. oh and /mute all is something else.","replies":[{"poster":"Lapis","date":"2016-03-22T06:06:31.300+0000","up_votes":2,"down_votes":0,"body":"To be fair, two games isn't a very large sample size. More data needed. \n\nhttp://www.bleachernation.com/wp-content/uploads/2015/04/zoidberg-sample-size-300x225.jpg","replies":[{"poster":"dadimplayingrn","date":"2016-03-22T06:14:40.262+0000","up_votes":1,"down_votes":0,"body":"i've played a lot of games, but these last two had me come to a realization","replies":[]}]},{"poster":"Privileged Jew","date":"2016-03-22T10:44:21.070+0000","up_votes":1,"down_votes":0,"body":"I'm looking at the OP's match history and I see a lot instances where he went something like 16-5 as Zed and still lost.  You know what this tells me?  He's probably never there for teamfights, and hardly ever presses objectives.  You must understand that 'victory' in this game is _one_ thing, and _one thing only_ : destruction of the enemy nexus.  You could be down 20 kills and still cause the enemy team to lose simply by split pushing.  \n\nIf you want to carry yourself out of bronze, choose one of two things : play a champion that can carry teamfights and spam pings to get your team to follow up each successful teamfight with an objective.  Do this - or play a ridiculous splitpusher like Tryndamere, Yi, Xin, or Twisted Fate.  Don't spend the entirety of the match roaming the map looking to catch people out, and then never being there for teamfights because you don't think your teammates will back you up.","replies":[{"poster":"dadimplayingrn","date":"2016-03-23T08:07:03.190+0000","up_votes":1,"down_votes":0,"body":"that exact instance you are talking about it was a 4v5, and are bot lane was gone in 10mins, we push lanes we try to take objectives, it's not super easy when you have a d/c top lane and a jungler who just wants to farm, all those kills were gained inside are base being destroyed. and trying to hold it up.\n\ni do my best to be there in team fights, but when the team is so low after the fight no one wants to push for towers, so we all end up backing or clearing lanes then they are all up again. if you're gonna look at my history don't go off what you assume is happening look into the exact games you can say something like that too","replies":[]}]},{"poster":"Mr Broken Wings","date":"2016-03-22T10:58:33.975+0000","up_votes":1,"down_votes":0,"body":"Luckyly 1 v 5 ing enemies in bronze is easy peasy lemon squeezy!\nIts sometimes easier then medium botgames!","replies":[]},{"poster":"Phenyxs","date":"2016-03-22T07:25:35.873+0000","up_votes":1,"down_votes":0,"body":"What there saying is true.  To play rank in bronze you mute the team and rely on carrying you're self if you want to win.  Not saying it isn't the same in upper ranks but bronze should be renamed busted elo","replies":[]},{"poster":"CaptainTatertits","date":"2016-03-22T06:06:16.761+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Phenyxs","date":"2016-03-22T07:22:37.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cpt Lemmiwinks,realm=NA,application-id=3ErqAdtq,discussion-id=tt5GGpaB,comment-id=0000,timestamp=2016-03-22T06:06:16.761+0000)\n>\n> You are a perfect example of a player who will never get out of bronze.\n\nWhy is that?","replies":[]},{"poster":"dadimplayingrn","date":"2016-03-22T06:14:10.849+0000","up_votes":1,"down_votes":0,"body":"or has played enough games in bronze to know","replies":[]}]},{"poster":"KVbqbFsC8e","date":"2016-03-22T06:14:58.787+0000","up_votes":1,"down_votes":0,"body":"If you think garbage teams are limited to only Bronze, you are sorely mistaken...","replies":[{"poster":"dadimplayingrn","date":"2016-03-22T06:19:06.522+0000","up_votes":1,"down_votes":0,"body":"oh i don't, i'm just saying for the vast majority of us who are in bronze","replies":[]}]}]}