{"poster":"Namlesshero","date":"2016-10-09T09:17:34.954+0000","title":"Road to Gold oder wie ich mit viel Geduld nach Gold strebe.","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":1,"body":"Hallo Zusammen ich bin Namlesshero \r\n{{sticker:slayer-jinx-wink}} \r\n\r\nIch m&ouml;chte hier jetzt nicht dar&uuml;ber schreiben wie entt&auml;uscht dass ich von Riot bin, sondern ich m&ouml;chte allen Bronze und Silber Spieler meine Erfahrung ans Herz legen. Seit gut 2 Wochen habe ich angefangen aktiv Ranked zu Spielen. Ich bin in diesen 2 Wochen von Silber 4 auf Silber 2 Aufgestiegen. Man hat mal schlechtere Games man hat mal Bessere Games. \r\n\r\nF&uuml;r mich war es die erste Woche extrem schwierig mich nicht &uuml;ber schlechte Mates aufzuregen, hingegen wenn ich Gefeedet habe war es nie meine Schuld. Das ist einfach Falsch, in diesen 2 Wochen habe ich Youtube vids geschaut, habe mich angefangen zu verbessern. Doch wie verbessere ich mich? \r\n\r\nAls aller erstes: Du bist immer mitschuld dass du verlierst. Ihr verliert als Team. Fertig, mal tr&auml;gst du mehr Schuld daran manchmal weniger. Doch was mach ich wenn ich jetzt ein Spiel verloren hab? Ganz einfach analysiere es. Denn das Analysieren des eigenen Gameplay ist einer der Wichtigsten schritte im besser Werden. \r\n\r\nBsp. gestern hatte ich ein Game mit Ashe. Es hat schon damit angefangen dass ich meine 20% Crit chance Runen dabei hatte. Dieser Fehler liegt bei mir niemand anderem. Dazu kommt dass einer der Immobilsten Champs gepickt habe (Ich war firstpick) und meine Gegner einfach mal die Blitz Vayne combo hatten. Wir haben das Spiel zwar gewonnen aber nicht wegen meinem Grandiosen Gameplay, sondern einfach weil ich gecarried wurde von unserer Mitte und Jungle. Doch was kann man jetzt aus dem Spiel lernen? \r\n\r\nMir wurde wiedermal bewusst wie wichtig dass es ist Runen zu kontrollieren. Ausserdem h&auml;tte ich viel Fr&uuml;her Roamen m&uuml;ssen als ich Festgestellt habe das das botlane nichts wird. Warden w&auml;re auch nicht schlecht gewesen. Sprich ich habe in dem Game auf ganzer Linie versagt. Das heisst aber nicht dass ich nicht in diese Liga geh&ouml;r, sonders solche Spiele sind der Grund warum ich noch nicht h&ouml;her bin und daran solltet ihr Immer glauben. \r\n\r\nWenn ihr n&auml;mlich eine Positive Winrate habt werdet ihr Aufsteigen, mit viel Geduld aber ihr werdet Aufsteigen! \r\n\r\n\r\nHave a nice Day \r\nNamlesshero\r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"OneMíLLí0n","date":"2016-10-10T05:19:57.887+0000","up_votes":1,"down_votes":2,"body":"Das Problem ist, wenn man als Supporter untwerwegs ist, hat meine keine Chance aufzusteigen, und sowas ich echt armselig, ständing bekomme ich Idioten ins Team, die meinen einfach zu feeden und die Schuld auf andere zu schieben. Es macht einfach keinen Spaß so zu spielen, wir Supporter können ein Spiel nicht Carrien, außer vllt der ADC, aber selbst das wird bei einer gefeedeten Top und Midlane extrem Schwer. Ich wurde S3 eingestuft, war 2 mal in der Promo zu 2 und bin jetzt auf S4 herabgestuft, weil ICH nur schlechte Deppen ins Team bekomme. Und das ist echt schlimm in dieser Elo.","replies":[{"poster":"CYPHΕR","date":"2016-10-10T10:42:36.408+0000","up_votes":2,"down_votes":0,"body":"Ich habe neulich auf meinem Smurf mit 4 Freunden (alle Silber 2-4) nen ganzen Samstag lang nur Normals gespielt. Ich habe dabei ausschließlich Support gespielt (obwohl ich bei weitem kein Support Main bin) und muss dir folgendes sagen: Selbst als Support kannst du Botlanes im Alleingang gewinnen und selbst nen Silber 4 Spieler, der selber so gut wie nie ADC gespielt hat, zu einem hypercarry werden lassen. \n\nIch war überrascht, wie schnell selbst Gold-Premade-Botlanes mit z.T. Blitzcrank und Draven gegen eine Janna die Botlane aufgeben und sich an den Tower zurückziehen, nur weil man nen Hook dodged und mit w und 2 Autoattacks bisschen Schaden am ADC macht. In fast jedem Match konnte ich durch ein bisschen gezielte Aggression im richtigen Moment fast 10 Min freefarm für meinen ADC schaffen und die Gegner alleine an den Tower zonen.\nDas Midgame carried der Support dann durch überlegene Roams und einen guten Aufbau von Vision. Objectives werden fast ausschließlich durch Vision oder das Fehlen ebendieser gesichert.","replies":[{"poster":"OneMíLLí0n","date":"2016-10-10T11:49:16.618+0000","up_votes":1,"down_votes":2,"body":"Wie gesagt, es liegt auch kaum an der Bot, war nur auf das \"Carryen\" bezogen, ich kann ja schlecht mit einer Janna 500 Schaden machen ;D\nes ist halt Unfair, das man halt so benachteiligt ist, wenn man Supporter spielt.","replies":[{"poster":"Sirrkas","date":"2016-10-10T11:51:46.149+0000","up_votes":2,"down_votes":0,"body":"Es gibt mehr Wege zu carrien, als 1vs5 zu gewinnen und am meisten Schaden auszuteilen.","replies":[{"poster":"OneMíLLí0n","date":"2016-10-10T12:02:02.841+0000","up_votes":1,"down_votes":1,"body":"Naja, aber nicht als Supp :D","replies":[{"poster":"Sirrkas","date":"2016-10-10T12:15:12.489+0000","up_votes":2,"down_votes":0,"body":"Doch. Sicht, Utility, CC. Es gibt vieles, womit du das Blatt wenden kannst.\n\nEin paar meiner Rankeds in Bronze habe ich als Support durch einzelne Wards gewonnen. Das war zwar noch Season 3, als ich gefühlt der einzige im Spiel mit Wards war. Aber ein Ace oder 3 von 5 Gegnern töten, weil sie neben dem Ward im Busch heimporten und nicht wissen, dass wir sie sehen, geht dann doch eher auf meine Kappe. ","replies":[]}]}]}]}]}]},{"poster":"OneMíLLí0n","date":"2016-10-11T10:53:31.402+0000","up_votes":1,"down_votes":0,"body":"Alles zum Kotzen, hatte mich wieder auf S3 gespielt kurz vor Promo zu 2 und jetzt wieder auf 4 es ist einfach Unmöglich bis Gold zu kommen, diese ganzen Idioten die meinen einfach 1v5 machen zu müssen sind nervig. Eben die runde, Bot extrem gewonnen, Top meint natürlich Teemo im Jng und Olaf zu feeden.\nUnd dann ist es auch noch unsere Schuld, diese Community ist fürn Arsc*","replies":[]}]}