{"poster":"Namlesshero","date":"2016-08-14T11:30:35.748+0000","title":"LP Verlust wegen eigenständiger Schliessung des Client","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo Liebes Riot Team. \r\n\r\nVieleicht habt ihr es schonmal geh&ouml;rt aber dieser Bug ist echt ziemlich unfair. Ab und an schliesst sich mein Lol Client einfach so, ohne irgendwelche anzeichen zur warnung. \r\nAlso bin ich im Ranked und mein Lol client schliesst sich genau zu der Zeit als der Timer auf 0 Geht aber in den Ladebildschirm komme ich nicht. Soweit sogut, kein untergang. Jedoch bin ich dann noch in einer unendlichen langen phase der: &quot;&Uuml;berpr&uuml;fe Warteschlangeposition&quot; h&auml;ngen geblieben. Als ich dann endlich wieder ins Spiel reinkam, haben die Anderen Remake gemacht. \r\n\r\nMeine Frage an die Community, hat sich euer Client auch schon Selbst&auml;ndig gemacht ? Oder steh ich alleine da mit dieser Erfahrung?","replies":[{"poster":"DaKuZá","date":"2016-08-17T17:17:18.754+0000","up_votes":2,"down_votes":0,"body":"Bei mir passiert das mit einer 100% Wahrscheinlichkeit bei der Hextechkammer ...","replies":[]},{"poster":"HyperionCH","date":"2016-08-15T09:55:59.626+0000","up_votes":2,"down_votes":0,"body":"Mir ist vielleicht maximal 2-3 Mal pro 1000 Games passiert, dass der Client ingame abstürzte oder beim Ladebildschirm.\nDer Client funktioniert also ingame in über 99.7 % der Games.\n\nWenn jedoch einmal der Client abstürzt, dann starte ich immer das Rapeir-Programm. Dann geht es eigentlich wieder.\nDer LP-Verlust ist sicherlich ein Zeichen von Riot, dass sie von den Spielern erwarten, dass sie auch sofort nach dem ersten Absturz das Problem beheben.","replies":[{"poster":"Namlesshero","date":"2016-08-17T17:16:05.713+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=ImBE6GqA,discussion-id=VABcQELh,comment-id=0001,timestamp=2016-08-15T09:55:59.626+0000)\n>\n> Mir ist vielleicht maximal 2-3 Mal pro 1000 Games passiert, dass der Client ingame abstürzte oder beim Ladebildschirm.\n> Der Client funktioniert also ingame in über 99.7 % der Games.\n> \n> Wenn jedoch einmal der Client abstürzt, dann starte ich immer das Rapeir-Programm. Dann geht es eigentlich wieder.\n> Der LP-Verlust ist sicherlich ein Zeichen von Riot, dass sie von den Spielern erwarten, dass sie auch sofort nach dem ersten Absturz das Problem beheben.\n\nDu hast mich Falsch verstanden, es ist nicht ingame abgestürtz, sondern in der Champselect, kurz bevor das spiel gestartet ist, aber es nicht unterbrochen wurde. Es ist ärgerlich und ich weiss das es absolut nicht oft nicht vorkommt. Ich wollte einfach nachfragen ob gewisse leute diese Problem auch haben oder ops einfach an mir liegt :) \n\nBtw, hab ich sofort nach dem absturz reagiert, leider war ich nicht schnell genug. \n\nIch finde auch diese Flamethreads absolut daneben. Wenn man ein Problem soll man dieses Melden, klar entstehen ärgerliche Situationen daraus, aber grad eine Ganze community zuzuflamen ist daneben. \n\nGrüsse Namless :)","replies":[{"poster":"HyperionCH","date":"2016-08-17T18:01:39.996+0000","up_votes":1,"down_votes":0,"body":"Für mich beginnt das Game bereits in der ChampSelect. ;)\nDamit sin din den 2-3 Male pro 1000 Games Abstürze auch in der ChampSelect inbegriffen.\n\nEs änderst sich jedoch nichts daran, dass man sich dann so rasch wie möglich darum kümmert, dass der Client wieder stabil läuft (z.B. Repair-Programm oder neu installieren), bevor man wieder Rankeds spielt.","replies":[]}]}]},{"poster":"Maíko","date":"2016-08-15T09:15:10.674+0000","up_votes":2,"down_votes":0,"body":"Bei mir passiert das manchmal, wenn ich mich in der Queue befinde und dann auf die Hextech-Werkstatt oder mein Profil gehe.\n\nIn der Champselect ist mir das zum Glück noch nicht passiert.","replies":[]}]}