{"poster":"BeatJoker","date":"2017-08-15T14:38:13.431+0000","title":"NOXsports sucht Bereichsleiter","subforum":"Clans & Teams","embed":{"description":null,"url":"https://www.noxsports.net/","image":"https://i1.wp.com/www.noxsports.net/wp-content/uploads/2017/08/11536520_medium.jpg?resize=138%2C138&ssl=1"},"up_votes":1,"down_votes":0,"body":"Sehr geehrte Damen und Herren,\r\n\r\nwie Sie schon im Titel lesen k&ouml;nnen, finden Sie im laufenden Text hier unsere aktuelle Stellenausschreibung f&uuml;r die Bereichsleitung League of Legends.\r\n\r\n**Was ist NOXsports?**\r\n\r\nNOXsports ist eine engagierte eSport Organisation, aus Deutschland. Die sich im professionellen eSports etablieren will und dabei jungen Talenten die M&ouml;glichkeiten bieten will zu wachsen. Unser derzeitiges Hauptaugenmerk liegt aktuell in den Bereichen League of Legends und Counter-Strike:Global Offensive, aber auch weitere Bereiche werden folgen. Das Motto das wir an den Tag legen hei&szlig;t NEVER SURRENDER, niemals Aufgeben und das werden wir auch nicht. Auch wenn es mal schlechte Zeiten gibt ,werden auch immer wieder Gute darauf folgen.\r\n\r\n**Warum sollten genau Sie NOXsports unterst&uuml;tzen?**\r\n\r\nNOXsports ist eine engagierte Organisation, die sich feste Ziele gesetzt hat und nicht wie viele andere Clans oder Organisationen eine Eintagsfliege ist.\r\n\r\n**Ausschreibungen:**\r\n\r\n_Bereichsleitung League of Legends_\r\nWir suchen f&uuml;r unseren League of Legends Bereich jemanden der diesen Verwaltet und mit uns zusammen erweitert.\r\n\r\nVorraussetzungen:\r\n- Du spielst League of Legends mindestens seit 2 Seasons\r\n- Du bist mindestens 21 Jahre alt\r\n- Du m&ouml;chtest im deutsch sprachigen eSports was erreichen bzw. bewirken.\r\n\r\n**Was bietet NOXsports?**\r\n\r\nDie Organisation NOXsports ist noch sehr jung und kann daher noch nicht viel bieten. Dies kann sich aber mit deiner Hilfe &auml;ndern. Denn wir werden ein Verg&uuml;tungssystem f&uuml;r unsere Mitarbeiter entwickeln, sodass sich jeder immer wieder was aus dem &ldquo;Mitarbeitershop&rdquo; holen kann.\r\n\r\nDar&uuml;ber hinaus bieten wir euch nat&uuml;rlich die ganzen Standards. (Website mit TLD, Teamspeak usw.)\r\n\r\n**Wo soll die Bewerbung hin und was soll rein?**\r\n\r\nWir w&uuml;nschen uns eine kleine Bewerbung, in der folgende Punkte abgekl&auml;rt werden:\r\n\r\n- Name &amp; Nickname\r\n- Alter\r\n- Wohnort / Land\r\n- Position / Bereich\r\n- Referenzen / Erfahrungen / Equipment\r\n\r\nDiese Bewerbung sendet man einfach an: ole@noxsports.net​\r\n\r\nUnd wir werden uns schnellst m&ouml;glich bei euch melden!\r\n\r\nMit freundlichem Gru&szlig; euer\r\n\r\nNOXsports Team\r\nhttps://www.noxsports.net","replies":[]}