{"poster":"EloElXDee","date":"2018-12-26T23:43:50.393+0000","title":"The real reason the game is so TOXIC","subforum":"Player Behavior","up_votes":1,"down_votes":21,"body":"Because of the keyboard barrier. If any of you little %%%%s would pull any of the shit you do in game in real life it would be the last time. Even something as simple as making people show their face would drastically change the game. Now proceed to bitch and moan telling me how I&#039;m wrong and I&#039;m an armchair warrior from the safety of the your own little safe space chair.","replies":[{"poster":"rujitra","date":"2018-12-26T23:46:18.438+0000","up_votes":9,"down_votes":0,"body":"If you pull the attitude you have in this thread in real life, it's likely to land with a punch in the face. Is that right? Probably not. Is it legal? Who knows, depends on if the police decide to press charges.\n\nNo, making people show their face will never happen. You're very correct that the anonymity of being behind a screen is what makes attitudes like yours more prevalent. But Riot is not going to require people to compromise their privacy just because people like you can't control yourself.","replies":[{"poster":"IcyPepper","date":"2018-12-27T01:16:25.574+0000","up_votes":1,"down_votes":0,"body":"Whew, no chill. {{summoner:11}} \n\nAnd I think I'd know a thing or two about chill.","replies":[]}]},{"poster":"Hammermancer","date":"2018-12-27T00:17:56.245+0000","up_votes":1,"down_votes":2,"body":"Actually i think the fact that it's toxic across all cultures tells me that the toxicity is a somewhat natural occurance, and that riots attempts to curb it have backfired in some ways which stops people from diffusing the situation with little mockeries against those who are HARD RAGING (Like you)\n\nSeriously though... I think it has more to do with the nature of people trying to outcompete eachother and talking shit then anyone actually being bad people, but i think a vocal minority on each side of the debate ruin it for everyone else\n\n\nI like it when i get shittalked, it's kinda fun, if i can shittalk back. Like I want to show my jungle that my dick is bigger but these days i can't say nothing, it's nothing personal it's just like... I been playing online competative games since the late 90's... it was always kinda toxic, but the community understood. It's really only after like 2014 that i saw big initiatives to 'end toxicity' as if it's even attainable. \n\nCall me an old man but I think the old way was better. Like we could shittalk, we could mute people who shittalked too much, and we knew where the line was. The line was don't get serious or you'll get hard trolled.\n\nNow if someone goes on a rant about how bad you suck for ten pages, and then convinced 9 people to report you for losing lane or something, you get banned for saying ***anything back*** because this is considered to be ***contributing to the toxicity*** but you can get false flagged by 9 reports too and supposedly be banned for that, so this puts you in a place where you feel stuck between a rock and a hard place\n\n\nthese days I only say intentionally shitty knock knock jokes in allchat, I don't go near my team because i'm afraid that if i miss a skillshot they're gonna start flaming relentlessly and I can't have the fun of taking a go back at them. \n\nLike the arguments for the vast majority of us were nothing more than banter. Telling people they're trash, telling the guy saying you're on a noskill champ that he's mad cuz bad is bannable now. Like seriously, I get that as a company you might not want hate speech, illegal content',or even threats of violence, but telling someone they suck in response to them losing lane against you is important. because people know that you're not serious... and if they don't they're fucking morons who.. well I can't go on because i like this account... but yeah","replies":[{"poster":"R107 Games","date":"2018-12-27T00:23:42.784+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Hammermancer,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=0004,timestamp=2018-12-27T00:17:56.245+0000)\n\n> but telling someone they suck in response to them losing lane against you is important. **because people know that you&#x27;re not serious... and if they don&#x27;t they&#x27;re fucking morons who..** well I can&#x27;t go on because i like this account... but yeah\n\nI would even add that things like \"kys\" and some hate speech could also fall in that description.","replies":[{"poster":"Hammermancer","date":"2018-12-27T00:57:26.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=R107 Games,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=00040000,timestamp=2018-12-27T00:23:42.784+0000)\n>\n> I would even add that things like &quot;kys&quot; and some hate speech could also fall in that description.\n\nyeah but i can excuse it being off limits because it's extremely contextual, has legal repercussions, and i don't personally agree with the kys to strangers thing myself so (No hostility here though, I get it). the reason i don't like to play with that concept is that I feel that many younger pc gamers are social outcasts to play games to escape a harsh social standing. Like think of all the nerds in the 2000's playing WoW, and how hard everyone made fun of them for being strange or goofy. Idunno, I get it, I think maybe people don't understand what it really means to be marginalized, since i see so many movements that claim to be against bullying or marginalization (No specific category) but usually get used as mechanisms to actively bully people .  Now let me state this, I see what bullying is, and I see what online harassment is, and frankly i'm smart enough to know that there is a line.","replies":[{"poster":"R107 Games","date":"2018-12-27T01:01:49.284+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Hammermancer,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=000400000000,timestamp=2018-12-27T00:57:26.069+0000)\n>\n> yeah but i can excuse it being off limits because it&#x27;s extremely contextual, has legal repercussions, \n\nIt has legal repercussions? Maybe you're thinking of death threats, but i don't recall encouragement of self harm to be met with legal repercussions.","replies":[{"poster":"rujitra","date":"2018-12-27T01:12:29.907+0000","up_votes":3,"down_votes":0,"body":"https://www.cnn.com/2017/08/03/us/michelle-carter-texting-suicide-sentencing/index.html","replies":[{"poster":"R107 Games","date":"2018-12-27T02:01:38.756+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=00040000000000000000,timestamp=2018-12-27T01:12:29.907+0000)\n>\n> https://www.cnn.com/2017/08/03/us/michelle-carter-texting-suicide-sentencing/index.html\n\nSo its contextual.\n\nThat was in the context on where the perpetrator was constantly *harassing* and *bullying* the victim with death encouragement.\n\nI don't think a simple \"kys\" alone will bring legal repercussions.","replies":[{"poster":"rujitra","date":"2018-12-27T02:07:30.959+0000","up_votes":1,"down_votes":0,"body":"Bullying someone for an entire game, and telling them to kill themselves, would likely be seen as the same if someone actually did it.\n\nThe first time someone kills themselves and tells their parents/friends/whoever that someone told them to in League, you best bet Riot's going to be subpoenaed for the chat logs and user information and there will be prosecution.","replies":[]}]},{"poster":"Hammermancer","date":"2018-12-27T01:25:58.975+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=00040000000000000000,timestamp=2018-12-27T01:12:29.907+0000)\n>\n> https://www.cnn.com/2017/08/03/us/michelle-carter-texting-suicide-sentencing/index.html\n\nHa you beat me to it\n\ni was gonna bring up the case in fall river MA from last year cause i'm a boston boy but yeah","replies":[{"poster":"rujitra","date":"2018-12-27T01:27:30.423+0000","up_votes":1,"down_votes":0,"body":"I'd encourage you to post it anyway - the more proof the less likely we'll see him respond with some illogical argument against it.","replies":[{"poster":"Hammermancer","date":"2018-12-27T01:33:37.456+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=0004000000000000000000000000,timestamp=2018-12-27T01:27:30.423+0000)\n>\n> I&#x27;d encourage you to post it anyway - the more proof the less likely we&#x27;ll see him respond with some illogical argument against it.\n\nI wouldn't say illogical, maybe a mix of poorly presented and not fully informed but he's not stupid... and it doesn't invalidate the whole of his argument either.\n\nI've seen good arguments for what he says that make some sense, I just don't agree with it on a personal level and have my view which by this point would have been changed.","replies":[]}]}]},{"poster":"Aladoron","date":"2018-12-27T19:53:18.542+0000","up_votes":1,"down_votes":1,"body":"I'm quiet sure, that a very close friend(in this case GF, if I remember well) and a total random stranger in an online game, would fall in different categories.","replies":[]}]}]}]}]}]},{"poster":"EvilDustMan","date":"2018-12-27T12:52:41.080+0000","up_votes":1,"down_votes":0,"body":"This is actually true, but you are getting downvoted because you sound like an armchair warrior.","replies":[]},{"poster":"CharDeeMcDenniz","date":"2018-12-27T12:48:49.785+0000","up_votes":1,"down_votes":0,"body":"i mean...duh\n\nwelcome to the internet, it's been this way since, forever","replies":[]},{"poster":"Telephone Booth","date":"2018-12-27T01:40:43.949+0000","up_votes":1,"down_votes":0,"body":"Okay... man work sucks i hate it i need a new job you armchair warrior.\n\nEdit: oh ya, and youre wrong.","replies":[]},{"poster":"CV Protostar","date":"2018-12-27T00:15:39.378+0000","up_votes":1,"down_votes":0,"body":"> \n> [{quoted}](name=EloElXDee,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=,timestamp=2018-12-26T23:43:50.393+0000)\n>\n> Because of the keyboard barrier. If any of you little %%%%s would pull any of the shit you do in game in real life it would be the last time. Even something as simple as making people show their face would drastically change the game. Now proceed to bitch and moan telling me how I&amp;#039;m wrong and I&amp;#039;m an armchair warrior from the safety of the your own little safe space chair.\n\n^ The reason this game is so toxic...","replies":[]},{"poster":"World peace plz","date":"2018-12-26T23:49:39.510+0000","up_votes":1,"down_votes":0,"body":"Bruh news flash people can loos themselfs into  a game. Forgetting its just a game. Do you really think people would say  the things they say in game ? Lets say you work on something in real life and  you screw up what can happen. Does your boss come to you call you a noob or a %%%%%%  or kid ? I dont think so.","replies":[]},{"poster":"Aladoron","date":"2018-12-27T19:48:42.258+0000","up_votes":1,"down_votes":1,"body":"Well, I do not see your face and address posted anywhere ;) So yeah, tell us the truth, sir keyboard warrior :D","replies":[]},{"poster":"R107 Games","date":"2018-12-27T00:14:06.217+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=EloElXDee,realm=NA,application-id=ZGEFLEUQ,discussion-id=nknfXnqr,comment-id=,timestamp=2018-12-26T23:43:50.393+0000)\n>\n> Because of the keyboard barrier.\n\nWhat's wrong with that? People interact with each other differently between irl and online.\n\nI mean just look at your post. You used the word \"%%%%s\" to describe us. You wouldn't call a random person irl that would you? But doesn't it feel good? To know you can express yourself freely online when you can't do it irl.","replies":[]}]}