{"poster":"CholeraToxin","date":"2015-02-22T17:06:32.883+0000","title":"Supportként rankeden","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok!\r\n\r\nSzeretek supportként játszani, de úgy érzem, hogy ebben a pozícióban aztán teljesen el vagyok ásva, ha a csapat többi tagja nincs a helyzet magaslatán. Ha a midesünk feeder akkor hiába játszom én akárhogyan {{champion:267}}-ként, semmi esélyem lehozni a meccset. Valaki tud ajánlani olyan supportot, akivel adott esetben le lehet hozni egy meccset? {{champion:25}} -t megvettem nemrég, de ő belőle se lehet könnyen átállni AP-carry-re, ha az ember az első 15 percben support tárgyakat vásárolt, ráadásul a Q-ja valahogy baromira nem áll nekem kézre, semmit se tudok vele eltalálni. Gondoltam még Leonára, de ő elég húzós árban van és csak akkor venném meg, ha tényleg működne.","replies":[{"poster":"Zooty","date":"2015-02-22T17:13:15.040+0000","up_votes":3,"down_votes":0,"body":"Véleményem szerint rosszul állsz a dologhoz. Szupportként nem az a dolgod, hogy \"lehozd\" a meccset, az a dolgod, hogy elérd azt, hogy a csapattársaid hozzák le neked a meccset. \nHa jól játszol (tökmindegy kivel), akkor elfeedelteted az adc-d annyira, hogy biztonságosan ott tudod hagyni farmolni akár 2v1-ben is, és ilyenkor bemehetsz segíteni a midesnek (akár egy gank formájában, hisz tele vagy cc-vel, vagy akár szimplán beállsz midre, és nem hagyod élni az ellenséget).\nSzóval ha ügyesen játszol akkor megnyered botot, ha még ügyesebben, akkor midet is, és nem is kell ap-ra gyúrnod (amúgy se érdemes, csak ha nagyon nincs magic damage a teamben.. Mides könnyen visszahozza magát ha egy kicsit segítesz neki)","replies":[]},{"poster":"Berény","date":"2015-02-27T11:09:46.216+0000","up_votes":2,"down_votes":0,"body":"Sziasztok! \n\n70-80%-ban supportolni szoktam rankeden (Gold teteje, Plat alja), szóval íme a tapasztalatok: \n\n-Szerintem tök mindegy, hogy kit hozol, a lényeg, hogy tudj vele. Minél többször hozod azt az adott hőst, akár nehezebb ellenfelek ellen, sokkal jobban ki tudod tanulni a saját határaidat. Ha elbuksz egy meccset, abból is tudsz tanulni, hogy mit hogyan kellett volna. Példaként, S4-ben {{champion:44}}  supporttal jutottam fel platináig (ahonnan aztán inaktivitás miatt lecsúsztam :( ). Minden meccs elején szidtak, hogy az a hős nem ér semmit. Aztán amikor a csapatharcok kellős közepén Q+{{item:3401}} +{{item:3222}} +{{item:3190}} -t elnyomtam akárkire, kb. egy 2. életnyit töltöttem vissza neki ezzel, ami rengeteg beetetés alapjául tudott szolgálni. \nSzóval a lényeg, hogy tanulj ki néhány hőst, és csak azokkal operálj, ne rankeden tanulj új hősökkel, az rizikós. \n\n-Kommunikálj az ADC-vel! Írd le neki, hogy milyen játékstílusod van, és ahhoz igazodjon. Én pl. mindig leírom, hogy defenzív játékos vagyok, ne ugorjon be, ne csináljon hülyeségeket, főleg ne az elején. Próbáljon meg biztonságos távolságból farmolni, és lvl 4-5 környékén pedig csinálhatunk egy támadást, ha a helyzet úgy adja. Az esetek többségében megértik, persze mindig akad 1-2 Vérpisti, aki {{champion:42}} -val lvl 2-n úgy kezdi a dolgot, hogy W-vel beugrik a {{champion:89}} /{{champion:104}}  arcába meghalni, és aztán engem tol le, hogy mit csinálok. Ilyenkor nem tudsz mit csinálni, remélhetőleg pár halál után rájön, hogy nem fogod magad megöletni az ő kedvéért, és elkezd változtatni a játékstílusán, vagy tovább flame-el, és elbukjátok a meccset. Ez ilyen, nem tudsz ez ellen mit csinálni. \n\n-Ha minden kötél szakad, és tényleg egy Carry supportot keresel, akkor {{champion:161}} supportot tudom ajánlani. Csak tanuld meg tartani a távolságot, ha egy {{champion:53}} mindig behúz, az nem túl jó. Leírok pár itemet is Vel'kozra: {{item:3092}} +{{item:2049}} (ez ugye alap) + {{item:3165}}  + {{item:3136}} + {{item:3089}} . A jó dolog benne, hogy 95%-ban te fogod a legtöbbet sebezni a csapatodon belül, de akár az egész játékban. Viszont ha ezt hozod, nem árt bannolni {{champion:59}}-t, ővele nem lehet mit kezdeni, rád ugrik, megöl. \n\n-Végezetül itt egy nagyon jó leírás az egész Bot Lane-ről, érdemes elolvasni, sokat tud segíteni. \nhttp://forums.eune.leagueoflegends.com/board/showthread.php?t=723240\n\nBocsi a sok szövegért, remélem tudtam segíteni.","replies":[]},{"poster":"ferenchawke","date":"2015-02-22T18:37:37.124+0000","up_votes":2,"down_votes":0,"body":"Supportal is lelehet hozni egy játékot.Én anno thrsh supportal huztam le mert ugy játszotam hogy szó szerint cask autoatackolniuk kelet a csapátrsaimnak hogy meghaljon az elenfél.De nem minden játékot tudsz megnyerni és ezt nem ugy kell egyrészröl felfogni hogy fu mert roszak a csapatársaim hanem ugy hogy az elenfeleim jobbak.De amúgy vigyél leonát mert az nagyon noob friendly.Ez alat azt értem hogy ha te belandulsz minden stun/slow kombodat és még pajzsod is van és ugy vesztetek az már nem a te hibád.De ez minden bajnokra igaz.Erre jó példa megintcsak a thresh supportom.olyan csapaátrsaim voltak hogy minden kombomat belandoltam még pajzsot is adtam meg le exhaustoltam az ellenfelem azt nembirták öket megölni.Szóval leonát nagyon tudom neked ajánlani.","replies":[]},{"poster":"Lord Babkonzerv","date":"2015-02-27T16:41:59.739+0000","up_votes":1,"down_votes":0,"body":"Sztem próbáld ki {{champion:53}} -t. Tipikus példa: rosszul lanel és farnol az adcd, jól helyezkedsz és az enemy adc-jét berántod turret alá. Ott még a legunskillebb adc is tud kill-t szerezni'\n, mert csak bele kell lőnie egyet és a turret elvégzi a ''piszkos'' munkát. Ha blitzet bannolják én rendszerint {{champion:43}} -t hozok. Defensiven játszól early-ben, lepokolod a HP-jukat, majd berohansz az E-vel stunnolsz a W-vel és rányomod az ulti Q-t. Nem lehet elrontani. :)","replies":[]},{"poster":"Eshu","date":"2015-02-22T19:57:47.282+0000","up_votes":1,"down_votes":0,"body":"Annie support egy időben menő volt. És ha nem annyira nyomulsz a support itemekért - megveszed a kékbicskát meg a sightstonet és utána AP-ra építesz lehet egy másodlagos carry. Zyra vagy Vel'koz még hasonló pozícióban lévő bajnok. Velkoz mindmáig népszerű anniet és zyrát újabban kevesebbet látni.","replies":[{"poster":"New Dawn","date":"2015-02-22T21:34:01.317+0000","up_votes":1,"down_votes":0,"body":"zyrában az a rossz, hogy kemény 2mp alatt ki lehet szedni. Míg egy annie a pajzs miatt sokkal tankosabb, még ha AP-re építed akkor is.","replies":[{"poster":"Eshu","date":"2015-02-23T04:28:18.485+0000","up_votes":1,"down_votes":0,"body":"Persze hibája mindegyiknek van nem véletlen nem azt hozzák minden meccsben. Aki tudja használni annak a kezeiben tud erős lenni de valóban squishy. Mondjuk Vel sem keményeb azt mégis használják elég sokat.","replies":[{"poster":"New Dawn","date":"2015-02-23T14:49:24.484+0000","up_votes":1,"down_votes":0,"body":"igazából én sosem játszottam vel koz-al, de azt tudom, hogy ha ellenem van akkor legszívesebben topra mennék. Velnek az ultija olyan mint egy katarina ulti( azért nem olyan hatékony, hogy 1sec alatt triple) csak távolról. Én mint squishy support nem igazán tudok megállítani egy vel koz ultit, mert mire odaérek megsut.","replies":[]}]},{"poster":"Shirodrake","date":"2015-02-22T23:05:04.237+0000","up_votes":1,"down_votes":0,"body":"Zyrát akár tankosra is építheted, mivel a sebzése zömmel a virágaiból származik, azon meg úgyis csak 20%-os az AP ráta.","replies":[]}]}]},{"poster":"New Dawn","date":"2015-02-22T18:53:38.420+0000","up_votes":1,"down_votes":0,"body":"Próbáld ki sorakát. Soraka a tobbi lanet is megtudja nyerni egyetlen gomb nyomással( R), viszont boton vagy az enemy támad eloszor, vagy passzív lane lesz, mert soraka nem tud harcot kezdeményezni.\n\nVagy esetleg Jannát. O is nagyon jó adc védelmezo. ","replies":[{"poster":"manaszon","date":"2015-02-22T21:37:47.048+0000","up_votes":1,"down_votes":0,"body":"Ez szerintem nem igaz. Az biztos, hogy Sorakaval nem fogsz kezdeményezni, de az ADCd simán megindulhat, mert ha netán rosszul is sül el a dolog, nem valószínű, hogy meg fog halni a sok healed miatt, illetve ha ügyesen rakod le, akkor még egy rootod is van, amivel megincsak megállíthatod őket, hogy megöljenek titeket, vagy épp biztosíthatod a killt. Szerintem ezért jó Soraka az agresszívebben játszható ADCkkel.","replies":[{"poster":"New Dawn","date":"2015-02-23T14:47:45.519+0000","up_votes":1,"down_votes":0,"body":"viszont ehhez egy agresszívan játszó adc kell. De amúgy igazad van.","replies":[]}]}]},{"poster":"Shirodrake","date":"2015-02-22T21:21:15.419+0000","up_votes":1,"down_votes":0,"body":"Én most a Trinity-s Sonát kezdem megkedvelni.\nSightstone, Trinity, majd tank/support itemek igény szerint. Elég szép sebzése van és jól bírja a strapát, valamint rendkívül mobilis.","replies":[]},{"poster":"nmoreKharon","date":"2015-02-22T17:26:47.300+0000","up_votes":1,"down_votes":0,"body":"Braum. :D tipikus pelda a kovire : bena adc ( de legalabb farmol) op Braum kozel mindentol megveded az adc-t. \"Csak\" hp kell neki es maris van sebzesed ( lasd Q spelljet) + eletben is mard(hatsz).","replies":[]}]}