{"poster":"No6Claymore  HxH","date":"2019-05-03T16:58:22.275+0000","title":"Hogy érjem el, hogy saját magam szintjén lévő ellenfeleket kapja?","up_votes":1,"down_votes":1,"body":"Mostanában kezdek kiégni. Rájöttem, hogy miért. Úgy gondolom, hogy nekem van olyan silveres szintem. Ez jó, én belátom, de ez a csicska faszom rendszer, úgytünik ezt nem igazán veszi figyelembe.  Az, hogy az ellenfeleimnek, legalább is lanen, hogy közük nincs a silverhez, arra az életem feltenném. \r\nSzóval a játékok nagy része, hogy nálunk szar vagyok én, mint állat és esetleg az enemybe szintén van egy kula játékos, majd az emberek játszanak a meccseimen 4v4-t.  Mondjuk ez mostanában nem jön be.  Az utóbbi 30 meccemből, legalább 25-öt kikaptam. Abból az 5 winből kb 2 volt az, ahol én is hozzátettem valami a meccshez.  A többi meccs az volt, hogy az én csapatomban volt több smurf, és megnyerték a gamet.  Nem tudom, hogy ki hogy van vele, de nekem az nem win, mikor a többiek megnyerik nekem a game-t.  Nem azért vagyok/voltam silverben, mert én annyira szeretem az ezüst keretet.  Egy platos, gold 1-2-es ellen simán kiszopok. És ezzel semmi baj nincsen, mert mindenkinek van egy szintje,  ahol játszik. Nem érzem magam hibásnak, mikor a masterest otp anivia elkeni a számat, mert ez a termeszétes, nem azért van ő ott ahol van, hogy egy silveres elverje.  A normális kurvára az lenne, hogy az esetek nagyrészében egy silveres, ne találkozzon naponta 2-3 eloval nagyobbal. Ez szerintem a silveresek 90%-a így gondolja. Tudom, hogy egyoldalú, mert a fasszopó platos/diás csicskáknak marha fun, mikor többszörösen gyengébb ellenfelek ellen, mennek bot gameket, aztán röhögnek hogy felbaszom magam. Ez nem kell mit tagadni, mert ha nem így lenne, akkor nem lenne ennyi másod acc, csak mert fun. Az ilyeneknek csak annyit kívánok, hogy az utolsó dolog amit életükben látnak, az egy afrikai aids-es dárdája legyen, amint az alfelük felé közelít. Aki ezen fog fenn akadni, az szerencsésen magára vette az igazságot..... Térjünk vissza a fasz rendszerre.  25 lose majdnem egy huzamban. Ennyi meccsből, simán lelehetne szűrni, hogy én nem azon körökbe való vagyok, amin a rendszer szerint vagyok. Nyugodtan nézzétek meg a match historym.  Az utóbbi napokban 1 db jó gamem, ha volt.  Ha valaki folyamatosan veszít, akkor nem gyengébb szintre kéne rakni az adott illetőtt, ahol esetleg nem feleslegesen megy ki a lane-re!? Szerintem nagyon is, de....\r\nKb 30-40 további lose kéne, hogy felfogja ez a rákos szar játék, hogy  gyengébb vagyok, mint amit ő gondol..... \r\nEz az mmr rendszer egy vicc. Egy csomó lose után továbbra is ugyanolyan erős ellenfeleket kapok. Most nyerek majdnem 20 gamet egyhuzamban, aztán legközelebb AK-val vagy Túróstésztával találom szembe magam vagy mi a geci??? \r\nA nyelvezeten nem fogok változtatni, ezt érdemlik azok a gecik, akiket a bronzbikába kellene zárni oszt jól alájuk gyújtani, hadd érezzék a fájdalmam.","replies":[{"poster":"No6Claymore  HxH","date":"2019-05-03T18:51:52.322+0000","title":null,"up_votes":1,"down_votes":1,"body":"https://kepkuldes.com/image/HKkCyt  \n\nez a játék nem nekem való.....","replies":[{"poster":"PowerPein","date":"2019-05-06T02:44:06.110+0000","title":null,"up_votes":2,"down_votes":0,"body":"Akkor nem kell vele játszani.","replies":[]},{"poster":"kalamona90","date":"2019-05-04T05:28:09.305+0000","title":null,"up_votes":2,"down_votes":0,"body":"Hát most erre mit mondjunk? Gondolom tudod hogy megérdemelted... Sose értettem az ilyen játékosokat. Értem hogy feszülté tesz a játék, mert egy verseny játék amiben győzni akarsz. DE csak arról az egy dologról feledkezik meg mindenki hogy EZ CSAK EGY JÁTÉK. Nem az életed nem fogja befolyásolni a jövőd...stb. A játékos akinek a halálát kívánod az egy ugyanolyan gyerek mint te magad egy ember aki szórakozni ment oda.","replies":[{"poster":"No6Claymore  HxH","date":"2019-05-04T17:27:44.612+0000","title":null,"up_votes":1,"down_votes":3,"body":"Nem vagyok empatikus. A  csontsovány afrikaikon is nevetni szoktam egy jót.  Nem bírok együttérezni másokkal. Szarok mindenkire magasról. \nAki keresztbe tesz nekem, az haljon meg nyugodtan. Ha amiatt tenné meg, amit írtam az sem hatna meg.  \nAmugy ha nem egy kalap kula lenne a rendszer, akkor sosem találkoznék ilyenekkel.\nMikor nagyjából a meccseid 90%-át elveszted, akkor meg még úgysem tudom visszafogni magam.  Az a meccs azthiszem a 9. lose volt egyhuzamban.  A riot vezérigazgatóját röhögve fejbe lőném, mert megérdemelné.","replies":[]}]}]},{"poster":"kalamona90","date":"2019-05-03T17:32:20.403+0000","title":null,"up_votes":1,"down_votes":0,"body":"lvl 28 an hogy akarsz magasabbra lépni? Érd el a 30-at és ranked. Akkor kiderül hogy meddig jutsz fel. Akkor is lesz gyengébb és erősebb csapattársad. De jól jegyezd meg ha ezt a nyelvezetet fogod használni velük szemben is akkor lehet bármennyire sértődött vagy nagy arcú ki fognak banolni. Megfelelő hozzá állással és odafigyeléssel lehet előtted jövő. Bele néztem 1-2 meccselőzményedbe. És van néhány nagyon szép statisztikád.","replies":[{"poster":"No6Claymore  HxH","date":"2019-05-03T18:03:17.965+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azok véletlenek voltak .  Már 1 accomat bannolták. Silvernél tovább nincs feljebb, nekem.  Nem a csapattársakkal van baj, hanem az ellenfelekkel.  És igazából a kedvem is egyre jobban megy el. Nem bírok egy kurva meccset megnyerni, ahol valamit is hozzátettem a játékhoz.","replies":[]}]}]}