{"poster":"CHB johnjadda","date":"2015-09-08T19:47:30.085+0000","title":"Krankheit: Toxic","subforum":"Spielerverhalten & Moderation","up_votes":9,"down_votes":8,"body":"Krankheit: Toxic\r\n\r\nBei der WHO ( World Health Organization ) gehen vermehrt Berichte dar&uuml;ber ein das eine neue h&ouml;chst Gef&auml;hrliche Krankheit\r\nauf den Menschen zu kommt. Die infizierten werden als toxisch zu deutsch giftig  bezeichnet und zeigen wiederholt starke\r\nAggressionen gegen&uuml;ber anderen Mitmenschen. Bisher ist wenig dar&uuml;ber bekannt wie man sich damit infiziert weder noch\r\nwie schlimm sich eine Infizierung auswirken kann. Das einzige was man bisher wei&szlig; das diese Krankheit oft mit dem Spiel\r\nLeague of Legends &uuml;bereinkommt und dort stark hohe Zahlen an infizierten zu verzeichnen sind. Das Unternehmen Riot Games\r\nversucht dagegen vorzugehen und es nicht zu sehr an die &Ouml;ffentlichkeit gelangen zu lassen. Wir haben dort nachgefragt und\r\nman sagte uns das sie es unter Kontrolle bringen und man vor allem bekannte infizierte &ouml;ffentlich an den Pranger\r\nstellt um andere vor dieser Krankheit zu warnen.\r\n\r\nWir von Leagoleo wollen dieser Geschichte nachgehen und nachforschen wie man sich am besten Sch&uuml;tzen kann.\r\n\r\n\r\nNach einigen aufwendigen Tests scheinen wir die Hauptursache f&uuml;r eine Infizierung ausgemacht zu haben.\r\nEs handelt sich hierbei um gewonnene ELO die man in League of Legends durch Ranglisten Spiele bekommt.\r\nUmso h&ouml;her die ELO ist desto wahrscheinlicher ist es das man sich Toxic einf&auml;ngt und langsamm aber sicher f&uuml;r Mitmenschen\r\nzur Gefahr wird. Auch konnten wir raus finden das die Position Marksman ( Sch&uuml;tze ) anzeichen f&uuml;r einen Ausbruch der \r\nKrankheit bringt, vorallem der Champion &quot;Vayne&quot; sorgt daf&uuml;r das man schneller toxisch wird. Ein Faktor spielt nat&uuml;rlich\r\nauch die Zeit die man wohl f&uuml;r dieses Spiel investiert, bis zu 50 Minuten oder l&auml;nger k&ouml;nnen Spieler Gefahr laufen sich\r\nmit der sehr gef&auml;hrlichen Krankheit Toxic anzustecken.\r\n\r\n\r\nWir sprachen mit einem infizierten.\r\n\r\nLeagoleo: &quot;Hallo Herr.**** k&ouml;nnen sie uns irgendwas sagen was dazu genau gef&uuml;hrt hat das sie toxisch wurden&quot;\r\n\r\nAnonym: &quot;Keine Ahnung, ich versuche wirklich hart zu carrien aber diese NOOBS ja. Also die wollen einfach nicht.\r\n\tScheiss Support, Scheiss Jungler wei&szlig;te was ich meine&quot;\r\n\r\nLeagoleo: &quot;Das h&ouml;rt sich ja wirklich be&auml;ngstigend an&quot;\r\n\r\nAnonym: &quot;Ja und dann werd ich auch noch reported weil ich den sage wie scheisse sie sind, stellen sie sich das mal vor&quot;\r\n\r\n\r\n\r\nToxic, heute noch im Internet morgen eine Epidemie?\r\n\r\nF&uuml;r betroffene werden wir selbstverst&auml;ndlich eine Hotline einrichten wo sie uns Probleme schildern k&ouml;nnen und versuchen\r\nwerden zu helfen.\r\n\r\n\r\nPassen sie auf! DAS SIE NICHT TOXISCH WERDEN!\r\n\r\nIhr Johnjadda.","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T19:59:52.602+0000","up_votes":3,"down_votes":2,"body":"Ich habs nicht gelesen, weil ich durch schlechte Enter-Tastennutzung zu oft nach links und rechts gucken musste.\n\nUnd wahrscheinlich ist es sowieso wieder nur QQ-Text","replies":[{"poster":"Maexle","date":"2015-09-08T20:06:12.749+0000","up_votes":7,"down_votes":2,"body":"Nein, er versucht nur witzig zu sein, indem er soweit geht toxisches Verhalten als Krankheit zu bezeichnen ( mehr kann ich nicht wirklich sagen, da ich es nur überflogen habe) {{champion:17}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T20:07:13.745+0000","up_votes":2,"down_votes":1,"body":"Heißt das ich muss es jetzt doch lesen? Naaaaaguuuuuuuuut...","replies":[{"poster":"Maexle","date":"2015-09-08T20:07:59.864+0000","up_votes":6,"down_votes":1,"body":"Naja von müssen kann nicht die Rede sein  {{champion:17}}","replies":[]},{"poster":"xFlack","date":"2015-09-08T20:47:13.226+0000","up_votes":2,"down_votes":1,"body":"Du könntest das in ein video packen {{champion:17}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T20:49:46.125+0000","up_votes":2,"down_votes":1,"body":"Da ist wohl jemand informiert :D\n\nLeider werde ich die \"Forumswoche\" erstmal aufgeben. Die Analytics dazu waren viel zu grottig.","replies":[{"poster":"xFlack","date":"2015-09-08T20:55:36.062+0000","up_votes":4,"down_votes":1,"body":"ich fands ganz okey, du müsstes es mit mehr humor rüber bringen{{champion:17}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T20:59:11.191+0000","up_votes":3,"down_votes":1,"body":"Ja da hab ich meine Probleme mit. Es ist schwer seinen Bildschirm zum lachen zu bringen.","replies":[]}]}]}]}]}]}]},{"poster":"Maexle","date":"2015-09-08T20:00:12.521+0000","up_votes":5,"down_votes":1,"body":"{{champion:17}}","replies":[]},{"poster":"Kaitri","date":"2015-09-08T21:49:45.526+0000","up_votes":4,"down_votes":1,"body":"hat potenzial, finds aber nicht witzig","replies":[{"poster":"Haudruppmoor","date":"2015-09-15T06:34:05.399+0000","up_votes":2,"down_votes":0,"body":"Jepp, find ich auch. Knapp daneben ist halt auch vorbei. Humor liegt eben immer im Auge des Betrachters. Ich find zum Beispiel sowas witzig :\n\n\"Das einzige, was schlimmer ist als eine Spinne im Zimmer, ist wenn Du die Spinne nicht mehr findest\" oder\n\"Stuhlgang und Demenz passen nicht gut zusammen. Man rennt, aber weiß nicht wohin ...\"\n\nOk, ok, die waren schlecht ;)\n\nDa find ich den hier witziger : http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/JzwA2eX6-an-all-die-flamer-smurfs-main-x-caller-und-hater-feeder-und-pingpsychos\n\nAber ich würd dem TE sagen mach weiter so, die Richtung is schonmal ok . :)\n\nmfg\nMB","replies":[]}]},{"poster":"oasterlukas","date":"2015-09-09T07:27:34.321+0000","up_votes":2,"down_votes":1,"body":"Ganz im Ernst die Downvotes verstehe ich nicht, meiner Meinung nach, eigentlich recht gut gemacht!","replies":[{"poster":"Kaitri","date":"2015-09-09T19:11:43.441+0000","up_votes":2,"down_votes":0,"body":"ich finde es ist nicht schlecht, aber nicht witzig genug.","replies":[{"poster":"oasterlukas","date":"2015-09-10T11:45:11.023+0000","up_votes":1,"down_votes":0,"body":"Ja, Sinn für Humor hat nicht jeder bzw ist bei jedem verschieden. Aber deswegen ein Downvote? Ich meine neutral sein wenn es jemand nicht witzig findet wird hier eher angebracht sein.","replies":[{"poster":"Kaitri","date":"2015-09-10T17:07:08.658+0000","up_votes":2,"down_votes":1,"body":"ich hab kein downvote gegeben. mache ich generell eher selten. ich downvote meist nur kommentare wo jemand sich über dinge aufregt von denen er absolut keine ahnung hat und die es schon 100 mal gibt.\na.k.a. das typische \"grundlos reportet, hab nix getan und riots kack system hat mich trotzdem gebannt\"","replies":[]}]},{"poster":"GummibaumXYZ","date":"2015-09-09T22:45:19.123+0000","up_votes":1,"down_votes":0,"body":"das hast du doch schon gesagt?","replies":[{"poster":"Kaitri","date":"2015-09-09T23:20:16.095+0000","up_votes":1,"down_votes":0,"body":"nein habe ich nicht. buh","replies":[]}]}]},{"poster":"Leberwurstfrau","date":"2015-09-09T09:01:45.208+0000","up_votes":2,"down_votes":3,"body":"Ja verstehe ich auch nicht. Könnte sicher noch den ein oder anderen Witz vertragen, aber Downvotes hat es nicht verdient.","replies":[{"poster":"Der Großmugister","date":"2015-09-09T10:17:18.504+0000","up_votes":3,"down_votes":2,"body":"Also ich fand die idee witzig, die umsetzung dann nur leider nicht, auch daran, dass es mit steigender Elo schlimmer wird, entspricht nicht meiner Meinung.\nDennoch, Downvotewürdig fand ichs nicht, da hat sich immerhin Jemand ein wenig Mühe gegeben um zu unterhalten, da gibt es immer leute die es witzig finden und Diese, bei denen es nicht der Fall ist. Gerade bei einem Thread, der eindeutig der Unterhaltung dienen soll, empfinde ich Downvotes als eine Art \"ausbuhen\" und nicht wie sonst als \"nicht meine Meinung\" da ist es ein wenig unhöflich.","replies":[]}]},{"poster":"SoloQisMentlBoom","date":"2015-09-09T08:56:37.388+0000","up_votes":2,"down_votes":1,"body":"Naja viele Downvoten ohne zu lesen. Sie denken so wie ich: Titel lesen --> Sicherlich QQ-Text\nIch für meinen Fall Downvote nicht gleich, aber es machen geügend so.","replies":[]}]}]}