{"poster":"CHB johnjadda","date":"2016-04-14T04:30:56.176+0000","title":"Keine Grenzen...","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":4,"body":"Hallo liebes Riot Forum Team!\r\n\r\nMir brennt schon sehr lange eine Frage unter den Fingern&auml;geln und ich frage mich oft macht es &uuml;berhaupt Sinn euch zu fragen. \r\n\r\nVor nicht all zu langer Zeit, in einem umk&auml;mpften Schlachfeld Namens Summoners Rift. Da traf ich ihn, er der 1 Jahr im Deutschen Tribunal gearbeitet hat ( angeblich ). Wir hatten gerade eines dieser Spiele, dieses wo du schon v&ouml;llig generft bist von den ganzen netten Beschw&ouml;rern die man davor getroffen hat. Und nat&uuml;rlich ist auch in diesem Spiel einer dabei der wohl Probleme hat, mit sich? In der Familie? Auf jeden Fall war es eines dieser Spiele wo ich versuchte ihn zu beruhigen, ihn zu warnen das er vielleicht durch seine Art den Account verlieren k&ouml;nnte und das doch totaler Mist w&auml;re! Und aus dem nichts schaltete er sich ein, er der 1 Jahr im Deutschen Tribunal gearbeitet hat ( angeblich ). Und da das Game eh total Sinnlos war schrieben wir ein wenig. Er erz&auml;hlte davon das sich das Tribunal haupts&auml;chlich nur um die Hohen Divsionen k&uuml;mmert und alles unter Platin nicht so die Aufmerksammkeit bekommt. Die Normal Spiele wohl so gut wie gar nicht. Naja und ich denke mir so, H&ouml; der kann ja viel erz&auml;hlen! Aber irgendwie hat sich das so festgesetzt bei mir im Kopf und ab und zu muss ich wirklich daran denken. Vor allem wenn ich mir vor Augen halte das ich seit Season 3 schon wirklich viele Reports eingesendet habe und gerade mal 4 ! R&uuml;ckmeldungen kamen das der Spieler bestraft wurde.\r\n\r\nMan bekommt ja viel zu h&ouml;ren, heute wurden Grenzen &uuml;berschritten und wenn ich sehe das der machen kann was der will. Hmm dann frage ich mich wirklich ob man den Chat abschaltet und einfach nur noch sein eigenes Ding macht bzw. gegebenfalls mit Freunden.\r\n\r\n\r\nEs ist 5 Uhr morgens und wir spielen ein Normal Game wo es um ABSOLUT NICHTS GEHT. Ok um die Ehre? Um zu zeigen ich bin der beste? Jetzt werden wieder einige kommen und schreiben, BOA der pickt aber Teemo ADC. Ne du, das geht nun wirklich nicht. EY das ist nicht META. Und er ist nicht Mobil. Und man es ist Teemo. Bitte...\r\n\r\nWir spielen Teemo/Cassiopaia Botlane, ERNST. Wollen gucken was m&ouml;glich ist, hatte auch schon mehrmals davor mit Teemo als ADC gewonnen. Aber dieses Game lief einfach nicht, Diamond 5 Caitlyn und Morgana als Support. War sehr sehr unlustig auch f&uuml;r uns. Haben nicht aufgeben als wir gestorben sind, versucht zu helfen als Elise im Jungle angegriffen wird. Wir kommen helfen und sie l&auml;sst uns sterben, wir sind ja trolle... Aber wir spielen weiter, ERNST.\r\n\r\nUnd dann kommt irgendwann LeBlanc, 3/0/1 wirklich heftig am Start. Spiel des Lebens. Und ja f&auml;ngt an uns zu erz&auml;hlen was das denn soll das wir trollen und warum immer sie/er. Alles ist so ungerecht.\r\n\r\nWir erkl&auml;ren das wir nicht trollen, nur einfach die lane verlieren. Doch das geht ja wohl mal gar nicht, die Lane verlieren. Ne die MUSS man immer gewinnen. Ist klar n&auml;!\r\n\r\nAuf jeden Fall wird es immer schlimmer, er berichet danach ins Ranked zu wechseln um dort zu trollen. So macht er das immer man soll sich seine Stats nur anschauen dann wei&szlig; man Bescheid! Er verflucht uns, das er jetzt wieder trollen muss und das andere wegen ihm verlieren. Denn so macht er das immer. Er! Ja ab dort wusste ich es ist ein ER, wiederholte sich gerne. Wollte uns auf zeigen wie ERNST ihm das ist. Ich schrieb dann was mit ihm los ist, was ist passiert das er so voller Hass ist. \r\n\r\n\r\nDarauf kommt das er sich w&uuml;nscht das ich sterbe und meine Famile am besten mit.\r\n\r\nDann schreibt er nochmal das jetzt andere wegen ihm leiden m&uuml;ssen. Aber sie leiden in Wahrheit wegen uns....\r\n\r\nJa gut muss ich das ernst nehmen? Das muss ich mit mir selbst ausmachen aber finde ich das Okay das er wohl h&auml;ufiger so durch das Rift zieht und Leute MASSIV Beleidigt ohne bestraft zu werden? Nein!\r\n\r\nIch Reporte ihn und denke mir ach bringt doch eh nichts. Dieses Gef&uuml;hl hab ich schon immer wenn ich diesen Button benutze. Nicht umsonst schreiben immer wieder Spieler &quot;H&auml;h&auml;h&auml; ich sag was ich will denn Tribunal geht nicht H&auml;h&auml;h&auml;&quot;\r\n\r\nIch schaue mir sein Profil an und bekomme die Best&auml;tigung f&uuml;r das was er schrieb.\r\n\r\nWarum schreibe ich das hier &uuml;berhaupt..es ist so sinnlos am Ende lass ich nur meinen &Auml;rger raus weil niemand anders um die Uhrzeit wach ist um es sich an zuh&ouml;ren?! ;-)\r\n\r\nMeine Frage w&auml;re dann, ist das so? Gibt es im Tribunal begrenzt  Mitarbeiter die sich haupts&auml;chlich nur um h&ouml;here Divisionen k&uuml;mmern?  W&uuml;rde mich &uuml;ber eine aufrichtig ehrliche Antwort von euch freuen!\r\n\r\n\r\nW&uuml;nsche euch allen eine gute rest Woche!","replies":[{"poster":"eingew","date":"2016-04-14T05:53:32.422+0000","up_votes":2,"down_votes":0,"body":"> Meine Frage wäre dann, ist das so? Gibt es im Tribunal begrenzt Mitarbeiter die sich hauptsächlich nur um höhere Divisionen kümmern? Würde mich über eine aufrichtig ehrliche Antwort von euch freuen!\n\nEs kann durchaus sein, dass sich mit Fällen die zum Beispiel in der LCS oder bei Streamern o.ä. besonders beschäftigt wird, weil hier vor allem wichtig ist, das absolut keine Fehler gemacht werden. Man stelle sich die Situation vor, ein Streamer der zu Unrecht gebannt wurde, das würde ziemlich krass einschlagen. Ich würde also schon davon ausgehen, dass alles was besondere \"öffentliche\" Aufmerksamkeit bekommt durchaus auch besonders geprüft wird.\n\nAber abgesehen davon achtet das Tribunal nur darauf, wie oft du in Spielen reported wurdest, nicht aber, in welcher Elo das geschehen ist. Es gibt sogar Statistiken darüber, dass es in den Unterschiedlichen Elos unterschiedliche Verhaltensweisen gibt, die als beleidigend empfunden werden. Das einfachste Beispiel ist, das \"Silver\" in Bronze nicht als Beleidigung gilt, in Platin+ allerdings durchaus als solche gewertet wird. Wie soll man solche Dinge herausfinden, wenn man nicht auch genügend Fälle in den unteren Ligen bewertet hat?","replies":[{"poster":"CHB johnjadda","date":"2016-04-14T13:14:28.401+0000","up_votes":1,"down_votes":0,"body":"Vielen lieben Dank für deine ausführliche Antwort! Damit ist meine eigentliche Frage ja auch beantwortet, es ist bisschen viel Text geworden heute Früh. Ich schaue auch nicht jeden Tag im Forum wer wo \"Heul Threads\" eröffnet. \n\nIch kann nur aus meiner Erfahrung halt berichten und das ich viele Profile Aktiv spielen sehe die sehr sehr \"Toxic\" sind.\n\nSchönen Tag noch!","replies":[]}]},{"poster":"Abasin","date":"2016-04-14T05:39:14.203+0000","up_votes":2,"down_votes":0,"body":"What??? Lies mal lieber die vielen \"QQ-ich wurde grundlos gebannt\" Threads hier im Forum. Und glaub nicht blind jeden Mist, den irgendein Wannabe-Ex-Tribunal-Mitarbeiter erzählt.","replies":[{"poster":"eingew","date":"2016-04-14T05:49:29.340+0000","up_votes":1,"down_votes":0,"body":"Vor allem wo es doch die Community war, die sich im Tribunal um die Entscheidung über die Schuldigkeit gekümmert hat... von \"Arbeit\" kann also kaum die Rede sein. Und da sind auch Leute aus allen Elos in den Foren aufgetaucht wegen ihren Bans...","replies":[]}]},{"poster":"Neamhoilte","date":"2016-04-14T05:16:13.427+0000","up_votes":2,"down_votes":0,"body":"Das Tribunal ist schon lange nicht mehr on...\n\nDas läuft jetzt alles automatisiert ab. Du bekommst viele Reports, dann checked ein Analyseprogramn deine Chats. Dann kommt die Strafe...","replies":[]},{"poster":"Homunculi","date":"2016-04-14T07:24:49.663+0000","up_votes":1,"down_votes":0,"body":"Nach 3 Uhr morgens passiert nichts gutes mehr xD. \n\nAus meiner Sicht musst du dir keine Gedanken machen das ER danach trollen geht, es ist seine Entscheidung sich wie ein Rektaler Ausgang zu benehmen und, aus meiner Sicht, zeugt es von geistiger Vernebelung wenn er anderen dafür die Schuld gibt.\n\nAm Ende wird ER bestraft werden, früher oder später.\n\nJedesmal wenn ich den Reportknopf drücke denke ich an die schon erwähnten \"Q_Q ich wurde gebannt\" o.ä. Threads hier im Forum und kann mir sicher sein das irgendwann mal was passiert.","replies":[{"poster":"Waldschrat86","date":"2016-04-14T16:11:36.183+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Homunculi,realm=EUW,application-id=KYnfKGf0,discussion-id=nRadB2Wd,comment-id=0003,timestamp=2016-04-14T07:24:49.663+0000)\n>\n> Nach 3 Uhr morgens passiert nichts gutes mehr xD. \n> \n> Aus meiner Sicht musst du dir keine Gedanken machen das ER danach trollen geht, es ist seine Entscheidung sich wie ein Rektaler Ausgang zu benehmen und, aus meiner Sicht, zeugt es von geistiger Vernebelung wenn er anderen dafür die Schuld gibt.\n> \n> Am Ende wird ER bestraft werden, früher oder später.\n> \n> Jedesmal wenn ich den Reportknopf drücke denke ich an die schon erwähnten &quot;Q_Q ich wurde gebannt&quot; o.ä. Threads hier im Forum und kann mir sicher sein das irgendwann mal was passiert.\n\nIch bin Norgens nach 3 in der Nacht nach Karfreitag wieder nach Gold aufgestiegen :D\n\nAber stimmt schon irgendwie, zumindest für die Gegner in den letzten 2 Promospielen: In einem ADC von Anfang an AFK im 2. nach 5 Min. wahrscheinlich interner Flame (10 1) durch Stomp, in der 10. Minute open Mid...","replies":[]}]}]}