{"poster":"LeagueGirlFTW","date":"2015-02-08T14:27:36.060+0000","title":"Suche Erwachsenen-Clan","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heya!\r\n\r\nSuche derzeit einen Clan zum hin und wieder gemeinsamen zocken! :)\r\nWichtig ist mir Ts und kein geflame wenn mal was nicht nach \"Plan\" läuft.\r\n\r\nInfo über mich: bin 24w und wohne bei meinem Freund in Hessen. spiele lol seit 2010 am liebsten support, mid oder adc. \r\nDerzeit bin ich noch S2 mit dem mainacc. \r\n\r\nNa? wer lust mich aufzunehmen? :3","replies":[{"poster":"DFG  Feederino ","date":"2015-02-08T20:03:23.129+0000","up_votes":1,"down_votes":0,"body":"Wir der Clan Deathfire Gaming sucht aktive und motivierte Mitspieler/in.\nZunächst einmal über uns wir sind ein junger Clan mit einer breiten Basis an Spielern welche\nwir jedoch konstant ausbauen und verbessern wollen und genau an diesem Punkt kommt ihr ins Spiel.\nIhr wolltet schon immer in einem aktiven Team spielen oder mit eurem eigenen Team einem Clan beitreten,\ngecoacht werden und sich andauernt verbessern, dann seit ihr bei uns genau richtig.\nWir bieten zwischen purem spielen, ebenso Spaß, Abwechslung und das richtige Maß an Ehrgeiz.\nDann schau doch bei uns vorbei : Ts3 : t12.netclusive.de:40033\nMfg Kássarína","replies":[]},{"poster":"GummibaumXYZ","date":"2015-02-08T14:33:15.572+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir die Liga der Gentlemen empfehlen. Ist zwar kein richtiger Clan und auch nicht explizit nur für Erwachsene, aber TS ist vorhanden und es finden sich immer nette Leute zum gemeinsamen Spielen. Flamefreiheit ist oberstes Gebot und ein Kind habe ich in gemeinsamen Spielen auch nur einmal erlebt. Wobei ich persönlich das auch nicht als schlimm empfinde.\n\nhttp://forum.liga-der-gentlemen.de/","replies":[{"poster":"LeagueGirlFTW","date":"2015-02-08T14:42:29.559+0000","up_votes":1,"down_votes":0,"body":"Danke für die schnelle Antwort :D ich guck mir die mal an ^^\n\nJa mir geht es nicht um Kinder im allgemeinen, hab nichts gegen, es ist halt dass ich mir sonst mit 24 schon vorkomme wie omi oder mama x) (ja, Frauenlogik! xD)\n\nVielen lieben Dank für den heißen Tipp :)","replies":[{"poster":"Jaberno","date":"2015-02-08T19:22:33.310+0000","up_votes":1,"down_votes":0,"body":"Wenn du dir mit 24 schon wie ne Oma vorkommst, dann bin ich mit meinen 28 (in einem monat 29) wohl schon ein UrOpa :D\nKann dir aber wie schon erwähnt die Liga der Gentlemen empfehlen :) Bin da zwar selber nicht so aktiv aber schon einige nette leute dort kennengelernt","replies":[]},{"poster":"GummibaumXYZ","date":"2015-02-08T14:50:36.592+0000","up_votes":1,"down_votes":0,"body":"Haha ok. Bin übrigens auch eine Frau und bereits 28 xD","replies":[]}]}]}]}