{"poster":"IrgendnenT0baay","date":"2016-10-25T13:20:13.159+0000","title":"Permanente Suspendierung","subforum":"Hilfe & Support","up_votes":1,"down_votes":4,"body":"Guten Tag, \nich wollte mal fragen wie es sein kann dass mein Account ohne jede Vorwarnung permanent suspendiert wurde.\nAu&szlig;erdem hatte ich bisher nur von Banns geh&ouml;rt was bedeutet es denn bitte suspendiert zu werden und weshalb &uuml;berhaupt?\nIch gebe zu dass ich mich oft nicht so wirklich gut benehme sollte ich dann aber nicht einen Bann haben?!\nZudem steht im Launcher, ich hätte eine Email mit allen Details bekommen die habe ich aber nicht erhalten.","replies":[{"poster":"Shacoláde","date":"2016-10-25T14:05:39.181+0000","up_votes":1,"down_votes":0,"body":"warscheinlich wieder RP nicht bezahlt","replies":[{"poster":"IrgendnenT0baay","date":"2016-10-25T16:15:49.068+0000","up_votes":1,"down_votes":1,"body":"Hätte ich dann nicht eine Email zu dem Vorfall bekommen und kann\n ich das im nachhinein noch irgendwie regeln?","replies":[{"poster":"Sirrkas","date":"2016-10-25T17:21:14.058+0000","up_votes":2,"down_votes":0,"body":"Es besteht immer die Möglichkeit, dass die Email nicht ankommt. Vielleicht ist sie am Spamfilter nicht vorbei gekommen, die Emailadresse ist veraltet oder es gab ein technisches Problem. Wenn du keine Mail zum Bann erhalten hast, musst du den Support fragen, um weitere Informationen zu erhalten. Bei Zahlungsproblemen wird dein Account aber wieder freigeschaltet, sobald die Schulden beglichen sind.","replies":[]}]}]},{"poster":"Saufautomat","date":"2016-10-25T13:32:42.116+0000","up_votes":2,"down_votes":0,"body":"Hallo,\n[hier](https://support.riotgames.com/hc/de/requests/new) kannst du ein Supportticket einreichen, die können dir den Grund für den Bann sagen. Eine Antwort dauert in der Regel ein paar Werktage.","replies":[]},{"poster":"Cat me if U can","date":"2016-10-25T13:30:41.566+0000","up_votes":1,"down_votes":0,"body":"suspendierung = bann","replies":[{"poster":"RAG Ryve","date":"2016-10-27T01:04:55.770+0000","up_votes":1,"down_votes":0,"body":"Ich glaub da gibts nen Unterschied. Mein Account wurde vor ein paar Wochen gehackt und als ich dem Support das schrieb haben sie meinen Account zur Sicherheit suspendiert. Als ich angefragt hatte dies wieder rückgängig zu machen wurde das auch getan. \nIch denke es gibt einen Unterschied zwischen Bann und Suspendierung damit sich die Rito Mitarbeiter auskennen.","replies":[]}]}]}