{"poster":"Sn4ke","date":"2018-03-05T06:06:47.936+0000","title":"Support Champions","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;m planning on becoming a support main. I love CC and I plan on playing Alistar and Thresh. Though I feel like I need to have at least be able to play most supports. I don&#039;t like playing AP but love playing AD. \r\n\r\nIs playing only AD support bad? I do happen to like Rakan but meh. Leona I am looking into but I don&#039;t want a champion too hard.\r\n\r\nIs it bad to play only AD supports and have only 3 supports I&#039;m able to play? Maybe any suggestions for supports as well. \r\n\r\nCheers.","replies":[{"poster":"Ingénue","date":"2018-03-06T00:46:37.639+0000","up_votes":1,"down_votes":0,"body":"Generally with supports you want to cover one from each playstyle\n\n* engage supports - Like Leona, blitz, Thresh, Rakan (also doubles as utility). **You seem to have this point covered.**\n* Utility supports - Like Janna, LuLu, Nami, Soraka, etc.** Really good for when you have a scaling ADC you need to babysit through laning phase, they also often have periods where this type of support dominates the meta. **\n* AP supports -  Like Zyra, Brand, Karma. **For those games where literally everyone in your team is a \"soloq player\" and picks their strongest champs and you somehow end up with 4 AD champs on your team and you are left to fill the gap. These types of champs are also really good for gaining elo with since a lot of people struggle to play safe against the poke and just end up starving themselves off CS and exp, giving you an even bigger lead. **","replies":[{"poster":"Nightjar","date":"2018-03-06T01:47:00.471+0000","up_votes":1,"down_votes":0,"body":"I hate when people complain about lux, zilean or brand support when they have literally picked 4 ad champions.  Yes we need a tank, but having a singular damage type in low elo is even worse. If you wanted a tank, pick one yourself, I will not be the sad fella trying to look for an engage when we cannot 1v1 their armour stacking toplaner.","replies":[{"poster":"Sulbatamol","date":"2018-03-10T21:34:37.125+0000","up_votes":1,"down_votes":2,"body":"Lux supp with 43 percent win rate? Dont group lux with brand or zilean because they are two different kind of fishes. Brand and zileant could at least set up for countergank for your jgler or midlaner with fantastic amount of dmg or utility kit which lux will never be able to do. Also as a support you are not here to balance out damage composition for your team. As a support you should prioritize utility kits that your team comp is missing. And last of all, all ad in fact scale much better in dmg out put if games goes late.","replies":[{"poster":"Nightjar","date":"2018-03-11T07:10:54.749+0000","up_votes":1,"down_votes":0,"body":"ad scale better? yeah sure, but if you only have ad, the enemy team picks malphite, rammus and trundle, and they have thormails and you stop having a fun time. Ad scales better overall, but ap is necessary to stop the enemy tanks from stacking 5 armour items.\n\nHitting 'hyper tank' state is much easier and takes less gold when the enemy team only has 1 type of damage. Hence the earlier tank powerspike, and hence a very difficult barrier to overcome.\n\nA good ap support will easily do the most damage in a game where ad and armour are the main focus.","replies":[{"poster":"Sulbatamol","date":"2018-03-11T10:19:45.766+0000","up_votes":1,"down_votes":1,"body":"Well what kinda of team comp includes all those 3 champions? And all three champions you mention are not necessarily lane bullies except trundle to a certain extent . Do you think malp is going to win lane against yas or fiora simply stacking armour? HELL NO. Also think how easily they can be kited out plus using flash and qss. And not many ad champs in league dose ad dmg only . Thinks some of them do true dmg plus percetage in health like vayne and fiora. Thornail is easily dealt by building a bit of mr and lifesteal and it is not a first core for most of tanks due to it gives you way too little boost in hp stat. Zyra and karma doing a hell load of dmg in game dose not necessarily win you a game and in fact i lost many. Also if u play supp you are forced to build many utility items instead of pure ap stat items because they do better for your team in general. Finally due to nerf of aery and comet , tanky supp eg. Braum, alistar, even siom is really a thing atm except lulu or janna who have way to advanced utility kits in comparison to champs you are speaking of.","replies":[{"poster":"Nightjar","date":"2018-03-11T13:15:21.492+0000","up_votes":1,"down_votes":0,"body":"the issue is thornmail cuts lifesteal and atkspeed, and if you give the tank the leeway necessary to build a few damage items on top of the armour stacking, an ad duelist, fighter, assassin or adc will simply fall behind.\n\n Typically tank itemisation is balanced against damage itemisation on the assumption that lategame you'll need equal parts armour and magic resist to survive in the middle of a teamfight. \n\nHowever in games where the enemy team only has a singular damage type, that 'tank effectiveness' is doubled and tank items scale up twice as fast, that adaptive helm can be replaced by an early frozen heart, and even give leeway for a titanic hydra, triforce, liandries, blackcleaver ect... instead of going 3 armour, 2 magic resist and boots, that trundle can buy 3 armour, a 2 bruiser items and ninja tabi, and be even tankier to your specific damage, whilst doing alot more damage in return since now he can also afford to build damage.\n\nAn even worse example of this is when you consider off tank duelists like Irelia or Jax. Normally Irelia is faced with the problem that because she has to have 2 damage items to be able to duel, she isn't generally tanky enough to dive in without a true tank initiating for her. But against a full ad teamcomp, a randiuns and ninja tabi is enough to allow her to survive playing far more aggressively, and since she doesn't need to build mr, she can replace one of her mr items with an armour item, and suddenly she's statistically much much stronger.\n\nAt 2 items tanks often aren't actually strong enough to facuilitate a 5man dive since they lack the resistances and health necessary. But when a tank does not need to build magic resist, a tank can get more armour and health instead, and essentially hit a powerspike far earlier. Playing against a full ad teamcomp is like telling a tank that all their armour/health items have just had the health on them increased by half for free. Yes eventually you'll get tank shred, but since they won't waste gold on magic resist, they get more items and more stats more quickly.","replies":[{"poster":"Sulbatamol","date":"2018-03-12T10:27:49.421+0000","up_votes":1,"down_votes":0,"body":"Ok now your talking about bruiser and fighter type champs. Im sorry only irealia gets a prime time during an game is when she just completed tf and 2 dmg items are pretty unnecessary unless you dive into whole enemy team and kill yourself. And due to she not being a true tank she is alwaya ezy to kill in comparison to champs like maoki or sion. She is one of champs in which you snowball a lot with just completed tf or fall behind really hard. Ok abour jax. Jax is one of the champion who can be countered by pretty much any champions in top lane pre lvl6 and even post lvl 6 depends how much you know about his kit. It takes a lot of time for him to get scale up in most of the time and he is again is not a pure tank ,especially when his r active is on cd. Moreover, not many champs in league dose a single type of dmg only. Varus and kog dose percentage in health as magic dmg and believe or not they dont even have to build lw to shred down tanks.","replies":[]}]}]}]}]}]}]},{"poster":"HEIPILAOGONG","date":"2018-03-11T10:42:44.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sn4ke,realm=OCE,application-id=FjGAIbRv,discussion-id=KmAfvfYR,comment-id=,timestamp=2018-03-05T06:06:47.936+0000)\n>\n> Is it bad to play only AD supports and have only 3 supports I'm able to play? Maybe any suggestions for supports as well. \n> \n> Cheers.\n\nWhich AD supports do you mean? Sion or something?","replies":[]}]}