{"poster":"HandIOfIZombie","date":"2016-01-26T23:34:58.486+0000","title":"Neue Champions die Raus kommen ?!","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"hallo,\n\nich habe mich schon immer gefragt wie das so ausschaut mit neuen Champions die zu uns finden in die Kluft. **Wie ist eure Meinung dazu ?** **Sind Champions wie Illaoi oder Jhin der Virtuose genau das was ihr euch schon immer gewünscht habt ?** bzw. habe ich meist das Gefühl das Riot das ganz alleine entscheidet ohne nach zu fragen ob die User sich diesen Champion wünschen oder Vorstellen können also halt das eine alte Ankündigung nicht mehr in Angriff genommen wird wo aber eh überall im Forum immer wieder nachgefragt wird vom Feedback her was ich lese & die Interesse einfach größer ist wie z.b bei Ao Shin.\n\nIch finde es also nicht schlimm, da eine gute Abwechslung immer sehr gut sein kann aber die Vorstellung darüber oder anders ausgedrückt bin ich nicht so überzeugt von den Champions, also beide sind eher nicht so mein Geschmack vom Gesamt Kit her & halt Allgemein. Ich denke da wird eh jeder eine andere Meinung zu haben aber es müsste mal wieder ein Champion geben der mehr Verwirrung ins spiel mit einbringt so wie sie es gut umgesetzt haben bei Zed, Wukong, Leblanc oder Shaco aber halt was neues was sich auch wirklich Unterscheidet.\n\n**Manche Champions bringen halt ein sehr Spanendes Kit mit sich was auch für andere Grund genug ist auch was zu mainen was für andere zu schwer ist zu Spielen und sonst der Champion auch einem sehr gut gefällt, vllt. sogar auch die Story zum Champion also eine Herausforderung kann es ruhig sein den Champ zu beherrschen.** Also ich wünsche mir sowas xD Bei Illaoi ist klar, spielt sich wie ein tank und da kann man schon wie ein Tank denken. Jhin als schützen finde ich jetzt nicht Uninteressant aber das gesamt Kit ist irgend wie, naja, Anonymous halt ^^ Ich möchte die Champs nicht Kritisieren oder das ich jetzt sage, ich mag beide garnicht also das ist nicht die Message oder aussage in meinem text aber ich mache mal ein anderes beispiel. Desweiteren möchte ich erwähnen das es eine Liste gibt wo man sehen kann welche Win Rate die Champions haben und was am meisten gepickt wird, da ich nicht weiß wie es in der hohen elo ausschaut, erwähne ich es nochmal, da wird denke der Pick zu den Champions größer sein als bei den Games die unter Silber sind.\n\nWer Lucian richtig gut Spielen kann muss den Champ echt mögen weil es ist wirklich nicht für jeden einfach und das finde ich wiederum gut, bei Kindred ist es irgend wie auch so aber im Hype stehen die letzten Champs meist nicht lange aber Champs wie TK, Bard, Kalista werden gerne genommen. Anders ist es bei Ekko, sehe ich so gut wie nie oder selten oder Kindred. Ich selber habe schon großen Respekt davor wenn jemand Lucian oder Rek'Sai gut Spielen kann aber vllt. betrachte ich das ganze auch nur nicht von einer anderen Sichtweise und finds es deswegen gut wenn andere ein Champ Problemos Spielen können vom Kit her was andere nicht können, Nidalee z.b finde ich auch sehr schwer vom Kit aber genau sowas mag ich halt wie bei Lucian halt eben auch ^^ finds nur schade das alte so wie neue Champions so schnell in die Vergessenheit geraten und somit garnicht zu sehen sind oder der Hype da nicht lange anhält x)","replies":[{"poster":"Fjiordor","date":"2016-01-27T08:26:22.020+0000","up_votes":1,"down_votes":0,"body":"Für Ao Shin fehlt derzeit noch die technik","replies":[{"poster":"HandIOfIZombie","date":"2016-01-27T19:36:07.083+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fjiordor,realm=EUW,application-id=YnZkMR0R,discussion-id=ZA05ba5s,comment-id=0003,timestamp=2016-01-27T08:26:22.020+0000)\n>\n> Für Ao Shin fehlt derzeit noch die technik\n\nkann mir kaum vorstellen das sein Kit so schwer um zu setzen ist von AO Shin im vergleich zu allen anderen champs die da sind oder noch kommen.","replies":[{"poster":"Fjiordor","date":"2016-01-28T08:35:10.150+0000","up_votes":1,"down_votes":0,"body":"Das Character rig  tool in LoL ist derzeit sehr limitiert und du bräuchtest für Ao Shin deutlich mehr als es das Spiel derzeit zulässt.\n\nAnsonsten:\nhttps://twitter.com/doctoryumyumm/status/691067753734602752","replies":[]}]},{"poster":"Fjiordor","date":"2016-01-27T08:28:20.680+0000","up_votes":1,"down_votes":0,"body":"Und Kindered wird in der Höheren Elo geliebt","replies":[]}]},{"poster":"Wernicke","date":"2016-01-27T06:25:37.114+0000","up_votes":1,"down_votes":0,"body":"Es sind auf jeden Fall zu viele champions die neu kommen! Es ist gar kein, naja, \"highlight\" mehr wenn ein neuer champ kommt. Man denkt sich eher, \"Oh ja ähm toll wieder ein neuer champion... Guck ich mir das Video an? Oach nööö, lass mal....\"","replies":[{"poster":"HandIOfIZombie","date":"2016-01-27T19:34:54.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wernicke,realm=EUW,application-id=YnZkMR0R,discussion-id=ZA05ba5s,comment-id=0002,timestamp=2016-01-27T06:25:37.114+0000)\n>\n> Es sind auf jeden Fall zu viele champions die neu kommen! Es ist gar kein, naja, \"highlight\" mehr wenn ein neuer champ kommt. Man denkt sich eher, \"Oh ja ähm toll wieder ein neuer champion... Guck ich mir das Video an? Oach nööö, lass mal....\"\n\nnaja, Riot muss ja irgend was raus bringen sonst verdienen sie selbst auch nichts mehr und die meisten Spieler wünschen sich das halt ^^","replies":[]},{"poster":"SorisDynasty","date":"2016-01-27T07:52:27.880+0000","up_votes":1,"down_votes":0,"body":"Wenn dir das bereits zu viele sind... Gut, dass du Season 2 nicht dabei warst. Das nehme ich mal daraus her. Alle 2 Wochen 'nen neuer Champion. :^)","replies":[]},{"poster":"CooL Ice Tea","date":"2016-01-27T07:06:52.236+0000","up_votes":1,"down_votes":0,"body":"Deswegen gibt es auch so viele Threads im Forum \"ich will nicht wissen wann der neue Champ raus kommt\" ... Ach ne, die meisten wollen immer **wochenlang** wissen wann der Champion raus kommt.","replies":[]}]},{"poster":"Snake Eyê","date":"2016-01-27T05:28:32.947+0000","up_votes":1,"down_votes":0,"body":"Teemo anspruchsvoller Champion kann auf jeder Position gespielt werden einer meiner liebsten champs kappa","replies":[]},{"poster":"PwnedAkkon ","date":"2016-01-27T00:46:03.378+0000","up_votes":1,"down_votes":0,"body":"also jhin passt genau zu meinem spielstil *_*","replies":[]}]}