{"poster":"HandIOfIZombie","date":"2015-03-17T02:07:57.522+0000","title":"Lee sin vs Teemo ;D","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo Liebe Mitglieder\n\nIch habe ehrlich gesagt nur eine frage und ich möchte echt nicht herum trollen oder so aber normal das Mönche wie Lee Sin von Teemo geblendet werden können obwohl Lee Sin blind ist ? naja, ist ja auch ein Fantasy Game, braucht nicht viel Logik dahinter, kp ob sowas schon mal hier erwähnt wurde, falls nicht könnte es ja evtl. auch ein Interessantes Diskussions Thema werden. \n\nLiebe Grüße C.Blight","replies":[{"poster":"XxKampflappenxX","date":"2015-03-17T03:11:10.588+0000","up_votes":1,"down_votes":0,"body":"(Kampflappen am surfen)\n\n\"Gääähn, langweiliger Thread *\"click\"*  Noch so einer... *\"click\"*  und wieder einer  *\"click\"* \"\n\n*Oh, den da hast du vor nem Jahr schonmal gesehen...* *\"click\"*\n\n*Nur mal eben was drunter posten...*\n\n> Die Leute neigen dazu über die Jahre alle auf die selbe Idee zu kommen oder?\n> Immerhin ist das bestimmt der zehnte \"**Teemo vs Lee Sin**\" Thread den ich auf \n> dem neuen Forum gesehen hab, von dem alten ganz zu schweigen.\n\n> Aber um beim Thema zu bleiben, Autoattack ist Autoattack. Lee Sin macht sowieso den meisten Schaden durch seine Spells, ihm jetzt nen Buff zu geben dass er nen Teemo trotzdem hitten kann wird nicht viel ändern. Es ist einfach nicht der Rede wert.\n\n*nur noch eben abschicken...*   *\"click\"*","replies":[{"poster":"TheUnknown98","date":"2015-03-17T06:38:01.730+0000","up_votes":1,"down_votes":0,"body":"Wäre Kampflappen vs Teemo spannender?:D","replies":[{"poster":"XxKampflappenxX","date":"2015-03-17T18:47:15.085+0000","up_votes":2,"down_votes":0,"body":"Ich persönlich hab als Lee kein Problem vs Teemo. Und IRL würd ich den kleinen Satan in die Versenkung namens Hölle treten wo er her kam ^^","replies":[{"poster":"TheUnknown98","date":"2015-03-17T21:06:09.429+0000","up_votes":1,"down_votes":0,"body":"Da ist wohl noch jemand allergisch auf Pilze xD","replies":[]}]}]}]},{"poster":"HandIOfIZombie","date":"2015-03-17T16:17:32.189+0000","up_votes":1,"down_votes":0,"body":"wie gesagt, bin so gesehen noch Neueinsteiger, der alte Thread ist offline und ich kenne nicht alle Beiträge ;)","replies":[{"poster":"XxKampflappenxX","date":"2015-03-17T18:45:46.630+0000","up_votes":1,"down_votes":0,"body":"Ich habe dich auch nicht kritisiert dafür, ich habe bloß darauf aufmerksam gemacht dass übliche Witze ingame immer wieder zu den gleichen Threads  im Forum führen. \nIch finds ja auch nicht schlecht dass die neuen Spieler auch die alten Witze zu hören bekommen aber auf die Dauer kennt man es einfach und man sieht in den Foren immer wieder die gleichen Threads als \"Der Witz der Saison\" ^^\n\nAls ob man darauf wartet dass ein langweiliger Witz endlich alt wird, aber die Leute ihn in 2 Jahren immernoch jedem erzählen und erwarten dass man total begeistert ist :D","replies":[]}]},{"poster":"LuckingFegendary","date":"2015-03-17T06:29:06.880+0000","up_votes":1,"down_votes":1,"body":"Nicht nur das ist für uns unlogisch. Du kaufst ja mit allen Champs nur einen Schu, die haben alle die gleiche Größe und sogar Champions ohne Füße brauchen Schuhe. Zudem kann Malphite von Cassio versteinert werden.... Also von Logik braucht man gar nicht erst anfangen.","replies":[{"poster":"Alustus","date":"2015-03-17T11:57:21.221+0000","up_votes":1,"down_votes":0,"body":"Naja Malpgite versteinern wiederspricht nicht unbedingt der logik, dieser ja bewegliche elemente haben muss/müsste.\n\nAber in summe muss ich dir recht geben.\nDa gibt es genug punkte welche unlogisch sind.\nAlleine schon die Items geben mehr als nur diskussionsbedarf.","replies":[]}]}]}