{"poster":"HandIOfIZombie","date":"2015-04-03T16:13:07.149+0000","title":"Melfice, Taktiker der Runenkriege ( Mit Bild )","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":4,"body":"Hallo Community, ich m&ouml;chte euch hier mein (7) Champion hier im Thread vorstellen. Konstruktive Kritik zum Konzept nehme ich daher an also falls Verbesserungsvorschl&auml;ge da sind k&ouml;nnt ihr gerne Feedback hinterlassen. Ich werde denke in n&auml;chster Zeit etwas mehr Konzepte Vorschlagen, falls euch eine Idee ganz besonders gef&auml;llt k&ouml;nnt ihr diese gerne &Uuml;bernehmen und auch selbst ver&auml;ndern und verbessern.\n\nKlasse: Sch&uuml;tze ???\nDas Bild von Melfice ist ganz unten im Anhang zu sehen.\nEinmal auf das Bild drauf Klicken um es zu vergr&ouml;&szlig;ern\n\nHinweis bei diesem Champion gibt es hier schon eine Umfrage die f&uuml;r euch gestellt ist: Falls ihr Melfice euch wirklich vorstellen k&ouml;nnt, wird dieser so oder so von euch und der Community nochmal &uuml;berarbeitet also k&ouml;nnte man auch f&uuml;r Ja abstimmen.\n\nLINK ZU MEINER ERSTEN KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/L9E6lgfN-shiris-und-gaddes-die-gesetzlosen-mit-bild\n\nLINK ZU MEINER ZWEITEN KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/cN6ULxZ4-gladius-der-gladiator-der-noxus-mit-bild\n\nLINK ZU MEINER (3) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/TMu5xvUz-hawk-bezwinger-des-kumungu-dschungel\n\nLINK ZU MEINER (4) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/H1XvEeA4-shiro-meister-der-shuriken-mit-bild\n\nLINK ZU MEINER (5) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/GQofHQ9A-marlene-die-groae-fechterin-mit-bild\n\nLINK ZU MEINER (6) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/dQxwOxYv-orson-berzerker-der-noxus-mit-bild\n\nLINK ZU MEINER (8) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/xaEABl4A-yuga-demacias-runenmagier\n\nStory: Verbesserungsvorschl&auml;ge Erw&uuml;nscht\n???\n\nAttribute\nSchaden: 54.208 (+3.1 pro Stufe)\nAngriffstempo: 0.656 (+2% pro Stufe)\nLeben: 524.4 (+80 pro Stufe)\nLauftempo: 340\nR&uuml;stung: 19.04 (+3 pro Stufe)\nMagieresistenz: 30 (+0 pro Stufe)\nLebensgeneration: 8.095 (+1.75 pro Stufe)\nManaregeneration: 6 (+0.8 pro Stufe)\nReichweite: ???\n\n&Uuml;bersicht:\nLeben: 5/10\nSchaden: 10/10\nMana: 307.2 (+40 pro Stufe)\nSchwierigkeit: 9/10 \n\nPassive F&auml;higkeit: Getarntes Minenfeld/Sprengladung \nMelfice Minenfeld oder Sprengladung ist f&uuml;r 30 Sekunden Getarnt und kann nicht mehr gesehen werden, Melfice kann ebenfalls nicht sehen wo er sein Minenfeld oder seine Sprengladung gelegt hat auch sobald ein Gegner am Rand des Radius steht. Das Gebiet ist f&uuml;r den Spieler aber desweiteren nicht Sichtbar.  **Mit der Alt Taste wird alles Getarnt und die Passive F&auml;higkeit ist Aktiviert.** Melfice ist auf Items angewiesen die das Gebiet sichtbar machen diesbez&uuml;glich gibt es auch Items die 3-4 Augen auf der Karte stellen die eine Abklingzeit von 3 Minuten haben und wieder aufgeladen werden müssen wie z.b Getarntes Auge  ,Abwehrtotem oder Sehender Stein. \n\nQ Fernz&uuml;ndung\nKeine Abklingzeit zum Z&uuml;nden \nDie Sprengladung oder das Minenfeld wird gez&uuml;ndet, mit jedem weiteren Skill wird der Schaden erh&ouml;ht & die Abklingzeit verringert. Es wird immer das gez&uuml;ndet was zu erst Platziert wurde, das Gebiet wird kurz sichtbar gemacht falls die Sprengladung explodiert. \nFalls die Passive F&auml;higkeit Aktiviert wurde, wird erst das Gez&uuml;ndet was zuletzt Platziert wurde.  \n\nW Geladener Gesch&uuml;tzturm\nReichweite der Expulsion: 400\nReichweite der Flammen: 200 oder 300\nMelfice errichtet ein Gesch&uuml;tzturm, der mit einem sekund&auml;ren durchdringenden Flammenwerfer ausgestattet ist. (Gesch&uuml;tzt&uuml;rme verursachen an T&uuml;rmen nur halben Schaden). Melfice errichtet am Zielort einen Gesch&uuml;tzturm. Beim Angriff priorisiert der Gesch&uuml;tzturm Melfice Ziele und Gegner, die Melfice angreifen. Das Leben steigt mit Melfice Stufe an und sie zerfallen, wenn er sich aus dem Gebiet bewegt. Alle 24/23/22/21/20 Sekunden generiert Melfice einen Gesch&uuml;tzturm und kann 1/1/2/2/3 Baus&auml;tze gleichzeitig tragen. Die Reichweite von Flammenwerfer ist nicht zu hoch aber mit der Fernz&uuml;ndung kann Melfice den Gesch&uuml;tzturm Explodieren lassen. \n\nAttribute des Geladenen Gesch&uuml;tzturms\nLeben: 150/175/200/225/250/275/300/325/350/375/400/425/450/475/500/525/550/575 (+16/16/16/16/16)\nAngriff - Kanone: 12/18/23/29/34 (+15% F&auml;higkeitsst&auml;rke) magischer Schaden und +1/2/3/4/5 % Flammen pro Angriff.\nAngriff - Flammen: Alle 16 Sekunden 40/60/80/105/130 (+55% F&auml;higkeitsst&auml;rke) magischer Schaden um 360 Grad\n**Maximale Anzahl an aufgestellten Gesch&uuml;tzt&uuml;rmen: 3**\n\nE Minenfeld mit Fernz&uuml;ndung \nKosten: 85 Mana \nReichweite: 970\nSolange die Passive F&auml;higkeit nicht genutzt wurde, kann jeder sehen wo das Minenfeld Platziert wurde! Wird das Minenfeld gez&uuml;ndet, die 60/100/140/180/220 (+60% F&auml;higkeitsst&auml;rke) magischen Schaden an gegnerischen Einheiten verursacht und deren Lauftempo 2 Sekunden lang um 35 % verlangsamt. Gegner im Zentrum der Explosion werden zudem 1.25 Sekunden lang bet&auml;ubt. Die Explosion verursacht an Gegnern magischen Schaden und st&ouml;&szlig;t sie weg.\n**\n* Maximale Anzahl der Minenfelder: 3 oder 5 **\n\n\nR  Explosive Sprengladung\nKosten: 150 Mana \nReichweite: 5300\nSolange die Passive F&auml;higkeit nicht genutzt wurde, kann jeder sehen wo die Sprengladung Platziert wurde! Melfice setzt seine ultimative Sprengladung ein, Gegner im prim&auml;ren Detonationsbereich erleiden 250/375/500 (+90% F&auml;higkeitsst&auml;rke) magischen Schaden. Weiter entfernte Ziele 80 % dessen. Vasallen erleiden den doppelten Schaden.\n\n* **Maximale Anzahl der Explosive Sprengladung: 1 **\n\n**Ich habe sehr lange f&uuml;r dieses Konzept gebraucht und ich w&uuml;rde mich freuen falls es euch gef&auml;llt, dieser Champion hat es aber in sich, ich bin mir sicher das er nicht einfach zu Spielen ist und daher ist der Schwierigkeitsgrad eher hoch an zu sehen :) **\n\nIch Begr&uuml;&szlig;e hier zum Abschluss auch alle League of Legends Mitglieder, ich w&uuml;rde mich sehr dar&uuml;ber freuen wenn ihr mir helfen m&ouml;chtet bei meinen Konzept und so wie ich Zeit habe werde ich dieses Konzept auch gerne Erweitern und Verbessern. F&auml;higkeits-Namen k&ouml;nnen ver&auml;ndert werden falls es diese schon gibt, die Namen dienen nur um auch zu wissen wie ich das Konzept aufgebaut habe. Ich denke hier gibt es noch genug Sachen die man &uuml;berarbeiten kann. Falls meine Konzept Idee euch aber gef&auml;llt k&ouml;nnt ihr auch gerne daf&uuml;r Voten. Leider habe ich noch keine Story geschrieben ihr k&ouml;nnt aber gerne Feedback hinterlassen. Desweiteren habe ich das Bild Privat bekommen und daher kann ich den Ursprung des Bildes nicht viel zu sagen, die &Uuml;berbearbeitung von Melefice liegt hier bei der Community und ihrem Art Actor Designer Teams vor.\n\nAbklingzeiten & Zus&auml;tzliche Informationen die ins Detail den Champion noch ausgeglichener machen weren sehr N&uuml;tzlich, bitte habt nachsicht da ich in sowas kein experte bin.\n\nLiebe Gr&uuml;&szlig;e euer C.Blight","replies":[{"poster":"Kon1298","date":"2015-04-13T11:53:09.499+0000","up_votes":1,"down_votes":0,"body":"Trotzdem finde ich nicht das die Idee gut ist, denn die E ist wie die eine Fähigkeit von Ziggs (Keine Ahnugn wie sie heisst,ist auch eine Mine die Gegner wegstösst) Die W von Heimerdinger und die Passive ist zu umständlich. Die Q ist nicht zu gebrauchen, und allgemein passt er nicht zu LoL.\nLG kon1298\nPS: Die Haare sind von Heimerdinger auch :D","replies":[]},{"poster":"HandIOfIZombie","date":"2015-04-09T14:19:26.757+0000","up_votes":1,"down_votes":0,"body":"Dein Vorschlag hört sich mehr nach einem neue Champion Idee an weil ich würde  mich schon freuen wenn die Passive sowohl auch Q,E,R übernommen wird ;) \n\nLG C.Blight","replies":[]},{"poster":"Kon1298","date":"2015-04-09T10:46:45.031+0000","up_votes":1,"down_votes":0,"body":"Ich fänds gut, wenn er anstatt Bomben,Türme etc. Roboter konstruieren könnte.\nDiese könnte er dann \"reiten\" dadurch bekommt er 50-100 Laufspeed (Je Länger du auf dem Roboter drauf bist,so länger erhitzt er sich[Und wird \nschneller] und wenn er maximal heiß ist springt Melfice von ihm ab und er explodiert und macht dmg) \nDas wär seine Passive\nSeine Q  wäre das mit dem Konstruieren er erstellt dabei einen Roboter der angreift  {Der Skaliert auf AD}\nSeine W ist ein Buff wo du den Roboter aufwerten kannst,dafür verbrauchst du eine Ladung <-[Erklär Ich gleich wie man die bekommt!] {Skaliert auf AP}\nSeine E ist fliegender Roboter der für 10 Sek einen kleinen Bereich beschiesst und er dabei die Gegner verlangsamt und wenn dieser abstürzt macht er True Dmg in dem kleinen Bereich wobei der, der am nächsten am Roboter ist den meisten Dmg bekommt und auch einen Stun von 1,5sec [Escape Möglichkeit] {Skaliert auf AP}\nSeine R ist eine Welle von kleinen Bombenminions die neben ihm spawnen [ungefähr 5-10 Stück] diese, explodieren wenn sie abgeschossen werden,wodurch es schwierig ist diese abzuwehren. Aber wenn es einer schafft an einem Champion 2 Sek lang zu sein gibt er diesem einen Stun! [Der DMG von den Minions ist ziemlich gering und es können nicht mehr als 2 Bomben an einem Champ dran sein, die anderen bekommen einen  Triebwerksfehler und explodieren irgendwo in der Nähe.] {Skaliert auf AP und AD}\nDas ist ziemlich gut in Teamfights wo es zur Sache geht!\nDas wars\nLG Kon","replies":[]},{"poster":"HandIOfIZombie","date":"2015-04-06T05:51:42.772+0000","up_votes":1,"down_votes":0,"body":"Die alt-taste, ja in dem Fall were es eine aktive wenn man das so betrachten möchte. \n\nZiggs Passive ist die: Kurze Lunte\nAlle 12 Sekunden verursacht Ziggs' nächster normaler Angriff zusätzlichen magischen Schaden. Diese Abklingzeit verkürzt sich jeweils, wenn Ziggs eine Fähigkeit einsetzt.\n\nvon Heimerdinger ist der Geschützturm sehr ähnlich also die (W) aber die Reichweite vom Turm ist nicht hoch und vieles was der Turm mit sich bringt ist ganz anders als die türme die Heimerdinger erstellt. bin aber ehrlich, mir ist zur zeit nichts besseres eingefallen. \n\nbei Ziggs verhält sich das meist so, alle Aktionen die Ziggs machen sind meist alle auf Echtzeit, bzw. alle Fähigkeiten erwischen den Gegner sofort, Melfice Platziert mit seinen Fähigkeiten mehr, es verhält sich wie mit Teemo und den Pilzen nur mit dem unterschied das Melfice diese Zünden muss & Melfice kann selber nicht sehen wo er seine Sachen Platziert hat, daher braucht Melfice diese Items damit er sehen kann wann er diese zünden muss. Kurz gesagt, Ziggs ist ne art Bombenwerfer wie bei Bomberman, Melfice ist aber eher so der Bombenleger. Man könnte es vllt. noch so machen, das gelbe kreise auf der Karte Markiert sind, dann weiß er zmd. wo auf der Karte die Sachen ungefähr liegen. \n\n\nLG. C.Blight","replies":[]},{"poster":"HandIOfIZombie","date":"2015-04-03T16:25:54.843+0000","up_votes":1,"down_votes":0,"body":"Hinweis: Ich habe mir noch keine Gedanken gemacht ob die Sprengladung oder das Minenfeld / Geladenen Geschützturm eine Abklingzeit haben oder ob ich das raus nehmen soll das der Geschützturm überhaupt sich zünden lassen soll über die Q Fähigkeit. Ich könnte mir das zwar gut vorstellen das es eine Abklingzeit eingeführt wird aber nicht für die Ulti. Vllt. könnte man aber auch das mit der Fernzündung so machen, das Melfice in der Nähe stehen muss, das würde es aber noch Schwieriger machen den Champion zu spielen, denke ich. \n\nHier sind aber Wahre Experten Gefragt weil Melfice ein sehr gewagter Champion ist und auch die Struktur und der aufbau sehr kompliziert werden kann daher ist der Schwierigkeitsgrad eher hoch. \n\nDer Spaßfaktor sollte bei dem Champion hier aber nicht verloren gehen, sollte man diesen Champion jedoch gut einsetzen stellt auch dieser Champion eine gefahr da, wie das mit autohits ausschaut habe ich mir aber noch keine Gedanken gemacht, zur not wird der Champion auch mal gebannt weil man ihn nicht als Gegner haben möchte :D \n\nFalls Verbesserungsvorschläge da sind, lasst es mich wissen und schreibt mir Feedback, darüber würde ich mich echt freuen.\n\nLG C.Blight","replies":[{"poster":"Kon1298","date":"2015-04-05T18:06:15.331+0000","up_votes":1,"down_votes":0,"body":"Die Passive mit einer alt-taste aktivieren, ist das dann nicht eine aktive? Und er ist eine Mixtur aus Heimerdinger und Ziggs!","replies":[]}]},{"poster":"HandIOfIZombie","date":"2015-04-03T17:00:35.418+0000","up_votes":1,"down_votes":0,"body":"ach jo, ist zwar nicht meine art aber da ich diese Idee voll abfeier und diese echt derbe geil ist, hier mal ein link zu einem Spieler den ich so aber nicht Persönlich kenne. Schaut es euch aber mal an. Ich bin ja ein echter Fan davon wenn es Champion gibt wo Taktik gefragt ist :) \n\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/0wrpAvxW-major-james","replies":[]}]}