{"poster":"HandIOfIZombie","date":"2015-03-19T16:37:07.759+0000","title":"Shiris und Gaddes, Die Gesetzlosen  ( Mit Bild )","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"Hallo liebe Community, ich möchte euch hier meine neusten und ersten Champion hier im neuen Thread vorstellen. Da der alte Thread leider Offline ist und meine Konzepte vor ca. 3-4 Jahren nicht mehr existieren hoffe ich das euch meine neuen Ideen gefallen. Konstruktive Kritik zum Konzept nehme ich daher an also wenn Verbesserungs Vorschläge da sind könnt ihr gerne Feedback hinterlassen. \n\n\n**Klasse: Assasine/Tank**\n**Das Bild zu Shiris und Gaddes ist ganz unten im Anhang zu sehen. \nEinmal auf das Bild drauf Klicken um es zu vergrößern**\n\n\nUmfrage Votet für oder gegen Shiris und Gaddes\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/BO4AgeWa-umfrage-der-champion-gladius-der-gladiator-der-noxus-mit-bild\n\n**LINK ZU MEINER ZWEITEN KONZEPT IDEE**\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/cN6ULxZ4-gladius-der-gladiator-der-noxus-mit-bild\n\nLINK ZU MEINER (3) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/TMu5xvUz-hawk-bezwinger-des-kumungu-dschungel\n\nLINK ZU MEINER (4) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/H1XvEeA4-shiro-meister-der-shuriken-mit-bild\n\nLINK ZU MEINER (7) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/YA8gxtJ3-melfice-taktiker-der-runenkriege-mit-bild\n\nLINK ZU MEINER (8) KONZEPT IDEE\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/xaEABl4A-yuga-demacias-runenmagier\n\n**Story: Verbesserungsvorschläge Erwünscht **\nShiris ist in Demacia aufgewachsen und  ihre Fähigkeiten als Assassinen waren in Demacia sehr bekannt aber da sie von den moralischen Vorstellungen Demacia nicht viel hält und lieber gesetzlos leben möchte ist Shiris auf die Reise nach Valoran gegangen um ihr Gesetzloses Leben zu führen.\n\nAuf ihrer Reise verfolgte Shiris eine Kugel und eine sehr tiefe Stimme Sprach zu Shiris. Dein Name ist doch Shiris, ich beobachte dich seit dem du auf dem Weg nach Valoran bist, was ist dein Begehr ? Shiris zögerte nicht lang, ich möchte Gesetzlos Leben und ich schließe mich erstmal niemanden an. Die Dunkle Kugel stand genau Shiris gegenüber und nahm Form an. \n\nShiris war von der Gestalt so beindruckt das sie ihre meinung ganz schnell geändert hat, aber bei dir würde ich eine ausnahme machen, wie ist dein Name ? Mein Name ist Gaddes und ich blicke tief in dein Herz, du bist die Person auf der ich schon mein ganzes Leben lang gewartet habe, berühre mich falls du die Kraft brauchst die du für dein Gesetzloses Leben führen möchtest, ich werde dich dann auf deiner Reise begleiten. \n\nShiris war noch nicht ganz davon überzeugt und fragte Gaddes, warum sollten wir beide ein Team bilden und vorallemdem, was hättest du davon ? Gaddes linkes Auge wurde größer und so sagte er darauf, weil ich auch Gesetzlos Leben möchte aber ich kann mich hier nicht frei bewegen ohne einen Meister zu haben! Wenn du meine Kraft annimmst wirst du Stärker und musst niemanden befürchten. Ohne Groß weiter darüber ein Gedanken zu verschwenden hat Shiris die Kraft von Gaddes Akzeptiert und sie veränderte sich vom aussehen her als sie Gaddes berührte und gesagt hat, ich nehme deine Angebot an. Gaddes erwiderte nur noch: Die Vereinigung ist abgeschlossen und ist nicht mehr Rückgängig zu machen. \n\nShiris, Um Gesertlos zu Leben muss man die Kräfte annnehmen die man auch Angeboten bekommt. \n\n\n**Attribute Verbesserungsvorschläge Erwünscht **\nSchaden: 55.376 (+3.2 pro Stufe) \nAngriffstempo: 0.650 (+2.74% pro Stufe) \nLeben: 500.4 (+70 pro Stufe) \nLauftempo: 300\nRüstung: 27.80 (+4.0 pro Stufe) \nMagieresistenz: 38.1 (+1.25 pro Stufe) \nLebensgeneration: 7.80 (+0.50 pro Stufe)\nEnergieregeneration: 60 \nReichweite: ???\n\n\n**Übersicht: Verbesserungsvorschläge Erwünscht **\nLeben: 6/10\nSchaden: 7/10\nEnergie: 200 \nSchwierigkeit: 6/10\n\n\n\n**Passive Fähigkeit: Noch in Bearbeitung**\nRüstung erhöht sich wenn eine Schwertaufladung geführt wird. \n\n**Verbesserungsvorschläge für die Passive und den Fähigkeiten sind hier Allgemein erwünscht. **\n\nQ Schwertertanz \nReichweite 600\nKosten: 40/35/30/25/20 Energie\nHinter Shris öffnet sich ein Portal wo Schwerter erscheinen und auf mehreren Gegnern abprallt, wobei die Gegner Blutungs Schaden erleiden. \n\nW Schattenschwert\nReichweite 900\nKosten: 75/70/70/65/55 \nShris Wirft ihr Schwert alle getroffenen Gegner werden für 1,0 Sekunden lang betäubt. \n\nE  Schwertaufladung\nAuf Sich Selbst\nKosten: Keine\nShiris Schwert wird Aufgeladen der Angriffschaden erhöht sich auf 50%\n \nR Gaddes Beschwören \nKosten: 100 Energie \nShiris beschwört Gaddes um Gegner in der Nähe Schaden zuzufügen. Gaddes erscheint in einer Kugel die explodiert und alle Gegner für 1,5 sekunden in Reichweite Betäubt. Bei einer Schwertaufladung erhöht sich der Schadenswert von Gaddes auf 50%. \n\n\nIch Begrüße hier zum Abschluss auch alle League of Legends Mitglieder, ich würde mich sehr darüber freuen wenn ihr mir helfen möchtet bei meinen Konzept und so wie ich Zeit habe werde ich dieses Konzept auch gerne Erweitern und Verbessern. Fähigkeits-Namen können verändert werden falls es diese schon gibt, die Namen dienen nur um auch zu wissen wie ich das Konzept aufgebaut habe. Ich denke hier gibt es noch genug Sachen die man überarbeiten kann. Falls meine Konzept Idee euch aber gefällt könnt ihr auch gerne dafür Voten. Leider habe ich nicht viel zu der Story geschrieben ihr könnt aber gerne Feedback hinterlassen.\n\n\nAbklingzeiten & Zusätzliche Informationen die ins Detail den Champion noch ausgeglichener machen weren sehr Nützlich, bitte habt nachsicht da ich in sowas kein experte bin.\n\nLiebe Grüße euer C.Blight","replies":[{"poster":"HandIOfIZombie","date":"2015-04-03T16:48:34.317+0000","up_votes":1,"down_votes":0,"body":"Umfrage Votet für oder gegen Shiris und Gaddes\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/BO4AgeWa-umfrage-der-champion-gladius-der-gladiator-der-noxus-mit-bild","replies":[]},{"poster":"HandIOfIZombie","date":"2015-03-21T17:42:32.293+0000","up_votes":1,"down_votes":0,"body":"Ein kleiner Hinweis den ich hier auch noch mit hinzufügen möchte, dieses Bild habe ich auch über meine FB Gruppe bekommen. Ich suche desweiteren auch noch Zeichner für meine Zweite FB Gruppe die nur für Zeichner ist, leider kann ich hier auch nicht sagen ob auf diesem Bild ein Copyright steht. Wenn ich in den FB Gruppen herum frage, schreibe ich auch dazu das es ein Bild sein muss wo kein Copyright drauf ist und was selbst gemacht worden ist. Falls aber meine FB Gruppe für Zeichner steht und ich sehe das die User das wirklich 100% selbst gezeichnet haben dann werde ich hier dazu auch was schreiben das dieses Bild vom Zeichner xxx ist und falls ein YouTube Kanal vorhanden ist, werde ich den Link hier mit rein setzen. Mehr Infos über dieses Thema gibt es in meiner Zweiten Konzept Idee.","replies":[]},{"poster":"HandIOfIZombie","date":"2015-03-19T21:53:41.600+0000","up_votes":1,"down_votes":0,"body":"Ich war mir nicht sicher und wollte das nicht zu OP machen, daher würde ich sagen, Stiefel der Beweglichkeit. Muss aber auch ehrlich zugeben, hier eine Optimale Balance zu finden ist nicht wirklich meine Stärke, deswegen sind ja auch Verbesserungsvorschläge erwünscht. Um deine frage etwas zu beantworten, deswegen auch der Rüstungsbonus über die Passive. Ich denke wenn es wirklich Interesse gibt werden sich mehr erfahrende Spieler oder vllt. unter anderem sich auch die Community sich hier melden und sich dazu äußern. Bedanke mich aber für dein Feedback :)  \n\nPS: Falls ich dich da falsch verstanden habe und mein Champion wegen den 50% zu OP rüber kommt, da müsste für alles eine Lösung geben, ich bin aber kein experte was die Details Anpassungen betreffen, Interessant were es für mich auf erster Linie auch, ob diese Idee euch in irgend einer Form gefällt. Falls ja oder nein könnt ihr gerne dazu euch äußern und es vllt. auch etwas mehr begründen was für oder gegen den Champion sprechen würde. \n\n\nLG - C.Blight","replies":[]},{"poster":"ThanhSon","date":"2015-03-19T20:22:38.453+0000","up_votes":1,"down_votes":0,"body":"Bitte achte doch darauf, dass wenn man gegen deinen vorgeschlagenen Champion spielt auch eine Chance hat sich bewegen zu können und er dich mit 50% mehr AD tötet.","replies":[]},{"poster":"HandIOfIZombie","date":"2015-03-19T19:48:11.036+0000","up_votes":1,"down_votes":0,"body":"Jetzt gibt es auch im groben eine Story für Shiris und Gaddes, Verbesserungsvorschläge sind hier auf jeden Fall erwünscht, nur wenn keiner sich dazu äußern möchte, dann werden leider Shiris und Gaddes nur im Archiv verstauben, eure Entscheidung ob die beiden eine Chance bekommen :)","replies":[]}]}