{"poster":"HandIOfIZombie","date":"2015-05-26T22:32:51.976+0000","title":"Brauche Tipps von Erfahrenden Spielern ( HP Siegel )","subforum":"Allgemeiner Chat","embed":{"description":"Hier ist eine Antwort auf die Frage: Lohnt sich der Einsatz der % hp-Runen? Und der Vergleich zu den hp/lvl-Runen und Essenzen. Bei diesem Video habe ich darauf geachtet, dass die angegebenen Werte der Wahrheit entsprechen, also nicht berechnet oder von leaguecraft.com übernommen wurden, da diese nicht genau sind.","url":"https://www.youtube.com/watch?v=9XWwSD0TN3k","image":"https://i.ytimg.com/vi/9XWwSD0TN3k/hqdefault.jpg"},"up_votes":1,"down_votes":1,"body":"habe mal ein Video dar&uuml;ber bei Maxim gefunden, das Video ist aber alt und beantwortet leider meine fragen nur teils. Wie schaut das heute so aus, weil es gab ja viele Patches, oder ist alles noch gleich geblieben `? Die Frage &uuml;ber die Leben &uuml;ber Prozente hat sich f&uuml;r mich denke erleidigt, werde mir das nicht holen ^^ aber wie schaut es hier aus ? \n\nF&uuml;r welche Champions k&ouml;nnte man das nutzen und bringt das was ? weil viele schreiben mir immer, hol dir lieber Armor. Es hat echt viel zeit gebraucht bis ich teils alle Items kennengelernt habe und auch wei&szlig; wann ich sie mir hole und wann nicht. Jetzt habe ich zwar viel Armor spiele aber abwechselnd die Klassen/Champions, da ich erst seit kurzem wieder genug EP habe, wollte ich jetzt die passenden Essenzen und Siegel dazu mir holen. \n\nIch wei&szlig; das Support sowas gut gebrauchen kann, spiele unter anderem auch gerne Nami, Cho Gath, Braum oder Aatrox der ja gut mit Lebensgeneration oder Leben harmoniert wenn man auch Punkte auf Abwehr skillt. Frage ist, ob die sowas gebrauchen k&ouml;nnen und welche Champions noch, bei vladimir k&ouml;nnte ich es mir evtl. noch vorstellen, habe den champion aber bis jetzt noch nicht getestet. Auch die Preisklasse unterscheidet sich hier groß, wo ich auch erstmal nachdenken muss, was besser ist weil manchmal gehe ich einfach davon aus das teuer auch gleich gut ist aber so möchte ich hier nicht vorgehen. \n\n**Leben auf Stufe 18: ** (+1,33 Leben pro Stufe (+24 auf Stufe 18)\n**Leben: **+8 Leben\n\n**Lebensregeneration alle 5 s: ** +0,56 Lebensregeneration alle 5 s\n**Lebensregen. alle 5 s auf Stufe:** (+0,11 Lebensreg. alle 5 s pro Stufe (+1,98 auf Stufe 18)","replies":[{"poster":"HandIOfIZombie","date":"2015-05-27T13:07:15.285+0000","up_votes":1,"down_votes":0,"body":"Also in Siegel und evtl. auch mit Essenzen zusammen, hat man doch genug HP aber vllt. kennt ihr ja Champions wo die HP Runen in den Glyphen oder in den Zeichen sogar sinn machen, also ich kenne keine **und habe darüber auch kein Video gefunden wo man etwas mehr auf Runen eingeht außer den Link den ich hier mit rein gesetzt habe.**","replies":[]},{"poster":"HandIOfIZombie","date":"2015-05-27T13:06:51.375+0000","up_votes":1,"down_votes":0,"body":"Wenn man bedenkt das man bei einem Support auch die HP Essenzen nutzen kann. \nMit den Flat HP Runen sind doch die Runen gemeint die nur Leben haben also nicht Pro Level. naja, die meisten Pros nehmen es aber Pro Level bringt doch viel mehr ? ","replies":[]},{"poster":"HandIOfIZombie","date":"2015-05-27T13:06:30.431+0000","up_votes":1,"down_votes":0,"body":"Lade mal alle Bilder hoch, also ich denke das es nicht ganz Sinnlos sein wird nur wie gesagt, kenne kein Champion der HP bei Zeichen oder Glyphen braucht.","replies":[]},{"poster":"HandIOfIZombie","date":"2015-05-27T13:04:59.992+0000","up_votes":1,"down_votes":0,"body":"**Da wir gerade bei Runen sind, -5 % Wartezeit nach Tod, für was ist die Rune ? Habe mich noch nicht mit allen Runen stark befasst. **\n\n**Und wie schaut es mit +1,5 % Lebensraub & +2 % Zaubervampir aus, ist der Effekt nicht der gleiche oder in wie fern unterscheiden sich die beiden Essenzen ? **\n\nJa, das mit den % HP Runen würde ich wie gesagt mir nicht holen. Taric und leona habe ich bis jetzt zwar noch nicht getestet, könnte ich aber gerne mal testen. ^^ \n\n**Habe mal gelesen das die Hpreg mehr bringen** wenn man auf seiner lane länger bleiben möchte als diese paar Hp die im lategame eh untergehen und im early auch relativ sind. Ist aber nicht meine aussage. Denke das ich sowas eh lieber mischen würde. \n\n**Was machen den HP Runen in Zeichen und Glyphen nen sinn wenn die meisten diese eh nur für Siegel nutzen ?** Okay ist nicht zu Unterschätzen aber bei den Siegel** bringt es generell mehr vorteil da die Runen zu nutzen oder nicht ?** Runen Konstellationen kenne ich nicht alle aber ich kenne jetzt auch kein Champ wo es was bringen könnte.","replies":[]},{"poster":"Black Mage","date":"2015-05-26T22:39:00.111+0000","up_votes":1,"down_votes":0,"body":"%HP runen sind schwachsinn, der effekt ist derartig gering, das man erst auf stufe 18 mit ca 3,4k leben einen ähnlichen effekt hat wie hp pro level (oder vlt sogar flat hp?), und dann ist auch der \"bonus\" derartig gering, das dies nichts ausmacht...\n\nrunen sind meistens eine early game investition, und mit %hp probierst du eine 50 min situation zu erschaffen, also etwas kaum machbares!\nFinger weg bis riot diese updated\n\nABER: die flat hp runen sind geil für viele champs, wenn der gegner kaum ad hat, oder man viel grund rüstung mit sich bringt (taric, leona).\n\nBenutze auf der Mid öfters mal HP runen, aber auch auf akali SEHR SEHR gerne, da sie kaum rüstung, etc bräuchte, jedoch aber mehr grund leben, und da eignen sich flat runen sehr.\n\n\nals support vlt in mischung mit armor, fürs bessere traden (mit minions, nicht umsonst auch winions genannt)","replies":[]}]}