{"poster":"HandIOfIZombie","date":"2015-07-13T15:57:24.925+0000","title":"Zombie & Underworld (Champion) Skins - Diskussionsrunde für Helloween","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"**Hallo Liebe League of Legends Fan Gemeinde und Skin Sammler,** \n\nDie Interesse der Skins ist ja sehr Unterschiedlich aber neben Ägyptische, Bio und Maschinen Skins finde ich die Zombie und Underworld Skins am Interessantesten, das soll aber nicht hei&szlig;en das &uuml;berwiegend alle Champions nur mit diesen Skins ausgestattet werden sollen weil sonst wird es in League of Legends f&uuml;r einige Spieler zu D&uuml;ster :P aber Spa&szlig; bei Seite, ich wei&szlig; das bis Oktober noch etwas hin ist aber lieber fr&uuml;her so eine Thema besprechen als wenn es zu sp&auml;t ist auch wenn wir hier nicht viel erreichen wie im englischen Forum evtl. \n\n**Hier sind die Champions die wir kennen und auch mir bekannt sind: **\nZombie Ryze, Zombie Brand, Geist Nocturne, Geist Gangplank, K&uuml;rbiskopf Fiddlesticks, Kopfloser Hecarim, Frankenstein Annie, Underworld Twisted Fate, \nUnderworld Wukong, Rabengeborene LeBlanc, Geisterbraut Morgana etc. \n\nIch hoffe mal das ich keine weiteren Skins vergessen habe, falls doch, schreibt einfach hier Feedback. Fakt ist, diese Skins w&uuml;rden gut zsm. passen als Collector Pack zu Oktober. Manche Skins davon konnte ich sogar ergattern da ich sie gerne sammel und auch nutze wenn ich zocke. \n\nDie frage an euch ist jetzt, ob ihr euch mehr solcher Skins euch vorstellen k&ouml;nnt und bei welchen Champions w&uuml;rde sowas auch gut stehen so ein Zombie Skin, Underworld Skin oder einer Geister Skin etc. habe zwar auch paar Vorschl&auml;ge und Ideen aber wir k&ouml;nnen ja auch dar&uuml;ber etwas Diskutieren oder auch w&uuml;nsche &auml;u&szlig;ern. \n\nIch habe paar Vorschl&auml;ge aber ob sie euch auch gefallen ist ja immer Geschmack Sache und vllt. gibt es ja bei den ganzen Champions auch bessere Vorschl&auml;ge, kann jedoch keine Umfrage machen da es so viele Champions gibt wo man evtl. das eine oder andere machen k&ouml;nnte oder sich gut vorstellen k&ouml;nnte. Werde auch paar Bilder dazu hochladen, falls ihr auch Bilder aus dem Netz gefunden habt oder selbst gemacht habt, k&ouml;nnt ihr diese ja hier gerne hochladen, w&uuml;rde es mir auf jeden fall mir anschauen ;) \n\n**Meine Vorschl&auml;ge f&uuml;r die Zombie Skins:** Zombie Annie, Zombie Nami, Zombie Fizz, Zombie Karma, Zombie Braum, Zombie Olaf, Zombie Mundo, Zombie Teemo, Zombie Yasuo, Zombie Shaco, Zombie Alistar\n\n**Meine Vorschl&auml;ge f&uuml;r die Underworld Skins:** Underworld Akali, Underworld Draven, Underworld Darius, Underworld Elise, Underworld Cho Gath, Underworld Mordekaiser, Underworld Sion, Underworld Syndra, Underworld Taric, Underworld Zilean, Underworld Shen, Underworld Azir \n\n**Meine Vorschl&auml;ge f&uuml;r Geister Skins:** Ghost Yorick, Ghost Zack, Ghost Zyra, Ghost Kassadin, Ghost Lucian, Ghost Miss Fortune, \n\nWie gesagt, das sind alles nur Vorschl&auml;ge und das alle Champions die jetzt hier aufgelistet werden jetzt ver&auml;ndert werden sollen ist einfach Unrealisierbar!\n\naber vllt. habt ihr ja Vorschl&auml;ge oder es gef&auml;llt euch der eine oder andere Vorschlag von mir, **ich denke das 2 oder 5 Champions ruhig eins dieser Skins bekommen k&ouml;nnten **oder eure Vorschl&auml;ge werden halt mehr Favorisiert. W&uuml;rde mich &uuml;ber eure Kommentare freuen, vllt. ist die Interesse ja gro&szlig; genug und durch euer Feedback ist die Inspiration da das auch Riot sagt, bei den Champions k&ouml;nnen wir auch den einen oder anderen Champion so einen Skin Verpassen und zu Oktober mit einem Collector Pack im Shop anbieten.\n\nLG Hand of Zombie (Crowley Blight)","replies":[{"poster":"HandIOfIZombie","date":"2015-07-14T02:31:14.111+0000","up_votes":3,"down_votes":0,"body":"habe noch ein bild gefunden ^^","replies":[]},{"poster":"TheLesbianAkali","date":"2015-07-13T23:31:12.462+0000","up_votes":2,"down_votes":0,"body":"Omg ich wäre aucch so gerne für die Akali !!! Und ne grusselige Syndra wäree mir  echt lieb <3 ...wobei ich mir sowas wie geisterbraut sona wünnschen würde..weil die schwebt ja auch... und sonst jaaa....   kalista glaub ich kann man nicht viel machen..... {{champion:84}}","replies":[]},{"poster":"HandIOfIZombie","date":"2015-10-22T17:24:40.289+0000","up_votes":1,"down_votes":0,"body":"Habe noch was gefunden.... \n\nhttp://apollo-na-uploads.s3.amazonaws.com/1426169301446/21-8-days.jpg  \n- Underworld Shyvana\n\nhttp://img2.leaguecraft.com/skins/asset/skin_1435087497_760px_62553_1.jpg - Underworld Renekton \n\nhttp://2.bp.blogspot.com/-HsFMGzCOVaU/UoN8sURdgMI/AAAAAAAAASs/W1m4lJaOV9Y/s1600/harrowin4.jpg  - Zombie Rengar\n\nhttps://cdn0.artstation.com/p/assets/covers/images/001/303/580/smaller_square/huthaifah-salamin-underworld-ahri-portriat.jpg?1444004200 - Underworld Ahri","replies":[]},{"poster":"HandIOfIZombie","date":"2015-10-22T17:06:05.751+0000","up_votes":1,"down_votes":0,"body":"Steht es jetzt fest das nur Nunu, Jinx und Pantheon Skins kommen ??? weil ich wollte Zombie Ryze und Zombie Brand...mhhh\n\nhttp://mein-mmo.de/lol-patch-521-zombie-skins-zilean/","replies":[]},{"poster":"AsInto","date":"2015-09-23T13:37:24.365+0000","up_votes":1,"down_votes":0,"body":"KÜRBISKOPF MORDE <3<3<3","replies":[]},{"poster":"Rogreg","date":"2015-07-18T05:43:57.650+0000","up_votes":1,"down_votes":0,"body":"FIZZI!!!!!!{{champion:105}}","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T14:24:00.594+0000","up_votes":1,"down_votes":0,"body":"naja, also ein Shyvana Skin der Skelet artig ist den gibt es ja bereits schon aber das bild kannste trz. gerne senden ^^","replies":[]},{"poster":"TheLesbianAkali","date":"2015-07-14T08:04:36.588+0000","up_votes":1,"down_votes":0,"body":"1. * Hey hey hey !!! Ein richtigg genialer skin ist auch noch im internet als bild. Wolte ihn einfügeen aber bin mit handy on und da gehts nicht..... eine shyvana die so skelet artig ist und  grünnnes feuer ...der drache siet auch echt hammer aus..{{champion:102}}","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:33:49.308+0000","up_votes":1,"down_votes":0,"body":"Katarina, mehr Bilder habe ich jetzt nicht gefunden aber am besten kann man sich ja neue Skins erst vorstellen wenn es dazu auch Bilder gibt, habe die alle aus dem Internet gefunden. Wie gesagt, falls euch solche Skins Interessieren dann kann hier jeder ruhig Feedback Hinterlassen. \n\n**Bei welchen Champions könnt ihr euch welchen Halloween Skins vorstellen ?** gehe mal davon aus das es auch noch ganz andere Variationen gibt aber hier in Deutschland ist glaube Halloween nicht so besonders wie in Amerika. Daher ist diese Weiterleitung auch unter anderem auch nur ein Wunschgedanke :( aber diese kann man ja gerne äußern, finde ich weil deswegen ist ja das Forum schließlich auch da ^^","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:29:56.761+0000","up_votes":1,"down_votes":0,"body":"Olaf","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:29:08.578+0000","up_votes":1,"down_votes":0,"body":"Azir, glaube das soll nicht den Underworld Skin darstellen.","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:28:39.131+0000","up_votes":1,"down_votes":0,"body":"Aatrox","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:28:19.110+0000","up_votes":1,"down_votes":0,"body":"Morgana","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:26:13.439+0000","up_votes":1,"down_votes":0,"body":"Jinx, passt auch gut zu Halloween ^^","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:24:50.708+0000","up_votes":1,"down_votes":0,"body":"Zed","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:23:15.203+0000","up_votes":1,"down_votes":0,"body":"Miss Fortune","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-14T01:22:47.779+0000","up_votes":1,"down_votes":0,"body":"Die Idee mit Geisterbraut Sona ist auch keine schlechte Idee ^^ Glaube aber auch das es viele user gab die sich den alten Skin von Sion als Zombie sich wieder gewünscht haben, frage ist nur wie Riot sowas immer hand haben, gibt es für diese Skin reihe immer nur eine bestimmte anzahl an skins die raus gehen wie max. 3 oder 5 ? \n\n**habe hier noch ein anderen link, könnt gerne hier auch mal rein schauen. Underworld Azir + Video** http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HzeUuMKj-underworld-azir\n\nHabe noch mehr Bilder im Internet gefunden aber ich denke hier gibt es echt eine menge an Kombinationen und Möglichkeiten, meist wird ja sogar was umgesetzt was sich die Spielergemeinde sich am ehesten vorstellt oder sogar als Skin sehen & haben möchten, wenns z.b Akali sein soll, warum nicht ^^ Ich würde mich schon freuen wenn aus jeder Kategorie generell was neues kommen würde auch wenn es nur ein Champion ist.","replies":[]},{"poster":"HandIOfIZombie","date":"2015-07-13T16:01:48.276+0000","up_votes":1,"down_votes":0,"body":"Hier, das habe ich auch im Internet gefunden.","replies":[{"poster":"Micgwan","date":"2015-07-13T23:20:33.187+0000","up_votes":1,"down_votes":0,"body":"Jo hab ich auch schon mal gesehen. Fände diesen Skin AWESOME!!!\nUnd des Annie Bild schaud ja mal HAMMER aus!","replies":[]}]}]}