{"poster":"Eat A Booty Gang","date":"2014-09-14T19:25:21.758+0000","title":"Gnar isn't Gnar enough?","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"Before anyone trolls or makes any uneducated remarks just remember this is MY OPINION and I'm just voicing it. \r\n\r\nAnyway, ever since Gnar came out I feel like people just thought he was cute and left it at that without realizing his true potential. Since the second I saw him I knew what he was good for and I could see the true havoc he could unleash. Now since he has two hugely different play styles i will break each one down separately. As mini Gnar you are a ranged slippery annoying little Yordle.  His Q has amazing range, and you can reduce the cooldown by catching it (which would be ridiculously long if you didn't). His W is an amazing passive if you know how to use it in combination with his boomerang and auto attack, and his hop is such an amazing gap closer/final blow/or getaway. Mini Gnar I think is almost perfectly executed. He's squishy but mobile, his auto attack has a low range but his Q makes up for that, and his other two abilities just add to his mobility. He's great to use, the only problem I find with mini Gnar is his range. I don't use auto attack a lot with him, when going up against another ranged champ his auto is almost useless. Combined with his squishy-ness a battle against another range champ is almost completely futile.  Hopping in or flashing within range is simply not enough. Using boomerang to slow and getting in range isn't enough either 'cause you're already being hit by a few auto attacks before you can even get a hit in. The only way around this is to poke the crap out of the ranged champ by using your Q. Now I have absolutely no problem with this considering he uses no mana, BUT killing someone almost solely on your boomerang is not an easy task. Sooner or later you either start becoming predictable or the boomerang stops doing enough damage to be useful as a killing tool. The only times I really find I'm killing people with the boomerang is if they are running away on low health or if they are tower hugging. Now once again I don't really have a problem with this, but I feel like the boomerang should be more of a killing tool than a poke. The boomerang almost seems like the biggest aspect to Gnar even more than his transformation. Without the boomerang mini Gnar is almost completely useless. Now to fix this without making the boomerang OP I feel like you should get rid of the line indicating where the boomerang is going to go cause let's be honest it's going to go in a straight line it doesn't curve or go anywhere else and it's slow enough to predict where it's going to go. Honestly if you need that line I don't think you should play Gnar, his boomerang is the biggest aspect and if you can't catch it then he's not your hero. Getting rid of the line would greatly increase the learning curve on him seperating the good Gnars from the bad ones. Now to balance getting rid of the line I think you should either make the CD instant when caught or just give it a slight damage boost OR at least let it hit targets a second time also adding another aspect, where the opposing champion just can't walk in a straight line towards you, they are more likely to move out of the way. I can see people saying everyone is going to abuse the boomerang but this weirdly enough is where Mega Gnar comes into play.\r\n\r\nMega Gnar, my favorite half. Every time you use an ability or attack, mini gnar gains rage, and once that rage bar fills he turns mega (so you can't really abuse the boomerang because he is going to transform sooner or later)! While Mini Gnar is swift and agile, able to easily pick off single champs, he lacks a lot in the team fights. If you've played top lane Gnar you know how annoying the early game ganks are. It's almost impossible to take on more than one decent player with him, but no fear the angrier you get Gnar gets angry too. Mega Gnar is the complete opposite of mini. He's slow, kinda tank, GAINS HEALTH when you transform into him, and all his abilities effect more than 1 target. Mega Gnar is awesome, in my first day of playing as Gnar I got two quadra kills with him and I was hyped!  He's just a complete beast! But, I think there is a couple things that can be improved on. First off people say you can't control his transformations and I immediately call BULL**** on those people. If you use ANY ability Gnar will transform and use that ability.  Do you know how many times I've waited to transform just to surprise the other team? Running away as mini Gnar when at low health and then turning around and using wallop or boulder toss or even his ult to stun or slow the opponent while you're gaining health to sustain for the rest of your combo is a fun trick. But other than diving into team battles and stunning people Mega Gnar isn't really all that mega. Health isn't a problem,  I like the fact you gain health and I feel it's around the appropriate mark for him. His damage, armor and magic resistance I feel is kinda lacking though. Mega Gnar is slow, and that's to be expected, but it's a real curse sometimes especially when it feels like you're trying to run away or close in but your opponent is constantly chipping your health down before you can do anything. Many times I've seen people have actually waited till I turned mega because they know I'm not fast enough to run away and the second I start trying  to run they use that opportunity to chip at my health and the second I try and turn around to go after them they are easily able to escape without worry. Mega Gnar should be scary, he should make a single champion tremble and should make a whole team disburse. Whenever though mini turns mega I feel like everyone instantly gangs up on him killing him almost instantly.  No one is afraid of mega, I think people almost preferably want to fight mega instead of mini. He's just a little bit under powered given his movement speed. To fix this I feel he should be given AOE to his basic attacks. When attacking mega Gnar almost looks like he's making the ground explode in front of him so why not add some AOE for the animation ? Makes sense to me, he's the biggest champ, everyone is going to be attacking him so why can't he attack everyone too? And lastly such a big guy should be able to take a bit of a beating. Mega Gnar suffers from this A LOT late game, besides for his ult and wallop he's almost useless after like 40 mins or even less and mini gnar is only so good up to a point too, after a while every fight is a team fight and mini is not that good at all in team fights. These are just some things I think that would help Gnar feel a lot better and make his two extremes a lot more extreme. Feel free to tell me why or why not these changes would be good, but remember this is just my opinion and if you don't like it you don't need to comment. But Gnar is so much fun to play, and all the potential is there,  I feel like he just needs to be given a chance :).","replies":[{"poster":"Xyphios","date":"2014-09-14T21:42:40.998+0000","up_votes":2,"down_votes":0,"body":"{{champion:150}} is a bruiser not a a full AD assasin so if your one of those people who build this{{item:3085}} {{item:3087}} {{item:3046}}{{item:3074}}  ...get out of the game cuz your part of the reason why people think he sucks... he is in fact OP.The squishy problem your having with gnar is probably because your not building him right.By the way this is his build/build order{{item:3153}}  {{item:3143}}{{item:3078}} (always build these first three items,if adc fed get{{item:3075}} instead of {{item:3143}} ,another replacement for{{item:3143}} is a {{item:3068}} ){{item:3142}} or{{item:3172}} then{{item:3111}} ,{{item:3047}} and finally {{item:3065}},{{item:3102}}  or{{item:3083}} ","replies":[{"poster":"Meowstifer","date":"2015-06-23T21:29:01.529+0000","up_votes":1,"down_votes":0,"body":"black cleaver first, sir","replies":[]}]},{"poster":"Mistress Madoka","date":"2014-09-14T21:58:38.460+0000","up_votes":1,"down_votes":0,"body":"The Line indicator Is fine, really. I just wish the enemy couldn't See it. because sometimes the boomerang goes off in a weird direction that leaves me going \"dafuq\"\n\nAlso, Gnar isn't THAT Squishy. And you can build some good health on him pretty fast (Pretty sure that's part of the reason One of his core items is the Triforce)\n\nGnar's AutoAttacks are Great, assuming you're not against a Teemo. Every 3rd hit with his W on does a fuckton of Extra Damage, So Getting that 3rd hit in Lets you not only Chase/Escape more Effectively, but it also discourages the enemy from Following you further. Even Teemo isn't the Best Against Gnar, as He has to Get WELL within Range of All of Gnar's abilities.\n\nMega Gnar is a Lot of fun, too. I was just playing Ascension as gnar and we were losing untill I Hop/Crunched my Way in And Stole the Ancient Ascendent. Mega Mega Gnar is OP as fuck.\n\n{{champion:150}}","replies":[{"poster":"Meowstifer","date":"2015-06-23T21:32:01.762+0000","up_votes":1,"down_votes":0,"body":"enemies cant see that line, and it goes off in the direction you are running in when it comes back to you, so that u catch it if u dont stop running in the same direction. you can use this to hit things on the way back if people are dodging it too well, or if u miss u can at least direct it into the creeps","replies":[]}]},{"poster":"ShadowKnight1224","date":"2014-09-14T23:31:45.675+0000","up_votes":1,"down_votes":0,"body":"I feel that Gnar is extremely powerful right now and he NEEDS the flaws that you point out to make him balanced. The thing about Gnar is that even if you shut him down in lane, his Vayne-like W lets him do reliable and constant damage to anyone even if he wasn't allowed to farm items. His mega-gnar form packs a stupid amount of aoe cc that can still net your team kills even if you are so underfed that you die in the process. If you are behind and you trade your life for 2+ kills, it was definitely an asset to the team. Unlike top laners like Fiora, Riven and so on, Gnar can still be useful in either form whether he falls behind or not.\n\nAnd in lane, he needs to be weaker than average to compensate for the fact that he will always be useful in teamfights. If he was a safe laner and he still had the killing power of mini-Gnar or the aoe cc of mega-gnar, he would be a game-warping champion.","replies":[]}]}