{"poster":"I have no Mana","date":"2018-06-04T22:52:23.032+0000","title":"Unfaires Matchup Sytem","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":5,"body":"bergen)\r\nMoin\r\n\r\nDiese Frage hab ich im Kopf seit dem ich Lol Spiele.\r\nAnfangs dachte ich das es mir so vorkam oder andere gr&uuml;nde h&auml;tte aber seit l&auml;ngerer zeit hat sich meine Vermutung best&auml;tigt.\r\n\r\nIch als Gold 5 Spieler (Ich wei&szlig; ist krass...) wei&szlig; das man immer auf sich selbst achten sollte und nicht auf andere im Spiel (Flame).\r\nABER\r\n\r\n:\r\nIch bekomme Spiele wo meine Gegner schon Platin oder Diamant sind ( ex-- Master war auch dabei) und ja auch in meinem Team ist mal EIN Diamant Spieler dabei aber auch das st&ouml;rt mich.\r\nBSP:\r\n\r\nIch wollte ein bisschen Corki spielen f&uuml;rs Ranked und Nat&uuml;rlich spiele ich nicht First time Corki in Ranked weshalb ich ein Normalgame startete um ihn zu trainieren. Mein Gegner war Zoe.\r\n\r\nIch dachte mir nichts bei. Poken usw\r\n\r\nAls aber ersten Vasallen kamen lief alles noch ganz normal. Bis ich bemerkt habe (bzw die Bef&uuml;rchtung hatte) das ich WIEDER gegen einen Gegner spiele der weit aus mehr erfahrener ist als ich.\r\n\r\n W&auml;hrenddessen kam der gegnerische Jgl vorbei... oft vorbei (Fiddle Dia5 OTP)\r\n Zoe hat mich komplett zerst&ouml;rt aus dem Game (Zoe Main Dia4)\r\n Gegner Kayle wurde zum Beast (Plat4)\r\n Gegner Vayne hat sich am lvl19 Draven hoch gefeedet (Vayne Plat 1)\r\n Pyke war Silber 4\r\n\r\n Ich (first time Corki Gold 5)\r\n Verb&uuml;ndeter Jgl war ein Unranked Maokei (ja auch S7 UND S8)\r\n Verb&uuml;ndeter Top ist ein lvl30 Heimer Unranked (sein gegner war die Kayle...)\r\n Verb&uuml;ndeter ADC Draven lvl19 (Gegner lvl7 Vayne main Plat 1)\r\n Janna hatte die einzige &quot;Normale&quot; elo (Gold 4)\r\n\r\nWas noch wichtig ist das ich hier den Gegnern/Verb&uuml;ndeten die Schuld gebe sondern Riot.\r\nIch hab dann nochmal mit der Zoe ein bisschen geschrieben das das System nicht gut ist usw.\r\nAuch ist es wichtig das das Champion level nicht wirklich etwas aussagt nur das man &quot;gut&quot; ist mehr auch nicht nur finde ich es wichtig erw&auml;hnt zu haben in Kombination mit der Elo :)\r\n\r\nZudem ist es kein Einzelfall sonder passiert tats&auml;chlich Regelm&auml;&szlig;ig.\r\n\r\nWegen solch einem Spiel hab ich so gut wie 0 Erfahrung gesammelt und Zeit verschwendet.\r\nAuch (was fast der wichtigste Punkt ist) ist es total schade und ich nehme mir die Erlaubnis in namen aller Lol Spieler zu reden das solche Games als low Elo Spieler Keinen Spa&szlig; machen und man dann sich vornimmt den Champion nicht mehr zu spielen.\r\n\r\nFrage: Habt ihr eine Begr&uuml;ndung f&uuml;r solch eine Situation bzw. k&ouml;nnt ihr mir bitte erkl&auml;ren wie es zu solch einem Match kommt?\r\nIch meine wenn ich schon gegen Diamant spieler in Normal spielen muss wie sieht es denn bitte dann mit Ranked aus?\r\nHigh Master Spieler als Gegner dann (Joke)\r\n\r\nMFG","replies":[{"poster":"MeMyselfandBaal","date":"2018-06-05T02:14:27.253+0000","up_votes":3,"down_votes":0,"body":"Hmm... also wenn ich mir das Beschriebene Spiel angucke, fällt mir sofort eines auf: Die ach so furchtbare Zoe war nen Premade mit dem Pyke, der in der Vorsaison Bronze war. Und dem Gold I Fiddlesticks. Das ist für den TE natürlich immer noch suboptimal, aber soll Riot den Leuten verbieten im Unranked mit ihren Freunden zu zocken? Beim letzten Spiel des TEs sieht es nebenbei genau so aus... Willst du also den Leuten verbieten, dass sie mit ihren Freunden zusammen spielen? Dann würden solche Spiele wahrscheinlich verhindert werden...","replies":[]},{"poster":"OPChampsSucks","date":"2018-06-04T23:44:18.857+0000","up_votes":1,"down_votes":5,"body":"Das Championlvl sagt mehr aus als die Liga glaub mir. Liga ist hier nur noch bullshit und das schon seit mehreren Monaten. Aufsteigen nach Skill ist schon gar nicht mehr dran zu denken (ALLERFRÜHESTENS VLLT AB DIA 5) sondern nur nach RNG ob man selber die AFK-Spieler oder der Gegner die AFK-Spieler bekommt das ist wichtig zu erwähnen^^\n\nBegründung dafür ist ganz einfach. Jeder Modus hat eine unabhängige Wertung die dein Können beurteilen. Da jemand vielleicht in Ranked Challenger ist aber noch nie in Normalgames war kann es passieren das er durchaus mit unranked Playern spielen muss da jeder dort wieder bei einer Grundwertung anfängt.\nIn Normals ist das durchaus normal das solche Matches zustande kommen.\n\nÜbrigens verschwendest du NIE! Zeit nur weil ein Game nicht so gut läuft. Du musst trotzdem Entscheidungen treffen, du kannst trotzdem dein Mikro/Macroplay verbessern du kannst deinen Champ lernen wie er sich gut spielen lässt usw. Wer aus benachteiligten Matches keine Erfahrung gewinnt der hat keine Ahnung von League und sollte noch lange normals spielen bevor er in Rankeds anderen Leuten die Games versaut (auch n fakt)\n\nSpaß macht es vielleicht nicht zu verlieren aber man sollte trotzdem das game nicht als verloren ansehen sondern als eine Lektion wie du dich verbessern kannst damit so was seltener passiert.\n\nBei was ich dich aber beruhigen kann ist bei der Geschichte wie das dann in Ranked aussieht.\n\nWie gesagt startest du hier auch wieder mit einem Grundwert. Dieser liegt bei 1200. (silber 5/4)\n\nDh hier ist es abgesehen von den (ersten) Placement-Matches nicht möglich gegen Diaspieler zu spielen (sofern kein Smurf) wenn du nicht auf dem gleichen Level bist was dein Können angeht. Diagegner bekommst du ansonsten erst wenn du dann die entsprechende Wertung hast.\n\nJedoch auch ganz wichtig zu erwähnen die Wertung (MMR) ist nicht gleichzusetzen mit der Liga in der du dich befindest. Du kannst genau so gut Bronze 1 sein und eine Platin 1 MMR haben und umgekehrt. Ist zwar selten aber so was kommt vor. das siehst du dann an stark erhöhtem LP gewinn (35+)","replies":[{"poster":"Marksmansitter","date":"2018-06-05T06:25:48.692+0000","up_votes":3,"down_votes":0,"body":"Das Championlevel sagt genau so viel aus wie das level vom deinem Account. - nur das du viel gespielt hast. Du kannst 1000 games mit ahri z.B. haben, in deinem Profil sieht man die lvl 7 Marke aber auf op.gg sieht man die winrate von 30%. \n\nChampionlevel sind nur Deko","replies":[]},{"poster":"Sirrkas","date":"2018-06-04T23:54:59.687+0000","up_votes":2,"down_votes":0,"body":">Das Championlvl sagt mehr aus als die Liga glaub mir. Liga ist hier nur noch bullshit und das schon seit mehreren Monaten. Aufsteigen nach Skill ist schon gar nicht mehr dran zu denken (ALLERFRÜHESTENS VLLT AB DIA 5) sondern nur nach RNG ob man selber die AFK-Spieler oder der Gegner die AFK-Spieler bekommt das ist wichtig zu erwähnen^^\n\nAlso wenn, dann sagt das Championlevel lediglich aus, welchen Champion man überhaupt oder länger gespielt hat. Aber kein bisschen darüber, wie gut man mit dem ist. \n\nWobei Pech/Zufall natürlich die einfachste mögliche Ausrede ist, um sich nicht eingestehen zu müssen, nicht so gut zu sein, wie man es gerne wäre.","replies":[]}]},{"poster":"Necromant","date":"2018-06-05T06:17:08.221+0000","up_votes":1,"down_votes":0,"body":"Fiddle G1, MMR: 1747\nPyke Unranked: NONE\n\nlaut op.gg\nAngaben ohne Gewähr.","replies":[]},{"poster":"Sirrkas","date":"2018-06-04T23:41:20.812+0000","up_votes":1,"down_votes":0,"body":"Lass mich raten, du hast im falschen Bereich gepostet und mein Beitrag ist jetzt auch weg, den ich dir schon geschickt habe?\n\nHier nochmal die Kurzfassung. Der Grund dafür kann sein, dass die Leute in verschiedenen Warteschlangen verschiedene Wertungen haben. Eventuell bist du sonst im Normal besser, als im Ranked, der Dia deutlich schwächer als im Ranked etc. \nEtwa, weil der Dia im Normal meist experimentiert und herumalbert könnte er im Normal wie Gold sein. Während du sonst eigentlich wie Gold bist, aber durch den neuen Champ eher wie mittleres Silber Einfluss ausübst. \n\nAuch können Premadegruppen hier einen Einfluss haben.","replies":[]},{"poster":"I love you Malon","date":"2018-06-04T23:37:23.000+0000","up_votes":1,"down_votes":3,"body":"Elo sagt überhaupt nichts aus ...","replies":[{"poster":"Dreadlord Mike","date":"2018-06-05T13:54:19.425+0000","up_votes":1,"down_votes":0,"body":"Doch eigentlich sagt Elo eine ganze Menge aus, Championlvl sagen dafür aber garnichts aus.\nOder willst du bestreiten dass ein Dia team von 100 Spielen wesentlich mehr als 50% gegen ein Bronze team gewinnt?\nElo ist einfach grundsätzlich der jetzige Grad deines Skills, ZB mein Grad liegt gerade bei DIa 5/4 rum und deiner ist eben anders.","replies":[]}]},{"poster":"Bärenmarder","date":"2018-06-07T13:35:22.145+0000","up_votes":1,"down_votes":1,"body":"Er hat vollkommen recht, sobald man mal ne kleine winning streak hinlegt wird man gleich übel gepunisht durch das match up system, hab es selber erlebt.","replies":[]}]}