{"poster":"GodBiocore","date":"2016-01-27T19:35:45.365+0000","title":"Gehackt und 130 euro mit einem ungedeckten  konto","subforum":"Hilfe & Support","up_votes":2,"down_votes":1,"body":"Ich wurde gehackt. Dieser hacker hat mit meinem account 130 euro riotpoints gekauft. Jedoch war dieses konto nicht gedeckt und riot musste diese 130 euro ausgleichen. Jetzt ist mein konto gesperrt und riot verlangt von mir die 130 euro. Ich habe den support angeschrieben und gefragt ob sie die Transaktionen r&uuml;ckg&auml;ngig machen k&ouml;nnen  sie antworteten nein was soll ich tun?","replies":[{"poster":"p0hil","date":"2016-01-27T19:47:14.556+0000","up_votes":2,"down_votes":1,"body":"Vielleicht solltest du dem Support erstmal erklären, das dein Konto gehackt wurde ?\n\nDie würden dir dann sicher ein paar Fragen stellen, die nur DU beantworten kannst.\nAus deinem Post lese ich nur das du sie nur gefragt hast ob man die Transaktion rückgängig machen kann, aber nicht das du Bescheid gesagt hast, das dein Konto gehackt wurde.\n\nAusserdem ist es auch ein wenig deine eigene Schuld wenn du gehackt wurdest.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"GodBiocore","date":"2016-01-28T17:11:13.512+0000","up_votes":1,"down_votes":1,"body":"Ich habe dem support gesagt, dass ich gehackt wurde da meinte die selber Schuld. Das geld könne nur durch Geld beglichen werden. Das ist denen total egal.","replies":[{"poster":"p0hil","date":"2016-01-28T17:14:13.200+0000","up_votes":3,"down_votes":0,"body":"Klar, in gewisser Weiße ist es auch deine Schuld. Irgendwie musste der Hacker ja an deine Daten kommen.\nMalware, Spyware, Trojaner etc etc. Irgendwas wirst du evtl. auf deinem Rechner haben, oder dein Passwort ist einfach nur unsicher.\n\nKlar kann dies nur durch Geld beglichen werden. Nur wer soll es zahlen wenn Riot absolut keine Informationen dazu hat, wer der Hacker war.\nVorallem können die nicht einfach irgendwelche Leute beschuldigen, zum Beispiel wenn die die IP's vergleichen würden. Stell dir vor der, der evtl. beschenkt wurde von deinem Account aus, hat gar nicht's mit der Sache am Hut.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"GodBiocore","date":"2016-01-28T18:21:06.638+0000","up_votes":1,"down_votes":1,"body":"Das Problem ist das sie mir einige lösungen gesc hrieben haben und wenn ich drauf eingehen wollte ahben sie einfach gesagt ist nicht möglich nur mit überweisung","replies":[{"poster":"p0hil","date":"2016-01-28T18:43:23.089+0000","up_votes":1,"down_votes":0,"body":"Inwiefern wolltest du drauf eingehen ? Auf denen ihre Lösungen, oder auf deine eigene ?\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"GodBiocore","date":"2016-01-29T20:23:19.963+0000","up_votes":1,"down_votes":0,"body":"Auf deren Lösung aber irgenwie sind die völlig unkoorperativ","replies":[]}]}]}]}]}]}]}