{"poster":"Der Harlekín","date":"2017-01-15T21:52:30.050+0000","title":"Warum surrendern Spieler nicht?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":10,"body":"Der Titel sagt es schon.\r\n\r\nWarum surrendern Spieler nicht? In Rankedspielen (wir sprechen hier meistens von niedriger Elo im Silber Gold Bereich) wird nicht surrendert solange die Gegner nicht schon direkt vor dem Nexus stehen. Die Stats stehen bei 12:38 f&uuml;r die Gegner, wir haben vllt einen Tower down. Die Gegner haben 4 Drakes 1 Baron 5 Tower und 1 Inhib down. Minute 25 ist vorbei aber es wir partout nicht surrendert.\r\n\r\nMacht es den leuten Spa&szlig; zu verlieren oder solche Spiele die einfach nur noch Zeitverschwendung sind weiter zu spielen?","replies":[{"poster":"Atsùra","date":"2017-01-15T22:02:53.130+0000","up_votes":2,"down_votes":1,"body":"Einige denken vl, surrendern ist... doof. Gefällt ihnen einfach nicht. Punkt. \nAndere denken wiederrum boooaah ich werd mit dem Item jetzt viiieeel stärker und dann one shotte ich die... Manchmal klappt es dann wirklich (mit Glückk und  guten Teamkollegen die sich dann gegenseitig irgendwie beschützen), manchmal nicht. \nMach es einfach so... Sag, du würdest noch 1-2 Teamfights ausprobieren. Wenn du dann Glück hast, reißen sich die Leute zusammen und ihr schafft es, die Gegner zu bekämpfen... Nach 2 Teamfights sehen die meisten es dann auch ein, das man nichts mehr reißen kann^^","replies":[{"poster":"Der Harlekín","date":"2017-01-15T22:07:01.024+0000","up_votes":1,"down_votes":1,"body":"Naja das mit dem Teamfight ausprobieren ist ja eine ganz nette Idee, bloß ist das meist so, dass bereits vieles verloren ist. Die Stats sind komplett unausgeglichen, von kills können keine objectives folgen und wenn man aus kills keine objectivs schafft sind die kills auch relativ sinnlos.\n\nIch bin der Meinung, dass viele Spieler in dieser Elo nicht überreißen, wann ein Spiel verloren ist und wann man tatsächlich noch eine Chance hat.","replies":[{"poster":"SeaHorseCalamity","date":"2017-01-15T22:17:06.650+0000","up_votes":6,"down_votes":1,"body":"Ich bin einer dieser \"never surrender\"-typen.\nDas liegt daran, dass ich einfach Gefallen daran finde, das Spiel zu spielen. Von Champselect und neuer Q hab ich ja nichts. Ob ich gewinne oder verliere is mir komplett egal, denn ich spiele um zu Spielen. \n\nDas ist auch der Grund, warum ich Leute nicht mag, die solche Spiele als \"Zeitverschwendung\" bezeichen. Du spielst lol. Punkt. Ob du jetzt ein Spiel zu ende spielst, oder surrenderst und ein neues anfängst, macht in meinen Augen keinen Unterschied. Du wirst weiterhin lol spielen. Wenn du lol als Zeitverschwendung siehst, dann spiel das Spiel nicht.\n\nIch spiele meine Spiele zu Ende, denn ich hab versuche Spaß am Spiel zu haben. In Champselect und Loadingscreen, sowie Q-Wartezeit hab ich keinen Spaß.\n\nZuden gewinnt man gerade in dieser Elo viele Spiele, die eigentlich verloren scheinen.","replies":[{"poster":"Atsùra","date":"2017-01-16T16:37:21.855+0000","up_votes":1,"down_votes":0,"body":"Jedem das seine. Ich mache solange mit, bis keiner mehr Lust hat und entweder surrendert wird oder das Spiel einfach verloren ist und der Nexus zerstört wird. Der oben genannte Vorschlag war nur eine Idee.","replies":[]}]},{"poster":"0815xand0r","date":"2017-01-15T23:37:41.673+0000","up_votes":3,"down_votes":0,"body":"Gerade im Low-Elo-Bereich ist es doch so, dass die Teams es oft nicht schaffen, das Spiel zu beenden, selbst wenn sie einen starken Lead haben und sie machen deutlich mehr Fehler, so dass auch ein Comeback sehr viel wahrscheinlicher ist, als in höheren Elo-Bereichen. Da kann man auch schon mal gemütlich den Baron stealen, Leute out of position töten und somit das scheinbar verlorene Spiel noch drehen.\n\nIch persönlich surrendere auch eher ungern, wobei ich versuche realistisch zu bleiben. Was mich aber immer dazu bringen wird, NICHT aufzugeben, sind Mitspieler, die am besten schon nach dem Firstblood rumjammern, dass das Spiel verloren sei. Selbst wenn ich dann verlieren sollte, was in solchen Situationen eher wahrscheinlich ist, werde ich diesen Leuten nicht noch den Gefallen tun und aufgeben, nur weil sie grundlos beschlossen haben, das Spiel sei nach 5 Minuten entschieden.","replies":[]}]}]},{"poster":"Supportsmanlike","date":"2017-01-15T22:32:47.164+0000","up_votes":3,"down_votes":0,"body":"Ich hab letztens erst wieder ein Game verloren, bei dem mein Team die Gegner komplett aus dem Leben gestompt hat. Wir standen in der 20. Minute vor deren Nexus, aber mein Team hat es trotzdem noch geschafft es zu throwen.\nDeswegen surrendered man nicht.","replies":[]},{"poster":"zoriax","date":"2017-01-15T22:10:23.860+0000","up_votes":4,"down_votes":1,"body":"Im schnitt kann man 3von 10 spielen drehen. hört sich nicht viel an aber wegen 10 minuten hin oder her eine 30% Chance wegzuwerfen macht den unterschied zwischen aufsteigen und sitzen bleiben. Natürlich gibt es spiele 4-30 wo es wirklich keinen sinn macht aber 11-20 Surrender ich nicht vor allem wenn man vielleicht noch Lategamechamps hat die ab minute 35 erst richtig rocken.\n\nHabe auf jeden fall mehr spiele durch \"Nein\" klick gewonnen als verloren\n","replies":[{"poster":"SeaHorseCalamity","date":"2017-01-15T22:20:10.454+0000","up_votes":1,"down_votes":1,"body":"> Habe auf jeden fall mehr spiele durch \"Nein\" klick gewonnen als verloren\nkönnte daran liegen, dass man 99% der Spiele, die man aufgibt verliert.....\n\n99%, weil ich es schon geschafft habe ein Spiel das aufgegeben wurde zu gewinnen, weil die Gegner kurz nach uns aufgegeben und deshalb verloren haben. Warum das auch immer so ablief.","replies":[]}]},{"poster":"Missed Fortune","date":"2017-01-16T11:24:11.971+0000","up_votes":2,"down_votes":0,"body":"Ich bin auch so eine Trulla von der Sorte \"never surrender\". Warum auch nicht? Was ist so schlimm an ein bisschen Kampfgeist? Klar es gibt Spiele, da hilft alles kämpfen nicht - die verlierst du einfach. ABER es gibt halt auch diese Spiele, die komplett ausichtslos erscheinen und doch noch gewonnen werden. Weil der Gegner beispielsweise zu selbstsicher wird und anfängt Fehler zu machen. Oder dein Team im Gegensatz zum Gegner in der \"Not\" anfängt eisern zusammen zu halten und als eine Einheit zu agieren. Und ganz ehrlich, das sind diese Games an denen ich am meisten Freude habe. Wenn ich sehe dass ein eigentlich verlorenes Game durch Kampfgeist und absoluten Zusammenhalt noch rumgedreht wird.\n\nIch hatte kürzlich erst so ein Game: Man hatte uns die Base schon komplett eingerannt und war dabei unseren Nexus zu zerstören. Nur KogMaw lebte noch und schoß so lange er konnte um sich. Was geschah? Der Gegner wurde greedy. Statt zu beenden ging man auf ihn los.. alles für einen weiteren Kill. Das gab uns genug Zeit dass ich wieder da war und als Lux zusammen mit KogMaws Passiven fast das gesamte Gegnerteam ausschalten konnte. Der letzte musste flüchten. Ab da an knuddelten wir mit unserem Nexus bis die Inhibs wieder da waren und beseitigten alles was sich ihm näherte. Am Ende gewannen wir :D Ein Spiel ist erst dann verloren wenn der Nexus fällt.","replies":[]},{"poster":"ELOW Cronos","date":"2017-01-16T08:35:59.888+0000","up_votes":2,"down_votes":0,"body":"Ich hatte vor nicht all zu langer Zeit ein (normal-)Game bei dem mein Team die ganze Zeit vorne lag und wir ab dem Midgame 5v4 spielten. Wir haben in diesem Spiel mit unserem ersten Baron die komplette gegnerische Base inkl. der Nexustürme eingerissen. Die Gegner wollten allerdings trotz dem offenen Nexus, 3 verlorenen Inhibs und einem 4v5 nicht surrendern. \n\nDie Comb unserer Gegner war sehr stark in Teamfights hatte guten Waveclear, und skalierte sehr Gut ins Lategame, also haben sie einfach nichts weiteres gemacht als ihre Base zu verteidigen und sich hochzufarmen. \n\nObwohl mein Team noch 2 weitere male den Baron geholt hat, konnten wir das Spiel nicht beenden und haben am Ende nach einem verlorenen Teamfight (mit Baronbuff) das Spiel verloren. \n\nIch würde nicht mal sagen das mein Team sehr schlecht gespielt hat, sondern unsere Gegner einfach zu stur waren zu surrendern, sehr gut gespielt haben und uns einfach outscalten. \n\nGenau wegen Games wie diesem gibt man nicht auf.","replies":[]},{"poster":"Waldschrat86","date":"2017-01-16T05:57:52.100+0000","up_votes":2,"down_votes":0,"body":"Ganz einfach, weil in 99% der Fälle das Game eben noch nicht entschieden ist,es low-Elo ist oder die 5Sekunden bis der Nexus down ist den Bock auch nicht fett machen.\nKannst ja mal mitzählen wie oft surrender gefordert wird, bevor überhaupt mal ein Kampf als komplettes Team stattgefunden hat. \nKP, warum du überhaupt PvP spielst, wenn anstrengende Spiele, die gerade bei Erfolg den meisten Spaß machen, als verschwendete Zeit ansiehst.\nIch gehör nicht zur never surrender-Fraktion, aber es kommt selten vor.\nJa und dann gibt's da noch die Kandidaten, die meinen jetzt das Spiel sabotieren zu müssen, weil es ja angeblich verloren ist. Tja bei den Spezialisten drück ich aus Prinzip Nein, auch wenn ich normalerweise Ja drücken würde.\nSeh nicht ein, dass die absichtlich mein Spiel ruinieren, weil sie zu faul sind sich ein paar Minuten am Riemen zu reißen, um dann fröhlich ins nächste Game zu tingeln und wenn es da wieder nicht optimal läuft dieselbe Scheiße mit anderen abzuziehen.\nGab schon so einige Spiele, wo der \"its lost\"-Typ afk ging, das Ding aber eigentlich free win war, tja aber durch den AFK werden dann aus etwa 30 Minuten gern mal 60. Immer wieder besonders toll, wenn es so passiert und die Typen alle paar Minuten wieder joinen, um rauszufinden, ob das Game schon durch ist oder wieder einen Surrendervote starten, nur um danach wieder zu dcn,statt einfach nur ein paar Minuten normal zu spielen und den Sieg einzusacken. KP, warum man ins Spiel geht, wenn man gar nicht spielen will und 0 Spaß an Herausforderungen hat.\nDas Beste sind dann noch die, die schon innerhalb der ersten Minuten aufgeben, wenn was nicht so toll läuft, aber sich dann noch wundern, dass sie nicht aufsteigen oder ihren Rang halten können. Und selbst wenn es gelingt, \"verschwendet\" man mit der Methode viel mehr Zeit als wenn man die angeblich verlorenen Games einfach zu Ende spielt. Und warum? Weil es bei einem wirklch verlorenen Game für die Gegner echt kein Hexenwerk sein sollte, deine Base einzureißen, wenn ihnen das Probleme bereitet, ist das doch eigentlich ein klares Zeichen, dass das Ding eben noch nicht verloren ist. Tja und wenn sies könnten, aber nicht tun, ist doch auch gut, mehr als Fullbuild und Lvl. 18 kann keiner durch Kills werden, besonders interessant, wenn man Latgamechamps im Team hat und trotzdem schon früh die Surrendervotes kommen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-01-16T05:32:19.973+0000","up_votes":2,"down_votes":0,"body":"Kurze mich selbst sinnlos lobende Antwort: Darum: [Weil man auch nen 4vs5 nach nem Ragequit und mit nem Yi der einfach nur Splitpushed, weil er eigentlich keinen Bock mehr hat, noch gewinnen kann](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3014821150/21830463?tab=overview). \n\nLängere und realistischere Antwort: Weil man auch aus Niederlagen noch was lernen kann. Irgendwann wirst du mal in deiner Promo in Rückstand geraten und der Gegner kriegt nen Inhib down (Anmerkung: In 2 meiner 3 letzten Siege hatte der Gegner jeweils mindestens einen Inhib zerstört und trotzdem verloren.) Dann ist das aber gerade deine Promo und da willst du halt auch nicht aufgeben. Dann bist du auf ein Mal extrem froh darüber, dass du das Szenario, wie du dich gegen eine SuperminionWave verteidigst und nebenbei die anderen wichtigen Objekte im Blick behältst, damit du diese vielleicht stehlen kannst.\nGerade das Defensive Warden ist etwas... was halt kaum jemand bedenkt. Und was man auch irgendwie üben muss. Genau so wie Flankierungen und Teamfights mit einem Goldrückstand.\n\nStompen kann jeder. Das muss man auch nicht üben. Aber einen Rückstand drehen kann nicht jeder. Und das lernt man nur, in dem man in solchen Momenten an seinen Teamfights arbeitet. Sicher stellt, dass man seinen Schaden raus gedrückt bekommt, bevor man stirbt. \nIch bin in diesen Kämpfen relativ gut. Aber halt auch nur, weil ich es am Ende jeder Niederlage nochmal übe.\n\nOh und nebenbei: Bei dem von dir beschriebenen Szenario dauert das Ende des Spiels in 95% der Fälle 2 Minuten. Da macht ihr noch mal einen Teamfight, aus dem du dann die richtigen Lektionen ziehen kannst, und dann ist das Spiel beendet. Oder der Gegner ist wirklich so dumm und nutzt seinen Baron Vorteil nicht aus, dann gibt er euch aber auch die Chance zurück zu kommen. Aber auch das... muss man halt üben und versuchen.\n\nAbgesehen von 2 bis 5 Minuten Zeit verlierst du in diesen Momenten nichts. Und jetzt sage mir nicht, dass dir deine Zeit zu wertvoll ist und dass du diese 5 Minuten nicht hast. Wenn dem so wäre, hättest du nicht genügend Zeit um LoL zu spielen. \n\nAber ja... Dont play to win, play to improve. In jeder Sekunde des Spiels und egal wie es steht. Ist ein hilfreiches Mantra.","replies":[]},{"poster":"XenesisCH","date":"2017-01-15T23:24:54.720+0000","up_votes":3,"down_votes":1,"body":"Wer aufgibt hat verloren, wer weiterspielt kann verlieren.","replies":[]},{"poster":"Nycaria","date":"2017-01-15T22:01:52.258+0000","up_votes":3,"down_votes":1,"body":"Weil gerade in Silber und Gold noch extrem viele Fehler passieren, durch die man noch gewinnen kann :)","replies":[]},{"poster":"Snowgen","date":"2017-01-16T17:17:38.531+0000","up_votes":1,"down_votes":0,"body":"Die Leute spielen halt nicht nur fürs Gewinnen wie du. Die Leute haben Spaß am spielen und aus jeder Niederlage kann man was lernen. Ich hab die letzten Seasons auch gedacht wie du \" Egal wie das Spiel ist, nur gewinnen macht spaß\". \n\nDiese Season hab ich mir vorgenommen nicht einmal zu surrendern ( ausser ich werde halt überstimmt, aber dagegen kann man nichts machen), und bisher klappt es ganz gut, zumindest meine Spieleinstellung hat sich deutlich zum positiven geändert","replies":[]},{"poster":"Queen Noth","date":"2017-01-16T11:32:32.725+0000","up_votes":1,"down_votes":0,"body":"Weil Aufgeben umso weniger zu Sieg führt. \"Oh der Kampf ist schwerer oh nein, wir müssen sorort surrendern, bloß sich ja nicht mühe geben, Herausforderungen stellen, aus Fehlern und Schwierigkeiten lernen und sich nachher Partout wundern warum man ja nicht aus seiner Elohell rauskommt!\"","replies":[]},{"poster":"Ozuraak","date":"2017-01-16T08:44:00.703+0000","up_votes":1,"down_votes":0,"body":"Einfache Frage, einfache Antwort.\n\nWeil sie nicht wollen (aus welchen Gründen auch immer).\n\nFind dich damit ab. Wenn aufgegeben wird, war es eine demokratische Abstimmung und wenn nicht aufgegeben wird, war es genauso eine demokratische Abstimmung.","replies":[]},{"poster":"zoriax","date":"2017-01-15T23:48:06.621+0000","up_votes":1,"down_votes":0,"body":"Ach ja und dann gibt es noch den Glücksfaktor. Es könnte immernoch jemand im Gegner Team AFK gehen (Zwar unverdient aber im Rankt würd ich mich nicht beschweren) Auch wenn es im Eigenen Team wohl eher dazu kommt wenn es 2-23 steht.","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-01-17T16:43:02.043+0000","up_votes":1,"down_votes":1,"body":"man soll ja auch net wie eine kleine p*ssy surrendern man kann alles noch gewinnen man muss sich halt einfach nur mal zusammenreißen es ist in silber/gold so oft das die gegner greeden und throwen oder einfach nach 50 minuten kein bock mehr haben und leaven","replies":[]}]}