{"poster":"Antiogo","date":"2015-06-04T16:54:09.611+0000","title":"Ban 14 giorni","subforum":"Discussioni generali","up_votes":1,"down_votes":6,"body":"Gioco una partita, gnar mi flamma perch&eacute; sto perdendo la lane, io mi difendo dicendo a tutti di reportare lui come giocatore tossico che sa solo insultare... e che cosa succede?? Ban per 14 giorni. Guardo la mail dove &egrave; riportata la mia conversazione dove non ho detto nemmeno una parolaccia e giustamente ci vado di mezzo io. Complimenti riot. Sei la migliore. Per&ograve; si continua a fare skin e nuovi campioni eh.","replies":[{"poster":"Sìrjohn","date":"2015-06-04T16:59:06.375+0000","up_votes":1,"down_votes":0,"body":"Mostraci la conversazione così ti possiamo dare un parere.\n\nVenire bannati 14 giorni per aver chiesto di reportare uno mi sembra eccessivo","replies":[{"poster":"Antiogo","date":"2015-06-04T17:11:10.853+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sìrjohn,realm=EUW,application-id=MJVj50Jw,discussion-id=HtEtAEyQ,comment-id=0000,timestamp=2015-06-04T16:59:06.375+0000)\n>\n> Mostraci la conversazione così ti possiamo dare un parere.\n> \n> Venire bannati 14 giorni per aver chiesto di reportare uno mi sembra eccessivo\n\n\nle blanc lux is always here\nlux is here -.-\n0 ss\nteam rela\nrelax\nwe win\ndon't worry ;)\nno\nthat is win\neasy\nmy adc is perfect\ndon't worry\nno\nhe suck\nhe no suck\nlook?? my adc is OP\nvayne 3/4\nhe is good\nlook?\nwe are op\nbot is op\ndon't worry\nmy adc is smurf\nwe were trolling at the beginning\nbecause we are too OP\nand is easy win if we play 2 vs 2\ni'm not joking\nlet's see this\nwe are smurf\nfrom 0/3/3 to 1/4/13 in 10 min\nwhy you let nasus farm?\nnow is god\nteam report gnar toxic player that think negative\nteam remember to report gnar for kid that cry\ngnar sto cry.... when we will win this you will shut up don't worry\nwe too ;)\nyou will get 2 report\ndon't worry\nfor verbal abuse\nwe are n ot premade\nmp\nwe are kiddin you\nfrom 41 min\nbaron 1 min\ngnar that focus janna LOL\nOMG REK\nreksai take inibithor\ndon't farm\ntake inibithor\nomg\npls\nreport gnar for toxic player\npls report gnar for flame\nIF YOU SHUT UP WE WIN\nFOCUS ASHE AND LUX\nI JUST CAN'T BELIVE THAT YOU FOCUS VI\nAND NO ASHE\ngo finish\ngoooo\nGNAR AND REK GO AND TANK THE TORRET\nTEAM IF NASUS TELEPORT WE LOSE ALL BACK\nALL BACK\nsorry 50 hp\ni try to do my best\nif nasus use teleport is lost\nwin thanks bot\ngnar honor me\ngnar look\nthis is for you\ngnar honor me\n~~~~~~~~~~~~~~~~","replies":[{"poster":"RedmasterITA","date":"2015-06-04T18:03:26.406+0000","up_votes":5,"down_votes":0,"body":"Se la meta' delle cose che hai scritto erano sotto forma di ironia, allora hai utilizzato la chat solo per abusare verbalmente. \n\nDa sottolineare : Team Relax , ed è il primo che va Mad\nGG.","replies":[]},{"poster":"Buy Αrdent","date":"2015-06-04T17:44:42.595+0000","up_votes":1,"down_votes":0,"body":"Da quello che ho capito questo è ciò che hai scritto, e se non mi sbaglio potrebbero averti bannato per:\neasy\nhe suck\nmy adc is smurf (Detto cosi potrebbe essere inteso come boost)\nteam report gnar toxic player that think negative\nteam remember to report gnar for kid that cry\nE poi le palesi provocazioni\ngnar honor me\nthis is for you\ngnar honor me","replies":[]}]}]},{"poster":"Thresh Ebbasta","date":"2015-06-04T17:14:27.650+0000","up_votes":3,"down_votes":0,"body":"Magari ha sbagliato tasto, voleva onorarti","replies":[]},{"poster":"tiè","date":"2015-07-01T12:38:22.267+0000","up_votes":2,"down_votes":0,"body":"ti è andata bene: a me 14 giorni e 75 partite di chat limitata. Senza neanche potersi difendere. E dopo che sono stati loro che hanno diseducato la gente che gioca. Io gioco da molti anni e ho subito insulti di tutti i tipi senza che Riot facesse nulla. Solo ora i ban. Questo è il mio primo ban, non ho insultato nessuno, esortavo la gente a giocare bene e mi lamentavo, senza insulti, delle loro cattive strategie. Per esempio il jungler che se ne stava nella giungla vicino a me mentre ero attaccato da tre avversari e gli ho detto \"ma che fai stai a guardare?\" in inglese:\"seeing??\". Se non si possono dare indicazioni strategiche a che serve la chat? e poi non è eccessivo 14 giorni di ban + 75 partite di chat limitata? Riot subirà le conseguenze di tutto ciò molto presto: ho già visto zombie-players che fanno finta di giocare non chattano e tolgono piacere alle partite. Solidarietà a te, costoro non hanno imparato nulla dalla storia.","replies":[{"poster":"DanieleRC","date":"2015-07-01T13:38:16.525+0000","up_votes":1,"down_votes":0,"body":"amico mio, se vuoi divertirti, Heroes of The Storm, scuola Blizzard. \n\nCredimi, nessuno scrive un cazzo in chat, non esiste flame di alcun tipo, una community nettamente migliore di questa, partite più brevi e meno stressanti, da un mesetto abbiamo mollato sta m**da con amici miei, siamo tutti più sereni, non ci si innervosisce più e sopratutto (non sto qui ad elencarti i motivi) è un gioco studiato nettamente meglio! \n\nConvertiti amico mio!\n\nPS: Rioter di turno che probabilmente leggerai ed eliminerai questo post (come avete già fatto in precedenza), scendi dal piedistallo che qui fino a prova contraria ognuno può dire la propria con rispetto ed educazione. \n\nSembra na dittatura. \n\nFly down Riot, Blizz is back.","replies":[]}]},{"poster":"Antiogo","date":"2015-06-04T17:19:59.131+0000","up_votes":1,"down_votes":2,"body":"Io so solo che mi sembra una presa in giro... ormai non si può più dire niente che si viene reportati!! Ma la riot non capisce che il loro metodo di valutazione non funziona? Ditemi voi cosa ho detto di male.... il bello è che sicuramente a lui non succederà niente a differenza mia!!","replies":[{"poster":"APH Valar ","date":"2015-06-04T23:51:19.357+0000","up_votes":2,"down_votes":0,"body":"E tu che ne sai?","replies":[]}]},{"poster":"Endorat","date":"2015-06-04T17:26:09.810+0000","up_votes":2,"down_votes":1,"body":"Un ban di 14 giorni non viene dato solo per aver insultato in una partita. Le soluzioni sono 3: \n\n1) O avrai insultato in più e più partite pesantemente \n2) O hai usato in precedenza qualche hack, tipo quelli per vedere più da lontano (2 amici hanno preso 1 ban da 2 settimane per questo) \n3) Avrai fatto qualche altra cosa..tipo dare i tuoi dati a qualche tuo amico forse, o comunque altro perchè per bannare 14 giorni devi aver fatto qualcosa sicuramente :/","replies":[]},{"poster":"Krato5","date":"2015-07-02T04:37:50.167+0000","up_votes":1,"down_votes":0,"body":"Ma smettetela tutti va, io ho preso per ben 4 volte 14 giorni di ban consecutivi, appena finiti i 14 giorni dopo un giorno ancora e senza dire nulla a nessuno e mutando tutti dall'inizio, vai a cagare riot veramente. non esprimo altro perche veramente sto gioco è diventato una merda. uno gioca per divertirsi invece ormai siamo finiti nel ridicolo. Riot ripeto fanculo tu e i tuoi cazzo di computer di merda.","replies":[]},{"poster":"SirZeel","date":"2015-06-25T16:40:56.017+0000","up_votes":1,"down_votes":0,"body":"\"Report for think negative\" mi ha steso.\n\nComunque sì, ci sono gli estremi per il ban. Sono questi:\n\nwe were trolling at the beginning\nteam report gnar toxic player that think negative\nteam remember to report gnar for kid that cry\ngnar sto cry.... when we will win this you will shut up don't worry\nyou will get 2 report\ndon't worry\nfor verbal abuse\nreport gnar for toxic player\npls report gnar for flame\nIF YOU SHUT UP WE WIN\ngnar honor me\ngnar look\nthis is for you\ngnar honor me","replies":[]},{"poster":"Bebonair FA","date":"2015-06-25T11:23:47.589+0000","up_votes":1,"down_votes":0,"body":"Quindi con questo tipo di ban addio ai rewards di fine season? Per rewards intendo contornino, icona evocatore, skin vittoriosa etc..","replies":[]},{"poster":"Sìrjohn","date":"2015-06-05T14:06:47.920+0000","up_votes":1,"down_votes":0,"body":"Se non hai mai flammato prima (e questo lo sai solo tu), questa punizione è davvero ingiusta per un caso isolato.","replies":[]},{"poster":"Thix","date":"2015-06-04T17:02:42.979+0000","up_votes":1,"down_votes":0,"body":"Cosa centra il fatto che sei stato bannato col fatto che escono skin e nuovi campioni?\nlol","replies":[]},{"poster":"Antiogo","date":"2015-06-04T17:36:31.658+0000","up_votes":1,"down_votes":2,"body":"Posso assicurarvi che non mi sono mai messo a offendere con parolacce e purtroppo gli hack non so nemmeno cosa siano. I dati li ho solo io. Sinceramente sono deluso da questo gioco e lo staff sta facendo un pessimo lavoro. \nIl gioco è pieno di drophack, ti becchi ban ingiustamente, contatti il supporto e ti rispondono con dei copia e incolla.... ma scusa non lo capiscono che la situazione sta degenerando?? ma non leggono le nostre conversazioni e percepiscono questo malcontento?","replies":[{"poster":"Akela979","date":"2015-07-21T23:35:57.957+0000","up_votes":1,"down_votes":0,"body":"Io è il 3 ban da 14 giorni che prendo. Dopo il secondo, sono stato ATTENTISSIMO a non flammare ingame per nessuna ragione, semplicemente in questa partita il loro jungler ha fatto un ottimo lavoro e il ed il mio adcarry abbiamo perso la ane. Vi allego il chat log che la riot mi ha inviato (che coraggio) per giustificare il ban di 2 settimane. DITEMI VOI se è possibile...\n\njinx stop smurfing\n200 normal game?\nstfu garen\nSTOP TALK\nsilver scrub\njust eve gank us 2 times\ndone\n2 pink\nwasted cause no countergank\ntry to gank the overextended lane?\nlol\nsee my stat silver scrub\nthey have just abbeter\nsee my stat on all games\nsilver scrub\njugler make the difference\neve know how to move\nand just for know\nu see the kills on the support?\nso pro\nyes\nadd me on my main silver scrub\njust try to focus jinx no leona\naatrox\nok\nwe can win\nu r usefull garen\nflamer is ever usefull\nu play garen dat is all :D\n7 win streak\nindeed i have a bad team this time\nok\nyes sure\ni can blame silver player\never\n\n\nVoglio premettere 2 cose:\n\n1) SCRUB in slang significa \"arrogante, pallone gonfiato\" e non mi sembra nulla di cosi offensivo dare dell'arrogante a qualcuno.\n2) Voi ovviamente leggete solo la mia chat, ma Garen ha iniziato a flammarci dopo il primo gank diventando veramente tossico al minuto 15 e smettendo alla fine del game\n\nHo davvero faticato a mantenere la calma, e sono stato reportato PER IL MIO SCORE, non perché ho flammato, come potete constatare anche voi dal chat log. Se questo è un flame, io sono Angelina Jolie.\n\nIl problema e che i bimbimichia che prima mi hanno flammato e poi reportato lo hanno fatto per ABUSO VERBALE e dopo 5 minuti ecco che arriva il ban di 14 giorni.\n\nIl messaggio allegato parla di \"un attento esame del tuo account\". Ora perfavore, qualcuno mi spieghi come un sistema automatico, o comunque un rioter possa effettuare \"un attento esame\" in 5 minuti scarsi.\n\nSecondo voi questa conversazione è da ban? seriamente?","replies":[]}]},{"poster":"Antiogo","date":"2015-07-03T09:58:26.509+0000","up_votes":1,"down_votes":1,"body":"Io so solo che tutti vogliono fare kill e nessuno vuole vincere la partita... ti arrabbi perché sei l'unico che mira agli obiettivi a differenza che altri chasano invece di prendere le torri e passi pure per quello sbagliato... e poi ti riportano....e non fa niente che hai torto, la riot non si mette a guardare tutti i report e ti giudica, lei ti banna e basta.... si preoccupano di far uscire nuovi campioni e non di rifare l'intero sistema di segnalazioni... senza pensare a tutti i drophack!!","replies":[]}]}