{"poster":"KDA  I Ahri I","date":"2019-10-30T09:15:54.768+0000","title":"Neue Skins True Damage","subforum":"Skin- & Champion-Konzepte","up_votes":0,"down_votes":8,"body":"Liebes Riot-Team ich find es echt Schade, dass das Konzept von K/DA nicht weitergeführt wird und diese Fortnite artigen Skins mit Ekko und co anscheinend das Konzept ersetzen. Ich glaube das viele Spieler einen großen Gefallen an der Skin-Reihe K/DA gefunden haben und ich würde mir wünsche das dieses Konzept nicht im Sande verläuft. Es wäre einfach schön. \r\n\r\nLg KDA Ahri.","replies":[{"poster":"Ashildr","date":"2019-10-30T09:27:29.486+0000","up_votes":6,"down_votes":0,"body":"Ich finde die Idee, noch eine Band zu machen, eigentlich richtig gut. KDA war cool, also kann man da ruhig noch mehr machen. Gefällt mir auch besser, als noch mehr KDA Skins zu machen, da die Band einfach schon komplett ist. Was mich massiv an den neuen Skins stört, ist dass Akali nochmal dabei ist, nur weil sie bei KDA so beliebt war. Sie hat schon einen Band-Skin, da brauch sie nicht noch einen. Ansonsten, gefallen mir die neuen Skins.","replies":[{"poster":"Amycos Cyrus","date":"2019-10-30T09:57:45.212+0000","up_votes":2,"down_votes":1,"body":"Das Mit Akali hatten wir aber auch bei K/DA Ahri, die sogar in der Lore von K/DA auf Popstar-Ahri zurückgeführt wurde.\nRein von der Geschichte um True Damage (und man sieht es auch im Artwork das Akali-Skins) ist die Akali von True Damage sogar genau dieselbe Akali (K/DA, True Damage und Popstar-Ahri sind alle aus dem selben Universum) True Damage ist sozusagen eine Band die von K/DA-Akali unterstützt wird.","replies":[{"poster":"Ashildr","date":"2019-10-30T10:45:37.266+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=L7E6lhzo,discussion-id=UiRzIj5B,comment-id=00010001,timestamp=2019-10-30T09:57:45.212+0000)\n>\n> Das Mit Akali hatten wir aber auch bei K/DA Ahri, die sogar in der Lore von K/DA auf Popstar-Ahri zurückgeführt wurde.\n> Rein von der Geschichte um True Damage (und man sieht es auch im Artwork das Akali-Skins) ist die Akali von True Damage sogar genau dieselbe Akali (K/DA, True Damage und Popstar-Ahri sind alle aus dem selben Universum) True Damage ist sozusagen eine Band die von K/DA-Akali unterstützt wird.\n\nJa ich weiß ^^ Aber Popstar Ahri war in keiner Gruppe, das mit KDA war ja komplett was Neues. Und das ändert nichts an der Tatsache, dass sie nicht noch einen Gruppen-Band-Skin gebraucht hat :)","replies":[{"poster":"Amycos Cyrus","date":"2019-10-30T11:04:57.394+0000","up_votes":2,"down_votes":0,"body":"Ist halt so. Riot wollte die Zusammengehörigkeit darstellen und so wurde es halt erledigt.\nDas mit der Band war ja nichts Neues, denn es gab davor schon Pentakill.","replies":[]}]}]},{"poster":"Ráyleigh","date":"2019-10-30T09:29:15.666+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Rena","date":"2019-10-30T10:23:38.881+0000","up_votes":4,"down_votes":0,"body":"Was ist daran so schlecht?\nK/DA ist offensichtlich eine Skin-Reihe die K-Pop orientiert ist.\nMit anderen \"Skin-Bands\" könnte man durchaus auf anderen Genren aufbauen.","replies":[{"poster":"OT Riku","date":"2019-10-30T11:12:27.405+0000","up_votes":2,"down_votes":0,"body":"Siehe Metal/Rock fur Pentakill. \nJetzt Rap für Trudamage.","replies":[]}]},{"poster":"Blutwafu","date":"2019-10-30T09:26:31.824+0000","up_votes":3,"down_votes":3,"body":"Mit der Musik von KDA konnte ich nichts anfangen aber die Skins waren hübsch. Nur den Akali skin fand ich nicht so toll. Und diese neuen skins sehen kacke aus und mit der Musik konnte ich auch wieder nichts anfangen. Bringt einfach Pentakill zurück","replies":[{"poster":"Kanaldeckl","date":"2019-10-30T15:04:37.886+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Blutwafu,realm=EUW,application-id=L7E6lhzo,discussion-id=UiRzIj5B,comment-id=0000,timestamp=2019-10-30T09:26:31.824+0000)\n>\n> Mit der Musik von KDA konnte ich nichts anfangen aber die Skins waren hübsch. Nur den Akali skin fand ich nicht so toll. Und diese neuen skins sehen kacke aus und mit der Musik konnte ich auch wieder nichts anfangen. Bringt einfach Pentakill zurück\n\nIch finde bei Pentakill waren die Skins nicht so toll und die Musik auch nicht...","replies":[]},{"poster":"Megamaexx","date":"2019-10-30T09:35:12.647+0000","up_votes":2,"down_votes":0,"body":"Neue Musik von Pentakill ja, neue Skins Nein. Pentakill war mit 5 Membern komplett. Ich fand Kayle schon überflüssig.","replies":[]},{"poster":"Amycos Cyrus","date":"2019-10-30T09:54:33.901+0000","up_votes":1,"down_votes":0,"body":"Geschmackssache. Wobei ich vermute, dass Pentakill wie die anderen Musik-Skin-Reihen behandelt werden wird, was dazu führt, dass keine neuen Skins mehr dazu kommen.","replies":[]}]},{"poster":"Westcoast38","date":"2019-10-30T12:29:41.507+0000","up_votes":2,"down_votes":1,"body":"True Damage... Nächste Skin Reihe ist dann denk AP Damage mit Veigar, Syndra, Ori und Malzahar.","replies":[{"poster":"SgtBananenkuchen","date":"2019-10-31T11:00:56.178+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}} ","replies":[]}]},{"poster":"MarcizorZ","date":"2019-11-10T09:18:31.851+0000","up_votes":1,"down_votes":0,"body":"{{champion:246}} {{summoner:4}} {{summoner:14}} {{item:3147}} {{item:3142}} {{item:3053}} {{item:3026}} {{item:3036}} {{item:3814}}","replies":[]},{"poster":"SgtBananenkuchen","date":"2019-10-31T10:59:22.743+0000","up_votes":1,"down_votes":0,"body":"Wenn da jetzt nur noch Band-Skins kommen, dann gute Nacht ... KDA, okay. Ich selber hab den Akali Skin bekommen und benutze ihn echt gerne. Dass sie jetzt aber wieder einen Skin bekommt. ... wieso? Das stört mich sehr. Man hätte hier mehr machen können; vielleicht mal an den 90ern orientieren und True Damage als reine Boyband raus bringen sollen? Hätte doch auch was gehabt.\n\nAußerdem, Yasuo und Qi haben doch erst vor Kurzem neue Skins bekommen? Jetzt schon wieder, wirklich? Hätte noch gefehlt, dass Lux und Ashe Teil der Band sind und auch einen bekommen {{sticker:slayer-jinx-unamused}} \n\nGenerell finde ich die neuen Skins aber nicht so toll ... die Fähigkeiten bei Ekko z.B. sehen zwar recht schön aus, aber ich finde akustisch hätte man da noch etwas mehr machen können und auch Ekko an sich gefällt mir ingame optisch gar nicht. Ich war enttäuscht, dass der erste legendäre Skin für meinen Main so etwas wird ....","replies":[]},{"poster":"MSF Akito","date":"2019-10-30T18:09:03.787+0000","up_votes":1,"down_votes":0,"body":"Klar war KDA ganz nice. Aber inzwischen kann ich die Skins auch nicht mehr sehen. Sooo toll finde ich die garnicht mehr. Die True Damage Skins gefallen mir allerdings sehr gut. Und was dein Name angeht würde ich vermuten, dass du ein KDA Fangirl bist &amp; deshalb keine neuen Skins haben willst, die in eine andere Richtung gehen.. ^^","replies":[]},{"poster":"MeMyselfandBaal","date":"2019-10-30T14:54:50.177+0000","up_votes":1,"down_votes":0,"body":"K\\DA sind halt eine Band. Das ist hier nicht wie bei Destiny's Child, wo die Bandmitglieder beliebig ausgetauscht werden...","replies":[]},{"poster":"Amycos Cyrus","date":"2019-10-30T09:50:29.716+0000","up_votes":1,"down_votes":0,"body":"K/DA ist selbst nie das Konzept gewesen, sondern war eine Band in sich. Also eine geschlossene Gruppe von Skins (ähnlich den Event-Skins zu Halloween). Das Konzept dahinter ist jedoch eine Ansammlung von Bands/Solostars, die miteinander Konkurrieren oder zueinander aufsehen.\n\nAhri (Popstar Ahri) \"gründete\" die K/DA (Ahri, Eve, Akali und Kai'Sa).\nAkali (K/DA Akali) unterstützt die Gruppe True Damage (Ekko, Qiyana, Akali, Senna und Yasuo)\n\nMal sehen was für Projekte da noch kommen.","replies":[]},{"poster":"Megamaexx","date":"2019-10-30T09:39:17.042+0000","up_votes":1,"down_votes":0,"body":"KD/A Ist nicht einfach nur ne Skinreihe. Dahinter stecken ebenso Mitglieder einer Popgruppe, so wie Pentakill seine Metalband hat. Ich finds gut, dass sie den Fehler mit Kayle nicht bei KD/A wiederholen.","replies":[]}]}