{"poster":"Gruckets","date":"2017-11-01T00:21:00.364+0000","title":"Rammus absolutely wrecked me?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"I was playing the new buffed Urgot. Not a main or anything but, I know him enough to pull him out when I want to have some fun. But, last game I got a Rammus top. Early levels were a cake walk. He could barely farm and I could just Q him away from a wave. But, after his second back and a few items buys he rolled straight into me and 100-0ed with ignite. The rest of the game was just a a complete bumrush for the giant spider-man at that point and coming back was pretty much out of the question. \r\n\r\nSo, I come to these boards to ask. Was there anything I could&#039;ve done or does he just completely demolish Urgot no matter what?","replies":[{"poster":"Chembaron Yamada","date":"2017-11-01T00:39:13.137+0000","up_votes":1,"down_votes":0,"body":"As far as I know, they didn't ship the buff for Urgot that reduces the damage taken from bramble vest to 1/3 during W.\n\nThat means that you take the damage from bramble vest and Rammus' W 3 times per second if you use W on him. I never played the matchup myself, but that behaviour should mean that you get completely destroyed if you use W. Should be extremely hard to fight Rammus after him getting that item, it reduces your damage against him, he deals tons to you and he scales with the armor as well.\n\nLong story short: I guess Rammus counters you pretty hard and it probably gets worse, since they will most likely nerf Urgot soon (seems the last patch overbuffed him a bit).","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-11-01T00:36:36.856+0000","up_votes":1,"down_votes":0,"body":"Always respect the power of offmeta picks and their ability to surprise you in unpleasant ways.\n\nRammus is a godawful top laner, really.\n\nAll you need to do is lead him into a minion or stay in the middle of the wave as if you are playing against a single-target mage, he fails his knockup and is at a disadvantage, he gets pushed out and cant farm.","replies":[]}]}