{"poster":"ZorriLP","date":"2016-01-01T18:06:00.255+0000","title":"[Champion-Konzept] Trina- Die Hüterin der Elemente","subforum":"Skin- & Champion-Konzepte","up_votes":4,"down_votes":3,"body":"Name: Trina\nRolle: Magier / Support\nHerkunft: Ionia\n------\n**Splashart (Originalbild NICHT von mir, habe es nur leicht bearbeitet)**\nhttp://f.666kb.com/i/d56tu0x0b7maqkt66.jpg\n------\n**Freunde und Interaktionen:**\n{{champion:40}} : Mir raubst du nicht so schnell den Atem Janna. (lacht)\n{{champion:43}} : Hi Karma. Und? Wem bist du diesmal auf den Fersen? (lacht)\n{{champion:267}} : Wusstest du dass man anhand deiner Schuppen erkennt, wie Alt du bist Nami? Allerdings... musst du daf&uuml;r Tot sein... ok vergiss es (lacht verlegen)\n\n**Feinde und Interaktionen:**\n{{champion:63}} : Gleich hats sich Ausge-Brand! (lacht)\n{{champion:57}} : Hey du knorriger alter Baumstumpf! Dich verarbeite ich zu Feuerholz!\n{{champion:143}} : Nicht zu lange Wurzeln schlagen, Zyra.\n---\n---\n**Spr&uuml;che**\n\nJoke: Avatar- Zustand! ... Ach nein warte falsches Spiel.\nTaunt: Du kannst dir sogar aussuchen, mit welchem Element ich dich zuerst fertig mache!\n---\n-----\n**Geschichte**\n\n,,Als Herrscherin der Elemente hat man viel Verantwortung zu tragen. Naja. Sollte man haben, nicht so wie die Junge Trina. Sie ist etwas... Naja Eigen will ich es mal beschreiben. Wenn sie endlich mal auf mich h&ouml;ren w&uuml;rde, w&auml;re ihr Training viel einfacher aber nein, sie muss ja ihren dickkopf haben. Sie ist jung, vielleicht zu jung um dem, was auf sie zu kommt gewachsen zu sein. Da drau&szlig;en gibt es viele niedertr&auml;chtige Menschen, sogar hier in Ionia. Aber auch wenn sie jung ist, muss sie ihren verpflichtungen als H&uuml;terin der Elemente gerecht werden, und nicht nur andere mit Wasser abschie&szlig;en. Nun ja... unser aller Hoffnung liegt bei ihr. Wenn sie endlich zur vernunft kommt werde ich ihr erz&auml;hlen, zu was sie auserw&auml;hlt wurde.&quot;\n-Tagebuch von Karma, 18.11.2015\n\n,,Gro&szlig;e Macht ben&ouml;tigt gro&szlig;e Verantwortung. Manche m&uuml;ssen das halt erst noch erlernen&quot;- Karma\n----\n-----\n**F&auml;higkeiten:**\n\nPassive: Herrscherin der Elemente\nWenn Trina eine Fähigkeit aktiviert, erhält sie eine Aufladung (max 3 Aufladungen). Je nachdem welche Aufladungen sie hat, kann sie mit ihrer R unterschiedliche Fähigkeiten auslösen. Hat Trina keine Aufladung, verursachen ihre normalen Angriffe zusätzlich 50% ihrer AP als magischen Schaden. Ihre abklingzeitverringerung wird um 50% des gesamtwertes erhöht (max 60% (40% + 20%) CDR))\n-----------------\nQ: Waldsphere [10 Sekunden]\nTrina lädt 1 Waldenergie auf. Ist eine Waldsphäre aufgeladen, erhält sie zusätzlich 2,5/5/7,5/10/12% Lebensraub\n------------------\nW: Feuersphere [10 Sekunden]\nTrina lädt 1 Feuerenergie auf. Ihr nächster normaler Angriff fügt ihrem Zeil zusätzlich 2,5/5/7,5/10/12% ihrer AP als normalen Schaden zu.\n---------\nE: Wassersphere [10 Sekunden]\nTrina lädt 1 Wasserenergie auf. Trina's nächster normaler Angriff verlangsamt ihr Ziel um 2,5/5/7,5/10/12% für 2 Sekunden.\n-----------\nR: Entfesslung der Elemente [Abklingzeit variiert nach art der Fähigkeit]\nTrina entfesselt die Ladungen die sie besitzt. Je nach Ladung nutzt sie eine andere Fähigkeit. Ihre R an sich besitzt sehr wenig Abklingzeit. Die unten stehenden Werte zeigen an, wann die benutzten Elemente wieder verfügbar sind. Je nach Kombination steigt die Abklingzeit der Einzelnen Spheren.\n_(PnC = Point'n Click)_\n\n**Wald:** Trina entzieht ihrem Ziel einen prozentsatz an Leben und heilt sich dafür.  _(PnC)_ [10 Sekunden]\n**Feuer: **Trina schießt über 3 Sekunden einen Flammenstrahl aus ihrem Stab in ihre Blickrichtung und verursacht dabei magischen Schaden. Sie kann sich dabei bewegen, aber nicht ihre Blickrichtung ändern. _(Skillshot)_ [10 Sekunden]\n**Wasser:** Trina gibt sich oder einem Verbündeten für maximal 5 Sekunden eine Wasserblase als Schild, welcher 100/125/150/175/200 Schaden absorbiert _(PnC)_ [15 Sekunden]\n**Wald + Feuer:** Trina entzündet ihr Ziel für 5 Sekunden, wobei es jede Sekunde magischen Schaden erleidet. _(PnC)_ [20 Sekunden]\n**Feuer + Wasser:** Trina erschafft für 3/4/5 Sekunden an einer gewählten Stelle einen Nebel aus wasserdampf, welcher gegnerische Champions um 10/20/30% verlangsamt._ (PnC, Flächenzauber)_[20 Sekunden]\n**Wasser + Wald:** Trina erschafft für 3 Sekunden einen Baum an einer gewählten Stelle. In seiner Nähe werden alle Verbündeten geheilt. _(PnC)_ [25 Sekunden]\n\n**Wald + Feuer + Wasser:** Trina nutzt ihre vollen Kräfte aus und erschafft einen Elementaren Wirbelsturm in eine gewälte Richtung, welcher starken magischen Schaden verursacht._ (Skillshot)_ [30 Sekunden]\n\n------------\n--------\n**passende Items**\n\nMidlane: {{item:3165}} {{item:3089}} {{item:3285}} {{item:3174}} {{item:3100}} {{item:3151}} {{item:3115}} \nSupport: {{item:3092}} {{item:3165}} {{item:3190}} {{item:3116}} {{item:3115}} {{item:3504}} {{item:3050}}  \n\n\n**Tipps und Tricks**\n\nDa Trina sozusagen nur 1 Fähigkeit für den Kampf hat, benötigt ihr viel Abklingzeitveringerung. \n\nAchtet immer genau darauf welche Fähigkeit ihr aufladen wollt. Missklicks können nicht rückgängig gemacht werden.\n\nAchtet genau darauf, wann ihr welche Kombination der Fähigkeiten verwendet, da ihr nach dem einsatz einer Fähigkeit nur noch mit normalen Angriffen kämpfen könnt.\n------------------\n-----------------\nWie hat euch der Champ gefallen? Feedback oder verbesserungsvorschl&auml;ge?","replies":[{"poster":"ZorriLP","date":"2016-01-02T14:18:49.540+0000","up_votes":2,"down_votes":0,"body":"Update 02.01.2016\n\nTrina hat ein komplettes Rework des Skillsets bekommen und hat jetzt eine einzigartige Spielweise","replies":[{"poster":"StillYasuoMain","date":"2016-01-02T14:51:21.766+0000","up_votes":1,"down_votes":0,"body":"Hauptsächlich finde ich die Idee mit den Fähigkeiten gut.\nNur bei der Passive kann sie max 2 Aufladngen bekommen. Wie machts sie dann den Wirblesturm aus allen 3?\nDie Geschichte würde ich ein bischen umschreiben(Na ja, na ja, na ja...) \nund die Tipps verändern(man schreibt in Tipps normalerweise nicht wie schwer ein champ zu spielen ist und missclicks etc. und man schreibt sie in der \" du\" form). Sonst find ich den Champ(Vorallem die Fähigkeiten) eine gute idee.","replies":[{"poster":"ZorriLP","date":"2016-01-02T15:44:49.247+0000","up_votes":2,"down_votes":0,"body":"Ja da is mir ein fehler passiert da die Fähigkeit mit allen 3 elementen erst dazu kam nachdem ich die Passive fertig hatte danke :D\n\nGeschichte war ich etwas planlos was sie belangt ^^","replies":[{"poster":"StillYasuoMain","date":"2016-01-02T16:29:15.163+0000","up_votes":1,"down_votes":0,"body":"Ok dann verstehe ich jetzt die passive. \nName und Geschichte würde ich noch verändern. Sie könnte anstatt ein Kind auch ein Yordle sein:D\nUnd der Name gleicht ein bischen einem anderen Champ: Trina = Tristana","replies":[{"poster":"ZorriLP","date":"2016-01-02T16:49:48.569+0000","up_votes":2,"down_votes":0,"body":"Nope never Yordle :D sie ist ja eig auch kein kind sie ist eher so wie Jinx in dem alter und nochn bisschen verspielt.\nGeschichte mal sehen wenn mir was einfällt.\n\nnaja Trina leitet sich eig vom wort Tri sprich 3 ab, was ihre 3 Elemente wiederspiegelt und wie man auf dem Konzept-bild sieht hat sie 3 elementspheren in form eines dreiecks auf einer vorichtung am rücken, was das item {{item:3078}} wiederspiegeln soll (früherer name war: Trina- Die kraft der Dreieinigkeit (denke du weißt jez wieso sie Trina heist :D ))","replies":[{"poster":"StillYasuoMain","date":"2016-01-02T19:23:33.548+0000","up_votes":1,"down_votes":0,"body":"Aha verstehe:D\nAusser dieser Satz versteht nicht ganz:\nSie ist KEIN KIND, sie ist eher so wie Jinx in dem ALTER. Was für ein alter wenn sie kein Kind ist??","replies":[{"poster":"ZorriLP","date":"2016-01-02T19:55:46.224+0000","up_votes":2,"down_votes":0,"body":"naja als kind definiere ich jez sowas wie Annie oder Kog'Maw (is nach angaben auch noch eins :D) Jinx zähle ich eher als Teenie bzw denke ich so 18-21 :D","replies":[{"poster":"StillYasuoMain","date":"2016-01-02T22:27:13.912+0000","up_votes":1,"down_votes":0,"body":"K also ist Trina jetzt ein Kind oder Teenie?:D","replies":[{"poster":"ZorriLP","date":"2016-01-03T09:26:15.746+0000","up_votes":1,"down_votes":0,"body":"Teenie, also wie Jinx ca und fast genau so verrückt :D","replies":[{"poster":"StillYasuoMain","date":"2016-01-03T09:47:04.716+0000","up_votes":1,"down_votes":0,"body":"K:D\n","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Midnad","date":"2016-01-02T18:07:11.489+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZorriLP,realm=EUW,application-id=L7E6lhzo,discussion-id=hH7em8qP,comment-id=0001,timestamp=2016-01-02T14:18:49.540+0000)\n>\n> Update 02.01.2016\n> \n> Trina hat ein komplettes Rework des Skillsets bekommen und hat jetzt eine einzigartige Spielweise\n\nviel viel viel besser!! jetzt ist sie richtig nice","replies":[{"poster":"ZorriLP","date":"2016-01-02T18:45:31.723+0000","up_votes":2,"down_votes":0,"body":"danke ^^","replies":[]}]}]},{"poster":"Midnad","date":"2016-01-01T20:55:13.534+0000","up_votes":2,"down_votes":0,"body":"Weisst du, jeder Champion hat so das gewisse etwas, was ihn eben so besonders macht. Ich denke nicht, dass Trina mit den Elementen das grosse Etwas zum vorschein bringen kann. Mit einer überarbeitung würde ich dir raten.\n\n(nicht böse gemeint){{sticker:zombie-nunu-tears}}","replies":[{"poster":"ZorriLP","date":"2016-01-02T14:20:43.429+0000","up_votes":2,"down_votes":0,"body":"Trina ist jetzt komplett Überarbeitet. Wie findest du sie jetzt?","replies":[]}]},{"poster":"ZorriLP","date":"2016-02-16T16:08:41.896+0000","up_votes":1,"down_votes":0,"body":"Skill-Update 16.02.2016\n\nTrins's Q W und E haben jetzt einen zusätzlichen AA-Effekt wenn sie eine Sphere lädt, skalierend mit dem Level der Fähigkeit. \n\nUlt-Scaling bei der Feuer+Wasser combo überarbeitet. (Hatte vorher scaling für 5 level)","replies":[]},{"poster":"Eranell","date":"2016-01-03T23:12:12.382+0000","up_votes":1,"down_votes":0,"body":"Prinzipiell halte ich das Konzept für gut, allerdings geht hier nicht hervor, wie die Fähigkeiten leveln. Ich glaube kaum, dass du dem Ult 18 Level zugestehen willst, oder? Vielleicht könntest du den Passiv ihren Autos abhängig von der Energien die sie zuletzt geladen hat zusätzliche Effekte geben anstatt ihren Schaden zu erhöhen wenn sie keine Energie geladen hat. Außerdem solltest du dir vielleicht überlegen, was sie so macht, wenn sie das selbe Element mehrfach geladen hat. Das wären so meine Ideen.","replies":[{"poster":"ZorriLP","date":"2016-01-04T15:38:14.818+0000","up_votes":1,"down_votes":0,"body":"gute kritik habe ich nicht dran gedacht ^^ werde mir da noch was einfallen lassen :D","replies":[]}]}]}