{"poster":"lol Allrounder","date":"2017-07-28T21:13:28.247+0000","title":"Aufstieg geht bei mir nicht","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"seitdem Aufstieg heute raus ist kann ich es nicht spielen ich habe gerade eine game begonnen aber jedesmal wenn ich 2 min spiele f&auml;hrt der laptop wegen &uuml;berlastung runter ich habe mich 2 mal reconnected aber das gleiche ich spiele &uuml;brigens auch auf die minimalsten Einstellungen und ohne Audio, alles andere geht aram 5v5 3v3 alles geht aber Aufstieg geht nicht. das schlimme ist das ich dann deswegen Strafen kriege obwohl ich nichts direkt dafür kann. \n Vielleicht k&ouml;nnt ihr mir nen tipp geben \n               Danke!","replies":[{"poster":"GiVeMeWEEDplz","date":"2017-07-28T21:19:24.292+0000","up_votes":1,"down_votes":0,"body":"wann hast du das letzte mal dein laptop von staub befreit?","replies":[{"poster":"lol Allrounder","date":"2017-07-28T21:26:49.242+0000","up_votes":1,"down_votes":0,"body":"Dumme frage aber wie Endstaub ich den laptop und was hat das damit zu tun das nur Aufstieg nicht geht?","replies":[{"poster":"GiVeMeWEEDplz","date":"2017-07-28T21:46:37.774+0000","up_votes":1,"down_votes":0,"body":"google einfach mal und schau dir ein video dazu an. (zum entstauben/reinigen)\nwarum aufstieg nicht geht, weis ich nicht. hast du irgenwelche fehler meldung bekommen? war dein laptop heiß? lüfter extrem laut?","replies":[{"poster":"lol Allrounder","date":"2017-07-28T21:56:25.383+0000","up_votes":1,"down_votes":0,"body":"Ok mach ich danke, wegen der Fehlermeldung da kommt immer muss neugestartet werden weil ein Problem aufgetaucht ist und dann so eine Absturz code aber bevor das kommt erhitzt er sehr stark ich versuch das mal mit dem reinigen vielleicht klappts danke für deine Hilfe.","replies":[{"poster":"zLives","date":"2017-07-29T02:10:39.747+0000","up_votes":1,"down_votes":0,"body":"Also der feine Staub Sätze sich irgentwo dort ab und kann je nach pech Kontakte \"schädigen\" und ich glaube (bin mir aber nicht sicher) das bei zu hoher überhitzung der Staub sich entflammen kann und naja ... Kannst dir denn Rest senken R.I.P Laptop etc.","replies":[]}]}]}]}]}]}