{"poster":"Necromant","date":"2019-03-28T08:29:36.676+0000","title":"Mindset","subforum":"Allgemeiner Chat","up_votes":9,"down_votes":6,"body":"#####**_~~1. Mindset~~_**\n\nViele werden sich jetzt Fragen, was will er mit diesen Topic, was bringt mir das, was kann das?\n\nNun ja, ich denke gerade das Mindset ist einer der wichtigsten Dinge in League of Legends, den **es betrifft jeden**, von Iron bis Challenger.\nGanz abgesehen vom eigentlichen Spielniveau (Makro-, Microplay, Wavemanagement, etc.pp) ist auch entscheidend wie der jeweilige Spieler sich verhält gegenüber andere Mitspieler und dem Umgang mit seinen eigenen Fehlern, Verhalten. Das ganze nennt man Mindset.\n\nWarum also ist Mindset so wichtig für League of Legends?\nNun ich möchte vorerst darauf eingehen was ein schlechtes Mindset hervorrufen kann:\n\n#####**_~~a. psychischer Zustand~~_**\n\nHierbei ist die Rede von Stress in der Schule, auf Arbeit, mit Freunden oder Familie. Den dieser Stress und Druck ist unterbewusst immer da, man wird dadurch keinen 100% klaren Kopf haben, da deine Gedanken (wenn auch nicht bewusst) immer noch mit eben jenen kritischen Themen beschäftigt sind und du dich so nicht aufs Spiel fokussieren kannst bzw. du leichter gereizt wirst.\n\n#####**_~~b. physischer Zustand~~_**\n\nNeben den geistigen/psychischen Zustand gibt es auch den körperlichen/physischen Zustand der ganz klar auf dich und deinen psychischen Zustand Einfluss hat. Geht es dir z.B. nicht gut, hattest du den ganzen Tag Kopfschmerzen oder bist aktuell z.B. krank? Jeder kennt es, man ist aktuell gereizter als sonst weil der eigene körperliche Zustand einen irgendwo ankotzt oder gar behindert. Mit Kopfschmerzen League zu spielen ist tödlich. Du wirst auch hier keine 100% Leistung raus holen können, da dein Kopf aktuell einfach \"überlastet\" ist.\n\n#####**_~~c. geistige Reife~~_**\n\nHaha, ja genau das! Dies betrifft gerade die jüngere Generation von Spielern, nimmt aber die älteren auch nicht unbedingt raus. Hierbei geht es darum, wie der Spieler mit seinen eigenen Fehlern und mit den Fehlern der Mitspieler umgehen kann, da Fehler nun mal passieren. Wir sind Menschen ... **sie passieren!** \nJe früher man das akzeptiert und damit umgehen zu lernen weiß, umso besser wird man.\n\nDas ist einer der typischsten Sachen die ich auf meinen Smurf erlebt habe: \n\nEntweder ist der Champ gegen den sie spielen und evtl. verlieren zu \"stark\", \"overpowered\" oder ein \"OP/Noob-Champ\" \nODER \nsollten sie gewinnen war das Game \"ez\"/\"easy\" und ihr eigenes Können wäre zu gut. \n\nABER gerade hierbei ist doch die Frage, können sich die Leute richtig einschätzen?\nWenn sie gegen einen Champion verlieren, dann liegt das nicht unbedingt daran das er zu stark ist, es liegt hierbei mehr daran das Ihnen das Matchup-Wissen oder allgemeines Wissen über das Spiel fehlt -> d.H. wiederum sie müssten den Fehler bei sich suchen und über sich hinaus wachsen.\n\nABER genau das ist wiederum ein allgemeiner sozialer Aspekt bzw. Fehler: Mit den Finger auf andere zeigen ist um einiges einfacher als den Finger auf sich selbst zu richten, da die eigenen Fehler schmerzlich sind.\n\n-----------------\n\nIch hoffe bis hierhin konntet ihr einen Eindruck gewinnen, was das Mindset ist und warum es so wichtig ist &amp; ich hoffe es war nicht allzu viel Text für euch.\n\n----------------\n\nWarum habe ich eigtl. gesagt das es jeden von Iron bis Challenger betrifft? Nun ja ... es gibt auch genügend toxische Challenger in der Welt da draußen, die das Spiel spielen um evtl. Stress im real live zu entgehen aber genau dieser Stress sich auch auf ihre Attitude und ihr allgemeines Mindset auswirken.\n\nHabt ihr euch jemals gefragt warum professionelle Spieler nicht ragequieten, toxisch sind etc.? Bzw. die wenigsten sind es davon.\n - weil sie einfach gelernt haben mit ihren Fehlern umzugehen\n - weil sie gelernt haben mit den Druck umzugehen (ich meine sie spielen teils vor einem Millionen-Publikum - könntet ihr das so einfach?)\n - weil sie ihren reallive-Stress unter Kontrolle haben bzw. jemand ihnen dabei hilft ( &amp; ja gut, seien wir Ehrlich, mit bisschen mehr Geld aufn Konto wird der reallive Stress auch weniger ... die Leute unter uns die Rechnungen zahlen dürfen, wissen was ich meine)\n\n----------------\n\nDas bis hierhin war ein kleiner Anreiser zu einem doch großen Thema, lasst mir eure Meinung gern in den Kommentaren da! :)\n\ntl;dr Rechtschreib-Gore","replies":[{"poster":"SSF LastAngel","date":"2019-03-28T12:42:03.371+0000","up_votes":3,"down_votes":0,"body":"Ja Moin. Endlich gibt es mal jemanden der hier nicht nur am rumheulen ist sondern das Thema sachlich und Kompetent \"niederschreibt\"  (Sorry Grammatik war bei mir nicht so das Wahlfach damals\")\nFinde den Post super, es ist halt die reine Wahrheit wenn man bedenkt wie die Soloq aber auch teils normals Arams etc voll von geisitg 10-jährigen so könnte man meinen sind. (Und ja es gibt Games wo ich mich selber dazuzählen würde).\nDanke für diesen Post Necromant","replies":[{"poster":"ObeyTheCode","date":"2019-03-28T19:31:36.263+0000","up_votes":1,"down_votes":0,"body":"Was ist daran sachlich, übertriebene Toleranz der Inter nicht mehr nicht weniger. Alles Mr Nice Guys hier mit netten Einstelllung, aber nur \"Skill\" (ja Feeder mit zweistelligen Toden sind für mich auch Inter).","replies":[{"poster":"SSF LastAngel","date":"2019-03-29T09:42:53.542+0000","up_votes":3,"down_votes":0,"body":"Niemand hat verlangt das der Text ein wissenschaftliches Meisterwerk ist, aber @Necromant beschreibt die Thematik hier schon richtig und der Text hat im Gegensatz zu vielen anderen hier im Forum einen guten und meiner Meinung nach notwendigen Inhalt. \nNotwendig im Sinne von die Leute verschließen die Augen vor den harten Fakten. \nEs gibt für mich keinen Grund diesen Text irgendwie zu kritisieren.\nWoher willst du wissen das er oder Ich ein Inter ein Feeder oder sonst wie auch ein \"nicht passender Lol Spieler\" sind. (= jemand, der sich nicht an den Beschwörerkodex hält und/oder einem den Spielspaß ruiniert).\nDas hat nichts mit Mr Nice Guy(s) oder einer wie du es nennst \"netten Einstellung\" zu tun, hier werden einfach nur Fakten vermittelt.\n\nDanke für deine Aufmerksamkeit.","replies":[]},{"poster":"eingew","date":"2019-03-29T06:19:56.680+0000","up_votes":2,"down_votes":1,"body":"Was genau ist daran übertriebene Toleranz, Inter einfach zu melden und nicht seine Gefühle durch sie bestimmen zu lassen?","replies":[{"poster":"ObeyTheCode","date":"2019-03-29T17:33:06.492+0000","up_votes":1,"down_votes":0,"body":"Was das Reporten nichts bringt, useless as fuck. Machste scheiß screenshot, wo der midlaner zu gibt, dass er inten wird, geht dann 0 17 5 raus aus dem Spiel, hat er die Strafe bekommen? WTF das Baviorteam kann nur den Chat bestrafen, nicht mehr und nicht weniger. Was juckt mich, dass der Spieler in der Zukunft gebannt wird, ich werde doch auch gleich für mein Flame bestraft instant.","replies":[{"poster":"eingew","date":"2019-04-01T05:23:43.709+0000","up_votes":1,"down_votes":0,"body":"Aber deine Gefühle von ihnen kontrollieren zu lassen bringt etwas? :D\nNehmen wir einfach mal an, das was du hier kühnerweise behauptest würde bestimmen und die Reports würden tatsächlich nichts bringen.\n\nUnd jetzt? Wo liegt der Unterschied zu vorher, warum sollte ich den Chat mit meinen Gefühlsausbrüchen zuspammen und einem Troll die Freude geben, mich getriggert zu haben?","replies":[]}]}]}]},{"poster":"1 Flasche Cola","date":"2019-03-28T22:34:17.078+0000","up_votes":1,"down_votes":1,"body":"warum beleidigst du randgruppen ? es gibt 10 jährige die deinen IQ dreifach übertreffen","replies":[{"poster":"Necromant","date":"2019-03-29T07:21:31.562+0000","up_votes":2,"down_votes":1,"body":"Er sprach oben vom geistigen Alter, nicht vom physischen :)","replies":[]},{"poster":"SSF LastAngel","date":"2019-03-29T09:36:51.806+0000","up_votes":1,"down_votes":0,"body":"Das mag sein. Hier sind allerdings Leute gemeint, die sich im Spiel so verhalten wie ein durchschnittlicher 10-jähriger sprich keine geistige Reife. Metaphorisch gesehen hätte ich auch sagen können \"die Games sind voller Vollidioten oder Arschlöcher\" wäre meiner Meinung nach auf dasselbe rausgekommen.","replies":[]}]},{"poster":"Necromant","date":"2019-04-04T06:16:28.462+0000","up_votes":1,"down_votes":0,"body":"Doch mehr negative Zustimmung als positive x) Da hat wohl wer andere Ansichten zum Mindset :D","replies":[]}]},{"poster":"Awsane","date":"2019-03-29T01:04:42.120+0000","up_votes":3,"down_votes":0,"body":"https://www.youtube.com/watch?time_continue=122&amp;v=-q_8bE0DCgs\n\nIch finde das ist ein gutes Beispiel aus dem Pro Bereich dazu,\n\nDas wahre Talent ist, das Mindset zu haben, nicht krasse Mechaniken oder Intuitionen zu haben.\nWeil das Mindset ist sehr Vorherbestimmt. Klar, auch daran kann man arbeiten, aber es ist viel schwerer als an sowas wie Mechaniken.\n\nWeil dazu muss man motiviert sein. Aber wie motiviert man sich um Motiviert zu sein?. :D Da merkt man schon, dass das irgendwie schwer wird. Wer kein intrinsisches Interesse hat Oben zu sein und viel dafür zu geben wird es sehr schwer haben oben dabei zu sein.","replies":[{"poster":"Necromant","date":"2019-03-29T07:25:28.506+0000","up_votes":1,"down_votes":0,"body":"Ahh Sahne!\nRekkles hat meinen vollsten Respekt. Der ist durch richtig harte Arbeit dorthin gekommen wo er ist und er ist und bleibt ein Vorbild für viele Menschen.\n\nRichtig, zu dem muss man auch immer schauen aus welchem Umfeld viele Leute kommen. Manchen fällt es leichter, manchen schwerer. Kommt wie oben angesprochen auf den psychischen Druck an. Blöd gesagt, jemand in sozial unteren Schichten wird es schwerer haben, weil er sich z.B. viel mehr Sorgen um andere Dinge machen muss, als wer in  der oberen Schicht, den evtl. besser unter die Arme gegriffen wird.\n\nMindset spielt ne sehr große Rolle.","replies":[{"poster":"Awsane","date":"2019-03-29T12:26:05.483+0000","up_votes":1,"down_votes":0,"body":"> Blöd gesagt, jemand in sozial unteren Schichten wird es schwerer haben, weil er sich z.B. viel mehr Sorgen um andere Dinge machen muss, als wer in der oberen Schicht, den evtl. besser unter die Arme gegriffen wird.\n\nIch würde das nicht so verallgemeinern, weil es auch umgekehrte Effekte gibt, bei denen Leute die Oben sind sich nicht anstrengend, weil sie keinen Druck haben es irgendwie raus schaffen zu müssen um ihre Situation zu verbessern, bzw dieser Druck Leuten die unten sind die Motivation gibt nach oben zu kommen.\n\nAlso klar, es gibt eine Untergrenze, ab der gar nichts mehr geht, aber das trifft dann ja vor allem Menschen die sowieso nicht PC spielen.\n\n\nEs ist meines Wissens auch eher eine Genetische Sache ob man Motivation/Ehrgeiz/Elan hat im Leben und relativ dazu nicht so sehr eine soziale/kulturell angezogene.","replies":[{"poster":"Necromant","date":"2019-03-29T12:28:13.840+0000","up_votes":1,"down_votes":0,"body":"Genetisch würde ich das aber auch nicht definieren. Es ist mehr der eigene Antrieb, der nicht unbedingt von der Genetik her kommt.","replies":[{"poster":"Awsane","date":"2019-03-29T18:35:33.053+0000","up_votes":1,"down_votes":0,"body":"Von mir aus kannst du es auf die Seele oder ähnliches Schieben. Es geht mir vor allem darum, dass man es nicht im eigentlichen Sinne erlernen kann.","replies":[{"poster":"Necromant","date":"2019-03-29T21:31:16.225+0000","up_votes":1,"down_votes":0,"body":"Erlernen ... hmm man kann sich erziehen, was darauf widerrum Einfluss hat.","replies":[{"poster":"Awsane","date":"2019-03-29T22:34:39.902+0000","up_votes":1,"down_votes":0,"body":"Jain, jemanden, der von der Persönlichkeit eher Faul (wobei das klingt so negativ, ich meine eher damit, dass er genügsam auch ist und sich mit wenig zufriedengibt nicht alles brauch und genießt) ist wird man nicht zu einem Ultraleister erziehen können.\n\nKlar, man kann in der Erzeihung Einfluss darauf nehmen, man kann aber niemanden komplett Umpolen.\n\nJemanden der kein Intrinsisches Interesse daran hat ein Leistungssportler/Mensch zu sein wird niemals durch Lernen oder Erziehung zu einem werden.","replies":[{"poster":"Necromant","date":"2019-03-30T10:37:43.938+0000","up_votes":1,"down_votes":0,"body":"Ja gut ... k.A. ich will immer mehr lernen, besser sein als gestern, höher hinaus.\nStillstand ist langweilig.","replies":[{"poster":"Awsane","date":"2019-03-30T12:07:51.962+0000","up_votes":2,"down_votes":0,"body":"Dieses Mindset ist denke ich zum Großteil Mitverantwortlich für deinen relativ hohen Rang.\n\nAber du kannst ja von dir, nicht auf alle anderen Menschen schließen. Du kennst doch garantiert jemanden, der nicht so Ehrgeizig ist. Allein wenn ich an meine Schulzeit denke, fallen mir da genug Leute ein.\n\n\"Studieren? Ne, dass ist mir zu anstrengend. Ich suche mir nen ruhigen Job und chille mein Leben\"","replies":[{"poster":"Necromant","date":"2019-03-30T12:50:15.375+0000","up_votes":1,"down_votes":0,"body":"Studieren etc. hatte ich aber auch kein Bock xd","replies":[{"poster":"Awsane","date":"2019-03-30T14:20:13.440+0000","up_votes":1,"down_votes":0,"body":":D\n\nIch glaube du weißt worauf ich hinaus will.\n\nDas ist übrigend in Coachingkreisen (auf high Dia und (Semi) Professionelle Teams) normal, dass man sagt, man kann den Spielern alles außer Motivation beibringen, dass müssen die selber mitbringen.","replies":[{"poster":"Necromant","date":"2019-03-31T09:55:24.730+0000","up_votes":1,"down_votes":0,"body":"&amp; finally back in Platin, road to Dia inc. :D\n\nhttps://cdn.discordapp.com/attachments/519434609851629568/561849321902047232/unknown.png","replies":[]}]}]}]}]}]}]}]},{"poster":"eingew","date":"2019-04-01T05:20:54.138+0000","up_votes":1,"down_votes":0,"body":"Je nach dem welcher Studie man mehr traut unterscheiden sich natürlich die Zahlen, allerdings sind tatsächlich ~45% der Persönlichkeit genetisch bedingt ^^.","replies":[{"poster":"Necromant","date":"2019-04-01T06:07:35.187+0000","up_votes":1,"down_votes":0,"body":"hmm stimmt wohl schon irgendwie ..","replies":[]}]}]}]}]}]},{"poster":"ObeyTheCode","date":"2019-03-29T17:30:23.822+0000","up_votes":1,"down_votes":1,"body":"Noch ein Beispiel wie zum F*ck soll heir ich positiv denken? \n\nAnalyse der Blitzapp. Morgana Support 7,5 KDA. \n\n\nThe Good\n\nUnlucky\nNice try, you performed admirably. Better luck next time.\n\nWon Lane\nKicked your lane opponent's butt (Higher CSD and XPD @ 10).\n\nFirst Blood\nAyy, you got the first kill.\n\nCC Bot\nCC score of 67! (Duration of CC applied in seconds: soft CC is 1/2, slow is 1/6)\n\nAll-Seeing\nGreat vision control! Your vision score was 64. The target was 46. (1.5x game length)\n\nIch machte schon Calls, weil meine Mitspieler zero brain haben, aber nein die B****arde machen trotzdem ihre Sch**ße und throwen das Spiel. F***t euch mit euren positiven Einstellung. Der Fokus liegt auf \"unlucky\". Das ist doch der größte bullshit, es ist doch nicht der Sinn des Matchmaking, dass die Gewinnchancen vom scheiß Zufall abhängen und dann gibt Riot mir diverse Chatbans etc., weil ich mein Maul nicht halte und diese \"schlechten\" Spieler nicht toleriere.","replies":[{"poster":"Cocaine Monkey","date":"2019-03-30T02:15:25.850+0000","up_votes":2,"down_votes":0,"body":"Du , mein Freund, hast ein sche*ß aggressions Problem. Du willst nicht einsehen, dass du kacke in dem Spiel bist und lässt es in deinen Posts gerne an anderen aus. Keiner hier sagt , dass inter &amp; feeder gut sind. Es geht einfach darum ein gutes mindset zu haben und zu denken:“ ok, runde lief nicht,nächstes wird besser“. Wenn du dich über die anderen Aufregst und sie ingame Beleidigst ist eine Strafe nur gerechtfertigt. Überleg dir mal du beleidigst im reallife jemanden. Der findet das nicht so lustig, zeigt dich an und du wirst bestraft. Nichts anderes passiert ingame. Deine 0/17 inter kannst du mit einem support ticket manuell reporten und dann werden die gebannt. \nWenn du dich jetzt immer nich über solche kleinigkeiten aufregen willst ,dann nur zu aber bringen wird dir das nichts.","replies":[{"poster":"ObeyTheCode","date":"2019-03-30T14:24:55.627+0000","up_votes":1,"down_votes":0,"body":"Gutes mindset? Ist nur eine hypokritische Einstellung, rede dir weiter ein, dass dein 0 6 0 Vlad game nur Pech war und deine Botlane schlechten Tag hatte.\nMit dem manuellen Ticket kann man sich den Arsch abwischen, scheiß Bots. Reallifevergleich? Willst du sagen, dass du beim Fußball nicht angemacht wirst, wenn du nicht abspielst  und damit 100% Chance verkackst.Wenn du unlucky bist, wirst noch Schläge kassieren. Lebe weiter in der rosaroten Traumwelt.","replies":[{"poster":"eingew","date":"2019-04-01T05:19:22.792+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ObeyTheCode,realm=EUW,application-id=YnZkMR0R,discussion-id=4Y1dd61G,comment-id=000800000000,timestamp=2019-03-30T14:24:55.627+0000)\n>\n> Gutes mindset? Ist nur eine hypokritische Einstellung, rede dir weiter ein, dass dein 0 6 0 Vlad game nur Pech war und deine Botlane schlechten Tag hatte.\n\nWie in dem Post von Cocaine Monkey einfach das exakte Gegenteil von diesem Schluss steht. Wann hast du eigentlich vor, die Posts auf die du hier antwortest auch zu lesen?","replies":[]}]}]}]},{"poster":"ObeyTheCode","date":"2019-03-28T11:49:02.242+0000","up_votes":1,"down_votes":0,"body":"Sehr geehrter Psychologe senpai,\nsagen Sie mir mal wie ich mit einem 0 13 Ez mid umgehen soll, wenn ich 3 3 1 stehe und perma 2v4 botlane spielen muss. Danke im Voraus für Ihren Tipp.\n\n> Habt ihr euch jemals gefragt warum professionelle Spieler nicht ragequieten, toxisch sind etc.? Bzw. die wenigsten sind es davon.\n\nWeil sie mit dem Sc**iß Geld verdienen? Broeki hust hust.","replies":[{"poster":"Necromant","date":"2019-03-28T12:10:11.642+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ObeyTheCode,realm=EUW,application-id=YnZkMR0R,discussion-id=4Y1dd61G,comment-id=0004,timestamp=2019-03-28T11:49:02.242+0000)\n>\n> Sehr geehrter Psychologe senpai,\n> sagen Sie mir mal wie ich mit einem 0 13 Ez mid umgehen soll, wenn ich 3 3 1 stehe und perma 2v4 botlane spielen muss. Danke im Voraus für Ihren Tipp.\n\nAuch solche Mitspieler kenne ich. Wie unten bei maddin bereits als Beispiel angesprochen Botlane mit 0/11 in der 13min. Bei sowas kannst du dir versuchen nur einen Lead auf der Lane zu holen und dann geht es darum, wer setzt seinen Lead besser um? Aka, wer holt mehr Objectivs - generiert dadurch Gold und trägt sein Team n stück weit voran. Was bringt den Gegner ne gefeedete Mitte wenn alle anderen Lanes dafür bescheiden laufen. Einer allein ist schnell raus gepickt und der Rest des Teams sieht ohne diesen Mitspieler/ohne diesen Stützpfeiler alt aus.\n\nKlassisches Beispiel aus dem ProPlay war SKT. Die haben sich sehr auf Faker verlassen, das der das Game trägt. Was ist passiert? Gegn. Teams haben angefangen ihn raus zu nehmen und schon war der Stützpfeiler von SKT dahin. Faker hatte zu dem Zeitpunkt enormen Leistungsdruck.\n\n> [{quoted}](name=ObeyTheCode,realm=EUW,application-id=YnZkMR0R,discussion-id=4Y1dd61G,comment-id=0004,timestamp=2019-03-28T11:49:02.242+0000)\n>\n> Weil sie mit dem Sc**iß Geld verdienen? Broeki hust hust.\n\nWie auch oben bereits angesprochen, ist das finanzielle ein Aspekt der Leute besser schlafen lässt.\n\n> [{quoted}](name=Necromant,realm=EUW,application-id=YnZkMR0R,discussion-id=4Y1dd61G,comment-id=,timestamp=2019-03-28T08:29:36.676+0000)\n>\n> ( &amp; ja gut, seien wir Ehrlich, mit bisschen mehr Geld aufn Konto wird der reallive Stress auch weniger )\n\n---------------\n\nVöllig vergessen.\n\nWenn die Gegner permanent zu 4 auf der Botlane sind &amp; die dafür nichts bekommen, dann ist es sehr worth für euch.\nWeil die sharen sich damit Gold &amp; Exp, damit fallen sie wieder behind. Auf der anderen Seite sollte euer Jungler/Midlaner/Toplaner dafür Objectivs wie Tower oder Herold holen.\n\nTrades macht man in LOL nicht nur auf der Lane gegen seinen Kontrahenten, sondern auch Global.","replies":[{"poster":"ObeyTheCode","date":"2019-03-28T19:29:13.528+0000","up_votes":1,"down_votes":0,"body":"Ich bekomme eine riesen Hals von Ihrer Argumentation. Sie sind wahrscheinlich die heilige Maria in Person mit dieser Blindheit für die Feeder, Sind so heilig und positiv eingestellt, dass wenn Ihre Frau fremdgehen, würden Sie ihr die Kondome mitbringen.","replies":[{"poster":"eingew","date":"2019-03-29T07:09:58.061+0000","up_votes":2,"down_votes":0,"body":"Wie schon geschrieben: Sei kein Sklave deiner Gefühle. Mehr sagt doch auch Necromant hier nicht.","replies":[]}]}]},{"poster":"SSF LastAngel","date":"2019-03-29T09:35:07.609+0000","up_votes":2,"down_votes":1,"body":"Kann es sein das du vor kurzer Zeit 3-3-1 standest und nen Ezreal Midlane hattest der 0-13 gegangen ist und du Permanent auf Botlane 2vs4 gespielt hast. Ist ein typischer Fall von : \"Leute denken sie müssten sich über ein bestimmtes Game aufregen das ein Teammate ihnen versaut hat\". Dabei vergessen allerdings die meisten das das Matchmaking zu DEINEM Vorteil spielt. Alleine die Tatsache das du 4 Mitspieler und der Gegner 5 Spieler hat macht deutlich, das du in jedem Game besser sein musst als der Durchschnitt der Spieler, und dann climbst du (und so funktioniert es im Ranked Ladder System wirklich).\nEinziges Problem sind Smurfs die halt mit höherer Warscheinlichkeit im Gegnerteam zu finden sind.\n\nFazit: Wenn du besser bist als deine ELo, kommst du hoch. Wenn du Tiltest spielst du schlechter als sonst und dementsprechend ist die Warscheinlichkeit das du das Spiel gewinnst geringer. Und bitte fokussiere dich nicht auf ein einzelnes Game, ist ja klar das man dann nicht das ganze ganze Bild sieht. Eine Elo Hell kann aus diesem Grund nicht existieren das wäre mathematisch schon völlig unmöglich.\n\nZum Thema Pro Player: Geld ist eine schöne Sache und bestimmt auch ein Grund, warum diese Spieler das durchmachen aber eben nur ein Faktor. \nBei Profispielern geht es um viel mehr als bei uns, aus diesem Grund kommen Emotionen deutlich warscheinlicher an die Oberfläche, allerdings haben die meisten - alle Profis mit mentalem Training eine gute Basis gegen Tilt geschaffen, ob und wie das dann in ihren Spielen auf Stage zum Vorschein kommt ist auch oft bedingt von anderen Umständen wie zb Tagesmoral, RL ...\n\nPS: Wenn du das mit Climben im Ranked und Elohell nicht verstanden hast, schau dir einach Solas Video dazu an.\nhttps://www.youtube.com/watch?v=To8_s3cGF-8","replies":[{"poster":"ObeyTheCode","date":"2019-03-30T19:57:34.339+0000","up_votes":1,"down_votes":0,"body":"Du gibt mir dem Tipp (ich bin toxic, habe ich auch kein Problem es zuzugeben) , dass ich von dem anderen toxischen Spieler lernen soll.","replies":[{"poster":"SSF LastAngel","date":"2019-03-31T15:43:54.467+0000","up_votes":2,"down_votes":1,"body":"Nein ich gebe dir ein Mittel an die Hand, um ein Thema zu verstehen (was dir hier offensichtlich nicht gelingt da du dich hier öffentlich drüber aufregst).\nEs geht auch nicht darum ob Sola toxisch ist oder nicht, sondern das die Thematik die hier teilweise im Forenbeitrag erklärt wird in diesem Video vorkommt und nochmal aufgegriffen wird.","replies":[]}]}]}]},{"poster":"Veezey","date":"2019-03-28T17:18:20.099+0000","up_votes":2,"down_votes":0,"body":"Super Post!{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"00 M4ddin 00","date":"2019-03-28T10:30:22.176+0000","up_votes":1,"down_votes":0,"body":"Andere Frage :) \n\nhttps://youtu.be/_vlD31NMEms\n\nWarum kommen dann solche Leute so schnell und einfach auf Master+ hoch? \n\nIch mein klar dou mit einen Challenger kumpel aber trotzdem die geben oft einen fick auf die games. \n\nSiehe scrubnoob und Co.","replies":[{"poster":"Necromant","date":"2019-03-28T10:35:29.451+0000","up_votes":2,"down_votes":0,"body":"Das Ding bei den Leuten speziell den L9-Club ist, das sie verdammt gute Spieler sind und teils sowas wett machen.\nDie machen das Mindset mit Spielniveau wett und carrien das Game solo 2v5. Das wirst du aber als normal sterblicher nicht so einfach schaffen.","replies":[{"poster":"00 M4ddin 00","date":"2019-03-28T10:43:17.333+0000","up_votes":2,"down_votes":0,"body":"Dachte ich mir schon :/","replies":[]}]}]},{"poster":"Cocaine Monkey","date":"2019-03-28T08:59:47.738+0000","up_votes":3,"down_votes":1,"body":"Du sprichst mir aus der Seele. \nProblem ist nur, dass viele Spieler das nicht mehr einsehen wollen und das Problem sich sogar verschlimmert.\nMit dem Finger auf die anderen zu zeigen ist halt einfacher als seine eigenen Fehler einzusehen. \n~~Außerdem weiß jeder , dass Männer ab einem geistigen alter von 12 erstmal stecken bleiben~~\nIch hoffe einfach mal, dass sich das Mindset der ganzen Community mal wieder ändert und alle wieder Spaß am Spiel haben. \nWird zwar nicht geschehen aber man darf noch träumen.\n\n{{champion:39}} {{champion:62}}","replies":[{"poster":"4 For Maggie","date":"2019-03-28T10:10:26.778+0000","up_votes":2,"down_votes":0,"body":"Unfassbar.\nhttps://media.tenor.com/images/86eb7c00905ba5fa58b0e0bc7c7c7486/tenor.gif","replies":[{"poster":"Necromant","date":"2019-03-28T10:24:27.441+0000","up_votes":2,"down_votes":0,"body":"Ja auch du bleibst geistig stecken &lt;3 :D","replies":[{"poster":"4 For Maggie","date":"2019-03-28T10:35:57.165+0000","up_votes":2,"down_votes":0,"body":"Das einzige was stecken bleibt ................... [...]\n#>.&lt; \n\nIch bin wahnsinnig entsetzt darüber Äffchen hier zu lesen °^°\nEs gibt doch so viele bessere Optionen ... okay ... eine ô.ô","replies":[]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-03-28T10:24:25.496+0000","up_votes":2,"down_votes":0,"body":"Ich fühle mich angesprochen :0 \n\nDu kennst mich ja schon ne weile und mein Mindset ist immer irgendwo zwischen heute läuft alles super und ich hoffe der sterben alle ...\n\nIch mach oft viele Fehler das weiß ich selbst auch wenn ich es nicht oft sage. \nAber diese Fehler sind immer so das ich direkt danach weiß ich hab das und das falsch gemacht. Aber ich mache es bei nächsten mal wieder :( ich kann das nicht ändern ... \nOft genug denk ich mir schon beim hingehen. Das ist ne schlechte Idee da sollte ich nicht helfen .... Aber dann mach ich es doch und sterben und denk mir ich wusste es. Warum bin ich hin gegangen ? \n\nIch spiele seit 4 Jahren? \nHab noch keine einzige Strafe bekommen. Ich bin Toxic definitiv. Ich schreibe teilweise echt böse Sachen.  Aber ich weiß wie ich schreiben muss. Andere Seite mute ich mittlerweile fast in jeder Runde alle sobald auch nur ein Wort im Chat fällt.  \nIch schrei auch gerne in der Wohnung rum und den Bildschirm an.\n\nSchau meine history die letzten verlorenen SoloQ games. \n\nIch geb mir wirklich Mühe aber wenn ich meine lane nur neutral spiele und dann aufn score schon 2/13 steht nach wenigen Minuten was soll ich da noch tun. \nWie noch positiv denken und freundlich bleiben wenn das nahezu jedes game passiert. Und klar nach einigen solchen games hab ich auch keine Lust mehr mir mühe zu geben. \n\nKlar sollte ich dann eine Pause machen und meisten bin ich dann zu blöd und mach keine ....\n\nAnders ich spiele ne runde mit einen Platin freund der mit dem smurf Gold 2 \n\nUnd ich hab bessere spiele trotz stärkerer gegner. Nur weil ich 1 Spieler dabei hat der normal spielt. Nicht mal Hard Carryt sondern einfach normal spielt. Da macht das Spiel dann auch Spaß. \n\nAllgemein macht es mit Freunden mehr Spaß. \n\nNaja weiß garnicht mehr auf was ich hinaus wollte ^^ \n\nIch glaub selbst wenn ich nur noch positiv denken würde und mir alle anderen im game egal wären würde ich nicht weiter kommen .... \n\nVilt bin ich auch einfach nicht mehr gut genug. Wobei wenn ich sehr es ist die 25 min ich steh 4/1 und mein Team hat 23 Tode dann kann ich nichts machen egal was ich versuch.\n\nNaja Vilt werd ich doch noch gebannt irgendwann dann schau ich was ein neues Account mit weißer Weste so kann","replies":[{"poster":"Necromant","date":"2019-03-28T10:33:48.904+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=00 M4ddin 00,realm=EUW,application-id=YnZkMR0R,discussion-id=4Y1dd61G,comment-id=0002,timestamp=2019-03-28T10:24:25.496+0000)\n>\n> Ich fühle mich angesprochen :0 \n\nWar eher auf die Allgemeinheit bezogen als auf einzelne Spieler.\n\n> Ich mach oft viele Fehler das weiß ich selbst auch wenn ich es nicht oft sage. \n> Aber diese Fehler sind immer so das ich direkt danach weiß ich hab das und das falsch gemacht. Aber ich mache es bei nächsten mal wieder :( ich kann das nicht ändern ... \n> Oft genug denk ich mir schon beim hingehen. Das ist ne schlechte Idee da sollte ich nicht helfen .... Aber dann mach ich es doch und sterben und denk mir ich wusste es. Warum bin ich hin gegangen ? \n\nDas liegt dann teils auch an dir, aus Fehlern zu lernen. Dies ist oft nicht leicht aber man schafft es. Ich z.B. schau mir nach den Games die meistens nochmal an, merke mir meine Fehler und achte im nächsten Game penibelst darauf dies eben nicht mehr zu tun.\n\n> Ich spiele seit 4 Jahren? \n> Hab noch keine einzige Strafe bekommen. Ich bin Toxic definitiv. Ich schreibe teilweise echt böse Sachen.  Aber ich weiß wie ich schreiben muss. Andere Seite mute ich mittlerweile fast in jeder Runde alle sobald auch nur ein Wort im Chat fällt.  \n> Ich schrei auch gerne in der Wohnung rum und den Bildschirm an.\n\nWas nicht ist, kann noch werden. Also achtung, es kann jeden treffen.\nWenn du in deiner Wohnung rum schreist, ist das zwar für deine Nachbarn kacke aber für League gut. Weil du deinen Frust so raus lässt anstatt an deinen Mitspielern.\n\n> Ich geb mir wirklich Mühe aber wenn ich meine lane nur neutral spiele und dann aufn score schon 2/13 steht nach wenigen Minuten was soll ich da noch tun. \n> Wie noch positiv denken und freundlich bleiben wenn das nahezu jedes game passiert. Und klar nach einigen solchen games hab ich auch keine Lust mehr mir mühe zu geben. \n\nSolche Games habe ich auch genügend. Botlane 0/11 in der 13min etc.pp. \nEs geht bei dem Topic nicht darum \"Wie gewinne ich jedes Game\", es geht vielmehr um die allgemeine Einstellung der Spieler/des Spielers.\nAls Beispiel: Wenn du als Midlaner einen Lead von 4/0 auf deiner Lane raus holst, siehst aber das deine Botlaner 0/2 oder 0/3 bereits steht und innerlich schon aufgegeben haben -> mach ihnen mut! Gank unten, schreib danach \"dw, we got this\" gib ihnen mut! weiter zu spielen, ihr bestes zu geben! Unterstütz sie! Das ist die eine Seite die zum Erfolg führt, auf der anderen Seite, was wird passieren wenn man eben diese Leute flammt \"dont int\", \"botlane gg\". Ist klar das diese dann noch weniger Lust haben zu spielen oder eben ihr bestes zu geben und ja, selbst wenn man sein bestes gibt kann 0/3 zustande kommen. Es gibt auch in League viele Sachen auf die man keinen bis wenig Einfluss hat, aber auf die Sachen, die man Einfluss haben kann, sollte man auch Einfluss ausüben.\n\n> Klar sollte ich dann eine Pause machen und meisten bin ich dann zu blöd und mach keine ....\n\nPause hilft wirklich. Ich mach zwischen jeden Rank was fürn Haushalt, spiel was anderes, quatsche dumm etc.\nGedanken bisschen schweifen lassen, mehr oder minder dein Gehirn eine Pause gönnen nach seiner gezeigten Leistung. Weil wenn du immer auf 100% fährst über 3h sind die 100% bald keine 100% mehr. Wenn du jedoch Pausen dazwischen machst, wo sich dein Gehirn erholen kann, bist du fokusierter.","replies":[{"poster":"ObeyTheCode","date":"2019-03-28T19:34:39.482+0000","up_votes":1,"down_votes":0,"body":"Die andere sind egal, was ist das für eine Aussage. Würden diese Feeder sterben, würde es mich nicht jucken, so egal sind mir diese Spieler, aber das Problem sind die gefeedeten Gegner, die kann man nicht ignorien.","replies":[{"poster":"00 M4ddin 00","date":"2019-03-29T06:32:11.284+0000","up_votes":1,"down_votes":0,"body":"Ja ich weiß was du meinst ^^ \nWenn man 3 games verliert weil 2 im game dabei sind die zusammen +20 Tode haben. Da macht man nichts mehr dagegen. \n\nEgal wie positiv ich da denke. Da ist das game gelaufen. Wenn plötzlich ein 6/0 wu Kong neben dir auftaucht ^^'","replies":[{"poster":"ObeyTheCode","date":"2019-04-01T14:43:36.735+0000","up_votes":1,"down_votes":0,"body":"Ja, aber es ist deine Schuld, dass sie feeden und auf keinem Fall darfst du denen sagen, dass sie mit dem Feed aufhören sollen, weil es ihre Moral niedermacht.","replies":[]}]},{"poster":"eingew","date":"2019-03-29T07:12:12.499+0000","up_votes":1,"down_votes":0,"body":"Wobei da steht: \"Hilf denen\".\nUff, wozu wirst du denn hier so unpassend deinen Frust los? Wir haben dazu eigentlich schon einen [eigenen Thread.](https://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/YQF2RpjI-der-kummerkasten)","replies":[{"poster":"ObeyTheCode","date":"2019-03-29T17:23:56.819+0000","up_votes":1,"down_votes":0,"body":"Komm nciht mit dem Frusttrick, wie ihr (Verteidiger der Inter und Feeder) ich sage mal es sind Fakten. Es sind Fakten.","replies":[]}]}]}]}]}]}