{"poster":"Pikkste","date":"2018-05-23T18:40:58.659+0000","title":"Sona Guardiana Stellare?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti,\r\nvolevo chiedervi se qualcuno di voi sapeva se la Riot avesse in programma (prima o poi) di fare la skin di Star Guardian anche a Sona {{champion:37}} .. voi che ne pensate? \r\n{{sticker:sg-lux-2}} \r\nNon credete lei debba essere inclusa nel team SG?\r\n\r\nInoltre, volevo sapere (non si sa mai) se ci fosse una seconda possibilit&agrave; di avere l&#039;icona &quot;Marchio della guardiana stellare&quot; che si poteva ottenere facendo il test delle guardiane.. che ora ormai &egrave; disponibile ma senza ricompensa.\r\nFatemi sapere  ;)","replies":[{"poster":"Pulastér","date":"2018-05-23T19:16:08.623+0000","up_votes":4,"down_votes":0,"body":"*Sente nominare Star Guardian Sona.* *Cade a terra con la mano sul petto, all'altezza del cuore, tutto tremolante, respirando a fatica.*\n\n*Al termine del supplizio, si rialza.*\n\nQuesti sono temi molto forti e seri, amico. Comunque, da Main Sona ed Ex OTP, approverei un sacco questa skin. Però, se vogliamo essere realistici, ho dei forti dubbi che la faranno. E stanne certo che la prossima edizione ha poche probabilità di includere lei tra le protagoniste.\n\nUno dei maggiori ostacoli per avere skin in generale su Sona è... Sona stessa. Per la precisione parlo del suo modello in gioco e di una sua mancanza principale: le sue gambe, lei non ha gambe nel suo modello. Le Star Guardian hanno tutte gonne corte con le gambe in bella vista, solo per questo a Sona è praticamente preclusa quella skin. Può sembrare qualcosa di estremamente stupida  ma questa mancanza è una delle ragioni che la limita nel avere le skin più popolari, per esempio una Pool Party. L'unica speranza di averla in quella linea di skin sarebbe che lei riceva una Leggendaria che le altera un po' il modello oppure che le reworkano direttamente il modello di base, aggiungendoci le gambe.\n\nIo quest'anno speravo sinceramente in una Bloodmoon con lei, lì ci stava tutta e tematicamente avrebbe spaccato di brutto, forse anche più della SG.","replies":[{"poster":"Pikkste","date":"2018-05-25T19:45:39.144+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=IllidanS1,realm=EUW,application-id=MJVj50Jw,discussion-id=jqJin6v8,comment-id=0002,timestamp=2018-05-23T19:16:08.623+0000)\n>\n> *Sente nominare Star Guardian Sona.* *Cade a terra con la mano sul petto, all&#x27;altezza del cuore, tutto tremolante, respirando a fatica.*\n> \n> *Al termine del supplizio, si rialza.*\n> \n> Questi sono temi molto forti e seri, amico. Comunque, da Main Sona ed Ex OTP, approverei un sacco questa skin. Però, se vogliamo essere realistici, ho dei forti dubbi che la faranno. E stanne certo che la prossima edizione ha poche probabilità di includere lei tra le protagoniste.\n> \n> Uno dei maggiori ostacoli per avere skin in generale su Sona è... Sona stessa. Per la precisione parlo del suo modello in gioco e di una sua mancanza principale: le sue gambe, lei non ha gambe nel suo modello. Le Star Guardian hanno tutte gonne corte con le gambe in bella vista, solo per questo a Sona è praticamente preclusa quella skin. Può sembrare qualcosa di estremamente stupida  ma questa mancanza è una delle ragioni che la limita nel avere le skin più popolari, per esempio una Pool Party. L&#x27;unica speranza di averla in quella linea di skin sarebbe che lei riceva una Leggendaria che le altera un po&#x27; il modello oppure che le reworkano direttamente il modello di base, aggiungendoci le gambe.\n> \n> Io quest&#x27;anno speravo sinceramente in una Bloodmoon con lei, lì ci stava tutta e tematicamente avrebbe spaccato di brutto, forse anche più della SG.\n\nEi, amico, semmai amicA .. xD, comunque anche io sono main Sona ❤_❤ e per quanto io capisca i motivi da te spiegati, per cui una skin del genere non possa essere creata, io resto speranzosa .. perché vedo in Sona qualcosa di speciale xD !\n {{sticker:sona-playing}} \nsecondo me se la merita comunque..  :)","replies":[]}]},{"poster":"SUN Void ","date":"2018-05-23T21:51:54.421+0000","up_votes":2,"down_votes":0,"body":"Sei un pazzo, già ibox aveva ideato sona vestita da maid, tu sei andato addirittura oltre; vuoi farci morire tutti dissanguati??????","replies":[]},{"poster":"HaIIeIujah","date":"2018-05-23T19:01:13.869+0000","up_votes":1,"down_votes":0,"body":"Non vi sono conferme. \n\nPersonalmente non la vedrei particolarmente bene, salvo nel caso in cui sia fatta leggendaria con un nuovo rig. Sona non mi trasmette il \"dinamismo\" tipico di un SG, né il suo modello attuale potrebbe sostenere le pose/movimenti necessari.","replies":[]},{"poster":"SuraKnight","date":"2018-05-23T18:47:04.949+0000","up_votes":1,"down_votes":6,"body":"No ti prego...è la seria di skin più orribile e sessista mai fatta. se si potessero bannare anche le skin nella fase di pick le bannerei xD\nPeace :D","replies":[{"poster":"HaIIeIujah","date":"2018-05-23T18:57:31.984+0000","up_votes":3,"down_votes":1,"body":"Per una definizione molto arbitraria del termine \"sessista\".","replies":[{"poster":"SuraKnight","date":"2018-05-23T20:24:03.885+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=HaIIeIujah,realm=EUW,application-id=MJVj50Jw,discussion-id=jqJin6v8,comment-id=00000000,timestamp=2018-05-23T18:57:31.984+0000)\n>\n> Per una definizione molto arbitraria del termine &quot;sessista&quot;.\n\nNon credo","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2018-05-23T20:06:31.087+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuraKnight,realm=EUW,application-id=MJVj50Jw,discussion-id=jqJin6v8,comment-id=0000,timestamp=2018-05-23T18:47:04.949+0000)\n>\n> No ti prego...è la seria di skin più orribile e sessista mai fatta. se si potessero bannare anche le skin nella fase di pick le bannerei xD\n> Peace :D\n\nHAi un idea particolare sulla bellezza delle skin.","replies":[]}]}]}