{"poster":"Thunderspam","date":"2017-06-18T23:52:30.430+0000","title":"Question about the VS events for a Rioteer","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I really like this new event that is going on(not to mention the missions thing which I've always wanted) but I had two quick questions \r\n\r\n1. What is the material that you get with 7 completed missions(called the victors something idk what it was) and what is its purpose/crafting ability, because I obtained it last night and it says that its a material but has no available crafting option on it.\r\n\r\n2. If I use 280 of either the Dawn/Chaos tokens and get the fancy Icon and Loading Screen Boarder, does the border: \r\n         A. require that I already own the skin to use it(i.e. already own Dawnbringer Riven to have it available to use)\r\n\r\n and B. If I unlock the border but do not obtain the skin before the event runs out at the end of the month, if i obtain the skins at a later date will i \r\n            still have the border for them or do i have to purchase them during the event to get the unique border?\r\n\r\n\r\nI really appreciate any help that you guys can give and hope that you can get back to me soon :)\r\nThanks!","replies":[{"poster":"Broporo","date":"2017-06-19T02:25:45.031+0000","up_votes":1,"down_votes":0,"body":"I'm so glad you're enjoying the new event and missions! ^_^\n\nDown to the nitty gritty!!\n\n1) The Victor's Emblem is a special token that you will use to craft into the winning sides victory icon. Once the event ends, you will then be able to craft that token into the icon.\n\n2 A) You **DO** need to have the skin for the borders to work, since they are solely meant for those skins. Without Dawnbringer Riven, you will not see the border even if you have the icon.\n   B) You not **NOT** need to buy the skin right now to activate the border. If you have the border icon now, you can wait until a week after the event and buy the skin and still have the border show up!","replies":[{"poster":"Thunderspam","date":"2017-06-19T02:36:25.959+0000","up_votes":1,"down_votes":0,"body":"Thx Bro(*snicker*)! \nOne more question that i hadnt thought of earlier\n\nIf you get the Emote/Icon package, will the emote be available at all after the event?","replies":[{"poster":"Broporo","date":"2017-06-19T02:49:17.242+0000","up_votes":1,"down_votes":0,"body":"I believe that emote is only available during the event. Once the event ends the emotes most likely will not work.","replies":[]}]}]}]}