{"poster":"FQW Monnino","date":"2015-04-10T18:11:16.485+0000","title":"HELP!!! Progressione o retrocessione RANKED","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti!\r\nL altro giorno stavo pensando e mi &egrave; venuto un dubbio: Nella season 3 se non ricordo male era stato messo in evidenzia il fatto che tu se salivi di promozione (esempio da bronzo a silver o da silver a gold eccetera) tu non potevi pi&ugrave; retrocedere di promo con le sconfitte, a meno che tu non rimani inattivo per pi&ugrave; di 28 giorni... Ovviamente se eri un gold II e iniziavi a perdere partite retrocedevi a Gold III, IV e successivamente V ma senza rischiare di andare Silver I\r\nIl mio dubbio era... &egrave; ancora presente questa regola?\r\nPerch&egrave; diciamolo... uscire dal bronzo &egrave; molto complesso non tanto per l esperienza quanto per i giocatori che spesso sono irrascibili e con poco iniziano a prendersela e a feeddare\r\nDato che ora sono un Silver V ( Non me ne vanto, ma comunque &egrave; sempre un inizio migliore del bronzo) e avevo avuto una serie di vittorie e una successiva serie di sconfitte fino ad avere nuovamente 0 LP, ho smesso di fare ranked per un lungo periodo dato che avevo paura di ritornare nuovamente Bronzo I (anche se alla fine ho ripreso coraggio xD e ho avuto un buon risultato di 3 vittorie su 3, che non essendo molte mi hanno ridato piena sicurezza sulle ranked)\r\nAppunto ripensando alla season 3 mi sono chiesto se alla fine quel periodo lo avrei potuto saltare tranquillamente perch&egrave; dal silver uno non pu&ograve; scendere se non per inattivit&agrave;.\r\nLa mia domanda &egrave; quindi la seguente... \r\n&gt; _**Vige ancora questa regola?**_\r\n\r\nGrazie in anticipo ---&gt; {{champion:7}}  Monnino98 {{champion:157}}  &lt;---","replies":[{"poster":"Frattaglia","date":"2015-04-10T20:37:59.186+0000","up_votes":2,"down_votes":0,"body":"Puoi scendere per una serie di sconfitte, ma devi avere un mmr così basso che giochi con gente con una lega sotto di te.\n\nNon scendi per inattività in gold silver e bronzo","replies":[{"poster":"FQW Monnino","date":"2015-04-10T21:05:34.573+0000","up_votes":1,"down_votes":0,"body":"Grazie mille +1 ^^","replies":[]}]},{"poster":"kirchhoff","date":"2015-04-10T20:17:18.599+0000","up_votes":2,"down_votes":1,"body":"Si, c'è ancora, ma non in bronzo e argento.","replies":[{"poster":"Akujii","date":"2015-04-11T00:38:04.962+0000","up_votes":1,"down_votes":0,"body":"ti dovresti informare un po meglio mi sa, scendi in tutte le leghe se hai l'mmr troppo basso per essa, esempio se sei silver 5 scendi a bronzo 1 il tuo mmr scende sotto i 1000 (misurabile con op.gg anche se nn è giusto l 100%)\nInformati prima di dare informazioni sbagliate.\nᕕ( ͡° ͜ʖ ͡° )ᕗ","replies":[{"poster":"kirchhoff","date":"2015-04-11T11:31:08.342+0000","up_votes":1,"down_votes":0,"body":"Intendevo per inattività.","replies":[{"poster":"Akujii","date":"2015-04-11T13:59:35.736+0000","up_votes":1,"down_votes":0,"body":"Ovviamente se eri un gold II e iniziavi a perdere partite retrocedevi a Gold III, IV e successivamente V ma senza rischiare di andare Silver I\nallora togli questa frase in quanto che se le perdi retrocedi ^^","replies":[]}]}]}]}]}