{"poster":"Yuki The Neko","date":"2015-10-03T23:08:21.334+0000","title":"Folgt aus dem LeaveBuster-System überhaupt eine ernstzunehmende Strafe?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":3,"body":"Hallo liebe und nette LoL-Com,\r\n\r\nich wollte mich erkundigen, ob das LeaveBuster-System &uuml;berhaupt zu etwas n&uuml;tze ist?\r\nIch hab da einen Kollegen, der sehr, sagen wir mal, &quot;wankelm&uuml;tig&quot; ist und seine gute Laune wegen Spielern, die in seinen Augen zu viele Fehler begehen, in puren Hass auflodern l&auml;sst. \r\n\r\nDann kommt es hin und wieder vor, dass er das Spiel &quot;ausversehen&quot; aufgrund der Hasstiraden und einigen beherzten Handgriffen beendet.\r\n(Liebe LoL-Com  mit &quot;hin und wieder&quot; meine ich 2-3 die Woche)\r\n\r\nDie einzige Strafe, die er bekommt ist die &quot;niedrige-Priorit&auml;ten&quot; Warteschlange. \r\nAber nun kommts, Leute.  Das ist meiner Meinung nach vieeel zu wenig.\r\nEr zerst&ouml;rt wiederholt, kontinuierlich die Spiele von mir und 8 anderen Spielern und muss sich da mit so einer \r\n&quot;l&auml;cherlichen&quot; Strafe abfinden?\r\n20Minuten abwarten bevor das Match beginnt...\r\nDas ist doch quasi ein Freifahrtsschein f&uuml;rs Leaven und es l&auml;sst auch in mir Wut aufkochen, dass einige Trollleaver (diejenigen, die vor dem Leaven noch ganz frech in Minute 0:30 &quot;bye&quot; schreiben) sowieso damit ziemlich unbeschadet durchkommen.\r\nWozu &uuml;berhaupt dann noch f&uuml;rs Leaven reporten, wenn der Nutzen daraus quasi 0 ist?\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n{{champion:150}}","replies":[{"poster":"Humpelstilzche","date":"2015-10-04T09:27:30.376+0000","up_votes":3,"down_votes":0,"body":">  Das ist meiner Meinung nach vieeel zu wenig.\n\nIch empfehle dir mal eine Woche oder so täglich in dieses Forum zu schauen. Früher oder später wirst du einen Thread sehen, wo einer diese Strafe bekommen hat (wobei diese Leute seltsamerweise dazu neigen ihre Threads im falschen Forum zu eröffnen). Und dann wirst du sehen, wie unheimlich angepisst Leaver von dieser Strafe sind. Manche betteln förmlich darum lieber stattdessen gebannt zu werden. Low-Prio-Q mag harmlos klingen, ist aber wohl die nervigste aller Strafen. Einen Ban kannst du einfach aussitzen. Einfach auf einen anderen Account wechseln oder schlicht und einfach ein anderes Spiel spielen, nichts leichter als das. Bei einer Restriction kannst du weniger schreiben...für notorische Plaudertauschen vlt nicht so angenehm, aber im Prinzip kein Problem. \nAber bei Low-Prio-Q musst du für jedes verdammte Spiel 20 Minuten stumpfe Warterei mit einrechnen. Und du kannst nicht einfach ne halbe Stunde joggen gehen und dann gemütlich ein Game starten, nein, du musst auch noch genau zum Ende dieser 20 Minuten anwesend sein, denn wenn du diesen Moment verpasst, darfst du nochmal 20 Minuten sinnlos rumsitzen. \nAls wäre das noch nicht genug, kannst du im Prinzip auch nicht mehr mit Freunden zusammen spielen, weil die dann ebenfalls 20 Minuten warten müssen (und ebenfalls alle im exakt richtigen Momentan anwesend sein müssen). \n\nLow-Prio-Q ist also längst keine so harmlose Strafe wie sie vlt auf Anhieb wirkt. Sie ist äußert nervig und kann, im Gegensatz zu Bans, in keinster Weise umgangen werden.","replies":[{"poster":"Spicavius","date":"2015-10-04T17:57:44.034+0000","up_votes":6,"down_votes":0,"body":"Ganz ehrlich es ist eine harmlose strafe.\nVllt kommen nur eine ganz geringe Menge an Leuten, die das unfassbar nervig finden.\nIch habe letztens (siehe mein letzter Thread) mit einem Kumpel gezockt und der hatte diese Low-Prio.\nIch habe ihm gesagt er soll gefälligst seine Verbindung zu LoL/Internet mal fixen, damit er keine Spiele mehr versaut.\n\nNaja letztendlich habe ich mit ihm 2 Runden gezockt und wir beide haben uns einfach einen Smartphone_Wecker gestellt auf 18 Minuten.\nWährend wir gewartet haben, habe ich einfach mal einen Forum-Thread eröffnen und er hat Youtube-Videos geschaut.\nIm 2 Spiel habe ich mal kurz meine Wohnung gestaubsaugt und er hat für sich kurz essen gemacht.\n\nUns beiden hat diese Strafe nicht mal ansatzweise gestört.  Ich kann mir gut vorstellen, dass viele Leaver das ähnlich sehen.\n\nMein Vorschlag wie auch bei meinem Thread ist, dass **eine zufällige Abfrage während den 20 Minuten kommt**. \"Beschwörer, bist du noch da, um in den Kampf zu ziehen?\" --> \"Ja\" ---> 20 Sekunden hat man Zeit auf \"Ja\" zu klicken. Wenn man nicht bestätigt, dass man da ist, wird man aus der Warteschlange rausgeschmissen.\n\nIch denke Menschen hassen nichts mehr als \"aktives\" Warten. Das sollen eben die **chronischen** Leaver zu spüren bekommen und somit entweder ihre VErbindung fixen ODER einfach nicht mehr leaven.","replies":[{"poster":"Humpelstilzche","date":"2015-10-04T21:50:08.864+0000","up_votes":1,"down_votes":0,"body":"> Mein Vorschlag wie auch bei meinem Thread ist, dass eine zufällige Abfrage während den 20 Minuten kommt. \"Beschwörer, bist du noch da, um in den Kampf zu ziehen?\" --> \"Ja\" ---> 20 Sekunden hat man Zeit auf \"Ja\" zu klicken. Wenn man nicht bestätigt, dass man da ist, wird man aus der Warteschlange rausgeschmissen.\n\nDas ist ja fast schon diabolisch. I like it ;)","replies":[]}]}]},{"poster":"RoderickAndara90","date":"2015-10-04T03:51:37.837+0000","up_votes":1,"down_votes":1,"body":"Ich habe letztens meine Sieg des Tages gemacht. Ich mach den immer in einem 3 vs 3 Botgame, weil das relative zügig geht. Aufjedenfall schrieb da einer er spielt die Botgames nur um die Low-prio weg zu bekommen.\n\nIch finde um den Lerneffekt zu erzielen sollte man die Low-Prio nur in PVP Spielen wegbekommen können.","replies":[{"poster":"GummibaumXYZ","date":"2015-10-04T06:45:52.427+0000","up_votes":2,"down_votes":0,"body":"Ich weiß nicht wielange ein solches 3 vs 3 Botgame ca. dauert, aber bei einer Leaverbuster Strafe muss derjenige trotzdem jedesmal 5 - 20 min warten ( je nach Strafe). Das heißt bei der höchsten Strafe insgesamt 1h 40 min. Mir erscheint das als ausreichende Bestrafung.","replies":[{"poster":"Spicavius","date":"2015-10-04T18:02:08.865+0000","up_votes":1,"down_votes":0,"body":"Vor jedem Spiel 18 MInuten Smartphone-Wecker stellen und kurz etwas essen gehen/machen, staubsaugen, Youtubevideos anschauen/Imgur \"funny\" anschauen, Fernsehen oder fast eine ganze Folge \"Detektiv Conan\" gucken.\n\nGg Easy Lyte. Das stört nicht mal annährend. (Ich bin nicht betroffen, aber ein Kumpel der das hat wegen Verbindungsproblemen)","replies":[{"poster":"GummibaumXYZ","date":"2015-10-04T19:55:02.372+0000","up_votes":1,"down_votes":0,"body":"Daran würde aber auch die vorgeschlagene Änderung, dass man die Strafe nur bei PvP-Spielen abbauen kann, nichts ändern.\nWas wäre dein Vorschlag für eine angemessene und wirksame Bestrafung?\nEdit: Ok habe deinen Vorschlag gelesen und fände ich eigentlich nicht schlecht, aber das ist dann schon echt sehr viel härter, als die jetzige Bestrafung.","replies":[{"poster":"Fcktardmagnet","date":"2015-10-04T21:58:12.094+0000","up_votes":2,"down_votes":0,"body":"Die aktuelle Bestrafung ist ein Witz gemessen am Schaden den ein Leaver anrichtet.","replies":[{"poster":"GummibaumXYZ","date":"2015-10-05T06:00:28.123+0000","up_votes":3,"down_votes":0,"body":"Ich bin auch der Meinung, dass ein notorischer! Leaver schlimmer ist, als Riot das wohl wahrnimmt.\nZumindest hieß es vor kurzem noch, dass diese trotz ihrer Strafe die Saisonbelohnungen bekommen sollen. Das hat mich auch etwas verwundert.\n\nDer Leaverbuster ist sowieso schon tolerant genug, um gelegtliche Leaves durch technische Probleme nicht zu bestrafen, deshalb erschließt sich mir die Toleranz gegenüber den bereits Bestraften auch nicht.","replies":[]}]}]}]}]}]},{"poster":"Powerjen","date":"2015-10-03T23:46:48.073+0000","up_votes":2,"down_votes":0,"body":"Spiel nicht mehr mit ihm, auch wenn er Dein Freund ist. Leute wie er verderben permanent anderen den Spielspass. Man sollte sie meiden. Und wenn er es dann nicht kapiert, sags ihm ins Gesicht, was Du von seinem Verhalten hältst. Wenn er wirklich Dein Freund ist, geht er vielleicht in sich.","replies":[]}]}