{"poster":"LastHope17","date":"2016-04-29T23:53:11.379+0000","title":"¿Cuantos flammers se encuentran por dia?, ¿Y ustedes, solo reportan o bloquean?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":0,"body":"Lo que dice el titulo, quiero saber masomenos que hace la comunidad si solo reporta o bloquea, en mi caso cuando me encuentro un flammer de los que no paran de flamear los bloqueo, debo tener a mas de 300 bloqueados xD","replies":[{"poster":"ARG XtremePlay","date":"2016-04-30T15:38:38.575+0000","up_votes":2,"down_votes":0,"body":"solo en mi team, en 9 de cada 10 partidas tengo al menos un flammer. en general, en 10 de cada 10 partidas hay un flammer que si no esta en mi team, esta en el equipo contrario hablando por all :p\ny nada, solo report y lo pasado pisado xD","replies":[]},{"poster":"Manu Carba","date":"2016-04-30T02:25:20.590+0000","up_votes":2,"down_votes":0,"body":"Yo una vez jugue una ranked con un amigo, y nos toco un pibe que termino como 1/12 y encima flameaba. Bueno, cuestion que mi amigo lo bloqueo cuando termino la partida... Despues nos mandamos a otra ranked y pum! Nos toco con el mismo :D\n\nCasualidad? No lo creo :v\n\n(hablando en serio, creo que el Bloquear no funciona muy bien que digamos...)","replies":[{"poster":"LastHope17","date":"2016-04-30T05:35:07.971+0000","up_votes":1,"down_votes":0,"body":"Bloquear no funciona muy bien, pero si te lo encontras otra vez lo vas a tener muteado de una y ya vas a saber quien es el flammer/troll xD","replies":[]}]},{"poster":"Dog Bulling","date":"2016-04-30T17:14:20.496+0000","up_votes":1,"down_votes":0,"body":"Yo diría como 1 de cada 50 que me encuentro en mi equipo es flammer (es decir, en una de cada 10-15 partidas, más o menos 1 por semana).\n\nEn cuanto a trolls, Yo diría que uno de cada 100 lo es, rara vez veo a alguien que trollea de verdad, la mayoría solo no sabe jugar, aunque siempre esta el típico que no quiere ir support, el cual se desconecta antes de empezar la partida o termina siendo un doble adc. POR ESO YO PREFIERO JUGAR EN RECLUTAMIENTO, ASÍ SE EVITAN CASI TODOS LOS TROLLS.\n\nEn cuanto a afk, mas o menos el 5% parece desconectarse, ya sea desde el inicio, al final, aliado o enemigo, por lo que se sienten en casi todos los días al menos uno.\n\nPD: YO SIEMPRE REPORTO AL O A LOS QUE ARRUINARON LA PARTIDA, POR MUY BAJA SANCIÓN TENGAN ESTAS PLAGAS DEL LOL.","replies":[]},{"poster":"Mascheranox","date":"2016-04-29T23:55:40.798+0000","up_votes":1,"down_votes":0,"body":"Y que ganas con bloquear?  Nada, por que te siguen tocando en un futuro.  \nMe a pasado por eso te digo","replies":[{"poster":"LastHope17","date":"2016-04-30T05:36:57.257+0000","up_votes":1,"down_votes":0,"body":"Si ya se xD si yo tengo a 300 bloqueados me doy cuenta al toque, para lo que sirve es para que esten muteados al comienzo de todas las partidas y se supone que tratan de no emparejarte con gente bloqueada","replies":[]}]},{"poster":"Shijim4 de Virgo","date":"2016-04-30T03:10:47.291+0000","up_votes":1,"down_votes":0,"body":"1 flamer,troll,afk por semana en promedio (1 de esos, no 1 de cada), al flamer lo muteo, al troll lo ignoro y al AFK (depende el caso) y cada uno se come el report correspondiente.Soy platino y puede que por eso me toquen en menor medida.  Y jamas bloqueo a nadie, basicamente xq me acabo de enterar q se puede hacer eso xD {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"MorochoCandente","date":"2016-04-30T01:36:14.551+0000","up_votes":1,"down_votes":0,"body":"Nunca llego al punto de mutear, solo trato de calmarlos, y si no funciona dejo de responderles y reporte al final de la partida.\n\nReportar es la unica manera de reciban una sancion, y asi piensen un poco mas si prefieren perder la cuenta o dejar de insultar.","replies":[]},{"poster":"TlastGhost","date":"2016-04-30T00:51:28.610+0000","up_votes":1,"down_votes":0,"body":"> De flamers me encuentro todos los días :v. Pero bueno rara vez reporto o bloqueo.","replies":[]},{"poster":"Zeran","date":"2016-04-30T00:01:07.760+0000","up_votes":1,"down_votes":0,"body":"Flamers es tan normal ya solo los muteo, antes les decía que los muteaba ahora ni lo hago y curiosamente cuando muteo a uno muteo a todo el team, el tema  son los trolls hoy me toco uno después de dos meses.","replies":[]}]}