{"poster":"LastHope17","date":"2017-04-19T07:46:26.892+0000","title":"Plz, diganme que no va a ser tan lento Maokai... tanto la ulti como la w","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"https://www.youtube.com/watch?v=C8Xmyk8N_qA","replies":[{"poster":"Ghalen","date":"2017-04-19T11:10:40.786+0000","up_votes":3,"down_votes":0,"body":"Espero que no llegue exactamente así al servidor en vivo.\n\nNo sirve meter un root a esa velocidad, es contradictorio. La mayoría de las veces va a ocurrir como en el video, porque hay muchos campeones con habilidades de desplazamiento o boosts de velocidad que pueden moverse lo suficiente antes de que Maokai los atrape (incluso ocurre con la versión actual de la W).\n\nPor otro lado, la remoción del daño de impacto de la E de hace unos parches, sumado a este último cambio que vuelve a los saplings arbusto-dependientes para maximizar el daño, van a condicionarlo aún más. Y la R ni hablar, es absolutamente situacional con esa velocidad de babosa.\n\nNo digo que Maokai esté balanceado, pero estos cambios no parecen un balance, sino un burdo intento de que pierda popularidad.","replies":[]},{"poster":"Fakies","date":"2017-04-19T14:19:32.282+0000","up_votes":2,"down_votes":0,"body":"no va a ser tan lento Maokai... tanto la ulti como la w","replies":[]},{"poster":"Gaspar Noeh","date":"2017-04-19T07:51:31.816+0000","up_votes":1,"down_votes":0,"body":"Ya lo explicaron en el spoiler en ingles, y dice que vas a tener que pensar bien cuando largarla, porque no tiene velocidad e alcanze.......ya hay streamers diciendo que Mao murio, asique supongo que lo iran a buffar o algo.","replies":[{"poster":"LastHope17","date":"2017-04-19T07:56:54.018+0000","up_votes":1,"down_votes":0,"body":"Al menos yo no veo ninguna oportunidad de largarla, no todos son hecarim, pero si vos queres combear al enemigo el se va atras con lo lenta que es tu w y te comes todo el daño de sus minions y hasta un gankeo de su jg facil. Nose porque se les ocurrio cambiarle la velocidad a la w xD","replies":[{"poster":"Gaspar Noeh","date":"2017-04-19T08:18:24.231+0000","up_votes":1,"down_votes":0,"body":"Viste que cada vez que un campeon tiene alto winrate, lo nerfean o lo joden de tal manera que no sea una opción (con excepción de yasuo), posta que este año le dieron hasta la skin de campeonato, por lo efectivo q era.......no se que pasa por sus cabezas.","replies":[{"poster":"Ranpage","date":"2017-04-19T14:03:21.372+0000","up_votes":1,"down_votes":0,"body":"a yasuo no le dieron una skin de campeonato WTF y tampoco tiene un alto win rate de platino para arriba tiene un 49,23% en mid en el puesto 27\ny en top un 50.38% de winrate en el puesto 21 y ojo esto es en platino+ no en bronce en donde alguien lo usa con mecanicas de maestro yi","replies":[{"poster":"Gaspar Noeh","date":"2017-04-19T17:13:00.703+0000","up_votes":1,"down_votes":0,"body":"estoy hablando de Maokai, lo de Yasuo fue un comentario sarcastico","replies":[]},{"poster":"Kuai Liang Shen","date":"2017-04-19T16:07:25.524+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ranpage,realm=LAS,application-id=v7qsfXsE,discussion-id=qdLZJdGZ,comment-id=0000000000000000,timestamp=2017-04-19T14:03:21.372+0000)\n>\n> a yasuo no le dieron una skin de campeonato WTF y tampoco tiene un alto win rate de platino para arriba tiene un 49,23% en mid en el puesto 27\n> y en top un 50.38% de winrate en el puesto 21 y ojo esto es en platino+ no en bronce en donde alguien lo usa con mecanicas de maestro yi\n\nComo se nota que leiste re mal todo","replies":[]}]}]}]}]},{"poster":"SenpaiDeathx","date":"2017-04-19T14:06:37.267+0000","up_votes":1,"down_votes":0,"body":"todo caso, eran bien lentas las animaciones, al menos la W es imparable ","replies":[]}]}