{"poster":"LastHope17","date":"2018-09-22T05:16:54.238+0000","title":"¿Como descurseo mi cuenta?  (Cursed Account (?)","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Desde hace varias partidas que vengo con un compa&ntilde;ero en el equipo que muere 3 veces en 4 min, despues otro muere y se la pasan flameandose y por mas que trates de calmarlos se tiltean y venden la partida.\r\n &iquest;Como descurseo mi cuenta? \r\n{{sticker:sg-janna}}","replies":[{"poster":"IRG ll Spirit ll","date":"2018-09-22T05:43:37.105+0000","up_votes":2,"down_votes":3,"body":"lamentablemente asi esta el LoL actualmente, llena de toxicos que porque dices \"pls un gank\" se enojan, flammean y se pueden ir hasta afk por algo tan simple como eso. lo mejor es desintalar el LoL y ahorrarse todos los problemas.\nEl LoL ya no es un juego, es un negocio\nsiempre recuerda eso","replies":[{"poster":"Rhaast Nordico","date":"2018-09-22T06:37:35.675+0000","up_votes":1,"down_votes":2,"body":"Se nota que sos un pajero eh, primero que todo, todos los juegos son negocios, segundo, siempre hubo toxicos y los hay en todos los juegos tambien, en lo que te podria llegar a dar la razon es que lol no se molesta por banear a los que de verdad deben banear","replies":[{"poster":"IRG ll Spirit ll","date":"2018-09-22T07:09:18.947+0000","up_votes":1,"down_votes":1,"body":"claro, verdad que antes sacaban skin, cromas, iconos, artesania, skin ward, y bla bla bla a cada parche.\namigo, con todo el respeto de el mundo mejor no opines que demuestras lo retrasado que eres.\npiensalo asi. tengo a 100.000.000 de jugadores en mi juego mas de el 75% invirte dinero, claro que Riot gana pero pasa que tambien mas de el 30% de eso jugadores son o troll o super toxicos todos los game o son de los tipicos que se frustran y se van afk. si Riot los bannea a ellos ellos pierden mucho dinero por eso a riot no le interesa bannearlos \nahora diras, ¿ y que sabes tu que piensa Riot o que no ?\nFacil, hace unos meses riot anuncio que a todos los jugadores BANNEADOS PERMANENTEMENTE se les suspendera el Banneo\nahora dime tu porque crees que Riot quiere hacer eso cuando lo banneados en las season 1, 2, 3, 4, 5  y 6  ahora no lo estaran?\n\npiensalo asi, si un juego te produce mas malos ratos que buenos, entonces no es un juego.","replies":[{"poster":"TomateMoradoMVP","date":"2018-09-22T08:33:36.917+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=CHIC0 TERRY,realm=LAS,application-id=v7qsfXsE,discussion-id=PLjW02h2,comment-id=000100000000,timestamp=2018-09-22T07:09:18.947+0000)\n>\n> claro, verdad que antes sacaban skin, cromas, iconos, artesania, skin ward, y bla bla bla a cada parche.\n> amigo, con todo el respeto de el mundo mejor no opines que demuestras lo retrasado que eres.\n> piensalo asi. tengo a 100.000.000 de jugadores en mi juego mas de el 75% invirte dinero, claro que Riot gana pero pasa que tambien mas de el 30% de eso jugadores son o troll o super toxicos todos los game o son de los tipicos que se frustran y se van afk. si Riot los bannea a ellos ellos pierden mucho dinero por eso a riot no le interesa bannearlos \n> ahora diras, ¿ y que sabes tu que piensa Riot o que no ?\n> Facil, hace unos meses riot anuncio que a todos los jugadores BANNEADOS PERMANENTEMENTE se les suspendera el Banneo\n> ahora dime tu porque crees que Riot quiere hacer eso cuando lo banneados en las season 1, 2, 3, 4, 5  y 6  ahora no lo estaran?\n> \n> piensalo asi, si un juego te produce mas malos ratos que buenos, entonces no es un juego.\n\nEstadisticas inventadas lul + cambiar los hechos para usarlos como argumentos a tu favor (hace unos meses riot anuncio que a \"\"\"todos\"\"\" los jugadores BANNEADOS...) LUL, nose que tienes contra el juego pero si no te gusta puedes dejarlo y ya.\n\nEl lol es un negocio?. Si por definición lo es, al igual que por definición es un juego, veas como lo veas. Ahora que tu particularmente sientas que \"te produce mas malos ratos que buenos\" es cosa tuya y de nadie mas :] (es común que en juegos donde se involucra competir la gente sienta frustración por x o y motivo **shrug** ) .","replies":[]},{"poster":"Rhaast Nordico","date":"2018-09-24T00:24:03.315+0000","up_votes":1,"down_votes":0,"body":"Primero, estadisticas inventadas , segundo, te lo repito, todos los juegos son negocios, tercero, muchos juegos son frustrantes y eso no hace que dejen de ser juegos, baboso","replies":[]}]}]}]},{"poster":"Gig GOD OF DEATH","date":"2018-09-22T05:22:30.407+0000","up_votes":2,"down_votes":1,"body":"Así como existen victorias hay derrotas, asúmelas y pasa pagina.","replies":[{"poster":"LastHope17","date":"2018-09-22T06:09:02.054+0000","up_votes":1,"down_votes":0,"body":"Una cosa es cuando te pasa un par de dias o estar en racha de derrotas seguida por el tilt, pero a mi no me pasa ninguna de esas, pasa todos los dias y por mas que no este tilteado y juegue bien pierdo ._. sino fijense mi historial de clasificatorias xD","replies":[{"poster":"Cabo xD","date":"2018-09-22T06:19:38.549+0000","up_votes":1,"down_votes":0,"body":"A mi me había pasado desde las 2 veces que estuve a una sola partida de promo a platino, de ahí bajé hasta oro 4, pero meh... supongo que habrá días y días. Lo importante es no perder la cordura por un juego y si bien uno lo ve de manera competitiva y ese detalle saca a uno de las casillas, tenemos que entender que como todo juego se gana y se pierde. GG.","replies":[]}]}]},{"poster":"Mazoku","date":"2018-09-22T06:21:49.099+0000","up_votes":2,"down_votes":3,"body":"> ¿Como descurseo mi cuenta?\n\nEmpeza por jugar bien.","replies":[]}]}