{"poster":"Shauna aka Vayne","date":"2016-12-26T02:26:37.480+0000","title":"Ezreal","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Ich habe ein frag zur Ezreal ! Ich bin mit Ezreal Lvl 6. Und Wollte fragen wie man zu H&Ouml;LLE ein S schaffen soll. Ich stehe meiste Zeit mit ezreal 17-2-14 oder so. &Ouml;fters auch 24-5 So rum und bekomme jedesmal . Jedesmal A- B ok. Was ist falsch , Was mach ich falsch?! Kann mir jmnd Antworten wie ich EIN S bekomme ich bin so Tilted drauf So viele kills und Wenig Tode  trodz nur B A- !! {{sticker:slayer-jinx-unamused}} {{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Sinøn","date":"2016-12-26T02:33:36.240+0000","up_votes":3,"down_votes":0,"body":"Liegt Wahrscheinlich an deinem Farm der ist genau so wichtig wie kda","replies":[{"poster":"OT Riku","date":"2016-12-26T10:35:23.357+0000","up_votes":3,"down_votes":0,"body":"Nach 37 Minuten 160cs ist kein S wert.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-12-26T12:38:26.431+0000","up_votes":1,"down_votes":1,"body":"kills kann man auch ks'en","replies":[{"poster":"Shauna aka Vayne","date":"2016-12-26T14:42:55.318+0000","up_votes":3,"down_votes":1,"body":"Ks? Sry aber Ks gibt es nicht. Es ist ein Teamspiel und es wird auch bleiben. Es ist mir egal wer die kills bekommt  nur das Assist Zählt. Diese ganze Bronce IV Kinder die denken das mann in einem Team spiel Ks'en. Finde ich schon ein Bisschen schlecht. Ist meine Meinung.{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-12-26T15:54:06.433+0000","up_votes":1,"down_votes":1,"body":"ja aber seinem team alles wegnehmen ist nicht teamplay ich finde nen ks net schlimm nur dafür belohnt zu werden wäre net so geil","replies":[{"poster":"Shauna aka Vayne","date":"2016-12-27T01:43:50.159+0000","up_votes":1,"down_votes":0,"body":"ich habe meine kills 75% aus der  bot","replies":[]},{"poster":"OT Riku","date":"2016-12-26T16:40:29.356+0000","up_votes":1,"down_votes":0,"body":"Weißt du das es rein für das Team theoretisch besser ist wenn man “kill secured“.","replies":[]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2016-12-26T17:58:12.616+0000","up_votes":1,"down_votes":0,"body":"hä ich dachte alle kills gehören dem support","replies":[]}]},{"poster":"Noru Dali","date":"2016-12-27T21:01:51.891+0000","up_votes":1,"down_votes":0,"body":"Gott wenn ich das mim ks schon wieder lese.\nSry die leute ham kein plan.\n\nDeswegen spiel ich auch nimma so gern support.\nDie ganzen adc fritzen wi schreien ks ks ks i go afk.\nDa kotz ich im strahl.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-12-29T13:07:13.342+0000","up_votes":1,"down_votes":0,"body":"hast dann halt auch kein S verdient deswegen haste nami auch noch stufe 6","replies":[]}]}]}]}]},{"poster":"dNiW","date":"2016-12-26T15:11:02.353+0000","up_votes":1,"down_votes":0,"body":"Es wurde bereits alles wichtige gesagt, ich würde bei essentrice noch was ergänzen, er hat es am Besten\nzusammen gefasst.\nIst nicht offiziell, aber wenn ich wenig Wards setzte und alles andere stimmt  dann bekomme ich NIE ein S+ oder S.\nWenn Alles andere stimmt UND Wards dann ist es manchmal vorgekommen das ein S oder S+ auftaucht.\nKlingt doof ist nur subjektiv, aber Wards setzen nicht vergessen+","replies":[]},{"poster":"Yamató","date":"2016-12-26T12:56:05.048+0000","up_votes":1,"down_votes":0,"body":"Folgende Dinge spielen beim Rang eine Rolle:\n\n-KDA\n-Rolle\n-Farm\n-Gold\n-Schaden an Champions UND Gebäuden\n-Wards (nicht bestätigt)\n\n\nWenn du mit Ezrael ein S haben willst epfehle ich dir ihn zum Beispiel auf der Toplane zu spielen. Denn dann wirst du mit anderen Ezraels verglichen die auch auf der Top lane Spielen. Und da es eher weniger solche TopLane Ezrael Spieler gibt ist die Messlatte weiter unten. Des Weiteren kannst du dir mit Wards helfen. Warden an sich ist schon wichtig  im Game, aber wenn das Spiel zum Beispiel schon entschieden ist, kannst du dir als letztes Item noch einen Sightstone holen und ihn in der Base platzieren.\n\nHoffe ich konnte dir helfen ^^","replies":[{"poster":"Shauna aka Vayne","date":"2016-12-26T14:39:10.414+0000","up_votes":1,"down_votes":1,"body":"Also, So habe ich das noch nie betratet das mit dem Farm muss ich hinbekommen . Mit ezreal zur Farmen ist mega schwer . Aber so ist meine eigentlich gut. Und schaden an Champions Mach ich immer denn meisten weil ich ein Anderes Build habe. Das mega viel schaden macht ^^ Ok  gut dankeee","replies":[]}]}]}