{"poster":"Babsch","date":"2017-10-16T19:11:21.085+0000","title":"Buggs im neuen Patch?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nseit dem letzten Patch ist der Lol-Client wohl etwas verbuggt.\r\n\r\nWenn ich auf die Schaltfl&auml;che &quot;Spielen&quot; klicke, dauert es teilweise 30 Sekunden, bis mir die Spielmodi angezeitgt werden.\r\n\r\nDie Beute habe ich heute trotz 3 maligem neu Einloggen immer noch nicht zu Gesicht bekommen und scheinbar wurden beim letzten Einloggen gleich noch alle Einstellungen gel&ouml;scht .... was passiert hier gerade?","replies":[{"poster":"Gin","date":"2017-10-17T07:13:09.648+0000","up_votes":1,"down_votes":0,"body":"Das hört sich für mich nach Internetproblemen an. \n\nBist du zufällig über WLAN verbunden? Falls ja, hast du es mal über LAN probiert?\n\nÜberprüfe ob du ansonsten noch irgendwelche Programme offen hast die außer League of Legends eine auffällige Menge an Internet ziehen. (Steam, Skype, Chrome und co.)\n\nEin einfacher Weg das zu prüfen ist: Taskmanager öffnen -> Leistung -> Unten auf die Schaltfläche \"Ressourcenmonitor öffnen\" klicken -> Auf den Reiter \"Netzwerk\" gehen, und dort die Programme nach \"Empfangen sortieren.\n\nSollte beides nicht der Fall sein, würde ich dich bitten mal einen tracert zu erstellen:\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html \n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> \n> Trace Interval: 1 second\n> Focus Time: all\n> Target Name: 185.40.65.1\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> \n> Edit -> Copy as Text\n> Geht nach [Pastebin.com](http://pastebin.com/)\n> Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n\nWas das Löschen deiner Einstellungen betrifft kannst du dir mal [diesen Kommentar](https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/hlN0hiEh-meine-einstellungen-werden-einfach-nach-jedem-login-resettet?comment=0002) von mir unter dem vorherigen Post anschauen. ","replies":[]}]}