{"poster":"General Elephant","date":"2013-09-21T01:53:15.478+0000","title":"How to better your bot lane","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":1,"body":"People should main both, not just one bot lane role. It is what I've been doing ever since I realized the best way to succeed is to give the role the other person is strong at to them. I am not saying you can't/shouldn't prefer one over the other, but knowing and being good at both makes position calling almost argument free . It also does wonders for your own decision making in lane. Ever felt like \"OMG this person is doing their role all wrong!\" Well that is the feeling that makes you better, the trick learning the role you prefer, you need to get that OMG feeling while playing the other role.\n\nAs a double dose of helpful, you can notice how a \"mainer\" (one who mains a single role) does their role. What they do well, not just their mistakes.\n\n\nTL;DR-The trick to getting better at your favorite role is to play the other role and observe the faults and strengths of your laning partner.\n \n\nI hope people can benefit from this thread :). GD just seemed to ignore it...","replies":[{"poster":"jmccaffrey","date":"2013-09-21T04:36:23.960+0000","up_votes":4,"down_votes":0,"body":"I personally think that playing any role helps you gain insights that improve your game. For this reason in normals I usually try something different. It really helps to understand the meta better and the decision making allies and opponents are going through.","replies":[{"poster":"General Elephant","date":"2013-09-21T14:26:32.486+0000","up_votes":1,"down_votes":0,"body":"I can see your point, I guess what I'm trying to say here is through close observation you can learn things you may not think of otherwise. For instance, I learned the power of zoning when I had a janna zone both a vayne and leona (they got counter picked hard) so much so that just from farming and zoning and we were up 2 llevels each before 6. Also I learned the power of using the bushes to reset autos. \n\nI guess my post should have been more about the power of observation.\n\nAlso, you are my first ever riot post! So thank you for your insight. The bit anout breaking the meta to understand the meta is also very sage advice :).","replies":[{"poster":"LilYonsan","date":"2013-09-23T18:58:34.001+0000","up_votes":1,"down_votes":0,"body":"You would probably learn more in your game if you watched a professional stream.  Not saying that you wouldn't learn something from somebody that is better, but you might learn more if you spectate more often and pay attention to different aspects of how they're playing.  I've gained some incredibly valuable ideas, which have sometimes won me games, just from watching a match or two.","replies":[{"poster":"General Elephant","date":"2013-09-25T17:15:10.422+0000","up_votes":1,"down_votes":0,"body":"yes, spectating is nice, however I feel it is really important to get a hands on experience. I have picked up tricks from watching streams and spectating, especially warding locations/habits, but i do also learn a lot from how i/my ally get punished for being out of position, and see different ways to handle situations. a lot of times i've seen twitches double back for a counter gank on the q, and wow... it works so often as long as you ping... no one ever seems to see it coming.\n\nanyway i do support spectating as a form of learning, i simply believe in game learning experiences are even more important to learn.","replies":[]}]}]}]}]}