{"poster":"Rafitti","date":"2016-06-18T00:41:39.028+0000","title":"Lo Importante es divertirse, pero..........","subforum":"Charlas Generales","embed":{"description":"►►Juegos Baratos: https://www.g2a.com/r/g2adescuento Twitter: @G4G_Revenant Reve Joputa si eres un flamer no me engañas Runas y maestrías al final del vídeo!!! Quieres más vídeos?! Aquí tienes mi canal de Gameplays: https://www.youtube.com/user/Gaming4G... Sígueme en Twitter: @G4G_Revenant Bájate mi APP incauto! http://myapp.wips.com/revenantl0l-ext... Viva Manín.","url":"https://www.youtube.com/watch?v=8yEoGSE5SWs","image":"https://i.ytimg.com/vi/8yEoGSE5SWs/hqdefault.jpg"},"up_votes":27,"down_votes":4,"body":"Desde que recuerdo y tengo memoria he jugado videojuegos para divertirme, distenderme, a pesar de las derrotas estar contento.\nSer como una de esas personas que ragean, insultan  y denigran, ser asi te jode la vida, te malgasta y te agrieta.\nEsto es una queja a Riot, a su personal y a todo su ****** de sistema que permite que gente t&oacute;xica y destructiva se apodere de la comunidad, esto es como un virus y se va extendiendo, cada vez parecen m&aacute;s.\nSolo espero que vuelva el tribunal de justicia, que las cositas que aparecen cada tanto lo pongan en mejorar la comunidad, porque esto ira a caida.\nCreanme Rioters, llego un punto critico en el cual mucha gente ira a otros lados, hagan algo, amo al LoL, pero odio a esta ***** de comunidad\nJugamos a los videojuegos para divertirnos, no para amargarnos. Lo importante es pasarlo bien y divertirse.\nAyudenme... ayudemosno {{summoner:3}} {{item:3070}} ","replies":[{"poster":"Kamen Rider Woz","date":"2016-06-18T01:24:18.688+0000","up_votes":3,"down_votes":0,"body":"y que esperabas, solo les importa hacer plata y los elo/ranking altos, mientras los demas se ahogan tratando de escalar, no voy a estar 1 o 2 años para llegar a oro porque la verdad no tengo ganas de perder el tiempo. hay gente que juego muchos años y la recompensa es la basura de comunidad que tiene el juego, recalcando que vas ganando pero un cierto momento deciden tirar la partida para nada o irse afk porque la mami lo llamo a comer. No me esperaba mas de un juego gratis, me hubiera gustado mas que el lol fuera un juego de una sola compra y despues fuese gratis y con el implemento de la tienda ya que un papi o mami no le va a comprar un juego de 40 o 60 dolares dependiendo si es deluxe o normal al hijito para que vaya a trollear, ya que sigue siendo gratis pero solo compras el juego, aunque concordemos que hay cada padre retrasado que deja al hijo tirado jugando para que no lo moleste y este enchufado jugando todo el dia.","replies":[]},{"poster":"RLDFixxxer","date":"2016-06-18T15:32:48.808+0000","up_votes":2,"down_votes":0,"body":"Oh recuerdo mi ultima ranked me flamearon tan  asquerosa mente que me dio tanto asco la comunidad que ya ni una clasificatoria quiero tocar y todo por el nuevo sistema de emparejamientos op que tiene riot para hacer amigos a ver si ven mejor  el tema de las Dinamic Q porque a 1 flamer  te bancas los muteas  y listo pero  que  clase de  compañerismo y ganas de jugar un juego  si ya vas al caso de  mutear a todo  tu team porque te flamean  por 20 min en una partida","replies":[]},{"poster":"Cosmic Ganks","date":"2016-06-18T01:20:33.365+0000","up_votes":1,"down_votes":16,"body":"el mas flammers, hablando de los flammers en el juego, simplemente patetico, un noob patetico y flammer buscando likes\n\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Franrmn","date":"2016-06-18T02:57:13.105+0000","up_votes":4,"down_votes":1,"body":"Hablas de revenant? yo desd q juego veo sus videos y no flamea en todo caso lo dice pero al micro pero nunca escribió nada para flamear a alguien de su team o del contrario. Pero si hay youtubers como barba y coscu (creo q se llama) q se pasan y hacen de lo Flamer algo gracioso borrando el limite.","replies":[{"poster":"iLegault","date":"2016-06-18T15:47:34.199+0000","up_votes":3,"down_votes":1,"body":"Barba da asco.","replies":[{"poster":"BestAhriCuba","date":"2016-06-18T18:53:53.400+0000","up_votes":1,"down_votes":0,"body":"Y coscu da mas asco.","replies":[]}]}]}]},{"poster":"El Abejorrop","date":"2016-06-18T01:39:04.534+0000","up_votes":3,"down_votes":1,"body":"Todo sabemos que acá en LAS es 10 veces peor, y que riot no hace nada, están a full con sus cositas para vender que skin, que maestrias, etc, etc...\nPero una solución para poder jugar una partida tranquilos no la dan. Menos que menos para elos bajos como los míos.\n\nLo que yo empece a hacer, y creo que es lo mejor que se nos podría ocurrir, es armar clubes y llenarlos de gente que quiera jugar, divertirse, aprender, etc..\njugar siempre con la gente del club, y que alguien lo vaya \"administrando\", si alguien flamea o trollea Pum! afuera del club.\nY así formar tu propia \"mini comunidad de gente sana\" (esto, o dejar el lol, lo cual es una tentadora opción)\n\nSaludos!","replies":[]},{"poster":"Korean Hooker","date":"2016-06-18T01:54:52.406+0000","up_votes":2,"down_votes":1,"body":"Bueno, voy a dejar mi humilde opinion comentando que cuando estaba en elos bajos esto era MUY comun, pero este año al subir a goldie (hoy gold1), la cantidad de gente que me encontre siendo flamer es relativamente baja, mucha buena onda, te sigue agarrando la bronca con el que fedea y te hace perder la partida, pero no se lo flamea, perdes y a la otra partida te toca un team mejor (o no) y ganas.","replies":[]},{"poster":"Runth","date":"2016-06-18T03:10:13.802+0000","up_votes":1,"down_votes":5,"body":"como hay post repetido, solo pondre esto\n\nhttp://www.imagenesenlinea.us/img/desmotivaciones/30852_evita-las-personas-negativas.jpg","replies":[{"poster":"Franrmn","date":"2016-06-18T07:42:50.093+0000","up_votes":2,"down_votes":0,"body":"Tampoco podes tapar el sol con las manos.","replies":[{"poster":"Runth","date":"2016-06-18T08:13:31.506+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Franrmn,realm=LAS,application-id=v7qsfXsE,discussion-id=lcqItNfJ,comment-id=00070000,timestamp=2016-06-18T07:42:50.093+0000)\n>\n> Tampoco podes tapar el sol con las manos.\n\nsi la gente no cambia, ustedes son responsables de sus actos \n\nsolucionense solos","replies":[{"poster":"Franrmn","date":"2016-06-20T23:18:55.182+0000","up_votes":1,"down_votes":0,"body":"Osea yo soy responsable por lo que los demás hagan?","replies":[]}]}]}]},{"poster":"V L A D I M Y R ","date":"2016-06-18T22:22:23.896+0000","up_votes":1,"down_votes":0,"body":"No podes quejarte de la mala comunidad si sos parte de ella usando esas palabrotas.Reflexiona","replies":[]},{"poster":"natutivo","date":"2016-06-18T19:18:00.769+0000","up_votes":1,"down_votes":0,"body":"para publicar algo en el foro tenes que entrar y siempre hay gente quejandose de que les banearon la cuenta \"sin motivo\", esos son los que vos reportas, si los reportas por que hay gente que solo se queja en el foro pero no reporta diciendo que igual no les hacen nada a los trolls","replies":[]},{"poster":"GøD Cąrry","date":"2016-06-18T07:16:29.677+0000","up_votes":1,"down_votes":0,"body":"tenes razon pero si hablamos de ranked yo no solo juego para divertirme, juego para ganar, para competir, jugar bien y dar todo para subir. Y por gente que solo entra para \"divertirse y probar ranked, o tomarselo como una normal\" es que hay tanto flameo, la gente no se toma en serio las ranked y eso jode a los que realmente queremos ganar, por eso estan como estan las ranked esta seasson, por ese pensamiento. Si queres jugar para divertirte y pasarla bien tenes normal, los modos de juego que ponen los findes, etc. Sldos","replies":[]},{"poster":"Franrmn","date":"2016-06-18T03:07:11.644+0000","up_votes":1,"down_votes":0,"body":"Holas, justo estaba por postear este vídeo y creo que tiene razón, juego hace 2 años, el 1 año la pase de 10 acá en lol, el segundo año osea este año me convertí en un flamer y me banearon el chat por 5 partidas, y después de ver este vídeo creo que hice un click, siempre vi vídeos de revenant lo considero mi meta \"ser tan buen jg como el\" y estas palabras me hicieron reflexionar, \"¿por que flameo? \" y creo que Riot por mas que tenga grupos dedicados a skin otros a eventos tiene que poner mas atención a esto. No se si la solución sea banear ips pero si mas duros con las medidas y estaría bueno que vuelva un tribunal porque aveces los reportes son muy confusos, por ej la actitud antideportiva. Siempre y cuando el tribunal este compuesta por gente calificada para juzgar.\nNo dejare lol porque es un juego copado pero si creo que hay que hacer algo con esto.","replies":[]},{"poster":"Aephis","date":"2016-06-18T01:17:19.569+0000","up_votes":1,"down_votes":0,"body":"Desde la s2 que juego y cuando se creó LAS fue bueno por un mes a mucho, luego comenzó a ser muy muy tóxico y un lugar poco agradable para un juego. Desde entonces la gente se queja de esto, sabes que se logra? Nada. Siempre dicen que es solo sensación nuestra y que ellos hacen todo lo posible. Como si es el único juego y no podemos comparar para ver que no es verdad.\n\nEn fin, aprendí que si no te gusta, debes dejar de jugar. Lamentable pero cierto.","replies":[]},{"poster":"Yrox the Third","date":"2016-06-18T02:07:04.332+0000","up_votes":2,"down_votes":2,"body":"Comente esto en el otro post adonde se subio el video, pero ya que veo este post mas \"activo\" creo que tambien deberia postearlo aqui:\n> Ok, ahora si vi el video y esto lo que opino:\n\nPara empezar, es lo mismo que dicen todos los que se quejan de todo pero ya que este es popular todos (o varios) lo siguen, y daré los mismos puntos que siempre doy.\n\nPrimero, Riot, COMO TODAS LAS EMPRESAS, tiene equipos distintos que trabajan cosas distintas, ningun equipo se mete con el trabajo de otro al menos que sea para algo importante (por ejemplo, el equipo de desarrollo de skins se mete con el equipo del Lore para trabajar un evento o cosas asi), asi que obviamente hay un equipo especial para medir el comportamiento de la gente y las medidas de los castigos.\n\nAsi que, no, que Riot saque skins no dice que no esten haciendo nada para mejorar a la comunidad o los servidores o cosas asi, simplemente que el trabajo de un equipo, en comparacion, es mas facil que el de otro equipo, asi de simple.\n\nSegundo, el juego es Free-To-Play con un sistema que no es necesario verificar el email para jugar, asi que si alguien va, es toxico y le banean la cuenta, no tienen ningun problema para hacerse otra cuenta, subirla a nivel 30 y seguir troleando e insultando, y esto no solo pasa en LoL, pasa en todos los juegos F2P.\n\n\"AHHHH PERO LOL ES EL JUEGO MAS TOXICO QUE EXISTE\".\nEn cantidad, si, pero en porcentaje es igual a todos los otros juegos F2P, y esto se debe a que es el juego MAS POPULAR DEL MUNDO ACTUALMENTE, si no me equivoco, este juego tiene entre 50 a 70 millones de usuarios activos, es MUCHO mas de lo que cualquier otro juego tiene, entonces obviamente va a tener muchos mas jugadores desagradable que otros juegos si tiene el mismo porcentaje de toxicidad que otros.\n\n¿Por que Riot no banea gente?\n¿Y tu como puedes estar tan seguro de eso?, Riot banea gente a diario, siempre hay gente castigada, sea por LeaverBuster, por bans de chat, permanentemente, etc. Estos bans siempre ocurren y no porque no te pase a ti significa que no exista, el problema es lo que dije anteriormente, si te banean no hay problemas para hacerte otra cuenta.\n\nEntonces, ¿cual es la solucion?\nQuizas, el ban de IP.","replies":[]}]}