{"poster":"Genkwyll","date":"2018-02-22T16:01:59.299+0000","title":"8.4 Frissítés és Kai'sa","up_votes":2,"down_votes":1,"body":"Sziasztok.Kij&ouml;tt a 8.4-es friss&iacute;t&eacute;s.Igaz&aacute;b&oacute;l a v&eacute;lem&eacute;nyeteket akarom kik&eacute;rni,szerintetek milyen lett?Mit &eacute;reztek vele kapcsolatban?\nMinden egyes v&eacute;lem&eacute;nyt,kommentet sz&iacute;vesen v&aacute;rok. ~Genkwyll\nKai'sa-ról is várom véleményeteket.","replies":[{"poster":"The One ESCANOR","date":"2018-02-22T17:31:26.142+0000","title":null,"up_votes":2,"down_votes":0,"body":"Én csak néhány hősre reagálnék röviden : \n\n{{champion:122}} mindig is utáltam ellene játszani, eddig is bannoltam és ezután is fogom. Az E nagyobb buffnak tűnik így elsőre. Viszont a W buff is elég erősre sikerült szerintem. Saját vélemény de szerintem ezt finomhangolni fogják kövi pathcben.\n\n{{champion:41}}  mostanában elkezdték a tankosabb rúnát+buildet hozni rá ami miatt kb megölhetetlen lett. GP-nél minden évben eljátsszák ezt hogy kis buff majd nerf és eltűnik.\n\n{{champion:150}}  eddig is meta volt főleg LCS-en, de most már mindenhol az lesz. A Q töltési ideje szerintem nem nagy nerf mivel a {{item:3071}}-ből úgyis kap 20%, meg általában a Gnar játékosok közel 40% cd-el játszanak.\n\n{{champion:516}} egy kisebb buff a W-re. Mikor nerfelték a W-t akkor mindenki elásta de mégis maradt a metaba. Most talán megint top tier pick lesz.\n\n{{champion:78}} szerintem jelenleg Poppy nem egy jó választás, ettől a bufftól sem lesz az. \n\n{{champion:58}} ő valahogy mindig eltűnik lategameben főleg ha hyper carryk ellen van, szerintem nem egy nagy buff. \n\n{{champion:28}}  ha early-mid gamet nem nyered meg, akkor feleslegesen játszol vele. E buff talán életképesebbé teszi majd és talán a {{item:3151}} is effektívebb lesz most rajta.\n\n{{champion:9}} nincs nagyon véleményem, low elon sem látni a papír buildje miatt bár rendes rúna sincs ami effektív lenne. Ettől a buff miatt csak a onetrick Fiddle maineket erősítették.\n\n{{champion:429}} nem nagy nerf, bár így nehezebben fog lanelni a nagyobb ranged adc-k ellen.\n\n{{champion:96}} top 3 adc-be benne volt eddig is Kog és ezután is benne lesz. Tankokat csak úgy zabálni fogja...\n\n{{champion:107}} tippelnem kéne akkor az ő buffját és ''mini reworkjét'' elég sok ember várta és most megint nagy meta a Rengar jungel. \n\n{{champion:106}} jó ez a buff neki talán néhányan előveszik jungelbe meg topon, viszont amit írt a Riot hogy mindenképp kapni fog egy nagyobb átalakítást elég jónak hangzik.\n\n{{champion:238}} még több Zed és még több ulti...szerintem ő ez miatt bannlistára kerül ( bár eddig is előszeretettel bannolták )","replies":[]},{"poster":"Gamma Ray","date":"2018-02-22T16:19:39.475+0000","title":null,"up_votes":2,"down_votes":0,"body":"Jó sok ap-s itemből megint elvonták az ap-t.\nA morellót már meg sem veszem 20% cd ugrott, ap  ugrott. Ráadásul 3000 gold ami kemény\nAz ikerből a lassítás oké, de valahogy nem tetszik az nekem sehogy sem. First itemnek supportnak irtó drága és pazarlás, második itemnek sem olcsó és legjobb esetben is lategamere van értelme megvennem. \nA bűbájgyűjtő nonszensz, nem tudom ki fogja végigvárni azt a 100 stacket. A belőle származó mozgási sebesség jelentéktelen. Én semmit nem vettem észre. Kétlem, hogy egy Rakan is meg fogja venni emiatt. Ellenben régen az érméből származó mozgási sebesség, azért szemmel látható volt és egy valamire való Rakannak jól jött vagy bárki másnak.\n\nNem tudom mi ütött beléjük, de amit mostanság művelnek siralmas. Zoe vagy vették vagy valaki tök más készítette nekik megrendelésre. Ha az új jövevénnyel állítom szembe aki most jött, katasztrofális. Kindred, khazix, vayne keverék, unalmas megjelenéssel, brutális.\n\nLehet új idénymunkásokat alkalmaz a Riot, de illene őket hazaküldeni és visszahivni azokat akik a Zoe, Ivern stb project alatt dolgoztak.\n\nElőször elszarják az itemeket, most pótolják, de olyan módon mintha előtte az egész banda leitta volna magát.","replies":[{"poster":"Storiaron","date":"2018-02-22T16:49:57.702+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ez még semmi de vladnak mi a francot fogok venni?\n\nEddig rengetegszer volt a Luden's az első itemem, az ugye most felejtős. Ráadásul majdnem minden meccsen vettem morellot is(20% cdr és 100 ap+grievous wounds verhetetlen).\n\nMost mindkettő ugrott, és állhatok be a sorba a Láma protobelt rush spirit visage buildekhez. Zavar nagyon...","replies":[]}]},{"poster":"kalamona90","date":"2018-02-22T16:16:34.379+0000","title":null,"up_votes":2,"down_votes":0,"body":"Nekem az nem tetszik benne hogy kizárólag a profikat nézték és az alapján alakítottak mindent. PL most BO1 ek vannak ezért mindenki skélelős hőst hoz ami miatt elhúzódnak a meccsek. Csak azért alakítottak a baron buffon hogy gyorsítsanak a meccseken. A nyomolvasók tőrét is csak a profi meccsekre hagyatkozva szedték ki. Nem tetszik az ereklye pajzs és hozzá tartozó tárgyak nerfje se. Pontosabban annak mértéke. \n\nTetszik hogy újra lehet szellemeket idézni supportként sőt midre vagy ap jg-nek is érdemes lehet megvenni a tárgyat. \n\nAz új hős egyenlőre unalmasnak tűnik. \n\nÖsszességében ez az eddigi leginkább nem tetsző frissítés.","replies":[{"poster":"Gamma Ray","date":"2018-02-22T16:29:29.859+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet, hogy jó supportnak, sőt biztos. Csak nagyon kérdéses mit veszek meg először. Egy redemptiont, iront, vagy az ikert.\n\nRégen az alap support itemből lehetett fejleszteni és azért nem volt akkora költsége. Nem tűnt olyan drágának, inkább így mondom. Most viszont egy teljesen különálló tárgy 2400-ért.\nRégen is e körül volt az ára csak addigra már 850 gold benne volt az alap penge miatt. Csak rá kellett dobni kb pár goldot, most viszont instant rá kell dobni 2400-at.\n\nKipróbáltam megvettem elsőnek és nagyon fájt a csapatnak az a plusz 15 perc mire meglett a redemption. Ha első itemnek veszem meg, akkor a meccs első 30 percében haszontalan vagyok a csapatra nézve, ha második itemnek veszem meg akkor meg, pont az az előny úszik el ami kellene botra. Egy low hp-n lévő ellenfél elfogásához, gank megállításához ....\n30-35. percben már megy az adok kapok, ott nem nagyon tudnak eliszkolni csak úgy 100 hp-n. Jól jön az 30-35. percben is még, de már nem olyan effektív maga a tárgy, mint régen volt sajnos. Számomra nem annyira effektív így sajnos.\n\nNem is vártam mást, hiszen a supportok TÚL OP-K voltak mindig is....","replies":[{"poster":"kalamona90","date":"2018-02-22T17:30:11.881+0000","title":null,"up_votes":1,"down_votes":0,"body":"> Lehet, hogy jó supportnak, sőt biztos. Csak nagyon kérdéses mit veszek meg először. Egy redemptiont, iront, vagy az ikert.\n\nRégen az alap support itemből lehetett fejleszteni és azért nem volt akkora költsége. Nem tűnt olyan drágának, inkább így mondom. Most viszont egy teljesen különálló tárgy 2400-ért.\nRégen is e körül volt az ára csak addigra már 850 gold benne volt az alap penge miatt. Csak rá kellett dobni kb pár goldot, most viszont instant rá kell dobni 2400-at.\n\nHát nem tudom szerintem a régi se volt olyan tárgy hogy első tárgyként meg akartad venni, Max akkor veted meg korán ha nem tudtad mit vegyél ennyiből. De a játék korai hatására nem volt akkora befolyással hogy érdemes legyen.  És ez így van jól. \n\nÉn mindig arra használtam elsődlegesen hogy a kivilágítatlan jg-ét felfedjem hogy ne haljak bele a wardolásba, És 1-2 dzsungelesnek szintén erre lehet jó ha hátrányba kerül nyugodtan közlekedhessen a dzsungelben.  Meg most azzal fogok kísérletezni hogy fagyasztós rúnát viszek olyan supportokna akik alapból szeretnek auto atackolni pl nami aki ezt felerősíti. és neki a 2 szellem nagyon op. Ezt főleg szituációs mesterségként képzelem ell. Ha olyan a dzsungeles pl master y","replies":[]}]}]},{"poster":"Gresident","date":"2018-02-22T16:08:50.892+0000","title":null,"up_votes":2,"down_votes":1,"body":"Azt, hogy minden frissítéssel a bot lane egyre jobban hátrányba kerül supp és adc is, még indokolatlanul (főleg) az assasinokat buffolják....\nNem mintha nem lett volna eddig is óriási hátrányban a bot, főleg az elején...","replies":[]},{"poster":"Genkwyll","date":"2018-02-22T17:42:57.013+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én véleményemet olvashatjátok most.Nekem nagyon nem tetszik ahova a riot megy most.\nAddig volt a jó ammedig volt sighstone és shield a relicből.Tudom hogy azért fejlesztették hogy tudjanak wardolni.De minek?Trinket,75-ös,sighstone.Amikor volt shield leonával csak bementem teamfightba benyomtam W-t (nagykarin persze)és lazán túléltem,kisétáltam,5 assist.Nevetségesek az új tárgyak.Most +200 gold áráért kapunk 10% movement speedet,és drága tárgyakat craftolhatunk.Alleluja.Kísértő álarcba pont az volt a jó hogy pontalapú varázstörése volt.Tehát mondjuk Twisteddel vagy teemoval egy cipővel,álarccal és egy bottal búcsút mondtál az enemy varázsellenállásának,most meg +2% sebzés apsoknak,ami megerősíti a jó kis 2 hit late game képességüket (tudom zoet nerfelték,arról is esik szó majd).A feledés gömbje:a kinézete a régi supp item shieldje (az ikon,ami megjelenik ha fel volt töltve)az adatai pedig a régí állarcé.Bűbájgyűjtő:attól függ,mennyi stacket ad.De becsléseim szerint nem fog 3-nál többet...\n\nDarius:szerintem fölösleges a buff.Sokat látom,elég erős 1v1-be ahhoz képest hogy offtank.\nOrnn:szerintem is nerfelni kellett volna,de ez inkább finomhangolás.\nFiddlesticks:szerintem ráfért a buff,soha nem láttam nagykarin meg ezen az accon se.Jó az elképzelés hogy egy madárijesztő jg-be,de ha kisétál a w-ből,lejár a rettegés nem sokat érsz.\nSwain:jó hogy a w költsége kisebb lesz,de így is sok.Tegyük fel van 400 manája,és egy W 100 mana.Range nem olyan sok.Ha bokorba rakod,ott a ward.Ulti buffja jó lett.\nVolibear:jól jön neki a buff,de már kb.akinek van egy kis cc-je távol tudja tartani magától.\nZoe:szerintem ráfért.Már pár száz ap-val leqzott,és meghaltál.Valamint a minionok nem adhatnak neki teleportot.\n\nUtolsó esély:elég jó item,ww-re és mágusként ha telik rá nagyon nagy előnyt biztosít.\nSzerk:Nem tudom hogy lee sinnel most mi lesz,őrszemes jg item nélkül,jax se tud ráqzni (de talán trinkettel)\nBocs hogyha hosszó volt,ennyi lettem volna.","replies":[{"poster":"Complex VN","date":"2018-02-23T12:57:36.181+0000","title":null,"up_votes":1,"down_votes":0,"body":"> Kísértő álarcba pont az volt a jó hogy pontalapú varázstörése volt.Tehát mondjuk Twisteddel vagy teemoval egy cipővel,álarccal és egy bottal búcsút mondtál az enemy varázsellenállásának,most meg +2% sebzés apsoknak,ami megerősíti a jó kis 2 hit late game képességüket (tudom zoet nerfelték,arról is esik szó majd).\n\nA {{item:3151}}  statjai megvannak a morelloban+Grievous Woundsot is kapsz alapból, nem csak 35% hp alatt. A mostani {{item:3151}}  pedig pont hogy az olyan hősöket erősíti mint teemo, nem a 2 hit burstösöket.","replies":[]}]},{"poster":"MUDA Burritos","date":"2018-02-22T17:39:41.042+0000","title":null,"up_votes":1,"down_votes":0,"body":"Majdnem elkezdtem inni amikor megláttam a változtatásokat....{{item:3028}}  Konkrétan már olyan szinten nem hiszek a roit balance teamben, hogy azért imátkozok ha már faszságot csinálnak csinálját szolidan. Erre fel bazdmeg mindent reworköltek. Bebasztak 2 új itemet (tudom abból 1 csak vissza van hozva) és rengart is baszkurálták. Nem tudom milyen lett de fogadok, hogy nem a balanceolt lesz az első szó ami eszembe jut ha ingame-be látom.","replies":[]}]}