{"poster":"CutePandaMoMo","date":"2016-06-14T19:57:32.981+0000","title":"Mouse Cursor Ingame Is Too Small","subforum":"Help & Support (OCE)","up_votes":9,"down_votes":1,"body":"Actually almost everything is so small..... the font, the character models, the map, the map icons... but these I can disregard at least for the meantime...\r\n\r\nMy primary concern is my super small ingame mouse cursor because in clashes, I feel like I&#039;m losing it. Is there a way to make it bigger. Picking smaller resolutions doesn&#039;t really solve the problem.\r\n\r\nI&#039;m using 3k x something resolution btw.","replies":[{"poster":"SephirothSG","date":"2016-06-15T07:59:24.187+0000","up_votes":3,"down_votes":0,"body":"Hey there,\n\nYou said selecting smaller resolutions doesn't help? try going down to something normal like 1920x1080.\n\nIf you're on Win10, you'll need to[ disable DPI scaling](https://support.microsoft.com/en-us/kb/2900023) for league _or_ switch your windows resolution to the same (1920x1080).\n\nRemember, League wasn't designed to run at such high resolutions and as such you'll definitely notice some issues at the resolution you're currently using (ie; your cursor problem).","replies":[{"poster":"ohhnoodead","date":"2017-05-22T22:31:56.055+0000","up_votes":2,"down_votes":0,"body":"Nothing changed. It still too little the cursor and it is impossible to play...","replies":[]}]},{"poster":"Yung Leopard","date":"2016-12-23T08:30:30.989+0000","up_votes":5,"down_votes":0,"body":"With 4k monitors really hitting the market i STRONGLY suggest making a feature where we can increase our cursor size. I can't even play on my new monitor because the cursor is too small. Don't tell me this would be difficult, just hire me and I'll do it myself. Peace.","replies":[{"poster":"Quick M4th","date":"2017-07-15T23:21:15.194+0000","up_votes":2,"down_votes":0,"body":"Have they added the feauture yet? Because i really dont want to play with so little curous as well i want to play in 4k.","replies":[{"poster":"XNoboomX","date":"2017-12-05T00:12:27.352+0000","up_votes":3,"down_votes":0,"body":"Nope, just got a 4k monitor, and with how crisp it is I cant go back, but the cursor size is TINY","replies":[]}]}]},{"poster":"22timon22","date":"2018-01-17T03:35:50.755+0000","up_votes":1,"down_votes":0,"body":"There is a temporary fix for this however it is kinda annoying to do...go to your resolution settings  in windows you can find scaling option in there set it for 150% and you will get cursor around the same size as on 1080p I was struggling with this for months being forced to cut down the resolution of game to 1080p which completely broke my mouse sensitivity and couple other things don't even make me start about visual side of it but if you use windows scaling feature you can get at least cursor size corrected this wayˇ.\n\nor solution number 2 if you don't mind your cursor replaced by different one use this tool it is incredibly handy I am using it atm\nhttp://pandateemo.github.io/YoloMouse/","replies":[]},{"poster":"Quick M4th","date":"2017-12-28T23:59:08.005+0000","up_votes":1,"down_votes":0,"body":"Yeh had that problem for a year now. I just switched it to a lower resulotion, but trying to fix it now. This only applies to league. Apriciate it if somone found a soultion for it.","replies":[]},{"poster":"florahime","date":"2017-11-16T10:40:09.734+0000","up_votes":1,"down_votes":0,"body":"I had same problem. You go to settings and click reset to \"default settings\" and then afterwards it worked for me.","replies":[]},{"poster":"SalkinD","date":"2017-07-20T14:26:04.288+0000","up_votes":1,"down_votes":0,"body":"same problem, anyone found a solution?","replies":[]},{"poster":"Myrzart","date":"2017-05-04T03:09:08.190+0000","up_votes":1,"down_votes":0,"body":"I have the exact same problem, did you resolve it? I need some tips...","replies":[{"poster":"Glorfindelas","date":"2017-05-05T22:53:11.566+0000","up_votes":1,"down_votes":0,"body":"Yes, see me answer above. I tried a couple of different things and it seemed to have fixed my issues. \n\nGood luck!","replies":[]}]},{"poster":"Glorfindelas","date":"2017-05-05T22:52:29.848+0000","up_votes":1,"down_votes":0,"body":"I ran across this problem the moment I upgraded to 7.9. I tried everything from submitting a bug, contacting support...and well, no answer from them still but forums helped me solve the issue. \n\nBasically my in game screen went crazy and game loaded to only one quadrant of my monitor and then the post game screen with stats disappeared from my screen. \nIn game, the mouse cursor was ridiculously small as well as the mini map and chat despite them being at 100%. Victory / Defeat animations banners after destroying a nexus were also really small.  \n\nI was lucky enough to play a game and well you can imagine playing Orianna and barely being able to see your mouse HAHA. \n\nAnyway I tried several things: \n\n1)  I went into my Macs system control and played with the resolution section under Displays. I put it to the smallest one and my screen suddenly appeared in the bottom right corner. So I dragged it to the middle. I had to do it a couple of times too. \n\n2) Regarding the resolution issues, I tried 2 things that seem t have worked: \nA. The solution on the following thread: [https://boards.na.leagueoflegends.com/en/c/bug-report/FLcjus54-clientmac-client-resolution-problem]\nB. I changed my in game resolution to 1440x900 and 1650x1050 both worked for me. \n\nI'm still having small issues here and there like not being able to switch to Safari with my 4 finger swipe like I used to but I'll get to that fix eventually. \n\nHope this helps as it was very frustrating for me. \n\nPeace!","replies":[]},{"poster":"Ýaśsúò","date":"2017-02-23T17:08:44.549+0000","up_votes":1,"down_votes":0,"body":"{{champion:157}}  Nerf  :D ?","replies":[]}]}