{"poster":"WULES","date":"2019-04-14T17:57:09.035+0000","title":"total deletion of game and no longer recommended","subforum":"Player Behavior","up_votes":2,"down_votes":15,"body":"honestly thats it for league for me and my friends the report system is very unfair  u permanently suspended my account beacuse two players on my team choose too feed and it was in chat all my time and money spent behind this game all gone too waste beacuse the ban system doesn't ban justly i used too reccomend this game too alot of people and friends but sadly this game has gooten too big too care about its small customers and as of now ill be deactivating all of my accounts and giving up this game for good and retract all of my praises for this game all my time and effort and money spent was just taken but as usual when games get big the little man whos been there is ignored \r\n\r\ni know noones goona see or do anything about this cause the consumers like us dont matter anymore","replies":[{"poster":"Imperial Pandaa","date":"2019-04-14T18:02:13.089+0000","up_votes":9,"down_votes":0,"body":"I mean, you had to have gone the various punishment tiers before getting permabanned. At the very least it displays you have had consistent enough behavior problems in regards to verbal toxicity \n\nBut hey, you do you. Best of luck in whatever you decide your next adventure is.","replies":[{"poster":"TheXXXorcist","date":"2019-04-14T18:40:15.551+0000","up_votes":1,"down_votes":11,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=bfXkpGYw,comment-id=0000,timestamp=2019-04-14T18:02:13.089+0000)\n>\n> I mean, you had to have gone the various punishment tiers before getting permabanned. At the very least it displays you have had consistent enough behavior problems in regards to verbal toxicity \n> \n> But hey, you do you. Best of luck in whatever you decide your next adventure is.\n\nLol always blame and shame the poster. That's a pattern in these boards, I've noticed. You can get reported for constantly slamming someone for troll builds or just watching you die in team fights. The person who complains gets the report and the one afk farming during team fights gets to keep polluting our games with their behavior. Yet you just condemned this person who posted their story without knowing the full truth. All assumptions. Yes, he has consistently complained and probably resorted to bullying the trolls because the game doesn't give us a way to kick out trolls.\n\nWhat hubris. And that passive aggressive 'good luck' at the end...hah.","replies":[{"poster":"Imperial Pandaa","date":"2019-04-14T19:04:33.620+0000","up_votes":8,"down_votes":0,"body":"I'm not really blaming the poster. I am disagreeing that OP says it doesn't punish \"justly\". The only mistake I might be guilty of is assuming op was permabanned. Whether one agrees or disagrees with the punishing of chat, doesn't change that chat can be punishable.\n\nTroll builds will vary person to person. If the champ can scale with what is being built, I don't consider it a troll build. While others may think Attack Speed Tahm Kench on ARAM is fine, but Atk Sp TK on Summoners Rift is not.\nWhat is \"slamming\" them about their build going to accomplish?\n\nGameplay Toxicity needs to be better at detecting, yes. However, that does not give someone permission to be an ass in chat.\n\nI would encourage OP to share his logs if he feels the punishment is unjust, but he seems set on leaving the game/community. So the only real thing I can do is wish them the best of luck in whatever they choose to do next. Wasn't even passive aggressive, but hey you assumed it was.","replies":[{"poster":"TheXXXorcist","date":"2019-04-14T20:42:10.117+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=bfXkpGYw,comment-id=000000000000,timestamp=2019-04-14T19:04:33.620+0000)\n>\n> I'm not really blaming the poster. I am disagreeing that OP says it doesn't punish \"justly\". The only mistake I might be guilty of is assuming op was permabanned. Whether one agrees or disagrees with the punishing of chat, doesn't change that chat can be punishable.\n> \n> Troll builds will vary person to person. If the champ can scale with what is being built, I don't consider it a troll build. While others may think Attack Speed Tahm Kench on ARAM is fine, but Atk Sp TK on Summoners Rift is not.\n> What is \"slamming\" them about their build going to accomplish?\n> \n> Gameplay Toxicity needs to be better at detecting, yes. However, that does not give someone permission to be an ass in chat.\n> \n> I would encourage OP to share his logs if he feels the punishment is unjust, but he seems set on leaving the game/community. So the only real thing I can do is wish them the best of luck in whatever they choose to do next. Wasn't even passive aggressive, but hey you assumed it was.\n\nI encourage you to not make your first response to someone here on the boards one that is judgmental and condescending. And no, the report system is just about as effective as those miracle weight loss pills. They don't care about what people do in the game about 90% of the time. A friend of mine knows someone who works for Riot and admitted they only care about the first 3 check boxes in the report form. The punishments are, for the majority, just for talking and AFK in base. If you don't talk in the game at all, no pings no chat no nothing, and you run around as a JG all game farming and just make emotes smiling at your team as they die in fights you dont participate in....you will NEVER get banned. That is the system as it currently stands. For someone like that to get a penalty of any kind, would require MOVING MOUNTAINS to get Riot's attention into the matter, and there's really no guarantee they'll do anything if they do bother to look into it....if they do...for what a chat ban that gives you a message every 5-10 minutes??? God why do we even have that MUTE button for if we get get that awesome delayed chat feature that doesn't address the troll's play behavior?\n\nThe system you so lovingly dote over in here as you slam people for hating, is a massive failure.","replies":[{"poster":"Imperial Pandaa","date":"2019-04-14T22:53:29.355+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheXXXorcist,realm=NA,application-id=ZGEFLEUQ,discussion-id=bfXkpGYw,comment-id=0000000000000000,timestamp=2019-04-14T20:42:10.117+0000)\n>\n> I encourage you to not make your first response to someone here on the boards one that is judgmental and condescending. \n\nI mean, that is you opinion if you read it that way. If you truly feel I was condescending, report it.\n\n>A friend of mine knows someone who works for Riot and admitted they only care about the first 3 check boxes in the report form. \n\nI know a guy, who knows this girl, who is the wife of a man, who murdered JFK. They say space is the ocean. \nI can make claims and not supply proof too.\n\n>The punishments are, for the majority, just for talking and AFK in base. If you don't talk in the game at all, no pings no chat no nothing, and you run around as a JG all game farming and just make emotes smiling at your team as they die in fights you dont participate in....you will NEVER get banned. \n\nAnd yet, we still get the occasional person on the boards complaining about a Gameplay Offense Ban. So... Are you saying they are just fakes?  Yes, most punishments will be from a system that can quickly and accurately review things. The IFS scores chats, too high and punishment. Leaverbuster can measure how long someone was afk. Gameplay, however, cannot be checked with an algorithm the same way.\n\n>That is the system as it currently stands. For someone like that to get a penalty of any kind, would require MOVING MOUNTAINS to get Riot's attention into the matter, and there's really no guarantee they'll do anything if they do bother to look into it....if they do...for what a chat ban that gives you a message every 5-10 minutes??? God why do we even have that MUTE button for if we get get that awesome delayed chat feature that doesn't address the troll's play behavior?\n\nGameplay offenses start with a 14 day ban as a warning and a perm second. Why? Because Riot realizes that chat is an easier thing to detect and handle. So they give you more chances, pending zero tolerance.\n\n> \n> The system you so lovingly dote over in here as you slam people for hating, is a massive failure.\n\nHow am I doting exactly? Because I disagree with you? We know the system needs improvements for Gameplay cases; but we also know their isn't a feasible way to quickly and accurately judge those cases.","replies":[{"poster":"TheXXXorcist","date":"2019-04-15T02:46:38.439+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=bfXkpGYw,comment-id=00000000000000000000,timestamp=2019-04-14T22:53:29.355+0000)\n>\n> I mean, that is you opinion if you read it that way. If you truly feel I was condescending, report it.\n> \n> I know a guy, who knows this girl, who is the wife of a man, who murdered JFK. They say space is the ocean. \n> I can make claims and not supply proof too.\n> \n> And yet, we still get the occasional person on the boards complaining about a Gameplay Offense Ban. So... Are you saying they are just fakes?  Yes, most punishments will be from a system that can quickly and accurately review things. The IFS scores chats, too high and punishment. Leaverbuster can measure how long someone was afk. Gameplay, however, cannot be checked with an algorithm the same way.\n> \n> Gameplay offenses start with a 14 day ban as a warning and a perm second. Why? Because Riot realizes that chat is an easier thing to detect and handle. So they give you more chances, pending zero tolerance.\n> \n> How am I doting exactly? Because I disagree with you? We know the system needs improvements for Gameplay cases; but we also know their isn't a feasible way to quickly and accurately judge those cases.\n\nProvide proof that the report system stops trolls from throwing games intentionally whether or not they talk in chat.\n\nSupply the proof. Just like you always say. And btw, I dont provide personal contact information on boards, just to prove a point, especially to disrespectful passive aggressive people like you. :/ But the information is true.","replies":[{"poster":"Imperial Pandaa","date":"2019-04-15T03:32:35.019+0000","up_votes":2,"down_votes":0,"body":"Stop as in preventive? Can't because the evidence they trolled is not completely visible until after a game when evidence is available.\n\nDo you want proof that people have been banned for trolling a a game/inting?\n\nYou don't need to give contact information. They could simply comment on the boards on the Riot account.\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/HNZ62JHh-unfair-bullshit-ban?comment=0002\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/xW5z7auF-proof-that-riot-employees-ban-without-providing-clear-evidencecertainty-of-an-infraction\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/K9cErxEZ-14-day-ban-for-feeding-one-game?comment=0001\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/KTq4tjIF-i-dont-get-it-how-riot-bans-a-player-because-another-kid-draven-decides-to-take-all-the-kills?comment=000300010000\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/EymKjLv3-seriously-riot-i-got-banned-for-feeding-in-nexux-blitz?comment=000200000001\n\n>https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/uUTi4gd2-get-autofilled-get-banned-xd\n\nSome additional ones that were controversial includes Support Singed, Support Nunu, Inting Sion Strat, the No Kill Ascension tank strat, and one that I don't think was addressed; the Support Ezreal case.","replies":[]}]}]}]}]}]}]},{"poster":"KFCeytron","date":"2019-04-14T21:18:14.143+0000","up_votes":1,"down_votes":0,"body":"No, you were permanently suspended because of your own very poor behavior, which isn't excused by \"but he started it.\"\n\nRiot cares about \"small customers\" by making sure they don't have to deal with the very worst toxic players.\n\nThe whole point of banning you is that you no longer play the game, so this announcement that you're not going to play is a statement not of defiance but of compliance. Thank you for leaving.","replies":[]}]}