{"poster":"BrechtoldBert","date":"2017-11-02T18:52:31.173+0000","title":"Remake","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Gr&uuml;&szlig;t euch, gerade ein Ranked gespielt und ab lvl 3 ist der Support afk gegangen und kein Remake war mehr m&ouml;gloch. Nun meine Frage, w&auml;re es nicht sinnvoll das Remake zeitlich unabh&auml;ngig zu machen? Es ist doch egal ob jemand ab lvl1 oder erst nach 15 Minuten ingame afk geht, und dass man das Spiel trotzdem noch gewinnen kann ist mir klar, jedoch sollten 4 Leute nicht mit unn&ouml;tigem Zeitverschwenden und Punkteverlust bestraft werden, egal ob der afk mutwillig oder versehentlich passiert.\r\nFalls es hierf&uuml;r schon was gibt, verzeiht.","replies":[{"poster":"RevolutionLight","date":"2017-11-03T16:58:28.085+0000","up_votes":1,"down_votes":0,"body":"Stell dir vor du bist im schon 10 min im Game und bist total fed. Und aufeinmal geht 1 Afk und das Spiel ist zuende, würde ziemlich nerven oder?","replies":[]},{"poster":"Awsane","date":"2017-11-03T13:59:57.912+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist, man kann den Gegner dadurch für gute Leistung bestrafen.\n\nMal als Beispiel. Ich hasse Yasuo Spieler. Ich halte den Champ für OP und jedes mal wenn ein Yasuo gegen mich gewinnt gönne ich ihn den Sieg nicht und gehe AFK, weil ich weiß, es kommt ein Remake und er bekommt den Sieg nicht.\n\nEs ist total unabhängig wie groß die Strafe für das leaven ist, solange so etwas möglich ist wäre es mega unfair für den Gewinner. Du musst ja bedenken, das durchaus Leute AFK gehen, weil sie besiegt werden in der lane. Dafür sollte niemals ein Gegner bestraft werden(durch entziehen des Sieges).","replies":[]},{"poster":"Martensitic","date":"2017-11-03T11:16:22.316+0000","up_votes":1,"down_votes":0,"body":">Nun meine Frage, wäre es nicht sinnvoll das Remake zeitlich unabhängig zu machen?\n\nNein, waere es nicht.\n\nErstens mal waere es dem Gegnerteam gegenueber auesserst unfair, sich 15 Minuten anzustrengen, und dann war die Muehe umsonst nur weil so ein Honk AFK geht.\n\nZweitens wuerde es Missbrauch Tuer und Tor oeffnen. Game geht schlecht? \"Operaccount\" geht afk -> Remake.","replies":[]},{"poster":"h7d21jfrhj9","date":"2017-11-02T19:02:57.737+0000","up_votes":1,"down_votes":0,"body":"Das ist totaler Unsinn. Stell dir vor du spielst ein Ranked und bist nach Minute 15 schon in der Gegnerbase. Einer geht AFK und das Game wird n Remake und keiner bekommt irgendwas.","replies":[]},{"poster":"I hob nid gwixt","date":"2017-11-02T19:02:43.647+0000","up_votes":1,"down_votes":0,"body":"Wenn jeder Fair sein würde, dann wäre das bestimmt eine Möglichkeit. Allerdings ist es leider so, dass selbst die kleinste Nische, die einem irgendwie einen Vorteil verschaffen könnte, abused wird.\nKurz gesagt würde die Möglichkeit nach 15 Minuten ein Remake starten zu können (Also in einer Zeit, in der schon besser absehbar ist, ob man gewinnt oder nicht) dazu führen, dass bei einem drohenden lose einfach einer der Spieler den Lose trägt indem er afk geht, die anderen allerdings keinerlei Punkteverluste erfahren.","replies":[{"poster":"BrechtoldBert","date":"2017-11-02T19:28:47.315+0000","up_votes":1,"down_votes":1,"body":"Hast du wohl recht, das Beispiel ist auch etwas zu grob gefasst, ich denke jedoch das diese Art der Manipulation leicht anhand von Gold/Obj Lead und Killverhältniss erkannt werden könnte. Die Idee ist mit Sicherheit nicht ausgereift, aber ich bin mir sicher Riot hätte die Möglichkeit das Remake Tool etwas anders zu gestalten.","replies":[]}]}]}