{"poster":"FinchLife","date":"2017-11-07T13:49:39.964+0000","title":"Keine IP bekommen","subforum":"Hilfe & Support","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/3407711701/236750920?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"Siehe Link. Das Game ist von gestern und ich dachte vielleicht wird das noch berechnet. Habe immer wieder Games wo keine IP erscheint. Warum ist das so? Ist das normal?","replies":[{"poster":"Gin","date":"2017-11-07T14:08:32.320+0000","up_votes":2,"down_votes":0,"body":"Schau mal im Client in deinem Spielverlauf, dort solltest du beim jeweiligen Game sehen können wie viel EP du kriegen solltest.\n\nDie EP die du besitzt aktualisieren sich nicht immer sofort, und das jeweilige Game solltest du auch in deinem Spielverlauf auch erst nach ca. 15 Minuten sehen können.\n\nWenn du dir 100% sicher bist dass dir EP fehlen, notiere dir deine aktuelle EP, spiele paar Games, schau am nächsten Tag in deinem Spielverlauf wie viel EP du hättest für die Spiele kriegen sollen, und prüfe ob das mit deiner EP übereinstimmt.\n\nSollte dir aus irgendeinem Grund EP fehlen, und du hast dich nicht verrechnet, kannst du dich nochmal melden.","replies":[{"poster":"FinchLife","date":"2017-11-07T14:40:23.601+0000","up_votes":1,"down_votes":0,"body":"Das Game ist wie gesagt von gestern. Auch ingame steht nichts.","replies":[{"poster":"Gin","date":"2017-11-08T07:32:25.009+0000","up_votes":1,"down_votes":0,"body":"Da du ab heute, mit dem neuem Patch durch den das neue LevelUp-System und die Preseason live gehen, keine EP mehr nach jedem Game bekommst, hat sich das Problem damit mehr oder weniger gelöst.\n\n\nSolltest du allerdings bei einem LevelUp deine Kiste nicht kriegen sollen aus der du Blaue Essenz* und mit einer gewissen Wahrscheinlichkeiten Champion Shards erhälst, melde dich nochmal.\n\n{{sticker:sg-poppy}} \n\n\n*die einheitliche Währung die die vorherige blaue Essenz und EP ersetzt.","replies":[]}]}]}]}