{"poster":"GiltTrace","date":"2017-10-19T07:47:11.529+0000","title":"Hotkeys","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Someone asked, it's time to show you the best Settings and Hotkeys in League of Legends. I'm a Masters League of Legends veteran and these are my Hotkeys and Settings. ►I DO STREAM: https://www.youtube.com/KingStix/live ►I DO COACHING!","url":"https://www.youtube.com/watch?v=uPSI72IMMv8&t=564s","image":"https://i.ytimg.com/vi/uPSI72IMMv8/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"(I've been playing league for two years and ever since the ping cool downs update has come out this hasn't happened.) This just started a few days ago, i was looking to change some hotkeys and found this video. I didn't copy all of the settings just a few. I changed my mouse click attack to space and s for kiting and a few others. \r\n\r\n1) For some reason, whenever i hold down alt, hover over an ability such as q-w-e-r and click, it doesn't ping the cool down of it, it doesn't do anything actually. \r\n\r\n2) Whenever i hold shift and q-w-e-r, it is set to indicator quick cast. Whenever i hold down the indicator quick cast, when i right click it won't cancel the indicator or do anything, I will be forced to use the ability so i can move/do something else. \r\n\r\nThese things used to never happen and i don't know what went wrong. I restored the hotkeys and before setting them back to my custom hotkeys, i tried pinging cool downs in practice tool and a custom game and it wouldn't work. I also tried canceling an indicator in practice tool/custom game and no luck. Note that i have tried this on two computers and both seem to not be able to ping cool downs on my account but works on others\r\n\r\nAny idea on what to do? It is really getting in the way of my game play and i have no clue how to fix it?","replies":[{"poster":"Porocles","date":"2017-10-19T16:33:03.372+0000","up_votes":1,"down_votes":0,"body":"Your settings might have become corrupt, so they're not saving or being used properly when syncing to our servers.  Try a config reset to see if that helps:\n\nLog into the game client.\nNavigate to C:\\Riot Games\\League of Legends\\Config\nDelete the file  named **game.cfg** and **persistedsettings.json**\nGo into a custom game and verify that settings have saved properly.  Leave game to sync settings.","replies":[]}]}