{"poster":"MeetalAngel","date":"2017-01-11T16:42:08.039+0000","title":"Jagura, a mocsár védelmezője","subforum":"Rajongói alkotások","up_votes":2,"down_votes":1,"body":"http://magenevelde.gportal.hu/portal/magenevelde/upload/767926_1484077901_00202.jpg\n\n**Jagura, a mocsár védelmezője\nTörténet**\n\nJagura egy mocsárban lakik kis barátjával Pakuval. A mocsár védelmezője akkor született amikor egy varázslólány, Lulu, a mocsárban járva átváltoztatta őt. Erőt adott neki, hogy megvédhesse a mocsarát az emberi kezektől. Jagura kezdetben nem nagyon tudta kontrollálni erejét, így felkeresett egy híres szerzetes ki szintén ilyen problémákkal küzdött a múltban. Lee Sin próbatételek elé állította a mocsári lényt, ki mindenben remekelt, így méltó lett a tanításra. Több év tanulás után elbúcsúzott, majd kifejlesztett képességeivel a mocsárt pusztító emberek ellen szegült. Az akkor már nem gyenge Jagura könnyen eládta a bajukat, így a mocsarát megtarthatta, de sosem tudhatja mikor térnek vissza újabb zavargok.\n\n\" Az én mocsaram számodra tilos! \"\n-Jagura\n\n**Kinézet Leírása**\n\nEgy béka szerű lény akinek a teste kékes zöld. Ruházatának a szélei pirosak, maga a ruházat pedig fehér - vagy esetleg fekete és a mély kék keveréke. Szemei világos kékek csak mint a képen. Pakura hasonló hozzá, de én őt inkább zöldnek, és kicsit eltérőbbnek gondoltam el, mint a képen.\n\n**Arányok**\nTámadóerő: 3/10\nVédekezőerő: 3/10\nVarázserő: 8/10\nNehézségi fok: 5/10\n\n**Statok**\nÉleterő: ~ 570 (+82/ szint)\nSebzés: ~ 46 (+3/szint)\nMana: 570 (+70/ szint)\nMozgási Sebesség: ~ 358\nTámadási sebesség: ~ 0.670 (+3% szintenként)\nPáncél: ~ 30 (+3/ szint)\nVarázs ellenállás: ~ 32 (+1/ szint)\nÉleterő regeneráció: ~ 7,57 (+0,8/ szint)\n\n**Jellemzők**\nTípusa: Harcos, mágus\nIdeális terület: Dzsungel, Top\n\n**Képességek**\n\nVáltoztatását fent tartom.\n\n**Alap támadás**\nA fából készült botjával harcol.\n\n**[Passzív] Pakura**\n\nAmikor Jagura életereje 25% alá kerül aktiválódik az álcázás, ami alatt semmi sem fedi fel 5 másodpercig. Ez idő alatt Pakura a kis segédje veszi át a helyét, akit ha megölnek egy őrszemé alakul át.\n\nTöltési idő: 150\n\n**[Q] A mocsári stílus**\n\nJagura varázserővel ruházza fel a botját amivel minden támadás esetén 20/30/45/55/70 (+35% varázserő) varázssebzést okoz.\nPasszív: Jagura támadási sebessége 10/15/20/25/30%-kal nagyobb.\n\nÁra: 30/40/50/60/80 mana\nTöltési idő: 15/10/8/6/5\n\n**[W] A szentjánosbogár stílus**\n\nJagura ezt a képességet aktiválva a következő támadása 25/60/95/130/165 (+100% sebzés) bónusz sebzést okoz.\nPasszív: Jagura minden ötödik támadással nyer egy szentjánosbogárt akit az üvegébe gyűjt. Minden tíz szentjánosbogár után 75/125/175/225/275 (+100% varázserő) bónusz varázssebzést okoz.\n\nÁra: 50/60/80/90 mana\nTöltési idő: 15/12/10/8/6\n\n**[E] A leveli béka stílus**\n\nJagura a képesség aktiválásával kettőt hátrafelé szökken.\n\nÁra: 45 mana\nTöltési idő: 20/16/14/12/10\n\n**[R] A védelmező stílus**\n\nJagura végső képessége a védelmezés. A képesség aktiválásával Jagura magához hívja Pakurát aki bónusz (25%/30%/35%) életerőt ad, majd Pakura széthullik szentjánosbogarakká akik Jagura köré rendeződve egy áthatolhatatlan pajzsot alkotnak, ami 3/4/5 másodpercig aktív. A pajzson semmilyen csapás nem hatol át.\n\nÁra: 100/120/150 mana\nTöltési idő: 150/100/85\n\n**Előny**\n- Jagura egy nagyon jó védekező harcos. Így könnyen tudja elhárítani a varázslók képességeit.\n- Jagura roppant kevés sebzést szenved el a dzsungel szörnyei ellen.\n- Jagura végső képessége a nagy szörnyek ellen előnyt jelent.\n\n**Ellenfélként**\n- Jagura a játék elején a legkönnyebb célpont.\n- Jagura könnyen legyengíthető ha már elhasználta a végső képességét.\n- Jagura ellen a legjobb a lövész hősök.\n\nByMeetalAngel\n","replies":[{"poster":"ptlg225","date":"2017-01-12T12:03:10.445+0000","up_votes":2,"down_votes":0,"body":"Tényleg megfogott a hős és csak úgy zakatol rajta az agyam.\n\nA történetet meglehetne csavarni azzal, hogy a varázslólányt kicseréled a Tündérboszorkány {{champion:117}}  Lulu-ra aki csak pusztán szeszélyből adta ezt az alakot az aranyos és barátságos levelibékának, mert neki van ehhez hasonló képessége .\nPaku lehetne a mocsár szelleme(tündére) aki összebarátkozik Pix-el és miután megszületik Jagura és Lulu-ék tovább állnak ő vigyáz rá tovább.\n\nA történet összetettebb lenne mondjuk, ha kezdőként először a mocsárban meditáló Master Yi-re támadna rá mert azt hiszi ő is az otthonát fenyegeti. Persze Yi könnyen ellene fordítja a tapasztalatlanságát és legyőzi, ezután megvitatják a dolgot és kibékülnek a fura szerzettel.\nYi-t saját magára emlékeztetné, hogy nem tudta megvédeni saját népét és érdemesnek találja rá, hogy megtanítsa neki a Wuju stílust mert úgy is azért indult zarándok útra hogy tovább adja népe tanításait az egész világnak.\nSokáig tanította a Wuju rejtelmeire és a harcművészetére, de Jagurának nem volt meg az a lelki és testi nyugalma ami a Wuju eléréséhez kell, miután mindent megtanított amit csak tudott Yi úgy vélte a többi már csak rajta múlik és folytatta zarándoklatát.\n\nMiután nem érte el a Wuju stílust elmegy egy másik nagymesterhez Lee Sin-hez, hogy ő tanítsa meg hozzá a megfelelő önkontrollt és fegyelmet, a világtalan szerzetes több éves tanítása végül felnyitotta a szemét, hogy ő sosem lehet a Wuju igazi mestere. Eldöntötte hogy nem Master Yi útját akarja tovább járni, hanem a sajátját és saját harc stílust és technikákat fejlesztett ki. (Mondjuk a W és E képességnek lehetne Technika a neve.)\n\nRemélem tetszik ez a kis tovább gondolás és tényleg nagyon várom a hős kisebb változásait is, csak így tovább. :-)","replies":[{"poster":"MeetalAngel","date":"2017-01-12T17:03:11.037+0000","up_votes":2,"down_votes":0,"body":"Nagyon jó kis továbbgondolásod van. Látom átláttál a történeten. Köszönöm, hogy kommenteltél. A történet kiegészítését ezek által megfogom majd változtatni.","replies":[]}]},{"poster":"ptlg225","date":"2017-01-11T21:49:13.330+0000","up_votes":2,"down_votes":0,"body":"Nekem eléggé tetszik csak néhány hiba van a szövegben: \"eláldta\", Egy \"béke\" szerű lény. \nNem akarok belekötni a hősbe csak érdekel pár dolog. :-)\n\nA passzív gondolom egy LB szerű klón csere volna csak mert első olvasásra azt hittem kisállat formában támadja meg az ellenfelet, tud egyáltalán sebzést okozni vagy csak egy megtévesztés?\n\nAz E egy kicsit szegénynek tűnik számomra, nem támad + semmi sebesség növekedés vagy valami kis buff a meneküléshez, mert ez menekülő képességnek néz ki.\nHa meg csak hátrafelé ugrik akkor az egy csapatharc közepén elég nehéz, hogy akkor most merre felé is ugrik vagy menekülés közben megállni szembefordulni az ellenféllel csak azért a kis ugrásért elég rizikósnak hangzik. Érdekel, áttud ugrani a fal felett?\n\nAz R ulti meg szimplán túl op \"bónusz (25%/30%/35%) életerőt ad\" egy toposnak 3000+ hp is könnyen összejön 3 itemből ekkora erősítéssel még +1000 hp-t is kaphat ami elég op, bár Renekton és Nasus is kb elég sokat kap. Vagyis ezzel nagyon nem lenne gond ha a hős nem annyira mobilis, hogy az egész pályán kövessen (alap 358), az igazi probléma a második fele.\n\nA másik része meg már tényleg csalás  \"egy áthatolhatatlan pajzsot alkotnak, ami 6/8/10 másodpercig aktív. A pajzson semmilyen csapás nem hatol át.\", vagyis az egész csapatod belelőtt mindent 6 másodpercen át és semmi -> \"balanced\".\nNem tudom, hogy ez most az alaptámadásokra vagy a képességekre vonatkozik mert ha mindkettőre akkor instant win.\nTaric-nak van ilyen képessége de csak 2,5 másodpercre, meg Shen-nek de csak alaptámadások ellen és 1,75 másodpercre.\nHa meg úgy gondoltad, hogy csak képességek ellen vagy csak alaptámadások ellen akkor is túl sokáig tart, 6 másodperc alatt az egész meccset megnyerheted vele.  \n\nAhogy látom harcos, mágus karakter akar lenni csak egyetlen távolsági képessége sincs, pedig nem látsz egyetlen olyan mágust sem aki csak közelre tudna támadni ez inkább tank a végső képességével. Nem tudom a W lehetne egy rövidebb skill-shot (el lehet hibázni) szentjánosbogarakkal támad rá, így inkább hasznosabb és mágusosabb volna.\n\nElég jó munka csak egy kis csiszolásra szorul még. :-)\nSzép volt!\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"MeetalAngel","date":"2017-01-12T17:11:38.237+0000","up_votes":1,"down_votes":0,"body":":) Huha hát van min javítani. \n\nA passzív kb olyan, mint LB-nek ,de úgy gondoltam el, hogy ha eléri azt a HP-t akkor átalakul és már kezdhetsz is menekülni vele, amíg Pakura átveszi a helyét. De jobban ki kell fejtenem hogy mit is tud. Szóval ezt átírom.\n\nAz E-t is átírom, hogy érthetőbb legyen: Szóval az e-t használva az éppen meglévő helyzetét tekintve hátra szökken. Szóval ez azt jelenti, hogy egy team fightba hogy eltudj jól szökni szembe kell állnod az ellenséggel. Ehhez meg azért kell egy kis ügyesség.\n\nAz R-t nagyon op igazad van csökkentem a képesség idejét, de azt, hogy mindent kivéd nem. Ez egy nagyon op képesség tudom, de őt így képzeltem el :D\n\nIgen mágust, mert megvédi magát a varázslattal, de a tankkal is igazad van.... Hát :D nem is tudom átírjam-e.\n\nKöszönöm hogy írtál ^- ^ {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Kumako","date":"2017-01-12T12:29:52.296+0000","up_votes":2,"down_votes":1,"body":"Véletlenül nem Sigil akar lenni kicsit átírva?\nhttp://sigil.lol/meet-the-champion.html","replies":[{"poster":"MeetalAngel","date":"2017-01-12T17:00:30.811+0000","up_votes":1,"down_votes":0,"body":": ) Csak a képet szedtem el valahonnan nem tudtam, hogy van ilyen oldala de nagyon jól néz ki *-*","replies":[{"poster":"Kumako","date":"2017-01-12T19:19:20.134+0000","up_votes":1,"down_votes":0,"body":"Amúgy tényleg jól megcsinálták.","replies":[]}]}]}]}