{"poster":"Albaa","date":"2018-05-14T10:40:13.743+0000","title":"Porque Aurelion Sol tiene tanto winrate?","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Vi en op gg que tiene 53% de winrate, que se supone que destaque ese champ actualmente? Yo lo estoy empezando a usar por eso pregunto. Carrilea fuerte el drag&oacute;n? ;v","replies":[{"poster":"Professor Farn","date":"2018-05-14T11:02:29.077+0000","up_votes":4,"down_votes":0,"body":"Es algo que suele pasar con los campeones menos populares. Principalmente solo lo juegan en clasificatoria los jugadores que les ha dedicado muchas partidas y saben manejarlo muy bien, por lo que ganan con más frecuencia que gente que va cambiando de campeón o que en vez de dedicar 100 partidas al mismo dedican 20 partidas a cinco campeones distintos.\n\nEn este caso no tiene por qué ser representativo de que un campeón esté demasiado OP :)\n\nPero Aurelion Sol es fantástico y te animo a que sigas aprendiéndolo; es uno de esos campeones que te recompensan mucho por el tiempo que les dedicas.\n\nY en las manos correctas es una bestia, pero shhhhhh!  ;)\n\nPS También me ganaron con la respuesta pero yo no me di cuenta jaja +1","replies":[{"poster":"Dog Bulling","date":"2018-05-14T18:24:27.667+0000","up_votes":1,"down_votes":1,"body":"Y tambien podría deberse a buffs indirectos, como al {{item:3116}} , {{item:3151}} (Aurelion tiene batallas largas casi siempre), {{item:2065}} (La principal razón de porque Vladimir es tan popular y efectivo últimamente), y {{item:3165}} (Es mucho más eficiente con el dragón ahora), que pudieron incluso compensar los cambios al GLP.","replies":[]}]},{"poster":"DIOS TUTI","date":"2018-05-14T10:59:05.786+0000","up_votes":5,"down_votes":1,"body":"no es un champ que la gente lo vaya a probar a ranked o a rankearlo con 50k de puntos de maestria, es simple.\n\nsi todos los champs que pickean en ranked, son de gente OTP, los winrates subirian muchisimo.","replies":[{"poster":"rokushoger","date":"2018-05-14T11:00:02.471+0000","up_votes":2,"down_votes":0,"body":"Me ganaste de mano con la respuesta! +1","replies":[]}]},{"poster":"Defg45333","date":"2018-05-14T12:33:04.157+0000","up_votes":2,"down_votes":1,"body":"El único problema que tiene el dragón es falta de dmg en early, pero lo compensa muy bien con un stun gigante en área, la capacidad de roamear en 1 seg, y por supuesto con una cantidad exagerada de dps para las teamfights en mid-late game.\nYo lo juego con relativa frecuencia y siempre soy top dmg (aunque no suelo fedearme en línea, porque es difícil ganar un 1vs1 con ese champ).\n\nPero sí, la respuesta corta a las preguntas, serían: No está OP, tiene carencias como la falta de burst, y sí, bien usado, carrilea fuerte.\nUn saludo.","replies":[]},{"poster":"Puynsi","date":"2018-05-14T14:22:09.625+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo que pasaba con malza y morde antes de que Certainly%%%%% lo reworkeara en lo que son ahora, eran champs que muy poca gente los jugaban y los sabian jugar muy bien asi que por eso tienen winrate alto.\n\n_Editado por moderación_","replies":[{"poster":"Rockett6","date":"2018-05-14T15:08:46.796+0000","up_votes":1,"down_votes":2,"body":"Ese Certainly es el creador del %%%%%% en  LoL.\n Hiso estas cosas:{{champion:142}} {{champion:157}} {{champion:238}} y otras cosas asquerosas >:P\n\n_Editado por moderación_","replies":[{"poster":"ImNw","date":"2018-05-14T17:36:19.971+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}} {{champion:429}}  y {{champion:122}} (personalmente no lo odio tanto como la gente este ultimo) tambien son sus champs.\nAun asi tambien hizo el rework de WW x ejemplo, Grave,Cait y Morda, aunque los unicos 3 que fueron aceptables obviamente son WW Graves y Cait.","replies":[]}]}]},{"poster":"Rockett6","date":"2018-05-14T15:06:36.195+0000","up_votes":1,"down_votes":0,"body":"En OPGG creo que es el win rate en todo el mundo y lo que manejan el meta mas o menos son los challenguers y esos dioses.","replies":[]},{"poster":"xM4XIx","date":"2018-05-14T17:42:59.994+0000","up_votes":1,"down_votes":1,"body":"Recomiendo que lo pruebes de supp si querés, por su stun gigante con la Q y la posibilidad de viajar volando a una buena velocidad por el mapa. Eso si, no robes el farm. Y las kills...solo cuando veas que tu tirador está en problemas. Si vas a otra línea, hacé lo tuyo 👹\nYo soy M7 con él.","replies":[]},{"poster":"Mioen","date":"2018-05-14T15:34:53.662+0000","up_votes":1,"down_votes":1,"body":"Tengo entendido que es por la mecanica del mismo personaje.\n\nEn Divisiónes bajas es dificil sacarle probecho, sin embargo en ligas mas altas se suele abusar del campeón cuando esta fuerte. Mas que nada por que es un Safe pick de bastante ostigamiento.\nAdemas de lo que lo usan en estas ligas ya tienen un buen conocimiento del campeón y del potencial que tiene.","replies":[]},{"poster":"TuqueroARG","date":"2018-05-14T13:18:12.276+0000","up_votes":1,"down_votes":9,"body":"Porque esa pagina no sirve, por eso tiene tanto win rate, mañana es posible que te aparezca teemo full ad en el top de win rate","replies":[{"poster":"Excorpion","date":"2018-05-14T14:02:12.010+0000","up_votes":3,"down_votes":0,"body":"Se analizan partidas rankeds de ciertos elos... no es de todos lados. Nadie iria a ranked con aurelio si no lo supiera usar al 100. Pero si van con yasuo que es free elo.","replies":[]}]}]}