{"poster":"Dyconei","date":"2016-07-26T08:08:08.649+0000","title":"Buff e Nerf Inutili","subforum":"Discussioni generali","up_votes":2,"down_votes":6,"body":"Iniziamo dal fatto che gran parte di queste informazioni le devo a terenas che commenta soggettivamente ogni patch. Arriviamo subito al punto. Secondo me non sapete piu che pesce pigliare. Per esempio karma che dopo l`ultimo nerf sia del champion stesso che dei due items fordamentali che lo rendevano diciamo un po` op. Per Nidalee si vede che non sapete come renderla meno op infatti la buffate e nerfate qualcosa quasi ogni patch. Passiamo a renekton un champ secondo il mio parere abbastanza valido pero bloccato dal suo lunghissimo coldown infatti non capisco il motivo di buffargli la ultimate e passare sopra il coldown del resto delle spell che praticamente dopo aver fatto la combo devi aspettare 20 sec per poterla rifare che secondo me e abbastanza eccessivo portando il champ molto utile nel late game anche se soltitamente nel late game si gioca in teamfigth rendendolo praticamente efficacie solo negli 1 vs 1. Grazie di avermi ascoltato e vi consiglio di guardare le patch notes di terenas che secondo me sono veramente valide, attendibili e chiare.","replies":[{"poster":"BeardSergio","date":"2016-07-26T09:20:55.501+0000","up_votes":5,"down_votes":0,"body":"Piuttosto che seguire le patch notes di Terenas mi faccio bannare a vita per flame.\nDetto questo Nidalee è un champ che se lo nerfi un poco fa schifo se lo buffi un poco è op (altri champion hanno lo stesso difetto), quindi credo sia ,ahimè, normale che facciano buff/nerf.\nPer le altre cose ti hanno già smentito quindi apppposto","replies":[{"poster":"vondarck","date":"2016-07-26T10:35:44.023+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeardSergio,realm=EUW,application-id=MJVj50Jw,discussion-id=cAEegZfQ,comment-id=0003,timestamp=2016-07-26T09:20:55.501+0000)\n>\n> Piuttosto che seguire le patch notes di Terenas mi faccio bannare a vita per flame.\n> Detto questo Nidalee è un champ che se lo nerfi un poco fa schifo se lo buffi un poco è op (altri champion hanno lo stesso difetto), quindi credo sia ,ahimè, normale che facciano buff/nerf.\n> Per le altre cose ti hanno già smentito quindi apppposto\n\nsono un po preoccupato per il buff che hanno dato a {{champion:102}} \nanche li dimostrano che non sanno che pesci prendere e anche lei da \"zero to hero\" è un attimo (ho il livello 5 con lei)","replies":[]}]},{"poster":"EmptyHole","date":"2016-07-26T09:59:59.851+0000","up_votes":2,"down_votes":0,"body":"MA questi ragionamenti li hai fatti di testa tua o è il ragionamento di qualcun altro? \nPer sapere..","replies":[]},{"poster":"l  Ferox  l","date":"2016-07-26T09:50:47.886+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dyconei,realm=EUW,application-id=MJVj50Jw,discussion-id=cAEegZfQ,comment-id=,timestamp=2016-07-26T08:08:08.649+0000)\n>\n> Iniziamo dal fatto che gran parte di queste informazioni le devo a terenas che commenta soggettivamente ogni patch. Arriviamo subito al punto. Secondo me non sapete piu che pesce pigliare. Per esempio karma che dopo l`ultimo nerf sia del champion stesso che dei due items fordamentali che lo rendevano diciamo un po` op. Per Nidalee si vede che non sapete come renderla meno op infatti la buffate e nerfate qualcosa quasi ogni patch. Passiamo a renekton un champ secondo il mio parere abbastanza valido pero bloccato dal suo lunghissimo coldown infatti non capisco il motivo di buffargli la ultimate e passare sopra il coldown del resto delle spell che praticamente dopo aver fatto la combo devi aspettare 20 sec per poterla rifare che secondo me e abbastanza eccessivo portando il champ molto utile nel late game anche se soltitamente nel late game si gioca in teamfigth rendendolo praticamente efficacie solo negli 1 vs 1. Grazie di avermi ascoltato e vi consiglio di guardare le patch notes di terenas che secondo me sono veramente valide, attendibili e chiare.\n\nTutto ciò preso pari pari da terenas, riportato dal branzino di turno .. tutto molto bello. Manca \"questo gioco sta morendo\" e la zuppa è pronta.","replies":[]},{"poster":"Floppyz","date":"2016-07-26T08:16:12.394+0000","up_votes":2,"down_votes":0,"body":"Ma questo fa più danni della grandine... (non mi riferisco a Dyconei).","replies":[]},{"poster":"Liorenato","date":"2016-07-26T13:22:24.402+0000","up_votes":2,"down_votes":1,"body":"\"parte di queste informazioni le devo a terenas che commenta **soggettivamente** ogni patch\"\nOra riguardale in maniera oggettiva e pensa a qualcos'altro da scrivere.","replies":[]},{"poster":"Sorcio84","date":"2016-07-26T16:41:15.742+0000","up_votes":1,"down_votes":0,"body":"La prossima volta leggiti la patch note da solo; poi fai un salto su probuilds, e su siti come lolking che mostrano il win rate dei champ.\n\nQuando mi nerfarono il lupo, il win rate era vicino al 60% per un gameplay super ignorante.","replies":[]},{"poster":"Darth Ponzius","date":"2016-07-26T10:59:33.015+0000","up_votes":1,"down_votes":0,"body":"Non ho capito quale sia il problema del nerf a Karma francamente, ha molto senso e il \"nerf\" ai due item non era mirato solo a lei visto che janna, soraka e sona ci lucravano sopra in modo osceno. Per renekton non ha il minimo senso quello che hai detto. è già un champ molto dominante in lane, se gli permetti di avere cd minori (che son già abbastanza bassi) te lo ritroverai a snowballare la top lane in maniera oscena e non so se sei passato nel meta dove Renekton era sovrano e padrone della top lane... Avere un rage di 20 appena si ulta ti permette di avere finestre di tempo maggiori nel quale andare aggressivo, avere prima una tacca di rage significa accedere prima alla sua principale fonte di danno. Prova ad usare più il tuo cervello invece di fare la pecorella dietro i video di altra gente.","replies":[]},{"poster":"OneCristo","date":"2016-07-26T08:43:22.618+0000","up_votes":1,"down_votes":1,"body":"Povero coccodrillo..... in un gioco dove oramai ci sono champion con dash ogni 3 secondi ( yasuo, fiora etc..) lui si ritrova ingiustamente indietro ( 18 secondi sulla E.... e vbb). Almeno lui non è stato totalemte dimenticato tipo Wukong ( apparte qualche bugfix, non viene toccato dalla season 4, e si ritrova ad essere outdated come champ sia in top che in giungla), galio, aatrox, urgot. Better rework ryze, e vbb","replies":[{"poster":"vondarck","date":"2016-07-26T10:32:57.122+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OneCristo,realm=EUW,application-id=MJVj50Jw,discussion-id=cAEegZfQ,comment-id=0002,timestamp=2016-07-26T08:43:22.618+0000)\n>\n> Povero coccodrillo..... in un gioco dove oramai ci sono champion con dash ogni 3 secondi ( yasuo, fiora etc..) lui si ritrova ingiustamente indietro ( 18 secondi sulla E.... e vbb). Almeno lui non è stato totalemte dimenticato tipo Wukong ( apparte qualche bugfix, non viene toccato dalla season 4, e si ritrova ad essere outdated come champ sia in top che in giungla), galio, aatrox, urgot. Better rework ryze, e vbb\n\nTI PREGO LASCIATEMI STARE LA SCIMMIA\n\nè un ottimo champ ed è pure divertente da giocare e incisivo in tutte le fasi della partita XD\n\nche poi fanno come irelia:\npiccolo buff, perchè è 2 anni che non la tocchiamo, poi rimettiamo a mano il trinity, mmm.. forse con un alto pick rate e un alto W rate a tutti gli elo bisogna nerfarla.... e nerfarla di nuovo..\n\nsi, anche io però spezzo una lancia nei confronti di renekton, la E da 18 a 14 a livello 1 non sarebbe male\n\nnon avrei nerfato la Mspeed allo scudo di karma... il resto poco da dire, anche perchè in team fight tutti col 60% m speed il buff reistenze e lo scudo che ti dava era UN PO eccessivo XD","replies":[]}]},{"poster":"Ringiel","date":"2016-07-26T08:33:23.884+0000","up_votes":1,"down_votes":0,"body":">che dei due items fordamentali\n\nguarda che i due item stackano ancora ... il problema prima era che stackavano più mikael o incensieri assieme,più che nerf è stato un bug fix ...\n\n> portando il champ molto utile nel late game anche se soltitamente nel late game\n\nrenek in late fa cagare ... il succo è proprio questo,ha un early forte,ma non fortissimo come altri sui colleghi e se si finisce in late diventa inutile come una pera\n__________________\n\nhai praticamente detto quello che ha detto terenas,a sto punto metti il video ... karma era forte già prima del buff {{item:3222}}/{{item:3504}} quindi un nerf ci stava(che poi nerf è eccessivo),sopratutto alle MS che conferiva con la E,visto che nessun altro support a livello 2 ti puteva dare 60% ms;\nsu renek mi trovo d'accordo con te,buffare i danni per secondo che non scalano nemmeno AD è una perdita di tempo,ma diminuire il cd della E lo renderebbe troppo frustrante ... strano che non hai citato anche shen.","replies":[]},{"poster":"Darkinknight","date":"2016-07-26T18:11:08.004+0000","up_votes":1,"down_votes":1,"body":"I nerf agli item supp sono \"ridicoli\"..in pratica se ne buildi 2 uguali la pasaiva non si somma..ora oggwttivamente quante volte hai visto karma con 2-3 item uguali? Quindi il nerf anche al champ ci puo anche stare anche se,a mio parere,potevano aspettare la prossima parch e vedere come si sviluppava con il nerf solo agli item\nRenekton,non credo che il buff alla ulti sia cio che gli serva,ma ora immaginalo con il cd della e abbassato in fase di lane..in pratica tu zompa addosso,ti stunna,ti smezza la vita e se ne va..senza quel cd non avresti tempo in alcun modo di recuperare abbastanza hp per sopportare il secondo-terzo giro di skill (non dimenticare che è un champ da early con danni elevatissimi)\nNidalee non mi esprimo,non ho idea di cosa potrebbe esserle cambiato..ma forse questo nerf gli rallentera un pelo la pulizia dei campi = + tempo e - hp,non mi sembra cosi errato\nSona,era scontatissimo gia su carta prima di vederla giocare che la win rate sarebbe esplosa e qui,la riot ha fatto finta di non vedere..vediamo come andra ora coi nerf \nHecarim probabilmentw lo nerferanno ulteriormente..il nerf si sentira ma non abbastanza\nBuff a shyvana ci sta..d'altra parte il motivo per cui non ha senso pickarla e che si trova quasi a 0 come cc + nessuna fonte di recupero hp\nLa cosa dei minion cannone non ha senso,della prima torre con 400 gold in piu invece si,ormai agli lcs era sistematico 3 persone top da una parte e 3 bot dall'altra\nPure io seguo terenaslll ma credo che stavolta abbia toppato non poco..forse come molti player ora si sente frustrato a bestia per come la riot stia sviluppando il game e tende a vedere tutto negativo a priori\nPs:se devi fare un papiro scrivendo pari pari cio che hai visto nel video a questo punto posta il video direttamente","replies":[]}]}