{"poster":"Senpαı","date":"2018-08-15T15:55:20.988+0000","title":"LP SYSTEM?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Ich bin plat 5 und hatte vor kurzem einen MMR von Platin 2, trotzdem bekomme ich nur 15-18lp. Kann mir jemand erkl&auml;ren, wie die LP System funktioniert, weil ich hatte immer eig 20-25LP bekommen","replies":[{"poster":"Jepen","date":"2018-08-15T17:35:10.567+0000","up_votes":1,"down_votes":0,"body":"Sich realisieren dass du eig gar nicht ein guter Spieler bist, wäre schon erste Schritt. Dein MMR ist gar nicht P2. Nachdem ich deine Matches bzw Ligenstatistiken gecheckt habe, solltest du auf jeden Fall Gold 5 bis Gold 3 sein. Keine Ahnung, wie du auf P5 geschafft hast...hattest wohl zuviele Luckgames. \n\nDies ist keine Hass oder Flame. Ich sage nur die Fakten. \n\nMfG","replies":[]},{"poster":"TEA Márîuš","date":"2018-08-15T16:30:24.863+0000","up_votes":1,"down_votes":0,"body":"Ich kriege momentan 20 Lp in Dia3 obwohl meine MMR laut op.gg normal ist. Es kommt wirklich drauf an wie die MMR von deinen Gegner und des deinen Teams  ist.","replies":[{"poster":"Angel Ayume","date":"2018-08-15T16:37:05.196+0000","up_votes":1,"down_votes":0,"body":"Wie bereits erwähnt, kann man der MMR von op.gg sowie anderen Seiten die die MMR anzeigen nicht vertrauen. Sie weicht sehr oft extrem ab. \n\nAber mit 20 LP ist deine MMR wohl tatsächlich normal.","replies":[{"poster":"TEA Márîuš","date":"2018-08-15T16:51:52.585+0000","up_votes":1,"down_votes":0,"body":"Ja, habe das auch öfters mitgekriegt vorallem im dia 5 hatte ich laut der Website Dia 3 MMR aber nur 17+ Lp per Win und das bei einer winningstreak und 60℅ Winrate . Wäre mal Interessant zu wissen wie es berechnet und ob es auch für die jeweiligen elos eine besondere Berechnung gibt .","replies":[{"poster":"Angel Ayume","date":"2018-08-15T16:57:14.286+0000","up_votes":1,"down_votes":0,"body":"> Das was sie zeigen ist lediglich der MMR-Durchschnitt der Spieler in deinem Team, von denen sich die MMR auch nur durch einen Durchschnitt aus den Spielern aus ihrem Team errechnet hat. Ergo weicht die MMR Anzeige extrem von dem ab, was eigentlich der Fall ist.","replies":[]}]}]}]},{"poster":"Angel Ayume","date":"2018-08-15T16:35:38.138+0000","up_votes":1,"down_votes":0,"body":"Alpacana hat Recht. Deine MMR liegt sicher nicht bei Platin 2. Und egal welche Internetseite du besuchst, keine einzige kann dir deine MMR anzeigen. Das was sie zeigen ist lediglich der MMR-Durchschnitt der Spieler in deinem Team, von denen sich die MMR auch nur durch einen Durchschnitt aus den Spielern aus ihrem Team errechnet hat. Ergo weicht die MMR Anzeige extrem von dem ab, was eigentlich der Fall ist. \n\nAnhand deiner Elo und der erhaltenen LP würde ich darauf tippen, dass deine MMR irgendwo bei Gold 4/3 liegt. Das ist aber nur meine Vermutung, das muss also nicht stimmen. ^^","replies":[]},{"poster":"Alpacana","date":"2018-08-15T16:19:02.901+0000","up_votes":1,"down_votes":0,"body":"Deine MMR war wahrscheinlich nicht bei Platin 2, ganz einfach.\n\n1. Deine letzten Spiele waren mit Mates zwischen Gold 4 und Platin 5 (also hast du genau genommen eine ziemlich schlechte MMR)\n2. OP.GG zeigt nicht einmal ansatzweise deine MMR an (ich denke opgg hat dir gesagt, dass du eine Plat 2 MMR hast?).\n3. Wenn du eine Platin 2 MMR hättest, würdest du auch mehr als 15-18 LP bekommen","replies":[]},{"poster":"Pilze","date":"2018-08-15T20:11:00.017+0000","up_votes":1,"down_votes":3,"body":"Es wird dir keiner sagen können wie das System funktioniert. Alles was du liest sind irgendwelche Spekulationen von den Leuten hier.","replies":[]}]}