{"poster":"Vanghart","date":"2016-10-16T18:58:42.357+0000","title":"Matchmaking","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Premettendo che sono appena sceso da g5 a s1 e ci pu&ograve; anche stare dopo una serie di sconfitte (nel senso chiamamolo anche un downgrade meritato alla fine); ho perso gli ultimi game possiamo anche dire per colpa mia perch&eacute; si &egrave; un team, per&ograve; ritrovandomi con 1 o 2 unranked ogni volta.\r\nHo provato una volta a fare un duo con un mio amico b1 e mi diceva che c&#039;era un gap troppo elevato di leghe, e ci pu&ograve; stare.\r\nQuello che non comprendo, e non lo dico per fare della polemica ma proprio perch&eacute; non capisco, &egrave; il perch&eacute; non posso rankare da g5 con dei b1 ma posso farlo con degli unranked che magari vengono smistati in maniera casuale secondo non so quale algoritmo, ma un kennen e wukong unranked che mi fanno finire jax top a 9/1 al minuto 15 e non conoscono (non per colpa loro perch&eacute; anche io ero cos&igrave; agli inizi) le  dinamiche base del gioco e quando fare le call per gli obiettivi non mi incentivano a rankare.\r\nL&#039;unica soluzione apprezzabile che ho notato per ora sarebbe quella di controllare i profili e nel dubbio fare un dodge che per&ograve; comprende a suo modo una penalit&agrave; di 3lp e/o minuti di attesa.\r\nRipeto, non &egrave; assolutamente una lamentela, &egrave; solo che proprio non riesco a capacitarmi e vorrei per curiosit&agrave; conoscere il sistema generale di matchamking se possibile.\r\nE&#039; il mio primo post e sinceramente non so neanche se la discussione &egrave; nel posto giusto quindi mi scuso in caso contrario.\r\nSperando in una delucidazione vi auguro un buon lavoro e un buon divertimento con questo gioco che mi piace davvero molto :)","replies":[{"poster":"Chroniicles","date":"2016-10-17T09:37:28.126+0000","up_votes":2,"down_votes":0,"body":"Ciao, la sezione più adatta sarebbe stata [discussioni generali](http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it), questa piuttosto è utile in caso di problemi col gioco di natura \"tecnica\".\nComunque, se vuoi accettare un consiglio da uno che gioca il tuo stesso ruolo (dalla tua match history sembra tu sia un support), senza troppi giri di parole per addolcire la pillola... basta scaricare le tue frustazioni sul matchmaking e rimboccati le maniche amico mio.\nIl fatto che tu in gold non possa rankare in premade con un amico bronzo è normale e serve proprio per evitare matchmaking impossibili da bilanciare vista la disparità elevata tra i due MMR. Un unranked invece potrebbe avere un buon valore e ritrovarsi a giocare contro\\con silver alti\\gold bassi perchè sta facendo i piazzamenti e il sistema sta modificando il suo MMR in base a vittorie\\sconfitte. In quella partita in particolare, avevi unranked anche nel team avversario, e ci stavi giocando proprio tu contro. Perchè l'avversario è riuscito a prendere vantaggio su giocatori meno esperti mentre tu no?\nParlando del tuo gameplay: hai un rapport assist\\kill per morti bassissimo, significa che il tuo impatto sul gioco è minimo, probabilmente controproducente in molti casi. Impara a posizionarti meglio nei fight, usa bene la sighstone, guarda sempre la minimappa e pinga i tuoi compagni nelle altre lane se avvisti jungler\\noti che qualcuno ha dimenticato di fare un ss, guarda qualche tutorial sulla gestione delle wave di minion per poter fare trade vantaggiosi in lane.","replies":[{"poster":"Vanghart","date":"2016-10-18T09:59:37.178+0000","up_votes":1,"down_votes":0,"body":"No ma che dovessi tornare Silver ci stava perché comunque stavo perdendo troppi game, non stavo dicendo che non fosse colpa mia, solo che preferisco perdere un game normale che con uno che poi scrive \"sry first time kennen/ sry guys I'm new to ranked\"\nMa alla fine sono tiltato a s2 in un pomeriggio e adesso sono tornato s1 e sto risalendo un pochino spero; non capivo solo perché gli unranked vengono messi così nei game, anche per la mia bot (adesso non so dove vedere i match history e non ricordo), però mi sembrava che la mia tristana fosse 4/0\nTi ringrazio per i consigli, cercherò di applicarli anche perché che abbia ancora molto da imparare è indubbio \nE probabilmente anche impegnandomi al massimo non andrei oltre il g4 potenzialmente immagino \nNel senso, non sono il proplayerwannabe che scarica la colpa sugli altri, ovvio che se non avessi perso quelle prima non sarei sceso, e ovvio che non sia colpa di uno che sta facendo i piazzamenti per le ranked che si trova piazzato lì\nComunque grazie ancora per l'attenzione e la risposta :)","replies":[{"poster":"Chroniicles","date":"2016-10-18T11:02:29.485+0000","up_votes":1,"down_votes":0,"body":"Figurati, comunque mi sto organizzando per fare dei coaching (gratuiti) se volessi approfittarne non esitare a contattarmi. A me serve per fare esperienza, a te potrebbe aiutare nella risalita ^^","replies":[]}]}]}]}