{"poster":"Mr Stifmeister","date":"2016-05-17T13:12:32.466+0000","title":"neuer Shen useless ! Bitte Riot macht irgendwas !","subforum":"Champions & Gameplay","up_votes":0,"down_votes":8,"body":"Aus meiner Sicht muss ich sagen, dass ich den alten Shen viel besser fand weil er einfach ein so guter safe pick f&uuml;r die Toplane war und meines Erachtens hat Riot genau die Dinge an Shen gechanged, die die Shen mains nicht ver&auml;ndert haben wollten. Ich meine mit dem neuen Shen kann man nicht mal gut supporten. Der alte hatte auf dem Q noch einen heal was sehr usefull war. Sein alter W war definitiv besser als der neue, weil der neue einfach nur 1,75 sekunden autoattacks blockt was eigentlich garnichts ist und au&szlig;erdem wird hier nur die cd verringert. Der Alte E war besser, weil er Schaden durch die Autoattacks reduziert hat. Die neue passive mag zwar ein besseres shield sein,  kann aber nicht geziehlt eingesetzt werden, da ein leichter delay dabei ist. Ich finde sogar das Visual Update vom neuen schlecht lol. Ich wei&szlig; nicht, m&ouml;glich seit ihr nicht meiner Meinung aber ich war ein echter Fan vom alten Shen, weil er einfach aus MEINER SICHT viel besser und in seiner Role als Toplaner oder auch Supporter viel St&auml;rker war. Au&szlig;erdem wird er kaum von irgendwem gespielt, wodurch man sieht, dass dieses Rework ein fail war.\r\n\r\nWas sagt ihr dazu ?","replies":[{"poster":"GoW Linc","date":"2016-05-17T13:34:57.683+0000","up_votes":2,"down_votes":0,"body":"du kanns shen nicht, er hat neue schwächen aber auch neue stärken bekommen. spiel ein bisschen mit ihm, er hat jetzt halt eine etwas andere spielweise","replies":[]},{"poster":"Medi chan","date":"2016-06-07T11:30:17.237+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nhabe sowohl den neuen Shen, als auch den alten Shen gespielt und muss sagen,\ndass der neue ein viel aggressiveres Gameplay erlaubt, als der Alte.\nIch habe zurzeit eine über 60 % Winrate mit ihm und kann ihn nur wärmstens empfehlen. ;)\n\nLg. Medi chan {{champion:98}}","replies":[]},{"poster":"GankMeOrLose","date":"2016-05-17T23:51:46.635+0000","up_votes":1,"down_votes":0,"body":"Hier mal ein paar Fakten für dich \"damals war alles besser\" Hipster:\n\n1. Mit dem neuen Shen kann man genuaso gut \"Supporten\" wie mit dem alten, wenn du das nicht kannst ist das Rework nicht Schuld\n2. Seine alte W ist dei neue Passive und insgesamt stärker. Mehr Schilde in kürzerer Zeit. Das braucht halt mehr Skill als einfach nur eine Taste zu drücken\n3. Die neue W ist, natürlich nur wenn gut eigesetzt, ein geniales Teamfighting Tool. Braucht halt eben etwas Skill um ihn nützlich zu machen\n4. Die alte E hat Schaden von AA's reduziert. Das war schön und gut nur hat man ja diese tolle W die man einsetzten kann\n5. Die Passive KANN gezielt eingesetzt werden, braucht halt eben wie gesagt mehr Skill als eine Taste zu drücken\n6. Der Grund warum er nicht gespielt wird ist der, das er eben nicht mehr der alte ist und die alten Spieler den neuen nicht Mögen zu mal er jetzt schwerer zu spielen ist als vorher\n\nFazit: Shen ist alles in allem wesentlich schwerer zu spielen geworden weswegen die meisten Spieler mit ihm nicht mehr umgehen können zumal sein Kit nun ein anderes ist. Er hat keine Safe Laningphase mehr da er keine Ranged Q mehr hat aber ist was Schaden, Tankyness und Utility angeht besser geworden wenn man mit ihm richtig Spielen kann. \n\nChamps sind wie Fisherments: Sind sie zu hart bist du zu Schwach","replies":[]},{"poster":"Alustus","date":"2016-05-17T13:40:44.797+0000","up_votes":1,"down_votes":0,"body":"Statistik Platin+:\nEr hat immer noch eine Winrate über 50%\nPlayrate ist bei 4% was bei ca. 130 Champions doch nicht so wenig ist bzw überdurchschnittlich\n\n\nDaraus schließe ich dass er nicht komplett useless sein kann und auch das er mehr als nur kaum gespielt wird.\nQuelle: Champion.gg","replies":[]}]}