{"poster":"GodTrigger","date":"2019-09-04T16:17:08.173+0000","title":"Account sospeso per uso di software di terze parti","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Buongiorno, oggi dopo circa diversi mesi che non uso il mio profilo ho provato ad accedere al gioco e mi ha segnalato questo tipo di sospensione (cosa che non ho mai utilizzato e quindi sono dubbioso riguardo alla stessa). È possibile recuperare questo account oppure devo crearne uno nuovo da zero?","replies":[{"poster":"Vähn","date":"2019-09-04T18:16:28.386+0000","up_votes":3,"down_votes":0,"body":"Qualcuno può aver usato l'account al tuo posto in questo arco di tempo? Comunque contatta il supporto e spiega la situazione.","replies":[{"poster":"GodTrigger","date":"2019-09-04T18:22:30.143+0000","up_votes":1,"down_votes":0,"body":"Che io sappia no, è tipo dalla fine del 2018 che non ci giocavo. Ora vedo cosa mi dicono del supporto.","replies":[{"poster":"liberodaniele","date":"2019-09-05T11:36:30.818+0000","up_votes":4,"down_votes":0,"body":"Sei stato tu a vincere 28 ranked su 30 giocate (e con un serie di 20 vittorie) con jax a aprile/marzo? Se la risposta è no hai trovato la causa del ban.","replies":[]}]}]},{"poster":"MorteGrigia","date":"2019-09-04T22:17:47.525+0000","up_votes":2,"down_votes":0,"body":"Contatta il supporto e vedi che ti dicono","replies":[]},{"poster":"star bright99","date":"2019-09-05T20:21:48.662+0000","up_votes":1,"down_votes":0,"body":"spuntano dei game ad aprile del 2019 ti risultano? di averli giocati?\nah vabbeh XD scusami.,.... ma qualcuno ti stava boostando solo wins con ottime stats.... uno che non gioca spesso è impossibloe che abbia tali risultati, è palese questo dato di fatto.","replies":[]},{"poster":"Domaevenath","date":"2019-09-04T16:49:16.717+0000","up_votes":1,"down_votes":0,"body":"Seguo anche a me è successa la stessa cosa.","replies":[{"poster":"liberodaniele","date":"2019-09-05T11:39:43.599+0000","up_votes":1,"down_votes":0,"body":"Ti hanno bannato dopo un lungo periodo di inattività o ti hanno bannato e basta?","replies":[]}]}]}