{"poster":"darksalchicha","date":"2015-12-03T01:26:19.011+0000","title":"Kennen, Jarvan IV o Renekton para top?","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Nada gente, estoy indeciso por alguno de esos campeones para top. Queria ver si alguno me puede ayudar a decidir jaja\r\nPor un lado veo a {{champion:85}} bastante solido, es bueno en todas las etapas del juego, tiene gran tf. Lo unico es muy ulti dependiente parece.\r\n\r\n{{champion:58}} Probablemente el que todos van a recomendar, es un lane-bully. Pero no s&eacute; lo veo muy de early, como que es una carrera contraleoj... tenes que tratar de sacar ventaja si o si para poder ser util en las tf.\r\n\r\n{{champion:59}} Este no se vio mas en top (obvio que esta mejor en jungla), pero no s&eacute;, lo veo bastante bien para top. tiene buen early tiene algo de poke con esa q, tiene escape con el combo e+q y si te quieren divear los podes cagar tirando el ulti y saliendo con el ccombo o con el flash.  Este mepa que tiene mejor late que Renekton, por la reduccion de armadura de la q y la pasiva lo veo un poco mejor que al cocodrilo en late.\r\n\r\nSeguramente van a pensar &quot;este pelotu se est&aacute; respondiendo solo&quot; . Aun sabiendo mas o menos de que va cada campeon queria ver si alguien puede aportarme algo mas para ayudarme a decidir. \r\nGracias","replies":[{"poster":"Nhazsk","date":"2015-12-03T01:41:16.972+0000","up_votes":3,"down_votes":0,"body":"Te recomiendo sin duda {{champion:58}} y siempre sos util, me refiero a que si sales 1-1 de linea vas a aportar cc, si tenes un adc feed lo haces peel, Solo sos un peso muerto cuando fedeas.\nEl 75% de las veces vas a ganar la linea con este campeon, con una build offtank llegas a 4000 de vida que es mucho ({{item:3748}} {{item:3071}} {{item:3053}} {{item:3111}} {{item:3742}} {{item:3065}}) Todos esos items le vienen genial y con buenas runas llegas al 40% Cdr.\nTe lo recomiendo porque yo tampoco lo veia seguro hasta que lo compre y me encanto.","replies":[{"poster":"Coscochitos","date":"2015-12-03T01:49:56.218+0000","up_votes":1,"down_votes":0,"body":"Dependera de su estilo de juego.\nPD: ahora se puede llegar a el 45%","replies":[]}]},{"poster":"Coscochitos","date":"2015-12-03T01:34:22.511+0000","up_votes":2,"down_votes":1,"body":"te aconsejo {{champion:58}}  si tegustan los champs tank (se puede jugar jg pero tenes que dominar bien esta).\n{{champion:59}}  es mas un jg aunque tiene mecanicas divertidas cuando lo dominas (cosa que yo no ago).\n{{champion:85}} si te gustan o te faltan champ ap ademas te lo pudes llevar a la mid lane-\nPD: sorry si tengo muchos errores de ortografia.","replies":[]},{"poster":"CALAMBRITO1","date":"2015-12-03T02:21:10.558+0000","up_votes":1,"down_votes":0,"body":"kennen no es tan ulti dependiente , tan solo trata de encajar las 3 marcas y listo","replies":[]},{"poster":"dicalj","date":"2015-12-03T01:30:52.186+0000","up_votes":1,"down_votes":0,"body":"los 3 po loco, aprende a jugar con todos nomas, sin discriminar.","replies":[]}]}