{"poster":"xWannaPlayaGamex","date":"2016-06-15T08:08:56.542+0000","title":"Riot","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":4,"body":"So how to start this off? Lets see first I'd like to begin by expressing my hate for the way the riot system has treated me lately over the past two months. First my old account SnakesOfJehovah was hacked and stolen and i got no help from riot as to getting it back. Then I made this one only to get bullied and get chat restrictions twice for nothing i did wrong. i didnt feed i had a bad game. so what happens i get a bunch of jerks on a team that report me all at once multiple times and now i must wait 24 more games to use chat again! Thanks so much riot you are literally no help. yet i play your game bcuz i like it and i enjoy playing with nice people. take a better look at who you punish with restrictions and punishments. signed A VERY PISSED OFF GAMER THANKS!!","replies":[{"poster":"Son Golin","date":"2016-06-15T17:51:44.789+0000","up_votes":5,"down_votes":0,"body":"Hey WannaPlayaGame,\n\nSorry to hear that you've had trouble after trouble with your accounts. After taking a look at your thread, I attempted to look for your support request to see if there's anything we can do to help, but I can't find any support tickets regarding your old account or from your new account. Can you give me the ticket number so I can further look into this?\n\nAs for your new account's player behavior, I'm afraid that's out of my territory, but our system should give you a brief summary of what's going on regarding why your fellow players on the Fields of Justice reported you. \n\nIf you have further questions or inquiries regarding either of your accounts (eg. recovering your old account or seeing what you can do regarding the behavior regarding your new account), be sure to reach out to my colleagues on our Support Site: https://support.riotgames.com/hc/requests/new","replies":[{"poster":"xWannaPlayaGamex","date":"2016-06-16T02:23:45.090+0000","up_votes":1,"down_votes":0,"body":"22136412 this is my ticket number i made the request under tech difficulties and not recovering my account bcuz i couldnt get it to go thru that way please if you really can help me stay in touch i really really want my league account back i want to enjoy league again.","replies":[{"poster":"Son Golin","date":"2016-06-16T20:36:28.076+0000","up_votes":1,"down_votes":0,"body":"Hey again,\n\nI see that you submitted a ticket yesterday under technical difficulties, but we'll need you to submit it through \"I need help recovering my account.\" It'll start gathering relevant information and pass it along to my colleagues.\n\nOnce you've selected that option, make sure to select \"Yes\" under \"Do you remember the account signup info?\" Be sure to fill out as much information you remember so my colleagues can verify ownership of the account.\n\nIf you ever purchased anything on the account and remember any details be sure to select \"Yes\" under \"Do you remember the store information?\" as it provides us more context.\n\nI know it's a lot of information to submit, but the last thing we want to do is recover the account to the wrong person.","replies":[]}]},{"poster":"xWannaPlayaGamex","date":"2016-06-16T02:01:16.324+0000","up_votes":1,"down_votes":0,"body":"omg i would love to get some help on getting my old account back. if i make a new request can we stay in contact so you can help me recover it id be so grateful.","replies":[]}]},{"poster":"Juggernaut628","date":"2016-06-15T19:21:18.298+0000","up_votes":2,"down_votes":0,"body":"If someone hacked your account, do the same thing I did and just click forgot my password on the log-in screen. Assuming they didn't change your email if that's even possible, you will get an email allowing you to change your password unless the stupid things doesn't work right now.","replies":[{"poster":"DeynaTaggerung","date":"2016-06-16T01:54:45.724+0000","up_votes":1,"down_votes":0,"body":"It is possible but I'm pretty sure it requires email verification?","replies":[{"poster":"Juggernaut628","date":"2016-06-16T15:08:49.401+0000","up_votes":1,"down_votes":0,"body":"Try it anyway. If it doesn't work, oh well, but if it does, you get your account back.","replies":[]}]}]},{"poster":"Epic rekit","date":"2016-06-15T20:04:01.536+0000","up_votes":1,"down_votes":0,"body":"jeez people have been so rude today","replies":[]}]}