{"poster":"Xiniseid","date":"2018-04-27T00:27:26.174+0000","title":"There's more RNG to be found when laning against Tryndamere than when going to a casino.","subforum":"Gameplay","up_votes":52,"down_votes":8,"body":"Seriously, this champion needs a rework or something to remove his toxic, anti-fun and rng based play style. I'm not necessarily saying Tryndamere is broken, but he's just one of those champions that most players universally agree that they hate playing against. Laning phase is all about attempting to capitalize on the fact Tryndamere doesnt have ultimate before 6 while simultaneously keeping a track of his Fury, max Fury = stay the hell away.\n\nSeriously, does Riot consider this champion fun to play against? Because there is absolutely nothing fun about taking multiple Conqueror empowered critical hits before level 3 at which point you auto lose lane. Tryndamere single handedly decides if a lane is won or lost simply by how many crits he can land on you. \n\nTryndameres ultimate isn't even the biggest problem I have with him, in fact I consider it one of the most unique abilities in the game. The problem I have with Tryndamere is just how fucking random it is playing against him. One second you're winning a trade but the next second he lands a critical hit and you have the decision to either stay in lane to stay even in xp and cs or back and then begin falling behind (at which point it becomes even more infuriating playing against Tryndamere).\n\n","replies":[{"poster":"CLÜE","date":"2018-04-27T01:36:53.829+0000","up_votes":23,"down_votes":4,"body":"I believe that his ult is unique and cool, but maybe add some kind of addition to it like having to be in combat for a certain amount of time or something. Having an invulnerability kind of ability with no condition isn't fun to play against. At least with tarics ult you have a buffer where you can choose to burst down or back out.  I do agree about the RNG crits though. That's just not fun to be randomly be crit three times in a row and be at 10 hp.","replies":[{"poster":"ampheon","date":"2018-04-27T02:23:06.376+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=CLÜE,realm=NA,application-id=3ErqAdtq,discussion-id=WzQAWEPr,comment-id=0000,timestamp=2018-04-27T01:36:53.829+0000) I believe that his ult is unique and cool, but maybe add some kind of addition to it like having to be in combat for a certain amount of time or something. Having an invulnerability kind of ability with no condition isn&#x27;t fun to play against. At least with tarics ult you have a buffer where you can choose to burst down or back out.  I do agree about the RNG crits though. That&#x27;s just not fun to be randomly be crit three times in a row and be at 10 hp.\n\nLaughs in Kayle","replies":[{"poster":"Cutchennes","date":"2018-04-27T10:46:53.119+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=ampheon,realm=NA,application-id=3ErqAdtq,discussion-id=WzQAWEPr,comment-id=00000001,timestamp=2018-04-27T02:23:06.376+0000)\n>\n> Laughs in Kayle\n\nKayle is garbage before 3 items. Laughs in Trynd.","replies":[{"poster":"ampheon","date":"2018-04-27T23:39:49.765+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cutchennes,realm=NA,application-id=3ErqAdtq,discussion-id=WzQAWEPr,comment-id=000000010000,timestamp=2018-04-27T10:46:53.119+0000)> Kayle is garbage before 3 items. Laughs in Trynd.\n\nTouche","replies":[]},{"poster":"50Shades0fTrynda","date":"2018-04-27T10:53:52.472+0000","up_votes":1,"down_votes":0,"body":"after she loses 5 base ad 2 seasons ago shes just not it.... \n\ngonna go try her now ","replies":[]}]},{"poster":"CLÜE","date":"2018-04-27T17:00:08.667+0000","up_votes":2,"down_votes":1,"body":"I think the fact that tryndamere has a way to jump on to you and force a fight while invulnerable is what makes it not fun. You could just disengage against Kayle. Also, kayle isn't good at level 6 due to a sharp curve of scaling. Tryndameres damage at level 6 is enough to kill someone in the time your ult lasts","replies":[]}]},{"poster":"BobaFlautist","date":"2018-04-27T17:06:44.064+0000","up_votes":4,"down_votes":0,"body":"I've always liked the idea of giving it like a base duration of 1-2s and extending it by 0.5s every time he autos or even every time he crits, with a maximum duration of like 5-10s (I don't know what would be fair). That way, if you burst him and he uses it to run it's weaker but if he's aggressive in combat and successfully sticks to his opponent, he gets rewarded.","replies":[{"poster":"CLÜE","date":"2018-04-27T17:14:39.012+0000","up_votes":4,"down_votes":0,"body":"I really like this idea because it supports the thematic of tryndamere. He dives in and wants to continue fighting for a long time. I don't think that he's supposed to be an escape artist by twirling over walls and being invulnerable.","replies":[]}]}]},{"poster":"50Shades0fTrynda","date":"2018-04-27T10:48:58.038+0000","up_votes":8,"down_votes":1,"body":"i smell Belgian lawsuit against Riot on that matter","replies":[]},{"poster":"warpenguin555","date":"2018-04-27T16:08:04.847+0000","up_votes":10,"down_votes":3,"body":"I don't understand how he's not on the tier 1 list. He checks all the boxes. Aging visuals, super binary, very little skill expression, uninteractive, RNG reliant, fails intended theme, pubstomper,  and boring gameplay. He's worse than some of the champions on the tier 1 list but he's never even been mentioned by Riot for a VGU.","replies":[{"poster":"i kick routers","date":"2018-04-27T18:02:30.998+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"Verxint","date":"2018-04-27T18:52:20.573+0000","up_votes":5,"down_votes":1,"body":"Jax is closer to his intended theme than Tryn","replies":[]}]}]},{"poster":"The Bearded Bard","date":"2018-04-27T02:24:15.288+0000","up_votes":4,"down_votes":3,"body":"Stat check machiiiiiiiine","replies":[{"poster":"ZackTheWaffleMan","date":"2018-04-27T15:17:07.949+0000","up_votes":5,"down_votes":1,"body":"More like luck-check.","replies":[{"poster":"Ryrynounet","date":"2018-04-27T15:34:59.229+0000","up_votes":1,"down_votes":1,"body":"stat-luck-check ?","replies":[{"poster":"ZackTheWaffleMan","date":"2018-04-27T15:40:56.579+0000","up_votes":0,"down_votes":3,"body":"Stuck-check.","replies":[{"poster":"Ryrynounet","date":"2018-04-27T16:32:03.795+0000","up_votes":1,"down_votes":0,"body":"I don't have enough Stuck-Check against adc then :/","replies":[]}]}]}]}]},{"poster":"Best Ekko NA","date":"2018-04-27T01:47:57.027+0000","up_votes":5,"down_votes":1,"body":"Seriously m8? You don't need to put that before all your sentences lol the sentence still works if you remove it.\n\n{{sticker:sg-lulu}}","replies":[{"poster":"It Hertz When IP","date":"2018-04-27T21:58:04.333+0000","up_votes":1,"down_votes":0,"body":"IKR, it's like adding a random sticker in your post.","replies":[]}]},{"poster":"Vlada Cut","date":"2018-04-27T08:23:03.790+0000","up_votes":5,"down_votes":3,"body":"Am I the only one who doesn't find problems with fighting against Trynda?","replies":[{"poster":"50Shades0fTrynda","date":"2018-04-27T10:51:20.823+0000","up_votes":3,"down_votes":0,"body":"cause theres no problems with him in curent gameplay and meta... hes not overloaded , hes just TRYcky","replies":[]}]},{"poster":"Snowman Arc","date":"2018-04-27T08:13:33.423+0000","up_votes":5,"down_votes":2,"body":"It feels shit to play against this champ. Even though I generally don't have a problem with him, it's frustrating when I go in for a good trade, only to get RNG critted in 2 AAs and have to back off. I had cases where he managed to crit me 3 times in a row and killed me. I could technically disengage, but after getting hit with 2 crits, I didn't believe I would get RNGed and get critted again and die. Fight was a close call and if he critted once and not three times, I would have killed him first. This RNG is so bad.","replies":[]},{"poster":"Tik115","date":"2018-04-28T00:58:34.537+0000","up_votes":2,"down_votes":0,"body":"With Tryns ult my gripe is how he can activate it despite being CC'd, I might be wrong here but I'm fairly sure he is the only champ in the game who can use his ult while under the effects of CC, so you essentially have an ult which you realistically can't prevent from activating unless you have a silence which so few of the roster has.\n\nImagine if other champions ults could do that like Annies or Lissandras.","replies":[{"poster":"My Waifu Vanilla","date":"2018-04-28T20:28:22.547+0000","up_votes":2,"down_votes":0,"body":"{{champion:2}} {{champion:12}} both can.","replies":[]}]},{"poster":"Ultîma","date":"2018-04-27T19:55:49.238+0000","up_votes":3,"down_votes":1,"body":"I'll always call BS on the fact that Tryndamere can use his ultimate while stunned, silenced, or in high-orbit after an Ali pulverize because it breaks every rule about spellcasting in League of Legends.\n\nTryndamere, Pantheon, Mundo, Volibear, Mordekaiser and Udyr are characters that cannot get into the rework lineup fast enough.","replies":[{"poster":"Tempist","date":"2018-04-28T09:39:30.921+0000","up_votes":2,"down_votes":0,"body":"As Tryndamere is currently designed, he _has_ to be able to cast ult through CC. If he wasn't, he would pretty much unequivocally be the worst champ in the game.\n\nIt's not as if there aren't multiple ways of dealing with trynd as he is. The fact that the meta build is essence reaver of all things pretty much says it all about the champion's susceptibility to getting kited.","replies":[]}]},{"poster":"The Darius King","date":"2018-04-27T16:49:04.056+0000","up_votes":2,"down_votes":0,"body":"i never lose to trynd when I'm on dar. late game I will but early and mid I crush in 1v1s","replies":[]},{"poster":"ChisatoShirasagi","date":"2018-04-27T18:07:52.634+0000","up_votes":2,"down_votes":1,"body":"Riot needs to create a way to let the other team know when Tryndamere's ult is up. It's not fun to blow everything and have him survive through it all with his ult.","replies":[{"poster":"Automated Riven","date":"2018-04-27T18:54:57.226+0000","up_votes":3,"down_votes":1,"body":"If he didn't just use it, it's up. The thing has like a 50 second cooldown.","replies":[]}]},{"poster":"NA Darklarik","date":"2018-04-27T16:56:01.969+0000","up_votes":3,"down_votes":1,"body":"The thing about reworking him is that Critical strikes are his identity, and they are always random. \n\nUnless they aim for a 3-hit passive = Critical strike sort of like Xin Zhao's current passive or have him perma Crit like Ashe under some condition, there is no real place to begin reworking him in a unique way that maintains his identity of Crit smacking barbarian.","replies":[]},{"poster":"Lawd Dawg","date":"2018-04-27T15:44:42.918+0000","up_votes":3,"down_votes":2,"body":"Its not too hard to counter Trynd though. All the pokelords {{champion:17}} {{champion:126}} {{champion:150}} {{champion:80}} {{champion:10}} laugh at him, {{champion:74}}  basically is Gandalf with those friggin turrets (if you play tryn vs heimer on aram, you're pretty much reenacting that one scene) a good {{champion:114}}  or {{champion:92}} can out duel him, and don't even get me started on these guys {{champion:54}} {{champion:33}} {{champion:75}}","replies":[{"poster":"FirewaterDM","date":"2018-04-27T18:56:52.148+0000","up_votes":2,"down_votes":1,"body":"Don't hate fighting trynd but Heimer vs. Trynd isn't that awful after level 6, and  Trynd wins late game/mid game depending on items (legit I feel Heimer needs rylais in this matchup to not die after early game.","replies":[]}]},{"poster":"SweedishGunner","date":"2018-04-28T02:19:29.332+0000","up_votes":2,"down_votes":1,"body":"Conqueror needs to be removed.","replies":[]},{"poster":"Ranmaru","date":"2018-04-27T19:44:41.321+0000","up_votes":2,"down_votes":1,"body":"i post that trynds rng and needs to be put in the line of reworks and get downvoted to hell","replies":[]},{"poster":"Ignika D","date":"2018-04-27T09:11:54.899+0000","up_votes":2,"down_votes":1,"body":"them he takes conqueror and crit you twice at lvl 2 10/10 fun gameplay","replies":[]},{"poster":"6KEMBE4ORBA","date":"2018-04-28T15:16:55.673+0000","up_votes":1,"down_votes":0,"body":"Trynd is pretty weak currently, even conqueror didn't help that much (before that he was doing close to 0 dmg in lane)  and all match-ups against him win the lane easliy.","replies":[]},{"poster":"VelvetCrotch","date":"2018-04-28T02:54:13.908+0000","up_votes":1,"down_votes":0,"body":"Agreed. Trying was my first champ with naut. I still play naut but absolutely hate trynd. You don't even feel outplayed by him. \n\n\nThey should remove this \"the lower the health the more dmg\"-thing. The ult is fine tho,","replies":[]},{"poster":"Votable Jester","date":"2018-04-28T00:34:32.368+0000","up_votes":1,"down_votes":0,"body":"That's only because you're guaranteed to lose at a casino.","replies":[]},{"poster":"Auz the Ripper","date":"2018-04-27T15:09:49.294+0000","up_votes":1,"down_votes":0,"body":"If you just trade when he has no rage and/or force him to use up his rage for sustain by poking, it’s mostly not a problem.\n\nWithout rage he does exactly nothing early","replies":[]},{"poster":"HungryAngry2SPP","date":"2018-04-27T13:14:05.463+0000","up_votes":1,"down_votes":1,"body":"Funny, when i opened this tab, an another opened automatically with a casino ad, lol\n(It's a virus or something)","replies":[]},{"poster":"PowerSlave993","date":"2018-04-28T09:00:41.671+0000","up_votes":1,"down_votes":2,"body":"{{champion:420}} tell me that this isn't toxic champ?","replies":[]},{"poster":"ZT Xperimentor","date":"2018-04-27T02:19:23.680+0000","up_votes":1,"down_votes":2,"body":"\"Seriously, does Riot consider this champion fun to play against?\"\nObviously not considering they've been making mimics for years.","replies":[]},{"poster":"Gamer Gallade","date":"2018-04-27T04:58:26.492+0000","up_votes":2,"down_votes":3,"body":"Honestly. I hope he gets it soon and remove that dumb passive, un-intactive w, a semi-broken q, a basic dash that is the E. And most importantly, act change that god forsaken ultimate to be much healthier.\n\nWe can all agree that Trynd was gimped because of his Ultimate and cant have more power because of it.","replies":[]},{"poster":"Violet Fields","date":"2018-04-27T08:19:33.972+0000","up_votes":5,"down_votes":6,"body":"{{champion:23}} ... toxic?\n\nLooks at every ADC in the game, except maybe Ashe and Lucian.\nDon't get me wrong, I agree that he's toxic, I just think there's more pressing matters right now.","replies":[{"poster":"TyroneWatermelon","date":"2018-04-27T17:22:14.689+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Auccuatt,realm=NA,application-id=3ErqAdtq,discussion-id=WzQAWEPr,comment-id=0007,timestamp=2018-04-27T08:19:33.972+0000)\n>\n> {{champion:23}} ... toxic?\n> \n> Looks at every ADC in the game, except maybe Ashe and Lucian.\n> Don&#x27;t get me wrong, I agree that he&#x27;s toxic, I just think there&#x27;s more pressing matters right now.\n\nTryndamere is the most toxic champion league ever had, and he isn't even on my most hated list","replies":[]}]},{"poster":"LVL99 Helper TK","date":"2018-04-27T06:29:11.789+0000","up_votes":5,"down_votes":20,"body":"***","replies":[{"poster":"FlameadoDeKoorvo","date":"2018-04-27T10:32:04.286+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Ernie,realm=NA,application-id=3ErqAdtq,discussion-id=WzQAWEPr,comment-id=0005,timestamp=2018-04-27T06:29:11.789+0000)\n>\n> here we see silver players in their natural habitat. the animal is known for brainlessly rushing into 1v1&#x27;s, which makes them a perfect prey for the Tryndamere. The Tryndamere stalks its prey, utilizing a high dueling power (the only strength it has) to over-power the silver player, and eventually the silver players drag their pathetic miserable asses onto the boards to cry an ocean of salty tears.\n> \n> the recommended treatment is some lube before going into game, and some anal cream afterwards.\n\nSilvers, fun to know when the champ climb a lot of WR in HIGH ELO in the KR server, but ofc they are nabs compared with you.","replies":[]}]}]}