{"poster":"Depinns","date":"2016-02-06T09:19:28.038+0000","title":"GEWALTIGES PROBLEM BEIM ACCOUNT","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Mein LoL account wurde gehackt.Ich habe bereits ein ticket geschrieben welches noch nicht beareitet wurde.Heute morgen kam eine mail von riot dass mein account gesperrt wurde weil ich ein unangemessenes verhalten vorzeige.Problem:dass bin nicht ich sondern der hacker.wenn der account geseperrt wird l&auml;sst sich dass ja nicht mehr r&uuml;ckg&auml;ngig machen.Ist mein account jetzt f&uuml;r immer verloren?","replies":[{"poster":"Loki331","date":"2016-02-06T10:08:09.688+0000","up_votes":3,"down_votes":0,"body":"Wie du schon sagtest, das musst du mit dem Support klären.","replies":[]},{"poster":"Darkr3sQ","date":"2016-02-06T10:46:53.651+0000","up_votes":2,"down_votes":0,"body":"Vor allem:\nEs handelt sich nicht um einen Hack, da ich nicht denke dass jemand die RIOT-Server angreift, nur um den Account des TE an sich zu reißen.\nDer TE ist entweder auf kostenlose RP / kostenlose Skin / Helft mir bei meinem Tribunalfall um eine Strafe abzwenden (alles Phishing-Fälle) hereingefallen, oder hat sich einen Trojaner / Keylogger eingefangen.\n\nAbgesehen davon, das RIOT in den AGB stehen hat, dass jeder Benutzer für den ihm leihweise zur Verfügung gestellten Account verantwortlich ist, und auch Strafen erhalten kann, wenn ein anderer auf diesem Account spielt, kann es durchaus sein, das RIOT in dem Fall möglicherweise kulant reagieren könnte. Soweit ich weiß,  sperrt RIOT auch erst einmal die Accounts, wenn eine entsprechende \"Hack\"-Meldung reinkommt. Möglicherweise ist der Fall des TE bereits in Bearbeitung, und der Account wurde deswegen gesperrt.\n\nLetztendlich kann der TE allerdings erst mal nur abwarten, bis der Support sich bei ihm meldet, um die Angelegenheit entsprechend zu klären. Die erste Mail wird möglicherweise eine allgemeine Antwort sein, die nicht unbedingt mit dem Sachverhalt zu tun hat. Dies wird deswegen gemacht, um Fälle schneller bearbeiten zu können, da die Antwort die meisten Supportanfragen abdeckt. Hier einfach beharrlich aber freundlich mitteilen, dass es sich bei Deinem Fall etwas anders verhält. Also die Situation noch mal genau schildern, dass der Support sich dann mit dem Fall noch mal genau beschäftigt.\n\nWichtig ist, dass Du Deiner Support-Anfrage nicht immer wieder Sachen hinzufügst, oder auf die Supportanfrage eigenständig antwortest um nach dem Bearbeitungsstand zu fragen. In dem Fall wird das Ticket immer wieder ans Ende der Warteschlange gesetzt und es dauert länger.","replies":[]},{"poster":"Chaki","date":"2016-02-06T10:19:22.475+0000","up_votes":1,"down_votes":4,"body":"Wie sich immer alle rausreden wollen.\nEin Bann kommt nicht nur wegen 2-3 schlechten Games, dein Verhalten muss schon vor dem angeblichen Hacker außerordentlich schlecht gewesen sein.\nAnsonsten wärst du nicht gebannt worden.\nDer Account sollte meines Erachtens verloren sein.","replies":[{"poster":"Sakunosuke Oda","date":"2016-02-06T10:46:13.341+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Chaki,realm=EUW,application-id=7hciEY9w,discussion-id=GV5MpYwF,comment-id=0001,timestamp=2016-02-06T10:19:22.475+0000)\n>\n> Wie sich immer alle rausreden wollen.\n> Ein Bann kommt nicht nur wegen 2-3 schlechten Games, dein Verhalten muss schon vor dem angeblichen Hacker außerordentlich schlecht gewesen sein.\n> Ansonsten wärst du nicht gebannt worden.\n> Der Account sollte meines Erachtens verloren sein.\n\nNunja bekommt man nicht immer solche Warnungen? Was ist wenn er sich nach dieser Verwarnung gebessert hat und nicht mehr flamed etc. dann wäre es shit wenn der \"Hacker\" kommt und er nun wegen ihm den Bann hat.","replies":[]},{"poster":"Blurm","date":"2016-02-06T12:53:50.003+0000","up_votes":1,"down_votes":0,"body":"Nicht wirklich, man kann schon direkt gebannt werden, wenn man nur in wenigen Spielen (viel mehr als nur) toxic war, wie halt durch Krebswünsche oder anderwertige Todeswünsche (die Standardbeispiele halt).","replies":[]}]}]}