{"poster":"GRAF1CKER","date":"2017-01-09T19:08:21.737+0000","title":"Illaoi viel zu OP","subforum":"Champions & Gameplay","up_votes":1,"down_votes":15,"body":"Moin liebe Community,\r\n\r\nich bin mir sicher, dass ich nicht der einzige bin der denkt, dass Illaoi  VIEL zu OP ist. Das geht gar nicht mehr klar. Die muss nicht mal gefeedet werden um stark zu sein die ist einfach zu stark. z.B. ich als Pantheon auf der Top mit perfekten Meisterschaften  und Runen habe nicht den Hauch einer Chance gegen dieses fette Gesch&ouml;pf. Ich denke Illaoi ist die gr&ouml;&szlig;te Missbildung in der Geschichte von LoL und sollte UNBEDINGT beim N&auml;chsten Patch stark generft werden. Es macht keinen Spa&szlig; gegen diesen Fehler zu spielen wenn die noch vor lvl 6 easy einen Penta raushaut w&auml;hrend sie im Tower steht.\r\n\r\nmfg Phil          \r\n\r\n{{champion:420}}  {{item:1038}}","replies":[{"poster":"Ozuraak","date":"2017-01-11T09:57:35.554+0000","up_votes":2,"down_votes":0,"body":"http://www.leagueofgraphs.com/champions/stats/illaoi/all\n\nAbsolut Op. Ich meine, ein Champ der in jeder Elo eine Pickrate unter 5% und in jeder Elo eine Winrate unter 50% hat, muss einfach Op sein. Das schreit ja geradezu nach dem Nerfhammer.","replies":[]},{"poster":"Time2Whine","date":"2017-01-10T13:01:21.293+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=kingphilli123,realm=EUW,application-id=Wj1wcocU,discussion-id=qkO6lPG3,comment-id=,timestamp=2017-01-09T19:08:21.737+0000)\n>\n> z.B. ich als Pantheon auf der Top mit perfekten Meisterschaften  und Runen habe nicht den Hauch einer Chance gegen dieses fette Geschöpf. \n\nWenn ich deine AD Mastery Seite sehe kann ich mir bei solchen Aussagen nur an den Kopf fassen....Deathfire Touch auf Pantheon? 18:5:7? Erhöhung der Ability Power für Pantheon? Runen mit purem Flat AD? Warum kein Attackspeed in den Runen? Ohne Attackspeed nützt dir dein Lifesteal nichts!\nAnscheinend hast du nicht verstanden was Pantheon für ein Champion ist geschweige denn dass du weißt, wie man ihn spielt!\nDu verlierst die Lane und gehst weiter auf Damage? Youmus und dann direkt Hydra? Warum keine Ninja Tabys um wenigstens ein bisschen Armor gegen Illaoi zu haben? Warum kein Dead Mans Plate?\n2,8 CS für das Spiel? Dein Lasthitten lässt ebenfalls sehr zu wünschen übrig. In der Regel bist in deinen Games bei 3-4 CS pro Minute, das ist ein ganz schwacher Wert und wo zur Hölle ist dein Schaden?!? 13k !?! Du hast gerade mal 1k mehr Damage gemacht als eine Soraka in einem 40 Minuten Game. Eine Soraka!!! Was hast du das ganze Spiel über gemacht?\nIch fasse zusammen: Runen solala, Masteries falsch, Itembuild falsch, Farm ganz schwach, Damage am Gegnerteam grauenvoll, Spielweise des eigenen Champs nicht verstanden und damit mit Sicherheit die von Illaoi auch.\nIch wundere mich nicht warum die Illaoi eine Free Lane gegen dich hatte und dich und dein Team zerstört hat. \n\nDu solltest eher erst einmal auf dein eigenes Gameplay schauen bevor du hier nach Nerfs schreist! Illaoi ist nicht OP und wenn man weiß wie man gegen sie spielt hat sie keine Chance im 1vs1. Im Teamfight kann sie aufgrund ihrer Fähigkeiten immer carrien, dass ist aber das Konzept des Champs. Wenn du das 1vs1 gegen sie verlierst, liegt das an einzig und allein deiner eigenen falschen Spielweise.","replies":[{"poster":"Andrej553","date":"2017-01-10T14:07:07.862+0000","up_votes":2,"down_votes":0,"body":"Nur mal so nebenbei: \nMan spielt Pantheon mit Flat AD. Man kann ihn auch mit Deathfire spielen (wie gp), wobei Thunderlord meist besser ist.\nAS kommt NIE in den Runen zu Lane-Pantheon. Im Jungle vielleicht aber selbst da würde ich wohl eher Flat AD nehmen.\nJe nach Gegnerteam würde ich weiter damage bauen (wie auch mit Wu'Kong) - wobei iMo aber ein Black Cleaver als 2tes Item fest ist.\n\nAnsonsten stimme ich dir im großen und ganzen zu - wobei sich gerade bei den Damagewerten sich aus einem Spiel nicht viel ableiten lässt.","replies":[{"poster":"Time2Whine","date":"2017-01-10T14:31:44.473+0000","up_votes":1,"down_votes":0,"body":"Guter Einwand, jedoch finde ich dass Pantheon kein Poke Champ (Deathfire) sondern eher der Burster (Thunderlords) ist. Klar kann man ihn so spielen, jedoch beraubt man ihm ohne Thunderlords viel Burstpotential und damit eine seiner Stärken. Deathfires Touch ist in der Lane sicherlich toll zum poken, im Mid und Lategame willst du aber nicht Poken als Pantheon sondern bursten.\nZumal man kein Lifesteal Item (Hydra) bauen sollte, wenn man auf Flat AD geht. Man sollte definitiv einen Black Cleaver favorisiert werden.\nDu kannst weiter Damage bauen, allerdings sollte man, wenn man eh schon so hard behind ist, eher Richtung Off-Tank gehen mit {{item:3742}} {{item:3156}} damit man überhaupt Einfluss aufs Spiel nehmen kann und nicht weiter nutzlos bleibt, sondern auch mal eine Kombo rausbekommt bevor man stirbt.\nWenn man nur ein wenig hinter den anderen Damage Quellen bleibt, kann man sicherlich nicht viel daraus ableiten. Wir reden aber hier von einem Pantheon (Schaden pur!) der in 40 Minuten gerade mal 1k mehr Damage gemacht hat als eine Soraka und nicht eine Zyra, Brand etc. Der Xin aus seinem Team hat als nächster mehr Schaden gemacht und hat den DOPPELTEN Wert. \nAlso für mich ist das mit ein Hauptgrund für sein schlechtes Spielverhalten, denn hier geht es darum dass er meint, dass Illaoi OP ist. Sein grauenvoller Schaden spricht aber dafür, dass er seine Aufgabe als Panth überhaupt nicht erfüllt hat und dadurch groß dazubeitragen dass Illaoi so großen Einfluss auf das Spiel nehmen konnte.","replies":[{"poster":"Andrej553","date":"2017-01-11T09:40:41.856+0000","up_votes":1,"down_votes":0,"body":"Ich sagte ja, Thunderlord wird meist besser sein, jedoch kann es je nach Gegner doch vorkommen dass man die lane durch poke gewinnt und damit besser snowballen kann. Bin aber kein Pantheon main deshalb ka in welchem Matchups das wichtig ist (Illaoi könnte ich mir aber sogar vorstellen das es klappt).\nMan baut Hydra eher wegen dem Waveclear und dem Burst der aktiven nicht dem Sustain :) Das ist ein nice to have das es dazu gibt.\n\nKann man den gegnerischen ADC mit mehr damage Items bursten und stirbt anschließend, kann! das mehr Wert sein als mit Offtank build 2 Sekunden länger zu leben - lässt sich als einer Statisktik ohne Replay schwer sagen.\n\nGenauso lässt sich aus einem Spiel mit dem selben Schaden wie eine Soraka ohne replay nicht übermäßig viel herleiten. Wäre er nachdem er die lane so hart verloren hat nur noch Splitpushen (ist er nicht bei so wenig cs) gäbe es eine Erklärung. \nIn dem Spiel war es zwar wohl eher so, dass er am Teamkampf teilgenommen hat, sein positioning zu schlecht / das der Gegner zu gut war und er deshalb zu früh gestorben ist.\n\nIch stimme dir ja im Prinzip zu, sage nur man kann nicht ohne Replay an Stats(von einem einzigem Spiel) verallgemeinern - auch wenn die verallgemeinerung in diesem Fall vermutlich zutrifft ;)","replies":[]}]}]}]},{"poster":"Yaboku San","date":"2017-01-09T19:15:50.498+0000","up_votes":2,"down_votes":0,"body":"Jo, nur weil du ein Game gegen sie verloren hast, musst du nicht sofort dich im Forum ausheulen.\nIch geb dir recht sie ist stark, aber das ist alles Elo und Match-Up abhängig.\nBring fakten was dich stört, was zu stark ist und dann kann man darüber reden. :s","replies":[]},{"poster":"Alekra","date":"2017-01-09T20:17:11.124+0000","up_votes":1,"down_votes":0,"body":"Da du anscheinend keine Ahnung hast wie du gegen sie Spielst (Auf die Seite Laufen. Aus der Ult laufen. Jaaa laufen ist sehr schwer) macht es null Sinn Illaoi zu Nerfen. Sie hat klare stärken und (leider) auch unglaublich klare Schwächen ._.","replies":[{"poster":"Stealth Cat","date":"2017-01-09T20:27:36.812+0000","up_votes":1,"down_votes":0,"body":"Pinkwards kaufen soll auch helfen. ;)","replies":[{"poster":"Alekra","date":"2017-01-09T21:12:58.081+0000","up_votes":1,"down_votes":0,"body":"q-p","replies":[]}]}]},{"poster":"Good Guy Putin","date":"2017-01-09T21:10:15.033+0000","up_votes":1,"down_votes":0,"body":"Ich finde ihren Sustain ist einfach absurd.","replies":[]},{"poster":"0815xand0r","date":"2017-01-09T20:46:12.895+0000","up_votes":1,"down_votes":0,"body":"Zuerst zeig doch mal bitte ein Video einer Illaoi die im Tower Pre6 easy einen Pentakill macht. Danke.\n\nDann mal zum eigentlichen Thema: Als Illaoi ist Pantheon meistens ein relativ simpler Gegner, da du als Panth eben auf deine Gegner springst und genau das etwas ist, was eine Illaoi will. Pokest du sie aber mit deinem Q aus der Lane, kann sie wenig machen.\n\nWichtig ist bei Illaoi immer, dass du in Bewegung bleibst (ich mein, sie spricht unaufhörlich davon, vielleicht sollte man ihren Tipps mal lauschen ^^). Q/E kann man einfach ausweichen, ihr W blockst du mit deiner Passiven und aus der Ult gehst du auch raus. Essentiell ist vor allem, dass man nicht vom E getroffen wird (wobei du da als Panth einfach mit ner W/E-Kombo auf sie drauf kannst, das sollte den Spirit fast instant canceln und dann solltest du wieder auf Abstand gehen).\n\nUnd gerade im Early solltest du keine Probleme mit ihr haben, denn gerade ihr Lvl 1/2 ist extrem schwach.\n\nIllaoi selbst ist und war noch nie OP. Sie ist einer der stärksten Lanebullys auf der Toplane (ab Level 3) und hat halt die Möglichkeit i.d.R. auch ein 1v2 zu ihren Gunsten zu entscheiden. Klar, wenn sie fed ist, dann kann sie es auch mit mehr aufnehmen, das ist aber normal und auch so gewollt. Wenn man sie aber CC'd oder kitet, kann sie wenig machen. Ihre Winrate spricht jetzt auch nicht unbedingt für ihre OP'ness. Schau dir am besten auch mal ein paar Videos zu ihr an, dann verstehst du sie eventuell besser und kannst dann auch gegen sie spielen. Kannst dir auch mal das hier ansehen: https://www.youtube.com/watch?v=oSYp5lhSH8k\n\nAllgemein solltest du einfach lernen, dass du auch mal verlieren wirst und das nicht daran liegen muss oder wird, dass dein Gegner nen OP-Champ hat, sondern einfach besser gespielt hat als du.","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-01-09T20:12:34.092+0000","up_votes":1,"down_votes":0,"body":"ok illaoi nerf und panthe nerf auch thx rito","replies":[]},{"poster":"Oriius","date":"2017-01-09T19:18:16.062+0000","up_votes":1,"down_votes":2,"body":"Illaoi ist eigentlich nicht wirklich stark. da sind sachen wie alistar , maokai , galio wesentlich stärker (5 adc´s vs die 3 genannten) Adc´s 0 dmg tanks 5k Life + schild+heal und machen 10x so viel schaden + 10 sekunden cc . xd","replies":[{"poster":"Lysergsäure","date":"2017-01-09T19:57:59.879+0000","up_votes":1,"down_votes":0,"body":"Galio..ich werd nicht mehr.","replies":[]}]},{"poster":"TerrorRaven","date":"2017-01-09T19:29:02.079+0000","up_votes":1,"down_votes":0,"body":"Bleibe in Bewegung und renn weg, wenn sie ihre Ulti benutzt. Schon solltest du weniger Probleme gegen sie haben.","replies":[]},{"poster":"Nycaria","date":"2017-01-09T19:17:39.533+0000","up_votes":1,"down_votes":0,"body":"Mal abgesehen davon,dass zwei ihrer Spells einfach zu dodgende Skillshots sind und man aus ihrer Ulti einfach rauslaufen kann, besteht immer noch die Möglichkeit sie zu bannen.","replies":[]},{"poster":"Kata Ga Kill","date":"2017-01-09T20:08:09.576+0000","up_votes":2,"down_votes":3,"body":"Echt also wirklich.....mit Pantheon haste den Ultimativen Illaoi Konter....\nWenn du meinst auf sie draufzukloppen haste verdient zu verlieren.\n\nKiten ist Ihre größte schwäche und mit nem dauerspamm von Pantheons Q bringste sie zum tilten.\nJust Poke Poke Poke...","replies":[]}]}