{"poster":"TheAntuanello","date":"2016-02-14T10:40:50.109+0000","title":"INTERMINABILI CODE PER ENTRARE IN RANKED. ELIMINARE IL RUOLO DI SUPPORT?","subforum":"Discussioni generali","up_votes":5,"down_votes":27,"body":"Buongiorno a tutti,\r\n\r\nVorrei parlarvi di un problema che, penso, sia comune a tutti coloro che non giocano SUPPORT. In altre parole, il 90-95% dei giocatori. Io credo che, con il nuovo sistema di matchmaking, il ruolo di support debba essere completamente rivisto. In alcuni momenti della giornata &egrave; infatti diventato impossibile farsi una ranked a meno che non si accetti di giocare support. In 7 minuti e 38 secondi, come prima scelta adc e seconda top, ancora non avevo trovato un game; ho allora perso la pazienza &egrave; ho cambiato ruolo in &quot;qualsiasi&quot;. In 0.5 secondi ho trovato un game ed ovviamente ho giocato support. Non &egrave; ovviamente la prima volta che capita. Ogni volta, se giochi support o qualsiasi (ossia support), trovi un game in 0.5. Giocando altri ruoli il tutto &egrave; molto pi&ugrave; lento. Il fatto che nessuno voglia giocare support sta creando un tappo enorme nel nuovo sistema di creazione di una partita.\r\n\r\nE&#039; perci&ograve; evidente che giocare support non &egrave; un&#039;esperienza bella come giocare gli altri ruoli. Il problema c&#039;&egrave; ed &egrave; grande. A mio avviso l&#039;eliminazione del ruolo di support non &egrave; da escludere. Voi che ne dite?","replies":[{"poster":"Frattaglia","date":"2016-02-14T10:49:30.163+0000","up_votes":11,"down_votes":4,"body":"Sapevo che si sarebbe arrivati a questo.\n\nIl ruolo del support non è un ruolo \"creato\" dalla Riot, il meta per come lo conosciamo è un insieme di regole non scritte che si sono evolute nel tempo al fine di ottimizzare il risultato.\n\nSe sei disposto a fare \"fill\", allora preparati a tempi brevi e a giocare spesso support. Sennò rassegnati ai tempi lunghi.\n\nIn realtà un buon modo per incentivare la gente a giocare support è quello di smetterla di incolparli in game per ogni cosa che succede. ^^","replies":[{"poster":"FantasticWater","date":"2016-02-14T11:25:02.861+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=bOgEP3XN,comment-id=0000,timestamp=2016-02-14T10:49:30.163+0000)\n\n> In realtà un buon modo per incentivare la gente a giocare support è quello di smetterla di incolparli in game per ogni cosa che succede. ^^\n\nMmmh, non è solo quello. In realtà il ruolo di support ti costringe ad azioni di abnegazione, prima nei confronti dell'adc, poi in quelli di tutta la squadra. Se non ti getti in soccorso di tutti, tradisci il tuo ruolo, ma così facendo dipendi completamente dalle loro capacità di giudizio. Non sto dicendo che mi getto in soccorso di chiunque anche senza avere la benché minima possibilità di aiutare, né che non faccia intendere le mie intenzioni indietreggiando, o pingando, ma se l'adc si getta in un inseguimento pericoloso lo posso lasciare da solo? Se il jungler ingaggia posso non aiutarlo? Se il nemico ci ha fregati posso ritirarmi per salvarmi la pelle mentre i miei compagni muoiono? Per me sono tutte retoriche con risposta presunta \"no\"(giusto per intenderci u_u).\nNaturalmente tutto ciò, a prescindere dal giudizio che i compagni di squadra possano dare, fa sì che il Support possa sentirsi un po' meno partecipe del successo della partita ed il disagio è acuito quando la squadra perde il senno o non sa più dove andare a parare.\n\nNonostante ciò io continuo a fare il Support e a fare del mio meglio, per quanto poco valga, dal momento che non saprei in alcun modo indirizzare i miei compagni nella strada per la vittoria.","replies":[{"poster":"Dr LouD","date":"2016-02-14T12:03:07.422+0000","up_votes":8,"down_votes":2,"body":"Sei tu che devi prendere in mano il team, non devi buttarti ad aiutare.\n\nSe il tuo adc si butta da solo e crepa, non sei costretto ad aiutarlo.\nSe qualcuno pinga un obiettivo non contestabile, non seguirlo.\n\nFai tu le calls, crea tu le plays, non giocare solo \"mettendo le pezze\" ai buchi che creano i tuoi compagni.","replies":[{"poster":"SirGGtheWanderer","date":"2016-07-27T19:32:06.873+0000","up_votes":1,"down_votes":0,"body":"Sì e no.\nA mio parere (anche se sono di parte) il support deve buttarsi, aiutare e sacrificarsi per l'ADC se necessario. Se sto facendo una serie di uccisioni e commetto l'errore di ingaggiare (non mi accorgendomi che il jungler nemico è lì vicino) è compito del support cercare di difendermi anche a costo della vita. (ma in quel caso, come minimo, un grazie è d'obbligo!!!). Se però sono un draven 0/99/0 che di Draven ho solo il carattere e mi butto nell'ennesimo 1vs5, scusa tanto ma il support può benissimo cambiare automaticamente ruolo cominciando a farmare in bot, fare le kill se ne ha la possibilità e fregarsene dell'ADC.\n\nIn pratica il support è come un tutore. Se tuo \"figlio\" ti rispetta e si comporta bene, collabora e quando sbaglia chiede scusa allora puoi sacrificarti per lui. Ma se è un \"Draven\" che fa quel cavolo che vuole e ti insulta puoi benissimo abbandonarlo.","replies":[]},{"poster":"Niklide","date":"2016-02-15T12:20:45.705+0000","up_votes":1,"down_votes":0,"body":"yesssssssssssssss","replies":[]},{"poster":"Lee Pugno Divino","date":"2016-02-14T16:08:58.414+0000","up_votes":1,"down_votes":1,"body":"Stavo per scrivere quasi le stesse cose. 100% agree\nAggiungo che la parola support è semplicemente un uso comune. Il ruolo non si limita al supportare in modo passivo, nè essere schiavo dell'adc.\nIl motivo per cui il support si trova bot, ed in compagnia dell'adc è data dalla vicinanza al drago e dal fatto che i tiratori sono deboli come solo laner (non ne sono piu' molto sicuro...) e che scalano con i gold piu' che con l'exp.","replies":[]}]}]}]},{"poster":"xXChimera88","date":"2016-02-14T10:50:48.633+0000","up_votes":6,"down_votes":1,"body":"spero tu stia scherzando :')\n-1 dai support in arrivo!!\nhttp://i3.kym-cdn.com/photos/images/original/000/368/767/59d.jpg","replies":[]},{"poster":"Easlay","date":"2016-02-14T11:59:55.648+0000","up_votes":6,"down_votes":2,"body":"dico che sarebbe il caso di imparare a giocare anche quel ruolo, non solo \"omg voglio tons of kills!1!11!1!!!1!1!\"\nquesto post mi ricorda quando al campetto, da piccoli, tutti volevano fare l'attaccante e mai nessuno il portiere..","replies":[]},{"poster":"Niklide","date":"2016-02-14T14:13:42.626+0000","up_votes":2,"down_votes":1,"body":"Io dico che la season scorsa sono arrivato in gold giocando support, adesso vi dico che sono un 4 o 5 rank che non gioco più supp perchè incontro tutti ADC IMBECILLI e forse sono anche fuori allenamento col mio Treshone....In poche parole prima di gettare merda sul ruolo del supp siete proprio sicuri che i Support siano molto contenti di giocare con voi? Avete rotto le palle TheAntuanello non ce l'ho con te ma in generale, sarà il millesimo post che pone la stessa questione....Magari ci sono pochi support perchè la maggior parte dei pleyer è completamente LESA, e quindi i già pochi support rimasti decidono di scegliere ruoli dove hanno più possibilità di carryare...Non si tratta di essere bravi o meno si tratta che c'è troppa gente STUPIDA....Il support è un paradosso, non è un ruolo che carrya ma è fondamentale per tutto il team...Adc che non pokkano, con Tresh mi prendono la lanterna quando non devono e quando devono non la prendono, recall in mezzo alla mappa alla cazzo di cane dove 2 secondi prima c'è stato un fight e ci muoiono, i chase infiniti fino al nexsus avversario,se il support prende una kill bestemmiano senza capire che se fosse rimasto in vita un secondo in più si sarebbe preso anche lui la kill, e tanto MA TANTO ALTRO ANCORA.....A me sinceramente è passata la voglia di giocare supp perchè nell'elo in cui mi trovo la gente è stupida più che scarsa, quindi non posso compensare alla loro carenza di materia grigia giocando supp.....Prima di lamentarvi del perchè ci siano poche persone che giocano supp, fatevi un esame di coscienza, parlo sempre in generale a tutti non al singolo......Detto ciò vi saluto e vado a cercare di migliorarmi","replies":[{"poster":"GreenInch","date":"2016-02-15T06:11:50.135+0000","up_votes":3,"down_votes":0,"body":"Di solito se sto supp e prendo kill chiedo gentilmente scusa (oddio lo faccio pure se sono il midlaner ma li mi frega poco)se sto adc (secondo main)avvolte sono contento e gli dico gg magari falsando pure dicendo di essere fuori range per prendere la kill\nDetto questo..ė colpa dell ego di molti che avendo frainteso il ruolo del supp,perché è  questo il nocciolo della questione,credono che il sopracitato sia lo schiavetto di turno che deve dare visone a 4 decelebrati incapaci di usare il trinket o talmente a rate che col cavolo ti spendono 75 gold per una pink...perche quei 75 gold spesi non ti faranno completare un item..sisi","replies":[{"poster":"Niklide","date":"2016-02-15T12:16:39.902+0000","up_votes":1,"down_votes":0,"body":"Il fatto è che se il mio ADC è low HP e sta x crepare durante il trhade io cerco di massimazzare il mio danno e faccio di tutto x far crepare prima il nemico, se poi la prendo io la kill amen ma è meglio che il mio ADC abbia solo un assist in più rispetto all'avversario che abbiano entrambi una kill.......detto questo per il resto sono pienamente d'accordo con te, il support viene visto come carne da macello e schiavo ....e poi si lamentano che nessuno lo vuole fare più,grazie al ca*** !","replies":[]}]}]},{"poster":"Dr LouD","date":"2016-02-14T11:00:46.138+0000","up_votes":7,"down_votes":5,"body":"Trolli o sei serio?","replies":[{"poster":"Ste the ripper","date":"2016-02-14T11:20:45.624+0000","up_votes":2,"down_votes":15,"body":"Non vedo cosa ci sia da trollare, io credo che il problema qua sia un bug della coda, ma **se si dimostrasse** che a nessuno piace fare il support perché non rimuoverlo e cambiare il gioco in modo da offrire divertimento in ogni ruolo?","replies":[{"poster":"Nabbomaster","date":"2016-02-14T11:26:45.694+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=bOgEP3XN,comment-id=00040001,timestamp=2016-02-14T11:20:45.624+0000)\n>\n> Non vedo cosa ci sia da trollare, io credo che il problema qua sia un bug della coda, ma **se si dimostrasse** che a nessuno piace fare il support perché non rimuoverlo e cambiare il gioco in modo da offrire divertimento in ogni ruolo?\n\nguarda che mica lo decide la riot il meta ma i giocatori, nessuno viete te e i tuoi amici di giocare dopppio jungler,","replies":[{"poster":"TheConte","date":"2016-02-14T12:26:01.708+0000","up_votes":1,"down_votes":1,"body":"Vale la stessa cosa con il doppio adc per esempio ashe (d'altronde il suo ruolo secondario e il support se vedete le caratteristiche del personaggio)","replies":[{"poster":"GreenInch","date":"2016-02-14T14:30:22.992+0000","up_votes":3,"down_votes":1,"body":"si litigatevi il farm poi ne riparliamo","replies":[{"poster":"TheConte","date":"2016-02-14T21:23:49.410+0000","up_votes":1,"down_votes":0,"body":"Qualcuno almeno cerca di inventarsi qualcosa a proposito invece di criticare !:4","replies":[{"poster":"GreenInch","date":"2016-02-15T05:53:18.984+0000","up_votes":1,"down_votes":0,"body":"Forse mi sono spiegato male io...ho giocato con amici doppio jgl e potrebbe funzionare...anche il doppio adc ..ma visto che gli adc sono item dipendenti non la vedo come cosa buona.\nSe giochi con un amico sarebbe anche fattibile,gioca coon uno sconosciuto che nel ruolo di support ti prende ashe...al 100% si litigheranno il farm a chi lasthitta prima e vienimi a dire il contrario..ti parlo per esperienza personale avendo avuto l occasione di trovarmi in una situazione simile sia in team che contro...\no punti ad avere tutte kill oppure l adc avversario sara in vantaggio netto col farm,se non pure di kill","replies":[]}]}]}]}]},{"poster":"Ste the ripper","date":"2016-02-14T12:02:43.280+0000","up_votes":2,"down_votes":4,"body":"Potreste commentare i -1? Mi sta bene che non tutti siano d'accordo ma vorrei capire il vostro punto di vista.\nIl mio ( per chi non sa leggere) è un periodo ipotetico, se a nessuno piacesse fare il supp allora sarebbe giusto reworkarlo, e non vedo cosa ci sia di sbagliato in questo ragionamento,  spiegatemelo voi :)\n\nPs: che poi la riot ha già cercato di reworkarlo, vede gli oggetti per il guadagno di oro, il limite alle ward, la nuova sightstone, i supp ap come brand, stanno rendendo il ruolo di supp sempre meno da supp.","replies":[{"poster":"Amnoi","date":"2016-02-14T15:43:51.880+0000","up_votes":3,"down_votes":1,"body":"Il support(supporto) è un ruolo che consiste nel dare supporto al team,NON prendere kill NON fare 57849354milioni di danni in 0.0000000000000001sec, dare il massimo della visione possibile, evitare che l'ap e/o l'ad carry o anche il top stra feed implodano male nei fight etc etc.\nLa sightstone e gli item per guadagnare gold,secondo me, sono stati un tentativo per rendere la vita più facili a noi poveri supp che a 20 avevamo, se ci diceva bene, 1/2 item, per farci avere non solo ward nell'inventario  e per invogliare altri a provare il ruolo, le persone che dicono che il ruolo da supp è schifoso lo dicono perchè,solitamente, non hai danni e kill e la maggior parte di loro gioca per avere kill e la barra dei danni a fine game più lunga degli altri, perché non gli va di fare da babysitter all'adc in lane, vogliono rimanere nella loro sololane e sentirsi fighi per qualche oscuro motivo.\nSe veramente il ruolo del supp è inutile,brutto o qualsiasi altra cosa perchè non sono partite milioni di segnalazioni dai piani alti(diamond,master,challenger)?Se è così dove sono i vari lcs player che si lamentano dello schifo di quel ruolo?\n\np.s. ecco il mio commento ai vari -1 che ho messo in questa discussione","replies":[{"poster":"Ste the ripper","date":"2016-02-14T16:00:11.271+0000","up_votes":1,"down_votes":4,"body":"Non ho mai parlato di cosa debba fare il supp, né del perché sia ( se lo è) brutto...\nIl mio era un giochino simile al \"se Hitler avesse vinto la guerra allora\" tu come tutti quelli che hanno messo -1 non lo avete minimamente capito e questa risposta ne è la palese dimostrazione.\nProssima volta leggi 2 volte :)\n\nPs:\n\n> sono stati un tentativo per rendere la vita più facili a noi poveri supp che a 20 avevamo, se ci diceva bene, 1/2 item, per farci avere non solo ward nell'inventario e per invogliare altri a provare il ruolo\n\nQuindi hanno cercato di rendere il ruolo dei supp meno da supp :)\n\nPps: \n\n> Se veramente il ruolo del supp è inutile,brutto o qualsiasi altra cosa perchè non sono partite milioni di segnalazioni dai piani alti(diamond,master,challenger)?Se è così dove sono i vari lcs player che si lamentano dello schifo di quel ruolo?\n\nPerché l'essere brutto non implica che non sia funzionale, per loro è un lavoro, quindi brutto o bello lo fanno.\nComunque questo è palesemente ot e non è minimamente correlato al mio giochino: \"se il supp non piacesse a nessuno cosa faresti per risolvere\"","replies":[{"poster":"Amnoi","date":"2016-02-14T16:07:44.383+0000","up_votes":2,"down_votes":2,"body":"avere più gold=(per supp tank) avere oggetti per rimanere in vita e rompere le uova nel paniere al team nemico(support utility) comprare tutta quella serie di item,attivabili o meno che lo aiutano a dare utilità.\nIo ho capito che ti lamenti del fatto che non ci sono support io ti ho spiegato alcune delle cose che deve fare e del perchè non viene giocato\n\np.s. del tuo pps il supp non va modificato e la prova è che chi CONOSCE il gioco non se ne lamenta, se le persone la smettessero di flammare il supp e di dire che è inutile e chi gioca supp lo gioca per farsi carryare e che ,porco l'adeptus sororitas, capissero la sua utilità e magari, porco il dio imperatore morto sul trono d'oro, PROVASSERO  a giocare supp come va giocato ci sarebbero,secondo me, molti  più supp o almeno molte più persone che almeno ci provano a imparare qualche champ in quel ruolo.\n\n","replies":[{"poster":"Polarize","date":"2016-02-14T16:23:59.551+0000","up_votes":2,"down_votes":1,"body":"༼ つ ◕__◕ ༽つBAN༼ つ ◕__◕ ༽つBAN༼ つ ◕__◕ ༽つBAN༼ つ ◕__◕ ༽つBAN༼ つ ◕__◕ ༽つBAN༼ つ ◕__◕ ༽つBAN\n\n\nAggiungo: se dai più gold al ruolo \"support\" non ci trovi più i campioni designati come support ma sololaner vari(come si vede con i midlaner trasformati supp)","replies":[{"poster":"Amnoi","date":"2016-02-14T16:31:58.991+0000","up_votes":1,"down_votes":1,"body":"se un solo laner diventa un supp vuol dire che la riot, che voleva quel champ solo lane, deve rivederlo e modificarlo se lo vuole tenere nella solo lane","replies":[{"poster":"Polarize","date":"2016-02-14T16:50:23.097+0000","up_votes":2,"down_votes":1,"body":"Se il ruolo del support ha un gold income decente è inevitabile che i sololaner invadano la botlane, visto che per definizione funzionano meglio dei support se hanno risorse a disposizione, quindi il problema dei 10 maghi botlane che con il support hanno poco a che fare dipende dagli oggetti, difficilmente dipende dal campione.","replies":[{"poster":"Amnoi","date":"2016-02-14T17:00:49.413+0000","up_votes":1,"down_votes":1,"body":"Se un champ non può competere con altri champ giocati nella stessa linea cambierà linea finche non trova quella dove può fare quello che vuole","replies":[]}]}]}]},{"poster":"Ste the ripper","date":"2016-02-14T16:16:39.512+0000","up_votes":1,"down_votes":1,"body":"Non mi stavo lamentando:\n\n> Il mio era un giochino simile al \"se Hitler avesse vinto la guerra allora\" tu come tutti quelli che hanno messo -1 non lo avete minimamente capito e questa risposta ne è la palese dimostrazione.","replies":[{"poster":"Amnoi","date":"2016-02-14T16:19:57.329+0000","up_votes":1,"down_votes":1,"body":"ok allora se non ti stai lamentando togli il fatto che ti dico che ti stai lamentando,per il resto io ti ho detto che il ruolo del supp va bene così,non ha bisogno di modifiche,e non vedo come possa essere modificato e che non ci sono supp perchè tutti vogliono la barra del danno più lunga e più kill","replies":[{"poster":"Ste the ripper","date":"2016-02-14T16:22:05.332+0000","up_votes":1,"down_votes":1,"body":"è solo un gioco, ripeti con me: è solo un gioco.\nSe PER GIOCO il supp non piacesse a nessuno cosa si dovrebbe fare? Lasceresti un ruolo che non piace a nessuno? Cambieresti qualcosa? Se si cosa?\n\nForse prima della fine della giornata riesci a capire il punto della discussione...","replies":[{"poster":"Amnoi","date":"2016-02-14T16:43:06.689+0000","up_votes":1,"down_votes":1,"body":"Comunque il tuo commento sembra dare ragione al creatore del post ecco perchè i -1,secondo un piccolo bimbo speciale che non capisce che sta parlando con qualcuno che non è il creatore del post  {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Amnoi","date":"2016-02-14T16:29:34.573+0000","up_votes":1,"down_votes":1,"body":"Innanzi tutto ti devo delle scuse,ti avevo preso per il creatore del post, detto questo, devi rivere TUTTO il gioco,togli una parte fondamentale, dovresti rivere ogni adc, che sarebbe preda facilissima dei jungler, eliminare o rivisitare ogni champ rilasciato come support,ogni item da support oppure lo lasci","replies":[]}]},{"poster":"Polarize","date":"2016-02-14T16:26:15.967+0000","up_votes":1,"down_votes":1,"body":"Comprensione 0/10","replies":[]}]}]}]}]}]}]},{"poster":"Vileblood Pyke","date":"2016-02-14T13:25:24.872+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=bOgEP3XN,comment-id=00040001,timestamp=2016-02-14T11:20:45.624+0000)\n>\n>perché non rimuoverlo\n\nIl problema principale della frase è qui e non c'è periodo ipotetico che ti possa salvare.","replies":[{"poster":"Ste the ripper","date":"2016-02-14T13:57:20.310+0000","up_votes":2,"down_votes":1,"body":"Quindi SE a nessuno piacesse tu cosa proporresti?\nDai che pian pianino riusciamo a intavolare una discussione come i bimbi grandi...","replies":[{"poster":"Vileblood Pyke","date":"2016-02-14T15:49:06.168+0000","up_votes":2,"down_votes":1,"body":"Tanto per cominciare definirei cosa, in linee generali, deve fare un support (controllo dei nemici, difesa dei carry, potenziamento degli alleati ecc...) e renderei i support più interattivi, unici e divertenti da usare **a livello di kit**.\n\nPer quando riguarda maghi come Annie, Brand e Vel'Koz che vengono usati support, credo che il problema sia di questi personaggi e non del ruolo.","replies":[]}]}]}]},{"poster":"Ringiel","date":"2016-02-14T11:02:26.728+0000","up_votes":1,"down_votes":2,"body":"mi sa che è serio {{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"21CmOfPureHook","date":"2016-02-14T11:50:46.304+0000","up_votes":5,"down_votes":4,"body":"\"Giocare support non è un'esperienza divertente\"???  Intendi giocare MALE support senza pietra della visione, non proteggendo mai l'adc o apc che sia e dando colpa all'adc perché si lascia sempre uccidere?                                                Per curiosità quante volte hai giocato support seriamente? Con che champ sai andaro supp? In che elo ti trovavi/trovi?","replies":[]},{"poster":"kernel panic","date":"2016-02-14T11:52:03.943+0000","up_votes":3,"down_votes":2,"body":"Sinceramente preferisco aspettare 5-6 minuti di coda e trovare uno che giochi support in quanto main role, piuttosto che come le season scorse ci andava al 90% il povero cristo che finiva last pick e non aveva idea di cosa fare, o che troll pickava o chi più ne ha più ne metta.","replies":[]},{"poster":"lucanomax1994","date":"2016-02-14T14:01:41.089+0000","up_votes":3,"down_votes":4,"body":"***","replies":[{"poster":"Frattaglia","date":"2016-02-14T16:27:42.243+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=lucanomax1994,realm=EUW,application-id=MJVj50Jw,discussion-id=bOgEP3XN,comment-id=000b,timestamp=2016-02-14T14:01:41.089+0000)\n>\n> 74% winrate Janna here. {{champion:40}}\n\nio ho solo il 71%. Ti odio u_u","replies":[]}]},{"poster":"LightIsMyPath","date":"2016-02-14T18:04:18.937+0000","up_votes":2,"down_votes":1,"body":"Le code diventeranno sempre piu' lunghe se non trovano il modo di garantire ai \" secondi main support\" una minima % di partite garantita nel loro ruolo principale, stiamo tutti pian piano abbandonando il supp come ruolo secondario poiche' ci rende completamente impossibile giocare nel principale, quindi ci saranno sempre meno supporti in giro..","replies":[]},{"poster":"Immortal spax","date":"2016-02-14T17:17:53.019+0000","up_votes":2,"down_votes":1,"body":"Non a tutti piace avere uno score finale che è tipo 3/2/26, soprattutto con lo score finale che ti da A quando invece merita S++++\n\nÈ per questo che ci sono pochi support, poi quei pochi che ci sono vengoni sempre maltrattati o devo assistere a suicidi volontari per poi essere incolpati \"report sup\"\n\nSe vuoi giocare un determinato ruolo, metti come secondo sempre mid, se invece il tuo ruolo primario è mid, metti secondario top(visto che sono ugualmente richiesti)\n\nSenno fai il Blind pick e mal che vada giocherai Twisted Fate falso nueve, no cioè support.","replies":[{"poster":"GreenInch","date":"2016-02-15T08:20:44.986+0000","up_votes":1,"down_votes":0,"body":"Oddio con uno score cosi intesta mi viene in mente solo una cosa...ho carriato","replies":[]}]},{"poster":"Nibbio Bianco","date":"2016-02-14T16:28:56.196+0000","up_votes":2,"down_votes":1,"body":"Un consiglio: se trovi un amico che gioca support e fai duo, le partite le trovi prima.","replies":[]},{"poster":"Best Chair Euw","date":"2016-02-14T13:16:05.480+0000","up_votes":2,"down_votes":1,"body":"90-95%???LoooL.\nU mad bro?\nPrima dovevamo saper giocare tutti i ruoli, quindi ogni tanto metto ancora fill e non ho problemi","replies":[]},{"poster":"Capitan Mestolo","date":"2016-02-15T09:31:47.860+0000","up_votes":1,"down_votes":0,"body":"è per quello che io in ranked mi trascino un main Support :v\nproprio per evitare code lunghe ed avere il mio ruolo a portata di mano (?)","replies":[]},{"poster":"Darth Ponzius","date":"2016-02-14T14:42:18.485+0000","up_votes":2,"down_votes":2,"body":"Per me un intervento simile denota pochissima conoscenza dell'argomento e di questo genere di giochi.\nPrima di tutto il ruolo del support non è un'esclusiva di lol ne dei soli moba. Il personaggio di supporto esiste in tantissimi generi: il medico negli fps, l'healer negli rpg, mmo etc, quello che da buff ecc.\nDetto questo, come già ti hanno detto gli altri, non è stata la riot a stabilire che debba esistere un champ fisso vicino all'ad carry in fase di lane ma sono stati i giocatori e dopo di ciò la riot ha supportato questa struttura anche perchè era la più efficente e non provocava grossi sbilanciamenti (incomincia a pensare che ti è permesso usare la tua Fortune come glass cannon perchè c'è qualcuno che ti pare il culo e che la lane nel 80% dei casi la vince il support e non l'adc).\nBisogna poi anche considerare che il ruolo di support non è limitato al solo champ che sta vicino all'adc, ma viene spesso ricoperto anche dal jungler o dagli altri ruoli a seconda di meta e necessità.\nE non è neanche vero che nessuno voglia farlo, è una cosa che succede solo ad elo più bassi perchè tutti pensano che l'omino che ti tiene in vita, ti tanka, ti blocca gli avversari e ti da visione non sia quello che carria o non sia divertente perchè fa poche kill.\nQuindi l'idea da te proposta è a dir poco insensata.","replies":[{"poster":"GreenInch","date":"2016-02-15T06:15:38.506+0000","up_votes":1,"down_votes":0,"body":"E colpa di cod..tutta colpa di cod","replies":[]}]},{"poster":"GreenInch","date":"2016-02-15T05:59:31.663+0000","up_votes":1,"down_votes":0,"body":"E cmq la risposta e piu palese che mai visto che ultimamente becco supp senza oggetti da supp ma  improntati a fare danni,lux supp che startano di doran e come primo item chiudono il luden per citarne una,brand stassa storia e stesso discorso per i tank.poi se il resto del team è  furbo sfrutta pink  e il comodissimo trinket giallo e blue per wardare...ho giocato morgana mid(ho startato con l item da supp e l ho chiuso con l'occhio dell osservatore,non mi ricordo come si chiama)alla fine il supp con vision era il midlaner :)","replies":[]}]}