{"poster":"Jungle Paws","date":"2015-03-09T20:23:23.837+0000","title":"Tips for a Gold Jungle/Top Main who wants to learn Skarner and Nunu","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"Accepting all help big or little. Thanks Guys! :)","replies":[{"poster":"RetroRage96","date":"2015-03-09T21:01:16.011+0000","up_votes":4,"down_votes":3,"body":"Don't try to learn Skarner. He is garbage right now, and he won't be changed any time soon.\n:( Makes me sad.","replies":[{"poster":"Riot 10YearSanta","date":"2015-03-09T23:27:10.214+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=RetroRage96,realm=NA,application-id=WEuoGbmp,discussion-id=52EwjLZm,comment-id=0000,timestamp=2015-03-09T21:01:16.011+0000)\n>\n> Don't try to learn Skarner. He is garbage right now, and he won't be changed any time soon.\n> :( Makes me sad.\n\nI disagree, I think Skarner is strong right now.  He's particularly good vs double AD comps (as long as one of them isn't blue Ezreal) and generally high phys dmg teams.\n\n> [{quoted}](name=Jelly Mac,realm=NA,application-id=WEuoGbmp,discussion-id=52EwjLZm,comment-id=0001,timestamp=2015-03-09T21:10:13.235+0000)\n>\n> Mobility already screws skarner over, and the mana regen changes straight-up crippled him. He's fun, but unusable in competitive play. Not worth learning until he gets buffed.\n\nThis argument is flawed, it doesn't matter if Skarner is viable in competitive play - OP isn't in the LCS.  He's certainly harder to do well with than someone like Xin, who has a targeted dash, but that doesn't mean he's not worth learning.\n\n@ImperialArm Coro: I use a combination of AS/AD reds and purples for Skarner, taking flat armor yellows and scaling mr blues.  For runes I run 9/21/0.  I like to rush the purple machete upgrade and then build into something like thornmail.  Note that I generally like to play Skarner into heavy physical damage teams - he's REALLY strong against Yasuo for example.  Other than that he gets a lot of value out of Triforce or Iceborn.  If I'm tanky but need a combination of damage and tankiness for my 6th item I like gunblade.  I'm not sure if it's a popular choice, or even a good choice, but it makes sense to me.","replies":[{"poster":"Kobold","date":"2015-03-09T23:55:51.091+0000","up_votes":3,"down_votes":0,"body":"Warning: OPINION\n\nThe problem is he has an even harder time in the jungle now then ever, coupled with him losing his sustain in his rework, all his movement speed being ramp ups which is terrible against any thing with a slow (most ADCs). He has nothing other than his tankyness and ult to bring to the table but even these are not good enough when you could play xin, lee, vi, even Jax jungle and be as tanky with more damage and more utility all while having built in sustain for xin and lee, and gapcloses on all of them. Skarner's MS boosts should never have been ramp ups as they don't have ramp downs instead they just stop. From what I have seen even Olaf is better at getting at his objective targets than Skarner right now.","replies":[]},{"poster":"ChimeiTekinaNasu","date":"2015-03-10T15:06:28.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot PhillyBrew,realm=NA,application-id=WEuoGbmp,discussion-id=52EwjLZm,comment-id=00000000,timestamp=2015-03-09T23:27:10.214+0000)\n>\n> If I'm tanky but need a combination of damage and tankiness for my 6th item I like gunblade.  I'm not sure if it's a popular choice, or even a good choice, but it makes sense to me.\n\nlol Gunblade. You should try GA or Frozen Mallet as 6th item on Skarner. I went Frozen Mallet on him before at 6th item when I had enough gold and was near the end. Cause why not have a perma slow. =P","replies":[]}]},{"poster":"kitcat300","date":"2015-03-10T00:48:00.031+0000","up_votes":1,"down_votes":0,"body":"He got buffed on the pbe, as well as other tank junglers.","replies":[]},{"poster":"Messaiga","date":"2015-03-10T00:19:57.666+0000","up_votes":1,"down_votes":0,"body":"Don't say bad of my main pls.  I find him great right now, and the next coming patch (5.5) has only the potential to make him better.  He's kind of hard to understand since you have to position differently and your role varies throughout the game.  \n\nHe goes from a CC-bot (like a support) to a fighter (high sustained damage, pretty tanky), to a tank throughout the game.  If you can get a few ganks off you can snowball your team to victory, and he can be very versatile (works well with many different builds).  He also survives well in the current jungle, able to clear the whole jungle without needing to recall.\n\nFor runes take AD Marks, AS Quints, Armor Seals, 6 flat CDR blues + 3 others of your preference.  I have a rather odd mastery page for Skarner, but its preferable for me.  I take him 7/14/9.\n\nedit: PhillyBrew brings up a good point, he's very strong versus heavy physical damage teams because of his synergy with armor + mana + CDR items.","replies":[]}]},{"poster":"B3ER","date":"2015-03-09T23:39:16.451+0000","up_votes":2,"down_votes":0,"body":"Playing Nunu correctly consists of the following parts in this order:\n1. Get Nunu Bot skin\n2. Bind /laugh to a spammable button\n3. Learn to Snowball\n4. ??????\n5. Profit","replies":[]},{"poster":"Only Play Darius","date":"2015-03-09T21:10:13.235+0000","up_votes":2,"down_votes":0,"body":"Mobility already screws skarner over, and the mana regen changes straight-up crippled him. He's fun, but unusable in competitive play. Not worth learning until he gets buffed.\n\nComing from a former skarner main.","replies":[]},{"poster":"Mindslaver","date":"2015-04-07T22:39:11.691+0000","up_votes":1,"down_votes":0,"body":"dont play those champions... play {{champion:17}} instead! :)","replies":[]},{"poster":"Masalar","date":"2015-03-09T23:41:57.071+0000","up_votes":1,"down_votes":0,"body":"Can't speak much for Nunu, but Skarner is interesting right now. I feel he is actually a bit more of a late game carry sort of jungler than the early game ganker he used to be. Once Skarner gets several items, and, of course, Frozen Gauntlet, he turns into a really scary beast. My recommendation is that, if  you want to play him, power farm to 6, and then gank whenever your ult is up. Even better, try and play him with a non mana using mid laner, 'cuz Skarner loves him some blue buff.\n\nGet the devourer jungler buff if you think you can make good use of it, early Mobi boots for ganks and that's about all I got. He's not a super hard jungler (as long as you have mana) but he takes a while to get going. So fun once he reaches that point though.\n\n\n\n\nI assume for nunu you just run into the enemy jungle, smite consume and run out laughing.","replies":[{"poster":"Masalar","date":"2015-03-09T23:44:20.163+0000","up_votes":1,"down_votes":0,"body":"Or the Iceborn Gauntlet, if, you know, you can read the actual name unlike me.\n\nNinja edit to spell the name right. Again. Sigh","replies":[]}]}]}