{"poster":"Sir Chugs","date":"2017-02-12T02:41:11.358+0000","title":"Match found/accepted freeze","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Queue for game.  Accept game.  Wheel stops counting down and goes full.  Then....nothing.  Currently running the full repair; but this is a seriously uncool bug; especially considering that I still get the queue penalty.  \r\n\r\nHelp me, Rito, you're my only hope.","replies":[{"poster":"KmrKing","date":"2017-11-01T09:27:57.958+0000","up_votes":1,"down_votes":0,"body":"I have  been having these issues like crazy lately. Now, I am aware fully that my internet connection is absolutely fine and has no interference whatsoever. I've been getting penalties for leaving the game, when I have not left a single one, and every time it is due to interface freezing. I tried repairing, changing internet settings, re-installing - nothing worked.\nAdditionally, I have issued a ticket to riot - no response, ticket dismissed. \nPlease, help me fix this problem, because I cannot play this game anymore. \nI am writing this now, after receiving 6 in a row freezes and a 20minute penalty - THANKS RITO :(","replies":[{"poster":"KmrKing","date":"2017-12-02T16:52:52.130+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KmrKing,realm=NA,application-id=osqw6G4M,discussion-id=f0z0XYNA,comment-id=0003,timestamp=2017-11-01T09:27:57.958+0000)\n>\n> I have  been having these issues like crazy lately. Now, I am aware fully that my internet connection is absolutely fine and has no interference whatsoever. I&#x27;ve been getting penalties for leaving the game, when I have not left a single one, and every time it is due to interface freezing. I tried repairing, changing internet settings, re-installing - nothing worked.\n> Additionally, I have issued a ticket to riot - no response, ticket dismissed. \n> Please, help me fix this problem, because I cannot play this game anymore. \n> I am writing this now, after receiving 6 in a row freezes and a 20minute penalty - THANKS RITO :(\n\nI am writing again, just to extra-bump this, as I keep getting increasingly worse lagg issues via champion select with not a single solution whatsoever. \nIt's also annoying as I keep getting penalties for leaving, even though I have nothing to do with the issue.{{champion:32}}","replies":[]}]},{"poster":"Monster in Bush","date":"2017-02-14T06:06:52.713+0000","up_votes":1,"down_votes":0,"body":"This happens to me and my girlfriend all the time after the last patch.  We sat in queue for 4 minutes had to re-queue and it happened again after somone dodged with 2 seconds left in lobby.  Please address this.","replies":[]},{"poster":"Targons Blade","date":"2017-02-13T03:50:09.664+0000","up_votes":1,"down_votes":0,"body":"These issues usually pop up if you have a **poor connection** to our matchmaking servers. This could be for a number of reasons, however, incompatible network settings are the primary culprits. You should be able to resolve this by working through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) in its entirety.\n\nIf you run into further issues with this, let me know.","replies":[]},{"poster":"SilentSphinx","date":"2017-02-12T22:05:30.657+0000","up_votes":1,"down_votes":0,"body":"I'm glad I'm not the only one experiencing this. It is quite annoying being kicked from match finding after you have accepted, then it freezes, tells you: \"a player has declined matchmaking\" but you cannot accept the new match because your old one is still frozen and then you get kicked.","replies":[]}]}