{"poster":"Rïnzler","date":"2016-03-26T17:04:15.888+0000","title":"[HEXTECH CRAFTING] Come funzionano esattamente i drop forzieri e chiavi?","subforum":"Discussioni generali","up_votes":6,"down_votes":6,"body":"Dalle informazioni che ho acquisito, pare che il drop funzioni così:\r\n\r\n- **Chiavi**: vengono assegnate a tre giocatori in modo casuale a fine game;\r\n- **Forzieri**: li si ottiene quando tu o un tuo compagno in premade prende un voto S o superiore a fine game.\r\n\r\nSono tipo due giorni di fila che non ho ottenuto nessuno dei due.\r\nPer caso il drop forzieri è anch'esso casuale? Abbiamo ricevuto S svariate volte ma nulla.","replies":[{"poster":"Rïnzler","date":"2016-03-26T18:31:03.563+0000","up_votes":3,"down_votes":0,"body":"Ok, aggiorno il fatto.\nUn paio di volte mi è apparso il messaggio che sono inagibile dall'ottenere premi data una chat ristretta del mese scorso....\nOra, va bene tutto, ma che mo' pretendono di non darti cose che fanno parte di una modalità di gioco per sta cavolata è davvero eccessivo.\nGià sono un avvertimento per i premi di fine season, adesso pure per eventi che non la riguardano? Ma per favore.\nMi han riferito che ci vogliono due o tre mesi prima che possa ricever premi dalla punizione.\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Groox II","date":"2016-03-26T18:38:45.897+0000","up_votes":1,"down_votes":0,"body":"Leggi la guida \"**[Guida + Q&A] Hextech Crafting**\" di NiraBlade fatta 8 giorni fa dove già risponde alle tue domande. Fatta appositamente per evitare che la gente faccia proprio come hai fatto te.\nE' la prima nella sezione \"Discussioni Generali\".","replies":[{"poster":"Rïnzler","date":"2016-03-26T20:40:05.598+0000","up_votes":2,"down_votes":0,"body":"Ora guardo. Grizie mille!","replies":[]}]}]},{"poster":"NIGERUNDAYO JoJo","date":"2016-03-26T17:22:31.523+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, a me sembra che il drop sia abbastanza facile.\nDa ieri a oggi ho già preso i 4 forzieri spammando una marea di S e S+ sia in normal che ranked (mi sembra strano, prima non riuscivo a prenderne manco una) e per i frammenti di chiave..fin ora ne ho droppati 4-5, una partita si e una no. Sempre e solo 1 però lol","replies":[{"poster":"DuckQuack0","date":"2016-03-26T17:38:50.892+0000","up_votes":1,"down_votes":0,"body":"anche io giuro, su 30 partite minimo 20 ho preso S\nprima era quasi impossibile xD\n\nInoltre ho già i 4 forzieri, e fino ad ora 8 frammenti chiave","replies":[]}]},{"poster":"DuckQuack0","date":"2016-03-26T17:07:56.591+0000","up_votes":1,"down_votes":0,"body":"CI sono un'infinità di post uguali...\n\nComunque,\n- le chiavi vengono assegnate da 0 a 3 ad ogni VITTORIA, il drop rate è casuale, puoi prenderne 0 in 10 partite, o 10 in 5 partite\n- i forzieri si ottengono solo se vinci e qualcuno prende S-, S, S+, non si può avere più di UN forziere OGNI CHAMP per TUTTA LA SEASON\n\nQuindi se prendi S con Yi, non ne riceverai un altro se giochi sempre Yi, stesso vale per il tuo team, tu non ne riceverai altri","replies":[]},{"poster":"Piemoo","date":"2016-03-26T18:06:24.324+0000","up_votes":1,"down_votes":1,"body":"Ma l'unico che chiude con 0/1/24, partecipazione alle kill dell'80%, 39 mie wards contro le 40 totali del team nemico e altre belle cose e prende A+, sono io? Questo è solo un esempio, ma capita spesso ormai...Vabbe che ho già preso la cesta con questo campione, quindi pace del voto S, ma tantè...","replies":[]},{"poster":"Demigod Summoner","date":"2016-03-26T17:08:40.451+0000","up_votes":1,"down_votes":3,"body":"Forzieri 100% con un minimo di S- tu o premade.\nChiavi 0,00000000000000000000000000000001% quando vincete con uno scarto di 30 kill in 19 minuti","replies":[]}]}