{"poster":"marmota159","date":"2018-09-29T16:07:00.623+0000","title":"Es un chiste esto, por que me posicionaron en oro?, todavia no esta activado el hierro?","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":4,"body":"https://imgur.com/a/UbdpJ7i\r\n\r\nAhi mismo muestra, perdi 7 gane 3, oro 5, es un chiste?, tendria que haber quedado en bronce, no es queja, me parece simplemente estupido, con razon oro y platino parece bronce, si perdes 600 partidas y te colocan asi...\r\n\r\nA mi las flex me chupan 3 garompas, yo las uso para probar champs, y como normales reclutamiento, cuando no esta normal reclutamiento, juego flex, me importan las SoloQ nada mas.\r\n\r\nNo vengo a leer moralistas, solo vine a demostrar que el posicionamiento es una japi jajaja","replies":[{"poster":"Tortuguita","date":"2018-09-29T16:35:40.422+0000","up_votes":2,"down_votes":2,"body":"Es flex, no worries","replies":[{"poster":"marmota159","date":"2018-09-29T17:03:38.761+0000","up_votes":5,"down_votes":5,"body":"***","replies":[{"poster":"Tortuguita","date":"2018-09-29T19:34:13.999+0000","up_votes":2,"down_votes":1,"body":"¿Estamos bien? No sé si realmente estas haciendo una broma o algo por el estilo pero tal vez no sabes que flex no tiene el mejor matchmaking por ello te dejan en ese tipo de liga. Mejor intenta informarte antes de hacer estos post que no llevan a ningún lado.\n\nLa mejor parte es \"Tengo 700 cuentas\" te humillas solo xD","replies":[{"poster":"marmota159","date":"2018-09-29T19:37:23.689+0000","up_votes":1,"down_votes":0,"body":"El idiota de Emillior... esta en Corea, jugo las 10 en vivo en un dia, en un stream jugo las 10 primeras de posicionamiento de SoloQ, gano las 10. \n\n100 % veridico, estan los videos, 100 % comprobable, lo dejaron en bronce 3, ganando las 10 partidas, que decias?","replies":[{"poster":"Tortuguita","date":"2018-09-29T19:47:51.420+0000","up_votes":1,"down_votes":0,"body":"¿Y? ¿Acaso no sabes que también depende tu rendimiento en las partidas? Gané 8 de las 10 y quede en oro 4 con Kha'zix teniendo mas de 120 kills acumuladas en total. \n\nbtw, no tenemos idea de como funciona el server de korea pero eh good point.\n\nNo sé por que lo toman con tanto furor a esto si al final todos van a estar en donde deben con el tiempo, da igual que llegues un poco mas arriba te emparejan con gente mejor y la suerte que estuviste no te va salvar.","replies":[{"poster":"marmota159","date":"2018-09-29T19:59:51.977+0000","up_votes":1,"down_votes":2,"body":"Habra salido con mal score en 2 partidas, DOS NOMAS, y mal score es 4/5. No 1/8.\n\nLleva ahora mismo, 31W y 0L, te parece logico que este en plata 4?, mira que me da terrible asco el chabon ese, pero es estupido, minimo tendria que estar en platino, minimo, la primera colocacion oro 2 minimo merecia.\n\n\nPD: Por mas que intentes ofenderme (dale somos grandes 5 años jugando, me fume un monton de gente como vos) diciendo \"la suerte que estuviste no te va a salvar\", no vas a ofenderme bro, porque en mi cuenta termine 3 season en diamante, y aun estando inactivo 5 meses, que deje el juego porque me pudrio, sigo en platino me bajaron de d3 a platino 5 con 40 lp.\nSe que si quisiera jugar de nuevo este juego de mierda, con comunidad rata, juego basico y con graficos de paint y quisiera subir mas, en 1 semana que vuelvo a practicar y despues de esa semana, me toma 2 semanas llegar a diamante de nuevo o mas. salu2.","replies":[{"poster":"Tortuguita","date":"2018-09-29T21:30:54.473+0000","up_votes":2,"down_votes":0,"body":"JAJAJA Que rapido sacas de contexto todo, al parecer todo tiene que referirse a ti. Dije \"No sé por que lo toman con tanto furor a esto si al final TODOS van a estar en donde deben con el tiempo, da igual que llegues un poco mas arriba te emparejan con gente mejor y la suerte que estuviste no te va salvar.\" Me refería a que quienes suben a lugares donde \"no merecen\" e \"infectan gold y platino\" de todas formas van bajar si tenian solamente la suerte para ganar esas partidas.\n\n¿Ofenderte? Lo hiciste tu mismo insultando y diciendo \"me da igual el castigo tengo 700 cuentas\". Hay que pensar antes de escribir xD","replies":[]},{"poster":"Falkon","date":"2018-09-29T20:19:02.778+0000","up_votes":1,"down_votes":0,"body":"¿Hay fuente?","replies":[{"poster":"marmota159","date":"2018-09-29T21:40:58.472+0000","up_votes":1,"down_votes":0,"body":"Si toma \nhttps://www.piedra-artificial.es/images/blog/mejorar%20jardin%20con%20fuente.jpg","replies":[{"poster":"Falkon","date":"2018-09-29T21:56:03.696+0000","up_votes":1,"down_votes":0,"body":"Que linda fuente, ahora ¿Hay monumento?","replies":[{"poster":"marmota159","date":"2018-09-29T22:57:19.768+0000","up_votes":1,"down_votes":0,"body":"https://upload.wikimedia.org/wikipedia/commons/7/79/Buenos_Aires_-_Monumento_Bartolome_Mitre.jpg","replies":[{"poster":"Falkon","date":"2018-09-29T23:32:35.695+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias che","replies":[{"poster":"marmota159","date":"2018-09-29T23:37:02.333+0000","up_votes":1,"down_votes":0,"body":"De nada loquito","replies":[]}]}]}]}]}]}]},{"poster":"WhiteMax","date":"2018-10-01T16:24:41.208+0000","up_votes":1,"down_votes":0,"body":"Al sistema no le importa tu score, solo victorias y derrotas. Y las placement toman en cuenta donde quedaste el año pasado.","replies":[{"poster":"Tortuguita","date":"2018-10-01T16:37:09.281+0000","up_votes":1,"down_votes":0,"body":"Lamento discrepar pero en mis 2 smurfs gane exactamente 8 victorias y tan solo por mis scores, uno era mas elevado que el otro, me pusieron dos divisiones mas arriba.","replies":[{"poster":"WhiteMax","date":"2018-10-01T23:50:10.159+0000","up_votes":1,"down_votes":0,"body":"Eso no prueba nada, es solo una suposicion. Lo de victorias y derrotas,mmr, etc lo dijo Riot.\n\nTienes link o conocer alguna info donde Riot habla de lo que tu planteas? porque si de verdad el score influyese la gente solo iria Kha Zix, hace pura KS y listo.","replies":[]}]}]}]}]}]},{"poster":"POETA DEL RAYO","date":"2018-09-29T21:29:02.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=marmota159,realm=LAS,application-id=J8qpiO2I,discussion-id=IRXtAgtx,comment-id=00040000,timestamp=2018-09-29T17:03:38.761+0000)\n>\n> Sos mogolico? no en serio, te pregunto en serio, sos mogolico? eu posta PERO SOS MOGOLICO?, acabo de decir yo, ES FLEX, y venis y decis: &quot;Es flex&quot;, SOS MOGOLICO?, o te daban kerosene en la mamadera de chico?\n> \n> PD: Te lo aclaro porque veo que sos mogolico de verdad, me chupa 3 kilometros de pija el ban del foro, tengo 700 cuentas mas.\n\n{{sticker:darius-angry}}\n\n\nChe te olvidaste de ser xenofobico, te falta todavía...","replies":[]},{"poster":"EpicHit","date":"2018-09-29T18:48:56.082+0000","up_votes":1,"down_votes":1,"body":"Que te pasa?\nTe violaron de chiquito?\nTe pegaba tu papa?\nNo te quiere la chica que te gusta?\nTenes 20 años y seguis virgen?\nQue te pasa? Por qué tan enojado con la vida?","replies":[{"poster":"marmota159","date":"2018-09-29T19:37:48.993+0000","up_votes":1,"down_votes":0,"body":"Bro eso le afecta a los otakos jajaja buen intento igual jaja","replies":[]}]},{"poster":"Falkon","date":"2018-09-29T17:59:18.759+0000","up_votes":1,"down_votes":1,"body":"Esa cuenta tranquilamente la pudiste haber usado el año pasado y terminar mas de oro, no worries, es flex.","replies":[]}]}]},{"poster":"0nlyRenektonSolo","date":"2018-09-29T16:19:19.280+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"marmota159","date":"2018-09-29T17:04:21.322+0000","up_votes":1,"down_votes":1,"body":"Como llegas a la deduccion que soy nuevo genio de las conclusiones?","replies":[]}]},{"poster":"escorpion023","date":"2018-09-29T22:45:21.778+0000","up_votes":1,"down_votes":0,"body":"Yo gane las 10 de posicionamiento y me pusieron en bronce 2 :v","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-09-29T21:21:30.853+0000","up_votes":1,"down_votes":0,"body":"Que raro, yo gane 3 y me dejaron en bronce 3...\n\n\nAhora comprendo que no es solo ganarlas, también son las estadísticas, es obvio que alguien como yo no da la talla de un platino, con solo mirar el triangulo que muestra las estadísticas te das cuenta de eso, gracias a la posibilidad de comparación que tiene lol. \n\nSupongo que lo que te pasó fue que tu estadística triangular fue la de un oro.","replies":[]},{"poster":"Jeremías 17 5","date":"2018-09-29T19:21:45.870+0000","up_votes":1,"down_votes":0,"body":"Explícame porque en una cuenta que estaba silver 1 con 20 partidas (o algo mas, no recuerdo), en la que gane 6 y perdi 4 de posicionamiento, quedo en oro 4. Y en otra cuenta que era Oro 5 con mejor win rate, mas partida, mejor mmr, etc gane 5 perdi 5 y me dejaron en plata 2?... El sistema de posicionamiento de este juego es una basura... Espero que esto del \"Hierro\" solucione algo, porque no creo que sea complicado armar un buen sistema de rankeos...","replies":[]},{"poster":"Urxnium","date":"2018-09-29T18:42:30.792+0000","up_votes":1,"down_votes":0,"body":"Es flex, puede pasar de todo ahí.","replies":[]},{"poster":"Gorila","date":"2018-09-29T18:00:18.888+0000","up_votes":1,"down_votes":0,"body":"yo en solo q en mi otra cuenta, tenia mmr de oro 2 y llevaba 7 ganadas y 3 perdidas y me pusieron en oro 5 :C","replies":[]},{"poster":"AJ             J","date":"2018-09-29T16:25:48.777+0000","up_votes":1,"down_votes":0,"body":"Depende del MMR global de las partidas donde jugaste.\n\nAunque hayas perdido varias, tal vez el matchmaking te hizo jugar con un MMR acorde a Oro 5 (ademas, todas las subdivisiones \"5\" son practicamente la \"1\" de la categoria inferior).","replies":[]},{"poster":"Lee Sin Ver Esto","date":"2018-09-29T16:19:45.931+0000","up_votes":1,"down_votes":0,"body":"es flex ahi pasa de todo, te cuento q en soloq gane 2 y me dejaron en silver2 lo encuentro injusto era una cuenta nueva {{champion:32}}","replies":[]},{"poster":"Mazoku","date":"2018-09-29T16:22:30.248+0000","up_votes":2,"down_votes":2,"body":"Es flex, la liga no importa ahi.\n\nDicho esto, no veo problema.","replies":[]}]}