{"poster":"justRhymZ","date":"2017-05-30T20:38:47.599+0000","title":"Runen","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Es wurde ja jetzt angek&uuml;ndigt, dass die neuen Runen kostenlos sind. W&auml;re es nicht etwas fairer den Spielern f&uuml;r die bereits gekauften Runen etwas IP zur&uuml;ckzugeben? Und wenn es nur 50% sind","replies":[{"poster":"Oriius","date":"2017-05-31T11:05:04.999+0000","up_votes":2,"down_votes":0,"body":"hat riot doch schon alles gesagt das die sich dafür was einfallen lassen werden sowie auch neue ausgabemöglichkeiten für IP\n\n\nich halte allerdings diese neue rune die überschüssige heilung in schilde umwandelt vom hören her schon für verdammt broken. kann dir ne soraka dann wohl nen 3k leben schild verpassen? xd ","replies":[]},{"poster":"ObitheAce","date":"2017-07-20T20:57:55.680+0000","up_votes":1,"down_votes":0,"body":"da ich aus welchem grund auch immer nicht unter den beitrag posten kann kommts jetz hier ;D\n\n\n\n\n**Hallo**\nich äußere mich sehr selten in den Kommentaren, dennoch wird es mal zeit xP\nich finde die idee mit dem neuen runensystem gut (die frage is natürlich wie wird das ergebnis sein ;D) \ndie \"Belohnung\" für die die schon ep ausgegeben haben wird denk ich mal auch nicht einfach mit \"dann bekommt er die ep einfach zurück\" getan sein\nweil viele die viele runen haben haben auch viele champions\nwird wohl kaum leute mit 16 champs und allen runen geben\ndiese werden sich dann ja wohl \"ungerecht\" behandelt fühlen (obwohl dies wohl am fairsten sogar wäre^^)\n\n\nund ihr wollt sicher alle runen schon von beginn an freischalten (ich denke mich zu erinnern dies - in einem anderen artikel - gelesen zu haben) \nich war zu beginn meiner league zeit schon überfordert jedes lvl 1ne masterie zu steigern :D \nwäre es nicht sinnvoller zu sagen ab einem bestimmten lvl (zb 20) bekommt man alle runen (vllt gibts dazu ein mini tutorial) und leute unter diesem lvl werden ausschließlich mit leuten unter diesem lvl gematchd? (ich will euch da nicht reinreden - werde wahrscheinlich nicht mehr in solch eine situation kommen^^)\n\n\nich hoffe ihr schaut euch die grundwertveränderungen sehr genau an, da bisherige grundwertänderungen bisher immer sehr viel geändert haben und oft aus nem kleinen nerv einen doch sehr großen gemacht haben und umgekehrt\nvllt wird dafür ja eine weitere \"runenspalte\" angelegt in der man sich entscheiden kann zwischen rohen werten und einer flatrate wie bisher (nach dem motto: entweder early rocken und late schocken oder andersrum :D)\n\n\ndes weiteren fand ich das mit der keystone masterie damals nur geil und bei dem runensystem wird die keystonemasterie quasi durch die wahl des \"trees\" gewählt?!\n\n\nim aktuellen patch wär dorans dolch meines erachtens zu stark (wie es später dann aussieht ist fraglich - falls er später jedoch \"normal\" stark ist müssen dann auch \"alle\" alten items angepasst werden?!)\n\n\n**vielen Dank für die Aufmerksamkeit**\nwar doch recht viel zu schreiben deswegn sry für schreibfehler und dass meine zeichen sowie groß und kleinschreibung \"kaputt\" *hust* sind\n** liebe und verehrte grüße obi**","replies":[]},{"poster":"BigSnipe","date":"2017-05-30T20:53:11.689+0000","up_votes":1,"down_votes":0,"body":"Ja, es wäre fairer. Vielleicht wird Riot sowas ja machen. \n\nEs ist aber auch etwas schlecht, denn dadurch gibt es wieder eine IP Inflation und dann werden viele wieder jammern, weil sie so viel IP über haben und nichts damit machen können. \n\nDaher sollte Riot sich auch eine Möglichkeit einfallen lassen, mit der die Spieler ihre IP ausgeben können. /Oder eine Funktion mit der mann IP verschenken kann.","replies":[{"poster":"Die Todesfaust2","date":"2017-05-31T07:37:14.491+0000","up_votes":1,"down_votes":0,"body":"Ja das wäre gut weil viele haben heutzutage sogar schon zu viel IP übrig und wissen nicht wohin damit daher finde ich die funktion mit dem verschenken an andere spieler gar nicht so schlecht sondern würde es sogar begrüßen wenn Riot das tatsächlich machen sollte.","replies":[{"poster":"Irukao","date":"2017-05-31T10:35:27.089+0000","up_votes":1,"down_votes":0,"body":"IP verschenken fände ich nicht gut, wenn dann Runen. Leute, die zu viel IP haben, haben sich ihre IP über Jahre hinweg erspielt und verdient. Dass man \"so langsam\" an Champions kommt hat den Sinn, dass man seine bisherigen Champions lang genug spielen muss, um an andere zu kommen. Wenn ein Level 20er jetzt 100k IP geschenkt bekommt, weil sein Freund seit der Beta oder so spielt, kann er sich alles holen, was auch nicht dieses \"sich Verdienende\" hat. \nRunen dagegen sind in meinen Augen nicht wie Masteries, quasi als Ziel für ein Level-UP, sonder eher.. ich weiß nicht, sich die zu kaufen hat nichts wirklich Belohnendes, finde ich. Die können meinetwegen auch geschenkt werden.\n\nDagegen neue Sachen, die man sich mit IP kaufen kann oder eine IP-Rückerstattung für die Runenkosten, halte ich für nicht unsinnvoll. Ich könnte es verstehen, wenn man zweiteres nicht umsetzt, aber es für schlecht befinden tu ich auf keinen Fall.","replies":[]}]}]},{"poster":"zoroyashie","date":"2017-05-31T08:35:16.959+0000","up_votes":1,"down_votes":0,"body":"Lieber 1/4 in rp zurückgeben.","replies":[]},{"poster":"Samus Saran","date":"2017-05-31T01:25:14.693+0000","up_votes":1,"down_votes":0,"body":"Schau dir nochmal aufmerksamer das Video von Riot an, dann wirste hören das er sagte das sie Spieler entschädigen werden (wie noch unbekannt), die schon viele EP ausgegeben haben für Runen.","replies":[]}]}