{"poster":"BEAR IRL","date":"2017-02-08T19:56:12.697+0000","title":"Bin ich plötzlich Silber ?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"War letzte Season Platin 5 hatte maxrank platin 2.\r\nneue season startet ich bin auch wieder z&uuml;gig platin geworden.\r\nseit paar tagen nurnoch loss, meine mmr laut op.gg silber 1 kann auf einmal kaum spiele gewinnen, kleinste fehler f&uuml;hren instant zu einem loss.\r\nnu frage ich euch bin ich innerhalb von 5 tagen von einem soliden platin zu einem silber spieler geworden ? \r\nmittlerweile bekomme ich pro win 14 punkte und irgendwie frag ich mich was da pl&ouml;tzlich los.","replies":[{"poster":"TerrorRaven","date":"2017-02-08T19:58:08.438+0000","up_votes":2,"down_votes":0,"body":"Den Angaben von op.gg kann man nicht wirklich trauen, da die nur geschätzt sind und zum Teil sehr von der wirklichen MMR abweichen.\nMach am Besten eine Pause von LoL.","replies":[]},{"poster":"Leylania","date":"2017-02-08T20:22:10.171+0000","up_votes":2,"down_votes":1,"body":"Ich glaube eher, dass das gerade nur ne üble Losing Streak bei dir ist. Manchmal hat man einfach Phasen in denen man furchtbar spielt und kaum gewinnt, das hat jeder mal. Mach ein paar Tage Pause und versuch es dann mit kühlem Kopf nochmal. \nMeine MMR ist laut op.gg auch im Silber Bereich, trotzdem spiele ich jedes Spiel mit hohes Plat - Master Leuten, ich würde da also nicht zu viel drauf geben.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-02-09T01:03:51.785+0000","up_votes":1,"down_votes":0,"body":"Zunächst mal solltest du OP.gg weniger trauen als... nun ja.. deinen Augen... Wenn die Spieler um dich herum allesamt nur noch Silberrahmen haben, dann ist es offiziell: Du bist jetzt so gut wie die Silber Spieler der letzten Saison. Solange da noch 3 von 4 mit Platin-Rahmen rumrennen, ist alles in Ordnung. Darauf lege ich persönlich gerade nach dem Reset mehr wert als auf die Liga, in der ich gerade bin. Und das hat mir in dieser Saison sehr geholfen...\n\nAber um mal zum eigentlichen zu kommen: Ja, kann sein. Die MMR hat halt so ihre unberechenbaren Eigenheiten...\n\nDas wichtige ist... jetzt nicht zu tilten. Also ja, anscheinend verlierst du gerade erstaunlich viele Ranked Games. Was wiederum auch nur bedeutet, dass dein Einfluss auf deine Ranked nicht positiv genug ist. Was wiederum auch nur bedeutet, dass du Stand jetzt eben nicht besser bist als die Gegner, die du schon mal dominiert hast.\n\nDiese Erkenntnis sagt sich so leicht daher, wenn sie einen selbst nicht betrifft. Aber ich hatte letztes Jahr genau dasselbe Problem wie du: Ich steckte irgendwo zwischen Gold V und IV fest und war am Ende mega tilted. Habe innerlich nur auf meine unfähigen Mitspieler geflucht, die mich schon wieder nach Gold V haben absteigen lassen...\n\nBis ich dann irgendwann nach 3 Monaten anerkannt hatte, dass ich Stand Juni 2016 einfach nicht besser war also irgendwo zwischen Gold V und IV. Als ich diesen Schritt für mich selber endlich gegangen bin, konnte ich auch wieder daran arbeiten, meine eigenes Spiel zu verbessern und dadurch Spiele für mein Team wieder positiv zu gestalten. Und so landete ich fast noch auf dem Niveau der Vorsaison und bekam wieder meinen Platin Rahmen.\n\nWenn mich diese Erkenntnis nicht irgendwann hart getroffen hätte, wäre ich ewig in Gold IV geblieben.\n\nWoran es jetzt liegt, dass du das Niveau, dass du von dir gewohnt bist (also Platin) derzeit nicht erreichst, kann ich dir halt auch nicht sagen. Wir reden von dem Niveau, auf dem ich selber mit Mühe und Not bin, da fällt es schwer Urteile über andere abzugeben. Ich würde dich spontan fragen, ob du letztes Jahr auch keine Pink Wards gekauft hast, wie du es derzeit tust... ich ging davon aus, dass dies in Platin II Standart wäre... (BTW, OP.GG gibt mir bei dir Platin V als Ende der letzten Saison an... just saying... Vielleicht ist dein Skill-Decay gar nicht so neu, wie du denkst... Ich habe allerdings an der Stelle keine Übersicht, wie weit man der Seite da trauen kann)\nFakt ist: Die einzige Lösung da raus zukommen ist... an seinem eigenen Spiel arbeiten. Die eigenen Fehler zu suchen und die eigenen Schwächen abzustellen.","replies":[]}]}