{"poster":"xFailtex","date":"2016-11-26T19:44:45.446+0000","title":"An die Support Mains da draußen. Die Tanky Supports.....","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Liebe Support Mains, oder auch nicht Support Mains.\r\n\r\nIch spielte am Ende der Season 6 sehr viel Support und habe mich in den AP Supports verloren (Zyra haupts&auml;chlich aber auch Sona, Nami, Karma und Lulu). Da ich mit diesen sehr viel Erfolg hatte, dachte ich bis jetzt dass ich daran nichts &auml;ndern m&uuml;sste. Dennoch wurde mir empfohlen auch mal die Tanky Supports zu spielen. Meine Frage an euch, kann man mit Tanky Support mehr carrien? Ich habe daraufhin Tanky Supports ausprobiert (mit sehr wenig Erfolg) jedoch m&ouml;chte ich meinen Championpool als Support um Tankyness erweitern. Welche Tanks eignen sich daf&uuml;r am besten? Au&szlig;erdem gef&auml;llt es mir irgendwie sehr wenn Champions (ein) bestimmte/s Item/s haben welches perfekt zu ihnen passt, ich finde den Tanky Supports fehlt das. (Immer Frozen Heart?)\r\n\r\nTL;DR: K&ouml;nnt ihr mir gute Tank Supports empfehlen m&ouml;glichst mit Item-Build? Auf Antworten w&auml;re ich sehr dankbar, wenn ihr wollt einfach hier anschreiben :)\r\n\r\nSch&ouml;nen Abend.","replies":[{"poster":"Awsane","date":"2016-11-26T20:06:01.669+0000","up_votes":1,"down_votes":0,"body":"Aloha wenn du wirklich Tank Supports lernen willst hilft es dir wahrscheinlich mehr\ndir gezielt guids zu den Champions anzusehen und itembuilds die erfolgreich sindcin den entsprechenden Seiten zu suchen\n\nich benutze z.b. pro build\nund Champion.gg für sowas, aber jede Seite hat vor und Nachteile da solltest du dich umsehen was dir liegt\n\nweil zu sagen der champ xy ist gut und dann das itembuild zu kopieren und dann erfolg zu erwarten wird so nicht funktiuonieren, weil sowohl Champions als auch itembuilds sehr situatuzionsabhängig sind und von vielen Faktoren abhängen\nund es nicht einen \"einfachen\" way to go gibt\n\n\nGoogle einfach die tanky supporter die für dich ansprechend aussehen\ndie tanky supporter die es gibt sind \nthresh, blitzcrank, braum, taric, tahm kench,  leona, alistar\n\nzudem gibt es offmeta tanky supporter von denen aber ich nicht weiß wie gut die sind\ndas wären\nshen, malphit, maokai, Nautilus,  poppy, sion, nunu, trundle","replies":[{"poster":"xinf3ct3d","date":"2016-11-26T22:44:13.709+0000","up_votes":2,"down_votes":0,"body":"Thresh ist hell as Squishy....nur im Late Game ist es ein Tank.Und Nautilus ist kein Offmeta Supporter sondern einfach nur ein Support. Er hat den besten Peel den es gibt und auch den eimfachsten und Simpelsten engage","replies":[{"poster":"V3IG4R HQ","date":"2016-11-29T11:51:07.389+0000","up_votes":1,"down_votes":0,"body":"Was auch immer du sagen wolltest.... Thresh ist garantiert nicht \"squishy as hell\", besonders mit der Unterstützung durch Colossus und entsprechenden Runen/Masteries. Klar ist er squishy im Early wenn du ihn mit falschen Runen etc. spielst. Nauti hat definitiv gute Peel, kommt aber trotzdem nicht ganz an Thresh ran. Flay ist einfach zu gut.\nUnd auch an den anderen Redner hier: Was Madlife öfters macht ist für einen Thresh-Main nichts besonderes (ich spreche nicht von lowelo Mains). Je höher du kommst desto häufiger werden Ultis/Summoner Spells etc. getrackt und du weisst als Thresh, ob XY noch Flash hat. Wenn du ihn nun in eine auswegslose Situation führst und den Grap sowieso hitten wirst, liegt es auf der Hand, dass er flashen wird. Ist nur ein simples Beispiel aber das kann man eigentlich auf jede Situation mit Thresh übertragen. Pros wissen, wann ein Hook für sie tödlich enden würde und benutzen entsprechend ihre Gapcloser/Flashes.\nNatürlich hat auch viel mit Mindgames zu tun, besonders nach dem ersten erfolgreichen Grab. Ein Thresh stellt sich meist auf die Gegner ein und wenn diese dann ihr Muster ändern, muss man sich wieder neu ausrichten. Man merkt das auch sehr gut wenn man gegen einen gegnerischen Thresh spielt: Die meisten werfen den Q zunächst in deine Laufbahn. Jetzt merken sie dass du die Hooks jedesmal dodgest und sie werfen ihn hinter dich, weil sie davon ausgehen, dass du wieder nach hinten dodgen wirst. So beginnen dann die Spielchen...\nBin mit Thresh bei 200k Points, habe schon so ziemlich alles getestet. Kauf' einfach Relict zu Beginn und nimm' Colossus als Keystone, dann wirst du sehen, dass du im Early- und Midgame auch schon ordentlich aushalten kannst. Relict so früh wie möglich ausbauen, ist seit dem Rework wirklich schön!","replies":[]}]},{"poster":"xFailtex","date":"2016-11-27T09:53:20.913+0000","up_votes":1,"down_votes":0,"body":"Danke, ich habe mir erstmal Leona, Alistar und Blitzcrank ausgesucht, werde mich nun erstmal über die Champs genau informieren Guids, Combos etc. und danach schau ich mal dass ich mit ein paar Kumpels übe, da die Community einfach viel zu salty ist wenn man gerade erst ein Champion anfängt zu spielen und dementsprechend nicht der Madlife unter den Spielern ist. Dange für deine Antwort ^^","replies":[{"poster":"Mi3zekatze","date":"2016-11-28T18:26:23.766+0000","up_votes":1,"down_votes":0,"body":"Madlife ist eh glückssache xD ich treffe ca 1 hook aus 1000 und habe trz mal nen typen im Flug getroffen als er zu tresh wegen seiner lantern fliegt ;)","replies":[{"poster":"xinf3ct3d","date":"2016-11-29T13:21:57.027+0000","up_votes":1,"down_votes":0,"body":"uff. Da musst du mal üben","replies":[]}]}]}]},{"poster":"EvilDeBeagle","date":"2016-11-30T12:33:55.484+0000","up_votes":1,"down_votes":0,"body":"Ich weiss nicht, welche Elo du bist, aber ich kann dir vielleicht mit meinem fundiertem Gold 3 wissen weiterhelfen.\n\nWenn du Tanky Supps spielen willst, ist meiner Meinung nach das beachten der Cooldowns am wichtigsten.  Als Tank supp hast du nur ein begrenztes Arsenal an spells, und selten einen den du Spammen kannst (Ich denke da an Naut e mit viel Cooldownreduktion)\n\nEs ist ausserdem sehr wichtig, die Situation abschätzen zu können. Während Mage supps aus relativ sicherer Entfernung einen Impact haben, muss der tank supp nah dran. \n\nZu den einzelnen Champs (Nur eine Auswahl):\n\nLeona \n\nDu musst dich bei Leona damit abfinden, dass du quasi nicht relevant bist, wenn du nicht engagen kannst. (Wenn der River nicht gewarded ist zum Beispiel, wenn der gegnerische Assasin mia ist etc. etc.)\nNatürlich kannst du gewissermaßen bei deinen Adc bleiben und hoffen, dass der gegnerische 11 2 6 Renger in dein q springt, aber die guten Assasins werden das vermeiden. \nAuf der anderen Seite kannst du mit Leona am härtesten Snowballen, wenn ihr ahead seit.\n\nNautilus\n\nVon dem Kamaraden wurde hier oft als Peelmonster gesprochen. Ich denke da etwas anders. Ja Naut hat eine Menge CC und ja, die Ult ist der Fluch eines jeden Assasin (Knock up und stun).  Aber das größte Problem ist, dass die Ult sehr langsam ist.  Wenn sie ankommt könnte es eventuell zuspät sein für deine Vayne, welche nun mit dem gegnerischem Talon Bekanntschaft gemacht hat. \nDu siehst hier, dass du dich entscheiden musst. Zwischen Peel und Engage. Das gilt allerdings für die meisten Supps also....\nLass dich aber nicht entmutigen. Nautilus ist einer der besten engager im Spiel, und ist er erstmal an jemanden dran, kann man ihn kaum loswerden.\n\nBlitzcrank:\n\nDu hast nur den Grab. Alles andere ist darauf aufbauend, Du kannst natürlich fröhlich auf den Gegner zurennen, das kann aber manchmal schwer werden (Hallo, Janna).\nWenn du den Grab nicht triffst, bist du, extrem gesagt, nutzlos.\nUnd achte bitte um gotteswillen darauf, WEN du in dein Team ziehst. Oder willst du einen 3500 hp Darius neben deinen Ap und Ad carry stehen haben?\n\n\nAuch würde hier oft über Tresh gesprochen. Thresh kann alles. Er kann offensiv und defensiv, er kann peel und engage. Aber Thresh ist auch der schwierigste Supp. (meiner meinung nach). Wenn du Thresh spielen willst, musst du damit rechnen, dass du überproportional viel mit ihn üben musst, um gut zu sein. Er ist der Lee Sin und der Azir unter den Supportern. \n\nSoviel zu meiner bescheidenen Meinung. Ich hoffe, dass das  dir vielleicht hilft und gleichtzeitig, dass ich nicht niedergeflamed werde :)","replies":[{"poster":"xFailtex","date":"2016-12-01T17:43:25.883+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für so detallierte Hilfe ^^\nBin Gold 5 aber von den Tanky Supports her bin ich eher Holz 5 xD\nIch nehme also jede Hilfe die ich kriegen kann, echt cool dass hier so viele Antworten und einem auch wirklich konstruktiv geholfen wird :)","replies":[]}]},{"poster":"xinf3ct3d","date":"2016-11-26T22:41:22.413+0000","up_votes":1,"down_votes":0,"body":"Ein Paar Gute Supporter die richtig was aushalten sind Champions wie Blitzcrank als absoluter SoloQ variante oder Nutilus wenn man mit Premades spielt. Brauch ist auch ein krasser Tank aber den fange ich grade erst an und kann noh nicht so viel drüber sagen.","replies":[{"poster":"Mi3zekatze","date":"2016-11-28T18:24:10.058+0000","up_votes":1,"down_votes":0,"body":"Blitz hält SEHR wenig aus.... man baut ihn nur tank weil er sonst von nem minion geonshottet wird xD","replies":[{"poster":"xinf3ct3d","date":"2016-11-29T13:24:07.818+0000","up_votes":1,"down_votes":0,"body":"Spiel ihn mit Tank Masteries und bleibe am anfang auf Distanz und geh nur ran wenn du den Hook triffst und du bekommst kein bisschen Schaden.","replies":[{"poster":"Mi3zekatze","date":"2016-11-29T20:56:05.932+0000","up_votes":1,"down_votes":1,"body":"Ja wenn du es richtig machst kriegst du keinen dmg aber es ging ja darum das du NICHT als klasischer tank fungieren kannst du kommst halt niemals an die Tankyness von ner poppy oder nem Trundel ran","replies":[{"poster":"V3IG4R HQ","date":"2016-11-30T11:26:11.030+0000","up_votes":1,"down_votes":0,"body":"Ist auch nicht das Ziel mit Blitzi =)\n\nPoppy und Trundle, um auf dein Beispiel zurückzukommen, haben Schaden über Zeit. Sie sind darauf angewiesen am Gegner dranzubleiben und dabei möglichst lange zu überleben. Blitzcrank hingegen funktioniert in dieser Hinsicht komplett anders.\nDennoch will gesagt sein, dass Blitzi definitiv viel aushalten kann. Nimm Colossus und Tank Runen, ich für meinen Teil baue ihn auch (fast) immer mit Relict, was ihn zusätzlich \"tanky\" macht und etwas Sustain in die Runde wirft. Dann kommt noch seine Passive, etc. etc.","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T17:43:29.343+0000","up_votes":1,"down_votes":0,"body":"Ja eben deswegen habe ich ja auch gesagt Blitz ist kein vollwertiger tank weil er hier als einer aufgeführt wurde :)","replies":[{"poster":"V3IG4R HQ","date":"2016-12-01T11:53:42.093+0000","up_votes":1,"down_votes":0,"body":"Blitzi kann definitiv als Tank-Supporter aufgeführt und gespielt werden. Die Frage ist immer, wieviele Supp- oder AP-Items man noch in den Build packt. Wie gesagt, mit Relict, Colossus, seiner Passive und den anderen Items hält er definitiv viel aus. Das Ding ist halt dass man ihn sinngemäss höchstens als Offtank spielt, damit er noch von anderen Item-Eigenschaften (eben z.B. bisschen AP oder halt Utility on masse [Iceborn Gauntlet für besseren Peel etc..]) profitieren kann. Du musst und willst mit Blitz nicht 30 Sekunden im Teamfight sein, du grabst dein Ziel und eliminierst dieses mit deinen Mates oder peelst deinen ADC in den Fights (da wirst du sowieso nur bedingt angegriffen). Es macht also nicht wirklich Sinn, Blitz auf Fulltank zu spielen.\nMan müsste nun halt den Begriff \"Tanksupp\" definieren, um eine klare Abgrenzung machen zu können.","replies":[]}]},{"poster":"xinf3ct3d","date":"2016-12-01T03:26:47.587+0000","up_votes":1,"down_votes":0,"body":"Ein Blitzcrank muss nicht am Ziel kleben. Er holt sich einfach das Ziel und macht dass es an ihm klebt","replies":[]}]}]}]}]}]},{"poster":"Shadowscreen","date":"2016-11-29T12:02:39.440+0000","up_votes":1,"down_votes":0,"body":"Um mal unseren Support aus der letzten Teambesprechung zu zitieren....\"Tank Supports sind tot\"\n\nJanna -> god tier\nBlitzcrank -> Utility sup (kein Tank!) aber dennoch in der YoloQ sehr erfolgreich\nThresh -> wenn man ihn kann\n\nAls Alternative zu DMG lastigen Supports würde ich Janna oder Blitz empfehlen\n\n- Ali, Braum, Leona sind nahezu nutzlos","replies":[{"poster":"Sirrkas","date":"2016-11-29T12:12:23.087+0000","up_votes":1,"down_votes":0,"body":"Wenn man nach der Winrate in Platin+ geht, stehen von den Tanksupports nur Tahm und Alistar schlecht da. Braum ist nur knapp unter 50 %, Leona und Nauti über 50 %. Aber ja, Utility ist eher weit oben angesiedelt.","replies":[{"poster":"Shadowscreen","date":"2016-11-29T13:02:47.388+0000","up_votes":1,"down_votes":0,"body":"Gut, es kann sein dass Leona und Naut in der SoloQ etwas stärker, da geb ich dir recht aber Braum ist MMn einfach schwach derzeit, wenn er im early keinen lead bekommt. Im Vergleich dazu gab es in dieser Season weit bessere Zeiten für ihn.\n(Ich glaube zu seinen Peak Zeiten mit Einführung des korean Lucian hatte er eine Winrate von ca. 55%?)","replies":[{"poster":"Sirrkas","date":"2016-11-29T13:58:47.240+0000","up_votes":1,"down_votes":0,"body":"Das lag dann aber eher an der Synergie zu Lucian, der den Stun fast automatisch ausgelöst hat.\n\nIch wüsste jetzt zumindest nicht, dass Braum nennenswerte Nerfs erhalten hat oder die anderen Tanks deutliche Buffs. Bei Leona gab es ein kleines Rework, da hat sich der Schaden etwas verschoben. ","replies":[{"poster":"xinf3ct3d","date":"2016-12-01T03:30:37.902+0000","up_votes":1,"down_votes":0,"body":"wie wäre Tristana+Braum ? Mit Tristanas Sprung und Braums E ist man sehr mobil und die passive kann auch sehr schnell mit dem E ausgelöst werden","replies":[]},{"poster":"Shadowscreen","date":"2016-11-29T14:31:19.956+0000","up_votes":1,"down_votes":0,"body":"Damit hast du recht und genau mit dieser Synergy steigt und fällt Braum meiner Meinung nach je nachdem wie Lucian gerade in der Meta steht.\nNatürliuch gibt es ein paar Comps in denen Braum noch sehr nützlich ist aber das sind nicht viele.","replies":[]}]}]}]},{"poster":"Mi3zekatze","date":"2016-11-29T20:59:26.946+0000","up_votes":1,"down_votes":1,"body":"Ali ist wieder ziemlich stark geworden als supporter mit seiner neuen e \nUnd Leona gehört meiner Meinung nach zu mit dem stärksten Support weil sie einfach 3 CC Quellen mitbringt und unendlich tanky wird (die e ist auch CC) zudem synergiert sie wunderbärchen mit der neuen Masterie","replies":[{"poster":"Shadowscreen","date":"2016-11-29T21:11:05.912+0000","up_votes":1,"down_votes":0,"body":"Das stimmt auch aber das Problem bei Leona ist, dass sie sobald sie drin ist und ihre ult + Q eingesetzt hat, sie einfach ignoriert werden kann, da sie keine Bedrohung mehr darstellt.","replies":[]}]}]},{"poster":"Nycaria","date":"2016-11-26T20:10:27.204+0000","up_votes":1,"down_votes":0,"body":"> Meine Frage an euch, kann man mit Tanky Support mehr carrien?\n\nDas kommt immer darauf an, wie gut man diese Champs dann auch spielen kann. Ich persönlich kann mit fast keinem Tank Supporter carrien, die einzige Ausnahme ist Nautilus.  Wenn du also lieber AP und Utility Supporter spielen möchtest und diese auch gut zu deinem Spielstil passen, spiel sie und versuch dir nicht zwanghaft Tanks anzueignen :)\n\n> TL;DR: Könnt ihr mir gute Tank Supports empfehlen möglichst mit Item-Build? Auf Antworten wäre ich sehr dankbar, wenn ihr wollt einfach hier anschreiben :)\n\nDa Nautilus der einzige Tank ist, welchen ist momentan gerne als Support spiele, empfehle ich dir einfach mal Nautilus ^^\n\nDie Keystonemastery sollte klar sein und auch das Startsupportitem müsste einleuchtend sein.\n\n{{item:3401}} {{item:2045}} {{item:3190}} {{item:3107}} Baue ich eigentlich in 90% der Nautilus Games, Redemption allerdings nur wenn das Gegnerteam es zulässt und ich keine zusätzliche Rüstung/MR brauche.\n\nSituationsabhängig ist dann immer ob ich Randuins/Frozen Heart kaufe oder beispielsweise Knight's Vow oder manchmal auch Righteous Glory.\n\nManchmal ist auch ein Zekes oder Mikaels drin oder eben auch ein Zz'Rot, wenn es nötig ist.\n\nDas Itembuild ist sicher nicht perfekt,aber für meine Spielweise funktioniert es ganz gut :)","replies":[{"poster":"xinf3ct3d","date":"2016-11-26T22:42:08.681+0000","up_votes":1,"down_votes":0,"body":"Jo,Nautilus.Ein Champion zum einsteigen und Später kann man ja auch Blitzcrank umsteigen :D","replies":[{"poster":"Nycaria","date":"2016-11-26T22:51:23.357+0000","up_votes":1,"down_votes":0,"body":"Blitzcrank und Nautilus sind zwei vollkommen unterschiedlich zu spielende Champions :) Abgesehen von der \"Q\", die Gegner ranzieht bzw selbst das ist bei beiden vollkommen unterschiedlich, haben die beiden nichts gemeinsam ^^","replies":[{"poster":"xinf3ct3d","date":"2016-11-27T02:13:37.703+0000","up_votes":1,"down_votes":0,"body":"Hab ich je bahauptet die wären \"gleich\" obwohl der Spielstil sich kaum unterscheidet","replies":[{"poster":"xinf3ct3d","date":"2016-11-29T13:28:50.560+0000","up_votes":1,"down_votes":0,"body":"Ich maine beide Champs und spiele Nautilus wenn ich lastpick bin und wr keinen Engage haben. Einfach R in die Backline drücken und los gehts","replies":[]}]}]}]}]},{"poster":"V3IG4R HQ","date":"2016-11-28T11:47:00.793+0000","up_votes":1,"down_votes":0,"body":"Hallo mein Süsser\n\nOb du mit Tanky-Supps besser carrien kannst als mit AP-Supps kann man so pauschal nicht beantworten, da in manchen Setups Tanky-Supps und in anderen AP-Supps \"besser\" sind. \nIch habe schon alles durch als Supporter und bin momentan auch wieder bei den Tanky-Supps gelandet (zuvor vor allem Vel' und Brand/Lux Supp gespammt). Colossus auf einer Leona o.Ä. ist einfach sick und erlaubt es dir, fast for free zu traden. \n\nDie folgenden Champs empfehle ich dir: \n- Thresh\n- Leona\n- Braum\n- Blitz\n- Poppy (Nischenpick auf der Botlane, kann ihr Potenzial aber ordentlich entfalten wenn sie richtig gespielt wird -> meine Empfehlung ist Vayne + Poppy, habe mit dem Kumpel von mindestens 5 Spielen mit dieser Comp noch nie verloren). \n\nDiese Champs spiele ich grundsätzlich alle mit Colossus, bei Braum aber macht imo die Mastery ganz rechts mehr Sinn (bisschen DMG vom ADC abfangen etc). \n\nDer Itembuild ist als Supporter und in der jetzigen Preseason sowieso spielabhängig.  Ein paar grundlegende Gedanken bei meiner Itemwahl kann ich dir aber gerne erläutern: \nWenn mein Team einen Fulltank als DMG-Magnet und Engage braucht, baue ich nur Relict und Sightstone was Supp-Items angeht, danach einfach Tank-Items. Ja die Supp-Items (Solari, das andere Ding mit Heal/DMG für 2100 G etc.) geben dir auch passende Tanky-Stats, kommen aber nicht ganz an die Wirkung der \"normalen\" Tank-Items ran. Sind natürlich auch günstiger! Wenn ich also sehr behind bin kaufe ich nichtsdestotrotz die Supp-Items. \n\nWenn die Gegner viel AoE haben und ich vor allem den peelenden Part übernehme, gehe ich öfters auf Relict, Solari und manchmal sogar noch das oben erwähnte Item für 2100 Gold. Mit Thresh o.Ä. kommt man dann schon auf eine beachtliche Zahl an Shields und kombiniert mit dem CC an sich ist das Peeling-Potenzial absurd. \nStreiten kann man sich über die Schuhe. Ich hole mir fast immer die 5er-Boots, weil ich sehr gerne roame und Gegner stresse.\nZum anderen neuen Supp-Item (das Ritterding) kann ich leider noch nichts sagen, hatte die Zeit und Lust noch nicht, das Ding vollständig zu studieren.\n\nWenn du Tanky-Supps spielst stehe bitte nicht einfach im Busch und warte, bis die Gegner engagen o.Ä. Sei aggressiv, versuche zu zonen, alle Relict-Hits zu kriegen, poken, engagen, etc... Ich finde man sieht das immer sehr schön wenn man einen lowelo Thresh mit einem highelo Thresh vergleicht: Der highelo Thresh ist fast ununterbrochen am versuchen seine AA's auf die Gegner zu bringen, während der lowelo thresh hinter seinem ADC steht und gierig darauf wartet, endlich einen Hook zu treffen. Natürlich muss auch der ADC wissen wie er zu stehen hat, aber mit einer gesunden Mischung aus Aggressivität/Passivität lässt sich enorm viel rausholen! \n\nAls Tanky-Supp bist du halt etwas mehr auf dein Team angewiesen. Wenn du reingehst erwartest du, dass dein Team mitzieht und du versucht mit allen Mitteln, die Aufmerksamkeit der Gegner auf dich zu lenken. Natürlich muss man sich über die Zeit ein gesundes Gedankengut bezüglich Engages aneignen, das braucht aber Übung und Übersicht. Irgendwann geschieht alles vollautomatisch und du kannst dich voll und ganz auf deine Arbeit konzentrieren.\n\nFalls du Fragen hast einfach melden.","replies":[{"poster":"xFailtex","date":"2016-11-28T16:46:50.022+0000","up_votes":1,"down_votes":0,"body":"Dange du Schlingel, sehr detaillierte Hilfe von dir. Versuche mir langsam den Spielstil anzueignen ^^\n\nSchaue mal das ich Leona gescheit hinkriege, denn die macht mit unter am meisten Spaß und ist auch relativ gut. Einziges Problem auch gerade bei Tanky Supports, welches du auch schon angesprochen hast: Wenn man engaged hängt man sehr vom Team ab in Low Elo (Silber, Gold...) hatte ich mit AP Supports (Sona, Nami, Lulu......) viel mehr Erfolg da meine Mates immer auf den engage vom Gegnerteam wartet und man sein ADC dann gut beschützen kann. Dennoch versuche ich Leona und vllt noch einen anderen Tank in mein Repertoire aufzunehmen. ^^\n\nHau rein.","replies":[{"poster":"xinf3ct3d","date":"2016-11-29T13:27:13.400+0000","up_votes":1,"down_votes":0,"body":"als \"2. Tank\" kann ich dir im early Game Nautilus oder Blitzcrank empfehlen. Mit der neuen Mastery können beide unglaublich gut Traden und verlieren anfangs auch ohne Restenzen wenig HP","replies":[]}]}]},{"poster":"XOFree","date":"2016-11-29T13:23:33.684+0000","up_votes":1,"down_votes":0,"body":"das best was man spielen kann ist \"teamorientiert und conter den gegnerischen support\" \n\n{{champion:48}} ist strak und erstrecht da sie {{champion:67}} zur zeit sehr stark ist! deren E combo ist OP!!\n{{champion:111}} ist sehr gut mit {{champion:51}} da ihre fahlen sehr gut genutzt deren können\n\n{{champion:223}} ist gut wenn man den carry retten muss! damit er das mid und end game erreicht \n{{champion:25}} ist der beste conter gegen ein hard cc team\n{{champion:201}} sehr gut wenn man ein aa lastiges team hat \n {{champion:61}} mein tipp für brust all in adc champs! {{champion:133}} {{champion:119}} {{champion:67}} {{champion:104}} ihre passive vom ball ist so OP! \n\nusw.","replies":[]},{"poster":"ImpactReaper","date":"2016-11-26T23:30:43.063+0000","up_votes":1,"down_votes":0,"body":"Meine Favoriten sind Poppy und Sion. Poppy ist vorallem sehr gut gegen Champs wie Lee Sin, Seju, Tristana und alle Champs die gern rein/raus Springen/Sleiden durch das W.\n Und das E (heroischer ansturm) ist vorallem dann perfekt wenn du jemanden an die Wand Pinst. Die Ulti kannst auch nur als Knockup benutzen wenn du kurz antippst. \nSion ist auch ne gute Tank maschine. und durch seine passive macht er auch laune ^^\nsein E ist ein guter Slow und mit gegnerischen Minions hast ne gute reichweite mit dem E\n\nIch persönlich hab da keine Standart Builds da ich sie immer situation abhängig spiele die beiden als Haupt Masteri: Mut des Kolosses","replies":[]},{"poster":"OrangeBubble","date":"2016-11-26T23:25:31.676+0000","up_votes":1,"down_votes":0,"body":"Mit Utility oder AP Champs kannst genauso carrien. \nEs ist einfach nur Präferenz-Sache ~\n\nNautilus ist simpel zu spielen und hat extrem guten Peel.","replies":[]}]}