{"poster":"58595143","date":"2018-03-07T08:06:56.100+0000","title":"A random player just added me and asked if I wanted to boost, how can I report him?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"ps: I wasn`t in a macth so I can`t report him","replies":[{"poster":"Periscope","date":"2018-03-07T08:24:47.437+0000","up_votes":2,"down_votes":0,"body":"Use a [support ticket](https://support.riotgames.com/hc/en-us/requests/new), and include their name.\n\nEdit: On what yCarr said, you have a lot of control over who you talk with outside of the game. But if this player wasn't toxic to you in the game (and thus you didn't report him in the post game), then I'd submit a support ticket. Since this isn't related to in-game offenses, I'd submit a support ticket still.","replies":[{"poster":"Örnn Bot","date":"2018-03-09T16:42:43.588+0000","up_votes":1,"down_votes":0,"body":"unfortunately the only real way for people to get banned is for in-game things reporting from things in like say champ select and post game don't even get read by the automated bot system and when you make a support ticket about the problem they reply with an automated system and never actually take action.","replies":[{"poster":"Periscope","date":"2018-03-09T16:49:25.719+0000","up_votes":1,"down_votes":0,"body":"Yea, I'm not sure how/if pre or post game chat is reviewed, but players have been punished before for their out-of-game chat.","replies":[{"poster":"Ninox","date":"2018-03-10T10:35:44.689+0000","up_votes":3,"down_votes":0,"body":"Last we heard they were live testing pre and post game reviews on OCE. So far as I know that hasn't changed and you can still be punished for pre/post game either manually or by the automated system, but i's possible they suspended live testing if there were too many issues.\nhttps://boards.oce.leagueoflegends.com/en/c/help-support-oce/RHaLh1FE-suspension-without-cause?comment=0006","replies":[]}]}]}]},{"poster":"yCarr","date":"2018-03-07T08:39:48.132+0000","up_votes":1,"down_votes":4,"body":"Just delete and move on, what benefit do you get out of snitching ?","replies":[]}]}