{"poster":"xLyber","date":"2016-08-02T07:21:18.878+0000","title":"Projekt Rahmen","subforum":"Skin- & Champion-Konzepte","embed":{"description":"The PBE has been updated! As we continue on the 6.15 PBE cycle, today's update includes new special edition loading screens for the upcoming skins and PROJECT: Yasuo, tentative balance changes, OFA's PBE return, and more! Continue reading for more information!","url":"http://www.surrenderat20.net/2016/07/714-pbe-update.html","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo Leute,\r\n meine Frage ist in welchen Zeitraum man den project rahmen f&uuml;r die projekt skins bekommt.\r\n\r\n                                                       danke im voraus","replies":[{"poster":"xLyber","date":"2016-08-05T21:42:44.466+0000","up_votes":1,"down_votes":0,"body":"bis zum 17.08.2016 glaube ich","replies":[]},{"poster":"Ljapunoff","date":"2016-08-03T23:31:36.558+0000","up_votes":1,"down_votes":0,"body":"Hat jemand eine Ahnung, wie lange die Projekt-Kerne im Inventar bestehen bleiben?","replies":[]},{"poster":"GrandpaOfDoom","date":"2016-08-03T11:29:19.883+0000","up_votes":1,"down_votes":0,"body":"Soooo... Dann möchte ich auch mal meinen Senf hier dazugeben ;). Anfänglich dachte ich auch: \"Oooohaaaaaaaa, Riot... Für die Leute, welche auf Projekt Alpha stehen ist das eine richtig teure Angelegenheit (50 Euro sind eine Menge Geld. Egal ob es einen Erwachsenen Arbeitnehmer, oder noch übler, einen Schüler betrifft).\" Ich habe mich dann schweren Herzens dazu entschlossen, mir das \"Erstschlag+ -Paket\" für 8220 RP zu holen, da ich eben auch so ein Projekt-Alpha-Freak bin. Bringen wir es auf den Punkt.\nErgebnis: Ich habe hierdurch die 3 Skins, alle 3 dazugehörigen Alpha-Ladebildschirme (Blaupausen und Projektkerne aus Kisten zum craften), 3 Symbole, 1 Auge und 1x Edelstein erhalten. Zusätzlich aus den Projekt-Geheimkisten kamen eine zusätzliche Kiste aus Verstärkungs-Cache Fragmenten, 3-4 Championsplitter (lässt sich also für den, der nicht alle Champs hat einer freischalten), 15-16 Skinplitter (das ergibt 5 zufällige Skins, welche man noch nicht hat / oder noch mehr, wenn man die Möglichkeit hat mit Essenzen freizuschalten), 1 x Augenskinsplitter (welchen ich noch nicht hatte und mit Essenzen freigeschalten habe), 1 x Beschwörersymbolsplitter (fehlte mir noch, um ein zufälliges freizuschalten), sowie 150 orangene Essenzen.\nFAZIT: Der Preis ist, wenn man sich das alles mal so durch den Kopf gehen lässt, absolut gerechtfertigt. Dies ändert aber nichts an der Tatsache, dass sich Riot keinerlei Gedanken darüber gemacht hat dieses Angebot so zu splitten, dass es auch für den etwas kleineren Geldbeutel (Schüler) erschwinglich bleibt. Meiner Meinung nach fehlt hier schlicht und ergreifend die Möglichkeit, die Skins nur mit Alpha-Ladebildschirmkarten zu einem angemessenen Preis zu bekommen, so dass hier auch Schüler ohne grössere Bauchschmerzen zuschlagen können. Die \"Vogel friss, oder stirb\"-Taktik hat hier schon einen bitteren Beigeschmack.","replies":[]},{"poster":"Aenrikr","date":"2016-08-02T07:28:32.251+0000","up_votes":1,"down_votes":0,"body":"Wenn ich das in den Neuigkeiten richtig verstanden habe, muss man sich den Rahmen diesmal selber über das Hextechsystem \"craften\".\nDie dafür benötigten Materialien sind in Kisten enthalten welche bis zum 7. August erhältlich sind.\n\nHier kannst du es nochmal nachlesen:\n\nhttp://euw.leagueoflegends.com/de/news/store/sales/zugang-gewahrt/edelsteine\n\nKorrigiere mich falls ich falsch liege ^^","replies":[{"poster":"NoTeamFound","date":"2016-08-02T10:20:10.113+0000","up_votes":1,"down_votes":0,"body":"warte das heisst man kann nur 1 rahmen mit IP kaufen? den rest muss man ja mit RP erwerben. weil so wie ich gesehen habe ist das Limit für das Störungs-Cache auf 1 begrenzt. \n\nBitte klärt mich Mal einer auf bin grad nicht daheim deshalb kann ich es nicht selbst testen.\n\nDankeschön","replies":[{"poster":"Aenrikr","date":"2016-08-02T11:16:22.283+0000","up_votes":1,"down_votes":0,"body":"Genau so scheint es auszusehen.\nDu kannst dir 3 Kisten per IP kaufen, diese geben genug Material um exakt einen Rahmen zu basteln.\nWillst du für die anderen beiden neuen Projekt Skins einen Rahmen haben, musst du extra RP hinblättern.\nRito hat da mal wieder eine schöne Masche entwickelt um uns noch mehr Geld aus den Taschen zu ziehen.\n\nBöse Marketingabteilung!\nBitte einmal mit pinken Zetteln durchgehen, die Spieler mögen auch nicht ^^\nPfui! XD\n\nIm Ernst, DAS ist GELDGEILHEIT!\nMan möge sich, nachdem man mit dem Bad im Geld fertig ist, doch bitte gehörig schämen :P","replies":[{"poster":"NoTeamFound","date":"2016-08-02T11:24:56.675+0000","up_votes":1,"down_votes":0,"body":"ahahahah ja hat schon was aber man muss halt schon sagen, dass riot auch viel für uns gemacht hat / machen wird.\n\nAber ja keine ahnung... irgendwie schon beschi**en.\nAusserdem  hab ich gesehen dass man ab dem 9.8. eine weitere Box mit IP Kaufen kann (auch wieder nur auf 1 Limitiert) und da steht dann dass man einen zufälligen blueprint für einen Project skin (ausser Ekko, kata, ashe) dazu bekommt.\n\nWenn die sagen Blueprint, respektiv, blaupausen, meinen die dann den Rahmen, versteh ich das korrekt? \n:D mann ich sollte schleunigst nach hause :D\n\nDanke für die Antworten.\nLG Saveshot","replies":[{"poster":"Aenrikr","date":"2016-08-02T11:37:23.506+0000","up_votes":1,"down_votes":0,"body":"In dieser Kiste, die 1500 IP kosten wird, da hast du Recht, sind folgende Sachen enthalten:\n\n- Ein Beschwörersysmbol\n- 7 Projek Kerne\n- 2 Projekt Geheimkistenfragmente (3 davon ergeben eine weitere Kiste)\n- eine Skinsplitterblaupause welche, kombiniert mit 11 Projekt Kernen eine Skinscherbe von den vormaligen Projektskins ergibt.\nZu diesen gehören also alle außer den gerade veröffentlichten Projektskins. Ohne weiteren Geldeinsatz also sinnfrei da nur 7 Kerne in der Kiste sind und man sich die restlichen 4 mit RP nachkaufen muss.\n\nHier kannst du alles nochmal nachlesen:\n\nhttp://euw.leagueoflegends.com/de/featured/skins/project-2016/content/crafting","replies":[{"poster":"NoTeamFound","date":"2016-08-02T11:41:33.863+0000","up_votes":1,"down_votes":0,"body":"super danke. das wollte ich wissen.\n\nSprich ich könnte also für Master Yi oder Project Fiora noch ein \"Last-Minute\" Rahmen heraus holen.\n\nFInd ich persönlich nicht fair gegenüber denen, welche sich beim erstschlag im vorjahr beteiligt haben, aber anderer seits sollte jeder wenigstens die chance haben, einen von den älteren project skins mit dem coolen border fizieren zu können.\n\nwho needs schon Rechtschreibung :P\nLG Saveshot","replies":[{"poster":"Aenrikr","date":"2016-08-02T11:47:47.642+0000","up_votes":1,"down_votes":0,"body":"Ahm, von einem Rahmen steht da nirgendwo etwas geschrieben, nur von der Möglichkeit, einen Skin an sich zu craften.\nGeh also lieber davon aus, dass du keinen dazubekommst, dann wirst du wenigstens nicht enttäuscht ^^","replies":[{"poster":"NoTeamFound","date":"2016-08-02T12:07:31.050+0000","up_votes":1,"down_votes":0,"body":"1 \"PROJEKT: OVERDRIVE“-Skinsplitter-Blaupause\n\nMIT 11 PROJEKT-KERNEN FUSIONIEREN, UM EINEN ZUFÄLLIGEN PROJEKT-SKINSPLITTER FREIZUSCHALTEN (GILT NICHT FÜR PROJEKT: ASHE, PROJEKT: EKKO ODER PROJEKT: KATARINA)\n\nda steht doch blaupasue.? und blaupause = border oder nicht?\nund die overdriv e skins sind yi, fio, leo, lucian.\n\nAlso so verstehe ich das zumindest.\n\nLG Saveshot","replies":[{"poster":"Aenrikr","date":"2016-08-02T12:55:20.063+0000","up_votes":1,"down_votes":0,"body":"Eine Blaupause ist eine Art Bauplan.\nDer Bauplan für die Skinscherbe in diesem Fall.\n\nMit dem Rahmen hat das leider nix zu tun :(\n\nGlaub mir, ich würde auch noch gerne für meine Leona einen Rahmen bekommen, aber leider bleibt mir das verwehrt :(\nAber ich hab immerhin einen für Ashe ^^\n\nDer einzige Projekt Skin, der, abgesehen von den eben veröffentlichten, noch einen Rahmen bekommen kann, ist Yasou, da bekommen alle, die ihn schon haben oder bis zum 17. August kaufen, noch den Rahmen dazu.\n\nAber es gibt aktuell keine Möglichkeit für Yi, Zed, Leona, Lucian oder Fiora noch den Rahmen zum Projekt Skin zu bekommen.\nAber vlt macht da Riot noch was ^^\nFür ne richtig dicke Scheibe RP XD","replies":[{"poster":"NoTeamFound","date":"2016-08-02T13:16:31.419+0000","up_votes":1,"down_votes":0,"body":"achsooo. ahahaha ja wer weiss die würden das bestimmt noch machen :D.\n\nAber dankeschön für die auskunft jetzt kann ich mit reinem gewissen craften :D GG WP \n\n(>°°>) Project EKoooooo :D","replies":[{"poster":"Aenrikr","date":"2016-08-02T13:40:01.113+0000","up_votes":1,"down_votes":0,"body":"Kein Problem ^^","replies":[]}]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2016-08-02T11:20:09.194+0000","up_votes":1,"down_votes":0,"body":"Es zwingt dich ja niemand zum Kauf :P","replies":[]}]}]}]},{"poster":"Crimson Dynamic","date":"2016-08-02T13:28:19.568+0000","up_votes":1,"down_votes":0,"body":"Man kriegt 7 kerne von der 1500 Ep kiste :3","replies":[]},{"poster":"Belezebell","date":"2016-08-02T13:11:53.560+0000","up_votes":1,"down_votes":0,"body":"Leute habe ich dass jetzt richtig verstanden, dass man aus den 3 Kisten genügend Materialien bekommt um einen Rahmen zu machen?\n\nWeil ich habe jetzt alle 3 Kisten gekauft jedoch kann ich mir keinen Rahmen herstellen, bzw. das Symbol davon","replies":[]},{"poster":"xLyber","date":"2016-08-02T08:20:03.815+0000","up_votes":1,"down_votes":0,"body":"Ich habe es nachgelesen.Man musst den Skin besitzen und es das Symbol dann herstellst","replies":[]}]}