{"poster":"iTargaryen","date":"2016-12-31T16:34:38.276+0000","title":"Como cambian eh...","subforum":"Charlas Generales","up_votes":32,"down_votes":1,"body":"Solo quer&iacute;a decir que varias veces me pasa que estoy jugando una ranked y vamos perdiendo por mucho y el equipo enemigo nos insulta, nos molesta y jode el chat y m&aacute;gicamente damos vuelta la partida y empiezan todos a lloriquear poniendo &quot;best team&quot; &quot;report X&quot; &quot;no pueden ser tan malos&quot;, a lo que voy me parece una actitud muy hip&oacute;crita y de mal jugador joder al enemigo porque tienen mas kills o porque van ganando y cuando pierden todos llorando... si tienen la cara para burlarse ganando tengan la cara para callarse despu&eacute;s si les cierran la boca.. Lo peor de todo es que pocas veces me encuentro con equipos en los que al final de la partida pongan &quot;gg wp&quot; o &quot;bien jugado&quot; me la paso viendo &quot;gg izi&quot; &quot;tutorial&quot; &quot;facil&quot;, un asco todo.","replies":[{"poster":"TSW Rorschach","date":"2016-12-31T16:45:24.265+0000","up_votes":8,"down_votes":0,"body":"Welcome to League of legends :v \n\nA mi no me suele pasar tanto que el team enemigo se pone agresivo por cualquier cosa, pero la otra vez por ejemplo estaba con Jax jungleando y de la nada la Nida enemiga gankea a mi Cassio y le salió mal (porque se escapó con toda la vida :v ), y le decía \"Corre marica de mierda\" y así todo el rato que la campeó y yo \"Bueno, calmate un poco flaca xd\". Y luego casi todo el team enemigo y el mio se puso a flamear feo y yo ahi en plan \"...Cómo se llegó a esto?\" tuve que mutear 8 jugadores por insoportables, y eso que no muteo pero se pasaban de rosca xd\n\nLo mejor es reportar, se siente bien cuando te llega el cartelito de que lo banearon :')","replies":[{"poster":"Akalimaster","date":"2016-12-31T17:33:10.301+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=HMorskoy,realm=LAS,application-id=v7qsfXsE,discussion-id=vEVQEzjO,comment-id=0000,timestamp=2016-12-31T16:45:24.265+0000)\n>\n> Welcome to League of legends :v \n> \n> A mi no me suele pasar tanto que el team enemigo se pone agresivo por cualquier cosa, pero la otra vez por ejemplo estaba con Jax jungleando y de la nada la Nida enemiga gankea a mi Cassio y le salió mal (porque se escapó con toda la vida :v ), y le decía &quot;Corre marica de mierda&quot; y así todo el rato que la campeó y yo &quot;Bueno, calmate un poco flaca xd&quot;. Y luego casi todo el team enemigo y el mio se puso a flamear feo y yo ahi en plan &quot;...Cómo se llegó a esto?&quot; tuve que mutear 8 jugadores por insoportables, y eso que no muteo pero se pasaban de rosca xd\n> \n> Lo mejor es reportar, se siente bien cuando te llega el cartelito de que lo banearon :&#x27;)\n\nLo mejor es cuando te ganan la linea y te dicen ''izi'' o te sacan la maestría pero después pierden y te dicen ''GG izi (Tu linea)'' en ese momento te das cuenta que esta tilteadisimo y te reís un rato {{sticker:slayer-jinx-wink}}","replies":[{"poster":"EdxxEdxx","date":"2016-12-31T18:38:48.156+0000","up_votes":4,"down_votes":0,"body":"También podes darte cuenta, mediante cálculos 100tifikamente comprobads, hechos por los más calculistas de rito y sus malditas 8018231907 gráficas pedorras .-. , que, al ver dicha reacción en tu línea rival, es una válida conclusión decir que **sos mejor jugador que ese invocador** :D. No pero 3 meses más tarde los ves en el foro diciendo \"me permabanearon sin razón y de primeras\". Luego vemos a rito excaliban :c...\n\n#EXCALIBAN DONDE ESTAS ;n; TE EXTRAÑAMOS","replies":[]},{"poster":"TSW Rorschach","date":"2016-12-31T19:32:05.751+0000","up_votes":2,"down_votes":0,"body":"Yo por eso prefiero no mutear xd así al menos me sube el humor pero ahí todos estaban re densos :'v","replies":[]}]},{"poster":"EdxxEdxx","date":"2016-12-31T18:42:40.834+0000","up_votes":3,"down_votes":0,"body":"El típico jungla que te bardea por /all porque tenías ward y le salió para el orto el gank ._.\nLo peor es que llegues a matarlo, no te vuelve a gankear nunca, olvidate de poner wards es al pedo no te preocupes porque con el tilteo que se agarra con el línea de su equipo, y viendo su actitud de insultarte por jugar bien es como... *\"MNKO D MRD CSM NO TE JANQUEO MAZ ÑIÑI\"* y realmente no lo ves volver a tu línea, lamentablahh.\n\nEse cartelito, me salió 5 veces en 1 solo mes, era la primera vez que me salía, me alegró mucho el día, obviamente acto seguido casi me caigo de la silla al pensar que a quien habían baneado era a un tremendo flammer, que encima era xenofóbico, fue como: JJJJJJJJJJAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA","replies":[{"poster":"TSW Rorschach","date":"2016-12-31T19:30:28.203+0000","up_votes":2,"down_votes":0,"body":"Lo gracioso del asunto, es que me enojé tanto por cómo flameaba la Nidalee (mayusculas y todo, onda estaba sacadísimo y decía que era el mejor, que eramos una mierdas y que yo era una basura por usar un champ de básicos. Después ni idea porque la mutee xd) que la embosqué en mi jg y cuando la maté le dije \"izi\" (conste que nunca lo hago pero me ganó el \"Vamos a devolverle un poquito de su amabilidad\"). Se fue afk ._.","replies":[{"poster":"EdxxEdxx","date":"2016-12-31T19:44:16.070+0000","up_votes":2,"down_votes":0,"body":"XDDDDDDDDDDD Siempre tuve ganas de hacer eso, agarrar al flammer in extremis de turno, y esperar a que te diga de todo lo que se le ocurra, para justo en el peor momento humillarlo y decirle \"izi :)\". Aunque siempre me aguanto, espero que también lo hagas la próxima vez, no está bueno contribuir al flameo y esas mrd. Pero como jugador que soy te digo que no me parece del todo mal lo que le hiciste, es posible que después de eso y de irse afk haya quedado llorando en la cama, y si hay suerte capaz que reflexiona .-.","replies":[{"poster":"TSW Rorschach","date":"2016-12-31T20:06:21.147+0000","up_votes":2,"down_votes":0,"body":"Capaz xD igual no me imaginé que se iría afk por eso (o sea, la maté una vez .-.)\nYo soy de los que ignora o de los que a veces trato de razonar un poquito y luego ignora(? Ese caso fue diferente porque ya no me la aguantaba ni muteada y quería ponerla en su lugar al menos una vez xd Igual tenés razón ahi que no se tiene que contribuir a esas cosas.","replies":[{"poster":"EdxxEdxx","date":"2016-12-31T20:41:07.007+0000","up_votes":3,"down_votes":0,"body":"XD La humillación es tal que es imposible que no se vayan afk. Es peor que cerrarles la boca, es como pisotearlos y demostrarles que no son más que unos niñitos estúpidos, pero peor aún, es como hacerles eso en frente de 8 personas más con las que no tiene manera de defenderse, ya que justamente acabas de humillarlo. Pobre nidallllllllll, me da tanta pena XDDD","replies":[]}]}]}]}]}]},{"poster":"René Héctor","date":"2016-12-31T19:44:44.113+0000","up_votes":1,"down_votes":6,"body":"En que liga andas xD","replies":[{"poster":"iTargaryen","date":"2016-12-31T20:22:49.848+0000","up_votes":5,"down_votes":0,"body":"Esto va mas allá de las ligas, es tema del servidor. \nPodes tener elo de bronce, plata, oro, platino, diamante, master o hasta challenger (en menor medida en estos dos últimos pero no totalmente) y de todas formas te vas a encontrar a este tipo de gente. Sin nombrar normales que la cosa va peor ahí.\nY no salten con las ligas y la jugabilidad porque va mas allá de eso, digan lo que quieran pero no se puede tapar el sol con la mano.","replies":[{"poster":"Shijim4 de Virgo","date":"2017-01-01T05:33:46.915+0000","up_votes":3,"down_votes":0,"body":"Si pero una cosa que te lo encuentres en 1 de 5 partidas, o como yo que me los cruso en 1 de cada 30 o 40 o que por lo general yo soy :P","replies":[]}]}]},{"poster":"GødLîkë","date":"2016-12-31T20:27:41.470+0000","up_votes":3,"down_votes":0,"body":"en el 100% de las partidas tenes 2-3 mínimo que dicen \"gg izi\" al final de la partida, riot dice que es baneable pero todos sabemos que no los banean sino no habria tantos","replies":[{"poster":"iTargaryen","date":"2016-12-31T20:49:03.124+0000","up_votes":3,"down_votes":0,"body":"si se banean, recien me paso algo parecido y mira lo que me aparecio (hjace 10 minutos maso) http://imgur.com/a/T0U7n","replies":[{"poster":"GødLîkë","date":"2016-12-31T22:51:41.684+0000","up_votes":3,"down_votes":0,"body":"vi ese cartel 1 sola vez en mi vida, y reporto unos 15 gg izi por dia masomenos...","replies":[{"poster":"DanteV","date":"2017-01-01T15:20:48.788+0000","up_votes":1,"down_votes":0,"body":"Riot dijo que el cartel es aleatorio. Si tu report sirve muchas veces no te va llegar el cartel.\nA mi me llegaron como 5 este año","replies":[{"poster":"GødLîkë","date":"2017-01-01T18:26:16.673+0000","up_votes":1,"down_votes":0,"body":"me vas a llamar loco pero suelo guardar el nombre de los que reporto en un .txt y luego cada tanto los busco, me doy cuenta si los banearon xq se resetean los puntos de honor... y ninguno de ellos fue baneado nunca.","replies":[{"poster":"DanteV","date":"2017-01-02T01:50:46.893+0000","up_votes":1,"down_votes":0,"body":"talves esas personas solo estaban en su mal dia o como es normal nadie reporta y despues lloran en los foros que los trollean o algo por el estilo xD","replies":[{"poster":"GødLîkë","date":"2017-01-02T05:13:43.289+0000","up_votes":1,"down_votes":0,"body":"una persona que dice ggizi en una partida lo dice en la mayoría de las partidas... el problema es que no muchos los reportan... hasta me tope con un forero que hizo varios post quejandose del blind pick, instalock y esas cosas, y justamente hizo todo eso en la partida, perdio su roll, instalockeo igual y fedeo a proposito toda la partida, me tiento a escracharlo xq tengo hasta screenshots ingame de el.","replies":[{"poster":"DanteV","date":"2017-01-06T06:06:38.113+0000","up_votes":1,"down_votes":0,"body":"si, muchos se quejan apesar de que hacen lo mismo y para rematar la gente no reporta pero despues dice que el sistema no funciona xd","replies":[]}]}]}]}]}]}]},{"poster":"DanteV","date":"2017-01-01T15:19:33.367+0000","up_votes":1,"down_votes":0,"body":"Si nadie reporta es mas que obvio que el report no va a llegar ... y despues de quejan y hay gente flamer, troll, qfk , etc pero no se toman el tiempo de reportar y dar honores a quien corresponde.","replies":[]}]},{"poster":"ÉlPapa","date":"2016-12-31T18:06:26.145+0000","up_votes":3,"down_votes":0,"body":"Si ponen \"gg izi\" ,\"tutorial complete\"  o \"facil\" si los reportas los pueden banear por conducta antideportiva, ya que si por ej, tu estas jugando un partida de fútbol en el que pierdes, obviamente no te sentirás muy bien si es que diste todo de ti para ganar  y además llegara un jugador del equipo contrario y te dijera \"izi pizi\"","replies":[]},{"poster":"Yazuò","date":"2016-12-31T16:57:15.855+0000","up_votes":3,"down_votes":0,"body":"{{champion:29}}","replies":[]},{"poster":"Vanguard","date":"2017-01-01T13:00:59.536+0000","up_votes":2,"down_votes":0,"body":"Me ha pasado presenciar esos cambios repentinos de actitud. Me acuerdo que una vez, la temporada pasada, mi toplaner era un Garen que fue contra una Riven M7 con Skin Campeonato. \nSe paso todo early quejandose de que estaba pasando mal la partida porque le toco contra un \"manco que hace counter\", para su suerte, su adc la carreo, y pudo terminar la partida 1/10/2, en vez de 0/10 como salio de linea. \n\nTermino diciendo \"GG IZI\".","replies":[{"poster":"La corrupción","date":"2017-01-01T15:34:42.764+0000","up_votes":1,"down_votes":0,"body":"se refería a que garen es izi no? ok no\n\nde verdad hay gente así tan exagerado?","replies":[]}]},{"poster":"Shnissugah l","date":"2017-01-01T12:39:16.058+0000","up_votes":2,"down_votes":0,"body":"Hay otra forma de molestar que no me gusta para nada (es la que mas me afecta), y es el famoso ping de '?' o 'enemigo desaparecido', se que algunos lo hacen en tono de broma o burla por cometer un error, entre amigos esta bueno y nos reímos todos, ¿pero que desconocidos te lo hagan continuamente acompañado de algún que otro comentario feo? a mi eso me saca bastante de mis casillas y tiendo a disminuir mi nivel de juego (si, soy algo sensible), lo peor es que esos pings no se pueden mutear individualmente, solo bajando el sonido a todas las alertas, es una solución a medias porque muchos necesitamos esos sonidos para estar mas atentos a la partida.\n\n Quizás en mi caso tiene algo que ver con que juego casi unicamente Blitzcrank, y bueno, hay veces que los buenos hooks no llegan y eso muchos no lo perdonan.","replies":[]},{"poster":"Li Grim","date":"2016-12-31T18:05:48.160+0000","up_votes":2,"down_votes":0,"body":"Es muy molesto cuando en el equipo enemigo va alguien fed, lo campeamos entre 3 y empieza a decir: \"pero no se les vaya a caer la R :c\" , \"una kill por torre y dragón :)\", o el típico hablador que dice: \"síganme focuseando jajaja xdexde\" o \"por qué me golpean a mi\" Ah, pero cuando la partida se da vuelta no escatiman en echarle la culpa a otro, y siempre comentando con caritas y diciendo \"adc malo xd\" o \"la ganaron por mi mid que es un asco :)\"\n\nMutearía el chat enemigo si no me ayudara a identificar a los tóxicos del otro equipo para reportarlos.","replies":[]},{"poster":"Flánn","date":"2016-12-31T17:56:18.759+0000","up_votes":2,"down_votes":0,"body":"Welcome to League of Legends lo que yo hago es /mute all y ocultar el chat (asi cuando escucho el ruidito no me da curiosidad)","replies":[{"poster":"Ellora","date":"2017-01-01T16:39:08.939+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EL parkito,realm=LAS,application-id=v7qsfXsE,discussion-id=vEVQEzjO,comment-id=0002,timestamp=2016-12-31T17:56:18.759+0000)\n>\n> Welcome to League of Legends lo que yo hago es /mute all y ocultar el chat (asi cuando escucho el ruidito no me da curiosidad)\n\nsi muteas ALL para que ocultas el chat???  Usalo para pings, asesinatos, control de tiempos","replies":[{"poster":"Flánn","date":"2017-01-01T19:50:04.797+0000","up_votes":1,"down_votes":0,"body":"Cada quien con sus gustos, ademas ya dije el porque h3h3h3h3h3h3h3h3h3h3h3hh3h3h3h3h3h3h3h3h3h3h3","replies":[]}]}]},{"poster":"Ladytami","date":"2017-01-02T07:01:37.739+0000","up_votes":1,"down_votes":0,"body":"Yo siempre me salgo antes de que pongan algo en el chat y en partida si se ponen pesados los muteo, si no me estresa jugar","replies":[]},{"poster":"Payaso down","date":"2017-01-01T20:19:17.780+0000","up_votes":1,"down_votes":0,"body":"Solucion = mute","replies":[]},{"poster":"feed no jutsu","date":"2017-01-01T15:31:08.088+0000","up_votes":1,"down_votes":0,"body":"**Muy poca gente reporta**, **hay un troll y el equipo enemigo no le va a importar porque no es su problema, hay un afk y al equipo enemigo no le va a importar porque no es su problema**, te toca una premade de 4 personas insoportables que no paran de pingearte y flamearte y al equipo enemigo no le va a importar porque no es su problema, de paso, las premades se van a defender entre ellos, repito si no entendieron,** Muy poca gente reporta** . La sociedad es tan injusta a veces, desde gente que culpa a otra gente inocente y luego el inocente es tiene toda la culpa sin antes pedir pruebas, por que la gente cree todo lo que ven en internet y en las noticias y eso parece que nunca cambiará.","replies":[{"poster":"iTargaryen","date":"2017-01-01T17:57:07.082+0000","up_votes":1,"down_votes":0,"body":"Lamentablememte estamos asi. Deberian TODOS, sea cual sea el equipo, empezar a recapacitar y reportar a quien se lo merezca. Mucha gente no reporta porque dicen que \"los reports no sirven\" \"reportame total no hace nada\" pero no es asi, si todos los que no reportan por estas razones empezaran a reportar estoy seguro de que se haria una gran diferencia y quiza muchos jugadores toxicos que pasan desapercibidos por estas razones no safarian.","replies":[]}]},{"poster":"La corrupción","date":"2017-01-01T15:32:16.589+0000","up_votes":1,"down_votes":0,"body":"El report X al menos yo y creo que varios otros lo dicen por flameos, pero si, tampoco se puede saber","replies":[]},{"poster":"FedecarboneroUY","date":"2016-12-31T21:10:33.797+0000","up_votes":1,"down_votes":0,"body":"peor son los que se la pasan toda la partida burlándose de si hiciste algo mal o algo, y buscando pelea por más que no le contestes y al final de la partida te ponen \"gg wp\" como que no pasó nada.. esos caretas son peores que cualquier otra cosa {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Benja God","date":"2016-12-31T18:27:55.800+0000","up_votes":1,"down_votes":0,"body":"Así es cada día -.-\n\nLo único que hay que hacer es reportar :v","replies":[]}]}