{"poster":"iTargaryen","date":"2018-01-10T02:13:31.049+0000","title":"La realidad de la gente tóxica y similares","subforum":"Charlas Generales","up_votes":6,"down_votes":2,"body":"**Muy buenas,**\nEs un tema que se ha hablado mucho como otros tantos, pero me gustar&iacute;a dar mi opini&oacute;n puntual y es algo que como dice el titulo ayuda mucho tanto en rankeds o normales siempre y cuando se este en SoloQ, aunque tambi&eacute;n en no tan raras ocasiones sucede en premade o duo, los t&oacute;xicos, flammers, trolls... Como le quieran decir.\nAprender a ignorar. Muteando a todos desde el principio de la partida incluyendo al otro equipo; muchos dicen &quot;pero me aburro si no habla nadie&quot; &quot;pero no todos son los que molestan&quot; y yo a esto vengo y me pregunto: si no conoces a nadie ya que estas en soloQ &iquest;prefer&iacute;s tener que aguantar lo que digan los dem&aacute;s sobre como jugas, sobre como escrib&iacute;s, lo que sea, que te insulten por cada m&iacute;nimo error y que encima tengas que soportar que esto muchas veces te pueda llegar a afectar? &iquest;viniste a jugar bien y a ganar o a escribirle y seguirle la corriente a los dem&aacute;s (SoloQ)?. Si no todos son los que molestan, selecciona el mute, no mutees a todos si alguien esta siendo positivo o te cae bien. Ahora quiero abarcar algo mas general que por ah&iacute; tambi&eacute;n les va a servir mucho en la vida real son personas que son t&oacute;xicas para ustedes.\nDicho esto, veamos algo m&aacute;s detenidamente lo que debemos aprender a ignorar:\n\n1-**Las críticas de los demás**. Nadie nos puede afectar sin nuestro consentimiento. O sea, somos nosotros lo que damos validez a las opiniones de los dem&aacute;s. Lo que otros piensen sobre las decisiones que tomamos no deber&iacute;a importarnos, ya que es tan probable que nosotros nos equivoquemos como que ellos lo hagan.\n\n2-**La creación de inseguridades**. Hay personas que se piensan que son expertos en la vida de todo. Estos acaban consciente o inconscientemente, creando inseguridades y peque&ntilde;as frustraciones en la gente que les rodea. Procura ignorar este tipo de actitudes, pues solo te conducen a la frustraci&oacute;n.\n\n3-**Preocuparnos por lo que no podemos controlar**. Si nos preocupa c&oacute;mo va a actuar esa persona o qu&eacute; va a hacer o decir, algo va mal. O sea, la gente no va haciendo da&ntilde;o deliberadamente y no deber&iacute;a de tenernos en vilo que nos respeten o no.\n\n4-**Las comparaciones obsesivas**. Est&aacute; muy bien que la gente triunfe y tenga &eacute;xito, pero no que hagan sentir a los dem&aacute;s poca cosa. No hay persona m&aacute;s insignificante que aquella que usa sus logros para menospreciar a los dem&aacute;s. Por eso, sigue centr&aacute;ndote en lo que t&uacute; puedes hacer para seguir creciendo y recuerda que lo que consigas depende en gran parte de que te lo creas. Un ejemplo de estos son los oros contra los platas y bronces o los challengers contra los platinos y diamantes.\n\n5-**Los intereses y egoísmos**. No todo el mundo te est&aacute; ayudando cuando intentan aparentar estar haci&eacute;ndolo. Empieza a desactivar la realidad y analiza hacia qu&eacute; lado se inclina la balanza siempre. Un ejemplo es cuando te dicen &quot;si te insultan es para que mejore y no vuelvas a cometer el mismo error&quot; cuando en realidad es mentira, solo empeora las cosas y te hace jugar mejor\n\nD&eacute;jenme su opini&oacute;n al respecto abajo {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Pusheenosaurus","date":"2018-01-10T07:03:27.254+0000","up_votes":2,"down_votes":0,"body":"> 3-**Preocuparnos por lo que no podemos controlar**. Si nos preocupa c&amp;oacute;mo va a actuar esa persona o qu&amp;eacute; va a hacer o decir, algo va mal. O sea, la gente no va haciendo da&amp;ntilde;o deliberadamente y no deber&amp;iacute;a de tenernos en vilo que nos respeten o no.\n\nEl mejor consejo que puede recibir alguien que juega SoloQ\n\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Mona","date":"2018-01-10T03:49:54.978+0000","up_votes":1,"down_votes":0,"body":"No se cual era tu intención al escribir esto. Pero me da la sensación de que estoy leyendo un libro de auto ayuda.\nMe haces acordar a [Osho](https://lamenteesmaravillosa.com/las-10-mejores-frases-de-osho-para-reflexionar/).","replies":[{"poster":"iTargaryen","date":"2018-01-10T04:37:55.740+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gremp,realm=LAS,application-id=v7qsfXsE,discussion-id=omRieUzn,comment-id=0002,timestamp=2018-01-10T03:49:54.978+0000)\n>\n> No se cual era tu intención al escribir esto. Pero me da la sensación de que estoy leyendo un libro de auto ayuda.\n> Me haces acordar a [Osho](https://lamenteesmaravillosa.com/las-10-mejores-frases-de-osho-para-reflexionar/).\n\njajaj no tengo ninguna intención, la única es compartir mi opinión respecto al tema y cada uno lo toma como quiere... si es útil, inútil, reflexivo, interesante, obsoleto eso lo deciden ustedes,\nlo que si no voy a negar es que intento hacer entender a la gente \"frágil\" o \"afectada\" que en realidad no tienen que dejarse llevar.. si no tomar este tipo de cosas de otra forma y mejorar su rendimiento en el juego e incluso en la vida real si es que se cruzan con gente tóxica.","replies":[]}]},{"poster":"uguibuu","date":"2018-01-10T02:33:36.153+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Exe Veigar","date":"2018-01-10T02:15:42.051+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}