{"poster":"HeisserKakao66","date":"2019-11-25T12:16:28.419+0000","title":"Hilfe bei melden eines Spielers beim Support","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":2,"body":"Ich möchte jemanden manuell beim Support melden, kann mir jemand erklären was ich hier angeben soll?\r\n\r\n> WIE LAUTET DER BESCHWÖRERNAME DES SPIELERS, DEN DU MELDEN MÖCHTEST?\r\n\r\nals Zusatzbeschreibung steht da noch darunter:\r\n\r\n> Stelle bitte sicher, dass du den Link richtig eingegeben hast (samt allen Sonderzeichen), da wir deine Meldung sonst nicht bearbeiten können.\r\n\r\n\r\nSoll ich da den Profillink des Spielers einfügen oder nur den Namen? Besagter Spieler hat heute auch noch seinen Namen verändert. \r\n\r\n\r\nWenn ich von einer Spielsituation mit absichtlich unter den Turm rennen berichten möchte, reicht da die Zeitangabe (z. B. zwischen Minute 6.30 bis 7) des Geschehens im Spiel oder sollte ich noch das Replay hinzufügen bzw. hat der Support Zugriff auf das Replay ohne dass ich dieses anhänge?","replies":[{"poster":"Hakkuu","date":"2019-11-25T12:26:33.427+0000","up_votes":1,"down_votes":0,"body":"Hab mir das gerade selbst mal angeschaut - das ist ja tatsächlich totaler Schwachsinn. Ich würde einfach den aktuellsten Namen eingeben, keinen Link.\n\nIch weiß nicht, ob der Support Zugriff auf alle Replays hat. Ich würde einfach einen kleinen Clip anhängen - geht ja mit dem Aufnahme Tool im Client ganz easy.","replies":[{"poster":"HeisserKakao66","date":"2019-11-25T12:30:55.459+0000","up_votes":1,"down_votes":0,"body":"> Ich weiß nicht, ob der Support Zugriff auf alle Replays hat. Ich würde einfach einen kleinen Clip anhängen - geht ja mit dem Aufnahme Tool im Client ganz easy.\n\nOh da kann man Clips machen. Danke für den Hinweis, dann muss ich mir das heute Abend mal genau anschauen.","replies":[{"poster":"Flintenweib","date":"2019-11-25T16:11:54.395+0000","up_votes":1,"down_votes":0,"body":"Es werden leider keine Chats mitaufgezeichnet... oder geht das inzwischen?!\n\nVor kurzem hatte ich auch ein \"böses\" Spiel mit sehr toxischen Flamern.... dachte ich mir: lade das Spiel danach herunter und mache in Ruhe die Screenshots von den Verbalausfällen... aber Pustekuchen... kein Chat in der Aufzeichnung...\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Noxempire","date":"2019-11-25T16:14:32.712+0000","up_votes":1,"down_votes":0,"body":"Der Player Support kann die Chatverläufe von Games einsehen. Screenshots und Videos sind zwar nett gemeint, können aber auch gefälscht sein. Der Player Support muss so oder so auf Nummer sicher gehen.\n\nAm besten aber benutzt du für sowas direkt in der After Game Lobby die Reportfunktion. Die ist bei toxischen Verhalten im Chat meist zuverlässig.","replies":[]}]}]}]},{"poster":"STW MissesAhri","date":"2019-11-25T13:51:01.381+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nin deiner Match History oder per op.gg kannst du den Namen des Spielers sehen.\nAm einfachsten ist es tatsächlich, bei op.gg in das Spiel zu gehen und dort auf die Person zu klicken um den Namen richtig zu kopieren.\nDamit hast du den ersten Schritt erledigt.\n\nDu kannst beim 2ten Punkt Dateien hinzufügen, dort ist nicht erneut der Name des Spieler gemeint. Am besten machst du ein kurzes Video und sendest dies anliegend dazu. :)","replies":[]}]}