{"poster":"MJLeddy","date":"2017-03-31T20:36:22.446+0000","title":"My mouse doesnt work in game","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"One game it was there, the next when I loaded in my mouse doesn't work. It still works in game it is just invisible and makes it impossible to use. If I switch it to windowed or borderless it works, but the game is very zoomed in and cant be played on. \r\n\r\nIf anyone has a solution for me it would be much appreciated.\r\n\r\nI play on a Windows computer if that makes a difference","replies":[{"poster":"Broporo","date":"2017-03-31T21:46:26.923+0000","up_votes":1,"down_votes":0,"body":"Not being able to see your mouse would really make it difficult to be on top of your game I'm sure. This mouse disappearance might be caused by some kind of windows setting, so let's check for that first. \n\nLook over our [**Mouse and Keyboard Guide**](https://support.riotgames.com/hc/en-us/articles/201761934-Mouse-and-Keyboard-Issues#wq1) and let me know if that helps.","replies":[{"poster":"MJLeddy","date":"2017-03-31T21:54:10.479+0000","up_votes":1,"down_votes":0,"body":"I have done all of this and it still wont show in game. I've looked up different things on later threads made by other people and tried all of those tips also and they still don't help. D:","replies":[{"poster":"Broporo","date":"2017-03-31T21:58:12.557+0000","up_votes":1,"down_votes":0,"body":"Since it doesn't seem like your settings are the cause of your mouse disappearing, there might be something very specific affecting it. Let's see if we can get to the bottom of this through a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). \n\nWe'll be able to go much more in depth in your ticket!","replies":[{"poster":"MJLeddy","date":"2017-03-31T22:32:32.815+0000","up_votes":1,"down_votes":0,"body":"That didn't fix the problem either... would it just be better to re download the game instead?","replies":[{"poster":"Broporo","date":"2017-03-31T23:11:00.161+0000","up_votes":1,"down_votes":0,"body":"I looked into what was going on with your ticket, and it looks like the tech agent is still waiting for your reply! Be sure to check your ticket for their update so they can continue helping you!","replies":[]}]}]}]}]}]}