{"poster":"HyperTechno","date":"2018-04-06T15:43:44.624+0000","title":"Quinn's W (Heightened Senses) ability mini rework. (Concept)","subforum":"Concepts & Creations","up_votes":1,"down_votes":0,"body":"As a dedicated Quinn main, I have always found the W unappealing and boring. This doesn&#039;t mean others don&#039;t like this ability, but I don&#039;t see many uses for this ability. So I took some time and thought about some ideas to make it a lot better, also I reduced the cooldown time by a lot. It almost takes a minute to reuse, and many Quinn mains don&#039;t max W first, I mean, I have wards for a reason Riot.\r\nIts just an idea, I like Quinn as is. However, I want her W chanced. It has an unreasonable long cooldown, it gives so little, and I really can&#039;t use it for my team.\r\n\r\n**(W) Heightened Senses - *Active*:** Quinn signals Valor to scan a target area for 5 - 10 seconds. Using Blinding Assult will deactivate the vision.\r\n[What I tried, was to create a long-range vision ability. To balance it out, I limited the vision for your allies, but you get the best benefit.] \r\n\r\nRange: 2500\r\nAlly Vision Radius: 600 - 850\r\nQuinns Vision Radius: 1100 - 1350\r\n(W Passive Range) Valors Sight: 850 [I didn&#039;t want Quinn&#039;s (W) passives to be over effective, so I limited them by decreasing the range.]\r\n\r\n(W) Assassination - Passive: If Quinn used Vault in Valors Sight, next attack towards enemy champion will be dealt double damage.\r\n[I think, Quinn is an assassin so I gave her some extra burst.]\r\n\r\n(W) Pin Down - Passive: If Quinn used Binding Assult in Valors Sight and hit an enemy, Quinn&#039;s attack speed is increased by 80 - 160%.\r\n[She already had an attack speed increase, but I think this would lead to some fun plays.]\r\n\r\n(W) Hunter&#039;s Security - Passive: If Quinn is in Valors Sight, Quinn&#039;s movement speed is increased by 10 - 20%.\r\n[A lot longer MS increase.]\r\n\r\n(W) Counter Attack - Passive: If Quinn is in Valors Sight and she is attacked, Quinn will try to dodge the next incoming attack, taking reduced damage. Valor swoops down dealing physical damage to the attacking enemy, applying fear, and a 25% slow for 1.5 seconds. Marking them vulnerable.\r\n[To make outplays, and this would fit Quinn quite well. I got the idea from her lore when she kills the assassin.]\r\n\r\nDamage reduction: 10% - 35%\r\nValor Damage: 20 - 60 (+ 20% AD)\r\nCooldown: 30 seconds.\r\nMana: 60 - 80\r\n\r\n(W) Sound effects: Valor can be heard flying around the target area if the enemy is within 800 units.\r\n\r\n(W) Side Effect: This ability is disabled during Behind Enemy Lines.\r\n\r\nSo what do you guys think? Do you think Quinn&#039;s W is good as is, or would you like the change? If no, do you think the changes, I suggested, are good?\r\n\r\nThank you so much for reading, if you found any Grammar errors you can inform me. I want to learn from my mistakes and get better.","replies":[{"poster":"Wulf Helhammer","date":"2018-04-06T16:33:44.523+0000","up_votes":3,"down_votes":0,"body":"Wait...are all of those passives part of the rework, or are those just different concepts?\n\nAlso, no, I don’t want Quinn’s W changed, and I don’t think many of us Quinn mains do either. The ability is insanely powerful, both in the active and the passive from harrier marks. If you can’t see the power from on demand vision, and think wards are better, I really don’t know what to tell you.","replies":[{"poster":"HyperTechno","date":"2018-04-07T01:35:43.275+0000","up_votes":1,"down_votes":0,"body":"Yes, the Passives are part of her (W) rework.\n\nWell, it's powerful in the sense that you get to see things around you, but since Valor is a bird, I was thinking why not send him over to scout a target location. But that's just me. But you do not get much out of Quinn's W passive, unless if you max it first. Which most Quinn mains don't do, it's either the second or third. The 50-second cooldown makes the ability extremely weak to use. I would like them to turn it down to a 30 or 20 seconds cooldown at all levels instead. The 20% MS and AS at level one is laughable at best until it hit level 5. \n\nKai'sa (E). 40% AS and 55% MS at level one, that insane. You only have to wait 1.2 seconds. Cooldown 16 seconds.\nLucian (E). 60% MS at level one for hitting an opponent. Cooldown 14 seconds.\nDraven (W). 20% AS same as Quinn, but 40% MS at level one. Cooldown 12 seconds.\nJinx (Q) Pow-Pow. 30% AS at level one. No cooldown.\nSivir (Passive). 30% MS when damaging an enemy champion. No cooldown.\n\nKai'sa and Draven, who have similar trades does much better than Quinn. The only advantage Quinn has between the two is the vision control, witch only last for 2 seconds and has a 50-second cooldown. The buffs are mediocre, and the cooldown is too long for such an ability that gives only so little vision control.\n\nQuinn is a strong champion right now, but she isn't a good champion for the reason that she can't give too many benefits, for your team. They could at least buff her W to make it beneficial for you and the team. \n\nQuinn's Passive, Q, E, are great abilities. The Q can benefit the team and Quinn, the E is good as well as her Passive. Quinn's W is offering little to nothing. The ult is Meh, but I like the ult now. It's useful now that they fix those unnecessary restrictions.\n\nBut I get what you're saying, and I will admit that it's a powerful ability. However, too many unnecessary restrictions and it could use a little more like my Counter Attack passive. I would like to see Counter Attack becoming a part of her W the most. Her lore describes her as this assassin anti-assassin ranger, who uses traps to capture her opponent, so I would love to see Counter Attack added to her W. It would not only be a playmaker in itself, it would tie her to her a lore a lot more.\n\nThanks for the reply and your thought's. I'm just, very stubborn.","replies":[]}]},{"poster":"Stacona","date":"2018-04-08T02:19:04.895+0000","up_votes":1,"down_votes":1,"body":"As someone who plays Quinn a lot and loves her, and I just build traditional marksman because she scales super well with that build like as a hyper marksman, but I love utility marksmen because they always feel useful and when they eventually get their items then becomes strong by late game, for Quinn it is Essence Reaver and Statikk Shiv and then Death's Dance to finish off the CDR cap and give life steal and defense.\n\nI love being able to fly around and scout out areas and her passive portion is super strong for a marksman to have and feel super satisfying. The only ability I would change would be her Q to something that feel better to her kit and goes with it better.\n\nQuinn should be moved more towards marksman and playing around her passive.\n\n****\n\nAlso this is way too complicated and I have no idea of what I am looking at... AT ALL!!","replies":[{"poster":"HyperTechno","date":"2018-04-08T03:32:39.649+0000","up_votes":1,"down_votes":0,"body":"LMAO, I love your last response. \n\n> Also this is way too complicated and I have no idea of what I am looking at... AT ALL!!\n\nI tried to make it look professional and listed, guess I didn't do a good job. XD\n\nI'm the more assassin Quinn lover on this topic, but I like her as a standard ADC as well. The thing I dislike is how they characterize her as this Ranged Assassin style champion in her lore, without making her an Assassin. If Riot took the path; making her a standard ADC. It would ruin her lore.\nQuinn is a champion made well but delivered incorrectly. Even Riot agrees with this statement.\nThis could motivate a complete rework for Quinn as a champion. Kit, lore, design, everything. They may even remove Valor, and do the same to him as they did to Beatrice. Swain's bird. I hope not.\nQuinn is a well-designed champion but lags a direct identity. She can't be an ADC because of her lore, but she can't be an Assassin because of her kit.\nQuinn is probably on the table for a full rework. Would I agree on one? Not really. But after what they did to Irelia, I'm more than happy to announce that I would like to see Quinn's rework.\n\nI love Quinn. I don't care if she the same for the game's history, or if they change her now or later. She was the first champion I learned to master, got master 7, and the first champion I ever bought with IP, now BE. Her rework is going to be the first rework I'm probably going to hate or love the most. Riot better do a good job, if they are considering on reworking Quinn, or else I'm out. For good.\n\nYou can try my new stupid build:\n\nGo conquer with all the standard Quinn precision tree picks, and then take Sorcery. \n{{item:3078}} {{item:3006}} {{item:3031}} {{item:3142}} {{item:3508}} {{item:3124}} \nUse it in a normal or draft game, plz, this is probably a huge troll build.","replies":[{"poster":"Stacona","date":"2018-04-08T05:13:54.271+0000","up_votes":1,"down_votes":0,"body":"Her current W is simple and fulfills what the marksman wants which is vision, also offers scouting with her ultimate. Only thing they should change with his Quinn is her Q to make it less awkward and clunky to use and be more fluid with her kit, because everything else works seamlessly with each other\n\nWhatever you did is adding over the top complications for no real reason.","replies":[]}]}]}]}