{"poster":"HyperTechno","date":"2018-09-24T19:18:08.393+0000","title":"A meta, I think, could make LoL more enjoyable. (Agree or Disagree)","subforum":"Gameplay","up_votes":1,"down_votes":4,"body":"Mages, and AP burst:\r\nI believe that mages need newer cheaper defense items or a new form of Spellvamp. Mages have restricted options in defense towards burst, DPS, and other mages. Concluding in mages depending on being OP to be useful. (Zoe, Dianna, Syndra, Ryze, etc.)\r\n\r\nHourglass&#039; cost should be lowered, not by much, about 200 to 500.\r\nGive armor availability for Banshee&#039;s Veil, but increase the cost by 100 to 200.\r\n\r\nItems for AP Bruisers, if not existing, create your first AP Bruiser. (Turning, some, AD Bruisers into AP Bruisers would work too. Such as; illaoi)\r\n\r\nADB, ADC, and Bruisers:\r\nIncrease cost on all lethality, and nerf the damage by a minimal amount.\r\nNerf AD defense items.\r\nNerf Crit.\r\nNerf AS item damage, or damage effect.\r\nGive healthier options for DPS champions.\r\nLower TD assessability.\r\nNerf, some champions, farming potential.\r\nMake some defense items useless for ADB and ADC&#039;s.\r\nNerf GA, by increasing cost and damage given.\r\n\r\nIn general, too much AD.\r\n\r\nTanks:\r\nMake them empower other champions while letting them be a wall. Tank champs should depend on the team. To help out with their lack of damage the tank empowers the team by being, tanky. Make a rune, that state: \r\n* Other allies gain &quot;number&quot; of adaptive damage for % of your max health.\r\nor\r\n* Allies take % less damage when near you, for % of your max health.\r\nor\r\n* You gain &quot;number&quot; of Adaptive damage for each ally near.\r\n\r\nTanks should be hard to kill but deal the least amount of damage, unless if it is the last type of rune.\r\n\r\nJungle:\r\nKeep as such.\r\n\r\nYou guys will be deciding if it&#039;s a good idea, if not state your reason, I will be happy to read them. If you think you could come up with a better meta, plz, write it on the board, not here.\r\n\r\nThanks for reading.\r\n\r\n(Any grammar, spelling, or mishaps? Tell me. It will improve my writing and style. Thank you.)","replies":[]}