{"poster":"HyperTechno","date":"2018-01-15T03:03:23.458+0000","title":"Why saying Zoe is broken is nonsense. (Repost)","subforum":"General Discussion","up_votes":3,"down_votes":6,"body":"This post will be reposted several times, the reason for its repost is to get new people involved and new opinions made. If you found a counter or a champion you should not play against Zoe plz do write it down in the comment so people can be aware of what can work or not.\n\nLet us get right down to it, people are either lazy or are just bad at positioning. You can agree or disagree.\n\nZoe is a champion that punishes people for their poor positioning or map awareness. Because 90% of League players, including me, can miss position and forget about our map. A good Zoe will abuse any chance they can get to find an out of position champion to kill. The nerf she got is completely irrelevant and is unhealthy for her as a champion. Because of the reason change, she lost some of her needed punishing power. She is good because she can punish, not because she is broken, and people crying about it won&#039;t make them better at avoiding her E or Q. \n\nMy last game I was facing an Ekko, this Ekko did a solid job of trying to dodge my abilities, and he won the game. But, his team was a little lazy and did not dodge as their Ekko and gave me some nice easy kills.\n\nHowever, I am not saying she became weak, she is still strong in the right hands. I am one of them.\n\nBut this champion is what I have been wishing for, a champion that can really punish people for their miss position. Some will argue that Kat is the best champion for punishing people for their miss position. Yes, but also no, see Kat&#039;s daggers can be seen and predicted a lot easier and gives the enemy enough time to reposition, compared to someone like Zoe. If you miss positioned, that is it, no second chance for you. \n\nI have to be honest, I think Zoe is the best thing for Leauge of Legends. Now people will be forced to think about what they do, one miss step you can get punished, by getting one shot. People will then argue, but you do not know how it is like to be one shot by a Zoe. Actually, I know how it feels, it is annoying. But, then I think what did I do wrong instead of blaming the champion that one shot me. \n\nYou cannot really get the same thought process if you were one shot by a Zed. You can be in position or out and still be one shot by Zed.\n\nDo you want to know how to counter Zoe? Then learn how to position, use your map, and ward.\n\nIf you want to counter her with a champion.\n{{champion:238}} {{champion:157}} {{champion:90}} {{champion:268}}  are your best bet.\n\nZed, because he is Zoe, but can punish you for being in position or out.\n\nYasuo, because of his dash and wind wall.\n\nMalzahar, because it is fucking Malzahar. \n\nAzir, I have found that because of his range he can pock Zoe quit well and safe. He can also farm quite nicely too without getting caught in Zoe&#039;s E. (I have not played against Azir with Zoe yet, so do not take my word for it. But anyone want to share, plz do.)\n\nIf you are good at positioning, here is some champions you can play to counter her.\n{{champion:245}} {{champion:133}} {{champion:105}} {{champion:103}} {{champion:99}} \n\nEkko is just good at moving around, so if you know how to play him, you should be solid.\n\nQuinn&#039;s main ability is to be fast and do massive damage to a single target fast. Because Zoe does not have any real mobility. Quinn can outrun her and out damage her. Quinn can also out roam Zoe, creating pressure at different lanes way easier than Zoe.\n\nFizz depends on the person who plays him. He is either terrible against her or he is a god against her.\n\nAhri, her charm is what can kill a Zoe. Under the charm, Zoe won't be able to use her abilities and Ahri can get some free damage on Zoe if the Ahri is good. \n\nLux can be effective against Zoe, but because she lags mobility you have to be careful.\n\nChampions you should avoid using against Zoe.\n{{champion:115}} {{champion:69}} {{champion:99}} {{champion:84}} {{champion:105}} \n\nZiggs can be easily out damaged by Zoe and because of his lag of mobility, Zoe can find easy out of position moments on Ziggs.\n\nCassiopeia just does not have the range nor the damage or the mobility to deal with Zoe. Just do not pick Cassiopeia against Zoe. (I felt really bad for the Cassiopeia is squashed, because she just could not reach me.)\n\nLux, because of her lag of mobility, but you can out damage a Zoe so Lux can win.\n\nAkali is just like Cassiopeia except she has mobility. Just do not.\n\nAs I said either Fizz is garbage against Zoe or he is a god against a Zoe.\n\nIf you want to see the old comments do go check them out.","replies":[]}