{"poster":"Reventhur","date":"2017-05-12T04:13:09.255+0000","title":"Any tips on getting better at league?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I just started league recently keep in mind this is my first moba but i hear alot of talk about league and thought id try it out im only level 10 so as you can tell im still a noob however my only issue is i dont think im improving i mostly play amumu and i try to stick to bots but my skill doesnt seem to increase i try playing against real players but just get killed any tips on how i can get better will be gratefully appreciated","replies":[{"poster":"BarryButcher","date":"2017-05-12T05:32:30.344+0000","up_votes":3,"down_votes":0,"body":"Normals are hard for new players because despite you only being level 10, you will be in games with at least a few people who are already level 30 and probably been playing league for years.\n\nFor starting out  I would say, just try to have fun. You can play vs AI, throw in some ARAMs. I remember when I first started I avoided ARAMs because I thought it would be the same as normals. Feeding your ass off and teammates getting annoyed but most people don't take ARAMs seriously so you can play them, be a noob and still have fun.\n\nOnce you can get through an AI game without dying and grabbing a couple Pentakills, i'd say you are roughly Silver level.\n\nWatch YouTubers or Streamers that \"teach\" the game.\nLearn the 5 roles. Top/Jungle/Mid/ADC/Support\nJust spend your time whilst ranking up to learn about how champions work. Don't just stick to 1 champion the whole time. Play as many as you can.","replies":[]},{"poster":"Pured","date":"2017-05-14T06:28:36.203+0000","up_votes":1,"down_votes":0,"body":"The thing is, getting destroyed will help you improve much more than beating easy bots.\nAlso, bots play differently, and in my opinion, are much stronger than other beginners in normal games.\n\nStart off with just a few simple champions, e.g. Amumu/Udyr jungle, Annie, Brand mid, Darius, Garen top, Caitlyn, Ashe ADC, Janna, Blitzcrank support.\nOnce you get used to those champions, you can expand. Over time, your knowledge of roles and all of the champions' abilities will come.","replies":[]}]}