{"poster":"Mr Tongue","date":"2019-05-09T21:07:05.504+0000","title":"Ya no se que decir...","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":5,"body":"no voy a perder tanto tiempo quejándome\r\n\r\nResulta que estaba jugando una partida NORMAL en la que mi KDA no fue el mejor (0/10/1) esta bien, acepto haberla manqueado, pero el problema llega cuando la kai sa pide report. yo iba 0/6 en ese entonces, no puedo hacer nada ya que el ryze se rehusaba a rotar y mi jg se rehusaba a gankearme, al decir esto, yo le respondo en un tono bastante tilteado (mal gesto de parte mía) y con mayúsculas. al hacer esto, kai sa me pide report por flamer, yo sigo muriendo al no poder hacer nada en la partida (digo que no puedo hacer nada porque no tenia el daño suficiente para hacerme algunos campamentos y tampoco podía farmear en linea porque me deleteaban de a 3 habilidades). Yo sigo diciendo que como me van a reportar si no me ayudan ni tampoco me dan opciones (en algunos de mensajes comentarios hable en mayúsculas)y al final me dieron restricción de chat.\r\n\r\nAhora tengo restricción de chat de 10 partidas solo por UNA partida de reports injustos (en mi humilde opinión claro está)\r\n¿soluciones? jugar con /mute all todas las partidas, espero que apoyen este post, pero viendo como los votos negativos abundan por esta sección no creo que algo bueno salga de aquí.\r\n\r\nDesde ya muchas gracias por tomarse las molestias de leer esto &lt;3","replies":[{"poster":"Evanz","date":"2019-05-09T22:23:35.827+0000","up_votes":2,"down_votes":1,"body":"Pasa, podes tener 200 partidas jugando calmado, sin usar el chat, haciendo tu partida, con la mejor para que el equipo gane, y de repente se te zafa la chaveta, hablas de mas, y te cae el chat ban. A mi me paso que me emparejaron cn una premade de 4, ninguno de los 4 tenia el mas minimo interes de colaborar, el mid laner se quedo afk bajo torre toda la partida, no pingueaba los ss, la bot no paraba de morir, cuando todo el team enemigo estaba feed, me cayeron a top y obviamente perdi las torres me mataron etc etc. Use el chat para hablar cn ese mid laner (cn un poco de mala leche eh de reconocer) y como eran premade 4 reports me comi, ademas del report del team enemigo porque claro, como ellos estaban ganando facil, ni les importaba reportar la obvia actitud de mi equipo, y a ellos tmb les dije algunas cosas, esta vez sin mala leche, pero bueno, como termino la historia? Ban chat para mi, y la premade nada. A veces el sistema de reports no sirve, y hay que aprender a vivir con ello.","replies":[]},{"poster":"The Crown End","date":"2019-05-09T21:11:26.753+0000","up_votes":2,"down_votes":1,"body":"La primera vez que veo un mordekaiser con protocinturon. Merecido el reporte de todos.\n\nMorir una vez, bueno, dos, esta bien, ya ahi, JUGAS BAJO TORRE, y listo. Si moriste 10 veces, es porque intentabas pelear todavia, no me vengas con \"me divearon\", porque un dive lo evitas con wards, y si sabes que te van a divear, te haces para atras y regalas la torre lamentablemente pero dejas de fedear.","replies":[{"poster":"Mr Tongue","date":"2019-05-09T21:14:43.654+0000","up_votes":1,"down_votes":1,"body":"osea para vos morir por no saber jugar un champ y tampoco tener control del juego y no saber las mecánicas es motivo de report? soy main supp y estoy practicando top,  me diveo el aatrox con ultimate y yo no podía hacer nada porque ni farmear  me dejaba. No se como  pensas que por  llevar morde con protocinturon (item que se recomiendo en morde) sea motivo de report...","replies":[{"poster":"The Crown End","date":"2019-05-10T01:22:24.856+0000","up_votes":1,"down_votes":1,"body":"Si era normal todo bien, si era ranked, hasta ban merecerias. No se que fue la partida.\n\nPero tene en cuenta, que no te banean el chat por 1 partida, o 2, te lo banean cuando venis acumulando reportes validos hace rato, saludos.","replies":[{"poster":"Mr Tongue","date":"2019-05-11T01:52:49.589+0000","up_votes":1,"down_votes":1,"body":"básicamente en tu opinión tener malas partidas es motivo de report JAJAJAJAJA \n\nAmigo te voy a ser sincero, soy malisimo en el League of Legends y lo juego para ser mejor cada día, el problema es  que que cuando me cruzo gente como vos, se me van las ganas de todo.\n \"Si era normal todo bien, si era ranked, hasta ban merecerias\"  osea si yo salgo 0/10 y no es mi intencion \"trollear\" (porque en ningun momento trolle) es motivo de report\n\nle pongo fin a esta discusión porque al ver tus otros \"aportes\" en el foro ya me doy cuenta que sos una de esas personas con la que no se puede razonar.","replies":[{"poster":"The Crown End","date":"2019-05-11T01:59:58.905+0000","up_votes":1,"down_votes":1,"body":"1 - No soy tu amigo.\n\n2 - Si fedeas, es totalmente reportable, por eso esta la opcion \"SACRIFICIO INTENCIONAL\".\n\n3 - A mi me importa nada que fedeen y salgan 0/400 en normal, en ranked, es distinto porque uno pone el 100% de si mismo para ganar, juega por un objetivo, por LP, subir de liga, ganar la promocion, no descender etc etc, si vos te cagas en todos los demas en ranked, no llores cuando te baneen.\n\n4 - No me interesa tu opinion sobre lo que escribo, si no te gusta que te comenten, no publiques en el foro.\n\nSaludos.","replies":[{"poster":"Mr Tongue","date":"2019-05-11T02:06:01.916+0000","up_votes":1,"down_votes":1,"body":"repito, porque no te quedo claro, el report por las muertes no intencionales no existe y  nunca va a existir, yo salí 0/10 SIN INTENCIONES DE FEDEAR, pero al parecer no comprendes esa parte tan simple.\n\nLos reportes de \"SACRIFICIO INTENCIONAL\" son (como lo dice el nombre) reportes en contra de la gente que fedea intencionalmente (Y NO APLICA EN MI CASO) no se, te lo dejo ahí","replies":[{"poster":"The Crown End","date":"2019-05-11T02:57:47.740+0000","up_votes":1,"down_votes":1,"body":"Eso pensas vos, por que jugaras hace cuanto, 1 año?, 2 como mucho?, jaja te falta mucho papu, ni sabes la cantidad de gente que banearon por morir como vos todas las partidas.\n\nBesito segui llorando :*","replies":[]}]}]}]}]}]}]},{"poster":"Shíru","date":"2019-05-09T21:28:28.524+0000","up_votes":1,"down_votes":0,"body":"Usualmente es por varias partidas que te sancionan, pero 1 o 2 son las que explotaron la burbuja y te cae todo.\nAdemás, te creo tener 0 kills, tal vez 8 muertes, pero con 1 asistencia y todo eso? \nPor lo general ya se consideraría troll, es dificil que no si quiera puedas hacerle 1 de daño al enemigo","replies":[]}]}