{"poster":"iNNOVAk","date":"2015-03-24T17:19:31.412+0000","title":"Lista de jugadores flammers quiters afks","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":9,"body":"Hagamos una lista entre todos, con fotos, videos, etc, para poder por lo menos dodgear en el lobby o que RIOT pueda hacer algo...\r\n\r\nLa idea seria poner el nick del jugador con foto (varias) y si es mejor video editado con pocos segundos para ver si el player trollea.\r\n\r\nOjala se pueda prender toda la comunidad!\r\n\r\nUn gran abrazo.","replies":[{"poster":"Sir DaL","date":"2015-03-24T19:00:28.530+0000","up_votes":4,"down_votes":2,"body":"Hola a todos,\nEl problema es que el foro no es lugar para armar esos mensajes de cacería de brujas, en Riot creemos en la reforma, por eso no estamos poniendo ni cintas color negro o marcas a los jugadores que fueron baneados por toxicidad. \n\nYa tenemos un sistema de reporte y de baneos que pueden utilizar dentro del juego.\n\nEl foro es un sitio de debate, no de denuncias, mantengamos todos el buen ambiente y no mezclemos las cosas ^^\n\nLas reglas si importan, son necesarias para la convivencia del foro\nPuedes armar tu lista negra en una pagina externa, pero si lo haces aqui adentro estarás rompiendo las normas y serás sancionado ( no nos gusta sancionar, por eso es importante que avise)\n\nSaludos!","replies":[{"poster":"ACsino","date":"2015-03-24T23:36:49.715+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sir DaL,realm=LAS,application-id=PJAKt7ph,discussion-id=ibEpsNNm,comment-id=0002,timestamp=2015-03-24T19:00:28.530+0000)\n>\n> Hola a todos,\n> El problema es que el foro no es lugar para armar esos mensajes de cacería de brujas, en Riot creemos en la reforma, por eso no estamos poniendo ni cintas color negro o marcas a los jugadores que fueron baneados por toxicidad. \n> \n> Ya tenemos un sistema de reporte y de baneos que pueden utilizar dentro del juego.\n> \n> El foro es un sitio de debate, no de denuncias, mantengamos todos el buen ambiente y no mezclemos las cosas ^^\n> \n> Las reglas si importan, son necesarias para la convivencia del foro\n> Puedes armar tu lista negra en una pagina externa, pero si lo haces aqui adentro estarás rompiendo las normas y serás sancionado ( no nos gusta sancionar, por eso es importante que avise)\n> \n> Saludos!\n\ncon mucho respeto sir dal pero el sistema de reporte y mensajes al foro es muy malo desde mi punto de vista por que ya tengo en mirada 2 \"troll\" los cuales no mencionare sus nombres para no \"romper las reglas del foro\" los he visto ya en algunas partidas las cuales si no van la linea que quiere trolean o simplemente lo hacen por diversion.. y bueno si ya hay un sistema de baneo o baneo permanente \"si es que existiera\" por que siguen jugando estos tipos?","replies":[]},{"poster":"gambito700","date":"2015-03-24T20:35:08.227+0000","up_votes":3,"down_votes":2,"body":"con todo respeto, la comunidad entera, siente que el ''report'' no sirve de nada y que al denunciarlos via foro (tapando nicks y todo) hacen mucho mas que solo ''reportando'' . se que hay muchos que usan el sistema de soporte para denunciar y con el ''bot'' no quedan muy conformes muchos. \n\nnadie pide una cazeria de brujas. pero hay muchos (incluyéndome) que reportamos, bloqueamos, muteamos, etc y siguen apareciendo en las partidas, siguen trolleando o flameando. \n\nyo se que los rioters confian en su sistema, pero muchos, como comunidad, no podemos confiar en este sistema y muchos preferimos que se solucione este problema de comunidad, de flamers, de ragers, de afk's, de trolls antes que sigan sacando mas skins y reworks. \nestoy seguro que hablo por muchos, cuando digo que a esta gente que solo quiere ver arder el mundo, no les importa para nada un report al final de la partida.\n\ny por que estoy tan decepcionado de este sistema.... por que antes evitaba jugar en el dia por que esta lleno de esa gente toxica, pero ahora, no hay hora en la que pueda jugar para evitarlos.\n\n3 de 5 partidas tienen a un jugador toxico (sea flamer, afk (afk de esos que se quedan en base dando vueltas) trolls, etc) y creo que si el sistema de ''report'' sirviera, solo veriamos a 1 en 5 partidas.\n\nsi llegaste hasta aca, gracias por leer.\n\npdta. perdón las faltas ortográficas :)","replies":[{"poster":"F0RZAKEN","date":"2015-03-24T20:44:41.796+0000","up_votes":2,"down_votes":1,"body":"No hables por toda la comunidad. Yo sé que los reportes si funcionan. Nunca sentí que eran inútiles.\n\nEl problema real radica ahi mismo. Si piensas que el sistema de reportes no funciona, no lo utilizas... y eso genera que los trolls no sean reportados.\n\nLos reworks y los skins no tienen nada que ver con el sistema de sanción. Son equipos de trabajo completamente diferentes.\n\nEstar constantemente haciendo denuncias públicas solo generaría un mal ambiente. Las denuncias o reportes deben ser anónimos.","replies":[]}]},{"poster":"Kirtash","date":"2015-03-27T01:21:05.342+0000","up_votes":1,"down_votes":0,"body":"el lugar de denuncia y castigo es el tribunal, pero no esta si no tenemos el lugar. es obvio que vengamos aca? sabes cuando podria estar el tribunal que tanta falta hace?????","replies":[]}]},{"poster":"Cesth","date":"2015-03-24T17:29:00.997+0000","up_votes":3,"down_votes":1,"body":"Alguien no se leyó las reglas del foro","replies":[{"poster":"F0RZAKEN","date":"2015-03-24T18:22:54.986+0000","up_votes":2,"down_votes":4,"body":"\"las reglas poco importan cuando blabla\"  alguien no sabe como funcionan las cosas :P","replies":[]}]},{"poster":"iNNOVAk","date":"2015-03-25T15:36:30.901+0000","up_votes":1,"down_votes":0,"body":"Hay uno que se llama anusbi o algo asi que me baneo 2 veces esta cuenta y 1 otra por boludeces... te lo aclaro a vos que tenes nick rojo. Me baneo por que se le canto\n\nOn. La situacion no da mas. La cantidad de afks y trolls va a susperar a los buenos players. Yo sigo subiendo y ganando con afks y trolls pero se hace muy dificil... yo voy a crear la lista igual y la voy a promover por todos lados.\n\nLa gente de este server no merece. Hay gente buena pero te la encontras en el 20% de las partidas.","replies":[]},{"poster":"IrishRageQuitter","date":"2015-03-25T14:16:43.820+0000","up_votes":1,"down_votes":0,"body":"Lo ideal sería que creen un sistema de kickeo de trolls por votación de mayoría (en caso de que sea una premade de trolls) para poder mandarlos directamente de vuelta a la cola cuando se está en queue de ranked.\nLo poco que Riot cuida a los jugadores, al no castigar con la severidad debida a los que perjudican la experiencia de juego de otros o al no esforzarse en idear sistemas que permitan aislar a esos jugadores nocivos del resto, deja en claro que lo único que les importa es la propaganda, la difusión y la plata. Básicamente, como cualquier político promedio.","replies":[]},{"poster":"iNNOVAk","date":"2015-03-24T17:53:01.203+0000","up_votes":4,"down_votes":5,"body":"La verdad que las reglas del foro poco importan con la situacion de las ranked, o no te parece? Si no les importa pongan nicks y todo... si no lo hago aparte y los invito a todos a que los vean!","replies":[]}]}