{"poster":"uMaD xDekai","date":"2016-05-05T20:21:08.250+0000","title":"Meine MMR mag mich nicht :(","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hi. Das soll jetzt kein &quot;Heul Thread&quot; sein, mehr so &#039;nen &quot;Frage- / Disskusions-Thread&quot;. (Ich hoffe er ist im richtigen Forum).\n\nDenn ich habe in letzter Zeit bemerkt, dass meine MMR sehr viel schwankt. Angefangen mit dem Positiven, bin von Gold 4 auf Gold 2 mit sehr vielen Wins gelangt (und hatte laut op.gg jetzt erst eine &quot;normale MMR&quot;). Anschlie&szlig;end bin ich 1x wieder auf Gold 3 herabgestuft. Zu dem Zeitpunkt dachte ich eigl., dass meine MMR so mittelm&auml;&szlig;ig ist, hab aber im Durchschnitt nur 18-20 Punkte bekommen und um die 20-22 verloren. Gestern bin ich dann mit &#039;ner guten Siegesserie auf Gold 2 wieder aufgestiegen und habe noch 2 Wins in Folge heute gemacht. Hab&#039; dann leider 3 Spiele verloren und wurde sofort mit dem 1. Lose auf 0 LP (der 3. Lose der 3 Spiele) herabgestuft. Meine Frage: Wieso? Was war nach meiner &quot;guten Siegesserie&quot; der Knackpunkt, dass ich sofort herabgestuft wurde (mit dem 1. Lose auf 0 LP^) und laut op.gg eine sehr schlechte MMR habe? Immerhin habe ich eine 65% Win-Rate in meinen letzten 20 games (gerade aktualisiert, jetzt 55%. Die games davor sind leider nicht mehr dabei). Ist euch auch was gleiches so &quot;seltsames&quot; passiert? Denn ich finde, es ist ein bisschen hart f&uuml;r mich, (trotz mehr Wins als Losses), aufzusteigen..\n\nMittlerweile habe ich es generell sehr schwer aufzusteigen. Habe zwar &#039;nen Super Duo Partner gefunden, jedoch climbed er die Punkte hoch wie nix mit 25 LP pro Win, w&auml;hrend ich dann oft auf 96 - 99 LP hinterherh&auml;nge (jetzt schon wieder 94 LP nach meinem Drop + Win), aufgrund meiner so schlechten MMR. Irgendwie verstehe ich das System momentan nicht^^.\n\nGerne selbst auf http://euw.op.gg/summoner/userName=uMaD+xDekai mal reinschauen.\n\n\nHabt ihr &auml;hnliche Erfahrungen gemacht? Seid ihr momentan eher am auf- oder absteigen? Spielt ihr viel Duo- / Dynamicqueue? Diskutiert ruhig mal ein bisschen mit mir :).\n\n\nLG,\n{{sticker:slayer-pantheon-thumbs}} \nxDekai","replies":[{"poster":"Maexle","date":"2016-05-05T22:07:36.035+0000","up_votes":1,"down_votes":0,"body":"Solche Dinge sind eigentlich relativ \"normal\". Manchmal ist es einfach wie \"verhext\". Mit einer schönen Siegesserie sollte das aber wieder ins Lot kommen. Viel Glück dabei ;)\n {{champion:17}}","replies":[]},{"poster":"Revilous","date":"2016-05-05T20:56:32.817+0000","up_votes":1,"down_votes":0,"body":"Mir kommt es so vor als würde die MMR schnell runter gehen aber nur langsam hoch. Am Anfang nach den Einrankungsspielen hat man Standartmäßig eine sehr gute MMR und wenn man z.b. smurft und nur gewinnt bleibt die auch so. Wenn man aber gewinnt und verliert in gleichem Maße steigt man zwar weiter auf, aber die MMR wird immer schlechter bis sie irgendwann normal ist. Man würde am Anfang quasi auch aufsteigen mit negativer Winrate.\n\nWenn man aber einen Loosing Streak hat rutscht die MMR sehr schnell ins negative. Wenn man z.b. auf Diamond 3 0lp kurz nach dem Aufstieg 4 Spiele verliert (wie ich gerade) steigt man nicht ab, aber die MMR ist extrem schlecht. So bekam ich davor +18 -18 nach einem riesen Winstreak und jetzt nur noch +15 -20.\nAlso musst du konstant 3 gewinnen 1 verlieren 3 gewinnen 1 verlieren und so weiter um deine MMR hochzupushen denn wenn du mal 10 gewinnst ausversehen und dann aber wieder 7 verlierst hintereinander sinkt deine MMR trotz allem.\n\nVerstehst du was ich meine?","replies":[{"poster":"uMaD xDekai","date":"2016-05-05T21:06:53.310+0000","up_votes":1,"down_votes":0,"body":"Das klingt zwar sehr verwirrend, aber ich verstehe es. Ist es so, damit man \"verdient\" da ist, wo man sich befindet?","replies":[]}]}]}