{"poster":"Best Ekko NA","date":"2018-10-30T17:29:33.082+0000","title":"How About A Game Mode With Pre-Reworked Champs vs Reworked Ones?","subforum":"Gameplay","up_votes":5,"down_votes":2,"body":"Would be fun playing a mode where we could re-live the old champions, and see how the new champions fare playing against them. \n\nMaybe a one time event or something?","replies":[{"poster":"JeaneGreene","date":"2018-10-30T19:14:27.041+0000","up_votes":2,"down_votes":0,"body":"I would spam pre-hotfix Leblanc","replies":[]},{"poster":"TheOtherWoman","date":"2018-10-30T18:40:39.697+0000","up_votes":2,"down_votes":0,"body":"Omg yes, I want old fiora back she was so fun","replies":[]},{"poster":"LeftyRaydy","date":"2018-10-30T19:16:35.437+0000","up_votes":1,"down_votes":0,"body":"I doubt they could do it even if they wanted to.","replies":[{"poster":"Best Ekko NA","date":"2018-10-31T14:12:46.830+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=3ErqAdtq,discussion-id=qePcvAWa,comment-id=0003,timestamp=2018-10-30T19:16:35.437+0000)\n>\n> I doubt they could do it even if they wanted to.\n\nThey could do it. Square Enix scrapped all of their assets for Final Fantasy 9 and still managed to re-build and port the entire game to the computer. I'm pretty much certain Riot would have no problems bringing back a few champions that they scrapped. The real question would more be, \"why would they do it\"? If enough players thought that it would be an enjoyable experience I'm more than certain that they'd at least give it some thought.","replies":[{"poster":"LeftyRaydy","date":"2018-10-31T15:41:07.246+0000","up_votes":1,"down_votes":0,"body":"The reason I say this i, because the game was different when some of these champs existed in their states. like ability interactions could be so buggy, because they were never meant to interact with other abilities since they were not in the game and so on. For them to do something like this it would be one hell of an effort from riot. I just don't see them doing it.","replies":[]}]}]},{"poster":"Evil Bisex Plant","date":"2018-10-31T00:21:02.707+0000","up_votes":1,"down_votes":0,"body":"That would be a complete trash experience for the pre-rework champs. There is a reason why none of the old champs are actually played while the new ones are. The game evolved and what used to be a whole champion's kit is an ability nowadays.","replies":[{"poster":"Best Ekko NA","date":"2018-10-31T14:07:37.792+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Evil Bisex Plant,realm=EUNE,application-id=3ErqAdtq,discussion-id=qePcvAWa,comment-id=0005,timestamp=2018-10-31T00:21:02.707+0000)\n>\n> That would be a complete trash experience for the pre-rework champs. There is a reason why none of the old champs are actually played while the new ones are. The game evolved and what used to be a whole champion&#x27;s kit is an ability nowadays.\n\nThat's not true. Most champions were re-worked from the past because they were considered difficult to balance and \"unhealthy\" for the game. Champions such as Warwick, Galio, Fiora, and Gangplank who were walking stat checking sticks were becoming more and more problematic since they were either too strong or too weak. The reason they were re-worked was to increase the level of skill involved so that even if their numbers were off they could still perform -- and also the opposite, when they're too strong give the enemy room to outplay.","replies":[{"poster":"Evil Bisex Plant","date":"2018-10-31T15:39:20.890+0000","up_votes":1,"down_votes":0,"body":"It true in it's entirety, all the new champs press two buttons and the statcheck champ can't do anything but watching his champ getting deleted with no agency.\n\nAnd if it was true, the \"reworked\" team would have no fun - so the mode would be trash either way.","replies":[]}]}]},{"poster":"CIayman","date":"2018-10-30T19:17:31.103+0000","up_votes":1,"down_votes":0,"body":"I'd do anything to get to play old Rengar again\n{{sticker:sg-jinx}}","replies":[{"poster":"gabetheguy","date":"2018-10-30T23:45:41.049+0000","up_votes":1,"down_votes":0,"body":"old old rengar or that godawful Paralympic swimmer?","replies":[]}]},{"poster":"Xurreal","date":"2018-10-30T18:32:28.022+0000","up_votes":1,"down_votes":0,"body":"i think when they made passes on the Map and on Champions to mesh with the map, they may have decompiled those old models and animation trees. They likely have no parents or even exist in the data any longer (due to possible overwrites).\n\nWould be interesting though.","replies":[]}]}