{"poster":"Best Ekko NA","date":"2017-12-07T17:00:01.316+0000","title":"Remove Grievous Wounds From Morellonomicon and Make A New AP Item With It","subforum":"Gameplay","up_votes":164,"down_votes":28,"body":"* For starters, it&#039;s not fair for AP champions that they can only inflict Grievous Wounds at a certain percent of the enemies health, while AD champions are capable of doing it at any health percent.\n* Morellonomicon is already a very gold efficient item, even without TWO of its passives. Morellos is simply an overloaded item, and as such it makes sense to remove the Grievous Wounds seeing how they do not fit the item&#039;s &quot;AP caster&quot; theme anyway.\n* While I do not really agree that AP champions are lacking items, I do believe most of them are too niche oriented which makes them less viable on some champions compared to others. Due to this, it doesn&#039;t hurt to add another AP item to the mix, with its own specific niche (reduced healing).\n\nMy own personal idea? Create something like this:\n\n\n> \nVoid Grimoire\n--\n+80 AP\n--\nUnique Passive - Eyes of Pain: +15 Magic Penetration\nUnique Passive - Executioner: Dealing Magical Damage inflicts Grievous Wounds on enemy champions for 5 seconds.\nUnique Passive - Giant Slayer: Grants up to +20% Magical Damage against enemy champions with greater maximum Heath than you.\n\nThis may not be a perfect solution, but I think it&#039;s definitely a good start for evening out the missing links between AP and AD items and solving the Grievous Wound problem for AP champions.","replies":[{"poster":"Joseraph","date":"2017-12-07T19:01:58.185+0000","up_votes":72,"down_votes":2,"body":">Morellos is simply an overloaded item\n\n*proceeds to put 3 passives on new item*\n\n{{sticker:sg-lux-2}}","replies":[{"poster":"Velzard of Koz","date":"2017-12-07T20:03:16.383+0000","up_votes":22,"down_votes":1,"body":"Yeah, especially since he himself makes point about Morello having THREE passives.\nAt least I had laugh.","replies":[]},{"poster":"Votable Jester","date":"2017-12-07T21:28:28.919+0000","up_votes":8,"down_votes":0,"body":"I mean passives such as CDR and mpen really shouldn't count in my opinion.  Those are strictly number bonuses to the champion, and having them as a passive is actually weaker than having them as raw stats on the item (you can't stack the passive).\n\nI do feel like the Giant Slayer passive does not belong on this item though as it makes it a little too parallel to Liandry's Torment (both providing 80 AP, 15 mpen, and a passive that is stronger against high-HP champions).","replies":[]},{"poster":"JacctheInsomniac","date":"2017-12-07T23:02:29.780+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"2Charmnot2Charm","date":"2017-12-08T00:26:31.201+0000","up_votes":4,"down_votes":0,"body":">  he didn't specify a gold value, or build path\n\nPlease mages do not need another {{item:3089}}","replies":[]}]},{"poster":"Mos Deadly98","date":"2017-12-08T07:25:43.292+0000","up_votes":3,"down_votes":0,"body":"Magic penetration is a stat. Like lethality or cdr. Its only unique because you dont want people stacking black cleavers.","replies":[{"poster":"Joseraph","date":"2017-12-08T20:25:14.768+0000","up_votes":1,"down_votes":1,"body":"Semantics doesn't take away from this being an overloaded item","replies":[{"poster":"Mos Deadly98","date":"2017-12-09T23:46:39.886+0000","up_votes":1,"down_votes":0,"body":"no duskblade of drakthar is a overloaded item. This item would be about that powerlevel. Because the biggest comparison is whatever this item is called {{item:3036}} . It gives 30 less base stats and flat instead of real damage. No this item is overpowered because liandries brand exist.","replies":[]}]}]},{"poster":"Funkin Dunkin","date":"2017-12-08T13:24:37.131+0000","up_votes":1,"down_votes":0,"body":"Not just that but 80 base + 20%?  Holy shit! {{champion:45}}  {{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"ªTeemo","date":"2017-12-07T18:33:03.583+0000","up_votes":10,"down_votes":10,"body":"Let's make more broken items","replies":[{"poster":"Best Ekko NA","date":"2017-12-07T18:35:32.726+0000","up_votes":13,"down_votes":13,"body":"> [{quoted}](name=noname11415,realm=EUW,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=0006,timestamp=2017-12-07T18:33:03.583+0000)\n>\n> Let&#x27;s make more broken items\n\nExplain how this is broken, I would love to hear.\n\nI literally copy & pasted every single one of these passives from another item which already exists in the game. \n\nFrom your logic can we assume everything in the game is already broken?","replies":[{"poster":"Purejoyce","date":"2017-12-07T19:42:40.673+0000","up_votes":15,"down_votes":3,"body":"You complain about \"overloaded items\", then you simply combine both passives of LW upgrades and ask \"how's that broken\"? Give me a break.","replies":[{"poster":"LordGeovanni","date":"2017-12-08T09:36:30.306+0000","up_votes":3,"down_votes":0,"body":"Not to mention Last Whisperer upgrades have low ad because of it to be comparable having just one of those passives the ap item would have 60 ap on it.","replies":[]}]},{"poster":"Prozzak","date":"2017-12-07T22:46:20.020+0000","up_votes":8,"down_votes":0,"body":"From your explanation here I can past 100 passives onto one item and as long as those 100 passives already existed I cannot possibly make an op item. I don't agree that the item you made is or is not op, just pointing out your flawed response here.","replies":[]},{"poster":"ªTeemo","date":"2017-12-07T19:14:49.117+0000","up_votes":5,"down_votes":6,"body":"From another item that already exists? Hmmm I wonder why it's not on summoner's rift\nEdit: Ok, I'll explain for the salty kids why this item would be broken\n\nFirst off the Item would have 80 ap, which is a decent amount\nSecond off it would have magic pen which would make it good against squishies\nThird thing it would fuck healing over completely\nAaaaand it would be a tank busting item as well ( let's not forget to mention that it says +20% more damage to champs with more max health 20%, 20% is INSANE)\nOk let's say 1 of the passives is fine. But 3? Not even 2, not even, but 3!\nSo it would be an item that gave high ap, that melts squishies, that fucks healing and that fucks tanks at the same time.\n{{item:3165}} {{item:3151}}  and Void Grimoire is what I'd call \"The Unholy Trio\" if it were to be implemented.\nAdd Sorcerer's Shoes to that and you'd do true damage to squishies while melting tanks and incapacitating heals.\nI know that you guys want mage buffs and you know what? That's fine. But not like this, not broken stuff like this. If other stuff is broken it doesn't mean everything should be. What's broken should just be nerfed and everything should be balanced. Not adding broken stuff again and again, the game is already a 1 shot fest.","replies":[{"poster":"wildfox99","date":"2017-12-07T20:19:40.535+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=noname11415,realm=EUW,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=000600000001,timestamp=2017-12-07T19:14:49.117+0000)\n>\n> From another item that already exists? Hmmm I wonder why it&#x27;s not on summoner&#x27;s rift\n(...)\n\nthis guy got a nice point (though it wouldn't be broken but inconsistent),why an item that is meant to counter high healing should give damage vs squishyes (15 magic pen) and vs tanks (+20% damage) as well?\n\njust add it some base stats and make 2 separate items with  these passives (damage boost vs high hp champion need to be a separate thing)\n\nbtw\n\n>its THREE passives\n____\n\n1)\n>Unique Passive - Eyes of Pain: +15 Magic Penetration\n\n2)\n>Unique Passive - Executioner: Dealing Magical Damage inflicts Grievous Wounds on enemy champions for 5 seconds.\n\n3)\n>Unique Passive - Giant Slayer: Grants up to +20% Magical Damage against enemy champions with greater maximum Heath than you.\n\nespecially the 3rd one could be a iusse if combined with {{item:3151}} passive,making AP champion too effective aganist tanks (which are supposed to stop them)","replies":[]}]},{"poster":"Joseraph","date":"2017-12-07T18:57:32.250+0000","up_votes":2,"down_votes":1,"body":"{{item:2057}} Busted, GGEZ","replies":[]}]}]},{"poster":"redniwediS","date":"2017-12-07T18:01:46.811+0000","up_votes":2,"down_votes":0,"body":"To be fair it really only has two passives.  The CDR was made into a unique passive to stop people from stacking it.\n\nI like the idea of your suggested item, but I have to ask what made you put a small amount of magic penetration on it?\n\nAlso part of why Morello only applies grievous wounds at low health is because of the 8 second duration.  If an AP item is going to be made that can apply it at any level of health I think the duration is going to have to match it's AD counterpart.  That should make it better for spammy champions who can reapply it often, where as Morello would stay the better option for burst.\n\nOn top of that maybe it needs two different grievous wounds durations, one for single target spells and a shorter one for AoE?","replies":[{"poster":"Best Ekko NA","date":"2017-12-07T18:12:40.777+0000","up_votes":10,"down_votes":3,"body":"> [{quoted}](name=redniwediS,realm=NA,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=0004,timestamp=2017-12-07T18:01:46.811+0000)\n>\n> To be fair it really only has two passives.  The CDR was made into a unique passive to stop people from stacking it.\n> \n> I like the idea of your suggested item, but I have to ask what made you put a small amount of magic penetration on it?\n> \n> Also part of why Morello only applies grievous wounds at low health is because of the 8 second duration.  If an AP item is going to be made that can apply it at any level of health I think the duration is going to have to match it&#x27;s AD counterpart.  That should make it better for spammy champions who can reapply it often, where as Morello would stay the better option for burst.\n> \n> On top of that maybe it needs two different grievous wounds durations, one for single target spells and a shorter one for AoE?\n\nCount how many AD penetration items there are:\n\n1. {{item:3134}} \n2. {{item:3035}} \n3. {{item:3142}} \n4. {{item:3147}}\n5. {{item:3814}} \n6. {{item:3071}} \n7. {{item:3033}} \n8. {{item:3036}}\n\nHow many AP penetration items are there?\n\n1. {{item:3020}}\n2. {{item:3136}} \n3. {{item:3151}} \n4. {{item:3135}}\n\nHopefully you see why I think it needs to have some penetration. Keep in mind, Magic Resist and Armor items are actually pretty close to even in numbers, yet there are far more armor penetration items than magic penetration items. \n\nAD has a pretty unfair advantage because of that. AP champions have to wait on cooldowns, while AD do not because auto attacks deal physical damage.\n\nAlso, I don't think it needs any different duration, if AD champions can get 2.5 auto attacks a second and apply it with every single attack.. it shouldn't matter if a DoT can reapply it each time, there is no DoT that goes off 2.5 times a second.","replies":[{"poster":"Durzaka","date":"2017-12-08T03:39:10.322+0000","up_votes":3,"down_votes":0,"body":"Now ask the question, how much MR can tanks really get? Vs. armor?\n\n{{item:3065}}\n {{item:3193}} \n{{item:3194}}\n {{item:3001}}\n {{item:3190}} \n{{item:3060}} \n{{item:3222}} \n\nNow, how many of those to tanks generally build? One, a majority of the time. 2 if they build stoneplate/locket.\n\nNow armor\n\n{{item:3190}} \n{{item:3193}}\n {{item:3800}}\n {{item:3110}}\n {{item:3068}}\n {{item:3075}}\n {{item:3143}}\n {{item:3742}}\n {{item:3109}} \n\nNow, how many of these to tanks generally build? Probably 2 or 3, ignoring any cross over from stoneplate/locket. Of course dont forget {{item:3047}}  because those are the only tank boots worth shit because tenacity sucks. So thats an extra armor items in most builds.\n\nMages have less pen because they need less pen due to overall itemization. Champions survive magic damage through a dash of MR, and their large health pool (for tanks), rather than a large amount of MR and average health pool.","replies":[{"poster":"FutureCreator","date":"2017-12-09T12:22:47.324+0000","up_votes":1,"down_votes":0,"body":"Hey, don't leave poor old {{item:3512}} and {{item:3056}} out of the lists come on.{{sticker:zombie-nunu-tears}}","replies":[]}]},{"poster":"AirKingNeo","date":"2017-12-07T22:26:31.247+0000","up_votes":2,"down_votes":8,"body":"Ok, now count how many AD champions use WHAT SPECIFIC ARMOR PEN ITEMS? EVERY AP CHAMPION CAN BUILD CAN BUILD EVERY SINGLE MAGIC ITEM, BUT AD CHAMPIONS ARE LIMITED IN THEIR NUMBERS.\n\nAssassins are limited to Cleaver and the lethality they're balanced around.\nBruisers only get Cleaver.\nADCs get Last Whisper items.\nAP champions get all their options.\n\nWhy do people fail to notice this? You can't just say \"AD champions have more pen options\" when reality shows they have equal or less, but you failed to apply context.","replies":[{"poster":"Bjørnetjenesten","date":"2017-12-07T23:33:38.740+0000","up_votes":5,"down_votes":0,"body":"Assassins are \"limited\" to 4 items that negate or reduce armor. Have you heard of how mf, quinn, graves, lucian or jhin being limited to 1 pen item option?","replies":[]}]},{"poster":"rtbf90661456","date":"2017-12-08T00:08:06.708+0000","up_votes":2,"down_votes":0,"body":"well to be fair:\n\n* last whisper only auguments apen vs BONUS armor, so it does nothing vs carries\n\n* void staff does 40% mpen meaning it does what what lw does without the bonus mr restriction\n\n* have you heard of rabadon's deathcap? it's basically a pen item if you look at its stats (boost dmg by  35%)","replies":[{"poster":"Iffy Jarl","date":"2017-12-08T05:22:50.894+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Twilight Assault,realm=NA,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=000400000002,timestamp=2017-12-08T00:08:06.708+0000)\n>\n> well to be fair:\n> \n> * last whisper only auguments apen vs BONUS armor, so it does nothing vs carries\n> \n> * void staff does 40% mpen meaning it does what what lw does without the bonus mr restriction\n> \n> * have you heard of rabadon&#x27;s deathcap? it&#x27;s basically a pen item if you look at its stats (boost dmg by  35%)\n\nOk so if raw damage is now magically pen then what does that make {{item:3031}}","replies":[{"poster":"rtbf90661456","date":"2017-12-10T02:48:31.181+0000","up_votes":1,"down_votes":0,"body":"That only applies if you have 80% crit. rabadon's deathcap is a one item 35% damage boost","replies":[]}]}]},{"poster":"redniwediS","date":"2017-12-07T18:19:10.375+0000","up_votes":2,"down_votes":0,"body":"> Hopefully you see why I think it needs to have some penetration.\n\nYep, I just wanted to hear your reasoning on it is all.  Again to be fair two of the AD items you listed are components, where as you didn't list the one AP component.  {{item:3136}} \n\n> Also, I don't think it needs any different duration, if AD champions can get 2.5 auto attacks a second and apply it with every single attack.. it shouldn't matter if a DoT can reapply it each time, there is no DoT that goes off 2.5 times a second.\n\nIt really depends on what champions this item is being made for.  Anivia, Swain, Amumu, Cassiopeia, and other champions can apply this thing just as often as an AD champion, which is why I think at least AoE spells should apply a similar duration to the AD item.\n\nI agree that AD has an unfair advantage when it comes to high health targets, but we don't want to just swing things fully to the other side, we want to find a middle ground.","replies":[{"poster":"Best Ekko NA","date":"2017-12-07T18:23:51.520+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=redniwediS,realm=NA,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=000400000000,timestamp=2017-12-07T18:19:10.375+0000)\n>\n> Yep, I just wanted to hear your reasoning on it is all.  Again to be fair two of the AD items you listed are components, where as you didn&#x27;t list the one AP component.  {{item:3136}} \n> \n> It really depends on what champions this item is being made for.  Anivia, Swain, Amumu, Cassiopeia, and other champions can apply this thing just as often as an AD champion, which is why I think at least AoE spells should apply a similar duration to the AD item.\n> \n> I agree that AD has an unfair advantage when it comes to high health targets, but we don&#x27;t want to just swing things fully to the other side, we want to find a middle ground.\n\nWas just a mistake, I overlooked it when I was glancing down the list. \nI edited my comment and added it on there.","replies":[]}]}]}]},{"poster":"Lit Corn","date":"2017-12-07T20:30:29.011+0000","up_votes":7,"down_votes":1,"body":"magic pen + both the passives of {{item:3036}} {{item:3033}}  with a pretty decent amount of ap ? this would be absolutely busted man ... far more than {{item:3165}}  currently is .","replies":[]},{"poster":"1Maza","date":"2017-12-07T22:13:58.450+0000","up_votes":5,"down_votes":1,"body":"That's the most busted item idea I've ever seen. \"Let's take both of the Last Whisper items and combine them into one, but make it AP because AP can't be broken.\"\n\nIf they combined the LW items for ADs you'd probably uninstall.","replies":[]},{"poster":"Dengeden","date":"2017-12-08T05:56:57.286+0000","up_votes":3,"down_votes":0,"body":">For starters, it's not fair for AP champions that they can only inflict Grievous Wounds at a certain percent of the enemies health, while AD champions are capable of doing it at any health percent.\n\nYes it is, because AP champs get it earlier without sacrificing anything. This, \"mages need everything ADCs get but better\" needs to stop.\n\nYour suggested item would be either broken or ignored.","replies":[]},{"poster":"iLBGAMing","date":"2017-12-07T17:03:28.144+0000","up_votes":5,"down_votes":2,"body":"Holy sh*t, I feel that this item itself could solve the AP problems. The fact that it has such good passive's just would make it such a good item for mages, good job with the idea.","replies":[]},{"poster":"Existential Bard","date":"2017-12-07T17:44:22.484+0000","up_votes":2,"down_votes":5,"body":"Although I'm all for item diversity, I would say that we shouldn't create another item since it's just a spiral. If we create this, then tanks will be weaker, thus needing another item to he created to negate your void grimoire. Instead I think they should apply the passive to a less used item.","replies":[{"poster":"Best Ekko NA","date":"2017-12-07T17:54:21.514+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Existential Bard,realm=NA,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=0003,timestamp=2017-12-07T17:44:22.484+0000)\n>\n> Although I&#x27;m all for item diversity, I would say that we shouldn&#x27;t create another item since it&#x27;s just a spiral. If we create this, then tanks will be weaker, thus needing another item to he created to negate your void grimoire. Instead I think they should apply the passive to a less used item.\n\nI don't see tanks being any weaker than they are now, even if they added this item exactly as it is into the game. The only difference would be that certain champions who currently can't deal with heavy MR stacking healing champions (Maokai being the largest offender) will be capable of at least dealing a little more damage to them.\n\nHave you seen how bad it is? Try playing ARAM against Maokai, Swain, or any healing Support (Soraka, Nami, Sona, etc.) with no Mortal Reminder / Executioners on your team. Do you know what happens? The enemies never reach 35% health. They heal so much that you suddenly begin realizing just how worthless the Grievous Wound passive on Morellonomicon really is. It's a little different on Summoner's Rift, but against a fed Maokai / enemy Soraka you can see the same result.\n\nHealing vs AP champions is brutal right now, the only way to deal with it is to have your AD champions get Mortal Reminder.. and that's really not good balance when only one set of champions is capable of stopping healing abilities / kits.","replies":[]}]},{"poster":"Proxy345","date":"2017-12-08T16:12:56.826+0000","up_votes":2,"down_votes":0,"body":"No.","replies":[]},{"poster":"Talon12","date":"2017-12-08T03:09:49.782+0000","up_votes":1,"down_votes":0,"body":"Yes, but then you consider how fucking long the grievous wounds on morello compared to every other grievous wounds item, you think. Other items you step out for a sec or 2 and ur good, morellos will keep you unable to heal the whole effing fight.\n\nIf you want to bloody add it to a mage item, you are going to have to cut out the duration as a trade off like the other items get. You can't bitch about it when its 250% longer than any other grevious wounds effect in the game.","replies":[{"poster":"ZapMyHeart","date":"2017-12-08T03:17:37.442+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=0022,timestamp=2017-12-08T03:09:49.782+0000)\n>\n> Yes, but then you consider how fucking long the grievous wounds on morello compared to every other grievous wounds item, you think. Other items you step out for a sec or 2 and ur good, morellos will keep you unable to heal the whole effing fight.\n> \n> If you want to bloody add it to a mage item, you are going to have to cut out the duration as a trade off like the other items get. You can&#x27;t bitch about it when its 250% longer than any other grevious wounds effect in the game.\n\nConsidering that any other GW items easily refreshes the debuff (AA-based), what is a measly 5 seconds for champions that needs abilities with cooldowns and skillshots to apply it with? \n\nWith how obnoxious LS is that heals a 10% health ADC back to 100% within a second or two, we actually need better anti-healing items to curb their already high burst-like AA damage.","replies":[{"poster":"Talon12","date":"2017-12-08T03:25:51.561+0000","up_votes":1,"down_votes":0,"body":"sure define \"skillshot abilities to apply it with\" swain, karthus, kennen (if ur into that) brand, anivia etc, these will either instakills you or they have easy dot applications of which to apply it anyway. Your point is invalid","replies":[{"poster":"ZapMyHeart","date":"2017-12-08T10:42:52.283+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=002200000000,timestamp=2017-12-08T03:25:51.561+0000)\n>\n> sure define &quot;skillshot abilities to apply it with&quot; swain, karthus, kennen (if ur into that) brand, anivia etc, these will either instakills you or they have easy dot applications of which to apply it anyway. Your point is invalid\n\nOutliers. Doesn't make it any less invalid. They are also close-ranged mages with the ones you mentioned; Brand has skillshots. If they are able to instakill you instantly, then the GW effect lasting for 5 seconds shouldn't be an issue anyways. When ADs have access to Hexdrinker and other fun MR items that easily negates their burst damage, why should they also get access to high amounts of LS and burst damage on top of that? Your point is invalid.","replies":[{"poster":"Talon12","date":"2017-12-09T09:06:33.593+0000","up_votes":1,"down_votes":0,"body":"whats broken is the OP idea of overloaded","replies":[{"poster":"Best Ekko NA","date":"2017-12-10T01:24:05.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=00220000000000000000,timestamp=2017-12-09T09:06:33.593+0000)\n>\n> whats broken is the OP idea of overloaded\n\nOkay, let's do a quick analysis here of the most common AP items:\n\nLow Tier: (0 -99%)\n\n{{item:3135}} = 66% Gold Efficient\n{{item:3003}} = 73% Gold Efficient\n{{item:3285}} = 80% Gold Efficient\n{{item:3100}} = 82% Gold Efficient\n{{item:3089}} = 93% Gold Efficient\n{{item:3157}} = 93% Gold Efficient\n{{item:3152}} = 94% Gold Efficient\n{{item:3027}} = 94% Gold Efficient (0 stacks)\n{{item:3116}} = 94% Gold Efficient\n{{item:3102}}  = 96% Gold Efficient\n{{item:3151}} = 96% Gold Efficient\n\n\nMid Tier: (100 - 109%)\n\n{{item:3020}} = 100% Gold Efficient\n{{item:3030}} = 103% Gold Efficient\n{{item:3146}} = 109% Gold Efficient\n\nJugger-Gods of Gold Efficiency: (110% and higher)\n\n{{item:3165}} =  112% Gold Efficient\n{{item:3040}} = 122% Gold Efficient\n{{item:3115}} =  140% Gold Efficient\n{{item:3027}} = 151% Gold Efficient (10 stacks)\n\nNow tell me, what is so special about Morellonomicon and Nashor's Tooth that they deserve to be high tier items? You have to stack both Rod of Ages and Archangel's Staff to get them from being \"average\" items. When you buy Morello's and Nashor's, they are just instantly massively gold efficient items for absolutely no reason.\n\nYou can make fun of me, and say whatever you would like, however the statistics do not lie. It's quite black and white when you calculate the math how unreasonably strong Morellonomicon is (and Nashor's, but that's for another thread).","replies":[{"poster":"Talon12","date":"2017-12-10T05:01:22.943+0000","up_votes":1,"down_votes":0,"body":"nashors is a niche item. And you complain about morello being overloaded, then overload it with 3 passives. 2 is maximum.\n\nYou also cut out the main reason people got damn morello anyway, for the mana sustain and cdr. This \"Grimoire\" shit  is dumb. You wanna make the item gold inefficient just take off bloody 10 ap, bam easy.","replies":[]}]}]}]}]}]}]},{"poster":"Shablagoo","date":"2017-12-08T08:58:42.371+0000","up_votes":2,"down_votes":0,"body":"Ugh more mpen for mages. Giving them a possible 48 mpen along with 40%, guys giving mages true dmg so easily is fine even though we nerfed lethailty for that exact reason. Lets not pretend that giving mages more pen options would not break them.","replies":[]},{"poster":"Entheos Geon","date":"2017-12-08T06:50:13.537+0000","up_votes":2,"down_votes":0,"body":"Giant Slayer doesn't fit very well with AP itemization. Most AP mids got their hp/lvl buffed this preseason and it would be anti-synergistic with Rylai's, Rod of Ages, Liandry's, Hextech Protobelt and Hextech GLP-800.","replies":[]},{"poster":"ThwartinMaPlans","date":"2017-12-08T02:46:18.007+0000","up_votes":2,"down_votes":0,"body":"Calls morello over loaded. Then suggests a does it all  3 passives item. Who up voted this? So greiv wounds, 15% Mp + 20% bonus damage to basically every champ mages have the lowest general Hp.","replies":[]},{"poster":"EcchiOtakuTM","date":"2017-12-08T01:39:59.088+0000","up_votes":2,"down_votes":0,"body":"Honestly this looks busted at first glance however it even busted, but since it can't stack with torment it could very much blatantly replace it.\n\nTorment doesn't offer anything better than this, 300 HP shaved off for that much bonus damage to tankier champs who torment would need rylia to combo for some effectiveness vs them? AND grevious wounds for laughs? Jesus.\n\nMight as well just shelf torment entirely if this were to happen because there's absolutely no way an item which needs a complimentary item to combo for effectiveness could compete with this which would be it's sister.\n\nOn a side note before someone brings up anivia,  she'd rather take grievous wounds +the bonus damage to tanks than 4% current HP DoT+300 hp\n\nThis just isn't the right way to remove GW and make it's own item. I'd rather say it's be better to remove GW from morello and put it on rylia's since that item is struggling for a reason to purchase. (The slow is nowhere near convincing enough to feel good as a buy alone). But even then I would rather have 10% CDR on rylia than slapping GW over.","replies":[]},{"poster":"Rouwhorst","date":"2017-12-07T22:55:59.792+0000","up_votes":2,"down_votes":0,"body":"The problem with grievous wounds is that, when you put it on an item that focusses on GR, you will end up with an item that is only bought when the enemy has overbearing healing.\nWell what is the problem with that you say? \nThat the item becomes mandatory versus specific champions, which essentially reduces the effectiveness of the enemy's healing and you have lost an item slot just for doing so. So you have both parties feeling bad.\nSolving this requires you to put appealing stuff on the GR item, but doing so may make it an item that is always bought, regardless of the GR. \nYou would need multiple situation in which you would buy this item, but not for all situations.\nOr a twist with the GR-application.\n___\nThere are a few healing sources:\n\n* Innate combat abilities.\n* Innate out of combat abilities.\n* Lifesteal (items)\n* External out of combat healing. (think warmogs)\n\nI think we can do without grievous wounds.\n\nAn innate ability can easily be nerfed when overbearing.\nA problem arises when you have abilities that can be used both in and out of combat.\nThe main healing we are trying (or should I say 'able') to prevent with GR is in-combat sustain/healing. \nOut of combat is often not the problem (and shouldn't be too low), but if the equal amount is healed in combat it feels too overbearing, resulting in a need for an item against support champions. This can be fixed innately by adding an exception for example: \"healing is halved when used on allies in combat with enemy champions.\"\n\nAnother problem arises when champions get ahead or increase the healing they get in an uncontrolled manner.\nStacking lifesteal items, Ap (for healing scaling with AP) or Health (for healing scaling with health) may increase the healing in such a way that skew the balance.\nThose lifesteal items must have a clear disadvantage and the scaling should be controlled via less snowball dependant stats like level.","replies":[]},{"poster":"dapositiveviking","date":"2017-12-07T22:28:58.249+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Poptart Riven,realm=NA,application-id=3ErqAdtq,discussion-id=ZRjjEgWL,comment-id=,timestamp=2017-12-07T17:00:01.316+0000)\n>\n> *\n> * While I do not really agree that AP champions are lacking items, I do believe most of them are too niche oriented which makes them less viable on some champions compared to others. Due to this, it doesn&amp;#039;t hurt to add another AP item to the mix, with its own specific niche (reduced healing).\n> \n> \n\nniche is good. more items with more niches means itemisation means something. your item, however, isn't niche with penetration, grievous wounds and giant slayer on the same item? you're taking both last whispers and putting them into one. that's not niche.","replies":[]},{"poster":"Academy Kayn","date":"2017-12-07T20:53:33.583+0000","up_votes":1,"down_votes":1,"body":"Okay, can we stop using \"Fair\" as a reason to change things? \"Fair\" implies that two things are equal, in how they work, and how they should be treated. AD and AP *are not the same* and should not have standards that if one has something, the other should as well.\n\nAD have GV on hit because, example, Mundo. If you place a restriction on that GV to 40% on an ADC, they're never going to reach that point due to Mundo's healing. For an ADC, that effect needs to be instant, in order for it to accomplish it's goal. \n\nFor mages, who target squishier targets, they often have more range, more aoe, etc, they're naturally doing lots of damage instantly, so it's plausible that they'll hit that 40% easily, within a reasonable time frame for it to be able to take effect. ","replies":[{"poster":"Bjørnetjenesten","date":"2017-12-07T21:03:34.584+0000","up_votes":1,"down_votes":0,"body":"bring mundo down to 40% instantly? by a mage? in 2017?","replies":[]}]}]}