{"poster":"Hyperiön","date":"2016-05-06T13:01:56.447+0000","title":"To the Baby Ragers of 6.9 (Down vote if you want, I don't care)","subforum":"Gameplay","up_votes":5,"down_votes":10,"body":"Holy hell get over it. I love this patch. It gave me motivation to play, because I changed my play style and champion pole just for this patch. Everyone is hating Riot for this patch. Well guess what, it wasn&#039;t the first one of its kind, and it won&#039;t be the last one. People were constantly bickering about the Juggernaut Patch, and ADC Patch. Within a month, everyone was already adapted and learned how to play the newly reworked Champions. Just because our generation is the generation of self-entitlement, doesn&#039;t mean you get whatever the hell you want. It is a shame that people lack the common courtesy to respect what the company who OWNS the game does what they feel like is good for their game. Quit Acting like it is your game, and can throw a temper tantrum whenever you don&#039;t get your own way. instead of constantly complaining about the champions you used to play, but now find irrelevant, RELEARN their new role! Quit being afraid of change and learn to adapt.\r\n\r\nRant Over","replies":[{"poster":"Miror B","date":"2016-05-06T14:43:58.182+0000","up_votes":3,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/xjvV0YeJ-69-balance-hotfix-going-out-soon\n\nClearly riot thinks this patch is so good, they are in no way trying to fix it to make it even remotely playable. For me, things can only truly make sense when they have a legitimate reason behind them. In the case of this patch, much of their reason for changing everything was because they \"believe\" or \"think\" that they're good for the balance of the game. No actual evidence like graphs or anything, merely that they \"thought\" it was a good idea. While I do hate to call people out on their mistakes, the idea that gut-feelings and superstitious beliefs should be the cause for changing something enjoyed by millions of people is quite baffling. Change can be good, unwarranted change with no evidence behind it is laughably jouvenile and incredibly weak.","replies":[{"poster":"Hyperiön","date":"2016-05-06T14:51:08.689+0000","up_votes":1,"down_votes":0,"body":"Some of the champions reworked are very sub par, yes, but for most of them, their new kits are great. Making them viable again, rather than just taking super hyper carry mid laners, or Early powerhouses. This alleviated some of that pressure.","replies":[{"poster":"Miror B","date":"2016-05-06T15:39:24.634+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pexagon,realm=NA,application-id=3ErqAdtq,discussion-id=R5gIontc,comment-id=00030000,timestamp=2016-05-06T14:51:08.689+0000)\n>\n> Some of the champions reworked are very sub par, yes, but for most of them, their new kits are great. Making them viable again, rather than just taking super hyper carry mid laners, or Early powerhouses. This alleviated some of that pressure.\n\nYeah, let's look at them:\n\n{{champion:8}} Vlad- Far weaker than previous version, no real need to further comment as riot plans on buffing him in the hotfix\n\n{{champion:34}} Anivia: Q lost some power in exchange for a slightly longer stun, ulti was gutted entirely making it far worse than it was before\n\n{{champion:90}} Malz: Despite riot not wanting him to be a jg-abused mage, his kit was randomly given a lot of tools that enabled him to do stuff such as lv1 solo'ing drags and taking zero damage through jg clears. Being hotfixed to currently fix it\n\n{{champion:69}} Cass: Due to her passive changes, was made far weaker in scaling and was given a W that is impossible to hit efficiently. Currently being hotfixed.\n\n{{champion:63}} Brand: Passive was made weaker, spells were also made weaker, even with \"Detonation damage\" it is harder to kill tanks with him.\n\n{{champion:161}} {{champion:143}} {{champion:1}} Velkoz/Zyra/Annie: The three characters who weren't touched as hard, and are about equal to where they were before\n\n{{champion:50}} Swain: Currently being hotfixed due to power issues.\n\n{{champion:112}} Viktor: Death ray has become obsolete, has gone from a reliable wave-clear midlaner to one who has to rely on tons of cc just to land his kit efficiently.\n\n{{champion:85}} Kennen: Was randomly given a bunch of nerfs to his w because of \"#clean numbers\", can no longer farm as efficiently because of it.\n\n{{champion:45}} {{champion:115}} Veigar/Ziggs: Due to the AP item changes and their kits, were made obscenely powerful to the point in which many are calling them S-tier now. Ziggs has essentially become the AP version of Caitlyn (Q that has the ability to poke, CC that can affect multiple targets, and an incredibly spammable ulti with short cooldown) while Veigar has essentially become the \"tank shredder\" that Brand was supposed to be, only with the ability to also hit massive AP levels quicker. \n\nOut of 16 mages changed, 3 were made ridiculously OP/\"Ban-worthy\", 5 were barely affected, and 8 became weaker than their previous versions. For a patch that was supposed to bring about a new change to mid-lane mages, it has arguably given people less of a reason to actively play them.","replies":[{"poster":"Gusdel","date":"2016-05-06T16:18:15.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mye,realm=NA,application-id=3ErqAdtq,discussion-id=R5gIontc,comment-id=000300000000,timestamp=2016-05-06T15:39:24.634+0000)\n>\n> Yeah, let&#x27;s look at them:\n> \n> {{champion:8}} Vlad- Far weaker than previous version, no real need to further comment as riot plans on buffing him in the hotfix\n> \n> {{champion:34}} Anivia: Q lost some power in exchange for a slightly longer stun, ulti was gutted entirely making it far worse than it was before\n> \n> {{champion:90}} Malz: Despite riot not wanting him to be a jg-abused mage, his kit was randomly given a lot of tools that enabled him to do stuff such as lv1 solo&#x27;ing drags and taking zero damage through jg clears. Being hotfixed to currently fix it\n> \n> {{champion:69}} Cass: Due to her passive changes, was made far weaker in scaling and was given a W that is impossible to hit efficiently. Currently being hotfixed.\n> \n> {{champion:63}} Brand: Passive was made weaker, spells were also made weaker, even with &quot;Detonation damage&quot; it is harder to kill tanks with him.\n> \n> {{champion:161}} {{champion:143}} {{champion:1}} Velkoz/Zyra/Annie: The three characters who weren&#x27;t touched as hard, and are about equal to where they were before\n> \n> {{champion:50}} Swain: Currently being hotfixed due to power issues.\n> \n> {{champion:112}} Viktor: Death ray has become obsolete, has gone from a reliable wave-clear midlaner to one who has to rely on tons of cc just to land his kit efficiently.\n> \n> {{champion:85}} Kennen: Was randomly given a bunch of nerfs to his w because of &quot;#clean numbers&quot;, can no longer farm as efficiently because of it.\n> \n> {{champion:45}} {{champion:115}} Veigar/Ziggs: Due to the AP item changes and their kits, were made obscenely powerful to the point in which many are calling them S-tier now. Ziggs has essentially become the AP version of Caitlyn (Q that has the ability to poke, CC that can affect multiple targets, and an incredibly spammable ulti with short cooldown) while Veigar has essentially become the &quot;tank shredder&quot; that Brand was supposed to be, only with the ability to also hit massive AP levels quicker. \n> \n> Out of 16 mages changed, 3 were made ridiculously OP/&quot;Ban-worthy&quot;, 5 were barely affected, and 8 became weaker than their previous versions. For a patch that was supposed to bring about a new change to mid-lane mages, it has arguably given people less of a reason to actively play them.\n\nIt effected jungle and top lame more then mid lol","replies":[]},{"poster":"Vekkna","date":"2016-05-06T15:59:38.564+0000","up_votes":1,"down_votes":0,"body":"Zyra's spell damage and ratios were eviscerated. Like 20-30% reductions across the board, except for her ult, which already has a pretty measly 350 base at rank 3.","replies":[]}]}]}]},{"poster":"xdeviltwinkiex","date":"2016-05-06T14:47:58.546+0000","up_votes":1,"down_votes":1,"body":"Yeah we are indeed the generation of self entitlement. While I personally don't like all the changes such as the jungle timers for blue and red buff I do know it is Riot's game and while it is smart to listen to the player base they don't have to (I don't know if the jungle timers are a big topic right now though).","replies":[{"poster":"Hyperiön","date":"2016-05-06T14:51:40.038+0000","up_votes":2,"down_votes":0,"body":"I am not a big fan of it either, but with the new changes to the buffs, they are something worth contesting over.","replies":[{"poster":"Slythion","date":"2016-05-06T15:08:52.284+0000","up_votes":1,"down_votes":0,"body":"I don't like the jg timers, it removes a large part of the premeditated invades and planning and strategy needed to be a great jungler \n\nI agree with you though, many players of our generation don't understand the difference between \"I want this to happen but it's just my opinion\" and \"I want this to happen so it *has* to happen\"","replies":[{"poster":"Hyperiön","date":"2016-05-06T15:13:14.036+0000","up_votes":1,"down_votes":0,"body":"Well, with the timers, that is basically bread and butter for premades. They see a buff is about to be up, they all go to it, and kill the Jungle/Adc/Mid Laner or whoever else is nearby. But yea, it takes away the skill of the Jungler giving them all the information they need.","replies":[{"poster":"Slythion","date":"2016-05-06T15:15:48.187+0000","up_votes":1,"down_votes":0,"body":"As a solo player jungle main, it's kind of rough :'(","replies":[{"poster":"Hyperiön","date":"2016-05-06T15:25:55.794+0000","up_votes":1,"down_votes":1,"body":"Exactly why I stopped playing jungle. It is too hard to carry nowadays if you fall behind. Forced into going full tank to be a meat shield. And now with the timers, premades invade all the time and makes you somewhat useless.","replies":[]}]}]}]}]}]},{"poster":"Tyrone Lannister","date":"2016-05-06T14:23:16.463+0000","up_votes":2,"down_votes":0,"body":"Did someone say babyrage?!?!?! \nhttps://i.ytimg.com/vi/PFnwhPlQOW0/maxresdefault.jpg","replies":[{"poster":"Hyperiön","date":"2016-05-06T14:29:09.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tyrone Lannister,realm=NA,application-id=3ErqAdtq,discussion-id=R5gIontc,comment-id=0002,timestamp=2016-05-06T14:23:16.463+0000)\n>\n> Did someone say babyrage?!?!?! \n> https://i.ytimg.com/vi/PFnwhPlQOW0/maxresdefault.jpg\n\nThats great xD","replies":[]}]},{"poster":"Merxamers","date":"2016-05-06T16:25:54.374+0000","up_votes":1,"down_votes":0,"body":"People fear change, and complain when they have to learn knew things. I'm not super excited about the Viktor changes, but i think most of the mage updates were postive. Brand, Zyra, Malz, and Velkoz all seem more useful to me, and after the tweaks of the next few patches i think the game will be in a better spot.","replies":[{"poster":"Hyperiön","date":"2016-05-06T16:50:54.712+0000","up_votes":1,"down_votes":0,"body":"Indeed. One of the biggest issues people have is the damage reduction. Well, with the new dragons, and Higher AP items, I don't see a difference at all, compared to my older power spikes. Especially if we secure a Fire Dragon.","replies":[]}]},{"poster":"Slythion","date":"2016-05-06T13:33:13.133+0000","up_votes":1,"down_votes":0,"body":"With big change comes big complainers, the boards only serve as a place for them all to gather","replies":[{"poster":"Hyperiön","date":"2016-05-06T13:37:07.032+0000","up_votes":1,"down_votes":1,"body":"Exactly, Riot doesn't need to get all this grief because they change the game on what they think is best.","replies":[]}]},{"poster":"Dragfin","date":"2016-05-06T13:49:07.178+0000","up_votes":1,"down_votes":1,"body":"Upvoted because you admitted you are part of this pathetic generation and are one of the few that see what people in this generation truly are. I feel bad for you buddy because you are obviously not like that one bit but you are grouped in with them. Kudos to your parents for actually doing their job the right way. It's a shame that so many don't and we have to deal with these self entitled little jerks all the time in everyday life.","replies":[{"poster":"Hyperiön","date":"2016-05-06T13:56:28.392+0000","up_votes":1,"down_votes":1,"body":"Well I actually pretty much raised myself xD But thanks for that :) It is a shame that parents don't take the time to take the time to raise the kids, rather than just buy things for them and hope they turn out for the best.","replies":[]}]}]}