{"poster":"Lord Desert","date":"2016-09-28T17:46:41.302+0000","title":"@Meddler Are there bigger changes planned for Cho?","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"Im not crying for a rework here, but a champion update, on the scale of sona/leona, would be nice :D\r\nSo are there bigger changes in development for our beloved creep and wierd moving minion eater coming?","replies":[{"poster":"Meddler","date":"2016-09-28T20:23:05.188+0000","up_votes":8,"down_votes":0,"body":"Nothing in the short to medium term. Could imagine something Leona sized at some point, nothing currently slotted though. \n\nIn terms of a full VGU he's a fair way down the list. He's showing his age, but he doesn't have the comprehensive issues of say Urgot or Warwick.","replies":[{"poster":"Brutusness","date":"2016-09-28T20:24:35.017+0000","up_votes":2,"down_votes":0,"body":"Urgot confirmed 2017. Get hype.","replies":[{"poster":"Meddler","date":"2016-09-28T20:28:12.387+0000","up_votes":18,"down_votes":0,"body":"Odds are good. This being Urgot, the goods are also odd.","replies":[{"poster":"Brutusness","date":"2016-09-28T22:49:57.032+0000","up_votes":1,"down_votes":0,"body":"Are you going to keep the whole High Executioner theme of Urgot? I really enjoy that part.","replies":[{"poster":"sp441","date":"2016-09-28T23:36:39.340+0000","up_votes":1,"down_votes":0,"body":"Damn.\n\nNow I want a Executioner Smough skin for Urgot.","replies":[]}]},{"poster":"sp441","date":"2016-09-28T23:36:14.103+0000","up_votes":1,"down_votes":0,"body":"Dude, you HAVE to release Urgot on 2017.\n\nTHINK OF THE MEMES.","replies":[]},{"poster":"Jeddy017","date":"2016-09-28T21:55:51.635+0000","up_votes":1,"down_votes":0,"body":"Odds are good.\nGoods are odd.\nThis is the Urgod.","replies":[]},{"poster":"Sukishoo","date":"2016-09-28T20:43:15.388+0000","up_votes":1,"down_votes":0,"body":"Very odd xD","replies":[]},{"poster":"Brutusness","date":"2016-09-28T20:37:58.642+0000","up_votes":1,"down_votes":0,"body":"Bigger, better, and wheezier than ever before. My body is ready.","replies":[]}]}]},{"poster":"Darlantan12","date":"2016-09-29T07:04:17.211+0000","up_votes":2,"down_votes":0,"body":"Recently, other Riot said that {{champion:31}}  is not on the top of the list but it is quite high and now I hear that I probably never see him before 2020. I would ask you to reconsider the VGU. Cho has outdated model, animation, gameplay a little bored WQR and one of his legendary skins looks like 750RP. In addition, he has a great visual potential. Tail, claws, horns, incrrease R. This makes that he can become the biggest (literally and figuratively) and the best in the history of the VU. I would ask for any answer, I just want to know if you read this.","replies":[]},{"poster":"ProfDrDeath","date":"2016-09-28T20:42:15.561+0000","up_votes":1,"down_votes":0,"body":"One question regarding Cho that's not coming from a gameplay angle:\n\nDo you know if there are any updates to his skins' splash arts are in the works? Because I majorly liked the [old art of Gentleman Cho](http://leagueoflegends.wikia.com/wiki/Cho%27Gath?file=Cho%27Gath_GentlemanSkin_old.jpg), with everything illuminate by the glow of the fire, and rather hate the new \"art\" (read: crap).","replies":[{"poster":"Meddler","date":"2016-09-29T00:50:19.068+0000","up_votes":2,"down_votes":0,"body":"Our current strategy for splash art updates is to go back and do them for champs we've already done gameplay/visual updates for (fix the part of the package we didn't get to at the time basically). Cho's not in that category at least. Once we're done with that though we'll set up another batch of champs for splash art updates, imagine Cho's a contender there.\n\nLong term the goal is to update splash art for all champs, so it should be a question of when not if at least.","replies":[{"poster":"Brutusness","date":"2016-09-29T02:14:21.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=BNcuxie4,comment-id=000100010000,timestamp=2016-09-29T00:50:19.068+0000)\n>\n> Our current strategy for splash art updates is to go back and do them for champs we&#x27;ve already done gameplay/visual updates for (fix the part of the package we didn&#x27;t get to at the time basically). Cho&#x27;s not in that category at least. Once we&#x27;re done with that though we&#x27;ll set up another batch of champs for splash art updates, imagine Cho&#x27;s a contender there.\n> \n> Long term the goal is to update splash art for all champs, so it should be a question of when not if at least.\n\nHey Meddler, out of curiosity, how many reworks and champs are planned to release before year's end? I'm assuming Warwick and at least one more original champ, does that sound about right?","replies":[{"poster":"Sad Tyrant","date":"2016-09-29T15:53:19.162+0000","up_votes":1,"down_votes":0,"body":"Warwick is almost certain to be next year, early next year. Galio's, i reckon, would be around the same time Taric's was. its also most certain that we are going to receive at least one more champion, based on the patterns Riot have shown","replies":[{"poster":"Sexy Jack Rabbit","date":"2016-09-29T16:21:17.313+0000","up_votes":1,"down_votes":0,"body":"3 - 5 is the current estimation of ChampUps Riot has given so far. \nWe might See {{champion:19}}  in January, {{champion:3}}  Late march, {{champion:6}}  late August,  {{champion:20}}  around late November or December. On average if they are 100% on track or maybe a little bite ahead champion VGU take about 8 months. \n We might begin the new season with {{champion:28}} .\nChampUps/VGU are a lot more abundant at the beginning of the year as they are started the year prior, and the fall off as the year goes on. Considering we got {{champion:98}} ,{{champion:44}} ,{{champion:13}}  and {{champion:83}}  this year, 4 is very reasonable number. ","replies":[]}]}]}]}]},{"poster":"Lord Desert","date":"2016-09-29T04:28:31.221+0000","up_votes":1,"down_votes":0,"body":"Thanks for the info and your time to comment ! \nI hade some changes regarding his E in mind, but if there is no development currently planned, i can tell you later when its possible needed/helpful :D\nYour doing a great job btw if nobody told you already xD","replies":[]},{"poster":"Erablier","date":"2016-09-28T22:21:21.925+0000","up_votes":1,"down_votes":0,"body":"So like 2019 or 2020 for the full VGU? Also isn't his issue is that he's a had counter to combo teams yet two of his better and fun abilities (Q and W) are what make that a problem?","replies":[]}]},{"poster":"Meep Man","date":"2016-09-28T18:16:56.602+0000","up_votes":1,"down_votes":0,"body":"Yes, he is on the list for VGU","replies":[]}]}