{"poster":"RaZeProPowaZ","date":"2015-10-04T14:17:23.037+0000","title":"Problemi in gioco","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve, &egrave; da un p&oacute; di settimane che lol mi da dei problemi, quando avvio una qualsiasi partita il gioco parte in modalit&agrave; finestra e non vedo i glod dei last hit. Ho provato a riparare il client dal launcher e ho ripristinato le impostazioni in game ma ogni partita inizia in modalit&agrave; finestra. Per quanto rigarda i gold dei last hit non cambia nulla, anche se ripristino le impostazione predefinite non riesco a vederli.\r\nSpero riusciate ad aiutarmi, grazie in anticipo.\r\nRaZeProPowaZ","replies":[{"poster":"Ayuvelon","date":"2016-01-14T10:55:31.720+0000","up_votes":1,"down_votes":0,"body":"Hai ancora il problema? Sono passati 3 mesi ormai... ^^\nMale che vada ti consiglio nuovamente di disinstallare a dovere LoL e reinstallarlo per capire se c'è un errore nel client.\n\nP.","replies":[]},{"poster":"Ayuvelon","date":"2015-10-04T15:54:37.460+0000","up_votes":1,"down_votes":0,"body":"Utilizzi MAC, Linux o Windows?\nChe sistema operativo utilizzi?\nEsegui League of Legends come amministratore? Hai provato a riparare le chiavi di registro (utilizzando software come Wise Registry Cleaner)? Puoi eseguire un backup al momento in cui sei certo che il client funzionasse?\nMale che vada ti consiglio di disinstallare tramite Revo Uninstaller (che pulisce interamente le tracce del gioco sul pc) e reinstallare il gioco. Non ci mette molto a scaricare, specie se hai connessioni di ultima generazione.","replies":[{"poster":"RaZeProPowaZ","date":"2015-10-04T18:03:55.799+0000","up_votes":1,"down_votes":0,"body":"Utilizzo windows 10, League of Legends lo eseguo normalmente.\nHo scaricato Wise Registry Cleaner ma dopo la riparazione non è cambiato nulla, il backup lo eviterei dato che ho fatto da poco l'aggiornamento a windows 10, però adesso che ci penso il problema è sorto dopo l'aggiornamento di windows.","replies":[]}]}]}