{"poster":"Gyumin","date":"2017-05-25T01:51:04.195+0000","title":"Every time I get into champ select, my wifi constantly loses connection.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I'm not really sure what to do from here as this is a somewhat weird issue. Every time I get into champ select, and this is EVERY time without failure, I will start having an issue with my internet on my computer specifically. I am not sure what it could be, it has caused me to dodge games, even ranked games and it is not fun to deal with. (And by dodge I mean that because of the internet problems I was not able to ban/pick my champ). The weird part of this issue is that it only VERY specifically happens in champ select. Once I'm in game there is no more problems, when searching for games the \"game found\" comes up just fine, but once in champ select it freaks out.\r\n\r\nAnd it is not just League that gets affected, my internet on my computer cuts out as a whole, and I cannot access any websites in the background. If I go to my network connection settings I can see I am still connected to my internet, but all other wifi's around me have gone away. But if I stay in that network connection settings it will come back up and league champ select will update, almost like my computer forgot it had a network adapter. I know its not pando media booster as I have LONG had that uninstalled, and its not my router as I have made sure that it is completely up to date. I have reinstalled league once, and it cannot be my network adapter because the ONLY time this happens is in champ select, otherwise I have not lost internet connection ever unless my internet was down as a whole.\r\n\r\nLooking for some good ideas here at this point, I don't think it could be a firewall, but I could be wrong. Help me out here Rito!\r\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Gyumin","date":"2017-05-28T03:25:07.993+0000","up_votes":1,"down_votes":0,"body":"Hey thanks for the help guys, turns out it was something with my router, the issue is still happening, but I think I have it from here!","replies":[]},{"poster":"Porocles","date":"2017-05-25T21:45:22.811+0000","up_votes":1,"down_votes":0,"body":"Your connection seems to be degrading and unable to keep up with the live connection needed to play League, which must be pretty frustrating for you.  The  first suggestion I would offer here is to try a wired connection, even if just to help rule out possibilities with your wi-fi.  The goal here is to tune up your connection to our services and game server, so I recommend running through each step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot further and tighten up your network.  I hope it helps, but let me know if you have any questions.\n\nAlso as an aside, Pando Media Booster is a really old way of how we used to patch updates and is no longer used.","replies":[]},{"poster":"Broporo","date":"2017-05-25T21:44:50.645+0000","up_votes":1,"down_votes":0,"body":"That's pretty weird that your entire pc is losing it's connection when trying to play League. Typically you can get around those awkward connection issues on the champion select screen by checking up on some of your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues), but it sounds like you've done a good deal of troubleshooting on your own already. \n\nDouble check the settings in that guide, and let me know if that doesn't seem to help at all!","replies":[]},{"poster":"Gyumin","date":"2017-05-25T04:26:00.170+0000","up_votes":1,"down_votes":0,"body":"Bump","replies":[]}]}