{"poster":"BattousaiDeDo","date":"2015-04-21T12:13:55.575+0000","title":"Suche Mitspieler für ein Ranked Team im Aufbau","subforum":"Clans & Teams","embed":{"description":null,"url":"https://roninclan.de","image":null},"up_votes":1,"down_votes":1,"body":"Hallo Community,\n\nEin Freund und ich (BattousaiDeDo) suchen Mitspieler f&uuml;r ein Team im Aufbau.\nWir suchen Mid, Jungle und Support f&uuml;r 5vs5 Ranked aber auch noch einen 3. f&uuml;r Twisted Treeline.\n\nWas ihr mitbringen solltet:\n- min 16 Jahre alt und eine gewisse reife\n- Teamspeak 3 Client und ien vern&uuml;nftiges Headset\n- Kritikf&auml;higkeit, sowohl passiv als auch aktiv\n- Spa&szlig; am Spiel\n- Spa&szlig; am verbessern der eigenen F&auml;higkeiten\n- Zeit f&uuml;r regelm&auml;&szlig;ige Trainings (1 bis 2 mal in der Woche)\n- Level 30 und Grundwissen der eigenen Champions, Runen und Masteries\n- Ausreichenden Championpool\n\nWas wir bieten:\n- Teamspeak Server\n- Community Forum\n- Langj&auml;hrige Erfahrung in eSports ( habe internationalen Clan gef&uuml;hrt f&uuml;r Empire at War und Supreme Commander und habe CS:S in der Amateurliga gespielt Top 10.)\n- Fr&ouml;hliche Umgebung und jede Menge tiefschwarzer Humor\n\nWenn ihr euch angesprochen f&uuml;hlt dann added mich in LoL oder joint auf unseren TS: roninclan.de\n\nLiebe Gr&uuml;&szlig;e / kind regards\nBattousaiDeDo","replies":[{"poster":"Xinary","date":"2015-04-21T21:01:11.627+0000","up_votes":1,"down_votes":0,"body":"Hey.\n\nIch bin Jörn, 20 jahre alt und spiele Main Midlane. Ich bin bzw war letzte season plat 3, habe dann bis anfang dieser season eine spielpause aufgrund realliveeinflüssen gehabt und habe meien accountdaten verlegt. nun habe ich einen neuen, indem ic hdie placements richtig verkackt habe daher nur silver... Trotzdem glaube ich, dass ich meien Lane beherrsche und ich zu euch passen würde. Ich könnte meinerseits nur anbiten ein testspiel zu machen und ihr schaut es euch an! Falls ihr interesse habt schreibt es mir bitteingame oder hier im forum\n\nMfG Jörn/Xinary","replies":[]}]}