{"poster":"Vendemiaire","date":"2016-03-07T15:34:10.588+0000","title":"What do I do if I want to add extra sections to my report after it's sent?","subforum":"Player Behavior","up_votes":2,"down_votes":2,"body":"I just had this guy flaming the entire team, after I reported him already for Verbal abuse, he did some hate speech, and I want to report that as well, but the report is sent already.","replies":[{"poster":"COBRA C0MM4NDER","date":"2016-03-07T19:35:20.196+0000","up_votes":1,"down_votes":0,"body":"if it helps, what you do is send in a ticket to support and you give them details on what game you encountered the verbal abuse.\n\nRiot in turn will examine the matchup, scan the chat logs and apply judgement accordingly.\n\nYou are a credit to the community by reporting such players.\n\nAnd I'm not the only one who would suggest the same actions.\n\nThe link for support tickets is on top of the webpage here. (SUPPORT)\n\nor you can copy/paste this into your browser address bar :    -->    https://support.riotgames.com/hc/en-us    <----\n\nGood luck!","replies":[]},{"poster":"Linthe","date":"2016-03-07T16:12:48.077+0000","up_votes":1,"down_votes":0,"body":"You can send an email to Riot.","replies":[]},{"poster":"DJColdCutz","date":"2016-03-07T16:09:49.273+0000","up_votes":1,"down_votes":0,"body":"All you have to do is remember to wait until the player leaves the lobby next game. Hate speech/offensive language isn't uncommon. Don't worry, you'll have plenty more opportunities to report people.","replies":[]},{"poster":"Athina","date":"2016-03-07T15:42:38.058+0000","up_votes":1,"down_votes":0,"body":"I want to believe that simply sending the report should flag him for the system to look at anything related to that game, not just what you reported him for. I wouldn't know since I didn't create the system, but it makes enough sense to me.","replies":[]},{"poster":"Best Darius KR","date":"2016-03-07T15:37:51.934+0000","up_votes":1,"down_votes":0,"body":"You can't. Once it's sent, it's sent.","replies":[]},{"poster":"SmokedAlmonds","date":"2016-03-07T16:24:35.484+0000","up_votes":1,"down_votes":1,"body":"You can report them in a support ticket but I don't think there is any reason to. It doesn't seem to me that the hate speech option should do anything more or different than verbal abuse. I think it just exists to highlight the importance of it to users. The chat is going to be reviewed from the verbal abuse report and I just can't see the system treating hate speech it finds differently just because it was reported as verbal abuse and not hate speech.","replies":[]},{"poster":"proud and bronze","date":"2016-03-07T16:10:51.481+0000","up_votes":1,"down_votes":1,"body":"he really got to you eh?\n\ntroll: 1 \nthecrimsonsky: 0","replies":[]}]}