{"poster":"HeyDudeChillOut","date":"2018-10-08T10:01:20.819+0000","title":"La Ganancia De Esencias Azules En El Juego","subforum":"Charlas Generales","up_votes":8,"down_votes":1,"body":"Mi opini&oacute;n  de la ganancias de Esencias Azules es muy poca ademas de campeones que valen mucho y que no te puedes comprar ya que no tienes la suficientes Esencias Azules y lo que pido yo mis amigos y la gente de mi grupo pedimos que subas el precio de la venta  de Campeones que los de 6300 se puedan vender a:2300 los de 4800 se puedan vender a 1750 los de 3150 se puedan vender a:950 los de 650 a:300 por que la ganancia de campeones es muy pocas a niveles bajos y la verdad esto lo hemos pensado por semanas y esto esta planeado as&iacute; para las personas \r\nnuevas no sea tan dif&iacute;cil conseguir Esencias Azules \r\nas&iacute; las personas de nivel bajo puedan comprar o desbloquear las piezas de maestr&iacute;as mas f&aacute;cil \r\nmas que una queja es una opini&oacute;n \r\n Gracias Por Su Atenci&oacute;n Y Comprensi&oacute;n","replies":[{"poster":"fenixerege","date":"2018-10-08T11:17:37.129+0000","up_votes":3,"down_votes":1,"body":"hubose una vez en donde tener el total de campeones existentes demandaba al menos 2 años en tenerlos, y muchos cosas commo el llegar a lvl 30 era mucho pero mucho mas tiempo invertido, no habia runas gratis tenias que comprarlas a todas, tenias que comprar las paginas, y asi sucesivamente en varios aspectos del juego.\nEn pocas palabras ahora esta todo tremendamente facil, gratis, accesible, cualquiera puede tener una cuenta full facilmente...........que no sepas como hacerlo o que no quieras dedicar tiempo al juego es tema aparte...........","replies":[{"poster":"Shijim4 de Virgo","date":"2018-10-08T14:10:14.275+0000","up_votes":1,"down_votes":0,"body":"Es mentira lo de los 2 años, yo juego hace 6 años y aun no puedo obtener todos los campeones :C me faltan 12 (6 de los 6200 y  6 de 4800) y es verdad que ahora es mas facil obtener todo.","replies":[{"poster":"Pollo al Ornno","date":"2018-10-08T19:51:21.496+0000","up_votes":1,"down_votes":0,"body":"Tene en cuenta que a lo largo de tus 6 años sacaron nuevos campeones casi todos los meses.","replies":[{"poster":"Shijim4 de Virgo","date":"2018-10-08T20:04:28.576+0000","up_votes":1,"down_votes":0,"body":"Mensualmente desde q empeze hacce 6 años debi de ganar 8000 a 10000 PI (EA) y ni asi a la fecha pude obtener los 140 campeones. Pero tengo 12 paginas de runas, todos los iconos que salieron por PI hasta la fecha al igual q marcos, gestos, cromas, etc.","replies":[{"poster":"Pollo al Ornno","date":"2018-10-09T20:13:12.663+0000","up_votes":1,"down_votes":0,"body":"Bueno entonces ahi esta el tema de porque no pudiste tener todos los champs en ese periodo de tiempo.","replies":[]}]}]},{"poster":"Haruhi","date":"2018-10-08T14:49:33.492+0000","up_votes":1,"down_votes":0,"body":"Yo ya los tengo todos hace tiempo y ya pase los 100k de EA (y eso que me encanta gastar EA en idioteces como el cambio de nombre o las cromas xD)","replies":[]}]},{"poster":"Hïtler","date":"2018-10-08T21:47:03.193+0000","up_votes":1,"down_votes":0,"body":"Yo empecé a jugar en abril de  2017 aproximadamente, a día de hoy me faltan 37 campeones por obtener; 20 de 4800 y 17 de 6300. Con la EA y fragmentos de campeones no obtenidos que por ahora no quiero obtener, que tengo en mi botín, podría comprar ya nomás 7 campeones más de  6300. Me quedarían faltando 20 de 4800 y 10 de 6300. Por lo tanto, a menos que con \"HUBOSE  una vez...\" te refieras a un lapso de tiempo no mayor a 12 meses, te puedo decir que sigue demandando el mismo tiempo conseguir los campeones.","replies":[]}]},{"poster":"HeyDudeChillOut","date":"2018-10-10T16:35:37.741+0000","up_votes":1,"down_votes":0,"body":"gracias por compartir sus opiniones o sus razones \ngracias por leer mis comentarios sean buenos o sean malos ya que siempre me a gustado saber mas  sobre la gente del lol\npor que siempre ay gente que dice cosas del juego lo critica y eso no esta bien sabiendo que crear un juego es difícil y balancearlo también\ncomo crear campeones actualizar campeones es muy difícil y eso la gente no lo sabe por eso doy opiniones no tan buenas para ver que opina la gente igual les agradezco por sus comentarios que no son flamer \n                                                    gracias","replies":[]},{"poster":"Skhertaz SRn","date":"2018-10-09T14:35:40.642+0000","up_votes":1,"down_votes":0,"body":"Si se hace eso que estás pidiendo vos, la compra de campeones sería muy facil y en algún momento todos tendrían todos los campeones y no se sabría que hacer con la escencia aparte de gastarla en subir a los campeones a maestrías superiores. Por lo tanto, no es una buena idea del todo! \n\nPD: Además asi está bueno ya que es complicado y tenes un objetivo","replies":[]},{"poster":"NLG Walter","date":"2018-10-08T22:33:36.644+0000","up_votes":1,"down_votes":0,"body":"El costo total de todos los campeones siempre ha sido el mismo, 500k-600k EA aprox, o sea, 2 años de juego intensivos, es lo que me tomo a mi conseguirlos todos.\n\nCada vez que sale un campeon nuevo, hay otro que disminuye de precio, como Thresh, que bajara a 4800 EA.\nhttp://leagueoflegends.wikia.com/wiki/Price_reduction_history","replies":[]},{"poster":"Pliosaurio","date":"2018-10-08T15:37:42.327+0000","up_votes":1,"down_votes":0,"body":"Esta bien equitativo la obtención de las esencias azules (ea) porque si fuera más, seria muy abusivo para el sistema en si. Ademas tenes los cofres de nivel que te dan fragmentos de campeón y/o mas esencias azules. Saludos","replies":[]},{"poster":"HopelessRomantic","date":"2018-10-08T15:34:58.951+0000","up_votes":1,"down_votes":0,"body":"No te regalan banda de campeones \"caros\" cuando estás subiendo niveles 1-30? https://chiboost.net/all-league-of-legend-level-up-rewards/\nSi siguen estando las misiones \"level 15 o menor\" entonces deberían recibir como 2-3 campeones de 4800EA+ totalmente gratis(jugando partidas).","replies":[]}]}