{"poster":"Tesserax","date":"2017-04-08T17:42:59.141+0000","title":"Dear Riot...","subforum":"GD","up_votes":1,"down_votes":1,"body":"Goodbye, this is going to be it for a while now, or at least the time being. My friend and I have come to the conclusion that somehow you&#039;ve fucked up matchmaking, because all of our games are completely lopsided in either our favour or that of the enemy. Our Silver elo games will often include Platinum players on our team vs bronze players on theirs, or it may be swapped and we might be getting our asses fucked hard. The last week of games he and I have played are evident of this.\r\n\r\nOver the last week, despite our own personal performance, it felt like the game was more decided by the overall strength of the players on either team, and that we had little control over whether or not our Tristana ADC would go 1-10-1, the enemy Renekton would experience DC problems and their bot lane feed us like suicidal cows, or simply the fact that we get autofilled into a position we&#039;re uncomfortable in, and have to PRAY that the person who filled in our role can do their job properly, which is again another 50/50.\r\n\r\nWorst part is, I&#039;ve realized this mostly happens when we&#039;re playing duo Q, and that Solo Q will often go in my favour (not just because my teams are good, but because they play like they actually WANT to win, like they actually KNOW how to get carried), whereas games where we play together feel like a coin flip and it&#039;s so fucking crushing when we try as hard as we do but our team gives up halfway and started afking or inting, or just so fucking boring when the enemy team gives up halfway and starts afking or inting.\r\n\r\nSeriously, Riot, you&#039;ve fucked up somewhere, and it&#039;s made the game disappointingly boring, dull, and in fact punishing to play. Games shouldn&#039;t punish the player for playing. Of course, we&#039;re more casual gamers, even if we do try hard to win, so we don&#039;t play often. But this means that we don&#039;t quite make the 100-200+ games a month grind that some players do to actually even out the randomness in the games. We simply don&#039;t have the time nor patience.\r\n\r\nSo good luck to you in the future, I&#039;m honestly amazed that this game is still going so strong given its current state, but I suppose that when your system stabilizes through its toxic gameplay, players, and lack of effort to bring order back to everything; it&#039;s very easy to keep clean a house full of shit when your standards are low enough.\r\n\r\nPeace out, good luck leeching more money off this piteous player base","replies":[]}