{"poster":"tusdayHUN","date":"2017-01-11T16:24:55.658+0000","title":"Bannolás","subforum":"Segítség és támogatás","up_votes":1,"down_votes":1,"body":"Azt szeretn&eacute;m k&eacute;rdezni, hogy ha valaki reportolna engem, de nem k&ouml;vettem el azt ami&eacute;rt reportolna, &eacute;s ezt megcsin&aacute;lja sokszor, akkor kapn&eacute;k bannt?","replies":[{"poster":"DS Arawyn","date":"2017-01-11T16:39:26.458+0000","up_votes":1,"down_votes":1,"body":"A rendszer ilyenkor megnézi hogy amit kaptál reportokat azok jogosak voltak-e. Ha nem csináltál semmit akkor nem kapsz semmi büntit sőt aki reportolt téged az fog jogtalan reportért bannt kapni :)","replies":[{"poster":"Vasipari Béla","date":"2017-01-11T17:27:23.946+0000","up_votes":2,"down_votes":0,"body":"> jogtalan reportért bannt kapni\n\nna ilyenről se hallottam még","replies":[]},{"poster":"Ia Cthulhu","date":"2017-01-11T16:52:03.213+0000","up_votes":2,"down_votes":0,"body":"Bannt azért nem fog kapni, de ha sok ilyet csinál egy idő után nem ér majd semmit a reportja, még akkor sem ha jogos.","replies":[]}]},{"poster":"Mind The Gap","date":"2017-01-11T18:03:23.626+0000","up_votes":2,"down_votes":1,"body":"Hello! ;)\n\nJogtalanul nem kaphatsz büntetést. Illetve ahogy alább írták, a jelentési rendszerrel való visszaélés az illető fiókjának a felfüggesztéséhez vezethet. :)","replies":[{"poster":"Afelers","date":"2017-01-11T18:56:21.891+0000","up_votes":1,"down_votes":1,"body":"Elvileg volt valami olyasmi, nem tudom mennyi igaz belőle, hogy egy srácnak azért függesztették fel a fiókját többször, aztán már két hétre, mert flash-smite singed supportot játszott, ez pedig nem tetszett a játékosoknak és jelentették, hiába működött annyira, hogy már platig jutott vele, a Riot Supportnál meg valaki valami olyasmit válaszolt neki, hogy mások játékélményét rontja azzal, hogy ezt csinálja, ezért ne tegye, különben következményei lesznek :c","replies":[{"poster":"M4dr4c","date":"2017-01-11T20:58:41.926+0000","up_votes":1,"down_votes":0,"body":"A történet vége lemaradt, az, hogy a végén a support bocsánatot kért tőle és azóta is játssza a support Singedet. Amúgy ő a legtöbb mastery ponttal rendelkező Singed player.","replies":[{"poster":"Afelers","date":"2017-01-11T22:54:40.396+0000","up_votes":1,"down_votes":0,"body":"ah so, amikor hallottam erről még aktív volt a dolog és nem volt meg ez a része","replies":[]}]},{"poster":"Mind The Gap","date":"2017-01-11T19:17:32.545+0000","up_votes":1,"down_votes":0,"body":"Jó, csak hát van különbség, amikor több ember jelent valakit ugyanazért, meg hogy egy valaki csak bosszúból jelenti. Egyébként meg mi nem tudhatjuk, hogy mi történt azokon a flash-smite Singed supportos meccseken, egyedül azok, akik részt vettek rajta, illetve a felülvizsgálók. :)","replies":[]}]}]}]}