{"poster":"XEN K JaimoeGG","date":"2015-12-15T14:58:52.400+0000","title":"Steht ein Taric-Rework an oder nicht?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Guten Tag allerseits!\r\n\r\nF&uuml;r die neue Saison habe ich meinen Championpool mal ordentlich umgepackt und habe nun, da ich liebend gerne non-meta Champs spiele, unter anderem Taric als Counter gegen AD-Nahm&auml;pfer Top, Tank Jungler und Tank Support in meinen Pool gepackt. Da bleibt nat&uuml;rlich f&uuml;r mich die Frage offen, ob Taric in naher Zukunft ein Rework bekommt, da ich keinen Champ spielen will, der noch w&auml;hrend der Ranked Saison gereworked wird.\r\n\r\nTaric ist ein guter Champ f&uuml;r mich in Silber da mann mit starken non-meta Picks auftrupfen kann, da die Gegmer dich nicht richtig einsch&auml;tzen k&ouml;nnen!\r\n\r\nIch freue ,mich &uuml;ber Links mit mehr Infos!\r\n\r\nMal gerade noch so nebenbei; warum reworked Riot Champions, die zwar wenig gespielt werde, aber trotzdem von einigen wenigen sehr gerne gespielt werden? Ich als Taric Main w&auml;re nicht gerade &uuml;ber ein Rework erfreut wenn es passieren w&uuml;rde {{item:3070}} {{champion:44}}","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T15:00:55.937+0000","up_votes":2,"down_votes":0,"body":"Gerade weil sie so wenig gespielt werden, werden sie ja gereworked.","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T15:03:00.282+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlashIn2Safety,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=0000,timestamp=2015-12-15T15:00:55.937+0000)\n>\n> Gerade weil sie so wenig gespielt werden, werden sie ja gereworked.\n\n\nSolange aber Spieler da sind die den Champion mögen, finde ich es doof das dieser ge-reworked werden kann. ich sehe genau so wenige Sions wie vor dem Rework.\nDas einzigste was dadurch entstanden ist, ist dass einige wenige nicht mehr ihren lieblings Champ spielen können. \n\nVerstehst du mich?","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T15:05:14.515+0000","up_votes":1,"down_votes":1,"body":"Du argumentierst nicht mit Fakten, das hilft hier nicht weiter.\nDu weißt doch noch gar nicht, wie das Rework aussehen wird.","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T15:07:46.569+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlashIn2Safety,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=000000000000,timestamp=2015-12-15T15:05:14.515+0000)\n>\n> Du argumentierst mit nicht mit Fakten, das hilft hier nicht weiter.\n> Du weißt doch noch gar nicht, wie das Rework aussehen wird.\n\n\nDeswegen fragte ich ja ob einer weiß ob er gereworkt wird...Und warum Riot  sowetwas überhaupt macht","replies":[{"poster":"CooL Ice Tea","date":"2015-12-15T15:20:18.828+0000","up_votes":3,"down_votes":0,"body":"Wenn es 20 Millionen aktive Spieler pro Monat gibt aber nur 10.000 aktive Spieler den aktuellen Taric mögen wird er wohl gereworked damit die 19.990.000,00 anderen Spieler eventuell auch wieder gefallen an dem Champion finden.\n\nMakes sense?","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T15:24:08.070+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CooLlceTea,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=00000000000000000000,timestamp=2015-12-15T15:20:18.828+0000)\n>\n> Wenn es 20 Millionen aktive Spieler pro Monat gibt aber nur 10.000 aktive Spieler den aktuellen Taric mögen wird er wohl gereworked damit die 19.990.000,00 anderen Spieler eventuell auch wieder gefallen an dem Champion finden.\n> \n> Makes sense?\n\n\nNein, da diese Leute andere Champions haben die sie gerne spielen. Dann soll Riot einen neuen Champ kreiren. In der Vergangenheit ist es schon vorgekommen das iein Champ nicht häufiger durch ein Rework gespielt wurde.","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T15:26:45.979+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JJ Xendorian,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=000000000000000000000000,timestamp=2015-12-15T15:24:08.070+0000)\n>\n> Nein, da diese Leute andere Champions haben die sie gerne spielen. Dann soll Riot einen neuen Champ kreiren.\n\nWas ist, wenn viele sich ein Update für Taric wünschen ?\n\n> In der Vergangenheit ist es schon vorgekommen das iein Champ nicht häufiger durch ein Rework gespielt wurde.\n\nQuellen bitte","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T15:29:45.852+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=FlashIn2Safety,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=0000000000000000000000000000,timestamp=2015-12-15T15:26:45.979+0000)\n>\n> Was ist, wenn viele sich ein Update für Taric wünschen ?\n> \n> Quellen bitte\n\n\nEigene Erfahrungen. \n\nBespiel Sion. Ja ich habe ihn selten gesehen, aber einige Monate vor seinem Rework habe ich ihn öfters auf AP Mid im Ranked gehabt, ja es war ein seltsamer Champion aber ich sah ihn wider öfters. Neuer Sion: ich habe den in der Pre-Season noch kein einziges mal gesehen. Ich hatte 3 Urgots Mid aber noch keinen Sion.","replies":[{"poster":"MeMyselfandBaal","date":"2015-12-15T19:55:08.450+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=JJ Xendorian,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=00000000000000000000000000000000,timestamp=2015-12-15T15:29:45.852+0000)\n>\n> Eigene Erfahrungen. \n> \n> Bespiel Sion. Ja ich habe ihn selten gesehen, aber einige Monate vor seinem Rework habe ich ihn öfters auf AP Mid im Ranked gehabt, ja es war ein seltsamer Champion aber ich sah ihn wider öfters. Neuer Sion: ich habe den in der Pre-Season noch kein einziges mal gesehen. Ich hatte 3 Urgots Mid aber noch keinen Sion.\n\nDas beweist doch nur, dass deine eigene Erfahrung keine brauchbare Quelle ist.... Sion gilt im Allgemeinen als das Paradebeispiel für einen gelungenen Rework. Schließlich war er vor dem Rework auf \"OMG, i'd rather dodge then play with him\" Beliebtheitsniveau und wurde nach dem Rework sogar auf allerhöchstem Niveau gespielt. Dass er dieses Niveau nicht dauerhaft gehalten hat, liegt halt auch an einigen Nerfs. Trotzdem ist er jetzt immer noch auf einem besseren Stand als vor dem Rework... Und vor allem kann man ihn jetzt, wo er ein moderneres Kit hat, auch einfach über Buffs wieder in die Meta bringen...\n\nJetzt die nächste Episode: Opa erzählt wieder vom Krieg: Vertrau mir mal, so ein Rework ist auf keinem Fall was schlechtes... Ich war Karma Main bevor es den Rework gab. Ich weiß also, wovon ich rede, wenn Leute die Que dodgen, nur weil du nen Champion piickst. Und war nach dem Rework erstaunt, wie viel einfacher das Spiel ist, wenn man einen legitimen Champion als Main hat... \nSolange Taric weiterhin der Anit AD Tank bleibt, wirst du als Taric Main langfristig von diesem Rework profitieren. \n\nFür mich gibt es ja nur ein einziges Argument gegen ein Taric Rework (und ich besitze einen Taric Skin, würde also selber von einer höheren Beliebtheit profitieren...): Er ist der einfachste Support, den es gibt. Weil man halt praktisch nichts mit ihm zu tun hat. Da kann man sich dann 20 Sekunden lang (also während der Stun auf Cooldown ist) mit der Strategischen Aufgabe des Supports (wo stelle ich jetzt eigentlich Wards auf) beschäftigen. Und da der Ulti einfach nur aus \"Ich drücke jetzt R\" besteht und man im Zweifelsfall auch nichts verkehrt macht, wenn man seinen W (den Skill, den man nebenbei Maxen sollte... um mal zu klären wie wenig Playmaking-Potenzial in Taric steckt) nicht auslöst, kann man mit ihm halt auch nichts verkehrt machen... Was halt wunderbar für Einsteiger (sowohl ins Spiel als auch in die Rolle) ist. Und solche Champs muss es halt auch geben...","replies":[]},{"poster":"Fjiordor","date":"2015-12-15T15:33:05.800+0000","up_votes":2,"down_votes":2,"body":"Eigene Erfahrung ist genau so gut wie \"Quelle: Internet\"","replies":[{"poster":"Fjiordor","date":"2015-12-15T15:33:27.787+0000","up_votes":4,"down_votes":2,"body":"http://i.memeful.com/media/post/odg36dy_700wa_0.gif","replies":[]}]},{"poster":"A Dragons Heart","date":"2015-12-15T16:04:20.055+0000","up_votes":1,"down_votes":0,"body":"Kannst du deine eigene Erfahrung mit Fakten untermauern ?","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T17:38:08.939+0000","up_votes":1,"down_votes":2,"body":"So ja hier. Ich spiele Taric. Mir macht er spaß. Ihr spielt nicht oft Taric (Ich gehe davon aus). Dann spielt halt was anderes aber ich will mein Taric so wie er ist. was ist dass Konzept? Er ist nicht sehr schwer aber auch nicht gerade leicht als Top Laner. Als Supp langweilig. Er ist noicht broken und auch nicht schlecht. WARUM ein Reworkk? NUR damit ihn viele spielen? die winrate von taric ist gut ausgeglichen. Kein Grund.","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T20:58:55.162+0000","up_votes":1,"down_votes":0,"body":"Du hast immer noch keine Fakten genannt. Und die Gründe haben wir vorher schon einige Male erklärt.","replies":[]}]}]}]}]},{"poster":"BloodyVampir","date":"2015-12-15T15:38:26.199+0000","up_votes":4,"down_votes":1,"body":"Ein Champion wird aber nicht gereworkt, damit ihn möglichst viele Leute toll finde. Er wird gereworkt, damit er eine saubere Mechanik und ein klares Konzept bekommt. Was macht Taric im Moment? Er drückt E zum stunnen und Q zum heilen, sowas macht einfach keinen Spaß. Und der Sinn eines Reworks ist es, einen Champion auf den aktuellen Standart zu bringen, damit er ein gewisses Konzept erhält und nicht nur irgendwelche click and point Fähigkeiten.\nAkzeptier es einfach, dass Taric der nächste Champion ist, der gereworkt wird!","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T17:35:05.816+0000","up_votes":2,"down_votes":3,"body":"Ehm wer sagt denn dass man ihn Support spielt? Soll ich auch sagen bei Vayne drückt man erst R und dann tötet mann sie alle? Kannst du mal sachlich bleiben. Danke","replies":[{"poster":"BloodyVampir","date":"2015-12-16T04:55:54.736+0000","up_votes":2,"down_votes":0,"body":"Ich bin ziemlich sachlich. In meinem Post wurde nicht einmal das Wort support erwähnt ;).\nAkzeptier einfach, dass deine argumente nicht vorhanden sind. Taric hat einfach eines der langweilgstwb und schlimmsten Kits und wird deswegen ein Rework bekommen. Und dein Rumgeheule wird es nicht ändern.","replies":[]},{"poster":"A Dragons Heart","date":"2015-12-15T21:02:03.615+0000","up_votes":1,"down_votes":0,"body":"Er hat nicht gesagt, dass man ihn unbedingt Support spielen muss. Aber er hat Recht, dass das Kit von Taric sehr stumpf und veraltet ist. Übrigens: Dein Vayne Beispiel zeigt, dass du unsachlich bist.","replies":[]}]}]}]}]},{"poster":"A Dragons Heart","date":"2015-12-15T15:22:00.583+0000","up_votes":1,"down_votes":0,"body":"Er kriegt ein visuelles und gameplaytechnisches Update, weil ihn erstens wenige spielen, er zweitens im Vergleich zu anderen Helden fot schwächer ist und drittens sowohl sein Aussehen als auch seine Spielmechanik hinterher hinkt.","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T15:25:22.519+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlashIn2Safety,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=00000000000000000001,timestamp=2015-12-15T15:22:00.583+0000)\n>\n> Er kriegt ein visuelles und gameplaytechnisches Update, weil ihn erstens wenige spielen, er zweitens im Vergleich zu anderen Helden fot schwächer ist und drittens sowohl sein Aussehen als auch seine Spielmechanik hinterher hinkt.\n\n\nWoher willst du wissen dass er schwächer ist. Guck dir seine Winrate an.\n\nHasst du ihn mal selbst gespielt? Taric macht jeden ADC im lategame, auch wennes vayne ist","replies":[{"poster":"Fjiordor","date":"2015-12-15T15:37:58.375+0000","up_votes":2,"down_votes":0,"body":"Ich wage das mal stark zu bezweifeln (bei einer Guten vayne)\nAngenommen du gibst beiden 15k gold und lvl 18(was definitiv Lategame ist)\nDann wird eine gute Vayne dir als Taric so eine vor den Bahnhof knallen, dass dir die Gesichtszüge entgleisen","replies":[{"poster":"XEN K JaimoeGG","date":"2015-12-15T17:32:32.906+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fjiordor,realm=EUW,application-id=Wj1wcocU,discussion-id=9nphrTyv,comment-id=0000000000000000000100000001,timestamp=2015-12-15T15:37:58.375+0000)\n>\n> Ich wage das mal stark zu bezweifeln (bei einer Guten vayne)\n> Angenommen du gibst beiden 15k gold und lvl 18(was definitiv Lategame ist)\n> Dann wird eine gute Vayne dir als Taric so eine vor den Bahnhof knallen, dass dir die Gesichtszüge entgleisen\n\nSag mal hasst du je in deinem leben Taric gespielt?\n\nDu skalierst mit Rüstung ---> Rüsrung ist schlecht für Vayne\nIceborn Gauntlet verlangsamt sie\nFrozen Heart weniger AS\nranduins slow und weniger crit\nNinja Tabi \nSpirit Visage für 40 cdr und mehr heal für taric (du kennst seine passive, er kann sich mit 40 cdr alle 4 sec heilen)\nDeadmans Plate. \n\nspiele das 10 spiele und du merkst dass Vayne absolut KEINE chance hat.","replies":[{"poster":"Metalmonni","date":"2015-12-16T09:50:14.891+0000","up_votes":1,"down_votes":0,"body":"Eine gute Vayne wirst du in deinem Kampf genau ein mal treffen können, nämlich unmittelbar nachdem du mit deinem Stun engaged hast. Danach ballert sie dich mit ihrem E wieder auf Reichweite und fängt an unsichtbar vor dir rumzurollen und dich mit True Dmg zu malträtieren, gegen dein deine Rüstung mal gar nichts bring. \nUnd gegen die Tumbles bringt übrigens auch deine Verlangsamung nichts. Du kannst so viel Rüstung haben wie du willst, die macht immer die gleiche Menge an Schaden. Wenn sie es richtig anstellt, lässt sie dich nie wieder in Meelee Reichweite kommen und zerkaut sich Stück für Stück. Damit sind sowohl dein Iceborn, als auch deine Passive absolut nutzlos und du kannst dank deiner epischen Cooldowns jeden Skill ein ganzes mal verwenden.\n\nUnd dann stirbst du.","replies":[]},{"poster":"Fjiordor","date":"2015-12-16T08:01:44.706+0000","up_votes":1,"down_votes":0,"body":"Möööp BS detected\nDie Silverbolts kötteln dich trotzdem weg wie nichts\n12% Max HP **true** Damage sind nicht gesund \nPlus noch die RfC procs","replies":[]}]}]},{"poster":"A Dragons Heart","date":"2015-12-15T15:32:14.402+0000","up_votes":1,"down_votes":0,"body":"Ok, ich beschränke meine Aussage auf Punkt 1 und 3.","replies":[]}]}]}]}]},{"poster":"SorisDynasty","date":"2015-12-16T10:44:55.896+0000","up_votes":2,"down_votes":0,"body":"Wenn es danach ginge, gäbe es niemals Reworks, weil irgendwer immer einen Champion mag.","replies":[]}]},{"poster":"W0RN","date":"2015-12-15T15:56:02.563+0000","up_votes":1,"down_votes":1,"body":"Und was ist mit Graves? War einer der beliebtesten und stärksten ADC´s, bekommt einen krassen Nerf und wird dann reworked, weil ihn keiner mehr spielt. EInen kleinen Buff geben wäre ja zu schwer. Graves war mein Lieblingschamp und jetzt ist er ein haufen Scheiße {{champion:104}}","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T16:04:59.404+0000","up_votes":2,"down_votes":0,"body":"Graves ist realistisch geworden.","replies":[]}]}]},{"poster":"Nephirelle","date":"2015-12-15T15:12:07.683+0000","up_votes":3,"down_votes":0,"body":"Soweit ich weiß ist Taric jetzt, wo Poppy durch ist, auf Platz 1 in der Rework-Liste.","replies":[]},{"poster":"Armaderschaden","date":"2015-12-15T18:03:03.473+0000","up_votes":4,"down_votes":1,"body":"Taric braucht ein Rework, da geht es auch nicht darum, ob er gut ist oder nicht (aktuell). Sondern darum ein gutes aktives Gameplay zu haben, was er aktuell nicht in seiner Rolle als Support hat. Er spielt sich stumpf, hat kein gutes Kit und sein Einfluss im Spiel ist so groß, wie die Anwesenheit von Sion sebst.\nNur weil einer hier rumheult(ja jetzt werde ich direkt), keine Ahnung hat was sein Champion machen soll und auch sonst keine andere Meinung zu lässt.\nSehe ich mich nur bestätigt, das es nicht dein Lieblingschampion ist, sonst würdest du dich nicht so dagegen sperren.","replies":[]},{"poster":"Anopka","date":"2015-12-15T18:32:22.098+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach braucht Taric absolut kein Rework. Seine Stärke liegt eigentlich am ehesten in der Rüstung. Taric kann unheimlich viel Schaden einstecken und kann mit seiner Q nicht nur sich selbst heilen. Auch seine W macht sich bei hoher Rüstung sehr gut, weil sich dadurch die Rüstung von Gegnern veringern lässt. In kombination mit der Ulti lässt sich damit ordentlich Schaden raushauen. Jetzt nehme man noch den Dornenpanzer dazu und jeder gegnerische ADC der dich in seinen Fokus nimmt kann garnicht so schnell gucken, wie ihm die Puste ausgeht. Man kombiniere außerdem sämtliche Fähigkeiten mit der Passiven und haue einfach nach jeder Fähigkeit einmal auf einen Champ oder Minion und auf gehts (kommt übrigens immer gut, wenn man als voll gepanzerter Taric einen gegnerischen ADC umlegt ohne ihn auch nur einmal berührt zu haben).\n\nAlso eigentlich ist es tatsächlich nicht schwer mit Taric zu spielen, ist halt Gewohnheitssache. Ich hätte zum Beispiel mit Katarina oder Master Yi eher Probleme. Ich weiss, für einige ist das unvorstellbar, wie man mit solchen angeblichen \"noobchamps\" nicht klarkommen kann, aber ich bin auch hauptsächlich Supporter. Ich bin daher nicht auf Kills aus, wie so mancher ADC, sondern darauf, dass mein Team vorwärts kommt.","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T21:04:00.274+0000","up_votes":2,"down_votes":0,"body":"Es geht nicht darum, dass er zu schwach oder zu stark ist. Es geht um sein veraltetes Kit.","replies":[]}]},{"poster":"Allisrem2","date":"2015-12-15T20:31:32.920+0000","up_votes":2,"down_votes":0,"body":"Bei den Reworks gehts nicht darum, unbeliebte Champions zu reworken, sondern Champions die einfach nicht mehr ins Game passen.\nBei Sion war der Point to Click stunn fehl am Platz.\nBei Poppy wars die Ulti.\nBei Taric die E, und dass er sonst so eine passive Rolle einnimmt.","replies":[{"poster":"Samuraisub","date":"2015-12-15T21:16:01.216+0000","up_votes":1,"down_votes":0,"body":"Hmm was war eig. bei {{champion:114}} fehl am Platz. Ihr Kit war nicht schlecht und sie war auch sehr stark und auch nicht unbeliebt. Sie war sogar recht neu.","replies":[{"poster":"Allisrem2","date":"2015-12-15T22:05:51.611+0000","up_votes":1,"down_votes":0,"body":"Keine Countermechaniken, eig einfach nur Master Yi 2.0. Langweilige Fähigkeiten, Langweiliges Kit. Entweder totally useless, oder totaler Snowball. Point to click action.\nDeshalb gibts auch Änderungen wie zB dass Veigars Q zum Skillshot wurde. Man will definitiv in die Richtung gehen.","replies":[]},{"poster":"Schesam","date":"2015-12-15T21:17:46.550+0000","up_votes":1,"down_votes":0,"body":"Sie haben sie totgenerfed, da die Ulti zu krass war. ICh war mit der alten Fiora one-trick pony, hat echt Spaß gemacht :D","replies":[]}]}]},{"poster":"Hannibal L3ctor","date":"2015-12-15T17:34:31.121+0000","up_votes":2,"down_votes":0,"body":"Bei einem Rework geht es nicht nur im seltenheitswert eines Helden sondern auch ob dieser überhaupt in eine Teamkombination passt und irgendwie in eine Meta passt. Genauso geht es um sein Spielwert, und da Lol ein dynamisches Spiel ist werden natürlich auch mal alte Helden verändert.","replies":[]},{"poster":"CCG Juuzou","date":"2015-12-15T16:20:04.939+0000","up_votes":1,"down_votes":0,"body":"Alsooooo das nächste Rework wird so wie es aussieht erstmal Akali bekommen. Taric steht aber auf Platz 1 der großen Reworks.","replies":[{"poster":"Schesam","date":"2015-12-15T21:10:55.730+0000","up_votes":1,"down_votes":0,"body":"https://support.riotgames.com/hc/de/articles/202294884-Champion-Update-Schedule\n\nTaric und shen sind dran","replies":[]},{"poster":"A Dragons Heart","date":"2015-12-15T21:04:42.621+0000","up_votes":1,"down_votes":0,"body":"Kriegt Akali ein kleines ?","replies":[]}]},{"poster":"Eldit","date":"2015-12-15T21:08:20.895+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch total für ein Rework für Taric. Steht aber auch auf dem Plan. :)","replies":[]},{"poster":"Slaish","date":"2015-12-15T20:28:36.514+0000","up_votes":1,"down_votes":0,"body":"> Mal gerade noch so nebenbei; warum reworked Riot Champions, die zwar wenig gespielt werde, aber trotzdem von einigen wenigen sehr gerne gespielt werden? Ich als Taric Main w&auml;re nicht gerade &uuml;ber ein Rework erfreut wenn es passieren w&uuml;rde {{item:3070}} {{champion:44}}\n\n\n*lol* Er sagt doch das es Taric gut tut, wenn er einen rework bekommt! Frage wurde von dir selbst beantwortet 100 Punkte!","replies":[{"poster":"A Dragons Heart","date":"2015-12-15T21:03:10.129+0000","up_votes":1,"down_votes":0,"body":"?","replies":[]}]}]}