{"poster":"Prodlax","date":"2017-03-13T11:36:06.540+0000","title":"5 people DC at the same time in my game. No loss prevented, lost 18 lp.","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Prodlax / Bronze 1 64LP / 82W 76L Win Ratio 52% / Hecarim - 61W 53L Win Ratio 54%, Graves - 10W 9L Win Ratio 53%, Soraka - 5W 3L Win Ratio 63%, Amumu - 3W 3L Win Ratio 50%, Zac - 0W 3L Win Ratio 0%","url":"https://na.op.gg/summoner/userName=Prodlax","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":11,"down_votes":1,"body":"Hi, so there was a game just now, where 5 people (3 on on my side, 2 on enemy side DC's at the SAME TIME.) This does not seem like an issue on our ends, so something happened. Our teammates, in addition to losing LP, got leaverbuster, despite \"not letting [him] recconect to the game\". I was wondering if you guys can at least give us a loss prevented for that game, and refund our lp and remove the leaverbuster our teammates and the enemy got. I would send you the replay, but idk how","replies":[{"poster":"Broporo","date":"2017-03-13T23:02:02.859+0000","up_votes":1,"down_votes":0,"body":"Thanks for bringing this to our attention! We've made an official post where you can keep updated on these disconnection issues, which you can see [**here**](http://boards.na.leagueoflegends.com/en/c/help-support/3Lmbjp8Y-3132017-na-server-issues). \n\nRest assured that we're doing everything we can to straighten out this issue!","replies":[{"poster":"SwainLaneWinGame","date":"2017-03-13T23:37:04.940+0000","up_votes":2,"down_votes":1,"body":"It's great you are aware of and have mostly fixed the connection issues; but what are you doing about compensating the hundreds or even thousands of players that have lost LP, promos, etc? The problem persisted now for about 12 hours -- the whole day -- and not once was loss prevention enabled. Where is the compensation for those of us who had our time and efforts wasted and lost a lot of ranked game progress due to an error on your end?","replies":[{"poster":"Tactical Poro","date":"2017-03-14T00:37:37.744+0000","up_votes":1,"down_votes":2,"body":"Your copy/pasted reply to all these posts are ridiculous. You go out of you way to talk about those affected, while implying yourself as well. Yet you have zero balls to comment from an account that is actually playing the game today. Band wagon hippy fishing for up votes. Clearly they know and have issued a fix and looking to further examine the impact this situation has given rise too. Take this down vote and go on your way.","replies":[{"poster":"SwainLaneWinGame","date":"2017-03-14T00:54:59.015+0000","up_votes":1,"down_votes":1,"body":"Huh? I've posted from both my accounts, including the one affected. But thanks for your erroneous judgment. Go back into the darkness, poor aggravated soul.","replies":[{"poster":"Tactical Poro","date":"2017-03-14T01:19:32.399+0000","up_votes":1,"down_votes":1,"body":"So you feel as though **spamming** a company that was/is aware of the situation and working to actively fix it's free game for your convenience is the best course of action? It's  frankly disgusting and unnecessary childlike behavior. Of which a person of your sort will probably flip this right back on to this post, but to which deaf ears will fall.","replies":[{"poster":"SwainLaneWinGame","date":"2017-03-14T02:48:16.975+0000","up_votes":2,"down_votes":1,"body":"I've looked into your posting record; you only seem concerned with being contradictory toward any poster/player that is negative or contrary to Riot and League issues, irregardless of the content or concern; this being no exception.\n\nYes, I do believe spamming my comment to Riot in all these posts is the best course of action, since it's sometimes the only way to get their attention (which I now have).\n\nIs your best course of action only being contrary to anyone that questions Riot?","replies":[]}]}]}]}]}]},{"poster":"Dnykato","date":"2017-03-13T21:29:05.926+0000","up_votes":1,"down_votes":0,"body":"9 people disconnected from my game. First game of my series. Marked as a leaver, and a loss. My entire team, and 4 enemy team disconnect. 1 left to freely push after defending. the Replay is cringy.","replies":[]},{"poster":"Malystrix","date":"2017-03-13T12:31:25.858+0000","up_votes":1,"down_votes":0,"body":"Just had something similar happen, 2 dcs on the other team and 3 on ours right from the beginning of the game. No shaco on either team.","replies":[]},{"poster":"Mr Capt Planet","date":"2017-03-13T11:50:14.598+0000","up_votes":1,"down_votes":0,"body":"Yup same thing happened to me. apparent its because of shaco","replies":[]},{"poster":"NvestmentPlanker","date":"2017-03-13T11:38:46.922+0000","up_votes":1,"down_votes":0,"body":"yep just had this happen to me twice in a row. lost LP","replies":[]}]}