{"poster":"Cloudy Phoenix","date":"2017-07-26T11:29:21.830+0000","title":"Vote Kick","subforum":"Client Diskussion","up_votes":1,"down_votes":5,"body":"Hey liebe Community!\n\nIch habe in letzter Zeit ein wenig viel LoL gespielt. In der Zeit wo ich gespielt habe, habe ich auch mit Trollern zusammengespielt.\nIch kam in die Champions-Auswahl und der Troller wollte Urgot spielen. Dann bannte ein Team-Mitglied Urgot und er sagte, er w&uuml;rde trollen. Nun, er war jetzt Ziggs mit Ignite, Top-Lane und spammte weiter. Ich bin dann einfach aus der Auswahl geleaved, denn ich habe auf sowas keine Lust.\n\nIch habe eine Idee: In der Auswahl k&ouml;nnte es doch eine Vote-Kick Funktion geben, um diese Leute aus der Auswahl zu kicken, und die Runde abzubrechen.\nDieser w&uuml;rde dann eine Sperre und Warnung bekommen.\n\nDas w&uuml;rde vielleicht etwas helfen. :D\n\nDanke, dass ihr euch meinen Beitrag durchgelesen habt!\n\nMFG,\nFabian\n\nEdit: Es war häufig Ranked.","replies":[{"poster":"Shacoláde","date":"2017-07-26T11:53:04.203+0000","up_votes":2,"down_votes":0,"body":"Brauchen nichmal Premades sein... wenn jmd Off-Meta spielen will und es den anderen nicht gefällt, würde er auch rausfliegen, obwohl er eigentlich nichts falsches gemacht hätte. Bin ganz klar dagegen!","replies":[{"poster":"Uranbrennstab","date":"2017-07-27T08:47:51.856+0000","up_votes":1,"down_votes":1,"body":"Off-Meta spielen...  Nichts falsch gemacht.... Aha.","replies":[{"poster":"Shacoláde","date":"2017-07-27T09:19:59.128+0000","up_votes":1,"down_votes":0,"body":"Hängst du wirklich so an der Meta fest? Nur weil es andere nicht gefällt, heißt das nicht das man sich das Recht nehmen darf und die Leute dafür verurteilen sollte, geschweige sie denn aus der CS raus zu voten...\nDann würd ich persönlich in gar kein game mehr joinen können.","replies":[{"poster":"Uranbrennstab","date":"2017-07-27T09:41:26.654+0000","up_votes":1,"down_votes":0,"body":"Für Ranked ja. Im Normal ist es mir tatsächlich egal. Wer aber \"mal was anderes\" spielt, oder mal \"was versuchen will, in einem Ranglistenspiel wird von mir reported, auch wenn es nichts bringt. Innerlich hab ich dann wenigstens ein bisschen Zufriedenheit. \nDenn ich gestehe den Gold Spielern nicht zu, dass sie in der Lage sind neue Taktiken oder Picks zu entwickeln, dafür verstehen Sie das Spiel zu wenig,  sonst wären sie nicht Gold.","replies":[{"poster":"Shacoláde","date":"2017-07-27T10:17:42.685+0000","up_votes":1,"down_votes":0,"body":"Shaco ist jetzt auch keine Meta-Pick und hab mich damit von Gold auf Platin gespielt. Deines erachtens hätte ich dann nen \"Bann\" verdient? Wo hört denn bei dir Meta auf und fängt Off-Meta an?  \nFinds echt schade das du hier ein Schwar-Weiß-Denken hast :(\nWillst du wirklich wissen, welche Taktik die Beste hat und wer wann wie zu spielen hat und falls er das nicht hat soll er gebannt werden, da es dir nicht gefällt?\nKein Ahnung... das spricht wohl echt schön viel Trotz aus dir.","replies":[{"poster":"Uranbrennstab","date":"2017-07-27T10:29:29.760+0000","up_votes":1,"down_votes":0,"body":"Wenn du einen Champion spielst, der nicht für diese Position designt ist, ist das für mich Off Meta. Wenn erwiesen wurde, von Menschen die das Spiel verstehen und wissen warum sie was und wie tun, dass es möglich ist diesen Champion erfolgreich auf einer nicht dafür gedachten Position zu spielen, bin ich bereit darüber hinwegsehen, im Falle eines Sieges.\n\nWarum ich so trotzig bin?  Ich kann vielleicht 3-5 Spiele pro Tag spielen und ich hasse verlieren mehr, als mir gewinnen Spaß macht.  Wenn ich jetzt also einen Spielmodus Spiele, in dem es darum geht zu gewinnen und in einer Rangliste aufzusteigen, dann stiehlt mir der Off Meta Spieler, welcher sich denkt AD Lux Toplane ist eine gute Idee (nur als Beispiel) effektiv meine Zeit. Er verliert bzw erschwert mir mit Absicht mein Spiel, obwohl es dafür abseits von \"ich spiele aus Spaß Rangliste\"  keinen Grund gibt. Und ich will dass die Leute spielen um zu gewinnen und nicht aus Spaß. \n\nDa ich aber durchaus weiß, dass diese Einstellung nicht auf jeden zutrifft und das auch gut so ist werden meine Reports im Sand verlaufen und ich mich weiter in den Schlaf weinen. C’est la vie.","replies":[{"poster":"Shacoláde","date":"2017-07-27T10:51:37.585+0000","up_votes":1,"down_votes":0,"body":"Dein Name schein wirklich Programm zu sein ^^\nIch kann verstehen, dass dich nervt, wenn Leute ein Rankedgame aus Jux und Tolerei spielen und damit nicht viel zum Game beitragen. Jedoch gibt es zwischen \"nicht hilfreich sein\" und \"Off-Meta\" picks.\nSo nur als Beispeil: Habe Jinx Jungle gespielt\n                                 LuLu Hybrid Jungle \n                                Shaco Supp\n                                Gragas Supp\n\nDesöftern wurde ich vorher \"ebenfalls deswegen angegangen\". Nachdem ich die ersten Teamfight´s gewinnbringend untersützt habe, hat keiner mehr was gesagt. Aber als die Syndra Mitte 0/5 stand gingen sie auf diese los.\nJa, ich kann verstehen, dass viele skeptisch sind. Aber anstantt immer gleich los zu heulen, wäre es desöftern angebracht zuerst mal abzuwarten als den \"Banhammer\" wieder zu schwingen.","replies":[{"poster":"Uranbrennstab","date":"2017-07-27T11:05:18.469+0000","up_votes":1,"down_votes":0,"body":"Ich sehe den Zusammenhang zwischen meinem Namen und Aussagen zwar nicht zu 100% kann mir aber vorstellen, dass es eine verstecke Andeutung auf Toxicity sein soll, in diesem Falle: Lol. \n\nJa es kann sein, dass es funktioniert, aber die Wahrscheinlichkeit dafür ist geringer, als für einen Meta Pick. Und deswegen will ich nicht noch mehr Risiko auf mich nehmen das Spiel zu verlieren als nötig.","replies":[]}]}]}]}]}]}]}]},{"poster":"Cloudy Phoenix","date":"2017-07-26T13:59:52.392+0000","up_votes":1,"down_votes":0,"body":"Ok danke, für eure Antworten!","replies":[]},{"poster":"Fresh Dumbeldore","date":"2017-07-26T11:40:25.971+0000","up_votes":1,"down_votes":0,"body":"Aber was wäre, wenn z.B. es 3 oder 4 Premades wären, die diese Funktion ausnützen würden, um absichtlich Leuten ihre LP zu versauen und dazu noch ein Strafe aufzwingen? \n\nUnd Premades ausschliessen kannst du auch nicht, denn nur ein kleiner Teil ist so und so würde man alle anderen Strafen, da man so die wirklichen Trolle gar nicht kicken könnte also wäre es unnötig.\n\nedit: \n> ein wenig viel LoL gespielt\n\n:P","replies":[]},{"poster":"Homunculi","date":"2017-07-26T11:37:41.922+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\ndie Idee gab es schon des öfteren hier im Forum.\n\nEs mag fürs erste gut klingen, kann und wird wahrscheinlich abused werden. Als Beispiel: einem vier Mann Premade Team gefällt der Random nicht oder will sich einen Scherz erlauben, votiert für einen Kick des Random und dieser bekommt ohne etwas getan zu haben eine Strafe ... Nicht im Sinne des Erfinders, oder?\n\nOder der \"Troll\" ist mit einem anderen Premade, dieser votiert für nein weswegen es wohl mindestens eine Gegenstimme von vier sein werden (wie viel für \"Ja\" votieren müssen damit gekickt und abgebrochen wird hast du ja jetzt nicht erläutert) und es somit nicht zum Abbruch der CS kommt.","replies":[]}]}