{"poster":"Kyo1996","date":"2016-01-02T03:53:03.852+0000","title":"Jugadores no tan buenos","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Bueno ultimamente no se que esta pasando ya que en las partidas han aparecido trollers, afk, y gente muy mala queriendo perder las partidas a proposito lo cual me parece muy malo bueno soy bronze 3 pero por lo mismo no puedo subir la gente en esta liga es sumamente mala sin ofender o no tienen intencion de ganar o solo trollean o se desconectan de la partida la cual no entiendo para finalizar este post que es mi primero nose como se finaliza pero bueno bye bye.","replies":[{"poster":"asdf1423","date":"2016-01-06T02:58:04.148+0000","up_votes":1,"down_votes":0,"body":"Juegas Ranked a diestra y siniestra, juega normales y practica.... A todos nos costó (a mi todavia me cuesta) hacer un last hit a los minions.... eso es lo escencial... si farmeas bien tendras mas oro, si tienes mas oro podras comprar objetos mas rapido, si tienes objetos podras hacecr kills....\nuna vez me enseñaron que 1 kill = a 10 minions.... \nsolo depende de ti si quieres ser un seguidor Solo de kills o un jugador que realmente sabe como jugar... saludos y exito en los campos de la justicia :v","replies":[]},{"poster":"Waninoko Main","date":"2016-01-02T21:48:00.288+0000","up_votes":1,"down_votes":0,"body":"Pues aprovecha cuando los jugadores malos están en el otro equipo, si no puedes subir ni bajar es porque estás en tu elo.","replies":[{"poster":"Waninoko Main","date":"2016-01-02T21:50:36.227+0000","up_votes":1,"down_votes":0,"body":"acabo de revisar tu historial y no es culpa de tu elo ni de tus compañeros o rivales, solo veo que tu farm no es precisamente el mejor","replies":[]}]},{"poster":"matifield","date":"2016-01-02T05:18:37.651+0000","up_votes":1,"down_votes":0,"body":"El único consejo que te puedo dar es que intentes buscar algun compañero que juegue con vos las rankeds, asi ya estas seguro que 1 más de tu equipo no va a trollear.\nSuerte y salu2","replies":[]},{"poster":"Kyo1996","date":"2016-01-02T03:54:14.725+0000","up_votes":1,"down_votes":0,"body":"es mi primer nose como se llama esta cosa no me critiquen mucho por hacer el comentario mal :,V perdonen por no saber como se hace :v","replies":[]}]}