{"poster":"Mare TV","date":"2019-01-23T19:15:31.886+0000","title":"Plötzliche Einbrüche der FPS freezen ganz kurz das Bild","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi Community,\r\n\r\nich habe wie schon im Titel zu lesen ist Probleme mit meinen FPS.\r\nEs passiert &quot;mal&quot;, dass ich pl&ouml;tzlich von 350 FPS z.B. auf 0 FPS droppe und dann geht es wieder zur&uuml;ck auf 100,180,270,350.. etc., aber leider freezed dadurch mein Bild ganz kurz was bei Teamfight oder gegnerischen Ganks sehr nervig ist.\r\nDer Ping ist super und zeigt kein leiden, bewegt sich brav zwischen 20ms und 30ms.\r\n\r\nHabe geh&ouml;rt Tempdateien l&ouml;schen, Antialiasing ausschalten, Schatten weg machen, Grafikkartentreiber aktualisieren..., habe das Probiert aber dennoch habe ich das Problem. {{champion:32}} \r\n\r\nPCDaten:\r\nGTX 1080 8GB\r\n32RAM\r\nRoG Maiboard\r\nK&uuml;hler, Netzteil, Geh&auml;use je von bequiet als PRO.\r\n\r\nHat einer von euch erfahrung mit solchen pl&ouml;tzlichen FPS drops und eine L&ouml;sung gefunden bzw. hat jemand eine Vermutung woran es liegen kann?\r\n( Ist nur bei League Of Legends der Fall )\r\n\r\nDachte ich frage lieber hier nach, bevor ich LoL runterschmei&szlig;e und neu aufsetze.\r\n\r\nDanke im Voraus","replies":[{"poster":"Danuvios","date":"2019-01-28T10:20:45.699+0000","up_votes":1,"down_votes":0,"body":"Ist bei mir genauso!\nSeit ca. 2-3 Wochen habe ich heftige FPS Einbrüche (geht runter auf 12) für ca. 2-4 Minuten in jedem Spiel, danach läuft das Spiel wieder flüssig weiter als wäre nichts gewesen.\nEs klagen mittlerweile einige Spieler (auch international) über diese Einbrüche und jeder beschreibt das gleiche Phänomen.\nIch traue mich momentan nur ARAM und kein Ranked zu spielen, denn gerade zu Beginn des Spiels (ab Minute 6 oder ab Minute 10) ist das Spiel für ca. 2-4 Minuten unspielbar.\nAnwendungen laufen im Hintergrund keine und Einstellungen habe ich wie überall beschrieben vorgenommen.","replies":[]},{"poster":"Kokainkonsument","date":"2019-01-24T15:58:23.177+0000","up_votes":1,"down_votes":0,"body":"Lies mal hier: https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/Or7aV3UN-input-lags-game-aktuell-unspielbar\n\nDiese \"Wrenchmens\" leiten dich zu Troubleshooting Guides die nix bringen oder sie antworten erst gar nicht.\nHabe den gleichen Scheiß...","replies":[]},{"poster":"Yatsuki","date":"2019-01-23T21:33:46.241+0000","up_votes":1,"down_votes":0,"body":"Hey Mare TV,\n\narbeite dich mal hier und durch die Knowledge Base durch :)\n> \n> *   Manche Computer/Notebooks besitzen eine zusätzliche Grafikkarte welche direkt im Prozessor verbaut ist. Es kann sein, dass dein System diese anstatt der Richtigen nutzt und du daher niedrige FPS hast. Schau am Besten einfach in den Gerätemanager ob dort unter **Grafikkarte** mehrere aufgeführt sind. Falls ja, kannst du die interne Karte einfach mal deaktivieren. Meist beginnt der Name solcher Karten mit **Intel HD**.\n> *   Wenn du **Windows 10** verwendest, stelle sicher, dass [GameDVR deaktiviert](http://support.xbox.com/de-DE/xbox-on-windows/social/record-game-clips-game-dvr-windows-10#160cb39808a54d38acdc54c564943140) ist.\n> *   Aktiviere im Client die Option “**Client während eines Games schließen**”.\n> *   **Hinweis**: Da der Client nach jedem Game wieder gestartet werden muss, dauert es länger bis du in die Lobby kommst.\n> *   Weitere Lösungen findest du in der [Knowledge Base](https://support.riotgames.com/hc/de/articles/115005102387-Niedrige-Bildwiederholrate-Lags-)\n\nWenn danach das Problem noch besteht, melde dich mit der Antworten- Funktion bei mir :)\n\nGruß Yatsuki","replies":[]}]}