{"poster":"Camouflaqe","date":"2018-06-30T07:31:45.539+0000","title":"Problema con il client e ad entrare in partita","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Da ieri non riesco ad entrare in partita{{sticker:slayer-jinx-unamused}} .\r\nDopo la scelta dei campioni, quando si dovrebbe visualizzare la schermata del caricamento, mi riporta al client dove c'è l'opzione \"riconnetti\". Dopo 3 tentativi si è verificato lo stesso errore, così ho mandato un ticket. Dopo 5 ore ho riprovato a giocare ma mi ha dato lo stesso problema quindi ho mandato un nuovo ticket. Nessuno ancora ha risposto ai 2 ticket mandati.\r\nOggi ho riscaricato il gioco ma il client non mi ha fatto installare la patch, dice: \"Impossibile installare la patch per motivi sconosciuti. Riavvia il client per riprovare a installare la patch. (Codice errore 004)\", ho riavviato il client ma niente, non mi installa la patch quindi ho mandato un nuovo ticket. Adesso non so proprio cosa fare se non scrivere qui sul forum sperando che qualcuno mi dia una mano.\r\n\r\nPs: Ieri dopo aver scaricato ed installato l'aggiornamento, il mio antivirus ha messo in quarantena un file di LoL e da allora il gioco mi da problemi.","replies":[{"poster":"Naiden750","date":"2019-12-26T20:00:03.129+0000","up_votes":1,"down_votes":0,"body":"Sono entrato anche io in questo fantastico loop infinito...alla fine come avete risolto?","replies":[]},{"poster":"im ur mummy","date":"2018-06-30T14:41:33.678+0000","up_votes":1,"down_votes":0,"body":"Disinstalla avira","replies":[{"poster":"Camouflaqe","date":"2018-06-30T18:10:44.974+0000","up_votes":1,"down_votes":0,"body":"L'ho appena fatto ora vedo se LoL funziona. Grazie per il consiglio. :)","replies":[{"poster":"im ur mummy","date":"2018-06-30T21:50:46.378+0000","up_votes":1,"down_votes":0,"body":"Poi rimettilo però eh xD","replies":[]}]}]},{"poster":"ReyZør","date":"2018-06-30T16:38:27.298+0000","up_votes":1,"down_votes":0,"body":"Ripristina il file \"infetto\" dalla quarantena e disattiva la protezione in real time di Avira","replies":[{"poster":"Camouflaqe","date":"2018-06-30T18:10:03.186+0000","up_votes":1,"down_votes":0,"body":"Ho disinstallato direttamente Avira, mi son messo Nod32. ;)","replies":[]}]},{"poster":"Freddy89","date":"2018-06-30T14:50:25.088+0000","up_votes":1,"down_votes":0,"body":"stesso problema.. ho provato di tutto! riparazioni varie, reinstallare lol, seguire vari tipi di risoluzione problemi ma niente.. o aspetto di vedere che combinano, oppure smetto di giocare a lol definitivamente!","replies":[]},{"poster":"Giino7","date":"2018-06-30T09:17:35.308+0000","up_votes":1,"down_votes":0,"body":"io non riesco più neanche accedere al client","replies":[]},{"poster":"TheConte","date":"2018-06-30T07:39:17.943+0000","up_votes":1,"down_votes":0,"body":"Mi succede la stessa cosa e mi son beccato anche un bel ban che bello..","replies":[{"poster":"Camouflaqe","date":"2018-06-30T07:45:05.420+0000","up_votes":1,"down_votes":0,"body":"Per fortuna a me non me l'hanno dato il ban, però ho rischiato anche io di riceverlo. Comunque il problema è della riot non nostro, dal momento che lo ha causato la nuova patch probabilmente.","replies":[]}]}]}