{"poster":"KoT MyPoo UrFace","date":"2019-07-25T17:15:53.039+0000","title":"TFT 3 Sterne 3 Items Mission buggt","subforum":"Teamfight Tactics","up_votes":3,"down_votes":0,"body":"Sie wird halt einfach nicht anerkannt, obwohl ich sie geschafft habe. Wohl ein Problem, das recht üblich ist.\r\nWenn jemand sie geschafft hat, kommentiert gerne.\r\n\r\nAnsonste können sich ja auch gerne andere melden ums zu bestätigen dass es nicht funktioniert.\r\n\r\nMfG","replies":[{"poster":"Raystlin82","date":"2019-07-27T02:25:25.631+0000","up_votes":1,"down_votes":0,"body":"also ich hab schon alle belohnungen, kann aber trotzdem weiter missionen machen und punkte sammeln, die norgendwohin gehen.\n\nmanchmal werden missionen nicht sofort anerkannt, es dauert einfach bis die spiele ausgewertet werden - steht dann auch da: \"x ausstehende spiele\".","replies":[]},{"poster":"La Revenante","date":"2019-07-26T11:07:03.879+0000","up_votes":1,"down_votes":0,"body":"**PROBLEM IST GELÖST!** Das ist kein Bug, ich habe beim zweiten Anlauf 6 gesammelte Items alle nacheinander direkt auf dem 3er-Champ kombiniert. Man darf sie also nur nicht schon vorher auf einem anderen zusammenbauen und dann übertragen.","replies":[]},{"poster":"xXENERGIEGAMERXx","date":"2019-07-26T10:44:37.188+0000","up_votes":1,"down_votes":0,"body":"Der Bug muss wohl neu sein habe es vor 2 oder 3 Tagen die Aufgabe fertig.","replies":[]},{"poster":"La Revenante","date":"2019-07-26T08:54:22.414+0000","up_votes":1,"down_votes":0,"body":"Ich habe das Problem auch und wollte gerade hier im Forum mal nachfragen, ob ich alles richtig gemacht habe. Ich hatte vorhin eine 3-Sterne-Elise und diese mit drei bereits kombinierten Items eines anderen Champs ausgestattet. Wurde nicht als erledigte Mission gezählt. Ist es tatsächlich ein Bug oder habe ich den Fehler gemacht, die Items nicht direkt auf Elise zu kombinieren? Das scheint mir offenbar der Fehler zu sein, wenn ich das hier so lese.\nDie könnten die Missionsbeschreibungen echt mal genauer formulieren, zuvor gab es auch schon eine, die viele nicht kapiert hatten, die mit den 20 Gold in einer Phase.","replies":[]},{"poster":"Izaya Kumiho","date":"2019-07-25T19:49:49.930+0000","up_votes":1,"down_votes":0,"body":"ich war so paranoid, ich hatte 3 champs auf lv 3, davon einen mit 3 vollen items, einen mit 2 und 'n halbes und einen mit nur 'n halbes item.\n\njedoch wurde mir - warum auch immer 3/1 am ende der quest angezeigt.\n\n...das war auch der augenblick, wo ich erst die anzahl der champions gecheckt hatte, die die quest von mir verlangte.","replies":[]},{"poster":"Megamaexx","date":"2019-07-25T19:17:45.940+0000","up_votes":1,"down_votes":0,"body":"Bei mir war die Quest auch nicht bugfrei. Hatte nen Level 2 Volibear, der 3 Items hatte. Als ich dann einen Level 3 Warwick komplett hatte, habe ich 3 andere vollständige Items auf den gepackt und es wurde nicht anerkannt.","replies":[]},{"poster":"KoT MyPoo UrFace","date":"2019-07-25T18:11:36.741+0000","up_votes":1,"down_votes":0,"body":"Auf Ihm als Gold drauf kombiniert, oder als fertige Gegenstände raufgelegt oder vorher draufgewesen?^^\n\nNaja ich mach grad next try..^^\n\nPS: Bei mir hats nun beim 2ten Versuch geklappt. Bei diesem Versuch, wo es geklappt hat, habe ich erst als der Graves golden war, alle 3 Items einzelnd auf ihm zusammengebaut.\n\nMfG","replies":[]},{"poster":"Amycos Cyrus","date":"2019-07-25T17:45:04.132+0000","up_votes":1,"down_votes":0,"body":"Ich habe sie auf Anhieb geschafft.","replies":[]}]}