{"poster":"VenganceZ","date":"2019-09-11T02:39:54.089+0000","title":"¿Por qué no mejor nerfean a veigar?","subforum":"Charlas Generales","up_votes":5,"down_votes":24,"body":"En la selección de nerfeos para este parche, los ya conocidos akali, Aatrox e irelia, cuando hay champs como veigar que llega a tener 3000 de ap al minuto 30 que en Elo bajo es free win y que siempre se llega al minuto 25.\r\nDejen de nerfear champs que son complejos y empiecen a nerfear champs para nenes de 9 años, no es justo que alguien que se esmera en mejorar con champs con algo de dificultad se vea superado por una r con patas, por qué no nerfean a Tristán? Que se está usando de top y de mid, no, mejor no, porque es un champ lindo para que se vea en el mundial, entonces no.\r\nIndignado, mejor empiezo a jugar veigar o Tristán a ver si los nerfean","replies":[{"poster":"Shirotani","date":"2019-09-11T03:09:30.485+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=VenganceZ,realm=LAS,application-id=v7qsfXsE,discussion-id=u8uGbfEg,comment-id=,timestamp=2019-09-11T02:39:54.089+0000)\n>\n> Indignado, mejor empiezo a jugar veigar o Tristán a ver si los nerfean\n\nPues deberías, así subís algo, ya que son \"free win\".","replies":[{"poster":"VenganceZ","date":"2019-09-11T03:15:52.933+0000","up_votes":2,"down_votes":5,"body":"Ya, es como Annie, son free win pero no deberían de ser free win, ningún champ debería ser free win","replies":[{"poster":"Hell Darking","date":"2019-09-11T03:22:14.525+0000","up_votes":4,"down_votes":0,"body":"los champs free win son para ciertos elos, no para todos.. aprovechate del free to win de turno y escala asi","replies":[{"poster":"VenganceZ","date":"2019-09-11T03:29:05.652+0000","up_votes":2,"down_votes":3,"body":"La idea es mejorar como jugador no subir rápido y quedarme estancado en una liga que no es la mía por haberme aprovechado de un free win. Yo no juego para subir, juego para mejorar, que es más lento pero es mejor","replies":[{"poster":"Hell Darking","date":"2019-09-11T03:37:13.229+0000","up_votes":7,"down_votes":0,"body":"entonces no tiene sentido quee te quejes, si juegas para mejorar.. te encontradas con todo tipo de cosas durante el camino\ntu llegaras mas lejos mientras que los free to win quedaran estancados","replies":[{"poster":"VenganceZ","date":"2019-09-11T03:39:28.389+0000","up_votes":2,"down_votes":6,"body":"Quiero llegar lejos con champs divertidos y no se puede si me los bajan a nerfeasos","replies":[{"poster":"PewD","date":"2019-09-12T22:01:52.036+0000","up_votes":1,"down_votes":0,"body":"Man, te das cuenta de que tus \"champs divertidos\" como Aatrox y Akali son los más rotos del juego por lo que tienen que nerfearlos? (Akali por ejemplo tiene 2 dash en la E, 2 dash en la R, ejecución en la segunda R, invisibilidad por más de 5 segundos y una Q que ralentiza, además de escalados dobles por lo que sus builds pueden variar y le da mucha más versatilidad que un champ full AP, aparte del daño tiene movilidad). \nLa mayoría que veo comentando este thread y dicen \"Sí sí, está re roto\" no pasan ni de oro 1, no tienen ni la mas minima idea de como va el juego, y apenas tienen idea de como se utilizan SUS mains. En vez de postear boludeces como \"nerfeen veigar y tristana\" mejor aprende a jugar, o aprende a utilizar macro para subir, por ejemplo counterpickea al veigar, o jugale agresivo al veigar cuando no te puede tirar skillshots, o esquiva las skill shots del veigar, hay tantas cosas que podes hacer en vez de hablar boludeces.","replies":[]}]}]}]}]}]}]},{"poster":"e aa wq","date":"2019-09-11T03:58:53.071+0000","up_votes":5,"down_votes":1,"body":"Lo unico que me jode de {{champion:45}} es la E asquerosa _**que ni siquiera hay que apuntarla**_.","replies":[{"poster":"TvTLucio22","date":"2019-09-11T04:18:43.619+0000","up_votes":1,"down_votes":3,"body":"O sea, lo groso es meter la e lvl 2 cuando llegas a lvl 4, ya que aumenta el tiempo de stun, pero en si tiene tiempo de casteo, una señal clara para el enemigo verla y te obliga a quedarte quieto, so... \n\nAdemás me parece bien que sea un tanto fuerte, siendo que es el único cc que tiene","replies":[{"poster":"e aa wq","date":"2019-09-11T04:58:08.593+0000","up_votes":1,"down_votes":3,"body":"Justamente lo que me molesta es que sea un cc fuerte (no por la duracion del stun, sino porque te obliga a quedarte dentro del circulo) _**y no requiere habilidad**_.\n\nSi no tenes muchisima tenacidad, algun tipo de blink ({{summoner:4}} {{champion:81}} {{champion:55}}), inmunidad al cc ({{champion:2}}) o alguna forma de ser intargeteable ({{champion:105}} {{champion:8}}), solamente podes quedarte quieto dentro de la jaula y ver como {{champion:45}} y sus aliados te matan sin que puedas hacer nada para escapar.","replies":[{"poster":"TvTLucio22","date":"2019-09-11T06:15:37.328+0000","up_votes":1,"down_votes":0,"body":"...\n\nWelp, siempre está la opción de tirarle hasta los zapatos a veigar, esperando que se muera...\n\nPor otro lado, me he comido el stun con el charco de vladi... No se por que...\n\nO sea, veigar necesita ese hard cc, ya que no tiene ningún dash, blink ni nada parecido, además de tener una velocidad de movimiento bastante chota, por lo que sería su \"método de escape\"","replies":[{"poster":"e aa wq","date":"2019-09-11T06:46:49.255+0000","up_votes":1,"down_votes":0,"body":"Que raro, la W de {{champion:8}} deberia dejarte salir de la E de {{champion:45}} sin problemas.\n\n{{sticker:sg-zephyr}}","replies":[]},{"poster":"SamukaOP","date":"2019-09-11T16:15:29.284+0000","up_votes":1,"down_votes":1,"body":"Miren, alguien que piensa. Buena respuesta compañero","replies":[]}]},{"poster":"AzorAha","date":"2019-09-11T08:05:50.789+0000","up_votes":1,"down_votes":2,"body":"Con el de morgana, lux, Neko o zyra ni siquiera te puedes mover... \n\nLa cárcel de veigar al menos te da la posibilidad de flashear  o pelear y llevarte aunque sea a un enemigo a la tumba, en cuestion de stun es el que mas posibilidades te ofrece. \n\nY ni siquiera necesitas esos champ para ganarle con velkoz lo puedes stompear porque tiene mas rango y si llegas a meter tu combo+ la R esta fuera, si usas bien a velkoz el veigar jamás te stuneara y lo puedes pokear hasta el cansancio. \n\nEl Yasou también es bueno contra Veigar por su movilidad y con su muro puedes evitar la R, pero claro si lo sabes usar no como esos Yasou que se ven en bronce que juegan a lo tonto.","replies":[{"poster":"e aa wq","date":"2019-09-11T09:11:58.049+0000","up_votes":3,"down_votes":3,"body":"Los roots de {{champion:25}} {{champion:99}} {{champion:518}} {{champion:143}} tambien se pueden flashear, y tambien podes atacar aunque no te puedas mover. (_**Y requieren mas habilidad para acertarlas**_ que el stun de {{champion:45}})\n\nY si te referis a las definitivas, la R de {{champion:25}} se puede cancelar alejandote, la de {{champion:143}} podes caminar afuera y no recibis el knock-up, y la de {{champion:518}} tambien se puede evitar simplemente alejandote.\n\n¿La E de {{champion:45}}  se puede contrarrestar alejandote como las 3 habilidades anteriormente mencionadas? No. Sin contar que el CD de dichas definitivas es muchisimo mayor al del stun de {{champion:45}}.\n\n¿De que te sirve moverte dentro de la E de {{champion:45}} si de cualquier forma no podes salir?\n\nAunque te muevas dentro de la jaula, si viene el jungla o cualquier otro aliado de {{champion:45}} te van a pegar free y seguramente te maten _**sin ningun tipo de esfuerzo o habilidad.**_","replies":[]}]}]}]}]},{"poster":"Hell Darking","date":"2019-09-11T03:12:53.080+0000","up_votes":3,"down_votes":0,"body":"who the fuck is tristan?","replies":[{"poster":"VenganceZ","date":"2019-09-11T03:15:00.170+0000","up_votes":2,"down_votes":6,"body":"I mistake they name of champion ahr se hacía el inglés","replies":[]}]},{"poster":"King Arturo ","date":"2019-09-11T02:49:19.434+0000","up_votes":3,"down_votes":2,"body":"Es como tú dices, yo estaba jugando mucho Akali, es un campeon fuerte pero necesita manos y práctica al igual que Aatrox, lamentablemente Riot se pasa por los huevos esto y le quitan todo a Akali. Hoy jugué una partida con Tristana mid ya que está fuertisima por su manera de tirar Torres y por su escape con la w (nunca la juego) y salí 18-5-9 literal revente en mid. Fue partida fácil con un campeón rotisimo en mid al igual que veigar pero a Riot no le importa esto y nerfea de manera horrible a Akali. {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"ºßARDEROSº ","date":"2019-09-11T16:00:58.864+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=King Arturo ,realm=LAS,application-id=v7qsfXsE,discussion-id=u8uGbfEg,comment-id=0000,timestamp=2019-09-11T02:49:19.434+0000)\n>\n> Es como tú dices, yo estaba jugando mucho Akali, es un campeon fuerte pero necesita manos y práctica al igual que Aatrox, lamentablemente Riot se pasa por los huevos esto y le quitan todo a Akali. Hoy jugué una partida con Tristana mid ya que está fuertisima por su manera de tirar Torres y por su escape con la w (nunca la juego) y salí 18-5-9 literal revente en mid. Fue partida fácil con un campeón rotisimo en mid al igual que veigar pero a Riot no le importa esto y nerfea de manera horrible a Akali. {{sticker:slayer-jinx-unamused}}\n\nAATROX MANOS JJJJAJAJAJAJAJ","replies":[{"poster":"King Arturo ","date":"2019-09-11T16:32:46.117+0000","up_votes":1,"down_votes":0,"body":"Es difícil pegar las 3 y darles con el CC no es llegar y hacerlo el 90% de los jugadores no pueden hacer el combo bien. Tomando en cuenta eso sí se puede decir que es un champ que necesita manos. Saludos","replies":[{"poster":"Katastrofica","date":"2019-09-11T18:06:23.689+0000","up_votes":1,"down_votes":0,"body":"Puede que varíe de jugador a jugador, pero personalmente me acostumbre a los rangos de la Q después de probarlo una partida, no tiene tanto misterio tampoco...\n\nFuera de eso... ni siquiera es necesario pegar con la zona de crítico de la Q para hacer daño, si se te pegan spamea Q y pegas la segunda usando E y la tercera la pegas si o si","replies":[]}]}]}]},{"poster":"Shaquete Bonete","date":"2019-09-11T08:39:48.664+0000","up_votes":2,"down_votes":0,"body":"El único nerf que necesita Veigar es el de ARAM, nerfearon a un montón de campeones, pero la e de veigar sique descolocando todas las partidas de ese modo","replies":[]},{"poster":"StayInBronce","date":"2019-09-11T03:56:13.472+0000","up_votes":2,"down_votes":0,"body":"Annie broken?\nVeigar broken?\nTristana?\n\nWtf man... que son esas estadisticas papa","replies":[{"poster":"King Arturo ","date":"2019-09-11T22:10:50.093+0000","up_votes":1,"down_votes":0,"body":"Si men, Tristana mid está terriblemente fuerte hasta Faker la está jugando mid por lo mismo, le gana a casi todos los magos, menos a los asesinos de daños explosivos","replies":[]}]},{"poster":"diegoelkpogamer","date":"2019-09-11T19:04:52.019+0000","up_votes":2,"down_votes":1,"body":"Akali está rota y su argumento de \"necesita manos\" no lo va a cambiar. Te mata de una q, tiene 3 dashes y se hace intarjeteable\n\nVayan a llorar a las oficinas de riot mejor","replies":[]},{"poster":"qumladestructora","date":"2019-09-11T15:18:46.806+0000","up_votes":2,"down_votes":1,"body":"Concuerdo totalmente.\nAunque se han hablado muchas cosas, quiero resaltar un par.\nPrimero, Tristana si está rotisima, tanto en early como en late tiene la capacidad de reventar adcs como Xayah o Jhin, que requieren más habilidad para jugarlos y son más frágiles.\nNo sé, hay partidas en las que yo voy Xayah y llevo 2/0/0 y que caiga Tristana un nivel más bajo que yo y me deletee con la vida a más de la mitad me parece un insulto. No sé qué onda con su daño.\nDespués, Veigar está roto por su pasiva pero si a niveles bajos le denegas farmeo y tu jg te gankea bien, creo que se puede salvar.\nY Annie no está rota! Necesitas manos para jugarla y aguantar con una buena estadística hasta el late, si en early no te fue más o menos bien (me refiero a que no te gsnkearon veinte veces, porque la poca movilidad de Annie la hace vulnerable si está pusheando línea e incluso si está bajo torre contra cosas como Lee Sin) olvídate de ganar en late.\nNada, eso, gg isi mid.","replies":[]},{"poster":"Guardian Slayer","date":"2019-09-11T23:20:24.779+0000","up_votes":1,"down_votes":0,"body":"Mira no soy experto y ni tengo la habilidad como para decir algo pero digo mi opinión igual........para mí los campeones \"fáciles\" tienen habildades más simples que otras pero tenés que seguir sabiendo dónde posicionarse y cuando usar la habilidad por ejemplo no es lo mismo que tirarte lanzando todas las habilidades de una con Yi en una TF que esperar el momento adecuado y usarlo en el mejor momento en donde le sacas la mayor eficiencia,etc(el cual cuando , donde y qué lanzes depende del champ) o eso creo si mi opinión les parece mal o algún otra cosa pasenselo por ya saben dónde y listo :v.","replies":[]},{"poster":"Karom","date":"2019-09-11T21:40:49.233+0000","up_votes":1,"down_votes":0,"body":"y si se dejan de quejar y empiezan a buscar ustedes una solución? Veigar es un bicho sin movilidad, con un gank en early lo matan hasta bajo Torre, además de que no tiene nada de sustein, una Kata o un Zed se lo culean en early... pero bueno, sigan alargando partidas y sólo usando campeones de late.","replies":[]},{"poster":"kotobanashi","date":"2019-09-11T21:28:50.204+0000","up_votes":1,"down_votes":0,"body":"no te voy a calificar porq tengo paja de subir esta cuenta... pero veigar no esta roto, es lo mismo q digas q hay q nerfear a garen porq en elo bajo es freewin","replies":[]},{"poster":"Tenori Taiga","date":"2019-09-11T19:29:37.564+0000","up_votes":1,"down_votes":0,"body":"Veigar no estani mediante roto bro. Es un cono q tarda 20 minutos en ser relevante y cuyo unico cc es evitable. En lugar de pedir que lo nerfeen podrias pedir consejos para aprender a jugar contra el. No obstante, si pensas que esta roto te invito a q juegues 20 clasificatorias usando a Veigar Y mires q win rate o trata de llegar a elos altos para que compruebes que tan op esta veigar","replies":[]},{"poster":"Viro Q","date":"2019-09-11T19:13:36.405+0000","up_votes":1,"down_votes":0,"body":"Es muy mediocre que todavía haya gente que no notó que no existen personajes free win (nótese la cantidad de Main yi por hierro/bronce) y que todavía no entiendan que el progreso en el juego no es solamente aprenderte las mecánicas de un personaje, que por cierto, con pocas partidas (unas 20) y un poco de habilidad, ya las aprendiste casi en su mayoría.","replies":[]},{"poster":"Pajin","date":"2019-09-11T17:13:11.199+0000","up_votes":1,"down_votes":0,"body":"Usa a veigar con glacial, es Free win","replies":[]},{"poster":"Zacarius","date":"2019-09-11T16:27:05.500+0000","up_votes":1,"down_votes":0,"body":"En Elo bajo todo esta OP, como por ejemplo Jhin full AP (con sus trampas te explota), Alistar AP con electrocutar, etc, \nY los cambios son para el mundial ya que es ahí donde se ve la diferencia en tan solo 2 de AD y demás","replies":[]},{"poster":"Zênd","date":"2019-09-11T13:43:33.923+0000","up_votes":3,"down_votes":9,"body":"Asco me da que tengas 7 negativos, pero bueno, asi estanos, gente quejandose de zed, akali miemtras usan garen, veigar o triatana,el tipo te tira una R tarjeteable y si tenes menos de la mitad de la vida, no hay resistencia magica que te salve de los 3.000 de Ap de ese tumor con patas.","replies":[]},{"poster":"Nachoeslach","date":"2019-09-11T11:28:05.634+0000","up_votes":2,"down_votes":9,"body":"Totalmente de acuerdo con tu publicación. Y parece que hay un resentido Main veigar dando dislike a todo, debe ser un nene de 5 años que no le gusta que critiquen a su champ","replies":[]}]}