{"poster":"VenganceZ","date":"2019-07-21T20:39:38.458+0000","title":"Sobre el asesinato a Aatrox","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Nada importante, solo otro jugador descontento con las deducciones de Riot.\r\nAguanté que Aatrox pasase de ser un campeón dps a un campeón más \"balanceado\". 4 características fundamentales (entre otras) tenia Aatrox que hacía que fuese mi campeón favorito:\r\n\r\n1) sus habilidades sin costó: \r\ncuando empecé a jugar al lol tenía 16 anos, la gestión del maná era muy difícil de entender en ese entonces.\r\n\r\n2) una habilidad activa/pasiva que amplifica el daño/daba sustain:\r\nAlgo que tengo que destacar que conservaron del antigüo Aatrox es su nueva pasiva que tras varios parches aún así no llega a ser la sombra de lo que era su w\r\n\r\n3) una segunda oportunidad: \r\nLa característica de Aatrox, su símbolo y estandarte, siempre fue su revivir, su angel de la guarda incorporado dentro del kit del campeón, y como dice Jota, esto no tenía que ser cambiado. Aatrox es un demonio sediento de sangre y poder y cuándo recibe daño letal su poso de sangre era lo que le devolvía al juego.\r\n\r\n4) una definitiva que desata el verdadero poder de un demonio:\r\nAatrox es un espadachín Darkin, su definitiva tiene que infligir miedo y terror. \r\n\r\n¿Que sentido tiene que bufeen sus curaciones y daño si el Darkin ya no va a resucitar? ¿De quién fue la idea de sacarle la característica más importante que tiene el campeón? ¿Acaso es porque hay demasiados campeones que hacen algo parecido? No estoy contento y tengo derecho a quejarme como jugador y como consumidor y amante del juego y todo su merchandising.\r\n\r\nGracias por el espacio","replies":[{"poster":"Pinke","date":"2019-07-22T00:52:27.791+0000","up_votes":2,"down_votes":0,"body":"Solo anda al stream de Hashinshin a fijarte lo que piensa el de los cambios a Aatrox, era necesario sacarle el Revivir, sino se volvia imposible de frenar el snowball","replies":[]}]}