{"poster":"C du preez","date":"2016-09-21T18:36:19.466+0000","title":"Rads error since the latest update! \"Could not connect to the HTTP....\" Help and Support!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So ever since the latest patch which was yesterday [20/09/2016] ; I can't launch the game. The problem starts with a Rads error message box containing the message \"Could not connect to the HTTP server. Please check that your internet connection is enabled and that your firewall is not blocking access.\" \r\n\r\nSo it's not my first time receiving this message, no biggy? I do the usual, start to google and YouTube a solution for this problem. Sure enough I have a YouTube vid bookmarked for occasions like this. So none of the usual tips are working, I've opened the command prompt and flushed the dns, I've  changed the dns setting under network properties to that 8888/8844 google trick, I've restarted many times and even started re-downloading the game. \r\n\r\nThe problem now is, I keep receiving a message box with the title: _Update Failed_  and contains the message \"Unspecified error occurred. Please check the logs for more information.\" This message has popped up the few times I managed to get the launcher  running. After this I am back to square one.\r\n\r\nPlease I have been at this for a whole day now, please help!\r\n\r\nI have done some research and looked at the boards and I've seen multiple cases with the same problems! How has this problem not been addressed yet?! \r\n{{sticker:zombie-brand-mindblown}}  \r\n\r\nSo I'm not a super IT guy who knows what's going on, can I please get some assistance and support from and other summoners experiencing the same problem.","replies":[{"poster":"Targons Blade","date":"2016-09-22T20:37:27.841+0000","up_votes":1,"down_votes":0,"body":"Patching issues can be caused by a number of potential causes. Most of the time, they're caused by permissions issues with the League client itself or an unstable connection to the patching servers. We've consolidated the most common solutions in our [patching issues guide](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues), so I recommend starting there.\n\nLet me know if this issue persists through those steps.","replies":[]},{"poster":"Roit Gums","date":"2016-09-21T19:35:56.086+0000","up_votes":1,"down_votes":0,"body":"I had the same Problem! Restart your router by turning it off then on again trust me it will work Im an engineer (no joke)","replies":[{"poster":"C du preez","date":"2016-09-21T20:18:58.569+0000","up_votes":1,"down_votes":0,"body":"Dude I laughed so hard right now xD I am an engineer as well xD no kidding! So the problem is, I live in a complex that has its own wifi, no landlines in any of the flats in the complex so we are kinda forced to use there WiFi.. so i cant reach the router, considering it's tightly locked up in the head office.. and my ninja skills haven't kicked in yet..\n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}