{"poster":"Azharidan","date":"2015-06-16T22:34:36.200+0000","title":"Quando tutti noi abbiamo probabilmente realizzato che non avremo la skin di Mundo","subforum":"Discussioni generali","embed":{"description":"HAHAHA Best ever :DD","url":"https://www.youtube.com/watch?v=JncgoPKklVE","image":"https://i.ytimg.com/vi/JncgoPKklVE/hqdefault.jpg"},"up_votes":8,"down_votes":3,"body":"La cosa bella &egrave; che probabilmente alcuni non usano neanche Mundo... ma una skin free &egrave; una skin {{champion:32}}","replies":[{"poster":"Warthogh","date":"2015-06-17T07:11:48.676+0000","up_votes":4,"down_votes":0,"body":"GG rito. l' avevo detto che questo evento è impossibile. ma ne ero si uro che voi lo avreste fatto apposta per farci stare appiccicati al computer con la skin di mundo in testa, traguardo che non avremmo mai raggiunto, dato che fare 10 milioni di punti al giorno è impossibile ed imPOROponibile.","replies":[{"poster":"DatPeo","date":"2015-06-17T07:21:11.229+0000","up_votes":1,"down_votes":1,"body":"a t funziona il launcher?","replies":[{"poster":"ViaMalinconiaN9","date":"2015-06-17T11:27:23.221+0000","up_votes":1,"down_votes":0,"body":"No basta io schiatto.. xD\n\n>a t funziona il launcher?","replies":[]}]}]},{"poster":"R3lion","date":"2015-06-16T23:28:50.691+0000","up_votes":2,"down_votes":1,"body":"onestamente, a ripensarci ora, bisognava aspettarsela, come parte della comunity si impegna a giocare serio, nn flammare, ecc, ce ne stà sempre un altra parte, molto piu ampia che se ne sbatte altamente e trolleggia.\n\ned è quello che succede ora con i gruppi, per una parte che nel dubbio invita l'intera lista amici e le chat ( tanto avere un estraneo che nn conosci random, e un estraneo che nn conosci random italiano cambia poco ), molti altri semplicemente joinano per risparmiare quei 60 secondi che ci vogliono a trovare gruppo ( e magari ce li metti in game per flammare dietro a qualcuno per questo o quello, magari pure in inglese )\n\npoi come detto da azharidan, manco io uso mai mundo, usato 1 volta in vita mia la settimana scorsa per un miss clic, ma una skin free nn si rifiuta mai, o nemmeno un week end con ip x 300, o magari anche un champ ( col culo che ho tanto mi sbloccavano uno da 1300 )","replies":[{"poster":"Bang HeadShot","date":"2015-06-17T07:32:10.379+0000","up_votes":3,"down_votes":4,"body":"\"onestamente, a ripensarci ora, bisognava aspettarsela, come parte della comunity si impegna a giocare serio, nn flammare, ecc, ce ne stà sempre un altra parte, molto piu ampia che se ne sbatte altamente e trolleggia.\" \n\nQuello che probaìbìlmente non capisci e' che tutto ste cazzate te le potrebbero dare gratìs e subito, non essendo essenzìalì ai fini del gioco. Sai quanto me ne sbatte dì non avere ì mìnìon col costume? Meno di zero. Ma mi raccomando contìnuate a mettervì a 90 alla sola prospettiva dì avere una skìn da 5 euro gratìs. Sìete mìtìcì","replies":[{"poster":"Dr LouD","date":"2015-06-17T07:54:27.738+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bang HeadShot,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=00020000,timestamp=2015-06-17T07:32:10.379+0000)\n>Ma mi raccomando contìnuate a mettervì a 90 alla sola prospettiva dì avere una skìn da 5 euro gratìs. Sìete mìtìcì\n\nMettersi a 90 per una skin? Ti ricordo che per fare punti in questo evento basta anche solo GIOCARE, si esatto, GIOCARE.\n\nNon si arriva a determinati punti? Nevermind, di certo non mi è uscito niente dal portafoglio per aver contribuito semplicemente giocando con amici.\nE seconda cosa, 5 euro > gratis, è così sbagliato desiderare un contenuto a pagamento gratis?","replies":[{"poster":"Bang HeadShot","date":"2015-06-17T08:17:18.215+0000","up_votes":2,"down_votes":2,"body":"E' sbagliato dal momento in cui credi che ti stiano relagando qualcosa, quando imparerete a capire che non vi stanno regalando assolutamente niente forse ragìonerete ìn una manìera dìversa.","replies":[{"poster":"Dr LouD","date":"2015-06-17T08:22:28.246+0000","up_votes":3,"down_votes":0,"body":"Infatti so perfettamente che non ci stanno regalando niente.\n\nPiù si gioca, maggiori sono le probabilità che riceveremo premi, secondo te chi crea un prodotto e paga i propri dipendenti va a regalare robe gratis?\n\nPRETENDERE la skin gratis è sbagliato, desiderarla no. Ma di certo non mi vado a impiccare se a fine evento non arriviamo nemmeno a 5 milioni, a me non cambia nulla sinceramente :v","replies":[]}]}]},{"poster":"R3lion","date":"2015-06-17T09:33:49.650+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Bang HeadShot,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=00020000,timestamp=2015-06-17T07:32:10.379+0000)\n>\n> \"onestamente, a ripensarci ora, bisognava aspettarsela, come parte della comunity si impegna a giocare serio, nn flammare, ecc, ce ne stà sempre un altra parte, molto piu ampia che se ne sbatte altamente e trolleggia.\" \n> \n> Quello che probaìbìlmente non capisci e' che tutto ste cazzate te le potrebbero dare gratìs e subito, non essendo essenzìalì ai fini del gioco. Sai quanto me ne sbatte dì non avere ì mìnìon col costume? Meno di zero. Ma mi raccomando contìnuate a mettervì a 90 alla sola prospettiva dì avere una skìn da 5 euro gratìs. Sìete mìtìcì\n\nse conti che in vita mia ho comprato 0 skin o rp in generale e ho ad block perma attivo sui miei browser, si mi sento proprio messo a 90......","replies":[{"poster":"Firenheit","date":"2015-06-17T09:56:28.534+0000","up_votes":1,"down_votes":1,"body":"Sei tu che non rispetto il lavoro altrui e metti a 90 gli altri in verità.\nE no, non è una cosa positiva. C'è gente che lavora per te e hai idea dei danni che crea AD-Block?","replies":[{"poster":"Whommy","date":"2015-06-17T10:13:58.938+0000","up_votes":1,"down_votes":1,"body":"AD-Block inibisce la visualizzazione, l'ADS viene contato lo stesso come visualizzato.\n\nIl pubblicitario guadagna lo stesso\nTu non vieni ammorbato da pubblicità di cose che neanche interessano o compreresti\n\nCi perde solo di visione il produttore indirettamente","replies":[{"poster":"Dr LouD","date":"2015-06-17T10:46:39.993+0000","up_votes":1,"down_votes":0,"body":"No, l'ads non viene per nulla visualizzato, ergo il pubblicitario non guadagna.\n\nE non sto dicendo cose a caso senza sapere, dato che con siti web, pubblicità e simili ci lavoro.","replies":[{"poster":"Whommy","date":"2015-06-17T11:28:38.131+0000","up_votes":1,"down_votes":0,"body":"ho sempre saputo che elimina dalla visualizzazione la stringa quando il browser arriva ad interpretare il codice","replies":[{"poster":"Dr LouD","date":"2015-06-17T11:31:18.457+0000","up_votes":2,"down_votes":0,"body":"Rimuove la stringa di codice prima dell'effettiva visualizzazione della pagina.\n\nDati alla mano, avendo un javascript che controlla chi ha adblock e chi no, posso verificare tranquillamente che dagli utilizzatori di adb non si riceve alcun profitto derivanti da pubblicità nella pagina, ne aumentano le visualizzazioni del banner pubblicitario.","replies":[{"poster":"Sorcio84","date":"2015-06-17T18:58:08.441+0000","up_votes":1,"down_votes":0,"body":"Secondo me una persona ha il diritto di poter decidere se vedere la pubblicità o no.\nAnche su youtube per esempio, ci sono gli ads che salti dopo 5, quelli un pó più lunghi, e quelli che te li becchi tutti. Su youtube è ok e ci sta, ma se mi ritrovo ads ovunque chiaro che mi rompo.\nPoveri pubblicitari いち かっぞ , non sono costretto a far guadagnare gente così.","replies":[]},{"poster":"Whommy","date":"2015-06-17T12:40:37.051+0000","up_votes":1,"down_votes":0,"body":"grazie per l'illuminazione!","replies":[]}]}]}]},{"poster":"R3lion","date":"2015-06-17T10:40:42.332+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=tommyhaze17,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=00020000000100000001,timestamp=2015-06-17T10:13:58.938+0000)\n>\n> AD-Block inibisce la visualizzazione, l'ADS viene contato lo stesso come visualizzato.\n> \n> Il pubblicitario guadagna lo stesso\n> Tu non vieni ammorbato da pubblicità di cose che neanche interessano o compreresti\n> \n> Ci perde solo di visione il produttore indirettamente\n\ndin din din, abbiamo un vincitore,\n\nps per rispondere sotto, coi bimbi, ecco come si fanno i soldi, i furbi usano  i bimbi per fare da numero, ma siamo a ragionamenti troppo di alto livello evidentemente.","replies":[{"poster":"Dr LouD","date":"2015-06-17T10:51:20.838+0000","up_votes":1,"down_votes":0,"body":"Parlate sempre senza sapere le cose.","replies":[]}]},{"poster":"Firenheit","date":"2015-06-17T10:44:49.901+0000","up_votes":1,"down_votes":0,"body":"\"din din din\" \nVeramente no, ti invito a informarti meglio su come funziona, sia su YT che su altri siti. Fidati, toglie i guadagni (:\n[Esempio di informazione.](https://it.wikipedia.org/wiki/Adblock_Plus)\n","replies":[]}]},{"poster":"R3lion","date":"2015-06-17T10:11:16.848+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=0002000000010000,timestamp=2015-06-17T09:56:28.534+0000)\n>\n> Sei tu che non rispetto il lavoro altrui e metti a 90 gli altri in verità.\n> E no, non è una cosa positiva. C'è gente che lavora per te e hai idea dei danni che crea AD-Block?\n\ne perkè mai? cè scritto da qualche parte che in cambio del gioco io devo guardarmi la pubblicità? nn mi pare,  è un programma perfettamente lecito, tra l'altro nn viene nemmeno chiesto di nn usarlo, quindi dove sta il problema? la rito offre un free to play e a tanto io accetto l'offerta","replies":[{"poster":"Firenheit","date":"2015-06-17T10:49:55.875+0000","up_votes":1,"down_votes":0,"body":"Comunque si, viene chiesto di non usarlo xD","replies":[{"poster":"R3lion","date":"2015-06-17T10:58:25.984+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=000200000001000000000001,timestamp=2015-06-17T10:49:55.875+0000)\n>\n> Comunque si, viene chiesto di non usarlo xD\n\npotrei vedere dove? inoltre come gia detto, se volete chiedere di nn usare adb fate come rojadirecta, cosi la gente se ne accorge senza girare 1k post cmq troppe seghe mentali, ognuno la vede come gli pare e detto questo nn smetterò di usarlo, problemi di guadagni? gg sono disposto a scommettere che i bimbi riusciranno con le loro skinn a tenere viva la rito e altro","replies":[{"poster":"Dr LouD","date":"2015-06-17T10:59:46.723+0000","up_votes":2,"down_votes":0,"body":"Mi spieghi dove usi adblock su LoL??\n\nQuesto discorso non centra nulla su LoL, dato che la Riot non utilizza pubblicità sui propri siti.\nE' un discorso generale, basta andare su un qualsiasi sito dove si mantiene solo con pubblicità, usi adblock e li ammazzi.\n\nFai una cosa, domattina va a lavorare gratis, vabene lo stesso no?","replies":[]},{"poster":"Firenheit","date":"2015-06-17T11:46:42.145+0000","up_votes":1,"down_votes":0,"body":">potrei vedere dove?\n\nFatti un giro sul web, no? Te lo dico da ora, i siti poro non hanno mai fatto storie per ADBlock, quindi cerca altrove.","replies":[]}]},{"poster":"Azharidan","date":"2015-06-17T15:26:34.910+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=000200000001000000000001,timestamp=2015-06-17T10:49:55.875+0000)\n>\n> Comunque si, viene chiesto di non usarlo xD\n\nSinceramente  io non faccio uso di Ad Block, in ogni caso è un programma perfettamente lecito e legale, quindi non si infrange nessuna legge, si può chiedere che non venga usato, ma fin quando quest'ultimo sarà legale, disabilitarlo, sarà pura cortesia da parte dell'utente .\nVero che danneggia i siti web che utilizzano pubblicità per mantenersi e lo stesso youtube, ma è anche vero (mi pare ) ci sono delle opzioni su AD block per decidere in quali siti mantenerlo ed in quale no .\n\nDa un altra parte, parlando delle pubblicità, si potrebbe anche fare un uso decente e intelligente di quest'ultime piuttosto che buttarle ovunque, per esempio, perchè quando vedo un video di gaming su youtube mi esce la pubblicità del \"Dottor Coccologo\" o \"La danza della forfora\", piuttosto che una pubblicità sui giochi che sarebbe molto più intelligente ? Di certo quando vado al cinema non mi fanno vedere la pubblicità di Call of Duty ma bensì dei prossimi film o di altri film che stanno uscendo, sarebbe molto più sensato .","replies":[]}]},{"poster":"Dr LouD","date":"2015-06-17T10:23:33.957+0000","up_votes":1,"down_votes":0,"body":"Se un gioco è gratis come credi che guadagna lo sviluppatore?\n\nMio dio che discorso da ignorante.","replies":[{"poster":"Sorcio84","date":"2015-06-17T19:05:13.829+0000","up_votes":1,"down_votes":0,"body":"Rp per\n- skin\n- pacchetti bundle\n- icone evocatore\n- boost PI e EXP\n- icone lumi\n- campioni (che quasi nessuno compra con RP)\n- pagine di rune (acquistabili anche in PI)\n\nInoltre esiste un merchandising\nEventi e tornei E-sport (probabilmente con sponsor)\n\nLa pubblicità è solo **una** fonte di guadagno","replies":[]}]}]}]}]}]}]},{"poster":"SirZeel","date":"2015-06-17T10:50:56.756+0000","up_votes":1,"down_votes":0,"body":"Qualcuno mi può fare un riassunto? Perché nessuno avrà la skin di Mundo?\nPochi punti?","replies":[{"poster":"MrWH0","date":"2015-06-17T11:31:47.766+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SirZeel,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=0008,timestamp=2015-06-17T10:50:56.756+0000)\n>\n> Qualcuno mi può fare un riassunto? Perché nessuno avrà la skin di Mundo?\n> Pochi punti?\n\nSi, lunedì ne sono stati totalizzati a malapena 4 milioni, per arrivare a 55 milioni in una settimana bisognerebbe farne circa 7.9 milioni al giorno... Vediamo con l'aggiornamento di oggi a quanto siamo arrivati, ma immagino saremo intorno agli 8 milioni, la metà di quelli che dovremmo aver fatto per stare sicuri.","replies":[]}]},{"poster":"MrWH0","date":"2015-06-17T09:10:56.057+0000","up_votes":1,"down_votes":0,"body":"Tra lunedì sera e martedì sera mi sono preso la briga di domandare in partita al team avversario se erano un premeade di 5 persone oppure no, e se erano a conoscenza dell'evento collegato alla festa in piscina. La risposta datami nel più o meno 50% delle partite è stata: \"ma di cosa stai parlando?\". Traete le vostre conseguenze...","replies":[]},{"poster":"SirZeel","date":"2015-06-18T19:51:54.530+0000","up_votes":1,"down_votes":0,"body":"Bè dai, oggi siamo avanzati di più di 10 milioni.\nC'è ancora speranza.","replies":[]},{"poster":"BioS iP","date":"2015-06-16T23:15:24.441+0000","up_votes":1,"down_votes":1,"body":"le persone non giocano in team e continuano a fare solo Q...questa è la perfetta rappresentazione della Teoria dei Giochi...meh","replies":[{"poster":"StitchedClone","date":"2015-06-17T18:40:26.508+0000","up_votes":1,"down_votes":0,"body":"Non per forza bisogna fare team di 5 persone, ad esempio io gioco raramente con altri 4 compagni che invito io, di solito siamo sempre 2 o 3 a giocare insieme, e se la gente deve spendere tempo per trovare 5 giocatori e ci metti più di 10 minuti... inizi la partita con i tuoi soliti amici di compagnia e fai la tua partita, sembra quasi che con questo evento la riot ti costringa a giocare con 5 premade per ottenere che cosa punti che poi vanno a tutta la community, che magari hai giocato solo 1 volta in 5 premade?...\nTieni conto che c'è gente che fa una partita e prende il bonus , invece ce ne sono altri che giocano anche 30 partite per ottenere il bonus, questa cosa ti sembra giusta?.\nSecondo me non dovevano fare l'evento su tutta la community, ma su singolo player, raggiungendo 100 punti massimo per la skin di mundo.","replies":[{"poster":"BioS iP","date":"2015-06-17T20:13:59.054+0000","up_votes":1,"down_votes":0,"body":"sono pienamente d'accordo...chiedere alle persone di contribuire a qualcosa volontariamente, è come chiedere a qualcuno di pagare le tasse se non obbligato...\n\nComunque io ho una 15ina di amici con cui gioco di solito(spesso dobbiamo fare 2 partite separate o custom e qualcuno resta comunque fuori) ma, da quando è iniziato l'evento, non giocano in premade perché vogliono fare solo Q.\n\nIl bene collettivo è sempre inferiore a quello del singolo...","replies":[]}]}]},{"poster":"R3lion","date":"2015-06-17T11:36:21.713+0000","up_votes":1,"down_votes":0,"body":"sei ottimista, io temo che saremo solo sui 7 milioni  ( se il conteggio è partito veramente lunedi mattina )","replies":[]},{"poster":"SirZeel","date":"2015-06-17T11:32:11.567+0000","up_votes":1,"down_votes":0,"body":"Oppure la potremmo smettere di parlare di un argomento che 1) non riguarda LoL, 2) è off-topic e 3) impedisce la visualizzazione dei messaggi inerenti.\n\n> [{quoted}](name=MrWH0,realm=EUW,application-id=MJVj50Jw,discussion-id=3znLqEtg,comment-id=00080001,timestamp=2015-06-17T11:31:47.766+0000)\n>\n> Si, lunedì ne sono stati totalizzati a malapena 4 milioni, per arrivare a 55 milioni in una settimana bisognerebbe farne circa 7.9 milioni al giorno... Vediamo con l'aggiornamento di oggi a quanto siamo arrivati, ma immagino saremo intorno agli 8 milioni, la metà di quelli che dovremmo aver fatto per stare sicuri.\n\nGrazie.","replies":[]},{"poster":"R3lion","date":"2015-06-17T10:48:29.019+0000","up_votes":1,"down_votes":0,"body":"facciamo cosi, visto che sinceramente stiamo intasando un post di tt altro genre, chiudiamo con il ognuno fa come gli pare, a me offrono un prodotto, lol, e un altro prodotto, ad block, io accetto di prenderli entrambi rispettando le condizioni che mi vengono poste, nn approvi, consiglia alla rito di fare come rojadirecta.","replies":[]},{"poster":"Chris is here","date":"2015-06-17T08:50:11.730+0000","up_votes":1,"down_votes":0,"body":"Se vi va potete aggiungermi alla lista amici per provare almeno nel nostro piccolo a contribuire per il raggiungimento degli obbietivi :)","replies":[]},{"poster":"LionHeartV","date":"2015-06-17T08:04:53.407+0000","up_votes":1,"down_votes":0,"body":"4 giorni per arrivare a mundo... {{champion:36}} \nMale che vada la riot lo regala a tutti","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-06-16T23:08:12.549+0000","up_votes":1,"down_votes":0,"body":"No amumu Noo, wtf è sempre colpa tua {{champion:32}}","replies":[]},{"poster":"JollyJack360","date":"2015-06-17T17:33:33.502+0000","up_votes":1,"down_votes":1,"body":"Infatti, in tre giorni abbiamo fatto 5 millioni.......Non ho capito, ma con server intende quello italiano, oppure quello europeo??\nSE è la prima abbiamo perso ancor prima di iniziare, mentre se è la seconda come mai ci stiamo mettendo così tanto??\nallivello di statistiche intendo.","replies":[]},{"poster":"Il Freddo","date":"2015-06-17T13:16:20.228+0000","up_votes":1,"down_votes":1,"body":"quei minion potevano risparmiarseli, oltre che inutili sono pire brutti","replies":[]},{"poster":"R3lion","date":"2015-06-17T11:04:48.164+0000","up_votes":1,"down_votes":1,"body":"ahahah no qui sui forum , tra l'altro che ne dite se apriamo un altro post appunto su l'uso di adb pubblicità rito ecc? perkè qua stiamo facendo un macello incredibile su un post che nn centra molto e mi dispiace un pò fare questa mega occupazione\n\nscs nn avevo letto la seconda parte ora rispondo, a livello generale se un sito chiede, anzikè un pagamento in contanti, come fanno i lavoratori \" nel mondo reale, per cosi dire \" chiedono la visualizzazione della pubblicità sono loro che si sottopongono a dei rischi, dal mio punto di vista è come se tu libero professionista, vai a lavorare per un azienda e ti fai pagare in azioni, magari ci guadagni molto se tanta gente le valuta, ma in caso contrario se la gente dice che nn hanno valore allora ci rimetti. poi magari io mi sbaglio ma allo stesso modo io accetto l'offerta che mi viene fatto da gente che ha lavorato su un prodotto, adb , e mi pare ingiusto lasciare anche loro senza lavoro ignorando il loro prodotto.","replies":[]}]}