{"poster":"DJoules","date":"2017-02-25T07:06:48.869+0000","title":"Último día en el lol, adiós señor Rito.","subforum":"Off-topic y temas personales","embed":{"description":"\"Yo No Soy Nah Material De Los Weones Akí\" jajajajajajaajaja xD","url":"https://www.youtube.com/watch?v=pBE0dTDXnlQ","image":"https://i.ytimg.com/vi/pBE0dTDXnlQ/hqdefault.jpg"},"up_votes":3,"down_votes":2,"body":"El cliente nuevo ofrece mucho problemas y no lo puedo usar en mi laptop (se pone la pantalla en negro), &eacute;ste problema siempre estuvo con el cliente nuevo pero a riot no le importa y nos pone a todos de una en el nuevo cliente sabiendo los problemas que ocasiona.\r\nNunca he tenido lag o bajos fps con el juego en s&iacute; (grietas, aram, ascensi&oacute;n, urf, etc), pero el cliente lo hace todo complicado, me da mucha lata no poder jugar en mi laptop en los momentos libres que tengo en el d&iacute;a, si para m&iacute; es un juego que disfruto con mis amigos (siempre jugamos juntos). Ya intent&eacute; todo y para probar si se arreglaba tuve que jugar partidas con amumu se&ntilde;or del trueno, lux con fervor entre otros... Porque claro, yo no me voy afk si me sale todo malo en el champ select, trato de ser un miembro no t&oacute;xico en la comunidad y prefiero jugar de todos modos que arruinarle a&uacute;n m&aacute;s la experiencia a mis compa&ntilde;eros.\r\nRiot no est&aacute; ni ah&iacute;, y se nota por c&oacute;mo implementa estas nuevas herramientas, no hay respuesta ni preocupaci&oacute;n por parte del equipo (esperaba una especie de comunicado para todos). Te avisan dos d&iacute;as antes que van a cambiar al nuevo siendo que marchaba mal y ahora est&aacute; peor.\r\nMe parece una tontera que tenga que crear 30 p&aacute;ginas de maestr&iacute;as s&oacute;lo porque la selecci&oacute;n de campeones dura 10 segundos y tener colas de baja prioridad por intentar jugar unas rankeds &iquest;De verdad quieren que haga una p&aacute;gina s&oacute;lo por un punto en meditaci&oacute;n extra? Esto es horrible para los que jugamos aram un par de veces al d&iacute;a al menos.\r\nDisculpe riot pero ya me aburr&iacute; de comprar skins para que usted me haga esto, ya no soy material de los weones...\r\nSupongo que todas esas lux elementales que vendieron no fueron suficientes para implementar un cliente de manera decente.\r\n\r\nLes deseo lo mejor chicos, traten de flamear menos plz.\r\nAdi&oacute;s.","replies":[{"poster":"darkbkn123","date":"2017-02-25T10:56:04.082+0000","up_votes":2,"down_votes":0,"body":"Adiós, pero recuerda que puedes seguir usando el antiguo mientras optimicen el nuevo, pero de que no toman medidas casi nunca es cierto, podrían mejorar el sistema de reportes en vez de sacrificar rendimiento en cosas innecesarias perfectamente implementables en un futuro. xD","replies":[]},{"poster":"JarvanIVDeHelado","date":"2017-02-25T08:12:09.382+0000","up_votes":2,"down_votes":0,"body":"Donde lloran los hombres(?)\n :C","replies":[]},{"poster":"Juniorblack","date":"2017-02-26T00:44:22.822+0000","up_votes":1,"down_votes":0,"body":"T ranqui, yo lo acabo de desinstalar","replies":[]},{"poster":"Pecris","date":"2017-02-25T07:57:11.509+0000","up_votes":1,"down_votes":0,"body":"Esperamos regreses :3","replies":[]},{"poster":"vaVav","date":"2017-02-25T07:19:32.648+0000","up_votes":1,"down_votes":0,"body":"Chau","replies":[{"poster":"DJoules","date":"2017-02-25T07:26:46.749+0000","up_votes":1,"down_votes":0,"body":"Chai :)","replies":[]}]},{"poster":"SAD Katarina","date":"2017-02-25T07:19:58.855+0000","up_votes":1,"down_votes":6,"body":"cy@ get outta my jungle you boosted bonobo hahaha","replies":[{"poster":"DJoules","date":"2017-02-25T07:27:11.651+0000","up_votes":2,"down_votes":0,"body":"STFU MADAFAKA, pero con cariño","replies":[]}]}]}