{"poster":"XfireMeleeRanged","date":"2015-06-15T05:07:52.168+0000","title":"Any other MOBA's that aren't highly skill dependent unlike League?","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":0,"body":"I'd like to know if there are any other MOBA games that don't mainly rely on good gameplay mechanics or godly plays/kda/cs 1 person hypercarry to win the game. Until you get to high gold/diamond these people get on tilts and think that losing (or winning) 2-3 lanes fed (7/2/4) is GG and play on tilt for the rest of the game and keep making bad choices depending on how they feel at that exact moment (baron noob trap/throws) or  ( whole team diving the jungler through 2 towers). In this chaotic mess of a meta, usually the winning team is being carried by fed 1-2 carries, offering little counterplay **EXCEPT** throwing because of cockiness or **_well planned strategy executed by whole team with good communication and coordination._** I'm kinda fed up with these people who won't listen to ping/make bad calls/refusing to communicate. This was supposed to be a **team game** but now solo carries are dominating everywhere. Let me know if there are any RTS that actually emphasize the **STRATEGY** part. I'd first thought league was coordination and securing objectives and planning to win games by seizing situation advantages. I love strategy games and \"find the best way to solve the problem at hand\" games. Chess is very appealing to me, though it got boring and predictable as the movement/resources were severely limited (still one of my favorite hobbies). I first found it very interesting that in League two matches are never the same. Even if you have the same champs/runes/masteries/kda/cs playing the same match in a row (grand mega lottery odds) it's still never the same. One person might build differently, make different choices and do better/worse than the last match. In my 3-4 years of League I found that if I \"lead\" a team and they all follow directions, the game was almost secured. When they listen not to chase/dive/focus tanks/and start to cooperate, it was extremely easy to kill the other teams carries while leaving them confused at how they lost the fight to feeders/\"bronzies\". I'd like a game of rts thats not based on skill level, or if rito could experiment with featured modes that teach everyone that objectives>kills and CS>kills. Maybe have a mode called \"anti snowball\" where if an enemy kills you, you get gold and they get nothing (doubled death timers) so that a team have to choose earn gold suicide and lose objectives like baron/towers vs the importance of objectives. For the team that wiped out the enemy team, they have to seize the advantage of death timers of push objectives and defend again the other team with stronger items, making one sided snowballing trivial. Looking at you {{champion:55}} {{champion:122}} {{champion:7}} {{champion:105}} . \r\n\r\ntl;dr-snowballing is extremely broken and near impossible to recover from.","replies":[]}