{"poster":"Mathlete864","date":"2015-07-01T14:40:44.601+0000","title":"When you see Riot buffing the sh*t out of kalista's AD","subforum":"Gameplay","up_votes":58,"down_votes":7,"body":"https://images.duckduckgo.com/iu/?u=http%3A%2F%2Fmedia4.giphy.com%2Fmedia%2F12XMGIWtrHBl5e%2F200.gif&amp;f=1\r\n\r\n\r\nThen you see the change to her passive making her basic attacks deal 90% of her AD.\r\n\r\n\r\nhttps://images.duckduckgo.com/iu/?u=http%3A%2F%2Fmedia0.giphy.com%2Fmedia%2FYa7e2Y8bsy3M4%2F200.gif&amp;f=1","replies":[{"poster":"AMYS GRAVE","date":"2015-07-01T15:19:52.114+0000","up_votes":26,"down_votes":4,"body":"I really don't understand why she should only do 90%... why not just lower her base AD or change her scaling AD or anything that keeps AA damage consistent between champions. Every champion does 100%AD on hit, why should one champion be different?","replies":[{"poster":"ItsStout","date":"2015-07-01T16:12:33.427+0000","up_votes":3,"down_votes":1,"body":"She scales too well with early AD, and riot wants her to be more AS reliant. \n\nAnyway, having different AD scalings on basic attacks is an idea I've been working with for a while. It certianly works.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-01T16:28:48.605+0000","up_votes":1,"down_votes":0,"body":"i mean, it can work for sure, but why sacrifice the consistency of aa damage? It seems like a clarity issue that all AA in the game do 100% AD except for this one which is special.","replies":[{"poster":"Verxint","date":"2015-07-01T17:00:25.720+0000","up_votes":44,"down_votes":0,"body":"I consider it to be a tradeoff for her passive. TBH, with this change, if she doesn't take the jump she should get full damage.","replies":[{"poster":"Hyrum Graff","date":"2015-07-01T17:34:34.823+0000","up_votes":11,"down_votes":0,"body":"> [{quoted}](name=Little Mac is OP,realm=NA,application-id=3ErqAdtq,discussion-id=v14FG5us,comment-id=0001000200000001,timestamp=2015-07-01T17:00:25.720+0000)\n>\n> I consider it to be a tradeoff for her passive. TBH, with this change, if she doesn't take the jump she should get full damage.\n\nThis comment needs more visibility.","replies":[]},{"poster":"AMYS GRAVE","date":"2015-07-02T03:51:13.721+0000","up_votes":1,"down_votes":0,"body":"I think i would be more ok with that, it still seems like there should be easier ways though.","replies":[{"poster":"Sinlaire","date":"2015-07-02T07:26:22.192+0000","up_votes":1,"down_votes":0,"body":"The entire point of this change, in my opinion, is to load more damage into her Q and E. The scaling remains the same meaning even if her AA is getting nerfed by 10%, the damage from those two is actually getting stealth buffed.\n\nNow she -gasp- actually has to use her Q and E to secure kills instead of hopping around everywhere and Auto Attacking everything to death and just using rend for the slow.","replies":[]}]}]},{"poster":"LeeDark","date":"2015-07-02T03:27:08.230+0000","up_votes":4,"down_votes":0,"body":"Because any ADC who does not have reduced scaling on AD will want to build a BF Sword item FIRST almost all the time.  A tiny bit of clarity sacrificed, clearly indicated in the text of the passive, isn't too high a price for some diversity.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T03:46:09.253+0000","up_votes":1,"down_votes":0,"body":"Clarity is one of their design pillars, and I'm not convinced you have to sacrifice clarity to obtain some diversity. That sounds like a false dichotomy to me.","replies":[{"poster":"LeeDark","date":"2015-07-02T09:49:08.910+0000","up_votes":2,"down_votes":0,"body":"I'll repeat it, then.  100% AD scaling will ALWAYS make an item with BF Sword as a component, most likely, IE, the best early power spike you can get.  Any ADC who expects to do ANY fighting whatsoever before 16 minutes will be required to buy that item.  There are literally only two alternatives:  The first is a Triforce carry, which requires an exceptional early and is still going to fall off late, or a hypercarry who just knows from the beginning that there is no way they can win the early game against the opposing ADC, such as Vayne against a Jinx, in which case you build their preferred lifesteal item for sustain while farming.  That is all the diversity there is in that role.  That is all the diversity there has been in that role for a very long time.  The reason for this is that most of their ability to win fights comes from their autoattack, and Infinity Edge does more to improve that than any other item.  Triforce is an acceptable replacement that offers a better static boost if and only if you can reliably use all the stats it provides AND proc the Spellblade ability multiple times in one fight easily.\n\nThe only way to change the relative value of stats on items without changing the items themselves is to change the scaling somehow.  Even with very low-scaling AD ratios on abilities that improve with the number of attacks you put in, the simple fact that your basic attack has 100% scaling will always make AD better.  The closest they've come to breaking that is Vayne, who waits until her third item to build IE.  Even then, she knows that, against an equally skilled opponent, she can't win most matchups early.  She builds the BorK first, sustains and farms, and carries the late game.  She gets to build two attack speed items first, the second being PD most of the time, because she has ONE ability that scales with AD at all.  This makes her total AD scaling, even with the basic attack 100% scaling, rather lackluster.  Finally, her ult and Q also boost her attack damage when she needs it, so she can get away with building attack speed because it helps get more boosted attacks during her ult.  Kalista has two abilities that scale, giving her somewhat respectable scaling despite being an attack speed carry, and she has NO on demand ability to boost her attack damage.  She has a rather poor conditional ability to get a little extra damage if her Oathbound attacks something.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T15:57:01.540+0000","up_votes":1,"down_votes":0,"body":"Good post. \n\nADC itemization is in a very narrow spot because you buy the items for their stats more than for their actives or passives, and flat AD is almost always the first buy. This sort of reasoning is why they are reworking AP itemization and if the goal with these changes is build diversity for ADCs then why not just rework AD items in a similar way to the AP changes are being made. Changing each champions AA damage individually because of a systemic problem with narrow build paths seems at least a little backwards.","replies":[{"poster":"LeeDark","date":"2015-07-02T20:46:32.327+0000","up_votes":2,"down_votes":0,"body":"If they change ADC itemization the way they are changing AP itemization, you'll have a month or so of diversity, but once the pros figure out the new itemization, you'll see a clear winner emerge in the LCS.  People watching will start building that way, they'll win solo queue games, and eventually the new rush item will be almost universally known.  We know this because it has already happened.  Bloodthirster used to be the 99% first bought item for ADC's, back when it was capable of having more AD than any other item.  It offered both sustain and the best scaling.  And that situation was even more fluid.  Even if you were a late game carry, you wanted the sustain it offered.  If you were an early game monster, you wanted to stack up the AD quickly and snowball off that.  Bloodthirster was changed, Infinity Edge became the single biggest increase in damage an ADC could get, and the transition took place.  Pros bought IE, people who watched pros bought IE, now most everyone buys IE.\n\nAP itemization is different in that every AP champion is different.  An ADC is picked for one reason and one reason only:  Damage.  The only variable really is when you want their damage to spike: early game, midgame, or late game.  AP champions have the same consideration, but they also have to consider how their damage is dealt, how much waveclear they can provide, and how much utility they bring to the table.  As much as their playstyles are different, Corki and Vayne are actually pretty similar.  One is more powerful early, and one is late, but in the end, they are both a source of consistent damage with some capability for short duration burst damage.  This is much smaller than the difference between, for example, a support mage like Lulu top, and a hypercarry like Ryze or an AP drain tank like Swain.\n\nThere is one way I can think of to diversify AD itemization without adding scaling ratios to autoattacks.  The first step is to eliminate crit completely.  In order for this to work, autoattack damage would have to be homogenized more than it is now.  You get rid of crits, making autoattacks more consistent and incapable of huge lucky power spikes, and then you homogenize the items so that there are basically two tiers of AD items in terms of damage, sort of like AP items.  You have the 50-60 AP items for early and midgame, and the 80-120 items for late.  If you do the same with AD items, you'd need narrower ranges, something like a 25-30 range and a 50-60 range.  After you've homogenized the damage on items, so that the only question the ADC is asking is whether they want and early game item or rush for late game, you can start adding utility to those items, so they are asking themselves if they need to bust tanks, burst squishies, avoid assassins, poke, or just take towers.  Right now, you don't get BorK to bust tanks.  You get BorK if you are already playing a champion who doesn't suffer too much from building BorK instead of Bloodthirster.","replies":[]}]}]}]}]},{"poster":"Zair Umbras","date":"2015-07-01T22:23:28.505+0000","up_votes":2,"down_votes":0,"body":"Yasuo is a good example. You always get 100% crit on him, but crits do 10% less. It's pretty much the EXACT same thing except this nerfs her early game while Yasuo's damage loss applies after every hit is a crit. Same concept though.","replies":[{"poster":"Syndrarella","date":"2015-07-01T22:29:01.917+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Zair Umbras","date":"2015-07-01T23:19:02.261+0000","up_votes":3,"down_votes":0,"body":"Funny enough, all crit damage runes as well as IE's 50% are reduced by that 10%. So if your crit would do nearly 300% damage, which would be pure crit damage runes totaling almost 50% there, 50% from IE, and the base 200% damage, your Crit would only do 270%. Kinda funny how it works. 10% crit damage would only give him 8% when he actually LOSES 20% crit damage initially because it's the 200% total damage being reduced. It states his CRITS do 10% less, not his crit damage base is reduced by 10%. You'd need about 22ish % crit damage to negate his passive prior to IE. After IE, he's at 250% which would mean his crits do 225%, so you'd have to have nearly 30% from runes since your runes are also reduced by that 10%. \n\nBut yeah. Overall, it's about the same concept with her. Technically her crits would do the same as Yasuo's since her ENTIRE attack is reduced by 10%","replies":[]}]}]},{"poster":"ChaoticPinecone","date":"2015-07-02T00:50:13.729+0000","up_votes":1,"down_votes":0,"body":"By nerfing the damage it does, not the base stats, you also nerf how well she scales with items. For example, lowering her base AD by 10% earlygame is like 6 damage. Once you get a BT, LW, and Mercurial it becomes like 30. \n\nYoud be trading off consistency if you want the same effects - you can have all AA in the game do 100% AD, but items would give less stats to Kalista.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T01:29:42.681+0000","up_votes":1,"down_votes":0,"body":"Except that wouldn't even be true because items would give her full stats for her spear and rend... So why touch her AA at all and just nerf her AD/level while buffing her ratios slightly to achieve the same effect in a manner that is more consistent with other champions in the game?","replies":[{"poster":"ChaoticPinecone","date":"2015-07-02T01:54:06.895+0000","up_votes":1,"down_votes":0,"body":"Nerfing her AD per level and buffing her ratios doesnt really solve the same problem. It only works out if you got a full build when you hit level 18 - that way, there would be a connection between item builds and levels. \n\nNerfing AD per level to get the same effect of -10% on AA damage would make you a whole lot weaker between 1-18. For example, if you have a 6 item Kalista with 350 AD, the current change lowers the damage on autos 35 AD. Imagine if you got -35 AD at level 18 from your base stats, where you might only have 4 items at 250 AD. You would get a 14% damage reduction on autos, which is more than Riot wanted.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T02:10:04.321+0000","up_votes":1,"down_votes":0,"body":"I mean, you're not wrong, it shifts the power from her autos to her abilities, and nerfs her late game autos which seems to be what they were going for. the math you proposed doesn't exactly match, but with enough thought and tweaking i dont see why AA damage needs to be a tuning lever when it never was before.","replies":[]}]}]}]}]}]},{"poster":"Fortiis","date":"2015-07-01T15:37:49.444+0000","up_votes":11,"down_votes":2,"body":"Right? I have a feeling that once they start nerfing %damage on basic attacks, nothing will be sacred haha. \n\nSincerely,\nA Kalista main","replies":[{"poster":"360D3GR3SS","date":"2015-07-01T19:05:53.199+0000","up_votes":1,"down_votes":0,"body":"Im guessing they did it just to test on the pbe. As a nerf like this has never been done before. It is clear that they want to balance her extreme safety in permanent repositioning from her passive and lower her \"free\" damage. Although once she is caught she is usually dead unlike some other adcs.","replies":[{"poster":"Rew711","date":"2015-07-01T19:25:15.346+0000","up_votes":1,"down_votes":0,"body":"{{champion:104}} when snared, this champion cannot use his E. His W must land on target to deal damage, even if in it, they are not blinded to the outside and can still do stuff. Its not a snare. His Q is only effective up close and even at a far, it only deals so much. His R is the easiest to miss (I should know as I've played as Graves a lot) and though its range is good, its no Ezreal, Ashe, or Draven ultimate. The end deals less than what's close. Not asking for buffs because I already use Graves like a beast but she's not the only one who loses a lot when snared.","replies":[{"poster":"Binxy Prime","date":"2015-07-03T06:37:43.574+0000","up_votes":1,"down_votes":0,"body":"i cant remember the last time I missed a Graves ult.  Maybe if you are max range and missjudge where they are going but in the normal range I dont think I've ever missed that ability. I dont even know the last time someone flashed it.","replies":[]},{"poster":"Sammystorm","date":"2015-07-02T07:09:19.770+0000","up_votes":1,"down_votes":0,"body":"Graves ult is much much better then ezreal and draven's. It gives very litlle reaction time which is very good in it self. On top of that Graves does get free tanky stats and has higher base health then most if not all of the other adc's.","replies":[]}]}]}]},{"poster":"Drunk Rummate","date":"2015-07-01T15:42:26.841+0000","up_votes":8,"down_votes":0,"body":"I agree. It seems really awkward and heavy handed to nerf her auto attack damage.  I think it would have been far better to just reduce her scalings and maybe her W passive damage instead.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-01T15:49:16.139+0000","up_votes":3,"down_votes":0,"body":">It seems really awkward\n\nAwkward, thank you, that is the word i've been looking for. This change is super awkward.","replies":[]}]},{"poster":"Caeler","date":"2015-07-02T18:16:43.225+0000","up_votes":2,"down_votes":0,"body":">Every champion does 100%AD on hit\n\n{{champion:22}}  and, to some extent, {{champion:157}}","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T18:20:20.072+0000","up_votes":2,"down_votes":0,"body":"Crit modifies damage, their AA deal 100% AD on hit but are modified by crit. They interact with Crit differently than other champions but their base AA damage is still 100%AD. but yeah their interactions with crit bother me too.","replies":[{"poster":"Caeler","date":"2015-07-02T20:30:39.879+0000","up_votes":2,"down_votes":0,"body":"Fair point.","replies":[]}]}]},{"poster":"Only Play Darius","date":"2015-07-01T17:06:19.181+0000","up_votes":1,"down_votes":0,"body":"This was my exact worry. Basic attacks used to be sacred in that they always had 100% AD scaling on every champ. Now that it is no longer sacred, I worry they will give the same treatment to other champions in the future.","replies":[{"poster":"BattleBalladeer","date":"2015-07-01T17:26:26.916+0000","up_votes":2,"down_votes":0,"body":"One can only hope... {{champion:92}}","replies":[{"poster":"TotalJerk","date":"2015-07-01T19:31:32.021+0000","up_votes":2,"down_votes":0,"body":"Riven's AAs aren't even what's wrong with her.","replies":[{"poster":"Anidan","date":"2015-07-01T21:04:21.397+0000","up_votes":2,"down_votes":0,"body":"Agreed. I will mostly defend Riven, but it's not her AAs that get complaints - it's the animation cancelling that's problematic.","replies":[{"poster":"ComannderShepard","date":"2015-07-01T23:52:44.484+0000","up_votes":2,"down_votes":0,"body":"I don't like her ad scaling shield with a 4 second CD.","replies":[{"poster":"Anidan","date":"2015-07-02T00:11:32.029+0000","up_votes":1,"down_votes":0,"body":"There's a lot of things I don't like in this game, but scaling defenses on otherwise very squishy champions don't make that list.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T03:48:37.020+0000","up_votes":1,"down_votes":0,"body":"When they scale off offensive stats i'm pretty sure that should make the list, but this isn't the thread for that discussion.","replies":[{"poster":"Anidan","date":"2015-07-02T04:52:06.506+0000","up_votes":1,"down_votes":0,"body":"It doesn't make mine because it's not a trait exclusive to Riven. But, I agree, this is not the time to make this into an argument. Have a good night, to you, sir, and a good many more!","replies":[]}]}]}]}]}]}]}]},{"poster":"Sergeant Stephen","date":"2015-07-01T20:33:42.432+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=v14FG5us,comment-id=0001,timestamp=2015-07-01T15:19:52.114+0000)\n>\n> I really don't understand why she should only do 90%... why not just lower her base AD or change her scaling AD or anything that keeps AA damage consistent between champions. Every champion does 100%AD on hit, why should one champion be different?\n\nI'm pretty sure it only goes to 90% IF she hops. So, if she doesn't hop, she deals 100% of her AD. It also makes stacking AD items and hopping less useful (it's 90% of total AD).","replies":[{"poster":"AMYS GRAVE","date":"2015-07-01T20:41:17.072+0000","up_votes":1,"down_votes":0,"body":"> Martial Poise (Passive) New Effect - Kalista's auto attacks \"Deal only 90% of her total attack damage.\"\n\nI don't think so. Maybe the post on S@20 wasn't clear but it sounds like it just does 90% AD always.\n\nhttp://www.surrenderat20.net/2015/06/630-pbe-update.html#more","replies":[{"poster":"Sergeant Stephen","date":"2015-07-01T21:01:03.779+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=v14FG5us,comment-id=000100050000,timestamp=2015-07-01T20:41:17.072+0000)\n>\n> I don't think so. Maybe the post on S@20 wasn't clear but it sounds like it just does 90% AD always.\n> \n> http://www.surrenderat20.net/2015/06/630-pbe-update.html#more\n\nMaybe you're right, although it would make complete and absolute sense to only apply to hops. Anyway, the 90% makes it so that she has the same base AD as before, but items are 10% less effective.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-01T21:03:48.207+0000","up_votes":1,"down_votes":0,"body":"yeah, in which case they are nerfing her late game because they say she works too well with early AD which makes no sense.","replies":[{"poster":"Anidan","date":"2015-07-02T00:17:35.331+0000","up_votes":1,"down_votes":0,"body":"reduces the effectiveness of crit (not that she buys that very often) and, more importantly, life steal. It also reduces the effectiveness of her attack speed just that little bit before the inevitable Rend as well by way of reducing the power of her auto-attacks while not taking away anything from Rend itself. Sounds like they're trying to emphasize her early-mid game, so that if the late-game rolls around then literally every ADC in the game will out-scale her as \"payment\" for her large amounts of utility and mobility. Also guessing it helps against her power with early AD because it lets you duel her just that little bit easier with her now-weakened AA's before that spike of damage. \n\nJust a guess, though. I'm not Riot, and their reasoning could be completely different from how I'm seeing it.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T02:04:12.474+0000","up_votes":1,"down_votes":0,"body":"Those all seem like the kinds of power shifts this could cause, it just seems like there should be easier ways to achieve this.","replies":[]}]}]}]}]}]},{"poster":"Auroramancer","date":"2015-07-02T00:55:46.070+0000","up_votes":1,"down_votes":0,"body":"So that her AD ratios on spells aren't affected","replies":[{"poster":"AMYS GRAVE","date":"2015-07-02T01:26:44.244+0000","up_votes":1,"down_votes":0,"body":"Every champion has different AD scaling on spells, but every champion has 100% AD on AA. Consistancy and clarity would be nice here. I don't want to look up how much damage every champions AA do if they start messing with them.","replies":[]}]}]},{"poster":"SerBlaise","date":"2015-07-01T15:47:03.374+0000","up_votes":5,"down_votes":0,"body":"I believe the idea behind this is to make her more dependent on her abilities, especially Rend, since this is in essensce a small buff to her ratios. This way, while she can still hop around and dodge your skill shots, at least she wont be dealing as much per auto and she will have to wait for you to get into execute range to do her REAL damage. This is the kind of counterplay that is needed: it reminds me of Volibear late game; you sometimes need to wait for teammates to help you get the enemy into execute range before you can chomp down, since your autos are shit without your ultimate up.","replies":[]},{"poster":"IronWasabi","date":"2015-07-01T14:44:07.008+0000","up_votes":3,"down_votes":0,"body":"Speaks for itself. I mean, {{champion:429}}  is pretty pesky anyways.","replies":[]},{"poster":"Erockandroll","date":"2015-07-01T15:53:46.332+0000","up_votes":1,"down_votes":0,"body":"I think Riot got tired of seeing kiting, waveclear duelist Kalista. All  because she get's way too much mileage for pure AD and AS, and usually stacks both BT an BotRK. \n\nCombined with Runnan's, you have someone who will likely beat you in a duel, (or kite away if she can't) Clear minions fast and push like crazy. Extreme objective control. And she does it all without any Crit chance. Riot probably thinks that Kalista would have more counterplay if she only built more like a normal ADC. So they nerf her AD ratios, making her more reliant on crit chance.","replies":[{"poster":"SoMNia","date":"2015-07-01T20:04:09.403+0000","up_votes":2,"down_votes":0,"body":"Except that crit is a multiplicative damage increase, so this change decreases the viability of crit builds on her. I think they want her to use Rend smartly, and not have tons of upfront damage from chaining autoattacks and Qs in lane. That MIGHT explain why they simplified Rend's scaling. ~CLARITY~ XD","replies":[{"poster":"Erockandroll","date":"2015-07-01T20:26:14.772+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SoMNia,realm=NA,application-id=3ErqAdtq,discussion-id=v14FG5us,comment-id=00030000,timestamp=2015-07-01T20:04:09.403+0000)\n>\n> Except that crit is a multiplicative damage increase, so this change decreases the viability of crit builds on her. I think they want her to use Rend smartly, and not have tons of upfront damage from chaining autoattacks and Qs in lane. That MIGHT explain why they simplified Rend's scaling. ~CLARITY~ XD\n\npossibly, but Rend by itself is way were reliable thanks to it's slow. I don't have the patch notes in front of me, but didn't the remove the minimum damage to minions as well? That's is inevitably a nerf to the Runnan's build, and make it harder to wave clear.","replies":[]}]}]}]}