{"poster":"5050BS","date":"2016-03-14T18:11:42.951+0000","title":"Where is the Dev Corner for Zyra?  Its been 10 days since last mage Dev corner.","subforum":"Gameplay","up_votes":14,"down_votes":3,"body":"This is the one I care the most about and have been waiting weeks for.\r\n\r\nOn average the time between the Dev corner posts for the next mage is ~7 days\r\n\r\nIts been 10 now since last.  \r\n\r\nPLZ PLZ post the dev corner for Zyra!  Im busting at the seams here.","replies":[{"poster":"Dominick Destine","date":"2016-03-14T18:54:30.915+0000","up_votes":8,"down_votes":3,"body":"Watch out Zyra, I am a vegetarian\n( ͡° ͜ʖ ͡°)\n\nNo but seriously, I  tend to agree... feedback should be more forthcoming when it comes to Zyra, she is arguably the most confused, jarbled mess of a mage ... began as a mid, then became a support, ended as garbage.","replies":[{"poster":"ShadowParker","date":"2016-03-15T02:00:01.755+0000","up_votes":1,"down_votes":0,"body":"Don't hate on Zyra. She isn't a mess.","replies":[]}]},{"poster":"RiotRepertoir","date":"2016-03-15T21:38:11.231+0000","up_votes":4,"down_votes":0,"body":"Should be coming this week, I believe. Sorry for the delay.","replies":[{"poster":"Solidair3","date":"2016-03-15T21:48:24.068+0000","up_votes":1,"down_votes":0,"body":"Taric been keeping you busy? :3\n\n(Are you/did you do a podcast for Taric?)","replies":[{"poster":"RiotRepertoir","date":"2016-03-15T22:42:06.877+0000","up_votes":4,"down_votes":0,"body":"Quite busy. Actually I'm not sure if we're doing one for him. If they wanted me to, I wouldn't turn it down :)","replies":[{"poster":"Snaketits","date":"2016-03-17T02:16:40.915+0000","up_votes":1,"down_votes":0,"body":"So when are you going to come back to the Cass thread?","replies":[]},{"poster":"Solidair3","date":"2016-03-15T22:45:28.847+0000","up_votes":1,"down_votes":0,"body":"oh my goodness, that won't do at all! This is a big rerelease for a much beloved champ! We can't pass on a podcast for it!\n\nI will begin advocating for it immediately.\n\nThough I'm not really sure which board that would go on. I guess it's... sound?!","replies":[]}]}]},{"poster":"5050BS","date":"2016-03-17T00:08:44.392+0000","up_votes":1,"down_votes":0,"body":"ETA?  Sorry but this is the most important one to me and I really really want to see what your plans are so I can give feedback.","replies":[]}]},{"poster":"emreecheek","date":"2016-03-14T19:59:22.933+0000","up_votes":1,"down_votes":0,"body":"I've been checking these boards 2+ times a day ever since they did the Malzahar direction. And it didn't escape my notice that they were coming out at weekly intervals before ramping up to three days.  And now it's 10 days and counting. I'm really really REALLY keen to read what they have. Can we have a rough draft? Pretty please? :D","replies":[{"poster":"Peemama","date":"2016-03-16T04:51:46.687+0000","up_votes":1,"down_votes":0,"body":"HAHAHA I've been doing the same exact thing and I got worried they were gonna drop her or something! Its a relief to know I wasn't the only one.","replies":[]}]},{"poster":"IAMS4T4N","date":"2016-03-15T02:01:54.823+0000","up_votes":1,"down_votes":0,"body":"All Zyra needs is more plant-reliability and possibly a buff to base stats. A new passive would be nice too. I hope they don't change her too much to make her FOTM and then gutted shortly after (ahem{{champion:72}} {{champion:82}} )","replies":[{"poster":"Adonna","date":"2016-03-15T16:16:16.793+0000","up_votes":1,"down_votes":0,"body":"and un-nerf her base movement speed, upgrade the passive.","replies":[]}]},{"poster":"PopCorn Chick3n","date":"2016-03-14T21:28:49.472+0000","up_votes":1,"down_votes":0,"body":"I don't know.  I think I'm losing all my of hype for Zyra because it's just take so long get any information out of her.  I used to play her mid like around 2 weeks ago and then got bored of her because of how clunky her kit is. Everything about her is delay delay delay and more delay from her passive. Like damn, she is a squishy immobile mage, at least give her some kind of instant cc that stop the enemy from instant deleting her. Yes she does have strong cc like root and ultimate but it's so predictable and easy to avoid, a .75s root lvl 1, and 1 second knock up that has a delay of 2 seconds. Switching back to Syndra and might come back to Zyra if riot decides to fix them delay and better passive.","replies":[]},{"poster":"StoryDuck","date":"2016-03-14T20:56:09.262+0000","up_votes":1,"down_votes":0,"body":"As a new lover of Zyra I too am quite curious about her changes.  She is, by far, the one with the most room to get creative with.","replies":[]},{"poster":"macromite","date":"2016-03-14T20:10:20.571+0000","up_votes":1,"down_votes":0,"body":"could've sworn they already did zyra. maybe it was just a comment thread I read in one of the other ones.","replies":[]},{"poster":"OverpoweredSoap","date":"2016-03-14T18:12:12.993+0000","up_votes":1,"down_votes":0,"body":"Soontm","replies":[]},{"poster":"Jeddy017","date":"2016-03-14T20:05:17.613+0000","up_votes":2,"down_votes":3,"body":"Sweet Zeus,can you guys just wait?Have at little patience,it's coming.","replies":[]}]}