{"poster":"5050BS","date":"2020-01-15T04:26:50.013+0000","title":"Riot its NOT ok for Yasuo to heal so much with so little LifeSteal","subforum":"Gameplay","up_votes":2,"down_votes":3,"body":"Laning vs Yasuo he has {{item:1053}}  and {{item:3086}} \r\nConqueror and Bloodline (not even fully stacked)\r\n\r\nI chunk him to 25% hps and on the next wave he is healed to 90%\r\n\r\nThis is BS","replies":[{"poster":"iiGazeii","date":"2020-01-15T05:01:14.085+0000","up_votes":2,"down_votes":0,"body":"I understand where you're coming from, people have access to a ton of healing in-lane that allows them to avoid confrontation with their enemies and makes poke and sustained damage fairly useless. Someone running Conqueror, Triumph, Bloodline, Taste of Blood, and Ravenous Hunter has an insane amount of self-healing regardless of what is already in their kit. Some champions are supposed to have sustain as a weakness, and runes let you totally get around that. \n\nI'd be down to reduce the base lifesteal gained from Bloodline, but have it increase against champions (e.g., it scales up to 7.5%, down from 12%, but is increased by 2x against champions), and make it so that Conqueror only heals you when you damage champions. \n\nI think a lot of healing effects in the game could be changed to a shield. This would make it so that they still provide you in-combat sustain, but that extra health falls off outside of champion combat, so you can't just stay in lane forever.","replies":[]},{"poster":"ZephyrDrake","date":"2020-01-15T04:37:51.057+0000","up_votes":3,"down_votes":1,"body":"So... by \"little lifesteal\" you mean a crap ton of it? What do you consider a \"lot of lifesteal\" if this is \"a little amount\"?","replies":[{"poster":"5050BS","date":"2020-01-15T04:52:29.063+0000","up_votes":1,"down_votes":0,"body":"18% is little dude its literally one base item and runes.","replies":[]}]},{"poster":"XElite109","date":"2020-01-15T04:54:37.626+0000","up_votes":1,"down_votes":0,"body":"You know vamp is 10% conq is 15% and raves could be 5%-15%. Yas can crit so the effectiness of the healing is doubled which is why he heals so much.","replies":[{"poster":"5050BS","date":"2020-01-15T05:29:08.457+0000","up_votes":1,"down_votes":0,"body":"He didnt have ravenous.  he took resolve as second runes","replies":[]}]},{"poster":"Hotarµ","date":"2020-01-15T04:33:50.970+0000","up_votes":1,"down_votes":0,"body":"I kind of doubt he healed that much off of one wave while only having those two items.\n\n How early in the game are we talking? He had Legend: Bloodline, Sanguine Blade, a Vampiric Sceptre, and Doran's Blade.\n\n All things considered he _did_ have quite a bit of lifesteal goin' on.","replies":[{"poster":"5050BS","date":"2020-01-15T04:51:40.857+0000","up_votes":1,"down_votes":0,"body":"It was when he ONLY had those two items.","replies":[{"poster":"Hotarµ","date":"2020-01-15T05:14:41.812+0000","up_votes":1,"down_votes":0,"body":"I was after a specific timestamp. \n\nHe got a Vampiric Sceptre at 13 minutes. He also had 3 kills by that point, so assuming Legend: Bloodline was giving him a minimum of 5% lifesteal (tbh it's probably higher since he also has CS)\n\n10% from Vamp, 3% from Doran's, 5% from Legend: Bloodline for a total of 18% lifesteal. That is a _lot_ at 13 minutes and it would only continue to grow when he bought Sanguine Blade, another Vampiric Sceptre, and got more stacks of Bloodline.\n\n Again though, I doubt he got a full 60% max health off of one wave. Seems a bit excessive.","replies":[]}]}]},{"poster":"KFCeytron","date":"2020-01-15T04:42:51.479+0000","up_votes":1,"down_votes":1,"body":"What champion were you playing at the time?","replies":[]}]}