{"poster":"5050BS","date":"2018-08-09T03:51:42.089+0000","title":"Day 387 Still no fix for Zyra plant Health","subforum":"Gameplay","up_votes":12,"down_votes":7,"body":"Just LOVE hitting a 4 seed ult on the enemy team.\n\nLove Seeing them get knocked into the air.... Thats when I notice that all the ulted plants are dead.  Not one shot went off...\n\nLove Catching {{champion:21}} With E and plant two seeds behind her and Q.... to see her Auto attack each one and kill both before they get one attack off.\n\nLove Hitting {{champion:157}}  with E and spawning 4 plants around him... to see him E to each, killing them with each E and is now right on top of me.\n\nLove spawning 3 Plants to easily clear a wave as {{champion:245}}  is pushing into my turret.. to see him press Q and watch all plants die as the Timewinder return to him after killing all my minions too.","replies":[{"poster":"PooWho","date":"2018-08-09T06:22:14.907+0000","up_votes":8,"down_votes":2,"body":"Day 156 ---\n\nZyra is still zoning me and my support up to my turret, I wasn't able to dodge one of her 100 snares she's already thrown out, good thing I'm able to stop her plants from dealing 200 damage to me while she sits in a bush.","replies":[{"poster":"5050BS","date":"2018-08-09T10:32:18.174+0000","up_votes":2,"down_votes":2,"body":"Sorry you dont know how to auto attack plants and ward the bush.","replies":[]},{"poster":"Daddy Ants","date":"2018-08-09T10:16:37.351+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=PooWho,realm=NA,application-id=3ErqAdtq,discussion-id=EAOZl7aR,comment-id=0003,timestamp=2018-08-09T06:22:14.907+0000)\n>\n> Day 156 ---\n> \n> Zyra is still zoning me and my support up to my turret, I wasn&#x27;t able to dodge one of her 100 snares she&#x27;s already thrown out, good thing I&#x27;m able to stop her plants from dealing 200 damage to me while she sits in a bush.\n\nQFT.","replies":[]}]},{"poster":"Binding Eclipse","date":"2018-08-09T03:56:26.014+0000","up_votes":6,"down_votes":2,"body":"Preach. I mean Zyra is a strong addition to any team, but I'd give up a lot of her utility just to have her plants be...you know. Useful. You could remove them entirely from her kit, keep the numbers on everything else the same, and honestly she wouldn't feel all that different.\n\nSad.","replies":[{"poster":"Linna Excel","date":"2018-08-09T04:23:31.910+0000","up_votes":1,"down_votes":1,"body":"Removing plants from her kit is an interesting idea, but she'd need a new passive and a new W.  Any thoughts about that?\n\nPassive: Fertilizer - whenever a champion (ally or enemy) dies near zyra she gains a small amount of a bonus stat (max hp/mana or 4 AP).  \nW: Fruit of Life and Death - an AoE zone that lasts a few seconds, poisoning enemies in it and healing allies in it.","replies":[{"poster":"5050BS","date":"2018-08-09T04:28:27.720+0000","up_votes":3,"down_votes":1,"body":"Im sorry I like her plants.  They just need to make them more like {{champion:74}} for survivability.  \n\nThey have a 8s duration but NEVER live past 3s.   Just freaking make them take zero damage and only last for 6s.  Lower the damage but give them better AI and be done with it","replies":[{"poster":"Linna Excel","date":"2018-08-09T04:34:34.799+0000","up_votes":1,"down_votes":0,"body":"I like her plants as well, I was just trying a thought experiment on what would have to be done if they were gone.","replies":[]}]}]}]},{"poster":"Vanëssa","date":"2018-08-09T05:06:12.373+0000","up_votes":3,"down_votes":0,"body":"Don't firget fiora can just basic+hydra in 1 second and even ulted plants are dead.","replies":[]},{"poster":"hhaavviikk","date":"2018-08-09T09:03:16.107+0000","up_votes":2,"down_votes":0,"body":"yeah it's real sad how fragile her plants it, in early game it works out but in the late game, when around 70% of your damage comes from plants it feels bad when a slight breeze just vaporizes them and you're left with no damage.\n\nzyra Q has 0.6 AP ratio, E has 0.5 AP ratio and ult has 0.7 AP ratio so a grand total of 1.8 AP ratio on her entire kit without plants, make that 1.1 if ult is on cooldown meaning once you've utled and your plants died your damage is worthless, and your plants will die, to EVERYTHING.\n\nand don't forger using a W+W+E on a melee champion and watch them 1shot the plant before it can even attack","replies":[]},{"poster":"KVbqbFsC8e","date":"2018-08-09T10:09:26.227+0000","up_votes":2,"down_votes":1,"body":"Oh well. You already get to do the most damage in the game half the time.","replies":[]},{"poster":"KFCeytron","date":"2018-08-09T06:07:43.335+0000","up_votes":2,"down_votes":1,"body":"This is Season 8. Do you want Zyra's plants to live longer than champions? :P","replies":[]},{"poster":"Icy Hot Shoto","date":"2018-08-09T11:01:18.331+0000","up_votes":1,"down_votes":0,"body":"The best part? Riot at some point, as I've been told, changed her plants so they NEEDED to take... 2 autos. 2 AUTOS. to die. How many do they take? Just 1, usually.\n\nHonestly something does need to be done to her plants. As they are something she heavily relies on to be, well... Zyra... it's kinda dumb an adc can just walk up, auto once, and they're dead.","replies":[]},{"poster":"D357R0Y3R","date":"2018-08-09T10:57:39.699+0000","up_votes":1,"down_votes":4,"body":"your champion has 53% win rate and it's not enough?\n\nzyra the new ahri","replies":[{"poster":"Killer of Night9","date":"2018-08-09T12:35:52.247+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=D357R0Y3R,realm=EUW,application-id=3ErqAdtq,discussion-id=EAOZl7aR,comment-id=0006,timestamp=2018-08-09T10:57:39.699+0000)\n>\n> your champion has 53% win rate and it&#x27;s not enough?\n> \n> zyra the new ahri\n\nzyra doesn't have a dash or a heal.\nzyra defensive ability rely on a skillshot and a delayed knockup while ahri can use her passive,E and ult.\nI just wanted to play zyra as a mage rather than a support.\nEvery time that i play her mid lane i will mostly win the lane but i will fall off too fast ({{champion:63}} instead deal crazy damage in the entire game).\nHis spell has a very bad scale because they're balanced around the plant (which die really fast).\nI would appreciate if they revert his E buff to find a way to buff her mid-late game on her damage spell.","replies":[]}]}]}