{"poster":"Ugs","date":"2016-12-08T08:10:14.204+0000","title":"the fuq riot...","subforum":"Miscellaneous","embed":{"description":"Ugs / Bronze 4 0LP / 7W 3L Win Ratio 70% / Morgana - 18W 25L Win Ratio 42%, Sona - 11W 10L Win Ratio 52%, Orianna - 5W 9L Win Ratio 36%, Miss Fortune - 6W 4L Win Ratio 60%, Alistar - 0W 7L Win Ratio 0%","url":"http://oce.op.gg/summoner/userName=Ugs","image":"http://sk2.op.gg/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"okay so how the hell does this ranked business work ?\n\ni tracked my progress via op.gg mmr counter and it said 1300+ mmr \n\ni won 7/10 of my placement games and get put in bronze 4?  id expect at least silver 4/5?\n\nhow the hell does that work ?\n\nwtf riot?","replies":[{"poster":"Łæoña","date":"2016-12-08T08:33:18.452+0000","up_votes":3,"down_votes":1,"body":"Riot did say when they reseted the ranks for 2017 that once you have completed your placement games you will probably be placed lower than what your previous rank was. \n\nAlso in the pre-season or something, if you managed the climb a whole rank (I think it is or a tier or something) it will be put into consideration for your next placement games. \n\nAlso if your in a silver then it shouldn't be bad for you to climb out of bronze.","replies":[{"poster":"Ugs","date":"2016-12-08T08:35:14.858+0000","up_votes":1,"down_votes":0,"body":"awesome thanks for some clarification man yeah the climb should be easy i guess.","replies":[{"poster":"Łæoña","date":"2016-12-08T08:51:44.450+0000","up_votes":3,"down_votes":0,"body":"Don't worry man I believe in you!","replies":[]}]},{"poster":"Exarch Leona","date":"2016-12-09T00:28:00.539+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Łæoña","date":"2016-12-09T02:44:16.473+0000","up_votes":1,"down_votes":0,"body":"Lol I was placed in bronze V this season managed to climb to bronze 2 with 100LP. Just stopped cos I was stressing out because of too many 'inexperienced' players and exams. \n\nBad luck on getting the trolls on your team, I've had them before in my placement to bronze 1.\n\nAnd yes I do think its possible, if you think its not possible then you just probably playing without improving skill-knowledge.","replies":[]}]}]},{"poster":"Ninox","date":"2016-12-08T12:46:48.573+0000","up_votes":2,"down_votes":0,"body":"Chobi pretty much summed it up, you can find out more info here but it's not all that different from last season: http://oce.leagueoflegends.com/en/news/game-updates/competitive/2017-ranked-season-kicks\n\nIt is worth noting also that the mmr displayed on sites like op.gg will never be accurate, because they use their own calculations, not Riots (since Riot's are hidden). So while they are useful as a guide, they are not indicative of your true mmr, and will sometimes struggle to be even relatively accurate.","replies":[]},{"poster":"Montiness","date":"2017-01-27T04:01:29.146+0000","up_votes":1,"down_votes":0,"body":"Your performances during the game may have been poor, you might be locked closer to that rank from your last season rank. It doesn't let you get miles ahead of where you were. And apparently in OCE they use a sliding scale. Because the top players are worse than they were everyone gets to suffer for it with the new sliding scale, and they have brought in a lower rank for pretty much everyone this season.","replies":[]},{"poster":"Montiness","date":"2016-12-11T06:41:25.377+0000","up_votes":1,"down_votes":0,"body":"And also it's not the amount of wins you get, it's your performance in the games. Yes, winning games will usually mean you have a high number of structures, barons etc that give alot of gold and will increase your rating more than not having them, but it's not everything. Especially at that level.\n\nIf your KDA is less than 2, your cs (if you're a laner) is less than say 50 per 10 minutes, if you don't even bother about placing wards, that's a very bronze performance and you will be rated that way.\n\nGet LOLSUMO. it's reasonably accurate and you can look over those prov games it can access and see what areas of your performance were so bronze.\n\nLearn how not to die and you'll get a higher rank.","replies":[{"poster":"Ugs","date":"2016-12-20T09:50:56.506+0000","up_votes":1,"down_votes":0,"body":"i have lol sumo and got plat/diamond every game ? \n\nso i think that theory is out the window.","replies":[{"poster":"Montiness","date":"2017-01-27T03:58:15.344+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ugs,realm=OCE,application-id=Ntey9fRZ,discussion-id=X9fq8xoq,comment-id=00020000,timestamp=2016-12-20T09:50:56.506+0000)\n>\n> i have lol sumo and got plat/diamond every game ? \n> \n> so i think that theory is out the window.\n\nI used it to get an idea of where I'd end up in my ranked flex that was a fresh elo, and it was very accurate. I think the major thing was the shit teams I was getting that couldn't win a game to save their lives HAHA. But yeah, it is accurate. Riot I think place too much emphasis on winning or losing during provisionals.","replies":[]}]}]}]}