{"poster":"FB IANvv3","date":"2018-01-21T14:28:34.774+0000","title":"In-Game: Can't move, type, use abilities, or do anything, but I can see my team","subforum":"[ARCHIVED] Help & Support","embed":{"description":null,"url":"https://www.twitch.tv/videos/220580901?t=19h16m32s","image":null},"up_votes":3,"down_votes":0,"body":"I was just in a game where I could not do anything, but I could see my team moving and typing. Is there any known solution to this? I've gotten it in the past.","replies":[{"poster":"Broporo","date":"2018-01-22T02:16:59.638+0000","up_votes":2,"down_votes":1,"body":"Hard to tell which part you meant in that long video, but it sounds like you're having the same issue most Discord users are having lately. Discords overlay seems to be taking control and not allowing League to be the focus, so be sure to disable Discord's Overlay or simply disable Discord entirely.","replies":[]},{"poster":"Azarenai","date":"2018-01-21T21:05:05.657+0000","up_votes":2,"down_votes":0,"body":"Currently having the same issue in a ranked game. I cant even type to tell my teammates what's going on. Definitely a game breaking bug","replies":[]},{"poster":"Outšider","date":"2018-01-22T02:48:01.982+0000","up_votes":2,"down_votes":1,"body":"turn off discord overlay. http://prntscr.com/i3onw0","replies":[]},{"poster":"Outšider","date":"2018-01-21T23:24:30.161+0000","up_votes":2,"down_votes":1,"body":"Happening to me aswell","replies":[]},{"poster":"Eszkebounn","date":"2018-01-21T21:05:07.937+0000","up_votes":1,"down_votes":0,"body":"It happens to me too, but i live in México. Wich Brand is your modem my firend?, mine is Huawei model echolife hg8245h.","replies":[]},{"poster":"Ninja Man101101","date":"2018-01-22T01:54:00.993+0000","up_votes":1,"down_votes":1,"body":"Ive been having this issue as well, the only way ive found to get it working for me is to run the client as an admin. It currently happens to me every game I do when I just start league normally. I hope there can be an actual fix for this. I was just thinking it was my crappy computer.","replies":[]}]}