{"poster":"MologBal","date":"2016-08-25T06:39:39.591+0000","title":"Zed vs Zed","subforum":"Guias y consejos","up_votes":2,"down_votes":2,"body":"Queria mas que nada abrir un tema en relacion con una pregunta... &iquest;Como jugar con Zed contra otro Zed?,estoy aprendiendo a jugar con este campeon y la verdad es que las partidas que me fueron mas dificiles de jugar fueron contra un zed rival, usando yo uno igual. Queria saber que consejos utiles podrian ser aportados para poder perder el temor ante este tipo de partidas, inclusive jugadas y el manejo de la build o hechizos para poder tener un buen desempe&ntilde;o en una partida contra otro zed.","replies":[{"poster":"Fangtooth","date":"2016-08-25T07:30:56.124+0000","up_votes":2,"down_votes":0,"body":"Empeza con la E farmea mas que el, despues W, segui aumentando la E, desgastalo de lejos con W+E, cuando tire un shuriken que veas que erro o algo, tiras nuevamente W+E, activas la W de nuevo apareces al lado, activas señor del trueno y gg izi","replies":[{"poster":"LeonardoSB","date":"2016-08-25T07:39:57.585+0000","up_votes":1,"down_votes":0,"body":"empezar con la E? que consejo cutre, si zed tiene una fase de lineas pesima por lo que tiene que subirle la Q como skill principal, aparte si se sube la E directamente elimina toda posibilidad de farmeo tranquilo....\n\nyo recomendaria que viera videos en youtube de zed vs zed, porque la verdad que la unica diferencia es la habilidad individual de cada uno y la experiencia con ese campeon xD","replies":[{"poster":"Fangtooth","date":"2016-08-25T07:44:58.942+0000","up_votes":1,"down_votes":0,"body":"Mira al mejor zed coreano del mundo en una apuesta que hace contra otro zed.... despues veni y contame, lo mata casi quedando el full de vida sin si quiera darle un punto a la Q... mientras el otro zed estaba revoleando Q a todos lados como loco.","replies":[{"poster":"LeonardoSB","date":"2016-08-25T11:32:28.687+0000","up_votes":1,"down_votes":0,"body":"... amigo, el chabon está aprendiendo a jugar con zed, no tiene altas mechanics como para cumplir ese riesgo, y por lo que puedo deducir no sabe ni farmear, que empieze con la Q primero, y despues que busque su estilo de juego....aparte...estas comparando un coreano con zed con un chabon random de las, bien ahi pibe :v","replies":[{"poster":"Fangtooth","date":"2016-08-25T16:28:28.487+0000","up_votes":1,"down_votes":0,"body":"Si para vos hay que ser coreano para atinar una W+E... no me quiero ni imaginar en que division estas....","replies":[{"poster":"LeonardoSB","date":"2016-08-25T17:45:25.201+0000","up_votes":1,"down_votes":0,"body":"bueno como entendes lo que queres entender, ni me gasto en explicar, la proxima vez no opines mas en el foro de guias y ayuda....","replies":[{"poster":"Fangtooth","date":"2016-08-25T21:02:42.017+0000","up_votes":1,"down_votes":0,"body":"La proxima vez vos no te metas en los comentarios de los demas * * *","replies":[]}]}]}]}]}]}]},{"poster":"Quo","date":"2016-08-25T07:13:10.997+0000","up_votes":2,"down_votes":0,"body":"Por lo general los match-ups de espejo son dificiles porque mas que tener un campeon con daño requieres de habilidad con el, [no digo que seas malo ni te estoy juzgando ] al tener las mismas habilidades que el rival, conoces su cd, trata de combearle cuando el tenga en cd una habilidad suya, eso es clave para ese tipo de enfrentamientos, digamos que sabes que no tiene sombra ni shurikens, entonces tu puedes aprovechar eso para avanzarte y pokearlo con libertad :I","replies":[]},{"poster":"Slavik","date":"2016-08-25T12:38:19.581+0000","up_votes":1,"down_votes":0,"body":"Agrega y te ayudo,maineo Zed y conozco bien el matchup.","replies":[{"poster":"MologBal","date":"2017-08-22T00:26:53.079+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zyrus,realm=LAS,application-id=8sKIclmi,discussion-id=qd9azIN5,comment-id=0003,timestamp=2016-08-25T12:38:19.581+0000)\n>\n> Agrega y te ayudo,maineo Zed y conozco bien el matchup.\n\nTe envie solicitud","replies":[]}]},{"poster":"MologBal","date":"2017-08-22T00:26:15.657+0000","up_votes":1,"down_votes":0,"body":"{{champion:238}} gracias por los aportes, a pasado tiempo y puse a prueba sus consejos, gracias a todos. Igual últimamente lo uso un poco mejor que antes.","replies":[]},{"poster":"Sirek","date":"2016-08-25T13:48:18.915+0000","up_votes":1,"down_votes":0,"body":"El primer Zed que ultee de los  es el que perderá. Pongamos Zed A - Zed B.\n\n**A** ultea a **B**, **B** espera que aparezca **A** para ultearlo, **A** tirara el Combo pero **B** estara en el ulti no recibiendo daño, luego **B** aparecerá y la hará todo el burst con el combo al **A**. \n\nDe ahi, son solo cabezazos al teclado, pentakill :v","replies":[{"poster":"Gaunits","date":"2016-08-25T17:23:57.014+0000","up_votes":1,"down_votes":0,"body":"no siempre, jugue contra otro zed y yo ulteaba primero, esperas a que te ultee te moves con las sombras para esquivar sus Q y tiras tus Q gg","replies":[]}]},{"poster":"Moajretdian","date":"2016-08-25T12:56:56.282+0000","up_votes":1,"down_votes":0,"body":"poquealo y en cuanto puedas compra la faja de mercurio asi te sacas su marca de la muerte pero no lo tenes que lansar cuando el te ultea solo cuando aparece la marca","replies":[]},{"poster":"Vaendrys","date":"2016-08-25T08:26:32.507+0000","up_votes":1,"down_votes":0,"body":"Ultealo luego de que el te ulte,asi el tiene menos tiempo para generarte daño :)","replies":[]}]}