{"poster":"mannixc","date":"2015-09-02T15:32:15.371+0000","title":"Komme nicht aus der Bronze heraus","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":8,"body":"Ich habe echt kein Bock mehr auf das Spiel und zwar aus dem folgendem Grund, in der Bronze gibt es zu viele Noobs und da ist es fast unm&ouml;glich aus der Liga herauszukommen. Ich spiele jetzt 3 Tage lang jeden Abend 10-15 Spiele, und da gewinnt man 3-4 Spiele in der folge und dann wird man mit iwelchen Noobs eingeteillt und steigt fast wieder in die unterste Liga also Bronze 5 ab.\r\n\r\nIch will jetzt nicht sagen das ich in die Herausforderer Liga geh&ouml;re aber in der Bronze machts echt kein Spa&szlig; mehr, die normal sind einfach Rankeds verliere ich auch eig nie meine Lane, in jedem bin ich der der Top gewinnt weil ich mich jetzt auf Tryndamere fokusiert habe und dann gehe ich mid ganke weil meistens die Noob Jungler gar nichts machen und sehr oft liege ich am start dann weit vorne, obwohl Trynda ein schwaches Early hat, mit z.B. 5/0/2 aber dann hat meine Bot schon ihren Adc gefeedet und Mid f&auml;ngt auch iwas zu machen und feedet den Jungler usw und  dann fange ich auch die Lanes zu wechseln um das bisschen zu stoppen wenn ich sehe das die wirklich verlieren und dann fokusieren sie mich alle und am Ende stehts dann wie in meinen beiden letzten Spielen 8/7/8 und 11/11/14 und manchmal spiel ich dann mit normalen Leuten die vielleicht nicht besser sind als ihre Gegner in der Lane aber die lassen sich was sagen wie warte ich werde gleich kommen und die warten dann und feeden nicht und dann gewinnen wir auch wie vor ein paar Spielen 19/5/10 und 18/2/7.\r\nAber das Problem ist das ich dann 3-4 gewinne und dann 2-3 verliere, und so komme ich nie raus aus dieser Bronze mit den Noobs, am Anfang war ich Silber wo ich in die Rankeds kam aber dann dachte ich mir ich geh in die Bronze 5 mit den Noobs und arbeite mich wieder hoch, dachte aber nicht das das so schwer ist.\r\n\r\nHat da jemand Tipps?\r\nIm Last hitten bin ich eig ziemlich gut, die ersten 6 Minions habe ich immer, First Blood faktisch jedes Spiel oder jedes zweite.\r\n\r\nJetzt habe ich 3 Rankeds wieder verloren und es reicht mir wirklich bin so genervt von dem Spiel.\r\n\r\nDann kommt es faktisch jedes sagen wir mal 3 Spiel das jemand gar nicht spielt, er startet ranked und geht afk, wie gestern da kommt der Adc nach 25 min online und sagt crash. NACH 25 min!\r\nNat&uuml;rlich war das dann auch verloren.\r\n\r\nIch brauche Hilfe oder ich Deinstalliere das Spiel einfach.\r\nKein bock mehr auf Bronze.\r\n\r\nWenn es Smurfs gibt die in der Bronze sind und mit mir heraus wollen sagt bescheid, brauche nur einen adc oder Mid der nicht feedet und es ist genug den rest mache ich oder einen jungler ist ja auch egal.\r\nIch bin auch nicht der beste aber 95% der Spiele bin ich nicht schuld das wir verlieren\r\n\r\nLG","replies":[{"poster":"Reliable Support","date":"2015-09-02T19:01:40.007+0000","up_votes":4,"down_votes":0,"body":"Du heulst wegen AFKs und bist selber heute Afk gewesen, 21 Minuten lang, nie reconnected.. GG","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-09-02T16:25:55.369+0000","up_votes":5,"down_votes":2,"body":"Ja, es gibt in Bronze zu viele Noobs. Das Problem ist: du bist einer davon.\n\nUnd ja, ich darf das sagen, ich war selber 2 Jahre lang ein übelster Bronze-Noob. Und habe auf meine Mitspieler geflucht, weil die nicht wussten, wie man neben einer Karma Support spielt. \n\nIrgendwann hat es dann \"klick\" gemacht. Ich habe aufgehört, mich über meine Mitspieler aufzuregen und mich nur noch mit meinen eigenen Fehlern beschäftigt. Und mich gefragt, wie ich selber besser werden kann. Das Ergebnis: Ein Platin Rahmen.\n\nAber: Durch das Fluchen auf deine Mitspieler wirst du den nie erreichen. \nDas wichtigste ist: Beschäftige dich mit deinen Fehlern. Und setze auf eine Gewisse Selbstreflektion. Einfach nur um mal die Behauptung zu widerlegen, dass du jedes Mal deine Lane gewinnst und anfangs dominierst... [deine eigenen Statistiken](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2278614893/206419202?tab=overview): Klar, du bekommst in dem Spiel das First Blood... solltest du aber auch, wenn du Ignite dabei hast und der Gegner nicht. Viel schlimmer: Nach 15 Minuten stehst du 1-3... Am Ende hast du 13 Tode und eine KDA von unter eins... wer solche Spiele abliefert, darf sich einfach nicht mehr über seine Teammitglieder aufregen. Denn manchmal bist du es halt selber, der übelst reinfeedet. Aber das kommt vor. Selbst bei den Besten.\n\nDas ist auch nicht weiter schlimm. Schlimm ist es halt nur, wenn man diese Spiele ignoriert und felsenfest behauptet, dass man selbst ja immer alles richtig macht. Frage dich lieber, wie es dir passieren konnte, dass du trotz First Blood Gold und einem theoretischen Vorteil so untergehst. Kleiner Tipp: Es hat was damit zu tun, dass du auf der Lane bleibst und den Teleport von Yasuo nicht respektierst... \n\nUnd um noch einen Schritt weiterzugehen: Mit deinem selbsternannten \"main\" stirbst du pro Spiel 7 mal. Das ist (solange man nicht Annie spielt) einfach zu oft. Denn das sind ja die Durchschnittswerte, die durch die guten (oder 0-0-0 AFK Spiele) geschönt werden. Was wiederum bedeutet: In deinen Niederlagen stirbst du viel zu oft. \nIch habe für mich den Schlüssel gefunden: Wenn ich mehr als 10 Mal sterbe, habe ich den Sieg nicht verdient. Und wenn ich doch gewinne, hatte ich verdammt viel Glück und wurde von meinen Teammates getragen. \n\nVor allem gehe ich nach den Spielen meine Tode quasi noch mal durch. Und frage mich: War das wirklich nötig? War das vielleicht sogar richtig (kommt ja mal vor)? Und wenn nicht: wie hätte ich das vermeiden können. Wenn du dich nach jedem Spiel (selbst den gewonnenen) fragst, wie du weniger hättest sterben können. Und diese Erkenntnisse dann umsetzt... dann wirst du relativ schnell aus Bronze rauskommen.\n\nWenn du weiterhin glaubst, dass es an deinen Mitspielern liegt, wirst du ewig ein Bronze Spieler bleiben. Selbst wenn du einen Smurf findest, der dich da raus trägt, das wird nur dazu führen, dass du danach ohne ihn permanent verlierst. Es sei denn er ist nicht nur ein Smurf, sondern auch noch ein guter Lehrer... was aber für ihn schwierig ist, da ein guter Lehrer einen wissbegierigen Schüler braucht.","replies":[{"poster":"mannixc","date":"2015-09-03T14:40:10.951+0000","up_votes":1,"down_votes":3,"body":"Ok danke hast mir sehr weitergeholfen! :)","replies":[]}]},{"poster":"Artyst","date":"2015-09-02T15:36:04.219+0000","up_votes":2,"down_votes":1,"body":"\"Die ersten 6 Minions habe ich immer\" und danach hört es wohl auf ? :D","replies":[{"poster":"mannixc","date":"2015-09-02T15:41:04.399+0000","up_votes":1,"down_votes":3,"body":"Naa haha, die ersten sind ja die schwierigsten da man kaum schaden macht, damit wollte ich nur sagen das ich es kann, später ist es ja leicht, da eig auch aber später kann es jeder.","replies":[{"poster":"Patter91","date":"2015-09-02T15:43:26.839+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=mannixc,realm=EUW,application-id=ip27PlEH,discussion-id=V7BOF6ps,comment-id=00010000,timestamp=2015-09-02T15:41:04.399+0000)\n>\n>  damit wollte ich nur sagen das ich es kann\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/206419202\nAllein die Farmwerte sprechen dafür, dass du es _**nicht**_ kannst.\n\nErster Tipp: sieh ein, dass du genau so ein \"Noob\" bist und hör auf, dich besser zu reden, als du bist.","replies":[{"poster":"mannixc","date":"2015-09-02T15:46:53.979+0000","up_votes":1,"down_votes":3,"body":"Okey danke für den Tipp ist schon mal ein Anfang. :)","replies":[]}]},{"poster":"Artyst","date":"2015-09-02T15:43:25.522+0000","up_votes":1,"down_votes":0,"body":"Ok ^^\n\nVersuch dich aber weiterhin auf dein Spiel zu konzentrieren. Schau wer wo hilfe braucht. \n\nFlamen nimmt unnötig Zeit in Anspruch, diese Zeit kannst du verwenden um zu rotieren.\n\nGib calls und pings (ping am besten 3-4 mal damit sie es auch wirklich mitbekommen) so sollte das Spiel einfacher für dich un dein Team verlaufen.","replies":[{"poster":"mannixc","date":"2015-09-02T16:01:27.899+0000","up_votes":2,"down_votes":3,"body":"Ok danke, ja ich versuch mich mehr darauf zu konzentrieren.","replies":[]}]}]}]},{"poster":"Merriz","date":"2016-10-31T15:25:20.968+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=To8_s3cGF-8&t=604s\n\n\nwenn du nur 3 tage spielst wirst du dich auch nicht sofort raus carrien, das braucht nunmal etwas zeit","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2016-10-31T13:11:55.512+0000","up_votes":1,"down_votes":2,"body":"also ich wurde letzte season mit meinem account bronze 2 eingerankt und war innerhalb von ein paar tagen wieder silber 3","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-10-31T13:13:53.645+0000","up_votes":1,"down_votes":1,"body":"warte trynda hat ein schwaches early? TRYNDAMERE der größte noobchamp ever der trynda der mal kurz 35% crit free bekommt nen free heal hat nen dash hat und ne ult wo er nich stirbt hat","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-10-31T13:21:34.744+0000","up_votes":1,"down_votes":1,"body":"wenn du freiwillig nach bronze V gegangen bist heißt das das du getrollt hast oder das du einfach da hin gehörst","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2016-10-31T13:22:25.812+0000","up_votes":1,"down_votes":1,"body":"3-4 wins 2-3  loses also machst du +lp oder deine mmr ist so scheiße das du damit echt - machst","replies":[{"poster":"Sirrkas","date":"2016-10-31T13:49:31.728+0000","up_votes":1,"down_votes":0,"body":"Der Beitrag auf den du geantwortet hast, ist ein Jahr alt.","replies":[]}]}]}]}]},{"poster":"Abasin","date":"2015-09-03T06:43:45.717+0000","up_votes":1,"down_votes":0,"body":"Reduziere Deine Spieleanzahl. 10-15 ist enorm viel, umgerechnet fast ein voller Arbeitstag. Da bist Du am Ende so platt, dass die Konzentration einfach weg ist. Selbst wenn Du noch jung bist.","replies":[{"poster":"mannixc","date":"2015-09-03T14:42:51.148+0000","up_votes":1,"down_votes":3,"body":"Bald fängt die Schule an und da werde ich e vielleicht nur 1-2 Spiele täglich spielen.\n\nDanke","replies":[]}]},{"poster":"TGOxBl4ck","date":"2015-09-02T21:22:38.529+0000","up_votes":1,"down_votes":0,"body":"1. versuchen nicht zu sterben \n2. last hitten und viel CS machen wie nur geht \n3. SOLO  versuch nur auf dich zu schauen \n4. von mir aus Flame oder sonst was mir wayne musst nur mit dem Echo klar kommen ... aber wenn du eigentlich die 3 ersten Punkte zu Herzen nimmst dann hast du immer easy GG trust me !!","replies":[{"poster":"mannixc","date":"2015-09-03T14:43:19.077+0000","up_votes":1,"down_votes":3,"body":"Danke","replies":[]}]},{"poster":"i had fun once","date":"2015-09-03T10:07:08.566+0000","up_votes":1,"down_votes":1,"body":"Auf lange Sicht ist jeder da wo er hingehört. Nur weil man seine Lane stompt oder gut farmen kann ist das kein Sieg garant! Es gibt so viel mehr was in Skill reinfließt, was die unteren Elos nicht einsehen wollen.\nIch hab ein paar mal Bronze Leute hier ausm Forum in die F-Liste genommen und hier und da spectated um tipps zu geben.\n\nDie größten Fehler in Bronze sind mMn:\nPositioning, ihr rennt unsinnig in der Gegend rum oder steht als squishy kacke mitten drin\nGreeding, da wird nach Kills gegeiert und gechased als gäbs kein Morgen mehr, statt den Turm einzureißen\nWards, braucht man nicht, schaut eh keiner auf die Map. Awareness ist kaum vorhanden\nItems, Reines Ap Gegner Team? Nah ich bau trotzdem mal mein armor item, wie's im guide steht\nRunen, kaum Runen oder Meisterschaften, oder Seiten die einfach nur witzlos bunt gemischt sind\n\nAfk und rager spielen keine Rolle. Die gibts überall in jeder Elo in jedem Team. Solange man nicht selbst für schlechte Stimmung sorgt, ist die Chance das die Gegner so jemand haben höher. Und hört bitte auf Mitspielern ingame \"tipps\" zu geben wie sie zu spielen haben! Nicht hilfreich, führt nur zum tilt...","replies":[{"poster":"TGOxBl4ck","date":"2015-09-03T10:40:20.882+0000","up_votes":1,"down_votes":2,"body":"\"Auf lange Sicht ist jeder da wo er hingehört\" aha dann beantworte mir doch bitte die frage wieso es VIELE gibt die sich bessern ? ......\n\nDein Satz ergibt null Sinn ! \n\nJeder hat die Möglichkeit sich zu bessern und wird es auch früher oder später !","replies":[{"poster":"i had fun once","date":"2015-09-03T11:16:33.327+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TGOxBl4ck,realm=EUW,application-id=ip27PlEH,discussion-id=V7BOF6ps,comment-id=00080000,timestamp=2015-09-03T10:40:20.882+0000)\n>\n> \"Auf lange Sicht ist jeder da wo er hingehört\" aha dann beantworte mir doch bitte die frage wieso es VIELE gibt die sich bessern ? ......\n\nWeil sie sich bessern und auf längere Zeit betrachtet oben ankommen wo sie hingehören? Oder weil sie irgendwan in ihre Grenze kommen und längere Zeit im selben Bereich bleiben. Man verbessert sich aber nicht drastisch innerhalb von 10 Spielen. Man braucht schon paar mehr, also auf lange Sicht. Wo ist da der Fehler?\n\n> [{quoted}](name=TGOxBl4ck,realm=EUW,application-id=ip27PlEH,discussion-id=V7BOF6ps,comment-id=00080000,timestamp=2015-09-03T10:40:20.882+0000)\n> Dein Satz ergibt null Sinn ! \n> \n> Jeder hat die Möglichkeit sich zu bessern und wird es auch früher oder später !\n\nJeder hat die Möglichkeit, aber die Meisten werden es nicht! Der Großteil sitzt nunmal in Bronze und Silber. War schon schon in Season 1 so, wird auch in Season 6 so sein. Die Meisten sehen ihre Fehler einfach nicht ein und sind viel zu stur...","replies":[]}]}]},{"poster":"Final Rampage","date":"2015-09-02T15:48:54.952+0000","up_votes":1,"down_votes":2,"body":"hab dich als diablo geadded","replies":[{"poster":"mannixc","date":"2015-09-02T16:01:52.726+0000","up_votes":1,"down_votes":3,"body":"Ich nehme es gleich an ^^","replies":[]}]},{"poster":"kinglord33","date":"2015-09-02T19:54:30.282+0000","up_votes":1,"down_votes":3,"body":"Hab mich mit gragras und jarvan und heca  aus bronze raus gecarried aber ich glaub eher das sie zum zeit punkt echt stark waren ","replies":[]},{"poster":"Final Rampage","date":"2015-09-02T15:35:53.609+0000","up_votes":1,"down_votes":3,"body":"Kannst mir ne rückmeldung geben wenn du duoq spielen willst, würde dich dann adden","replies":[{"poster":"mannixc","date":"2015-09-02T15:40:06.216+0000","up_votes":1,"down_votes":3,"body":"Klar wieso nicht :) Ich schick dir dann ne Freundschaftsanfrage in paar Min","replies":[]}]}]}