{"poster":"Warlord of Noxus","date":"2016-06-25T15:37:12.513+0000","title":"Neue Gamemode Idee: Rollenspiel","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"Hallo Mitbeschw&ouml;rer :)\r\nich habe eine Idee f&uuml;r eine Spielmodi in LoL. Sie nennt sich Rollenspiel wie man am Titel erkennt. In diesem Modus geht er darum,Schlachten aus Runterra nachzuspielen.Dem entsprechend gibt es zum Modus noch neue Karten dazu:eine Ionia Karte,Demacia Karte,Noxus Karte und so weiter. f&uuml;r jede Schlacht gibt es vogegebene Champions zb. Noxische und Ionische Champions bei der Schlacht um Ionia. man kann aber auch Costum Games gestaltet werden. zuerst gibt man an ob man es nur mit Einladung betreten kann oder es frei f&uuml;r alle ist. Dann w&auml;hlt man die Nationen die gegen einander K&auml;mpfen und die Karte.Wenn man genug spiele gewinnt schaltet man Geschichtsfragmente frei, wenn man drei davon hat, erz&auml;hlt der Anf&uuml;hrer der Nation die Geschichte aus seiner Sicht.Es ist nat&uuml;rlich freiwillig ob man sie h&ouml;ren will. Was haltet ihr davon?","replies":[{"poster":"Uranbrennstab","date":"2016-06-27T10:32:05.971+0000","up_votes":1,"down_votes":0,"body":"Dafür ist das Lore doch viel zu inkonsequent.","replies":[]},{"poster":"Xipiz700","date":"2016-06-25T18:14:28.455+0000","up_votes":1,"down_votes":0,"body":"Denke die verschiedenen Schlachtfelder wären ein zu großer Aufwand für Riot, da sie ja den Ergeiz haben jede Karte per Hand zu malen, wie bei der KdB. Da dann auch der Gamemode ja im Grunde dir nur vorgibt welchen Champ man spielen soll, eher so meeh. Idee meinerseits wäre ein Gamemode wo zB. Team Freljord gegen Team Shurima spielen muss und einen nur die Picks eingeschränkt wären. Denke die Aram Map ist dafür am besten geeignet. MFG Xipiz700","replies":[{"poster":"Warlord of Noxus","date":"2016-06-26T09:20:09.288+0000","up_votes":1,"down_votes":0,"body":"das meinte ich ja. man bekommt champions aus der nation vorgegeben und dann wählt man einen aus. und ja das ist mega aufwendig aber man könnte es ja vereinfachen. wie du gesagt hast könnte man ja so custom nationen 5v5 machen.","replies":[]}]},{"poster":"Sao Paulo 21 22","date":"2016-06-25T18:07:13.233+0000","up_votes":1,"down_votes":0,"body":"Von der Idee gut, ich, glaube es ist nicht realisierbar, da es sehr sehr viel Arbeitsaufwand benötigen würde und Riot schon an vielen anderen Sachen arbeitet.","replies":[]}]}