{"poster":"Miarniar","date":"2016-01-04T00:05:44.604+0000","title":"Shaco immer behind?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"In letzter Zeit ist mir aufgefallen, dass ich mit Shaco dem anderen Jungler meist um mindestens 2 Level behind bin, egal was ich tue. Auch wenn ich viel mehr Kills und Items habe bin ich mit ihm gleichauf oder sogar behind. Kann mir vielleicht jemand sage, ob es eine M&ouml;glichkeit gibt diese Situation zu vermeiden? Oder hat jemand einen Tipp wie man mit Shaco schneller und effizienter farmt/levelt?\r\n\r\nSchonmal danke im Voraus!\r\n\r\nmfg. Miarniar{{champion:35}}","replies":[{"poster":"Revelate","date":"2016-01-04T00:11:33.019+0000","up_votes":4,"down_votes":0,"body":"zu viel Zeit bei Ganks verloren?","replies":[{"poster":"Der Wohltäter","date":"2016-01-04T02:08:52.897+0000","up_votes":2,"down_votes":0,"body":"Daran wird es wahrscheinlich liegen, passiert mir auch öfter.","replies":[]}]},{"poster":"Alustus","date":"2016-01-04T09:22:12.502+0000","up_votes":2,"down_votes":0,"body":"Eventuell dein Jungl weg, dein backport timing  oder gank timing.\n\nVllt findest du einen Shaco Main der dir das genau zeigen kann.\nAnsonsten kannst du vllt auf twitch nach einem solchen ausschau halten.","replies":[]},{"poster":"BooLakai","date":"2016-01-04T00:31:48.494+0000","up_votes":2,"down_votes":0,"body":"Ich denke das kommt auf die gegnerischen Jungler an. Zum Beispiel kommt ein Voli ja viel einfacher als ein Shaco durch den jungler vom clear speed her...","replies":[]},{"poster":"Miarniar","date":"2016-01-04T09:56:50.016+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für die Tips.\nNaja meistens mache ich am Anfang meinen Redbuff mit meinen Boxen und dann gehe ich in den Gegnerjungle  und versuche den Jungler zu töten, während er den Bluebuff macht. Wenn er auf der anderen Seite angefangen hat, stehle ich seinen Bluebuff und 1-2 andere Camps und gehe ich back oder ganke mid or top.","replies":[{"poster":"Flakies12","date":"2016-01-04T15:26:55.786+0000","up_votes":1,"down_votes":0,"body":"http://www.twitch.tv/shaclone schau was er macht. So Verkehrt wird es nicht sein. Schließlich war er mal mit Shaco Challenger. Glaube der streamt auch täglich.","replies":[]}]}]}