{"poster":"TheLegendd1","date":"2016-05-19T18:47:02.920+0000","title":"Season per favorire il boosting","subforum":"Discussioni generali","up_votes":6,"down_votes":7,"body":"Gioco di squadra? Poter fare premades per divertirsi con amici? Macch&egrave;! \r\nDi sicuro se ne saranno creati tanti di post simile a questo ma &egrave; un dato di fatto, la Riot &quot;vuole bilanciare, aiutare,etc.&quot; per rendere di pi&ugrave; il gioco &quot;di squadra&quot;. Anno precedente tanti problemi per molte persone che sono state boostate, purtroppo non potevano elimianre il problema quindi al soluzone: Premades da 5, &egrave; una presa in giro o cosa?\r\nSI parla di voler elimianre il boosting, di incentivare un gioco di squadra e poi si creano UNICHE code per premades da quanti vuoi. Dove lo vedete voi il gioco di squadra? Un gioco di premades semmai, dove il povero malcapitato di turno che se ne becca 4 di premades o si accoda a qualsiasi cosa facciano i premades o viene reportato o isolato (Per &quot;Cosa facciano i premades&quot; si intende che sia un baron con 5 persone che fanno a malapena 500 hp sommati, che altre genialate di questo calibro la cui lista sarebbe molto lunga). Cosa ancor pi&ugrave; divertente &egrave; che i pemades possono persino decidere di ignorarti e decidere di surrendarla appena arrivati i 20 per un semplice tf perso o perch&egrave; il loro amichetto deve andare a mangiare.\r\nCerto, ci sono premades che ti carryano, premades decenti etc.  \r\nAnche se attualmente sono pi&ugrave; le mie esperienze negative com tali persone che altro.\r\n\r\nE&#039; una contraddizione nonch&egrave; una farsa questa stagione, dove 4 bronzi pagando il platino/diamantino di turno (quindi persino un risparmio dato che possono smezzarsi la spesa :p) possono farsi dalla bronzo IV alla argento I/II se non anche gold in qualche sessione di partite, per&ograve; &quot;stiamo lavorando per risolvere tale problema&quot; quindi per la Riot la soluzione &egrave; &quot;la premade da 5&quot;, &egrave; una presa in giro o cosa?\r\nNon contenti di ci&ograve;, hanno persino pensato di elimianre la coda solo/duo dove almeno qualcuno avrebbe avuto una qualche possibilit&agrave; di sfuggire a tale giro vizioso : Tizio si fa boostare da bronzo ad argento I/I ad esempio e poi si ritrova in un elo non suo e, nel mentre naturalmente riscende, i team che se lo ritrovano devono sopportare non tanto la sua incapacit&agrave; nel giocare quanto la sua arroganza, dato che i punti non li ha fatti lui cosa pu&ograve; mai importargliene di trollare 1/2 partite, tanto &quot;I&#039;m silver I/II&quot; ripaga e risale, dov&#039;&egrave; il problema?\r\n\r\nEra proprio cos&igrave; difficile creare un sistema con entrambe le code che dessero stessi premi per i rank raggiunti per le normals cos&igrave; che chi fosse stato boostato grazie alle &quot;magnifiche&quot; premade da 5 potesse avere quel determinato elo solo in quella coda? \r\nEsistevano le ranked di team per una ragione ed i risultati tra quelle e le solo duo credo fossero abbastanza evidenti!\r\nPer&ograve; giustamente, cos&igrave; non si poteva forza il boost e quindi &quot;premades da quanti vuoi&quot; yeah!\r\n\r\nSemplice ragionamento: Le premades in una call daranno ragione agli unici 1/2 non premades o al loro amichetto che sta parlando con loro che fa una call del cavolo? Che domande! Come dire credi alla tua famiglia o ad un estraneo?\r\nCerto, ci sono i players con un briciolo di cervello che hanno il coraggio di dire all&#039;amico &quot;ehy amico, ma che diamine stai chiamando?&quot; per&ograve; diciamo sono molto radi.\r\nPer&ograve; League of Legends &egrave; &quot;un gioco di team&quot; (certo, con players tutti allo stesso livello che sono in grado di cooperare, cosa che se ne va alla malora quando si gioca con amici).\r\n\r\nE&#039; un post di frustrazione? Si, dopo tutte le partite fatte con la dovuta calma (io in partita non flammo mai, mi limito ad ammattirmi tra me e me o demolendo scrivanie xD) alla fine anche un santo perde la pazienza.\r\nQuesta al momento &egrave; la medesima situazione che si trovava gli anni precedenti dopo l&#039;estate &quot;tutti i bronzi boostati in argento&quot;, ed &egrave; ci&ograve; che &egrave; accaduto quest&#039;anno dato che preamdes da 5 ne fanno salire 4 alla volta.\r\nLAsciare la solo/duo per chi non ha altri 4 amici agli orari cui una persona si collega era troppo difficile, quindi yeah!","replies":[{"poster":"Bekkhi","date":"2016-05-20T08:07:55.303+0000","up_votes":2,"down_votes":1,"body":"Amante della soloq più totale presente! In 4 anni di ranked avrò fatto sì e no 20 duoq, se volevo rankare premade cercavo una squadra. Erano due code ben distinte, ognuna delle quali metteva in risalto determinate qualità del singolo giocatore. La soloq mi piaceva perché mi permetteva di misurarmi con me stessa, nonostante tutte le difficoltà date dal giocare con persone sconosciute. \n\nMa quest'anno mi sembra tutto una farsa. Non capisco perché si ostinino a voler lasciare la possibilità di rankare insieme a gente con così tanta differenza di Tier, sono anni che lo ripeto ma quest'anno il problema è ancora più pressante.\nPotessi decidere io farei gruppare in ranked solo all'interno dello stesso tier e magari inserirei la restrizione di rankare con gente appena aggiunta in friendlist dopo un tot di tempo, a meno che non ci si sia incontrati casualmente in una partita precedente. \n\nPoi, davvero, non se ne può più di avere contro gruppi di 3-4 premade compensati da un mmr medio lievemente più alto della tua squadra! Vi assicuro che mi è capitato spesso e lo svantaggio per chi non ha la coordinazione dei premade è evidente e non è per niente appianata da quel poco di mmr in più (che conta oggettivamente poco!).\n\nE basta con 'sta cosa che se non metti Support ti aspettano 5-7 minuti prima che ti trovi la partita, è diventato frustrante!","replies":[{"poster":"Floppyz","date":"2016-05-20T08:35:22.512+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Bekkhi,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0008,timestamp=2016-05-20T08:07:55.303+0000)\n>\n\n> \n> Potessi decidere io farei gruppare in ranked solo all'interno dello stesso tier \n\nMi pare funzioni già così, o meglio, la differenza non può essere di più di un tier.\n\n>e magari inserirei la restrizione di rankare con gente appena aggiunta in friendlist dopo un tot di tempo, a meno che non ci si sia incontrati casualmente in una partita precedente. \n\nMi sembra eccessivo e non arginerebbe comunque realmente il problema che vuoi affrontare.\n\n> E basta con 'sta cosa che se non metti Support ti aspettano 5-7 minuti prima che ti trovi la partita, è diventato frustrante!\n\nQuella non è una scelta di Riot, ma una conseguenza (matematica) delle preferenze dei giocatori. Come proponi di risolverla?","replies":[{"poster":"Bekkhi","date":"2016-05-20T08:46:01.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=00080000,timestamp=2016-05-20T08:35:22.512+0000)\n>\n> Mi pare funzioni già così, o meglio, la differenza non può essere di più di un tier.\n> \n> Mi sembra eccessivo e non arginerebbe comunque realmente il problema che vuoi affrontare.\n> \n> Quella non è una scelta di Riot, ma una conseguenza (matematica) delle preferenze dei giocatori. Come proponi di risolverla?\n\nNon è propriamente all'interno di un singolo tier. Io intendo proprio silver con silver, bronzi con bronzi, gold con gold etc. Ora l'intervallo è più ampio, troppo secondo me. \n\nIncentivare a giocare support in qualche modo, che ne so, più ip/qualche iconcina, non lo so. Io quasi preferivo le lotte per il ruolo della s5  a ora perché oggettivamente adesso la situazione è frustrante: fill=support, 1°ruolo qualsiasi/2°ruolo support= support, 1°/2° ruolo qualsiasi=10 minuti di attesa (almeno al mio elo, poi sopra e sotto non saprei). Cioè io quando ho un'oretta per giocare e voglio fare ranked mi trovo costretta a mettere support per non perdere 20 minuti tra matchmaking e selezione dei campioni.","replies":[{"poster":"Floppyz","date":"2016-05-20T08:53:45.723+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Bekkhi,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=000800000000,timestamp=2016-05-20T08:46:01.239+0000)\n>\n> Non è propriamente all&#x27;interno di un singolo tier. Io intendo proprio silver con silver, bronzi con bronzi, gold con gold etc. Ora l'intervallo è più ampio, troppo secondo me. \n\nUhm... forse ho capito quel che dici, e pure la motivazione; ma prova a guardare la cosa da un altro punto di vista: facendo come dici te ci sarebbe iniquità, perchè un silver V potrebbe codare solo con persone più brave, mentre un silver I solo con persone meno brave.\n\nCon il sistema attuale invece entrambi possono codare con bronze e silver, quindi potenzialmente sia con gente più brava che con gente meno brava. Credo sia per questo che è stato scelto questo criterio.\n\n> \n> Incentivare a giocare support in qualche modo, che ne so, più ip/qualche iconcina, non lo so.\n\nPure a me piacerebbe una cosa stile LFR di WOW (hai presente?) però dubito fortemente sia qualcosa che implementeranno, forse anche per paura che poi ci sia gente che codi solo per il premio, avendo quindi ripercussioni sui numeri della coda o sulla partita stessa, non so...\n\n> oggettivamente adesso la situazione è frustrante: fill=support, 1°ruolo qualsiasi/2°ruolo support= support, 1°/2° ruolo qualsiasi=10 minuti di attesa (almeno al mio elo, poi sopra e sotto non saprei). Cioè io quando ho un'oretta per giocare e voglio fare ranked mi trovo costretta a mettere support per non perdere 20 minuti tra matchmaking e selezione dei campioni.\n\nCapisco e non dev'essere bello, ma è anche vero che diversamente dalla coda vecchia, ora non è più necessario essere preparati per giocare potenzialmente tutti e cinque i ruoli, semplificando quindi la vita ai giocatori (poi ci sarebbe il discorso sul conoscere il gioco a tutto tondo, ma quello appunto, è un altro discorso).","replies":[{"poster":"Bekkhi","date":"2016-05-20T09:46:03.383+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0008000000000000,timestamp=2016-05-20T08:53:45.723+0000)\n>\n> Uhm... forse ho capito quel che dici, e pure la motivazione; ma prova a guardare la cosa da un altro punto di vista: facendo come dici te ci sarebbe iniquità, perchè un silver V potrebbe codare solo con persone più brave, mentre un silver I solo con persone meno brave.\n \nEffettivamente a questo non avevo pensato! Però è un po' la stessa restrizione che hanno i giocatori in platino, esclusi quelli in platino 1. Non lo so, io trovo assurdo che un Silver 5 possa potenzialmente giocare in ranked con un Gold 1, generando un falsamento anche nella squadra avversaria non indifferente. \n\n\n> \n> Pure a me piacerebbe una cosa stile LFR di WOW (hai presente?) però dubito fortemente sia qualcosa che implementeranno, forse anche per paura che poi ci sia gente che codi solo per il premio, avendo quindi ripercussioni sui numeri della coda o sulla partita stessa, non so...\n> Capisco e non dev&#x27;essere bello, ma è anche vero che diversamente dalla coda vecchia, ora non è più necessario essere preparati per giocare potenzialmente tutti e cinque i ruoli, semplificando quindi la vita ai giocatori (poi ci sarebbe il discorso sul conoscere il gioco a tutto tondo, ma quello appunto, è un altro discorso).\n\n\nNo, non lo conosco, saranno 15 anni che non tocco WoW :P \nBeh comunque anche ora si gioca per i premi, soprattutto dall'arrivo dell'Hextech crafting. Personalmente è dalla Season 3 che cerco di giocare al meglio 3 ruoli su 5, nello specifico mid-adc-support, e di sopravvivere nei restanti 2. Con l'arrivo della dynamic mi sono trovata parecchio in difficoltà perché mentre prima in chat si poteva discutere su chi poteva andare dove, ora la scelta si è ridotta a 2 ruoli soltanto, e nella maggior parte dei casi a 1 solo ovvero il support.","replies":[{"poster":"Floppyz","date":"2016-05-20T11:25:20.356+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bekkhi,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=00080000000000000000,timestamp=2016-05-20T09:46:03.383+0000)\n>\n> Effettivamente a questo non avevo pensato! Però è un po&#x27; la stessa restrizione che hanno i giocatori in platino, esclusi quelli in platino 1. Non lo so, io trovo assurdo che un Silver 5 possa potenzialmente giocare in ranked con un Gold 1, generando un falsamento anche nella squadra avversaria non indifferente. \n> \n\nSuppongo che le restrizioni che variano sulla base del tier siano dovute proprio al fatto che fino ad un certo punto la il rapporto skill/tier è abbastanza simile fra i tier adiacenti, mentre in alto questo cambia di più.\n \n> No, non lo conosco, saranno 15 anni che non tocco WoW :P \n\nIn pratica, anni fa hanno messo una coda per entrare in dungeon, dove scegli il ruolo, il dungeon e codi, poi il sistema ti teleporta dentro quando ha formato un gruppo da 5 con 1 tank 2 DPS e 1 healer.\n\nA un certo punto si sono resi conto che nessuno codava certi ruoli (perlopiù tank e healer), causando code infinite per i DPS, mentre i primi entravano istantaneamente.\n\nPer rimediare, Blizzard ha modificato il sistema, così che questo, all'atto di codare, informasse il giocatore che in quel preciso istante c'erano dei premi aggiuntivi se avesse codato con un certo ruolo (che evidentemente era poco scelto e stava causando un... ingorgo). Non ha risolto il problema, ma credo che abbia leggermente migliorato la situazione.\n\n> Beh comunque anche ora si gioca per i premi, soprattutto dall&#x27;arrivo dell&#x27;Hextech crafting.\n\nSì, ma non giochi un determinato ruolo (in cui potresti essere meno brava) per ottenere quei premi. :P\n\nPersonalmente è dalla Season 3 che cerco di giocare al meglio 3 ruoli su 5, nello specifico mid-adc-support, e di sopravvivere nei restanti 2. \n\nIo ho fatto la stessa cosa dalla season 1, pure con gli stessi ruoli, e all'inizio col terrore di dover junglare. :P\n\nCon l'arrivo della dynamic mi sono trovata parecchio in difficoltà perché mentre prima in chat si poteva discutere su chi poteva andare dove, ora la scelta si è ridotta a 2 ruoli soltanto, e nella maggior parte dei casi a 1 solo ovvero il support.\n\nQuesto è un modo di vederla, l'altro è che la discussione a cui fai riferimento, fin troppo spesso si trasformava in flame, quindi in pick fatti per dispetto, scontentando tutti. La soluzione che hanno adottato non è certo perfetta, ma credo abbiano deciso consciamente di rimediare ad alcuni problemi, pur creandone altri, come quelli di cui tu parli.","replies":[{"poster":"Bekkhi","date":"2016-05-20T11:43:18.980+0000","up_votes":1,"down_votes":0,"body":"Mmm no però magari giochi campioni con cui non sei bravo nella speranza di prendere un forziere :P\nE anche ora la gente si fa i dispetti, certe cose non cambiano mai ahah\n\nSeriamente parlando, hai ragione, il sistema perfetto non esiste. Questo di ora indubbiamente ha migliorato tanti aspetti e ne ha rovinati altri, ma è il primo anno quindi magari lo perfezioneranno nei mesi a venire. \n\nCondivido il tuo terrore della giungla, ho perso il conto delle partite che, tra S3 e S5, ho dodgiato perché costretta a junglare lol","replies":[{"poster":"Floppyz","date":"2016-05-20T12:10:19.773+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bekkhi,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0008000000000000000000000000,timestamp=2016-05-20T11:43:18.980+0000)\n>\n> Mmm no però magari giochi campioni con cui non sei bravo nella speranza di prendere un forziere :P\n\nIn normal, spero...\n\n> E anche ora la gente si fa i dispetti, certe cose non cambiano mai ahah\n\nSì, ma non più per scegliere il ruolo, tranne i pochi fulminati che codano x/y poi appena joinato pretendono il ruolo z. Ne conosco uno... E di solito rovina le partite, nonostante salga.\n\n> Seriamente parlando, hai ragione, il sistema perfetto non esiste. Questo di ora indubbiamente ha migliorato tanti aspetti e ne ha rovinati altri, ma è il primo anno quindi magari lo perfezioneranno nei mesi a venire. \n\nSperiamo. Diciamo che ci conto.\n\n> Condivido il tuo terrore della giungla, ho perso il conto delle partite che, tra S3 e S5, ho dodgiato perché costretta a junglare lol\n\nAhahah? Addirittura dodgiato? Io, molto più signorilmente, panicavo, prendevo l'unico jungler che per sbaglio avevo comprato (non è vero, me l'aveva fatto comprare un mio amico per arrivare al numero minimo per fare draft, quindi ranked), davo una spolverata alle masteries, e volavo su qualche guida per ripassare come si junglava in quella patch.\n\n...Tutto sommato non feeddavo neanche. Diciamo che finché rimanevo in jungla restavo indietro, e non davo un grande apporto, ma poi quando cominciavano i teamfight facevo il mio.","replies":[]}]}]}]}]},{"poster":"Dantazzo","date":"2016-05-20T08:56:30.104+0000","up_votes":2,"down_votes":2,"body":"La cosa ridicola è che puoi fare bronzo 5 silver 1, ma non gold 5 bronzo 1 che sono più \"vicini\" come distanza in divisioni.","replies":[]}]}]},{"poster":"kernel panic","date":"2016-05-20T13:38:10.889+0000","up_votes":1,"down_votes":1,"body":"Per me dovevano mettere 2 code separate.\n\n1 dyanimc queue tutti amici belli e felici\n\n2 soloq, senza nemmeno la possibilità del duo.","replies":[{"poster":"Dantazzo","date":"2016-05-20T15:53:24.963+0000","up_votes":1,"down_votes":0,"body":"Non lo faranno mai. La dynamic senza i solo non può funzionare e nessun solo è così scemo da andare in dynamic se ha a disposizione la coda in solo.","replies":[{"poster":"kernel panic","date":"2016-05-21T06:37:59.652+0000","up_votes":1,"down_votes":0,"body":"Allora devono ridurre la differenza di elo per poter fare dynamic, del tipo: gold V può codare solo con silver I e gold IV e così via.\n\nAlmeno si evita le situazioni ridicole di platini 2-3 che codano con i gold IV-III.","replies":[]},{"poster":"Bekkhi","date":"2016-05-20T16:23:23.788+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=000800010000,timestamp=2016-05-20T15:53:24.963+0000)\n>\n> Non lo faranno mai. La dynamic senza i solo non può funzionare e nessun solo è così scemo da andare in dynamic se ha a disposizione la coda in solo.\n\nEsatto. Ma io da brava ingenua all'annuncio dell'introduzione della dynamic seguita poi da una soloq pura ci avevo credo :(","replies":[]}]}]}]},{"poster":"Nabbomaster","date":"2016-05-19T19:34:56.439+0000","up_votes":3,"down_votes":2,"body":"4 bronzi pagano il diamante, e le lane contro i bronzi che fanno?","replies":[{"poster":"TheLegendd1","date":"2016-05-19T20:25:39.453+0000","up_votes":3,"down_votes":0,"body":"Gli basta rimanere sotto torre freezando la lane. Il diamante si fidda e distrugge gli altri.","replies":[]},{"poster":"Mytlix","date":"2016-05-19T21:19:07.836+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Nabbomaster,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0002,timestamp=2016-05-19T19:34:56.439+0000)\n>\n> 4 bronzi pagano il diamante, e le lane contro i bronzi che fanno?\n\ni bronzi alla fine vanno in lane contro i bronzi.Il diamante andrà contro un bronzo.\nQuindi supponiamo che il diamante andrà mid e dovrà andare contro un bronzo(già qui..) poi la bot:bronzo vs bronzo,top:bronzo vs bronzo,jng:bronzo vs bronzo chi vi vincerà? fammici pensare :D","replies":[{"poster":"Frattaglia","date":"2016-05-19T21:35:56.521+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Mytlix,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=00020001,timestamp=2016-05-19T21:19:07.836+0000)\n>\n> i bronzi alla fine vanno in lane contro i bronzi.Il diamante andrà contro un bronzo.\n> Quindi supponiamo che il diamante andrà mid e dovrà andare contro un bronzo(già qui..) poi la bot:bronzo vs bronzo,top:bronzo vs bronzo,jng:bronzo vs bronzo chi vi vincerà? fammici pensare :D\n\nDopo tre partite, si trovano contro gli argenti. Indovina chi vince le lane bronzo vs argento?","replies":[{"poster":"TheLegendd1","date":"2016-05-20T11:04:12.697+0000","up_votes":1,"down_votes":0,"body":"Alla fine se vanno in difficoltà, coem ho detto io freezano la lane stando sotto torre nel mentre il diamante si fidda e sbilancia le lanes.","replies":[{"poster":"Frattaglia","date":"2016-05-20T12:11:30.943+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TheLegendd1,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0002000100000001,timestamp=2016-05-20T11:04:12.697+0000)\n>\n> Alla fine se vanno in difficoltà, coem ho detto io freezano la lane stando sotto torre nel mentre il diamante si fidda e sbilancia le lanes.\n\nSaper freezare una lane (e aggiungo, farlo e contemporaneamente non rimanere troppo indietro rispetto al laner avversario... se non feedi perché sei zonato non vale in questo ragionamento, perché resti comunque indietro) richiede un livello di abilità superiore al bronzo.","replies":[{"poster":"TheLegendd1","date":"2016-05-20T15:49:28.065+0000","up_votes":1,"down_votes":0,"body":"Ciò che dici sarebbe vero in leghe alte quali platino/diamante/etc.\nTuttavia ina una partita bronzi vs bronzi dove nessuno conosce il valore del farm ci si troverebbe uno sotto torre con 20 minions in 20 minuti ed il tipo contro con 60 per dirti, l'abilità anche se ne farmasse 200 sempre da bronzo rimane.\nTempo che il diamante si fidda e puff, le altre lanes cadono sotto i suoi colpi.\nPensa una lane come la mid, va 3-0 senza neppure arrivare al liv 6 ed eccolo già in top/bot a sbilanciare le lanes.","replies":[{"poster":"Frattaglia","date":"2016-05-20T16:33:32.483+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TheLegendd1,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=000200010000000100000000,timestamp=2016-05-20T15:49:28.065+0000)\n>\n> Ciò che dici sarebbe vero in leghe alte quali platino/diamante/etc.\n> Tuttavia ina una partita bronzi vs bronzi dove nessuno conosce il valore del farm ci si troverebbe uno sotto torre con 20 minions in 20 minuti ed il tipo contro con 60 per dirti, l&#x27;abilità anche se ne farmasse 200 sempre da bronzo rimane.\n> Tempo che il diamante si fidda e puff, le altre lanes cadono sotto i suoi colpi.\n> Pensa una lane come la mid, va 3-0 senza neppure arrivare al liv 6 ed eccolo già in top/bot a sbilanciare le lanes.\n\nParliamo di bronzi che si trovano in lane contro silver, non bronzi contro bronzi.\nIo e un amico platino smurfando abbiamo fatto qualche partita premade con amici bronzi e silver... fidati che la partita te la feeddano uguale. Magari non vanno 0/4, ma se il laner nemico ha 50 cs di più è come se fossero 0/4. A quel punto non ce la fai più a carriare, specie perché anche gli avversari sono coordinati.","replies":[{"poster":"TheLegendd1","date":"2016-05-21T12:07:34.041+0000","up_votes":1,"down_votes":0,"body":"Nono aspetta, non ci siamo capiti xD \nIl diamante/platino smurfa con un account bronzo per boostare 4 veri bronzi in silver, i bronzi beccano bronzi vs bronzi, se poi vogliamo aggiungerci anche il boost al gold ora come ora è vero che i bronzi fidderebbero uguale ma tanto in silver ci sono più bronzi che veri silvers, quindi la situazione cambia di poco.\nGEnte tosta che fiddandosi vs i tuoi bronzi premade vince ne può capitare qualche partita senza alcun dubbio ma la maggior parte converrai che le vinceranno loro con il platino/diamante smurf =)","replies":[]}]}]}]}]},{"poster":"Mytlix","date":"2016-05-19T22:32:08.533+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=000200010000,timestamp=2016-05-19T21:35:56.521+0000)\n>\n> Dopo tre partite, si trovano contro gli argenti. Indovina chi vince le lane bronzo vs argento?\n\nfammici pensare xD","replies":[]}]}]},{"poster":"Whommy","date":"2016-05-20T12:53:41.075+0000","up_votes":1,"down_votes":0,"body":"è quello che succedeva purtroppo nel vecchio ranked team","replies":[]}]},{"poster":"Shinkansen1926","date":"2016-05-19T19:37:16.855+0000","up_votes":4,"down_votes":2,"body":"Capisco la tua frustrazione, io squadre di booster me le sono trovate contro in 2-3 partite e si riconoscono subito. Personalmente mi è venuto lo schifo di rankare, posso già fare soltanto 2-3 game al giorno se mi ritrovo anche booster e/o smurf contro che falsano la partita ciao.\nOltretutto il fatto che dimostra che è tutta una pagliacciata è che ho segnalato al supporto un giocatore boostato che conosco con tanto di prove e screenshot ma il giocatore in questione è ancora libero di giocare e rovinare l'esperienza altrui nel mentre che perde games e torna nel suo elo.\nVuoi sapere che idea mi sono fatto io? Intorno ai siti di eloboosting girano tanti, troppi soldi, per creare un sistema così ritardato come le code a 5 deve esserci per forza un interesse da parte dei programmatori.\nA pensar male si fa peccato ma...","replies":[{"poster":"Nabbomaster","date":"2016-05-19T19:48:33.395+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shinkansen1926,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0003,timestamp=2016-05-19T19:37:16.855+0000)\n>\n> Oltretutto il fatto che dimostra che è tutta una pagliacciata è che ho segnalato al supporto un giocatore boostato che conosco con tanto di prove e screenshot ma il giocatore in questione è ancora libero di giocare e rovinare l&#x27;esperienza altrui nel mentre che perde games e torna nel suo elo.\n\ne che prove sarebbero?","replies":[{"poster":"Shinkansen1926","date":"2016-05-19T20:11:27.299+0000","up_votes":3,"down_votes":0,"body":"Le partite esatte in cui hanno giocato al posto suo e confessione  involontaria scritta in chat sul client di lol. Non lo so, dimmi tu se basta o meno xD","replies":[]}]},{"poster":"TheLegendd1","date":"2016-05-19T20:24:32.836+0000","up_votes":2,"down_votes":1,"body":"La penso esattamente come te, non possono essere così sciocchi da non rendersi conto che è un aiuto enorme ai siti di boosting questa roba","replies":[]}]},{"poster":"Dainsleif09","date":"2016-05-19T19:34:46.582+0000","up_votes":2,"down_votes":0,"body":"beh quello che dici è sicuramente vero(dato che non sei neanche l'unico che ha fatto le stesse affermazioni anche prima di oggi):adesso il boosting è molto più semplice da realizzare e questo non è esattamente quello che si voleva ottenere,ma tieni conto che la riot ha ideato una coda del genere per porre fine a quegli infiniti post di lamentela di player che non salgono(neanche in duo)e hanno voluto dargli non solo la possibilità di salire più facilmente stando con un gruppo più numeroso,ma hanno anche messo la vittoria bonus quando ripeti le promo.\nle intenzioni erano buone e questo non lo possiamo negare,ma ovviamente si è rivelata un'arma a doppio taglio alla fine.\nper quanto riguarda il singolo player che gioca da solo con premade da 4 o doppi beh,il bullismo e l'abuso della maggioranza ci sono di sicuro,ma è anche vero che se tu sai ste cose non vai più da solo a fare ranked,ma provi a farti o il tuo premade o il tuo team o provi ad arruolarti in un team dato che qui le richieste non mancano ed inoltre;anche se le tue capacità per socializzare sono misere,non è difficile incontrare qualcuno in game con cui ti sei trovato bene,gli chiedi l'amicizia e poi ci giochi (e ripeti il processo).\nla frustrazione per casi come descritti da te è giustificabile(secondo me),ma andare a criticare un'opera fatta con delle buone intenzioni solo perché si ha la mente annebbiata dalla rabbia no.\nio sono di elo basso e da me afk e trolls erano il menu di 6 o 7 ranked  su 10,ma da quando hanno messo questa coda io mi sono trovato bene e meglio riducendo quel rapporto da 6 o 7 a 2 o 3 su 10,quindi per me è stato un cambiamento positivo(non dico per tutti,ma per me solo),poi lo trovo positivo perché rieduca nel modo giusto i player.\nmi spiego meglio: fare una solo q per il competitive,in cui si valorizza la potenzialità di un singolo individuo, in un gioco che si basa sul lavoro di squadra di 5 individui è...come dire....senza senso per me.\npoteva servire a migliorare le abilità del singolo(giustamente),ma questo rimane un gioco di squadra in cui le azioni si fanno assieme e non nel singolo quindi tu da solo puoi essere bravo quanto vuoi,ma se gli altri non riescono a seguirti,prima o poi cadrai a fondo insieme a loro;non subito magari,ma rimarrebbe solo una questione di tempo inevitabile . \ntutti coloro che scrivono il famoso \"se sei forte sali\" hanno ragione al 100% nel basso e medio elo,ma per il resto il ragionamento funziona solo al 20% dato che i restanti 4/5 si applicherebbero ai tuoi compagni.\nscusa questo giro lungo,ma avevo bisogno di rendere chiara la mia motivazione secondo la quale una soloq era sbagliata fin dal principio in un gioco come questo.\ndal mio punto di vista loro hanno introdotto una cosa che andava messo dalla partenza ed ora le persone si lamentano,perché erano abituate al vecchi sistema che valorizzava il singolo e non il gruppo;si esistevano i ranked team,ma ad una buona fetta di player non interessavano perché i premi di fine season non erano buoni come quelli della soloq,perciò erano incentivati a fare la soloq più che il team alla fine.\nper concludere direi che la coda dinamica non è perfetta,ma è stata fatta per accontentare e per una volta non farebbe neanche male guardare al di la del proprio naso e vedere anche gli aspetti positivi di essa.","replies":[{"poster":"TheLegendd1","date":"2016-05-19T20:37:02.205+0000","up_votes":2,"down_votes":0,"body":"Evito le partite con i premades proprio per evitare di incontrare anche premades contro o bilanciamenti fatti a caso, del tipo uno fa preamde argento-argento e poi trova oro (che stagione precedente era platino dato che questa season li hanno scesi tutti) con bronzo (che magari era argento e sa giochicchiare).\nL'unico aspetto positivo è la vittoria garantita con cui ci hanno dato il contentino sapendo che sarebbe successo ciò.\nSbagli se credi che la solo/duo non valorizzasse il team perchè con i continui aggiornamenti che hanno fatto tu non sei quasi più in grado di giocare da solo ma devi necessariamente affidarti al tuo team. \nUna volta dovevi imparare a dialogare/comunicare con gli altri 4 che erano anch'essi soli e fare gruppo, in un certo senso il game ti insegnava a fare gruppo (tranne nei casi in cui ebccavi tossici).\nPer quanto riguarda il fatto che le premade da più di 2 abbiano aiutato non ho il benchè minimo dubbio ma hanno aiutato quelle persone (tra cui quasi tutta la bronzo e la maggior parte dei tossici con esso) che si fanno aiutare a salire e che poi, ovviamente, da soli ridiscendono verso il loro elo.\n\nA me va benissimo se la RIot vuole fare una porcheria per il boosting ma che almeno separasse le 2 code!\nCode da più di 2 elo a parte, coda solo/duo altro elo ed alla fine stessa ricompensa per tutti, così è da solo può salire con altre persone che rankano sole, chi si vuole far \"aiutare\" si fa \"aiutare\". LE code ranked da 5 degli altri anni avevano L'UNICA differenza che non davano il bordino nelle normals, punto.  Davano comunque la skin,wards ed iconcina. Per risolvere tale problema bastava unificare i premi.\nNon andavano molto perchè lì ricevevi il premio solo per 10 partite vinte con la squadra e dovevi poi arrivarci a quel rank ed in quel caso i bronzini non era così facile carryarli per fargli prendere il premio dalla gold, inoltre solo lì potevano giocare ed il loro elo era lì un tot e nelle solo un tot.\nCon questa unificazione delle code io mi ritrovo gente che è stata \"aiutata\" a salire e, una volta raggiunto un rank non suo, ovviamente si trova in difficoltà/ si permette di essere tossica perchè non ha dovuto sudarseli tali punti, e quetsa season ne ho visti abbastanza (togliendo pochi casi).","replies":[{"poster":"Dainsleif09","date":"2016-05-19T21:18:40.493+0000","up_votes":2,"down_votes":0,"body":"concordo con la maggior parte di quello che hai detto e,per quanto continui a non piacermi l'idea di una soloq ranked,non vedo neanche dove sia il problema di rimetterla e non c'avrei niente contro se la rimettessero pure.\npoi il ragionamento sull'imparare a gruppare è relativo dato che non tutti lì volevano fare comunella,ma pensavano più al loro: nel mio caso solo un player su 20 games ha provato a coordinare la squadra(me escluso,nel senso che io provo sempre a coordinare il team),mentre gli altri andavano avanti e pensavano di vincere solo di kills(che tristezza),poi io sto cercando di diventare main supp(perché mi piace il ruolo ed ho anche acquisito molta esperienza grazie ad esso per ben 2 anni e mezzo di fila),però non riesco a giocare bene da solo o la solo lane,perciò io il mio elo me lo merito(in base alla mia abilità),ma difatti non vado mai a fare ranked da solo,perché so che  difficilmente riuscirò a fare qualcosa con la gente che anche tu hai elencato.\nsi potrebbe solo sperare in un adattamento o in nell'introduzione di un miglioramento futuro ^^ .","replies":[{"poster":"TheLegendd1","date":"2016-05-20T11:06:06.680+0000","up_votes":1,"down_votes":0,"body":"Mi auguro di si, perchè spero si saranno resi conto di aver perso abbastanza players per questa seson ...","replies":[]}]}]}]},{"poster":"Dr LouD","date":"2016-05-20T07:49:43.392+0000","up_votes":3,"down_votes":2,"body":"Season con la coda classificata sbilanciata? Si\n\nSeason per favorire il boost? No\nGli unici boostati che sto vedendo sono i classici da DuoQ, non ho mai visto un gruppo di premade  da 3-4 venir boostati.","replies":[{"poster":"TheLegendd1","date":"2016-05-20T11:09:13.650+0000","up_votes":1,"down_votes":0,"body":"Eh ma tu sei in platino, il carry da gold a platino con bronzi non è così facile come bronzo-silver o silver-gold.\nIo ahimè me ne trovo contro che in game(di rado)di queste persone.","replies":[]},{"poster":"Frattaglia","date":"2016-05-20T08:35:15.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=0007,timestamp=2016-05-20T07:49:43.392+0000)\n>\n> Season con la coda classificata sbilanciata? Si\n> \n> Season per favorire il boost? No\n> Gli unici boostati che sto vedendo sono i classici da DuoQ, non ho mai visto un gruppo di premade  da 3-4 venir boostati.\n\nConcordo, a mio parere è più difficile carriare come smurf dentro un gruppo premade rispetto a prima come smurf in solo/duo.\nAlla fine un gruppo premade di 4 o 5 si trova comunque quasi sempre contro un altro gruppo premade, e non si troverà certo contro una squadra materasso. Invece so anche io di un \"boostato\" in duo (lo metto tra virgolette dato che non è una cosa illegale, anche se però è parecchio meh).","replies":[]}]},{"poster":"lucanomax1994","date":"2016-05-19T20:23:23.823+0000","up_votes":3,"down_votes":2,"body":"***","replies":[{"poster":"TheLegendd1","date":"2016-05-19T20:41:35.338+0000","up_votes":1,"down_votes":2,"body":"Stesso pensiero ahahaha\nE si accorgerebbero rimettendo le solo/duo di quanti \"campioni\" si trovano in un elo molto inferiore al proprio!\nGià molta gente sta lasciando per questa porcheria di season perchè è una porcheria, eccetto per chi, ovviamente, ne sta abusando e sfruttando.\nRIpeto, mi sta bene che abbiano messo queste \"mitiche\" dinamiche ma devono dare anche la possibilità a chi è solo e si merita di salire di poter salire con le solo/duo, nelle quali almeno 1/4 ha un briciolo di cervello, cosa che se anche ci fosse nelle premades da quattro, comunque verrebbe affosato dal fatto \"dell'amicizia\" con quel tipo, mica tutti possono dire ad un loro amico in premade \"ehy, lo sai che stai facendo boiate su boiate?\", mentre risolvono la cosa con \"stiamo perdendo a causa del tizio premade\" che magari ah tipo perso un minion xD\n(lo so perchè in ts ne sento di tutti i colori e le partite le guardo xD)","replies":[]}]},{"poster":"Ringiel","date":"2016-05-19T19:08:25.800+0000","up_votes":3,"down_votes":5,"body":"basta joinare in 2 per evitare i premade da 4 ... non dirmi che non riesci a trovarti un compagno per duoqueue","replies":[{"poster":"DuckQuack0","date":"2016-05-19T19:50:14.757+0000","up_votes":2,"down_votes":2,"body":"Basterebbe togliere i premade dalle ranked e vedi quanti bronzi del c** se ne vanno al loro elo.\nBasterebbe solo quello, ma lasciamo sempre credere alla Riot che il premade è bello e divertente.\nNon so quanti ne vedo nel mio team di premade uno plat 4-5 e l'altro silver 3-4.... e sono gold 2","replies":[{"poster":"Frattaglia","date":"2016-05-19T20:22:30.796+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=DuckQuack0,realm=EUW,application-id=MJVj50Jw,discussion-id=T5MT2MmA,comment-id=00000000,timestamp=2016-05-19T19:50:14.757+0000)\n>\n> Non so quanti ne vedo nel mio team di premade uno plat 4-5 e l&#x27;altro silver 3-4.... e sono gold 2\n\nNon possono materialmente codare insieme. O non parli di ranked, oppure non è gente premade.","replies":[{"poster":"TheLegendd1","date":"2016-05-19T20:26:49.036+0000","up_votes":1,"down_votes":0,"body":"Probabilmente parla di platini 4-5 della season precedente che si ritrovano a quel rank","replies":[]}]}]},{"poster":"TheLegendd1","date":"2016-05-19T20:26:22.467+0000","up_votes":1,"down_votes":0,"body":"Non sempre, dato che ho poco tempo gli orari di connessione sono vari, senza contare il fatto che gli anni precedenti sono sempre salito da solo ed anche quest'anno contavo di farlo ma è davvero improponibile.","replies":[]}]},{"poster":"Killer SurpRyze","date":"2016-05-20T07:47:42.084+0000","up_votes":2,"down_votes":3,"body":"c'è poco da fare: lo dicono chiaramente anche nelle note delle patch, che per loro è importante bilanciare il gioco ranked solo dal diamante in su. Ranked di elo più bassi (o addirittura le normal, dove si continua a vedere oro e platini contro livelli 25), sono al completo sbaraglio. Tanto, finché la gente ci gioca, è libera di lamentarsi fin che gli pare senza che ai programmatori importi una sega. E giustamente, aggiungerei, visto che nessuno obbliga nessuno a giocare! (ed è per questo che non ho mai speso né spenderò mai un centesimo su questo o altri giochi)","replies":[]},{"poster":"Dantazzo","date":"2016-05-20T06:55:50.931+0000","up_votes":2,"down_votes":3,"body":"Io in sta season sto rankando poco niente, mi fa troppo schifo sta coda, ci avevo provato a ricominciare a rankare, per le prime 7/8 partite tutto ok, poi mi sono beccato un paio di partite coi gruppetti di premade e mi è salita la morte. Tanto in oro già ci sono, quindi chissene.\nComunque sì, anche io sto vedendo tanta gente che sta scalando le leghe perche fa premade con un paio di tizi che stanno una lega e mezza sopra di loro.","replies":[]}]}