{"poster":"Sigmund","date":"2015-03-26T22:38:37.017+0000","title":"Skarner infravalorado!","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Tenia 4800 Pi y me estaba pensando en comprar Skarner pero entre a un monton de discusiones en foroso diciendo que no valia la pena, que era malisimo y que su ulti era de las peores.... Pues les aviso que yo me compre a Skarner y tiene un late sorprendente si sabes armarlo bien dependiendo del enemigo ademas de que su pasiva y el Spam de la Q te ayudan a deletear a tu enemigo muuuy facil y si tienes mucha CDR tu W es spammeable y puedes alcanzar hasta al champ mas rapido de todo el bendito juego y su ulti pues... que decir? La gente la critica mucho pero justo jugue contra una fiora qu honestamente si no era por el jg osea yo no la ganabamos en todas las TF siempre ulteaba a la fiora para evitar que usara su ulti durante la tf y pues asi la ganamos ya que los demas eran fuertes pero sin fiora los haciamos pure! Les aviso que es un buen champ y cualquier persona que este dudando en comprarlo que lo haga porque es muy bueno aunque tiene un early bastante bajito pero limpia bien la jg! No se, senti la necesidad de hablar del campeon porque casi todos usan a los mismos champs en jg (lee, rengar y yi) un saludo! {{champion:72}}","replies":[{"poster":"zDooM","date":"2015-03-26T23:55:37.395+0000","up_votes":2,"down_votes":0,"body":"Skarner es muy bueno, si llegas a tener un buen early, después en el late sos imparable, el problema que esta de moda los junglas que usan los jugadores \"pro\" en los torneos y se olvidan que hay muchos campeones divertidos y fuertes.","replies":[{"poster":"Sigmund","date":"2015-03-27T03:50:01.462+0000","up_votes":2,"down_votes":0,"body":"Si revisas mi historial he jugado todo el bendito dia con skarner sin parar honestamente es un campeon demasiado de divertido de jugar {{champion:72}}","replies":[]}]},{"poster":"LGBT Valentina","date":"2015-03-27T02:42:19.560+0000","up_votes":1,"down_votes":1,"body":"Yo te explico, este juego desde la S2 (para mi) o S3, se juega a early, el late es algo que no existe mas\n70% se deciden en early\n\nes 1 mal champ? no\nEn late es ridiculo el tipico F-R y te  llevas al APC o ADC","replies":[{"poster":"Chill Your Mind","date":"2015-03-27T15:22:04.970+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"LGBT Valentina","date":"2015-03-27T21:59:44.471+0000","up_votes":1,"down_votes":0,"body":"no pibe\nvos confundis aguantar con llegar a late\n\nen la LCS no hay late, si te fijas las partidas pre20 ya sabes quien gana\nlos throws existen, pero de igual forma pre20 sabes quien gana por objetivos y la diferencia de gold\n\nSejuani ahora cuando llega al 6, ya es fuerte sola\nGragas casi ni se usa\nMao es igual que gnar, solo aguantan\nKog'maw te pensas que es solamente Late? nada que ver\nKalista solamante Late? nada que ver\nEzreal late?\nCassio, pega siempre la diferencia es que mientras mas tiempo pase, mas jodido va a ser jugarle por su sustain\nEl resto no voy a seguir repitiendo por que es lo mismo\n\nvos confundis mucho las cosas, aguantar no es lo mismo que jugar a late\nNo importa si van 0 vs 10 o mas y tiene mas TF, no tirar Surrender por el simple hecho es que saben que el otro team puede hacer throws y es lo que se evita a toda costa, por eso ves TF cada 5 min (Flash)\nen la LCS no se tirar Surrender","replies":[{"poster":"Chill Your Mind","date":"2015-03-30T11:11:40.711+0000","up_votes":1,"down_votes":0,"body":"No concuerdo, las throws no tienen nada que ver. Yo sigo insistiendo que cada vez aparecen mas campeones late game. \nY te aseguro que \"aguantar\"; no aguantan sin items, y eso es lategame.\nNo creo confundirlo, lo que si creo es que la meta de competitivo es demasiado patetica. Ahora que aparecen mas campeones con CC, es un chiste. Ayer vi a IWDominate utlear con Sejuani 3 veces al suport hasta darse cuenta que es un bronce focuseando. \nYo creo que en LCS se pierden demasiadas cosas del juego comparado con YOLOQ, obviamente lo mismo viceversa. Hay cosas que solo en esos niveles se pueden distinguir.\nDecime a que jungla pre20 se le cruzaba pickear los campeones de ahora en la s3, eso si era saber quien ganaba antes de los 20minutos.\n\nY te aseguro que por como juegan y lo aburrido que es, no me molestaria ver un poco mas de surrender. Lo que yo creo es que ultimamente estan perdiendo habilidad por tanto farmear. Salvo monstruos como WildTurtle que la tecnica y la capacidad de saber cuando entrar y no, la siguen teniendo\n\nSaludos!","replies":[{"poster":"Chill Your Mind","date":"2015-03-30T11:13:45.161+0000","up_votes":1,"down_votes":0,"body":"Estoy esperando que aparezcan los Morgana, Anivia, Karthus midlane S2 only farm. Riot puso demasiada vision en el juego que ya se perdio los divertidos 5v5 lvl 1 o esas incursiones lvl 3 en la jungla rival. \nY no me digas que \"el doble jungla\" que hacen en la jungla enemiga es invadir, porque esa pelotudez solamente la hacen sabiendo donde esta el equipo contrario, sino un sejuani y un hecarim (por ejemplo) no podrian nunca ganar un 2v2 con campeones decentes de early.\n\n**Buenos Humos** y que no caiga!","replies":[]}]}]}]},{"poster":"Chill Your Mind","date":"2015-03-27T15:21:29.121+0000","up_votes":1,"down_votes":0,"body":"Enserio te pensas que no hay mas late? Por favor, es patetico como los profesionales de NA y EUW juegan partidas de 60 minutos con una first blood minuto 20, dejate de joder.\nSejuani, Gragas, Maokai, Gnar, kogmaw, Kalista, Ezreal, Cassiopeia Janna, Lulu, Mundo, y asi nombraria varios de los campeones que viven usando los maricones estos que juegan a \"la estrategia\" y \"controlar objetivos\". MATEN A ALGUIEN POR DIOS.\n\nEn cuanto a {{champion:72}}, NERF PLS","replies":[]}]},{"poster":"Hyleen","date":"2015-03-27T13:12:47.163+0000","up_votes":1,"down_votes":0,"body":"{{item:3140}} y chau tu skarner :) tan simple como eso.","replies":[{"poster":"Runth","date":"2015-03-27T19:40:12.107+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hyleen,realm=LAS,application-id=v7qsfXsE,discussion-id=ryJPAfxV,comment-id=0007,timestamp=2015-03-27T13:12:47.163+0000)\n>\n> {{item:3140}} y chau tu skarner :) tan simple como eso.\n\n{{champion:12}}  {{champion:122}}  {{champion:104}}  {{champion:50}} {{champion:72}}  = Rekt su build","replies":[]}]},{"poster":"Runth","date":"2015-03-27T02:01:44.461+0000","up_votes":1,"down_votes":0,"body":"Para el escorpion mas feed en la jungla requiere observar quien esta feed del enemigo, ahi armaras la build\n\nComo jungla vas a tener algo de lentitud los gankeos no son efectivos si no eres nivel 6 y ni pienses hacerte el drake solo\n\nAhora los items, el item de jungla es mejor {{item:3713}} con el limpiaras rapido los mounstros en grupo y como mejora {{item:3725}} para tener mas vit pero no se su pasiva si sera rentable y el {{item:3723}} por si quieres un skarner agresivo\n\nLas botas es de tu eleccion , mas rapido en ganks? {{item:3117}} , un ad enemigo feed? {{item:3260}}  , mucho cc? {{item:3265}} \n\nEl resto de las build esta tal cual como dijo COF,\n\nAsi que skarnet infra....que... su pasiva esta op, buffearon la Q y E e.e","replies":[]},{"poster":"Revolución","date":"2015-03-27T01:42:27.993+0000","up_votes":1,"down_votes":0,"body":"Lo han re contra buffeado al escorpión, no está nada mal.","replies":[]},{"poster":"Zetsubou Billy","date":"2015-03-26T23:57:34.468+0000","up_votes":1,"down_votes":0,"body":"Que build recomiendan con skarner?","replies":[{"poster":"Sigmund","date":"2015-03-27T00:25:57.598+0000","up_votes":1,"down_votes":0,"body":"Depende pero yo trato de ponerme corazon de hielo {{item:3110}}  si tengo un enemigo de daño fisico y ademas me da 20% de CDR, cuando tienes 40% de CDR ya puedes spammear la W y no paras de correr rapido ademas te salva mucho y la R queda con 1 minuto de CD yo me pongo el item de jg de vida (+25% extra) y resistencia/armadura al gusto. La mejor opcion serian las botas amarillas {{item:3117}}  (esas super rapidas) o las de rapidez {{item:3009}}  tambien comprate el guante de hielo{{item:3025}}  o trinidad {{item:3078}} como mas te guste ambos son buenos segun lei pero aun no uso el guante, siempre me armo trinidad ^^","replies":[]},{"poster":"Mura x BLOOD","date":"2015-03-27T01:35:58.560+0000","up_votes":1,"down_votes":1,"body":"Yo maineo a este escorpionsito, Es de los mejores champs en este meta realmente\nEl orden de la build perfecta seria esta amigo :)\n\n{{item:3111}} - {{item:3723}} - {{item:3110}} - {{item:3078}} - {{item:3102}} {{item:3143}} \n\n{{item:3111}} Las botas de resistencia magica  sacalas siempre, aunque hayan puros AD porque te da tenacidad y con eso los slows                      se ven reducidos y podras perseguir mas a tu enemigo \n\n{{item:3723}} El item purpura para recuperarte en la jg y con encantamiento rojo para hacer mas daño\n\n{{item:3110}} El corazon de hielo porque te da CDR para spamear tu , 400 de mana y reduce la velocidad de los enemigos cercanos\n\n{{item:3078}}  Sacas trinity si vas bien, y si vas demasiado mal saca guantelete reemplazando a trinity {{item:3025}} \n\n{{item:3102}} Con el velo de la banshee podras iniciar bien la tf, si hay un ap demasiado feed y tu supp no tiene {{item:3190}}  haztelo    tu\n\n{{item:3143}}  Finalmente termina con randuin para asi aumentar la reduccion de velocidad de ataque de enemigos cercanos \n\nAsi seras la bestia ;)\nPD: Si vas mas o menos 8/0 en mid game hazte {{item:3142}} o {{item:3156}} \nPD2: Skarner Is Love, Skarner Is Life\n\n {{champion:72}}  {{champion:72}}  {{champion:72}}  {{champion:72}}  {{champion:72}}  {{champion:72}} {{champion:72}} {{champion:72}} \n\n","replies":[]}]},{"poster":"RNGesus","date":"2015-03-26T23:44:55.658+0000","up_votes":1,"down_votes":0,"body":"es que su ulti es como la de ww xD , almenos que el otro tenga fajin o algo/alguien lo salve , esa ulti es  una kill gratis al alcanze de un click  , dat mechanics","replies":[]},{"poster":"Tutancadead","date":"2015-03-26T23:26:53.285+0000","up_votes":1,"down_votes":0,"body":"un SKarner le gana un mano a mano a:\nKata fedada\nYi Fedado\nTrinda Fedado.\ny cre que a vyne\n\nEsto lo logra solo con el item de jungla, guantelete y Malla de espinas.","replies":[]}]}