{"poster":"Sigmund","date":"2015-03-21T01:46:36.109+0000","title":"Derrotas superan por mucho mis victorias","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"1. Bueno se que no soy la unica persona que le pasa esto pero bueno... Antes yo tenia por decir un ejemplo 50 victorias y 50 derrotas siempre andaban parejas una que otra ocasion habian 2 de mas o 2 menos pero bueno ahora actualmente mis derrotas son 70 mas que victorias y eso me entristece mucho {{champion:32}} y no es que sea mal jugador pero el sistema te pone aveces con gente demasiado pro en el otro team y en otras ocasiones a afks, trolls, gente que se arma nasus con velocidad de ataque y critico (por decir un ejemplo) y feeders y honestamente TODOS tenemos malas partidas y admito que en algunas es mi culpa pero dios si vieran como hay gente que juega de mal siendo ya lvl 30 que considero ya es un nivel lo suficientemente alto para tener por lo menos una idea de como no ser una carga para tu equipo pero bueno... Honestamente me deprime mucho porque en muchas ocasiones siendo yo el que mas he matado trato de carrear pero el team que me toca es incarreable porque feedearon hasta a la nami del otro team hahahah pero bueno me gustaria que el sistema de emparejamientos fuera un poco mas decente respecto a eso porque dios 70 derrotas {{summoner:3}}  extras es una cantidad grande! No digo que sea un pro jugando y tampoco soy lo mas manco de todo el LoL pero me gustaria que emparejaran con personas un poco mas \"decentes\" espero alguien lo lea y se sienta identificado y me ayude no se a por lo menos sentirme mejor porque me deprime ver mis derrotas {{item:3151}}  un saludo a todos y espero no sea de mal agrado para nadie.","replies":[{"poster":"Runth","date":"2015-03-21T03:01:11.707+0000","up_votes":3,"down_votes":0,"body":"{{champion:54}}  Soy tan duro que las derrotas para mi no existen","replies":[]},{"poster":"bleachwill","date":"2015-03-21T02:17:45.528+0000","up_votes":2,"down_votes":0,"body":"a mi me pasaba aveces que entraba en rachas de derrotas largisimas \npero empeze a jugar menos entonces cuando jugaba lo hacia con mis campeones favoritos y desde entonces tengo rachas de victorias aunque juego poco\ntambien puede ser que te importen mucho tus compañeros\nejemplo: \n                 yo solia preocuparme mucho por las opiniones de mis compañeros y de sus scores, solia dejar toda kill posible \n                 \n                    hasta que me di cuenta que hay muchos trolls, flamers, niños, noobs, etc\n\n                      entonces empeze a silenciar a mis compañeros, a escuchar musica para relajarme, a tomar todas las kills que necesite para carrielear y a jugar ''mi juego''. entonces me di cuenta de que no es tan dificil ganar si me concentro en mi juego \n\n                    y desde ese momento empeze a tener muchas mas victorias que derrotas","replies":[]},{"poster":"I Love KaiSa","date":"2015-03-21T02:03:02.755+0000","up_votes":2,"down_votes":0,"body":"150 derrotas mas que victorias al comenzar la season tenia. ahora tengo 4 derrotas mas que victorias.\n\nEs simple. Tenes que ver lo positivo de cada derrota y victoria que tenes. Asi vas aprendiendo de tus errores para no volver a cometerlos y por ende ganas.","replies":[]},{"poster":"Lunari Red Mask","date":"2015-03-21T18:17:09.778+0000","up_votes":1,"down_votes":0,"body":"Encuentro tu punto de vista deplorable, pues acabo de ganar una partida donde la he carreado y termine 4/12, siendo que el asesino de mi grupo quedo de 40/10 o así. Ya te digo que sí lo único que te importa es matar, no vas a ganar una partida nunca, los objetivos son los importantes, un equipo que tenga 5 dragones puede ganar una partida por más que el otro equipo lleve más asesinatos. El objetivo del juego es simple, solo destruyes el nexo y ganas. \nY respecto a los campeones, cada uno los usa como quiere, no es raro ver un Nasus AP mid que juegue y gane mejor que un nasus de 600 cargas full tanke. No hay malas decisiones, hay malos jugadores pues que no saben sacar provecho.\nY ser level 30 no es garantía de jugar mejor, en pocos meses, incluso menos se llega a lvl 30, he visto lvl's 30 con 10 o 20 victorias en total.  Sobre el emparejamiento, se trata de una cosa simple, mientras más victorias tengas mejores jugadores te van a tocar -lease que debes ganar más de lo que pierdes-. Asíque no me sorprende que te toque con gente horrible, cada que perdes es como sí te pusieran \"jugador sin habilidad\" o, para que a jugadores ranked que me lean tengan ideas \"es como sí te bajaran de categoría\". \nMi única recomendación es que practiques, juegues menos para que tu habilidad suba más -mientras más juegos por día haces, más cansado es, por más que no lo notes- y juegues en un momento de mayor felicidad, pues jugar con sentimientos negativos lleva inequívocamente a la derrota. Lo mismo sí eres muy susceptible a los maltratos, aquí no tenemos una comunidad, tenemos un montón de gente rata que juega para devorar a los demás y sentirse de esa forma mejor consigo mismos. Tienen un valor de ellos tan alto que se dedican a ser tóxicos con los demás. Y sí no te gusta el bullyng, este no es tu juego.\nSaludos y mejor suerte la próxima.\nPD: invitar a jugar a amigos o jugar para divertirse cambia mucho el enfoque, sí solo te dedicas a ver que tantas victorias y derrotas tienes, te pondrás competitivo y caerás de victima de bullyng a creador del mismo.\n{{champion:11}} {{summoner:11}} {{summoner:31}}","replies":[{"poster":"Sigmund","date":"2015-03-21T23:16:59.271+0000","up_votes":1,"down_votes":0,"body":"Un poco duro tu comentario pero tienes mucha razon pero no me digo que \"feedearse\" sea sinonimo de \"carrear\" pero hay que admitir que la mayoria de las veces van de la mano al parecer en tu caso no fue asi pero bueno... y pues si me he vuelto muy competitivo pero cuando juego con amigos no se como que desaparece esa ira al perder me da igual y ademas casi siempre ganamos cuando es con amigos ^^","replies":[]}]},{"poster":"Kanzaki Ranko","date":"2015-03-21T17:50:53.190+0000","up_votes":1,"down_votes":0,"body":"Una vez spameas tu main y encuentras champs divertidos, las victorias vienen solas xDD\n\nYo tenía 50 derrotas más que victorias, ahora tengo +90 victoria sobre derrotas.","replies":[]},{"poster":"KGrisly","date":"2015-03-21T05:11:56.437+0000","up_votes":1,"down_votes":1,"body":"Desinstala el LOL :v\nSon cosas que pasan, te toca la gente que trolea, segui jugando hasta que no pase y si no juga con amigos\n\"gente que se arma nasus con velocidad de ataque y critico \", aclaremos que eso no es troll de ninguna manera\n\n\"me deprime ver mis derrotas\", es un juego y tu vida no depende de este no tenes razon porque deprimirte","replies":[{"poster":"Sigmund","date":"2015-03-21T08:26:58.115+0000","up_votes":1,"down_votes":0,"body":"Aclaro que por \"deprimido\" tampoco es que me sienta re-emo por dios se toman todo 100% literal pls es una manera de decirlo para no llegar a otros terminos ^^ se que es un juego y no me referia al ejemplo de nasus como \"troll\" si no como alguien que no sabe armarlo","replies":[]}]},{"poster":"LuLuu","date":"2015-03-21T07:00:44.188+0000","up_votes":1,"down_votes":0,"body":"Emm mientras te toquen esas cosas raras en normal, no te hagas problema y divertite (se que es mas divertido ganar que perder, pero es preferible encontrarte esas cosas raras en normal que en ranked, obviamente desde mi punto de vista).\nIgual es un juego no te deprimas, muchos entran a probar builds, ver el ping que tienen (pocos son los que hacen eso antes de mandarse a ranked) o si es que tienen lag... {{summoner:31}}","replies":[]}]}