{"poster":"SlyTactician ","date":"2016-02-09T20:34:38.614+0000","title":"Blood Moon Kennen! Thank you Riot!","subforum":"Story, Art, & Sound","up_votes":92,"down_votes":8,"body":"https://1.bp.blogspot.com/-zvDIGHRtR7w/VrpEWb_P2lI/AAAAAAAA31M/ykcufCmNwsY/s1600/kennen1.jpg\n\nI have made several topics about wanting a new Kennen skin, and I really do want to show my appreciation for this awesome new skin you guys made for Kennen! It looks fantastic, and I&#039;m glad that all three of the Kinkou Order now have Blood Moon skins now! Very well made Riot and thank you from us Kennen fans! :D\n\nThe summoner icon is just icing on the cake too!","replies":[{"poster":"moonstones","date":"2016-02-09T20:35:37.611+0000","up_votes":29,"down_votes":0,"body":"Glad you like him! Have you seen his particles yet? :3","replies":[{"poster":"Zielmann","date":"2016-02-09T20:42:38.706+0000","up_votes":12,"down_votes":0,"body":"About time! It's only been 6 years since he *should* have gotten it >.>\n\nBut really, I'm pumped. Got all his skins so far, and I'll certainly add this one to the mix! I'll have to hop on PBE after work and have a look.","replies":[{"poster":"moonstones","date":"2016-02-09T20:48:39.706+0000","up_votes":12,"down_votes":0,"body":"I'd love to hear what you think after you take him for a spin!","replies":[{"poster":"boringmonsters","date":"2016-02-09T20:55:14.989+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=6kFXY1kR,discussion-id=eklgL5mu,comment-id=000000020000,timestamp=2016-02-09T20:48:39.706+0000)\n>\n> I'd love to hear what you think after you take him for a spin!\n\nWhere can i see him? I wanna see the skins","replies":[{"poster":"moonstones","date":"2016-02-09T20:57:00.925+0000","up_votes":6,"down_votes":0,"body":"He's on PBE, looks like surrenderat20.net has some coverage. :]","replies":[{"poster":"boringmonsters","date":"2016-02-09T21:09:11.386+0000","up_votes":2,"down_votes":0,"body":"Oh,ok. And when will a new lissandra skin come out?  I really want one. Maybe an 1350/1820 or 975 rp skin?","replies":[{"poster":"moonstones","date":"2016-02-09T21:12:09.382+0000","up_votes":8,"down_votes":0,"body":"Can't say, sorry!","replies":[{"poster":"PapaGreg21","date":"2016-02-09T21:25:59.293+0000","up_votes":3,"down_votes":0,"body":"Great skin. Riot really nailed it on that one. Passes the \"I don't play this champion but want to try now that he has a skin I like\" test.","replies":[{"poster":"moonstones","date":"2016-02-10T00:22:16.508+0000","up_votes":5,"down_votes":0,"body":"Right?! I don't play him, but I really want to pick him up now!","replies":[]}]}]}]}]}]},{"poster":"Rew711","date":"2016-02-09T22:33:29.506+0000","up_votes":1,"down_votes":0,"body":"Hey... I'm scared to ask... can Kennen's Blood Moon skin... still have Yordle ears? (please don't hurt me)","replies":[{"poster":"moonstones","date":"2016-02-09T23:12:34.729+0000","up_votes":5,"down_votes":0,"body":"Not for this particular skin - we opted to keep the similar head shape this time around with the mask.","replies":[{"poster":"Bultz","date":"2016-02-09T23:38:06.030+0000","up_votes":1,"down_votes":0,"body":"this is a bit off topic, but how is the new Yasuo skin looking? Kennen looks amazing, but when i saw Yasuo, i was like {{sticker:slayer-pantheon-rainbows}} , then i was like ummmmm......{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"moonstones","date":"2016-02-10T00:21:07.975+0000","up_votes":1,"down_votes":0,"body":"He's pretty much complete, but feedback is welcome!","replies":[{"poster":"Bultz","date":"2016-02-10T00:22:34.315+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=6kFXY1kR,discussion-id=eklgL5mu,comment-id=0000000200000001000000000000,timestamp=2016-02-10T00:21:07.975+0000)\n>\n> He's pretty much complete, but feedback is welcome!\n\nCool, its hard to tell, but are his pants baggy? Yasuo without nice baggy pants makes me sad.....","replies":[{"poster":"moonstones","date":"2016-02-10T00:37:56.564+0000","up_votes":2,"down_votes":0,"body":"They're not super baggy, no. Just loose fitting. ^-^","replies":[{"poster":"2ManyJons","date":"2016-02-10T06:37:21.852+0000","up_votes":1,"down_votes":1,"body":"So Yasuo gets another skin, but Diana the MOON THEMED CHAMPION cannot get a blood moon skin.","replies":[{"poster":"moonstones","date":"2016-02-10T16:58:03.622+0000","up_votes":2,"down_votes":1,"body":"Diana's slated for a fire-themed skin later this year 'cause she won the All Star vote!","replies":[{"poster":"2ManyJons","date":"2016-02-11T06:33:38.319+0000","up_votes":1,"down_votes":0,"body":"But if you guys knew you were going to have more blood moons released soon, would it not have made sense to just put Yasuo on the fire-ice vote and give Diana a blood moon this time?\n\nAlso, instead of the fire skin being just being Diana with new orange particles, can it be sun  related and us get something cool like Solari Diana?","replies":[{"poster":"moonstones","date":"2016-02-11T06:54:21.022+0000","up_votes":2,"down_votes":0,"body":"We already had Blood Moon Yasuo in early stages of development, among other skins for other champions, which is why he and the others weren't selected as options.\n\nWe haven't stated exactly what the skin will entail, aside from being some soft of fire-theme. She won't be sun related, though.","replies":[]}]}]}]},{"poster":"Zedex","date":"2016-02-10T13:56:38.828+0000","up_votes":1,"down_votes":0,"body":"Unrelated, but is Blood Moon Yasuo supposed to have a new song for his flute? I ask because all of his skns so far have changed his flute and song in some way, but Blood Moons is the classic song. Any reasoning behind this? \n\nHigh Noon is only 975, and has one, so it seems overlooked to me, since this will probably be priced at 1350(the particles are amazing, I've been waiting for the red particles on a Yasuo tornado)\n\nAny reasoning?","replies":[{"poster":"moonstones","date":"2016-02-10T16:57:42.258+0000","up_votes":1,"down_votes":0,"body":"Hey! \n\nI don't believe we're making adjustments to the flute for this particular skin. I don't have a reasoning - this isn't something my pod worked on, but I can bring it up to them as feedback. \n\nThis skin is currently priced at 975 RP, as a heads up. :]","replies":[{"poster":"Zedex","date":"2016-02-10T17:45:39.397+0000","up_votes":1,"down_votes":0,"body":"My face when I read that its going to be 975\n\nhttps://imgflip.com/readImage?iid=15382441\n\n\nSeriously awesome skin though, I was actually hoping Yasuo was going to receive a Blood Moon skin after you released some last year, thanks for delivering such an awesome skin and splash!{{champion:157}} ","replies":[{"poster":"moonstones","date":"2016-02-10T19:03:41.801+0000","up_votes":2,"down_votes":0,"body":"Thank *you* for the feedback! :D","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"SlyTactician ","date":"2016-02-09T20:37:26.921+0000","up_votes":3,"down_votes":0,"body":"I actually haven't! :0\n\nBut I definitely will once I can see some clips of him in action! Loving his look and I bet his particles will be fantastic as well! :D This really makes my day!","replies":[{"poster":"moonstones","date":"2016-02-09T20:38:09.462+0000","up_votes":6,"down_votes":1,"body":"That's great to hear! ^-^ Lemme know whatcha think!","replies":[{"poster":"SlyTactician ","date":"2016-02-10T05:02:24.321+0000","up_votes":1,"down_votes":0,"body":"I've seen the gameplay video for him and all I can say is ...WOW!\n\nHis reddish-blue particles for his electricity looks epic and I love how well made his ult and E animations are especially! Just so fluid and perfect! So glad you guys chose this skin design for him! ^_^ First day buy for sure!","replies":[{"poster":"moonstones","date":"2016-02-10T17:04:56.072+0000","up_votes":2,"down_votes":0,"body":"Ahh, so glad you dig the skin! I've been anxiously waiting for this guy to make his debut. I think he's an excellent addition to the Blood Moon line, and has been a popular player idea for a long, long time. ^-^","replies":[]}]}]}]},{"poster":"Meep Man","date":"2016-02-09T20:38:45.111+0000","up_votes":3,"down_votes":0,"body":"Unfortunately not, the PBE is still down for maintenance. I like him though. The Summoner Icon makes me think Kennen is really young though, mainly due to his size combined with the more child-like expression of his mask, seemingly more like one of those demons that would trick and mislead you than actually hurt you directly.","replies":[]},{"poster":"NichtHurz","date":"2016-02-10T23:28:42.586+0000","up_votes":1,"down_votes":0,"body":"Really awesome particles, I like them a lot. Just one thing I saw in Surrender@20's Skin Spotlight. While everything he does is red and has red lightning, his \"charged\" autoattack still has blue lightning on it when thrown. If there's any chance to change these particles to red as well it would add some kind of consistency in particle effects to the skin. The blue lightning inbetween all those cool red particle effects doesn't feel right. \n\nIt's just a small thing and you wouldn't recognize it too often, but it still seems out of place. :)","replies":[{"poster":"moonstones","date":"2016-02-11T00:38:41.523+0000","up_votes":2,"down_votes":0,"body":"That's a known issue, and I believe we're making changes to that. :]","replies":[]}]},{"poster":"Jeddy017","date":"2016-02-10T05:22:12.471+0000","up_votes":2,"down_votes":0,"body":"It's good that Kennen finally got to join in on the Blood Moon fun his ninja buddies enjoyed for years.","replies":[]}]},{"poster":"dunkeroni","date":"2016-02-09T23:44:51.015+0000","up_votes":9,"down_votes":0,"body":"whoa whoa whoa whoa whoa.\n\nwhoa.\n\nYou seem to have made a mistake. Kennen skins are supposed to be flat recolors. Here you have things on his head... and a thing on his arm, and the shuriken has a shape to it that definitely doesn't seem like a flat recolor. So I say to you, sir, go back and try again. Get rid of the cool helmet, ditch the awesome hair, bin the fancy jacket and get back to work in MS Paint.","replies":[]},{"poster":"Riot iZac","date":"2016-02-10T00:58:44.540+0000","up_votes":5,"down_votes":0,"body":"Love seeing people notice and enjoy new particles. Had a great time make'n this dude's FX.","replies":[{"poster":"brian rad","date":"2016-02-10T01:41:22.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot iZac,realm=NA,application-id=6kFXY1kR,discussion-id=eklgL5mu,comment-id=0009,timestamp=2016-02-10T00:58:44.540+0000)\n>\n> Love seeing people notice and enjoy new particles. Had a great time make'n this dude's FX.\n\nJust played a game with the new skin. I been dying for a Blood Moon Kennen so he can be just like the other ninjas! The FX are on point! His E looks sooooo EPIC, and that ulti so INSANE!!! The red lightning is freakin awesome! Oh and that recall animation! Very nice!","replies":[{"poster":"Riot iZac","date":"2016-02-10T04:41:48.006+0000","up_votes":6,"down_votes":0,"body":"ya'll gunna make me blush! I just wanted to give Kennen the skin he deserved after all this time :P","replies":[]}]},{"poster":"Kindlejack","date":"2016-02-10T16:47:24.804+0000","up_votes":3,"down_votes":0,"body":"Ladies and gentleman a warm welcome to the boards for Mr Riot iZac. Lurker status revoked!","replies":[]}]},{"poster":"Tesla Effect","date":"2016-02-09T21:29:34.939+0000","up_votes":6,"down_votes":2,"body":"http://vignette1.wikia.nocookie.net/leagueoflegends/images/3/31/Shen_BloodMoonSkin.jpg/revision/latest?cb=20160120002551\n\nI like how we can see both Blood Moon Zilean, as well as masks for Blood Moon Kalista, Yasuo, and Kennen in the background of Blood Moon Shens splash art.","replies":[{"poster":"Kindlejack","date":"2016-02-10T16:49:20.489+0000","up_votes":1,"down_votes":0,"body":"Me too! Now just gotta wait for an Akali rework to bring her into the fold >:P","replies":[{"poster":"Merxamers","date":"2016-02-10T17:05:24.046+0000","up_votes":2,"down_votes":0,"body":"I kinda hope you guys don't change Blood Moon Akali's splash art; independent of the skin quality, it's my favorite piece of art in the game.","replies":[]}]}]},{"poster":"RoadkillsRevenge","date":"2016-02-10T21:46:41.823+0000","up_votes":3,"down_votes":0,"body":"Thanks for the thanks SlyTactician!  as a Kennen fan myself I've been waiting for this skin for a long time :D.","replies":[{"poster":"SlyTactician ","date":"2016-02-10T22:11:07.076+0000","up_votes":2,"down_votes":0,"body":"No problem and great work with this one! About time we Kennen fans surge out into the rift in style! xD","replies":[]},{"poster":"Forbidden Zed","date":"2016-02-16T16:07:47.751+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RoadkillsRevenge,realm=NA,application-id=6kFXY1kR,discussion-id=eklgL5mu,comment-id=001b,timestamp=2016-02-10T21:46:41.823+0000)\n>\n> Thanks for the thanks SlyTactician!  as a Kennen fan myself I've been waiting for this skin for a long time :D.\n\nCan i add you lol i like fellow kennen mains regardless of my name :P lol","replies":[]}]},{"poster":"Biff Manly","date":"2016-02-10T04:58:46.344+0000","up_votes":1,"down_votes":0,"body":"Wow, Riot is remembering a lot of the old champs. \n\n\"Oh riiiight, {{champion:63}}. Hey, what's this over here? \"{{champion:38}}\" huh? Cool, we'll give these guy new skins in between the next set of Nidalee skins.\"\n\"Oh woooow, {{champion:85}}! Y'know, the ninja yordle? Let's give him a skin, why not?\"\n\nMeanwhile {{champion:14}} and {{champion:78}} basically got all their skins re-released, with {{champion:44}} soon to come.\nAnd the shambling {{champion:83}} discgraceful {{champion:6}} horrors {{champion:50}} of the league cry.","replies":[{"poster":"Kindlejack","date":"2016-02-10T16:55:02.940+0000","up_votes":3,"down_votes":0,"body":"Part of our goal at Riot this past year was to try to make a skin for almost every champion. We didn't quite make it, but we're hardly done! Some skins, like Kassadin and Kennen, were in development for a long time. Some of those older champs are hiding a bunch of tech debt, or need a lot of vfx and animation work to get them up to our current standard for skins. It's always tricky to have to diplomatically say 'we haven't forgotten about any champion, and are only excluding upcoming reworks' when I really want to say 'there's an awesome Kennen skin coming!'\n\nBut now I can share my excitement, at least for Kennen!","replies":[{"poster":"Eapenator","date":"2016-02-10T16:57:54.449+0000","up_votes":1,"down_votes":0,"body":"Hey KindleJack,\n\nDo you think there is any chance for a Sion skin anytime soon?\nJudging by the fact that he has received a complete visual and gameplay update, he shouldn't have any of the tech problems that are involved with champions like kassadin and kennen? Yet he hasn't received a skin for 2 years. \n\nThanks\n\nEdit: I wanted to add that while sion's skins got updated with his model, they are terrible in my opinion, as they have no particles, no new backing animations, no VO's or anything. It makes it so that Sion's base skin is so much better than the other options that I have zero motives to purchase those skins, when I could just purchase a much more high quality skin. \n\nSion has so much space for a cool high quality skin, along side a visual and gameplay update that seems squandered. I know Sion has the least skin usage in the game, (a comment that was mentioned by another rioter at some point), but isn't that just because his he doesn't have a good skin?\n\n He also has a really low pick rate, so I don't know whether that factors into your decision (making a profit is important), but I am sure Sion will get more popular if he got an awesome skin ( he currently is a very balanced and fun champion so it's not like he is bad). ","replies":[{"poster":"Kindlejack","date":"2016-02-10T17:33:55.191+0000","up_votes":3,"down_votes":0,"body":"We haven't forgotten about any champion, so he's on our radar and are only excluding upcoming reworks which are currently Taric, Yorick, Warwick and Urgot. I can only publicly talk about skins that have been released on the PBE though because anything we are working on up until then has a chance of changing, or being shelved. Such is the nature of development.\n\nHaving said that I definitely agree with you >:)","replies":[{"poster":"DeathBurst","date":"2016-02-10T17:47:45.340+0000","up_votes":2,"down_votes":1,"body":"I find a bit sad that you refrain from communicating just in case things might change along the road. Sure, all these comments about Ao Shin may be a tad annoying sometimes, but I'd still prefer a more open system where you tell us on what you work, and where we understand that \"working on something\" is not a promise that it will be released, soon or ever.\n\n(This is a general opinion about Riot policy, not specifically about skins ;) )","replies":[{"poster":"Kindlejack","date":"2016-02-11T03:58:33.851+0000","up_votes":1,"down_votes":0,"body":"Unfortunately it's more than annoying comments on Ao Shin. Ultimately what it comes down to is the cost vs benefit for players. The disappointment, frustration and confusion from having to cancel projects such as Magma Chamber completely outweigh the benefits. We still share exciting content ahead of launch, but only once we are 100% certain that it _will_ go live. We've also been doing Q&As and development articles to share our experiences after the case.","replies":[{"poster":"Arakadia","date":"2016-02-16T06:47:52.029+0000","up_votes":1,"down_votes":0,"body":"Why was Magma Chamber canceled?","replies":[{"poster":"Kindlejack","date":"2016-02-16T06:49:25.988+0000","up_votes":1,"down_votes":0,"body":"I wasn't working at Riot at the time but I believe (if I remember correctly) the reasoning they gave was that in testing it just wasn't fun and played like a more punishing slower SR.","replies":[]}]}]}]}]}]}]}]}]}