{"poster":"FD John Cena","date":"2018-03-12T05:57:04.667+0000","title":"Ban Permanente","subforum":"Comportamiento del jugador","embed":{"description":"Boards","url":"https://boards.las.leagueoflegends.com/es/submit","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":6,"down_votes":8,"body":"1. &gt; Hola buenas noches tarde o ma&ntilde;ana les vengo a decir o mejor dicho vengo a reclamar un ban yo juego en la cuenta esta hace mas de 5 a&ntilde;os o mas creo no se la verdad, nunca llegue hasta este punto. Mi reclamo esque si me pueden devolver la cuenta o que puedo hacer porque yo admito que eh flameado pero se que me flamearon tambi&eacute;n y tampoco es un flameo intenso en la cual si seria un ban permanente, se que no me merezco esto y cuando me banearon la cuenta fue en un partida que yo termine carreandola con {{champion:114}} , por favor riot no es un flameo intenso quiero que me devuelvan la cuenta yo no reporto a la gente que flamea porque me olvido pero si ellos me flamean y yo los flameo me terminan castigando ami y es injusto la verdad porque es lo que veo y pasa muchas gracias","replies":[{"poster":"xNeriaj","date":"2018-03-12T06:36:02.458+0000","up_votes":4,"down_votes":0,"body":"* Puedes llevar desde la beta jugando, pero si flammeas y te banean permanentemente, no te lo quitaran \n* Llevas tanto tiempo aqui, que deberias saber que aunque te flameen y te amenacen con matarte, debes mutearlos y reportarlos al final de la partida. Si los insultas, pasaras a ser tambien un flammer y recibiras el castigo correspondiente\n* Aunque termines ganando la partida con un Score de 40/0/10 igual te caera una sancion\n\n\nLamentablemente no te quitaran el castigo. Lo unico que puedes hacer es crear otra cuenta y cambiar tu comportamiento.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-03-12T06:36:11.703+0000","up_votes":3,"down_votes":0,"body":"Si tuviste sanciones previas estás complicado porque quiere decir que si bien no sos de insultar de forma grave, lo haces de forma constante o al menos lo suficiente para recibir castigos.\n\nLo primero que estaría bueno que hagas es que nos digas si tuviste sanciones previas, de qué tipo y cuando fueron aplicadas.\n\nTambién sería genial que publiques los registros de chat para ver qué tan grave fue lo que dijiste.\n\n---\n\nPunto a parte.\n\nQue hayas carreado o que te hayan insultado primero, no es una excusa válida lamentablemente, nadie te obliga a usar el chat para responderles, fue tu decisión y cada uno es responsable de su propio comportamiento.\n\nEl sistema solo toma en cuenta si rompiste o no las reglas, nada más.","replies":[{"poster":"FD John Cena","date":"2018-03-16T04:18:17.148+0000","up_votes":1,"down_votes":0,"body":"Si eh tenido sanciones previas pero hace mucho fue 1 sola de ban de 14 dias pero me banearon por chats muy viejos demasiados viejos ya que no soy de flamear mucho solo soy calenton cuando me dicen algo pero bueno que se le va hacer muchisimas gracias","replies":[]}]},{"poster":"BowserElTitan","date":"2018-03-12T06:37:33.266+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=FD John Cena,realm=LAS,application-id=PJAKt7ph,discussion-id=itAdOgON,comment-id=,timestamp=2018-03-12T05:57:04.667+0000)\n>\n> 1. &amp;gt; Hola buenas noches tarde o ma&amp;ntilde;ana les vengo a decir o mejor dicho vengo a reclamar un ban yo juego en la cuenta esta hace mas de 5 a&amp;ntilde;os o mas creo no se la verdad, nunca llegue hasta este punto. Mi reclamo esque si me pueden devolver la cuenta o que puedo hacer porque yo admito que eh flameado pero se que me flamearon tambi&amp;eacute;n y tampoco es un flameo intenso en la cual si seria un ban permanente, se que no me merezco esto y cuando me banearon la cuenta fue en un partida que yo termine carreandola con {{champion:114}} , por favor riot no es un flameo intenso quiero que me devuelvan la cuenta yo no reporto a la gente que flamea porque me olvido pero si ellos me flamean y yo los flameo me terminan castigando ami y es injusto la verdad porque es lo que veo y pasa muchas gracias\n\nNo se si creer que usas la cuenta desde hace 5 años pero es posible, te deseo lo mejor, aunque no creo que te la de vuelvan.","replies":[{"poster":"FD John Cena","date":"2018-03-16T04:17:28.756+0000","up_votes":1,"down_votes":0,"body":"No, si es posta, juego hace 6/5 años pero no soy de usar el foro solo en casos especiales muchisimas gracias a empezar de nuevo solo quiero recuperar mi cuenta pero no creo que haya caso :c","replies":[]}]},{"poster":"MagmaStriker","date":"2018-03-12T06:05:48.220+0000","up_votes":1,"down_votes":0,"body":">yo no reporto a la gente que flamea porque me olvido pero si ellos me flamean y yo los flameo me terminan castigando ami y es injusto la verdad\n\nInjusto nada, si no los reportas ya no hay nada que hacer :/\n\nOtro punto que puedo destacar es este:\n>no es un flameo intenso \n\nEn el cual dejas en claro que flameaste, y seguramente no fue la primera vez en los últimos 2 meses (creo ese es el tiempo en que restablecen las sanciones) en la que te dieron una penalizacion de chat.\n\nDe cualquier forma, podrías poner el chat por el que te banearon ? si es que eres capaz de siquiera entrar a la cuenta xD  Suerte ahí.","replies":[{"poster":"FD John Cena","date":"2018-03-12T06:28:52.118+0000","up_votes":1,"down_votes":6,"body":"Si la verdad que es injusto porque todos mis insultos que estan en el chat que sacaron la foto son respondiendo a otro flamero que me flamea claramente obvio que me va a quedar la bronca y en la partida le voy a decir algo pero no puede ser hace 6 años juego como me van a banear permanentemente todo el esfuerzo todos los vicios a la basura","replies":[{"poster":"MagmaStriker","date":"2018-03-12T06:32:56.449+0000","up_votes":1,"down_votes":0,"body":">vicios a la basura\n\nMal ahí.\n\n> todos mis insultos que estan en el chat que sacaron la foto son respondiendo a otro flamero que me flamea claramente\n\nPara algo existe la opción de mutear, la cual recomiendo un montón para evitar un mal rato y \"calentarse la cabeza\".\n\nSi fuiste un flammer ya cae bajo tú responsabilidad, porque ya avisan que si te tiran muchas restricciones terminan baneando.\n-_-\nAlgo que faltó en tu respuesta fué el chat por el cual te banearon, para tener mas claro si fué bien puesto o no.","replies":[{"poster":"FD John Cena","date":"2018-03-16T04:16:04.158+0000","up_votes":1,"down_votes":0,"body":"Si es una lastima la verdad pero bueno soy calenton cuando me insultan el tema esque si vos reportas y te reportan es ban para cada uno supongoo... que se le va hacer no me queda otra que empezar a jugar con la cabeza fria ya que esto del ban lo estan haciendo enserio","replies":[]}]}]}]},{"poster":"Rick Silence","date":"2018-03-12T13:32:28.866+0000","up_votes":1,"down_votes":0,"body":"Tuviste sanciones previas? Si no es así, andá a soporte.","replies":[]},{"poster":"Respect The Axe","date":"2018-03-12T11:44:17.664+0000","up_votes":1,"down_votes":0,"body":"y bue capo flameaste ya esta baneado cambia de comportamiento y cuenta nueva no hay otra!","replies":[]}]}