{"poster":"Cloud273","date":"2017-12-11T23:09:16.513+0000","title":"Teemo FINALLY has nerfs on PBE...","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"The nerfs are almost NOTHING, and I doubt they&#039;ll have much of an impact, but still...good riddance.","replies":[{"poster":"Riot Sotere","date":"2017-12-12T00:28:14.139+0000","up_votes":2,"down_votes":2,"body":"Base stats tend to be more impactful than they look on first read. He'll also probably get hurt from Sorcery changes more than most, even though he has other options that are quite good for him.","replies":[{"poster":"HaIlMonitor","date":"2017-12-12T00:33:42.892+0000","up_votes":2,"down_votes":0,"body":"Do you think these are more of a placebo affect then actual causation? With the Rengar buff I really dont see how 3 armor made him go from, if I remember right, 47ish to 56% winrate in high elo.","replies":[{"poster":"Dracocrash","date":"2017-12-12T02:17:59.087+0000","up_votes":3,"down_votes":1,"body":"3 armor is huge in the jungle.\n\nIt meant rengar was barely able to do  his first clear properly, and was unable to follow up a gank after hitting level 3.\n\nThis in itself is a huge nerf because early ganks can decide a lane's fate.\n\nNot only this it opened him up to being invaded and made him back more frequently which resulted in lower clear speeds.","replies":[]},{"poster":"Riot Sotere","date":"2017-12-13T21:05:12.071+0000","up_votes":1,"down_votes":1,"body":"I doubt it actually made him move that much.  When you get smaller sample sizes (slicing down one region and one MMR group) you sometimes get misleading data. \n\nOur early reports on data showed him barely moving in high elo (+.1%) and moving decently at all elo (+1.5%). The latter would be along the lines of my expectation for this buff on a jungler who is actually being kept down by getting too punished in the jungle.","replies":[{"poster":"ChuShoe","date":"2017-12-14T02:48:54.705+0000","up_votes":1,"down_votes":0,"body":"wait.. so there's math you can do to tell if a base stat change by X amount will affect the winrate by Y amount?\n\nIf so, can you do the same with certain items on certain champions?","replies":[]}]},{"poster":"Illâoi Evê Siôn","date":"2017-12-12T01:50:27.969+0000","up_votes":1,"down_votes":0,"body":"They also nerfed Elise, Gragas, and Jarvan, Cinderhulk and Cinderhulk+Gargoyle Stoneplate in that patch. Not sure about the numbers (we could really use a LoL History for studying stuff like this) but that must have all helped him, too.","replies":[{"poster":"ChuShoe","date":"2017-12-12T02:57:16.990+0000","up_votes":1,"down_votes":0,"body":"actually, I'm glad they nerfed gragas.\n\nI was so tired of him being meta.","replies":[]}]}]},{"poster":"Hópe","date":"2017-12-12T02:50:36.292+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Sotere,realm=NA,application-id=3ErqAdtq,discussion-id=oEr16G2P,comment-id=0001,timestamp=2017-12-12T00:28:14.139+0000)\n>\n> Base stats tend to be more impactful than they look on first read. He&#x27;ll also probably get hurt from Sorcery changes more than most, even though he has other options that are quite good for him.\n\nAny recommendation on items to build against him? If im playing lets say Darius Nasus or Kayle how exactly do you build against Teemo?\n\nIm new to top lane and was just wondering what you think.","replies":[{"poster":"ChuShoe","date":"2017-12-12T19:21:51.469+0000","up_votes":1,"down_votes":0,"body":"{{item:3194}} Is your baby vs teemo.\nHis poison does absolutely nothing to you once you have it, and if you buy a {{item:3065}} on top of that (or, if you want more damage{{item:3155}} is super good) then you're absolutely invincible. Nasus, though, teemo serves as a counter. Same with fiora.\n\nKayle, I'd reccomend putting your faith in your Q and only using your E to farm. Building {{item:3001}} might be worth looking into.","replies":[]}]}]},{"poster":"ChuShoe","date":"2017-12-12T00:32:12.913+0000","up_votes":1,"down_votes":0,"body":"I mean, teemo sucks if you're not first picking fiora or camille.","replies":[{"poster":"Cloud273","date":"2017-12-12T02:00:30.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChuShoe,realm=NA,application-id=3ErqAdtq,discussion-id=oEr16G2P,comment-id=0002,timestamp=2017-12-12T00:32:12.913+0000)\n>\n> I mean, teemo sucks if you&#x27;re not first picking fiora or camille.\n\nThis is a common misconception. Yes Fiora has a harder time with Teemo since she's mostly auto attack based, but you forget that top lane is for MELEE champions. They all use them to some extent. Bad matchups do not exist for Teemo because of his blind.","replies":[{"poster":"ChuShoe","date":"2017-12-12T02:07:47.842+0000","up_votes":2,"down_votes":1,"body":"{{champion:14}} {{champion:516}} {{champion:3}} {{champion:79}} {{champion:13}} {{champion:6}} sure he uses auto attacks but if you just back off when he uses his blind, come back with your Q, use your E and beat the crap out of him.","replies":[]}]}]},{"poster":"Boulderox","date":"2017-12-11T23:09:52.956+0000","up_votes":1,"down_votes":0,"body":"tank teemo will become more prevalent, just watch...","replies":[]}]}