{"poster":"Cloud273","date":"2016-11-08T00:49:04.130+0000","title":"How to play Kayle without shoving the lane?","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"I&#039;ve been having a hard time cs&#039;ing with Kayle without using my &#039;e&#039; (and occasionally my &#039;q&#039;). But when I farm this way I end up pushing the lane without even trying. Farming with her auto attacks doesn&#039;t work well at all because she&#039;s in range of most of most abilities, and after the nerf to her base AD it&#039;s pretty difficult to last hit this way. Because the lane is constantly pushed, I end up getting ganked a lot, which I obviously don&#039;t want. But what else can I do? If I try to last hit with auto attacks, I get harassed too much, and if I use my &#039;e&#039; the lane gets shoved, cuz of the aoe.","replies":[{"poster":"Attticus Finch","date":"2016-11-08T00:50:08.035+0000","up_votes":2,"down_votes":0,"body":"Farming without your E puts you too much at risk for poke.\n\nKayle just naturally pushes the lane. Do your thing, push the enemy laner to their tower, and once it's pushed either chill in the middle of the lane or go roam.","replies":[{"poster":"Cloud273","date":"2016-11-08T01:16:41.658+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Attticus Finch,realm=NA,application-id=3ErqAdtq,discussion-id=yLuEV7AO,comment-id=0000,timestamp=2016-11-08T00:50:08.035+0000)\n>\n> Farming without your E puts you too much at risk for poke.\n> \n> Kayle just naturally pushes the lane. Do your thing, push the enemy laner to their tower, and once it&#x27;s pushed either chill in the middle of the lane or go roam.\n\nShould I expect my jungler to understand this and help me out? \"Hey I'm probably gonna get camped. U think you could hang near my lane in case the jungler shows up?\"","replies":[{"poster":"1wolfpack","date":"2016-11-08T01:32:21.998+0000","up_votes":1,"down_votes":0,"body":"you cant rely on something like that, just make sure to use wards, and like buddy said above after u push lane to turret hang back or roam.\n\none thing I do if I only have 1 ward playing mid lane for example:\nward the top bush and hang around it instead of the middle since its warded.\nso if they come from top side you see them coming\nif they come from the bot side its easier for you to get away.","replies":[]}]}]},{"poster":"Calabok","date":"2016-11-08T01:51:46.162+0000","up_votes":1,"down_votes":0,"body":"just kill the ganker AND the laner. its what she does.","replies":[]}]}