{"poster":"Psychotic Furby","date":"2017-10-18T08:40:50.152+0000","title":"New Players/ Simple request to Riot Games","subforum":"General Discussion","up_votes":1,"down_votes":2,"body":"I just want to express how frustrating it can be grinding in lower Elo. I get on ready to attempt to carry my team through a game. It seems many players have no idea how to build their champions items, how important csing actually is, where to put pressure on the map or when (After won teamfights mainly), basically the fundamentals.\r\n\r\nI just find it really frustrating that I constantly have things like a Tristana rushing bork, a Zed going Jungle,  my support Karma building full AP, Top lane maokai building MR against a full AD team on my team. \r\n\r\nI&#039;m currently silver 3 and I have my fundamentals down pretty good because I&#039;ve played into high plat before. I try my very best to carry my games and currently am averaging a 6.4 overall KDA with a 84 percent win rate, I also personally shot call for my team. Tell them when to baron, where to pressure certain parts of the map, when and when not to fight or engage, better ways to build their champions. With no current voice client in the game and having to type all of this out I feel like I&#039;m over burdened trying to do all of this while still maintaining a high level of play. I know I will make it out of this Elo but it doesn&#039;t fix these key issues with the game.\r\n\r\nThis is my simple request to you, Riot. Please put in better forms of training into your game, or maybe even links to external sites for each champion so players can better understand how to play. Add a more in-depth tutorial explaining the importance of things and how important they in fact are. I feel like players who join the game are just launched into the mix with very little knowledge. Bots aren&#039;t very good for learning ethier, they might experience how their champion plays but it doesn&#039;t help on any fundamental level for the player. \r\n\r\n1. Lack of wards\r\n2. Wrong build pathing\r\n3. Incorrect positions for the champion\r\n4. Not knowing when to take or conceed objectives\r\n5. Teamfighting\r\n6. Csing\r\n\r\nAll these aren&#039;t very thouroghly explained to new players, you kind of just give them the basics. I would like to see this as at least an option given to them. Create a video or something and post it for them in the client when they first start. Anything..... I feel like a lack of knowledge is really holding players and the community back.","replies":[]}