{"poster":"roicax","date":"2018-08-08T03:29:32.320+0000","title":"Hablemos de Zoe","subforum":"Jugabilidad, balance y narrativa","up_votes":8,"down_votes":3,"body":"&iquest;No es este el campe&oacute;n m&aacute;s pol&eacute;mico de League of Legends?\r\n S&eacute; que es una ardua tarea el balance y se necesita mucho equipo para hacerlo pero, intenten arreglar el campe&oacute;n antes de su lanzamiento.\r\nZoe ten&iacute;a varios combos como qq r pero lo cambiaron todo, &iquest;para qu&eacute;? Por el tiempo de reacci&oacute;n de las personas que, nunca est&aacute;n conformes por nada. 1 a&ntilde;o esperando una skin de Aurelion para quejarse de &eacute;sta, y hablo de generalidades, s&iacute;. Independientemente de &eacute;sto un campe&oacute;n con skillshots, requiere posicionamiento y, &iquest;cu&aacute;l es la recompensa de dar &eacute;sto? Nerfeos con un ciclo sin fin, cada parche&hellip; Se supone que un campe&oacute;n que est&aacute; basado en dmg a un solo target debe ser explosivo, v&eacute;ase el ejemplo de Leblanc, Fizz y Syndra. Pero Zoe no es recompensada por esto, tiene un kit de habilidades muy perezoso, su pasiva incrementa el dama&ntilde;o de su pr&oacute;ximo ataque b&aacute;sico pero,&iquest;no es Zoe el midlaner de distancia con menos rango en el juego?\r\nVengo a dar mi punto de vista y conocer el porqu&eacute; los nerfs repetitivos, zoe deber&iacute;a ser capaz de oneshotear a alguien, uno solamente. Pero &eacute;sto no es posible, Lux es 10 veces m&aacute;s f&aacute;cil y hace el trabajo mucho mejor.\r\nActualmente estoy rozando platino y quiero saber qu&eacute; opinan de ella.","replies":[{"poster":"MeRakanLaEspalda","date":"2018-08-09T17:13:16.745+0000","up_votes":4,"down_votes":0,"body":"Queres ganarle?\nAprende a dodgear.\nUsa movilidad\nO hacete main yasuo. el muro para algo esta no?\nCapisce?","replies":[]},{"poster":"Visoka","date":"2018-08-08T04:39:25.730+0000","up_votes":4,"down_votes":8,"body":"En serio defiendes la ridiculez de champ que es zoe? Champ con mas de 50% de win rate (y mayor en elo alto), pick o ban en el competitivo hace meses, apenas gasta maná en la fase de líneas, la habilidad mas rng del juego y es puro win-win y capacidad de oneshot sin counterplay.","replies":[{"poster":"WhiteMax","date":"2018-08-08T14:13:12.593+0000","up_votes":6,"down_votes":0,"body":"> sin counterplay.\n\n{{champion:201}} ?","replies":[{"poster":"Visoka","date":"2018-08-09T10:04:11.309+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=xQmJPO8F,discussion-id=kshWyZdE,comment-id=00020000,timestamp=2018-08-08T14:13:12.593+0000)\n>\n> {{champion:201}} ?\n\nClaro, va a venir de bot a salvarte, sigue llorando por tu champ con 50%+ de winrate que esta mal.","replies":[]}]},{"poster":"Tarta35","date":"2018-08-09T03:11:08.436+0000","up_votes":4,"down_votes":0,"body":"Jajajaaja seguro te toca contra Zoe y no sabes jugarle","replies":[]}]},{"poster":"Mugman Rojo","date":"2018-08-08T03:34:20.430+0000","up_votes":5,"down_votes":6,"body":"Falla todas las habilidades y te mata igual Su w y pasiva tienen el daño suficiente para hacerte 100-0","replies":[{"poster":"Tarta35","date":"2018-08-09T03:13:29.842+0000","up_votes":3,"down_votes":0,"body":"El daño es de la Q dudo te mate (si la falla como vos decís) tal ves con E pasiva y hechizos te mata pero tarda\nTe estás quejando por quejar","replies":[{"poster":"Mugman Rojo","date":"2018-08-09T03:23:20.341+0000","up_votes":2,"down_votes":1,"body":"Seguro?\nhttps://clips.twitch.tv/EnchantingDullYamKappaClaus\nla tipa fallo todo y aun asi mato a jhin\nsolo con w,pasiva, basicos y el eco de luden","replies":[]}]}]},{"poster":"AavatarisII","date":"2018-08-08T14:28:18.537+0000","up_votes":3,"down_votes":2,"body":"Me gusta Zoe:\n- Requiere acertar las habilidades (por eso le han nerfeado tanto ancho como zona de impacto de la Q y E).\n- Es un mago-asesino vulnerable (haz bola de nieve y es op, falla el early y los tankes te destrozaran).\n- Puedes armarla Full daño, o Full utilidad, o híbrido.\n- Me encanta como Supp y me gusta su personaje.\n\nPor que los nerf? Por que es un asesino que deletea potentemente y constantemente, así que requiere más habilidad (falla y desperdiciaste tu oportunidad; acierta y carreas) :)\n\nLo que si no me gusto mucho es que le nerfearan la velocidad de movimiento de la W (la W en general), pero bueno, no afecto tanto y seguro es por los que se regalan a lo asesinos en early (Yasuo, Zed, Riven, Lb, etc) y aún no entienden que es juego de **estrategia y equipos**.","replies":[{"poster":"Tarta35","date":"2018-08-09T03:12:33.563+0000","up_votes":2,"down_votes":0,"body":"La velocidad (la última ves que la use antes de este parche fue) a mi parecer es buena, ponerle más le dejaría tener una movilidad op escapando de todo tipo de gank fácil o matando a su enemigo a tiempo","replies":[]}]},{"poster":"AkitoNeru","date":"2018-08-09T23:40:24.717+0000","up_votes":1,"down_votes":0,"body":"La gente llora por zoe como lloran por un yasuo m7, no entiendo.\naun asi a todos los efectos si son mains zoe recomiendo que la jueguen en soporte hasta que por lo menos salga un minimo buff a sus habilidades, si le siguen nerfeando el daño es mucho mas viable en soporte por su stun.","replies":[]},{"poster":"LaReinaPingüino","date":"2018-08-09T20:48:03.838+0000","up_votes":1,"down_votes":0,"body":"Ya no baneo a zoe, ahora baneo a akali .","replies":[]},{"poster":"Nôll","date":"2018-08-08T03:50:48.606+0000","up_votes":3,"down_votes":5,"body":"Yo creo que a Zoe le falta un poquito mas de daño en la Q, una pequeñita reducción del enfriamiento el los primeros niveles de la Q. Me parece que el campeón perdió un poco la gracia con los nerfeos fuertes que tuvo. Puede que ahora esté balanceada, pero creo tiene que deletear a los campeones de papel como lo hacía antes. \n\nYo tengo partidas donde me fedeo, pero no los deleteo ni de casualidad, no importa si ellos no compran resistencia mágica, la Q puede viajar de un nexo a otro que no los deletea.","replies":[]}]}