{"poster":"Trueplay3r","date":"2016-09-17T11:07:05.031+0000","title":"Adc braucht Hilfe","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hi Leute,\r\n\r\nkann mir mal einer verraten warum ich zumindest nicht aus Bronze raus komme und meistens bei Brone V stagniere? \r\n\r\nLiegt es an meinen Item  Builds, Champ Auswahl, Positionierung in fights? \r\n\r\nBin langsam echt am verzweifeln oder hab ich meistens kein Gl&uuml;ck mit meinen mates? \r\n\r\nMit freundlichen Gr&uuml;&szlig;en","replies":[{"poster":"Nycaria","date":"2016-09-17T11:20:19.220+0000","up_votes":2,"down_votes":0,"body":"In deinen verlorenen Spielen und auch teilweise in den Wins hast du recht viele Tode. Deine Champauswahl finde ich persönlich für Bronze auch nicht sonderlich gut. Das soll jetzt nicht abwertend für Bronze Leute klingen, aber ich denke nicht dass viele Leute in der Elo wissen,wie man richtig für einen immobilen ADC peelt. Versuch dir Champs anzueignen,die für sich selbst peelen können,keinen Kogmaw oder eine Jinx. Natürlich sind das Hypercarrys,aber eben auch verdammt auf guten Peel angewiesen,wenn du kein gottgleiches Positioning hast :)","replies":[]},{"poster":"Trueplay3r","date":"2016-09-17T22:56:14.899+0000","up_votes":1,"down_votes":0,"body":"erstmal danke für eure antworten wede die tipps mal beherzigen eventuell schaff ich es dann mal aus bronze raus. :)","replies":[]},{"poster":"DerBossHatDURST","date":"2016-09-17T18:22:06.970+0000","up_votes":1,"down_votes":0,"body":"Ich bin Platin 4 und meine adc reicht für gold 2-1. \n\nEs gibt 2 Möglichkeiten wie du aufsteigst du lässt dir 3 Stunden erklären wie man ADC richtig spielt und vergisst dabei die Hälfte wieder. Oder ich sage dir ein paar Fundamentale Sachen die dir sofort Helfen werden Ich habe ein Smurf acc auf Bronze gehabt und konnte sehr viele Fehler Festellen ich liste mal hier die größten auf.\n\n-Dummes traden was meine ich damit? z.B das man mit Level 1 schon irgendwie die Fight´s sucht und sich gegenseitig autoattacked und das du nicht in Minion tradest. schau das du immer das du erst dann tradest wenn du nicht deep in Gegner minions stehst u.o auch wenn du mehr Minions hast kannst du super traden. \n\n\n-Checke immer deine Masteries, Runen und Summoner Spells spiel bedacht wenn du immer irgwas vergisst und oh nein Thunderslord statt Fevor mitgenommen damn it. Dann warst du wieder nicht im Spiel sondern irgendwo anders. \n\n-Lern dich zu Fokussieren dabei kann ich dir Entspannungsmusik empfehlen , scheiß auf den Chat in Bronze brauchst du so gut wie keine Kommunkation fast jeder call ist falsch ich würde sogar sagen jeder :D.\n\n-Kauf vernünfitge Items fang immer oder meistens mit den gleichen Core Item´s an z.B bei Tristana Hurricanes -> IE, wenn danach wird es oft immer Spiel abhängig schau dir mal an z.B auf probuilds.com was generell auf Tristana gebaut wird und dann kannst du ja sehen was man alles als 3 tes item so bauen kann. Das ist denke ich mal für dich immer eine schwierige Entscheidung auch immer bau nicht immer die besten Items. \n\n-Wenn du Internet Probleme hast Spiel nicht! Ich sehe oft das viele in Bronze sind wegen dem Internet das hört sich voll verstört an aber musste echt oft Afk´ler carrien. \n\n-Nicht Sterben !!!!!!!!\n\n-Dein Championpool ist Müll ich weiß ich bin auch kein Fan davon das zu sagen, aber wenn du wirklich effektiv climben willst. Spiele keine Vayne sie brauch so viele Mechanik ich kann die nicht mal Spielen klar könnte ich sie üben aber sie brauch viel zu viel Übung sie, hat ein viel zu hohen maximale nutzt Effektivität. Fizz kann super gut Plays machen klar ist aber auch sehr schwierig ausnutzen.  Dazu spielst du viel zu oft verschiedene Champions bleib doch mal bei 1-3 Champions.  Empfehlungen sind hier Tristana/Annie/Ashe(i dont like)/Ezrael\n\n- Du hast viele Müll Runen Seiten Runen Seite 1-2 ist glaube ich am besten  der rest ist meh. Für ADC sind die beiden am besten aber die erste ist halt zu riskant für dich ich denke du machst oft dumme trades und dadurch wirst du mit weniger MR nur noch mehr gepunished. \n\n- Es gibt noch viele andere Fehler die ihr macht aber es wird unendlich lang. Es ist wirklich erschreckend und ich weiß auch nicht wie man ehrlich nach Bronze V gelangen kann vorallem gar nicht wenn man hier im Forum Hilfe sucht weil das mögen die meisten Bronze Spieler gar nicht.\n\nkannst mich auch gerne mal adden! \n\nDas sind nur Sachen das du jetzt Aufsteigst es gibt noch viel mehr aber ich denke wenn du jeden Punkt mal dir durch den Kopf gehen lässt und nur wenigstens annähernd berücksichtigst wirst du besser.\n\n\nIch würde dir empfehlen in schritten dich zu improven wenn du alles auf einmal draufgedonnert bekommst dann wirst du alles wieder vergessen. Fang in kleinen schritten an es dauert länger bis du vielleicht climbst aber dann vernünftig und du wirst weniger Probleme haben. Es gibt auch unzählige Videos. Schau dir mal hin und wieder mal welche an.  \n\nhttps://www.youtube.com/watch?v=qMP1xT1jUeQ&list=PLElGaaVJZAi207UyEklE2BmUwWfvEKZJX \n\n ist z.B das was du dir ansehen kannst schau dir nicht alles auf einmal an guck das du dir 1 anschaust und es auch beibehalten aknnst wenn du dir nur input gibst und dies nicht verwerten kannst, kannst du dir das Video wieder anschauen. \n\nIst nicht der beste ADC aber für dich ist alles gut und hier erklärt er auch viele Basic sachen sowas wie Wavecontroll e.t.c ist nicht so wichtig Freezen auch noch nicht. Aber wenn du Interesse hast schau trotzdem mal dann verstehst du manche sachen besser\n\nhttps://www.youtube.com/watch?v=XDb9ZUerY-U Sehr wichtiges Video für dich.","replies":[]},{"poster":"Pure Cynicism","date":"2016-09-17T13:33:31.028+0000","up_votes":1,"down_votes":0,"body":"So auf dem Papier sieht es eigentlich nicht so übel aus. Du hast vielleich im Schnitt 10-30 CS weniger als ich, aber da uns aktuell 12 Divisions trennen, spricht das eigentlich eher für dich und gegen mich.\n\nZunächst mal ganz grundsätzlich: \nDu stirbst im Schnitt 10x, das ist viel zu viel. ich habe einen Wert von 5,4. Du machst zwar auch mehr Kills als ich, aber trotzdem ist meine KDA im Schnitt um einen ganzen Kill besser: Du hast 1,84, ich habe 2,79. Auch wenn KDA nicht alles ist, so ist sie doch ein Indikator, an dem du deine Leistung messen kannst. Was ich bei mir immer wieder feststelle: Ist die KDA unter 2,0, sucke ich richtig rein und droppe. Ist sie dagegen über 3,0, climbe ich. Der Wert muss natürlich über einen längeren Zeitraum bestehen. Für mich hat sich die Statistik auf OP.GG bewährt, die in die KDA deine letzen 20 Spiele miteinfließen lässt (filtere nach Rankeds).\nAlso: Versuche mal in jedem Spiel eine 3,0 KDA zu erreichen und sie auch konstant zu halten. Bei mir klappt das jedenfalls ganz gut.\n\nZusätzlich: Adc ist für Bronze eine schlechte Rolle, weil dich niemand beschützt. Als Supporter wird Lux oder Brand gespielt und wenn der Zed auf dich springt, schauen alle nur zu. Erst ab Gold wird mal ab und zu versucht, den Adc zu schützen. Wenn du merkst, dass du keinen Peel hast, schaue die ersten Sekunden in einem Teamfight nur von hinten zu. Irgendwann wird zB der Zed den Mage ulten, der vielleicht seine Combo schon raus hat und eh nutzlos ist. Wenn alle Gegner ihre Spells und Ults draußen haben und auf 50% sind, ist dein Moment gekommen, um zu rasieren.\nAlso: Die ersten 5 Sekunden im Teamfight nur wegrennen, danach aufräumen.\n\nZu den Champs: Ich spiele nur Jinx, Vayne, Draven und Sivir, also sage ich nur zu denen was.\n\nSivir: Meines Erachtens für SoloQ tot. Ihre Ult ist zwar immer noch krass, aber nur wenn du ein gutes Team mit Absprache hast. Einfach Finger weg.\n\nAnsonsten gilt: Hast du guten Peel im Team (Faustregel: Zwei Champs mit Utility, damit einer failen kann), zB Lulu, Alistar, Bard, Soraka, Sona, Janna usw. nimm Jinx. Sie ist so stark in Teamfights. Mein persönlicher Tipp - was offenbar auch nur ich mache: Kauf dir nach dem BF direkt die Rapid Fire Cannon, nicht Runaans. Auf der Lane finde ich den Extra-Schaden mit der Range sooo stark, vor allem wenn noch ein Crit durchkommt. Ich weiß gar nicht mehr, wie oft ich auf der Lane durch Rapid Fire Cannon den Gegner erst fast halbiert, dann mit W + R ausgelöscht habe. Danach baust du IE, Runaans und Lifesteal.\n\nVayne nehme ich, wenn ich weiß, dass ich gar keinen Peel habe. Aber du musst sie spielen können. Deine Winrate mit ihr ist zumindest ok. \n\nDu könntest auch mal in einem entsprechenden Matchup statt Jinx Draven picken. Gerade wenn die Gegner keine Tanks haben und die Leute in Bronze Draven nicht kennen, kannst du damit übelst rasieren.","replies":[]},{"poster":"Neeko the Ekko","date":"2016-09-17T13:27:24.798+0000","up_votes":1,"down_votes":0,"body":"Suche dir einfache adcs aus sowas wie ashe, caithlyn oder corki. Du solltest in den Team Fights hinten in der backline stehen und nicht ganz vorne. Wenn du vorne stehst, bist du schneller tot, bevor du überhaupt ein Auto Attack machst. Auf der lane würde ich dir raten keinen Engage zu machen und nur zu last hitten. Du bekommst dadurch mehr Gold, das du wiederum in items investieren kannst. Mehr items heißt auch mehr schaden und das heißt dann auch mehr Chancen ein team fight erfolgreich zu gewinnen!","replies":[]}]}