{"poster":"DarkOctopus 02","date":"2018-10-18T15:26:57.377+0000","title":"Non  è possibile che mi trova gente scarsa sulle classificate","subforum":"Aiuto e supporto","up_votes":1,"down_votes":6,"body":"Riot Games io sono in silver e mi trova gente che &egrave; bronzo non &egrave; possibile io trovo gente scarsa invece gli avversari sono tutti maestria 6 in su bisogna bilanciare i bronzi giocano con i bronzi i silver con i silver e cos&igrave; via risolvete per favore questa richiesta","replies":[{"poster":"Skeltur","date":"2018-10-18T16:25:46.954+0000","up_votes":6,"down_votes":0,"body":"https://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3800855557/236838665?tab=overview\njax s3          gp s3\nudyr s3       shyvana s4\nlux s4          lb s1\njinx s1         jhin g5\nkarma s3    leona s3\nmedia tuo team s3, media team avversario s2\n\nmin 1:43: gp si fa vedere in lane top, la bot non si vede quindi shyvana starta dal blu\n\nmin 2:37 shyvana si mostra bot, tu hai finito da 10 secondi il tuo giro giungla, ogni jungler ha iniziato dalla bot ma shyvana è già giù, impossibile, quindi shyvana ha fatto la jungla bot side e il granchio per forza lasciando per dopo la giungla top side\nshyvana prende fb su jinx senza hp bot\n\nmin 2:49 entri nel tribush top di una lane totalmente pushata in sfavore di gp, a 3:15 esci dal tribush (25 secondi persi aspettando una ipotetica possibilità di kill dove avresti potuto farmare tutti i campi di shyvana), ve la giocate bene, prendete la kill\nshyvana si mostra ancora bot ma tu decidi di lasciar ancora perdere i campi della squadra nemica (gold e exp per te tolti a shyvana) e gankare una lb mid, (hai appena utilizzato il flash top)\n\n3:50 ganki mid\nil gank va male, ma non demordi...\n\nmin 3:55 ti piazzi nel sud bush della mid e aspetti per rigankare lb, camperi camperi e a 4:25 te ne vai dal bush, 30 secondi ad aspettare una kill o assist impossibile per te, non avendo flash e avendo lb un forte escape\nvai a farti il red, torni mid e perdi altri dieci secondi ad aspettare, riparti per il tuo path.\n\n6:15 jax va afk quindi è inutile continuare a vedere il game, non è stato perso a causa tua\n\n\nla situazione gold tra te e shyvana era 1850 per te e 1822 per lei\npiccolo calcolo: da 3:20 circa a 3:50 sono 30 sec, più i 30 secondi aspettando nel bush mid, più gli altri dieci...siamo a 1 minuto e 10 secondi (senza contare il tempo perso nel tribush top, non lo contiamo perchè ha portato i suoi frutti quindi ok, fortuna ma ok xD), 1 minuto e 10 secondi dove potevi farti tutti i campi nord di shyvana, ecco i gold:\npappagalli 112\nred 100\ngolems 160\ntotale 372\nin un universo parallelo dove tu decidi di non gankare una lb con W e flash , considerando che sei senza flash, ma preferisci rubare farm al tuo avversario la situazione al minuto 6:15 sarebbe questa:\n1850 + 372 = 2222 per te\n1822 - 372 = 1450 per lei\n2222-1450 = 772 gold in più rispetto a lei, vale a dire 2 kill e 1 assist\nPurtroppo la partita è finita subito e non ho guardato il resto perchè non ne valeva la pena, ma vorrei farti capire il gravissimo errore che hai fatto in 6 minuti dove avresti potuto prendere un vantaggio molto significativo rispetto al tuo avversario, e per fortuna che hai preso quella kill top sennò sarebbe veramente stato un disastro. Bene, non voglio fare il maestrino, ci ho perso pure tempo a scriverti questa risposta dove cerco di farti vedere i tuoi errori, ed è quello che devi fare pure tu, inutile lamentarsi del livello del proprio team o di quello avversario, se tu avessi avuto 772 gold in più avresti vinto il drago infernale perdendo magari la prima torre top ma vabbè, dal infernal avresti gankato bot o invaso la giungla nemica, nel primo caso forse riuscivi a farti una kill, magari due, magari addirittura la torre, nel secondo caso rubavi altra farm e exp a shyvana, magari la incontravi per strada e la killavi pure.\nLe giuste scelte vanno a sbloccare le partite a favore di un team, pensaci :D","replies":[{"poster":"zén","date":"2018-10-18T16:31:19.640+0000","up_votes":5,"down_votes":0,"body":"bella risposta, forse la migliore che ho letto sul forum da qui a 4 anni.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Skeltur","date":"2018-10-18T16:34:10.388+0000","up_votes":2,"down_votes":0,"body":"io ci provo xD","replies":[]},{"poster":"RZR Raiden","date":"2018-10-18T18:56:48.702+0000","up_votes":1,"down_votes":0,"body":"Quoto Zen, gran bella risposta!","replies":[]}]}]},{"poster":"Ringiel","date":"2018-10-18T15:55:12.311+0000","up_votes":3,"down_votes":0,"body":"> io trovo gente scarsa invece gli avversari sono tutti maestria 6\n\ntu sei maestria 7 con udyr,ma vedendo le build e le cs non sai per niente usarlo ... il problema è che sei scarso e al posto di capire quali sono i tuoi errori,preferisci addossare la colpa delle tue lose al tuo team ... la cosa divertente è che sei main jungler,un ruolo che se usato da uno che realmente forte solocarria con i champ che usi nell'elo in cui ti trovi,ma con 14 kill riesci anche a perdere un game con kha e arrivi anche sotto in danni a un garen \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"RGM Player","date":"2018-10-18T15:41:49.391+0000","up_votes":3,"down_votes":1,"body":"Si sa che c'è talmente tanta differenza di skill tra silver e bronze che bisogna sistemare il matchmaking...\n_- sacrcasmo_","replies":[]},{"poster":"Linkimaru","date":"2018-10-18T20:43:07.760+0000","up_votes":1,"down_votes":0,"body":"\"gente scarsa nelle classificate\" perchè tu sei forte invece? XD a silver sono tutti scarsi quidni è normalissimo","replies":[]},{"poster":"DarkOctopus 02","date":"2018-10-18T15:30:01.570+0000","up_votes":1,"down_votes":1,"body":"Ragazzi non è possibile che uno è silver  e trova gente che è bronzo bisogna bilanciare questa cosa ogni uno gioca nella propia lega bronzi con bronzi e silver con silver e così via","replies":[{"poster":"zén","date":"2018-10-18T16:40:45.487+0000","up_votes":1,"down_votes":0,"body":"Se leggessi il commento di Skeltur  capiresti che hai giocato altri giocatori della tua lega. Per salire, ma ancora prima, per vincere bisogna imparare ad essere umili. Se guardando su op.gg vedi che un tuo compagno ha un rank superiore segui i suoi consigli, se invece vedi che hai compagni con rank inferiore prova a diventare il leader per quel game. Il punto è che per migliorare bisogna imparare a non commettere più gli errori che ci tengono inchiodati a quell'elo. Basta dare la colpa agli altri, perchè se veniamo assegnati con quei compagni un motivo c'è che sia il KDA o l'attitudine che abbiamo in gioco. Impariamo ad imparare prima di incolpare gli altri. Vuoi un rank superiore? Dimostra di meritartelo sul campo. Chi ti dice che non è vero che se sei forte sali mente, probabilmente non ha mai avuto la voglia di applicarsi nel migliorare il suo stile di gioco, pretendendo che gli altri giocatori e IL GIOCO stesso si piegasse alla sua idea di lol. Non è così, ci sono regole, meccaniche e patch che vanno rispettate se si vuole imparare a giocare. E il tutto te lo sto dicendo con il massimo della friendly {{sticker:slayer-pantheon-thumbs}}  Iniziamo a migliorare quando decidiamo davvero di farlo, il resto sono tutte scuse per i nostri fallimenti.{{sticker:darius-angry}} Quindi, forza, pazienza e determinazione, vedrai che i risultati arriveranno.","replies":[]}]}]}