{"poster":"AndurilWielder","date":"2018-11-10T04:35:57.730+0000","title":"Rakan feels...useless","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"I know he's like 100% pick/ban in pro circuit, but I'm honestly confused. None of his abilities feel all that powerful. His q is short, and the heal is hardly anything. His W and his E, the shield and jump...the shield doesn't shield for much at all unless you go pure AP ( it scales with AP, right?), and his knock up has a pretty long delay for it to work, but that at least does something. If everyone groups, you can jump in and knock everyone into the air. \n\nHis ult is....what? \"Touch people to charm them\" ...eh? What does that even mean? walk into them? Collide my model with theirs? Or do they mean attack and/or use an ability? So the ult itself doesn't do anything then, it just adds an additional affect for a couple seconds to anything you do and that's it? Feels...underwhelming.\n\nI've heard people have hard carried with him as a support, but...I'm...bewildered.\n\nHe gets bonuses when he's with Xayah right? However, he doesn't use any feathers like she does...\n\nWhat do, lol. I'm asking with intent on learning here.","replies":[{"poster":"iiGazeii","date":"2018-11-10T05:24:49.493+0000","up_votes":1,"down_votes":0,"body":"Rakan is a high-skill playmaking support that depends on you not only being able to land skillshots, but also have the awareness and game sense to know when you can afford to go all-in and make flashy plays. \n\nHis Q is for trading and for poke. It deals significant damage, and although the heal is small, it starts to add up if you land a lot of them. \n\nHis W is an amazing engage tool and emergency escape. If you can land it, it's a great way to set up a kill, peel for your carry, and put yourself right in the middle of the action for your ult. The dash length scales with movement speed, so if you pop your R right before you W, you can go a longer distance. You can also use it to hop over walls or simply create distance if you need an escape. \n\nHis E is for saving your teammates from damage and for escaping from a bad situation. Ideally, you want to use your E to get back to your carry after you've knocked people up with W, or use it to jump in and save them when they are about to take some damage. It lets you stay super-mobile as long as you have at least one ally nearby. \n\nHis ult has the potential to be a team-wide stun. It's one of the best CC abilities in the game, how do you think it does nothing? A charm is a stun + forced movement towards you, and you charm everybody you touch while you gain immense movement speed. You can interrupt enemy abilities, set up an easy kill on pretty much anybody you can reach, which between your W and E, is **everybody**,\n\nA great rune page for Rakan is:\n\nGuardian\nBone Plating\nChrysalis\nRevitalize\n\nNimbus Cloak\nCelerity\n\nGuardian lets you double up on shields when flying in to save an ally, Bone Plating makes you tankier, Chrysalis gives you more health early and AP later, and Revitalize makes your passive shield, E shields, and Q heal better, especially in desperate situations. Nimbus Cloak supercharges your R, and Celerity gives you a bit of extra movement speed for kiting and extra AP off of movement speed, which you should be building at least one item that gives you bonus movement speed (besides boots)","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-11-10T04:58:54.074+0000","up_votes":1,"down_votes":0,"body":"Q can also apply Aery and {{item:3174}} {{item:3504}}, and it does a fair amount of damage. It is a useful tool.\n\nHis engage is lethal, if you E R properly, you can stunlock a good part of a team quite effectively. He also has great peel when escaping (E W), and can usually prevent under-tower ganks.","replies":[]}]}