{"poster":"IQ FortyTwo ","date":"2017-03-27T23:02:28.322+0000","title":"Das geht zu WEIT !!!","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":46,"body":"Tja, 2 mal win in folge und ratet mal, ich bekomme Ehrungen, man sagt mir toll gemacht, verstehe mich super mit meinem Team, B&auml;m n&auml;chstes Game wirft mich das SYSTEM wieder in diese Toxische Gruppen, weil ich Ehrungen bekommen habe! Ich picke meinen Champ, schreib grad im chat die Taktik und was sie bannen sollten am besten, B&Auml;M bannen die meinen Champ den ich grad gew&auml;hlt hatte und glaubt mir, das war kein versehen, denn dann schrieb die selbe person &#039;&#039;stfu&#039;&#039; zu mir. Danke nochmal f&uuml;r den hardcore lose und dass das System mich in diese Trollgruppen steckt. Meine Theory ist so: Sobald man Ehrungen bekommt und sehr positiv auff&auml;llt, wirft das System dich mit Toxische Spieler die oft gemeldet werden in eine Gruppe damit man eine &#039;Balance&#039; schafft. Ich habe die Person gemeldet, aber es wird sowieso nix passieren, das System ist nicht intelligent genug sowas zu erkennen und sein Warwick troll premade hat dauerhaft gefeedet und den Midlaner beleidigt. Tja, ihr solltet hoffen dass ihr keine Ehrungen bekommt, denn im n&auml;chsten game werdet ihr mit Trollen und Toxischen Spielern in die Gruppe gesteckt.","replies":[{"poster":"Nohgolgh","date":"2017-03-28T00:58:09.196+0000","up_votes":20,"down_votes":1,"body":"Deine Theorie ist falsch. In Wirklichkeit ist der Mensch nur die drittintelligenteste Spezies (nach den Delphinen und Mäusen) und die Mäuse machen Experimente mit dir, in denen sie dir suggerieren, zu spielen. Dieses Matchup wurde dann von den Mäusen geplant, um aus deinen Reaktionen die richtige Frage nach dem Sinn des Lebens, dem Universum und dem ganzen Rest herauszubekommen, damit die richtige Antwort -42- einen Sinn ergibt. Riot wird in Wirklichkeit von den Mäusen kontrolliert. \n\nDie Mäuse müssen dabei auf dich zurückgreifen, weil an vielen wesentlichen Stellen sich bereits die Reptilianer eingenistet haben und du meistens mit und gegen Reptilianer gematcht wirst. Die Reptilianer wollen hierbei die Herrschaft über den Planeten und fast alle Personen, die du als Menschen kennst, sind in Wirklichkeit Reptilianer. Da die Reptilianer Außerirdische sind, und somit nicht dem großen Computersystem, das wir Erde nennen, angehören und somit nicht Teil der Recheneineheit sind, die die Frage nach dem Sinn des Lebens, dem Universum und dem ganzen Rest ausknobeln sollen, können sie die Antwort nicht kennen und sind somit für die Mäuse uninteressant. Da die Reptilianer die Menschen als Spezies langsam verdrängen, indem sie Gift im Himmel ausschütten (man kann das Ganze an den Chemtrails sehen) und so unfruchtbar machen, gibt es nicht mehr viele Menschen, an denen die Mäuse ihre Forschung betreiben können und deswegen müssen sie dich besonders intensiv aufs Korn nehmen. \n\nTheorie wird noch ausgebaut, sobald ich die Verbindungen zum Yeti und zu von Regierungen geheim gehaltenen Ufos gefunden habe.","replies":[{"poster":"Abasin","date":"2017-03-28T05:30:32.729+0000","up_votes":4,"down_votes":0,"body":"Danke für den Fisch. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Rioyter","date":"2017-03-28T20:50:19.080+0000","up_votes":2,"down_votes":0,"body":"Du musst aber bedenken, dass die Erde flach ist. Dahinter können sich die Ufos verstecken, zudem ist dort das Hauptquartier der Mäuse. \nBeim Yeti handelt es sich um eine Kreuzung aus Reptilianer und Maus, während beide gerade in Menschform waren. Beide haben einen Gürtel mit einem Rad in der Mitte und dann können sie sich in alles verwandeln. Die Gürtel haben die Übrigens von grünen Aliens mit Tentakeln, die gerne Müll essen, aber das ist eine andere Geschichte. Wobei eigentlich sind die Ufos von den Aliens, die ihre Gürtel wiederhaben wollen.....","replies":[]},{"poster":"Mi3zekatze","date":"2017-03-28T10:32:37.898+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne eine Fortsetzung haben xD","replies":[]},{"poster":"NuKulaR85","date":"2017-03-28T10:05:04.559+0000","up_votes":1,"down_votes":0,"body":"Ich dachte die Reptiloiden kontrollieren Rito? \nJetzt bin ich verwirrt....","replies":[]}]},{"poster":"Wernicke","date":"2017-03-28T06:28:23.360+0000","up_votes":12,"down_votes":0,"body":"> Ich picke meinen Champ, schreib grad im chat die Taktik und was sie bannen sollten am besten, BÄM bannen die meinen Champ den ich grad gewählt hatte\n\nIch hab da ne ganz verrückte Idee. Aber psssst, isn Geheimnis. Das wissen jetzt nur du und ich!!!\nPass auf, evtl, aber nur ganz evtl, wirklich nur vlt, könnte es angehen, das, naja, einige Spieler etwas genervt darauf reagieren, wenn andere Spieler, die rein mmr technisch doch aufm etwa gleichen Stand sind, ihnen was \"erklären\" und \"Vorgaben\" geben wollen!! o0\nDas Spiel fängt noch nicht mal an, gerade mal in der select, und schon kommt son Typ an der meint er müsse seinem team, welches ja grundsätzlich erst mal alle schlechter ist als der \"pro\", sagen was man zu tun und lassen hat... \nEs ist also ein hausgemachtes Problem deinerseits. Du sorgst für diese Momente. bestimmt nicht immer. Ausnahmen bestätigen bekanntlich die Regel. Aber in einigen Fällen scheinst du deinen Beitrag dazu zu leisten.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Vogeljunges","date":"2017-03-28T06:39:18.780+0000","up_votes":8,"down_votes":0,"body":"Boah.. lass es doch mal gut sein... \n\nDu bist echt das Kaugummi, das diesem Forum am Schuh klebt...\n\n{{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"Der Großmugister","date":"2017-03-28T18:40:55.356+0000","up_votes":2,"down_votes":0,"body":"Die japanische Bedienungsanleitung für deinen koreanischen Videorekorder?\n\nDark Wing Duck?","replies":[{"poster":"Homunculi","date":"2017-03-28T19:21:02.467+0000","up_votes":1,"down_votes":0,"body":"Da fehlt aber noch der Schrecken der die Nacht durchflattert!!!","replies":[]}]}]},{"poster":"Killerkante","date":"2017-03-28T00:42:03.190+0000","up_votes":7,"down_votes":1,"body":"ich schlag dir mal was vor:\nNimm deine Theorie, auf zum WC und spül sie die Toilette runter.\nNichts für ungut, aber es ist mir so ein Rätsel was vermutlich Kinder wie du sich alles zusammenreimen um sich toxische oder schlechte Spieler plausibel zu machen.\n\nZum Schluss empfehle ich dir die Theorie wieder aus'm Klo zu ziehen und danach startest eine Propaganda Kampagne für die Illuminati in LoL.","replies":[]},{"poster":"Spicavius","date":"2017-03-27T23:27:41.766+0000","up_votes":3,"down_votes":9,"body":"Naja. Ein Kumpel von mir bannt ziemlich oft die Champs, die \"unsere\" Mates spielen wollen.\n\nEr findet es lustig, dass sie sich so aufregen. Ihn stört es ja nicht zu verlieren (mich ja auch nciht sonst würde ich nicht mit ihm spielen x) ), aber die Leute regen sich so herrlich darüber auf, dass man sie auch noch berechtigt reporten kann.\n\nEinfach nicht kommentieren sowas. Einfach einen anderen Champ picken und es dabei ruhen lassen. Das wäre mein Tipp für dich. Mir ist das auch schon passiert. Der eine wollte, dass ich einen Tank Supp picke und hat mir meinen Squishy Support weggebannt. Tja gut dass es kA 10 weitere sqiushy Supps gibt :P. Also nicht so ernst nehmen das Ganze ;)","replies":[{"poster":"SSI CptHaunted","date":"2017-03-28T09:03:07.215+0000","up_votes":4,"down_votes":0,"body":"Den Leuten die Champs wegbannen um sie später dann reporten zu können...was stimmt mit dem? Wie tief muss man gesunken sein um andere absichtlich dazu zu provozieren auszurasten? Gut dass ich meine Wahl nicht mehr anzeige, muss ich mir wenigstens nicht wünschen niemals mit euch gematcht zu werden.","replies":[{"poster":"Spicavius","date":"2017-03-28T16:03:47.894+0000","up_votes":1,"down_votes":0,"body":"Du tust ja so als ob ich das machen würde ^^.  Wenn die aber ständig am labbern sind und ihre eigenen mates als noobs bezeichnen und ständig am heulen sind dann Reporte ich sie natürlich.\n\nAber was soll man machen. Wenn mein Kumpel da Recht zum bannen bekommt dann kann man nichts machen. Ist ja auch nur ein Spiel.","replies":[{"poster":"SSI CptHaunted","date":"2017-03-28T19:27:35.726+0000","up_votes":1,"down_votes":0,"body":"Wer ein solches Verhalten kommentarlos akzeptiert und denjenigen nichteinmal etwas zurechtweist scheint ja damit einverstanden zu sein. \n\nFakt ist, dass jeder, ja jeder, jemanden der sich absichtlich so asozial verhält beleidigen darf wie er will, denn alles was gegen ihn als Person, nicht gegen seine Familie aber gegen ihn direkt geht, wird vermutlich zutreffen. Sobald du irgendwas davon meldest gehörst du genauso dazu wie er.\n\nAber hast Recht, kann man ja nix machen. Ich würde mit sojemandem nicht mehr spielen, aber jeder hat seine eigenen Moralvorstellungen. Sagt aber immerhin etwas über die Person aus.","replies":[{"poster":"Spicavius","date":"2017-03-28T22:12:38.948+0000","up_votes":1,"down_votes":0,"body":"> Fakt ist, dass jeder, ja jeder, jemanden der sich absichtlich so asozial verhält beleidigen darf wie er will, denn alles was gegen ihn als Person, nicht gegen seine Familie aber gegen ihn direkt geht, wird vermutlich zutreffen.\n\nNein. Einfach nur nein. Du darfst auch nicht jemanden beleidigen, wenn er absichtlich feeden geht. Einfach nur nein. Und deswegen bannt Riot Leute auch, die hier immer wieder aufkreuzen und rumheulen, dass sie gebannt wurden, weil sie einen Feeder \"zurecht\" beleidigt haben.\n\nNach deinen Worten nach dürfte man auch einen Jungler, der dir den Bluebuff nicht abgegeben hat, beleidigen und zwar wie man will. Super. Tolle Einstellung.\nMan darf in keinem Fall jemanden beleidigen. Aber du hast ja scheinbar auch hier deine eigenen Moralvorstellungen. Jedem das Seine.\n\n> Wer ein solches Verhalten kommentarlos akzeptiert und denjenigen nichteinmal etwas zurechtweist scheint ja damit einverstanden zu sein. \n\nGut das kannst du natürlich nicht wissen, aber ich habe ihm schonmal gesagt, dass es nicht die feinste Art ist so mit seinen Mitspielern umzugehen. Aber so ist das eben. Er darf bannen und er bannt Champion XY. Auch wenn es der favorisierte Champ von XYZ ist. So ist das nunmal.\nDa kann ich nichts daran ändern und da es nur ein Spiel ist, bedeutet es nicht, dass man nur wegen einem Spiel eine Bekanntschaft oder Freundschaft ins negative ziehen muss. Nicht wegen solchen Sachen. Es gibt defintiv wichtigere Dinge im Leben als so eine Kleinigkeit an den Pranger zu stellen und dem Kumpel die gemeinsame Zeit am PC zu verwehren nur weil er mal einen Mitspieler trollt.\n\nAber wenn du das auf so ein hohes Podest stellst, ist das deine Sache. Ich finde nur, dass andere Dinge wichtiger sind.","replies":[{"poster":"SSI CptHaunted","date":"2017-03-29T06:21:59.312+0000","up_votes":1,"down_votes":0,"body":"Jemanden der absichtlich feeden geht kann ich reporten, den brauche ich nicht zu beleidigen. Aber schön, wie du das einfach mal ausweitest und verallgemeinerst. Mal ganz davon ab, dass ein BlueBuff als Laner zwar Nice2Have ist, aber in keiner Weise notwendig, wer wegen sowas beleidigt ist...na ja.\n\nFragt sich ob sich eure \"Freundschaft\" nur auf den PC bezieht oder warum es dann wieder so wichtig ist, dass ihr gemeinsam auf Troll-Tour geht. Aber wie heißt es so schön? \"Mitgefangen, Mitgehangen\". Also beschwer dich nicht wenn man dich zu den asozialen Leuten dazuzählt solange du dich nicht von solchem Verhalten distanzierst.","replies":[{"poster":"Spicavius","date":"2017-03-29T14:39:08.432+0000","up_votes":1,"down_votes":0,"body":"Sehe ich anders.\nWäre das nur eine PC Freundschaft, dann kann man in dem Punkt Druck ausüben, aber wenn es eine Reallife Freundschaft ist, dann ist so eine Kleinigkeit wirklich nicht nennenswert.\n\nÜbrigens ein Pick, den man spielen wollte ist auch in keinster Weise notwendig. Man kann auch andere Champs picken und erfolgreich spielen. Genauso wie man einen Bluebuff nicht bekommt. Dann muss man eben einwenig besser mit dem Mana haushalten. Keine große Sache.\n\nWürdest du denn wirklich mich als Flamer bezeichnen, wenn er Flamen würde und ich mit ihm spielen würde?\nDas läuft doch gerade auf das hinaus oder sehe ich das falsch?\nImmerhin beschuldigst du mich auf eine Troll-Tour zu gehen nur weil ich mit ihm spiele und er sein Verhalten nciht ändern will. Nur deswegen bin ich auch ein Troll?\n\nNach deiner Logik müsste ich auch ein Flamer sein, wenn ich mit Flamern zusammen spiele. Kläre mich auf, wenn ich dich falsch verstanden habe. Zumindest kam es mir so rüber.","replies":[{"poster":"SSI CptHaunted","date":"2017-03-30T16:22:41.326+0000","up_votes":1,"down_votes":0,"body":"Ob man andere Champs spielen kann oder nicht ist vollkommen irrelevant, es geht darum, dass dein Freund die Champs nicht bannt weil er nicht mit/gegen sie spielen will sondern um seine Mitspieler zu provozieren um sie dann melden zu können.\n\nDu vergleichst hier gerade mal wieder Äpfel mit Birnen. Wenn du keinen dieser Leute reportest hast du nichts damit zu tun, sobald du auch nur einen einzigen der von ihm absichtlich provozierten Leute meldest gehörst du mit ins Boot. Du weißt ganz genau, dass es durchaus nachvollziehbar ist warum die Leute sich aufregen und stellst dich dadurch auf seine Seite und wie es scheint feierst du es ja mehr oder weniger mit.","replies":[]}]}]}]}]}]},{"poster":"Mi3zekatze","date":"2017-03-28T10:33:36.404+0000","up_votes":1,"down_votes":0,"body":"So true","replies":[]}]},{"poster":"Wernicke","date":"2017-03-28T15:43:33.913+0000","up_votes":1,"down_votes":0,"body":"Großes Kino Applaus Applaus!!!\nAber wenn ich mich recht erinnere, bist du auch der Typ der absichtlich als Supp auf andere lanes gehst, auch wenn dein team sagt das es das nicht möchte und so ...  \nVon daher... Gleich und gleich gesellt sich gerne... \n(sollte meine Erinnerung falsch sein, ändert das trotzdem nix an dem von dir selbst beschriebenem Assiverhalten)","replies":[{"poster":"Spicavius","date":"2017-03-28T16:16:08.646+0000","up_votes":1,"down_votes":0,"body":"Oh lol. Bist schon der dritte.  Lies dir meinen Beitrag durch und verstehe bitte dass ich das nicht mache sondern mein Kumpel.\nIch habe dem TE sogar gesagt was er gegen so ein Verhalten tun kann.  Also warum bin ich denn jetzt der Assi? X).\n\nDas ist ja so als ob ich sagen würde dass ein Kumpel meine mates Flamen würde und ihr mich dann Runtermacht weil \"wir\" unsere mates Flamen.  Sinnfrei nicht? :)\n\n  PS. Ich bleibe immernoch bei meinen damaligen Argumenten, weil sie niemand logisch weg argumentieren konnte.  Ist übrigens ein ähnliches Thema wie das mit dem Nunu Supp und Singed Supp. Die meisten lol Spieler scheinen wohl der Meinung zu sein dass Riot sowas nicht bannen sollte, sonst gebe es ja nicht so einen shitstorm.\nAber wir schweifen ab.","replies":[{"poster":"Wernicke","date":"2017-03-28T18:16:40.544+0000","up_votes":1,"down_votes":0,"body":"Wer hier lesen und verstehen sollte, bleibt mit dir als Diskussionspartner wohl eine offene Frage...\n\n> weil sie niemand logisch weg argumentieren konnte\n\nKlar, du akzeptierst es nur nicht, z.B. weil du die Bedeutung von Meinung, Ansicht und Tatsache verwechselst.","replies":[{"poster":"Spicavius","date":"2017-03-28T18:31:29.682+0000","up_votes":1,"down_votes":0,"body":"Du gestehst dir nicht Mal deinen Fehler ein. Du hast es also nicht verstanden. Nochmal für dich.\nIch habe von einem anderen Menschen und seinem Verhalten anderen gegenüber erzählt und du hast mich direkt auf die selbe Stufe gestellt.  Aber gut. Vllt solltest du dich mit Differenzierung auseinandersetzen und nicht alles und jeden in einen Topf werfen. Schade um dich. Was solls..\n\nDie Meinungen unterscheiden sich nunmal zu dem wohlgemerkt alten Thema und Tatsache ist, dass man das darf. Punkt. Thema sollte eigentlich erledigt sein.","replies":[{"poster":"Wernicke","date":"2017-03-28T19:07:49.115+0000","up_votes":1,"down_votes":0,"body":"Wenn kein Fehler vorliegt, gibts auch nix einzugestehen.\nWeißte, anderen Unwissenheit zu unterstellen ist eine ganz undankbare Eigenschaft. Nur mal so als Denkanstoß.\nVor allem, wie kommst du auf deine Gedanken? Was sollte man da nicht verstehen?? Du hast Sätze benutzt die nun nicht sonderlich schwer zu verstehen waren. Aber lustig deine Gedankengänge zu erahnen ^^\nWeil ich es gelesen habe, ist mir schon klar das du nicht der Protagonist bist, sondern nur die Nebenrolle besetzt. In dem von dir erzälten Kontext aber eine, die dieses Verhalten deines dude's \"unterstützt\". \nUnd achtung, jetzt wirds subjektiv: Und das ist für mich ebenso assiverhalten sry. Das darfst du gerne anders sehen.\n\nDein altes leidiges Thema rolle ich hier nicht weiter auf. Dir ht man oft genug erzählt was man davon hält...","replies":[{"poster":"Spicavius","date":"2017-03-28T22:35:48.609+0000","up_votes":1,"down_votes":0,"body":"Eben du sagst es. Ich habe so einfache Sätze benutzt, dass man es eigentlich verstehen sollte. Nun gut. Ist halt nur schade, wenn selbst dann einige es nicht verstehen oder nicht verstehen wollen.\n\nDass du mir Assiverhalten unterstellst ist übrigens auch nicht das Feinste.\nGut. Ich spiele mal hierbei mit.\n\nErkläre mir bitte in welchem Punkt ich meinen \"Dude\" in seinem Verhalten \"unterstütze\".\n\nNur um mal einige Punkte vorweg zu nehmen, damit du auch meine Sicht der Dinge hast.\nIch habe dem TE erklärt wie solche Menschen \"ticken\" und wie man deren Lust so ein Verhalten zu zeigen kontern kann. (Also sich nicht aufregen, da die sich damit nochmehr sozusagen aufgeilen).\nWürde ich so ein Verhalten unterstützen, würde ich doch garkeine Tipps geben.\n\nWenn du nun sagst, dass ich das Verhalten meines Freundes einfach so hinnehme und ich ihn gerade deswegen unterstütze, dann kannst du das gerne weiter so sehen.\nNur persönlich finde ich, dass jeder das machen sollte, was er/sie will. Wenn er Spielern die Champions wegbannen will, dann soll er das doch ruhig tun. Wenn mir jemand meinen Champion wegbannt, dann ist das eben so. Das interessiert mich aber auch nicht.\n\nWenn du nun weiterhin denkst, dass ich so ein Verhalten unterstütze nur weil ich dieses Thema als nicht wichtig einstufe um wirklich aktiv gegen meinen Freund zu agieren, dann ist das eben so. Ich denke nur, dass man sich wegen sowas nicht von seinen Freunden distanzieren sollte. Also distanzieren im Sinne von \"ich spiele nicht mehr mit dir, wenn du so weiter machst\".\nDa gibt es eindeutig wichtigere Dinge.\n\nWas würdest du denn an meiner Stelle tun? Jetzt nachdem du nun auch meine Sicht der Dinge kennst.\n\nNicht mehr mit ihm spielen ist, wie du nun weißt albern für mich.\nEinen Streit deswegen anfangen. Ist auch Unsinn. Wegen sowas zumindest nicht.\n\n________________________________________\nGanz anderes Thema.\nMir ist im Verlauf unserer Diskussion einfach nebenbei erwähnt ziemlich stark aufgefallen, dass du ein ziemlich unangenehmer Diskussionspartner bist. Keine Ahnung, ob das andere auch so sehen wie ich, aber ich habe mir mal deine letzten Antworten im Forum angesehen und die scheinen sich alle relativ arrogant zu lesen und dass du oft unfreundlich kommentierst.\nWeiß nicht ob das Absicht von dir ist oder einfach nur eine unabsichtige Ader, die aus dir herauskommt im Forum. Zumindest wollte ich dich mal darauf aufmerksam machen :/\nZuegegebenermaßen habe ich nun auch nicht allzu freundlich im Verlauf unserer Diskussion geantwortet, da deine Kommentare wie gesagt ziemlich arrogant und unfreundlich auf mich gewirkt haben.","replies":[{"poster":"Abasin","date":"2017-03-29T06:08:13.305+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}\nIch liebe Euch beide. Herzerfrischender Disput.","replies":[{"poster":"Spicavius","date":"2017-03-29T13:21:37.606+0000","up_votes":1,"down_votes":0,"body":"jop ^^ darum geht es im einem forum :P und deswegen machen wir es doch alle außer diejenigen die sich einfach nur an dem Geweine der Permagebannten belustigen. ;D","replies":[]}]},{"poster":"SSI CptHaunted","date":"2017-03-29T06:35:59.222+0000","up_votes":1,"down_votes":0,"body":"Jeder soll das machen was er/sie will? Ich möchte wetten, wenn wir zusammen in einem Team wären, du im Jungle spielst und ich einfach mitrenne und dir den ganzen Farm stehle findest du das auch nicht so lustig. Schädlich fürs Team ist es genauso wie das was dein Freund macht.\n\nAbgesehen davon hast du aus deiner Perspektive berichtet wie \"herrlich diese Spieler sich aufregen, dass man sie noch berechtigt reporten kann\". Ich erkenne darin nichts was darauf hinweist, dass lediglich dein Freund es \"herrlich\" findet.\n\nWas ich tun würde? Ich würde ihm ganz klar sagen was ich davon halte und ihn vor die Wahl stellen, es sein zu lassen oder er soll eben alleine spielen. Wenn man als Kollektiv spielt, auch wenn es hier nur 2 Leute sind, wird man auch als solches wahrgenommen, in anderen Spielen wirkt sich das Verhalten einzelner Spieler auch auf die Reputation ihrer Gilde/Clan/whateveryouwanttocallit aus. Aber Menschen sind unterschiedlich, nur brauchst du dich nicht zu beschweren wenn du bei Leuten mit ähnlichen Vorstellungen von \"angemessenem Verhalten\" dich mit ihm auf der gleichen Stufe stehst.","replies":[]},{"poster":"Wernicke","date":"2017-03-29T06:17:38.869+0000","up_votes":1,"down_votes":0,"body":"> Was würdest du denn an meiner Stelle tun? Jetzt nachdem du nun auch meine Sicht der Dinge kennst.\n\nDeine Sicht der Dinge kann ich dafür ja völlig außer acht lassen. Ich habe es gelesen und weiß das du das so siehst, ok. \nAber, ja, ich würde tatsächlich zu ihm sagen das er das lassen soll, und wenn er das nicht tut, würde ich auch nicht mehr mit ihm spielen. \nKlar gibt es wichtigere Dinge. Nur wenn ich Feierabend habe, möchte ich einfach nur gemütlich Paar Runden spielen. Da brauch ich keinen Dulli in meinem team der schon vor Spielbeginn trollt und für schlechte Stimmung sorgt.\nWenn er das aus taktischen Gründen machen würde, wäre das ja ne ganz andere Hausnummer. Aber so, wissentlich champs wegbannen nur um andere zu ärgern?! Nee, da würd ich sagen, leck mich am A****, auf son Quatsch habe ich kein Bock.\nDenn wie gesagt, ich will einfach nur gemütlich bissl spielen, das im Optimalfall ohne Zickerei.\n\nUnd ja, natürlich unterstelle ich dir, da du das so hin nimmst und quasi das Spielchen mitspielst, ein gewissen negatives Verhalten. Weil es eben meine Sicht der Dinge ist. \nDas heißt ja nicht das ich denke das du im echten Leben voll der Assi bist, wahrscheinlich biste ein ganz normaler Typ mit dem man sich prima unterhalten könnte. Aber was dein Verhalten im Spiel betrifft, also da kommen wir nicht auf einen Nenner :D\n\nWie gesagt, ist ja auch nur ein Denkanstoß. Vlt sagste ihm doch mal dass das nicht so die feine Art ist. Vlt auch nicht, und machst einfach so weiter.\nJeder ist seines Glückes Schmied ;)","replies":[]}]}]}]}]}]}]},{"poster":"Time2Whine","date":"2017-03-28T09:43:11.110+0000","up_votes":1,"down_votes":0,"body":"Herzlich Willkommen am Abgrund der LoL Gesellschaft. Was für eine Einstellung habt ihr denn bitte? Spieler mit Absicht provozieren um zu hoffen dass sie ausfallend werden um sie dann am Ende des Spiels zu reporten?\nDas geht gar nicht! Ihr sollt mit euren Mitspielern zusammenspielen und sie nicht gegeneinander aufhetzen oder provozieren! Zumal ihr ja auch wisst dass durch sowas Spiele verloren werden, weil eure Mitspieler zum Start hin schon genervt sind.\nWarum spielt ihr das Spiel überhaupt wenn ihr sowieso nicht gewinnen wollt, sondern lieber euren Mitspielern das Spiel verderben wollt? Das ist echt das Allerletzte von euch!","replies":[{"poster":"Spicavius","date":"2017-03-28T16:09:27.964+0000","up_votes":1,"down_votes":1,"body":"Du redest von euch/ihr. Wieso? Lies dir meinen Post nochmal durch.  Und ja ich Reporte Spieler wenn sie ausfallend werden und ja es ist mir egal was für einen Grund die haben. \n\nMir brauchst du nicht zu erklären wie ich mit meinen mates umzugehen habe. Ich habe sogar dem TE Tipps gegeben wie man solchen Leuten die Lust an so einem Verhalten weil ich nunmal direkt Kontakt mit so einer Person habe.  Also wo ist jetzt dein Problem mir gegenüber? ^^","replies":[]}]},{"poster":"Truppii","date":"2017-03-27T23:33:07.787+0000","up_votes":1,"down_votes":0,"body":"Zumal man nicht zwangsweise zeigen muss was man spielen will. Einfach nicht vorher deinen Champ wählen und  hoffen das er nicht unter den Top Bans ist. ;)","replies":[]}]},{"poster":"Shiraki","date":"2017-03-28T03:08:22.767+0000","up_votes":1,"down_votes":14,"body":"***","replies":[{"poster":"Homunculi","date":"2017-03-28T14:02:57.235+0000","up_votes":1,"down_votes":0,"body":"Was sind Renas?","replies":[{"poster":"Vogeljunges","date":"2017-03-28T14:34:23.937+0000","up_votes":1,"down_votes":0,"body":"Herzensbrecher scheinbar :D","replies":[{"poster":"Rena","date":"2017-03-28T18:38:20.408+0000","up_votes":2,"down_votes":0,"body":"ja man ist mein Nachname","replies":[{"poster":"Homunculi","date":"2017-03-28T19:19:54.775+0000","up_votes":1,"down_votes":0,"body":"Aber wieso benutzt sie dich als Negativum?","replies":[{"poster":"Shiraki","date":"2017-03-29T01:59:23.180+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Vogeljunges","date":"2017-03-29T06:39:20.080+0000","up_votes":1,"down_votes":0,"body":"Magst nicht lieber ein paar schöne \"das Leben ist so gemein, du hast mein Herz herausgerissen\"-Songs von diversen jungen Bands hören anstatt hier im Forum einen eher peinlichen Rachefeldzug zu versuchen Shiraki...\n\nSei mir nicht bös´, aber das ist schon etwas kindisch und alsbald wird es dir unangenehm sein, dass du deswegen nun im Forum immer damit verbunden sein wirst.","replies":[]}]}]}]}]}]},{"poster":"Bettnachleger","date":"2017-03-28T05:52:31.864+0000","up_votes":4,"down_votes":0,"body":"Hoere auf die wie ein Kindergartenkind zu benehmen. \nWenn du ein Problem mit einer Person hast, klaere das mit der Person stat hier so einen Stuß zu schreiben.","replies":[]},{"poster":"Vogeljunges","date":"2017-03-28T08:14:02.862+0000","up_votes":2,"down_votes":1,"body":"Huh, da hat sich aber jemand ganz und gar nicht im Griff.","replies":[]}]},{"poster":"Nivoras","date":"2017-03-28T13:01:12.942+0000","up_votes":2,"down_votes":0,"body":"Kann dein Team verstehen, ich hab auch kein Bock mir von den Leuten auf meiner Elo was sagen zu lassen, vor allem weil die Leute die vorm Spiel am meisten Labern in game dann zu 75% kacke sind^^\nWenn ich was lernen möchte/Fragen habe dann frage ich Leute die auch ahnung vom Spiel haben und nicht den Random in der Champs Select","replies":[]},{"poster":"Alustus","date":"2017-03-28T00:26:06.700+0000","up_votes":2,"down_votes":0,"body":"Und welchen nutzen hätte Riot davon nette Spieler mit toxischen zu matchen?\nDavon abgesehen wurde das Thema schon 1000x diskutiert.\n\nIch verwende meine Bannauswahl so wie ich sie möchte.\nSprich wenn ich weder mit Champion X noch gegen Champion X spiele dann bann ich diesen.\n\nDas hat nichts mit Trollen zu tun oder toxischem Verhalten sondern mit auch persönlichen präferenzen.","replies":[{"poster":"IQ FortyTwo ","date":"2017-03-28T02:53:12.358+0000","up_votes":1,"down_votes":10,"body":"Der nutzen wäre eine balance zu schaffen, damit nicht soviele hochkommen. In diesem system kann es nur eine bestimmte % an hochrangigen spielern geben, deshalb bleibst du da wo du bist, wenn du besser bist als der durchschnitt deines elos, du steigst nur wirklich, wenn du VIEL VIEL besser bist und das system dient eben dazu, dass net zuviele auf dia+ kommen, es macht ziemlich sinn und wäre gerissen.","replies":[{"poster":"Maíko","date":"2017-03-28T05:55:13.045+0000","up_votes":2,"down_votes":0,"body":"Ich finde deinen Namen iwie passend.\n\n>Der nutzen wäre eine balance zu schaffen, damit nicht soviele hochkommen\n>dass net zuviele auf dia+ kommen, es macht ziemlich sinn und wäre gerissen.\n\nSobald jemand absteigt, steigt ein anderer auf.\nSollte ein neuer nach Dia einziehen, wird ein anderer dafür runtergestuft.\nDie Verteilung wie sie jetzt ist wird somit im großen und ganzen nicht verändert.\nEin System wie du es beschreibst macht also sehr wenig Sinn...der prozentuale Anteil der Dia Spieler wird auch ohne solch ein System niemals merklich ansteigen.","replies":[]}]}]},{"poster":"AI Yjuq","date":"2017-03-28T00:39:30.411+0000","up_votes":3,"down_votes":2,"body":"Kokosnuss","replies":[{"poster":"Shacoláde","date":"2017-03-28T14:40:09.990+0000","up_votes":1,"down_votes":2,"body":"Birne","replies":[{"poster":"Good Guy Putin","date":"2017-03-28T18:26:37.151+0000","up_votes":1,"down_votes":1,"body":"Pizza","replies":[]}]}]},{"poster":"Alânte","date":"2017-03-27T23:21:01.097+0000","up_votes":3,"down_votes":2,"body":"xdxxdxddxd","replies":[]}]}