{"poster":"IQ FortyTwo ","date":"2016-07-29T12:22:41.596+0000","title":"Skill VS Skill In Solo-Que","subforum":"Champions & Gameplay","up_votes":0,"down_votes":2,"body":"Nun ich habe mir die Frage gestellt, wie der Skillunterschied zwischen den Beiden Arten von Gamern steht. \n\nDer Eine qued sich solo in die Solo-Que. Der Andere qued sich mit 2 weiteren Partnern in die Solo-Que, von denen er wei&szlig;, dass sie gescheiht spielen k&ouml;nnen und sich auch im Voice unterhalten. \n\nBeide Spieler erreichen sagen wir mal... Platin 5, beide bekommen die Season Rahmen usw. \n\nW&uuml;rde derjenige, der sich immer mit seinen Mates qued auch noch auf Platin halten, wenn er ohne seine Mates spielen würde? Wenn nicht, sollte &#039;&#039;Skill&#039;&#039; nicht neu definiert werden? \n\nIQ","replies":[{"poster":"Ozuraak","date":"2016-07-29T13:51:08.508+0000","up_votes":2,"down_votes":1,"body":"Da es ein Teamspiel ist, ist es auch fair, mit einem Team (bzw. Premades) eine gewisse Elo zu erreichen.\n\nNimm dir unserer Nationalmannschaft bei der WM 2014. Zusammen wurden sie Weltmeister, alleine hätten sie das nicht geschafft. Macht das ihren Erfolg jetzt schlechter?","replies":[{"poster":"IQ FortyTwo ","date":"2016-07-29T14:25:35.263+0000","up_votes":1,"down_votes":4,"body":"Dein Comment macht wirklich überhaupt keinen Sinn und der Vergleich ist vollkommen... wie soll ich sagen? Dumm.\n\nIQ","replies":[{"poster":"Ozuraak","date":"2016-07-29T15:29:21.885+0000","up_votes":1,"down_votes":0,"body":"Der Kommentar macht auch keinen Sinn, er ergibt Sinn. Und der Vergleich ist treffend.\n\nIn einem Teamspiel gewinnst du als Team und du verlierst als Team.","replies":[{"poster":"IQ FortyTwo ","date":"2016-07-29T18:50:04.576+0000","up_votes":1,"down_votes":3,"body":"Unsinn.","replies":[{"poster":"Ozuraak","date":"2016-07-31T16:22:46.997+0000","up_votes":1,"down_votes":0,"body":"Dann hast du das Prinzip eines Teamspiels einfach nicht verstanden.","replies":[]}]}]}]}]},{"poster":"Good Guy Putin","date":"2016-07-29T16:48:55.744+0000","up_votes":1,"down_votes":0,"body":"Da die Teams in 98% die selbe Konstellation haben (also zB 2 premades, 3 Solo) macht es einfach keinen Unterschied ob einer sich Solo anmeldet oder nicht.","replies":[]},{"poster":"Skagerak","date":"2016-07-29T12:34:28.997+0000","up_votes":1,"down_votes":0,"body":"Ich finde das ist schwer zu vergleichen, du musst ja auch so sehen, das die auch immer gegen andere Premade Teams spielen. Ich weiß ehrlich gesagt nicht was ich davon halten soll. Einerseits hast du premades es wird aber gleichzeitig auch schwerer. Wenn du solo spielst hast du es natürlich nicht so schwer da du nicht gegen ein abgesprochenes Team spielen musst ( klar kommt man mal mit Premades zusammen). Aber ob der eine mehr Skill aht als der andere Wage ich zu bezweifeln. Wenn du dich natürlich von deinen Freunden mitziehen lässt und du selber weißt das du nicht gut genug bist dann stimmt es das der solo Spieler mehr Skill hat. Aber das ist mehr boosten als dynamic für mich. Wenn aber alle Premades auf dem gleichen Level spielen, dann ist das denke ich nicht der Fall, da sie sich ja auch verbessern genauso wie der solo Spieler. Klar Sie haben Voice Chat und so aber wie schon gesagt auch den Nachteil das sie auch gegen Premades spielen müssen.","replies":[{"poster":"Ritos Elo Police","date":"2016-07-29T13:28:00.016+0000","up_votes":1,"down_votes":0,"body":"Naja, hab auch schon solo gesucht und ein 5er pre gegner team gehabt, mit nem zweier pre in meinem Team. Btw suche ich meistens alleine, bekomme trotzdem genug 2-3-4er premades ab. ist übrigens auch ein Grund warum viele Dynamic que nicht leiden können.^^","replies":[]}]}]}