{"poster":"PA Nygma","date":"2016-11-10T08:36:58.839+0000","title":"Silber Mitspieler für Teamranked gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nsuchen f&uuml;r ein Ranked Team wie oben geschrieben einen Top Laner und einen Jungler zwischen Silber V bis Silber I.\r\nWir sind:\r\n-Silber III Mid Laner (21 Jahre Alt) Mains:  {{champion:268}} {{champion:13}} {{champion:134}} \r\n-SIlber III ADC (16 Jahre Alt) Mains:   {{champion:81}} {{champion:18}} {{champion:110}} \r\n-Silber II Supporter (24 Jahre Alt)   Mains{{champion:432}} {{champion:201}} {{champion:223}} \r\n\r\nSpielen seit einigen Wochen zusammen und wollen uns nat&uuml;rlich stetig als Team weiterentwickeln.\r\n\r\nNun zu dir:\r\n-18+ (16 im Zweifel noch OK/wir testen ja sowieso ob es passt)\r\n-Mindestens im Silberbereich.\r\n-Flexibel im Championpool.\r\n-Haupts&auml;chlich suchen wir Jungle und Top Laner, aber auch 2 Subs w&uuml;rden sicherlich Platz bei uns finden.\r\n-Tilt und Flamefrei (Schlechter Tag hat Jeder mal......die Floskeln kennt ihr ja alle.)\r\n-Kritikf&auml;hig und auch in der Lage konstruktive Kritik zu geben. (Kontinuirlicher Verbesserungsprozess)\r\n-Aktiv\r\n-TS&sup3; und gutes Headset\r\n\r\nDas ganze soll effektiv am 19.11. starten. Bis dahin wollen wir trialn. Teamname wird dann, sobald das Line-Up steht, gemeinsam festegelegt.\r\nFeste Trainingszeiten werden abgesprochen, sobald wir wissen wie Ihr auch Zeit habt. geplant ist aber schon 3 mal die Woche und was sich sonst so ergibt.\r\n\r\nWenn wir dein Interesse geweckt haben, dann melde dich entweder bei MFedT Nigginz oder bei Sekuro.\r\nBitte nur bei ernsthaftem Interesse.","replies":[{"poster":"Serious Flash","date":"2016-11-10T11:09:54.325+0000","up_votes":1,"down_votes":0,"body":"Hallo :) \n\nich bin Main Jungle, und wenn ich SoloQ spiele dann nehm ich als zweite Wahl am liebsten Toplane. Ich habe alle Champs bin silver2 und 22Jahre ich denke das passt doch ganz gut soweit.\n\nhab euch auch ingame schon geadded.\n\nfreue mich auf eine Antwort","replies":[]},{"poster":"Enigmâ","date":"2016-11-10T10:38:29.392+0000","up_votes":1,"down_votes":0,"body":"Ich hätte durchaus Interesse an einem Ranked Team platz für die kommende Season!\n\n> Erstmal alles was das Spiel betrifft :\n> Mein Ingame Name lautet derzeit \"**Akali Tsundere**\" , und ich bin momentan gerade noch so \n>  _**Silber 2**_. ^^\n>  Ich bin momentan in keinem aktiven Ranked Team und spiele als _**Allrounder**_ , kann also als Auswechselspieler sowie als auch _**Toplaner**_ oder **_Jungler_** euch behilflich sein!\n> \n>  Ich habe derzeit nur einen Champion den ich \"Main\" nennen kann , dass ist Akali. Da ich Allrounder bin kann ich daher nicht jeden Champ aufzählen aber ich nenne euch ein paar Beispiele von Champions die ich auf anderen Lanes spiele :\n> Top : {{champion:78}} ,{{champion:39}}\n> Jungle : {{champion:113}} ,{{champion:76}}\n> Mid :{{champion:157}}{{champion:84}}\n> ADC :  {{champion:202}} \n> Support : {{champion:89}}\n> \n> Weitere Infos findet ihr auch hier : http://www.lolking.net/summoner/euw/62208296\n\n\nSo , da ihr nun genug über mein Spielerleben Bescheid wisst kommen wir nun zu RL daten :\n\nMein Name lautet Alexander und ich bin derzeit 15 Jahre alt/jung\n\n Und : ja ich habe eure Anforderungen gelesen würde aber trotzdem gerne mal bei euch vorbeischauen damit ihr euch dann ein Bild von mir machen könnt , schließlich dauert's sowieso noch ein Weilchen bist Season 7 beginn ^^\n\nDa ich voraussichtlich die Schule mit 16 oder 17 abschließe (Steht noch nicht fest) werde ich in der Woche erst Nachmittags an Training , Spielen etc. teilnehmen können.\n\n{{sticker:slayer-jinx-wink}} \n**Mfg Alexander (Akali Tsundere)**\n\nIch habe neben der Bewerbung auch noch _Sekuro_ in LoL geaddet , wobei ich _MFedT_ nicht finden konnte ^^\nEinen Teamspeak kann ich gegebenenfalls ebenfalls bereitstellen!","replies":[]}]}