{"poster":"Nico21","date":"2017-10-24T18:21:03.038+0000","title":"Versuche Verbindung wiederherzustellen... WER HAT DAS NOCH?!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich kriege nach jedem mal einloggen direkt das Fenster &quot;Versuche Verbindung wiederherzustellen...&quot; im Client. Daher hatte ich mich an den support gewendet, das ging eine weile hin und her.\r\nMan kam zu dem Ergebnis: Es hilft wenn ich ein Programm verwende, das vorgibt das ich in einem anderen Land bin (z.B. Brasilien) dementsprechend ist mein ping dann auch h&ouml;her.\r\n\r\nJetzt ist es aber so, das ich keine Lust habe ewig mit so einem Programm zu spielen.\r\nDas ist &uuml;brigens nur bei LoL so und sonst nirgends anders!\r\n\r\nIch habe in den letzten 2-3 Monaten sehr viele Threads mit dem Problem gesehen, allerdings sind die alle verschwunden.. auch ohne L&ouml;sung des Problems\r\n\r\nDaher die Frage, wer von euch hat das zurzeit?\r\nEs nervt extremst...\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\np.s. manchmal geh&ouml;rt auch dazu das man beim einloggen Authentifizierung.... einfach h&auml;ngen bleibt","replies":[{"poster":"Jensoo","date":"2017-10-28T13:59:26.372+0000","up_votes":1,"down_votes":0,"body":"Gibt es etwas neues?","replies":[{"poster":"Nico21","date":"2017-10-29T13:11:08.535+0000","up_votes":1,"down_votes":0,"body":"Ja, der Support hat geantwortet und meinte ich solle mal so eine Anleitung aus dem Amerikanischen Forum befolgen (mit link), das ganze habe ich getan hat aber keine Besserung gebracht.\nZudem wurde mir geraten die Firewall mal zu deaktivieren, half aber auch nicht.\nDann hieß es noch ich solle Ports in meinen Routereinstellungen hinzufügen für die LoL-Verbindung, das ganze ging aber irgendwie nicht..\n\nAlso habe das Problem immer noch.\nDa ich Parallels habe, also Windows 10 auf meinem Mac besitze, probier ich LoL da jetzt mal aus und berichte dann.","replies":[{"poster":"Nico21","date":"2017-10-29T13:17:31.340+0000","up_votes":1,"down_votes":0,"body":"Update:\nAuf Parallels sprich Windows 10 auf meiner Macoberfläche läuft LoL einwandfrei und ich habe das Problem nicht! \nAlso muss es an MacOS bzw. an dem Client für MacOS liegen.","replies":[{"poster":"Nico21","date":"2017-10-30T14:44:06.264+0000","up_votes":1,"down_votes":0,"body":"Der Support hat mir nochmal geantwortet, kurz zusammengefasst:\nVPN benutzten bis das Problem gelöst ist.\nRiot weiß über das Problem bescheid und es wird wohl daran gearbeitet, wie lange das dauert weiß man nicht.","replies":[]}]}]}]},{"poster":"Jensoo","date":"2017-10-26T21:52:53.109+0000","up_votes":1,"down_votes":0,"body":"Kannst du dann das Ergebnis mir melden? ig oder hier bitte :)","replies":[]},{"poster":"Jensoo","date":"2017-10-26T16:57:02.381+0000","up_votes":1,"down_votes":0,"body":"Die sollen das nun endlich mal fixen. Das geht so aufn Sack man kann kaum mal gechillt LoL spielen. Ich brauche gefühlte 20 minuten um überhaupt in den Clienten reinzukommen.....","replies":[{"poster":"Nico21","date":"2017-10-26T18:47:21.800+0000","up_votes":1,"down_votes":0,"body":"Ja, genau deiner Meinung..\nHab übrigens nochmal ein Ticket an den Support geschrieben, mal sehen was kommt..","replies":[]}]},{"poster":"Pandeonor","date":"2017-10-24T18:51:36.911+0000","up_votes":1,"down_votes":0,"body":"whut? Brasilien ^^ - das ist ja lustig.\n\nMehr Informationen wären nett. Ich gehe davon aus das Du und der Support alles an DNS-Geschichten bereits durch habt.  Das macht es leider nicht leichter sondern schwieriger.\n\nVon Anfang an bitte. Was hast Du schon gemacht? Welches Betriebssystem?  [Ich fürchte ja Mac] Ein Pingplot bitte!","replies":[{"poster":"Nico21","date":"2017-10-24T19:29:38.558+0000","up_votes":1,"down_votes":0,"body":"war ein Beispiel mit Brasilien, geht rein theoretisch jedes Land :) Ist ein VPN-Client. Trotzdem mega nervig nur so LoL zocken zu können...\nJa, mit dem Support bin ich bereits alles durch.\n\nBetriebssystem ist Mac, wieso \"fürchte\"? o.O\n\npaar Infos:\nProblem ist seit mehr als 2 Monaten, eben nur mit dem VPN-Client lösbar.\nAlles andere läuft perfekt, abgesehen von LoL.\nBin Kunde bei der Telekom.\n\nwas ich bereits gemacht habe:\nhextech repair tool\n100000x lol deinstalliert und neu installiert\nFirewall Einstellungen auf jede erdenkliche weise umgestellt und ausprobiert\nMit dem support zusammen eine Netzwerkanalyse und ein Systembericht\nund noch im sicheren Modus gestartet.\n\nUnd was genau meinst du mit Pingplot? meintest du vil Pingreport? :D\n\n\nHier übrigens ein Zitat aus dem ticket eines Supporters:\n\nEs scheint, dass die Störung nach der letzten Patch Version aufgetreten ist. Diese Störung wurde von vielen Mac User berichtet (meistens MacOS 10.12). Wir überprüfen die Ursache für diese Störung und werden so schnell wie möglich ein Fix dafür anbieten.\n\nDas ist jetzt etwa 2 Monate her, geschehen ist leider nichts. \n","replies":[{"poster":"Pandeonor","date":"2017-10-24T19:51:03.141+0000","up_votes":1,"down_votes":0,"body":"Pft. Wollte mich irgendwann einmal mit dem Problem beschäftigen, aber Mac kenne ich nicht und ist mühsam - was Fehlersuchen zur Unmöglichkeit macht. Die letzte Erinnerungsnotiz dazu ist, das es sich umgehen lässt indem man es z.B. über sein Handy (als WISP konfiguriert) routet (sollte damit auch über jeden AP so funktionieren der als WISP laufen kann). Wollte mich einmal damit beschäftigen weshalb dem so sein könnte..... Irgendwas machen Mac oder Mac-Client anders, was vielleicht eine Latenz im Datenstrom verursacht. \n\nAber das ist nur die Erinnerungsnotiz. Ich meine es gab vor ein paar Wochen auch im Deutschen Forum einen Thread dazu.\n\nWird etwas wie ein AP zwischengeschaltet fällt der Schluckauf also evtl. weg. Das könnte der bessere Weg sein. Vielleicht kannst Du Dir irgendwo einen zum testen ausleihen. Wenn es funktioniert kostet ein billiger unter 20 EUR und gebraucht unter 10 EUR. Ich weiss jedoch nicht ob nicht WISP benötigt wird (befürchte ja). \n\n--> Die Ursache wäre damit eben noch nicht behoben oder gefunden. Nur wäre die Umgehung etwas eleganter.","replies":[{"poster":"Nico21","date":"2017-10-24T20:02:43.717+0000","up_votes":1,"down_votes":0,"body":"hmmm, okay...\nAlso es liegt nicht an meinem Mac selber? oder an meinem Router oder Internet? Es ist so wie ich das verstehe ein Problem das häufiger auftritt?\n\nWas genau ist den etwas wie ein \"AP\"?","replies":[{"poster":"Pandeonor","date":"2017-10-24T20:36:55.639+0000","up_votes":1,"down_votes":0,"body":"Woran es liegt ist schwer zu sagen. Es ist kein Hardware-Defekt und es liegt nicht am Internet. Aber es kommt m.E. auch nicht bei jedem Mac vor, so das es auch nicht am Client als solchem liegen wird. Das es nicht Windows ist macht eine Fehlersuche schwierig, da ich mich keinen Meter damit auskenne.\n\nEs tritt m.E. häufiger auf (wenn es das ist und ich es richtig in Erinnerung habe.... bei Zig gelesenen Threads kann ich mich aber evtl. auch täuschen ☺ ). \n\nAP heisst AccessPoint, vereinfacht: ein Router. Eine Fritzbox ist ein Modem mit Router (die kann man auch zum testen nehmen). Es gibt auch reine Router (die sind oft billig; billige können aber meist kein WISP). Ich _meine_ (Erinnerungsnotiz) das manche mit dem Problem via WLAN ins Netz gegangen sind. Man kann Handys als Hotspot einrichten, dann funktionieren die im sog. WISP-Modus als eine Art persönlicher Provider [wie eben ein Hotspot]. Ich _meine_ das die Spieler ein Handy als Hotspot eingerichtet hatten und über diesen gespielt. Also  Mac->Handy->Riot. Das ging dann ohne die Schwierigkeiten. \n\nDie Frage ist \"weshalb\" - und reicht evtl. ein schlichter AP dazwischen um das Problem zu beseitigen? Wenn ja, dann wäre das Problem mit 20 Euro zu umgehen. Ein Accesspoint zwischen Mac und Modem/Router gesetzt und gut ist. ☺ Kostet neu 20 Euro + 1 kurzes LAN-Kabel.","replies":[{"poster":"Nico21","date":"2017-10-24T20:42:14.868+0000","up_votes":1,"down_votes":0,"body":"Okay, danke für die Antwort. So habe ich es verstanden :)\n\nDas einzige was ich bisher noch nicht probiert habe, (da ich nur über WLAN spiele) ob es mit einem LAN-Kabel funktioniert. Meinst du das könnte etwas bringen? da ich mir zuerst eins besorgen müsste..\n\nDas mit dem Hotspot probier ich morgen mal aus und meld mich dann nochmal :)","replies":[{"poster":"Pandeonor","date":"2017-10-24T21:18:25.804+0000","up_votes":1,"down_votes":0,"body":"Das könnte auch etwas bringen. Das mir dem Handy wird imho funktionieren {{sticker:galio-happy}}","replies":[{"poster":"Nico21","date":"2017-10-25T13:02:19.799+0000","up_votes":1,"down_votes":0,"body":"Also, LAN-Kabel bringt nichts. Das mit dem Handy funktioniert, allerdings nur wenn ich den Hotspot so lange an lasse bis ich ingame bin und dann erst wieder auf mein normales WLAN online gehe. Sobald das game zu ende ist muss ich mich erneut einloggen per Hotspot.\n\nAufjedenfall danke für deine Hilfe, wenigstens eine Notlösung :)","replies":[{"poster":"Pandeonor","date":"2017-10-25T18:33:13.947+0000","up_votes":1,"down_votes":0,"body":"Es bleibt der Versuch mit einem AP offen. Der könnte das Handy dauerhaft ersetzen.","replies":[{"poster":"Nico21","date":"2017-10-26T15:08:45.463+0000","up_votes":1,"down_votes":0,"body":"Ja, das werde ich wohl auch ausprobieren.\nAllerdings verstehe ich einfach nicht warum dagegen nichts gemacht wird. Den Fehler haben wohl mehrere.\nAnfangs lief ja alles, mit dem selben Mac, dem selben Router, dem selben Internet. Also muss ja bei irgendeinem Patch der Fehler angefangen haben. Wieso fixxen sie das einfach nicht >.<","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Jensoo","date":"2017-10-24T20:21:52.095+0000","up_votes":1,"down_votes":0,"body":"Hab das Problem nach einem Patch bekommen glaube vor 2 Patches. Mein Mitbewohner benutzt auch ein Mac und wir haben es am selben Tag bekommen. Habe das Problem seit circa 3 Wochen.","replies":[{"poster":"Nico21","date":"2017-10-24T20:29:26.283+0000","up_votes":1,"down_votes":0,"body":"hmm.. wirklich komisch. Wenigstens bin ich echt nicht alleine..\n\nWenn man lange genug wartet mit dem Versuche Verbindung wiederherzustellen..., dann kann man ja irgendwann spielen. Funktioniert bei dir da noch das Beute-System? bei mir kommt da dann auch immer eine Fehlermeldung. Und Quests sehe ich egal wie lange ich warte auch nie. Ist das bei dir auch so?","replies":[]}]},{"poster":"Jensoo","date":"2017-10-24T19:38:48.081+0000","up_votes":1,"down_votes":0,"body":"Habe auch Mac.. immer müssen wir benachteiligt werden! :P","replies":[{"poster":"Nico21","date":"2017-10-24T19:46:51.188+0000","up_votes":1,"down_votes":0,"body":"wie lange hast du das Problem schon? \nDas komische ist es wird nicht bei allen Macs so sein, sonst wäre schon viel mehr Theater um das Problem...\nBist du auch bei Telekom?","replies":[]}]},{"poster":"Jensoo","date":"2017-10-24T18:50:11.585+0000","up_votes":1,"down_votes":0,"body":"Huhu, \n\nes geht mir genauso. Habe schon LoL deinstalliert und neu installiert, hextech repair dings bums benutzt hat auch nichts gebracht. Es nervt extrems aber da ich keine Lösung gefunden habe lebe ich damit. Manchmal komme ich sogar garnicht rein... scheiß Client.","replies":[{"poster":"Nico21","date":"2017-10-24T19:30:05.361+0000","up_votes":1,"down_votes":0,"body":"Ja, manchmal scheiterts bei mir auch beim einloggen, egal wie oft.","replies":[]}]},{"poster":"Dreyka Kintaso","date":"2017-10-24T18:54:36.564+0000","up_votes":1,"down_votes":0,"body":"So ähnlich bei mir, hab das ich nicht zum Server vebinden kann im Loadscreen seit gestern (23.10).","replies":[{"poster":"Nico21","date":"2017-10-24T19:27:24.676+0000","up_votes":1,"down_votes":0,"body":"Ich habe das seit mehr als 2 Monaten..","replies":[]}]}]}