{"poster":"Nico21","date":"2018-02-25T13:20:32.102+0000","title":"Market-Place Skinmarkt","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hey,\n\nWollte mal eine Diskussion starten was ihr von einem Skinmarkt halten w&uuml;rdet? W&auml;re toll f&uuml;r Legacy Skins oder nicht mehr erh&auml;ltliche Skins etc.\nLike Steam.\nMan k&ouml;nnte nat&uuml;rlich auch noch Beschw&ouml;rersymbole, Sticker etc. hinzuf&uuml;gen.\n\nSprich man k&ouml;nnte seine Skins f&uuml;r echtes Geld wieder verkaufen, oder vil auch nur f&uuml;r RP?\n\nIm Endeffekt werden ja sogar teilweise ganze Accounts auf Ebay nur wegen einem gewissen Skin verkauft und das für Unsummen an Geld :D","replies":[{"poster":"Dermel","date":"2018-02-25T14:47:49.247+0000","up_votes":1,"down_votes":0,"body":"das ist keine gute Idee, da die LoL einen sicheren Ort darstellen soll. Jeder kennt die Probleme, die ein so offenes System wie Steam mit sich bringt, im Endeffekt würde jeder versuchen, Profit zu machen, sehr seltene Skins würden in die Tausender gehandelt werden und viele Leute würden es mit dem Multiaccounting übertreiben, da man ja auf jedem Account kostenlose Hextechskins bekommt, was dazu führen würde, dass Smurfs verboten werden müssten, was nur sehr wenige begrüßen würden.\nIch wäre dafür, dass man streng limitiert Skin**shards** handeln kann, die erst aktiviert werden müssen, was man natürlich von Essenzen bezahlen muss.","replies":[{"poster":"Kind Prow","date":"2018-02-25T15:29:56.509+0000","up_votes":3,"down_votes":0,"body":"Was wäre der Nutzen eines solchen Systems?","replies":[]}]},{"poster":"Kind Prow","date":"2018-02-25T14:36:16.919+0000","up_votes":1,"down_votes":0,"body":"Das Problem wäre, nach meiner Ansicht, dass es diesen Echtgeldfaktor wieder drin hätte. Das hat ja schon bei CS:GO richtig gut geklappt..","replies":[]},{"poster":"7deadLeeSlnz","date":"2018-02-25T14:05:05.619+0000","up_votes":1,"down_votes":0,"body":"in allen Fällen würde Riot Verluste machen. Deswegen wird dein Vorschlag wahrscheinlich niemals umgesetzt werden.","replies":[]}]}