{"poster":"x R e n g a R x","date":"2016-05-21T11:28:58.794+0000","title":"@Riot...If you've reformed after a 2 week ban...","subforum":"Player Behavior","up_votes":4,"down_votes":4,"body":"So basically I got banned for 2 weeks because I had a rough couple days and I played this game during those days, and well, yeah.\r\n\r\nI&#039;ve came back reformed and I made a promise to myself to not even use chat anymore. Just play, use pings, call objectives...and move on.\r\n\r\nMy question is that let&#039;s say I&#039;m on good behavior for a month and I have ONE bad day and tell someone &#039;gg get rekt&#039; for example...\r\n\r\nDo I get a perma ban? Does the punishment restart after a long period of time with no reports and go back to 10 game restriction?","replies":[{"poster":"Prandine","date":"2018-01-20T04:16:48.637+0000","up_votes":0,"down_votes":0,"body":"Thread locked due to being over 2 years old. If you have something to discuss then be mindful of how old threads are and make your own thread about it rather than reviving an old one to do it.\n\nFeel free to contact us at the [Moderation Discord](https://discordapp.com/channels/230113905668653056/306220435262144512) or at [Discuss the Boards]( https://boards.na.leagueoflegends.com/en/c/community-moderation) for any questions, comments or concerns about this.","replies":[]},{"poster":"EvilDustMan","date":"2016-05-21T11:34:21.618+0000","up_votes":6,"down_votes":0,"body":"You need 3 months of good behavior to push you down a punishment tier.","replies":[{"poster":"x R e n g a R x","date":"2016-05-21T11:35:43.670+0000","up_votes":1,"down_votes":0,"body":"Oh ok thank you so much for the reply. That shouldn't be a problem. I was just wondering how the system worked.","replies":[]}]},{"poster":"proud and bronze","date":"2016-05-24T02:35:37.386+0000","up_votes":3,"down_votes":0,"body":"the punishment should be based on number of games not a time period.  \n\nif im on my two week ban but i play 10 games a day, in a 3 month period i would have to play almost 1000 games in a row without one slipup.  but a casual toxic might only have to play 30 or less games before the punishment drops a tier.  \n\nmakes no sense.","replies":[{"poster":"x R e n g a R x","date":"2016-05-24T08:31:59.888+0000","up_votes":2,"down_votes":0,"body":"You have a point, I was thinking the same exact thing.\n\nShould I just play a few games every 'patch' for the next 3 months? \n\nI play about 15 games a day. Sometimes 20.","replies":[]},{"poster":"flareblast17999","date":"2017-04-18T01:31:44.216+0000","up_votes":1,"down_votes":0,"body":"if you play 1000 games in 3 months that's more than 30 games a day.... \nif the average game lasts 30 minutes and they often go more that's 15 hours and i highly doubt you play that much unless your diamond+ or a pro or somthing","replies":[]}]},{"poster":"Icy Hot Shoto","date":"2016-05-21T18:17:41.961+0000","up_votes":3,"down_votes":0,"body":"The punishment tiers are:\n\n* 10-game chat restriction\n* 25-game chat restriction\n* 14 day ban\n*  Permanent ban\n\nIt takes 3 months to go down one tier, but you can also skip certain punishments depending on how toxic you are. If you're using hate speech and telling people to kill themselves, you'll either get a 2 week ban or a perma ban depending on how bad it is.","replies":[{"poster":"flareblast17999","date":"2017-04-18T01:35:21.660+0000","up_votes":2,"down_votes":0,"body":"in season 4 i was warned twice for toxicity and i cleaned up my act\nwas toxic one game in December of 2016 BAM 2 week ban \nthis one game was like.. low to moderate toxicity and boom your banned \nthey removed my years worth of honors and and restricted me from hextech chests witch i still dont have back four month of not being reported later {{champion:32}}","replies":[{"poster":"Gentara","date":"2017-05-18T04:50:35.359+0000","up_votes":1,"down_votes":0,"body":"Seriously, hadnt played the game for over a 6 month period because of a monitor issue, have a bad game, and get slapped for a two week","replies":[]}]}]},{"poster":"Astôlfo","date":"2016-05-21T16:54:56.651+0000","up_votes":3,"down_votes":0,"body":"Yes.\nThe punishment tier drops down after 3 months ONCE.\n\nSo if you got a 2 week ban and get in trouble after 3 months, you'd get another 2 week ban.\nIf you got in trouble a month after that, you'd get a perma.\nBasically like that.","replies":[{"poster":"Dominick Destine","date":"2016-05-21T18:00:15.908+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=nep2une,realm=NA,application-id=ZGEFLEUQ,discussion-id=rLONbBFK,comment-id=0005,timestamp=2016-05-21T16:54:56.651+0000)\n>\n> Yes.\n> The punishment tier drops down after 3 months ONCE.\n\nThat is meaningless.\n\nI went from zero to perma-ban despite my toxicity being fairly mid-level at best, all things considered. I had been chat restricted and possibly suspended (I don't remember).... a few _**years**_ ago. That did not matter, Riot saw fit to give me the equivalent of a death sentence. Luckily it was reduced to two weeks.\n\nPoint being;\nRiot will ban whoever they desire on a whim, the protocol will not protect you. \nThough I am glad Riot rescinded my perma-ban and initially I was very pleased with them, after the massive wave of relief passed I realized how truly effed up their treatment of me was. I highly suggest you protect yourself and your account because you can never be sure that Riot will not take you out on a whim.","replies":[{"poster":"Astôlfo","date":"2016-05-21T18:07:36.149+0000","up_votes":2,"down_votes":2,"body":"Certain infractions can skip tiers, and there is a 1/6000 chance of error.","replies":[{"poster":"Dominick Destine","date":"2016-05-21T18:12:23.618+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=nep2une,realm=NA,application-id=ZGEFLEUQ,discussion-id=rLONbBFK,comment-id=000500000000,timestamp=2016-05-21T18:07:36.149+0000)\n>\n> Certain infractions can skip tiers, and there is a 1/6000 chance of error.\n\nAnd where did you get that statistic from? \n\nYes, the most extreme infractions skip tiers.... but my behavior was not at that level, especially not enough to go from zero to perma-ban.","replies":[{"poster":"Astôlfo","date":"2016-05-21T18:46:29.670+0000","up_votes":2,"down_votes":1,"body":"An official Rioter said it somewhere.\nAnd I have no clue what you did so I didn't  bother to speak on it.\nI was only saying the fact that infractions _can_ be skipped, because I know it's been mentioned multiple times.","replies":[{"poster":"Rand0mH3r0X","date":"2016-05-23T04:44:34.309+0000","up_votes":1,"down_votes":2,"body":"I'm going to argue your facts. I don't like them, therefore they are not true. Case closed.","replies":[{"poster":"Astôlfo","date":"2016-05-23T05:01:32.111+0000","up_votes":2,"down_votes":3,"body":"Too bad.\nGet over it.\nCase closed.","replies":[{"poster":"Rand0mH3r0X","date":"2016-05-23T06:05:52.922+0000","up_votes":2,"down_votes":3,"body":"That's just in your low elo.\nI'm tired of your feelings getting easily hurt.\nCase closed.","replies":[{"poster":"Astôlfo","date":"2016-05-23T06:47:33.486+0000","up_votes":2,"down_votes":6,"body":"Stop crying kid.","replies":[{"poster":"Rand0mH3r0X","date":"2016-05-23T07:25:12.892+0000","up_votes":5,"down_votes":4,"body":"Clean your room.","replies":[]}]}]}]}]}]}]}]},{"poster":"Błaźe","date":"2017-03-21T06:11:52.692+0000","up_votes":1,"down_votes":0,"body":"How did you get the permaban rescinded ? It seems you flamed and got it rescinded.","replies":[{"poster":"Dominick Destine","date":"2017-03-21T13:09:23.321+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Błaźe,realm=EUW,application-id=ZGEFLEUQ,discussion-id=rLONbBFK,comment-id=000500000002,timestamp=2017-03-21T06:11:52.692+0000)\n>\n> How did you get the permaban rescinded ? It seems you flamed and got it rescinded.\n\nIt's been 10 months, I had promised Riot Tantram I would not bring it up again.\n\nRiot Tantram is the person responsible for both my permaban and (allegedly) it being rescinded, so I'd rather not put my head on the chopping block by discussing the facts of the case given how draconian Riot can be.","replies":[]}]},{"poster":"AramsAreBest","date":"2016-05-21T18:33:36.005+0000","up_votes":1,"down_votes":2,"body":"I'm surprised you got 2 weeks I thought only hate speech could do that","replies":[]}]}]},{"poster":"scazzman","date":"2016-05-21T14:36:55.460+0000","up_votes":2,"down_votes":2,"body":"dont use chat EVER. not worth the  risk","replies":[{"poster":"Norashi","date":"2017-07-27T03:42:39.733+0000","up_votes":2,"down_votes":0,"body":"This..... because these tiers are no longer accurate.\n\nIf any mods are actually reading this. kindly wipe this thread as the info is out dated. You have removed all chat restriction bans and just moved to 2 week bans on the game itself.","replies":[]}]},{"poster":"Firu","date":"2016-05-21T14:23:58.087+0000","up_votes":2,"down_votes":0,"body":"Yes.  It takes around 3 months of not-bad behavior (read: neutral to good) to drop down a tier of punishments.  Until then, if your last punishment was a 14 day suspension than any punishment you receive while still at that tier will be a permanent suspension.","replies":[]},{"poster":"Xeronator","date":"2018-01-20T03:15:34.117+0000","up_votes":1,"down_votes":0,"body":"wow","replies":[]},{"poster":"darkwar2010","date":"2017-10-25T16:14:20.865+0000","up_votes":1,"down_votes":0,"body":"People say you need 3 months of good behaviour to push you down a punishment tier. This is actually not true. I got a chat restriction in june 2017 and today, on 25th of november 2017 I got a 14 day suspension. No bans in betwen","replies":[]},{"poster":"Kittenpunchsmurf","date":"2016-05-23T02:44:11.332+0000","up_votes":2,"down_votes":5,"body":"Fact is riot allows tribunal to ban for almost 0 reason in hopes you will make a new account and pay to get your stuff back.","replies":[{"poster":"Telephone Booth","date":"2016-05-24T02:18:07.410+0000","up_votes":1,"down_votes":0,"body":"I take it you've been punished and you did nothing wrong? Or do you just believe all the threads people make claiming they did nothing wrong?","replies":[{"poster":"x R e n g a R x","date":"2016-05-24T08:33:21.349+0000","up_votes":1,"down_votes":0,"body":"Me? No I know I did something wrong, I was toxic and negative those few days because of real life reasons and I brought my negativity into the game. Won't happen again though.","replies":[{"poster":"Telephone Booth","date":"2016-05-24T21:19:18.783+0000","up_votes":1,"down_votes":0,"body":"Oh no i was responding to kittenpunchsmurf","replies":[]}]}]},{"poster":"x R e n g a R x","date":"2016-05-23T04:37:44.302+0000","up_votes":1,"down_votes":0,"body":"I dont think that's true. If you dont get reported for verbal/grief/hate speech you pretty much wont get flagged that fast.\n\nIf I don't chat at all and only call objectives, which I have been doing...there's no reason for them to ban me. \n\nI'm in Gold right now and will be hoping to get back in plat then I'm done for the season, will just play 1-2 games a month after that.","replies":[]}]},{"poster":"Kei143","date":"2016-05-21T11:41:11.973+0000","up_votes":1,"down_votes":0,"body":"if there was a short period between your 10 game chat restrict / 25 game chat restrict / 14-day ban, then all it takes is 1 bad game to get yourself permaed. \n\nGot some more leeway if there was a long gap between your punishments, as it shows Riot that you are super toxic.","replies":[]},{"poster":"Sarutobi","date":"2016-05-21T12:00:11.320+0000","up_votes":1,"down_votes":1,"body":"Basically that last chance is just that. You are in thin ice and basically any small reportable offense can trigger your permaban. But it does seem like you want to reform and as long as you keep that attitude up you'll do well. As you say just use pings, and play the game. None of that is reportable and try to minor chat or keep it off screen if you can. All else fail just mute everyone once the match starts and you'll do well!","replies":[]}]}