{"poster":"ferter45","date":"2017-06-04T09:53:39.620+0000","title":"mi incazzo","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"ma sono io o &egrave; il team che ho fa schifo? ogni volta che manca una 1 vittoria per entrare in promo perdo, la storia &egrave; questa nelle stesse partite in cui se vinco vado in promo vado sempre bene come kill e farm e poi mi ritrovo un team che fanno 400 volte pi&ugrave; schifo di ogni altra cosa... tranne uno,o il mid o il jung ,la bot &egrave; sempre persa... (che palle), allora ripeto: &quot; Ma faccio schifo o sono sfigato&quot;? per favore vorrei trovare una risposta\n\nINFORMAZIONI ALLE RELATIVE DOMANDE CHE STATE PENSANDO:\n1: ferter45\n2:Rank:s5\n3:main top con fiora,renekton\n4:jung:yi ,shyvana","replies":[{"poster":"Norant","date":"2017-06-05T06:38:20.009+0000","up_votes":1,"down_votes":0,"body":"Fai schifo probabilmente. E anche se non fosse, è meglio pensarla così almeno c'è un margine di miglioramento. Io in genere la vedo così ^^","replies":[]},{"poster":"Pellah","date":"2017-06-04T10:25:35.131+0000","up_votes":1,"down_votes":0,"body":"Tralasciando il fatto che più è basso l'elo e più è facile carryare da soli (E lo dico per esperienza) posso dirti che spesso quando si va in promo si diventa ansiosi di vincere e si tende a giocare peggio perchè sotto stress, proprio ieri sono riuscito a vincere la promo per platino 2 concentrandomi sul giocare al meglio invece di giocare per vincere la promo (come ho fatto le 6 promo precedenti che ho perso xdxd). Oltre a questo posso farti una piccola analisi del tuo ultimo game (che credo sia quello che ti ha fatto perdere la promo?). Allora avevi farm e kill, sicuramente un buon pretesto per poter carryare... ma il problema è che hai anche molte morti, generalmente chi sta carryando non deve permettersi di morire per 2 motivi: 1 ovviamente perchè presumendo abbia le kill darà più gold per via del sistema delle taglie e 2 perchè essendo l'unico player in grado di reagire se muori tu gli altri non potranno fare granché. Poi guardando le ward sono certo che ne potevi piazzare di più e che quella visione avrebbe potuto salvare te o un tuo compagno e darti qualche speranza in più di vincere (Vedo inoltre che compri una pink di tanto in tanto nella tua cronologia partite, tecnicamente dovresti comprarne una per proteggerti dai gank in early e poi comprarne un'altra da mettere sugli obbiettivi più avanti nel game). Last but not least il tuo team ha solo due torri una presa da te e una presa da caitlyn... ora essendo uno splitpusher così in vantaggio di gold sono certo che avresti potuto prendere molte più torri, ricordati che le torri danno gold istantanei e vantaggio sul terreno perchè tu puoi permetterti di giocare più aggressivo mentre l'avversario deve giocare più indietro. Io al momento gioco così: prendo vantaggio top con kill e farm e prendo la torre, se penso di poterlo fare cerco di prendere la seconda senno aiuto la lane più in difficoltà a prendere la torre (preferisco andare in bot per prendere controllo sul drake tho) presa quella torre aiuto la lane restante. In questo modo se vinci la lane ti assicuri 3 torri e un vantaggio per i tuoi alleati, cerca di aiutare le altre lane quando hai il tp o il tuo jungler è top side in modo da poter difendere al tua torre. Buh.... io ti dico queste cose dalla mia esperienza, prendi ciò che ritieni più giusto ;)","replies":[]}]}