{"poster":"Arkhel HUN","date":"2015-06-01T14:39:47.364+0000","title":"Megoldási javaslat 4v5 játékokhoz","subforum":"Tippek és trükkök","up_votes":1,"down_votes":0,"body":"Sz&aacute;mtalan embernek gyűlik meg a baja az AFKol&aacute;ssal, a 4v5 vesztes j&aacute;t&eacute;kokkal, hiszen ak&aacute;r egy ranked meccsen, ak&aacute;r egy normal meccsen kiafkol&oacute; egy&eacute;n egy&eacute;rtelműen meg tudja hat&aacute;rozni a j&aacute;t&eacute;k kimenetel&eacute;t.\nMivel sokakkal egy&uuml;tt nekem is gyűlt m&aacute;r meg bajom ezzel a probl&eacute;m&aacute;val, gondolkodtam megold&aacute;si lehetős&eacute;geken, &eacute;s eszembe jutott egy v&eacute;lem&eacute;nyem szerint műk&ouml;dők&eacute;pes opci&oacute;:\n\nHa valaki m&aacute;r kb 10 perce AFKol, lehessen a hely&eacute;re csatlakozni. &Uacute;gy k&eacute;pzeln&eacute;m el, hogy 10 perc afk ut&aacute;n a j&aacute;t&eacute;kban tart&oacute;zkod&oacute;knak megjelenne egy opci&oacute; a men&uuml;ben, hogy az afkol&oacute; hely&eacute;re j&aacute;t&eacute;kost keresnek. Ezzel felker&uuml;lne a j&aacute;t&eacute;k egy list&aacute;ra a főmen&uuml;ben, amire csatlakozhatnak olyan mer&eacute;sz kedvű j&aacute;t&eacute;kosok, akik sz&iacute;vesen megpr&oacute;b&aacute;ln&aacute;nak megmenteni egy 4v5 meccset.\n\nA list&aacute;n megjelenne a kiafkol&oacute; j&aacute;t&eacute;kos karaktere, statja, itemjei, illetve a meccs fontosabb adatai, mint &aacute;ll&aacute;s, tornyok sz&aacute;ma &eacute;s idő.\n\nA m&oacute;d haszn&aacute;lata...\n\n...mi&eacute;rt &eacute;ri meg a cserbenhagyott j&aacute;t&eacute;kosoknak?\n1. Ha elment egy ember, &eacute;s &uacute;gy gondolj&aacute;k, az emberhi&aacute;ny miatt biztos a buk&aacute;s, akkor ez a lehetős&eacute;g adna egy es&eacute;lyt a győzelemre.\n\n...mi&eacute;rt &eacute;ri meg, ha gyakran afkolsz?\n1. Lehetnek g&eacute;phib&aacute;k, sajnos ezekkel neh&eacute;z mit kezdeni (tapasztalatb&oacute;l tudom), de ez esetben is &aacute;tlag 10 percen bel&uuml;l vissza kell tudni &eacute;rni a j&aacute;t&eacute;kba. Szerintem m&eacute;g a leglassabb g&eacute;pnek is el&eacute;g a 10 perc, főleg, ha belegondolunk, enn&eacute;l hosszabb idő ut&aacute;n m&aacute;r &eacute;rtelmetlen a visszat&eacute;r&eacute;s.\n2. Ha LoL error miatt nem enged be a j&aacute;t&eacute;k, ink&aacute;bb egy 10 perc ut&aacute;n elfoglalj&aacute;k a helyet &eacute;s tudj egy &uacute;j meccset kezdeni, mint v&aacute;rnod kelljen &oacute;r&aacute;kat, mire eltűnik a hiba.\n3. Ha pedig eleged van, &eacute;s kisz&aacute;llsz a j&aacute;t&eacute;kb&oacute;l, b&aacute;r b&uuml;ntet&eacute;s j&aacute;r, de legal&aacute;bb ne legyen teljes veres&eacute;g a t&aacute;rsaid jutalma.\n\n...mi&eacute;rt &eacute;ri meg a besz&aacute;ll&oacute;nak?\n1. R&ouml;vid meccsek; ha csak 10-20 perce van valakinek, kereshet egy m&aacute;r foly&oacute; meccset, &eacute;s sokkal hamarabb v&eacute;gezhet.\n2. L&aacute;thatja milyen csapatba ker&uuml;l, &iacute;gy elker&uuml;lheti a kellemetlen csapat&ouml;ssze&aacute;ll&iacute;t&aacute;st.\n3. Esetleg az ilyen meccsbe besz&aacute;ll&oacute;k kaphatn&aacute;nak valamilyen jutalmat az&eacute;rt, hogy megpr&oacute;b&aacute;ltak mindent megtenni a siker&eacute;rt.\n\nPersze az illető csak olyan karakter helyett jelentkezhet, ami megvan neki, nem szeretn&eacute;nk first-time-Draven &eacute;s t&aacute;rsait :)\n\nEz egy &ouml;tlet, egy megold&aacute;si javaslat, t&aacute;mogat&aacute;st, re&aacute;lis v&eacute;lem&eacute;nyt elfogadok, h&aacute;tha elgondolkod&aacute;sra k&eacute;szteti a j&aacute;t&eacute;kfejlesztőket, &eacute;s megoldhatn&aacute;nk az AFK probl&eacute;m&aacute;j&aacute;t!","replies":[{"poster":"HusztiMagicDeath","date":"2015-06-07T11:13:27.897+0000","up_votes":1,"down_votes":0,"body":"Én még mindig jobbnak tartom azt, mint  Dotában. Átveszi a helyét egy bot, vagy pont egy csapattárs. És ha visszacsatlakozik megszűnik az irányítás felette. Ez azért is jobb, mert pls a te módszereddel akinek trollkodni van kedve simán felcsatlakozik az afk helyére segíteni veszteni. És nem az ő rovására menne. Kiéve ha számon tartjuk majd h ki játszott a karakterrel, és a büntetés neki megy a trollkodásért, az afk meg a főhasználónak.","replies":[]},{"poster":"Haruszame","date":"2015-06-01T21:29:33.311+0000","up_votes":1,"down_votes":0,"body":"Ahogy a többiek is mondták, már többen is felvetették ezt a lehetőséget és minden alkalommal felhoztak mellette/ellene érveket. Persze általában senkinek sem változik meg a véleménye. Csak beszélünk róla aztán továbbra is mindenki úgy gondolja ahogy korábban. Az én véleményem az, hogy ebbe a játékba egyszerűen nem fér bele egy ilyen funkció. Nagyon jól működik pve környezetben, illetve bizonyos pvp játékokban is működőképes lehet, de itt nem. Persze beszélhetünk a témáról, az ellen nincs kifogásom. Nem tartom teljesen kizártnak, hogy találunk valamiféle megoldást.\n\nVégezetül pedig mivel nagyon szeretem az idézeteket. Az idézők kódexének 2. mondata.\n\"Akár tetszik, akár nem, a sors összeköt bennünket a csapattársainkkal.\"","replies":[]},{"poster":"M4dr4c","date":"2015-06-01T15:23:07.111+0000","up_votes":1,"down_votes":0,"body":"Ne posztolj semmit se kétszer.\n\nEnnek több változata is fent volt már és minden egyes esetben megállapodtunk egy dologban. Az új 5. végül is miért állna be? Mert oka nincs rá. Az extra jutalom nem kecsegtető, hisz szinte biztos a bukás.","replies":[{"poster":"Arkhel HUN","date":"2015-06-01T15:37:59.194+0000","up_votes":1,"down_votes":0,"body":"Oké - kitöröltem a másik oldalról -\n\nNem tudtam, hogy mások is posztolták - én azért tettem ki, mert mondjuk én személy szerint szívesen kihasználnám, hogy beálljak egy ilyen meccsbe, mivel egyrészt kihívás, másrészt gyakran nincs időm rendes meccseket játszani, de azért szeretnék időt szánni akár IP szedésre, akár csak játékra...\n\nSzerintem nem vagyok ezzel egyedül, ezért jött az ötlet, és ezért írtam le.","replies":[{"poster":"M4dr4c","date":"2015-06-01T15:41:26.844+0000","up_votes":1,"down_votes":0,"body":"Messze túl kevés érdeklődő lenne, hogy érdemes legyen időt és energiát fektetni a kifejlesztésére.\n\nNem a te próbálkozásodat akarom leszólni, hanem a hátrányait elmondani az én szemszögemből.","replies":[{"poster":"Arkhel HUN","date":"2015-06-01T15:48:07.809+0000","up_votes":1,"down_votes":0,"body":"Hát nem tudom, véleményem szerint egy jól kigondolt jutalmazási rendszerrel, plusz a már említett időtakarékosságggal pont hogy lenne jelentkező - félreértés ne essék, én sem bemagyarázni akarom, hogy ez jó ötlet, értékelem a véleményeket :)","replies":[{"poster":"M4dr4c","date":"2015-06-01T15:58:18.222+0000","up_votes":1,"down_votes":0,"body":"x játékos 10 perce AFK. Mondjuk az első halála óta. Nincs farmja, nincs xp-je. 3-4k pénzlemaradásban és 4-7 szint lemaradásban van az ellenféltől. \nMi esélye lesz annak aki belép a helyére? Tehát a jutalmat se kapja meg, mert nem fog nyerni. \nVereséghez nem lehet jutalmat adni, mert akkor egy afk helyett kapnál egy kb bot szintű játékost, hisz így is-úgy is megkapja a jutalmát.","replies":[{"poster":"Arkhel HUN","date":"2015-06-01T16:09:00.220+0000","up_votes":1,"down_votes":0,"body":"Számtalan alkalommal játszottam már úgy, hogy kék halált kapott gépem, és kb 10 perc múlva tértem vissza.\n\nLehet nyerni úgy is, nem könnyű persze, de lehet. Én ezért gondoltam, hogy az, aki belépne, lássa, hogy hogy állnak a dolgok, hogy szeretné-e megpróbálni, vagy nem.\nNem menthető minden meccs, de VAN, ami az, és ez csak egy lehetőség lenne, hogy megpróbálják.\n\nHa valaki a játék elején már afk, annak lehetne annyi módosítás, hogy 5 perce van visszatérni, hiszen egy meccs ne legyen már eleve veszett, amikor még el se kezdődött. 5 percet pedig nem vészes behozni egy gyakorlottabb játékosnak.","replies":[{"poster":"Looter","date":"2015-06-01T16:18:38.373+0000","up_votes":1,"down_votes":0,"body":"Utoljára kékhalált másfél éve láttam az én gépemen.\n\nSzóval a kékhalál nem egy gyakori dolog már manapság, maximum olyan gépnél ami nincs megfelelően karban tartva.\n\nAmúgy a következő dolgok miatt nem lenne értelme.\n\n1. Ha a kilépő játékos itemjeit kapja meg az új, akkor a kilépő játékos akár direktbe vehet 6 mana kristályt és gg.\n2. Ha a goldot kapja meg amit farmolt, akkor meg azért a kva anyját mert miért farmolt ilyen szarul\n3. Ha a más mennyiségű goldot kap akkor miért, máris kivan baszva az enemyvel.\n4. Milyen masteryket és rúnákat visz be, lehet, hogy nem tud vele semmit kezdeni az új játékos.\n5. Ha a saját rúnát és masteryt hoz az új játékos, akkor máshogy buildelhet lásd 2 es pont, ergó ha valaki tankból adt, vagy fordítva csinál, vagy AD s helyett AP s valamit buildel, akkor baszhatja az enemy a védekező buildjét.\n6. Ha egy sokkal jobb játékos jön be mint aki kilépett, megint imbalanced a játék és azért mehet a sírás, mert a kva anyját annak aki bejött és elbaszta a nyert játékot nekik.\n7. Alkalmat adna arra, hogy addig basztassák a rossz játékost amíg ki nem lép, annak reményében, hogy jobb játékos jön be.\n\nÉs még sorolhatnám.","replies":[{"poster":"Arkhel HUN","date":"2015-06-01T17:59:07.026+0000","up_votes":1,"down_votes":0,"body":"Hm.\n\nIgazad van.\n\nDe talán lehetne valami olyan megoldást találni e téren, ami kiküszöböli ezeket a gondokat. Egy ötletként vetettem fel, amit megértem, jogosan ítéltek :D elfogadom, de hátha inkább a probléma keresése helyett megoldáson törnénk a fejünket. \n\nMax nem így oldódna meg a probléma. Ez csak egy **kiindulási ötlet**.","replies":[]}]},{"poster":"M4dr4c","date":"2015-06-01T16:16:43.708+0000","up_votes":1,"down_votes":0,"body":"A gond ott van, hogy szerintem max minden 10. lenne menthető. És akkor már nem éri meg igazán.\n\n5 percet nem nehéz behozni? Tegyük fel az ADC volt afk. A support állt a torony alatt és próbált lasthitelni. Az enemy ADC könnyedén farmolt, jó eséllyel beverték a tornyot is. Legalább egy BF sword előnye van a szinteken felül. Nem igazán tudsz ellene tenni semmit se.\nA jungler beállt a botra addig. Mivel a legtöbb jungler melee lasthitelni még így is nehezebb, ráadásul az enemy jungler nyugodtan lopja a buffokat és countergank lehetősége nélkül megy mindenhova. Az ellen ADC előnye hasonló lesz, a tower talán megmarad de az ellenfél jungle jobban áll és lehet a top/mid is.\n\nMindkettő csak 5 perc és komoly tudás kell behozni. Külön nehezítés, ha az első halál után ragequit volt, hisz akkor még 300 vagy 400 pénz ment az ellenfélnek.\n\nNem az 4v5 gondot kell megoldani szerintem, hanem a leaverek, AFK gondot. A fagyások és más vis majorok ellen persze nem lehet sokat tenni.","replies":[]}]}]}]}]}]}]},{"poster":"Manticore5","date":"2015-06-01T16:28:47.508+0000","up_votes":1,"down_votes":0,"body":"Még úgy is hogy vmi 5X szorzós IP-t kapnék becsatlakozva se érné meg mert a bukás szinte könyvelhető! Akkor már legyen 4-5 perc afk és talán de csak talán van esély rá!  Tegyük fel hogy ez mind megvalósul:  4-5 perc után kidobja a játékost a rendszer és jól megbüntetni. \n\nA főmenüben én meglátom hogy talon -nal lehet menni. Hoppá az a %%%%%%ált frozen heartet vett talonra, passzolom mert én tiamatot szeretek rá venni.  \n\nMeglátom hogy  poppy-val lehet menni. Hoppá  0/10/1 a statjai , inkább nem joinolok mert még kapok egy halom reportot ( igen , hidd el hogy leszarják h nem én csináltam azt a statot!).  \n\nMeglátom hogy annie-vel lehet menni. 35 perce megy a game . Hmm egész jó  itemjei vannak , a statja sem vészes 1/2/7. Belépek, hoppá vége a game-nek , instaaaaaaa loseeeeee bitchhhhhhhhhhhh !!!!\n\nTudnám még sorolni a problémákat de hátha ennyi elég. Az afk dolgot máshogy kell megoldani sajnos. :/","replies":[{"poster":"Arkhel HUN","date":"2015-06-01T17:46:38.851+0000","up_votes":1,"down_votes":0,"body":"Hm.\nÉrthetőek az indokaid - bár megértem, és egyet is értek velük, hadd reagáljak egy-egy ötlettel mindegyik indokodra - annak ellenére, hogy tényleg nehéz megoldani ezzel a lehetőséggel.\n\nAz is lehet egy verzió, hogy az itemek eltűnnek, csak a gold marad meg, és a becsatlakozó újonnan vesz itemeket magának.\n\nMivel az illető becsatlakozott egy már meglévő játékba, ezért nem lehet reportolni, mint másokat, lenne erre egy külön lehetőség, amivel a DIREKT trollkodó játékokat lehetne büntetni (csak a becsatlakozókat)\n\nMeglehet, hogy becsatlakozol, és el is veszted rögtön a meccset - de attól még jár insta IP (és én speciel pont ezért látnám értelmét a becsatlakozásnak)  :D\n\nEmbert emberrel lehetne legjobban helyettesíteni. Amit fentebb leírtam és kommentekben javítgattam, pedig csak ötletek. Ha másnak nem, kiindulásnak. \n\nNem tudom :D","replies":[]}]}]}