{"poster":"Death by Glamour","date":"2015-09-17T01:19:50.333+0000","title":"Si se lo pido de manera cortés a Riot, me pueden dar 6 de RP?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Ver&aacute;n, hice una recarga de RP un tanto grande y pens&eacute;: Me compro a Tahm Kench, aprovecho que Gnar est&aacute; en oferta y ahorro para cuando salga Kindred.\r\nCompre a Tahm sin ning&uacute;n problema, pero si compro a Gnar, me queda un saldo de 969 y no podr&eacute; comprar a Kindred, ya que estoy ahorrando PI para otro champ. Un amigo que dijo que al menos pregunte si se pueden hacer este tipo de operaciones con Riot Games de LAS.\r\n(No me deja a&ntilde;adir un archivo adjunto, asique sub&iacute; la imagen a otra web para que puedan verla)\r\n\r\nhttp://k46.kn3.net/D/1/9/9/D/2/C65.png\r\n\r\nSuerte en los Campos de la Justicia :D\r\n\r\nPD: Fuerza para todos los compa&ntilde;eros chilenos que est&eacute;n pasando un mal momento debido al reciente sismo. Aqu&iacute; en C&oacute;rdoba, Argentina se sent&iacute;a bastante fuerte. Cabe resaltar que nunca en mi vida hab&iacute;a sentido un terremoto y no me quiero imaginar lo que fu&eacute; en Chile...","replies":[{"poster":"El Socialismo No","date":"2015-09-17T05:11:28.170+0000","up_votes":2,"down_votes":0,"body":"Amigo, creo que lo más razonable es que aproveche de comprar con PI el contenido que si esta disponible por ese medio.\nCon RP compre el contenido exclusivo, a la larga es mucho mas provechoso y te arrepentirás menos.\nPor ejemplo con el fin de semana de PI hice cerca de 11.000 de PI :D","replies":[{"poster":"Death by Glamour","date":"2015-09-17T09:51:26.577+0000","up_votes":1,"down_votes":0,"body":"Se me ha hecho costumbre esto de comprar campeones nuevos con RP, ya que utilizo los PI para runas, pagina de runas y poco mas, porque la mayoría de los campeones que necesito ya los tengo y una de las compras que voy a hacer con estos RP es un regalo para un amigo (aprovechando que esta en oferta, claro).\nIgual, voy a tener tu recomendación en cuenta :)","replies":[]}]},{"poster":"SenpaiDeathx","date":"2015-09-17T01:24:47.492+0000","up_votes":2,"down_votes":0,"body":"Te pueden dar hasta 100 de rp por lo que tengo entendido, tienes que ingresar \n\nhttps://support.riotgames.com/hc/es-419 \n\ny enviar un ticket, en el asunto le pones \"solicitud de rp por cortesía\"","replies":[{"poster":"Death by Glamour","date":"2015-09-17T01:29:23.318+0000","up_votes":1,"down_votes":0,"body":"No me aparece ''Enviar un ticket'', me aparece un botón rojo que dice ''Consigue ayuda'' y es lo mas remotamente parecido...\nMuchisimas gracias de antemano.","replies":[{"poster":"SenpaiDeathx","date":"2015-09-17T01:30:55.474+0000","up_votes":2,"down_votes":0,"body":"tienes que logear y arriba a la derecha te dice \"envía una petición\"","replies":[{"poster":"Death by Glamour","date":"2015-09-17T01:36:52.988+0000","up_votes":1,"down_votes":0,"body":"Lamento ser tan patoso en esto, enserio XD, pero no me aparece la Solicitudo de RP, estas seguro de que esto sigue estando vigente?","replies":[{"poster":"Sondorax","date":"2015-09-17T01:47:51.410+0000","up_votes":2,"down_votes":0,"body":"Debes poner eso en el asunto,osea como el titulo del mensaje \"Solicitud de RP por cortesia\",eso por lo que se io","replies":[]}]}]}]}]},{"poster":"ßangßang","date":"2015-09-17T01:47:31.023+0000","up_votes":2,"down_votes":0,"body":"No dice solicitud de rp xD tenes que poner en el \"ASUNTO\": solicitud de rp por cortesía.","replies":[]},{"poster":"tacito92","date":"2015-09-17T13:42:26.769+0000","up_votes":1,"down_votes":0,"body":"yo llegue a los 10 mil de ip ese fin de semana, fue una locura, las derrotas parecian victorias en cuanto a ip.","replies":[]},{"poster":"Death by Glamour","date":"2015-09-17T01:57:14.750+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias a todos, ya pude hacer el pedido y lamento de nuevo ser tan patoso en esto, nunca lo había hecho antes XD\nAhora, esperemos a que Riot me responda :v","replies":[]}]}