{"poster":"Succubus Ashe","date":"2017-06-02T15:40:53.304+0000","title":"Reksai rework ulti bug oder gewollt?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Moin Moin Community,\n\nWie schon gesagt geht es um die neue Reksai Ult und zwar wie sie funktioniert sollte ja eig jedem klar sein. Jetzt aber meine Frage wieso kann man denn dmg dodgen wenn man flashed oder dashed (Yasou E; Lee Sin W;usw.) oder einfach zu ihr hin l&auml;uft wenn sie im Untergrund ist bevor sie einen anspringt. Da es ja kein skillshot ist müsste doch von meinem Verständnis her, der dmg doch durch kommen auch wenn man flashed oder side steped.\nAls Beispiel wenn es wirklich gewollt wäre müsste man die Syndra Ult ja auch mit flash dodgen können oder nicht.\n\nWas meint ihr bug oder einfach gewollt","replies":[{"poster":"AI Yjuq","date":"2017-06-02T15:59:23.140+0000","up_votes":1,"down_votes":0,"body":"Anscheinend ist das gewollt. Ich verstehe das Argument das du einbringen willst und ich befürworte das ebenfalls. Allerdings scheint es so zu sein dass es möglich sein soll die Ultimate zu dodgen.","replies":[{"poster":"Succubus Ashe","date":"2017-06-02T16:01:45.858+0000","up_votes":1,"down_votes":0,"body":"ja schon klar es ist bloß blödsinn tank rek zu nerfen und eine art assassin oder juggernaut reksai keinen schaden zu geben da die ult gut 30% des dmg ausmacht\n\num es mal mit mathe zu sagen die Q bekommt dmg ja man verliert aber 60% attackspeed weil es von der ult runter ist und damit mehr schaden als man durch die Q bekommt, die E verliert wenn man top als Beispiel hydra blackleaver deathdance baut über 350 true dmg und genau diesen dmg macht die ulti und wenn man sie mit flash oder einem dash dogden kann ist reksai noch schlechter als vor dem rework.\n","replies":[{"poster":"AI Yjuq","date":"2017-06-02T16:08:40.552+0000","up_votes":1,"down_votes":0,"body":"Das Argument kann ich dagegen nicht nachvollziehen. Den Schaden von jedem Assassine ist dodgebar. Warum also dann auch nicht Rek'Sai R?","replies":[{"poster":"Succubus Ashe","date":"2017-06-02T16:11:32.125+0000","up_votes":1,"down_votes":0,"body":"aber alle ich sag mal exicute ultis sind point and click cho zed syndra caitlyn dann müsste man dies auch auf die art dodgen","replies":[{"poster":"Allerbester Biss","date":"2017-06-03T09:11:52.611+0000","up_votes":1,"down_votes":0,"body":"Das wird zu 100% noch geändert\nShyvana ult kann auch nicht mehr gecancelt werden von thresh oder so","replies":[]}]}]}]}]}]}