{"poster":"Lelurri","date":"2015-11-12T22:00:19.471+0000","title":"No tiene sentido sacar mundo o vladimir","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Como ahora los autos reducen la curaci&oacute;n no veo el sentido de sacar campeones q dependen de curarse como vladimir o mundo, mis 2 champs favoritos, no le veo el sentido al &iacute;tem. Deber&iacute;a existir algun m&eacute;todo de contrarrestar el efecto, ya sea con un outplay, o un &iacute;tem q evite el efecto por unos segundos. Eso.","replies":[{"poster":"yOCobain","date":"2015-11-12T23:47:30.409+0000","up_votes":2,"down_votes":0,"body":"Perdon pero en el dia de hoy creo que en todas las partidas que lo use a vlado...gané... y comodisimo.","replies":[]},{"poster":"Essos","date":"2015-11-12T23:39:16.625+0000","up_votes":2,"down_votes":0,"body":"Yo use a vladi un par de veces y con las maestrias e items que hay me parecio bastante roto, principalmente en early","replies":[{"poster":"Lelurri","date":"2015-11-13T04:17:47.254+0000","up_votes":1,"down_votes":0,"body":"Si, el juego va bien, hasta q sacan {{item:3123}} , una vez q sale el ítem, tu aporte ya fue, si no lo sacan eres inmutable, debería tener un punto medio, como por ejemplo el caso de moreno donde es solo cuando queda 40%. Pero tal como esta este tipo de campeones ya no existe.","replies":[]}]},{"poster":"La Más Rápida","date":"2015-11-12T23:01:57.487+0000","up_votes":2,"down_votes":0,"body":"Fijate en los streams, mundo se esta usando a full, soraka igual, La regeneracion de vida esta bastante mejor que antes con las nuevas maestrias...","replies":[{"poster":"Lelurri","date":"2015-11-13T04:19:24.714+0000","up_votes":1,"down_votes":0,"body":"Obviamente que con soraka esta op, para negar la curación de soraka tendrías que pegarles a todos, así que no le afecta tanto, el problema es con los campeones cuyo kit gira en torno a su propia habilidad para curarse a si mismo, ya que es mas fácil negar la curación en ese caso. Con llamado del verdugo estos campeones de verdad que no tiene cabida.","replies":[]}]},{"poster":"TheFalc","date":"2015-11-12T22:31:39.681+0000","up_votes":2,"down_votes":1,"body":"lo que deberian hacer es como el {{item:3165}} , osea, a partir de un 40% que aplique heridas graves (o cualquier porcentaje) pero la idea esta no? creo que casi todos los champs ad deberian tomar ese item contra tanks curativos, asi que deberia ser un poco nerfeado","replies":[]},{"poster":"Carreenme pls","date":"2015-11-12T22:07:10.990+0000","up_votes":2,"down_votes":1,"body":"Estoy de acuerdo, tampoco Swain","replies":[]},{"poster":"alop55555","date":"2015-11-12T22:50:10.062+0000","up_votes":1,"down_votes":0,"body":"Está la maestría aliento del agónico que te da robo de vida si te mantienes 4 segundos en batalla  esa es una forma de contrarrestarlo","replies":[]},{"poster":"Krilin Noda Oro","date":"2015-11-12T23:46:25.338+0000","up_votes":1,"down_votes":0,"body":"El sustain esta bastante fuerte con las maestrias, los items de heridas graves fueron para balancear eso y no hablo de esa clase de \"balance {{champion:122}} \"","replies":[{"poster":"Lelurri","date":"2015-11-13T04:20:45.509+0000","up_votes":1,"down_votes":0,"body":"Si esta bien, pero tal como esta, que con un aa ya te aplica heridas graves por 3 segundos, estos tanques ya murieron, y no me refiero a tanques como shyvanna o malphite que no dependen de su curación para ser duros, sino que de tanques como mundo o vladimir quienes dependen de su curación. Insisto me parece bien que los ad tengan alguna posibilidad de aplicar heridas graves, pero no así de fácil porque de inmediato se niega al campeón.","replies":[]}]},{"poster":"Curtedz","date":"2015-11-12T22:44:56.045+0000","up_votes":1,"down_votes":1,"body":"Es cierto, este tipo de objetos sacan de la meta a muchos otros campeones que dependen de la curación...\nDe cierta forma ahora sera mas fácil matar a un Darius que se cura mucho con su Q... xD","replies":[{"poster":"Esti","date":"2015-11-12T23:59:56.036+0000","up_votes":1,"down_votes":0,"body":"Puedes evitar la curación si no te pega con el FILO del Hacha (o lo que sea que use darius)","replies":[]}]},{"poster":"Swimpool","date":"2015-11-13T00:52:30.568+0000","up_votes":1,"down_votes":2,"body":"No tiene sentido usar algo que no escala con crítico","replies":[{"poster":"Lelurri","date":"2015-11-13T04:26:01.463+0000","up_votes":1,"down_votes":0,"body":"Ojo que no solo hablo de los adc,  por ejemplo un zed tmb te lo puede sacar y destruirte. Justamente el problema es que es muy fácil negar la curación ahora, lo que al final del día anula completamente las maestras nuevas de curación.","replies":[]}]},{"poster":"Alpaca Suri","date":"2015-11-12T23:01:45.238+0000","up_votes":1,"down_votes":1,"body":"opino que hay que quitarle esa pasiva a ese item, con el morellonomicón basta","replies":[]},{"poster":"Baldarov","date":"2015-11-12T22:57:13.781+0000","up_votes":1,"down_votes":1,"body":"Habiendo maestrías tan buenas para este tipo de campeones y se arruina todo solo por un ítem bastante desbalanceado. Aunque la mayoría de los ítems de AD quedaron algo desbalanceados.","replies":[]}]}