{"poster":"Buchwurstvaddi","date":"2020-02-04T23:39:38.632+0000","title":"Ich warte gerne 10 Minuten länger","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":4,"body":"Wenn ich dafür nicht auf 3 Lanes Leute bekomme, die diese Position selten und Ihren gewählten Champion noch seltener vorher gespielt haben.\r\n\r\nAch und wo ich gerade bei Wünsch-Dir-Was bin: Löscht Aphelios. Den bann ich sowieso immer. Mit seinem Design passt er nicht ins Spiel, finde ich.\r\n\r\nFreude für Alle","replies":[{"poster":"Tatzeblu","date":"2020-02-05T05:51:12.302+0000","up_votes":3,"down_votes":0,"body":"Das Problem ist zum großen Teil, dass es viele Leute gibt, die eben nicht 10 Minuten warten wollen. Und man muss da einen gemeinsamen Nenner finden, da man sonst die queue splitten müsste, was wiederum zu noch längere Queue-Times führt.\nWas man aber machen sollte und aktuell auch plant ist es, das System insofern zu verbessern, dass in beiden Teams eine gleiche Anzahl an Autofill-Positionen vorhanden ist.","replies":[{"poster":"CG Mörglife","date":"2020-02-05T09:01:01.698+0000","up_votes":1,"down_votes":0,"body":"Ja, aber man kann das doch durchaus variabel halten.\nWie? Simpel. Du nimmst neben deinem Primary &amp; Secondary Pick einfach nen Haken den du setzen kannst \"Guaranteed Roles\" mit der Warnung, dass das länger dauern kann.\n\nDie, die keine Lust haben zu warten setzen den Haken nicht, und die, die ihre Rolle haben wollen setzen den Haken.\n\nIch versteh nicht, warum Riot das nicht einfach mal versucht.\nMir geht es so auf die nerven autofilled zu werden.\n\nIch hab als primary mid und secondary support.\nTrotzdem bekomme ich öfter autofill jungle, als dass ich support bekomme.\nWo ist da der Sinn? Wofür wähle ich denn eine secondary Rolle aus die ich ohnehin nie bekomme?\nDann muss ich glück haben, dass jemand swappt, oder ich dodge.\nOder ich spiele meinen 100% Winrate in 3 Spielen Tryndamere Jungle wo ich mich heute noch wundere wie ich damit gewinne.\n\nEntweder fährt jeder mehr auf Support ab als Jungle, oder Riot will mir meine Rollen einfach nicht geben.","replies":[{"poster":"Tatzeblu","date":"2020-02-05T10:54:39.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CG Mörglife,realm=EUW,application-id=YnZkMR0R,discussion-id=vuLa1RPT,comment-id=00010001,timestamp=2020-02-05T09:01:01.698+0000)\n>\n> Ja, aber man kann das doch durchaus variabel halten.\n> Wie? Simpel. Du nimmst neben deinem Primary &amp; Secondary Pick einfach nen Haken den du setzen kannst \"Guaranteed Roles\" mit der Warnung, dass das länger dauern kann.\n> \n> Die, die keine Lust haben zu warten setzen den Haken nicht, und die, die ihre Rolle haben wollen setzen den Haken.\n> \n> Ich versteh nicht, warum Riot das nicht einfach mal versucht.\n> Mir geht es so auf die nerven autofilled zu werden.\n> \n> Ich hab als primary mid und secondary support.\n> Trotzdem bekomme ich öfter autofill jungle, als dass ich support bekomme.\n> Wo ist da der Sinn? Wofür wähle ich denn eine secondary Rolle aus die ich ohnehin nie bekomme?\n> Dann muss ich glück haben, dass jemand swappt, oder ich dodge.\n> Oder ich spiele meinen 100% Winrate in 3 Spielen Tryndamere Jungle wo ich mich heute noch wundere wie ich damit gewinne.\n> \n> Entweder fährt jeder mehr auf Support ab als Jungle, oder Riot will mir meine Rollen einfach nicht geben.\n\nNein, das geht eben nicht, weil wenn du eine längere Queue hast, dann haben die Leute, die diesen Haken nicht setzen auch eine längere Queue.","replies":[{"poster":"CG Mörglife","date":"2020-02-05T12:05:48.444+0000","up_votes":1,"down_votes":0,"body":"> dann haben die Leute, die diesen Haken nicht setzen auch eine längere Queue.\n\nTheoretisch ja, praktisch denke ich nicht.\nKlar gibt es dann mehr Leute, die auf eine bestimmte Rolle \"beharren\" und somit die Zahl der Spieler, die autofill-gefährded sind geringer als jetzt, was ja logisch ist.\nAber gleichzeitig werden die Leute ja schneller geautofilled.\nIm Prinzip wären die Leute die das nicht anhaken ständig autofill. Was ja aber nicht schlimm ist, da den Leuten ja ohnehin egal ist wo sie spielen. Sonst hätten diese ja den Haken gesetzt.\nAlso würde ich rein von der Logik sagen, dass die Leute sogar schneller eine Q finden als vorher. Bloß halt autofill.\n\nSowas ähnliches gab es schon mal mit dem Teambuilder Irgendwann season 3 glaube ich.\n\nDer Teambuilder an sich war müll. Aber ein Team konnte man schon relativ schnell finden, das war nicht das Problem.\nHäufig war das Problem, dass Leute verschlafen haben auf \"Bereit\" zu drücken und dann jemand anderes raus ist weil er keine Lust hatte zu warten. Und das ging halt immer so weiter. Als Support warst du sofort in einem vollen Team. Zumindest in Low Elo.\nZusätzlich konntest du damals (meine ich) nur eine Rolle auswählen. In meinem Beispiel kannst du ja weiterhin zwei wählen, welche du dann ja entsprechend gewichten kannst (z.B. 50/50; 70/30)","replies":[]}]}]},{"poster":"HyperionCH","date":"2020-02-05T09:00:53.061+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tatzeblu,realm=EUW,application-id=YnZkMR0R,discussion-id=vuLa1RPT,comment-id=0001,timestamp=2020-02-05T05:51:12.302+0000)\n>\n> Was man aber machen sollte und aktuell auch plant ist es, das System insofern zu verbessern, dass in beiden Teams eine gleiche Anzahl an Autofill-Positionen vorhanden ist.\n\nStand dies irgendwo und hast du eine Quelle?\nDenn eigentlich ging ich davon aus, dass Riot bereits von Anfang an dafür sorgte, dass die Autofills in beiden Teams ausgeglichen sind und dies jetzt nicht anpassen müssen.\nAber OK, wir sprechen auf der anderen Seite auch von Riot Games...","replies":[{"poster":"Tatzeblu","date":"2020-02-05T10:57:32.331+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=YnZkMR0R,discussion-id=vuLa1RPT,comment-id=00010000,timestamp=2020-02-05T09:00:53.061+0000)\n>\n> Stand dies irgendwo und hast du eine Quelle?\n> Denn eigentlich ging ich davon aus, dass Riot bereits von Anfang an dafür sorgte, dass die Autofills in beiden Teams ausgeglichen sind und dies jetzt nicht anpassen müssen.\n> Aber OK, wir sprechen auf der anderen Seite auch von Riot Games...\n\nIch dachte, dass ich das mal in einem Post von Riot gelesen hatte. Ask Riot oder sowas ähnliches. Aber kann auch sein, dass ich mich da irre.","replies":[{"poster":"HyperionCH","date":"2020-02-05T11:33:27.139+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tatzeblu,realm=EUW,application-id=YnZkMR0R,discussion-id=vuLa1RPT,comment-id=000100000000,timestamp=2020-02-05T10:57:32.331+0000)\n>\n> Ich dachte, dass ich das mal in einem Post von Riot gelesen hatte. Ask Riot oder sowas ähnliches. Aber kann auch sein, dass ich mich da irre.\n\nBesten Dank für die Antwort.\nIch schaue einmal bei den Ask Riot bzw. Dev Blogs vorbei; vielleicht finde ich dies.\n\nIch kann mir schon vorstellen, dass Riot dies wirklich erst jetzt umsetzt(e): du also richtig gelesen hast.\nEigentlich wäre diese Funktion von Anfang an nötig gewesen, aber bei Riot Games kann ich mir leider doch vorstellen, dass sie solch grundlegende Dinge nicht zu Beginn berücksichtigten.","replies":[]}]}]}]},{"poster":"HyperionCH","date":"2020-02-05T08:58:15.817+0000","up_votes":1,"down_votes":0,"body":"Das Problem wird aber sein:\nDie Wartezeit wird sich wohl um mehr als 10 Minuten verlängern.\n\nVor einigen Jahren gab es zwischenzeitlich einen Modus (Normal), bei dem man wirklich eine bestimmte Rolle auch wirklich spielen konnte.\nDamals übte ich die jeweils Support und Jungle, die damals die unbeliebtesten Rollen waren (damals war Draft Pick im Ranked und deshalb war es sinnvoll, dass man diese Rollen auch übte); zumindest in meiner Elo, da dann jeweils die andere Rolle noch fehlte, als ich einem Team zugewiesen wurde.\n\nBereits damals musste ich öfters 10 Minuten und länger warten (weil jeweils die andere Rolle fehlte). Für die damals beliebten Rollen Top, Mid und ADC war die Wartezeit bereits wesentlich länger.\nUnd mit Freunden war es auch oft so, dass dann jemand z.B. Support pickte, damit die Wartzeit kürzer wird.\n\nDies klappt in einem Normal, aber nicht im Ranked. Da wird es niemand geben, der freiwillig Support pickt, weil er die Rolle üben möchte oder um die Wartezeit für alle zu verkürzen.\nDamit wird im Ranked ohne Autofill rasch die Wartezeit auf über 15 Minuten ansteigen; ausserhalb von Bronze - Gold wird sie dann über 20 Minuten sein.\nViel Spass, wenn man 20 Minuten wartet, mehrere Minuten in der CS und im Ladebildschirm ist und das Game wegen eines dc's nach 3 Minuten ein Remake kriegt und man wieder 20 Minuten in der Queue steckt.\n\nDeshalb denke ich, dass die Mehrheit nicht so lange warten möchte. Gerade wenn es dann noch Remakes gibt oder einer der Mitspieler feedet und man bis zum 1. Surrender-Vote noch spielem muss, wird die Wartezeit nur noch frustrierender.","replies":[]},{"poster":"CG Mörglife","date":"2020-02-05T08:55:01.387+0000","up_votes":1,"down_votes":0,"body":"Beim ersten Teil stimm ich dir zu, beim zweiten wieder nicht.","replies":[]},{"poster":"Enderized","date":"2020-02-05T02:40:14.148+0000","up_votes":1,"down_votes":0,"body":"Ich nicht.\n\nich sehe keinen Grund Aphelios zu bannen.\n\nIn LoL? seit jahren nicht.","replies":[]},{"poster":"HairyAsianWife","date":"2020-02-06T12:20:17.763+0000","up_votes":1,"down_votes":1,"body":"Längere Wartezeiten verleitet dann als Konsiquenz high elo Spieler dazu auf ihren... \"Ehrenaccount\" zu gehen von denen es schon so genug gibt die der Community auf den Wecker gehen.","replies":[]}]}