{"poster":"schokix3","date":"2017-11-22T03:40:44.035+0000","title":"Belästigung, 10000Fas","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, ich werde von meinem Ex Freund Bel&auml;stigt, ich habe schon 1000000Accounts gebannt. Ich Frage mich wie man 10000 E-Mails haben kann, das er mir immer wieder Fa&#039;s schicken kann. Das ist grausam....Ich w&uuml;rde gerne seine ID Blockiert haben. Damit er mir keine Fas mehr schickt kann.{{sticker:sg-soraka}}","replies":[{"poster":"MagiicMushroom","date":"2017-11-22T03:45:59.214+0000","up_votes":3,"down_votes":0,"body":"Hmm :/ kann dir nur raten jeweils zu blockieren, oder die Fa's einfach nicht anzunehmen ^..\nhast dann halt immer rechts stehen ''**Friend Requests'' aber dich kann keiner anschreiben oder nerven :D\nFalls der sich jz weiterhin accounts macht, ist auch dieses ''Friend Requests'' irgendwann voll bei 50 glaube ich :D also soviel wird er auch nicht aufbringen haha\n\nIm allerletzten notfall könntest du auch entweder einen neuen acc machen/deinen jetzigen umbenennen und anonym halten oder sogar den Server wechseln :D \ngibt vieles... Viel Glück auf jedenfall {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"schokix3","date":"2017-11-22T03:53:54.616+0000","up_votes":2,"down_votes":1,"body":"danke ich habe auch paar nette leute jetzt die mir helfen. ich werde den supporter anschreiben vllt bringt das was. Danke für den text das du dir Zeit genommen hast. Schönen Tag noch.","replies":[{"poster":"Gin","date":"2017-11-22T08:10:16.639+0000","up_votes":1,"down_votes":0,"body":"Ich bin keiner vom Support, aber  ich würde dir auch das empfehlen was Mìd Or Afk geschrieben hat: Einfach Freundschaftsanfragen ablehnen oder ignorieren von Personen die du nicht kennst, irgendwann kapiert er es oder es wird ihm langweilig.\n\nUnd wenn du nicht jeden ablehnen willst, kannst du vorher das Level des Accounts nachschauen.\n\nWenn er unter Level 10 ist, kannst du diese eigentlich so gut wie immer getrost ablehnen. Oder noch besser: blockieren.","replies":[]},{"poster":"Megamaexx","date":"2017-11-22T06:18:13.482+0000","up_votes":1,"down_votes":0,"body":"Eine Umbenennung sollte wohl die einfachste Lösung sein. Vielleicht hat der Support noch weitere Ideen oder kann tatsächlich was bewirken","replies":[]}]}]},{"poster":"Qbert","date":"2017-11-22T05:59:22.120+0000","up_votes":2,"down_votes":0,"body":"Im schlimmsten Fall kannst du seine Belästigungen dokumentieren und damit zur Polizei gehen.\nDas schwierige hier ist jedoch nachzuweisen, dass es wirklich ER ist.","replies":[]},{"poster":"AI Yjuq","date":"2017-11-22T08:11:42.220+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir folgendes anbieten: Wir packen deinen Account mit 300 von mir erstellten Smurfs voll. Also, so dass deine Freundesliste dann voll ist, dann kann dir niemand mehr eine Freunschaftsanfrage schicken. Brauchst du mal 'n Platz frei kannst du dann einen der Smurfs raus schmeißen. ^^","replies":[{"poster":"Gin","date":"2017-11-22T08:42:15.104+0000","up_votes":1,"down_votes":0,"body":"300 von dir erstellte Smurfs? *Notiert sich den Namen auf die Beobachtungsliste*\n\nDa würde ich dir lieber von abraten. Und er wird die Liste wahrscheinlich selber voll spammen.","replies":[{"poster":"BlackAjani","date":"2017-11-22T08:48:09.578+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"BlackAjani","date":"2017-11-22T08:09:53.742+0000","up_votes":1,"down_votes":0,"body":"Das ist ja arm...\nMach dir nichts draus, dem vergeht bestimmt bald die Lust.","replies":[]},{"poster":"Starzzn","date":"2017-11-22T07:56:39.306+0000","up_votes":1,"down_votes":0,"body":"Namen ändern","replies":[]}]}