{"poster":"NalamiHUN","date":"2015-02-12T21:30:53.347+0000","title":"Grydas, a Remény Griffmadara (By Nalami)","subforum":"Rajongói alkotások","up_votes":4,"down_votes":1,"body":"Sziasztok!\n\nVégre elkészült a hőskészítő versenyre a hősöm, Grydas, a Remény Griffmadara!\n\nJóval hosszabb lett a története, mint a többi hősömnek, s neki már van szövege is! Érdemes azonban a többi hősömet is figyelgetni, mert náluk is lesznek majd történet frissítések, szövegek, stb!\n\n [A kép a Heroes of Might and Magic VI továbbfejlesztett griffmadarát ábrázolja](http://static9.cdn.ubi.com/en-GB/images/MMH6_CA_HAVEN_03_ImperialGriffintcm2110628.jpg).\n---\n**Történet:** Demacia minden lakója ismeri e nem e világinak mondható lényt még annak ellenére is, hogy csupán egyetlen egy, Demacia szemében igen nagy kincset jelentő könyvben szerepel a város történelmének legfontosabb csatája, aminek győzelmét neki köszönhet a város, s legtöbbször inkább a város kocsmáinak falán látható, ahogy elmeséli, hogyan fordította meg számtalan csata végkimenetelét Aatrox-hoz hasonlóan. Sok demaciai gyerek szereti hallgatni többször is, hogy a griffmadár, Grydas hogy érkezett Rúnaterrára, hogy átadhassa a világnak azt, ami addig csak kevés élőlény szívében létezett. Ám senki nem tudja, hogy számtalan dolog megtörténése is neki köszönhető...\n\nA történet sok-sok évszázaddal ezelőtt történt, amikor még létezett egy olyan sereg, amit ma már úgy neveznek, hogy a Pokol Légió. Az elnevezést a Pokolszörnyeknek nevezett tagjai miatt kapta: olyan borzalmas, hátborzongató lények voltak, amik csupán az Üresség lényeit nem tudták felülmúlni. Amerre jártak, iszonyatos pusztítások közepette foglalták el a területeket, s az embereket, Yordle-kat és egyéb humanoid lényeket vagy megölték vagy rabszolgákat csináltak belőlük. Olyan erősek voltak, hogy csupán csak egy terület maradt szabadon: az akkori Demacia birodalma. Demacia akkori királya, kinek nevét sajnos elfelejtették, elhatározta, hogy ő bizony nem fogja hagyni, hogy ezek a szörnyek egész Rúnaterrát terrorizálják, s seregével szembeszállt velük. Ám sajnos hiába harcoltak bátran katonái, a Pokolszörnyek rendszeresen győzedelmeskedtek, s a végére már csak a vár maradt meg. A király azonban ekkor se adta fel, mint pár katonája, hanem biztatta a seregét:\n- Mindenképpen meg kell védenünk a várat, s visszaverni a szörnyeket! Mi vagyunk Rúnaterra szabadságának utolsó darabja és egyben védelmezője! Ha most feladjuk, az egész világ örökre ezeknek a szörnyeknek a karmai közé kerül! - a biztató szavak hatására a katonák hihetetlen erővel védték a várat, ahogy csak lehetett. Ekkor a Pokol Légió legerősebb tagja, ki egyben a sereg Tábornoka is volt, Ozark kitalálta, hogy megtörik az ellenségüket a nagy leszámolás előtt. Először megetette egyik, varázslásra képes társával egy Álomjáró szívét, hogy az megszerezze annak álombefolyásoló képességét és rémálmokkal készítse ki Demacia katonáit. Ám a Király lélekgyógyítóival és biztató szavaival megakadályozta, hogy a serege tömeges öngyilkosságot kövessen el gyötrelmében, ami nem volt kedvező a Pokol Légiónak. Ezután egy Alakváltó katonát küldtek be közéjük, hogy belülről szedje szét őket, ám a Király tábornoka lebuktatta, ugyanis a Pokolszörny véletlenül egy előző nap meghalt katona alakját vette fel. Számtalanszor próbálkozott a Légió mindenféle módszerrel, ám mind kudarcot vallott. Aztán bekövetkezett a tragédia: Egy szörnyű betegség hasított végig a váron, így a Király a seregének több mint háromnegyedét elvesztette. Ozark azonnal élt az alkalommal:\n- FIGYELEM, AZ ELLENSÉG MEGGYENGÜLT! - kiáltotta a seregének. - ITT AZ IDŐ, HOGY LECSAPJUNK RÁJUK! - a Szörnyek harcias hévvel üvöltöttek fel.\n\n\\- APÁM! - szaladt a Királyhoz rémülten a Király 20 éves fia, a Herceg. - A Pokol Légió megtudta a vesztességeinket, és támadni akar!\n- Mindenki fegyverbe! Vissza kell verni őket!\n- De apám! Negyed annyian vagyunk csak, mint ők, meg fogunk halni!\n- Legyen úgy, ahogy a sors akarja, de nem nézhetjük ölbe tett kézzel, hogy ezek minden elpusztítanak! MINDENKI FEGYVERBE! - mivel a Királyt mégis csak tisztelték, fegyvert ragadtak, s csatába indultak a betegségnek köszönhetően a végkimerültség határán lévő katonák a sötét felhőkkel borított ég alá. A végső csapásra készülő Pokol Légió már-már röhögött a Demaciai sereg próbálkozásán, hogy megállítsák őket. Az összecsapásban a megmaradt sereg fele szinte azonnal meghalt a Pokolszörnyek karmai és fogai által, mialatt a többit a Király biztatta, miközben teljes erejéből harcolt, ám Ozark súlyosan megsebesítette, s végül megölte.\n- APÁM, NE! - tört össze a Herceg. A demaciai katonák szívébe is félelem költözött, miközben a tudat beléjük fúródott: elvesztették a csatát, s Rúnaterrát, mindörökre...\n- VÉGEZNI A FÉRGEKKEL! - azonban éppen hogy kimondta Ozark, valami váratlan csoda történt: A felhők szétoszlottak, majd három aranyló fénygömb csapott a Pokol Légióba, amitől azok hátrarepültek a lökéshullám következményében. A demaciai sereg nem tudott mit tenni döbbenetében, ahogy az égből egy természetfeletti fénysugár segítségével egy hatalmas, aranytollú griffmadár szállt le eléjük, minek ezüst páncélján halványan ragyogott a napfény. Ahogy az a katonákra nézett, azok úgy érezték, hogy valami felébredt bennük.\n- Ne adjátok fel a reményt, s győzni fogtok! - oly különös hang szólt a nemes lényből, ami biztos, hogy nem e világi volt. Olyan volt, mint ha egy isten beszélt volna az egykori Király seregéhez. - RÚNATERRÁÉRT DEMACIA! - a katonák és a Herceg eleinte csak ámulva nézték, ahogy a harcoló griffmadár úgy győzi le az ellenségeket, mint ha azok csak holmi egerek lennének egy macskának. Aztán a Herceg volt az, aki elsőnek felkiáltott:\n- RÚNATERRÁÉRT DEMACIA! - eztán a katonák, akik ekkor jöttek rá, hogy a remény volt az, ami felébredt testükben, egyszerre kiáltva rohamozta meg a Pokol Légiót, még pedig olyan hihetetlen erővel, hogy azok nem tudtak védekezni sem. A harc addig tartott, míg már csak egy Pokolszörny maradt: Ozark, aki éppen a griffmadárral harcolt. Demacia féltett könyve így írta le a két lény csatáját:\n\n> „A Szörny, ki hol egy szárnyatlan Darkin, hol egy hatalmas, démoni darázs alakját vette fel, minden erejével azon volt, hogy megölje a Griffmadarat, azonban az mindig kivédte a támadásait, s csak pár karcolást szerzett. Akik túlélték a Végső Csatát, úgy írták le kettejük harcát, hogy az egész olyan volt, mint ha a Mennyország és a Pokol ereje csapott volna össze egymással, amit csak fokozott az, hogy az Ozark nevű Szörny körül mindent fekete lángok emésztettek fel támadásai következtében, míg a magát később Grydas-nak nevező griffmadár fényével átszakította még a sötét felhőket is.”\n\nAzonban egyik fél sem tudta megölni a másikat, ezért Grydas minden erejét felhasználva egy másik létsíkba zárta Ozarkot, hogy soha többé ne tudja terrorizálni Rúnaterrát. A sereg boldog üdvrivalgásba kezdett, állítólag pár katona, akik egész életükben nem sírtak, most zokogtak örömükben, hiszen végre vége volt a Pokol Légió terrorjának. A griffmadár éppen elment volna, mikor a Herceg hozzászólt:\n- Várj! Ki vagy te? - a griff ránézett, s ismét megszólalt:\n- A nevem Grydas. Én vagyok egykori apád reményének megtestesülése. - majd egyik szárnyát a Herceg vállára tette. - Őszinte részvétem, herceg. Apád jó ember volt egész életében, így most az Égiek között van, s fentről vigyázz rád. Mielőtt lejöttem, megkért, hogy adjak át egy üzenetet neked. - a Herceg megdöbbenten hallgatta az utolsó mondatot. Tényleg találkozott az apjával az Égieknél, ahol a griffmadár állítása szerint van?\n- Mi volna az?\n- Azt üzeni, hogy mikor elfoglalod a trónt, esküdj meg szívedben, hogy soha nem adod fel a reményt, s megtanítod Demacia következő generációjának ezt, hogy apáról fiúra szálljon, hogy egy nap Demacia egyesítse egész Rúnaterrát. S ne felejtsd el: Rúnaterráért Demacia. - Ezekkel a szavakkal a magasba szállt, s elrepült. A Herceg rá két héttel apja temetése után elfoglalta a trónt, s uralkodása alatt megtett mindent, amit apja kért, s amit tennie kellett, hogy Demacia mai arca kialakuljon.\n\nÉvszázadokkal később Grydas még mindig tette a dolgát, amiért lejött Rúnaterrára, sőt, még többet is tett...\n>\\- Hogy mennyivel kell szembeszállnia?! - a férfinak, aki az elején azon döbbent meg, hogy találkozott ezzel a legendás alakkal az udvarában, ahol sétált, de most a hírektől, amit kapott, le ült a sokktól.\n\\- Az eddigi rekord hatszorosával.\n\\- De az képtelenség! Bele fog halni!\n\\- Éppen ezért kérlek meg arra, hogy mentsd meg. Az az ember jobb sorsot érdemel itt Demaciában, mint ezt Noxusban. Vállalod akár a lehetséges halált is, hogy megmentsd? - a férfi habozás nélkül rávágta:\n\\- Igen! Megmentem! Csak Kérlek annyit mondj meg, mi a neve, Remény Griffmadara! - Grydas halványan elmosolygott, amennyire tehette csőrével. Tudta, hogy a férfi valóban képes lenne kockáztatni az életét egy olyanért, akiről csak most hallott, hogy megmentse.\n\\- A Húsdarálóban Visceróként ismerik, de az igazi neve Xin Zhao. Sok szerencsét, II. Jarvan Király. - Majd kirepült az udvarból, ahol beszélgettek, hogy II. Jarvan keze által teljesüljön be Demacia leendő udvarmesterének a sorsa...\n...\nA nő megszeppenve ült az asztalánál, ahol reggelizett, amikor meghallotta azt az égi hangot, ami a nevén szólította, s arra kérte, hogy menjen ki a kertbe. A kíváncsisága nagyobb volt az ismeretlentől való félelménél, így elhagyta az étkezőt, hogy kimehessen a megadott helyre. Ott majdnem elájult a döbbenettől, mikor meglátta a hang tulajdonosát.\n\\- Te jó ég... - hebegte. - Grydas? A Remény Griffmadara?\n\\- Igen, én vagyok.\n\\- Édes istenem... Le kell ülnöm, mert ez hihetetlen... - ült le egy padra a nő a döbbenettől.\n\\- Azon gondolkodsz, hogy miért vagyok itt és hívtalak.\n\\- Igen! De honnan tudja?\n\\- Látom a lelkedben. Azért jöttem, hogy a segítségedet kérjem.\n\\- Az én segítségemet?\n\\- Igen. Van egy árva lány, aki hiába várja, hogy valaki örökbe fogadja, senki nem teszi. Arra kérlek, hogy változtasd meg sorsát azzal, hogy befogadod, s úgy bánsz vele, mint saját lányoddal. Ám figyelmeztetlek, hogy van nála valami, ami egy nap a halálodat fogja okozni. Így is megteszed, amire kérlek? - Grydas félt attól, hogy a nő nem fogja megtenni most, hogy tudja, mi vár rá. Azonban a nő így felelt:\n\\- Igen.\n\\- Ezek szerint nem félsz a haláltól?\n\\- Az élet és a halál olyan, mint az elválaszthatatlan házasok, Remény Griffmadara. Ha meghalok, legalább abban a tudatban halok meg, hogy jobbá tettem egy embertársam életét. - Grydas legszívesebben sírt volna. Biztos volt benne, hogy a nő is az Égiek közé kerül, akárcsak akkor a Király és II. Jarvan.\n\\- Akkor elmondom, amit tudnod kell Miss Buvelle: A lány neve Sona, akiről még azt kell tudnod, hogy néma. Nála van egy etwahl nevű hangszer. Szoros kötelék fűzi Sonát és az etwahl-t, mert a hangszer a lány hangja. Az árvaház pedig Ioniában van. Ne félj, hogy eltévedsz, mert amint Ionia földjét érinti a lábad, tudni fogod merre kell menned.\n\\- Köszönöm, Grydas, legyen neved örök, mint a Remény. - miután elváltak útjaik, Lestara Buvelle azonnal elindult Ioniába...\n\nNem csak Xin Zhao és Sona voltak az egyetlenek, akiken Grydas a háttérbe húzódva segített beteljesíteni a sorsukat. Sok hős nem is sejti talán a Ligában, hogy Grydasnak köszönheti, hogy olyanná vált, amilyen, különben rosszabb sorsra jutott volna. Amerre kétségbeesés volt, ott reményt hozott, hol valaki jobb sorsot érdemelt, ott a háttérbe munkálkodott, hogy végül beteljesüljön annak a személynek szánt jobb sors. Csupán páran látták őt, akik vagy azt hitték, hogy káprázott a szemük, vagy nem hittek nekik, így csöndbe végezhette feladatát. Ám egy éjszakán szörnyű rémálma volt: ősi ellensége, Ozark kihasznált egy naiv férfiút Ikáthia romjai között, hogy kiszabaduljon. Amint felébredt a rémálomból, azonnal Ikáthia felé vette az útját, hogy megakadályozza a Pokolszörny szabadulását. Ám mire odaért, túl késő volt: A épület tetejétől már látta, hogy Ozark kiszabadult, sőt, már el is hagyta a egykori város romjait, miután megölte kiszabadítóját, s annak társait, akiket éppen a sokkos állapotban lévő Malzahar bámult. A griffmadár nem akarta elhinni az egészet: mégis hogy sikerült Ozarknak megtévesztenie a szerencsétlent, aki előtt még ott állt a jövő, hogy szabadítsa ki? Talán elhitette vele, hogy ő egy jó szellem, akit fogságba ejtettek? Vagy hatalmat ígért neki? Esetleg más módszerrel? De tudta, hogy ez már nem számít, csupán az, hogy megállítsa, mielőtt talál valamilyen módszert, hogy felélessze a Pokol Légiót, s ismét terrorba és rabszolgaságba taszítsa Rúnaterrát. Viszont egyedül nem tudja megtenni, hiszen akkor se tudta elpusztítani, csupán bezárni, de isten tudja, hogy ott mekkora erőre tett szert. De honnan tudna szerezni segítséget?\n- A liga! Hát persze! - kapta fel a fejét, amint eszébe jutott a Legendák Ligája. Hogy is felejthette el, mikor a háttérben segítette azt a nyomozást, ami végül az akkori Főtanácsos, Heywan Relivash gaztettének lebukását eredményezte? Nem is tétovázott, azonnal szárnyra kelt, s meg sem állt a Háború Intézetéig, ahol mindenki, aki ismerte őt és legendáját, főleg Demacia hősei, teljesen megdöbbent, mikor meglátták a Remény Griffmadarát, aki évszázadokkal ezelőtt elhozta Rúnaterrának a reményt.\n\n**Barátok:** Demacia hősei\n**Riválisok:** [Ozark](http://boards.eune.leagueoflegends.com/hu/c/rajongoi-alkotasok/E8XpuAnR-ozark-a-gyilkos-daraazs-by-nalami), Aatrox\n---\n**Játékmenet:**\nMár megint nem tudom. Valószínűleg Támogató/Harcos, aki olyan lenne két képességénél, mint Lulu: használható szövetségesen is meg ellenségen is. Másodlagos erőforrása a Mana.\n\n**Képességek:\nAlaptámadás:** Karmol és csíp\n\n**Passzív: Örök Remény** – Amikor meghal, kiszáll a testéből egy fénygömb, ami 4 sugárrá foszlik szét, s a szövetségesekbe száll, ezzel visszaadja nekik a hiányzó Életerő és Mana 20%-át. 3 perc a statikus töltési ideje.\n\n**Q: Szárnypenge** – AKTÍV: a Grydas szárnyain lévő tollak borotvaélesekké válnak, amik támadáskor megsebzik az ellenfelet.\n\n**W: Pajzs és Lándzsa** – AKTÍV: Szövetségesen alkalmazva Grydas rövid időre immúnissá teszi társát mindenféle hatástól egy fényből kreált pajzs segítségével, ellenségen alkalmazva pedig egy fénylándzsát küld az ellenfélbe, találatkor megbéklyózva azt.\n\n**E: A Fény Földje** – AKTÍV: Egy területen egy fénnyel teli kört hoz létre, ami a szövetségeseknek Életerőt tölt vissza, az ellenfeleket pedig megvakítja. \n\n**R: A Remény ereje** – AKTÍV: Grydas lehív egy hatalmas területen belül egymás után három gömböt, amik becsapódáskor hátralökik és megsebzik a körülötte lévő ellenfeleket. A használatok között 5 másodperc telik el, míg a 3. és egyben utolsó gömbnél indul el a visszaszámláló.\n---\n**Hang és jellem:** A hangja mint Fényív Vel'koz-nak, csak sokkal kedvesebb. Mindig igyekszik biztatni csata közben a szövetségeseit, akiket az élete feláldozásával is megvéd. Némelyik mondata bölcsesség, vagy tanács a szövetségeseknek és az Idézőjének.\n\n**Szövegek:**\nHős Választás:\nA remény mindig a szívedben él, idéző.\n\nEgy meccs elkezdésekor:\nNaminak {{champion:267}}:\nNe félj Dagályhívó, néped megmenekül a szörnyű sorstól.\nAmíg reménykedsz, nincs semmi elveszve, Nami.\n\nNasusnak {{champion:75}}:\nTestvéred egy nap a régi lesz, Nasus.\nRenekton legbelül még az, akit testvérednek hívsz, Nasus.\n\nXin Zhao-nak {{champion:5}}:\nÖrülök, hogy láthatlak, Demacia udvarmestere.\nHűséged többet ér az aranynál, Xin Zhao.\n\nSonának {{champion:37}}:\nTöltsd meg a remény dalával a kétségbeesettek szívét, Sona!\nPont olyan kedves és jóságos vagy, mint amilyen ő volt, Sona. (itt Lestara-ra utal)\n\nAshe-nek {{champion:22}}:\nÁlmod valóra fog válni, Fagyos Íjász!\nEgy nap Freylord egy föld és egy nép lesz, Ashe.\n\nMozgás:\nAhogy kéred, Idéző.\nMint vándor az élet útján.\nAz éj sötétjét átszakítja a csillagok fénye.\nÖt hős, egy cél.\nHallod az élet dalát, Idéző?\nAhol a Halál lecsap egy élőlényre, az Élet esélyt ad egy másiknak.\nA Remény világítsa meg legsötétebb óránkat!\nA kitartásnak a győzelem lesz a gyümölcse, társaim!\n\nTámadás:\nRúnaterráért!\nA Sötétség soha nem győz!\nA Bátorság megtörhetetlen!\nAz Égiek segítenek rajtunk!\nSoha nem adjuk fel!\nNem vagyok egyedül.\nA Remény örök életű!\nA kétség a gonoszok fegyvere!\n\nW használata:\nSzövetségesnek:\nMegvédlek, barátom!\nMaradj a Pajzs alatt.\nEllenségnek:\nNincs menekvés!\nAz igazság utolér!\n\nE használata:\nRagyogj, Rúnaterra!\nÍme Rúnaterra fénye!\n\nR használata:\nSzólítlak titeket, Égiek!\nÉgiek, mutassátok meg erőtöket!\n\nHazateleportáláskor:\nA Remény mindig veletek lesz, barátaim.\nMindjárt jövök vissza, tartsatok ki.\nMost máshol van szükség rám.\n\nViccek:\nSajnálom, de minden viccem egyszer elszállt, s azóta egy sem jött vissza.\n\nGúnyolódások:\nAki a gonosszal van, az már elvesztette a csatát.\nAz gonosz ereje a saját szolgáit is megemészti.\nVan az Ürességnél sokkal rosszabb hely is.\n\nKayle-nek {{champion:10}}:\nMiért Kayle? Miért ölted meg azokat, akik csak szerinted voltak bűnösök?\nAz igazság szolgáltatás nem életek kioltását jelenti, Kayle!\nHogy mered magadat jónak nevezni, mikor kitagadtad saját húgodat is?! \n\nRenekton-nak {{champion:58}}:\nRenekton, térj vissza ahhoz, aki régen voltál!\nHiányzol a testvérednek, Renekton.\nTudom, hogy legbelül még nem vesztél el, Renekton!\n\nZed-nek {{champion:238}}:\nAz Árnyak kihasználnak téged, Zed!\nEgykor nagy ninja voltál, ma már csak önmagad árnyéka!\nNagy jövő állt előtted Zed, de te eldobtad egy parazitáért! (Itt a tiltott technikára utal)\n\n[Ozarknak](http://boards.eune.leagueoflegends.com/hu/c/rajongoi-alkotasok/E8XpuAnR-ozark-a-gyilkos-daraazs-by-nalami):\nA korszakodnak már vége, Gyilkos Darázs!\nVissza foglak zárni oda, ahová való vagy, Pokolszörny!\nRúnaterra összefog majd ellened, Ozark!\n\n[Noaterának](http://boards.eune.leagueoflegends.com/hu/c/rajongoi-alkotasok/RAz3WYOM-noatera-a-bosszaszomjas-vadaasz):\nA bosszúvágyad megölte azt, aki voltál, Noatera...\nNem vagy lélekben különb azoknál, akiket megöltél, Noatera!\nNem vagy több egy bosszúszomjas szörnyetegnél, Noatera!\n\n[Sadraalnak](http://boards.eune.leagueoflegends.com/hu/c/rajongoi-alkotasok/coXMrqcI-sadraal-the-destroyer-of-darkness-a-legels-lol-projekt-hs):\nA Sötétséged soha nem győz, Saadral!\nA Sötétség csak addig uralkodik, míg fel nem kel a Nap, Saadral!\nAz Árny-Szigetek egy nap ismét a régiek lesznek, Saadral!\n\nTárgyak vásárlásakor:\nA felemelkedés talizmánja {{item:3069}}:\nÓh Shurima, a Felemelkedettek egykori hazája...\n\nNaptűz köpeny {{item:3068}}:\nA láng a tiszta szív melegségének szimbóluma.\n\nRubin Látókő {{item:2045}}:\nMegmutatja az utat a háború ködében.\n\nZz'Rot-kapu {{item:3512}}:\nAz Üresség ivadékai most a mi oldalunkon állnak.\n---\n**Nyugati Oltár:**\nVégre eljöttél, Grydas!\nHozd vissza a reményt a szigetekre, Remény Griffmadara!\n\n**Keleti Oltár:**\nTűnj el a szigetekről, griffmadár!\nA szigeteknek nincs szükségük rád, Grydas!\n---\nÉrdekességek róla:\n- A neve a latin Gryphem (Griffmadár) és a görög ελπίδα/Elpída (Remény) szónak az összegyúrása.\n- Amint láttátok a szövegei legvégén, ő az első nem Árny-Szigetekről származó hős, akihez külön szövegei lennének az oltároknak.\n- Az „A Remény világítsa meg legsötétebb óránkat!” mondata a Transformers Animációs Mozi képregényéből van, ahol így hangzik: „Most... Világítsd meg legsötétebb óránkat!”","replies":[{"poster":"Jinx the Killer","date":"2015-05-06T17:21:35.902+0000","up_votes":1,"down_votes":0,"body":"Teszik a vicce,meg úgy a játékmenete...és a w-nek hány mp a CD-je?","replies":[{"poster":"NalamiHUN","date":"2015-05-06T18:59:38.480+0000","up_votes":1,"down_votes":0,"body":"Kicsit hosszabb, mint a legtöbb W-nek, ha figyelembe vesszük, hogy szövetségesen és ellenfélen is lehet használni.","replies":[]}]},{"poster":"Th3NoName","date":"2015-03-29T17:45:57.890+0000","up_votes":1,"down_votes":0,"body":"Zed tauntjai mindent visznek. Éreztem, hogy lesz valami vele kapcsolatban, a sztori olvasásakor. Easy GG. Nagyon bejövős, megérte dolgozni vele. \n\nA rajzot nem tudom, hogy te készítetted-e, de nagyon jó lett (az is).{{champion:18}}","replies":[{"poster":"NalamiHUN","date":"2015-03-30T12:00:12.605+0000","up_votes":1,"down_votes":0,"body":"Köszönöm :)\n\nA rajz, mint ahogy az elején írtam, nem az enyém, hanem a Heroes of Might and Magic VI továbbfejlesztett griffmadarának a képje, de köszönöm a készítő nevében. :)","replies":[]}]},{"poster":"Ayfree","date":"2015-03-01T13:37:17.601+0000","up_votes":1,"down_votes":0,"body":"Hát Enhi... :D Elismerésem. Nekem nagyon tetszett. :)","replies":[{"poster":"NalamiHUN","date":"2015-03-04T21:25:40.321+0000","up_votes":1,"down_votes":0,"body":"Köszi!:)","replies":[]}]},{"poster":"KuvinFukinAtya","date":"2015-02-13T19:48:57.873+0000","up_votes":1,"down_votes":0,"body":"Szerintem remek lett megérte a fáradságot;]","replies":[{"poster":"NalamiHUN","date":"2015-02-14T13:19:50.888+0000","up_votes":1,"down_votes":0,"body":"Neked is köszönöm :)","replies":[]}]},{"poster":"Lord Babkonzerv","date":"2015-02-13T06:32:09.183+0000","up_votes":1,"down_votes":0,"body":"Sztem nagyon jó lett! Megérte a sok munkát! :)","replies":[{"poster":"NalamiHUN","date":"2015-02-13T12:11:30.602+0000","up_votes":1,"down_votes":0,"body":"Köszönöm :)\n\nIgyekeztem a legjobbat kihozni a versenyre :)","replies":[]}]}]}