{"poster":"RoninStarr","date":"2016-04-14T22:39:06.613+0000","title":"Suspended?","subforum":"Player Behavior","up_votes":3,"down_votes":21,"body":"So, I was recently given a chat restriction for things i&#039;ve said in game. First thing i&#039;ll say that I don&#039;t understand is, why do you put a chat filter in a game, AND give the function to MUTE people so you don&#039;t deal with their negative attitude, if you&#039;re also going to suspend their accounts? If someones negative because they&#039;ve had a bad game, then so be it. Who cares. Mute them and move on. We all have bad games. What do you want us to do, play the game and not vent? We play video games to relieve stress. That aside, I understand the times I received a chat restriction. However, this is completely unacceptable. I think from going to cursing every sentence to what i&#039;m about to post, should be a huge turn around. But I receive a suspension for this? I don&#039;t think that&#039;s right and I would like to know how it is right. \r\n\r\nThe community, as in the players in that game, just didn&#039;t like me, because I was pointing out things that people were doing wrong, and they report me for verbal abuse. I didn&#039;t curse once in that game, nor did I negatively harass anyone. I tried to keep composure as best I can, and I believe from cursing consistently to this, I think it should be praised that I&#039;m doing better. But instead I&#039;m banned. And i&#039;m banned just because I get reported by people? People report people every game. If someone on the team becomes the blame, everyone reports them just to make themselves feel better. Did anyone even read these chat logs to see that I didn&#039;t even flame or be &quot;toxic&quot;?\r\n\r\nRoninStarr,\r\n\r\nYou have received a 14 day ban following an extensive audit of in-game behavior within recent League of Legends matches.\r\n\r\nYour peers judged your behavior to be far below the standards of the League of Legends community. Think through the conversation and reflect on your words. League is an intense, competitive game, but every player deserves respect. Read more about the effort to encourage sportsmanlike play, here.\r\n\r\nHere are some chat logs that were identified as negative by other players in the community.\r\n\r\n~~~~~~~~~~~~~~~~~~~~~\r\nit was my own fault, I keep going too hard\r\nbad has more dmg than I expect\r\nwhen we&#039;re lvl 6 I swear they&#039;re so done\r\nthey&#039;re constantly pushed bot\r\nnot sure why hec doesn&#039;t come or hasn&#039;t yet\r\nthanks zil\r\nthanks hec\r\nappreciate all the help you guys give us\r\nnot flaming\r\njust pointing out the obvious\r\noh look more ganks to lanes and our jungler isn&#039;t there\r\nnor mid\r\nawesome\r\nplaying safe doesn&#039;t matter at this point, all lanes lost and we don&#039;t have a jungler\r\nlmao hec still farming jungle while we&#039;re fighting mid and we&#039;re losing towers bot\r\nlike I said, we don&#039;t have a jungle\r\nHecarim, you have a map, it shows you where people are. You&#039;re on a team, not solo game. Help your team.\r\nThere are objectives, defend your teams, and attack their teams.\r\nyou were farming jungle\r\nlmao, how does this happen\r\njungler says he helped mid by ganking 5 times\r\nyet our mid still lost\r\nhahhaa gg\r\nlol how does a lane lose when they get 5 ganks\r\nand if you gank the same lane 5 times and don&#039;t help the other lanes, how does that help the team\r\nnami how come you always save your ult?\r\nyou just had 4 people right in front of you\r\nwe had them under tower\r\nand you don&#039;t ult\r\ngg\r\nyou have always only ult&#039;d 1 person\r\nnah i&#039;m good\r\ngames over\r\nwe stood no chance with this mid and jungle and top\r\nit&#039;s been over for awhile\r\ngg\r\ngg\r\nlux gj winning against our mid despite he got 5 ganks and still lost\r\nglad our jungle focused only your lane","replies":[{"poster":"RoninStarr","date":"2016-04-14T22:46:02.652+0000","up_votes":1,"down_votes":7,"body":"You can read what I was banned for, tell me if you think someone should be banned for that. We had a jungler that went mid 5 times, and didn't go top or bottom. He even said so in game. Top lost, bottom lost, and the mid was constantly roaming to bottom lane to gank. Our mid never left lane, but also got 5 ganks and still lost lane. But I get banned for pointing it out and saying they need to help?","replies":[{"poster":"Riot Tantram","date":"2016-04-15T21:44:22.223+0000","up_votes":13,"down_votes":0,"body":"If you are looking for feedback from the community about the chat you should include all 3 games that were given on your reform card.\n\nAlso, please keep in mind that your 3 previous punishments you obtained in a single month are also taken into account for escalation.","replies":[{"poster":"MeilinII","date":"2016-04-15T21:55:13.664+0000","up_votes":4,"down_votes":0,"body":"{{summoner:11}} 'd","replies":[{"poster":"OhWanderer","date":"2016-04-17T02:56:14.843+0000","up_votes":2,"down_votes":0,"body":"atleast it isnt a rohjin {{summoner:11}} {{summoner:11}} {{summoner:11}} {{summoner:11}}  he would have posted all the chat logs and publicly announced on the boards the suspension, as a way to embarrass him.","replies":[]}]}]},{"poster":"elduris","date":"2016-04-15T00:05:00.573+0000","up_votes":9,"down_votes":1,"body":"I think you should be suspended for this, yeah. It's not what you say, it's how you say it. If you complain all game and have an overall negative attitude, people pick up on that stuff and it will lead to a negative environment. \n\nTruth is, you aren't going to be ganked all game every game, by your teammates or your enemies. If your jungler doesn't gank for you, then you need to play with that condition in mind, not complain to your team about not getting a gank. Chances are he made a tactical decision and found that ganking bottom wouldn't be worth as much.\n\nSpeaking as a jungle main, the quickest way to never get a gank from me is to complain about my \"absence\" in the game. Stuff like \"we don't have a jungler lol\" or \"you have a map, it shows you where people are\" are super sarcastic and just downright rude. There's no reason to behave like this. If one of my teammates starts talking like this, it makes me much less likely to want to help them.\n\nBe kind to your teammates. It goes a long way.","replies":[]},{"poster":"Kallian","date":"2016-04-14T22:55:35.038+0000","up_votes":6,"down_votes":0,"body":"i hate to be \"THAT GUY\" but to avoid a ban because of it, you have to play nicer. no offense to anyone who plays the game, but people who play it tend to act like little kids when someone points out a flaw in their game. try a nicer approach next time, ask nicely, and when you get flamed for it, report them and send the chat logs.","replies":[]},{"poster":"Illiad","date":"2016-04-16T00:40:47.420+0000","up_votes":1,"down_votes":0,"body":"I want you to understand, otherwise you cannot grow as a person. why did you get banned? what did you say to make them want to report you? consider these things more than you ever have, empathize with their decision, you dont need to be the bad guy in these situations, you can modify your behavior more than anybody can tell you too, because its up to you to change","replies":[]}]},{"poster":"Illiad","date":"2016-04-14T22:46:43.769+0000","up_votes":8,"down_votes":0,"body":"lol, wow, this was a toxic overload of misunderstanding and a wrong mindset. Because you don't curse or say something blatantly offensive, doesn't mean others wont consider it in a 1,000,000 different ways than you did. this entire chat, you criticized like a grammar Nazi and created an overall unpleasant environment for those involved, if you need to vent, don't to it at the people in a match, you created the issue yourself. and here we are. re-evaluate yourself, how to choose to talk to others, how you choose to respond to situations, and to take things much, much easier than you have shown to. Maybe by being the bigger person and not added to the toxicity, then you wont be where you are now. :) im being honest. the way you choose to behave is yours alone, you got suspended, view things from their perspective and you might see why you were suspended and grow as a person in the future","replies":[{"poster":"MyAccountStolen1","date":"2016-04-15T23:08:36.547+0000","up_votes":1,"down_votes":2,"body":"OMG IM OFFENDED< MUST GET THIS PERSON BANNED TO FEEL BETTER ABOUT MYSELF.  \n\nthis is the mentality that should get you permabanned.   Attempting to troll someone by getting them banned.  The true toxic of League.","replies":[{"poster":"Bídoof","date":"2016-04-16T03:20:35.415+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MyAccountStolen1,realm=NA,application-id=ZGEFLEUQ,discussion-id=oBtIFIKx,comment-id=00020000,timestamp=2016-04-15T23:08:36.547+0000)\n>\n> OMG IM OFFENDED&lt; MUST GET THIS PERSON BANNED TO FEEL BETTER ABOUT MYSELF.  \n> \n> this is the mentality that should get you permabanned.   Attempting to troll someone by getting them banned.  The true toxic of League.\n\nSounds like someone got banned for being toxic","replies":[]},{"poster":"Illiad","date":"2016-04-16T00:42:10.710+0000","up_votes":1,"down_votes":0,"body":"pardon?","replies":[]},{"poster":"KronikAura","date":"2016-04-16T22:29:54.587+0000","up_votes":1,"down_votes":0,"body":"oh my god thank you","replies":[]}]}]},{"poster":"Wulf Helhammer","date":"2016-04-14T22:43:51.291+0000","up_votes":6,"down_votes":0,"body":"[https://media.giphy.com/media/L7XBc0r7MD4Ck/giphy.gif](https://media.giphy.com/media/L7XBc0r7MD4Ck/giphy.gif) I'm really just done with these. People really don't see what it ks that they are doing wrong, or why this system exists","replies":[]},{"poster":"RoninStarr","date":"2016-04-14T22:49:27.445+0000","up_votes":2,"down_votes":7,"body":"The only issue I created in that game was a chat issue. What am I supposed to do in a game where our jungler literally only goes mid 5 times, and their mid comes bot and ganks while our mid never leaves lane? Should I just not say anything and try as hard as I can for nothing since people don't do their jobs properly? They don't call mia's, they don't help other lanes, but they only help each other and then report me because I ask for help. Yes I was sarcastic, but at the same time, they were the ones not helping the other teammates out. But they needed someone to blame for the loss so they choose me just because I talk","replies":[{"poster":"Erdrik","date":"2016-04-14T23:24:37.442+0000","up_votes":6,"down_votes":0,"body":"Lol is not a chat room.\nThe point of the game is to play the game.\n\nTalking in chat is meant to further that end.\nEncouraging others to that end, or communicating necessary information.\nIts ok to chat if you are doing either of these things, but if your team is not receptive to your communications **then stop communicating**.\n\n\nAnd some clarification on the punishment system:\n\n> The severity of the punishment is not based on severity of offense. It is a 4 strike system, where severity of the punishment is based on how many strikes you have accrued:\n> \n> 1st strike - 10 game chat ban\n> 2nd strike - 25 game chat ban\n> 3rd strike - 14 day full ban\n> 4th strike - perma\n>\n> There is an exception for hate speech, racial slurs, or extreme cases of toxicity, that will result in skipping and going straight to 3rd or 4th strike.\n\nIf you've been punished before, and the last punishment was your 2nd strike, then 14 day ban will result regardless of the offense.\n\nBasically you are not being punished for individual cases of toxicity. Rather you are being punished for **continued** cases of toxicity after having been **told to stop 3 times**.\n\nA bit of warning.\nThe transition from 14 day to perma is more sensitive than the other strikes, because at this point your history has shown no signs of remorse or reform. If you want to keep your account, you need to kill all toxicity from your matches for at least 3 months.\n(it takes 3 months to clear one strike, so 9 months total to fully clear your account)","replies":[]},{"poster":"Illiad","date":"2016-04-16T00:36:31.478+0000","up_votes":1,"down_votes":0,"body":"It's not what you say, its how you say it. acting offending by their decisions isnt going to make them want to involve themselves with you any more than before, be nice! light hearted! joke and enjoy the game for the game that it is. People arent perfect, things happen, things you disagree with, things you agree with, its your decision to choose how you approach it, friendly and entertaining for the entire group, or stressful and tension filled for all involved. \"Manners maketh Man\"","replies":[]}]},{"poster":"MyAccountStolen1","date":"2016-04-15T23:05:47.848+0000","up_votes":1,"down_votes":5,"body":"The lesson here, is never type in any game or risk a ban. Period.  Remember, the truth is toxic.\n\n  Also its a myth about the 3months to reset a tier thing.  I would venture to gues It has to be a certain number of games.  I had a 10 game then 25 game, then went roughly a month without getting reported, but i just had a 10 and 25 game stack up on me.  Im trying to remember not to type anything at all, but its hard.","replies":[]}]}