{"poster":"Darkmind1212","date":"2015-02-10T01:51:28.017+0000","title":"Lets make League of legends a better place.","subforum":"[ARCHIVED] Miscellaneous","up_votes":2,"down_votes":0,"body":"Its no surprise that the league of legends community is not what one would call \"the best\" in terms of its attitude. I would go on to list what all I am referring to but most of you know all to well what I mean. Now what I am posting today is not what I would call a rant but more of just a group brainstorming session on ideas. What ideas you may ask? Well Ideas to improve the community of course. Now these ideas are not the obligatory \"BAN AFKERS!\" \"TROLLS SHOULD BE PURGED!\" \"BURN THE WITC-(whoops sorry wrong example)\". What I mean are ideas that are a bit more constructive than just the removal of community members. \r\n                                                                                                       Now these ideas can range from guides to help people who rage often find ways to better calm themselves, From ways to change ones outlook on the game to help their experience with the game itself. I am going to close my statement with a few ideas I had in mind for examples before I start to wonder off the topic too much. I am sorry if any of this is worded oddly as I have never tried to post a topic like this before and it might be a bit strange to some. Now time for some ideas. I hope to see some very interesting ones if this is to catch on.\r\n\r\n-Use constructive criticism over harsh criticisms. To better explain this, Try and be helpful in providing information to your teammate if they were to make a mistake rather than chewing them out over it. The player will most likely feel more inclined to cooperate with you more if you show that you have the ability to work with him through and through.\r\n-Its just a game. This is something that a person that is prompted to rage a lot should understand. Now this is not to be confused with \"its just a game get a life\" or \"wow really? getting angry and huffy at a video game?\". This statement is meant to explain that it is simply well...A video game. And video games are meant to be enjoyed and played and made souly for your enjoyment. So even in the events of a loss understand that it is only a game made to be enjoyed be it win or lose. If you don't enjoy losing I understand this can be hard but consider what all you learn in a loss such as match up information and things you can use next time. So a loss is not something to fret over as it only shows that you can become better as a player.\r\n\r\nHope this helps at least someone. -Darkmind-","replies":[{"poster":"Puri Puri Taric","date":"2015-02-10T16:36:14.865+0000","up_votes":1,"down_votes":1,"body":"im not ranting im just telling the truth.","replies":[{"poster":"Darkmind1212","date":"2015-02-11T14:22:51.383+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maegges,realm=EUW,application-id=cIfEodbz,discussion-id=AtE7rk8O,comment-id=0004,timestamp=2015-02-10T16:36:14.865+0000)\n>\n> im not ranting im just telling the truth\n\nSo by this strand of logic the whole community should just give up because trolls are about? So I guess there shouldn't be any police around because crime exists too right? And as I said this was not a place to go on about trolls. Troll where not even the central focus let alone in the topic.","replies":[]}]},{"poster":"Kirrbie","date":"2015-02-10T02:28:52.096+0000","up_votes":1,"down_votes":1,"body":"the only real way to get ride of all the hate and unfairness is to uninstall and dont play it anymore like what i just did.","replies":[{"poster":"Darkmind1212","date":"2015-02-10T14:47:16.958+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ULGRENN,realm=NA,application-id=cIfEodbz,discussion-id=AtE7rk8O,comment-id=0002,timestamp=2015-02-10T02:28:52.096+0000)\n>\n> the only real way to get ride of all the hate and unfairness is to uninstall and dont play it anymore like what i just did.\n\nBut some people would like to keep their hobby. So Would something like a prolong break away from it be a better way? I mean it worked for me in terms of getting in control of my anger so it might work for some.","replies":[]}]},{"poster":"Darkmind1212","date":"2015-02-10T02:01:22.428+0000","up_votes":1,"down_votes":0,"body":"Please let us stay on task >_< I don't want this to become a rant on how we can never fix trolls. This is not their spotlight, This is for us who are willing to help in anyway we are able to.","replies":[]},{"poster":"Puri Puri Taric","date":"2015-02-10T01:55:03.349+0000","up_votes":1,"down_votes":1,"body":"Doesnt help in my eyes. If The are really Into trolling They create a smurf , log in and troll like ever before.","replies":[{"poster":"Darkmind1212","date":"2015-02-10T02:00:03.994+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maegges,realm=EUW,application-id=cIfEodbz,discussion-id=AtE7rk8O,comment-id=0000,timestamp=2015-02-10T01:55:03.349+0000)\n>\n> Doesnt help in my eyes. If The are really Into trolling They create a smurf , log in and troll like ever before.\n\n This thread is not to rant about trolls. This thread is to ask those who are wiling to help to get the word out and help the community improve in what ways we can. All internet community's have trolls, This is a sad truth but this is not about them this is about those who are willing to improve not hinder. Don't give trolls a spotlight here.","replies":[]}]}]}