{"poster":"Darkmind1212","date":"2015-02-26T15:01:38.435+0000","title":"Are the 'Gameplay and balance' Boards just sickening to read?","subforum":"[ARCHIVED] Miscellaneous","up_votes":10,"down_votes":4,"body":"I well...Feel sick just looking at the topics. I pray that I am just crazy and am unable to see the better topics hidden underneath but all I am able to see is people yelling about every change in every patch and people screaming for champions to receive nurfs without giving any sort of constructive inputs what so ever. As I said, I pray that I am crazy just to negate the reality of what I keep seeing there. Is there any chance that area of the boards can get any better?\r\n\r\nSorry for how lack luster of a topic this was, I am just wanting to make sure my sanity was intact is all.","replies":[{"poster":"Hibeki","date":"2015-02-27T05:04:27.012+0000","up_votes":2,"down_votes":0,"body":"You see a bottleneck there because they can't post anything on reddit.\n\nLegitimately most the stuff that hits the front page of Gameplay and Balance is stuff that actually needs to be adressed, but if you go on the league of legends subreddit there is literally nothing regarding the balance and healthiness in this game.\n\nIf you ever do make a post, it will be either deleted or downvoted into oblivion because it's either not:\n\nA. Discussing LCS (7/10 of the topics)\n\nB. \"Look at this flashy play youve seen a thousand times\" videos (1/10 of the topics)\n\nC. An extremely minor change that is almost always purely appearance or visual aspects of the game such as \"Veigar lost his unique lines on E from his skin\" yet the fact that veigar was totally destroyed wasn't even ADDRESSED.","replies":[]},{"poster":"warpenguin555","date":"2015-02-26T15:47:24.100+0000","up_votes":2,"down_votes":1,"body":"Too much butthurt on those boards","replies":[]},{"poster":"Krosan","date":"2015-02-26T15:26:31.847+0000","up_votes":2,"down_votes":1,"body":"I used to occasionally frequent the old Champion Discussion forums and was a regular on the Item Discussion forums.\n\nYes, the Gameplay and Balance board is basically cancer at this point. CD was a pit of memes and ID got contentious at times, but now...\n\nIt doesn't *help* that some of the recent changes (especially for jungle mains) are resulting in an all-time low of confidence in the balance team; I realize they're trying to zero in on a proper fix, but the fact that Lee and Jarvan have gone unchecked for so long is disgusting.","replies":[]},{"poster":"Splininka","date":"2015-02-26T19:06:12.110+0000","up_votes":1,"down_votes":0,"body":"I'm having a hard time finding good threads too. I understand why people are upset about certain things, but it seems like they are overreacting to just about everything. There doesn't seem to be much room for discussion since people are taking the public outcry as fact. Not saying everybody is wrong, but after seeing what happened with the Ahri changes, maybe public outcry isn't the best predictor of reality.","replies":[]},{"poster":"Mahautsukai","date":"2015-02-26T18:06:25.387+0000","up_votes":1,"down_votes":0,"body":"It does not appear that you are wrong. There is almost nothing of value there under the mass flooding of regurgitated vitriol. Wouldn't be so bad if they just inflated one thread per topic instead of 20+ threads per whine.","replies":[]}]}