{"poster":"DonWLory","date":"2015-03-23T16:12:35.026+0000","title":"buff twitch","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao evocatori, sono qui oggi per scrivervi e discutere su un champion che io uso come main e che io amo molto: {{champion:29}} . Premetto che non è la prima volta che scrivo un forum su twitch, ma da quando hanno cambiato la tipologia di forum (l'aggiornamento avvenuto tempo fa) non trovo più la fonte, e quindi intendo riscriverlo. Penso che twitch sia uno degli adc più forti di tutto League of legends, ma dalla patch 4.10 tutto è drasticamente cambiato. Ammetto anche io che un nerf a twitch ci stava tutto, perchè era semplicemente troppo forte. Aveva un escape sicuro e colla passiva aveva dei danni impressionanti. Ma nerfarlo da 3 secondi a 6? siamo pazzi? in 6 secondi twitch non fa nulla, non scappa neanche se paga il team nemico. Piccolo esempio. Rengar ha la ulti simile alla Q di twitch, ma se viene colpito diventa invisibile dopo 4 secondi, MICA 6! eppure rengar è un assassino, e sopravvive molto di più che twitch (considerando il fatto che rengar può curarsi mentre twitch non può). I danni sono abbastanza bassi ora, però penso che non sia troppo un problema, anche perchè dopo del lv 6 twitch ha dei danni considerevoli colla E ed una ulti SPACCACULI. Quindi io qui penso che sarebbe giusto buffare la Q di twitch, dando anche al topone di LoL la possibilità di scappare, considerando che bastano delle pink piazzate bene od una Red piazzata bene che lo smascheri e lo uccidi facilmente. in conclusione quindi, io propongo 2 buff che potrebbero aiutare twitch ad essere un ADC spaccaculi (come vayne, graves e cait) che a parer mio più che buff mi sembrano giustizie.\r\n\r\n1) **Aumento dei danni di base**\r\n\r\nnel nerf della patch 4.10 hanno nerfato il danno iniziale del colpo base. semplicemente ora è debole, molto debole in early, non fa più niente. penso che rimettere i danni come prima non cambierebbe di molto le sue prestazioni. Ma sarebbe comunque un vantaggio per chi lo utilizza. Un'altra soluzione sarebbe quella di velocizzare la velocità di attacco base, dandogli più chance di mettere le stacks per la E.\r\n\r\n2) **buff della Q**\r\n\r\nsempre nella patch 4.10 la rito ha cambiato timing per la Q. da 1.25 secondi ad 1.5 se non si veniva attaccati, mentre sotto attacco da 3 secondi a 6. Sostengo anche io fermamente che 3 secondi erano troppo pochi, ma raddoppiare il timing di attivazione della Q in 6 secondi sotto attacco è semplicemente eccessivo. TROPPO ECCESSIVO. 4 secondi sarebbe perfetto. Quindi io proporrei questo cambio a twitch da 6 secondi a 4, che comunque per twitch che è sensibilissimo agli attacchi di qualsiasi champion perirebbe. Sarebbe useful per me che so come muovermi con twitch. e non ditemi che sarebbe troppo forte dato che tristana ha un escape della madonna.. ed è moooolto più forte della Q di twitch. Quindi per favore, se dovete scrivere delle contestazioni con un minimo di cervello ok, sennò per favore non fatemi perdere tempo.\r\n\r\nconclusioni?\r\n\r\npenso che twitch possa tornare ad essere un forte adc con un semplice buff della Q. il punto 1) può anche essere ignorato, ma il punto 2) è il fondamentale. Dato che in early oramai è una pippa (giustamente) ci sta almeno una Q semi-escape per sopravvivere. Voi cosa ne pensate? fatemelo sapere!\r\n\r\nmi scuso per eventuali errori grammaticali e logici, ho scritto tutto sul colpo.{{champion:6}} \r\n\r\n(RITO PLS LEGGI TUTTO CIO' E BUFFAMELO D:)","replies":[{"poster":"K4idor","date":"2015-03-23T17:38:27.480+0000","up_votes":2,"down_votes":0,"body":"La q di twitch è un problema enorme, anche io come te amo alla follia twitch, ma lavorare su questa skill non è facile. 6 secondi sono troppi in qualunque caso. Io metterei il tempo della skill in modo che cresca nella partita, sempre 1,5 secondi, ma sotto attacco 6/5/4 (per farlo decrescere meglio 6/5,5/5/4,5/4), e viceversa il tempo diminuire il tempo di invisibilità, 8 secondi magari sono troppi. Così magari per tenerlo bilanciato. Aumentare le stats di base non mi piacerebbe, mi piace l'evoluzione da early a late di twitch, al massimo si potrebbe dare un piccolo buff alla R, mettendo un lieve aumento anche della velocità d'attacco, o lo 0,2 di danno fisico in +","replies":[{"poster":"DonWLory","date":"2015-03-24T06:30:02.379+0000","up_votes":1,"down_votes":0,"body":"Si potrebbe andare decisamente meglio di adesso. Io penso comunque che 8 secondi non siano neanche un'infinitá, è fattibile! Comunque la tua idea sarebbe perfetta","replies":[]}]},{"poster":"Frattaglia","date":"2015-03-23T16:28:59.672+0000","up_votes":1,"down_votes":0,"body":"In effetti ha il 43% di win rate, che è un po' bassino...","replies":[]}]}