{"poster":"vondarck","date":"2019-12-12T08:26:15.860+0000","title":"Sett","subforum":"Campioni e gameplay","embed":{"description":"[STATUS: PBE is currently . Big update tonight, hold tight!] The PBE has been updated! As we kick the 10.1 PBE cycle, tonight's enormous patch includes our newest champion Sett and twelve new skins for themes including Mecha Kingdoms, Dragonslayer, and Guardian of the Sands. We also have new chroma, summoner icons, emotes, and more.","url":"http://www.surrenderat20.net/2019/12/1211-pbe-update-new-champion-sett.html?m=1","image":"https://1.bp.blogspot.com/-ki-yLrIEKWg/XfGlq36B94I/AAAAAAABc4Q/7Y2K84HeaQY_Tq5iu2zOXJeywU3GyL8cwCLcBGAsYHQ/w1200-h630-p-k-no-nu/fgsyjgsdh.jpg"},"up_votes":1,"down_votes":0,"body":"Stats:\r\nBase HP: 600\r\nHP Per Level: 93\r\nHP5: 9.25 + 0.15 per level\r\nBase MR: 32\r\nMR Per Level: 1.25\r\nBase AD: 60\r\nAD Per Level: 4\r\nBase Armor: 37\r\nArmor Per Level: 4\r\nBase Move Speed: 340\r\nAttack Range: 125\r\nAttack Speed Per Level: 1.75\r\n\r\nAbilities:\r\n\r\nPit Grit (Passive)\r\nHeavy Hands: Sett's basic attacks alternate between a Left Punch and a Right Punch, always opening with a Left Punch. Attack speed increases the speed of both punches.\r\nLeft Punches deal normal damage\r\nRight Punches come out faster and deal 5-90 (+15% tAD) bonus damage.\r\nHeart of the Half-Beast: Sett gains  [0.25 at lv 1/ 0.50 at lv 6 / 1 at lv 11 / 2 at lv 16] additional health regeneration for each 5% missing health. \r\nSett will reset back to a Left Punch if he does not do a Right Punch within 2 seconds of doing a Left Punch. The attack speed of a Left Punch is Sett's regular attack speed, and the attack speed of a Right Punch is 8 times the attack speed of Left Punch.\r\n Right punch base damage is 5 per level, maxing at 90 at level 18\r\n\r\n\r\nKnuckle Down (Q)\r\nCooldown: 9/8/7/6/5\r\nCost: [None]\r\nSett itches for a fight, gaining 30% movement speed for 1.5 seconds while moving towards enemy champions. \r\nSett's next two basic attacks deal 10/20/30/40/50 bonus physical damage, plus 1/2/3/4/5% (+[1% of total AD]%) of the target's maximum health.\r\n\r\n\r\nHaymaker (W)\r\nCooldown: 16/14/12/10/8\r\nCost: [None] \r\nPassive: Sett stores 100% of damage taken as Grit , to a cap of X (50% of Sett's max health). Grit decays quickly 4 seconds after the damage was taken. \r\nActive: Sett winds up a giant punch in a direction, expending all Grit to deal 60/85/110/135/160 (+25% (+[10% bAD]%) of expended Grit) as true damage to all enemies in the center line. Enemies not in the center line take physical damage instead. \r\nSett also gains a rapidly decaying shield equal to Grit expended for 2 seconds\r\n\r\n\r\n\r\nFacebreaker (E)\r\nCooldown: 16/14.5/13/11.5/10\r\nCost: [None] \r\nSett smashes enemies on either side of him into each other, dealing 50/80/110/140/170 (+60% tAD) physical damage and slowing them by 50% for 0.5 seconds. If Sett grabbed at least one enemy on each side, all enemies are stunned for 1 second.\r\n\r\n\r\n\r\nThe Show Stopper (R)\r\nCooldown: 120/100/80\r\nCost: [None] \r\nSett grabs an enemy champion, carries them forward, then slams them into the ground. All enemies near the impact take 200/300/400 (+100% bAD) (+40/50/60% of the grabbed enemy's bonus health) physical damage and are slowed by 99% for 1.5 seconds. Enemies take less damage the further they are from where Sett lands\r\n\r\n\r\nÈ un jujjy che fa MMA\r\n\r\nLa.riot avrà il mio deretano a sto giro","replies":[{"poster":"mangialavandini","date":"2019-12-12T09:33:15.100+0000","up_votes":1,"down_votes":2,"body":"> Sett\n\nOtt\n\n\nParlando del champ a me personalmente non mi piace, mi sembra una rework di {{champion:254}} ha le stesse abilità ma messe in ordine diverso e con funzionamento un pelo differente, ma un pelo di uno gnomo pelato senza possibilità di ricrescita sin dalla nascita.","replies":[]}]}