{"poster":"vondarck","date":"2018-07-05T13:05:55.335+0000","title":"Aggiornamento gameplay 4 luglio","subforum":"Campioni e gameplay","up_votes":3,"down_votes":0,"body":"https://boards.na.leagueoflegends.com/en/c/developer-corner/EOVcvy54-quick-gameplay-thoughts-july-4\n\nDato che non sono un drago della scrittura vi linko direttamente il post in inglese\n\nLe modifiche proposte da questo therd in capo sono poche per&ograve; saltano all occhio 2 commenti:\n\n-situazione Aatrox\nIl champ attualmente &egrave; sbilanciatissimo, non parlo di forte o debole obbiettivamente, &egrave; un lain bully molto frustrante.\nSu reddit degli aatrox main risulta un 65% w rate i pirimi 20 minuti per poi piombare nel baratro del 45% man mano che la partita avanza\n\nI danni della Q saranno da rivedere (forse e dico forse, avere uno scailing triplo sulla 3th Q &egrave; un danno eccessivo)\n\nIn oltre la passiva e forte solo in fase di linea, non scala con l&#039;andare dei livelli quindi la perdi e la ulti di aatrox &egrave; forte solo per daivare e non in team fight\n\n-zak e il conqueror\n\nLe due cose sono correlate dal seguente filo logico: uno zak main che &egrave; preoccupato per le preatazioni del suo champ e suggerisce modifiche\nLa risposta di meddler &egrave; che probabilmente sar&agrave; nerferanno il conqueror (anche la passiva ie una volta che sistemeranno i crit carry!!?!?!)\n\nSituazione BC/trinity\nUltimamente troppi champ stanno preferendo la trinity rispetto alla BC, anche champ \"al limite dello storico\" come gare, darius, fiora, wukong ecc.. Si sta discutendo se e come farci qualcosa \n\nA voi la palla, che ne pensate?","replies":[{"poster":"Vileblood Pyke","date":"2018-07-05T15:14:14.849+0000","up_votes":2,"down_votes":0,"body":"Probabilmente aggiusteranno le statistiche di Aatrox nerfando un po' l'early e buffando il late...","replies":[{"poster":"vondarck","date":"2018-07-05T16:55:35.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wraith Lord,realm=EUW,application-id=cAOZwaUi,discussion-id=vqw94tnA,comment-id=0001,timestamp=2018-07-05T15:14:14.849+0000)\n>\n> Probabilmente aggiusteranno le statistiche di Aatrox nerfando un po&#x27; l&#x27;early e buffando il late...\n\nSi, va bene bully ma da 65% al min 20 e 45% al min 30 mi sembra esagerato lol","replies":[]}]},{"poster":"DJBlackVoice","date":"2018-07-05T19:48:06.476+0000","up_votes":1,"down_votes":2,"body":"Il conqueror va rimosso,così come il true dmg sulla IE. Il true dmg era riservato a pochissimi personaggi un tempo, ora che lo hanno tutti chi non ha champ che non workano col conqueror è costretto a soccombere solo in fatto di danni.\n\nPer non parlare della duskblade, puoi essere 0/5, ma se arrivi alla duskblade basta una combo per oneshottare. Lo trovo abbastanza ridicolo.\n\nInoltre i personaggi giocabili, a seguito di questi due oggetti, sono 4 in croce. Il resto può marcire nell'oblivion sembra (ex: ashe,corki,skarner ecc)","replies":[{"poster":"vondarck","date":"2018-07-06T06:15:33.794+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DJBlackVoice,realm=EUW,application-id=cAOZwaUi,discussion-id=vqw94tnA,comment-id=0002,timestamp=2018-07-05T19:48:06.476+0000)\n>\n> Il conqueror va rimosso,così come il true dmg sulla IE. Il true dmg era riservato a pochissimi personaggi un tempo, ora che lo hanno tutti chi non ha champ che non workano col conqueror è costretto a soccombere solo in fatto di danni.\n> \n> Per non parlare della duskblade, puoi essere 0/5, ma se arrivi alla duskblade basta una combo per oneshottare. Lo trovo abbastanza ridicolo.\n> \n> Inoltre i personaggi giocabili, a seguito di questi due oggetti, sono 4 in croce. Il resto può marcire nell&#x27;oblivion sembra (ex: ashe,corki,skarner ecc)\n\nProbabilmente per alcune cose è eccessivo il conqueror, però se ci pensi se si sistemasse la BC con Arm pen total come il memento mori/saluti di lord dominic con un 25% total armor (5%per stack) il conqueror non sarebbe più necessario.\nL'IE a mio avviso non è sbagliato e ti spiego perché\n\nAdesso non si arriva a 100% di crit a meno che non prendi 2 item da critico, nel caso non hai molto AD\nPerò si potrebbe passare da 15-->10","replies":[]}]},{"poster":"MisogiKumagawa","date":"2018-07-05T14:02:19.501+0000","up_votes":1,"down_votes":0,"body":"Non ho capito nulla da cio che hai scritto tu","replies":[{"poster":"vondarck","date":"2018-07-05T14:17:02.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SinOfLustGowther,realm=EUW,application-id=cAOZwaUi,discussion-id=vqw94tnA,comment-id=0000,timestamp=2018-07-05T14:02:19.501+0000)\n>\n> Non ho capito nulla da cio che hai scritto tu\n\nIn sintesi:\n-Aatrox eccessivamente forte in linea, molto debole in team fight, bisogna ribilanciare i valori\n\n-I tank non esistono attualmente perché c'è il conqueror in top che li bulla in fase di linea\n\n-La mannaia oscura è sempre meno pikkata rispetto alla trinity, servirebbe un buff alla BC","replies":[]}]}]}