{"poster":"vondarck","date":"2017-01-30T07:37:27.332+0000","title":"bug grafico su ski di fiddlestick dolcetto o scerzetto","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"salve\r\n\r\nHo notato che la skin &quot;dolcetto o scherzetto&quot; dopo qualche secondo in cui non riceve comandi si &quot;blocca&quot;, a livello di gameplay non comporta nessuna variazione di meccanica base.\r\nIl bug si presenta in ogni caso, superato un certo timing di inattivit&agrave; (una 15 di secondi circa)\r\nLa prima volta si era verificato a inizio game dopo avergli fatto fare un lungo balletto, poi ero andato in bagno durate il game vs ia e lo ho trovato nello stesso stato di &quot;blocco&quot; anche se non gli avevo impartito ordini particolari.\r\n\r\ngrazie","replies":[{"poster":"Chroniicles","date":"2017-01-30T09:51:44.032+0000","up_votes":1,"down_votes":0,"body":"Confermo, è la passiva di fiddle xD","replies":[{"poster":"vondarck","date":"2017-01-30T11:03:30.538+0000","up_votes":1,"down_votes":0,"body":"ma la passiva non si attiva dopo \"3 secondi?\"\n\nio parlo di un timing nettamente superiore (poi non maino il champ quindi può essere che è effettivamente come dite)","replies":[{"poster":"Chroniicles","date":"2017-01-30T14:13:59.869+0000","up_votes":1,"down_votes":0,"body":"> Standing still or channeling for 1.5 seconds grants Fiddlesticks 25 / 30 / 35 / 40% bonus movement speed, that lasts for 1.5 seconds once he starts moving. Being immobilized will not trigger Dread, and will reset the timer.\n> \n> After 5 seconds of not moving, Fiddlesticks will stand completely still and become a scarecrow.\n\nsono piuttosto sicuro non ci siano problemi (da come descrivi la situazione) però per toglierti ogni dubbio guarda nel replay e in caso passacelo postando lo spezzone su YouTube o simili ;)","replies":[{"poster":"vondarck","date":"2017-01-30T14:39:18.918+0000","up_votes":1,"down_votes":0,"body":"ok ci do un occhio, è che non mi era mai capitato (ho giochicchiato + che altro il fiddlestik pre rework)\n\nci ero rimasto male XD","replies":[{"poster":"Chroniicles","date":"2017-01-30T14:40:43.245+0000","up_votes":1,"down_votes":0,"body":"tranquillo, se non sei convinto facci vedere il replay e vediamo se effettivamente ci sia qualcosa di anomalo","replies":[{"poster":"vondarck","date":"2017-01-31T09:22:54.787+0000","up_votes":1,"down_votes":0,"body":"purtroppo nel mio pc non ho modi fare video al momento (è un t300)\n\nprovo però almeno a verificare è una cosa del champ su qualche video di qualcuno","replies":[{"poster":"Chroniicles","date":"2017-01-31T11:01:33.624+0000","up_votes":1,"down_votes":0,"body":"con la funziona integrata nel client è fattibile anche con un tostapane :P però se non usi il client nuovo no","replies":[{"poster":"vondarck","date":"2017-01-31T12:38:37.807+0000","up_votes":1,"down_votes":0,"body":"U_U\" ho quello vecchio","replies":[]}]}]}]}]}]}]}]},{"poster":"Asvalon","date":"2017-01-30T08:11:31.493+0000","up_votes":1,"down_votes":0,"body":"Non è la skin...è la passiva di Fiddle! Dopo pochi secondi in cui sta fermo si blocca graficamente e quando gli impartisci un comando di movimento aumenta la sua velocità di movimento.","replies":[]}]}