{"poster":"ValenGamer22","date":"2017-01-21T03:33:38.552+0000","title":"Acerca del RP (Riot Points)","subforum":"Problemas Técnicos","up_votes":5,"down_votes":1,"body":"muy buenas noches! les queria decir una cosa que me ocurrio en este mes, yo soy menor de edad (15 a&ntilde;os). vivo en argentina y juego al Lol. le pregunte a mi padre si me compraba rp y me dijo que si pero en ningun momento riot nos aviso de que despues lo que pagas se convierte en dolares, page 3 veces 90$ en el mes, hoy a la noche hace unas horas le vino a mi papa lo que tiene que pagar en la tarjeta en dolares y no me parece bien porque el dolar esta constantemente en cambios de cuanto esta asi que le tuve que explicar a mi papa lo que paso y nada, lo que me da rabia es que nunca dijeron en ninguna pagina que se convierte en dolar, lo que vos compras en pesos!","replies":[{"poster":"vaVav","date":"2017-01-21T03:36:05.935+0000","up_votes":2,"down_votes":0,"body":"Mhh, según lo que tengo entendido, a pesar de que aparezca en dolares no afecta la cantidad de dinero que tienes que pagar. Recuerda que Riot Games es una empresa estadounidense.","replies":[]},{"poster":"TheAmazingSpidey","date":"2017-01-21T05:19:34.787+0000","up_votes":1,"down_votes":0,"body":"Y ojo que el próximo mes los RP suben y todo será más caro Incluyendo algunas skins ","replies":[{"poster":"Ranpage","date":"2017-01-21T07:04:02.078+0000","up_votes":1,"down_votes":1,"body":"no cuestan mas rp las skin y lo que cuesta el rp baja y subi en chile por ejemplo subi en argentina en una metodo de pago baja y en otro sube ahora va ser mas igual entre todos los paises","replies":[{"poster":"Døkkálfr","date":"2017-01-21T18:14:28.729+0000","up_votes":1,"down_votes":0,"body":"Las skin sí van a costar más.. búscalo, ta too en yutu :v","replies":[]}]}]},{"poster":"GatóMonstruo","date":"2017-01-21T10:55:52.529+0000","up_votes":1,"down_votes":0,"body":"¡Hola Valen!\n\nRiot  Games es una empresa estadounidense con sede en Santiago de Chile, es por eso que las transacciones se convierten en dólares. Sin embargo, el banco mismo debería hacer el cambio de U$D a Peso Argentino. \n\nCuando reviso la información de la tarjeta a través de Internet las compras de Riot generalmente figuran en dólares, pero, cuando llega el resumen mensual el monto figura en pesos. Como podrás ver ahí.\n\nhttps://i.gyazo.com/701c35a91d46b7495f1e187427803af6.png\n\nBásicamente, los abonos siempre deberían ser en moneda local, en caso de que se te cobre en otra moneda es una intervención de tu banco y no de Riot :)","replies":[]},{"poster":"Ranpage","date":"2017-01-21T07:05:41.837+0000","up_votes":1,"down_votes":0,"body":"Creo que lo de convertirse en dolares no sale en riot games y todo eso al comprar rp pero creo que sale en el metodo de pago que usaste porque ejemplo creo que en XXX se convierte en dolares y sale hay que se convierte en dolares CREO","replies":[]},{"poster":"Lord Torokoko","date":"2017-01-21T03:46:05.971+0000","up_votes":1,"down_votes":0,"body":"Mmh, según lo que entiendo estas pagando con PayPal o VISA/MasterCard. Siempre que he comprado con esos metodos todo lo ha convertido a Dólares, aun que nunca he comprado RP.\n\nPodrias intentar comprado con tarjetas locales :)","replies":[]}]}