{"poster":"BuffMarksman21","date":"2016-11-28T23:50:30.246+0000","title":"Smurfs","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola, quer&iacute;a abrir un debate, qu&eacute; piensan de las cuentas smurfs? Gente que es diamante y se pone a jugar en plata/oro, ponganme en los comentarios que piensan y dejo una encuesta.","replies":[{"poster":"Shijim4 de Virgo","date":"2016-11-29T00:21:12.330+0000","up_votes":1,"down_votes":1,"body":"Yo creo que estan mal, si bien no esta mal tener varias cuentas, pero deben subirla lo mas que puedan asi los emparejamientos serian mas justos, algunos son diamantes y las cuentas las tienen en plata nomas para ayudar a sus amigos, eloboost legal -.-  ademas que se aprovechan de quienes estan empezando sin darle siquiera 1 chance, yo tengo 2 smurf, ambas en platino 3 y 2, la subi rapido para no perjudicar a otros todo eso en ranked claro, en normales (si es que tambien te emparejan con gente del mismo elo o mmr) sean mas parejas tambien.","replies":[{"poster":"KennyZambada","date":"2016-11-29T00:35:50.942+0000","up_votes":3,"down_votes":0,"body":"El MMR de clasificatorias  y normales son diferentes.","replies":[{"poster":"TTryHard","date":"2016-11-29T02:12:49.575+0000","up_votes":1,"down_votes":1,"body":"si? como se mide el mmr de normales? hay mmr de normales ? porque ami me dijeron que no :v","replies":[{"poster":"HyenaLoL","date":"2016-11-29T08:07:55.575+0000","up_votes":2,"down_votes":0,"body":"Tiene el mismo sistena de matchmakig con mmr\nla unica diferencia es que no te muestra una liga ni nada","replies":[]},{"poster":"KennyZambada","date":"2016-11-29T07:57:20.573+0000","up_votes":1,"down_votes":0,"body":"a mi me dijeron que si hay :p, Debe ser de la misma forma,no?Ganar mas y perder menos pero la diferencia de emparejamientos debe ser mayor.","replies":[]}]}]}]},{"poster":"9081913DEL1","date":"2016-11-29T10:20:07.528+0000","up_votes":1,"down_votes":0,"body":"El smurf es un jugador con otra cuenta. \nSi la sacan sigue estando el mismo jugador en su cuenta normal.\nHay smurf bronce que tienen smurf en bronce.\nSi me preguntas si me parece bien o mal no hay una respuesta correcta. Por que no es como vos decis.\n\nYo no tengo cuentas en otras ligas de forma facil, lleva tiempo subir una cuenta y para que quede ahi tenes que perder, porque tampoco es que te podes ir afk o perder a proposito - Te banean si haces eso- . Por inactividad no bajas.\nCasi todos los smurf estan con sus smurfs en su elo o similares. No es tan facil para alguien de diamante para arriba quedar plata por ejemplo. Aunque les parezca tonto.\n\nSaludos.","replies":[]},{"poster":"Brightram","date":"2016-11-29T00:19:25.254+0000","up_votes":1,"down_votes":0,"body":"Están bien, una puede tener las cuentas que quiera.\nEn la season pasada( bueno, en la 5) arranqué con la smurf en bronce y solo estuve unas 6 partidas, después pase por plata unos 15 games creo y en oro unos 22 aprox. Son pocas partidas y no creo que sea malo, tampoco creo \"haber arruinado la experiencia de juego\" de nadie como muchos dicen  sobre los smurf porque como dije, fueron pocas partidas.","replies":[]},{"poster":"m4urj","date":"2016-11-29T00:18:32.595+0000","up_votes":1,"down_votes":0,"body":"Es completamente legal, siempre y cuando la cuenta sea de ellos.","replies":[]}]}