{"poster":"Gonzaasabeee","date":"2018-07-02T08:14:36.127+0000","title":"URF sin Remake, por qué?","subforum":"Jugabilidad, balance y narrativa","up_votes":7,"down_votes":1,"body":"No entiendo como justifican no tener habilitada la opci&oacute;n remake y penalizaciones por inactividad en URF si s&iacute; los tenemos en modo Normal... \n\n{{sticker:zombie-brand-clap}} {{sticker:zombie-brand-facepalm}}\n\nY de paso pregunto, piensan agregarla?","replies":[{"poster":"Kenetto","date":"2018-07-02T09:07:20.385+0000","up_votes":9,"down_votes":0,"body":"Además de que te toque contra un team de champs rotos tener un afk la de un toque extra de emoción.","replies":[{"poster":"Im Ur Supp","date":"2018-07-02T12:48:17.042+0000","up_votes":1,"down_votes":0,"body":"JAJAJ posta","replies":[{"poster":"EsPawnJota","date":"2018-07-02T22:55:55.032+0000","up_votes":1,"down_votes":0,"body":"Me toco ser Maokai hoy. Con un item y nivel 9 saque un cuadra solo. Dan mucho asco algunos campeones en urf.","replies":[{"poster":"Im Ur Supp","date":"2018-07-03T13:09:05.152+0000","up_votes":1,"down_votes":0,"body":"yo desde que empezó urf me han salido puros maestros yi en contra e.e","replies":[]}]}]}]},{"poster":"Waninoko Main","date":"2018-07-02T12:50:49.978+0000","up_votes":3,"down_votes":0,"body":"Mas bien siendo URF debería venir con el surrender en todo momento y listo. No hay remake pero una rendición te daría lo mismo. Simple","replies":[]},{"poster":"Yitán","date":"2018-07-02T08:29:25.770+0000","up_votes":3,"down_votes":0,"body":"yo creo que porque esta increiblemente lleno de gente que se va afk porque el otro team tiene x campeon, hasta tiene mas afk que las arams","replies":[{"poster":"Waninoko Main","date":"2018-07-02T12:49:31.200+0000","up_votes":2,"down_votes":0,"body":"pues que les prohiban jugar el modo de juego a cada persona que queda afk","replies":[{"poster":"Jeremías 17 5","date":"2018-07-02T20:05:17.197+0000","up_votes":1,"down_votes":0,"body":"O, la manera mas razonable, volver los bans al URF o balancear el modo de juego... Es increíble no se cuantos años del primer URF aun no hayan solucionado cosas como que la Q de morgana dure mas del CD que tiene o tener un Garen/Zed te deleteen te una manera anti fun totalmente (Modo de juego por diversión es una forma de decir, solo te diviertes si lo roto lo tenes vos o alguno de tu team, como enfrente tengas a Garen/Zed/Yi/Morgana/Rakan, etc no te vas a divertir nada).","replies":[{"poster":"Waninoko Main","date":"2018-07-03T08:52:03.425+0000","up_votes":1,"down_votes":0,"body":"Yo creo que no hay que gastar energías en balancear un modo temporal cuando tienen tanto desbalance de 58% en el modo mas importante para ellos.\nNo creo que Garen, Yi, Rakan esten tan rotos como dices.","replies":[]}]}]},{"poster":"WhiteMax","date":"2018-07-03T00:03:17.899+0000","up_votes":1,"down_votes":0,"body":"Dichos jugadores se les reporta al final de la partida y leaver booster, dudo que sea por eso (aparte mientras menos gente haya mas posible el voto SI a surrender).","replies":[]},{"poster":"Gonzaasabeee","date":"2018-07-02T22:35:36.987+0000","up_votes":1,"down_votes":0,"body":"Que les metan un ban de 20 min sin jugar a los que se van afk como cuando tiras remake en una normal y listo, el que se va afk que se aburra él esperando en la cola, pero que no haga que se aburra el resto dentro de una partida.\n\nAl menos es lo que creo mas justo. :/","replies":[]}]},{"poster":"The Alex17","date":"2018-07-02T13:03:09.692+0000","up_votes":2,"down_votes":1,"body":"Creeme que si existe la penalizacion\n\nReportamos a un yasuo que se quedaba en primera torre tirandonos mierda (yo y mis 2 premades) y al segundo despues de terminar la partida nos sale como que se cumplio el reporte xDDD","replies":[]},{"poster":"Lord Parca","date":"2018-07-02T15:30:01.096+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo que ARAM, es un modo de juego random que dura menos de 15 min \"si activan Remake seria frustrante xq en cada partida lo tirarian.\" dichos de rito en el preguntas y respuestas del nuevo aram.","replies":[]},{"poster":"schiavoni","date":"2018-07-02T15:09:06.310+0000","up_votes":1,"down_votes":0,"body":"porque da igual si estas 1 vs 5,.\n\nellos no tienen un champ fuerte y vos tienes un roto ya ganas :v","replies":[]}]}