{"poster":"One Tax Man","date":"2015-05-06T16:03:11.858+0000","title":"impressioni contrastanti su skarner","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Salve a tutti.\r\n\r\nSkarner mi ba sempre incuriosito come champ ma nessuno dei miei amici me lo ha mai consigliato : da quel che mi hanno detto dopo il rework non ha pi&ugrave; il kit forte che aveva in precedenza.\r\n\r\nPoi me lo ritrovo in partita : giusto con trinity force e hextech gunblade e il resto fulltank massacrava chiunque. Stun per sempre , quanto ti ultava eri condannato e se scappavi lui ti prendeva.\r\nLa mia domanda &egrave; quindi : qualcuno potrebbe darmi opinioni / consigli su quel bell scorpioncello?\r\nE , nell&#039; eventualit&agrave; , mi consigliereste di comprarlo?\r\nGrazie a tutti in anticipo.","replies":[{"poster":"Nibbio Bianco","date":"2015-05-06T16:09:48.110+0000","up_votes":1,"down_votes":0,"body":"è un buon campione attualmente. {{item:3717}} {{item:3078}} {{item:3800}} {{item:3110}} {{item:3102}} {{item:3270}}","replies":[{"poster":"NiraBlade","date":"2015-05-06T16:57:01.866+0000","up_votes":1,"down_votes":0,"body":"Pensi sia fattibile utilizzare {{item:3710}}  ?","replies":[{"poster":"Lord Valotz","date":"2015-05-06T17:01:52.304+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=cAOZwaUi,discussion-id=4yBElE1e,comment-id=00010000,timestamp=2015-05-06T16:57:01.866+0000)\n>\n> Pensi sia fattibile utilizzare {{item:3710}}  ?\n\nSecondo me solo se hai un altro tank che ingaggi al tuo posto puoi usare la gemma viola, altrimenti perdi tanti begli Hp bonus, inoltre su questo forse sarebbe ancora meglio lo smite rosso perché riuscendo a mettere a segno più autoattacchi riesci a massimizzare i danni puri che fai, ma sono mie supposizioni, non l'ho mai giocato.","replies":[]},{"poster":"Jay Kenton","date":"2015-05-06T22:10:44.660+0000","up_votes":1,"down_votes":0,"body":"Non porta significativamente tanto danno in fight (sebbene ti renda velocissimo a farmare); viabile solo se punti a controjunglare con lo smite bianco.\n\nE se ti sei chiesto perché nessuno lo faccia lo smite bianco, un motivo c'è.","replies":[]},{"poster":"Ucr0niA","date":"2015-05-06T17:10:20.893+0000","up_votes":1,"down_votes":0,"body":"Naaa","replies":[]},{"poster":"Nibbio Bianco","date":"2015-05-06T17:00:49.729+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=cAOZwaUi,discussion-id=4yBElE1e,comment-id=00010000,timestamp=2015-05-06T16:57:01.866+0000)\n>\n> Pensi sia fattibile utilizzare {{item:3710}}  ?\n\n\nno.","replies":[]}]}]},{"poster":"Lord Valotz","date":"2015-05-06T16:57:41.661+0000","up_votes":2,"down_votes":0,"body":"Con la build suggerita da IlRisotto funziona bene, il problema che lo affligge un po' è che per usare la ulti deve correre addosso al bersaglio e non è sempre la cosa più facile. Attualmente è un pick valido, non porta l'utility di certi campioni, ma se saputo usare dice la sua ed inoltre essendo poco usato è poco conosciuto come personaggio e come kit.","replies":[]},{"poster":"White Winston","date":"2015-05-06T16:31:27.964+0000","up_votes":2,"down_votes":0,"body":"E' uno dei champ meno giocati IN ASSOLUTO al momento. Il perché sinceramente non lo so...a me sembra abbia davvero un buon kit! Ci ho giocato contro giusto oggi a pranzo...inoltre lo giocava in giungla un mio amico in match 3vs3 dove ho partecipato. Farma discretamente in giungla con la Q, rallenta, stunna e trascina per i gank (che non dovrebbero risultare troppo difficili da fare), è un tank davvero tosto (in TF è duro da buttare giù!) e in early-mid fa anche tanti danni!\n\nForse in late cala un po' e manca di utility (paragonato a gente tipo Sejuani, Amumu, Maokai)...sinceramente mi piacerebbe molto provarlo!\n\nQualcuno che lo maina (o gioca abitualmente) e può darci qualche dritta in più?","replies":[]},{"poster":"Stygian Beast","date":"2015-05-07T11:24:50.201+0000","up_votes":1,"down_votes":0,"body":"Skarner è il mio main ed è stato grazie a lui se ora sono gold (anche perchè seju è perma-bannata), è un super tank che da il suo meglio dal 6 in poi ed in particolare nei tf dove ti butti in mezzo al nemico e tiri il champ più fastidioso in mezzo al tuo team, offre tantissimi cc (passiva, e, r, oggeto da jung e poi io ci buildo sempre il guanto del gelo) che sono il suo punto di forza oltre alla velocità e al fatto che come ingager puoi tankare tantissimo danno {{champion:72}} \nal momento la mia build standard è: {{item:3709}} ,{{item:3264}} ,{{item:3025}} ,{{item:3102}} ,{{item:3071}} ,{{item:3143}}","replies":[{"poster":"One Tax Man","date":"2015-05-09T16:58:50.859+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kelevra92,realm=EUW,application-id=cAOZwaUi,discussion-id=4yBElE1e,comment-id=0008,timestamp=2015-05-07T11:24:50.201+0000)\n>\n> Skarner è il mio main ed è stato grazie a lui se ora sono gold (anche perchè seju è perma-bannata), è un super tank che da il suo meglio dal 6 in poi ed in particolare nei tf dove ti butti in mezzo al nemico e tiri il champ più fastidioso in mezzo al tuo team, offre tantissimi cc (passiva, e, r, oggeto da jung e poi io ci buildo sempre il guanto del gelo) che sono il suo punto di forza oltre alla velocità e al fatto che come ingager puoi tankare tantissimo danno {{champion:72}} \n> al momento la mia build standard è: {{item:3709}} ,{{item:3264}} ,{{item:3025}} ,{{item:3102}} ,{{item:3071}} ,{{item:3143}}\n\nDa come hai cominciato pare che intendi che sejuani sia migliore però. Oppure ho inteso male io?","replies":[{"poster":"Stygian Beast","date":"2015-05-12T14:39:21.827+0000","up_votes":1,"down_votes":0,"body":"Hai capito bene... Seju è ineguagliabile al momento come tank","replies":[]}]}]},{"poster":"Jay Kenton","date":"2015-05-06T22:09:15.918+0000","up_votes":1,"down_votes":0,"body":"È un campione incredibilmente forte secondo me; è un anti-bruiser. Solo che va capito bene come giocarlo.\n\nIo consiglio di giocare quanta più mspeed possibile tra masteries e rune...Almeno il 2% bonus. Proprio minimo 2%.\nIl resto io preferisco attack speed ma c'è chi mette anche full AD.\n\nImportante la progressione skill: Q - W - Q - E, non si ganka prima del 4 visto che può farsi tutta la jungla full vita e recallare comprandosi direttamente il BAmi (se ganki persino il Catalist).\n\nPoi si alterna placidamente Farm e gank, maxando IMPORTANTE prima Q, poi W.\n\nChiuso Cinderhulk (preferisco il blu al rosso perché mi da mspeed), scarpe (non le mobility, meglio scarpe difensive, Skarner deve muoversi un sacco in fight, usando la Q sulla frontline al fine di arrivare alla backline) e Righteous glory, ogni Skarner chiude gli item che vuole.\n\nProbabilmente la cosa migliore da chiudere è la Trinity, ma puoi anche decidere di essere un grossissimo tank con Randuin, Banshee o Warmog. Puoi anche optare per item strambissimi tipo la Wits'z End, BC o Statikk...pensa a cosa serve al tuo team...\n\nLe sue gank sono molto facili, devi solo conoscere cosa fanno i laner. La tua ulti è comunque forte anche contro gente che ha mobility; la cosa importante è che tu faccia una prima Q sui minions per prenderti slancio e poi la W per alimentarlo, se l'avversario scappa via puoi ancora prenderlo attivando il righteous se lo hai già, perché se usa tutto per fuggire tu puoi ancora usare la E a corta distanza e chiuderlo; e sei un tank quindi puoi divare facilmente e portarti via l'avversario di ulti, se il tuo laner non ha ancora usato nessuna spell invece è buona cosa ultare per ucciderlo in quei 2 secondi.\nL'importante è spammare Q su qualcosa e non missare la E o usare la R con brutto tempismo.\n\nIn fight usa la Q sui tank e passa oltre; nessun adc può duellarti se sei avanti, né possono sul serio scappare dalla combo Q + W + Righteous senza usare cooldown importanti. La Trinity porta danni ed ancora più velocità.\n\nIncanta le scapre con l'enchantment che ti sembra più opportuno: non sottovalutare distortion.\n\nSinceramente non ti serve molto altro per giocare Skarner, solo conoscere cosa fanno gli altri campioni per calcolare se devi ultare o meno.\n\nAh, il Righteous NON È la Shurelia. Va usato PRIMA della ulti, e non dopo.","replies":[]},{"poster":"Annielated","date":"2015-05-06T21:47:13.061+0000","up_votes":1,"down_votes":0,"body":"Skarner a mio avviso è MOLTO forte e divertente da usare, lo puoi fare full tank o con un po' di AS o full damage per trollare un po'.\nTi consiglio di non prenderlo se non hai altri engager nel team dato che il suo compito è fare peeling, difficilmente vedo uno skarner che riesce a prendere un carry semplicemente camminandoci addosso. Lascia ingaggiare ad altri e sfonda chiunque cerchi di arrivare alla tua back lane ;D","replies":[]},{"poster":"franz94","date":"2015-05-06T19:41:16.898+0000","up_votes":1,"down_votes":0,"body":"è un  buon champ il problema è che dovrebbe essere un champ per ingaggiare i combattimenti ma il suo ingaggio (ult) non è dei migliori(una janna o dei BUONi  alistar o tresh posso renderlo inutile o anche un Xin Zhao ), inoltre i suoi gank pre 6 sono pessimi. **PERO** molta gente non si è accorta che i cambi alla giungla lo hanno reso più forte perché i ganker pre 6(lee, vi , jarvan) sono stati nerfati e hanno la vita più difficile nella giungla, inoltre l'aggiunta del {{item:3800}}  ha migliorato di molto le sue gank  e i suoi ingaggi.\nSkarner è un champ che puoi combattere chiunque in un 1v1 pero soffre i nemici troppo mobili come lee sin o lb è benchè sia molto tankoso ci sono tank più resistenti.\nDevo dire che pero secondo me usarlo come tank peeler è molto meglio lasciando che a iniziare i fight sia qualcun altro è usare la ulti su chiunque provi ad eliminare i tuoi carry.\nIL vero motivo perchè non è usato è perchè i pro non lo usano semplice in quanto non è un champ con cui puoi carriare una partita perchè il danno di skarner in late game diminuisce e i suoi ingagge sono facili da evitare con i giusti champ.\nalcuni anche perche trovano il suo kit noioso in quanto è/era (soppratutto prima del rework) semplicemente entri nel fight e premi  rqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq...qqqqqqqqq","replies":[]},{"poster":"NiraBlade","date":"2015-05-06T16:24:37.972+0000","up_votes":1,"down_votes":0,"body":"Da quando ho visto una pentakill stra bella di skarner [https://www.youtube.com/watch?v=bi-K9P4ZKa4] \nme lo sono segnata come champion da comprare assolutamente :) mi sembra molto divertente da giocare, la ulti è fantastica e credo sia il massimo in tf, è un tank con i fiocchi (per riuscire a sopravvivere alle asce di Draven ce ne vuole)  e fa danni.","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-05-06T16:05:50.948+0000","up_votes":1,"down_votes":0,"body":"A me, non piace :)","replies":[]}]}