{"poster":"One Tax Man","date":"2015-05-29T20:43:05.584+0000","title":"meta adc?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"Salve a tutti.\r\nmi sono sempre chiesto come funzioni il meta riguardo gli adc.\r\nAlla fine non ci sono troppe differenze e pi&ugrave; o meno tutti si basano sugli aa per fare danno : quindi con che criterio si definisce un adc in meta?\r\nSe fossero possibili alcuni esempi magari porterebbe essere pi&ugrave; chiaro.\r\nGrazie a tutti in anticipo.","replies":[{"poster":"Giovarco","date":"2015-05-29T22:14:35.714+0000","up_votes":1,"down_votes":0,"body":"Diciamo che non c'è un criterio perché la maggior parte degli adc sono essenzialmente affidabili, se ben giocati. Tuttavia, alcuni di essi eccellono in certe aree:\n\nUtilità: {{champion:22}} {{champion:15}} {{champion:18}} {{champion:110}} \nPoke: {{champion:42}} {{champion:81}} {{champion:51}} {{champion:429}} {{champion:110}} \nHypercarry: {{champion:119}} {{champion:222}} {{champion:96}} {{champion:21}} {{champion:29}} {{champion:67}} \nBurst: {{champion:104}} \nNella media: {{champion:236}} \n\nPotresti scegliere un adc in base al support, piuttosto.","replies":[{"poster":"kirchhoff","date":"2015-05-29T22:31:10.305+0000","up_votes":1,"down_votes":0,"body":"Metterei {{champion:429}} tra gli utilità, {{champion:119}} in burst e {{champion:21}} non è un hypercarry.","replies":[{"poster":"Giovarco","date":"2015-05-30T17:52:58.874+0000","up_votes":1,"down_votes":1,"body":"{{champion:429}} la considero poke per la sua passiva.\n{{champion:119}} è l'ADC che richiede più abilità e che snowballa più di tutti, ma solo se usato bene. Per me, comunque, non ha burst perché il suo dps e danno vanno a paripasso.\n{{champion:21}}: ma l'hai vista in late game? E' oscena. Più fare 1v1 con chiunque in late game, anche contro {{champion:238}}. L'ho visto succedere tante volte.","replies":[{"poster":"omeomorfismo","date":"2015-05-30T18:09:44.651+0000","up_votes":3,"down_votes":0,"body":"in che modo un saltello sarebbe poke? la sua passiva è da kiting, quindi al massimo potrebbe essere considerata splitpusher/tf\n\nmf è un adc da tf in composizioni aoe & vantaggio in lane (la versione burst di caytlin per intenderci) solo che nel league of free dash ed i nerf vari per la fase di lane è scomparsa :| tra l'altro il suo picco lo ha in midgame, non late, non penso che ci siano champ che possono tenergli testa, forse corky\n\ndraven ha un dps legato al riprendere le ascie, cosa difficile/impossibile in tf. per questo è semplicemente un adc da burst\n\npoi tristana è ancora un hyper carry più che altro per lo scaling del range, che gli permette di fare più dps. ovvio che con tutto l'auto peeling che ha il dps \"numerico\" è minore rispetto a kog e jinx\n\ntra l'altro nei burst ci si potrebbe piazzare comodamente il ratto, considerando le build con la yomuu","replies":[]}]},{"poster":"Ringiel","date":"2015-05-29T23:55:39.302+0000","up_votes":2,"down_votes":0,"body":"{{champion:18}} è un hypercarry ... non capisco come posso essere in utilità visto che l'unico CC è lo slow sulla W\nmentre per {{champion:21}} avrei creato una sottocategoria solo per lei: sotto la media","replies":[{"poster":"Giovarco","date":"2015-05-30T17:54:24.081+0000","up_votes":1,"down_votes":2,"body":"{{champion:18}} non è più un hypercarry come prima del rework. Adesso è un adc da siege e butta giù le torri in un secondo, ecco perché ha utilità, senza contare che ha mobilità e know-back.\n{{champion:21}} sarebbe migliorabile, ma è giocabile comunque. Ho visto tanti stompare con lei.","replies":[{"poster":"Ringiel","date":"2015-05-30T18:42:20.396+0000","up_votes":2,"down_votes":0,"body":"tutti i champ sono giocabili ... {{champion:21}}  ha uno skill set vecchissimo completamente da rifare (un po come la vecchia tristana o twitch)basta vedere la Q che non da priorità ai champ .... {{champion:18}} invece è stata nerfata più che altro prima del rework,per questo adesso ogni 2 patch viene buffata ,ma ciò non vuol dire che non sia rimasta un hypercarry;\n\n> [{quoted}](name=Giovarco,realm=EUW,application-id=cAOZwaUi,discussion-id=Xy8cZEyl,comment-id=000100000001,timestamp=2015-05-30T17:52:58.874+0000)\n>\n> {{champion:429}} la considero poke per la sua passiva.\n> {{champion:119}} è l'ADC che richiede più abilità e che snowballa più di tutti, ma solo se usato bene. Per me, comunque, non ha burst perché il suo dps e danno vanno a paripasso.\n> {{champion:21}}: ma l'hai vista in late game? E' oscena. Più fare 1v1 con chiunque in late game, anche contro {{champion:238}}. L'ho visto succedere tante volte.\n\n{{champion:429}} il poke si fa dalla distanza ... l'unico poke che ha è la Q ma non la spamma di certo per infastidire il nemico\n{{champion:119}} l'adc che richiede abilità? e {{champion:96}} {{champion:67}} {{champion:429}} dove li mettiamo...\ncmq draven probabilmente è l'adc con più burst ( se consideriamo il cd dell'ulti di graves ), con 2 Q attive in late bishotta l'adc nemico, se questo non è burst ...\n{{champion:21}} aaah gli {{champion:238}} scarsi .... MF contro ZED è un easy kill,non ha nessun escape per scappare da lui ...","replies":[{"poster":"Giovarco","date":"2015-05-31T15:06:43.632+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=cAOZwaUi,discussion-id=Xy8cZEyl,comment-id=00010000000000010000,timestamp=2015-05-30T18:42:20.396+0000)\n>\n> tutti i champ sono giocabili ... {{champion:21}}  ha uno skill set vecchissimo completamente da rifare (un po come la vecchia tristana o twitch)basta vedere la Q che non da priorità ai champ .... {{champion:18}}\n\nLa Q da priorità ai campioni se hanno stack di W e comunque i suo kit va benissimo così com'è. Se proprio vogliamo essere pignoli, bisogna solo dare una sistematina qui e li per migliorare il funzionamento delle meccaniche. La Riot non ha intenzione di dare una rielaborazione a MF, tanto che giusto ieri è stato confermato per lei un VU. Avessero voluto, avrebbe potuto reworkarla nel frattempo, ma non vogliono farlo perché evidentemente gli sta bene così. Questo non significa che non abbia problemi.\n \n> {{champion:429}} il poke si fa dalla distanza ... l'unico poke che ha è la Q ma non la spamma di certo per infastidire il nemico\n\nQuello è più harass che poke, se sai cosa intendo. Il fatto di poter stare lontano da qualsiasi melee autoattaccando la rende già un campione da poke dal mio punto di vista. Puoi non essere d'accordo.\n\n> {{champion:119}} l'adc che richiede abilità? e {{champion:96}} {{champion:67}} {{champion:429}} dove li mettiamo...\n> cmq draven probabilmente è l'adc con più burst ( se consideriamo il cd dell'ulti di graves ), con 2 Q attive in late bishotta l'adc nemico, se questo non è burst ...\n\nTutti i tiratori richiedono abilità, ma Draven ne richiede di più di quelli che hai citato, a parer mio. Draven ha alti danni con alto dps, il che fa pensare che abbia burst, ma non è così. Chiunque ti possa 100-0 in meno di un secondo hanno burst, tipo Talon, ma Draven almeno ha bisogno di almeno 1.5/2 secondo per finire il lavoro, supponendo che prenda le asce ovviamente.  Comunque queste sono sottigliezze su cui non vale la pena discutere\n\n> {{champion:21}} aaah gli {{champion:238}} scarsi .... MF contro ZED è un easy kill,non ha nessun escape per scappare da lui ...\n\nNon ha bisogno di scappare. L'ho visto fare 2+ volte, quindi sono convinto di ciò che dico, però dalla tua reazione sicuramente non hai mai visto una scena simile.","replies":[]}]}]},{"poster":"kirchhoff","date":"2015-05-30T00:44:38.768+0000","up_votes":1,"down_votes":0,"body":"ed il knockback","replies":[{"poster":"Ediwir","date":"2015-05-30T03:34:21.439+0000","up_votes":1,"down_votes":0,"body":"E demolisce le torri come pochi.","replies":[]}]}]}]}]},{"poster":"Fappelion Dong","date":"2015-05-29T20:47:50.339+0000","up_votes":2,"down_votes":0,"body":"In teoria l'adc andrebbe scelto per rendere al meglio col support e riuscire ad affrontare la coppia nemica.\n\nNella pratica viene scelta mobilità > ipercarry > vincere la lane e snowballare/inserirsi in una comp.\n\nInsomma nel primo caso prendo lucian a priori perchè scatta, nel secondo vayne per i danni che fa, terzo prendo caytlin perchè ha vita facile in lane\n\nGli adc si somigliano un pò tutti (farmi e lategame fai malissimo), di solito il meta varia a seconda del più buffato da una patch o una build, quando hanno nerfato la passiva di kalista la usavano molto di meno dopo, mentre invece col nuovo black cleaver qualche adc con danni ad area potrebbe farsi notare","replies":[]},{"poster":"Ediwir","date":"2015-05-30T03:36:46.910+0000","up_votes":1,"down_votes":0,"body":"Considera che il ruolo dell'ADC (a livello generico, indipendentemente dal meta del momento) è quello di fare danno sostenuto nei combattimenti, e pushare le torri dopo.\nA seconda del meta poi l'ADC può avere il ruolo di antitank o altri scopi secondari, ma principalmente, è quel tizio che può tirar giù una torre in sei secondi se si copre la bocca mentre sbadiglia.","replies":[]},{"poster":"kirchhoff","date":"2015-05-29T22:31:45.342+0000","up_votes":1,"down_votes":0,"body":"In base a chi è più forte nelle varie patch.","replies":[]}]}