{"poster":"Cucuna","date":"2016-10-24T07:01:05.776+0000","title":"Matchmaking defekt/unfair? Rito wtf?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":7,"body":"Hallo Leute,\n\nda ich seid knapp 5 Jahren LoL spiele bin ich echt viel gewohnt, dass harte geflame oder getrolle der meist sehr jungen Spieler ist alles schon mal dagewesen alles nichts Neues und aufgrund meiner Erfahrung kann ich das auch gekonnt ausblenden.\n\nIn der vergangen Tagen ist mir aber etwas aufgefallen das bist dato neu ist.\nIch werde &uuml;bertrieben h&auml;ufig mit sehr unerfahrenen Spielern gematcht.\nWie kann das sein?\nDa ich weit &uuml;ber 2000 Spiele auf dem Buckel habe, habe ich dem entsprechend viel Spielerfahrung und mein einziger Wunsch ist es ein faires Spiel zu bekommen. \nD.h. ich w&uuml;rde gern MIT und GEGEN Spieler spielen die ein &auml;hnliches Erfahrungslevel haben wie ich.\nSieg oder Niederlage, hin oder her solange ich mich FAIR behandelt f&uuml;hle kann ich das Spiel genie&szlig;en.\n\nHier zu meinem Bsp. (siehe meine Matchhistory ich als Ziggs, 24.10, Spiellänge 35:38, 65EP), welches mich erst zum Nachdenken und dann zu diesem Post brachte.\nSeine IGN: darf ich nicht nennen?!\nein wirklich blutiger Anf&auml;nger, der einfach noch nicht genau wei&szlig; wie das Spiel in der Tiefe funktioniert.\nEr war als Blitz unterwegs, hatte keine Keymasterie, keinen Sichtstein, seine Runenseite war noch nicht voll best&uuml;ckt und er ist sehr planlos &uuml;ber die Karte gestolpert. Das seine Skillshots nie trafen war auch frustrierend.\n**Dennoch mach ich ihm  keinen Vorwurf. Wir alle haben irgendwann mal angefangen.\n**\nWem ich allerdings eine Vorwurf mache ist Riot und dem Matchmaking-System.\nIch bin n&auml;mlich echt verwirrt da das so noch nie vorgekommen ist und pl&ouml;tzlich verdammt h&auml;ufig.\n\nMeine Frage an euch, konnte ihr &auml;hnliches beobachten?\nWas sind eure Erfahrungen der letzten Tage?\nHat Riot bereits am Matchmaking-System rum gebastelt in Vorbereitung auf die Pre-season?\n\nFreu mich &uuml;ber eure Antworten.\nEuer Cucum&acirc;","replies":[{"poster":"Luckycrit","date":"2016-10-24T17:53:50.475+0000","up_votes":1,"down_votes":0,"body":"Du scheinst die Situation ziemlich neutral zu beurteilen und das finde ich eine ziemlich gute Eigenschaft, aber du solltest dir auch mal Gedanken machen du hast 2000 Spiele und bist immer noch im Durchschnitt du solltest dir vielleicht langsam anfangen & überlegen  wie du besser wirst. So hast du diese Problem auch nicht mehr! Ich weiß das hat jetzt nichts mit dem Thema zu tun, trotzdem wäre das vielleicht mal ein Denkanstoß das du dich mal langsam richtung Gold IV-III bewegst. Möglich ist es allemal ein kollege von mir hat unter 1 Jahr only Riven von level 1 an bis jetzt knapp Gold 1 erreicht! Und Riven ist nicht gerade der Einsteigerfreundlichste Champion!\n\nDieser Post soll dich echt nicht angreifen oder so, ich bin selber erst Platin V und spiele sehr lange ist nur ein Gedankengang. Du musst nur mal überlegen alle Fangen bei Silber an und du bist immer noch dort..","replies":[{"poster":"Cucuna","date":"2016-10-25T01:52:22.465+0000","up_votes":1,"down_votes":0,"body":"ich kann all euren Einwand verstehen aber wie viele scheinst du auch du nicht ganz zu verstehen worum es mir eigentlich geht.\nFür mich bedeutet Elo einfach nichts. Es geht mir ausschließlich um den **Spielspaß und Fairness**.\nUm da Gefühl gerecht behandelt zu werden. \nDies geht aber leider verloren wenn Teile meines oder des gegnerischen Teams extrem über oder unterlegen sind.\nIch kann verstehen dass das nicht immer funktionieren kann, wie erwähnt besagte Ausnahmen zur Regel. Wenn aber mehr als 50% meiner gestarteten Spiele ein solches Ungleichgewicht aufweisen, ist es nur verständlich das ich anfange die Dinge zu hinterfragen, da dies wie bereits angesprochen in einer solchen Frequenz vorher noch nie aufgetreten ist.\nUm es mal mit einem Anderen Bsp. zu verdeutlichen. Wenn der FCBayern  einen Kreisligisten mit 20:0 deklassiert kann für alle beteiligten ein riesen Spaß sein aber spätestens nach den 2.,3. solchen Spiel würde sich jeder Fragen was soll das Ganze...\n\n.. natürlich gäbe es Möglichkeiten schnell Aufzusteigen. Ich könnte aufhören Main Supp zu spielen und mich auf die carry Positionen wie Mitte oder Jung fokussieren oder anfangen einfach meta zu picken aber wie bereits gesagt ist das klettern in der Elo nicht mein Anspruch sonder das aus dem Pool von den 100.000en Spielern das System in der Lage ist 10 zusammen zu würfeln welche auf einem ungefähr gleichen Niveau sind und nicht wie beschrieben Schwankungen vom Neuling bis zum Plat. (bezieht sich auf meine derzeitige Silberelo)","replies":[{"poster":"Luckycrit","date":"2016-10-25T13:11:26.092+0000","up_votes":1,"down_votes":1,"body":"Naja, nach diesem Satz \"Da ich weit über 2000 Spiele auf dem Buckel habe, habe ich dem entsprechend viel Spielerfahrung und mein einziger Wunsch ist es ein faires Spiel zu bekommen.\" Erschließe ich mir  daraus das du dir zuschreibst, dass du mehr Erfahrung hast als ein neuer Spieler aber das stimmt nicht ganz viel besser bist du nicht sonst wärst du ja höher egal ob dir Elo wichtig ist oder Unwichtig viele Spieler bis Challenger, sagen: \"Meine Elo juckt mich nicht, ich will Spaß!\", aber das sie besser werden ist einfach ein Prozess des Spielens, wenn man LoL als Hobby ansieht und man für ein Hobby, welches man lange Praktiziert irgendwann natürlich noch extra Interesse empfindet wird man Automatisch besser. Selbst wenn du kaum Interesse einsteckst wirst du besser ,selbst mit deiner sage ich mal vernünftigen Einstellung müsstest du schon viel höher sein ob du willst oder nicht.\n\nUnd das Problem ist auch unausweichlich irgendwo müssen neue Spieler eingeranked werden, jetzt wirst du bestimmt sagen ja dann schickt sie doch in Bronze 5, aber ich habe mal dort zugeschaut wie es da zugeht. Ich würde sogar Behaupten das ein normaler PC Spieler der unter Level 30 ist und neu LoL spielt mitunter besser sein kann, als jeder in Bronze V-III. 1 Stunde Hilfe von einem Freund oder so würde reichen oder nur wirklich sich ein paar Guides anzuschauen das was da los ist ist unter den Basics. \n\nUnd die Aussage\".. natürlich gäbe es Möglichkeiten schnell Aufzusteigen. Ich könnte aufhören Main Supp zu spielen und mich auf die carry Positionen wie Mitte oder Jung fokussieren oder anfangen einfach meta zu picken\" Ist auch falsch du kannst mit jedem Support auch out of meta sehr hoch kommen höher als Platin würde ich behaupten. Ich habe only Janna in SoloQ bis Platin geschafft und das ist echt nicht soooo viel Aufwand gewesen das war sogar recht einfach. \n\nUnd das \"Wenn der FCBayern einen Kreisligisten mit 20:0 deklassiert kann für alle beteiligten ein riesen Spaß sein aber spätestens nach den 2.,3. solchen Spiel würde sich jeder Fragen was soll das Ganze...\"  Ich sage mal so ein FC Bayern  ist \"Challenger\" klar würden die auch niemals mit ein Silber gematcht werden um das ganze \"Einzuholen\" :D. Kein guter Vergleich...\n\n\nDies war alles nur ein Gedenkanstoß wie gesagt, du hast es wie ich mir gedacht habe schon ziemlich angreifend aufgenommen. Du kannst auch dort bleiben, trotzdem das Problem bleibt dann weiterhin bestehen.","replies":[{"poster":"Cucuna","date":"2016-10-26T02:34:33.212+0000","up_votes":2,"down_votes":0,"body":"ich weiß gar nicht warum ich noch versuch leuten wie dir zu erklären worum es geht.\nelo ist das einzige was ihr kennt...\nes geht um das subjektive gefühl ungerecht behandelt zu werden und den wunsch zu wissen ob es weiten spielern so geht sowie die frage ob ein änderung des matchmakings der grund dafür ist.\n\n\"Erschließe ich mir daraus das du dir zuschreibst, dass du mehr Erfahrung hast als ein neuer Spieler aber das stimmt nicht ganz viel besser bist du nicht\"\n-> hab ich auch mit nur einer silbe erwähnt besser zu sein als die elo in der ich mich befinde?\nNein. mehr erfahrung heißt einfach  ich kenne alle fähigkeiten und viele colldowns der champs, heißt ich hab jungle timer und routen im kopf, time flashes oder summs cd's im chat... usw..  kleinigkeiten auf die sich anfänger noch nicht konzentrieren können weil sie erstmal mit dem champs zurecht kommen müssen\n\n\"Ist auch falsch du kannst mit jedem Support auch out of meta sehr hoch kommen\"\nhab ich irgendwo geschreiben das dies nicht so sei?\n-> wieder Nein! lediglich das es mit meta picks und carry positionen einfacher ist.\n(nebenbei: du bist mein held  plat mit nur janna wow.... wen interessierts? hat das irgendwas mit meiner eigentlich frage zu tun ob riot was am system verändert und ob andere ähnliche beobachtungen gemacht haben? überraschung nein!)\n\n-> tja und zu meine faußball vergleich... übertreibung ist ein stilistisches mittel in der literatur um bestimmte sachverhalte zu verdeutlich...\naber ja.. nimms wortwörtlich...\n\n\"Dies war alles nur ein Gedenkanstoß wie gesagt, du hast es wie ich mir gedacht habe schon ziemlich angreifend aufgenommen\"\n-> da ich es so aufgenommen habe, besteht evtl. die möglichkeit das du dich so ausgedrückt hast?! \ndenk mal drüber nach....","replies":[{"poster":"Luckycrit","date":"2016-10-26T12:37:19.059+0000","up_votes":1,"down_votes":0,"body":"Naja, das Ding ist du versuchst hier ein Problem anzusprechen, welches man nicht  einfach so ändern kann. Fakt ist, irgendwo müssen Neulinge eingeplaced werden und das ist halt in Silber. Und das wird sich auch nie ändern bzw erst mal nicht. Und bevor man hier so ein Forumpost macht und sich voll die Gedanken macht sollte man vielleicht überlegen wie man sich selbst von dem Problem entfernt und nicht darüber Stundenlang sinnlos Diskutiert. \n\n\n@ hab ich auch mit nur einer silbe erwähnt besser zu sein als die elo in der ich mich befinde? \n\nHast du nicht direkt du meintest du hast mehr Erfahrung als ein Neuling und ein Neuling ist meistens in Silber und dort bist du auch, aber man ist Automatisch besser als die Silberelo wenn man  das \"Nein. mehr erfahrung heißt einfach ich kenne alle fähigkeiten und viele colldowns der champs, heißt ich hab jungle timer und routen im kopf, time flashes oder summs cd's im chat... usw.. kleinigkeiten auf die sich anfänger noch nicht konzentrieren können weil sie erstmal mit dem champs zurecht kommen müssen\" alles kann bist du locker schon knapp Diamant selbst ich denk nicht nicht mal an all dem was du aufgelistet hast. Es geht nicht um die Elo selber man wird einfach höher gerankt wenn man besser wird und ob man es will oder nicht ob dich elo interessiert oder nicht es ist einfach Fakt. Außer du verlierst mutwillig, das wollen wir jetzt aber nicht hoffen. Merkst du was? Durch Erfahrung und wissenswerte kriegt man bessere Platzierung??? Und wenn man das alles nicht beachtet ist man halt schlechter Platziert und wer Beachtet das meiste nicht ?? Genau NEULINGE, die haben noch keine Ahnung von sowas und müssen sich das erst aneignen. \n\n\n\n\"..** natürlich gäbe es Möglichkeiten schnell Aufzusteigen.**  _Ich könnte aufhören Main Supp zu spielen _\n\nAlso das ist doch mehr als eindeutig. Du bist seit 3 Seasons high Silver low gold. Und du redest du könntest/die möglich besteht  schnell aufzusteigen indem du.... Das ist nicht richtig du kannst mit Mainsup bestimmt innerhalb von 3 Jahren konstant Gold erreichen auch wenn es langsam dauern würde. Bei deiner Spielzeit in dieser Season ist es echt seeeehr gut möglich. Dafür ist die wunderschöne Rolle des Supporters aufzugeben nicht Wert.  Und nein sag mir jetzt nicht das dich Elo nicht interessiert das hat 0 damit zu tun. Ich denke ja mal schon das du versuchst dein bestes zu geben was anderes wäre ein Report Grund meiner Meinung nach das Spiel ist Spaß klar man sollte ja aber trotzdem Spielen und nicht int feeden mit Absicht und disconunu Spielen weil das Spiel ist ja nur Spaß.\n\n\n\nIch sagte schon im ersten Text, dass meiner etwas Abschweift das jetzt als Argument zu nutzen halte ich jetzt eher für mau.  Und das Beispiel mit Janna sollte nur beweisen das man die Rolle des Supporters nicht aufgeben muss um schnell aufzusteigen das geht auch ohne ;).\n\nAuch wenn dein Fußball Vergleich eine Übertreibung ausdrücken sollte, ist es trotzdem einfach ein schlechter Vergleich. Auch wenn es deiner Meinung nach Sinn ergibt und es vielleicht für alle Sinn ergibt kann dies schlecht sein, weiß du was ich meine?\n\nMein erster Post habe ich jetzt nochmal wiederholt durchgelesen. Ich konnte keine Ansätze von Angriffen sehen tut mir leid ich hab das komplett Neutral gesagt ohne dir an die Gurgel zu gehen. Nur dir eine Lösung unterbreiten. Aber wie es halt so in LoL ist die wenigstens lassen sich was sagen. Das nehme ich dir nicht mal übel^^.\n\n\nUnd in Erfahrung zu bringen ob das andere auch das Problem haben macht kein Sinn. Du hast ja immerhin immer Mates in Silber die das ja dann auch miterleben wieso sollte das hier andere nicht kenn. Jeder Silberspieler kennt das Problem genau wie jeder Spieler mal ein Afkler/Troll/ragequitter im Team hatte.","replies":[{"poster":"Cucuna","date":"2016-10-26T17:33:05.102+0000","up_votes":1,"down_votes":0,"body":"... ich gebs auf...\ndanke für deine beitrag. du hast sehr geholfen","replies":[{"poster":"Luckycrit","date":"2016-10-26T19:15:43.484+0000","up_votes":1,"down_votes":0,"body":"Und du solltest es Aufgeben zu glauben, dass sich das Problem ändern wird :D","replies":[]}]}]}]}]}]}]},{"poster":"Alustus","date":"2016-10-24T08:30:39.115+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran das in Normalgames jeder mit jedem spielen kann.\nSprich ein Dia Spieler kann mit einem Freund der gerade mit LoL angefangen hat ins Matschmaking gehen.\n\nDas ganze muss dann natürlich irgenwie ausgeglichen werden, was natürlich nicht ganz perfekt ist.\n\nSolch Spiele gibt es daher schon immer.\nMir wäre keine wirkliche Verbesserung/Verschlechterung in den letzten Jahren aufgefallen","replies":[{"poster":"Cucuna","date":"2016-10-24T08:58:24.204+0000","up_votes":2,"down_votes":2,"body":"Es geht hier um Ranglistenspiele und keine Normals btw!\n\n... und ja bisher war das auch so aber im Moment scheint echt was faul zu sein.\nIch hatte jetzt das 3. Spiel in folge wo in einen der beiden Teams ein extrem unerfahrener Spieler beteiligt war.\nIch glaube nicht mehr an Zufall.\n\nNeben den bereits zuvor erwähnten Bespielen in meine Post und Kommentar jetzt das 3. mal in Folge.\nIrgendwas stimmt definitiv nicht!\n\nkannst dich auch gern hier wieder in meiner Martchhistory überzeugen.\nich als Ivern 24.10. Spiellänge 29:02 57 EP diesmal mein ADC der absolut unerfahren war...\n(und mit unerfahren meine ich das besagte Vayne das 2. Ranglistenspiel überhaupt gemacht hat)\nDu verstehst, ich mit meinen über 2000 Ranks in den vergangenen 5 Jahren werde mit jmd. gematched der das 2. Spiel macht.. das ergibt keinen Sinn und ist mir zuvor noch nie passiert.\n\nso oder so. es bleibt extrem unfair allen anderen 9 Spielern gegenüber","replies":[{"poster":"Sirrkas","date":"2016-10-24T09:56:41.610+0000","up_votes":1,"down_votes":0,"body":"Die Anzahl der Spiele hat fast nichts mit dem Skill zu tun. Ich habe auch schon Leute mit 2000 Rankedwins gesehen, die Bronze 5 mit 0 LP haben. Wenn du mit denen spielen würdest, wären die sicher auch keinen Deut besser. Die neuen Spieler müssen irgendwo anfangen und das ist nunmal Silber.","replies":[{"poster":"Luckycrit","date":"2016-10-25T13:12:12.785+0000","up_votes":1,"down_votes":0,"body":"Und das zurecht!","replies":[]}]}]}]},{"poster":"RAG Ryve","date":"2016-10-24T13:33:56.391+0000","up_votes":1,"down_votes":0,"body":"Liga aufsteigen, dann bekommst auch bessere Gegner. In Silver erwarte ich mir nicht viel mehr als die Basics + ein paar Champion Mechanics.","replies":[{"poster":"Cucuna","date":"2016-10-24T14:29:01.353+0000","up_votes":1,"down_votes":0,"body":"ich bin nicht scharf auf bessere oder schlechtere Teammitglieder oder Gegner sondern wünsche mir ein halbwegs ausgeglichenes Matchmaking.\nHatte innerhalb weniger Spiele vom Newbie bis zum Plat. alles dabei und das ist es was mich einfach stutzig macht.\nDa sowas zuvor noch nie mit einer derartigen Häufigkeit auftrat, bestand mein Interesse darin zu hinterfragen","replies":[]}]},{"poster":"Cucuna","date":"2016-10-24T07:48:08.885+0000","up_votes":1,"down_votes":2,"body":"Es kann KEIN Zufall sein!!!\nDer selbe Fall schon wieder!!!!\nDiesmal hat es das gegnerische Team getroffen. Es war eine Lux und ein absoluter Neuling im Spiel.\nBitte schaut euch meine Matchhistory an.\n\nSpiel vom 24.10. Spiellänge 27:35 ich als Ziggs 80 EP zur Idendifizierung des Spiels","replies":[{"poster":"Sirrkas","date":"2016-10-24T09:54:37.792+0000","up_votes":1,"down_votes":0,"body":">Diesmal hat es das gegnerische Team getroffen. Es war eine Lux und ein absoluter Neuling im Spiel.\n\nDu befindest dich im Silberbereich. Neue Spieler müssen irgendwo eingestuft werden. Normalerweise ist das etwa Silber 3. Wenn die da ein paar Spiele Glück hatten und gecarriet wurden, kommen die leicht auch in oberes Silber. Solange du in einem Bereich spielst, der dem Durchschnitt entspricht, wirst du öfter auf neue Spieler treffen. Die können entweder deutlich schlechter als die Division sein und steigen dann ab, in etwa auf dem Niveau sein und bleiben da oder sind deutlich besser als die Silberspieler und steigen schnell nach Gold oder Platin auf.","replies":[{"poster":"Cucuna","date":"2016-10-24T10:28:32.620+0000","up_votes":1,"down_votes":0,"body":"macht schon Sinn was du schreibst.\ndanke.\ndennoch stinkt es zum Himmel, dass von dir beschriebenes normalerweise die ausnahme ist, es aber in letzter Zeit  ständig passiert\nund ich frage nach dem warum? irgendwas schein auf mich im system verändert","replies":[{"poster":"Cucuna","date":"2016-10-24T11:38:16.601+0000","up_votes":1,"down_votes":1,"body":"und ein weiteres beispiel für die \"ausnahmen\"\njetzt wurde ich mit 2 plat spielern gematched.\nihr könnt euch noch so oft auf den normal fall berufen\n\n**fest steht hier stimmt was nicht.**","replies":[{"poster":"Sirrkas","date":"2016-10-24T11:45:32.362+0000","up_votes":1,"down_votes":0,"body":"Da gibt es zwei Möglichkeiten. Die Platin 5er haben ein Gold MMR erreicht und sind abstiegsgefährdet und noch, die Riven war als Premade mit ein paar Goldspielern unterwegs. Laut op.gg in diesem Fall mindestens mit Rengar, der Gold 3 ist. Es kann durchaus sein, dass das System deshalb einen anderen Platinspieler gesucht hat und wenn du regelmäßig mit Gold spielst, steigst du wohl bald auf.\n\nAußerdem arbeiten viele um 13 Uhr noch oder sind in der Schule. Der Spielerpool ist also nicht gut gefüllt, was zu extremeren MMR-Unterschieden führen kann. ","replies":[{"poster":"Cucuna","date":"2016-10-24T11:48:44.688+0000","up_votes":1,"down_votes":0,"body":"thx.\n\n3 kreuze wenn die solo q zurück kommt\n\ndas mit dem aufstieg kann aber nur kommen wenn mal 10 spieler auf den gleichen niveau zusammen treffen\nund ich nicht ständig von einem extrem zum anderen","replies":[{"poster":"Sirrkas","date":"2016-10-24T11:56:39.732+0000","up_votes":1,"down_votes":0,"body":"Nächste Season kannst du Solo/Duo spielen, wenn du willst. Die wird wieder aktiviert und es gibt noch die FlexQ. \n\nDas mit der Schwankung ist hier wohl so schlimm, weil du eben in einem Bereich bist, in dem alles Möglich ist. Da kommen die Bronzespieler rein, die bei der Einstufung Glück hatten, du triffst auf Platin und Gold, die dich zerreisen, aber Pech in der Einstufung haben und es kann eben noch Premades geben, die gerade noch so zusammen spielen dürfen, wie jemand aus Silber 5, der eigentlich nach Bronze müsste und ein Gold 1 Spieler, der im nächsten Spiel vielleicht schon Platin ist. Zudem ist die Peaktime wohl besser geeignet, wenn man ausgeglichenere Spiele will. Größere Auswahl an Mitspielern, sorgt eben auch dafür, dass es ausgeglichener gestaltet werden kann. ","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2016-10-24T10:30:43.181+0000","up_votes":1,"down_votes":0,"body":"Vermutlich wollen Spieler, die eben erst 30 geworden sind, kurz vor dem Seasonende doch noch Rankeds machen, um sich einstufen zu lassen. Es sind ja nur noch 2 Wochen. Wenn ich im Frühling angefangen hätte, würde ich das jetzt auch machen, weil ich eben die Chance auf Seasonrewards hätte.","replies":[{"poster":"Cucuna","date":"2016-10-24T10:38:07.364+0000","up_votes":1,"down_votes":0,"body":"gutes argument.\nich werde aber weiterhin beobachten.\n\n... ob das ein gutes matchmaking ist, steht dennoch im raum...\nimmerhin ist es ja nicht so das in meiner elo nicht genügend spieler mit ähnlich viel erfahrung zur verfügung ständen und umgekehrt...","replies":[{"poster":"Sirrkas","date":"2016-10-24T10:50:49.647+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht nach Anzahl der Spiele, es geht nach MMR. Die ist bei neuen Spielern eben noch nicht korrekt ermittelt. Ob deine Mitspieler jetzt 50, 500 oder 5000 Spiele gemacht haben, macht keinen Unterschied. Wenn der mit 50 Spielen wie Gold spielt, carriet der in Silber, wenn der mit 5000 wie Silber 5 spielt, ist der eine Last für euch.","replies":[]}]}]}]}]}]},{"poster":"Serlaya","date":"2016-10-24T10:35:17.495+0000","up_votes":1,"down_votes":0,"body":"Diese Ausnahmen treten halt zum Ende der Season verhäuft auf. Dafür gibt es Gründe. \nDas hat Sirrkas dir schon erklärt. Es gibt viele die jetzt erst Ranken damit sie noch geplaced sind.","replies":[]},{"poster":"Serlaya","date":"2016-10-24T09:41:27.821+0000","up_votes":1,"down_votes":0,"body":"Auch in Rankeds kann es zum ungleichgewicht kommen, durch Smurfing/Boosting. Zumal du bist Diamond noch eine TEAMQUEUE haben kannst, kannst du suddenly als Silber Spieler in Bronzies reingematcht werden. \nUnd wer mit 2k Rankeds in der Season noch immer in Silber rumhängt, kann keine gute MMR haben. \nUnd nochmal dazu, da ich grade gesehen habe das du im Silebr Bereich spielst, (absolut kein Flame!), kann dies noch einen anderen Grund haben. \nUndzwar werden Leute die grade erst ihre Placements spielen, in Leute gemacht die von Bronze bis sogar Platin Ranks haben. Dementsprechend hast du Unerfahrene Leute in deinem oder im Gegnerteam. Das passiert, da Riot mit dem aufsteigen der Mates/Gegner dem neu Platzierten Summoner besser eine Liga/Division zuweisen kann. \nVerliert er gegen Platins aber stompt durchgehend Silvers, kannst du davon ausgehen das er High Silver/Gold (je nach Winrate) geplaced wird.","replies":[{"poster":"Cucuna","date":"2016-10-24T10:32:10.401+0000","up_votes":1,"down_votes":0,"body":"vielleicht hab ich mich unklar ausgedrückt.\nich bin mir dieser sachverhalte durchaus bewusst. diese stellen aber sonst die ausnahme zur regel dar und sind auf die gesamt anzahl von spielen in einem nicht nenneswerten  prozentualen breich. meine frage warum steigt es in letzter zeit auf ein extrem hoche zahl an?","replies":[]}]},{"poster":"Serlaya","date":"2016-10-24T07:08:30.359+0000","up_votes":1,"down_votes":0,"body":"Bitte entferne den Namen. Namecalling ist nicht gestattet :)\nzu dem rest deines Beispiels: Es kann durchaus sein das er Premade mit einem höheren Spieler war. Dies gleich dann dementsprechend das Matchmaking aus.","replies":[{"poster":"Cucuna","date":"2016-10-24T07:13:40.454+0000","up_votes":1,"down_votes":2,"body":"ok. ich nehm den namen raus. wusste ich nicht.","replies":[]}]}]}