{"poster":"Shrewd","date":"2016-03-18T05:48:57.572+0000","title":"Same toxic player 3 times in a row...","subforum":"Player Behaviour","up_votes":3,"down_votes":0,"body":"What do you do when you get the same toxic player 3 games in a row in ranked? This player called <removed> has just gone out of his way to make the game miserable for my teams over the last 3 games. Each time, he&#039;s been reported. Ends up in the same queue again, and then it all begins again. Muting stops the abuse and harassment, but it doesn&#039;t stop the active sabotage of every teamfight and play. \n\n(Edit: Removed name)\n\nWhat can a player do to avoid/overcome this problem?","replies":[{"poster":"Nijel","date":"2016-03-18T05:57:17.432+0000","up_votes":2,"down_votes":1,"body":"First off, you can't name and shame on the boards so you'll want to get rid of that name there.\n\nLook, the easiest way to _not_ get the same person is to _not_ queue again. The punishment system usually isn't instant so hoping he got banned within 3 minutes probably won't happen. Wait 5-10 minutes and you should get a fresh batch of players. If you're feeling particularly paranoid you can use http://oce.op.gg/ to track a player and wait for them to be in a game before you queue.","replies":[{"poster":"Shrewd","date":"2016-03-18T06:34:38.756+0000","up_votes":1,"down_votes":0,"body":"I'll remove krazith out of the OP didn't realise. But in response to your post, not queuing up again ends up punishing the player/victim. In two cases I waited about 5 minutes in the hope that he'd be in some other game by then.","replies":[{"poster":"Nijel","date":"2016-03-18T06:41:35.998+0000","up_votes":2,"down_votes":0,"body":"You kinda just posted his name again. \n\nLook it's not ideal that you have to wait but it's not a punishment either. Would you rather wait or get the same person? The choice is up to you.","replies":[]}]}]},{"poster":"DragonOfTheVoid","date":"2016-03-18T08:03:55.633+0000","up_votes":2,"down_votes":1,"body":"um block","replies":[]},{"poster":"andyMak","date":"2016-03-18T10:21:47.043+0000","up_votes":1,"down_votes":0,"body":"i use lolnexus\ni had a smuirf duo that wer ejust owning my entire team. im assuming smurf because they were way too good for bronze\n\nI used lolnexus, when it said they were in game then i queued","replies":[]},{"poster":"Zorphiax","date":"2016-03-18T08:14:31.656+0000","up_votes":1,"down_votes":0,"body":"Report/block and they will be dealt with.","replies":[]},{"poster":"Yasei Doubutsu","date":"2016-03-18T06:04:29.310+0000","up_votes":1,"down_votes":1,"body":"yeah like what Nijiyo said, cant name and shame.\nIt does suck but there is a reason for it.\n\nJust wait write a detailed report of the guy who was toxic, have a breather.\nGo eat some delicious cookies or something.\n\nThis way when you get back you a fresh and happy to go back into ranked.\nYou will be happier, less tilted and thus less likely to have another bad game.","replies":[]}]}