{"poster":"Gokouu","date":"2015-05-25T06:02:52.745+0000","title":"Team LF jungle","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Group of friend usually play 6-7 games a week majority being fri-sat-sun after lunch LF a jungle for ranked 5s team. We have pretty good synergy no ragers and use skype with good comms between us. We know our weakness&#039; and have no problem being constructive to each other to point out errors in play to fix them.\r\nWe would prefer a jungle with mid focus who plays tankier jungles with CC like {{champion:59}} {{champion:113}} {{champion:254}} \r\nA shot caller would be nice as we normally prefer supp/jungle tank front lines and would be going in on a jungle in team fights but its not 100% needed as we all are capable of making calls.\r\nMost interested in the ability to improve, not rage or give up and synergy then your rank. \r\nAs for us in blind 5s we float around gold-plat opponents solo ranks are high silver-gold.\r\nAdd me in game and send a msg so i can set a note to your IGN. \r\nPlease be fairly active in afternoons/weekends. Do not need to be online 24/7 and RL is there and happens but more then once a month thanks:)","replies":[{"poster":"Spaghini","date":"2015-05-26T05:11:33.434+0000","up_votes":1,"down_votes":0,"body":"idk if youre still looking but\n\nIGN: Spaghini\nPlat 5\nJungle probably my best solo queue role, generally playing vi/gragas/reksai/lee/nocturne\nI don't rage/bm\nNever been in a serious ranked team but happy to try out shotcalling and see how that works out\nCan use/get any voice comms i need to\nLet's win :D :D","replies":[]},{"poster":"viperblits","date":"2015-05-25T07:43:07.246+0000","up_votes":1,"down_votes":0,"body":"IGN: viperblits\n\nJungle Picks: {{champion:254}} {{champion:421}} {{champion:113}} {{champion:79}} {{champion:33}} \n\nYour team sounds like the perfect fit for me. \nI am a Vi jungle main who gives tons of attention to mid lane. \nI play very frequently. I am a positive player and able to use voice comms.\nI have great game sense and shot calling ability. \nI am very determined to improve as a player and a team.\nI have experience working in team environments and skills in project management.\n\n","replies":[]},{"poster":"span","date":"2015-05-25T07:17:52.050+0000","up_votes":1,"down_votes":0,"body":"IGN: span\n\ni can fill any role to a gold standard, and i think even higher in a ranked team. I play a lot of jung and have a pretty large champ pool of tanky cc champs.\nKeen for a go with your team.","replies":[]},{"poster":"Darryl0127","date":"2015-05-25T07:00:36.155+0000","up_votes":1,"down_votes":0,"body":"i main jg and likes to shot call i play most of the junglers  IGN: Darryl0127 i main lee,j4,sej but j4 is not good at the current meta and i watch all the regions","replies":[]}]}