{"poster":"Gokouu","date":"2015-04-10T12:59:16.958+0000","title":"LFM for 5s team bronze-gold(jungle)","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"LF a jungle for a group for friends. We have all lanes sorted just need a decent jungle. Mid and top will need more attention then bot.\r\nWe use skype for comms but may look at mumble ect if that works out better.\r\nMost have us have been mid-high gold in solo/duo.\r\nIt is a first time team(have played team 5s before but never more then the odd few placements)\r\nAdd me in game Gokouu or reply here.\r\nWill be playing mostly thurs-sun with focus on weekends and nights.\r\nAll players are based in NZ.\r\nMust be able to take constructive criticism and we will as well in return.\r\nThanks","replies":[{"poster":"Gokouu","date":"2015-04-18T08:03:06.150+0000","up_votes":1,"down_votes":0,"body":"Still looking for a jungle and possibly a filler mid. mostly due to time..we will be playing sat/sun after 630pm nz time with the odd games after work thurs/fri.","replies":[]},{"poster":"Weak Baby","date":"2015-04-16T14:40:49.949+0000","up_votes":1,"down_votes":0,"body":"Hi mate,\nIf you're still looking for a jungler, I'd be happy to join the team.\nhttp://oce.op.gg/summoner/userName=Jory","replies":[]},{"poster":"Tuaca","date":"2015-04-14T23:55:11.211+0000","up_votes":1,"down_votes":0,"body":"Been jungling main for last 3 seasons add me and check me out","replies":[]},{"poster":"False Pretense","date":"2015-04-11T02:38:27.502+0000","up_votes":1,"down_votes":0,"body":"Im in, im silver 5 and a decent jungler, add my IGN : False Pretense","replies":[]},{"poster":"DuckDuck113","date":"2015-04-10T23:08:41.996+0000","up_votes":1,"down_votes":0,"body":"Hey. I would be keen to join your team, assuming you are still looking for a jungler. \nI was gold 4 last season, but I am currently silver 3, as I am currently having a bad run in solo queue. I was thinking that if I had a team that I could communicate with, and play with often, I might enjoy it a bit more, and perform a bit better,  than just playing with randoms.\nI based in NZ, and would really like to improve my game play, and playing with a team would be a great way to do that. \nMy IGN is Duckduck113. Feel free to look at me on lolking etc and see if you guys want me on your team.","replies":[]}]}