{"poster":"RobboxoniaGaming","date":"2016-08-09T19:14:52.425+0000","title":"Matchmaking... o solo sfortuna?","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Non &egrave; un post per lamentarmi, voglio solo capire una cosa, sono in lose streak, ma ne perdo proprio tante, e vagando in vari forum ho letto che se vinci abbastanza partite di fila, il sistema fa in modo di farti scalare e farti vincere sempre di pi&ugrave;. ( perch&egrave; in qualche modo capisce che meriti un elo pi&ugrave; alto.) [HO LETTO COSI&#039;]. Sono passato da silver 4 a silver 3  in un giorno e poi da quando sono salito non ne ho piu&#039; vinta una, e sto continuando a scendere ,tra poco di nuovo silver 5. \nVoglio capire se il sistema funziona veramente cosi&#039; e se  pi&ugrave; ne perdi, pi&ugrave; te ne fa perdere. Halp me plox...\n{{champion:32}} \nSe si, c&#039;&egrave; un modo per infrangere le lose streak e tornare a vincere? (a parte carryare, ci ho gi&agrave; provato senza risultati , visto che anche se mi feddo vengo sempre insultato in qualche modo e la gente tilta.) \n\n\n[Tralasciando il fatto che sono un po tiltato e che non riesco a giocare molto bene]","replies":[{"poster":"Dragonfield123","date":"2016-08-10T22:03:16.370+0000","up_votes":1,"down_votes":0,"body":"A me in normal ha matchato contro 4 plat (sono bronzo MA non mi lamento, mi DIVERTE giocare contro la gente più forte, si impara :D) e nel team mi ha messo una bot senza mani che ha feedato sia in quel game che in tutti i game precedenti (capisco un game, ma 20 di fila in cui feedi...)","replies":[]},{"poster":"zYaichi","date":"2016-08-09T20:10:16.504+0000","up_votes":1,"down_votes":0,"body":"Si non giocare è il miglior modo per non scendere se ne hai perse già 3 di fila potrà essere difficile ma fermati e ritenta più tardi/domani/quando te la senti poi la regola del se sei forte sali vale sempre","replies":[]},{"poster":"Kim114","date":"2016-08-09T20:42:16.371+0000","up_votes":1,"down_votes":1,"body":"Fai premade con gli amici\nIo sulle 10 iniziali ho trovato 5 afk in team","replies":[]}]}