{"poster":"the real mcoy","date":"2015-01-04T23:40:16.429+0000","title":"Dorans sheild on adc's","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"So I was reading pheaks points on dorans sheild on surrender at 20, and I started wondering if dorans sheild is a viable start on adc's. While the stats it gives dont seem to be that great for an adc, quite often on a toplaner (who similarly wouldn't appear to get much from the stats apart from the health regen), it feels stronger in lane then a dorans blade. I'm thinking mainly matchups where your going to be playing defensive early, for example a vayne vs cait lane or vs anyone else who is likely to bully you early before you can outscale, as once youve hit 6 most lanes have either been won or turned around (assuming one side was stronger early), and youve also backed and brought some damage. Also as a final question will the passive protect from both hits of lucians lightslinger? Cheers","replies":[{"poster":"Rav","date":"2015-01-05T00:17:11.750+0000","up_votes":2,"down_votes":0,"body":"If you can't hit minions at all then Doran's Blade is useless. However at bot lane, ADCs are always ranged (unlike my dank Gangplank and Yasuo \"ADC\"). So Doran's Shield isn't the greatest.","replies":[]},{"poster":"Blood Harvest","date":"2015-01-04T23:57:52.417+0000","up_votes":1,"down_votes":0,"body":"Think of it like this\nIf you are top lane wukong\nAnd you are losing lane\nIf you stack armour/mr you will never win because sooner or later their trynd and ignore u,\nDorans shield isnt that good for bot unless maybe its some lulu+ezreal pot lane and lulu is known for basic attack harras, but against a aoe caster like graves maybe not, You need to be doing dmge, but it could be viable in the vayne+cait match up but then again dorans blade gives life steal hp and AD so its probably still a better choice.\n\nMaybe if ur doing all in level 1/2 and they are someone that uses single target attacks IE vayne then maybe with an all in from leona and ur doransn shield will make sure u dont die and u can get the damage from her passive.","replies":[]}]}