{"poster":"Triplestarsystem","date":"2019-03-11T18:19:54.697+0000","title":"Neeko e Sylas","subforum":"Campioni e gameplay","up_votes":4,"down_votes":2,"body":"Ciao a tutti,\n\nvorrei parlare di questi 2 campioni che secondo me hanno bisogno ancora di essere bilanciati.\n\nNeeko: Campione AP che funziona infinitamente meglio full AD che full AP. Per me qualcosa non torna. Non ho nulla contro Neeko AD, ma il fatto che funzioni meglio non mi va giù. A che servono gli scaling AP se non funziona altrettanto bene? E' una sorta di Vayne con 2 strodimenti che fa malissimo sbattendosene degli scaling. Una presa per i fondelli.\n\nSylas: danni base decisamente troppo alti. Non è possibile che 2 rune e qualche oggetto tank renda resistente (quasi immortale) un campione che quando ingaggia fa dei danni enormi e vinca tutti i trade anche mancando le abilità. Anche qui qualcosa non mi torna.\n\nVoi cosa ne pensate?","replies":[{"poster":"nJacob","date":"2019-03-14T15:50:12.979+0000","up_votes":2,"down_votes":0,"body":"Neeko non si builda AD, si builda on-hit. C'è una grande, grandissima differenza. Non funziona meglio, ha un ruolo diverso. Si può ancora buildare full AP e funziona benissimo, solo che a quel punto la si gioca come un mago e non come un tiratore. E' una sorta di Vayne perché? Peché builda rageblade e botrk?\n\nSylas cos'ha di non bilanciato? Come fa a vincere i trade missando le abilità? Sono genuinamente interessato a questa frase, se non si tratta del solito e banale \"il nuovo champ è OP perché è nuovo\". Come fa a ingaggiare se missa le abilità? Lo sai che è un campione melee vero? Prendi in considerazione l'idea di buildare {{item:3123}}  o {{item:3165}} per ridurre le cure della sua W, che sì, al momento anche secondo me sono eccessive, ma niente di più.","replies":[{"poster":"Triplestarsystem","date":"2019-03-14T20:41:09.375+0000","up_votes":1,"down_votes":0,"body":"E' vero!!! On hit! E' tutta un'altra cosa hai ragione. Dico AD perchè nella mia testa chi gioca ad autoattacchi è AD. \n\nEd è anche vero per l'ap. Io la sto provando supporto AP e va che è una scheggia! Divertentissima oltretutto.\n\nSylas ha le cure. Baita troppo facilmente a zero vita per tronare metà vita in tempo zero. Ovviamente sto parlando delle cure di base troppo altre. Nulla da dire se invece fossero scaling! Si si le buildo, ma è in lane che lo trovo opprimente (io sono main supporto quindi non lo incontro mai, però vedo i miei compagni o gli avversari faticare a bestia). Per missare intendo la Q, che colpisca o no vince il trade comunque. Con altri campioni se manchi un'abilità ti devi ritirare e perdi il trade.","replies":[]}]},{"poster":"Erax157","date":"2019-03-11T19:37:00.697+0000","up_votes":3,"down_votes":1,"body":"Io nuovi champ/rework di riot soffrono tutti di questo problema: escono, sono Op o fanno schifo, ricevono nel primo caso nerf continui finche non muoino e poi ne modificano le meccaniche di base per poi ri-buffarli (Irelia e akali), oppure li buffano finche non sono forti a schifo e poi sono costretti a rinerfarli (aatrox). Il problema di neeko è che in reazione ai nerf si è cambiato lo stile di gioco direttamente. Per sylas invece credo sia necessario renderlo simile a uno yasuo, ossia molto squishy, con molti danni, che eccelle nei trade prolungati ecc... in questo modo si potrebbero anche porre dei freni alla sua potenza perchè bisognerebbe essere più cauti per giocarlo. Io personalmente trovo che alcune parti del suo kill lo rendano troppo facile, ad esempio la W e la R, non per gli effetti in se, ma per il fatto che sono spell a target e quindi inevitabili, personalmente è una cosa che mi dà molto fastidio considerati anche gli effetti delle abilità non indifferenti per il suo kit.","replies":[{"poster":"Triplestarsystem","date":"2019-03-11T21:08:58.170+0000","up_votes":1,"down_votes":0,"body":"In realtà penso che la R di Sylas vada bene così perchè comunque si deve \"accontentare\" delle ulti di chi gli sta di fronte in Lane che non sempre lo aiutano.\nQuello che trovo abbastanza pesante è che funziona perfettamente quasi full tank e fa troppi danni anche senza colpire con le abilità, altri campioni ,se manchi con l'abilità, ti devi ritirare con lui no.","replies":[]}]},{"poster":"wattbatt","date":"2019-03-11T18:36:26.683+0000","up_votes":3,"down_votes":2,"body":"il gioco era più bello 3 anni fa quando più del 50% dei champ erano tronchi immobili ma almeno si capiva cosa stavi facendo nel gioco, ora in ogni rework e nuovo campione  mettono 753452764527 dash controdash stun e modi per fregare gli altri; ci sono delle partite in cui mi sembra di combattere contro i miei nervi anzichè dei champ\n\n\n\n{{champion:164}} {{champion:240}} {{champion:39}} {{champion:84}} {{champion:266}} {{champion:142}} {{champion:517}} {{champion:518}}{{champion:3}} {{champion:19}} {{champion:555}} {{champion:498}} {{champion:497}} ","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-11T20:44:40.668+0000","up_votes":2,"down_votes":1,"body":"Sarà impopolare come opinione ma condivido, l'ignoranza dei champ era decisamente più divertente","replies":[{"poster":"Triplestarsystem","date":"2019-03-11T21:05:36.825+0000","up_votes":1,"down_votes":0,"body":"Condivido, anche se in realtà i tempi cambiano e anche LoL ha bisogno di rinnovarsi.","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-12T09:14:29.913+0000","up_votes":1,"down_votes":1,"body":"Probabilmente si,ma non essendo un cambio di \"massa\" trovi un gioco con champ innovativi da tenere a bada causa competitivo e champ ignoranti poco funzionali rispetto a tutto ciò che si é dato agli ultimi champ/rework con il risultato finale che il metà pesa sempre di piu ","replies":[]}]}]}]}]}