{"poster":"Prince Ephraim","date":"2019-08-29T03:15:07.611+0000","title":"[Champion Concept Rework] Nocturne","subforum":"Concepts & Creations","up_votes":2,"down_votes":0,"body":"With the next two reworks announced, and Nocturne probably going on the back burner for a long time, I thought I'd try my hand at updating his abilities myself, making him more of a kind of nightmare anomaly and Jungle Assassin than he currently is. \n\nTo explain a bit before getting to the abilities, I really enjoy playing Nocturne, but he feels too underwhelming to really be good. His kit has really simple and easy counter-play, and he doesn't really work in the current game anymore. So I wanted this rework to expand on mostly the darkness and nightmare concept. Turning Nocturne into a sort of umbral horror that feeds on fear. \n\nCurrently, Nocturne kind of fulfills this role by having an absurdly long range gap closer and a fear he triggers after a channel, but nothing else about his kit really screams \"nightmare\" or \"darkness\" (outside of whenever he clicks his R). I want to expand the concept of drawing champions into darkness and being kind of an \"always behind you\" kind of fear that he can inflict, but, I have tarried long enough. On the fun stuff.\n\nBase Stats: \nHP: 585-2030 (85hp per level)\nHP5: 8.5-21.3 (0.75hp5 per level)\nMana: 275 -955 (40m per level)\nMP5: 7-14.7 (0.45mp5 per level)\nAttack Range: 125\nAttack Damage: 62-114.7 (3.1ad per level)\nAttack Speed .721 (2.7% Bonus AS per level)\nArmor: 38-97.5 (3.5 armor per level)\nMagic Resist: 32.1-53.4 (1.25 magic resist per level)\nMovement Speed: 350\n\nExplanation: Nocturnes base stats for the most part are fine, though I believe the extra 5 movespeed is good for the type of champion he wants to be. And the extra mana will help a bit since he has abilities he will use more often.\n\nPassive: **Nightmare** - Nocturne's Abilities apply a debuff to enemy champions they hit, causing them to leave a trail of darkness that grants Nocturne bonus attack damage and movement speed while he is on the trail, the duration of the debuff is refreshed by Nocturne's basic attacks.\nTrail lasts 3 seconds\nBase Duration 4 Seconds, increased by 1.5 seconds for every basic attack\nAttack Damage: 20/22/24/26/28/30/32/34/36/38/40/42/44/46/48/50/52/54 (+2 AD per level)\nMovement Speed: 20%/25%/30%/35% (at levels 1/6/11/16)\n\nExplanation: I wanted to make Nocturne play around the trail that his current Q leaves, but it's difficult to do that when he can't keep it up more than about 6 seconds if it hits a champion at the max range, so I figured moving it to his passive and having it trigger when he hits and ability is a bit better. Since it rewards him for dueling and it's much harder for opponents to get them off of him.\n\nQ: **Duskbringer** - Nocturne sends out a blade that leaves a dusk trail on the ground for 3 seconds, stopping on the first champion hit and dealing physical damage to them.\nCooldown: 12 Seconds\nMana Cost: 70/75/80/85/90\nDamage: 70/120/170/220/270 +70% Bonus AD\nRange: 1250\nMissile Speed:1600\n\nExplanation: I didn't think his Q needed much of a change, but with his ability to refresh the duration of his dusk trail, applying it to multiple enemies at range would have been a bit too much I think, so having it stop on the first champion hit feels a little more right, especially since it does a bit more base damage with only slightly less scaling.\n\nW: **Umbra Blades** - Nocturne slashes nearby enemies, healing himself For a small amount increased by units after the first. The cooldown is lowered whenever Nocturne basic attacks a champion afflicted by Nightmare\nCooldown: 12 Seconds (lowered by 1 second per basic attack)\nMana: 35 at all ranks\nDamage: 40/55/70/85/90 +40% total AD\nBase healing: 40/60/80100/120\nHealing from enemies hit after the first: 5/10/15/20/25\nRange: 150\n\nExplanation: I really like Nocturne's current passive and what it does for him as a jungler and duelist. so I figured reworking it to an active ability that's almost the same felt a bit better. This lets him have waveclear when he wants it, and not just passively. letting him choose whether or not to push a wave and rewarding him for being in a crowd of enemies. Though I do think that the numbers on this ability could and should probably be changed around for balancing.\n\nE: **Umbral Advance** Nocturne slips into his dusk trail and becomes untargetable, following it until he reaches a champion afflicted with **Nightmare**. On arrival Nocturne briefly fears his victim and enemy enemies in his immediate vicinity and grants himself attack speed.\nCooldown: 30/28/26/24/22 seconds\nFear Duration: .25 Seconds\nAttack Speed: 50/55/60/65/70\nAttack Speed Duration: 6 Seconds\n\nExplanation: Nocturne needs a way to stick on to champions that can dash or jump away from him, since currently he just needs to hope that either his fear triggers, or the movement speed from his trail is enough, but allowing him to catch up to champions that may have been able to easily evade him before, need to be prepared to fight him. I also though this was a good way to grant him an attack speed buff, as it rewards players for playing aggressively and playing to his strengths, though he can also burn this ability early in a fight to cc a champion to make sure you land an auto attack to refresh his trail. I should also mention that if no champion is inflicted with **Nightmare**, due to either dodging his Q or whatever other means, then his ganking ability ends up much weaker .\n\nR: **Paranoia** - 1st Cast; After a brief delay, Nocturne afflicts nearsight to all enemy champions for 6 seconds. 2nd Cast; Nocturne can dash to any champion he has vision of and is nearsighted, dealing damage and becoming unstoppable during the dash.\nCooldown: 150/125/100\nMana: 100\nDamage: 150/275/400 +120% Bonus AD\nRange 2500/3250/4000\n\nExplanation: I really don't think their is any issue with Nocturne's current ultimate. It's good overall, thematic, and most of all; fun. It lets him gank lanes or pick off lone champions trying to run away or who just aren't quite in the fight yet. And even though he has a new \"dash\" with his E, it's more of an early game thing that lets him gank a bit easier in the early game, and stick on to them in the mid-late game.\n\n\nClosing statements:\nI don't believe this is the only way to change Nocturne, and it may not be the best way. But this is what I believe would end up being the most fun. These changes give Nocturne more agency in fights, rewarding him for landing abilities and staying on champions, while still retaining the core concept of being a shadowy assassin sort of like Zed, while playing entirely different. I'd love to hear some kind of feedback on this, whether some things seem too strong or too weak. But overall I believe I found a fun way to change Nocturne for the better, making him either an assassin with a quick burst combo, or a sticky brawler that can start fights and then stay on whoever he needs to.","replies":[{"poster":"BlackKnightJack","date":"2019-08-29T06:26:02.030+0000","up_votes":1,"down_votes":0,"body":"The biggest problem with Nocturne is that he doesn't know if he wants to be a skirmisher or an assassin. Any rework would need to firmly cement him as one or the other. Personally I prefer any rework make him an assassin. It doesn't feel right to build armor on him when he looks so fragile.","replies":[{"poster":"Prince Ephraim","date":"2019-08-29T12:20:19.658+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackKnightJack,realm=NA,application-id=A8FQeEA8,discussion-id=H0g9bOgO,comment-id=0000,timestamp=2019-08-29T06:26:02.030+0000)\n>\n> The biggest problem with Nocturne is that he doesn't know if he wants to be a skirmisher or an assassin. Any rework would need to firmly cement him as one or the other. Personally I prefer any rework make him an assassin. It doesn't feel right to build armor on him when he looks so fragile.\n\nI can agree with that, but I think the versatility of being able to do both would be something that sets him apart from other champions. Hopefully not like something to the degree of Tank Ekko on release, but a way to build Nocturne without forcing him to build just lethality and hope he does enough damage.","replies":[{"poster":"BlackKnightJack","date":"2019-08-29T21:52:57.530+0000","up_votes":1,"down_votes":0,"body":"I'm not saying the Attack Speed buff has to go away. You could reinstitute it in such a way that his niche becomes his ability to deal with tanks better than other assassins. This is what I thought of for a new passive:\n\nPassive: Waking Nightmare - Nocturne's abilities each apply a stack as can an auto attack every 4 seconds out of combat. At three stacks a mark appears that, if left alone, will gradually slow the champion until they fall asleep and the mark disappears. If the champion is dealt damage while the mark is active, however, then the mark is consumed and Nocturne gains a 50 - 110% attack speed buff for 5 seconds scaling with level.","replies":[{"poster":"Prince Ephraim","date":"2019-08-30T18:14:04.143+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackKnightJack,realm=NA,application-id=A8FQeEA8,discussion-id=H0g9bOgO,comment-id=000000000000,timestamp=2019-08-29T21:52:57.530+0000)\n>\n> I'm not saying the Attack Speed buff has to go away. You could reinstitute it in such a way that his niche becomes his ability to deal with tanks better than other assassins. This is what I thought of for a new passive:\n> \n> Passive: Waking Nightmare - Nocturne's abilities each apply a stack as can an auto attack every 4 seconds out of combat. At three stacks a mark appears that, if left alone, will gradually slow the champion until they fall asleep and the mark disappears. If the champion is dealt damage while the mark is active, however, then the mark is consumed and Nocturne gains a 50 - 110% attack speed buff for 5 seconds scaling with level.\n\nSo if I'm understanding it correctly, if Noc hits an enemy, then after 12 seconds if he basic attacks then he gains attack speed, but if not then they fall asleep, wich seems neat? But also really slow. Unless each auto applies a stack too. in which case it would be Okay. But the other part of it would simply never be used. Since it would be too easy to just hit for a 4th time accidentally, or just allowing them to flash over a wall or get away. I like putting the attack speed on the reworked E, because it allows Nocturne the ability to save it for chasing down a flash or dash away, or using it early or immediately to start a fight off strong, since it would also grant a little bit of cc which could interrupt something while Noc gets a few hits in.","replies":[{"poster":"BlackKnightJack","date":"2019-08-30T22:54:07.688+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Prince Ephraim,realm=NA,application-id=A8FQeEA8,discussion-id=H0g9bOgO,comment-id=0000000000000000,timestamp=2019-08-30T18:14:04.143+0000)\n>\n> So if I'm understanding it correctly, if Noc hits an enemy, then after 12 seconds if he basic attacks then he gains attack speed, but if not then they fall asleep, wich seems neat? But also really slow. Unless each auto applies a stack too. in which case it would be Okay. But the other part of it would simply never be used. Since it would be too easy to just hit for a 4th time accidentally, or just allowing them to flash over a wall or get away. I like putting the attack speed on the reworked E, because it allows Nocturne the ability to save it for chasing down a flash or dash away, or using it early or immediately to start a fight off strong, since it would also grant a little bit of cc which could interrupt something while Noc gets a few hits in.\n\nIf Nocturne does his combo on a champion then they get a mark that gradually slows them over 3 or 4 seconds then puts them to sleep at the end of it. If they take additional damage with the mark on them before then the mark goes away and Nocturne gains an attack speed steroid so that he has a chance to finish them off with a flurry of basic attacks.","replies":[]}]}]}]}]}]}