{"poster":"Marcondirondello","date":"2016-03-21T15:06:46.092+0000","title":"Bug passiva di Kindred ( ? )","subforum":"Campioni e gameplay","up_votes":1,"down_votes":4,"body":"Questa settimana &egrave; stato in rotazione gratuita il champ {{champion:203}} , facendo alcune partite ho notato una cosa alquanto strana ( secondo me ) : a un certo punto la passiva di Kindred marchia il Barone Nashor. mi sembra molto strana questa cosa dato che , mentre gli altri mostri possono essere uccisi facilmente anche da soli, il barone &egrave; un obbiettivo che coinvolge tutta la squadra e non &egrave; detto che in tutte le partite si uccida un barone, questo rischia di bloccare il gioco ( dal tuo punto di vista ) perch&egrave; ti impedisce di collezionare marchi se non per mezzo dell&#039; altra parte di passiva ( quella che coinvolge i campioni nemici ).se non &egrave; un bug mi sembra una cosa orribile per kindred perch&egrave; pu&ograve; randomizzare il marchio sul baron anche al minuto 20 e il barone in linea di massima non si riesce a ucciderlo cos&igrave; presto. Se invece &egrave; un bug amen, spero lo fixino il prima possibile, Rito fix your shit. ditemi se siete pi&ugrave; informati se &egrave; effettivamente un bug o no cos&igrave; mi metto l&#039;anima in pace.\r\n\r\ngg","replies":[{"poster":"Kopoo","date":"2016-03-21T15:17:32.912+0000","up_votes":3,"down_votes":0,"body":"Dalle patch notes della patch 5.22:\n\n\"Passiva - Marchio dei cacciatori\n** Novità:** DANNI FISICI CONTRO I MOSTRI Limite di 75 (+10 a carica)\nINTIMIDAZIONE Non indica più 1 carica sulla barra dei buff quando hai 0 cariche\n**Novità:** MESSAGGERI DELLA MORTE **Raggiunte 6 cariche, il Lupo dà la caccia al Barone Nashor e al Messaggero della Landa invece di fermarsi** \"\n\nPrima dell'update, il lupo smetteva di cacciare dopo le 6 stacks, ora invece marchia il barone/messaggero della landa.","replies":[]},{"poster":"NiraBlade","date":"2016-03-21T15:10:25.053+0000","up_votes":2,"down_votes":0,"body":"Nope è una cosa voluta, introdotta una o due patch dopo la sua uscita. C'é però sempre stato il limite di 6 stacks per i campi della giungla.","replies":[]},{"poster":"Re Sombra","date":"2016-03-21T16:37:19.093+0000","up_votes":1,"down_votes":0,"body":"non è un bug; è un bilanciamento che è stato apportato tempo fa.","replies":[]}]}