{"poster":"Dayvigilante","date":"2015-07-18T03:40:23.205+0000","title":"[Champion Concept] Bastion - The Inspired Inventor","subforum":"Concepts & Creations","up_votes":9,"down_votes":1,"body":"**Role**: Marksman, Mage\n\n**Appearance**: Average height man with blonde hair wearing a large robe, presumably hiding many gadgets. Very animated in movements and has a cheery demeanor.\nhttp://orig08.deviantart.net/11b4/f/2012/291/3/5/inventor_by_duelisto-d5i5sxk.jpg\nShredders would look something like this: http://www.entertainmentearth.com/images/AUTOIMAGES/WC9286lg.jpg\n\n**Lore**: Ever since Bastion was very young, he loved to tinker with all kinds of gadgets. Feeling constrained in his village, and wishing to learn about the world, he started traveling around Runeterra. In his travels he came across Piltover. He reveled in their technological displays, and took a special liking to Heimerdinger, the yordle quickly becoming his idol. He worked incessantly on his new military breakthrough; Hextech Shredders. After a while, he decided to join the league to both field test his new invention and get closer to Heimerdinger and the scientific community at large.\n\n**Strengths**: High sustained damage output, Strong teamfighting\n\n**Weaknesses**: High skill cap, No mobility\n\n**Plays most like...**: {{champion:6}} {{champion:126}} {{champion:15}} \n\n**Auto Attack**: Throws a proto-type Shredder, which is just a small saw-blade.\nRange: 500 \n\n**Passive - Hypervelocity** - http://www.hiveworkshop.com/forums/resource_images/16/icons_15766_btn.jpg\nThe missile speed of Bastion&#039;s abilities and basic attacks will scale with level. Due to how his Hextech Shredders work, this also increases their effective range. \n*The increased speed of Bastion&#039;s basic attacks will not increase his Attack Speed.*\n\n**Q - Hextech Shredder** - http://www.hiveworkshop.com/forums/resource_images/18/icons_17327_btn.jpg\nBastion throws one of his signature Hextech Shredders. The blade flies in a straight line, dealing physical damage to any units it hits. The blade will bounce off of walls and flux walls. Every bounce will charge the blade, causing it to do additional magic damage. The blades fly without bouncing for 2 seconds (600-1200 range), every bounce will reset this timer, although the blades stop after hitting a wall after (4/4/5/5/6) bounces.\nMana Cost: 40\nCooldown: 3\n\n**W - Energy Dispersion** - http://www.hiveworkshop.com/forums/resource_images/8/icons_7823_btn.jpg\nBastion triggers the secondary function of his Shredders, causing the closest one to his cursor to erupt into three separate smaller blades made completely of energy that travel along the original trajectory and 30 degrees to the left and to the right. Each blade deals 40/45/50/55/60% of the main shredder&#039;s damage, and deals it in entirely magic damage. Secondary blades are only able to bounce once before stopping.\nPassive: Bastion&#039;s Shredders gain a secondary improvement based on many times they have bounced off of walls or flux walls.\n1 Bounce or more: Briefly slows enemies by 20/25/30/35/40%\n2 Bounces or more: Grants Bastion 20 Mana on each enemy champion, large monster, or epic monster hit.\n3 Bounces or more: Stuns for 1/1.25/1.5/1.75/2 seconds on hit.\nMana Cost: 60/55/50/45/40\nRange: 1000\n\n**E - Flux Wall** - http://www.hiveworkshop.com/forums/resource_images/13/icons_12773_btn.jpg\nBastion lays down a wall of energy. Hextech Shredders will bounce off of this wall, and enemies that move through it take magic damage and are briefly stunned. (0.5/0.6/0.75/0.85/1 seconds)\nMana Cost: 80\nRange: 700\nDuration: 6/7/8/9/10\nCooldown: 18\n*Upgrades also increase the wall&#039;s width*\n\n**R -  Quantum Battery** - http://www.hiveworkshop.com/forums/resource_images/7/icons_6899_btn.jpg\nBastion unveils his latest invention, empowering the next ability he uses. Reactivating the ultimate will cancel it, putting it on a 10 second cooldown.\n**Hextech Shredder**\nThe next Hextech Shredder Bastion throws will last an incredibly long time (10/15/20 minutes) with unlimited bounces. However its bounce empowerment effects will not be permanent, and will reset if it flies through the air for 2 seconds without bouncing. \n*There cannot be more than three Shredders flying around the map. Upon throwing the fourth, the oldest will stop.*\n**Energy Dispersion**\nThe next dispersion will be especially violent, and will split the shredder into 12 smaller blades all around its current location, additionally dealing moderate magic damage to a small area around the affected Shredder.\n**Flux Wall**\nThe Flux Wall will become impassable by enemies, additionally any shredders bouncing off of it will gain (2/3/4) improvements (as if they had bounced off a wall) instead of 1.\nMana Cost: 100\nCooldown: 200/180/160\n\n**Champion Select** - \"Field test #136 is ready to commence.\"\n**Moving**\n\"So much to learn!\"\n\"Alright!\"\n\"If I stand here... then...\"\n\"An advantageous position.\"\n**Attacking**\n\"In the name of science!\"\n\"I&#039;ll put these spare parts to use\"\n\"This really isn&#039;t what I&#039;m here for, you know.\"\n\"These prototypes should suffice.\"\n\"This lacks finesse.\"\n**Taunt** -  Idly spins a shredder around\n\"Your weapons could never compare to mine.\"\n**Joke** - Starts juggling shredders\n**Laugh** - Tries to hold in a laugh and fails with a long burst of laughter.\n\nFriends - {{champion:74}} {{champion:161}} {{champion:222}} \nEnemies - {{champion:27}} {{champion:36}} \n\nThanks for reading! As always, I really appreciate any comments, corrections or criticisms.","replies":[{"poster":"FlameHalbrdOkido","date":"2015-07-19T16:06:37.127+0000","up_votes":2,"down_votes":0,"body":"I don't really know what to say here. But good job there is a lot of dedication put into this concept that is very appArent keep up the gud work","replies":[]},{"poster":"Riot Lutzburg","date":"2015-07-25T19:28:24.777+0000","up_votes":1,"down_votes":1,"body":"Nice concept.  I can't help but notice that you borrowed my formatting style for it, too.  :p","replies":[{"poster":"Dayvigilante","date":"2015-08-03T07:15:08.200+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=uoclf0kE,comment-id=0006,timestamp=2015-07-25T19:28:24.777+0000)\n>\n> Nice concept.  I can't help but notice that you borrowed my formatting style for it, too.  :p\n\nThanks, I like your work and your formatting style, so I decided to use it. I hope you don't mind.","replies":[{"poster":"Riot Lutzburg","date":"2015-08-03T23:39:14.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dayvigilante,realm=NA,application-id=A8FQeEA8,discussion-id=uoclf0kE,comment-id=00060000,timestamp=2015-08-03T07:15:08.200+0000)\n>\n> Thanks, I like your work and your formatting style, so I decided to use it. I hope you don't mind.\n\nI don't mind at all!  Feel free to use it for any future concepts you design.  :)","replies":[]}]}]},{"poster":"Tritus1","date":"2015-07-25T19:51:06.050+0000","up_votes":1,"down_votes":1,"body":"This is a great concept. As it is, Bastion would actually be a great jungler. At level two he could E in front of the jungle camps, throw a q and have a great source of damage. I am not a fan of the stun on E. i think a slow would be more fitting, similar to karthus. Adding a 2 charge system on it would also be interesting. Bastion could effectively \"wall\" a lane and increase his chance of landing a stun. Just a thought. Great work. I'd love to see something like this.","replies":[{"poster":"Dayvigilante","date":"2015-08-03T07:18:47.511+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Tritus1,realm=NA,application-id=A8FQeEA8,discussion-id=uoclf0kE,comment-id=0007,timestamp=2015-07-25T19:51:06.050+0000)\n>\n> This is a great concept. As it is, Bastion would actually be a great jungler. At level two he could E in front of the jungle camps, throw a q and have a great source of damage. I am not a fan of the stun on E. i think a slow would be more fitting, similar to karthus. Adding a 2 charge system on it would also be interesting. Bastion could effectively \"wall\" a lane and increase his chance of landing a stun. Just a thought. Great work. I'd love to see something like this.\n\nThanks, I had his jungling in mind as well when I was designing this concept. As for the E, I opted for a small stun because it still allows him to get away from enemies, especially more mobile enemies, without being too similar to Karthus's E, and also helps less against persistent bruisers, which I wanted to be a weakness intentionally. Oddly enough, this champion would have trouble in Mid Lane because of the lack of walls, so top, support or ADC would even be a stronger pick. I wanted the champion to have to utilize natural walls, and have the E as either an escape or an enhancer (to proc the stun). Either way thank you so much for your feedback.","replies":[]}]},{"poster":"Dayvigilante","date":"2015-07-20T04:20:08.287+0000","up_votes":1,"down_votes":1,"body":"Bump","replies":[]},{"poster":"Wind Whistler","date":"2015-07-18T19:55:54.200+0000","up_votes":1,"down_votes":1,"body":"You definitely put a lot of work into this, and I say it's pretty good, but the lore is pretty bad. There's hardly any conflict in it and it's pretty boring in my opinion. Not that Riot cares about the lore much, but still. Good champion concept. Also mind telling me why he's allies with Vel'Koz and Jinx?","replies":[{"poster":"Dayvigilante","date":"2015-07-18T21:03:40.614+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Wind Whistler,realm=NA,application-id=A8FQeEA8,discussion-id=uoclf0kE,comment-id=0003,timestamp=2015-07-18T19:55:54.200+0000)\n>\n> You definitely put a lot of work into this, and I say it's pretty good, but the lore is pretty bad. There's hardly any conflict in it and it's pretty boring in my opinion. Not that Riot cares about the lore much, but still. Good champion concept. Also mind telling me why he's allies with Vel'Koz and Jinx?\n\nLore isn't much of a strong point of mine; I usually come up with the kit first then the lore, just as something to tie it all together. I figure I'd put as much effort into my lore as riot does theirs.\n\nThe allies all have to do with technology, weapons specifically. He admires {{champion:161}} and {{champion:222}}, albeit for different reasons. He also finds {{champion:27}} and {{champion:36}}'s use of technology deplorable, and generally has a lot of distrust for Zaun.","replies":[]}]},{"poster":"Mpk22","date":"2015-07-18T14:18:31.063+0000","up_votes":1,"down_votes":1,"body":"Good Idea, the champion looks a little bit similar to singed but he is a enemy.... but anyways I think there should be some changes to his skills. His ultimate is quite good but for example his Q, it sounds OP but the mana cost is low and ONLY has 3 seconds of cool down! Gnar's Q maxed level is 2 seconds but 3 seconds? But good idea overall.","replies":[]},{"poster":"Nareik Yukiboshi","date":"2015-07-18T07:16:20.090+0000","up_votes":1,"down_votes":1,"body":"i like the conept even though comming it i was like \"why another inventor\"...but i really do like it...~~a lot more then I like heimer~~ though i feel e needs a bit of work...i fell it's just a little wierd though i can see it working...just feels too much like karthus...an added feature i'd like to see is that it bounces off projectile eaters, braum and yasuo's wall...though yasuo's wall would maybe stop it...but with out the techinaclities just have them more walls...because...you know...geometery...also why are vel and jinx friends...vel would want to \"eat\" him and his stuff...and jinx would want to destroy it...and i used alot of \"...\" again didn't i?...oh wanted to note i really like the idea on his passive...missile speed increase is always good...but he also has very little early game...just up my alley","replies":[]},{"poster":"DriftThruTheRift","date":"2015-07-18T04:01:49.513+0000","up_votes":1,"down_votes":1,"body":"i like it a lot tbh i like how since you said he idolized heimer that you created a similar ability kit to his but with obviously your own abilities. As for the abilities itself i think thats kind of unique how it bounces of objects. So if it hits an enemy champion does it go away or just bounce off of them?","replies":[{"poster":"Dayvigilante","date":"2015-07-18T04:08:47.687+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Cystonic,realm=NA,application-id=A8FQeEA8,discussion-id=uoclf0kE,comment-id=0000,timestamp=2015-07-18T04:01:49.513+0000)\n>\n> i like it a lot tbh i like how since you said he idolized heimer that you created a similar ability kit to his but with obviously your own abilities. As for the abilities itself i think thats kind of unique how it bounces of objects. So if it hits an enemy champion does it go away or just bounce off of them?\n\nIt goes through anything except walls (including his own generated walls AND walls like Jarvan's and Azir's) Glad you like it.","replies":[]}]}]}