{"poster":"Oo Richelle oO","date":"2015-02-01T23:42:37.016+0000","title":"Busco chicos/as","subforum":"Nuevos jugadores","up_votes":3,"down_votes":2,"body":"Hola soy nivel 12 y busco chicos/as que recien empiezan con quien jugar, subir de nivel, aprender y sobre todo divertinos n.n. Si hay alguien interesado agreguenme. estoy por la tarde noche por lo general. Gracias por leer~ :)","replies":[{"poster":"xDarky","date":"2015-02-03T17:48:31.487+0000","up_votes":2,"down_votes":0,"body":"Buenas, soy nivel 15, no se si sirva >","replies":[]},{"poster":"tansaurio","date":"2015-02-02T12:45:04.695+0000","up_votes":2,"down_votes":1,"body":"yo soy nuevo soy lvl 16 juguemos ;)","replies":[]},{"poster":"foxMichael","date":"2015-02-27T17:02:30.760+0000","up_votes":1,"down_votes":0,"body":"Buenas soy 30, tenemos un grupo muy entretenido que juega solo de tarde y noche, los viernes jugamos hasta como las 4 de la mañana, solo acepta mi invitacion que ya te mande (foxMichael) y descarga raidcall para que puedas combersar con nosotros.\n\nPD: raidcall se descarga de aqui: http://www.raidcall.es/\n\ny nuestra pagina en facebook es: https://www.facebook.com/pages/Might-Night-Champions/1543400649258453?fref=ts","replies":[]},{"poster":"TSM Durex","date":"2015-02-18T22:48:33.003+0000","up_votes":1,"down_votes":0,"body":"Buenas,  te puedo enseñar un poco si quieres ya que eres nuevo en esto, soy lvl 30 pero jugamos juntos en mi smurf\nDiviertete y no te vicies tanto jajaja {{item:3151}}","replies":[]},{"poster":"Nyán","date":"2015-02-10T23:23:41.471+0000","up_votes":1,"down_votes":0,"body":"Agregame ^-^ Tengo una amiga nivel 12, tal vez podamos jugar todos juntos.","replies":[]},{"poster":"Oo Richelle oO","date":"2015-02-07T05:15:49.473+0000","up_votes":1,"down_votes":0,"body":"gracias por las respuestas, por lo pronto sigo practicando por eso es lo de agregar chicos nivel bajo, eh estado viendo muchos videos ewe y la verdad ya me manejo bastante bien, a pesar que la cuenta me la creo un amigo y su mejor consejo fue \"compra lo que dice la tienda y juega\" ewe... pero ahora entiendo bastante, ya habia jugado otros juegos, no de este tipo, pero creo que = ayuda algo :B...","replies":[]},{"poster":"Sergioburgit","date":"2015-02-05T11:17:18.234+0000","up_votes":1,"down_votes":0,"body":"Hola,me gusto el post porque me parecio atractivo jugar con alguien nuevo en el juego en mi caso me enseñaron a jugar mis amigos de colegio me pareceria bonito enseñarte a jugar me agregas me conecto en la Noche,saludos.","replies":[]},{"poster":"criissxx","date":"2015-02-04T23:31:45.228+0000","up_votes":1,"down_votes":0,"body":"Hola buena soy lv 23 y me gusta divertirme si quieren agregen para jugar una buenas partidas \nSuerte atodos","replies":[]},{"poster":"MAD Schwi","date":"2015-02-04T11:56:44.449+0000","up_votes":1,"down_votes":0,"body":"hola soy lvl30 y si quieres te puedo dar consejos de champ,como jugar etc... si queres jugamos nose si servira pls contasta D:{{champion:157}}","replies":[]},{"poster":"magnetico1","date":"2015-02-03T02:07:51.768+0000","up_votes":1,"down_votes":1,"body":"aun queda gente nueva en el lol y no solo smurf :D cada dia somos mas jaja","replies":[]},{"poster":"Juanchox117","date":"2015-02-02T00:33:04.950+0000","up_votes":1,"down_votes":1,"body":"soy lvl 23, si queres me podes agregar y jugamos","replies":[]},{"poster":"Efezto","date":"2015-02-02T00:18:33.059+0000","up_votes":1,"down_votes":1,"body":"Puedo ayudarte con la itemizacion, conceptos basicos,  posicionamiento, campeones, y cualquier duda que te surja jugando algo nuevo.\n\nDe por si, te aviso que te centres en conocer todos los campeones. Master yourself, master your enemy. Al principio va a ser frustrante, no saber contra que te estas enfrentando, en especial cuando jugas contra Trynda con primera vez, y no entendes porque no muere.","replies":[]},{"poster":"Judas Traidor","date":"2015-02-01T23:56:29.701+0000","up_votes":1,"down_votes":1,"body":"También puedes buscar tutores, dado que ahora este servidor rara vez encuentras a alguien que sea nuevo.\n\nSaludos","replies":[]},{"poster":"ChristianDS","date":"2015-02-03T04:38:45.359+0000","up_votes":1,"down_votes":2,"body":"Hola, yo solo puedo ofrecerte si queres jugar conmigo en mi cuenta smurf, que es nivel bajo porque en la otra ya soy nivel 30, si queres te puedo dar consejos, mi nombre es ChristianDS","replies":[]}]}