{"poster":"Bipolar","date":"2015-11-03T04:56:14.364+0000","title":"Replace Blind Pick with Draft.","subforum":"Miscellaneous","up_votes":12,"down_votes":2,"body":"Everyone wins.","replies":[{"poster":"Zorphiax","date":"2015-11-03T07:36:06.499+0000","up_votes":2,"down_votes":1,"body":"I agree with this thread. But, unfortunately we need more Summoners playing more, so that we have a larger community and can enjoy short que timers instead of like 20 min que timers.\n\nP.S. first tread I have ever agreed with you.","replies":[]},{"poster":"Your Neighbour","date":"2015-11-04T11:53:53.134+0000","up_votes":1,"down_votes":0,"body":"10 upvotes, much overwhelm in OCE","replies":[]},{"poster":"JasonWazza","date":"2015-11-03T09:16:59.360+0000","up_votes":1,"down_votes":5,"body":"They are too busy giving us sidebar links to NA boards.","replies":[{"poster":"Klavinmour","date":"2015-11-03T16:28:48.769+0000","up_votes":3,"down_votes":2,"body":"Yeah, once again you're totally on point.\nYup, a simple PR thing is why they can't make a client change.\n\nJust like the Skin Team takes money and time away from the Balance Team.","replies":[{"poster":"JasonWazza","date":"2015-11-03T18:01:58.939+0000","up_votes":1,"down_votes":1,"body":"But it's not a client change, what we are asking for is them to flip a switch and turn Draft back on, not to fucking remodel the home page for OCE league client.","replies":[{"poster":"Klavinmour","date":"2015-11-03T21:34:50.829+0000","up_votes":1,"down_votes":0,"body":"And this discussion has been done to death already over the past two years.\n\nBlind Pick CAN NOT be removed, it has to stay on permanently.\n\nYou can not replace Blind Pick with Draft Pick in order to make the queue times be low.\nRioters promised us recently that they will look into providing a test run of Normals Draft Pick, since the vocal majority (which is a community minority, since people who don't care either way make up the real majority and they never actually post) keep saying \"We'll all play Draft more than Blinds, the server has existed for three years, we don't have any data but because we say so the server population can sustain another queue\".","replies":[{"poster":"JasonWazza","date":"2015-11-04T01:52:10.700+0000","up_votes":1,"down_votes":0,"body":"As a note i'm not saying blind pick should be turned off, i'm just saying draft pick should be turned on.\n\n>since the vocal majority (which is a community minority, since people who don't care either way make up the real majority and they never actually post)\n\nJust as a point while this may be true, think about how many people will actually like having bans again, cause i damn will.\n\nAnd i also never said we'd play draft more or any of this, i've just being saying that TB was kept up with queue times that were unusable, Draft was dropped with queue times off peak of around 10 minutes.","replies":[{"poster":"Klavinmour","date":"2015-11-04T02:12:19.684+0000","up_votes":1,"down_votes":0,"body":"> And i also never said we'd play draft more or any of this, i've just being saying that TB was kept up with queue times that were unusable, Draft was dropped with queue times off peak of around 10 minutes.\n\nAnd again you're saying this without access to Riot's data. You have no proof that Draft Picks queue times were better than Team Builders.\n\nBut this is pointless anyways, we aren't getting Draft Pick ever now. We will be getting the new queue that replaces Draft Pick in order to test it and likely Riot will decide if it stays or not based on the support it gets during the testing period.","replies":[{"poster":"JasonWazza","date":"2015-11-04T02:20:54.235+0000","up_votes":1,"down_votes":0,"body":"I think you misinformed in several areas.\n\n1. Back when draft was up, there was actually several ways to data mine average queue times (not sure if this still exists but i wouldn't know i didn't keep up with that)\n2. Team builder was trash, we had a post showing a 3 hour queue in video, i'd personally tried it several times with even meta supports to get nothing, DRAFT ACTUALLY HAD QUEUES POP.","replies":[{"poster":"Klavinmour","date":"2015-11-04T02:55:15.936+0000","up_votes":1,"down_votes":0,"body":"Longest I or any of my friends spent in TB to get a full lobby was roughly 7 minutes.\nOn average it would take 3-4 minutes.\nAnd this is while being very picky and kicking or not accepting people we didn't want on a team. (Personally I made sure we never had a Vayne)\n\nI can't think of any situation other than you deliberately mismatching MMR in order to extend queue times where you'd end up with 3 hours.\n\nData mining queue data has been limited quite a fair bit, I don't remember the details but Riot made it impossible to use sites like lolking to find information on current games, if the site didn't use the client Riot specified.","replies":[]}]}]}]}]},{"poster":"LemonHunter","date":"2015-11-03T21:30:47.769+0000","up_votes":1,"down_votes":0,"body":"The reason they aren't activating other queues at this time (as stated by Rioters in the past) is because the population on the OCE server isn't big enough to give good queue times for more than we have now. The population of the server needs to increase before more become available.","replies":[{"poster":"JasonWazza","date":"2015-11-04T01:54:12.816+0000","up_votes":1,"down_votes":0,"body":"Which is as bullshit now as it was when they disabled draft.\n\nFact is if they can keep TB running with queue times that didn't start games, FOR SEVERAL MONTHS they can activate Draft which had times of 10 minutes at worse.","replies":[]}]}]},{"poster":"Talon12","date":"2015-11-04T02:43:10.033+0000","up_votes":1,"down_votes":0,"body":"they are making a client change... A re-haul of it all for next season. Also going to get the ability to finally work off for free skins.\n\nClient, ui, champ select, everything is getting redone to match the new in game hud","replies":[]},{"poster":"Olee","date":"2015-11-03T21:37:42.920+0000","up_votes":1,"down_votes":0,"body":"A new client is all I want for Christmas","replies":[]}]}]},{"poster":"Talon12","date":"2015-11-04T02:42:35.191+0000","up_votes":1,"down_votes":0,"body":"everyone wins? a lie if i have ever heard 1. What about the people who play blind pick so they can play a game where their champ isn't banned/taken by enemy/purposely counter picked, a draft mode along with blind would be agreeable, but replacing it wouldn't work, some people wan't games where its anything goes. The only problem people have with blind pick is picking lanes without people stealing it.","replies":[]},{"poster":"Roguestoney","date":"2015-11-03T20:23:37.350+0000","up_votes":1,"down_votes":0,"body":"I would actually love for draft mode to come back. so much more fun than blind and ranked most of the time.","replies":[]},{"poster":"Chicken4dinner","date":"2015-11-04T09:14:13.286+0000","up_votes":1,"down_votes":1,"body":"I honestly don't know if it would work, there are billions of people out there who still think that only Asia occupies the pacific... if OCE made a large enough impact on a worldly scale and brought attention to league within the server region then maybe","replies":[]},{"poster":"BarryButcher","date":"2015-11-03T05:09:29.837+0000","up_votes":3,"down_votes":3,"body":"no because then some champions will always be banned in both ranked and normals and people will have no game mode to play the \"OPs\"","replies":[{"poster":"Klavinmour","date":"2015-11-03T05:12:31.741+0000","up_votes":2,"down_votes":3,"body":"You should never play a champ just because it's FOM or considered OP.","replies":[{"poster":"BarryButcher","date":"2015-11-03T05:42:50.194+0000","up_votes":2,"down_votes":2,"body":"in a normal? why not? its a freaking game LOL","replies":[]}]}]},{"poster":"LemonHunter","date":"2015-11-03T05:22:37.968+0000","up_votes":1,"down_votes":1,"body":"Unfortunately this wouldn't work. Blind pick does offer a different, more relaxed game type as opposed to ranked. Completely getting rid of it isn't the best option. The main thing we need to do is try to get our friends playing and increase the number of players in our region, then other queues will become available :)","replies":[]}]}