{"poster":"ReturnedFromNA","date":"2019-06-07T12:13:22.801+0000","title":"[Player-Made Champion Concept] Kaiden - The Siegebreaker","subforum":"Player Creations","up_votes":3,"down_votes":0,"body":"[](https://i.imgur.com/TVxK6YA.jpg)\n\n**Kaiden - The Siegebreaker**\n\nhttps://i.imgur.com/Kbyv0vN.jpg[/img]\n\n***\n\n**Contents:**\n\n- Champion Lore\n- Champion Abilities \n- Creator Notes\n\n***\n\n**Kaiden's Lore:** About Kaiden\n\nKaiden is a hunter living on the outskirts of the Noxian homeland. Before a hunter however, he was - and still is - a soldier in the Noxian army. Known as \"Siegebreaker\", Kaiden was able to shatter the advance of whole battalions before him. Many victories had earned him strength, strength had earned him power, and power had bought him freedom. Now he was only called in Noxus' defence when needed, but only *(as stressed by Kaiden)* in the most dire of situations.\n\nA bear of a man, Kaiden stood at over 6 and a half feet tall. He first earned his keep as Siegebreaker when he picked up a shatter ballista in one sweep and fired it like a crossbow. Raining stake after stake down upon the hordes of enemy soldiers was a fearsome sight, and turned the battle when almost all siege defensive equipment had been destroyed. Gifted with a bow that seems even too big for a man of Kaiden's size, the Siege Bow stands at 6 feet tall and weighs almost as half as Kaiden. The arrows are bigger than most farmers' forearms, and are more stakes than anything else. A signature weapon. Everyone who sees the bow followed by a giant of a man knows to steer clear and give him some room to work. \n\n(Below is a concept for his bow; the first one would replace the blue-green flame with orange fire effects and the metal would be less brass and more gray steel. The second one is a bit more metal and chains.)\n\nhttps://i.imgur.com/wHMHMt6.jpg[/img] https://i.imgur.com/cWP8RzN.jpg[/img]\n\n**Kaiden's Lore:** The Front\n\n*Kaiden closed his eyes and breathed in. The smoked that curled through the air shot down into his lungs, bringing the charred smell of scorched earth and stone with it. There was a vast layer of scents in the air that assaulted his senses, telling a story of the landscape before him. The cold in the air bought with it a sharp perspective as the icy wind and acrid smoke mixed in his chest. With his eyes closed, he reached out with his ears to see what lay before him.*\n\n*The rustling of leaves filled his ears as a breeze sifted through the leaves upon the canopy, all but deafening in the still of the land. One who would look at such a landscape would almost call it barren due to the absence of movement  within the scrub. However, to those who lived and breathed among the forest, this was just an illusion. The faint scratch of paws upon the dirt, the downbeat of wings from high in the treetops, the slow march of an insect trail down the bark of a tree all told a story of what lay among the woodlands: Life. One who knew this well did not even need to open their eyes to see the vast landscape of life before them.*\n\n*The faint snapping of a branch in the woods brought Kaiden's attention around, yet he did not move a single muscle nor open one eye. Judging by the heavy footfalls among the forest floor, the large game was greater than that of a small critter. Whether it be an elk or a doe was hard to say, for Kaiden's eyes were still shut to the world around him. The creature kept moving ever to tentatively forward, oblivious to the man standing mere feet away. Slowly, with his eyes still closed, Kaiden nocked an arrow, raised his bow and took aim. The creature stopped, whether sensing danger or just smelling the air was hard to tell. The cold air eddied around its nostrils as it took in all the scents of the forest, trying to sense anything out of place in the wilderness. Kaiden released his breath, and with it the arrow.*\n\n*Kaiden followed the path of the arrow through the air, the slipstream of wood and feather creating a different tone than that of the breeze surrounding him. He followed its path to the moment it found its mark, and remarked at the short gasp and heavy thud of the body crashing to the ground. Sighing, Kaiden opened his eyes to the world for the first time in what seemed forever. Gone were the fields of forests before him, and with it the movement of life among the scrub. A barren wasteland of carnage greeted his sight as smoke mingled with the cold fog that layered the battlefield before him. He remarked at how truly lifeless this land was.*\n\n*Siege fires littered the landscape, creating shadows among the fog. The mist parted before him, opening up to reveal the heavy armour of a horse before him. It ran directly towards him, bloodshot eyes telling of the frenzy it was in. Kaiden waited but a moment before the beast would trample him before stepping out of its path. Ahand snatched out and held firm to the horse's reins. If any normal man had attempted to grab a charging horse, they would have lost a shoulder for their worries at the least. However, Kaiden stood his ground and braced against the beast, feeling as the horse came up short from his rampage only to collapse on the ground. Kaiden quickly put an end to the beast's writhing and waited as the fight of it died out.*\n\n*Turning back to face the landscape before him, a sharp cry erupted out of the mist. Large shapes echoed through the fog, lit up and distorted by the fires lighting the landscape. Metal links and plates scraped together, seeming to create a wall of sound as it moved forward. The cry was taken up by many others, seeming to lose their pitch among the cacophony of voices and movement. Kaiden could not see the men near him, but sensed their apprehension at the approaching foes. Kaiden closed his eyes once more, hefting his great bow up into a readying stance. There was more hunting to be done before the day would be done, but such was the way of war.*\n\n***\n\n**Kaiden's Abilities:**\n\n**Note:** Regardless to his other stats, Kaiden's base attack range is 550.\n\n- **Innate Passive:** Siege Arrows / Assaultbreak\n- **First Ability:** Tether\n- **Second Ability:** Breach\n- **Third Ability:** Flush Them Out\n- **Ultimate Ability:** Ballistic Missile\n\nhttps://i.imgur.com/UBPv8vf.jpg[/img] **Innate Passive:** Siege Arrows / Assaultbreak\n\n- **Siege Arrows [Passive]:** Due to the arrows being the size they are, Kaiden's attack speed is halved and is capped at 1.250, but his base attack damage is increased by 35%. Also, Kaiden bolsters his siege arrows with upgrades which he chooses at levels 6/11/16. These upgrades include **Shrapnel, Combustive,** and **Flaring**. These can be chosen *(In a similar manner to Kha'Zix or Kai'Sa upgrades)* in any order, and apply to his basic attacks.\n\n- **Shrapnel** causes the arrow to splinter upon impact, dealing **20% (+1% per 30 bonus Attack Damage) (+2.5% every time** ***Ballistic Missile*** - **gains a level)** damage to enemies within 175 range of the initial target. \n- **Combustive** sets the target on fire, dealing **5 (+1 per 10 attack damage) (+5 every time** ***Ballistic Missile*** **gains a level)** magic damage per second over 4 seconds.\n\n- **Flaring** lights the target up with a magnesium flare, revealing them for up to **2.5 (+0.5 every time** ***Ballistic Missile*** **gains a level)** seconds.\n\n- **Assaultbreak [Passive]**: If an enemy comes within 175 (Melee) range of Kaiden, he can replace a basic attack with a shove that knocks the target back 350 range and dealing the damage of a normal basic attack. This is treated as an auto attack cancel, and has a set cooldown of **24 (-1 per champion level) seconds**. This is not affected by cooldown reduction.\n\nhttps://i.imgur.com/0gWWPTD.jpg[/img] **First Ability:** Tether\n\n- **[Active]:** Fire a siege arrow in a line up to 600 range, stopping upon hitting an enemy, large monster, or wall. Enemies struck take **20/50/80/110/140 (+45% Attack Damage)** physical damage. Tether can be reactivated within 3 seconds to fire a second shot, but hitting the same enemy twice reduces the damage of the second shot by 65%. \n- If two separate enemies are hit, they are pulled 200 range each towards eachother and are slowed by 20% for 2.5 seconds. Colliding together deals a bonus 20/25/30/35/40 (+30% Attack Damage) physical and raises the slow to 65%.\n- If one enemy and a wall are hit, the enemy is pulled 300 range towards the wall and is slowed by 20% for 2.5 seconds. If the enemy strikes a wall, they take 20/25/30/35/40 (+30% Attack Damage) bonus physical damage and are stunned for 1.25 seconds.\n- If two walls are struck, a tripwire trap is created for 5 seconds between the two points. Enemies attempting to dash through the tripwire take 60/100/140/180/220 (+75% Attack Damage) physical damage, stop dashing, and are stunned for 1.25 seconds.\n- Cooldown: 18/16/14/12/10s (after the first shot). \n- Mana Cost: 50/60/70/80/90 mana.\n\nhttps://i.imgur.com/H0AMO8l.jpg[/img] **Second Ability:** Breach\n\n- **[Active]:** Kaiden dashes in a line up to 350 range, nocks two powerful arrows to his bow and increases the attack speed of his next two basic attacks by 30/40/50/60/70%. Both effects lasts up to 6 seconds after dashing.\n- Both shots deal 12/24/36/48/60 bonus physical damage. If the same target is hit by both shots, the second arrow's bonus damage is converted to true damage and breaks their armour, lowering it by 20% for 4 seconds.\n- Cooldown: 12/11/10/9/8s (after dashing).\n- Mana Cost: 40/45/50/55/60 mana.\n\nhttps://i.imgur.com/vX4xTPd.jpg[/img] **Third Ability:** Flush Them Out\n\n- **[Active]:** Fire an arcing shot up to 900 range away over 0.25-0.75 seconds (Depending on distance). Upon landing it creates an area of fire around the landing arrow for 4 seconds (400 range diameter) that deals 30/45/60/75/90 (+0.4 Attack Damage, 0.4 Ability Power) initial magic damage and dealing a further 10/15/20/25/30 (+0.1 Attack Damage, +0.1 Ability Power) magic damage per second to enemies standing in the fire.\n- If the arrow strikes a bush, the whole bush is set on fire for 6 seconds and granting sight inside the bush for the duration. Enemies who are *Invisible* or *Camouflaged* inside the bush are not revealed.\n- Cooldown: 16/14.5/13/11.5/10s.\n- Mana Cost: 60/65/70/75/80 mana.\n\nhttps://i.imgur.com/k4WP6ki.jpg[/img] **Ultimate Ability:** Ballistic Missile\n\n- **[Active - First Cast]:** Kaiden plants his war bow in the ground, becoming unable to move. He loads a ballistic stake into the bow and begins aiming it in a direction. He pulls back on the string over 2 seconds, increasing the range from 600 to 1200/1350/1500 with a target cone width of 75 degrees at the edge. Kaiden can hold his bow for up to 5 seconds. If Kaiden does not fire the second shot, moves, or is interrupted, the cooldown of Ballistic Missile is set to 15 seconds.\n- **[Active - Second Cast]:** Kaiden releases the ballista stake in a line, striking through all non-champion enemies and stopping upon hitting an enemy champion or reachin maximum range. Enemies struck take 175/300/425 (+1.0 Attack Damage) physical damage, and the enemy champion struck is knocked up and back 150-450 range depending on how long the bow was charged for. The ballista stake gains the upgrade effects from Siege Arrows:\n- **Shrapnel:** The ballista explodes upon striking an enemy champion, dealing 80% damage to enemies within 250 range of the initial target and knocking them outward the same distance as the initial target.\n- **Combustive:** Enemies hit are set on fire, taking a bonus 40/60/80 (+0.25 Attack Damage, 0.25 Ability Power) magic damage and a further 15/30/45 (+0.15 Attack Damage, 0.15 Ability Power) magic damage per second for 4 seconds.\n- **Flaring:** Enemies hit are revealed for 6 seconds.\n\n***\n\n**Creator's Notes:** ReturnedFromNA\n\nWhen creating Kaiden, I first had this image of a man hefting a siege ballista and holding it as if it were a normal handheld weapon. I wanted to build around the theme of this big man with a bigger weapon, and turn it into a marksman worth fearing. A marksman that relies less on speed and finesse, and more on brutal strength - and who knows brutal strength better than Noxus?\n\nNow I will freely admit that the stats will not be balanced - that is to be expected. It was less about the individual stats and more about the overall playstyle of Kaiden. I wanted this man to be a marksman with impact, to be able to halt advances and counter-engage under his team's own terms. The tethers (A not very imaginative name admittedly) were a unique ability I fiddled with a bit. Although it might seem a bit wordy, the general gist was:\n\n- Unit vs unit: Smack them together (Like Zac)\n- Unit vs wall: Smack unit into wall.\n- Wall vs wall: Tripwire or Anti-dash/anti-engage tool\n\nIt was an ability to make him more versatile and help players think about what they would want out of Kaiden. Although Kaiden is big on counter-engages, he is still fragile as far as marksmen go. With little mobility, he needs a frontline to distract while he works around them. His low-range dash provides a small level of mobility, but in comparison to a Vayne - Tumble or Ezreal - Arcane Shift, it's limited (Range and Cooldown taken into consideration). However, it does allow small levels of positioning while providing outright, continuous damage which rivals or improves over the others.\n\nThe images provided (I'm ashamed to say) are not done by me. I wish I had artistic talent, but alas I just enjoy making concepts on paper. Here are the links to the pictures provided, and to those who play Warcraft 3 or visit Pintrest you might find some of them familiar too:\n\n- Kaiden Portrait: https://www.pinterest.nz/pin/675328906596431102/\n- Siege Bow 1: ***(Edit: I couldn't find the original picture! It was a pintrest picture, so feel free to have a search there. Sorry!)***\n- Siege Bow 2: https://www.pinterest.nz/pin/376472850094790148/\n- Siege Arrows: https://www.hiveworkshop.com/threads/btnflamelance.173859/#resource-59072\n- Tether: https://www.hiveworkshop.com/threads/btnridingcrop.223810/#resource-62846\n- Breach: https://www.hiveworkshop.com/threads/btnhunter02.213949/#resource-62260\n- Flush Them Out: https://www.hiveworkshop.com/threads/itchy-n-scratchy-pyro-dust.288282/#resource-68859\n- Ballistic Missile: https://www.hiveworkshop.com/threads/searing-arrows-moonhead-arrow.287956/#resource-68668\n\nTo those who came from NA to read this, hope you enjoyed it too!\n\nThanks for having a read, and I hope you enjoyed! \n\n- **ReturnedFromNA** (OCE)\n- **KIWl** (NA)","replies":[]}