{"poster":"Bultz","date":"2016-12-11T17:32:10.735+0000","title":"@Riot I do not feel any sympathy for the people asking for Yasuo nerfs.","subforum":"Gameplay","up_votes":2,"down_votes":11,"body":"There are so many champions in this game that have such an easy time kitting and whipping the floor with a team, that picking on a champion most players have not invested time to research, brings me not to care about anything they say. For the most part these people are requesting nerfs purely because they don&#039;t like playing against him. Not because he is toxic, not because he is broke, (He has a lower than 50% winrate), but because when they meet someone who invested his or her time into learning a champion and that person kills them, they get frustrated. They don&#039;t invest time to play Yasuo, very clear by his 13% play rate. They don&#039;t invest time to learn to counter him, of which I could link a 100 different Yasuo counter guilds. They don&#039;t invest time to learn which champions counter Yasuo, especially since he is just so easy to counter if you play well. \r\n\r\nGive me Brand, Ryze, and Talon on my team and it is almost a sure win. Their simple kits, combined with their over the top damage and utility just leaves them so over powered. But no one cries about them. I have literally 3v5ed as those three with my two m8s who play this game. They had never played the champions, and on their first try at them, they rekted. Now I love my mates, but they have gone 0/17 on champions such as garen, so they are learning and new. My point is there are so many champions in this game never addressed, which completely flatten yasuo. And I know someone will bring up, &quot;but Yasuo&#039;s mobility, blah blah blah&quot;. Listen that is what stuns are for, that is what counters are for. There are two items to protect yasuo against them and neither are worth the money since Scimitar&#039;s cool down is high, but it only counters one crowd control spell, and not chained cc. If you are playing a champion who can not stun Yasuo, or put him in any form of cc, such as annie, brand, ryze, etc can, It means Yasuo is probably meant to kill your type of champion. I see adc crying all the time about his windwall and his ease at killing them, well guess what! He is your counter, the only one you have. Shocking right? What other move can block your long range attacks? Nothing. As for those crying about his shield, which gives him 200 extra life, if you can&#039;t poke his shield, don&#039;t engage, ta da. It&#039;s like I just discovered America for you. If you can&#039;t handle that shield, it probably is a stupid idea to engage him at that moment to begin with. In a trade off between poking, Yasuo will lose. Poke his shield, then poke him, chances are early game he won&#039;t do any damage to you, or not near as much as you will to him. He wont engage as agro after that. If you are stupid enough to stand near the minions to fight him, that is your fault. That is his kingdom, stay out of his range, poke him. \r\n\r\nI feel no sympathy for people who have no actual argument for the nerfs other than, he is op. He is annoying. He is unkillable. Yet they have never once look at a guide or invested in learning anything to outplay Yasuo. On top of that, only wood-silver ranked people are complaining about him.  Every gold+ ranked player who I have talked to, says they rek Yasuo. Why is that because they invested time into the game and got good at it, where they don&#039;t fear a mobile champion who is easily countered. Give me one reasonable argument to nerf a champion who is at a 50% win rate.","replies":[{"poster":"GreenWithEnvee","date":"2016-12-11T18:14:29.087+0000","up_votes":3,"down_votes":0,"body":"Permaban him, problem solved","replies":[]},{"poster":"TyrekGoldenspear","date":"2016-12-11T17:38:28.819+0000","up_votes":1,"down_votes":1,"body":"CoughCoughBrandisntOPCoughCough","replies":[{"poster":"Bultz","date":"2016-12-11T17:47:40.044+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=TyrekGoldenspear,realm=NA,application-id=3ErqAdtq,discussion-id=NKEHJFZL,comment-id=0000,timestamp=2016-12-11T17:38:28.819+0000)\n>\n> CoughCoughBrandisntOPCoughCough\n\nLol Brand is so op, you must be high af.","replies":[{"poster":"TyrekGoldenspear","date":"2016-12-11T17:56:13.846+0000","up_votes":2,"down_votes":0,"body":"If you're the kind of guy that wants to charge down mid, all clumped up, and do this over and over instead of splitting and taking objectives, then yeah he's strong.\n\nHowever playing directly into a champion's niche != that champ is OP.","replies":[{"poster":"EndlessSorcerer","date":"2016-12-11T21:13:29.314+0000","up_votes":1,"down_votes":0,"body":"IIRC, that's how many Silver games play out.\n\nConsidering they are Silver, that doesn't surprise me.","replies":[]}]}]},{"poster":"Spicy Rice","date":"2016-12-11T17:47:45.692+0000","up_votes":1,"down_votes":0,"body":"No, but he is a good example of a champ that can win a teamfight by himself with minimal effort","replies":[{"poster":"TyrekGoldenspear","date":"2016-12-11T17:54:28.621+0000","up_votes":1,"down_votes":0,"body":"I wouldn't say minimal.\n\nRemembwr that his ult alone will cause at max two passive explosions.\n\nI need to W first, get close enough to E, and then R to get the maximum damage.\n\nOther than that, Brand is quite slow and his wave pushing is average among mages, requiring two spells instead of the usual one.\n\nTherefore, not grouping and splitpushing is effective against him, as he is a poor 1v1 fighter.\n\nTeamfighting is his niche, it's what he's meant for.\n\nNot my fault when the enemy wants to charge down mid over and over instead of splitpushing.","replies":[]}]}]},{"poster":"Shadòw","date":"2016-12-11T17:46:37.849+0000","up_votes":2,"down_votes":1,"body":"skill cap and winrate is no excuse.\n\nfor the same reason kalista and azir got nerfed.\nyasuo is just a frustrating shit champ. zed got nerfed for frustration, now let's do the same to this excuse of a champion.\n\nyou say that you can outpoke him early despite his shiels.\nthat's just pure BS. he gets a fcking free shield every few seconds and if you actually want to land something on him he always has Windwall too.\n\nso why shouldn't he get nerfed.. what doesn't he have?\nhe has mobility, utility, damage, cc, a free shield, no costs and no CDs on all spells but Windwall.\nYasuo is a perfect example for an overloaded kit.","replies":[{"poster":"Bultz","date":"2016-12-11T17:59:00.549+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Shadòw,realm=EUW,application-id=3ErqAdtq,discussion-id=NKEHJFZL,comment-id=0002,timestamp=2016-12-11T17:46:37.849+0000)\n>\n> skill cap and winrate is no excuse.\n\nYou say that because they are not in your favor, but in not fuckign stupid land, they do matter.\n \n> for the same reason kalista and azir got nerfed.\n> yasuo is just a frustrating shit champ. zed got nerfed for frustration, now let&#x27;s do the same to this excuse of a champion.\n\nYou not having the skill base needed to counter Yasuo, someone every easily countered doesn't mean he gets nerfs. Zed got nerfed because he was doing a shit ton of damage at all times of the game. Yasuo doesn't do near any damage from early to mid game. You crying about a champion you have no skill to play against doesn't justify nerfs, when he is clearly easy to counter froom from higher tier ranked players. \n\n\n> you say that you can outpoke him early despite his shiels.\n> that&#x27;s just pure BS. he gets a fcking free shield every few seconds and if you actually want to land something on him he always has Windwall too.\n\nYeah you fucking poke his shield then poke him, it's like fucking magic, but it is skill. His shield is down for nearly a minute of free poking. You bait both windwall and sjield and rek him. It is super easy, just because you can't doesn't mean others lack the skill.\n\n> so why shouldn&#x27;t he get nerfed.. what doesn&#x27;t he have?\n> he has mobility, utility, damage, cc, a free shield, no costs and no CDs on all spells but Windwall.\n> Yasuo is a perfect example for an overloaded kit.\n\nHe has no escapes other than minions, which if you are fighting him in his own kingdom, makes you stupid. He is easily ganked. Low hp, no mr, low armor. No counters to stuns and any form of cc. Mobility is easy to counter. His cc is low at best and easily avoided, depending heavily on other champions. A shield which drops from an auto attac.k, unlike morgana's, rivens, galio's etc. His attacks are basic attacks, meaning he needs no cd for it since it is the same as his regular move. His speed is needed since he has no escapes and is squishy. Not one time have I kitted a champion and killed him without him being super low hp. His damage is near none for 40 minutes of the game, unless your dumb enough to play into his game. Yasuo is balanced and is a slayer meant to have this kit.","replies":[{"poster":"Shadòw","date":"2016-12-11T18:12:40.187+0000","up_votes":1,"down_votes":1,"body":"> You say that because they are not in your favor, but in not fuckign stupid land, they do matter.\n\nhttp://na.leagueoflegends.com/en/news/game-updates/gameplay/data-and-champion-balance-part-1\n\n> win rate is an imperfect measure of power because it’s conflated with player skill\n\n---\n> You not having the skill base needed to counter Yasuo, someone every easily countered doesn't mean he gets nerfs. Zed got nerfed because he was doing a shit ton of damage at all times of the game. Yasuo doesn't do near any damage from early to mid game. You crying about a champion you have no skill to play against doesn't justify nerfs, when he is clearly easy to counter froom from higher tier ranked players.\n\nbasically every Yasuo mains argument, \"just because you have no skill blah blah blah.\"\nhe isn't easily countered when the Yasuo player actually knows what he is doing.\non top of that his constant dashing around and blocking your shit is frustrating af.\nand Yasuo does Damage after 2 items (i forgot to mention that he has on top of all his shit also double crit and armor pen)\n\n> Yeah you fucking poke his shield then poke him, it's like fucking magic, but it is skill. His shield is down for nearly a minute of free poking. You bait both windwall and sjield and rek him. It is super easy, just because you can't doesn't mean others lack the skill.\n\nSo you Poke his shield.. and then he dashes around and gets it again after like 20 seconds. i don't know  what you do so you only get it up again after 1min. when you then want to actually poke him, he still has his windwall. or he just e's on you and outtrades you. or he just dashes out and plays safe a few seconds. all while you waste your mana.\n\n> He has no escapes other than minions, which if you are fighting him in his own kingdom, makes you stupid. He is easily ganked. Low hp, no mr, low armor. No counters to stuns and any form of cc. Mobility is easy to counter. His cc is low at best and easily avoided, depending heavily on other champions. A shield which drops from an auto attac.k, unlike morgana's, rivens, galio's etc. His attacks are basic attacks, meaning he needs no cd for it since it is the same as his regular move. His speed is needed since he has no escapes and is squishy. Not one time have I kitted a champion and killed him without him being super low hp. His damage is near none for 40 minutes of the game, unless your dumb enough to play into his game. Yasuo is balanced and is a slayer meant to have this kit.\n\n> No counters to stuns and any form of cc\n\napart from that windwall that can block every CC projectile (like almost every mid laner has)\n\n> His damage is near none for 40 minutes of the game\n\nit's not like he already has 100% crit with 2 Items\n\n---\n\nBut, hey, i just checked you OP.gg and it seems like you are a a Silver/Gold-Elo Yasuo one-trick.\nso there is no need to discuss with you anymore anyway.\n\neven fcking Riot said themselfes that Yasuo is too strong atm, but when you say he is fine and balanced he must be fine and balanced i guess.","replies":[{"poster":"Fly Fish Master","date":"2016-12-11T20:44:14.705+0000","up_votes":1,"down_votes":0,"body":"> basically every Yasuo mains argument, \"just because you have no skill blah blah blah.\"\nhe isn't easily countered when the Yasuo player actually knows what he is doing.\non top of that his constant dashing around and blocking your shit is frustrating af.\nand Yasuo does Damage after 2 items (i forgot to mention that he has on top of all his shit also double crit and armor pen)\n\nHello, Yasuo main here. I would like to point out that you can avoid constant dashing and blocking your abilities by picking a champion with point and click stuns like Annie (Even if Yasuo block the Q with WW, you get to keep the stun charge, or you can just use the W or Tibbers which can't be windwalled at all), point and click root like Ryze, or even better, play Malzahar that only has 1/4th of his kit blocked by windwall. P.S., Yasuo has to get a crit item ({{item:3046}} or {{item:3087}} ) and at least a {{item:1038}} to actually do dmg. Even then, 60% crit chance is still a hat toss and the crit will be doing 10% less dmg still. \nAlso, using that he isn't easily countered by a Yasuo player that actually knows what he is doing isn't an excuse. Ask for ganks or better yet, force him to have to push the wave and freeze it infront of your turret. \n\nBefore you even say\"Why should I have to change what I want to play just to go up against a champion?\", I would like to bring up that I have to change what I want to play if Yasuo gets banned, if the enemy team has a Rammus, Vi, Annie, Malzahar, Malphite, Kennen, etc (I play Yasuo mid alot more than top, but if the enemy top laner is Irelia or Fiora, Renekton, Darius, or basically any bruiser or juggernaut that has dmg, I have to change my pick), or if the enemy gets to pick Yasuo before me.\n\n> So you Poke his shield.. and then he dashes around and gets it again after like 20 seconds. i don't know what you do so you only get it up again after 1min. when you then want to actually poke him, he still has his windwall. or he just e's on you and outtrades you. or he just dashes out and plays safe a few seconds. all while you waste your mana.\n\nOR you can use just one ability to make him burn his windwall and THEN try to attack him. Most Yasuos will not put points into windwall until E and Q are maxed. \n\n> apart from that windwall that can block every CC projectile (like almost every mid laner has)\n\nThis is because if he didn't have it, do you actually think this champion would be able to trade with anyone longer than 1-2 seconds without getting cc'd to death? Your OT Zed is able to survive at the mid lane because he has his W to allow him to dodge skillshots and give him more range to hit his E (Also, the shadow's E applies a slow) and his Q being on just a 6 second cd at all ranks that the shadow can copy as well. Get 40% CDR and that drops to a 3.5 CD. That is Yasuo's CD for his Q at lvl 1, but only with the help of 29% attack speed from runes. \n\nRiot only said,\n> Yasuo’s on our radar as a champ who’s probably too strong at present.\n> \"probably too strong at the present.\"\n\n> **PROBABLY TOO STRONG**\n\nProbably too strong =/= too strong. That is basically a \"There's a chance he is too strong, but we have to look into before we can actually give a yes or no answer\". Also, Meddler said \"For Yasuo specifically the first job’s going to be an assessment of whether he’s performing better than he should for his intended strengths and weaknesses. That’s both in terms of time in game (e.g. laning/early strength versus late strength) and circumstance (e.g. when snowballed, or when paired with specific allies or against specific enemies)\". In other words, **THEY** don't even know if know if he is too strong or not. Don't put words into Meddler's or Riot's mouth.","replies":[{"poster":"Shadòw","date":"2016-12-11T21:10:21.379+0000","up_votes":1,"down_votes":0,"body":"Which Yasuo doesn't put a point into Windwall?\n\nwhen his enemy has a ability that can be windwalled, every Yasuo takes a point in Windwall at lvl 3 or 4.\nyou can just delete projectiles at no cost.\n\nyes, the crit is doing 10% less dmg, but the chance is still doubled so DPS will still be higher.\n\ni just think that he should get changes that make him less frustrating to play against, especially when you have no cc and/op aren't Ranged.\n\nthere are exactly 2 champions in this game that already tilt me in champ select/loading screen, and {{champion:157}} is one of them.\neven if he isn't OP, his constant dashing, Qing and the ability to windwall half your teams combo combined with this fcking VO just tilt me so hard. yes, it is bad played if you actually fire your whole combo into his windwall, but that doesn't make it less frustrating.\ni don't even care atm anymore if he still is OP or balanced meanwhile, but i still ban him because he simply pisses me off no matter if i win or lose against him. it's simply not a champion i enjoy playing against and i honestly think that the only people that are actually having fun in a game with Yasuo are the Yasuo palyers themself.","replies":[{"poster":"Fly Fish Master","date":"2016-12-11T21:32:40.855+0000","up_votes":1,"down_votes":0,"body":"> you can just delete projectiles at no cost.\n\nExcept that it has a cd of 26 secs at lvl 1, which any projectile in a midlaner's kit should be back up before his windwall is.\n\n> yes, the crit is doing 10% less dmg, but the chance is still doubled so DPS will still be higher.\n\nNot completely Yasuo's fault, but more of RNG and how RNG in this game works. Plenty of Rioters have said that they would like to do something about crit, but don't know what exactly to do about it. Yasuo is just one of two champions that say screw you to the RNG system of crit and get to have 100% when they get two items. The other being Tryndamere. Both also scale extremely well into late game because of this fact. \n\nTryndamere gets to go full AD because of his ultimate while Yasuo can go full AD because of the outplay potential his kit provides. The difference is that Yasuo is a skirmisher who is designed to be able to get to high priority targets like the ADC and kill them with ease (Fiora is a skirmisher too, but the problem with that champion is the fact she only needs two items then gets to build resistances and then gets to fight anyone she wants because of the true dmg her kit provides).\n\nAs long as you are only banning Yasuo when no one on your team is picking him, I really don't care unless I am on the enemy team. Besides that, you have all the right to ban Yasuo if you feel like it.","replies":[]}]}]}]}]}]},{"poster":"I am Pacman","date":"2016-12-11T17:42:21.008+0000","up_votes":2,"down_votes":1,"body":"I thought this was a troll post but you wrote a page so now idk.  If you actually think yasou isn't overloaded and brand and talon are free wins then you might need some lessons from lee sin about how to cope with being blind.","replies":[{"poster":"Bultz","date":"2016-12-11T17:49:07.831+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=I am Pacman,realm=NA,application-id=3ErqAdtq,discussion-id=NKEHJFZL,comment-id=0001,timestamp=2016-12-11T17:42:21.008+0000)\n>\n> I thought this was a troll post but you wrote a page so now idk.  If you actually think yasou isn&#x27;t overloaded and brand and talon are free wins then you might need some lessons from lee sin about how to cope with being blind.\n\nBrand and talon are free wins. Yasuo is balanced and fine.","replies":[]}]}]}