{"poster":"Bultz","date":"2017-06-12T06:51:27.095+0000","title":"Junglers have way to much say in my lane.","subforum":"Gameplay","up_votes":60,"down_votes":26,"body":"The game goes one of two ways, you get a good jungler and win or a bad one and lose. I&#039;m sick of level 1 ganks and being camped with the jungler having no to cost to him. He is called Jungler, not ganker, not camper, not duo top, he is called jungler. They need to be punished anytime they gank and make it so they have to weigh their options on ganking. I don&#039;t want to see them sitting in my lane not actually doing anything and still staying relevant.","replies":[{"poster":"korg023","date":"2017-06-12T12:55:32.049+0000","up_votes":10,"down_votes":4,"body":"Things riot should make priority right now : \n1. BUFF TOWERS\n2. CHANGE JUNGLE AGAIN,REMOVE XP CATCHUP MECHANIC,MAKE GANKING MORE RISKY,REWARD PEOPLE FOR FARMING IN JUNGLE MORE.\n3. FIX MINION BLOCK.\n\nWhen they fix these,its going to be huge leap forward.","replies":[{"poster":"dunder kill","date":"2017-06-12T14:21:51.754+0000","up_votes":22,"down_votes":2,"body":"Its funny because 6 months ago people were begging Riot to make junglers gank instead of rewarding AFK farming. So they changed the jungle for this season to do exactly that. Now the community is angry that they did. Lmao.","replies":[{"poster":"korg023","date":"2017-06-12T14:30:32.364+0000","up_votes":3,"down_votes":1,"body":"I didnt say junglers should just stay in jungle and farm but this is totally opposite problem of what we had, now junglers only gank! If afk farming is unhealthy then only ganking is unhealthy too. Make balance,make farming more rewarding and make ganking more risky than it is now. \nIt feels so bad for {{champion:11}} and {{champion:102}} players to watch their team gets their ass handed over to them by enemy lee sin in the first 10 minutes of the game while they need that farm in order to scale. ","replies":[{"poster":"Nameless Drifter","date":"2017-06-12T16:20:27.701+0000","up_votes":5,"down_votes":2,"body":"Ganking more risky? Mate if you fail 2 ganks in a row you get 2 levels behind the enemy jungler in the early game, which leads him to invade and take your jungle camps and possibly kill you. \n\nJunglers now farm in their way to ganks, thats how it is supposed to be and brings variety to the game since there are quite a few possible jungle paths instead of the old full clear. \n\nDont want to get ganked? Dont give them a opportunity to gank you. Its as simple as that.","replies":[{"poster":"HateDaddy","date":"2017-06-13T00:14:04.884+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=LordAngelos,realm=EUW,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=0009000000000000,timestamp=2017-06-12T16:20:27.701+0000)\n>\n> Ganking more risky? Mate if you fail 2 ganks in a row you get 2 levels behind the enemy jungler in the early game, which leads him to invade and take your jungle camps and possibly kill you. \n\nAnd then they have catch-up exp so it's like dying never mattered \n\n> Junglers now farm in their way to ganks, thats how it is supposed to be and brings variety to the game since there are quite a few possible jungle paths instead of the old full clear. \n> \n> Dont want to get ganked? Dont give them a opportunity to gank you. Its as simple as that.\n\nI hate this mentality so much. \"Don't play the game because they have a jungler.\"","replies":[{"poster":"Nameless Drifter","date":"2017-06-13T13:35:22.547+0000","up_votes":2,"down_votes":0,"body":"And while they are trying to catch up by farming the jungle, your jungler can take Drakes uncontested and gank lanes to put your team ahead. \n\n\"Dont play the game because they have a jungler\" League of Legends is a game that has strategy in it may you like it or not.\n\nYou cant be always playing aggressive and constantly fighting. Sometimes you have to play smart, around your power spikes and their, and sometimes play safe and passive. \n\nIf you dont like it, thats too bad.","replies":[{"poster":"HateDaddy","date":"2017-06-13T20:31:09.999+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LordAngelos,realm=EUW,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=000900000000000000000000,timestamp=2017-06-13T13:35:22.547+0000)\n>\n> And while they are trying to catch up by farming the jungle, your jungler can take Drakes uncontested and gank lanes to put your team ahead. \n> \n> &quot;Dont play the game because they have a jungler&quot; League of Legends is a game that has strategy in it may you like it or not.\n> \n> You cant be always playing aggressive and constantly fighting. Sometimes you have to play smart, around your power spikes and their, and sometimes play safe and passive. \n> \n> If you dont like it, thats too bad.\n\nWhat makes you think I'm aggressive on stop? Top lane has become a place where any sign of aggression is likely an indication of an incoming gank. What's wrong with hating that? Furthermore, dragons aren't always up and they aren't always free to take just because the jungler was top. It's not that simple. It's never been that simple.","replies":[{"poster":"Nameless Drifter","date":"2017-06-13T21:28:28.948+0000","up_votes":1,"down_votes":0,"body":"As far as Im aware drakes are usually not touched in the early game unless either bot dies or is forced to back and the other one can rotate to help get drake. Even if there arent drakes you can get Rift Herald with the help of your jungler since it isnt most of the time warded. Or you can TP bot while a fight is going on or force one, if your team got cc to slow them down while TP is channelling. \n\nAbout the aggression. I mean...you just need 1 control ward and talk with your jungler and make a gank happen if you need help. If you are the one playing aggressive just have vision and know approximately where the enemy jungler is.","replies":[]}]}]}]}]}]},{"poster":"ChaosThief","date":"2017-06-12T18:43:57.875+0000","up_votes":3,"down_votes":1,"body":"I think the issue isn't that they gank too much. The issue is that they're completely powerless. The laners, that is\n\nTo put it in simple terms: we don't want to be considered dead the moment the jungler walks in, we don't want the jungler to determine what lane wins. We want them to make an impact, not decide the game for us.","replies":[]},{"poster":"Jaygo41","date":"2017-06-13T14:04:23.560+0000","up_votes":1,"down_votes":0,"body":"Holy shit thank you\n\nYOU PEOPLE WANT GRAVES COMING BACK? PIPE DOWN WITH THE FARMING NONSENSE","replies":[]},{"poster":"OP Garen Support","date":"2017-06-12T23:01:12.936+0000","up_votes":1,"down_votes":1,"body":"No the removal of pink ward and the regular wars for 75 gold is the reason we getting destroyed by ganks. Junglers trying to gank instead of afk farming until we loose the match was very bad. On mid Lane you can get ganked from 8 direction that 1 trinket wont save me and it has bs cd on it.","replies":[{"poster":"Durzaka","date":"2017-06-13T03:33:43.203+0000","up_votes":1,"down_votes":0,"body":"1 Control Ward + 1 trinket ward can completely shut down one direction of apporach for mid lane (and if your jungler gets a good ward, that can shut down another).\n\nThat is more than enough. You play and favor the side heavily that you have vision of, so if the enemy ganks from where you DONT have vision, youre far enough away, or positioned safe enough that it doesnt matter. (AKA if you have vision of bottom bush and river bush, you play towards that side, not wards the side you dont have any wards, increasing the distance the enemy jungler needs to cover to get to you.)","replies":[]}]}]},{"poster":"Anhartamin","date":"2017-06-12T14:32:30.147+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"korg023","date":"2017-06-12T14:36:44.528+0000","up_votes":5,"down_votes":0,"body":"If walking up with lee sin under enemy turret , pressing Q Q R and walking away like nothing happened is tactic,then this game is getting dumber and dumber my friend. I remember before in order to dive someone you really had to plan it out and when it works it felt so rewarding.  That is tactic and planning ahead,this today is just diving with zero worry in your mind. If enemy top laner and jungler can walk up to you under tower kill you and tank 5 turret shots then i really feel sorry for what this game has become.","replies":[]}]},{"poster":"Azlagor","date":"2017-06-12T21:23:19.837+0000","up_votes":1,"down_votes":0,"body":"Highest priority should be fixing vision. \nEver since the massive nerfs to trinkets and sightstone aswell as removeing greenwards it's just fucked up.\nThere is nothing you can do at all vs ganks early on, you simply have no way of getting decent vision in any form vs ganks, and later on it also results in baron standoffs cause there are to little wards to really play the entire map unless you have absurd save splitpushiers, which is the main reason why tank ekko and tank fizz became a thing while low escape fighters as irelia or jax hardly get used in high elos.\nIf vision was reverted back to S5, the impact of junglers in the ealry would be reduced and strategic deversity later on would increase.","replies":[]}]},{"poster":"RlP K0BE","date":"2017-06-12T13:46:13.312+0000","up_votes":9,"down_votes":0,"body":"What do you guys want? Jungle exp and gold has been nerfed so aside from clearing junglers NEED to gank for gold income. Also, what do you mean by junglers gank without any consequences? If the enemy jungler makes a play on one side of the map your jungler needs to make a play on the other side. Taking the enemy junglers camps, taking objectives, or ganking other lanes are all things your jungler can do to punish the enemy jungler.\n\n\"He is called Jungler, not ganker, not camper, not duo top, he is called jungler.\" What is your idea of a jungler? Afking in the jungle for the whole game? Sorry but that meta is long gone now.","replies":[{"poster":"RainbowIcee","date":"2017-06-13T04:14:52.215+0000","up_votes":1,"down_votes":0,"body":"It's the hive mentality. Lanes can do a lot more than whine and complain about the jungler babysitting them but seems today that's all they want to do. They refuse to admit they got bested.","replies":[]}]},{"poster":"A Basic Island","date":"2017-06-12T07:11:39.084+0000","up_votes":2,"down_votes":0,"body":"what if both junglers are good tho","replies":[{"poster":"Essychu","date":"2017-06-12T07:22:55.026+0000","up_votes":6,"down_votes":0,"body":"the game actually becomes fair :)","replies":[]}]},{"poster":"Rexxiee","date":"2017-06-12T07:30:14.797+0000","up_votes":3,"down_votes":1,"body":"Junglers do need to see a sgnificant power drop across the role.\n\nLike compare playing with a bad jungler to a bad any other role, you'll see how too much influence it has, junglers need to be same gold/exp as a duo lane, not solo, and any kind of catchup mechanics need to be removed, if a jungler camps a lane too much and doesnt get 20 kills out of it he should be same lvl as bot lane if not lower, not same lvl as a solo.\n\nRiot is way too biased towards junglers though so have fun playing a jungle dominated game for more years to come.","replies":[{"poster":"DunkinNoobs","date":"2017-06-12T07:51:58.392+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rexxiee,realm=NA,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=0004,timestamp=2017-06-12T07:30:14.797+0000)\n>\n> Like compare playing with a bad jungler to a bad any other role, you&#x27;ll see how too much influence it has, junglers need to be same gold/exp as a duo lane, not solo,\n\nMight as well take every carry and farm jungler and throw them in the trash can because all that would be left are support and tank junglers.","replies":[{"poster":"Rexxiee","date":"2017-06-12T07:54:10.000+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=DunkinNoobs,realm=NA,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=00040000,timestamp=2017-06-12T07:51:58.392+0000)\n>\n> Might as well take every carry and farm jungler and throw them in the trash can because all that would be left are support and tank junglers.\n\nMaybe that would be a good thing, so the other 4 players can also get to have impact on the game.\n\nI cant play adcs in the jungle and you dont see me complaining about it, the jungle would be 100% more balanced with it being a more tank/supportish role rather than the mess that it is right now.","replies":[{"poster":"DunkinNoobs","date":"2017-06-12T07:58:07.398+0000","up_votes":1,"down_votes":0,"body":"Oh they'd have an impact alright, but I doubt it would be the one you wanted. We know what the game looks like when junglers are super weak because that's how it was way, way back in the past. Everyone picked lane bullies in every lane every game because junglers were too weak to punish aggressive laners.","replies":[{"poster":"Rexxiee","date":"2017-06-12T08:02:24.518+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=DunkinNoobs,realm=NA,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=0004000000000000,timestamp=2017-06-12T07:58:07.398+0000)\n>\n> Oh they&#x27;d have an impact alright, but I doubt it would be the one you wanted. We know what the game looks like when junglers are super weak because that&#x27;s how it was way, way back in the past. Everyone picked lane bullies in every lane every game because junglers were too weak to punish aggressive laners.\n\nI think you have bad memory.\n\nBack then the games were way slower, lane bullies were actually rahter bad because the games would easily go into the 40 minute mark and beyond.\n\nBack then the game had like well defined phases, all early-mid-late lasted for a quite while (say 0-25 early game, 25-40 mid game, 40+ late game), it honestly felt good, its too bad they have constantly try to reduce the game duration which threw the balance out of the whack (mid game nowdays last at most 5 minutes, you basically jump from laning phase into the late game in btw 5~10 minutes), the games back then felt like a complete experience.","replies":[]}]}]}]}]},{"poster":"PhDs Nuts","date":"2017-06-12T07:23:47.928+0000","up_votes":11,"down_votes":6,"body":"Welcome to a world where junglers are given the same xp and gold as solo lanes, catchup XP if they fall behind, and itemization to just solo a laner they find trying to roam or ward.","replies":[{"poster":"Eedat","date":"2017-06-12T12:53:59.794+0000","up_votes":7,"down_votes":5,"body":"> Welcome to a world where junglers are given the same xp and gold as solo lanes\n\nThey don't. Thats a straight up lie. Junglers are 1-2 levels behind solo laners and dont get as much gold.","replies":[{"poster":"Shadòw","date":"2017-06-12T13:51:45.421+0000","up_votes":4,"down_votes":4,"body":"i've seen many junglers even have the highest level in his team, and that is not unusual since Season 7.\n\nexactly that is the problem.","replies":[{"poster":"Eedat","date":"2017-06-12T14:14:30.306+0000","up_votes":6,"down_votes":1,"body":"The only way you are ahead of a solo laner is if the Jungler is ridiculously fed and the solo laner is very far behind.\n\nI can provide many examples of this being true.\n\n[This game I am still a level ahead of our 16/4/9 Jungler. He is the same level as our 1/8 Lux](http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2516201495/209139549?tab=overview)\n\n[This game I am a 6/8/13 Top laner and still a level up on our 12/5/11 Jungler](http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2517407292/209139549?tab=overview)\n\n[Here is a game where I'm Jungling. I'm 4/2 yet still a level behind our 0/4 top laner](http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2514948827/209139549?tab=overview)\n\nI can provide many, many more examples if you would like. The jungler is never ahead in levels of solo laners except in the most extreme of circumstances.\n\nIf you still disagree, please feel free to provide some proof.","replies":[{"poster":"Shadòw","date":"2017-06-12T14:26:18.823+0000","up_votes":4,"down_votes":3,"body":"https://i.gyazo.com/052a88a54cfc61269626508996ddecfc.jpg\n\nthis is just live from qt's stream.\n\n{{champion:19}} is the same level as top and mid even if he is not ahead of them.\n\n{{champion:64}} is fed and has the same level as {{champion:38}} who is also fed.\nmeanwhile {{champion:3}} is 2 levels behind even if he isn't doing too bad.\n\nand this is just a random high elo match i just had up on my secondary screen, this is just usual.","replies":[{"poster":"Eedat","date":"2017-06-12T14:42:45.186+0000","up_votes":4,"down_votes":0,"body":"I would like to see some more details of that match. There is something massively wrong considering one of their duo laners is actually the highest level on their team","replies":[]},{"poster":"Anhartamin","date":"2017-06-12T15:55:22.337+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"Shadòw","date":"2017-06-12T16:04:20.697+0000","up_votes":1,"down_votes":2,"body":"doesn't change the fact that junglers have no huge exp differences to the laners like it used to be, and they are nonexistant in the early game where junglers have the biggest impact.","replies":[]}]}]}]}]},{"poster":"Cosmic Warper","date":"2017-06-12T17:08:23.398+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Eedat,realm=NA,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=00030001,timestamp=2017-06-12T12:53:59.794+0000)\n>\n> They don&#x27;t. Thats a straight up lie. Junglers are 1-2 levels behind solo laners and dont get as much gold.\n\n?? I've seen junglers be the same level as laners without getting fed.","replies":[]}]},{"poster":"Essychu","date":"2017-06-12T07:47:04.795+0000","up_votes":4,"down_votes":0,"body":"when a khazix hits 6 befroe me because im trying to farm vs a ranged champ and denied most of everything and then just 1 shots me.\n\n\"just ward\"  \n {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}}  {{item:3341}} ","replies":[{"poster":"Rexxiee","date":"2017-06-12T07:55:11.684+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Pavlo Voronych,realm=NA,application-id=3ErqAdtq,discussion-id=7Oad5Fa0,comment-id=00030000,timestamp=2017-06-12T07:47:04.795+0000)\n>\n> when a khazix hits 6 befroe me because im trying to farm vs a ranged champ and denied most of everything and then just 1 shots me.\n> \n> &quot;just ward&quot;\n\nJust use your 1 minute ward on a 3 minute CD XD\n\nOh he cleared it? Just buy a green ward...Oh wait, actually just hope you have a jungler that is doing the same thing to some other lane or you'll lose hard.","replies":[]}]},{"poster":"XIII Vanitas","date":"2017-06-12T19:37:45.296+0000","up_votes":2,"down_votes":0,"body":"Are you on drugs?","replies":[]}]},{"poster":"Essychu","date":"2017-06-12T06:59:25.527+0000","up_votes":8,"down_votes":4,"body":"not being able to prove you're a better top laner because THEIR jungler is better than mine xD\n\nbest feeling when u get no say whatsoever agaisnt a bad laner but they get the free lane win and the carry because their jungler knows how to gank.\n\n\njungle mains tho!!!\n\nhitting elos they dont belong in and abusing riots inability to balance that role and actually make it healthy!!\n\nbad junglers?\n\nexp comeback system!! 2 levels behind and counterjungled to the max? get 1 kill and 1 camp and instantly become evenly leveled again cuz haHAA riot btw haHAA\n\nbad gankers?\n\nred buff still does a good chunk and blows ur flash most of the time!!\n\nwards?  wait em out or clear them for free and then dive !!","replies":[{"poster":"Skorch","date":"2017-06-12T17:07:20.498+0000","up_votes":2,"down_votes":1,"body":"Your not the better top laner if you lost your lane because \"your jungler is worse than your enemies\"","replies":[{"poster":"ChaosThief","date":"2017-06-12T18:56:07.969+0000","up_votes":2,"down_votes":0,"body":"There are times where you outfarm the enemy top laner by 20+ CS, can beat them down if they try to fight you, and you're easily capable of knocking the turret down yourself.\n\nThen the jungler comes in once.\n\nYou're still ahead in minions. He gained a level but you still have 1 over him. Middle of the lane, farming.\n\nJungler comes in again.\n\nLeves are matching, he's still lower CS than you. However, since he got two kills from the jungler, he decides to fight you. *You still beat him despite the kill lead and he starts to run away.*\n\nJungler comes in again and kills you. The enemy closes the farm gap because you're still dead, knocks a chunk of the tower's health bar.\n\nYou teleport back into lane, farm under tower. During this, the enemy laner recalls and teleports back. Move up a little past tower range, the enemy laner engages you and kills you because you were set behind by the enemy jungler.\n\n---------------------------------------------------\n\nThere are times where the enemy laner is simply a worse player than you, in every respect, but you have no say in the matter because of the enemy jungler. A lane's fate should not be solely decided because an enemy jungler decided to visit you a few times. You can be a much better laner than the enemy, this means nothing if the enemy is set ahead by another player on their team. A lot of the time, there's nothing you can do to stop it either. Zac can engage from unusual spots, one of his niches, and still lock you down and deal a good amount of damage. Even if they have to dive, they can still kill you safely. Lee sin can land a Q on you, ward hop behind and ult you into the enemy laner, then Q again. Unless you flash before lee sin ults, you can't do anything. He already decided you're going to die, and you're just going to have to live with it. He can knock you out of tower range and kill you with his laner.\n\nIt's no fun to have no power in a situation. Only a select few champions can survive lane ganks, you shouldn't have to play them just because the jungler *might* decide to visit often. Also, wards will often mean you survive, yes, but the enemy laner still gets free farm off of this. You can come back a moment later, the enemy jungler comes back a moment later, you have to retreat again and the enemy keeps farming, closing any lead you may have had with farm instead of kills. \n\nIt's incredibly frustrating.","replies":[{"poster":"Divewing","date":"2017-06-12T21:41:01.008+0000","up_votes":2,"down_votes":0,"body":"Happens in mid too","replies":[]},{"poster":"Skorch","date":"2017-06-13T03:31:12.586+0000","up_votes":1,"down_votes":0,"body":"You put yourself into a position where you could be ganked and killed SEVERAL times. Yeah junglers can help win a losing lane (you know, their job) but a thing about junglers is if you know how they gank, you can make them barely appear in your lane.\n\nMy main problem is when people complain about junglers being gank heavy, its their job. If you are being camped, odds are you are putting yourself IN that position.\n\nAnd yes junglers can be strong, but their strength is depending on how easily they can gank you when you play it correctly. Like at the start of the year {{champion:120}} {{champion:254}} and {{champion:64}} being able to repeatedly dive you when you are at full health under turret. Thats a strong jungler and they probably should be nerfed.\n\nBUT if you know how to avoid the jungler, than most of the issues people have been complaining about are just invalid.","replies":[]}]}]}]},{"poster":"RacoonHunter","date":"2017-06-12T10:56:53.590+0000","up_votes":2,"down_votes":0,"body":"They need to put a shield on bot turret as well.. I know I speak for a majority of the community when I say \" Sick of 3 minutes into the game being forced to sit under tower because the jungler decides to camp bot because the tower can be taken by 5 minutes into the game..","replies":[{"poster":"korg023","date":"2017-06-12T12:57:41.835+0000","up_votes":1,"down_votes":0,"body":"We had multiple topics on front page about how turrets are weak,Riot is not listening!","replies":[{"poster":"Leetri","date":"2017-06-12T16:48:17.850+0000","up_votes":3,"down_votes":0,"body":"They're listening, but listening doesn't mean replying or doing something about it. For all we know they're happy with the way it is and see no need to change it, or they're working on solutions right now but can't share it. Riot doesn't like sharing things unless they're going to happen, since everyone here takes ideas as promises and then holds Riot to them.","replies":[]}]}]},{"poster":"sanjiluv","date":"2017-06-12T16:00:23.022+0000","up_votes":2,"down_votes":0,"body":"The thing is that real balance will never be achieved. You are all asking the wrong question. \nThe correct question is this:\n\"What is the ratio of jungling and ganking that would be optimal. A 50/50 split isnt feasible. And leaning to one side or the other too much is also off the table.  So where should it sit then?\"","replies":[]},{"poster":"muted team chat","date":"2017-06-12T14:40:29.974+0000","up_votes":2,"down_votes":0,"body":"As a jungler I agree and I would honestly prefer to haave a farming option, but that is not exciting for pro-play.","replies":[]},{"poster":"Votable Jester","date":"2017-06-12T09:00:10.022+0000","up_votes":1,"down_votes":0,"body":"Maybe they should make it so camps are weaker, but spawn more often (with less gold/exp of course).  This way, time spent on failed ganks is a much more direct loss in farm.\n\nBasically, if it were possible for junglers to literally constantly be farming (as an extreme version), then any time spent not farming is (obviously) lost farm.","replies":[]}]}