{"poster":"Bultz","date":"2017-05-31T16:45:25.156+0000","title":"@Riot, A question on the Nightbringer Yasuo Skin.","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":0,"body":"So I have noticed a few changes on the skin from his normal model, such as his ult not moving, but instead having shadows attack. His backing animation  no longer involves his drink. His shoulder armor is no longer there, replaced by spikes. I have no quarrels with any of it, it looks amazing, but I have noticed when Yasuo runs he no longer holds his sword and his hand is free. Did you do this to make it more sinister looking or did you feel you should change the run animation just for fun? I can&#039;t judge it at the moment because it&#039;s only a second long that you see the animation, but I worry it will look awkward. Again I am not against it as I have yet to actually see it full on, I am just curious as to the thought behind this.\n\nGood Job on the Skins!","replies":[{"poster":"Riot LoveStrut","date":"2017-06-03T02:09:41.206+0000","up_votes":2,"down_votes":0,"body":"Thanks for the questions and feedback, Bultz!\n\nFor this skin, we really wanted to push the boundaries of what we could do with a Yasuo skin. Yasuo is a calm, collected lone warrior, so in envisioning him as a chaotic demon, we wanted to push a skin that would ultimately be an antithesis of who Yasuo is, while still reading as Yasuo in-game. We made decisions like fitting him with some Persian-influenced armor and horns, deviating from his typical straight-edged samurai sword for a more severe scimitar shape, and giving him some beastly, savage animation tweaks like using his clawed hands when moving/attacking or shooting out spikes on spellcast. There were some things that we wanted to bring in from classic Yasuo but ended up removing for more thematically-cohesive ideas (like his flute-playing), but we were able to keep some nods to classic Yasuo by the end of development--like having him consume the elixir instead of having his typical drink or giving him some shadow-Yasuo-multislashes while he charges up a large, flaming attack during his ult instead of the typical multislash.\n\nWe also knew that he has a very devoted player-base that relies heavily on many animation cues on his autos and spells, so we wanted to smooth out and change his attacking animations without making the changes too jarring for Yasuo mains and enemies fighting against him.\n\nOverall, we just made decisions that pushed the skin towards our pillars of him being a chaotic demon of revenge that wants to destroy the world for his greater plans.\n\nHope this answers some of your questions!","replies":[{"poster":"NinjaGuy69","date":"2017-06-03T02:28:15.310+0000","up_votes":2,"down_votes":0,"body":"> Hope this answers some of your questions!\n\nHi LoveStrut. Totally unrelated, but who are the artists that are responsible for making Dawnbringer Riven thicc? I don't play or even own Riven but props to those folks for their \"artistic style\".\n\nhttp://i3.kym-cdn.com/entries/icons/original/000/013/306/2dd.jpg\n\nP.S. You're a cutie LoveStrut.","replies":[]},{"poster":"h2rhol2","date":"2017-06-08T11:31:15.033+0000","up_votes":1,"down_votes":0,"body":"something u should consider is making the sword longer because yasuo IS known for having a long sword even with such a skin i love all the animations REALLY MUCH but making yasuo run around with a dagger looking sword thats pretty weird so please keep that in mind","replies":[]},{"poster":"Bultz","date":"2017-06-03T03:19:27.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot LoveStrut,realm=NA,application-id=6kFXY1kR,discussion-id=I4LkERnE,comment-id=0002,timestamp=2017-06-03T02:09:41.206+0000)\n>\n> Thanks for the questions and feedback, Bultz!\n> \n> For this skin, we really wanted to push the boundaries of what we could do with a Yasuo skin. Yasuo is a calm, collected lone warrior, so in envisioning him as a chaotic demon, we wanted to push a skin that would ultimately be an antithesis of who Yasuo is, while still reading as Yasuo in-game. We made decisions like fitting him with some Persian-influenced armor and horns, deviating from his typical straight-edged samurai sword for a more severe scimitar shape, and giving him some beastly, savage animation tweaks like using his clawed hands when moving/attacking or shooting out spikes on spellcast. There were some things that we wanted to bring in from classic Yasuo but ended up removing for more thematically-cohesive ideas (like his flute-playing), but we were able to keep some nods to classic Yasuo by the end of development--like having him consume the elixir instead of having his typical drink or giving him some shadow-Yasuo-multislashes while he charges up a large, flaming attack during his ult instead of the typical multislash.\n> \n> We also knew that he has a very devoted player-base that relies heavily on many animation cues on his autos and spells, so we wanted to smooth out and change his attacking animations without making the changes too jarring for Yasuo mains and enemies fighting against him.\n> \n> Overall, we just made decisions that pushed the skin towards our pillars of him being a chaotic demon of revenge that wants to destroy the world for his greater plans.\n> \n> Hope this answers some of your questions!\n\nThank you for addressing my questions LoveStrut!\n\nNot yet being on the PBE, I have only seen videos of the skin, but so far I love every aspect of it. I was worried about the running animation, but after seeing it fully, I think it is one of the best in the game. As you mentioned it all combines with various details to create one of the best skins out there. It is so smooth and flawless. The first time I saw it I was amazed by how well the movement and attacks flow with the skin! As for the scimitar, you have made the best choice in my opinion. I love that you gave his claws too, it adds to the romance of the skin. As for removing the flute, I am fine with it, but I am also having the hardest time figuring out where his new dance is from. I recognize it from somewhere, but can't quite place it. \n\nI think you and the team deserve a round of applause for these skins. After the leak dropped, I racked my brain as to how you would create it and you even upped my expectations. \n\nThank you guys for this and thank you for replying to me! :)","replies":[]}]},{"poster":"paisy","date":"2017-05-31T17:59:02.879+0000","up_votes":1,"down_votes":0,"body":"It's a legendary most likely","replies":[]},{"poster":"Leyin","date":"2017-05-31T16:51:12.360+0000","up_votes":1,"down_votes":0,"body":"remember, you will never this the animation from this side, in game with the normal cam, it will look smother, because they don't plan that everybody zooms in like this","replies":[]}]}