{"poster":"CaptnJakSparrow","date":"2016-05-13T06:13:54.621+0000","title":"I have to share one of the more retarded things I've heard today.","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":0,"body":"So, here I am . . . playing HOTS.\n\nI&#039;m just chilling as Azmodan  pushing away.\n\n\nAnd this cringey trimade starts bming.\n\n&quot;fucking %%% noob Azmodan gonna make us lose. So useless and bad. reported.&quot;\n\n&quot;What are you talking about.&quot;\n\n&quot;You do nothing, you&#039;re so bad. Idk how you even got to this Elo. Fucking %%%. kys.&quot;\n\nYou know, if I was doing . . . absolute garbage, I&#039;d be like &quot;heh you&#039;re right. I&#039;m trash. wtfe.&quot;\n\nThen I realize I have triple the siege damage to the person second of it, and have the most damage deal on our team as well. Also have theleast deaths, and taken the most turrets.\n\nSo, I say, &quot;You do realize I have the most kill participation + damage + siege damage + objectives + least deaths of our entire team right?&quot;\n\nAnd here it is, the reason IQ tests should be in place before people are allowed to type in champ.\n\n&quot;It&#039;s because your champs better than mine. It doesn&#039;t count when you&#039;re a noob champ like Azmodan. You&#039;re fucking trash.&quot;\n\nSo, all of my stats mean nothing, and I have done nothing because I&#039;m Azmodan. \n\nThis is also coming from the 2/10/1 Illidan with 8k damage over a 30 minute game.  He also told me . . . ((the guy who plays a lot of Illidan))  to play a real champ. Like Illidan. . . . \n\n\nI swear to God\n\nhttps://c1.staticflickr.com/3/2322/2494951556_1f58ba89d0.jpg\n\n\nThis is wtf I was talking to.\n\nRegardless, I muted and ignored them and just kept doing what I was doing, and while they were all dead yelling gg nuub Azmodan with their 60 second respawn timer, The screen rolls over to me chilling at the enemy base with a giant &quot;VICTORY&quot;\n\nTeam goes &quot; . . . &quot;\n\nMe: &quot;Noob Azmodan OP.&quot;\n\nReported them all, went on my way.","replies":[]}