{"poster":"WelcomeToTheJg","date":"2017-10-15T15:37:35.721+0000","title":"I NEED A RIOT MEMBERS HELP!!!!","subforum":"[ARCHIVED] Help & Support","embed":{"description":null,"url":"https://support.riotgames.com/hc/en-us/requests/32170330","image":null},"up_votes":1,"down_votes":1,"body":"iv tried making tickets and no one seems to work for u. i had a 10 day chat restriction i made a ticket because my client wouldn't let me play games to get the 10 games done. ur support ({{champion:412}} ) team said its a 2week ban. its pass 2 weeks im off work today and i cant play. its now the 15 I had the \"2week\" start on the 1st or 2nd. i also have proof i contacted ur team on the 2nd about the issue if anyone u ppl actually look at the tickets ppl make. im very dissatisfied at the fact u don't have a live chat when on the first day of my \"ban\" i had a live support guy but now it seems u don't even have any employees i guess there all talking sh*t about T1({{champion:119}} ) to help anyone else atm? iv made a few tickets over the days now asking about why in the client it says game chat and not a ban but hey i guess ur players dont need understanding right? i want to be able to play my game im sick of waiting more days and making tickets its BS im making it a post now so maybe u guys will notice its like u {{champion:6}}  about me.","replies":[{"poster":"Broporo","date":"2017-10-15T21:51:56.477+0000","up_votes":1,"down_votes":0,"body":"Those 2 week bans don't lift each day right at midnight. Each punishment has a date/time associated with it. Yours does lift today from the looks of it, but the entire duration of the ban hasn't passed yet. \n\nAlso for clarification, Live Chat hasn't been launched as a 24/7 service. When the button isn't there, that just means the operating hours are closed.","replies":[{"poster":"ProblomaticRoot","date":"2017-10-15T22:12:00.724+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=QE9G9ktq,comment-id=0000,timestamp=2017-10-15T21:51:56.477+0000)\n>\n> Those 2 week bans don&#x27;t lift each day right at midnight. Each punishment has a date/time associated with it. Yours does lift today from the looks of it, but the entire duration of the ban hasn&#x27;t passed yet. \n> \n> Also for clarification, Live Chat hasn&#x27;t been launched as a 24/7 service. When the button isn&#x27;t there, that just means the operating hours are closed.\n\nalso to add, they have been pretty busy with alot of request on different servers as well, so all their resources for support of players are kinda taken up at the moment, i would say, stay patient and your problem will be answered, but that seems out of the question.","replies":[]}]}]}