{"poster":"The Lostralian","date":"2015-02-25T04:22:27.762+0000","title":"Arbitrary Punishment and the lack of a tribunal","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Dear Riot\r\n\r\nI'm a fairly new player to league, having only started playing at the beginning of season 4, and since that time I've tried my best to be a positive player. I'm a support main because I want to help my team, I try and help players that are learning, defend players who are being abused, keep a lively sense of humour and generally keep a positive attitude. I recently watched an adc get abused by our whole team for doing poorly in lane, so I added them and went support for them next game so I could try and help them work out where they were going wrong. I'm not claiming to be perfect, but I try my best.\r\n\r\nRecently I've noticed that all of your systems of punishment (leaver buster, reporting etc.) are completely automated and arbitrary, If you disconnect from a game (even if your having pc issues, ISP issues or problems with the lol client itself, and irrespective of if you reconnect or not) you will be given an arbitrary warning which you must type 'I agree' to, with no exceptions. I assume down the track this would lead to time bans etc.\r\n\r\nIf someone in game takes a dislike to you and decides to report you undeservingly, you still receive warning messages, and get a black mark against your name. The Reporting system is able to be misused basically.\r\n\r\nOn the other side of the situation, our server is constantly populated by people who rage, feed, are abusive, do not communicate or are generally negative players, with seemingly little punishment actually occurring. \r\n\r\nAt present I have spent more than $500 dollars on RP for your game, and I don't regret it at all (I love this game, and want to support you for your efforts in creating and maintaining it) but I feel its somehow unfair that I now face the possibility of a time ban from a game I have spent so much time and money on, when I'm trying as best I can to always remain positive, never start a game I cant finish and generally be a friendly, happy player. \r\n\r\nWill we ever have an active tribunal again to make fair decisions on these things, or will we simply continue to be left to deal with these problems ourselves, with the threat of an uncompromising computerized referee to keep us in line? OCE server isn't as well established as NA or EU, I understand, but our community is utterly toxic, and the positive players are being thrown in with all the negative players. I'm struggling to see how our server will attract positive players and grow if this situation remains unchanged.\r\n\r\nSincerely, A concerned summoner","replies":[{"poster":"The Lostralian","date":"2015-02-25T06:51:45.557+0000","up_votes":1,"down_votes":0,"body":"@Horse of Force\n\nCheers, at least I have an idea where they stand now. \n\nAs for spending money on the game, I don't think I have any extra rights, my point is more that a lot of people spend a lot more money on lol than they would on any other game, because they love it so much. Other games manage to maintain an active set of admins who ban people, look into punishments properly and monitor the community, surely riot can do the same?","replies":[{"poster":"HORSE OF FORCE","date":"2015-04-10T09:37:50.548+0000","up_votes":1,"down_votes":0,"body":"Fair enough. If they think money is also at stake, maybe they'll be more motivated to improve it.\n\nFor future reference, use the \"Reply\" button so that I can see what you say.","replies":[]}]},{"poster":"HORSE OF FORCE","date":"2015-02-25T06:39:04.311+0000","up_votes":1,"down_votes":0,"body":">I'm not claiming to be perfect, but I try my best.\n\nThat's a good thing to be doing. Isn't that nice? If only more people were like you.\n\n>On the other side of the situation, our server is constantly populated by people who rage, feed, are abusive, do not communicate or are generally negative players, with seemingly little punishment actually occurring. \n\nFair enough if you think that, but you've no proof or supporting arguments for it.\n\n>At present I have spent more than $500 dollars on RP for your game\n\nSpending money on a game that you don't have to spend a cent on to play competitively does not give you any privileges or rights above the others who play.\n\nAs far as I know, the Tribunal has been put into recess on all servers, with Riot's intentions being to make a game where we don't need other players reviewing cases in order to deal out punishments or not. Not too sure if that's a good idea, because generally human judgement is far superior to computer judgement (it also goes against their ideal that \"good things take time\"), but it seems like the Tribunal is never coming back. Real shame, it is.\n\nI'm completely against a computer being in charge of something as personal as telling you to not leave future games by typing \"I agree\" in a box. That's almost a signature, if not it, and something like that should *not* be automated.\n\nThis isn't the entirely right place to post it, you're right on that, but man, you're better off just putting it on here and any board you can (and also the OCE boards only has half the amount of topics that the NA boards have). This is still a huge problem that Riot should be taking more action toward.\n\nBy the way, I believe this belongs on the Misc. boards. The Help and Support boards are mainly here for technical issues that other players can actually help with, not these topical rants about how the punishment system is flawed, which it is.\n\nHope this helps.","replies":[]},{"poster":"The Lostralian","date":"2015-02-25T04:23:31.238+0000","up_votes":1,"down_votes":0,"body":"Also I'm not entirely sure if this was the right place to post this, If not I Apologize","replies":[]}]}