{"poster":"slxw","date":"2018-12-20T14:24:17.773+0000","title":"Teemo","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"This is the strat,\n\nGlacial O \nFree boo&#039;s\nBiscuits to snack on\nTimes up tonic\n\nLeg ala crity\ncup of grease\n1st buy - Corparte poision {{item:2033}} \n2nd, buy - ZZ tops portal{{item:3512}} \n\nGG.{{sticker:zombie-nunu-bummed}} \n\nI call it- \"the name so top secret it must be deleted\" Teemo takes a zz top portal to his- pipe, shrooms n ice problem to healthy levels . max move quick aka speed and then stay invisible under tower cause its better that way for not dying build.\n\nTX I luv you all.","replies":[{"poster":"slxw","date":"2018-12-20T14:32:22.994+0000","up_votes":1,"down_votes":0,"body":"I mean for the unexpected, they will ask why wont you die?\nBut you know.\n\nOh also I'm a real fraidy cat , so my sums are - {{summoner:7}}   {{summoner:21}} \n\nnever die.","replies":[]},{"poster":"Lego Wolfer","date":"2019-01-09T09:50:31.187+0000","up_votes":0,"down_votes":0,"body":"How about Kayle with Grasp, Flash, Heal against Garen. Every time Garen comes up to CS, ult yourself. If a minion even touches you, spam Heal. If Garen tries to back, Flash away.\n\nI actually faced a Kayle like that, and it was SOOO ANNOYING. Every time I Q to poke, Kayle just flashes away. Every time I want to CS, she spams her Q and backs off. If I E her, she ults and E's herself and runs away. Because bot was doing quite well, the jg wanted to stay there and apply as much pressure as possible. Enemy jg wasn't about to gank a lane that was scared of poke, so it was just back and forth, back and forth, and her summoners and ult were somehow ALWAYS up to save her. Later mid game, top is still 0/0/0 (lol) and jg and I had taken down mid Tier 1 tower, enemy team had just reset and Kayle was left to defend mid inner tower. Jg wanted to know if Kayle had ult so we could dive her, I just said 'Wait, I'll bait it out' and started to Q towards her. Boom! Her ult's gone. But her team was there and we had to back off. That Kayle had the luck of a 4 leaf clover :)\n\nSorry about the long post, I just wanted to share a funny story OP's post reminded me of.","replies":[]}]}