{"poster":"Chocobo Dorado ","date":"2015-04-29T19:28:52.703+0000","title":"ARAM versión 5.8 (nerfeo al hechizo del Poro)","subforum":"Charlas Generales","up_votes":6,"down_votes":3,"body":"A m&iacute; me gusta jugar ARAM, porque son partidas m&aacute;s cortas y se debe trabajar colaborativo en todo momento para ganar. Me gusta el nuevo hechizo que permite a los campeones sin rango tener una chance contra los veteranos del ARAM como {{champion:99}} {{champion:115}} {{champion:101}} {{champion:76}} {{champion:161}} . Pero creo que se les pas&oacute; un poco la mano. El hechizo del poro tiene un muy bajo cooldown y una distancia exagerada, adem&aacute;s de un extenso periodo para reactivar y lanzarse. Recordemos que los campeones de rango son muy blandos y si les llega una riven desde el otro aldo del mapa, por ejemplo, ninguna oportunidad. Otro problema que detect&eacute; fue que aunque estuvieran inmovilizados los campeones con el poro igualmente se pod&iacute;a lanzar, entonces las pocas defensa de estos campeones blandos ya no existen. Y por &uacute;ltimo la visibilidad del poro lanzado el casi imperceptible. Est&aacute; bien, ese poro en el Juego del Rey Poro era divertido y hac&iacute;a la partida mucho m&aacute;s din&aacute;mica, pero ahora, desbalancea demasiado el juego. \r\nCambi&oacute; la meta al otro extremo: ya nadie quiere un squishy {{champion:115}}  si puedo tener un {{champion:266}}  que  me llega desde base.\r\nCreo que deber&iacute;an nerfear al Hechizo del poro, ya sea: subi&eacute;ndole el CD, o acortando la distancia que recorre, o mejorando su visibilidad, o disminuyendo su ancho, o algo. \r\nSaludos cordiales","replies":[{"poster":"PabloBad","date":"2015-04-29T20:34:25.449+0000","up_votes":4,"down_votes":4,"body":"Menos de 1 día y ya esta roto? No has tenido en cuenta la posibilidad de aprender a esquivar el poro? \nCon el tiempo te acostumbras a esquivar esas habilidades como te acostumbraste a esquivar las lanzas de {{champion:76}} ...y si no te acostumbraste... no mereces pisar el sagrado suelo de ARAM.\n\n\nSaludos.","replies":[{"poster":"Neoburstx","date":"2015-04-30T17:44:42.139+0000","up_votes":6,"down_votes":0,"body":"los minion y aliados no esquivan y gracias a eso los asesinos te caen encima igual","replies":[{"poster":"Revolución","date":"2015-05-06T22:26:32.936+0000","up_votes":1,"down_votes":0,"body":"se, yo suelo apuntarlo a minions, la verdad no me interesa tanto los 25 de daño verdadero que pega el poro sino acercarme para usar mi súper aoe sobre los rivales","replies":[]}]},{"poster":"ElectricViolet","date":"2015-04-30T20:30:09.874+0000","up_votes":4,"down_votes":0,"body":"Por mucho que se esquive, no podés pedir que tus aliados tengan tus mismas mecánicas.\nEl último aram que jugué ayer me tocó una Jinx que salió 3/16 por comerse todos los poros de la mano de un Volibear.\nHacé de cuenta que no es una Nidalee. Son 5.\nTenés unos 250 aram, no veo demasiada experiencia por ahí.\nJuego al mapa desde que salió en la Season 3 y la verdad es que con este hechizo lo arruinaron por completo.","replies":[]},{"poster":"BlackStarDark","date":"2015-04-29T22:02:54.880+0000","up_votes":1,"down_votes":2,"body":"+10 jaja","replies":[{"poster":"Shino Asada","date":"2015-05-04T21:19:25.010+0000","up_votes":1,"down_votes":0,"body":"fenomeno!","replies":[]}]}]},{"poster":"Megazrael","date":"2015-05-01T00:06:23.880+0000","up_votes":4,"down_votes":0,"body":"La verdad me parece un ASCO el nuevo summoner.\n¿Por qué?\nPorque el summoner no está limitado para los que no tienen rango o forma de aproximarse.\nVoy a dar unos ejemplos de los beneficiados:\nAkali: todos sabemos lo que pega y los plays que se pueden hacer con su R. Ahora le suman una R.\nZed: igual que Akali.\nMorgana: ¿Cuál es la gracia del ulti si con un summoner sin cooldown te podes posicionar en el medio del oponente? Ninguna.\nMaokai: Tiene un rango corto de su W para que no sea algo tan grosero, puff, olvidense, summoner y listo.\nShen: Lo mismo que Maokai pero con el taunt.\nMalphite: Ulti, el mejor engage de tank a mi entender. No es necesario.\n\n¿Quieren otra sorpresa?\nSe puede buildear la Warmog. Que se había sacado para que los no tank tengan posibilidades ante un dive.\n\nEn resumen: Beneficia a muy pocos champs, y overpowerea (inventé un verbo) a muchos que no lo necesitaban. \nA esto sumenle que ARAM es aleatorio, y hay veces que las partidas tienen mucha desventajas. Esto lo multiplica por 2.\n\nLa verdad, me sacó las ganas de jugar ARAM, creo que deberían ponerlo como un modo de juego extra (que no les cuesta nada).\n\nPongan el modo del King Poro, y que los que les gusta jueguen ahí. Me parece poco \"serio\" este ARAM.\n\nMi humilde opinion, saludos y hasta una nueva corrección al modo.","replies":[]},{"poster":"Runth","date":"2015-04-29T19:29:41.282+0000","up_votes":1,"down_votes":1,"body":"Nein\n\nEsta op y sera el hechizo remplazando al uselees {{summoner:4}}","replies":[{"poster":"Report Ziggs","date":"2015-04-30T06:11:25.781+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Runth,realm=LAS,application-id=v7qsfXsE,discussion-id=f7TEWrNx,comment-id=0000,timestamp=2015-04-29T19:29:41.282+0000)\n>\n> Nein\n> \n> Esta op y sera el hechizo remplazando al uselees {{summoner:4}}\n\n\"El useless flash\"\n\nClaro, campeón, sigamos el consejo del gran Runth LVL 30 unranked en LAS\n\nhttp://puu.sh/hvZXo/1546882ef2.jpg\n\nLINDA BUILD, Twitch con Morello.","replies":[{"poster":"ElectricViolet","date":"2015-04-30T20:39:24.275+0000","up_votes":1,"down_votes":0,"body":"Jaja xD, me hiciste el día. Gente de esa especie me cruzo todo el tiempo en ARAM. Pero eso no es nada: vi hasta a un Garen con Morello.","replies":[]},{"poster":"Runth","date":"2015-04-30T16:40:47.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GG Ziggs,realm=LAS,application-id=v7qsfXsE,discussion-id=f7TEWrNx,comment-id=00000000,timestamp=2015-04-30T06:11:25.781+0000)\n>\n> \"El useless flash\"\n> \n> Claro, campeón, sigamos el consejo del gran Runth LVL 30 unranked en LAS\n> \n> http://puu.sh/hvZXo/1546882ef2.jpg\n> \n> LINDA BUILD, Twitch con Morello.\n\nMuajajajaja Muaaajajaja","replies":[]}]},{"poster":"ElectricViolet","date":"2015-04-30T20:37:46.691+0000","up_votes":1,"down_votes":0,"body":"Todos los que dicen que Flash es useless en ARAM deberían desinstalar el juego.\nDe verdad.\nProbá no usar Flash en normal (ya que ranked no jugás) y salir vivo de todas las teamfight. Porque ARAM es eso: una teamfight permanente.","replies":[{"poster":"Runth","date":"2015-04-30T21:21:23.004+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ElectricViolet,realm=LAS,application-id=v7qsfXsE,discussion-id=f7TEWrNx,comment-id=00000001,timestamp=2015-04-30T20:37:46.691+0000)\n>\n> Todos los que dicen que Flash es useless en ARAM deberían desinstalar el juego.\n> De verdad.\n> Probá no usar Flash en normal (ya que ranked no jugás) y salir vivo de todas las teamfight. Porque ARAM es eso: una teamfight permanente.\n\n{{summoner:6}}  Me hablaban, \n\nel flash lo usaba cuando era un novato posicionarme y ahora uso el fantasma , el hechizo nuevo, curacion y varios hechizos dependiendo que campeon me toca porque es *azar*\n\nPara la grieta mmm lo uso si es un champ que no tiene escape , nada mas\n\n{{summoner:4}}  {{item:3070}} \n\n{{summoner:6}}  =)","replies":[{"poster":"Revolución","date":"2015-05-06T22:30:38.652+0000","up_votes":1,"down_votes":0,"body":"Recuerdo el día que en un creador de equipos apareciste con Skarner y en lugar de poner \"listo\" cuando un compañero preguntó dijiste \"para qué si no voy a jugar\" y te eché. No regrets.","replies":[{"poster":"Runth","date":"2015-05-07T00:50:41.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=404 Rocket Balde,realm=LAS,application-id=v7qsfXsE,discussion-id=f7TEWrNx,comment-id=0000000100000000,timestamp=2015-05-06T22:30:38.652+0000)\n>\n> Recuerdo el día que en un creador de equipos apareciste con Skarner y en lugar de poner \"listo\" cuando un compañero preguntó dijiste \"para qué si no voy a jugar\" y te eché. No regrets.\n\nBff el pasado es historia\n\n{{summoner:32}}","replies":[]}]}]}]}]},{"poster":"Mariscal Mostaza","date":"2015-04-30T02:20:15.222+0000","up_votes":4,"down_votes":0,"body":"Es horrible esto. Los tanques perdieron el sentido... Se puede acceder a los adc o magos con esta porqueria de spell.","replies":[]},{"poster":"lordeman10","date":"2015-04-30T20:44:20.986+0000","up_votes":2,"down_votes":2,"body":"ojala lo dejen así está op pero es muy divertido\n\n-un jugador que entra a aram 1 vez por semana :P","replies":[{"poster":"Megazrael","date":"2015-05-01T12:13:51.855+0000","up_votes":3,"down_votes":0,"body":"Tu comentario ejemplifica a la perfección mi opinión.\nEsto es exactamente lo que pienso:\nPara el que juega una partida cada tanto le parece muy divertido. Pero imaginate si lo hacen en la Grieta. El foro estallaría. Yo juego ARAM (jugaba bah) como hay gente que juega rankeds o normales en la Grieta, muy seguido, y la verdad es que ya no es un modo táctico. Es un campo de batalla donde la gracia de los campeones se pierde (no voy a explicar todos los ejemplos que vi otra vez XD).\n¿Tan difícil es hacer un modo con la marca y otro sin ella? Todo esto salió del KING PORO y había gente que le encantaba. (No se si anteriormente hubo otro modo con esto).\nDigo, no quiero que lo saquen porque evidentemente a mucha gente le gusta como a otra no, pero si en definitiva el que juega a un modo no puede jugar al otro a la vez y la cantidad de gente sería la misma... \nPersonalmente dejé de jugar LoL por esto y si hay algo que aprendí es que mientras más gente tiene un juego menos escuchan a los jugadores.\nEs una moda, y como toda moda hay cosas que dejan de ser usadas sin sentido para ser reemplazadas por otras que van a dejar de ser usadas sin sentido *bucle*.","replies":[]}]},{"poster":"ElectricViolet","date":"2015-04-30T20:45:47.352+0000","up_votes":3,"down_votes":0,"body":"Totalmente, desbalancearon por completo el modo.\nEra lo único que jugaba por no haber Dominion y ahora nos sacan eso también.\nTenía gracia cuando lo pusieron en la Leyenda del Rey Poro porque formaba parte del contexto del minijuego (si pegabas x poros invocabas al Rey Poro y blabla), pero en los ARAM normales carece por completo de gracia.\nCampeones como Volibear, Singed o Wukong están completamente fuera de sí gracias a este spell. Y como hicieron de ARAM un Blind Pick (antes se podía ver desde el segundo 0 los campeones enemigos), no se puede dodgear si se ve alguno de esos personajes enfrente.\n\nLas bombas de Ziggs se pueden esquivar, las lanzas de Nidalee tambien, lo mismo con las skills de Lux.\nBasta con que un Volibear pegue un poro aunque sea a un minion que esté cerca de tu equipo, para tirarse y hacer un estrago.","replies":[]},{"poster":"XElektro","date":"2015-04-30T02:13:42.630+0000","up_votes":4,"down_votes":1,"body":"deacuerdo, el ARAM es un asco ahora.","replies":[]},{"poster":"Tidebringer","date":"2015-04-30T20:47:26.953+0000","up_votes":1,"down_votes":2,"body":"Para mi esta bien, el spell no es dificil de esquivar y tambien le da un cambio al modo para que no sea tan monotono, aunque como siempre el equipo con mas tankes tiene una leve ventaja.","replies":[{"poster":"XElektro","date":"2015-04-30T23:12:46.734+0000","up_votes":2,"down_votes":1,"body":"Los minions no esquivan las bolas de nieve. . .","replies":[{"poster":"Tidebringer","date":"2015-05-01T09:46:27.438+0000","up_votes":1,"down_votes":3,"body":"Y alejate de los minions... pensa un poquito","replies":[{"poster":"Megazrael","date":"2015-05-01T12:01:48.912+0000","up_votes":2,"down_votes":1,"body":"No hay mucho espacio, si los 5 se alejan de los minions y te tiran una \"Marca\" ahi enganchan a los 5 juntos.\nSe nota que no jugás ARAM.","replies":[{"poster":"Tidebringer","date":"2015-05-01T13:03:35.215+0000","up_votes":1,"down_votes":3,"body":"We que manga de llorones que son por dios","replies":[{"poster":"XElektro","date":"2015-05-06T20:53:20.002+0000","up_votes":3,"down_votes":0,"body":"a donde te puedes alejar de los minions? a la jungla?\nSe ve que no juegas ARAM","replies":[]}]}]}]}]}]},{"poster":"rokushoger","date":"2015-04-29T22:04:37.107+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo en que el cd es un poco corto, pero tampoco me parece taaaaaaaaaaaan mal, hoy me tocó con un xerath y por mucho poro que tenían no me podían agarrar, es cuestión de esquivarlos, o mejor aún, dejarte pegar y llevarlos al medio de tu furioso y hambriento de sangre team.","replies":[]},{"poster":"iNodlon","date":"2015-05-04T21:02:15.617+0000","up_votes":1,"down_votes":1,"body":"{{summoner:32}}","replies":[]},{"poster":"Runth","date":"2015-04-29T20:41:57.170+0000","up_votes":1,"down_votes":1,"body":"{{champion:127}}  El ARAM es mio mio mio","replies":[]},{"poster":"PATH Kamui","date":"2015-04-29T20:41:12.807+0000","up_votes":3,"down_votes":3,"body":"Lloran por todo loco! que el nerf a mi {{champion:222}} , que esto, que lo otro... DISFRUTEN!","replies":[]},{"poster":"RNGesus","date":"2015-04-30T06:26:07.854+0000","up_votes":1,"down_votes":2,"body":"Y bueno alguna debilidad tenian que tener esos chams  ,  su win rate en aram es muy alto , osea no podes quejarte si te toca nidale o ziggs en aram por que ya champions con hard poke condicionan la victoria facilmente , ahora va a ser mas facil deletearlos teniendo un supergapcloser","replies":[]},{"poster":"Runth","date":"2015-05-01T11:21:21.458+0000","up_votes":1,"down_votes":3,"body":"{{summoner:31}}  toy op\nme gusta verlos llorar por la actualizacion del arams. con ese hechizo , bye pokes , lo lamento tanto","replies":[]}]}