{"poster":"Lucas7ARG98","date":"2015-12-02T17:09:51.260+0000","title":"Castigos para la gente no hábil que juega Partidas Clasificatorias.","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":22,"body":"**Bien , simplemente eso.\r\nLas Ranked est&aacute;n para ganar no para hacer relaciones sociales.\r\nPorque?\r\nPorque LoL es un juego en equipo :::Organismo::: falla 1 falla el sistema.\r\nSi Tenes un KDA p&eacute;simo y tenes una racha de derrotas en los que se analiza que vos tuviste gran parte del peso de el mismo resultado. EXCLUIRTE DE LAS CLASIFICATORIAS durante cierta cantidad de tiempo.\r\nAs&iacute; el juego obliga al jugador a ganar exp en normales.\r\n\r\nBasta de banear a los Flamers o ragers.\r\nPorque? Porque son gente que juega para ganar no para que vaya un support blitzcrank full ad a feedear a un vayne .\r\nNo para que juegues malphite erres el ulti y despu&eacute;s en ves de meterle cc y focus al mas fed le pegues a un alistar.\r\n\r\nY bueno nada creo que RIOT debe diferenciar a los jugadores en los que juegan para ganar porque las clasificatorias est&aacute;n para eso y los que juegan normal para divertirse &uacute;nicamente.\r\n\r\nGracias**","replies":[{"poster":"Silver000","date":"2015-12-02T17:20:13.802+0000","up_votes":10,"down_votes":2,"body":"creo que esto es innecesario","replies":[{"poster":"Lucas7ARG98","date":"2015-12-02T17:24:48.067+0000","up_votes":2,"down_votes":14,"body":"Tu kda es pésimo.\njugas de support únicamente (no estoy diciendo q ser suport es malo) y rendís no mas con sona,\nNO OPINES","replies":[{"poster":"Khimea","date":"2015-12-02T17:25:13.451+0000","up_votes":16,"down_votes":0,"body":"Flammer detected.","replies":[{"poster":"Lucas7ARG98","date":"2015-12-02T17:31:48.392+0000","up_votes":2,"down_votes":14,"body":"Obvio que soy flamer.\nSi quieres divertirte y manquear estan las normals :)","replies":[{"poster":"Khimea","date":"2015-12-02T17:51:32.732+0000","up_votes":11,"down_votes":0,"body":"Yo me divierto jugando con una cuenta secundaria y ganandole a gente como vos :D\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"xHolsa","date":"2015-12-02T20:28:13.402+0000","up_votes":3,"down_votes":0,"body":"OOOOOOOOOHHHHHHHHHHHHHHHHHH","replies":[]}]},{"poster":"MrDax","date":"2015-12-03T06:15:55.415+0000","up_votes":6,"down_votes":0,"body":"Otro simio que piensa que flameando va a lograr que los demas jueguen mejor\n\nhttp://cdn.makeagif.com/media/10-14-2015/lOFS29.gif","replies":[]},{"poster":"Silver000","date":"2015-12-03T01:59:48.379+0000","up_votes":1,"down_votes":0,"body":"y ¿puedo divertirme y no manquear?","replies":[]}]},{"poster":"Silver000","date":"2015-12-02T17:38:04.986+0000","up_votes":1,"down_votes":0,"body":"jjajajjaajaj","replies":[]}]},{"poster":"Platinum491","date":"2015-12-02T17:46:25.246+0000","up_votes":12,"down_votes":0,"body":"Juegas Jax y no le pones ítem defensivos, le pones guinsoo a Azir y apariencia espiritual, estas en bronce 2 \nNO OPINES.\n\nAhora hablando enserio, intenta ver tus propios errores e intentar mejorar antes de culpar a tus compañeros, además recuerda que siempre uno de los 2 equipos perderá, así que no te frustres si tu equipo no llega a ser el ganador, además el KDA no está directamente conectado a tu influencia en la partida","replies":[{"poster":"Silver000","date":"2015-12-03T01:31:27.256+0000","up_votes":1,"down_votes":0,"body":"XD me criticaba y yo estoy en bronce 1","replies":[]}]},{"poster":"Silver000","date":"2015-12-02T17:37:05.903+0000","up_votes":4,"down_votes":0,"body":"que solo me anime a jugar con {{champion:37}}  no quiere decir que es la única que se usar, solo que me tengo mas confianza con ella, ademas ¿por que no debería opinar? esto no es algo que este sujeto a las habilidades sino algo que esta sujeto al pensamiento de cada uno","replies":[]},{"poster":"Nehalem","date":"2015-12-02T18:00:34.919+0000","up_votes":2,"down_votes":0,"body":"Uff que flamer, se te nota a distancia.","replies":[]}]}]},{"poster":"Shiny Teemo","date":"2015-12-02T18:31:50.431+0000","up_votes":9,"down_votes":0,"body":"Me parece insólito que con 962 ranked y siendo bronce 2 vengas a crear este post.","replies":[{"poster":"Shijim4 de Virgo","date":"2015-12-02T18:59:25.081+0000","up_votes":6,"down_votes":0,"body":"Es bronce 2??? Que Dios se  apiade de nosotros","replies":[{"poster":"Betrayed Ahri","date":"2015-12-02T20:08:40.284+0000","up_votes":3,"down_votes":0,"body":"y la biblia dice que vienen cosas peores...","replies":[]}]}]},{"poster":"Lince Salvaje","date":"2015-12-02T18:21:47.748+0000","up_votes":9,"down_votes":1,"body":"es una medida totalmente innecesaria... ademas eres el típico flamer que lleva a que el team pierda...\nno pueden castigar a alguien por tener una mala racha de partidas... los mismos rioters te lo dicen si da lo mejor de si en una partida perfecto gane o pierda...\nes un juego es para divertirse...\nle hablaste de rendimiento a silverooo.. ahora digo te viste a vos ?? sos un bronce 2 con mas partidas perdidas que ganadas, tampoco le podes decir a un jugador que no o opine, estas publicando algo en un foro publico donde todos podemos opinar (respetándonos).\nsi sigues con esa actitud no me sorprendería que terminaran sancionando ademas de que veo que tienes 0 noción de lo que es un team... \ncambia de actitud y por cierto no creo que tu idea se valla a implementar ni en este ni en este ni en ningun juego xD","replies":[{"poster":"Ari","date":"2015-12-04T00:57:21.824+0000","up_votes":1,"down_votes":6,"body":"PD: ahi tenes un -1, gente como vos arruina nuestro servidor, toda esa gente que agarra antimetas en ranked y trollea, te diria mas cosas, incluso te insultaria, pero riot me va a bannear injustamente.","replies":[{"poster":"Platinum491","date":"2015-12-04T01:26:21.204+0000","up_votes":2,"down_votes":0,"body":"Gente como VOS arruina el servidor, siempre se debe tener una actitud positiva y toleracia hacia el pick del compañero, nunca se sabe si la persona que lo esta usando tenga un muy buen rendimiento con el campeon, -1","replies":[]},{"poster":"Lince Salvaje","date":"2015-12-04T13:53:15.857+0000","up_votes":1,"down_votes":0,"body":"define trollear.... agarrar algo anti meta no es perder un juego... \nmas de 1 ves he pickeado a un teemo mid o top y mas de una ves he ganado... \naprendi y solo jugue a bardo en rankeds y es uno de mis mejroes campeones....\nademas si te frustas por un juego y llegas al punto de insultar... te diria que vallas a alguna clase de control de la ira o mejor jugues con bots porque no estas preparado para lo que es el ambito multiplayer","replies":[]},{"poster":"MrDax","date":"2015-12-04T04:18:56.175+0000","up_votes":1,"down_votes":0,"body":"notese el \"injustamente\"\nAHAHAHA","replies":[]}]},{"poster":"Ari","date":"2015-12-04T00:58:45.323+0000","up_votes":1,"down_votes":3,"body":"nono no es para divertirse llegas a tocarme en ranked y yo te reporto las ranked son para ganar las normales para divertirse.","replies":[{"poster":"Silver000","date":"2015-12-04T03:52:53.530+0000","up_votes":2,"down_votes":1,"body":"¿si sabes que alguien puede divertirse y esforzarse al mismo tiempo?","replies":[]}]}]},{"poster":"ElClarke","date":"2015-12-02T18:18:05.658+0000","up_votes":6,"down_votes":0,"body":"_La cantidad de publicaciones de este tipo es bastante interesante._\nNose por donde empezar, excluir a la gente que quiera jugar ranked por jugar mal? No es por ofender, pero estas en bronce 2, no entiendo que tipo de nivel especulas ver. **Si fueras lo suficientemente bueno como te proclamas, subirias sin problemas**, ya que si esa gente \"con kda pesimo\" tambien esta en el otro equipo y no solo en el tuyo, acaso me vas a decir que en el otro equipo estan todos los smurfs que arrasan con lo que se encuentren?\n\n**Basta de banear Flamers y Ragers?** Es la gente que peor juega, usa el potencial que podria usar jugando bien, en molestar y acosar a sus compañeros. \n\n_Porfavor, dejen de hacer estas publicaciones por el solo hecho de perder un par de partidas._","replies":[{"poster":"Nywt","date":"2015-12-02T18:48:38.478+0000","up_votes":3,"down_votes":0,"body":"Se que soy lvl 26, pero creo que tu forma de ver el tema es la correcta ;) ( la forma de pensar de ElClarke no del que escribio la discusion)","replies":[]}]},{"poster":"Li Grim","date":"2015-12-02T18:27:34.843+0000","up_votes":4,"down_votes":0,"body":"Ya te vi en 2 post apoyando a los que se fueron de ban permanente, merecidamente por insultar al equipo o insultar porque alguien decidió trollear.\n\n¿Te digo algo? para de justificar a los flamer: son gente insoportable que creen que TODO lo tenemos que hacer a su gusto, que nos hagamos plays imposibles, que le atinemos a todos los skillshots, que defendamos una torre solos contra 5 del equipo enemigo, que spameen la señal de interrogación cuando hacemos algo \"malo\". BIEN MERECIDO TIENEN ESE BANEO, y si sigues con esa lógica tu también lo recibirás muy pronto.","replies":[{"poster":"Ari","date":"2015-12-04T00:54:14.927+0000","up_votes":1,"down_votes":3,"body":"nonono es que vos no entendes amigo esta el flamer que critica por cualquier cosa y el flamer que se enoja porque otro viene a divertirse en la ranked y se la arruina, que a vos no te importe ganar no significa que al resto no.","replies":[{"poster":"Li Grim","date":"2015-12-04T02:00:20.022+0000","up_votes":2,"down_votes":0,"body":"Lee de nuevo, porque en ningún momento dije que juego no me importe ganar en rankeds, de hecho hasta las normales me gusta ganar, obviamente es inaceptable que alguien se meta a una ranked sin importarle el resultado, hiciste una mala inferencia.\n\nPero resulta que si le echas un ojo a las respuestas que este tipo está dando, se nota que es un flamer que se enoja por cualquier cosa, de los que dicen \"gg\" cuando pierden una tf o los que flamean a alguien porque su rival se feedeó de quién sabe donde. Mira, échale un ojo al primer comentario, le está exigiendo a un tipo que no opine solo porque tiene unas partidas malas en su historial, por si fuera poco, cree que el no puede tener una mala partida y no tolera la opinión del que piensa diferente, o sea ¿qué más pistas que esas para comprobar su actitud? Además TODOS somos victimas de trolls, afk o gente que no le importa ganar y nos la aguantamos, ¿por qué el no?\n\nPD: flamear es malo en cualquier situación; repito: CUALQUIER situación, después de todo ahí tienes el botón de report y 500 caracteres para fundamentar.","replies":[{"poster":"Ari","date":"2015-12-04T11:27:27.455+0000","up_votes":1,"down_votes":0,"body":"yo no se que tal sera el, pero nadie tiene por que bancarse a un tipo que viene con intenciones de perder la partida en ranked, si riot no hace nada contra los que trollean y apenas le ponen cola de baja prioridad a los afk, no queda otra que flammear, nadie tiene por que aguantarse a un nasus AD con 40 de farm al min 30, si riot no hace nada contra ellos no queda otra.","replies":[]}]}]}]},{"poster":"Khimea","date":"2015-12-02T17:27:07.731+0000","up_votes":3,"down_votes":0,"body":"No pretendas nivel cuando estas en LAS.\nRecien a partir de  Diamante 3 se ve la gente que sabe jugar.\nInnecesaria esta idea, todos tenemos un mal dia.\n{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Lucas7ARG98","date":"2015-12-02T17:34:53.115+0000","up_votes":2,"down_votes":5,"body":"todos tenemos un mal día......Les ves el historial y tiras esa idea a la basura.","replies":[]}]},{"poster":"Ahristócrata","date":"2015-12-03T20:29:21.395+0000","up_votes":1,"down_votes":0,"body":"Tu actitud me dice que no te queda mucho tiempo de vida en el server.","replies":[]},{"poster":"NaOH","date":"2015-12-02T21:33:35.297+0000","up_votes":1,"down_votes":0,"body":"Estas en bronce 2 y criticas a los demas jugadores? mamita querida...","replies":[]},{"poster":"SilentRado","date":"2015-12-02T19:52:18.249+0000","up_votes":1,"down_votes":0,"body":"El hecho de tener que tener 16 campeones para jugar rankeds me parece una restricción muy leve, deberían hacer uso de la cantidad de victorias normales (Incluyendo teambuilder o no, dependerá del estado del mismo) y de esa manera evitamos a los novatos que se compran 3 {{item:3083}} con {{champion:266}} y también a los smurfs que cuando ven que no llegan a retador se ponen a jugar en Bronce para sentirse profesionales...\n\nLa idea podría ser buena pero la manera de expresarla es un poco confusa y como dijeron antes parece que estás siendo muy agresivo con los demás.\n\nActualmente no juego rankeds porque siento que me falta experiencia justamente pero ya tengo unos 2 años jugando y la verdad me divierto jugando cosas experimentales o refinando mis campeones en normales nomas, creo que entiendo mas o menos tu idea.","replies":[]},{"poster":"Ari","date":"2015-12-04T00:51:32.714+0000","up_votes":1,"down_votes":5,"body":"completamente de acuerdo, esa es la actitud que deberia tener el servidor, las rankeds se juegan solo para ganar y punto, si no te gusta que te flameen te vas a normal y jugas braum jungla con devorador.","replies":[]}]}