{"poster":"IvVicious","date":"2019-08-16T21:57:36.355+0000","title":"¿Por qué en nuestro foro se permiten discusiones sobre política?","subforum":"Charlas Generales","up_votes":14,"down_votes":2,"body":"######Puesto en Charlas Generales porque es una charla sobre el foro, y al menos tiene algo que ver con el mismo.\r\n\r\nHago este post porque mi última interacción con soporte me sacó totalmente las ganas de mandar tickets, aunque si busco una respuesta \"oficial\" debería preguntar ahí. Whatever.\r\n\r\nEste fragmento fue copiado de las [Reglas Universales](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/4LgZ2EwM-universal-rules) del foro de NA y traducido pa' los que no entienden inglés:\r\n\r\n> ##Este no es el lugar para:\r\n>* Discusiones inapropiadas\r\n>\r\n>##Los moderadores buscarán temas discutiendo:\r\n* Religión\r\n* Sexo\r\n* Política\r\n* Cualquier problemática social, aunque algunas excepciones puedan ser apropiadas (por ejemplo, legislación de internet)\r\n\r\nSi bien entiendo que cada región tiene sus distintas necesidades y que el foro de NA alberga gente de 3 o 4 servidores distintos, no entiendo por qué las reglas básicas deberían ser distintas en cada foro. Sí, que off-topic es para temas que no sean de LoL, pero qué cuerno tiene que ver el foro de un videojuego con cuestiones políticas, ¿no?\r\n\r\nEn un pasado, las reglas decían que el acceso al foro era un privilegio y no un derecho, pero últimamente veo que hay muchos usuarios que se pasan ese \"privilegio\" por donde no les da el sol, es un poco decepcionante sentir que volvemos a estar a la buena de dios sin mods que se pasen aunque sea a comentar si es que no van a moderar.\r\n\r\n\r\nTe extraño, Achungo, yo sí te quería.\r\n\r\n\r\n\r\nY hagan algo con las multicuentas. No puede ser que alguien acepte abiertamente publicar con 3 cuentas y las 3 sigan ahí xD","replies":[{"poster":"TvTLucio22","date":"2019-08-16T22:04:24.622+0000","up_votes":8,"down_votes":0,"body":"O sea, no tengo drama si es de forma civilizada, nuetral y con respeto, sobretodo si lo que se quiere es \"informar\". Si es un \"vota a de la rua, porque es el más groso aunque no se presente\", bardearlo no es suficiente...\n\nPor ejemplo, un post que fue genial de política fue del domingo que decía algo tipo \"gente, acuérdense que hoy se vota, vayan temprano así pueden jugar más tiempo y voten de acuerdo a lo que crean mejor para el país, recuerden que no todo es macri o fernandez\". Más neutral y positivo no se podia pedir","replies":[{"poster":"Excorpion","date":"2019-08-16T22:52:34.573+0000","up_votes":3,"down_votes":0,"body":"Bastaba con mirar los posts... ver la carga politica, las discusiones... los ataques entre usuarios... eran para borrados.","replies":[]},{"poster":"Mazoku","date":"2019-08-17T00:00:20.056+0000","up_votes":1,"down_votes":5,"body":">  y voten de acuerdo a lo que crean mejor para el país\n\n---\n\n> Más neutral \n\nEso que cite no es para nada neutral. De hecho la mayoria de la gente vota en base al beneficio propio (lo cual es algo obvio).","replies":[{"poster":"TvTLucio22","date":"2019-08-17T02:18:57.321+0000","up_votes":2,"down_votes":1,"body":"De hecho, se supone que no elegís un presidente para vos, sino para todos, so...\n\nRe que lo que dijo el tipo fue más una sugerencia que otra cosa...","replies":[{"poster":"Tezs","date":"2019-08-17T17:16:15.102+0000","up_votes":1,"down_votes":2,"body":"Yo siempre elijo lo que mas me beneficie a mi y a los que me rodean, de que sirve que todos estén bien y vos mal, no somos héroes o personajes de ficción para soportar esas cosas.","replies":[{"poster":"TvTLucio22","date":"2019-08-17T18:35:08.977+0000","up_votes":3,"down_votes":0,"body":"Acordate de ese egoísmo cuando te pase algo y necesites pedir a alguien...\n\nSi vos estas mal, votar por lo mejor para el pueblo es lo mejor para vos (por porcentaje, la mayor parte de la población es pobre, seguido de la clase media, por lo que las medidas populares te van a beneficiar). Si vos estas bien, para que queres que los otros estén mal para tener 5 pesos más por mes? Eso habla medio tres cuartos mal de vos...","replies":[{"poster":"Tezs","date":"2019-08-18T20:05:07.000+0000","up_votes":1,"down_votes":1,"body":"Lo que quería expresar era y si te perjudica en serio prefieres el bien mayor al tuyo ?. Solo no soy hipócrita y digo lo que cualquiera haría.\nLa moral nunca esta en los malos momentos, solo quedan valores y esos son escasos.","replies":[{"poster":"TvTLucio22","date":"2019-08-19T00:12:07.023+0000","up_votes":1,"down_votes":0,"body":"Re que la moral va de la mano de los valores, so...\n\nSi me perjudica en algo pero me la puedo bancar sin drama, entonces es más que obvio que no formo parte de la población más necesitada (o sea, la mayor parte de la población), por lo que optaría por eso sin dudarlo. Si me perjudica algo pero no tanto como para tener que cambiar mi modo de vida, también optaría por eso. Si cualquier cambio me dejase dentro del índice de pobreza, es más que obvio que las decisiones que ayudan a la mayor parte de la población me convendrían, so...","replies":[]}]}]}]},{"poster":"Mazoku","date":"2019-08-17T04:33:10.350+0000","up_votes":1,"down_votes":4,"body":"> De hecho, se supone que no elegís un presidente para vos, sino para todos, so...\n\nQuien supone eso? jaja\n\n> Re que lo que dijo el tipo fue más una sugerencia que otra cosa...\n\nSep, una valoracion personal para nada neutral.","replies":[{"poster":"TvTLucio22","date":"2019-08-17T05:32:11.729+0000","up_votes":2,"down_votes":0,"body":">Quien supone eso?\n\nWelp, \"democracia\" significa gobierno DEL PUEBLO, por lo que se supone que uno debería buscar lo mejor para el pueblo. \n\nDe por sí, siempre dije que esos que dicen que \"el país va a salir adelante cuando todos se den cuenta que igual hay que ir a laburar\" o \"al país se lo saca laburando\" eran frases erróneas. La única forma de que un país cualquiera mejore realmente, es cuando los ciudadanos dejen de votar para ellos y entren a votar a favor de la mayoria...","replies":[{"poster":"Mazoku","date":"2019-08-17T06:18:08.350+0000","up_votes":1,"down_votes":3,"body":"> Welp, \"democracia\" significa gobierno DEL PUEBLO, por lo que se supone que uno debería buscar lo mejor para el pueblo.\n\nUna cosa no esta relacionada con la otra.\n\n> De por sí, siempre dije que esos que dicen que \"el país va a salir adelante cuando todos se den cuenta que igual hay que ir a laburar\" o \"al país se lo saca laburando\" eran frases erróneas. La única forma de que un país cualquiera mejore realmente, es cuando los ciudadanos dejen de votar para ellos y entren a votar a favor de la mayoria...\n\nOsea cuando la teoria de juegos en su totalidad deje de ser vigente.\n\nYa de por si el decir \"lo mejor para el pais\" esta cargadisimo de politica. El decir \"en favor de la mayoria\" es claramente una ideologia utilitarista.","replies":[{"poster":"TvTLucio22","date":"2019-08-17T07:22:29.917+0000","up_votes":1,"down_votes":0,"body":"> Una cosa no esta relacionada con la otra\n\nDesde el punto de vista logico, si deberían estar relacionadas. Lo que decís es como que quieras que un biólogo solo estudie rocas, una incongruencia total\n\n>esta cargadisimo de politica\n\nBásicamente toda acción tiene su tinte político, so...","replies":[{"poster":"Mazoku","date":"2019-08-17T07:38:02.028+0000","up_votes":1,"down_votes":3,"body":"> Básicamente toda acción tiene su tinte político, so...\n\nSo no advoques por neutralidad dando como ejemplo frases que son altamente politicas.","replies":[]}]}]}]}]}]}]},{"poster":"Mona","date":"2019-08-16T23:51:02.582+0000","up_votes":2,"down_votes":0,"body":">\"vota a de la rua, porque es el más groso aunque no se presente\"\n\nPero está muerto ese hombre","replies":[{"poster":"TvTLucio22","date":"2019-08-17T02:19:33.132+0000","up_votes":2,"down_votes":0,"body":"Cierto que se murió hace poco, ni me acordaba jajajaja","replies":[]}]},{"poster":"Salvor","date":"2019-08-16T22:43:55.927+0000","up_votes":2,"down_votes":0,"body":"> gente, acuérdense que hoy se vota\n\nSi, el post nomas, entrabas a los comentarios y lo mismo de siempre: \"no entendes nada socialista empobrecedor\" xD","replies":[{"poster":"TvTLucio22","date":"2019-08-16T23:27:43.265+0000","up_votes":1,"down_votes":0,"body":"Yo dije que ese post estaba bien hecho, no podemos culpar al Chango de los comentarios de los otros jajajaja","replies":[]}]},{"poster":"ZEROWINS","date":"2019-08-17T21:39:33.825+0000","up_votes":1,"down_votes":0,"body":"en sudaca united no podes..somos mononeuronales que hateamos e insultamos, generando asi q no podamos conversar e intercambiar opiniones sin insultarnos.\n\nshame on u sudamerica querida....","replies":[{"poster":"TvTLucio22","date":"2019-08-17T22:32:06.946+0000","up_votes":1,"down_votes":0,"body":"> somos mononeuronales que hateamos e insultamos\n\nOjo, si te referís a lo pasionales que somos con varias cosas (fútbol, por ejemplo), no somos solos los sudamericanos, son basicamente los descendientes de España e Italia (las 2 grandes potencias migratorias que tuvimos)","replies":[{"poster":"ZEROWINS","date":"2019-08-19T00:06:06.280+0000","up_votes":1,"down_votes":0,"body":"claro..entiendo lo q me dices..pero no..no me refiero a lo pasional.. hablo de los hater que por ahi somos.\n \ncon tu ej del futbol:\no sea ser pasional es algo pero si yo voy y me pongo a pelear con un hincha rival (insultos, piñas, etc) eso es ser pasional?..no, a eso me refiero. (igual hablo de manera gral, se que no todos somos asi).","replies":[]}]}]}]},{"poster":"Hnk Kenshiro","date":"2019-08-17T00:37:27.893+0000","up_votes":4,"down_votes":0,"body":"Lo que simplemente hay que implementar, es tapar los sub foros que no queremos ver xd","replies":[{"poster":"IvVicious","date":"2019-08-17T17:17:25.440+0000","up_votes":1,"down_votes":0,"body":"No tendría por qué ocultar una categoría entera por un par de posts que ni corresponden al foro pero ok xd","replies":[]},{"poster":"Hell Darking","date":"2019-08-17T01:17:49.517+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/Gdey6V4.jpg?nodirect","replies":[]}]},{"poster":"Hell Darking","date":"2019-08-16T22:01:11.802+0000","up_votes":2,"down_votes":0,"body":"estan en offtopic y ahi hay muchos vacios legales, ademas los mods prefieren borrar otros post (como los mios HDPS!) y ps.. tenemos post sobre politica","replies":[{"poster":"IvVicious","date":"2019-08-16T22:09:07.986+0000","up_votes":4,"down_votes":1,"body":"Claro pero en NA por ejemplo off-topic no existe así que usan Discusiones Generales como off-topic Y como discusiones generales de LoL, y justamente tampoco permiten las discusiones políticas, aunque sí todo lo demás.\nNecesitamos mejores reglas y que dejen de borrarle los post a Hell Darking\n{{sticker:sg-shisa}}","replies":[{"poster":"TvTLucio22","date":"2019-08-16T22:17:32.941+0000","up_votes":2,"down_votes":0,"body":"Pregunta: quien es ese?","replies":[]}]},{"poster":"Smug face","date":"2019-08-16T23:20:06.635+0000","up_votes":1,"down_votes":0,"body":"Que tipo de post te borran? Debe haber un patrón..","replies":[{"poster":"Hell Darking","date":"2019-08-17T01:16:05.239+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/ZCAlzI7.jpg?nodirect\nno se, tu dime","replies":[]}]}]},{"poster":"Kylo","date":"2019-08-16T22:02:18.954+0000","up_votes":2,"down_votes":0,"body":"Entendí la ultima referencia al niño con 3 cuentas fake haciéndose pasar por mujer hablando de política pero que solo se come negativos... y pues se permite porque no hay rioters. Simplemente no hacen su trabajo, no sirven{{champion:32}}","replies":[{"poster":"IvVicious","date":"2019-08-16T22:04:28.479+0000","up_votes":1,"down_votes":0,"body":"No es el único caso igual, y lo peor es que no hay que estar metido 27 horas diarias en el foro para atar cabos y darte cuenta cuál multicuenta es de quién :p","replies":[]}]},{"poster":"Puynsi","date":"2019-08-16T23:56:51.452+0000","up_votes":1,"down_votes":9,"body":"Porque todos sabemos que los zurdos son un cancer para la sociedad y que nunca tenemos otro tipo de opinion que no sea \"todos los politicos son ladrones\".\nAdemas en NA no permiten politica porque todos son unos unos cucks. Y eso es en general, en todo el resto del mundo y servidores hablar de politica no es problema, ah pero ya en NA en donde los politicos tienen shills 24/7 diciendo que no hay que criticar el gobierno? No no, no esta permitido goyim.","replies":[{"poster":"Bxh7","date":"2019-08-17T02:32:08.857+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Puynsi,realm=LAS,application-id=v7qsfXsE,discussion-id=mowx9Prc,comment-id=0006,timestamp=2019-08-16T23:56:51.452+0000)\n>\n> Porque todos sabemos que los zurdos son un cancer para la sociedad y que nunca tenemos otro tipo de opinion que no sea \"todos los politicos son ladrones\".\n> Ademas en NA no permiten politica porque todos son unos unos cucks. Y eso es en general, en todo el resto del mundo y servidores hablar de politica no es problema, ah pero ya en NA en donde los politicos tienen shills 24/7 diciendo que no hay que criticar el gobierno? No no, no esta permitido goyim.\n\nComo quedar como un soberano imbécil en 5 líneas.","replies":[]},{"poster":"IvVicious","date":"2019-08-17T01:25:17.822+0000","up_votes":3,"down_votes":0,"body":"https://i.imgur.com/pYIekNM.jpg?noreply","replies":[{"poster":"Puynsi","date":"2019-08-17T01:40:36.711+0000","up_votes":1,"down_votes":6,"body":"Pregunta estupida respuesta estupida.\nNo te gusta que la gente hable de algo? Simplemente no entres a los threads y no los leas, a menos que ver opiniones distintas a las tuyas te generen tanta inseguridad que tenes que crear un post diciendo que no te gusta.","replies":[]}]}]},{"poster":"ZEROWINS","date":"2019-08-17T21:38:14.195+0000","up_votes":1,"down_votes":0,"body":"porque se arma bardo.. thats is why...","replies":[]},{"poster":"lordeman10","date":"2019-08-17T18:07:09.701+0000","up_votes":1,"down_votes":0,"body":"supongo que es porque acá es mucho más fácil de controlar que un foro más grande como el de NA entonces si a los jugadores les gusta hablar de eso y al equipo de moderación no le afecta no hay un motivo para prohibirlo\n\nde todos modos si esto llegara a descontrolarse seguro agregarían esa regla mientras tanto podemos disfrutar de este medio para discutir temas delicados","replies":[]},{"poster":"LolisOfLove","date":"2019-08-17T02:34:49.393+0000","up_votes":1,"down_votes":0,"body":"Quizá porque no hay Moderadores en el foro revisando qué escribimos. Esto con Cristina no pasaba.","replies":[{"poster":"TvTLucio22","date":"2019-08-17T05:32:51.199+0000","up_votes":1,"down_votes":0,"body":"Jajajajaja literalmente había varios moderadores cuando estaba Cristina jajajaja","replies":[{"poster":"Mioen","date":"2019-08-17T17:01:40.980+0000","up_votes":1,"down_votes":0,"body":"Todo tiene sentido.\nhttps://i.kym-cdn.com/photos/images/newsfeed/000/905/741/0ee.jpg","replies":[]}]}]},{"poster":"Mioen","date":"2019-08-17T16:59:44.607+0000","up_votes":1,"down_votes":0,"body":"MODS? Qué es eso?\n\nRiot LAS dejo de tener moderación desde hace 2 años. XD","replies":[]},{"poster":"Jaime Lannisterr","date":"2019-08-17T16:54:02.896+0000","up_votes":1,"down_votes":0,"body":"Pero si borran todos los post de Política .-.","replies":[]},{"poster":"TheKiller Justin","date":"2019-08-17T00:20:00.501+0000","up_votes":1,"down_votes":0,"body":">qué cuerno tiene que ver el foro de un videojuego con cuestiones políticas, ¿no?\n\nPrincipalmente, el foro al ser un ámbito de intercambio de opiniones lo hace ser le lugar ideal para el que busca dar a conocer su postura, y acaba volviéndose una cadena en que otras personas son tentadas a opinar, debatir, discutir...\nPor mi está bien siempre que se den de una manera respetuosa, pero casi nunca pasa, se vuelve una discusión entre fanáticos sobre quien tiene más razón.\nAhora, hablando del juego en sí, pueden surgir post que traten el tema del dolar en Argentina y su relación con los RPs, es un tema que acaba atrayendo también opiniones políticas.","replies":[]},{"poster":"Sebek","date":"2019-08-16T23:14:37.337+0000","up_votes":1,"down_votes":0,"body":"Deja que la gente se encargue de filtrar las publicaciones basura. El ultimo post que vi relacionado a política tenia como -8 y puros comentarios hablando de como estaba mal-informando. \n\nOff topic es Off topic.","replies":[]},{"poster":"Smug face","date":"2019-08-16T23:13:42.300+0000","up_votes":1,"down_votes":0,"body":"La cosa es el off topic y la moderación, al menos eso creo. \n\nCon un foro tan abierto a las experiencias personales y hablar de casi cualquier cosa las reglas universales se contradicen solas. \n\nLo otro es la moderación, antes era más el mod por sobre/antes los reportes, algo que agradezco que parara un poco. Ahora me parecen muy de manual, esperan a que salten los reportes para actuar.","replies":[]}]}