{"poster":"Drink My Kuva","date":"2020-02-03T20:06:41.659+0000","title":"Toxicidad en estado puro","subforum":"Comportamiento del jugador","up_votes":10,"down_votes":3,"body":"Que hacer cuando el jg no te gankea?\n_Vamos a fedear, flamear y trollear al todo el team_\n\nPero, ¿Como llegamos a esto?\n\nLa historia comienza así:\nBusco partida, voy top con Yasuo, Juego contra Urgot.\nEn la jg tengo un Rengar contra Jarvan.\nEn mid Ahri vs Anivia.\nY en la bot una ashe/Nami contra Miss/Vel\n\nLos primeros minutos arrancan bien, sacando yo la primera sangre, ante esto el Jarvan comienza a hacer énfasis en la top. Yo le aviso esto a Mi jg, el decide empezar un drake. por su parte j4 saca heraldo con urgot para tirarlo en top. El rengar sube a ayudarme y sacamos doble kill. ¿Todo bien no?\nBueno, no tan bien, La botlane empezó a perder por mucho, ante esto, la ashe empieza a hacer señas al Rengar para que los gankee, pero rengar no hace mucho caso. Cuando la cosa se pone muy fea en bot, rengar decide ayudar a la botlane. Pero lamentablemente el J4 hace un countergank y mueren los 3.\n\nAnte esto... Ashe dice:\n\n_Por tu culpa perdimos Jungla de mier_\n_gg_\n_Adiós_\n\n**_Un invocador a abandonado la partida_**\n\nMe quede impactado ante esto, pero no me rendí ya que conseguí muchas kills. \nLa partida se extiende y parece que remontamos pero...\n\n**_Un invocador se a reconectado_\n**\nAl principio pensé que seria algo bueno, que ingenuo de mi parte. Ashe vendió todos sus objetos y se empezó a buildear ap y suicidarse contra los enemigos, mientras sacaba maestría y gestos.\nAún así, Logre aguantar por un buen tiempo el game junto con Nami, En un momento casi ganamos, pero la ashe decidió pegarle al barón y este nos empezó a atacar cuando estábamos a poco de vida.\n\nEl rengar ya tilteado empieza a flamear a la Ashe, y pide que todos la reporten, los enemigos aceptan esto, y el juego termina con mi equipo perdiendo.\n\nIncreíble ¿no?\n\nQuerida ashe... Ojalá  algún transistor de tu placa madre se sobrecargue.","replies":[{"poster":"JFalmer","date":"2020-02-04T00:18:39.851+0000","up_votes":3,"down_votes":0,"body":"me encantan las historias con finales felices {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"1kiii","date":"2020-02-04T16:27:26.743+0000","up_votes":3,"down_votes":0,"body":"me encanto la parte donde la ashe se reconecta {{sticker:slayer-pantheon-popcorn}}","replies":[]}]},{"poster":"Te voy a Trolear","date":"2020-02-04T01:23:56.332+0000","up_votes":3,"down_votes":0,"body":"Mal titulo, deberia decir troll en estado puro, toxicidad eso? Toxicidad es cuando un nene que quiere atencion se mete con tu familia y te pinguea y flamea por cada error tuyo o por que sí. Aunque el vaya mas mal que todos. Eso es toxicidad... y abunda mayormente en silver.","replies":[{"poster":"Evanz","date":"2020-02-07T12:06:35.540+0000","up_votes":1,"down_votes":0,"body":"eso tambien es toxicidad, estas creando un ambiente hostil entre los de tu equipo...","replies":[]}]},{"poster":"Innocent Moon","date":"2020-02-03T21:26:48.313+0000","up_votes":2,"down_votes":0,"body":"Pff recien recien vengo de una partida en la que tenia una irelia 0-8-0 la cual se tiraba siempre sabiendo que iba a morir, no contestaba ningun mensaje ni alerta, no avisaba de cuando dejaban su linea y cuando tiraban la base farmeaba por bot.\n\nDe todas maneras pareciera ser al pedo el reporte, rarisima vez te llega la notificacion sobre un bann, ya que en esta ocasion hasta 2-3 enemigos dijeron que la iban a reportar y si lo hicieron quedo en nada igual. Lo peor es que casos asi es algo normal ya\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"BlackXCroma","date":"2020-02-08T07:08:07.933+0000","up_votes":1,"down_votes":0,"body":"Vos tranqui que si banean, lo digo porque me banearon, obviamente no estoy orgulloso de ello y aprendi a comportarme mas y solo mutear, dar comentarios positivos incluso en momentos negativos puede salvar una partida en los mejores casos {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"6Coree9","date":"2020-02-03T20:39:27.717+0000","up_votes":2,"down_votes":0,"body":"Q sad, y así hay muchos. Es una plaga","replies":[]},{"poster":"necromiedo","date":"2020-02-29T19:50:34.388+0000","up_votes":1,"down_votes":0,"body":"Steelniac bloquealo a este asi tenes uno menos","replies":[]},{"poster":"Violet Meeps Boy","date":"2020-02-06T01:21:28.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Drink My Kuva,realm=LAS,application-id=PJAKt7ph,discussion-id=WAc3Xkou,comment-id=,timestamp=2020-02-03T20:06:41.659+0000) Querida ashe... Ojalá  algún transistor de tu placa madre se sobrecargue.\n\nJAJAJAAJAJAJAJAJA","replies":[]},{"poster":"Pandora Journey","date":"2020-02-04T01:16:16.446+0000","up_votes":1,"down_votes":0,"body":"F","replies":[]}]}