{"poster":"Treant del DOTA","date":"2018-12-06T19:18:53.243+0000","title":"Frenesí del Nexo es la porquería más grande jamás creada.","subforum":"Jugabilidad, balance y narrativa","up_votes":8,"down_votes":22,"body":"Lleno de bugs, mapa sin sentido alguno. Y aunque estuviera hecho adrede, no produce diversi&oacute;n alguna. Dejen One for All y URF y todos contentos.","replies":[{"poster":"Zindro","date":"2018-12-07T00:22:40.064+0000","up_votes":2,"down_votes":0,"body":"No tiene nada de malo poner este modo en *beta* ya que es mejor que lo pruebe toda la comunidad y que compartan sus experiencias que solo un pequeño grupo que solo va a jugar algo que nadie puede jugar.\n\nEs bueno esto, como ya dijo un usuario ahí abajo, todo bien con que Dota u otros juegos MOBA saquen mapas completos sin fallos ni nada pero ahí no entra la opinión de la comunidad. \n\n\n¿Por qué crees que sacar las bolas de nieve en este modo? Porque la comunidad lo pedía a gritos ya que a nadie le gustaba.\n \nSi este modo lo hubiera inventado DOTA, te aseguro que saldría Full con modos que ni se les preguntó a la comunidad si les gustaría o no y no podrían sacarlo ya que esta full. \n\nPara mi Riot hace un buen trabajo con este modo rotatorio y espero que algún día sea permanente","replies":[]},{"poster":"Koffy","date":"2018-12-06T19:30:19.574+0000","up_votes":5,"down_votes":3,"body":"No se que esperas de un modo experimental esta en beta.","replies":[{"poster":"Dephos","date":"2018-12-06T22:19:12.965+0000","up_votes":3,"down_votes":4,"body":"aaaah y porque es una \"beta\" se le permite eso? es el primer moba que lanza un modo en un estado deplorable mientras que otros mobas lanzan el contenido listo para jugar, nada de betas, alphas etc.\n\nRiot es una empresa grande, muy grande y que no sean capaces de lanzar un modo completado me parece muy triste, con la cantidad de gente que tienen trabajando este modo de juego deberia ya estar terminado, cuantos meses han pasado desde que pusieron el modo de juego en estado ALPHA? 4 meses? y aun no esta listo? acaso Riot no tiene ningún equipo encargado de acabar contenido y contenido tan importante como lo es un modo de juego? Riot lo único que hace es preocuparse por la LCS y por la venta de Skins, no me den el argumento de que es f2p y por eso tienen derecho a hacer eso, no, eso no es un argumento valido y tengo 8 años de experiencia con este juego para decir esto. \n\nes desastroso el \"nuevo\" modo de juego, no han mejorado nada desde la alpha en agosto, el matchmaking es horrible, los eventos totalmente desbalanceado , como el veigar que se va hasta la base enemiga siendo imposible para el equipo rival ganar ese evento, la muerte súbita, \"destruye el nexo enemigo para ganar\" me parece una broma de mal gusto, te pasas toda una partida jugando mejor que el otro team, tomando objetivos, ganando todas las team fights hasta que sale ese evento y por esas razones de la vida pierdes la partida... si creen que eso es tolerable déjenme decirles que deberían revisarse el cerebro. Puedo seguir nombrando los errores de este modo de juego, como el ping, la optimizacion, eventos mal diseñados. etc. Me da flojera y tristeza, tristeza de que Riot haga cosas a medias esperando el feedback de la gente que al final ni toman en cuenta, 4 meses en el que el modo de juego no ha avanzado en nada.\n\npara mi es una porquería y para muchas otras personas también, así que no vengan a decir que son pocos lo que creen esto. \n\nComo siempre league of legends destacando por las skins y no por el juego en cuestión.","replies":[{"poster":"Koffy","date":"2018-12-06T22:57:07.759+0000","up_votes":3,"down_votes":2,"body":"Te repito; riot esta haciendo para hacer el frenesi al nexo permanente y lo estan probando, si no estuviste en la primera beta no puedes hablar de ella, el mapa a cambiado esta mas moldeado y mas organizado, los eventos estan para remontar no se si leiste una guia de frenesi al nexo que la idea de estos es que favorecieran al equipo rival, por algo el veigar se va a la base enemiga para favorecer al equipo enemigo, hay otros mobas que si, lanzan el contenido altiro, pero preguntate ¿escuchan a sus comunidades? Pues no, ya que solo lo lanzan.","replies":[]}]}]},{"poster":"Zindro","date":"2018-12-06T21:17:41.416+0000","up_votes":2,"down_votes":1,"body":"Es una opinión, solo pon un \"para mi\" y listo que asi pones en marcha una discusión sin fin.\nA mi me gusta, es algo corto, lleno de adrenalina y con minijuegos de por medio. Es tu opinión contra la mayoría. Solo sigue haciendo tu humor de doble filo porque opinando sos bastante malo.","replies":[{"poster":"Treant del DOTA","date":"2018-12-06T23:53:11.251+0000","up_votes":1,"down_votes":2,"body":"Mi opinión forma parte de la mayoría como siempre no soy ajeno al pueblo.\n\nY para doble filo te tengo a vos que sos más fácil de rebatir que un mudo.","replies":[]}]},{"poster":"Taxarys","date":"2018-12-06T20:18:29.859+0000","up_votes":2,"down_votes":1,"body":"lo del mapa concuerdo contigo, hay dos torres arriba que no se para que sirven jaja\nAparte los eventos son siempre los mismos, URF, empujar el carrito y bardo royale. Tampoco lo veo muy divertido pero lo seguire jugando para completar las misiones xD","replies":[]},{"poster":"amoamo","date":"2018-12-07T23:12:33.799+0000","up_votes":1,"down_votes":0,"body":"Es un modo de juego experimental, hay gente que le divierte mucho, hay gente que lo juega para pasar el rato con una partida rápida. Si no te gusta no lo juegues. Ademas es TU OPINIÓN, no lo tomes como una verdad absoluta xD estas peor que las noticias en los diarios amarillistas","replies":[{"poster":"Treant del DOTA","date":"2018-12-09T23:29:21.503+0000","up_votes":1,"down_votes":3,"body":"La tuya también es una opinión por ende no es la verdad absoluta y por ende mi verdad gana y es absoluta.","replies":[]}]},{"poster":"Hakon Skarsholm","date":"2018-12-06T19:28:36.823+0000","up_votes":4,"down_votes":13,"body":"estoy de acuerdo nose porque te ponen negativo{{sticker:draven-pose}}","replies":[{"poster":"Treant del DOTA","date":"2018-12-06T23:53:38.577+0000","up_votes":1,"down_votes":3,"body":"Haters.","replies":[]}]}]}