{"poster":"Suki no Sukiru","date":"2018-06-05T05:58:36.015+0000","title":"Idea for a new Rune to counter heals and shields.","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"Preferably on the Resolve tree.\nCould be in Inspiration.\n \nIf Keystone.. be something like\n&quot;Mark of the Leviathon&quot;\n  - For the first 2 seconds in combat, damage to shielded targets is increased by 15 - 40%.\n  - Every 4 seconds in combat the next basic attack or single target ability reduces enemy ALLIED healing received by 30 - 70% for 2 - 3 seconds.\n\nGive a cooldown that starts after like 12 seconds out of combat.\n\nIf a normal rune just make it something like\n - After &quot;3&quot; seconds in combat, the next single target ability or basic attack &quot;Wears Down&quot; the opponent.\nReduces the strength of Heals and shields cast by BY ALLIES by 75% for __ amount of seconds.\n\n\nThis is so that a keystone can be taken to counter enemy champions who shields for stupid amounts of damage, or heals for a crap ton.\nIt does not ruin champions who have high self healing damage as this healing block is only effective against healing RECEIVED FROM ALLIES.\n(Mundo... Rhaast...)\nAlso gives versatility to be played around as most of these only \n\nPlease tell me how you guys feel about healing champs like soraka and janna...","replies":[{"poster":"Begging to Lose","date":"2018-07-26T10:32:27.435+0000","up_votes":1,"down_votes":0,"body":"Wouldn't this be best in the Domination/Precision tree? \n\nThe extra damage doesn't fit the theme of Resolve. Inspiration wouldn't work for this either, as it doesn't fit the themes. Runes in league are meant to have to do with the theme of the tree. Resolve is for tanks, and giving them extra damage is not useful, as they aren't meant to do damage. Inspiration would be an even WORSE idea, as inspiration is for quirky things. Klepto is for gold gen, not too good on most. Spellbook is for utility, having an extra summ. Glacial is utility slows. A damage thing doesn't fit it.\n\nOther than that, this rune seems interesting.","replies":[]}]}