{"poster":"Suki no Sukiru","date":"2017-08-29T23:42:00.956+0000","title":"Slaverdine - The Ancient Vampire","subforum":"Player Creations","up_votes":2,"down_votes":1,"body":"Slaverdine\nThe Ancient Vampire.\n\nSlaverdine would be a top laner or jungler, he has great sustain in lane or in the jungle, especially against melee opponents.\nHe can heal of his Q many times, as well as use W to catch up to opponents that flee or use E to make fighting ranged opponents a little easier\n\n\nHP 574 + 69 \nAncient Power: Max 8. + 1 per spell cast. \nAD 52 + 3.24\nAtk Speed 0.673 +0.012\nArmor 26 +2.7\nMR 31 +1.5\nSpeed 345.\n\n\n\nPassive: Life Mastery\nEvery 1% Lifesteal grants 1.5% Attack Speed.\nLife Steal and Spell Vamp does not apply to Slaverdine when he takes damage.\n\nCasting abilities grant a stack of Ancient power.\nEvery 6th basic attack also grants a stack.\n\n\n\nQ- Leeching Strike Cost 0/8 Ancient Power.  10/9/8/7/6 seconds.\nSlaverdine enchants his next attack, Gaining 75 range, the attack gains 20/30/40/50/60% Lifesteal and drains another 1% of their max HP per second for 2/3/4/5/6 seconds.\nHealth is given to Slaverdine.\nThis also slows them by 10/15/20/25/30%.\n\nAuto attacks and other abilities reduce cooldown by 1 second.\n\nIf drains Ancient power, the ability range is incresed to 200 instead.\nHeal a BONUS base health of 20-100/40-240/60-420/80-640/100-900 HP based on Missing HP Capping when 20% MAX HP remains.\nmovement speed stollen is also given to Slaverdine.\nAlso deals Lvl x 20 Bonus physical Damage.\n\n\nW- Soul Latch 8% MAX HP + 0/8 Ancient Power. 23/21/19/17/15 seconds.0\nChannels out a ball of his own life energy and fires it up to 600 range.\nThe first enemy  hit becomes effected.\nThey take 4% Current Health damage per second +5/11/17/23/29 Magic damage.\nLasts 5 seconds vision is also granted of that unit.\n\nIf Drains Ancient Power, range is increased to 1200. Damage is increased to 6/7/8/9/10% Current HP + 10/22/34/46/58 Magic damage per second.\nEnemy hit is also slowed by 5/10/15/20/25 + 10%.\nMoving towards the marked unit gains 10/20/30/40/50 + 10% Movement speed.\n\n\nE- Bat Attack 0/8 Ancient Power. 15/13.5/12/10.5/9 seconds.\nSlaverdine orders his bat to fly towards a chosen enemy. Attacking the enemy causes the bat to also hit the enemy, dealing\n6/8/10/12/14%AD as magic damage. After up to 5 seconds or reactivation, the bat flys back to Slaverdine, healing Slaverdine for the damage\nthe bat has dealt.\n\nIf Ancient Power is drained, Slaverdine may dash to the enemy on attack command if they are within 350 units.\nBat&#039;s attack on hit damage is increased from 6/8/10/12/14% AD to 8/14/20/26/32%AD on hit.\n\n\n\n\nR- True Form   generates 2 Ancient power per second in this form. 115/95/75sec\nSlaverdine channels out his true form, bats swarm around him as he gains 20% size.\nEnemies within 450 units of him take 20/60/100 + 20/30/40%AD  Physical damage per second.\nThe damage dealt also heals Slaverdine for 25% of the amount. Healing from damage to champions is increased to 100%.\nHe is in the shape of a winged demon.\nThe cooldown of Leeching strike is reduced by 1 additional second per second while True Form is active.\nLasts 7 seconds.\nKilling any enemy reduces cooldown by 3 second\nKilling a champion grants ultimate for 3 seconds and if already active, extends duration by 4 seconds.","replies":[]}