{"poster":"KAYN BRINGS PAIN","date":"2018-06-14T04:51:40.627+0000","title":"WE ALL SHOULD JOIN TOGETHER AND FORCE THEM TO CHANGE THE PLAYER BANNING SYSTEM.","subforum":"Player Behaviour","up_votes":5,"down_votes":6,"body":"Don&#039;t you think us the people had enough or being permabanned by a group of individuals that abuse the system. By abusing the system i mean a whole team abusing players with profanities and once a player has had enough of being abused retaliates and gets punished for it while the others walk free hmmmmmm \r\n\r\nWELL GUYS LETS MAKE A VOTE","replies":[{"poster":"Roguestoney","date":"2018-06-14T05:06:18.825+0000","up_votes":6,"down_votes":1,"body":"Unlucky :^)","replies":[]},{"poster":"DarkShade918","date":"2018-06-15T01:49:12.891+0000","up_votes":4,"down_votes":1,"body":"I mean, it needs to change\n\nI just got told in 8 lines of text to get cancer and die, by a shen (who was trolling), muted him reported him post game, still waiting for an IFS popup \n\n{{sticker:slayer-jinx-unamused}} \n\nat this point i think riot's system only targets some players, not all, and prioritizes people standing up for themselves, good thing i have a mute button and unbound enter, makes life hell of a lot easier lol","replies":[{"poster":"Aneirin","date":"2018-06-15T01:55:09.759+0000","up_votes":2,"down_votes":0,"body":"IFS popup is rare, not something you get every time a report is processed.","replies":[{"poster":"DarkSoul1994","date":"2018-06-15T02:04:26.408+0000","up_votes":2,"down_votes":0,"body":"Therein lies the problem. Even when players **_do_** get punished, the community's perception is that these players are getting away with toxic behavior.","replies":[{"poster":"Aneirin","date":"2018-06-15T03:44:06.534+0000","up_votes":1,"down_votes":0,"body":"You're correct, this is an issue. \n\nI've heard that Riot Tantram is working on some update to the honour/feedback system or something so here's hoping that it's an issue that'll be dealt with.","replies":[{"poster":"DarkSoul1994","date":"2018-06-15T03:59:05.474+0000","up_votes":3,"down_votes":0,"body":"Adding visibility to punishments shouldn't be that hard. Right now if 3 people report a toxic player each game they're toxic, and it takes 10 games of toxicity for them to get a punishment, each player has a 1 in 30 chance of being notified that the player has been punished (this is my understanding of the current system). This is unacceptable.\n\nWhen you report a player, the client should keep track of it in a list. Highlight reports resulting in punishments in red (maybe red for bans and orange for chat restrictions/suspensions), reports not resulting in punishments in green, and reports yet to be reviewed in yellow. Players profiles should also have an overlay indicating that they're suspended or banned.","replies":[{"poster":"Aneirin","date":"2018-06-15T04:09:07.257+0000","up_votes":1,"down_votes":0,"body":"Personally I'd love a system like that. So far the reasoning against it is that people might use it to try and work out what negative behaviours goes unpunished to game the system - not sure if I agree or not but that's the official word so far.","replies":[{"poster":"DarkSoul1994","date":"2018-06-15T08:13:26.569+0000","up_votes":1,"down_votes":0,"body":"The only real issue would be if players were able to use the information to make a CBL.","replies":[]}]}]}]}]}]},{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T02:58:37.208+0000","up_votes":1,"down_votes":1,"body":"I agree with you bruv","replies":[]}]},{"poster":"Aneirin","date":"2018-06-15T01:55:33.258+0000","up_votes":3,"down_votes":0,"body":"We should all join together and buy you a caps lock button.\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Flúffy","date":"2018-06-14T05:14:19.573+0000","up_votes":6,"down_votes":3,"body":"I feel like this is a child lashing out because he couldn’t mute people or walk away like an adult","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-14T05:20:53.862+0000","up_votes":4,"down_votes":3,"body":"No it's called standing up to the salty bastards like your self","replies":[{"poster":"Flúffy","date":"2018-06-14T07:50:23.189+0000","up_votes":3,"down_votes":3,"body":"standing up for yourself how the only time your called out is in a game if you have a problem mute them disable the chat key remove chat. If you do not do anything and then cry your just looking for peoples attention. Remember this is only a game and you dont need to play it all the time, this is not life but a hobby learn to unstress, untilt on something else its not hard.","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T03:17:28.543+0000","up_votes":1,"down_votes":1,"body":"This game is about interacting and communicating with each other lmao. What's a team game for.. to mute players ???? You still gonna get abused the only thing is they doing it without your knowledge cause you muted them. But if you didn't mute the opposite team they are laughing at the jokes from the players you muted. So you not getting justice.. you getting bullied and harassed still but they will never fix the system. Why you ask because it makes money. The more players banned the more likely they will come back and buy a skin for the champ they liked previously.","replies":[]}]}]}]},{"poster":"DarkSoul1994","date":"2018-06-15T02:09:24.331+0000","up_votes":2,"down_votes":3,"body":"1. That's not how reporting works. 1 report will flag the game no differently to 4 reports.\n2. If you were being toxic enough in response to toxic behavior, the ban was probably warranted anyway. A grown up would just mute the toxic player(s) and move on.\n3. The issue isn't that players aren't getting banned, it's that it's incredibly rare that any of us actually get informed that a player we reported has been punished. This, I agree, is a problem that needs to be rectified.","replies":[{"poster":"TheDemonEmperor","date":"2018-06-15T04:00:38.877+0000","up_votes":3,"down_votes":1,"body":"Dont bring the grown up would mute and move on arguement. It largely depend on the person's personality. Not everyone can take a spit to the face and walked away amicably","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T02:58:11.356+0000","up_votes":1,"down_votes":1,"body":"You are spot on bruv","replies":[]}]}]},{"poster":"HeathereYyIy","date":"2018-06-15T02:10:24.069+0000","up_votes":3,"down_votes":4,"body":"Bro, these are Riot nut huggers - you're arguing for change in a forum filled with bias and vested interest towards Riot. No point arguing on here, they're just going to disagree with everything you have to say when 'change' and 'League of Legends' are assimilated.","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T03:08:49.817+0000","up_votes":2,"down_votes":1,"body":"Yeah i know but it's enjoyable watching them make smart ass comments just shows how childish they can be at riot","replies":[]}]},{"poster":"PLAYER47","date":"2018-06-19T03:54:19.313+0000","up_votes":1,"down_votes":0,"body":"The following are examples of behaviour riot warrant disciplinary measures:\n\ni. Impersonating any person, business or entity, including an employee of Riot Games, or communicating in any way that makes it appear that the communication originates from Riot Games;\n\nii. Posting identifying information about yourself or other players to the Website or within the Game;\n\nMy notes:\nHarassing (to disturb persistently; torment, as with troubles or cares; bother continually; pester; persecute.)\nstalking (harassing another in an aggressive, often threatening and illegal manner)\nthreatening (intended to menace(to express or serve as a threat))\noffensive (causing resentful displeasure; highly irritating, angering, or annoying)\nabusive (using, containing, or characterized by harshly or coarsely insulting language)\ndefamatory (false or unjustified injury of the good reputation of another, as by slander or libel; calumny)\nobscene (offensive to morality or decency; indecent; depraved)\nsexually explicit (described or shown in realistic detail)\n\nYou will then be able to report the player for various negative behaviors:\n\nHarassment: Verbal Abuse - This category aims at punishing language that is directly targeted at another player in order to hurt, insult, or intimidate them.\nGriefing: Intentional Feeding – This category aims at punishing behavior that involves deliberately dying to enemy champions or turrets to make the opposing team more powerful while putting your team at a disadvantage. This is not intended for genuine mistakes or lapses of judgment!\nLeaving the Game/AFK - This category aims at punishing behavior that includes logging out before a match ends as well as standing idle for long periods of time and refusing to participate.\nNegative Attitude - This category is reserved for unhelpful or self-centered attitudes that go against the principles of a team-based game.\nInappropriate Name - Select this option if you see a Summoner name that is falsely indicative of an association with Riot Games, contains personally identifying information, infringes on the proprietary rights of third parties, or that is offensive, defamatory, vulgar, obscene, sexually explicit, or racially, ethnically, or otherwise objectionable. This also applies if the name uses a misspelling or an alternative spelling to circumvent this restriction on Summoner name choices.\n\n\niii. Harassing, stalking or threatening other players while using the Riot Services;\n\niv. Removing, altering or concealing any copyright, trademark, patent or other proprietary rights notice of Riot Games contained in the Website, the Game and/or the Software. You also may not transmit content that violates or infringes the rights of others, including patent, trademark, trade secret, copyright, publicity, personal rights or other rights;\n\nv. Transmitting or communicating any content which is deemed offensive, including language that is unlawful, harmful, threatening, abusive, harassing, defamatory, vulgar, obscene, sexually explicit, or racially, ethically, or otherwise objectionable;\n\nvi. Transmitting or facilitating the transmission of any content that contains a virus, corrupted data, trojan horse, bot keystroke logger, worm, time bomb, cancelbot or other computer programming routines that are intended to and/or actually damage, detrimentally interfere with, surreptitiously intercept or mine, scrape or expropriate any system, data or personal information;\n\nvii. Spamming chat, whether for personal or commercial purposes, by disrupting the flow of conversation with repeated postings;\n\nviii. Participating in any action which defrauds any other user of the Game, including by scamming or social engineering;\n\nix. Using any unauthorized third party programs, including mods, hacks, cheats, scripts, bots, trainers and automation programs that interact with the Software in any way, for any purpose, including any unauthorized third party programs that intercept, emulate, or redirect any communication between the Software and Riot Games and any unauthorized third party programs that collect information about the Game by reading areas of memory used by the Software to store information;\n\nxi. Selecting a Summoner name that is falsely indicative of an association with Riot Games, contains personally identifying information, or that is offensive, defamatory, vulgar, obscene, sexually explicit, racially, ethnically, or otherwise objectionable. You may not use a misspelling or an alternative spelling to circumvent this restriction on Summoner name choices. Riot Games may modify any name which violates this provision, without notification to you, and may take further disciplinary measures, including account termination for repeated violations;\n\nxii. Logging out or exiting the Game during live game-play. Riot Games’ automated Leaverbuster® system tracks this data over time and issues a temporary ban when a user is determine to have left mid-game too many times. The length of the temporary ban will increase over time if a particular account continues to leave live game play;\n\nxiii. Playing on another person’s account to “boost” that account’s status or rank; or\n\nxiv. Inducing or encouraging others to violate this Code of Conduct or the terms of this Agreement.","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T03:57:29.662+0000","up_votes":1,"down_votes":1,"body":"Are you one of riots staff and why would you paste this on my post","replies":[{"poster":"PLAYER47","date":"2018-06-19T04:15:48.381+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KAYN BRINGS PAIN,realm=OCE,application-id=T8eq2lFQ,discussion-id=hIJ49ZNE,comment-id=00060000,timestamp=2018-06-19T03:57:29.662+0000)\n>\n> Are you one of riots staff and why would you paste this on my post\n\nNope.\n\n> Don't you think us the people had enough or being permabanned by a group of individuals that abuse the system. By abusing the system i mean a whole team abusing players with profanities and once a player has had enough of being abused retaliates and gets punished for it while the others walk free hmmmmmm\n\nI am just letting you know what riot looks for and if you violate their aforementioned term of use, you may have warranted yourself for disciplinary measures.","replies":[]},{"poster":"Ninox","date":"2018-06-19T04:00:41.734+0000","up_votes":1,"down_votes":0,"body":"Riot staff are red-named.","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-06-19T04:01:50.300+0000","up_votes":1,"down_votes":0,"body":"oh okay thx","replies":[]}]}]}]}]}