{"poster":"Shy Shylenn","date":"2019-12-10T20:36:37.217+0000","title":"Wie mache ich einen Account in NA?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Nabend!\n\nMöcht gern mal nen NA Acc haben, aber weiß nicht wie. \nWenn ich auf die Seite gehe, wo ich mich neu anmelde, steht da nichts von einer Region - oder zumindest nicht von NA. (ich vermute jedenfalls dass die Region da rechts oben für die Sprache ist, oder?) \nWie kann ich einen NA Acc erstellen, ohne NA auszuwählen? - Misslich ausgedrückt - ich meine, wie mache ich einen NA Account, mit dem ich auf Deutsch spielen kann? Kann ich die Sprache separat umstellen, oder wird der Client automatisch in englisch sein, wenn  ich einen NA Acc habe? \nKann mir da jemand weiterhelfen?","replies":[{"poster":"Kirschkern","date":"2019-12-11T12:38:19.836+0000","up_votes":1,"down_votes":0,"body":"Wieso erwähnt denn niemand das man auch den NA Client runterladen kann?\n\nWenn man nur einen Client benutzt und den immer umstellt, ist das irgendwie sehr umständlich.\n\nErstell dir einen Account in NA wie Xeni gesagt hat und dann lädst du dir da auch die NA Version des Clients runter .-. Und das mit dem Ping stimmt. Er dürfte dann so um die 120ms liegen.","replies":[{"poster":"Shy Shylenn","date":"2019-12-11T16:15:06.802+0000","up_votes":1,"down_votes":0,"body":"Da hast du Recht! 117 ist mein Ping. \nIst aushaltbar, denk ich. Momentan bin ich ja sowieso noch in der Noob-Liga, wo keiner eine feste Lane hat und leider auch wo Level-Bots wie Sand am Meer existieren.... \n\nBin gespannt, ob der Ping dann eine Rolle spielt, wenn man ernsthafter gegeneinander spielt.","replies":[]}]},{"poster":"Shy Shylenn","date":"2019-12-10T23:11:18.550+0000","up_votes":1,"down_votes":0,"body":"Dankeschön :) Habs geschafft!","replies":[]},{"poster":"Enderized","date":"2019-12-10T21:24:38.478+0000","up_votes":1,"down_votes":0,"body":"Du kannst auf NA nur über umwege mit dem Deutschen Client spielen.\nOb dieser Weg jedoch legal ist weiß ich nicht und würde dir deshalb davon abraten.\n\nWelche Sprachen auf welchem Server Verfügbar sind kannst du dir im Launcher anzeigen lassen, wenn du versuchst die Sprachen zu wechseln x)","replies":[]},{"poster":"XenesisCH","date":"2019-12-10T21:00:23.271+0000","up_votes":1,"down_votes":0,"body":"Region oben rechts auswählen und Account für die entsprechende Region, hier North America erstellen. \n\nhttps://signup.euw.leagueoflegends.com/de/signup/index#/\n\nWenn du danach  den Client selber startest, kannst du oben Links die Region auswählen, wo du dich dann gerne einloggen möchtest. Allerdings hast du dann da einen spürbar höheren Ping auf dem NA Server, wenn du von Europa aus spielst.","replies":[]},{"poster":"sN00Bdogg","date":"2019-12-10T22:55:44.504+0000","up_votes":1,"down_votes":1,"body":"Also ... zuerstmal musst du mit dem Schiff übersetzen. Dann musst Du dich durchfragen ;)","replies":[]}]}