{"poster":"CiIlit Bang","date":"2017-10-27T10:36:37.864+0000","title":"Biete kostenloses Coaching für Solo Queue und/oder Teams an","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Ihr Lieben\r\n\r\nIch sehe immer wieder Leute, die auf der Suche nach einem Coach oder sonstiger Hilfe sind. Das hat mich dazu motiviert, selber mal einen Versuch als Coach zu starten. Da ich auch mit dem Gedanken lieb&auml;ugle, mal Lehrer oder etwas &auml;hnliches zu werden, ist das auch eine gute &Uuml;bung f&uuml;r mich. Ausserdem macht es mir Spass, anderen etwas unter die Arme zu greifen, solange sie dies auch zulassen.\r\n\r\nKurzer Hintergrund zu mir:\r\nIch spiele seit vielen Jahren (6 oder 7 ungef&auml;hr) League of Legends und habe sehr viel Theorycrafting betrieben und mich intensiv mit dem Spiel auseinandergesetzt. Ich verfolge auch regelm&auml;ssig High Elo und die Entwicklung der Meta. Haupts&auml;chlich habe ich mich auch mit Themen wie Psychologie und Mindset im Spiel besch&auml;ftigt, was meiner Meinung nach einer der wichtigsten wenn nicht sogar der wichtigste Aspekt im Ranked ist. Dementsprechend kann ich viele gute Tipps aus Erfahrung, Statistiken etc. geben, die so manch einem weiterhelfen k&ouml;nnen, egal welcher Elo. Aber nat&uuml;rlich kann ich auch gameplaytechnisch einige Inputs geben, auch wenn ich selbst in der Solo Queue im Moment in Platin 3 sitze (was aber auch daran liegt, dass ich selber das Spiel Casual spiele und einfach nur Champions spiele, auf die ich Lust habe, ohne gross nach H&ouml;herem zu streben), was aber mein Wissen &uuml;ber das Spiel nicht schm&auml;lert.\r\n\r\nWas kostet der Spass?\r\nNichts! Ich werde das Coaching vorerst gratis betreiben, sozusagen um abzusch&auml;tzen, ob es &uuml;berhaupt Interessenten gibt, ich damit Erfolg habe und ob es mir auch wirklich Spass macht. Wenn euch nat&uuml;rlich ein Anfall von Dankbarkeit &uuml;berkommt, habe ich auch nichts dagegen, wenn ihr mir eine Kleinigkeit ingame schenkt oder einen kleinen Betrag &uuml;berweist, wenn ich euch helfen konnte und es euch das wert ist :) Deshalb greift zu solange ihr noch k&ouml;nnt :P\r\n\r\nDenke das sollte f&uuml;rs Erste reichen, alles weitere k&ouml;nnen wir ja sonst noch per PM besprechen. Kommentiert hier oder addet mich ingame, ich freue mich schon auf euch!\r\n\r\nLG\r\nThe V&igrave;rtuoso","replies":[]}