{"poster":"Ryoga","date":"2015-04-25T23:58:37.126+0000","title":"El server anda mal? la culpa es de ustedes!","subforum":"Charlas Generales","up_votes":15,"down_votes":4,"body":"Si el server anda mal o no funciona correctamente &iquest;por qu&eacute; hay pibitos que siguen comprando RP?, \n\nsi ustedes venden zapatos de mala calidad, pero la gente igual se los compra, entonces para qu&eacute; van a invertir en mejorar esos zapatos?. es lo mismo con el RP.\n","replies":[{"poster":"Nugness","date":"2015-04-26T00:00:35.796+0000","up_votes":7,"down_votes":1,"body":"***","replies":[{"poster":"Princess Mipha","date":"2015-04-26T00:27:34.732+0000","up_votes":4,"down_votes":0,"body":"Hijo, cambia la tercera palabra o te banean en el foro x.x (es en serio, banean por tonterías acá)","replies":[]},{"poster":"JeffCraft","date":"2015-04-26T23:27:47.811+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJAJAJAJAJAJA","replies":[]}]},{"poster":"Caraxes","date":"2015-04-26T00:58:08.628+0000","up_votes":2,"down_votes":1,"body":"Quizá, quizá sera que no todo el mundo tiene problemas?\n\nSera que es una vocal minoría que esta en esta cámara de eco que es el foro?\n\nEsta semana fue la primera vez que el server tuvo problemas en todo el año, el resto son conectividades entre isps y cosas por el estilo.","replies":[{"poster":"Ch4puLin","date":"2015-04-26T16:06:47.607+0000","up_votes":1,"down_votes":3,"body":"Cuando un 50% de la población del server se queda con problemas, no es una \"vocal minoría\". Dejá de entender al server como el aparato o clúster de aparatos físicos y empezá a entenderlo con la red que involucra y toda la población. A mi y a muchos no les sirve de nada que le digan \"el problema es el isp xx porque un ratón vino y cortó la fibra yy\". A mi me sirve que el server donde juego no ande lag, no me tire reanudando conexión en medio de la tf.\nDefinitivamente NO fue el primer problema en el año.\nPero si estás en la parte de la población que no tuvo esos problemas y se vio beneficiada, no los vas a entender, y vas a decir que anda todo bien.","replies":[{"poster":"Caraxes","date":"2015-04-26T16:27:04.073+0000","up_votes":3,"down_votes":2,"body":"> Cuando un 50% de la población del server se queda con problemas, no es una \"vocal minoría\"\n\nMe encantaría saber de donde sacas esos números. Porque 50 en el redes sociales sobre 300.000 personas que juegan regularmente, SON una vocal minoría.\n\n> Dejá de entender al server como el aparato o clúster de aparatos físicos y empezá a entenderlo con la red que involucra y toda la población.\n\nSi y no,  el server ES algo físico, que puede tener sus problemas propios y al mismo tiempo la conectividad con el mismo son de donde la mayoría de los problemas provienen.\n\n> A mi y a muchos no les sirve de nada que le digan \"el problema es el isp xx porque un ratón vino y cortó la fibra yy\"\n\nSi bien tenes razón, muchas veces (Y en especial en latinoamerica) las conectividades son pésimas, y son el origen de los problemas.\n\n>Definitivamente NO fue el primer problema en el año.\n\nFue el primer problema global, el resto afectaban a cierta parte de la poblacion (Me acuerdo de hace un mes que los jugadores de Argentina tenían desconexiones al azar)","replies":[{"poster":"Ch4puLin","date":"2015-04-26T19:35:35.552+0000","up_votes":3,"down_votes":0,"body":"Fijate entre tu último comentario. Ahí tenés de donde saco el 50%. No será cientifífico, pero no es ilógico pensar que si todo Argentina y Uruguay tienen problemas, la mitad del server tiene problemas.\nPor otro lado, dejá de darme la definición de diccionario de lo que es un server. Ya la sé. Ponela en contexto, cuando se habla de LAS no se habla de un aparato, hasta que no entiendas eso, no vas nunca a entender el punto y me vas a seguir dando respuestas y quotes basadas en un mal concepto.","replies":[{"poster":"Caraxes","date":"2015-04-26T23:34:04.706+0000","up_votes":2,"down_votes":1,"body":">  No será cientifífico, pero no es ilógico pensar que si todo Argentina y Uruguay tienen problemas, la mitad del server tiene problemas.\n\nNunca tuve un drama con el server, soy de argentina. Al carajo tu 50%.\n\n> Ponela en contexto, cuando se habla de LAS no se habla de un aparato, hasta que no entiendas eso, no vas nunca a entender el punto y me vas a seguir dando respuestas y quotes basadas en un mal concepto.\n\nY yo te digo que el problema no es el aparato, pero bueno, allá vos.","replies":[]}]}]}]}]},{"poster":"Doctor Rata","date":"2015-04-26T02:37:25.037+0000","up_votes":2,"down_votes":0,"body":".","replies":[]},{"poster":"KEVlN","date":"2015-04-26T00:35:43.388+0000","up_votes":2,"down_votes":0,"body":"Mucha gente piensa lo mismo, hasta que sacan {{champion:17}} .  {{item:1056}} Mega Scuad. y bueno... por eso hay pobreza en argentina","replies":[]},{"poster":"Pascut","date":"2015-04-27T14:39:20.275+0000","up_votes":2,"down_votes":1,"body":"Las skins son como los pokemons, hay que atraparlos a todos","replies":[]},{"poster":"Shappaw","date":"2015-04-27T13:38:57.445+0000","up_votes":1,"down_votes":0,"body":"Permiso, vengo a usar mayúsculas.\n\nPOR FIN, ALGUIEN QUE ENTIENDE LAS COSAS.\nVIEJO, ¿ES TANTO QUILOMBO ACEPTAR LA REALIDAD?\n\n**Ryoga** lo explica breve y sencillo. ¿Cómo puede ser que no lo entiendan?\n\nAdemás, se viven quejando que hay lag, que esto, que lo otro....   **¿por qué no se toman 5 minutos de su vida probando una partida personalizada? No pierden absolutamente nada.**\nY no quiero que digan \"pero es que queremos que todo funcione como debe funcionar\". NO, no molesten, no saben lo que es montar un servidor y tratar de que funcione lo mejor posible. Es todo sistema, tras sistema, tras sistema, todo es referido a la informática, no van a entender **JAMÁS** lo que pasa adentro.","replies":[]},{"poster":"ElenStrike","date":"2015-04-27T06:14:54.795+0000","up_votes":1,"down_votes":0,"body":"Yo no compro RP, daaaah... como usuario de un juego \"gratuito\", es pésimo el server... te bajas peliculas en HD, juegas otros juegos online mucho más pesados y claro, LOL es el único que esta dando problema... la única respuesta que dan estos est*pid*s es que \"es tu operador de linea\"... y claro, ¿entonces porqué pasa con LOL y no con otros juegos online? AAAH... AAAH?","replies":[]},{"poster":"Tanoshii","date":"2015-04-26T15:29:49.744+0000","up_votes":1,"down_votes":0,"body":"Porque un par de fallas no es nada cuando la cosa funciona relativamente bien 24/7 todo el año.","replies":[]},{"poster":"xNicox","date":"2015-04-26T04:05:59.131+0000","up_votes":1,"down_votes":0,"body":"Yo nunca compre RP xD salvo una vez que habian puesto el cambio de nombre en descuento y me cambie mi primer nombre que era un asco de nick xD luego hasta el dia de hoy no compre mas, las skin que tengo son las que regalo riot xD.\n\nGaren comando, Tristana Chica Riot y Fiddle Union Jack que me toco en la cajita.","replies":[]},{"poster":"Eurosia","date":"2015-04-26T00:08:17.347+0000","up_votes":1,"down_votes":0,"body":"Yo decidi dejar de comprar rp alrededor de octubre/noviembre del año pasado cuando empezaron los problemas. Coincidia con la introduccion del rediseño del mapa","replies":[{"poster":"Princess Mipha","date":"2015-04-26T00:27:08.651+0000","up_votes":1,"down_votes":0,"body":"Mis respetos.","replies":[]}]},{"poster":"Texter Redrum","date":"2015-04-26T16:35:47.045+0000","up_votes":1,"down_votes":2,"body":"Malísimo tu razonamiento :P","replies":[{"poster":"Shappaw","date":"2015-04-27T13:35:43.767+0000","up_votes":1,"down_votes":1,"body":"Que no estés de acuerdo no significa que sea un mal razonamiento.\n\nEstá en lo correcto, y es lo lógico.","replies":[]}]},{"poster":"Runth","date":"2015-04-26T08:54:50.476+0000","up_votes":1,"down_votes":2,"body":"primera vez? mmrrrr... ja... riot es... vengan acercanse que los surruro\n\n*surruro* Porque es capitalista y con menos ingresos *surruro*","replies":[]}]}