{"poster":"Ryoga","date":"2016-03-07T01:54:50.124+0000","title":"Vayne (duda de items)","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola chic@s, me gustar&iacute;a saber que items se compran con vayne y en que orden. {{champion:67}} \n\naun se empieza con ruined? ","replies":[{"poster":"Bienzahar","date":"2016-03-07T02:06:17.331+0000","up_votes":1,"down_votes":0,"body":"Si vas bien el orden seria el siguiente {{item:3153}} {{item:3009}} {{item:3087}} {{item:3031}} {{item:3072}} {{item:3033}} \nSi vas más o menos empezar con statick es buena opción.","replies":[{"poster":"arielsebastian","date":"2016-03-07T02:47:44.715+0000","up_votes":1,"down_votes":0,"body":"1ro que nada esas botas no, las de vel de ataque o en el peor de los casos las de tenacidad...\nsegundo, vayne necesita si o si un item defensivo, ya sea banshe o cimitarra o lo que se te ocurra, en este caso, yo sacaria la sanguinaria...\nAUNQUE, si vas muy bien y estas \"snowballeando\" podria ser una buena build...\nEn cuanto a mi que la juego mucho, depende el match up que tenes enfrente, generalmente rusheo el rey arruinado aunque aveces sacar espadon y completar statik es mejor contra un laner como lucian, las botas deberian ser siempre el 2do item... variando el 1ro o el 3ro... que serian (reyarruinado-statik-filo)","replies":[{"poster":"Bienzahar","date":"2016-03-07T23:50:20.064+0000","up_votes":1,"down_votes":0,"body":"A mi no me hacen faltas las berserker, de hecho siento que son mucho mejor {{item:3009}} dada la pasiva de Vayne, es que tienen mucha sinergia. \nYo cuando juego ADC siempre mi primera opción es Vayne, no es tan necesario un item defensivo con Vayne o sea yo creo que va a depender de la composición del team rival y del desarrollo de la partida.\nFilo de segundo o tercera no me gusta mucho y cuando me hago rey arruinado empiezo con {{item:3144}} y de inmediato las botas, es que le da empujon tremendo.","replies":[{"poster":"arielsebastian","date":"2016-03-08T13:16:53.445+0000","up_votes":1,"down_votes":0,"body":"las botas esas son situacionales, si tenes un adc con movilidad decente, un support con cc(pongame de ej a 3sh), un mid asesino(leblanc-zed-talon) un top/jg con un buen gap closer y algo de cc o buen dmg... esas botas son inutiles, entiendo lo que decis de la sinergia en cuanto a su pasiva, pero la explosion de vayne es a base de atk speed, las botas con la mejora roja ya cumplirian la sinergia de su pasiva, en este caso, preferiria tenacidad, para poder evitar los ccs o cosas por el estilo, NO DIGO QUE SEA UNA OPCION MALA, digo que es situacional y que PARA MI hay muchas mejores opciones, todo esto, viendo a los mejores ADC del mundo... No es por ofenderte y mucho menos agrandarme ya que soy un simple platino... pero supongo que debes ser de mi elo o menos... ¿qué quiero decir con esto? que los coreanos ya probaron TOOODAAAS las builds posibles y por algo se buildean en competitivo de otra forma, sin embargo, esto no quiere decir que A VOS, esas botas te resulten mas importantes en cuanto a tu desempeño con el campeon, cosa que YO no recomiendo...","replies":[{"poster":"Bienzahar","date":"2016-03-12T01:30:13.289+0000","up_votes":1,"down_votes":0,"body":"Es que claro, siempre las builds son situacionales, a no ser que sea un item core en un champ xD\nLo del competitivo y sus builds es un caso aparte para mi, ellos se enfrentan a otra cosa, a equipos preparados y entrenados y a hacer la mayor sinergia entre los integrantes de su equipo, vamos que a nosotros nos puede tocar cualquier cosa en el Dynamic Q xDD\nSolo un consejo te doy, lo de recalcar con MAYUSCULAS LO QUE QUIERES REMARCAR no es una buena idea, estamos intercambiando ideas con respeto.","replies":[{"poster":"arielsebastian","date":"2016-03-12T17:25:59.274+0000","up_votes":1,"down_votes":0,"body":"Lo que remarcaba en mayuscula no era con intencion de faltarte al respeto ni nada parecido, era para remarcar algo, para que no se malentendiera..","replies":[{"poster":"Bienzahar","date":"2016-03-13T18:13:57.706+0000","up_votes":1,"down_votes":0,"body":"Lo sé, pero a mi me molesta cuando la gente escribe así y por eso te lo digo xD","replies":[]}]}]}]}]}]}]},{"poster":"alop55555","date":"2016-03-08T15:53:02.684+0000","up_votes":1,"down_votes":0,"body":"tienes que empezar con un item que te de velocidad de ataque para usar bien la w y conectar los 3 hits","replies":[]},{"poster":"Whitesse","date":"2016-03-07T03:17:55.959+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta jugarla en este orden: {{item:1055}} {{item:1083}} {{item:3087}} {{item:3147}} {{item:3031}} {{item:3036}} {{item:3153}} {{item:1301}}","replies":[]}]}