{"poster":"EnXzo","date":"2015-09-15T15:49:14.372+0000","title":"Para los que juegan escuchando musica.","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Me he dado cuenta que gran parte de los videos que uno pilla ya sea en youtube, screencast, o playlist en cualquier medio donde se comparta o se suba musica, en nuestro caso para jugar lol, o que le viene a este es pura musica de un estilo: Dubstep, electro, o parecidos.\nLa razon de esta \"charla\" es que un amigo me habia dado la idea mencionandome que yo tengo mucha musica de todo tipo, sea jazz, rock, metal, dubstep, punk-rock, etc... por lo cual me ha dado la idea de crear un canal de youtube en donde suba musica para jugar lol con distintos campeones, y que a cada uno de ellos les haga una playlist de musica referente a como son, su historia, tematica, etc... lo cual me gustaba bastante ya que podria variar en el tipo de musica que le pondria a cada campeon, y no solo Dubstep... (no es que esa musica no le venga pero tambien existen otros estilos y otras personas a las cuales no les gusta mucho), asique e decidido hacer el canal y empezar a crear playlist&acute;s para cada campeon, mi pregunta es les gustara a ustedes miembros de Lolcito? me refiero a los que escuchan musica mientras juegan (plz no comentar. yo no escucho musica, etc.... solo para los que si ) cualquier sugerencia o respuesta haganla  :D, por ahora me voy a {{summoner:12}} {{summoner:31}}  chao......","replies":[{"poster":"Sir Axolotl","date":"2015-09-15T15:54:59.383+0000","up_votes":2,"down_votes":1,"body":"Estaría bien, solo si no incluyeras modismos españoles en tu redacción de texto; a menos que seas español. Buena suerte con el proyecto.","replies":[{"poster":"EnXzo","date":"2015-09-16T23:27:37.098+0000","up_votes":2,"down_votes":1,"body":"uasdjajdsjajds sorry es que como es un foro estoy acostumbrado a foros internacionales donde no se entienden algunos modismos chilenos o español latino en general, ajdsjads corregire eso ,  gracias por la suerte :D  {{champion:4}}","replies":[]}]},{"poster":"Starleon","date":"2015-09-16T03:23:56.246+0000","up_votes":2,"down_votes":1,"body":"De por si, escuchar música mientras juegas una partida desconcentra mucho ya que no escuchas los sonidos de alertas de tu equipo y se pierde el focus en un deporte de pura estrategia... Pero bueno, cada uno a lo suyo. Saludos.","replies":[{"poster":"Sir Axolotl","date":"2015-09-17T00:08:33.140+0000","up_votes":1,"down_votes":0,"body":"Como explicas el por que los streamers de alto elo siempre tienen música de fondo durante sus partidas.","replies":[{"poster":"Starleon","date":"2015-09-17T00:30:32.334+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir Axolotl,realm=LAS,application-id=v7qsfXsE,discussion-id=tdbEnpdA,comment-id=00050001,timestamp=2015-09-17T00:08:33.140+0000)\n>\n> Como explicas el por que los streamers de alto elo siempre tienen música de fondo durante sus partidas.\n\nEs depende de la persona, yo hablaba por aquellos que se enfocan 100% en el ambiente hecho por el juego, la verdad yo escucharía los playlist que haga antes de jugar alguna.","replies":[]}]},{"poster":"EnXzo","date":"2015-09-16T23:23:03.650+0000","up_votes":1,"down_votes":0,"body":"insisto dije para los que escuchan musica mientras juegan, por algo jugaran con musica si tu no juegas con tal es tu problema, hay personas que no tenemos problemas en escuchar musica, y subirle el volumen a las alertas, etc... y lo de la concentracion da lo mismo, eso depende de cada persona, bjergsen, wns de klg juegan con musica.","replies":[]}]},{"poster":"Furi Shurtugal ","date":"2015-09-24T05:01:07.021+0000","up_votes":1,"down_votes":0,"body":"No tienes por que subir la música vos, podes simplemente crear playlist con los vídeos que ya hay en Youtube","replies":[{"poster":"EnXzo","date":"2015-09-25T02:29:39.787+0000","up_votes":1,"down_votes":0,"body":"ese es el problema haria eso pero, algunos de los videos de youtube les aumentan la velocidad o cambio de ritmo a un nivel que cambia toda la cancion, y eso es lo que evitare. Aunque dejare links para descargar la cancion sin cambios por mega o algo asi. saludos","replies":[]}]},{"poster":"Meruks Khan","date":"2015-09-17T00:54:54.915+0000","up_votes":1,"down_votes":1,"body":"A mi el estilo me da igual, mientras sea una musica que me guste y se que me va a caer bien, todo ok jaja\nEscucho Dubstep, metal, rock, trap, rap, cumbia y reggaeton, si jaja soy raro{{champion:6}} {{champion:83}}","replies":[{"poster":"EnXzo","date":"2015-09-25T02:27:51.444+0000","up_votes":1,"down_votes":0,"body":"jajaja no es raro, cada quien escucha la música que quiere, tratare de poner la mayor cantidad de estilos por cada modo de campeon, excepto el reggaeton no lo odio pero no me gusta. saludos.","replies":[]}]},{"poster":"Pëstdoktor","date":"2015-09-15T15:52:58.595+0000","up_votes":1,"down_votes":0,"body":"Mas allá del campeón, depende mucho el rol en que lo juegues, y depende igualmente de la partida. Ya sea que tengas que jugar agresivo o pasivo. La iniciativa puede ser buena, me gustaría escuchar algo para Vayne y Lee Sin, son mis principales mains.\nUn saludo :)","replies":[{"poster":"EnXzo","date":"2015-09-16T23:29:34.298+0000","up_votes":1,"down_votes":0,"body":"sisi de apoco ire con compilados algo cortos y esas cosas asi recibir comentarios y mejorar algunas cosas respecto de la musica :D saludos igual {{summoner:7}}","replies":[]}]},{"poster":"Pikorina","date":"2015-09-15T15:55:30.988+0000","up_votes":1,"down_votes":0,"body":"A mí me gustaría escuchar eso, sobretodo para mis mains: Nami, Lulu y Karma. Y al ser support, no me gustaría dubstep, salvo en las tf, que creo que es en donde acompañaría bien. ¿Un tipo rock? puede ser, dejo abierta la imaginación para vos.\n\nSaludos.{{champion:117}}","replies":[{"poster":"EnXzo","date":"2015-09-16T23:27:26.562+0000","up_votes":1,"down_votes":0,"body":"siii cosas asi musica relax para el early en caso de algunos supp {{summoner:7}}  y luuego para el late unas buenas canciones que inspiren epicidad :D saludos igual ty {{summoner:31}}","replies":[]}]},{"poster":"Funes7","date":"2015-09-15T15:58:21.904+0000","up_votes":1,"down_votes":0,"body":"hacelo y vemos como queda... \n\nMenos chachara y mas accion.\nLa idea esta buena, pero los enganchados tienen que durar 50min","replies":[{"poster":"EnXzo","date":"2015-09-16T23:26:20.873+0000","up_votes":1,"down_votes":0,"body":"ese  es el tema tampoco e gustaria  hacer las playlist muy largas, gracias por tu apoyo sip, pero bueno eso se ira viendo de apoco, tambien subire un video de como descargar la cancion sin dowloaders, y si quieres hasta solo una parte del video no todo para los que les guste una cancion, en unos dias mas publicare el name del canal :D  ty {{summoner:7}}","replies":[]}]},{"poster":"Kanthaka","date":"2015-09-15T16:01:53.535+0000","up_votes":1,"down_votes":0,"body":"Para {{champion:81}} seria algo asi como el tracklist de las spice girls, justin, lali esposito o algo de eso...","replies":[{"poster":"EnXzo","date":"2015-09-16T23:24:38.801+0000","up_votes":1,"down_votes":0,"body":"jasdjajdsjasjjasdj me sacaste unas buenas carcajadas  toma tu like {{summoner:14}}","replies":[]}]},{"poster":"Revolución","date":"2015-09-16T03:26:00.256+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=V4hSUDCWKDc\n\nLa temporada pasada escuchaba Richard Cheese siempre que iba con Zilean, no preguntes por qué.","replies":[]},{"poster":"EnXzo","date":"2015-09-16T23:31:06.553+0000","up_votes":1,"down_votes":1,"body":"jajajsjdajsd responder a todo gg ope feed, en unos dias  estare publicando el primer video creo, ya que tengo que cambiar ciertas cosas de la cancion por el copyrigth que puuedan tener pero sin cambiar la cancion o que suene de manera distinta, gracias por sus saludos y apoyo, :D    ojala lleguen rapido a oro :D kawaii desuu {{summoner:4}}\na y gracias Courageoüs  me diste una idea de que cada vez que saque un campeon le haga dos tipos de musica, para jugadores pasivos, activos, o en \"modo\" defensivo asi la musica la escuchas segun tu forma de juego jadsjajd gracias por la carreada de idea xD <3   ","replies":[]}]}