{"poster":"xInfect","date":"2017-03-06T15:28:03.561+0000","title":"Coaching, Verbesserungsvorschläge weil Stuck in Silver","subforum":"Level Up: Guides & Tipps","embed":{"description":"xInfect / Silver 3 0LP / 132W 148L Win Ratio 47% / Ryze - 29W 24L Win Ratio 55%, Vayne - 16W 15L Win Ratio 52%, Illaoi - 14W 13L Win Ratio 52%, Azir - 13W 13L Win Ratio 50%, Twitch - 11W 15L Win Ratio 42%","url":"https://euw.op.gg/summoner/userName=xInfect","image":"http://s3.ap-northeast-2.amazonaws.com/opgg-static/images/logo/2015/reverse.rectangle.png"},"up_votes":2,"down_votes":1,"body":"Hallo allerseits,\r\n\r\nich spiele seit S5 Lol und habe mich seitdem stetig gesteigert Silver -&gt; Gold. Jetzt wollte ich diese Season Platin anpreisen was jedoch d&uuml;ster aussieht da ich schon mit einer negativen Winrate (47%) in mid Silver rummh&auml;nge. Nach langem gr&uuml;beln habe ich mir gedacht doch mal hier einen Thread zu erstellen in der Hoffnung das mir bessere Spieler ein paar Tipps oder bisschen coaching unentgeltlich anbieten werden :D! {{item:3070}} \r\n\r\nMeine Main Position ist Jungle, in der Flex Q spiele ich Playmaker Tanks wie Zac, Amumu oder Sejuani. Im Solo Q versuche ich weitestgehen Carrys auszupacken da ich aus Erfahrung sagen kann, wenn ich einen Amumu picke das Game mir aus den H&auml;nden gleitet ohne irgendwas tun zu k&ouml;nnen :p Freue mich f&uuml;r Verbesserungsvorschl&auml;ge oder interessante pathing Wege. Anhand des op.gg Links oben seht ihr welche Champs ich momentan abuse! :D\r\n\r\nLiebe gr&uuml;&szlig;e und viel spa&szlig; beim Ranked, kappa","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-06T15:57:57.291+0000","up_votes":3,"down_votes":0,"body":"An sich ist jedem im Low-Elo-Bereich (Bronze-Gold) das Gleiche zu empfehlen:\n\n1. Spielt nicht um aufzusteigen. Euer Primärziel sollte die Steigerung eures Spielneaveaus und -verständnis sein. Allein auf Ligen und Divisionen zu spielen, macht in dem Bereich 0 Sinn. Klar kann man sich ein Ziel setzen, aber im Fokus sollte die gesammelte Erfahrung auf dem Weg zum Ziel sein. Ab Mitte Platin kann man dann anfangen sich an der Elo zu orientieren.\n\n2. Spammt 1 oder 2 Champions auf den Tod. Bei dir speziell sind es 8 verschiedene Jungler in den letzten 20 SoloQs. Championvielfalt spielt in dem Bereich kaum eine Rolle. Man sollte lieber 1-2 Champions nahe an seine eigene Perfektion bringen. So erlangt man viel schneller und besser das nötige Spielverständnis um sich dann auch zu verbessern und dann natürlich auch aufzusteigen. Das Wissen von diesem Chamopion(s) kann man dann auch ganz einfach auf andersartige Champions umwandeln.\n\n3. Etwas im Einklang mit dem ersten Punkt, aber wichtig genug, um es speziell zu erwähnen. **Nehmt aus jedem Spiel etwas mit.** Ob knappes Spiel oder totaler Stomp für das eigene Team, es gibt immer was, was man mitnehmen kann.\nAls Beispiel nehmen wir mal mich. Ich als Supportmain spiele von Anfang an mit einem 2. Spieler. Demnach passiert es auch mal, dass dieser Spieler - warum auch immer - total verkackt. Auch wenn wir dann hart verkacken, Open Mid machen oder Sonstiges, frage ich mich, was ich vor dem Totalausfall des anderen besser hätte machen können, bzw. wie ich diesen vielleicht verhindern hätte können. Vom Championselect angefangen, bis zu dem Zeitpunkt als das Spiel verloren schien.\n\nDas sind die 3 Tipps mit denen man meiner Meinung nach in diesem Bereich am meisten anfangen kann. Hoffe ich konnte dem ein oder anderen helfen :)","replies":[{"poster":"xInfect","date":"2017-03-06T16:22:43.974+0000","up_votes":1,"down_votes":0,"body":"Hallo Ruaga,\n\nerstmal vielen Dank für deine Anteilnahme und wertvollen Tipps. Eine kleine Frage hätte ich noch lohnen sich teamorientierte Champs wie Amumu im SoloQ im Low Elo Bereich oder sagst du man sollte den Carrystab hier selber in die Hand nehmen und einen Nocturne/Graves spielen?\n\nKleine Anmerkung die letzten Games haben deshalb so eine große Championsvielfalt, da ich im Normal versuche meinen Championpool ein bisschen zu erweitern:)\n\nLiebe Grüße{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-06T17:22:21.987+0000","up_votes":1,"down_votes":0,"body":"An sich würde ich Carrychampions empfehlen - bei mir zum Beispiel waren es damals {{champion:89}} und ab seinem Release {{champion:412}}.\nDenn Leuten in niedrigeren Ligen mangelt es so gut wie immmer an Erfahrung, um richtig mit Teamfights umzugehen. Sowohl während als auch danach.\n\nMeiner Meinung sind burstlastige Champions am besten, da passt {{champion:104}} zB auch sehr gut rein.","replies":[]}]}]},{"poster":"You Got My Name","date":"2017-03-09T03:38:18.280+0000","up_votes":1,"down_votes":0,"body":"Problem was ich schon sehe an deinen Profil, du spielst mal das und dann wieder das und dann doch mal das d.h. Du spielst einfach zu viele verschiedene Champs.\n\nPro Tipp von mir.\nSuch dir auf deiner Main rolle 2-3 Champs aus und spam nur die. Das hat denn erfolg -> du wirst gut mit dem Champ und musst später, wenn du denn Champ dann drauf hast, nicht mehr so arg auf denn Champ achten musst ,sondern kannst dich mehr auf das Game und was wichtig ist konzentrieren.\n\nFür deine Offrole rolle sollten es nur 1-2 champs sein UND! Support solltest du auch 1-2 champs haben und die können, weil jeder wird mal support autogefillt.\n\n\n\nEdit: das was Ruaga  sagt.","replies":[]}]}