{"poster":"Sped","date":"2019-09-15T10:53:12.503+0000","title":"Either I'm really bad at this game, where as this 29% win rate is in silver 4","subforum":"Help & Support (OCE)","embed":{"description":null,"url":"https://media.discordapp.net/attachments/349137352859451402/622745912745132042/HOW_IS_THIS_POSSIBLE.png?width=1202&height=676","image":null},"up_votes":1,"down_votes":0,"body":"How is this possible has Riot messed up their ranked system that fucking bad or is this just me?","replies":[{"poster":"Ninox","date":"2019-09-15T11:03:54.057+0000","up_votes":1,"down_votes":0,"body":"So that player:\n\n1. Hasn't played ranked in previous seasons.\n2. Has only just finished placements.\n\nBoth of which mean he has fresh MMR for the ranked queue which is around low Silver.\n\nAnd 3. that 29% is over 14 games, which is basically meaningless. Any sample size of under 100 isn't really going to tell you anything.","replies":[{"poster":"Sped","date":"2019-09-15T11:06:13.068+0000","up_votes":1,"down_votes":0,"body":"So, I started a new account, fresh MMR, won 8/10 of my games and placed Bronze 3, ok thats fair.","replies":[{"poster":"Ninox","date":"2019-09-15T11:45:56.702+0000","up_votes":1,"down_votes":0,"body":"It depends on which games you win an what you're versing in those games. If you're playing at weird times the MMR range will be wider, and if you win those games against people of higher MMR the gain will be greater than if you were versing an evenly matched team. The opposite is also true though. If you lose against a team of lower MMR, your losses will be much higher.\n\nAlso, if you win your first game your minimum placement rank will generally be higher, so you're starting with an advantage on someone who loses that first game.\n\nThe system is pretty good at determining roughly where you should be ranked in those 10 games, but it is still ultimately a tiny sample size, and visible stats won't truly start to settle until 100~ games.\n\nIf you belong above where you were placed, you'll climb pretty quickly and visa versa.","replies":[]}]}]}]}