{"poster":"Pandeonor","date":"2017-07-13T19:56:07.090+0000","title":"Du weisst Du bist Bronze wenn.....","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"..... Du mit Deinem Team  zwischenzeitlich bis zu 32 Kills vorne liegst und trotzdem verlierst . :-/\n\n\nJeder (?) hatte schon mal ein verkorkstes Spiel. Wie sah Euer _worst match_ aus? ☺","replies":[{"poster":"MBausK","date":"2017-07-21T13:46:47.737+0000","up_votes":2,"down_votes":0,"body":"Worst Match:\n\nWir sind im Spiel sehr weit vorraus. Kills standen ca. 25 zu 6, 4 zu 0 in Türmen, 3 Drachen vorne.\n\nAdc-Kogmaw (15/1/4 KDA) sagt: \"Ich will Baron machen und warte hier, bis ihr kommt. Wenn in 60 Sekunden keiner hier ist, leave ich.\"\n\nUnd damit war das Spiel dann auch verloren :)","replies":[]},{"poster":"Enderized","date":"2017-07-14T09:31:09.297+0000","up_votes":2,"down_votes":0,"body":"... als mein Support Braum sich beschwert, dass ich nicht ganken komme, wenn er bis Level 4 jeden Fight nimmt und verliert...\n... wenn ich diverse Runden in Folge Leute habe, welche AFK Lane Farmen, nachdem sie 0/4 stehen, während der Nexus belagert wird (HotS & LoL)...","replies":[]},{"poster":"ReDcOrSaIr2","date":"2017-07-14T11:02:58.837+0000","up_votes":1,"down_votes":0,"body":"Mein worst match war, als ich Vayne spielte. Ich war übel ahead (20/4/6). Ich war schon Fullbuild und die Gegner nicht. Als die Baron gemacht haben, flashte ich ins gegnerische Team, weil ich dachte jetzt mache ich die big Plays. Ich wurde dann aber instant CC'd von einem Nautilus und starb. Die Gegner machten Baron und finishten uns...\n\nWar schon ein bisschen sad {{summoner:31}}","replies":[]},{"poster":"ELOW Cronos","date":"2017-07-14T07:19:45.468+0000","up_votes":1,"down_votes":0,"body":"Mein worst Match ever war gleichzeitig eins der Spiele wo ich zu meiner persönlichen Bestform aufgeblüht bin.\n\nMeine Toplane Riven starb genau so oft wie sie Kills/Plays machte, während sie uns alle zuflamte was für Noobs wir doch seien, nachdem sie mir schon in der Champselect angedroht hatte zu Inten wenn ich sie nicht ganken würde (Funfact: Nach dem ersten Gank bei dem ich ihr den Kill überlassen habe, ist sie doch tatsächlich 3x im 1v1 gegen den gegnerischen Yasuo verreckt). \n\nDie Midlane war zwar Taubstumm, spielte aber so als hätte dieser seinen 9 jährigen Cousin vor den PC gesetzt um ihm League zu zeigen.\n\nUnsere Botlane hingegen war damit beschäftigt wirklich heftig im 2v2 reinzuinten und sich gegenseitig die Schuld in die Schuhe zu schieben, während sie die Mutter des jeweilig anderen beleidigten.\n\nIch hatte uns derweil eigentlich einen schönen early Lead erarbeitet und war so Stocksauer über mein Team und wie es das Spiel einfach wegwarf, das ich....prompt einfach gecarryed hab o.O\n\nIrgendwie hab ich es geschafft immer wieder einzelne Gegner zu catchen, in Teamfights immer wieder Tripples zu landen und Turrets im Splitpush abzuholen. Am Ende hab ich es sogar geschafft 1v5, ohne Vision den Baron zu stealen und die ganze Situation zu überleben um mit dem Buff nen Inhib (und dadurch dann den Nexus) zu holen.\n\nTrotz dem Sieg, habe ich mich noch nie so sehr über ein League-Spiel aufgeregt und hätte wohl am liebsten meinen PC mit einem Baseballschläger zertrümmert. Ich habe an diesem Tag dann auch kein weiteres League-Spiel mehr gemacht...\n\nAchja gespielt habe ich übrigens den Jungen hier: {{champion:120}} ","replies":[]},{"poster":"Allerbester Biss","date":"2017-07-14T04:55:51.078+0000","up_votes":1,"down_votes":0,"body":"Wenn es steht 75:75 nach 35 min\nXD","replies":[]},{"poster":"MisterFirstBlood","date":"2017-07-14T04:55:11.658+0000","up_votes":1,"down_votes":0,"body":"hab mal 3vs5 verloren, wir waren die 5.\n\n:D","replies":[]},{"poster":"Killerkante","date":"2017-07-13T20:30:36.598+0000","up_votes":1,"down_votes":0,"body":"... die Spieler für jeden Scheiß tilten","replies":[]},{"poster":"Ionian Master Yi","date":"2017-07-13T20:04:09.210+0000","up_votes":1,"down_votes":0,"body":"als rekkles mit duoq supp in master intet. traumatisiert bis zum lebensende (habe ihn immer gut gefunden bis dato :D)","replies":[]}]}