{"poster":"Pandeonor","date":"2017-07-19T10:19:57.281+0000","title":"Redemption oder nicht","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Schon lange nicht mehr. Aber gerade eben in meiner letzten - verlorenen - Silber-promo h&auml;tte einer gerne gehabt das ich Befreiungsschlag baue. Das mache ich auf Zyra nie und habe das auch auf verschiedenen youtube-Vids von Zyra nie gesehen [well.... in solchen Vids sieht man immer nur Siege, daher evtl. nur eingeschr&auml;nkt aussagekr&auml;ftig]. Ich mache mit Pflanzen+R und entsprechender Durchschlagskraft wesentlich mehr Schaden. Das Teammitglied meinte dann: zur _Heilung_. ☺\r\n\r\nJe nun. Item hat begrenztern Radius und enorme Abklingzeit was bei in den letzten 2 verlorenen Matches doch sagen wir _&uuml;bersichtlichen_ Teamfights nicht viel gebracht haben w&uuml;rde [oder doch?]. Bei Jannas und Co. ohne viel skalierbaren Damage verstehe ich das. \r\n\r\nHaltet _Ihr_ es sinnvoll oder nicht? Wurde schon fr&uuml;her das ein-  oder andere mal gefordert - regelm&auml;&szlig;ig wenn das Team hinten lag.\r\n\r\n[Ihr merkt -- Ich bin etwas angefressen, hatte vor den letzten Beiden Matches 6 aus 7 gewonnen, darunter 2xS und 2xA.... nun in der Promo 2 &auml;rgerliche verlorene Matches jew. gegen einen Zed. Zed mag&acute; ich &acute;ned. ☺ Und die eigenen Teams erschienen suboptimal. ]","replies":[{"poster":"La vida Loca 38","date":"2017-07-19T14:29:37.669+0000","up_votes":2,"down_votes":0,"body":"Redemption soll wirklich stark sein. AOE Heal mit einer großen Range welchen man auch im Tod aktivieren kann. Allerdings wird der Healwert nicht sehr groß sein bei einer Zyra. Mit ihr baut man ehr weniger ein Ardent cencer oder Mikaels. Redemptions Heal lässt sich ja auch bessern durch andere Items und Masteries daher wird der Heal nicht sehr effektiv sein. \nAnstatt Redemption kann Zyra wirklich nützlichere Items holen.\nAuf Champs wie Soraka, Sona, Janna perfektes Item aber Zyra...........","replies":[{"poster":"El Capitán TSV","date":"2017-07-19T14:54:18.914+0000","up_votes":1,"down_votes":0,"body":"Selbst im Tod akitivierbar? o.O\n\nOhhh f**k me...","replies":[{"poster":"La vida Loca 38","date":"2017-07-19T14:57:36.292+0000","up_votes":1,"down_votes":0,"body":"Ist es nicht so xD? Wenn ja dann tut es mir leid :D.... Ich kenne das Item nur durch die Beschreibung und Erklärungen. Ich habe es in der Praxis nicht erlebt.","replies":[{"poster":"El Capitán TSV","date":"2017-07-19T15:15:13.491+0000","up_votes":1,"down_votes":0,"body":"Also wenn es so ist, beiß ich mir derbe in den Arsch, denn es gab schon mehrere Situationen wo ich vergessen habe Redemption zu benutzen bzw. einfach nicht dazu kam, weil ich instant umgeklatscht wurde.. :D\nEs hätte eventuell Spiele oder zumindest Teamfights entscheiden können.. :D\n\nIch probiere es später mal aus...","replies":[{"poster":"Sirrkas","date":"2017-07-19T15:28:10.517+0000","up_votes":1,"down_votes":0,"body":"Ja, es kann im Tod genutzt werden. Außer du hast es erst im Tod gekauft, dann hat es eine Abklingzeit, bis du wieder lebst.","replies":[{"poster":"El Capitán TSV","date":"2017-07-19T15:30:59.136+0000","up_votes":1,"down_votes":0,"body":"Oh man... Ich sollte mir echt mal bisschen mehr Mühe geben und mich mehr informieren ._.'\n\nAber gut zu wissen! :D","replies":[]}]},{"poster":"La vida Loca 38","date":"2017-07-19T15:26:43.965+0000","up_votes":1,"down_votes":0,"body":"Also so habe ich es gehört. Es soll auch nach dem Tod aktivierbar sein. Persönlich benutzt oder kennengelernt habe ich es nicht, gab es zu meiner Zeit nicht.\nAber ja probiere es aus :).","replies":[]}]}]}]}]},{"poster":"Fresh Dumbeldore","date":"2017-07-19T11:50:39.813+0000","up_votes":2,"down_votes":0,"body":"Als {{item:3107}} releast wurde und die darauf folgenden Patches war {{item:3107}} sehr stark und man baute es auf jedem Supporter und teilweise auch auf tank-/supportorientierten Junglern und Toplanern. Danach wurde es immer wieder abgeschwächt.\n\nIch finde, dass {{item:3107}} für \"heal and shield\" Champs wie z.B. {{champion:40}} {{champion:117}} {{champion:427}} oder auch für Tanksupporter wie {{champion:497}} {{champion:12}} {{champion:89}} ,die meist auch {{item:3190}} bauen, sehr gut geeignet ist. \n\nAuf \"Supportern\" wie {{champion:143}} oder {{champion:63}} ist das abgeschwächte {{item:3107}} meiner Meinung nach nicht zu empfehlen, da diese andere Prioritäten wie z.B. {{champion:117}} oder {{champion:89}} haben.\n\nFreundliche Grüsse\nFresh Dumbeldore, einst Yatevaz","replies":[{"poster":"Kaorî","date":"2017-07-19T22:29:44.862+0000","up_votes":1,"down_votes":0,"body":"Redemption sollte man weder auf Alistar, noch auf Leona bauen. Redemption skaliert mit Windspeaker und Ardent Censer, beides Dinge, die weder ein Alistar, noch eine Leona nutzt. Solari und Redemption zusammen zu bauen ist sowieso nicht mehr worth, da Solari nun mit Leben skaliert und Redemption für seinen Preis kein Stück Goldeffizient ist, was das reine Leben angeht. Da sind der Ruby Sightstone, das Face of the Mountain und der Knights Vow deutlich weiter vorne, was Synergie mit Solari angeht.","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T05:41:47.031+0000","up_votes":1,"down_votes":0,"body":"http://champion.gg/champion/Alistar/Support\nhttp://champion.gg/champion/Leona/Support?league=\nhttp://www.leagueofgraphs.com/champions/items/alistar\nhttp://www.leagueofgraphs.com/champions/items/leona\nhttp://lolalytics.com/champion/Alistar/items/\nhttp://lolalytics.com/champion/Leona/items/\n\nKonkret zum Beispiel Leona und Alistar\n\nIch habe mehrere Seiten miteinander verglichen und Redemption wird auch in Kombination mit Locket gebaut, zwar nicht sehr oft, aber es wird trotzdem gebaut.\n\n> Tanksupporter\n\nAber wie stehst du dazu? Sollte es nur auf Tanksupportern mit Heals and Shields wie {{champion:497}}  oder {{champion:44}}  gebaut werden oder gar nicht?","replies":[{"poster":"Kaorî","date":"2017-07-20T07:49:11.175+0000","up_votes":1,"down_votes":0,"body":"Redemption ist für Supporter mit Windspeaker Blessing geeignet, denn Redemption wurde ja, mal wieder, generft und das nicht zu wenig, man ist nun also auf Shieldpower angewiesen, um es wieder lohnenswert zu machen, sonst ist er Heal schwächer als eine Nami W ohne Windspeaker und damit nicht lohnenswert. Da fängt ein Nights Vow mehr Schaden vom Hauptcarry ab, als Redemption Leben wiederherstellt. Rakan ist so ne Sache... Ihn spielt man meistens auf Colossus, damit er seinen Engage auch überlebt. Ihn mit Windspeaker zu spielen fühlt sich einfach nicht gut an, man kriegt auf der Lane sonst zu sehr aufs Maul, wenn man nicht gerade mit einer guten Xayah zusammenspielt. Taric haben sie nun kaputt generft, keine Ahnung, warum Riot seinen Heal auf der Q weitergenerft hat, der war eh schon komplett schwach.\nEgal was man macht, sein jetziger Heal ist immer schlechter als sein alter Heal und sein Shield war noch nie sehr stark, da der zuletzt gemaxt wird. Da man für gewöhnlich seine E maxt, da dies der Stun ist und so die Stun Dauer hochgeht sowie der Schaden, heilt seine Q auf der Lane 30 Leben lediglich +1% seines maximalen Lebens. Auf der Lane hat Taric so zwischen 650 - 900 Leben, also +6,5 - +9 = 36,5-39 Leben und das kostet auch noch ziemlich viel Mana. Seine Manaregeneration ging zwar hoch, aber wenn du den Heal öfters nutzt, bringt dir das nichts. Stacks auf dem Heal bekommt man auch erst, wenn man Punkte rein investiert.\nWas man auf Taric also baut, ist geschmackssache, aber seit dem Nerf würde ich ihn auch nur noch auf Fulltank spielen.\n\nChampion.gg ist so eine Sache. Ist super für Statistiken, bezieht aber gerade bei Supportern häufig die Daten aus den Leuten, die Support nur mal zwischendurch spielen. Bestes Beispiel hierfür ist Sona. Schau mal auf probuilds.net nach, mit welchem Item die Leute auf Sona starten und dann auf Champion.gg\nProbuilds sagt Coin, Champion.gg sagt Spellthief. Coin ist aber die richtige Antwort, denn dieses wurde im Mana Refund ordentlich gebufft und wer kennt denn nicht die Situation, dass man mit Sona nach 3x W out of Mana ist. Der Coin verhindert das deutlich effizienter, als das Spellthief und gibt ihr auch mehr Gold im gesamten Spiel, vorallem, wenn man behind fällt in der Lane.","replies":[{"poster":"Sirrkas","date":"2017-07-20T08:41:57.119+0000","up_votes":1,"down_votes":0,"body":"> Taric haben sie nun kaputt generft, keine Ahnung, warum Riot seinen Heal auf der Q weitergenerft hat, der war eh schon komplett schwach.\n\nDas ist ein Buff. Ich habe Taric zwar fast nur im 3vs3 gespielt, jetzt kann er in Kämpfen aber viel mehr Heilen. Davor hat seine Passive dafür gesorgt, dass er einen Stack nach 2 Autohits hat. Ich muss jetzt zwar den Q leveln, damit er mehr Ladungen haben kann. Dafür kann ich aber deutlich stärker damit heilen. Vor allem im Early dürfte es jetzt deutlich mehr sein. \n\nWenn du magst, können wir mal kurz vorher zu nachher vergleichen.\n\nVorher:\n3 Stacks Maximum. \n\nHeilung je Stack 60 + 0,2 AP + 1,5 % BonusHP\nbis zu mal 3.\n\n180 + 0,6 AP + 4,5 % BonusHP\n\nJetzt :\n5 Stacks Maximum\n\nHeilung je Stack 30  + 0,2 AP + 1 % MaxHP\nbis zu mal 5.\n\n150 + 1,0 AP + 5 % MaxHP\n\nDie Grundheilung ist also um 30 niedriger, dafür ist die HP-Skalierung deutlich stärker, vor allem, da sie nicht mehr nur noch BonusHP berechnet. \n\nAber, im Kampf ist die Heilung immer stärker, wenn man sie weitere male einsetzt. 2 neue Stacks entsprechen bei der Grundheilung 1 altem Stack. Mit 6 Stacks wäre die Grundheilung also so hoch wie davor. Im Kampf wird man aber nicht so weit kommen, die ständig voll aufzufüllen. Also wird man hin und wieder mit 2 oder 4 Stacks heilen, was so stark ist, wie die 1 oder 2 Stacks, die man davor in der Zeit gekriegt hätte. Jetzt aber mit deutlich höheren Skalierungen. \n\nJa, beim ersten mal lesen, dachte ich auch erst, das wäre ein Nerf. Es ist aber in den meisten Fällen ein Buff. Sogar die Manakosten sind später deutlich geringer geworden.\n\n>Egal was man macht, sein jetziger Heal ist immer schlechter als sein alter Heal und sein Shield war noch nie sehr stark, da der zuletzt gemaxt wird. \n\nEs kann sein, das ich den Suboptimal geskillt habe, aber ich habe den W immer vor der Q maximiert. Unter anderem, weil die Kosten viel zu hoch wurden. Die Q habe ich dann genutzt um den Glanzproc anbringen zu können. Die Q hatte durch die Passive die selbe Abklingzeit wie Glanz. Da konnte ich dann {{item:3025}} durchgehend aktivieren.\n\nDa die E keine höhere Stundauer mehr gibt, würde es jetzt auch Sinn machen, vorher die Q zu leveln, um an die Bonusstacks zu kommen.","replies":[{"poster":"Kaorî","date":"2017-07-21T16:36:43.466+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=lIhL1ZsFBDM **(ab 12:10)**\nLaut der Rechnung ist es eindeutig in Nerf.\nMan muss auch dazu sagen, dass Taric nun ständig AAs machen muss, um seine Stacks zu bekommen, was natürlich eine nette Belohnung ist, wenn der Stun sitzt, aber da man Taric nicht tanky baut, nicht mal von den Masteries her, kann das auch schnell in die Hose gehen (den Taric Stun zu dodgen ist jetzt keine Meisterleistung).","replies":[{"poster":"Sirrkas","date":"2017-07-21T23:49:53.013+0000","up_votes":1,"down_votes":0,"body":"Der rechnet aber mit nur einer einzigen Heilung bei maximalen Stacks. \n\nIch spreche davon, dass er jetzt im Kampf besser ist. Taric ist tanky und wird auch Tanky gebaut. Wenn ich nachsehe, was auf Taric gebaut wird, finden sich da solche Items:\n{{item:3190}}  {{item:2303}}  {{item:3107}}  {{item:3110}}  {{item:3109}}  {{item:3401}} {{item:3065}}  {{item:3050}} {{item:3504}} \n\nAußer dem Rauchschwenker hat davon alles Verteidigungswerte. Zudem kostet die Heilung ab Stufe 3 jetzt auch weniger. Zugegeben, Stufe 1 ist ziemlich nutzlos. \n\nWenn man im Kampf alleine Q > Autohit > Autohit > Q in Dauerschleife macht, heilt er jetzt mehr. Da ist es vermutlich sogar egal, auf welcher Stufe der Q gerade ist. \n\nWäre Q auf 1, kriegt er zwar nur einen Stack, mehr hätte der alte Q aber in der Zeit auch nicht gekriegt und hat sogar 10 weniger Grundheilung gehabt. Erst auf Stufe 5 ist die Grundheilung der einen Ladung, die er kriegen würde, so gut wie die der 2 die er kriegt. \n\nSollte Riot wollen, dass der neue Q immer stärker ist als der alte, müssen sie vermutlich nur die Ladungen auf jeder Stufe um 1 erhöhen und die Ladezeit reduzieren. Dann wäre er bei vollen Ladungen stärker und auch bei minimalen. Dazu noch günstiger auf der höheren Stufe mit durchgehend besseren Skalierungen. Vielleicht kommt so etwas  ja im nächsten Patch.","replies":[{"poster":"Kaorî","date":"2017-07-22T17:15:24.554+0000","up_votes":1,"down_votes":0,"body":"http://www.probuilds.net/champions/details/Taric\n\nNaja, wirklich tanky ist das jetzt nicht.\n\nhttp://lolalytics.com/champion/Taric/\nHier sieht man eher ein Mix, aber auch nicht wirklich sehr tanky.\nZudem geht man bei Taric 0/18/12 in den Masteries, was ihn noch weniger tanky macht für einen Melee.\n\nTaric kann jetzt zwar deutlich öfter healen, ist aber **trotz** erhöhter Manareg **sehr schnell** out of Mana. Er ist schon quasi auf Ocean Drakes angewiesen und vorallem ist er zwingend auf ein Redemption angewiesen und das nicht wegen dem tollen Heal, sondern wegen dem Manareg.\nEs darf nicht sein, dass ich als Supporter mitten im Teamfight out of Mana bin, obwohl ich kaum was gemacht habe.\n\nDas Schönste an Taric ist ja immernoch seine Ulti, diese brauch aber **deutlich** zu lange, bis sie aktiviert wird. In der Zeit kann ein Zed seine komplette Combo draufhauen oder ein Khazix oder so ziemlich jeder andere Combo Champ.\n\nUm Taric wirklich wieder flüssig zu machen, sollte man **meiner Meinung nach** dringend die Range seiner E erhöhen, denn die ist absurd gering. Da hat selbst ne Janna ne höhere AA Range und seine Ult muss schneller aktiviert werden. Da tut's schon eine Sekunde weniger und es würde sich besser anfühlen.\nZudem sollte seine Grundtankiness etwas nach oben gehen, damit er auf der Lane nicht von so ziemlich jedem Range-Supporter hart aufs Maul bekommt, da er mit nichts an den Gegner rankommt, sondern nur hinten steht, heilt und nach 20 Sekunden out of Mana ist.\n\nJemand, der nur Taric spielt und ein absolutes Ass auf ihm ist, kommt mit ihm natürlich auch so super zurecht, das trifft aber auch auf otp Urgots hin oder Galios, erschreckendes Weise hat Galio momentan nämlich eine grottenschlechte Winrate.","replies":[{"poster":"Sirrkas","date":"2017-07-22T17:29:57.775+0000","up_votes":1,"down_votes":0,"body":"Außer dem Build mit der Träne sieht mir das durchaus tanky aus. Wenn auch nicht nach Fulltank. \n\nBei der E darfst du nicht vergessen, dass die von 2 Punkten aus gewirkt wird. Zudem ist es ein Flächenstun. Wenn man das zu groß macht, ist es viel zu einfach mit einer E das ganze Team zu betäuben. \n\nAuch bei der Ulti ist es ziemlich kritisch, etwas an der Wartezeit zu ändern. Ja, der Gegner kann dein Team in der Zeit noch töten. Du kannst das aber auch erschweren, indem man zum Beispiel den eigenen Q und W verwendet, Solari einsetzt etc. Die Ulti hat zudem das Potential 5 Spieler für 2,5 Sekunden unverwundbar zu machen. Wenn man die Wartezeit hier zu kurz macht, wird das auch wieder gnadenlos OP. \n\nIch halte ihn zur Zeit auch nicht für die beste Wahl als Support, man kann den aber auch nicht so einfach buffen. Der hat eben sehr viel Potential, außer dem W ist alles ein Flächeneffekt und der W bestimmt dafür wo die andere Fläche erscheint.","replies":[{"poster":"Kaorî","date":"2017-07-22T17:45:46.451+0000","up_votes":1,"down_votes":1,"body":"> Zudem ist es ein Flächenstun. Wenn man das zu groß macht, ist es viel zu einfach mit einer E das ganze Team zu betäuben.\n\nZyra E, Zyra Ult, Jinx E, Varus Ult, Leona Ult, Nami Ult, Sona Ult, Annie fullstack Ult, Braum Ult, Amumu Ult, Maokai Ult, Orianna Ult, Xayah Ult + E, und noch andere Knock Ups/CCs, die mehrere treffen können.\n\nDu siehst, es gibt mehr als genug davon und Taric hinkt da weit hinten dran. Es soll ja nicht die breite seiner E erhöht werden, sondern die Reichweite. Trotz verbündetem ist es nicht so einfach diesen CC zu treffen.\nMan kann in der SoloQ schlecht dem Verbündetem in nem plötzlichem Fight klar zu machen, wie er sich zu positionieren hat, damit die doppelte E jemanden stunt.\nZumindest bei den ADCs, die ich bekomme, ist das Positioning von denen, um meinen E über denen zu treffen, grottenschlecht.\nEntweder fangen sie dann an zu sidesteppen und zwar genau in die falsche Richtung, oder gehen kurz n Schritt zurück, wodurch die Reichweite nicht mehr ausreicht(ein Adc will ja auch nicht als Frontline darstehen) oder oder oder.\nEs kann natürlich gut gehen und wenn es gut geht, kann man damit richtig coole Plays machen, aber man ist als Taric drauf angewiesen, dass der Stun sitzt, sonst kriegt man aufs Maul und zwar richtig, denn er hat keine Möglichkeit mehr sich dann zurückzuziehen, anders als Rakan zum Beispiel.","replies":[{"poster":"Sirrkas","date":"2017-07-22T17:54:16.386+0000","up_votes":1,"down_votes":0,"body":"Das meiste davon sind Ults, die du gerade mit einer E vergleichst. Jinx kann maximal 3 snaren, Zyra theoretisch alle und hat eine größere Reichweite, ist dafür aber auch ein langsamer Skillshot. Ob Breite oder Länge, das macht keinen großen Unterschied, beides erhöht die Fläche. Der Gegner soll ja noch die Chance haben auszuweichen. Und wenn man den gerade selber anbringen will, kann man damit den Gegner vielleicht auch dazu zwingen, die Sekunde lang wegzulaufen, in der Zeit können die meisten auch nicht richtig kämpfen. \n\nIch persönlich sehe Taric eher als Wette für Teamfights an. Der Champion blüht richtig im 5vs5 auf und will solche oft sehen. E mit einem Renekton beim engage kombinieren, sicherer Stun, W auf ihn zum schilden, R drücken und sich selbst neben der Backline platzieren, sollte ein Assassine in deren Nähe kommen und die Frontline wird von deinem Partner gebufft.","replies":[{"poster":"Kaorî","date":"2017-07-22T19:08:36.466+0000","up_votes":1,"down_votes":0,"body":"> Der Gegner soll ja noch die Chance haben auszuweichen.\n\nDa tuts n Sidestep auch. Bis die E wirkt, kann ich einmal um Taric herum laufen.\nKlar sind die meisten genannten Fähigkeiten von mir Ultis, aber ob eine Ult den Teamfight beendet oder eine E - macht keinen Unterschied.\nDer Zyra E ist auch gar nicht mal so langsam und gerade vor dem Baronpitt ziemlich schlecht zu sehen, vorallem aus einem Busch heraus, der ja mitten im River rumsteht.\n\nMit Annie kann man mit fullstack auch einfach W drücken und das gesamte Gegnerteam ist gestunnt, mit wesentlich breiterer Hitbox. Vorausgesetzt es wird geklumpt, aber das trifft auf jeden Flächen-CC zu.","replies":[{"poster":"Sirrkas","date":"2017-07-22T19:53:23.216+0000","up_votes":1,"down_votes":0,"body":"Dir ist bewusst, dass sich Taric uneingeschränkt bewegen kann, solange er den E vorbereitet? Einfach Sidesteppen geht da nicht, man muss vor ihm davonlaufen.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Fresh Dumbeldore","date":"2017-07-20T08:05:07.541+0000","up_votes":1,"down_votes":0,"body":"Ich bin kein Main Support, deshalb kenne ich mich nicht so gut aus. Aber deine Argumente und Überlegungen machen für mich Sinn und ich stimme dir zu. \n\nJa, Champion.gg ist auch nicht gerade sehr zuverlässig, das stimmt. Deshalb vergleiche ich es immer mit anderen Seiten wie Lolalytics, LeagueofGraphs, op.gg oder auf dem Handy die App Lolalytics. \n\nIch würde auf Sona beide bauen, kommt vor allem auf das Matchup an. Wenn ich gegen einen meele Support und short range adc spiele, dann würde ich spellthiefs nehmen, da ich hier sehr gut poken kann, auch mit AA. Wenn ich aber gegen eine Long range poke lane spiele(Extrembeispiel Caytlin Zyra), dann ist coin wiederum besser, da die Q ja höhere Range hat, als AA.","replies":[]}]}]}]}]},{"poster":"Oriius","date":"2017-07-19T15:34:11.885+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist einfach das du dich gerade bei Champs wie Zyra in der Zwickmühle befindest.\n\nEinerseits haste n bisschen Aoe Heal mit zyra und kannst deinem team in nem teamfight durchaus behilflich sein . Zudem gut kombiniert mit zyra ult hast du nen guten heal für deine mates und ein wenig true damage auf die feinde während deine pflanzen weiter drauf einprügeln.\n\nJedoch da du als zyra mehr ein aggresiver supporter sein solltest und im notfalls der aushilfs apc sein kannst würde dein potenzial bezüglich ausgeteilten schaden stark abnehmen was deinen gegnern zugute kommen kann. Würde daher sagen hängt das eher von der teamcomp ab. Das problem ist du bist silber und da versuchen vorallem viele spieler den supporter fürs lose verantwortlich zu machen wie ich finde und dabei kriege ich immer n lob von den gegnern fürs gute supporten während mein team mich des todes flamt.\n\nRedemption ist also mehr situational und sollte nur gegen bestimmte comps gebaut werden. wenn du zb n besonders squishy feindesteam hast wäre redemption ziemlich useless da squishy champs oft gute escapes besitzen oder dich in der Zeit wo du redemption castest bereits dich gekillt haben.\nWenn du gegen Offtanks etc spielst lohnt sich das schon eher wobei du aus dem Item mehr rausholen kannst wenn du noch {{item:3174}} \ndazu baust. das sollte die verlorene AP wieder ausgleichen. zudem gibt dir redemption auch noch n bisschen leben und dein manapool geht eher langsam leer weshalb das alles in bestimmten situationen sinnvoll sein KANN!. \n\nhoffe konnte n bisschen helfen :)\n\nAch ja zudem kommt halt das man redemption während des todes casten kann #Geilsterbaronstealeuw","replies":[]},{"poster":"Tarum20","date":"2017-07-19T13:00:35.035+0000","up_votes":1,"down_votes":0,"body":"mal sollte dabei nicht vergessen das das item für heal+ effektiver skaliert (3x so stark) also lohnt es sich eher wenn du sowas kaufst wie adent cencer und windspeaker hast.","replies":[]},{"poster":"ninju7su","date":"2017-07-19T12:07:39.672+0000","up_votes":1,"down_votes":0,"body":"Auf der einen Seite ist Redemption wirklich stark. Die Aktive kann dem Item eine Goldeffizienz von über 550% geben. Um es anders zu formulieren: Triffst du das Ding optimal in einem Teamfight auf alle 5 Teammember ist das so, als hättet ihr etwa 14 Kills Vorsprung. Das ist enorm und ich kann das flehen nach dem Item komplett verstehen. \n\nDas heißt aber nicht, dass man es auf jedem Supporter kaufen muss. Ich spiele momentan viel Blitzcrank und Gragas und baue nie Redemption. Es passt einfach nicht in das Kit. Ich sehe das Item nicht als einen Pflichtkauf, da es gute Alternativen für nicht utility Supporter gibt. Locket, Ardent Censer und Knights Vow sind ebenfalls ziemlich stark geworden in den letzten Patches. Einige würden vielleicht auch Zeke mit dazu zählen. Redemption ist zwar stark, aber man kommt auch ohne gut zum Sieg.\n\nNun hast du das Problem, dass du Zyra gepickt hast. Das ist ein Champion, der durch einen starken Burst Carrien kann. Dazu brauchst du allerdings Kills und/oder Assists um den benötigten DMG zu bauen. Eine Zyra die zurückfällt ist quasie useless. Baust du nicht auf Schaden, bist du im Endeffekt nicht viel mehr als ne Dekorationspflanze, bis auf das wenig CC was du mitbringst. Zyra musst du meiner Meinung nach auf DMG bauen und hast daher eigentlich bis ins Late-Game keine Gelegenheit auf Redemption zu bauen, ohne damit massiv an Impact zu verlieren. Man kann es auf ihr bauen,.. aber ich denke frühestens als letztes Item.\n\nDu hast aber ein grundlegendes Problem aufgedeckt und das möchte ich noch sagen. Du hast einen AP-Supporter gepickt. Das ist nach Utility Supps und Tank Supps die aktuell schwächste der drei Klassen. Riot hat sich viel Mühe gegeben Utility-Items und Tank-Items stark und interessant zu machen. AP ist dabei auf der Strecke geblieben (vielleicht sogar bewusst). Was ich dir empfehlen kann, ist dich mehr auf andere Supporter zu konzentrieren, da dein Einfluss durch die Items einfach besser zur aktuellen Meta passt und man es einfacher hat, so ein Game zu Carrien. Es ist nicht unmöglich mit Zyra gut zu Supporten, aber erheblich schwerer.","replies":[]},{"poster":"Voltii","date":"2017-07-19T10:34:45.903+0000","up_votes":1,"down_votes":0,"body":"Redemtion ist nach meiner Auffassung ein Pflichtitem, welches mindestens einmal im Team vorhanden sein sollte.\n\nGerade in teamfights kann eine gute Aktivierung den gesamten Kampf drehen.\n\nAuf Zyra und Brand ist es natürlich nicht ganz so stark wie auf einer Janna, Lulu oder ähnlichem. \n\nAn deiner Stelle würde ich es aber trotzdem bauen. Vlt nicht als erstes Item, aber als zweites oder drittes. \n\nDu kannst natürlich auch fragen ob es nicht jemand anderes (jungler?) bauen kann.","replies":[]}]}