{"poster":"Bob der Zerstoerer","date":"2016-10-14T07:19:06.065+0000","title":"S7 Pflanzen u Jungle","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Hallo Leute\r\n\r\nIhr habt bestimmt schon die &quot;tollen&quot; &Auml;nderungen mit bekommen die Riot machen m&ouml;chte f&uuml;r S7 was der Jungle betrifft. \r\nIch finde es als Jungler pers&ouml;nlich schrecklich das die Smithe Buffs weg genommen werden da sie angeblich nicht genutzt werden ... \r\n\r\nGerade wenn man Jungler spielt die es am Anfang schwer haben wie zb Amu \r\n\r\nDaf&uuml;r wollen sie jetzt solche random Pflanzen rein bauen weil sie denken das es zu wenig random dinge gibt im spiel. \r\nIch meine Crit und Drakes sind noch nicht genug. \r\nMan muss jetzt den Jungle kaputt machen und daf&uuml;r random Pflanzen rein packen die echt mist sind. \r\nStellt euch mal vor ihr rennt hinter nem Gegner her er hat noch 100 HP und dann blowt er euch einfach mit so ner d&auml;mlichen Pflanze weg. \r\n\r\nDie anderen sind dann schon wieder so unn&uuml;tzlich das man sich denkt &quot;joa kann man mitnehmen aber eigentlich nicht wichtig&quot; \r\n\r\nSie meinten zwar wenn es den Leuten nicht gef&auml;llt werden sie es nicht einf&uuml;hren...\r\nUnd bis jetzt habe ich noch keine Diskussion gefunden wo gesagt wird &quot;oh schaut euch den neuen tollen jungl an&quot; \r\nAber ich bezweifel das sie sich daran halten und es einfach durchziehen werden und irgendwann ist das spiel mehr von random Dingen abh&auml;ngig als vom k&ouml;nnen. \r\n\r\nIch &uuml;bertrieb vllt gerade ein wenig aber ich hab selten so eine schlechte &Auml;nderung gelesen mit so einer Begr&uuml;ndung ... &quot;mehr random Dinge&quot;\r\nFalls sich jemand daran erinnert, sie haben damals Ausweichen raus genommen weil es ihnen zu random war. ;) \r\n\r\nNaja was ist eure Meinung dazu? \r\nDie NA Community hat sich auf jedenfall wie ich finde dagegen ausgesprochen. \r\n\r\n\r\nGr&uuml;&szlig;e\r\nBob","replies":[{"poster":"Kata Ga Kill","date":"2016-10-14T08:50:38.895+0000","up_votes":2,"down_votes":1,"body":"Luck ist Gift für den Skill und im Competitiven!\nElementardrachen waren noch ok, aber jetzt übertreibt es Riot mit dem \"einzigartig\".\nPflanzen hören sich nach nem Funmode an....","replies":[]},{"poster":"DanionVibit","date":"2016-10-14T08:15:26.862+0000","up_votes":1,"down_votes":0,"body":"Noch ist es zu Früh um zu urteilen... ich habe dies bezüglich noch einige ungeklärte Fragen.\n\n1. Sind die Pflanzen komplett Random ?\noder haben sie feste Spawnpunkte ?\noder spawnen feste Pflanzen in feste Bereiche ?\n\n2. Wie sind die Werte generell ?\nWie hoch ist der Heal ?\nWie lange hält die Vision ?\n\nSolange diese Details nicht  geklärt oder uneinsichtig sind erlaube ich mir kein Urteil!\n\nAber es gibt ja ein ähnliches System in Dota - Die Runenplätze. Temporäre Buffs die an 2 Stellen auf der Map zu festen Zeiten spawnen und einen random Effekt geben. Sind die Pflanzen ähnlich (Also fester Platz, feste Spawnzeiten), dann würde ich das System gut finden. Alles andere - muss erst herausgefunden werden.","replies":[{"poster":"Bob der Zerstoerer","date":"2016-10-14T08:58:19.574+0000","up_votes":1,"down_votes":0,"body":"- Die Pflanzen spawnen komplett random außer die blaue (die antiwardpflanze) die hat feste spawn punkte. \n- Smithe healt dich jetzt bei jedem Camp und 100hp + 10% deines Lebens\n- Die Heal Pflanze slowt dich und heult dich um rund 30% deines Lebens","replies":[{"poster":"CYPHΕR","date":"2016-10-14T09:08:19.496+0000","up_votes":1,"down_votes":0,"body":"> Die Pflanzen spawnen komplett random außer die blaue (die antiwardpflanze) die hat feste spawn punkte.\n\nNicht ganz:\n\n> Im frühen Spiel sind die Orte sehr eingeschränkt, an denen sie wachsen, damit sie auf frühe Hinterhalte oder Überfälle im gegnerischen Dschungel nicht zu viel Einfluss nehmen. Wir stellen außerdem sicher, dass Pflanzen der Fairness halber strikten Regeln unterliegen. Beide Teams haben die gleichen Zugangsmöglichkeiten zu jeder Pflanze, die im Spiel auftaucht. Pflanzen kündigen sich auch an, damit die Spieler genug Zeit haben, sich auf sie einzustellen. So sind sie die ersten 30 Sekunden nur als Setzling sichtbar.\n\nQuelle: [Riot Fearless bzw. Aryia](http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/vAyvuH9y-reden-wir-aber-pflanzen)","replies":[]}]}]},{"poster":"Freiherr Alex","date":"2016-10-14T07:34:40.834+0000","up_votes":1,"down_votes":0,"body":"Meine meinug ist dass man sich das erstmal ansehen muss wie es im Endeffekt wird. hab aber auch grade in dem punkt mit junglern die es early schwer haben meine bedenken.","replies":[{"poster":"Bob der Zerstoerer","date":"2016-10-14T07:53:18.339+0000","up_votes":1,"down_votes":1,"body":"Ich denke das größte Problem liegt in der explodierenden Pflanze. \nStell dir mal das Szenario vor. ein all in Teamfight man ist gerade dabei den Teamfight und damit vllt das Game zu gewinnen und dann spawnt da so ne explodierende Pflanze und schleudert einfach alle weg.\n\nMan ist all in gegangen und eine so ne dämliche Pflanze macht einem dann alles zu nichte ich weiß ja nicht. :D","replies":[{"poster":"Freiherr Alex","date":"2016-10-14T08:13:31.295+0000","up_votes":1,"down_votes":0,"body":"Das ist ein großer Nactteil, hast du vollkommen recht. Auf der anderen Seite stell dir das Szenario vor du siehst wie botlane low life in den Jung Flüchtet. Mit den Pflanzen kannst du dann natürlich auch viel schneller runter kommen und den Weg abschneiden....Funktioniert natürlich auch alles in beide Richtungen.\n\nWerde auf jeden fall die (ja doch sehr lange) Wardaufdeckung der Raptoren vermissen. Da kommt die Pflanze sicher nicht mit was die Zeit angeht.","replies":[]}]}]}]}