{"poster":"ret1x","date":"2016-10-24T15:36:52.911+0000","title":"Lustiges Team sucht ambitionierte Spieler (Gold-Dia)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hey liebe Community, \r\n\r\nich bin Max, bin 19 Jahre alt und wohne in Berlin. Gestern haben ein Kumpel und ich aus Spa&szlig; mal wieder ein Rankedteam gegr&uuml;ndet und haben uns gedacht, dass wir doch mal wieder anfangen wollen ein wenig ambitionierter zu spielen. \r\n\r\nZu mir: Support Main &amp; momentan Gold IV (stetig steigend)\r\n\r\nZu meinem Kollegen Marvin (18): Midlane Main und momentan Dia V (welchselt stetig zwischen Dia 3 &amp; 5) \r\n\r\nGgf. haben wir auch schon einen Spieler im Jungle, k&ouml;nnt euch aber auch gerne als Jungle Main melden. Derjenige wei&szlig; n&auml;mlich noch nicht genau, ob er die Zeit hat.  \r\n\r\nWir SUCHEN: \r\n\r\nADC: Falls du ADC Main bist und Lust hast bei uns im Team einzusteigen, sag Bescheid. Du solltest Bock haben dich stetig zu verbessern und es w&auml;re cool wenn dein recht aggressiver Spielstil auch mal zu einem Triple-Kill bei einem gegnerischen Botlane Gank f&uuml;hrt. Nat&uuml;rlich solltest du auch in der Lage sein, eine ruhige/sichere Lane zu spielen. \r\n\r\nTOPLANE: In der Toplane suchen wir einen Spieler, dem der Umgang mit seinem TP in die Wiege gelegt wurde. Du solltest auch Freude daran haben mal den ein oder anderen Tank zu spielen, wenn der Gnar gerade mal besser in die Teamcomb passt, als die Riven. \r\n\r\nGold setzen wir als Elo vorraus, nach oben hin sind allerdings keine Grenzen gesetzt. Es w&auml;re sch&ouml;n, noch einen Spieler dabei zu haben, der den anderen wie mir, auch noch die ein oder anderen Dinge beibringen kann. Muss aber nicht ... :)\r\n\r\nDie Stimmung ingame mit uns wird immer mehr lustig als ernst sein, auch wenn der Tryhard bei diesem Team im Vordergrund steht. \r\n\r\nViel mehr labern will ich jetzt auch nicht. Meldet euch, wenn ihr Bock habt und dann kann man ja mal ne Runde zusammen spielen. \r\n\r\nBeste Gr&uuml;&szlig;e, \r\n\r\nMax aka ret1x\r\n{{summoner:4}} {{summoner:3}}","replies":[{"poster":"Shadowbalder","date":"2016-10-24T16:50:46.014+0000","up_votes":1,"down_votes":0,"body":"Hallo Jungs,\n\nich und mein Bruder er ist Top Main und ich ADC main suchen eine Lustige Truppe um gemeinsam Lol zuspielen. Wir spielen sehr oft und probieren jede freie minute online zusein. Wir sind beide in der Gold Elo.\n\nLG Shadowbalder","replies":[{"poster":"ret1x","date":"2016-10-25T08:27:42.667+0000","up_votes":1,"down_votes":0,"body":"Yo, meld dich doch mal ingame bei mir. ret1x\n\nDann können wir ja mal ne Runde zocken ...","replies":[]}]}]}