{"poster":"Bajan","date":"2017-06-21T14:41:48.889+0000","title":"Remake en Aram","subforum":"Problemas Técnicos","up_votes":5,"down_votes":4,"body":"Todos sabemos que ARAM no es serio y es para divertirse, pero a veces tengo ganas de jugar Aram y no Grieta, y que no haya remake es muy molesto.\r\nHay muchas veces que toca un AFK o dos, y no pod&eacute;s jugar.\r\nMe encantar&iacute;a que ni siquiera exista el Remake, que Riot se de cuenta y punto, te saque de la partida y no pierdas tu tiempo, con una votaci&oacute;n l&oacute;gicamente.\r\nPero bueno, dale que el Remake lo van a tener en cuenta para el Aram? \r\nGracias...","replies":[{"poster":"Hnk Kenshiro","date":"2017-06-21T14:49:15.772+0000","up_votes":4,"down_votes":0,"body":"> Todos sabemos que ARAM no es serio y es para divertirse\n\nDe veras ¿Que problema tiene la gente que no puede divertirse jugando en serio?","replies":[{"poster":"Bajan","date":"2017-06-22T13:06:01.504+0000","up_votes":1,"down_votes":0,"body":"Me estaba defendiendo sobre posibles ataques como: \"aram se juega a boludear\" y esas cosas. Pero yo lo juego tanto como la grieta porque me divierte mucho y la desventaja numérica en un juego así hace la partida casi obsoleta. Además, no les cuesta nada, es un cambio pequeñísimo.","replies":[]}]},{"poster":"Deep Wep","date":"2017-06-23T03:20:58.404+0000","up_votes":1,"down_votes":0,"body":"derecho nada, que asi uno no puede ni irse al baño, ponele que de la nada voy a hacer caca y estoy ratito afk, que pasa dan remake y es molesto (segun yo) y tambien agrego el hecho de que estan esos arenosos que dan remake al 1er segundo de ver alguien afk .... y los otros como bobos le dan que si. Odio el remake porque se rinden asi sin mas y es feo feo, que ganas hay de jugar con gente que se rinde al 1minuto, la verdad un asco.\nPreferiria que el remake este solo en las clasificatorias","replies":[{"poster":"Bajan","date":"2017-06-26T13:40:55.719+0000","up_votes":1,"down_votes":0,"body":"¿Qué problema no? Si vos te vas al baño en el medio de una partida y estás 'un ratito afk' y pensás que eso no es un problema, no tengo nada que decir al respecto. Saludos.","replies":[{"poster":"Deep Wep","date":"2017-07-10T17:40:54.336+0000","up_votes":1,"down_votes":0,"body":"Decir que....  acaso se puede tirar remake en medio de una partida (ej: pasando los 10min)? siquiera sabes lo que escribis no?? lo digo en los casos en los que se inicia la partida luego de la pantalla carga quede improvisto pasa y obviamente no t vas a quedar una hora cagando. Y lo digo de nuevo, es por esos idiotas que se rinden de una, es la actitud mas fea y seguro sos uno de esos boluditos que ni bien ven el \"remake\" tiran surrender, capo si no sabes jugar desisntala. Si el desconectado vuelve es GG a menos que se les ocurra fedear, etc. Ademas quien es tan estupido como para irse al baño en el late, como mucho orinar y nada mas, dejat de joder.","replies":[]}]}]},{"poster":"rokushoger","date":"2017-06-21T17:12:15.165+0000","up_votes":1,"down_votes":0,"body":"+1, vengo rompiendoles las tarlipes hace rato a los Rioters por esto. Por muy poco serio que sea (y eso es relativo, no me divierte jugar para boludear, juego a ganar y me divierto con eso) tenemos todo el derecho a no jugar en desventaja.","replies":[]}]}