{"poster":"CHHO3","date":"2016-01-23T01:33:27.281+0000","title":"A case for Karthus, our Deathsinger","subforum":"Gameplay","embed":{"description":"Greetings, Summoners. Welcome to patch 5.24, the last one of 2015. It's been a wild ride with Cinderhulks, Juggernauts and Devourers in-between, but this is no time to get sentimental. It's still preseason, there are still outliers to balance, systems to maintain and bad jokes to make.","url":"http://na.leagueoflegends.com/en/news/game-updates/patch/patch-524-notes#patch-karthus","image":"http://na.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/patch_notes_banner_31.jpg?itok=YC9CPXAf"},"up_votes":76,"down_votes":3,"body":"TL;DR:  \n\n* Mathematically, the wall of pain nerfs are huge.\n* Sleepers seem OP mostly cause we are better trained to face the common bunch.\n* And Karthus' weakness is not simply due to his immobility/squishiness.\n___\n\nAs an avid Karthus player I&#039;d really appreciate if people from the balancing team could shed light on their process and recent decisions.\n\n (I can&#039;t help but imagine Scarizard (sorry &gt;.&gt;) and others playing a game where Karthus went on a rampage and hyper-carried the game before the nerfs)\n\nAlright, I&#039;m about to put forward not the numbers, but the feeling of what has changed since the nerfs.\nWall of pain was a unique spell in the game.   It creates a passable wall that shreds the enemies&#039; MR and movespeed for five seconds.  The enemies recovered their lost MS over the duration, and it felt like a _linear ramp down slow_ before the nerfs.\n\nThe ability meant a lot to the team making Karth seem appealing to be picked.\nKarthus&#039; iconic wall of pain is still the backbone/glue holding his character together, it offers amazing utility for a team such as:\n\n* zone control\n* face checking/vision\n* catching enemies\n* Immensely effective in thwarting tower dives or advancing enemies\n\nThe wall used to allow a good Karthus to hold off multiple enemies trying to take his turret for multiple waves,  solo.\nIt made him stand up to other mages despite a relatively slow wave-clear (think {{champion:103}}, {{champion:112}}, {{champion:101}}).\n\n___\n\n\nThe inertia behind the nerf was to slightly reduce the effectiveness of his catching potential, but it indirectly also reduced his effectiveness to defend his lane turrets, putting a dent in his notoriously safe laning phase.  Karthus&#039; safe laning phase is what pro&#039;s like Faker and Froggen associate with him about when they debated that a skilled {{champion:30}} should beat a skilled {{champion:7}}.\n\nKarthus&#039; **weak early game is very unique**, in that he _decides_ not to be a threat to his enemies early on because of his chosen build path and farm reliance. That is how he was weak.  Alternatively you could chose {{item:3174}}  first item followed by a {{item:3116}}  and be a lane bully, trading late game power due to a small mana pool and lower AP.   However, now his safe laning identity feels like an illusion since he is much easier to dive without reliable defensive cc.\n\nKarthus&#039; uniqueness here was that weakness is not = simply squishy/immobile.\n\n\nNow for the numbers.\n\nHere&#039;s the slow amount comparison, at the **end **of each second from cast:\n\n**Old W, rank II:  40%  -  30%  -  20%  -  10%  -  0%**\n\n**New W, rank V: 40%  -  30%  -  20%  -  10%  -  0%**\n\n**Old W, rank V: 64%  -  48%  -  32%  -  16%  -  0%**\n\nAs is evident from the &quot;ramp&quot; of the slow, the nerf is so massive it feels like playing Karthus with only 2 points in your wall {{sticker:zombie-brand-facepalm}} .   Seems very undeserved.\n\nIf you have the time, here&#039;s a philosophical bit on his strength:\n\nThe patch notes  said &quot;Wall of Pain&rsquo;s slow now decays&quot;, which could have been a miscommunication/lack of knowledge.  It is a lesser known fact that the slow used to decay even before the nerfs.\n\nThis lack of knowledge has strangely been one of Karthus&#039; strengths.  Sleeper champions tend to bring a bit of surprise to the game due to unfamiliarity. The amount of damage on Lay waste is beautifully rewarding if you critically strike.\n\n* On a slightly related note, I love the fact that you, the player, make your Q critically strike through calculated aim, not random chance.  It requires a veteran to aim those intricately on a squishy in a team-fight sandwiched between peelers/minions.\n\nThis, his passive and his ultimate are the surprises that often catch people off-guard.\n\n[Here&#039;s a perfect example from EU LCS that caught Rekkles and the casters off-guard.](https://www.youtube.com/watch?v=rN0mTKNmfCo&amp;t=0m56s)  Rekkles held on to his {{summoner:21}} perhaps thinking he would survive.\n\nWhen we play against a champion often, we learn what their potential &quot;catch-range&quot; is. For example while kiting away from a fed {{champion:157}}  down your lane you&#039;d know to not run straight through your minions for he can sweep thru the minions to you, on the other hand while kiting a {{champion:53}}  you&#039;d rather run through your minions.\n\nSimilarly if {{champion:30}} had a high enough pick rate people would learn to anticipate his high damage and respectably long range Q, W, and R.  This would, I believe, decrease Karthus&#039; win rate and his effectiveness by a little, taking away his surprise factor.\n\n___\n\n\nIn no way am I suggesting that Rito hates Karthus.  They put so much love into his VU that it set standards for the ones to follow!  He was a balanced champion whose kit aged like a fine wine into the new meta.\n\nPerhaps Karthus&#039; foremost identity is [\"highest DPS in the league\"](http://champion.gg/statistics/#?sortBy=general.totalDamageDealtToChampions&order=descend), but he has more depth to his play than _just_ that, a lot more.\n\nThank you for taking the time to read this, been lurking on reddit and the boards for years, and as I see patch notes and PBE cycles go by with Karthus staying silent,  I had to speak up.\n\n\nEDIT: cleaning up some typos/formatting. Thx again!","replies":[{"poster":"V The Support V","date":"2016-01-23T03:48:01.597+0000","up_votes":12,"down_votes":0,"body":"Like this post!\n\nPerhaps (hopefully), he will receive a light pass when Riot implements the immobile mage update this year. In some of his numbers or through the introduction of new/revamped items.\n\nUntil then... Kamakazi or Commander Karthus.","replies":[{"poster":"Bedl44m","date":"2016-01-23T07:14:15.218+0000","up_votes":3,"down_votes":0,"body":"im really hoping he is included here...","replies":[]},{"poster":"CHHO3","date":"2016-01-23T23:17:36.709+0000","up_votes":2,"down_votes":0,"body":"Right.  It was said before that he won't be receiving any major changes.  I'm hoping we at least get the wall nerf reverted, or at least make the wall such that it still slows enemies advancing towards Karthus by the old full values.","replies":[]},{"poster":"macromite","date":"2016-01-23T05:42:01.177+0000","up_votes":4,"down_votes":2,"body":"get rid of the or and you understnd how i play karthus. flash initate into pentakill.","replies":[{"poster":"CHHO3","date":"2016-01-23T23:19:22.931+0000","up_votes":1,"down_votes":0,"body":"lol or lucky afk Pentas {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]},{"poster":"KING OF MASKS","date":"2016-01-23T20:39:07.069+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=CHHO3,realm=NA,application-id=3ErqAdtq,discussion-id=jgmhTBd8,comment-id=,timestamp=2016-01-23T01:33:27.281+0000)\n>\n>He was a balanced champion whose kit aged like a fine wine into the new meta.\n\nAstonishingly well said. I played Karthus occasionally back around the time of Season 2, but let him fall out of my champion pool for a while until recently getting him up to level 5 mastery. It's phenomenal how well he's held up, and how much new unlife they breathed into him with the VU and updated lore. Such a venerable champion really doesn't deserve this sort of indelicate treatment.\n\nIf rito doesn't address this I'm gonna call the League Department of Veterans Affairs and file a complaint.","replies":[]},{"poster":"Rundus1","date":"2016-01-23T23:43:28.371+0000","up_votes":3,"down_votes":0,"body":"My friend, who is a mage main and loves Karthus, got super ticked after that nerf and has stopped playing him so he can play his \"big 6\" mages before their reworks.  Every time I ask about Karthus, he just keeps telling me he's going to wait for a buff or item that can help out a little (he was never the best Karthus positionally, so he really needed that wall to get him to his rylais 2nd item).","replies":[]},{"poster":"Sunya UwU","date":"2016-01-23T07:55:41.286+0000","up_votes":4,"down_votes":1,"body":"Good Post,\n\nI always felt like immobile mages usually have a type of cc/offensive/defensive ability they fall back on in dire times,\nXerath has a stun, Lux with a snare for 2 targets, Morgana with a snare\n\nIt just feels like Karthus doesn't have a offensive/defensive cc ability ever since they nerfed his wall\n\n**Wall nerf doesn't make sense since the  boots of swiftness meta right now**\n\nPatch v5.22\n\nBoots of swiftness Total Cost reduced from 1000--->800 gold \nMS increased from 60--->65\n\nAt the time not many people started building the item\n\nPatch v5.24\n\nKarthus Wall Nerf where the slow reduces after 1 second\n\n**The karthus wall nerf wasn't neccessary when so many people are picking up boots of swiftness at the time it reduces effectiveness of slows by 25%**\n\nThe wall feels like a useless ability with boots of swiftness being the dominant choice of boots right now\n\n\nEdit:Messy Post by me forgive me if its confusing >< its the middle of the night mercy","replies":[{"poster":"Paroe","date":"2016-01-23T08:01:12.516+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=A Lonely Nidalee,realm=NA,application-id=3ErqAdtq,discussion-id=jgmhTBd8,comment-id=0001,timestamp=2016-01-23T07:55:41.286+0000)\n> The wall feels like a useless ability with boots of swiftness being the dominant choice of boots right now\n> \n> \n\nRiot likes to do compound nerfs. they knew full well that nerfing merc treads into uselessness people would choose to go swifties over mobi boots.","replies":[]},{"poster":"CHHO3","date":"2016-01-23T23:22:10.476+0000","up_votes":1,"down_votes":0,"body":"Yes, I could live without the catch potential as long as the defensive aspect of the wall could be preserved..\n\nAnd thank you so much for reading thoroughly!","replies":[{"poster":"Xelvi","date":"2016-01-23T23:51:01.977+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CHHO3,realm=NA,application-id=3ErqAdtq,discussion-id=jgmhTBd8,comment-id=00010001,timestamp=2016-01-23T23:22:10.476+0000)\n>\n> Yes, I could live without the catch potential as long as the defensive aspect of the wall could be preserved..\n> \n> And thank you so much for reading thoroughly!\n\nHe was nerfed because of Deathfire Touch because apparently he was doing too much damage, but in Riot's world doing too much damage doesn't mean nerf the damage output, it means nerf vital utility instead!!111!!\n\nIt's seriously stupid, and he joins the list of champs who have been nerfed because of a certain keystone/mastery/item aka Sejuani who aren't rebuffed after the problematic thing gets nerfed.\n\nThey are, instead, left to wallow in mediocrity.","replies":[]}]}]},{"poster":"MEMEME670","date":"2016-01-24T19:52:42.352+0000","up_votes":1,"down_votes":1,"body":"Two things.\n\n1. If you have a weak early game, but you're safe and can easily farm and defend your tower, I don't think you really have a weak early game. You just aren't strong. Vayne has a weak early game. She gets easily shoved out by any lane bully and has a stupidly hard time farming when she does.\n\n2. Karthus seems to be, to me, probably somewhat unhealthy. He's just super annoying to play against. Not only does he force you into this minigame of 'dodge lay waste every 1 second or take 400 damage', and he doesn't necessarily need to work very hard to get ahead of you in lane, his allies just need to set up his ult. Because of this, I think a nerf that makes him unable to (as you say) 'defend his tower against multiple opponents alone' is completely fair.","replies":[]},{"poster":"LadyRenly","date":"2016-01-23T23:45:34.237+0000","up_votes":2,"down_votes":3,"body":"he seems ok in the jungle","replies":[]},{"poster":"RyzeRework","date":"2016-01-23T13:16:51.238+0000","up_votes":1,"down_votes":6,"body":"The reason the mages got nerfed is because they remained super safe for their lack of mobility karthus wall swain w aniva slow was even nerfed the fact these mages even tho immobile were hard to gank is why these nerfs happened","replies":[]}]}