{"poster":"FeniX x Mei","date":"2015-04-19T21:52:39.745+0000","title":"Gratis Coaching angebot von Neros4n","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Hallo liebe LoL community :3,\nder eine oder andere kennt mich schon aus meinen Stream (www.twitch.tv/zedyr) oder auch aus meinen Riven guide link dazu in der twitch Beschreibung :).\nNun da ich 2 Wochen nicht streamen kann, dachte ich mir komme ich meinen zuschauern in der Zeit ein wenig entgegen und biete Game Coaching an.\nDiese games werden aufgenommen und von mir hochgeladen nat&uuml;rlich + Ts aufnahme. \n\n\n\nWie ihr mit machen k&ouml;nnt?\nAdded mich Ingame unter Neros4n und habt folgende Dinge:\n-Headset\n-Zeit (60min mindestens) \n-Seid kritik f&auml;hig und motiviert.\nMfg Nero\n\nÄNDERUNG 20.04 \n\nDa mich über 25 Leute innerhalb 24 Stunden geadded haben ändern wir ein wenig die bedingungen.\n\n1. Beim Adden bitte unbedingt eure Online zeiten an mich weiter geben.\n2. Ihr müsst 1 Ranked spiel machen (am besten 1 auf eurer main lane) und dies entweder Hochladen oder z.b bei op.gg aufnehmen / replay datei senden damit ich zugriff darauf habe.\n3. Da dies 60-90 min in Anspruch nehmen kann und ich dafür keine gegenleistung will bitte ich euch darum es nur zu machen, wenn ihr wirklich das Ziel habt besser zu werden und ihr es zu 100% ernst nehmt.\nMfg Nero\n\n\nKrass es werden immer mehr x.x \nIch werde euch alle leider nicht durch kriegen, bzw nicht mit der aufwendigen methode da ich selber auch anderes zutun habe und keine 24h coachen kann.\nFalls ihr euch \"WIRKLICH\" sicher seid, dass ihr es satt habt, in eurer Elo zu stecken und ihr 100tige Erfolge sehen wollt mit mehr \"Unterricht\" und Hilfe als nur nebenbei kostenlos.\nKönnt ihr in dem Thread vorbei schauen: http://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/EBNl0xcY-master-coach-nun-auch-auf-school-seiten.\nGebt mir Ingame bescheid sobald ihr ein Gameplay habt, auf welches ich zugreifen kann.","replies":[{"poster":"Alustus","date":"2015-04-20T08:08:29.170+0000","up_votes":1,"down_votes":0,"body":"Ich denke mal das es so ist wie bei Letsreadsmallbooks, Besserwerdenimrank, Maxim.\nFinde ich super auch wenn ich denke, dass es mir persönlich nicht allzusehr helfen würde.\n\nDa mein mMn bei mir das verstehen nicht das problem ist sondern die Umsetzung.\nIch weiß das meine mechaniks ziemlich schlecht sind\nmeine last hits okay aber auch nicht das gelbe vom Ei\nWard placements sind gut, aber bekomme bei fights immer einen tunnelblick und sehe trotz wards den gegner nicht (aber nur im kampf).\n\nDas problem welche ich habe ist, dass ich nicht wirklich weiß wie ich in diesen punkten besser werde.\n\n\nnun meine Frage gibst du diesbezüglich auch Tipps oder sagst du nur was man besser machen kann oder wo die Fehler liegen?","replies":[{"poster":"FeniX x Mei","date":"2015-04-20T19:52:59.938+0000","up_votes":1,"down_votes":0,"body":"Schau mal auf Youtube nach dem User \"Lastshadow\" Ich wollte das eigentlich mehr oder weniger wie er machen nur im Deutschen bereich. \nUnd klar ich sage dir nicht nur wo die Fehler liegen damit kannst du ja im endeffekt nicht viel nach dem Gespräch anfangen.\nIch sage dir auch wie du die einzelnen Punkte verbessern kannst :)","replies":[{"poster":"Alustus","date":"2015-04-20T20:47:27.658+0000","up_votes":1,"down_votes":0,"body":"hm dan schau ich einmal vorbei.\n\nNaja so allgemeine Tipps helfen manchen leuten auch extrem weiter (denke ich zumindest) und da will man nicht unbedingt diesen die chance verkleinern wenn man selber weniger vom Training profitiert.","replies":[]}]}]},{"poster":"Leberwurstfrau","date":"2015-04-20T06:39:31.227+0000","up_votes":1,"down_votes":0,"body":"Ich hätte auch Intresse. Hast du denn gewisse Uhrzeiten für die Spiele oder kontaktierst du den ein oder anderen, einfach wenn er on ist?","replies":[{"poster":"FeniX x Mei","date":"2015-04-20T19:54:11.906+0000","up_votes":1,"down_votes":0,"body":"Da mich ungelogen 20 Leute geadded haben, muss ich schauen wie ich die Leute so unterbringe am besten solltet ihr mich ingame anschreiben und mir sagen wann ihr Zeit habt.","replies":[]}]},{"poster":"SnidelWoodzzz","date":"2015-04-20T00:41:33.159+0000","up_votes":1,"down_votes":0,"body":"Hört sich richtig nett an. Gefällt mir schonmal :) geaddet ;)","replies":[]},{"poster":"LyteHatesSoloQ","date":"2015-04-20T00:08:08.308+0000","up_votes":1,"down_votes":0,"body":"hab dich geaddet. Bin einfach mal gespannt. ist ja umsonst. Mal schauen ob es ein bissl mit last shadow mithalten kann :P","replies":[]},{"poster":"ClAO KAKAO","date":"2015-04-19T22:21:11.905+0000","up_votes":1,"down_votes":1,"body":"oh ja gimme coaching pls","replies":[{"poster":"FeniX x Mei","date":"2015-04-19T23:38:35.767+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Malady,realm=EUW,application-id=YnZkMR0R,discussion-id=I9RgT2FR,comment-id=0000,timestamp=2015-04-19T22:21:11.905+0000)\n>\n> oh ja gimme coaching pls\n\nNah youre too low to coach back to bronze 10 with you kappa","replies":[]}]},{"poster":"ebda","date":"2015-04-19T22:25:47.547+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal hinzugefuegt ! :)","replies":[]}]}