{"poster":"Muted Summoner","date":"2016-05-13T18:05:02.115+0000","title":"Skarner won't lose spire passive but maybe some spires.","subforum":"Gameplay","up_votes":4,"down_votes":3,"body":"http://puu.sh/oQAKw/a3fa625d91.png\r\n\r\nthe spires in the game are just awful and need to be removed completely. They are just too lame.\r\nSkarner always had a niche and small audience and the update only made his pick rate even lower after he was successfully nerfed. His gimmick spires only alienated Skarner players such as my self. I hate having functions on my champions kit I feel like I have no control of or requires other players to help. This game is mostly a solo q experience and Skarner relies on to much team cooperation to even work. He requires snowballing to win but is easily snowballed with his spires not under his control.","replies":[{"poster":"Droogzy","date":"2016-05-13T18:35:03.143+0000","up_votes":5,"down_votes":0,"body":"I think the main problem I have with the spires is that he just feels terrible to play now.\n\nWhen you're in spires sure, you feel like this unstoppable objective controlling scorpion who can decimate anything and everything, I've had games where I get double kills solo when I'm fighting within the spire radius, it feels awesome.\n\nBut the moment you step out from the spires, he feels slow, and he just feels noticeably bad/worst. The power discrepancy is simply too massive between spire and non-spire Skarner and its pretty easy for opposing teams to play around his window of power with the spires.\n\nHe's one of the few junglers I have at rank 5 and unfortunately, I play him very little since the rework since he just feels terrible. ","replies":[]},{"poster":"KillerKell","date":"2016-05-13T18:21:43.265+0000","up_votes":1,"down_votes":0,"body":"I like the Spires.\n\nIt's a Team Game, where Vision and Zone Control are major keys to Victory... and the Spires push both of these to the forefront.\n\nIt allows for greater Counter-Jungle, it allows for more Counter-Jungle Denial, it gives a benefit to Skarner's Team on Neutral Objective Control.\n\nThose are all good things for Skarner's Team.\n\nThis huge advantage can absolutely be wasted... like any advantage.  A failure of Team Work will result in this.  It's a Team Game, a Failure of Team Work SHOULD be punished.","replies":[{"poster":"KillerKell","date":"2016-05-13T18:32:12.414+0000","up_votes":1,"down_votes":0,"body":"THAT being said, I think there SHOULD be a revision.\n\nBecause they have tied so much of Skarner's PERSONAL Strength into these Spires... he's half the Scorpion he used to be when not on an Active Spire... each Spire should give a Global Passive to HIS TEAM ONLY.\n\nThe point of the Enemy would be to DENY these Passives.\n\nSo let's say that the Blue Buff Spires give every Team Member 1% Mana Regen every 5 Seconds.  So you get both... 2%.\n\nLet's make Red Buff Spires give 1% Health Regen every 5 Seconds.  So you get both... 2%.\n\nDragon Spire gives 5% Armor/MR.  It's Nuetral, highly contested.\nBaron Pit Spire gives 5% AD/AP.  Again, Nuetral, highly contested.  \n\nNone of this is over-whelming, all of it is contestable, and the biggest Buffs are easy to steal away again.\n\nAlso, since it's all Percentage Base, it by definition gets strong over time.  Where 5% Armor/MR early isn't much to anyone that didn't bring Tank Runes (and still then only granting 5 Points to the Tank after 1st Armor Item), on a Late Game Champion these can have a more noticeable impact.","replies":[{"poster":"Lazypeon100","date":"2016-05-13T18:35:34.788+0000","up_votes":1,"down_votes":0,"body":"I disagree about making it a teamwide passive. That would mae the spires frel better for skarner and his team, but would feel awful for snyone having to play against it. It wouldn't solve the current problem of feeling forced to contest every spire, which makes it feel like a mini game.","replies":[{"poster":"KillerKell","date":"2016-05-13T18:46:33.794+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lazypeon100,realm=NA,application-id=3ErqAdtq,discussion-id=E3QEAUcm,comment-id=000200000000,timestamp=2016-05-13T18:35:34.788+0000)\n>\n> I disagree about making it a teamwide passive. That would mae the spires frel better for skarner and his team, but would feel awful for snyone having to play against it. It wouldn&#x27;t solve the current problem of feeling forced to contest every spire, which makes it feel like a mini game.\n\nYou contest Dragon so your opponent doesn't get an Advantage.  You contest Baron so your opponent doesn't get an Advantage.\n\nAll these Spires are at natural locations to contest.  You SHOULD be protecting your Red and Blue.  You SHOULD be pressuring the Enemies Red and Blue.  Obviously Dragon and Baron should be focal points for your team.\n\nAll this does is enhance what Teams should ALREADY be doing.\n\nNow, am I going to get stupid and go ham over 1% HP Regen every 5s?  No.  I'm just going to ensure they don't take MY Blue Spire to make it 2%.  Unless I'm DESIGNED to Counter Jungle... then I'm going to go for it.\n\nRight now, Spires mean nothing unless there is a Fight happening on them.  So I can effectively ignore them the entire game, up to and until I want to take an Objective with a Spire on it.  And then the Spire only matters if the Skarner Team comes to fight on it.  Which means, I don't have to improve my Map Awareness or my Objective Control AT ALL with Current Skarner.  I can just keep playing as always.\n\nWith my proposal, it mandates Map Awareness, Objective Control and Communication... which are good things we SHOULD be doing anyways.\n\nSkarner, at this point, is basically a Utility Jungle... since they scaled him back so his Spires didn't make him overly-OP when he's on them (like it was on Release).  If he's going to be a Utility Jungle, let's amp that Utility.","replies":[{"poster":"Lazypeon100","date":"2016-05-13T18:55:02.028+0000","up_votes":1,"down_votes":0,"body":"I'm not saying you shouldn't contest the objectives. What I'm saying is with your idea, it doesn't solve the current problem at all since that hugh emphasis on the spires will still be there. I shouldn't feel obligated to steal your jungle spires to make sure your team just isn't stronger than mine from level 1.\n\nWhat does skarner team do during lane phase the justifies having those benefits? From the start of the game, skarner's team will be stronger for free while putting pressure on the enemy jungle to go into risky positions to get rid of that free strength temporarily. \n\nHonestly, I think that is worse than the current spires which only help make skarner stronger. I should feel compelled to contest dragon, or trade it off in favor of RH. I shouldn't also be worrird by a potential 6 more objectives that only put the enemy team to an even playing field.\n\nHow would you balance this? Is skarner going to be much weaker currently without spires? Would that feel good for Skarner players, many of whom already dislike the current spires? This would also break a lot of other champs by removing early game weakness without any actual skill involved, which feels horrible for a PvP experience.\n\nI do like trying to come up with ideas to solve the problem, but I don't think this is the right one.","replies":[{"poster":"KillerKell","date":"2016-05-13T19:36:19.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lazypeon100,realm=NA,application-id=3ErqAdtq,discussion-id=E3QEAUcm,comment-id=00020000000000000000,timestamp=2016-05-13T18:55:02.028+0000)\n>\n> I&#x27;m not saying you shouldn&#x27;t contest the objectives. What I&#x27;m saying is with your idea, it doesn&#x27;t solve the current problem at all since that hugh emphasis on the spires will still be there. I shouldn&#x27;t feel obligated to steal your jungle spires to make sure your team just isn&#x27;t stronger than mine from level 1.\n> \n> What does skarner team do during lane phase the justifies having those benefits? From the start of the game, skarner&#x27;s team will be stronger for free while putting pressure on the enemy jungle to go into risky positions to get rid of that free strength temporarily. \n> \n> Honestly, I think that is worse than the current spires which only help make skarner stronger. I should feel compelled to contest dragon, or trade it off in favor of RH. I shouldn&#x27;t also be worrird by a potential 6 more objectives that only put the enemy team to an even playing field.\n> \n> How would you balance this? Is skarner going to be much weaker currently without spires? Would that feel good for Skarner players, many of whom already dislike the current spires? This would also break a lot of other champs by removing early game weakness without any actual skill involved, which feels horrible for a PvP experience.\n> \n> I do like trying to come up with ideas to solve the problem, but I don&#x27;t think this is the right one.\n\nExcept it's not for Free.  Skarner is well Under-Powered when not ON his Spires.  That's a Cost.  The Price the Team pays for a small 1% MP/HP every 5 Seconds... which is a very small amount at Level 1 to begin with.  Even a 700 HP Champion is only getting 7 HP every 5 Seconds with this.  While helpful, it's not very much at all.\n\nWhat I like about the Spires is it puts a greater emphasis on areas of the Map that SHOULD be contested already, that SHOULD be an emphasis.  Especially at Low Elo.  \"Hey, why is there here?  Hmm, this location must be Important.\"  And that SHOULD carry over to other games that don't include Skarner, an Improved Map Awareness and Objective Awareness.\n\nIt also makes him more impactful in Team Comps that are Global (though that's more Higher Elo/Organized), as those Spires add Extra Vision when Controlled.  This does more for Champions like Twisted Fate, but is also helpful for all Champions if they use the extra information the Vision grants.  It makes the possibility of more Ashe or Jinx Ults (Sniping a Jungle at his Buff because they saw the Spire go dark on the Map) and other such things.  It leads to greater Counter Jungle \"Hey, Spire went dark, he's at his Red, GO! GO!\" and Counter-Jungle Denial \"Our Blue went dark, Collapse!\".\n\nNow I might be to simple with this... but it seems like it promotes greater team play and cooperation... and that is what I WANT in a Team Game.  My suggestion is to merely give Skarner more Utility (since that seems to be his Niche now) to off-set his loss of Power when not actively on a Spire.","replies":[{"poster":"Lazypeon100","date":"2016-05-13T20:30:21.564+0000","up_votes":1,"down_votes":0,"body":"I think you're really underselling just how big of an advantage that the spires would give early. And I don't see the idea of skarner being significantly weaker off of spires to be a good thing. That is the #1 complaint people have about him right now.\n\nI don't like the idea of simply being \"outstatted\" from level 1 onwards. The only true way to avoid that is of your team snowballs and you stop skarner from getting any of his own spires. That would feel absolutely dreadful. Who is that fun for? It's not exactly fun for the enemy team to be constantly worried about extra objectives because their enemy pick Skarner. And it isn't exactly fun for his own team because it is a benefit that just kind of happens for most of the game.\n\nTo be blunt, Skarner might bring a bigger emphasis on map awareness like you want, but I don't think it would be in a healthy way for the game. Anyone who doesn't have map awareness won't suddenly have it because of this idea.\n\nCurrently about the vision idea with the spires, this currently already happens in high elos. If I see the soires change over, assuming we're in a good position to do so, I will collapse on him. The suggested change doesn't further emphasize this, it just makes those pillars stronger for his entire team if you can't contest them for whatever reason.\n\nLet's say we go with the suggested 1% health / mana regen as an example. Lets say I'm an adc at level 1 with 500 health for simplicity's sake (much lower than the average health pool level 1). 1% is 5 health every 5 seconds, which doesn't sound too bad. Over the course of a minute that will be 60 health over the course of a minute. That's nothing to scoff at, especially since this is realistically less than what you will actually get as your health pool will be higher. Factor in life steal and that this only gets stronger as the game goes on, that is insane. You'd be hard pressed to actually force that adc out of lane through any kind of trading unless you can do an all in.\n\nSame goes for the mana regen. Mana amounts are going to vary a lot more between champions, but let's go with 400 (so average amount for a mage give or take). That 4 mana every 5 seconds, which equals 48 mana per minute starting from level one. Not counting other forms of mana regen, that already gives them a lot more staying power in lane since it is rare they will be casting spells off CD and can either have more mana because of {{item:1082}} (which means more mana regen from spires) or a lot more mana regen thanks to doran's ring.\n\nThis is all starting from level 1 with simplified numbers to show that this is actually incredibly strong. If I'm on a team with Skarner, chances are I will automatically win any trade because I simply have more regen. That feels terrible in a pvp game. You weren't out played, out matched, etc. You were out statted. Riot has been moving away from things like that. WW is getting a rework finally, Urgot has been kept in the dumps for awhile, taric was reworked because he just gave free stats, etc. And that's exactly what this change will do, but in a way that not only feels bad for the enemy, but feels bad for the skarner player while going unappreciated by his team mates.","replies":[]}]}]}]}]},{"poster":"4th Chiming Lamb","date":"2016-05-13T19:32:10.385+0000","up_votes":1,"down_votes":0,"body":"1% mana regen every 5 seconds isn't even a buff. Same with 1% Health Reen every 5 seconds. Dragon and Baron spires (Neutral, by the way) seems like decent buffs.","replies":[{"poster":"KillerKell","date":"2016-05-13T20:13:14.780+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lastboss42,realm=NA,application-id=3ErqAdtq,discussion-id=E3QEAUcm,comment-id=000200000001,timestamp=2016-05-13T19:32:10.385+0000)\n>\n> 1% mana regen every 5 seconds isn&#x27;t even a buff. Same with 1% Health Reen every 5 seconds. Dragon and Baron spires (Neutral, by the way) seems like decent buffs.\n\nTrying to keep those Buff Buffs low, so as not to be over powering and forcing early mad dives to deny the ones on the Skarner side of the map.\n\nBut feel free to adjust numbers, or even the Passives (like maybe Red Buff gives +2 True Damage per Ability and Basic Attack... +4 if you have both.  Not much, but helps Last Hit and what not).\n\nBut if it's to strong then it will make it overly-oppressive and FORCE teams to deny all of them, instead of mainly needing to deny the ones on their side and the nuetrals.","replies":[]}]}]}]},{"poster":"Quepha","date":"2016-05-13T18:48:25.708+0000","up_votes":1,"down_votes":0,"body":"That's not what that quote means.\n\nThey were saying they wanted to reduce how much players have to play around the spires, not necessarily the actual number of spires on the map.","replies":[{"poster":"Muted Summoner","date":"2016-05-13T19:21:39.304+0000","up_votes":1,"down_votes":0,"body":"I don't specifically state the will remove it but maybe is my interpretation. They will either reduce the effectiveness of the spires, remove some, place them on a longer CD and/or make them stay captured longer so you don't have to every 15 seconds capture it back for example.\n\nreducing how players play around means they will be getting affected in some way. I haven't heard that they are removing them or what they exactly plan to do. So I created this thread to discuss about it and my interpretations and how I feel about Skarner and his Spires in some detail.","replies":[]},{"poster":"Oleandervine","date":"2016-05-13T19:00:09.444+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=E3QEAUcm,comment-id=0004,timestamp=2016-05-13T18:48:25.708+0000)\n>\n> That&#x27;s not what that quote means.\n> \n> They were saying they wanted to reduce how much players have to play around the spires, not necessarily the actual number of spires on the map.\n\nThey said both actually. They said they wanted to reduce the number of spires,  the team and enemy engagement with the spires, and his absolute reliance on the spires to not be a fist sucking invalid. They said they realized that his presence without the spires nearby means he's basically free game, and that such a thing was detrimental to his playstyle.","replies":[{"poster":"Quepha","date":"2016-05-13T19:15:29.291+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oleandervine,realm=NA,application-id=3ErqAdtq,discussion-id=E3QEAUcm,comment-id=00040000,timestamp=2016-05-13T19:00:09.444+0000)\n>\n> They said both actually. They said they wanted to reduce the number of spires,  the team and enemy engagement with the spires, and his absolute reliance on the spires to not be a fist sucking invalid. They said they realized that his presence without the spires nearby means he&#x27;s basically free game, and that such a thing was detrimental to his playstyle.\n\nSource? In the followup thread for Skarner they gave no specifics at all because they were only discussing the intended direction for future changes. There are red posts about how they feel too important to Skarner and occupy too much mindshare for everyone in the game with Skarner, but no mention at all of reducing the number of spires or even anything more specific than reducing their importance and how much players have to play around them.","replies":[]}]}]},{"poster":"Spoofghoul","date":"2016-05-13T18:49:36.735+0000","up_votes":1,"down_votes":0,"body":"the spires suck\n\nmight not be a unique thing, but id rather he had to gether crystals for a bonus effect kind of like how bard collects chimes.\n\nwho cares its not 100% unique because unique =/= better. The effects he gets from it could be unique like he gains armor and manaregen or something idk or maybe atkspeed or a special attack which scales with crystals collected like he stabs em with the tail and poisons them applyieng different effect depending on number of crystals. like a flat bonus dmg scalign with levels and after 20 crystals applies poison dot which can stack which grows stronger with more crystals. And after idk 50 crystals he also aplies grounded and after 80 crystals targets also receive a slow etc etc.","replies":[]},{"poster":"Darathdecimator","date":"2016-05-13T18:19:02.315+0000","up_votes":1,"down_votes":0,"body":"I agree about the spires, but I doubt we are going to convince them to actually spend ample resources on Skarner, just like the past 3 times.  We can just hope that they make the problem less aggravating, so I can finally play Skarner top again. ;(\n\nAlso if you have time what do you think about this? http://boards.na.leagueoflegends.com/en/c/gameplay-balance/YJEaQGYM-skarners-subclass","replies":[]},{"poster":"Lazypeon100","date":"2016-05-13T18:18:01.986+0000","up_votes":1,"down_votes":0,"body":"I think it won't be too bad if they leave the dragon / baron spires and remove the others. It would still give him that strong objective control that Riot wants to focus him on, as well as being able to buff him up when not near spires so he doesn't feel awful to pkay as, with, or against.\n\nThat's my take on it since they won't be removing the spires.\n\nThis thread _*INSPIRED*_ me to post about skarner. ^_^","replies":[]}]}