{"poster":"Wíss","date":"2016-11-17T23:13:34.282+0000","title":"Suche Leute zum zsm zocken","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hey Leute,\n\nIch spiele seit etwa 1 1/2 Jahren lol und seit her in Silber. Denke aber, ohne mich zu hoch heben zu wollen, dass Gold easy drin is f&uuml;r mich.\nIch bin Main ADC{{champion:202}} {{champion:236}} {{champion:22}} {{champion:18}}  kann aber auch relativ gut Jungeln (aber da is mein Championpool geringer{{champion:79}} {{champion:104}} {{champion:60}} {{champion:32}} ).\nIch suche{{item:2050}}  leute die bock haben regelm&auml;&szlig;ig zu zocken da meine motivation aufzusteigen recht hoch ist. Ich kann eigentlich t&auml;glich zocken ab 15-16Uhr.\nIch bin was das alter betrifft nicht gro&szlig;artig w&auml;hlerich. Ich selber bin 19, falls es f&uuml;r euch von bedeutung is. Ich hab aber kein bock auf leute die bei 2-3 Niederlagen direkt anfangen die motivation in die tiefe zu ziehen sondern dann erst recht Gasgeben und die fehler zu beheben. Also ich erwarte auch, dass Ihr mir sagt wo es bei mir hakt, aber gleichzeitig auch selber &quot;Kritik&quot; vertragen - sprich: auch mal zsm spiele analysieren. Mein theoretisches wissen ist was Meta, Itembuilds, Teamkomps etc. denk ich mal auch recht in Ordnung. Ich schaue viele videos von Pros und Castern, lese auch auf diversen Seiten immer was grad so abgeht. Aber, wirklich in einem festen Team hab ich aber noch nie gespielt, also da fehlt es mir noch etwas an Erfahrung.\n\nFalls ihr bock habt schreibt mich einfach an.\n\nPS.: Was am geilsten w&auml;re, wenn ihr schon so 3-4 Leute seit, ist aber auch kein muss\n\nMfG\n\nW&iacute;ss aka Joe","replies":[{"poster":"JGN Ayushin","date":"2016-11-18T17:10:17.593+0000","up_votes":1,"down_votes":0,"body":"Halli Hallo Wíss :3\n\nVielleicht sind wir dann genau das richtige für dich\nWir sind eine Ü18-Community, die außer Normals auch (Team-)Rankeds spielen.\nDa wir auf den Umgang miteinander achten, sind wir eine sehr harmonische Community,\ndie trotz ihrer Größe einen Zusammenhalt der Community zeigt.\nWir freuen uns auf Besuch und bei Fragen oder Interesse kann man mich gerne adden\nhttps://nerdsgocasual.de/\n\nLiebe Grüße\nDio (JGN Ayushin) (kannst mich gerne auch erstmal im game adden und wir können auch quatschen :) )","replies":[]}]}