{"poster":"Carolyn HD","date":"2018-03-30T11:10:14.476+0000","title":"Consiglio per farmare meglio? i Video sono ben graditi!","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Salve a tutti :3\r\nVorrei un consiglio su come farmare meglio o come migliorare quest&#039;ultimo. Il mio &egrave; un problema enorme visto che giocando support non so nemmeno io cosa faccio quando magicamente gioco mid/top, tendo a lasthittare troppo velocemente e a perdere tutti i minion giocando Kled o simili, farmo benissimo sotto torre (non ne perdo neanche uno wow!)ma in lane spesso e volentieri o faccio davvero schifo oppure tendo a rompere le scatole al mio povero enemy e mi ritrovo con 20 cs, grazie a questo ho solo le kill e la farm di un support(ovviamente perdo il game e la top al min 6:00)...\r\n Grazie mille a tutti e anche dei video sono graditi :3","replies":[{"poster":"Rikicchiricchì","date":"2018-03-30T11:19:41.283+0000","up_votes":2,"down_votes":0,"body":"io ho imparato togliendo l'autoattack e osservando i danni che di volta in volta subiscono i minions durante i game, se ci prendi l'occhio è solo questione di abitudine, magari giocando adc si impara meglio perchè dalla distanza hai il tempo per capire se hittare o meno i minions però non sò, cerco ancora di migliorarmi nonostante tutto xD","replies":[{"poster":"Carolyn HD","date":"2018-03-30T11:51:56.130+0000","up_votes":1,"down_votes":1,"body":"l'autoattack l'ho gia disattivato da tempo meno male, mentre per i danni sui minions non ci avevo mai pensato D:\nPurtroppo le uniche volte che ho giocato adc ho preso tanti di quei flame per via della mia posizione(gioco tank quindi mi butto sempre davanti a tutti mentre con l'adc devi fare il contrario)mi tocca provare adc solo quando sono con un premade perchè imparare su questo gioco in normal risulta impossibile(troppa gente tossica)","replies":[]}]},{"poster":"SPARATEVI","date":"2018-03-30T15:54:15.044+0000","up_votes":1,"down_votes":0,"body":"se non hai voglia di investire tempo nell'allenarti nel farming ti consiglio di selezionare giungla come ruolo secondario, o giocare champ che farmano molto easy (tipo annie mid e lasthitti di Q). personalmente credo che la lane più ardua nel farm sia mid perchè i maghi hanno ad base basso e le spell dovresti usarle per altro quindi concentrati su quello o magari le prime volte gioca col tp che comprare item early aiuta.","replies":[{"poster":"Carolyn HD","date":"2018-03-30T16:09:35.737+0000","up_votes":2,"down_votes":1,"body":"Si, ci starebbe il fatto di giocare un ap contando l'ad base, potrei pure giocare senza rune per migliorare l'allenamento ma per quanto riguarda la giungla direi di no... Mi trovo in un elo che qualunque cosa io faccia o non faccia se la lane di qualcuno perde, sarà sempre colpa mia e la mia autostima fa gia schifo di suo e passo l'80% del tempo a dire sorry,mb ecc.. tutto tranne la giungla e l'adc, sono le 2 lane più flammate nel 2018 xD\nAh e grazie :P","replies":[]}]},{"poster":"Dodop","date":"2018-03-30T14:07:46.689+0000","up_votes":1,"down_votes":0,"body":"Ti consiglio di dare un'occhiata al canale di Zefi, un esperto coach italiano che ha fatto un video guida molto utile per migliorare il farming:\nhttps://youtu.be/u9udV5EG1ag","replies":[{"poster":"Carolyn HD","date":"2018-03-30T14:56:51.313+0000","up_votes":2,"down_votes":1,"body":"Grazie mille, ora do un occhiata :3","replies":[]}]},{"poster":"twitchtv Vodky","date":"2018-04-01T10:26:02.863+0000","up_votes":1,"down_votes":0,"body":"Scegli un ruolo fisso, sembra una stupidata ma ogni ruolo ha delle stats diverse quindi se cambi spesso, oltre a non imparare il ruolo, devi anche reimparare a farmare visto i danni diversi. Per la posizione io da adc uso il tasto A (che mostra il range dell autoattacco) + tasto sinistro per attaccare e quello destro per muovermi. Questo ti tornerà utile in qualsiasi ruolo visto che per un buon posizionamento i nemici e i minion devono stare sempre al confine di questo range in modo da non regalare danni gratuiti.","replies":[]},{"poster":"Don Draven","date":"2018-03-30T17:18:18.549+0000","up_votes":1,"down_votes":0,"body":"picka {{champion:119}} \n\nnon perdere tempo ad allenarti a last hittare in custom,è una stupidata,a meno che non hai minimamente idea di come scenda la vita dei minions.","replies":[]},{"poster":"Philippicus","date":"2018-03-30T13:04:01.835+0000","up_votes":1,"down_votes":0,"body":"Puoi cominciare in modalità addestramento, ma poi vai in normal perché devi imparare a farmare mentre hai dei nemici che provano ad infastidirti (muta tutti e concrntrati sul farm). Vedi su YouTube trovi parecchi video su come farmare durante la lane o sotto torre (es.terenas). Il metodo di farmare cambia a seconda del champ che prendi (ranged,melee,maghi,ecc) quindi di volta in volta dovrai abituarti al danno che il tuo champ fa ai minions e all'animazione dell'autoattacco","replies":[{"poster":"Carolyn HD","date":"2018-03-30T13:08:48.439+0000","up_votes":1,"down_votes":1,"body":"Ottimo! mi ero dimenticata dell'esistenza di Terenas D: \nHo trovato un buon video per il farm, grazie mille :3 è difficile abituarsi però ç_ç\nGraziee ♥","replies":[]}]}]}