{"poster":"ReactivateD","date":"2016-02-06T01:48:38.079+0000","title":"Eloboost","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"Riot me dirijo hacia vos con sumo respeto y antes de empezar el tema pregunto por que me bloqueaste del foro cuando hice otro post , si no use lenguaje ofensivo.. \n\nBueno vamos al tema del eloboost , estoy en un grupo de whatsapp y bueno ahi hay un chico  que habla mucho y se cree mejor que los demas y era unranked desde la s3, bueno la cuestion es que ahora su cuenta le dio a un chico del grupo que se lo rankee las 10 provicionales y lo dejo en plata , el caso es que me molesta que lo hagan por que hay gente que de verdad juega y llega esta gente que no sabe jugar, por que de verdad no sabe jugar, y si terminas en silver te emparejan con el y terminas perdiendo por ciertos errores, y ademas que es muy agrandado , flamer y encima se va AFK,  me gustaria que se haga justicia , por que es molesto que se te burlen y no son buenos.. gracias y espero leas mi queja. \n\nP/d: en estos casos se sanciona al que elobosteo o al elobosteado? o a las dos cuentas? o no hay sancion ? \ny tengo las pruebas del eloboost !!\n\n- Gracias ..","replies":[{"poster":"Levíathan","date":"2016-02-06T02:22:38.971+0000","up_votes":1,"down_votes":0,"body":"Seguro no lo sancionan por falta de pruebas :/ Si lo que dice es verdad sería una lástima que quede impune.","replies":[{"poster":"ReactivateD","date":"2016-02-06T04:57:37.094+0000","up_votes":1,"down_votes":0,"body":"Tengo las pruebas del eloboost !! :v","replies":[]}]},{"poster":"Megapanzaa","date":"2016-02-06T03:45:49.371+0000","up_votes":1,"down_votes":0,"body":"No puedes denunciar los nombres por el foro maquinola, para eso están los tickets al soporte.","replies":[]},{"poster":"Hell Darking","date":"2016-02-06T02:49:31.034+0000","up_votes":1,"down_votes":0,"body":"fijo que te sancionan ahora por poner el nick del jugador, yo que tu edito el post antes que te lo borren","replies":[]},{"poster":"FF20 Lock","date":"2016-02-06T02:12:49.803+0000","up_votes":1,"down_votes":0,"body":"no se entiende mucho, pero aun asi deberia ser sancionado.","replies":[]}]}