{"poster":"Saysomi","date":"2015-12-31T13:35:22.845+0000","title":"kassadin nerf","subforum":"Champions & Gameplay","up_votes":1,"down_votes":7,"body":"kassadin bekommt nen zu starken heal ka warum aber das is zu stark nerft das bitte","replies":[{"poster":"SanctusUltimus","date":"2015-12-31T14:22:19.545+0000","up_votes":3,"down_votes":0,"body":"Halt, halt. Du weißt nicht, woher oder warum Kassadin sich heilt, aber möchtest, dass das generft wird?\n\nKassadin kann sich nicht heilen. Er besitzt einen Schild und kann Mana, aber kein Leben wiederherstellen.","replies":[{"poster":"jascha06","date":"2015-12-31T14:28:20.416+0000","up_votes":2,"down_votes":1,"body":"Muss jetzt raus aber ich denke er meint Kassas Schild als Heal xD","replies":[]}]},{"poster":"Señor Sucellus","date":"2016-01-01T01:03:47.375+0000","up_votes":1,"down_votes":0,"body":"Er meint mit Heal sicher die Passive von RoA, da dieses Item eigentlich Core auf ihm ist. Der Heal geht nur von dem Item aus und das auch nur bei jedem Levelaufstieg. Außerdem ist Kassadin keinesfalls zu stark. Er braucht lang um gut zu skalieren und macht auch nicht den übertriebenen Schaden, im Vergleich zu Zed, Lb und co. Hoffe ich konnte dir damit helfen.","replies":[{"poster":"fishing your adc","date":"2016-01-01T19:21:31.490+0000","up_votes":1,"down_votes":0,"body":"abgesehen vom letzten Punkt hast du recht, n Lategame Kassa kommt locker an den Burst von ner lb ran ;)","replies":[{"poster":"Señor Sucellus","date":"2016-01-02T01:25:35.505+0000","up_votes":1,"down_votes":0,"body":"Im Late Late Game vielleicht aber derzeit gehen ja die Games fast nie solang, weshalb ich immer eine Lb bevorzugen würde im Early, Mid-Game.","replies":[]}]}]},{"poster":"jascha06","date":"2015-12-31T14:19:42.221+0000","up_votes":1,"down_votes":0,"body":"Kassadin ist nicht wirklich stark und nicht schwach, ungefähr Neutral.\n\nSeine Stärkste Fähigkeit ist seine Passive und seine Ult :)\n\nUnd seine Ult finde ich total ok mit den Schaden und den Kosten, und die Passive ist halt bissl nervig aber trotzem nicht Stark und Schwach.","replies":[]},{"poster":"Revelate","date":"2015-12-31T14:04:49.921+0000","up_votes":1,"down_votes":0,"body":"Kassadin ist gut so wie er ist. nicht zu stark, nicht zu schwach.","replies":[]},{"poster":"pulledchicken","date":"2015-12-31T13:41:25.092+0000","up_votes":2,"down_votes":2,"body":"Wenn dann braucht Kassa einen kleinen mini buff ... aber bestimmt keinen nearv ;)","replies":[]},{"poster":"DerSyntax","date":"2016-01-01T17:41:32.703+0000","up_votes":1,"down_votes":2,"body":"Der Typ ist doch ein Toll?\nKassadin braucht nen nerf jop gg dann will ich das Urgot auch einen Nerf kriegt sein Ult-Schaden ist viel zu stark!","replies":[]}]}