{"poster":"GamingfreakCaine","date":"2015-08-09T06:33:59.418+0000","title":"Warum soll Gankplank schlecht sein?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Guten Tag Community,\n\nich m&ouml;chte in diesem Thread &uuml;ber den neuen Gankplank diskutieren. Laut dieser Seite: [(http://www.lolking.net/champions/)] und den Berichten von anderen Spielern, soll GP derzeitig ein sehr schlechter Champion sein. Da ich Gankplank maine und ihn selbst bei verlorenen Spielen mit einer guten KDA spiele frage ich mich, warum viele der Meinung sind, dass GP nicht zu gebrauchen ist. \n\nLetztens wurde mir GP sogar auf meinen Wunsch hin, dass man ihn bitte nicht bannt, trotzdem gebannt. Als ich nachfragte warum man ihn gebannt hat kam folgende Aussage: \"Ich will dieses Spiel gewinnen und nicht durch idiotische und schlechte Picks verlieren. Gankplank ist nutzlos.\"\n\nDiese Aussage kann ich nicht nachvollziehen, denn sehen wir uns die Fakten genauer an.\n\nGankplank besitzt CC-Remove + Heal, einen Range-Dmg-Skill, eine Global-Ulti, True-Dmg, Movementspeederhöhung und einen starken konstanten Burst &uuml;ber den E. Dar&uuml;ber hinaus verursacht er konstant hohen Schaden und ist ein sehr starker Farm-Champ auf der Top-Lane. Dazu kommen die 3 Upgrades f&uuml;r die Ulti, von der man schon ab Minute 15 eine besitzen kann (300 True Dmg ist meines Erachtens das beste Upgrade).\n\nSicherlich ist die gr&ouml;&szlig;te Schwierigkeit den Schaden &uuml;ber den E zu timen. Jedoch ist sein E unglaublich stark in Teamfights, da man nicht Focusziel-Nr. 1 ist und man durch GP die Teamfights unglaublich gut gewinnen und drehen kann. \n\nAlso lasst uns diskutieren. Warum soll Gankplank schlecht sein?\n\nMfG\n\n{{champion:41}}","replies":[{"poster":"Bergelmir32","date":"2015-08-10T23:26:33.799+0000","up_votes":2,"down_votes":0,"body":"Die Antwort ist die selbe wie immer: Sehr sehr viele Spieler sind engstirnig, überheblich unf dumm. Die Meisten haben keine Ahnung was gut ist und was nicht, sondern folgen nur dem Herdentrieb und spielen was ihnen vorgemacht wird, das wurde schon zahllose Male bewiesen. Leider gilt das von Pros bis hin zu unterstem Bronze.","replies":[]},{"poster":"IcryWhenIpoop","date":"2015-08-09T07:10:30.453+0000","up_votes":2,"down_votes":1,"body":"Also ich habe keine gute Erfahrungen mit Gangplank gemacht. Egal in welchem Team er war, dieses Team hat immer verloren. Ausser in einem. Dort war er im Gegnerteam. Und gewonnen hatten die auch nur, weil wir einen im Team hatten,der 20 Minuten Kreise um den Nexus rannte anstatt mitzuspielen. \nIch persönlich finde sein E unbrauchbar im Teamfight. Sicherlich macht es einen Haufen Schaden, ABER auch nur wenn der Gegner dumm genug ist darin stehen zu bleiben. Und DAS ist bisher sehr selten passiert. \nSein Q macht sicherlich auch n Haufen Dmg. Auf ein Einzelziel. Aber damit es diesen Schaden macht muss man recht squishy bauen und kippt demzufolge wieder recht schnell um im Kampf.\n W ist halt Heal und CC Aufhebung. Aber auch nur einmal mit ner recht hohen Abklingzeit.\nSeine Ulti ist ne nette Spielerei. Aber in meinen Augen sind die Aufwertungen viel zu teuer. Wie lange müsste man spielen um alle 3 Aufwertungen zu bekommen? Hab ich bisher noch nie gesehen. Nichtmal die 2. Aufwertung habe ich bisher erlebt.\nSpielt man Gangplank tanky wird er meiner Erfahrung nach ignoriert im Kampf, da er einfach keine Bedrohung darstellt. \nEs gibt einfach stärkere Alternativen als ihn. \nDas hier geschriebene entspricht keinem fundierten theoretischen Wissen das ich mir evtl. auf irgendwelchen Inetseiten angeeignet haben könnte. Alles oben geschriebene spiegelt nur eigene Erfahrungen mit Gangplank wieder. Und die sind, rein bezogen auf den Champion an sich, nicht allzu gut.\n\nMfG","replies":[]},{"poster":"Wohltat","date":"2015-08-10T23:09:14.766+0000","up_votes":1,"down_votes":0,"body":"Die Winrate ist so schlecht weil von Bronze bis Plat 3 ne Menge Leute glauben GP als Critplank und ADC Build spielen zu müssen. Dann kommt oben ein Jax oder malphite und zack ist unser GP 0/7/0 mit 20 cs nach 15 Minuten.","replies":[{"poster":"GamingfreakCaine","date":"2015-08-11T21:09:49.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wohltat,realm=EUW,application-id=Wj1wcocU,discussion-id=nVNMG9sQ,comment-id=0002,timestamp=2015-08-10T23:09:14.766+0000)\n>\n> Die Winrate ist so schlecht weil von Bronze bis Plat 3 ne Menge Leute glauben GP als Critplank und ADC Build spielen zu müssen. Dann kommt oben ein Jax oder malphite und zack ist unser GP 0/7/0 mit 20 cs nach 15 Minuten.\n\nWelches Build ist derzeitig zu empfehlen? \n\nMein derzeitiges Build ist:\n\n-{{item:3078}} \n-{{item:3087}} \n-{{item:3158}} \n-{{item:3143}} \n-{{item:3065}} \n-{{item:3110}}  oder {{item:3031}} \n\nManchmal baue ich auch Warmogs. Das obrige Build habe ich von Diamond-Guides aus Mobafire.","replies":[{"poster":"Wohltat","date":"2015-08-18T13:38:39.299+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GamingfreakCaine,realm=EUW,application-id=Wj1wcocU,discussion-id=nVNMG9sQ,comment-id=00020000,timestamp=2015-08-11T21:09:49.874+0000)\n>\n> Welches Build ist derzeitig zu empfehlen? \n> \n> Mein derzeitiges Build ist:\n> \n> -{{item:3078}} \n> -{{item:3087}} \n> -{{item:3158}} \n> -{{item:3143}} \n> -{{item:3065}} \n> -{{item:3110}}  oder {{item:3031}} \n> \n> Manchmal baue ich auch Warmogs. Das obrige Build habe ich von Diamond-Guides aus Mobafire.\n\nVergiss Mobafire. Check www.champion.gg.\n\n----------------------------------------------------------\nwww.youtube.com/wohltatLOL","replies":[{"poster":"GamingfreakCaine","date":"2015-08-18T14:05:39.144+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wohltat,realm=EUW,application-id=Wj1wcocU,discussion-id=nVNMG9sQ,comment-id=000200000000,timestamp=2015-08-18T13:38:39.299+0000)\n>\n> Vergiss Mobafire. Check www.champion.gg.\n> \n> ----------------------------------------------------------\n> www.youtube.com/wohltatLOL\n\nHey, danke dir :) Aber das Build besagt, dass man auf Critplank geht. Ich sehe da nur sehr große Probleme im überleben, da GP außer der Orange kaum Sustain hat und ich bezweifle, dass der Blutdürster viel Defensive mitbringt.","replies":[]}]}]}]},{"poster":"OrangeBubble","date":"2015-08-09T07:00:24.327+0000","up_votes":1,"down_votes":0,"body":"Ich hätte den Typen wegen Sabotage reportet. Immerhin hat er damit sein eigenes Team sabotiert....\n\nAber mal davon abgesehen...\nIst das Problem, dass GP eine gewisse Übung braucht. Man muss die E effektiv nutzen, ohne dass der Gegner die Fässer immer zerstört :3\nAußerdem hat er kein CC und jeder liebt CC auf der Top ;)\nAber sooo schlecht kann er nicht sein, denn im Challengerbereich wird er durchaus gepickt. Hai wurde als TF fast von der GP Ult 1 shotted, weil er die Ult unterschätzt hat, ohne das wer anderes Schaden an ihm angebracht hatte :) \nDu wirst mit GP sicherlich hoch kommen, wenn du ihn beherrscht. Es gab auch mit dem alten GP Leute, die sich auf Dia/Challenger gecarried haben. Daher lass dir da nicht reinquatschen.\n\nUnd wie gesagt, Picks wegbannen mit Absicht ist das letzte. Ich hasse z.B. Yasou Mains, wenn jemand im Chat schreibt, \"Pls dont bann Yasou\", würde ich den auch am liebsten bannen, aber das wäre einfach dumm, wenns sein einziger guter Pick ist, sabotier ich mich mitm Bann selber U.U \n\nAber nya","replies":[]}]}