{"poster":"DW GunGale","date":"2015-09-12T04:04:49.853+0000","title":"Tips'n'Tricks for getting out of Bronze","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"**Aatrox&#039;s Tips&#039;n&#039;Tricks for getting out of Bronze**\n\n**=============================================================**\n\nGreetings Summoners,\n\nThis thread details some of the aspects of League of Legends that I believe are a crucial factor towards your game play and will ultimately be beneficial towards your success rate.\n\n**Disclosure: **By using these tips and tricks in no way guarantees your success rate in Bronze will increase and will in no way guarantee your way into Silver. The information throughout this post serves as a guideline and results in an actual climb are solely up to the user.\n\n**=============================================================**\n\n**Map Awareness**\n\n_What is map awareness? _\n\nMap awareness is pretty self explanatory. You as a player need to be aware of what is going on in your mini map. Think of driving a car. Your main focus is on the road and on your lane but at the same time you need to be aware of your surroundings. This is the same in League of Legends. You should be able to do quick glances at your mini map to gain information on the positions of players.\n\n_Optimal Map Awareness:_\n\nIn a video I saw recently, the user mentioned how one of his most hated player types in League of Legends was the &#039;Pinger&#039;. A player who pinged your lane so much that it&#039;s like he&#039;s paying more attention to your lane than his. This is poor map awareness. Optimal map awareness should be where you focus on your lanes surroundings (immediate fog of war) whilst also keeping an eye on your team mates lanes in regards to enemy laners. Keeping an eye on your team mates lanes and their opposing laner will help you determine what your own positioning is. If you are bot lane and you see the enemy Katarina is missing you should probably avoid pushing and be in a position to defend and escape a gank. At the same time you should also be able to ping your other team mates should your laner move out of lane. Ideally, you should be able to see which direction your opposing laner has gone and from there ping potential paths for he or she for your team mates so that they can reposition themselves for the potential gank.\n\n_TLDR:_ 80% focus on your own lane. 10% focus on your team mates lane. 10% focus on immediate fog of war. You are looking out for enemy champion positions. With the help of vision and interaction of other team mates pinging opposing champion pathing you should be able to position yourself for any potential ganks.\n\n**Warding**\n\n_What is warding?_\n\nNow everyone should know warding already. But in low elo warding can go over your head pretty easily I assume. Warding is essentially one of the most crucial components of League of Legends game play overall. Warding can be the difference between getting Baron or closing out the game. Warding is love, warding is life.\n\n_Optimal warding:_\n\nJust because you put a ward down doesn&#039;t mean it&#039;s useful. The most common example of this would be putting a ward down at the 00:40 mark in game. More often than not this will prove a wasted ward. So you want to time your wards and where to put them according to how the enemy would play. This requires predicting what your enemy would do. e.g. predicting jungle paths and lane roam paths. Don&#039;t necessarily put a ward down in your immediate river bush. By the time you see activity on that ward it&#039;s probably too late. Ward a little higher to give yourself the most amount of time to react to activity there.\n\n_Warding for plays:_\n\nYou should also time your wards around certain plays. e.g. dragon control. I would suggest placing some deep wards in the enemy jungle as well as potential paths for enemies to get to dragon. This way you have a more secure environment for taking dragon. In addition I would strongly recommend getting the scuttle around that area. In addition, try to clear out any opposing wards in the area.\n\n_Pink Wards:_\n\nEvery player can have 1 active pink ward at a time. That means you can have 5 pink wards active at any given time. Use a pink! If you have enough gold on your back and you don&#039;t have a pink up. Get a pink. The ideal location for a pink ward would be in a location that you want the most vision in (this way you avoid wasting wards that expire). In addition you should place the pink ward in a position that if an enemy tries to clear it you have the ability to react to it and attack them or get a kill if possible.\n\n_TLDR: _Be decisive about where and when you place your wards. Place your wards based on your teams needs. e.g. dragon control. \n\n**Trinkets**\n\nI&#039;m going to keep this one simple and suggest the most ideal situation for your teams trinket situation. The most common trinket set up is:\n\nTop: Yellow\nJungle: Red\nMid: Yellow\nADC: Blue\nSupport: Red\n\nBut in my mind I think if you can get as many UPGRADED Red Trinkets on your team then that&#039;s great. Clearing wards and enemy vision goes hand in hand with placing your own wards and securing an area.\n\n**Positioning**\n\nI think one of the biggest things that could help improve your game is your understanding of positioning. Positioning is probably one of the greatest factors that contributes to the success of a game.\n\nPositioning works hand in hand with all the factors that mentioned above. Your own vision, the enemies vision, the position of enemies should all be factored in to deciding where you need to be at any given time.\n\n_Individual Positioning:_\n\nDepending on your role you need to play your position differently. If you&#039;re a tank you get in the front, if you&#039;re an ADC you stay at the back. Use all the factors mentioned above such as your teams vision, the enemies vision and the enemies position to determine your own position in a fight. Taking into account all those factors will reduce the odds of you being caught out and the odds of you catching them out.\n\n_Team Positioning:_\n\nThis refers to team plays. Not just team fights. Don&#039;t waste 5 minutes sieging a single tower when you are in the position to rotate to an alternative lane and push that instead of the one you&#039;re wasting time on sieging. Don&#039;t waste 5 minutes mid lane achieving nothing when you can easily rotate and secure a dragon. \n\nWith good warding you can easily decide where to rotate to and even play your enemy into getting them to rotate thinking your team has rotated but then go back to the lane you were sieging. Basically what I&#039;m saying is don&#039;t wait for an opportunity to make a play. Create an opportunity yourself. This is the difference between at 30 minute game and a 50 minute game.\n\n**Item Coordination**\n\nBe clear with your team what items you&#039;re going to build. I don&#039;t mean stating every single item you&#039;re building. But if you&#039;re building items that are going to be beneficial to your team like a frozen heart then tell your team mates. A lot of the time teams will double up on items that could have been avoided by clear item calling and instead of having two frozen hearts you could have a frozen heart and a locket available in a team fight and sometimes this makes all the difference.\n\n**Don&#039;t Be Greedy**\n\nDon&#039;t waste 60 seconds chasing one enemy when you could push a tower when they can&#039;t defend it. In addition, don&#039;t chase an enemy when you have a lack of vision and knowledge of enemy champions.\n\n**Focus**\n\nCoordinate team fights and get your focus in order. You can&#039;t have everyone 1v1ing in a 5v5. Having all 5 players focus one champion often wins the fight.\n\n**=============================================================**\n\nTLDR:\n\n* Have control of your map. The more wards and vision your team has the more knowledge of the enemy teams movements you&#039;ll have. From this you&#039;ll be able to determine your own plays and positioning.\n* Use your time effectively, don&#039;t waste time sieging a tower when you could easily rotate to another objective.\n* Create opportunities and plays instead of waiting for the enemy to slip up.\n* Be decisive and don&#039;t be rash.\n\n**=============================================================**\n\nAgain. These tips and tricks will not guarantee your victory on the fields of justice. These serve as a guideline on the factors of a game that determine the success of your team. The actual result of any game is entirely up to you.\n\nBest of luck,\nAatrox","replies":[{"poster":"A Nocturne","date":"2015-09-14T12:25:53.445+0000","up_votes":1,"down_votes":0,"body":"better blame my teammates. or obama.","replies":[]},{"poster":"Omni Presents","date":"2015-09-12T05:57:27.410+0000","up_votes":1,"down_votes":0,"body":"TL;DR:\nDon't suck ass.\n\nOK, on a serious note, don't be an ass. Having a negative attitude has lost me more games than anything. One player decides to be an ass and it flows onto the team and BAMN! We lose.","replies":[]}]}