{"poster":"KingKongLoL YT","date":"2017-08-24T18:07:56.634+0000","title":"Besser im Ranked werden durch Sport?","subforum":"Streams & YouTube","embed":{"description":"► Help me reach 500 Subs! CLICK ME : http://bit.ly/2drtLKX ► STREAM: https://www.twitch.tv/beastkongtv ► TWITTER: http://www.twitter.com/kong2strong ► INSTAGRAM: https://www.instagram.com/kingkong.lol/ ► FACEBOOK: https://www.facebook.com/markong.kong.12 ► DISCORD: https://discord.gg/WkebN4 ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ Quelle: Sportschau ARD: https://www.youtube.com/watch?v=e_hnbH6Dt-g&t=693s","url":"https://www.youtube.com/watch?v=2wiFg_EZOeQ","image":"https://i.ytimg.com/vi/2wiFg_EZOeQ/hqdefault.jpg"},"up_votes":3,"down_votes":0,"body":"&quot;Wenn man k&ouml;rperlich fit ist, dann spielt man auch besser.&quot; Wahre Worte aus dem Munde eines Esport - Profis und damit ein herzliches Willkommen zu einem neuen Video. \r\n\r\nWenn ihr euch gefragt habt, warum ihr nicht besser in Gaming werdet und ihr hard stuck in einer bestimmten Elo seid, dann kann es unter anderem daran liegen, dass ihr k&ouml;rperlich einfach nicht fit seid. League of Legends und &auml;hnliche Games sind Spiele, die uns vor allem Mental fordern. Viele Dinge muss unser Gehirn innerhalb von Millisekunden verarbeiten und steuern. Das bedarf eines klaren Geistes und ein gesunder Geist, wohnt in einem gesunden K&ouml;rper. Das hat Schalke l&auml;ngst erkannt und will ihre Spieler auch sportlich trainieren, sodass sie hundert Prozent abrufen k&ouml;nnen. Dazu hat Schalke folgendes Statement abgegeben:\r\n\r\nSchalke: &quot;Wichtig f&uuml;r Schalke ist, dass Fitnesstraining fester Bestandteil des Trainingsalltags wird.&quot;\r\n\r\nTim Reichert ist der Leiter der Esport-Abteilung auf Schalke und spricht sogar von einem versteckten Potenzial, dass entfesselt werden kann, wenn der K&ouml;rper ebenfalls trainiert wird.\r\n\r\nAber nicht nur das Sportreiben ist wichtig, sondern auch die Ern&auml;hrung spielt eine wichtige Rolle. In jeder Sportart haben die Athleten eine an die jeweilige Belastung angepasste Ern&auml;hrung. Wenn die Nationalmannschaft in BootCamps trainiert, dann ist das Essen so angepasst, dass sie auf dem Feld dann auch 100% abrufen k&ouml;nnen. Anders bei den E-Gamer Profis. In ihren BootCamps, ihren Gamingh&auml;usern also, fressen sie alles an Junkfood was nur geht und genau das ist Kontraproduktiv f&uuml;r die geistige Leistung, die w&auml;hrend des Spielens erbracht werden muss. \r\nDiese Worte stammen nicht von mir, sondern von dem Sportwissenschaftler Prof. Dr. Ingo Frob&ouml;se.\r\n\r\nAuch wir Normalos und vor allem Streamer, hauen in uns rein was nur geht. Dabei k&ouml;nnten wir so viel besser im Ranked sein, wenn wir auf unsere Ern&auml;hrung achten w&uuml;rden und regelm&auml;&szlig;ig Sport treiben w&uuml;rden. Allerdings wissen viele nicht wie sie ihre Ern&auml;hrung anpassen m&uuml;ssen und ins Fitness Studio wollen manche unbedingt auch nicht geschweige denn joggen. Und genau hier komme ich ins Spiel. Ich werde in der Zukunft Videos hochladen, in denen ich euch kurze und intensive Workouts zeige, die ihr problemlos zwischen zwei Games machen k&ouml;nnt. Au&szlig;erdem werde ich euch auch Gerichte zeigen, die man schnell zubereiten kann und gesund sind. \r\nIch habe bereits ein Video mit einem R&uuml;ckenworkout f&uuml;r zu Hause hochgeladen, dass ihr in der Description Box findet. Kommende Fitness Videos werden &auml;hnlich aufgebaut sein und immer mit einer PDF-Datei versehen, so das ihr euch den Trainingsplan ausdrucken k&ouml;nnt und nicht immer wieder das Video anschauen m&uuml;sst. Gleiches gilt f&uuml;r die Ern&auml;hrungsvideos. Die Rezepte habt ihr dann griffbereit in Papierform.\r\nDie Ausrede &quot;ich habe keine Zeit&quot; ist damit haltlos. Meine Workouts und Gerichte werden maximal 15 Minuten in Anspruch nehmen. \r\n\r\nWenn ihr im Ranked aufsteigen wollt, dann verpasst kein Video mehr von mir und abonniert meinen Kanal. Bringt mithilfe meines GamerWorkouts euren K&ouml;rper, euren Geist und damit eure Elo auf vordermann und fahrt den Ruhm und die Anerkennung eurer Freund ein. Denn hey, ihr seid definitiv besser als eure aktuelle Elo!","replies":[{"poster":"NeviExil","date":"2017-08-25T12:35:37.062+0000","up_votes":1,"down_votes":0,"body":"Soul Eater... just saying","replies":[]},{"poster":"Allerbester Biss","date":"2017-08-25T05:27:30.740+0000","up_votes":1,"down_votes":0,"body":"Wieviel muss ich denn trainieren um aus Dia raus zu kommen?","replies":[]}]}