{"poster":"Pedro Apablaza","date":"2019-08-29T18:04:14.422+0000","title":"Aburrido de perder partidas porque no tengo impacto ","subforum":"Charlas Generales","up_votes":8,"down_votes":1,"body":"Soy main jg y lo unico que juego en ranked es jg, pero de que me sirve fediarme o ayudar a mi equipo si no tendre nada de impacto, si en total el que ganara la partida sera el que no tenga al troll o al fedeer, entiendo que tengo que demostrar mis habilidades para poder subir pero si constantemente me tiran a la botlane perdedora o al mid perdedor no puedo hacer mas que intentar fediarme y aguantar la partida.\r\nme jugue 6 rankeds y gane solo 1 y admito que no jugue bien en solo 1 y esa fue en la que gane, pero todas las demas que hice algo o me fediaba perdia, mi pregunta es que puedo hacer para ganar? Abusar del duo q?","replies":[{"poster":"Tuí","date":"2019-08-29T18:10:07.209+0000","up_votes":7,"down_votes":2,"body":"te respondes vos solo... en la q jugaste mal ganaste porque vos no eras el wincondition.. y en las q perdiste lo eras vos y no pudiste carrear... no es x tirarte abajo pero pensalo... mirate las partidas y fijate en q te equivocas","replies":[{"poster":"Pedro Apablaza","date":"2019-08-29T18:14:51.403+0000","up_votes":3,"down_votes":1,"body":"Amigo si yo voy 3/0 y todo mi equipo va extremadamente mal no creo que yo pueda hacer algo.\nCree que lo mejor en estos casos es jugar linea para poder carrear","replies":[{"poster":"Zelos From Jonia","date":"2019-08-29T18:32:29.385+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Pedro Apablaza,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=00000000,timestamp=2019-08-29T18:14:51.403+0000)\n>\n> Amigo si yo voy 3/0 y todo mi equipo va extremadamente mal no creo que yo pueda hacer algo.\n> Cree que lo mejor en estos casos es jugar linea para poder carrear\n\nTenes razon, no es tu culpa lo que haga el resto del equipo.\n\npregunta: ¿ por que te importa lo que haga el resto si no podes cambiarles nada?\n\nRespuesta: las partidas no se ganan por ir 3/0","replies":[]},{"poster":"Tuí","date":"2019-08-29T18:24:28.183+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Pedro Apablaza,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=00000000,timestamp=2019-08-29T18:14:51.403+0000)\n>\n> Amigo si yo voy 3/0 y todo mi equipo va extremadamente mal no creo que yo pueda hacer algo.\n> Cree que lo mejor en estos casos es jugar linea para poder carrear\n\nNos pasa a todos, y le puede pasar hasta a faker, este juego se basa en estadisticas y porcentajes. Trata de que estos sean lo mejor posible para ti y pronto subiras","replies":[]}]}]},{"poster":"Spiroz V2","date":"2019-08-29T20:07:20.916+0000","up_votes":4,"down_votes":1,"body":"y mira bro,en las ultimas 6 ranked jugaste 6 campeones diferentes,deja de hacer eso,centrate en 3 maximo,no vi buenos kda pero quiza es que no se actualizo,en cualquier caso,intenta controlar mas el juego,la vision es muy importante,tambien la comunicacion.\ndescarta a lee,o elise,son cosas para elos altos,estas con un winrate de 42%,trata de cambiar eso o vas a terminar desendiendo,te recomiendo descargar tus partidas y ver tus errores,olvidate del equipo,en lo posible juga un hipercarry que genere snowball rapido,aprovecha esa facultad y factura objetivos y vas a carrilear un game bastante facil,tambien planteate los match en normales,para que sepas cual es la condicion de victoria de cada partida,tambien que objetivo tenes como junglero en cada partida.","replies":[]},{"poster":"demonslayer2902","date":"2019-08-29T18:46:49.285+0000","up_votes":4,"down_votes":1,"body":"Juga campeones mas fuertes para low elo, no tenes malos resultados pero tenes que volverte mas determinante.\nTe tiro de ejemplo a elmillor que ahora se fue a corea, no es un faker suele andar por master en euw pero le cuesta mucho carrear en low elo con sus main. Entonces jugo casi otp k6 hasta d4 y le funciono subio con 75%.\nYo te recomendaria que estoy un poco por debajo de tu elo que aprendas a jugar k6 y mejores ese kayn(que tiene bastante potencial de carry) y te va a dejar de importar la bot y mid porque si vas bien oneshoteas.\nYo lo noto con diana que si no se fedea un tank, es free win si voy normal o bien. Porque mi win condition es matar al carry feed enemigo.","replies":[{"poster":"Pedro Apablaza","date":"2019-08-29T19:08:02.322+0000","up_votes":1,"down_votes":0,"body":"Tu comentario me motivo a seguir intentandolo y la verdad tienes razon, Gracias amigo &lt;3","replies":[]}]},{"poster":"Fromuston","date":"2019-08-29T21:22:00.822+0000","up_votes":2,"down_votes":0,"body":"League of Legends es un juego en equipo, por ende no deberías depender de vos solo para ganar (como muchos piensan, erroneamente). Desgraciadamente, es algo que solo los main support entendemos...\n Lo que habría que cambiar es a la gente... (a los Main Vayne, por ejemplo, habría que banearlos xD).","replies":[{"poster":"ALLMUTEFULL","date":"2019-08-30T11:49:51.877+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fromuston,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=0005,timestamp=2019-08-29T21:22:00.822+0000)\n>\n> League of Legends es un juego en equipo, por ende no deberías depender de vos solo para ganar (como muchos piensan, erroneamente). Desgraciadamente, es algo que solo los main support entendemos...\n>  Lo que habría que cambiar es a la gente... (a los Main Vayne, por ejemplo, habría que banearlos xD).\n\ntienen problemas esa gente no es normal","replies":[]}]},{"poster":"TOP 1 DIANA","date":"2019-08-29T20:30:14.534+0000","up_votes":4,"down_votes":2,"body":"antes de entrar al post lo que pense fue: \"debe ser main top\", pero wtf, sos main JG, de los roles con MAS impacto...\nsimplemente debes mejorar. Recordá que el juego no se trata de fedearse si no de saber carrear!","replies":[]},{"poster":"BiIIy the Kid","date":"2019-08-29T21:26:40.611+0000","up_votes":2,"down_votes":1,"body":"jg es lo que tiene más impacto xd","replies":[{"poster":"JUNGLE KlNG","date":"2019-08-30T20:59:56.360+0000","up_votes":1,"down_votes":0,"body":"Ni ahi, todos los jungleros son muy parecidos. Los que tienen la mayor posibilidad de impacto son las lineas.\nLas lineas dan prioridad, en su mayoría escalan mejor, tienen más facilidad para el oro y la posibilidad de elegir summoners dependiendo de lo que quieran.\nSi vas jungla, solo tenes asegurado los primeros campamentos, si el otro junglero es bueno y contrajunglea te quedas sin oro y exp, totalmente parado. Los lineas tienen los minions en la cara toda la partida. Los jungleros de este meta son de gankeo(=poco escalado). Si tus lineas no te dan prioridad, no podés ni acercarte al río. \nAsí que pensalo man, seguro ni sabías que podés generar prioridad para que tu jungla pueda wardear, gankear o asegurar objetivos.\nNo creo que la jungla impacte mucho. Los lineas si, ellos controlan la prioridad.","replies":[{"poster":"BiIIy the Kid","date":"2019-08-30T21:29:13.252+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JUNGLE KlNG,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=00060000,timestamp=2019-08-30T20:59:56.360+0000)\n>\n> Ni ahi, todos los jungleros son muy parecidos. Los que tienen la mayor posibilidad de impacto son las lineas.\n> Las lineas dan prioridad, en su mayoría escalan mejor, tienen más facilidad para el oro y la posibilidad de elegir summoners dependiendo de lo que quieran.\n> Si vas jungla, solo tenes asegurado los primeros campamentos, si el otro junglero es bueno y contrajunglea te quedas sin oro y exp, totalmente parado. Los lineas tienen los minions en la cara toda la partida. Los jungleros de este meta son de gankeo(=poco escalado). Si tus lineas no te dan prioridad, no podés ni acercarte al río. \n> Así que pensalo man, seguro ni sabías que podés generar prioridad para que tu jungla pueda wardear, gankear o asegurar objetivos.\n> No creo que la jungla impacte mucho. Los lineas si, ellos controlan la prioridad.\n\n''seguro ni sabias que... blablabla'' \nclaro que lo sé, y que tiene que ver?  ''pensalo'' antes de escribir porque sí.\nJg tiene el potencial para tener el mayor impacto en las partidas, ahora si eres jg y no eres capaz de hacerlo es problema tuyo. Obviamente también dependes de los laners porque es un juego de equipo donde todos importan, pero tu puedes brindarles ventaja.","replies":[{"poster":"JUNGLE KlNG","date":"2019-08-30T22:05:25.734+0000","up_votes":1,"down_votes":0,"body":"Yo no te escribo para pelear bro. No tenes que ser tan suceptible. Escribo porq no es así. Vos pensas que es así. Pero no.\nSon los laner los que te dan prioridad. Son los laner los que te dejan hacer algo.\nNi jungla jugás bro. A la cucha nomás jajaja","replies":[{"poster":"BiIIy the Kid","date":"2019-08-31T15:50:17.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JUNGLE KlNG,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=0006000000000000,timestamp=2019-08-30T22:05:25.734+0000)\n>\n> Yo no te escribo para pelear bro. No tenes que ser tan suceptible. Escribo porq no es así. Vos pensas que es así. Pero no.\n> Son los laner los que te dan prioridad. Son los laner los que te dejan hacer algo.\n> Ni jungla jugás bro. A la cucha nomás jajaja\n\nno juego jungla por ende no tengo razón? xddd\nTe digo lo que dicen los analistas y high elo junglers de servers competentes, eso ;)","replies":[{"poster":"JUNGLE KlNG","date":"2019-09-01T23:45:53.204+0000","up_votes":1,"down_votes":0,"body":"Y si, si no jugas jungla no sabes. Asi que shhh bb","replies":[{"poster":"BiIIy the Kid","date":"2019-09-02T21:32:28.748+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JUNGLE KlNG,realm=LAS,application-id=v7qsfXsE,discussion-id=KH09XvBz,comment-id=000600000000000000000000,timestamp=2019-09-01T23:45:53.204+0000)\n>\n> Y si, si no jugas jungla no sabes. Asi que shhh bb\n\nrespuesta mediocre xd","replies":[]}]}]}]}]},{"poster":"asdmaskldmnkfl","date":"2019-08-31T16:15:41.438+0000","up_votes":1,"down_votes":0,"body":"Es que riot quito todas las herramientas de stompeo facil que tenia la jungla de antaño, antes podias dejar al jungla contrario 5 niveles abajo, ahora no.\nSi antes con tres campamentos podias tener nivel 3, ahora necesitas 4 o hacer los golems que no todos los campeones lo pueden hacer.\nAnte no importaba que tu mid tuviera 2 dedos de frente, si ahora tienes un mid que no sabe librarse de un gank, estas en la b. En el momento que tu mid pierde presion estas en la b porque el jungla contrario te saco todos tus campamentos o un dragon y un heraldo. \nY como en las los laners son incompetentes no queda mas que jugar a la loteria y rezar porque alguno de tus laners sepa lo que hace y te carree porque la jungla ya no carrea sino que es la put4 de las lineas que debe darles de comer y respirar por ellos.  Y si tu jungla contrario justo se encontro con 2 kills en bot porque se pararon mal. Perdiste el juego porque ya no sirves de nada no vas a poder pelear un dragon o un heraldo. y solo te queda evitar al jungla contrario.\nLos laners solo deben jugar safe y esperar ganks y cosa que ni siquiera pueden hacer en este server incopetente. Por eso estoy jugando mayoritariamente en brasil donde al menos la gente sabe jugar un porquito sus campeones y no donde debes estar aguantando gente que sale 0-5 en cada partida.\nAuch me salio crypost pero bueno es la realidad de la jungla y sobre todo en este server donde todavia lloran un gank y no son capaces de congelar una linea.","replies":[]}]}]},{"poster":"The Blood Lord","date":"2019-08-30T17:45:19.199+0000","up_votes":1,"down_votes":0,"body":"Que onda bro, yo juego {{sticker:vlad-salute}} lo único que necesito es un jungla con mucha paciencia y aguante al tilteo, (yo no me tilteo y nunca jamas flameo) y que me ayude en linea, después vlad hace 1v9 y vas tirando maestria como buen yasuo.\nSi queres agregame y despues vemos si podemos subir C:","replies":[]},{"poster":"AzorAha","date":"2019-08-30T01:22:59.000+0000","up_votes":1,"down_votes":0,"body":" las ranked son una lotería, todo depende del emparejamiento, juega solo para divertirte y listo.\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Fransoi ","date":"2019-08-29T22:40:21.798+0000","up_votes":1,"down_votes":0,"body":"jg es junto a mid el mejor rol para carrear asi de corta te lo digo es asi en mi opinion   mid / jg / adc / soporte / top ","replies":[]},{"poster":"F1deosconsalsa","date":"2019-08-29T20:51:24.551+0000","up_votes":1,"down_votes":0,"body":"tranquilo, se nerfeo la jg para que dejara de ser la linea más determinante, a día de hoy te queda 1v9 , hacerte supp del que sea la wincondittion o hacerte los objetivos y llegar a late si estas muy low elo. por contra parte te explico que hace poco más de un año me paso lo mismo, me preguntaba que hacia mal yo que mis lineas me insultaban y perdíamos tanto, me concentre, practiqué y seguí todo tipo de consejos, miraba mucho mis estadísticas y noté que a pesar de que superaba con amplio margen las estadísticas (tenia stats de diamanco en oro, pero jugando contra platas y oro es \"fácil\" llegar a eso), abusé del duoQ y te juro que stompeabamos de jg y top, pero la bot salia 0/10 al min 15.... jugábamos bot y el top y mid trolleaban.... así un sin fin....llegué a la conclusión de que no era mi culpa, habrá partidas donde no podrás hacer nada, cuando veas que ya es mucho, algo que ya necesitas dragon ancestral y baron para tener oportunidad, solo deja que la conclusión llegue, haz tu trabajo, pero nada más y siguiente partida, mutea a quien solo moleste, tengo más de 600 en la lista de bloqueados. en sintesis, compite contra ti mismo, por mejorar, según el juego, en algún momento te tocará subir si eres bueno, quizá en 200 partidas..... (yo me comí 400 partidas entre oro 2 y platino 3 justamente con lo que tu describes, el juego ya no me era divertido).","replies":[]}]}