{"poster":"Sleep On Stream","date":"2019-02-13T06:24:15.410+0000","title":"Riot watch this!! NERF THRESH Q WIDTH WATCH THIS.","subforum":"Gameplay","embed":{"description":"Uploaded by King Of Tech on 2019-02-13.","url":"https://www.youtube.com/watch?v=hIKGgm3CqWU&feature=youtu.be","image":"https://i.ytimg.com/vi/hIKGgm3CqWU/hqdefault.jpg"},"up_votes":9,"down_votes":5,"body":"most ridiculous thing i ever seen was going to go past him and magicial hitbox hooked him !!!\r\n\r\nfix your game this lost us the match\r\n\r\n\r\nhit the reply on it and see how it legit snapped on to target","replies":[{"poster":"Poske","date":"2019-02-13T07:07:04.429+0000","up_votes":13,"down_votes":1,"body":"Thresh hook is wider at max range its well known\n\nNow whether it should be is whole another story","replies":[{"poster":"Saevum","date":"2019-02-15T00:04:24.325+0000","up_votes":2,"down_votes":2,"body":"This.\n\nHowever, he can pull himself into the victim, that mechanic window, should be smaller.","replies":[]}]},{"poster":"KFCeytron","date":"2019-02-13T06:30:28.037+0000","up_votes":10,"down_votes":1,"body":"The edges of the hitboxes just barely touched. Since it's a tether, it visually snaps to the center when it hits, or it'd look a little weird.","replies":[{"poster":"Sleep On Stream","date":"2019-02-13T06:32:52.326+0000","up_votes":4,"down_votes":4,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=0000,timestamp=2019-02-13T06:30:28.037+0000)\n>\n> The edges of the hitboxes just barely touched. Since it's a tether, it visually snaps to the center when it hits, or it'd look a little weird.\n\ndude corki in game legit said that didnt hit me  i will perma ban this fking thresh","replies":[{"poster":"KFCeytron","date":"2019-02-13T06:59:40.763+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Sleep On Stream,realm=EUW,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=00000000,timestamp=2019-02-13T06:32:52.326+0000)\n>\n> dude corki in game legit said that didnt hit me  i will perma ban this fking thresh\n\n>.>\n\nHe was obviously incorrect. I mean, you can see the replay: it definitely did just barely hit him.","replies":[{"poster":"LeftyRaydy","date":"2019-02-14T00:15:53.415+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=000000000000,timestamp=2019-02-13T06:59:40.763+0000)\n>\n> He was obviously incorrect. I mean, you can see the replay: it definitely did just barely hit him.\n\nI looking in slow motion from 0:08 to 0:09 it does not visually hit at all.","replies":[{"poster":"KFCeytron","date":"2019-02-14T00:42:54.093+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=0000000000000001,timestamp=2019-02-14T00:15:53.415+0000)\n>\n> I looking in slow motion from 0:08 to 0:09 it does not visually hit at all.\n\nWould you prefer a thick red outline delineating every hitbox at all times? Because that's how the game actually works.","replies":[{"poster":"LeftyRaydy","date":"2019-02-14T16:13:40.681+0000","up_votes":2,"down_votes":1,"body":"look I want Skill shots to match the size of the hitboxes is that so hard to ask. I mean we should have an idea of how far we have to go to dodge since sight is the only thing were working on.","replies":[{"poster":"DrCyanide","date":"2019-02-14T16:20:17.410+0000","up_votes":3,"down_votes":0,"body":"The visuals will never fully line up with the hitboxes. League is a 2D game projected into 3D with character models and spells. It lets you have a skin with a fancy flowing cape and not get hit when a spell connects with the cape - because the hitbox is based on the *box* that the character is suppose to take up. Additionally, elevation changes mess with a users's perception of where an effect will hit.","replies":[{"poster":"LeftyRaydy","date":"2019-02-14T16:28:42.030+0000","up_votes":2,"down_votes":0,"body":"Act like this cant be done, but it definitely can. fact of the matter is there have been quite a few problematic Skill Shots that dont have visuals that match the box. There are plenty of abilities that have great hit boxes for Example Ekkos Q, W, and R show exactly where it is with Visuals. I dont think its difficult to make skill shots match hit boxes or make champions hitboxes match their character model. You make it seem like its impossible its not and it wouldnt be exactly difficult.","replies":[{"poster":"DrCyanide","date":"2019-02-14T16:32:37.087+0000","up_votes":1,"down_votes":0,"body":"You can come closer to matching, sure. But it won't ever be an *exact* match so long as character hit boxes are boxes, which is going to be as long as the game uses it's current engine.","replies":[{"poster":"LeftyRaydy","date":"2019-02-14T16:39:54.830+0000","up_votes":2,"down_votes":0,"body":"Fair enough. Its time for them to upgrade the game. They could fix so many things if rendered on the right engine. It would improve quality of the game massively. Plus I would love to see some heavily updated graphics.","replies":[]}]}]},{"poster":"smol green boi","date":"2019-02-14T20:16:21.048+0000","up_votes":3,"down_votes":3,"body":"I can't believe you're actually defending this lol. Ridiculous. The hook CLEARLY misses. Everyone who has a history of playing video games understands how hitboxes work. This case to me is completely unacceptable.","replies":[{"poster":"DrCyanide","date":"2019-02-14T20:29:33.178+0000","up_votes":1,"down_votes":0,"body":"Nothing I said was specific to this clip.","replies":[]}]}]}]}]}]},{"poster":"Jaspers","date":"2019-02-13T10:24:36.141+0000","up_votes":1,"down_votes":0,"body":"What about the first hook before that one? The one that went pass the minion but then suddenly hooked the minion?","replies":[{"poster":"KFCeytron","date":"2019-02-13T10:33:10.287+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Jaspers,realm=EUW,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=0000000000000000,timestamp=2019-02-13T10:24:36.141+0000)\n>\n> What about the first hook before that one? The one that went pass the minion but then suddenly hooked the minion?\n\nThat one hooked the minion. The one that hooked the Corki hooked the Corki. What are you even talking about? I was responding to the OP saying that his teammate denied getting hit, which is ridiculous, because either he did or didn't, and the game is the final arbiter of that decision. If the unit and spell hitboxes touch, the ability creates a tether between Thresh and the target like it's supposed to.","replies":[]}]}]}]}]},{"poster":"hrooza dota ","date":"2019-02-13T10:20:51.097+0000","up_votes":6,"down_votes":0,"body":"its not only thresh, it happen a lot with blitz (and i did it a lot with blitz lol)\n\nidk where i heard this but theres some sort of lollipop system in some skills shots where the skill shot will search in a little bigger area at the very end.","replies":[]},{"poster":"wolvius","date":"2019-02-14T13:54:58.788+0000","up_votes":3,"down_votes":0,"body":"https://youtu.be/e7WjK02UAgg\n\nImagine if thresh didn't have to relie on his team to actually kill people and had a 10 sec CD hook. \n\nThresh hook looks bad because the visual does not match the hitbox from every angle and the line just snaps to predetermined place halfway on the player model of whoever it hits.","replies":[]},{"poster":"Hamster Frank","date":"2019-02-15T11:03:46.999+0000","up_votes":2,"down_votes":0,"body":"I've not seen these kinds of past max range/off to the side hooks landing until the past month or so and now I see them every game. Never had any problems judging the hook hitboxes over the past 5+ years, never seen hooks miss but still land in 5 years of watching pro play. They probably just messed something up with the coding, since Riot is god awful. I had to google it to see if I missed an update or something because it's happening too often.","replies":[]},{"poster":"Daddy Ants","date":"2019-02-14T21:13:44.127+0000","up_votes":2,"down_votes":1,"body":"I have another very questionable scenario... this time it's {{champion:201}}.\n\nhttps://streamable.com/9ii3p\n\n\nShown this clip to people on quite a few different discord servers and most agree with me that was extremely questionable and should not have hit.\n\nEven the Kindred on the enemy team said \"WTF that hit?\"","replies":[{"poster":"Kasyrgan","date":"2019-02-15T02:27:30.913+0000","up_votes":1,"down_votes":0,"body":"It clipped a corner of your hitbox. I don't see a real problem here. The jinx's movement forced the minion to move to the side instead of heading down, and the Jinx's turns extended her hitbox beyond the minion line.","replies":[]}]},{"poster":"Daddy Ants","date":"2019-02-14T11:17:47.665+0000","up_votes":2,"down_votes":1,"body":"Thresh is getting the mana cost and cooldown increased on his hook soon.","replies":[{"poster":"Sergeant HbA1c","date":"2019-02-14T20:23:50.220+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=0005,timestamp=2019-02-14T11:17:47.665+0000)\n>\n> Thresh is getting the mana cost and cooldown increased on his hook soon.\n\nCan't happen soon enough. Riot really needs to pick up the pace with their nerfs. No one should ever reach a 30% pick and 50% win ratio.","replies":[{"poster":"Kasyrgan","date":"2019-02-15T02:23:53.484+0000","up_votes":1,"down_votes":2,"body":"18% pick rate isn't the same as 30% bud. Also, a 50% win rate on a champ with high pick rate is a good thing. You have bigger problems if you think 51% win rate on a support is a bad thing.\n\nhttps://champion.gg/champion/Thresh/Support?","replies":[{"poster":"Sergeant HbA1c","date":"2019-02-17T20:32:41.740+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kasyrgan,realm=NA,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=000500000000,timestamp=2019-02-15T02:23:53.484+0000)\n>\n> 18% pick rate isn't the same as 30% bud. Also, a 50% win rate on a champ with high pick rate is a good thing. You have bigger problems if you think 51% win rate on a support is a bad thing.\n> \n> https://champion.gg/champion/Thresh/Support?\n\nhttp://www.op.gg/champion/thresh/statistics/support\n\nThough I do not hold it against you, know that I am not just making claims willy nilly.\n\nAnd 2nd, that is quite bad. Because that means anyone can pick him for freelo. People complain once a champion goes beyond the single digit pick percentages because it means people who **_aren't mains_** are still capable of dominating a lane with the  the champion in question. It's not just the win percentage, it's the pickrate in relation to it that you have to worry about.\n\nAnd right now there is just cause for worrying.","replies":[]}]}]}]},{"poster":"Why you no like","date":"2019-02-13T10:14:47.845+0000","up_votes":2,"down_votes":1,"body":"ya that was bullshot","replies":[]},{"poster":"Kasyrgan","date":"2019-02-15T02:15:54.181+0000","up_votes":1,"down_votes":1,"body":"That's not Thresh hook being too wide. That's how hitboxes work. Champs have a square hitbox, the hook hit the corner of Corki's. That's a mechanic that anyone can use on any champ with skill shots. If Corki stayed in the same position but turned his character model slightly up or down, the hook would miss the hitbox.","replies":[{"poster":"Rathar Dashing","date":"2019-02-15T17:54:18.461+0000","up_votes":1,"down_votes":0,"body":"It's not really that, it's just the lollipop effect. Skillshots like Thresh Hook, Blitz Hook, etc. check in a circular area round their final destination, and if anything is in that extra forgiving area it hits them.","replies":[]}]},{"poster":"Its All Skillzz","date":"2019-02-15T03:11:09.414+0000","up_votes":1,"down_votes":0,"body":"{{champion:25}} \nAlso lol.","replies":[]},{"poster":"Solo Q Memes","date":"2019-02-14T22:13:39.826+0000","up_votes":1,"down_votes":0,"body":"I agree that hooks should have a hitbox to the size of the hook model itself. This is a common thing with LoL I think. Hitboxes are almost always larger than they seem. I remember being so mad playing into {{champion:420}} and dodging her Qs, or so I thought because I was outside of the outline that her tentacles make... but in reality it still hit me. Riot has fixed her hitbox since then, but when I complained about it in the boards no one agreed with me. I think this is just straight up silly. False advertising.","replies":[]},{"poster":"bluefire mark 2","date":"2019-02-14T20:28:54.123+0000","up_votes":1,"down_votes":0,"body":"Lollipop effect. All hooks have it and it is annoying as heck. Nothing that can be done.. i won't explain it.. go find... vandiril i think it was that made a video on it.","replies":[]},{"poster":"Metallikaiser","date":"2019-02-13T17:02:53.986+0000","up_votes":3,"down_votes":5,"body":"Just some standard lollipopping, it looks odd sometimes, but its needed for how thin the actual hook model is.","replies":[{"poster":"Ayzev","date":"2019-02-14T00:04:02.441+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Metallikaiser,realm=NA,application-id=3ErqAdtq,discussion-id=bKcXBTNV,comment-id=0004,timestamp=2019-02-13T17:02:53.986+0000)\n>\n> its needed for how thin the actual hook model is.\n\nMisleading visuals are the last thing anyone needs","replies":[]}]},{"poster":"VPPtrue","date":"2019-02-15T00:52:59.933+0000","up_votes":1,"down_votes":1,"body":"There are so many things like this in league, so insanely frustrating. Stuff like this happens to me **all the time**. You say in /all \"OMG THAT MISSED ME!\" and nobody believes you but here it is right in front of your eyes. It's not just {{champion:412}} it's almost every champ with skill shot similar to his. I've been wanting a fix for this for ages but people, for whatever reason, act like this is a problem that doesn't exist.","replies":[]}]}