{"poster":"Problematictroll","date":"2016-06-10T07:26:29.648+0000","title":"A Letter of Congratulations to the Creators of Malzahar","subforum":"GD","up_votes":2,"down_votes":0,"body":"I would like to dedicate this post to congratulate the incredibly well-trained team of chimpanzees that managed to create and deploy the new Malzahar rework in the absence of Morello, who will forever live on in our hearts along with everything we loved about this game that died after season 4. This is one captain I do not blame for abandoning his ship. I would specifically like to congratulate these individuals for the following accomplishments in their re-work of a once mediocre champion design:\r\n\r\nFirstly, I would like to congratulate you on your addition of a new passive ability to league of legends. The synergy of this ability with the unavoidable 2.5 second channel of Malzahar&#039;s ultimate is immediately obvious to the human brain, however I feel the need to congratulate the trainer(s) on their groundbreaking efforts to teach primates the basics of video-game synergy. Now, obviously the limitations of a chimpanzee&#039;s brain resulted in a little bit of a rough-around-the-edges design resulting in almost zero late game counter play due to the incredibly low cool-down and incredibly counter-intuitive mechanics (Malz is ulting our mid laner oh shit cc him as fast as possible oh wait he&#039;s immune to damage and cc and QSS is an AD item now), however this small setback pales in comparison to the groundbreaking discoveries made here, and I sincerely admire the dedication and work that went into training these brilliant animals.\r\n\r\nSecondly, I would like to congratulate the intuition and intelligence of our not-so-intelligent primate cousins in the transformation of Malzahar&#039;s ultimate ability and old passive. These mere animals, whose sole purpose in life was originally to smell bad and throw their own faeces at each-other, managed to make the astounding connection between pressing more than one button to do one thing and clunky feeling champions. Not only did they make this connection but they also solved it, by appending what was previously the only ability in Malzahar&#039;s arsenal that required any skill or thought to use correctly onto Malzahar&#039;s easiest to use skill, a point-and-click unavoidable 2.5 second long crowd control channel effect that is entirely negated by quicksilver sash, the item that was nerfed into the ground because it &quot;negates champion abilities&quot;. Previously, one would have to choose between using flash W on an opponent and giving them the opportunity to react and flash or dash away, or lose out on the damage and flash ult in order to secure the CC effect, this also served as a way to telegraph the ultimate and give opponents a chance to react quickly, which has for years been the single most prominent advantage of League of Legends when compared to its competitors; fast paced, mechanically intensive game-play. Now this interactive instance of fast-paced and fun game-play is gone from League of Legends forever. One may criticise these monkeys for their lack of foresight and blatant inconsistency of their reasoning, however one must understand that the training of primates to perform advanced human jobs is still very new and exciting and, much like Volcanic Cauldron, may never be entirely complete due to the intricacy of the task at hand. I firmly believe that this is an exceptional achievement and these primates and their trainers should be commended for their almost human levels of intuitive thinking.\r\n\r\nThirdly, I was going to comment on how boring and useless the new W is but it really doesn&#039;t change anything and I can&#039;t think of anything even remotely witty to say about it so I&#039;ll pass. It was not quite an evil, although it was still a stupid idea. To use the wording of everyone&#039;s favourite departed rioter, Riot &#039;Cuck&#039; Lyte, it&#039;s an example of neutrality rather than toxicity.\r\n\r\nIn summation, please end your lives. Playing against your cancerous design makes me want to end mine.\r\n\r\nThank you.","replies":[]}