{"poster":"TuteeUnited","date":"2016-07-28T07:01:08.038+0000","title":"[Ayuda] Como empezar en los eSports?","subforum":"Esports","up_votes":2,"down_votes":0,"body":"Hola. mi nombre es Mateo, como veran soy de Argentina,tengo 15 a&ntilde;os juego league of legends, me interesan muchos los esports, a diferencia de toda la gente que conozco al mi alrededor que solamente rankea para pasar el rato y no se lo toma en serio. Yo si empre aconsejo que jueguen normals para eso. , jugue unas veces en team y la verdad me manejo muy bien en cuanto a comunicacion/objetivos/focus, mis lineas mains son mid y top, aunque juego todas las lineas, la que menos juego es support, los champs con los que mas me manejo son:\r\nAzir.Riven,Zed, Ekko,Ahri Jinx,Ashe. Lux, , Janna.Alistar,Syndra, LeBlanc\r\nquiero saber que se necesita para meterse en los esports ya que estoy muy entusiasmado, tengo algunos videos aca:\r\nhttps://www.youtube.com/channel/UCnFlCsuuRbZ-bgc85aUEtUQ\r\n https://www.facebook.com/TuteeUnited/?ref=settings\r\n\r\nMe gustaria que alguien de riot games mas que nada me de info. \r\n\r\nSaludos!","replies":[{"poster":"LastHope17","date":"2016-07-28T07:12:08.521+0000","up_votes":1,"down_votes":0,"body":"Si sos plata no vas a poder, para entrar a los e-sports segun tengo entendido tenes que llegar a Diamante o mas y formar un equipo para participar de los torneos que se hicieron hace unos meses(? a lo mejor la flasheo","replies":[{"poster":"5RK Herca","date":"2016-07-28T22:48:05.269+0000","up_votes":2,"down_votes":0,"body":"Puedes jugar torneos siendo hasta bronce, hay torneos por ligas como lo hace VGL.\n\nPara iniciar en e-sport, solo debes tratar de mejorar y subir divisiones. Para luego crear un team y estructurarlo o postularte a uno que ya esta en la escena competitiva.","replies":[]},{"poster":"Bustatos xD","date":"2016-07-28T11:37:27.744+0000","up_votes":1,"down_votes":0,"body":"Realmente esa informacion de diamante esta mal puedes ser bronce 5 y estar en la lcs","replies":[]}]},{"poster":"Dobry","date":"2016-07-28T14:08:39.265+0000","up_votes":2,"down_votes":0,"body":"Para comenzar en un ambito \"amateur\" puedes ir al foro de reclutamiento que normalmente crean teams con el proposito de mejorar cómo equipo y ganar experiencia.\n\nPero si quieres realmente jugar a un nivel superior para eso principalmente debes ser alguien de un ELO alto, con disponibilidad horaria amplia y tomarselo serio, ademas de obviamaente mainear un rol clave.","replies":[]},{"poster":"HyenaLoL","date":"2016-07-28T11:20:23.422+0000","up_votes":2,"down_votes":0,"body":"Primero que nada tu destreza mecanica tiene que ser igualada como mucho por el 0,02% del servidor(Challenger). Podes probar estando en Diamante pero te vas a trabar en el nivel amateur y de ahi no vas a salir.\n\nDe ahi te buscas un equipo. Podes armarlo con gente que te cruzaste en soloq (generalmente duran 1 semana a 1 mes o hasta el 1er torneo que juegan, despues se disuelve) o buscar un team ya establecido entre el nivel amateur.\nVeanse Guerreros del Mouse,Team Infernal, Dinasty Gaming, o las canteras como Play Again (cantera de kmv) y de ahi tenes que lograr que reconozcan tu nivel como jugador de equipo\n\nPor ultimo SIEMPRE demostrar que tu actitud es suficientemente madura para jugar en un equipo. A nadie le va a servir un chabon que madea, insulta a su equipo, amenaza com irse del team, etc a la primera mala racha.\n\nEso si hablabas de ser parte del rooster de un equipo.\nEn cuanto a organizacion de eventos es otra forma de participar en esports.\nTambien podes aprender a analizar partidas(no requiere que seas challenger, pero tenes que saber mas del juego que uno) o coachear,(requiere un conjunto de destrezas muy variado)\nPodes intentar ser caster.\nHay de todo","replies":[]},{"poster":"LoLGas5","date":"2016-08-11T17:23:07.812+0000","up_votes":1,"down_votes":0,"body":"Primero que todo tenes que llegar a diamante alto (por lo menos D2 o D1) ya que la mayoria de jugadores que compiten oficialmente estan en esa liga.\nY despues recien pensar en buscar un equipo y aprender a jugar en equipo.\nY si queres que te llame algun equipo profesional, tenes que llegar a challenger obligatoriamente.\n\nPensa que tenes que sobresalir sobre casi todos los jugadores de la región para estar a un nivel competitivo.\nImaginate el lol como el futbol, y pensa en la primera de división de argentina. Para llegar a una liga superior tenes que brillar en los mejores equipos del futbol argentino y asi llegar a mejores equipos.","replies":[]},{"poster":"Tiffen","date":"2016-07-28T13:20:05.489+0000","up_votes":1,"down_votes":0,"body":"Si queres probar lo que es un team , y el aspecto competitivo, armate un equipo o sumate a alguno y empezar a jugar a los torneos organizados por la comunidad http://events.las.leagueoflegends.com/","replies":[]},{"poster":"Lunari Red Mask","date":"2016-07-28T08:14:59.352+0000","up_votes":1,"down_votes":0,"body":"A todo el mundo le emociona participar en torneos y cosas, pero para eso primero hay que subir. Lo recomendable es simplemente que sigas rankeando hasta que estes en una liga alta. Entonces re-planteate esto. Ahora sí no llegas a liga alta... entonces simplemente buscate otro sueño.","replies":[]},{"poster":"Little T","date":"2016-07-28T07:09:42.430+0000","up_votes":1,"down_votes":0,"body":"yo que vos mejoro un poco el farm antes que nada :v","replies":[]}]}