{"poster":"Azmodanno","date":"2015-04-28T22:49:25.372+0000","title":"Consigli roster campioni in jungle","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Ciao a tutti ragazzi, mi chiamo Azmodanno e gioco dalla season 3. Dopo un inizio di avventura in bronzo, tanti santi scomodati e una riflessione pesante su lol sono riuscito a giungere in gold 5. Il mio biglietto di uscita dagli inferi del silver si chiama Hecarim {{champion:120}} . Ci ho giocato innumerevoli games, lo conosco come le mie tasche ormai, lo considero &quot;un amico&quot; in questo gioco. Quando ho in mano Hecarim so di poter vincere pesantemente (non lo dico intendendo &quot;sono fortissimo&quot;, lo dico come questione di fiducia). Questo e aver smesso di incazzarmi per quello che alla fine &egrave; comunque un gioco. Ma veniamo alla questione...\r\n\r\nMaino jungle, ma devo ammeterlo, ho un grande limite verso alcuni campioni. Se non provo empatia non li uso. E, non so perch&egrave; sinceramente, odio profondamente jungler come vi o lee sin (quelli un po&#039; mainstream insomma). Ho per&ograve; una grande perplessit&agrave;.\r\n\r\nAd esempio, se picko Hecarim ci sar&agrave; la partita dove sar&ograve; un heca utility, un&#039;altra in cui sar&ograve; un hypercarry, una in cui sar&ograve; solo un gigantesco tank. E&#039; un champ versatile grazie al cielo. In ogni caso riesco o comunque cerco di dare un aiuto concreto al mio team. Lo stesso vale con la mia alternativa J4, o con Sion. Nella mia esperienza per&ograve; ho amato tantissimo {{champion:107}} , {{champion:80}} ,{{champion:131}}  e {{champion:23}} , tutti in jungle e con risultati soddisfacenti. Ultimamente per&ograve;, normal o ranked che sia, con loro non combino pi&ugrave; un morde..cazzius. Che io sia 15/0 o 4/4, sento di avere pochissimo impatto sulla partita, soprattutto giunti in late game. Che dite &egrave; un mio problema di gioco? in questa patch sono un po&#039; sfigati? &egrave; la meta attuale a non beneficiarli? Devo assolutamente provare qualcosa?\r\n\r\nAccetto consigli spassionati da chiunque, vi ringrazio in anticipo!\r\n\r\np.s Sto utilizzando Nautilus qualche volta, divertentissimo e utilit&agrave; pazzesca!","replies":[{"poster":"Dantazzo","date":"2015-04-29T07:10:11.346+0000","up_votes":2,"down_votes":0,"body":"Io ti consiglio\n{{champion:14}}  semplicemente un freelo train\n{{champion:113}}  personalmente non la gioco ma è uno dei migliori jungler al momento\n{{champion:254}}  sempre buona\n{{champion:31}}  lo sto provando ultimamente, è simpatico.","replies":[]},{"poster":"BluFoxer","date":"2015-04-29T05:06:21.896+0000","up_votes":2,"down_votes":0,"body":"Concordo con the awesome, ma ti potrei consigliare anche un Fiddle, ovviamente non è un tank, ansi, io ormai lo uso più in mid che in jungle. Ciò non toglie che quando lo uso jungle ho comunque buoni score e buone partite. Ovviamente io maino questo champ perciò è solo \"un'informazione\" che ti do.\nUltimamente vedo molti {{champion:32}} in giungla, sono dei buoni tank e con discreti cc.\nPotresti orientarti su di un {{champion:106}} che è quando esce dal bush a quattro zampe ti fa cagare sotto. \nBuona fortuna.\n{{champion:9}}","replies":[]},{"poster":"BioS iP","date":"2015-04-30T02:02:18.494+0000","up_votes":1,"down_votes":0,"body":"Sappiamo benissimo che non tutti i champion scalano allo stesso modo, per cui non tutti possono essere ugualmente incisivi in determinate comp.\nAd esempio se hai contro {{champion:67}}  non pickerai {{champion:57}} , punterai su {{champion:80}} /{{champion:254}}  chiudendola il prima possibile.\nCapisco che non ami i champion mainstream, però bisogna ammettere che, spesso, sono quelli con maggiore efficacia.\n\nLa maggior parte dei jungler sono molto forti in early, fortissimi in mid-game e decenti in late, solo se fatti tank. Purtroppo nessuno di quei jungler che hai elencato può competere con una composition che protegge l'ADC, per cui sarai necessariamente poco incisivo nelle fight dal 35-40 in poi, per cui conviene farsi tank-utility per incidere, a meno che non hai {{item:3714}} e provi a prendere qualcuno fuori posizione.\nNon a caso i migliori late-game jungler sono quelli con un buon reach, elevata utility o noncuranza dei CC, mi spiego:\n\n1. The Monkey King: {{champion:62}} : si può buildare in diverso modo, da full tank se behind a full AD se feddato. Nel 90% dei games mi ci feddo malissimo tra il 3 e il 6, per cui scelgo questa build: {{item:3078}} {{item:3714}}({{item:3717}} se necessiti vita; {{item:3707}} se ritardi la tirnity force o pensi di fare i mercury) {{item:3074}} {{item:3071}} {{item:3035}}  {{item:3269}} ({{item:3284}}  se hanno solo slow). \nQuesta build necessita un tank che possa ingaggiare nel tuo team, ma avrai 140 Armor, 140  Magic Resist, circa 3000hp, bi-shot su qualsiasi adc/apc + possibilità di fight contro qualsiasi tank!\nCombo semplice: appena inizia la fight e vedi il posizionamento di adc e apc, vai di E dentro, R, applichi TBC ==> W attendendo i cooldown ==> E - Q e gg, fatte almeno 2 kills(ricorda sempre l'AA, se possibile, scandito dal tempo di recupero dello {{item:3057}} )\nPS: attenzione a come fai la giungla in early...un pull troppo \"leggero\" ti potrebbe costringere al recall subito dopo il primo buff, se non resetti bene i cooldown\n\n2. {{champion:11}} : semplciemente unbalanced, se giocato con la giusta attenzione(e build molto diverse in base allo stile di gioco). Guarda Cowseep su Twitch...ci sono troppi gameplay diversi per spiegarli qui in poche parole(richiede un'abilità elevata per schivare i CC e usare il reach nel giusto momento, ma i danni compensano la scarsa utility)\n\n3. {{champion:77}}, comunemente GODyr : il nome dice tutto; {{item:3717}} {{item:3078}} {{item:3110}} {{item:3065}} (boots tra {{item:3262}} {{item:3282}} {{item:3269}} ). Il 6° item dipende molto dalla partita...spesso potrebbe servirti la {{item:3153}}(se fenice) ma anche {{item:3072}} e {{item:3074}} sono giocabili(se tigre)\n\n4. {{champion:113}} , {{champion:79}} , {{champion:19}} , {{champion:54}}  e {{champion:32}}  non credo necessitino spiegazioni. WW e Malphite sono fuori meta(uno per lentezza, ecc ecc; l'altro perché meno tank di tanti e forte principalmente contro champion da AA, i quali non vanno troppo \"di moda\") ma possono fare fare da hard-carry facilmente. Non li spiego essendo tu un Season 3 player e conoscendoli, di conseguenza, fin troppo bene.\n\n5. {{champion:106}}  early god, mid meh, late very good. Il vero problema di questo champion è il sustain nelle fight prolungate. Senza passiva sei un orso morto. Consiglio {{item:3717}} {{item:3078}} /{{item:3153}} (la prima se devi shottare il carry; la seconda se sono molto tankosi gli avversari) {{item:3800}} {{item:3110}} {{item:3265}} (dato che soffri moltissimo i cc) {{item:3065}} (tra passiva, Health Regen propria, in combo con la {{item:3153}} )/{{item:3156}} (veramente ottima se contro i vari {{champion:30}} , {{champion:8}} , ecc o in combo con la {{item:3078}} )\n\n6. {{champion:2}} pessimo early, quasi indecente mid ma devastante late. Buono solo nelle fight se giocato con un assassin che possa seguirti per shottare adc/apc. Una build equilibrata in stile Volibear ma con {{item:3074}} alternativa alla {{item:3153}} lo rende un flagello. \n\n7. {{champion:72}} : simile a Volibear per scale e build. Devastante se il loro team ha un solo champion da danno sostenuto(ex: hanno un ottimo adc ma un mid in stile Nidalee, ecc)\n\n8. {{champion:9}} : attualmente utile quanto WW, uscito dal bronzo non c'è jungler che ti faccia avere vita facile. Se hai un team che annovera {{champion:58}}, {{champion:89}} , {{champion:104}} e {{champion:127}} può andare molto bene, in caso contrario te lo sconsiglio vivamente!\n\n\n**Ripeto che ho inserito solo champion da late game e build per fare late-game carry**\n(non ho messo {{champion:120}} perché è il tuo main e {{champion:107}}  perché meriterebbe una discussione a parte per ogni singolo item e tipo di build, molto più di {{champion:11}} )\n**Ovviamente le build sono in base al mio stile di gioco e sono estremamente situazionali**: non ha molto senso farsi la {{item:3065}} se non hai AP contro...magari andrai su una {{item:3075}} o, ancora meglio, {{item:3026}}  per avere maggiore presenza/controllo degli obiettivi(specialmente con champion con Olaf difficilissimi da uccidere una volta, figuriamoci 2!)\n\n\nPer dubbi/chiarimenti non esitare a rispondere\n\n\nPS: {{champion:64}}  sta soffrendo mostruosamente la meta tank-utility. prima perdeva in late mentre ora, causa Cinderhulk, perde già dal medio mid game(quindi verso il 25), senza considerare il forte nerf alle sue resistenze che non gli permette più di essere un off-tank degno di questo nome. Se non sei smurf/ex pro player/challenger/jungler in team ranked, lascia perdere quel povero cieco!","replies":[{"poster":"Azmodanno","date":"2015-04-30T08:28:38.114+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio dei consigli, Godyr era sulla lista delle cose da fare, ti dirò che master yi è sgravatissimo, non perchè lo consideri un noob champ, ma perchè usato conc ervello fa davvero i buchi. In ogni caso grazie del feedback ;)","replies":[{"poster":"BioS iP","date":"2015-04-30T13:28:10.458+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Azmodanno,realm=EUW,application-id=MJVj50Jw,discussion-id=PcUIvqFG,comment-id=00040000,timestamp=2015-04-30T08:28:38.114+0000)\n>\n> Ti ringrazio dei consigli, Godyr era sulla lista delle cose da fare, ti dirò che master yi è sgravatissimo, non perchè lo consideri un noob champ, ma perchè usato conc ervello fa davvero i buchi. In ogni caso grazie del feedback ;)\n\nDi niente!\nRicorda che Yi ha diversi modi per essere buildato, per cui richiede maestria principalmente nel capire le power-spikes","replies":[]}]}]},{"poster":"TheAwesomeJ","date":"2015-04-28T23:57:10.295+0000","up_votes":1,"down_votes":0,"body":"Penso di trovarmi un pò nella tua stessa situazione\nA parer mio  {{item:3717}} a causa di quest'item la jungla è attualmente in mano a tank - offtank predisposti per un lategame potente. \nSejuani, Hecarim, Gragas e Vi sono tutti campioni che ti aprono il sedere e ci soffiano dentro nonostante abbiano 5k di vita xD\nQuindi tank bruisers con cc e danni ad area è il new meta.\nCiò NON toglie , per carità, che la skill faccia la sua parte! Anzi, si  vede spesso gente usare una sejuani per adeguarsi al meta e sukare pesantemente.\n\n\n\n\n\nPer esempio Pantheon, l'ho utilizzato tantissimo, ma penso che ora abbia bisogno di riposo perchè quella frase \"perde potenza nel late game\" ora si sente più che mai. \nMa comunque ogni anno, ogni season i champ cambiano, questa S5 ormai è così.\nSe vuoi qualche consiglio, io ora mi sto trovando bene anche con:\n{{champion:421}} La regina dei brutti ha un'utilità tutta sua, bisogna prenderci la mano.\n{{champion:48}}  con {{item:3717}} {{item:3800}} {{item:3143}} è mostruosamente forte nei fight.\n{{champion:28}} strano ma vero, la gente si è dimenticata come si countera!\n\n\n\nBenvenuto nella confraternita degli haters di lee! Anche io stesso pregiudizio :)","replies":[{"poster":"Azmodanno","date":"2015-04-30T13:16:27.483+0000","up_votes":1,"down_votes":0,"body":"Finalmente qualcuno che la pensa come me su quel fot.... cieco ahah! In ogni caso grazie anche a te dei consigli, dopo questa capatina nel forum ho provato un po' di roba, compreso {{champion:80}}  FULL armor pen e ti dirò, in late sfonda comunque felicemente gente con 5k di vita D:","replies":[]}]},{"poster":"ottemoam69","date":"2015-04-30T09:17:26.217+0000","up_votes":1,"down_votes":0,"body":"MA SCUSATE, IL SOMMO {{champion:75}} DOVE LO METTIAMO?\n\n\n{{champion:115}}","replies":[{"poster":"Azmodanno","date":"2015-04-30T13:12:44.255+0000","up_votes":1,"down_votes":0,"body":"Mi spiace ma giocare Nasus jungle in questo momento è come lasciare la tua squadra 4v5 per 40 minuti. Non perchè non possa funzionare, ma perchè mentre zappi campi su campi il jungler avversario ha gankato 218 volte..come minimo!","replies":[]}]},{"poster":"White Winston","date":"2015-04-29T08:12:26.616+0000","up_votes":1,"down_votes":0,"body":"Anche io gioco spesso in giungla. Questi sono i champ che ho giocato maggiormente:\n{{champion:32}} : ha un lategame mostruoso! Peccato però che se becchi qualcuno che lo conosce, sa benissimo che per counterarlo basta fare qualche incursione in giungla pre-6 (magari con la kill o con il blue), per escluderlo quasi completamente dal gioco. Se worka è favoloso ma se te lo counterano è davvero frustrante!\n{{champion:60}} : difficile. Secondo me richiede un sacco di partite prima di mainarla bene...e io non ho tutto quel tempo! :)\n{{champion:77}} : strepitoso. Carria le partite da solo! Anche qui però bisogna stare attenti...squadre avversarie con tanto cc riescono a counterarlo bene in teamfight e ad evitare il focus sul carry. \n{{champion:57}} : per ora il migliore che ho giocato. Tanka, danni discreti e ha un focus esagerato (W+Q easy sul carry avversario). Inoltre ha una ulti che porta tanta utility in teamfight.\n{{champion:62}} : bruiser tra i migliori del game. La sua ulti la conoscono tutti...c'è poco da dire! (unica pecca non ha sustain...)","replies":[]}]}