{"poster":"Snowgen","date":"2017-04-23T16:37:22.091+0000","title":"Schlechte Drafts","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":8,"body":"Guten Tag meine lieben Beschw&ouml;rer,\r\n\r\nIch hatte mal Bock auf ne kleine Diskusionsrunde, und zwar interessiert mich das Thema &quot;schlechter Draft&quot;.\r\nHierbei m&ouml;chte ich mich nur auf die Solo Q beziehen, da ich selbst in Normals nicht tryharde. \r\nFolgendes Szenario als Beispiel, jeder hat damit die Erfahrung gemacht. \r\n&quot;Full AD ohne Frontline&quot;\r\nMidlane pickt z.B Zed, Jungler AD Assasin/Bruiser, Botlane standart ad /supp \r\nSo der last pick sieht unsere Comp , pickt dann trotzdem Yasuo / Riven .\r\nDie Frage die ich mir bei solchen  Situationen stelle ist &quot;Warum...?&quot; Hierbei nehme ich die OTPs raus, die k&ouml;nnen nichts daf&uuml;r ( mehr oder weniger) , dass sie nur einen Champion spielen k&ouml;nnen. \r\n\r\nDas oben genannte Beispiel kann man auch durch andere &quot;schlechte &quot; Comps ersetzen , mir geht es ledeglich um die Frage, wieso die Leute generell schlecht draften. Versteht mich nicht falsch, es passiert jetzt nicht jedes Game, aber gef&uuml;hlt schon des &ouml;fteren. \r\n\r\nAuch ist mir bewusst, dass man mit jeder Comp gewinnen kann, ist ja solo Q( dementsprechend auch mit jeder guten Comp verlieren). Aber dennoch verstehe ich nicht ganz wieso sich Leute ein Game extrem schwer machen wollen, wenn es auch einfacher geht bzw Teamorientierter. \r\nDer Hauptgrund wird wohl sein, dass die Leute einfach KB haben sich dem Team anzupassen. Aber flamen , dass das Team schlecht ist, geht dann nat&uuml;rlich immer.  \r\n\r\nVllt ist es auch in der h&ouml;heren Elo anders, da ich mich selbst in einer eher niedrigen Elo befinde ( Low Dia ). \r\n\r\nMich w&uuml;rde eure Meinung dazu interessieren :)\r\n\r\nAnsonsten noch einen sch&ouml;nen Sonntag\r\n\r\nmfG\r\n\r\nSnowgen","replies":[{"poster":"Kleensori","date":"2017-04-23T21:09:16.551+0000","up_votes":2,"down_votes":0,"body":"Viele Leute denken auch, dass es unglaublich wichtig ist selber damage drücken zu müssen, um sein Team carrien zu können. Deswegen kann der Lastpick ja keinen Tank nehmen ;)","replies":[]},{"poster":"SSI CptHaunted","date":"2017-04-23T17:31:46.563+0000","up_votes":2,"down_votes":0,"body":"So wirklich darauf reagieren kann man ja leider nur wenn man 4./5. Pick ist. Passiert schließlich oft genug dass die Leute was anzeigen und dann doch was Anderes spielen oder der Gegner den Champ vorher pickt, daher spiele ich wenn ich früh auswählen darf/muss das was ich spielen will.\n\nWenn dann natürlich sowohl Top als auch Supp und Jungle ADs picken die man eher nicht tanky spielt...kann zwar schon klappen, aber eher unwahrscheinlich.","replies":[]},{"poster":"Maíko","date":"2017-04-24T08:13:16.379+0000","up_votes":2,"down_votes":1,"body":">So der last pick sieht unsere Comp , pickt dann trotzdem Yasuo / Riven .\nDie Frage die ich mir bei solchen Situationen stelle ist \"Warum...?\" \n\nWarum versucht man den Last-Pick dazu zu zwingen sich dem Team anzupassen?\nDann sollen die halt davor schon eine richtige Comp draften.\n\n>Aber dennoch verstehe ich nicht ganz wieso sich Leute ein Game extrem schwer machen wollen, wenn es auch einfacher geht bzw Teamorientierter.\n\nSie machen es sich nicht schwerer, sondern leichter.\nWenn sie Champions picken mit denen sie sich wohlfühlen ist es wesentlich leichter für sie gute Leistungen zu erbringen und dem Team somit zu helfen.\n\n>Der Hauptgrund wird wohl sein, dass die Leute einfach KB haben sich dem Team anzupassen.\n\nAlle für einen und einer für Alle....das Team könnte sich auch einfach an ihn anpsassen.\n\n>Mich würde eure Meinung dazu interessieren :)\n\nIch habe lieber einen 10/0 Jayce auf der Toplane, als einen 0/10 Maokai der von Fizz zerrissen wurde.\nDie Leute sollten spielen, was ihnen Spaß macht und womit sie am besten zurecht kommen.\nWenn andere versuchen ihnen bestimmte Rollen aufzuzwingen sollten sie diese wohl am besten selbst übernehmen.\nEs gibt für jede Position Tanky Picks...das muss man nicht auf die Toplane abwelzen...auch kann man Ziggs auf der Botlane spielen, wenn das Team Full-AD geht.\nWenn man selber nur versucht seinen Willen durch zu bekommen und versucht das Team dazu zu zwingen sich anzupassen, wird nie ein guter Draft entstehen.","replies":[{"poster":"Snowgen","date":"2017-04-24T11:22:10.714+0000","up_votes":1,"down_votes":3,"body":"Hier war nie die rede von  zwingen. Die ersten Picks können schlecht riechen ,  was die letzten picken wenn keine picks vorgeschlagen werden oder keine Kommunikation statt findet.","replies":[{"poster":"Sirrkas","date":"2017-04-24T12:44:32.858+0000","up_votes":1,"down_votes":0,"body":"Die ersten Picks könnten dann ja fragen, was die anderen spielen wollen und damit die Kommunikation einleiten.  Wenn das Team schlecht aufgestellt ist, sind alle gleichermaßen daran schuld.","replies":[{"poster":"BlackSkyLane","date":"2017-04-24T21:42:54.511+0000","up_votes":1,"down_votes":3,"body":"Snowgen, belass es diese community wird sich nur selbst ins aus schiesn es gibt in leag nichtmehr so viele spieler hier das forum paar auserhalb in 2-3jahren ist leag denke ich mal weg vom fenster, wieso weshalb siehe mit offenen augen du wirst bemerken wieso:)\nleute der höheren elo meinen vieles ist gut und merken nicht wie sie sich selbst ins aus schiesen :) tipps klar flame genauso, und diese besser wisserei zb wie lang das noch gut geht lach in dem sinne bis bald^^","replies":[]}]}]}]},{"poster":"xXTheFalloutXx","date":"2017-04-23T20:59:49.184+0000","up_votes":1,"down_votes":0,"body":"Nun, es gibt aber Champions, die passen in jede Comp, größtes, und im moment mein einziges, Beispiel it Twisted Fate, egal ob Tank/OnHit/AP/Utility/AD alles ist mit ihm möglich und ich spiele Oft Twisted Fate im Jungle und maine ihm sogar ich weiß es also. ^^","replies":[]},{"poster":"eingew","date":"2017-04-23T17:12:15.303+0000","up_votes":1,"down_votes":0,"body":"> Auch ist mir bewusst, dass man mit jeder Comp gewinnen kann, ist ja solo Q( dementsprechend auch mit jeder guten Comp verlieren). Aber dennoch verstehe ich nicht ganz wieso sich Leute ein Game extrem schwer machen wollen, wenn es auch einfacher geht bzw Teamorientierter.\n\nIch denke mal, dass es vielleicht sogar noch \"schlimmer\" ist, dass die Leute nicht nur keine Lust haben, sich an das Team anzupassen, sondern vielleicht gar nicht groß drüber nachdenken, dem keinen Effekt beimessen oder gar nicht wissen, wie eine gute Combo aussieht. Das Unwissen wird wohl zunehmen, je niedriger die Elo ist. Also... ich zum Beispiel hätte abgesehen von der Auswahl tanky vs squishy keinen Plan, wie ich noch mehr gute Synergien ins Team bringe.\n\n> Der Hauptgrund wird wohl sein, dass die Leute einfach KB haben sich dem Team anzupassen. Aber flamen , dass das Team schlecht ist, geht dann natürlich immer.\n\nWenn alle dieses Maß an Selbstreflektion an den Tag legen würden, würde das noch ne ganze Menge anderer Probleme lösen :D.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2017-04-23T17:07:53.870+0000","up_votes":1,"down_votes":0,"body":"Du hast doch keine Ahnung, was wirklich besser wäre.\nKlar, Full-AD ist meistens schlecht.\nAber wenn die Spieler z.b. keinen AP-Champ spielen, oder mit den AP-Champs, die sie theoretisch können, das entsprechende Matchup nicht beherrschen, dann ist Full AD besser als wenn du einen Mage dazunimmst.\nDas hat nichts damit zu tun, dass sie kein Bock darauf hätten, sich dem Team anzupassen.\n\nDarüber hinaus ist die Teamcomp in der Soloq ziemlich unwichtig.\nUnd sich über die stärke eines Champ an sich Gedanken zu machen, ist nichts als verschwendete Zeit.","replies":[{"poster":"Snowgen","date":"2017-04-23T22:34:58.617+0000","up_votes":1,"down_votes":3,"body":"Das sehe ich nicht so . Ich habe die OTPs ja nicht mit einbezogen , aber normalerweise kann jeder auf seiner lane 3-5 champs spielen. Muss ja nicht das Full ad team sein, kann jedes Beispiel sein. \nBringt nichts einen Champ zu spielen den man drauf hat, wenn es dem Team nichts bringt und man sowieso useless im late ist. Ich habe lieber einen nicht so guten Spieler der sich dem Team anpasst, als einem etwas besseren Spieler, der dem Team nichts bringt. \n\nGenau wegen solchen leuten wie dir entstehen so schlechte drafts. Sich keine Gedanken machen und sinnlos irgendwas picken, standart Mentalität der Solo Q.","replies":[{"poster":"hshtagniemehrcdu","date":"2017-04-24T06:29:47.699+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Snowgen,realm=EUW,application-id=KYnfKGf0,discussion-id=VJuNLlEA,comment-id=00010000,timestamp=2017-04-23T22:34:58.617+0000)\n>\n\n> Bringt nichts einen Champ zu spielen den man drauf hat, wenn es dem Team nichts bringt und man sowieso useless im late ist. Ich habe lieber einen nicht so guten Spieler der sich dem Team anpasst, als einem etwas besseren Spieler, der dem Team nichts bringt. \n\nTja, da bevorzuge ich das genaue Gegenteil.\nBringt nichts, sich \"anzupassen\" wenn man dann schlechter spielt.\nDas schadet dann imho mehr als es nutzt und ist somit genau nicht \"teamorientiert\".","replies":[]}]}]},{"poster":"Roxãs","date":"2017-04-23T16:44:41.730+0000","up_votes":1,"down_votes":0,"body":"Dieser Moment wenn ein Diamond Spieler sagt er hätte low Elo. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Atsùra","date":"2017-04-23T16:52:34.890+0000","up_votes":1,"down_votes":0,"body":"da fühlt man sich wie die Ratten aus Titanic... und low dia sind dann Jack und Master/Challenger sind die Rosetypen... meh\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"eingew","date":"2017-04-23T17:06:02.366+0000","up_votes":1,"down_votes":0,"body":"Naja ist halt Definitionssache. Wenn man High-Elo als statistische Ausreißer definiert, dann ist Dia5 definitiv noch Low-Elo. High-Elo würde eher ab Dia 2 beginnen. Und die meisten halten High-Elo für fast allen Spielern überlegen, Ausreißer würden darauf einfach am besten zutreffen.","replies":[]}]},{"poster":"Snowgen","date":"2017-04-23T22:36:45.758+0000","up_votes":1,"down_votes":2,"body":"Naja wenn man solange in low Dia rum gurkt wie ich, dann sieht man das irgendwann als nichts besonderes mehr an :D. Denke das jeder das Zeug dazu hat Dia 5 zu erreichen mit gewisser Disziplin und regelmäßigem zocken.","replies":[]}]}]}