{"poster":"Snowgen","date":"2018-02-01T22:30:44.410+0000","title":"Pleb Gaming sucht Toplaner [D5+] für Flex Q, Cups usw.","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Einen wundersch&ouml;nen guten Morgen/Tag/Abend w&uuml;nsche ich euch.\r\n\r\nWir, das Team Pleb Gaming, suchen einen neuen Toplaner, um f&uuml;r die kommende Season wieder als Team durchstarten zu k&ouml;nnen.\r\nDoch zun&auml;chst ein paar Worte zu uns:\r\n\r\nDas Team Pleb Gaming wurde im Sommer 2017 gegr&uuml;ndet. Dadurch, dass uns der Toplaner im Dezember verlassen hat (Aufgrund von Meinungsverschiedenheiten im Bezug auf Ziele), haben wir uns dazu entschlossen, eine kleine Pause zu machen. Jetzt m&ouml;chten wir wieder durchstarten, um perfekt f&uuml;r die neue Season vorbereitet zu sein. Deshalb vorweg: Wir m&ouml;chten NICHT full tryhard gehen, sprich keine EPS oder &auml;hnliches spielen. Unser Ziel ist es, auf einem Hobbym&auml;&szlig;igem Competitive Level zusammen zu spielen und zu improven. Der Spa&szlig; am Spiel soll darunter aber nicht leiden. Synergie unter den Mitspielern ist unsere gr&ouml;&szlig;te Priorit&auml;t.\r\n\r\nUnser aktuelles Roster:\r\n\r\nToplane: gesucht\r\nJungle: Diamond 4\r\nMidlane: Diamond 4/ Platin 2\r\nADC: DIamond 5\r\nSupport: Diamond 5\r\n\r\nDa wir vorher auf der Midlane doppelt besetzt waren, haben wir einen zweiten Midlaner (Sub).\r\n\r\nTrainingsablauf:\r\nGeplant sind 3-4 Nachmittage/Abende Pro Woche (Ab 17:00/18:00 Uhr). DIe Zeiten und Tage werden im Team zusammen besprochen und festgelgt. Im Normalfall werden 3 Runden Flex Q pro Trainingseinheit gespielt. Sollte sich mal ein Scrim ergeben, k&ouml;nnen wir nat&uuml;rlich auch auf diese Option zur&uuml;ck greifen. Ausserdem m&ouml;chten wir gerne Pro Woche einen Cup spielen(sofern es sich einrichten l&auml;sst). Die Trainingseinheiten werden mit Hilfe von Whatsappgruppe und Google Doc organisiert.\r\n\r\nAnforderungen an dich:\r\nDamit das ganze auf lange Sicht klappt, haben wir als Team nat&uuml;rlich auch gewisse Anforderungen an dich:\r\n\r\n   - Solo q Mindestens Diamond 5 (keine Ausnahmen m&ouml;glich)\r\n   - die gesuchte Rolle seit l&auml;ngerer Zeit mainen (Keine Allrounder)\r\n   - ausgewogener, metabezogener Championpool (keine OTP&#039;s)\r\n   - mindestens 18 Jahre alt sein (Keine Ausnahmen m&ouml;glich)\r\n   - Aktiv in League sein (Auch ausserhalb vom Teamtraining eigenst&auml;ndig spielen)\r\n   - Kritikf&auml;higkeit besitzen\r\n   - Teamspeak + Mic\r\n   - freundliches Auftreten\r\n   - Ehrgeiz und den Willen zum improven besitzen\r\n   - Teamerfahrung ist KEIN muss (wenn du jahrelang Solo q gespielt hast und mal Bock auf ein bisschen competitive Erfahrung hast, bist du nat&uuml;rlich auch herzlich eingeladen)\r\n\r\nAblauf der Tryouts:\r\nZun&auml;chst sammle ich alle Bewerber und unterhalte mich mit jedem ein bisschen um mir einen ersten Eindruck von den Spielern zu machen. Anschlie&szlig;end beginne ich dann die Tryouts zu planen und versuche so vielen Leuten wie m&ouml;glich eine Chance zu geben. Ich werde euch aber allen aufjedenfall bescheid geben. Jeder Tryout wird eine Trainingseinheit lang getestet (3 Runden Flex).\r\n\r\nSollte ich dein Interesse geweckt haben und du dich bei Pleb Gaming siehst, dann adde mich einfach Ingame (Snowgen), oder schreib mir eine Bewerbung per E-mail (ripdawid2014@gmail.com).\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nSnowgen","replies":[]}