{"poster":"Yostie","date":"2017-05-23T15:51:09.960+0000","title":"CAN\"T LOGIN!?","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":0,"body":"I couldnt get into a game: It kept giving me bugsplats and after restarting the client a couple times i got the message: invalid username or password!\r\nHow can this be? My info is 100% correct, it's the same i use to get onto the forums LOL","replies":[{"poster":"Xayah ßot","date":"2017-05-23T20:54:02.945+0000","up_votes":4,"down_votes":0,"body":"I am having the same problem at the moment. I started a ranked game and I couldnt use my keyboard for anything and my left clicks were pings. I tried to leave and rejoin but the client was reverted to an older patch but hasn't updated yet. Looks like I am going to lose this ranked game. Feelsbadman, my poor teammates.\nUpdate- it finally worked but that caused me and my teammates a ranked loss and i now have 20 min leaver buster for 5 games. I love it when i get penalized for shitty code. ","replies":[{"poster":"TheBilgewaterBoy","date":"2017-05-23T21:15:39.161+0000","up_votes":4,"down_votes":0,"body":"Yea screw that spaghetti code!!","replies":[]},{"poster":"BlueTaiga","date":"2017-05-23T21:17:55.458+0000","up_votes":2,"down_votes":0,"body":"I have had this same problem!","replies":[]}]},{"poster":"War Hunters","date":"2017-05-23T17:55:31.764+0000","up_votes":4,"down_votes":0,"body":"Currently suffering from this issue and am ~~currently in a ranked match~~, have tried restarting the client and am on the right region.~~~~\n\nEdit: The client says it has reverted to a later version and would begin to update. It took 3 minutes before updating. I can log in now, though did lose the ranked game as a result. Feelsbad.. ","replies":[{"poster":"Eazy","date":"2017-05-23T18:00:34.826+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=War Hunters,realm=EUW,application-id=osqw6G4M,discussion-id=5E6AJ7eA,comment-id=0002,timestamp=2017-05-23T17:55:31.764+0000)\n>\n> Currently suffering from this issue and am currently in a ranked match, have tried restarting the client and am on the right region.\n> \n> Edit: The client says it has reverted to a later version and would begin to update. It hasn&#x27;t begun updating\n\nThis exact thing just happened to me and got me scared since it said it was the wrong password.","replies":[{"poster":"Chloe Sone","date":"2017-05-23T21:51:17.736+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rosethorn,realm=NA,application-id=osqw6G4M,discussion-id=5E6AJ7eA,comment-id=00020000,timestamp=2017-05-23T18:00:34.826+0000)\n>\n> This exact thing just happened to me and got me scared since it said it was the wrong password.\n\nSame here, I even change my password, still I can't log in","replies":[]}]}]},{"poster":"MrSìlVid","date":"2017-05-23T16:14:19.171+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Yostie,realm=EUW,application-id=osqw6G4M,discussion-id=5E6AJ7eA,comment-id=,timestamp=2017-05-23T15:51:09.960+0000)\n>\n> I couldnt get into a game: It kept giving me bugsplats and after restarting the client a couple times i got the message: invalid username or password!\n> How can this be? My info is 100% correct, it&amp;#039;s the same i use to get onto the forums LOL\n\nSame here, I was afraid I got hacked for some reason. Didn't expect to be able to log-in but I checked the forums to see if it was a bug. Because together with my login problems I also couldn't launch the client. And when it did, I got a message saying the game was reset to an older version. I also tried resetting my password with my e-mail but I'm also not receiving any e-mails from Riot.","replies":[]},{"poster":"Porocles","date":"2017-05-23T16:37:32.666+0000","up_votes":1,"down_votes":3,"body":"This might be a patch mis-match, so your patcher isn't able to get you to the authentication server properly.  Restarting your client should fix this up!  If that doesn't work, download the [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) and perform a Force Repatch to make sure everything is up to date.  I hope that helps!","replies":[{"poster":"GlobalSaturation","date":"2017-05-23T21:19:16.492+0000","up_votes":2,"down_votes":0,"body":"Not really since even though Xayah Bot was able to reconnect after 20 minutes he still got a 20 minute queue penalty for 5 games.","replies":[]}]}]}