{"poster":"matirslorsv1","date":"2016-04-25T13:54:51.424+0000","title":"Pls regresen la función de Espectear a un desconocido en alto elo.","subforum":"Charlas Generales","up_votes":85,"down_votes":4,"body":"El otro dia esperando un amigo me di cuenta que ya no estaba la ventana en donde pod&iacute;as espectear una partida de alto elo.\r\nhttp://imgur.com/YJ20zg1\r\nEra interesante cuando estas esperando a alguien o simplemente te cansaste de jugar y te queres relajar un poco para continuar despu&eacute;s, ver como jugaban y posiblemente aprender algo. Pls tr&aacute;iganlo otra vez, aunque no mucha gente entre a ver una partida. A varios nos gustar&iacute;a poder ver a un Diamante 1 usando a nuestro personaje favorito y ver lo que alg&uacute;n d&iacute;a podr&iacute;amos hacer.\r\n\r\npd: se que la calidad de la imagen es muy mala pero fue la primera que encontr&eacute;.","replies":[{"poster":"Cedriel","date":"2016-04-25T15:00:07.186+0000","up_votes":22,"down_votes":2,"body":"Está deshabitado temporalmente. Lo hacemos cuando tenemos muchas noticias que vale la pena resaltar: en este caso queríamos que todos los jugadores vieran que URF estaba disponible durante el fin de semana. :)","replies":[{"poster":"wintermoon","date":"2016-04-25T17:56:28.075+0000","up_votes":1,"down_votes":7,"body":"Sos un rioter nuevo?","replies":[{"poster":"Cedriel","date":"2016-04-25T18:40:00.592+0000","up_votes":13,"down_votes":0,"body":"Estoy en el equipo y participando en los foros desde Abril del 2014.  :(","replies":[{"poster":"Fedmau","date":"2016-04-25T22:49:06.751+0000","up_votes":5,"down_votes":0,"body":"https://www.youtube.com/watch?v=OGvd6Pmn5WA {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Caipirinhã","date":"2016-04-26T00:30:35.674+0000","up_votes":3,"down_votes":0,"body":"Cuando empece a jugar lol","replies":[]},{"poster":"wintermoon","date":"2016-04-27T13:46:56.386+0000","up_votes":1,"down_votes":0,"body":"Creo que si te vi una vez,no se.","replies":[]}]}]},{"poster":"ALEXKOND","date":"2016-04-25T18:32:34.487+0000","up_votes":4,"down_votes":1,"body":"Hace muchísimo tiempo que esta deshabilitado, estoy seguro que antes de que estuviera urf ya lo estaba.\n¿No había dicho otro rioter que no estaban contentos o algo similar y que buscaban hacer otra cosa?","replies":[{"poster":"Cedriel","date":"2016-04-25T19:13:10.165+0000","up_votes":3,"down_votes":0,"body":"Efectivamente, había otro contenido destacado ahí antes de URF. Simplemente hemos tenido muchas noticias importantes estas últimas semanas: Taric, IWCI, actualización de mitad de temporada, descuento permanente de runas, URF.\n\nSabemos que el modo espectador genera bastante interés, así que volverá pronto.","replies":[{"poster":"ALEXKOND","date":"2016-04-25T20:26:08.199+0000","up_votes":5,"down_votes":1,"body":"Ah, el famoso soon™ ¿No es así? Esperamos con ganas unos cuantos, ya que estaba bueno ser espectador de partidas de nivel alto para aprender una o dos cosas del juego.","replies":[]}]},{"poster":"Shirotani","date":"2016-04-25T19:08:43.572+0000","up_votes":2,"down_votes":0,"body":"^THIS \nAl parecer no se pasan los memos.\n\nSi fuera como dice Cedriel  hubieran usado el botoncito de \"tabular\" en el cliente, para alternar entre la noticia y el espectador de partidas.","replies":[]}]},{"poster":"Postresito","date":"2016-04-25T16:28:24.517+0000","up_votes":2,"down_votes":0,"body":"Hola Cedriel, \n\nla verdad es que desde antes de que saliera URF que no veo la opción para espectar partidas de elo alto.  Estaría bueno que estuviera siempre, siento que es una herramienta importante para aprender de los otros jugadores con más experiencia.\n\nSaludos Cedriel!\n\n|°-Postresito-°|","replies":[]},{"poster":"Shion Archimago","date":"2016-04-25T17:16:27.510+0000","up_votes":1,"down_votes":0,"body":"podrian agregar una pestaña para espectear partidas asi como la pestaña de la tienda o la de tu inventario etc","replies":[]}]},{"poster":"Snooow","date":"2016-04-25T14:28:54.172+0000","up_votes":10,"down_votes":1,"body":"Me acuerdo cuando era lvl 10, estaba enamorado de panth (no homo), me puse a ver una de esas partidas porque uno lo estaba jugando, el tipo iba 10/0 y mataba a todo el mundo y dije \"cuando sea grande quiero ser como el\"","replies":[{"poster":"Jade Fang","date":"2016-04-26T01:51:06.105+0000","up_votes":2,"down_votes":0,"body":"Cuando sea grande jajajaja","replies":[{"poster":"Snooow","date":"2016-04-26T02:43:06.179+0000","up_votes":1,"down_votes":0,"body":"Y ya casi llego a su nivel c:","replies":[]}]}]},{"poster":"Kerister","date":"2016-04-25T14:17:08.602+0000","up_votes":4,"down_votes":0,"body":"Podes ir a la pestaña ligas y ver el grado Retador, en esa lista si hay alguno jugando te aparece un ojito, le haces click derecho y podes poner \"ser espectador\".","replies":[{"poster":"Maury Charrua","date":"2016-04-25T15:45:10.512+0000","up_votes":2,"down_votes":5,"body":"Si pero la gente es tan man k que no se dan cuenta de eso.","replies":[{"poster":"Magina009","date":"2016-04-25T20:12:39.851+0000","up_votes":6,"down_votes":0,"body":"Y hay gente que no sabe escribir y es peor que alguien manco :v","replies":[{"poster":"Maury Charrua","date":"2016-04-25T23:43:29.102+0000","up_votes":2,"down_votes":2,"body":"a quien te referis mijito? te referis a mi abreviatura?","replies":[]}]}]},{"poster":"Aeren","date":"2016-04-25T16:36:58.896+0000","up_votes":1,"down_votes":0,"body":"El problema con esa opcion, es que no sabes cuanto tiempo lleva la partida, puede que entres cuando recien comienza (muy rara vez y con suerte pasa) o puede que para cuando termines de cargar la partida veas el cartel de victoria del equipo que gano.\nComo sea, lo mas probable es que para cuando entres a ver una partida de esa forma, la fase de lineas ya haya terminado y no puedas ver la partida de la misma forma en la que podias hacerlo con la opcion de espectear que el cliente tenia.","replies":[{"poster":"Kerister","date":"2016-04-25T19:37:10.827+0000","up_votes":1,"down_votes":0,"body":"Podes buscar la partida en op.gg y ver el tiempo que llevan jugando y los picks.","replies":[{"poster":"Aeren","date":"2016-04-25T22:24:19.626+0000","up_votes":2,"down_votes":0,"body":"Si esa es tu solucion, que diferencia hay entre eso y buscar una partida ya grabada y subida a youtube, o bien podrias decirme que busque en twicht partidas para mirar que pueden o ser explicadas, no entiendes el punto.\nOpciones tenemos para mirar partidas, sea op. twicht, youtube, etc.\nPero mas alla del conformismo que intentas aplicar, has de saber que una opcion mas esta en el mismo cliente, sin necesidad de hacer tantos clicks o escribir cosas en tu navegador favorito, es solo eso, comodidad con respecto a una funcion que esta en el juego, pero omitida por cosas como URF que ya ni siquiera esta en el juego y sigue siendo publicada, entiendes?","replies":[{"poster":"Treno","date":"2016-04-26T15:47:08.376+0000","up_votes":2,"down_votes":0,"body":"Lo importante es que esta, yo en ves de pedirle a los rioters que arreglen eso preferiria que le pongan mas ganas a mejorar la comunidad o la estailidad de los servers.\nY es mas interesante desde mi punto de vista buscar espesificamente el jugador que queres espectar desde la lista de ligas pero eso es cuestion de gustos.","replies":[]}]}]}]}]},{"poster":"nazareno 567","date":"2016-04-25T21:51:52.004+0000","up_votes":1,"down_votes":0,"body":"por cierto,ese es el launcher antiguo? :v","replies":[{"poster":"LemønPykë","date":"2016-04-25T22:24:33.626+0000","up_votes":3,"down_votes":0,"body":"no, es del futuro :v","replies":[]}]},{"poster":"Lapou","date":"2016-04-27T15:53:45.667+0000","up_votes":2,"down_votes":0,"body":"No te creas, lo hacen para que veamos mas la LCS y esas cosas de profecionales, asi ganan mas pasta.\nMe banearan por esto","replies":[]},{"poster":"AresC","date":"2016-04-25T19:37:17.552+0000","up_votes":2,"down_votes":0,"body":"Acabo de encontrar una alternativa más bonita que buscar las IDs y las claves de espectador desde la API {{summoner:31}}\n\nhttp://quickfind.kassad.in/featured-games\n\nUtiliza el mismo sistema que el que estaba en el cliente antes, no es súper práctico pero algo es algo :P","replies":[{"poster":"Treno","date":"2016-04-26T15:59:03.836+0000","up_votes":1,"down_votes":0,"body":"[https://cdn.meme.am/instances/400x/36455593.jpg](https://cdn.meme.am/instances/400x/36455593.jpg)\n\nSuper practico ty buen hombre","replies":[]}]},{"poster":"GøD Cąrry","date":"2016-04-25T15:00:54.132+0000","up_votes":2,"down_votes":0,"body":"si la verdad deberian ponerlo de nuevo, yo por lo menos cuando me aburria o queria ver a alguien usando x champ lo usaba.","replies":[]},{"poster":"zepillon","date":"2016-04-27T00:21:49.670+0000","up_votes":1,"down_votes":0,"body":"Era Genial {{champion:32}} {{sticker:zombie-nunu-tears}} {{summoner:3}}","replies":[]},{"poster":"Jherico","date":"2016-04-26T15:28:54.633+0000","up_votes":1,"down_votes":0,"body":"Hola viejo como estas vos queres espectar  hace esto es lo que yo hago y es mucho mejor que loque pasaba en lo que vos posteas porque\nultimamente eran partidas de baja calidad bueno hace lo siguiente.\nEl unico drama es que tener que tener  liga  seas bronce a diamante da igual, te vas a tu perfil\nluego  a liga\nvas a donde dice clasificatoria es un menu desplegable\nlo seleccionas y te vas al de a bajo mejores en\ny ahi busca el que tenga el ojito de espectar, algunos sosn diamante uno hasta maetros y challenger","replies":[]},{"poster":"Vernon Roche","date":"2016-04-26T00:57:05.153+0000","up_votes":1,"down_votes":0,"body":"Estoy de Acuerdo, me encantaría que vuelva, era espectador de partidas de High Elo; Ahora me encantaría seguir viendo","replies":[]},{"poster":"Whentz","date":"2016-04-25T21:39:22.642+0000","up_votes":1,"down_votes":0,"body":"Ojala lo pongan , me acuerdo que aveces llegaba a espectear a Gaussrik con su bardito D:","replies":[]},{"poster":"BOT Yásuo","date":"2016-04-25T15:57:29.521+0000","up_votes":1,"down_votes":0,"body":"Están haciendo un nuevo cliente, estoy seguro que para ese nuevo cliente van a estar en alguna pestaña.","replies":[]}]}