{"poster":"DOSman","date":"2015-08-15T16:32:23.019+0000","title":"Renaming Talon's E Ability - \"Cutthroat\"","subforum":"Miscellaneous","up_votes":4,"down_votes":3,"body":"So it occurs to me that there still has been no change to the name of Talon&#039;s E ability, currently called Cutthroat. Since it clearly doesn&#039;t fit anymore after removing the silence and making it a brief slow, I thought I&#039;d throw in my 2 cents.\r\nThis kinda seemed like an obvious choice to me and yet I never put it out there, I guess I assumed someone else had already thought of it.\r\n\r\n*     Why not change the name to of his E to Achilles?\r\n\r\nAs in achilles tendon. I think it suits him pretty well, jumps in behind the target, quickly slices at the ankle and proceeds to follow up with more cuts while the victim reels from the sudden loss of balance (admittedly quickly recovered from in this case but nevertheless).\r\n\r\nWhat do you guys think? If you like it let me know, answer the poll and/or upvote, just keen to see what other people think.\r\n\r\nI still really like Talon, think he could use a little tweaking to make him a little more viable in more situations but overall I&#039;m not to salty about the lack of silence. That said I think he could use a better passive and a better effect on his E but either way he&#039;s still really cool.\r\n\r\nP.S If you are a Rioter and like my idea, pass it on to the appropriate people please :D\r\nAnd if you do change the name of his ability feel free to reward me with something, like the Talon SSW skin for example. Or a job. I&#039;m not too, fussed either way. Either way is fine ;)\r\n\r\nCheers, DOSman.","replies":[{"poster":"Bipolar","date":"2015-08-16T10:21:09.978+0000","up_votes":4,"down_votes":0,"body":"Why can Talon have a gruesome named ability, yet Graves cannot have a cigar?","replies":[{"poster":"DOSman","date":"2015-08-18T00:28:13.370+0000","up_votes":1,"down_votes":0,"body":"One of League's great mysteries I suppose.","replies":[]}]},{"poster":"kJs","date":"2015-08-15T17:32:04.589+0000","up_votes":4,"down_votes":0,"body":"Maybe\n\"Handicap\".\n\"Limbcut.\"\n\"Eviscerate.\"\n\"Mangle.\"\n\"Lacerate.\"","replies":[{"poster":"Tele","date":"2015-08-16T04:01:00.052+0000","up_votes":3,"down_votes":0,"body":"I think Lacerate it's pretty sick, Riot should probs go with that.","replies":[{"poster":"ninjaIRL ","date":"2015-08-18T14:54:52.019+0000","up_votes":1,"down_votes":0,"body":"Yeah. \n\"Achilles.\"\nJust sounds really lame and tame for an Assassin such as Talon, or any assassin really.","replies":[]}]},{"poster":"Jink","date":"2015-08-18T00:29:57.354+0000","up_votes":1,"down_votes":0,"body":"Visceral names here.","replies":[]}]},{"poster":"Alamo","date":"2015-08-16T23:16:49.124+0000","up_votes":1,"down_votes":1,"body":"\"cutthroat\" would work if they havent removed his silence ...{{item:3070}}","replies":[{"poster":"DOSman","date":"2015-08-18T00:29:09.917+0000","up_votes":2,"down_votes":0,"body":"But that's the point, the whole change was removing the silence lol","replies":[]}]},{"poster":"Jink","date":"2015-08-18T00:32:00.361+0000","up_votes":1,"down_votes":0,"body":"But he blinks behind them to prepare for an attack, hence Cutthroat anyways coz he's behind you.","replies":[{"poster":"DOSman","date":"2015-08-18T12:30:11.435+0000","up_votes":1,"down_votes":0,"body":"That would make sense for something like 'Backstab'\nBut since he actually isn't cutting any throats it doesn't work so much anymore.","replies":[]}]},{"poster":"DOSman","date":"2015-08-18T00:27:45.102+0000","up_votes":1,"down_votes":0,"body":"About 50/50.\nFair enough. More people opposed than I expected, at least judging by the comments.\n\nBut then to each their own.\nAlways good to see other points of view though :)","replies":[]},{"poster":"oops","date":"2015-08-16T08:12:35.392+0000","up_votes":1,"down_votes":0,"body":"Why does it fit any less than it used to? It's still basically the same ability.","replies":[{"poster":"DOSman","date":"2015-08-16T09:20:05.325+0000","up_votes":1,"down_votes":0,"body":"Cutthroat makes sense with silence, not so much with impaired movement.","replies":[]}]},{"poster":"Talon12","date":"2015-08-15T23:59:21.578+0000","up_votes":1,"down_votes":0,"body":"if they change it, it will sound like sht","replies":[]}]}