{"poster":"Black INV","date":"2016-03-31T22:13:44.691+0000","title":"Ayuda para Ranked","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Buenas! Mi problema es doble, tanto mio como de mi equipo. El tema es que ~~deseo~~ deseaba hacer las 10 primeras ranked y subir (o bajar) pero no es tan sencillo Empecemos con lo mas facil de responder y quizas lo menos importante\r\n\r\nMI EQUIPO\r\nNo maneja el juego de la misma manera a la que estoy acostumbrado en las normal con mis amigos (Parecen mas desordenados). Me nivelan con plata 2 o 3 cuando mi nivel dudo que llegue a bronce, mas de una vez jugu&eacute; con otro unraked (uno tenia solo 5 victorias en normal!!). Y el principal problema es que como me gusta ser jg pretenden que sea su ni&ntilde;era en las 3 lineas a la vez, todos sabemos que es imposible y mas si quiero hacer la jungla y dejarle las kills a ellos (tampoco que yo soy carry). Juegan con lo que quieren sin importar si consiguen un equipo un poco balanceado y NO CANTA LA ~~PUTA~~ MIA.\r\n\r\nMIS PROBLEMAS\r\nPor algun motivo me mentalice la importanci de las Ranked y cada vez que juego me siento nervioso, no muerto de nervios, pero nervioso. Hago cosas que jamas haria, manqueo como si no tuviera ni brazos!! Si fuera asi en las normal esta bien, lo acepto, pero no! en las normal si bien no destaco en todas al menos siento que soy util para el equipo.\r\n\r\nSe que el principal problema no es mi equipo, ya que los demas tambien hacen lo mismo (dudo que de 8 partidas siempre nos junten a los mas malos en un equipo) asi que me gustaria si puedieran y serian tan buenos de darme consejos para terminar con esos nervios y no no quiero subirme arriba de YI.... ~~soy malo con Yi~~ No me gusta ese champ\r\n\r\nGracias por leer, buenas victorias y sabias derrotas! {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Little T","date":"2016-04-01T08:56:40.007+0000","up_votes":2,"down_votes":0,"body":"A mi me pasaba lo mismo, lo único que hice fue rankear mucho y ya todo se naturalizo, solo juga y si tenes nervios no importa, al tiempo se te van.","replies":[]},{"poster":"firebreather","date":"2016-04-02T18:22:10.487+0000","up_votes":1,"down_votes":0,"body":"cuando seas level 30 no te tires haci nomas a la ranked solo esto si sos malo jugando normales (PvP){{summoner:31}}","replies":[]},{"poster":"Bardo de AlQaeda","date":"2016-03-31T22:31:16.102+0000","up_votes":1,"down_votes":0,"body":"La mejor manera de perder el miedo es usar un champ que tengas lo suficientemente maineado como para usarlo bien incluso si la partida va mal y te acaban de dar con una escopeta en la cara. Ademas siguen siendo simples partidas, si haces las cosas bien no habra ningun problema. Saludos.","replies":[{"poster":"Black INV","date":"2016-03-31T23:16:49.517+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UltimateRA,realm=LAS,application-id=8sKIclmi,discussion-id=NAdLOXM5,comment-id=0000,timestamp=2016-03-31T22:31:16.102+0000)\n>\n> La mejor manera de perder el miedo es usar un champ que tengas lo suficientemente maineado como para usarlo bien incluso si la partida va mal y te acaban de dar con una escopeta en la cara. Ademas siguen siendo simples partidas, si haces las cosas bien no habra ningun problema. Saludos.\n\nEs que se me complica porque me siento mas seguro con Ahri, pero hay bastantes que me joden demasiado en mid y que se usan mucho ahora. Supongo que lo mejor es tratarlas como una partida mas. Gracias n.n","replies":[{"poster":"Bardo de AlQaeda","date":"2016-03-31T23:23:17.406+0000","up_votes":1,"down_votes":0,"body":"Mientras no mueras en linea, si te va mal roameas y la vas llevando, no todos los enfrentamientos se pueden ganar :D","replies":[]}]}]}]}