{"poster":"WhaiiSoSerious","date":"2016-11-10T07:03:11.978+0000","title":"Runes aren't showing up In list?","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I just purchased 5 greater marks of precision but they don't show up in my rune list. Tried restarting the client but that didn't fix anything.\n\nIt did charge me for them cuz i had 5.2k IP.\n\nEdit: Got them after 10-15 mins.\n\nAny ideas?","replies":[{"poster":"Porocles","date":"2016-11-11T00:55:42.936+0000","up_votes":2,"down_votes":0,"body":"I was able to confirm your purchase of these runes, so I'm not entirely sure why you can't see them.  Try relogging and make sure that you're looking for Marks (Red).  If you still can't see it, hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can figure out what's going on.  Hope that helps!","replies":[{"poster":"Exiled Moon","date":"2016-12-02T21:40:05.200+0000","up_votes":2,"down_votes":0,"body":"alot of the time when im doing my rune pages since the new client, some runes wont show up on specific pages and i was wondering if u could let riot know to fix the rune page problem, its getting very annoying. i cant have as indepth customization in runes now, and i dont wanna have to keep switching to legacy to update runes","replies":[]}]},{"poster":"IsaiahThedude","date":"2017-09-10T05:38:48.852+0000","up_votes":1,"down_votes":0,"body":"I am so mad rn I have spent a lot of IP on runes and they still haven't shown up after like 1month please help asap","replies":[]},{"poster":"WhaiiSoSerious","date":"2016-11-10T07:41:24.476+0000","up_votes":1,"down_votes":0,"body":"I got mine after 10 minutes.","replies":[{"poster":"Porocles","date":"2016-11-11T00:56:07.048+0000","up_votes":1,"down_votes":0,"body":"Aha!  Glad to hear all is well now!","replies":[]}]},{"poster":"redhineymonkey1","date":"2016-11-10T07:48:46.321+0000","up_votes":1,"down_votes":0,"body":"UPDATE: Got mine now after restarting my computer and toying around with the runes. I was moving the one I already had of the quint of health and moving it to other spots and reequipping it a few times and it eventually appeared in my inventory. Take other marks and put it in the place and reequip them a few times, to see if that gets anywhere.","replies":[]},{"poster":"redhineymonkey1","date":"2016-11-10T07:32:43.135+0000","up_votes":1,"down_votes":0,"body":"Same thing happened to me just now, just bought quint of health(1.5%) took the ip but did not give me the rune. It said I \"already own one\" which I do, but it should say I own 2 now.","replies":[]}]}