{"poster":"Fitzky","date":"2017-05-07T03:51:00.172+0000","title":"What is with all the remakes and afks recently?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I&#039;ve had to remake around 4 to 5 games which is ridiculous and such a waste of time, that&#039;s almost an hour wasted on useless games because of stupid people that are afk. I would just play out the 4 v 5 instead of wasting peoples time like that, after enough games its just not worth it anymore. Especially for people who only have around 2-3 hours of free time.","replies":[{"poster":"Akkordian Zoeve","date":"2017-05-07T04:57:12.721+0000","up_votes":1,"down_votes":0,"body":"It's a bug in the new patch. I have great internet connection and FPS, but I was still disconnected from a game earlier this week with no way of getting back (no \"Reconnect\" button). I sent a ticket, and they mentioned a bug.","replies":[{"poster":"macro","date":"2017-05-07T05:07:03.648+0000","up_votes":2,"down_votes":0,"body":"Happening with me too man, so fkn annoying","replies":[]}]},{"poster":"macro","date":"2017-05-07T05:06:27.246+0000","up_votes":2,"down_votes":0,"body":"you know that reconnect bug that happened a while ago? How it would just kick you before you could get into loading screen? Its happening to me and i cant play :)))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))","replies":[]},{"poster":"SEKAI","date":"2017-05-07T04:32:11.469+0000","up_votes":1,"down_votes":0,"body":"I'm guessing you play more Ranked?\n\nPlay Norms is a good idea if you don't have much time to spare, Ranked is a hellhole anyway.","replies":[{"poster":"Fitzky","date":"2017-05-07T04:33:40.521+0000","up_votes":1,"down_votes":0,"body":"I'd rather not go through the broken process of lane calling in chat","replies":[{"poster":"SEKAI","date":"2017-05-07T04:36:11.788+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=Ntey9fRZ,discussion-id=bzZAcK1f,comment-id=00000000,timestamp=2017-05-07T04:33:40.521+0000)\n>\n> I&#x27;d rather not go through the broken process of lane calling in chat\n\nYou can maybe go with ARAM and other rotating modes but the entire point itself for them is meant to be broken so I doubt you'd like it anyway. So welp, I'm out of ideas soz.","replies":[]}]}]}]}