{"poster":"Fitzky","date":"2017-11-06T05:21:47.847+0000","title":"To all the people making fun of SKT","subforum":"Esports","up_votes":12,"down_votes":1,"body":"I&#039;m personally not a fan of Esports, I don&#039;t really have a lot of interest in it. I don&#039;t root for any teams either, but that doesn&#039;t mean I don&#039;t know anything about Esports though. As I&#039;m heavily associated with the League community I pretty much find out everything that happens at worlds anyway, and all I can say is, I&#039;m very disappointed with SSG fans. No one here on the boards has said anything exactly, but from what I&#039;ve seen from the League community as a whole is just disrespectful. \r\n\r\n&quot;So glad that Faker fuck finally lost&quot;\r\n&quot;Cry Faker cry more :)&quot;\r\n&quot;SKT has millions already, go retire and get laid losers&quot;\r\n\r\nhttps://imgur.com/xwZGq3Z\r\nEven though they lost, SKT is still the best team in the world. What they have done is quite frankly amazing, winning worlds 3 times in a row is unimaginable. To all those making fun of Faker crying, you don&#039;t understand the pressure and emotions that go into something like this. Faker is pretty much the most popular player in the world, he has millions of fans watching him, millions of fans that he didn&#039;t want to let down. I can&#039;t comment on the performance of the rest of the members on the team but from what I know Faker really tried to carry them until the end. He had everyone behind him, everyone relying on him, only to lose at the very end. He&#039;s had an amazing career, not to say it&#039;s going to end soon, he will definitely come back stronger. If anything, this is probably a good lesson for SKT.\r\n\r\nSo the hate against them is really not necessary, yes we were all kind of glad that someone else won for a change but that doesn&#039;t mean that SKT automatically sucks. Kings don&#039;t live forever, eventually they die and another takes their place. Now that SSG holds the crown SKT need to work hard to get it back.\r\n\r\nLike I said I&#039;m not a fan of either, but what SKT has done over their history has really been impressive and all I can say is best of luck to them in the future and congrats to SSG!","replies":[{"poster":"belquin","date":"2017-11-13T03:01:47.987+0000","up_votes":3,"down_votes":0,"body":"Well said Fitzky! It was an amazing set of games by SSG, and SKT have had an amazing streak of dominance. I think people are expressing that they are happy that there is competition despite Faker being the best player in the world and SKT being the best 'Worlds' team. Obviously the way it has come across is not cool and I hope they take the time to read your post.\n\nWP!","replies":[]},{"poster":"Miicka","date":"2017-11-06T11:02:46.409+0000","up_votes":3,"down_votes":0,"body":"I recently read the all time classic To Kill a Mockingbird by Harper Lee. Fantastic book, and one of my favourite book quotes comes from it:\n\n_“You never really understand a person until you consider things from his point of view... Until you climb inside of his skin and walk around in it.”_\n\nWhen people write these kind of comments, they fail to consider things from the persons point of view that they are attacking. Fakers reputation was on the line this year and his team and his fans were relying on him to play to the remarkable level of skill which he usually puts on display, so it was completely understandable when he crumbled beneath all the pressure placed on him.\n\nTo some this may seem like a game, but to Faker this is his career and his lifestyle. Comments which are written out of ignorance, lack of empathy and complete disregard for the feelings of the person being attacked are actually an ever growing issue on the internet that is rarely addressed, and this is a prime example of that. \n\nI know Faker and the rest of SKT will recover from this loss, and quite frankly it's such a shame that this years finale was ruined by all the toxicity from the community. It was such an epic finale and an absolute blast to watch, I never would have expected an SSG win, but I feel ashamed to be part of a community which can so quickly turn to bash and criticise one of its most praised and highly regarded players after one loss.","replies":[]},{"poster":"CHEESYLEEKS","date":"2017-11-06T08:02:06.676+0000","up_votes":3,"down_votes":0,"body":"he probably had a breakdown where you cant control your emotions from the overwhelming pressure and stress of skt under performing and that was the  final tipping point. its really not an uncommon thing to happen to people. how you look at it all just comes down to maturity, which is few and far between with lol players.","replies":[{"poster":"Mozzie25","date":"2017-11-06T09:33:42.447+0000","up_votes":2,"down_votes":0,"body":"Grand Finals are an emotional time. I imagine worlds is a shit ton worse. I've seen grown football players barely keeping it together or openly weeping after grand final losses and that's amateur sport. Losing something you've worked all year for and spilt blood, sweat and tears for is devastating. \n\nQuite frankly all I get out of seeing someone cry after losing on that kind of stage is that they really really wanted it. Crying doesn't make you any less of a person.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2017-11-06T05:51:17.617+0000","up_votes":2,"down_votes":3,"body":"I can say in all honesty, I couldn't really care about either team, or any team at all tbh.\n_(When one team can just buy players from another, all competition loses any meaning in my eyes.)_\n\nBut when I think about how many less Zeds I would have vsed if it hadn't been for Faker.......\nHow many hours of misery I have had because of my lane being filled game after game after game with the same faker copycat/wannabes and their cancer champs.....\nThat's why I throughly enjoyed Faker breaking down.\n\nFor no other reason.","replies":[{"poster":"Best Evelynn OCE","date":"2017-11-06T07:05:58.926+0000","up_votes":1,"down_votes":0,"body":"*cough* Lucian Mid *cough*\n\nSo frustrating when my Mid Laners picked this a day after, and they all fed their faces off T_T","replies":[{"poster":"Lord Sesshomaru","date":"2017-11-06T09:14:56.401+0000","up_votes":1,"down_votes":0,"body":"Ugh... \n\nDont remind me.","replies":[{"poster":"Klavinmour","date":"2017-11-06T16:08:42.254+0000","up_votes":1,"down_votes":0,"body":"What happened to your purple name?","replies":[{"poster":"Lord Sesshomaru","date":"2017-11-06T21:45:34.054+0000","up_votes":1,"down_votes":0,"body":"I dont know haha, sometimes it shows up, sometimes not :P","replies":[{"poster":"JasonWazza","date":"2017-11-07T02:33:14.333+0000","up_votes":1,"down_votes":0,"body":"I'd say it's probably specifically the Esports boards","replies":[{"poster":"Lord Sesshomaru","date":"2017-11-07T03:52:15.451+0000","up_votes":2,"down_votes":0,"body":"Could be, I am knowledgeable in absolutely nothing relating to E-sports xD","replies":[]}]}]}]}]}]}]},{"poster":"Mozzie25","date":"2017-11-06T06:07:56.042+0000","up_votes":2,"down_votes":0,"body":"Yeah I’m on the same page. It was good for someone to knock off the champs but I hold no ill will agaisnt Faker. Perhaps someone of the butt hurt comes simply from the way they kept getting into situations where they would surely lose and then somehow pull the cat out of the bag. \n\nAs far as his stats go this was his best worlds. Unfortunately the team around him just wasn’t playing as well. Huni has always been hit or miss, he either carries or feeds. The SKT style essentially turned Peanut into a warding bot and didn’t let him play his style like he had on the Koo Tigers. But the real difference this year was in the bot lane. Bang and Wolf have been solid for years. Very rarely getting behind and absorbing pressure so the jungler could focus on Faker/Top lane. This year though they really really struggled. Team after team punished them in the area and it became pretty clear I think in groups and quarter finals that it was probably just a matter of time before someone took proper advantage of it.","replies":[]},{"poster":"Ninox","date":"2017-11-07T08:54:11.055+0000","up_votes":1,"down_votes":0,"body":"Couldn't have said it better. As you say, sure we were all glad on some level that they got dethroned, but that doesn't mean they suck all of a sudden. Second in the world (for this year) is still a darn sight better that a vast percentage of the player population, and they still hold a significant and impressive record all their own.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Waysted1","date":"2017-11-06T06:07:44.113+0000","up_votes":1,"down_votes":0,"body":"and not one of those ugly comments can be backed up with game play, none of them will ever get to worlds and, probably never get to qualifiers and with their ugly hateful minds never get a girl either","replies":[]},{"poster":"Best Evelynn OCE","date":"2017-11-06T05:55:18.737+0000","up_votes":1,"down_votes":0,"body":"Exactly! It's incredibly unrealistic for SKT to win every Worlds, especially with a different roster. SSG didn't win because SKT sucked, but rather because they worked hard to become good enough to beat the best. What they've done is raise the bar of Pro Play yet again. \n\nAnd to those Faker bashers, he played to the best of his abilities. Not once did he give up, even when other members on his team fell behind. His deaths weren't due to insane outplays, but rather the enemy realising him as a high priority target. No one has the right to hate on someone for trying their best and performing their best. Chances are most of these haters are low elo players who don't understand that.","replies":[]}]}