{"poster":"GargameLE","date":"2019-09-13T13:52:35.018+0000","title":"TFT und der Frust!","subforum":"Teamfight Tactics","up_votes":2,"down_votes":0,"body":"Servus,\n\nTFT ist an sich wirklich ein toller Modus, aber er frustriert mich mehr wie jeder andere.\nBsp. mein letztes Spiel.\nIch spiele ein Full Noble/Bewahrer/Bogenschütze/Ritter Kombo mit nem 3er Braum und guten Items auf Ashe.\n\nhttps://www.bilder-upload.eu/bild-b95059-1568382683.jpg.html\n\nWarum zum teufel werde ich mit so einer Combo 7. Platz? Was bringt es mir dann verdammt nochmal auf Noble zu gehen? (was ich nicht einfach finde , weil man Glück haben muss Kyle zu erwischen)\nEs kann doch nicht sein das mich die anderen so weg nieten, wenn man es schafft so ne Combo zusammen zu stellen. Wo ist dann das Gleichgewicht im Spiel? Es nervt einfach das man jedes Spiel versuchen muss auf die 3-4 Meta Combos zu gehen um unter die Top3 zu kommen. Da können Sie sich bei Riot die anderen Combos schenken !! \n\nHabt ihr Tipps? Wie seht ihr das?\n\nLG","replies":[{"poster":"ghostSuu","date":"2019-09-13T19:24:55.298+0000","up_votes":2,"down_votes":1,"body":"Behindertes Game ever ich fühle mit dir","replies":[]},{"poster":"FlashFeedRepeat","date":"2019-09-21T21:08:26.354+0000","up_votes":1,"down_votes":0,"body":"Warum zum Teufel ist es wie Lotto spielen? Das hat mittlerweile null mit \"Combs\" zu tun, du brauchst einfach abartig viel Glück, um schnell an deine Champs zu kommen, ansonsten kannst direkt aufgeben. \nDir fehlt 1 Champ für Level 2, der aber nicht einmal nach 60 Coins kommt, also mehr \"Lotterie\" geht wohl kaum und andere feiern in Stage 3 schon 2 Champs auf Level 3....also bitte.","replies":[]},{"poster":"Mezzo","date":"2019-09-15T10:13:57.685+0000","up_votes":1,"down_votes":0,"body":"Zuerst Noble ist seit 2 Patches nicht mehr wirklich gut. Sie wurden generft nachdem sie ja wirklich 2 Wochen einfach broken waren. Dann ist das stacken von Dmgitems auf deiner Ashe nicht der sinnvollste Plan gewesen. Sie war dein einziger Carry und du hast sehr viel Magieschaden bei deinen Gegnern gehabt, da wäre eine Dragonclaw wesentlich besser als ein Shojin auf der Ashe. \n\nAus dem Bild kann man jetzt nicht erkennen wie du deine Aufstellung gewählt hast, aber auch da kann man dann bestimmt dran arbeiten. Du musst halt schauen wie die Gegner stehen, wie z.B. springen die Assassins in deine Backline und zerlegen deine Ashe oder stehst deine Ashe richtig damit sie nicht von der Aurelion Ult getroffen wird usw. Wenn du dich so stark auf einen Carry fokusierst musst du sehr genau drauf achten wo er steht und wie deine Gegner stehen.\n\nDann auch darauf achten wie Braum und Leona stehen damit du deinen Guadian-Buff auch richtig verteilst. \n\nIst halt nicht nur Comp und Items bauen wenn man eine Offmetacomb spielt","replies":[{"poster":"Superfly1979","date":"2019-09-18T07:09:13.446+0000","up_votes":1,"down_votes":0,"body":"Super Antwort. Sehe ich ähnlich Positioning, Itemisation und Gegnercomb sind die ausschlaggebenden Merkmale die nicht vernachlässigt werden dürfen. Abgesehen davon, dass es offensichtlich im Midgame zu Ende ging und die Comb mit einer ein Stern Frontline leider zum scheitern verurteilt ist. Ich empfehle hier, dass man sich immer die Meta Listen ansieht um zu sehen um welche Helden herum gebaut werden sollte.\n\nLG","replies":[]}]},{"poster":"Enderized","date":"2019-09-13T14:08:45.229+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist halt auch... hast du die richtigen Items zu deiner Comp gewählt? =)\n\nItems haben einen nicht unerheblichen Einfluss auf den Erfolg einer Comp","replies":[{"poster":"GargameLE","date":"2019-09-13T19:45:06.353+0000","up_votes":1,"down_votes":0,"body":"Dann kläre mich mal auf, wer welche Items gebraucht hätte. Ich habe Ashe mit Tempo Items voll gepackt (guinsoos, static, und shojin) und Braum mit Tanky Items.","replies":[{"poster":"Enderized","date":"2019-09-14T08:51:53.688+0000","up_votes":1,"down_votes":0,"body":"Das einzige was die mit den Items auf deinen 2 Glacials erreichst ist, dass du Gegner relativ oft stunst und dein Braum 3 Schläge mehr aushält.\nWas deiner Comp fehlt sind vernünftige Damageitems auf den Rangern.\nDazu noch: 2er oder 4er Ranger? aufgrund deiner Comp schätze ich mal 2er.\n\nD.h. du hast nur 2\n\n\nDeine Noble Guardian Knight Comp hat an sich zu wenig Schaden und 2 Ranger gleichen dies bei weitem nicht gut genug aus\n\nEin Runaan's anstelle des Statikks auf Ashe wäre auch wünschenswert gewesen setzt allerdings setzt das immer die Itemdrops vorraus - man muss halt mit dem arbeiten was man hat,","replies":[{"poster":"GargameLE","date":"2019-09-16T16:08:25.425+0000","up_votes":1,"down_votes":0,"body":"Lucian , Vayne , Ashe ... woher soll der Schaden sonst kommen wenn ich 6 Noble Champions benötige? oO\nIch verstehe deine Sichtweise und bin auch dankbar für deine Meinung, aber wenn ich mit der Combo keine Chance habe, weil bei ner 6er Noble Comb der Dmg fehlt dann brauch ich sie auch nicht spielen. Den ne Noble comb war für mich in der Vergangenheit dafür bekannt das sie halt viel und lange Schaden aushält und auch austeilt. Dann hat man sie einfach zu stark generft, den vor ein paar Wochen hat meine Comb oben easy für Platz 1 gelangt. (auch mit dem Dmg) Und plötzlich lande ich damit im Nirgendwo, Nerf hin oder her. Riot hat es einfach übertrieben. Die Schuld jetzt nur den Items zu geben ist aber wieder typisch. Ich hätte deutlich schlechtere Items erwischen können und hatte schon relativ viel Glück. Riot hat es mit den noble einfach verkackt. Jeden Patch gibt es 2-3 Combos die man spielen MUSS! Und das kann einfach nicht sein. Balancing geht anders.\n\nPS. meine Ashe habe ich selbstverständlich geschützt. Aber wenn eine Noble Bewahrer Frontline inzwischen einfach weg geschreddert wird , kann ich mir das auch sparen.","replies":[]}]}]}]}]}