{"poster":"FrankerX","date":"2016-02-11T06:17:37.200+0000","title":"Aram und 3v3 sollte von riots logik her auch gelöscht werden.","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":17,"body":"den wenn man nach riots logik geht ist summoners rift die einzige karte die man braucht, der hauptmodus! und da zeit und aufwand reinzustecken ist das beste.\r\n\r\nriot geht wahrscheinlich das geld aus.\r\n(probier das mal ernst zu sagen ohne zu lachen)\r\n\r\nalso warum aufwand und zeit in andere spielmodi und karten stecken wenn 5v5 in SR ganz klar am wichtigsten ist? wem interessierts das wahrscheinlich &uuml;ber 100.000 leute t&auml;glich dominion genie&szlig;en? riot ist das offenbar egal.\r\n\r\nvielleicht sind es auch einfach die server? die karte braucht ja ressourcen die den server belastet. das ist nur wieder extra lagg das man verhindern kann!\r\n\r\n\r\nich bin ganz ehrlich: ich habe dominion zuletzt in season 4 gespielt.\r\naber ich sehe keinen grund warum 3v3 und aram bleiben sollten? interessiert riot offenbar eh nicht.\r\nman w&uuml;rde auch meinen nach &uuml;ber 6 jahren g&auml;be es vielleicht mal eine andere 5v5 map... wo man normals spielen kann z.b.","replies":[{"poster":"LOLCAPS","date":"2016-02-11T06:59:48.583+0000","up_votes":7,"down_votes":0,"body":"3v3 hat vor nicht allzu langer Zeit ein wenig liebe von RIOT bekommen, wäre also absoluter Schwachsinn diese Map zu entfernen. Auf der 3v3 Map kann man Teamranks spielen was auf Aram wie Dominion nicht geht, desweiteren ist die 3v3 Community auch nicht unerheblich klein.\n\nAram zu löschen wäre ebenso schwachsinnig, weil es eine extrem beliebte Fun-Queue ist.\nIch persönlich habe noch nie länger als 2min warten müssen für ein Aram Match, piepegal welche Uhrzeit. \n\nEs ist einfach so, dass Dominion nur eine absolut winzige Anzahl an Spielern hat/hatte und die Ressourcen dafür zu wertvoll sind. Sorry hört sich irgendwie beknackt an der letzte Satz.\n\nMfG","replies":[]},{"poster":"Humpelstilzche","date":"2016-02-11T09:30:57.913+0000","up_votes":6,"down_votes":0,"body":"> wem interessierts das wahrscheinlich über 100.000 leute täglich dominion genießen?\n\nGenau das ist der springende Punkt: Es ware viel viel weniger. Es waren so wenige, dass Matchmaking in einigen Elo-Bereichen kaum noch möglich war. \n\n> vielleicht sind es auch einfach die server? die karte braucht ja ressourcen die den server belastet. das ist nur wieder extra lagg das man verhindern kann!\n\nDas hat nun wirklich überhaupt nichts miteinander zu tun. \n\n> aber ich sehe keinen grund warum 3v3 und aram bleiben sollten?\n\nWeil diese Modi weitaus beliebter als Dominion sind und weitaus weniger Arbeit verursachen. Dominion hatte schon immer Extra-Behandlung bezüglich Balancing und Items benötigt....und das ist ab einer bestimmten Spielerzahl einfach nicht mehr zu rechtfertigen. Aram benötigt so gut wie kein Balancing und TR ist viel näher an SR und benötigt nur selten TR-spezifisches Balancing. \n\nIch versuchs mal zu erklären. Sagt dir der Begriff Opportunitätskosten etwas? Das beschreibt im Prinzip gar keine wirklichen Kosten, sondern Gewinne die einem entgehen, weil man die Gelegenheit (daher das wort Opportunität) nicht nutzen kann, weil man statdessen etwas anderes tut. Opportunitätskosten sind im Prinzip der Grund warum Dominion nicht mehr tragbar war. \nJa, es gibt einige tausend Spieler die Dominion gerne spielen und für die ist die Änderung natürlich doof. Das alternative Szenario ist aber das folgende:\nUm Dominion spielbar zu halten, muss man im Prinzip das selbe tun, wie auch bei SR: Daten analysieren, Probleme identifizieren, Lösungen dafür finden (sprich: Champions, Items und Regeln ändern). Du brauchst dafür eine Armee von Analysten, Programmierern und Designern. Die geringe Spielerzahl in Dominion macht das keineswegs leichter, sondern schwerer, da weniger Daten vorhanden sind und diese daher weniger zuverlässig sind. Es gibt einen Grund warum Patches 2 bis 4 oder mehr Wochen auseinander liegen: Es wird tatsächlich so lange dran gearbeitet. In jeden Patch fließen tausende und zehntausend an Arbeitsstunden....und das gilt für Dominion leider genauso wie für SR. \nUnd jetzt stellt sich eben die Frage: Wenn man Rioter tatsächlich für ein paar tausend Spieler dermaßen lang an Dominion arbeiten lässt...was könnten diese Rioter in der selben Zeit alles für SR und damit für die Mehrheit der Spieler machen? Und genau das sind die Opportunitätskosten. Riot steckt Unmengen Arbeit in etwas, was nur sehr wenigen Spielern nützt und verpasst dadurch die Gelegenheit Dinge zu machen, die sehr vielen Spielern nützen. \nMan muss es auch mal von Seite der SR-Spieler sehen: Millionen von Spielern kaufen sich RP und erwarten sich davon (neben dem Produkt das sie erwerben) auch, dass von diesem Geld ihr Spiel am Laufen und in Form gehalten wird. Wäre es wirklich fair, einen beträchtlichten Teil des Geldes dieser Spieler für etwas zu verschleudern, wovon sie absolut garnichts haben? Ist das ein verantwortlicher Umgang mit dem investierten Geld der Spieler?","replies":[]},{"poster":"Shacoláde","date":"2016-02-11T10:25:51.706+0000","up_votes":1,"down_votes":0,"body":"Ich hab Dominion immer als Sandbox gesehen um Mechaniken zu trainieren und Itembuilds zu testen.\nNatürlich ist der Aufwand für Dominion zur Zeit für die Anzahl der Spieler nicht mehr tragbar.\nAls damals die Map rauskam, hatte ich sie eigentlich nur noch gespielt.\nProbleme was ich damals halt gemerkt hat, war, dass die Maps viel zu schnell vorbei waren.\nUnd die Taktischen Möglichkeiten sehr begrenzt sind. Außer dem Buff in der Mitte und den Quest für die \nVerteidigung/Angriff eines Punktes. Da hat einfach was grundlegends gefehlt, dass das Spiel wirklich einmalig macht.\nWenn man Minionscamps eingefügt hätte,  die die Line mitgepusht hätten, sobald sie zerstört wurden.\nOder z.B anstelle den Buff in der Mitte einen Boss erscheinen hätte lassen, der einen Art Baron-Buff ermöglich hätte.\nWäre die Verlagerung viel besser gewesen.\nWie es im moment war, verlor man nach 3 bis 4 Spielen die Lust weil alles gleich abläuft.\nEs wäre schon gewesen einige Events auf der Map zu starten, wie URF oder der gleichen.\nWas den Aufwand zur Erstellung der Map bentötigt hat, ist es schade, dass die Pflege danach relativ dürftig ausgefallen ist.\nIch finds schade dass die Map wegkommt, auch wenn der Grund verständlich ist.\nI will miss you Sandbox-Map {{item:3073}}","replies":[{"poster":"Z3ndom","date":"2016-02-12T03:44:40.504+0000","up_votes":1,"down_votes":0,"body":"Vllt. bringt Riot ja mal offiziel einen Snadbox-Modus raus,wie es Dota 2 geschafft hat.\nIch meine,immerhin wird an einem Replay-System gearbeitet.","replies":[]}]},{"poster":"Allmaron","date":"2016-02-11T11:48:20.664+0000","up_votes":1,"down_votes":0,"body":"Es gibt einen ganz einfachen Grund dafür warum dmonion gelöscht wurde. Server Ressourcen technisch braucht etwa jeder Spieler gleich viel Leistung. Das spiel kann auch kaum durch das entfernen der Mapgrafiken oder der Animationen für das erobern verkleinert werden.\nZudem wenn es niemand spielt braucht es auch keine Netzwerk Leistung. Der einzige Sinnvolle  Grund wahre also, dass Riot einfach wie bei den Champions die alten aufräumt oder reworkt.\nVielleicht war das Dominionrework nicht möglich oder es wird sogar geplant.  Auf jeden Fall sind Aram und 3vs3  modernen und sind von der Grafik summoners rift gerecht.","replies":[]},{"poster":"You Got My Name","date":"2016-02-11T11:06:55.051+0000","up_votes":1,"down_votes":0,"body":"Domin. Spielt keine sau, ich warte da gut 14min für ein game.\n\nAram u. 3g3 werden um einiges mehr gespielt.","replies":[]},{"poster":"Parunpata","date":"2016-02-11T10:30:08.790+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir, ohne irgendwelche Belege zu haben, ziemlich sicher, dass ARAM und 3v3 deutlich öfter als Dominion gespielt werden. Natürlich nicht so oft wie Summoners Rift, aber immernoch genug","replies":[]},{"poster":"dugg","date":"2016-02-11T06:32:12.168+0000","up_votes":2,"down_votes":2,"body":"Wie viel Ressourcen Riot für die einzelnen Maps zur Verfügung stellen muss, kann ich nicht beurteilen. Daher ist meine Aussage nun etwas spekulativ. \n\nVorweg: Ich finde es mega, dass diese Spielmodi den Client verlässt. Es war für mich immer eine ganz eigene Art Capture the Flag für LoL. Mit einem ganz anderen Primärziel, als die anderen Spielmodis (Nexus töten).\n\nDass Riot das Hauptaugenmerk auf die Kluft legt, ist für mich selbst erklärend. Dieser Spielmodus hat mit Abstand die meisten Spieler und der komplette E-Sport-Bereich baut darauf auf. Der E-Sport-Bereich ist das Aushängeschild und die größte Werbung, die Riot hat. Daher kann ich mir vorstellen, wenn man nicht mehr Ressource zu Verfügung stellen möchte, dass andere Karten darunter leiden, um den Kern richtig auf Laufen zu halten.\n\nIch kann deiner Logik nicht folgen. Denn ARAM wird viel mehr Spieler haben als Dominion.\n\nAuch wenn ich hauptsächlich 5v5 Kluft spiele, würde ich mich trotzdem sehr über einen Nachfolger für Dominion freuen, bzw. einen anderen Modus einfordern.\n\nSüffisant würde ich nun sagen, dass es schade ist, dass Dominion abgeschafft wird, weil sich nun die ganzen Bots auf die anderen Spielmodis verteilen. ;-)","replies":[{"poster":"FrankerX","date":"2016-02-11T06:35:09.412+0000","up_votes":1,"down_votes":14,"body":"ja aram hat mehr spieler als dominion.\naber hat aram mehr spieler als 5v5? nein? wozu also aram behalten? sinnlos. summoners rift ist, wie du schon sagtest, das aushängeschild. warum auch nur eine sekunde für dominion (oder aram) vergeuden? ALLE sollten sich auf SR fokusieren. also sollte aram auch gelöscht werden.\n\ndas ist riots logik so kommts mir vor.","replies":[{"poster":"dugg","date":"2016-02-11T06:43:19.341+0000","up_votes":5,"down_votes":1,"body":"Ne, Riot konzentriert sich halt einfach sehr auf die Kluft. Um Ressourcen freizubekommen, musst ein Spielmodi dran glauben. Das ist ganz normale Rationalisierung, wie es überall in Unternehmen gibt. \n\nDabei musst Dominion dran glauben, es hätte auch 3v3 oder ARAM treffen können. Nur diese Modis scheinen beliebter und einfacher zur programmieren zu sein.\n\nWenn Audi merkt, dass der A1 nicht läuft und das Unternehmen Ressourcen freisetzen muss, dann werden sie als erste den A1 vom Markt nehmen und nicht gleich alle Fahrzeuge außer den A4 (keine Ahnung welches Modell bei Audi am Besten läuft).\n\nIm Endeffekt können wir meckern, motzen und weinen, aber wir sind gegen Riot machtlos. Wir können es nur akzeptieren und vielleicht auch schön reden, aber im Endeffekt weiß Riot selbst, was für das Unternehmen am Besten ist. Auch wenn ein kleiner Bereich der User darunter leiden werden.","replies":[]},{"poster":"Alustus","date":"2016-02-11T09:47:06.419+0000","up_votes":1,"down_votes":0,"body":"Das ist wahrscheinlich einfach eine Kosten-Nutzen frage.\n\nBei einer Map die 1% des Traffics ausmacht lohnt es sich weniger zu investieren als einer Map die 10% ausmacht.\n\nEs ist jetzt zwar nicht unbedingt aussagekräfig, aber ich habe die letzten Monaten in meiner fl keinen gesehen der Dominion gespielt hat.\nWährend Aram jeden Tag dabei ist und 3vs3 alle 7 Tage.\n\nAlso da scheinbar Serverleistung eingesparrt werden muss oder neue Hinzugefügt muss man sich folgende frage stellen:\nGebe ich zusätzliches Geld aus oder nehme ich einen Modus der kaum bis gar nicht verwendet wird vom Netz.\n\nRiot hat sich für Möglichkeit 2 Entschieden, auch wenn die Möglichkeit 1 auch ohne Probleme hätten umsetzen können.\nAber da jedes Unternehmen(oder fast jedes) an Gewinnmaximierung interessiert ist kann ich diese entscheidung ganz und gar verstehen","replies":[]},{"poster":"Santas hoe","date":"2016-02-11T08:52:58.989+0000","up_votes":1,"down_votes":0,"body":"Woher hast du bitte diese logik? In dem tread, wo sie sagen das sie dominion abschalten sagen sie ganz klar, das sie es abschalten weil es nur etwa 0,5% der Spieler wirklich spielen. Also weil es wenige spielen, nicht weil es weniger spielen als ruft. Das ist ein unterschied. Meiner bescheidenen Meinung nach war es richtig, dominion abzuschalten, da es eher den vorübergehenden moden wie urf ähnelte als den, was lol eigentlich ist. \nLG\nAuraria","replies":[]}]}]}]}