{"poster":"SîLBERRÜCKEN","date":"2019-03-07T08:31:33.165+0000","title":"Wie gut muss man tatsächlich werden? Was kann ich noch tun?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Hallöchen,\r\n\r\nich habe nun folgendes Problem. Ich versuche wirklich besser zu werden als ADC.\r\n\r\n*  Ich habe angefangen meine Mechaniken gezielt zu trainieren, wie z.B. den Auto Attack Move, sodass ich das nächste Ziel zum Cursor angreife. Dadurch ist mein Kiten schon wesentlich besser geworden, sodass ich nicht mehr nur weg renne. \r\n* Auch habe ich sehr an meinem Positioning gearbeitet. Ich sterbe wesentlich weniger, sowohl in der Laning Phase, als auch in Team Kämpfen. \r\n* Weiterhin habe ich an meiner Übersicht gearbeitet, sodass ich den Jungler meist im Blick habe und auch sehe wenn die Mid Lane runter kommt, ebenso übersehe ich keine teleports mehr von der Top Lane.\r\n* Des weiteren arbeite ich an meinen Farm, der sich schon ordentlich gebessert hat, Luft nach oben ist da aber bestimmt noch. Auch wenn es hier und da am Spiel selbst liegt, wenn die Laning Phase schnell vorbei ist und es viele Kämpfe gibt.\r\n* Dazu versuche ich in der Champion Select einerseits für mich, aber nach Möglichkeit auch für das Team zu picken, sodass ich ein gutes Match Up bekomme in der Bot Lane und ich in der Lage bin auch nützlich zu sein für das Team. Ich versuche auch die Match Ups besser zu verstehen, um meine Win Conditions bzw. die Gefahren für mich besser auszuloten.\r\n* Zuletzt habe ich an meiner Einstellung gearbeitet. Das ist wohl der härteste Punkt von allen: Sich nicht aufzuregen. Es gibt unheimlich viele Spieler, die unheimlich, ich sage mal, komisch spielen. Wenn man schon den Counter Pick hat und komplett verliert muss ich das nicht ganz verstehen, aber sei es drum. Auch wenn ich merke, dass ich nur im Ansatz tilte hör ich einfach auf zu spielen. Also spiele ich wenig, aber hochkonzentriert.\r\n\r\nDas Ergebnis sieht man in den letzten 6 Spielen. Ich habe nur 3 davon gewonnen, bin aber grundsätzlich sehr zufrieden mit meiner Leistung. Abgesehen vom Twitch Game. Mein Support hat gerne 1 vs 2 gekämpft, sich vom gegnerischen Thresh hooken lassen. Da mache ich natürlich nicht viel gegen. Dazu hatten wir einen Jungler, der das Game nach 10 min. aufgegeben hat und nach dem ersten Surrender Vote, der negativ war, einfach geintet hat. Ich kann da zwar nicht viel für, aber da habe ich mich ablenken lassen und naja... bin dann auch zu viel gestorben. \r\n\r\nWarum das ganze hier? Ich möchte Vorschläge, Ratschläge, woran ich noch arbeiten kann... gibt es weitere Dinge? Sollte ich eine 2 Lane lernen, da ich derzeit nur ADC wirklich spielen \"kann\". Und wie gut muss ich noch werden, damit meine Win Rate wirklich positiv ist, was sie derzeit absolut nicht ist? \r\n\r\nLg Neo","replies":[{"poster":"Cenâreth","date":"2019-03-07T10:51:51.969+0000","up_votes":1,"down_votes":3,"body":"Wenn du wirklich besser werden willst und climben willst, spiel on-hit ADCs, Lethality MF oder APC. Mit Crit ADCs wirst du beim momentanen Stand nicht glücklich werden.","replies":[{"poster":"SîLBERRÜCKEN","date":"2019-03-07T11:03:00.770+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HK Blue Lotus,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=0002,timestamp=2019-03-07T10:51:51.969+0000)\n>\n> Wenn du wirklich besser werden willst und climben willst, spiel on-hit ADCs, Lethality MF oder APC. Mit Crit ADCs wirst du beim momentanen Stand nicht glücklich werden.\n\nIn der aktuellen Meta magst du damit recht haben. Allerdings mag ich MF eher weniger und APC auch nicht so. Ich bleibe da lieber bei Lucian, Kai'Sa, Caitlyn und eventuell mal eine Ashe oder Tristana. Mir geht es um grundlegende Mechaniken, grundlegende Tipps, um besser zu werden. Mir geht es nicht zwangsläufig darum zu gewinnen. Solange ich am Ende des Spiels sagen kann ich bin zufrieden mit meiner Leistung und denke, dass ich mich stetig verbessere, Fortschritt mache, ist selbst eine Niederlage in Ordnung für mich. Da lernt man oft sogar mehr als durch einen Sieg.","replies":[{"poster":"Revilous","date":"2019-03-07T15:26:33.365+0000","up_votes":1,"down_votes":1,"body":"Hör nicht auf den, seit die Crit items reworked wurden sind crit adcs so stark wie noch nie.","replies":[{"poster":"SîLBERRÜCKEN","date":"2019-03-07T22:16:14.509+0000","up_votes":1,"down_votes":0,"body":"Ganz so sehe ich es nicht. Stark und spielbar sind sie wieder, aber dadurch, dass andere Champions ordentlich gebuffed worden sind und das Spiel an sich schneller geworden ist, ist es nicht wie der frühere crit. ADC. Aber ich denke das geht schon in Ordnung im groben.","replies":[{"poster":"Revilous","date":"2019-03-08T09:17:10.315+0000","up_votes":1,"down_votes":1,"body":"komisch dann, dass crit adcs die höchste winrate haben, während on hit adcs die niedrigste haben.\nTop 3 adc: {{champion:222}} {{champion:29}} {{champion:22}} \nbottom 3 adc: {{champion:145}} {{champion:110}} {{champion:429}}","replies":[{"poster":"TwTv TVCurse","date":"2019-03-08T11:11:09.988+0000","up_votes":2,"down_votes":0,"body":"Ja höchste winrate, dennoch heißt das nicht automatisch dass sie so stark sind wie noch nie, die ganz alten crit items waren immernoch stärker, gaben mehr crit chance und mehr damage","replies":[{"poster":"Revilous","date":"2019-03-12T09:28:47.942+0000","up_votes":1,"down_votes":0,"body":"> Mit Crit ADCs wirst du beim momentanen Stand nicht glücklich werden.","replies":[]}]}]}]},{"poster":"zAntiM8","date":"2019-03-07T18:38:16.224+0000","up_votes":1,"down_votes":0,"body":"> so stark wie noch nie\n\n*laughs in {{item:3504}} *","replies":[]}]},{"poster":"Xplode Bobo","date":"2019-03-07T12:04:31.477+0000","up_votes":1,"down_votes":0,"body":"teste deine grenzen mit den champs und fockussier dich auf 2","replies":[{"poster":"SîLBERRÜCKEN","date":"2019-03-07T22:18:16.865+0000","up_votes":1,"down_votes":0,"body":"Ja... das ist ein guter Punkt. Das muss ich wirklich tun. Ich bin sehr vorsichtig und hasse es, wenn der Jungler diven will. Ich denke, weil ich oft meinen Schaden unterschätze und den gegnerischen Schaden überschätze nutze ich wohl nicht das ganze Potential eines Champions. Aber um auf die nächste Stufe zu kommen ist das wohl ein Punkt, wo ich nicht dran vorbei komme denke ich. Danke für den Hinweis.","replies":[]}]}]},{"poster":"SuicidePlank","date":"2019-03-07T10:54:28.022+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HK Blue Lotus,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=0002,timestamp=2019-03-07T10:51:51.969+0000)\n>\n> Wenn du wirklich besser werden willst und climben willst, spiel on-hit ADCs, Lethality MF oder APC. Mit Crit ADCs wirst du beim momentanen Stand nicht glücklich werden.\n\nAhja. Ist ja nicht so das Jinx und Twitch die höchsten WR als ADCs haben, sind ja keine Crit ADCs.","replies":[{"poster":"Cenâreth","date":"2019-03-08T11:58:11.382+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Laufplanke,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=00020000,timestamp=2019-03-07T10:54:28.022+0000)\n>\n> Ahja. Ist ja nicht so das Jinx und Twitch die höchsten WR als ADCs haben, sind ja keine Crit ADCs.\n\nDafür dass die beiden die höchste Winrate haben spielen meine Mates die allerdings dezent trash und da waren einige ADC OTPs auch schon dabei.","replies":[{"poster":"SuicidePlank","date":"2019-03-08T12:18:26.100+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HK Blue Lotus,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=000200000000,timestamp=2019-03-08T11:58:11.382+0000)\n>\n> Dafür dass die beiden die höchste Winrate haben spielen meine Mates die allerdings dezent trash und da waren einige ADC OTPs auch schon dabei.\n\nDu bist Bronze 1, natürlich haben ADCs da keine Ahnung von Positioning. \nAber dann triff keine generalisierenden Aussagen, sondern guck dir einfach ein paar Statistiken an, ich kann sonst auch sagen das Vayne richtig schwach ist nur weil Vaynes in meinem Team nicht gut waren.","replies":[{"poster":"Cenâreth","date":"2019-03-08T12:37:33.740+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Laufplanke,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=0002000000000000,timestamp=2019-03-08T12:18:26.100+0000)\n>\n> Du bist Bronze 1, natürlich haben ADCs da keine Ahnung von Positioning. \n> Aber dann triff keine generalisierenden Aussagen, sondern guck dir einfach ein paar Statistiken an, ich kann sonst auch sagen das Vayne richtig schwach ist nur weil Vaynes in meinem Team nicht gut waren.\n\nIch sag es dir offen und ehrlich, Glaube nicht einer Statistik die du nicht selbst gefälscht hast. Dass ist der Punkt von dem man ausgehen muss dass die Statistik nicht stimmt. Ich spiel selbst Crit ADC und dass weitaus nicht schlechter als alle anderen, es gibt besseres derzeit vorallem wenn man mit 3/2/17 Sivir ein S- bekommt auf derzeitigen Stand bekommt.","replies":[{"poster":"SuicidePlank","date":"2019-03-08T13:57:55.718+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HK Blue Lotus,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=00020000000000000000,timestamp=2019-03-08T12:37:33.740+0000)\n>\n> Ich sag es dir offen und ehrlich, Glaube nicht einer Statistik die du nicht selbst gefälscht hast. Dass ist der Punkt von dem man ausgehen muss dass die Statistik nicht stimmt. Ich spiel selbst Crit ADC und dass weitaus nicht schlechter als alle anderen, es gibt besseres derzeit vorallem wenn man mit 3/2/17 Sivir ein S- bekommt auf derzeitigen Stand bekommt.\n\nStimmt, deswegen benutze ich ja auch mehrere Statistik*en*, Plural. Und der Konsens ist, das Crit ADCs gerade wieder eine schönere Zeit haben als der Rest vom Schützenfest.\n\n> Ich spiel selbst Crit ADC und dass weitaus nicht schlechter als alle anderen\n\nFür deine Elo vielleicht, ja. Aber du bist Bronze 1, deine Elo sagt schon sehr viel über dein Spielverständnis aus.\n\n> 3/2/17 Sivir ein S- bekommt auf derzeitigen Stand bekommt.\n\nKP mit wenigen Toden wird sehr hoch angerechnet, also nichts besonderes/neues.","replies":[{"poster":"Cenâreth","date":"2019-03-08T17:20:59.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Laufplanke,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=000200000000000000000000,timestamp=2019-03-08T13:57:55.718+0000)\n>\n> Stimmt, deswegen benutze ich ja auch mehrere Statistik*en*, Plural. Und der Konsens ist, das Crit ADCs gerade wieder eine schönere Zeit haben als der Rest vom Schützenfest.\n> \n> Für deine Elo vielleicht, ja. Aber du bist Bronze 1, deine Elo sagt schon sehr viel über dein Spielverständnis aus.\n> \n> KP mit wenigen Toden wird sehr hoch angerechnet, also nichts besonderes/neues.\n\nSure bist ja auch Plat 1 und ADC OTP. {{sticker:slayer-jinx-wink}}\n\nWenn ich mir allerdings deine (ja auch gewonnen Spiele durchsehe, sehe ich sowohl vom DPS als von der KdA keinen einzigen Crit ADC der herausragend performed hätte, nicht mal souverän, dafür dass Crit ja eine schönere Zeit haben soll). Mit ausnahme von dem Game bei dem du Vayne drinnen hattest und der hat da nicht mal crit gebaut, also ist ja auch glasklar.","replies":[{"poster":"SuicidePlank","date":"2019-03-08T18:15:42.323+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HK Blue Lotus,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=0002000000000000000000000000,timestamp=2019-03-08T17:20:59.869+0000)\n>\n> Sure bist ja auch Plat 1 und ADC OTP. {{sticker:slayer-jinx-wink}}\n> \n \nNö, GP und der kommt der ADC Rolle schon nah. \nUnd ja, ich bin Plat 1, das ist dezent höher als du es bist. :)\n\n> Wenn ich mir allerdings deine (ja auch gewonnen Spiele durchsehe, sehe ich sowohl vom DPS als von der KdA keinen einzigen Crit ADC der herausragend performed hätte, nicht mal souverän, dafür dass Crit ja eine schönere Zeit haben soll). Mit ausnahme von dem Game bei dem du Vayne drinnen hattest und der hat da nicht mal crit gebaut, also ist ja auch glasklar.\n\nFlex ist vollkommen irrelvant, guck lieber auf die SoloQ Games an, auf Op.gg kannst du dir 5 in den letzten Tagen angucken.\nIn diesen 5 Games waren 7/9 ADCs Crit ADCs.","replies":[{"poster":"Cenâreth","date":"2019-03-10T19:49:48.704+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Laufplanke,realm=EUW,application-id=ip27PlEH,discussion-id=P1mAT9yJ,comment-id=00020000000000000000000000000000,timestamp=2019-03-08T18:15:42.323+0000)\n>\n> Nö, GP und der kommt der ADC Rolle schon nah. \n> Und ja, ich bin Plat 1, das ist dezent höher als du es bist. :)\n> \n> Flex ist vollkommen irrelvant, guck lieber auf die SoloQ Games an, auf Op.gg kannst du dir 5 in den letzten Tagen angucken.\n> In diesen 5 Games waren 7/9 ADCs Crit ADCs.\n\nJa eben genau die haben auch nicht ordentlich performed. 7/9 hat nichts von einer Performance.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Iriní","date":"2019-03-08T22:20:22.666+0000","up_votes":1,"down_votes":0,"body":"Gibt ja noch andere Dinge die man als ADC in der Lane beachten muss. \n\nMatchups richtig ausspielen. Gut farmen und nicht in der Lane sterben nutzt wenig, wenn der Gegner das auch erreicht, aber den besser skalierenden Champ hat.\nLvl 2 Powerspike durch pushen erreichen und konsequent ausnutzen.\nRichtig traden.\nWavecontrolle und Back-Timing\nMacro. (Wann ist es Sinnvoll Lanepriorität in Drakes oder Roam auf Mid umzuwandeln?) usw.","replies":[]},{"poster":"Boosthoven","date":"2019-03-08T15:42:18.576+0000","up_votes":1,"down_votes":0,"body":"Hallo,\netwas was du nicht erwähnt hast ist den gegnern Gold zu verwehren. Es ist natürlich sehr wichtig zu farmen aber es ist auch sehr wichtig den gegner Gold zu denien. Das kann man entweder durch poke/ zoning oder wavecontroll machen. habt ihr z.B einen midlaner der gut waveclearen kann und also keine Probleme hat, wenn die gegnerische Botlane roamt kann man die wave  ( sofern der erste Tower down ist ) nah an seinem inneren Tower freezen, sodass der Gegner overextenden muss um Gold zu bekommen. So sterben gegnerischen Minions und du bekommst den Farm.  Vielleicht weißt du so Sachen schon aber ich wollte es mal erwähnen. Viel Erfolg noch :)","replies":[]},{"poster":"RM Heartmeander","date":"2019-03-07T13:00:28.645+0000","up_votes":1,"down_votes":1,"body":"Du kannst versuchen deine Picks anzupassen.\nMomentan ist wie schon genannt Jinx recht stark und Draven ist auch sehr stark, da du mit ihm sehr gut snowballen kannst.\n\nWenn du mechanisch gut bist, ist auch Vayne immer recht gut solange du durch die Lane kommst.","replies":[{"poster":"SîLBERRÜCKEN","date":"2019-03-07T22:13:27.332+0000","up_votes":1,"down_votes":0,"body":"Draven... einfach nein. Ich hab es ein paar mal probiert und den kann ich einfach nicht, werde nicht warm mit Draven. Jinx ist ne Klasse Idee. Habe ich oft und gerne früher gespielt. Vayne... mechanisch zwar gut, aber bisher leider eher fail als alles andere. Daher lasse ich das vorerst.","replies":[]}]},{"poster":"SîLBERRÜCKEN","date":"2019-03-07T09:28:21.731+0000","up_votes":1,"down_votes":0,"body":"Das verstehst Du leider falsch. Es gibt nun mal solche Spiele, wo es eben vorkommt. Klar gebe ich auch dann mein bestes und ja, es ist eine Schwäche, dass ich mich dann durchaus ablenken lasse, was ich abstellen will. 100 % gebe ich aber immer. Aber weil ich mich selber ablenken lassen habe bin ich unzufrieden mit dem Spiel. Nicht weil es den inter gab, nicht weil mein Support schlecht war. Auch damit muss ich klar kommen und manchmal, egal wie gut ich dann auch spielen mag, 120 % geben mag, verliere ich es. Kommt eben vor.","replies":[]},{"poster":"SuicidePlank","date":"2019-03-07T08:53:31.543+0000","up_votes":1,"down_votes":0,"body":"> Das Ergebnis sieht man in den letzten 6 Spielen. Ich habe nur 3 davon gewonnen, bin aber grundsätzlich sehr zufrieden mit meiner Leistung. Abgesehen vom Twitch Game. Mein Support hat gerne 1 vs 2 gekämpft, sich vom gegnerischen Thresh hooken lassen. Da mache ich natürlich nicht viel gegen. Dazu hatten wir einen Jungler, der das Game nach 10 min. aufgegeben hat und nach dem ersten Surrender Vote, der negativ war, einfach geintet hat. Ich kann da zwar nicht viel für, aber da habe ich mich ablenken lassen und naja... bin dann auch zu viel gestorben.\n\nWenn du anfängst jedes Spiel nur nach irgendwelchen ,,seltsamen\" Spielern zu suchen um dich bestätigen zu lassen, dann erfüllst du dir zum einen deine Voraussage selbst, da es jedes Game komische Situationen gibt und zum anderen konzentrierst du dich nicht auf dich selbst.\n*Du* bist Dreh- und Angelpunkt, es ist vollkommen egal was das Team macht solange du dich konzentrierst und jedes Spiel 100% gibst.\nAn anderen Spielern kannst du nichts ändern, aber wenn es dir selbst schon auffällt das es dich ablenkt wenn irgendjemand dumm stirbt/runterennt, dann lass es und guck auf dich selbst.\nWas hättest du besser machen können? Was ist dein Gameplan? Wie kannst du dem Team helfen möglichst viel Gold zu generieren? Solltest du gerade da sein wo du bist oder kannst du woanders effektiver sein?\n\ntldr:\nWas andere machen kannst du nicht ändern, dich darauf zu konzentrieren bringt nichts, außer das du unkonzentriert bist, versuch jedes Spiel 100% zu geben, wenn das nicht geht, spiel Flex/Normals/auf dem Smurf.","replies":[]}]}