{"poster":"SîLBERRÜCKEN","date":"2019-04-04T08:23:19.108+0000","title":"ADC ist nur noch ein Witz","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":9,"body":"Tja... eigentlich spiele ich die Rolle ziemlich gerne. Aber mittlerweile ist es nur noch ein Witz. Es spielt keine Rolle wie ich spiele, wie sehr ich an mir arbeite, um besser zu werden. Es interessiert sowieso nicht in Solo Queue... Stehe ich gut da, gewinne meine Lane, verkackt der Jungler oder die Midlane und dann ist mein Lead nutzlos, denn gegen einen Zed, Katharina, Diana oder die 40 anderen Champions, die mich gnadenlos wegballern, habe ich letzlich alleine keine Chance. Ohne Team ist ein ADC wertlos. Da helfen dann auch die tollen Ratschläge nichts. \"Spiel sicher!\", \"Spiele mit deinem Team!\", \"Lerne zu farmen, zu kiten, dich richtig zu positionieren!\". Ja... ich habe an allem gearbeitet. Gebracht hat es ehrlich gesagt nichts. Mit Sicherheit ist da noch Luft nach oben. Aber ich merke es immer wieder. Spiele ich im 5er Team, teilweise gegen ADC's, die Platin I sind, und gewinne dort meine Lane. Weil da eben kein Jungler ist, der komplett reinkackt. Weil da keine Mitte ist, kein Support und keine Top Lane die hirnlos jeden Kampf nehmen. ADC Solo Queue ist derzeit nur noch RIP. Und interessiert mich jetzt ehrlich gesagt nicht, ob das ein \"mimimimimi\" Thread ist. Ich werde die scheiße lieber hier los bevor mein ganzer Tag versaut ist. Spielen werde ich jetzt erstmal nicht mehr. Wird Zeit das Riot endlich mal was ändert und uns wenigstens ne verdammte Chance gibt uns zu wehren gegen all den Mist, den sie eingeführt haben. Liest eh keiner von denen, interessiert sie auch nicht, denn die Community ist mittlerweile egal. Schade diese Entwicklung. Denn selbst Profi Spieler sagen, dass ADC derzeit einfach nur schlecht ist. So, bin für heute raus. Habt einen schönen Tag, hoffentlich läuft es bei euch besser wie bei mir.","replies":[{"poster":"00 M4ddin 00","date":"2019-04-04T08:55:25.912+0000","up_votes":1,"down_votes":0,"body":"Das mit dem Positening find ich auch immer gut ^^ da es quasi keine frontlines mehr gibt und eh jeder champ 12 mal dashen und springen kann ist man im Team fight nur noch sicher wenn man in der Base steht ^^ \n\nAber ich muss zugeben adc macht mir trotzdem Spaß auch wenn es nicht mehr so gut läuft bei mir :)","replies":[{"poster":"Xayah Strife","date":"2019-04-04T12:29:04.146+0000","up_votes":2,"down_votes":0,"body":"es sollte mehr Leona gespielt werden. :)\nMit Leona als Support hast immer eine Schild an deiner Seite. *-*","replies":[{"poster":"00 M4ddin 00","date":"2019-04-04T12:53:20.984+0000","up_votes":1,"down_votes":0,"body":"Ja Leona ist geil :) \nAber im Tf ist sie meistens mitten im Geschehen so das man als kleiner adc wieder alleine rum steht ^^","replies":[{"poster":"Xayah Strife","date":"2019-04-04T13:56:04.560+0000","up_votes":1,"down_votes":0,"body":"Ich sehe halt schon Tanks aber die brauchen entweder 300 Jahre um endlich mal reinzugehen oder sie gehen genau dann rein wenn du noch nicht da bist. \nIch hätte gerade ein Game mit einem Pyke auf der Botlane der das halbe Game in dem Busch war und ich immer darauf gewartet habe das der endlich mal in die Gänge kommt. Ich war Xayah also macht es schon Sinn zu warten bis er reingeht damit ich ihm mit meiner Kombo followup geben kann. Am Ende bin ich 2/2 aus der Laningphase gegangen aber das hätte auch 5/2 sein können wenn der Pyke mal weniger passive gespielt hätte. -.- \nUnd das Game ging fast 50 Minuten weil die werte Herren Garen und Volibär ewig brauchen um mal ein Fight zu starten.... -.-","replies":[]}]}]}]},{"poster":"ImTheFox115","date":"2019-04-04T08:56:33.658+0000","up_votes":1,"down_votes":0,"body":"MMh in der competitive Ligen wird immernoch ein adc gepickt, also soo schlecht können die garnicht sein...\nAber anscheinend hast du immer noch kein gutes Positioning, da du ja noch stirbst :D\n\nEins noch, du hast auf keinen Champ eine Kda über 2.9....\nSowas geht garnicht...","replies":[{"poster":"Clawler","date":"2019-04-04T09:20:06.721+0000","up_votes":1,"down_votes":0,"body":"naja Competitive hast du auch keine 4 idioten in deinem Team, er hat ja na sich nicht unrecht das ein Adc ohne Team useless ist (hat er ja gesagt) Das ding ist halt als Adc soll man ja NICHT solo carryien dürfen","replies":[{"poster":"ImTheFox115","date":"2019-04-04T09:53:21.582+0000","up_votes":1,"down_votes":0,"body":"Aber ich als Midlaner darf Solo carryn? :D","replies":[{"poster":"Uranbrennstab","date":"2019-04-04T10:11:45.826+0000","up_votes":1,"down_votes":0,"body":"Ja, denn dafür sind Midlaner konzipiert. Sie sollen Solo agieren können, dafür haben sie die entsprechenden Kits oder Items. Ein ADC hat das, bis auf wenige Ausnahmen nicht und das ist auch so gewollt. Es hat seinen Grund warum Duo Botlane die erfolgreichste ist.","replies":[{"poster":"ImTheFox115","date":"2019-04-04T14:11:26.329+0000","up_votes":1,"down_votes":0,"body":"Das macht aber irgendwie keinen Sinn xD\n\nVl meinst du, dass ADcs nicht alleine auf eine Lane gehen können, Midlaner hingegen schon?","replies":[{"poster":"Uranbrennstab","date":"2019-04-04T14:26:25.653+0000","up_votes":1,"down_votes":0,"body":"Ja","replies":[{"poster":"ImTheFox115","date":"2019-04-04T14:28:42.160+0000","up_votes":1,"down_votes":0,"body":"Das hat aber nicht mit dem Carry Potential zu tun :D","replies":[{"poster":"Uranbrennstab","date":"2019-04-05T05:46:14.821+0000","up_votes":1,"down_votes":0,"body":"Doch.","replies":[]}]}]}]}]}]}]}]},{"poster":"astrofan","date":"2019-04-04T10:16:04.833+0000","up_votes":1,"down_votes":0,"body":"Was soll ich als Support da sagen? Sollte der Gegner mal den Fehler machen und dich als ADC nicht fokussieren, kannst du die wenigsten bestrafen, ich kann ohne Team egal was der Gegner macht nichts machen, noch nicht mal so was. Also glaub mir, auch wenn der ADC ohne Team schneller abgeräumt wird hat er immer noch mehr Solo-Impact und Carry-Chancen als die meisten Supports. Und ich habe so selten ein so nutzloses Team das ich nicht das Gefühl habe mich hier beschweren zu müssen, daher kann ich sagen dass entweder a) du EXTREM viel Pech hast oder b) du dich deutlich schlechter in ein random-team integriest und deutlich mehr Fehler machst als du merkst. Ich hoffe dass es a) ist, denn das wird mit der Zeit durch die Magie der Zahlen und Statistik ausgeglichen, muss man leider manchmal durch. Wenigstens schließt du b) nicht aus, daher habe ich auch den Verdacht dass es wirklich a) ist, aber man muss sagen dass es auch eigentlich im Interesse des Teams ist den ADC zu schützen/ins Spiel zu bringen, eben weil er so viel DPS mit bringt. Die, die das nicht machen werden auf Dauer nicht viel höher als ich kommen, sollten daher eigentlich im Laufe des Jahres langsam aber sicher aus deinen Games verschwinden. Also einfach versuchen ruhig zu bleiben und nicht aufgeben, wird wahrscheinlich bald wieder besser.","replies":[{"poster":"Uranbrennstab","date":"2019-04-04T11:04:42.858+0000","up_votes":1,"down_votes":0,"body":"Naja der Unterschied ist, dass du als Supporter vier Chancen hast gecarryt zu werden. Der ADC hat meistens nur eine, nämlich seinen Support, da Mitte, Top und Jng oftmals keine Tanks, Supporter oder supportiv mages spielen.\nEntpuppt sich dein ADC also als eine Landmine, kann den Mid Assasin es vielleicht noch rumreißen. Abgesehen davon ist Support die schwerste Rolle, was Makroverständnis angeht, leider eine Eigenschaft die erst in high Elo relevant wird, denn ob da jetzt ein Gegner über eine Ward läuft oder nicht interessiert den Handelsüblichen Iron bis Dia Pleb nicht wirklich. \n\nTatsache ist aber auch, dass dein Team aufgrund mangelnder Abstimmung oftmals zwar versuchen die Gegner aufzuhalten und vom ADC fernzuhalten, aber alle auf den selben gehen oder einfach auf den gegnerischen ADC durchdiven.\nUnd ich kann dir versichern nichts ist unangenehmer als der Moment, wenn dem Gegner klar wird, dass alle CDs raus sind und er freie Hand gegen dich hat. Dann wir man gerne mal von drei Leuten hochgenommen, obwohl dein Team es eigentlich gut gemeint hat. Aber gut gemeint ist nunmal das Gegenteil von gut gemacht.","replies":[]}]},{"poster":"Uranbrennstab","date":"2019-04-04T10:13:45.505+0000","up_votes":1,"down_votes":0,"body":"Als ADC Main in der Lowelo kann ich vielen Punkten nur zustimmen. Es macht in den meisten Fällen schlicht und ergreifend keinen Spaß ADC zu spielen. Für den Großteil der Spieler wäre es sehr entgegen kommend wenn man Schaden rausnehmen und Mobilität bzw Wiederstandskraft erhöhen würde.","replies":[]},{"poster":"SîLBERRÜCKEN","date":"2019-04-04T10:17:15.949+0000","up_votes":1,"down_votes":1,"body":"Einiges mag vielleicht sogar stimmen was ihr sagt. Das Match Making ist ein großes Problem. Sehe ich ebenso. Aber meiner Meinung nach gibt es derzeit zu viele Champions, die Solo enorm viel ausrichten können ohne großartig dafür was tun zu müssen. Als ADC muss man so viel besser sein als jeder andere im Team, um irgendwie gute Leistungen zu erzielen. Jeder falsche Schritt ist fatal. Eine falsche Entscheidung und man geht drauf. Und man ist oft in absoluten Zwickmühlen. Das Gegner Team hat 1-2 Assasinen? Ich brauche Rüstung oder Magie Resistenz. Die haben einen dicken Tank der Dornenpanzer geht? Ich brauche Lebensraub und Rüstungsdurchdringung. Die haben beides in Kombination? Ich brauche also irgendwie Rüstung/Magie Resistenz, dazu noch Lebensraub und Rüstungsdurchdringung. Ahja... ich bin ja der Carry... irgendwie muss ich auch noch Schaden machen... Und das ist nur ein Bruchteil der Probleme. Ohne Team ein unlösbares Problem. Und da frage ich mich leider schon wie fair das ist? Nicht sehr fair gerade. Warum? Es gibt viele andere Champions, die gestopft, ein Team brauchen, um sie aufzuhalten. Ich als ADC brauche immer mein Team und bin sonst nutzlos. Wir sollten wieder solo carrien können. Das geht derzeit nicht. Daher ist ADC ein Witz gerade.","replies":[]},{"poster":"Clawler","date":"2019-04-04T08:51:41.402+0000","up_votes":1,"down_votes":1,"body":"Das ding ist ich glaube du siehtst den Wald vor lauter bäumen nicht mehr. Im Endeffekt bei allem was du schreibst sagst du nicht das adc schlecht ist sondern einfach deine 'mates' da diese reininten. overall  ist das einfach ein Problem des Matchmakings(was ja ein lang bekanntest Problem ist).","replies":[]}]}