{"poster":"Eye of Kraken","date":"2016-04-04T15:57:34.645+0000","title":"Nulla è cambiato","subforum":"Discussioni generali","up_votes":4,"down_votes":5,"body":"E io che pensavo che si fosse tutto risolto con il tempo, lascio passare qualche mese, gioco solo normal e anche poche, torno a giocare 1 ranked per vedere se la situazione si &egrave; pacificata.. eee. sorpresa!\r\nTop che di consueto feeda e flamma, jungler che va afk al livello 5, io e il mio adc che proviamo miseramente a fare miracoli, stavamo giocando bene , come il midlaner, ma senza jungler, possiamo scordarci controllo sulla jungle nemica e sugli obiettivi, veramente , stavamo giocando al massimo, non meritavamo quella sconfitta.\r\nOra, io non ho detto una singola parola in quel game per evitare tilt ma veramente certe persone, veramente negative e anti cooperative si meriterebbero un bel ban, almeno nelle ranked, perch&egrave; finche succedono in normal queste cose va bene, ma quando &egrave; in ranked.\r\nContinuate a prendere sottogamba il problema, si dai, avanti!","replies":[{"poster":"Hell88","date":"2016-04-04T16:22:59.945+0000","up_votes":4,"down_votes":1,"body":"credo che il premade con persone veramente fidate sia l'unico modo attualmente per evitare spiacevoli incontri.","replies":[]},{"poster":"Sorcio84","date":"2016-04-04T18:05:16.531+0000","up_votes":1,"down_votes":1,"body":"Beh pensa che i bot che farmano exp ora farmano anche chiavi.\n\nServe una rivalutazione sul prezzo degli account venduti...\n...anche se sta cosa non dovrebbe esistere","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T18:20:22.128+0000","up_votes":2,"down_votes":0,"body":"E' ridicolo sono indifferenti a TUTTO!\ni bot nelle 3 v 3 oramai li trovi 3 partite su 4 , e loro fanno finta di non vederli, bah , se questa è serietà.","replies":[{"poster":"Sorcio84","date":"2016-04-04T19:16:12.869+0000","up_votes":2,"down_votes":0,"body":"Segnalabbi tempo fa alcuni siti , una 30ina, tra vendita account e altro.\n\nSe per il mage update ci saranno ancora ondate di bot, rendo tutgo pubblico sulla mia pagina FB sperando che siano gli utenti a mettersi in moto per tentare di bloccare almeno un poco questa cosa","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T19:46:49.980+0000","up_votes":1,"down_votes":0,"body":"Posso avere il nome della pagina?","replies":[{"poster":"Sorcio84","date":"2016-04-05T00:50:59.397+0000","up_votes":1,"down_votes":0,"body":"https://m.facebook.com/profile.php?id=1670526023183980&v=feed&_rdr\n\nFB Sorcio84\n\nDiciamo chd l'obiettivo è fornire info per migliorare come meccaniche e mindset condividendo sia le info che trovo sia le esperienze personali","replies":[]}]}]}]}]},{"poster":"Dainsleif09","date":"2016-04-04T16:14:14.849+0000","up_votes":1,"down_votes":0,"body":"beh....la situazione in ranked non può cambiare in meglio a distanza di mesi,posso anche capirti:non è bello quando qualcuno va afk,il flame inizia a dilagare e tutto va in malora.\nposso solo dirti di tirarti su e continuarne a fare,ma non da solo possibilmente.\nse trovi qualcuno con cui fare duo o trovi un team ti assicuro che se perderete brucerà decisamente di meno fidati^^","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T16:30:18.651+0000","up_votes":1,"down_votes":0,"body":"il fatto è che eravamo in duo, il mio amico era in mid e stava giocando divinamente, ma quanto si trova certa gente è impossibile vincere :c","replies":[{"poster":"Hell88","date":"2016-04-04T16:41:34.122+0000","up_votes":2,"down_votes":2,"body":"purtroppo mi duole dirlo ma il forum è pieno di esempi come il tuo...Risultato?nessuno fà nulla.","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T18:22:18.611+0000","up_votes":2,"down_votes":0,"body":"Oramai chi vuoi che faccia qualcosa, è tutto corrotto e le persone al comando anche.","replies":[]}]},{"poster":"Dainsleif09","date":"2016-04-04T16:47:22.215+0000","up_votes":1,"down_votes":0,"body":"specialmente con un afk =/","replies":[]}]}]},{"poster":"Azharidan","date":"2016-04-04T16:50:43.541+0000","up_votes":1,"down_votes":1,"body":"Lol è sempre stato quel che è stato, è alla gente è sempre piaciuto per quel che è stato .\nNON DEVI COMBATTERE IL FLAME, DEVI ACCETTARLO !","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T18:19:17.866+0000","up_votes":2,"down_votes":0,"body":"Ti piace un atmosfera negativa? Così non miglioreranno mai le cose, mai","replies":[{"poster":"Azharidan","date":"2016-04-04T19:54:24.313+0000","up_votes":1,"down_votes":0,"body":"Il fatto è che le comunità di tutti i giochi sono negative, è inutile provare a battere la testa sul muro dicendo che LoL è l'unico ad avere questo problema .\nImpara a divertirti, impara a scherzare in chat, è quello che sto facendo ormai per divertirmi e seppur gran parte delle volte feddo alla grande permetto alla gente di divertirsi per quel che si può .","replies":[]}]}]},{"poster":"Hype GENERAL ZOD","date":"2016-04-04T17:14:32.751+0000","up_votes":2,"down_votes":0,"body":"Purtroppo in un gioco di squadra quello che l'individuo merita nn esiste, conta solo quello che merita la squadra, se la tua squadra aveva un feeder e un afk meritava di perdere nonostante gli altri 3 fossero bravi. Noi eravamo 4 premade e il 5 era uno arrivato al liv30 quel giorno stesso senza rune e maestrie a caso. Meritavamo un compagno simile ? No eppure....","replies":[]},{"poster":"Firenheit","date":"2016-04-04T17:04:21.607+0000","up_votes":1,"down_votes":2,"body":"Ho fatto una rank oggi, tanto per, mi ritrovo un mid laner che tilta, scrive espressamente che non vuole partecipare e che dobbiamo goderci la sconfitta. \nNel suo profilo ha parecchie sconfitte di fila e il suddetto giocatore sta continuando a giocare, a prescindere da quello che scrive e dal feeding intenzionale: basta controllare la sua cronologia di tanto in tanto. \nSe verrà bannato ormai è troppo tardi, se non verrà bannato è la dimostrazione di un qualcosa che non funziona. \n\nNon prendiamoci in giro per favore, è uno schifo, a prescindere dal vincere o dal perdere l'atmosfera è orrenda.\nLa soluzione è una, non giocarle e rilassati in normal. ","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T18:14:36.918+0000","up_votes":2,"down_votes":1,"body":"Assolutamente sincero,\nUn giocatore per essere in rischio di ban deve aver combinato già parecchi guai, nonché brutte esperienze ad altri giocatori ripetutamente.\nSinceramente io vedo molte parole ma pochi fatti, come in questo paese d'altre parte...","replies":[]}]},{"poster":"LionHeartV","date":"2016-04-04T16:51:21.874+0000","up_votes":1,"down_votes":1,"body":"putroppo questa è la norma nelle rank","replies":[{"poster":"Eye of Kraken","date":"2016-04-04T18:15:17.248+0000","up_votes":1,"down_votes":0,"body":"Eh già , anche se non dovrebbe esserlo","replies":[]}]}]}