{"poster":"NGN Endon","date":"2016-07-13T13:13:42.495+0000","title":"Ekko to much dmg for the kit","subforum":"Champions & Gameplay","up_votes":2,"down_votes":4,"body":"finde das ekko zu viel schaden mit seinen f&auml;higkeiten macht \r\n ekko hat ne vayne passiv die oneshoten kann und nen movespeed buff gibt\r\nne ahri q die slowt und n ring gibt \r\nn jump der l&auml;nger is als ein flash oder ne ahri ult \r\nn stun und n shild\r\nund dann noch diese ult dazu  \r\n\r\n\r\nekko:\r\nslow \r\nshild \r\nstun \r\njump/doge \r\nvayne passiv\r\nand his ult\r\n\r\nf&uuml;r das alles find ich das er viel zu viel schaden macht \r\n\r\n\r\nis doch unfair das der champ dass alles hat und noch dazu so richtig viel schaden macht","replies":[{"poster":"Furielfriend","date":"2016-07-13T14:19:18.461+0000","up_votes":1,"down_votes":0,"body":"Ekko ist so ein \"Kann alles aber nur eines richtig\" Typ\n\nEr kann nicht pauschal gegen jeden Gegner gleich gut sein. Er kann nicht gut auf Distanz Poken und im Nahkampf bedingt Traden.(er braucht 3 Treffer, damit er überhaupt anfangen kann). Er braucht \"Zeit\" um den Gegner bearbeiten zu können und wenn du dich darauf einlässt, dann gibts zu ihm die Möglichkeit seine Stärken auszuspielen: dich gnadenlos zu Verfolgen.\n\nGuter Matchup gegen Ihn: \n- Ein Champion, der sicher aus der Ferne einen Nahkämpfer bestrafen kann, wenn der mit seinem Nahkampf farmen will.\n(BEISPIELE: Azir, LeBlanc, Teemo, Lissandra)\n- Ein Champion, der schnell und stark(!) Schaden im Nahkampf austauschen kann.\n(BEISPIELE: Wukong, Darius, Jarvan IV,Yasuo)\n\nHandycap Matchup gegen Ihn\n- Ein Champion, der auf längere Duelle ausgelegt ist. (Hier entscheidet wirklich der individuelle Skill der Spieler das auskommen)\n(BEISPIELE: Jax, Swain, Riven, Fiora, Garen)\n- Ein Champion, der einen Lock-down hat. Wenn man seine Fähigkeitenrotation benutzt hat und dann eine Weile warten muss wegen der Abklingzeiten.\n(BEISPIELE: Cho'gath, Malphite, Morgana, Jayce, Zilean)\n- Ein Champion, der auf Engage oder Kite angewiesen ist. Wenn man nicht erfolgreich angegriffen hat, kommst du nicht mehr von ihm weg.\n(BEISPIELE: Talon, Diana, Akali, Maokai, Shen)","replies":[]},{"poster":"Lagbeard","date":"2016-07-13T13:23:43.045+0000","up_votes":1,"down_votes":0,"body":"Ekkos Kombo ist im vergleich zu anderen Assassins ziemlich langsam. Sein Schild und sein Stun erfordern vorarbeit und sind Leicht vermeidbar. Gutes Positioning und schnelle, gezielte CC sind für jeden Assassin tödlich, und Ekko hat sehr wenig Möglichkeiten, diesem zu entgehen, abgesehen von seiner Ult. Ekko kann man sehr leicht durch Positionierung und Predictions countern: Man kann der Zeitspule ausweichen, das Stunfeld verlassen und sich von seinem Schatten fernhalten. Ekko ist daher sehr auf sein Team angewiesen, und entfaltet seine volle Effektivität im Follow-Up. Wenn er ein sichers Feld landet oder mehrere Spieler in seine Ultimate bekommt, ist er extrem stark, dafür muss aber voher einiges getan werden. \nDazu noch der Fakt, dass Ekkos Kombo relativ (Verglichen mit anderen Assassins) relativ langsam und damit unterbrechbar ist. Man kann ihn dadurch zum disengagen zwingen. Er macht für einen Assassin überraschend viel Konstanten Schaden, kommt dafür aber nicht an das Oneshotpotential eines Kha´Zix oder einer Diana heran. \n\nVon daher: Ich finde ihn Balanced.","replies":[]}]}