{"poster":"Astra Leah","date":"2016-07-03T00:45:02.381+0000","title":"Need help, victim to exploit.","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"My display name in league has been changed to something fairly offensive. I&#039;m not sure if it is reflected on these message boards.\r\n\r\nI&#039;ve submitted a report ticket, but I&#039;d appreciate a faster response. Due to familiar relationships this forced change makes me sick to my stomach.","replies":[{"poster":"SephirothSG","date":"2016-07-03T01:43:08.595+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nYou've done the right thing in submitting a ticket to Player Support.\n\nUnfortunately there's nothing we can do to expedite  your ticket or provide you assistance here on the boards as this situation needs to be investigated by the Player Support team.\n\nRest assured that as soon as your ticket is picked up the account will be locked to prevent any further unauthorised changes (This will be displayed as a ban when you attempt to log in to the game, do not worry). Once Player Support has concluded their investigation into the account and the account is deemed secure you should be able to run through the account recovery process with them.\n\nHowever while you wait, lets try and figure out how this happened.\n\n* Have you entered your login credentials into any suspect third party sites?\n  * Remember, any and all league related promotions will be hosted on the following domains (Or a subdomain of these *.domain.com)\n   * www.riotgames.com\n   * www.leagueoflegends.com\n   * www.lolesports.com\n* Have you downloaded any suspicious software recently that may have been infected?\n* Is your antivirus up to date?\n  * What antivirus are you currently using?\n  * Have you run a system scan recently?","replies":[{"poster":"Astra Leah","date":"2016-07-04T03:22:31.233+0000","up_votes":1,"down_votes":0,"body":"Mmh the problem is. Neither my Emails nor my passwords have been compromised.\n\nUsing a separate password for each and every account of mine. All of 16 characters long each.\n\nAll I do is have League, TERA, FFXIV and a couple of steam games installed. Only thing recently was Visual Studio 2016 and the Adobe Master Collection.\n\nI use a variety of Adblocking Software and Javascript blocking software in my browser. I currently run a daily Malware Bytes scan and I use Avast as a run of the mill AV.\n\nI'm used to having attempted Phishing emails through playing Runescape in my earlier years and thankfully using dummy accounts first because of it sounding 'too good to be true'.","replies":[]}]}]}