{"poster":"Ben Kenobi","date":"2016-01-27T04:17:18.775+0000","title":"Da tu +1 para pedir el Traspaso a BR GRATIS","subforum":"Charlas Generales","up_votes":1547,"down_votes":238,"body":"Simplemente eso, ya van 3 partidas Ranked que pierdo gracias al server, primero termine 7-3 en ranked y de las 3 derrotas, 2 fueron por el server. Ahora juego recién, 4 argentinos con lag contra 5 chilenos sin lag, ni Derrota Evitada dieron.\n\nMe quiero pasar a BR y no pienso pagar por errores del server, exigimos el traspaso a BR gratis al menos hasta que se solucione\n\n\nSi quieres contribuir da +1. Gracias.\n\nEDIT: Compartan este topic con sus amigos para que más gente lo vea y así tener mayor repercusión (también aumenta la probabilidad de recibir una respuesta de algún Rioter).","replies":[{"poster":"Rexx77","date":"2016-01-27T21:33:13.431+0000","up_votes":57,"down_votes":6,"body":"Es chistoso, aprovechando el rato que tengo ahora, se me dio por mover una linea de 280 KB paralelos (estáticos - ISP Speedy), que tenia sin uso, la conecte a una portátil solo para hacer algunos tests, y probando a todos los puntos posibles de Chile, el mas alto me dio 44 MS de retraso, lo mismo hice con otra linea de 10 MB paralelos (estáticos - ISP Telecentro - uso general en mi casa), probé varios tests a todos los puntos posibles de Chile y el retraso mas alto fue de 39 MS, lo mismo hice con una conexión dedicada de 100 MB (estáticos - ISP Fibertel - uso para el trabajo), los mismos tests a todos los puntos posibles, el retraso mas grande fue de 37 MS (ciertamente no hay mucha diferencia), si van al foro, a la sección de soporte, en el siguiente post http://las.leagueoflegends.com/es/registros-de-red, y da la opción de descargar una herramienta para testear y reportar al soporte, esta misma cuenta con algunas direcciones IP que son fáciles de localizar, por otra parte pueden usar los mismos IPS y hacer los tests por uds mismo, resulta que la parte cómica es que estas son las supuestas direcciones del servidor (espero no equivocarme), y probando con todas las conexiones, la que menos me dio fue un retraso de 412 MS, algo similar a lo que tengo dentro del juego, con esta información creo poder formular una pregunta que resuma todo el asunto, o quizá mas...\n\n1- ¿Nos toman por idiotas?\n2- ¿Aun siguen culpando a un supuesto problema de corte de fibra ajeno a ustedes?\n3- Si realmente esto se debe a problemas de corte como dicen, y que es algo que ocurre de forma extrañamente recurrente, ¿Porqué siguen usando el mismo proveedor?, ¿O sera que están utilizando el proveedor mas mediocre y económico?\n\nFuente: http://boards.las.leagueoflegends.com/es/c/charlas-generales/vwlXgOGX-problemas-de-conectividad-ene-23?comment=00aa\n\nEsto no es mio pero lo vi en uno de los tantos post del foro y se me ocurrio compartirlo para que mas gento lo vea {{champion:432}} ","replies":[]},{"poster":"Agish","date":"2016-01-27T06:26:38.808+0000","up_votes":47,"down_votes":4,"body":"parece que el server de BR es el paraíso xD\nvoy a juntar rp y me paso estoy harto del lag y encima harto de algunos chilenos que me insultan solo por ser argentino diciendome xenofobo, narizón o cualquier estupides cuando ni si quiera les habia insultado ._.","replies":[{"poster":"JulianELR","date":"2016-01-27T17:40:57.907+0000","up_votes":22,"down_votes":14,"body":"pues yo soy chileno y también hay argentinos que me insultan porque si u.u\nLamentable que por culpa de algunos se mire de mala manera a un país en concreto :C","replies":[{"poster":"Chillout","date":"2016-01-27T18:45:04.582+0000","up_votes":14,"down_votes":6,"body":"Soy argentino y no trato mal a los chilenos.","replies":[]}]}]},{"poster":"Landidzu","date":"2016-01-27T23:56:13.953+0000","up_votes":41,"down_votes":4,"body":"Pero en el server brasilero no entenderíamos nada... ya es suficiente mi capacidad traductora en el actual con tantas \"weas\".","replies":[{"poster":"Whitesse","date":"2016-01-28T03:26:19.750+0000","up_votes":4,"down_votes":2,"body":"En LAS tenes que mutear a todos, cual es la diferencia ?","replies":[{"poster":"TerrSinManos","date":"2016-05-02T11:13:04.281+0000","up_votes":6,"down_votes":0,"body":"En BR sería lo mismo... los brasileños no son conocidos por su amabilidad jugando videojuegos, y más aún si están jugando con/contra argentinos...","replies":[]}]}]},{"poster":"ESPANDER","date":"2016-01-27T23:10:22.116+0000","up_votes":37,"down_votes":7,"body":"LOS RIOTERS SOLO CONTESTAN CUANDO LES CONVIENE, SINO NI APARECEN COMO AHORA, PONGANSEN LAS PILAS, YA UN MONTON DE GENTE ESTA DEJANDO DE JUGAR Y LO SABEN MUY BIEN{{champion:32}}  {{sticker:slayer-jinx-unamused}} {{item:3094}} {{summoner:11}} +1 SI COINCIDÍS ASI LO VEN TODOS ALA RESPUESTA","replies":[]},{"poster":"Guusstii","date":"2016-01-27T04:50:46.707+0000","up_votes":19,"down_votes":2,"body":"en brasil me tira 59 ms saludos me fui de las","replies":[]},{"poster":"Merevith","date":"2016-01-27T22:41:19.348+0000","up_votes":14,"down_votes":1,"body":"Nadie dice nada? Nadie da una respuesta? Nisiquiera un \" che, estamos trabajando en arreglar el tema \"..., No nada, ni una puta respuesta, hace como 3 dias que esta andando para el orto y nadie dice nada.","replies":[]},{"poster":"Chagasi","date":"2016-01-27T05:45:31.867+0000","up_votes":11,"down_votes":0,"body":"Me tira 60ms con arnet 3 mb desde misiones, argentina en el sv BRm. Ahora en LAS me tira 170ms clavados y antes de todo este problema, cuando comencé a jugar al lol me tiraba 101ms clavados.","replies":[]},{"poster":"SoNC El Contador","date":"2016-01-27T05:19:13.840+0000","up_votes":12,"down_votes":3,"body":"como te va amigo :\ndejame que te cuenta mi experiencia propia . yo jugaba en las estaba en bronce 2 creo o 3 no recuerdo bien cuestion que estaba cansado del server y de sus multiples problemas , la gente toxica , afk , gente hablando todo el tiempo en el chat , constante pelea entre los parees , etc... Asique un dia decidi pasarme a br y la verdad fue lo mejor que hice porque a final de ese año termine en platino 2 (recorda que era bronce) me gusto muhco mas el juego y de paso aprendi un poco de pt br :D. mi consejo es que te juntes un poco de rp y te pases de una cualquier cosa que necesites no dudes en hablarme que te ayuudo en lo que sea . un saludo !\n\nPD: esta cuenta es la que uso para jugar con mis amigos que me quedaron en las","replies":[{"poster":"Ben Kenobi","date":"2016-01-27T05:28:15.001+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=SoNC El Contador,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=0006,timestamp=2016-01-27T05:19:13.840+0000)\n>\n> como te va amigo :\n> dejame que te cuenta mi experiencia propia . yo jugaba en las estaba en bronce 2 creo o 3 no recuerdo bien cuestion que estaba cansado del server y de sus multiples problemas , la gente toxica , afk , gente hablando todo el tiempo en el chat , constante pelea entre los parees , etc... Asique un dia decidi pasarme a br y la verdad fue lo mejor que hice porque a final de ese año termine en platino 2 (recorda que era bronce) me gusto muhco mas el juego y de paso aprendi un poco de pt br :D. mi consejo es que te juntes un poco de rp y te pases de una cualquier cosa que necesites no dudes en hablarme que te ayuudo en lo que sea . un saludo !\n> \n> PD: esta cuenta es la que uso para jugar con mis amigos que me quedaron en las\n\nBR es mucho mejor, se aprende mas, se juega callado y todo, yo era Diamante 5 y ahora quede Platino 3, tengo amigos que juegan y BR y lo recomiendan mucho, LAS esta hecho un asco, y mas con este lag. SALUDOS!","replies":[]}]},{"poster":"Diabetox","date":"2016-01-27T04:44:36.899+0000","up_votes":11,"down_votes":1,"body":"{{champion:90}} Primero te recomiendo crearte una cuenta aparte para ver si anda bien en BR","replies":[]},{"poster":"Daryel12","date":"2016-01-28T00:58:26.257+0000","up_votes":9,"down_votes":0,"body":"Pos no lo van a hacer. A lo más para distraernos nos daran otro aumento de PI. TE APUESTO QUE DARAN PI","replies":[]},{"poster":"Roronoa Zoro","date":"2016-01-28T00:57:21.867+0000","up_votes":8,"down_votes":0,"body":"Dejó mi experiencia, esta es mi cuenta en  LAS para jugar con amigos, me pase después que termine la temporada a BR, en LAS quede en platino 2 y en la pree season en br quede en diamond 5. Cuestión que en br por más que no entiendas un carajo (porlomenos cuando putean) la pasas genial si lo tuyo es sólo rankear, hay muchísimo más nivel de juego, más respeto en el sentido de picks en champion select, entre otras cosas. Ojalá RIOT te escuche y se puedan pasar gratis, por que vale la pena. Si tienen dos buenas cuentas en LAS yo recomiendo pasarse a BR, si no tienen dos cuentas no les conviene pasarse por que se van a aburrir si no juegan sólo ranked. Hasta marzo no voy a jugar en BR por vacaciones , pero si se pasan agreguen mi nick BR: kokoro punch op\n           LAS:    Roronoa zoro \nPd: no entiendo como RIOT no contesta tu propuesta, me indigna, +1 a vos.","replies":[{"poster":"Ben Kenobi","date":"2016-01-28T01:11:26.835+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Roronoa Zoro,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=0047,timestamp=2016-01-28T00:57:21.867+0000)\n>\n> Dejó mi experiencia, esta es mi cuenta en  LAS para jugar con amigos, me pase después que termine la temporada a BR, en LAS quede en platino 2 y en la pree season en br quede en diamond 5. Cuestión que en br por más que no entiendas un carajo (porlomenos cuando putean) la pasas genial si lo tuyo es sólo rankear, hay muchísimo más nivel de juego, más respeto en el sentido de picks en champion select, entre otras cosas. Ojalá RIOT te escuche y se puedan pasar gratis, por que vale la pena. Si tienen dos buenas cuentas en LAS yo recomiendo pasarse a BR, si no tienen dos cuentas no les conviene pasarse por que se van a aburrir si no juegan sólo ranked. Hasta marzo no voy a jugar en BR por vacaciones , pero si se pasan agreguen mi nick BR: kokoro punch op\n>            LAS:    Roronoa zoro \n> Pd: no entiendo como RIOT no contesta tu propuesta, me indigna, +1 a vos.\n\nComentarios como estos son los que faltan, concuerdo al 100% con vos, saludos !","replies":[]}]},{"poster":"El Nano","date":"2016-01-27T23:13:58.919+0000","up_votes":8,"down_votes":2,"body":"Yo solo quiero que me den 5 pe pa compra un vinito pa toma con lo pi en la pla zaaaaaaaaaa","replies":[]},{"poster":"Knegro","date":"2016-01-27T23:03:21.738+0000","up_votes":5,"down_votes":0,"body":"como sabemos q no nos van a dar ni bola :v yo me voy creando mi cuenta en brasil :V y bueno de paso aprendo portugues xD","replies":[{"poster":"Yumi","date":"2016-01-28T08:33:03.213+0000","up_votes":5,"down_votes":0,"body":"esa es la actitud carajo!","replies":[]}]},{"poster":"Blue Blur","date":"2016-01-27T23:31:03.165+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=GigoLóL de nait,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=,timestamp=2016-01-27T04:17:18.775+0000)\n>\n> Simplemente eso, ya van 3 partidas Ranked que pierdo gracias al server, primero termine 7-3 en ranked y de las 3 derrotas, 2 fueron por el server. Ahora juego reci&eacute;n, 4 argentinos con lag contra 5 chilenos sin lag, ni Derrota Evitada dieron.\n> \n> Me quiero pasar a BR y no pienso pagar por errores del server, exigimos el traspaso a BR gratis al menos hasta que se solucione\n> \n> Si quieres contribuir da +1. Gracias.\n\nEste chabon tiene toda la razon,no tenemos porque comernos las sobras que nos da riot","replies":[]},{"poster":"Darkwich Zero","date":"2016-01-27T14:54:56.969+0000","up_votes":6,"down_votes":1,"body":"Che, yo te puedo dar todos los likes que quieras. Pero Riot no va a dejar se ser cataño. {{champion:17}}","replies":[]},{"poster":"SexyTryHard","date":"2016-01-27T04:56:10.823+0000","up_votes":7,"down_votes":6,"body":"***","replies":[{"poster":"Ben Kenobi","date":"2016-01-27T05:06:32.194+0000","up_votes":9,"down_votes":4,"body":"> [{quoted}](name=SexyTryHard,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=0005,timestamp=2016-01-27T04:56:10.823+0000)\n>\n> En realidad es \"mejor\" que no halla traspaso, porque entonces se irían todos a otro server de mientras (ejemplo: Brasil) y harían el mismo flammeo a gente de ese servidor, que no habla el mismo idioma y habrían muchos mas peleas (molestaríamos a gente de otro server, lo cual si eso le pasara a otro server el tema del lag, a nosotros no nos gustaría que se viniese gente extranjera al nuestro). Mi mejor solución? Esperen a que se solucione el problema, esto pasa todos los años, juegén a otros juegos de mientras, no sean de mente cerrada y piensen solo en jugar LoL xD solo hasta que se arregle, cuando se arregle se vuelve y listo, este problema no es nada nuevo, suele pasar una vez por año.\n> \n> PD: Para ciertas personas, con hacer temas insultando no ganan nada, solo ganan que los baneen, si quieren expresar su problema y molestia sobre el tema háganlo, para eso están los foros, pero siempre con respeto, no sean niños y comíenzen a insultar y quejarse porque de jugar todos los días no puedan jugar por unos 4 días solamente {{champion:17}}\n\nNo tiene sentido lo que dijiste.\n1- A mi no me molestaría que vengan de otros servidores a jugar a LAS.\n2- Gente flamer hay en todos los servers, no tiene relación a que jueguen de LAS o de cualquier otro lado.\n\nCapas a la gente no les gusta otros juegos, esto es una falta de respeto para los jugadores, que no den Derrota Evitada cuando se estaba jugando Ranked o cosas así.","replies":[{"poster":"HardBass","date":"2016-01-27T06:20:20.451+0000","up_votes":2,"down_votes":7,"body":"> [{quoted}](name=GigoLóL de nait,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=00050000,timestamp=2016-01-27T05:06:32.194+0000)\n>\n> No tiene sentido lo que dijiste.\n> 1- A mi no me molestaría que vengan de otros servidores a jugar a LAS.\n> 2- Gente flamer hay en todos los servers, no tiene relación a que jueguen de LAS o de cualquier otro lado.\n> \n> Capas a la gente no les gusta otros juegos, esto es una falta de respeto para los jugadores, que no den Derrota Evitada cuando se estaba jugando Ranked o cosas así.\n\n1- No todos son como vos, todas las personas somos distintas.\n2- Hablar diferentes idiomas sí ocasiona conflictos, aunque no lo creas.","replies":[{"poster":"Ben Kenobi","date":"2016-01-27T06:23:39.386+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=FranTheCapo,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=000500000000,timestamp=2016-01-27T06:20:20.451+0000)\n>\n> 1- No todos son como vos, todas las personas somos distintas.\n> 2- Hablar diferentes idiomas sí ocasiona conflictos, aunque no lo creas.\n\nLo que quiero decir es que no tiene ninguna relación el jugar en otro servidor el hecho de ser de diferente región, mucha gente juega en NA y BR y de hecho se hace mas interesante, la gente flamer y los que respetan estan en TODOS lados, no por ser de otra región tiene que haber conflicto. Lo de los idiomas no tiene nada que ver, conozco gente que ni habla en el chat y juega lo mas tranqui, es cuestión de usar bien los pings y nada mas.","replies":[]}]}]},{"poster":"Wolfk","date":"2016-01-27T08:53:37.805+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SexyTryHard,realm=LAS,application-id=v7qsfXsE,discussion-id=rpvq54o5,comment-id=0005,timestamp=2016-01-27T04:56:10.823+0000)\n>\n> En realidad es \"mejor\" que no halla traspaso, porque entonces se irían todos a otro server de mientras (ejemplo: Brasil) y harían el mismo flammeo a gente de ese servidor, que no habla el mismo idioma y habrían muchos mas peleas (molestaríamos a gente de otro server, lo cual si eso le pasara a otro server el tema del lag, a nosotros no nos gustaría que se viniese gente extranjera al nuestro). Mi mejor solución? Esperen a que se solucione el problema, esto pasa todos los años, juegén a otros juegos de mientras, no sean de mente cerrada y piensen solo en jugar LoL xD solo hasta que se arregle, cuando se arregle se vuelve y listo, este problema no es nada nuevo, suele pasar una vez por año.\n> \n> PD: Para ciertas personas, con hacer temas insultando no ganan nada, solo ganan que los baneen, si quieren expresar su problema y molestia sobre el tema háganlo, para eso están los foros, pero siempre con respeto, no sean niños y comíenzen a insultar y quejarse porque de jugar todos los días no puedan jugar por unos 4 días solamente {{champion:17}}\n\n1 vez por año? Este año todavia no tiene 1 mes encima y ya van al menos 3 veces en las que paso esto. Y 4 dias con problema de lag es bastante hermano, no se si a vos no te afectara, no habras perdido 1 ranked o mas por este tema, o capaz que simplemente no tenes lag y hablas por hablar, total, los que se joden son otros. Y te comento macho, las rankeds que se pierden, el lp y mmr que baja cada vez que perdes por una de estas razones, los bolsillos gordos de LAS no te lo recompenzan, no te dicen \"Bueno muchacho, sabemos que en esa ranked no fue tu culpa las mil trecientas desconexiones que tuviste, fue problema nuestro, aca te lo recompensamos.\" Si no que nos dan un \"esta fuera de nuestro alcance este problema\" y fue, nosotros nos cagamos, los que nos ganaron la partida debido al problema festejan contentos y al final terminamos perdiendo nosotros, porque ademas de varios haber comprado RP en el pasado, nos estan dando un servicio inestable, como se si puedo rankear mañana cuando en cualquier momento, con esta inestabilidad que hay, puedo sufrir otra desconexion y perder mas lp? Tener que bancarme los insultos de mi team diciendome \"Argentino qlo, pa ke jugas?\" (Ayer me dijeron eso cuando me desconecte en una ranked por este tema\" como si yo fuera a saber que el server iba a tener estas complicaciones.\n\nRiot Games ya de por si es una empresa multimillonaria, no deberia tener muchos problemitas con estos temas, siendo uno de los eSports mas jugados como que da para pensar que este juego tenta tanta repercusion en el mundo pero aun asi tenga lugares donde apenas se preocupan por sus usuarios.","replies":[]}]},{"poster":"panther189","date":"2016-01-27T22:57:10.792+0000","up_votes":1,"down_votes":8,"body":"cuesta aprox 150 pesos, o sea nada. trabajen como dicen algunos xd\nConste que acabo de jugar una lo mas normal y la mitad se cayo para la mayoria menos los chilenos que nos tiraton todo xd.","replies":[{"poster":"Neistadt","date":"2016-01-27T23:06:26.819+0000","up_votes":7,"down_votes":0,"body":"Con 150 pesos me compro otras cosas, yo no soy tan pelotudo como para tirar plata **a la basura**, no se vos. No pienso poner 1 peso por un juego que es \"Free to play\" pero no puede mantener un fucking servidor activo y funcionando decentemente","replies":[]}]},{"poster":"SupahStranger","date":"2016-01-28T19:30:56.602+0000","up_votes":4,"down_votes":0,"body":"Creo que estamos pidiendo algo que no es imposible para ustedes señores de Riot, piensen que más allá de ustedes hay toda una comunidad que de verdad gusta de jugar al LoL y de forma placentera..","replies":[]},{"poster":"Liiisaaann","date":"2016-01-27T23:06:07.019+0000","up_votes":2,"down_votes":1,"body":"A mi me acaban de dar derrota evitada, pero con los que jugué de mi team no les dió eso. Y eramos 3 arg y 2 chilenos... Esos 2 chilenos no les dió evitado. No entiendo porqué. \n\nDEMANDO EL PASE AL SERVIDOR DE BRASIL Y LA POSIBILIDAD DE UTILIZAR EL SERVIDOR BRASILERO EN ESPAÑOL.","replies":[{"poster":"Todesskiller","date":"2016-01-28T11:03:20.767+0000","up_votes":4,"down_votes":0,"body":"amigo te cuento que el idioma se puede cambiar con un programa fijate en la cuenta de statikk, pero lo del server brasilero si","replies":[]}]},{"poster":"Matterz","date":"2016-01-28T06:58:04.035+0000","up_votes":3,"down_votes":1,"body":"Flaco, sabés que hay lag desde hace rato, sabés que todavía no tenemos respuesta oficial para cuándo se va a resolver, en definitiva\n\nSabés que el server anda para la mierda.\n\nLo que te tendría que decir tu sentido común, cosa que veo yo no te lo ha dicho, es que NO RANKEES.","replies":[{"poster":"CoronavirusC0V","date":"2016-01-28T08:52:19.971+0000","up_votes":5,"down_votes":1,"body":"puede ser que les haya pasado como ami que revise el ping en 1na personalizada y ma andaba maso normal 60-70, jugue 1na normal tambien bien y justo cuando me mande a 1na ranked me salen con 140 ms clavados y el cartelito reanundando conexion mientras perdes sin hacer nada","replies":[]}]},{"poster":"AFK en el baño","date":"2016-01-28T01:55:02.058+0000","up_votes":8,"down_votes":4,"body":"me chupa un huevo los chilotes, el server es pa LAS y debería andarnos bien a todos, y si nos estan cagando a nosotros minimo un cambio a BR gratis pa los argentos por los daños ocacionados :s","replies":[]},{"poster":"The pollo loco","date":"2016-05-29T19:06:41.634+0000","up_votes":3,"down_votes":0,"body":"Consejo: juga siempre 1 partida normal antes de la ranked, si no anda bein no seas salame y juga otro dia las rankeds","replies":[]},{"poster":"jugate","date":"2016-01-28T01:33:30.276+0000","up_votes":3,"down_votes":0,"body":"riot que estas esperando? Ponelo gratis!\n\nsir dal ayudanos con esta causa!","replies":[]},{"poster":"NightGlow","date":"2016-01-28T00:14:43.883+0000","up_votes":3,"down_votes":0,"body":"Que fácil es recibir el dinero, como así también desoír los reclamos y peticiones... \nSiempre he creido que aquellos que ignoran a otros, sea el motivo que sea, no son dignos de confianza, ni mucho menos de perdón...\nR.-\n\nPD: Recuerdo que la última vez que ingresé para comentar algo, fue para reclamar por un ping de 180ms fijos por más de 6 meses. La de mentiras y vueltas que me hicieron dar... Nada ha cambiado al parecer, y la confianza se va de nuevo...\n","replies":[]},{"poster":"JuanRomanTeemo","date":"2016-01-27T23:42:09.694+0000","up_votes":3,"down_votes":0,"body":"Yo no sé, hace rato me toco tener un chileno de compañero y en vez de solidarizarse y decir \"el server anda mal\" no, estos argentinos que no pagan un buen internet, a ver amigo chileno, yo también juego en LAS, y por ende debería andarme bien cuando tengo bien mi ISP, se quejan de llenos. Hace 2 años que yo juego con 100 de ping porque se cortó un tramo de fibra e hicieron otro empalme el cual es más largo por ende me da más lag, con 100 de ping no me quejo, pero que me de picos de 400 300 190 ms y 3 seg de delay? cuando en BR anda entre 50 y 70 de ping? no hermanos chilenos están equivocados, invertí mi tiempo en LAS mínimamente deberían resarcir el daño ocasionado porque el server esta en chile porque así lo decidió la empresa (supuestamente por las mejores conexiones) ahora bien... pasarme a BR me sale $350 (ARS) que no los tengo ya, porque tengo que gastar cuando lo que anda mal es el server? hagan algo...","replies":[]},{"poster":"o Trafalgar o","date":"2016-01-27T23:34:34.879+0000","up_votes":3,"down_votes":0,"body":"Em....como lo digo con delicadeza ... por mi, que pongan el server en Japón o en la India pero que lo trasladen porque donde esta no le veo mucho futuro, quiero decir, por el lugar donde esta creo que va a tardar mucho en progresar LAS.","replies":[]},{"poster":"NodeJS","date":"2016-01-27T23:31:39.559+0000","up_votes":3,"down_votes":0,"body":"58ms el server brasilero con Arnet, no probe con Fibertel todavia... cuando LAS andaba bien tenia 48ms... YA ME PASO AL SERVER BRASILERO, CON O SIN AYUDA DE RIOT...\n\nNo hay ni que esperarlos, si todos nos vamos al de Brasil RIOT va a tener que hacer algo.","replies":[]},{"poster":"bzheks","date":"2016-01-27T23:25:59.257+0000","up_votes":3,"down_votes":0,"body":"+1","replies":[]},{"poster":"R0VeRg4lArG4","date":"2016-01-27T22:54:02.537+0000","up_votes":3,"down_votes":0,"body":"Recién estaba jugando con el servidor supuestamente estable con 50 ms, aunque normalmente tenía 35ms, empezó a andar como el orto como no es ninguna novedad, y para colmo los otros 5 eran chilenos, y empezaron con el \"naringas qliaos pobres wn jajaja xdxdxdxd !!!\" Estaban perdiendo asquerosamente y la terminaron ganando, porque literalmente no nos podiamos mover de base. Chilean4Win\nProbe en BR y tengo 40 de ping ESTABLES, tranquilamente podrían haber puesto los dos sv fisicamente en Brasil (el propio de BR y el de LAS) desde un principio y abrir oficinas comerciales en Chile, pero no prefierieron, ganar más $$$ poniendo el sv allá, en vez de hacer las cosas bien","replies":[]},{"poster":"KCDL","date":"2016-01-27T22:49:50.719+0000","up_votes":3,"down_votes":0,"body":"Por favor, que hagan esto, es imposible jugar con lo mal que anda.","replies":[]},{"poster":"Bird Lover","date":"2016-01-27T22:42:59.131+0000","up_votes":3,"down_votes":0,"body":"Esta la verdad me parece el reclamo mas humano y posible, al menos que sea como LAN, ES LITERALMENTE EL MISMO CASO, SOBRE TODO PARA URUGUAY, vamo arriba, por lo menos mitad de precio, vamo arriba, no hacer esto sería de normal macabro vil y en plan de falta de respeto para el jugador.\nPD: primera partida en semanas  http://imgur.com/9aMpKEO Obviamente era una de las 10 primeras.\nPor favor, muchos de nosotros tenemos una segunda cuenta en LAS que nos encantaría pasar para poder disfrutar el juego en el otro servidor mientras las conexiones chile - argentina funcionan mal.","replies":[]},{"poster":"Bot Ezreal","date":"2016-01-27T20:40:32.510+0000","up_votes":3,"down_votes":0,"body":"También me quiero pasar a BR, pero dudo que nos dejen pasar gratis, yo no quiero darle un peso mas a Riot","replies":[]},{"poster":"Xan Irelia","date":"2016-01-27T04:25:10.532+0000","up_votes":4,"down_votes":1,"body":"por como esta el serve deberia ser gratis pasarse al menos para probar como te anda ahi y decidis donde quedarte","replies":[]},{"poster":"Ryu NoCaretas","date":"2016-07-13T23:34:36.035+0000","up_votes":2,"down_votes":0,"body":"yo me cree una cuenta en BR y tenia 150ms clavados , mientras en LAS  tenia 70-80  (lo normal con una conexion de 3 mb de SPPEDY ) .  ya pueden matarme a newgativos","replies":[]},{"poster":"I am bl4z","date":"2016-01-28T14:48:18.185+0000","up_votes":2,"down_votes":0,"body":"Si, pásense a BR, en realidad debieron darse cuenta antes la mayoría de los chilenos jugamos allá xD aunque los brazucas siempre nos dicen argentinos O.o","replies":[]}]}