{"poster":"Bela B","date":"2015-10-06T18:37:17.867+0000","title":"Spiel laggt sobald 2 im selben WLAN spielen","subforum":"Hilfe & Support","up_votes":4,"down_votes":1,"body":"Zu meinem Problem:\r\n\r\nSeit ca. einem halben Jahr kommt es zu **massiven Pingeinbr&uuml;chen**, **sobald ein zweiter im gleichen WLAN LoL spielt** (200-4000 Ping). Durchschnittlich habe ich einen 60 - 70 Ping und bei jedem anderen Spiel das zeitgleich gespielt wird, kommt es zu keinerlei Komplikationen. Das hatte &uuml;berraschenderweise vor einem Monat ein Ende, nachdem wir unsere Nvidia Updates gemacht haben (Vielleich liegt es auch nicht unbedingt an den NVIDIA Updates). Jedoch vor zwei Wochen fing es wieder mit dem alten Problem an... alleine alles tadellos... zusammen die H&ouml;lle... :) Ich vermute das wir eventuell  Daten (welche auch immer) &uuml;ber das WLAN austauschen aber das ist nur eine Vermutung, da ich mich damit nicht 100% auskenne. Ich w&uuml;rde mich &uuml;ber einen L&ouml;sungsvorschlag freuen, und falls bestimmte Daten von Laptops, bzw. Router ben&ouml;tigt, kann ich damit nat&uuml;rlich aushelfen :)\r\n\r\nLg Belathemaster","replies":[{"poster":"legofreak1","date":"2015-10-06T19:00:24.492+0000","up_votes":5,"down_votes":0,"body":"WLAN ist an sich eine eher schlechte alternative zum zocken, da es wie dein Beispiel zeigt, sehr störanfällig ist. Außer eure WLAN-Verbindung zu verbessern kann ich dir nur empfehlen, auf LAN umzusteigen.","replies":[{"poster":"Bela B","date":"2015-10-07T07:59:11.742+0000","up_votes":1,"down_votes":0,"body":"Hm, wenn alles nicht hilft werd ich das wohl machen müssen...Wäre recht umständlich da ich jeden Tag mit dem Laptop außer Haus bin :/\n \nTrotzdem natürlich danke für die Antwort :)","replies":[]}]},{"poster":"Termii TFT","date":"2015-10-06T19:07:53.286+0000","up_votes":2,"down_votes":0,"body":"das liegt wohl nicht an deinem Inet oder lol, sondern einfach daran, wie euer Router Daten verarbeitet und weiterleitet. Das Problem könnte man **vielleicht **mit anderen Einstellungen beheben, wobei ich dir dabei nicht weiter helfen kann. Ich bin froh, dass mein Router vernünftig funzt.\nVersuch mal ein paar Geräte aus dem Wlan zu nehmen, wenn ihr lol zockt. Smartphones etc. Wenn das nicht klappt, musst du wohl oder übel in Foren wie chip.de nach Hilfe suchen oder auf Wlan verzichten.","replies":[{"poster":"Bela B","date":"2015-10-07T07:56:08.801+0000","up_votes":1,"down_votes":0,"body":"Sind nur zu zweit im WLAN, also daran kann es nicht liegen. Werde wohl (wieder einmal) nach WLAN Router Einstellungen suchen :/\n\nDanke für die Antwort :)","replies":[]}]},{"poster":"FreeZorZonE","date":"2015-10-06T18:52:18.006+0000","up_votes":1,"down_votes":4,"body":"also ich denke mal... euer Internet is einfach kacka? dat könnte sein mein Schnuggi","replies":[{"poster":"Bela B","date":"2015-10-07T08:00:32.491+0000","up_votes":1,"down_votes":0,"body":"Nein, das könnte nicht sein da es ja wie beschrieben bei allen anderen Aktivitäten einwandfrei funktioniert..","replies":[]}]}]}