{"poster":"GUNILZ","date":"2018-02-23T12:49:02.264+0000","title":"Connection Probleme nach der Champ Select","subforum":"Hilfe & Support","embed":{"description":null,"url":"https://pastebin.com/JeySHKKK","image":"https://pastebin.com/i/facebook.png"},"up_votes":1,"down_votes":0,"body":"Moin,\r\n\r\nich habe seit ca. 2 Wochen das Problem, dass ich mich nach praktisch jeder Champselect nicht zu den Servern connecten kann, und es daher jedes Mal wieder ein Gl&uuml;cksspiel ist, ob ich nach dem 2ten oder nach dem 20ten mal reconnecten bzw. &uuml;berhaupt connecten kann. \r\nIch habe bereits erfahren, dass es sich dabei um Probleme mit einem speziellen Internet Provider handeln soll, wollte/sollte aber trotzdem noch mal einen Thread mit meinen Daten aufmachen. siehe:  https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/wl21jt2v-verbindungsprobleme-nach-der-championauswahl\r\n\r\nAnbei noch der Link f&uuml;r meine Logdateien.\r\n\r\nSch&ouml;ne Gr&uuml;&szlig;e \r\n\r\nGUNILZ","replies":[{"poster":"silibum","date":"2018-02-23T12:55:48.925+0000","up_votes":2,"down_votes":0,"body":"Hallo,\n\ndanke für die Routenverfolgung. Wie Du ja bereits vermutet hast bist auch Du betroffene. Es ist auch bei Dir so, dass Du als Kabel-DE Kunden immer mal wieder Probleme haben wirst. Leider kann Dir hier (wie Du ja bereits im anderen Thread gelesen hast) keiner genau sagen wann es wieder 100% zuverlässig funktioniert. Hier ist der Anbieter leider in der Verantwortung - allerdings sind die Erfolgschancen als \"Kunde\" dort etwas zu verbessern gegen 0.\n\nAls kleine Lösung kannst Du das hier versuchen wenn Du mal nicht ins Spiel kommst (das ist aber keine Garantierte Lösung für Routing probleme, das funktioniert nur bei lokalen Problemen):\n\n> *   Schreib im Startmenü **cmd** in die Suche\n*   Wenn cmd gefunden und markiert wurde, starte diese durch die Tastenkombination Strg+Umschalt+Enter als Administrator\n*   Führe folgende Kommandos in der Eingabeaufforderung “/cmd” aus:\n\n>*   netsh int ip reset\n*   netsh winsock reset\n\n>*   Starte Windows neu\n*   Teste nun, ob das Problem weiterhin besteht\n\nAn sich ist die Routenverfolgung auf Pastebin aber im Rahmen. Die meisten haben auch eher in der Prime-Time (17-21 Uhr) Probleme. Erstelle zu dieser Zeit bitte auch noch mal einen Tracert.","replies":[{"poster":"GUNILZ","date":"2018-02-23T13:31:28.600+0000","up_votes":1,"down_votes":0,"body":"Alles klar werde ich machen :). Danke schon mal für die schnelle Antwort!\n\nLeider funktioniert deine kleine Lösung auch nicht :(\n\nMfG GUNILZ","replies":[{"poster":"Sidia","date":"2018-02-23T13:37:04.409+0000","up_votes":1,"down_votes":0,"body":"Ein Programm wie WTFast würde vermutlich helfen, leider besteht hier das Problem der kosten","replies":[{"poster":"GUNILZ","date":"2018-02-23T14:23:07.741+0000","up_votes":1,"down_votes":0,"body":"Bin gerade ingame und es hat beim ersten Mal geklappt... ist halt echt einfach nur random^^\n\nDanke für den Tipp, werde mir das mal angucken","replies":[]}]}]}]}]}