{"poster":"Lęvi","date":"2019-12-30T22:59:06.001+0000","title":"¡Sublimes Team Reclutando!","subforum":"Reclutamiento","up_votes":8,"down_votes":0,"body":"Estamos en busca de jugadores y 1 analista para nuestra escuadra. Se reclutan jugadores para que se desempeñen en los carriles de TOP, ADC y JUNGLE, tenemos 3 equipos en nuestro roster, el año que viene vamos con todo al circuito nacional. Se necesita 1 por cada línea menos jungla que buscamos 2 de ellos.\r\n\r\nRequisitos para jugador:\r\n- Ser mayor a 17 años.\r\n- Tener buena disponibilidad.\r\n- Buena actitud y comportamiento.\r\n- Competencias comunicativas y buena aceptación de críticas constructivas.\r\n- No flamear.\r\n- Respetar los horarios de entrenamiento.\r\n- Ser Diamante IV o más.\r\n- Demostrar buena jugabilidad en macro y micro game.\r\n- Tener micrófono y discord.\r\n- Dominio avanzado de su línea además de un amplio champion pool.\r\n- Ganas de aprender y mejorar.\r\n- Presentar cuentas en arenagg y battlefy.\r\n- Motivación personal y tener muchas ganas de mejorar.\r\n\r\nRequisitos para analista:\r\n- Ser mayor a 17 años.\r\n- Contar con un mínimo de experiencia.\r\n- Buena disponibilidad.\r\n- Buena actitud y comportamiento.\r\n- Tener una buena capacidad de análisis de partidas y de jugadores en sí.\r\n- Tener micrófono y discord.\r\n\r\nOfrecemos:\r\n- Entrenamiento personalizado para mejorar tanto en equipo como en solo Q.\r\n- Mejorar competencias comunicativas.\r\n- Apoyo psicológico en caso de que no te encuentres bien.\r\n- Ayudarte a crecer como jugador de League of Legends.\r\n- Torneos con premios en RP o dinero todos los fines de semana desde el 18 de Enero en adelante.\r\n- Llevarte al circuito nacional.\r\n- Ayudarte a dominar todos los campeones en todas las líneas.\r\n\r\n> Si te interesa pertenecer a nuestra escuadra por favor dejame tu comentario y/o agregame al LOL! Si no puedes escribir mi nombre de invocador te lo dejo por acá ''Lęvi''.\r\n\r\n\r\nAtte. Lęvi, Head Coach de Sublimes Team.","replies":[{"poster":"ThatVayneAgain","date":"2020-01-09T12:28:37.734+0000","up_votes":1,"down_votes":0,"body":"Hola levi, estoy realmente interesado!\n\nNick: ThatVayneAgain\nRol: ADC\nLiga: D2\n\nAmplio pool champ, con muchas ganas de mejorar y aprender!\n\nCualquier contacto a mi cuenta o a mi cuenta de instagram: S0rzal","replies":[]},{"poster":"Ąvÿ","date":"2020-01-05T14:28:40.268+0000","up_votes":1,"down_votes":0,"body":"Mi nick en el game es Arv, me interesa. Saludos","replies":[]},{"poster":"Jürî","date":"2020-01-02T11:39:44.621+0000","up_votes":1,"down_votes":0,"body":"https://las.op.gg/summoner/userName=J%C3%BCr%C3%AE agregame al lol, ahora esta bugeado el cliente y no me deja entrar y seguro despues me olvido de agregarte xd","replies":[]},{"poster":"Friscio","date":"2019-12-31T00:50:16.135+0000","up_votes":1,"down_votes":0,"body":"Pides demasiadas cosas para lo que ofreces, te recomiendo empezar por algo mas de abajo e ir creciendo con ello, busca gente que tenga una base formada respecto a valores como seriedad, profesionalismo, actitud, ganas, etc.","replies":[{"poster":"Lęvi","date":"2019-12-31T01:21:47.317+0000","up_votes":1,"down_votes":1,"body":"Y bueno te ofrezco ser de los mejores jugadores del servidor con entrenamiento personalizados, igual acá se pide mucho porque está lo mejorsito, no cualquiera entra al equipo pero de todas maneras gracias por tu recomendación.","replies":[{"poster":"Friscio","date":"2019-12-31T03:09:30.883+0000","up_votes":1,"down_votes":0,"body":"No se ofrece ser de los mejores jugadores del servidor con entrenamientos personalizados, son cosas que se consiguen y que se pueden conseguir por cuenta propia. Funde una organización que compitió profesionalmente en distintas áreas y actualmente estoy encabezando un proyecto como Mánager en donde cuento con jugadores TOP del servidor, 4 analistas y 1 coach todos Tier 2. No te hablo desde la ignorancia o el hateo, tómalo como critica constructiva. Aun así te deseo éxitos y si puedo ayudarte en algo me avisas.","replies":[{"poster":"Lęvi","date":"2019-12-31T12:52:36.686+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por tu respuesta, me parece muy correcta tu información ya que se nota que sabes de lo que hablas, hubo un fallo mío en la respuesta que te di anteriormente ya que igual pensé que me escribías no en una buena intención como la mayoría de los jugadores del server pero ya veo que no, asi queque muchas gracias. Si te sirve de dato yo igual he entrenado algunos equipos y nos fue bastante bien, estuve algún tiempo en el top challenger de 2016 hasta 2017 más o menos que fue cuando dejé de jugar entonces si entiendo bien de lo que hablas (Lęvi es una de mis smurfs). A mi parecer un jugador si puede mejorar mucho con entrenamiento y humildemente te escribo que el entrenamiento que yo brindo es muy muy bueno basandome en los resultados obtenidos, entonces si un jugador que fuera diamante 2 entrenara conmigo estoy seguro que rápidamente subiría a grandmaster y el mérito pasaría a ser de el player por subir y mío por ayudarle. Mucha suerte con tu proyecto y gracias por ofrecerme tu ayuda, contactame si también llegas a necesitar algo!","replies":[{"poster":"Friscio","date":"2020-01-02T06:57:59.575+0000","up_votes":1,"down_votes":0,"body":"Sí, es entendible, por eso mismo termine aclarando que iba con buena intención, el servidor es pésimo y cada vez empeora mas, por eso mismo ya no hay jugadores profesionales en LAS. Te acepte y luego te elimine porque no te recordaba, llevo varios días jugando en Brasil, ahora te reenvío la solicitud.\nPuedes brindar un entrenamiento perfecto, eso no te lo niego, pero si el jugador no tiene una base o los pilares fundamentales no va a saber tomar esa información y llevarla a la practica. Aun así desconozco tu manera de trabajar por lo que no la voy a criticar. Con entrenamientos personalizados pensé que te referías a scrims, por eso puse que cualquiera podía acceder.\nNuevamente, reitero, si necesitas algo me avisas o pides un contacto mas directo por el LoL. ¡Buen comienzo de año!","replies":[]}]}]}]}]},{"poster":"Hatakë","date":"2020-01-02T02:25:05.296+0000","up_votes":1,"down_votes":0,"body":"soy main supp platino 1 subiando :(, sirve?","replies":[]},{"poster":"LightBlueGonza","date":"2019-12-31T17:30:18.604+0000","up_votes":1,"down_votes":0,"body":"Me interesa bastante! Soy main AD D1 uwu ....","replies":[]},{"poster":"Ąbusive","date":"2019-12-31T00:12:26.663+0000","up_votes":1,"down_votes":0,"body":"Firmame el pad Levi","replies":[]},{"poster":"Køkęøts","date":"2019-12-30T23:17:06.139+0000","up_votes":1,"down_votes":0,"body":"Levi soy tu fan","replies":[]},{"poster":"VenganceZ","date":"2019-12-30T23:05:48.910+0000","up_votes":1,"down_votes":0,"body":"como haces esa \"e\" medio rara con el teclado?","replies":[{"poster":"Lęvi","date":"2019-12-30T23:12:01.233+0000","up_votes":1,"down_votes":1,"body":"Lęvi, ahí está compañero! para hacerla no sabría explicartelo jaja.","replies":[]}]}]}