{"poster":"Transcender","date":"2017-01-12T05:25:53.357+0000","title":"Prove to me with video evidence how ADC can 1v3 and win their lane","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":4,"body":"&quot;No amount of experimentation can ever prove me right; a single experiment can prove me wrong.&quot; - Albert Einstein\n\nif 50% win rate is what one will achieve being average relative to the performance of every other player in the game. For one to achieve a desired win rate, they will need to be 5 times the win rate in effectiveness relative to the average of every player in their game.\n\nFor example, to achieve an 80% win rate, they will need to be 30% over the average which is 50%. So 30% multiplied by 5 is 150%.\n\nbeing 150% more effective than the average of the players on your team means you will have to be a total of 250% effective to the average of your teammates.\n\nI believe ridiculously strongly that luck plays the initial part of winning the game, if the luck is too far out of your favour, then your actions do not become relevant to the relevant outcome of a game. (win or loss)\n\nOver 3 years it has not been proven to me exactly how and why everyone claims that luck is mostly about skill and has very little to do with luck.\n\nSo I would like video evidence of how an ADC can play out and STOMP a standard bot lane while their support is severely handicapped, in essence, a 1v3.\n\nI have been told it is easy for them to do, but I have looked up and could not find any video evidence of this event occuring.\n\nI have been told they consistently can achieve an 80% win rate and this is basically the requirement to achieve it.\n\nWould someone kindly take the time to prove me wrong with video evidence?","replies":[{"poster":"Anıma","date":"2017-01-12T06:52:44.624+0000","up_votes":2,"down_votes":0,"body":"Even challenger players have came along and shat on all of your arguments to the point where you can't respond most of the time. You try to be logical and you feel like you are but you are **unbelievably** ignorant and naive. Faker could tell you this stuff and you would tell him he's illogical and doesn't know what he's talking about because you are so caught up in your ignorance. You're actually painful to watch sometimes. \n\nYou can get an 80% win rate if you're very good. I cannot give you video evidence as I do not record smurf games but you can achieve 80%. A lot of it comes down to not missing cs (hard with no attack speed in runes!), being able to punish people for every mistake and miss-step and constantly using things like the trading stance to get free damage down. You're good at none of this. You may think you're good and if you wanna test it, 1v1 me.\n\n> \"No amount of experimentation can ever prove me right; a single experiment can prove me wrong.\"\n\nIt's a very good quote, in science. \n\nIt's a terribly inaccurate and non applicable quote, in League of Legends.\n\nI could go indepth on it but I really cbf\n\nhttps://www.youtube.com/watch?v=xoCBU8PNTFw -- Watch the first couple of minutes, look at the trades, see how he is 2v1ing and winning? You can pull this off constantly with positioning and knowing how to trade well. If you were playing this you would either die, deal 0 damage in trades, or get traded back on terribly. \n\nI can try to plays.tv my smurf games and show you but the way you think and act, nothing will get through to you even if you say it will.","replies":[{"poster":"Transcender","date":"2017-01-12T09:37:04.822+0000","up_votes":1,"down_votes":0,"body":"He literally states in that video, \"its more about the enemy playing bad than me playing better\"\n\nHe is not winning 1v2, the leona is there using her relic shield for the first 2 minions which allows gosu to instead of last hitting the minion, to use that time to auto the enemy and start an advantage for himself. He did not simply play the lane by himself or without his support doing their job for the first few minutes.\n\nI do not reply to certain posts not because I have nothing to say, but because I would rather not reply to them because usually they can't see situations for what they are.\n\nLike I said, logical conversation usually does not prevail as people find their own beliefs more valuable than anyone who opposes it.\n\nVideo evidence which is apparently everywhere, or I am not going to change my perspective.","replies":[]}]},{"poster":"Neosinf","date":"2017-01-12T05:31:51.378+0000","up_votes":2,"down_votes":0,"body":"What is this really all about?\n\nMy brother, who has wronged thee?\n\nTELL ME AND I WILL TOLL THE BELL THAT CALLS THE FAITHFUL TO BLOODY VENGEANCE","replies":[{"poster":"Transcender","date":"2017-01-12T05:56:05.260+0000","up_votes":1,"down_votes":0,"body":"Everyone claims that matchmaking is accurate yet I believe it is not, so I want video evidence to prove me wrong, rather than trying to have logical conversations with people about why it is not, because humans are not known for their logic.\n\nSince I can't seem to climb I cannot be a witness to make my own claims valid because of the social stigma that players who are low elo don't know how the game or system works and therefore cannot comment on it with validity. So I can't prove that I am right and my comments do not have the value they would if I had climbed and said the same thing.","replies":[{"poster":"Neosinf","date":"2017-01-12T06:28:03.784+0000","up_votes":1,"down_votes":0,"body":"You have valid points my friend. No one can 1v3 as adc and win. All it takes is 3 noobs to use 3 ultimates on you and you've lost. There have been times i have pwned 2-3 players as an adc. But 100% that was always with an advantage, like they were low health or my turret was killing them. It's not a sustainable lane state.\n\nMatchmaking is accurate but it doesn't use LP or rank, it uses the mmr algorithm based on the elo system and bets for you or against you. You'll likely never have a 50/50 chance game to gain 20lp or lose 20lp. It's probably more like '40% chance of winning against this stronger opponent, for 50 points of their elo (+50 you, -50 them), and 60% chance of losing, giving them 25 points of your elo (-25 you, +25 them)'. If you win, you get the higher share cos odds were against you, but if you lose, you only lose a little. Then Riot tries to make it less confusing by slotting you into divisions with an Lp rating.\n\nIt could just be at the moment matchmaker is betting against you because it thinks you should be a lower elo.\n\nPlayers who start losing games find they just cant seem to get a good matchup over a whole series - from 10 to 20 games even - they start blaming themselves and their teams - but really its because matchmaker keeps slotting them into 40/60 games and betting against them. Eventually you'll start playing games that you just can't lose cos your opponents are so bad, and matchmaker will start a reversal of 60/40 games.\n\nIf you get into a 40/60 game you need to be calm and focused - the upset win could be yours! Then you'll show matchmaker who's boss!","replies":[{"poster":"Transcender","date":"2017-01-12T09:03:41.481+0000","up_votes":1,"down_votes":0,"body":"That is not how mmr works, that is how LP gain and loss works.\n\nmmr will only give you less per loss and more per win if the enemy team average mmr relative to your teams is higher.\n\nYour LP gain and loss is then exclusively attributed to your current rank and mmr relative to each other.","replies":[{"poster":"Neosinf","date":"2017-01-12T09:48:43.742+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=whitePumah,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0000000000010000,timestamp=2017-01-12T09:03:41.481+0000)\n>That is not how mmr works, that is how LP gain and loss works.\n\nELO is like +50win-20loss LP is more like +25win-25loss. LP is a moderating system with tiers so you have a more visible rank, and dont fall or gain too quickly, resulting in more confidence with your position the ladder.\n\n> [{quoted}](name=whitePumah,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0000000000010000,timestamp=2017-01-12T09:03:41.481+0000)\n> mmr will only give you less per loss and more per win if the enemy team average mmr relative to your teams is higher.\n\nThank you for summarising what i said\n\n> [{quoted}](name=whitePumah,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0000000000010000,timestamp=2017-01-12T09:03:41.481+0000)\n> Your LP gain and loss is then exclusively attributed to your current rank and mmr relative to each other.\n\nWell no. You start 1200 elo and 1200 lp. You win a stacked game against you. You get 50 elo but only 20 lp. you lose a game stacked against you. You are now 1240elo but only 1200lp cos you lost what you gained in lp. You play the next game. Now you're like 'why am i still playing 1250's (gold) when im only 1200 (silver)'. Because your elo and lp are different. Then matchmaker tries to make your mmr the same as your lp and vice versa. But really only a soft reset or placement games help rito get them back in line.","replies":[{"poster":"Transcender","date":"2017-01-12T10:23:25.489+0000","up_votes":1,"down_votes":0,"body":"I mean end result is we are both assuming the system based on experience and cannot actually conclude what we are saying, which is why I am asking for VIDEO EVIDENCE of what has been stated by high level players and riot themself.\n\nI did not ask for walls of text about what people think I am doing wrong. I am asking for video evidence of proof of what everyone is telling me, not advice, not an explanation, a straight up video of what people claim.","replies":[{"poster":"Neosinf","date":"2017-01-12T10:32:31.823+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=whitePumah,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=000000000001000000000000,timestamp=2017-01-12T10:23:25.489+0000)\n> \n> I did not ask for walls of text about what people think I am doing wrong. \n\nI wrote a wall of text explaining why you have valid points.\n\nWhat I was saying was you can't get an accurate 50/50 chance game. You'll get the odds stacked against you or for you in regards to mmr right from the moment you click 'accept'. It has a massive impact on your win chance.\n\nThen there are more odds - how tired/tilted are you teammates, are they looking to win or try a champ? is this a good comp? will they play aggressive or defensive? Will they hit their combos?\n\nThe 'luck' is really just a compounding effect of different odds.\n\nSometimes the game is just handed to you, regardless of your individual effort. All the odds are in your favor. But to win a game when the odd's aren't in your favor... through exceeding all expectations of you... through transcending your rank and being more then a calculated number... to win when everything is unlucky, by being the one thing that is lucky... that's the skill component.\n\nSo yes, luck plays a massive part in winning.\n\nBut you can fight luck with skill.\n","replies":[{"poster":"Transcender","date":"2017-01-12T11:03:37.506+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neosinf,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0000000000010000000000000000,timestamp=2017-01-12T10:32:31.823+0000)\n>\n> I wrote a wall of text explaining why you have valid points.\n> \n> What I was saying was you can&#x27;t get an accurate 50/50 chance game. You&#x27;ll get the odds stacked against you or for you in regards to mmr right from the moment you click &#x27;accept&#x27;. It has a massive impact on your win chance.\n> \n> Then there are more odds - how tired/tilted are you teammates, are they looking to win or try a champ? is this a good comp? will they play aggressive or defensive? Will they hit their combos?\n> \n> The &#x27;luck&#x27; is really just a compounding effect of different odds.\n> \n> Sometimes the game is just handed to you, regardless of your individual effort. All the odds are in your favor. But to win a game when the odd&#x27;s aren&#x27;t in your favor... through exceeding all expectations of you... through transcending your rank and being more then a calculated number... to win when everything is unlucky, by being the one thing that is lucky... that&#x27;s the skill component.\n> \n> So yes, luck plays a massive part in winning.\n> \n> But you can fight luck with skill.\n\nRight so you are agreeing with me then, more or less, cause my games are constantly stacked, sometimes by a ridiculous margine.\n\nLuck does play a major part, you can only be so effective though, we all must still play within the confines of the game restrictions. That is what makes it a team strategy game is the fact that you do rely on your team to do their job to allow you to do yours.","replies":[{"poster":"Neosinf","date":"2017-01-12T11:38:13.095+0000","up_votes":1,"down_votes":0,"body":"Yes, a lot of the time you just accept what you're given in a game and do the best you can with it. But sometimes you can beat fate, maybe 1/20 games you do something extraordinary and go supersaiyan. You win 5 more then you lose in 100 games. That's 50 out of 1000 games. After 1000 games, 50 games is the difference between being silver at the start of the season and gold by the end.\n\nHopefully you can get a better ratio then 1/20.\n\nI strive for 1/5. Win three, lose two, win three, lose two, sometimes win four, sometimes lose three... ","replies":[{"poster":"Neosinf","date":"2017-01-12T11:59:48.474+0000","up_votes":1,"down_votes":0,"body":"Thus, thinking more about it, your winrate is really about how many games you beat the odds compared to how many games you don't. If you're on 80%, you played ten games, and you won five as you were supposed to, and lost 2 as you were supposed to, but in three of them you were meant to lose but you came out strong. Maybe you did one thing that changed everything in those games, like you roamed mid once and snowballed. \n\nInstead of thinking you have to be 150% better for that 80%, like everyone else says is possible, think, i just need 3 moments of greatness in ten games. \n\nUndoubtedly, those 3 moments will come out of practice. You also need to not fail in the games you're meant to win - consistency that comes from practice.","replies":[]}]}]}]}]}]}]}]},{"poster":"He Meant Mine","date":"2017-01-12T06:07:14.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=whitePumah,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=00000000,timestamp=2017-01-12T05:56:05.260+0000)\n>\n> Everyone claims that matchmaking is accurate yet I believe it is not, so I want video evidence to prove me wrong, rather than trying to have logical conversations with people about why it is not, because humans are not known for their logic.\n> \n> Since I can&#x27;t seem to climb I cannot be a witness to make my own claims valid because of the social stigma that players who are low elo don&#x27;t know how the game or system works and therefore cannot comment on it with validity. So I can&#x27;t prove that I am right and my comments do not have the value they would if I had climbed and said the same thing.\n\nWant help bruh lol","replies":[]}]}]},{"poster":"Ninox","date":"2017-01-12T06:45:55.579+0000","up_votes":1,"down_votes":0,"body":"...what?\n\nWinrate does not = skill. Winrate = skill relative to your rank. i.e If you are in Silver 2 with a winrate of 70% you probably belong in gold somewhere, or if you are S2 with a winrate of 30% you probably belong in Bronze somewhere.\n\nWhat is all this about you have to be better than your teammates? That doesn't make any sense at all. The idea is to be better than the enemy, as a team. You are being matched with them (and against them) because your skill (i.e your mmr) is approximately equal to theirs. There are a lot of other factors in play of course, but that is what it comes down to.\n\nAs for luck, If anything, luck only comes into play later in the game, when one wrong move or teamfight can cost you the game, but even so can you really call that luck if it is a conscious decision? Sure you may have been wrong or misjudged the situation, but that doesn't mean you were unlucky, it means you made a mistake.\n\nIn the early game it's all about your game knowledge and mechanics, early game is pretty much the purest test of skill there is, because you don't have items, there is no fed enemies or feeding allies, it comes down to raw skill and strategy. \n\nHow have you set up your runes/masteries to counter your lane opponent? Have you picked a champion that counters them or is a skill matchup? Is their positioning better than yours? How good are they at cs-ing? And so on and so forth.\n\nThat aside, where does this assumption come from that your support is going to be sub-par compared to the enemy? Or that ADCs have to be able to 1v3 to be able to win games? Or that \"it is easy for them to do\"?\n\nHas it ever occurred to you that maybe you simply aren't playing to your potential? That you aren't making a conscious effort to learn and that maybe that is why you aren't climbing?\n\nYour builds, your runes and masteries, heck even your summoners prove you think you know better, but if something isn't working for you, and if multiple people you consider to be good at the game (i.e Diamond+) have told you what you could be doing instead that will probably work better and you aren't changing anything, then why would you expect to be climbing? \n\nThat's like trying to put a square peg in a round hole, having someone suggest you use the round peg, or at least a rounder peg, you insisting that the square peg is better and it has to be perfectly square and it should go in but the hole is against you and proceeding to try cramming that square peg in that round hole for years over thousands of games. \n\nIt just doesn't make any sense.","replies":[{"poster":"Transcender","date":"2017-01-12T10:29:19.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0002,timestamp=2017-01-12T06:45:55.579+0000)\n>\n> \n> What is all this about you have to be better than your teammates? That doesn&#x27;t make any sense at all. The idea is to be better than the enemy, as a team. You are being matched with them (and against them) because your skill (i.e your mmr) is approximately equal to theirs. There are a lot of other factors in play of course, but that is what it comes down to.\n\n\nAccording to everyone I speak to, theoretically on average your teammates will equal the ability and performance of the enemy team, which means that you only have to be better than your teammates on average. But by how much you have to be will depend on what you want your winrate to be.\n\n\nSmurfs are not usually equal skill level to those players they play against, so that theory is already false.\n\nOn average my support has been by far sub-par relative to the enemy support. So if my teammates are constantly equal to everyone elses teammates, that means everyone has to deal with these things constantly.","replies":[{"poster":"Ninox","date":"2017-01-12T12:36:55.278+0000","up_votes":1,"down_votes":0,"body":"If both teams are equal, then would you not only have to be better than your lane opponent to tip the scales in your teams favour?\n\nSmurfs climb very quickly, so if you're facing smurfs all the time it's because they've hit their peak. Not all people who make smurfs are Diamond+, there are other reasons to make them. Point being that smurfs don't affect that many of an individual players games because they are there for one game then they're past you. Just because someone plays well (maybe they got their first pref role and champion and their lane opponent didn't) doesn't mean they are a smurf.\n\nAs for supports, if ALL supports are sub par as you say then you still wouldn't be 1v3ing, it'd be closer to 1v1 if you think supports are that useless. Support mains aren't that common it's true, but it's not like support is that hard to play. The hardest thing about it is ward positioning and awareness imo which everyone should know anyway. Point being unless they're higher than they should be no support is useless.","replies":[{"poster":"Transcender","date":"2017-01-13T04:15:46.494+0000","up_votes":1,"down_votes":0,"body":"On average my random support has been by far sub-par relative to the enemy support.","replies":[]}]}]}]},{"poster":"Roguestoney","date":"2017-01-12T11:57:34.170+0000","up_votes":1,"down_votes":0,"body":"People taking whitePumah serious in 2017 lol smh...","replies":[]},{"poster":"Talon12","date":"2017-01-12T06:13:47.251+0000","up_votes":1,"down_votes":0,"body":"No video, but a 1v3 will win as long as they can hold out long enough without falling behind, as they will gain a much larger gold and xp difference over the enemy, eventually being fed in comparison and then win through that, or the 3v1 fks up and dies in a dive. the 3 will win if the 1 makes a mistake and they use that.","replies":[{"poster":"He Meant Mine","date":"2017-01-12T06:24:04.917+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=0001,timestamp=2017-01-12T06:13:47.251+0000)\n>\n> No video, but a 1v3 will win as long as they can hold out long enough without falling behind, as they will gain a much larger gold and xp difference over the enemy, eventually being fed in comparison and then win through that, or the 3v1 fks up and dies in a dive. the 3 will win if the 1 makes a mistake and they use that.\n\nI agree depending on what experience or how the person plays. Technically it would be a 1v2 if the support was \"handicap\" they wouldnt really do anything unless you're considering them feeding hence 1v3. In low elo chances are they ** will ** fuck up lol, if you know how to league properly then farming,extending or rotations etc will get you back into the game, as long as you know what you're doing.","replies":[{"poster":"Transcender","date":"2017-01-12T11:12:38.659+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=He Meant Mine,realm=OCE,application-id=FjGAIbRv,discussion-id=UEbvRRQ5,comment-id=00010000,timestamp=2017-01-12T06:24:04.917+0000)\n>\n> I agree depending on what experience or how the person plays. Technically it would be a 1v2 if the support was &quot;handicap&quot; they wouldnt really do anything unless you&#x27;re considering them feeding hence 1v3. In low elo chances are they ** will ** fuck up lol, if you know how to league properly then farming,extending or rotations etc will get you back into the game, as long as you know what you&#x27;re doing.\n\nI consider a 1v3, as the support being in lane and not doing anything productive such as warding or landing abilities. As they split your xp, without doing anything productive to make up for that xp loss you would have yourself a disadvantage on top of the fact you have to 1v2 numbers wise.","replies":[]}]}]}]}