{"poster":"König von Bünde","date":"2018-02-09T22:26:55.458+0000","title":"Zeit zur Fertigstellung der Missionen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Die meisten haben ja schon bemerkt das die Missionen derzeitig nicht Funktionieren und jetzt ganz deaktiviert sind. \r\nMeine Frage w&auml;re hierf&uuml;r, wird die Missionszeit f&uuml;r das Lunar-Revel Event verl&auml;ngert.\r\n\r\nMan konnte gestern teilweise und heute fast komplett die Missionen nicht verfolgen und da das Event eine begrenzte Zeit hat ist es ja sehr kontra-produktive.\r\nIch m&ouml;chte nicht darauf rumhacken das die Missionen deaktiviert sind, Bugs und Fehler im System passieren halt. Nichts ist perfekt.\r\nJedoch w&uuml;rde ich vielleicht vorschlagen, dass ( wenn m&ouml;glich ) das Event ein Tag oder zwei l&auml;nger geht.\r\nNicht alle League Spieler k&ouml;nnen jeden Tag Zeit ins Spiel investieren und haben vielleicht nur die Wochenenden die n&ouml;tige Freizeit um zu Spielen. \r\nDeswegen w&uuml;rde ich es gerecht finden wenn man eine Verl&auml;ngerung in betracht zieht.\r\n\r\nIch kann es vollkommen verstehen wenn dies nicht m&ouml;glich ist und den Zeitplan von Riot durcheinander bring, wollte es nur mal loswerden. \r\n\r\nMfG\r\nHardstuck Plat5 Pleb","replies":[{"poster":"Enderized","date":"2018-02-09T23:56:33.117+0000","up_votes":1,"down_votes":0,"body":"wenn die Leute nur am WE Zeit haben, wird eine Verlängerung des Events von Dienstag 20.02 bis Donnerstag 22.02 auch nichts bewirken :'D","replies":[{"poster":"König von Bünde","date":"2018-02-10T01:02:04.385+0000","up_votes":1,"down_votes":0,"body":"Aso, ich wusste nicht das es in der Woche endet.\nJedoch war es nur ein Beispiel was ich gegeben habe, da wir ja noch nicht wissen wie lange diese Deaktivierung der Mission anhält.","replies":[{"poster":"Enderized","date":"2018-02-10T01:29:10.770+0000","up_votes":1,"down_votes":0,"body":"Würde mich nicht wundern wenn es nacher heißt:\nAber zwischendrin funktionierten die Missionen ja für n paar Stündchen\n\n:'D","replies":[]}]}]}]}