{"poster":"night  murdererr","date":"2017-06-20T19:16:41.368+0000","title":"Que campeón  me compro","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Hola , en este momento tengo bastante pi y estoy tratando de llegar a oro. (estoy en p1). Que campeon me recomendarian para llegar juego mas que todo de adc y un poco de top con olaf . Desde ya muchas gracias","replies":[{"poster":"iEban","date":"2017-06-21T22:22:53.353+0000","up_votes":1,"down_votes":0,"body":"{{champion:50}}","replies":[]},{"poster":"Dooby Dooby","date":"2017-06-21T17:29:31.914+0000","up_votes":1,"down_votes":0,"body":"Si jugas adc te recomiendo a Cait por el rango y por el daño que podes hacer a distancia y a Lucian por la movilidad y el daño por la pasiva aunque cuesta un poco mas agarrarle la mano\nDe top ya es depende como te guste jugar, si tanques, offtanks, campeones de ap o de ad. Renek, Darius, Maokai, Jayce, son buenos picks pero requieren practica como cualquier otro","replies":[]},{"poster":"Druka","date":"2017-06-21T00:22:45.559+0000","up_votes":1,"down_votes":0,"body":"Hola! Que tal? Me tomo el atrevimiento de responder a tu post ya que no jugaba al juego hace un año y desde entonces ocurrieron demasiados cambios en el, además que quiero volver a ser activo en el foro de LOL. Recientemente me cree una cuenta para jugar y veo que cambio un poco la dinámica en general y los objetos. \n\nSolía jugar bastante ADC, pero al no saber los cambios que se realizaron no sabría recomendarte un campeón específicamente, pero te puedo dar algún que otro consejo.\n\nPrimero que nada, yo me fijaría en las notas de las ultimas actualizaciones y que campeones de tu rol (ADC o TOP) fueron buffeados, es decir, se le cambio positivamente. Después, fijate el campeón que se adecue a tu forma de jugar, por ejemplo, si lo que queres es un campeón con movilidad para jugar de tirador y tuvieras que elegir entre Ashe y Lucian, probablemente te convendría elegir a Lucian. Así con lo demás campeones. \n\nPara TOP lo mismo, si te gusta jugar mas agresivamente vas a preferir algún campeón asesino, o si lo que te gusta es ser mas duro que una pared y que no te bajen con nada preferiblemente deberías comprarte un campeón TANKE.\n\nEspero que te haya sido de ayuda!","replies":[]}]}