{"poster":"Yami No Ignis","date":"2019-02-24T09:18:08.107+0000","title":"Kayle deserves a more powerful art","subforum":"Concepts & Creations","up_votes":15,"down_votes":1,"body":"Reworked kayle artwork looks weak and uncreative. She deserves a better artwork equivalent to or better than  the current mordekaiser artwork","replies":[{"poster":"Kelg","date":"2019-02-24T12:49:35.614+0000","up_votes":13,"down_votes":1,"body":"Her whole design is terrible. She looks like a power ranger now, when she used to look bad ass.","replies":[{"poster":"TaroBunni","date":"2019-02-24T19:10:51.124+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=A8FQeEA8,discussion-id=eMEA02E8,comment-id=0000,timestamp=2019-02-24T12:49:35.614+0000)\n>\n> Her whole design is terrible. She looks like a power ranger now, when she used to look bad ass.\n\nNow that you mention it, I can't unsee it. Thanks a lot :P","replies":[]}]},{"poster":"Yami No Ignis","date":"2019-02-24T16:06:01.161+0000","up_votes":6,"down_votes":1,"body":"Riot needs to surprise us all before they release her new rework, like completely making an entirely new design","replies":[]},{"poster":"Glaricion","date":"2019-02-25T07:01:36.490+0000","up_votes":1,"down_votes":0,"body":"It's hard to be 100% on this since it is just hearsay, but supposedly they're still working on Kayle's textures so that the read on her torso isn't so bad.\n\nSupposedly no tabard(?) as they clip horrendously and it isn't worth the extra work, but hopefully they go beyond textures and actually bulk her up.\n\nAs someone who is supposed to be denying their humanity to be a divine judge, she's really keen on revealing as much of her form as possible.\n\nIt's like they spent all their time and resources on making Morgana look just ravishing (debates to be had on theming, but so close who cares) and then they remembered they also had work to do on Kayle, so she was left w/ her first form's plugsuit on all(?) of her skins.","replies":[]}]}