{"poster":"Prepare Ur Anu","date":"2015-09-28T04:35:21.781+0000","title":"Ich kappier das mit dem Attack moving nicht","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo,\r\n\r\nAuch nach begutachten mehrerer Videos verstehe ich nicht genau wie Attack moving funktioniert. Alle Videos sind auch ziemlich veraltet, so dass ich nicht weiss, was genau ich in den Einstellungen wo &auml;ndern muss. Was aber dann? Wie genau muss ich anschliessend damit umgehen?","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-28T13:14:36.190+0000","up_votes":4,"down_votes":0,"body":"Er/sie sagt, er/sie habe sich zahlreiche Videos angeguckt und habe nichts daraus gelernt. Wieso wird ihm/ihr dann empfohlen Video XY zu gucken? WTF\n\nFür das beherrschen des Attackmoves musst du erstmal verstehen, was dieser bewirkt. Da ich nicht weiß, was genau du nicht verstanden hast, fange ich von vorne an.\nDer Attackmove ist im Normalfall mit A (+ Linksklick) zu aktivieren. Das bewirkt, dass du ganz normal zu dem angeklickten Punkt hinläufst. Der Unterschied hierbei liegt lediglich, dass du gegnerische Einheiten und getriggerte Junglecamps auf deinem Weg angreifst, wobei du stehen bleibst/dem Ziel folgst und der Fokus auf der dir am nächsten gelegenen Einheit leigt. Ist das Ziel tot bzw. nicht mehr angreifbar oder außer Sicht, setzt du deinen Weg fort. Am Zielpunkt angekommen hört dieser Effekt jedoch nicht auf. Dort wirst du Gegner angreifen und fokusiert halten, bis sie tot sind und dann wieder an deinem Ausgangspunkt zurückkehren. Ob das ab einem bestimmten Radius resettet weiß ich nicht.\n\nAber was bringt dieser Attackmove? Die erste Einsatzmöglichkeit ist allgemein damit zu laufen. Sei es zurück zur Lane oder im Jungle. Es kann passieren, dass du Pinkwards oder Gegner übersiehst. Mit dem Attackmove brauchst du das nicht mehr zu befürchten, da du diese dann automatisch angreifst. Auch kannst du damit Buschjukes verhindern. Es wird häufig gesehen, dass der Gegner in den Busch rennt und wenn der Verfolger diesen Betritt er in eine andere Richtung maschiert und man selbst (etwas) weiterläuft und dem Gegner damit einen Vorsprung verschafft. Das ist mit dem Attackmove nicht mehr möglich. Läuft der Gegner in die andere Richtung, gibst du ihm einen AA und folgst ihm sofort. Läuft er weiter, hast du durch Einsetzen des Attackmoves auch keinen Nachteil gezogen. Versucht er einen Reengage, dann hast du auch schonmal einen AA drauf, bevor du überhaupt reagieren kannst.\n\nDie zweite Einsatzmöglichkeit ist beim Kiten. Es ist mühsam die ganze Zeit die Maus von Laufrichtung zum Verfolger und umgekehrt zu führen. Auch besteht die Gefahr im Eifer des Gefechts daneben zu klicken und in den Gegner zu laufen. Mit dem Attackmove hast du hier einen Vorteil. Anstatt die Maus hin und her zu bewegen musst du nur zwischen Rechtsklick und Attackmove wechseln. So kannst du deine Maus an einer Stelle lassen und etwas schneller ist es auch.\nEbenso wird die Gefahr, daneben zu klicken, ausgelöscht, da du automatisch das nächstgelegene Ziel angreifst. Ein Verfehlen des Gegners ist so also nicht möglich.\nSo kannst du gut Kiten und die Distanz zum Gegner recht einfach halten.\n\nIch hoffe ich konnte dir damit behilflich sein :)","replies":[]},{"poster":"Ehren Teemo","date":"2015-09-28T04:40:58.051+0000","up_votes":1,"down_votes":2,"body":"Such mal auf yt\nRyo on PC \nDer hat ein sehr schönes ausführliches Video gemacht \n(Ist ein ehemaliger CW Spieler)","replies":[{"poster":"ÆonFox","date":"2015-09-28T11:16:49.941+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=KKPZTqoG2m0\n\nDieses Video meinst du.","replies":[{"poster":"Ehren Teemo","date":"2015-09-28T15:09:04.710+0000","up_votes":1,"down_votes":0,"body":"ja","replies":[]}]}]},{"poster":"Lee Sin Ghost","date":"2015-09-28T14:57:05.840+0000","up_votes":1,"down_votes":0,"body":"Attack-move ist gut auf jeder lane aber am meisten für adcs weil sie cyten müssen und mit attackmove ist das einfack easy einfach nur ein knopf drücken und schon attackst du den gegner anstatt imer mauszeiger weglaufen mauzeiger angreifen wegkaufen mattackmove vereinfacht das alles einfach in der hight elo hat das sogut wie jeder adc und wenn du nicht weist wie man das in den einstellungen eistellt frag mich einfach ;)\n\nLG: Lee Sin Ghost","replies":[]},{"poster":"PaN Kwiss","date":"2015-09-28T08:13:42.033+0000","up_votes":1,"down_votes":2,"body":"hier wirds sehr gut erklärt https://www.youtube.com/watch?v=zi4AlSwEfrQ","replies":[]}]}