{"poster":"Gypsyleeboy","date":"2016-02-05T06:08:55.099+0000","title":"It's not always best to worry about baron, \"My tale of complete obliteration\"","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"***My tale of complete obliteration***\n\n3 people and I picked up an ADC we just won a game with, and he was a really cool guy. I was his support and he asked to play with us. This next match we went into, we kind of had some even trades, we would pull a couple kills, they&#039;d catch up or pull a few more, so on and so forth. We are mid/late game and only have one bottom turret taken out, they have 3 taken out, we&#039;re getting agitated, and having those bursts of rage we all get now and then. \n\nSo fast forward 10 minutes, the enemy is about to take dragon for the third or fourth time, so we head over there to have a team fight, hoping they have low health, (they didn&#039;t) So they get dragon, but then there was about 40 seconds of poking, and us finally Ulting together and destroying the team ALL at once for an ACE!\n\nI scream to my Skype chat, *&quot;GO BARON! !@$%@ BARON, BARROON!&quot;* and ping it 42 times to alert our ADC. (he wasn&#039;t on Skype with us) so as we walk toward mid lane from dragon, he types *&quot;NO Just spam heal, Sona, and let the tank take the turrets, we won&quot;* then types *&quot;/all GG&quot;* (I start to think this guy is nuts..)\n\nI said in Skype, okay forget baron let&#039;s just go for it; and sure enough, right as the enemy team spawned in, we won the game. 5 Tower push, and we wasn&#039;t even full build yet. Also none of us were even Lv 18.. This guy changed how I play league now, and learned me that sometimes,\n\n***It&#039;s not always best to worry about baron, sometimes you&#039;re better off just spamming heal, pushing five turrets, and completely obliterating everything in your path till you succeed in victory..***\n\n\n-----------------------------\nedit:\n> We had one baron already, it'd be our second if we got it. But it could have cost us the win since they had a huge turret lead, and two of our inhibitors at the time of our win.. What made this amazing is that we had no minions with us *the whole way through five turrets.*","replies":[{"poster":"SwiftKitten88","date":"2016-02-05T06:22:06.128+0000","up_votes":2,"down_votes":0,"body":"well that didnt used to work becuase towers actually used to deal damage.  for some reason they just die like nothing now.. idk what they changed,i just got back after not playing since july, but the towers just seem to melt now","replies":[]},{"poster":"SwiftKitten88","date":"2016-02-05T19:07:46.341+0000","up_votes":1,"down_votes":0,"body":"the fact that you pushed trhough FIVE turrents with somone tanking is just pathetic in riots part. i can understand if you have multiple tanks swapping damage between each turret AND a sona and or high AD champs that can burst down turrets. and that could get you trough 3 or 4 turrets.\n\nbut turrets shouldnt be so freaking weak that you can push through five with ZERO minion support.  and the fact that u did it with 2 inhibs down means that you probably had super minions coming at you at the same time which you also had to have your team tank.\n\na turret should be worth atleast 1-2 players on the opposing team in terms of defense  at LEAST if you dont have minions to tank for you.\n\ni understand riot is trying to make games shorter but the fact that turrets do nothing to stop a player is just wrong.\n\nevery since riot made the laser turrets the bases have felt too weak. i dont care if riot says the lazer turrets are stronger. thier not... becuase the lasers will instatly stop shooting you when u leave range. where as the turret shots will follow you out of range as long as the short was fired.","replies":[{"poster":"Gypsyleeboy","date":"2016-02-06T06:18:58.863+0000","up_votes":1,"down_votes":0,"body":"you under estimate the power of a 45% cooldown, sona, and a team of bursty turret chunker champions.","replies":[]}]},{"poster":"GamblerOfLives","date":"2016-02-05T08:02:18.349+0000","up_votes":1,"down_votes":0,"body":"depends man, the death timers and if you a wave to work with..if you had a wave you could go for the win;)..depends..but baron, is the safe call;)..most of the time..you should look at baron after the 20 min mark..if you kill 2 people you should go for baron at the 20 min mark;)...there are certain champs that are op vs baron(heimerdinger, fiddle,yasuo, blade of the ruined king, kindred etc.)..\nAlso, there are champs that are op at taking turrets;)...adc, sheen, nasus etc;)..","replies":[]},{"poster":"Gypsyleeboy","date":"2016-02-05T06:58:45.009+0000","up_votes":1,"down_votes":0,"body":"edited with comment from below!","replies":[]},{"poster":"disregardable","date":"2016-02-05T06:12:28.081+0000","up_votes":1,"down_votes":0,"body":"The difference between a low elo game and a high one is generally focusing on baron, that is, low elos don't do it at all.","replies":[{"poster":"Gypsyleeboy","date":"2016-02-05T06:19:14.582+0000","up_votes":1,"down_votes":0,"body":"We had one baron already, it'd be our second if we got it. But it could have cost us the win since they had a huge turret lead, and two of our inhibitors at the time of our win.. What made this amazing is that we had no minions with us *the whole way through five turrets.*","replies":[]}]}]}