{"poster":"Gypsyleeboy","date":"2015-05-15T22:59:48.173+0000","title":"Now that cinderhulk is nerfed","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Why did they nerf champions, &#039;well like hecarim&#039; that benefited too much from this item, Then nerf the item itself.\nHecarim was known for being a top lane bully but they changed him to push him into the jungle, and now they nerfed cinderhulk and made his Q 100% DMG To minions, pushing him even further into jungle. Why MUST riot push hecarim into the jungle? He can top lane and still use his roaming kit effectively. he doesn&#039;t HAVE to be a strict jungle character. With the increase of mana cost, they&#039;re saying, hecarim should have blue buff cause of this mana cost! take him jungle!\n\nSorry i just miss when hecarim can be fun and do damage and not just kill a bunch of minions. Maybe i just don&#039;t understand him much since i almost never see him on the enemy team anymore. \n\nSejuani should get nerfs if hecarim is being put on jungle lockdown. just my opinion so don't hate.\nEdit: Sejuani nerfs incoming, i see riot realized her strength.","replies":[{"poster":"Windfallen","date":"2015-05-16T00:05:04.892+0000","up_votes":2,"down_votes":0,"body":"Hecarim stomps a lot of matchups in the top lane and he was designed to be ultra strong if he's performing well and gaining lots of gold.\n\nHe's getting the maoki treatment.\n\nStill viable in top lane I'm sure, but he has less tools to get to his lategame as fast up there... and believe me, it's much much faster when you're winning or even just dominant in the top lane rather than performing well in the jungle, which is arguably harder and less rewarding in gold. (I would say so)\n\nThe changes help jungle hecarim with his poor early clears. Mana costs were to make him less overbearing in top lane. Yea... it's enforcing the meta, but he's so very powerful. At least he isn't being gutted.","replies":[{"poster":"Erockandroll","date":"2015-05-20T04:43:54.894+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Windfallen,realm=NA,application-id=3ErqAdtq,discussion-id=2EvdOql0,comment-id=0001,timestamp=2015-05-16T00:05:04.892+0000)\n>\n> Hecarim stomps a lot of matchups in the top lane and he was designed to be ultra strong if he's performing well and gaining lots of gold.\n> \n> He's getting the maoki treatment.\n> \n> Still viable in top lane I'm sure, but he has less tools to get to his lategame as fast up there... and believe me, it's much much faster when you're winning or even just dominant in the top lane rather than performing well in the jungle, which is arguably harder and less rewarding in gold. (I would say so)\n> \n> The changes help jungle hecarim with his poor early clears. Mana costs were to make him less overbearing in top lane. Yea... it's enforcing the meta, but he's so very powerful. At least he isn't being gutted.\n\nSomething tells me that Hecarim is going to be tougher than that to crack. hercarim was pretty strong even with out CinderHulk. (though I can't say whether cinderhulk or warrior is better on Jungle herc) His top lane is strong on a purely a mechanical combination of items. HomeGuard will allow him to return to lane with out missing a single CS. It also means that your flask is always topped off. Combined that with TP, and you have a lot of potential to make cross the map plays. Once you get Tri force, Your play making abilities are golden.","replies":[{"poster":"Gypsyleeboy","date":"2015-05-20T05:22:39.649+0000","up_votes":1,"down_votes":0,"body":"i take it that you play hecarim? i can't do much with him anymore. He gets out leveled so quickly in lane and it's really tough to play against todays meta top laners with hecarim. He's just so lackluster since these changes to him and cinderhulk. Of course you didn't need cinderhulk for him to be great top lane but, that was until they nerfed his health, and now making his q even more mana hungry than it already was before. \n\n{{item:3070}}","replies":[]}]},{"poster":"Gypsyleeboy","date":"2015-05-20T04:11:45.861+0000","up_votes":1,"down_votes":0,"body":"Yeah i agree he did need faster clear, but THATS just it. they want him in the jungle and thats it. Its really tough to top lane hec now. he gets out damaged so easily, its so sad\nEdit: well, out tanked in some cases.","replies":[{"poster":"Windfallen","date":"2015-05-20T04:30:48.627+0000","up_votes":1,"down_votes":0,"body":"He didn't though.... I don't think he did, at least. It's incentive more than anything.\n\nThe only change is his mana cost on Q. So it's more like being out sustained in resources if anything. Have you tried TP/ignite?","replies":[{"poster":"Gypsyleeboy","date":"2015-05-20T04:43:06.042+0000","up_votes":1,"down_votes":0,"body":"Rampage\nDeals 100% of the spell damage against monsters from 66%.\nCost increased to 32 / 34 / 36 / 38 / 40 from 20 / 23 / 26 / 29 / 32\n\nStats\nBase health regen reduced to 7 from 9.25.\nBase mana regen reduced to 6.5 from 7.5.\n\nAnd now the cinderhulk nerf","replies":[]}]}]}]},{"poster":"MLDzXnRRR","date":"2015-05-20T04:59:07.797+0000","up_votes":1,"down_votes":0,"body":"Heca is more dangerous is the jungle, because he can destroy all lanes, not just 1.","replies":[]},{"poster":"Sir Yamazuki","date":"2015-05-20T04:32:26.918+0000","up_votes":1,"down_votes":0,"body":"He was being taken top before taking smite top was a thing. Originally Hec went top with Tele+Ignite, so his success really had nothing to do with taking smite top.","replies":[{"poster":"Gypsyleeboy","date":"2015-05-20T04:43:56.840+0000","up_votes":1,"down_votes":0,"body":"But he actually really benefited from this. and now they're trying to push him into jungle","replies":[]}]},{"poster":"TeemoJenkins","date":"2015-05-15T23:02:18.914+0000","up_votes":1,"down_votes":0,"body":"I agree with your opinion, but I'm also a pony fan... so... ya.","replies":[]}]}