{"poster":"RexusKingZz","date":"2016-11-22T19:21:37.216+0000","title":"Permabann am 22.11.16 ohne Grund","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":4,"body":"Hallo Riot, liebe Leser heute am 22.11.16 wurde mein Konto ohne Grund gebannt. Ich habe mir nichts zu Schulden kommen lassen,\r\nWenn ich mich versuche einzuloggen, bekomme ich diese Nachricht: Dieses Konto wurde dauerhaft gesperrt.Bitte sieh im posteingang deiner E-Mail-Adresse, die du f&uuml;r das Lol - Konto angegeben hast, nach, um zus&auml;tzliche Einzelheiten zu erhalten.Ich habe keine Email erhalten. Vielleicht kann mir irgendwer weiterhelfen. Ich habe eine Nachricht an Riot schon geschrieben und dort auch direkt eine Best&auml;tigung bekommen das meine Nachricht bei Riot Bearbeitet wird.","replies":[{"poster":"drexxsack","date":"2016-11-22T19:36:17.875+0000","up_votes":5,"down_votes":0,"body":"Ein \"temporärer\" Permabann wird auch dann gesetzt, wenn man RP kauft und diese nicht bezahlt(z.B. weil das Konto nicht gedeckt ist oder weil es aus anderen Gründen zur Rückbuchung gekommen ist). \nSollte das der Fall sein, wird der Support den Bann wieder aufheben, wenn der ausstehende Betrag beglichen ist.","replies":[{"poster":"Xisannity","date":"2016-11-23T14:14:10.750+0000","up_votes":1,"down_votes":14,"body":"> [{quoted}](name=drexxsack,realm=EUW,application-id=KYnfKGf0,discussion-id=Jn68EQpQ,comment-id=0002,timestamp=2016-11-22T19:36:17.875+0000)\n>\n> Ein &quot;temporärer&quot; Permabann wird auch dann gesetzt, wenn man RP kauft und diese nicht bezahlt(z.B. weil das Konto nicht gedeckt ist oder weil es aus anderen Gründen zur Rückbuchung gekommen ist). \n> Sollte das der Fall sein, wird der Support den Bann wieder aufheben, wenn der ausstehende Betrag beglichen ist.\n\nGreedy Bastards dieses Riotler. Als ob digitale Pixel einen wirklichen realen Wert hätten. Riot hat doch dadurch keine Verluste? Also was soll der Scheiß? Die sind echt wahnsinnig geworden.","replies":[{"poster":"Party at my Lane","date":"2016-11-23T17:12:41.738+0000","up_votes":5,"down_votes":0,"body":"Was ist das denn für eine Aussage. Natürlich haben die Pixel einen realen Gegenwert. Keiner zwingt dich dein Geld dahingehend zu investieren. Lies dir mal die AGBs durch mein Freund^^Eigentlich ist das was Riot macht sogar noch nett. Ich erzähle dir mal kurz was im Reallife bei sowas passiert.\n\nDu gehst bei Rewe einkaufen und zahlst per Lastschrift mit Karte. Dein Konto ist nicht gedeckt und die Bank bucht zurück. Rewe holt sich deine Adresse und schickt eine Mahnung. Da kommt dann die Summe des Einkaufs + Mahn Gebühren + Porto und Bearbeitungsgebühr, so werden aus 20€ schnell mal 50€. Kommst du der Zahlung nicht nach gehts zum Inkasso. Dann kannst du schonmal fest mit 80€ aufwärts rechnen. \n\nRiot ist so nett und sperrt nur dein Konto bis du die Eingangs Zahlung geleistet hast. Keine Mahn Gebühr, keine Bearbeitungsgebühr nichts. Nur das was du tatsächlich gekauft hast. Wenn du in Deutschland etwas kaufst egal was es ist musst du es bezahlen und das ist eigentlich weltweit so mein Lieber. Das hat nichts mit Gier oder sonst was zu tun. Es nennt sich Kaufvertrag.","replies":[{"poster":"Xisannity","date":"2016-12-21T16:01:16.811+0000","up_votes":1,"down_votes":5,"body":"Dann klär dich erst mal auf. Du scheinst mir noch deutlich zu jung und naiv zu sein. Lerne zu reflektieren und zu denken, hinterfrage die Welt und gehe den Dingen logisch und rational auf den Grund.\n\n\nRiot macht natürlich keinen Verlust wenn sie mal einen Skin verschenken. Darum geht es letzten Endes. Das ist einfach purer Greed. Das ist alles. Das mit Inkasso u.s.w. ist aus meiner Sicht auch gegen Menschen. Manchmal kann man eben etwas nicht bezahlen oder man ist dagegen, weil es nicht vernünftig für jemand ist oder man nicht zufrieden ist mit etwas. Man sollte nur für etwas zahlen, was man auch wirklich mit seinen Gewissen und Idealen unterstützt, zumindest idealerweise.","replies":[{"poster":"Sirrkas","date":"2016-12-21T20:44:03.652+0000","up_votes":2,"down_votes":0,"body":">Riot macht natürlich keinen Verlust wenn sie mal einen Skin verschenken. Darum geht es letzten Endes. \n\nDoch. Indirekt schon. Nein, es kostet sie nichts, einen Skin zu verschenken, deshalb machen die das auch manchmal. Aber mit jedem verschenkten Skin, verlieren sie potentielle Einnahmen, da der Spieler vielleicht den Skin gekauft hätte, hätte er ihn nicht geschenkt bekommen. \n\nIch weiß auch nicht, warum du dich so darüber aufregst, dass man bei nicht Erfüllung der eigenen Verpflichtungen (bei RP-Kauf die Zahlung der entsprechenden Summe) mit Konsequenzen zu rechnen hat.\n\n>Das mit Inkasso u.s.w. ist aus meiner Sicht auch gegen Menschen. Manchmal kann man eben etwas nicht bezahlen oder man ist dagegen, weil es nicht vernünftig für jemand ist oder man nicht zufrieden ist mit etwas. Man sollte nur für etwas zahlen, was man auch wirklich mit seinen Gewissen und Idealen unterstützt, zumindest idealerweise.\n\nNiemand ist dazu gezwungen RP zu kaufen. Ich verstehe also nicht, was das hier soll. Bei einem Kaufvertrag ist man für gewöhnlich damit einverstanden, die Ware zu erwerben. Also muss man sie auch bezahlen und nicht danach sagen \"das Eis hat mir nicht geschmeckt, du kriegst kein Geld von mir\".","replies":[{"poster":"Xisannity","date":"2017-01-13T17:15:25.425+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=Jn68EQpQ,comment-id=00020000000100000000,timestamp=2016-12-21T20:44:03.652+0000)\n>\n> Doch. Indirekt schon. Nein, es kostet sie nichts, einen Skin zu verschenken, deshalb machen die das auch manchmal. Aber mit jedem verschenkten Skin, verlieren sie potentielle Einnahmen, da der Spieler vielleicht den Skin gekauft hätte, hätte er ihn nicht geschenkt bekommen. \n> \n> Ich weiß auch nicht, warum du dich so darüber aufregst, dass man bei nicht Erfüllung der eigenen Verpflichtungen (bei RP-Kauf die Zahlung der entsprechenden Summe) mit Konsequenzen zu rechnen hat.\n> \n> Niemand ist dazu gezwungen RP zu kaufen. Ich verstehe also nicht, was das hier soll. Bei einem Kaufvertrag ist man für gewöhnlich damit einverstanden, die Ware zu erwerben. Also muss man sie auch bezahlen und nicht danach sagen &quot;das Eis hat mir nicht geschmeckt, du kriegst kein Geld von mir&quot;.\n\nNatürlich wenn das Eis nicht geschmeckt hat oder es wirklich schlecht war, dann sollte es auch nicht bezahlt werden. Sonst könnte ja jeder komm und irgendwelchen Schrott andrehen, was ja leider heute sehr viel noch passiert. Man muss einfach mal Mechanismen entwickeln in Richtung Vernunft und Gerechtigkeit und nicht mehr Greed und ruinöses Verhalten gegen die Gemeinschaft anstreben.","replies":[{"poster":"Sirrkas","date":"2017-01-13T19:56:56.294+0000","up_votes":2,"down_votes":0,"body":">Natürlich wenn das Eis nicht geschmeckt hat oder es wirklich schlecht war, dann sollte es auch nicht bezahlt werden. Sonst könnte ja jeder komm und irgendwelchen Schrott andrehen, was ja leider heute sehr viel noch passiert.\n\nRiot gibt dir aber das Eis, das du bestellt hast. Wenn dir danach auffällt, dass du  ja gar kein Vanilleeis magst, ist das dein Problem. Und selbst dann ist Riot noch so kulant, dir 3 Rückerstattungen zu gewähren. \n\nBei den Skins weiß man ebenso genau, was man kauft. Alleine ein Video auf Youtube raussuchen sollte also genügen um sich sicher zu sein, ob man den Skin will oder nicht. \n\n\n>Man muss einfach mal Mechanismen entwickeln in Richtung Vernunft und Gerechtigkeit und nicht mehr Greed und ruinöses Verhalten gegen die Gemeinschaft anstreben.\n\nUnd du findest es also \"gerecht\", wenn Riot Geld/Waren verschenkt. Sollen dann die Artists auch unbezahlt bleiben und sich lieber freuen etwas für die Gemeinschaft getan zu haben? \n\nTut mir leid dich zu enttäuschen, wir leben nicht in einer idealen kommunistischen Welt, in der alle alles haben. Riot muss leider Geld verdienen, damit sie ihre Mitarbeiter bezahlen können. \n\nDer einzige Punkt in dem ich dir zustimmen kann ist, dass Gier vermieden werden sollte. Wenn du ehrlich mit dir bist, sollte dir beim erneuten durchlesen deiner Posts aber auffallen, dass du der Gierige bist. Du willst mehr und mehr von Riot. Das Unternehmen stellt dir schon ein Spiel kostenlos zur Verfügung, schreibt tolle Hintergrundgeschichten, macht großartige Videos, vergibt Hextechloot und du willst auch noch, dass sie ihre wichtigste Einkommensquelle beschneiden oder vielleicht sogar aufgeben, die Skins. \nRiot wurde sogar schon[ dafür kritisiert, wenig Geld mit ihrem Spiel zu machen](http://www.gamestar.de/spiele/league-of-legends/news/league_of_legends,44593,3058833.html). Du musst dir das mal auf der Zunge zergehen lassen. Sie wurden dafür kritisiert, nicht gierig zu sein.\n\nDu dagegen kommst her und beschwerst dich darüber, keine Skins geschenkt zu bekommen. Du willst nicht nur kostenlos spielen, nein du willst auch noch alles haben, ohne selbst etwas dafür tun zu müssen. Wenn Riot alle Skins ab sofort verschenken würde, könnten die nächste Woche dicht machen. Dann hast du vielleicht kostenlose Skins gekriegt, aber ab nächster Woche hast du nichts mehr. Kein Server bedeutet nämlich, kein Spiel. Also auch keine Skins, die du verwenden kannst.","replies":[]}]}]},{"poster":"Waldschrat86","date":"2016-12-22T08:26:38.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xisannity,realm=EUW,application-id=KYnfKGf0,discussion-id=Jn68EQpQ,comment-id=0002000000010000,timestamp=2016-12-21T16:01:16.811+0000)\n>\n> Dann klär dich erst mal auf. Du scheinst mir noch deutlich zu jung und naiv zu sein. Lerne zu reflektieren und zu denken, hinterfrage die Welt und gehe den Dingen logisch und rational auf den Grund.\n> \n> \n> Riot macht natürlich keinen Verlust wenn sie mal einen Skin verschenken. Darum geht es letzten Endes. Das ist einfach purer Greed. Das ist alles. Das mit Inkasso u.s.w. ist aus meiner Sicht auch gegen Menschen. Manchmal kann man eben etwas nicht bezahlen oder man ist dagegen, weil es nicht vernünftig für jemand ist oder man nicht zufrieden ist mit etwas. Man sollte nur für etwas zahlen, was man auch wirklich mit seinen Gewissen und Idealen unterstützt, zumindest idealerweise.\n\nKommmal selber in Zahlungszwänge, während dir andere noch mehr schulden als du schildest, die Rückzahlung versprpchen, dann vertagt,aber deine Schuldner lassen sich nicht vertagen bzw. du zahlst deswegen am Ende drauf.\nNicht anders ist es hier und nichtmal Nachwehen nach Tilgung...und du redest von wahrscheinlich zu jung und naiv...\nSo ziemlich überall sonstwo werden bei sowas Verwaltungsgebühren erhoben, die kommen dem \"kann mal passieren\" doch sehr entgegegen. \"Greed\" ist was anderes.","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-11-23T14:45:13.382+0000","up_votes":2,"down_votes":1,"body":"Und du glaubst also, Flamer hätten ein Anrecht darauf, anderen das Spiel zu versauen?","replies":[{"poster":"Xisannity","date":"2016-12-21T15:56:17.118+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=Jn68EQpQ,comment-id=000200000000,timestamp=2016-11-23T14:45:13.382+0000)\n>\n> Und du glaubst also, Flamer hätten ein Anrecht darauf, anderen das Spiel zu versauen?\n\nUnd du glaubst Feeder und Troller und andere hätten das Anrecht das Spiel zu versauen oder das Leben?","replies":[{"poster":"Sirrkas","date":"2016-12-21T20:39:04.718+0000","up_votes":1,"down_votes":0,"body":"Die kannst du genau so melden, wie andere Flamer melden. Trolle und Flamer sind schlimm. Aber das eine rechtfertigt nicht das andere.","replies":[]}]}]},{"poster":"eingew","date":"2016-11-23T17:46:14.620+0000","up_votes":1,"down_votes":0,"body":"Dafuq? Man soll also einfach nicht mehr bezahlen müssen?! Das ist gierig?! Beschwer dich beim System, nicht bei Riot...","replies":[]},{"poster":"Celesil","date":"2016-11-24T12:11:13.317+0000","up_votes":2,"down_votes":0,"body":"Moin,\n\nnur leider gibt es heutzutage Immaterielle Vermögensgegenstände. Bis zum 22.11.2016 hast du sogar einen genutzt.\nWie dir Crock Gamma schon erklärt hat, ist Riot da wirklich sehr freundlich.\n\nAllerdings finde ich es lustig, das für dich Arbeitszeit anscheint keinen Wert hat. Denn auch Pixel, Polygone etc. müssen im Sandkasten zusammengebaut werden, damit wir am Ende ein anderes Aussehen für (Held einfügen) spielen und ansehen dürfen.\n\nAm besten nochmal mit dem Wert des Geldes, der Arbeitszeit und den Immateriellen Vermögensgegenständen verbringen oder viel einfacher und schneller, deine ausstehende Schuld begleichen.\n\nMfG\n\nCele","replies":[]}]}]},{"poster":"BlackNexusLP","date":"2016-11-23T17:34:50.735+0000","up_votes":1,"down_votes":3,"body":"Hallo , gestern am 22.1116 wurde mein Konto ebenfalls wie bei vielen anderen auch mein Account gehackt. Ich hatte als ich das Letzte mal auf League of Legens war 3900 RP als ich mich gerade wieder eingeloggt hatte, hatte ich nur noch 190 RP. Ich habe dann mal auf mein Geschenkverlauf geguckt, dann habe ich gesehen, dass ich zwei Leuten Namens plopani und osolarfull beiden zwei Skins geschenkt habe(plopani:Skins von Jinx und Aurelion-Sol und osolarfull von Lee-sin und Trydamer.Es wäre nett wenn ihr das mal Untersuchen könntet . Danke schon mal im Voraus.\nPS: Der Account von IgiLP wurde ebenfalls gehackt ,jedoch wurde er gelöscht.","replies":[{"poster":"sleepingIce","date":"2016-11-27T10:25:11.740+0000","up_votes":1,"down_votes":5,"body":"Es ist interessant solch einen Beitrag hier zu finden in dem es um hacken geht, ich habe mich am 21.11.2016 nicht mehr einloggen können, da der neue Client eine einzelne Datei meint updaten zu wollen, dabei wurde mein Haken bei \"Remember me\" entfernt und ohne das ich es mitbekommen habe auch die Region, was der Grund war weshalb meine Daten logischer weise nicht mehr funktionierten. Jedoch habe ich das an dem Tag nicht gesehen und verstanden. Am Tag darauf konnte ich mich wieder einloggen und ich habe einen 14 Tage Ban bekommen. Es wurden mit meinem Account Spiele gespielt die dazu geführt haben und Riot ist so freundlich und wirft mir vor, dass ich es war und keine Fremdzugriffe statt gefunden haben. Findet ihr das fair? Ich meine Youtuber und Streamer geben bei dem Support an sie wurden angeblich gehackt und schon schafft es Riot sogar einen perma ban rückgängig zu machen, aber bei normalen Spielern werden keine Ausnahmene gemacht obwohl die Fakten klar sind, das es sich hier um einen Hackerangriff gehandelt haben muss! Das System funktioniert!","replies":[{"poster":"Sirrkas","date":"2016-11-27T11:55:26.692+0000","up_votes":1,"down_votes":0,"body":"Permabanns für Flaming und Cheating werden nicht zurückgenommen. Die einzigen 2 Arten Perma, die aufgehoben werden, sind die für Zahlungsverzug, sobald die fehlende Summe bezahlt wurde und die Banns, die verteilt werden, wenn jemand eine Accountwiederherstellung beantragt, für die Dauer der Bearbeitung wird der Account nämlich gesperrt.","replies":[{"poster":"sleepingIce","date":"2016-11-27T12:56:46.234+0000","up_votes":1,"down_votes":6,"body":"Das mag die offizielle Version sein, aber in der Realität ist das leider anderst, denn die Permabanns die schon wiederhergestellt wurden hatten nix mit Zahlungen zu tun!","replies":[{"poster":"Sirrkas","date":"2016-11-27T13:07:14.979+0000","up_votes":3,"down_votes":0,"body":"Dann kannst du uns doch sicher Belege dafür zeigen?","replies":[{"poster":"sleepingIce","date":"2016-11-27T13:35:43.066+0000","up_votes":1,"down_votes":6,"body":"Ich muss sie dir nicht zeigen, du kannst sie dir auf YT anschauen! Ich nennen hier keine Namen, da das gegen die Regeln ist!","replies":[{"poster":"Sirrkas","date":"2016-11-27T13:38:54.860+0000","up_votes":3,"down_votes":0,"body":"Mit anderen Worten du hast keine. Auf Youtube wird gerne mal behauptet, man wäre unschuldig gebannt worden, dann irgenwelche Texte vorlesen, die es nicht gibt oder etwas in Supporttickets reininterpretieren, das da nicht steht, damit es den Zuschauern gefällt und das bereits bestehende Bild vom pöhsen, pöhsen Unternehmen Namens Riot in den Köpfen der toxischen Zuschauer bedient wird.\n\nDer letzte, der mir eine \"Quelle\" gezeigt hat, konnte nicht einmal erkennen, dass es nicht die Seite war, für die er es hielt oder wollte die Forennutzer sogar bewusst täuschen.","replies":[]},{"poster":"eingew","date":"2016-11-27T13:59:03.688+0000","up_votes":1,"down_votes":0,"body":"Die Forenregeln besagen, dass das *anprangern* von Spielern verboten ist. Inwiefern prangerst du *Spieler* an, wenn du über falsches Vorgehen in Riots Bans reden willst?","replies":[]}]}]}]}]},{"poster":"Haudruppmoor","date":"2016-11-28T07:53:24.113+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sleepingIce,realm=EUW,application-id=KYnfKGf0,discussion-id=Jn68EQpQ,comment-id=00060001,timestamp=2016-11-27T10:25:11.740+0000)\n>\n>Ich meine Youtuber und Streamer geben bei dem Support an sie wurden angeblich gehackt und schon schafft es Riot sogar einen perma ban rückgängig zu machen, aber bei normalen Spielern werden keine Ausnahmene gemacht obwohl die Fakten klar sind, das es sich hier um einen Hackerangriff gehandelt haben muss! \n\nDer einzigste Fall der mir bekannt ist und schön wirksam in Szene gesetzt wurde, war von Mr MikeAP. Der hat sein Konto auch nur widerbekommen, weil er lückenlos nachweisen konnte, daß es sein Konto ist und das er eben gehackt wurde bzw. daß seine Logindaten von dem Hacker ermittelt wurden (weil richtiges Hacken ist das nunmal nicht). Hinzu kam noch das der Hacker sich bei ihm meldete , ob das Auswirkungen für die Acc-Freigabe hatte weiß ich jetzt nicht. \n\nAber für die Dauer der Prüfung war sein Acc halt gesperrt. Wenn die Überprüfung ob Dein Acc Dir gehört, negativ ausfällt, dann wirst Du eben bestraft. Ich denke mal, der Grundtenor ist das Weitergeben Deiner Daten, ob wissentlich oder unwissentlich und dann bist Du in der Bringschuld zu beweisen, daß es unwissentlich war und Du , wie auch immer , reingelegt wurdest. \n\nDu bist halt verantwortlich für deine Daten. D.h. Logindaten , wenn es geht, eben nicht auf den PC abspeichern, keine dubiosen Links anklicken usw.\n\nWurde aber alles hier im Forum schonmal durchgekaut, da ist nix interessantes dabei. Meine Tochter hatte dieselbe Erfahrung gemacht und mir hat der Support da sehr gut geholfen. Sie hatte definitiv auf nen Link im Clienten geklickt. Also wenn man Immer nett und höflich am Ball bleibt und nachweisen kann, daß einem der Acc gehört, dann wird einem auch geholfen. Ansonsten ist man eben um eine Erfahrung reicher ^^\n\nbtw. die Namen der Youtuber sind seltenst gleich den Beschwörernamen. Die YT- Namen wirst Du wohl hier im Forum nennen können (kommt denen sogar zugute - Werbung). Ich wüßte auch gern, wer da noch in solche Geschichten involviert war/ist .\n\nmfg\nMB","replies":[]}]},{"poster":"eingew","date":"2016-11-23T17:47:41.097+0000","up_votes":2,"down_votes":0,"body":"Damit meldest du dich am besten beim [Support](http://euw.leagueoflegends.com/de). Wir Spieler hier im Forum können da leider nicht helfen.","replies":[]}]},{"poster":"Berserker Cookie","date":"2016-11-22T22:53:15.360+0000","up_votes":1,"down_votes":0,"body":"Ich nehme mal scharf an das hat was mit RP kauf zu tun und es ist zu einer rückbuchung gekommen. (Diverse Gründe)\nSollte für den Support kein Problem sein das rückgängig zu machen denn wäre der Account wegen Flame/Hack gesperrt würde das auch da stehen.","replies":[]},{"poster":"stoitzii","date":"2016-11-22T19:24:38.447+0000","up_votes":1,"down_votes":0,"body":"Naja, da kannste nur auf die Support antwort warten. Aber, im Endeffekt wird keiner ohne Grund perma gebannt^^ Wenn du glück hast ( sehr sehr sehr sehr viel) wars ein Fehler. Naja wie auch immer Gl hf","replies":[]},{"poster":"RexusKingZz","date":"2016-11-22T21:10:51.950+0000","up_votes":1,"down_votes":2,"body":"DREXXSACK Das war auch mein erster Gedanke aber mein Konto war gedeckt ich hab auch keine Nachricht bekommen das die Rechnung nicht bezahlt wurde. Ich warte jetzt einfach mal ab, vll haben die das noch nicht abgebucht oder sonst was ist dazwischen gekommen ^^ aber Danke für deine Nachricht","replies":[]},{"poster":"RexusKingZz","date":"2016-11-22T19:27:09.999+0000","up_votes":1,"down_votes":2,"body":"Trump The Dumb Ja Danke für deine Nachricht. :)","replies":[]},{"poster":"AwP RocKat","date":"2016-11-22T21:43:17.512+0000","up_votes":1,"down_votes":3,"body":"bei mir ist das selbe passiert auch heute","replies":[]}]}