{"poster":"vAlcalde","date":"2016-10-17T00:00:02.977+0000","title":"No aburre la repetición de los campeones en el mundial?","subforum":"Esports","up_votes":3,"down_votes":3,"body":"Mirando el match de G2K y ANX en el cual repitieron SIETE campeones de diez con respecto al primer match, pens&eacute; que quiz&aacute;s la inclusi&oacute;n de una regla que diga que no se pueden repetir los campeones usados en una partida y la otra enriquecer&iacute;a la variedad. Resulta que siempre se ven los mismos veinte  en todos los mundiales y nos perdemos de ver campeones en alto rendimiento que ayudar&iacute;a al espect&aacute;culo y al fomento de otros. Capaz es una boludes y nunca llegue a RIOT, pero es, al menos, un descargo.","replies":[{"poster":"Blue Striker","date":"2016-10-17T00:15:54.286+0000","up_votes":2,"down_votes":0,"body":"aparte de aburrirme por los champs, me aburre que los coreanos siempre ganen el mundial... PERO MAS ME ABURRE VER A SKTT1 GANAR!!!","replies":[{"poster":"vAlcalde","date":"2016-10-17T00:28:33.638+0000","up_votes":2,"down_votes":0,"body":"Son diferentes, eso no me molesta, me molesta que ganen usando los mismos diez campeones todo el torneo. Quiero que vuelva el zed de faker :'(","replies":[]}]},{"poster":"martincarp","date":"2016-10-17T00:05:19.740+0000","up_votes":1,"down_votes":1,"body":"Justamente los campeones que se ven constantemente en un mundial son los que tienen alto rendimiento, sino ni se usarían. Y la idea siempre fue que haya un pool de 20 a 25 campeones usándose en toda meta, no sólo en el mundial. En mi opinión está perfecto, ya que si hubiera más campeones disponibles que estén muy fuertes, haría que el draft sea innecesario, ya que ceder algo no sería para nada un peligro y aún así te permitiría seleccionar campeones ultra fuertes. En cambio habiendo 2 campeones que son EXTREMADAMENTE fuerte por rol, o unos 5 o 6 campeones que sin importar el rol la rompen toda, hace que el draft sea una clave para decidir las partidas, y que el equipo mejor preparado para una fase de selección y bloqueos pueda capitalizar esa ventaja.","replies":[{"poster":"vAlcalde","date":"2016-10-17T00:10:57.599+0000","up_votes":2,"down_votes":0,"body":"Ese es el error, que la partida salga con una ventaja desde el draft. Likkrit y ANX propusieron algo diferente en este mundial con selecciones completamente fuera de la media y con muy buenos resultados. Quiero más de eso, sino el próximo mundial lo voy a tener que ver hasta que termine la fase de grupos, después es monótono y aburrido (y siempre gana Corea)","replies":[]}]},{"poster":"Aluneth","date":"2016-10-17T00:02:21.255+0000","up_votes":2,"down_votes":0,"body":"Es lo que se gana rito nerfeando todo lo que camina.. los mundiales terminando siendo aburridos.","replies":[]},{"poster":"AsunaYuukiSAO","date":"2016-10-17T18:06:43.345+0000","up_votes":1,"down_votes":0,"body":"yo quiero q gane SKT :) y sobre repetir campeones me parece que es lo normal se juega con lo que esta dentro del meta y las composiciones, lo cual genera un papel fundamental para la selección y bloqueos, si te fijas nunca bloquean o sacan un teemo por el contrario bloquean campeones que uno en la solo Q diría para que bloqueas eso y no un yasuo por ejemplo pero es porque la forma de juego es diferente en esas instancias","replies":[]},{"poster":"Durango menor","date":"2016-10-17T01:00:11.329+0000","up_votes":1,"down_votes":0,"body":"El tema es que juegan en team para tener x tipo de composicion, pero la verdad que estaria bueno, tal vez no en faso de eliminatoria, pero durante el año, ver champions que nosotros usemos a diario, por ejemplo ver yasuo, ahri, vayne, etc etc.","replies":[]},{"poster":"Around the world","date":"2016-10-17T00:04:48.458+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo, solo veo 1 partido y depues me aburre tanto ver los mismos campeones repetirse que dejo de ver, luego termino viendo quien gano y quien perdio en la pagina web jaja","replies":[{"poster":"vAlcalde","date":"2016-10-17T00:30:32.317+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo, pero este año me interesó ANX y su propuesta, después es todo más o menos parecido","replies":[]}]},{"poster":"Nata","date":"2016-10-17T00:03:55.336+0000","up_votes":1,"down_votes":0,"body":"Es que son profesionales y estan compitiendo. Ellos van a jugar lo que este en el meta y lo que sea mas fuerte. Como vos decis capaz hay mas campeones de alto rendimiento pero no para un equipo sino capaz para un SoloQ","replies":[]},{"poster":"kipkeior","date":"2016-10-17T01:05:48.626+0000","up_votes":1,"down_votes":1,"body":"Tal como league of legends , aburre :D","replies":[]}]}