{"poster":"DasistKunst","date":"2019-05-27T11:36:27.948+0000","title":"Bitte um genaue Erklärung der LP Verteilung für Dumme, die gerade auf dem Schlauch stehen","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hi,\nIch habe mir das hier durchgelesen und stehe irgendwie gerade auf dem Schlauch:\nhttps://nexus.leagueoflegends.com/de-de/2018/06/dev-addressing-your-feedback-on-ranked-for-2019/\nAber anscheinend spielt es auch eine Rolle, wie oft man eine Rolle spielt.\nZurzeit spiele ich main Top und mit meinem Kumpel immer als Carry auf der Botlane. Wenn man sich die Anzahl der Spiele der aktuellen Saison auf meinem Profil anschaut, könnte man sagen, ich Spiele ca. zu 66% Top und zu 33% Carry bot. \nFrüher war es ja so, dass entscheidend war, wie hoch der Rang der Gegner im vergleich zum eigenen war. Gewann man z.B. gegen Gegner die höher waren als man selber, gab es mehr LP, verlor man gegen Gegner, die einen niedrigeren Rang hatten als man selber, verlor man mehr LP. Nun fiel mir und meinem Kumpel folgendes auf: Er ist Gold IV und ich bin Silber III. Wenn wir nun zusammen spielen, bekommt er bei einem sieg 20 LP und ich nur 16, verlieren wir, werden mir ganze 20 abgezogen und ihm nur 16. Also umgekehrt, wie es ja eigentlich sein sollte. Zugegeben, ich hatte nach nerfs auf falsche Helden gesetzt, wodurch meine Winrate leicht in den Keller ging. Aber seit ner Woche hat sich das wieder gefangen und normalerweise beeinflusst dass doch auch nur, welche Gegner ich kriege nicht aber von vornerein die LP. Verlor man z.B. oft, bekommt man halt schnell Gegner unter dem eigenen Rang und wenn man dann verliert, verlor man halt  dementsprechend mehr Punkte. Man konnte sich ja noch vor dieser Saison hier die sogenannte eigene \"Elo\" anschauen, die dir zeigte, in welche Klasse man dich momentan einstuft, aber das geht nun wohl nicht mehr \nhttps://euw.op.gg/summoner/userName=DasistKunst\n Ihr könnt gerne mein Profil genau anschauen, wenn das hilft, aber kann mir einer erklären, wie das jetzt genau mit den LP abläuft und warum ich im Vergleich zum Mate so abgestraft werde? Liegt es daran, das mich das System als main Top einstuft und ich quasi als Carry das spiel nicht so ernst nehmen könnte? Ich möchte es nur verstehen, damit ich weis, was ich tun muss, um das zu ändern.","replies":[{"poster":"biohazard27","date":"2019-05-27T12:31:38.310+0000","up_votes":2,"down_votes":0,"body":"also update. die von die angesprochene rollenbezogene rangliste wurde nach einer testphase in -glaubs NA &amp; sonstwo- verworfen weil das system zu anfällig für manipulation war. das system ist immer noch das selbe wie früher, wenn auch mit angepassten rängen. \n\nfür den lp änderung ist einzig deine mmr wichtig. auch bestimmt sie deine gegnerzuweisung. der angezeigte rang ist eine maske, je weiter deine mmr von dieser anzeige entfernt ist desto mehr punkte verlierst / oder gewinnst du. \n\nwenn man sich dein profil durchschaut spielest du druchschnittlich gegen spieler von s4/b1. dein angezeigter rang ist aber s3. deshalb wirst du vom system leicht, mit einer 4er differenz nach unten gedrückt bis deine anzeige deiner mmr entspricht.","replies":[{"poster":"DasistKunst","date":"2019-05-27T13:14:36.348+0000","up_votes":1,"down_votes":0,"body":"achsoo verstehe. Welchen Rang die Gegner haben ist also komplett irrelevant, sondern nur der eigene MMR. GEnau diesen Wert meinte ich mit dieser eigenen elo. Das heißt Also egal gegen wen man spielt, ist die mmr niedriger, als der angezeigte Rang, verliert man mehr, wei ldas System der Meinung ist, man wird zu hoch eingestuft, und ist er höher, bekommt man mehr weil man vermeintlich zu niedrig eingestuft wird? Verstehe ich das so richtig? Ich dachte immer, dafür wäre letztendlich der Eloschnitt der Gegner entscheidend und nicht die mmr. Alles klar, danke wieder was dazugelernt ;)","replies":[{"poster":"biohazard27","date":"2019-05-27T13:53:45.353+0000","up_votes":1,"down_votes":1,"body":"ya du hasts richtig verstanden. \n\nin der normalen berechnung würdest du auch mehr punkte bekommen wenn du gegen höher eingestufte spieler gewinnst. da lol aber über eine sehr hohe spielerbasis verfügt kommen spiel mit markanten mmr-unterschieden nicht zustande. wichtig nicht zu verwechseln mit dem tatsächlich angezeigten rang weil dieser eben nicht aussagekräftig genug ist.\n\nmöglicher tipp um deine mmr zu fixen: du spielst dich in die promos dodgst da und fliegst wieder raus. wenn du dabei eine hohe winnrate aufweisen kannst, wie aktuell mit 58% auf 19spiele sollte sich das bald wieder normalisieren.","replies":[{"poster":"DasistKunst","date":"2019-05-28T14:15:17.319+0000","up_votes":1,"down_votes":0,"body":"Danke für den Tipp aber ich denke, ich würde die Promo dann trotzdem versuchen zu schaffen. Ich wollte nur wissen, warum ich so wenig Punkte bekomme. Das normalisiert sich ja von selber irgendwann. Was ich nur komisch finde, wie du ja sagtest, ist die Winrate aktuell  seit längerem gut, habe jetzt aber beim letzten Sieg sogar nur noch 15 Punkte bekommen und direkt beim match davor, was auch gewonnen wurde noch 16. Es geht also genau in die andere Richtung als in die, es es eigentlich meiner Meinung nach sollte, da auch die Bronzebeteiligung deutlich zurückgegangen ist","replies":[{"poster":"biohazard27","date":"2019-05-28T20:01:14.387+0000","up_votes":1,"down_votes":1,"body":"wie geagt geh nich nach den sichtlichen rängen. damit es sich die winnrate im lp zuwachs zeigt musst du einfach konstant so weiter machen. der grund ist, dass die lp vergabe ne art gummibandeffekt beinhaltet. dieser dient dazu winnstreks oder losingstreaks die klar nicht leistungsabhängig sind abzufedern.\n\nals beispiel deine bilanz die 40games uf der lose seite hat sind mehr als dieser gummibandeffekt aushät &amp; haben sich halt in deiner lp vergabe angezeichnet. machst du aber halt weiter wie bisher mit der winnrate sollte sich das aber wieder normalisieren","replies":[]}]}]}]}]}]}