{"poster":"Borlok ","date":"2016-12-12T18:22:07.667+0000","title":"Bronce 3 y gane 7 de las 10 porque?","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Alguien que me explique porque un amigo gano 4 de las 10 y quedo en plata 2 y otro gano 3 y tambi&eacute;n quedo en plata 2 no entiendo, me esforc&eacute; para jugar bien y todo y me dejan en b3....","replies":[{"poster":"Painstrike","date":"2016-12-12T18:24:19.265+0000","up_votes":3,"down_votes":0,"body":"Hmmm, no te creo lo primero jajaj, personalmente era Oro V, gane 7 de las 10 y termine bronce 2. Lo veo como un desafio mas que algo para quejarme/Dejar de jugar.\n\nSaludos!","replies":[{"poster":"Borlok ","date":"2016-12-12T18:33:27.941+0000","up_votes":1,"down_votes":0,"body":"Amigo fíjate si quieres recién jugué mi ultima partida y no jugué ninguna otra estoy en bronce 3 con 0pl. lo entiendo de tu parte tu eras Oro V pero yo en la pasada termine B3, me molesta un poco porque hace un año que juego recién y ahora que aprendí algo me me dejan en lo mismo que antes , en la pasada season gane 3 de 10 sin saber jugar y termine b2 -.- y en esta sabiendo algo termino en b3, mas que un reto es una burla, no se , gracias por opinar, Saludos!","replies":[{"poster":"Painstrike","date":"2016-12-12T18:42:21.672+0000","up_votes":2,"down_votes":0,"body":"Hay algo que aparentemente no sabes, es el MMR, el MMR no se reinicia por season, se mantiene y te dice que vas a ser la proxima season, te explico:\n\nAl tener una cuenta nivel 30 que no jugo ninguna ranked, esta tiene el mmr digamos \"0000\"(unranked) y hay 4 ligas posibles a la que podes subir jugando las primeras 10 lo que serian \"4000\"(Platino) de MRR\nBueno, adelantando tiempo, cada partida vale digamos \"300\" por ganada y \"400\" por perdida. Ganaste 3 de las 10, Eso te deja en \"0000\" Pero al ser tu primera vez, el sistema te ayuda un poquito, dejandote en \"0800\" -> Bronce 3\n\nAdelantamos a la siguente season, esto es lo que pasa: Si bien tu Rank es reiniciado, el MMR **NO LO ES** Por lo que jugas 10 partidas, con \"0800\" de MMR. Ganaste 7 de las 10, eso te deja en \"0900\", pero ¡hay otro sistema mas! Al ser esta tu segunda season, el sistema te obliga a bajar almenos una liga, por lo que tus \"0900\" - \"1000\" te deja en \"0000\", por lo que te quedas en bronce 5.\n\nSaludos!","replies":[{"poster":"Sonya Kyron","date":"2016-12-12T19:16:18.184+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Painstrike,realm=LAS,application-id=v7qsfXsE,discussion-id=U4e90QnE,comment-id=000000000000,timestamp=2016-12-12T18:42:21.672+0000)\n>\n> Hay algo que aparentemente no sabes, es el MMR, el MMR no se reinicia por season, se mantiene y te dice que vas a ser la proxima season, te explico:\n> \n> Al tener una cuenta nivel 30 que no jugo ninguna ranked, esta tiene el mmr digamos &quot;0000&quot;(unranked) y hay 4 ligas posibles a la que podes subir jugando las primeras 10 lo que serian &quot;4000&quot;(Platino) de MRR\n> Bueno, adelantando tiempo, cada partida vale digamos &quot;300&quot; por ganada y &quot;400&quot; por perdida. Ganaste 3 de las 10, Eso te deja en &quot;0000&quot; Pero al ser tu primera vez, el sistema te ayuda un poquito, dejandote en &quot;0800&quot; -&gt; Bronce 3\n> \n> Adelantamos a la siguente season, esto es lo que pasa: Si bien tu Rank es reiniciado, el MMR **NO LO ES** Por lo que jugas 10 partidas, con &quot;0800&quot; de MMR. Ganaste 7 de las 10, eso te deja en &quot;0900&quot;, pero ¡hay otro sistema mas! Al ser esta tu segunda season, el sistema te obliga a bajar almenos una liga, por lo que tus &quot;0900&quot; - &quot;1000&quot; te deja en &quot;0000&quot;, por lo que te quedas en bronce 5.\n> \n> Saludos!\n\nEl unranked vale 1000 exactamente lo mismo que el plata 5.\nlas partidas de clasificación valen desde -150 a +150 pero los valores normales son +/-90 o +/-120.\narrancando a rankear por primera vez salis con 1000 los máximos puntos te pueden dejar en 1800 con suerte platino 1,\nya que a medida que tu MMR sube los puntos ganados bajan en proporción gracias al MMR de los derrotados.","replies":[{"poster":"Painstrike","date":"2016-12-12T19:21:18.696+0000","up_votes":1,"down_votes":0,"body":"¡Gracias Sonya! No sabia los números exactos. Sabía que el Unranked vale 1000, pero para hacerlo un poco mas fácil y simplificado, le agregue números mas grandes.","replies":[{"poster":"Sonya Kyron","date":"2016-12-12T20:51:48.422+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Painstrike,realm=LAS,application-id=v7qsfXsE,discussion-id=U4e90QnE,comment-id=00000000000000010000,timestamp=2016-12-12T19:21:18.696+0000)\n>\n> ¡Gracias Sonya! No sabia los números exactos. Sabía que el Unranked vale 1000, pero para hacerlo un poco mas fácil y simplificado, le agregue números mas grandes.\n\nHasta hace poco había una tabla de los MMR liga por liga, pero el piso de Bronce 5 era 600 de MMR, 670MMR ya era bronce4, y de ahí es 70 en 70 que va escalando.","replies":[]}]}]},{"poster":"Borlok ","date":"2016-12-12T18:47:07.598+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por tomarte el tiempo de explicar, la verdad que no tenia ni idea, soy relativamente nuevo en el juego, ahora entiendo mas o menos que paso, muchas gracias, voy a ponerme las pilas y terminar en oro esta season, Saludos muchas gracias por explicar.","replies":[{"poster":"Painstrike","date":"2016-12-12T18:53:29.595+0000","up_votes":1,"down_votes":0,"body":"¡De nada! Si tenes otra pregunta, ¡No dudes en preguntar!\n\nSaludos!","replies":[]}]}]}]}]},{"poster":"I Am Tiny Rick","date":"2016-12-12T18:36:13.330+0000","up_votes":1,"down_votes":0,"body":"y si ganaste 7 dudo mucho que te cueste ganar algunas mas y subir... no entiendo la logica de la pregunta","replies":[{"poster":"Borlok ","date":"2016-12-12T18:38:16.477+0000","up_votes":1,"down_votes":0,"body":"Amigo me costo, en la S6 termine en b3 asi que bueno no soy, y lograr ganar 7 y que me dejen en b3 cuando amigos ganaron 4 y quedaron en plata me parece algo con poca logica, en la anterior season gane 3 sin saber jugar  y me dejaron en b2 -.-","replies":[{"poster":"I Am Tiny Rick","date":"2016-12-14T02:48:22.842+0000","up_votes":1,"down_votes":0,"body":"Bueno no lo veo de esa forma pero en fin, tene en cuenta que si jugaste mucho duo tu mmr suele ser inferior a lo que realmente sos y puede ser que por eso te hayan dejado ahi. Pero en fin la gracia es aprender y mejorar y por mas que te quejen no te van a subir a donde vos quieras.","replies":[]},{"poster":"Mioen","date":"2016-12-12T22:34:33.899+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Borlok ,realm=LAS,application-id=v7qsfXsE,discussion-id=U4e90QnE,comment-id=00030000,timestamp=2016-12-12T18:38:16.477+0000)\n>\n> Amigo me costo, en la S6 termine en b3 asi que bueno no soy, y lograr ganar 7 y que me dejen en b3 cuando amigos ganaron 4 y quedaron en plata me parece algo con poca logica, en la anterior season gane 3 sin saber jugar  y me dejaron en b2 -.-\n\nSi llevan mas tiempo tus amigos el por el MMR que fueron ganando con los años o quizas tenian un MMR similar al de plata.\nPor otra parte, no eran tus primeras 10, ya que el año pasado te dieron una división, por lo que si no jugaste mucho o tu nivel bajo o subio muy poco, era probable que te dejaran en la misma o mas bajo de lo que estabas.\nLa cantidad de victorias en las 10 de posicionamiento no son tan importantes, ya esta casi predefinido por tu desempeño de la temporada pasada.\nRepito solo en las primeras 10(Literal tus primeras 10 ranked podes especular). Luego las 10 de cada temporada son en base a tu desempeño anterior y en pretemporada. \nEspero que te haya sido de ayuda.\nhttps://www.youtube.com/watch?v=9zdG-FzA5-A","replies":[]}]}]},{"poster":"maximoasesino","date":"2016-12-12T23:21:44.398+0000","up_votes":1,"down_votes":0,"body":"no importa si ganaste las 10 men depende como jugaste te dejaron en bronce 3 por que tenias el mmr de un bronce1 o plata5 por eso acordate que siempre te dejan abajo en donde estabas la s pasado","replies":[]},{"poster":"MatiasZERO","date":"2016-12-12T23:18:32.025+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=7p-BehrKZLI \n\nEnjoy!.-","replies":[]},{"poster":"Sonya Kyron","date":"2016-12-12T19:12:38.590+0000","up_votes":1,"down_votes":0,"body":"te lo voy a explicar fácil\njugador 1 es challenger con 4000 de MMR +1000 /2 queda en 2500, pierde las 10, queda en 1500, ahora queda plata 2.\njugador 2 es bronce 5 con 400 de MMR +1000 /2 queda en 700 gana las 10 queda en 1300 queda plata 4.\n\nSi, hay posiciones máximas y minimas, claro que teniendo suerte en partidas mas valoradas el mejor subidon seria de Bronce 5 a plata 1 teóricamente pero a nadie le paso, y la peor bajada seria de Diamante 5 a Bronce 5, y eso si paso varias veces, no tenes de que quejarte.","replies":[]},{"poster":"Natchin","date":"2016-12-12T18:33:49.794+0000","up_votes":1,"down_votes":0,"body":"Eras bronce 2 la season pasada, asi que está bien. Te dejaron sólo 1 división más abajo.","replies":[{"poster":"Borlok ","date":"2016-12-12T18:39:32.789+0000","up_votes":1,"down_votes":0,"body":"Tiene poca logica para mi no se como pensara el programa que ubica, esperaba algo mas ya que me esforce mucho mas que en la anterior season donde solo gane 3 y quede b2","replies":[{"poster":"Natchin","date":"2016-12-12T19:02:47.290+0000","up_votes":1,"down_votes":0,"body":"Piensa que los Masters y Challengers aunque ganen las 10 no pueden aspirar a algo más que platino 1, eso es más de una división completa por debajo de su posición real.\n\nSi tu crees que mereces estar más alto entonces sigue jugando y eventualmente vas a subir, te lo digo por experiencia propia.","replies":[]}]}]},{"poster":"AuroraExecution","date":"2016-12-12T18:55:43.390+0000","up_votes":1,"down_votes":0,"body":"Porque esta en la liga que te mereces estar, tan simple como eso.","replies":[]},{"poster":"Li Grim","date":"2016-12-12T18:30:47.354+0000","up_votes":1,"down_votes":0,"body":"Te explico: Pero primero, ¿qué liga eras antes y tus amigos?","replies":[{"poster":"Borlok ","date":"2016-12-12T18:34:30.510+0000","up_votes":1,"down_votes":0,"body":"Termine B3 la pasada y era el primer año que jugaba y no tenia ni idea , jugué solo casi todas las ranked ponele que solo 4 en duo.","replies":[{"poster":"Li Grim","date":"2016-12-12T18:44:21.861+0000","up_votes":1,"down_votes":0,"body":"Con razón, debiste ver el cartel que puso Riot con el nuevo parche: nadie terminará en una liga superior, todos bajarán y eso es porque los challenger, maestros y diamantes pueden aspirar como máximo a platino I, bajando hasta 2 ligas enteras, por ende, todos bajarán al igual que ellos.\n\nLas 7 que ganaste te ayudaron a no terminar en b5, en cuanto a tus amigos, de seguro eran de una liga superior a la que terminaron y a la tuya, por eso terminaron más arriba que tú. ","replies":[]}]}]},{"poster":"Cyclosarin","date":"2016-12-12T18:39:59.795+0000","up_votes":1,"down_votes":0,"body":"Eras Bronce II y empezás Bronce III? Y de que te quejas? Si eres mejor que eso, será facilisimo subir. No entiendo los que se quejan","replies":[{"poster":"Borlok ","date":"2016-12-12T18:42:08.418+0000","up_votes":1,"down_votes":1,"body":"La queja viene en que amigos que se esforzaron menos y ganaron menos partidas que yo quedaron mejor posicionados, eso es lo que me molesta, pero este año termino en oro si o si.","replies":[]}]}]}