{"poster":"kaiderhai","date":"2017-03-20T16:07:49.926+0000","title":"Suche aktives Team :)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey ich bin Kai, 18 Jahre alt und suche wie der Titel schon sagt ein aktives Team :)\r\nIch spiele haupts&auml;chlich Jungle und Midlane. Derzeit bin ich Platin 5. Ich bin ehrlich, auf anderen Positionen spiele ich vllt wie Gold :D.\r\n\r\nZu mir:\r\n-TS3 vorhanden (mit gutem mic nat&uuml;rlich XD)\r\n-Platin 5 letzte Season Platin 4\r\n-Midlane\r\n-Championpool ist so naja aber sollte gehen:D\r\n\r\nzu euch:\r\n-bitte mindestens Gold entweder in Flex oder Solo \r\n-am besten schon ein vorhandenes Team\r\n-TS3\r\n\r\neigentlich gibt es nicht mehr zu sagen denke. Achja ich mache dieses Jahr Abi also werde ich nicht regelm&auml;&szlig;ig zocken k&ouml;nnen verusche aber auf 3 Spiele am Tag zu kommen. Und bitte seid nicht Humorbehindert aber auch nicht so dass man nicht serious zocken kann ohne jedes game auf die Mappe zu bekommen :D\r\n\r\nmfg Kai\r\nIGN: Foxf1re","replies":[{"poster":"D3Di","date":"2017-03-20T17:06:13.968+0000","up_votes":1,"down_votes":0,"body":"Hey,\nbaue gerade ein Team aus Gold-Plat mates auf, wir suchen noch einen Jungler. Wenn du Interesse hast, kannst du mich gerne adden :)\nGruß Gnaeus Pompeïus","replies":[]},{"poster":"Eighty Carry","date":"2017-03-20T16:59:34.686+0000","up_votes":1,"down_votes":0,"body":"Heyho,\n\neventuell wäre unsere Community etwas für dich. Wir bieten Coaching, Teambetreuung sowie Turniere an. Aktuell sind wir um die 130+ aktive Mitglieder & sind in allen Elo's von Unranked-Master vertreten. Bei uns findet immer jeder jemanden zum Spielen sei es für Normals, Rankeds oder auch Customs. Gerne laden wir Dich zu einem Gespräch auf dem Teamspeak ein.\n\nUnser Post im League of Legends Forum: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/mr8iv0EJ-a-rift-guardians-sucht-mitglieder-teamerstellung-community-coaching-overwatch-a\n\nMit freundlichen Grüßen,\n\nRift Guardians","replies":[]}]}