{"poster":"Shotrings","date":"2015-09-01T18:09:02.057+0000","title":"\"Botones de Eleccion de Lineas\"","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Bueno, estoy muy enojado, porque ultimamente estoy perdiendo la linea, nunca puedo ir a la linea que quiero porque tengo un pc no muy bueno, y tarda en enviar el mensaje, seguramente a muchos les pase, asi que quisiera que agregaran **&quot;Botones de Eleccion de Lineas&quot;** asi elegis la linea, y te pone con un equipo que haya elegido diferentes lineas, ya estoy por romper la computadora porque nunca puedo ir a mid.....","replies":[{"poster":"Shotrings","date":"2015-09-02T18:56:07.224+0000","up_votes":1,"down_votes":0,"body":"Sin querer borre un comentario que tenia una idea muy buena, aunque ya lo habia pensado, pero me parecia mejor esta, aunque por otro comentario me di cuenta que estaba mal la mia, la que estaba buena era: En vez de poner botones, poner tiempo (5 segundos aprox) para que se carguen todos, una vez que todos entraron a la sala, recien ahi pueden escribir bien rapido la linea, eso seria lo mas justo","replies":[]},{"poster":"shadowburner","date":"2015-09-02T01:06:49.502+0000","up_votes":1,"down_votes":0,"body":"jajajaj estoy de acuerdo con vos me pasa lo mismo quiero una linea pero escribo a dos por hora xD y siempre me la sacan esta muy buena esa idea","replies":[]},{"poster":"CJ14","date":"2015-09-01T19:32:56.919+0000","up_votes":1,"down_votes":0,"body":"CREADOR DE EQUIPOS","replies":[{"poster":"Hwaxinghz","date":"2015-09-01T20:32:18.785+0000","up_votes":1,"down_votes":0,"body":"es Level menos de 30... El creador de equipos le demorará 10 horas en encontrar equipo, por eso está diciendo.","replies":[{"poster":"CJ14","date":"2015-09-02T00:19:43.675+0000","up_votes":1,"down_votes":0,"body":"En ese caso sugiero simplemente asumirlo, esperar a lvl 30 y luego usar el creador de equipo, que, para mi, siempre ha sido tan o mas rapido que el normal q","replies":[]}]}]},{"poster":"Shotrings","date":"2015-09-01T18:09:29.340+0000","up_votes":1,"down_votes":0,"body":"Si les pasa lo mismo, porfavor comenten aca","replies":[{"poster":"gambito700","date":"2015-09-01T22:14:16.822+0000","up_votes":1,"down_votes":0,"body":"y si entro a la partida... selecciono el boton de mid y otro entra despues, y no puede elegir mid. clickea top. pero cuando empieza la partida se va mid.... se queda hay farmeando y dejando top solo y sin nadie. podria lo siguiente:\n\n- me pongo a pelear con el por 5 o 10 min esperando que su pequeña mente entienda\n- me largo a top y me enfrento contra un darius que me pasa en lvl, farm, y items juego defencivo hasta que se mete bajo torre me saca me pega dos basicos una R y me muero. esto lo repite hasta que rommea y mata a todos.\n- sigo farmeando como si nada. compartiendo xp con el. hasta que baja un darius de top ultra feed free farm... nos pega una Q dos basicos y una R para cada uno. rommea y todos mueren.\n- me voy afk en base reclamo como enfermo lloro, le digo report... espero... aparece un darius de un brush mata a todos y gana el solo.\n\ncomo ves, las opciones son muchas pero ninguna 100% efectiva. por muy perfecto que sea el sistema de juegos, solo los jugadores son los que hacen que todo sea mas comodo y gratificante para todos. :)","replies":[]},{"poster":"Korneliuz","date":"2015-09-01T18:18:57.363+0000","up_votes":1,"down_votes":0,"body":"porque poner botones para elegir lineas si ay algo llamado creador de equipo elijes la linea que quieres ir  te ubican con un team que le falta dicha linea","replies":[{"poster":"warrior530","date":"2015-09-01T18:28:59.437+0000","up_votes":1,"down_votes":0,"body":"es nivel 22 aun no puede acceder","replies":[]}]}]},{"poster":"Marduk","date":"2015-09-01T18:18:10.628+0000","up_votes":1,"down_votes":0,"body":"Creador de equipos?","replies":[{"poster":"Hwaxinghz","date":"2015-09-01T20:33:44.013+0000","up_votes":1,"down_votes":0,"body":"es level 22, no puede","replies":[]}]},{"poster":"Gakiod","date":"2015-09-01T18:23:21.684+0000","up_votes":2,"down_votes":2,"body":"jeje creador de equipos","replies":[{"poster":"Hwaxinghz","date":"2015-09-01T20:33:26.082+0000","up_votes":1,"down_votes":0,"body":"Mira su nivel de cuenta (menor a 30)... imposible el creador de equipos... demoraría años en encontrar partida","replies":[]}]},{"poster":"lordeman10","date":"2015-09-01T20:02:12.460+0000","up_votes":1,"down_votes":0,"body":"riot no puede forzar el meta eso lo establece la comunidad, por eso no se pueden \"pedir lineas\" de una forma sistemática más que con el creador\n\nbueno sos nivel 22 te entiendo a ese nivel es totalmente imposible encontrar una partida con el creador, solo te puedo aconsejar que no lo conviertas en un problema y te acostumbres","replies":[]},{"poster":"Tatsuya","date":"2015-09-01T19:00:55.876+0000","up_votes":1,"down_votes":0,"body":"mas que un boton, bloquear el chat hasta que todos los jugadores esten conectados, y en el caso que uno no se conecte aun por problemas de conexion, que haya al menos 5 o 6 segundos de tiempo de bloqueo para que todos canten lineas\nen Draftpick no importa porque hay facil como 3 minutos hasta que deciden que va ir cada uno, ademas que en ranked donde estoy, se respeta el orden de pick.\n\n2do, casi NUNCA falta el \"gane top/mid/adc\" a pesar que realmente no gano, y si gano legalmente, necesita testigos neutrales para poder decir \"si realmente gano, lo canto incluso antes que vos lo digas.\n\nA mi me toco varias veces gente estupida que dice \"Gane top\" cuando yo la habia ganado por canto y teniendo como 2 lineas de 1 persona que canto \"jg/mid\" (sabiendo que yo gane top) adelante de el, y toda la sala diciendo que yo gane mi rol, instalockean = y forzandome a mi a ir support (que no tengo drama si perdi mi linea legal o estoy de humor de ir a fillear) por las malas, hay incluso gente buena onda que ofrecen sus roles que ganaron para no terminar con support x las malas. y la onda no es la misma.","replies":[]},{"poster":"Aluneth","date":"2015-09-01T18:19:18.442+0000","up_votes":1,"down_votes":0,"body":"Si, hay algo llamado creador de equipos que hace exactamente lo mismo. Se desbloquea a lv 25 creo, aguanta 3 niveles mas.","replies":[]},{"poster":"Sir Crucifix ","date":"2015-09-01T18:37:02.573+0000","up_votes":1,"down_votes":1,"body":"No es lo mismo creador de equipos que boton de linea. En el creador discriminan a Los champs","replies":[]}]}