{"poster":"Kaytzo","date":"2019-09-13T17:34:09.149+0000","title":"Account-Verifizierung für besseres Matchmaking","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo Beschwörer,\r\n\r\nviele haben bestimmt schon die negative Erfahrung gemacht in einem Ranglistenspiel (egal ob Flex oder Solo-Q), dass die Gegner, obwohl die Liega etwa gleich ist, einem Haus hoch überlegen sind. Das liegt ja nicht selten daran, dass es viele Smurf-Accounts gibt. Ich habe teilweise das Gefühl, dass manche Games zu 80% aus Smurfs bestehen.\r\n\r\n**Hier mein Vorschlag**: Wie wäre es, wie z.B. auch bei Counterstrike, eine Account-Verifizierung mit Handynummer einzuführen. Damit könnte man meiner Meinung nach die Anzahl der Smurfs in Ranglistenspielen deutlich reduzieren. Ich sage nicht, dass nicht verifizierte Accounts keine Ranglistenspiele spielen dürfen, aber sie würden dann nur mit anderen Leuten zusammen Spielen, die auch keinen verifizierten Account haben. Damit würde man die Smurfs in \"Verifizierten Spielen\" deutlich reduzieren. Klar es gibt immer ein paar Leute die dann auch irgendwie ihren Smurf verifizieren aber das sei mal dahin gestellt. \r\n\r\nIch hatte diese Frage bereits einmal an einen Player-Support gestellt, worauf ich die Antwort bekam, dass _\"einer der größten Punkte die für League sprechen und überhaupt erst dafür gesorgt hat das Lol so groß geworden ist: Die Eintritts-Barriere ist wahnsinnig niedrig. Das Spiel ist F2P, und sobald du es installiert hast kannst du sofort loslegen\"_. Ich habe auf die Email nicht geantwortet, weil ich kein Privatgespräch via Email mit dem Player-Support führen wollte, dafür sind die ja auch nicht da. Ich bin mir momentan auch nicht sicher wie die Regelung ist, aber ich denke mann kann doch sicherlich erst mit LV 30 Ranglistenspiele erstellen, oder etwa nicht? Also wäre diese Veränderung ja auch nicht gegen die \"Eintritts-Barriere\". Wenn ich ein Spiel kostenlos spiele und nach einer Weile meinen Spaß in den Ranglisten haben will, hätte ich kein Problem damit meine Handynummer dafür zu Verifizieren um ein besseres Matchmaking zu unterstützen. Wie schon gesagt, bei spielen wie Counterstrike funktioniert es auch und man **muss** seinen Account ja auch nicht verifizieren.","replies":[{"poster":"Commandant Mewtu","date":"2019-09-13T17:50:14.889+0000","up_votes":4,"down_votes":0,"body":"Diese Verifizierung findet schon statt aber nur für Chlash (aka Crash), dort muss man auch seine Handynummer angeben und dies ist dann auch nur einmalig gültig, wenn man diese Nummer wieder entfernen möchte ist diese Handynummer 6 Monate gesperrt.","replies":[{"poster":"Kaytzo","date":"2019-09-16T13:54:27.740+0000","up_votes":1,"down_votes":0,"body":"Das hat mir nach dem Post auch jemand erzählt. Aber das macht die Sache ja nur noch einfacher umzusetzen. Wenn es bereits so ein System gibt ist es ja nicht schwer das auch auf die normalen Ranked Warteschlangen anzuwenden.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2019-09-17T01:08:02.850+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kaytzo,realm=EUW,application-id=Wj1wcocU,discussion-id=gP960Q6j,comment-id=,timestamp=2019-09-13T17:34:09.149+0000)\n>\n> Hallo Beschwörer,\n> \n> viele haben bestimmt schon die negative Erfahrung gemacht in einem Ranglistenspiel (egal ob Flex oder Solo-Q), dass die Gegner, obwohl die Liega etwa gleich ist, einem Haus hoch überlegen sind. Das liegt ja nicht selten daran, dass es viele Smurf-Accounts gibt. Ich habe teilweise das Gefühl, dass manche Games zu 80% aus Smurfs bestehen.\n\nEs liegt in Silber und Bronze überraschend selten daran, dass es Smurf Spieler sind. Aus verschiedensten Gründen:\n1.) bleiben Smurfs auf neuen Acconts nur ziemlich kurz in Silber und dürften Bronze nie erreichen, da sie halt 80% ihrer Lanes stompen, dadurch viele Spiele gewinnen und verdammt schnell in Gold oder Platin landen. Dort beginnt es dann erst zum Problem zu werden.\n2.) Es gibt verdammt wenige relevante Smurfs. Lediglich 400.000 Spieler sind Platin. Und selbst wenn du als Platin IV Spieler auf deinem Nebenrollen in Gold IV unterwegs bist, ist das kein relevanter Vorteil, weil man halt... nun ja... in diesen Nebenrollen oft nicht annähernd so gut ist. Wirklich relevant wäre es, wenn sich alle Diamondspieler gleichzeitig einen neuen Account hochspielen und gleichzeitig einloggen, damit das Silber Matchmaking wirklich ruiniert wird. Denn gerade mal 1,69% aller LoL Spieler sind Diamond oder höher...\n3.) Ist LoL einfach ein sehr snowballlastiges Spiel. Wenn die gegnerische Riven das Matchup gegen deinen Yasuo besser beherrscht, wird sie ihn mehrmals töten, dadurch immer stärker aussehen und am Ende wie ein Smurf wirken... obwohl sie einfach nur ihre Lane besser ausgespielt hat und der Yasuo nicht wusste, wie man dann defensiv spielt. Dass die Lane einfach nur eskaliert, ist wesentlich wahrscheinlicher und hat einen höheren Einfluss auf deinen Rank, als die Smurfs in Silber. Aber man schiebt so was halt gerne auf Smurfs, anstatt seine eigene Leistung zu hinterfragen und ob man einfach outplayed wurde. Das ist nur menschlich.\n\nFlex Que ist natürlich was anderes. Aber was will Riot machen, wenn es dich mit einem Platin- und einem Gold-Spieler als Premades in eine Ranked Que gehen lässt. Natürlich wird das Matchmaking dann extrem beschissen... Aber das weiß man halt, bevor man in diese Que geht. Das hat auch überhaupt nichts mit Smurfs zu tun...","replies":[]},{"poster":"HyperionCH","date":"2019-09-16T14:43:42.714+0000","up_votes":1,"down_votes":0,"body":"Abgesehen davon, dass man es wie gesagt umgehen kann:\n\nSmurfs sind nicht ausdrücklich verboten.\nDeshalb ist es rechtlich wohl schwierig, dass Riot Games den Spielern einen Account verbieten könnte, selbst wenn sie 2x die gleiche Telefonnummer angeben.\nGerade in EUW ist dies sehr schwierig, da jedes Land dies möglicherweise juristisch anders sieht.\n\nIch persönlich bezweifle, dass es wirklich viele smurfs in Low-Elo (bis Platin) gibt.\nDer Anteil der Spieler mit Dia4+ ist so gering, dass sie gar keine allzu grosse Auswirkung haben können; selbst wenn sie nur noch ihren smurf spielen (abgesehen davon, dass ihr Main in den Rankings decayen würde).\n\nIn FlexQ gibt es zugegeben teils ein Problem, dass z.B. ein Platinspieler nach der Einstufung erst Bronze/Silber ist und sich hocharbeiten muss. Das hat aber nichts mit \"smurfs\" zu tun, sondern ist ein grundsätzliches Problem.\nSo spielte ich gestern wieder FlexQ (bin dort noch Bronze 4) und unser Iron1-Toplaner ist in SoloQ Gold4 und der Iron1-Jungler auch immerhin Silber 2. Die haben auch recht gut gecarryt.\n\nIn der SoloQ bezweifle ich hingegen, dass in Low-Elo eine grosse Anzahl smurfs dabei sind. \nIn Low-Elo ist eher das Problem, dass zu viele Spieler \"All-In\" gehen. Wenn es schlecht geht, verlieren sie die Lane hart; wenn es gut geht, snowballen sie so stark, dass man glaubt, es wären smurfs.","replies":[]},{"poster":"Nycaria","date":"2019-09-14T09:50:24.264+0000","up_votes":1,"down_votes":1,"body":"Als wäre es schwer an eine zweite Nummer zu kommen ^^","replies":[{"poster":"Kaytzo","date":"2019-09-16T13:53:14.098+0000","up_votes":1,"down_votes":0,"body":"Ja, das Stimmt, das hab ich auch geschrieben. Es wird immer welche geben, die es schaffen das System zu umgehen. Aber das werden nur ein Paar wenige sein, die sich eine zweite Nummer beschaffen und nicht die Mehrheit.","replies":[]}]}]}