{"poster":"Y4l0","date":"2015-06-22T11:12:19.374+0000","title":"Diana oder Fizz","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich spiele meistens nur mitte und w&uuml;rde gerne einen Ap Assasin kaufen. Lb kommt nicht in Frage genau so wie Ekko.","replies":[{"poster":"ÆonFox","date":"2015-06-22T11:49:12.827+0000","up_votes":2,"down_votes":0,"body":"Diana\n+ gutes Laning (Bully gegen nahezu alle Meleemidlaner), seltener gebannt, sehr gut auch im Jungel spielbar, nicht vom treffen der Ulti abhängig (ist schlicht kein Skillshot), für einen Assassinen sehr Widerstandsfähig (ist aber auch nötig), sehr guter Waveclear und gutes Roaming.\n- keine Escapefähigkeit, kein auf Gegnerleben skalierender Schaden\n\nFizz\n+ Extrem nerfiger Gegner, schwehr zu packen, rein kill raus potential\n- Ohne Ulttreffe fehlt viel Schaden, schlechterer Waveclear\n\nSo mein Wissen dazu, ich bin Dianaspieler aber kein Fizzspieler und auch nur Silber.\n\nGruß Fox","replies":[{"poster":"Wìcked Clown","date":"2015-06-22T13:06:30.004+0000","up_votes":1,"down_votes":0,"body":"- Dianas Ult zu treffen ist zwar leicht, dafür hängt bei ihr einiges davon ab, ob man die Q trifft, weil sonst ein großer Teil ihres All-In-Schadens verloren geht. \n- Bei beiden ist die laning phase vor Stufe 6 etwas knifflig. Bei Diana hilft das Schild etwas aus. Fizz ist dafür schwerer zu ganken, solange du deine E nicht permanent für waveclear nutzt. Dafür eignet diese sich ohnehin erst später.\n- Fizz fühlt sich finde ich etwas filigraner beim Spielen an. Diana kann dafür mehr ab.\n- Für beide sind auch andere Positionen als Mid möglich. Finde zum Beispiel das momentan populäre Tank-Fizz Build sehr interessant.\n- Bei beiden gibt es 1-2 mechanisch etwas anspruchsvollere Kniffe, die du dringend brauchst, um das gesamte Potenzial zu nutzen (Flash+E mit Fizz, R+Q-Kombo ohne Ult CD zu haben mit Diana)\n\nEs ist schwer dich da zu beraten. Sind beides Assasinen. Machen beide Spaß (Ich bevorzuge Diana. Ist etwas mehr Hau-drau-All-In ^^)\nLetztendlich liegt die Entscheidung ganz bei dir. Guck dir vielleicht Montages oder 1 Game von irgendeinem Pro an und überlege, was dir eher liegen würde. Am Ende denkt man eh immer, dass es die falsche Entscheidung war. Spätestens, wenn es einmal richtig schief läuft. ;-)\nBeide Champions sind nur gute Wahl und machen auch mehr als eine Runde lang Spaß.\n\nViel Erfolg mit dem Champion, für den du dich entscheidest!\n\nPS: Hab bewusst auf den ersten Kommentar geantwortet, weil ich daran anknüpfen wollte.","replies":[{"poster":"Y4l0","date":"2015-06-22T13:15:24.124+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank, Ich glaube ich probiere mal Fizz.","replies":[]}]}]},{"poster":"haha weed lol xd","date":"2015-06-27T16:12:03.942+0000","up_votes":1,"down_votes":0,"body":"Würde zu Diana raten. Sie hat hohes Carry Potential, ist sehr tanky durch ihre W während ihr Burstdamage einer der höchsten ingame ist. \nIhre Cooldowns sind alle sehr gering, sie ist viable auf der Top, Jungle und Midlane, hat hohe Mappräsenz und kann ab lvl 6 die Lane ohne große Mühe gewinnen. Außerdem countert sie durch ihr Kit sehr viele Assassinen und gewinnt die meisten Trades mit ihnen. \n\nWürde sie sogar als stärksten der Assassinen bezeichnen, da sie nicht ( wie andere zb. Lb und Zed ) im Late stark abfällt sondern nur stärker wird. \nIhr Schild verzeiht viele Fehler und sie kann öfters 2 - 3 Gegner in Sekunden ausschalten. \n\nIhr Hauptproblem ist wohl das Mana, aber das kann durch diverse Items oder durch das neuen Jungleitems kompensiert werden.","replies":[]},{"poster":"DarkYolord","date":"2015-06-22T16:55:53.208+0000","up_votes":1,"down_votes":0,"body":"Bin auch ein sehr zufriedener Diana Main und kann sie nur empfehlen.{{champion:131}}","replies":[]}]}