{"poster":"Y4l0","date":"2015-07-25T07:47:22.423+0000","title":"Darius","subforum":"Champions & Gameplay","up_votes":3,"down_votes":0,"body":"ICh spiele sehr gerne Riven auf der Toplane und gewinne auch die meisten Matchups. Gegen Darius haben ich aber starke Probleme weil ich keine Ahnung hab wie man gegen ihn spielt. K&ouml;nnte mir jemand helfen. Vielen Dank {{champion:122}} {{item:3070}}  .","replies":[{"poster":"HoO OoH","date":"2016-07-17T14:35:37.638+0000","up_votes":1,"down_votes":0,"body":"Ich hatte eben erst eine runde inder ich mit Riven eine advantage von 3 kills hatte.\nDann ist black clever und tenacity boots passiert und ich hatte keine chance mehr. Find ich einfach nur unfair.\nHabe wohlgemerkt nicht schlecht gespielt {{item:3070}}","replies":[]},{"poster":"DaFrodo","date":"2015-08-08T20:49:33.780+0000","up_votes":1,"down_votes":0,"body":"So also gegen Darius als Riven ist es meiner Meinung eine 50-50 Chance. Es läuft meist auf den ersten Kill raus wer die Lane safe hat. Am wichtigsten ist es seine Q zu dogden und ihn nicht Farmen lassen. Ist ntürlich alles sehr risky, aber wenn man weiß wie dann ist es sehr effektiv. Man darf wenn man einmal Angefangen hat ihn unter Druck zu setzten nicht nachlassen, da Darius auch schnell wieder back in Game sein kann. Habe als Darius schon oft Games gewonnen obwohl ich ne fed Top hatte und selber nicht viele Kills hatte. Und wenn man sagt Darius ist im late sehr schwach ohne fed mus ich sagen dass stimmt nicht ganz. Ja er hat schwächen jedoch wenn das Team einigermaßen spielt ist auch ein 3/6/.. Darius immer noch Gefährlich. Das sehe ich oft wenn man meint man hat mich aus dem Game dann Farme ich etwas roame und tada Rapetrain is back. Also immer unter druck setzten und nicht nachlassen. \n\nMeine Meinung als Darius main. {{champion:122}}  >:D","replies":[]},{"poster":"SuperplexP","date":"2015-07-27T11:32:03.517+0000","up_votes":1,"down_votes":0,"body":"Zur Topic:\n\nBei Darius kommt es wirklich auf das Matchup an. Die meisten Melees müssen schauen, dass die die Qs antizipieren und wenn möglich dodgen und aus dem Earlygame ohne Tode rauskommen. \n\nAm einfachsten gewinnt man gegen einen Darius, indem man gezielt gegen ihn pickt. Dann ist er nämlich enorm anfällig. Sind das dann noch Champs, die seine Ulti über Leben kontern können sollte es einigermaßen laufen.\n\nIch spiele am liebsten:\n{{champion:31}}  dank seiner Ult, der Möglichkeit relativ safe zu farmen und einem möglichen RoA oder Armor Rush, der Chos Effektivität kaum mindert. Nur am Anfang sind die hooks tödlich. Treffen die nicht, oder setzt man ein gutes Q ist die Lane aber kein großes Problem mehr.\n{{champion:58}}  Renekton gehört zu den wenigen Champions, die schon im Early auf Darius Durck ausüben können. Und später negiert Darius Ulti \"nur\" das zusätzliche Leben von Renekton.\n{{champion:150}}  der kleine kann Darius poken, nach einem Hook weghüpfen und auch sonst nervig werden. Der große hat zusätzliches Leben und zusammen mit der Möglichkeit eines Randuins/Sunfire ist Gnar immer eine solide Wahl (übrigens auch generell ein sehr sicherer Toplaner, falls man z.B. Firstpick ist)\n{{champion:50}}  mein Geheimtipp gegen Darius. Guter Poke mit Q und E außerhalb der Range vom Hook. Deutlich gefährlicher und schwieriger zu spielen als die vorher gennanten, dafür aber grade gegen Darius (se ???) die voll auf Schaden gehen ab Level 6 und RoA echt stark.","replies":[]},{"poster":"Ao no Mínk","date":"2015-07-25T08:55:41.458+0000","up_votes":1,"down_votes":0,"body":"Darius ist einer der stärksten Lanebullies in LoL, aber das wars auch schon. Meiner Meinung nach ist der einzige richtig gute Counter gegen Darius, der eigene Jungler. Nun kann man aber von seinem Jungler nicht verlangen, dass er pausenlos Toplane ist und einem die Lane carried, dass ist nicht seine Aufgabe :) Im Grund musst du nur die Lane gegen Darius überleben, so viel farmen wie möglich und einfach den Punkt abwarten, an dem dein Champ, den Darius einfach outscaled. Denn die Zeit spielt eigentlich immer gegen Darius, in Teamfights ist er wirklich recht nutzlos, solange er nicht gerade 12/0 steht :)","replies":[{"poster":"haha weed lol xd","date":"2015-07-26T10:35:46.727+0000","up_votes":1,"down_votes":0,"body":"{{champion:126}}  Lanebully ?\n{{champion:133}}  Lanebully ? \n\nDarius ist Melee und kann gekitet werden. Was macht man aber gegen diese 2 netten Kollegen :D ? ","replies":[]}]},{"poster":"Glorfindel73","date":"2015-07-25T16:11:33.787+0000","up_votes":1,"down_votes":0,"body":"es kommt auf jeden fall darauf an wie gut du deine autohits canceln kannst.\nauf keinen fall level 1 traden, e am anfang skillen um weniger schaden bis 3 zu bekommen.\nab 3 kannst du engagen wenn er seine q benutzt aber dich nicht trifft, dann q, e+w, q und nochmal q,danach weg (mit autohits canceln)\nansonsten würde ich tp mitnehmen, sobald du dir brutalizer kaufen kannst und 6 bist backpoort und sofort zur lane zurück, bei einem all in hast du mit der gleichen taktik eigentlich eine gute chance den fight zu gewinnen (wenn beide volles leben haben), am besten noch schauen was er sich gekauft hat und dann überlegen ob du engagen sollst oder nicht. bei gutem autohit canceln und dem cc von w+3te q solltest du genug schaden machen um ihn zu töten bevor du 5 stacks von seiner passiven auf dir hast und dann muss er entweder disengagen oder seine ult ohne 5 stacks benutzen und macht so weniger schaden(wenn du direkt nach einer verfehlten q von ihm engagest)\nalternativ könntest du mit cloth armor und 5 pots anfangen um einfach mehr sustain zu haben und es sicherer zu spielen, dann könntest du auf jeden fall auf level 3 traden, hast mit den pots wieder volles leben und dann noch welche übrig. wenn der darius mit blade startet wird er danach keine pots mehr haben und nur 2/3 leben, mit langschwert + 3 pots wird er in etwa gleich viel sustain haben wie du.","replies":[]},{"poster":"Snivelyfox","date":"2015-07-25T12:02:04.848+0000","up_votes":1,"down_votes":0,"body":"versuch eventuell folgendes: \n2x q mit 1-2 autohits auf ihn, den dritten q nutzen, um von ihm wegzuspringen. nun wird er dich vermutlich ranziehen. w einsetzen, dann e um abzuhauen und die blutung zu schilden. das ist jetzt reine Theorie, ich spiele riven nicht wirklich. würde aber schätzen, dass du, wenn du das schnell ausführst, mehr schaden drückst als er.\ndann hab ich noch eine frage an dich, da ich riven schon gerne spielen würde, aber auf paar andere kaum klarkomme: was machst du gegen einen renekton oder nasus?","replies":[{"poster":"Y4l0","date":"2015-07-25T15:12:19.593+0000","up_votes":1,"down_votes":0,"body":"Farmen und kiten wie bei Nasus und Garen 0 Mobility gegen Renekton verlieren.","replies":[]}]},{"poster":"xXDyosXx","date":"2015-07-25T12:04:23.114+0000","up_votes":1,"down_votes":0,"body":"Spiele Darius selber und finde so seine Schwächen raus","replies":[]},{"poster":"EpicDieterBohlen","date":"2015-07-25T08:54:13.264+0000","up_votes":1,"down_votes":0,"body":"wenn du vor ihm level 2 wirst all in oder ab level 6 all in ansonsten auf keinen fall traden","replies":[]},{"poster":"PremiumKartoffel","date":"2015-07-25T08:01:57.619+0000","up_votes":1,"down_votes":0,"body":"Naja schlechtes Late game will ich mal nicht sagen so eine 800-1200 TrueDMG Ult tut halt schon weg aber er wird zu leicht gekitet","replies":[]},{"poster":"Busty Botter","date":"2015-07-25T07:54:35.721+0000","up_votes":1,"down_votes":0,"body":"Am Anfang keine Trades eingehen, die wirst du höchstwahrscheinlich verlieren. Versuch nur zu farmen, mit Level 6 einkaufen gehn und dann All-In. Ab Level 6 solltest du mit Ulti mehr Schaden machen als er und kannst viel Schaden mit deinem Schild abfangen. Jedesmal wenn du dann deine Ulti hast All-In.","replies":[]},{"poster":"Evenrider","date":"2015-07-25T07:53:39.478+0000","up_votes":1,"down_votes":0,"body":"Farmen und blos nicht kämpfen. Jede Minute ohne deinen Tod, ist gut für dich, denn Darius besitzt mit eines der schlechtesten Lategames im Spiel.","replies":[]}]}