{"poster":"cremnik","date":"2015-10-28T10:05:36.399+0000","title":"#ontopic - Wo viel Gefühl ist, ist auch viel Leid","subforum":"Allgemeiner Chat","up_votes":17,"down_votes":0,"body":"Das ist die elfte Ausgabe von #ontopic. Hier werden LoL Spezifische Themen besprochen und pointiert. Das Ziel ist wie immer eine interessante Debatte, also z&ouml;gert nicht zu kommentieren!\n\nLetze Ausgabe: [ Von der guten alten Zeit und den Wunden die da waren](http://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/KQalhAlt-ontopic-von-der-guten-alten-zeit-und-den-wunden-die-da-waren)\n\n------------------------------\n\n**Wo viel Gef&uuml;hl ist, ist auch viel Leid**\n\nWarum regt uns LoL so auf? Warum ragen und tilten wir. Warum sind wir voller Hass und Verachtung gegen&uuml;ber denjenigen, die unserer Meinung nach uns das Spiel kaputt machen? Ob das jetzt Afk&rsquo;ler, Trolls oder Flamer sind sei dahin gestellt.\n\nES St&ouml;rt uns, weil es uns wichtig ist. Weil wir LoL als mehr, als nur ein einfaches Computerspiel ansehen. Es ist ein R&uuml;ckzugsort, an dem wir f&uuml;r ein paar Spiele mal die Probleme des Alltags vergessen k&ouml;nnen. Und jeder, der in diesen R&uuml;ckzugsort eindringt un ihn in irgendeiner Weise beschmutzt, der begeht damit eine ungeheure Anma&szlig;ung.  Er geh&ouml;rt bestraft. Wir regen uns &uuml;ber ihn auf,  au&szlig;erhalb des Spiels, innerhalb des Spiels, ja manche gehen sogar soweit, dass sie gleiches mit gleichem vergelten wollen. Auge um Auge, Zahn um Zahn und ihrerseits sich zur Aufgabe machen das Spielerlebnis des anderen f&uuml;r seine vermeintlich getanes Unrecht zu zerst&ouml;ren. \n\nDas einzige was aus dieser Denk- und Handlungsweise folgen kann ist noch mehr Eskalation. Jeder, der Flamet, absichtlich AFK geht, feedet und/oder trollt mit dem Ziel die Spielerfahrung des Anderen zunichte zu machen treibt diese Spirale weiter voran. Dabei ist es schwer dem zu entkommen, weil LoL uns einfach so wichtig ist, weil wir Angst haben, dass es mal nicht so l&auml;uft, wie wir gerne h&auml;tten, dass wir absteigen, uns total blamieren und einfach mal nicht so gut spielen, wie wir von uns glauben. Yoda hat das einmal sehr sch&ouml;n zusammengefasst: \n\n> &bdquo;Furcht f&uuml;hrt zu Wut, Wut f&uuml;hrt zu Hass. Hass f&uuml;hrt zu uns&auml;glichem Leid.&ldquo;\n\nWir sollten uns nicht vormachen, dass wir eine Berechtigung h&auml;tten das, was uns so st&ouml;rt irgendjemand anderem anzutun. Es gibt so etwas wie Notwehr in LoL nicht. Nur weil uns jemand anders nicht passt. Das ist die wahre Anma&szlig;ung. Ja es gibt Leute, die einem das Spiel kaputt machen wollen, die nicht mit sich reden lassen wollen. Aber warum die Taktik der verbrannten Erde fahren? In den Stufen der Eskalation eines Konflikts, kommt man irgendwann unweigerlich zu einem Point-of-no-return. Ab diesem Punkt hei&szlig;t es: &bdquo;Gemeinsam in den Abgrund.&ldquo; Wenn ich keinen Spa&szlig; haben darf, dann soll ihn keiner haben. \n\nDas ist einfach die falsche Einstellung. Es fehlt an Distanz zum Spiel und der Welt im Spiel. Es ist und bleibt ein Spiel, ganz egal, f&uuml;r wie gut oder wichtig wir es erachten. Anstatt, dass wir uns in einem virtuellen Raum &uuml;ber Personen, denen wir nie wissentlich begegnen werden aufzuregen, sollten wir uns lieber darin &uuml;ben die andere Wange hinzuhalten. Es bringt nichts, aber auch gar nichts, wenn man flamet, Trollt, AFK geht oder raget. Den gleichen Effekt hat es, wenn man in ein Kissen schreit. Auch wenn der Andere es deiner Meinung nach verdient hat. Es ist nicht an dir, dem einzelnen, das zu beurteilen.\n\nDie nächste Ausgabe: [#Ontopic - Von der Erinnerung und was sie uns verschweigt](http://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/PpwLmsE4-ontopic-von-der-erinnerung-und-was-sie-uns-verschweigt)","replies":[{"poster":"CaJ Scar","date":"2015-10-28T12:43:14.732+0000","up_votes":6,"down_votes":0,"body":"Respekt für diesen Thread, da es gegen Seasonende läuft, haben sich diese Probleme weitgehend verstärkt, was ich als Clanleader auch in meinen eigenen Reihen merke. Leider gibt es in der Community zu wenige, die es aussprechen wollen, bzw. die richtige Wortwahl finden, um über ein so wichtiges Thema sprechen zu können. \n\nMfG \nCaJ Scar {{champion:119}}","replies":[{"poster":"cremnik","date":"2015-10-28T13:45:51.919+0000","up_votes":6,"down_votes":1,"body":"Mich würde interessieren, wie dus schaffst als Clanleader einen humanen Umgang für alle zu gewährleisten. Also welche Konsequenzen ziehst du wann, wo und wie?","replies":[{"poster":"CaJ Scar","date":"2015-11-02T19:42:41.173+0000","up_votes":2,"down_votes":1,"body":"Ich habe persönlich gemerkt, dass alle unter dem Druck noch schnell gegen Seasonende eine oder mehrere Divisionen aufzusteigen, leichter ins Tilten geraten. Da die Mitglieder unseres eher kleinen Clans (15 Member atm) meist gute Freunde oder andere nette Menschen sind, die ich zum Teil auch hier in den Foren kennegelernt habe, liegt das Problem glücklicherweise nicht bei Sachen wie Beleidigungen und Flame.\n\nWas ich jedoch, speziell auf die Leute in höheren Elo-Bereichen bezogen, bemerkte, war des öfteren schlechte Stimmung, was zum einen die Harmonie unseres Trupps runterdrückte, zum anderen aber auch die Performance in unseren Teamrankeds. \n\nIn Sachen Konsequenzen bin ich relativ strikt. Wer andere direkt beleidigt hat eigentlich nicht viel bei uns zu suchen, aber da dies nicht wirklich der Fall ist, versuche ich die Leute, die negative Erfahrungen in der SoloQ gemacht haben, aufzumuntern, indem ich auf sie zukomme, wenn ich den Eindruck habe, dass bei ihnen irgend etwas nicht stimmt. \n\nIch folge generell gerne dem Prinzip, Flamer einfach ohne weiteres zu muten, das es die Konzentration sowie die Einstellung im Spiel drastisch verbessert. Auch wenn es relativ simpel klingen mag, finde ich, dass man Leute, die einem das Spiel ruinieren (ob absichtlich oder unabsichtlich) am besten ignorieren sollte. \n\nAuch wenn es etwas primitiv klingen mag, verweise ich gerne auf die Goldene Regel:\n„Behandle andere so, wie du von ihnen behandelt werden willst.“\n\nIch hoffe ich konnte dir deine Fragen beantworten, und noch einmal meinen vollsten Respekt an dich, dass du das Thema hier ansprichst und zudem noch auf Andere eingehst.\n\nCaJ Scar {{champion:119}}","replies":[{"poster":"cremnik","date":"2015-11-02T22:00:22.941+0000","up_votes":2,"down_votes":0,"body":"Klingt ja so, als hättest du deinen Clan gut im Griff :D Wenn das alles so klappt wie dus willst: Hut ab{{item:3089}}","replies":[]}]},{"poster":"Knife Life Chara","date":"2015-10-28T15:11:02.251+0000","up_votes":1,"down_votes":0,"body":"ok , und welcher Bot hat dich gerade Disliked xP ?","replies":[]}]},{"poster":"Zulwar","date":"2015-10-29T14:56:22.372+0000","up_votes":1,"down_votes":0,"body":"Ich schlage dann mal vor das du deinen Leuten mal erklären solltest wie spiele gewonnen werden, wenn diese Probleme so akut bei euch sind. Denn wenn man anhand von guten Beispielen den Leuten das nochmal ins Gedächtnis ruft, könnte das ware Wunder wirken. Denke ich mal so.","replies":[]}]},{"poster":"Eibert Rümmel","date":"2015-10-28T14:27:37.123+0000","up_votes":5,"down_votes":0,"body":"genauso kann man auch seinen Beitrag zu einer Spirale nach oben beitragen. Wenn das Spielerlebnis meiner Teammitglieder steigt, steigt meins gleich mit. Wer hilfsbereit ist, bekommt auch mehr Hilfe; wer freundlich ist, erhält meißt auch freundliche Antworten. Wer anderen Fehler zugesteht, dem werden eigene Fehler eher verziehen.....\n\nKlar kann man für ein \"GJ\" auch mal ein \"get %%%%%%\" ernten, doch das ist eher die Seltenheit. Doch wer nicht in ein gutes Spielklima investiert, darf sich auch nicht über die angeblich so schlimme Community beschweren.","replies":[]},{"poster":"Lykos","date":"2015-11-07T21:14:16.033+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"cremnik","date":"2015-11-07T23:30:57.467+0000","up_votes":2,"down_votes":1,"body":"Damit unterstellst du 70 Millionen Spielern eine Computerspielsucht. Das finde ich recht weit hergeholt. Deine Beschreibung der psychodynamischen Prozesse bei einer Niederlage steht auch auf sehr sehr wackligen Beinen, denn nicht jeder Spieler regt sich bei Niederlagen auf. Bzw. gibt es auch Spieler, die sich aufregen, wenn sie klar am gewinnen sind. Alles auf den unbewussten Prpzess zu schieben, dass man eine Art \"Selbsthass\" entwickelt hat, weil man zu viel LoL spielt funktioniert einfach nicht, zu mal diese Art der Gedanken bei der Allgemeinheit bei weitem nicht die Qualität hat, dass sie ins Unbewusstsein verschoben werden müssten.","replies":[{"poster":"Lykos","date":"2015-11-13T23:10:08.098+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"cremnik","date":"2015-11-14T00:02:26.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lykos,realm=EUW,application-id=YnZkMR0R,discussion-id=rRGyeHu3,comment-id=000800000000,timestamp=2015-11-13T23:10:08.098+0000)\n>\n> Ich sagte nicht, dass es auf jeden Spieler zutrifft, aber auf relativ viele. Außerdem muss man nicht nur denken man hat seine Zeit verschwendet wenn man süchtig ist, sondern auch wenn man halt mal ein Spiel verliert weil andere so drauf sind und man bei 1-2 games pro tag keine lust hat diese zu verliern. Trifft aber auch nicht immer zu :P\n\nUnd das stützt du auf deine subjektiven Beobachtungen oder auf gesicherte anderen empirischen Datenß Die würde ich nämlich gerne mal sehen :P","replies":[]}]}]}]},{"poster":"Knife Life Chara","date":"2015-10-28T12:53:34.145+0000","up_votes":3,"down_votes":0,"body":"ja , aber TEEMO :( ! {{champion:17}}  , der Bringt selbst jemanden der 5 Tonnen Mariuana gerauchth at zum Ragen","replies":[{"poster":"ÆonFox","date":"2015-10-31T11:17:15.253+0000","up_votes":1,"down_votes":0,"body":"Bring ihn einfach um, so schwehr ist es nicht nen Teemo zu killen...","replies":[{"poster":"Knife Life Chara","date":"2015-11-04T12:41:00.561+0000","up_votes":1,"down_votes":0,"body":"doch ... wen er Serios spielt dann ... ich sags mal so , ich bin im Krankenhaus Gelandet weil ich mir aus lauter Teemo wut den Finger abgebissen habe ... dieser champ sollte echt Deleted werden und nicht gebufft","replies":[]}]}]},{"poster":"PapaJLBaer","date":"2016-02-24T22:18:07.618+0000","up_votes":1,"down_votes":4,"body":"Für mich sein in den Thread nur Wiederspruche.\n\nDas ist einfach die falsche Einstellung. Es fehlt an Distanz zum Spiel und der Welt im Spiel. Es ist und bleibt ein Spiel, ganz egal, für wie gut oder wichtig wir es erachten.\n\nDen Punkt finde ich am besten, weil er stimmt. \n\nJa ist nur ein Spiel. Also \" unwichtig \" fürs weitere Leben.  \nAber Trotzdem gibt es jene Leute die dafür ihre Menschlichkeit weg werfen.\nJene die Absichtlich bewusst betrügen. \nJene die sich Vorteile verschaffen.\nJene die die Spirale des Hasses Anfangen.\n\nMich macht machen solche Leute wütend und schon ist das Renen eröffnet.\n\n\nMit den andren Punkten bin ich nicht einverstanden.\n\nDas schöne an Hass ist es verursacht Chaos und Chaos ist Fair.\nRest wenn es genug Hass gibt kann es frieden geben.\n\nWenn keine etwas gegen diese \" Cheater, Betrüger macht wird es Sie immer geben.\nJeder, der Flamet, absichtlich AFK geht, feedet und/oder trollt. \nIch denke keine hat sich dafür das Spiel installiert um das zu tun. Somit steht doch fest der Hass ist erst\nDurch LOL zustande gekommen. Weil 1 vor Jahren sich unmoralisch verhalten hat.\n\nDas finde ich so Lustig am System, es bestraft nur Täter und Opfer aber nicht die wahren Verursachen.\nSchlimme ist es, dass es heute mehr Verursacher  gibt den je.  Ich reden nicht von jemand der Flamet, absichtlich AFK geht, feedet und/oder trollt , den das sind die Opfer.\n\n\nIch kämpf für ein faires Spiel oder besser für einen fairen E-Sport selbst wenn das bedeute das der E-Sport dafür verboten werden muss soll es mir recht sein.\n\nEs gibt 2 Formen von Perfektion. Singularität und Nichts.","replies":[{"poster":"Sirrkas","date":"2016-02-25T00:07:00.779+0000","up_votes":2,"down_votes":0,"body":"Wer sind denn die Verursacher?","replies":[{"poster":"PapaJLBaer","date":"2016-02-29T22:55:42.598+0000","up_votes":1,"down_votes":3,"body":"Jene die mit Vorsatz sich vor den Game eine Vorteil verschaffen.\n\nÜberbegriff ist glaub Häcker oder Cheater.\nWobei es ja reichlich Arten um Formen davon gibt\n\nJetzt sag nicht das Cheaten verboten ist.\nManche Cheat sind verboten andere nicht, auch wen sie beide das gleiche bewirken.\n\nIn China sind Blaue Autos erlaubt Rote nicht.","replies":[{"poster":"Sirrkas","date":"2016-02-29T23:08:17.305+0000","up_votes":2,"down_votes":0,"body":"Welche Cheats sind denn bitte nicht verboten und warum sollte es erlaubt sein, andere zu beleidigen, weil man glaubt, der Gegner cheatet? \n\nWenn ich etwas über die Community weiß, dann, dass sie wie für Menschen üblich, die Schuld bei anderen sucht. Ich wurde zum Beispiel schonmal als Cheater bezeichnet, weil ich Duo Top gespielt habe und es angeblich nicht erlaubt ist.","replies":[{"poster":"PapaJLBaer","date":"2016-03-01T10:26:22.523+0000","up_votes":1,"down_votes":4,"body":"Duo Top , Cheat ? \nJa wenn ihr Premads wart, würde ich euch auch genau des wegen als Cheater Reporten.\n\nCheats sind alle unfairen Vorteil die man sich vor den Game erarbeitet, auf die nicht jeder zugriff hat.\n\nPremads, nicht jeder ist Premad  => Cheater. / Vorteil Teamcombo , Skype TS und Co\nSmurf. => Cheater. Elo Manipulation. / Vorteil zu schwache Gegener.\n\n2 Arten von Cheat ( Vorteilen ) die nicht verboten sind.","replies":[{"poster":"SorisDynasty","date":"2016-03-02T16:02:40.989+0000","up_votes":3,"down_votes":0,"body":"Aha. Premade zu sein ist also mittlerweile schon cheaten. Anhand der Mittel, die einem das Spiel gegeben hat und ganz eindeutig zu fördern versucht.\n\nRunen+Runenseiten sind also deiner Logik nach auch Cheats, weil ich mir damit einen Vorteil erarbeitet habe, den andere nicht nutzen können. Alle Champs zu haben ebenfalls. Ich kann ja flexibel sein und countern, während mein Gegenüber mit seinem kleinen Championpool zurecht kommen muss.\n\nLangsam wird das schon lächerlich.","replies":[{"poster":"PapaJLBaer","date":"2016-03-02T21:44:42.552+0000","up_votes":1,"down_votes":4,"body":"Haha.\n\nBei Runen und Champs habe ich die Wahl und kann auch alle bekommen.\nEinen Gewissen Pool hat da jeder.\n\nBei Premads ist das nicht so.\n\nWenn müsste du keinen Runen und keine Champs mit jemanden vergleich der über beides verfügt.\nZudem nutzen Premads wahrscheinlich auch noch Programme Dritter. z.B. zur Beschleunigung und Vereinfachung von Kommunikation wie Skype oder Ts. Was auch nicht jeder nutzt.","replies":[{"poster":"SorisDynasty","date":"2016-03-02T22:19:05.212+0000","up_votes":2,"down_votes":0,"body":"Dann such dir Premades, mit denen du jene Programme nutzen kannst. Problem gelöst. :)","replies":[{"poster":"PapaJLBaer","date":"2016-03-02T22:34:14.720+0000","up_votes":1,"down_votes":3,"body":"Bin doch kein Cheater, es geht doch nicht nur um mich.","replies":[{"poster":"SorisDynasty","date":"2016-03-02T22:48:31.639+0000","up_votes":2,"down_votes":0,"body":"Also... Runen, Champs etc kann man sich ja alles besorgen. Kein Cheat.\nPremades, die man sich ebenfalls besorgen kann, bspw über Forensuche... Cheater.\n\nOkay.\n\nIch sag es dir mal, wie es ist: Premades sowie Voice-Kommunikation sind kein Cheaten. Egal, wie sehr du das auch glauben magst. Denn ansonsten müsste das ja ein Auto-Win sein. Ich habe aber bereits mit random Leuten Premade-Teams geschlagen. Andersherum genauso. Kann also nicht so krass sein wie du es glaubst.","replies":[{"poster":"PapaJLBaer","date":"2016-03-03T01:12:17.314+0000","up_votes":1,"down_votes":2,"body":"Wenn der {{champion:41}}  auf der Top Lane den Kampf für seine Premads {{champion:432}}  & {{champion:81}}  auf der Bot Lane eröffnet.\n\nOder Eine Team aus {{champion:56}} ,{{champion:98}} ,{{champion:4}} ,{{champion:223}}  & {{champion:429}}  und Alle bin 2s Piks auf der Janzen Karte machen können?\n\nDas ist dann schon ein Unfaire Vorteil.\nSo was geht nur mit hilfe Voice-Kommunikation.","replies":[{"poster":"SorisDynasty","date":"2016-03-03T09:26:48.258+0000","up_votes":1,"down_votes":0,"body":"Nö. Erstes Beispiel geht auch via Chat.\nDas zweite theoretisch auch, wenn man die Augen aufmacht. TF roamed runter, ulted, Nocturne war auch in der Nähe, ulted. Kalista schmeißt Tahm rein, Shen ulted den Tahm.\n\nDafür braucht man kein Voice. Das geht auch mit Spielverständnis.\n\nOder ist Spielverständnis auch schon cheaten?\n\nAber schön, wie du der Tatsache aus dem Weg gehst, das man sich auch selber Premades suchen kann, um das auszugleichen. ","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"ACZR","date":"2015-10-28T20:32:11.837+0000","up_votes":2,"down_votes":0,"body":"Was ich einfach nicht verstehe, warum es Spieler gibt welche ein Ranked spielen wollen aber gleich nach dem Start AFK sind. Diese Spieler vermiesen wirklich jedes Spiel. So kann und will man gar nicht mehr teil von League of Legends sein. \nIch versuche in solchen Games immer noch mein Bestes zugeben aber es macht einfach keinen Spass mehr.\n\nfreundliche Grüsse aus der Schweiz\nACZR","replies":[{"poster":"cremnik","date":"2015-10-29T08:19:45.001+0000","up_votes":1,"down_votes":0,"body":"Meinst du Leute, die nach dem Start einfach in der Basis stehen, oder die die kurz spielen und aus Frust rausgehen? Erstere haben vermutlich nämlich einfach nur einen DC und meinen es sicher nicht böse...","replies":[{"poster":"ACZR","date":"2015-10-29T19:21:20.067+0000","up_votes":2,"down_votes":0,"body":"Diese Spieler die aus Frust rausgehen oder einfach nur trollen (z.B. unbedingt auf einer Lane spielen wollen und einfach nur feeden oder erst gar nicht auf die Lane gehen). \nNatürlich gibt es auch Spieler welchen einen DC haben doch diese können nichts dafür.","replies":[{"poster":"Kunkel","date":"2015-11-02T08:51:18.888+0000","up_votes":1,"down_votes":0,"body":"Da bin ich anderer Meinung.\n\nLeute die einen DC haben sind genauso dafür verantwortlich, wie diejenigen die einfach so raus gehen. Ja sie machen es nicht aus Böswilligkeit, aber als Spieler (vor allem in einem Ranked) ist es mir recht egal warum jemand nicht da ist, für mich zählt nur das er/sie nicht da ist. Deshalb ist es auch richtig das Leute die häufiger DCs haben ebenfalls gesperrt werden, sie könnten sich ja vorher um ihre Internet Probleme kümmern.","replies":[{"poster":"Fawgs","date":"2015-11-06T19:07:21.853+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Kunkel","date":"2015-11-06T20:03:11.183+0000","up_votes":2,"down_votes":0,"body":"Die von dir beschrieben Situation ist auch völlig unproblematisch, denn wenn das nur einmal passiert und du nur in diesem einen Spiel deshalb reportet wirst macht das gar nichts. Es geht jedoch darum das es durchaus Leute gibt die häufig Internetprobleme haben und diese Menschen ruinieren das Spiel für andere genauso sehr wie jemand der absichtlich leaved. In beiden Fällen sollte man reporten, wenn es ein Einzelfall bleibt hat man keine Schlimmen Konsequenzen zu fürchten, passiert es jedoch häufiger dann sollte derjenige gebannt werden genau wie jeder andere leaver auch, für mich als Spieler spielt es schließlich keine Rolle warum jemand jetzt nicht da ist, ich merke lediglich das er nicht da ist. Deshalb leaver immer Reporten, bestraft werden dadurch nur die, die es wirklich verdienen.","replies":[{"poster":"Fawgs","date":"2015-11-07T16:21:23.922+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"proudVegan","date":"2015-11-08T13:47:38.586+0000","up_votes":2,"down_votes":0,"body":"Omg endlich hat mal jemand das gleich PB wie ich :D\n\n#Shurimafan","replies":[{"poster":"Fawgs","date":"2015-12-09T14:25:31.812+0000","up_votes":1,"down_votes":0,"body":"Ich liebe es. *_*","replies":[{"poster":"proudVegan","date":"2016-01-28T08:05:25.437+0000","up_votes":1,"down_votes":0,"body":"Besonders als Azir main >.<","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Kunkel","date":"2015-11-02T08:44:38.264+0000","up_votes":2,"down_votes":0,"body":"Sehr schön ausgedrückt. \n\nNach fast 5Jahren lol, und ich spiele sonst eigentlich nichts, muss ich sagen das ich mich sehr an das ganze gewöhnt habe. Die \"ich ignoriere sowas\" Einstellung muss man sich erst beibringen und manche lernen es halt nie, bei mir hat es auch fast 3 Jahre gedauert. Inzwischen komme ich damit sehr gut zurecht, ich schreibe zwar auch selber noch immer viel Mist in den Chat, achte jedoch sehr darauf das es nichts ist das jemand falsch verstehen könnte. Andersherum bringen ein paar lockere Sprüche oder Witze am Anfang das Team häufig schnell enger zusammen und die Leute verzeihen einem eher einen Fehler wenn sie sich davor ein bisschen \"unterhalten\" haben.","replies":[{"poster":"malleusmintaka","date":"2015-11-02T09:04:20.887+0000","up_votes":1,"down_votes":0,"body":"Darf ich fragen, was du mit viel Mist meinst? Also, in welche Richtung das geht?","replies":[{"poster":"Kunkel","date":"2015-11-02T11:02:03.241+0000","up_votes":1,"down_votes":0,"body":"Situations bedingt mache ich vielleicht Witze über irgend einen Champion, oder wenn ich oder einer meiner Premades einen Fehler macht mache ich mich darüber lustig (wichtig das man das nicht bei anderen macht). Oder was auch immer mir grade in den Kopf kommt, aber du merkst ja in welche Richtung es geht.","replies":[{"poster":"malleusmintaka","date":"2015-11-02T11:38:52.319+0000","up_votes":1,"down_votes":0,"body":"Ah, ja, ich habe nur gefragt weil ich das ganze auch anders kenne, dass jemand nach jeder Aktion irgendein (unpassenden) Emoticons spammt.","replies":[]}]}]}]},{"poster":"malleusmintaka","date":"2015-10-31T21:22:47.594+0000","up_votes":1,"down_votes":2,"body":">Jeder, der Flamet, absichtlich AFK geht, feedet und/oder trollt mit dem Ziel die Spielerfahrung des Anderen zunichte zu machen treibt diese Spirale weiter >voran.\n\nIch flame, um mein Team zu motivieren... \nAndererseits ist trollen OHNE dem Ziel, jemandes Spielerfahrung zunichtezumachen sehr schwer.\n\nUnd noch eine kleine Randbemerkung: Das Wort \"virtuell\" wird viel zu oft falsch verwendet. Laut Duden heißt \"virtuell\"  entweder \"nicht echt\" oder  \"entsprechend seiner Anlage als Möglichkeit vorhanden\". \nDu sagst: > ...einem virtuellen Raum...<  League of Legends ist aber NICHT virtuell. Man kann Geld investieren, man hat es vor sich, man installiert es, es exisitiert real. Auf diesem Irrtum basiert eigentlich sämtliche Negativität in Onlinespielen, da, wenn etwas \"nicht echt\" ist, das, was darin gemacht wird, folglicherweise auf nicht echt ist. Kannst du mir folgen? {{summoner:2}}","replies":[{"poster":"cremnik","date":"2015-11-01T18:46:05.541+0000","up_votes":2,"down_votes":0,"body":"Ich kann dir bis zu dem Punkt folgen, an dem du gesagt hast, dass du flamest um dein Team zu motivieren. Ich bezweifel, dass diese Art der Intervention irgendeinen Nutzen hat. \n\nZum Thema Virtualität kann man jetzt sich unnötig streiten. Du hast natürlich mit deiner Aussage 100% recht, doch ist virtuell im allgemeinen Sprachgebrauch einfach anders konnotiert. Bzw. könnte man jetzt auch eine Diskussion über Existenz allgemein vom Zaun brechen, aber bitte nicht so spät am Abend ;)","replies":[{"poster":"malleusmintaka","date":"2015-11-02T08:53:41.199+0000","up_votes":1,"down_votes":0,"body":"Das mit flamen war nicht ernst gemeint, man siehe dazu auch die drei Punkte dahinter...  \n\nJa, ich diskutiere gerne über Existenz, in diesem Fall war gemeint, dass, nur weil etwas auf einem Computer geschieht, es nicht sofort virtuell sein muss, Es ist genauso real wie jedes andere Spiel, und genauso wie in jedem anderen Spiel ist es (logischerweise) nicht immer leicht, Distanz zu wahren, wenn man selbst teilnimmt.","replies":[{"poster":"cremnik","date":"2015-11-02T10:31:23.230+0000","up_votes":1,"down_votes":0,"body":"Da stimme ich dir zu ;)","replies":[]}]}]}]},{"poster":"SOD Akuma","date":"2015-11-05T17:28:34.182+0000","up_votes":1,"down_votes":0,"body":"#True - SOD Akuma (perma banned ) (4jahre lol gezockt ^^)","replies":[]}]}