{"poster":"Koma910","date":"2017-09-10T21:06:07.462+0000","title":"Ryze Veränderung/Buff","subforum":"Champions & Gameplay","up_votes":5,"down_votes":1,"body":"Sehr geehrtes Riot-Team,\n\nVor einer kurzen Zeit überlegte ich mir, trotz Abraten meiner Freunde,\nRyze zu mainen. Ich wollte ihnen beweisen, dass wenn man viel Zeit in einen\nChampion hineinsteckt jeden meistern kann. Trotz vieler Spiele ist jedoch meine Winrate mit Ryze eher nicht zufriedenstellend. Gleiches gilt auch f&uuml;r all die anderen Ryze Mains, die trotz viel Training mit Ryze eine schlechte Winrate haben(auch laut Champion.GG). Zuallererst ist der nicht verst&auml;rkte Stun auf seiner W viel zu kurz. Weiterhin ist die Range der Ult viel zu kurz auf lv. 1. Sein Schaden kann man zwar nicht viel h&ouml;her anheben, da er sonst schnell OP wird, allerdings ist er gerade sehr schwach und braucht um stark zu sein und am Spiel &uuml;berhauot teilnehmen zu k&ouml;nnen sehr viele Items. An diese zu kommen ist aufgrund seines schwachen Early sehr schwer. Mit Spell Flux(E) kann man im Early zwar gut poken, pusht somit allerdings ebenfalls stark rein, da sich der Spell Flux auf die umliegenden Minions verteilt. Somit ist man ein gefundenes Fressen f&uuml;r den gegnerischen Jungler. Ich w&uuml;rde mich sehr &uuml;ber eine R&uuml;ckmeldung freuen. \n\nMit freundlichen Gr&uuml;&szlig;en\n\nEin freundlicher Beschw&ouml;rer.","replies":[{"poster":"Just4funXX","date":"2017-09-10T21:53:07.508+0000","up_votes":6,"down_votes":0,"body":"Zum Champ an sich: \n\nRyze ist definitiv kein Champion den man schnell perfekt beherrscht. Er hat halt seine ganz eigene Spielweise, die sich schlecht vergleichen lässt und ist merkwürdig \"unintuitiv\". \nAuch die Folgen der Ulti sind manchmal schwer absehbar xD\n\nAußerdem sollte man sich vorher genau anschauen gegen und mit wem man spielt, um nicht sofort gecounterpickt zu werden.\n\nTheoretisch ist er ja Mid und Toplane tauglich (eigentlich auch als Sup und zeitweise sogar als Jungler), von daher kannst du ja auch mal verschiedene Positionen ausprobieren.\n\n\nBalancing:\n\nUm nochmal kurz daran zu erinnern, wie Ryze vor dem letzten großen Rework war und warum er dringend überarbeitet werden musste, weil er permaban war:\nhttps://www.youtube.com/watch?v=NfaZIQcmMqM\nhttps://www.youtube.com/watch?v=0ckIwozedAY\n\nDerzeit fühlt er sich je nach Situation recht schwach an, du solltest aber nicht vergessen, dass Ryze durch die kluge Interaktion mit Minions zu absurdem Schaden in der Lage ist.\nDazu ist natürlich etwas Vorbereitung und die richtige Positionierung nötig, ist bei Champs wie Kata aber genauso.\n\n\nFazit:\n\nRyze sollte nicht immer, sondern nur unter den richtigen Bedingungen gepickt werden. Wenn dann noch das Teamplay und Positioning klappt ist er in meinen Augen so gut gebalanced.","replies":[{"poster":"Taku2011121","date":"2017-09-10T21:58:01.381+0000","up_votes":3,"down_votes":0,"body":"Ryze Sup ... die \"guten alten Zeiten\" mit dem Ryze/Rengar Oneshot. \n\nWeniges tilted einen Adc so schnell wie Pount-and-click CC, die man bei Champs wie Taric ja umbedingt ändern wollte.","replies":[{"poster":"League Error 404","date":"2017-09-10T22:02:31.593+0000","up_votes":3,"down_votes":0,"body":"Ich warte auch sehnsüchtig auf die nächste Meta :)\n\nGegen überfeedete Adcs mit gefühlt 3 Supportern die alle Schilde verteilen, kommst du auch mit Ryze nicht mehr an.","replies":[{"poster":"mondmann97","date":"2017-09-10T23:16:20.899+0000","up_votes":3,"down_votes":0,"body":"Immerhin ist es dann aber eine Teamkombo und nicht ein Champion der alles Solo zerstört^^","replies":[]}]}]},{"poster":"Koma910","date":"2017-09-12T07:43:32.887+0000","up_votes":1,"down_votes":0,"body":"Also findest du nicht dass man ryze one-tricken kann oder?","replies":[]}]},{"poster":"Bobby Bonkers","date":"2017-09-11T07:27:48.392+0000","up_votes":2,"down_votes":0,"body":"Ryze hat das gleiche Problem wie Azir,Kalista und jetzt auch Caitlyn.\nAlle sind Champions die auf sehr Hohem Niveau unglaublich stark sind, und deshalb genervt werden.\nLeider waren solche Champions im Casualplay nicht überdurchschnittlich stark (meistens). Das führt dazu das diese Champs so langer genervt werden bis diese im Proplay gebalanced sind, leider werden sie dadurch in allen anderen Ligen beinahe unplayable. \nDer jüngste Fall von diesem Problem war Caitlyn: Im Proplay highly contested und super strong und im Casual relativ balanced da die Meisten ihr Potential nicht richtig aufspielen konnten. Jetzt wurde sie über viele Patches immer wieder genervt sodass sie jetzt auf ~42% Winrate dahinvegitiert.\nAlles in allem ziemlich traurig, jedoch nicht vermeidbar im aktuellen System. Lösung hierfür wäre zum Beispiel das Proplay auf einem eigenen Patchcycle spielen zu lassen, wobei das wahrscheinlich mehr Probleme bringen als lösen würde.\n\nMfg Egeborg","replies":[{"poster":"Pure Cynicism","date":"2017-09-11T08:05:57.607+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Egeborg,realm=EUW,application-id=Wj1wcocU,discussion-id=0PwHRWjN,comment-id=0004,timestamp=2017-09-11T07:27:48.392+0000)\n>\n> Alles in allem ziemlich traurig, jedoch nicht vermeidbar im aktuellen System. Lösung hierfür wäre zum Beispiel das Proplay auf einem eigenen Patchcycle spielen zu lassen, wobei das wahrscheinlich mehr Probleme bringen als lösen würde.\n> \n\nIch stimme dir im Großen und Ganzen zu. Es gibt eine Reihe von Champs, die nur im Pro-Bereich ihre volle Wirkung entfalten, für 99,999% der übrigen Spieler aber dann unbalanced sind. Ryze gehört dazu.\n\nEhrlich gesagt finde ich Riots Anspruch, alles auf den Pro-Bereich anzupassen, bescheuert. Praktisch kein Spieler profitiert spielbezogen vom E-Sport, im Gegenteil. Manche Champs sind monatelang unspielbar, weil Riot die paar tausend Profis für wichtiger erachtet als die übrigen 100 Millionen (monatlichen) Spieler. \nVor allem sollte man sich mal überlegen, dass nur verhältnismäßig wenige überhaupt Rangliste spielen. Die große Masse besteht wie überall aus Feierabend- und Casualspielern, die pro Monat fünf Spiele machen. Während vielleicht ein geübter Gold-Spieler mit Ryze so einigermaßen klarkommt, kann der genannte Casualspieler mit diesem Champ nichts anfangen. Und da geht es nicht darum, dass der Champ von den Werten zu schwach wäre. Sein ganzes Kit ist für die Mehrheit der Spieler absoluter Müll. \n\nIch verstehe echt nicht, warum man für alle anderen Spieler das Spiel unausgeglichen machen muss, damit es für eine Handvoll Profis ausgeglichen ist. Aber das ist es ja noch nicht mal, man sieht doch immer nur diesselben Picks...\n\nSo viel Spaß mir LoL seit Jahren macht, so unterirdisch ist das Balancing. Man möchte fast munkeln, dass Ghostcrawler, nachdem er das PvP in WoW ruiniert hat, sich LoL vorknöpfen möchte.\n\nMeine persönliche Meinung: Stampft diesen langweiligen E-Sport endlich ein. Außer bei den Worlds Finals schaut da eh keiner zu. 100 Millionen Spieler und wieviele schauen die LCS? Ein paar Tausend. Das ist den ganzen Aufwand vorne bis hinten nicht wert. ","replies":[]},{"poster":"Nordwolf87","date":"2017-09-11T08:32:17.449+0000","up_votes":1,"down_votes":0,"body":"Stimme dir zu wobei azir nicht schwach ist finde ich.\n\nKleiner tipp: die abschwächung ist ein nerF kein nerV sprich ryze wurde generFt nicht generVt ;)","replies":[]}]},{"poster":"Nordwolf87","date":"2017-09-11T06:08:25.799+0000","up_votes":2,"down_votes":0,"body":"Finde ryze von den fähigkeiten her sehr cool gemacht aber halt schwer zu spielen, da die hauptschadensquelle ein skillshot ist. Nur die ulti finde ich nicht so gelungen. Sie bringt in der soloq nicht wirklich viel und hat nicht die range von tham kench's ulti.\nDa hat mir die alte ulti besser gefallen.\n\nWürde mich auch freuen wenn er in der nächsten meta wieder drin ist.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-09-11T00:04:19.111+0000","up_votes":2,"down_votes":0,"body":"Also so extrem das klingen mag... Ryze braucht genau genommen eine neue Ulti, damit er SoloQue tauglich wird...\n\nDas Problem an Ryze ist halt: Sobald die vorgeschlagenen Buffs durchkommen, ist er im koordinierten 5vs5 der Profiszene wieder viel zu stark... Denn dort kann man seine Ulti effektiv einsetzen...\nIn der SoloQ dagegen... nutzt man sie am Ende häufig nur um zurück zur Lane zu kommen...  Und eine Ulti, die man kaum nutzen kann, ist halt... suboptimal...\nDieses Problem lässt sich meiner Meinung nach auch nicht durch das Anpassen einzelner Werte lösen... also ja, man könnte ihn wieder \"Must Ban\" in der LCS machen und dann hätte er in der Solo Que eine Winrate von 46%... Aber das kann ja nicht das Ziel der Balance sein...","replies":[]},{"poster":"Oriius","date":"2017-09-10T23:49:29.114+0000","up_votes":2,"down_votes":0,"body":"ich finde ryze ehrlich gesagt absolut balanced. sein schaden ist sehr gut wenn man ihn gut spielt und mit nem ordentlichen team kannst du richtig ordentlich was aus dem champ rausholen. finde allerdings das die ult oft zu negativen ereignissen führt und für teamfights ist das meist ein ace fürs gegnerteam wenn man die ult benutzt.\n\nich denke aber das ryze jetzt zum worldspatch nochmal angeschaut wird einfach weil ryze einer der champs ist die eher challengerbereich geplayed werden\nzudem hat man das bereits an dem kleinen buff vom letzten mal gemerkt das ryze definitiv nochmal durchgeschaut wird was sich da machen lässt daher denke ich wird zukünftig wieder kurzzeitig ne ryze meta hier am start sein.","replies":[]}]}