{"poster":"CaptainCozza","date":"2019-08-27T21:40:49.321+0000","title":"Permanent Account Bans for Chat Toxicity is an Excessive punishment, Perma Chat ban","subforum":"Player Behavior","up_votes":3,"down_votes":18,"body":"The Punishment isn't fitting the crime, and their just making a new account anyway\r\n\r\nFair enough player is toxic permanently ban their chat not their\r\nBanning the account will losing funding, fans, and desire for summoners to play as we arnt being respected\r\n\r\nNor is any care given to why such is happening and wheater there is a better way\r\nThere could be many underlying mental health issues causing such\r\n\r\nI was a toxic player and my main has over $1000 worth off skins and such many i can never get back\r\nNot too mention was 5 years off punishments and many attempts via me to improve with my bipolar and anti-social disorders\r\n\r\nI would understand permanent account ban if I was using 3rd party programs to bot or hack and modify gameplay in any way shape or form.\r\n\r\nImagine if we sold a tv, or a deck off playing cards, and the person had the worst attitude and turned out to be a serial killler. Are you entittled to take the tv back? NO, why consumer LAW\r\nBut such is what they are doing, it is illegal and they are getting away with it because they are such a big corporation killing ants (Summoners) with their thumbs\r\n\r\nThis isnt encouraging better behavior this is making punishments worthless and pointless.\r\nNot too mention throwing away $Million annually in Financial support\r\nI still play I have 2 other accounts now 1 with level 3 honorability.\r\n\r\nPermanently banning accounts for chat toxicity is not having a positive effect\r\nIt is losing track of who is or was toxic\r\n\r\nwhat I am suggesting is harsher Chat penalties 3 month chat ban 6 months 12months and a permanent chat ban\r\n\r\nTaking people accounts away completely is wrong and losing fans, funding and just releasing toxic player back into the game on a new account anyway\r\nIt's simply not having a good effect","replies":[{"poster":"Arcade Lulu","date":"2019-08-27T22:49:47.852+0000","up_votes":2,"down_votes":0,"body":"Before the system we had now, there were perma chat bans etc\nBut you know what most people started doing after they got perma chat banned?\nThey started trolling games\nWhich is a lot harder to detect \nSo yeah, never going back to that\n\nDon't want to get perma banned? Don't break the rules","replies":[{"poster":"JenShen","date":"2019-08-28T07:11:13.741+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Arcade Lulu,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=0002,timestamp=2019-08-27T22:49:47.852+0000)\n>\n> Before the system we had now, there were perma chat bans etc\n> But you know what most people started doing after they got perma chat banned?\n> They started trolling games\n> Which is a lot harder to detect \n> So yeah, never going back to that\n> \n> Don't want to get perma banned? Don't break the rules\n\nso they start trolling , but the toxicity in chat lowered( if you are chat restricted and have only 1 message every 5 min or so you can say max 4-5 toxic stuff for 20 min game and let's not forget the mute button, that have the amazing ability to reduce the chat toxicity 100% ), so... it seems like solution to me, then they can invest in a better system to detect trolls and actually punish them.\nStop protecting the trolls, they are destroying games, and there is not a magical button that stops them.\nso riot goes with the easy solution perma ban people using the caht( taht again is preventable by every single player with a single damn button and there is a options to disable it now.... and dont come with the \"yeah but they hurt my feelings with their meany words, because i wasnt fast enought to hit that wittle button), cuz why focus on trolls.\n\nand yeah the exxperiment you are talking about was bad , they gave caht restrictions to trolls too.\nthe 2 crimes should not be punished the same way, if you abuse the caht . restrict taht player's chat\nif you abuse the game play = restrict this guy gameplay........ why is it so hard to get that....","replies":[{"poster":"Arcade Lulu","date":"2019-08-28T07:47:08.424+0000","up_votes":1,"down_votes":0,"body":"Yeah you can mute the toxicity in chat, you can't mute someone's trolling. So i'd say it's a lot better to just punish the people who can't respect the rules and just give them a perma ban before they start trolling games. Because trolling games is still worse than being toxic in chat. So it's not really a solution, maybe a solution for chat problems, but not a solution for overall toxicity, it just makes that worse. How can they invest in a better system to detect trolls? When it's not always obvious if someone trolls. Or should we just ban everyone who has a bad game?\n\nHow am i \"protecting the trolls\" when i just point out why we don't have a system like what you're suggesting? Just because there's a mute button doesn't mean you're allowed to break the rules. The mute button is not a solution, it's just a bandaid. I can ute you so i don't have to deal with your toxicity, but you will be punished so others don't have to deal with your toxicity\n\nYeah, you can disable the chat now, so it's should be easier to not get perma banned, right?  I'm pretty sure almost nobody gets their feelings hurt by toxic people. But that again doesn't justify them breaking the rules\n\nBut why should the people who break the rules by abusing chat be perma chat muted? Why not just perma ban then? They still broke the rules, and punishments are supposed to feel bad. And i'm pretty sure it feels really bad to lose your account, as it should","replies":[{"poster":"JenShen","date":"2019-08-28T08:13:20.169+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Arcade Lulu,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=000200000000,timestamp=2019-08-28T07:47:08.424+0000)\n>\n> Yeah you can mute the toxicity in chat, you can't mute someone's trolling. So i'd say it's a lot better to just punish the people who can't respect the rules and just give them a perma ban before they start trolling games.\n\nso... you suggest punishing people before they do the bigger crime.. \"they are toxic in chat  and if you take their chat they will probably start trolling, so punish them as trolls... and yeah if you actually perma ban chat users they are more likely to troll, than if you jsut let them play but take their caht ...\n\n >Because trolling games is still worse than being toxic in chat. So it's not really a solution, maybe a solution for chat problems, but not a solution for overall toxicity, it just makes that worse. How can they invest in a better system to detect trolls? When it's not always obvious if someone trolls. Or should we just ban everyone who has a bad game?\n\nwell 1 solution is better than no solution lol, so instead of getting 1 solution for the chat toxicity you rather have none, cuz now perma bans solves nothing ( waht did perma banning for chat solved .. did the game get less toxic ? i dont think so it is actually even more toxic than before imo), you know, if people are not being perma banned for chat toxicity there will not be like 100 million tickets to riot support, and they can actually start checking trolls instead of \"is my chat ban worthy and what i did wrong in my chat\"\n> \n> How am i \"protecting the trolls\" when i just point out why we don't have a system like what you're suggesting? Just because there's a mute button doesn't mean you're allowed to break the rules. The mute button is not a solution, it's just a bandaid. I can ute you so i don't have to deal with your toxicity, but you will be punished so others don't have to deal with your toxicity\n\nhow can someone deal with my toxicity if they all mute me ...... , you are protecting the trolls, because you do not want the system to change.. and the current system is kind of bad, as i said about it didnt helped to lower the toxicity, it actually makes it worse and not only for the old players but for the new aswell.\nAnd breaking the rules should be punished according the the crime...\nyou abse the caht = less caht \nyou disrupts the game play= less game play.\n1 punishment for thieves, serial killers, rapist and crossing the road on the red light should not be the same, they all break the lows but, should they be punished with life sentence ???\n4 times crossing on red light do not makes you murderer lol....\n\n> Yeah, you can disable the chat now, so it's should be easier to not get perma banned, right?  I'm pretty sure almost nobody gets their feelings hurt by toxic people. But that again doesn't justify them breaking the rules\n\ni never said, dont punish people for breaking the rules, just .. the current system is bs. if you spam in chat and annoy people ... just make this guy have 1 message every 5 min and he will spam 1 message every 5 min.... i do not think this is something no one can handle,\n\n> \n> But why should the people who break the rules by abusing chat be perma chat muted? Why not just perma ban then? They still broke the rules, and punishments are supposed to feel bad. And i'm pretty sure it feels really bad to lose your account, as it should\n\nagain, why dont someone that shop lifted get death sentence? he broke the lows, right???, so just sent him to the chair, simple as that, we wont be bother with his shop lifting again.\n\nI am for the punishments, but let them be according to the crime.\nbut losing your account for being passive aggressive or some stuff like that is bs to me","replies":[{"poster":"Arcade Lulu","date":"2019-08-28T08:42:05.856+0000","up_votes":1,"down_votes":0,"body":"The thing is, they don't instantly get perma banned\nThey get perma banned if they break the rules after multiple warnings, they're even told on the 14 day ban reform card that the next punishment is a permanent one\nIf they constantly break the rules, then yes, perma ban is the solution\n\nYou don't get jailed for shop lifting once, but if you make it a habit and do it multiple times, you will be punished harshly\nAnd dunno about you, but crossing on red lights doesn't get you jailed instantly, meanwhile killing someone etc will get you instantly jailed. I don't really see how those can be compared, but okay ig\n\nAnd if you abuse the chat, you will get chat banned 1st, you'll have 2 chat related punishments, but if you keep breaking the rules constantly after that,  you will get punished more harshly because if you don't want to reform, why should you be treated nicely?\n\nYou don't get punished for just being passive aggressive. You get punished for breaking the rules and violating the ToU \nAnd if you don't want to lose your account, don't break the rules\nThe perma ban is there for a reason, it's there to scare people from breaking the rules. Because losing the account you've spent money and time on hurts really much, as it should because it's the harshest punishment you can basically get in the game","replies":[{"poster":"JenShen","date":"2019-08-28T11:36:18.274+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Arcade Lulu,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=00020000000000000001,timestamp=2019-08-28T08:42:05.856+0000)\n>\n> The thing is, they don't instantly get perma banned\n> They get perma banned if they break the rules after multiple warnings, they're even told on the 14 day ban reform card that the next punishment is a permanent one\n> If they constantly break the rules, then yes, perma ban is the solution\n> \n> You don't get jailed for shop lifting once, but if you make it a habit and do it multiple times, you will be punished harshly\n> And dunno about you, but crossing on red lights doesn't get you jailed instantly, meanwhile killing someone etc will get you instantly jailed. I don't really see how those can be compared, but okay ig\n> \n> And if you abuse the chat, you will get chat banned 1st, you'll have 2 chat related punishments, but if you keep breaking the rules constantly after that,  you will get punished more harshly because if you don't want to reform, why should you be treated nicely?\n> \n> You don't get punished for just being passive aggressive. You get punished for breaking the rules and violating the ToU \n> And if you don't want to lose your account, don't break the rules\n> The perma ban is there for a reason, it's there to scare people from breaking the rules. Because losing the account you've spent money and time on hurts really much, as it should because it's the harshest punishment you can basically get in the game\n\nso the system is here so it can hurt people or to try to lower the toxicity, because for now it only does only one of the things.\nare you really satisfied with people losing their accounts( because this is my observations, people are so happy when another player lose their account, that they dont care if the system is doing anything else than that) or you are satisfied because the system is reducing the toxicity, which again ... i think season 8 was the most toxic season, yet ( if we exclude the perma chat restriction experiment years ago, which was clown fiesta) .","replies":[{"poster":"Arcade Lulu","date":"2019-08-28T11:53:41.312+0000","up_votes":2,"down_votes":1,"body":"I'm satisfied when people who break the rules get punished accordingly \nSo both, i guess","replies":[]}]}]},{"poster":"Sona Ping","date":"2019-08-28T08:28:35.948+0000","up_votes":1,"down_votes":0,"body":"No, they are punishing habitual violations of the Terms of Use with the consequences for a violation of the Terms of Use.\n\n>but losing your account for being passive aggressive or some stuff like that is bs to me\n\nThen it's a good thing that doesn't happen.","replies":[]}]}]}]}]},{"poster":"Telephone Booth","date":"2019-08-27T22:16:28.628+0000","up_votes":2,"down_votes":0,"body":"No its not a solution. There is no solution. You cant control people.","replies":[{"poster":"JenShen","date":"2019-08-28T07:22:56.598+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Telephone Booth,realm=NA,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=0000,timestamp=2019-08-27T22:16:28.628+0000)\n>\n> No its not a solution. There is no solution. You cant control people.\n\nWith the current punishment riot actually makes it even worst. when someone lose their account, if they want to play they make new one, they destroy early levels ( where new players plays) and make the game even more toxic, because if they were banned for chat toxicity, they wont risk it again and will go with trolling \"which is harder to detect\"  so they can destroy more games, if the guy using chat get only his chat restricted , he wont go and make new account, and if he start to troll, at least he do not trolls the early levels where new players wont be expose to so much toxicity at least early in the game, then riot can actually try to focus on   system that can can detect trolls and getting them faster.\n\nriot cannot stay on a system that mostly punish 1 type of toxicity and call it a day* which really solves nothing actually, just makes the thing worse).","replies":[{"poster":"Telephone Booth","date":"2019-08-28T21:38:14.934+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JenShen,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=00000000,timestamp=2019-08-28T07:22:56.598+0000)\n>\n> With the current punishment riot actually makes it even worst. when someone lose their account, if they want to play they make new one, they destroy early levels ( where new players plays) and make the game even more toxic, because if they were banned for chat toxicity, they wont risk it again and will go with trolling \"which is harder to detect\"  so they can destroy more games, if the guy using chat get only his chat restricted , he wont go and make new account, and if he start to troll, at least he do not trolls the early levels where new players wont be expose to so much toxicity at least early in the game, then riot can actually try to focus on   system that can can detect trolls and getting them faster.\n> \n> riot cannot stay on a system that mostly punish 1 type of toxicity and call it a day* which really solves nothing actually, just makes the thing worse).\n\nPeople are weird. If they find losing games on purpose fun, they will do that either way. The arguement for trolling low level games vs high level games can go either way. Troll newer players/other trolls who got banned, or high level players who take the game seriously and have played for years. Theyre both bad. I cant really say which is worse. Id say threat of an account ban is more of a deterrent than threat of a chat restriction. ","replies":[]}]}]},{"poster":"KFCeytron","date":"2019-08-28T08:20:06.263+0000","up_votes":2,"down_votes":1,"body":"You weren't punished for misbehaving in one game. You were punished for misbehaving in _one more_ game, in a consistent pattern of negative behavior that breaks the game's rules. Additionally, the reform card doesn't always show all the logs that led to your punishment: it randomly selects up to several logs. You might see three logs, but you also might see as few as one, even for players whose punishment stems not from a small number of egregious infractions but rather from dozens of instances of mild toxicity. The purpose of the reform card is to tell you how to reform, so it shows you an example of the behavior that prompted your punishment and explains that such behavior is inappropriate and should be avoided if you want to maintain an account in good standing.\n\nUsually, one transgression by itself wouldn't be enough to bring such a punishment to an otherwise clean account, but the IFS works on an escalating punishment system. Breaking a minor rule, like engaging the team in useless arguments, has a minor punishment: a chat restriction. Breaking that same rule over and over again, however, doesn't prompt an endless series of chat restrictions. The severity of the punishment ramps up over time, because the goal is to eliminate the punished player's willingness to break the game's rules. If two chat restrictions don't stop the useless arguments, the system will increase the punishment to a 14-day suspension and deliver a very clear message that the continued rule-breaking is becoming a serious issue and any further instances will result in a permaban. Again, the point is to put a stop to this misbehavior. If a player is more interested in repeatedly breaking the rules than in maintaining access to their account, they'll lose access to their account.\n\nOf course, it's possible to break major rules, like cheating, threatening people, or using chat for hate speech, and skip punishment tiers so that a clean account ends up with a 14-day suspension or even a permaban.\n\nFrom [Riot's support knowledgebase](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-):\n\n> **PUNISHMENTS GENERALLY FOLLOW A BASIC ESCALATION PATH:**\n> \n> * First Offense: 10 Game Chat Restriction\n> * Second Offense: 25 Game Chat Restriction\n> * Third Offense: Two Week Suspension\n> * Fourth Offense: Permanent Suspension\n> \n> However, it is possible to skip to a Two Week or Permanent suspension based on the severity of the behavior in the game. Excessive negative behavior can result in a Two-Week or Permanent suspension at any time without having a chat restriction on the account.\n\nRiot's punishment system used to hand out stacking chat restrictions, such that consistently toxic players basically had a permanent chat restriction. Unfortunately, it turns out that such players used their few chat opportunities to be toxic, and, when they couldn't be as toxic as they wanted to, they resorted to committing non-chat offenses such as griefing (following someone around and taking their farm, using wall abilities to interfere with their play, etc.) or inting. The purpose of the punishment system is to eliminate rule-breaking, not make it worse. Thus, if a couple chat restrictions don't make any difference in a player's misbehavior, the system ramps up the punishments until the player is permabanned and thus unable to use that account to break any more rules ever again.\n\nRiot used to give toxic players a long series of gradually-increasing suspensions. However, they found that players who got more than a few punishments would never stop misbehaving and receiving punishments. As the goal of the punishment system is to eliminate rule-breaking and Riot has absolutely no interest in coddling toxic players, the system was changed to eliminate this long tail of irredeemable players. Compared to the hundreds or even thousands of typical players who are bothered over dozens or hundreds of matches ruined by a toxic player, that one player's ability to annoy people merits no sympathy or concern. The preferred outcome of punishing a misbehaving player is reform: according to Riot's figures, most players who get one punishment never get another. However, when a player refuses to stop breaking the rules after a few warnings (punishments), they are removed from the game with a permaban because Riot no longer believes them capable of reform.\n\nDid you find something in Riot's store [allowing you to break the ToS](https://i.imgur.com/AvDSnZF.png)? No, because such a service is not offered. Regardless of how much money you spend, you are required to follow the same rules as everyone else. If the IFS determines that you've been validly reported in violation of those rules, you'll be punished according to those rules. If you wanted to avoid a punishment, you should've followed the rules.\n\nLoL's Honor system rewards you with things like Honor, BE, and key fragments when it deems your behavior good. LoL's punishment system (the IFS, or Instant Feedback System) places a punishment on your account when it deems your behavior bad. Behaving well sometimes doesn't mean you behave well all the time. In this instance - and possibly others, since the IFS punishes based on severity and consistency, and the reform card doesn't necessarily display logs for every match where you were validly reported - you behaved poorly. Poor behavior is very impactful and thus carries a lot of weight with the IFS, so to regain Honor and avoid losing it you'll have to work on controlling your behavior. The IFS does forgive the occasional bad day, but if that kind of behavior becomes habitual, you might be greeted with a reform card telling you to rein it in, or with a permaban message if the temporary punishments haven't worked.\n\nTheft is defined as \"the action or crime of stealing,\" and stealing is defined as \"taking (another person's property) without permission or legal right and without intending to return it.\" When a player purchases RP, they give money to Riot and Riot increases a number in a database that Riot owns and operates. When that player spends the RP, Riot decreases the aforementioned number and simultaneously makes another change to the account which that player is allowed to access. This change might be a flag indicating that a certain skin can now be selected, or an increase in the number of rune pages customizable from that account. At no point in time does Riot sell, rent, or license any kind of ownership of any of Riot's assets to any player. Players are simply allowed to access the account they create, with their authorized credentials.\n\nThis is no different from accessing any other private entity's services. If you notice that a wall at a friend's house is very plain and you buy them a painting to spruce it up, that painting now belongs to your friend. If your friend forbids you from coming into their house, which could be for no reason, any reason, or very good reason (e.g. that you continually broke clearly-defined rules and ignored all reprimands and requests to change your behavior), you don't get to keep the painting. You also aren't owed the financial value of the painting, nor does helping with the decor grant you any right to keep hanging out at your (former) friend's house.","replies":[]},{"poster":"purplexbutterfly","date":"2019-08-28T16:22:49.153+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CaptainCozza,realm=OCE,application-id=ZGEFLEUQ,discussion-id=uo2fIb4w,comment-id=,timestamp=2019-08-27T21:40:49.321+0000)\n>\n> The Punishment isn't fitting the crime, and their just making a new account anyway\n> \n> Fair enough player is toxic permanently ban their chat not their\n> Banning the account will losing funding, fans, and desire for summoners to play as we arnt being respected\n> \n> Nor is any care given to why such is happening and wheater there is a better way\n> There could be many underlying mental health issues causing such\n> \n> I was a toxic player and my main has over $1000 worth off skins and such many i can never get back\n> Not too mention was 5 years off punishments and many attempts via me to improve with my bipolar and anti-social disorders\n> \n> I would understand permanent account ban if I was using 3rd party programs to bot or hack and modify gameplay in any way shape or form.\n> \n> Imagine if we sold a tv, or a deck off playing cards, and the person had the worst attitude and turned out to be a serial killler. Are you entittled to take the tv back? NO, why consumer LAW\n> But such is what they are doing, it is illegal and they are getting away with it because they are such a big corporation killing ants (Summoners) with their thumbs\n> \n> This isnt encouraging better behavior this is making punishments worthless and pointless.\n> Not too mention throwing away $Million annually in Financial support\n> I still play I have 2 other accounts now 1 with level 3 honorability.\n> \n> Permanently banning accounts for chat toxicity is not having a positive effect\n> It is losing track of who is or was toxic\n> \n> what I am suggesting is harsher Chat penalties 3 month chat ban 6 months 12months and a permanent chat ban\n> \n> Taking people accounts away completely is wrong and losing fans, funding and just releasing toxic player back into the game on a new account anyway\n> It's simply not having a good effect\n\nAre you seriously blaming your mental health problems as an excuse for being a dick in game??? It's not your bipolar causing you to be a dick in game, that's just you choosing to be toxic and flame in game. I have Schizoaffective and have never once received a penalty for toxicity in game. Because I choose not to be toxic that's why. Bad behaviour is a choice. Okay, sometimes in game we get frustrated. I am not gonna lie and say I have never flamed because I have, but it's very rare that I do. You have repeatedly behaved badly. Even after suspensions which would to me, be an ample warning that I need to stop, you continued. I am glad that toxic players get perma banned because it ruins mine and others games. I love games where the team has banter with one another, whether the game is going well or not. My game is also made better when the enemy team join in with the banter. I have made so many friends on league that way. They are the best games.","replies":[]},{"poster":"hrooza dota ","date":"2019-08-28T13:39:13.449+0000","up_votes":1,"down_votes":0,"body":"you can perma chat ban your self in the options afaik","replies":[]},{"poster":"MrFawknSunshine","date":"2019-08-27T22:17:36.261+0000","up_votes":1,"down_votes":0,"body":"toxic chat is always going to exist. there is nothing riot can do to stop that because it the fault falls on the individuals who are toxic. the punishment system has tiers. you typically dont get perma banned cuz you were toxic once. this is something that happens more then once and have prior infractions on the account. it will get to a point where you dont show reform or change that riot will say well that is enough and perma banned the account. no one is at fault but the person who broke the TOS and chose to ignore the multiple warnings/punishments and not change their behavior.","replies":[]},{"poster":"DBS Ronovon","date":"2019-08-28T23:50:59.530+0000","up_votes":1,"down_votes":1,"body":"I don't have the answer, but I have an answer for you if you're looking to improve your ability to stay out of the penalty box and prevent a self ban. \n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/9JYEebfE-how-to-guide-on-avoiding-being-suspended-or-banned-permanently\n\nI made the rules for players like me who are Toxic and need to refrain from telling people off. In essence I think this rule set can help the climate of this community and these rules have helped me personally, so check them out and see if they help you. \n{{sticker:garen-swing}}","replies":[]}]}