{"poster":"JuttaFuk","date":"2018-07-03T00:14:04.740+0000","title":"Banned for 1st time offenders","subforum":"Player Behavior","up_votes":2,"down_votes":8,"body":"I understand it hates speech, but maybe riot needs to change up their rules for first time offenders as in 2 week chat ban instead of being banned from the game completely for 2 weeks. Ya'll need to have something like a baseball game 3 strikes then ur out. not just boom 1 word and ur banned.\r\n\r\nThis is what Riot really needs to think about is would help people understand more of how serious they are about banning players. The thing is players spend a lot of there time and not only that , but there money and when  1 thing is said from a first time offender like me I get banned for 2 whole weeks. I can't even get off with a warning and get chat banned for 2 weeks. I know it's possible to do something for people that are the innocent when they are being trolled.  \r\n\t\r\n\r\nTO start with my live chat with a riot support service\r\nRedEdge\r\nCustomer support\r\nJuttaFukI just want to understand why I have been banned for 14 days and didn't just receive a chat restriction. This is my first time being reported because i got hot headed for someone flaming me, which is the person that should have been banned not me. The whole banning system riot has needs to be fixed ya'll will lose a lot of players this way and riot really needs to think about all the players that spend money and then ya'll turn around the ban them completely from their account that they can never access ever again. \r\n\r\nChat started\r\nRedEdge joined the chat\r\n\r\nRedEdgeHey there! \r\n\r\nhow are you doing today? \r\nJuttaFukI have been better to be honest \r\n\r\n\r\nRedEdgeI'm sorry to hear that D: \r\n\r\nWhat all happened in that game? \r\nJuttaFukWe have 2 enemies of the opposing team that were just getting under mine and my fiance skin. I tried to hard to let it go, but my stubborn hard head got the best of me. \r\n\r\n\r\nRedEdgeIt really is tought not lashing back out at other palyers when they are flaming us like that I totally get you there! \r\n\r\nBut remember, that both initiating and retaliating with negative chat both break our behavioral guidelines.\r\nJuttaFukNot once have a played a game where the enemies were rude. \r\n\r\nI do understand that, but this is my first time ever being reported... and I have never been chat banned before so for the first time getting reported I dont get chat banned as a warning I get banned for 14 days... I'm really not a negative person when it comes to gaming \r\n\r\n\r\nRedEdgeWell it is possible to skip steps in penalty escalation depending on the severity \r\n\r\ngive me a sec to check into your account here? \r\nJuttaFukok. \r\n\r\n\r\nRedEdgeOhhhh I see what happened here. It looks like you used hate speech a few times (\"%%%\" was the term used). I know it sucks when players are flaming us like that but there really is no in game reason that justifies hate speech. It really does have the potential to massively impact other players negatively. Since we deem it to be much more severe you were escalated stright to a 2-week. I'm sorry that happened to you \r\nJuttaFukI would honestly been fine with never being able to chat with anyone...this is the only game I play. \r\n\r\n\r\nRedEdgeI have a resolution for you then actually! \r\n\r\nIf you are still finding it hard to stop yourself from chatting negatively, you can actually disable your \"enter\" key in a sense. This way, even if you feel like giving into the temptation to chat negatively, you physically won't be able to type in chat. You can do this by following the instructions in this link here: https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/ghKQoeu8-how-to-unbind-your-enter-key-to-prevent-inadvertent-toxicity \r\nJuttaFukBut i wont be able to do that for 2 weeks? \r\n\r\n\r\nRedEdgeI wish I wasn't the bearer of bad news here, but yes that is the case, the 2-week will need to stay in place on your account sadly \r\nJuttaFukI have seen and heard people who have said worse things then what I did that game and never have been banned. I just see it as unfair that 1 game I say I word that i shouldnt have said but i cant get a warning.... \r\n\r\nthere is honestly nothing u can do for me not even a smaller ban the 2 weeks... \r\n\r\n\r\nRedEdgeI definitely don't want you to feel singled out here! Any time a player breaks our behavioral guidelines and it is brought to our attention we penalize for it, which means we really are just holding you to the same standards as the rest of the community. If you have summoner names of players that you have seen using that kind of chat could you send them my way? I'd be happy to look into their accounts for you \r\n\r\nAnd I really wish I could give you the outcome you want, but we can't turn a blind eye to hate speech, and the 2-week suspension is the appropriate penalty here \r\nJuttaFukI have plenty of people, and i do feel singled out completely! I havent done anything wrong since i have made this account...and i say one word and I skip all the other steps and just get banned \r\n\r\nI cant even get of my friends list to get the summoners names \r\n\r\n\r\nRedEdgeI know that it sucks, but all it does take is 1 game with negativity to warrant a penalty, and since hate speech is something we deem to be more severe, we escalate players straight to a 2-week for it \r\n\r\nAnd I'll go ahead and start with the players in the game that lead to your suspension and will take action on their accounts based on what I find \r\nJuttaFukThis is so wrong for yall to do this to, not only to me, but to a lot of other players as well. \r\n\r\n\r\nRedEdgeI definitely understand how much this sucks, but my hands are tied here, we really can't turn a blind eye to hate speech like taht \r\nJuttaFukreally focus of the patheon and kai'sa and there was one more that u should look into that played with patheon bot against with me and fiance \r\n\r\n\r\nRedEdgeWill do! Do you have any specifics for me? Anything will really help my investigation for sure! \r\nJuttaFukso is the word %%% worse than saying kys(kill yourself)? \r\n\r\n\r\nRedEdgeHate speech and telling another player to harm themself are both things we treat as extremely severe as they have the potential to massively impact the players involved negatively \r\n\r\ndid they tell you to \"kys\" in your game? \r\nJuttaFukI really cant help without a friends list from previous games \r\n\r\nNot this specific game no, but i have reported plenty of people that have said it in game or worse then the word %%% and I never got a response that an action was taken. \r\n\r\n\r\nRedEdgeIf you report someone and you don't receive an instant notification that your report lead to a penalty on their account it doesn't mean they weren't penalized. Sorry for the confusion here but sometimes the notifications don't go through! \r\n\r\nAnd thats ok! I'll go back through and check up on the behavior of the players! It's totally fine that you don't have their sum names \r\nJuttaFukI understand it hates speech, but maybe riot needs to change up their rules for first time offenders as in 2 week chat ban instead of being banned from the game completely for 2 weeks. Ya'll need to have something like a baseball game 3 strikes then ur out. not just boom 1 word and ur banned. \r\n\r\nRiot is losing a lot of players because the innocent get in trouble and the trolls get away with it. \r\n\r\n\r\nRedEdgeYou know you do have a bunch of good advice here! If you would like you can head over to the boards and post your ideas there. This way you can hash your suggestion over with the rest of the community and get more exposure: https://boards.na.leagueoflegends.com/en/ \r\nJuttaFukok thanks.","replies":[{"poster":"Evangele","date":"2019-05-31T08:00:21.326+0000","up_votes":1,"down_votes":0,"body":"{{champion:267}} Locking a necro","replies":[]},{"poster":"Chermorg","date":"2018-07-03T00:17:53.978+0000","up_votes":6,"down_votes":1,"body":">Riot is losing a lot of players because the innocent get in trouble and the trolls get away with it.\n\nYou weren't innocent. You used hateful, derogatory, and extremely offensive in game. You are the type of player Riot does not particularly *mind* if they happen to lose because you're punished.\n\nYou should not have needed a warning that using hateful, derogatory, homophobic, and just plain dickish language in game was not acceptable.","replies":[{"poster":"Silly Neeko","date":"2018-07-03T00:54:04.007+0000","up_votes":2,"down_votes":0,"body":"Hey \"example for the community\". Did you not just tell someone in a different thread off about their abusive chat here?\n\nIf that chat with a Riot support person is real they said it was only a few instances of hate speech. You im sure have had your moments of being quite rude in game as well, just avoided saying anything that is considered \"hate speech\".\n\nRiot does not WANT to lose a player that could have been playing for years and did 1 slip up, which is why its only a 14 day ban not perma ban.\n\nIm all for being blunt but this message of yours seems a bit too much like you are wanting to be a jerk to them. I agree hate speech has no place in the chat, but obviously this was a first time offence, and they were nice about explaining it to the Riot person as well as on here.","replies":[{"poster":"Chermorg","date":"2018-07-03T01:00:41.624+0000","up_votes":1,"down_votes":0,"body":"I can fully respect your opinion, but I feel that the tone of OP's message indicates they're unwilling to accept anything less than a blunt message forcing it through their head that what they did was wrong and did not need a warning.\n\n>Riot does not WANT to lose a player that could have been playing for years and did 1 slip up, which is why its only a 14 day ban not perma ban.\n\nTo be fair, Riot doesn't want anyone who thinks hate speech is okay in their game. Period. Whatsoever. They give players another chance not because they want them to stay with that attitude, but because they don't want to punish players who did legitimately just let something slip (but still didn't think it was okay). OP has made clear they think it's okay to use hate speech - that's not the player Riot wants.","replies":[{"poster":"Silly Neeko","date":"2018-07-03T01:22:35.150+0000","up_votes":2,"down_votes":0,"body":"If you actually read their message, then you would have seen that they did not say it was acceptable. They said that it should be a 2 week chat ban instead of game ban.\n\nThis is not a warning, it is targetting what the specific issue was in the first place. If they do it again then it is not just a chat issue, but attitude issue that needs fixed, so 14 day ban would be fine. Then if they do it again perma ban because they are purposefully not wanting to learn.\n\nIts actually not THAT bad of an idea especially if paired with something like low priority queue that says \"hateful and derogitory and extremely offencive chat is not tolerated.\" Can be a 5 or 10 min wait time each game with that message popping up for 2 weeks.","replies":[{"poster":"Chermorg","date":"2018-07-03T01:25:05.098+0000","up_votes":1,"down_votes":0,"body":"A chat ban is a *warning*. There is no warning needed that this is unacceptable behavior in League. A ban is a message that you are not welcome in League with that attitude - not \"you're welcome but only have a few messages per game\" - that attitude is fully unwelcome.","replies":[{"poster":"Silly Neeko","date":"2018-07-03T01:34:07.334+0000","up_votes":1,"down_votes":0,"body":"It was said BAN not restriction. Thus, no chat at all for the entire duration.","replies":[{"poster":"Chermorg","date":"2018-07-03T01:38:01.457+0000","up_votes":1,"down_votes":0,"body":"Riot does not do that. To anyone. If someone is playing League, they will have at least some access to chat. Riot believes that chat is an integral and important part to League, and that other players should not have to suffer (by having a teammate who literally can't chat at all) in their games.","replies":[{"poster":"Silly Neeko","date":"2018-07-03T05:00:17.281+0000","up_votes":1,"down_votes":0,"body":"Except that they even right there said that they can unbind the enter key from the enter key. You can communicate via pings no worries, they suggest muting chat if needed if you cant hold your commentary.....\n\nSo no. Chat is not \"integral\". Communication can happen via pings no worries, or voice chat if they are premade teams.... there are many ways to communicate without chat. They ensured this.\n\nOther team mates would not suffer from the lack of the chat, and some would actually prefer that a full chat ban be implimented if needed. If they cant say anything nice, they shouldnt be saying anything at all kinda thing.\n\nEven in champ select there is selecting your prefered champion for a visual communication.\n\nRiot does not CURRENTLY ban chat. This is what the post of theirs was commenting about however, that its something they could think about doing.","replies":[{"poster":"Chermorg","date":"2018-07-03T05:03:21.698+0000","up_votes":1,"down_votes":0,"body":"Riot is not going to lie to players and tell them they can't do that. And muting is certainly a valid strategy if you're being tilted by others.\n\nRiot does not believe in the **non-discriminatory and universal** disabling of chat. This is why all chat can be disabled, but not team chat. This is why players can be muted, but not until you're in game. This is why you do not ever have your chat fully muted (and there is no way in client to do so).\n\nRiot has stated multiple times that they will not remove chat from players - either as a punishment or upon request.","replies":[]}]}]}]}]},{"poster":"TesTaCull Prime ","date":"2019-05-26T00:24:20.656+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Silly Neeko,realm=NA,application-id=ZGEFLEUQ,discussion-id=MeHmEMqp,comment-id=0000000000000000,timestamp=2018-07-03T01:22:35.150+0000)\n>\n> If you actually read their message, then you would have seen that they did not say it was acceptable. They said that it should be a 2 week chat ban instead of game ban.\n> \n> This is not a warning, it is targetting what the specific issue was in the first place. If they do it again then it is not just a chat issue, but attitude issue that needs fixed, so 14 day ban would be fine. Then if they do it again perma ban because they are purposefully not wanting to learn.\n> \n> Its actually not THAT bad of an idea especially if paired with something like low priority queue that says \"hateful and derogitory and extremely offencive chat is not tolerated.\" Can be a 5 or 10 min wait time each game with that message popping up for 2 weeks.\n\nThank you I have been trying to get this message across to RIOT today and all I get are canned responses and support staff who much like Chermorg, don't actually read what people are writing before throwing their two cents in.","replies":[]}]}]},{"poster":"TesTaCull Prime ","date":"2019-05-26T00:21:29.732+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Silly Neeko,realm=NA,application-id=ZGEFLEUQ,discussion-id=MeHmEMqp,comment-id=00000000,timestamp=2018-07-03T00:54:04.007+0000)\n>\n> Hey \"example for the community\". Did you not just tell someone in a different thread off about their abusive chat here?\n> \n> If that chat with a Riot support person is real they said it was only a few instances of hate speech. You im sure have had your moments of being quite rude in game as well, just avoided saying anything that is considered \"hate speech\".\n> \n> Riot does not WANT to lose a player that could have been playing for years and did 1 slip up, which is why its only a 14 day ban not perma ban.\n> \n> Im all for being blunt but this message of yours seems a bit too much like you are wanting to be a jerk to them. I agree hate speech has no place in the chat, but obviously this was a first time offence, and they were nice about explaining it to the Riot person as well as on here.\n\n I love you for saying this.  This Cher person is all over these forums being the biggest piece of sh** out of anyone.  Even moreso than the people they are trying to sit on their high horse above.   They are stooping to the level of the people they are trying to \"educate\" or whatever but they aren't witty or charming or charismatic, they are just a plain ol fashioned dick.  And I'm sure it's cause they are jaded or whatever from having to read a lot of dumb sh** every day, but that is absolutely no reason to be an asshole to everyone you come in contact with who doesn't agree with your opinion.  They are a hypocrite too, because they are guilty of the attitude and generalized negative behavior they think they are trying to point out in other people.  \n\nTHANK YOU SO MUCH FOR POINTING THIS OUT.... MORE PEOPLE NEED TO.  Riot's support staff are canned response zombies or trolls themselves who try to be smartasses to anyone who THEY PERCEIVE doesn't have a valid argument.","replies":[{"poster":"Silly Neeko","date":"2019-05-30T03:52:46.672+0000","up_votes":1,"down_votes":0,"body":"Few things here:\n\nFirst and foremost.... this thread is nearly a year old. Keep in mind you can get punished for necrothreading.... or trying to bring back a very old post.\n\nSecond, i have had nice chats with Riot support and multiple of the mods on the forums. You are now the one trying to be a \"plain ol fashioned dick\" now. So try not to do that.","replies":[]}]}]}]},{"poster":"CharDeeMcDenniz","date":"2018-07-03T09:56:14.024+0000","up_votes":1,"down_votes":0,"body":"it's amazing how many people dont seem to understand what \"ZERO TOLERANCE\" means","replies":[]},{"poster":"JuttaFuk","date":"2018-07-03T01:43:29.951+0000","up_votes":2,"down_votes":2,"body":"I never said i was innocent i was just saying they turn in the innocent and never catch the bad guys. I know what i said was wrong. I'm just not understanding why I never received a chat restriction and went straight to a 14 day ban, when I have never been chat restricted before.","replies":[{"poster":"Silly Neeko","date":"2018-07-03T05:10:22.490+0000","up_votes":1,"down_votes":0,"body":"It is because hate speech in general is not tolerated.\n\nIt bypasses the previous punishments and goes straight to a ban currently.","replies":[]}]},{"poster":"Silly Neeko","date":"2018-07-03T00:26:48.702+0000","up_votes":1,"down_votes":0,"body":"Hmm.... maybe, but i do want to say that if you used hate speech you are no longer \"innocent\".\n\n2 week complete chat ban (not restriction) could be a better first step for that, its not like its leniancy towards the hate speech, but this would be for as long as its not excessive amounts of it. But also instead of 3 strikes, id go for 2. If you dont figure it out after 1 time then you wont figure it out after the second.","replies":[]},{"poster":"Xurreal","date":"2018-07-03T01:06:31.112+0000","up_votes":1,"down_votes":0,"body":"No one ever believes their ban is just.","replies":[]},{"poster":"L33royJenk1ns","date":"2018-07-03T00:18:28.952+0000","up_votes":1,"down_votes":3,"body":"You do get 3 strikes before a 14 day ban. Unless you were being extremely toxic (hate speech goes in this category) you shouldnt go straight to a 14-day ban.","replies":[{"poster":"Zombie Gerbil","date":"2018-07-03T00:20:53.321+0000","up_votes":2,"down_votes":1,"body":"Your 3rd strike is a 14-day ban.\nThe two before them is a 10-game and 25-game chat restrictions. The 4th tier penalty is a permaban. There's only a total of 4 strikes.","replies":[{"poster":"Voldymort","date":"2018-07-03T07:03:05.686+0000","up_votes":1,"down_votes":1,"body":"technically there can be more than 4 if we assume that there are a number of times before the 4th strike when an account is brought down a tier of punishment or two, provided the player reforms somewhat haphazardly.","replies":[]}]}]}]}