{"poster":"KatMalice","date":"2018-02-22T11:01:10.916+0000","title":"Wie spiele ich auf der Top Lane gegen Tanks","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nich habe momentan einige Probleme mit denen ich nicht wirklich klar komme. Normalerweise spiele ich im Ranked Jungle, bin aber neuerdings auf die Top geswitcht und spiele dort haupts&auml;chlich Riven. Trainiere auch regelm&auml;&szlig;ig im Practice-Tool mit den Dummys (Fast Q&acute;s, Animation Cancels etc.) und l&auml;uft auch so weit so gut.\r\nAls Second spiele ich auf der Mitte Katarina, aber da passt alles weitgehend.\r\n\r\nGenerell bin ich eigentlich mit meinen Spielen zufrieden und steige auch leicht immer weiter auf. Bis auf Farm, fragw&uuml;rdige Engages oder Entscheidungen (arbeite ich dran :D) l&auml;uft die Laning Phase und das Late Game also ganz gut.\r\n\r\nNun habe ich aber folgendes Problem. Auf der Top-Lane f&uuml;hle ich mich zumindest in den ersten 15 Minuten v&ouml;llig nutzlos vom Team. Mag vllt auch daher kommen, dass ich vorher als Jungler dementsprechend um einiges mehr Impact hatte im Early und mir ist klar das dies mit der Top-Lane nicht vergleichbar ist. Dies versuche ich aber mit Roaming auf die Mitte oder sogar einem Teleport auf die Bot auszugleichen.\r\n\r\nAber besonders wenn ich gegen Tanks mit abnormalen Schaden lanen muss (Sion, Maokai und sogar Volibear o.O) f&auml;llt mir dies verst&auml;rkt auf. Meist sitze ich dann unterm Tower, versuche so viel wie m&ouml;glich zu farmen und EXP zu sammeln. Sollte der Jungler auf einen Gank vorbeischauen, habe ich meistens ne riesige Minionwave vor mir und komme schwer an den Gegner rechtzeitig ran. Au&szlig;erdem komme ich auch nie dazu einen Teleport-Play auf die andren Lanes zu wirken.  Das kommt daher, dass ich den Teleport meist brauche um auf meine eigene Lane zu kommen, um nicht zuviel Farm etc. zu verlieren oder gar den Tower (da ich ja die Lane nicht gegen pushen kann).\r\nSelbst ein kleiner Roam auf die Mitte was ich zu gern mache wenn ich meine Lane bereits Snowballe, w&uuml;rde meist mit dem Verlust vom Tower enden.\r\n\r\nRichtig gegen den Tank ank&auml;mpfen, kann ich irgendwie nicht. Von LvL 1 an sowieso nicht und auch mit LvL 3 outdmg mich der Tank. Traden will auch nicht wirklich funktionieren und was die Itemwahl betrifft bin ich mir auch nicht wirklich sicher.\r\n\r\nMeist versuche ich Early auf Black Cleaver zu gehen, aber das dauert zu lange und wenn ich es dann habe f&uuml;hle ich keinen Unterschied vom Schaden her. Liegt wahrscheinlich dann auch daran, dass der Tank logischerweise schon Armor kauft.\r\n\r\nUm also nicht weiter um den hei&szlig;en Brei herumzureden. Wie spiele ich generell gegen solche Tanks mit viel Early und Mid-Game Schaden und welche Items sollte ich da am besten bauen? Au&szlig;erdem frage ich mich ob es nicht doch irgendwie eine M&ouml;glichkeit gibt w&auml;hrend der Laning-Phase Impact auf die anderen Lanes in so einer Situation aufzubauen.\r\n\r\nIch hab mich auch schon an Riven Jungle im Ranked versucht und es lief nicht mal schlecht, aber da f&uuml;hle ich mich einfach noch zu unsicher. Schwanke da auch stark welchen Keystone ich mitnehmen soll. (Aftershock/Electrocute/Dark Harvest)\r\n\r\nVielen Dank schon einmal f&uuml;r kommende Antworten. {{sticker:katarina-love}} \r\n\r\nMfG\r\n\r\nR34lly","replies":[{"poster":"iwannadolucyliu","date":"2018-02-22T11:45:45.745+0000","up_votes":2,"down_votes":0,"body":"jungler müssen geduld lernen! ich hasse es wennd er jungler vorbeikommt und pingspammed und dann einfach so engaged! aka ICH BIN JETZT HIER! JETZT MUSS WAS PASSIEREN! kann doch nicht so schwer sein zu warten bis a) die minionwave ausgedünnt ist oder b) ich den gegner baite und der jungler dann dazu kommt","replies":[{"poster":"KatMalice","date":"2018-02-22T14:14:59.248+0000","up_votes":1,"down_votes":0,"body":"Es ist auch stark von verschiedenen anderen Faktoren abhängig. Wer ist der Gegner? Wer bist du? Wer ist der Jungler? etc. und vor allem wo ist der gegnerische Jungler.\n\nHabe selbst erst bis vor kurzem nur Jungle gespielt und da gab es oft genug Situationen wo dies durchaus erfolgreich ausgegangen ist. Natürlich sollte das rechtzeitig gecalled werden, sodass der Laner sich dementsprechend vorbereiten kann oder es auch ggf ablehnen.\n\nMfG\n\nR34lly","replies":[]}]},{"poster":"A lonely Pirate","date":"2018-02-22T20:13:35.521+0000","up_votes":1,"down_votes":0,"body":"Du farmst einfach bis du 1-2 items hast, vorher fightest du nicht, pusht nicht und wardest","replies":[]},{"poster":"Anophis","date":"2018-02-22T13:25:11.920+0000","up_votes":1,"down_votes":0,"body":"Nimm mit Riven gegen Tanks Grasp oder Klepto mit, ansonsten einfach möglichst effizient traden. Und bei manchen Matchups (Cho gath, Ornn z.B.) von vorneherein akzeptieren  dass du die Trades auf lange Sicht verlierst, also in der Lane nicht auf Kills gehen sondern versuch den Gegner möglichst zu outfarmen und durch Roams an Kills zu kommen ;)","replies":[{"poster":"KatMalice","date":"2018-02-22T14:05:07.991+0000","up_votes":1,"down_votes":0,"body":"Hey, danke für die Antwort. Daran hab ich gar nicht gedacht. Hab mich mit Aftershock momentan so wohl gefühlt dass ich gar nicht über die anderen nachgedacht hab. Werde beides mal ausprobieren, wenn ich in Normals auf Tanks treffe, danke!\n\nJa, vor allem Ornn ist eine harte Nummer momentan.\n\nVllt wäre in Zukunft die neue Rune im Precision Tree welche bald auf dem PBE kommen soll eine attraktive Alternative gegen Tanks mal schauen.\n\nDas mit den Roams ist leider nicht so einfach, wenn der Gegner ständig gegen den Tower pusht. Da bin ich mir noch zu unsicher was die richtige Entscheidung im richtigen Moment ist.\n\nMfG\n\nR34lly","replies":[]}]},{"poster":"Necromant","date":"2018-02-22T11:30:16.858+0000","up_votes":1,"down_votes":0,"body":"Schau heute Abend mal bei mir vorbei :) da kann ich dir das Ausführlich beschreiben:\n\n[LetsPlayGreatGames](https://www.twitch.tv/letsplaygreatgames)\n\nGruß, Necro {{champion:92}}","replies":[]}]}