{"poster":"hashinshin","date":"2015-08-22T06:10:10.166+0000","title":"Vayne is now literally the most popular champion in LoL, yet still maintains a 51% win rate.","subforum":"Gameplay","up_votes":151,"down_votes":34,"body":"Going to a 55% winrate in masters+, and a 57% winrate over in Korea.\n\nThis is not a fad. This isn&#039;t going away. Riot needs to fucking do something.\n\nEDIT: Actually my bad. I was using old numbers. Her win rate over the last 7 days is actually 58% in masters+, and 60% in Korea. ","replies":[{"poster":"Best Darius KR","date":"2015-08-22T12:09:33.563+0000","up_votes":49,"down_votes":3,"body":"No Sir! Shen is much more overpowered and needs immediate  nerfs! - Riot","replies":[{"poster":"SlaktarTasken","date":"2015-08-22T12:47:09.964+0000","up_votes":13,"down_votes":3,"body":"> [{quoted}](name=Blueslifer,realm=EUW,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=0009,timestamp=2015-08-22T12:09:33.563+0000)\n>\n> No Sir! Shen is much more overpowered and needs immediate  nerfs! - Riot\n\nIkr, that nerf came from right out of the freaking blue and I see no sense to it. -.-","replies":[{"poster":"Mecha MaIphite","date":"2015-08-22T17:59:29.571+0000","up_votes":11,"down_votes":0,"body":"Titanic hydra made Shen quite strong. He was already in a pretty decent place, and it just gave him waveclear that scales with HP, as well as a bit of HP on its own.","replies":[]},{"poster":"ElJanitorFrank","date":"2015-08-22T23:18:57.420+0000","up_votes":2,"down_votes":0,"body":"Right out of the blue, at the same time of changes to all of the items he builds.","replies":[]}]},{"poster":"Vellich0r","date":"2015-08-22T16:01:49.326+0000","up_votes":2,"down_votes":1,"body":"It doesn't seem like much of a nerf. Of all the things on Shen that make sense, having a strong heal is the least thematically effective element.","replies":[]}]},{"poster":"SlaktarTasken","date":"2015-08-22T12:44:15.638+0000","up_votes":13,"down_votes":8,"body":"I think we need an item that counters true damage, like Randuins shaves of 10% of crits, we should have Blanduins, which shaves of 20% of true damage.","replies":[{"poster":"Ralanr","date":"2015-08-22T13:00:20.282+0000","up_votes":38,"down_votes":1,"body":"That'd get rid of the point of true damage.","replies":[{"poster":"SlaktarTasken","date":"2015-08-22T13:43:16.665+0000","up_votes":7,"down_votes":5,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=000a0000,timestamp=2015-08-22T13:00:20.282+0000)\n>\n> That'd get rid of the point of true damage.\n\nI don't see the problem, the whole concept of true damage is utterly stupid anyway, I find it acceptable on Darious and Cho, after all they have to connect to be capable of producing this damage, but on ranged carries... it's just riddiculous.","replies":[{"poster":"Maikal","date":"2015-08-22T17:45:01.484+0000","up_votes":17,"down_votes":3,"body":"True damage isn't stupid. Just like you counter physical damage with armour, and magic with magic resist, you counter true damage with healt-- - wait wat? {{champion:67}}'s true damage scales off health? But she already has 2 ad steroids to make her an excellent duellist/sudo assassin, incredible mobility from her passive and Q that makes her inescapeable as well as a knockback to counter assassinations? Plus stealth every 2 seconds. Did I mention stealth every 2 seconds? Surely riot will nerf her soo- -- What? They think she's balanced? Oh. \n\nUnlucky.","replies":[{"poster":"TenSlashTen","date":"2015-08-22T18:43:07.072+0000","up_votes":10,"down_votes":2,"body":"what armor?\narmor is gutted.","replies":[]},{"poster":"CZNOuI9LIw","date":"2015-08-22T23:01:04.932+0000","up_votes":1,"down_votes":0,"body":"I was with you until you got to the stealth. Her stealth only works when she ults.","replies":[{"poster":"Maikal","date":"2015-08-22T23:32:38.573+0000","up_votes":2,"down_votes":0,"body":"No. It only works when she uses her **2 second cooldown Q** while her ult is active.","replies":[]}]}]},{"poster":"Ralanr","date":"2015-08-22T16:20:32.716+0000","up_votes":4,"down_votes":1,"body":"I agree partially. I think it's something that only melee should have. \n\nI'm fine with True damage.","replies":[{"poster":"doiminat0r3600","date":"2015-08-23T01:06:48.699+0000","up_votes":1,"down_votes":0,"body":"You say that you're fine with it until you get hit with 500 points of it with a few Vayne AA","replies":[{"poster":"Ralanr","date":"2015-08-23T02:35:12.268+0000","up_votes":1,"down_votes":0,"body":"Yeah that's fine.  I'm not defending Vayne's power at all, just that taking away the point of true damage as a whole is not the way to go.\n\nMaybe getting rid of true damage from Vayne, or just nerfing her scalings might help.","replies":[{"poster":"doiminat0r3600","date":"2015-08-23T02:56:47.370+0000","up_votes":2,"down_votes":0,"body":"True damage isnt the issue. It's the way Vayne deals with it.","replies":[]}]}]}]},{"poster":"ArkenStorm","date":"2015-08-22T15:25:14.998+0000","up_votes":3,"down_votes":1,"body":"and also they have to be melee.","replies":[]}]}]}]},{"poster":"TotalJerk","date":"2015-08-22T15:49:09.791+0000","up_votes":18,"down_votes":0,"body":"You know what they need to do? Make her counters actually usable again.","replies":[]},{"poster":"Godaren","date":"2015-08-22T06:48:58.573+0000","up_votes":6,"down_votes":29,"body":"51% is good? I'd say that doesn't say much for her being op.","replies":[{"poster":"LankPants","date":"2015-08-22T09:35:11.329+0000","up_votes":31,"down_votes":4,"body":"Winrate*Pickrate is a better estimator of champ power than just winrate, and Vayne tops that list.","replies":[{"poster":"Godaren","date":"2015-08-22T17:09:17.021+0000","up_votes":3,"down_votes":6,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=00010000,timestamp=2015-08-22T09:35:11.329+0000)\n>\n> Winrate*Pickrate is a better estimator of champ power than just winrate, and Vayne tops that list.\n\nI see your point but Imo sivir and jinx are way better in solo q because they bring more then just damage, tower shredding or utility is pretty important to.","replies":[{"poster":"LankPants","date":"2015-08-22T17:11:09.335+0000","up_votes":5,"down_votes":0,"body":">I see your point but Imo sivir and jinx are way better in solo q because they bring more then just damage\n\nSo does Vayne. She brings self peel. Getting a bruiser off of your face is quite valuable.","replies":[{"poster":"Godaren","date":"2015-08-22T17:14:13.534+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=0001000000000000,timestamp=2015-08-22T17:11:09.335+0000)\n>\n> So does Vayne. She brings self peel. Getting a bruiser off of your face is quite valuable.\n\nLot's of adc have self peel she is just stronger cause her w is a little to strong. I think taking off the base damage on her w would be bad.","replies":[{"poster":"LankPants","date":"2015-08-22T17:17:27.675+0000","up_votes":2,"down_votes":1,"body":"The only other ADC with self peel comparable to Vayne is Tristana, and that's an ultimate.\n\n>she is just stronger cause her w is a little to strong. I think taking off the base damage on her w would be bad.\n\nIsn't this a contradiction?","replies":[{"poster":"Godaren","date":"2015-08-22T19:18:30.530+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=000100000000000000000000,timestamp=2015-08-22T17:17:27.675+0000)\n>\n> The only other ADC with self peel comparable to Vayne is Tristana, and that's an ultimate.\n> \n> Isn't this a contradiction?\n\ngood i mean woops lol","replies":[]}]}]}]}]}]}]},{"poster":"disregardable","date":"2015-08-22T06:17:37.248+0000","up_votes":3,"down_votes":30,"body":"ADC itemization vs Bruiser itemization is a problem. The fact that everyone suddenly stacks health and does damage is a problem. Vayne is a currently existent solution to that problem, but that does not mean she needs a nerf. It means she needs counterparts- via better ADC itemization, nerfs to the new health items, and/or buffs to other ADCs to help them deal with beefier champions.","replies":[{"poster":"BluePolarizer","date":"2015-08-22T10:00:11.244+0000","up_votes":21,"down_votes":3,"body":"Vayne has had an extremely high win rate ever since the tank meta started winding down. Ironically, she doesn't do that well against tanks that can actually build full tank and CC lock her. She does extremely well against low CC bruisers and assassins.\n\nShe didn't just get a high win rate in 5.16. She's had a ludicrous win rate since the sated devourer patch. Yep that's right, her win rate is higher against bruisers and assassins than against tanks as a \"tank buster ADC\".\n\nAnother thing is that caster ADCs that used to be strong like Ezreal, Lucian and Corki are now weak, because they go for the non-scaling Triforce instead of the scaling BoRK and don't have the crazy multiplicative scaling that Vayne's 3 steroids give her, yet they don't have strong enough early games to bully Vayne. In fact Vayne can actually bully these champs easily.","replies":[{"poster":"Leonerdo","date":"2015-08-22T20:20:00.617+0000","up_votes":2,"down_votes":0,"body":"Yeah, pretty much this. Her lack of effectiveness against tanks is pretty weird. (Maybe because full tank items like Frozen Heart and Thornmail are actually really strong against Vayne?) That's a tricky mess to unravel and get to the root of. But the fact that she can win her lane so hard once she hits level 6 and finishes her first item, is definitely something that should be looked at. She's supposed to be a late-game hyper carry, not a \"hyper-carry for the whole game except the first 8 minutes\"","replies":[{"poster":"BluePolarizer","date":"2015-08-22T21:02:51.187+0000","up_votes":3,"down_votes":0,"body":"I think its because her main survival is 1.) high damage and 2.) slipperiness from her mobility.\n\nSure, she has high damage against tanks too, but a little less than against a squishy since her physical damage is mitigated by alot. Meanwhile, her true damage deals just as much percent damage vs. squishies, the base damage is just as strong, but now her crazy physical damage (equal to 2000 gold in AD at level 3 ult and a 2 sec CD, 50% total AD steroid with mobility) is even stronger.\n\nIn addition, the devourer jungle is much lower on CC and burst than the tank jungle. A tanky jungler would usually bring 2-3 CC spells and respectable burst damage. Amumu for example can bring 1000+ damage of burst, %Hp sustained damage and 2 CC spells, more than enough to destroy Vayne. What does Shyvana bring? No CC, weak burst, just sustained damage. What does Vayne thrive on? Low burst, low CC enemies since you can't tank her.\n\nTanks can lock her down for 3+ seconds, during which she can get bursted easily, while longer ranged ADCs like Jinx/Kog/Ashe can safely sit in the back and poke.","replies":[]}]}]}]},{"poster":"WalkingInACircle","date":"2015-08-22T15:31:11.745+0000","up_votes":7,"down_votes":3,"body":"Correlation does not equal to causation. Statistics are not an argument by themselves, and I'm especially sick of hearing about how people think winrate and pickrate combined is any more accurate. It just further shows they don't understand that they're making assumptions based on the data rather than working with actual facts.","replies":[{"poster":"Yosuke Apperu","date":"2015-08-22T16:26:20.590+0000","up_votes":10,"down_votes":3,"body":"Here's an actual fact, percent max health true damage cannot be itemized against. You can slow her attack speed but that 15 percent slow on frozen heart isnt gonna make a huge difference. Plus you're building less health so you'll probably die just as fast.","replies":[{"poster":"WalkingInACircle","date":"2015-08-22T17:34:04.032+0000","up_votes":6,"down_votes":0,"body":"Actually you can also build items with shields such as {{item:3190}}.\n\nNot that I disagree in general, its not a good mechanic. It's also not the only problem with Vayne. But my point is my abstract than that. The statistics are not an argument by themselves.","replies":[{"poster":"Yosuke Apperu","date":"2015-08-22T17:56:53.793+0000","up_votes":3,"down_votes":0,"body":"I'm aware of that as well. I agree with your point lol. I still think true damage is her problem.. that and she has too much strength in deciding whether or not she wants to engage. She has so much self peel for an adc.","replies":[]}]}]},{"poster":"HAIL WHYDRA","date":"2015-08-22T17:00:54.862+0000","up_votes":4,"down_votes":0,"body":"Statistical probability favors the consistent, in a non random environment. \n'nuff said","replies":[]}]},{"poster":"Mikemaximum","date":"2015-08-22T16:57:55.503+0000","up_votes":6,"down_votes":1,"body":"The only reason she has a 50% winrate is because both teams pick her","replies":[]},{"poster":"Vistha Kai","date":"2015-08-22T18:37:44.969+0000","up_votes":9,"down_votes":5,"body":"Using winrate from Master+.\n\nWould you mind holding this for a moment.\nhttp://reactiongifs.us/wp-content/uploads/2013/02/downvote_dodgeball.gif","replies":[]},{"poster":"Duchess of Deer","date":"2015-08-22T22:42:06.868+0000","up_votes":3,"down_votes":0,"body":"it's not that she's op its that all other adc's are shit","replies":[]},{"poster":"Algrimor","date":"2015-08-22T19:00:37.740+0000","up_votes":3,"down_votes":0,"body":"I think if there is a problem with vayne, it's that the ADC's she struggles laning against are either weak at the moment or just not played very much currently. And I'm still amazed people complain about her true damage over something like her amazing AD steroids which you could argue may be what is putting her over the top, if anything really is. \n\nI personally don't think vayne is too strong right now, and using winrates alone (especially from masters+) is not a great indicator. People complain because she can be annoying to play against, but is easy to shut down in lane, and certainly isn't the only ADC that scales as well as she does.\n\nedit: An additional thought - another thing that may be putting her over the top is BoRK. BoRK by itself may be overtuned, and in conjunction with vaynes AD steroids making up for it's low-ish AD, you could make the case that her early game might be too easy, but I still maintain that her tough matchups are weak or not played.","replies":[]},{"poster":"Silents429","date":"2015-08-22T13:33:55.003+0000","up_votes":3,"down_votes":0,"body":"- citation needed ","replies":[]},{"poster":"Unironic SJW","date":"2015-08-23T05:52:25.255+0000","up_votes":2,"down_votes":0,"body":"This is what happens when you quietly and subtly buff a champ for months.\n\nSince her last nerf, she's gotten buffs to her itemization (5% crit removed from Infinity Edge and moved to Phantom Dancer, she builds IE 3rd item at the earliest, and sometimes not at all, while Phantom Dancer is core on her), a bugfix where she got extra AD on her ult tumbles removed, but given extra AD on her ult which is a net buff, buffs to Blade of the Ruined King, a favorable meta change). \n\nYes, these are small quality of life buffs and bugfixes - but they're buffs nonetheless. \n\nVayne's power right now is just a perfect storm of several small factors that have pushed her over the top.\n\nWanna know what meta would destroy Vayne? Watch S4 worlds again. 2-3 assassins per team, Lee Sin everywhere who's way more mobile than she is, Lucian/Trist who both stomped her in lane, supports more about making picks than peeling. ","replies":[]},{"poster":"FantasySniper","date":"2015-08-23T02:59:14.946+0000","up_votes":2,"down_votes":0,"body":"Why are people not yelling idiotic comments about how \"win rate means nothing\"? It's practically a given that some tard will say it proves nothing when statistics are used.","replies":[]},{"poster":"I Main Swain","date":"2015-08-23T01:55:31.841+0000","up_votes":2,"down_votes":0,"body":"> EDIT: Actually my bad. I was using old numbers. Her win rate over the last 7 days is actually 58% in masters+, and 60% in Korea.\n\nthat moment when his \"my bad\" is because the numbers werent high enough","replies":[]},{"poster":"Baunjo","date":"2015-08-22T21:04:13.699+0000","up_votes":2,"down_votes":0,"body":"vayne isnt unstoppable. Every game I have a vayne on my team they do horrible","replies":[]},{"poster":"Hard Penetrator","date":"2015-08-22T20:57:13.883+0000","up_votes":2,"down_votes":0,"body":"And how popular is thresh?","replies":[]},{"poster":"Moonlight Fencer","date":"2015-08-22T18:32:11.051+0000","up_votes":2,"down_votes":0,"body":"ehhh... doesnt a 50% winrate mean the champion is balanced???","replies":[]},{"poster":"rG Thundrag","date":"2015-08-22T16:24:47.400+0000","up_votes":2,"down_votes":0,"body":"Armor was slightly nerfed, and then we were given a ton of HP stacking items in a meta where vayne is super prevalent its not a good time to be playing at the moment cause this is probably where vayne shines as a meta and shes been buffed over the year.","replies":[]},{"poster":"SpongebobIsLife","date":"2015-08-22T16:15:48.118+0000","up_votes":2,"down_votes":0,"body":"51 is a pretty good number though","replies":[]},{"poster":"Sona Ping","date":"2015-08-22T14:21:08.739+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=hashinshin,realm=NA,application-id=3ErqAdtq,discussion-id=FZG3nl2N,comment-id=,timestamp=2015-08-22T06:10:10.166+0000)\n>\n>_Champion A_, when placed into a side in games matched to expect approximately a 50% win rate for a side, has approximately a 50% winrate.\n\nI know this is a \"Vayne hate thread\", but I fail to see the point.","replies":[{"poster":"Toothierosprey3","date":"2015-08-22T19:11:43.459+0000","up_votes":3,"down_votes":1,"body":"She has a really high play rate, meaning even beginner Vaynes are winning half of their games, which shouldn't be the case because she's supposed to have one of the highest skill caps in the game. She has a super high winrate in Master and in Korea, where people actually know how to play her.","replies":[]}]},{"poster":"Hayaishi2","date":"2015-08-22T19:05:42.707+0000","up_votes":3,"down_votes":1,"body":"Having played against Vayne many times since she is all they play in Diamond in my opinion her problem is not her W (though it is bullshit) but her steroids and safety.\n\nNow what i mean with safety:\n\n-If you don't bully her you get outscaled by level 6, so just don't feed in lane as Vayne, you can lose it, but as long as you still get CS you'll be fine.\n-She can build LS in lane and suffer no power loss. add 2 pots to that and you can't get her out of lane no matter how much you trade/poke.\n-Gets to level 11 with Bork and Zeal and she's already outscaled the enemy adc.\n- Also the fact that Janna is in every game and we all know how Janna is the queen of avoiding interaction in lane, Vayne just gets a free pass out of laning phase whenever Janna is on her side. (This lane is cancer, Janna/Vayne is by far the most antifun lane i've ever experienced)\n\nVayne could keep her true damage, is her play pattern that makes her completely overwhelming.","replies":[]}]}