{"poster":"IRyserI","date":"2016-07-03T16:55:43.904+0000","title":"Champion Update Kindred","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nich w&uuml;rde gerne einen Weg finden Kindred wieder mehr zu Ihrer eigendlichen Idee zu verhelfen. \r\nKlar war Kindred am Anfang ziemlich op und musste f&uuml;r eine Chancengleichheit angepasst werden. Jedoch finde ich es dann eher schade dass man versucht sie dabei auch in eine bestimmte Rolle zu zw&auml;ngen.\r\nKindred ist nun einmal eine Sch&uuml;tzin und darum sollte sie zumindest auch als ADC spielbar sein. Nur durch zunehmende &Auml;nderungen wird Kindred als ADC immer unattrktiver.\r\n\r\n\r\nWenn wir hierbei ein paar Updates betrachten kann man dabei feststellen ob auch die Grundidee noch gegeben ist. (hierbei nat&uuml;rlich nur ein paar gr&ouml;&szlig;ere)\r\n\r\n**Tanz der Pfeile [Q]:**  - Erh&ouml;hung der Abklingzeit in Blutrausch des Wolfs [W]\r\n**Blutrausch des Wolfs [W]:**  - Entfernen der Passiven (Heal)\r\n**Gnadenfrist des Lamms [R]:**  - Aktivierung nurnoch auf Kindred selbst\r\n\r\nHier ist die &Auml;nderung der [R] vollkommen gerechtfertig und vor allem angebracht um Teamk&auml;mpfe fairer und dynamischer zu machen.\r\n\r\nDie &Auml;nderung der [Q] ist hierbei zwar erst einmal notwendig gewesen, jedoch mit der Verringerung des Schadens f&uuml;r einen ADC fatal. Hier w&auml;re es sinnvoller den Schaden zwar etwas herunter zu setzen aber die Abklingzeit aufs Anf&auml;ngliche zu erh&ouml;hen. Dadurch w&uuml;rde sich der verringerte Schaden wieder aufheben und ein Escape f&uuml;r den Champion schaffen. Zumal da Kindred in offensiven Situationen stark eingeschr&auml;nkt wurde.\r\n\r\nDie &Auml;nderungen in der [W] ist hierbei eines der schlimmsten Ver&auml;nderungen f&uuml;r den Champ. Kindred und ihre Idee lebt von dem Heal. Zumal da ein Todesbringer schon etwas davon haben sollte. \r\nKlar ist es OP wenn sie f&uuml;r einen normalen Hit schon nen Heal bekommt. Hier sollte man dadurch eher den Heal an nen Kill von einem Belagerungsvasallen, Monster sowie Champions gekoppelt sein. Hierdurch schr&auml;nkt man den Heal ein aber erh&auml;lt den Grundchampion.\r\n\r\n\r\n\r\nEs ist sehr schade zu sehen dass man ein Champion so sehr in eine Rolle dr&auml;ngt und dabei sie immer mehr in die Rolle des assistierenden Junglers schiebt.\r\nHierbei sollte man auch immer daran denken das die [R] keinen Schaden macht und f&uuml;r beide Seiten vom Vorteil sein kann.","replies":[{"poster":"Shaco228","date":"2016-07-03T18:35:12.300+0000","up_votes":1,"down_votes":0,"body":"Es pass schon wenn man den Champ an die rolle des adc oder junglers an passt aber man sollte bedenken das kindred fast nichts mehr hin bekommt wenn man den im jungle oder als adc auf der bot lane spielen will, weill man die passive der  W (Blutrausch des Wolfes) entfernt hat da hat der Champ ja nichts mehr an Optionen als dauerhaft Defensive zu spiele  solange bis der Supporter oder andere team mitglieder schwächen da mit er die kills bekommt die er brauch da er noch weniger schaden sowie leben hat als andere adc's und da bei war es ja schon schlimm genug das man den couldown von der Q und der W verlängert hat.\n\nalso ich ich finde man sollte die Passive der W (Blutrausch des Wolfes) wieder rein machen weill man sonst das spiel nicht  mal Ansatz weise carryn kann da mann einfach nicht genug leben lifesteal mit kindred hat, außer man hat jetzt ((z.B. krasse ünbertreibung) z.B. 15 kill und der gegnerische adc 0-2 kill) dann wäre das was anderes aber das ist so unwahrscheinlich wie das Äpfel an denn Büschen wachsen.\n\nich sagte das jetzt mal als Kindred( lvl6) main\n\nund sorry für die ganzen recht schreib Fehler ;)","replies":[{"poster":"Chembaron Yamada","date":"2016-07-03T19:00:17.121+0000","up_votes":1,"down_votes":0,"body":"Als Jungle soll er Ganken, überraschend aus dem Nichts auftauchen und gemeinsam mit der Lane den Gegner zerpflücken. Das kann er auch weiterhin machen, auch ohne den Heal. Mal davon abgesehen, dass du wie jeder ADC es auch macht Lifesteal bauen kannst, um dein Leben zu regenerieren.\n\nKindred war ein zu starker Duellant, seine (für einen Schützen echt krassen) Base Stats zusammen mit dem Schadensausstoß hat die Zusammenarbeit mit der Lane oder ein Schwächen des Gegners gar nicht notwendig gemacht. Er konnte einfach Solo auf beispielsweise der Mid Lane auftauchen und den Gegner zerpflücken.\n\nDie Änderungen sind dazu da, dass er wie die meisten Jungler jetzt auf die Mitarbeit der Laner angewiesen ist und nicht mehr Solo alles auseinandernimmt.","replies":[{"poster":"Shaco228","date":"2016-07-04T13:16:28.951+0000","up_votes":1,"down_votes":0,"body":"Ja das ist schon richtig aber dann müsste z.B Jinx , Vayne oder auch Varus und Quin angepasst werden, weil gerade die am längsten immer noch alle solo auseinander nehmen können oder andere ADC's.","replies":[]}]}]},{"poster":"Chembaron Yamada","date":"2016-07-03T17:34:39.962+0000","up_votes":1,"down_votes":0,"body":"Es ist vollkommen in Ordnung einen Champion auf die Rolle anzupassen, für die er nun einmal konzipiert worden ist. Kindreds ganzes Gameplay ist auf den Jungle ausgelegt gewesen und das schon von Anfang an. \n\nAllein wenn man den Passiv betrachtet: Man erhält Stacks für das Töten von Champs und Jungle Camps. Wenn du als ADC in der Bot Lane unterwegs bist wirst du relativ selten an den Kruug auf der Top Lane rankommen, was schon einmal einen Stack weniger bedeutet. Auch das Auswählen feindlicher Champs wird auf die beiden feindlichen Bot Laner am Anfang reduziert, außer du gehst roamen (was du aber möglichst nicht mit dem Passivwechsel ankündigen solltest).\n\nKindred ist nach wie vor als ADC spielbar. Sicherlich ist er nicht optimiert für diese Rolle, soll er aber auch nicht sein. Optimiert sein soll er nur für seine zugedachte Rolle: Jungle","replies":[]},{"poster":"TerrorRaven","date":"2016-07-03T17:26:56.026+0000","up_votes":1,"down_votes":0,"body":"Kindred ist in erster Linie auf den Jungel ausgelegt und das von Anfang an. Das der Heal auf den W entfernt wurde ist zwar bitter, wurde aber durch einen Movement und Attackspeed-Slow gegen Jungel-Monster sinnvoll ausgeglichen.\n\nBei Release wurde sie in der LCS auch als ADC und in der Mid Lane gespielt, aber mit mäßigen Erfolg.","replies":[]}]}