{"poster":"Daeny13","date":"2017-03-23T20:08:03.556+0000","title":"Permaban e perché?","subforum":"Discussioni generali","up_votes":4,"down_votes":5,"body":"Secondo voi quale dovrebbe essere una punizione per i giocatori tossici? In passato sono stato uno dei giocatori pi&ugrave; tossici al mondo credo, essendo uno dei pochi insieme a Tyler1 ad essere bannato non per account ma praticamente per esistenza. Ogni account su cui giocavo veniva bannato e penso di aver fatto bannare almeno 10 account permanentemente. Adesso per&ograve; sono cambiato cos&igrave; come la mia mentalit&agrave;, e mi chiedo se sia giusto che il mio account sia ancora permabannato, perch&eacute; se voglio giocare posso comunque farlo con un altro account. \r\n&gt; Penso piuttosto che una punizione a lungo termine come un ban di 6 mesi o il ban permanente dalle ranked solamente possa risolvere la situazione in modo pi&ugrave; &quot;pacifico&quot; in quanto se il giocatore non ha intenzione di cambiare verr&agrave; permabannato la volta dopo mentre se ha voglia di cambiare come ho fatto io ha tutto il tempo per farlo. Personalmente con tutte le skin che avevo e col tempo che ci vuole ora a salire al 30 non ho nessuna voglia di farlo e secondo me bisognerebbe mirare pi&ugrave; alla &quot;rieducazione&quot; piuttosto che cacciare un player dalla community.","replies":[{"poster":"Dr LouD","date":"2017-03-23T20:18:26.046+0000","up_votes":10,"down_votes":1,"body":"Il permaban avviene quando la \"rieducazione\" a suon di chat ristrette e ban temporanei fallisce","replies":[{"poster":"Daeny13","date":"2017-03-23T20:20:37.415+0000","up_votes":1,"down_votes":0,"body":"A me ad esempio per cambiare non è servito altro che tempo, quindi invece di riempirmi di ban da 3 giorni l'uno datemene uno di 3 mesi, se voglio cambiare cambio se non voglio cambiare mi sono già fatto bannare altri 3 account e sono pronto a farmi bannare anche questo.","replies":[{"poster":"Dr LouD","date":"2017-03-23T22:03:37.585+0000","up_votes":5,"down_votes":1,"body":"Se non hai intenzione di cambiare la riot non ha piu alcun interesse a educarti, il permaban ci sta tutto","replies":[{"poster":"SiraGoesRawr","date":"2018-05-20T15:47:39.047+0000","up_votes":1,"down_votes":0,"body":"Il permaban esiste solamente a sfondo economico...non essendoci un altro gioco attualmente decente le persone perma bannate tornano comq su league of legends...e rispendono soldi per ricomprarsi skin ecc....il permaban dovrebbe esistere solo e soltanto per modifiche di gioco...(esempio cheat hack intentional fed ed altro) Se io ti insulto e tu non vuoi sentirmi, esiste il comando per mutare una persona....piuttosto....chiediamoci che cosa porta ad un player la voglia di insultarne un altro....troppo facile dire \"tu sei tossico e ti meriti il ban\" io ho avuto un account perma bannato...ma di certo non cambio modo di pensare xke la riot banna a random...se leggete le frasi che vengono considerate flame ci sta da ridere....appena esce un gioco decente curato meglio league of legends lo si disinstalla....","replies":[{"poster":"Dr LouD","date":"2018-05-20T15:56:15.005+0000","up_votes":1,"down_votes":0,"body":"Ma questo è un discorso da delirio totale\n\nLa gente non continua a giocare perchè non c'è altro.. di giochi bellissimi ce ne sono a centinaia\n\nLa gente continua a giocare anche dopo un ban perchè è drogata di questo gioco\n\nEd è l'esatto motivo per cui viene bannata, si è talmente drogati di questo gioco che insultate a destra e sinistra perchè volete sempre e solo vincere ad ogni costo\n\nFatevi una vita","replies":[]}]}]},{"poster":"Dissociated","date":"2017-03-24T11:09:07.828+0000","up_votes":3,"down_votes":1,"body":"secondo me la proposta di op è interessante. le persone, specialmente quelle giovani come lo sono gli utenti di lol, cambiano molto in fretta e per cause non direttamente legate alle punizioni. si cambia perchè il tempo passa. io dai ban da 1 anno o 6 mesi, ma sicuramente proverei la proposta di op.","replies":[{"poster":"WhiteToArcher","date":"2017-03-24T11:25:08.280+0000","up_votes":3,"down_votes":0,"body":"Dunque ritieni che, siccome League of Legends è frequentato da persone la cui maturità non è ancora formata, la Riot debba andare incontro ai giocatori notevolmente tossici e recidivi introducendo un percorso ulteriore di purificazione?\nIo mi preoccupo di come scrivo per non avere neanche la chat restrict, e poi ci dovrebbero essere persone con 10 permaban libere di scorrazzare nella landa senza alcun senso di colpa?  *No thanks.*","replies":[{"poster":"Drakethehero","date":"2017-03-24T13:22:17.655+0000","up_votes":1,"down_votes":0,"body":"purtroppo io mi schiero a favore del permaban: tutti devono imparare che per le azioni compiute ci sono delle conseguenze e che a volte non si può tornare indietro. Sto parlando di una cosa sacrosanta nella vita reale ed è giusto che anche dentro un gioco ciò venga insegnato.","replies":[{"poster":"verzulXdark","date":"2017-06-01T19:13:48.237+0000","up_votes":1,"down_votes":0,"body":"Questo è vero... ma permaban a volte sembra esagerato per me. Io vorrei come massimo tempo del ban 10 anni se poi si continua anche per 10 anni si fa permaban. So che 10 anni sono esagerati per alcuni ma sempre meglio di permaban. Scusate se posso dare fastidio io sto solamente dicendo la mia opinione","replies":[]}]}]},{"poster":"Daeny13","date":"2017-03-24T12:44:30.254+0000","up_votes":2,"down_votes":0,"body":"Evidentemente sei l'unico che ha capito quello che intendo. \nSecondo me una punizione come un ban di 6 mesi tratterrebbe i giocatori dal crearsi nuovi account ma piuttosto li costringerebbe ad aspettare 6 mesi. Una volta passati questi 6 mesi, se uno ha ancora intenzione di giocare probabilmente ha avuto tutto il tempo di digerire i propri errori e non farsi bannare più.","replies":[{"poster":"WhiteToArcher","date":"2017-03-24T13:47:23.619+0000","up_votes":2,"down_votes":0,"body":"Forse non hai ancora capito che non è necessaria una punizione per capire che bisogna comportarsi bene.\nLa riot é stata anche troppo paziente nei tuoi confronti.\nAllora visto che ritieni che serva del tempo per maturare il cervello, facciamo League of Legends accessibile solo ai maggiori di 18 anni (so benissimo che ci sono 18enni più bimbi di uno di 8 anni, ma é un esempio per estremizzare la questione).\n\nQuesto thread mi ha stancato, questo é il mio ultimo post qui.\nBuona fortuna nelle arene della giustizia.","replies":[]},{"poster":"verzulXdark","date":"2017-06-01T19:10:04.468+0000","up_votes":1,"down_votes":0,"body":"Non l'unico ciccio.... ci sono pure io.... secondo me il ban permanente non ci sta ,almeno questa è una mia opinione","replies":[]}]},{"poster":"verzulXdark","date":"2017-06-01T19:09:17.887+0000","up_votes":1,"down_votes":0,"body":"Quello che dico sempre io... ci starebbe come opzione. Rito pls!","replies":[]}]}]},{"poster":"PietroX96","date":"2017-03-24T14:19:28.799+0000","up_votes":2,"down_votes":1,"body":"dioooooo caro anche a me mi hanno bannato perma dopo un bann di 14 giorni ma non ho insultato nessuno ne flammato il mio team mi ha reportato solo perché ho fatto cagare in una partita","replies":[{"poster":"Dr LouD","date":"2017-03-24T14:38:40.308+0000","up_votes":3,"down_votes":1,"body":"Ne sei davvero così convinto? Dovresti avere la chat via mail dell'ultima partita che ti ha portato al ban, se la condividi posso vedere se è stata una punizione giusta o sbagliata","replies":[]},{"poster":"verzulXdark","date":"2017-06-01T19:14:53.164+0000","up_votes":1,"down_votes":0,"body":"è succeso una volta anche a me... poi mi bannano perchè non faccio nulla... invece a quelli che dicono: ti stupro la mamma opuure sai succhiare bene i cazzi ricchione non gli bannano....","replies":[]}]}]},{"poster":"Jeanne dˆArc","date":"2017-03-24T04:07:43.268+0000","up_votes":4,"down_votes":0,"body":"League of Legends non è un asilo, la Riot non è la tua maestra e tu non sei il bambino a cui devono stare appresso tutto il tempo. La Riot dà tante punizioni prima di arrivare al permaban, per cercare di rieducarti con le buone, ma se tu non lo capisci e continui a tirare la corda, alla fine questa si spezza e tu fai ciao ciao all'account. Non può stare ai tuoi comodi e aspettare mesi/anni perché tu ti renda conto di star sbagliando e che quello non è il modo in cui ci si dovrebbe comportare. \n\nIo non ho mai ricevuto punizioni, ma stai certo che se dovessi ricevere anche una semplice e banalissima restrizione chat per un paio di game, non scriverei più manco \"a\" in partita. Tu invece sei arrivato ad accumulare una decina di permaban, che sono una marea e ciò a sua volta si traduce in mesi/anni di comportamenti tossicissimi da parte tua, passati a rovinare i game a chissà quante centinaia di persone. \n\nMi spiace ma io non ti darei nessun'altra possibilità e bannerei qualsiasi account riconducibile a te, così da allontanarti definitivamente dal gioco. Un conto è chiedere una 2^ possibilità, un altro è chiedere 10 volte una 2^ possibilità.","replies":[]},{"poster":"WhiteToArcher","date":"2017-03-23T20:48:02.084+0000","up_votes":4,"down_votes":0,"body":"Nessuno garantisce che tu sia effettivamente cambiato.\nHai avuto tante possibilità, tutte andate in fumo a seguito di ciò che hai fatto.\n\nPunizione per esistenza che significherebbe di preciso? Ti viene permabannato ogni account che crei?\n\nHai affermato anche tu la eccessiva tossicità di cui ti sei macchiato.\nPersonalmente da un lato vorrei essere comprensivo aprendo una porta nei confronti di una persona che in astratto potrebbe quasi sempre cambiare, dall'altro lato penso a tutto ciò che tu potrai aver fatto per meritarti una punizione di tal gravità, e dunque ti chiuderei un portone.\n\nNon sempre tutto é pronto, quando ne hai bisogno.\nA volte le nostre azioni fanno si che una certa strada non sia più ripercorribile.\nLa soluzione potrebbe essere quella di imparare dagli errori e guardare avanti, ignorando quella strada ormai chiusa (League of Legenda in questione) e trovandone un'altra.","replies":[{"poster":"Daeny13","date":"2017-03-23T20:49:19.275+0000","up_votes":1,"down_votes":0,"body":"Lo so bene, mi sono fatto molti film su questo. Comunque ti posso assicurare che il permaban non viene dopo tante altre cose, molte volte ho ricevuto il permaban senza aver mai avuto un restrict o qualcosa del genere.","replies":[{"poster":"WhiteToArcher","date":"2017-03-23T20:59:42.089+0000","up_votes":1,"down_votes":0,"body":"Quasi sicuramente perché le tue condotte erano talmente gravi da giustificare un permaban in tronco. \nPotrebbe anche derivare da comportamenti recidivi, nel momento in cui poni in essere gli stessi comportamenti per cuo sei già stato bannato, beh in questo caso la Riot potrebbe anche agire prevenuta e infliggerti una punizione più grave rispetto ad un giocatore meno tossico.","replies":[{"poster":"Daeny13","date":"2017-03-23T21:06:54.303+0000","up_votes":1,"down_votes":0,"body":"E qual è il senso di questa cosa? Pensavo di aver lasciato le elementari molto tempo fa, non devo essere sculacciato perché esisto devo essere sculacciato perché ho sbagliato in modo da non ripetere gli errori, ma devo avere tempo per capire quali sono.","replies":[{"poster":"Banette VII","date":"2017-03-23T21:14:07.319+0000","up_votes":1,"down_votes":0,"body":"e 10 account dopo non l'hai ancora capito?","replies":[{"poster":"WhiteToArcher","date":"2017-03-23T21:33:58.947+0000","up_votes":2,"down_votes":0,"body":"Ripeto, le persone non aspettano in eterno che gli altri cambino.\n\nA te a quanto pare é stato dato anche parecchio tempo a disposizione per riflettere sui tuoi sbagli, ma non lo hai usato in maniera diligente.\n\nAdesso, sempre se il punto di vista della Riot non cambia, hai l'alternativa tra:\n- giocare in maniera precaria;\n- orientarti su uno degli altri milioni di giochi egualmente divertenti (anche più divertenti, a seconda dei gusti personali) presenti sul Web.\n\nSe devo essere sincero inoltre, penso che tu non sia completamente cambiato.\nLa tua ostinazione ed insistenza nel portare avanti questa discussione, senza dar peso al tuo passato (come se col fatto che tu sia cambiato venisse cancellato) fa presagire una carenza di maturità.\nNon sto dubitando che tu sia effettivamente cambiato, ma una persona che ci ha ragionato bene secondo me lascierebbe perdere dopo tutto ciò che é successo.\n\nCapisco che non é quello che ti vuoi sentir dire, ma é quello che penso.","replies":[{"poster":"Daeny13","date":"2017-03-23T21:37:59.157+0000","up_votes":1,"down_votes":0,"body":"A dirla tutta non ho mai detto di non meritarmi un permaban, anzi me li merito tutti, e se tu avessi letto bene sapresti che ho smesso di giocare per un bel po' di tempo prima di tornare. Ora semplicemente faccio schifo ma ho appena fatto due partite dove erano gli altri a flammare me perché tiltavano e io a dirgli che il game non è perso solo per la pick. \nSe io voglio giocare a lol sono libero di farlo, e stavo solo chiedendo l'opinione sul permaban.","replies":[{"poster":"WhiteToArcher","date":"2017-03-23T21:53:07.150+0000","up_votes":1,"down_votes":0,"body":">- giocare in maniera precaria;\n\nTi ho mai detto che non sei libero di giocare a League of Legends?\n\nNon hai ancora risposto alla mia domanda:\n>Punizione per esistenza che significherebbe di preciso? Ti viene permabannato ogni account che crei?\n\nQuesto perché sono io quello che non leggo ..","replies":[]}]}]}]}]}]},{"poster":"Frattaglia","date":"2017-03-23T21:24:20.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Daeny13,realm=EUW,application-id=MJVj50Jw,discussion-id=igli28lE,comment-id=00010000,timestamp=2017-03-23T20:49:19.275+0000)\n>\n> Lo so bene, mi sono fatto molti film su questo. Comunque ti posso assicurare che il permaban non viene dopo tante altre cose, molte volte ho ricevuto il permaban senza aver mai avuto un restrict o qualcosa del genere.\n\nIn quel caso i casi sono due:\n- hai comprato/rubato l'account, e questo viene bloccato, ma non è un permaban per comportamento quindi non rientra nella casistica\n- ti sei comportato in maniera ESTREMAMENTE tossica, intentional feeding o flame estremo, ma in quel caso dovrebbe scattare prima un ban di due settimane.\n\nSe è vero tutto quello che dici, propendo per la prima ipotesi.\n\nAd ogni modo ritengo che tra persone normodotate uno dovrebbe iniziare a pensare di cambiare atteggiamento già dopo le prime restrizioni sul primo account. Poi magari hai continuato con l'idea di fare il ribelle contro il sistema, però penso (spero) che tu sia arrivato alla conclusione che è un comportamento sbagliato nei confronti degli altri e controproducente nei tuoi confronti.","replies":[{"poster":"Daeny13","date":"2017-03-23T21:40:37.355+0000","up_votes":1,"down_votes":0,"body":"Nel periodo in cui ho fatto bannare più account molti me li facevo dare da persone che avevano smesso di giocare semplicemente perché non volevo ricominciare senza masteries, campioni e rune.\nIn ogni caso i miei atteggiamenti erano quasi sempre spinti da altre persone che feedavano, e quindi non da feeding mio. La mia posizione rispetto a queste restrizioni è sempre stata positiva, ho sempre cercato di migliorarmi e sapendo che ero nel torto ho anche chiesto che mi fosse disabilitata la chat, perché sapevo che sarei arrivato al permaban. Ma a quanto pare qui è l'asilo e quindi meglio permabannare così è più divertente perché devi ricominciare da 0. Per come la vedo io, il permaban dovrebbe essere o un addio definitivo alla community, quindi non è l'account ma il giocatore a doversene andare come nel caso Tyler1 oppure non deve essere permanente.","replies":[]}]}]}]},{"poster":"Laiho88","date":"2017-03-24T08:17:34.666+0000","up_votes":4,"down_votes":1,"body":"Hai idea di quanto bisogna essere tossici per beccarsi anche solo le chat ristrette?\nHai idea di quanto bisogna essere tossici per arrivare al ban temporaneo di 14 giorni?\nHai idea di quanto bisogna essere tossici per arrivare al permaban?\nHai idea di quanto bisogna essere tossici per ricevere un permaban diretto?\nHai idea di quanto bisogna essere tossici per arrivare a addirittura a far permabannare 10+ account?\nHai idea di quante persone abbiano abbandonato il gioco a causa di player come te?\n\nHai avuto tutte queste possibilità e adesso te ne vieni che forse i permaban sono esagerati?\n\nSe sei sicuro di essere cambiato apri un nuovo account e riparti da zero, ma preferirei che tu andassi su altri lidi oppure ti dedicassi a giochi single player, sarebbe meglio.....","replies":[{"poster":"Daeny13","date":"2017-03-24T12:47:05.921+0000","up_votes":2,"down_votes":1,"body":"A quanto pare qui sei tu a non avere idea di cosa significhi essere bannati, sicuramente lo sai meglio di me che i ban non riesco a contarli su 2 mani.","replies":[{"poster":"Laiho88","date":"2017-03-24T13:31:02.332+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Daeny13,realm=EUW,application-id=MJVj50Jw,discussion-id=igli28lE,comment-id=00060000,timestamp=2017-03-24T12:47:05.921+0000)\n>\n> A quanto pare qui sei tu a non avere idea di cosa significhi essere bannati, sicuramente lo sai meglio di me che i ban non riesco a contarli su 2 mani.\n\nEsattamente, non so cosa vuol dire essere bannati ma so cosa vuol dire passare 40 minuti ad essere flammati e insultati da player tossici, e cmq io valuto quello che hai detto, se dici che hai fatto permabannare 10 account io valuto questo....Poi puoi anche tornare a giocare, semplicemente riparti dall'inizio, di certo non è colpa mia che ti hanno permabannato più volte, così come nessuno ti ha costretto a comportarti male più e più volte...\nLe regole le conoscevi benissimo, ciononostante hai continuato a fare di testa tua....e non venirtene con un \" ma tu non sai cosa significa essere bannati\", ovvio che non lo so, non ho mai avuto punizioni ne a questo ne a qualsiasi altro gioco a cui abbia giocato perché ci sono dei limiti che non vanno superati....La giornata no capita a tutti, capita anche a me, ma se non ho mai avuto punizioni un motivo ci sarà.....","replies":[]}]}]},{"poster":"Chroniicles","date":"2017-03-24T13:32:22.732+0000","up_votes":2,"down_votes":0,"body":"Quello che ti è successo è ben diverso dal provvedimento che hanno preso (giusto per citare il tuo esempio) per Tyler1.\nIn quel caso, qualsiasi account fosse stato associato a lui sarebbe stato permanentemente bannato a prescindere dal suo comportamento.\nNel tuo caso, sei semplicemente intoppato nelle stesse punizioni, anche con account diversi (e non tutti tuoi per giunta, quindi non puoi nemmeno sapere quale fosse la loro \"reputazione\", ecco spiegato perchè non hai visto chat restricted o ban minori prima), perchè hai continuato a comportarti male.\n\nBannare un account per 6 mesi imho non è un buon deterrente. Il ban permanente spaventa molto di più, e di fatto non ti impedisce di crearti un nuovo account che, si spera, cercherai di tenerti più stretto.\nIl flamer occasionale (quello che magari ha tiltato male ma solitamente non flamma) difficile arrivi subito ad un ban, anche temporaneo, e difficilmente si rimetterà a flammare qualcuno dopo aver visto che le punizioni arrivano. \nIl flamer che ha appena finito di scontare il ban di 15 giorni, entra in game carico e si rimette a inveire contro i suoi compagni, non vuole cambiare e va punito adeguatamente","replies":[]},{"poster":"Orgazmico","date":"2017-03-24T10:43:20.792+0000","up_votes":2,"down_votes":0,"body":"il permaban è giustissimo in quanto incentiva il giocatore a cambiare nel suo comportamento e si da per scontato che ci tenga anche al tempo speso per arrivare a livello 30, piuttosto che le skin ottenute, amici trovati in game ecc. Motivazioni non da poco che dovrebbero spingere a mordersi la lingua o a pensarci due volte prima di scrivere qualcosa di offensivo nei confronti di altri che son li semplicemente per rilassarsi e divertirsi rendendo spiacevole la loro permanenza sul gioco. In quanto a te,la tua recidività e il \"son pronto a farmi bannare ancora\" posso solo dedurre che non te ne freghi nulla del divertirsi o migliorarsi, ma semplicemente giochi solo per sfogarti contro gli altri che non ti hanno fatto niente, la cosa positiva è che gli altri difficilmente giocheranno ancora con te e non nuocerai mai giocatori ai livelli più alti, mentre tu continuerai a creare nuovi account e a farti rodere il fegato. E comunque questo è il regolamento per una pacifica convivenza, sculacciate o meno va rispettato come nella vita reale se non ti va bene puoi lasciare il gioco e iniziare a collezionare francobolli","replies":[{"poster":"WhiteToArcher","date":"2017-03-24T11:15:53.974+0000","up_votes":2,"down_votes":1,"body":"severo, ma giusto.","replies":[]}]},{"poster":"Khail the Crow","date":"2017-03-23T23:02:07.351+0000","up_votes":1,"down_votes":0,"body":"Diminuire la punizione diminuisce il potere deterrente per i toxic players. Siccome sei anche stato recidivo, non vedo il senso di ridurre la punizione.\n\nOnestamente credo nella rieducazione come obiettivo. Il problema è che richiede risorse e controlli che la RIOT non può fare. Anzi, si potrebbe dire che il fatto di non permabannare al primo colpo sia già un sistema di rieducazione (salvo rari casi necessari per mettere in protezione la community) .\n\nIn effetti la RIOT ha le percentuali di giocatori che non sono più stati puniti dopo la prima punizione, e il sistema funziona su percentuali piuttosto alte.","replies":[{"poster":"Daeny13","date":"2017-03-24T12:49:46.248+0000","up_votes":1,"down_votes":0,"body":"Io non ho mai detto di diminuire la punizione, anzi lo considererei un aumentarla. Ban di 2 settimane > 4 > 2 mesi > 6 mesi > 1 anno > permanent darebbero il tempo di far cambiare le persone.\nPer cambiare ci vuole tempo.","replies":[{"poster":"Khail the Crow","date":"2017-03-24T13:10:26.080+0000","up_votes":1,"down_votes":0,"body":"Attenendomi a quanto scritto nel post originale, ho commentato di conseguenza. In quel caso si parla di eliminare il permaban.\n\nQuesta ultima proposta è comunque diminuire la punizione. Comunque potrebbe essere una strada percorribile. Cambia soltanto la rapidità con cui si arriva al permaban. \nSe è vero che hai fatto bannare almeno 10 tuoi account, non avrebbe comunque cambiato nulla circa la tua richiesta iniziale.\nSinceramente dubito che alla RIOT interessi mantenere degli account inattivi per 6 mesi o un anno. Per quello passano direttamente al permaban.\n\nTieni anche conto di quanto scritto qui: https://support.riotgames.com/hc/en-us/articles/207489286\n\nRiporto una parte del testo: \nDomanda: **BUT WHAT IF I REFORM? IS IT POSSIBLE TO GO DOWN THE ESCALATION PATH?**\nRisposta:   Yes! Players who show consistent reform or show positive behavior in their games will help heal their accounts reputation.","replies":[]}]}]},{"poster":"Darkinknight","date":"2017-03-24T12:21:20.403+0000","up_votes":1,"down_votes":0,"body":"Il permaban ci sta tutto..appunto perche la punizione non è solo esserre allontanato dal game per tot tempo..ma proprio perdere tutto,campioni elo rune skin soldi spesi ecc ecc\nCerto che,se si propendesse per un ban di tot mesi prima sarei anche d'accordo..i ban di qualche giorno e le chat ristrette sono inutili a prescindere..servono solo per avvertire il player che è vicino al permaban (e di solito ci casca lo stesso)\nIl permaban in ogni caso è praticamente piu difficile da avere che non da evitare (salvo utilizzo di account non propri)..quindi la persona che ne è soggetta merita in pieno di perdere tutto il suo account","replies":[]},{"poster":"Sarchiapon","date":"2017-03-24T11:49:35.386+0000","up_votes":1,"down_votes":0,"body":"La politica della RioT è che i ban sono permanenti. Se da un parte questo può voler dire soldi extra, perchè facilmente anche un permabannato con nuovo account finirà presto o tardi per ricomprare delle skin, d'altro canto per arrivare al ban uno dev'esser stato un flamer davvero impenitente e, beh, in questo caso poteva pensarci prima e darsi una regolata piuttosto che venire poi qui a dire che \"il permaban non è giusto\".","replies":[]},{"poster":"RGM Player","date":"2017-03-23T22:35:04.282+0000","up_votes":1,"down_votes":0,"body":"Non ha senso darti un ban di 3/6 mesi perché a te ci sono voluti 10 account per capire che non devi flammare. E per fare dieci account da zero saranno passati più di 6 mesi(almeno che non li hai comprati), quindi anche se ti avessero dato il ban da 6 mesi per il primo account, comunque saresti finito per farlo permabannare. La Riot da tante possibilità prima del permaban, ma se la gente non vuole migliorare in quel arco di tempo, allora il permaban è la punizione giusta. Così a forza di permaban, come nel tuo caso, la gente migliora oppure lascia il gioco.","replies":[]},{"poster":"SPX Levi","date":"2017-03-23T21:18:49.217+0000","up_votes":1,"down_votes":0,"body":"Ultimamente ero pure io toxic, sono arrivato alla chat limitata per 25 partite che sinceramente non mi ha cambiato nulla, poi è arrivato il ban da 2 settimane e fidati che ti cambia. A questo punto penso sia giusto il ban e se non si cambia permaban, peace","replies":[]},{"poster":"Dissociated","date":"2017-03-24T10:44:47.520+0000","up_votes":1,"down_votes":1,"body":"non ci avevo pensato, potrebbe essere una buona idea.","replies":[]}]}