{"poster":"I Smoke Dolphins","date":"2016-07-27T13:14:30.903+0000","title":"[SKIN CONCEPT] Darius Festa in Piscina","subforum":"Campioni e gameplay","embed":{"description":null,"url":"http://i.cubeupload.com/2eLgMb.jpg","image":null},"up_votes":2,"down_votes":2,"body":"Vi prego solennemente di creare questa skin a dir poco Stupefacente! &lt;3 Per quanto io odi darius questa skin mi ha fatto sbavare.\nAvevo anche diverse idee per gli effetti\n\nPassiva : Purtroppo per le stack non ho idee :c (potrebbero essere tipo bolle? non so)\nQ: Darius prende l&#039;orca di gomma per la coda e inizia a girare\nW: Darius afferra l&#039;orca a due mani per il prossimo autoattack\nE: L'orca apre la bocca, se un nemico viene colpito, lo azzanna trascinandolo a se\nUlti: Anche qui darius afferra l&#039;orca a due mani sbattendo la testa di quest&#039;ultima contro l&#039;avversario (si potrebbe anche aggiungere un effetto del tipo, l&#039;orca, anche se di gomma lol, apre la bocca oppure gli occhi si illuminano di rosso) provocando schizzi d&#039;acqua al posto di sangue.\n\nSpero che questo concept vi piaccia! IO LO ADORO","replies":[{"poster":"99White Terror99","date":"2016-07-27T16:56:28.398+0000","up_votes":1,"down_votes":0,"body":"E' BELLISSIMA!! per la passiva si potrebbe fare che crea tipo delle mini orchette carine e sorridenti che girano in tondo come le gocce di sangue e come stemma quando raggiungi le 5 cariche sopra si forma la sagoma di u'orca muscolosa con le braccia/pinne incrociate stra cazzuta, per l'ulti invece avevo pensato che si poteva fare che tipo l'orca prende vita ed quando ulti un tipo è come se si tuffasse con bocca spalancata sopra di lui","replies":[{"poster":"I Smoke Dolphins","date":"2016-07-27T21:16:53.090+0000","up_votes":2,"down_votes":0,"body":"Per la ulti sarebbe un effetto troppo bello...quasi da legendary...non credo vada bene, ma se creranno questa skin e metteranno questo effetto sarebbe carino! Per la passiva ci sta benissimo, quando raggiungi le 5 stack come stemma potrebbero mettere anche la faccia dello squalo di Jaws (ovviamente rivolta verso l'alto)","replies":[]}]},{"poster":"EmptyHole","date":"2016-07-27T14:13:35.766+0000","up_votes":1,"down_votes":0,"body":"Per la E si potrebbe fare che l'orca apre i denti e se colpisce un nemico lo azzanna trascinandolo a se","replies":[{"poster":"I Smoke Dolphins","date":"2016-07-27T15:20:45.670+0000","up_votes":2,"down_votes":0,"body":"Ottima idea! Aggiorno subito, grazie!","replies":[]}]},{"poster":"1NG Faabier","date":"2016-07-27T14:30:30.846+0000","up_votes":1,"down_votes":0,"body":"l'hai disegnata tu?\nse si,come hai fatto?","replies":[{"poster":"I Smoke Dolphins","date":"2016-07-27T15:20:25.258+0000","up_votes":1,"down_votes":0,"body":"Purtroppo no, non ti so dire nemmeno chi l'ha creata...sorry :(","replies":[]}]}]}