{"poster":"BlezuxGordoForro","date":"2018-12-21T18:38:55.751+0000","title":"El rp esta muy caro....","subforum":"Charlas Generales","up_votes":13,"down_votes":3,"body":"Esto de poner el Rp en DOLARES es muy malo para ARG muchos nos gusta gastar ciertas cantidades en nuestros juegos favoritos pero esto es otra cosa por comprar 2400Rp es lo que gasto en comprar comida para una semana, al menos sean dignos de salir a arreglar esto por que inhumano para la gente de bajos recursos. esto esta muy mal tanto para nosotros para riot por que si ya no ganaban plata ahora no van a ganar nada...{{champion:32}}","replies":[{"poster":"Rebkans","date":"2018-12-21T18:41:06.066+0000","up_votes":8,"down_votes":3,"body":"https://www.enriquedans.com/wp-content/uploads/2008/12/msie.jpg","replies":[]},{"poster":"Scärämänziä","date":"2018-12-21T21:05:35.479+0000","up_votes":3,"down_votes":0,"body":"La birra está cara... me voy hacer drama por RP.","replies":[{"poster":"Jeremías 17 5","date":"2018-12-22T02:22:05.056+0000","up_votes":1,"down_votes":0,"body":"El fernet esta caro.","replies":[{"poster":"Scärämänziä","date":"2018-12-22T02:34:26.365+0000","up_votes":1,"down_votes":0,"body":"ufff man 280 pe la promo con la coca, ya ni la bolsa de hielo te dan, re ratas","replies":[]}]}]},{"poster":"Salvor","date":"2018-12-21T18:56:49.645+0000","up_votes":3,"down_votes":0,"body":"> Riot no es consciente de ARG\n\nAntes Riot LAS era manejado por \"RiotChile\", ahora nos maneja LAN con \"RiotMexico\" según entiendo, imagínate que los argentinos les importamos mucho menos, o simplemente no tienen un buen panorama de lo que es Argentina.","replies":[{"poster":"Rox Tronco","date":"2018-12-21T20:24:21.683+0000","up_votes":1,"down_votes":0,"body":"Esto esta chequeado? noticion si rajaron a todos los inoperantes de antes.","replies":[]}]},{"poster":"Falkon","date":"2018-12-21T19:01:39.255+0000","up_votes":6,"down_votes":9,"body":"wow, Derrepente es obligatorio comprar RP.","replies":[{"poster":"Martin75","date":"2018-12-21T20:57:16.740+0000","up_votes":3,"down_votes":3,"body":"Cuidado,amigo, te van a llegar los negativos por decir algo que \"está mal\" para la mayoría de los jugadores...","replies":[{"poster":"Falkon","date":"2018-12-21T23:05:41.466+0000","up_votes":3,"down_votes":2,"body":"Y si es verdad lo que digo y si se ofenden deja que se ofendan, meten plata pero no piensan en comer.","replies":[]}]}]},{"poster":"zuperzer0","date":"2018-12-25T21:15:40.784+0000","up_votes":1,"down_votes":0,"body":"Riot tiene q pensar en bajar el rp o adiós rp más allá de q este caro no solo comida uno si o si debe gastar en comida pero rp con esos precios adiós rp rip rp etc","replies":[]},{"poster":"PCtronix","date":"2018-12-21T21:17:39.509+0000","up_votes":1,"down_votes":0,"body":"espera, tenia entendido que solo en ARG podian usar su moneda y para los otros paises seria inaccesible ... a la vez, conozco muchas personas que compraban RP desde ARG ya que salia mucho mas barato ( yo no pude hacerlo y cuando tuve la oportunidad lo sacaron ... ) pero si tu eres de ARG y dices que son dolares encuentro raro eso","replies":[{"poster":"Lán Zhàn","date":"2018-12-23T06:58:24.379+0000","up_votes":1,"down_votes":0,"body":"Decidieron cambiarlo por el tema de eso, que era más barato","replies":[]}]},{"poster":"Capheny","date":"2018-12-22T11:15:11.113+0000","up_votes":1,"down_votes":0,"body":"https://boards.euw.leagueoflegends.com/en/c/announcements-en/4ofsXeTV-rp-price-adjustment-for-players-in-the-uk\n\nTambién hicieron lo mismo en Reino Unido alegando el tema del Brexit\nTe aumentan el precio de cada opción pero cada una de ellas te da menos rp, lo cual desde el punto de vista de la gran mayoría es ilógico, exceptuando Riot\n\nAlguien me puede decir si en Argentina el agregado del IVA está incluido en el precio del paquete o al precio del paquete hay que agregarle IVA?\n\nPor ejemplo, si el paquete de 150 pesos (el más barato creo) se paga a ese precio o hay que pagar alrededor de 180","replies":[{"poster":"Lán Zhàn","date":"2018-12-23T06:57:31.810+0000","up_votes":1,"down_votes":0,"body":"En los precios de tarjetas que pone VISA creo que hay que ver el IVA\nPero los de Rapipago o tarjetas como naranja y eso ya les agrega el costo","replies":[]}]},{"poster":"Lucho9996","date":"2018-12-22T20:46:12.446+0000","up_votes":1,"down_votes":0,"body":"hoy me gaste creo q como 760 pesos para comprar rp aun no me llegan porque recien fui a pagar pero aun asi esta muy caro con 200 conseguias + de 2000 rp y ahora con 500 te dan 2450 rp es muy poco y muy caro {{sticker:sg-lux-2}}","replies":[{"poster":"Lucho9996","date":"2018-12-22T20:51:36.112+0000","up_votes":1,"down_votes":0,"body":"ademas si escribes en google USD te aparece para pasar dolares a peso argentino y supongamos 12,50 usd , en google son 474,18 pesos argentinos en lol 475.85 \n\notro 15  en lol 571.02 , en google 569,01","replies":[]}]},{"poster":"EclipseOfWinter","date":"2018-12-21T18:44:51.521+0000","up_votes":4,"down_votes":10,"body":"Riot acaso tiene la culpa de la devaluación de la moneda agentina?","replies":[{"poster":"BlezuxGordoForro","date":"2018-12-21T22:58:44.203+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=EclipseOfWinter,realm=LAS,application-id=v7qsfXsE,discussion-id=jBrQEuLx,comment-id=0001,timestamp=2018-12-21T18:44:51.521+0000)\n>\n> Riot acaso tiene la culpa de la devaluación de la moneda agentina?\n\nno es lo que digo, si no que no toman las medidas que tienen que estar por 25 te den 4280 cuando antes eran 6500 no se amigo creo que algo pasa...lo de dolares es ya algo molesto pero indigna que bajen tanto el rp por tan alto precio ","replies":[{"poster":"EclipseOfWinter","date":"2018-12-22T00:28:13.315+0000","up_votes":2,"down_votes":1,"body":"Eso que me estás poniendo son dólares? me estás diciendo que por 25 dólares te dan 4280 rp?\nEntonces no me parece mal, no jodamos están más a la par con el precio aquí en Perú que con esos 25 dólares tmbn llegas a los 4k, han tenido el rp más barato uds entonces y ahora está más nivelado.","replies":[{"poster":"AdcInANutshell","date":"2018-12-22T15:10:43.013+0000","up_votes":1,"down_votes":0,"body":"más barato desde tu punto de vista, pero para nosotros era un precio normal por nuestra economía, hasta ahora","replies":[{"poster":"EclipseOfWinter","date":"2018-12-22T17:32:46.504+0000","up_votes":1,"down_votes":0,"body":"SI estamos pasando el precio en dólares en ambas monedas y con la misma cantidad de dólares se compra la misma cantidad de RP entonces como dices que es más caro? han disfrutado de rp a menor precio durante un tiempo y ahora que se nivela con los demás países se quejan xd","replies":[{"poster":"AdcInANutshell","date":"2018-12-22T18:08:10.921+0000","up_votes":1,"down_votes":0,"body":"creo que no entendiste el punto","replies":[]}]}]}]}]},{"poster":"Salvor","date":"2018-12-21T18:58:33.026+0000","up_votes":3,"down_votes":0,"body":"Ya habían hecho un ajuste a finales de agosto, mira te dejo el Link:\nhttps://las.leagueoflegends.com/es/news/store/store-update/incremento-de-precios-en-argentina\n\nEl aumento que hicieron ahora directamente lo dejo a un precio absurdo, comparado con otros juegos incluso.","replies":[{"poster":"EclipseOfWinter","date":"2018-12-21T19:25:37.305+0000","up_votes":1,"down_votes":3,"body":"Si tanto les cuesta el rp, por que no piden a alguien de confianza de otro país que les recargue el rp?\n\nPueden comparar precios de los demás países de las, acabo de ver los precios en arg y la verdad si están caros, aquí con menos de 20 dólares cargo 2k de rp.","replies":[]}]},{"poster":"Lán Zhàn","date":"2018-12-23T06:52:14.072+0000","up_votes":2,"down_votes":0,"body":"EU por qué le ponen negativo si dijo la posta?\nEl precio se debe adaptar según el valor del dólar aquí. Sino sería más barato y conveniente que en otros países/ regiones causando que la gente aproveche y Riot pierda dinero.\nNos pusieron el mismo precio que en NA para no cambiarlo cada segundo por lo inestable que es el país.","replies":[]}]},{"poster":"Poro Travieso","date":"2018-12-22T04:18:52.825+0000","up_votes":1,"down_votes":0,"body":"En si deberian poner como caso especial a argentina por la devaluacion de la moneda asi que ni con el FMI que les hizo un multi millonario prestamo hasta ahora no mejora la situación","replies":[]},{"poster":"Poro Travieso","date":"2018-12-22T04:17:18.216+0000","up_votes":1,"down_votes":0,"body":"Deberia ser manejado por chile! por que ahora es manejado por mexico que absurdo{{sticker:sg-ahri-1}}","replies":[]},{"poster":"atpkiller","date":"2018-12-21T22:15:24.228+0000","up_votes":3,"down_votes":5,"body":"meh esta bien el precio del rp con toda la inflacion de argentina no ganan nada","replies":[]}]}