{"poster":"IIFireRoadII","date":"2016-11-17T12:55:18.524+0000","title":"Wichtig! Ständige Verbindungsprobleme aber nur Im Spiel auch Custome Games","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Ich habe seit dem ich meinen neuen Pc habe st&auml;ndig Probleme mit der Verbindung ingame. Das bedeutet das ich f&uuml;r mehrere Sekunden nicht sehen kann was mein Champion macht oder gar die Warnung kommt Verbindungsaufbau. Dennoch habe ich einen konstant bleibenden Ping von 30 und eine Fps Rate von 120 (gedeckelt). We&szlig; jemand wie man das Problem l&ouml;sen kann habe n&auml;mlich auch alle notwendigen Programme installiert wie Adobe Air etc. Des weiteren habe ich auch LoL auch deinstalliert und dannach neue installiert und gepatched doch das half auch nicht zu guter letzt habe ich mit dem Hextech Repair Tool ein letzten Versuch gestartet doch dieser Versuch ist misslungen. Danke schonmal im Vorraus","replies":[{"poster":"Crounty","date":"2016-11-17T12:59:22.863+0000","up_votes":2,"down_votes":0,"body":"Hast du es auch mal mit dem Beta Client ausprobiert? Hab nämlich gehört, dass der alte Client diese laggs verursachens oll","replies":[{"poster":"IIFireRoadII","date":"2016-11-17T13:29:45.342+0000","up_votes":2,"down_votes":0,"body":"Ja habe es mit dem alpha client und dem beta client probiert doch beides ging nicht aber danke","replies":[{"poster":"flamefighter001","date":"2016-11-17T13:35:18.522+0000","up_votes":1,"down_votes":0,"body":"Geht aber nicht nur dir so. Fast alle aus meiner Freundeliste(ca. 20 aktive Spieler) inklusive mir, haben auch dieselben Probleme. Jedoch erst seit dem Beta Client und das Ende des alten Clientes.\n\nlg flamefighter001","replies":[{"poster":"IIFireRoadII","date":"2016-11-17T13:44:50.567+0000","up_votes":1,"down_votes":0,"body":"ok gut zu wissen danke :) auf meiner fl hat das lustigerweise keiner^^","replies":[{"poster":"Génôs","date":"2016-11-18T16:24:19.446+0000","up_votes":1,"down_votes":0,"body":"Ich kann das auch bestätigen.  Seit ich mir den neuen Client runtergeladen habe bekomme ich ingame immer mal wieder kurze dc's. Aber auch wenn ich den alten wieder verwende habe ich diese dc's. Zuvor hatte ich auch nie Probleme mit meiner Verbindung. Ich hoffe Riot bekommt das in den griff.{{summoner:3}}","replies":[]}]},{"poster":"Fay Belmont","date":"2016-11-17T22:15:48.119+0000","up_votes":1,"down_votes":0,"body":"Kann es dann wirklich daran liegen, dass LoL gerade wegen viele Änderungen einfach überlastetet ist? Bei mir ging das Spiel seit ich meine neue Leitung bekommen habe immer ganz gut, aber sei ca. dem letzten Patch meine ich, geht es gar nicht mehr, ich Sterbe fast immer daran, wenn ich abhauen will, dass ich einfach stehen bleibe und zu sehe wie die Gegner mich einfach töten... und nein ich sage nicht, dass ich immer nur wegen den Lags sterbe.","replies":[]}]}]}]}]}