{"poster":"mysticalsoap","date":"2014-08-27T06:02:53.929+0000","title":"Low elos should learn to stop backtalking diamonds","subforum":"[ARCHIVED] Miscellaneous","up_votes":110,"down_votes":102,"body":"Low elos should learn to stop back talking diamond 1s or higher. If someone from bronze has an opinion that differs from a diamond 1's, the bronzie should NOT try to reason with the high elo. He shouldn't ask why either. He should take what the diamond says as fact without talking back. Too many times, I've seen a bronzie backtalk a diamond 1, and it's disgusting, because the bronzie is wrong most of the time. The only time a bronzie is right is when 500,000 bronzies are talking back to a single diamond 1. There's a reason why you're stuck in bronze. It's because you think differently than the diamonds. Start thinking like a diamond.\n\nEdit: RIP Rackier, you will not be forgotten. This thread is now a memorial to him, so please show respect.","replies":[{"poster":"Earl Eulrich","date":"2014-08-27T09:19:51.975+0000","up_votes":41,"down_votes":11,"body":"Almost never red anything more idiotic/arrogant before.\n\nArguments aren´t based on who raises them. Texts should be interpreted in almost any case without the author in mind....or to use Barthes words: \"the author is dead\". WIth your statement you most likely don´t have much live-experience, and no university/scientific-background...so I wonder how you can justify such arrogance. Disgusting.","replies":[{"poster":"mysticalsoap","date":"2014-08-27T10:58:00.914+0000","up_votes":11,"down_votes":30,"body":"I'd take medical advice from a doctor over a lawyer. I'd take League of Legends advice from a diamond over a bronzie.","replies":[{"poster":"Earl Eulrich","date":"2014-08-27T11:01:15.232+0000","up_votes":15,"down_votes":3,"body":"So if the doctor advices you to do some shirtless work-out against a fever and the lawyer advices you to rest a tad, make sure to drink enough and keep yourself warm you´ll go and follow the doctor. Just like I suspected.","replies":[{"poster":"mysticalsoap","date":"2014-08-27T11:40:46.934+0000","up_votes":4,"down_votes":23,"body":"So? What if the roles were reversed? We can talk about analogies all day, but listening to someone who is more knowledgeable about a certain topic makes complete and total sense.","replies":[{"poster":"Earl Eulrich","date":"2014-08-27T12:30:47.741+0000","up_votes":18,"down_votes":1,"body":"it doesn´t matter who makes an argument...just listen to the argument itself and then decide if it´s a good one or not.","replies":[]}]}]}]}]},{"poster":"Lumus Avatar","date":"2014-08-27T12:31:19.610+0000","up_votes":21,"down_votes":1,"body":"Disagree completely. People learn by asking, questioning, arguing. Being proven wrong will increase their understanding faster and more precisely. And you're missing the fact that sometimes a noob has just happened to notice something that a master has been too close to to realize. Listen to the \"Bronzies,\" They'll surprise you. And stop trash-talking about players. It doesn't matter if they're Diamond, Bronze or a first-time player. Everyone has potential to be great AND the potential to be an arrogant piece of crap, and right now you sound like the latter. So stop bringing shame to High ELO players with your hateful words and start helping Low ELO players get better.","replies":[]},{"poster":"Lénekton Bot","date":"2014-08-27T11:12:07.825+0000","up_votes":24,"down_votes":5,"body":"Who the hell let GD crap come to Boards?","replies":[{"poster":"Pryotra","date":"2014-08-27T17:34:43.456+0000","up_votes":10,"down_votes":1,"body":"This is what I predicted would happen. GD was down for a long time, and this is the advertised forum, so naturally the filth would start moving here.\n\nWhat I'm not surprised about is that this thread proves everything I've said about this system being bad for this community.  Riot catered to the circlejerk, and now it's too powerful to stop. We need moderators that we can call upon, and frankly this system isn't doing any better than vbulletin did. I hope Tamat's team is ready, because in the coming days, it's going to get worse.\n\nWhat can I say? I calls it like I sees it.","replies":[]}]},{"poster":"ChickenWrap","date":"2014-08-27T08:20:40.528+0000","up_votes":25,"down_votes":6,"body":"I can't believe this post got this many upvotes when it's not only a troll post, but it's clearly meant to be offensive.\n\nGD I understand, but I thought the boards were better than that.","replies":[]},{"poster":"Summoners Raft","date":"2014-08-27T11:45:06.586+0000","up_votes":17,"down_votes":2,"body":"Your youth is showing...\n\nIf you want someone to think like Diamond, you had better be ready to explain the \"whys\" of everything.  Someone who is asking why, is the person you should respect the most, not the lackey who just accepts everything at face value without proper explanations and reasoning.  \n\n Also, who says they are \"stuck\" in bronze?  Maybe they are passing through bronze just like you did at one point!  \n\nThe reason you are stuck at \"immature\" is because you think differently than adults.  Start thinking like a mature adult!  (see what I did there?)\n\n\"Give a man a fish and he will eat for a day, teach a man to fish and he will eat for a lifetime!\"  Be a teacher, and you will earn the respect of those around you!","replies":[]},{"poster":"Vibrant Lulu","date":"2014-08-30T05:37:41.387+0000","up_votes":9,"down_votes":0,"body":"Ayyy lmao","replies":[]},{"poster":"Janna F Kennedy","date":"2014-08-30T05:29:57.093+0000","up_votes":9,"down_votes":0,"body":"+1","replies":[]},{"poster":"Splitpushing","date":"2014-08-29T00:56:52.950+0000","up_votes":10,"down_votes":1,"body":"a lot of people here type like they have low intelligence... i think gd is better","replies":[{"poster":"mysticalsoap","date":"2014-08-29T04:20:36.388+0000","up_votes":8,"down_votes":1,"body":"People take themselves a lot more serious on here than GD. Pretty silly because if you are serious 100% of the time it sucks. Especially on a forum.","replies":[]}]},{"poster":"Void Spirit","date":"2014-08-27T12:01:21.224+0000","up_votes":8,"down_votes":0,"body":"Understanding how the game work is what make you strong, if you say that BotRK is good on Zed and can't explain why. Then you have no right to reject someone else opinion.","replies":[]},{"poster":"JackRotto","date":"2014-08-27T10:53:13.980+0000","up_votes":8,"down_votes":0,"body":"Anyone makes mistake but you can not blame all bronze or silver players  because of 1 troll. I admit diamond players are more skillful than bronze or silver players but they do some stupid mistakes as well since we are all humans.  Being a challenger or diamond player does not give you an authority to discriminate others by saying \"...stop back talking diamond 1s or higher\".","replies":[{"poster":"Zyorhist","date":"2014-08-27T15:46:14.786+0000","up_votes":3,"down_votes":0,"body":"Higher tier players are more skilled, I agree with that, but they are more skilled at applying the same strategies you see at all tiers of play.  This means that what anyone has to say can be valid.","replies":[]}]},{"poster":"CommandShockwave","date":"2014-08-27T19:15:07.026+0000","up_votes":10,"down_votes":2,"body":"MAYDAY, MAYDAY, GD SHITPOST DETECTED IN QUALITY CONTENT ZONE. PURGING PROCESS INITIALIZED. \n\nhttp://i.imgur.com/zbhkrcN.gif","replies":[]},{"poster":"mi ramfan","date":"2014-08-27T13:35:54.079+0000","up_votes":7,"down_votes":0,"body":"If you can explain why you believe what you believe, and it makes sense, then I'll listen.\n\nBeing high elo gets you more credibility, but it doesn't automatically make you right.","replies":[]},{"poster":"YwP987Eu8i","date":"2014-08-27T21:24:36.692+0000","up_votes":7,"down_votes":1,"body":"le epik gd mey mey xD xD lmao","replies":[]},{"poster":"Sunfield","date":"2014-08-27T07:39:39.763+0000","up_votes":9,"down_votes":3,"body":"And this is what happens when GD is down","replies":[]},{"poster":"BogaczPL","date":"2014-08-27T06:04:50.297+0000","up_votes":17,"down_votes":11,"body":"+1 agreed fellow summoner","replies":[]},{"poster":"Humorous Lulu","date":"2014-08-30T05:46:18.885+0000","up_votes":5,"down_votes":0,"body":"Let me say this unequivocally. You are a living God here.","replies":[]},{"poster":"Athryil","date":"2014-08-27T16:17:41.040+0000","up_votes":5,"down_votes":0,"body":"Diamonds should not talk to lower elos with arrogance and superiority. It just makes us not like you.","replies":[]},{"poster":"ShyRaven","date":"2014-08-27T07:04:42.078+0000","up_votes":5,"down_votes":0,"body":"But, all Diamonds started out as bronzies like the rest of us ;c","replies":[]},{"poster":"Dom1nati0n","date":"2014-08-27T15:26:44.827+0000","up_votes":3,"down_votes":2,"body":"It seems to me that someone has made OP absurdly butthurt.  One might even say...Butt-furious.  \"Too many times I've seen a bronze backtalk a diamond 1\"  How many situations does one in fact, get into where this is a reoccurring theme in conversation?  I must know.  As I feed this troll.","replies":[{"poster":"mysticalsoap","date":"2014-08-27T20:30:20.192+0000","up_votes":7,"down_votes":2,"body":"I'm so butt-mad right now man. YOU DON'T EVEN KNOW!","replies":[]}]},{"poster":"DiavaI","date":"2014-08-27T06:09:14.295+0000","up_votes":16,"down_votes":11,"body":"quality post +1 low elos are shit","replies":[]},{"poster":"GundayMonday","date":"2014-08-27T16:39:46.669+0000","up_votes":4,"down_votes":0,"body":"Don't agree at all. I'm a diamond player and have no trouble admitting that I do not know everything about this game. Actually learned a few tricks from my bronze/silver/gold/platinum pals over the past year. If the bronze player has good points supported by reasoning, then there's no reason the diamond player shouldn't at least think for a second and consider their point of view.\n\nThat said, if the bronze opinion is \"This is a thing because it's OP\" and nothing more, then yeah, they're probably full of it.","replies":[]},{"poster":"Sewer Rat","date":"2014-08-27T16:05:12.929+0000","up_votes":4,"down_votes":0,"body":"Yay, copy/paste'd straight from the great Rackier himself.","replies":[{"poster":"mysticalsoap","date":"2014-08-27T20:29:10.704+0000","up_votes":5,"down_votes":2,"body":"Dude! If you give away my secrets no one will bite.","replies":[]}]},{"poster":"Willahelm Fulber","date":"2014-08-27T14:48:47.887+0000","up_votes":4,"down_votes":0,"body":">\"Nonsense remains nonsense, even when talked by world-famous scientists.\"\n>-Oxford Dictionary's John Lennox, on the topic of Stephen Hawking trying to prove the trivia of God.\n\nA little backstory for this quote for those who don't know:  in Hawking's book, *The Grand Design*, he argues that :\n>\"for a law such as gravity to exist, the universe can and will create itself.\"\n\nTo which John Lennox responds:\n>\"[Hawking's] attempts to explain how, exactly, the big bang emerged from a state of nothingness required an understanding of physics that was beyond me. \"If you are not a math head,\" he concedes far too late in the proceedings, \"this may be hard to understand.\" Indeed.\nSo, like its alternative, belief in Hawking's premise is an act of faith.\"\n\nWhen I see your complaint about \"bronzies,\" being the \"worst\" players, I think about that first quote.  There is always something more to know; for instance, I thought myself knowledgeable about riven as a riven main a couple years back, but then I learned she could jump walls...","replies":[]},{"poster":"CaptainMårvelous","date":"2014-08-27T07:59:26.077+0000","up_votes":12,"down_votes":11,"body":"Actually bronze players are the better players. You see, Bronze players have enormous champion pools whereas diamond players stick to what seems to be best at the moment. Along with this Diamond players will often fall for wukong jukes...but you arrive at the fascinating fact that Bronze players NEVER fall for a wukong juke for they keep attacking. And, above all, we must assert that diamond and up players are often wrong. Do you not remember the time when Doublelift said Draven was trash...and then got absolutely destroyed by a Draven player? (I think it was WildTurtle but I forget).\n\nPerhaps Diamonds need to stop asking Bronze players to 'get better' and instead re-evaluate their entire lives. Because \"thinking like a diamond\" means filling your head with rocks, as a diamond is a rock.","replies":[{"poster":"Tyverus","date":"2014-08-27T11:31:23.453+0000","up_votes":4,"down_votes":0,"body":"> Actually bronze players are the better players. You see, Bronze players have enormous champion pools whereas diamond players stick to what seems to be best at the moment. Along with this Diamond players will often fall for wukong jukes...but you arrive at the fascinating fact that Bronze players NEVER fall for a wukong juke for they keep attacking. And, above all, we must assert that diamond and up players are often wrong. Do you not remember the time when Doublelift said Draven was trash...and then got absolutely destroyed by a Draven player? (I think it was WildTurtle but I forget).\n> \n> Perhaps Diamonds need to stop asking Bronze players to 'get better' and instead re-evaluate their entire lives. Because \"thinking like a diamond\" means filling your head with rocks, as a diamond is a rock.\n\nThis^ since diamond imo is mostly play whats best (or your best) 90% of the time, in lower elo's people are more available to trying newer strats/champs that yes, dont work in every situation, but really shine in some niche ones that you just dont see in higher games. after reading the op all i got from \"think like a diamond\" is \"stop resisting, play the fotm, join usssssss\"","replies":[]}]},{"poster":"MyAccountYouGuys","date":"2014-08-27T19:23:23.471+0000","up_votes":3,"down_votes":0,"body":"Gr8 b8 m8, I r8 0/8.\n\nYou have a point buried in here somewhere that may actually have some merit but *hooooo BOY* is your presentation off.","replies":[]},{"poster":"Dragonface","date":"2014-08-27T13:43:22.975+0000","up_votes":3,"down_votes":0,"body":"Let's be real here, most diamond players don't get the respect they want because they don't deserve it.  When you come into a game and bitch out a bronze player because he accidentally gave up first blood then the diamond player rides on that fact the rest of the game, of course we're not going to respect nor listen to you.  I have yet to meet anyone above Gold who isn't completely arrogant and self-centered, saying how good they are and how much everyone else sucks.  They act like they're the biggest thing to ever hit League of Legends since Walshy hit Halo 2.  It's ridiculous.  Learn some humility.  Understand that saying \"OMFG YOU SUCK NOOB GET BETTER\" doesn't mean I'm going to get better.  Explain how you would have done the situation and help that way.","replies":[]},{"poster":"Wullf","date":"2014-08-27T06:10:46.633+0000","up_votes":7,"down_votes":9,"body":"Though you may have a truth I do not like this hatered.\n\nYou sound a bit like some fanatic. \n \n> He shouldn't ask why either\n\nOf course he should, how else is he gonna learn?\n\nJust my opinion. I do understand your anger.","replies":[{"poster":"Colonel J","date":"2014-08-27T06:36:51.965+0000","up_votes":5,"down_votes":2,"body":"Shut up, you.","replies":[]}]},{"poster":"rdeVpUgyFO","date":"2014-08-27T08:57:48.367+0000","up_votes":3,"down_votes":5,"body":"Hate Bronzies. Why don't they just get good?","replies":[{"poster":"mysticalsoap","date":"2014-08-27T11:03:57.071+0000","up_votes":4,"down_votes":8,"body":"It's not about hating them, just having them know their place.","replies":[{"poster":"Dragonface","date":"2014-08-27T13:50:58.164+0000","up_votes":4,"down_votes":0,"body":"Yess massa, I'll be doin wut u say massa, i dun need no infonimation massa, i knows my place massa.","replies":[]}]}]},{"poster":"0101101001100100","date":"2014-08-27T14:06:54.217+0000","up_votes":2,"down_votes":0,"body":"THE UNRANKED PLAYER IS THE DEADLIEST{{champion:238}}","replies":[]},{"poster":"Daishø","date":"2014-12-11T04:13:40.157+0000","up_votes":3,"down_votes":1,"body":"This is the most arrogant and idiotic post I have ever read. Everytime when I play a game, if there is a diamond in that game, all I see in the fuckin chat is, \"why do you guys suck so much\" and \"man, you guys are fuckin terrible ff at 20\" EVEN IF WE ARE FUCKIN WINNING, AND ONE LANE GAVE UP FIRST BLODD!!!!!!!!! Diamond players aren't always the best, most of the time honestly, they were boosted. and just because your a diamond, doesn't mean you know every single tip and tricks to \"mastering\" the game, I've been in plently of games where im with diamonds, and they get destroyed by the opposing lane. And also, i would never want to think like a diamond, because then, i would become a selfish pain in the ass, douchbag. Just explain to lower elos what they are doing wrong, and if they do it again, then just ignore them, finish the game, and start another.","replies":[]},{"poster":"Lewd Neeko","date":"2014-08-27T21:55:54.074+0000","up_votes":3,"down_votes":2,"body":"Oh. Stuff from the GD is coming over here? Ridiculous.","replies":[{"poster":"mysticalsoap","date":"2014-08-27T22:59:37.406+0000","up_votes":4,"down_votes":2,"body":"not really, they are a click away from each other","replies":[]}]},{"poster":"SharbyQue","date":"2014-08-27T13:53:03.651+0000","up_votes":4,"down_votes":2,"body":"+1\n{{summoner:4}}","replies":[]},{"poster":"KaellrusQT","date":"2014-08-27T06:24:02.199+0000","up_votes":4,"down_votes":2,"body":"nice meme","replies":[]},{"poster":"Colonel J","date":"2014-08-27T06:32:08.619+0000","up_votes":3,"down_votes":3,"body":"***","replies":[{"poster":"mysticalsoap","date":"2014-08-27T06:42:33.343+0000","up_votes":5,"down_votes":3,"body":"You misspelled mysticalsoap and +1","replies":[]}]},{"poster":"ButtersBBG","date":"2014-08-27T07:24:30.727+0000","up_votes":3,"down_votes":3,"body":"\"Start thinking like a diamond.\"\n\nI'll 1 up, start thinking like a Challenger.","replies":[]}]}