{"poster":"YtubeBlackCalvin","date":"2015-04-09T20:19:10.249+0000","title":"Hat jemand Interesse daran?","subforum":"Streams & YouTube","embed":{"description":"My top LOL(Leauge of Legends) Fails I hope you have fun and have a nice day summoner","url":"https://www.youtube.com/watch?v=Q50Z5DKCA8g","image":"http://i.ytimg.com/vi/Q50Z5DKCA8g/hqdefault.jpg"},"up_votes":1,"down_votes":1,"body":"Ich guck ab und zu solche witzigen fails von lol spielern auf youtube an und dachte mir \r\nCalvin du bist manchmal echt doof aber es ist auch witzig nimm es auf und stell es auf youtube.\r\n\r\nnun meine frage w&uuml;rdet ihr euch sowas angucken fails oder gute plays von mir eventuell auch von anderen hauptsache es ist witzig oder nice?\r\nDanke f&uuml;r jede Kritik oder antwort ^^","replies":[{"poster":"Black Mage","date":"2015-04-09T20:35:27.745+0000","up_votes":1,"down_votes":1,"body":"Witzig finde ich generell \"fail plays\" nicht (jedenfalls in mobas nicht, wenn welche gut sind, dann Doto plays meistens, aber eher die Außnahme).\n\nHabe mir das Video angeschaut und sehe darin nichts besonderes, nur einen Spieler der noch viel zu lernen hat/viele Missplays hatte -> bronze 5 live is \"interessanter\".\n\nWenn du solche Videos online stellen willst, dann empfehle ich es dir die Stimmlich zu unterlegen, da dies VIEL besser rüberkommt + wenn man eine geile (Radio-)Stimme hat, dann ist das ein weiterer Grund diese zu teilen","replies":[{"poster":"YtubeBlackCalvin","date":"2015-04-09T21:18:03.808+0000","up_votes":1,"down_votes":1,"body":"was für noch viel zu lernen jeder macht fails sogar in der lcs macht die miss flashes usw und kannst ja an den stats lesen das ich viel besser bin als die  und das mit der stimme unterlegen  hab ich im moment nicht vor ich hab mir bei dem video ein beispiel an die fail videos von machinima realm genommen und nicht bronze 5 silber 4 ^^  und es geht ja um die die fail plays in lol mögen aber trotzdem danke ^^","replies":[{"poster":"Black Mage","date":"2015-04-09T22:03:51.678+0000","up_votes":1,"down_votes":0,"body":"> was für noch viel zu lernen jeder macht fails\n\ngenau das ist die sache, fails sind nicht interessant, wenn dies jeder machen kann, ich habe dich auch nie als schlechten spieler bezeichnet!!!\n\nZitat: \n> Habe mir das Video angeschaut und sehe darin nichts besonderes, nur einen Spieler der noch viel zu lernen hat/**viele Missplays hatte **\n\nich sagte dort eindeutig das es einfach eigentlich nur missplays sind von einem Spieler! Und wenn man dies hindereinanderreiht wird daraus nichts besonderes, sondern viel eher \"na und?\"\n\nBei \"Big\"plays oder auch \"Miss\"plays muss man dem Zuschauer unter die Nase reiben \"was kommt den nun für ein Spielzug?\" und dann kommt etwas was klar nach einem Aussehen könnte, aber dann schlägt auf einmal das Ruder um und aus dem vermeintlichem Big/Missplay wird das jeweilige andere Play -> Überraschungseffekt beim Zuschauer und es ist Unterhaltsam...\n\nBei dir kommt eigentlich nur die Stimmung \"was soll ich hier? ich kann genauso gut bronze 5er zuschauen, wobei... die sind interessanter, da dort auf einmal alles gedreht werden kann wegen irgendeinem Fehler eines Spielers und BÄM ist das Spiel gedreht, mal schauen ob sich die erholen können\"  und und und...\n\n\nStell dir die Frage: willst du 200 verschiedene Wasserflaschen haben, alle in der selben verpackung und dann raten welches besser ist und wieso (alles ist still), oder willst du sehen wie wasser gefördert wird und vermarktet?  Also ich stell mir eine Dokumentation viel spannender vor, mit allem rum und dran, als nur das endergebniss, genauso wie in solchen \"plays\", denn für ergebnisse reicht mir der endscreen","replies":[{"poster":"YtubeBlackCalvin","date":"2015-04-10T13:57:58.911+0000","up_votes":1,"down_votes":0,"body":"kennst du machinima realm? da machen auch fail plays usw und das gucken auch viele hunderttausende nur weil du fail plays nicht witzig findest heißt es ja nicht das es andere nicht mögen  es ging an die die fail plays witzig finden und verbesserungs vorschläge haben und nicht an leute die failplays unnötig und langweilig finden","replies":[{"poster":"Black Mage","date":"2015-04-10T14:02:58.931+0000","up_votes":2,"down_votes":0,"body":"schau deren plays an, da ist alles gegeben, und dann schau deine an, wo nur der fail exestiert, vergleiche dich nicht mit jemanden der weiß was er macht","replies":[{"poster":"YtubeBlackCalvin","date":"2015-04-10T15:42:01.808+0000","up_votes":1,"down_votes":1,"body":"ich will ja nicht exakt das selbe machen  wäre ja unnötig zweitens deswegen hab ich ja gesagt tipps geben aber ich brauche tipps von leuten die es gerne gucken und nicht von leuten die es generell nicht witzig finden und nicht gucken denn dann bringen mir deine \"tipps\" nichts","replies":[{"poster":"Black Mage","date":"2015-04-10T17:10:33.645+0000","up_votes":2,"down_votes":0,"body":"WUT!!``!??!?!?!?\n\nAlso versteh mich nicht falsch, aber was du gerade abgegeben hast ist totaler BS, denn diejenigen die es \"gut\" finden, werden dies auch gut finden, jedoch ist der anteil gering as hell und wenn du dich auf diese leute eingehen würdest, dann geschieht genau das NICHT, was du vlt gerne haben möchtest: es wird einfach keiner kommen (jedenfalls niemand neues, und vlt verschwinden viele weil es denen nicht mehr passt?) und deine videos sind wertlose datenpakete im World Wide Web....\n\n\nAlso mit dieser Qualität kommst du nicht weiter, punkt, basta.\n\nOb du jemanden \"abschauen\" willst, oder nicht, ist egal! Denkst auch das alles was im Moment im trend ist \"neu\" und total \"ungebraucht\"?\n\nAlso bitte, willst etwa mit deiner Logik nie mehr den buchstaben \"a\" schreiben, weil jeder den in deutschland benutzt und somit zu mainstream ist? ach, ich meine: \"lso bitte, willst etw mit deiner Logik nie mehr den buchstben \"\" schreiben, weil jeder den in deutschlnd benutzt und somit zu minstrem ist?\"\n\n\nEs kommt drauf an wie du es machst, wenn du besser als die Konkurrenz bist, dann scherrt es KEINEN ob du das selbe machst!","replies":[{"poster":"YtubeBlackCalvin","date":"2015-04-10T20:42:00.652+0000","up_votes":1,"down_votes":1,"body":"du laberst so einen müll ey xD wie alt bist du 14? es geht nicht um trend denn das ist nicht im trend und wie ich schon sagte es geht um  die leute die sich für sowas interesieren um mehr nicht","replies":[{"poster":"Black Mage","date":"2015-04-10T21:09:06.163+0000","up_votes":1,"down_votes":0,"body":"dann komm nicht in ein forum, frag dort nicht um die meinung anderer...\n\naußerdem nenne ich dir gründe wieso dein video SCHLECHT rüberkommt, was gemacht werden sollte um es auf ein Niveu zu bringen, welches andere dazu bringt sich diese video sich anzuschauen, und und und...\n\nwenn du schon keine argumente bringen kannst, dich nicht richtig äußern willst/kannst (weil die schulbildung und die erziehung nicht gegriffen hat) dann schreib nicht einen stutz und komm auch nicht mit einem altersargument, welches aus der luft gegriffen ist... \n\n>  wie ich schon sagte es geht um die leute die sich für sowas interesieren um mehr nicht\n\nsagst du nur weil du mit kritk nicht umgehen kannst, denn bis jetzt kam keine einsicht (und ich bin mir ziemlich sicher das ich keinen stutz erzählt habe, denn das video IST minderwärtiger als die konkurrenz/viele andere, die sich einen hauch mehr mühe gegeben haben als jeweils 3 minuten bildmaterial, maximal, von irgendwelchen spielen zusammenzuschneiden zu einem wirrwahn) und nur abschiebungen.\n\nich gebe dir den tipp: suche nie mehr in deinem leben ein forum auf und schreibe darin, denn das geht ja garnicht was du hier abgibst. Diskussion  sieht anders aus, als nur Kritik und tipps mit \"dich habe nicht gefragt\" und \"du gehörst nicht zur zielgruppe, welche ich ja garnicht vorher bestimmt habe, dazu\".","replies":[]}]}]}]}]}]}]}]}]},{"poster":"HHaie tabbian","date":"2015-04-10T15:07:40.257+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir nicht empfehlen, so etwas aufzunehmen, wenn du teilweise 10 fps hast. Da kriegt man Augenschmerzen.","replies":[]}]}