{"poster":"Rang3k1ng163","date":"2019-01-19T11:30:19.240+0000","title":"Brauche Hilfe beim Thema Streamen","subforum":"Streams & YouTube","up_votes":1,"down_votes":0,"body":"Hallo Zusammen.\r\n\r\nMeine Aktuelle Hardware vorweg:\r\n\r\nCPU: Intel Core i5 4460 --&gt; 3,2GHz mit 4 Kernen\r\nGraKa: NVIDIA GeForce GTX 1070\r\n8GB RAM\r\nMainboard: ASRock H97 Anniversary\r\nOS: Windows 7 Pro x64 (einfach nur weil ich nicht abnabeln kann)\r\nInternet: 2Mbit Upload/20Mbit Download\r\nOpen Broadcast\r\n\r\nHab jetzt ein paar mal versucht zu streamen aber ich bekomme immer FPS/Ping Drop, vorallem FPS.\r\nEs ist f&uuml;r mich dann im Game so dass sich der Bildschirm f&uuml;r 0,25 Sekunden(gesch&auml;tzt) in sehr langsam bewegt und dann wieder f&uuml;r 0,25 Sekunden sehr schnell. Ausserdem kann es leicht passieren dass das Bild bei Teamfights o.&auml;. anf&auml;ngt zu stottern/FPS drop unter 10.\r\n\r\nIch habe den PC vor ca 4 Jahren nur f&uuml;rs Zocken gekauft und daf&uuml;r reicht er jetzt auch noch easy. Ich weiss nur nicht ob ich jetzt f&uuml;r Streamen falsche Einstellungen getroffen habe, im Open Broadcast, dass es nicht funktioniert oder ob meine Hardware einfach zu schlecht ist.\r\n\r\nEin Freund hat mir gesagt meine CPU hat zu wenig Kerne. Hab mich jetzt auch im Internet schlau gemacht und da werden &quot;Streaming PC&#039;s&quot; fertig verkauft um 500&euro; die nen Prozessor mit 3,5GHz und 2 Kernen haben(What?).\r\n\r\nGro&szlig;e Verwirrung auf jeden Fall bei mir. K&ouml;nnt ihr mir helfen?\r\n\r\nIch w&uuml;rde einfach gerne Streamen k&ouml;nnen.\r\nWenn ich dazu einen neuen PC kaufen muss w&auml;re mir ein Fertiger lieber, wie dass ich die Einzelteile selber zusammenkleben  muss (hab ich schon hinter mir).\r\nDer PC darf die 500&euro; Nat&uuml;rlich &uuml;berschreiten. Ich weiss nicht wo meine Schmerzgrenze beim Geld liegt. Bin sehr sparsam eigentlich aber wenns um mein Hobby geht darf der PC schon was kosten.(Er wird auch gut ausgenutzt werden).\r\nBesser ich hab nen richtige guten PC gekauft und ein bisschen mehr ausgegeben wie einen PC der mir nicht reicht und ein bisschen weniger.\r\nStreamen ist GLAUBE ICH nur Sinnvoll wenn man in Hoher Qualit&auml;t streamt also 1080 mit ner annehmbaren Frequenz. Ich will keinen 1990 Stream vong Qualit&auml;t her ham.\r\n\r\nKann mir jemand bitte ein bisschen mit seinem Hirn helfen? Meins will da nicht so richtig.\r\n\r\nDanke/MfG\r\nRang3k1ng163 {{champion:18}}","replies":[{"poster":"G2 Squirrel","date":"2019-01-19T13:47:26.912+0000","up_votes":1,"down_votes":0,"body":"Hi!\n\nIch würde eher dein Internet für deine Probleme verantwortlich machen, nicht den PC. Deine 2 Mbit sind nicht sonderlich viel. Ich streame zwar selber nicht, habe es aber wohl schon ausprobiert und auch mit OBS gearbeitet und einiges recherchiert. Wenn ich mich richtig erinnere, sind 3-3,5 Mbit von Nöten, wenn du in FullHD streamen willst.\n\nVielleicht kannst du auch noch mehr Infos bringen, beispielsweise deine OBS Settings. Da kannst du nämlich auch viel \"verkacken\". Vielleicht ist dein Problem schon gelöst, wenn du da die optimalen Settings für deine Hardware und dein Internet bastelst.\n\nDann zu den 500€ Streaming PCs. Ich denke eher, dass diese PCs ausschließlich für den Stream zuständig sein sollen. Und nicht zum Gamen UND Streamen. Würde ich aber von abraten.\n\nNur um in 1080p streamen zu können, würde ich mir an deiner Stelle auch keinen neuen Rechner zulegen. Deiner ist ausreichend. Kauf dir noch 8 GB RAM nach und dann is jut. Wohnst du noch zu Hause oder alleine? Würde mal checken, ob bei deinem Provider mehr geht. Wenn du 20 Mbit Download hast, können die dir auch sicher 50/60 oder 100 anbieten. Mit entsprechendem Upload natürlich - den brauchst du ja schließlich zum streamen. \n\nGrüße","replies":[]},{"poster":"Mjölnir Kind","date":"2019-01-19T12:13:48.093+0000","up_votes":1,"down_votes":0,"body":"Du streamst mit OBS hm? \nHast du dann dein Stream nebenbei laufen oder siehst du den Chat auch in OBS?\nDenn das kann zu fps drops führen, wenn du den Stream nebenbei laufen lässt. (Ich spreche aus eigener Erfahrung)\nAnsich reicht dein Equipment, 8GB RAM ist zwar doch ein bisschen wenig, aber ich habs auch geschaft.\n\nNatürlich würd ich dementsprechen die Video settings runterschrauben und den Client im Hintergrund schließen.\nIch selber hab bis vor 2 Tagen in 720p mit einem deutlich schlechteren Equipment gestreamt.\nAllerdings streame ich mit Streamlabs OBS und solange ich nichts im Hintergrund laufen hatte, lief es ganz flüssig.","replies":[{"poster":"Rang3k1ng163","date":"2019-01-19T13:35:55.438+0000","up_votes":1,"down_votes":0,"body":"Ein Freund hat mir Streamlabs OBS empfohlen. Jetzt hab ich High Ping und dafür gute FPS (90+) dafür aber ein Ping von 120 anstatt den üblichen 60","replies":[]}]}]}