{"poster":"LowAnimals","date":"2017-09-10T13:06:46.970+0000","title":"UN ragazzo mi flamma continuamente e io prendo i report perchè feedo","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Allora come partire. Starto una ranked normale e vado top. Trovo una sivir adc che &egrave; un toxic player allora incomincio subito con mutare i suoi ping. Alla fine io muoio in top per due volte e lei mi scrive: i hope u and your mom die by cancer, oppure u are a cancer alch&egrave; io rispondo al flame ma in italiano non in inglese e muoio alcune volte intenzionalmente perch&egrave; non volevo che quel player vincesse la partita. E la riot ha deciso di dare a me le chat limitate mentre non mi &egrave; arrivata nessuna notifica sul feedback instantaneo del report quindi presuppongo che questo player non abbia ricevuto alcuna penalit&agrave;","replies":[{"poster":"Master Caos98","date":"2017-09-10T13:38:29.984+0000","up_votes":5,"down_votes":0,"body":"Quindi tu rispondi al flame con il flame?\nGenio.","replies":[{"poster":"Dottjjr","date":"2017-09-16T13:46:14.605+0000","up_votes":1,"down_votes":2,"body":"con questo messaggio gli hai risolto la vita.\nGENIO","replies":[]}]},{"poster":"Nabbomaster","date":"2017-09-10T13:21:41.667+0000","up_votes":7,"down_votes":2,"body":"maestra ha iniziato prima lui","replies":[{"poster":"Adalkah","date":"2017-09-13T18:32:12.636+0000","up_votes":1,"down_votes":1,"body":"looooooool","replies":[]}]},{"poster":"A Yordle ln Heat","date":"2017-09-10T13:15:22.213+0000","up_votes":5,"down_votes":1,"body":"No, ti sei preso il report perché hai risposto indietro.\nSai che c'è una punizione per farlo, quindi non farlo. Senza contare che, cosa obbligatoria da dire, è impossibile che tu venga punito per un flame se infrangi le regole solo una volta, quindi sei anche recidivo; questa non è la prima volta che flammi.\n\nFatti un esame di coscienza, bacioni.","replies":[{"poster":"Adalkah","date":"2017-09-13T18:34:53.094+0000","up_votes":1,"down_votes":0,"body":"agreed. dato che ongni tanto se mi gira male flammo come un animale. ma solo in rari casi. quanto rari ? l'ultima volta che ho falmmato è stato 2 mesi fa. e non mi sono mai beccato nessuna punizione per il semplice fatto che per il 99% delle volte sono uno di quei giocatori che cerca sempre di stare nel lato positivo incoraggiando il team e dando good vibes. ma poi ci sono giorni in cui mi girano male. eh amen. quindi ciò dimostra che non subisci nessuna punizione se non lo fai ripetutamente e in modo insistente","replies":[]}]},{"poster":"mangialavandini","date":"2017-09-11T13:38:06.662+0000","up_votes":3,"down_votes":0,"body":"Ciao, quando qualcuno ti da fastidio muta e vai avanti\n\nVorrei se possibile farti rendere conto che a un comportamento da maleducati hai risposto nello stesso modo, anzi ancor peggio:\n\nmi ha fatto uno sgambetto? allora lo farò a tutti\n\nfacendo perdere lui hai fatto perdere anche altri che non c'entravano nulla, nessuno dei due ha ragione, ti comporti male per un qualsiasi motivo?\n\nVieni punito senza se ne ma,  ignorarlo e riderci su ti faceva risultare maturo e responsabile come noto ciò non è avvenuto.\n\nScrivere in italiano solo perchè lui non capisca, scusami ma è veramente da sciocchi a questo punto, inveisci tra te e te sfogandoti e risolvi il problemi o alla peggio prendi un pezzo di carta e scrivi, puoi benissimo farlo nel tempo di morte.\n\nL'avviso viene dato SOLO all'ultima persona che ha fatto il report quando esso è stato bannato, non viene dato ogni volta.\n\nSei stato parecchio fortunato o almeno se non hai scritto ingiurie e calunnie, ti avviso che in caso tu scrivessi qualcosa di grave, potresti essere bannato all'istante senza passare dal VIA.","replies":[]},{"poster":"SerSlayer","date":"2017-09-10T15:49:09.587+0000","up_votes":4,"down_votes":1,"body":"Se scrivi un post del genere sul forum probabilmente non sai come va la vita. E' come dire lui ha rubato e non gli è successo nulla, io ho rubato e mi hanno arrestato. So che non sono cose uguali, ma semplicemente magari i report sono arrivati di più su di te che su di lui ed a te è arrivata la limitazione, o tu avevi già fatto qualcosa del genere in passato e avevi già ricevuto report.\n\nUna persona o è giusta o non lo è, non esistono le scuse a volte può succedere o, hanno preso tutti un brutto voto, anche io sono giustificato. Se sbagli devi sapere che puoi essere punito. E' un rischio che corri e sai che lo corri. Può andarti bene e può andarti male.\n\nL'unica cosa che cambia è la probabilità, più volte sbagli e più la probabilità che tu venga punito aumenta.","replies":[]},{"poster":"Dantazzo","date":"2017-09-10T13:23:52.870+0000","up_votes":2,"down_votes":1,"body":"Tra i due non so chi sia il vincitore...","replies":[]},{"poster":"Darkinknight","date":"2017-09-10T17:15:56.124+0000","up_votes":1,"down_votes":0,"body":"Giusto cosi","replies":[]},{"poster":"Adalkah","date":"2017-09-13T18:38:14.823+0000","up_votes":1,"down_votes":1,"body":"a parte che ignoriamo la parte del feeding intenzionale... che potresti essere perma bannato già per questo e ciò mi dimostra che hai un autocontrollo che fa pena e quindi non mi stupisco nemmeno che di sicuro avrai avuto penalità precedenti.... cosa diamine lo caghi a fare ? oh! ma te ne rendi conto della figuraccia che fai scrivendolo pure qui ?","replies":[]},{"poster":"Warlor","date":"2017-09-10T13:23:58.501+0000","up_votes":1,"down_votes":2,"body":"Avresti fatto bene, ma purtroppo ci stavano 3 player che non avevano fatto niente, o almeno credo","replies":[]}]}