{"poster":"Ameridad","date":"2017-12-10T22:35:11.290+0000","title":"Unable to connect to the server. Please check your network connection and attempt to reconnect","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Seit 3std probiere ich diesen Dreck zu fixen, letztes Game habe ich am Donnerstag dem 07. gemacht.\r\n\r\nIch habe jeden Bugfix durch, den man so im Inet finden kann. Wei&szlig; nicht mehr weiter.\r\n\r\nEinmal nachdem ich die Firewall komplett deaktiviert hatte ging ein Custom Game, dachte mir geil, Ranked gestartet selber Mist, -34 Punkte. \r\n\r\n{{champion:23}} Undying Rage\r\n\r\nIch geh lieber Path of Exile spielen","replies":[{"poster":"Ameridad","date":"2017-12-12T09:00:29.551+0000","up_votes":2,"down_votes":0,"body":"So 3 Tage nun, wo sich kein Game starten lässt, ich bumpe mal ganz dreist. Vllt. weiß ja wer einen Lösungsansatz.","replies":[{"poster":"Demyxat","date":"2018-01-16T16:40:04.212+0000","up_votes":2,"down_votes":0,"body":"Hab trauriger Weise das selbe Problem, und ich bin noch neu.\nIch hab keine Lust, als Anfänger Bestrafungen für das \"verlassen\" von Spielen zu erhalten, obwohl ich \nnicht mal in der Lage bin es zu beginnen.","replies":[]}]},{"poster":"DrYatty","date":"2017-12-11T07:58:24.990+0000","up_votes":2,"down_votes":0,"body":"> Ich habe jeden Bugfix durch, den man so im Inet finden kann. Weiß nicht mehr weiter.\n\nDann erstell mir doch bitte eine Liste damit ich nichts doppelt Poste. :) \n\nHilft in den meisten Fällen. -> https://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen","replies":[{"poster":"Ameridad","date":"2017-12-11T21:49:54.360+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DrYatty,realm=EUW,application-id=7hciEY9w,discussion-id=U3a979cb,comment-id=0000,timestamp=2017-12-11T07:58:24.990+0000)\n>\n> Dann erstell mir doch bitte eine Liste damit ich nichts doppelt Poste. :) \n> \n> Hilft in den meisten Fällen. -&gt; https://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen\n\nHabe alle möglichen Kompatibilitätsmodi ausprobiert, habe Firewall deaktiviert (vorher Außnahmen gesetzt), habe spezifische Ports im Router freigegeben, habe das Hextech Tool paar mal drüber laufen lassen, habe IPv6 Protokoll deaktiviert, im IPv4 Protokoll DNS IP per Hand vergeben, habe neuinstalliert, habe dem Router ne neue IP zugewiesen, habe jetzt 1 Tag gewartet, immer noch das gleiche, habe das neues Windows Creators Update gezogen (nachdem es schon nicht ging). Habe nochmals über das Hextech Tool neu gepatcht.\n\nJedes andere Game läuft (Counter Strike, Path of Exile, Hots, Planetside 2) und was ich nicht noch alles probiert habe, ging auch davor dauerhaft Problemlos.","replies":[{"poster":"Nekrulath","date":"2017-12-16T10:47:05.038+0000","up_votes":2,"down_votes":0,"body":"Genau diese ganzen Dinge habe ich auch gemacht. Ich habe selbst das Spiel 2x neu installiert und sogar Windows komplett neu aufgesetzt. Bei mir besteht dieses Problem seit Montag und der Kundenservice von Riot kann mir so rein gar nicht helfen. Alle Vorschläge funktionieren nicht...","replies":[{"poster":"Ameridad","date":"2017-12-20T21:35:44.920+0000","up_votes":2,"down_votes":0,"body":"Schau in deinen Router über welches Protokoll du ins Inet gehst, wenn es IPv6 mit DS-Lite ist kommen die madigen LoL Server nicht mit klar. Musst dir wieder ne richtige IPv4 IP Adresse mit Dual Stack geben lassen, kann im Regelfall nur der Provider.","replies":[]}]}]}]},{"poster":"Ameridad","date":"2017-12-12T22:05:54.783+0000","up_votes":2,"down_votes":0,"body":"So habe jetzt bei meinem Provider angerufen und mir wieder IPv4 einrichten lassen, lächerlich ist es allemal, dass es LoL nicht auf die Reihe bekommt und man bei seinem Netzanbieter tätig werden muss. Meist gespieltes Spiel der Welt *hust* 20% aller Google User nutzen mitlerweile Ipv6","replies":[{"poster":"Sky Show","date":"2017-12-14T22:08:11.699+0000","up_votes":2,"down_votes":0,"body":"so nachdem IPv4 eingerichtet läuft das Game wieder reibungslos?","replies":[{"poster":"Ameridad","date":"2017-12-20T21:34:06.858+0000","up_votes":2,"down_votes":0,"body":"Ja, hab bei Vodafone angerufen, der Mitarbeiter hat auch gefragt wofür ich ipv4 brauche und ich sagte für ein Game, er welches, ich LoL, \"das spiel ich auch und eig. sollte es über ipv6 klappen\" sagte er. Naja halbe std. später war Inet für 20min weg, dann hatte ich wieder Dualstack und seitdem geht es wieder. Wie gesagt lächerlich²³, dass man extra bei seinem Provider anrufen muss um das meist gespielte Spiel der Welt spielen zu können.","replies":[]}]}]},{"poster":"deityboy","date":"2017-12-14T17:26:01.932+0000","up_votes":2,"down_votes":0,"body":"Habe genau das gleiche Problem und auch seit dem 7. Dezember","replies":[{"poster":"Ameridad","date":"2017-12-20T21:31:31.312+0000","up_votes":2,"down_votes":0,"body":"Sry, hab dein Eintrag zu spät gelesen, nutz du zufällig Unity Media oder Vodafone Kabel, dann musst du in deren Kundenservice anrufen und dir wieder ein richtigen Dual Stack geben lassen, sprich ne IPv4 Adresse, wenn die DS-Lite und ipv6 eingerichtet haben kann es nicht zu den den Servern verbinden.\n\nJedes verschissene kleine Minigame kommt damit klar aber LoL Server sind wohl stark veraltet.","replies":[]}]},{"poster":"Ameridad","date":"2017-12-12T19:22:33.927+0000","up_votes":2,"down_votes":0,"body":"So, es liegt höchstwahrscheinlich daran, dass Vodafone Kabel irgenwann letztes Wochenden IPv4 über einen DS-Lite Tunnel laufen lässt und IPv6 läuft, ist halt leicht lächerlich, dass diese Probleme schon in LoL Foren 2013 angesprochen wurden und 2017 das \"meistgespielte\" Spiel der Welt, seiner Zeit immer noch um Jahre hinterher ist. Also kann man das Spiel in 2-3 Jahren eh komplett vergessen, wenn IPv6 Standard werden sollte.","replies":[]},{"poster":"Roxãs","date":"2017-12-11T08:01:04.034+0000","up_votes":2,"down_votes":0,"body":"Path of Exile ist gar nicht so gut","replies":[]}]}