{"poster":"VoyShare","date":"2015-05-31T13:45:08.901+0000","title":"Player report im champselect?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Hi,\r\n\r\nwie reporte ich jemanden, der im Champselect &quot;scheisse baut&quot;? Hab ein Screenshot, aber man darf ja niemanden an den Pranger stellen hier.\r\n\r\n- antisemitische Bemerkungen\r\n- generell Spam und toxic\r\n- huldigte einen gewissen Adolf\r\n...\r\n\r\nund und und\r\n\r\nSolche Leute brauchen wir nicht. Ich w&uuml;rde gerne wissen, wie man soetwas reportet.\r\n\r\nmfG","replies":[{"poster":"Latovius","date":"2015-05-31T13:50:28.714+0000","up_votes":1,"down_votes":1,"body":"Screenshot und einfach an den Support schicken, wenn du dir die Arbeit machen willst ;)","replies":[{"poster":"Humpelstilzche","date":"2015-06-01T08:45:42.326+0000","up_votes":3,"down_votes":0,"body":"Nein. Einfach per Report melden. \nGanz grundsätzlich gilt, dass der Support NIE eingreift, wenn man etwas per Ticket meldet, was man auch per Report hätte melden könnte. Die \"Bestrafer\" in LoL, also die die darüber entscheiden wer bestraft wird und wer nicht, sind die Community, nicht Riot. Daher mischt sich Riot nicht bei Dingen ein, bei denen die Community entscheiden sollte. Bei Reports ist dies der Fall. Wenn die Möglichkeit besteht Verhalten über die normale Report-Funktion zu melden, wird der Player Support nicht einschreiten.","replies":[{"poster":"Der Großmugister","date":"2015-09-06T15:09:14.462+0000","up_votes":2,"down_votes":0,"body":"Das würde dann aber bedeuten, wenn das Spiel nicht los ginge, könnte man sich alles im Champselect erlauben.\nIch fände es nicht schön, würde dies den Tatsachen entsprechen.\nEin Report wäre in dem Fall nicht möglich, es müsste also doch eine Person außerhalb der Community entscheiden.","replies":[{"poster":"eingew","date":"2015-09-06T16:03:57.488+0000","up_votes":1,"down_votes":0,"body":"Wenn das Spiel nicht zustande kam kann man natürlich ein Ticket öffnen. Man sollte aber deutlich machen, dass das Spiel eben nicht zustande gekommen ist, sonst wird der Support vermutlich nicht reagieren.","replies":[]}]}]}]},{"poster":"Kaitri","date":"2015-05-31T14:27:16.443+0000","up_votes":3,"down_votes":0,"body":"schreib in deinen report einfach hat im champselect xy gesagt. es überprüft champselect, gamechat und aftergame chat.\nsonst halt rechts oben an support.","replies":[]},{"poster":"PiXeL FuNKY","date":"2015-05-31T13:49:51.997+0000","up_votes":3,"down_votes":1,"body":"nach dem game für anzügliche sprache oder so weiss auch  net mehr wie das heisst dann rein schreiben was er getan hat","replies":[]},{"poster":"CCG Juuzou","date":"2015-09-06T13:55:05.039+0000","up_votes":1,"down_votes":2,"body":"Wer ist denn dieser Adolf hab ich nie gehört!","replies":[]},{"poster":"ÆonFox","date":"2015-05-31T14:59:35.132+0000","up_votes":2,"down_votes":4,"body":"Für solche fälle wünsche ich mir den [Lasst mich hier Raus Butten](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/TRUbsgxy-champselect-hilfe-lasst-mich-hier-raus-butten)...\nWenn du ihn reporten möchtest ohne ein Spiel mit dem spielen zu müssen so wende dich [direkt an den Support](https://support.riotgames.com/hc/de/requests/new).\n\nGruß Fox","replies":[]}]}