{"poster":"Tirolei","date":"2015-09-07T01:46:40.744+0000","title":"Looking for players/community","subforum":"Team Recruitment","up_votes":2,"down_votes":1,"body":"I recently came over like a lot of people from NA with the server move and of course now have an empty friends list. I&#039;ve been searching through threads looking for people, but figured I&#039;d also put my name out and just let people who are interested add me.\n\nI main mid and am currently gold 5, I enjoy soloq but wouldn&#039;t mind branching into ranked 5&#039;s with a team, I also enjoy just practising and having fun in normals. I prefer voice chat if it's possible, I have access to a ts3 server if needed, also curse and skype(tho I only use Skype as a last resort)\n\nI&#039;m pretty casual and my schedule is a bit everywhere due to study commitments, but if you&#039;d like please do add me, my IGN is the same as my forum name: Tirolei.","replies":[{"poster":"Jason","date":"2015-09-07T02:49:26.878+0000","up_votes":4,"down_votes":0,"body":"You can try a bunch of different places.\n\nZealot Gaming; Active, small community. A tad elitist. Great people.\nhttp://www.zealotgaming.com\n\nOceanic LoL; Facebook based, somewhat quiet, pretty timid.\nhttps://www.facebook.com/groups/OceanicLoL/\n\nOceanic Gaming; Pretty inactive, large following, worth keeping an eye on\nhttps://www.facebook.com/OceanicGaming\n\nThere's also facebook groups for each region, depending on where you're from. It's worth looking into it.","replies":[]},{"poster":"JasonWazza","date":"2015-09-07T02:44:30.785+0000","up_votes":2,"down_votes":0,"body":"Try Zealot gaming\n\n[http://www.zealotgaming.com/forum.php](http://www.zealotgaming.com/forum.php?referrerid=10106)","replies":[]},{"poster":"sdfsdfsewf","date":"2015-09-09T04:04:14.854+0000","up_votes":1,"down_votes":0,"body":"i will add u  my game is is sdfsdfsewd","replies":[]},{"poster":"Abyssial","date":"2015-09-09T00:54:19.046+0000","up_votes":1,"down_votes":0,"body":"Hey man im apart of a community that has just branced out to OCE and is looking for players for a team, the websites here http://tenacitygaming.com/index.php/home/","replies":[]},{"poster":"Tirolei","date":"2015-09-08T06:27:18.063+0000","up_votes":1,"down_votes":0,"body":"Thank you both, I'd done a little searching and not come up with much, I'm personally in Adelaide, SA, I'll check out all of those and see if I can find some fun people to play with.","replies":[]}]}