{"poster":"Shàco Bot","date":"2014-12-08T13:03:20.598+0000","title":"Why are bronzies so STUPID?","subforum":"Miscellaneous","up_votes":1,"down_votes":6,"body":"Finally got around to doing my prelims on my smurf.\r\nHad at least 3 games with people intentionally feeding or throwing.\r\n\r\nStill hit silver 3.\r\nhttp://www.lolking.net/summoner/oce/1990413#profile\r\n\r\nSo i've been playing around 4 years, just before pantheon was released. I played premades mostly while levelling and mained adc as tris is a hypercarry and free when you 'like' their fb page.\r\n\r\nI made zero attempts to reduce toxicity, that was intentional so i could test Riots' theory that toxicity equates to poor performance ingame.\r\n\r\nI actually noticed verbal harassment was usually the result OF toxic play. People very rarely spoke out in a toxic manner to say, bignote themselves after making a kill or after winning a team fight.\r\n\r\nThey very frequently however, abused people who were 'split pushing' and feeding while the enemy is just pounding them 4v5 in team fights.\r\n\r\nAnd so i get to my point; After going into ranked and hitting high silver / low gold for 3 seasons, i transferred when it was free and somehow bugged out. I got slammed into B5 and have had a few series to silver and been b2/b1 quite a number of times.\r\n\r\nBut i keep dropping down because frankly, bronze people are intellectual cripples. There is just no polite way of saying this.\r\n\r\n-ADC's whinge about supports 'stealing' cs when they wouldn't have gotten the last hit anyway. ADC's are easily the most toxic thing in bronze, they repeatedly demand their sup doesn't cs when they can't possibly hope to get a full 210 cs by 20 minutes. In fact the average is 70 so that's 140 minions dying and nobody gets their gold unless you buy specific sup items. Even then you're only getting 5% of it.\r\n\r\n-Bronzies can't seem to understand simple maths. They keep diving into 'team fights' three-versus-five. They keep defending this tactic too, as if they aren't taught in grade 1 or preschool that 5 is greater than 3 and they shouldn't be doing it.\r\n\r\n-Nobody knows their champ roles. I see teemos who don't split push and try to join team fights while unstealthed. I see shacos farming THEIR OWN jungle 24/7 and other junglers never ganking or getting dragon.\r\n\r\nIt's legitimately gotten to a point where I feel I HAVE TO create this post and ask the community in general,\r\n\r\nWhat in the hell are you doing? There is a metric ASSTONNE of stupidity in bronze, why does nobody use their heads in this godforsaken bracket?","replies":[{"poster":"Rav","date":"2014-12-08T13:09:21.161+0000","up_votes":4,"down_votes":0,"body":"Ayyyyy I remember you on the forums. 2/10 bad troll bait, but 8/10 for nostalgia.\n\nYou're still the hero America deserves, father of his hamster, husband of his right hand. You fought for us as you saw the horrors the Pantheon release brought upon this game. Truly magnificent.","replies":[{"poster":"She Loves Me","date":"2014-12-08T13:20:43.387+0000","up_votes":4,"down_votes":1,"body":"1 lyk = 1 tear {{item:3070}} ","replies":[{"poster":"Geldour","date":"2014-12-08T14:47:55.544+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}","replies":[]}]}]},{"poster":"Jakiron","date":"2014-12-08T13:29:02.153+0000","up_votes":2,"down_votes":0,"body":"[idk how to forum good](http://img.memerial.net/memerial.net/1530/weve-gone-back-in-time.jpg)","replies":[]},{"poster":"Goldendo 2","date":"2014-12-08T13:21:58.303+0000","up_votes":1,"down_votes":0,"body":"You are bronze 5. You are bad at this game. Get good.","replies":[{"poster":" Fantawolf","date":"2014-12-11T02:19:13.919+0000","up_votes":1,"down_votes":0,"body":"cant level up  or leave bronze if the other team mates don't do there roles  yes im in b5 go 85 then 4 games you loose your points \n{{summoner:30}}","replies":[]}]},{"poster":"Garens Harem","date":"2014-12-09T06:38:42.537+0000","up_votes":1,"down_votes":0,"body":"this guy again lel\n\n{{champion:35}} {{champion:35}} {{champion:35}} {{champion:35}} {{champion:35}} {{champion:35}}","replies":[]},{"poster":"Jehovahs Witness","date":"2014-12-08T23:09:43.208+0000","up_votes":1,"down_votes":0,"body":"The only thing true is probably ADCs. I buy Relic Shield for a reason.","replies":[]},{"poster":"Geldour","date":"2014-12-08T14:46:57.872+0000","up_votes":1,"down_votes":0,"body":"im more confused as to how you are 10-16 when you are a smurf.\n\nwhats your main silver 5?","replies":[{"poster":"Goldendo 2","date":"2014-12-08T15:24:19.556+0000","up_votes":1,"down_votes":0,"body":"the acc hes posting on is bronze 5 lel","replies":[{"poster":"Geldour","date":"2014-12-08T16:28:55.492+0000","up_votes":1,"down_votes":0,"body":"lol i didnt even realize that, so his main is bronze 5, yet he complains about bronzes not carrying him past silver 3","replies":[{"poster":"Goldendo 2","date":"2014-12-08T16:49:03.056+0000","up_votes":1,"down_votes":0,"body":"its bait obvs","replies":[]}]}]},{"poster":"Shàco Bot","date":"2014-12-10T03:15:45.597+0000","up_votes":1,"down_votes":1,"body":"I played ranked on a weekend, before i realised people have massively started trolling it lately >.>","replies":[]}]},{"poster":"SEKAI","date":"2014-12-08T15:34:51.091+0000","up_votes":1,"down_votes":0,"body":"8/8 nostalgia.\n\nWould miss again.","replies":[]}]}