{"poster":"HusztiMagicDeath","date":"2015-03-13T20:11:07.034+0000","title":"Csak gratulálni tudok megint-.-","up_votes":2,"down_votes":4,"body":"Kedves Riot. Újabb frissítés, újabb elb*szás. Ha a Lol-al kapcsolatos hírekre kattintok a játékon belül a lol cliensben a kezdő képernyőn, akkor azt az életben nem nyitja meg egyik böngésző sem.  De ha azt a linket kimásolom amit megpróbál nyitni a böngésző, akkor úgy betölti. GRATULAAAA.... Ha rákattintok a lolból egy hírre, akkor nem hogy azt a linket nem nyitja meg, de semmi mást, se facebokot, se semmi mást, mert EZ A RIOT: TELE buggal.\r\nMásik hiba.\r\n    ELőző frissítésben a játék vége utáni összesítő kijelzőt, amin az idézők, meg statjaik vannak, azt nagyon lassan, percek után adta be. Nah már most az új frissítésben egyáltalán be sem adja. Imádunk kedves hibagyártó riot.","replies":[{"poster":"Eshu","date":"2015-03-14T09:13:13.986+0000","title":null,"up_votes":3,"down_votes":1,"body":"Egyetlen egyszer sem produkálta a játék ezeket a hibákat még a laptopon a leterhelt munkahelyi hálózaton SE. Ha nem egy krumplin próbálod futtatni a játékot betárcsázós nettel akkor menni fog...","replies":[{"poster":"HusztiMagicDeath","date":"2015-03-14T12:28:16.147+0000","title":null,"up_votes":1,"down_votes":1,"body":"Történetesen nekünk van a legjobb netünk a városban... A gépem is elég jó. Dotával, vagy bármely más játékkal semmi baj nincs, csak a LOL-al van az utóbbi 3-4 frissítés óta.\nNe bíráld a netünk és a gépem ha azt sem tudod milyen, grat a gondolkodásért.","replies":[{"poster":"Eshu","date":"2015-03-14T13:15:39.551+0000","title":null,"up_votes":1,"down_votes":0,"body":"De te szabadon hisztizhetsz és bírálhatsz bárkit és bármit olyanért, ami csak nálad történik és ez minden bizonnyal valaki másnak a hibája annak ellenére hogy csak a te géped produkálja.. És még nekem \"grat a gondolkodásért\"...\n\nLehet rossz a kábeled vagy a modemed vagy a drivereid vagy a szomszéd lopja a neted vagy egy köztes routing problémád van - akármi... ha ez szerverhiba lenne mindenkinél ez történne. Nem így van. A user fórumba erről duzzogni aligha fog bármi megoldást hozni lévén ez nem a támogatás - az el van rejtve a kíváncsi szemek elől az oldal tetején található \"Támogatás\" gomb alatt... Ha ők nem segítenek - itt se fog senki... ","replies":[{"poster":"YiJaegar","date":"2015-03-14T15:01:58.020+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egyet értek, másik dolog ezek az ismerten hiba hibák nem a Riot hibája de az se biztos hogy a szolgáltatóké lehet valamelyik hálózaté a szerver és szolgáltatód közt. személy szerint én Szerbiában élek és nincs problémám sőt senkitől se halottam a szerb forumokon se említi senki. \nmúltkor csináltam trace route tesztet az eune szerverhez és az én netem Szerbia-Svájc-UK vonalon ér el a szerverhez. Ha pl Svájcban hiba lép fel akkor kaphatok ilyen tipusú hibát (sose kaptam ahogy írtam ez példa) és se a Riot se a szolgáltatóm nem hibás","replies":[]}]}]}]}]}