{"poster":"HusztiMagicDeath","date":"2015-04-02T18:30:54.362+0000","title":"Hogy működik ez?","up_votes":1,"down_votes":0,"body":"Sziasztok.\r\n\r\nHogy műk&ouml;dik ez? Ranked 3v3, &eacute;s/vagy ranked 5v5 besorsol&aacute;s&aacute;t nem &eacute;rtem. Megtudhatom b&aacute;r hogyan, b&aacute;rhonnan, hogy mi szerint &eacute;s hogyan sorsol be? V&eacute;lem&eacute;nyem szerint a 3v3-as rankedbn nem volt olyan rossz a r&aacute;t&aacute;nk a csapattal. M&eacute;g is Bronze V-be ker&uuml;lt&uuml;nk.\r\nMilyen sz&aacute;m&iacute;t&aacute;ssal ad be k&uuml;l&ouml;nf&eacute;le div&iacute;zi&oacute;kba? Milyen a div&iacute;zi&oacute;k k&ouml;zti eredm&eacute;nyhat&aacute;r?","replies":[{"poster":"Mardukza","date":"2015-04-06T09:37:25.107+0000","title":null,"up_votes":2,"down_votes":0,"body":"Hogy működik ez? Akárhányszor játszom PvP-t mindíg azzal a csapattal vagyok aki csúnyán ki kap, láthatóan a 15. perc elött már esélytelen az egéssz. Föleg hogy 90°-ba 1 inaktívat vagy egy robotot is ki kapunk. Bocs csak valahova le kellett ezt írnom mert már szétt csesz az ideg. Hiába megy nekem türhetően a csapatból 1-2 szar + az afk.","replies":[{"poster":"HusztiMagicDeath","date":"2015-04-11T16:30:14.234+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mindennapos eset nálam is és felbasz nagyon :)","replies":[]}]},{"poster":"nmoreKharon","date":"2015-04-02T21:18:00.043+0000","title":null,"up_votes":1,"down_votes":0,"body":"Orulj neki. Tobbet gyakoroltok. Inkabb kezdj bronze v-ben es jussatok fel, mint kerulj gold I-be es ne tudjatok feljebb jutni. :/ brw nemtudom. :D","replies":[{"poster":"HusztiMagicDeath","date":"2015-04-03T07:24:15.134+0000","title":null,"up_votes":1,"down_votes":0,"body":"Értem. Én csak azért nem örültem ennek, mert solo rankedban is elég rossz élmény volt, hogy második szezonban berakott bronze II - 8 win 2 lose-al, és majdnem minden játékomban suppoltam és megjegyzem elég jól. Ez volt az előző szezonban. s azt gondoltam, hogy ha nincs 35/1/23 statom, nem rakott volna fel gold V-be sem. És lehülyéztem a rendszert.\nDe kösz mindenki az infót :)","replies":[{"poster":"nmoreKharon","date":"2015-04-03T09:30:18.949+0000","title":null,"up_votes":1,"down_votes":0,"body":"Season3-ra gondoltal? :D season 2-ben csak elo alapjan osztalyozta a nepet. :D Ez a division dolog frissebb. Megmondta mar nem egy ember, sajna nagy jelentosege a soloq-nak nincs. :/ Max itt nalunk, mivel nincs az embernek 130dollarja bronze to plat boostra... Igen, ennyibe kerul kb egy real boost. Oda kint meg mi az a 130dollar... Piskota. Vagy plat to diamond 100dollar.... Eszmeletlen sok boostolt, oda nem illo es eszetlen jatekos van... Tegnap beszelgettem Tesommal, Ö plat I es probaltuk kivesezni, mi is kell igazabol, hogy felkeruljunk...amellett amit mar tudunk. Majd rajottunk. 1. UberCarry champ. 2. Luck. Luck. Luck es luck.","replies":[{"poster":"HusztiMagicDeath","date":"2015-04-03T10:58:23.754+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jaj rosszul fogalmaztam sorry! Én 1 éve játszok, és a második szezont azt a mostani szezonra értem.","replies":[]}]}]}]},{"poster":"Vasipari Béla","date":"2015-04-02T19:17:34.038+0000","title":null,"up_votes":1,"down_votes":0,"body":"Személyes tapasztalatból mondom, hogy a besoroló rendszer, de legalábbis a csapat besoroló rendszer az MMR-edhez tartozó diíziónál jóval alább rak.\nCsináltunk egy ranked teamet, 5 meccs, 5 win, Gold5, oké. Utána promó nélül léptünk Gold3-ba, onnan Gold1-be, és szintúgy promó nélkül Plat5-be.\nSzeintem, ha sikerül egy 60-65%-os winratet tartani, akkor ti is így lépkedhettek felfelé.","replies":[{"poster":"HusztiMagicDeath","date":"2015-04-03T07:24:36.673+0000","title":null,"up_votes":1,"down_votes":0,"body":"MMR?","replies":[]},{"poster":"Deapimp","date":"2015-04-02T20:28:47.566+0000","title":null,"up_votes":1,"down_votes":0,"body":"5v5/3v3 team ranked nincs olyan, hogy promo csak lépkedsz felfelé","replies":[]}]},{"poster":"Kadegrow","date":"2015-04-02T18:48:55.255+0000","title":null,"up_votes":1,"down_votes":1,"body":"Ha most csináltátok a csapatot alap, hogy bronzba rak és ehhez nem kell semmilyen számítás sem hisz hiába nyered meg mindent kb. egy friss csapatot nem fog goldba se silverbe rakni. Ha 5-be vagytok annyiból jó, hogyha promohoz értek, akkor nem kell promo meccset játszani és akár 2 diviziót is léphettek.\nAmúgy meg MMR szerint pakol utána fentebb.","replies":[]}]}