{"poster":"JRobin31","date":"2018-08-09T05:11:20.528+0000","title":"\"Too Much Damage in the Game\"","subforum":"Gameplay","up_votes":13,"down_votes":4,"body":"My champion was killed with a single auto attack.\r\nHow did this happen?\r\n\r\n{{champion:267}} :\r\nlevel 11\r\n1225 health\r\n64 armor\r\n\r\nvs\r\n\r\n{{champion:21}} :\r\nlevel 13\r\nArmor Pen 54\r\n320 AD\r\nCrit Chance 0%\r\n\r\nNightstalker for 150 bonus physical damage.\r\nLove Tap (100% AD bonus physical damage = 320)\r\nDouble Up (100 + 100% AD physical damage = 420) against primary target\r\nDark Harvest (68 + 25% bonus AD adaptive damage + soul essence = 312.75)\r\n\r\nDamage Dealt = (1202.75 + 320) * (100 / (100+64-54)) = 1384.318\r\n\r\n1384.318 &gt; 1225\r\n\r\n**TL;DR**: Complete breakdown of a particular instance in game of &quot;Too Much Damage&quot; instead of a vague statement that it feels like there is &quot;Too Much Damage&quot; in the game.\r\n\r\nWhat did it feel like?  It felt like &quot;Too Much Damage&quot; in the game, obviously.\r\n\r\nFeel Free to Discuss, Correct Damage Totals, etc.\r\n\r\nThis is not the only champion I go against that feels like it has too much damage.\r\nI also achieved a solo kill against this MF in game (she was not the only champion I solo killed in that game).\r\nAlso earlier in this same game, I was killed by the MF while my CC was landing on her... 100% of my maximum health gone while the bubble was CCing MF.\r\n\r\nMy rune option for dealing with the damage? Bone Plating: **After** taking damage, the next three spells or attacks you receive from them deal 15-40 less damage.  The effectiveness of this rune was zero: I was killed in one hit.\r\nThis season has been terrible.\r\n\r\nWhat would I change?\r\nGet rid of keystones.  Keystones have not done anything good for the game at all in any way, shape, or form.  **Keystones might even be the worst idea ever in the history of League of Legends**.","replies":[{"poster":"Paroe","date":"2018-08-09T08:17:04.658+0000","up_votes":6,"down_votes":2,"body":"Remember when masteries were small bonuses designed to help in lane? \nRemember when a good product was better than a flashy one?\nRemember when AD itemization wasnt god? \n\nRemember the game before ghostcrawler was put in charge? \n\nRemember the game when riot had accountability? \n\nI member. \nRiot needs to go back to those days. Stop chasing a dream and start building a good product... Like a house, if the base is rotten no matter how flashy the inside is its still not going to sell very well.","replies":[{"poster":"TitanAnteus","date":"2018-08-09T16:08:18.870+0000","up_votes":2,"down_votes":1,"body":"I remember when correct masteries were so absolutely vital to the game, that you could not win fights as certain champs without the proper setups. \nI remember so many rune options that people gave up on being creative and just googled \"the best rune page\" and made that. \nI remember that AP itemization did not have as many parts and AP champs shared a lot of the same items as Enchaters so enchanters would build deathcap to heal more.\n\nAccountability is a nonsensical word in this sense. The community is holding them accountable by choosing to play or not play the game. By choosing to buy skins or not buy skins. They are a business and if they're fucking up, their finances will suffer. They always will and have accountability.","replies":[]}]},{"poster":"Jaspers","date":"2018-08-09T08:30:42.159+0000","up_votes":3,"down_votes":3,"body":"The key part of that damage is the 'Nightstalker' part, because the item has lethality as well as dealing bonus physical damage. Would be like Luden's having Magic pen on it so the bonus damage doing extra magic damage because you have the magic pen. \n\nSo, my solution, remove the bonus damage from Duskblade (assassin's shouldn't need bonus auto damage when they never had this before) or remove the lethality.","replies":[{"poster":"LeftyRaydy","date":"2018-08-09T22:56:16.025+0000","up_votes":2,"down_votes":0,"body":"Do not forget if they Have stormrazors as well LOL just way too much initial damage.","replies":[{"poster":"Paroe","date":"2018-08-10T03:07:29.787+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=3ErqAdtq,discussion-id=LifahAtx,comment-id=00030000,timestamp=2018-08-09T22:56:16.025+0000)\n>\n> Do not forget if they Have stormrazors as well LOL just way too much initial damage.\n\nTBH having high alpha damage is absolutely A-OK - As long as it means you dont get DPS as well.\nLike... In the game EVE online theres three viable builds: \nAttack speed build; This build has the highest DPS, lowest burst damage. Its the most common build type. \nBalance: A balance between raw damage and attack speed, a good choice for certain ships. \nAlpha: Screw attack speed, you have insanely high burst damage and abysmal DPS. \n\nEach kind of build has its own drawbacks, but they dont _bleed over_ like they do in league. In league, youre either a gattling missile turret or an ultra mobile drone strike.","replies":[]}]}]},{"poster":"Warlord Rhinark","date":"2018-08-09T06:00:31.015+0000","up_votes":3,"down_votes":2,"body":"Keystones are like drugs.\n\nThey're not good for you, but you still take them.","replies":[]},{"poster":"Sire Hippington","date":"2018-08-09T22:37:45.231+0000","up_votes":1,"down_votes":0,"body":"In this particular case, the masterie increases the damage by nearly 30%(from ~1072 to ~1384)\nNow take a look at ancient times: S4 off-tree \"keystone\" [Havoc](http://leagueoflegends.wikia.com/wiki/Havoc_(Season_2011_Mastery)) giveing a simple 3% increase in total damage...","replies":[]},{"poster":"Fireman Teemo","date":"2018-08-09T07:36:52.480+0000","up_votes":1,"down_votes":0,"body":"I don't know , instead of adding new \"cool\" stuff they should of tried to perfect a sort of perfect state(s) of the game, and switch them up every once in a while instead of adding to the problem like they did via new runes, champs, and metas. I say \"state(s)\" because they should have a meta for every class where they're at a slight advantage but it mostly depends on skill and not sheer brute butt raping damage","replies":[]}]}