{"poster":"JigglyBalls","date":"2016-02-14T05:12:58.328+0000","title":"Ranked system","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Riot i want you to explain something to me please, as you know the new season has started so i have to work hard to get back to silver 4 however i won 6 out of 10 games and i was put in bronze 3 but my friend that wasn&#039;t even ranked last season got put into silver 4 even thought he only won 3 out of the 10 games. So can you please explain why that has happened.","replies":[{"poster":"Ninox","date":"2016-02-14T10:05:50.941+0000","up_votes":1,"down_votes":0,"body":"I can explain the system as I understand it, so I may be wrong/off in a few areas so don't take this as exact, but I'll explain it as best I can.\n\nWhen you haven't played ranked before the system gives you a default mmr of Silver 2~ When you have played ranked before, your mmr soft resets at the start of each season, so say if you were G5 it'll bump your mmr back to S1-2. What this means is that you'll usually get placed a bit lower than where you ended last season. So someone who hasn't played ranked will get placed anywhere from S3-B3. (First time I played ranked last season I won 3/10 and got placed B3, this season I won 5/10 and got S1 because I was G5 with high mmr last season).\n\nThe outliers would be things like, say you were ranked G5, but your mmr was more like G1, then the soft reset would put you down to about G2-3 and your placements would put you somewhere there (but those cases are rare).\n\nHopefully that helps you some.","replies":[{"poster":"JigglyBalls","date":"2016-02-14T10:15:29.817+0000","up_votes":1,"down_votes":0,"body":"That does help a lot thanks, but the season before i think he was like b5, also i was the one that carried those 3 games that he won ","replies":[{"poster":"Ninox","date":"2016-02-14T11:04:45.442+0000","up_votes":1,"down_votes":0,"body":"If he didn't play last season then likely his mmr was reset completely, but I'm not too sure about that one. It unfortunately is very dependent on your mmr and to a lesser extent the mmr of those you are vsing. But at least you have the whole season, if you've made it to S4 before then you ought to be able to make it back :)","replies":[{"poster":"JigglyBalls","date":"2016-02-21T22:24:35.919+0000","up_votes":1,"down_votes":0,"body":"Riot really needs to fix that","replies":[]}]}]}]}]}