{"poster":"The1WithTheAxe","date":"2015-04-01T18:19:47.430+0000","title":"Gegenstück zu kritischen Treffern?","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":1,"body":"Was haltet ihr von der Idee ein Gegenst&uuml;ck zu kritischen Treffern einzuf&uuml;hren? Items die eine Art Schutz f&uuml;r die kritischen Stellen gew&auml;hren, welche die Wahrscheinlichkeit eines kritischen Treffers bei dem eigenen Champion senkt? Erz&auml;hlt mal, wie findet ihr die Idee? :D","replies":[{"poster":"SorisDynasty","date":"2015-04-02T16:08:06.342+0000","up_votes":1,"down_votes":0,"body":"Das \"Problem\" dabei ist, dass die Chance von kritischen Treffern nicht vom Ziel abhängt, sondern von demjenigen, der sie verschießt. Da müsste man Mechaniken ändert und all sowas. Zu aufwendig. Außerdem sind Tanks aktuell sowieso wieder in Mode (zurecht! hatten lange keine Zeit mehr für sich gehabt), das würde sie nochmal unnötig buffen, wenn sie noch effektiver gegen die einzigen sein würden, die sie im Lategame rausnehmen können.","replies":[{"poster":"The1WithTheAxe","date":"2015-04-05T08:07:16.096+0000","up_votes":1,"down_votes":0,"body":"gut, das stimmt :) aber tanks machen halt nicht wirklich viel schaden, somit können sie auch noch von leuten weggeräumt werden die nicht kriten, wie z.b. der gute alte Darius {{champion:122}} ","replies":[{"poster":"SorisDynasty","date":"2015-04-05T08:36:46.629+0000","up_votes":1,"down_votes":0,"body":"Tanks machen gut genug Schaden. Sejuanji, Mundo und eben der gute Darius können es über sehr lange Zeit ohne Probleme mitm ADC aufnehmen, wenn sie mal dran sind. Darius ist auch der einzige von denen, der wirklich gekitet werden kann. Gibt genug Tanks, die 'ne ernstzunehmende Gefahr sind. Zumal ein Tank normal nicht alleine reinspringen wird, sondern noch jemanden bei sich hat.","replies":[]}]}]},{"poster":"Evenrider","date":"2015-04-02T21:05:30.334+0000","up_votes":1,"down_votes":0,"body":"Also ein Item, welches rein gegen ADCS und ein paar zusätzlichen Champions wirkt? Wozu? Sind dir die ADCs zu mächtig?","replies":[{"poster":"The1WithTheAxe","date":"2015-04-05T08:06:35.196+0000","up_votes":1,"down_votes":0,"body":"ja, einige schon, wenn mal mal z.b. an caitlyn denkt, sie kann einen krit von mehr als 2000 erreichen, das kann schon sehr belastend werden {{champion:51}}","replies":[]}]},{"poster":"Rkoturdo Ndo","date":"2015-04-02T16:05:02.827+0000","up_votes":1,"down_votes":1,"body":"Heya\nEs gab früher mal Dodge...\n\nMfG Rkoturdo","replies":[]}]}