{"poster":"Call me AAKAA","date":"2017-01-06T09:29:32.614+0000","title":"GOT BANNED JUST COZ I DCED BECAUSE I DCED COZ OF A POWER OUTAGE","subforum":"Player Behaviour","up_votes":1,"down_votes":6,"body":"FUCK YOU RIOT. YOU ALL SO FUKED UP. WHY GIVE A BAN TO A PLAYER JUST BCOZ THEY DC?? MY FUKING POWER WENT OUT AND NOW I CANT PLAY BCOZ YOU SORRY FUKS BANNED ME FOR TWO WEEKS.\r\nI SPEND 9 HOURS A DAY PLAYING THIS SHIT. I WAS RANKING UP. TRYING TO CRAWL OUT OF THE BRONZE FIVE HELL HOLE BUT YOU ALL JUST FUKED IT UP. GOODJOB MUTHERFUKERS. GOOD FUKING JOB. YOU PEOPLE SHOW NO CONSIDERATION TO PLAYERS COMING FROM COUNTRIES WITH POOR CONNECTON AND POWER PROBLEMS. I KNOW IAM WASTING MY TIME TYPING THIS BUT YOU ALL NEED TO UNDERSTAND THAT NOT EVERYONE FUKING COMES FROM A COUNTRIY WITH GOOD POWER AND INTERNET SERVICES. ITS MY HOLIDAYS. I SLEEP DURING THE DAY AND WAKE UP WHOLE NIGHT JUST SO I CAN PLAY WITH A REASONABLE PING. I HAVE BEEN PLAYING SINCE SEASON 3. NEEVR SPENT MONEY BECOZ I CANT AFFORD TO. DOES THAT MEAN YOU FUKING BAN MY ACCOUNT?? I LIVE IN FIJI. ITS FUKED UP HERE. THE POWER GOES OUT WITH OUT NOTICE. I FUKING WAKE UP WHOLE NIGHT TO PLAY THIS, FUKING WAKE UP WHOLE NIGHT. FUK\r\nINCONSIDERATE FUKERS. THE LOT OF YOU","replies":[{"poster":"Tele","date":"2017-01-06T09:44:48.669+0000","up_votes":3,"down_votes":0,"body":"I'm almost certain you did not get a 2 week ban for AFKing. 2 week bans for AFKing only happen in extreme cases of intentional AFKing. \n\nYou need to contact [Riot Support](https://support.riotgames.com/hc/en-us/requests/new) and ask why you were actually banned.\n\nAlso for next time you might want to do this\nhttp://pad3.whstatic.com/images/thumb/5/5c/PushButton-Step-2.jpg/670px-PushButton-Step-2.jpg","replies":[]},{"poster":"Call me AAKAA","date":"2017-01-06T11:42:14.735+0000","up_votes":1,"down_votes":3,"body":"100 percent sure buddy","replies":[{"poster":"SEKAI","date":"2017-01-06T11:47:25.493+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=cerebus,realm=OCE,application-id=T8eq2lFQ,discussion-id=MK7TzVig,comment-id=0001,timestamp=2017-01-06T11:42:14.735+0000)\n>\n> 100 percent sure buddy\n\nWhat Tele was trying to get to is that, unless AFK'ing is an established common activity within your profile, 1 or a couple sudden power outage or otherwise emergency AFK shouldn't have given you a ban unless there's an error (which is why they ask you to send in support ticket because afaik they could disclose why you are given the ban as long as it's not about cheating).","replies":[]},{"poster":"Ninox","date":"2017-01-06T12:19:16.517+0000","up_votes":2,"down_votes":0,"body":"Exactly as SEKAI said. You would not be 14 day banned for a few dcs, you would get Leaver buster timers. To get banned for leaving games you have to be leaving an extraordinary number of ranked games. If all of those leaves were because of power outages then it's on you not to play ranked when you know your power is unreliable.\n\nThis is a multiplayer game, and every time you leave you are destroying the experience for 9 other players. Unreliable power may be a risk YOU are willing to take, but it is not one that you should be forcing others to, especially in ranked.","replies":[{"poster":"Nightjar","date":"2017-01-07T23:25:10.235+0000","up_votes":1,"down_votes":0,"body":"although for newer players leaver buster can appear to be a ban for the unobservant. It was really funny the first time my sister flipped out over leave buster after she rage quit a match.","replies":[{"poster":"Ninox","date":"2017-01-08T04:57:25.750+0000","up_votes":1,"down_votes":0,"body":"I'm like 90% sure he mentioned somewhere in the OP that it was a 14 day ban. I remember reading it, and clearly Tele and SEKAI read the same so it seems perhaps that comment was removed. If it was because he was mistaken about the nature of Leaver Buster bans I can understand that.\n\nIt is possible to be 14 day banned for leaving ranked games though, so I'm not really sure what happened here.","replies":[]}]}]}]}]}