{"poster":"fullmoonmoon","date":"2015-05-06T12:46:07.741+0000","title":"Suche Bronze V team","subforum":"Clans & Teams","embed":{"description":null,"url":"http://euw.op.gg/summoner/userName=fullmoonmoon","image":null},"up_votes":4,"down_votes":4,"body":"da meine stats mit meinem main ziemlich durchs zocken sehr versaut sind (nur noch 74% winratio) such ich ein bronze v.\nich biete an\ntop viktor\nmid viktor\nadc viktor \nsup viktor \nund auch einen sehr starken jungle viktor.\nauch duo top viktor ist m&ouml;glich fehlt mir aber noch etwas erfahrung vllt k&ouml;nnt ihr mir ja da helfen.\n\neinfach adden und los gehts\n\n\n(als gegenleistung für die aufnahme bin ich gerne bereit meine dienste anzubieten, fußmassage, rasenmähen, glühbirnen auswechseln, freundin zu ihrem loverfahren, freund ins bordell fahren uvm.)","replies":[{"poster":"Almosender","date":"2015-05-06T17:09:47.572+0000","up_votes":2,"down_votes":0,"body":"Made me laugh xD","replies":[]},{"poster":"Pixelonium","date":"2015-05-06T17:49:45.327+0000","up_votes":1,"down_votes":0,"body":"wir sind diese season aufgrund von einem fehlenden mitspieler noch unranked, waren aber letzte season bronze 5 ^^ hätten starken bedarf and einem support viktor, kannst dich ja gerne melden ;)","replies":[{"poster":"fullmoonmoon","date":"2015-05-06T17:57:15.899+0000","up_votes":1,"down_votes":0,"body":"das doch schonmal guter start ich check mal ob ihr auch den nötigen skill für bronze habt dann trollen wir die 5 games und schon sind alle happy","replies":[]}]},{"poster":"Alustus","date":"2015-05-06T14:21:21.760+0000","up_votes":1,"down_votes":0,"body":"Korrigiert mich wenn ich falsch liege, aber:\n\nIst es nicht so, dass bei Teamrank eine eigne MMR existiert?\nIst es nicht so, dass wenn man gegen niedrigere Elo Spieler weniger MMR bekommt und mehr verliert?\nIst es nicht einfacher seine Elo zu steigern wenn man einfach weiterspielt, wenn man eine Winrat von 74% hat?","replies":[{"poster":"fullmoonmoon","date":"2015-05-06T14:54:21.852+0000","up_votes":1,"down_votes":0,"body":"ja das team hat eine eigene mmr darum macht es doch sinn dort mitzuspielen um meine stats wieder auf einen vernünftigen wert zubekommen. \ndas team selbst ist mir relativ egal wieviel elo es bekommt da es ja unmöglich ist mit mir zuverlieren sammelt sich das ja.","replies":[{"poster":"Alustus","date":"2015-05-06T14:56:33.040+0000","up_votes":1,"down_votes":0,"body":"Dann bekommst du ja auch keine bessere elo im SoloQ oder bist du nur auf eine bessere Winrate auf Lolking und op.gg aus?","replies":[{"poster":"fullmoonmoon","date":"2015-05-06T14:58:12.928+0000","up_votes":1,"down_votes":0,"body":"du hast es verstanden :D","replies":[{"poster":"Alustus","date":"2015-05-06T14:59:44.529+0000","up_votes":1,"down_votes":0,"body":"Mal schaun ob ich ein Team in Bronze bereich habe ;)","replies":[{"poster":"fullmoonmoon","date":"2015-05-06T15:00:28.959+0000","up_votes":1,"down_votes":0,"body":"hau rein wäre klasse und würd mich freuen","replies":[]}]}]}]}]}]},{"poster":"Feeluzi","date":"2015-05-06T13:32:29.719+0000","up_votes":1,"down_votes":0,"body":"Hey =)\nWir sind zwar Silber, bräuchten aber nen Viktor Top oder Jungle.\nMeld dich doch einfach ingame bei uns =)","replies":[{"poster":"fullmoonmoon","date":"2015-05-06T13:37:56.035+0000","up_votes":1,"down_votes":0,"body":"bitte um entschuldigung vielleicht schreib ich auch etwas undeutlich. \nes geht mir hier um ein BRONZE FÜNF TEAM danke für das angebot muss aber ablehnen, hoffe keine gefühle bei euch verletzt zu haben \n\nmfg","replies":[]}]}]}