{"poster":"MZA Sagittarius","date":"2017-11-22T19:31:38.344+0000","title":"¡El nuevo sistema de EA, apesta!","subforum":"Charlas Generales","up_votes":4,"down_votes":12,"body":"Yo creo que rito esta muy errado en lo que esta haciendo.\r\nAntes, al menos, en un promedio de 15 partidas superabas los 1.000 PI.\r\nAhora, con 15 partidas, si es que eso te alcanza, subes de nivel y ganas 800 o inclusive hasta 300/500 de EA.\r\nNo funciona esto que est&aacute;n haciendo, no sirve para nada. Mucho esfuerzo y no nos est&aacute;n dando la cantidad que minimamente se necesita para poder comprar un campe&oacute;n.\r\nAntes, en una semana comprabas uno de 6.300 y ahora tenes que subir cierta cantidad de niveles(Por ende m&aacute;s partidas que antes.), para poder hacer la misma compra.\r\n&iexcl;Vamos Rito! La gente no puede subir de nivel TODOS los d&iacute;as.\r\nP&oacute;nganse las pilas con eso, est&aacute;n arruinando el sistema de compras que es no P2W. Solo nos quieren obligar a donar RP para poder disfrutar de lo que deber&iacute;a se a costas de nuestro tiempo.\r\nYo ya no juego m&aacute;s LOL por esa raz&oacute;n, por que dedico las mismas partidas que antes, y no gano ni la mitad de lo que ganaba.\r\nA veces en la capsula te toca una Janna, un Malphite, eso &iexcl;NO SIRVE! Dedique 10/15 partidas por esa cantidad de EA. &iexcl;Es injusto!\r\nY los 50 de EA por primera victoria, no sirven PARA NADA. Antes la primera vitoria te daba 250 PI, al menos eso servia para algo y dentro de todo ayudaba. Motivaba a querer jugar la primera victoria del d&iacute;a.\r\n\r\nAhora no te dan nada por jugar una partida. Ganes o pierdas, ya el desempe&ntilde;o que pongas no se te retribuye. &iquest;Qu&eacute; con experiencia? &iquest;Qu&eacute; me compro con eso? &iquest;Qu&eacute; gano? &iquest;Alardear un nivel? &iquest;QU&Eacute; SENTIDO TIENE ESO? Antes pod&iacute;a alardear el comprarme un campe&oacute;n que reci&eacute;n salia, ahora para comprar uno tengo que jugar tres meses a ver si junto la EA.\r\nArruinaron el juego con ese sistema.\r\nPongan EA por partida, tal como era con el PI antes.\r\nLa gente que no tiene para donar o simplemente NO QUIERE, es esa que se ve perjudicada con todo este sistema tan asqueroso que han hecho.\r\nLol al menos antes val&iacute;a la pena jugarlo, ahora sinceramente, arruinaron TODO.\r\nMotivaba al jugador el adquirir un nuevo campe&oacute;n y poder empezar a adiestrarse a la hora de usarlo, intentar se bueno, jugar por que realmente lo anhelabas y te gustaba ese campe&oacute;n. Ahora para tener la misma motivaci&oacute;n a jugar, se necesita un promedio muy amplio y varios niveles.\r\nComo dije antes, al menos a mi, como a muchos m&aacute;s; No nos interesa subir de nivel y eso. Nos importa que se nos retribuya el tiempo que le dedicamos al juego.\r\n&iexcl;Ni las cuentas nos pertenecen! Lo dicen los t&eacute;rminos que aceptamos al jugar. M&Iacute;NIMO REGRESEN ALGO DE LO QUE SE LES DA.\r\nLeague of Legends no seria NADA sin la gente que los apoya y en su totalidad esos que NO donan. Son mayoritarios. No pueden ponerles tantas trabas para lograr algo o se van a quedar sin usuarios.\r\nAhora entiendo por que empezaron con publicidades en redes sociales y YT, se les esta desmoronando la comunidad y est&aacute;n perdiendo usuarios todos los d&iacute;as.\r\n  {{sticker:slayer-jinx-unamused}}  {{sticker:sg-ahri-1}} {{sticker:sg-shisa}}","replies":[{"poster":"skysoul fenrir","date":"2017-11-22T20:14:43.791+0000","up_votes":1,"down_votes":0,"body":"Mira, desde el cambio a las EA yo todavia conservo 26K como para gastar en lo que se me salga la gana, tengo tanto que esta ahi al pedo, y esa cantidad aun sigue aumentando, no soy de esos jugadores veteranos que tienen el maximo de pag de runas ni todos los champs, pero si alguien que sabe gestionar bien lo que tiene, a los que suben de nivel 1 les dan capsulas con minimo 5 champs adentro de los cuales son champs para principiantes pero con desencantar 2 o 3 ya te alcanza para comprar a alguno de los que tenes en fragmentos mientras que los otros los seguis guardando, y asi sigue a medida que subis de nivel.\nCapaz te quejas por que **VOS** no tenes escencia azul pero hay gente que no les afecto casi nada el cambio, los nuevos jugadores reciben bien y los veteranos tambien estan bien por que para ese momento ya tienen muchos campeones con los que jugar, si queres gastar EA en boludeces y te calienta no tener para gastar no vengas a quejarte de eso, si sos un fiebre del juego vas a tener EA y si sos jugador casual no te va a tener que importar en lo mas minimo, que este sea un sistema nuevo al cual no te adaptas todavia no significa que tengas que criticarlo, no es un sistema perfecto pero asi como hasta hace poco antes de los cambios ya implementaron cambios a la cantidad de exp que se ganaba, van a emplear cambios para que este sistema funcione mejor.\n\nPd: Perdiste total seriedad y credibilidad con los dibujitos del final","replies":[{"poster":"MZA Sagittarius","date":"2017-11-23T19:19:20.319+0000","up_votes":1,"down_votes":0,"body":"El tema de los \"dibujitos\" es ya problema mio ponerlos o no. El dictado no deja de ser serio por eso. \n\nVos tenes esa cantidad de EA, yo tengo 28k de EA y considero que después de un par de niveles no es como era antes. \nTengo esa EA y seguramente vos la tenes, gracias al sistema anterior. No seas hipócrita al decir que tenes esa EA, porque seguramente no la juntaste desde 0. (Es más bien parte del regalo de riot en EA x2x3x4x5)\n\nLa gente que apenas comienza, tiene la facilidad de conseguir una cantidad de 22k de EA hasta lvl 30, antes te juntabas los 22 k para las paginas de runas y te sobraba para comprar algún que otro campeón a gusto. \nLa EN desapareció literalmente, es que no se puede conseguir ya que la mayoría de bonificasiones están centradas en campeones de EA que dan como mucho 400/600 EA por NIVEL. Esa cantidad de PI se conseguía en un par de horas jugando. \nEsto esta centrado en que tengas que invertir para obtener beneficios. Poco a poco se esta volviendo un P2W y conforman a la prole con un icono, un skin, una capsula ¿Para qué? No me interesa la estética del juego, me interesa saber que puedo acceder igual que antes,(COMO TODOS), a un campeón de 6300 en una semana y no el mes entero. \nSi vos no trabajas, no estudias y te la pasas sentado en la PC es otra cosa, pero hay gente que si y que también le gustaría poder decir en un promedio de 10 días \"— ¡Genial! Me compre el campeón que quería.\" \n La gente que juega casualmente, es por que NO TIENE el tiempo de un adicto enfermo bueno para nada. Tiene muchas cosas importantes que hacer y seguramente en un margen de edad donde hasta estudian y trabajan, llegan a su casa y se echan una partida o dos, puede que un par de aram. \nSi riot se queda sin \"jugadores casuales\" ¿Tenes idea del margen de jugadores que perdería? ¿Te pensabas que solo los que donan RP son los que hacen a Riot una empresa líder del mercado de juegos en red? Claro que no, amigo, los jugadores casuales y los que no donan, son los que más ganas, dedicación y esmero le dedican. Pero no hay premios justos para estos, solo 50 EA y 1 campen de 260/360/ 600 con suerte en EA. ¿Donde esta tu lógica? \nNo busco mi beneficio, sino el de los que NO CUENTAN con ingresos para adaptarse a esta temática. {{sticker:sg-ahri-3}}  Y ahí tenes otro dibujito.","replies":[{"poster":"skysoul fenrir","date":"2017-11-27T15:29:03.043+0000","up_votes":1,"down_votes":0,"body":"1. No se si sabias que la gente puede armarse mas de una cuenta, yo ahora mismo estoy teniendo una smurf y desde esa misma cuenta que la estoy leveleando de a poco veo el sistema nuevo y no noto eso de que esto se vuelva un p2w, principalmente por que se sube rapidisimo.\n\n2. Me parece que si sos un nene desubicado que ni bien le dicen lo contrario empieza a insultar y degradar a los demas para tratar de imponer tu punto por sobre los de los demas no deberias de hablar sobre la vida de los demas, actualmente estoy estudiando para enfermeria mientras me mantengo a mi mismo y aun asi, el tiempo que le dedica cada uno al juego es asunto de cada uno, mejor quedate callado al respecto.\n\n3. Si no jugas no hay recompensa, si vas a discutir al menos tene la certeza de que lo que decis tiene sentido, si jugas poco vas a ganar poco, es asi y no solo en el juego, en la vida en general es asi, si te molesta que los que juegan un rato no ganen lo que ganan los que le dedican su tiempo al juego me parece que cometiste un error al hacer el post, al final te estas ridiculizando a vos mismo haciendote quedar como un caprichoso que quiere todo en el momento, si hablas de logica al menos mira la tuya.\n\n4. Solo quedas como un nene haciendo berrinches con esos dibujitos, mas si lo haces para tratar de molestar.","replies":[{"poster":"MZA Sagittarius","date":"2017-12-02T04:41:34.946+0000","up_votes":1,"down_votes":0,"body":"Lo que vos digas, campeon, lo que vos digas. \nPara que te voy a discutir si sos un inutil.","replies":[]}]}]}]},{"poster":"Painstrike","date":"2017-11-22T19:34:57.817+0000","up_votes":1,"down_votes":0,"body":">El sistema de esencia azul ha sido muy mal recibido. - Independientemente de si los numeros estan bien y ganas mas EA que PI .. el sistema se siente muy poco satisfactorio de la manera que esta construido. Subir de nivel se siente como una obligacion en vez de un proceso entretenido. A mucha gente no le gusta el factor aleatorio de cuanta EA obtienes, y si quedas corto 50-150 EA para un campeon que quieres, tienes que jugar 10 partidas mas solo para obtenerla.\n\n[\nYa se hablo del tema](https://boards.las.leagueoflegends.com/es/c/charlas-generales/ZptyBbk9-discusian-de-pretemporada?comment=00260000)","replies":[]},{"poster":"Salvor","date":"2017-11-22T19:38:37.445+0000","up_votes":1,"down_votes":1,"body":"Coincido EA apesta.\nhttps://gyazo.com/905d658fba1d87ad723a667a19c3e37c.gif","replies":[]},{"poster":"SKT T1 Bank","date":"2017-11-22T19:34:29.688+0000","up_votes":1,"down_votes":5,"body":"Quieren rp.\n\nhttps://i.ytimg.com/vi/6SBBJm2xJ1o/maxresdefault.jpg","replies":[]}]}