{"poster":"Zoryc","date":"2017-04-22T18:27:43.898+0000","title":"Frage zu Reports von Flamern","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Hallo, hatte  ein Game auf meinem Main, das mir wohl noch l&auml;nger in Erinnerung bleiben wird. Das Spiel lief nicht gut und ich habe fr&uuml;h einen Tower verloren, habe auch nicht wirklich gut gespielt. Kurz darauf haben mich dann zwei Mitspieler, die sogar noch einen schlechteren Score hatten, auf das &uuml;belste geflamed ( habe sowas noch nie erlebt), weil sie scheinbar einen S&uuml;ndenbock gebraucht haben. Habe dann einfach mein Ding durchgezogen und meine Lane gefarmed, woraufhin einer der Flamer dann meinte er w&uuml;rde ein Video zum Support schicken, weil ich angeblch das Spiel zerst&ouml;rt habe, was absolut nicht stimmt. Habe &uuml;brigens auch nicht zur&uuml;ckgeflamed, die Genugtuung wollte ich denen nicht g&ouml;nnen.\r\nHabe ich da jetzt mit meinem Account was zu bef&uuml;rchten, nein oder? Habe ja schlie&szlig;lich nichts gemacht, wurde aber mindestens 2x zu Unrecht reportet und evtl schickt dieser Typ echt ein Supportticket...","replies":[{"poster":"CMan","date":"2017-04-22T18:31:35.401+0000","up_votes":3,"down_votes":0,"body":"Wenn du weder flamst noch Spiele sabotierst noch AFK/untätig bist, dann passiert da gar nichts.\n\nBevor irgendwer bestraft wird, werden Reports immer überprüft, ob da was dran ist. Insofern, wenn es stimmt, was du sagst, sind diese Reports nur heiße Luft.\n\nSupporttickets sind in dem Fall auch absolut useless, denn alles was über das Standard-Reportsystem zu regeln ist, ist auch nur so zu melden. Da haben Tickets keinen Mehrwert.","replies":[]},{"poster":"Timethief49","date":"2017-04-22T22:11:24.183+0000","up_votes":2,"down_votes":0,"body":"Reports lösen eine Überprüfung des Spiels aus. Solang du undschuldig bist passiert dir nichts.","replies":[]},{"poster":"Released Ape","date":"2017-04-22T20:42:46.548+0000","up_votes":2,"down_votes":0,"body":"> evtl schickt dieser Typ echt ein Supportticket...\n\nDer Support überlässt das bannen in der Regel dem System, die greifen da äußerst selten manuell ein.\n\n> Habe übrigens auch nicht zurückgeflamed, die Genugtuung wollte ich denen nicht gönnen.\n\nWenn du nicht zurückgeschrieben hast, hoffe ich das du die gemeldet hast. Dir sollte nichts passieren, bis man in League gesperrt wird muss man schon einiges falsch gemacht haben. League ist da relativ tolerant was Fehlverhalten angeht, die Toleranz endet aber sobald man die erste Strafe erhalten hat und ab da geht es dann sehr schnell.\n\nNiemals zurückbeleidigen, einfach muten und am ende melden. Denn das System betrachtet immer isoliert, das heißt es interessiert nicht ob jemand anderes angefangen hat. Daher war deine Reaktion vollkommen richtig und du kannst beruhigt schlafen gehen. Nimm dir auch die Aussagen von deinen Mitspielern nicht zu Herzen - im Adrenalinrausch wird viel behauptet und gesagt was am Ende \"nicht so gemeint\" war. Leider wird einigen Neulingen ein gefährliches Prinzip beigebracht von den Älteren: \"Wer flamed wird nicht nicht geflamed, ist einfach so\" ~ diese Aussage ist so das dümmste was ich je gehört habe als jemand seinen Flame rechtfertigen wollte. Ich will auch nicht näher auf die Person eingehen, nach einen Game wurde ich ohnehin vom Teamspeak gebannt, weil ich es gewagt habe den Blue Buff ohne die Erlaubnis des Junglers zu machen (Xin Zhao: \"Wenn du den jetz..wenn du den jetzt machst bist du hier ganz schnell gebannt Freundchen\") naya ist aber auch schon etwas her xD an sowas erinnert man sich gern.","replies":[]}]}