{"poster":"Zoryc","date":"2019-01-28T18:02:59.676+0000","title":"Läuft LoL auf diesem PC auf höchsten Einstellungen bzw könnt ihr mir diesen PC empfehlen?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, da ich mir nach Empfehlung von Bekannten einen neuen PC holen will und mir &ouml;fters eine Seite namens &quot;hardwarerat&quot; empfohlen wurde, bin ich mir am &uuml;berlegen ob ich mir den dortigen Fertig PC f&uuml;r knapp 800&euro; hole.\r\nVorher wollte ich jedoch mal nachfragen, ob damit League auf h&ouml;chsten Einstellungen fl&uuml;ssig l&auml;uft. Der PC hat laut Website folgende Daten und ist haupts&auml;chlich f&uuml;r League gedacht:\r\n\r\nProzessor \tAMD Ryzen 5 2600\r\nProzessork&uuml;hler \tLC-Power LC-CC-95\r\nMainboard \tMSI B450M Pro-VDH V2\r\nRAM \t16GB 3000Mhz G.Skill Aegis (2x 8GB)\r\nSSD \t240GB Crucial BX500\r\nFestplatte \t1000GB Toshiba P300\r\nGrafikkarte \t8GB Powercolor RX580\r\nNetzteil \t500W be quiet! Pure Power 11\r\nGeh&auml;use \tAntec P7 schwarz/rot\r\nZus&auml;tzliche L&uuml;fter \t1x 120mm be quiet! Pure Wings 2\r\nBetriebsystem \tWindows 10 Pro 64bit\r\n\r\nDa ich leider 0 Ahnung von Technik habe sagt mir das nicht gerade viel, eventuell kann mir da jemand sagen ob da LoL auf very high l&auml;uft.\r\n\r\nUnd ich habe mal noch eine Frage: Diese Seite bietet Win10 f&uuml;r 16 Euro  an wenn man es einzeln kauft, laut der Seite sind das sognannte OEM-Schl&uuml;ssel, sind das seri&ouml;se Schl&uuml;ssel und ist das dann das ganz normale Windows 10 dass man dann ohne Sorge f&uuml;r LoL /  Steam / LibreOffice nutzen kann? Bisher dachte ich n&auml;mlich das man das bei Microsoft direkt als CD kaufen und von da installieren muss.\r\nIch frage, weil der Fertig PC wohl auch mit diesem Schl&uuml;ssel dann vom Verk&auml;ufer Windows10 vorinstalliert bekommt bevor er an mich geliefert werden w&uuml;rde.","replies":[{"poster":"recon","date":"2019-01-28T18:03:53.249+0000","up_votes":1,"down_votes":0,"body":"Reicht locker.\n\nDu kannst dir so einen OEM Win10 Key auch auf Ebay für ~4€ kaufen. Ist alles legal und funktioniert einwandfrei.","replies":[]}]}