{"poster":"zezzypiro133","date":"2016-07-23T01:09:23.385+0000","title":"Main nautilus support qualche consiglio??","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Adoro nautilus, lo adoro cos&igrave; tanto da aver comprato tutte le sue skin, in game solitamente starto di q, poi sblocco la w e la e, maxo la w per avere pi&ugrave; sustain in lane in early, poi maxo la q, secondo voi &egrave; appropriata come scelta??","replies":[{"poster":"1NG Faabier","date":"2016-07-23T08:41:43.427+0000","up_votes":1,"down_votes":0,"body":"Allora,io con Nautilus (supp) me la cavo molto bene ma non sono proprio un main.\nComunque anche io faccio la stessa cosa con la sola differenza che dopo aver maxato la W metto 2 punti sulla Q e poi vado di E ignorante... Insomma,maxo la W,metto 2 punti sulla Q (arrivando a 3),maxo la E,maxo la ulti e poi metto gli ultimi 2 punti sulla Q","replies":[{"poster":"zezzypiro133","date":"2016-07-24T00:08:13.405+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Faabier,realm=EUW,application-id=cAOZwaUi,discussion-id=HstVfT96,comment-id=0000,timestamp=2016-07-23T08:41:43.427+0000)\n>\n> Allora,io con Nautilus (supp) me la cavo molto bene ma non sono proprio un main.\n> Comunque anche io faccio la stessa cosa con la sola differenza che dopo aver maxato la W metto 2 punti sulla Q e poi vado di E ignorante... Insomma,maxo la W,metto 2 punti sulla Q (arrivando a 3),maxo la E,maxo la ulti e poi metto gli ultimi 2 punti sulla Q\n\nPerché quei due punti alla q?? Scusa ma non lo capisco","replies":[{"poster":"1NG Faabier","date":"2016-07-24T07:55:16.085+0000","up_votes":2,"down_votes":0,"body":"Io lo faccio solo per eidurre un pochino la ricarica.^^","replies":[]}]}]},{"poster":"Unlucky Cuchu","date":"2016-07-23T22:51:54.922+0000","up_votes":1,"down_votes":0,"body":"In teoria si dovrebbe partire di E, poi Q poi W poi ti maxi la E poi la W e infine la Q. Devi \"spammare\" la E non la Q e giocare molto aggressivo all'inizio per cercare di far snowballare l'adc. Invece nel mid/late game sei molto meno utile di altri support come karma, braum, sona eccetera quindi devi dedicarti a punire gli errori, in particolare devi lanciarti su quelli squishy che \"tirano fuori la testa dal gruppo\" per lanciare spell.","replies":[{"poster":"Kazushi San","date":"2016-07-26T22:09:27.309+0000","up_votes":1,"down_votes":0,"body":"No dai, al massimo mid late perde danni...ma un champ con 4 cc non puoi dirmi che perde di utilità dai xD nella prossima patch gli buffano pure lo della ult a chi sta in mezzo al target xD","replies":[]}]},{"poster":"Ste the ripper","date":"2016-07-23T23:13:23.216+0000","up_votes":1,"down_votes":0,"body":"Gioca aggressivo, devi spaccare la bot.\nComunque nautilus e leona in bot sono quasi lo stesso campione, al momento è meglio leona però","replies":[]},{"poster":"Anubis Raven","date":"2016-07-23T15:47:03.901+0000","up_votes":1,"down_votes":1,"body":"ciao, io ho giocato molto nautilus, tanto da salire da bronzo 3 a silver 5 dopo di che iniziai a giocare anche altri support tipo alistar. comunque all'inizio nei primi 3 livelli faccio sempre QEW, ma dopo finisco prima la E poi la W e infine la Q. vi chiederete forse perché meglio la E e non la W che da scudo. ve lo spiego subito, la W scala di 65,70,75,80,85 + il 10% della salute massima ( la salute massima per ogni livello della W ) e ci da un bonus di attacco di 30/40/50/60/70 danni magici per colpo + il 40% del potere magico massimo, che credo nessuno buildi nautilus sup ap, in poche potenzierete lo scudo da livello 1 a livello 5 di soltanto 20 hp quindi credo sia inutile sprecare 4 livelli per 20 hp in più, se lo fate per avere più danni vi spiego anche perché meglio potenziare la E. la E fa danni magici equivalenti a 55/85/115/145/175 + 30% di danni magici per ogni ondata ( nautilus ne fa 3 ) e rallenta i nemico di 30/35/40/45/50 % per 1.25 secondi. in poche parole potenziando prima la E rallenterete del 20% la velocità del nemico rispetto al livello 1 e farete 120 danni in più per ogni ondata, e capita che l'adc oppure chiunque voi grabbiate subisca anche 2 ondate o 3 ( premessa le ondate che colpiscono il bersaglio fanno 50% di danni in meno rispetto alla prima e alla seconda quindi se uno si prende tutte e 3 le ondate infliggerete 175/85/85 quindi infliggerete massimo 350 danni.\nla Q va lasciata per ultima perché molto più utili le altre 2 abilità. \nNautilus lo trovo molto forte poiché ha l'ancora bella larga quindi grabba il nemico anche se si sposta leggermente di lato, poi i continui rallentamenti e scudi sono ottimi. io non buildo mai mana su nautilus perché in late basta parecchio il mana che avete quindi concentratevi su vita armatura e resistenza magica, il gameplay è simile a quello di blitz e tresh quindi sbizzarritevi. più che spiegarvi come giocare fate prima a vedere i gameplay di nautilus. spero di esservi stato utile","replies":[]}]}