{"poster":"Fazi","date":"2015-12-03T23:50:14.633+0000","title":"Einen Promowin geschenkt bekommen?","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":0,"body":"Ich hab heute Rankeds gespielt und als ich in die Promo kam hab ich direkt einen Win geschenkt bekommen. Also ich bin quasi eingestiegen und hatte direkt ein H&auml;kchen.\nWas hat das zu bedeuten?","replies":[{"poster":"BM Vilich","date":"2015-12-04T05:40:55.333+0000","up_votes":2,"down_votes":0,"body":"Ich verstehe generell nicht, wieso man das einführen sollte, und dann nur bis Gold 1.\nAlles was wir davon haben, ist eine Eloinflation bis Plat V.","replies":[{"poster":"HyperionCH","date":"2015-12-04T08:37:10.875+0000","up_votes":2,"down_votes":0,"body":"Nein, es gibt keine Elo-Inflation bis Platin V, da die Elo gar nicht davon betroffen ist.\n\nElo = MMR (aka Hidden Elo, aka Hidden MMR)\n\nRang = Rang (welche zwar meist nahe an der Elo ist, aber nicht zwangsläufig auf Höhe der Elo ist)\n\n\nNatürlich ist eine \"Rang-Inflation\" möglich. Dass heisst, dass - da der Aufstieg erleichtert wird - öfters Spieler einen höheren Rang haben als ihre (Hidden) Elo eigentlich besitzt.\nJedoch steigt man auch ohne Relegation (oder ähnliches) ab, wenn man 0 LP hat und die (Hidden) Elo\nzu tief ist. Dies wirkt einer \"Rang-Inflation\" also entgegen.\n\nDamit profitieren von der Änderungen längerfristig nur jene Spieler, die auch eine genug hohe Elo für den nächst höheren Rang besitzen, aber die Promo nie schaffen (z.B. wegen Pech oder weil sie in den Promos zu angespannt/nervös spielen)","replies":[]}]},{"poster":"2moster","date":"2015-12-30T13:04:52.055+0000","up_votes":1,"down_votes":0,"body":"also ich glaub die anzeige dass du in der promo bist kam ein game davor","replies":[]},{"poster":"nklxx","date":"2015-12-04T15:27:49.721+0000","up_votes":1,"down_votes":0,"body":"hab sogar 2 wins bekommen","replies":[]},{"poster":"Sirrkas","date":"2015-12-03T23:55:11.210+0000","up_votes":1,"down_votes":0,"body":"Den kriegt man seit dem letzten Patch bis Gold 1, falls man eine Promo wiederholt.","replies":[{"poster":"Fazi","date":"2015-12-03T23:55:58.138+0000","up_votes":1,"down_votes":0,"body":"Huch, hab ich aber nie getan... komisch.","replies":[{"poster":"ChimeCollector69","date":"2015-12-04T00:00:59.350+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch letztens einen solchen win \"geschenkt\" bekommen. Ich weiß nicht ob ich vorher schon mal in Promo war, aber ich weiß, dass ich 99 Punkte hatte. Effektiv habe ich dann also nur einen Punkt für den Win bekommen, vielleicht wir in solchen Fällen das dann auch direkt als Promosieg gewertet, da es mehr oder weniger Pech ist, dass du vorher nicht schon die 100 Punkte hattest.","replies":[{"poster":"BM Vilich","date":"2015-12-04T05:36:24.273+0000","up_votes":1,"down_votes":0,"body":"Du warst schon mal in den Promos, sonst hättest du den win nicht bekommen.\nDass man einen win kriegt, wenn man mit 99p in die Promos kommt ist leider nicht möglich.","replies":[]}]}]}]}]}