{"poster":"Yo sin Ella","date":"2018-06-11T23:04:25.669+0000","title":"Historia de flameo","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Hola,intenten no flamear en el juego,no tiene sentido. Para que responderle a ni&ntilde;os ratita,total nos exponemos a sanciones si lo hacemos.Total,la mayoria son ni&ntilde;os\n\nLes traigo una historia de flameo: \n\nLa cosa es que hace un mes m&aacute;s o menos,estaba jugando mid. El adc desde el early empez&oacute; a llorar en mayusculas porque el jg no le gankeaba y el support tocaba los minions o no se paraba donde el quer&iacute;a,para zonear. Esto fue escalando cual vayne en late,y empez&oacute; a flamear a todo el equipo por lo que sea,a un punto donde  pasado el minuto 30 le dijo a alguien &quot;Te encuentro en la calle te saco la cresta&quot;,no me acuerdo a quien fue.\n\nLa cosa es que ah&iacute; me aburri de el y quise ver que tan &quot;choro&quot; era como decimos aqui en Chile,la definici&oacute;n es &quot;valiente&quot;,pero no se cual ser&aacute; el modismo en Argentina. Y le dije &quot;Oye Jinx,donde vives? Voy a ir a sacarte la conchetumare&quot;,y no volvio a hablar en todo el game.\n\n**Cuentenme algunas historias suyas tambien?**","replies":[{"poster":"Vaaš","date":"2018-06-12T01:13:14.993+0000","up_votes":2,"down_votes":0,"body":"Hmmm esta bien...una noche jugando ARAM con mi **ex-dúo.**\n\nMe salió Jhin y a él no recuerdo, lo que si recuerdo fue que en el team enemigo había un Talon, perdimos y como suele pasar nos toco otra vez con **el mismo tipo pero esta vez en nuestro team,** le toco Ziggs, a mi otra vez Jhin (lo sé increíble <4) y a mi ex-dúo Alistar.\n\nEl tema acá fue que en champ select antes de los últimos seg. El Ziggs que antes era el Talon enemigo me dice \"Jhin\" fue el único que hablo y yo no lo reconocí pero me llamo la atención, y mi dúo me pregunto por interno quién era si lo conocía, **le dije la verdad...** obviamente ni idea de quién era y comienza la partida.\n\nEn partida a poco tiempo de iniciar... el Ziggs vuelve a hablarme diciéndome \"Jhin\" otra vez, a mi dúo le molesto creo, le pongo un \"?\" y me dice \"soy el Talon :p\" yo hago memoria y recordé que en la partida anterior había un Talon enemigo y claro vi el nombre Otaku y si era el mismo tipo pero mi dúo se molesto tanto que le empezó a tirar mier.\n\nYo ni idea que estaba pasando **me sorprendió,** mi dúo comenzó a insultarlo por el solo hecho de ser/tener un nombre Otaku pero fue extraño ya que **nos habían tocado con gente con ese tipo de nombres y nunca los insulto,** yo solo me sorprendí luego se me viene a la mente que lo insulto no solo por ser Otaku **sino porque me estaba hablando a mi,** mi ex-dúo era algo más que solo un dúo... si eras tú </4\n\nSimplemente me sorprendió como si lo fuese a engañar con un **RANDOM** o lo que sea, ni a palos engaño por cierto pero la situación me pareció extraña tanto que incluso aun tengo las capturas de ese día... por eso sé lo que me decían **gracias a este post recordé esto** y donde estaba la carpeta con las imágenes LOL\n\n**_PD: ese día te molesto que no te respondiera rápido por interno, era porque estaba haciendo capturas, gracias por el recuerdo ahora me estoy riendo de lo que le decías. \nsadkjhaskdh ste man_** {{champion:202}} ","replies":[{"poster":"Bunny Cookie","date":"2018-06-12T02:16:24.787+0000","up_votes":2,"down_votes":1,"body":"Baia baia, pero ke beo akí","replies":[{"poster":"Vaaš","date":"2018-06-12T02:56:27.410+0000","up_votes":1,"down_votes":0,"body":"Mi querido Rox!! :D que estaís haciendo aquí tío? o.O me mola verte acá ALKSDJASLDK\n\n¿Buscando algún otro drama en el foro? Además de la vida misma.\n\n{{champion:202}}  \"\"Donde esta el drama?\"\"------\"\"Tengo ansias de melodrama\"\" {{champion:202}} ","replies":[{"poster":"Bunny Cookie","date":"2018-06-12T03:55:00.360+0000","up_votes":1,"down_votes":0,"body":"Wena po, komo etai cuantico qlo wn dsadasfwqed\n\nClaro, y siempre que veo un post con salseo te encuentro, HM, coincidencia? serian muchas ya.\n\n>\"\"Donde esta el drama?\"\"------\"\"Tengo ansias de melodrama\"\" \n\nPillina, vives rodeada de drama y novelas. :) ~~arregla tu internet para jugar po wn~~","replies":[{"poster":"Vaaš","date":"2018-06-12T07:04:07.835+0000","up_votes":1,"down_votes":0,"body":"> Wena po, komo etai cuantico\n\nEra CUATICO ._.\n\n> vives rodeada de drama y novelas.\n\nLamentablemente, la desgracia me persigue por eso aparecen personas cínicas en mi vida para arruinarme ;) \n\nTu no tío que sos la ostia (?) cuando pase la tormenta nos jugamos sus partidas :3","replies":[{"poster":"Bunny Cookie","date":"2018-06-12T14:50:15.042+0000","up_votes":1,"down_votes":0,"body":">Era CUATICO ._.\n\nOH NO, perdoname la vida po :(\n\n>Lamentablemente, la desgracia me persigue por eso aparecen personas cínicas en mi vida para arruinarme ;)\n\nEso te pasa por ser muy popular, los que son como yo, desconocidos, pasamos sin pena ni gloria pero muy tranquilos(?)\n\n>cuando pase la tormenta nos jugamos sus partidas :3\n\nShi :( con Valentín(?)","replies":[{"poster":"Vaaš","date":"2018-06-12T15:16:16.978+0000","up_votes":1,"down_votes":0,"body":"> OH NO, perdoname la vida po :(\n\nNp cualquiera se equivoca :3\n\n> Eso te pasa por ser muy popular\n\nNahhh yo no soy popular o quizás si... **soy una persona muy modesta y humilde** por lo demás, pero por ser main Jhin me han dicho de todo y tengo pruebas hdskashjdk ._.\n \n> Shi :( con Valentín(?)\n\nMi querido Val... que siempre **se hecha la culpa de todo** ;'C como yo alguna vez en pareja.\n\nOjalá no lo siga haciendo **tiene buen corazón como nosotros siendo tan joven,** podría culpar/flamear al team o a nosotros mismos **como cualquier otro** pero se culpa de todo el mismo y tengo que siempre hablar con el cuando se sale del voice chat D': \n\nPD: Val si lees esto no lo leas............ ahre e.e HASKJDHDK","replies":[{"poster":"Bunny Cookie","date":"2018-06-12T15:42:29.972+0000","up_votes":1,"down_votes":0,"body":">pero por ser main Jhin me han dicho de todo y tengo pruebas hdskashjdk ._.\n\nEso quiero verlo jaja\n\n>podría culpar/flamear al team o a nosotros mismo\n\nEs un buen chaval, pero si lo he visto pelearse con el otro team eh xD!","replies":[{"poster":"Vaaš","date":"2018-06-12T17:09:37.842+0000","up_votes":1,"down_votes":0,"body":"> Eso quiero verlo jaja\n\nTe pasó la evidencia por Discord entonces asdhjaskj\n\n> Es un buen chaval, pero si lo he visto pelearse con el otro team eh xD!\n\nSi >:D no los flamea pero les hace comentarios un tanto... ¿Cómo decirlo? comentarios un tanto... \n\nLe he dicho que no lo haga y se lo seguiré diciendo ):< **es como mi hijo** <3 asdgasdg e.e además no quiero que lo baneen -.- ","replies":[]}]}]}]}]}]}]}]},{"poster":"Yo sin Ella","date":"2018-06-12T01:47:02.874+0000","up_votes":1,"down_votes":0,"body":">a mi otra vez Jhin (lo sé increíble <4)\n\nNotable ese <4\n\nTu ex-duo era tu pareja? Re celoso el pibe.","replies":[{"poster":"Vaaš","date":"2018-06-12T02:54:31.119+0000","up_votes":1,"down_votes":0,"body":"> Notable ese <4\n\nLo sé pero... ahora es </4\n\n> Tu ex-duo era tu pareja? Re celoso el pibe.\n\nLo era, al parecer si quizás cuánta COSA era lol","replies":[]}]}]},{"poster":"Bunny Cookie","date":"2018-06-11T23:55:47.537+0000","up_votes":2,"down_votes":0,"body":"Hm.\n\nNo sé si contará como historia de flameo, pero ahí va:\n\nCuando jugaba en NA en la selección de campeones (ranked) apareció un tío que decía que no le gustaba el color morado, nadie le prestó atención y simplemente fue ignorado, pasa que el top pickeó a Jax (sin skin) y apenas comenzó la partida dijo que como no le gusta el color morado se iba ir afk después de regalar 2 kills en cada linea, cuando terminó de hacer intentional feeding empezó a pasar la dirección IP de cada uno, ni idea cómo lo hizo y ahí despues hizo ragequit.\n\nCabe destacar que todo fue en la S2, cuando el juego aún tenia ciertas vulnerabilidades y me quedé loquísimo xD","replies":[{"poster":"Yo sin Ella","date":"2018-06-12T01:47:41.313+0000","up_votes":1,"down_votes":0,"body":"Tremendo troll XD cuando los trolls eran hackers de la nasa y no niños ratas ","replies":[{"poster":"Bunny Cookie","date":"2018-06-12T02:16:03.560+0000","up_votes":1,"down_votes":0,"body":"Ya hombre, los de ahora están en pañales, recuerdo que en WoW te sacaban la IP por skype y te hacian DDOS para perder arenas, esa moda tambien llegó a league, en ocasiones los trolls mandan a pedir pizzas a las casas de los streamers o llamaban a la policía con falsos reportes de homicidio xD","replies":[]}]}]}]}