{"poster":"Yo sin Ella","date":"2018-10-27T06:28:09.042+0000","title":"Que es el abuso verbal para Riot,y qué no?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"El limite es un poco ambiguo para Riot,no me han baneado o algo as&iacute;,pero en verdad siento que el limite esta un poco difuso\n\nPor ejemplo\n\nJugu&eacute; una partida con Pyke. Todas las lineas se perdieron y todas jugaron mal. Mi top perdio linea,mi Zed diveaba torre con la R,le tiraban un CC y moria.Mi jungla se metio bajo torre lvl 4 y por salvarlo,morimos los 3;triple para lucian.\n\nLa cosa es que en la proxima partida,en selecci&oacute;n de partida me toca con el mismo jungla. Y como habia un Zed denuevo,este dice : &quot; Oye Zed,perdiste contra una lissandra ahora mismo?&quot;. El Zed responde que no. Y El jungla agrega &quot;Ah vale,es que acabo de perder por un top troll&quot;.\n\nYo estuve en la misma partida,asi que acot&eacute;: &quot;Oye jg,yo tambien estuve en esa patida. Y tu tambien jugaste horrible. Chaseaste al Lucian bajo torre lvl 4 y eso le dio una triple al lucian&quot;\n\nBueno,me dio mil excusas y entrada la partida me dijo &quot;muted&quot;. Yo acoté \"No es por flamear,es solo que si vas a boquear al top,porfavor\".\n\nYo encuentro que lo puse en su lugar con todo respeto.No fue un abuso verbal.","replies":[{"poster":"Jüstice","date":"2018-10-27T09:03:26.626+0000","up_votes":3,"down_votes":0,"body":"La gente que juega es muy \"especial\", por no decir otra cosa... simplemente no uses el chat en una partida porque cualquier cosa que acotes, buena o mala, siempre se terminan tomando de la peor forma, lo mejor es mantenerte alejado de esta gente y jugar tu partida \"solo\", que a los demás los parta un rayo.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Migatte no Macu","date":"2018-10-27T08:07:29.708+0000","up_votes":2,"down_votes":0,"body":"Siendo franco y siguiendo las reglas, el abuso verbal ya comenzó al decirle que era \"horrible\". Un riot ya puede averte dicho que no le digas nada o que lo mutees es decir que te guardes el comentario porque hay personas que no se toman bien ese tipo de abuso y puede llegar a jugar mal o perder a propósito\n\nMacu{{champion:555}}","replies":[]}]}