{"poster":"Yo sin Ella","date":"2018-05-23T02:20:43.262+0000","title":"Podemos usar los ticket de clash para espectear las partidas de la gente que juegue clash?","subforum":"Charlas Generales","up_votes":10,"down_votes":1,"body":"Bueno,hola. Soy un peque&ntilde;in jugador de plata 2 y  no me gusta mucho el ambito competitivo de equipos del lol porque es mucho compromiso y me gusta jugar simplemente cuando quiero,pero tambien tengo la opcion de comprar boletitos de clash.\n\nNo podemos usarlos para espectear? seria divertido poder escuchar a los 2 equipos como se comunican por audio.\n\n\nAsi como boletos para entrar a una arena romana como espectador,los espectadores tambien podriamos votar por quien fue el MVP de la partida y le dan un premio,como cofre+llave {{champion:24}} ","replies":[{"poster":"Nabuze","date":"2018-05-23T12:31:24.394+0000","up_votes":2,"down_votes":0,"body":"Mientras leía tu idea se me ocurría que el espectador pudiera comprar un boleto de clash apostando por un equipo en particular y dependiendo en qué etapa quedará ese equipo devolverle la ea invertida o duplicarla.\nAsí los lvl bajo que no les gusta competir tendrían un motivo para ver las partidas y aprenderían más al verlas.\n\nAhora como toda idea que pensas que es superwow hay que buscarle los problemas y el primero que se me ocurrió fue la cantidad de partidas en paralelo que hay en clash al mismo tiempo.\n- ¿Como eliges a quien votar? \n- ¿Como disfrutas todos los juegos? \n- ¿Que nivel de partida quieres espectear? (se dividen en 4).\n\ntendrías que poder ver una cantidad importante de rosters porque sólo podrás ver un torneo de un solo nivel y una sola sección ya que las demás acabarán al mismo tiempo o similar.\n\nEsta buena la idea de espectear pero este modo de juego no es como lq programación del competitivo al que estamos acostumbrados que se divide para que podamos ver todos los partidos.\n\nSi quieres ver cómo tú amigo juega clash podrías verlo de forma gratuita con clickear \"ver partida\" sobre tu amigo en tu lista. (No se si estará prohibido por ser clash)","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-05-23T05:01:17.124+0000","up_votes":2,"down_votes":0,"body":"En vez de usar boletos de Clash ¿No sería mejor que pudiéramos comprar boletos (de espectador, lol) para ver partidas por un precio menor a un boleto de Clash?\n\nCon respecto al audio y la votación, crear algo así lleva tiempo, así que no sé si es posible, seguro lo sea pero hay que ver si rinde o es popular, eso es lo que detiene muchos proyectos, no solo en rito games sino en muchos otros lugares.\n\nMe parece súper interesante la idea, up^\n\no.o/","replies":[{"poster":"Yo sin Ella","date":"2018-05-23T18:20:46.697+0000","up_votes":1,"down_votes":0,"body":"Sería bueno si pudieses etiquetar de alguna manera a un Rioter o agente del soporte para que le lleven esta idea a la central de Riot,sino esta idea se perdera en el vacio de las buenas ideas","replies":[{"poster":"ZanahoriaAsesina","date":"2018-05-24T14:51:01.174+0000","up_votes":1,"down_votes":0,"body":"No problem! ^^","replies":[]}]}]},{"poster":"rokushoger","date":"2018-05-23T11:05:15.172+0000","up_votes":1,"down_votes":0,"body":"Opino igual que zanahoria, pero estaría bueno que los boletos para espectear fueran en EA.","replies":[]}]}