{"poster":"Sweetiex","date":"2016-02-23T10:45:29.323+0000","title":"People who talk about K/D/A like it's an argument.","subforum":"Player Behavior","up_votes":53,"down_votes":13,"body":"What is it with this unhealthy obsession over KDA these days?? &quot;2/6 noob, report&quot; \r\n\r\nLike I&#039;m sorry mister 2/1/0 mid laner, but if your lane opponent and the enemy jungler keep diving me and my support in bot lane I&#039;m going to have a bad K/D/A. Saying that I&#039;m 2/5 or whatever and calling for reports doesn&#039;t make sense. There&#039;s not much I can do against 4 man dives. \r\n\r\nYou on the other hand could atleast take that mid tower, couldn&#039;t you? no? Ok.","replies":[{"poster":"Kei143","date":"2016-02-23T11:44:59.990+0000","up_votes":12,"down_votes":4,"body":"imagine how i feel as a support going 1/10/23 but they call me a feeder ..\n\nit normally ends up me giving a chuckle knowing that they don't know enough about the game.","replies":[{"poster":"Lauchmelder","date":"2016-02-23T12:06:49.595+0000","up_votes":19,"down_votes":5,"body":"Technically speaking 10 deaths **is** feeding.\nDon't hate me though, I had a few of those games too lately. Feelsbadman","replies":[{"poster":"XeroKimo","date":"2016-02-23T12:39:00.283+0000","up_votes":9,"down_votes":1,"body":"But but but..... 24 kill participation","replies":[]},{"poster":"Kei143","date":"2016-02-23T15:16:12.757+0000","up_votes":7,"down_votes":4,"body":"**Shrug * *\n\nthen call me a feeder and report me. see if that does anything to me.\n\ndepending on who says that, and how it was said, i will stop supporting you. See how you do in team fights. Typically it just means I peel for someone else.\n\n(yes, downvote me, i am passive aggressive, but i don't like it when I'm the one setting up the plays and providing enough damage & CC absorbsion, peeling and the team gets ahead and then gets called out negatively for it.)\n\nAt the end though, I'm pretty sure my instincts will still shield you, as I can't bare to see people I can save die in front of me.","replies":[{"poster":"Knalxz","date":"2016-02-23T22:37:44.057+0000","up_votes":1,"down_votes":1,"body":"If someone calls you a feeder you'll stop supporting them? Ok, sure, I bet that's never happened in a game that you've won.\n\nYou're the kind of teammate to get upset at the jungler not ganking because they have to wait for a power spike then starts farming in their jungle saying\n\n\"YOU SHOULD OF GANKED FOR ME!\"\n\nYour self destructive powers are amazing, can't wait for the day they have you hanging. You've gotta work on that man.","replies":[{"poster":"Kei143","date":"2016-02-23T23:49:59.224+0000","up_votes":1,"down_votes":1,"body":"I'll stop supporting them if they are rude to me. I've done that in games I've won, as I don't need to win \"bot\" lane to win \"lane\". There was the one game, a Lucian claims that I'm probably a crappy support anyways and he thinks that people whom support all suck. I didn't go into lane with him. I stole first gromp against the enemy jungler and continued to pressure the enemy jungler. Lucian was left to 2v1, calling me bad for not joining him and me and our jungler would gank that lane (and get a double for the jungler). We pressured mid by counter ganking, pressured top with 4 man roams. I did shield Lucian a few times out of instinct to save him, but it was out of reflex. Hes calling to report me all game, and yet the enemy team agrees that I'm the one causing pressure throughout the game. \n\nI normally don't mind people calling me feeder, as I know I suck and can get so much better and normally end up asking for advice. If I know I'm playing bad, I'll just tell them I'm tilted, mute and focus on playing. I am against people being rude to me when I know I'm doing fine and the problem doesn't lie within me. \n\nI also know that jungle gank is to create more pressure and its not something I should count on. Its my lane, I'm supposed to get ahead, if not its my responsibility to not die. I've also played jungle and I do know enough of when most power spikes are. \n\nSo, don't worry about me raging, I don't get upset that often. Much less than the ragers you see in your games.\n\nEDIT: btw, we all know that its the junglers fault when lanes don't get ahead :P The support blaming era is gone since S5 :P","replies":[{"poster":"Knalxz","date":"2016-02-24T00:56:54.795+0000","up_votes":1,"down_votes":0,"body":"In those regards I can see how you'd respond that way. I took your comment as you saying if anyone disagrees with you, you just fountain or abandon your team by trying to become the support that carried.","replies":[]},{"poster":"Damagefox","date":"2016-02-24T00:24:07.379+0000","up_votes":1,"down_votes":0,"body":"As A support main, I am the same way.\nI work my hardest to support my team (note I said TEAM, NOT Adc exclusively). So if my adc starts flaming me and telling me how much I suck. How me going 0/1 because I got snared down means \"Omg this trash support, we lose because noob support\" I am happy to stop supporting.\n\nThe way I see it is this: I am a lane PARTNER, NOT a lane slave. I am NOT there so adc has a convenient \"Get out of responsibility free\" card. Where if the match goes south, they can just say \"We lost because this support\"\n\nSo If my ADC starts badmouthing me and tries to dump all the blame on me because I set up an easy last hit kill and they run away from it, then leave me to get ambushed while they save themselves (and blame me for getting killed afterwards). I am happy to just wash my hands of the lane and go help the other lanes. \n\nIts simple. Dont Throw your support under the bus, or throw them to the wolves and then cry and complain when you DONT HAVE A SUPPORT ANYMORE.\nIf you think you are so pro, so immensely great at the game that you feel the need to start spouting off \"I dont need any support\", I am happy to call your bluff and leave my adc to support themselves. \nAnd they cant turn around later and cry \"OMG Report my support, they abandoned lane. We lost because noob support\" which is something I am seeing alot of in S6. Its also part of the reason I am playing League less, and looking for replacement Mobas (Smite is a favorite so far, Looking forward to Epic Games' \"Paragon\" :D )","replies":[]}]}]}]},{"poster":"KillerKell","date":"2016-02-24T02:33:44.640+0000","up_votes":2,"down_votes":0,"body":"Technically it isn't the number of Deaths that constitutes a Feed.\n\nFeeding is giving FREE Kills, not just giving Kills.\n\nDid his Deaths earn his Team any combination of Kills, Assists, Objectives?  Then it's not a Feed.\n\nIf I am an ADC, and I dive into a 1v2 because I'm ahead and I can kill the ADC and back out... but that pesky Jungle springs from the River and Top was already mid-TP when I flashed in... I just fed.  I got absolutely nothing for my team (well, you COULD say I forced a Summoner in the TP used... but splitting hairs there... but yes, Top should absolutely take advantage of that TP and their Opponent being out of Lane by pushing).\n\nBut if the Support dies in a 2v2, and grants his ADC the Double Kill... that's not a Feed.  Even if he does it 20 Times.  Because that's 40 Kills his ADC gets, and only 20 Kills split in some manner by the Enemy Team.\n\nEspecially if that Double Kill brings an Objective, like Turret or Neutral Objective or Buff... or even just Free Farm.\n\nFeeding isn't how many times you Die... it's how many times you USELESSLY Die.","replies":[{"poster":"Totalis","date":"2016-02-24T03:40:10.661+0000","up_votes":1,"down_votes":1,"body":"You're correct, but I would argue that once deaths has reached a certain point, that it's straight up feeding. Let's use your example. If the support dies in exchange for an adc double kill, that's a good trade, and well worth. But doing this TWENTY times? Sorry, but that's feeding the enemy team.\n\nIt's also important to remember that as the game goes on, gold differential means less. meaning 10k to 20k means a hell of a lot more than 60k to 70k. You may have gotten your adc gold in the ballpark area of 12,000 gold, but giving 6,000 gold is something that could be done without.","replies":[{"poster":"KillerKell","date":"2016-02-24T04:14:45.683+0000","up_votes":2,"down_votes":0,"body":"While Gold does have less impact later, Death Timers have a greater impact.\n\nIt's simple Algebra.  CD is Cost of Death while VD is Value of Death.  Every time some one Dies, you take the CD and Subtract it from the VD... if the Value is Greater than the Cost, it's Not a Feed (NaF).\n\nSo if Team Support Dies, that gives Gold to the other Team and gives us a Death Timer and only 4 Usable Players.  So that Death needs to bring something in return... Gold, Objective, Death Timer, etc.  So if the ADC nets a Double Kill off the Supports Death, then we have Gold, Gold, Death Timer, Death Timer and a 4v3 Usable Player Advantage.  We can further that Value of Death by taking our 4v3 Advantage and taking an Objective with it.\n\nOf course this requires that the Support Death was needed to ensure the Better Play.  If we get a Double Kill... and then our Support gets caught trying to re-engage after we've broken off, then THAT is a Feed.  The Support just gave back part of our Advantage and got nothing in return.\n\nWhich brings up an interesting point on the Gold Value of Time (as in, Death Timers).  How Valuable is it that some one isn't there to defend, can't help take or stop the enemy from taking Objectives?\n\nAlso the aspect that being Ahead makes Dying more Costly.  In other words, if I'm Ahead then going 1 for 1 is no longer worth it.  It's a Net Loss.  If I'm behind, going 1 for 1 IS worth it, as I remove a more powerful piece from the game than I am.\n\nThere are a ton of dynamics to it, and the numbers themselves over a Single Game never paint the picture.  It's why Averages are so important, as Over Time some Truths play out and can be seen.\n\n0/10/20 in One Game could very well be a Great Game, while 0/10/20 AVERAGE is more than likely generally feeding.  But even there a 2:1 KDA isn't a bad thing, it's just not a great thing.","replies":[{"poster":"Totalis","date":"2016-02-24T04:45:58.135+0000","up_votes":1,"down_votes":0,"body":"woah, woah, woah, when did death timers become a part of this? We were talking about feeding, as in giving the enemy team gold. You're confusing the term \"feeding\" for tradeoffs between deaths, kills, and assists. If you want to get really technical about it, which you have been doing, then you're right, but that's not what we're talking about. (Is this an inferiority complex or something? You're trying to prove yourself right so much)\n\nWhen we say that person is 'feeding' or that person is 'fed\" we're not talking about how that person has caused a lot of deaths timers and what he's capitalized on in that time, we're talking purely gold differential's and the power of the items he has obtained as a result.\n\nIf a support has died 10+ times, and obtained double that in assists, then while he's brought his team closer to victory for sure (unless, like, it was just a janna shield that was completely inconsequential in the determining of that kill, you guys seem to be forgetting that happens a lot), the gold he has given the enemy team is still a large amount, meaning he's 'fed' them. It's like what I was saying with the other guy, 10 deaths is A LOT of dying, which is bad thing.","replies":[{"poster":"KillerKell","date":"2016-02-24T05:36:00.691+0000","up_votes":2,"down_votes":0,"body":"Why are Death Timers NOT part of this?\n\nIt's Cost vs. Cost.  Basic Economics.\n\nIt doesn't matter if the Support 'gives' 3,000 Gold to the Enemy Team... they are not 'Fed' if his Team in EXCHANGE for those Deaths gained 6,000 Gold for getting 20 Kills at the cost of his 10 Deaths.\n\nSo in comparison... the 6K is Fed, not the 3K.\n\nIt's not about what one gives, but about the value one receives in return.  Is THAT a Net Gain or Loss?  If my Death gives my Team a Net Gain... WE are the ones getting Fed, not the Enemy.\n\nFor instance, you try to go very generic and say \"10 Deaths is A LOT of dying, which is a bad thing\".  Okay... but the Support also put TWO ENEMY at 10 Deaths, a lot of dying... or double the bad thing.  So their 20 Deaths is way more impactful in a negative way than our Supports 10 Deaths.\n\nIf I were to say, at the start of the game \"Hey, we have to let the Support Die 10 Times.  But, in doing so, they promise we kill their ADC and Support 10 times each.  Then we'll start actually playing.\" would that not be a huge advantage for you?  Would you not take that deal every single time it was offered?\n\nIt seems you want to discredit the Support for Dying, while not properly crediting the Support for putting your team twice as far ahead as the enemy has gotten.","replies":[{"poster":"Lauchmelder","date":"2016-02-24T06:21:17.853+0000","up_votes":1,"down_votes":0,"body":"Sure it's more impactful to trade 10 for 20 kills. But the point people are trying to make is: If you learn to die less you are increasing your own advantage. If you engage in a 2v2 with the Intention to die if it needs to be to get your ADC a doublekill you are doing it wrong.\n\nSure, your Team gets 800 Gold if both die and you get an assist on both of them, but they get 400 in return. In that case it's simply better to just get 1 safe kill and give them nothing.","replies":[{"poster":"KillerKell","date":"2016-02-24T06:43:54.239+0000","up_votes":2,"down_votes":0,"body":"Especially when discussing Low Elo, it isn't that simple.\n\nSometimes you REALLY have to go the extra mile to even get your ADC to notice they have 2 Kills sitting there.\n\nSo I do agree with you, IF I can set up the Engage WITHOUT Dying, that's great.  But as long as the ledger is in our Favor at the end of it, that is what matters the most.\n\nNow if we were all playing with each other all the time, had our Skype or Curse going, and had trained together to know each others tendencies... I'd agree 110% with you.  You know, Organized Play.\n\nBut Solo Q isn't Organized Play... it's Street Ball.  No need in asking that guy to set a pick, he just isn't going to do it.  He's going to set up where he wants, how he wants.  \n\nSo then a Support really has to go in harder than one would generally like... or simply not ever engage at all.\n\nSo knowing that everyone faces the same Disadvantage there... it's better to be the aggressor and get 2 for 1, because it would take actual smart play and positioning to get 1 for 0 and you can't really trust your Team to play smart and position properly.\n\nBottom line is, however, even at Pro Level Play... what was the Cost Benefit of the Action?\n\nIt's only Feeding if it puts the Enemy Team at a greater advantage than what you took from the play.\n\nThe entire point is that the 0/10/20 Support, in the description given that started this chain, did NOT feed.  In fact, his Actions gave his Team a Greater Advantage... he did what a Support is MEANT to do, he got HIS Team Fed.\n\nWould I rather 0/0/10?  Sure.  But I'll take 0/10/20 every day, as long as my 10 was 'worth' for my Team.\n\nYou have to realize, ESPECIALLY with Support (I do Tank Engage Supports) that often your Living or Dying isn't up to you.  Only that you find the RIGHT engage for your Team to go in on.  If I die, but we Ace, then my Death doesn't hurt us in the slightest.\n\nThe 10 Deaths is more of a condition of the TEAM being unable as a Unit to finish out a Game, not the Individual Skill of a Support.  (Now, a 0/10/10 Support... of course situation dictates... but more than likely THAT Support IS Feeding... but we could Theorize a Scenario there where he isn't as well.)\n\nThe bottom line is KDA, or simply Death Counts, alone do not determine if one Fed or not.","replies":[]}]}]}]}]}]}]}]},{"poster":"Totalis","date":"2016-02-24T03:31:21.539+0000","up_votes":1,"down_votes":1,"body":"10 deaths is feeding. Doesn't matter the role, doesn't matter how many kills or assists you have, 10 is feeding. That's 3000 gold you've given them.","replies":[{"poster":"KillerKell","date":"2016-02-24T04:20:40.973+0000","up_votes":2,"down_votes":0,"body":"3,000 Gold you gave them.\n\nWhat's the Value of the Nexus your Team took because you set up great engages that wiped the Enemy Team while leaving you at risk of being focused?\n\nOh yeah, just 50 Gold.\n\nEff the Win, it's the Gold that matters here... right?\n\nSo a Kill is about 60X more Valuable than Winning.  Got it.","replies":[{"poster":"Totalis","date":"2016-02-24T04:32:18.085+0000","up_votes":1,"down_votes":1,"body":"How you reached that conclusion from my words, I'll never know. I don't think you fully understood a thing I said, and I could try to explain, but seeing as how you've been going on with discussions with like 10 other people, I'll end this here without bothering","replies":[{"poster":"KillerKell","date":"2016-02-24T05:29:17.590+0000","up_votes":2,"down_votes":0,"body":"Because Gold is only ONE Cost.\n\nYou are worried about the 3,000 Gold the 'Support' 'Fed' to the Enemy Team.\n\nIf that Support dying got you Objectives, it is NOT Feeding.  It is, in fact, getting YOUR TEAM FED.\n\n\"Fed\" is relative to comparison.  Is their Team Fed due to that 3,000... or is YOUR Team Fed due to the 7,000 K the Objectives and EXTRA Kills brought, due to those Deaths by the Support?\n\nYou want to look at the 3K in a vacuum, but that isn't the case at all.  You fail to acknowledge at all the Gold and OTHER Values gained by the Support taking the Death while setting up a Successful Engage.\n\nThe Support helped his Team GET 6,000 Gold in Kills at the same time he gave 3,000 due to his Deaths.  That's a Profit of 3,000 Gold for YOUR TEAM... just off the Kills.  They aren't fed... your team is.\n\nThen add the Dragon, or the Baron, or the Turret.\n\nHow about adding the Farm their 2 guys are missing, while only your Support is missing Farm on that Death Timer.  Another 100-200 Gold Advantage right there.\n\nSo no, if it requires the Support falls to initiate the Successful Engage, then 10 Deaths is in no way feeding.\n\nIt's a Ledger man... costs go out and values come in.  You want to blame the Support for the Death Costs going out, but not balance that with the Values gained by the Supports actions.","replies":[]}]}]}]},{"poster":"Bard in a Diaper","date":"2016-02-23T18:19:12.927+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kei143,realm=NA,application-id=ZGEFLEUQ,discussion-id=4gN5AQGk,comment-id=0001,timestamp=2016-02-23T11:44:59.990+0000)\n>\n> imagine how i feel as a support going 1/10/23 but they call me a feeder ..\n> \n> it normally ends up me giving a chuckle knowing that they don't know enough about the game.\n\nI mean thats like a 2.5 kda which is pretty meh. You are dying way too much for how many assists you outputted. 10 kills is a lot of gold.","replies":[{"poster":"Kei143","date":"2016-02-23T18:36:28.772+0000","up_votes":2,"down_votes":0,"body":"1/10/23 are bad games scores.\n\nI just finsihed one with 1/5/26.\n\nWhy would people call you a feeder when you are having a good game?","replies":[{"poster":"Knalxz","date":"2016-02-24T01:02:54.813+0000","up_votes":1,"down_votes":0,"body":"It's different for supports and getting your deaths up to double digits is dying alot regardless of your own kills. As a Support I say you're good not because you have a load of assist because that means nothing depending on champions you're playing with.\n\nI.E. Shen ulting on a target who won a fight and is finishing off the enemy or Raka healing top lane after the killed top and jungle even thought the heal did nothing but give her two free assists.\n\nI say you're not doing a great job as a support unless you've gotten 2 kills per every 10 assists. Other than that you were just probably assist farming.\n\nI spent alot of time in season four as a support because my computer is terrible and no one wanted the role so I became a support main. After that i god a good feel for the role and hold it and Jungle to a high standard to be meet.\n\n\"If I can do well in a role I hate then other people should do better in the role they seek.\" is the way I look at it.","replies":[{"poster":"KillerKell","date":"2016-02-24T04:18:58.377+0000","up_votes":2,"down_votes":0,"body":"First off, your KDA has zero to do with being a Support.\n\nYou bring less damage, so you are the most expendable on your team.  Give me the Support that Dies for a REASON, than the one that REFUSES to Die and thus never sets his team up on a Solid Engage.\n\nSo if you ever judge a Support of KDA, you're doing it wrong.\n\nVision, Engage, Disengage, Peel, Shield, Heal... these are what you look at to see if a Support is doing well or poorly.  And you won't find those numbers in any KDA, or any WL%.","replies":[]},{"poster":"Kei143","date":"2016-02-24T01:41:47.020+0000","up_votes":1,"down_votes":0,"body":"then .. one day when you aren't playing support ..\n\nyou see a lux with full AP items (maybe just the spell thieves) and contributed 0 towards vision ..\n\nSomehow I see alot of lux do that .. that and brands, maybe the occasional velkoz.\n\n{{sticker:zombie-nunu-bummed}}","replies":[]}]},{"poster":"cloman100","date":"2016-02-24T04:39:04.681+0000","up_votes":1,"down_votes":0,"body":"I had a game last season with tank thresh of 4/12/42... {{champion:412}} <3","replies":[]}]}]},{"poster":"Troll for Trump","date":"2016-02-23T22:15:54.696+0000","up_votes":1,"down_votes":0,"body":"No one bashes supports for KDA these days","replies":[]}]},{"poster":"BeatzBoyFTW","date":"2016-02-23T12:13:47.088+0000","up_votes":12,"down_votes":3,"body":"This, and also similar situations like:\n\n**Him:** 2+2=5\n**Me:** Uhh no, it's 2+2=4.\n**Him:** BITCH STFU IM DIAMOND SMURF, U JUZ A BRONZIE SO MY ANS IS RIGHT, AND NO U CANT TALK BACK CZ U A STUPID BRONZE GET REKT NOOB!!!\n**Me:**  Dude, wtf...","replies":[{"poster":"Weathered","date":"2016-02-23T14:59:06.189+0000","up_votes":4,"down_votes":2,"body":"This. I literally had a guy get mad at me for not ganking. I ganked, and then he got mad at me that since there was no laner his lane would push to their tower. Like wtf do you wan't man...","replies":[{"poster":"IreliaCarrlesU","date":"2016-02-23T16:49:36.956+0000","up_votes":4,"down_votes":4,"body":"your explanation sounds like u didn't understand something about lane mechanics that the laner did.","replies":[{"poster":"Weathered","date":"2016-02-23T18:16:45.816+0000","up_votes":3,"down_votes":1,"body":"He was mad that he had to push tower after a kill, which is what your supposed to do (deny farm, cause lane to reset). Some people often contradict their previous statement or just say something stupid because they are mad.","replies":[{"poster":"IreliaCarrlesU","date":"2016-02-24T13:38:32.319+0000","up_votes":1,"down_votes":1,"body":"maybe he wanted to freeze, to snowball his advantage.","replies":[{"poster":"Weathered","date":"2016-02-24T13:43:58.422+0000","up_votes":2,"down_votes":0,"body":"The lane started at middle when I ganked, and it wouldve reset if he pushed to tower regardless.","replies":[{"poster":"IreliaCarrlesU","date":"2016-02-24T13:53:06.535+0000","up_votes":1,"down_votes":1,"body":"i wasn't there to get the minion count, so i can't tell you otherwise.","replies":[{"poster":"GahRii","date":"2016-02-24T20:02:53.875+0000","up_votes":1,"down_votes":0,"body":"that's some nice passive-aggressive trolling you've got going on there.","replies":[]}]}]}]}]}]}]}]},{"poster":"Nogrim","date":"2016-02-23T14:03:41.935+0000","up_votes":6,"down_votes":0,"body":"the only time i bring up KDA is when some one is being a bitch and complaining about their own team. if you are 3/14/0, and running your mouth, you deserve to be mocked.","replies":[]},{"poster":"Joe Mana","date":"2016-02-23T13:55:08.611+0000","up_votes":7,"down_votes":1,"body":"***","replies":[{"poster":"Simato","date":"2016-02-23T14:19:23.668+0000","up_votes":4,"down_votes":1,"body":"But dont you dare to take a single kill... ò.ó","replies":[]}]},{"poster":"LrgBeard","date":"2016-02-23T20:00:07.154+0000","up_votes":1,"down_votes":0,"body":"That's why I like playing {{champion:27}} . Nothing like going 0/6 in lane, having your 1/3/1 {{champion:67}} start flaming you, then proceed to carrying her all the way to the enemy Nexus.","replies":[{"poster":"crippler38","date":"2016-02-23T20:12:03.298+0000","up_votes":4,"down_votes":0,"body":"you're toxic","replies":[]}]},{"poster":"charcharmunro","date":"2016-02-23T16:36:37.157+0000","up_votes":3,"down_votes":0,"body":"{{champion:27}} gets to go 2/12/13 and still carry a game by being a complete nuisance to the enemy team.","replies":[{"poster":"Slamurai Jack","date":"2016-02-23T17:01:45.034+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=charcharmunro,realm=NA,application-id=ZGEFLEUQ,discussion-id=4gN5AQGk,comment-id=000d,timestamp=2016-02-23T16:36:37.157+0000)\n>\n> {{champion:27}} gets to go 2/12/13 and still carry a game by being a complete nuisance to the enemy team.\n\nPerfect example of why good scores and good play are only loosely related. Objective focused play that avoids needless fighting will not give you good scores but it will win you games.","replies":[{"poster":"Billy VoHagen","date":"2016-02-24T05:31:34.154+0000","up_votes":1,"down_votes":0,"body":"singed doesnt have gameplay.","replies":[]}]}]},{"poster":"FrankerX","date":"2016-02-23T10:57:35.407+0000","up_votes":5,"down_votes":1,"body":"its kids man. or ppl who \"are god and never make mistakes\" no matter what you say, they will always find an excuse and a reason why you are the bad man. jsut mute. you dont miss anything trust me there is no point in even trying to communicate with them at all. mute them and play with your other teammates.","replies":[{"poster":"Nogrim","date":"2016-02-23T14:05:52.409+0000","up_votes":3,"down_votes":0,"body":"i finally started muting people this season, its just a much less awful experience.","replies":[]}]},{"poster":"Enrovy","date":"2016-02-24T03:00:41.060+0000","up_votes":2,"down_votes":0,"body":"Meanwhile I tanked 7 tower shots so they can get kills, and yet they say I'm useless...\nthat feel when you soaked the most damage in-game, yet team calls you useless...","replies":[]},{"poster":"Damagefox","date":"2016-02-23T23:28:48.664+0000","up_votes":2,"down_votes":0,"body":"People who talk like that are of the opinion that by Spitting K/D/A numbers back in your face, they can invalidate, discredit, or dismiss anything you have to say. They use it to try and shut down anyone who says something they dont like as if they can use your KDA to immediately claim victory. \n\nyou could say \"Hey, you know the sky is Blue\"\nand people respond differently based on KDA\nif you are say... 8/2/0 the response is \"Yeah I know that\"\nBUT if you are 0/2/8 the response is \"STFU Noob, ur 0/2\"\nas If them spitting your negative kda back in your face automatically means they win the arguement and your statement is false/rejected...even if it is fact. \n\n1/0 - anything you say is gospel\n0/1 - You are a noob, everything out of your mouth is invalidated, and you need to STFU and \"git gud\"\n\nThis is why they do it, this is why I laugh. Because they are so hung up on \" I have the most kills, so I am the best, and everyone will agree with anything I have to say ever. OMG look how Awesome I am\"\nAnd so anyone who isnt going 28/0 is a noob and says nothing but lies...according to the spoiled call of duty kids who only care about padding thier kda...even if it means the whole team loses. (They could throw the entire match, but will still brag about how great they are, how they \"OP Carried this Noob team\" because...they have the most polished kda)","replies":[]},{"poster":"Steven Mcburn","date":"2016-02-23T22:38:08.124+0000","up_votes":2,"down_votes":0,"body":"I gave up on league for today when my team fail-invaded the enemy jungle at level 1 feeding the akali I was against a triple kill.\n\nI honestly wouldn't of cared, except 15 minutes later they were raging at me for dying to akali-mumu dives in lane.\n\n\nOh, really? It surprises you that the akali you fed 1k gold to less than 2 minutes into the game is bending me over and showing me the business end of value town? Good thing you only died a few times less than me throughout the entire game so your KDA is a true testament to your skill level.\n\n\nBeen years of KDA humping in solo queues though. It's mostly COD kiddies that don't get that a MOBA really just boils down to a glorified tower defense game.","replies":[{"poster":"Damagefox","date":"2016-02-23T23:37:50.125+0000","up_votes":1,"down_votes":0,"body":"I agree, The Call of Duty kids come in to a TEAM based game, essentially give the rest of thier team the middle finger while they run solo and pad thier own kda. And then flame thier team for not having as glowing a KDA as THEY Did\n\nIts like a match I was playing a while back, playing as an ACD\nMy Support decides to Kamekazi Both bot laners (FULL HEALTH Enemy Leona/Graves, Support has < 150hp and I was OOM). He runs in, DIES (no suprise) then rages at me for not helping him get a double (which he didnt get). So he afks after having a tantrum and telling me how I dont know how to play. \n\nWHile he is afk, I am left to contend with both bot lane enemies alone (no help/ganks from jungle) who can even run in and rekt me under the tower. I end up going 1/5. \nSupport comes back from afk near the end of the match and spends the rest of the game telling me How I dont know how to \"Adc\" and I am such a \"Pathetic Noob\" for going 1/5. \nI explain that I got my 1/5 after HE had his little fit and decided to ragequit the match leaving me without a support.\nand he responds with \"STFU ur 1/5, you just suck noob. u dont know how to ADC\" and proceeds to tell me how pathetic and useless I am, constantly spitting that same 1/5 Kda back at me as if saying \"you are 1/5 so I WIN. Because...KDA\"","replies":[]}]}]}