{"poster":"Izzø","date":"2015-08-05T20:39:19.592+0000","title":"Can we add summoner names back to the TAB screen?","subforum":"Gameplay","up_votes":70,"down_votes":5,"body":"Please.","replies":[{"poster":"triment","date":"2015-08-06T04:49:46.107+0000","up_votes":10,"down_votes":1,"body":"Kind of annoying when someone gets shut down and you try to find their name to see what champion it was on the scoreboard but instead you have to hover over everyone individually. Don't ask me why I look at summoner names instead of champion names....","replies":[{"poster":"Joquan","date":"2015-08-06T15:43:37.243+0000","up_votes":1,"down_votes":5,"body":"Besides the fact that at the right side of the screen you will see who has been killed recently, if your not a moron you can figure it out from that.\n\nKnowing that XxxSwaglord420xxX is Garen is not needed to know that he is playing Garen.","replies":[{"poster":"ArkenStorm","date":"2015-08-07T01:55:41.845+0000","up_votes":1,"down_votes":1,"body":"you're*","replies":[]}]}]},{"poster":"Conturbatio","date":"2015-08-06T03:29:33.950+0000","up_votes":4,"down_votes":0,"body":"Currently you can hover your cursor over their champion's icon on the scoreboard to see their summoner names, but I honestly prefer all names being visible at the same time.","replies":[]},{"poster":"Sentrafuge","date":"2015-12-07T23:45:55.661+0000","up_votes":3,"down_votes":0,"body":"If u go into settings and under interface there is a section that says scoreboard and you can click to show summoner names\nthey will appear like the patch before over the champions items in the TAB","replies":[]},{"poster":"D1rtFarmer","date":"2015-08-06T14:05:00.168+0000","up_votes":2,"down_votes":0,"body":"thought i was the only one.","replies":[]},{"poster":"DarkLiquidDeath","date":"2015-08-06T07:57:54.636+0000","up_votes":2,"down_votes":0,"body":"Yeah, I like to know who I'm playing with/against. It's hard to explain, but I guess it just gives the players a personal touch.","replies":[]},{"poster":"RasCaelestis","date":"2015-08-06T02:15:23.870+0000","up_votes":2,"down_votes":1,"body":"I'd like this too.  Not sure why exactly, but it looks odd to not have them visible.  You *can* see them if you hover over the champion, but I'd much prefer to have them on constantly.","replies":[]},{"poster":"ZephyrDrake","date":"2015-08-06T21:59:10.971+0000","up_votes":1,"down_votes":0,"body":"I completely agree, sometimes you are just having your own duel or just minding your own business with farming and then you hear shut down! and the first thing you see is the summoner name then you press tab and have to look at each portrait just to know who got the shutdown money. Even more annoying when someone in your team keeps wanting to surrender the vote ends in 1/4 every time but the exact same person keeps wanting to surrender and you have to once again hover your cursor over the character portraits one at a time just to find out who wants to surrender. It's tedious and annoying, there is no reason for the summoner names to not be in the TAB interface","replies":[]},{"poster":"Evewynn","date":"2015-08-06T21:53:22.507+0000","up_votes":1,"down_votes":0,"body":"I agree, it was the one thing I didn't like about the HUD update. I also would prefer them putting the CS and team score near the mini-map again, but oh well.","replies":[]},{"poster":"hopadopagopalas","date":"2015-08-06T15:08:08.294+0000","up_votes":1,"down_votes":0,"body":"also i am kinda disappointed in how the display for the dragon counter. i liked how it looked b4 the HUD rework.","replies":[]},{"poster":"Downfall","date":"2015-08-05T23:05:11.557+0000","up_votes":3,"down_votes":6,"body":"This isn't valuable game information and can be seen if you mouse over their portrait on scoreboard, I'd rather it be visible if you'd like to see it (which it is right now) than visible all the time.","replies":[]}]}