{"poster":"Nova Iryn","date":"2015-04-05T12:39:47.388+0000","title":"WIe komme ich aus Gold Raus(Solo Q)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Heyho Leute,\r\nmein Name ist David, ich bin 18 Jahre alt und mache grad mein Abi.\r\nMeine Frage ist, wie komme ich aus Gold raus?\r\nWas sind typische Fehler? Wo kann ich mich verbessern? \r\nDas soll hier kein cryer Post werden sondern ich h&auml;tte gerne ernste Antworten.\r\nKlar steigt man auf &quot;wenn man so weit ist&quot; aber ich w&uuml;rde gerne diesen Punkt gezielt erreichen, mit eurer Hilfe.\r\nZurzeit befinde ich mich in Gold 5 mit 20 Punkten oder so und bin main Jungler.\r\nMeine St&auml;rke ist definitiv die Map Awareness, Warding geh&ouml;rt dann schon wieder zu den Schw&auml;chen, und Descision Making im Midgame f&auml;llt mir auch schwer, im Lategame geht es dann wieder, und nat&uuml;rlich die &uuml;bliche SoloQ Greed die in Gold gang und gebe ist, die aber nicht mehr sooo stark ausgepr&auml;gt ist.\r\nWenn ihr mir helfen k&ouml;nntet w&auml;re ich euch sehr dankbar :)\r\nFalls jemand mehr zu sagen hat k&ouml;nnt ihr mich auch gerne Ingame adden sonst einfach unter dem Post.\r\n\r\nVielen Dank schonmal f&uuml;r die ganzen Antworten :)\r\n\r\nmfg\r\n PsstImMeditating/David","replies":[{"poster":"Nova Iryn","date":"2015-04-06T21:01:46.762+0000","up_votes":1,"down_votes":0,"body":"nami used bubble  danke für die hilfe :D saitain schaue ich fast jeden tag :D und lrsb habe ich auch viel geschaut, jedoch war das meiste von dem was ich dort gesehen habe in der hinsicht wirklich für untere elo bestimmt sprich bronze und silber, so wie finde ich meine lane wie farme ich usw. farm verbessert sich ja durch üben , wobei mich das im jungle ja nicht sonderlich betrifft, das farmen von cs","replies":[{"poster":"Lady Yunalesca","date":"2015-04-06T23:09:03.162+0000","up_votes":1,"down_votes":0,"body":"naja er hat immerhin um die 27 folgen,auch vieles was nicht nur für low elo ist,abgesehen davon ist low gold und silber echt kein großer unterschied xD","replies":[]}]},{"poster":"Lady Yunalesca","date":"2015-04-06T14:37:53.711+0000","up_votes":1,"down_votes":0,"body":"gibt natürlich 3 große Punkte die man überall findest von bronze bis platin\n1. Farming \ndazu gehört natürlich auch zu wissen,wann pusht/freezt man,wie funktioniert slowpush \"aggressives und passives\" farmen,also das verhalten auf der Lane mit cd trades/deny etc\n\n2.Mapawareness \ndazu gehört natürlich auch das Warden,decisionmaking auf der Basis von dem was du sehen kannst (bzw. nicht sehen kannst)\nalso auch das Pingen von ganks etc für deine fellow Laner\n\n3. Die mentale Einstellung\nalso nicht flamen,das team motivieren etc\n\nMan kann hier halt nur generelle Tipps geben,\naber ja man sieht halt du spielst extrem viele Champs,versuche dich auf wenigere zu konzentrieren,diese dafür aber besser zu spielen\nich dneke das spezialisieren ist sowieso ein wichtiger Aspekt zum aufsteigen\nAlso auf deiner Mainposi möglichst viel auf gutem level spielen können und auf den anderen lanes halt um die 2 champs zu haben mit denen du dich confident fühlst.\nAuf deiner main posi mit deinen mainchamps viel experimentieren,mit itembuilds etc,Guides lesen,streams schauen etc kann auch viel helfen\noder einfach mal deine spiele aufnehmen und deine eigenen Fehler analysieren \n\nWenn du Interesse an ner guten guide-serie hast würde ich dir Lets read small books empfehlen \"besser werden im Ranked\"\nhttps://www.youtube.com/user/Letsreadsmallbooks\n\nWenn du gerne junglest würde ich dir Saitains kanal empfehlen,da nimmt er auch viele nicht so meta jungler auf,erklärt extrem viel und gut \n\nHoffe ich konnte dir hier etwas helfen :)","replies":[]},{"poster":"Nova Iryn","date":"2015-04-05T17:15:20.948+0000","up_votes":1,"down_votes":0,"body":"Dankeschön schonmal dafür:)","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-04-05T14:13:04.479+0000","up_votes":1,"down_votes":0,"body":"ähm... zu nächst mal... viel üben... Du bist Gold V... da ist es für dich einfacher, Gold zu verlassen, in dem du Richtung Silber absteigst.... bei mir hat der Schritt von Gold V bis Platin V im Endeffekt 6 Monate gedauert...\n\nBis Gold 2 lautete mein Geheimnis: Spezialisierung. Du hast 56 unterschiedliche Champs im Ranked \"ausprobiert\"... bei mir sind es 7... und die 7 erreichte ich nur, weil ich unbedingt ein Karma Spiel in meine Platin Promo einstreuen musste (ich habe sie 3 Jahre lang als Main gehabt, da gehört sich das einfach). Wenn man bedenkt, dass du 0-18 mit 18 unterschiedlichen Champs stehst... wenn du in diesen Spielen eine 9-9 Bilanz hättest, wärst du zumindest schon mal Gold IV...  Probiere Champs einfach im Normal aus.\n\nBis Gold 2 hatte ich genau 2 Champs für jede Lane. Höchstens. Diese habe ich immer gepickt. Unabhängig vom Gegner oder Mitspielern. Und mit den Champs wusste ich halt genau, was ich zutun hatte und wie sie funktionieren. Auf meinen nicht Main Lanes mache ich das bis heute so... Erst ab Gold 2 fing ich an, mit wirklich Teamkompositionen anzugucken und entsprechend zu picken.\n\nUnd: Du wardest zu wenig. Klar, ich als Sup Main... aber hier ist ein interessantes Geheimnis aus dem Jungle: Wenn du nicht auf den Sightstone gehst... Wenn du jedes mal den großen Geist smitest, brauchst du kein Oracle, weil der Geisterbuff automatisch den Oracle Effekt auslöst, wenn du an einem gegnerischen Ward vorbeiläufst. Das ist super mächtig. (ich habe schon mal nur den Geist im vorbeigehen gesmitet, um sicher zu stellen, dass der Drache nicht gewardet ist... und habe den dann gemacht...) Dann kannst du wenigstens auf das Gelbe Trinket Upgrade gehen und so halbwegs ordentlich warden... denn zu wissen, wo der Gegnerische Jungler gerade ist (oder nicht ist) macht es für dich und dein Team wesentlich einfacher, zu reagieren. Und gerade du als Jungler kannst am einfachsten unbemerkt Wards in den gegnerischen Jungle setzen...","replies":[]}]}