{"poster":"Nova Iryn","date":"2015-09-02T19:24:40.527+0000","title":"RiseOfTheBehemoth Sucht Teammember","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Einen wundersch&ouml;nen Abend Beschw&ouml;rer und Beschw&ouml;rerinnen,\nWir, dass hei&szlig;t Mein DuoQ Partner und Ich, sind dabei ein Team aufzubauen, aber mehr dazu sp&auml;ter.\n**Zuerst mal zu mir :**\nMein Name ist David und ich bin 18 Jahre alt.\nIch Spiele LoL Seit Ende S2 und bin Main Jungler.\nAußerdem werde ich der Teamleader sein.\nMain Champs dabei sind Lee Sin, Rek Sai, Ekko, Shyvana und Bruiser Yi, bin aber gerne f&uuml;r neues offen.\nMeine st&auml;rken sind Map Awareness und Jungle Objectives wie Nash und Drake, eine gro&szlig;e Schw&auml;che ist aber das Descision Making im Lategame, wann gehe ich rein, wann nicht etc.\n\n**Mein DuoQ Partner hei&szlig;t DevilMadness Ingame.**\nEr ist 17, wird aber in den n&auml;chsten Wochen 18.\nEr spielt auch seit Ende S2, und ist Main Midlaner.\nSeine Main-Champs sind : Ori, Viktor, Ahri, LB, Fizz und Varus.\nSeine gr&ouml;&szlig;te St&auml;rke ist das Snowballen, sobald er einen Lead bekommt, sodass er, wenn er early ahead ist Meist alle Lanes mit Snowballed, da er ein sehr starkes Roaming hat. Seine gr&ouml;&szlig;te Schw&auml;che ist es aber diesen \"Lead\" zu bekommen. Die meisten verlorenen Midlanes passieren durch weit &Uuml;bersch&auml;tzte Vorteile, so passiert es nicht selten, dass gesagt wird : \"Brauchst nicht Mid ganken die l&auml;uft\" und dann BOOM First Blood Gegner, aber naja wir sind ja keine Challenger, jeder macht Fehler.\n\n**Nun da ihr einiges &uuml;ber uns Wisst kommen wir nun zu euch, gr&ouml;&szlig;tenteils ist das nat&uuml;rlich der Standard Kram :**\n- 16+ (Da gibts leider echt keine Ausnahmen)\n- Gold 4+(Wir m&ouml;chten keine G5 Leute aufnehmen, weil dort so viele geboostete Leute rumh&auml;ngen etc. wenn man in Gold geh&ouml;rt kommt man dort sowieso fix raus)\n- Kritikf&auml;higkeit : Hierzu kommen das EIN- und AUSteilen. Jede Kritik die Kontruktiv ist wird gern gesehen und angenommen, Keine Konstruktive Kritik, also Flame wird nicht gedulded und endet mit einem Rauswurf, genau so wie Heulsusen, die damit nicht umgehen k&ouml;nnen\n- Der WIlle und die Zeitbereitschafft sich GEMEINSAM zu verbessern : Wer nach 2 Wochen keinen Bock mehr hat, und nicht den Willen hat sich Zeit zu nehmen brauch sich gar nicht erst melden, Trainingszeiten werden nat&uuml;rlich noch gesucht, aber mindestens 3mal die Woche und an Wochentagen erst ab ca. 18:00, wem dass nicht passt, den muss ich leider auch entt&auml;uschen.\n\n\n**Nun noch etwas zum Team :**\nWir haben vor uns gemeinsam zu verbessern, nicht als Einzelg&auml;nger, Ja Ich wei&szlig;, ich habe da auchn paar Champs stehen die eher SoloQ orientiert sind, dass liegt aber daran, dass ich lange kein ernsthaftes Team Ranked mehr gespielt habe.\nDesweiteren wollen wir an Turnieren Scrimms oder &auml;hnlichem Teilnehmen, alles ist eine Erfahrung wert, und durch alles wird man besser. Das Team wird in einer ernsten Athmosph&auml;re spielen, klar sind witze und sowas auch dabei, sonst amchts ja keinen Spa&szlig; und wir sind ja wie gesagt auch keine Challenger, aber uns machts halt am meisten Spa&szlig;, wenn wir ernst an die Sachen gehen und ruhig und &Uuml;berlegt spielen.\n\n**Das Team besteht aus :**\n**Top - Du?**\n**Jungle - Tls Meditating**\n**Mid - DevilMadness**\n**Marksman - Du?**\n**Support - Du?**\n\n**Desweiteren suchen wir auch noch 2 Substitutes, die m&ouml;glichst Allrounder/2 Lanef&auml;hig sein sollten.**\n\n**Wir bewirbst du dich nun?**\nAm besten schreibst du einen kurzen Beitrag hierrunter, oder addest mich und schreibst mir die Daten :\n- Alter\n- Lane\n- Elo\n-Main Champs\n-St&auml;rken\n-Schw&auml;chen\n\nSo das wars dann erstmal von mir :) Wenn Ihr also bock habt und den Kriterien entsprecht dann meldet euch :)\n\nmfg\n\nTls Meditating/David\n\nP.s. Da der Beitrag so lang ist und es mich lang genug gekostet hat ihn zu schreiben und ich keine Korektur lesen wollte d&uuml;rft ihr Rechtschreibfehler gerne behalten :)","replies":[{"poster":"Kartoffelsalaat","date":"2015-09-06T09:15:05.222+0000","up_votes":1,"down_votes":0,"body":"- Alter : 24\n- Lane : Top\n- Elo : Gold IV\n- Main Champs: Shyv, Aatrox, Fiora, Irelia, Akali, Diana,  Xin\n\nStärken und Schwächen, mh, kA, manchmal schwaches laning weil ich mich zu viel mit anderen Dingen beschäftige, wie z.B. anderen Lanes.","replies":[]},{"poster":"Salug","date":"2015-09-03T10:02:54.292+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\n23 Jahre jung\nPlat5\nMain Top/jung\nAdden dann sieht man weiter\n\nMFG Salug","replies":[]},{"poster":"Hodênkobold","date":"2015-09-03T05:33:37.419+0000","up_votes":1,"down_votes":0,"body":"Servus, \nich bin 19 Jahre alt, Main ADC und bin momentan Platin3 in SoloQ.\n\nWenn ihr Interesse habt könnt ihr mich einfach Ingame adden, wo wir dann auch weiteres besprechen können.\n\nMfG","replies":[]},{"poster":"NoElo4Cello","date":"2015-09-03T04:59:15.187+0000","up_votes":1,"down_votes":0,"body":"Hey\n\nBin MAin ADC und Gold 2\n\nBei Interesse kannst mich ja mal adden","replies":[]},{"poster":"Anraki","date":"2015-09-03T00:03:40.243+0000","up_votes":1,"down_votes":0,"body":"Ich verlinke dir mal meine \"Bewerbung\" fürs Teams. Dann kannst du mal gucken, ob es euren Anforderungen halbwegs entspricht. Ingame: AE Anraki . \n\nSupport Main und kann für Midlane Substitute sein :)\n\nHier die Bewerbung: [(http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/lu4m5H8I-supportmidlane-main-gold-5-sucht-ambitioniertes-rankedteam)]","replies":[]},{"poster":"Ludovico","date":"2015-09-02T20:16:39.050+0000","up_votes":1,"down_votes":0,"body":"Hätte nichts dagegen einer der Ersatzspieler zu sein. \n\nKann eigentlich jede Position und die meisten champs (sofern sie spaß machen. Also kein Teemo, Fizz, Yi, und so weiter).","replies":[]},{"poster":"Dancing Fingers","date":"2015-09-02T20:06:29.175+0000","up_votes":1,"down_votes":0,"body":"genau mein ding, hab dich mal geadded","replies":[]},{"poster":"C0rt3x95","date":"2015-09-02T19:30:49.678+0000","up_votes":1,"down_votes":0,"body":"https://rechtschreibpruefung24.de/     --> perfekt wenn man zu faul ist alles nochmal durchzulesen\n\nMeld mich ma bei dir.","replies":[]},{"poster":"DarrowAuLuna","date":"2015-09-02T19:28:07.419+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]}]}