{"poster":"Dreadlocks","date":"2016-06-20T03:03:29.123+0000","title":"@Riot is Rengar really getting reworked at end of season?","subforum":"Gameplay","up_votes":9,"down_votes":1,"body":"Title^???","replies":[{"poster":"Meddler","date":"2016-06-20T04:51:28.254+0000","up_votes":13,"down_votes":1,"body":"Highly likely, though not guaranteed.","replies":[{"poster":"Void Nargacuga","date":"2016-06-20T05:01:31.667+0000","up_votes":2,"down_votes":0,"body":"Anything in particular you might have planned for {{champion:107}}  that you could be willing to share? Or at least a general plan or idea of what you would like to take a look at on him?","replies":[{"poster":"Meddler","date":"2016-06-20T05:11:53.994+0000","up_votes":14,"down_votes":4,"body":"Too early to say much with confidence, I'd expect ability to almost insta kill from stealth's something we'll be looking to remove though, with power offered in other ways instead. A full damage Rengar should kill quickly certainly, but there's a limit on how quick a kill should be possible (without being super fed) that Rengar gets passed too easily at present.","replies":[{"poster":"Dies to Wolves","date":"2016-06-20T05:56:18.839+0000","up_votes":7,"down_votes":3,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=000100000000,timestamp=2016-06-20T05:11:53.994+0000)\n>\n> Too early to say much with confidence, I&#x27;d expect ability to almost insta kill from stealth&#x27;s something we&#x27;ll be looking to remove though, with power offered in other ways instead. A full damage Rengar should kill quickly certainly, but there&#x27;s a limit on how quick a kill should be possible (without being super fed) that Rengar gets passed too easily at present.\n\nIn that case why is it fair that a fed twitch can almost insta-kill you from stealth, without an exclamation mark warning and without even needing to put himself at melee range?","replies":[{"poster":"Meddler","date":"2016-06-20T06:40:29.793+0000","up_votes":14,"down_votes":8,"body":"A fed Twitch certainly kills fast, there's a small, but crucial amount of extra time to respond to him though. On top of that Twitch also needs to be be noticeable more fed to 100-0 a squishy that quickly, plus he doesn't have the same ability to get onto you quickly even when you've got pink wards down.\n\nI wouldn't necessarily say Twitch was a strong example of what good looks like, I'm uncertain on that personally. I do feel there's a pretty clear difference between the average Rengar jumping at you and the average Twitch unstealthing as a squishy though in terms of your ability to respond to the attack in a meaningful manner.","replies":[{"poster":"Dies to Wolves","date":"2016-06-20T07:37:51.390+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=00010000000000010001,timestamp=2016-06-20T06:40:29.793+0000)\n>\n> A fed Twitch certainly kills fast, there&#x27;s a small, but crucial amount of extra time to respond to him though. On top of that Twitch also needs to be be noticeable more fed to 100-0 a squishy that quickly, plus he doesn&#x27;t have the same ability to get onto you quickly even when you&#x27;ve got pink wards down.\n> \n> I wouldn&#x27;t necessarily say Twitch was a strong example of what good looks like, I&#x27;m uncertain on that personally. I do feel there&#x27;s a pretty clear difference between the average Rengar jumping at you and the average Twitch unstealthing as a squishy though in terms of your ability to respond to the attack in a meaningful manner.\n\nThere is indeed a difference in that Rengar needs to be less fed to one shot you, but OTOH Rengar actually gives you a warning with the exclamation (unless he perfectly flash jumps you, but then again, that uses his flash so he can't do that constantly); he gives you less time to react, but at least he gives you a bit of time to prepare. IMHO a fed twitch is worse to play against than a fed rengar, because he won't give you any warning, can do it much more often (no comparison on the CDs for their stealths), and is ranged.\n\nSo yes, I agree that Rengar's playstyle isn't the healthiest in the game (though IMO much much healthier than Irelia, Diana, Xhin'Zao and all those assassin-bruiser ball-of-stats champions), but I find it unfair for this style to be ok with some champions (twitch..) and not ok with others (rengo).","replies":[{"poster":"BastionKross","date":"2016-06-20T13:26:06.853+0000","up_votes":3,"down_votes":3,"body":">but I find it unfair for this style to be ok with some champions (twitch..) and not ok with others (rengo).\n\nIt's not okay. Twitch does something similar, but he's got to be incredibly fed in order to pop out of stealth and murder you that fast.\n\nRengar gets two or three kills and suddenly that exclamation point is more of a death sentence. It's too easy for a Rengar to get that that point where he just instantly deletes champions. If a Twitch is ever killing you that quickly, he got fed and _earned_ it. Rengar usually does not have to.\n\nOf course there's also the fact that Ren has stuff in his kit that Twitch can't match up to like hard cc, higher innate stats, and built-in sustain.\n\nI'm completely fine with Twitch doing that style since he deserves it for being that far ahead, but it feels incredibly unfair when a slightly ahead Rengar does it. That's the difference.","replies":[{"poster":"Dies to Wolves","date":"2016-06-20T17:12:53.527+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=BastionKross,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=0001000000000001000100020000,timestamp=2016-06-20T13:26:06.853+0000)\n>\n> It&#x27;s not okay. Twitch does something similar, but he&#x27;s got to be incredibly fed in order to pop out of stealth and murder you that fast.\n> \n> Rengar gets two or three kills and suddenly that exclamation point is more of a death sentence. It&#x27;s too easy for a Rengar to get that that point where he just instantly deletes champions. If a Twitch is ever killing you that quickly, he got fed and _earned_ it. Rengar usually does not have to.\n> \n> Of course there&#x27;s also the fact that Ren has stuff in his kit that Twitch can&#x27;t match up to like hard cc, higher innate stats, and built-in sustain.\n> \n> I&#x27;m completely fine with Twitch doing that style since he deserves it for being that far ahead, but it feels incredibly unfair when a slightly ahead Rengar does it. That&#x27;s the difference.\n\nI disagree. Yes, Rengar needs to be quite less-fed to get to the point of one-shotting a champion, but he still needs to be very ahead (or if he is slightly ahead and the enemy squishy adc is slightly behind, that makes enough of a difference between them, but then again... he worked to get himself fed and the enemy carry is behind, only natural that this would happen); but again, twitch is ranged. Rengar has higher innate stats because he is melee, he NEEDS it. I don't think comparing CC, stats, sustain etc is a valid comparison; twitch can AoE shoot from 800 range for example. They're different. What they have in common is that both are high damage dealers with stealth; rengar deals damage in less ammount of time, but his stealth gives you time to prepare. Twitch's stealth doesn't. IMO, if one isn't fine, so isn't the other, and both should be reworked.\n\nMy perspective might be a bit different as I used to main Rengar (don't quite play him anymore tbh), but I'm not even talking in a way to \"defend\" him (again, I rarely play him nowadays), I just don't find his playstyle that oppressive. And I play a lot of immobile mages which honestly are food for a good rengar, yet I still find it pretty OK to play against him. I don't find it OK to play against a twitch, because even if he doesn't get as strong, the no-warning-at-all stealth is much more frustrating to deal with.","replies":[]},{"poster":"99White Terror99","date":"2016-06-22T14:18:23.895+0000","up_votes":1,"down_votes":0,"body":"first point, i'm italian, so sry for my bad english\nsecond point, with rengar even if you have 2 or 3 kills you can't instantly kill the enemy, unless he's behind, you are ahead so it's fair you can kill him; with the kitty you can do the oneshot combo in mid late game if both teams are at the same level, and it's not a single spell, it's a combo, the right order of spells in less the 0.5s, you only have the time from when you are in mid air and when you land, if you land it, you kill him, if you don't land it, you are dead if the adc is good, for example if their adc is ashe she hasn't an escape, so if you jump on her is easier to kill her than a vayne or a kalista because they can kite the kitty\n\ni main rengar and there are only a few rengar mains who can oneshot the adc or the mage, i can't because it's difficult, it's risky, you have to choose the right moment when to ult, where to ult, there are a lot of decision making\nlots of people think rengar is just \"ult=dead\" but this is not true, only if you find rengar god it's true but i think that a player who masters certain champions can do this\n\nhowever if they will rework rengar and they will rework him so he can no more oneshot i think they will kill the original rengar, that is the main feature of rengar, the reason why someone picks rengar, it's like removing shadows from zed","replies":[]}]},{"poster":"Blakiepug","date":"2016-06-20T14:25:50.624+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dies to Wolves,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=000100000000000100010002,timestamp=2016-06-20T07:37:51.390+0000)\n>\n> There is indeed a difference in that Rengar needs to be less fed to one shot you, but OTOH Rengar actually gives you a warning with the exclamation (unless he perfectly flash jumps you, but then again, that uses his flash so he can&#x27;t do that constantly); he gives you less time to react, but at least he gives you a bit of time to prepare. IMHO a fed twitch is worse to play against than a fed rengar, because he won&#x27;t give you any warning, can do it much more often (no comparison on the CDs for their stealths), and is ranged.\n> \n> So yes, I agree that Rengar&#x27;s playstyle isn&#x27;t the healthiest in the game (though IMO much much healthier than Irelia, Diana, Xhin&#x27;Zao and all those assassin-bruiser ball-of-stats champions), but I find it unfair for this style to be ok with some champions (twitch..) and not ok with others (rengo).\n\nI agree with this. Personally, I've never found Rengar's stealth to be that frustrating or over-powered and I think he is in a good place right now after the recent nerf he got to his ult that increased the range at which enemies can sense there is a stealthed Rengar around. I die far more often to Shaco and Twitch popping out of stealth then I do to Rengar. I don't think it's fair either to remove something so core to Rengar's kit while other champions get a pass. And it's not like Rengar can 1v5 a whole team with his stealth whereas Twitch... >.> I've seen Twitch do some pretty crazy things lately...","replies":[]}]},{"poster":"AramsAreBest","date":"2016-06-20T06:43:10.456+0000","up_votes":1,"down_votes":18,"body":"Why are you constantly changing the game. Please answer. ","replies":[{"poster":"Best KhaZix Void","date":"2016-06-20T07:50:23.379+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=AramsAreBest,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=000100000000000100010000,timestamp=2016-06-20T06:43:10.456+0000)\n>\n> Why are you constantly changing the game. Please answer.\n\nthat question does not deserve an answer.","replies":[{"poster":"Sahn Uzal","date":"2016-06-20T11:04:28.145+0000","up_votes":4,"down_votes":0,"body":"Change is good. {{champion:121}}","replies":[]}]},{"poster":"Sqkerg","date":"2016-06-20T09:26:22.009+0000","up_votes":7,"down_votes":0,"body":"Because they're trying to make the game better?","replies":[]}]},{"poster":"Sire Hippington","date":"2016-06-20T15:04:50.765+0000","up_votes":3,"down_votes":0,"body":"just that a twitch hits on 800 range and aoe...there is a reason why he is the second highest winrate marksmen and was perma banned vs rng at msi.\n\nVs rengar, if he's not very fed you can survive the burst and then there is the option to cc him and either kill him or kite him, as he's a melee with no more gapcloser(unless you wait form him in a bush)\nWith twitch, if you don't have the stats to fight back when he pops out next to you, you will not get away alife due to his range+dps.\n\nI'm not saying rngar is any healthy, but twitch is just as bad. As long as marksmen reach such rediculous dps numbers, having a long duration stealth is quite a bad idea on them, especially if paired with strong steroids and **longranded aoe AAs**.\n\nI generaly think that long duration true-stealth is not healthy for the game, you should consider useing the eve modell for preemptive stealths and use the true stealth for defensive short-term mechanics like kah's ult.\nThat would maybe also allow to remove full stealth detection vs champs from the game, which would help balanceing assasins that use stealth as defense, since balanceing around hardcouters, which stealthdetection certainly is, is a difficult thing.\nAs it is now, on a champo like akali, if your opponents don't use pinks you're fine, if they du you're done for.","replies":[]},{"poster":"silenced death","date":"2016-08-26T02:36:14.683+0000","up_votes":1,"down_votes":0,"body":"I do main rengar so I might be a bit bias but I think rengar is much more healthy than some champion like xin zhao that can pick out one single enemy and one-shot them and run. If a enemy squishy is being focused by rengar then they can always just stick with the tanks or high cc champions and survive a rengar ult.","replies":[]},{"poster":"Aptest","date":"2016-06-23T20:00:55.289+0000","up_votes":1,"down_votes":0,"body":"Scenario:\n\nlet us assume Twitch is assassinating you and you are Zed or Fizz of Leblanc, and you have your skills up. Can you jump on fizz and counter-burst him and kill him before he kills you? Certainly.\n\nlet us assume Rengar is assassinating you and you are twitch. Do you have the option of killing Rengar, as a response to him initiating on you?","replies":[]},{"poster":"edoczkat","date":"2016-06-21T22:06:13.007+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=00010000000000010001,timestamp=2016-06-20T06:40:29.793+0000)\n>\n> A fed Twitch certainly kills fast, there&#x27;s a small, but crucial amount of extra time to respond to him though. On top of that Twitch also needs to be be noticeable more fed to 100-0 a squishy that quickly, plus he doesn&#x27;t have the same ability to get onto you quickly even when you&#x27;ve got pink wards down.\n> \n> I wouldn&#x27;t necessarily say Twitch was a strong example of what good looks like, I&#x27;m uncertain on that personally. I do feel there&#x27;s a pretty clear difference between the average Rengar jumping at you and the average Twitch unstealthing as a squishy though in terms of your ability to respond to the attack in a meaningful manner.\n\nYea, it's alot easier for an average twitch than an average Rengar lol","replies":[]},{"poster":"Hige","date":"2016-06-20T06:48:49.936+0000","up_votes":1,"down_votes":0,"body":"So in case that you guys go for assassins as a class update, will hybrid assassins get splashed with work too? likely twitch and vayne?","replies":[{"poster":"BloodyTompon","date":"2016-06-20T07:33:08.306+0000","up_votes":1,"down_votes":0,"body":"I don't think they will be. Teemo is apparently a control mage (primary) and marksman (secondary) and did not receive changes in the marksmen update. Twitch was changed slightly in the marksmen update, so judging by that I'd say they will limit the scope to more 'pure' assassins.","replies":[{"poster":"Photos of Ghosts","date":"2016-06-20T10:26:19.089+0000","up_votes":1,"down_votes":0,"body":"There's less assassins than marksmen tho","replies":[{"poster":"BloodyTompon","date":"2016-06-20T11:01:08.976+0000","up_votes":1,"down_votes":0,"body":"True. I'd say assassins need more work though and I don't think they changed every marksmen. Hmm. Having said that, the itemisation for AD assassins isn't as bad though so I'm not sure what one will be of larger scope. In the case of twitch and vayne, since they were worked on so recently and are not the worst offenders in terms of gameplay health or differentiation if Riot did chose to expand the scope I feel like they'd be more likely to divert resources to other tasks.","replies":[]}]}]}]}]},{"poster":"Hello I am Bird","date":"2016-06-20T06:18:50.958+0000","up_votes":2,"down_votes":1,"body":"Twitch isn't inherently bruiser-like\n\nRengar gets a decent chunk of health and has cc attached to his kit.","replies":[{"poster":"99White Terror99","date":"2016-06-22T14:25:19.411+0000","up_votes":1,"down_votes":0,"body":"if you want to oneshot with rengar you can't use your cc or your health, you must go full ad, you are squishy if you want to oneshot, you must go INTO the enemy, i don't have to say that if you want to oneshot someone in a teamfight you take more risks than a twitch, a fizz or a le blanc, or a bruiser","replies":[]}]},{"poster":"Miraweave","date":"2016-06-22T16:55:08.407+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dies to Wolves,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=0001000000000001,timestamp=2016-06-20T05:56:18.839+0000)\n>\n> In that case why is it fair that a fed twitch can almost insta-kill you from stealth, without an exclamation mark warning and without even needing to put himself at melee range?\n\nBecause the level of fed twitch needs to be to do that is much, much higher than the level of fed rengar needs to be to do the same thing.\n\nEvery champion does broken damage when they're absurdly ahead. I've had games where I 100-0'd an ADC with a single cast of Death Ray. The problem is when champions do broken damage with only a minor lead, like rengar.","replies":[]}]},{"poster":"darkdill","date":"2016-06-20T08:14:45.823+0000","up_votes":4,"down_votes":0,"body":"I hope you're extending this line of thinking also to Shaco. He's not nearly as good at instakills nowadays, but every so often I end up against a fed Shaco who you cannot react to before you're dead.\n\nIt doesn't help that his passive is a case of \"you lose or you lose harder\".","replies":[]},{"poster":"Final Raid Boss","date":"2016-06-21T21:04:20.024+0000","up_votes":3,"down_votes":0,"body":"meanwhile {{champion:7}} {{champion:105}}","replies":[{"poster":"Tahyana","date":"2016-06-21T22:11:36.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Final Raid Boss,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=0001000000000005,timestamp=2016-06-21T21:04:20.024+0000)\n>\n> meanwhile {{champion:7}} {{champion:105}}\n\n{{champion:11}} untargetable\n{{champion:28}} Can stealth like Rengar only without a bush.","replies":[{"poster":"l Helios l","date":"2016-08-26T02:54:29.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tahyana,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=00010000000000050000,timestamp=2016-06-21T22:11:36.869+0000)\n>\n> {{champion:11}} untargetable\n\n{{champion:35}}  ha fucking ha","replies":[]},{"poster":"edoczkat","date":"2016-06-23T19:40:01.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tahyana,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=00010000000000050000,timestamp=2016-06-21T22:11:36.869+0000)\n>\n> {{champion:11}} untargetable\n> {{champion:28}} Can stealth like Rengar only without a bush.\n\nyou forgot to mention {{champion:45}} that can one shot you and has enormous CC","replies":[{"poster":"Tahyana","date":"2016-06-24T11:44:25.969+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=edoczkat,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=000100000000000500000000,timestamp=2016-06-23T19:40:01.961+0000)\n>\n> you forgot to mention {{champion:45}} that can one shot you and has enormous CC\n\nAh, yes, how could I have forgotten the incredible uncapped scaling yordle? I must be slipping.","replies":[]}]}]}]},{"poster":"YJRBqwXJcS","date":"2016-06-23T20:04:19.456+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=rnTcz9fg,comment-id=000100000000,timestamp=2016-06-20T05:11:53.994+0000)\n>\n> Too early to say much with confidence, I&#x27;d expect ability to almost insta kill from stealth&#x27;s something we&#x27;ll be looking to remove though, with power offered in other ways instead. A full damage Rengar should kill quickly certainly, but there&#x27;s a limit on how quick a kill should be possible (without being super fed) that Rengar gets passed too easily at present.\n\nRiot employee confirms assassin's doing their job is bullshit. Which brings me to question why the duck they are even in the game in the first place.\n\nI'd rather have no assassin's than all assassin's being trash like shaco","replies":[]},{"poster":"AMYS GRAVE","date":"2016-06-20T14:46:26.873+0000","up_votes":1,"down_votes":0,"body":"thank you.","replies":[]}]}]},{"poster":"Dreadlocks","date":"2016-06-20T12:20:28.660+0000","up_votes":1,"down_votes":0,"body":"I hope it's less than that of Shen rework.. I'm not really satisfied with the Shen rework and he was my 3rd most played champion, now i don't play him at all. If i have the same feels for Rengar I don't see myself even playing anymore as i play him 80% of my games now between my accounts and I just really enjoy him as a champion. \n\nCurrently I can play Rengar 2 ways, Assassin, or Tank. Which can be seen as an issue. The problem with going for a bruiser build is that he lacks the damage to be a strong dive threat, and the survivability to last after his initial burst as a bruiser.  I hope what ever you guys decide he's still as fun as he is now cause after the Shen rework, I'm pretty skeptical.","replies":[{"poster":"Poop Jelly","date":"2016-06-23T21:13:14.078+0000","up_votes":1,"down_votes":0,"body":"He's actually very strong, and more fun, too. I'm not sure what factor drove you away from shen but comparing to the old shen, the new shen to me seem to have much more things to do than just leech health and Ult an ally.","replies":[{"poster":"Dreadlocks","date":"2016-06-23T21:32:51.222+0000","up_votes":1,"down_votes":0,"body":"Shen was my 3rd most played champ, so pretty much everything in his old kit was more appealing... sure he's still strong, but I don't enjoy it","replies":[]}]}]},{"poster":"ThePikol","date":"2016-06-20T08:35:17.445+0000","up_votes":1,"down_votes":0,"body":"Will {{champion:121}} as well?","replies":[]}]},{"poster":"theralphy98","date":"2016-06-20T14:33:10.879+0000","up_votes":1,"down_votes":0,"body":"reposting my comment from another thread because this topic fits my question:\n\n> [{quoted}](name=theralphy98,realm=EUW,application-id=A7LBtoKc,discussion-id=eEMPw1MZ,comment-id=008f,timestamp=2016-06-15T15:18:56.746+0000)\n>\n> This might be offtopic but the Zed discussion reminded me of it:\n> \n> how do you feel about the implementation of the assassin pattern in league?\n> key characteristics seem to be low hp pool, high single target burst and the ability to get in and out of combat.\n> Is there more to it?\n> \n> do you think this should be expanded in a potential assassin rework?\n> \n> In a comment a few years ago the lack of a preparation/set up element was brought up.\n> I personally agree as assassins as a class feel balanced but overly simplistic.\n> There seems to be so much more potential to make them more interesting gameplaywise...","replies":[{"poster":"Dreadlocks","date":"2016-06-20T15:50:08.018+0000","up_votes":3,"down_votes":0,"body":"Assassin's in general are going to be hard to balance... if they're simple, they tend to have a lot of raw dmg like rengar and talon... and if they are fancy then u have the frustration of assassin's like zed and leblanc. Either way, both types are hated. And if u do anything in between u have cases like tank akali or old bruiser khazix.","replies":[{"poster":"theralphy98","date":"2016-06-20T19:40:33.330+0000","up_votes":1,"down_votes":1,"body":"I think zed and lb have pretty straightforward playstyles and the designers just used mechanical gating to offset that.\nThey both lack the need to setup or preparate for their plays (especially for getting out i.e. can i get hard cced if i go in)","replies":[{"poster":"Dreadlocks","date":"2016-06-20T22:09:14.632+0000","up_votes":2,"down_votes":0,"body":"I dont see it being very straight forward.. perhaps you can provide an example as to what you think an assassin SHOULD be because i feel like riot has all kinds and if none of them fit your idea of an assassin it would be worth sharing.","replies":[]}]}]}]},{"poster":"Lugg","date":"2016-06-22T14:36:44.750+0000","up_votes":2,"down_votes":3,"body":"He is getting reworked. His kit and playstyle are way too binary and he is toxic as hell. Expect all the champs with stealth to get reworked.","replies":[{"poster":"Dreadlocks","date":"2016-06-22T15:09:39.399+0000","up_votes":3,"down_votes":2,"body":"Thanks meddler","replies":[]},{"poster":"VivaLaKitten","date":"2016-06-23T20:04:51.950+0000","up_votes":1,"down_votes":0,"body":"better not rework Kha'Zix","replies":[{"poster":"Lugg","date":"2016-06-24T14:36:11.586+0000","up_votes":1,"down_votes":0,"body":"K6 is in a pretty good place. The isolation mechanic makes facing him much more fair since you die quick if you don't stay with a teammate but have a chance if you do.","replies":[]}]}]},{"poster":"vaggelisshadow13","date":"2016-12-14T17:48:23.114+0000","up_votes":1,"down_votes":0,"body":"please riot will you please give us the not reworked rengar too us{{champion:107}}","replies":[]},{"poster":"zlumpy","date":"2016-06-20T13:32:36.013+0000","up_votes":1,"down_votes":0,"body":"I hope he becomes a solid top choice again.  I really enjoyed playing him up there.\n\nedit: not that he can't work up there.  Just the changes to his like the bola change weren't ones I like in a top character.","replies":[{"poster":"Aptest","date":"2016-06-23T20:35:38.430+0000","up_votes":1,"down_votes":0,"body":"Top lane Rengar brought a roaming-heavy style of play to top lane: which was positive. \n\nHis ability to, with a slight lead, kill his lane opponent and snowball, coupled with his ability to push fast and take down towers fast, specifically with his ability at some iterations to just ult and escape, was a major negative.","replies":[{"poster":"zlumpy","date":"2016-06-23T21:44:50.186+0000","up_votes":1,"down_votes":0,"body":"Yeah I just miss the old passive stylr of using bola as a poke and playing passive near bushes to punish mistakes.  Not really a fan of everyskill in the game becoming a skill shot even if it does mean they gain new benefits in different areas.  Its why I may never play top again if they change malph to a skill shot.  Point click has a place in the game.","replies":[]}]}]}]}