{"poster":"Dreadlocks","date":"2017-06-16T17:46:04.765+0000","title":"Riot wants feedback on Yasuo. (Friendly conversations inside pls) What makes him fun/anti fun?","subforum":"Gameplay","up_votes":27,"down_votes":6,"body":"http://www.surrenderat20.net/2017/06/red-post-collection-june-15th-mid-patch.html#more\n> *While these numbers certainly aren&rsquo;t conclusive, nor necessarily indicative of a problem, it&rsquo;s an interesting note that in the most competitive environment Yasuo actually struggles to find his place on the Rift. \nOur belief is that if we want to get him into a state where he is both viable and also not a must-ban, **we need to tweak more than numbers.** He was already pretty high on our list of champions that we wanted to look at on the scope of a potential ability update (think Rek&rsquo;sai, Kindred, Heimer etc.), and with the release of 10 bans he&rsquo;s moved right up alongside some fellow counterparts in Leblanc and Azir. \nI want to stress that we haven&rsquo;t begun investigation yet as we iterate on some other projects, but we&rsquo;ll be taking a look at him in the next few weeks.** I&rsquo;d expect that when we&rsquo;re done Yasuo will look and feel very similar to now, but with power shifted around on his kit to provide more windows of engaging decision making for his opponents, while maintaining a lot of the agile swordmaster experience he provides today.** Again, we&rsquo;re thrilled that Yasuo is a champion that gives people who play him something to love, now we just need to find a fair way to have his opponents accept their fate as he steals their last breath with his blade. \nWe would love to hear your thoughts on this, actually! **What is it that you love about playing as Yasuo? What is it that you hate when playing against him? Tell us in the comments! **\n\n\nI&#039;ll start by saying i&#039;m not a Yasuo main by any means, I use to play the champion quite often because I did find him fun.\n\nThings I like(d) about Yasuo that have even been hurt, or still exist. (while playing as)\n1. E felt very smooth to max\n2. Weaving autos between Q&#039;s is actually really important\n3. E/Q combos. (with flash as well)\n4. Trinity/Mallet build.\n\nI know 4 was hated by a lot of people. But i&#039;ll explain why later it was fun for me.\n\nThings i don&#039;t like, or feel strongly towards keeping/being strong.\n1. His feast or famine gameplay. Either he can 1v9, or he puts your team into feeling like its 4v5 with how hard he can feed trying to do his &quot;job&quot;\n2. Don&#039;t really care about the double crit personally, its fun but his kit is fun without it.\n3. His windwall feels overtuned in the sense that, i thought forsure i was casting it late a lot of times as it looked like an ashe arrow was already making contact, but i still manged to block it.\n4. The duration he can keep people in the air. (i think the time could be cut in half, makes Yasuo players have to react faster to their knock-up rather then holding it)\n\nNow i&#039;ll probably catch a lot of flack for this because Yasuo mains themselves will likely feel strongly in other areas than myself. The reason i liked the Mallet/Trinity build &quot;era&quot; is because it made Yasuo more of a team playing champion. He often grouped with his team because he needed them to help with his damage. Though his damage wasn&#039;t garbage, it wasn&#039;t nearly as good as the crit/lifesteal build. So in that Regard, i liked the tankier build on him as it also fit with his kit, and play patterns pretty well.\n\nFluidity is important to me, and so when they started making his E and Q clunky to me, i stopped playing him.. I love the champion but i&#039;m not a 1 trick so i dropped him. \n\nTLDR: For me.. Make Yasuo&#039;s kit less 1v9 or 4v5  and return the fluidity of the champion back to how it was.. Take parts out of his kit that don&#039;t need to be there to be successful. IMO the crit part.\n\nThis is my opinion, everyone has their own triggers with Yasuo, some hate the windwall the most, some hate the crit the most, others hate the ulti&#039; positioning outside the turret, others hate the E spam etc.. EVERYONE who hates yasuo has their own opinion on this part.\n\n**For me, I hate having Yasuo on my team or the enemy VASTLY because i feel like he makes or breaks the winning conditions more than any other champion in the game. Aka Feast/Famine.**","replies":[{"poster":"Acheron16","date":"2017-06-16T18:42:12.528+0000","up_votes":29,"down_votes":3,"body":"What makes him so very anti-fun:\n\n- Doesn't have real resources, he can spam his abilities without much care. He never has decision making like \"Mmm, should I Q this or not?\", \"Should I throw my tornado or not?\", because he'll be able to Q again in 2 seconds and throw a tornado again in 6.\n\n- His E gives him excessive mobility, making a good Yasuo pretty much immune to skill-shots\n\n- His ultimate favours him under towers, literally the only one that does so. If Rek'Sai misses her ultimate she's not left outside of a tower, she pays for it with her life, Yasuo doesn't unless he dives smack-dab in the middle of the tower.\n\n- His windwall lasts too much for how powerful it is. For comparison, Shen's W blocks solely auto-attacks, yet only lasts 1.5 seconds. On a tank. Not to mention that the fact that the Windwall spawns from within him it means that it can very briefly block skill shots from behind him, which is completely unfair. I'm ok with the fact that it blocks any projectile that hits it smack in the middle, but it has to last less or have a bigger cooldown than it currently does and cannot block things that come up behind the cast. Even Fiora's Riposte has a much longer cooldown (and an actual mana cost) for how little it lasts.\n\n- The fact that he has two passives. I find his shield passive to be ok, if annoying, but his crit passive is completely free and he'd be much easier to balance without it. Riot has claimed many times that it exists in order to have Yasuo not go Tank. So let me get this straight, you give him a passive, on top of another passive, that makes it so that he has to invest less into crit/damage in order to do ~~good~~ great damage so that he buys less tank items? I'm sorry, did I miss something? The last time I checked, having to invest less into damage means that you are free to either invest in even more damage (reaching obscene amounts of damage) OR you can invest into tankyness, so you can apply that free damage more reliably. Wasn't this the reason why he got all those nerfs to his base stats?\n\nYeah, I'm sure playing Yasuo feels great and fun for the player, but I've NEVER, EVER heard someone say \"Oh I'm facing an Yasuo, I'm ok with that\". In order for him to become tolerable to play against he needs to have his mobility seriously toned down, given meaningful windows where he's mobile and times where he isn't. As it stands, he never lacks mobility since early game he has minions and late game the dash cooldown is so low that in teamfights he also never lacks mobility. The only time he lacks mobility is early game if he has minion disadvantage, that's it.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T19:25:04.089+0000","up_votes":3,"down_votes":3,"body":"Essentially his W needs to be shorter and his E seems fine based on what you said, to me if a champ is good at dodging skill shots with E he doesnt need much help from his W. From what people have said abt yasuo on both sides, the W is overkill.","replies":[{"poster":"Acheron16","date":"2017-06-16T20:00:47.150+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=00060001,timestamp=2017-06-16T19:25:04.089+0000)\n>\n> Essentially his W needs to be shorter and his E seems fine based on what you said, to me if a champ is good at dodging skill shots with E he doesnt need much help from his W. From what people have said abt yasuo on both sides, the W is overkill.\n\nThat's not the point. Both his E and W are too much, he has virtually unlimited dashes in a teamfight and his W can block 90% of the abilities in the game. Either he has one or the other, not both.\nSame goes to his passive.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T20:21:38.435+0000","up_votes":4,"down_votes":2,"body":"So if he gets a new W then he's fair? I couldn't imagine being a yasuo player and losing my E ability","replies":[{"poster":"Acheron16","date":"2017-06-16T20:45:43.073+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=0006000100000000,timestamp=2017-06-16T20:21:38.435+0000)\n>\n> So if he gets a new W then he&#x27;s fair? I couldn&#x27;t imagine being a yasuo player and losing my E ability\n\nNo, but his W has a longer cooldown or a lower duration (1.5 seconds at most) it'd be much more balanced.\nAnd his E could be changed into an ammo system (where dashing costs ammo) but in return it dashes further and faster, so that he can't just dash forever and ignore skillshots with both the dashes and windwall.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:01:08.723+0000","up_votes":2,"down_votes":0,"body":"I think these changes are fair. My question in an unbiased answer is, are they just straight nerfs, do u think he could get some nerfs reverted from past patches, and do u think this is the approach riot is looking for when they say, \"outside of numbers\"","replies":[{"poster":"Acheron16","date":"2017-06-16T21:50:47.148+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=000600010000000000000000,timestamp=2017-06-16T21:01:08.723+0000)\n>\n> I think these changes are fair. My question in an unbiased answer is, are they just straight nerfs, do u think he could get some nerfs reverted from past patches, and do u think this is the approach riot is looking for when they say, &quot;outside of numbers&quot;\n\nYes these are the nerfs.\n\nThe buffs would be faster generation on his shield, better overall base stats for a fighter and better base damage on his skills. Because there's no denying his base stats are pretty crap due to how continuously nerfed he was because his kit is so versatile and forgiving, they had to remove stats in order for him to have a weakness at all. \n\nMy original post answers why he's frustrating to play against, what skills should be changed in order to be less frustrating, not how he should be changed to balanced.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T22:10:14.302+0000","up_votes":2,"down_votes":0,"body":"> The buffs would be faster generation on his shield, better overall base stats for a fighter and better base damage on his skills. Because there's no denying his base stats are pretty crap due to how continuously nerfed he was because his kit is so versatile and forgiving, they had to remove stats in order for him to have a weakness at all.\n\nI agree with this completely. It would also help Yasuo feel less feast or famine by nature of a fighter.","replies":[{"poster":"TheSingularity","date":"2017-06-17T08:11:52.218+0000","up_votes":2,"down_votes":0,"body":"In order to feel less feat or famine. He needs a clearer and healthier power curve than the current crit item power spike which lacks a weak phase.\n\nJust from seeing him. There is no obvious \"yasuo is weak now\" as there is with xin zhao who falls off, veigar who is meh early and situational champs who generally scale slower than opposition (weaker mid games).\n\nIMO there are 3 options, note they don't necessarily mean less feast or famine, but can be adjusted to change that:\n\n1.  Strong early, weak mid, strong late. In this case he would have high bases, weak mid game scaling (defensive is optimal) and he'd lack tank shredding capabilities (tanks are mostly strong mid game when they have items, they are his counter here). And a strong lategame when his scalings catch up.\n\n2. Strong early, strong mid, weak late. This is classic xin zhao. He'd be able to destroy champions and sustain his lead. However if he can't close out the game he will become a meat shield. Downside is a timer is placed on him to win before that happens.\n\n3. Classic hyper carry: Weak early, decent mid, strong late. This is all in having the bare minimum bases, decent mid game scaling, high late scaling and item dependency which rewards him greatly when he finally gets them. \n\n\nGiving yasuo a clear power curve will not only alleviate his lack thereof, but will allow him to be better balanced around the items he has available.","replies":[]}]}]},{"poster":"FirewaterDM","date":"2017-06-16T21:43:41.424+0000","up_votes":3,"down_votes":1,"body":"Yes solely nerfs. Because I honestly think windwall is the 100% true reason Yasuo is hated by so many people. Like the mobility doesn't matter because eventually something hits or he runs out of minions/things to dash to, crit's whatever since randuins, armor, staying out of range exists. I do think, again even the hypercarry portion of his kit could be allowed to stay if his capabilities for defense besides his mobility were gutted.\n\nWouldn't think any buffs are justified, but there is some argument that you could increase Yasuo's mobility in exchange for adding more actual counterplay/making his windwall not utterly fuck every mage/ADC in the game. Like 100% the fact that autos get blocked bothers me more than any of the abilities that get blocked even with the changes I've suggested.\n\nAs for the other question, Nerfing/fixing windwall to be more forgiving QOL to opponents is 100% the only way to fix the most egregious way that Yasuo causes people to hate him without touching numbers. Even if you kept the duration/CD the same, making it so ultimates/ already fired projectiles went through + autos went through makes yasuo far fairer to fight and less frustrating. But it's the only thing besides reworking him, removal of a portion, or touching numbers that I can think of, because even if Yasuo's numbers are atrocious his kit still would be toxic.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:47:15.757+0000","up_votes":2,"down_votes":1,"body":"What do you think about Yasuo having the 2nd highest deaths per game? Sometimes even the most?\n\nAs i said to someone else and at the end of my OP, he seems very feast or famine in the sense that, when he is ahead his tools become overwhelming, but when they are behind they are practically meaningless.\n\nDo you feel this is true, and if so, how do your changes fix this?","replies":[]}]}]},{"poster":"TheAustinWorm","date":"2017-07-16T18:41:45.974+0000","up_votes":1,"down_votes":0,"body":"Same, maybe lower windwall CD. Just lower duration. Don't think ammo system would work well with the rest of his kit.","replies":[]}]}]}]}]},{"poster":"Spoofghoul","date":"2017-06-17T22:43:44.434+0000","up_votes":5,"down_votes":0,"body":"You make fair points\n\nmy main issue is all his ''free'' stats\n\nhis shield is pretty much ''free hp''\n\neven if you poke it you get minion aggro and then you just lost a trade\nbut you have to do it to win the next trade it's kind of bs\n\nThen there is the double crit, you already pointed at the fact that it reduces the need to invest into damage. But it also lets him get fast power spikes  making it hard to keep him down.\n\nAnd then there is the ult which gives armorpen kinda similar to his free crit it lessens the need for damage items, in this case last whisper items for example\n\nwhy does he need all that","replies":[]}]},{"poster":"KnightsKemplar","date":"2017-06-16T20:44:58.336+0000","up_votes":12,"down_votes":0,"body":"Good, thorough analysis. His windwall has always been the biggest pain point for me, so it feels good to see it someone else's list. \n\nI think your last paragraph is really nice synopsis of the problem, but I want to add a bit to it: there are too many things in his kit that feel VERY unique, to the point that having him in the game at all REALLY changes the dynamic. The feast/famine is part of the problem, but to me, it's just that the impact he has on any given game just from being picked is absurd. You have to play so differently around him, even if he's technically balanced. \n\nIn general, there is such a thing as being TOO different, especially when the burden of playing against it becomes very high for people who did not opt into that interaction. Yasuo may be the only champ that really embodies that, and that's why we see such a strange, inverse power curve for him. His impact is largely determined by the skill of the people who didn't pick him. That's not healthy.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:35:03.946+0000","up_votes":3,"down_votes":0,"body":"> there are too many things in his kit that feel VERY unique, to the point that having him in the game at all REALLY changes the dynamic.\n\nThis is forsure spot on. This ties heavily into why he is hated. People hate Syndra because of her R doing lots of damage even if she misses Qs, Fizz because of his Troll Pole on E.. Trynd cuz of his R, Rengar 1 shot from stealth, Morgana for her Q snare duration etc.. Everyone has 1 spell that just makes them super frustrating to play against, healthy or not its a big part of the champion.. But as you stated Yasuo has A LOTTTTTTT of things that people find frustrating and feel very unique to his kit.\n\n> His impact is largely determined by the skill of the people who didn't pick him.\n\nEven some of the better Yasuo players can run into games where they just simply feed. It's the nature of the champion right now. He averages the 2nd highest deaths per game according to http://champion.gg/statistics/#/roleSort=Top&sortBy=general.deaths&order=descend?sortBy=general.deaths&order=descend Which feeds right into the feast or famine of the champion.\n\nI just really hope riot doesn't change this champion so much that the Yasuo player base no longer finds him appealing. I myself don't really dig the new Rengar nearly as much, and it wouldn't be fair to the Yasuo community if something similar was done to him. Yasuo should keep his Fluidity no matter how they decide to change him.. Making a champion clunky is just a bad way to balance them in my personal opinion. Aside from that, i cant imagine them somehow turning him into an assassin /or/ tank ;) haha","replies":[]}]},{"poster":"hhaavviikk","date":"2017-06-16T19:14:13.129+0000","up_votes":8,"down_votes":0,"body":"his hidden power in E, you basically have to play with the assumption that yasuo can always dash to you and can always dash away from you because it isn't shown to you which minions he has used E on or what the cd on them is, that's a lack of clarity which in turn gives him power, hidden power, imagine brand his passive being invisible on minions, that would also be hidden power.","replies":[]},{"poster":"JJI744","date":"2017-06-17T08:20:29.741+0000","up_votes":6,"down_votes":0,"body":"Ability by Ability\n\nQ frequency in-lane is kinda a sore point for me. The low CD causes a few issues in-lane.\n\n1) Ability to farm from \"range.\" Its not exactly far, but it does mean any melee champ that wants to harass has to walk up into his creep wave to do so, and any ranged champ has to walk into the middle of their creep wave. (Easy dash distance)\n\n2) No window of opportunity to take advantage of CD. Kinda self-explanitory, but basically by the time you say \"His Q is down, time to fight\" its back up.\n\n3) More manaless ranged poke and CC than is really reasonable. Yasuo Q tornado is ~10s at lvl 1. (a little less if you run AS runes, a little more if you don't) It seems a little strange that a melee carry has ranged poke on a CD nearly the same as Lux, a poke-heavy champion. And Yasuo's CD drops down to 4s with an item. And to be blunt, an AoE knockup every 4s is a heck of a lot of CC. Like most supports don't have that much CC, hell, most tanks don't have that much CC in their entire kit. (See also: Riven)\n\n4) Has caused that awkward problem where a late-game hypercarry has amongst the strongest early lvls in the game.\n\nScaling down to its current lvls seems... okish to me, but having it start that low baseline means that Yasuo is spamming away without a care while his opponent has to always be mindful of their CDs/resources. After all, its not like Yasuo would have to wait on CDs if you ever waste a spell.\n\n\n\n\nLets be blunt here. If your champion is reliant on projectiles with a reasonable CD, windwall is basically a hard counter. The fact that its instant means that the only way you can play around it is to hope that Yasuo either A) Doesn't react in time. B) uses windwall on some spell, doesn't take advantage of the fact that your spell is on CD, waits for your CD to be up, then puts himself in a bad position again before windwall comes off CD. Its also a little weird to have such a powerful utility spell (one of the best) on a melee carry champion. Oh, and blocking minions/monster projectiles is actually a lot of power.\n\n\n\n\nE needs to have some window of vunerability. Right now it has the same issue as Kat Shunpo had, you can use E to gapclose for harass, but its basically immediately available to retreat as well, leaving your opponent with no chance to return damage. This is a BIG part of why laning vs. Yasuo isn't fun. He's free to engage on you at basically any point, but will still have his mobility spell up to escape if he gets ganked or takes a fight he will lose. (See also, LB)\n\n\n\nI'm actually pretty OK with his ult. The towers thing is a bit weird, but whatever. One big thing though 80 / 55 / 30 CD. ignoring the 30s R3 ulti (really, why?), 80s is low for a R1 ultimate. For referance, Riven's ult before 2 nerfs was 75 / 60 / 45. Current Riven ult is 130 / 95 / 60.","replies":[]},{"poster":"Sir Yamazuki","date":"2017-06-16T21:35:53.029+0000","up_votes":6,"down_votes":0,"body":"I just see him as a champion that is compensated too much for being \"melee\". Fiora and some others are in this situation, where they're always too good or not due to heavy compensation that makes them frustrating to play against.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:38:55.897+0000","up_votes":1,"down_votes":1,"body":"To some degree I agree, he has a lot of defensive tools. But despite having all those defensive tools, even in higher level of play, he averages the 2nd most deaths per game of any champion.. and some patches the most. http://champion.gg/statistics/#/roleSort=Top&sortBy=general.deaths&order=descend?sortBy=general.deaths&order=descend\n\nThe issue with this clearly shows his kit is Feast or Famine. He either gets so far ahead these defensive become overwhelming, Or he becomes so far behind, they are practically meaningless.","replies":[{"poster":"Sir Yamazuki","date":"2017-06-16T21:44:31.251+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=00120000,timestamp=2017-06-16T21:38:55.897+0000)\n>\n> To some degree I agree, he has a lot of defensive tools. But despite having all those defensive tools, even in higher level of play, he averages the 2nd most deaths per game of any champion.. and some patches the most. http://champion.gg/statistics/#/roleSort=Top&amp;sortBy=general.deaths&amp;order=descend?sortBy=general.deaths&amp;order=descend\n> \n> The issue with this clearly shows his kit is Feast or Famine. He either gets so far ahead these defensive become overwhelming, Or he becomes so far behind, they are practically meaningless.\n\nI don't mean in just defensive tools, but his mobility and extra damage is for being \"melee\". Melees tend to get an extra mix of defense, offense, and mobility due to not being ranged.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:48:53.344+0000","up_votes":1,"down_votes":0,"body":"> but his mobility and extra damage is for being \"melee\". \n\nYou are saying his mobility and extra damage is too much? Sorry i can't clearly depict what you are trying to convey.","replies":[{"poster":"Sir Yamazuki","date":"2017-06-16T21:54:54.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=0012000000000000,timestamp=2017-06-16T21:48:53.344+0000)\n>\n> You are saying his mobility and extra damage is too much? Sorry i can&#x27;t clearly depict what you are trying to convey.\n\nWhen you have all 3 together, yes it's what makes it frustrating. You're not only not going to get away from him, or not catch him unless your champion beats him but you also most likely won't win against him as most champions due to what his kit has. I don't have an issue with his damage and mobility though, I just don't think his W fits in with what his role is. The utility aspect is what I have an issue with on Fiora too, her attack speed reduction. If he keeps his W it should either have a shorter duration, have a health bar, or only absorb part of the damage like Braum.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T21:58:32.133+0000","up_votes":1,"down_votes":0,"body":"I agree with the Fiora part lol. And yeah I get what you mean with Yas as well. It just seems like the rest of his kit functions just fine with out it and then you add windwall to it, and it just becomes oppressive. \n\nMy biggest concern which i stated at the bottom is his feast or famine playstyle. Do you think if his W was changed drastically that it would make number nerfs a valid way to balance him? Or do you think his kit would still be inherently broken?","replies":[{"poster":"Sir Yamazuki","date":"2017-06-16T22:10:27.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=001200000000000000000000,timestamp=2017-06-16T21:58:32.133+0000)\n>\n> I agree with the Fiora part lol. And yeah I get what you mean with Yas as well. It just seems like the rest of his kit functions just fine with out it and then you add windwall to it, and it just becomes oppressive. \n> \n> My biggest concern which i stated at the bottom is his feast or famine playstyle. Do you think if his W was changed drastically that it would make number nerfs a valid way to balance him? Or do you think his kit would still be inherently broken?\n\nHis feast or famine side is partly due to difficulty and champion select playing a heavy factor into his success. He loses pretty hard against some top/mid laners, with others just being heavily in his favor unless the Yasuo lacks experience. If there were to be consistency he would have to have some pretty big changes.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T22:24:51.808+0000","up_votes":2,"down_votes":0,"body":"I think match up is probably the most influential part of this. Some match ups he can just dominate from lvl 1.. and others, {{champion:58}} .... are a freaking nightmare.\n\nI think experience has a lot to do with it, but probably not as much as the match-ups.. Hell i've seen some good Yasuo players feed simply due to the match up they were given. It's like, even if they don't feed early, the match up never gets any easier.\n\nI know this might sound stupid at first but i think Yasuo needs to become MORE of a generalist, and less of a Specialist. And as you said, he's going to need some changes to get that consistency. \n\nWhat kind of things could help with this consistency? Well the first thing would probably be to address the specialties.. the things everyone hates and then figure out which ones could become less special. Personally, I think someone else mentioned how his stats are simply too low for a fighter, and its largley due to all his Specialties, as i'm stating here.. So perhaps with a happy-medium, he could find that consistency.\n\nPersonally, i think his W is too special, and that would be the first thing i looked at, as he can impact so many champions with it. Hurting W would help him be stronger in the other areas of his kit. Without actually making them busted.","replies":[]}]}]}]}]}]}]}]},{"poster":"Call Me Nana","date":"2017-06-16T17:55:01.747+0000","up_votes":6,"down_votes":0,"body":"His mobility is beyond frustrating, the double passive is insanely irritating and the windwall cast hitbox is so enormous good luck playing any mage against him because his windwall cooldowns match your strongest spell ones.","replies":[]},{"poster":"hotarse","date":"2017-06-17T03:43:50.060+0000","up_votes":5,"down_votes":0,"body":"If riot is serious about changing Yasuo, they already have 10,000s of posts on the subject. They probably have played with, as, and against yasuos in the past. If they really need our feedback now, how hopeless are they? This is just the beginning of a circle jerk to assure us that their \"skin-magnet\" \"big plays\" champion won't need to be banned in the future when they actually won't change anything about him to make him fair. \nGG Riot Game.","replies":[{"poster":"Dreadlocks","date":"2017-06-17T05:43:42.558+0000","up_votes":1,"down_votes":1,"body":"Pretty sure most of those posts don't have any backbone, they're just QQ threads.","replies":[{"poster":"manbearswine","date":"2017-06-17T11:16:16.932+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rengar Revert,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=00230000,timestamp=2017-06-17T05:43:42.558+0000)\n>\n> Pretty sure most of those posts don&#x27;t have any backbone, they&#x27;re just QQ threads.\n\nThere's been enough of them which were detailed though.\n\nAnyway at this point you'd have to basically be retarded to not realize his problem is e and windwall, too many champions are too reliant on him messing up, his problems aren't unique at the slightest at this point(windwall is pretty much kassadin's old silence behind a reflex check, and e has deep similarities with le blancs old w), I think they just want to create an illusion that they are listening, probably because they don't intend to listen(otherwise no need to ask about something they should already be aware of).","replies":[]}]}]},{"poster":"Handy Sandy ","date":"2017-06-16T17:49:35.278+0000","up_votes":6,"down_votes":1,"body":"I just hate how he can kill you at level 2 + he scales well. One of those need to go. Maybe shift some power so he's not overwhelming when he's with minions and not trash when he's without minions. ","replies":[{"poster":"Mouth Stuff","date":"2017-06-16T18:12:32.311+0000","up_votes":5,"down_votes":7,"body":"if yasuo is killing you at level two you might need to play a bit safer or get a gank :)","replies":[{"poster":"Handy Sandy ","date":"2017-06-16T20:00:59.221+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=souleater656,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=00010000,timestamp=2017-06-16T18:12:32.311+0000)\n>\n> if yasuo is killing you at level two you might need to play a bit safer or get a gank :)\n\nno some lategame hyperrcarry shouldn't be able to force a fight like he does. Look at other hypercarries, {{champion:268}} {{champion:30}} {{champion:11}} {{champion:69}} they're either mana hungry enough that they can't kill you early, or they just don't do enough damage to.","replies":[{"poster":"Spicy Rice","date":"2017-06-17T01:37:59.367+0000","up_votes":2,"down_votes":2,"body":"I wouldn't consider karthus or Cassio a lategame hyper carry.\n\nLane yi can easily solo kill at level 2. It's just that no one plays it enough for people to realize that\n\nAnd pre-dumpstered azir was so lane dominant, that if you weren't ranged and didn't have enough wave clear to match him, you simply didn't get to lane","replies":[{"poster":"Handy Sandy ","date":"2017-06-17T02:32:29.855+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Spicy Rice,realm=NA,application-id=3ErqAdtq,discussion-id=IRnBtb2r,comment-id=0001000000010000,timestamp=2017-06-17T01:37:59.367+0000)\n>\n> I wouldn&#x27;t consider karthus or Cassio a lategame hyper carry.\n> \n> Lane yi can easily solo kill at level 2. It&#x27;s just that no one plays it enough for people to realize that\n> \n> And pre-dumpstered azir was so lane dominant, that if you weren&#x27;t ranged and didn&#x27;t have enough wave clear to match him, you simply didn&#x27;t get to lane\n\nA hypercarry isn't something like an assassin or burst mage, it's more. They don't have to worry about cooldowns, they can just keep dishing out damage and then more damage, and then even more. Cass is basically known to be a hypercarry because she um **has the highest dps in the game.** Karthus isn't as popular but does the same thing stuff like Vayne or Caitlyn does which is 3 shot everyone lategame (same as cass) \n\nSome more are {{champion:67}} {{champion:96}} {{champion:10}} who -- again, don't kill you at level 2 **Because they have weak laning. But later in the game they become strong enough to single handedly carry a game.**\n\nLane yi would have a much harder time actually killing you at level 2 because he actually has to worry about his cooldowns, otherwise jungle yi wouldn't afk farm until level 6 or get invaded all the time. ","replies":[]}]}]}]}]},{"poster":"ADC5LUT","date":"2017-06-16T23:11:43.524+0000","up_votes":3,"down_votes":4,"body":"Things that make yasuo anti fun:\n\npassive shield feeling like its always up\n1 item spike that turns him from 0-3 into legendary killing sprees\nwall that deletes entire champion kits\nunlimited dashes \ne q combo so that even if you're skilled and dodge all of his qs he can still knock you up no matter what and kill you (just like W > R for lee ugh)\nult that pushes him out of range turret and gives 50% bonus armor pen and is like a 20 second cd max rank and to top it off extremely extremely forgiving to use and can be used with practically any displacement\n\noh look at that, his entire fucking kit.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T23:15:08.648+0000","up_votes":5,"down_votes":0,"body":"Doesn't look like you're making a very strong argument though. Simply saying \"everything is bullshit\" isn't going to help riot fix the issue. My suggestion would be pinpointing which one is the biggest issue for you then make some reasons as to why it shouldn't be there, or at least not to the same extent.","replies":[{"poster":"ADC5LUT","date":"2017-06-16T23:19:46.269+0000","up_votes":2,"down_votes":7,"body":"the entire design of the champion is cancerous and anti fun, there is nothing redeeming about him and i really don't mind if riot takes my post seriously or not, they should learn to not overload kits for the sake of lc fucking s.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T23:29:13.558+0000","up_votes":8,"down_votes":1,"body":"Alright well you're clearly not here for the friendly convo about Yasuo, intead you are here to give biased insults against him. Later.","replies":[]}]}]}]},{"poster":"DoktorKaiser","date":"2017-06-17T01:24:39.552+0000","up_votes":4,"down_votes":0,"body":"OK here it comes:\n\n- the worst thing is his dashing, its the most boring thing to play against in league, its literally infinite mobility on 0 cooldown on resourceless champion... just why??\n\n- second worst is probably his windwall, its too wide, blocks too much stuff, its too buggy and I think it should be scrapped completely honestly since its probably the skill with the most bugs I have ever seen in league, not to mention how toxic it is especially vs champions such as Nami\n\n- his ulti mechanic where he is placed outside the tower range is just stupid and encourages him to tower dive which is exactly what he should never do. Many other champs with similar ultimates dont have this mechanic so neither should Yasuo.\n\n- both his passives are super powerfull, 1 needs to go or at least be weakened heavily and placed on his W","replies":[]},{"poster":"rtbf30982911","date":"2017-06-18T19:43:03.491+0000","up_votes":3,"down_votes":0,"body":"He has so many passives, bonuses, and unique features that make him just **feel** broken and unfair. The windwall, the no need for CRD, the almost no need for armor pen, etc. Why should one champion have that much unique stuff in his kit?\n\nHere's a short clip from Voyboys youtube:\nhttps://youtu.be/4QAyNBhiu3k?t=225\n\nIt really shows the stupid favoritism Yas gets with his design. See how Voy knocks Ori up? See how when he uses R, hes instantly teleported as far away from the turret as humanly possible? That's some bullshit design if i ever saw it. If a champ wants to dive under tower with a suspend ulti, at least let him **TANK ** the turret at the point where the enemy stands/where Yas ulted.\n\nIt feels like whoever designed the champion had a serious hardon for \"their\" pet project, there's just so much in the champ that is obviously stupid but it went live anyways. It's very similar to how Riot Jag, the designer of Camille, put way to much stuff in Camilles kit and then defender her release state on Reddit claiming that only a few % nerfs to her Q would be enough. We all saw what happened, she needed several really big nerfs to be in line. It's like a kid and his favorite D&D or Skyrim character, it's broken AF but he loves it. This is a billion dollar company and not some kids basement, we should expect the designers to have some restraint to design champions that are cool but not overloaded and overtuned with \"OMG MY CHAMP IS THE BEST EVER, AWESOME!\" bullshit.","replies":[]},{"poster":"Quepha","date":"2017-06-16T19:33:45.431+0000","up_votes":2,"down_votes":1,"body":"His zone of threat extends around all of my minions, nothing feels worse than when he gets a small lead and you literally can't contest any cs because he can dash right up to you the instant you approach your wave.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T19:37:04.839+0000","up_votes":2,"down_votes":2,"body":"I think that tied into his kit fine though. Rengar tied to brushes in a similar way. Lee sin hates when u kite him thru ur minions. Ryze does better when u stand in ur own minions etc..\n\nI think if ur losing lane ur going to be zoned out of cs regardless of the technique","replies":[{"poster":"Quepha","date":"2017-06-16T19:39:56.464+0000","up_votes":4,"down_votes":1,"body":"If he's a laner it absolutely is not fine. The fundamental mechanics of the lane phase depend on your side of the wave being safer for you than the enemy. When your side of the lane gives more tactical advantage for the enemy than you, the game literally falls apart.\n\nThe big difference between Yasuo dashing around minions and Rengar dashing out of bushes, is that bushes are SUPPOSED to be dangerous no matter who you are or who you're against. Going near an unwarded bush has a risk that you are giving up ground to a champion (or group of champions) that you do not want to. It's much more dangerous with a Rengar on the field but it's still the same principle instead of completely reversing the situation.","replies":[]}]}]},{"poster":"Akali Prime","date":"2017-06-16T18:04:47.465+0000","up_votes":4,"down_votes":1,"body":"his whole kit is really frustrating to play around, you want to hurt him? thats fine you just have to pop his sheild, then when you pop his shield you can use your abilites on him, OH wait he just windwalls and blocks your abilites,  but thats ok maybe now i can hit when with my remaining ablities NOPE he just dashes back in forth through my minions dodging my skillshots and getting free poke on me, but now hes closer i can auto him to get a little damage off NOPE his sheilds back up. rinse and repeat.","replies":[]},{"poster":"kargish","date":"2017-06-16T22:37:21.051+0000","up_votes":7,"down_votes":4,"body":"I honestly think Yasuo is the perfect champion design, next to Jhin that is. He has a clear theme, and he fits it perfectly; you're this samurai guy who has mastered a legendary wind technique, and because of it you use it to slice enemies, shield yourself and move as fast as the wind. It's a really cool theme and it fits him and his playstyle perfectly.\nPlaying Yasuo is also extremely satisfying, he's really smooth in his movements and auto resets, and to top it off he has one of the most cool looking ultimates in the game. I know a lot of people don't like his 100% crit chance design, but personally I think it's a fair enough mechanic to have, as he trade off a lot of base damage for it (Q only doing 100 base damage plus -25% crit damage). \nThe only thing I see as bad design on him, is the fact that windwall is such a forgiving ability. Using it correctly is the difference between taking no damage and death, but all you gotta do is merely press W in the direction you expect the damage to come from, and then you're pretty much safe for the next 5 seconds or so.\nStill love his design and theme, really think whoever made this champion should receive a raise.","replies":[{"poster":"Dreadlocks","date":"2017-06-16T23:01:57.766+0000","up_votes":3,"down_votes":2,"body":"> Playing Yasuo is also extremely satisfying, **he's really smooth in his movements and auto resets**, and to top it off he has one of the most cool looking ultimates in the game.\n\n{{champion:107}} I use to know what that felt like =[\n\n> The only thing I see as bad design on him, is the fact that windwall is such a forgiving ability. \n\nSee this is what I agree with, and many others. Typically people will cry about his mobility AND his W but i think the E being annoying is more of a fitting trait to Yasuo rather than it being a broken concept.\n\nBut his W is kind of a broken Concept, it blocks EVERY PROJECTILE for 3.75s and the width only gets bigger lol Thats pretty massive. If this wasn't so strong, i could see him doing the fun things Yas does more. (i.e not banned, still knockin b1tches up)\n\nSo.. I use to play Yas, admittedly i dropped him after the E nerfs, i tried him again after the Q nerfs but i'm just not in touch anymore. He's hard no doubt.\n\nI feel kind of stupid for saying this, but one of the reasons i made this thread was because of what happen to my main {{champion:107}}  They took a champion a lot of people loved and turned him into something most of us cant stand. I have this feeling inside of me that makes me want to stand up for the rest of the community now despite some of the backlash i've gotten about Rengar.\n\nYou love your champ.. I love mine, and even though i'm not playing him anymore, I still think you should still love your champion after they address him. I would stand up for champs that i hate as well, i.e kat/fizz. And I hope you see that i'm merely trying to stick up for the Yasuo mains, or any other champion that is going to be reworked.\n\nI wish Riot listened to the public more before doing these reworks, it sounds like they want to for Yasuo, so maybe they're going to start. But just know man, I'm on your side :)","replies":[]}]},{"poster":"ESeTyRC","date":"2017-06-17T21:15:41.708+0000","up_votes":2,"down_votes":0,"body":"Hoping RIOT really reads these, leaving my 2 (or 4) cents.\n\nI really do think of Yasuo as a cool character, but haven't even played him in a very long time because his kit makes very little sense to me, given his theme. Here's why.\n\n#1. Yasuo is an obviously Oriental character made with heavy emphasis on Wind as an element, but his uses of Wind  CONTRADICT the Oriental concept of Wind:* Wind is fleeting and swift, always in motion, never still (it does not exist when there is stillness).\n\nIn context of this, Wind gathering around Yasuo to become a shield [passive] makes no sense whatsoever. Heck, it doesn't even decay when stopped in place (as redundant as that would be). If anything, Wind should be his resource because Wind is something that comes then goes. Not something that comes, stays and hangs out, and hardens to protect from bullet and blade alike as a shield [passive]. His long-term stationary wall that somehow selectively blocks only enemy attacks [W] only makes a bit more sense. How is it not blocking his own team's? Why does it last for so long? \n\n#2. Wind is Yang in nature- it can be gentle, but it can be very forceful. What connects these two is speed. More speed -> more force. Yasuo, however, doesn't actually scale off movement speed or attack speed in terms of hitting harder: he just gets faster like everyone else.\n\nIn my opinion, he should be more like Jhin. Getting movespeed or aspd increases his attack damage, not his actual attack speed. This way, his base attack speed can be altered to be smoother from the get-go and his attacks can be powerful sword-strokes without the unnecessary crit doubling. Yasuo even wields a katana. He really should be more focused on selective killing strokes rather than a death-by-100-cuts style of combat.\n\nNow his Q E and R, I feel are in a better place. Q shouldn't get free cdr for aspd imo, and the tornado shouldn't cc targets with knockups for longer periods than our newly reworked tanks' knockups (sej, mao Qs). On the other hand, it's a skillshot that can be combined with E to perform a different action which is very cool and it's the main damage of his abilities, so the damage from it isn't too big of a deal.\n\nE is limited by enemy presence, so it has a good limiter as it is. The problem is when the passive / W are combined with this insane mobility.. but Wind cannot be tied down. It makes more sense to tweak the passive and W than to adjust his mobility by much.\n\nR is also conditional, and gives Yasuo a blink + cc and teamwork oriented combinations that I feel are good to work with. However, the cooldown is absurdly low and his free armor pen really shouldn't be free. The armor pen should scale with crit (IF crit doubling is removed) or movespeed / aspd.","replies":[]},{"poster":"Wyrmblade","date":"2017-06-17T16:37:06.171+0000","up_votes":2,"down_votes":0,"body":"He is a light fighter. Light fighters have a lot of mobility but aren't supposed to have easy access to the back line, forcing them to kill the tanks and bruisers first. Yasuo circumvents this ultimate makes it easy for him to dive the back line. Possible fixes:\n - Shorter range on tornado.\n - Remove the shield.\n - Reduce the damage and funnel that power somewhere else.\nNote that we can't suddenly consider him a diver or assassin because if he was his E would have to be nuked from orbit.\n\nA large part of Yasuo's power is invisible stat boosts that are impossible to see without reading Yasuo's ability descriptions. His E has a stacking mechanic that I'm pretty sure the vast majority of his players have no idea exists. His ult gives only his critical strikes 50% bonus armor penetration. I don't have a problem with the latter because light fighters should value safely attacking tanks over killing squishies. Possible fixes:\n - Make it more clear what's going on. I'm not sure how to do this though.\n - Remove the need to stack E and just keep a lower base damage. Its primary purpose should be as a dash, not a nuke. The E stacking doesn't add counterplay, just more damage when Yasuo gets to you.\n - Remove the armor pen on the ult and move tank killing power elsewhere on his kit. I like to play tanky champions and I would unironically be okay with his crits dealing some %health damage because it reduces his ability to kill squishies.\nI'm not even going to touch the turret thing. That's disgusting Riot throw it out. If I genuinely have to go into further detail on why that's unacceptable then I should really just uninstall and go play something else.\n\nLate game Yasuo's ultimate has a shorter cooldown than Karma's ultimate. Karma's ultimate is supposed to basically be one of her regular abilities and Yasuo has six seconds on her. (Karma's is 36s late game, Yasuo's is 30s late game.)\n\nThe fucking wind wall. This is the major thing that needs to be looked at. Anyone who doesn't know what's wrong with it at this point is probably a Yasuo main or a closeted Yasuo main. So many possible fixes have already been given. Being able to walk through the windwall isn't counterplay. Yasuo deletes squishies. If you walk through the windwall you are melee with Yasuo or even if he would still lose he can use a dash to get out in many situations. It shouldn't delete ultimates with a 30 second CD. His passive already helps blocking poke so I don't see why this was necessary on his kit in the first place besides making certain champions unable to properly play against Yasuo. Wind wall lasts for 3.75 seconds at rank one. For reference, Azir ultimate has about four times the cooldown and lasts .75 seconds shorter. Braum's shield is the crux of his character and it only reaches the same duration as wind wall at rank four. Basically anything you do that makes this ability worse will make Yasuo more fun to play against. Keep in mind that Yasuo also has a dash for every single minion in a lane to dodge poke too, while also being manaless, so there's never a point where he needs to leave lane if you don't poke him out.\n\nEverything in Yasuo's kit works for Yasuo. He has one dodge-able ability, his tornado, other than that he's just a ball of stats to the people he's playing against. It's not any different from Xin Zhao, it just takes better execution.\n\nAll of this and I've only dipped slightly below the iceberg of this champion's problems. I don't think the small update is going to be enough but I'm glad Riot's giving it a shot. Lee next please.","replies":[]},{"poster":"Shahamut","date":"2017-06-17T14:27:59.018+0000","up_votes":2,"down_votes":0,"body":"Pretty sure Yasuo's most hated ability (and rightfully so imho) is Windwall. I am 100% with people who think it lasts too long... it does. I also think it gets too big. Fix the size, and it's easier to play around. Shorten the duration, and it doesn't lock people out for whole team fights in tight spaces.\n\nHow to go about buffing him is difficult until you fix what's \"annoying\". Windwall is really the only  thing for me. His double crit is his only real damage steroid. If you remove it, you have to compensate in some other way. \n\nPersonally, I think he should still be a crit champion. So he either needs to have increased crit chance or increased crit damage. Double Crit chance is one way, but if you do increased crit damage, he needs a way to access it outside of buying 100% crit chance. This is because he is melee, and as a carry will be relatively squishy.  In any case, crit should be a thing on Yasuo.\n\nHe needs to remain mobile. It's core to his theme. I think adding clarity by showing which targets he has dashed through would be good. I've heard it argued it may clutter the screen, but I'm not sure I agree with that. Yasuo sees it, and we see vitals for Fiora, so we can play around it right? Should be same for Yasuo opponents.\n\nI personally don't think he needs the crit damage reduction ( on q yes, but not on his autos) as it simply makes him deal less crit damage than other crit carries, but from melee, which is inherintley riskier.\n\nHope RIOT succeeds, but I feel like he will be banned in low ELO regardless.","replies":[]},{"poster":"Nightingales Sky","date":"2017-06-16T18:29:10.975+0000","up_votes":2,"down_votes":0,"body":"For me it's his insane ability to catch back up even after having a horrible landing phase. While, most hyper-carriers such as Jax and Vayne require a neutral to strong lane phase to become relevent during grouping or even split pushing; yasou still has the potential to 1v2 and walk out with a double. His biggest issue I see is his item build path. All it takes for him to stomp is one item. That because his kit is so overloaded you don't have worry about a lot of stuff other champs do. \n\nNo need to buy defensive: low CD shield passive plus a wall that negates 100% damage\nNo need to buy mobility: infinite dash \nNo need to buy attack: double Crit plus his high scaling \nNo need to buy leathality: ultimate comes with built in armor pen\n\nThere isn't really a way to tone him into a proper place within league because of the restrictions placed upon other champions while fighting him. For example: if a teammate could interrupt his ultimate charge (let's say Shen could taint Yasou out of his ultimate before even engaging) then yes, Yasou, would be easier to counter while still maintaining a tremendous amount of respect for his damage output. Or, if they chose just one passive, his double crit or shield, this would force players into different build paths depending on their fights. \n\nAlso, change his windwall so it's more punishing if he doesn't put it up in time. If an arrow from Ashe makes it half way through before a windwall is up then he should get stunned. However, if during an ultimate from Miss Fortune and he puts up half way then he should only take damage for half of the time. Another would the sides of the windwall. I have seen arrows from Ashe being blocked even when Yasou puts up on the wrong side. \n\nIn theory when talking about a character like Yasuo he sounds so cool! A ronin samurai looking for revenge who uses the power of the wind to slice his enemies down. So awesome! I would play a stand alone ga,e based off of him. However, when implemented (and remember this was a time when riot was purposely introducing new champions well over powered so they got my play time) it was a disaster. People were sick and tired of new champions coming out wipingnthe floor with their over powered kits. I believe that Yasuo was the tipping the point, wrong place wrong time. I don't think anything will ever change that either. But, if it helps anything, this my two cents.","replies":[]}]}