{"poster":"Vąletõ Jõestąr","date":"2018-06-14T11:22:57.110+0000","title":"¿Qué carajo le pasó al meta?","subforum":"Charlas Generales","up_votes":7,"down_votes":4,"body":"Entre la Taliyah Jungla, la tactica esta de ir mid con un supp y quedarse pegado al jg, los picks raros estos en la LCK, vladimir en la posici&oacute;n de un adc, galio soporte y m&aacute;s cosas locas, qu&eacute; carajo esta pasando con el juego? Todo paso as&iacute; de la nada y ni cuenta me di xD","replies":[{"poster":"fenixerege","date":"2018-06-14T11:46:30.843+0000","up_votes":4,"down_votes":0,"body":"nerf al ADC que sea de late exclusivo\nnerf a los SUPP que para defender basicamente bien tambien llegue sobre el late\ny BUFF a los ultra asesinos y bruisers en early\nhace que solo se quiera jugar champ que les pueden sobrevivir tranquilamente a ese early sin sentir a cada segundo el sobresalto de perder la linea y tirar la partida por la borda\n\ny una vez mas los TANKES se vuelven meta desde hace cuantas seasons jjajajajajajaa\nhasta los objetos que no fueron creados en este meta para ellos les sienta mejor que a los prropios destinatarios jajajjajaj","replies":[{"poster":"Vąletõ Jõestąr","date":"2018-06-14T11:48:51.333+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MarkoPollo,realm=LAS,application-id=v7qsfXsE,discussion-id=NEFl8Zfy,comment-id=0001,timestamp=2018-06-14T11:46:30.843+0000)\n>\n> nerf al ADC que sea de late exclusivo\n> nerf a los SUPP que para defender basicamente bien tambien llegue sobre el late\n> y BUFF a los ultra asesinos y bruisers en early\n> hace que solo se quiera jugar champ que les pueden sobrevivir tranquilamente a ese early sin sentir a cada segundo el sobresalto de perder la linea y tirar la partida por la borda\n> \n> y una vez mas los TANKES se vuelven meta desde hace cuantas seasons jjajajajajajaa\n> hasta los objetos que no fueron creados en este meta para ellos les sienta mejor que a los prropios destinatarios jajajjajaj\n\nPara mi gusto se está volviendo cada vez una mierd@ el juego, ya ni ganas te dan de jugar con todas estas cosas.","replies":[]}]},{"poster":"Carpaccio","date":"2018-06-14T11:33:12.810+0000","up_votes":3,"down_votes":0,"body":"Te falto que:\n{{champion:63}}  ADC\nYa no se llevan Soportes como {{champion:37}} ,{{champion:432}} o {{champion:40}} por solo decir 3 ejemplos.\n-\nCuando jugaba en el 2016 se popularizo el Ziggs APC y hoy en dia volvio pero sin los soportes de Utilidad,solo los Tankes o Daño({{champion:89}} y {{champion:143}} por ejemplo)\nY volvimos debido al Nerf a los ADC y Supp y sus Items como {{item:3114}}","replies":[{"poster":"Vąletõ Jõestąr","date":"2018-06-14T11:49:12.738+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KaseO231,realm=LAS,application-id=v7qsfXsE,discussion-id=NEFl8Zfy,comment-id=0000,timestamp=2018-06-14T11:33:12.810+0000)\n>\n> Te falto que:\n> {{champion:63}}  ADC\n> Ya no se llevan Soportes como {{champion:37}} ,{{champion:432}} o {{champion:40}} por solo decir 3 ejemplos.\n> -\n> Cuando jugaba en el 2016 se popularizo el Ziggs APC y hoy en dia volvio pero sin los soportes de Utilidad,solo los Tankes o Daño({{champion:89}} y {{champion:143}} por ejemplo)\n> Y volvimos debido al Nerf a los ADC y Supp y sus Items como {{item:3114}}\n\nAlto quilombo se armó","replies":[]}]},{"poster":"Casel2","date":"2018-06-14T13:16:37.875+0000","up_votes":2,"down_votes":0,"body":"Riot quiere que cualquier campeon pueda jugar cualquier linea, porque por ejemplo a mi me gusta muchisimo {{champion:203}}  pero no me gusta el rol de JG, y como yo deben haber muchos mas, entonces Riot solo quiere que cualquier campeon se pueda jugar en cualquier linea, es solo eso. Si, los tiradores ahora estan en la mierda total pero lo iran ajustando hasta que esten balanceados masomenos con el resto de campeones, provocando que quizas te convenga ir Jinx mid por ejemplo o Ahri adc\nNunca se dijo que el rol de adc deba ser exclusivamente de los tiradores, de hecho los roles los crearon los propios jugadores, Riot los dividio por luchadores, tiradores, asesinos, soportes y demas, nunca por adc, top, mid, etc\nHace rato quieren hacer esto y estan testeando, pasa que ahora añadieron un problema mas a la sopa que son las runas, y balancear tantas cosas es complicado y llevara tiempo, pero el juego quedara genial...jugaras el campeon que quieras, cuando quieras, donde quieras y contra quien quieras segun tu conveniencia claro esta\nEl problema es que la gente teme al cambio y a lo que pueda llegar a pasar, miedo a la nuevo, entonces rechazan toda propuesta de Riot, es como paso con las nuevas runas, todos llorando el primer dia diciendo que estaba super roto y demas, y ahora estan todos contentos con las runas, esto va a ser lo mismo...eso pasa cuando tenes una comunidad de nenes y adolescentes, lloran y se quejan por todo","replies":[]},{"poster":"DIOS TUTI","date":"2018-06-14T11:52:29.103+0000","up_votes":2,"down_votes":0,"body":"es cualquier cosa el meta actualmente.\n\nla jungla con factor random\nla botlane con picks random\nla mejor estrategia en mid, es sacar un support y supportear al jungla.\nadcarrys en la jungla, supporteados por el mid support.","replies":[]},{"poster":"Runth","date":"2018-06-15T08:36:26.234+0000","up_votes":1,"down_votes":0,"body":"el meta de ahora se volvio mas subsecuente de libre de elegir q rol vas a ir , ya el impacto de daño ya no es viable en ganar partidas sino en ganar las TF\n\nsi no eliges el mid correcto, es comer una derrota seguro o ganas porque el rival es poca habilidad q tu\n\nel duo bot murio , ahora el soporte es libre de elegir q linea tendra q ayudar, o sea ya no es una ñinera del carry al menos q tu carreas para el equipo y el te dara peel cuando pueda\n\nlos escudos nerfeados bien merecidos, ya tuvieron muchas temporadas con el, gg jannita free elo, a jugar bien o dejarla en la banca\n\nel carry puede ser cualquier champ offtank que sea en meta, si elige el erroneo, comeras un tilteo\n\nlos adc usan tp porque el objetivo es farmear y pushear hasta q te maten o sobrevivas para tirar objetivos, o sea , eres el oro del rival asi q compra sentrys\n\ntaly jg sirve como dijeron ustedes, no sera necesario y karthus soporte es viejo eso pero sin el estandarte es un contra pick para los soportes ap, aun sigue efectivo el suicida karthus \n\nlos tanques siguen triunfando el meta, imaginen un urgot adc, pega casi el mismo daño q graves si lo usas bien , imaginen renek letalidad\n\nasi q chicos , cantar lineas dejo de existir","replies":[]},{"poster":"Nabuze","date":"2018-06-14T17:10:13.248+0000","up_votes":1,"down_votes":0,"body":"A riot le gusta la variedad que hay en bot pero ya está trabajando en cosas que no le gusta como el gold funneling que es la estrategia de taric yi o nunu y karthus.\nTambién va a darle un buffo a algunos adc de criticos.\n\nQuieren tratar de mantener la variedad en bot y que no sea tan estática la composición.\nLas partidas profesionales dicen que se volvieron mucho más interesantes de ver pero para los demás como nosotros siendo realistas no ocupamos esos picks raros, muy pocas personas en cada region los están pickeando según el mmr de riot.\n\nEl rol de la botlane es inferior/\n (bot) y soporte (supp), no es \"adc\" no entiendo los que dicen ayndra o vladimir adc cuando estos se arman ap, en cuyo caso apc mínimo xD","replies":[]},{"poster":"Sir Crucifix ","date":"2018-06-14T16:45:06.102+0000","up_votes":1,"down_votes":0,"body":"Jugue adc y me fue horrible , sacaron el filo infinito","replies":[]},{"poster":"zatfort","date":"2018-06-14T16:06:11.782+0000","up_votes":1,"down_votes":0,"body":"antes de poner las runas dijeron q mas tarde se podria jugar sin adc ajajajaja ya lo cumplieron  \n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"asdmaskldmnkfl","date":"2018-06-14T15:43:26.962+0000","up_votes":1,"down_votes":0,"body":"Vamos a empezar a enumerar los cambios que llevaron a esto (en mi opinion los mejores cambios que le han hecho al lol desde que juego, pre season 4, excepto por lo del cangrejo random)\n\n1.- Se cambio el cangrejo y la experiencia de la jungla, ahora no existe ruta que te de nivel 3 al hacer 3 campamentos. Dio surgimiento del meta de los junglas de nivel 2 y eso hace a taliyah tan fuerte. Tambien el efecto snowball que genera esto es muy fuerte ya que los laners que pueden presionar su linea se vuelven muy fuertes.\n\n2.- Cambio a los items y estadísticas de los marksman (tiradores). Subieron el coste de los objetos y cambiaron sus estadisticas. Que provoco esto, que los adc de critico desaparecieran del mapa  y se pudiera jugar solo 4 tiradores kaisa, lucian, ezreal y xayah. Ademas se dejo de usar health y paso a llevarse tp (presion de linea y nerf del health)\n\n3.- Los chinos comenzaron a utilizar el master yi con taric en mid  y se comenzaron a inventar nuevos duos mid que estan rompiendo ortos en el juego. \n\nEntonces en conclusion el meta se volvio hermoso y caotico y dejaremos de ver partidas de 4 horas por partidas cortas y muchos kills\n\nSaludos","replies":[]},{"poster":"xaxesis","date":"2018-06-14T15:18:57.880+0000","up_votes":1,"down_votes":0,"body":"desde hace tiempo ir con cualquier campeon es cualquier posicion es normal y no es sancionado asi el juego se vuelve mas divertido","replies":[]},{"poster":"Winter Lion","date":"2018-06-14T14:00:49.507+0000","up_votes":1,"down_votes":0,"body":"te olvidaste que ahora en bot ya no se usan adcs, se usan off tanks","replies":[]},{"poster":"The Cricket","date":"2018-06-14T12:29:52.139+0000","up_votes":1,"down_votes":0,"body":"Tranquilo, para mi quieren llevar el juego a otro lado y no pueden simplemente decirte ''hola valet0 para el parche 8.12 hicimos 60 ajustes a campeones xd que lo disfrutes'' entonces van cambiando de a poco y provocan que pasen cosas como esta. Yo que vos seguiria en la linea que ibas antes que en algun momento se acomodara","replies":[]},{"poster":"LightrayAvatar","date":"2018-06-14T12:01:18.700+0000","up_votes":2,"down_votes":3,"body":"Cambia, se adapta… evoluciona.","replies":[]}]}