{"poster":"OgSc","date":"2018-11-23T19:54:27.216+0000","title":"How did Humans & The Vastayashai're felt when the two races were uh..'mixing' w each other?","subforum":"Story, Art, & Sound","up_votes":2,"down_votes":0,"body":"Did both races not care about the mixing that created the Vastaya? Was their disdain for Human and Vastayashai&#039;rei relationships? At first? Always? Were vastayans considered low born, compared to their Human and Vasayashai&#039;rei parents? Was it outlawed?","replies":[{"poster":"KestrelGirl","date":"2018-11-23T20:12:51.356+0000","up_votes":4,"down_votes":0,"body":"I wouldn't be shocked if it was necessary for the survival of both races, so any debate had to be put aside. This was, after all, a very long time ago.","replies":[{"poster":"OgSc","date":"2018-11-23T23:19:50.772+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KestrelGirl,realm=NA,application-id=6kFXY1kR,discussion-id=fk5o2RbE,comment-id=0000,timestamp=2018-11-23T20:12:51.356+0000)\n>\n> I wouldn&#x27;t be shocked if it was necessary for the survival of both races, so any debate had to be put aside. This was, after all, a very long time ago.\n\nMakes sense.","replies":[]}]},{"poster":"Umbral Regent","date":"2018-11-23T21:45:30.049+0000","up_votes":3,"down_votes":0,"body":"Considering the Vastayashai'rei were pretty well in-tune with the spiritual world, and from what we know about the Oovi-Kat (the apparent closest descendants to the Vastayashai'rei in present-day Runeterra), one could probably assume that the Vastayashai'rei would have been more than okay - even pleased - with the union with humankind and resultant half-breeds.\n\nOn the human side, though, there would probably be mixed opinions about getting in with the Vastayashai'rei (starting to wish there was a halfway decent shorthand). Unless they were something like the pre-Noxus Ionians (one with nature/magic, pretty generous worldview) or the pre-Ruination Blessed Isles (wisened, good depth of knowledge, probably could see the benefit even if opposed), it's hard to imagine there wouldn't be a little conflict from humans regarding mixing with the Vastayashai'rei.\n\nBut, these are just my assumptions, so do take them with a mountain of salt.","replies":[{"poster":"OgSc","date":"2018-11-23T23:20:26.103+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=6kFXY1kR,discussion-id=fk5o2RbE,comment-id=0001,timestamp=2018-11-23T21:45:30.049+0000)\n>\n> Considering the Vastayashai&#x27;rei were pretty well in-tune with the spiritual world, and from what we know about the Oovi-Kat (the apparent closest descendants to the Vastayashai&#x27;rei in present-day Runeterra), one could probably assume that the Vastayashai&#x27;rei would have been more than okay - even pleased - with the union with humankind and resultant half-breeds.\n> \n> On the human side, though, there would probably be mixed opinions about getting in with the Vastayashai&#x27;rei (starting to wish there was a halfway decent shorthand). Unless they were something like the pre-Noxus Ionians (one with nature/magic, pretty generous worldview) or the pre-Ruination Blessed Isles (wisened, good depth of knowledge, probably could see the benefit even if opposed), it&#x27;s hard to imagine there wouldn&#x27;t be a little conflict from humans regarding mixing with the Vastayashai&#x27;rei.\n> \n> But, these are just my assumptions, so do take them with a mountain of salt.\n\nAh, thats pretty interesting.","replies":[]}]},{"poster":"Criomhthann","date":"2018-11-25T04:16:19.416+0000","up_votes":2,"down_votes":1,"body":"I would imagine they felt pretty good when they were \"mixing.\" ( ͡° ͜ʖ ͡°)\n\nSeriously? People like to fuck; there doesn't need to be a grand conspiracy about fucking.","replies":[]},{"poster":"KFCeytron","date":"2018-11-24T07:58:35.520+0000","up_votes":2,"down_votes":1,"body":"How did they feel when \"uh... mixing\"? Horny, probably. Just a guess.","replies":[]},{"poster":"SEKAI","date":"2018-11-24T08:03:25.474+0000","up_votes":1,"down_votes":0,"body":"Maybe because the concept of race and other terms that divide people based on innate factors were not a thing so they just got along together; where at most people were divided by their respective tribe they swore to, rather than their skin colour and whatnot.\n\nOur ancient ancestors didn't care much about race and whatever in those very ancient days too.","replies":[]},{"poster":"mrmeddyman","date":"2018-11-24T07:35:11.490+0000","up_votes":1,"down_votes":2,"body":"I like an explanation where the Vastayashay'rei and Humans happily got along and copulated and the resulting over-zealous Vastaya namely ({{champion:498}}), bought into a false narrative where the humans oppressed the Vastayashai'rei  so that she could feel vindicated in being a victim","replies":[]}]}