{"poster":"Kurokami Sora","date":"2018-01-31T08:57:23.028+0000","title":"Plat+ ADC und Jungle gesucht für ein Team.","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"An den Jungle: Der gegnerische Jungle ist dein 2. Zuhause, du liebst es zu wissen was der Gegner in seinem Jungle tut und suchst Mates die dich dabei unterst&uuml;tzen w&uuml;rden? Dann bist du hier genau richtig. Du beherrscht Tanks und Dmgdealer (zumindest von beiden Sorten ein paar) und hast Lust auf ein Team was zusammen wachsen will? OTP werden leider nicht gesucht, wobei Teamerfahrung nicht allzugro&szlig; geschrieben wird ( Anpassungsf&auml;higkeit dabei vorrausgesetzt). Damit es funktioniert sollte eine gewisse Reife vorhanden sein, das Alter sollte 17+ sein da der Rest &uuml;20 ist. F&uuml;r mehr Infos und Risiken Added mich einfach.\r\n\r\nUnd nun zu der zuk&uuml;nftigen Person die gerne die &quot;Faust ins Gesicht&quot; Rolle &uuml;bernehmen m&ouml;chte. Da das Team im Aufbau ist suchen wir auch einen ADC der lieber die Lane dominiert und sp&auml;ter &quot;bis zur Unendlichkeit und noch viel weiter&quot; skaliert. Wie du bereits schon oben vielleicht gelesen hast, soll ein Jungler kommen der deine Aggressivit&auml;t unsterst&uuml;tzt und auch deine Tode wegb&uuml;gelt (nur wenns sein muss :D). Dir sollte Positioning, Kiting (und Killsteal) kein Fremdwort sein :P. Du bist Anpassungsf&auml;hig, 17+ und hast Lust mit deinem Team zu wachsen? Dann Meld dich bei mir. Also High Plat in Soloq(S7) sollte schon erreicht worden sein. F&uuml;r Leute die h&ouml;here Elo Spielen und dennoch Interesse haben ( Warum auch immer :D). Eine Gewisse Geduld sollte dann vorhanden sein, aber keine Sorge die Geduld wird nicht &quot;bis zur Unendlichkeit und noch viel weiter&quot; gestretched. \r\n\r\nP.S: Turniere, Scrims, als auch Orgabeitritt werden geplant sein, aber erst ab einem bestimmten Level. ( Soll ja nicht allzupeinlich werden).\r\n\r\nF&uuml;r beide Rollen zum Adden\r\nKurokami Sora","replies":[]}