{"poster":"SayaShire","date":"2019-09-15T18:44:29.605+0000","title":"Runen besser verstehen...","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leuts! \r\n\r\nIch habe ein Problem damit, mir zu merken, welche Runen nochmal für welches Matchup genommen werden. \r\nSpeziell geht es um **AUFSCHWUNG und KNOCHENPANZERUNG**. \r\nEines davon nehme ich, wenn ich immer mal wieder Schaden bekomme, und eins, wenn ich ständig Schaden kriege - so in etwa weiß ichs noch. \r\nAber welches war nun welches? \r\n\r\nIch versuche mir das so zu merken, dass manche eben schnell angreifen, wie z.B. ein Garen mit seinem Spin, und einem ... hm, was Passives, was nicht andauernd Schaden macht, sagen wir einfach mal Rammus. \r\n\r\nD.h. für die Schnell-Angreifer würde ich eigentlich gern Aufschwung mitnehmen, weil ich dadurch Leben zurück bekomme, und bei hin und wieder mal Dmg die Knochenpanzerung.\r\n\r\nNur ist jetzt die Frage, ob das auch so richtig war.... \r\n\r\nEin ganz ähnliches Problem habe ich auch mit **FOKUSSIERTER ANGRIFF und EROBERER. **\r\n\r\nIch verstehe z.B. nicht, wieso ich mit Renekton bei Garen Eroberer mitnehmen soll, bei Urgot aber Fokussierter Angriff. \r\nBeides sind doch Tanks, die recht schwer klein zu kriegen sind....\r\n\r\nKönnt mir das evtl jemand nochmal erklären, dass man sich das auch merken kann?\r\n\r\n[Ein Link zum Bild, wie die Runen beschrieben werden](https://share-your-photo.com/8c731dafb7)","replies":[{"poster":"Enderized","date":"2019-09-15T19:09:38.707+0000","up_votes":2,"down_votes":0,"body":"Wenn \"Aufschwung\" = \"Second Wind\" (ich kenne die deutschen Übersetzungen nicht), dann nimmst du dieses insbesondere in Poke-lastigen oder DoT-lastigen (insbesondere gegen DoTs, weil jede Sekunde DoT deine Regen aufrecht erhält) Matchups mit (zB gegen Teemo)\n\nKnockenpanzerung/Boneplating eher gegen All-In lastige Damagequellen zB. gegen einen Renektonm Jax oder Garen welche zwischendrin in der Lane auf dich rennen, ihre CDs bursten und wieder farmen gehen.\n\n---\n\nConqueror vs Fokussierter Angriff\n\nKurz gesagt: Spielst du einen Melee Bruiser ist Conqueror grundsätzlich nie verkehrt.\nIch weiß nicht woher du genau deine \"Gegen XY die Rune\" Informationen nimmst (ich hoffe nicht von Pro-Builds, denn Runenwahl ist nicht nur Lanematchup sondern Gamematchup orientiert) ... aber folgendes:\n\nDu nimmst Conqueror auf Renekton mit gegen Garen, da du gegen Garen lange in fights bleiben möchtest.\nDu möchtest Conqueror aufbauen und von dem Truedamage und zusätzlich Sustain samt AD profitieren. Garen selbst kann nur Q E und dann wegrennen.\n\nBei Urgot sieht das ganze schon ein bisschen anders aus. Denn im Gegensatz zu Garen, möchte auch Urgot möglichst lange im Kampf sein und wenn Urgot entweder selbst Conqueror mitnimmt während du ihn engagest (er kann mit richtigem Timing während deinem Stun wunderbar seine E benutzen um dich zu stunnen und überzuwerfen) kann er via seines W dauerfeuers wunderbar Conqueror stacken und dir insbesondere mit seiner Passive einiges an Schaden zufügen.\nSelbst wenn Urgot anstelle von Conq., Fok. Angriff mitnimmt, kann der Burst von PtA und dem 8-12% Damage Increase auf seiner %MaxHP Passive richtig weh tun.\n\nDein Ziel ist es also auf Renekton gegen Urgot, Urgot immer wieder in kurze Fights zu verwickeln, die halt nicht Urgots stärken sind und wieder zu verschwinden. In dem Sinne, lieber Fokussierter Angriff.","replies":[{"poster":"SayaShire","date":"2019-09-15T20:01:03.062+0000","up_votes":1,"down_votes":0,"body":"WOW! Sehr herzlichen Dank für diese tolle Erklärung. \nDann weiß ich jetzt auch wo der Fehler mit Garen liegt. Da flutsche ich nur kurz rein, mach AA-W-AA-Q und flutsche wieder raus, weil ich dann entweder gesilenced werde, oder er sein Spin to win anschmeißt und ich dem Schaden ausweiche. \n\nAlso sollte ich den einfach aushalten mit Renekton, damit ich den True Dmg bekomme? \nWäre es dann nicht sinnvoll, meinen Stun gleichermaßen zu leveln, statt erst Q und dann E, wenns kein Q zu leveln gibt? \nWenn ich lange in Fights sein will, wäre es ja besser, wenn ich nen zweiten Stun up habe...","replies":[{"poster":"Enderized","date":"2019-09-15T21:13:26.507+0000","up_votes":2,"down_votes":0,"body":"Du möchtest gegen Garen und seine vergleichsweisen hohen Resistenzwerte eigentlich immer den Truedamage haben.\nDer Stun hierbei ist nebensächlich, den kann Garen mit gezielter Nutzung seiner W erheblich reduzieren.\n\nWichtig ist das Timing deines Engages gegen Garen. Wenn Garen seine Q genutzt hat um zB nen Canon zu last hitten oder auch seine E zum pushen kannst du ihn jedes mal Problemlos engagen und outdamagest ihn.\n\nDie empowerte E als Armorshred zu nutzen ist ebenfalls entscheident um Trades gegen Garen effizient zu gewinnen x)","replies":[{"poster":"SayaShire","date":"2019-09-16T10:35:29.940+0000","up_votes":1,"down_votes":0,"body":"Kennst du dich mit Renekton aus? Wie würde dein Kampf mit einem Garen ablaufen? Reinschrauben, die typische Combo machen und wieder raus? Oder drauf verzichten, dass du nochmal schrauben könntest und dafür weiterkämpfen und Flash nutzen?","replies":[{"poster":"Enderized","date":"2019-09-16T11:02:47.259+0000","up_votes":1,"down_votes":0,"body":"Ich habe Renekton zwar immerhin Stufe 5... spiele ihn aber dennoch nicht häufig genug um dir spezifische Tipps geben zu können wie du dich in jeder Situation zu verhalten hast, tut mir leid :x","replies":[{"poster":"SayaShire","date":"2019-09-16T11:06:21.706+0000","up_votes":1,"down_votes":0,"body":"Bist du dann ein Garen? XD","replies":[{"poster":"Enderized","date":"2019-09-16T12:37:17.597+0000","up_votes":2,"down_votes":0,"body":"Ich bin eher so der Urgot unter den Toplanern-\n\nDa ich aber Top auch nur Second-Role spiele... \n\nIch bin eigl. Support Main x)","replies":[]}]}]}]}]}]}]},{"poster":"Kartoffelsuppe","date":"2019-09-17T17:34:46.225+0000","up_votes":1,"down_votes":0,"body":"Nimm halt nur eine Runenseite und änder sie nicht dann hast du das Problem nicht.","replies":[{"poster":"Angel Ayume","date":"2019-09-17T21:50:09.121+0000","up_votes":1,"down_votes":0,"body":"Spielste auch auf allen Champs in jedem Matchup dieselben Runen? \nNicht? Dann gib nicht so nen schwachsinnigen Tipp....","replies":[]}]}]}