{"poster":"One Eyed Øwl","date":"2017-02-10T08:27:33.234+0000","title":"Sich selbst muten... eine Lösung?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":3,"body":"Hey Leute,\r\nmir ist da gerade was in den Sinn gekommen.\r\n\r\nEs gibt einige Leute, die vor allem in einem anonymen Raum wie LoL ihre Aggressionen und ihren Frust nur schwer im Zaum halten k&ouml;nnen, kurz bekannt als Flamer.\r\n\r\nWas w&auml;re nun, wenn diese Leute sich selbst muten k&ouml;nnten? Hei&szlig;t, dass sie in den Chat schreiben k&ouml;nnen, um somit ihren Flame loszuwerden, jedoch werden ihre Nachrichten von keinem Spieler im Game mehr gesehen. So k&ouml;nnten sie ihren Frust loswerden, aber w&uuml;rden damit niemand anderem schaden.\r\n\r\nZur Sicherheit, damit diese Funktion nicht aus Versehen aktiv ist, k&ouml;nnte alle paar Minuten ein Disclaimer im Chat erscheinen, der besagt dass andere die eigenen Nachrichten nicht einsehen k&ouml;nnen.\r\n\r\nMeinungen? Verbesserungsvorschl&auml;ge f&uuml;r dieses Modell? Lasst mich es wissen.\r\n\r\n\r\nLG,\r\nOwl","replies":[{"poster":"Humpelstilzche","date":"2017-02-10T08:42:52.086+0000","up_votes":10,"down_votes":0,"body":"Das wird regelmäßig vorgeschlagen, vor allem von den Flamern selbst.\n\nDas Problem an der Idee ist, dass es das eigentliche Problem nicht bekämpft, nämlich die Aggressionen der Spieler. Das grundlegende Problem an Flamern ist, dass sie andere Spieler flamen WOLLEN. Wenn sie wissen dass sie sich selbst gemutet haben, verschafft ihnen das Tippen von Beleidigungen keine Befriedigung, denn es geht nicht um das Tippen, es geht darum andere Leute zu beleidigen. Dementsprechend werden sie sich andere Methoden suchen, es ihren Mitspielern heimzuzahlen, z.B. absichtlich feeden oder afk gehen. \n\nSelf-Mute unterdrückt lediglich ein Symptom aggressiven Verhaltens, hilft aber in keinster Weise dabei das zugrundeliegende Problem zu beheben. Sicher, self-Mute würde vermutlich Flaming verringern...aber es würde Toxicity nicht verringern, sondern lediglich die Form ändern, durch die die Aggressionen der Spieler ausgedrückt werden. \n\nDas ist btw nicht nur graue Theorie, sondern das ist tatsächlich passiert. Vor einigen Jahren hat Riot mit sehr langen Chat-Restrictions experimentiert, d.h. Chat-Restrictions über teilweise mehr als 1000 Spiele, also quasi-permanente Chatsperren. Das Ergebnis war genau das, was ich oben beschrieben habe. Diese Spieler haben nicht etwa aufgehört toxic zu sein, sie haben lediglich die Art und Weise gewechselt, wie sie toxic sind. \nAls zusätzliche Problematik kommt noch dazu, dass intentionally feeding oder trolling viel schwerer eindeutig nachzuweisen ist als Flaming...d.h. wenn man Spieler dazu ermutig von Flaming auf andere Formen der Toxicity zu wechseln, hilft man ihnen quasi dabei nicht bestraft zu werden, obwohl sie genauso asozial sind wie vorher. \n\nUnd, last but not least, kommt noch dazu dass Selbst-Mute den Flamern die Motivation nimmt, sich tatsächlich zu ändern. Wozu umständlich an meinem Aggressions-Problem arbeiten wenn ich mein Flaming auch einfach unterdrücken kann ohne etwas gegen mein Verhaltensproblem zu tun? \nLangfristig ist sehr problematisch, man liefert Flamern einen Ausweg nicht gebannt zu werden, auch ohne dass sie sich ändern. Das sendet ein falsches Signal.","replies":[{"poster":"One Eyed Øwl","date":"2017-02-10T10:43:05.206+0000","up_votes":1,"down_votes":5,"body":"Riot ist nicht für Erziehung oder Therapie zuständig, sondern für Resultate. Resultate, die definitiv generiert werden könnten.","replies":[{"poster":"Humpelstilzche","date":"2017-02-10T12:03:38.876+0000","up_votes":3,"down_votes":0,"body":"> Riot ist nicht für Erziehung oder Therapie zuständig, sondern für Resultate.\n\nBlöderweise sind diese Dinge aber durchaus verknüpft. Denn Spieler die nicht lernen sich zu benehmen, tun das nicht. Dementsprechend muss Riot wohl oder übel in die Rolle des Erziehers/Lehrers schlüpfen um irgendeinen Einfluss auf die Resultate zu haben. Resultate kann man nicht herzaubern, man muss Probleme identifizieren und effiziente Lösungen dafür finden. Und im Fall von Spielerverhalten ist das nunmal dummerweise die Einflussnahme auf das Verhalten von Menschen, sprich: Erziehung.\n\nDu machst es dir sehr einfach wenn du einfach Resultate forderst. Das ist wie Leute die Weltfrieden fordern und dann denken sie hätten damit der Welt einen Gefallen getan. Das ist aber nicht so, denn die Herausforderung ist nicht die Ziele zu definieren (z.B. Weltfrieden oder ein flame-freies LoL), sondern Methoden zu finden mit denen man das tatsächlich erreichen kann....und dieser Teil ist halt leider weitaus komplexer. ","replies":[{"poster":"Talon ADC","date":"2017-03-12T14:44:21.497+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Humpelstilzche","date":"2017-03-12T17:31:03.242+0000","up_votes":2,"down_votes":0,"body":"Aus purer Neugierde: Warum antwortest du auf einen über 1 Monat alten Post?\nMissversteh das nicht als Vorwurf oder so. Mich wundert es einfach nur, wie man überhaupt dazu kommt, da du ja weder an der Diskussion beteiligt warst, noch der Post in den aktullen Foren-Beiträgen angezeigt wird. Wie stößt man auf so einen alten Thread?","replies":[{"poster":"Talon ADC","date":"2017-03-12T20:01:26.993+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Humpelstilzche","date":"2017-03-12T20:31:14.774+0000","up_votes":2,"down_votes":0,"body":"D.h. du bist der TE? Das würde dann aber ja bedeutet, dass du einen Monat brauchst um auf Antworten in deinem eigenen Thread zu reagieren. Naja, wie dem auch sei, danke für die Auskunft und schönes Rest-WE noch.","replies":[]}]}]}]},{"poster":"One Eyed Øwl","date":"2017-02-10T13:27:13.942+0000","up_votes":1,"down_votes":2,"body":"Trotzdem wäre das Resultat summa summarum weniger Flame. Und das ist für den durchschnittlichen Spieler mehr Wert, als dass ein paar spezielle Individuen Benimmregeln verinnerlichen. Ein einfacher und schneller Weg, um Flame effektiv zu verringern.\n\nUnd bezüglich der These, dass die Geflamten den Flame unbedingt lesen sollen: Nein. Die meisten Flamer wollen nicht die Person hinter dem Nickname persönlich attackieren, sie suchen nur ein Ventil um ihren Frust abzulassen, oftmals auch über eigene Fehler.","replies":[{"poster":"Humpelstilzche","date":"2017-02-10T14:02:51.358+0000","up_votes":2,"down_votes":0,"body":"> Trotzdem wäre das Resultat summa summarum weniger Flame.\n\nDas stimmt. Gleichzeitig gäbe es aber sehr viel mehr absichtliches Feeding und Trolling...Vergehen die weitaus mehr Impact haben und deutlich schwieriger zu ahnden sind. Es bringt nichts Pest durch Cholera zu ersetzen. \n\n> Und bezüglich der These, dass die Geflamten den Flame unbedingt lesen sollen: Nein. Die meisten Flamer wollen nicht die Person hinter dem Nickname persönlich attackieren, sie suchen nur ein Ventil um ihren Frust abzulassen, oftmals auch über eigene Fehler.\n\nWäre dem so, würden die Leute einfach ihren Bildschirm anschreien und außerdem ihre Muttersprache verwenden. Tun sie aber nicht. Sie verwenden den Chat und schreiben in Englisch, obwohl beides deutlich aufwändiger ist als den Bildschirm anzufluchen. Das ist ein ziemlich eindeutiger Beleg dafür, dass sie sehr wohl Wert darauf legen, dass ihre Beleidigungen gelesen und verstanden werden.","replies":[{"poster":"One Eyed Øwl","date":"2017-02-10T17:08:29.173+0000","up_votes":1,"down_votes":0,"body":"> Das stimmt. Gleichzeitig gäbe es aber sehr viel mehr absichtliches Feeding und Trolling...Vergehen die weitaus mehr Impact haben und deutlich schwieriger zu ahnden sind. Es bringt nichts Pest durch Cholera zu ersetzen.\n\nWie ist da bitte ein Zusammenhang? Erklär mir das bitte. Es geht hier um eine **freiwillige** Option, sich selbst zu muten. Warum würde man denn dann mit trollen und feeden anfangen?\n\n> Wäre dem so, würden die Leute einfach ihren Bildschirm anschreien und außerdem ihre Muttersprache verwenden. Tun sie aber nicht. Sie verwenden den Chat und schreiben in Englisch, obwohl beides deutlich aufwändiger ist als den Bildschirm anzufluchen. Das ist ein ziemlich eindeutiger Beleg dafür, dass sie sehr wohl Wert darauf legen, dass ihre Beleidigungen gelesen und verstanden werden.\n\nSelbst wenn es 80% wären, so wären es doch 20% die eben nicht mehr ihren Teammates auf den Zeiger gehen. Wäre es das nicht wert?","replies":[{"poster":"Humpelstilzche","date":"2017-02-11T08:57:16.789+0000","up_votes":2,"down_votes":0,"body":"> Wie ist da bitte ein Zusammenhang?\n\nDas hab ich doch im allerersten Kommentar schon erklärt. \n\n>  Wäre es das nicht wert?\n\nAuch das hab ich doch oben schon erklärt. Es geht nicht nur darum dass es manchen vlt nicht hilft, sondern dass manche Leute die sonst gezwungen wären an sich zu arbeiten dies jetzt nicht mehr tun.","replies":[]}]}]}]}]},{"poster":"5weeds","date":"2017-02-10T10:55:03.117+0000","up_votes":1,"down_votes":0,"body":"Klar ist es nicht Riots Job sich um die \"Erziehung\" ihrer Spieler zu kümmern, schließlich können sie einfach alle bannen, die nicht Spuren.\n\nAber das verstößt gegen Riots Prinzipien.\nRiot teilt deswegen auch nicht gleich mit dem 5 kg Permabanvorschlaghammer aus, sondern gibt den Spielern bei Fehlverhalten, meist noch eine Chance.\n\nJeder Spieler kann sich ändern, aber dazu müssen sie einsehen, dass ihr Verhalten falsch ist und du glaubst gar nicht wie viele Spieler das Flamen abgelegt haben.\n\nRiot will die Leute dafür belohnen, mit dem Flamen aufzuhören und ihnen einen Ansporn geben sich zu bessern.","replies":[]}]}]},{"poster":"WukongCookie","date":"2017-02-13T01:19:30.759+0000","up_votes":2,"down_votes":0,"body":"Das ganze wäre sehr viel einfacher zu lösen indem Riot Spielern erlaubt den Chat abzuschalten. Das kann man bei jedem beliebigen Patch mit einbauen und würde immens das Spielgeschehen verbessern. \n\nMan braucht ingame nur Smartpings und Spielverständnis. Sobald du schreibst verlierst du Zeit die dich entweder farm, objectives, kills usw kostet. \n\nWenn Riot das endlich mal begreifen würde gäbs ne menge Probleme weniger. \n\nUnd bevor man mir wieder mit xyz Argumenten kommt. Nein. Wenn ich den Chat ausmachen kann brauch ich das geseire von keinem Flamer lesen und kann auch nicht selber Flamen. Alles was ich sehen kann sind pings. \n\nWer chatten will soll zurück in die 90er in einen der Chatrooms von damals. Hier gehts ums Game und nicht ums geschnatter ingame.","replies":[]},{"poster":"OrangeBubble","date":"2017-02-11T15:09:55.270+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich wirklich mad bin, schreib ich es in die Zeile .... denke kurz darüber nach, ob es sich lohnt... und drücke Enter oder Esc. Ich drücke zu 95% Esc, weil es sich im Endeeffkt doch nicht lohnt. Enter drücke ich nur, wenn es mir letzt endlich egal ist, ob es sich lohne oder nicht u.u\n\nIch denke, die Leute, die wirklich regelmäßig flamen, werden die Funktion vielleicht am Anfang benutzen, aber dann werden sie merken, sie bekommen keine Befriedigung und werden es wieder ausschalten und regulär flamen .... Ging es nur darum, es einmal aufzuschreiben ... Dann gäbe es ja die Esc taste ...","replies":[]},{"poster":"Homunculi","date":"2017-02-10T08:42:08.898+0000","up_votes":1,"down_votes":0,"body":"Ein paar Programmierbare Tastaturen, können per Spielprofil auch darauf programmiert werden, dass gewisse Tasten nicht mehr funktionieren, so z.B. die Entertaste.\n\nDas nächste Problem ist das was 5weeds schon schrieb, die Flamer möchten ja schreiben, es gibt nur sehr wenige (subjektive Ansicht) die so eine Funktion, wie Du sie beschreibst nutzen würden. Wenn sie schon wissen, dass sie etwas emotional unf/oder temperamentvoll an den Chat gehen, können sich auch eine Mausefalle oder Reiszwecken auf die Entertaste bappen, damit sie sich selbst bestrafen sollten sie versuchen den Chat zu benutzen :).","replies":[{"poster":"5weeds","date":"2017-02-10T08:57:59.809+0000","up_votes":1,"down_votes":0,"body":"Autsch xD\nSoll aber auch Leute geben die drauf stehen.\nNaja, jedem seins ^^","replies":[]}]},{"poster":"5weeds","date":"2017-02-10T08:33:42.272+0000","up_votes":1,"down_votes":0,"body":"DAs Problem ist: wenn jemand \"flamen\" will, also jemanden beleidigen usw. dann WILL er ja, dass das der Andere liest, sonst könnte er das ja ganz lassen ^^\nDie Leute müssen halt von selber drauf kommen, dass sie sich falsch verhalten.\nWenn sie sich nicht ändern wollen, machen sie´s nicht :c\n\nAber es gibt ja Leute die sich ändern, oder ändern wollen!\nKumpel von mir hatte auch ein extremes Problem mit seiner eigene toxischkeit (<-- ist das ein Word?).\nHat sich auch selber \"gemutet\" und wusste, dass er eh nichts schreiben kann und wurde auch dementsprechend gelassener.\nInzwischen spielt er wieder mit Chat, aber flamen? Keine Spur :)","replies":[]}]}