{"poster":"Shes my Princess","date":"2016-02-28T17:14:46.019+0000","title":"The meta right now for junglers","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"Absolutely f****** sucks a**.  I&#039;ve seen some pretty c***y shit playing this game championwise - which at least is bannable in ranked, but when the problem is to do with a stupid game mechanic that is being rewarded for doing nothing in the jungle, it&#039;s beyond frustrating. There is literally no fun in either;\r\n\r\na) picking a non-devourer jungler and performing extremely well early game to get absolutely shat on later in teamfights by a 300 cs yi/shyvana/udyr/xin zhao, or\r\n\r\npicking any other role and getting ahead and doing well for yourself only to be absolutely shat on later in teamfights by a 300 cs yi/shyvana/udyr/xin zhao.\r\n\r\nI have zero fkn idea as to why you are rewarded for doing absolutely fk all to help your team for the first twenty+ minutes of the game and being a selfish c*** only to get yourself ahead. And then to shit on the enemy team 1v2+ because you&#039;ve been jerking off in your own jungle for half the game is disgusting. If you can&#039;t close the game out by 25-30 minutes it&#039;s game over. It&#039;s cooked.\r\n\r\nThis isn&#039;t happening just in normals, it&#039;s ranked too. Not just bronze, either.\r\n\r\nHow is this retarded mechanic even being rewarded? Getting beast by doing nothing? Being able to build primarily tank with a SD and GR and right click to win? Wriggles part 2? Hello? And for gods sakes put guinsoos back where it was, a niche pick which wasn&#039;t game breaking\r\n\r\ninb4 you&#039;re just shit or you&#039;re just mad you don&#039;t play those champions. Seriously though I don&#039;t even want to play rn because it&#039;s happening _**EVERY SINGLE GAME**_.","replies":[{"poster":"Ingénue","date":"2016-02-28T17:37:27.229+0000","up_votes":3,"down_votes":0,"body":"So it seems to me that your main target of anger here is devourer junglers. \n\nTo counter them, there are a few of things you could do (especially in ranked where you can see their pick).\n\n*  Counter jungle the ♥♥♥♥ out of them. They need their stacks in order to become stated and incredibly strong. If you are continuously counter jungling them and keeping control of objectives, they can't do this. Keep wards deep in their jungle (**trackers knife** is perfect for this) and get your  friendly laners to help you. \n*  If the jungler you are playing isn't going to be the best at counter jungling, focus on fast pacing the game and snowballing your lanes. Apply that map pressure, get your laners fed. Progress the game to a stage where the enemy jungler either needs to match your map pressure (taking them away from their precious farming), or loses control of their jungle due to your superior vision.\n* If you have failed the above options and they have managed to become sated (or very close to), you must work hard to counter their strengths. Devourer junglers rely heavily on their attack speed. What are you going to do? Buy **randuins** and **frozen heart**.  Both these items lower attack speed and  come with some A+ armour which will also go a long way in fighting them.\n\nIn terms of **guinsoos**, you must play around the stacks they have. Kite them for a lil while so the stacks can fall off, then go in for a _balls-to-the-wall engage_ (keeping in mind that you have a short timeframe before you have to back off due to them regaining stacks). **Frozen heart** is also a pretty good counter to **guinsoos** as well. \nAnother way of dealing with this item (works best in ranked where you can see champs and guess build paths) is to pick an annoying tank with strong AR and MR, who wont be shredded by the damage easily (think: malphite, mundo).\n\nIf all else fails {{champion:20}} ♥","replies":[]},{"poster":"greatdeathz","date":"2016-02-29T00:59:18.932+0000","up_votes":2,"down_votes":0,"body":"its enough to drive anyone nuts","replies":[]},{"poster":"WE WUZ KINGZ","date":"2016-02-29T05:39:09.799+0000","up_votes":1,"down_votes":0,"body":"when your stupid team doesn't ban jax, and the enemy picks him into jungle. RIP in pieces","replies":[]},{"poster":"Knuuckles","date":"2016-02-29T04:43:43.804+0000","up_votes":1,"down_votes":0,"body":"You must be new, you can and in fact it is encouraged to invade your opposing jungler' 90% of devourer junglers are complete rubbish early game and wouldn't be much if any help to their laners, which gives you 2 options, be present in your lanes to get them as far ahead as possible without the chance of a countergank or put the opposing jungler in the dirt and take all their camps, it's really not that hard","replies":[]}]}