{"poster":"Not Surrendering","date":"2018-06-01T18:26:48.387+0000","title":"Baron changes for 8.10/11","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hello just wanted to quickly talk about the 8.10 and 8.11 changes to Baron, \n\nEncounter Design: \n\n- Distribute more damage over the backline to reduce the emphasis on having a pure tank in your comp to be able to take Baron (ie. allow more solo queue style comps to take Barons). \n\n- Increase Baron&#039;s health so that he takes longer to do, but does less damage. This is more similar to the Elder model; Epic objectives exist as a means to drive conflict/create emergent gameplay. \n\n- Typically when Baron (or Epics in general) do too much damage or are overly tactical encounters, the only time they get taken is when there is 0% risk (this typically makes it an uninteresting low tension encounter). \n\n- Reward teams for good vision control. \n\nOther:\n\n- Can understand the desire for a &quot;raid boss&quot; style Baron encounter, don&#039;t think SR is the right place for that given that he has been tuned that way in the past (when SRU launched) and resulted in an overly tactical encounter that is too hard to take in all-but ace situations, rather than fulfilling the strategic and pacing goals set for it. \n\n- We want to increase the overall number of times that Baron gets started (but not necessarily finished). \n\n- Having said that, his tuning is intentionally close to the floor of where it can be (this is a correction for regular play vs pro play). \n\nWith regards to soloing: \n\n- Champions should be able to exert their power when fed. There is intended to be some variance in which champions are able to do well on standing DPS checks and not (and makes these champs feel special and have different forms of counterplay - be careful of fast barons when Udyr/Yi/WW/Nunu are in the game).\n\n- Granted, if non-fed champions are able to solo Baron too quickly (they are meant to take a long time), I agree that's a problem.\n\nLet me know if you have questions!","replies":[{"poster":"Demon King Maou","date":"2018-06-01T18:31:59.414+0000","up_votes":12,"down_votes":2,"body":"Why would you decrease his Damage? {{champion:11}} {{champion:23}}  Can solo him at 20 mins if they are fed enough now\nHealth doesn't do jack when they can outheal him solo : /","replies":[{"poster":"nizzy2k11","date":"2018-06-01T19:47:14.581+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Demon King Maou,realm=NA,application-id=A7LBtoKc,discussion-id=XToRlJG2,comment-id=0000,timestamp=2018-06-01T18:31:59.414+0000)\n>\n> Why would you decrease his Damage? {{champion:11}} {{champion:23}}  Can solo him at 20 mins if they are fed enough now\n> Health doesn&#x27;t do jack when they can outheal him solo : /\n\nthe solution to that is to make the nerf to the champion tanking higher so they cant solo. might be more or even better options but this is one that would not hurt a full team attacking baron.","replies":[]},{"poster":"mosqueBreaker","date":"2018-06-03T15:23:35.161+0000","up_votes":1,"down_votes":0,"body":"if yi have 4 item in 20 yea well stop playing u are trash","replies":[]},{"poster":"Not Surrendering","date":"2018-06-01T19:38:46.664+0000","up_votes":8,"down_votes":8,"body":"Champions should be able to exert their power when fed. There is intended to be some variance in which champions are able to do well on standing DPS checks and not (and makes these champs feel special and have different forms of counterplay - be careful of fast barons when Udyr/Yi/WW/Nunu are in the game).\n\nGranted, if non-fed champions are able to solo Baron too quickly (they are meant to take a long time), I agree that's a problem. ","replies":[{"poster":"Dakeudharma","date":"2018-06-05T18:56:23.979+0000","up_votes":1,"down_votes":1,"body":"Solution is pretty simple. Give baron more armor, so you can't solo him with bruisers. If no you have huge imbalance in critical factor, why should bruiser be able to get baron solo and mages not ?","replies":[]}]}]},{"poster":"Malix Farwin","date":"2018-06-01T19:59:11.812+0000","up_votes":12,"down_votes":3,"body":"Its like you guys were making steady progress to make the game more enjoyable but then too 2 steps back with the Baron and Tower Health changes.\n\nThis patch as a whole was 1 step forward and 2 steps back.","replies":[]},{"poster":"The Djinn","date":"2018-06-01T18:35:24.018+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=PhRoXz0n,realm=NA,application-id=A7LBtoKc,discussion-id=XToRlJG2,comment-id=,timestamp=2018-06-01T18:26:48.387+0000)Distribute more damage over the backline to reduce the emphasis on having a pure tank in your comp to be able to take Baron [ie. allow more solo queue style comps to take Barons]. \n>\n> Increase Baron's health so that he takes longer to do, but does less damage.\n\nHave you considered making one or more of Baron's moves deal variable damage based on the number of nearby enemies, out of curiosity? I've seen some concerns that these changes make it much easier to solo Baron, and a change like that (less single-target damage the more people are near Baron) might help decrease 1-2 man Barons without compromising your desires to spread out team-wide damage.\n\nOf course, that's assuming that the long period of one-man Baron is something undesirable, which I'm not 100% convinced that it is, given the potential risks associated with the attempt.\n\nBut yeah, I could see something like this having potential (numbers super rough):\n\n**LORD OF THE PIT:** Baron Nashor deals 40% increased damage, decreased by 8% for each nearby champion.\n\nOr some alternative where one of his abilities deals X damage, spread out between all targets it strikes.\n\n> Can understand the desire for a \"raid boss\" style Baron encounter, don't think SR is the right place for that given that he has been tuned that way in the past [when SRU launched] and resulted in an overly tactical encounter that is too hard to take in all-but ace situations, rather than fulfilling the strategic and pacing goals set for it. \n\nRotating game mode: BARON UNLEASHED. :P","replies":[{"poster":"Not Surrendering","date":"2018-06-01T19:33:05.827+0000","up_votes":3,"down_votes":0,"body":"Yeah we did, there are some visualisation challenges. The existing corruption model exists to have this effect (more impactful when there are low numbers of champions in the encounter). \n\nThere is also intended to be some variance within champions and their effectiveness against Baron. Essentially, tuning the Baron encounter around Yi or Udyr makes it too hard for everyone else.","replies":[{"poster":"The Djinn","date":"2018-06-01T19:40:36.219+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PhRoXz0n,realm=NA,application-id=A7LBtoKc,discussion-id=XToRlJG2,comment-id=00010000,timestamp=2018-06-01T19:33:05.827+0000)Yeah we did, there are some visualisation challenges. The existing corruption model exists to have this effect [more impactful when there are low numbers of champions in the encounter]. \n\nAh, right. I forgot that that spreads corruption to whoever has the lower number of stacks. My bad there! One of Baron's less visible mechanics (I suspect a lot of players don't even remember what that debuff does), but I still shouldn't forget it!\n\n> There is also intended to be some variance within champions and their effectiveness against Baron. Essentially, tuning the Baron encounter around Yi or Udyr makes it too hard for everyone else.\n\nDefinitely understandable! I just wasn't sure how *much* variance was intended, hence my uncertainty on whether or not that aspect was even a problem. Thanks for the response!","replies":[]}]}]},{"poster":"Spideraxe","date":"2018-06-01T19:23:44.537+0000","up_votes":2,"down_votes":1,"body":"This is a bit of a weird since we're in 8.12 for PBE, was it a typo for 8.10/11","replies":[{"poster":"Not Surrendering","date":"2018-06-01T19:28:42.721+0000","up_votes":4,"down_votes":0,"body":"No, just some additional context for the Baron changes that landed this (and last) patch.","replies":[{"poster":"Spideraxe","date":"2018-06-01T19:30:48.550+0000","up_votes":2,"down_votes":1,"body":"Ah ok thanks","replies":[]}]}]},{"poster":"TomiMan7","date":"2018-06-02T13:26:15.294+0000","up_votes":2,"down_votes":0,"body":"So when elder was introduced it was said that taking it down should be a team effort. Well its clearly not the case. Not with elder nor with baron. None of these objectives should be able to be taken by 1 or 2 fed champ. These objectives offer team wide buffs, that alone could win you the game. These things should at least require 3 or more ppl to take down. A fed yi stomping 5 man with that stupid alpha strike is bad alone, no need for him to be able to solo baron again.\n\nYes champs should be able to carry to a certain extent, but winning should be a team effort.","replies":[]},{"poster":"JabaTheHat","date":"2018-06-01T21:29:27.892+0000","up_votes":2,"down_votes":0,"body":"Hello PhRoXz0n thanks for giving us context on why the Baron changes went through.\n\nI saw one of the main goals was to \"make baron more desirable to take, not just in cases where there is zero risk\". Have you considered that a HUGE amount of that risk of baron taking is not in taking too much damage, but in the 50-50 smite? \n\nI think baron should be a reward for the \"winning by alot\" team to close out the game, or for a \"incredible vision control + map movment\" team to gain an edge in an even game by being extremely smart. But with these changes it feels like in EVEN games, **it's too easy to coinflip a game** ---- it matters little what you did early game through laning, csing, ganking and what not, all that matters is that ONE decision you make around baron, for better or worse. If you kill baron you win by default. If you have it smited away you lose the game by default. **I'm against how ONE decision can have this much impact on the game.** I want consistent good plays throughout the game to be more rewarding. I'm curious as to your thoughts on this belief that I have.\n\nThis is what I believe to be true --- in an attempt to make baron more doable in pro games, baron is now too easy to take and too coinflipy in solo queue games. \n\nPlease keep a close eye on baron in solo queue!!!","replies":[]},{"poster":"Mysticman89","date":"2018-06-01T21:09:39.419+0000","up_votes":2,"down_votes":0,"body":"Regarding backline damage, are squishy supports (particularly enchanters), who are probably underleveled relative to the carries (and baron), a group that were considered here?\n\nI've been finding on nami/janna theres been times where, even with a tank taking the brunt of the damage, I can nearly be executed just from the aoe damage these days. Is it intended that those champs should try to avoid actually directly fighting baron and just ducking in to offer a heal/shield before backing off again, or is it possible that the aoe damage is maybe a bit too aggressive to the backline?","replies":[]},{"poster":"ThaddeusMike","date":"2018-06-01T20:03:17.003+0000","up_votes":2,"down_votes":0,"body":"1) Is the decrease in tension due to the difficulty or the reward? Between the huge swing that losing a teamfight and the other team getting baron and the chances for 50/50 smite fights, the risks of starting baron are quite high compared to slowly pushing turrets and taking dragons. \n\n2) What is an appropriate risk level for the massive reward Baron gives? Baron buff has a tendency to end games. If such a buff exists, shouldn't it be difficult and risky? Neutral objectives that only require small advantages exist, and they give commensurately smaller bonuses. Shouldn't there be concern about skewing the relationship between risk and reward?","replies":[]},{"poster":"Rayjay Redfang","date":"2018-06-01T19:50:21.787+0000","up_votes":2,"down_votes":0,"body":"So is the goal to make more conflict and fights around baron since it would give more of a respite time to stop it? Isn't that what is already existed with two teams waiting around baron and starting baron when the enemy team has been killed or on low health?\n\nMy question just is asking will it actually give a different approach. Personally I kind of liked baron doing all that damage but the reason for reducing damage is understandable","replies":[]},{"poster":"Cosnirak","date":"2018-06-02T05:28:43.433+0000","up_votes":3,"down_votes":1,"body":">Can understand the desire for a \"raid boss\" style Baron encounter, don't think SR is the right place for that given that he has been tuned that way in the past (when SRU launched) and resulted in an overly tactical encounter that is too hard to take in all-but ace situations, rather than fulfilling the strategic and pacing goals set for it.\n\nI think you're wrong. I don't think Baron has ever come close to being that kind of encounter in the way people are asking for and thus that has nothing to do with how Baron was treated by players when the SRU launched.\n\nWhat most players mean by wanting a \"raid boss\" style encounter is that you shouldn't be able to just ignore all but 1 mechanic he rarely does while taking him uncontested. Even that 1 mechanic (the small circle knock up attack) barely affects the speed you take Baron and certainly doesn't pose a meaningful threat when Baron isn't being contested.\n\nThe point is that you should feel like dodging Baron's special attacks matters a lot more than it currently does. Right now you just don't stand behind him and you dodge the line and 3 circle hits if you feel like it but if not whatever and sure you try to dodge the small circle because being knocked up is annoying, especially when you're busy spamming spells on cd. That's it and that's super lame. Make those spells matter, add in a 4th that has a slightly longer window to dodge but is actually punishing (like 20 %max hp magic damage and slows attack speed by 50% for 4 seconds or something).\n\ntl;dr- Essentially give Baron meaningful mechanics to interact with even while taking him uncontested so there's tension between watching for enemy players and paying attention to what's in front of your character. You could make him do all kinds of really neat special attacks that would make Baron not be a snooze fest.","replies":[]},{"poster":"FF1224","date":"2018-06-01T22:00:22.122+0000","up_votes":3,"down_votes":1,"body":"What do you even mean patch 8.10 LOL.... It's really worrying having this discussion yet you must be using bad data if you aren't even including patch 8.9 (when the baron changes originally happened... baron wasn't changed in 8.10 at all)\n\nhttps://na.leagueoflegends.com/en/news/game-updates/patch/patch-89-notes\nhttps://na.leagueoflegends.com/en/news/game-updates/patch/patch-810-notes\n\nOverall I think the changes are garbage... Meddler was just talking today about reducing team snowball and baron is one of the main causes of team snowball (provides power to everyone on the team vs just yourself). Seems there's some big conflict of design/miscommunication going on.","replies":[]},{"poster":"UpDownLeftRightAB","date":"2018-06-05T20:22:19.467+0000","up_votes":2,"down_votes":1,"body":"I think people want this. \n\n\"desire for a \"raid boss\" style Baron encounter\"\n\nYOU WANT THIS:\n\n\"don't think SR is the right place for that given that he has been tuned that way in the past\"\n\nCan you think of the players and not yourself for once?\nPlease?","replies":[]},{"poster":"jocomotion","date":"2018-06-05T02:24:34.371+0000","up_votes":2,"down_votes":1,"body":"When are you updating Karma? Any info at all?","replies":[]},{"poster":"lol you wild wyd","date":"2018-06-05T18:14:54.496+0000","up_votes":1,"down_votes":0,"body":"The Baron changes alongside the base tower HP decrease have just piled on the snowball problem that you guys have been trying to address. A lot of the changes in this new patch cadence of mid Season 8 contradict their previous counter parts.","replies":[]},{"poster":"Kadexe","date":"2018-06-03T05:11:37.034+0000","up_votes":1,"down_votes":0,"body":"Not the most world-shattering post but interesting nonetheless. Did Ghostcrawler have any hand in writing this? It seems right up his alley.","replies":[]},{"poster":"Ifneth","date":"2018-06-03T05:07:23.145+0000","up_votes":1,"down_votes":0,"body":"Making Baron into a “raid boss” is worth overcoming technical obstacles for.  He should be an interactive epic monster rather than just a pile of health with a basically flat single-target and AOE DPS.","replies":[]},{"poster":"ZephyrDrake","date":"2018-06-02T06:09:54.923+0000","up_votes":1,"down_votes":0,"body":"Baron the being that gives a massive buff but does absolutely no damage whatsoever so the risk of starting it at any point in the game is ZERO. Good job in making baron be a joke of a monster that a single champion can take regardless of how fed it is... but then again I guess the purpose of these changes was to make champions building nothing but mana items be able to take baron with no effort whatsoever because god forbid that there is something in the game that requires any amount of coordination with the team","replies":[]},{"poster":"Ricky Bobbys Dad","date":"2018-06-01T21:37:01.032+0000","up_votes":1,"down_votes":0,"body":"If you have a team with one champion that shits damage (bloodrazor, guinsoo, botrk) and literally any useful tank that can build Banner, then you win. Just force one or two picks after 20-25 minutes and completely turn any game into a solo-queue dumpster fire where everybody is forced to chase vision around Baron and any champion who builds AS/AD-core is the most important person in the game.","replies":[]},{"poster":"The Yetii Rider","date":"2018-06-01T18:45:20.082+0000","up_votes":1,"down_votes":0,"body":"Doesn't increasing Baron Nashor's maximum health put more of an emphasis on champions who can deal true damage to it ({{champion:20}} {{champion:11}} {{champion:32}} ) since their damage output isn't nearly as hampered by Baron's Gaze as other champions?","replies":[]},{"poster":"mosqueBreaker","date":"2018-06-03T15:25:17.458+0000","up_votes":1,"down_votes":1,"body":"the game is just exteremely hard to 1vs9 , i see some streamers go to master elo so fast but in regions like kr , euw or na maybe, doing that is so hard there is no way, if u dont fix this trash state of s8 i dont think nobody play after it, the game is just garbage shiiit that u will never have fun because u cant carry games with trashs at all","replies":[]},{"poster":"Gamer  Life","date":"2018-06-01T19:19:44.516+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=PhRoXz0n,realm=NA,application-id=A7LBtoKc,discussion-id=XToRlJG2,comment-id=,timestamp=2018-06-01T18:26:48.387+0000)\n>\n> Hello just wanted to quickly talk about the 8.10 and 8.11 changes to Baron, \n> \n> Encounter Design: \n> - Distribute more damage over the backline to reduce the emphasis on having a pure tank in your comp to be able to take Baron (ie. allow more solo queue style comps to take Barons). \n> - Increase Baron's health so that he takes longer to do, but does less damage. This is more similar to the Elder model; Epic objectives exist as a means to drive conflict/create emergent gameplay. Typically when Baron (or Epics in general) do too much damage or are overly tactical encounters, the only time they get taken is when there is 0% risk. \n> - Reward teams for good vision control. \n> \n> Other:\n> - Can understand the desire for a \"raid boss\" style Baron encounter, don't think SR is the right place for that given that he has been tuned that way in the past (when SRU launched) and resulted in an overly tactical encounter that is too hard to take in all-but ace situations, rather than fulfilling the strategic and pacing goals set for it. \n> - We want to increase the overall number of times that Baron gets started (but not necessarily finished). \n> - Having said that, his tuning is intentionally close to the floor of where it can be (this is a correction for regular play vs pro play). \n> \n> Let me know if you have questions!\n\nuses cant pick and choose when you want to listen to your community and when you dodnt, so for this reson I wont be wasting my time on giving feedback :)","replies":[]}]}