{"poster":"SandDrangon","date":"2015-03-17T00:30:17.760+0000","title":"I.E. and league. any workarounds?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"I have a computer that i've played league on for a while. then about a year ago my friend obliterated (for lack of a better word) internet explorer.\r\nnow, i know ie cant really be uninstalled, so it cant be reinstalled, but all the files for ie have been shreaded. found out later that league of legends uses \r\nie as a dependency. i cant even log on now. updating is normal, even the log in screen is fine. but once i hit enter to log in...\r\nDid not recieve a response from server; retrying (attempt 1)\r\nDid not recieve a response from server; retrying (attempt 2)\r\nDid not recieve a response from server; retrying (attempt 3)\r\n\r\nso i need to figure out how to either bipass this requirement meaning change the dependency\r\nor i need to figure out some way of fixing my ie.\r\ni've tried to update, but i have nothing to update to. i had the latest version.\r\nthe store doesnt seem to work so i cant update it there. troubleshooter finds no problems.\r\ni cant seem to simply roll back the program.\r\nthe league program is perfectly fine so it's ever more frustrating to patch this computer in hopes of maybe playin on it again XD\r\n{{champion:26}}  MAYBE CHRONO SHIFT WILL HELP!","replies":[{"poster":"HORSE OF FORCE","date":"2015-03-20T05:57:45.925+0000","up_votes":1,"down_votes":0,"body":"Why can't you reinstall it? You uninstall Internet Explorer by going into activated Windows services, disabling it, removing all files, restarting Windows, re-enabling it, and then updating Windows. League requires your computer has Internet Explorer on it to run (which sucks imo (and how does it work on Mac?)), but they main thing it concerns itself with is your 'Internet Options', which can be accessed by the Control Panel. Can you still do that, at least?","replies":[{"poster":"djsilver","date":"2015-03-20T11:27:44.039+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HORSE OF FORCE,realm=OCE,application-id=ElA0rvVL,discussion-id=nhmRwFNW,comment-id=0001,timestamp=2015-03-20T05:57:45.925+0000)\n>\n>  (and how does it work on Mac?))\n\nSafari acts the same way for mac as IE dose for windows.","replies":[{"poster":"HORSE OF FORCE","date":"2015-03-21T05:02:09.137+0000","up_votes":1,"down_votes":0,"body":"Ah, thank you for that. It was something I was pondering for the longest time, but wasn't bothered enough to go and research it myself.\n\nSo that means League does not have to have specifically Internet Explorer as its dependency? Does this mean you can use Seamonkey or something like that to connect?","replies":[]}]}]},{"poster":"djsilver","date":"2015-03-17T08:49:39.062+0000","up_votes":1,"down_votes":0,"body":"This should help, it's very hard to change the dependency to some thing other then IE. \n____\nhttps://support.microsoft.com/en-us/kb/318378?SmcNavTabIndex=1\n____","replies":[]}]}