{"poster":"Ariya","date":"2019-06-26T20:54:53.833+0000","title":"[TFT] Feedback zur Übersetzung von Taktischer Teamkampf","subforum":"Rückmeldungen zur Übersetzung","up_votes":5,"down_votes":1,"body":"Hey alle,\r\n\r\nwie ihr vielleicht schon wisst, ist Taktischer Teamkampf unser Beitrag zum Autobattler-Genre, das durch Dota Auto Chess zu Beginn dieses Jahres entstanden ist. \r\nIn einigen Stunden könnt ihr diesen Spielmodus selber live auf EUW ausprobieren. Wenn ihr auf deutsch spielt, würden wir gerne von euch Rückmeldungen zur Übersetzung hören.\r\n\r\nWas gefällt euch? Welche Übersetzungen sind unklar? Habt ihr Fehler gefunden?\r\n\r\nUnsere Experten von der Lokalisation werden ein Auge auf diesen Thread haben. Wir freuen uns auf euer Feedback und eure Ideen.\r\n\r\nPS: Den Namen/Titel werden wir nicht ändern. D.h. es wird im deutschen weiterhin den Untertitel \"Taktischer Teamkampf\" tragen.","replies":[{"poster":"90kg 185iq 5cm","date":"2019-06-27T03:00:45.054+0000","up_votes":4,"down_votes":1,"body":"Ein \"Fehler\" bei der Übersetzung ist mir schon bekannt, denn ihr habt den Modus „Taktischer Teamkampf\" (TTK) genannt. Erstens, ist das Wort „Team\" nur ein Anglizismus, weshalb bei der kompletten Eindeutschung eher ein anderes Wort angemessen wäre, wenn man unbedingt den Namen des Modus übersetzen muss und zweitens, steht die Abkürzung \"ttk\" eigentlich für „time to kill\" und hat bei mir besonders bei dem Untertitel vom „RIOT pls\"-Video für Verwirrung gesorgt. Dachte erst RIOT wäre aufgefallen das die „time to kill\" angepasst werde muss, da z.Bsp. ein Kayn den ADC in 0.2 Sekunden 2k Schaden um die Ohren hauen kann.\nWarum den Titel denn nicht ändern? Muss doch nun wirklich nicht die deutsche Version sein und könnte einfach unter TFT geführt werden. Bei „ARAM\" ist es doch genauso (all random all mid), oder wollt ihr behaupten, dass das „alle randomisiert alle Mitte\" heißen soll, ich denke nicht.\n\nNichtsdestotrotz freue ich mich auf den „taktischen Gruppenkampf\" und werde Übersetzungs-/Inhaltsfehler hier melden.","replies":[{"poster":"Humpelstilzche","date":"2019-06-27T04:42:16.543+0000","up_votes":2,"down_votes":1,"body":"> . Erstens, ist das Wort „Team\" nur ein Anglizismus\n\nDa kann man sich drüber streiten, wann etwas ein Anglizismus ist und wann ein Wort schlicht etymologisch einen englischen Ursprung hat. Unsere Sprache ist ja (wie fast jede Sprache) ein wilder Mischmasch aus ganz vielen Sprachen. Wenn man jedes Wort das ursprünglich wo anders herkommt ausschließt, bleibt nicht mehr viel übrig, was man verwenden kann. \nBei ganz neuen Anglizismen wie...kA...z.B. \"followen\" kann ich das Argument noch verstehen, aber ein Wort das seit über 100 Jahren im Duden steht, Teil offiziieller Deutsch-Prüfungen ist und von 100% der Deutschen als normales Wort verwendet wird ist wirklich nur noch aus rein etymologischer Sicht ein Anglizismus, genauso wie fast alle anderen Wörter Internationalismen sind. \n\nDas Argument mit der Abkürzung, ja, das seh ich genauso. Aber das hindert mich ja nicht dran es trotzdem einfach weiterhin TFT zu nennen. ","replies":[]},{"poster":"naniwakaze","date":"2019-06-27T08:34:33.757+0000","up_votes":2,"down_votes":2,"body":"ARAM als Konzept war schon verbreitet, bevor es ein Modus wurde. Warum also etwas anders nennen, wenn es Leute so schon kennen? Würde der Modus \"League Auto Chess\" heißen, würde man den Namen auch nicht übersetzen, aber \"Teamfight Tactics\" hat keinerlei Geschichte oder besondere Bedeutung.\nBTW wurde der Modus in allen europäischen Sprachen übersetzt und es scheint sonst niemanden zu stören.","replies":[]}]},{"poster":"MrSnowy","date":"2019-08-23T12:26:01.857+0000","up_votes":2,"down_votes":0,"body":"Hallo Riot\n\nich hab gelesen das ihr am überlegen seid, welche Belohnungen Optimal wären für das TTK\n\nIch hab mir dies bezüglich einige gedanken gemacht, da ich diesen Spielmodus doch sehr mag.\n\nUnd zwar gibt es ja die begleiter für das Spiel, die man ebenfalls im Aram sehen kann\n\nHier könnte man doch eine Art Siegreich-Begleiter, und Skin Machen?\n\nDarüber hinaus sollte ein Rahmen für TTK ebenfalls möglich sein sowie ein eigenes Symbol.\nDen Rahmen kann man dann im Aram TTK und Kooperaktives Spiel sehen.\nDa die Belohnungen sich schon von den anderen Ranglisten unterscheiden sollten und hier natürlich kein Siegreich-Skin vergeben werden sollte ist durchaus klar.\n\nAuch ein Gesonderten Arena Skin (Siegreich) könnte man hier einbinden.\n\nSo sieht man seine leistungen bzw kann auch die leistung die man im TTK erreicht hat teilen und auch (etwas damit angeben) :)\n\nZu den begleitern.\nAuch hier ist es von Liga zur Liga möglich das erreichen von Silber Gold Platin etc durch unterschiedlichen Farbakzenten zu beschmücken..Vllt hat der kleine süße begleiter ja auch eine Siegreichkrone auf oder ähnliches.\n\nDas wären so meine kleinen vorschläge, vllt hilft da ja was bei der Planung für das TTK Team.\n\nMfg Chris (Snowy)\n\nIch hab diesen Beitrag erst nach meinem Support-Ticket gesehen (Aber eine rückmeldung gab es bereits) und diese war Positiv. \n\nLetzendlich möchte ich aber das auch die Community von TTK(TFT) Hier mit Diskutieren darf/soll.","replies":[]},{"poster":"ßlameMyADC","date":"2019-06-27T01:59:59.183+0000","up_votes":2,"down_votes":1,"body":"TFT Be Like\nhttps://youtu.be/E5W19sxR3pQ)","replies":[]},{"poster":"BibbelBax","date":"2019-12-21T15:43:57.403+0000","up_votes":1,"down_votes":0,"body":"Die Beschreibung des Elements Inferno sollte überarbeitet werden:\n1. \"Kritische Treffer [...] verbrennt das Ziel.\" -> verbrennt auf verbrennen ändern\n2. Im Englischen steht, dass kritische Treffer und Fähigkeiten das Ziel verbrennen. Im Deutschen steht nur, dass kritische Treffer den Effekt auslösen.\n3. Das Verbrennen verursacht Schaden in Höhe von '%' der Fähigkeit. -> Inwiefern gilt das für die kritischen Treffer? Lösen kritische Treffer den Schaden der Fähigkeit aus oder wird dann Schaden in Höhe '%' des kritischen Angriffs verursacht?","replies":[]},{"poster":"Alone Musk","date":"2019-07-01T15:57:02.920+0000","up_votes":1,"down_votes":0,"body":"Der Modus ist Design technisch ganz schick gestaltet. Großes Lob and euch Riot.\n\nJedoch muss ich als Feedback leider sagen, dass Taktik und Strategie in diesem Modus nicht von Bedeutung sind.\nDer Spielmodus basiert nämlich auf 90% Glück.\n\nMan gewinnt nicht mit dem besten Strategischen Hirn, sondern\n\n* Wenn man mit Glück die Items von den PVE kämpfen bekommt\n\n* Glück mit den Rolls im Shop\n\n* Glück im Karussel ( wenn ihr wisst, was ich mit Karussel meine)\n\nMan setzt sich eine Kombo als Ziel, und kann diese aus Pech nicht umsetzen, da man keine Items,\nkeine passenden champs bekommt etc.\n\nEs nervt mich persönlich auch, dass es fast unmöglich ist, seine Comp zu erstellen, wenn 2 aus den 8 \nLeuten das gleiche brauchen, da es nur einen Championpool gibt. \n\nWenn ich tipps geben könnte, basierend auf meinen 30 runden oder so (RIP spielverlauf).\n\n1. CHampionpool für alle, aber dafür gedrosselt und gleich. Je nachdem, wie viel mal gerollt wird, unterscheidet es sich stärker vom pool des anderen oder so.\n\n2. PVE kämpfe sollten IMMER ein Item droppen, da es sonst einfach das Game zerstören kann, wenn ein Gegner 2-3 Items bekommt und man selber 0 (ERfahrung...)\n\n3. Es ist auch nicht sehr fair, wenn man selber Vayne möchte, und nach ZWEI RUNDEN spielerkämpfe eine Vayne LVL 3 im Gegnerteam vorfindet.\n\nDas.\nmacht.\nKein.\nSpaß.\n\nDer Spielmodus selber ist ganz dynamisch. Man kann gut spielen aber es könnten gerne balancechanges anstehen bei Glacial, allgemeinen Stunzeiten und Kassadin.\n\n\nansonsten Gute arbeit rito.\n Ich hoffe ihr liest das.","replies":[{"poster":"Vorzüglich","date":"2019-07-02T18:47:22.413+0000","up_votes":1,"down_votes":0,"body":"Du sollst ja gar nicht jedes mal deine Lieblings Combo spielen können.\n\nDas Spiel ist so aufgebaut das Du das beste aus dem machen sollst  was du bekommst,\n\nDie Kunst oder Skill liegt darin flexibel zu reagieren, genau was die Leute in der Kluft immer vergessen. jeder baut das selbe Itembuild in jedem Spiel in der Kluft, das kannst und sollst du bei TFT gerade nicht,.\n\nDu sollst adaptiv sein, schauen welche Champs. der Gegner einkauft. Umdenken lernen.\n\nDarin liegt die Kunst oder auch der Erfolg. \n\nAber das ist eben genau das Problem bei Kluft oder TFT Spielern, SIE wollen bestimmen was Spaß macht im Grunde bezeugt das nur das niedrige Spielverständnis und die eigene Unfähigkeit.\n\nIch bitte dies nicht als persönlichen Angriff zu sehen, ich spreche hier ganz allgemein.","replies":[{"poster":"Alone Musk","date":"2019-07-17T15:49:12.827+0000","up_votes":1,"down_votes":0,"body":"Wenn man die gegner kontern will, statt einfach wie gewohnt das gleiche zu spielen, dann kann man dies nur so lange machen, wie unten etwas im shop ist. Flexible am *****, wenn die zukünftigen Shops dir nichts bringen. man kann mit 4 x 1stern champs nichts auf dem feld erreichen, sollte der andere spieler einfach glück am arsch haben und bereits 3 stern tristana hier haben mit 1-3 items.\n\nMan kann nicht flexible spielen, wenn die zukunft ungewiss ist. siehst du im shop etwas als möglichkeit, kann dies ein irrtum sein, sollte dieser Champ die nächsten 10 Shops nicht erneut auftauchen.\n\nIch habe recht viele runden tft gespielt und nur eine einzige situation gehabt, wo das strategische denken den sieg bestimmt hat, da sowohl die kombo's und die items ausgeglichen waren. Das ist der moment, wo tft spaß macht (für mich)\n\nIch verstehe dein punkt aber die tatsache, dass glück im overall den spielverlauf bestimmt, ist nicht bestreitbar. gibt ja genug youtube videos, die dies auf lustige weise veranschaulichen.\n\nMfG Alone Musk{{sticker:slayer-jinx-catface}}","replies":[{"poster":"FeelingMadHust","date":"2019-08-05T14:47:01.143+0000","up_votes":1,"down_votes":0,"body":"Ich bin nur zum Teil deiner Meinung. Erst wenn man in den letzten Runden ist, wo nurnoch 2 Leute überlebt haben , beginnt der Teil mit der Strategie. Wenn es aber darum geht Flexibel zu agieren und sich den Gegnern anzupassen dann soltet ihr das zerlegen von Items ermöglichen, denn Items die auf der einen Combo gut funktionieren sind bei einer ganz anderen Combo wieder nutzlos. Das Selbe gilt auch beim Auswechseln der Champs. Ihr könnt ja das aufteilen der Items durch Gold ausgeben abschwächen. Es wäre Cool wenn man einen Wunsch etablieren könnte, was das abwerfen von Items bei PVE, anbelangt. Man sagt ich kann diese 4 Items gebrauchen und man hat dann die Chance zwischen den Items, und ihrer Anzahl oder Gold. \nWenn man es noch mehr in den Bereich der Taktik schieben will kann man auch entscheiden lassen ob man PVP spielt und 4 oder 5 Erfahrungspunkte zu bekommen oder ob man PVE spielt und keine Erfahrung aber dafür Items bekommt. So gibt es noch mehr Unterschiedliche Wege um an die Spitze zu kommen. Oder man macht ein Feld von den 6 in dem man Wählen kann falls ihr Sorgen wegen der Spiellänge habt.\nWas aber definitiv geändert werden muss sind die Algorithmen , denn je nachdem welchen Champ man sich im Karusell aussucht werden bestimmte Champs beim Inventar Favorisiert und wenn man ein Champ nur des Items wegen ausgesucht hat und die nächsten 3 Inventare abwarten muss bis wieder ein Champ kommt der einem Nützt und damit den Algorithmus wieder näher an das Gebrauchte zu schieben, dann ist das suboptimal. Vor allem wenn man weiter Oben ist und sich zwischen Pest und Cholera entscheiden muss.","replies":[]},{"poster":"Vorzüglich","date":"2019-07-17T19:03:26.996+0000","up_votes":1,"down_votes":0,"body":"Nun all meine Punkte können dir nicht den Sieg garantieren^^\n\nIch spreche davon wie man spielen sollten um die Siegchancen zu erhöhen, das man damit nicht jedes Spiel gewinnen kann sollte einleuchten.\n\nIm Grunde, kann es passieren und wird es oft genug passieren, das man das max herrausholt und trotzdem derbe auf den Sack bekommt.\nJa dies stört viele zurecht. Aber auch dies ist gewollt.\n\nDu verlierst deshalb auch nicht alle deine HP beim ersten, zweiten oder auch dritten Spiel gegen einen Gegner.\n\nSprich wenn du zurückliegst, sollte dir das Spiel ein aufholen ermöglichen und das tut es ja auch, wenn auch nur in form eines rouletes^^\n\nTFT sollte man nicht zu ernst nehmen, genauso wie die Kluft.\n\nIch halte im übrieren TFT WESENTLICH Leistungsbelohnender als die Kluft.\n\nAber auch dies wird der ein oder andere sicher anders emfinden...","replies":[]}]}]}]},{"poster":"Helferklein","date":"2019-07-04T18:26:54.994+0000","up_votes":1,"down_votes":0,"body":"Bitte Bitte bitte macht es möglich Items bereits im Lager kombinieren zu können, sodass man beim Hovern eines Items über einen andren schon die mögliche Kombination sieht. Ich weiß von vielen Leute, dass sie nebenbei Übersichten von Items offen haben um so eine Übersicht zu behalten und besser planen zu können. \n\nWenn ihr keine Übersicht über Gegenstände im Game einfügen wollt (z. B. Shop artig) dann wäre das mindeste das man im Lager bereits durchs Item Hovern sehen kann was daraus werden kann. \n\nDanke {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Daedeye","date":"2019-06-27T20:42:27.962+0000","up_votes":1,"down_votes":0,"body":"Bitte ändert den Namen in Fucking Ultra Cooler Kampf. Soviel zum Feedback, nichts zu danken, gerne.","replies":[]}]}