{"poster":"TheCharlieJoe","date":"2016-02-21T14:29:33.907+0000","title":"Dodgen - spiele/dodge/spiele/dodge  (Verliere ich dann beim zweiten dodge auch nur 3 LP)","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":2,"body":"Hab heute mal gedodgt und somit schlu&szlig;endlich mehr LP verdient jetzt meine Frage:\r\n\r\nWenn ich ein Ranked mache und danach ein Ranked dodge und dann wieder eins mache und\r\ndann danach nochmal eins dodge verlier ich dann nur 3 LP????\r\n\r\nJetzt schon mal danke an euch die antworten!!!\r\n\r\nCharlieJoe","replies":[{"poster":"Maexle","date":"2016-02-21T15:15:49.654+0000","up_votes":2,"down_votes":0,"body":"Beim ersten Mal dodgen verlierst du 3 LP, beim 2. Mal an einem Tag verlierst du dann 10. {{champion:17}}","replies":[{"poster":"TheCharlieJoe","date":"2016-02-21T21:25:59.534+0000","up_votes":1,"down_votes":0,"body":"danke genau das wollte ich wissen\n\nund auch danke an die anderen für ihre tat hier zu antworten","replies":[]}]},{"poster":"Domixos","date":"2016-02-21T15:01:39.334+0000","up_votes":1,"down_votes":0,"body":"Wenn du mehrmals dodged dann gibt es größere Strafen z.B Low Priority Queue","replies":[{"poster":"legofreak1","date":"2016-02-21T15:03:41.537+0000","up_votes":1,"down_votes":0,"body":"Low-Priority-Queue gibt es nur für das Verlassen von Spielen, nicht für das Dodgen der Champselect.","replies":[{"poster":"Domixos","date":"2016-02-21T15:05:41.942+0000","up_votes":1,"down_votes":0,"body":"Lego irgendwie magst du mich nicht :D","replies":[{"poster":"legofreak1","date":"2016-02-22T17:25:45.683+0000","up_votes":1,"down_votes":0,"body":"Kennen wir uns? ^^","replies":[]},{"poster":"Megamaexx","date":"2016-02-21T16:59:43.627+0000","up_votes":1,"down_votes":0,"body":"Er korrigiert nur^^\nDie Zeitstreafe, die man fürs Dogden bekommt, ist nämlich nicht die Low-Priority-Queue, sondern nur eine Zeitsperre, während der du der Queue nicht beitreten darfst. Die gilt dann beim ersten Dogden 6 Minuten, die aber auch ablaufen, wenn du kein neues Spiel starten willst.","replies":[]}]},{"poster":"Sihari","date":"2016-02-21T15:56:09.575+0000","up_votes":1,"down_votes":0,"body":"Stimmt nicht so ganz.\nIn der neuen Chamselect (und damit auch automatisch im Ranked) bekommt man auch eine Zeitstrafe, wenn man seinen Pick oder Bann nicht bestätigt.","replies":[{"poster":"legofreak1","date":"2016-02-22T17:25:18.065+0000","up_votes":1,"down_votes":0,"body":"Das ist aber nicht das System der Low-Priority Queue. Bei kleineren Zeitstrafen durch dodgen musst du nur ein paar Minuten warten, bevor du wieder in die Queue kannst. In der Zeit kannst du ganz normal den Client verwenden und mit Freunden chatten. Ich glaube, man muss nichtmal online sein. Bei der Low-Priority Queue wirst du in den 5-20 Minuten komplett von allen Funktionen des Clients ausgeschlossen und direkt in die Warteschlange eingereiht und musst das Spiel annehmen, dass dann kommt, ansonsten musst du nochmal durch die vollen 20 Minuten durch. Die Zeitstrafe ist nur dafür da, damit man nicht andauernd dodged und soll nicht wirklich weh tun, die Low-Priority Queue hingegen soll nervig sein.","replies":[]}]}]}]}]}