{"poster":"InfinitexMortal","date":"2019-04-03T23:19:03.904+0000","title":"Something seriously needs done about the artificial elo wall known as promos","subforum":"Gameplay","up_votes":117,"down_votes":6,"body":"Why in an mmr based system does this wall exist? If you have mmr to move up you should move up when hitting 100, if u have lower mmr you should move down when hitting 0. So why do i have to win 2/3 rigged games at 100 to move up or else drop to 68 lp?!\n\nI mean wtf riot. Before promos i win a game, win another game destroying the enemy so hard they cant take a tower. Then i get to promos with a free win, team cant take a single tower and feeds like crazy clearly outmatched. Next game Garen feeds 2 kills afks and the adc is ragging how they just lost the last 3 rounds and got demoted. Again no  tower taken..... I've seen enough of these promos to see that 9 times out of 10 they are far more in the enemy's favor than mine. And why if they are separate games from the 0-100 do they make you go back down to 68lp instead of 100 with a chance to win and retry them? At this point it is clearly obvious they only exist as a wall to slow down climbing in order to force people to play more games. That is poor game design and has nothing to do with an mmr based rank. \n\nSo i ask again, Riot, what is the point of these clearly onesided promos in an MMR based ranked system other than a cheap artificially forced wall to slow progressing rank and extend required play time?","replies":[{"poster":"Scottsc20","date":"2019-04-04T01:11:44.460+0000","up_votes":47,"down_votes":5,"body":"No one will ever convince me that promos aren't rigged. Entire enemy team is P2, my team is G4/S1 while I'm G1. Seems fair.","replies":[{"poster":"Sir Saltarin","date":"2019-04-04T09:26:47.603+0000","up_votes":5,"down_votes":5,"body":"That's funny because yesterday *my friend* who is also  MF main (along with his duo who mains Braum) was at 98 points on Gold 3, and he was on a win streak of 8 ranked games in a row, then he played 3 rankeds more and oh, he won the first and entered in Promo and won the Promo 2-0.\n\nHe reached Gold 2 with a 11 ranked wins streak and then, when he was on 0 points he played another ranked, got stomped in 10 mins, the Swain Top of his team went afk and they ff'ed at 20.\n\nWhich makes me think that Promos are not as rigged as you guys say, it's just that you guys only remember the Promos that go wrong. Oh, and at the start of his win streak he also won the Gold 4 to 3 Promo.\n\nhttps://euw.op.gg/summoner/userName=saltran you can see the OPGG of *my* *friend* here, all I said is legit.","replies":[{"poster":"Scottsc20","date":"2019-04-04T16:37:02.796+0000","up_votes":4,"down_votes":1,"body":"Congrats, I'm happy for your friend reaching Gold 2. Unfortunately, the experience of one person does not represent the entirety of the community, so...your point is invalid.","replies":[{"poster":"Leetri","date":"2019-04-04T16:48:18.100+0000","up_votes":3,"down_votes":4,"body":"And neither does your experience represent the entire community either.\nWhat does the game do if there's a guy in their promo on both teams? Which team does it rig the game for?","replies":[{"poster":"karolmo","date":"2019-04-04T18:58:53.217+0000","up_votes":3,"down_votes":1,"body":"The \"promotion games are rigged\" sentiment has existed for years tbh, it's not something new.","replies":[{"poster":"Sir Saltarin","date":"2019-04-04T19:19:32.681+0000","up_votes":3,"down_votes":7,"body":"And it has always been exactly that, a sentiment because the players only remember and complain when they fail their promos not when they win.\n\nThinking that Riot has created a system in which the Promos are rigged for some obscure reason it's just non sense","replies":[{"poster":"karolmo","date":"2019-04-04T19:43:45.359+0000","up_votes":7,"down_votes":0,"body":"Think about it this way. If the system worked properly, why are promos needed? You just rank up once your MMR hits the next league's MMR.\n\nPromotion series are there to stop players who got to the series without having a high enough MMR. And, when one of these players get to a promo, it just makes him lose it. The same way it skips leagues if your MMR is high enough.","replies":[]}]}]}]},{"poster":"Sir Saltarin","date":"2019-04-04T16:52:36.998+0000","up_votes":2,"down_votes":6,"body":">so...your point is invalid.\n\nNo, what is invalid is your point because first you said unironically this atrocity:\n\n>No one will ever convince me that promos aren't rigged\n\nIf that was true *my* *friend* would have lost that promos considering that he was also on a winning streak, you say that promos are rigged, I show you an example and you say that it doesn't matter because it's only 1 example but can you show me a factual example of promos being rigged as you claim ?","replies":[{"poster":"Scottsc20","date":"2019-04-05T01:44:14.371+0000","up_votes":5,"down_votes":0,"body":"Sure, just consult about 95% of the community, they will all say the same thing.","replies":[]}]}]},{"poster":"Vreivai","date":"2019-04-04T19:46:29.587+0000","up_votes":3,"down_votes":1,"body":"Nah, I've got something like a 80-90% loss rate in promos across the 6 years since I started playing. Was in promos for Gold many times in solo queue in the past. Never once won a single one of them.","replies":[]}]},{"poster":"Starcraft243ver","date":"2019-04-04T09:20:33.678+0000","up_votes":2,"down_votes":2,"body":"I went trough every single of your lasts games and couldnt find the one you are talking about : https://na.op.gg/summoner/userName=Scottsc20\n\nAlso I never had a rigged promo, so ... I guess i'm lucky.","replies":[{"poster":"Madsin25","date":"2019-04-04T16:04:12.850+0000","up_votes":5,"down_votes":2,"body":"Exactly this.\n\nYou look up the match history for anyone claiming rigged promos and you find everyone was basically equal rank.","replies":[]}]}]},{"poster":"Tormentula","date":"2019-04-04T02:14:32.322+0000","up_votes":29,"down_votes":1,"body":"Promos and demotion shields are part of why league's ranked system is so fucked. \n\nWe wouldn't have to remove the 5s tiers if those hardstuck in those 5s would demote sooner without a shield keeping them there until they're +13 per win -25 per loss. They're probably in a MMR range of 3 or 4 tiers of a lower division by the time the system drops them. \n\nPromos are another cancer that forces you to RNG your way through games with coinflip teams in a short window of matches, while your MMR is high due to the fact you probably winstreaked your way to those promos and are higher MMR then normal going into them, then get hit hard with MMR loss when you lose them.\n\nIdk why riot wants to create a matchmaking system that doesn't correlate with the visible rankings due to the number of pauses in those visible ranks (and artifical losses from dodging) compared to the consistent flow of MMR changes. ","replies":[{"poster":"FrozenFitzgerald","date":"2019-04-05T22:21:29.724+0000","up_votes":2,"down_votes":0,"body":"\"Idk why riot wants to create a matchmaking system that doesn't correlate with the visible rankings due to the number of pauses in those visible ranks (and artifical losses from dodging) compared to the consistent flow of MMR changes. \"\n\nNot to mention the extreme flaming a person will be on the receiving end of if their MMR is higher than their rank. If you are in bronze playing in a gold game, like I have been, people will flame during champion select. They don't know that MMR and rank are different things and they will immediately assume you are awful and will harass you for it. Not only is the system bad and unclear, it creates even more avenues for people to be horribly toxic. Riot pretends they take that stuff seriously, but they create more ways for people to be toxic at every turn and refuse to listen to the playerbase.","replies":[]}]},{"poster":"Galaxyburstz","date":"2019-04-04T00:01:51.671+0000","up_votes":22,"down_votes":0,"body":"Yeah, I was on a winning streak after I picked up support last week and instantly reached my promos with a free win. First game, my 1 million + mastery points Kled is 0/4 at 3 minutes, and his Jax duo is 0/2 ( tower dived at level 1 then {{summoner:12}} to lane and tower dived again while still level 1 ), runs it down mid until 0/10 and says GG then D/C's\n\nNot to mention the stress that was put on our Diana mid who went 1/9 vs Yasuo ( I can't even blame her, I understand the tilt ) and we basically autoloss that one, but it's ok I still have one more chance.\n\nNext game, OMG my Varus is 13 / 0 and I'm 1/0/14, what could ever go wrong? then all I hear from top lane is Double Kill, Double Kill, Double Kill, Enemy Rampage! Triple Kill, Godlike! An enemy is Legendary, Double Kill!\n\nEnded 1/9/35, once we got first tower we were literally deleted when attempting to even leave lane and now I'm back at my 67 LP\n\nJust a little story from my past week I thought I would share, sorry for the length : D","replies":[{"poster":"Colte","date":"2019-04-04T04:16:51.333+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Galaxyburstz,realm=NA,application-id=3ErqAdtq,discussion-id=HT3liJXb,comment-id=0000,timestamp=2019-04-04T00:01:51.671+0000)\n>\n> Yeah, I was on a winning streak after I picked up support last week and instantly reached my promos with a free win. First game, my 1 million + mastery points Kled is 0/4 at 3 minutes, and his Jax duo is 0/2 ( tower dived at level 1 then {{summoner:12}} to lane and tower dived again while still level 1 ), runs it down mid until 0/10 and says GG then D/C's\n> \n> Not to mention the stress that was put on our Diana mid who went 1/9 vs Yasuo ( I can't even blame her, I understand the tilt ) and we basically autoloss that one, but it's ok I still have one more chance.\n> \n> Next game, OMG my Varus is 13 / 0 and I'm 1/0/14, what could ever go wrong? then all I hear from top lane is Double Kill, Double Kill, Double Kill, Enemy Rampage! Triple Kill, Godlike! An enemy is Legendary, Double Kill!\n> \n> Ended 1/9/35, once we got first tower we were literally deleted when attempting to even leave lane and now I'm back at my 67 LP\n> \n> Just a little story from my past week I thought I would share, sorry for the length : D\n\nsometimes i imagine how good it would feel to be able to sue thse feeders and put them in jail \n\n{{sticker:sg-miss-fortune}}","replies":[]},{"poster":"karolmo","date":"2019-04-04T19:00:50.433+0000","up_votes":2,"down_votes":0,"body":"Sorry for these teams, but perhaps you should've lane swapped with the top before he was 0-15 if you were stomping bot that hard tbh","replies":[]}]},{"poster":"Nea104","date":"2019-04-04T04:26:40.873+0000","up_votes":18,"down_votes":0,"body":"Riot answer, recently:\n_**\"The system is never actually against you. It works to try to match you with and against players so that you have as close as a 50/50 chance of winning every game, including promos.\"**_\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/bcQt4yeV-i-getting-really-sick-of-blantant-matchmaking-working-against-you-in-promos?comment=0012\n\n\nThis is pretty strange to read, since it is not what happens in regular matches nor **especially** in Promos.\nI would really like a true explanation, but I'm pretty sure it will never come, since it would probably reveal some weird hidden aspects about their matchmaking.","replies":[{"poster":"Hexs Fortune","date":"2019-04-04T11:37:52.679+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Nea104,realm=EUW,application-id=3ErqAdtq,discussion-id=HT3liJXb,comment-id=0005,timestamp=2019-04-04T04:26:40.873+0000)\n>\n> Riot answer, recently:\n> _**\"The system is never actually against you. It works to try to match you with and against players so that you have as close as a 50/50 chance of winning every game, including promos.\"**_\n> \n> https://boards.na.leagueoflegends.com/en/c/gameplay-balance/bcQt4yeV-i-getting-really-sick-of-blantant-matchmaking-working-against-you-in-promos?comment=0012\n> \n> \n> This is pretty strange to read, since it is not what happens in regular matches nor **especially** in Promos.\n> I would really like a true explanation, but I'm pretty sure it will never come, since it would probably reveal some weird hidden aspects about their matchmaking.\n\nIt's bound to happen, since the system can't predict many things that can affect the performance of a player","replies":[{"poster":"MonarcaVis","date":"2019-04-04T19:16:02.402+0000","up_votes":3,"down_votes":1,"body":"> the system can't predict many things that can affect the performance of a player\n\n\n... **but third party software can.**","replies":[]}]},{"poster":"Leetri","date":"2019-04-04T16:52:15.315+0000","up_votes":1,"down_votes":0,"body":"You have a 50/50 chance to win upon entering the champion select lobby, then everyone affects that ratio depending on picks, bans and interaction. If your team drafts like ass and start flaming in the chat your chance of winning goes down significantly, of course. \nOr do you honestly believe Riot programmed an AI so ridiculously smart it can predict if people will rage, troll or decide to play something they've never played before?","replies":[]}]},{"poster":"FrozenFitzgerald","date":"2019-04-04T06:08:42.226+0000","up_votes":13,"down_votes":0,"body":"Remember, the system is supposed to allow you to skip divisions too, if your MMR is higher than your rank. \n\nExcept when it doesn't work. My account is a brand new one, fresh from a transfer. While I knew that my MMR would be reset, and accepted that. I did not know, however, that my rank would be reset _differently._ While your first game will have you be silver MMR, your rank is reset to the bottom of iron. Which means that although I hard carried the first game ever played on this account, going 17/2/12 and getting a pentakill, I was placed immediately into bronze. Bronze 4. With silver MMR. \n\nSo I played some games and reached the 100 LP mark. I won my next game when I had something like an 80% win rate on my account. The tier average for my team was Silver 1 (while dragged down heftily by my Bronze rank). The tier average for the enemy team was in gold. So when I win the game that is by all accounts a gold game, and I am bronze, I am promoted only into silver 4, 0 LP.\n\nThis is especially terrible when you take into consideration that as my MMR continues to climb without my rank matching, it will become harder to win games. Meaning it will become harder to get my rank and my MMR to match anywhere decent. All this to say absolutely nothing about the games that feel incredibly rigged to prevent climbing (I was in five lobbies before playing a match. 9 players on my team had win rates that were 47% or lower. ) Try and convince me that the system is not rigged against you when you have a positive win rate.","replies":[{"poster":"karolmo","date":"2019-04-04T19:01:35.740+0000","up_votes":1,"down_votes":1,"body":"You can't skip leagues while ranking up tiers, if you rank up to silver 3 it'll rank up to silver 1.","replies":[{"poster":"MonarcaVis","date":"2019-04-04T19:21:24.235+0000","up_votes":2,"down_votes":0,"body":"I think you missed some points on what FrozenFitzgerald (NA) said.\nI feel like you just stated the obvious.","replies":[]},{"poster":"FrozenFitzgerald","date":"2019-04-05T03:33:02.843+0000","up_votes":1,"down_votes":0,"body":"You see, that would be nice. However, according to Riot's support team my MMR and my rank are not far enough apart for a division skip. The agent I talked to claims that no skip would have been warranted. Despite, if you check my last two ranked games, 14/18 of the other players in those games were silver 1 - gold 3. Apparently Gold MMR is just not high enough of a difference from bronze to warrant skipping even a single division, according to Riot support.","replies":[]}]}]},{"poster":"Thot Patrol Ashe","date":"2019-04-04T07:27:08.606+0000","up_votes":13,"down_votes":1,"body":"They are 100% rigged. Been playing sense season 3 and that has ALWAYS been the case. Youre much more likely to get boosted animals, people who havnt played a game of league in weeks, the one guy that thinks pretending to be drunk or high is cool (or actually being) yasuo mains, or tilted players that lost 8 of their last 10 games and dont forget the guy that just got a skin from a box or something but has never played more than a few arams on a champ or seen it in the lcs and thinks they can hop right into ranked and carry. Happens without fail every time. Personal worst- season 6 i had to do my g1-p5 promos somewhere around 7 or 8 times. So many ebay accounts and people acting like theyre destined to carry and auto locking stupid stuff like bard jungle.","replies":[{"poster":"Leetri","date":"2019-04-04T16:53:22.425+0000","up_votes":3,"down_votes":1,"body":"If they are rigged, which team does it rig for when there's a guy in their promos on both teams? :thinking:","replies":[{"poster":"karolmo","date":"2019-04-04T19:02:45.886+0000","up_votes":1,"down_votes":0,"body":"That is the case on maybe 5% of the promotion games, specially at higher elos. If you're a gold trying to hit platinum you get platinum 5 players, not gold players trying to rank up.","replies":[]}]}]},{"poster":"Jﾃｦbﾃｶlﾃｩ","date":"2019-04-04T05:57:25.522+0000","up_votes":11,"down_votes":0,"body":"*reads this post窶能n*is in queue for ranked game窶能n*realizes it is promo窶能n*2 people ask to switch position窶能n*jg goes afk after feeding 3 completely unnecessary kills to enemy top lane窶能n*loses game窶能n*slaps self in face with the irony","replies":[{"poster":"Thot Patrol Ashe","date":"2019-04-04T07:29:54.354+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}} ha goteem","replies":[]}]},{"poster":"Sodeb Lacudomite","date":"2019-04-04T12:00:20.387+0000","up_votes":10,"down_votes":0,"body":"It feels even worse when you're 99 LP, you win, you're at 100LP (ty for 1 LP gain), you fail two games, drop at 68 LP or so (you got only +1, but still - 16 - 16).","replies":[{"poster":"GripaAviara","date":"2019-04-04T13:15:31.683+0000","up_votes":4,"down_votes":0,"body":"try being at 99LP and getting 16 lp per win and -21lp loss, and the winning and then losing the promo to be at 60","replies":[]}]},{"poster":"Yordle Xayah","date":"2019-04-04T08:04:27.312+0000","up_votes":6,"down_votes":0,"body":"Promos are useless, gimmicky and unfair. All ranked games should matter equally. \"A way to let people experience what is like to be in a tournament\" was how Riot introduced them. Teams in tourneys play together for **MONTHS** for a common goal. That does NOT translate well to Solo Q.\n\nhttps://youtu.be/EevdEwQNjG4?t=141\n\nReally, that's the reason why they were invented. I really don't know why they still exist.","replies":[]},{"poster":"FrozenFitzgerald","date":"2019-04-05T07:19:16.396+0000","up_votes":5,"down_votes":0,"body":"Games are rigged. If you have a high win rate, the system will intentionally match you with shit players. \n\nhttps://na.op.gg/summoner/userName=aaronsuju\n\nBecause I had a high win rate, I was matched with this chucklefuck. He had, before that loss, a 15% win rate. Mine was in the seventies. Not only am I artificially restricted from climbing because while I SHOULD have skipped divisions, I could not because it was a tier promotion, instead of a division promotion. The system can, and will, fuck you in every way possible while Riot lies through their teeth about it.\n\nTake a minute for this to sink in. This guy is so bad, so fucking bad, that he lost lane in a game where he literally did not have a lane opponent. He went negative in lane against nobody, and could not take a plate. Both enemy junglers, because there were two for some reason, stayed top lane for four minutes. And he could not take a single plate despite 3 teammates telling him to do so.\n\nTell me the system is not rigged. I fucking dare you.","replies":[]},{"poster":"Slogg","date":"2019-04-04T17:33:19.145+0000","up_votes":5,"down_votes":0,"body":"Promos never have and never will make sense, even by their own standard of how MMR should be working. It literally defies all logic.\n\nAccording to Riot, the goal of matchmaking is to get your WR to be ~50% as best it can. If I am winning 60% of my games, then I am outperforming at my mmr and need to have my mmr increased until my WR drops closer to 50%.\n\nSo as an example, if I am in say Gold V. My MMR has me playing Plat V players. My WR drops to 55% from 60%. Still not perfect, but getting closer to my level. This means when I hit a promo series in gold, you are asking me to not only win 3 out of 4 games(I say 3/4 because you must win your match to hit 100lp before you can do promos, and then 2/3 in promos), or a 75% WR, but to do it against Plat 5 and possible higher players, while I'm still ranked at Gold V.\n\nOn what planet does this make any sense? There is no other option for people to win a promo series on anything but luck since you are requiring them to increase their WR substantially against players much higher than their current ranking.\n\nYou're asking a high school hooper, to become an NBA-calibre player for x amount of games so that he can be able to play college level ballers(his skill level). It's crazy talk.","replies":[]},{"poster":"Blaxonec","date":"2019-04-04T05:36:22.344+0000","up_votes":5,"down_votes":0,"body":"OP is talking about 3 games. Try the big promos - 5 games. True hell, much pain, brain dies, I try to rise.","replies":[{"poster":"Thot Patrol Ashe","date":"2019-04-04T07:33:34.913+0000","up_votes":3,"down_votes":0,"body":"Worst part is losing it on the 5th match and then having to redo the same promos like 3+ times. I end up having to quit and go play other stuff cuz i get so tilted off of other players. It's hard to think about what you could have done better when you go like 6/0 in mid lane but bot has fed a vayne/kog/jinx 10+ kills at 20 or top picked an adc like quinn then got ganked several times and fell hopelessly behind (while feeding an irelia/riven) or someone thought itd be a good idea to go first time a champ (yes all these have happened to me recently LUL)","replies":[{"poster":"Blaxonec","date":"2019-04-04T09:48:05.288+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thot Patrol Ashe,realm=NA,application-id=3ErqAdtq,discussion-id=HT3liJXb,comment-id=00060000,timestamp=2019-04-04T07:33:34.913+0000)\n>\n> Worst part is losing it on the 5th match and then having to redo the same promos like 3+ times. I end up having to quit and go play other stuff cuz i get so tilted off of other players. It's hard to think about what you could have done better when you go like 6/0 in mid lane but bot has fed a vayne/kog/jinx 10+ kills at 20 or top picked an adc like quinn then got ganked several times and fell hopelessly behind (while feeding an irelia/riven) or someone thought itd be a good idea to go first time a champ (yes all these have happened to me recently LUL)\n\nI am stubborn. It took me 3 tries to promote but I did it. Funny thing is that the first 2 times I received the teammates that OP described, the worst part of the community. The third time, I think it was the final game the enemy had some really really bad players, so i guess that they got 2 or more people for promos :D\n\nBtw the first try, the fifth game the enemy had 3 inhibitors down. Perfect time for the jungler to farm, adc to farm, mid to solo die mid, and top to just hanging around. You can not imagine how bad I felt after losing this game. All 3 inhibitors down and my team decided to delay ending it which ended up losing the game.","replies":[{"poster":"Thot Patrol Ashe","date":"2019-04-05T05:02:14.309+0000","up_votes":1,"down_votes":0,"body":"lol, in one of my recent promos i had a game 5 where we aced the enemy team 2 for 5 and had adc top and jung up and mid wave pushed at 50 mins. With long death timers we could have ended then and there i died in the teamfight as zed after i popped their adc and halfed the support, so i was down. then instead of ending they went to baron then got caught one at a time and all died then we lost. The biggest of oofs","replies":[]}]}]}]},{"poster":"Xhaiden","date":"2019-04-05T09:41:57.838+0000","up_votes":4,"down_votes":0,"body":"This  is what i have to deal with every day....\n\nhttps://i.imgur.com/l218Kug.jpg[/img}\n\nTo get Silver 2 on Flex Rank - i have beat Players from Diamond + Plat 2 (Rift) with a  team formed of Silver and Bronze. This is what team handling balance at Riot  - calls balanced Matchmaking in a Rank game.\n\n{{sticker:zombie-brand-facepalm}} \n\nThat's BULLYING in the purest form  (same as a gang of 17 year olds beating the crap out of a 12 year old).","replies":[]},{"poster":"Salty Mc Feed","date":"2019-04-04T11:12:59.772+0000","up_votes":3,"down_votes":0,"body":"Promos are pointless and annoying and suffer as much from inconsistent matchmaking as any other match, BUT they are not guaranteed to be one-sided or rigged or anything like that.","replies":[]},{"poster":"Revert Akalﾃｭ ","date":"2019-04-04T07:34:42.682+0000","up_votes":3,"down_votes":0,"body":"Something needs to be done about the state of akali too (cough cough REVERT) \n\nhowever i do agree on this matter how do i go 6-0 get a inter and afk to lose my last 2 get bronze 4 yet my friend wins 3 total and gets silver 3?","replies":[]},{"poster":"Snowman Arc","date":"2019-04-04T13:11:27.962+0000","up_votes":2,"down_votes":0,"body":"I never understood the 50/50 chance of both teams winning rule of matchmaking. If I'm smurfing and on a winstreak, does that mean that I will get a 10% winrate player on my team? League's matchmaking system is just horrible. The other day, there was a level 30 support on the enemy team in a gold 2 game. Singed support with Lethal Tempo, needless to say we won at 15 minutes. How the fuck is this fair matchmaking?","replies":[{"poster":"Karunamon","date":"2019-04-04T14:02:31.256+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=HT3liJXb,comment-id=0012,timestamp=2019-04-04T13:11:27.962+0000)\n>\n> I never understood the 50/50 chance of both teams winning rule of matchmaking.\n\nSo how elo systems work, (at least bare elo, no idea what kinda crazy shit riot does with mmr) is that each player has a performance rating (a score like 1200), and an expected result (1 for a win,  -1 for a loss). If you match up two 1200 players against each other, the expected result is 0, or a 50/50 chance of winning for each of them. The actual result will be either +.5 or -.5, and that will be used when determining the new performance ratings.\n\nThe goal for the matchmaker is to get that expected result for all 10 players as close to 0 as possible. It doesn't care about winrates, it only cares about performance over time. If someone with a 10%wr is in your game, it's because their mmr was in the same neighborhood as you. There's no consideration for giving you worse players when you're in promos.","replies":[]}]},{"poster":"Xhaiden","date":"2019-04-04T10:55:22.814+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=InfinitexMortal,realm=NA,application-id=3ErqAdtq,discussion-id=HT3liJXb,comment-id=,timestamp=2019-04-03T23:19:03.904+0000)\n>\n> Why in an mmr based system does this wall exist? If you have mmr to move up you should move up when hitting 100, if u have lower mmr you should move down when hitting 0. So why do i have to win 2/3 rigged games at 100 to move up or else drop to 68 lp?!\n> \n> I mean wtf riot. Before promos i win a game, win another game destroying the enemy so hard they cant take a tower. Then i get to promos with a free win, team cant take a single tower and feeds like crazy clearly outmatched. Next game Garen feeds 2 kills afks and the adc is ragging how they just lost the last 3 rounds and got demoted. Again no  tower taken..... I've seen enough of these promos to see that 9 times out of 10 they are far more in the enemy's favor than mine. And why if they are separate games from the 0-100 do they make you go back down to 68lp instead of 100 with a chance to win and retry them? At this point it is clearly obvious they only exist as a wall to slow down climbing in order to force people to play more games. That is poor game design and has nothing to do with an mmr based rank. \n> \n> So i ask again, Riot, what is the point of these clearly onesided promos in an MMR based ranked system other than a cheap artificially forced wall to slow progressing rank and extend required play time?\n\nTo STRUGGLE longer. This system  was made like this TO KEEP YOU STRUGGLING LONGER AND LONGER (so you spend 10x times longer in LoL).  You argue about quality content - but this system is mainly about \"QUANTITY  (keeping  most players trapped in LoL grinding and grinding for as long as possible) \".  There's literally thousands of topics where balance/mmr/matchmaking is question for being so faulty - and yet, this was the most ignored subject of all time. A mmr system made just for 0.00001% of the whole LoL community (since only top tier players from Challenger, Master and the higher division of diamond - seem to claim it works for them). Same as  you get easy wins - due to such poorly matchmaking - same you get impossible games - where the game is already lost since champ select. You're just wasting time and loosing and loosing and losing (again, impossible games) - then winning and wining and wining (free wins - where the enemy team is in your shoes dealing with close to impossible chances of win). And  that's the idea... Same as gambling systems - aimed  to keep you hooked to that experience - by exploiting  the reward system in our brain  (the release of dopamine whenever you win a game). \n\nJust think about all the games you played in Rank recently and out of 100 games -  how many games did both teams really struggled for a Win - due to being balanced?  洟ｨ","replies":[]},{"poster":"CarameI Frappe","date":"2019-04-04T04:23:43.796+0000","up_votes":3,"down_votes":1,"body":"Cause they want you to grind since it'll mean you'll be continuing to play their game? The more you play, the more tempted you are to buy their skins / stuff which means you'll want to climb to show off how good you are at their game. Basically, they want you addicted.","replies":[]},{"poster":"pyeonghwaa","date":"2019-04-04T07:38:18.934+0000","up_votes":2,"down_votes":2,"body":"The moment you accept the fact that Riot isn't here to make our gaming experience actually better you will enjoy league a lot more. You wanna advance? 5-man is the sad answer OR a ridiculously good duo partner. They will never fix the promo wall just like they will never implement a fair reporting system. Instead, they'll continue to be lazy much like another game very similar to this. Heck, I once got a comm ban for saying \"Man, sorry I played that like a total noob!\" ... Good times when talking about yourself triggers a ban of any sort =)","replies":[{"poster":"Phreaktastic","date":"2019-04-05T15:38:09.670+0000","up_votes":1,"down_votes":0,"body":"You don't get chat restricted for one comment or one game. That may have been the catalyst, and it sounds like it was a mistake, but you didn't get the restriction from that alone. You get punished after multiple reports spanning multiple games. \n\nThat begs the question, however... If you got reported in that game for self deprecation, were the other flags raised due to similar behavior? If so, that's pretty ridiculous, and is a prime example of their \"punish first\" system which relies 100% on automated garbage. Self deprecation exemplifies why their system fails so miserably... You can definitely get flagged for playing as Sona and saying \"wow this Sona is trash\", meanwhile someone who trolls all their games will go largely unpunished, because they don't want to ban someone who is legitimately trying yet plays poorly. All a troll has to do is refrain from chatting while trolling. \"TK grabbed you and walked you into the enemy team? No problem, at least he didn't say, 'Sorry I played like a noob'\" -Rito.","replies":[{"poster":"pyeonghwaa","date":"2019-04-08T06:30:51.614+0000","up_votes":1,"down_votes":0,"body":"I call BS because I have 1 game right now with the attached text and it got me a 25 game chat ban .. Only game showing as the reason as well ...\n\nGame 1\nPre-Game\npyeonghwaa: why so toxic again?\nIn-Game\npyeonghwaa: invading?\npyeonghwaa: ez jg ;-/\npyeonghwaa: dude hit that between minions ;-/\npyeonghwaa: no actuall you are for sitting in the turret fighting\npyeonghwaa: muted\npyeonghwaa: gg report morde plz.\npyeonghwaa: toxic ... he dies under turret n it's my fault\npyeonghwaa: starts cussing me out etc etc\npyeonghwaa: keep pinging on me and i'll casual this match\npyeonghwaa: muting all\npyeonghwaa: gl\npyeonghwaa: if we win i'll be why BUT everyone is super toxic .. so sad this community\npyeonghwaa: super relaxed homie .. im laughing at them tbh\npyeonghwaa: now they throwing .. good times :smiley:\npyeonghwaa: oooo another mute :D\npyeonghwaa: plays yi ... is doing decent .. talks trash .. typical\npyeonghwaa: see u say that BUT you'll report me though i haven't been toxic once :smiley: .. yet i should go back to middle school shrug\npyeonghwaa: aftger this blue i'll push mid with it\npyeonghwaa: lmao ...\npyeonghwaa: i'm dead no matter what with no flash bud\npyeonghwaa: learn the game, then talk man .. being on yi + trash talking makes you look silly buddy =)\npyeonghwaa: sure.. i'll play a champ i care to play i guess\npyeonghwaa: these guys were toxic in loby\npyeonghwaa: wp\npyeonghwaa: come\npyeonghwaa: thx .. got 2k+ gold from your death :-(\npyeonghwaa: /all\npyeonghwaa: heh no game sense ..\npyeonghwaa: gg wp all\npyeonghwaa: why luck? why do i need it? unless we're talking about getting non-toxic folks in the game.\npyeonghwaa: i'll need a lot of l uck for that cause these guys made me not feel like playing from the start tbh ;-(\npyeonghwaa: i am? aww shucks\npyeonghwaa: i forgot this was a smurf and i could care less ...\npyeonghwaa: ouch, that's rude man\npyeonghwaa: guess i kinda stay extra for you too :-(\npyeonghwaa: man, if only i was good :-(\npyeonghwaa: i mean, heck i'd maybe pick the right runes too .. which i didn't :-/\npyeonghwaa: cause hail of blades xin is something .. maybe?\npyeonghwaa: not really .. was full of childish behavior ;-/\nPost-Game\npyeonghwaa: sigh, time to go down the list.\npyeonghwaa: not really\npyeonghwaa: if u do you will lose if my team is nice\npyeonghwaa: thx was just about to report you too\npyeonghwaa: GG Jesus .. was fun i guess?\n\n-----------------------\n\nExplain what was honestly so toxic because I can't see it ... It's quite pathetic that the ai auto-comm banned me for this game. When 6-7 of the players were actually toxic to me the entire match and I barely had a little fun with them","replies":[{"poster":"Phreaktastic","date":"2019-04-10T20:27:25.702+0000","up_votes":1,"down_votes":0,"body":"Yeah, your chat is toxic.","replies":[]}]}]}]}]}