{"poster":"ManteQuiIa","date":"2015-03-04T18:27:12.695+0000","title":"Matchmaking Normal MMR nicht von Ranked MMR Trennen","subforum":"Foren-Feedback","up_votes":5,"down_votes":3,"body":"Hallo zusammen ,\r\n\r\ndashier ist in erster Linie an Riot gerichtet aber gerne dürft ihr auch euren senf dazu geben.\r\nIch bin der Meinung ihr solttet die \"normal\" MMR abschaffen. Damit auch in normalen Spielen halbwegs faire Matches zustande kommen. Ich persönlich bin es leid immer mit Silberleuten gegen Platins und Diamond antreten zu müssen nur weil diese \"High\" Elo spieler eine niedrige normal MMR haben. (Ich möchte damit keinem low Elo spieler zu nahe kommen) Aber fakt ist : Können spiegelt als Erfolg wieder indem sie auch einen hohen Rang bekleiden (sofern es kein Ebay Account ist). Ich verstehe nicht weshalb beide MMR Klassen getrennt werden. Ich meine was bringt es einem Plat/Dia spieler denn wenn er sagt ich möchte einen neuen Champ trainieren und spiele deshalb normals.. Dennoch hat HighElo das Spielverständnis eines HighElo spieler und gewinnt seine Lane/Match im handumdrehen.. damit trainiert er sich doch auch nicht wirklich auf sein wirklich Können im HighElo bereich? Desweiteren könnte das Matchmaking ja wenigstens versuchen die Teams auszugleichen aber stattdessen werden HighElo auf eine Seite und die LowElo spieler auf die andere Seite geparkt.. Ich denke das System versucht eine Winchance von 50/50 zu erreichen. Ich kann euch genügend bilder schicken indem man den Eindruck hat es Spielen Pro vs Noobs.. Optisch gesehen von den Rankings natürlich.\r\n\r\nNein ich bin nicht Ranked Restricted und ja im Ranked würde ich gegen Leute meiner Division antreten. \r\nIch spiele den Normal Mode einfach lieber weil er einfach stressfreier ist als die ganzen Tryharder im Ranked die nur an LP denken. Verständlich ich würde auch nicht absteigen wollen und mich anstrengen. Darum finde ich normals wie gesagt stressfreier ... sofern der Skill der Leute auch ungefähr gleich und das ist er nicht indem man Plat/Dia gegen Silver/Gold Unranked spielen lässt.\r\n\r\nIch hoffe RIOT ihr versteht das irgendwann und Trennt Ranked MMR nicht von normal MMR damit sollten meiner Meinung nach weitaus fairere Matches zustande kommen.\r\n\r\nWenn nicht dürf ihr mich hier gerne vom gegenteil überzeugen.\r\nmfg","replies":[{"poster":"HyperionCH","date":"2015-03-06T10:09:20.318+0000","up_votes":1,"down_votes":0,"body":"Persönlich finde ich diese Idee nicht ganz so gut.\n\nZwischen Normal und Ranked gibt es recht viele Unterschiede:\n\n- Unterschiedliche Pick-Varianten bei Normal (Blindpick, Draft und TB)\n- Unterschiedliche Anzahl Premade-Zahl möglich (zwischen 1-5 möglich in Normals)\n- in Normals keine Skill-Einschränkung bei Premades (z.B. Dia1 kann mit Bronze5 Premade spielen)\n- in Normals werden grundsätzlich neue Champs geübt (bzw. Champs, die man noch nicht gut kann); in Rankeds werden die Main-Champs gespielt, die man wesentlich besser kann.\n\nLetztens kam bereits dieses Thema und ich verglich es mit den Tennis-Weltranglisten.\n\"Djoker\" ist derzeit im Einzel die Weltnummer 1. Im Doppel ist er auf Platz 330 oder so (müsste wieder nachschauen). Er ist natürlich immer noch ein Spitzen-Tennisspieler, übt aber selten Doppel (höchstens für den Davis Cup, den aber viele Einzel-Spieler nicht wirklich fokusieren). Da Doppel doch etwas anders gespielt wird, ist er dort auch nicht der beste.\nDie besten Doppel-Spieler hingegen spielen nur Doppel (gar nicht in der Einzel-Weltrangliste eingetragen) und würden in den meisten Fällen einen Djoker (mit einem \"Djoker-Klon\" als Doppelpartner) wohl schlagen; weil Einzel und Doppel zu unterschiedlich sind.\n\nNormal + Rankeds sind auch zu unterschiedlich (siehe Aufzählung oben). \nWas würde passieren, wenn man Rankeds in der Normal-MMR miteinbezieht:\n\n- Die Normal-MMR ist wohl bei allen etwas höher (zumindest jene, die Normals und Rankeds spielen). Dies heisst z.B.:\n\n- Goldspieler, die in Normals auf Silberniveau spielen (da sie dort neue Champs üben), spielen nun gegen Gold und feeden dort.\n- Unrankeds (die keine Rankeds spielen) mit Silberniveau, kriegen nun die oben erwähnten Goldspieler nicht mehr (obwohl sie in Normals gleich stark spielen). Dafür kriegen sie nun Silberspieler, die in Normals Bronze-Niveau haben (übt in Normals ebenfalls neue Champs); und ärgern sich dann, dass dieser Mate feedet.\n\nAus meiner Sicht werden die Teams so unausgeglichener.","replies":[]},{"poster":"LuckyLinus","date":"2015-03-05T03:17:41.034+0000","up_votes":1,"down_votes":0,"body":"Was passiert denn dann mit den Leuten, die nur normals spielen? Wie werden die denn dann gematcht, wenn das normal-MMR wegfällt?","replies":[{"poster":"ManteQuiIa","date":"2015-03-05T23:00:40.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LuckyLinus,realm=EUW,application-id=MvEdi5IX,discussion-id=Efm6Vswz,comment-id=0002,timestamp=2015-03-05T03:17:41.034+0000)\n>\n> Was passiert denn dann mit den Leuten, die nur normals spielen? Wie werden die denn dann gematcht, wenn das normal-MMR wegfällt?\n\nspielen gegen andere unrankeds ???? problem gelöst ?","replies":[{"poster":"4 R4nd0m N008","date":"2015-03-06T08:47:28.798+0000","up_votes":1,"down_votes":0,"body":"Klar der Unranked mit 100 Normal Wins kann sich bestimmt sehr gut gegen den Unranked mit 1500 Wins halten...","replies":[]}]}]},{"poster":"MahouShoujoRakka","date":"2015-03-06T00:19:31.602+0000","up_votes":1,"down_votes":0,"body":"Blödsinnige Idee.\nIch kann dir so sagen, dass ich auch in Normals mit Champs, die ich sonst nie spiele, meist ziemlich übel auf den Deckel kriege, weil meine MMR im Normal nicht wesentlich schlechter ist als im Ranked. Umso mehr, weil ich in letzter Zeit sehr viel 5er Premade spiele. Im Ranked werd ich im schlechten Fall zusätzlich halt noch als useless trash beschimpft, was von der Wahrheit nicht besonders weit entfernt ist.\nDazu spiele ich in meinen 5er Premade Teams auch häufiger mit Spielern aus Bronze-Gold zusammen(da hauptsächlich nach Benehmen selektiert) und bisweilen passieren da Dinge, die deiner Logik nach unmöglich sein dürften:\nIch feede als \"Platin-Pro\" auf der Toplane dämlich rein, meine Silber-Midlane stellt sich gut an und die lowgold-Botlane carried das Spiel hart durch.\nZum Teil habe ich mich an den \"Pro-Spielstil aus Platin\" auch schon so angepasst, dass ich mir einige Dinge angewöhnt habe, die als ADC mit einem Supporter mit weniger Spielerfahrung(und vice versa, zum Teil auch als Jungler beim ganken) einfach nur richtig in die Hose gehen.\nAls Beispiele kann ich dir da nur die Varus-Spiele in meiner jüngsten Match-History ans Herz legen. Auch in den Spielen, wo ich Kennen/Caitlyn gespielt habe, hab ich mich wahrlich nicht mit Ruhm bekleckert, obwohl die Skillspannweite in beiden Teams recht breit war.\n\nDen \"Faceroll\" von dem du hier sprichst, erlebe ich trotz dieser teils sogar \"unausgeglichenen\" Matches ausgesprochen selten.\n\nUm auch ein bisschen konstruktiv zu sein, gut fände ich folgende Anpassungen:\n\nDie ersten Platzierungsspiele eines neuen Accounts orientieren sich zumindest ein wenig an der Normal-MMR.\nund\nBei längerer Abwesenheit von Normal Games werden die nächsten Spiele elotechnisch stärker gewichtet, so dass der Spieler schneller seine Normal-MMR auf ein realistisches Niveau bringen kann.\n\nAnsonsten ist es gerade im Teambuilder auch das Matchmaking. Ich wurde neulich in meinem ~90ten Teambuilder-Match auf der Toplane ohne(!) Matchmakinganpassung mit meinem ungefähr meistgespielten Champ gegen einen low-Silberspieler mit first time Cho'Gath gematcht, der gerade etwa sein ~40tes TB-Match spielte. Beide Spieler mit Spielzahlen, wo die MMR schon ungefähr passen sollte. Aber das Matchmaking war trotzdem irgendwie grauenhaft.","replies":[]},{"poster":"Bergelmir32","date":"2015-03-04T19:55:19.013+0000","up_votes":1,"down_votes":0,"body":"Vielleicht die normal MMR nicht unbedingt gleichsetzen mit der Ranked MMR aber eine Verbindung sollte da schon bestehen, die Möglichkeiten sind ja mannigfaltig.","replies":[]},{"poster":"Reshanras","date":"2015-03-04T19:01:29.978+0000","up_votes":1,"down_votes":0,"body":"Denk' ich mir auch oft und kann ich so nur unterschreiben.","replies":[]}]}