{"poster":"Kingsgrave","date":"2015-07-28T23:52:00.014+0000","title":"@Meddler Will there be Item reworks for AD Caster Assassins and not just for ADCs and Bruisers?","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Bruisers are apparently getting items that are a mix of Offense and Defense that will appeal directly to them which is great\r\n\r\nADCs will get more varied items that probably have more to do with specific playstyles rather than buying the same build every game which sounds amazing \r\n\r\nBut\r\n\r\nReworking both of these sets of items screws over the following Champs that don&#039;t really have any set items made for them and are forced to buy a mixture of the 2:\r\n\r\n{{champion:92}} {{champion:91}} {{champion:107}} {{champion:35}} {{champion:121}} {{champion:238}} {{champion:126}} {{champion:6}} {{champion:80}}","replies":[{"poster":"Meddler","date":"2015-07-29T00:50:37.094+0000","up_votes":6,"down_votes":0,"body":"So far we're happy with how the AP changes have gone, which bodes well for the fighter/general defense item changes coming soon. If that goes well we'll likely look at marksmen items afterwards, with AD assassins one of the likely possibilities after that. Again though, that's dependent on these changes producing the sort of results we're hoping for. If the upcoming changes don't work out well we'll have to reassess our plans.","replies":[{"poster":"Decrit","date":"2015-07-29T01:41:47.193+0000","up_votes":1,"down_votes":0,"body":"Since ye are here.... ever tought about making crit rate a worthwile stat for assassins, both in terms of gameplay and efficency? I mean, having gated times where you can work and deal huge damage like the Ekko passive looks very assassinish, but so far is too much reliant on luck.\n\nI know there are crit changes on the plank, just asking in case you tought something preventive, like you did for ashe, for some items or what else.","replies":[]},{"poster":"Kingsgrave","date":"2015-07-29T00:57:09.092+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=J74Bnv6u,comment-id=0001,timestamp=2015-07-29T00:50:37.094+0000)\n>\n> So far we're happy with how the AP changes have gone, which bodes well for the fighter/general defense item changes coming soon. If that goes well we'll likely look at marksmen items afterwards, with AD assassins one of the likely possibilities after that. Again though, that's dependent on these changes producing the sort of results we're hoping for. If the upcoming changes don't work out well we'll have to reassess our plans.\n\nHopefully you guys can figure out how to give strength to AD Casters in Items without bruisers abusing them. I always wanted Spell Vamp for stuff like pantheon so I don't have to build tanky.","replies":[]}]},{"poster":"FalconPawwwwnch","date":"2015-07-29T00:14:50.293+0000","up_votes":3,"down_votes":4,"body":"Yea how about no\n\nLast time they did anything to help ad casters the pen formula screwup and Black Cleaver stacking happened","replies":[{"poster":"KONO RUBICK DA","date":"2015-07-29T02:07:26.966+0000","up_votes":2,"down_votes":3,"body":"don't know what it is downvoted\n\nTalon has hit 60% win rate","replies":[]}]}]}