{"poster":"Kingsgrave","date":"2015-05-24T21:19:03.504+0000","title":"@Lyte Super Toxic player here who has had at least a combined number of 10000+ chat bans","subforum":"[ARCHIVED] Miscellaneous","up_votes":53,"down_votes":7,"body":"Ever since the new banning system was implemented I have had little to no reason to go about my normal way of hating, flaming and insulting out of boredom because I know i'll just be muted, reported and then dealt with immediately after the game instead of getting a random ban sometimes a month or two later. \n\nI have various mental illnesses and live on Disability. I'm basically a failure of a person who can't work or go to school, or do anything besides play League and browse the internet. I would take out my boredom and frustration with the world on literally anyone I came in contact with because nothing ever happened when I did so. Until now anyway. Now I started to realize how my words and actions affect people. \n\nI know it's pathetic that it takes a threat of a real ban for me to realize this, but it is what it is. I suppose that's why I'm disabled among other things (namely 6 mental illnesses, Schizo/Aspergers/Anxiety/Depression/Intermittent Explosive Disorder/Rapid Cycling Bipolar)\n\nIt wasn't until this system was implemented that I realized how fucked up I was being towards people, not only in game but in person. My therapist and friends have noticed a significant positive change as of a few days ago.\n\n**I just wanted to thank Riot and Lyte personally for showing me the error in my ways.**","replies":[{"poster":"ShaftyMegee","date":"2015-05-24T21:31:40.041+0000","up_votes":11,"down_votes":81,"body":"So you don't work, and you stay at home raging at people on the internet? I'm fucking paying for you to live? I'm starting to dislike this country more and more every day.","replies":[{"poster":"Kingsgrave","date":"2015-05-24T21:37:52.738+0000","up_votes":22,"down_votes":1,"body":"> [{quoted}](name=SanicSenpai,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0000,timestamp=2015-05-24T21:31:40.041+0000)\n>\n> So you don't work, and you stay at home raging at people on the internet? I'm fucking paying for you to live? I'm starting to dislike this country more and more every day.\n\nI write and do other things, but yeah I guess.","replies":[{"poster":"ShaftyMegee","date":"2015-05-24T21:58:00.207+0000","up_votes":3,"down_votes":56,"body":"Do you make your own money to live? or does everyone else have to keep you afloat?","replies":[{"poster":"Kingsgrave","date":"2015-05-24T22:02:56.402+0000","up_votes":33,"down_votes":1,"body":"> [{quoted}](name=SanicSenpai,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=000000000000,timestamp=2015-05-24T21:58:00.207+0000)\n>\n> Do you make your own money to live? or does everyone else have to keep you afloat?\n\nI'm incapable of living on my own or supporting myself, its why I have disability. I was homeless for 6 months before I met a guy who is now my friend that I live with. \n\nI'm working with a therapist and various other things to get into something like writing or back to school in like 5-10 years.","replies":[{"poster":"qetzel","date":"2015-05-24T22:09:42.017+0000","up_votes":39,"down_votes":0,"body":"Good luck, mate. It is good to know that you are on your way.","replies":[]}]},{"poster":"Kingsgrave","date":"2015-05-25T03:24:44.091+0000","up_votes":20,"down_votes":1,"body":"> [{quoted}](name=SanicSenpai,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=000000000000,timestamp=2015-05-24T21:58:00.207+0000)\n>\n> Do you make your own money to live? or does everyone else have to keep you afloat?\n\n4000 a year of your taxes goes towards the Middle East. Less than 300 or so goes towards Welfare. Which are you more comfortable with?","replies":[]},{"poster":"Timewinder","date":"2015-05-25T02:40:03.985+0000","up_votes":22,"down_votes":3,"body":"Hey asshole: if you care so much about it, then why don't you try to find a cure for it instead of sitting on the computer bitching at someone with a mental illness? How sick-minded do you have to be to do this? It's not like he chose to have 6 mental illnesses. I for one am willing to pay a little bit of extra money to help support this guy.","replies":[]}]}]},{"poster":"ChaoticPinecone","date":"2015-05-25T01:02:03.824+0000","up_votes":10,"down_votes":1,"body":"then leave. seriously. \n\nif you like it outside of this country, thats great - make a good living, have a great life, and you wont dislike your country. if you dont, then come back and stop talking trash.","replies":[{"poster":"Kingsgrave","date":"2015-05-25T02:06:56.242+0000","up_votes":11,"down_votes":0,"body":"> [{quoted}](name=ChaoticPinecone,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=00000003,timestamp=2015-05-25T01:02:03.824+0000)\n>\n> then leave. seriously. \n> \n> if you like it outside of this country, thats great - make a good living, have a great life, and you wont dislike your country. if you dont, then come back and stop talking trash.\n\nI don't even know where he'll go. Pretty much every modern country has welfare unless he wants to move to places like India that have entire parts of the country filled with poor people.","replies":[]}]},{"poster":"qetzel","date":"2015-05-24T21:53:31.093+0000","up_votes":24,"down_votes":1,"body":"Come on, mate. Mental illness is serious.","replies":[{"poster":"ShaftyMegee","date":"2015-05-24T21:59:03.796+0000","up_votes":4,"down_votes":57,"body":"It is serious, but I don't want to fucking pay for someone else's probLems.","replies":[{"poster":"qetzel","date":"2015-05-24T22:07:57.843+0000","up_votes":26,"down_votes":2,"body":"It is a disability as serious as any other.\n\nAre you really so insensitive that you wouldn't give a tiny, tiny, tiny fraction of your income to someone who is unable to work. \n\nAs a fraction of your taxes do you know how much goes to disability? A practically insignificant amount to each individual.","replies":[{"poster":"AbodyHUN666","date":"2015-05-25T15:32:18.248+0000","up_votes":5,"down_votes":0,"body":"He must be the kind of person who wouldn't give pension to old people until he becomes one.","replies":[]}]},{"poster":"MalzaharAnyLane","date":"2015-05-25T02:15:49.823+0000","up_votes":13,"down_votes":9,"body":"To be fair, conservatism is a vastly worse mental disorder than anything he listed.\n\nIt's a constant state of paranoia and greed disguised as family values and various oversimplified black and white worldviews.\n\nIf they don't understand the fundamental concept that taxes for disability and the safety net are a literal requirement for a civilized society, and therefore so is attempted rehabilitation of every prisoner and mental patient, then they are either going to end up dead early from self-inflicted stress or left in a home.","replies":[{"poster":"MidEvilKnight3k","date":"2015-05-25T12:29:03.237+0000","up_votes":7,"down_votes":1,"body":"Trying to maintain an atmosphere where people strive to produce for their own needs rather than rely on free handouts is important for any civilized society as well.\n\nI just finished a year as a volunteer teaching high school science and math on the island of Yap Micronesia.  The people here are very family oriented in some ways, so that if anyone is sick or can't afford food they are taken care of.  This is very good.  But on the other hand, child abuse is very common, and many parents completely neglect their children.  All the money that is not needed for food or supplies is used on movies and beer.  Many parents wake up before their kids to go to work, after work they go to the bar and don't get back until their kids are asleep again.  We have decent schools here so there is a way out, but many of the kids here do not care about school, and many of the parents do not care about their kids schooling either.  There is a way out, but they don't care.\n\nBasically, there is a safety net here that makes sure you will have food.  The other living conditions are often terrible, they do not have any specialists at the hospital.  Many people die of 'old age' in their 50s (anyone in their 70s is considered really old).  And most living accommodations are not built to survive typhoons (two strong ones hit the island this year).  So you would think they would aspire to improve their living conditions, or at the least encourage their kids to do more with their lives.  But they do not.\n\nConservatism is the idea that people need to be encouraged to take responsibility for their own lives.  As a result the lives of the people around them will be improved as well (you will dispute this part, but it is the idea and I am not going to write another essay).  Conservatism is not a mental illness, though it can be rather heartless.  \n\nThe primary goal of conservatism is to make sure the average person produces more.  That way the average person can consume more.  The secondary goal is to make sure those who have below average income earn enough to afford food and a decent place to live.  Without production, consumption is impossible.\n\nI don't know the OP, so I cannot judge whether or not he needs disability.  I will presume he does need it, and he is one case where welfare has done good.\n\nAlso, you should not use the term 'mental illness' as a way of insulting something.  It is insulting to people with real mental illnesses.","replies":[]},{"poster":"Ariel the Cruel","date":"2015-05-25T02:46:01.273+0000","up_votes":2,"down_votes":0,"body":"http://www.catherineshafer.com/history.html\n\nShould be an entertaining read.","replies":[]},{"poster":"Gavran","date":"2015-05-25T03:55:00.876+0000","up_votes":3,"down_votes":2,"body":"Believe whatever you want\n\nPersonally I stay the hell out of politics\n\nbut shuuuuuuuut the fuck up jesus","replies":[]}]}]}]}]},{"poster":"BlunterMonk","date":"2015-05-24T23:47:02.021+0000","up_votes":7,"down_votes":5,"body":"If you have a mental illness... the internet probably isn't a safe place to be.","replies":[{"poster":"Kingsgrave","date":"2015-05-24T23:52:24.819+0000","up_votes":22,"down_votes":1,"body":"> [{quoted}](name=BlunterMonk,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0001,timestamp=2015-05-24T23:47:02.021+0000)\n>\n> If you have a mental illness... the internet probably isn't a safe place to be.\n\nThe internet is a far safer place than the outernet.","replies":[{"poster":"RasCaelestis","date":"2015-05-25T05:07:29.530+0000","up_votes":10,"down_votes":0,"body":"Unfortunately, you're right.  Good luck with your treatments.","replies":[]},{"poster":"air tiger","date":"2015-05-26T11:57:14.542+0000","up_votes":1,"down_votes":0,"body":"Yea, it can definitely be..\n\nJust wanted to say thanks for improving your behavior, and that I hope your mental conditions lighten as an effect of your conscious changes in behavior.  Mental disease isn't easy on anyone involved, and if you are living/dealing/coping in a positive way, all the more power to you.","replies":[]}]},{"poster":"Sir Yamazuki","date":"2015-05-25T14:18:43.973+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=BlunterMonk,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0001,timestamp=2015-05-24T23:47:02.021+0000)\n>\n> If you have a mental illness... the internet probably isn't a safe place to be.\n\nMuch easier to find understanding people, or even those who relate to you through the internet. I've been dealing with General Anxiety, severe depression, ptsd, and schitzoaffective disorder for years and no one around here was really supportive other than my mom. In fact, anyone I knew from school actually stopped talking to me really once they found out I was dealing with a lot of problems since I was hospitalized for a month, as no one ever knew since I was quiet and general don't like to 'complain'. Meanwhile, on the internet I've been able to meet people with similar issues and my longest friendships, 7 yrs and another one 11 years were thanks to the internet.\n\nNot only do I get to make some friends or acquaintances over the internet, but I also get to learn about what I am dealing with or really anything I would want to know. It also allows me to do something I've always enjoyed without spending money, since I don't work and don't spend my disability money on games, I can just use any desktop, pay for internet and then proceed to play any f2p game with my best friend.","replies":[]}]},{"poster":"lDontLiftIcarry","date":"2015-05-25T01:31:43.278+0000","up_votes":11,"down_votes":0,"body":"What did I fucking tell you about swearing?\n\nGod damn it.\nLearn to be polite.","replies":[{"poster":"Kingsgrave","date":"2015-05-25T03:22:49.573+0000","up_votes":14,"down_votes":0,"body":"> [{quoted}](name=lDontLiftIcarry,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0002,timestamp=2015-05-25T01:31:43.278+0000)\n>\n> What did I fucking tell you about swearing?\n> \n> God damn it.\n> Learn to be polite.\n\nOh fucking shit, I'm sorry.","replies":[]}]},{"poster":"Hand Hanzo","date":"2015-05-25T03:14:14.217+0000","up_votes":3,"down_votes":2,"body":"I have Asperger's and live on disability too. But...you don't see me flaming and raging.  I don't have all that other shit though.\n\nIs medical marijuana legal in your state? Look into getting a weed card.","replies":[{"poster":"Kingsgrave","date":"2015-05-25T03:23:03.161+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Hand Hanzo,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0006,timestamp=2015-05-25T03:14:14.217+0000)\n>\n> I have Asperger's and live on disability too. But...you don't see me flaming and raging.  I don't have all that other shit though.\n> \n> Is medical marijuana legal in your state? Look into getting a weed card.\n\nMarijuana is a felony in Idaho\n\nYeah I have Aspergers combined with several other things and terrible parents with a terrible childhood. Not every person with it is like me.","replies":[{"poster":"Gavran","date":"2015-05-25T05:03:18.206+0000","up_votes":1,"down_votes":0,"body":"I have anxiety and depression too, do you think I can get paid to not work?\n\n(No seriously I've worked three months since I graduated from college five years ago... going to therapy and shit, but it'd be nice to get some help while I try to work on me.)","replies":[{"poster":"Kingsgrave","date":"2015-05-25T11:16:21.244+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gavran,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=000600000000,timestamp=2015-05-25T05:03:18.206+0000)\n>\n> I have anxiety and depression too, do you think I can get paid to not work?\n> \n> (No seriously I've worked three months since I graduated from college five years ago... going to therapy and shit, but it'd be nice to get some help while I try to work on me.)\n\nif it is serious enough that it impacts your ability to do work related tasks and medication doesn't help, probably. I get panic attacks in public.","replies":[{"poster":"Gavran","date":"2015-05-25T12:25:19.958+0000","up_votes":2,"down_votes":0,"body":"It feels like it's so hard to define that though. :\\ I do fine in classroom settings with the exception of presentations and similar, but then most people don't like public speaking. Then again, I imagine most people don't ditch classes when they have finished presentations they're too anxious to give. I feel mostly functional but I have so much interview anxiety I'm a mess every time and thus leave a horrible impression. I can't get up the nerve to make important phone calls like... ever (I'm actually not in therapy right now because of that...) And then there's the little stuff like, I used to get sick to my stomach with anxiety driving to class for the first day after the weekend...\n\nBut if I get to know the people I'm working with I can make small talk and stuff and generally be fine. For that matter, I actually worked as a cashier for a while and was able to handle it. The interaction being so procedural helped, I think. What was the process like to make it happen for you? As far as I know I've never been like, officially \"diagnosed\" but I was on Lexapro for some time. Honestly the psychiatrist basically just said \"You have anxiety and want to try Lexapro? Okay\" which doesn't feel like a diagnosis.\n\nBut I mean, my anxiety and depression have definitely been holding me back. I graduated high school at 15 and got my BA at 18, you don't go from that to doing absolutely nothing with your life for no reason right?\n\nBlahhhh I'm rambling. What was the process to see if you were eligible and were you somehow officially diagnosed first as a requirement?","replies":[{"poster":"Kingsgrave","date":"2015-05-25T13:46:12.142+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gavran,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=00060000000000000000,timestamp=2015-05-25T12:25:19.958+0000)\n>\n> It feels like it's so hard to define that though. :\\ I do fine in classroom settings with the exception of presentations and similar, but then most people don't like public speaking. Then again, I imagine most people don't ditch classes when they have finished presentations they're too anxious to give. I feel mostly functional but I have so much interview anxiety I'm a mess every time and thus leave a horrible impression. I can't get up the nerve to make important phone calls like... ever (I'm actually not in therapy right now because of that...) And then there's the little stuff like, I used to get sick to my stomach with anxiety driving to class for the first day after the weekend...\n> \n> But if I get to know the people I'm working with I can make small talk and stuff and generally be fine. For that matter, I actually worked as a cashier for a while and was able to handle it. The interaction being so procedural helped, I think. What was the process like to make it happen for you? As far as I know I've never been like, officially \"diagnosed\" but I was on Lexapro for some time. Honestly the psychiatrist basically just said \"You have anxiety and want to try Lexapro? Okay\" which doesn't feel like a diagnosis.\n> \n> But I mean, my anxiety and depression have definitely been holding me back. I graduated high school at 15 and got my BA at 18, you don't go from that to doing absolutely nothing with your life for no reason right?\n> \n> Blahhhh I'm rambling. What was the process to see if you were eligible and were you somehow officially diagnosed first as a requirement?\n\nI knew about Aspergers for my entire life, found out about Anxiety and Depression when I dropped out of College. Became homeless and ended up in various state mental hospitals. Ended up there after trying to kill myself during an episode in a fish processing factory in Alaska. After I left I ended up with a job in a grocery store and had a mental breakdown again. Doctors and therapists recommended I go with disability and that's how I started with the application process. \n\nHonestly just ask a therapist what they think. Psychiatrists are full of shit. They just force medicine onto people. Therapists actually care.","replies":[{"poster":"Gavran","date":"2015-05-25T14:31:17.690+0000","up_votes":1,"down_votes":0,"body":"Well that's definitely worse than anything I've done to myself. ._. I hope I don't come across too badly. That makes sense though. I haven't ever really felt that I got a ton of help from therapy, but I've never regretted it. I didn't like the psychiatrist. I wouldn't say she didn't care about our issues at all, but it's definitely a much less personal approach. The only reason I went to see her and tried Lexapro is because my dad said it worked well for him.\n\nStill don't have a therapist at the moment though. Trying to work on that. Got like a consent form thing to let someone else make the calls for me. Had it for weeks but... ugh. Seems like a reasonable thing to talk to a therapist about when I get that going though. At least makes more sense than awkwardly asking some random guy on the League forums what he thinks.\n\nThanks, by the way. Being completely honest here, when I read the OP I kinda took you for a jerk only behaving because you're forced to but that's not fair. I don't get angry really, but man it's a real struggle that I often fail for me to not be a coward sometimes. It sucks that you couldn't control yourself before, but I'm genuinely glad this is working for you. My brother had some of my issues coupled with a learning disability. He was actually on Lexapro too, and I'd be lying if I said that wasn't part of why I stopped taking it. I've never made an attempt myself or been quite that low. But\nI'm glad you're coping, that's my point.","replies":[{"poster":"Kingsgrave","date":"2015-05-25T14:36:49.376+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Gavran,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0006000000000000000000000000,timestamp=2015-05-25T14:31:17.690+0000)\n>\n> Well that's definitely worse than anything I've done to myself. ._. I hope I don't come across too badly. That makes sense though. I haven't ever really felt that I got a ton of help from therapy, but I've never regretted it. I didn't like the psychiatrist. I wouldn't say she didn't care about our issues at all, but it's definitely a much less personal approach. The only reason I went to see her and tried Lexapro is because my dad said it worked well for him.\n> \n> Still don't have a therapist at the moment though. Trying to work on that. Got like a consent form thing to let someone else make the calls for me. Had it for weeks but... ugh. Seems like a reasonable thing to talk to a therapist about when I get that going though. At least makes more sense than awkwardly asking some random guy on the League forums what he thinks.\n> \n> Thanks, by the way. Being completely honest here, when I read the OP I kinda took you for a jerk only behaving because you're forced to but that's not fair. I don't get angry really, but man it's a real struggle that I often fail for me to not be a coward sometimes. It sucks that you couldn't control yourself before, but I'm genuinely glad this is working for you. My brother had some of my issues coupled with a learning disability. He was actually on Lexapro too, and I'd be lying if I said that wasn't part of why I stopped taking it. I've never made an attempt myself or been quite that low. But\n> I'm glad you're coping, that's my point.\n\nWell if you ever need someone to talk to or want more info about the mental health system, just add me on League.","replies":[]}]},{"poster":"Artty of Alaska","date":"2015-05-26T00:09:32.969+0000","up_votes":1,"down_votes":0,"body":"Where in Alaska?\n\nAlso +1 for the post and follow-up discussion, I could see how it might be difficult to bring this up on the Internet and am glad you had the courage to do so. It's also nice to see support from a community widely considered toxic. Keep on keeping on mate.","replies":[{"poster":"Kingsgrave","date":"2015-05-26T11:19:20.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Artty of Alaska,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0006000000000000000000000001,timestamp=2015-05-26T00:09:32.969+0000)\n>\n> Where in Alaska?\n> \n> Also +1 for the post and follow-up discussion, I could see how it might be difficult to bring this up on the Internet and am glad you had the courage to do so. It's also nice to see support from a community widely considered toxic. Keep on keeping on mate.\n\nI had a job with North Pacific Seafood working with Red Salmon fish processing in Naknek for like 2-3 weeks.","replies":[]}]}]}]}]}]}]}]},{"poster":"AnonymousEnigma","date":"2015-05-25T07:06:08.845+0000","up_votes":7,"down_votes":0,"body":"jesus fucking christ... the hate on this board is real.  I have depression (moderate), and i cant imagine how it must feel to be this guy.  He's trying to get a job, and it's not his fault that he has mental illness.  There is no \"cure\" for a lot of these things... dont talk about what u dont know","replies":[{"poster":"Kingsgrave","date":"2015-05-25T11:17:32.448+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=AnonymousEnigma,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0009,timestamp=2015-05-25T07:06:08.845+0000)\n>\n> jesus fucking christ... the hate on this board is real.  I have depression (moderate), and i cant imagine how it must feel to be this guy.  He's trying to get a job, and it's not his fault that he has mental illness.  There is no \"cure\" for a lot of these things... dont talk about what u dont know\n\nWell I gave up trying to get a job a while ago after I got fired for the 4th time. Now I live off of disability.","replies":[]}]},{"poster":"FreshMeat707","date":"2015-05-25T02:00:37.686+0000","up_votes":6,"down_votes":0,"body":"CynicalGiant, congrats man. Coming back from being toxic in League is like quitting smoking(not that i know what that's like but i have a pretty good guess), except like 10x worse. Welcome to rebirth, we accept you as you come.\n\nWelcome back, brother.","replies":[{"poster":"N30NP4NDA","date":"2015-05-25T13:10:42.528+0000","up_votes":1,"down_votes":0,"body":"HEM HEM\ndo not say that \"we\" accept him, most people likely don't. the average League player will only accept you if you grovel at their feet.","replies":[{"poster":"FreshMeat707","date":"2015-05-25T19:56:51.700+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=N30NP4NDA,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=00030000,timestamp=2015-05-25T13:10:42.528+0000)\n>\n> HEM HEM\n> do not say that \"we\" accept him, most people likely don't. the average League player will only accept you if you grovel at their feet.\n\nMy apologies, i tend to actually give people second chances.","replies":[]}]}]},{"poster":"Ixlin","date":"2015-05-25T10:22:06.767+0000","up_votes":5,"down_votes":0,"body":"Honestly, buddy, kudos to you.\nI get how difficult it is to work through mental illness.  Good on you for never giving up, and actually listening when people are trying to help.  Most important first steps, in my opinion.  Way to go.","replies":[]},{"poster":"aaronconlin","date":"2015-05-25T03:38:05.749+0000","up_votes":5,"down_votes":0,"body":"At least you're aknowledging that you've done wrong, and it seems to be working in your favor. Good luck with your therapist and writing, I hope it works out for you","replies":[{"poster":"Kingsgrave","date":"2015-05-25T03:55:14.421+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=aaronconlin,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0007,timestamp=2015-05-25T03:38:05.749+0000)\n>\n> At least you're aknowledging that you've done wrong, and it seems to be working in your favor. Good luck with your therapist and writing, I hope it works out for you\n\nThanks fellow Aaron, haha","replies":[]}]},{"poster":"Tomatosx","date":"2015-05-25T03:04:45.192+0000","up_votes":3,"down_votes":0,"body":"This won't happen overnight so don't get mad at yourself for being toxic the next couple of days if someone pushes your buttons.","replies":[]},{"poster":"YOU BEEN WARNED","date":"2015-05-25T05:35:24.255+0000","up_votes":5,"down_votes":2,"body":"You mean to tell me this post isn't sarcastic??????\n\nI'm .. I'm not buying this.","replies":[{"poster":"Kingsgrave","date":"2015-05-25T14:38:13.051+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YOU BEEN WARNED,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0008,timestamp=2015-05-25T05:35:24.255+0000)\n>\n> You mean to tell me this post isn't sarcastic??????\n> \n> I'm .. I'm not buying this.\n\nBelieve it or don't. It doesn't matter.","replies":[]}]},{"poster":"AnuTaurus","date":"2015-05-25T18:33:14.080+0000","up_votes":1,"down_votes":0,"body":"I'll think twice now about asking if the person flaming me is retarded. I promise to make it sound more sweet. Glad you came around it but did all of those mental illnesses really cause you not to think about other people?","replies":[{"poster":"Kingsgrave","date":"2015-05-25T19:42:40.873+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Xhuky95,realm=EUW,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=0010,timestamp=2015-05-25T18:33:14.080+0000)\n>\n> I'll think twice now about asking if the person flaming me is retarded. I promise to make it sound more sweet. Glad you came around it but did all of those mental illnesses really cause you not to think about other people?\n\nI have a lot of sociopathic traits combined with schizophrenia and aspergers. I almost never realize the consequences of my actions or understand how people will react to what I say or do. I know what their literal reaction would be but no sense of weight towards it if you know what I mean.","replies":[]}]},{"poster":"GROMMI","date":"2015-05-25T14:25:10.361+0000","up_votes":2,"down_votes":0,"body":"Proud of your reform, Cynical","replies":[]},{"poster":"N30NP4NDA","date":"2015-05-25T13:08:23.068+0000","up_votes":2,"down_votes":0,"body":"God damn, you are explaining my life... except for the good part","replies":[{"poster":"Kingsgrave","date":"2015-05-25T14:36:25.903+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=N30NP4NDA,realm=NA,application-id=cIfEodbz,discussion-id=glIjFMj0,comment-id=000d,timestamp=2015-05-25T13:08:23.068+0000)\n>\n> God damn, you are explaining my life... except for the good part\n\nIf you ever need someone to talk to just add me on League.","replies":[]}]}]}