{"poster":"Reeucito","date":"2016-01-07T08:07:58.449+0000","title":"Hagamos un trato, que les parece?","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":"Bueno como dice el titulo.\r\n\r\nYa que el servidor anda para atras, muchos Usuarios se estan quejando y a la mayoria no nos deja jugar. Quiero saber si RIOT no nos puede dar un pase a otro pais.\r\nNo estaria mal, para aquellos que quieran migrar su cuenta. Es una opcion  y capaz el dia de ma&ntilde;ana cuando el servidor ande mejor vuelvan.\r\nEstaria bueno que nos dieran la oportunidad de elegir que servidor migrar nuestra cuenta.","replies":[{"poster":"NoxusOP15","date":"2016-01-07T08:12:21.601+0000","up_votes":6,"down_votes":1,"body":"Hagamos un trato, fíjate la verdadera causa del porque del lag y luego postea la verdad y no lo que la gente desinformada dice, te parece?","replies":[{"poster":"Reeucito","date":"2016-01-07T08:17:21.612+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=NoxusOP15,realm=LAS,application-id=v7qsfXsE,discussion-id=t7N4kyYR,comment-id=0000,timestamp=2016-01-07T08:12:21.601+0000)\n>\n> Hagamos un trato, fíjate la verdadera causa del porque del lag y luego postea la verdad y no lo que la gente desinformada dice, te parece?\n\nPrimero que nada, yo reviso el foro antes de entrar el servidor. No soy un ignorante. Si hay causa del \"lag\" ahora ya lo se. \nYo lo que estoy planteando es una oportunidad para migrar la cuenta nada mas. Pero la mayoria de los Users esta cansada de no poder jugar. El problema ya desde el 29 que eran las fibras opticas que esto y que lo otro, y ahora es un problema de \"Arnet\" o \"Telefonica\"?\nSolamente pido que nos den la posibilida de migrar nuestra cuenta a un servidor nada mas. No echo la culpa a nadie solamente quiero saber si se podra o nos daran la oportunidad esa.\nNo estaria mal ya que hay  varios post diciendo \"Chau LAS, hola BR\" es un decir...","replies":[{"poster":"NoxusOP15","date":"2016-01-07T08:19:23.630+0000","up_votes":4,"down_votes":1,"body":"Pues no te va a pasar nada por no jugar 2 semanas un juego. No te da plata ni te extiende la vida. Piensa, aprovecha a salir por ahí mientras el juego esta así, puedes liberar tu cabeza de los molestos trolls y afk´s.","replies":[{"poster":"Reeucito","date":"2016-01-07T08:21:20.578+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=NoxusOP15,realm=LAS,application-id=v7qsfXsE,discussion-id=t7N4kyYR,comment-id=000000020000,timestamp=2016-01-07T08:19:23.630+0000)\n>\n> Pues no te va a pasar nada por no jugar 2 semanas un juego. No te da plata ni te extiende la vida. Piensa, aprovecha a salir por ahí mientras el juego esta así, puedes liberar tu cabeza de los molestos trolls y afk´s.\n\nQuédate tranquilo que no me paso las 24 horas jugando. Me molesta que digan esas cosas cuando solamente estoy planteando una propuesta nada mas tampoco estoy buscando votos positivos. Pero bueno a esperar entonces, y a disfrutar de las vacaciones como lo vengo haciendo.","replies":[{"poster":"NoxusOP15","date":"2016-01-07T08:25:56.873+0000","up_votes":2,"down_votes":0,"body":"Bien, no te alarmes, es un juego, luego vendra la solucion (supongo xd). Dudo que alguien este literalmente 24 horas jugando, seria aterrador.","replies":[]}]}]}]},{"poster":"Merion","date":"2016-01-07T08:12:49.134+0000","up_votes":2,"down_votes":0,"body":"+10","replies":[]},{"poster":"NoxusOP15","date":"2016-01-07T08:16:58.434+0000","up_votes":1,"down_votes":0,"body":"Y no, Riot no dará nada porque los servidores no se distribuyen en países (desinformado o error, me tiro mas por la primera), se distribuyen en regiones, LAS (que no tiene lag, es ageno el lag a LAS), LAN, EUW, NA, BRASIL, etc","replies":[]}]},{"poster":"Khimea","date":"2016-01-07T11:07:13.538+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/dlGOmbQ9-conectividad-intermitente-con-isps?comment=0014","replies":[]},{"poster":"Cyclosarin","date":"2016-01-07T10:34:22.803+0000","up_votes":1,"down_votes":0,"body":"Noxus, estoy leyendo varios posts tuyos que veo no entiendes muy bien el problema que padecemos que es AJENO a nosotros. No es nuestra conexión el problema, ya que si juegas en Brasil, juegas increiblemente bien (yo juego con Arnet y un ping de 50 clavados que JAMAS tuve en LAS, mi mejor ping fue 70.... y fue hace muuucho)\n\nMe gusta la propuesta y una vez pregunté al soporte si se podía hacer, lamentablemente me dijeron que no, pero creo que deberíamso insistir, porque el juego hace casi 2 semanas es injugable.\n\nSaludos!","replies":[]}]}