{"poster":"AVLxm ezüh","date":"2015-05-21T19:17:44.602+0000","title":"Basta de gente troll en lobby de ranks","subforum":"Comportamiento del jugador","up_votes":204,"down_votes":20,"body":"Hola, est&aacute; propuesta ya la hab&iacute;a hecho hace maso menos 2 a&ntilde;os, nunca le dieron bola... Esperemos que hoy en d&iacute;a, se tome en cuenta:\nCada vez que entramos a jugar nuestras RANKS GAMES, hay discusiones de lineas... algunas personas lo toman a mal, y empiezan a flamear, no respetan el ORDER PICK, e incomodan a todos los player con su actitud negativa... entre otros problemas.\nLA PROPUESTA: Que riot cree un tipo de plugin, para que los jugadores, podamos votar si deseamos \"kickear\" o no, a los jugadores con este tipo de comportamiento.. la idea seria gr&aacute;ficamente algo as&iacute;:\n****\n*Si 3 jugadores estamos de acuerdo en kickear al jugador \"flamer\" este plugin, autom&aacute;ticamente deber&iacute;a de kickearlo y sacarlo de la cola de rank, con una pena de 5 minutos (acumul&aacute;ndose por cada kick recibido).\n- Si te gusto la propuesta, y estas cansado de gente molesta no olvides VOTAR SI.\n\n\nMás que nada este post esta hecho por la gente molesta que en el \"LOBBY RANKS\" dice: \"voy a trollear...\" y al minuto 10 de la partida, regala mas de 20 kills apropósito, seguramente a muchos les pasó este tipo de situación, o entre otras los trolls que están INACTIVOS pero usan el chat para flamear en plena partida.... y muchos otros.\n\nAclaro que la idea se basa más que nada, en \"RANKS GAME\".\n\nSaludos.","replies":[{"poster":"Fake Sun","date":"2015-05-21T20:39:46.315+0000","up_votes":26,"down_votes":46,"body":"Esto no funcionaria porque si vos queres pickear algo para carrear por ejemplo en oro con tryndamere top, y a los otros 4 no les guste y te echen.. eso simplemente no tiene sentido","replies":[{"poster":"AVLxm ezüh","date":"2015-05-21T21:29:13.704+0000","up_votes":81,"down_votes":13,"body":"Si te hechan, es porque esos 4 no entienden NADA DEL GAME... seria mejor para vos; antes que jugar con 4 tontos que no entienden nada.. :)","replies":[{"poster":"noentiendo64","date":"2015-05-22T06:21:04.073+0000","up_votes":18,"down_votes":0,"body":"aunque no entiendan nada del game, sera desagradable que quieras jugar con tu main, que puede ser un campeon poco comun, y q por gente \"especial\" tengas q esperar 5 minutos mas para hacerlo y si te sucede 2 veces son 15 en total, mas el mismo tiempo q te encuentras en el lobby","replies":[]},{"poster":"DSNNO","date":"2015-05-22T03:48:47.522+0000","up_votes":4,"down_votes":3,"body":"Bien dicho.","replies":[{"poster":"PaladinZero","date":"2015-05-22T03:50:56.111+0000","up_votes":10,"down_votes":1,"body":"Aun asi no serviria, ya que el kickeado estaria recibiendo penalizaciones constantemente y segun el diseño de la idea es de forma negativa... lo que indica que estas haciendo tu las cosas mal.. y no el resto.","replies":[]}]}]}]},{"poster":"BlaxZtar","date":"2015-05-21T19:44:35.797+0000","up_votes":14,"down_votes":30,"body":"Claro que no, mucha gente seria kickeada sin hacer nada malo.\nes como si estas solo en un team con otros 4 que son premade, tu juegas mal, ellos te dicen troll, te reportan los 4 y te banean la cuenta :)","replies":[{"poster":"BlaxZtar","date":"2015-05-21T19:46:17.040+0000","up_votes":53,"down_votes":8,"body":"lo mejor que podrían hacer es hacer un ''pide linea'' antes de entrar a ranked, que elijas 3 líneas, por ejemplo, \n1- Clasificatoria/Individual\n2- Que línea iras? Top 1 mid 2 jg 3 \n3- que te emparejen con otros 4 con diferentes elecciones  a las tuyas.","replies":[{"poster":"SantiUruGames","date":"2015-05-21T20:18:03.858+0000","up_votes":1,"down_votes":1,"body":"up  {{summoner:14}} {{item:3025}}","replies":[{"poster":"BlaxZtar","date":"2015-05-21T22:24:53.421+0000","up_votes":7,"down_votes":6,"body":"Aquí otro ejemplo.\nEstas en ranked en Bronce 3 y eres main poppy\nvas top con poppy, a la gente no le gusta ese champ, te kickean\nDejen de quejarse de las ranked, la verdadera razón por la que pierden es por falta de skill, si quieren practicar tienen las normals y las vs bots.","replies":[{"poster":"AVLxm ezüh","date":"2015-05-21T22:59:57.344+0000","up_votes":6,"down_votes":0,"body":"nunca te toco una persona que dijera, voy a trollear y regalaré kills ???\nvayne liga oro 5 > 0-20-0 minuto 12:00\neh visto muchos casos asi, que en pleno LOBBY dicen \"VOY A TROLLEAR\"\ny terminan haciendo esto ;)","replies":[{"poster":"Rowlink","date":"2015-05-22T07:02:31.223+0000","up_votes":1,"down_votes":8,"body":"y porque entonces no te saliste de la partida?? 5 min no es tanto como para que no los puedas esperar","replies":[{"poster":"NirthaL","date":"2015-05-22T07:48:58.646+0000","up_votes":17,"down_votes":0,"body":"Porque eso es imitar a la realidad social que vive gran parte de Latinoamérica, donde siempre gana el delincuente. Si tu te sales, pierdes tiempo y 3lp, si te quedas es muy probable que pierdas 40 minutos y 15-30 lp, si ganas, la experiencia sera mala de todas maneras por el estrés que causa tener que jugar con el troll en el equipo, además de que si ya pierdes 3 lp, entrar con miedo a que te toque otra persona así... eso es algo que no tendría que ocurrir.\n\nEl juego le da tanta autoridad a un individuo para que solamente con su presencia pueda causarle el mal a otras 4 personas, las víctimas saldrán perdiendo independientemente de la decisión que tomen, SIEMPRE, y aunque 3 lp no sea tanto (si estas en promo es peor) las víctimas NUNCA ganan; única y exclusivamente por 1 sola persona que tu no puedes controlar. {{item:3041}}","replies":[]}]}]}]}]},{"poster":"PaladinZero","date":"2015-05-22T03:51:24.596+0000","up_votes":6,"down_votes":0,"body":"Para esto existe el creador de equipos... ahora.. la idea deberia verse implementada en ranked... que es otro punto.","replies":[]},{"poster":"Main Eventer","date":"2015-05-21T22:16:54.549+0000","up_votes":2,"down_votes":2,"body":"Me loggee para decirte que eso pasaría como con el Team Builder. La gente tiene poca materia gris y dice \"No lo uso porque tarda\". Claro que va a tardar si no lo usan xD En fin, ponele que solo el 20% del server le gusta/sabe jugar de supp. Ese puesto estara muy poco requerido siempre y se tradarían 15 o 20 minútos encontrar un supp.\n\nAhora, tomando lo que decís, el sistema puede ser de rotaciones y límites, algo así:\n\n-Solo se puede jugar 3 veces una misma linea\n-Cuando se termine ese límite, debes escoger la siguiente linea a jugar\n-Así con cada linea y luego se reinicia\n\nEl problema con esto es la queja de los \"main\" de cada linea, ya que no podráin jugar su mejor posición. Así que este sistema debería probarse en normales durante bastante tiempo.\n\nOtro es hacer un quick shoot: pide tu linea.\n\n-Te aparecen 5 opciones y debes cliquear la que quieras. Si lo hiciste rápido te quedas con esa linea, si no no.\n-Cuando se trate de Ranked, se bloquean todos los personajes que no pertenezcan a esa linea en concreto y solo podrá elegir entre su pool de champs que vayan a esa linea. De esta manera, los demás jugadores no comenzarían la partida amargados porque me eligio Soraka Top.","replies":[{"poster":"Dr Dandan","date":"2015-05-22T06:31:09.885+0000","up_votes":3,"down_votes":0,"body":"puede que vos quieras ir lux supp o nida, que pasa ahi? te la consideran? o la consideran troll?","replies":[]}]},{"poster":"Blind Monk GG","date":"2016-03-28T16:22:40.337+0000","up_votes":1,"down_votes":1,"body":"Deseo concedido","replies":[{"poster":"BlaxZtar","date":"2016-04-04T18:38:33.147+0000","up_votes":2,"down_votes":1,"body":":D! {{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"AVLxm ezüh","date":"2015-05-21T21:27:39.563+0000","up_votes":2,"down_votes":0,"body":"EL TITULO DICE \"LOBBY RANK\", es para \"RANK GAME\" y no para \"NORMAL GAME\", ya que eso si seria una muy desagradable desventaja. saludos.","replies":[]}]},{"poster":"Böna","date":"2015-05-22T00:52:44.399+0000","up_votes":9,"down_votes":0,"body":"Prefiero que este esto antes que nada. Sin embargo, creo que deberia haber un sistema que por ejemplo si un jugador esta afk mas de 5 minutos, automaticamente la ranked pasa a ser \"derrota evitada\" y obviamente el que se fue afk sea penalizado con algun tipo de ban temporal y pierda puntos. {{summoner:14}}","replies":[]},{"poster":"Critical Strike","date":"2015-05-21T23:30:50.150+0000","up_votes":14,"down_votes":5,"body":"66 VOTOS NO, 66 POSIBLES TROLLS.","replies":[]},{"poster":"Dragunity","date":"2015-05-21T20:16:44.977+0000","up_votes":7,"down_votes":0,"body":"Solo en rankeds, xq sino te toca un premade de 3 en normals y entran a kickear gente...","replies":[]},{"poster":"Saori de Atenea","date":"2015-05-22T06:04:31.667+0000","up_votes":6,"down_votes":0,"body":"no creo que vaya a funcionar. los primeros 3 días parecería que si. pero después todo lo que tiene que hacer el que este troleando es comportarse en la sala y al minuto que empiece la partida ponerse a trollear. no cambiara casi en nada la verdad.","replies":[]},{"poster":"Uncrystal Poet","date":"2015-05-21T21:15:06.851+0000","up_votes":6,"down_votes":1,"body":"El teoría funciona, pero deberías completar la idea. Por ejemplo, si el jugador es eliminado, el lobby entraría en espera. A un jugador random, le aparecería \"partida encontrada\" donde al poner \"aceptar\" entra directamente al lobby que se encontraba en espera. Debería haber requisitos para poder eliminar al jugador. Por ejemplo, no sé, que Riot haga un cuestionario que no sea siempre el mismo, sino que, por ejemplo, hagan unas 300 preguntas o algo así, de las cuales 20 aparezcan en el cuestionario. Según la respuesta, el jugador será calificado para evaluar. Las preguntas podrían ser de casos puntuales del LoL, evaluando comportamientos, o algo así, o preguntando qué harían ellos. No debería ser muy claro cuál es la respuesta CORRECTA, así es más difícil (para los trolls, o los que publican las respuestas correctas) encontrar cual es la mejor. Además, de respuesta debería haber unas... 10-15 opciones, las cuales son elegidas azarosamente de unas... 50? Algo para que tarden en \"hackear\" el sistema, tal que le de tiempo a Riot de renovarlo, ya que todos tratarían a toda costa de estar calificados para hacerlo.\nEn el lobby debería haber, mínimo, 2 calificados. Cosa que 2 jugadores puedan restringirle el chat por toda la partida, limitándolo a utilizar frases dispuestas por Riot, además de los pings de aviso, si es que realmente necesita decir algo como \"yo pusheo, ustedes distraigan\" o algo así. Si 3 jugadores deciden echarlo, podrán sacarlo del lobby. Los minutos deberían acumularse de a 5 entre los lobbys de una semana, es decir, se renueva semanalmente, donde no hay límites de ban. Así como una, dos, 5 horas. En realidad, podría haber un mínimo de un solo jugador apto para evaluar a los demás. Si este jugador tiene la insignia verde o amarilla, podría ver quién de su equipo ha sido echado anteriormente. De esta forma, le darían un sentido a las insignias de honor de invocador, las cuales a nadie le interesan hoy en día porque no ganan ningún privilegio. La insignia roja podría... no sé, representa a un jugador muy hábil, pero no significa que bueno. Le podrían dar algún bonus semanal... así como el privilegio de elegir su número de pick en ranked (first pick, second... etc). No es algo jodido. No soy diseñador de juegos, pero reconozco que no debe ser complicado para una empresa experta como Riot Games. Después de todo, en primer lugar sería hacer la evaluación. A más tardar podría tardar un mes y medio en hacerlo. Supongan que 3 meses después, cosa que la mayoría de los invocadores haya hecho la evaluación, lanzar el update. Podrían regalar 575 (más los 400, sumado 975) rp al que haya aprobado la evaluación, cosa de que el que no tiene plata para, pueda comprarse la skin de su champ favorito como premio de su gran intelecto de invocador, pero no a todos... tal vez al que tenga más del 80-85% de las respuestas correctas.\nRiot no implementa las ideas así porque no desmuestran interés al ver que están incompletas porque no evaluaron todos los puntos de vista. Lo que acabo de decir lo puede complementar. Creo que si trabajara en Riot, me darían algo de pelotas por proponer algo así de completo (obviamente que si trabajara allá, tendría más conocimiento, de forma que lo haría más viable y más completo)\n¿Qué opinan?","replies":[]},{"poster":"Hiliori","date":"2015-05-23T03:34:28.943+0000","up_votes":4,"down_votes":0,"body":"Desde mi humilde punto de vista esta idea esta mal, ya se ha comprobado que si le das herramientas con poder a un jugador ese las usa de mala manera, voy a dar un ejemplo, en temporada 4 jugue 61 partidas con tristana mid con un porcentaje de win/ratio de 59%, el problema esta en que el servidor tiene gente inexperta o gente sorete que no les gusta tu pick, si yo soy first pick en ranked y quiero pickear tristana o gp en mid estoy en mi derecho, si juego mal ellos estan en su derecho de reportarme al final de la partida, y sobre lo que dije de darle herramientas a un jugador me refiero a los problemas ya conocidos que ocurrieron en NA y EUW donde las personas utilizaban el tribunal para banear personas de distintas nacionalidades, algo que ocurria mucho en la temporada 2.\nAhora si vamos al grano, lo ideal seria un sistema para reconocer si un jugador trollea, o simplemente juega mal.\n\nPor ultimo, no metan excusas si no pueden subir de ligas, es improbable (no imposible) que tengan trolls y afk en cada partida, ademas no confundan a un troll con un mal jugador. \nGracias por leer.","replies":[]},{"poster":"Welfin","date":"2015-05-22T18:34:11.184+0000","up_votes":4,"down_votes":0,"body":"...","replies":[]},{"poster":"Tyrant Rex","date":"2015-05-21T22:19:00.244+0000","up_votes":4,"down_votes":0,"body":"La verdad esta buena la idea pero ya sabemos como es riot,les chupa un huevo...","replies":[{"poster":"AVLxm ezüh","date":"2015-05-21T22:52:57.564+0000","up_votes":4,"down_votes":1,"body":"jajaja, estamos en 2015.... esperemos que NO!!! xD saludos.","replies":[]}]},{"poster":"Heslakrin","date":"2015-05-21T19:39:51.895+0000","up_votes":2,"down_votes":8,"body":"para eso cierras lol y esperas. no encuentro conveniente el decidir entre un troll o un 4vs5. es una forma mas bonita de perder el tiempo.","replies":[{"poster":"AVLxm ezüh","date":"2015-05-21T21:34:17.666+0000","up_votes":6,"down_votes":0,"body":"prefiero perder el tiempo, y no las RANKS por gente NEGATIVA :)","replies":[]}]},{"poster":"stekan","date":"2015-05-23T00:48:36.283+0000","up_votes":3,"down_votes":0,"body":"y si hay gente que kickea de gusto para trolear","replies":[]},{"poster":"Geo Stampede","date":"2015-05-22T16:58:47.021+0000","up_votes":3,"down_votes":0,"body":"Yo creo que el problema de este \"metodo\" que planteas es el siguiente: \nVolvamos a la Season 3, a finales de esta. En eso momentos, Taric estaba bastante potente y se lo había empezado a jugar en Top, pero no todos estaba de acuerdo. Yo era uno de los que jugaba Taric top y no lo jugaba mal. Mas de una vez me bardearon en la fase de picks, o sea, en el lobby, y los terminé carreando. \nSi esta función hubiese estado implementada, yo hubiese tenido que esperar 45 minutos por sanciones injustas por algo que la mente cerrada de algunos bobitos no entendían. No sé si me explico bien. Sería equivalente al smite en top en este parche, que al principio nadie quería ver a alguien jugando con smite en top y ni bien arrancaba el game ya pedían report...","replies":[]},{"poster":"El Matitrol","date":"2015-05-22T13:51:12.658+0000","up_votes":3,"down_votes":0,"body":"De hecho, seria mejor que pusieran mas condiciones para los jugadores cuando empiezan a jugar rankeds, en vez de solo tener 16 campeones. \nTener por lo menos 500 victorias en normal, 14 paginas de runas y 25 campeones, por que hay taaanto pajaron por ahi que dice, \"no se junglear\", \"no me gusta ir de support\", maineo top con X personaje y queda 0/7...","replies":[]},{"poster":"TeteXpress","date":"2015-05-22T11:25:20.865+0000","up_votes":3,"down_votes":0,"body":"Me parece una mala idea. Tiene buenos argumentos, pero el motivo por el cuál no lo votaría es:\n\n-Muchas veces te toca una partida donde querés ir con tu main y al equipo no le gusta, o les gustaría otro que quizás no sabés usar, no sería justo que porque mi equipo se cree coreano YO me tenga que aguantar 5 minutos en espera, y si por casualidad me toca otro emparejamiento donde se pelean o algo, podría ir acumulando de a 5 minutos, cosa que ya perder sólo 5 te desanima completamente.\n\n-El troll muchas veces dice en el lobby \"voy a trollear\" pero creo que son muchas más (y me ha pasado en las rankeds que jugué) donde se enoja por algo y trollea. A mí me trollearon una promo porque el soporte lasthiteó a 3 minions.\nLa tristana se enojó y se fue afk 10 minutos, volvió y empezó a regalar kills. Y en el lobby era puro amor, eso no tenés forma de darte cuenta.\n\n-\"Se ven las partidas en lolking\", me ha pasado, y seguramente a muchos también 2 cosas.\n La primera es ir en racha de derrotas y luego ganar 1 o 2 partidas. No sería justo querer jugar y que por haber perdido varias rankeds alguien diga \"con vos no juego por troll, mirá tu kda\" (cosa que vi o que en mitad de la partida te dicen \"tu kda es un asco\").\n La segunda es el troll ocasional. Que viene bien pero se enoja en una sola partida y te arruina el juego. Eso es imposible de ver (suelo mirar el perfil de los trolls, una tristana que trolleó al enemigo venia de una racha de victorias, cosa inexplicable. Pero sin siquiera discutir con su equipo, decidió trollear una partida).\n\nEsos son mis dudas con el sistema que proponés.\n\nLo único que me parecería correcto es si simplemente te sacan de la cola de emparejamiento.\nNo hay nada más molesto que jugar con personas que ya empezás discutiendo, o con un troll que se metió en la cola, lo llamaron a comer y puso \"voy a trollear\" para ver si alguno se sale y no perder él los puntos.\n\nPero ahí hay un problema. Si yo me salgo por mi cuenta de la selección de campeón, me ponen derrota en promoción y me sacan LP. \nSi yo pidiera que me voten negativo podría salirme sin perder eso.\n\nPor ese motivo creo que no se implementaría. O por la molestia de perder 5 minutos esperando porque \"querían un jungla tanque\" o porque estaría la salida fácil de \"vótenme que me llaman a comer\".","replies":[]},{"poster":"3Railgun","date":"2015-05-22T16:03:03.005+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Geo Stampede","date":"2015-05-22T16:53:16.258+0000","up_votes":3,"down_votes":0,"body":"Patético que fomentes la xenofobia en un thread que no tiene nada que ver con nacionalidades.","replies":[]}]},{"poster":"EzrealSupportOP","date":"2015-10-24T03:39:46.504+0000","up_votes":2,"down_votes":0,"body":"Riot ya se pronuncio al respecto, no se va a implementar ningun tipo de votekick durante la seleccion de campeones por el potencial abuso que le daria la comunidad.\n\nEste consejo les doy, porque Ezreal Support soy!{{champion:81}}","replies":[]},{"poster":"Armitael","date":"2015-05-22T19:06:41.694+0000","up_votes":2,"down_votes":0,"body":"Mira es buena propuesta pero que no sea con penalización y te diré porque.\n\nEn caso que entras en una cola premade y tomas la posición de otro jugador, te pueden echar perfectamente  y sin ninguna evidencia que indique que seas un troll.\nEsta bien que se le eche, pero sin penalización ya que igual no estará en tu partida y si sigue trolleando a menos que cambie no podrá jugar. \nAdemás hay muchos jugadores que prueban cosas y que dan resultados, por ejemplo ayer vi 6 partidas con heimerdinger jg y dejó la escoba en todas, digo que se pueda echar a un jugador pero sin penalización\n\nMi humilde opinión","replies":[]},{"poster":"nifu","date":"2015-05-22T19:04:30.050+0000","up_votes":2,"down_votes":0,"body":"a mi . me gusta troliar en aram. esta mal? la tipica 1 vs 5 con sion la ganas","replies":[]},{"poster":"dRs Ktorobayo","date":"2015-05-22T15:41:52.181+0000","up_votes":1,"down_votes":1,"body":"buena propuesta aunque eso de respetar ''order pick'' viejo eso no existe se hacia antes porque era por elo y los ''jugadores con mas habilidad'' escojian lo que querían pero ahora es aleatorio es estupido eso aveces hay gente que toma x linea que no la sabe jugar tan bien pero la toma porque no quiere ir supp y el main de esa linea que aviso entrando a la partida se queda sin poder jugarla lo cual normalmente termina en que el jugador que tomo la linea diga ''nose jugar tan bien x linea'' mientras va 0-4 al min 10 perdiendo en farm y sin torre","replies":[{"poster":"Geo Stampede","date":"2015-05-22T16:55:40.257+0000","up_votes":2,"down_votes":0,"body":"Cuando era por elo pasaba lo mismo. El 4to no queria ir support, el 5to había avisado que era main adc, pero el 4to pickeaba adc (auunque no supiera lasthittear) con tal de no ir support. \nEl orderpick no se basaba en el elo, no era una jerarquización en base a \"¿Qué tan bueno eres?\". Era una \"norma\" que se estableció para tener un nivel de organización al menos mínimo.","replies":[]}]},{"poster":"Vi Of Violence","date":"2015-05-22T00:45:05.568+0000","up_votes":2,"down_votes":0,"body":"INSTANTÁNEAMENTE SI","replies":[]},{"poster":"Lol of Legends","date":"2015-05-21T20:08:40.955+0000","up_votes":3,"down_votes":3,"body":"Me encanto tambien estaria piola como un modulador de ping en la seleccion de champ y que halla una seleccion  de linea para que no te puedan robar linea {{champion:37}} ","replies":[{"poster":"Dr Dandan","date":"2015-05-21T20:51:00.608+0000","up_votes":2,"down_votes":0,"body":"hay un modo de juego para eso...","replies":[]}]},{"poster":"Rollocan","date":"2015-05-21T19:46:48.114+0000","up_votes":2,"down_votes":0,"body":"muy buena idea pero estaría buenísimo  espero riot lo tenga en cuenta muy buen aporte, lo compartiré.","replies":[]},{"poster":"blue Ndiss","date":"2015-05-21T19:44:45.042+0000","up_votes":2,"down_votes":0,"body":"nunca se me hubiera ocurrido eso. la verdad si lo pusieran seria mucho mejor y mas seguro jugar rankeds","replies":[]},{"poster":"benvoide","date":"2015-05-21T19:50:59.609+0000","up_votes":3,"down_votes":1,"body":"Saludos.\nEn principio suena a una idea espectacular... pero creo que deberías tener en cuenta lo mucho que implican sistemas así.\nCuando lanzás nuevas mecánicas o ajustes, siempre tenés gente que lo explota al máximo, a veces para bien y otras (la mayoría) para el mal.\nVeo que muchos enseguida se valen del _Riot no lo va a implementar_, pero pensá que detrás de una decisión así podés tener jugadores que _trollean a la inversa_, es decir te _kickean trolleando_, haciendo lo que se supone el sistema debía evitar y peor aún, dejandote con 5 minutos (o más) de espera. \nCon que un duo bot (por ejemplo), decida que no podés jugar porque no le gusta el Ziggs que pickeaste, ya tenés dos votos en contra por que sí, por troll.\nEn fin, y esto es por poner sólo un ejemplo. No digo que no haya alternativas o mejoras, pero creo que es importante destacar que hay más variables en juego de lo que parece.","replies":[]},{"poster":"theJanZSoul","date":"2015-05-21T19:28:34.111+0000","up_votes":3,"down_votes":1,"body":"ES LO MEJOR!!!","replies":[]},{"poster":"KissMy","date":"2015-05-21T20:29:46.029+0000","up_votes":2,"down_votes":5,"body":"no suma nada la idea esto es un juego   se pierde o se gana   si no te gusta el team o vez un flamers  o troll en selec. salite y listo  no vas a perder una entrada a la lcs o jugar con faker en una final   solo  min perderias unos puntos y max una promo y q  no se pierde el mundo  x eso  mejor dejate de llorar  y anda  al panel de control y  busca  desintalar programas  ya  q viendo comentarios ya se discutio esto hace 2 años","replies":[{"poster":"AVLxm ezüh","date":"2015-05-21T21:37:05.162+0000","up_votes":2,"down_votes":1,"body":"el tema amigo es que no me gusta la gente que en PLENO LOBBY, EMPIEZA A FLAMMEAR... INSULTANDO Y MOLESTANDO A TODOS.\nsaludos.","replies":[]}]}]}