{"poster":"trolledallmylife","date":"2016-03-10T12:49:43.121+0000","title":"Gold has more noobs than silver/bronze","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"why you ask?\r\n\r\nnoobs getting boosted by plat/diamond \r\n\r\ngg riot","replies":[{"poster":"Crunch","date":"2016-03-11T05:57:20.547+0000","up_votes":2,"down_votes":0,"body":"Sure a **tiny minority **of players get boosted, but there are many reasons why people may underperform in games. \n\nLimited Champion Pool - Great on a couple of champions but if banned/picked away may be uncomfortable\nPersonal Issues - Some people may have just had a bad day, and negative attitudes and being called \"noob\" may hit them that much harder\nFocus on one role - Similar to Limited Champion Pool. Some people excel at one role but are inexperienced in others\nJust a bad game - We all have them from time to time where it just feels like nothing is going right for you. \nTilt - A series of events that really puts a player on a bad streak. Their head just isn't in the game and it's hard to identify what exactly is wrong!\n\nIts easy to point fingers at people and say boosted, but all that really does is make the players in your game feel terrible and play worse. Try keep positive if this is affecting you in game. Focus on yourself, no-one else.","replies":[{"poster":"Essembie","date":"2016-03-12T06:51:36.868+0000","up_votes":1,"down_votes":0,"body":"Synergy SO important too. A champion team will always beat a team of champions.","replies":[{"poster":"Crunch","date":"2016-03-14T04:52:02.555+0000","up_votes":1,"down_votes":0,"body":"Nailed it!","replies":[{"poster":"Essembie","date":"2016-03-14T08:50:41.192+0000","up_votes":1,"down_votes":0,"body":"turns out my year 9 PE teacher taught me something after all","replies":[]}]}]},{"poster":"Toxic Shaco","date":"2016-03-12T06:45:51.572+0000","up_votes":1,"down_votes":0,"body":"How can you \"focus on yourself\" when its a team game? If your team underperforms, your enemies are stronger, so you underperform.\n\n\nBiggest problem I see at the moment is people not listening to mias.","replies":[{"poster":"Crunch","date":"2016-03-14T04:55:52.183+0000","up_votes":1,"down_votes":0,"body":"I mean in the sense of do not focus your energy on blaming others on their mistakes when noone ever plays a perfect game. There is always something you could have done better. Every death is a mistake on your part. Maybe you could have been in a better position to help your team in one stage when you tunnel vision on farm, or maybe you could have turned that one pick you made into an objective. \n\nOf course it is a team game, I do not mean be selfish in game! Communicate positively with your team and focus on anything you can do better and you will improve. (P.S Watching replays of yourself and writing down a few key mistakes will help you improve very rapidly. Not many players actually do this, but fast forwarding them in queue times and watching important parts goes a long way!)","replies":[]}]}]},{"poster":"Rooksy","date":"2016-03-14T00:21:22.371+0000","up_votes":1,"down_votes":0,"body":"Look at the broader picture, Gold is the highest tier you can achieve by playing casually: you can play ten games and finish the season in Gold 1. If you want a competitive experience, play up to Platinum. You're basically complaining about casual players making casual mistakes in a casual tier?","replies":[]},{"poster":"DragonOfTheVoid","date":"2016-03-11T03:23:19.413+0000","up_votes":1,"down_votes":0,"body":"they gona drop like rocks dw","replies":[]},{"poster":"The Way of Le","date":"2016-03-10T23:49:21.836+0000","up_votes":1,"down_votes":1,"body":"yeah Few dayz ago i vsing a Jinx she was sliver 3 or 4. But I was shock that she didnt miss any in lane for the silver player even i push her under tower still farm under tower fine","replies":[{"poster":"DragonOfTheVoid","date":"2016-03-11T03:22:24.241+0000","up_votes":1,"down_votes":3,"body":"I'm bronze and only miss farm wen I'm out of lane or getting dicked by a champ like blue ez lol","replies":[]}]},{"poster":"Sha4o4","date":"2016-03-10T16:48:38.458+0000","up_votes":1,"down_votes":2,"body":"i see there was a guy who was Brozen 1 while I was s4 last season and whn I check him he was gold 3 in 3 days lmao like WTF ? and then i check his history, all green I hardly see any loses with unbelievable stats :) so ik he is boosted idc coz, players likw him are sh!t actually :D happen this season again he went till G1 from s4 after promos but he is s1 but idgaf :) coz when he play he always drop hahahaha {{sticker:slayer-jinx-wink}} \n\n\n\nbut yeah it annoys to see some1 that high when u know that person is not capable of :/","replies":[]}]}