{"poster":"HavokDash","date":"2018-02-02T18:34:31.489+0000","title":"Riot caters to spoiled toddlers.","subforum":"Player Behavior","up_votes":1,"down_votes":37,"body":"Yeah, They create the very toxicity they fight.\r\nThey create a team based game, then tell people that the only way to move up, is to give your team the middle finger. \r\nIts funny, I got banned because I said I didnt want to support a kalista, when every previous game kalista has only fed the enemy after talking about how \"amazing\" they are as kalista \"dont worry, I am good, I will solo carry\". \r\n\r\nSo yeah I made a new account. And I plan to basically tell my team to F@$# off. Because caring about your teammates is a suckers game. People only bring up the \"its a team game\" arguement when its convenient for them. \r\nWhen kids throw win-loss ratios at you? they ignore the team, its all about your Solo score. Your Kda? solo score. \r\nBut if you build something that the TEAM doesnt like. Or  you get a kill when you are supposed to \"give kills to adc\" Suddenly \"its a team game\"\r\n\r\nSo I have gotten sick of it. Nah I am not just muting my team. I am happy to let them die and not lift a finger. Because they will do the exact same for me and then tell me how its my fault for getting CC'ed and 4v1'ed\r\nSo Yeah. I am toxic, I was made that way by this community. By a bunch of toddlers who are so coddled and self important by Riot that they render the summoners code USELESS. \r\nI will play my games by myself, for myself. I am done trying to be a team player. I am Done trying to consider my teammates anything other than an obstacle, an extention of the enemy. Children too wrapped up in patting themselves on the back and convinced by Riot that they are the \"solo carry\" \r\n\r\nDont talk to me about playing as a team, Riot breeds the very narcissism and toxicity it claims to fight. You take a team game and expect people to work together while telling each player they have to fight thier own team in order to be the \"solo carry\" and all that matters is their solo stats. \r\n\r\nSo I will use this account to be the constant fly buzzing in your ear. Reminding you just how sad and pathetic this community has become. How it has been coddled and catered to the the point every game is nothing but spoiled toddlers going on about how \"trash\" their team is, How they are \"Too good for this team\" or \"These bronze garbage kids\" \r\n\r\nStop lying to everyone. This community is entirely trash, no exceptions. Anytime someone brings up \"hey here is something wrong with the community\" rather than try and look at it, you just downvote and ignore it because it hurts your precious little feelings. \r\nI hope I am in your games, and personally I HOPE i ruin it for you. Not intentionally, but just so these toddlers will stop acting like \"well i dont see it, it doesnt effect me, so it doesnt exist\"\r\n\r\nBut then again the community is too busy with thier \"Im too OP\" circle-jerk so I dont think they are smart enough to actually look at the attitudes they push. \r\nEnjoy your losses, here is hoping to many for you. ALL OF YOU.","replies":[{"poster":"Jo0o","date":"2018-02-02T18:38:55.606+0000","up_votes":16,"down_votes":0,"body":"Oh hey, I remember you. \n\nStill building random items on random champs in random lanes in Bronze 5 while making forum threads to complain about other people? Seems that way.","replies":[{"poster":"Chermorg","date":"2018-02-02T18:42:18.758+0000","up_votes":13,"down_votes":0,"body":"My favorite is how he says that you have to give the team the middle finger to win, when in fact that's the sure fire way to lose.","replies":[{"poster":"Jo0o","date":"2018-02-02T18:52:55.618+0000","up_votes":5,"down_votes":0,"body":"My favorite is Morello's -> BoRK -> Bramble Vest on Gragas, but you've always been more patient with ranting manifestos than I.","replies":[]},{"poster":"HavokDash","date":"2018-02-02T18:46:47.337+0000","up_votes":1,"down_votes":8,"body":"OH yes, and I personally no longer care. I tried being a team player. I tried to get people to focus on towers. But hey, they want thier kills. And I was just the support. so Its not like I was actually part of the team. \nSo Yeah, I will give my team the middle finger. They want to push their solo game, then I am happy to let them die. I will just do what they do. Wait for them to die. then take the kills from them. \nWho cares if the match is lost. All that matters is who has the \"most kills on the team\"\nThats what this community wants.","replies":[{"poster":"redniwediS","date":"2018-02-02T18:51:21.774+0000","up_votes":1,"down_votes":0,"body":"You're doing the right things in the wrong places.  Team play is for when your team can actually play.  If you're actually in the depths of bronze you shouldn't be trying team play.  Down there it's all about becoming a monster that can fight off the enemy team practically by yourself, which considering the skill level isn't that hard.\n\nPick a hypercarry and just roll with them.  If you get support buy a support item and let the passive gold flow in, and the moment the lane phase ends become a roaming nightmare for the enemy team.  There are different ways to support, and letting your ADC free farm by killing the entire enemy team is one of them.  Once you get to high bronze or silver then you can worry about team play.","replies":[{"poster":"Jo0o","date":"2018-02-02T19:08:33.547+0000","up_votes":3,"down_votes":0,"body":"Trust me, this guy refuses to take any advice on how to better play this game.","replies":[{"poster":"redniwediS","date":"2018-02-02T19:12:41.182+0000","up_votes":1,"down_votes":0,"body":"I dealt with a guy named Lyless back in the day, I know the type.  Still, I can't always avoid attempting to help these people.  Kind of wish I could, but sometimes I just want to make a post to them, you know?","replies":[{"poster":"Void Nargacuga","date":"2018-02-02T19:45:33.609+0000","up_votes":2,"down_votes":0,"body":"Lyless... That's a name I haven't heard in a long time lol\n\nGood luck in any attempts of advice","replies":[]},{"poster":"HavokDash","date":"2018-02-02T19:25:17.257+0000","up_votes":1,"down_votes":3,"body":"actually I am usually open to advice. But what these guys give is NOT advice. \nThey sit there and drag up old games with bad kda and rather than giving \"Advice\"\nthey sit there and mock  \"Omg lawl u built X on X, LAWL such a troll, I would report u all day. Omg ur so bad haw haw\" and they sit there circlejerking. \nIf they think THAT is \"giving advice\" then they truly dont know what It means. THAT is the kind of \"advice\" I dont listen to. \n\"Im going to help you play better by laughing at all ur builds and telling you just how hard I would report you for trolling\"","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T22:01:35.154+0000","up_votes":2,"down_votes":0,"body":"Do not confuse trolling with advice. There are people who give advice. There are also people who sit there and mock you saying they would report you all day. The two are not one and the same. And it is wrong of you to equate them.","replies":[]},{"poster":"Jo0o","date":"2018-02-02T20:03:00.893+0000","up_votes":2,"down_votes":0,"body":"I didn't give you any advice this thread, because you've clearly ignored the advice given by myself and others in previous threads. I think you're a lost cause.\n\nFeel free to prove me wrong. Copy+paste from your last thread:\n\nMe:\n>If you've died 15 times in bot lane, a gank isn't gonna help. Your jungler may have been an asshole, and may have been wrong, but if you lose lane that badly, it's on you. For one reason or another, you can't count on the jungler to win lane for you.\nLooking through your match history, I strongly suggest reading some guides on the champs you play. You seem to have wildly different builds in each game, and while improvisation in the face of different challenges is good, virtually all champs and roles have \"core\" item paths you'll want to follow. Doran's Ring is bad on supports, since the main point of the item is the mana return from killing creeps. Similarly, Relic Shield and its build path generally aren't used on ranged supports. And as others in this thread have said, ward use is among the most distinguishing factor in how good a support is.\n\nWarios:\n>You talk about \"every player for themselves\", and looking at your build paths, that's what you are trying to do yourself. You have Karma games with berserker's greaves , very few games playing Soraka with Ardent or a vision item.\nSure it is a team game of 5, but the only thing you have control over for your team, is what you can do yourself to make the game a success for your team, the stronger you can make your champion for the role you are in, the more success you will have over all. Need to strive to make yourself experienced enough to offset the weaker players in other roles, to have the best chance to get a win.\nHavokDash, take a look at this website, https://lolalytics.com/ranked/worldwide/silver/champion/Karma/Support/ , see what people use for their builds, not saying everything is the right thing when you read this information, but you can see what others are using to have sucess and incorperate it into your play style.\n\nWarios again:\n>I have not played this game for a very long time, but I have learnt one thing, vision is underrated by so many.\nI looked at a few of your match histories, and it looks like you don't buy a support vision item, and your vision scores are the usually the lowest on your team.\nIf want to survive bottom lane, you need to ward and keep vison up as best you can to help prevent those ganks.","replies":[]},{"poster":"redniwediS","date":"2018-02-02T19:59:08.107+0000","up_votes":2,"down_votes":0,"body":"Yeah that is a bit much.  It's hard to give useful advice without seeing someone actually play, and even then you can't know whether or not it's something a person actually needs to know they should work on or not.  No one wants to point out the obvious, but unless you actually talk to the guy it's impossible to know what help they need.\n\nWith Lyless I had actually added him in game, played with him a bit, and was able to give some advice I felt was useful.  He looked like he was clicking on his skills with his mouse, didn't buy support items when he went support, and had other glaring issues that kept him from getting better.  He denied everything of course, and constantly blamed his teams for keeping him down, but he did get better about quickly using his skills.\n\nPeople come on the boards and just start complaining and showing distress about whatever situation they are in, and yes some people do like to make fun of them for not being able to solve a problem others find easy, but some people do want to help, but don't know how.\n\nI've been playing since season 1, and while I'm nowhere near actually being good at this game I am a quick study, and pick up on things pretty quick.  I have a lot of information in my head people could probably find useful, particularly at the lower ranks (never been above gold myself).  The unfortunate thing is the people who understand enough about what they are doing wrong to ask useful questions and seek the knowledge they need are the same people who can get that information on their own.\n\nIf you have anything specific you need help on, and don't know what you can do to try and improve on it, feel free to ask.  That said coming on here and calling everyone who attempts to be helpful liars, and insulting Riot over something that is out of Riot's control, does not help anything and just makes you look like one of the many hopeless bronze players at the bottom of everything.","replies":[]}]}]}]}]},{"poster":"Chermorg","date":"2018-02-02T18:50:00.748+0000","up_votes":4,"down_votes":0,"body":"So you'd rather have the most kills than win the game?","replies":[{"poster":"Negativity","date":"2018-02-02T22:49:37.497+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chermorg,realm=NA,application-id=ZGEFLEUQ,discussion-id=FrF6zVQZ,comment-id=0000000000000000,timestamp=2018-02-02T18:50:00.748+0000)\n>\n> So you&#x27;d rather have the most kills than win the game?\n\n^?","replies":[]}]}]}]},{"poster":"HavokDash","date":"2018-02-02T18:43:22.751+0000","up_votes":1,"down_votes":10,"body":"Well I completely stopped trying to treat this like a team game. So Yeah. I build what I want. I play How I want. If I am support and want to take your farm? I will. I tried being a team player and all it did was get me thrown under the bus. And if They cant farm? well then maybe they should just \"git gud noob\". \n\nBut yeah I call like I see it. When you have spoiled brats who expect everyone to group, then run solo after kills to get themselves ambushed and killled. cost their team the match, but then brag about how superior they are because they have 30/9 while the rest of the team has to deal with a defeat and LP loss. \n\nSo go back to shoving that meta bible where the sun dont shine.","replies":[{"poster":"Jo0o","date":"2018-02-02T18:50:18.562+0000","up_votes":7,"down_votes":0,"body":"Jeez, if your CS numbers are a product of you \"stealing\" farm, I'd hate to see you be a team player. I have higher CS as Bard Support. \n\nLook dude, nobody knows what the fuck to say when you make threads like this. Nothing has changed. Being a noob is fine, but you continue to demonstrate zero willingness to learn how the game works or what you can do to better contribute to your teams, while also continually making threads like this detailing all the ways that you've been \"wronged\". It's just silly. I mean, the items you buy each game *literally* look like the product of a random number generator. \n\nYou've always had the option to chill out and accept coaching, but I guess you're too proud for that. Holding a losing record in B5 doesn't strike me as fun, but you do you.","replies":[]}]}]},{"poster":"YerroFever","date":"2018-02-02T19:01:01.643+0000","up_votes":1,"down_votes":0,"body":"I would disagree that Riot created toxicity.\n\n>Its funny, I got banned because I said I didnt want to support a kalista, when every previous game kalista has only fed the enemy after talking about how \"amazing\" they are as kalista \"dont worry, I am good, I will solo carry\".\n>\n>So yeah I made a new account. And I plan to basically tell my team to F@$# off. Because caring about your teammates is a suckers game. People only bring up the \"its a team game\" arguement when its convenient for them.\n>\n>When kids throw win-loss ratios at you? they ignore the team, its all about your Solo score. Your Kda? solo score.\nBut if you build something that the TEAM doesnt like. Or you get a kill when you are supposed to \"give kills to adc\" Suddenly \"its a team game\"\n\nI think there are some points you are missing.... actually some key points that are leading to your frustration.\n\nI completely understand not wanting to support a specific champ. I main mid and support and I know what it's like to have to support a champion that is antithetical to your support style. I dislike it very much and I know how you feel when someone picks a champ that does not match your main supports and play style. \n\nThis is the give and go portion. This is where you can ask if they have another main ADC to see if they can play with a style that is more compatible with yours. It is a team game and you are allowed to ask. Just because you're the support doesn't mean you have to capitulate to everyone else. You still have a voice and you still have a say.\n\nRegarding the kill situation, there are many times where I have gotten kills as the support and no one bats an eye and it's usually for kill secured situations rather than kill stolen. So say there's like a 100% chance that the enemy is going to die, that's when you leave it up to the ADC because as a support, you most likely aren't going to hard carry the team. It's just more efficient. If there's like a 10% chance your ADC will live and a 90% chance the enemy will live, it's better to go all in and go for the kill to ensure your TEAM gets the kill and your ADC survives. If the ADC and your teammates don't understand that, then that's their problem. It's about efficiency.\n\nIf we go outside the realm of the ideal situation where your ADC kills the enemy ADC and their support, or the second most ideal situation where your ADC kills the enemy ADC or support and the other one gets away (which is where no one ever complains) and we go into the realm of situations where people do complain, we have these scenarios:\n\nSituation 1: Worst case scenario\nEnemy ADC gets all of the kills (regardless of if it's your ADC, support, or both. When the enemy ADC gets kills and you don't, it's the worst case)\nYour team gets 0 kills\n\nSituation 2: Second worst case scenario\nEnemy support gets kills and enemy ADC gets assists\nYour team gets 0 kills\n\nSituation 3: Ehhh.... at least there's some assist gold... but still doesn't compensate for dead time and exp loss\nYour Support kills enemy ADC or support\nEnemy kills your ADC\n\nSituation 4: Good but not great.\nSupport kills enemy ADC or support\nYour ADC survives\n\nSituation 3 and 4 are always more favorable to situations 1 and 2. Yes people will complain but that's because THEY are self centered as the ADC or don't understand the game as a team game. \n\nAs you get in higher ELO's, you'll more frequently meet people who understands this.\n\nIf you play selfishly all the time, regardless of how good your ADC is just to protect your KDA, you will never actually go up in rank. If your ADC is just as good as you, both of you need to put in 100%, otherwise, the enemy will always have the advantage.\n\nWhen you meet an ADC you can trust, put your full ass in it because if you half ass it with an ADC you should have trusted, all you'll do is guarantee a loss.","replies":[{"poster":"HavokDash","date":"2018-02-02T19:10:23.829+0000","up_votes":1,"down_votes":4,"body":"I have never met an adc I can trust. Nor will I ever trust an adc. Because the Moment the shit hits the fan, I am the one they will throw into the fan blades next. They want to protect their precious ego so even if they dive in while I am out of mana and backing, they will turn around and tell me hwo it is entirely my fault. \n\nI have lost count how many times my adc will sit there and bag on me, tell me just how completely useless I am, to the point I am happy to call their bluff. I WILL LEAVE and let them have the solo lane they crave (and go try and support one of the other lanes) and immediately after them telling me how \"useless\" I am and how \"I dont need a trash support like you\" suddenly the moment they get a solo lane, they die and start calling \"report my useless support for abandoning lane and not helping me\" \n\nSo No, I am done trying to see my teams as anything other than greedy toddlers only wrapped up in how \"OP\" they look thanks to Riots dumbshit \"Solo carry\" mentality that they push. Everyone wants to be the solo carry, so they will sit there and stab their team in the back for the sake of \"Im the best, Im too good for this team. Look how OP I am\" \nSo I am gonna start pulling these daggers out of my back and using them on my teammates. I tried suggesting \"Team carry over solo carry\" but people are too wrapped up in themselves, so now they can take the loss they deserve. Maybe it will knock them down a few pegs.","replies":[{"poster":"Hambone2013","date":"2018-02-02T19:12:54.779+0000","up_votes":7,"down_votes":0,"body":"Sounds like you're the one wrapped in his own ego to me. Get over yourself","replies":[]},{"poster":"YerroFever","date":"2018-02-02T19:24:05.581+0000","up_votes":5,"down_votes":0,"body":"I think this attitude of never trusting and ADC will just lead to soul crushing loss after loss. \n\nWhen shit hits the fan, if THEY made a bad call in engaging... you can't heal stupid and Riot has been changing the nature of heals to make sure of that. If you've noticed how much less forgiving bad trades and engages are, it's because Riot doesn't like the safety bubble that lots of healers and supports give. They want to reward good play and so supports are now turning into minor forgiveness machines instead of a mobile nexus healing fountain.\n\nIf they made a good call and then say an unexpected jungler comes in and your ADC did everything right according to the situation at hand, then it's better for you to throw yourself into the fan because supports can come back and still be useful with less gold and lower levels. ADC's have a MUCH harder time being useful with less gold and lower levels.\n\nRiot isn't pushing a solo carry mentality. Why else would there be a jungler? The jungler is the unofficial support for every lane, whether it's by getting kills or by getting jungle objectives... they support every single lane.\n\nI mean this in no offense but it will come off offensive.... but it's more of a symptom of your elo and not really Riot. When I first started ranked in like season 2, I was bronze and and I hated playing ranked because the mentality of people was just fucking awful. When I asked other higher ranked people, they said it wasn't nearly as bad as bronze and that I should just tough it out. \n\nUnfortunately I never really had the patience to play more than like 50 or so games each season until the tribunal was done away with and the IFS system was in place and they actually started punishing people within a reasonable time and ranked became a much more pleasant place compared to the cesspool of bile and vitriol that it was years ago.\n\nPutting daggers in your teammates backs only serves to guarantee your own loss. I really hope you reconsider how you play if you want to keep playing this game because it sounds like you're going to sabotage your own experience by going down this path.","replies":[]}]},{"poster":"Hambone2013","date":"2018-02-02T19:06:25.630+0000","up_votes":3,"down_votes":0,"body":"Personally, as an ADCI expect my support to play it like I do. Make damn sure they go down no matter who gets the kill.","replies":[{"poster":"This Is Your Dad","date":"2018-02-02T19:25:04.196+0000","up_votes":2,"down_votes":0,"body":"As a support \"main\" I think there's a certain chemistry between adc and support. If you don't have it the lane won't work.","replies":[]}]}]},{"poster":"La Belle Sauvage","date":"2018-02-02T18:51:47.088+0000","up_votes":2,"down_votes":0,"body":"The irony in your post is too rich. \n\nYou write about  spoiled childish behavior and toxcity, when your entire post is just that. And this game and community didn't make you toxic. \n\n_You_ are toxic. You have a rotten attitude. And you are in complete control of both how you act and react to players independent of this game and it's community. \n\nTime to grow up.","replies":[{"poster":"HavokDash","date":"2018-02-02T18:58:58.083+0000","up_votes":1,"down_votes":4,"body":"Haha I started in season 3. I was more than happy to make sacrifices for the team. I was happy to help the team out. \nUntill this god damn solo carry Esports attitude came along. Suddenly the moment I sacrifice and peel for my adc, they turn around and call to report me for inting. Or Throw a fit and leave the lane because my Q as soraka accidentally claimed a minion so they claim \"Report my support for stealing my cs\" \nOr I could keep my adc alive long enough to get them a triple kill and not even 5 seconds later be told how \"useless support\" I am. How the  triple kill was all them, I played no part in healing them, ccing the enemy, keeping them alive. \nSo yeah, this community did. Worn down over seasons of spoiled entitled brats drunk on how \"Solo carry OP\" they are. And convinced that the support isnt even part of the team, just someone for the children to kick around. \nBetter hope I never get autofilled support, or Adc will have a very hard time. \n\nYeah I am toxic, I have a rotten attitude. A result of wading through the pathetic entitled cesspool of this community watching them pat themselves on the back and hoping a couple of these \"Im too good\" kids break their arms patting themselves on the back.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T19:29:22.143+0000","up_votes":1,"down_votes":0,"body":"Bruh if a teammate is whining and calling for reports against you just report them for harassment. Lobbying for reports against someone is punishable as harassment, for the precise reason of the impact it had on you and other players like you. It makes players feel persecuted and harassed, it tilts them, and it ruins their fun.\n\nRiot punishes people who do these sorts of things to you. Leave it in their hands to deal with, rather than taking it upon yourself to retaliate.","replies":[{"poster":"HavokDash","date":"2018-02-02T19:43:12.573+0000","up_votes":1,"down_votes":2,"body":"Sorry But I have little to NO FAITH in the reporting system.  But I will just have to report my teams good or bad, win or loss. Because Personally I have no faith in riot, no faith in this community. \nI have tried again and again to be a team player, and what does it get me? harrassment, headaches, lobbies for reports and more personal attacks than I can count. \nAnd Riot will continue to push the \"solo carry\" attitude, which has people COMPETING for kills against thier own team.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T20:13:43.233+0000","up_votes":1,"down_votes":0,"body":"I dunno what culture you're playing in by the culture I've found when playing league is nothing like this.\n\nIf your teammates appear reactive and uncooperative, maybe you should look at how you are treating them and see if someone treating you like that might make you not want to listen to them too.","replies":[{"poster":"HavokDash","date":"2018-02-02T20:20:30.666+0000","up_votes":1,"down_votes":1,"body":"Nah I am constantly told how useless/worthless I am, how much of a garbage noob I am. \n\n\"Omg this support is so pathetic. such a worthless noob. Now get over here and heal me\"\n\nYeah because I really want to help someone who spends the whole start of the game telling me how useless I am, how pathetic I am, how I am a noob feeder, a trash bronze, etc. And then immediately turns around and expects me to dive the enemy for them. \n\nYou got it right, but its more the other way around. I am uncooperative because they switch between telling me how worthless I am, degrading and insulting. Then getting mad at me for not immediately jumping at their command.","replies":[{"poster":"Jo0o","date":"2018-02-02T20:37:51.683+0000","up_votes":5,"down_votes":0,"body":"Chicken vs. egg. Do you use troll builds and refuse to improve because people have been toxic to you, or are people toxic to you because you use troll builds and refuse to improve?\n\nYou'll never completely escape assholes that feel the need to lay blame whenever something goes wrong, but I *guarantee* you, if you take steps to actually adhere to the meta and use real builds, the number of folks that flame you will drop significantly.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T20:59:03.382+0000","up_votes":4,"down_votes":0,"body":"https://memegenerator.net/img/instances/23266068/hes-right-you-know.jpg","replies":[]}]},{"poster":"Hambone2013","date":"2018-02-02T20:26:45.082+0000","up_votes":1,"down_votes":0,"body":"Mute them?","replies":[]}]}]}]}]},{"poster":"La Belle Sauvage","date":"2018-02-02T19:33:59.172+0000","up_votes":3,"down_votes":0,"body":"Not sure what \"I started in season 3\" has do with anything. If it refers to your age, then take solace in the notion that you still need to grow up whether you are 10 years old or 100. \n\nPart of being a mature rational adult is taking ownership for your actions. Like the attitude you display in your original  post and the respones. \n\nYou place blame on inanimate objects as well as complete strangers you meet in game over the internet. \n\nWhy not mute all to start. That way if you do something that makes your teammates rage you don't see it. Anyway, I digress. \n\nDo you realize how ridiculous you come off in this post?","replies":[]}]}]},{"poster":"redniwediS","date":"2018-02-02T18:42:53.669+0000","up_votes":4,"down_votes":0,"body":"> Its funny, I got banned because I said I didnt want to support a kalista,\n\nWhy even bother?  People around here understand the ban system, no one is going to fall for this.\n\nChat logs or no one is going to take you seriously.","replies":[]},{"poster":"Periscope","date":"2018-02-02T22:12:45.874+0000","up_votes":3,"down_votes":0,"body":"I really don't think Riot gives a crap whether you play as a team or try to solo-carry every game. They make that pretty clear in that they only punish playstyles that show a lack of intent to win the game. \n\nBut the fact is, this is a team game. It's why there's grouping at some point in the game. It's why there's coordination. It's why you're on one side, and the enemy is on the other. To suggest otherwise is ridiculous. Seriously. How can you look at the group of players on either side of the rift and say they're not a team. Sure, teamwork does not always trump individual talent, but with equal talent, teamwork will triumph. It is the single factor that evolves throughout every single game. If you deny its strength, then you are blind to how this game is played, on any level. \n\n>I will play my games by myself, for myself. I am done trying to be a team player. \n\nI really don't think this is the game for you. Clearly, you're not interested in working with others, so why bother playing this game?\n\n>Anytime someone brings up \"hey here is something wrong with the community\" rather than try and look at it, you just downvote and ignore it because it hurts your precious little feelings.\n\nYou're reading far too into downvotes. Maybe people just hate you, maybe they didn't read your post, or any other stupid reason. I frankly don't agree with much of what you said, but saying \"this isn't a team game\" coupled with your assumptions about the community earn a downvote from me. I feel your statements in these two areas are a gross characterization of the game and the community.","replies":[]},{"poster":"HalcyonDweller","date":"2018-02-02T19:37:47.387+0000","up_votes":2,"down_votes":0,"body":"Toxicity comes from the players, not from Riot.\n\nWhen people tilt and start taking things personally they start flaming each other. Flaming someone who's not yet tilted results in them flaming back. It's a problem with multiple sources and causes, and each player is responsible for handling themselves responsibly regarding it.\n\nIf you want teammates to treat you with respect and kindness start by treating them that way yourself. Passive aggressive comments and demands about champion choices or item builds will only hurt your ability to make them want to listen. People listen and follow leaders who act respectable, such as by being friendly and communicative about what they want done. For example, \"Hey I can't play with a Kalista in lane, it never works, would you please be willing to play a different champion this game?\"","replies":[{"poster":"HavokDash","date":"2018-02-02T20:04:56.817+0000","up_votes":1,"down_votes":1,"body":"there was no pick intent, when their turn to pick came up they just instalocked Kalista. How am I supposed to get someone to play something else when I cant even see what they intend to play.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T20:42:13.904+0000","up_votes":3,"down_votes":0,"body":"Then report them after the game for instalocking without communicating with the team.\n\nOr you can learn to work with it and try to keep a more open mind. It is a mistake in the first place to generalize all Kalista players.\n\nThe point is that you should focus on negotiating and not take rage out on teammates when they make decisions you don't like.","replies":[{"poster":"Hambone2013","date":"2018-02-02T20:51:25.014+0000","up_votes":1,"down_votes":0,"body":"Communicating your pick isn't actually against the rules nor is instalocking. Provided they aren't role-jacking. If the person thought they're chances of winning with kallista were best of course they'd go with that.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T20:55:16.348+0000","up_votes":1,"down_votes":0,"body":"I was simply presenting the OP the lesser of two evils. If they are upset with a player for picking something without communicating, then they should report that person instead of rage at them.\n\nI did say that communication and open mindedness are an option.","replies":[{"poster":"Hambone2013","date":"2018-02-02T21:00:21.620+0000","up_votes":1,"down_votes":0,"body":"MUH bad, sorry I misread your post. I was a little worried misinformation was getting spread around.","replies":[{"poster":"HalcyonDweller","date":"2018-02-02T21:19:47.334+0000","up_votes":1,"down_votes":0,"body":"It's cool, I completely understand why you thought that. I wasn't super clear with my comment about that.","replies":[]}]}]}]}]}]}]},{"poster":"La Belle Sauvage","date":"2018-02-02T20:15:12.706+0000","up_votes":1,"down_votes":0,"body":"Havok how about this? \n\n I play ADC as a secondary position. I main Support and climbed from B5 to S4 last year. I'm willing to play some norms with you as your ADC  if you want to continue playing Gragas support. Build what you want I won't say a word. \n\nAfter we play enough games and you're interested I can share my ideas on Support between two low elo players in an effort to help you out. \n\nIf your agreeable let me know. I mute all so I won't be communicating except for pings.","replies":[{"poster":"HavokDash","date":"2018-02-02T23:41:54.133+0000","up_votes":1,"down_votes":0,"body":"I am happy to take an evaluation from actual playing. I cant on this account for obvious reasons. I have a new account I am leveling. But I am fine with listening to actual advice. \nPeople call me difficult because They think telling me how much of a \"meme\" I am counts as advice.\n\"see? see here? see this kda of yours? this is why you suck, this is why you are so bad. Maybe dont be so bad and you wont get laughed at. \n\nI will admit, yeah I DO suck. Ok? I AM autistic, I do have aspergers so sure some things get lost in translation. But that asside I really have No interest in taking advice from these people who insist on telling me just how \"complete garbage\" I am, tell me \"dont be so bad\" and think that counts as \"helpful advice\" and then when I ignore them, they turn around and say \"I gave you helpful advice and you ignored it\" \n\nSo Yeah at some point if you are willing to do a few matches and help show me where I am going wrong, I am all for that. But I am happy to give a deaf ear to these people who think \"Omg ur so bad, look at how bad u are. Ur such a troll, dont be so troll man!\" counts as helpful advice.","replies":[{"poster":"La Belle Sauvage","date":"2018-02-03T00:40:56.710+0000","up_votes":1,"down_votes":0,"body":"I understand, just send me a friend request when you are ready and we can play a few.","replies":[{"poster":"HavokDash","date":"2018-02-03T00:59:48.637+0000","up_votes":2,"down_votes":0,"body":"thank you for at least being respectful. I am open to listening.\nJust want to get some levels first, I still have pretty much No champs atm, working off the free rotation. But I am open to seeing where I may be tripping up in-game. I just dont listen to these kids who insist on rubbing my nose in mistakes and beating me over the head with them, rather than telling me how to fix them.","replies":[]}]},{"poster":"Prandine","date":"2018-02-03T01:59:03.643+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HavokDash,realm=NA,application-id=ZGEFLEUQ,discussion-id=FrF6zVQZ,comment-id=000a0001,timestamp=2018-02-02T23:41:54.133+0000)\n>\n> I am happy to take an evaluation from actual playing. I cant on this account for obvious reasons. I have a new account I am leveling. But I am fine with listening to actual advice. \n> People call me difficult because They think telling me how much of a &quot;meme&quot; I am counts as advice.\n> &quot;see? see here? see this kda of yours? this is why you suck, this is why you are so bad. Maybe dont be so bad and you wont get laughed at. \n> \n> I will admit, yeah I DO suck. Ok? I AM autistic, I do have aspergers so sure some things get lost in translation. But that asside I really have No interest in taking advice from these people who insist on telling me just how &quot;complete garbage&quot; I am, tell me &quot;dont be so bad&quot; and think that counts as &quot;helpful advice&quot; and then when I ignore them, they turn around and say &quot;I gave you helpful advice and you ignored it&quot; \n> \n> So Yeah at some point if you are willing to do a few matches and help show me where I am going wrong, I am all for that. But I am happy to give a deaf ear to these people who think &quot;Omg ur so bad, look at how bad u are. Ur such a troll, dont be so troll man!&quot; counts as helpful advice.\n\nI can understand where you're coming from in terms of aspergers as I have it myself. However, I think the problem allot of people are having is your history of rant posts and rather dismissive and confrontational attitude. Yes some people here could have been more respectful in their responses to you but look at your opening post where you claim that:\n\nRiot caters to \"spoiled children\".\nThe community is trash.\nNo one on your team is listening to you.\nYou won't be a team player anymore.\nYou will consider your teammates enemies (essentially putting yourself in a 1v6/9 scenario from minute one).\nYou will ruin other peoples games: \n\n>-I hope I am in your games, and personally I HOPE i ruin it for you. Not intentionally, but just so these toddlers will stop acting like \"well i dont see it, it doesnt effect me, so it doesnt exist\"\n-So I will use this account to be the constant fly buzzing in your ear. Reminding you just how sad and pathetic this community has become. How it has been coddled and catered to the the point every game is nothing but spoiled toddlers going on about how \"trash\" their team is, How they are \"Too good for this team\" or \"These bronze garbage kids\"\n\nHeck, you even said this in one of your responses to someone here in this thread: \n\n>So No, I am done trying to see my teams as anything other than greedy toddlers only wrapped up in how \"OP\" they look thanks to Riots dumbshit \"Solo carry\" mentality that they push.\n\nThis combined with the fact that your in-game stats from allot of your recent games are very poor is not a good representation of who you are as a person. When you have this kind of attitude and mindset you make it very difficult for people to want to help you out and turns away many who would normally do just that. Had you opened with and responded to people with a more respectful attitude then chances are you would have gotten more helpful tips and advice and less dismissive and snarky responses like the ones that you made rather easy for people to make in this thread.\n\nIt's good that you seem at least somewhat willing to listen now, but in the future rather than dismissing everyone who says or does something that you don't like (the kind of behavior you've displayed in this thread alone) try being more open to advice, change help from others. People do want to help you but you have to be willing to let them do that first (easier said than done I know but still though).","replies":[{"poster":"HavokDash","date":"2018-02-03T02:36:07.723+0000","up_votes":1,"down_votes":0,"body":"I Do not mean -intentionally- ruining other peoples games, But that said I am a firm believer in \"karma\". \nThere are people who sit in game and do nothing but flame and talk about how \"Garbage\" their team is. They will insult and degrade teammates, tell them how worthless they are. And yet at the drop of a hat will turn around and demand (in the case of support) they come heal the player, or sit there and die so the flamer can get away. \nIts like walking up to someone, telling them how completely worthless they are, Punching them in the face.....and then saying \"Now get over here and help me move this sofa\"\nNo dude, you just punched me in the face, move your own god damn sofa. \nSame is in game. You dont get to flame and degrade me and then expect me to just come and risk my neck for you like nothing happened. \n\nas for my in game record, I am not (or at least previously) thinking about myself, I am thinking steps ahead. and perhaps that is one of my flaws that I think steps ahead of my teammates. But it doesnt help when they act like they are gonna go in for a teamfight, run in, then turn around and pull a U-turn at the last second. Just in time for me to get ambushed, and then they turn around and accuse me of inting. \n\nand I dont know how many times I have to say it, But I am open to advice. The difference is in how it is delivered. \n\nGood: Here is what you are building >insert item set<, But it doesnt work because (reasons), try X instead\"\n^ ok, it gives me reasons to think on, and I will take it into consideration, try it out, etc. this person doesnt sit there belittling and degrading me over my build, just shows why it may not work. This I am more likely to take into consideration. \n\ncompare that to\n\nBad: \"Omg ur such a troll, I would report you so hard. Look at you, you idiot,building X. WTF Is wrong with you. Stop sucking so much and maybe your team wont flame you\" \n^and these same players still think THIS counts as HELPFUL ADVICE and then accuse me of not listening to the 'advice' they are giving.\n\nYeah I know I fuck up, I know I am bad at the game. But people punch me in the face and still expect me to listen to what they have to say. No thanks, Not happening.","replies":[{"poster":"Prandine","date":"2018-02-03T02:56:01.138+0000","up_votes":0,"down_votes":0,"body":"> [{quoted}](name=HavokDash,realm=NA,application-id=ZGEFLEUQ,discussion-id=FrF6zVQZ,comment-id=000a000100010000,timestamp=2018-02-03T02:36:07.723+0000)\n>\n> I Do not mean -intentionally- ruining other peoples games, But that said I am a firm believer in &quot;karma&quot;. \n> There are people who sit in game and do nothing but flame and talk about how &quot;Garbage&quot; their team is. They will insult and degrade teammates, tell them how worthless they are. And yet at the drop of a hat will turn around and demand (in the case of support) they come heal the player, or sit there and die so the flamer can get away. \n> Its like walking up to someone, telling them how completely worthless they are, Punching them in the face.....and then saying &quot;Now get over here and help me move this sofa&quot;\n> No dude, you just punched me in the face, move your own god damn sofa. \n> Same is in game. You dont get to flame and degrade me and then expect me to just come and risk my neck for you like nothing happened. \n\nIt's fine to be frustrated at poor performing and/or behaving teammates but it is not your place or responsibility to discipline them as you are not the team captain or the coach of the team. If you truly believe in karma then just report them after the game and they'll get punished if they have a history of poor behavior. \n\nIf you don't want to help a toxic player then so be it, feel free to help a non-toxic teammate out instead. Just don't start yelling and raging at them in the chat and expect that the \"they started it\" excuse will work here as it doesn't.\n \n> as for my in game record, I am not (or at least previously) thinking about myself, I am thinking steps ahead. and perhaps that is one of my flaws that I think steps ahead of my teammates. But it doesnt help when they act like they are gonna go in for a teamfight, run in, then turn around and pull a U-turn at the last second. Just in time for me to get ambushed, and then they turn around and accuse me of inting. \n\nThere's nothing wrong with trying to think steps ahead but your abnormal build patterns and cs records really don't support that kind of mindset, at least not in these kinds of Multiplayer games anyways. Yes some people are gonna be rude and disrespectful no matter what but you can help limit the odds of that happening by not doing or saying things that you know will just tick other people off. If doing this is too great a challenge then Multiplayer Online games are just not for you.\n \n> and I dont know how many times I have to say it, But I am open to advice. The difference is in how it is delivered. \n> \n> Good: Here is what you are building &gt;insert item set&lt;, But it doesnt work because (reasons), try X instead&quot;\n> ^ ok, it gives me reasons to think on, and I will take it into consideration, try it out, etc. this person doesnt sit there belittling and degrading me over my build, just shows why it may not work. This I am more likely to take into consideration. \n> \n> compare that to\n> \n> Bad: &quot;Omg ur such a troll, I would report you so hard. Look at you, you idiot,building X. WTF Is wrong with you. Stop sucking so much and maybe your team wont flame you&quot; \n> ^and these same players still think THIS counts as HELPFUL ADVICE and then accuse me of not listening to the &#x27;advice&#x27; they are giving.\n> \n> Yeah I know I fuck up, I know I am bad at the game. But people punch me in the face and still expect me to listen to what they have to say. No thanks, Not happening.\n\nWhile I agree that there's a right way and a wrong way to give advice understand that it's a two-way street. Sometimes the best advice is the kind that you don't want to hear but need to hear, even when it's given as respectfully as possible. That said though, you have to be willing to take the advice and be willing to learn from that advice in order to move forward, otherwise what's the point? Again I know that this is all easier said than done but the point is that if you show that you're willing to listen and accept help and not lash out at the first signs of trouble then more and more people will be willing to help you out. Try to work with people rather than against them.","replies":[{"poster":"HavokDash","date":"2018-02-03T03:35:44.875+0000","up_votes":1,"down_votes":0,"body":"> It's fine to be frustrated at poor performing and/or behaving teammates but it is not your place or responsibility to discipline them as you are not the team captain or the coach of the team. \n\nNah I dont think I am. I offer a suggestion here and there \"Focus their towers, make them come to us, dont chase them all over the map\" or \"dont spread out the damage among multiple targets, burst down the damage dealers first\" And I am not trying to dictate anything, I am simply stating my observation. \n\nBut By karma I mean simply that these people who insist on beating thier team over the head with mistakes, who will take a screw up and repeatedly rub a players nose in it, never letting them live it down. These are the same people who intentionally stress out thier teammates. They will sit there and degrade, insult, and talk down to their teammates, then wonder why thier teammates get frazzled and play WORSE, not better (thier attitude is \"ur playing bad, so I am gonna sit here and tell you how worthless garbage you are untill you play better\") and How often does THAT work. \n\nThese are the same people who will brag about thier solo kills while thier team is a frustrated mess, then be genuinely confused as to WHY they lose matches Because the team falls while they are often out chasing any straggling solo kills or split pushing \n\n> If you don't want to help a toxic player then so be it, feel free to help a non-toxic teammate out instead. Just don't start yelling and raging at them in the chat and expect that the \"they started it\" excuse will work here as it doesn't.\n\nand No, I dont yell and rage at them I do just as you said. I will actively REFUSE to help them. And they seem to think that me refusing to help them after they swear and degrade me counts as trolling. so they blame me for \"Trolling\" and throw a fit. Its like I said in the past, I will not hesitate to call the bluff of an adc who thinks they are too good for a support. \n\nIf My adc spends the start of the game telling me how worthless/trash/garbage I am and how he doesnt need any \"useless support\". I will call their bluff and walk. I have 2 other lanes I can help support. And Yet these players will die almost immediately and still have the gall to tell me how its \"Supports fault\" for abandoning lane when they spend the first 10 minutes of th match telling me how garbage I am compared to their greatness. \n\n\n>  Again I know that this is all easier said than done but the point is that if you show that you're willing to listen and accept help and not lash out at the first signs of trouble then more and more people will be willing to help you out. \n\nand I have had people offer advice in an informative and respectful manner, and I have responded in kind. But when I have people who's Idea of advice is telling me how garbage I am, throw my own kda at me and tell me I am a meme and need to uninstall, then yeah I am not listening to them. \nits not the information. Its how its -delivered-. One is a friendly offer to help, and again sure it can be things i may not want to hear, fine. The other is someone smacking me in the face with a brick and telling me how trash I am while saying \"Im just trying to give you advice, its to help you not be such a garbage player\"","replies":[]}]}]}]}]},{"poster":"Jo0o","date":"2018-02-02T20:38:44.791+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-poppy}}","replies":[]}]}]}