{"poster":"fr3aQi B3rlin","date":"2015-12-15T19:55:37.258+0000","title":"Sona AD Skalierung zu hoch ???","subforum":"Champions & Gameplay","up_votes":1,"down_votes":10,"body":"Ich vermute das irgendwas in der Spielmechanik nicht ganz richtig sein kann\r\nWenn die Skalierung von AD H&ouml;her ist als AP ????\r\n\r\nIch spiel gerade ebend gegen  H&iacute; &iacute;m Fr&eacute;&aacute;K (Sona) und er critet vonn 500+ bis 882 was wohl garnicht geht Sona ist nen AP Champ das sollte behoben werden und wenn es, buggy ist ne Strafe kassieren!\r\n\r\nAlso kontrolliert die Spielmechanik so schnell es geht es ist nen WITZ! \r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Groath","date":"2015-12-16T02:09:21.862+0000","up_votes":3,"down_votes":0,"body":"Crits passieren nur bei Autoattacks (und bei Anivias E :D). Autoattacks skalieren ausschließlich mit deinem Angriffsschaden. Das heißt, je höher dein Angriffschaden, desto höher werden deine Crits (Wenn man die Verteidigung der Gegner nicht berücksichtigt). Das ist bei jedem Champion exakt gleich.\n\nBei Angriffsschaden hast du einen Grundwert von Anfang an und kannst diesen durch Items, Championeigene Buffs (Vayne Ulti) oder Teambuffs (Tarics Ulti, Jannas Schild) steigern. Bei Fähigkeiten, die den Effekt einer Autoattack mit ausführen (z.B. Nasus Q) und dabei critten, ist dieser Schaden umso höher.\n\nSona hat laut ihrer  [Wikia-Seite](http://de.leagueoflegends.wikia.com/wiki/Sona) keinerlei AD Skalierung oder Ad Buffs in ihren Fähigkeiten. Das heißt, ihre Autoattacks übertragen ausschließlich den Schaden, den sie durch ihre Items und ggf. durch Teammates bekommt auf ihre Gegner. (Dabei weiß ich nicht, ob der zusätzliche magische Schaden durch ihre Power Chord critten kann) Somit haben alle Champions die Möglichkeit, genauso viel Schaden durch ihre Crits zu machen als Sona, vorausgesetzt sie haben dieselben Items. Wenn sie dazu noch Buffs haben, machen sie natürlich mehr Schaden als sie.\n\nUnd falls du der Ansicht bist, dass AD Sona viel mehr Schaden macht als AP Sona, wurdest du sicher noch nicht von einer puren AP Sona mit ihrer Ulti (300+50%AP), Q (200+50%AP), Q Passive (80+20%AP) und Power Chord ((82+20%AP)*1,4 wegen Staccato) vom Feld gefegt. Das sind allein ohne Staccato 662+140%AP+ihre Angriffsstärke, was locker über 1300 Schaden kommt gegen Ende des Spiels. Hau da noch einen Lich Bane rein und du stirbst, bevor du überhaupt richtig zu tanzen angefangen hast.\n\nNehmt es mir nicht übel, dass ich vollkommen ernsthaft auf diesen Post antworte, es ist 3 Uhr Nachts und ich warte darauf, dass das Nachbarsbaby aufhört, zu schreien. Armes Ding :(","replies":[{"poster":"Tungsteel","date":"2015-12-16T09:13:34.523+0000","up_votes":1,"down_votes":0,"body":"\n> Crits passieren nur bei Autoattacks (und bei Anivias E :D). \n\nDas erklärt, warum in einem meiner letzten Spiele AP Anivia den höchsten Crit hatte, höher als Graves, Tristana und Miss Fortune. :)","replies":[{"poster":"D4RKEVA","date":"2015-12-16T10:36:27.311+0000","up_votes":3,"down_votes":0,"body":"Soraka q / karthus q und viele abdere fähigkeiten critten auch :P","replies":[{"poster":"Tungsteel","date":"2015-12-16T11:17:58.326+0000","up_votes":1,"down_votes":0,"body":"Das ist ja cool :) Ist das gewollt oder ein Fehler?\n\nDie Anivia hat aber keine Krit-Gegenstände/Runen/Masteries gehabt. Kriten die Fähigkeiten also unabhängig von der Kritchance?","replies":[{"poster":"Stealth Cat","date":"2015-12-16T13:24:15.310+0000","up_votes":2,"down_votes":0,"body":"Es sind keine \"echten\" Krits, sondern magische, diese kritten in besonderen Fällen:\nAnivia: Wenn das Ziel durch Q oder R geslowt ist--->DMG x 2 \nKarthus: Wenn nur 1 Ziel von der Q getroffen wird-->DMG x 2 \nSoraka: Wenn das Ziel im Zentrum der Q steht-------->DMG x 1.5 + Slow\nDa sie aber als Krits in den Stats am Ende des Spiels gesehen werde, wäre mal interessant ob ihr DMG durch Krit-DMG-Runen oder IE erhöht wird.\n\nEdit: Weiß jemand wieso der Karthus Teil leicht schräg ist?\nEdit II: Ok weiß was das Problem war, habs anders hingeschrieben.","replies":[{"poster":"Evenrider","date":"2015-12-16T14:38:28.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=E5 Rekhyten,realm=EUW,application-id=Wj1wcocU,discussion-id=95yA0xMP,comment-id=00050000000000000000,timestamp=2015-12-16T13:24:15.310+0000)\n>\n> Es sind keine \"echten\" Krits, sondern magische, diese kritten in besonderen Fällen:\n> Anivia: Wenn das Ziel durch Q oder R geslowt ist--->DMG * 2\n> Karthus: Wenn nur 1 Ziel von der Q getroffen wird-->DMG * 2\n> Soraka: Wenn das Ziel im Zentrum der Q steht-------->DMG *1.5 + Slow\n> Da sie aber als Krits in den Stats am Ende des Spiels gesehen werde, wäre mal interessant ob ihr DMG durch Krit-DMG-Runen oder IE erhöht wird.\n> \n> Edit: Weiß jemand wieso der Karthus Teil leicht schräg ist?\n\nDie Sternchen sind für Kursive Schreibweise. Deswegen auch keine Malpunkte. Außer bei Soraka, wo du das Leereichen zwischen dem Sternchen und der 1 vergessen hast.\nWie sieht das bei Garens Judgement aus?\nDIe Fähigkeit kann critten (ebenso wie GP Q,....) und hat noch den Zusatzschaden, wenn es nur gegen 1 Ziel ist.","replies":[{"poster":"Stealth Cat","date":"2015-12-16T15:06:07.904+0000","up_votes":1,"down_votes":0,"body":"Nun, erstmal danke für die Erklärung.\nBei der Gangplank Q krittet der AA davon, also AA (krittet) +  Q Zusatzschaden, allerdings skaliert das hier mit Kritchance.\nBei Garen kann jede Instanz der E kritten (glaube ich, ansonsten eine gesamte E), skaliert ebenfalls von Kritchance, hier weiß ich allerdings nicht ob IE/Kritdmgrunen helfen oder nicht.","replies":[]}]},{"poster":"SorisDynasty","date":"2015-12-16T14:39:11.451+0000","up_votes":1,"down_votes":0,"body":"Es ist schräg, weil du davor den *Stern* fürs Multiplizieren genutzt hast und in der nächsten Zeile beendet. Der startet dann eben Kursiv. In der anderen Zeile fehlt der \"Schluss\", also bleibt es normal.\n*kursiv*\n*nicht kursiv","replies":[{"poster":"Stealth Cat","date":"2015-12-16T14:58:39.365+0000","up_votes":1,"down_votes":0,"body":"Okay, danke. Ich schau mal ob ichs richtig hinbekomme.","replies":[]}]}]}]}]}]}]},{"poster":"Synatics","date":"2015-12-16T09:26:34.335+0000","up_votes":2,"down_votes":0,"body":"Ich hab das Spiel mal angesehen und das war ne Full AD Sona mit Tryforce und Infinity Edge. Dich als kleine Soraka nimmt die zum Frühstück mit so gefeedet wie sie war. Also ich kann nicht sehen das eine Spielmechanik kaputt ist, alles ist somit in Ordnung.","replies":[]},{"poster":"SorisDynasty","date":"2015-12-15T20:38:48.924+0000","up_votes":2,"down_votes":0,"body":"Sona, auf AD gebaut, kann ganz normal critten wie andere Champions, die eben so bauen. Und ja, dann haut man auch solche Crits raus. Ich kann dir auch mit Fiddlesticks solche Crits geben.\nLiterally facepalmed due to this thread.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-12-15T23:31:32.765+0000","up_votes":1,"down_votes":0,"body":"Sona hat doch keinerlei AD Skalierungen... also außer ihren Powerakkord und (natrülich) ihre Auto Attacks... \nWas halt dazu führt, dass eine AD Sona mehr Schaden macht als eine AP Sona... aber sie wird nicht mehr Schaden machen als eine AD Tristana oder Vayne..\n\nGenau so gut könntest du dich jetzt beschweren, dass eine Tank Sona mehr aushält als eine AP SOna...","replies":[]},{"poster":"Schesam","date":"2015-12-15T20:09:11.300+0000","up_votes":1,"down_votes":0,"body":"Wieso sollte in AP-Champ, der Full AD crit baut nicht auch hohe crits haben können? xD Zumal Sonas AA ja noch verstärkt sind.","replies":[]},{"poster":"haha weed lol xd","date":"2015-12-15T20:04:34.348+0000","up_votes":1,"down_votes":0,"body":"was :D","replies":[]},{"poster":"Cat me if U can","date":"2015-12-15T20:04:02.208+0000","up_votes":1,"down_votes":0,"body":"?!?","replies":[]}]}