{"poster":"Tattersall","date":"2016-11-05T20:00:30.779+0000","title":"Y'know how yordle lore is being changed?  My sudden thoughts on Kennen.","subforum":"Story, Art, & Sound","up_votes":19,"down_votes":1,"body":"I just had a thought about how the lore change will affect Kennen.  It won&#039;t.  \r\n\r\nBasically, yordles are now spirits.  I just now realized that it&#039;s possible that they also count as the kind of spirits that Shen deals with.\r\n\r\nThe Kinkou Order&#039;s goal is to create balance between the human and spirit worlds, so it would make perfect sense to have a balanced Triumverate as well.  Akali is the human, Kennen is the spirit, and Shen is \r\n&gt; An enigma to the shadowy realm of the spirits, as well as the mortal territories of man, Shen belongs to neither. Within him exists an uneasy fusion of human soul and arcane power.","replies":[{"poster":"ArnoldSchwarzens","date":"2016-11-05T21:13:43.337+0000","up_votes":11,"down_votes":0,"body":"> Basically, yordles are now spirits.\n\nCan someone give a link to where this is mentioned?","replies":[{"poster":"yoshi2790","date":"2016-11-05T22:03:04.085+0000","up_votes":2,"down_votes":0,"body":"yes, please","replies":[{"poster":"The Letter H","date":"2016-11-05T23:58:57.358+0000","up_votes":10,"down_votes":0,"body":"It was ~~hinted~~ announced in Kled's q&a by some rioters when someone asked. Also in Kled's lore it was hinted at as well. (Hence why someone asked)\nThen I believe in a Player post about Lulu and how she fits in the yordle spirit lore and a rioter said they were pretty accurate/right and something.\n\nEDIT:\nThe Kled Q&A comment(s):\n**Solideus **asked:\n\"In his bio Kled and Skaarl are called \"an old man\" and \"a pony\" respectivelly. Could you elaborate on this? Is this hinting at a new way yordle-ness works?\"\n\nand **_WAAARGHBOBO_** (A rioter) answered:\n\"Well observed. Yordle Lore coming soonish I believe. They interact with the physical world and manifest in peculiar ways. So how YOU would see them is quite different compared to how a child or Garen might. Even Lux would see Kled slightly differently than her brother does because her relationship with magic and that heroic ideal is different than Garen's.\"\n\nHope this helps!","replies":[{"poster":"ArnoldSchwarzens","date":"2016-11-06T00:31:54.798+0000","up_votes":2,"down_votes":0,"body":"Thanks!","replies":[]}]}]}]},{"poster":"Sharjo","date":"2016-11-05T20:05:02.800+0000","up_votes":12,"down_votes":1,"body":"> Basically, yordles are now spirits. \n\nEr...not really. Hard to perceive magical people's a better way to describe them. They're a species of sentient organisms that live in Runeterra just like humans, trolls, marai, brackern, ursine, darkin, minotaurs and whatever the sod Fizz's people are called, but their magic makes them hard to perceive for non-magical beings. Not spirits, who're non physical entities of the spirit world.\n\nBut yeah the idea you've got going about the triumvirate's balance between the human and spiritual worlds through Akali (Human), Kennen (Spiritual) and Shen (Balance itself) is one I can definetly get behind and have been wondering about since Shen's updated lore. But Kennen's on that side in this theory not because he's a spirit, but because of his innate yordle magic and perception of things beyond the physical. He's basically well suited to his task just in being a yordle.","replies":[{"poster":"DeathTheHorseman","date":"2016-11-05T21:17:37.025+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Sharjo,realm=EUW,application-id=6kFXY1kR,discussion-id=xEOtZsOM,comment-id=0000,timestamp=2016-11-05T20:05:02.800+0000)\n>\n> But yeah the idea you&#x27;ve got going about the triumvirate&#x27;s balance between the human and spiritual worlds through Akali (Human), Kennen (Spiritual) and Shen (Balance itself) is one I can definetly get behind and have been wondering about since Shen&#x27;s updated lore. \n\n\n\nCough Cough \n\nAkali (Trainer), Kennen (pokemon) and Shen (Mew Two)","replies":[]},{"poster":"Tattersall","date":"2016-11-05T20:22:49.364+0000","up_votes":1,"down_votes":0,"body":"I find this agreeable.","replies":[]}]},{"poster":"morris1","date":"2016-11-06T05:57:53.164+0000","up_votes":2,"down_votes":0,"body":"So, now it's basically canon that {{champion:17}} is Satan.","replies":[]},{"poster":"reaperteaser","date":"2016-11-05T21:01:19.902+0000","up_votes":1,"down_votes":0,"body":"and zed is a fusion/abomination of spirit and man?","replies":[{"poster":"Tattersall","date":"2016-11-05T21:34:02.107+0000","up_votes":1,"down_votes":0,"body":"…That's what Shen is.  Zed has no relation to the Kinkou Order OR Shen, other than through personal goals.  As far as I know, Zed doesn't give a flip about spirits in general.","replies":[{"poster":"reaperteaser","date":"2016-11-05T21:38:10.595+0000","up_votes":1,"down_votes":0,"body":"i thought zed was the outcast of the order? still working towards his own view of balance","replies":[{"poster":"Tattersall","date":"2016-11-05T22:00:52.760+0000","up_votes":1,"down_votes":0,"body":"Yeah, that's true.  I guess I explained my point poorly, let me try again.\n\nZed and the Kinkou Order have no… \"professional\" relationship.  Shen and Zed are against each other on a personal level, but Shen's duty doesn't involve Zed (yet).\n> Every part of [Shen] wanted to dash at [Zed]. To avenge his father. But such was not the way of twilight.\n\nThe way of twilight is to keep the world in balance.  Zed *has* broken that balance, but Shen won't defeat him until he can do it without emotional reasons tied in.\n\nIt's true that Zed was a member of the Kinkou Order, but he's no longer really against them.  He was against his master and Shen's father, Kusho, because Zed viewed his mercy as a weakness (somewhat justifiably).  \nBasically, Kusho let Ionia's greatest and most horrific serial killer live, while Zed thought that they should kill him.  Shen agreed with Zed, but accepted the emotionless logic of his father's choice.\n\nBut I guess my entire point can be summed up by saying:  The Kinkou Order as a whole does not currently have \"defeat Zed\" at the top of their priorities, and vice-versa.","replies":[]}]}]}]}]}