{"poster":"Anonagon","date":"2017-09-25T21:45:55.229+0000","title":"Three trees dedicated to damage, and no Spell DPS Keystone?","subforum":"Gameplay","up_votes":135,"down_votes":12,"body":"Nearly every keystone from the existing system has some kind of parallel in the new Runes system, or at least something that fulfills a similar purpose. The sole exception is Deathfire Touch, which was the keystone which explicitly catered to Spell DPS and/or DOT based champions like Malzahar, Karthus, and Swain. \r\n\r\nThat&#039;s not to say there are no options in the new system for those champions (though the TLD and Stormraider&#039;s parallels have been directly nerfed for DOT champions). It&#039;s just there is no option that is a direct &quot;I want to have absurd DPS&quot; for them the way Press The Attack functions for ADCs.","replies":[{"poster":"Brascus","date":"2017-09-25T23:59:48.587+0000","up_votes":39,"down_votes":11,"body":"The new runes should have explicitly avoided adding damage, no parallels of the current system should have gone through for things like Thunder Lords, Death Fire etc","replies":[{"poster":"Hildebrand","date":"2017-09-26T00:01:34.769+0000","up_votes":3,"down_votes":44,"body":"lolwhat Electrocute is Thunderlords, like word for word.","replies":[{"poster":"Brascus","date":"2017-09-26T00:05:25.237+0000","up_votes":47,"down_votes":1,"body":"Jesus dude, your reading comprehension","replies":[]}]},{"poster":"Chembaron Yamada","date":"2017-09-26T01:05:50.128+0000","up_votes":19,"down_votes":2,"body":"Explicitly avoiding damage.... what are you expecting ADCs, mages, assassins etc to spec in then?\nIt would be kinda strange if I am playing Jinx and there is no option to increase my damage at all.","replies":[{"poster":"Brascus","date":"2017-09-26T01:21:28.769+0000","up_votes":18,"down_votes":5,"body":"They are meant to customize play patterns and strategies not give you clear damage/defensive output increases, otherwise whatever has the most synergy with your stats becomes mandatory undermining Riot's entire effort to give you pre-grame choice.\n\nIf you do add clear defensive/offensive boons it only hastens the arms race, and diminishes anything that does not fall into that category without it being extremely overpowered to compete in choice. ","replies":[{"poster":"KoKoboto","date":"2017-09-26T04:00:07.756+0000","up_votes":6,"down_votes":0,"body":"The new rune system gives damage but does so in multiple ways. This means that there isn't a mandatory option anymore for what runes you go. In comparison to what we got now where you ALWAYS go the same thing and once in awhile switch one thing.","replies":[{"poster":"Brascus","date":"2017-09-26T04:41:23.444+0000","up_votes":5,"down_votes":3,"body":"Unfortunately, despite the variety they are all tailored to have synergy with specific champions. When it comes to damage output you default on what gives you max output, Ezreal will never not take Electrocute and only champs like Ezreal can use it reliably and effectively.\n\nThe questions boil down to: what does the most damage? Someone has that figured out, the choice was gone before the question landed. It's Deathfire Touch for Malzahar all over again. ","replies":[{"poster":"DrCyanide","date":"2017-09-26T05:52:49.818+0000","up_votes":8,"down_votes":1,"body":"> Ezreal will never not take Electrocute and only champs like Ezreal can even use it.\n\nExcuse me, what? Electrocute can be used by anyone that fires 3 different damaging spells at a target or who fires 2 spells and uses an Auto Attack. That covers a *wide* range of champions, from every class and every play style.\n\nThere's a decent chance Ezreal could use Fleet of Foot or Phase Rush too, and those might be better if he's trying to sustain in a poke contest or if he wants to double down on kitting respectively (particularly if there's an Olaf ultimate on the other team).\n\nThere's just enough variance in these Runes I wouldn't say it's all decided just yet. ","replies":[{"poster":"Brascus","date":"2017-09-26T06:12:33.348+0000","up_votes":3,"down_votes":1,"body":"I re-read it, brain farted when it said attacks and only read abilities. \n\nIt's 3 unique attacks of any kind, but you got only 2 seconds, TLD gives you 3 seconds per hit, which means you can have a total exchange time of 6 seconds before failing to proc. \n\nThere's definitely a smaller roster of champions that will be able to do this reliably and safely, though almost everyone should be able to use it, there will be more reliable options for others. It's an improvement over TLD for sure, but it's not like TLD was even needed to begin with which is my main point because you pick the champion to fit the rune and not the rune to fit the playstyle.","replies":[]}]}]}]},{"poster":"TeCoolMage","date":"2017-09-26T07:29:26.950+0000","up_votes":4,"down_votes":1,"body":"I disagree, I play Anivia and Xerath and can see completely playstyle dependent synergy on each rune for these champions, some players will like celerity, ultimate hat, relentless hunter, magical foot ware, approach velocity, magical foot ware, etc more than the adaptive runes.\n\nIt's much more than the current runes and masteries, and while some runes may be 'more powerful' than others, you'll be *changing your playstyle to the runes* not changing your runes to your playstyle. Saying the most powerful runes are mandatory is like saying it's mandatory for one tricks to switch to meta champions. In the end trying to use the runes with the most numbers just brings up the same problems as playing champions you're not good at because they're strong","replies":[]}]},{"poster":"SweedishGunner","date":"2017-09-26T01:15:54.419+0000","up_votes":5,"down_votes":2,"body":"Yeah considering that's what current runes do for damage dealing champions.\n\nThe new rune system replaces old runes and masteries, so it's obvious it'd have damage options.","replies":[]}]}]},{"poster":"Chembaron Yamada","date":"2017-09-25T22:10:56.071+0000","up_votes":21,"down_votes":2,"body":"Well, Deathfire Touch _kinda_ is there, but in a way weaker form.\nThe rune \"Scorch\" is doing something similar. But it's cooldown makes it less effectiv for DPS.","replies":[{"poster":"AirKingNeo","date":"2017-09-26T00:59:41.063+0000","up_votes":23,"down_votes":0,"body":"It's a poke rune.","replies":[{"poster":"Chembaron Yamada","date":"2017-09-26T01:04:06.316+0000","up_votes":3,"down_votes":0,"body":"I know, hence why I said the cooldown makes it less effective for DPS. 20 seconds CD makes it ok for poke, but the DPS is almost not existent.\n\nJust saying that it still works similar to Deathfire Touch, just that it isn't a permanent effect anymore, but has a cooldown.","replies":[]}]}]},{"poster":"YuGiHo","date":"2017-09-25T22:39:25.811+0000","up_votes":1,"down_votes":0,"body":"Maybe the Coming Soon rune will be the one","replies":[{"poster":"Critmaster Garen","date":"2017-09-25T23:32:53.979+0000","up_votes":13,"down_votes":0,"body":"> [{quoted}](name=YuGiHo,realm=NA,application-id=3ErqAdtq,discussion-id=Hn82A7do,comment-id=0003,timestamp=2017-09-25T22:39:25.811+0000)\n>\n> Maybe the Coming Soon rune will be the one\n\nthe missing rune is an upgraded bandit mastery.\n\n> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=LcQ9gOKy,comment-id=0002,timestamp=2017-09-25T22:31:49.485+0000)\n>\n> Few more details:\n> \n> * This works like Sheen - after you use a spell your next auto attack gets bonuses.\n> * At present those bonuses are slightly increased AA range (50 for ranged/125 for melee), gold generation on hit (like Spellthief&#x27;s) and a small chance to get a consumable item (could be a health pot, a mana pot, or occasionally, late game in particularly, something like an Oracle&#x27;s Elixir or Elixir of skill).\n> * Looter (not final name) is still more work in progress than other keystones, so details will change more. It&#x27;ll hit PBE tomorrow, but balance will probably be off and there&#x27;ll almost certainly be some noticeable bugs still with it.","replies":[{"poster":"What Is Smite","date":"2017-09-26T02:09:43.641+0000","up_votes":22,"down_votes":0,"body":"CAN IT BE?!?! Mana potion and Oracles are Returning to the RIFT?!?!","replies":[{"poster":"CytheGuy","date":"2017-09-26T02:43:05.129+0000","up_votes":15,"down_votes":1,"body":"https://pbs.twimg.com/profile_images/438088397614100480/Tk4KWKCm.png","replies":[]}]}]},{"poster":"Anonagon","date":"2017-09-25T22:42:47.615+0000","up_votes":10,"down_votes":0,"body":"Riot has said that the Inspiration tree isn't supposed to provide any direct offensive power, so I highly doubt that a DPS keystone will show up there","replies":[]}]},{"poster":"SweedishGunner","date":"2017-09-25T23:54:24.245+0000","up_votes":15,"down_votes":0,"body":"Exact same thing crossed my mind. Some of the new runes are basically just copy pastes of current masteries (with a few changes) but DFT is nowhere to be found and I'm not sure why?","replies":[{"poster":"Kaeblen","date":"2017-09-26T01:30:06.540+0000","up_votes":3,"down_votes":0,"body":"There was an issue trying to balance DFG right when it was released.\n\nIt was super effective on people who already dealt damage-over-time-debuffs. \n{{champion:90}} \nUnfortunately, that group--clearly the one that most wanted the keystone--was explicitly considered to be NOT the target audience to receive it.\nI'd guess it's removal comes down to that.","replies":[{"poster":"CytheGuy","date":"2017-09-26T02:41:03.202+0000","up_votes":2,"down_votes":0,"body":"DFT*\n\n(RIP DFG)","replies":[]}]},{"poster":"Thryale","date":"2017-09-26T00:01:09.029+0000","up_votes":3,"down_votes":0,"body":"if I were to hazard a guess, it's prob because most ppl picked the 3-hit proc mastery instead for most mages, simply because burst dmg is more impactful than slow dmg ticks.\n\nbut what do I know? I haven't been playing much recently, so I could be completely wrong.","replies":[]}]},{"poster":"Naalith","date":"2017-09-26T02:39:46.421+0000","up_votes":12,"down_votes":2,"body":"I think the problem with Deathfire Touch is that it is literally a must take on a super small subset of characters, and completely useless to everyone else (with some edge cases like Jhin where he might spec into it or Warlords). I'm glad Deathfire is gone, they can just buff the DoTs on the champions who require it and that opens up the ability for them to actually deviate into different Rune builds, rather than every single person taking the same stupid keystone.","replies":[{"poster":"Anonagon","date":"2017-09-26T03:08:27.705+0000","up_votes":11,"down_votes":0,"body":"I don't mind the loss of DFT in particular, I just find the lack of any dedicated keystone options to cater to DPS and/or DoT mages kind of silly, given that there are three almost exclusively for ADCs, two of which are straight damage increases, and five damage options for burst and poke damage playstyles, none of which clearly fit DPS playstyles.","replies":[]}]},{"poster":"Shepherd o Souls","date":"2017-09-26T10:33:47.147+0000","up_votes":7,"down_votes":0,"body":"inb4 {{champion:17}} is throwing rocks across the map everytime you step on a shroom kappa.","replies":[{"poster":"PEEPEEPÖÖPÖÖ","date":"2017-09-26T13:49:45.918+0000","up_votes":8,"down_votes":0,"body":"that will be great to watch lol","replies":[]}]},{"poster":"DeathBurst","date":"2017-09-26T04:34:25.029+0000","up_votes":3,"down_votes":1,"body":"I'll venture a guess and say that it's probably on purpose. DFT was absolutely non-interactive and a bad design for a Keystone in that new system, and Riot probably doesn't want AP reaching the same DPS as ADC, because they want the different classes to still feel distinct enough.\n\nI think Aerie or Phase Rush are decent Keystone for the class of Mages you have in mind, but yes, they are not huge DPS boost like Press the Attack can be.","replies":[{"poster":"Nyarlathοtep","date":"2017-09-26T13:25:03.160+0000","up_votes":2,"down_votes":1,"body":">  Riot probably doesn't want AP reaching the same DPS as ADC, because they want the different classes to still feel distinct enough.\n\nThis sounds so stupid. Some mages are tailored towards dealing high dmg.","replies":[{"poster":"DuskDaUmbreon","date":"2017-09-26T14:21:20.135+0000","up_votes":1,"down_votes":3,"body":"High damage, yes. But not high _sustained_ damage.","replies":[{"poster":"Doozku","date":"2017-09-26T15:06:54.834+0000","up_votes":8,"down_votes":0,"body":"{{champion:268}} {{champion:69}} {{champion:30}} {{champion:90}} {{champion:136}}{{champion:50}} ?","replies":[{"poster":"DuskDaUmbreon","date":"2017-09-26T15:13:10.947+0000","up_votes":1,"down_votes":4,"body":"Azir's either the worst or second-worst mage right now, right next to Ryze. Another DPS mage. Although he was gutted for different reasons, his DPS _did_ play a factor in it.\n\nMalzahar is still technically burst. DPS-burst, if that makes any sense at all. While he technically does DPS, he does so in a very burst-y way, like Morgana does. DPS, but on a cooldown similar to a burst mage's.\n\nKarthus hasn't been seen in top tier in ages. Hell, except for one game where they played Karthus into my Poppy, and in URF, I'm the only one I've seen play Karthus this season.\n\nAurelian Sol...Haven't really seen him, either. I know there's this one guy in pro play that uses him, but I don't think I saw him play it, and couldn't tell you his name. Only seen him in about 3-5 matches this entire season, and two of those were bot matches, and in one of those bot matches I was playing him.\n\nCass...Fuck. I haven't even seen her in a match outside of bots this season, either, and only controlled by the AI. Although she _has_ been in pro-play recently, I just haven't seen her.","replies":[{"poster":"Poske","date":"2017-09-26T15:35:17.247+0000","up_votes":3,"down_votes":0,"body":"Ugh alright let me tell you some stuff about them since I see them often enough\n\n\nKarthus is top tier Toplaner and has its niche\nMalzahar is borderline broken champion without a bad matchup \nAurelion sol is the most absurd roamer in a game and none can match his waveclear\n\nStatistcly speaking\n\nBoth malzahar and aurelion are on and off master/chall tier champions infact malza is top tier in multiple lanes\n\nKarthus is curently diamond tier champion (diamond tier stands for strong)\n\nplat is above average\ngold is  average\n\n\nCass is just a consistent dps champion I do feel like she is slightly overated specially since last nerf\n\n\nAzir ll be even in a worse state once rework comes out...","replies":[]}]}]}]},{"poster":"DeathBurst","date":"2017-09-26T16:25:34.832+0000","up_votes":3,"down_votes":0,"body":"I never said \"Riot doesn't want mage with high DPS **at all**.\" I said \"Riot doesn't want mage with DPS as high as ADC.\" Which is a subtle but important nuance.","replies":[]}]},{"poster":"Anonagon","date":"2017-09-26T04:53:07.935+0000","up_votes":3,"down_votes":0,"body":"DFT was a bad design, I'll agree with you on that. I don't want to see its return, I just want to see a loose replacement.\n\nI don't think its impossible for Riot to design a Keystone that simultaneously acts as a significant DPS boost for DPS mages while also playing up what makes them different from ADCs. They've got some clever people working there.","replies":[]}]},{"poster":"Red Wreckage","date":"2017-09-26T05:42:39.395+0000","up_votes":3,"down_votes":0,"body":"Wait, I just read:\n\n\"We’re combining runes and masteries into a single, streamlined system that you can use to adapt and customize your playstyle in champ select....\"\n\n\ndoes this mean there will be no masteries at all?  Only runes?  earlier I thought only runes system will be changes and we'll get to have runes and masteries separately like before","replies":[{"poster":"Cheekynorth","date":"2017-09-26T07:08:31.085+0000","up_votes":7,"down_votes":0,"body":"I think they combined them sorta. No more masteries, no more runes. Only this new system","replies":[]},{"poster":"DracosKasu","date":"2017-09-26T16:13:55.430+0000","up_votes":3,"down_votes":1,"body":"Since they are quite similar in what is they are doing it doesnt brother me. And will be easier to balance each tree. Remember that you need to choose one major tree and minor tree for the smaller effect rune inside.","replies":[]}]},{"poster":"LazyW0lf","date":"2017-09-26T02:08:32.613+0000","up_votes":5,"down_votes":0,"body":"During their stream, Phreak stated that the Keystone \"Press the Attack\" will be adaptive so champions who build AP can still get AP from it.","replies":[{"poster":"Anonagon","date":"2017-09-26T02:30:05.018+0000","up_votes":7,"down_votes":0,"body":"That's helpful for AP/On-Hit champions like Kayle and Teemo, but it still requires you to deal damage through autoattacks, meaning its not useful for your Karthuses.","replies":[{"poster":"Lord Jericho","date":"2017-09-26T14:01:41.634+0000","up_votes":2,"down_votes":0,"body":"Press the Attack only states that attacking the same champ grants stacks, not specifically auto attacks.","replies":[]}]},{"poster":"Lord Jericho","date":"2017-09-26T16:30:28.402+0000","up_votes":2,"down_votes":0,"body":"Can you give a link to that stream please?","replies":[]}]},{"poster":"lykkelas","date":"2017-09-26T08:17:18.773+0000","up_votes":2,"down_votes":1,"body":"there's no crit options either. and only like 2 MR things and like one armor thing","replies":[{"poster":"Voluug13","date":"2017-09-26T15:31:27.182+0000","up_votes":5,"down_votes":0,"body":"> there's no crit options\n\n{{champion:157}} he is to blame","replies":[]}]},{"poster":"Sir Fuzzi","date":"2017-09-25T23:43:16.960+0000","up_votes":1,"down_votes":2,"body":"I want numbers readouts on DFT because I've never been convinced it's any good on anyone except Jhin, who honestly doesn't really care about anything else when his DFT clocks out like 300 damage on its own.\n\nEveryone else is lucky to run 100-150 off a full proc. I was never sure if it was even a good option because you could rely on TLD a lot easier than DFT.\n\nMaybe it's time to evolve the concept for runes.","replies":[{"poster":"EkyonKun","date":"2017-09-25T23:56:47.560+0000","up_votes":3,"down_votes":0,"body":"It's a great late game scaling keystone. Its damage is also doubled by certain spells, so it can do some crazy damage later. It also easily does more damage than TLD at levels 1-2. I'm not saying it's godly or anything, but it's a solid keystone given the right circumstances.","replies":[{"poster":"Sir Fuzzi","date":"2017-09-26T00:05:11.390+0000","up_votes":1,"down_votes":0,"body":"Late-game Deathfire Jhin is some of the most amusing shit. It'll basically double his W's damage output, and nobody ever expects it.\n\nEvery time I see Jhin take anything but DFT I cry a little. The sheer potential he wields with it is just too good, I think.","replies":[{"poster":"Firethorn","date":"2017-09-26T01:24:50.967+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sir Fuzzi,realm=NA,application-id=3ErqAdtq,discussion-id=Hn82A7do,comment-id=000700000000,timestamp=2017-09-26T00:05:11.390+0000)\n>\n> Late-game Deathfire Jhin is some of the most amusing shit. It&#x27;ll basically double his W&#x27;s damage output, and nobody ever expects it.\n> \n> Every time I see Jhin take anything but DFT I cry a little. The sheer potential he wields with it is just too good, I think.\n\nThought warlords was better on him now?","replies":[{"poster":"robot takeover","date":"2017-09-26T02:03:51.634+0000","up_votes":5,"down_votes":0,"body":"both are viable.","replies":[]}]}]}]}]},{"poster":"XIII Vanitas","date":"2017-09-26T11:25:01.912+0000","up_votes":3,"down_votes":0,"body":"There's still Scorch, which is a normal rune (not a keystone).","replies":[]}]}