{"poster":"Feyangol","date":"2016-05-16T15:50:35.313+0000","title":"Gebt dem Support Liebe","subforum":"Champions & Gameplay","up_votes":12,"down_votes":5,"body":"Moin,\n\nmir scheint es aktuell so, als ob die Rolle des Supports auf sehr wenige Spieler zugeschnitten ist (n&auml;mlich die obersten 5% der LoL Spieler). Es ist kein Geheimnis, dass der Support eine sehr unbeliebte Rolle ist. Wenn man keine Wartezeiten will, kann man einfach Support spielen, weil immer nach welchen gesucht wird. Das ist kein Wunder, da der Support das Laufm&auml;dchen aller Lanes sein soll und dann auch noch mit (verglichen zu anderen Rollen) dem niedrigsten Einfluss auf das Spiel belohnt wird. Versteht mich nicht falsch, ein guter Support kann mehrere Lanes zum Snowballen bewegen, indem er selber auf Gold und Erfahrung verzichtet (indem er kaum Minions und Kills nimmt und durchs Roamen und Warden nicht auf der Lane ist), doch ist grade diese Spielweise sehr riskant, da man sich f&uuml;r die meisten elo Bereiche nicht auf seine Teammates verlassen kann, dass sie die F&uuml;hrung, die man ihnen erarbeitet hat, nutzen, um auch das Spiel zu gewinnen.\n\nUmso mehr verwundert es mich, dass grade die Rolle die sich f&uuml;r andere aufopfert auf genau dem selben Weg skaliert wie alle anderen Lanes. Das aktuelle LoL belohnt in keinster Weise die Spielweise eines Supporters. Von wo gibt es das Gold, das man auch als Supporter braucht? Von Kills und Minions, die man nicht nehmen soll. Warum wird man als Support nicht f&uuml;r eine unterst&uuml;tzende Rolle belohnt und warum ist eine eigenn&uuml;tzige Spielweise als Support effektiver, um selber den Ausgang seines Spieles zu beeinflussen? Wenn man kaum Items und Erfahrung bekommt (also einen traditionellen Support spielt), schwindet der Einfluss auf das Spiel.\n\nEs f&uuml;hlt sich aktuell nicht so an, dass der Support eine Rolle ist, die auch wirklich gewollt ist. Man skaliert gleich, allerdings hat man komplett unterschiedliche Aufgaben als der Rest des Teams. Es gibt einige Items, die speziell f&uuml;r den Support gedacht sind. Immer wenn ich diese Items sehe, denke ich mir, dass man sie absichtlich relativ schwach halten muss, damit normale Lanes sie nicht einfach nehmen und unglaublich effizient gute stats bekommen (ich erinnere mich als Targons eingef&uuml;hrt wurde und es ein gutes Item f&uuml;r jeden Support war und dann nicht nur in der Support Rolle gepickt wurde). \n\nWas ich hiermit sagen will:\nDer Support ist eine Rolle, die haupts&auml;chlich auf high elo Spieler zugeschnitten ist. Eine unterst&uuml;tzende Spielweise wird vom Spiel nicht belohnt und kann der eigenen F&auml;higkeit, als Support auch im ranked zu steigen, schaden, wenn man nicht mit sowieso starken Spielern zusammen spielt. Es ist keine eigenst&auml;ndige Rolle, sondern eine Art Anh&auml;ngsel an das eigentliche Team, dessen Kerngegenst&auml;nde (deren Ziel Gold- und Erfahrungseffizienz sind) absichtlich schwach gehalten werden m&uuml;ssen, damit andere Rollen sie nicht ausnutzen.\n\nDeswegen bin ich der Meinung, dass die Support Rolle &uuml;berarbeitet werden soll. Der Support muss ...\n... daf&uuml;r belohnt werden eine unterst&uuml;tzende Spielweise zu haben.\n... weniger abh&auml;ngig von der Leistung seines Partners sein.\n... seine _eigenen_ Items haben.\n... weniger an Lanes gebunden sein.\n\nDas k&ouml;nnte funktionieren indem man Items einf&uuml;hrt, die krasse Einschnitte in traditionelle Gold und Erfahrungsquellen haben, aber lohnenswert sind, wenn man eine unterst&uuml;tzende Rolle haben will. Ich denke an Nachteile wie &quot;50% weniger Gold und Erfahrung von Minions&quot; und &quot;25% weniger Gold von Championkills&quot;, die kombiniert werden mit Vorteilen, die einem mehr Gold f&uuml;r Assists geben und eine erh&ouml;hte passive Erfahrungsrate bringen, damit man weniger zur&uuml;ckf&auml;llt, wenn man 1-2 waves an Erfahrung durch einen Roam verpasst.\n\nAlso was denkt ihr? Braucht die Rolle des Support ein Rework?\n\nEdit:\nWenn ihr so weit gelesen habt, dann solltet ihr vielleicht wissen, dass ich absichtlich eine übertriebene Wortwahl genutzt habe, um diesen Beitrag etwas provokativer darzustellen. Nehmt nicht alle Stellen wörtlich (z.B. kommt mir direkt meine Wortwahl \"Laufmädchen des Teams\" in den Kopf für eine solche Übertreibung).","replies":[{"poster":"Sihari","date":"2016-05-16T16:15:17.945+0000","up_votes":4,"down_votes":1,"body":"An sich wäre ich dafür, dass man neue Items herausbringt, die für einen Support das Spielen angenehmer machen. \nLeider musste ich in der Vergangenheit feststellen, dass man den Supportern wenig gutes tn kann, ohne zu riskieren, dass andere Lanes das eiskalt ausnutzen. Zum Beispiel wurde nicht nur versucht das Gold vom Anrecht der Frostkönigin für Midlaner unerreichbar zu machen, sondern das gesammte Item wurde gleich mit generft, was vor allem manahungrigen Supports das Leben sehr schwer gemacht hat. (Denkt überhaupt wer an die arme Nami mit 130 Mana pro W? q.q)\n\nUnd auch die Abhängigkeit von den Teammitgliedern wird nie weniger. Gerade eben erst habe ich in einem Ranked glück gehabt, dass mein ADC gut mit mir Komunizieren konnte. So hat es sich gelohnt, wenn ich mich geopfert habe und der ADC konnte später ordentlich durchstarten. Hätte die Komunikation aber nicht geklappt, dann hätte ich am Ende als Feeder ohne Gold und EXP dagestanden.\n\nEin Item, dass einem das Roamen ermöglicht und vlt ähnlich wie Bards Glocken funktioniert wäre natürlcih sehr von Vorteil. Kaum ist man einmal Wards aufstellen hat man einen heftigen EXP-Nachteil. Von einem Trip zur Mid- oder gar Toplane möchte ich überhaupt nicht reden...","replies":[]},{"poster":"hshtagniemehrcdu","date":"2016-05-16T16:07:16.362+0000","up_votes":4,"down_votes":1,"body":"> Das ist kein Wunder, da der Support das Laufmädchen aller Lanes sein soll und dann auch noch mit (verglichen zu anderen Rollen) dem niedrigsten Einfluss auf das Spiel belohnt wird. \n\nIch denke, dass genau diese Einstellung das Hauptproblem ist.\nAls ich mit Ranked anfing, habe ich in Bronze gestartet (altes System), war aber auf Silber-Niveau nach zahlreichen normals.\n\nMeine Matchhistory war grün, mit Soraka und co.\nBuild: 3x Gold/10 und 15 Wards+ Oracle.\n\nViele Supporter haben eine höhere Winrates als Champions wie LB, Lee Sin, oder Yi.\nAuch in Low-Elo.\nWeil sie keinen Einfluss haben?\n\nLaut LolKing sind unter den 20 Chamos mit der höchsten Winrate 6 Supporter.\nEs gibt 5 Rollen.\n\nAls Dmg-Support (Brand/Zyra z.b.) habe ich regelmäßig einen höheren Schadensoutput als mein Midlaner/Adc.\nAls Tank (Leona/Ali) initiiert man die Kämpfe und ist für den start eines Teamfights entscheident.\nUnd man kann verdammt effektiv roamen und ganken.\n\nDie Laning-Phase wird meist komplett vom SUpport dominiert, da er hauptsächlich über Poke/Engage/Disengage entscheidet, während der ADC farmen will.\n\nSightstone-Wards sorgen dafür, dass du bevor die Kämpfe starten einen massiven VOrteil erarbeiten kannst.\nHast du keine Vision, kannst du die Objekte gleich aufgeben.\n\nIch halte deine Einstellung von Grund auf für vollkommen falsch in jeglicher Hinsicht.\n\nMal ne andere Frage...\nNehmen wir einen Support-Main, der seit 100 Spielen in Silber 3 ist.\nNach deiner Aussage müsste er dann problemlos aufsteigen können, wenn er die Rolle wechselt, richtig?\nDenn wenn er in jedere anderen Rolle mehr Einfluss hat, und allein mit Support S3 ist, müsste der Aufstieg mit einer anderen Lane mit höherem Einfluss ein Klaks sein, oder?","replies":[{"poster":"Feyangol","date":"2016-05-16T16:41:14.156+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Cantabrum,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=0001,timestamp=2016-05-16T16:07:16.362+0000)\n>\n> Ich denke, dass genau diese Einstellung das Hauptproblem ist.\n> Als ich mit Ranked anfing, habe ich in Bronze gestartet (altes System), war aber auf Silber-Niveau nach zahlreichen normals.\n> \n> Meine Matchhistory war grün, mit Soraka und co.\n> Build: 3x Gold/10 und 15 Wards+ Oracle.\n> \n> Viele Supporter haben eine höhere Winrates als Champions wie LB, Lee Sin, oder Yi.\n> Auch in Low-Elo.\n> Weil sie keinen Einfluss haben?\n> \n> Laut LolKing sind unter den 20 Chamos mit der höchsten Winrate 6 Supporter.\n> Es gibt 5 Rollen.\n> \n> Als Dmg-Support (Brand/Zyra z.b.) habe ich regelmäßig einen höheren Schadensoutput als mein Midlaner/Adc.\n> Als Tank (Leona/Ali) initiiert man die Kämpfe und ist für den start eines Teamfights entscheident.\n> Und man kann verdammt effektiv roamen und ganken.\n> \n> Die Laning-Phase wird meist komplett vom SUpport dominiert, da er hauptsächlich über Poke/Engage/Disengage entscheidet, während der ADC farmen will.\n> \n> Sightstone-Wards sorgen dafür, dass du bevor die Kämpfe starten einen massiven VOrteil erarbeiten kannst.\n> Hast du keine Vision, kannst du die Objekte gleich aufgeben.\n> \n> Ich halte deine Einstellung von Grund auf für vollkommen falsch in jeglicher Hinsicht.\n> \n> Mal ne andere Frage...\n> Nehmen wir einen Support-Main, der seit 100 Spielen in Silber 3 ist.\n> Nach deiner Aussage müsste er dann problemlos aufsteigen können, wenn er die Rolle wechselt, richtig?\n> Denn wenn er in jedere anderen Rolle mehr Einfluss hat, und allein mit Support S3 ist, müsste der Aufstieg mit einer anderen Lane mit höherem Einfluss ein Klaks sein, oder?\n\nIch habe nicht gesagt, dass der Support keinen Einfluss auf das Spiel hat, nur dass er den geringsten hat.\nEs ist nichts neues für mich, dass der Support die Laning Phase dominiert und auch weiß ich, dass man als Dmg- Support gut und gerne den Schadensgraph anführen kann (ich habe mit Zyra vor und nach dem Rework sehr oft gespielt), das Problem ist, dass das alleine nicht reicht, um das Spiel entscheidend zu beeinflussen.\n\nSo wie du es formuliert hast: Der Support hat eine wichtige Rolle. Er sorgt für Vision, er beschützt den Adc, er dominiert die Laning Phase auf der Botlane, aber er wird für keine dieser Aufgaben anders belohnt als mit der Hoffnung, dass das Team etwas mit diesen Leistungen anfängt. Er wird nicht dazu ermutigt diese Aufgaben zu erledigen, da er geringe Mengen an Gold und Erfahrung dafür bekommt. Dadurch dass man versucht seinem Team zu helfen, wird man als Support schwächer und schwächer im Verlauf des Spiels. Ich will nicht, dass man einen weiteren Carry auf die Botlane platziert, sondern dass man als Support mit mehr Möglichkeiten im Spiel belohnt wird, wenn man das macht, was man von einem Support erwartet.\n\nUnd nein, der Support Main würde wahrscheinlich nicht aufsteigen. Es sind unterschiedliche Aufgaben, die man als Support hat und es lässt sich nicht so einfach übertragen. Außerdem hat man unterschiedliche Spielstile und man ist unterschiedlich erfolgreich in den einzelnen Rollen.","replies":[{"poster":"hshtagniemehrcdu","date":"2016-05-17T06:35:45.215+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Feyangol,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=00010000,timestamp=2016-05-16T16:41:14.156+0000)\n>\n, aber er wird für keine dieser Aufgaben anders belohnt als mit der Hoffnung, dass das Team etwas mit diesen Leistungen anfängt. \n\n\nAber das gilt doch für alle im gleichem Maße.\nDer Jungler ist darauf angewiesen, das seine Lanes nicht schlafen.\nDer Tank-Toplaner ist darauf angewiesen, dass die Leute seinem Engage folgen.\nPoke-Champs, dass sein Team ihn poken lässt, und nicht sofort hard-engaged.\nAuch Assassinen, die einen Solo-Kill raushauen, sind darauf angewiesen, dass das Team hinterher die 4v5 Situation ausnutzt.\n\nInsofern finde ich nicht, dass die abhängigkeit des Supports von seinem Team größer ist als die, der anderen Rollen.\n\nMit einer der Vorteile der Supporter ist es ja, dass sie von ihrem Level viel weniger abhängen, als alle anderen.\nAlistar Knockup z.b. wird nicht wirklich stärker, und die Ult auf Lvl 6 ist bereits mehr als ausreichend.\nHier drin liegt auch ein großer Vorteil ggü. anderen Lanern, die der XP/Gold Verlust viel härter trifft, und ihre Fähigkeit zum roamen daher viel stärker einschränkt.\nDaher wirst du nie einen ADC sehen, der eine Lane nach der anderen gankt, und somit seinen Einfluss auf die ganze Karte ausdehnen kann, wohl aber bestimmte Supporter.\n\nIch sehe zwar dein grundlegendes Problem mit XP/Gold Verlust, sehe in dieser stärkeren unabhängigkeit aber weniger eine Schwäche als eine Stärke.\nEr kann es sich leisten, zu roamen, während andere es nicht können.\n\n\n> was man von einem Support erwartet.\n\nWas genau erwartest du denn?\n\n\n> Und nein, der Support Main würde wahrscheinlich nicht aufsteigen. Es sind unterschiedliche Aufgaben, die man als Support hat und es lässt sich nicht so einfach übertragen. Außerdem hat man unterschiedliche Spielstile und man ist unterschiedlich erfolgreich in den einzelnen Rollen.\n\nNehmen wir mal rhein theoretisch an, er würde Mid sogut wie Supp spielen, seine Fähigkeit 1:1 übertragen, wie sähe es dann aus?","replies":[{"poster":"Feyangol","date":"2016-05-17T12:24:59.823+0000","up_votes":1,"down_votes":0,"body":"Man braucht ja eine übertrieben formulierte Einleitung, damit man möglichst viele Leute dazu bekommt über das Thema nachzudenken ;) .\n\nJa, dass gesamte Team hängt von einander ab und deswegen ist LoL ja auch ein Teamspiel. Aber das ist auch gar nicht der Punkt, den ich mit meinem Satz machen wollte:\n\n>Er sorgt für Vision, er beschützt den Adc, er dominiert die Laning Phase auf der Botlane, aber er wird für keine dieser Aufgaben anders belohnt als mit der Hoffnung, dass das Team etwas mit diesen Leistungen anfängt. Er wird nicht dazu ermutigt diese Aufgaben zu erledigen, da er geringe Mengen an Gold und Erfahrung dafür bekommt.\n\nWie zitiert, sehe ich ein Problem darin, dass der Support sich selber keine Vorteile erarbeitet, dass er wie ein Support spielt und für Vision sorgt und er seinen Adc unterstützt. Wenn Riot schon die Meta mit den 5 Rollen Top, Jungle, Mid, Adc und Support als \"richtigen\" Spielstil proklamiert, indem sie diese Aufstellung für Ranked Games als gesetzt festlegen (man schaue sich die neue Championselect an), dann sollten sie auch jede Rolle entsprechend ihrer Aufgaben belohnen.\n\nIch kritisiere hier auch nicht die gesamte Rolle eines Supports, nur dass es viele kleine Baustellen gibt, die einem das Leben als Support unnötig erschweren und die Rolle als ganzes unattraktiv machen. Das wären ...\n... die Items, von denen man immer Angst hat, dass andere Lanes sie ausnutzen\n... das Warden und Roamen, das einem unnötig viel exp kostet\n... die Gebundenheit an eine zweite Person, die die eigene Leistung sehr stark beeinflusst (wenn es mit meinem adc nicht so gut läuft, kann ich nur Schadensbegrenzung durchführen und hoffen, dass die Laning Phase schnell endet; das Problem kann aber auch anders herum entstehen, weshalb es eher ein Duo Lane und nicht supportspezifisches Problem ist)\n\nWo du eine Stärke siehst, sehe ich einen Fehler bei dem Aufbau der Rolle.\nEs wird erwartet, dass der Support für Vision sorgt und hin und wieder bei guter Gelegenheit roamen geht. Allgemein finde ich roamen ein eher schlechtes Beispiel, da jede Lane davon profitiert möglichst viel Präsenz auf möglichst viele Teilen der Map zu haben. Der Support ist nicht die einzige Rolle, die gerne roamen geht, weshalb man in keinster Weise von \"es sich leisten\" sprechen kann. So muss man Champions aufbauen, die weniger abhängig von Exp und Gold sind, damit sie die Aufgaben eines Supports übernehmen können.\n\nUnd ich erwarte von einem Support, dass je nach den Bedürfnissen des Adcs ein oder mehrere lanes unterstützt, für Vision sorgt und plays für die seine Teammates auf unterschiedlichstem Wege ermöglicht, ohne dabei zu sterben. Habe ich da eine komplette Fehlwahrnehmung oder könnte man die Aufgaben eines Supports in etwa so beschreiben (vereinfacht, wir wollen hier kein Buch schrieben)?","replies":[]}]}]},{"poster":"GankMeOrLose","date":"2016-05-17T03:30:11.453+0000","up_votes":2,"down_votes":1,"body":"Nur mal meine Meinung:\n\n* Supports haben eine höhere Winrate weile jedes Team einen braucht und manche einfach gut sind in dem was sie tun, was mit der eigentlichen Aussage aber nichts zu tun hat\n* Deine \"Damage Supports\" sind aber eigentlich Midlaner. Es geht hier um traditionelle Supports und nicht um Midlaner die als Support gespielt werden weil auf einer Fähikeit CC haben und Zonen können (Brand)\n* Kämpfe initiieren kann man auch mit anderen dafür braucht es keinen Support. Klar gehört das im weitesten Sinne zu den Aufgaben des Supports aber nur weil du zu etwas fähig bist heißt das nicht das es auch dazu gemacht wurde (Deswegen spiele ich Leona auch als ihre primäre Rolle Tank im Jungle, das gleiche mit Alistar Toplane)\n* Gebe ich dir Ausnahmsweise Recht, hat aber dennoch das Problem das ohne einen vernünfitgen ADC du dir deine Lanedominanz and die Backe nageln kannst was wiederum heißt das man eigentlich keinen Einfluss hat. Denn wenn ich Sona spiele und den Gegner auf 100 Life poken kann liegt es dennoch am ADC diesen zu töten und das Gold zu nutzen.\n* Gebe ich dir wieder Recht, Sightstones geben einen gigantischen Vorteil. Doof nur das ein Support darauf angeweisen ist das sein Team besagten Vorteil nutzt denn wenn der Jhin nicht auf die Map schaut und dadurch den YI nicht sieht bringt euch das nichts und du hast dein weniges Gold noch uneffizienter genutzt\n* Der letzte Teil schweift vollkommen vom Thema ab und ist nur dazu gedacht den TE zu flamen. Geh mit deinem toxischem Verhalten wo anders hin\n\nFazit: Gebe ich dir an manchen Stellen schon Recht aber der Thread hat seine Berechtigung","replies":[]}]},{"poster":"HoloHoroHolo","date":"2016-05-17T08:39:17.262+0000","up_votes":2,"down_votes":0,"body":"Ich denke, dass das Problem darin liegt, dass so wenige Leute Support spielen, weil sie denken \"Mache ich Schaden, bin ich krass, dann carry ich das Game\".\n\nAbgesehen von den AP-Supportern ist der DMG-Output jedoch meist relativ gering. Deshalb mag es keiner.\n\nAber auch die Einstellung vieler ist sehr \"merkwürdig\". Ich denke nicht, dass es an der Supporter Rolle liegt. Eher an der Communitiy. Desto höher man in der Elo ist, desto angenehmer ist es auch als Supporter (aus meiner Sicht).\nFolgende Szene letztens in einem normal (Schnitt Silber): Eigener Jungler invadet Gegner kurz nachdem sich alle eigentlich zurückgezogen hatten. Er stirbt, weil er eindeutig zu weit geht. Was passiert? \"Supporter where are wards???\" (Wir hatten kurz vorher um Baron gefightet, weshalb da 3/3 wards standen^^). Ich habe darauf nicht geantwortet, da ich es besser wusste.\n\nAber es geht noch weiter. Klassisches \"kill steel\", welches auch hart geflamed wird, gibt es nur in niedrigerer Elo. \nÜblicherweise macht auch der ADC die ganze Arbeit, denn er macht den Schaden. Wenn der ADC/support 5v2 macht heißt es \"GJ ADC NICE ONE XPECE GOD\" blabla^^.\nDies liegt daran, dass die Leute einfach nicht sehen, was der Supporter machte (Peel, Stun, Schield, Heal....).\n\nKurz: Supporter sind an sich fein. Einzig allein die Community ist naja. :)\n\nLG\nSpicy","replies":[]},{"poster":"LyteHatesSoloQ","date":"2016-05-17T01:23:05.556+0000","up_votes":2,"down_votes":0,"body":"Gold das man braucht? Wir haben Supporter in diesem Game ,weil sie eben mit wenig Gold sehr effektiv sind!\n\n\nFür mich war die Supportrolle immer spannend. Seit season 2 habe ich Support gemained.\n\n\n\n\nMan wendet als Supportspieler das Maximalprinzip and und nicht das Minimalprinzip.\nDu musst mit den gegebenen Mitteln das maximale rausholen.\nDas war für mich immer sehr spannend und interrisant.\n\n","replies":[]},{"poster":"Cat me if U can","date":"2016-05-16T17:54:11.151+0000","up_votes":2,"down_votes":0,"body":"1. Man hat mehr Einfluss als Support auf das Spiel und vor allem auf die Botlane  wie du anscheinend glaubst.\n2. Du hast wahrscheinlich nicht vor Season 3 gespielt... da war Support nämlich schrecklich!","replies":[{"poster":"LyteHatesSoloQ","date":"2016-05-17T01:29:19.525+0000","up_votes":1,"down_votes":0,"body":"da muss ich widersprechen.\nIch habe Support geliebt in season 2 und season 3. \nMan hatte viel mehr impakt ,da der Einflussfaktor von Vision weniger vom Team abhängig war.\nIch konnte mehr warden.\nAuch die Orakelfights waren sehr cool in season 3.\n\nViele Leute bezeichneten den Supp als \"wardh*re\" für mich war die Supportrolle in season 3 ehr als \"Visiongott\" zu bezeichen!\nMan hatte einen riesigen impact in season 3 als support.\nWürde lieber auf das ganze extra gold verzichten und dafür wieder mehr wards platzieren xD","replies":[]}]},{"poster":"xCpt Blood Moon ","date":"2016-05-16T15:59:33.163+0000","up_votes":2,"down_votes":0,"body":"Safecall <3\n\nBester Mitarbeiter! direkt +1!\n\nLiebe Grüße! ^_^ {{champion:40}}","replies":[{"poster":"404 Clone","date":"2016-05-16T18:13:18.327+0000","up_votes":1,"down_votes":0,"body":"Ich bin Jungle/Supp Main (Shaco lvl 5, Blitzcrank lvl 5 und morgana lvl 5)","replies":[]}]},{"poster":"DrAnnoying","date":"2016-05-16T16:52:11.073+0000","up_votes":2,"down_votes":2,"body":">... dafür belohnt werden eine unterstützende Spielweise zu haben.\n\nwird man doch, oder was hast du da für Einfälle?\n\n>... weniger abhängig von der Leistung seines Partners sein.\n\nDu kannst Supporter carrylike oder auch halt supportend spielen, pick einfach mal Brand sup oder Ähnliches und du wirst \nsehen wie unabhängig Supporter sein können.\n\n>... seine eigenen Items haben.\n\nVerstehe ich ehrlich gesagt nicht so ganz, Sups haben eine Menge Items, sogar ne Menge, sogar einige mehr seit dem letzten patch\n\n>... weniger an Lanes gebunden sein.\n\nIst man ebenso nicht, jemand der z.B Bard gut beherrscht kann auch gut roamen gehen\n\nAlles in allem finde ich dass Supporter auch genug Einfluß im Spiel haben, nur wird diese Rolle meist nicht so gut gespielt und weniger gelobt (das ist auch schon alles..) als ein gefeedeter ADC\n\n& ich gebe Cantabrum recht","replies":[{"poster":"Sihari","date":"2016-05-16T17:25:22.190+0000","up_votes":1,"down_votes":3,"body":"Man wird eben nicht so sehr für eine supportende Rolle belohnt wie die anderen. Man ist stets mit einer weiteren Person auf der Lane oder beim roamen sogar komplett abgeschnitten von allen EXP-Quellen. Außerdem ist es weniger einfach an Gold zu kommen, welches für wichtige aktive Items benötigt wird.\n\n>     Du kannst Supporter carrylike oder auch halt supportend spielen, pick einfach mal Brand sup oder Ähnliches und du wirst\nsehen wie unabhängig Supporter sein können.\n\nBrand-Supp ist kein \"richtiger\" Supporter sondern ein weiterer Carry, der kaum die Funtion eines \"richtigen\" Supporters erfüllt. \nEs geht hier darum, die Möglichkeiten solcher\"richtigen\" Supporter zu verbessern, in dem man sie mit noch mehr speziellen Items differenziert.\n\n> Verstehe ich ehrlich gesagt nicht so ganz, Sups haben eine Menge Items, sogar ne Menge, sogar einige mehr seit dem letzten patch\n\nSupporter haben genau 3 unterschiedliche Items mit jeweils 2 verschiedenen Endstadien, welche ihnen helfen ihren Golddefizit auszugleichen. Trotzdem kommt man mit dem Gold niemals auch nur nahe an die Menge, die alle anderen Rollen zur Verfügung haben.\nDiese Items mussten zudem noch generft werden, da sie von anderen Rollen missbraucht wurden. Ich erinnere nur einmal an Frostqueens, das harte nerfs in den Stats bekommen hat, weil Midlaner goldgierig wurden und die passive auch ganz süß fanden...\nIm Vergleich dazu haben Jungler 3x4, also 12 verschiedene Möglichkeiten ihr Jungleritem zu bauen. Dabei sind diese Items nicht einmal notwendig um überhaupt an Gold/Exp zu kommen.\n\n> jemand der z.B Bard gut beherrscht kann auch gut roamen gehen\n\nBard ist somit auch der einzige Supporter, der während des Roamens eine EXP-Entschädigung bekommt. Alle anderen Supporter müssen zwischendurch auf einer Lane kleben und mit jemandem EXP teilen um nicht vollkommen hinterher zu hängen.\nDas ist ein ziemlicher Nachteil, wenn man bedenkt, dass Bard nicht in jede Combo passt...","replies":[{"poster":"DrAnnoying","date":"2016-05-16T18:24:01.251+0000","up_votes":2,"down_votes":0,"body":"Lies dir den Post von Cantabrum durch über mir, er erläutert das was ich meine nochmal besser.\n\nDas soll absolut keine diskriminierung sein, aber auf Bronze - Gold Elo (das hier ist ein smurf btw) ist es mir irgendwie klar, dass da einige die Meinung vertreten Supporter wären nicht Einflussreich im Spiel, ich und einige andere auf meiner Flst (die ich eben nebenbei gefragt hab) sind genau anderer Meinung als du, und ich habe auch Zahlreiche Spiele gehabt wo allein der Supporter der Grund für den Ausgang des Spiels war.\n\nUnd dass Brand kein richtiger supporter ist, ist allgemein gesehen mumpitz, fast alles kann als Sup gespielt werden, ich nehme nur an du meinst die ADC unterstützende Rolle, wobei sich das SUPPORTEN finde ich aufs gesamte Team beziehen sollte, sei es mit DMG, Ganks, Shields, passive etc.\n\nUnd zum letzteren, es wäre ja auch relativ traurig wenn fehlgeschlagene ganks nicht im geringsten gestraft werden, seit einigen Seasons (oder erst seit S06?) ist es ohnehin so, dass wenn man vom level hinterher hinkt recht schnell aufholen kann.\n\n\nJedenfalls würde es mir nicht schwer fallen dir beispiele zu zeigen die dir genau das beweisen was ich versuche zu erklären.","replies":[]}]}]},{"poster":"Cyrilya","date":"2016-05-18T07:01:45.427+0000","up_votes":1,"down_votes":0,"body":"Der Suporter hat weitaus mehr Impact auf das Spiel als einige denken. \n\nIch spiele seit einiger Zeit hauptsächlich Morgana als Supporter obwohl ich letzte Season total mit ihr verschissen habe. Als AP'ler kann ich mit ihr absolut nicht. \n---\nDu musst bspw. auf Botlane nur EINEN Snare richtig setzen, zack, Gegner ADC tot. Ging mir bereits mehrfach so. \n\nDas ganze zieht sich durchs komplette Spiel. Einmal den Snare oder Stun im richtigen Moment getroffen > BUM - Mega Engage, TF > Gegner geaced. \n---\nZumal sorgt der Support für Vision. \nWas die Gegner haben einen Fiddle der mit Level X den Drake machen könnte? > Ward dahin > Fiddle abgesnackt + Drake bekommen. GG. \n---\nDas einzige was mich am Supporter stört ist, dass sich die ADCs oft denken, dass man nur für sie da zu sein hat. Aber als Support unterstützt man das gesamte Team nicht nur den ADC. \nIch mag allgemein die Einstellung einiger ADCs nicht, die denken sie seien die Oberlappen nur weil sie einen vorbereiteten Kill abstauben können. \n--- \nIch supporte gerne. auch wenn ich gern mal wieder auf die Mitte möchte... Q_Q \nAber lieber spiel ich doch Support, weil ich so die Geschenisse des Spiels lenken kann :>\n\n\nAlso MEINER MEINUNG nach, ist der Support neben dem Jungle DIE einflussreichste Rolle im Spiel. Ein Fehler und dein ADC oder Mate könnte tot sein. :>","replies":[]},{"poster":"Killerkante","date":"2016-05-17T10:10:59.655+0000","up_votes":1,"down_votes":0,"body":"Das macht recht wenig Sinn die Spielebalance für die low-elo auf den Kopf zu stellen.\n\nAber ausschließlich für den Low-Bereich ... ich hab nämlich wenige Spiele erlebt wo der Supporter wenig Einfluß aufs Spiel hatte (außer derjenige ist schlecht als Support gewesen), das ist neben Jungle soziemlich die einzige Rolle mit so vielen Freiheiten was das gameplay betrifft und du hast indirekt auswirkungen auf ALLE lanes sofern du weißt was du als supporter tust.\n\nSpielt die supporter auf dem Bereich eben etwas carrymäßiger, a'ka Brand, Lulu AP etc","replies":[{"poster":"GankMeOrLose","date":"2016-05-18T00:02:14.803+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Killerkante,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=000e,timestamp=2016-05-17T10:10:59.655+0000)\n>\n> Das macht recht wenig Sinn die Spielebalance für die low-elo auf den Kopf zu stellen.\n> \n> Aber ausschließlich für den Low-Bereich ... ich hab nämlich wenige Spiele erlebt wo der Supporter wenig Einfluß aufs Spiel hatte (außer derjenige ist schlecht als Support gewesen), das ist neben Jungle soziemlich die einzige Rolle mit so vielen Freiheiten was das gameplay betrifft und du hast indirekt auswirkungen auf ALLE lanes sofern du weißt was du als supporter tust.\n> \n> Spielt die supporter auf dem Bereich eben etwas carrymäßiger, a&#x27;ka Brand, Lulu AP etc\n\nDas sind dann aber nur 2te AP Carrys und keine Supports (wobei Lulu ne besondere Geschichte ist)","replies":[]}]},{"poster":"Sturmfeder","date":"2016-05-16T22:30:15.986+0000","up_votes":1,"down_votes":0,"body":"Die Problematik mit den \"Support-Items\" hat der Ersteller des Freds gut wieder gegeben. Ihr könnt ja mal Probeweise in der Botlane doppelt Relics starten, dann seht ihr wie stark die Items bereits sind.\n\nMich stört mehr, daß ich beim warden zu oft so weit vom Schuss bin, daß ich erfahrungsmäsig hinterher hinke. Dann gehtman noch den Drake tanken und bekommt wieder keine XP ...\n\nVielleicht sollte einfach ein XP-Bonus in die Supp items eingebaut werden analog zu Machete &Co","replies":[{"poster":"TerrorRaven","date":"2016-05-16T23:09:59.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sturmfeder,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=0009,timestamp=2016-05-16T22:30:15.986+0000)\n>\n\n> Vielleicht sollte einfach ein XP-Bonus in die Supp items eingebaut werden analog zu Machete &amp;Co\n\nDadurch besteht die Gefahr, dass es von Solo-Laner missbraucht wird, siehe Anrecht der Frostkönigin.","replies":[{"poster":"Sturmfeder","date":"2016-05-16T23:16:20.216+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TerrorRaven,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=00090000,timestamp=2016-05-16T23:09:59.874+0000)\n>\n> Dadurch besteht die Gefahr, dass es von Solo-Laner missbraucht wird, siehe Anrecht der Frostkönigin.\n\nJa ... so isses. Machete geht eben nur bei Smite. Vielleicht sollte pro Team nur ein Supp Item erlaubt sein.\n\nAber alles in allem wirds einfach zu kompliziert. Is dann ja bald wie im Schrebergarten mit all den Bedingungen","replies":[{"poster":"TommyderUltranoo","date":"2016-05-17T05:19:33.143+0000","up_votes":1,"down_votes":1,"body":"> Ja ... so isses. Machete geht eben nur bei Smite. Vielleicht sollte pro Team nur ein Supp Item erlaubt sein.\n\nDann troll ich halt und kauf mir als Toplaner zuerst das Support-Item. ^^","replies":[]}]}]}]},{"poster":"NoxusKiller","date":"2016-05-16T20:37:02.959+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid wenn ich etwas grob wirke, aber ich muss dir in allen Punkten widersprechen. Ich weis nicht was du glaubst was Supporter sein sollen, aber sie sind die unterstützende Klasse, welche natürlich selbst opfernd ist. Sie bekommt ihr Geld durch spezielle Items und Assists. Vor allem mit dem Frost queens Item kann es passieren, dass der Supporter mehr Gold als ein Solo laner hat. \nWie dem auch sei, ich verstehe nicht ganz was du meinst dass supporter nur auf die obersten 5% der Spieler Gemeinschaft zugeschnitten ist. Ich habe damals auch in Silber Bereich gute Supporter gesehen. \nZu den Änderungen muss ich sagen, dass sich das eher nach nem Jungler anhört was du vorschlägst. Klar roamen Supporter auch, vor allem wenns auf der Lane gut läuft, aber sie sind immer noch in ihrer Hauptaufgabe der Beschützer ihres ADC.","replies":[]},{"poster":"Totgemordet","date":"2016-05-16T20:21:36.688+0000","up_votes":1,"down_votes":0,"body":"Zuerst mal danke an alle guten Supporter im low-elo Bereich, ihr habt es nicht leicht aber adc mains (wie ich) wissen einen guten Supporter sehr zu schätzen.\n\n\nZur Frage, ich denke die vorgeschlagenen Item Veränderungen würden die Rolle des Supporters im highelo Bereich interessanter machen, jedoch würden dadurch \"schlechtere\" Supporter im lowelo Bereich deutlich leiden, da diese normalerweise wenig roamen und daher auf die lane angewiesen sind. dennoch könnte man über solche items oder eine derartige mastery als Zusatz nachdenken. Dann könnte sowohl im low als auch highelo Bereich ein Supporter seine items, bzw masteries seinem spielstil anpassen.","replies":[]},{"poster":"Nebeltänzer","date":"2016-05-16T16:13:11.663+0000","up_votes":1,"down_votes":0,"body":"Naja. Supports sind ja nicht nur da, um Assists abzukassieren, sondern um den ADC oder später das Team am Leben zu halten, zu Engagen oder Disengagen, für zusätzliche Vision im Jungle zu sorgen, Vision zu denien. Das sind ja nicht nur Kill-Assistenten. Du sagst, ein Support soll weniger abhängig von der Leistung seines Partners sein - aber die Leistung des Partners ist ja schon abhängig von der Leistung des Supports; Dazu schlägst du vor, dass du mehr Gold für Assists kriegst, was dem eben genannten ja widerspricht.\n\"Eigene Items\" hat der Support doch schon, wie du schon schreibst. Diese sind nicht \"absichtlich schwach gehalten\", damit sie nicht abused werden - die haben ganz andere Aufgaben, nämlich Utility für dein Team bringen. Mikaels zum CC-Entfernen und heilen, Solaris für nen Gruppenschild, ausgebaute Golditems mit speziellen Effekten. Die sind nicht schwach, deren Stärke liegt darin, dass du noch mehr Möglichkeiten hast, deinem Team unterstützend unter die Arme zu greifen.\nUnd weniger an Lanes gebunden sein: Nimm mal Bard. :D Es gibt Supports, die roamen weniger, und es gibt welche, mit denen du besser roamen kannst. Wobei dazu noch der Umstand kommt, ob/wie du deinen ADC alleine lassen kannst, wie die gegnerische Botlane ist, die beiden Jungler (eigener + gegnerischer). Zudem der Jungler ja auch schon mit Ganks zu tun haben sollte. Ne Soraka hingegen geht normal seltener roamen. Gab da erst vor n paar Wochen auch den Banana-Burn-Index (glaub ich wars), der speziell nochmal von Bard, aber auch n bisschen von der Supportrolle selbst handelte.\nUnd wenn der Support unterstützend spielt, gewinnt er das Spiel, inwiefern sonst willst du das noch belohnen? Gold für gestellte Wards geben? (Das würde sofort abused werden) Mit dem Dolch des Zauberdiebs wirst du ja fürs Poken belohnt. Mit der Münze wirst du belohnt, wenn du deinen Lanepartner farmen lässt.\nGenerell versteh ich ja die ungefähre Intention dahinter, aber auf der anderen Seite fühl ich mich so eigentlich mit der Supportrolle ganz wohl. *denk*","replies":[{"poster":"Feyangol","date":"2016-05-16T16:54:43.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nebeltänzer,realm=EUW,application-id=Wj1wcocU,discussion-id=FVZeA6z8,comment-id=0002,timestamp=2016-05-16T16:13:11.663+0000)\n>\n> Naja. Supports sind ja nicht nur da, um Assists abzukassieren, sondern um den ADC oder später das Team am Leben zu halten, zu Engagen oder Disengagen, für zusätzliche Vision im Jungle zu sorgen, Vision zu denien. Das sind ja nicht nur Kill-Assistenten. Du sagst, ein Support soll weniger abhängig von der Leistung seines Partners sein - aber die Leistung des Partners ist ja schon abhängig von der Leistung des Supports; Dazu schlägst du vor, dass du mehr Gold für Assists kriegst, was dem eben genannten ja widerspricht.\n> &quot;Eigene Items&quot; hat der Support doch schon, wie du schon schreibst. Diese sind nicht &quot;absichtlich schwach gehalten&quot;, damit sie nicht abused werden - die haben ganz andere Aufgaben, nämlich Utility für dein Team bringen. Mikaels zum CC-Entfernen und heilen, Solaris für nen Gruppenschild, ausgebaute Golditems mit speziellen Effekten. Die sind nicht schwach, deren Stärke liegt darin, dass du noch mehr Möglichkeiten hast, deinem Team unterstützend unter die Arme zu greifen.\n> Und weniger an Lanes gebunden sein: Nimm mal Bard. :D Es gibt Supports, die roamen weniger, und es gibt welche, mit denen du besser roamen kannst. Wobei dazu noch der Umstand kommt, ob/wie du deinen ADC alleine lassen kannst, wie die gegnerische Botlane ist, die beiden Jungler (eigener + gegnerischer). Zudem der Jungler ja auch schon mit Ganks zu tun haben sollte. Ne Soraka hingegen geht normal seltener roamen. Gab da erst vor n paar Wochen auch den Banana-Burn-Index (glaub ich wars), der speziell nochmal von Bard, aber auch n bisschen von der Supportrolle selbst handelte.\n> Und wenn der Support unterstützend spielt, gewinnt er das Spiel, inwiefern sonst willst du das noch belohnen? Gold für gestellte Wards geben? (Das würde sofort abused werden) Mit dem Dolch des Zauberdiebs wirst du ja fürs Poken belohnt. Mit der Münze wirst du belohnt, wenn du deinen Lanepartner farmen lässt.\n> Generell versteh ich ja die ungefähre Intention dahinter, aber auf der anderen Seite fühl ich mich so eigentlich mit der Supportrolle ganz wohl. *denk*\n\nIch meine auch eher die drei first items, die man als Support normalerweise baut:\nRelic Shield, Spellthief's Edge und Ancient Coin\n\nDas erste hatte seine Nerf Phase vor Ewigkeiten (S4 glaub ich? oder wann kam es das erste mal?), beim zweiten wurde frost queens ziemlich runter geschraubt, weil es mid laner angefangen haben zu kaufen. Mich stört die sehr begrenzte Nützlichkeit dieser Items, weil es immer andere Lanes gibt, die sich sowas kaufen könnten. Die Support Items, die man sich im späteren Verlauf kauft, sind viel situationsabhängiger und weniger für den Start geeignet und glänzen damit auch so sehr wie sie sollten: aber halt jeweils nur für den Bereich in dem sie nützlich sein sollen.\n\nUnd ich stelle mir das vor wie \"extra Gold/einwenig Erfahrung für geclearte wards nur für den Support\". Die Items, die man derzeit hat, gehen in die richtige Richtung, allerdings möchte ich, dass es noch ein Schritt weitergeht und dass der Support eine Rollenidentität bekommt, ähnlich wie man dem Jungler im Verlauf der letzten 2 Jahre eine sehr klare Rolle gegeben hat.","replies":[]}]},{"poster":"Mariju Janna","date":"2016-05-16T16:48:50.432+0000","up_votes":1,"down_votes":0,"body":"Ich fände es gut wenn man die supporter rolle einfach mehr leuten schmackhafter machen sollte indem man sie mit irgendetwas belohnt.\nEs ist einfach doof das die wartezeit so lange dauert.","replies":[]},{"poster":"DarkAngel101","date":"2016-05-19T19:45:43.444+0000","up_votes":1,"down_votes":1,"body":"Ich glaube er versucht zu sagen, dass der Support NIEMALS gefeedet sein kann.\nNiemand wird sagen: \" OH Shit, da ist Taric und er ist alleine... ich sollte zusehen das ich verschwinde, sonst bin ich tot.\"\n{{champion:44}} {{item:3070}}","replies":[]},{"poster":"Mariju Janna","date":"2016-05-17T02:48:37.706+0000","up_votes":1,"down_votes":1,"body":"Und jetzt mal an die supporter unter auch ich finde ja dass sie mikaels preiss senken sollten oder so finde es kostet einfach so extremst viel bis ich das item hab ist das game meist schon gelaufen da ich das item meist nach ausgebautem supporter startitem sighstone und je nachdem ob die gegner viel ap haben ich erst mir amulett der eisernen solari kaufe oder wenn viel ad gefrorenes herz vorrang hat. \nUnd da man als sup eh schon so wenig an gold kommt zieht sich das...und dann ist der Cooldown von mikaels gefühlt ewig -.- \nNun ja kp irgendwie bringt mikaels net soviel weil ich mir das item nie wegen der mana reg kaufe eigentlich nur wegen der aktiven.","replies":[]}]}