{"poster":"I exactz I","date":"2017-05-15T12:05:36.328+0000","title":"Offensichtlich geboosted ~ Wie kann ich die Person melden?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Heyho liebe Beschw&ouml;rer, \r\n\r\nich habe in meiner Freundesliste eine Person die sich zu 100% jede Season boosted l&auml;sst. \r\nHier nun die Frage: Wie und wo kann ich diese Person melden? \r\n\r\nIch pers&ouml;nlich spiele schon gar nicht mehr mit dieser Person &amp; finde es recht dreist und unfair, dass nur weil sie ein Weib ist sich jedesmal hochboosten l&auml;sst. Auch finde ich st&ouml;rt es ihre Wahrnehmung vom eigenen Spielverst&auml;ndnis. Da sie von sich selbst behauptet Platinspielerin zu sein. Nat&uuml;rlich ist Platin jetzt nichts, dass schwer sei zu erreichen aber dennoch finde ich den Weg den sie dorthin macht nicht verdient.\r\n\r\nIch denke auch nicht das Riot so etwas dagegen tun kann, da sie SoloQue erst gar nicht spielt sondern direkt einen anderen ran l&auml;sst.\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Humpelstilzche","date":"2017-05-15T12:25:12.910+0000","up_votes":3,"down_votes":0,"body":"Es müssen zwei Dinge gegeben sein, damit du das melden kannst:\n\na) Es muss tatsächlich Boosting sein. Boosting in diesem Kontext bedeutet Accountsharing. Sich einfach nur per DuoQ \"boosten\" zu lassen ist absolut okay. \nb) Du musst es beweisen können. Du sagst sie lässt sich \"zu 100% boosten\". Aber sind diese 100% wirklich 100%? Hast du irgendeinen konkreten Beweis? Irgendwas was über eine begründete Vermutung hinaus geht? Indizien sind absolut irrelevant, du brauchst Beweise. \n\nIst beides gegeben, kannst du dich an den Support wenden.","replies":[]},{"poster":"Angel Ayume","date":"2017-05-15T17:53:08.686+0000","up_votes":7,"down_votes":4,"body":"> [{quoted}](name=I exactz I,realm=EUW,application-id=KYnfKGf0,discussion-id=dtjRMVed,comment-id=,timestamp=2017-05-15T12:05:36.328+0000)\n>\n>nur weil sie ein Weib ist sich jedesmal hochboosten lässt. \n\nWie ist das gemeint? \n\nIch bin selber weiblich und reagiere auf solche Dinge seeehr empfindlich. Ich kenne das Vorurteil, dass sich Frauen nur boosten lassen und schlechte Spieler sind und von alleine eh nie in eine höhere Elo kommen. \nDa ich dir aber nicht unterstellen will, dass du dies auch so gemeint hast, frage ich dich, wie meinst du das? \n\n\nZu deiner Frage brauche ich eigentlich nicht mehr einzugehen, da die meisten dir bereits eine Antwort darauf gegeben haben. :) \nVersuch einfach Beweise einzuholen. ^^ \n\nVllt tröstet es dich ja ein bisschen, dass es ihr absolut nichts bringt, sich boosten zu lassen. Ihr Account sagt sie ist Platin, sie selber sagt sie ist Platin aber sie belügt sich einfach total selber. Wenn sie selber anfängt regelmäßig Ranked zu spielen (in Platin) wird sie einfach sehr schnell absteigen. Beruhige dich einfach damit, dass die Elo in die sie vorgibt zu sein nicht reingehört weil sie einfach viel zu schlecht ist. ^^","replies":[{"poster":"I exactz I","date":"2017-05-15T21:56:53.366+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=dtjRMVed,comment-id=0006,timestamp=2017-05-15T17:53:08.686+0000)\n>\n> Wie ist das gemeint? \n> \n> Ich bin selber weiblich und reagiere auf solche Dinge seeehr empfindlich. Ich kenne das Vorurteil, dass sich Frauen nur boosten lassen und schlechte Spieler sind und von alleine eh nie in eine höhere Elo kommen. \n> Da ich dir aber nicht unterstellen will, dass du dies auch so gemeint hast, frage ich dich, wie meinst du das? \n> \n> \n> Zu deiner Frage brauche ich eigentlich nicht mehr einzugehen, da die meisten dir bereits eine Antwort darauf gegeben haben. :) \n> Versuch einfach Beweise einzuholen. ^^ \n> \n> Vllt tröstet es dich ja ein bisschen, dass es ihr absolut nichts bringt, sich boosten zu lassen. Ihr Account sagt sie ist Platin, sie selber sagt sie ist Platin aber sie belügt sich einfach total selber. Wenn sie selber anfängt regelmäßig Ranked zu spielen (in Platin) wird sie einfach sehr schnell absteigen. Beruhige dich einfach damit, dass die Elo in die sie vorgibt zu sein nicht reingehört weil sie einfach viel zu schlecht ist. ^^\n\nNein das war unglücklich ausgedrückt; ich meine eher, dass sie Aufgrund ihrer weiblichen Vorzüge es ausnutzt, dass es Typen gibt die ihre Zeit für sie in der SoloQue verschwenden. Ich kenne genug Mädchen die das Spiel drauf haben und würde nie Aufgrund des Geschlechtes sagen, die kann eh nichts. \n\nBeweise hätte ich tatsächlich schon aber nach dem ganzen hier bin ich irgendwie nicht mehr so extrem auf melden aus, da ich die Meinung der meisten hier schon Strafe genug finde, \"dass sie in League of Legends\" dafür schon Ingame genug abbekommen wird.","replies":[{"poster":"Angel Ayume","date":"2017-05-15T23:39:29.656+0000","up_votes":1,"down_votes":1,"body":"Dann bin ich beruhigt. :) \nNaja, so ein Verhalten nennt man auch billig. .__. \n\nWenn sie nicht wirklich eine richtige Freundin ist sondern irgendein Hampelmann inner FL würde ich sie dennoch melden. Wenn sie ne Freundin ist würde ich es aber auch lassen. Die Wahrscheinlichkeit ist groß, dass ihr Account wegen Accsharing und Eloboosting irgendwann gebannt wird... Ich persönlich finde sie ziemlich peinlich..","replies":[{"poster":"Uranbrennstab","date":"2017-05-16T06:56:55.176+0000","up_votes":2,"down_votes":2,"body":"Eigentlich ist manipulativ oder schlicht clever das richtige Wort. Sie nutzt Stärken und Schwächen geschickt zu ihrem eigenen Vorteil aus. Je nachdem wie weit man dabei geht lohnt es sich zu differenzieren. Aber vom Grundgedanken her würde ich das nicht einfach als billig abtun.","replies":[{"poster":"Awsane","date":"2017-05-16T13:32:27.248+0000","up_votes":1,"down_votes":1,"body":"clever wäre es nur dann, wenn es nicht rauskommt, wenn es aber wie beschrieben offensichtlich oder leicht zu ermitteln ist, dann ist es eher dumm, weil durch sowas vergrault man sich mehr freunde als was man durch den fame bekommt.","replies":[{"poster":"Uranbrennstab","date":"2017-05-16T14:37:42.867+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=KYnfKGf0,discussion-id=dtjRMVed,comment-id=00060000000000000000,timestamp=2017-05-16T13:32:27.248+0000)\n>\n> clever wäre es nur dann, wenn es nicht rauskommt, wenn es aber wie beschrieben offensichtlich oder leicht zu ermitteln ist, dann ist es eher dumm, weil durch sowas vergrault man sich mehr freunde als was man durch den fame bekommt.\n\nIch bezweifle stark, das es dabei um Freundschaft geht. Und \"offensichtlich\"  scheint es ja nicht zu sein, sonst wäre sie bereits gebannt. Ich sehe auch wenig Chancen darauf \"Beweise\"  zu sammeln, da Kommunikation zwischen Spielern im privaten Chat jenseits Riots Interesse liegt.","replies":[]}]}]}]}]}]},{"poster":"Yo im Jesus","date":"2017-05-15T12:19:57.614+0000","up_votes":2,"down_votes":0,"body":"Wenn es dich beruhigt , wird sie es damit ehh nicht weit schaffen , allerhöchstens bis Dia 5 dann ist Schicht im Schacht..  Ich kenne auch viele die Geboosted worden ... aber mei sie wird früher oder Später dann eh keine lust mehr haben zu spielen weil sie in der Elo dann keinen Erfolg hat , also mach dir keinen Kopf , es ist eher nervig für die die dann mit ihr spielen müssen.","replies":[]},{"poster":"King Koitus","date":"2017-05-15T13:05:19.923+0000","up_votes":1,"down_votes":6,"body":"ganz einfache Lösung:\nLöschung aus der Freundesliste, schon kannst du beruhigt spielen ohne zu sehen, dass jemand ''ohne was zu tun'' im höheren Elo-Bereich spielt.\nAlternative wäre natürlich Petzen. Aber das wäre ziemlich weak, weil die Spielerin keines deiner Games beeinflusst und somit nicht dein Problem ist.\nAußer du bist son Typ wie Randall von Disneys Große Pause, dann nur zu.","replies":[{"poster":"CP Wukong","date":"2017-05-15T14:35:27.250+0000","up_votes":1,"down_votes":0,"body":"Stimmt, wenn jemand gegen die Nutzungsbedingungen verstößt und dadurch potentiell anderen Spielern einen unfairen Nachteil gibt sollte man das einfach ignorieren. Sollen sich doch die anderen drum kümmern, der TE könnte es zwar, wäre aber dann die \"Petze\".\nRegeln gibt es nur, wenn man durch sie einen Vorteil bekommt, und wenn da drüben grad die Mutti ausgeraubt wird, wäre ich auch nicht gern eine Petze, kann doch wer anders helfen.","replies":[{"poster":"King Koitus","date":"2017-05-15T15:53:59.016+0000","up_votes":1,"down_votes":4,"body":"wir reden hier über ein PC-Game haha...ist ein wenig übertrieben hier einen Sinn für Recht und Ordnung zu finden und die Petze zu spielen, solange niemanden cheatet oder scripted...","replies":[{"poster":"Awsane","date":"2017-05-15T16:41:40.382+0000","up_votes":2,"down_votes":1,"body":"aber es hat doch dadurch tatsächlich jemand einen Nachteil, nämlich der spieler der in diesem fall besser als die geboostete Person ist und im der Rangliste der beste spieler Gold spieler ist (also der nächste ist der schlechte platinspieler) ohne die geboostete Person wird der platz frei und so wäre er platin","replies":[{"poster":"King Koitus","date":"2017-05-15T18:50:29.652+0000","up_votes":1,"down_votes":1,"body":"das gleiche könnte man auch über High-Elo-Smurfs sagen, die den Low-Elo-Bereich unsicher machen","replies":[{"poster":"Awsane","date":"2017-05-15T19:25:00.990+0000","up_votes":1,"down_votes":0,"body":"ja, kann man und es stimmt auch, aber dadurch macht es die andere tat ja nicht besser meiner Meinung nach","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2017-05-16T06:53:10.471+0000","up_votes":2,"down_votes":0,"body":"Genau genommen cheated sie, den cheaten bedeutet einfach nur schummeln. Und nichts anderes ist Elo Boosting.","replies":[]}]},{"poster":"I exactz I","date":"2017-05-15T17:12:27.472+0000","up_votes":1,"down_votes":1,"body":"Mein Hauptproblem an diesem jede Season auf Platin geboosted zu werden liegt darin, dass sie jederzeit erwähnt das sie doch Platinspielerin sei.\n\nIn den paar Spielen mit ihr hat sie sich meist über andere Spieler ausgekotzt und geflamed, ich finde einfach nicht das dieses immer geboosted werden irgendwie hilfreich für irgendjemanden sein kann. Ich kenne Spieler die noch vor Season Ende sich schnell auf Gold V boosten lassen für den Skin und da ist es mir auch relativ egal aber sich auf Platin + boosten zu lassen und kein Spielverständnis zu haben finde ich schon Fail genug.\n\n-  wollte es an Awsane anhängen.","replies":[]}]}]},{"poster":"Rena","date":"2017-05-15T15:15:18.419+0000","up_votes":1,"down_votes":0,"body":"Ich finde eigene Freunde zu melden persönlich ein NoGo aber naja mach was du willst xd","replies":[]},{"poster":"I exactz I","date":"2017-05-15T12:29:45.190+0000","up_votes":1,"down_votes":1,"body":"a) Ist es. Sie spielt nicht auf ihren Account in der Zeit. Komplett andere Person.\nb) Bis jetzt habe ich nur über TeamSpeak von ihr gesagt bekommen, dass eine andere Person auf ihren Account spielt. \n... in dem Punkt muss ich wohl schriftliche Beweise ranholen. Sprich im Client selbst mit ihr schreiben.","replies":[]},{"poster":"derfrauenarzt","date":"2017-05-15T13:24:57.219+0000","up_votes":2,"down_votes":11,"body":"tja ein vorteil hat er - er muss sich nicht blutigen Anfängern (Bronze-Gold) herumschlagen xD\nich zumindest gehe immer afk wenn ich sehe dass ich 4 bronze oder 4 silber im team habe - wasted time.\n\nNaja ein Nachteil hat er, kriegt eins auf die Glocke von den Highelo leuten xD","replies":[{"poster":"IWhiteBoyI","date":"2017-05-16T22:25:08.833+0000","up_votes":1,"down_votes":1,"body":"Als ob es solchen Leuten darum geht selber Games zu gewinnen :D Da wird einfach nur Der Rahmen+ Skin abgestaubt und dann locker flockig weiter gespielt. Man Sollte also meinen in einem Spiel was mit Wettkämpfen Geld verdient, sollte sowas direkt unterbunden werden ?! \nWeil es einfach manipulation der Rangliste ist . \nAber wer weiß schon genau ob Rito nicht nen Stück vom kuchen abbekommt von diesen EloBoost seiten die im Netz kursieren ;) Daher wird mit deiner \" Freundin\" vieleicht in 1-2 Jahren mal was passieren aber von Gerechtigkeit sind wir hier ganz ganz weit entfernt :)","replies":[]}]}]}