{"poster":"I exactz I","date":"2017-11-23T15:48:28.489+0000","title":"Neues System - Blaue Essenzen | Reine Profitgeilheit?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":6,"body":"Alleine schon bei diesem Satz bekomme ich schlechte Laune.\r\n&gt; Riot:&quot; Deine EP und blaue Essenzen wurden miteinander fusioniert. Sieh im Shop nach, was du dir jetzt kaufen kannst.\r\n\r\nIm ersten Moment denkt man nat&uuml;rlich, dass Riot uns damit einen gefallen tun wollte, denn durch diese Ver&auml;nderung denkt man im ersten Moment man h&auml;tte einen tollen Batzen an Punkte bekommen. Doch in dem Fall wird man eher nur geblendet. Im Shop findest du die Champions noch unter den alten Preisen dazu kommt, dass Riot viel Mist hinzugef&uuml;gt  hat wie Icons etc. Ich zu meinem Teil habe mich im ersten Moment nicht damit befasst und einfach nur gedacht &quot;Ja nice, ich hab viel mehr Essenzen wie vorher, dann kauf ich mal das dies und jenes&quot;. Dann nach den ersten Spielen viel mir direkt auf, dass ich keine Essenzen mehr bekomme nur bei einem &uuml;berfl&uuml;ssigen Level UP, die Kapsel die man dann noch bekommt hat einem totalen Random Inhalt an Championshards die man noch nicht einmal haben will. Ich zu meinem Teil bin meist gezwungen diese zu entzaubern, weil ich sonst nie mit den blauen Essenzen vorran kommen w&uuml;rde. Auch finde ich es gar nicht wirklich Einsteigerfreundlicher, denn was ist daran Einsteigerfreundlicher, wenn ich dem Spieler immer Kapseln reindr&uuml;cke mit Champions die den Dude nicht einmal interessieren. Ich zu meinem Teil bin damals immer in die Kluft rein, habe im Match einen neuen Champion getroffen und dann herausgefunden ob der mich interessiert und wenn ja, dann habe ich auf den gespart und mir selbst ausgesucht und dazu gibt es ja noch die w&ouml;chentlichen Free Champions.\r\n\r\nDurch die ganzen EP Boost f&uuml;r Geld, das kaum noch erreichen von Champions durch Punkte und der Zwang f&uuml;r einen Champion ewig spielen zu m&uuml;ssen soll in meinen Augen nur dazu f&uuml;hren, dass die Spieler in die Geldb&ouml;rse greifen und sch&ouml;n zahlen, egal ob sie sich den Champion direkt kaufen oder durch andere Hilfsmittel die Riot uns ja liebend gerne bietet, dass ganze nat&uuml;rlich nur, weil es uns als Spieler ja gut gehen soll. \r\n\r\nIch finde nicht das Riot diese &Auml;nderung so sehr n&ouml;tig hatte oder irgendein Spieler sich genau diesen Mist gew&uuml;nscht hat, wenn sie Geld generieren wollen sollen sie doch einfach einen neuen Skin rausbringen, das funktioniert doch viel besser. {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Oriius","date":"2017-11-23T19:12:30.446+0000","up_votes":1,"down_votes":0,"body":"eigentlich ist die Idee ganz nett aber sollte dringend angepasst werden . brauche jetzt locker 50 games um 1 !!!! champ zu kaufen  finde ich ziemlich fragwürdig aber who cares\n\nletzendlich gibts da auch n positiven effekt. kaum ein neuling spielt ein champ der krassen skill benötigt daher finde ich das für neulinge recht angenehm zum einüben. \n\nzum thema profitgier naja .... ich glaube league ist einer der wenigsten spiele die auf p2w verzichten ... mein gott die paar champs gut aber ist immernoch kein p2w. also was das angeht ist das glaube ich eine extreme seltenheit ^^\n\nfinde allerdings das es schon geringfügig zum kauf verleitet aber ist ja auch nicht schlimm auch das muss alles finanziert werden.","replies":[{"poster":"Sirrkas","date":"2017-11-24T08:57:43.919+0000","up_votes":2,"down_votes":0,"body":"Ich hab mal nachgesehen. Zum Ende der Season habe ich alle meine Championshards weggegeben gehabt. Jetzt habe ich wieder einige angesammelt und es hat ziemlich genau 2 Wochen gedauert, um genug Shards zu erhalten, um genau 6300 BE zu erhalten. Genug um Zoe zu kaufen (sobald sie eine Woche alt ist). Das einzige was ich nicht sagen kann ist, ob vielleicht einer der 1260 BE Splitter aus einer Truhe war. Und selbst wenn es so war, muss ich sagen, ich war seit Beginn der Preseason sehr inaktiv und habe fast nur meinen Tagessieg gemacht. \n\nAls es alle 2 Wochen Champs gab, war ich viel aktiver und hatte nach der selben Zeit so viele EP angesammelt, wie ich gerade BE habe. \n\nDein Glaube, dass man deutlich langsamer BE erhält, als man EP verdient hat, scheint mir also nicht zutreffend zu sein. Wenn ich das richtig gezählt habe, waren das etwa 37 Spiele bisher. Aber einen Haufen waren nur Botspiele, die weniger EP geben und 5 im neuen Modus.","replies":[]},{"poster":"Qbert","date":"2017-11-24T07:05:28.099+0000","up_votes":2,"down_votes":0,"body":"du bist lvl 36 und hast noch nicht mal 100 Spiele in der Preseason gemacht .... \n\nAber immerhin brauchst du 50 Spiele pro Level {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Sirrkas","date":"2017-11-23T19:33:22.062+0000","up_votes":1,"down_votes":0,"body":"Das war davor doch genau so. Als es noch jede zweite Woche Champions gab, konnte ich mir die damals theoretisch gerade so leisten, solange ich immer den Tagessieg geschafft habe. Bei wenigstens 2 Spielen am Tag, waren das auch 50 Games.","replies":[{"poster":"Oriius","date":"2017-11-23T19:58:00.858+0000","up_votes":1,"down_votes":0,"body":"bei den neuen 7,8k Champs vielleicht . jetzt kriegt man in der Zeit die hälfte zusammen","replies":[{"poster":"Sirrkas","date":"2017-11-23T20:02:55.435+0000","up_votes":1,"down_votes":0,"body":"https://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/Jh3Mtzu6\n\nHier bitte.","replies":[{"poster":"SSI CptHaunted","date":"2017-11-23T22:00:29.616+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=Wj1wcocU,discussion-id=Z8wYIY1i,comment-id=0003000000000000,timestamp=2017-11-23T20:02:55.435+0000)\n>\n> https://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs\n> \n> https://boards.na.leagueoflegends.com/en/c/developer-corner/Jh3Mtzu6\n> \n> Hier bitte.\n\nJup, in den 7.23 Patchnotes steht was von 50 BE für 175EXP...komischerweise krieg ich trotzdem weiterhin die 575 EXP, also scheint da ja mal wieder irgendwas nicht zu stimmen.","replies":[{"poster":"Sirrkas","date":"2017-11-23T22:16:10.166+0000","up_votes":1,"down_votes":0,"body":"Ja, da scheint es einen Fehler zu geben und es gibt noch nicht die BE sondern noch mehr EXP.","replies":[]}]}]}]}]}]},{"poster":"Rayjhin","date":"2017-11-23T16:29:10.097+0000","up_votes":3,"down_votes":1,"body":"Ich finde das BE System gut weil es rein statistisch gesehen besser ist. Es fühlt sich aber falsch an.","replies":[]},{"poster":"Lasse Laufen","date":"2017-11-24T09:18:31.730+0000","up_votes":1,"down_votes":0,"body":"Selbst wenn man weniger BE als frühere EP erhält, fallen die Kosten für die Runen weg.\n\nDazu kommt das man BE spart wenn man einen Championsplitter aufwertet, anstatt den Champion im Shop zu kaufen.","replies":[{"poster":"Qbert","date":"2017-11-24T10:38:24.831+0000","up_votes":1,"down_votes":0,"body":"gestern Zoe für 4850 BE gekauft x)\n(hab alle Champs und hatte ein LVL-UP, gab sie als ChampShard :D)","replies":[]}]},{"poster":"Kata Ga Kill","date":"2017-11-24T04:29:49.180+0000","up_votes":1,"down_votes":0,"body":"Besser als das man nach wenigen Spielen EP in Überfluss hat und jeder nen neuen Champ für \"geschenkt\" kriegt....\nOder das Smurfer bissel reduziert werden durch das Level UP was \"Eingessesene\" belohnt.\nDesweiteren ist durch die Beute/Splitter, jeder Champ fürn spotpreis zu bekommen.\nEntweder man sammelt alle Pokemon günstig (was freude machen kann).\nOder man schwingt das Portmone um sofort alle oder Favoriten zu kaufen.\n\nAber finde schon das es bissel zu wenig BE gibt für Sieg des Tages und beim Level Up.\n\nDenke es müsste mehr und besondere Belohnungen geben die man mit BE kaufen kann abseits von Champs und Meisterschafften.","replies":[]},{"poster":"Sirrkas","date":"2017-11-23T19:32:16.633+0000","up_votes":1,"down_votes":0,"body":"Hier bitte:\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/Jh3Mtzu6","replies":[]},{"poster":"BlackAjani","date":"2017-11-23T15:55:45.052+0000","up_votes":1,"down_votes":0,"body":"An sich ist das BE-System gut, jedoch ist das einzig Dumme für uns, wie ich finde, dass die orangenen Essenzen Quasi an Wert gewonnen haben. Man erhält beim entzaubern weniger Essenzen, was das craften ziemlich dumm gestaltet. Daher werde ich keine Kisten mehr kaufen, bzw. alles rerollen und mir falls ich mal einen echt guten habe, vllt den freischalten. Mal sehen. Ich glaube, dass es Riot selbst gestört hat, dass man sich teilweise so viel Skins für Lau holen konnte, daher Preisanpassung.\n\nEdit: Ich weiß es wurde vorher angekündigt und wurde auch schon angesprochen. Jedoch in dem Preseason-Post von Riot kam dazu eher null.\n","replies":[]},{"poster":"Enderized","date":"2017-11-23T15:51:50.459+0000","up_votes":1,"down_votes":0,"body":"Wird den Leuten das nicht langweilig zu diesem Thema zusätzlich zu den bestehenden Threads noch 700 weitere zu erstellen?","replies":[]}]}