{"poster":"XxVenomPlayerxX","date":"2017-09-17T01:06:26.886+0000","title":"que hacer si el jg enemigo gankea a tu oponente de linea? (mid y top)","subforum":"Nuevos jugadores","up_votes":3,"down_votes":0,"body":"Necesito ayuda para esto,siempre me pasa que voy ganando a mi rival y el jg va y me matan (mid y top)\r\n\r\n(campeones que uso en mid y top){{champion:45}} {{champion:4}} {{champion:24}} {{champion:78}}","replies":[{"poster":"Grosero","date":"2017-09-17T01:08:06.583+0000","up_votes":3,"down_votes":0,"body":"Flamearlo e irte afk, obvio\n\nMentira, si pusheas mucho la línea y el laner enemigo se ve medio complicado es probable que te gankeen pronto, asi que mantente vigilando el río y wardea constantemente","replies":[{"poster":"XxVenomPlayerxX","date":"2017-09-17T01:11:40.169+0000","up_votes":1,"down_votes":0,"body":"gracias,lo hago a veces pero no me doy cuenta cuando se me acaba el {{item:3362}}","replies":[{"poster":"janitoxdxd","date":"2017-09-17T01:45:18.595+0000","up_votes":2,"down_votes":0,"body":"ve youtubers que juegan lol (lo que son mas concejos y guías) ellos te explican que con ciertos campeones puedes aprender el control de masas en tu linea, tener el control de visión de tu mapa, entre otros. Los campeones que usas igual no son fáciles (quizás las mecánicas si, pero en toda la partida suelen ser mas complejos en general)\nComo dato: tus cameones a jugar son todos de late (juego tardío), por lo que te van a llegar muchos ganks tempranos y seguidos, te va romear el top, el supp y o el adc enemigo, para que así no llegues a tu late donde te garchas a todos. Te recomiendo el concejo que te di, hay campeones que en si sus mecánicas son difíciles, pero generalizando en la partida pueden ser los más fáciles aprendiendo a jugar en el lol. \nMi testimonio: Yo aprendí en top con irelia (muuy rota) quizás tenga varias formas de jugarse (debido a tantos cambios en los items estos últimos meses) por lo que igual suele ser un poco mas compleja en mecánicas a la hora de tradear. (intercambiar golpes con el enemigo). Con ella aprendí lo que es el control de masas; ejemplo: Debido a que la campeona en si está rotísima, si le ganas en el tradeo al enemigo, este va a preferir evitarte, por lo que intentará solo pockear (pegarte con alguna habilidad a distancia sin que tu logres pegarle algo devuelta) por lo que podrás optar por controlar los minions para obtener la ventaja debido a que irelia en si es de late hasta lvl  6(mas algún item completo) obviamente esto dependerá que enemigos tengas. En que consiste el control de minion; dejas que el enemigo pushee una oleada completa de minions, los minions enemigos que sobres los atraes a tu torre, y tanqueas para que no queden al alcance de la torre aliada, puedes tanquear entrando y saliendo de un bush; lo siguiente es que a lo que llegue tu oleada de minions, solo last hitees al momento de farmear, mantendrás todos los minions siempre en tu lado del mapa, por lo que el jg enemigo no tendrá muchas aperturas de gankeo a no ser que esté muy recontra iper mega feed xd ahí te garcha hasta dentro de la base xd, jajaj volviendo al tema, lo mas importante de este control de masas que tiene irelia debido a su sustain de robo de vida, logras que el enemigo no quiera acercarse a ti para tradear o pockear, y esperará a tus minions que lleguen a el y ojalá el llevarlos bajo torre para farmear tranquilo  ( pero siendo sincero aun yo con un año y medio jugando lol, con ciertos campeones no puedo farmear bajo torre, también están esos días donde farmeas como las &%$ XD ) debido a que los minions no llegarán a el en un buen rato, tu podrás sacar ventaja de farm hasta con 50 minions mas que el en menos de 5 minutos. \nPor qué Irelia? simple, es la campeona que no falla ningun last hit debido a su q, por lo que puedes farmear hasta bajo de torre sin problemas.","replies":[]}]}]},{"poster":"The patriarcado","date":"2017-09-17T01:10:07.030+0000","up_votes":2,"down_votes":0,"body":"Hay algo llamado ward salva vida, deberías usarlo","replies":[{"poster":"janitoxdxd","date":"2017-09-17T01:46:13.201+0000","up_votes":1,"down_votes":0,"body":"si fuese así nadie perdería men, son muchos temas y conceptos que llevan a una buena jugada y no dejar que el jg enemigo te gankee.","replies":[{"poster":"The patriarcado","date":"2017-09-17T01:52:58.160+0000","up_votes":1,"down_votes":0,"body":"Si sabes contra que jg juegas sabes dónde wardearle, es más gracias al ward lo puedes contra gankear","replies":[{"poster":"janitoxdxd","date":"2017-09-17T01:57:22.369+0000","up_votes":1,"down_votes":0,"body":"a eso quería llegar amigo, no basta solo con decir wardea y ya;  suena muy simple para un juego complejo que para nuevos como el que buscan concejos, nosotros ya sabemos que hacer, debido a la experiencia.","replies":[{"poster":"The patriarcado","date":"2017-09-17T02:03:48.763+0000","up_votes":1,"down_votes":0,"body":"Además debes predecir por donde estará el jg y saber qué tan fácil te posicionas tu para que te ganken","replies":[]}]}]}]}]},{"poster":"JuanKawaiNieve","date":"2017-09-30T03:11:12.797+0000","up_votes":1,"down_votes":0,"body":"Tienes que estar viendo el minimapa constantemente y poner wards de forma inteligente.\n\nAdemas hay ciertos patrones, por ejemplo, si sabes que el JG enemigo partió en BOT a TOP llegara mas o menos a los 2:50 o 3:00 (viceversa en el caso de que parta TOP), por lo que si eres TOP te conviene poner wards mas o menos por esos tiempos y ver el minimapa con mas cuidado, igual depende de que si tu linea esta muy empujada o no, si estas farmeando bajo torre es improbable que el JG enemigo te ganke (a menos que estes con muy poco HP y diveen).\n\nAdemas te puedes fijar en otros detalles, si el JG enemigo gankeo TOP y BOT lo mas probable es que te vaya a gankear a ti, o si TOP y BOT estan farmeando muy cerca de torre y tu estas pusheando de forma agresiva, etc. Eso si ten en cuenta de que si ves al JG enemigo en BOT o TOP probablemente nadie podra ayudar a el MID enemigo si lo intentas matar, pero tienes que tener cuidado ya que de todas formas existen algunos campeons con ULT globales, como Soraka, Gangplanck, etc, eso lo iras aprendiendo a medida que vayas jugando mas y mas :D\n\n---\n\n**PD**: Hace tiempo quería crear un subreddit para compartir guías y consejo de lol en espa&ntilde;ol, así que cree [Escuela del Invocador](https://www.reddit.com/r/escueladelinvocador/), todos están invitados.","replies":[]},{"poster":"Yo sin Ella","date":"2017-09-20T04:14:21.261+0000","up_votes":1,"down_votes":0,"body":"Wardear y quedarte donde estes seguro nomas. Si tu jg te va a gankear cuando el jg enemigo vaya,podrias tentar al enemigo y asi entre los 2 los matan","replies":[]},{"poster":"k1Nz14","date":"2017-09-17T01:25:18.278+0000","up_votes":1,"down_votes":1,"body":"Lo de abajo{{sticker:sg-ahri-2}}","replies":[]}]}