{"poster":"LightsEUW","date":"2015-07-08T14:25:29.144+0000","title":"Bitte ein neuen Summoner Spell!","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey,\n\nich wollte mal kurz sagen, dass es ziemlich wenige Teamorientierte Summoner Spells gibt.\nWie w&auml;re es mit einem der in einem Radius kurz Speed oder R&uuml;stung und Magiresestenz gibt für dich und deine Verbündeten? ^^\n\nW&uuml;rde mich freuen wenn wir mal bald einen neuen Summoner Spell sehen w&uuml;rden. {{summoner:31}} \n\nLights","replies":[{"poster":"Alustus","date":"2015-07-08T14:27:34.924+0000","up_votes":1,"down_votes":0,"body":"Es werden momentan sowieso nur:\n\n{{summoner:14}} {{summoner:4}} {{summoner:3}} {{summoner:7}} {{summoner:12}} {{summoner:11}} \n\nBenutzt\n\n{{summoner:2}} {{summoner:1}} {{summoner:13}} {{summoner:21}} \n\nSieht man z.B gar nicht vllt sollt man diese ändern bevor man ein neues macht :)","replies":[{"poster":"Schesam","date":"2015-07-08T14:55:35.864+0000","up_votes":2,"down_votes":0,"body":"^Cleanse + Barrier sind so ziemlich die einzigen Summoners die ich auf Orianna benutze lol\n\nAber ich versteh sowieso nciht, warum man Heal gereworked hat, Clarity aber so gelassen hat. Heal hat davor ja auch alle teammitglieder in der Umgebung gehealt","replies":[]},{"poster":"Resp0nse","date":"2015-07-08T14:39:01.746+0000","up_votes":1,"down_votes":0,"body":"Gibtn Grund weshalb man manche Summoner Spells nicht benutzt. {{summoner:2}} = Wards, {{summoner:1}} = QSS, {{summoner:13}} = Wenn man extrem Manaprobleme hat, baut man Frozen Heart, RoA oder sonst Gute Mana Items. {{summoner:21}} benutzt man ab und an in der Mid, um Ignite zu \"countern\"\n\nAlso ich finde das LightEUW Recht hat. Es braucht einfach mehr Abwechlung. Grade auf dem Supp z.B. gibt es keinen Spell, der ans Team gerichtet ist. {{summoner:14}}  aufm Supp macht eine Aggressive Kill Lane einfacher, klar, aber auch wieder für Solo bzw. gegen spezielle Champs ({{champion:36}} ,{{champion:106}} ) gut. {{summoner:3}} aufm Supporter nimmt Dmg raus. Geht auch nur gegen den Gegner.\n\nIch finde einfach, das der Supporter einen Summoner Spell bekommen könnte. Da muss man allerdings aufpassen, das er nicht zu stark wird. Bei Resistenzen geben, was als Beispiel genannt wurde, z.b. eine SEHR Stark Abgeschwächte Wirkung wenn es mehrmals benutzt wird. So das es also nicht jeder nimmt. \n\nAn sich eine Super Idee, ich bin Stark dafür.","replies":[{"poster":"Schlossknacker","date":"2015-07-09T16:48:09.549+0000","up_votes":1,"down_votes":0,"body":"HAST DU GRAD WAS GGN CLEANSE GESAGT? X'D Ne aber wirklich. Cleanse ist ein richtig guter Counter auf AP Midlanern ggn. Zed und so,","replies":[]}]},{"poster":"Evenrider","date":"2015-07-08T14:32:03.338+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=Wj1wcocU,discussion-id=FjE8YyYe,comment-id=0000,timestamp=2015-07-08T14:27:34.924+0000)\n>\n> Es werden momentan sowieso nur:\n> \n> {{summoner:14}} {{summoner:4}} {{summoner:3}} {{summoner:7}} {{summoner:12}} {{summoner:11}} \n> \n> Benutzt\n> \n> {{summoner:2}} {{summoner:1}} {{summoner:13}} {{summoner:21}} \n> \n> Sieht man z.B gar nicht vllt sollt man diese ändern bevor man ein neues macht :)\n\nBarriere und Cleanse sieht man manchmal auf ADCs und Defensiv orientierten Midlanern.\n\nHellsehen ist seit Blue Trinket nutzlos.\nUnd Clarity ist nur für Aram, denn im echten Spiel achtet man stärker auf seinen Manahaushalt und geht back wenn der Leer ist. Da lohnt sich kein Summoner Spell. Und wenn man Clarity mitnimmt, hißt das eigentlich, dass man ein schlechter Spieler ist, da man nicht auf seinen Ressourcenhaushalt achten kann :D","replies":[]}]},{"poster":"Busty Botter","date":"2015-07-08T15:12:44.460+0000","up_votes":1,"down_votes":0,"body":"Es gibt wie ander sagen, genug Summonerspells. Auch wenn einige fraglich sind und man diese abändern könnte.\n\nSo könnte zB {{summoner:2}} zusätzlich Wards aufdecken, wie das rote Trinket, um mehr Wards zu clearen (wäre sicher interesant auf Support)","replies":[{"poster":"Evenrider","date":"2015-07-08T15:14:02.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr B Botter,realm=EUW,application-id=Wj1wcocU,discussion-id=FjE8YyYe,comment-id=0001,timestamp=2015-07-08T15:12:44.460+0000)\n>\n> Es gibt wie ander sagen, genug Summonerspells. Auch wenn einige fraglich sind und man diese abändern könnte.\n> \n> So könnte zB {{summoner:2}} zusätzlich Wards aufdecken, wie das rote Trinket, um mehr Wards zu clearen (wäre sicher interesant auf Support)\n\nWards aufdecken mit einer Reichweite von Global? mmh lass mal gucken ob der Gegner in seinem Fountain wards hat, ich clear die dann auch irgendwie? :D\nOder willst du dem Toplaner ermöglichen das Ward des Gegners zu clearen?\nUnd selbst wenn, nicht Worth dafür einen Cooldown von über 2 Min zu warten, noch ein Exhaust oder ein Ignite wegfallen zu lassen.","replies":[]}]}]}