{"poster":"Royalfallup","date":"2019-11-22T04:11:21.721+0000","title":"Why is toxicity even bannable?","subforum":"Player Behavior","up_votes":1,"down_votes":26,"body":"I have no idea why toxicity is ban able. It doesn't make sense. People are going to get mad at the game and are going to get mad at teammates. That's why there is a mute button. You should be muting the toxic players, not banning them. The fact that my bot lane can go 0-16 in ranked and not be banned for throwing but yet I get banned for flaming them for throwing is completely ridiculous. If you are going to ban people for toxicity, a week long ban should be the *max*. IS riot seriously perma banning people for yelling at throwing teammates? Are you kidding me? If you don't like a person in chat you should mute but be done with it end of story. Why are toxic players getting banned but trolls get away scott free? This game doesn't even have voice coms, (Which it desperately needs in my opinion). In the end, There is absolutely no reason anyone should be getting banned for toxicity when there is literally a mute button. Why don't we ban the trolls that make these players get angry instead of the toxic players who might actually be competent players.","replies":[{"poster":"MagicFlyingLlama","date":"2019-11-22T04:20:32.816+0000","up_votes":12,"down_votes":0,"body":"Because toxicity is a symptom, not a cause. The cause is the immature and dysfunctional player, who is removed so nobody else has to deal with them. Problem solved as simply as possible.","replies":[{"poster":"rujitra","date":"2019-11-22T04:48:44.303+0000","up_votes":3,"down_votes":0,"body":"Furthermore, Riot has found (as have all game companies) that toxic attitudes rarely result in only one thing. I'm sure there's **someone** out there who only says the N word, for example, but the **vast majority** of people who are toxic in one way (ex: flaming) are also toxic in other ways (ex: griefing, afk, etc).\n\nThis goes along with what you're saying - the problem is the player and the attitude that they can do whatever they want for their own pleasure.","replies":[]}]},{"poster":"Argent Wolf","date":"2019-11-22T06:13:06.730+0000","up_votes":8,"down_votes":0,"body":"Sooo.... you want to be able to throw a tantrum like a 5 year old, but also do it in my ears?  fuck no.","replies":[]},{"poster":"CharDeeMcDenniz","date":"2019-11-22T04:14:47.439+0000","up_votes":6,"down_votes":0,"body":"toxicity, and the reputation this game has for it, drives customers away. \n\nwhy would ANY business allow something that takes money directly out of their pockets? I'll take it one step further and ask you to name me any company/business/location where you can do and say whatever you want over and over while getting only a slap on the wrist to show for it. I'll wait...","replies":[{"poster":"TIKrunk","date":"2019-11-22T10:32:27.473+0000","up_votes":1,"down_votes":2,"body":"Just trying to be fair about this, but...Starbucks?","replies":[{"poster":"CharDeeMcDenniz","date":"2019-11-22T14:03:19.256+0000","up_votes":1,"down_votes":0,"body":"im assuming you're not serious about this","replies":[{"poster":"TIKrunk","date":"2019-11-26T08:29:05.189+0000","up_votes":1,"down_votes":2,"body":"I mean...kind of.\n\nhttps://www.reddit.com/r/starbucks/comments/ac6be4/anybody_elses_store_turning_into_a_homeless/\n\nhttps://www.forbes.com/sites/andriacheng/2019/11/12/starbucks-has-a-big-price-to-pay-for-its-open-bathroom-policy-study/#308f5b816c4a","replies":[{"poster":"CharDeeMcDenniz","date":"2019-11-26T15:22:42.109+0000","up_votes":1,"down_votes":0,"body":"not even close","replies":[{"poster":"TIKrunk","date":"2019-11-26T16:57:41.460+0000","up_votes":1,"down_votes":0,"body":"**why would ANY business allow something that takes money directly out of their pockets?**","replies":[]}]}]}]}]}]},{"poster":"Modi","date":"2019-11-22T05:24:17.118+0000","up_votes":7,"down_votes":1,"body":"It has been said a thousand times before, and will be said a thousand times again:\n\nThe mute button is to stop the **immediate** problem, of seeing the chat.\n\nReporting (and by extension, punishment) is to help prevent **future** problems.","replies":[]},{"poster":"MeesterMo","date":"2019-11-22T04:15:38.004+0000","up_votes":8,"down_votes":2,"body":"Because it's not fun to play the game with people that throw tantrums when the game isn't going their way.","replies":[]},{"poster":"JoshTGW","date":"2019-11-22T04:48:30.818+0000","up_votes":3,"down_votes":0,"body":"One they already have a voice chat, but only for parties. \nSecondly, toxic behavior is bannable because it's the same thing as player harassment or verbal abuse. Sure you could be bantering, but the other person may not know that. Players also like to try and get out of it by saying \"it's not bannable\" and \"it's not verbal abuse\" and such and such excuses to make it seem like it's okay, but it's not. In truth, it all shares a common purpose and that is to annoy other players and harass. Just saying anything rude and simple like \"you're bad,\" anything just as bad or even worse is completely uncalled for. It's not okay and no one should be doing it in the first place.\n\nI like what Riot is doing with the system and it's the right way to go. Toxicity needs to be rooted of the gaming community and I applaud their efforts to do so.","replies":[]},{"poster":"Colte","date":"2019-11-22T04:43:51.920+0000","up_votes":3,"down_votes":0,"body":"there being a mute button doesn't change the fact that toxicity and hate speech could lead victims to extreme choices (suicide etc)\n\nit is not an excuse to be okay to severely harass people just because they're bad at the game, not everyone is on the same kill level and it's entirely riot's fault for ruining the matchmaking and also rewarding players for creating smurfs which means new players would always get smashed by better players and fail their learning phase.\n\nthe meta is too burst oriented which gives little room to learn how to manuever, react and win fights. hell even platinum players doesn't seem to know how to win games..\n\n{{sticker:sg-janna}}","replies":[]},{"poster":"Kawaii Godzilla","date":"2019-11-22T13:16:42.048+0000","up_votes":2,"down_votes":0,"body":"Ahh yes, add voice comms so i can hear children with impulse control problems call me every expletive and slur that they can think of. _Wonderful_\n\n/s","replies":[]},{"poster":"ﬂoo","date":"2019-11-22T07:20:55.637+0000","up_votes":2,"down_votes":0,"body":"Mute button was a bandaid fix and doesn't allow you to be flaming your teammates.\nIt's been asked for by the community because people like you don't know how to behave. Riot's been banning for any forms of toxicity before the mute button even existed.","replies":[]},{"poster":"NF Remilia","date":"2019-11-22T12:55:00.090+0000","up_votes":1,"down_votes":0,"body":"You dont know what you talking about :x  according to your logic every1 that has bad stats must be banned. Seeing your match history you have to be perma banned cuz of your bad scores lol . Toxicity is bad for any game, its violence and can damage people more than you think. Just Focus more on your mistakes, get better and carry games by yourself :) GL","replies":[]},{"poster":"Prandine","date":"2019-11-22T13:10:34.795+0000","up_votes":1,"down_votes":1,"body":"First off, you say you don't want people to be banned for toxicity and yet you complain about trolling and inting, which are also forms of toxicity.\n\nSecond off, trolls and inters do get banned (14-day ban first offense), but it takes longer than simple chat abuse cases due to needing to prove beyond a reasonable doubt that they're intentionally trolling, feeding, etc. In fact, here are two recent examples of inters getting banned: \n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/2Xkw0yE4-first-ban-and-14-days\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Wb6xkgzF-what-for-14-day-ban\n\nThat aside it makes perfect sense as no one wants to play with someone who's going to throw a fit whenever they don't get their way. It;s not pleasant to listen to and it derails the game from the more important matters. Yes there's a mute button but it's meant to be a band-aid solution at most and not a get out of jail free card for poor chat behavior. Besides, what good does flaming an inter or troll do? Aside from coddling your ego, absolutely nothing, and more often then not just makes things worse since they want a negative reaction from you. Don't give them that, chances are they'll stop or just dig their graves deeper. Best of all: you don't go down with them.\n\nWhile Riot is willing to give people chances to shape up, the number is not infinite, and eventually they have to remove those who are more interested in acting up than behaving civilly or maturely, since them staying is more harmful in the long run than them leaving. Also, you can be as good at the game as you want, but as players like Dardoch prove that doesn't matter if your reputation is being an obnoxious jerk since that can overshadow your skill.\n\nFinally VC technically does exist, but only for premades. That said if you can't be bothered to behave yourself with text chat then how can you expect others to believe you'll behave with voice chat? Seems pretty selfish if you ask me.","replies":[]}]}