{"poster":"Nashter","date":"2016-03-26T06:18:16.107+0000","title":"Historia del Genero MOBA","subforum":"Charlas Generales","embed":{"description":"Suscríbete a PrinceJaume: https://goo.gl/oQLKch G2A: https://goo.gl/B02RZL Nueva página FACEBOOK: https://www.facebook.com/PrinceJaume2 Muchos aún no saben cual es la verdadera historia de los MOBA, ¿cuál fue primero? ¿League of Legends, Dota 2, Heroes of the Storms, Smite...?","url":"https://www.youtube.com/watch?v=P8qAZn-Sz-I&ebc=ANyPxKqmaZyqOuD7t_EH95AxNrzVOwTXxUl-9_3LWW2tF_f5F8z7iHGt8fxfxvfUeoD-Ae3nFLrnO_Aw2-wOGBYiso3_5md7Fw","image":"https://i.ytimg.com/vi/P8qAZn-Sz-I/hqdefault.jpg"},"up_votes":9,"down_votes":3,"body":"Algo que mucho da&ntilde;o le hace a esta comunidad es la ignorancia, ademas de crear mucha pol&eacute;mica en el foro, el conocimiento del nacimiento del genero moba no le hara da&ntilde;o a nadie, ya seas un jugador de lol, Dota o un largo etcetera, disfruten del video y espero que esto ponga fin a la pol&eacute;mica.","replies":[{"poster":"Runth","date":"2016-03-26T09:52:36.841+0000","up_votes":3,"down_votes":0,"body":"solo dire 2 cosas\n\n1 , 18 años cumple el origen del genero moba\n\n2 , la raiz fue en blizzard como mapa personal como mmm AoS como digo arriba, pero su jugabilidad es muy diferente q ahora, luego idearon un mapa ARTS y con esa ideologia , crearon su gran metodo de los 3 carriles , 4 zonas de la \"jungla\" y las 2 bases, y como no quieren dejar el mismo nombre, dejaron como el conocido DotA (Defend of the Ancient) y asi siguio la cadena de su famoso subgenero q llego su gran exito su competivilidad q tambien incluye la comunidad del mundo\n\nAhora me retiro, comere -1 por hablar demaciado\n\nPD: Me gusta ese genero porq es adictivo como cualquier juego, y ademas \"IT´s FREE\"!!!","replies":[]},{"poster":"SL Forget","date":"2016-03-26T06:24:28.186+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nashter,realm=LAS,application-id=v7qsfXsE,discussion-id=GL8KAPxY,comment-id=,timestamp=2016-03-26T06:18:16.107+0000)\n>\n> Algo que mucho da&ntilde;o le hace a esta comunidad es la ignorancia, ademas de crear mucha pol&eacute;mica en el foro, el conocimiento del nacimiento del genero moba no le hara da&ntilde;o a nadie, ya seas un jugador de lol, Dota o un largo etcetera, disfruten del video y espero que esto ponga fin a la pol&eacute;mica.\n\nA ver, de esto no se habla hace 20 años, ''espero que esto ponga a fin a la polémica'' me voy a pegar la cabeza contra la pared, ya vengo.","replies":[{"poster":"YanXi","date":"2016-03-26T06:29:32.104+0000","up_votes":2,"down_votes":0,"body":"Si mucha gente discute de esto en facebook siempre esta(sarcasmo op).\n\n-Saludos","replies":[]}]},{"poster":"Apokita","date":"2016-03-26T22:13:09.008+0000","up_votes":1,"down_votes":0,"body":"Hay algo que se confunden, los doteros no odiamos (en su momento) a league por ser una copia, es mas, muchos estabamos esperando la oportunidad de jugarlo. El problema fué cuando Riot decidió pagarle a Pendragon para que tire abajo el foro oficial de dota y ponga una página con promocion de su jueguito, ahí nos volvimos locos. Nosé si pusiste esto en la \"historia de los mobas\" pero debería de estar.","replies":[]},{"poster":"ImNw","date":"2016-03-26T16:33:59.480+0000","up_votes":1,"down_votes":0,"body":"Simplemente vengo a decir que  Blizzard se debe joder por no pagarle a Icefrog por Dota, ahora se joden por pelotudos xD, hubiera sido una buena inversion.Lastima que la compro Valve, juge todo tipo de Mobas y ninguno se asimila al DOTA, ni el DOTA 2, hay una diferencia que notas en la jugabilidad, en cuanto al resto meh, historia sabida para los que juegan MOBAS desde antes que LOL y Dota 2 fueran conocidos como ahora, todo viene desde AoS y se hizo mas famoso por DOTA.\nEn cuanto a Plagio, si quisa las habilidades no sean un plagio pero varios modelos si:KK/GP, Tristana/Sniper,Corki/Girocopter,Davion/Shyvanna. y podria nombrar algunos mas, aunqe su diseño obviamente fueron diferentes.","replies":[]},{"poster":"Dayren","date":"2016-03-26T07:27:31.273+0000","up_votes":1,"down_votes":0,"body":"nunca he visto una conversación de un  \"te copias de\"","replies":[]},{"poster":"Yrox the Third","date":"2016-03-26T06:39:22.504+0000","up_votes":1,"down_votes":0,"body":"Cuando empezo el video con Aeon of Strife supe que estaba informado.\n\nAun asi, hay algunos detalles que si se pueden contradecir, por ejemplo, que las semejanzas entre modelos es algo indiscutible y apoyo al 100% los puntos que fueron mostrados en el video, tambien hay una \"copia\" o inspiracion de habilidades entre juegos, por ejemplo, las habilidades de Aurelion Sol con las de Ios (creo que se llama asi) de Dota. Los modelos es un caso aparte, pero las habilidades, algo que se crea despues y pueden ser totalmente creativos en este aspecto si se pueden criticar de \"copias\" o algo parecido.\nPero aparte de eso, bastante bueno el video, pero no parara el debate.","replies":[]}]}