{"poster":"UnleqitPsycho","date":"2019-10-17T19:11:46.158+0000","title":"Mitspieler inten mehrere Games hintereinander","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Liebes Riot-Team/ Liebe Riot-Community,\r\n\r\nseit wenigen Tagen spiele ich mit einem Premate zusammen. Unser Ziel: Gold erreichen. Wir ergänzen uns sehr gut und die Teamkommunikation stimmt auch. Wir gewinnen unsere Lane eigendlich immer bzw halten uns gleich mit den Gegnern. Dann gibt es da aber noch die \"Random\"-Mates die die anderen Lanes belegen. Bevor wieder gesagt wird das man ein Game auch zu zweit carryn kann und man die Schuld nicht immer bei anderen sehen soll. Das stimmt, solange das eigene Team even mit dem Gegner ist und diesen NICHT feeded. Speziell heute und gestern hatten mein Premate und ich Games wo man sich wirklich fragen muss was mit den Gegnern los ist. Wenn man über den Chat mit den Mates kommunizieren möchte, zusammenarbeiten will und Sachen called wie z.B. wo der enemy Jungler ist oder ob flashes up sind und man trotz dessen auf so einfache Sachen nicht eingeht. Zumindest auf Pings wo die Gegner sind und das man dann wenn man es gepinged bekommt drauf eingeht, adaptiert und einfachmal unter dem Turm steht sollte doch jedem im höheren Silber in Kopf sein. Wenn man sich einfach mal die Ranked-Matches von mir und meinem premate durchsieht kann man erkennen das wir in der Lane-Phase fast immer ahead oder even ist, jedoch meiner Meinung nach durch Team-Mates zurück gehalten wird das Spiel zu gewinnen. Und aufgrund unserer gefeedeten Gegnern können wir dann zu zweit auf der Botlane nix machen wenn wir gegen einen Jungle Shaco spielt der nach 10 min 8/0 steht. Ich bin der Ansicht das mein Mate und ich nicht in Silber gehören rein von unserer Laning Phase. Natürlich besitzen wir nicht die krassesten Mecanics und das macro play für high diamond oder ähnliches aber rein von dem was wir auf der Botlane abliefern gehören wir nicht in Silber. Natürlich kann man sagen das jeder mal solche Teamkameraden immer mal in seinen Games hat was ich auch verstehen kann, wenn es auch nicht jedes Game und nicht auf fast jeder Lane so abläuft. Wenn man schon in Pick/Ban- Phase Teammates hat, die einen beleidigen, ohne Grund bzw. zwei mal durch bannen ihres gezeigtem champion ist einfach unverständlich für mich. Es ist doch kein Grund zu trollen oder jemanden zu beleidigen nur weil man mal den Champion gebannt hat den er spielen möchte. Meiner Meinung nach sollte man sich auf mindestens 3 Champions fokussieren und nicht nur auf einen da es immer seinen kann das der Gegner diesen ebenfalls bannt. Und um diese Bans zu rechtfertigen: Wir haben zwei mal den Champion des Teamkameraden gebannt weil es uns einfach zu riskant war wenn er diesen spielt und uns dann denken das es dann einen anderen spielt und einfach darüber hinweg sieht das man seinen Champion bannt. Zudem wir selbst nicht gegen diesen Champion dann spielen wollen. Und wie schon gesagt darauf mit Beleidigungen zu antworten ist meiner Meinung nach lächerlich und kindisch, zumal diese einfach nicht gebannt werden nachdem man sie wegen unangemessenm Verhalten reported hat. Ich finde man sollte ein \"Gaget\" einführen welches die Pick/Ban- Phase abbricht wenn jemand beleidigt oder schreibt das er trollt und man nicht für -3 LP die Runde verlassen muss nur weil man nicht riskieren will mit solch einem Spieler in einem Team zu sein. \r\nIch hoffe ich bekomme darauf Feedback und hoffe meine Meinung wird respektiert und mit konstruktiever Kritik oder Zustimmen meines Ansehens beantwortet.\r\n\r\nMit freundlichen Grüßen,\r\n\r\nUnleqitPsycho","replies":[{"poster":"Aceay","date":"2019-10-17T20:16:55.097+0000","up_votes":2,"down_votes":0,"body":"Hi UnleqitPsycho,\n\nich kann deinen Punkt sowas von nachvollziehen. Durch reporten wird das Spiel auch nicht besser für mich ausgehen und ob ich den gleichen intenden Teammate zwei mal bekomme, oder einen anderen, der genau so krank drauf ist, ist dann auch kein Unterschied. Mir und meinem Premade fällt in letzter Zeit in unseren Spielen auf (hohe Gold-Elo), dass die Lanes, die von Randommates besetzt sind viel zu oft unnötig sterben und auch gegen eine Nautilus-Draven-Lane unglaublich aggressiv spielen, selbst wenn diese schon 10/0 steht. Ja ich rede hauptsächlich von der Botlane, denn ich spiele Mid und mein Premade Jungle. \"Warum sittest du die Botlane denn nicht einfach?\" frage ich ab und zu aber es kommt nicht selten vor, dass die Lane vor dem ersten Gank, oder kurz bevor mein Premade ganken will, stirbt. Im Endeffekt stehe ich dann meistens mit Ekko 14/3 o. Ä. und verliere trotzdem, da meine Botlane einfach nicht aus ihren Fehlern lernt und keine Ratschläge annehmen will. Wir wollen es in Zukunft so machen, dass die Botlane permanent von uns beiden gesittet wird, dann kann weniger schief gehen. Trotzdem sollte man normalerweise erwarten können, dass die Spieler ihren Playstyle je nach Verlauf des Spiels und nach Matchup anpassen können ( Nautilus-Draven, ne, is klar...).\n\nVielleicht können wir ja mal zusammen Flex spielen (dann bräuchten wir natürlich noch einen Toplaner), damit wir nicht mehr solche Botlanes bekommen und ihr euch auf eure Midlane und Jungle verlassen könnt. Meinen Namen siehst du ja... feel free to add.","replies":[]},{"poster":"Yuiwara","date":"2019-10-17T19:26:42.522+0000","up_votes":2,"down_votes":0,"body":"ehrlich diese 3 lp werden dich nicht umbringen, ignorier sie einfach und freu dich auf ein anderes besseres game.\n\nAußerdem kannst solche spieler immer reporten, iwann wird es deren accounts dann eventuell nicht mehr geben.","replies":[{"poster":"Λrbeitslos","date":"2019-10-17T20:01:14.727+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=ip27PlEH,discussion-id=VlhqKG9a,comment-id=0001,timestamp=2019-10-17T19:26:42.522+0000)\n>\n> ehrlich diese 3 lp werden dich nicht umbringen, ignorier sie einfach und freu dich auf ein anderes besseres game.\n> \n> Außerdem kannst solche spieler immer reporten, iwann wird es deren accounts dann eventuell nicht mehr geben.\n\nSolange sie keine schimpfwörter schreiben oder afk gehen wird sich leider nichts tun spreche aus erfahrung :D \nDu kannst einen account mit 60 games nunu machen und runter rennen da passiert halt wirklich nichts.","replies":[{"poster":"OT Riku","date":"2019-10-25T05:30:43.652+0000","up_votes":1,"down_votes":0,"body":"Tu das, mal bin gespannt wie schnell du gebannt wirst.","replies":[]}]}]},{"poster":"need elo police","date":"2019-10-17T19:23:23.161+0000","up_votes":2,"down_votes":0,"body":"Du hast doch gerade mal 120 Spiele gemacht, das sagt noch nicht viel aus. Dein Premade hat sogar erst 40 Spiele gemacht. Je mehr Spiele du machst, desto mehr gleicht sich das auch wieder aus. Unabhängig davon dass es auch im Gegnerteam Leute gibt die inten. Ansonsten hört sich dein Text nach der typischen League Community an, ist nichts neues und dein Thread ist nur einer von vielen.","replies":[]},{"poster":"Cenâreth","date":"2019-10-18T05:51:19.724+0000","up_votes":1,"down_votes":0,"body":"Ihr deckt praktisch 1 Lane ab um effektiv zu climben müsstest ihr schon mind. zwei Lanes abdecken entweder Mid/ADC Top/Jungle Mid/Jungle etc. Wichtig ist dass ihr euch dabei gegenseitig unterstützt ihr spielt beide Duo dass bedeutet Dass System stuft euch so ein dass ihr beide alle carryen müsst.","replies":[]},{"poster":"Catalysk","date":"2019-10-21T19:01:06.819+0000","up_votes":1,"down_votes":1,"body":"silber hahaha","replies":[]}]}