{"poster":"Jon Moxley","date":"2017-11-16T20:04:58.183+0000","title":"\"Ragazzi sono fatto e ho bevuto non flammatemi ahah xd\"??","subforum":"Discussioni generali","up_votes":1,"down_votes":8,"body":"Io &egrave; difficile che arrivo a flammare o anche solo irritarmi in game, ma questa &egrave; una cosa che non tollero. Io sono un tipo notturno, mi piace la notte quando non ci sono rumori come macchine esterne, televisioni o anche solo le voci dei miei familiari. Mi piace stare da solo e in tranquillit&agrave;, quindi gioco sempre quando vanno tutti a dormire, dalle 23 alle 5 di mattina pi&ugrave; o meno. Il problema &egrave; che durante questa fascia oraria, qualsiasi coda io starto che sia normal o flex, puntualmente capita che a volte mi ritrovi il tipo che (a game iniziato, perch&egrave; mica scemo che lo dica in champ select cosi che uno possa dodgiare, no, meglio aspettare di essere in game) comincia e scrive: &quot;guys i&#039;m high af, i&#039;m probably gonna feed hehe xd&quot; ora, se cominciamo un game, e tu perdi la lane e feedi 0/8 perch&egrave; il laner avversario era pi&ugrave; forte di te, o magari perch&egrave; sei un player inesperto e pushi alla cieca senza wardare i bush o avere vision di dove sia il jungler nemico, ci sta. Quante volte &egrave; successo, e non ho mai detto una singola parola di flame, cio&egrave; il tipo avversario era pi&ugrave; bravo o tu sei inesperto e stai ancora imparando, &egrave; giustissimo. Ma se ti fumi una canna, o ti ubriachi, e cominci un game sapendo che non sei in condizioni di giocare, e poi lo dici pure come premessa, sei un&#039;idiota che non avendo niente di meglio da fare ha loggato per rovinare il game ad altre 4 persone, e se tra quei 4 c&#039;&egrave; uno di quelli alla John Cena &quot;never surrend!&quot; li tieni bloccati per 30-40 minuti in un game che, diciamocelo, non &egrave; divertente, se non per l&#039;idiota che ha fumato e invece di mangiarsi un pacchetto di patatine e andare a dormire ha deciso che era giusto far perdere tempo agli altri. Questo, secondo me, &egrave; un comportamento degno di report.","replies":[{"poster":"Saibbo","date":"2017-11-16T20:17:00.386+0000","up_votes":6,"down_votes":2,"body":"Per caso ha preso {{champion:427}}  ivern? Per far crescere l'erba?","replies":[{"poster":"FireM1nd","date":"2017-11-17T00:39:00.315+0000","up_votes":1,"down_votes":1,"body":"Non so il perché,  ma quando ho un ivern in team, mi risuona in testa, ad ogni sua gank, il jingle di chiusura della pubblicità della Valfrutta. O.o","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2017-11-17T04:50:50.233+0000","up_votes":2,"down_votes":0,"body":"Stesso problema. Ma mitigato dal fatto che la maggior parte delle volte è simpatico","replies":[]},{"poster":"Re Sombra","date":"2017-11-16T20:56:55.117+0000","up_votes":1,"down_votes":0,"body":"era normal ??'","replies":[{"poster":"Jon Moxley","date":"2017-11-16T21:01:44.918+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Re Sombra,realm=EUW,application-id=MJVj50Jw,discussion-id=6G0ZMm57,comment-id=0001,timestamp=2017-11-16T20:56:55.117+0000)\n>\n> era normal ??&#x27;\n\nsuccede sia in normal che in flex. Ciò non toglie che siccome sia normal o flex siano autorizzati a farlo","replies":[{"poster":"Re Sombra","date":"2017-11-16T21:04:28.492+0000","up_votes":1,"down_votes":7,"body":"caro in normal ch tu la vinca o la perda non ti cambia un cazzo qnd ...","replies":[{"poster":"Jon Moxley","date":"2017-11-16T21:13:19.508+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Re Sombra,realm=EUW,application-id=MJVj50Jw,discussion-id=6G0ZMm57,comment-id=000100000000,timestamp=2017-11-16T21:04:28.492+0000)\n>\n> caro in normal ch tu la vinca o la perda non ti cambia un cazzo qnd ...\n\nCambia che c'ho speso 40 minuti del mio tempo, tempo che avrei potuto impiegare diversamente se avessi saputo da subito che c'era un tizio che ci avrebbe fatto giocare 4v5 dal primo minuto. A te piace buttare tempo a vuoto? A me no","replies":[{"poster":"HaIIeIujah","date":"2017-11-16T21:20:16.968+0000","up_votes":5,"down_votes":5,"body":"Ok, vengo _puramente_ per esprimere un'opinione personale.\n\nIn normal, ed esclusivamente in normal, non vedo dove sia il problema.\n\nGiochi peggio da fatto/sbronzo? Certamente. Ma le normal non riguardano il giocare correttamente, ma il giocare con il vago obbiettivo di vincere per divertimento. Giocare da fatti non è differente, in quanto a risultato, dal provare build sperimentali che possono o non possono fare schifo e andare 0/8, o da un OTP che gioca un campione diverso in normal per sgranchirsi.\n\nSempre e solo in normal, devi farti le seguenti domande:\n\n* Puniresti qualcuno che gioca assonnato, o dopo aver fatto una notte in bianco?\n* Puniresti qualcuno che gioca un campione che non sa giocare, e conseguentemente ci fa schifo?\n* Puniresti qualcuno che gioca una troll build, sempre in normal, ma tenta di vincerla?\n\nOserei dire che alla lunga sono tutte decisioni sub-optimali che riducono le tue possibilità di vittoria. Ma è normal, e non è una modalità competitiva, quindi a meno che non stesse intenzionalmente suicidando, non dovrebbe essere punito.\n\n/fineopinione.","replies":[{"poster":"mangialavandini","date":"2017-11-17T10:54:39.471+0000","up_votes":2,"down_votes":1,"body":"Piccola nota puramente informativa:\n\nInizio col dire che Condivido appieno il tuo pensiero Hallelujah (mi devo ancora abituare a questo nome XD)\n\n1. poi, ecco... se giocava SOLO da fatto (ganja)(alf) a buon rendere, perchè ha un effetto di concentrazione su un unico obbiettivo, in questo caso il gioco.\nRilassando il soggetto rendendolo mooooolto più tranquillo e quindi meno o addirittura anti flame (dipendentemente dal soggetto se vuole trollare, trolla), non sto a dilungarmi su OGNI effetto negativo/positivo ecc ecc.. \n\n2. Invece esattamente al contrario da sbronzo\n\n3.  spiegazione semplice: Ancora peggio un miscuglio, in quanto varie  sostanze della ganja vanno ad influire negativamente sull'acool in quanto sostanze opposte, distruggendo completamente anche l'effettivo positivo spiegato al punto 1. della stessa, oltre a fare dei danni permanenti al nostro corpo, ma questo credo che già lo sappiate.\n\nBye {{sticker:sg-kiko}}","replies":[{"poster":"HaIIeIujah","date":"2017-11-17T10:57:14.316+0000","up_votes":1,"down_votes":1,"body":"So assolutamente zero di droghe, quindi il mio era un discorso strettamente astratto. Grazie per la precisazione, immagino : V","replies":[{"poster":"mangialavandini","date":"2017-11-17T11:13:48.137+0000","up_votes":1,"down_votes":0,"body":"si si, è assolutamente per informare e precisare per coloro che leggeranno, poi inviterei tutti se interessati a vedersi in maniera più specifica un poco l'argomento, l'informazione è il potere più grande.\n\n in caso ti trovassi un \"fattone\" in team non mutarlo per nessuna ragione è perfetto per le strategie di gioco\n\n","replies":[]}]}]},{"poster":"Orgazmico","date":"2017-11-17T10:33:37.952+0000","up_votes":1,"down_votes":0,"body":"allora perchè non rimuovere la possibilità del report dalle normal? è vero che uno non gioca ranked se non vuole impegnarsi al massimo e solo rilassarsi, ci sta. Ma visto che in questo gioco uccisioni, oro e obiettivi contano e non è un fps dove a parte l'equip siamo tutti allo stesso livello e non ci sono potenziamenti di sorta (e se il divario diventa troppo grande finisci a giocare contro gli Dei), dove sarebbe la parte divertente nel morire continuamente, aspettare il respawn e il non poter fare nulla per reagire? si vince e si perde vero, ma sapere che 40 minuti del tuo tempo andranno in schifo e non potrai nemmeno giocare visto che sarai alla mercè degli avversari che ti bullizzeranno continuamente...","replies":[{"poster":"HaIIeIujah","date":"2017-11-17T10:44:39.899+0000","up_votes":2,"down_votes":2,"body":"> allora perchè non rimuovere la possibilità del report dalle normal?\n\nPerchè il flame ,il feeding intenzionale, l'andare afk, il rubare la lane (in Draft) e vari altri livelli più sottili di trolling sono ancora tranquillamente reportabili.\n\n> Ma visto che in questo gioco uccisioni, oro e obiettivi contano e non è un fps dove a parte l'equip siamo tutti allo stesso livello e non ci sono potenziamenti di sorta (e se il divario diventa troppo grande finisci a giocare contro gli Dei), dove sarebbe la parte divertente nel morire continuamente, aspettare il respawn e il non poter fare nulla per reagire? \n\nFacciamo un esempio: \n\nUn giocatore di nome Timothy entra in partita, Normal Blind Pick. Timothy non ha mai giocato assassini in vita sua, ma vuole provare LeBlanc. Timothy prende LeBlanc, ma non sapendo giocarla va 0/8, feedando a morte l'Orianna nemica che procede a diventare onnipotente e vincere la partita.\n\nIn questo caso, Timothy è reportabile?  Ha giocato in condizioni subottimali con un campione che non conosceva, ma non ha necessariamente \"feedato intenzionalmente\", poiché non era quella la sua intenzione. \n\nPersonalmente non vedo differenza tra qualcuno ceh gioca dopo una canna e qualcuno che gioca un campione che non ha mai preso: il risultato è uguale, fanno schifo e muoiono. Differente sarebbe il correre giù in midlane morendo otto volte per trollare il proprio team, ed un discorso _completamente diverso_ è fare una qualunque di queste cose in Ranked.","replies":[{"poster":"Orgazmico","date":"2017-11-17T12:42:48.744+0000","up_votes":1,"down_votes":0,"body":"se si gioca per divertirsi non c'è flame, se ci si diverte per far cazzate o provare cose nuove non c'è troll.\nComunque l'esempio che hai fatto non vedo come possano essere comparabili, da una parte abbiamo uno inesperto che comunque ci sta mettendo del suo, si impegna e purtroppo essendo la prima volta ha preso le batoste...capita anche ai veterani di trovare avversari migliori e perdere rovinosamente, non ci vedo nulla di male, può capitare nelle normal e nelle ranked.\nDall'altra invece abbiamo una persona che semplicemente non è in grado di giocare e non ha nemmelo lontanamente lo sbatta di impegnarsi un minimo,e se i suoi compagni vogliono mettersi in gioco o provare strategie serie (non fattibili in ranked), sono invece bloccati per 40 minuti nella stessa scatola con un compagno inutile che rende vani i loro sforzi......è come dire \"son stato operato a un braccio, ogni tanto smetto di usare i tasti delle spells per riposare e vado solo di auto-attack......probabilmentè fedderò\". In queste situazioni se proprio si vuol giocare c'è la modalità contro ai.","replies":[]}]}]}]}]}]}]}]},{"poster":"Bylloo","date":"2017-11-17T18:02:32.888+0000","up_votes":1,"down_votes":0,"body":"quando si dice che un giocatore è toxic...","replies":[]},{"poster":"RobottinoITA","date":"2017-11-17T13:44:25.233+0000","up_votes":1,"down_votes":0,"body":"Anche io come te ho di questi problemi nel senso,in normal mi capitano spesso persone che vogliono giocare a tutti i costi il loro champ e la loro lane e gente che trolla,ma essendo una normal non sto piu di tano a prendermela ma se e quando mi accade nelle ranked perchè purtroppo ci sono ebbeni si anche nelle ranked,faccio /mute all e via e lascio solo i suoni,e vero magari non ci parli ma puoi sempre lo stesso giocare con i segnali,ne va per la tua salute e per la tua giornata che credimi non ne vale la pena farsi il fegato amaro per 4 sfigati xD","replies":[]},{"poster":"Mazzy95","date":"2017-11-17T11:00:47.630+0000","up_votes":1,"down_votes":0,"body":"Gli unici motivi di punizione sono per un comportamento scorretto/non sportivo, per afk o per cheating.\nIl tuo ragionamento è giusto.. Però finisce lì, se ci pensi non esiste una soluzione a un problema del genere. Se esistesse una regola che dice che non si può giocare sotto l'effetto di alcool o stupefacenti, il tipo di cui parli non l'avrebbe scritto in chat. Se ragionassimo così significa che dovremmo mettere un etilometro nelle automobili che se superi il limite alcolemico, la macchina non parte (devo brevettare sta cosa {{item:2319}} )","replies":[{"poster":"Orgazmico","date":"2017-11-17T12:45:22.808+0000","up_votes":1,"down_votes":0,"body":"il tipo avrebbe fatto più bella figura non scrivendo niente...si dice: non parlare e lasciare nel dubbio anzichè levare ogni incertezza, cosi facendo ha fatto solo incazzare i compagni dichiarando all'inizio \"il match è perso\"","replies":[{"poster":"Mazzy95","date":"2017-11-17T12:58:42.163+0000","up_votes":1,"down_votes":0,"body":"Io intendo dire comunque, che il fatto che sia ubriaco o no, non per forza porta ad avere un bad game, magari si concentra a suo modo e riesce a fare la miglio partita sua mai giocata.. Ci sono dei casi peggiori in cui uno non dovrebbe giocare né in ranked né in normal (Una volta uno del mio team ogni 10 minuti gli si disconnetteva la connessione per 2 minuti, sempre ...)","replies":[]}]}]}]}