{"poster":"Jon Moxley","date":"2017-06-06T10:41:47.739+0000","title":"Il sistema di assegnazione dei voti a fine partita non andrebbe un po' rivisto?","subforum":"Discussioni generali","up_votes":11,"down_votes":4,"body":"Ieri pomeriggio ho voluto fare un test, per confermare una mia ipotesi.. Ho startato un game con l&#039;intento di prendere S. Farmo early game, non forzo delle gank, non invado la giungla avversaria, se un mio team mate era 1vs2 non andavo ad aiutarlo, non flashavo aggressivamente per prendere delle kill per preservare il flash come escape.. Insomma, un game che sinceramente non mi &egrave; piaciuto, non &egrave; il mio stile, eppure ho finito 10/1/8 su 45 kill totali (18 su 45 &egrave; una kill partecipation MISERA) e ho preso una S piena. Come? Una volta preso il vantaggio delle lane, sono stato afk farming per buoni 10-15 minuti, lasciando il mio team fare il resto, perch&egrave; se volete prendere S questo dovete fare. Dovete farmare come dei dannati e avere un buon kda, fregandovene di tutto il resto. Un altro game di settimana scorsa che feci, finii 21/5/11 su un totale di 35 kill (quindi 32 kill partecipation su 35) farmando pochissimo ma counter gankando quando il lee avversario gankava, mettendo pressione ovunque e partecipando ad ogni team fight, finendo top damage da full tank Ww e nonostante tutto ho finito con A. Perch&egrave;? Perch&egrave; ho preferito partecipare al game piuttosto che perdere 10 minuti a farmare lasciando il mio team 4vs5. Peanut, il miglior jungler in Corea e jungler degli SKT, sapete che media ha di farming? 30 minion in 10 minuti. Il problema &egrave; che la Riot usa questi algoritmi per ogni ruolo eccetto il support, ma non va bene. Si va a premiare un giocatore che ha pensato pi&ugrave; a se stesso (kda e farming) che ad aiutare il suo team in un gioco di squadra, &egrave; un controsenso secondo me.","replies":[{"poster":"Nice Doggo","date":"2017-06-07T11:24:54.103+0000","up_votes":2,"down_votes":0,"body":"Riassumendo l' intera discussione....\n\nOra le maestrie si farmano.\nOk.","replies":[]},{"poster":"Dr LouD","date":"2017-06-06T11:17:44.867+0000","up_votes":6,"down_votes":4,"body":"Belli i tempi in cui uno giocava esclusivamente per milgiorare, vincere e fare bene, quando non c'erano tutte 'ste robe dei voti casse chiavi maestrie ecc\n\nSigh, si stava meglio quando si stava peggio","replies":[]},{"poster":"ChaÎÎenger","date":"2017-06-06T19:04:25.772+0000","up_votes":2,"down_votes":1,"body":"Dipende dal campione e dalla lane...\n\n","replies":[{"poster":"Jon Moxley","date":"2017-06-06T19:51:26.554+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=ChaÎÎenger,realm=EUW,application-id=MJVj50Jw,discussion-id=zGnaciN9,comment-id=0003,timestamp=2017-06-06T19:04:25.772+0000)\n>\n> Dipende dal campione e dalla lane...\n\nNo, per niente. L'algoritmo non calcola queste differenze.","replies":[{"poster":"ChaÎÎenger","date":"2017-06-07T19:42:44.733+0000","up_votes":2,"down_votes":1,"body":"E invece si basa proprio su quello..","replies":[]},{"poster":"Darkinknight","date":"2017-06-07T15:35:29.597+0000","up_votes":2,"down_votes":1,"body":"Si le calcola..solitamente esempio WW va usato jng e a volte top,motivo per cui ti serviranno degli standard molto alti per la S(specialmente di farm,considerando che buildandolo con la {{item:3748}} molti farmano come dannati).\nProva a usare WW mid,fai una partita semidecente e la S è sicura 100%,proprio perche è un ruolo dove non è utilizzato,e quello sporadico player che lo usa mid fara mediamente schifo","replies":[]},{"poster":"HaIIeIujah","date":"2017-06-06T19:52:02.932+0000","up_votes":2,"down_votes":1,"body":"Certo che le calcola. E' basato sulla media dei risultati per campione.","replies":[]}]}]},{"poster":"Due spade","date":"2017-06-07T13:13:38.526+0000","up_votes":1,"down_votes":0,"body":"Decisamente qualcosa non va, ho anche la prova definitiva. Ho fatto venttonttordici partite migliori di questa, ma lo screen dice tutto lol...(18 min di partita)\n\nhttps://s2.postimg.org/ek6xpserd/essemeno.jpg","replies":[]},{"poster":"Life savior ","date":"2017-06-07T09:06:43.001+0000","up_votes":1,"down_votes":0,"body":"Mi ricordo che io per prendere la 7 con shyvana mi sono ridotto a farmare come un dannato e sono arrivato a qualcosa come 500 minion ahahaha","replies":[]},{"poster":" HegeKyras","date":"2017-06-06T14:48:43.676+0000","up_votes":1,"down_votes":0,"body":"Concordo ,io penso che il farm serva esclusivamente a te giocatore,voglio dire se inizia la fase team mi sembra ovvio che sia preferibile riunirsi con il team per la battaglia cosi come non é consigliabile andare in giro da soli a farmare rischiando di farsi uccidere e feedare un avversario, esempio,in una partita mi é capitato un lee che ha farmato come un pazzo arrivava alla fine della battaglia a prendersi le kill e da una situazione di vantaggio iniziale a forza di essere uccisi in inferioritá numerica abbiamo perso,personalmente mi interessa relativamente prendere i voti,inizia ad interesarmi solo nel momento in cui la partita si é messa in modo tale che ci siano buone possibilitá di prendere S e se non la prendo pazienza,preferisco divertirmi piuttosto che farmare come un dannato e lasciare i miei compagni senza uno,comunque io diminuirei il valore del farm e aumenterei quello degli obiettivi/assist, se hai tanti assist e hai distrutto torri o inibitori vuol dire che sei stato utile e che se la partita é vinta e anche grazie al tuo contributo","replies":[]},{"poster":"Due spade","date":"2017-06-06T11:56:32.434+0000","up_votes":1,"down_votes":0,"body":"La cosa tristemente divertente sai qual'è?Mi è capitata gente che ha scritto in chat, che se ne andava a farmare per prendere la S per il gettone. xD","replies":[{"poster":"Jon Moxley","date":"2017-06-06T12:09:44.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Due spade,realm=EUW,application-id=MJVj50Jw,discussion-id=zGnaciN9,comment-id=0001,timestamp=2017-06-06T11:56:32.434+0000)\n>\n> La cosa tristemente divertente sai qual&#x27;è?Mi è capitata gente che ha scritto in chat, che se ne andava a farmare per prendere la S per il gettone. xD\n\nSi lo so, ti credo, purtroppo il fatto è che se vuoi prendere i gettoni per la maestria 6 e 7 devi fare cosi quasi forzatamente e si perde anche il meaning dell'avere quelle maestrie su un campione. Anzichè star a significare che sei molto bravo su quel campione e ne conosci le meccaniche, i limiti etc, io ora li vedo come un \"Ah tizio ha la maestria 7, wow sa farmare\"\nlol","replies":[{"poster":"Nabbomaster","date":"2017-06-06T12:51:42.501+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Suna No Ookami,realm=EUW,application-id=MJVj50Jw,discussion-id=zGnaciN9,comment-id=00010000,timestamp=2017-06-06T12:09:44.016+0000)\n>\n> Si lo so, ti credo, purtroppo il fatto è che se vuoi prendere i gettoni per la maestria 6 e 7 devi fare cosi quasi forzatamente e si perde anche il meaning dell&#x27;avere quelle maestrie su un campione. Anzichè star a significare che sei molto bravo su quel campione e ne conosci le meccaniche, i limiti etc, io ora li vedo come un &quot;Ah tizio ha la maestria 7, wow sa farmare&quot;\n> lol\n\nio invece vedo  il tizio che ha mestria 7, e penso che spammi il campione","replies":[{"poster":"Jon Moxley","date":"2017-06-06T13:09:29.006+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabbomaster,realm=EUW,application-id=MJVj50Jw,discussion-id=zGnaciN9,comment-id=000100000000,timestamp=2017-06-06T12:51:42.501+0000)\n>\n> io invece vedo  il tizio che ha mestria 7, e penso che spammi il campione\n\nAnche, è giusto anche quello, ma non indica che sia per forza bravo con quel campione, o almeno non necessariamente","replies":[]}]}]}]},{"poster":"Dantazzo","date":"2017-06-07T10:13:25.446+0000","up_votes":1,"down_votes":1,"body":"Ragazzi, ora vi lascio uno schema dell'algoritmo usato per i voti.\n( _ | _ )","replies":[]},{"poster":"Apokàlypsis","date":"2017-06-07T09:46:11.191+0000","up_votes":1,"down_votes":1,"body":"Personalmente non so davvero come funzioni l'algoritmo. Una volta ho switchato line con un top (appena dopo lo spawn dei minion) che era contro Teemo e, con Ahri, ho fatto tipo 8/3 con un miserissimo 150 di farm o giù di lì. Ero sui 30 min circa ed ha avuto il coraggio di darmi una s piena con relativo gettone.\nE' proprio quando non ti frega un cazzo di loro che ti arrivano.","replies":[]}]}