{"poster":"Jon Moxley","date":"2017-06-19T10:48:34.400+0000","title":"Forse, e dico forse, i meme su alcuni player non sono del tutto una cavolata?","subforum":"Discussioni generali","up_votes":4,"down_votes":3,"body":"Ieri mi sono ritrovato in team una Riven top. Non aveva skin o maestrie dal 4 in su, quindi la botlane (a me sinceramente non fregava niente, ma va beh) ha cominciato a chiedergli dal primo minuto se fosse un first time Riven e di giocare safe, e lui sembrava alterato.. dopo 3 minuti ganko, prende la kill su fiora. Poco dopo fiora fa tp, lo diva sotto torre ma ci ri-crepa. Riven &egrave; 2/0/0. Tutto bene, giusto? No. Riven comincia a flammarmi in chat e cito testualmente: &quot;just camp top&quot;, gli rispondo che non posso, anche bot e mid mi stavano chiedendo di gankarli (in tutto questo io non avevo neppure il tempo di farmare in jgl) gli dico che dovevo aiutare anche le altre due lane, e lui mi risponde &quot;no, you don&#039;t have to. Mid has no carry potential and bot doesn&#039;t have either, camp top&quot; in parole povere io dovevo mollare i miei team mates per passare 20 minuti di game in top lane. Che per carit&agrave;, l&#039;ho fatto in un game successivo, ma avendo in top un Jax col bordino da platino, mastery 7 e soprattutto con la botlane che stava vincendo gi&agrave; di suo. Ho camperato top, fatto prendere 8 kill a Jax e da li si faceva da solo 1v5, un jax feedato fa paura. Ma non potevo camperare la top lane in quel game con altre due lane che perdevano. Vi lascio immaginare cos&#039;&egrave; successo dopo. Riven comincia a scrivere &quot;bad jungle you don&#039;t know how to play&quot; &quot;the top is lost&quot; (ricordiamo fiora 0/2/0 riven 2/0/0) &quot;Sejuani lost this game alone&quot; (dopo aver gankato mid e bot eravamo 8-3 per noi..va beh..) sta di fatto che la Riven ha cominciato a trollare male, io mi son lasciato innervosire e abbiamo perso. Forse, e dico forse, i meme che circolano sui main vayne/riven/yasuo/draven non sono poi inventati? Forse hanno un fondo di verit&agrave;?","replies":[{"poster":"Darkinknight","date":"2017-06-19T11:03:29.421+0000","up_votes":11,"down_votes":2,"body":"I meme o stereotipi in generale non sono una verita assoluta,ma non nascono dal nulla.","replies":[]},{"poster":"iBox360","date":"2017-06-19T13:14:08.906+0000","up_votes":4,"down_votes":1,"body":"Che hai contro i main {{champion:119}}?\nGuarda che ti reporto, sei solo un bronzo boostato\n(xD)","replies":[{"poster":"Mente Distrutta","date":"2017-06-19T13:38:00.402+0000","up_votes":1,"down_votes":0,"body":"hehe xd","replies":[]}]},{"poster":"vondarck","date":"2017-06-19T13:57:20.943+0000","up_votes":1,"down_votes":1,"body":"io quando smammano che hanno bisogno di un gank li istant muto, se sei in una situazione per ricevere un gank questo LO DECIDO IO\n\n\nmolti liner messi in jung non sanno neanche che ruote dovrei fare figurati chiamare un gank","replies":[{"poster":"Jon Moxley","date":"2017-06-19T13:59:46.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vondarck,realm=EUW,application-id=MJVj50Jw,discussion-id=ZReAla7j,comment-id=0002,timestamp=2017-06-19T13:57:20.943+0000)\n>\n> io quando smammano che hanno bisogno di un gank li istant muto, se sei in una situazione per ricevere un gank questo LO DECIDO IO\n> \n> \n> molti liner messi in jung non sanno neanche che ruote dovrei fare figurati chiamare un gank\n\nA me fanno morire quando pushano, senza vision o una ward messa da nessuna parte, magari sono anche sotto di 0/2 e pushando l'avversario sotto la sua torre, chiedono di essere gankati. Col tizio che è quasi full hp.","replies":[{"poster":"vondarck","date":"2017-06-19T18:56:26.116+0000","up_votes":1,"down_votes":0,"body":"io chiederei il risarcimento delle pink che piazzo e loro ignorano bellamente e si fanno planare nel retto e chiedono dove è il loro jung","replies":[]}]}]}]}