{"poster":"Jon Moxley","date":"2018-02-19T19:24:39.429+0000","title":"Esiste un modo per proporre alla Riot idee per delle skin?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"L&#039;altra sera una streamer tedesca su twitch otp Aurelion Sol aveva detto che a lei piacerebbe molto se la Riot rilasciasse ad esempio una Deep Sea skin per lui. Per chi non lo sapesse la Deep Sea &egrave; la skin di Nami da 1350 RP che non ricordo in italiano come si chiama ma va beh. Che &egrave; un&#039;idea carina secondo me, tipo anche io che sono un main Sejuani &egrave; da oltre 1 anno che ho in mente una skin per lei molto figa, in una cavalca un orso, in un&#039;altra un leone, sarebbe carino farne una per lei dove cavalca una tigre delle nevi (&egrave; anche in tema col suo personaggio) io la ista-comprerei anche se costasse 3250 RP. Non si possono proporre idee cosi alla Riot?","replies":[{"poster":"FireM1nd","date":"2018-02-19T19:40:51.087+0000","up_votes":1,"down_votes":0,"body":"Più o meno. Credo debba esistere una sezione dedicata qui sul forum, proprio alle creazioni fatte dagli utenti.  Siano esse disegni, fan fiction,  o altri. Ci sono pure bozzetti per nuovi Champion,  nuove Lore,  e via dicendo. È ovvio che non è esattamente come inviare idee alla riot, però capita che di tanto in tanto loro ci diano un occhio. Un caso: una fan-fiction creata da un'utente americano tra veigar e Lulu,  che alla riot è piaciuta talmente tanto da far diventare \"amici\" i due Champion anche su universo.\n\nPer il resto, la programmazione dei contenuti a pagamento è molto interna all'azienda, ma non priva di eccezioni,  come teemo diavolo e pantheon fornaio, idee chieste a larga voce dalla community e approvate poi in seguito dall'azienda perché ha capito che se realizzate, avrebbero portato ad un significativo guadagno. Ti consiglio di postare il contenuto sul forum in lingua inglese però,  dovrebbe avere più visibilità.","replies":[{"poster":"Jon Moxley","date":"2018-02-19T19:52:05.939+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FireM1nd,realm=EUW,application-id=MJVj50Jw,discussion-id=ZhXhaWvV,comment-id=0000,timestamp=2018-02-19T19:40:51.087+0000)\n>\n> Più o meno. Credo debba esistere una sezione dedicata qui sul forum, proprio alle creazioni fatte dagli utenti.  Siano esse disegni, fan fiction,  o altri. Ci sono pure bozzetti per nuovi Champion,  nuove Lore,  e via dicendo. È ovvio che non è esattamente come inviare idee alla riot, però capita che di tanto in tanto loro ci diano un occhio. Un caso: una fan-fiction creata da un&#x27;utente americano tra veigar e Lulu,  che alla riot è piaciuta talmente tanto da far diventare &quot;amici&quot; i due Champion anche su universo.\n> \n> Per il resto, la programmazione dei contenuti a pagamento è molto interna all&#x27;azienda, ma non priva di eccezioni,  come teemo diavolo e pantheon fornaio, idee chieste a larga voce dalla community e approvate poi in seguito dall&#x27;azienda perché ha capito che se realizzate, avrebbero portato ad un significativo guadagno. Ti consiglio di postare il contenuto sul forum in lingua inglese però,  dovrebbe avere più visibilità.\n\nIl problema è che io faccio schifo a disegnare.. Non potrei creare io una bozza della skin :/","replies":[{"poster":"FireM1nd","date":"2018-02-19T20:14:27.221+0000","up_votes":1,"down_votes":0,"body":"Esistono i grafici per questo. Prova a chiedere in reclutamento,  e a segnalare la questione anche nel thread in \"creazioni della community\". Magari qualcuno che ha le mani e che rimane colpito dalla tua idea può aiutarti","replies":[{"poster":"Jon Moxley","date":"2018-02-19T21:17:11.791+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FireM1nd,realm=EUW,application-id=MJVj50Jw,discussion-id=ZhXhaWvV,comment-id=000000000000,timestamp=2018-02-19T20:14:27.221+0000)\n>\n> Esistono i grafici per questo. Prova a chiedere in reclutamento,  e a segnalare la questione anche nel thread in &quot;creazioni della community&quot;. Magari qualcuno che ha le mani e che rimane colpito dalla tua idea può aiutarti\n\nVanno pagati?","replies":[{"poster":"FireM1nd","date":"2018-02-19T21:31:18.761+0000","up_votes":1,"down_votes":0,"body":"Se te lo chiedono, si. XD\n\nDopotutto, è un lavoro come un altro. Sta a loro decidere se darti una mano spontaneamente in maniera gratuita oppure chiederti un compenso per il loro tempo. Magari sottraggono tempo ad altri lavori per dare una mano a te a realizzare un concept della tua idea, e quindi, se te lo chiedono è nei loro diritti. Poi sta a te accettare, naturalmente. Magari prima o poi si fa avanti qualcuno che ti fa un bozzetto gratuitamente, perché è ancora uno studente, ha tempo, e la tua idea gli piace (oltre al fatto che può cimentarsi in qualcosa che magari non ha ancora fatto, arricchendo le sue capacità)","replies":[]}]}]}]}]}]}