{"poster":"AR URF","date":"2019-06-09T09:28:39.563+0000","title":"Pyke should not be able to execute through shields.","subforum":"Gameplay","up_votes":72,"down_votes":30,"body":"It makes summon aery useless for champs like {{champion:412}}. It makes {{item:3040}} {{item:3190}} {{summoner:21}} and any shield useless. On top of that it does true damage. I don't think he should be able to have stealth and execute through shields in the same kit. And he heals after taking damage. It's too much Riot.","replies":[{"poster":"Z3Sleeper","date":"2019-06-09T09:57:51.469+0000","up_votes":43,"down_votes":11,"body":"Use shields before you/your ally drops below the execute threshold.","replies":[{"poster":"Luther King Jr V","date":"2019-06-10T04:33:30.759+0000","up_votes":3,"down_votes":1,"body":"then he wont ult","replies":[{"poster":"LTK KoRo","date":"2019-06-10T09:46:09.548+0000","up_votes":5,"down_votes":2,"body":"then you will survive? sounds good","replies":[]}]}]},{"poster":"thefatlazycat","date":"2019-06-09T12:38:53.736+0000","up_votes":4,"down_votes":36,"body":"given how numerically weak Pyke currently is, I'd say that we're better off how he is, since this sort of thing would lead to some pretty heavy compensation buffs.\n\nEdit: I meant post-PBE changes Pyke, you pillock","replies":[{"poster":"Hotarµ","date":"2019-06-09T14:09:07.161+0000","up_votes":28,"down_votes":1,"body":"> given how numerically weak Pyke currently is, I'd say that we're better off how he is, since this sort of thing would lead to some pretty heavy compensation buffs.\n\nI don't agree with the OP but Pyke definitely isn't weak. If anything he needs some tuning and light nerfs to tone him back + take him out of solo lanes.","replies":[{"poster":"Crystalysk","date":"2019-06-09T14:23:00.541+0000","up_votes":23,"down_votes":5,"body":"People who say Pyke is weak are either abusers or blind.","replies":[{"poster":"Illabethe","date":"2019-06-10T01:48:39.613+0000","up_votes":5,"down_votes":11,"body":"No. we've literally compared him to other assassins, other champs, and tracked his damage output.\n\nHe IS weak. \n\nhttps://lolalytics.com/ranked/worldwide/platinum/plus/champion/Pyke/\n\nScroll way down and look at Pyke's Physical damage rankings on the right side of the page.\n\nHe's Rank 61 of 144 champs in Physical damage.\n\nIn other words....... there are sixty Physical champs doing more physical damage than Pyke.\n\nhttps://lolalytics.com/ranked/worldwide/platinum/plus/detailed/\n\nIf you rank this page by damage (overall per game)\n\nPyke is literally the 16th lowest damage in the GAME. (Most TANKS outdamage Pyke; these are the champs who don't: {{champion:44}} {{champion:16}} {{champion:201}} {{champion:117}} {{champion:12}} {{champion:89}} {{champion:497}} {{champion:412}} {{champion:427}} {{champion:40}} {{champion:53}} {{champion:267}} {{champion:111}} {{champion:3}} {{champion:72}} \n\nLiterally only ONE of those SHOULD be doing more damage then Pyke: Skarner)\n\n\nWhat makes you THINK he does a lot of damage: \n\n-Electrocute builds (Electrocute is about 1/3 of the total damage he does)\n-The fact you generally view lost duels and last hitters as punctuations of strength.\n\n---------------------------\n\nThe reality: \n\n-Pyke maybe gets 1-2 clean duels a game.\n-Pyke gets shut out of progression/team advantage in team fights where his team dies, he's the last one alive, and prevented from dueling anyone left.\n-Pyke doesn't lay on supplementary damage in between.","replies":[{"poster":"3TWarrior","date":"2019-06-10T05:37:21.368+0000","up_votes":4,"down_votes":1,"body":"pyke is also DIAMOND RATED, #26 best in the game and he's a support...who wound up in top lane, as an assassin\n\nsupport in top lane is a nono, as is mid lane, yet he's there.  they probably don't know what to do with him because Riot's \"nerf supports but keep assassins strong\" is kind of a conflict of interests with him","replies":[{"poster":"Illabethe","date":"2019-06-10T10:28:36.797+0000","up_votes":3,"down_votes":3,"body":"Weak is a term used to discuss damage.\n\nSaying he's competitive is another thing.\n\nI have yet to see many people legitimately know how to play against Pyke, and I've both played and played against Pyke hundreds of times.\n\nHis Gold gain for team is his strongest feature, not his damage or even his heals or his catching.\n\nYou'll notice: Any champ that has additional gold incomes generally performs \"Diamond\" because Gold > Skill, and Pyke supplements a whole team's Gold incomes, not just his own.\n\nGold is why Draven is always viable.\nGold is why TF is always viable.\nGold is why Pyke is viable.\nEz/Sona with Klepto are always Viable.\n\nThe only champ that is struggling that has a gold income is Gangplank, and that's generally just because games have sped up and he requires 2-3 items to take off.\n\n--------------------\n\nP.S. Another support, or actually two..... are ALSO in top lane, and one is generally taking the lane over: {{champion:223}} {{champion:44}} \n\n------------------\n\nP.P.S Pyke is actually in a nerfed state. \n1) he was forced to buy lethality for both his Ult and his W\n2) His Ult damage is actually down from his initial state\n3) Electrocute got nerfed after his release per hit.\n4) His HP Gain was dropped for a total of 103 lost HP over the course of a game.\n\nIn other words..... the problem with Pyke is his opponents. Not him.","replies":[{"poster":"3TWarrior","date":"2019-06-10T18:06:33.654+0000","up_votes":1,"down_votes":0,"body":"Gold is not why TF is always viable...he's always viable because he has a strong early game and his ultimate makes for perfect objective control.  When it comes to damage, he's actually the WEAKEST mage.  Gold helps him keep an advantage should he get it, but it is not at the core of his viability\n\nDraven...really...the snowball king?  \"always viable\" is very, very subjective here. He might always be playable, but he is not always a viable choice...he is a lane bully with decent scaling but horrible range and almost no defensive features.  Most, if not all, of draven's strength depends upon his team members and the draft composition of both teams.  If he is facing a janna and say caitlynn or vayne or any other defensive carries, he's going to have a terrible time because he won't be able to snag any extra income and he'll fall off like a rock.\n\nHere, you might be onto something, but again, it's all about team composition with draven...if the opponents are champions he can score kills on easily, he's S+ tier...\n\nEzreal and sona...come on man.  The reason that they are always viable is because Ezreal is EXTREMELY DEFENSIVE WITH LONG-RANGE DAMAGE (in most cases, he's never within 1000 units of the opponents) while he also happens to have one of the most fun kits of Marksmen.  \n\nSona scales like a monster and has a decent early game.  think of it this way, her Q passive allows her to add UP TO 150 + 150% AP damage to any auto attack damage done if it was just all 5 team members who attacked **ONCE** (they can attack more than once while in her aura ), while healing and having an ult that can clip the entire opposing team and having a movement speed boost ability.  She's useful and a high-priority target, which is one reason she does so well in solo-queue...people rarely focus the support\n\n#PS, fun fact, those two supports are actually being pushed into top lane, at least tahm is, as they increase damage and typically decrease utility.  Tahm has always been a decent duelist who can hold his own, so a tank that can also deal damage and protect carries while leaving the support position open...that's pretty valuable.  The same thing works with Taric","replies":[]}]}]}]}]},{"poster":"thefatlazycat","date":"2019-06-09T15:31:40.954+0000","up_votes":2,"down_votes":6,"body":"they've done that, they're relocating his power so he can't solo lane","replies":[{"poster":"Hotarµ","date":"2019-06-09T15:32:55.094+0000","up_votes":6,"down_votes":0,"body":"> they've done that, they're relocating his power so he can't solo lane\n\n Yes, I know, but as I'm sure you're already aware these nerfs are just proposed and might be subject to change. \n\n Also, many of us feel these might not hit solo-Pyke as hard as intended.","replies":[]}]},{"poster":"Illabethe","date":"2019-06-10T01:34:00.369+0000","up_votes":4,"down_votes":2,"body":"His damage output is literally about 60% or less than any other laner. \n\nHe can win a lane, but almost every lane vs a Pyke plays the same say: Pyke plays passive to 6, and then roams. It's not him dominating 1v1.","replies":[{"poster":"Hotarµ","date":"2019-06-10T16:24:18.427+0000","up_votes":1,"down_votes":0,"body":"> His damage output is literally about 60% or less than any other laner. \n> \n> He can win a lane, but almost every lane vs a Pyke plays the same say: Pyke plays passive to 6, and then roams. It's not him dominating 1v1.\n\n I think you misunderstood what I said.  \n\n When I say \"strong\" I'm not talking about his overall damage output, I'm talking about his map presence and teamfighting potential. Yes, Pyke plays almost identically when supporting but the fact remains that he was _not_ meant to be played in a solo lane like mid or top which is precisely why Riot is planning on nerfing him.\n\n Also, I usually agree with you when it comes to Pyke, but him being weak? No way.\n\n The link you used in your other comment [(This lolalytics one)](https://lolalytics.com/ranked/worldwide/platinum/plus/champion/Pyke/) is inconsequential. Why are you bringing up Pyke's damage output when in your first comment to me you specifically said:\n\n>\"**His damage output is literally about 60% or less than any other laner**. He can win a lane, but almost every lane vs a Pyke plays the same say: Pyke plays passive to 6, and then roams. **It's not him dominating 1v1.**\"\n\n You **know** that he has a low damage output per game yet... you're still trying to use that as evidence to support the fact that he's weak meanwhile you disregard his high pick rate and decent winrate. Any champion, no matter how they match up to other picks, is factually _not_ weak if they can maintain a 15%+ pickrate and a 50%+ WR.\n\n I definitely think Pyke isn't as egregious as some people say, but you're doing Pyke players a disservice by trying to manipulate information while disregarding his statistical evidence.","replies":[{"poster":"Illabethe","date":"2019-06-11T01:54:05.253+0000","up_votes":1,"down_votes":1,"body":"Compare his team fighting potential to Zyra's or Brands. I dare you. \n\nOh right...... Pyke in a team fight dies in .3 seconds if he does anything. \n\nPyke's role in a team fight post level 8 is generally: Sit back out of sight, wait for low HP targets, Ult them, and then CC the rest.\n\nHis Pick rate is not due to carrying, but due to simplicity, and defensive preferences. Players love get out of death free cards when they suck playing anything else.\n\nI wouldn't call a 50.49% Win rate \"Mind blowing\"\n\nP.S. {{champion:145}} 30% Pick rate, under 50% Win rate, \n{{champion:81}} 47.6% Win rate, 34% Pick rate\n{{champion:350}} 46.7%, 17% Pick rate\n{{champion:517}} 49% Win rate, 19.4% Pick rate","replies":[{"poster":"Hotarµ","date":"2019-06-11T03:12:59.098+0000","up_votes":2,"down_votes":0,"body":"> Compare his team fighting potential to Zyra's or Brands. I dare you. \n\n Different classes, different playstyles, different build paths, different down to the very core. Comparing them is nigh-impossible and has no impact on the conversation. \n \n> Oh right...... Pyke in a team fight dies in .3 seconds if he does anything. \n\n ...and?\n\n He's meant to be a _high-risk, high-reward_ champion who has to play every fight perfectly. Do you know what the payoff is? \n\nOne of the most devastating ults in the entire game.\n\n\n> Pyke's role in a team fight post level 8 is generally: Sit back out of sight, wait for low HP targets, Ult them, and then CC the rest.\n\n ...again, and?\n\n I know what Pyke does. I didn't complain about Pyke's playstyle or claim that I didn't understand it, _I said_ that he wasn't designed to be a solo laner which is factually true, supported by the fact that Riot is targeting a nerf directly at solo Pyke.\n \n> His Pick rate is not due to carrying, but due to simplicity, and defensive preferences. Players love get out of death free cards when they suck playing anything else.\n\n Dude, make up your mind.\n\n Which is it? Pyke dies in \"0.3 seconds\" or he has a get out of death free card that's up so often that anyone can pick Pyke up without a second thought?\n\n His pick rate is because he's devastating in the right hands, he works well into a fair amount of popular matchups, and he's fun to play.\n \n> I wouldn't call a 50.49% Win rate \"Mind blowing\"\n> \n> P.S. {{champion:145}} 30% Pick rate, under 50% Win rate, \n> {{champion:81}} 47.6% Win rate, 34% Pick rate\n> {{champion:350}} 46.7%, 17% Pick rate\n> {{champion:517}} 49% Win rate, 19.4% Pick rate\n\n You're right. It isn't \"mind blowing\" _but_ it is indicative of a champion that can hold their own in the current meta. \n\nHere's how things work:\n\n- **High pickrate + high winrate** = Probably too strong or too rewarding overall\n- **High pickrate + decent winrate** = Safe to assume the champion is meta, popular champion with positive winrates into popular matchups\n- **Low pickrate + decent/positive winrate** = Only good into a few matchups, unpopular champion, and/or winrate is held up by dedicated mains\n- **Low pickrate + low winrate** = Very weak, no strong matchups, any winrate is most likely held up by very dedicated mains\n\n\n You quoting winrates of other champions does _absolutely_ nothing because you're blatantly ignoring the rest of the statistics that disprove your claims.\n\n Is Pyke weak? **No**, because he consistently maintains a high pickrate and decent to above average winrate across many ELOs.\n\n_ Case closed._","replies":[{"poster":"Illabethe","date":"2019-06-11T03:27:36.214+0000","up_votes":1,"down_votes":2,"body":"Tell you what. You try to climb ranked playing a 50% Champ whose more based on how his team plays than how He played.\n\nI'm sorry. I don't consider any champion who relies on how their team plays, as strong.\n\nBeing strong while shining when with a competent team is one thing. \n\nAuto-losing because your team is atrocious is another. \n\nStrong champions have an impact on their team's performance, even when their teams suck.","replies":[{"poster":"Hotarµ","date":"2019-06-11T03:55:36.571+0000","up_votes":2,"down_votes":0,"body":"> Tell you what. You try to climb ranked playing a 50% Champ whose more based on how his team plays than how He played.\n\n P1: \"Hey, this champion is weak.\"\n P2: \"No, here's a bunch of statistical evidence with high sample sizes across many levels of play that disproves that claim.\"\n P1: \"Well, you won't really know how weak they are until you try to climb with them.\"\n\n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}]}]},{"poster":"Glaricion","date":"2019-06-09T18:30:22.033+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Hotarµ,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=00040001,timestamp=2019-06-09T14:09:07.161+0000)\n>\n> I don't agree with the OP but Pyke definitely isn't weak. If anything he needs some tuning and light nerfs to tone him back + take him out of solo lanes.\n\nSupports continuing to catch more flak from society for leaving their ~~baby~~ ADC just to get some fresh air than a young mother for leaving their child all night to go clubbing for the fifth time that week, and it is only Tuesday.\n\nLook, we love those little tikes, but we're putting diapers in the oven, whole chickens in the diaper genie, and we just took a nap with poop smeared across our cheeks.  We need breaks from time to time, someone else can watch our children for ONE MEASLY MATCH.","replies":[{"poster":"Hotarµ","date":"2019-06-09T18:36:23.904+0000","up_votes":2,"down_votes":1,"body":"> Supports continuing to catch more flak from society for leaving their ~~baby~~ ADC just to get some fresh air than a young mother for leaving their child all night to go clubbing for the fifth time that week, and it is only Tuesday.\n>\n> Look, we love those little tikes, but we're putting diapers in the oven, whole chickens in the diaper genie, and we just took a nap with poop smeared across our cheeks.  We need breaks from time to time, someone else can watch our children for ONE MEASLY MATCH.\n\n Pyke was not created to be a solo laner, he's often too strong when allowed to be played anywhere other than his designated role. \n\n Don't try to justify problematic gameplay elements with metaphors about how supports need to \"take breaks.\" It's more complicated than that and if you looked at the evidence you would see Pyke's current issues. ","replies":[{"poster":"Childofdragons","date":"2019-06-10T08:29:38.724+0000","up_votes":3,"down_votes":3,"body":"As a support main i can tell you that taking a break from your adc is something that would be a blessing sometimes.","replies":[{"poster":"Hotarµ","date":"2019-06-10T15:10:54.884+0000","up_votes":1,"down_votes":0,"body":"> As a support main i can tell you that taking a break from your adc is something that would be a blessing sometimes.\n\n I love how everyone is bringing up that you should \"take a break from your ADC\" and \"be roaming\" as Pyke when that has absolutely no bearing on what I'm saying.\n\n##[_Yes_,  I understand that you need to roam with Pyke and step away from your ADC sometimes. That's why I main him and have about 400,000 mastery points at the moment. ](https://championmasterylookup.derpthemeus.com/summoner?summoner=Hotarµ&amp;region=NA) \n\n I'm saying that Pyke isn't designed to be played in a solo lane. He is a _duo lane_ champion which is _precisely why_ he's receiving targeted nerfs to remove him from said solo lanes \n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}]},{"poster":"Crystalysk","date":"2019-06-09T13:44:27.561+0000","up_votes":18,"down_votes":3,"body":"Pyke so weak he has been played as solo laner in pro i guess","replies":[{"poster":"IShowerWithUrDad","date":"2019-06-10T17:03:00.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crystalysk,realm=EUW,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=00040000,timestamp=2019-06-09T13:44:27.561+0000)\n>\n> Pyke so weak he has been played as solo laner in pro i guess\n\nThe problem is that he is weak in the way he was designed to be, but now he is strong because he got buffs that completely changed his initial design. I think he should scale with supports items such as redemption, not with lethality. When he was released, his conversion of HP to AD was balanced and easier to balance. Now, he has multiple types of scaling on multiples moves. They should change his lethality scaling for HP regeneration scaling. This way, he couldn't just move extremelly fast with {{item:3142}}  and singlehandedly snowball on the midlaner after solokilling his top laner.","replies":[{"poster":"Crystalysk","date":"2019-06-10T17:26:14.328+0000","up_votes":2,"down_votes":0,"body":"I mean, when he hits 6 he basically has all the things you could possibly want in his kit. \nHe has engage/disengage/burst/cc/insane roam ability/sustain with passive.\nMost of the other supports are lucky if they have two of those things, yet he is allowed to do at insane level that shit.\nThe champ needs something taken away or make him pay for his mistakes. Because his kit allows him to fuck up and not get punisheD unless the player is not good at Pyke. \n\nThe problem is he does way too much fucking damage and  gives a stupid amount of gold gold with his R which didn't need that braindead passive on it.\nI wonder who the fuck thought an ultimate with execute and reset needed a passive like that.","replies":[{"poster":"IShowerWithUrDad","date":"2019-06-10T17:38:04.684+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crystalysk,realm=EUW,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0004000000000000,timestamp=2019-06-10T17:26:14.328+0000)\n>\n> I mean, when he hits 6 he basically has all the things you could possibly want in his kit. \n> He has engage/disengage/burst/cc/insane roam ability/sustain with passive.\n> Most of the other supports are lucky if they have two of those things, yet he is allowed to do at insane level that shit.\n> The champ needs something taken away or make him pay for his mistakes. Because his kit allows him to fuck up and not get punisheD unless the player is not good at Pyke. \n> \n> The problem is he does way too much fucking damage and  gives a stupid amount of gold gold with his R which didn't need that braindead passive on it.\n> I wonder who the fuck thought an ultimate with execute and reset needed a passive like that.\n\nThe thing about his sustain is that it only compensate for not being able to survivre prolonged fights(with his almost Yuumi level HP). I do agree that his ultimate is pretty weird and, even if it may be balanced, it honestly doesn't feel right. Which changes would you want to be added to balance him. I do not have many more ideas.","replies":[{"poster":"Crystalysk","date":"2019-06-10T17:52:11.878+0000","up_votes":2,"down_votes":0,"body":"The champion is low risk high rewards right now (note that i'm talking about players who mastered Pyke).\n\nI actually have never thought how to balance this nightmare of a champion... but maybe something like this could help:\n\n- his first R cast does half the damage if he didn't cc you with E or Q. If it still kills you the damage of the resetted R will still do half damage. This would prevent him from just randomly jump out of his 1k move speed W and execute you without doing anything.\nHis first R cast will do full damage if he lands a cc on you an so do the resetted ones.\n\nAnd this obviously won't fix lane Pyke that needs other nerfs.\nNerfs are necessary and some compensation buffs are ok if needed.\n\nEDIT: remove the stupid gold passive. It was never necessary on an already such powerful ability.","replies":[]}]}]}]}]}]},{"poster":"WastedHooker","date":"2019-06-09T09:52:40.395+0000","up_votes":7,"down_votes":53,"body":"I don't think shields should even be in the game. There's nothing interesting or smart with shields. But go ahead and downvote me because you have no counter argument, person.","replies":[{"poster":"AR URF","date":"2019-06-09T09:59:56.261+0000","up_votes":28,"down_votes":3,"body":"> [{quoted}](name=WastedHooker,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0001,timestamp=2019-06-09T09:52:40.395+0000)\n>\n> I don't think shields should even be in the game. There's nothing interesting or smart with shields. But go ahead and downvote me because you have no counter argument, person.\n\nIf there were no shields. Assassins would dominate the game.","replies":[{"poster":"Partholonian","date":"2019-06-09T17:58:13.763+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AR URF,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=00010000,timestamp=2019-06-09T09:59:56.261+0000)\n>\n> If there were no shields. Assassins would dominate the game.\n\nOne guess what role the person you're responding to mains...","replies":[]},{"poster":"Dewott610","date":"2019-06-10T05:14:12.784+0000","up_votes":1,"down_votes":0,"body":"{{champion:238}} ahahahahahahaha","replies":[]}]},{"poster":"Sebastit7d","date":"2019-06-09T22:09:29.330+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=WastedHooker,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0001,timestamp=2019-06-09T09:52:40.395+0000)\n>\n> I don't think shields should even be in the game. There's nothing interesting or smart with shields. But go ahead and downvote me because you have no counter argument, person.\n\nNot sure why you're getting downvoted for this, Shields are basically the defensive \"True Damage\". No way to lower them, most shield users and enchanters have it on an obnoxiously low cooldown and all they do is negate interactivity most of the time as most shields are instant cast with no travel time. If shields had actual skill expression then sure, go for it. And before anyone says the obvious, no, timing despite being a form of skill expression, is already a basic skill that every single player should have. You want to know what's even more interactive and skill expressive? actually predicting what's going to happen and preparing for it. Not having a free \"outplay\" point and click button.","replies":[{"poster":"3TWarrior","date":"2019-06-10T05:50:07.752+0000","up_votes":3,"down_votes":0,"body":"remember that time when focusing the tank was a bad thing?  yeah, me too...\n\ntanks are supposed to take the front, do maybe 50% of someone's health max if they land all of their stuff and receive a pummelling as they block skillshots while their allies close in\n\ndamage is too high now XD\n\nif you're talking about shielding supports, i'm all for champions like Janna getting their laning power back, but go figure that people hate getting nuked while crowd controlled from artillery range and having the power to clear the entire wave early...that's what Janna used to be able to do XD","replies":[{"poster":"Childofdragons","date":"2019-06-10T08:31:37.865+0000","up_votes":1,"down_votes":0,"body":"But then they screwed her hard...","replies":[]}]}]},{"poster":"FSRER","date":"2019-06-09T16:02:43.376+0000","up_votes":4,"down_votes":0,"body":"And why should executes be in the game and not be removed?","replies":[{"poster":"3TWarrior","date":"2019-06-10T05:47:19.550+0000","up_votes":1,"down_votes":0,"body":"because they look exciting and give a few champions a niche...though that's not always a good thing","replies":[]}]}]},{"poster":"ShadzMadz","date":"2019-06-10T05:01:40.734+0000","up_votes":7,"down_votes":0,"body":"I really hate how Ignite is suppose to expose you to vision but him going invisible doesn't account for it and he heals on top of that even if he was JUST right next to you, his healing is just as bad if not worse then Sylas,","replies":[{"poster":"Leetri","date":"2019-06-10T16:00:34.956+0000","up_votes":1,"down_votes":0,"body":"That's more of an Ignite issue than a Pyke issue, Ignite doesn't reveal any stealthed champions since it doesn't provide True Sight.","replies":[]}]},{"poster":"Sodeb Lacudomite","date":"2019-06-09T15:22:31.646+0000","up_votes":12,"down_votes":5,"body":"{{champion:555}} \nThis April fool champion should not be available out of 1st of April","replies":[{"poster":"Nea104","date":"2019-06-09T19:34:35.328+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Ir Sun,realm=EUW,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0005,timestamp=2019-06-09T15:22:31.646+0000)\n>\n> {{champion:555}} \n> This April fool champion should not be available out of 1st of April\n\nEspecially as a \"\"\"support\"\"\".\nWhat a joke... just like Season 8, after all :D","replies":[]}]},{"poster":"The thigh guy","date":"2019-06-10T14:45:16.244+0000","up_votes":5,"down_votes":0,"body":"I don’t think his base armor should be hitting one-hundred and thirty fucking five either.","replies":[]},{"poster":"xGvPx","date":"2019-06-09T22:40:52.498+0000","up_votes":5,"down_votes":1,"body":"Pyke/Urgot were designed/redesigned with fear in mind, so I think their executes fit that and I think the change maybe should occur in a different way. What I think should be made more apparent, to the player who might be ulted, is a warning that they are below the threshold. For Pyke, you get a really clear indicator. For the casual player, however, it isn't as apparent. It's basically, \"I think I am too low, I am getting out of here,\" haha.\n\nOtherwise, one the best ways to counter Pyke is to match his mobility early and later to get grievous wounds-like items. Mobility and hard CC ruins him.","replies":[{"poster":"SEKAI","date":"2019-06-09T22:56:29.571+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=xGvPx,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0009,timestamp=2019-06-09T22:40:52.498+0000)\n>\n> Pyke/Urgot were designed/redesigned with fear in mind, so I think their executes fit that and I think the change maybe should occur in a different way. What I think should be made more apparent, to the player who might be ulted, is a warning that they are below the threshold. For Pyke, you get a really clear indicator. For the casual player, however, it isn't as apparent. It's basically, \"I think I am too low, I am getting out of here,\" haha.\n> \n> Otherwise, one the best ways to counter Pyke is to match his mobility early and later to get grievous wounds-like items. Mobility and hard CC ruins him.\n\nThe difference between Urgot and Pyke's ulti is that, \n\nUrgot's ulti needs to land at least a skillshot, is single target, can be cleansed even when the execution condition is cleared and while you're being dragged in; does not refresh on kill; the execution threshold is 25% HP flat unlike Pyke's flat HP (not percent HP, FLAT) that SCALES with level, bonus AD AND lethality (3 individual scalings. yeah I guess trying to make is so Pyke can \"execute\" people from full health is fun amirite); Urgot's kill does NOT duplicate kill gold unlike Pyke's (which is just utterly ridiculous of a concept. Remember when Darius used to not scale well and one of his designed counterplay involved him shouldn't take all the kills with ulti or else he spells the doom of his team in late game? Yeah I wish there are still actual semblance of design in this god forsaken game); and what's more, Urgot's ulti isn't attached to the rest of the champ that is both super mobile and almost un-chase-able, can stealth, have infinite sustain, have 2 spammble powerful CCs where one of which can stun multiple enemies (this is also what mainly makes Pyke un-chase-able if the stealth + MS steroid + ridiculous HP regen all-in-one isn't OP enough, as an instant mobility attached with a tailwind AoE stun because reasons), and a extremely strongly powerful pick potential because of a long range hook.\n\nAnd Pyke is everything Urgot isn't, and simply better in most ways; the only actual thing Pyke loses to Urgot is total HP and that is literally it. And that's Urgot that Pyke is being compared to, so just have that sink in.\n\n........\n\nAlso no, CC does not \"ruin\" him. Champs take being CC'ed differently. And Pyke is one of the champ that is most resilient to CC.\n\nPyke is NOT someone like Master Yi, where being CC'ed probably mean's he's done, given Master Yi is entirely about how much AAs he has the chance to do while his on-demand sustain deliberately makes him not only vulnerable it is also easily cancelled by the opponent. And since Yi is a high priority target, killing him also effectively usually means winning the game.\n\n**This is NOT the case with Pyke.** Pyke is a low priority target that is equipped with busted power. He is a champion that is virtually unkillable and fitted to the brim with mindblowingly high utility, and just being alive means he can singlehandedly end the entire fight with ease. But at the same time not only is he extremely hard to kill and requires a LOT of commitment to get to him, but also killing him is completely pointless because he is A SUPPORT champion, but who EXECUTES AND DUPLICATES KILL GOLD.\n\nImagine Brand support, you know the phantom menace of bot lane. Now imagine if Brand has extremely high mobility, has infinite sustain, trades his extremely high raw damage for an equal amount of CC but KEEP HIS ULTI THAT NOW ALSO REFRESH ON KILL (while keeping enough raw stats in the rest of the kit to be able to solo lane, too. Because why not), and his ulti now also duplicates gold so no matter how many enemy champ he kills his other laner who took all the assist would be JUST AS FED. \n\nCongratulations. You've just imagined Pyke support. \n\nPyke is a champion that is EXTREMELY hard to kill, is extremely powerful because of his busted amount of utility and his chain-aoe-execute-from-full-hp nonsense, but at the same time also should not be focused no matter how fed he is because there's always someone on his team that is just as fed and thus doing more raw damage (than a support) and should thus take the priority thanks to his gold duplication. **Pyke is a broken champ that is so broken he makes the rest of his team EVEN MORE broken when he already is. A complete broken concept that should have never seen the light of day.**\n","replies":[{"poster":"Illabethe","date":"2019-06-10T01:32:06.704+0000","up_votes":2,"down_votes":1,"body":"You do realize that Pyke's Ult is ALSO a skill shot..... and it's generally also a delayed one..... You can dodge it simply by walking at a diagonal, as the cross will always line up with cardinal directions.\n\nComparing Urgot and Pyke in terms of just their ults is just ludicrous;\n\n-Urgot does almost three times as much self originated damage.\n-Urgot has serious wave clear\n-Urgot has a shield\n-Urgot has an attack speed buff\n-Urgot has massive HP\n-Urgot has a strong disable\n-Urgot has more useful skill cooldowns.\n\n---------------\n\nPyke is NOT resilient to CC. I don't know where you get that idea. Unless he has 51%+ Tenacity, he's generally dead in the water. And if he's 51% Tenacity, he lacks cooldown items, making his W and E dismally slow.\n\nYou're also HEAVILY exaggerating about Pyke being able to control ANY team fight. The only fight Pyke controls is generally one where everyone on the other team is already low HP.\n\nAlmost without exception: If Pyke is the last target, the opposing team will kill his adc/mage teammates, and then make him completely useless and on the run. Without a team, Pyke usually is completely useless.\n\nYou really stab your own arguments in the back; Brand literally makes Pyke useless, yet you're trying to claim Brand is weak unless his R is resetting.","replies":[]}]}]},{"poster":"Elite4Runner","date":"2019-06-09T10:03:29.655+0000","up_votes":6,"down_votes":15,"body":"Shields are treated as health, and as such they are given the same resistances that the character's health would if they simply had that much health. \n\nPyke's execute ignores resistances if the enemy is below the set amount of health, which includes the shield. As a result, the damage is dealt as true damage instead of physical. \n\nSo if I have 236 remaining HP and Pyke's ultimate deals 450 damage, the full amount of my hp is dealt as true damage. If instead I use Barrier, giving me an additional  215 shield (236 + 215 = 451), Pyke's ultimate deals 450 damage as physical damage, which is reduced by my armor. With 100 armor, physical damage is 50% effective, so Barrier would absorb 215 of that physical damage and my actual health would take 10 damage.","replies":[{"poster":"Illabethe","date":"2019-06-10T01:51:45.124+0000","up_votes":1,"down_votes":0,"body":"Shields have never been treated as health. They are treated as damage reduction prior to direct HP damage. There's a difference. Shield is more akin to Armor/Resistance than it is Health, because of the order.","replies":[{"poster":"Elite4Runner","date":"2019-06-10T02:45:24.160+0000","up_votes":2,"down_votes":0,"body":"I really wonder where people get the crap they spew out online. \n\nPlease do some research on [shields](https://leagueoflegends.fandom.com/wiki/Shield).\n\nI have good news. It won't take long. Just read the first two paragraphs. ","replies":[{"poster":"Illabethe","date":"2019-06-10T03:21:31.834+0000","up_votes":3,"down_votes":0,"body":"Shields can increase a unit's current health over its maximum, _**but they do not count as maximum health.**_ Before receiving damage, shields take into account the unit's resistances (armor or magic resistance). The shield strength can be increased with some items and runes.\n\nIn other words........ what I said is true.\n\nThe only reason you linked that wiki and think you are right, is simply because of the fact there's really no more appropriate wording to describe what a shield really is.\n\nIt isn't Maximum Health.\nIt isn't Magic Resist/Armor.\n\nIt behaves LIKE health.\nBut it mitigates damage from Max HP like Armor/Resist.\nBut since it is NOT Max HP, it does not behave like HP in regards to skills targetted at Max HP.","replies":[]}]}]},{"poster":"Kuponya","date":"2019-06-10T00:21:41.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elite4Runner,realm=NA,application-id=3ErqAdtq,discussion-id=tgpoUMEy,comment-id=0003,timestamp=2019-06-09T10:03:29.655+0000)\n>\n> Shields are treated as health, and as such they are given the same resistances that the character's health would if they simply had that much health. \n> \n> Pyke's execute ignores resistances if the enemy is below the set amount of health, which includes the shield. As a result, the damage is dealt as true damage instead of physical. \n> \n> So if I have 236 remaining HP and Pyke's ultimate deals 450 damage, the full amount of my hp is dealt as true damage. If instead I use Barrier, giving me an additional  215 shield (236 + 215 = 451), Pyke's ultimate deals 450 damage as physical damage, which is reduced by my armor. With 100 armor, physical damage is 50% effective, so Barrier would absorb 215 of that physical damage and my actual health would take 10 damage.\n\nNo. Pyke just straight up ignores shields while in threshold range","replies":[{"poster":"Elite4Runner","date":"2019-06-10T00:47:05.817+0000","up_votes":2,"down_votes":3,"body":"I've personally used a shield to deny Pyke an execute at a point where his ultimate would have absolutely killed me without it. \n\nSo unless you're experiencing a bug, .. I wholeheartedly disagree with you.","replies":[]}]}]}]}