{"poster":"Whispers Enigma","date":"2019-02-22T21:45:27.281+0000","title":"Tóxicos se unen para reportar, provocando restricción de chat x 25 partidas","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":3,"body":"Es justo que la gente **tóxica** se una, fomente un reporte con el otro equipo y se salga con la suya?\r\n\r\nComo Warwick jungla, empecé un Dragón yo solo, luego mi 3 de mi equipo murieron en bot, cuando el dragón estaba en 1000.\r\n**Me insultaron demasiado, mucho.** No puedo colocar sus nombres acá porque Riot borrará este post nuevamente.\r\n\r\nLos **silencié**, no voy a aguantar que me insulten gratis, pero me di cuenta por el chat del otro equipo que estaban pidiendo mi reporte.\r\n\r\nTerminó la partida, hice mis 4 reportes, pero se me aplicó una **sanción por 25 partidas de restricción de chat**. Tal cual, **sin un estudio del caso**, donde Riot pueda leer el chat y verificarlo.\r\n\r\nEste es el chat:\r\n\r\nPartida 1\r\nEn partida\r\nWhispers Enigma: mucho cuidado con Jax, Syndra y el adc... esta muy injusto el emparejamiento. Son nivel 300 casi, con 500k de maestria !\r\nWhispers Enigma: ward blue, pls?\r\nWhispers Enigma: 1 ward pls\r\nWhispers Enigma: éxito a todos!\r\nWhispers Enigma: =)\r\nWhispers Enigma: si gano, paso de promo\r\nWhispers Enigma: lobos y bajo\r\nWhispers Enigma: 500000 de maestria... super parejo\r\nWhispers Enigma: si, obvio! ganemos\r\nWhispers Enigma: wardea Tryun\r\nWhispers Enigma: otro insulto y te muteo\r\nWhispers Enigma: estaba sacando dragon muy calladito\r\nWhispers Enigma: un dragon que ahora ellos no tienen\r\nWhispers Enigma: asi que sigue puteando y te muteo\r\nWhispers Enigma: toxico\r\nWhispers Enigma: claro, facil decirlo si no paso\r\nWhispers Enigma: dale, peleemos mas. Ya nos violan 7-1 con maestrias platino\r\nWhispers Enigma: mejor los muteo y juego tranqui\r\nWhispers Enigma: a todos\r\nWhispers Enigma: no se si mi team les pedira report o algo, los mutee a todos. Que me vengan a tratar gratis de ctm no lo acepto\r\nWhispers Enigma: otro mas\r\nWhispers Enigma: toxico\r\nWhispers Enigma: que mal jugar una promo asi... aparte de la diferencia de nivel entre uds y nosotros... puteadas gratis, etc haha. Sera nomas...\r\nWhispers Enigma: acepten\r\nWhispers Enigma: nivel de cuenta 300 , 200 , etc\r\nWhispers Enigma: maestria de Syndra 500k, es mucho segun yo\r\nWhispers Enigma: debieron aceptar, no ganaremos\r\nWhispers Enigma: Estas partidas donde te rompen todo, sabes que perderas, pero no aceptan el ff y te tienen 30min jugando obligado xD\r\nWhispers Enigma: pls, cero torres\r\nWhispers Enigma: Date color\r\nWhispers Enigma: igual te robe el rojo\r\nWhispers Enigma: por que no aceptan? da igual si les caigo mal, no pierdan su tiempo\r\nWhispers Enigma: viejo, no he hecho nada... si me reportan me quejo ocn Riot y no pasa nada. No he insultado a nadie ni he trolleado\r\nWhispers Enigma: perdi mi promo de hecho y estoy tranquilo, solo quiero FF\r\nWhispers Enigma: hecho es con H compadre\r\n\r\nPerdí mi promoción, pero nunca la **calma** \r\n\r\nJamás insulté a nadie y no fui agresivo para nada. No teníamos torres y ellos todas, por lo que sugerí la rendición. No tiene nada de malo saber perder y aceptar la derrota, además **la opción de rendirse está.**\r\n\r\n{{sticker:sona-playing}} .\r\n\r\nEs justo esto? Ya cuesta mucho subir el honor y ganar recompensas para perder todo nuevamente y pasar 5 meses para llegar hasta donde estaba.\r\n\r\nCuéntame qué te parecen este tipo de injusticias.","replies":[{"poster":"Whispers Enigma","date":"2019-02-23T13:48:34.479+0000","up_votes":2,"down_votes":0,"body":"Bueno amigos, finalmente luego de largo día y larga noche... (No me rendí con la primera respuesta fría que recibí de POROBREWER diciendo que mi sanción estaba bien aplicada y que la merecía) acudí al soporte para exigir un estudio más profundo y con mejor criterio.\n\nWards On Sale acudió y con una cálida respuesta, mi castigo fue levantado.\n\nSi sabemos que se cometió una injusticia y que no hemos hecho algo malo, no descansen hasta comprobarlo !\n\nGracias a todos por sus respuestas y votaciones.\n\nÉxito en sus partidas.\n\n{{summoner:7}}","replies":[{"poster":"yOCobain","date":"2019-02-23T14:13:00.715+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Whispers Enigma,realm=LAS,application-id=PJAKt7ph,discussion-id=JBFUrJ4E,comment-id=0006,timestamp=2019-02-23T13:48:34.479+0000)\n>\n> Bueno amigos, finalmente luego de largo día y larga noche... (No me rendí con la primera respuesta fría que recibí de POROBREWER diciendo que mi sanción estaba bien aplicada y que la merecía) acudí al soporte para exigir un estudio más profundo y con mejor criterio.\n> \n> Wards On Sale acudió y con una cálida respuesta, mi castigo fue levantado.\n> \n> Si sabemos que se cometió una injusticia y que no hemos hecho algo malo, no descansen hasta comprobarlo !\n> \n> Gracias a todos por sus respuestas y votaciones.\n> \n> Éxito en sus partidas.\n> \n> {{summoner:7}}\n\nEra sumamente leve tu chat. No ameritaba una sanción. Además para lo único que hablaste fue para avisarles que los muteabas. Tal vez  fuiste un tanto repetitivo en algunas cosas sin necesidad y eso podría tomarse como molestia pero vamos... son pequeñeces...no da sancionar a alguien por un chat tan minúsculo que encima no pelea con nadie. Súper respetuoso en todo momento. Olvidate... no era justo una sanción por eso.\n\nSaludos!","replies":[]}]},{"poster":"DNZ PROSTAGMA","date":"2019-02-23T00:21:43.350+0000","up_votes":1,"down_votes":0,"body":"Hablaste bastante después de haberlos muteado me pareció medio al dope","replies":[{"poster":"Whispers Enigma","date":"2019-02-23T04:00:06.855+0000","up_votes":1,"down_votes":0,"body":"Si la verdad luego de la paliza recibida... (de verdad que el emparejamiento era ridículo. Nos enfrentemos a jugadores nivel 300 con maestrías 500.000) Sólo pedí rendirnos, asumiendo la derrota. Estábamos con las torres de base y no rompimos ninguna.\nSi algo de experiencia hay en el juego, se sabe cuando no hay caso en las partidas. Rendirse para ahorrar tiempo y jugarte otra, no tiene nada de malo. La opción de rendirte está en el juego, tomarla depende de ti.\n\nGracias por tu respuesta !","replies":[{"poster":"DNZ PROSTAGMA","date":"2019-02-23T18:44:36.259+0000","up_votes":1,"down_votes":0,"body":"Pensalo de esta manera, una restricción de chat es una tonteria, una advertencia.\nNo te lo tomes a mal, la penalización no te la pusieron por esa sola partida, seguro antes tenías reports acumulados y eso activó el bot que banea.\nAhora podes arrancar con el honor desde abajo, una nueva manera de ver las partidas y sin preocuparte por tener muchos reportes acumulados","replies":[]}]}]},{"poster":"Rosv Stuff","date":"2019-02-22T21:49:56.010+0000","up_votes":1,"down_votes":0,"body":"Manda un mensaje al soporte o soporte live, Y revisan el caso. Así hizo un amigo dónde éramos todos premades y lo reportamos y le banearon el chat jaja. Habló con el soporte y se lo sacaron","replies":[{"poster":"Whispers Enigma","date":"2019-02-22T22:14:22.928+0000","up_votes":1,"down_votes":0,"body":"Eso hice, aún espero.\n\nGracias por tu respuesta.","replies":[{"poster":"John Wiçk","date":"2019-02-23T02:09:41.820+0000","up_votes":1,"down_votes":0,"body":"Yo les di todos los argumentos y no me quitaron la sanción. incluso cuando:\n1:hable 1/5 de lo que hablaste tu\n2:me reportaron 2 troles\n3: demostré mi inocencia.\n4: no dije NI UNA SOLA palabra de acoso, insulto, grosería etc.\n5: el team enemigo se dio cuenta del troleo de mi duo bot\n6: pedi al team enemigo que no les hagan caso pidiendo report hacia mi por \"flammer\"\n7: en 100 partidas con suerte dije 2 garabatos y eran en broma (todo el team lo entendía asi y no fueron ni pensaron ser motivo de reporte)","replies":[{"poster":"Whispers Enigma","date":"2019-02-23T03:58:06.842+0000","up_votes":1,"down_votes":0,"body":"Buu, qué mal viejo ! Eso no debe ser, NO DEBE SER !\nUn juego que es conocido por su comunidad tóxica no debería permitir que esto pase.\n\nYo fui capaz de apelar por una sanción de suspensión de cuenta !! Y me la levantaron debido a un error tremendo.\n\nPero bueno, para eso están estos foros, uno no está solo.\n\nÁnimo y éxito en todas tus partidas por venir !\n\nGracias por tu respuesta.","replies":[{"poster":"John Wiçk","date":"2019-02-23T17:50:33.150+0000","up_votes":1,"down_votes":0,"body":"En el foro me daban la razon, no así los rioters jaja. son un chiste.","replies":[]}]}]}]}]},{"poster":"Whispers Enigma","date":"2019-02-23T04:11:54.875+0000","up_votes":1,"down_votes":0,"body":"LA RESPUESTA DE RIOT\n\nPOROBREWER\nfebrero 22º 2019, 10:41:40 pm\nTe comento que tu sanción esta justificada ya que si tomaste un comportamiento que no es correcto, esto no se justifica por que otros tomen un mal comportamiento, de igual manera una sanción no depende del numero de reportes si no del comportamiento que tomes.\n\nEspero corrijas estas actitudes.\n\nSaludos.\n\nPoroBrewer\nSoporte al Jugador\n\n\n\nOsea que justifican los insultos de estos 4 jugadores...\n\nOk, jugaré callado, sin cobrar recompensas nunca. Así premia Riot al jugador pasivo.","replies":[{"poster":"John Wiçk","date":"2019-02-23T17:42:22.862+0000","up_votes":1,"down_votes":0,"body":"A mi me atendió:\nSADASEP \nSHACO COMODIN\nPOROBREWER\n\ny no me levantaron castigo (gg honor >.&lt; )","replies":[]}]},{"poster":"Main Cocina S3","date":"2019-02-22T23:09:39.274+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Whispers Enigma","date":"2019-02-23T04:01:07.174+0000","up_votes":1,"down_votes":0,"body":"Mm claro, RIot te menciona que \"no te molestes\"... pero bueno. \nEn todo caso, el Rojo se lo \"robé\" a uno de mis compañeros que se estaba burlando de mí en mi misma jungla.\n\nGracias por tu respuesta!","replies":[]}]},{"poster":"Loli On Bush","date":"2019-02-22T22:12:29.140+0000","up_votes":1,"down_votes":0,"body":"Me, tu actitud es malinterpretable en alguna frases, pero por lo demás se ve casi injusto","replies":[{"poster":"Whispers Enigma","date":"2019-02-22T22:16:02.187+0000","up_votes":1,"down_votes":0,"body":"Lamentablemente no puedo pegar el chat de ellos, ni colocar sus nombres.\nRiot protege de alguna forma a esta gente sin querer, y se aprovechan.\n\nDe verdad que lo paso mal con la gente tóxica.\n\nGracias por tu respuesta.","replies":[]}]},{"poster":"PCtronix","date":"2019-02-22T21:52:28.953+0000","up_votes":1,"down_votes":0,"body":"** Whispers Enigma: dale, peleemos mas. Ya nos violan 7-1 con maestrias platino \nWhispers Enigma: asi que sigue puteando y te muteo\nWhispers Enigma: no se si mi team les pedira report o algo, los mutee a todos. Que me vengan a tratar gratis de ctm no lo acepto\n**\n\nno lo se .. por muy pequeño que sea un insulto te pueden bannear el chat","replies":[{"poster":"Whispers Enigma","date":"2019-02-22T22:14:02.411+0000","up_votes":1,"down_votes":0,"body":"Mm, no insulté a nadie directamente como para merecer el reporte que me dieron. \nA lo que voy es que ellos siguen jugando felices y yo atrapado con esto.\n\nGracias por tu respuesta.","replies":[]}]}]}