{"poster":"Subundu","date":"2015-10-22T10:50:04.922+0000","title":"La sconfitta più assurda (no rage post)","subforum":"Discussioni generali","embed":{"description":"Ogni partita è una storia a se stante; dai un'ochiata alla nuova cronologia delle partite di League of Legends per saperne di più e per capire come funziona.","url":"http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2351446530/217918769?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":2,"down_votes":2,"body":"Ciao!\r\n\r\nPer tutti coloro che si lamentano dei troll\\feeder\\afk e anche per quelli che non si lamentano, oggi voglio riportare alla vostra attenzione un elemento che provoca la sconfitta molto pi&ugrave; diffuso e decisivo: la stupidit&agrave;. In pratica voglio raccontarvi l&#039;ultima ranked che ho fatto ieri.\r\n\r\nIn champ select mi tocca supp e picko nautilus, che tra l&#039;altro avevo appena giocato, carriando col mio kindred adc la ranked precedente. \r\n\r\nNon ci sarebbe molto da dire, dopo poco avevo gi&agrave; la sensazione che fosse una di quelle partite dove non solo gli oppo sono pi&ugrave; forti, ma anche le circostanze giocano a loro favore. Il divario di gold e kill aumentava sempre pi&ugrave;, loro prendevano torri e draghi, noi legnate. Fightavamo e i mates morivano, ma loro si salvavano con 20 hp; oppure ci divavano e prendevo io la double kill...insomma tante piccole cose che creavano aria di sconfitta.\r\n\r\nAl min 29 l&#039;incredibile, la dimostrazione di quanto possa essere punitivo questo gioco. Loro sbagliano un fight e facciamo ace. Prendiamo la seconda torre mid. Perdono la testa. Mentre stiamo attaccando la torre dell&#039;inhibitor ci vengono incontro uno ad uno (e su questa cosa dovrei farci una discussione a parte) e ci muoiono di nuovo. Prendiamo torre, inhibitor e le due torri del nexus, poi back perch&egrave; stavano respawnando. Io ero l&igrave; che mi dicevo &quot;incredibile sto cazzo di gioco.&quot; \r\n\r\nA sto punto ci sarebbe da fare un sondaggio. La situazione era questa: avevamo sfondato mid ma le torri interne top e bot c&#039;erano, loro avevano un vantaggio di pi&ugrave; di 4k gold, 3 draghi ed erano feedatissimi. Insomma fare teamfight era un suicido. Dalla nostra parte c&#039;era il fatto che almeno mid c&#039;erano i super minion che li annaiavano, in pi&ugrave; si sono cagati e non uscivano pi&ugrave; dalla base. Sondaggio: voi che avreste fatto?\r\n\r\nIl mio ragionamento &egrave; stato: l&#039;unico modo per vincere &egrave; mettergli pressione da ovunque, quindi baron e torri top e bot. Invece no. Isteria collettiva. Pingavo gli obiettivi e mi rispondevano: &quot;nope&quot;, &quot;dont need turrets, just fight&quot;, &quot;gogogo&quot;. Almeno il baron riusciamo a farlo, poi il buio. Si catapultavano a gruppi di 2 o 3 nella loro base vs 5 pi&ugrave; feedati e ci morivano ripetutamente. Io non potevo fare altro che morirci con loro, dato che con nautilus non ho altra utilit&agrave;. Repawnavamo, io pingavo gli obiettivi e di nuovo &quot;no! group and fight&quot;...gruppavamo e morivamo di nuovo. Quelli nel frattempo prendevano draghi e baron. Al min 44, con un vantaggio ormai di 17k gold e 22 kill vincono il game.\r\n\r\nNon ho flammato, non mi sono incazzato, il mio stato d&#039;animo era pi&ugrave; del tipo &quot;ma daaaaaaaai, che shtupidi&quot;. Ho scritto agli oppo che meritavano di vincere e li ho onorati. Contro la stupidit&agrave; ancora non conosco il rimedio.","replies":[{"poster":"yumikiamuluigi","date":"2015-10-22T22:02:20.097+0000","up_votes":1,"down_votes":0,"body":"ricordo una ranked dove al minuto 34 avevano buttato giù tutte, ma proprio tutte le torri, e al minuto 57 l'abbiamo vinta\nVenivano a fare backdoor isolati(alla fine avevano uno shaco feeddato, quindi lo puoi capire).NEl frattempo facevamo soldini e finivamo le build. è stato un giorno felicissimo!","replies":[]},{"poster":"TinderBow","date":"2015-10-22T16:16:01.833+0000","up_votes":1,"down_votes":0,"body":"Lascio un commento che non centra niente, ma non so dove dovrei lasciarlo:\nNella testo(che presumo sia presa dal client) - \nCronologia delle partite di League of Legends\nOgni partita è una storia a se stante; dai un'OCHIATA alla nuova cronologia delle partite di League of Legends per saperne di più e per capire come funziona.\n - La parola occhiata è scritta in modo errato. Mi scuso per l'OT ma me ne sono accorto leggendo il post e non so dove potrei scriverlo.","replies":[]},{"poster":"Subundu","date":"2015-10-22T12:14:55.091+0000","up_votes":1,"down_votes":0,"body":"La mia è più che altro sopravvivenza basica...se mi incazzo e mi metto a flammare lo stomaco che si guasta è il mio, no il loro...\n\nShit happens, per l'appunto...","replies":[]},{"poster":"SKFF1R SubZero","date":"2015-10-22T11:03:29.793+0000","up_votes":1,"down_votes":0,"body":"Solo Q ne abbiamo? \n\nSi, anche a me sono successe cose del genere, come perdere una partita mentre ero sopra di 12k oppure, partendo da 10k di svantaggio e due inibitori giù, vincere la partita e avere 100 gold in più del team nemico (Si, 100, praticamente 3 minion e il Nexus): è il bello e il brutto di questo gioco cioè che partite di tal genere si possano capovolgere grazie a episodi singoli :)","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-22T12:12:12.367+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sanji992,realm=EUW,application-id=MJVj50Jw,discussion-id=mk92bMGp,comment-id=0000,timestamp=2015-10-22T11:03:29.793+0000)\n>\n> Solo Q ne abbiamo? \n> \n> Si, anche a me sono successe cose del genere, come perdere una partita mentre ero sopra di 12k oppure, partendo da 10k di svantaggio e due inibitori giù, vincere la partita e avere 100 gold in più del team nemico (Si, 100, praticamente 3 minion e il Nexus): è il bello e il brutto di questo gioco cioè che partite di tal genere si possano capovolgere grazie a episodi singoli :)\n\nIo,per qualche strano motivo,vinco nell' 80% dei casi SOLO quando stiamo perdendo....non ha senso!","replies":[]}]},{"poster":"INAZUMA 33","date":"2015-10-22T11:41:54.157+0000","up_votes":1,"down_votes":0,"body":"io recentemente ho vinto una partita dove fino al 30° minuto gli avversari stavano dominando perchè il nostro adc era afk. E' rientrato in partita e piano piano siamo riusciti a dominarli dopo altri venti minuti. Purtroppo quando accadono episodi del genere bisognerebbe fermarsi un attimo e far ragionare tutti i componenti della squadra, ma non tutti sono disposti a farlo. Comunque grande bomber per non aver flammato i tuoi teammates a fine partita, comportamento positivo +1!","replies":[]},{"poster":"Frattaglia","date":"2015-10-22T11:27:02.072+0000","up_votes":1,"down_votes":0,"body":"Pensa che una volta ho perso una ranked 5v4.\nShit happends, è molto triste quando ti capitano queste partite. :-/","replies":[]}]}