{"poster":"Subundu","date":"2016-08-14T11:13:43.196+0000","title":"Main si, ma main cosa?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Apro questa discussione per pura curiosit&agrave; sui vostri main.\r\n\r\nPer come la vedo io ci sono molti campioni bilanciati e tranquillamente viabili, basta che li si conosca un minimo. Per dirne alcuni, a pelle (quindi senza rifarmi a stats tipo champion.gg) trovo che personaggi come {{champion:136}}, {{champion:131}} , {{champion:79}} , {{champion:9}} , {{champion:39}} , {{champion:127}} , {{champion:75}} siano in buono stato, con counterplay visibili e momenti di forza e debolezza abbastanza palesi di cui tener conto.\r\n\r\nPoi ci sono altre 2 fasce di campioni: quelli con un kit overloaded e quelli con un kit apparentemente stupido, ma che possono rendere alla grande se mainati. \r\n\r\nNel primo gruppo metto roba tipo {{champion:245}} , {{champion:114}} , {{champion:238}} per il kit nella sua interezza e gente tipo {{champion:420}} , {{champion:240}} (ancora non &egrave; palese a noi plebs, ma vedrete a breve tutti diranno che &egrave; op) {{champion:18}},che hanno particolari  meccaniche che spesso lasciano un senso di &quot;non &egrave; giusto&quot;.\r\n\r\nNel secondo gruppo metto campioni come {{champion:266}} , {{champion:268}}, {{champion:432}} , {{champion:34}} , {{champion:3}} , {{champion:38}} , {{champion:82}} , {{champion:20}} , {{champion:35}} , {{champion:98}} {{champion:4}}  ecc che si hanno potenziale, ma bisogna saperlo sfruttare, se no si &egrave; useless.\r\n\r\nArrivo quindi alla domanda: nella scelta del campione a nessuno passa per la testa roba tipo &quot;prover&ograve; molta pi&ugrave; soddisfazione nel far rendere un campione complicato e apparentemente svantaggiato?&quot; So che la mentalit&agrave; dominante &egrave; &quot;picko quello che &egrave; op&quot; per&ograve; boh ero curioso di sentire i vostri pareri un minimo motivati.\r\n\r\nIo personalmente apprezzo molto di pi&ugrave; un giocatore di {{champion:35}} di quelli mindfuck rispetto ad un giocatore di {{champion:245}} che pu&ograve; andare tranquillamente kamikaze e premere r per avere blink indietro+heal+nuke (se serve) e rimediare cos&igrave; a qualunque bad positioning.\r\n\r\nRibadisco che questa &egrave; la mia idea, non un discorso sul bilanciamento del gioco, solo su quello della testa di noi players xd. Cosa ne pensate?","replies":[{"poster":"Blehic","date":"2016-08-15T08:41:51.082+0000","up_votes":1,"down_votes":0,"body":"Kled ha molto potenziale ma non lo trovo op, con Malphite l'ho distrutto e con una intera combo che mi ha fatto avevo più di metà vita, solo la Ulti la trovo un po' troppo forte.\n\nHo un amico che maina Aatrox, pure lui ammette che se la passa male ma in game riesce a dominare con quel champ, quindi hai ragione per Aatrox che va saputo usare bene.\n\nIo uso Mordekaiser, nonostante in questo periodo lo sto giocando poco, almeno in questa ultima patch e deve essere sfruttato ma se te la giochi bene con la ulti puoi riuscire a fare un 6 vs 4 con il fantasma del carry nemico, o sfruttare i danni del drago, anche se preferivo il suo kit prima del rework, anche prima aveva problemi eh, ora scala su tutto ma scala male, è questo il suo problema, oltre al modello base che è orribile e alla mobility inesistente. Aspetto un visual update anche se penso faranno come con Ryze, faranno un bel rework di modello e di skill perché così ha potenziale ma fa fatica a tirarlo fuori.\n\nCon Irelia non saprei, riesco a giocarci contro ma mi da sempre difficoltà, vero che early soffre, ma se sta safe, la Trinity la fa e dopo arrivano danni alti, gli hanno pure cambiato leggermente la passiva, quindi un parere su di lei, la trovo molto forte.\n\nAlla domanda direi che si mi sento più soddisfatto a saper rendere un champ difficile da usare e complicato da sfruttare, un champ che carria se ben sfruttato, a volte uso Azir proprio per questo, ma anche champ come Malphite mi danno soddisfazione, che non ci vuole tutta la skill di un Azir ma che mi piace usare, se un champ ti piace lo usi, che sia complicato o no non deve contare a mio parere, Lo sai usare bene? Ti piace? se rispondi si almeno alla seconda allora lo giochi, complicato o meno, che alla fine tutti i champ devono essere sfruttati al meglio, anche quelli più semplici come un Master Yi ad alti livelli devi sfruttare le skill nel modo giusto e al momento giusto.\n\nIo sto ritornando ai vecchi tempi e uso molto Malphite top ( cambio ruolo principale troppo spesso ma penso di fissarmi su questa ora come main top ) e penso di ritornare come tempo fa e mainarlo, perché è op? No, perché mi piace usarlo come mi piaceva qualche season fa, le sue skill, punti di forza e di debolezza.\n\nIo non giudico un main rispetto ad un altro perché il suo champ è facile da usare, se uno sa usare un champ alla perfezione gli dico GG, che sia uno Shaco o un Ekko o uno Zed o un Aatrox.","replies":[]},{"poster":"Blueberry Vayne","date":"2016-08-14T11:27:02.266+0000","up_votes":1,"down_votes":0,"body":"Mi trovo totalmente in disaccordo con te\n1) Irelia e gragas sono nettamente sopra le righe\n2) aatrox morde  sono troppo fuori dal meta, le spell di aatrox costano troppa vita, se vai full ad scoppi e se vai tank se inutile, mordekaiser non ha escape/close the gap quindi facilmente gankabile e kaitabile, stesso discorso vale per galio\n3) Illaoi non ha CC e per rendersi utile deve prendere vantaggio e riuscire a reggere almeno l' 1v2\n4) Nasus stesso discorso, soffre troppo i CC ed è abusabile early, se rimane indietro il tuo team è costretto a giocare 4v5 finchè non avrà un farm decente\n5) Tf e shen sono buoni evita di pickarli a low elo dato che non riuscirai a sfruttarli al massimo\n6) Fiora Zed ed Ekko sono ok","replies":[{"poster":"Subundu","date":"2016-08-14T12:18:12.748+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blueberry Vayne,realm=EUW,application-id=MJVj50Jw,discussion-id=nu5scYvk,comment-id=0000,timestamp=2016-08-14T11:27:02.266+0000)\n>\n> Mi trovo totalmente in disaccordo con te\n> 1) Irelia e gragas sono nettamente sopra le righe\n> 2) aatrox morde  sono troppo fuori dal meta, le spell di aatrox costano troppa vita, se vai full ad scoppi e se vai tank se inutile, mordekaiser non ha escape/close the gap quindi facilmente gankabile e kaitabile, stesso discorso vale per galio\n> 3) Illaoi non ha CC e per rendersi utile deve prendere vantaggio e riuscire a reggere almeno l&#x27; 1v2\n> 4) Nasus stesso discorso, soffre troppo i CC ed è abusabile early, se rimane indietro il tuo team è costretto a giocare 4v5 finchè non avrà un farm decente\n> 5) Tf e shen sono buoni evita di pickarli a low elo dato che non riuscirai a sfruttarli al massimo\n> 6) Fiora Zed ed Ekko sono ok\n\nmmm ti sei fermato a metà del mio post, comunque ti dico la mia:\n\n1. Irelia pre trinity è abusabilissima e può essere zonata dal farm. Se prendi un buon vantaggio chiuderà la triforce tardi e difficilmente potrà carriare. Gragas è vero che è un panzone che ti slowa e ti rimbalza ovunque, ma non ha i danni necessari per essere tossico, ha bisogno di followup.\n2. Aatrox e morde sono 2 esempi di campioni che vanno saputi usare bene per rendere. Aatrox è messo peggio secondo me, ma si possono comunque usare. Lo dimostra il fatto che ci sono main morde fino a master. Di main Aatrox ne so meno.\n3. Eh ma dopo i recenti buff o la counterpicki con qualcuno che sai usare, o sei più bravo meccanicamente, o prende vantaggio per forza e il 2v1 gli esce tranquillamente, è fatta apposta. \n4. Esattamente il mio discorso. Finestre di debolezza abusabili ma se lo lasci freezare e farmare non hai scampo. Guarda i video di sihrcez, come se lo gestisce. Soffre i cc è vero, ma se il team nemico li usa per lui, il tank, è già una vittoria.\n5. Infatti non li picko, proprio per il discorso che ho fatto.\n6. Beh uno che c'ha vayne nel nome non potrà che apprezzare altri pg tossici xd. E' come l'asse Italia Germania Giappone, ci si trova. Scherzo. Ma non troppo. xD","replies":[]}]}]}