{"poster":"Barzûl knurlar","date":"2015-11-10T22:27:09.618+0000","title":"Idee für ein neues Matchmaking System","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":12,"body":"Liebe league of legends community\r\n\r\nEs geht um das Thema ein angepassteres Matchmaking System\r\nMomentan ist es eher so, Spieler die im Normale game Diamant sind ,mit anderen Spielern zusammen und Gegeneinander spielen m&uuml;ssen, die gerade mal Bronze oder Gold sind, daher nicht soviel Erfahrung mitbringen. K&ouml;nnte man das nicht irgendwie &auml;ndern? Wir haben die selbe Problematik auch im rankend , Spieler mit sehr viel Spielerfahrung treffen h&auml;ufig auf welche ,die nicht soviel haben gerade in dem unteren ELO-Bereich. W&auml;re das nicht viel besser wenn man die Spieler nach der Gesamtanzahl der Spiele gruppiert?","replies":[{"poster":"Sirrkas","date":"2015-11-10T23:59:29.882+0000","up_votes":2,"down_votes":0,"body":"Ob jemand 2000 Spiele hinter sich hat oder 200 macht keinen wirklichen Unterschied, wenn er auf eine bestimmte Elo gehört. \n\nWenn die Priorität zu sehr auf Anzahl der Spiele liegt, werden die Wartezeiten deutlich länger und die Spiele zudem unausgeglichener.","replies":[]},{"poster":"Powerjen","date":"2015-11-11T09:30:41.053+0000","up_votes":3,"down_votes":1,"body":"Eines der einfachsten Systeme ist die Winratio gerechnet über die letzten 100 (oder 200 oder jede geeignete statistisch relevante Anzahl) Spiele. Das kombiniert mit der Winratio über die letzten 20 Spiele sollte klarmachen wo ein Spieler steht und wo die Reise hingeht.\n\nDein System hat viele Nachteile:\n1. 2000 Spiele auf Bronzelevel sind möglich\n2. dadurch würden ebenfalls schwache und starke Spieler gematcht\n3. es kann nicht die Spielstärke ermitteln, nur die Häufigkeit\n\nUnter dem Strich würdest Du Dir keinen Gefallen tun, sondern weitaus unfairer behandelt werden als jetzt. Deine aktuelle Unzufriedenheit beruht wohl auf einer hohen Zahl an Niederlagen in kurzer Zeit und als Ursache muss dieses Mal das Matchmaking herhalten anstatt wie üblich die schlechten Teammitglieder.\n\nWie die Mathematik hinter dem Matchmaking von RIOT aussieht weiss ich natürlich nicht, aber sie ist ohne Frage weitaus robuster und präziser als Dein Vorschlag. Und weitaus komplexer.","replies":[]},{"poster":"HyperionCH","date":"2015-11-11T10:00:35.217+0000","up_votes":1,"down_votes":0,"body":"Zu Punkt 1 (Normal-Games):\n\nOft passiert so etwas, weil Freunde zusammen spielen und einer ist z.B. Platin und der anderen Bronze oder Silber (alternativ: Coach und Schüler statt Freunde).\nRiot müsste in Normals also - wie bereits in Rankeds - verbieten, dass Premades mit solch unterschiedlichem Skill zusammen spielen dürfen.\nWas würde dann aber passieren? Freunde wollen immer noch gelegentlich ein Game zusammen zocken bzw. wird auch zukünftig Coaching angeboten. Die High-Elo Spieler würden deshalb einfach einen smurf erstellen, damit sie z.B. mit Freunden weiterhin spielen dürfen. Mit dem Main-Account bekommt aber der Gegner - wegen der hohen MMR jenes Spielers - zumindest auch einen guten Spieler ins Team. Spielt man jedoch mit einem smurf mit Freunden, wird das Gegnerteam wegen der tieferen MMR keinen starken Spieler als Ausgleich bekommen. Fazit: die Normal-Games werden unausgeglichener.\n\nZu Punkt 2 (Spiel-Erfahrung):\nIch vermute, dies wird teilweise getan. Jedenfalls hatte ich in der Einstufung dieser Season in SoloQ oft 3-5 Minuten warten müssen (ich hatte vorher nur 10 Rankeds aus der letzten Season und war damals Gold 4 geworden -> also sehr wenig Erfahrung + verhältnismässig hohe Ranked-Elo). Kann aber sein, dass es auch daran lag, dass es die Neueinstufung war (wobei ich später teils auch bis 3 Min. warten musste, obwohl ich wieder unter Gold gefallen war).\n\nSpielerfahrung ist zwar wichtig, aber nicht ausschlaggebend; nicht nur in LoL.\nEin 20jähriger Nationalspieler hat weniger Spielerfahrung als ein 40jähriger Kreisligist. Jedoch wird der junge Nationalspieler immer noch besser sein.\nIch habe wie erwähnt (immer noch) wenig Spielerfahrung, jedoch - aus meiner Sicht - viel theoretisches Wissen über Strategien, Taktik, etc. (das ist kein Segen, sondern ein Fluch, da man jeden eigenen Fehler sofort erkennt, egal wie klein er auch ist...). Alleine dies reichte schon, um Bronze-Spieler - mit einem Vielfachen mehr Spielerfahrung - coachen konnte, damit sie auf Silber kommen.\n\nBezüglich Spielerfahrung werde ich einem Spieler der gleichen Elo wie meiner sicherlich oft unterlegen sein. Ich habe jedoch auch andere Stärken, die dies wieder kompensieren; sonst wäre ich nicht auf der gleichen Elo. ;)","replies":[]},{"poster":"Barzûl knurlar","date":"2015-11-11T19:46:04.813+0000","up_votes":1,"down_votes":2,"body":"League of legends ist in erster Linie ein Teamspiel,  abgesehen vom Team ranked wird mehr neben einander her gespielt, als zusammen.\nDas könnte   hauptsächlich an der  nicht vorhandenen Absprache und der Koordination der einzelnen Spieler untereinander liegen.  Wenn wir uns da die Normal-Games anschauen sehen wir Spieler die sich keine Wards kaufen  oder nutzen , einfach ignorieren das eine Lane  Hilfe  benötigt und lieber Flamen, trollen oder damit drohen afk zugehen, anstatt sich untereinander zu helfen  und  auf  einen  gemeinsamen Sieg hinarbeiten . \n\n Das selbe haben wir auch in Bronze ,ein Spieler der häufig 2 Mitspieler im Team hat die afk sind, wird es im Ranked dem entsprechend schwerer haben.Da  sich ein 3 Mann- Team logischerweise nicht gegen eines mit 5 halbwegs guten Spielern behaupten kann . Unser der zeitiges Elo system ist in  dieser Hinsicht nicht gerade  fair, ein kleines Beispiel : Ein Spieler der Support auf Gold Niveau spielt und in Bronze Mitspieler hat ,die keine Erfahrung im Team -fight  haben, sich schlecht positionieren usw wird selbst mit einer guten Performance nicht viel machen können . Er verliert mehr Spiele als er gewinnt und wird immer schlechter eingestuft\n Meine Vorschlage wären,dass man das ward Limit auf z.b 50 erhört und die Zeit so anpasst ,das ein Spieler   für das gesamte Team  Wards setzen kann.Die Einführung eines Sprach chats wäre auch mal angebracht oder das wir alle die Solo Spieler zusammen packen die im Durchschnitt die selbe Anzahl an Wins haben im Normale-Game.\n Fürs Ranked denke ich an ein System,was nicht nur auf die Siege  schaut ,sondern auch drauf Wert legt ,wie sich die einzelnen Spieler verhalten. Wer seine Spiele zwar verliert kann das mit gutem Teamplay ausgleichen . Somit hoffe ich, das es in der Zukunft auch für solo Spieler die keine Freunde haben oder Teampartner  in der Lage sind, auch mit zufälligen Mitspielern eng im Team zusammen zu spielen   und gerade in einem fairen  Ranked wirklich try harden müssen. Wenn ihr noch  Verbesserungs Ideen  habt immer her damit  :)","replies":[]}]}