{"poster":"Nautilus Godilus","date":"2017-05-23T03:04:34.554+0000","title":"Suggestion for New Words in Hate-Speech Filter","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi, from my experience i'm assuming that there's a word filter for the offense \"Hate Speech\" which I greatly appreciate. But I was wondering if you had any plans on adding a couple words or phrases to this filter. While I personally have been called a multitude of racial and homophobic slurs, I know it's over the internet and it isn't true so I get over it quickly. One thing that really get's to me is usage of the word \"autistic\". With the phasing out of the word \"r%%%%%ed\" it seems like \"autism\" is taking it's place which is terrible. My younger brother (Summoner name: Darbnelius) has autism and he loves your game. But because he is still learning how to play and knows he isn't fantastic at the game (Most people aren't) he refuses to play any PVP. he's afraid of being flamed. For people with his condition harshness from others has a much bigger impact, but he doesn't want to mute anyone because he values being a team player and helping out with whatever issues or plans other players might have. The saddest part is I report anyone I see that uses autism, I've even had a summoner go against me with an offensive antisemitic name that had autism in it. And not a single time have I gotten a notification saying they were penalized. Please make the report filter stricter. \r\n\r\nP.S I know about the chat filter but he isn't dumb, he'll just use context clues and assume someone is flaming him and possibly calling him by his condition.\r\n\r\nP.P.S Got my support request grabbed so i'm posting here.","replies":[{"poster":"Broporo","date":"2017-05-23T04:44:43.372+0000","up_votes":1,"down_votes":0,"body":"Oh buddy, I am **personally** very sad to have read this. I know sometimes matches get heated and people can sometimes throw around words, sometimes even to intentionally harm others. I will say this, Riot does not stand for negativity of any kind. ESPECIALLY things of this nature. While our filter doesn't pick up on these words yet, I'm going to reach out to as many people as I can to see if anything can be done rather soon about it. \n\nIn the meantime, I would try to encourage your brother to play without all chat on. That way he will still be able to communicate with his teammates and doesn't have to be targeted by the enemy team. Not entering PVP is also a good choice, as those matches can get much more heated than other types. \n\nGoing forward, keep reporting those players and eventually, action should be taken. If you don't feel like that is working, you are more than welcome to reach out to us in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) with any screenshots you might have of those players behavior, and we'll be sure to take a look into it.","replies":[{"poster":"0101010010111010","date":"2017-05-23T10:11:24.685+0000","up_votes":3,"down_votes":0,"body":"well the thing is most toxicity comes from own team, rarely in all chat, apart from people saying LOL LUCKY NOOB BRONZE I REK U 1V1 M9 xddDdDdDd or something like that. I myself belive pings are ALL the communication needed to teamwork. Rito did an amazing job designing the ping circle. Help, Danger, Back, Attack, Comming, Missing enemy. Flawlessly designed ping system that tells your teamates EVERYTHING there is to it in the game. And ofc ping baron and dragon timer is an even higher level of masterclass desing from riot. Also here is a suggestion rioters you could do, in the options menu, you could add a button TURN ON CHAT / OFF CHAT, that would ENTIRELY dissable the chat window. I myself play with chat window hidden out of screen and enter key dissabled in plugins to prevent stunning myself with entering chat, but i think an option to entirely dissable chat would be a nice touch, since as said, your masterclass level design pings are everything we need for communication.... apart from 6x missing enemy on dead allies xd\n\nalso here is a Jinx {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Nautilus Godilus","date":"2017-05-30T13:21:49.634+0000","up_votes":1,"down_votes":0,"body":"Thank you, this wasn't just concern for my brother, but of other ethnic groups too. I know you've got  one major player in the Hate-word arsenal out of there but that word covers really only one group of people. I've seen a lot of islamophobic and xenophobic sentiments thrown around. While I doubt any of these people mean what they say, I know others can be sensitive to these sorts of things. He will be avoiding pvp for now, unfortunately when he tried it he wasn't doing so well and teared up when flamed, I know you guys at riot will do your best to make the environment friendlier than it is. High hopes for the new honor system. Thanks for the acknowledgement!","replies":[]}]},{"poster":"0101010010111010","date":"2017-05-23T10:07:15.667+0000","up_votes":1,"down_votes":0,"body":"I know this isnt a solution for toxicity but here is what i do, for your brother too. Press enter, and drag the chat outside of the screen. and, i did this after i kept accidentaly pressing enter which made me unnable to cast spells cuz i was writing, turn off your enter key in keyboard drivers so you wont accidentaly start writing. It still doesnt solve the problem of the existing toxicity but what people cant see, that doesnt bother them so your brother will be safe from the abuse.","replies":[{"poster":"Nautilus Godilus","date":"2017-05-30T13:24:45.737+0000","up_votes":1,"down_votes":0,"body":"Hey any solution is a good one, for now i'm thinking of just duoing with him until he's comfortable with the environment.","replies":[]}]}]}