{"poster":"rosamaha","date":"2017-09-30T16:00:39.769+0000","title":"Wir suchen neue DIA Spieler für unser Main Team - Team. sharx","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo Community,\r\n\r\nunsere Organisation &quot;Team. sharx&quot; ist derzeit auf der Suche nach einem neuen League of Legends Main Team.\r\nDa wir ein frisches Team zusammenstellen wollen, haben wir uns auf folgende Ideen mit zwei unserer erfahrensten LoL Spielern geeinigt.\r\nWir suchen mindestens 10 Bewerber (2 auf jeder Position) im Bereich Dia V+. Diese 10 Spieler werden dann an bis zu 12 verschiedenen Spieltagen sich gegenseitig ihr k&ouml;nnen unter Beweis stellen. Bei jedem Match mit gemischten Teams um die Spieler mit verschiedensten Mitspielern zu sehen. Pax und Falk (unsere zwei erfahrenen LoL Spieler) werden danach entscheiden wer in ihren Augen am besten zusammenpasst und werden dann mit diesen 5 Spielern ein Team starten. Pax &uuml;bernimmt die Coach Rolle und Falk alles rund um das organisatorische.\r\nWir hoffen euch mit dieser Idee &uuml;berzeugt zu haben, damit ihr uns zeigt was ihr so drauf habt.\r\n\r\nEin paar Worte zur Organisation:\r\n-) seit 2013 in der esport Szene vertreten\r\n-) 4 Manager die alles f&uuml;r euch und die gesamte Orga regeln\r\n-) einige Erfolge an denen wir ankn&uuml;pfen wollen\r\n-) schon ein gewisser Bekanntheitsgrad in der deutschen esport Szene\r\n-) Grundger&uuml;st f&uuml;r eine gro&szlig;e Zukunft (eigenes Logo, Homepage, Sponsoren, Partner, Server etc.)\r\n\r\nWas du erf&uuml;llen m&uuml;sst:\r\n- Teamspeak&sup3;\r\n- Spielerfahrung\r\n- mindestens 16 Jahre alt (Es gibt keine Ausnahmen!)\r\n- eine gewisse geistliche Reife\r\n- Benehmen\r\n\r\nWas wir bieten:\r\n~ Teamspeak&sup3; Server (powered by xeon-hosting.de)\r\n~ Gameserver (powered by xeon-hosting.de)\r\n~ eigenes Logo (volles Recht bei uns)\r\n~ eigene Homepage\r\n~ Sponsoren\r\n~ Partner\r\n~ gutes Clanklima\r\n~ gute Organisation\r\n~ Erfahrung und Erfolge!\r\n~ Eigene Streamer die eure ESL Matches casten\r\n\r\nFalls wir euer Interesse geweckt haben, dann schaut doch noch auf unserer Homepage oder unseren Teamspeak 3 vorbei oder wenn euch der Beitrag hier gereicht hat, dann meldet euch direkt bei uns!\r\n\r\nKontaktinformationen:\r\nEmail: support@teamsharx.de oder info@teamsharx.de\r\nTeamspeak 3 IP: ts.teamsharx.de\r\nHomepage: https://teamsharx.de\r\n\r\nAnsprechperson f&uuml;r euch ist:\r\nMario &quot;Rosamaha&quot; (Leitung/Manager f&uuml;r alle Teams)\r\nSteam: http://steamcommunity.com/id/rosamaha3 \r\nESL: http://play.eslgaming.com/player/8727569/\r\n\r\nSummoner Name (EUW) von unseren zwei erfahrenen LOL Spielern:\r\nFalk: 2vs4botlane falk\r\nPax: Pax Zensur","replies":[]}