{"poster":"159654321","date":"2015-06-30T22:21:44.927+0000","title":"Dauerhaft schlechte Teammates im Ranked","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":10,"body":"Seid einiger Zeit bekomme ich nur noch sehr schlechte Spieler die ab Minute 3 schon 0/3 stehen.Trotz mehrerer Versuche die Leute um Vorsicht zu bitten oder das Game mit einem DouQ Partner zu Carrien. Ihr seht das an dem Screenshot sowas bekomme ich mittlerweile nur noch. Es f&uuml;hlt sich fast so an als wenn das von Riot so gewollt ist.Langsam nervt es Total 3 Monate in der selben Division rumzugammeln wegen solchen Leuten. \n\nVilleicht kennt jemand Abhilfe denn so langsam habe ich keine Lust mehr auf sowas\n\nhttp://fs1.directupload.net/images/150701/ph6qmok8.jpg","replies":[{"poster":"M4UR1C31234","date":"2015-07-01T05:13:53.400+0000","up_votes":3,"down_votes":0,"body":"QQQ \n\nhttp://boards.euw.leagueoflegends.com/de/c/streams-youtube/d8WL05oy-ein-lied-woran-ich-immer-denken-muss-wenn-ich-hier-die-feeder-etc-threads-lese\n\nMit Freundlichen Grüßen","replies":[]},{"poster":"tortenmaker","date":"2015-06-30T22:47:15.054+0000","up_votes":2,"down_votes":3,"body":"Brauchst du ein Taschentuch? q.q","replies":[{"poster":"159654321","date":"2015-07-01T02:17:45.543+0000","up_votes":1,"down_votes":8,"body":"Sehr hilfreich. Lass mich raten 16 und Hauptberuflich Flamer?","replies":[{"poster":"M4UR1C31234","date":"2015-07-01T05:21:05.493+0000","up_votes":3,"down_votes":0,"body":"Du flamest doch gerade hier undzar deine Teammates aber deinen 0/6/1 Volibär oder deinen 1/4/3 Corki sowie deinen 2/9/1 Graves, deine 2/4/5 Rekasi, 5/8/5 Gragas, 0/5/6 Allisstar, 2/8/7 Leona,2/4/2 Leona und 0/5/6 Nautilus scheinst du alles zu übersehen ... Such erstmal die Fehler bei dir selbst bevor du sie bei anderen suchst. \n\nBTW: Ein paar der Spiele hast du dank deiner \"schlechten\" Teammates trotzdem gewonnen.\n\nMit Freundlichen Grüßen","replies":[{"poster":"159654321","date":"2015-07-02T14:03:05.225+0000","up_votes":1,"down_votes":4,"body":"Rate mal wie die Stats zusammen gekommen sind. Ich geb dir mal n Hinweis 2 Lanes gefeedet 5 man Botlane Ganks Dauerhaft. Und was ist bitte an meinen Late Game Support Stats verkehrt? 5 mal als Support zu Sterben ist nach 40 min Völlig OK wenn man dadurch anderen den Arsch gerettet hat oder den ganzen Schaden auf sich genommen hat.","replies":[{"poster":"M4UR1C31234","date":"2015-07-02T15:39:14.742+0000","up_votes":3,"down_votes":0,"body":"Es ist die Kill beteiligung im zusammenhang mit den Toden. Wenn du 5 stirbst ok wenn du dafür aber dann nur 6 assist hast meehh. Mir wurde beigebracht das man nur ein gutes Spiel als Support beigebracht hat wenn der nutzen an Kills minimum 1,5 x so hoch war wie die Tode das heißt bei 5 Toden  8 Assist. Finde es auch lustig wie du beschreibst das JEDES SPIEL alle  anderen Lanes verlieren und nur Botlane gegankt wird. Komisch wie du dann die Spiele teilweise gewinnst die die Botlane verliert? Bestes Beispiel das 0/5/6 Allistar Game ok Lucian stand 6/0/3 aber nach deinen angaben gewinnst ja nur du die Lane o.o was ist das? Ein 11/3/4 Gangplank und ein ganz ok stehender 4/3/5 Warwick? Wie kann das denn sein wenn ja alle ihre Lane verloren haben und alle nur feeden etc? Und in deinem neusten Game sind alle Lanes relativ even gewesen nur Nidalee stach groß hervor mit 7/1/3 (Das sind nur Beispiele die ich jetzt mal in 1 Min rausgesucht habe). Ich finde es lustig wie Leute nur die negativen Eigenschaften eines Spiels sehen und immer alles auf andere schieben. Ich zeige dir mal was aus meiner Match History: http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2097187323/205060106?tab=overview ich bitte dich hierbei auf die Stats des Gegnerischen Tryndamere sowie des Verbündeten Yi und Xin Zhao zu achten. Hier siehst du womit man in dem Bereich klarkommen muss wo ich Spiele  absoluter Feed ein 40 Kills Tryndamere der Minute 25 auf die Midlane runterkommt und für jeden (ausser mir) unkillbar geworden ist. Und jetzt frag dich mal wieso ich keinen QQ Thread aufmache.\n\nBTW: Hier mal ein schönes Video: http://boards.euw.leagueoflegends.com/de/c/streams-youtube/d8WL05oy-ein-lied-woran-ich-immer-denken-muss-wenn-ich-hier-die-feeder-etc-threads-lese\n\nMit Freundlichen Grüßen","replies":[{"poster":"159654321","date":"2015-07-02T16:30:02.510+0000","up_votes":1,"down_votes":1,"body":"Haste recht mit der Beteiligung funktioniert aber auch nur wenn die Leute nicht gesnackt werden und ich versuche sie zu Retten. Die Games die du aufgezählt hast sind nach nem halben Jahr ne 5 Winning Streak. Ich kann mich als Support auch einfach aus allem Raushalten und die Leute Sterben lassen dann hab ich auch keine Tode aber das bringt noch weniger. Mir gehts auch nicht ums dauerhaft Gewinnen aber meine Ursprüngliche Frage war ja auch ne andere. Mir reicht das schon einfach nicht nach 3 min 5/0 fürs Gegner Team zu haben. Ich hab sicherlich auch gute Leute aber das ist leider eher selten. Und solange ich Sterbe und mein Carry dadurch 6/0 steht und der gegnerische nicht ist es absolut worth auch wenn ich kein Assist mehr bekomme. Und es ist auch kein Heulthread ich wollte nur Tipps und Hinweise wie man son Scheiss vermeiden kann. Stattdessen kommen hier die \"braven\" Jungs der Liga meinen das ich nur Flame weil ich einmal Vollidioten nicht mal im Spiel gesagt habe und absolut nichts Konstruktives bis jetzt rumgekommen ist.","replies":[{"poster":"M4UR1C31234","date":"2015-07-02T16:54:39.073+0000","up_votes":1,"down_votes":0,"body":"Also willst du sozusagen nen Cheat code wie du nur gute Leute bekommst? Du willst etwas beeinflussen was zufällig von statten geht und nicht beeinflusbar ist? Das einzige was du tun kannst ist Nett ingame zu sein und zu hoffen das die Spieler gut spielen mehr geht nicht. Es gibt keinen \"Cheat code\" oder ähnliches wie z.B. bei Grand Theft Auto oder sonstigen spielen. Nur kann es sein das die Spieler schlechter spielen wenn sie geflamed werden weshalb ein positives Verhalten hilfreich sein kann. (Hierbei ist zu beachten das ich dein Ingame Verhalten nicht kenne). \n\nPS: Es gibt auch noch die Option die Position die du spielst in die Midlane oder den Jungle umzuändern, da du von diesen beiden Lanes Einfluss auf jede einzelne Lane hast, hierbei könntest du dann Champs wie z.B. Ahri und Katarina für die Midlane (Recht Mobil gutes Roamverhalten) oder eben einen beliebigen early-early midgame Jungler spielen. (Dies ist jedoch nur ein Vorschlag meinerseits).\n\nMit Freundlichen Grüßen","replies":[{"poster":"159654321","date":"2015-07-02T17:57:52.901+0000","up_votes":1,"down_votes":1,"body":"Nein kein Cheat Code dann bräuchte ich nicht spielen. Eher Tipps bzw Leute die einfach \"Normal\" spielen","replies":[]}]}]}]}]}]},{"poster":"tortenmaker","date":"2015-07-01T09:43:19.536+0000","up_votes":2,"down_votes":0,"body":"Wieso kannst du deine eigene Medizin nicht ab? Du Flamste deine Teammates das sie schlecht spielen und beschwerst dich nun wenn jemand dir ein Taschentuch reichen mag?\n\nÜberleg doch einfach mal was du so falsch machst und mit ein wenig selbstrefelktion würdest du sehen das du genauso Spielst wenn nicht soger schlechter! Du ziehst deine Teammates warscheinlich moralisch runter und fängst an mit stop feed or XY oder sonst was. Also befor du dich hier im Forum über deine Teammates beschwerst fang erstmal an deine eigenen Fehler zu beachten.\n\nAch übrigenens nicht 16 und auch nicht Flamer sondern probiere es einfach mal mit 22 und Hauptberuflich Berufssoldat!","replies":[{"poster":"159654321","date":"2015-07-02T13:52:16.140+0000","up_votes":1,"down_votes":4,"body":"Ich ziehe niemanden mit runter ich flame auch ingame nicht. Finds nur wieder Spannend das Leute auf meine Stats gucken und meinen das ich genauso Schuld bin wie die anderen. Aber ratet mal wie die Stats zusammen kommen wenn alle Gegner 6/0 stehen. Und dieses möchtegern Moral Apostel die hier meinen das man jedes Game mit anfeuern der Teammates gewinnt ist schwachsinn.","replies":[{"poster":"tortenmaker","date":"2015-07-02T15:42:11.423+0000","up_votes":1,"down_votes":0,"body":"Nicht jedes aber viele. Ob du es glauben magst oder nicht. \nUnd nur so zur info ich schaue mir deine Stats nicht an weil sie hier einfach egal sind. Es geht um deinen benhemen mit deinen Mitmenschen. Auch wenn es über das Internet ist, kann man andere Menschen die vor den Monitoren sitzen damit verletzen. Du weiß sicherlich was Cybermobbing ist? Du machst nichts anderes wenn du Menschen beleidigst.. Also denk vielleicht mal drüber nach bevor du jemanden beleidgst. Du gehst ja schließlich auch nicht zu einen X beliebigen Menschen hin und beleidigst ihn nur weil er dich anspricht! Zumindestens hoffe ich das du es nicht tuts.","replies":[]}]},{"poster":"LanceVanceDancé","date":"2015-07-02T13:58:35.246+0000","up_votes":1,"down_votes":5,"body":"siehe oben!","replies":[]}]}]}]},{"poster":"i had fun once","date":"2015-07-01T11:14:21.180+0000","up_votes":2,"down_votes":0,"body":"Wenn man über eine größere Anzahl an Spielen (sagen wir mal 30) immer noch in der selben Elo ist und bisl plus/minus macht dann hat man seinen Skill vielleicht mal erreicht? Jetzt musst du anfangen deine Fehler auszubügeln.\n\nIch hatte gestern zb ein Game gegen einen Dia1, hab zwar nicht hart verkackt oder reingefeeded in der lane, aber im punkto farm und lane pressure bin ich gnadenlos untergegangen. Aber nun weiß ich, was ich besser machen kann, um in der Elo zu steigen.","replies":[{"poster":"159654321","date":"2015-07-02T13:59:19.599+0000","up_votes":1,"down_votes":4,"body":"Nope Skill Lvl Definitiv noch nicht erreicht ich zerreiße auch Platin Leute teilweise. Mit nem halbwegs gescheiten ADC gewinne ich die Botlane zu 80%. Sicherlich mache ich auch noch Fehler davon mal ab bin ich niemals Silber 2. Es ist einfach nur unmöglich 2 Lanes zu ersetzen die Permanent Tod sind.","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-02T14:11:25.700+0000","up_votes":3,"down_votes":0,"body":"Du weißt aber schon das die Laningphase im Vergleich zum restlichen Game so ziemlich das unwichtigste ist? Das Decisionmaking im Mid- und Lategame ist viel wichtiger. Mag sein das du in der Laningphase gut bist, aber falsche Entscheidungen danach triffst.\n\nUnd nur weil du Platin Leute zerreißt heist das nichts. Wenn du damit 1 on 1 meinst bedeutet das schonmal überhaupt garnichts, denn 1 on 1 haben in LoL gar keine Aussagekraft. Wenn du als Full Silver gegen ein Full Platin Team öfter gewinnst, dann hätte das vielleicht Aussagekraft.","replies":[{"poster":"LanceVanceDancé","date":"2015-07-02T15:23:07.106+0000","up_votes":1,"down_votes":4,"body":"Schon wieder unsinn! du kannst doch nicht ihn allein fürs decisionmaking im late verantwortlich machen.","replies":[]}]},{"poster":"Avorox","date":"2015-07-12T19:48:41.580+0000","up_votes":1,"down_votes":1,"body":"Ja sicher, deswegen hab ich als Platinspieler auch meinen Smurf mit weniger als 20 Spielen bis in Gold gespielt. Nur weil du mal nen Normalgame gegen einen Platinspieler gewinnst, heißt das nicht dass du auf Platinniveau spielst. Zahlreiche Leute machen es vor, sie erreichen auch mit neuen Accounts in kürzester Zeit wieder ihre Elo, wie sollten sie das schaffen wenn man die Teams nicht carrien kann? Da jeder Spieler mit zufälligen Leuten spielt hast du erstmal die gleichen Voraussetzungen wie jeder andere auch. Wenn du es also nicht schaffst aufzusteigen, bist du schlichtweg nicht gut genug.","replies":[]}]}]},{"poster":"Ashuna","date":"2015-07-01T09:33:54.639+0000","up_votes":1,"down_votes":0,"body":"Ich hasse solche leute die nur auf Stats schauen. Natürlich erschwert das das Spiel wenn jemand 0 8 2 steht zum Beispiel. Aber das heisst nicht das die Person das extra macht. Schau erstmal auf dich selber bevor du andere Spieler (wegen einem schlechten Spiel) nieder prangerst.\n\ngruß Ashuna {{champion:1}}","replies":[{"poster":"159654321","date":"2015-07-02T13:54:28.696+0000","up_votes":1,"down_votes":2,"body":"Ich hab auch nichts dagegen das man mal feedet aber es kann nicht sein das sowas dauerhaft passiert.","replies":[{"poster":"Ashuna","date":"2015-07-03T05:51:12.521+0000","up_votes":2,"down_votes":0,"body":"Dann musst du dich in deiner Spielweise so bessern das du deinem Team mehr Hilfst; Roamen, Ganken, Callen etc. Teams wo alle Lanes mal verlieren gibts immer (du gewinnst auch nicht immer). Einen solchen Post wie du erstellt hast kann hier eigentlich jeder machen, sry ist aber so. Du solltest dich darüber nicht aufregen und weiter zocken. Verbesser dich und führe DU dein Team zum Sieg! Man selber ist der entscheidende Faktor nicht die anderen. Das du seit drei Monaten in der gleichen Division \"hängst\" ist, tut mir leid, nicht die Schuld deiner Teams. Ich habe auch schon oft Loosing streaks gehabt/ habe aber dementsprechend auch win Streaks (Siehe Lolking). Einfach nicht aufregen/ Konzentrieren/ sich SELBST Verbessern/ einfach weiter Zocken/ nicht Flamen und sein Team Unterstützen und schon steigst du auf!\n\nmfg Ashuna {{champion:1}}\n\n\nhttp://www.lolking.net/summoner/euw/22508581 (Meine Übersicht/ die Statistik unten zeigt es sehr gut mit den Win/ Loosing Streaks; Lass ich mich davon abkriegen Dia zu kommen? Nein! Ich versuche MICH zu verbessern und Zocke weiter!)\n","replies":[{"poster":"159654321","date":"2015-07-12T19:35:36.029+0000","up_votes":1,"down_votes":1,"body":"Es zieht einen nur so runter das man irgendwann selber miserabel spielt und sich nur noch aufregt. Denk mal das is mein Problem. \nNach 3 Looses sollte man lieber aufhören sonst Raged man sich nur noch mehr rein.Trotzdem muss ich sagen das es entweder Stomps sind oder harte looses. Selten gibt es even Matchups das find ich n bisschen schade. Und ich bin definitiv nicht Silber wenn ich mit meinen Kollegen spiele meinen die auch das ich deutlich besser bin. Und man kann nicht immer alle Ganken und grade als Support eher schwierig. Die Tode in meiner Statistik kommen nicht von der Lane sondern meisten von Teamfights bei denen der Drops schon gelutscht ist weil die meisten Lanes verloren sind bevor Minute 15.","replies":[]}]}]},{"poster":"LanceVanceDancé","date":"2015-07-02T14:02:57.776+0000","up_votes":1,"down_votes":5,"body":"auch zu dir, (sry, aber ich lese diesen thread und ärgere mich), wenn ein teammate mal verliert auf der lane, ok! - kein ding, dass passiert. \naber in dem bild stehen 3 leute mit nichts und 8 toden dar. \"guck nicht auf die stats\" ist absoluter schwachsinn.\nman kann ein game auch von hinten gewinnen und mit jemanden der 0 20 seht, aber das da oben ist doch ein klarer indikator wie das game läuft!","replies":[{"poster":"Ashuna","date":"2015-07-03T05:46:28.981+0000","up_votes":2,"down_votes":0,"body":"Es ist normal das Mindestens eine bis zwei lanes verlieren. Die meisten Spielentscheidungen kommen im Mid/Lategame; das early ist nicht so extremst wichtig. Ab und an Passiert es einfach das alle lanes verlieren (Die Gegner waren einfach besser!). Und siehs doch so, wenn ihr alle Lanes gewinnen würdet; würde sich jemand beim Gegnerteam beschweren das sein Team schlecht ist (alle 0 8 0 zum Beispiel). Würde jeder seine Lane gewinnen; wäre das Spiel unspielbar. Solche Postst kann jeder erstellen, die sind nicht sehr aussagekräftig. \n\nmfg Ashuna {{champion:1}}","replies":[]}]}]},{"poster":"e621 Rengar","date":"2015-07-01T00:48:24.258+0000","up_votes":2,"down_votes":1,"body":"Und jetz erzähl uns mal was wir gegen ein System machen sollen wo wir keinen zugriff haben ^^?","replies":[{"poster":"159654321","date":"2015-07-01T02:17:14.768+0000","up_votes":2,"down_votes":7,"body":"Ich finds einfach nur lächerlich das manche ne 10er Winning Streak haben weil sie keine Vollidioten bekommen und manche einfach keine Chance haben aufzusteigen weil man die meiste Zeit mit solchen bobs zusammen spielen muss.","replies":[{"poster":"tortenmaker","date":"2015-07-01T09:44:25.695+0000","up_votes":3,"down_votes":0,"body":"Und hier beleidigst du auch noch deine Mitspieler als Vollidioten! Vielleicht haben andere Leute 10 Winningstreaks weil sie wissen wie sie ihren Teammates helfen und aufbauen anstatt sie fertig zu machen?","replies":[{"poster":"LanceVanceDancé","date":"2015-07-02T13:58:48.971+0000","up_votes":2,"down_votes":5,"body":"Tut mir leid tortenmaker, aber für solche aussagen habe ich nur bedingt verständnis. \nja, natürlich soll man seine teammates aufbauen, aber ich habe auch jeden tag mindestens einen der \nmit voller absicht scheiße baut (heute z.b. olaf jungle, der absichtlich in tower läuft, weil shaco ihn getötet hat).\nes gibt zu viele hater in der community, sicher, aber trolls zerstören einem echt die elo!\nich kann seinen zorn verstehen (wenn er nicht hated im game), den den ghandi zu machen um leute die ABSICHTLICH\nfeeden auch noch aufzubauen.. ne, echt nicht","replies":[{"poster":"tortenmaker","date":"2015-07-02T15:38:40.634+0000","up_votes":2,"down_votes":0,"body":"Der TE ist allerdings definitiv ein Spieler der offensichlich hart am flamen ist. Ichg meiner wenn er auch hier im Forum andere Leute bleidigt, wie glaubst du benimmt er sich ingame wenn andere mitspieler Schlecht sind, in einen Tower rennen, usw?\n\nZudem klar sowas gibt es immer wieder aber nicht so oft hintereinander. Dann mutete man ihn und reportet am ende das war es. Es geht mir in desem TE auch nur darum das er sich ziehmlich daneben benimmt und Leute beleidigt. Sowas geht garnicht!","replies":[{"poster":"159654321","date":"2015-07-02T16:32:55.923+0000","up_votes":1,"down_votes":5,"body":"Woraus schließt du das? Die Leute die ich mit Vollidioten meine sind Geschwärzt und sind es meiner Meinung nach auch Ingame.Damit habe ich niemanden persönlich beleidigt und das einzige was du kannst war der erste Beitrag mit der Provokation auf die ich nur geantwortet hat. Wenn du austeilst steck halt auch ein oder lass es gleich.","replies":[{"poster":"tortenmaker","date":"2015-07-02T17:17:13.724+0000","up_votes":2,"down_votes":0,"body":"Ich schließe es aus deiner Wortwahl die du hier im Forum an den Tag legst.Ich darf ja sicherlich zitieren?\nIch nehme mir mal die freiheit was ich meine extra zu kennzeichnen.\n\n>Ich finds einfach nur lächerlich das manche ne 10er Winning Streak haben weil sie keine **Vollidioten ** bekommen und manche einfach keine Chance haben aufzusteigen weil man die meiste Zeit mit solchen **bobs ** zusammen spielen muss.\n\nDie dick makierten sind also keine Beleidigungen ja? Nur weil du Namen unkentlich machst, was du hier im Forum sowieso machen musst, heißt es nicht das du sie damit nicht beleidigst. Da sie sich daher nicht wehren können wenn du sie beldigst tue ich es halt!\n\n> Sehr hilfreich. Lass mich raten 16 und Hauptberuflich Flamer?\n\nOk mag sein das ich dich damit Provoziert habe, das heißt jedoch noch lange nicht das du Antworten musst. Nein im gegenteil deine Antwort geht ehr in die Richtung Beleidigung.\nDu Fühlst dich sofort angegriffen! Daraus kann man schließen das du definitiv etwas flasch gemcht hast. * hust* Beleidigt ? *hust*  Sosnt hättest du es ja einfach ignorieren können tatest du jedoch nicht sondern fängst eine Diskussion an, in der du dich mittlerweile Verteidigst. Nun gut gehe ich zum nächsten Kommentar von dir:\n\n> Haste recht mit der Beteiligung funktioniert aber auch nur wenn die Leute nicht gesnackt werden und ich versuche sie zu Retten. Die Games die du aufgezählt hast sind nach nem halben Jahr ne 5 Winning Streak. Ich kann mich als Support auch einfach aus allem Raushalten und die Leute Sterben lassen dann hab ich auch keine Tode aber das bringt noch weniger. Mir gehts auch nicht ums dauerhaft Gewinnen aber meine Ursprüngliche Frage war ja auch ne andere. Mir reicht das schon einfach nicht nach 3 min 5/0 fürs Gegner Team zu haben. Ich hab sicherlich auch gute Leute aber das ist leider eher selten. Und solange ich Sterbe und mein Carry dadurch 6/0 steht und der gegnerische nicht ist es absolut worth auch wenn ich kein Assist mehr bekomme. Und es ist auch kein Heulthread ich wollte nur Tipps und Hinweise wie man son Scheiss vermeiden kann. Stattdessen kommen hier die \"braven\" Jungs der Liga meinen das ich nur Flame weil ich einmal **Vollidioten** nicht mal im Spiel gesagt habe und absolut nichts Konstruktives bis jetzt rumgekommen ist.\n\nDa ahst du deine Belidigung erneut erwähnt. Und warum genau um dich zu Verteidigen und dir Leute zu suchen die auf deiner Seite sind.\n\n\n\nAber ich bin noch nichgt fertig. Zwar mit dem Zitieren jedoch nicht mit dem Beitrag. Anstatt dich zu Beschweren das du nur \" Scheiß - Teams\" bekommst und du fast nur troller schon alleine im Champ select hast, überleg doch mal genauer nach. Du hast die selbe MMR wie deine Teammates. Das beudeutet das du genauso spielst wie sie. Jeder hat mal einen Schlechten Tag auch du. Hab daher ein wenig nachsicht.\nZu den Trollern: Du darfst spielen was du willst und machen was du willst. Du darfst auch jeden Beschwörerzauber benutzen. Das ist alles egal hauptsache du probierst zu gewinnen. Sonst wenn sie nicht probieren zu Gewinnen reporte sie. Feritg ist das alles.\nIn deinem Team wenn du vernünftig spielst hast du 20% weniger chanche als dein Gegnerteam einen \"Troller\", afk`ler oder Feeder im Team haben..\n\nUnd als letzte Antwort für dein Beitrag Nein du kannst nichts dagegen machen, ausser selber besser zu spielen um deine MMR zu erhöhen um bessere Spieler in deinem und dann auch im Gegner team zu haben.","replies":[{"poster":"159654321","date":"2015-07-02T17:57:07.355+0000","up_votes":1,"down_votes":1,"body":"Zu 1. Ich bleib dabei für mich ist das aus meiner Sicht mit absicht. wenn man  mal keine chance hat um hilfe fragen passiv spielen und alles wäre gut. Selbst wenn das nicht klappt OK Gegner sind besser passiert nunmal. Aber einfach nur nacheinander aufn Sack bekommen und Ingame nicht mit dem Team zu Interagieren is für mich nicht Akzeptabel.\n\n2. Brauch ich nichts zu sagen tut beides nicht Not \n\n3. Habe ich mich selber Zitiert \n\n4. Nehm dir mal n Beispiel an M4UR1C31234  sowas nennt man hilfreich.","replies":[{"poster":"tortenmaker","date":"2015-07-02T18:45:08.824+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich? Ich glaube es macht einfach keinen sinn mit dir zu reden da du eh nur aktzeptieren wirst was du hören willst. Ich sehe bei dir keinerlei einsicht. Daher belasse ich es jetzt dabei und verschwende nicht noch mehr Energie für jemanden der sich eh nicht ändern wird und kein bisschen einsicht zeigt, was deine Fehler betrifft.","replies":[]}]}]}]}]}]},{"poster":"159654321","date":"2015-07-02T13:56:47.734+0000","up_votes":1,"down_votes":5,"body":"Ja in dem Fall waren sie es auch. Und du glaubst ernsthaft wenn ich diese Leute noch aufgemuntert hätte das sie das Ding noch reißen bzw dauerhafte 1v3 Aktionen lasse? Ich schreib mit den Leuten nicht mal weil mir das geflame selber zu blöd ist. Aber ich kann das langsam nicht mehr Akzeptieren jedesmal allein schon in der Pickphase getrollt zu werden.","replies":[]}]}]}]},{"poster":"MrMausLP","date":"2018-01-22T17:19:30.085+0000","up_votes":1,"down_votes":0,"body":"habe permenent den selben scheiss und echt kein bock auf dieses drecks game in den letzten 4 tagen 4 ranked games und alle verloren und alles scheiss teams NUR NOCH SCHEISS TEAms ich bin ehct kurz davor das spiel zu deinstallieren","replies":[]},{"poster":"IR0LEIN","date":"2017-04-30T16:19:12.375+0000","up_votes":1,"down_votes":0,"body":"mach dir 4 accs und gehe in ein match und spiele 1v5","replies":[]}]}