{"poster":"Suntv","date":"2016-12-11T22:44:20.754+0000","title":"Everyone Having Reconnect Issues/Bugsplat","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"My problem started today. I recently had an update right before I logged off of my computer last night. It was:\r\n\r\n\"Cumulative Update for Windows 10 Version 1607 for x64-based Systems (KB3201845)\"\r\n\r\nMaybe this could be the cause of our problems? If youre having this problem and recently updated your windows to this version, please say so.\r\n\r\n\r\nHow to check:\r\n\r\n1. Click Windows Start\r\n2. Settings\r\n3. Update &amp; Security\r\n4. Update History","replies":[{"poster":"Targons Blade","date":"2016-12-12T02:33:42.691+0000","up_votes":1,"down_votes":0,"body":"We've seen some issues in the past where Windows updates caused some player's displays to be set at a resolution that it cannot truly run, but I haven't seen any of these issues recently.\n\nCan you confirm exactly what you're experiencing so I can assist you?","replies":[{"poster":"Suntv","date":"2016-12-12T02:37:02.186+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=J8Qujn3v,comment-id=0000,timestamp=2016-12-12T02:33:42.691+0000)\n>\n> We&#x27;ve seen some issues in the past where Windows updates caused some player&#x27;s displays to be set at a resolution that it cannot truly run, but I haven&#x27;t seen any of these issues recently.\n> \n> Can you confirm exactly what you&#x27;re experiencing so I can assist you?\n\nThis is also from another post I made:\n\nI have ZERO idea whats wrong. I ran a full fix and the problem still consists. Everything is fine up until I load into the game. When it starts it goes to the black screen right before the loading screen pops up but there is a portion of my desktop showing the the right of my screen from the top of my computer to the bottom. It then goes straight to bugsplat and it asks me to send an error report. I cannot go into games at all. I even switched to the legacy client and the same thing happens.","replies":[{"poster":"Targons Blade","date":"2016-12-12T21:38:52.345+0000","up_votes":1,"down_votes":0,"body":"Ah, I realize now that you had made 3 posts for the same type of issue. That would make sense why this sounded so familiar. So your resolution is 1680x1050, which is pretty strange for most displays. Since this is most likely caused by a display driver issue, I'd like you to work through our [**FPS Guide**](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) to ensure all your display settings are in good standing.\n\nLet me know if these steps caused any change in either screenshots or your ability to get in-game. I also recommend you test changes in a custom match to avoid any sort of Leaverbuster actions.","replies":[]}]},{"poster":"Suntv","date":"2016-12-12T02:36:12.839+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=J8Qujn3v,comment-id=0000,timestamp=2016-12-12T02:33:42.691+0000)\n>\n> We&#x27;ve seen some issues in the past where Windows updates caused some player&#x27;s displays to be set at a resolution that it cannot truly run, but I haven&#x27;t seen any of these issues recently.\n> \n> Can you confirm exactly what you&#x27;re experiencing so I can assist you?\n\n1. League of Legends Logo Pops up\n2. Goes to black screen (pre loading screen) although there is a portion of my desktop showing from the top to bottom of the monitor to the right\n3. Immediate Bugsplat\n4. Hit reconnect\n5. Goes to black screen (pre loading screen) although there is a portion of my desktop showing from the top to bottom of the  monitor to the right\n7. Immediate Bug splat","replies":[]}]},{"poster":"Suntv","date":"2016-12-12T02:38:28.555+0000","up_votes":1,"down_votes":0,"body":"I have ran all of your troubleshooting steps\nI even went as far as to factory reset my computer. Same stuff is happening\nMy drivers are up to date\nI have the latest version of windows 10\nI was literally playing last night.","replies":[]}]}