{"poster":"Suntv","date":"2016-12-03T23:45:29.285+0000","title":"Getting Direct Denial of Service in Game (DDOS)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Okay so I was just in a game. I was perfect all game and then when my team started getting ahead of the enemy team, I was getting targeted by what I believe was a DDOS.\r\n\r\nPing: 57 ms\r\nFps: 120-150\r\n\r\n\r\nWhen the DDOS started happening, I started freezing with everyone moving around me fine. I got the attempting to reconnect sign and I wasnt able to do anything. Couldn't tab out for a while until I finally did and restarted the client. \r\n\r\nWhen I first was targeted, My team had just lost a fight and we had an open inhib. The enemy nasus walked right past me and my champion auto attacked him because he was close. He didnt even try to fight me. He walked right past me to head to the inhib. A nasus can melt me so quick especially late game so that was highly suspect.  Ok so I restarted my client. Came back in and everything was fine. We started the last team fight and then thats when I was hit again.\r\n\r\nMy team was ramsacking them by themselves so I didnt get fully disconnected. I was able to reconnect and go into the fight. Everyone on the enemy team died. We proceeded to kill the enemy ashe and I said,\r\n\r\nMe: nice ddos\r\nAshe: lol\r\n\r\n\r\nThis all took place in Solo/Duo Ranked. After the victory screen went by, instead of going straight to the post game screen where I could report, I went straight to my desktop and the client closed on its own. So I was not able to send out reports on the suspects. Please someone help me. I have my last game on na.op.gg so I can pull up the whole team and send names. Will riot investigate these people? I'm pretty sure if this was a ddos and they followed the same procedures as they did with me, they have never been reported successfully so they will not have any leads against them.","replies":[{"poster":"Targons Blade","date":"2016-12-06T05:55:35.919+0000","up_votes":1,"down_votes":0,"body":"It's **extremely unlikely** that this was [**DDoS**](https://en.wikipedia.org/wiki/Denial-of-service_attack). If it were, your *entire home network* would have gone down and you likely wouldn't have been connected to the match until it was over. This sounds more like a *really bad time* for an unstable connection to the gameservers to occur. The symptoms you described are very common for *Packet Loss* or *Extreme Packet Buffering* situations, so if this happens again,  we can work on steps to troubleshoot the direct cause of these issues.\n\nLet me know if you have any questions.","replies":[]}]}