{"poster":"deer94killer","date":"2015-11-30T12:16:42.301+0000","title":"rune per support","subforum":"Discussioni generali","up_votes":2,"down_votes":3,"body":"mi serirebbe un consiglio per delle rune visto che gioco spesso supp secondo voi quali rune sono meglio per i supp tank?\r\ngrazie per l&#039; aiuto","replies":[{"poster":"Ucr0niA","date":"2015-11-30T12:18:12.264+0000","up_votes":1,"down_votes":0,"body":"9 Marchi Armor\n3 Quint Armor\n9 Sigilli Hp flat\n9 Gilfi MR","replies":[{"poster":"Elle C","date":"2015-11-30T12:25:27.082+0000","up_votes":2,"down_votes":0,"body":"Possono essere migliorate :) io ti consiglio tre quinte armor nove sigilli flat hp nove marchi armor e glifi cdr a seconda della build che fai... Vanno bene sia flat che scaling dipende quanto cdr ti manca per arrivare a quaranta con la full build... Se rimangono spazi scaling mr per riempire i glifi... Poi dipende... Che Support di preciso? Perché thresh ha una pagina diversa... Anche alistar e braum hanno delle pagine specifiche :) questa standard può andare bene per leona","replies":[{"poster":"Ucr0niA","date":"2015-11-30T12:28:15.858+0000","up_votes":1,"down_votes":0,"body":"Gli scaling HP li uso su {{champion:223}} \ni flat su {{champion:201}} \nLa cdr in caso volessi un 10% a fine partita faccio 3 sui gilfi e una sulle quint (entrambe scalign ovviamente).\n\n\nQuanto al resto, Elle navigando da parecchio il forum so che chi chiede UNA pagina specifica per ruolo o che, generalmente ne desidera 1 sola effettivamente e 1 ne metterà a disposizione, quindi tengo a freno la tentazione di dire come vorrei\n\"Dipende dal champ\"\nE cerco in tali casi oramai di dare una soluzione grossomodo applicabile.","replies":[{"poster":"Elle C","date":"2015-11-30T12:53:21.671+0000","up_votes":1,"down_votes":0,"body":"Vero ma magari lui gioca un solo Support o forse due forse perché li maina o forse per coprire il ruolo quindi se così fosse beneficerebbe di più da una pagina più specifica per quel champ ma che in fondo è applicabile efficacemente anche ad altri quindi credo che ne valga ancora la pena non si sa mai :) per il cdr scaling conviene sulle blu perché essendo le quinte le più efficienti conviene lasciarle alle statistiche più importanti dei Champion quindi nel caso dei Support tank armor e vita... E in più L mr in lane non ti è di grande utilità considerato che il sup avversario anche se fosse ap tenderà a pokare L adc non te... Le scaling Mr possono essere utili ma dato il meta che si prospetta per la prossima season penso che il cdr sia considerevolmente più efficiente in termini di snowball... Inoltre per braum per esempio io tengo due quinte armor e una hp... Questo perché la q scala con la percentuale di vita il che mi permette di fare trade migliori e di avere comunque una buona quantità di armor","replies":[{"poster":"Ucr0niA","date":"2015-11-30T14:00:55.034+0000","up_votes":1,"down_votes":0,"body":"Mi permetto di correggerti, nel punto riguardante le quints, nel definirle come delegate alle statistiche più importanti si fa un ragionamento sbagliato nel suo semplicismo, incorrendo così in errori di scelte non motivate da un riscontro matematico che penalizzano rispetto a opzioni avvalorate da dati.\n\nEstendendo il discorso alle rune in genere per poi tornare nello specifico;\nC'è un motivo per cui abbiamo designato Armor sui Marchi, HP (Flat o scaling che sia) sui sigilli e MR (Anche qui flat/Scaling) sui gilfi. Poichè infatti, notiamo facilmente che confrontando i valori delle relative statistiche che le varie rune a modo loro attribuiscono, questa distribuzione e questa scelta è quella che ci fa i risultati migliori nel complesso.\n\nSi può generalizzare dicendo che:\n-Marchi\nPrediligono stats offensive: atk, AS, pen\n\n-Sigilli\nPrediligono stats difensive: Armor, Hp, Hp reg\n\n-Gilfi\nPrediligono stats legate alla magia: Ap, Mr, Mana reg.\n\nQueste tipologie di rune si presentano in numero di 9 per categoria, mentre le quintessenze, generalmente ben più \"pesanti\" numericamente parlando ai sensi delle statistiche, si trovano in numero di 3.\nIn media infatti, si potrebbe (Sebbene in maniera grossolana) dire che le Quints pesano genericamente 3 volte il loro equivalente su di altre rune, o meglio, su quelle rune su cui tale valore era più efficace  (attenendoci alla sovrastante tabella).\n\nCiononostante, come detto, tale discorso è grossolano, difatti nella realtà i valori sono diversi, ed esistono corrispettivi penalizzati, e altri invece incredibilemnte buffati.\n\nEs (negativo);\nL'armor pen sulle quints, è poco più del doppio di quanto da un marchio\n0.72/1.42\n\nEs (positivo)\nHp flat sui sigilli vale 8.\nSulle quints però non vale 24 ma bensì 26.\nQuindi più di 3 volte.\n\n\nForse il caso migliore è proprio Armor;\nLe rune (escluso quints) migliori per l'armor sono i sigilli, su cui l'armor data è 1\nSulle quints però vale ben 4.26!\n\n\nBisogna quindi ragionare per confronto e in modo percentuale.\n\nFonti:\nhttp://leagueoflegends.wikia.com/wiki/Rune\nQui spiega quali sono i valori migliori per le varie rune\n\nhttp://leagueoflegends.wikia.com/wiki/List_of_runes#Health\nQuesta è la lista delle rune e dei valori.","replies":[{"poster":"Elle C","date":"2015-11-30T15:34:22.494+0000","up_votes":1,"down_votes":0,"body":"Questo è vero ma quasi tutte le caratteristiche principali ovvero ap armor e hp eccetto L attack damage hanno delle quinte associate con efficienza pari o superiore a tre volte i loro corrispettivi e per questo si tende ad associare ad esse la stats principali... Ora andando a considerare ciò che il giocatore potrebbe voler ottenere dalle sue rune possiamo analizzare le varie combinazioni... Diciamo che si voglia ottenere una pagina per un ap con cdr a questo punto è evidente che la caratteristica principale risulta essere L ap e nonostante anche il cdr abbia le quintessenze con un rapporto maggiore di tre risulta chiaro che convenga sfruttare il vantaggio sul ap piuttosto che sul cdr poiché i glifi ap darebbero meno ap rispetto alle quints... Se consideriamo ora una pagina per un ad con cdr la questione è differente poiché come detto in precedenza L attack damage è una della stats nelle quali le quints hanno meno efficacia... Ma nonostante questo se considerassimo l'opzione di mettere cdr nelle quints dovremmo mettere attack dmg nei marchi e mr nei glifi... A questo punto però risulterebbe una pagina un po troppo difensiva per un dmg carry... Il che ci porta ad utilizzare quints di ad con marchi di ad o armor pen a seconda della tipologia di Champion... A questo punto il cdr trova posto nei glifi dove ha il secondo rapporto di efficienza maggiore dopo le quints... Ora prendiamo ad esempio un tank che vuole cdr... La quintessenza armor è di gran lunga la più efficiente proprio come hai fatto notare tu di conseguenza dato che l armor è la caratteristica principale di un tank insieme agli hp ovviamente si tenderà ad utilizzare quints di armor in modo da massimizzare il beneficio apportato a quella caratteristica a meno che non ci siano motivazioni inerenti ai Champion specifici come delle sinergie con altre stats particolari per esempio la q di braum... Detto questo ancora una volta il cdr trova il suo posto tra i glifi... Per di più un tank Support non essendo soggetto a ingenti quantità di danno magico durante la laning phase non trova molta utilità nello spostare le rune cdr liberando degli slot nei glifi che verrebbero poi riempiti da mr o scaling Mr essendo la statistica più efficiente nei glifi... No? Tu che ne pensi?","replies":[]}]}]}]}]}]},{"poster":"Tankerous","date":"2015-11-30T13:56:15.195+0000","up_votes":1,"down_votes":1,"body":"Fatto sta che il ruolo del support tank esiste puramente per le abilità che porta, non tanto per le statistiche. Mettete rune per sopportare al meglio l'early game e bona, il resto della partita la deciderete colpendo o no quella Q.  Io consiglio marchi armor, sigilli HP, glifi MR e quintessenze a piacere (armor, AD, HP regen). Funziona bene per tutti e vi complicate meno la vita. Ripeto: le statistiche sui support tank non contano una cippa.","replies":[{"poster":"Ucr0niA","date":"2015-11-30T20:22:28.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tankerous,realm=EUW,application-id=MJVj50Jw,discussion-id=K0gxinMn,comment-id=0001,timestamp=2015-11-30T13:56:15.195+0000)\n>\n>  Ripeto: le statistiche sui support tank non contano una cippa.\n\n+72 Salute\n+21 Armor\n+12 Mr\n\nIo non mi lancerei in certe affermazioni","replies":[]}]}]}