{"poster":"Fjorme","date":"2014-10-17T17:42:19.123+0000","title":"Hey Riot!  I'm doing a 24 hour charity stream and...","subforum":"[ARCHIVED] Miscellaneous","up_votes":20,"down_votes":0,"body":"Hey Rioters! I'm doing a 24 hour Charity stream for extra-life.org on Saturday the 25th, from 12am EST to 11:59 EST, and I was wondering if any Rioter would like to join me for a normal game/aram, whatever. I'm aiming to raise $500 for the Boston Childrens Hospital, and I think with your guys help, I'll reach that goal no problem! Let me know if you can, and how to contact you! Thanks in advance! ( I did not post any links, don't want to break any rules)\n\n**EDIT:** I posted this in GD and it was suggested I post to multiple boards!","replies":[{"poster":"moonstones","date":"2014-10-17T18:40:04.874+0000","up_votes":6,"down_votes":0,"body":"I'll shoot you an invite on League, and we can go from there!","replies":[]},{"poster":"moonstones","date":"2014-10-17T18:16:00.864+0000","up_votes":6,"down_votes":0,"body":"Hey! I'm also doing Extra Life! I'd love to stream with you! :D","replies":[{"poster":"Fjorme","date":"2014-10-17T18:36:26.758+0000","up_votes":4,"down_votes":0,"body":"Awesome!  How would you like to coordinate?","replies":[]}]},{"poster":"Crispybro","date":"2014-10-20T17:03:14.993+0000","up_votes":1,"down_votes":0,"body":"Not to steal the lime light from Braum Armstrong, since it is his thread, but the University of Louisiana at Monroe's League of Warhawks is also participating in the extra-life.org event at the same time. If any Rioters wish to participate in our stream it would really mean a lot to us to get any help in making our stream that much more epic!","replies":[]},{"poster":"ÒwÓ ÙwÚ ÒwÓ","date":"2014-10-18T17:47:41.419+0000","up_votes":1,"down_votes":0,"body":"I'd like to join you too :D\nI've done it with a small group of friends for the past two years but this year most of my friends are too busy with work and one left for the Air Force (He was the one that drove us everywhere). I know for a fact I can't be there for the entire time, but I'll still be there for a big part of it.","replies":[]},{"poster":"LockCORE","date":"2014-10-17T22:15:05.851+0000","up_votes":1,"down_votes":0,"body":"I am going to stream for Extra-life as well myself! I'll be on the 25th as well so good luck fellow extra-lifer!","replies":[]},{"poster":"Epyc","date":"2014-10-17T22:13:55.930+0000","up_votes":1,"down_votes":0,"body":"oonts oonts oonts","replies":[]},{"poster":"Crai Crushna","date":"2014-10-17T18:50:09.885+0000","up_votes":1,"down_votes":0,"body":"Will bump for more exposure.  Thinking about doing this myself.  Didn't do ti last year due to time constraints but did do it from 2010-2012.  GL with the games and fundraising.","replies":[{"poster":"Fjorme","date":"2014-10-17T21:07:23.467+0000","up_votes":1,"down_votes":0,"body":"Thanks so much!","replies":[]}]}]}