{"poster":"ninju7su","date":"2017-01-26T07:36:04.334+0000","title":"Janna Ult Knock-Back","subforum":"Champions & Gameplay","up_votes":3,"down_votes":1,"body":"Moin\r\n\r\nkurze Frage:  Welche Champions mit welchen Skills lassen sich **nicht** von der Janna-R zur&uuml;cksto&szlig;en? \r\n\r\nBeispielsweise die Malph-R ist nicht abzubrechen. Logisch. Gestern hatte ich ein Game wo ich feststellen musste, dass auch ein Heca-engage nicht abzubrechen ist. Da ich noch recht neu auf dem Champ unterwegs bin, k&ouml;nnt ihr mir vielleicht helfen ein paar Fettn&auml;pfchen zu umgehen und mir sagen, was noch alles nicht abzubrechen ist.\r\n\r\nFalls euch sonst noch etwas einf&auml;llt das man &uuml;ber die Janna-Ult wissen sollte, k&ouml;nnt ihr das nat&uuml;rlich immer gerne dazuschreiben.\r\n\r\nVielen Dank f&uuml;r die Kommentare!","replies":[{"poster":"Enderized","date":"2017-01-26T07:52:06.888+0000","up_votes":3,"down_votes":0,"body":"Darius Darius' Noxian Guillotine - Noxian Guillotine provides immunity to all forms of CC for the duration of the dash.\nHecarim Hecarim's Onslaught of Shadows - Onslaught of Shadows provides immunity to all forms of CC for the duration of the dash.\nJarvan IV Jarvan IV's Cataclysm - Cataclysm provides immunity to all forms of CC for the duration of the dash.\nMalphite Malphite's Unstoppable Force - Unstoppable Force provides immunity to all forms of CC for the duration of the dash.\nNocturne Nocturne's Paranoia - Paranoia provides immunity to all forms of CC for the duration of the dash.\nVi Vi's Assault and Battery - Assault and Battery provides immunity to all forms of CC for the duration of the dash.\n\n\n\nBanshee&#039;s Veil - Banshee's Veil provides immunity to CC applied with first instance of ability blocked while passive is ready.\nEdge of Night - Edge of Night provides immunity to CC applied with first instance of ability blocked in the duration.\nFiora - Fiora's Riposte - Riposte provides immunity to all forms of CC applied during the parry.\nMalzahar - Malzahar's Void Shift - Void Shift provides immunity to all forms of CC applied in the duration.\nMorgana - Morgana's Black Shield - Black Shield provides immunity to all forms of CC applied in the duration of the shield.\nNocturne - Nocturne's Shroud of Darkness - Shroud of Darkness provides immunity to CC applied with first instance of ability blocked in the duration.\nOlaf Olaf's Ragnarok - Ragnarok provides immunity to all forms of CC applied in the duration, with exception of nearsight.\nSivir - Sivir's Spell Shield - Spell Shield provides immunity to CC applied with first instance of ability blocked in the duration.\n\n\nhttp://leagueoflegends.wikia.com/wiki/Crowd_control\n\n\nEDIT: Ezreal Ultimate kann auch nicht durch CC abgebrochen werden.","replies":[{"poster":"PlanetenPlatzer","date":"2017-01-26T08:41:42.726+0000","up_votes":1,"down_votes":0,"body":"Sion's Ult fehlt auch noch","replies":[]}]},{"poster":"CYPHΕR","date":"2017-01-26T07:47:23.740+0000","up_votes":1,"down_votes":0,"body":"Ich finde aktuell keine Quelle die aus Jannas Sicht aufzählt, wer alles nicht vom Ult-Knockback betroffen ist.\n\nUmgekehrt ist es aber so, dass bei einem Spell explizit dabeistehen muss, dass der Champion bei der Ausführung immun gegen cc ist.\n\nBsp.:\n\nMalphite (R), Hecarim (R), Sion (R)","replies":[{"poster":"Marmorkuchen","date":"2017-01-26T08:17:08.367+0000","up_votes":2,"down_votes":1,"body":"Master Yi wird zurückgeworfen... hatte vorgestern gegen ihn gespielt. Auch Jannas Wirbelsturm wirft ihn zurück, Ulti läuft dann aber wieder weiter.","replies":[{"poster":"CYPHΕR","date":"2017-01-26T08:22:22.654+0000","up_votes":2,"down_votes":0,"body":"Er ist ja auch nicht immun gegen cc, sondern mit der Ult nur immun gegen slows.","replies":[{"poster":"Kosmaxnaut","date":"2017-01-26T08:24:51.566+0000","up_votes":1,"down_votes":0,"body":"Fiora dürfte doch auch immun sein mit ihrer w \noder irre ich mich da ?","replies":[{"poster":"CYPHΕR","date":"2017-01-26T08:28:33.277+0000","up_votes":1,"down_votes":0,"body":"Wenn richtig getimed, ja.","replies":[]}]}]},{"poster":"AI Yjuq","date":"2017-01-26T08:25:03.836+0000","up_votes":1,"down_votes":0,"body":"Wo ist hier die Rede von Master Yi? :o\nWenn das auf mein Post bezogen war, seine Q macht ihn unantastbar.","replies":[]}]}]},{"poster":"AI Yjuq","date":"2017-01-26T08:06:46.657+0000","up_votes":2,"down_votes":0,"body":"Folgende Champions können nicht von der Janna Ult beeinflusst werden:\n- Bard wenn er sich selber mit seiner Ultimate trifft (oder auch Teammitglieder).\n- Camille wenn sie gerade ihre Ultimate auf jemanden castet ist sie für die Animation komplett geschützt.\n- Ekko wenn er mit seiner Ult durch deine fliegt.\n- Elise wenn sie sich mit ihrer E in die Luft begibt.\n- Ezreal seine E wenn er sie zum richtigen Zeitpunkt nutzt. (Das sind nur ein paar Frames, da braucht man verdammt gutes Timing).\n- Fizz mit seiner E, der ist sowieso nur Cancer xD\n- Hecarim wenn er mit seiner Ult da durch fliegt.\n- Illaoi ist für eine kurze Zeit nicht beeinflussbar wenn sie Ihre Ult castet.\n- Kalista ihre Ult kann einen Champion da rein schießen, bzw. dieser kann im Flug selber nicht unterbrochen werden. (Wenn ich mich nicht irre, nicht zu 100% sicher)\n- Kassadin seine R, ähnlich wie bei Ezreal.\n- Lissandra in ihrer Ultimate.\n- Malphite seine Ult. Hab die ne Zeit lang versucht mit Poppy ihrer W zu blocken, hab mich immer gewundert warum der durchflog... xD\n- Maokai in seine W.\n- Master Yi in seiner Q.\n- Shaco wenn er seine Ultimate castet (ähnlich wie bei Ezreal, schwer zu timen).\n- In Vi ihrer Ult, du knock backst sie zwar, aber die Ult wird nicht unterbrochen, die kommt also gleich wieder Richtung Ziel xD\n\nAchja, und allgemein alle Champions die im Zhonyas-Stadium sind.","replies":[{"poster":"Kosmaxnaut","date":"2017-01-26T08:28:18.885+0000","up_votes":1,"down_votes":0,"body":"Du hast Fiora in ihrere W vergessen, wenn das zählt","replies":[]}]},{"poster":"ikslhairtuz","date":"2017-01-26T07:58:46.064+0000","up_votes":1,"down_votes":0,"body":"Der neue Warwick mit Q lässt sich nicht von Janna zurückstoßen{{champion:19}}","replies":[{"poster":"TerrorRaven","date":"2017-01-26T22:49:00.475+0000","up_votes":1,"down_votes":0,"body":"Die neue Warwick Ulti lässt sich im Sprung ebenfalls nicht abbrechen.","replies":[]}]},{"poster":"Bodycounter","date":"2017-01-26T11:27:48.386+0000","up_votes":1,"down_votes":0,"body":"Es gibt vier Möglichkeiten einem Knockback zu entgehen:\n \n* Untargetable (z.B. Poppy R, Fizz E)\n* Spellshield (z.B. Banshees, Morgana E)\n* Stasis (z.B. Zhonyas, Bard R)\n* Immunity (z.B. Malphite R, Vi R)","replies":[]}]}