{"poster":"BronzeDontChase","date":"2018-05-14T17:15:10.995+0000","title":"PLAYER PER DUOQ","subforum":"Reclutamento","up_votes":1,"down_votes":3,"body":"Ciao a tutti, gioco dalla season 3, molti anni f&agrave; il gioco mi appassionava di pi&ugrave;, tanto che sono arrivato platino per 2 stagioni consecutive, intorno al platino 1.\r\nPoi impegni,lavoro e altro mi hanno un p&ograve; distaccato dal gioco,ora sto provando a riprendere la mano in questa season 8.\r\nPrima avevo un team e ho giocato per anni con loro, ma ormai hanno mollato tutti,e di conseguenza mi sono lasciato andare.\r\nOra cerco un player con il quale giocare DuoQ.\r\nRichiedo per quanto possibile attitudine positiva, no ragazzini psicopatici.\r\nElo almeno Silver 2/Gold non richiedo di pi&ugrave; in quanto anche io sto cercando di riprendere la mano, e sto appunto vedendo un p&ograve; i cambiamenti, specialmente la champion pool &egrave; un p&ograve; antiquata. (love season 4 ahaha)\r\nDunque come principale obiettivo cerco un player che abbia voglia di migliorarsi e collaborare.\r\nThat&#039;s all. \r\nBye","replies":[{"poster":"BronzeDontChase","date":"2018-05-15T10:22:11.046+0000","up_votes":1,"down_votes":1,"body":"up","replies":[{"poster":"Aurelion Shmoll","date":"2018-05-15T11:51:50.193+0000","up_votes":2,"down_votes":0,"body":"\"**up**\"\n\nhttps://www.youtube.com/watch?v=8s22PZRXAIY","replies":[]}]},{"poster":"B4r1um","date":"2018-05-14T21:36:01.577+0000","up_votes":1,"down_votes":3,"body":"Ciao SALVINI LA RUSPA , se cerchi persone per fare soloq/flex con altri giocatori di LoL, vieni a farci visita: http://www.energygaming.it/\nSiamo una multigaming che si occupa di LoL, i nostri membri sono sempre disponibili per normal e anche ranked :)\nOgni mese organizziamo anche tornei a premi, puoi creare o entrare a far parte in uno dei nostri team oppure se hai bisogno di un coach noi te lo troviamo ;)\n\nSe sei interessato e vuoi maggiori informazioni aggiungimi su LoL\nID: B4r1um\n\n\n{{sticker:garen-swing}}","replies":[]}]}