{"poster":"BeccyIsBack","date":"2016-04-13T12:29:40.625+0000","title":"AFK's im ranked","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":3,"body":"Grade ein ranked verloren weil mein adc ohne grund afk gegangen ist.. Und jetzt frage ich mich warum man &uuml;berhaupt LP verliert wenn man einen afk im team hat? Man k&ouml;nnte doch wenigstens so machen dass wenn er vom leaverbuster-system erkannt wurde man keine LP verliert ._.","replies":[{"poster":"ZeeDarkon","date":"2016-04-13T13:37:35.984+0000","up_votes":2,"down_votes":0,"body":"(wie oft muss ich das eigentlich noch erklären meine güte)\n\nwenn du keine LP verlieren würdest wenn du einen AFK hast, dürftest du ja auch in wins keine LP kriegen wenn dein gegner afk geht oder? nicht nur kann man das sehr einfach benutzen in dem man afk geht damit das eigene team keine LP verliert (was gerade mit dynamic queue definitiv passieren würde), ausserdem hast du wahrscheinlich insgesamt mehr LP dadurch gewonnen dass ein gegner afk war als du verloren hast durch einen teammate der AFK geht. statistisch kommt ein AFK häufiger im gegnerteam vor als in deinem eigenen, AFKs helfen dir also beim aufsteigen. klar ist das frustrierend wenn man mal n AFK hat, aber wenn du neutral drüber nachdenkst ist das system schon sinnvoll so.\n\nEDIT: gerade bei 260 games ist es SEHR unwahrscheinlich dass du mehr games durch AFKs verloren als durch sie gewonnen hast. ","replies":[{"poster":"BeccyIsBack","date":"2016-04-13T15:32:01.592+0000","up_votes":1,"down_votes":3,"body":"komm jetzt nicht mit dem statistischem -_- ich hab von ca 15 games immer nen afk ..","replies":[{"poster":"ZeeDarkon","date":"2016-04-13T15:40:08.297+0000","up_votes":1,"down_votes":0,"body":"also zum einen halte ich das für leicht übertrieben, nach eigener erfahrung in der ELO, zum anderen, du hast 260 spiele diese season. wie gesagt, es ist sehr unwahrscheinlich dass du mehr durch AFKs verloren hast als gewonnen.","replies":[{"poster":"BeccyIsBack","date":"2016-04-13T15:45:06.184+0000","up_votes":1,"down_votes":3,"body":"Du bist silber und redest von erfahrung :D","replies":[{"poster":"ZeeDarkon","date":"2016-04-13T15:50:36.539+0000","up_votes":1,"down_votes":0,"body":"das ist auch nicht mein main :'D\n\nich würde nicht sagen dass ich erfahrung in der ELO habe wenns nicht stimmen würde und man es so leicht überprüfen kann^^","replies":[{"poster":"BeccyIsBack","date":"2016-04-14T10:35:29.981+0000","up_votes":1,"down_votes":2,"body":"Bestimmt ^^","replies":[{"poster":"ZeeDarkon","date":"2016-04-14T10:39:37.625+0000","up_votes":1,"down_votes":0,"body":"ich glaub aber das waren serverprobleme gestern. ich hab viel gehört dass mehrere leute aus beiden teams DCd sind etc.","replies":[]}]}]},{"poster":"eingew","date":"2016-04-14T14:32:52.530+0000","up_votes":2,"down_votes":0,"body":"Dir ist aber bewusst, dass man sogar in Bronze Erfahrung haben kann?\n\nErfahrung heißt, dass man einiges hinter sich hat... nicht aber, dass man dadurch zwingend (merklich) besser geworden ist.","replies":[]}]}]},{"poster":"SorisDynasty","date":"2016-04-14T14:36:55.629+0000","up_votes":1,"down_votes":0,"body":"Wenn das stimmen sollte... naja... solltest du vielleicht überlegen, ob du nicht vielleicht Schuld daran hast, dass Leute AFK gehen.","replies":[]}]}]},{"poster":"oneshot Vasco","date":"2016-04-15T08:49:32.849+0000","up_votes":1,"down_votes":0,"body":"Wobei ich aber denke das AFK ding ist wirklich ein Elo abhängiger Faktor. Ich hatte zwar in meinen letzten 4 rankeds auch einen afk, was ich jetzt nicht schlimm finde, kann wie gesagt dem gegner genauso passieren, aber wenn ich mich mit freunden unterhalte haben die je tiefer sie sind auch mehr afks... also irgendwas wird schon dran sein denke ich.","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-04-14T11:30:40.873+0000","up_votes":1,"down_votes":0,"body":"das elo system berücksichtigt in keinster weise, auf welche art das spiel entschieden wird. es geht nur darum wer gegen wen gewinnt. es werden 10 spieler gesucht, die zusammen eine ähnliche mmr haben. 5 gegen 5, die verlierer verlieren punkte, die gewinner gewinnen punkte. nichts anderes wird berücksichtigt, wenn die server nicht gerade rumderpen, also loss prevented an ist.\n\ndas ist wohl eines des einfachsten und effektivsten systeme, die es in der hinsicht gibt. warum sollte man das komplizierter machen?","replies":[]},{"poster":"Ghost Decree","date":"2016-04-13T14:47:04.969+0000","up_votes":1,"down_votes":0,"body":"Vielleicht hatte dein ADC internet probleme? Das hab ich auchschonmal. Oder sein Pc hat sich aufgehangen. passiert mir auch :D. Aber wie lange war der denn AFK?","replies":[]},{"poster":"zoroyashie","date":"2016-04-13T13:18:48.050+0000","up_votes":1,"down_votes":0,"body":"Meine Meinung dazu ist, ich meine es gibt Spieler die fallen und Spieler die klettern hoch, wenn derjenige AFK verliert man halt aber hei er geht runter.\nSetz dich einfach mit mehr Motivaation hinter deine Tastatur und lach drüber das er LP verliert","replies":[]},{"poster":"w00tOo","date":"2016-04-13T12:35:53.447+0000","up_votes":1,"down_votes":0,"body":"Das ist einfach Pech. Es ist immerhin ein 5vs5 Online Spiel da wird es IMMER mal vorkommen das jemand AFK geht.Das wird sich auch leider nie ändern. Immer dran denken das passiert dir ABER es kann genau so deinem Gegner Team passieren.","replies":[]},{"poster":"Homunculi","date":"2016-04-13T12:33:35.073+0000","up_votes":1,"down_votes":0,"body":"Weil das sonst missbraucht werden würde.\n\nAls Bsp.: Spiel läuft schlecht und einer geht AFK damit keiner LP verliert, evtl. wird er darum gebeten oder aber wenn es Premates sind, wird es untereinander abgesprochen.\n\nMir gehts ja auch aufn Senkel, aber wirklich was machen kann man in dem Moment nicht =/.\n\n","replies":[]},{"poster":"BeccyIsBack","date":"2016-04-13T15:30:26.641+0000","up_votes":1,"down_votes":2,"body":"Nächster afk :) nene kommt nicht oft vor ^^","replies":[]}]}