{"poster":"Anrho","date":"2018-03-21T02:48:21.224+0000","title":"[¿Cambio de Imagen para el Tabi de Ninja?] - Anrho.","subforum":"Charlas Generales","up_votes":2,"down_votes":6,"body":"Hola, me llamo Anrho. ya me conocer&aacute;n de post como &#039;&#039;Deberias Jugar a...&#039;&#039; y &#039;&#039;Kobayashi-san Chi no Maid Dragon&#039;&#039; entre otros.... PERO A NADIE LE IMPORTA! \r\nMiren esto no es que sea un \r\n#DIOS HAY QUE CAMBIAR ESTO ANTES DE QUE SEA TARDE!!! OH NO! SON LAS TROMPETAS DEL APOCALIPSIS! SALVESE QUIEN PUEDA!! AHHH\r\nde hecho no tiene Mucha relevancia...\r\nse trata de unas de mis botas favoritas el Tabi de Ninja {{item:3047}} y su imagen\r\nse que es solo un item y que lo unico importante aqui son sus atributos... pero No- NO IMPORTA YO SIEMPRE PUEDO ENCONTRAR ALGO DE QUE QUEJARME! y es que los tabi no son asi..\r\n#*Podria poner una Imagen pero le doy a Copiar y Pegar y no aparece nada como antes que lo hacia y aparecia un Link que ponia la imagen en el Post se Agradece cualquier ayuda llame al 0800-555-68461984984694*\r\ny son MUY diferentes a comparacion de el tabi que se muestra en la imagen... a diferencia de los verdaderos tabi que parecen mitad calcetines con un dedo separado este tabi es mas bien una bota verde.. si, puede que no sea de mucha importancia pero si lo piensas bien..\r\nsi hacen un Cambio de imagen a la bota de tabi TAL VEZ podrian Hacer nuevos iconos para las demas Botas que sean mas bonitos y algun que otro item un ejemplo; la cota de Espinas, Apariencia espiritual, etc.\r\nEste fue Anrho y para los que les interese TAL VEZ y digo TAL VEZ haga un Deberias jugar a... FORTNITE\r\nPD: debo admitir que soy muy malo en este juego y no es porque sea malo en los videojuegos si no porque apuntar con el Joystick de PS4 da Embolia y la mayoria de las veces termino muriendo mas o menos al comienzo","replies":[{"poster":"Doca","date":"2018-03-21T10:46:38.228+0000","up_votes":1,"down_votes":0,"body":"si te pones a pensar, te das cuenta que la imagen esta de perfil y si la bota es de un pie izquierdo, nuca vas a poder ver el \"dedo para afuera\" que caracteriza a a las botas tabi. por lo que podriamos concluir que la imagen\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Anrho","date":"2018-03-21T14:18:39.256+0000","up_votes":1,"down_votes":0,"body":"no es solo por la perspectiva de la bota\nsolo busca ''botas tabi'' en internet y veras que esto no es un tabi.. esto es una Bota! (y muy feas en mi opinión e.e)","replies":[{"poster":"Doca","date":"2018-03-22T00:26:17.356+0000","up_votes":1,"down_votes":0,"body":"XDDDDDDDDDDDDDDDD","replies":[]}]}]}]}