{"poster":"The Trouble","date":"2015-09-29T06:50:14.985+0000","title":"matchmaking","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":3,"body":"werde ich es jemals erleben, dass ich mal drei spiele hintereinander mit einem normalen team gegen ein normales team spielen werde oder ist das einfach nur wunschglaube? habe schon vor season1 begonnen mit lol und es vergehen keine drei spiele wo nicht einer afk ist, trollt, usw. (das kennt ja jeder von uns)... aber was mir aufgefallen ist und leider ist das meiner meinung nach nicht nur subjektiv gesehen so, denn ich spiele auch mit verschiedenen duo-q partnern, dass speziell leute in meinem team nicht nur schlecht sondern auch eine affinit&auml;t zu afk, beleidigungen und zum trollen haben. \r\n\r\ndas kann doch nicht sein, dass man beispielsweise schon mehrmals 5 gegen  4 verloren hat... normalerweise sollten wir alle im das spiel deinstallieren, wenn sowas passiert. was mich aber &auml;rgert ist nicht die tatsache, dass wir verloren haben, sondern dass das gegnerische team so gut zusammen spielt, dass sie sogar 4 gegen 5 gewinnen. wenn in meinem team eine lane bereits zum 2. mal stirbt, reden die leute schon vom aufgeben und ich gebe in ranked niemals auf und das &auml;rgert mich weil ich mir den arsch aufreisse und mein &quot;team&quot; bereits anf&auml;ngt zu trollen.\r\n\r\nwas soll dieses verbuggte matchmaking? jeder der mit mir 3 spiele spielt, tut es nie wieder, weil er genau dieselbe erfahrung macht. bitte um aufkl&auml;rung, riot!","replies":[{"poster":"Powerjen","date":"2015-09-29T07:06:51.906+0000","up_votes":2,"down_votes":0,"body":"Wird nicht lange dauern und Du wirst hier zerpflückt werden. Das Thema kommt zu oft und Du bist kein Sonderfall.\n\nDas MM sagt übrigens nichts über die Einstellung der Spieler zum Spiel aus, sondern nur über deren theoretische Siegchance. Wie schnell jemand innerlich aufgibt, kann keiner berechnen.","replies":[{"poster":"The Trouble","date":"2015-09-29T07:33:57.653+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Powerjen,realm=EUW,application-id=ip27PlEH,discussion-id=vEaHna1u,comment-id=0000,timestamp=2015-09-29T07:06:51.906+0000)\n>\n> Wird nicht lange dauern und Du wirst hier zerpflückt werden. Das Thema kommt zu oft und Du bist kein Sonderfall.\n> \n> Das MM sagt übrigens nichts über die Einstellung der Spieler zum Spiel aus, sondern nur über deren theoretische Siegchance. Wie schnell jemand innerlich aufgibt, kann keiner berechnen.\n\nja da gebe ich dir recht. mit beiden aussagen :) \n\ndas ist auch der grund warum ich nicht verstehe, warum solche leute in meinem team sind. jedes spiel ist ein glücksfall mittlerweile. wenn das für beide seiten so wäre, dann würde ich ja nix sagen, aber wenn ich dann sehe wie 4 gegen 5 das gegnerische team spielt, als ob das ne meisterschaft wäre und mit hirn und herz bei der sache sind, dann denke ich mir, warum hat mein team nie sowas? \n\ndas ist wie wenn riot da sitzt und sich die ärgsten fälle aussucht und sie dann einzeln in mein team reinhaut. irgendwas muss sich da ändern. ich trete ständig auf der stelle. ich spiele alle lanes und alle positionen mittlerweile und kann so ca. 60% aller champs beherrschen und weis bei 80% alle ihre cds und abilities und komme dann in ein team wo schon im champselect geschrieben wird: \"mid or feed\" ... sorry aber das ist nicht das level wo ich reingehöre.","replies":[{"poster":"Nephirelle","date":"2015-09-29T07:45:44.983+0000","up_votes":1,"down_votes":0,"body":"> das ist auch der grund warum ich nicht verstehe, warum solche leute in meinem team sind. \n\nDas nennt sich \"Selektive Wahrnehmung\". Negativerfahrungen brennen sich eher in's Gedächtnis ein als positive - ganz normaler psychologischer Effekt. Und gerade wenn man sich in das \"immer ich\" so reinsteigert wie du, bleibt von den Positiverfahrungen bereits nach ein paar Minuten nicht mehr viel übrig.","replies":[]}]}]},{"poster":"WhiteW0lf88","date":"2015-09-29T10:31:09.131+0000","up_votes":1,"down_votes":0,"body":"also ich hab eher das Problem mit dem mm das ich noch nicht so gut bei lol und voll oft in teams reinkomme wo fast alle Spieler Silber oder höher sind (ich hab nur 2 oder 3 Ranking games gespielt) und dann jedes mal voll schlecht bin weil die alle besser sind als ich und deswegen vllt auch oft mein team verliert.\ndas echt nervig wenn ich so in meiner Spielverlauf schauhe sind da 4 gewonnen spiele und 13 verlorene games, das macht dann auch irgendwann kein spaß mehr wenn mann seit 2 tagen nicht mal mehr seinen tagessieg schafft ^^","replies":[]},{"poster":"AyteeDE","date":"2015-09-29T08:14:18.350+0000","up_votes":1,"down_votes":0,"body":"http://prntscr.com/8lpvhq\n\n4 Spiele am Stück, keiner AFK. These widerlegt.","replies":[]},{"poster":"ThomasZwerg","date":"2015-09-29T07:28:47.269+0000","up_votes":1,"down_votes":2,"body":"hallo ich würde gerne mittmachen und war silber spieler dann kamen meine freunde :/ naja B5 :D egal min main so mit {{champion:432}} {{champion:223}} {{champion:201}} {{champion:37}} {{champion:99}} {{champion:21}} und Kindred auf PBE \nwürde mich für eine Antwort freuen !","replies":[{"poster":"The Trouble","date":"2015-09-29T07:29:57.953+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LegendofThomas,realm=EUW,application-id=ip27PlEH,discussion-id=vEaHna1u,comment-id=0001,timestamp=2015-09-29T07:28:47.269+0000)\n>\n> hallo ich würde gerne mittmachen und war silber spieler dann kamen meine freunde :/ naja B5 :D egal min main so mit {{champion:432}} {{champion:223}} {{champion:201}} {{champion:37}} {{champion:99}} {{champion:21}} und Kindred auf PBE \n> würde mich für eine Antwort freuen !\n\nlies mal was da steht bevor du deinen standard post hier rein tust.","replies":[{"poster":"ThomasZwerg","date":"2015-09-29T07:31:38.850+0000","up_votes":1,"down_votes":2,"body":"ja aber wenn du einen Mitspieler sucht komm ich gern","replies":[]}]}]}]}