{"poster":"MATI TE AMO","date":"2015-10-16T06:24:37.020+0000","title":"¿Uno Para Todos Aburrido?","subforum":"Charlas Generales","up_votes":17,"down_votes":10,"body":"Soy solo yo que en un punto del game, 25 a 30 minutos ya no quiere jugar mas y se aburre?:. Creo que deberian hacer el modo pero en ARAM. \r\n\r\npd: Que vuelva el URF VIEJOO{{item:3151}}","replies":[{"poster":"FurchiDC","date":"2015-10-16T07:05:42.396+0000","up_votes":17,"down_votes":1,"body":"Hubiera sido 1000 veces mejor en el Abismo de los Lamentos... o sea es la onda, todos contra todos. Es aburridísimo separarse en la grieta.","replies":[]},{"poster":"Kinniku Buster","date":"2015-10-16T12:27:00.576+0000","up_votes":6,"down_votes":0,"body":"No es aburrido si jugas con premade, al contrario!. Te hechas muchas risas. La primera partida pickeamos a {{champion:54}} contra {{champion:35}} , y aunque abusaron de nosotros en Early, esperamos al dulce nivel 6 y repartíamos ulti como panes!. Nos armamos como quisimos, tanke, ap, ad, con resistencia mágica lo que viniera con total de lanzarse 5 veces al mismo tiempo no tiene precio.\nDespués nos toco Yi, solo 2 sabíamos usarlo correctamente, tambien probando builds mi equipo, dimos paliza a 5 lee. Ver 5 yi ulteando por un objetivo para ver quien se kaseaba primero y ademas con micro, una experiencia muy divertida!.\nAhora como todos, también te tocan personajes que en tu vida tocaste usar....a uno se le ocurrió zilean y a Garen...A los 2 los habré usado 2 veces en mi vida y en aram (sip, soy de los pocos que nunca han jugado Garen, y para colmo tuve que ir Jungla) y aunque nos aplastaron, la idea jamas fue ganar, era divertirse y probar builds!.  \nLa que mas me divertí fue 5 zilean conta 5 ahri, nos ganaron sip....pero me destornillaba de risa viendo como las ahri no podían cruzar el campo minado de bombas.\nLo que pasa que acá solo apuntan a ganar y hacer mas kills, a nosotros nos daba igual armarnos tanke con total de probar builds e ingeniárnosla con campeones que ni usabamos.\nLa siguiente voy a pedirle al equipo 5 taric haber que onda....","replies":[{"poster":"D Godyr Gates","date":"2015-10-16T15:54:45.710+0000","up_votes":3,"down_votes":0,"body":"Jajajajaaj entendemos la diversion que generan esas cosas. Te re banco\n\nIgualmente me parece media aburrida la partida en la grieta. Seprarse, esperar a escalar.. Es todo un embole eso. Ya en ranked a veces me cansa jajajaj.\n\nEstaria bueno que sea opcional en El Abismo de los Lamentos","replies":[]},{"poster":"rokushoger","date":"2015-10-16T17:21:00.700+0000","up_votes":2,"down_votes":0,"body":"La de 5 taric... IT'S LIKE ULTIMATE PENETRATION!","replies":[]},{"poster":"MATI TE AMO","date":"2015-10-16T17:00:09.700+0000","up_votes":2,"down_votes":0,"body":"Esta bien lo que decis. A mi punto de vista, tampoco me referia a ganar, sino pasarla bien, pero estar 50 minutos en esa partida se volvia un fiasco, deseando que termine ya la partida. Deberian ser mas cortas y en otro mapa.","replies":[]}]},{"poster":"Neroh","date":"2015-10-16T11:56:31.924+0000","up_votes":6,"down_votes":1,"body":"Yo prefería el de los bots en modo dios :(","replies":[]},{"poster":"Il Bardolino","date":"2015-10-16T13:32:56.176+0000","up_votes":1,"down_votes":0,"body":"Cinco {{champion:85}} es un asco de jugar, tanto en contra como en tu equipo. Te sentis sucio.\n\nCinco {{champion:223}} es bastante divertido.","replies":[{"poster":"rokushoger","date":"2015-10-16T17:18:04.131+0000","up_votes":1,"down_votes":0,"body":"Cinco blitz es la locura, 5 kennen la aburre (son muy op pero la aburre).","replies":[{"poster":"Nitrobacter","date":"2015-10-16T17:27:59.312+0000","up_votes":1,"down_votes":0,"body":"Los blitz son muy cagones en early, ayer eramos viktors contra blitzs y estos en early se la pasaban en grupo (en realidad  casi toda la partida se la pasaron juntos) y eso rompía mucho las bolas. Al final ,después de mas de una hora de partida logramos romper nexo- pero ellos nos superaron en kills.","replies":[{"poster":"rokushoger","date":"2015-10-16T18:15:48.909+0000","up_votes":3,"down_votes":0,"body":"Andar en grupo y jugar como un equipo es ser cagón? loooooooooooooooooooool te equivocaste de juego jajajajajajajajaj, y si, la idea con los blitz es ir de a 3 o más y enfocarse en el primero que agarren hasta que te maten a cc sin que puedas hacer nada, y así repitiendo el ciclo te bajan el team entero.","replies":[{"poster":"tomfunes","date":"2015-10-17T00:01:35.800+0000","up_votes":1,"down_votes":0,"body":"Así ganamos una ayer contra 5 Brand, agarrábamos de a uno, E, R, kill. Así toda la partida, para nosotros fue divertida, para los otros debe haber sido frustrante. Antes había jugado una con Ashe contra blitz, en early nos violaron a Q, en late los violamos a críticos y ultis. Ganamos con 20 kills menos que ellos en un exterminio a lvl 16/17.","replies":[{"poster":"rokushoger","date":"2015-10-19T20:50:33.360+0000","up_votes":1,"down_votes":0,"body":"Exacto, y eso es todo estrategia, parte del juego, ese es mi punto.","replies":[]}]}]}]}]}]},{"poster":"Nyán","date":"2015-10-17T00:30:24.466+0000","up_votes":2,"down_votes":0,"body":"El laning phase lo encuentro muy lento. Deberían ponerlo en ARAM ;c\n\nPD: Jueguen con Syndra. Es muy chistoso en late game.","replies":[{"poster":"Typhlosion93","date":"2015-10-17T02:58:30.325+0000","up_votes":1,"down_votes":0,"body":"Con un premade tenemos ganas de jugar con Syndra, permastun me imagino.","replies":[{"poster":"Nyán","date":"2015-10-17T19:16:56.180+0000","up_votes":1,"down_votes":0,"body":"Permastun. Y tu E puede mover las pelotitas de otra Syndra.","replies":[{"poster":"Typhlosion93","date":"2015-10-17T21:53:45.596+0000","up_votes":1,"down_votes":0,"body":"Y las ultis casi siempre salen con 7 pelotitas, ya jugué un par de partidas con Syndra.","replies":[]}]}]}]},{"poster":"Krilin Noda Oro","date":"2015-10-16T13:55:30.263+0000","up_votes":2,"down_votes":0,"body":"La ultima vez lo hicieron en modo ARAM y muchos lo pedian en la grieta, dificil llegar a dar en el gusto a tantos usuarios, y si se torna aburrido creo que es un problema de los jugadores ","replies":[]},{"poster":"nifu","date":"2015-10-16T13:42:42.466+0000","up_votes":2,"down_votes":0,"body":"es muy aburrido el modo. si vas ganando jugas. si vas perdiendo surrender a los 20. no pude tirar o que me tiren un solo nexo.\n pd: hacen duo y ya esta ganan el campeon no podes influenciar","replies":[{"poster":"DAIFUNKA","date":"2015-10-16T13:49:22.861+0000","up_votes":2,"down_votes":0,"body":"lo que pasa que la mayoria se quieren poner de acuerdo para elegir campeones que por ahi los van a favorecer en ves de elegir el que quieran y ver que sale que creo es la gracia del modo","replies":[]}]},{"poster":"MANOLOL0909","date":"2015-10-16T12:13:44.640+0000","up_votes":2,"down_votes":1,"body":"Hagamos huelga, queremos URF!, queremos URF!","replies":[]},{"poster":"Necrosis","date":"2015-10-16T09:39:18.636+0000","up_votes":2,"down_votes":1,"body":"Acabo de jugar un \"Uno para Todos\", y si, 15 minutos promedio esperando entre partidas. ¿Ya no juegan League of Legends? ¿Ya pasó de moda?\nAlgunos me dicen que porque es día de semana y por la hora...\nAntes había gente a cualquier hora todos los días. La comunidad LAS está decayendo demasiado, que por supuesto todos sabemos muy bien porqué...\nLamentamos tener el Tribunal más decadente de todos los servidores, y la poca importancia que le dan a los reportes.","replies":[{"poster":"tomfunes","date":"2015-10-17T00:03:02.043+0000","up_votes":1,"down_votes":0,"body":"Acabo de juga un \"uno para todos\" y la cola fue menor que en una normal... ¿Te anduviste portando mal? jajajaja No tengo idea de por qué te demoró tanto.","replies":[{"poster":"Necrosis","date":"2015-10-18T22:04:32.202+0000","up_votes":1,"down_votes":0,"body":"No, es nueva la cuenta. Y mas allá de ello yo soy una de las pocas personas que respeta el Código del Invocador.","replies":[]}]}]},{"poster":"The Fall of Troy","date":"2015-10-19T22:30:19.298+0000","up_votes":1,"down_votes":0,"body":"5 {{champion:12}} es ping pong con las cornadas\n5 {{champion:63}} con 40 de cdr es permastun\n5 {{champion:222}} o 5{{champion:115}} ALLAHU AKBAR\n5 {{champion:75}} bien farmeados es 5 afk en el otro team\n\na veces el modo es aburrido y otras veces es muy divertido!!!!!!!!","replies":[]},{"poster":"lordeman10","date":"2015-10-19T22:28:15.673+0000","up_votes":1,"down_votes":0,"body":"es algo para variar el lol si fuera tan bueno sería permanente pero cuando se juega mucho aburre, sobre todo porque el juego no está balanceado para el modo por lo que la gente que quiere ganar gana fácil pero sistemática/monotonamente mientras que el que quiere divertirse no puede ganar con lo que tampoco se divierte","replies":[]},{"poster":"xRayzencl68","date":"2015-10-17T08:39:17.333+0000","up_votes":1,"down_votes":0,"body":"Es que el problema son los campeones que eligen, como que les encanta elegir cosas de Late o free win... \n\nAhora que lo pienso, una buena idea seria una mezcla de URF + Uno para todos + Rey poro ARAM D:\n\nSeria la caga, 5 minutos el match xD","replies":[{"poster":"Xonxzender","date":"2015-10-19T22:10:00.364+0000","up_votes":1,"down_votes":0,"body":"Te falto el Hexakill :O","replies":[]}]},{"poster":"MATI TE AMO","date":"2015-10-19T19:00:46.608+0000","up_votes":1,"down_votes":0,"body":"Deberia estar en el Abismo de los Lamentos como en la grieta,, que encuentre partida,, no que sea personalizada , porque quitean cada 2x3 y nunca se manda la partida","replies":[]},{"poster":"Borriic II","date":"2015-10-19T00:25:03.973+0000","up_votes":1,"down_votes":0,"body":"La idea en si es muy buena, el problema es que lo quieras o no, mas de la mitad de los que juegan en este modo de juego, lo hacen porque quieren ganar y no divertirse (se estaran jugando la promo a challenger o algo)\n\ny esque claro eliges {{champion:99}} {{champion:122}} {{champion:55}} {{champion:86}} {{champion:429}} {{champion:114}} {{champion:41}} {{champion:74}}  y ya ganaste\n\nen el fondo se torna muy aburrido el juego, no por el juego en si sino por quienes lo juegan. Tambien en contraparte me toco jugar contra un premade que se sacaron {{champion:412}}  y si agarraban a alguien se ponian a jugar ping pong xD era muy gracioso de ver aunque perdi la partida me rei mucho tambien un premade de {{champion:223}}  nadie entendia nada ni sabia donde estaba fue muy gracioso","replies":[]},{"poster":"RavenBelmont","date":"2015-10-16T16:34:47.047+0000","up_votes":1,"down_votes":0,"body":"Ayer fuimos 5 {{champion:14}} contra 5 {{champion:37}} \n\nFue una mezcla de Hentai y Gore toda la partida.","replies":[{"poster":"Nitrobacter","date":"2015-10-16T17:31:28.880+0000","up_votes":1,"down_votes":0,"body":"Eramos{{champion:16}}  vs {{champion:203}} .Lo dejo a tu criterio...","replies":[{"poster":"SET0  KAIBA","date":"2015-10-17T10:39:09.219+0000","up_votes":1,"down_votes":0,"body":"y hoy fui en aram {{champion:76}}  vs {{champion:223}}","replies":[]}]}]},{"poster":"RedPoison","date":"2015-10-17T03:26:38.051+0000","up_votes":1,"down_votes":0,"body":"La verdad es ue tambien hubiera preferido Aram porque en la grieta se vuelve mas ''competitivo'' porque debes cojer objetivos barones bla bla bla.. encambio en aram  hubiera sido hostiones para todos lados xD","replies":[]},{"poster":"kaiser87","date":"2015-10-16T14:01:56.022+0000","up_votes":1,"down_votes":0,"body":"estaria bueno que lo pongan en aram tambien pero en la grieta esta bueno , pero aram estaria un poco mejor","replies":[{"poster":"Rogermen","date":"2015-10-17T00:27:06.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kaiser87,realm=LAS,application-id=v7qsfXsE,discussion-id=0y5stJIz,comment-id=0013,timestamp=2015-10-16T14:01:56.022+0000)\n>\n> estaria bueno que lo pongan en aram tambien pero en la grieta esta bueno , pero aram estaria un poco mejor\n\nAram si hay en personalizar","replies":[]}]},{"poster":"Alternis","date":"2015-10-16T21:49:40.163+0000","up_votes":1,"down_votes":0,"body":"jugue 2 partidas y me aburri .... primera me toco el nuevo champ vs lux ... perdimos obviamente y la segundo blitz vs gragas y ganamos pero mas alla de eso me aburri y no jugue mas ademas de que siempre quieren jugar con el nuevo champ o lux -.- con razon no se volvio a poner temporal desde hace 3 años  creo que hasta mapa de 3vs 3 del bosque retorcido es mas divertido que este modo , ojala pongan un modo de juego que se base en otra cosa o algo novedoso donde se puedan votar las reglas de la partida o algo asi","replies":[]},{"poster":"CheeseHead","date":"2015-10-16T20:55:04.443+0000","up_votes":1,"down_votes":0,"body":"La verdad que si, yo me esperaba que fuese en el abismo de los lamentos, no en la grieta del invocador... osea, es un modo para entrar y morir pero de risa con otros 9 invocadores jajajajaja para que tanto mapa si queremos entrar y reírnos un ratito y ya está? xD está bien, hay buffos y eso pero... ñe, para mí sería mucho más divertido en el hogar de los poritos :3 {{summoner:31}}","replies":[]},{"poster":"Sondorax","date":"2015-10-16T20:45:00.359+0000","up_votes":1,"down_votes":0,"body":"Para mi,ya lo dejo de ser,cada que quiero jugar una partida,trato de elegir un tanque para que podamos soportar en las peleas,pero no,\"ELIJAN A KINDRED O ME SALGO\" sinceramente,si no tienes pre-made,olvidate de jugar el modo","replies":[]},{"poster":"lKatsuo","date":"2015-10-16T20:35:24.096+0000","up_votes":1,"down_votes":0,"body":"Sería divertido si fuese One for URF en Aram","replies":[]},{"poster":"Ode to dark","date":"2015-10-16T20:14:33.470+0000","up_votes":1,"down_votes":0,"body":"En mi opinión es muy divertido si juegas con premade pero solo es para pasarlo más nada más.","replies":[]},{"poster":"panther189","date":"2015-10-16T19:52:54.949+0000","up_votes":1,"down_votes":0,"body":"Estoy completament de acuerdo, es muy aburrido jugar en la grieta, en el mapa aram hubiera sido mejor, aca tenes que preocuparte de farmear ganar exp, sino te quedas atras. mas con que te separas por linea. es muy aburrido.\nLa unica partida que la disfrute fue cuando jugue con blitz y fuimos todos mis. sino donde esta la gracia de elegir blitz y hacer linea solo.\nTambien lo que jode es que no es uno para todos como el año pasado en el mapa aram, los diez un mismo personaje.\nA veces te toca muy desparejo y te aburres esperando los 20 min.\nbardos vs ziggs.\nlee sin vs heimers.\nfueron terribles emboles.\nLa que mas me diverti fue alistars vs tams y blitz vs gnars.","replies":[]},{"poster":"Sir AZØR","date":"2015-10-16T18:04:17.452+0000","up_votes":1,"down_votes":0,"body":"Yo creo que hubiera sido mas divertido jugar en 'El Abismo de los Lamentos' {{champion:127}}","replies":[]},{"poster":"Shacoan","date":"2015-10-16T14:22:50.750+0000","up_votes":1,"down_votes":0,"body":"Es que estás obligado a jugar con champs que tal vez no te gusten o simplemente sean malisimos para jugar en este modo, yo jugué una todos Lee Sin y me encantó, fue muy divertido, pero después me tocó una all Kalista y fue aburridisimo, tal vez sí estaría mejor en el Abismo...","replies":[{"poster":"rokushoger","date":"2015-10-16T17:17:56.595+0000","up_votes":1,"down_votes":0,"body":"Tal cual, es esto lo que pasa, yo jugue una blitz vs tahm kench, y por dios, fue la mejor partida que jugué en este modo, después jugue una todos ziggs y casi me duermo.","replies":[]}]},{"poster":"camara de luz","date":"2015-10-16T17:16:42.518+0000","up_votes":1,"down_votes":0,"body":"a mi me encanta el modo porque elegis pj que nunca jugaste anda con 3 amigos y elegi EL QUE USTEDES QUIERAN y esta copado hasta probas champs COMO {{champion:157}}  kjkdajkfdjagkjdfakgj (backdoor {{champion:64}}  {{item:3340}} OPSSSSS xd)","replies":[]},{"poster":"Zevko","date":"2015-10-16T06:33:21.417+0000","up_votes":1,"down_votes":0,"body":"es aburrido cuando todo el team enemigo se arma tanque","replies":[{"poster":"FurchiDC","date":"2015-10-16T07:05:15.554+0000","up_votes":1,"down_votes":0,"body":"Tal cual, hoy eramos 5 Riven contra 5 Nasus full armor... un embole.","replies":[{"poster":"Zevko","date":"2015-10-16T17:13:09.270+0000","up_votes":1,"down_votes":0,"body":"Tipo , empieza bien y despues la ganan tankeando no podes hacer nada se hacen 5 items de armadura y botas y ganaron y no podes hacer nada para evitarlo","replies":[]}]}]},{"poster":"Anniequiladora","date":"2015-10-16T16:23:00.082+0000","up_votes":1,"down_votes":0,"body":"Juegalo con amigos en skype , es muy divertido , me acuerdo que jugamos 5 shacos contra 5 gp , a nivel 1 hicimos una barrera de cajas y no podian pasar XDD era para matarse de risa","replies":[]},{"poster":"Rho","date":"2015-10-16T15:43:58.055+0000","up_votes":1,"down_votes":0,"body":"Cero innovación.\n\nSaludos {{champion:37}}","replies":[]}]}