{"poster":"GragriQuinzel","date":"2016-09-26T13:37:30.905+0000","title":"Prendere S con Orianna","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Salve a tutti! per chi volesse aggiungermi sono GragriQuinzel! Sono un po&#039; in difficolt&agrave; perch&egrave; amante del campione Orianna non riesco mai a prendere una dannata S con lei!! anche quando vado benissimo...niente al massimo un A+! Da cosa pu&ograve; dipendere? Io amo principalemente giocare mid (uso per il momento solo Orianna! ) e adesso vorrei spaziarmi con il jungler! Grazie a chi mi risp! Ciao!","replies":[{"poster":"vondarck","date":"2016-09-26T13:43:51.620+0000","up_votes":1,"down_votes":0,"body":"orianna è un bel champ, forse tra i mid che preferisco avere IN squadra (spesso sono l'unico che prende sempre fighter/tank, quindi ogni forma di scudo è GRADITISSIMA)\n\ndi solito i giudizi con cui puoi prendere a/s ecc sono in base al farm, le ward e il KDA e al ruolo (esempio, orianna jung avrà + facilità a prendere S perchè non la gioca NESSUNO, e ci sono i suoi motivi...)","replies":[{"poster":"GragriQuinzel","date":"2016-09-26T13:49:31.944+0000","up_votes":1,"down_votes":0,"body":"mhm...infatti vedendo qualche youtuber koreano ho notato che la fanno giocare anche in jungler! Allora di tanto in tanto ci provo anche io quando ho tempo e sono avantaggiata mi butto in jungler...ho perfezionato anche la build che è questa -->{{item:1056}} {{item:3027}} {{item:3020}} {{item:3151}} {{item:3115}} {{item:3135}}  perchè ho capito che se devo fare molti danni e kills...devo aumentare la penetrazione magica...però mi chiedo se non è anche il fatto che la gioco poco come support...","replies":[{"poster":"Ste the ripper","date":"2016-09-26T14:11:47.855+0000","up_votes":1,"down_votes":0,"body":"Non va bene quella build, devi fare morello, rilay, rabadon, void staff, ultimo oggetto situazionale, puoi valutare abyssal e zhonya principalmente.\n\nIl luden a meno che tu non stia snowballando in modo osceno è un pessimo item per orianna perché la passiva va quasi sempre sprecata sui minion e non sui champ nemici.","replies":[{"poster":"vondarck","date":"2016-09-26T14:40:04.656+0000","up_votes":1,"down_votes":0,"body":"quindi alla fine si traduce in una Q spam e AA, quando si avvicina ti scudi e usi la W e ancora AA? (parlo di fase di linea)\n\nin team fight scudo su \"quel povero maledetto yolo dentro al fight\" e R?\n\nscusa la banalizzazione ma è per avere un idea di base del champ O_O","replies":[{"poster":"Ste the ripper","date":"2016-09-26T15:11:31.642+0000","up_votes":3,"down_votes":0,"body":"Orianna in lane si basa sul zonare l'avversario attraverso la palla e creare zone dove l'avversario non può andare.\nIn late se hai un engager metti la palla sopra di lui, se non ce l'hai lasci la palla/ sposti la palla in zone diverse per creare anche lì situazioni dove puoi ultare i carry.\nOrianna è un control mage, si basa tutto sul saper creare queste zone di influenza.\n\nIn lane i trade con gli aa sono buoni, specie grazie al thunderlord e allo scudo è facile fare trade vantaggiosi.\nIn late una volta landata una buona ulti continui a spostare la palla in continuazione cercando di aiutare e fare danni contemporaneamente.\n\nè un campione concettualmente abbastanza facile, tolta la ulti il resto è un semplice: spammo skill e cerco di fare danni.","replies":[{"poster":"vondarck","date":"2016-09-26T15:31:17.437+0000","up_votes":1,"down_votes":0,"body":"domanda da nubbio, se spammi skill perchè non le si builda {{item:3100}} ?\n\nè buona a tirare giù le strutture? (era un champ che tempo fa valutavo di prendre)\n\ncome la avevo pensato io era un champ che usava la palla per rallentare il nemico (col rilay) mentre lo picchio con gli AA, sarebbe stato un danno continuo piuttosto che un danno burst\n\npoi ribadisco, mi baso solo su \"quello che ho pensato quando la ho letta\"","replies":[{"poster":"Ste the ripper","date":"2016-09-26T15:44:56.323+0000","up_votes":2,"down_votes":0,"body":"Perché porti molti più danni e utility andando full ap, inoltre mentre in lane gli aa si fanno decisamente sentire grazie alla passiva, in late perdono molti danni.","replies":[]}]}]}]}]},{"poster":"vondarck","date":"2016-09-26T14:25:15.099+0000","up_votes":1,"down_votes":1,"body":"guarda http://euw.op.gg/champion/orianna/statistics/mid\n\ncome la giochi te mi piace come idea di base, per me orianna deve essere QUEL mid che è molto resistente però ti consiglio ASSOLUTAMENTE CDR e {{item:3116}} \n\npoi purtoppo io non sono poertati per champion squinsy, quindi la giocherei molto resistente\n\nrosse: AS\ngialle: HP flat\nblu: CDR flat\n5th: AP\n\n{{item:3027}} {{item:3009}}  {{item:3165}} {{item:3040}}  {{item:3116}}  {{item:3089}} \n\nha degli ottimi scailing la Q che verso fine game è spammabile fa un 50% AP e il rsto praticamente scala bene sia in maniera offensiva che difensiva\n\nperò a vedere dal sito che ti ho consigliato effettivamente se vuoi un mid che ti da scudi OP è meglio {{champion:117}}\n\nP.S. non sono un orianna main, parlo a titolo: se dovvessero darla in mano a me","replies":[{"poster":"GragriQuinzel","date":"2016-09-26T18:04:20.774+0000","up_votes":1,"down_votes":0,"body":"Raga! Allora ho appena fatto una precedente battaglia! Ho modificato questo--> {{item:3135}} con questo--->{{item:3116}}  è andata ancora meglio! Per i precedenti utenti che mi avevano consigliato un altro tipo di build...cioè praticamente quella che consiglia anche il gioco...l'ho già provata...ed è uno schifo...niente danni ....muori in continuazioni...perchè orianna da quanto ho capito è lenta ...nn ha una buon difesa...appunto perchè un mago! La mia build secondo il mio modesto parere è ottima! Orianna è una midlaner...e deve fare i danni...deve fare kill...anche perchè ho seguito anche degli youtuber stranieri dove appunto (non dico uguale la mia build) utilizzavano alcuni oggetti della mia build...! Questo per dire...l'ho provata in mille modi anche con il calice...ancora peggio! Ho letto stesso anche nel forum che dipende se hai fatto più kill degli altri..quanti minion hai ucciso ...se hai  fatto molte KDA....praticamente i support prendono S facilmente...la mia ory purtroppo c'è ne vuole...io con la mia build prendo al massimo A+...ma con la vecchia build...C ...anche D....la cosa bella di questo champ che non si smette mai di impararlo...io adoro orianna è il mio personaggio preferito in assoluto! Mi dovrà capitare una partita fortunata? Chissà! Spero che domani mettano il Kindred....vorrei cominciare ad allenarmi come jungler! {{champion:61}}","replies":[{"poster":"vondarck","date":"2016-09-27T07:24:22.158+0000","up_votes":1,"down_votes":0,"body":"in realtà la build che ti consigliano è ottimale per il champ, semplicemente sei agli \"inizi\" e per te ci sono ancora alcune meccaniche complicate, ti dico che sono partito giocando in jungla {{champion:106}} settato full tank, e quando ho preso {{champion:121}} lo buildavo col {{item:1401}} perchè non ero abituato a subire tutti quei danni\narrivato al livello 4 ho iniziato a capire come gira il champ e a dove come ingaggiare, poi sono passato al {{item:1400}} \nalla fine mi sono costruito la mia build e ora worka bene, però ho dovuto fare un sacco di prove..","replies":[{"poster":"GragriQuinzel","date":"2016-09-27T07:36:40.376+0000","up_votes":1,"down_votes":0,"body":"Infatti sono iniziata così...con il morello ecc...poi ho visto che dovevo cambiare qualcosa e l'ho modificato e ce ne ho messo di tempo xD! Adesso ho il kindred nella rotazione...speriamo che come prima volta da jngl non faccio un flop! xD","replies":[{"poster":"Frattaglia","date":"2016-09-27T07:48:48.781+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GragriQuinzel,realm=EUW,application-id=cAOZwaUi,discussion-id=oRhEhNhA,comment-id=000000000002000100000000,timestamp=2016-09-27T07:36:40.376+0000)\n>\n> Infatti sono iniziata così...con il morello ecc...poi ho visto che dovevo cambiare qualcosa e l&#x27;ho modificato e ce ne ho messo di tempo xD! Adesso ho il kindred nella rotazione...speriamo che come prima volta da jngl non faccio un flop! xD\n\nBasta che non fai come facevo io le prime partite, che invece di saltare indietro per kitare i campi saltavo in faccia ai mostri dei suddetti campi (prendendo una marea di danni) xD","replies":[{"poster":"vondarck","date":"2016-09-27T07:53:18.226+0000","up_votes":1,"down_votes":0,"body":"ho avuto lo stesso problema all inzio,non sono capace di fuggire da nulla XDDD","replies":[]}]},{"poster":"vondarck","date":"2016-09-27T07:43:31.816+0000","up_votes":1,"down_votes":0,"body":"madonna.. è complicatissimo kindred come jung\n\nVERAMENTE TANTISSIMA FORTUNA E MIGLIORI AUGURI","replies":[]}]}]}]}]},{"poster":"Frattaglia","date":"2016-09-26T14:05:25.602+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GragriQuinzel,realm=EUW,application-id=cAOZwaUi,discussion-id=oRhEhNhA,comment-id=00000000,timestamp=2016-09-26T13:49:31.944+0000)\n>\n> mhm...infatti vedendo qualche youtuber koreano ho notato che la fanno giocare anche in jungler! Allora di tanto in tanto ci provo anche io quando ho tempo e sono avantaggiata mi butto in jungler...ho perfezionato anche la build che è questa --&gt;{{item:1056}} {{item:3027}} {{item:3020}} {{item:3151}} {{item:3115}} {{item:3135}}  perchè ho capito che se devo fare molti danni e kills...devo aumentare la penetrazione magica...però mi chiedo se non è anche il fatto che la gioco poco come support...\n\nNon è molto ottimale la tua build, il bastone secolare non è molto utile perché orianna non deve tankare (e devi stare attento a non andare fuori posizione però, è uno di quel campioni in cui non devi mai trovarti nel posto sbagliato), il dente di nashor penso che si abbiano poche occasioni per utilizzarlo e quindi penso sia un po' sprecato. \n\nIn linea di massima prova con questa build:\n{{item:3165}} {{item:3285}} {{item:3020}} {{item:3089}} {{item:3135}} {{item:3157}} (puoi invertire alcuni oggetti in base alla necessità).\n\n\nLa differenza tra {{item:3135}} e {{item:3151}} è che danno entrambi penetrazione magica ma il primo la ignora in generale mentre il secondo fa danni percentuali in base alla vita del campione che li subisce e aumenta i danni se l'avversario è rallentato. In generale dovresti scegliere il primo se giochi contro campioni che si fanno oggetti da resistenza magica, il secondo se giochi contro campioni molto tank (Mundo, Garen, etc). Il secondo è buono su campioni che rallentano o con molti danni base (i funghi di Teemo, Singed dopo che ha chiuso il Rilay, qualsiasi campione che si faccia il Rilay, Zyra), il primo invece va bene in generale su tutti.\n\nSu Orianna è meglio il bastone del vuoto, salvo casi particolari. :)\n\np.s. la penetrazione magica ti aiuta a fare danni se gli avversari hanno oggetti da resistenza magica, ma se non hanno oggetti di resistenza magica a volte possono bastare i calzari del mago.","replies":[{"poster":"vondarck","date":"2016-09-26T14:34:31.182+0000","up_votes":1,"down_votes":0,"body":"conta che è livello 22, probabilmente fa quella build perchè ha difficoltà a hittare con la Q rispetto agli AA\n\nperò hai giustamente detto che il nashor ci sono poche occasioni di usarlo, meno che non buildi anche un {{item:3116}} \npiuttosto che stroncargli la build avrei provato a ottimizzargliela, poi magari nel tempo si informa e si corregge da solo\n\nanche se meno popolare si può fare \"on hit orianna\" anche se forse a quel punto è meglio un {{champion:10}}","replies":[]}]}]}]},{"poster":"Squacquerone","date":"2016-09-27T07:53:52.284+0000","up_votes":1,"down_votes":0,"body":"Se mi posso permettere ,prova a fare 10 game ora con la build consigliata dal gioco : se prende i C o D come dici non è colpa della build ( io ci prendo S+ tranquillamente con quella) ma probabilmente di come giochi tu. Fidati, se è consigliata un motivo ci sarà ! Mi ricordi me agli inizi che buildavo la Goccia su Brand e il bastone magico su Jinx o.o","replies":[]}]}