{"poster":"BeschiEmi","date":"2016-04-23T09:26:40.709+0000","title":"Unfaire Bestrafung  mittels Leave Buster !! Apell an die Comunity !! KILLUMINATI4WAKEUP xD","subforum":"Hilfe & Support","up_votes":1,"down_votes":10,"body":"Hallo liebes Riot games Team und verehrte Lol zocker.  Ist euch das schonmal passiert oder habt ihr davon nur etwas &uuml;ber freunde aufgeschnappt ?\r\nDie Rede ist vom  v&ouml;llig veraltetem Leave Buster system !!! Ich wollte neulich eine runde ranked zocken  doch als das Game startete und die spieler ladeten reagierte der Lol client  nicht mehr !! Also musste ich lol neustarten . So kam es das ich wieder im Game war  nach mehreren minuten . Nach dem Spiel erhielt ich eine Warung von Riot games das  ich jetzt in eine EInreihung mit niedriger Priorit&auml;t eingereiht wurde !! NUN habe ich einen Leave buster f&uuml;r 5 games und muss je Game immer 20 minuten im Vorraus warten ! \r\nIch nenne das v&ouml;llig banal und unfair ich hab netmal getrollt oder das game absichtlcih verlassen es war ein Fehler von Riot games und net meiner  und ich muss jetzt die Konsequenzen tragen .\r\nDieser beitrag soll ein Apell an alle sein die das veraltete und unfaire Leave Buster system  genau wie ich zum kotzen finden . Lasst uns in den Foren diskutieren!! Rito muss unsere Meinung akzeptieren das Leave Buster system muss  komplett erneuert werden voralllem sollen unschuldige nicht  daran leiden so wie ich nur weil Riot games es nciht auf die Reihe kriegt ihr spiel gescheit zum laufen zu bringen ... Vergesst nicht alleine sind wie schwach zusammen sind wir stark wir m&uuml;ssen  jeden der der Selben Meinung ist  schnell auf unsere Seite ziehen damit Riot seine Fehler nicht mehr unter den Tisch kehren kann !","replies":[{"poster":"Alustus","date":"2016-04-23T10:08:19.621+0000","up_votes":2,"down_votes":0,"body":"Sorry aber wegen 1 Spiel bekommt man keinen Leaverbuster.\nHatte die letzten 2 Wochen selber einige Probleme mit dem Internet sprich ich hatte öfters dc und musste dann das Spiel neu starten.\nKomischerweise habe ich nicht einmal eine verwarnung bekommen.\n\nWelche man normalerweiße vor einer Leaverbuster Strafe bekommt.\n\nDa das System AFK/DC automatisch erkennt sprich man muss nicht reported werden, halte ich es für ziemlich unrealistisch dass du wegen 1 Spiel einen Leaverbuster bekommen haen sollst.\n\nMeiner Meinung nach ist das System sogar zu nett. mMn hätte ich nämlich in den letzten 2 Wochen 1 Leaverbuster verdient gehabt.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T10:33:21.716+0000","up_votes":1,"down_votes":2,"body":"Ich bin das ganze Jahr nirgendwo geleaved .  davor nur wegen störungen oder bugsplashes usw also sachen wofür cih eigendlich nicht direkt die schuld trage . Und ich have wirklich eine lange zeit keine störungen in Lol  nur diese eine und dadurch hab ich nen LB bekommen . \nich suche grad im support aber ich finde nichts zu meinem poblem gibt es eine möglichkeit riot games direkt anzurufen??","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-23T11:40:15.715+0000","up_votes":2,"down_votes":0,"body":"technische schwierigkeiten sind von dir selbst zu lösen. es gitb dazu viele tipps und vorschläge wie man sämtliche probleme beheben kann.\num 5x20 minuten zu bekommne musst du schon des öfteren gefehlt haben.\nda die probleme also häufig auftreten solltest du versuchen diese zu beheben.\nfalls die probleme doch nciht häufig auftauchen heißt das, dass du des öfteren afk warst ohne probleme zu haben, was die strafe ebenfalls rechtfertigt.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:50:23.916+0000","up_votes":1,"down_votes":3,"body":"Wie soll  ich das bitte von mir selbst lösen bin ich informatiker ???\nmach mal deine Tunnelvision aus .. Ich bin niemand der ein Game leaved !!! Und es ist nicht meine schuld wenn das Programm net gescheid läuft !!  und Die Strafe ist nicht gerecht .","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-23T13:53:34.738+0000","up_votes":1,"down_votes":0,"body":"wenns bei allen läuft außer bei dir ist der fehler wohl bei dir. das ist die kernaussage.\nwenn es bei dir nicht geht und dir das bewusst ist, du aber trotzdem spielst ruinierst DU den anderen das spiel und nicht rito.","replies":[]},{"poster":"legofreak1","date":"2016-04-23T13:53:25.477+0000","up_votes":1,"down_votes":0,"body":"Wenn du technische Probleme mit dem Client hast, kann und wird der [Support](https://support.riotgames.com/hc/de/requests/new) dir helfen. Wenn du technische Probleme mit deinem PC hast, dann bist du für diese verantwortlich. Kannst du diese nicht alleine lösen, findest du in zahlreichen Internetforen Hilfestellung oder du bringst den PC zum Fachmann.","replies":[]},{"poster":"Patty91","date":"2016-04-23T13:53:13.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeschiEmi,realm=EUW,application-id=7hciEY9w,discussion-id=mdi8yT7z,comment-id=0004000000000000,timestamp=2016-04-23T13:50:23.916+0000)\n>\n> Wie soll  ich das bitte von mir selbst lösen bin ich informatiker ???\n> mach mal deine Tunnelvision aus\n\nIch find das ja geil. Bezichtigst andere einer \"Tunnelvision\", hast diese aber selbst. Sagst, du seist kein Informatiker, bist aber dennoch der festen Überzeugung, dass der Fehler unter keinen Umständen auf deiner Seite liegen kann.\nFür dich würde ich mir ja den Perma wünschen.","replies":[]}]}]}]}]},{"poster":"Nycaria","date":"2016-04-23T09:30:43.136+0000","up_votes":2,"down_votes":1,"body":"Vom einmal AFK sein (ob beabsichtig oder nicht spielt keine Rolle) bekommt man keine 5x20 Minuten Q vor dem Game.Dafür musst du schon mehrere Games geleavt haben. \n\nDer Leaverbuster ist gut so wie er ist.Leute die oft AFK sind werden bestraft und Leute die nicht AFK gehen dürfen spielen ohne davor zu warten -> Find ich fair und ich denke,dass der Großteil der Community das genau sieht.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:45:21.193+0000","up_votes":1,"down_votes":1,"body":"Wie gesagt ich spile das game schon jahre lang !!  und es ist immer wieder passiert wegen mehreren gründen .\nDer Support kann mir net helfen toll .  und jetzt hör auf die welt  mit deiner Tunnelvision zu sehen danke","replies":[{"poster":"Yaxtee","date":"2016-04-23T16:46:03.419+0000","up_votes":1,"down_votes":0,"body":"Das hat damit nichts zu tun. Wenn du Probleme hast mit deinem PC oder Internet bist du dafür selbst verantwortlich. Wenn du dann Spiele verlässt, schlägt der leaverbuster eben an. Da musst du deine Probleme schon beheben, bzw. dir helfen lassen dies zu tun.","replies":[]}]}]},{"poster":"SorisDynasty","date":"2016-04-23T09:29:04.228+0000","up_votes":2,"down_votes":1,"body":"Um 20 Minuten zu kriegen musst du mehr als 1x afk gewesen sein. Ansonsten - dem System ist es egal, WARUM du nicht am Spiel teilnimmst. In dem Moment, wo du nicht am Spiel teilnimmst, ruinierst du bis zu 9 Spielern ihre Spielerfahrung. Der Leaverbuster soll dir zeigen, dass das nicht okay ist. Du kannst jetzt lieber daran arbeiten, auftretende Probleme zu beheben.\nAlso ja, es ist deine Schuld. Alleine weil du nicht zum ersten Mal afk warst.","replies":[]},{"poster":"BeschiEmi","date":"2016-04-23T09:32:55.023+0000","up_votes":1,"down_votes":5,"body":"Jungs ich habe meinen acc schon sehr sehr lange .  Und ich wahr lange nicht afk gewesen also bitte  Die meiste Zeit über  bin ich ein gutes Comunity mitglied und weder Toxic noch sonst irgendwas . Egal ob Ihr mir glaub oder nciht diesen Leave Buster jetzt hab ich sicher nciht verdient !!!\nAußerdem bin ich wieder ins Game eingestiegen und habs mit Teemo jungle gecarryt diese Probleme mit dem Lol client kamen schon öfter vor ich war selten akf und wenn dann nur aus echten notfällen","replies":[{"poster":"Rucking Fiot","date":"2016-04-23T12:48:07.251+0000","up_votes":1,"down_votes":0,"body":"Hast du verdient, weil TEEMO!\nNein, Spaß xD\nHatte zwar selbst nie nen Leave Buster, hab allerdings paar Freunde, bei denen es auch \" ungerecht\" war.. Ich will das jz nicht genau beurteilen, ABER: wenn man ein mal kurz Afk ist/zu spät joint, bekommt man keine Strafe. Rest brauch ich nicht dazuzuschreiben, kann man sich ja denken.\nIch finde allerdings, dass 5x20min bisschen zu viel Strafe ist :/\nNaja... muss man halt jz so hinnehmen wie es ist ._.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:44:02.615+0000","up_votes":1,"down_votes":1,"body":"Teemo ist coool :(","replies":[{"poster":"Rucking Fiot","date":"2016-04-23T13:46:42.829+0000","up_votes":1,"down_votes":0,"body":"Nicht wenn du gegen ihn spielst :o","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:51:14.972+0000","up_votes":1,"down_votes":1,"body":"ja und was ist mit Darius xDD","replies":[{"poster":"Rucking Fiot","date":"2016-04-23T13:55:35.826+0000","up_votes":1,"down_votes":0,"body":"Darius kann man ez countern... teemo kommt aus dem nichts un killt dich... bzw sein pilzgift","replies":[{"poster":"BeschiEmi","date":"2016-04-23T16:47:48.043+0000","up_votes":1,"down_votes":1,"body":"ehm :D ich bin net besonders gut mit Teemo","replies":[]}]}]}]}]}]},{"poster":"Nycaria","date":"2016-04-23T09:36:48.640+0000","up_votes":3,"down_votes":1,"body":"Ob du toxic bist oder nicht hat nun wirklich nichts mit dem Leaverbuster zu tun ;)\nDas Leaverbuster-System verteilt keine Strafe wenn du wirklich nur einmal AFK warst (außer du hattest davor schon einen Leaverbuster,dann ist das möglich glaube ich) und das ist einfach eine Tatsache.\nAlso ist dein Leaverbuster sehr wohl verdient,ob du es hier nun zugibst oder nicht.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T09:44:52.780+0000","up_votes":1,"down_votes":5,"body":"Ich wurde schon öfter mittels des \"Leave Buster systems\" bestraft das geb ich zu aber in den meisten der Fällen war es nciht meine schuld sondern Riot games schuld .\nDas ist die Wahrheit und ich bin mir sicher es gibt da draußen noch andere wie mich die grundlos bestraft werden on du mir nun glaubst oder nciht spielt keine Rolle aber bedenke mal . was wenn ich recht habe ? \nWenn ich schuld daran gehabt hätte würde ich die Strafe einfcah annehmen und runterschlcuken abwarten bis es vorbei wäre aber Ich trage diesesmal echt keine schuld die die etlichen male davor auch nciht !  \nIch bin verdammt wütend auf Riot games  weil ich grundlos bestraft werde  und genau deswegen wende ich mcih hier auch an die Comunity  Macht echt sinn oder =9 ?","replies":[{"poster":"Nycaria","date":"2016-04-23T09:50:07.764+0000","up_votes":1,"down_votes":0,"body":"Und was soll die Community bitte bezwecken? Leaverbuster werden nunmal nicht aufgehoben (zumindest wäre mir das neu) und selbst wenn müsstet du dich dafür an den Support wenden.Wenn dein Game crasht ist das **deine** Schuld nicht die von Riot.\nInwiefern sollen denn die anderen Leaverbuster Riot's Schuld gewesen sein? Du hast dafür Sorge zu tragen,dass dein Spiel/Internet und was weiß ich noch alles funktioniert.Natürlich kann es auch mal kleinere Probleme mit den Servern geben,dass man beispielsweise nicht ins Spiel rein kommt,aber das passiert nie im Leben so oft,dass du mit einem Leaverbuster bestraft wirst.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T09:55:43.629+0000","up_votes":1,"down_votes":5,"body":"doch das passiert so oft mein Freund . Inwiefern ist das bitte meine schuld wenn lol buggy ist ?? \nein Freund von mir hat sogar ncoh größere Probleme der kommt nämlich garnerd mehr in seinen acc .\nund ich hab  gott sei dank nen stabilen Ping .\nEs liegt an Riot Games ansonsten kann ich mir das nciht erklären ich leave doch keine Games wenn ich aus der Elo Hell raus will  xDD","replies":[{"poster":"Humpelstilzche","date":"2016-04-23T10:20:13.902+0000","up_votes":2,"down_votes":0,"body":"> Es liegt an Riot Games ansonsten kann ich mir das nciht erklären\n\nSorry, aber ich fürchte du machst es dir etwas zu einfach, wenn du einfach alle Schuld auf Riot ablädst. Wäre LoL generell fehlerhaft, hätte JEDER diese Probleme. Dies ist aber nicht der Fall. Der Fehler liegt irgendwo auf deiner Seite. Ich persönlich kann dir da nicht helfen, ich bin nicht so der Technik-Spezialist. Beim Support von Riot oder im Hilfe&Support Forum kannst du jedoch Hilfe bekommen. Aber gleich als Vorwarnung: Wenn du da deine technischen Probleme auch einfach mit \"Das ist Riots Schuld\" abtust, wird die Fehlersuche wohl nicht von viel Erfolg gekrönt sein ;)\n\nIch wünsch dir viel Glück bei der Behebung deines Problems und empfehle dir, bis das Problem behoben ist, kein LoL merh zu spielen. Du bist bereichts bei der höchsten Low-Priority-Q-Strafe angekommen, d.h. als nächstes kommt nur noch der Permabann. Weder du noch sonst irgendwer will dass das passiert, also kümmer dich um deine Technik BEVOR du wieder spielst.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T10:26:11.277+0000","up_votes":1,"down_votes":1,"body":"Vielen dank für deinen hilfreichen Beitrag könntest du mir eventuell zeigen wo und wen ich ansprechen muss in dieser Sache ? denn ich weiß es nicht .\n\nPs: DRAAAAVEEEEN","replies":[{"poster":"Humpelstilzche","date":"2016-04-23T10:30:14.820+0000","up_votes":1,"down_votes":0,"body":"Auf der linken Seite dieser Seite findest du die Forenübersicht, dort findest du auch das Hilfe&Support-Forum. Wichtig: Vorher die dort angepinnten Threads lesen.\n\nGanz oben auf der Homepage in der Leiste steht \"Support\", darüber gelangst du zum Riot Support.","replies":[]}]}]},{"poster":"Alustus","date":"2016-04-23T10:11:25.904+0000","up_votes":1,"down_votes":0,"body":"LoL ist im Moment nicht Buggy sprich der Fehler liegt irgendwo bei dir.\n\nSei es eine fehlerhafte installation der Internetprovider, Interneteinstellungen, Antivirus, Hardware","replies":[]},{"poster":"Spicavius","date":"2016-04-23T10:16:16.292+0000","up_votes":1,"down_votes":0,"body":"Hmm seltsam ich habe keine Probleme bzw seeeehr selten und deswegen bestraft mich der Leaverbuster auch nicht.\nKomisch dass du andauernd Probleme hast und ich und viele weitere eher selten.\n\nIch denke, dass du dich mal hinsetzen solltest und im \"Hilfe und Support\" Forum fragen solltest, was du tun sollst bzw kannst du dir die Anleitung durch lesen, welche die meisten Probleme behebt.\n\nEs ist deine Schuld, dass du nach mehrmaligen Bugs dich nicht hinsetzt und nicht herausfindest wieso du jetzt Probleme hast und andere nicht.\nDas nennt sich Faulheit. Du bist in diesem Punkt einfach faul gewesen, während andere sich hingesetzt haben und ihr Problem gelöst haben. Ganz einfach.\nAlso doch du bist Schuld, dass es soweit gekommen hast, dass du nun vor jedem Spiel 20 Minuten warten musst.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T10:24:51.438+0000","up_votes":1,"down_votes":2,"body":"Das Problem ist einfach  manchmal geht lol und manchmal halt nciht . und deswegen gleich nen leave buster bekommen find ich mal ganz schön krass das hat nichts mit Faulheit zu tun .","replies":[]}]}]}]},{"poster":"SorisDynasty","date":"2016-04-23T09:47:30.229+0000","up_votes":1,"down_votes":0,"body":"Es gibt nur mehr als genug Fälle, wo die so genannten \"Unschuldigen\" Lügen das sich die Balken biegen, nur um ihre Strafen loszuwerden.\nUnd ja. Du wurdest mehrfach bestraft. Du hast nie die Probleme gefixed (ansonsten würde sowas wesentlich häufiger passieren, wenn das von Riot aus passiert - also wesentlich mehr Aufschreie), du wirst bestraft. Besonders, wenn du bereits LB hattest, ist das System empfindlich auf dich.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T09:51:39.040+0000","up_votes":1,"down_votes":5,"body":"Leute im ernst jetzt glaubt ihr ich hätte nichts besseres zu tun als euch jetzt von meiner Unschuld zu überzeugen ? \nIch bin kein Leaver ich weiß wie sich das anfühlt wenn man 4 v 5 spielt  im ranked und dann ncoh verliert .\nAAAAAAABERR ich  wurde mal wieder grundlos bestraft von diesem ach so fehlerfreien system das ihr in den Himmel lobt . ich find das einfach nicht toll ich will nciht das meine Strafe jetzt verschwindet ich will einfach nur das wenn cih schon einen LB kriege es wenigstens meine eigene Schuld ist und nciht weil ich das game restarten musste weil es nciht gestartet ist .","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-23T11:45:06.140+0000","up_votes":1,"down_votes":0,"body":"wie eben schon erwähnt: gehäufte technische probleme sind auch dein fehler.\ndas spielt läuft bei den meisten einigermaßen fehlerfrei, weshalb es nciht an rito liegt, wenn es bei dir nicht läuft. sowas liegt in den meisten fällen beim benutzer, weshalb dieser auch bestraft ird, wenn er trotz behebbarer probleme munter weiterspielt. (es sind übrigens nahezu alle probleme behebbar)","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:46:24.800+0000","up_votes":1,"down_votes":2,"body":"Wie zur hölle soll das mein Fehler sein xDDDDDD  \nRiot soll einfach aufhören unrechtmäßig Lb s zu verteilen die müssen den mal updaten","replies":[]}]}]}]}]}]},{"poster":"Pengu Healer","date":"2016-04-23T11:33:27.081+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeschiEmi,realm=EUW,application-id=7hciEY9w,discussion-id=mdi8yT7z,comment-id=0002,timestamp=2016-04-23T09:32:55.023+0000)\n>\n> diese Probleme mit dem Lol client kamen schon öfter vor ich war selten akf und wenn dann nur aus echten notfällen\n\nWenn du ein Splash Bug hast sieht es in den meisten Fällen wie folgt aus : Du kommst solange nicht in das Game rein bis es gestartet habt, wenn du Dynamic Spielst sagt dir dein Kumpel einfach wann ihr dran seit und fertig. Wenn du alleine Spielst, probieren geht über  Studieren. {{summoner:31}} {{summoner:31}} {{summoner:31}} {{sticker:slayer-pantheon-thumbs}} {{sticker:slayer-pantheon-thumbs}} {{sticker:slayer-pantheon-thumbs}} {{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"BeschiEmi","date":"2016-04-23T13:47:09.379+0000","up_votes":1,"down_votes":1,"body":"geile Memes :D  hmm ja ich spiele meistens allein ^^","replies":[]}]}]},{"poster":"Sree","date":"2016-04-23T10:00:09.267+0000","up_votes":1,"down_votes":0,"body":"Der Leaverbuster besitzt Toleranzgrenzen bevor er Strafen verteilt. Und selbst wenn er Strafen verteilt, dann erstmal 5 oder 10 Minuten. Wenn du schon bei 20 Minuten angekommen bist, kommt das bei dir offensichtlich recht haeufig vor, auch wenn du das anders siehst.\n\nSolltest du technische Probleme mit dem Spiel haben, erklaere so genau wie moeglich, was fuer Probleme du hast. Dann koennen wir versuchen dir zu helfen. Was dir auf jeden Fall nicht helfen wird, ist einfach zu sagen 'ist nicht meine Schuld'. Der Leaverbuster ist ein automatisiertes System. Es interessiert letzendlich nicht, warum du leavest/afk bist. Es zaehlt nur, dass du es bist. Und wenn das zu haeufig passiert, springt er eben an.","replies":[{"poster":"BeschiEmi","date":"2016-04-23T10:34:15.864+0000","up_votes":1,"down_votes":1,"body":"wie gesagt ich spiele lol seit einer seeeeeeeeehr langen zeit  und es ist schon öfter vorgekommen das lol abstürzt und ich deswegen nen LB bekam deshalb die lange zeit","replies":[]}]}]}