{"poster":"Nogalokey","date":"2015-08-11T08:39:52.956+0000","title":"RIOT, A NEW ANNIVERSARY EVENT","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"**TLDR**: Bring the old maps (season 1,2,3) and maybe even old updates for a week or so for anniversary.\r\n\r\nSo here I was watching a Gosu montage and I was looking at all the old maps and how strange they were but how vintage they are. It would be a bit of fun to re-live those memories for the nostalgia (who doesn&#039;t love nostalgia) maybe in an event one year.. Just to see how far League has come. Maybe even revamp it slightly with the normal jungle camps and supp items (or not){{item:1006}}","replies":[{"poster":"DrMattie","date":"2015-08-11T12:05:41.313+0000","up_votes":1,"down_votes":0,"body":"We should also bring back URF, AP Yi and all the rest. :3","replies":[{"poster":"Anserem","date":"2015-08-12T05:01:45.927+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HorsesCantSayNo,realm=OCE,application-id=Ntey9fRZ,discussion-id=Ug418PzE,comment-id=0003,timestamp=2015-08-11T12:05:41.313+0000)\n>\n> We should also bring back URF, AP Yi and all the rest. :3\n\nYeah, it would be cool if we could all vote for one champion to return to his or her original state way back when he or she got released, just for one day, like LoL's anniversary.\n\nTotally voting for 100% Dodge Jax","replies":[]}]},{"poster":"Ediwir","date":"2015-08-11T11:52:23.783+0000","up_votes":1,"down_votes":0,"body":"Idk, the old maps had also the problem of being quite unoptimized and relatively heavy...","replies":[{"poster":"Nogalokey","date":"2015-08-12T11:03:30.471+0000","up_votes":1,"down_votes":0,"body":"Well they could clean them up a bit.. They spend a lot of time on events so it wouldn't be a problem","replies":[]}]},{"poster":"Talon12","date":"2015-08-11T11:00:58.825+0000","up_votes":1,"down_votes":0,"body":"be nice, but they rewrite the old with the new","replies":[]},{"poster":"Tele","date":"2015-08-11T09:43:10.044+0000","up_votes":1,"down_votes":0,"body":"It would definitely be cool as like an event for a few days in normals, but it would probably be really hard to do though because of the new stuff we have, like base gates and stuff. \n\nNot to mention the shit the community would give Riot; \"rito completely out of event ideas gg going to dota gg wp nerf riven pls gg burr burr\"","replies":[]}]}