{"poster":"ThunderSpell","date":"2019-08-10T04:16:25.560+0000","title":"\"Apelar\" baneo permanente","subforum":"Charlas Generales","up_votes":4,"down_votes":6,"body":"Resumiendo el 2017 fui baneado por toxicidad en cuanto a mi comportamiento en el juego.\r\n\r\nQuiero recalcar que sé que este tipo de baneos que le ocurren al 0.006% de la comunidad y no son posibles de revocar.\r\n\r\nBueno, como decía el 2017 fui baneado por un mal comportamiento en el juego y insulté sin razón a gente que me tocaba en normals/rankeds, lo cual se que es molesto y quiero decir que en esos momentos siquiera era un niño aún que jugaba sin razonamiento de su comportamiento en el juego.\r\nEl comportamiento que tuve no es el adecuado y he madurado, quiero decir solamente que he aprendido de mi error y he querido dejar esto en claro por si es que llega el momento oportuno de que llega algún staff de riot a desbanear mi cuenta por mi actuar de ahora.\r\n\r\nSé que mi actitud negativa no es una excusa ni tampoco el dinero que inverti sabiendo las normas de uso de Riot Games, y quisiera pedir un perdón a alguien que insulté en alguna partida si es que ve esto.\r\n\r\nDe ante mano muchas gracias por su atención en mi discucion/apelación de baneo. {{champion:157}}","replies":[{"poster":"xaxesis","date":"2019-08-10T05:04:34.150+0000","up_votes":6,"down_votes":0,"body":"cuenta la leyenda que hubo un invocador que lo deseo con todo el corazon y insistentemente mandaba tickets a soporte pidiendo que por favor le devuelvan su cuenta y hacia igual que tu posteaba en foro pidiendo disculpas y comprension de su actuar y derrepente un dia entro a su cuenta y se dio con la sorpresa que seguida baneado y ese momento entendio que deberia olvidar su cuenta y que deberia empezar de nuevo porque sabia que nunca le quitarian el BAN.\n\ny como dice corxea: \"suspension permanente!!!!!!!!!!!!!!!!!\"\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"arqueozoología","date":"2019-08-10T05:19:51.862+0000","up_votes":2,"down_votes":1,"body":"Imposible que te devuelvan la cuenta, y la excusa de las RP no funciona, ya que tú no compras RP, solo le donas dinero a Riot y a cambio te regalan puntos premium en su juego, ah","replies":[]},{"poster":"Ozęn","date":"2019-08-10T04:18:19.447+0000","up_votes":2,"down_votes":1,"body":"Nunca van a revocar los baneos por el único motivo de que gastaste RP en la cuenta, ese dinero que invertiste, seguramente lo vas a volver a invertir en comprarte las mismas skins que tenías en tu anterior cuenta, y eso es plata pa' riot. Si devolviesen las cuentas sería una pérdida de dinero para ellos","replies":[]},{"poster":"The Inkanus","date":"2019-08-10T17:29:50.570+0000","up_votes":1,"down_votes":0,"body":"La verdad es que no, no se devuelven las cuentas permabaneadas por mal comportamiento. Solo queda aprender de eso y cuidar más la cuenta actual.\n\nSaludos.","replies":[]}]}