{"poster":"I cry every Tim","date":"2015-06-21T10:27:52.069+0000","title":"Blue eSport - neu - knackig - Sucht DICH!","subforum":"Clans & Teams","embed":{"description":"Das Team von racler productions","url":"http://blue-esports.jimdo.com/","image":"http://u.jimdo.com/www71/o/s6a71b7d56fa8161d/img/i1bf37cdd2ad27d87/1432654388/std/image.jpg"},"up_votes":8,"down_votes":6,"body":"Hi, Blue eSports sucht wieder Motivierte Spieler die Lust haben mit dem Team was zu erreichen. Wir verf&uuml;gen &uuml;ber 7 verschieden Teams die alle Anforderungen Bronze bis Dia abdecken. Unser Ziel ist es nun, diese Teams zu vervollst&auml;ndigen.\r\n\r\nWir bieten euch:\r\n- einen TS Server mit eigenem Raum f&uuml;r jedes Team\r\n- freundlichen Support der euch bei Problemen hilft\r\n- ein hilfsbereiter Coach f&uuml;r jedes Team\r\n- spannende Projekte und Events wie die Blue eSports League \r\n- ein Forum interessanten Beitr&auml;gen\r\n- einen Fanshop mit vielen Angeboten\r\n- Teilnahme an verschiedenen Seminaren und Fortbildungen\r\n- Aufstiegs M&ouml;glichkeiten in unserem Team\r\n\r\nWir suchen au&szlig;erdem Interessierte Spieler die Lust haben sich auf andere Weise einzubringen wie Twitter, TS Support, Youtube und vieles mehr.\r\n\r\nFalls ihr Lust bekommen habt dabei zu sein Meldet euch Ingame bei mir (Raclerdesu). Ihr solltet am besten etwas Ausdauer und Motivation mitbringen, dann stehen die Chancen gut das ihr bald ein Teil von Blue eSports sein werdet. Ihr k&ouml;nnt auch unsere Website besuchen um euch einen ersten Eindruck von uns zumachen. Desweiteren nehmen wir auch bereits bestehende Teams auf welche gerne Teil dieser Wunderbaren Community sein m&ouml;chten.\r\n\r\nUnsere TS IP: ts.up-hosting.de:10129\r\nIhr k&ouml;nnt gerne Vorbeischauen, wir freuen uns auf dich!","replies":[{"poster":"Cardboard","date":"2015-06-21T19:42:43.105+0000","up_votes":1,"down_votes":0,"body":"Hi mein Name ist Sebastian (ingame GalaxyZebra) ich bin 15 und bin silber 4\nrollen sind supp oder jung (supp thresh anni am liebsten(aber alle supps gehen)(jung reksai, Olaf jv4(bei jung bevorzugt eher tanky ad aber ap gehen auch) \nIch bin grundsätzlich sehr aktiv \nund ich würde natürlich gerne mitmachen \nDanke Galaxy Zebra \n\nFalls Informationen fehelen ich werde euch demnächst ingame adden","replies":[]},{"poster":"I cry every Tim","date":"2015-06-21T19:11:49.078+0000","up_votes":1,"down_votes":0,"body":"Die Website ist noch nicht vollkommen fertig. Wir arbeiten dran :)!","replies":[]},{"poster":"Captain Nic","date":"2015-06-21T17:43:42.246+0000","up_votes":1,"down_votes":0,"body":"Hi, mein Name ist Nic, bin 16 Jahre alt und spiele als Main Support (Thresh Main, kann aber fast alle Support-Champs) in Gold 4. Ich fände es spannend in einem Team zu spielen, da diese Idee schon lange in meinem Kopf herumschwirrt, ich sie bis jetzt aber leider noch nicht verwirklichen konnte. Eine Frage hätte ich: Gibt es ein Mindestalter? Freue mich auf baldiges Feedback und wünsche gutes Gelingen eurer Organisation!","replies":[]},{"poster":"Ender Chest","date":"2015-06-21T16:32:13.201+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen die Webseite sieht ziemlich... speziell aus. Ich war zuerst ein bisschen verwirrt. Allerdings viel Glück mit eurem Vorhaben!","replies":[]},{"poster":"Raclerdesu","date":"2015-06-21T12:44:58.817+0000","up_votes":1,"down_votes":0,"body":"Hier der Link zu unser [Website](http://blue-esports.jimdo.com/). Wir suchen auch noch in anderen Bereichen Member, falls ihr Interesse haben solltet könnt ihr mal [hier](http://blue-esports.jimdo.com/bewerbung/) vorbeischauen.","replies":[]},{"poster":"sonnynick","date":"2015-06-21T12:24:55.443+0000","up_votes":1,"down_votes":0,"body":"Bin dia main adc kannst mich ja mal anschreiben wegen team !\ningame Name sonnynick","replies":[{"poster":"Ender Chest","date":"2015-06-21T16:31:48.113+0000","up_votes":1,"down_votes":1,"body":"Dein Ingame Name sieht man übrigens oberhalb deines Beitrages.","replies":[]}]},{"poster":"C0X Predator","date":"2015-06-21T15:18:37.427+0000","up_votes":1,"down_votes":1,"body":"hi ich bin gold 5 komme aber leider nicht aus der elohell raus mein freuned sagen mir auch das ich mindestens in platin spielen müsste bin main jungler ihr könnt mich ja mal ingame anschreiben bin mainjungle und adc also geiegnet für team Beta oder gamma freue mich schon auf eure antwort :)\nIngamename: C0X Predator kein O sonderen eine null","replies":[]}]}