{"poster":"StAlKeR Lee","date":"2017-03-25T15:40:35.722+0000","title":"Master yi è un samurai? O è solo uno spadaccino","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Come da titolo vorrei sapere se master YI &egrave; un vero samurai o solo un maestro spadaccino?","replies":[{"poster":"J0hnJ0estar","date":"2017-03-26T01:51:26.550+0000","up_votes":2,"down_votes":0,"body":"Non importa se è o non è un samurai, è fighissimo lo stesso!\n{{sticker:slayer-pantheon-thumbs}}\nComunque tra i due è più un maestro secondo me,  Yasuo è molto più simile all'immagine di samurai, però molto probabilmente anche Yi è parzialmente ispirato a loro!\nW {{champion:11}}","replies":[]},{"poster":"Nibbio Bianco","date":"2017-03-25T17:10:40.401+0000","up_votes":2,"down_votes":0,"body":"è un maestro samurai. \n\nMaestro perché ha allenato Wukong.\n\nSamurai perché è un samurai.","replies":[]},{"poster":"Alereku","date":"2017-03-27T00:34:22.911+0000","up_votes":1,"down_votes":0,"body":"I samurai, secondo le fonti di cui dispongo (Il grande e potente Google), sono caste nobiliari di guardie del corpo, infatti il nome significa \"colui che serve\".\n\nQuindi tecnicamente Master Yi è un maestro spadaccino, dato che non serve nessun padrone e non fa da guardia del corpo, e non è nemmeno mai stato un samurai secondo la sua lore attuale.\n\nTristemente nemmeno Yasuo al momento è un samurai, in quanto la persona alla quale doveva fare da guardia del corpo è morta, tecnicamente lui è un ronin, un ex-samurai divenuto libero da vincoli.\n\nSiamo privi di Samurai su League of Legends, signori e signore.\n\n{{champion:26}} Zilean sapeva di questo commento.","replies":[{"poster":"Otivnaig","date":"2017-03-27T11:37:48.755+0000","up_votes":1,"down_votes":0,"body":"E shen warlord? NEMMENO LUI poichè è un signore XD","replies":[]}]},{"poster":"Vileblood Pyke","date":"2017-03-25T22:40:26.029+0000","up_votes":1,"down_votes":0,"body":"http://gifsec.com/wp-content/uploads/GIF/2014/04/confused-gif_1.gif?gs=a","replies":[]},{"poster":"Otivnaig","date":"2017-03-25T17:02:14.022+0000","up_votes":1,"down_votes":0,"body":"Yi normale (senza skin) è:\n- uno spadaccino futuristico che fa il verso a splinter cell come abbigliamento / NO\n- la sua spada (verde) assomiglia ad un Dao cinese, spada che probabilmente ha anticipato (o dato l'idea) della katana / NO\n- se ci pensi un attimo fa il verso anche a Yoshimitsu di tekken 3 / FORSE\n- usa la spada con una sola mano (peraltro la sinistra) / NO\n- tiene la spada a due mani / SI?\n- ha atteggiamenti da maestro Zen, fatto di indovinelli e frasi fighette / FORSE\n- la sua R in inglese è Highlander (pensa al film), la sua frase sull'immortalità fa pensare alla stessa saga / FORSE\n\nIn definitiva direi di no, ma ha una skin che si chiama proprio a quel modo, perciò, se può esserlo, in un certo senso lo è. Esattamente come Darius è un giocatore di basket.\n\nSe sei diretto da quella parte ti consiglio ovviamente Yasuo o Shen (che di ninja ha solo la maschera).","replies":[]},{"poster":"HaIIeIujah","date":"2017-03-25T15:48:02.319+0000","up_votes":1,"down_votes":0,"body":"Dipende, come definisci un samurai?","replies":[]},{"poster":"Ringiel","date":"2017-03-25T15:41:57.188+0000","up_votes":1,"down_votes":0,"body":"è un maestro spadaccino","replies":[]}]}