{"poster":"StAlKeR Lee","date":"2015-02-17T17:13:29.391+0000","title":"Vorrei capire una cosa","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"allora io ho vinto 7 ranked su 10 e sono finito in bronzo 2, un mio amico ne ha vinte 2 e sta in argento 2... ed eravamo tutti e due senza divisione e non avevamo una divisione precedente...  e nessuno dei due aveva mai fatto le ranked... potete spiegarmi il perché?","replies":[{"poster":"Firenheit","date":"2015-02-18T10:55:43.328+0000","up_votes":1,"down_votes":1,"body":"Benvenuto nelle Ranked, il sistema di rank meno effettivo del mondo video ludico... Per esperienza, quello di Tekken funziona meglio.","replies":[{"poster":"StAlKeR Lee","date":"2015-02-18T19:30:59.048+0000","up_votes":2,"down_votes":0,"body":"ahahha che cagata cosi o si fa uguale per tutti o non si fa per nessuno non si deve andare a fortuna ma devono avere parametri ben precisi","replies":[]}]},{"poster":"Judge Drakoo","date":"2015-02-18T11:48:02.667+0000","up_votes":2,"down_votes":0,"body":"Ciao, anche le classificate fatte tra due stagioni cambiano il tuo MMR, quindi tutte le sconfitte prima dell'inizio della stagione ti hanno influenzato l'MMR.\n\nDelle 10 partite di piazzamento hai quindi giocato con giocatori del tuo livello, e sei stato messo in una divisione appropriata al tuo MMR.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-02-17T17:32:53.111+0000","up_votes":1,"down_votes":1,"body":"Vengono contate anche le normal.\nCiò significa che il tuo amico aveva un miglior numero di vittorie (GENERALI) in confronto a te.","replies":[{"poster":"Hawkeyell","date":"2015-02-17T18:50:08.263+0000","up_votes":2,"down_votes":0,"body":"Ranked e normal considerano MMR differenti.","replies":[{"poster":"Ediwir1","date":"2015-02-18T05:12:51.980+0000","up_votes":1,"down_votes":0,"body":"Confermo, i rating sono nettamente separati.","replies":[]}]},{"poster":"StAlKeR Lee","date":"2015-02-17T17:44:20.557+0000","up_votes":1,"down_votes":0,"body":"no anche su questo lui lui sta sotto io ho 347 vinte e lui 192... ho più eliminazioni ho più tutto, è per questo che non mi spiego il motivo... questa cosa mi da fastidio perche io ci gioco molto di piu ma molto abbiamo iniziato insieme a giocare ma lui ha smesso e io sono andato molto piu avanti ora tutti e due abbiamo fatto le 10 ranked ed è successo questo e non capisco il motivo... non me la sto prendendo con il mio amico per carità sono felice per lui ma non capisco questa cosa non riesco a comprendere questo fatto che il gioco pur avendo vinto di piu mi mette in una divisione da schifo come il bronzo","replies":[]}]},{"poster":"Frattaglia","date":"2015-02-18T11:14:21.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StAlKeR Lee,realm=EUW,application-id=MJVj50Jw,discussion-id=TqYY4AMi,comment-id=,timestamp=2015-02-17T17:13:29.391+0000)\n>\n> allora io ho vinto 7 ranked su 10 e sono finito in bronzo 2, un mio amico ne ha vinte 2 e sta in argento 2... ed eravamo tutti e due senza divisione e non avevamo una divisione precedente...  e nessuno dei due aveva mai fatto le ranked... potete spiegarmi il perché?\n\nDa quello che vedo, hai 7 partite vinte e 30 perse, ed è normalissimo per un bronzo. Se mi dai il nick del tuo amico controllo anche le sue statistiche.","replies":[]},{"poster":"Ediwir1","date":"2015-02-18T05:11:51.363+0000","up_votes":1,"down_votes":0,"body":"Dipende da quali avversari hai battuto e quali non sei riuscito a battere.\nPerdere contro Argenti e vincere contro bronzi bassi potrebbe metterti in medio bronzo, mentre invece vincere contro argenti ma perdere contro ori può metterti in alto argento.\nSe fosse puramente a numero, basterebbe giocare molto per arrivare in platino :P","replies":[]},{"poster":"23HokutoNoKen","date":"2015-02-17T21:34:20.300+0000","up_votes":1,"down_votes":0,"body":"Guarda 2 miei amici hanno fatto le 10 rancked insieme tutte e 10!!!! E avevano e hanno tutt ora l mmr identico solo che uno è stato pozisionato bronzo 5 mentre l' altro bronzo 2, come l hanno calcolato non saprei spiegartelo, so solo che anche se non ha senso è cosi xD","replies":[{"poster":"Menfrix","date":"2015-02-18T04:04:32.166+0000","up_votes":1,"down_votes":0,"body":"Non puoi sapere \"l'mmr\" quello che trovi nei vari siti è inventato, o perlomeno approssimato, solo la riot sa calcolarlo, il resto è \"fantasia\"","replies":[]}]},{"poster":"UltraLion","date":"2015-02-17T18:08:28.665+0000","up_votes":1,"down_votes":0,"body":"Probabilmente i match sono casuali a seconda di chi trova al momento, ti avrà messo contro delle schiappe ed a lui contro persone più forti, così che le vittorie e le perdite abbiano avuto un peso differente, comunque non saprei, è un pò una roba a caso tipo il culo di urgot","replies":[{"poster":"StAlKeR Lee","date":"2015-02-17T19:36:19.777+0000","up_votes":1,"down_votes":0,"body":"si ma non è nemmeno giusto cosi c'è più vinco più perdo c'è non capisco mah","replies":[]}]},{"poster":"Menfrix","date":"2015-02-17T17:43:38.873+0000","up_votes":1,"down_votes":0,"body":"Credo che common intendesse il rapporto win/lose...\nGiusto per sapere, visto che la riot, giustamente, non svela il funzionamento bisogna intuirlo con i \"nostri\" casi.","replies":[{"poster":"StAlKeR Lee","date":"2015-02-17T17:45:45.285+0000","up_votes":1,"down_votes":0,"body":"ho tutto più di lui, lui ne ha perse molto più di me","replies":[]}]}]}