{"poster":"Accelerator8","date":"2019-09-11T01:58:22.607+0000","title":"Esto seguramente es un crypost","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":0,"body":"Acabo de terminar una normal en la que paso algo que nunca pensé que pasaría (porque es demasiada casualidad) y es que al minuto 10 mas o menos todo mi equipo se fue afk. El top flameaba desde minuto uno (aunque no iba mal) y lo mutee para evitar problemas, el mid perdió linea contra el Talon, la botlane estaba mas o menos y yo que era el jg (haciendo un mea culpa) no iba bien, estaba probando a Twitch en la jg que no lo uso y no me estaba yendo bien, pero era remontable. Llegado cerca del minuto 10 de la partida el mid se va afk después de que lo mataran y junto con el mataron al top el cual luego de que el mid se vaya afk el también se fue afk. Estando ya 3 contra 5 (en clara desventaja) van todos a  la botlane y nos matan hay se va el support afk y el adc  al minuto se va también. En este momento era minuto 12 y la partida duro 17 minutos en los cuales nadie se reconecto.\n\nEsta partida me pareció incluso graciosa porque dio la casualidad de que tocaron en el mismo equipo el tipo de jugadores que están tilteados y hacen ragequit y en el otro equipo habían un par que \"flameaban\", pero lo mas \"divertido\" es que era una partida normal y que no se había caído ninguna torre todavía, ni se habían hecho ningún dragón, ni nada simplemente iba mejor el otro equipo, pero decidir que todo esta perdido antes del minuto 10 cuando no se saco ningún objetivo aun y se podría remontar es bastante lamentable.\n\nEste post lo hice nada mas para contar mi \"Experiencia\" y preguntar si a otro le paso algo parecido o ya que estamos ¿Cual fue su peor partida?... \n\n{{sticker:katarina-love}}","replies":[{"poster":"Doble Carolina","date":"2019-09-11T02:47:58.870+0000","up_votes":2,"down_votes":0,"body":"¿Primera vez?","replies":[]},{"poster":"Peacewick","date":"2019-09-11T05:20:04.363+0000","up_votes":1,"down_votes":1,"body":"Tuve varias así, no sólo una, me flamearon los 9 de la partida jaja, los del equipo contrario como los stompeaba aprovechaban la oportunidad de flamearme como los hacían los de mi equipo que eran unos niños low elo que hacen la típica de echarle la culpa al jg, por responderles me permabanearon una y me sancionaron la nueva.","replies":[{"poster":"JYNXRAY","date":"2019-09-12T00:37:54.897+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Peacewick,realm=LAS,application-id=PJAKt7ph,discussion-id=q4ETbRBT,comment-id=0003,timestamp=2019-09-11T05:20:04.363+0000)\n>\n> Tuve varias así, no sólo una, me flamearon los 9 de la partida jaja, los del equipo contrario como los stompeaba aprovechaban la oportunidad de flamearme como los hacían los de mi equipo que eran unos niños low elo que hacen la típica de echarle la culpa al jg, por responderles me permabanearon una y me sancionaron la nueva.\n\nyo siempre les tiro la de lamonja buenita jajajaj: \"-No hay necesidad de insultar-\". \"-Te podes ir baneado, tranquilo bro-\"","replies":[]}]},{"poster":"Cookies and fun","date":"2019-09-11T15:43:36.240+0000","up_votes":1,"down_votes":0,"body":"Ayer uno de mi equipo se fue afk porque perdió la linea y se excusó con que \"lo llamaban para comer\" jaja!\nAsí que no te extrañen los afk que es algo demasiado común!","replies":[]},{"poster":"Paladín Tilteado","date":"2019-09-11T02:58:36.730+0000","up_votes":1,"down_votes":0,"body":"Malphite support?\nPero si esta op.\n\nMirá como terminó mi última partida, humillando a mi Nautilius support\nhttps://i.imgur.com/Hz7CHrU.png","replies":[]},{"poster":"King Arturo ","date":"2019-09-11T02:32:28.736+0000","up_votes":1,"down_votes":0,"body":"Uuff, mi peor partida fue cuando me tocó un troll profesional (estos tipos roban cuentas y trolean para ver cuánta \"paciencia\" tiene Riot antes de ser baneados)  la cosa es que dijo en selección de campeón trolleo desde ya sepanlo, y entramos a la partida (nadie dodgeo de tontos) saco soraka mid, salió 0-30 y se desconectó, la perdí y con eso se fue mi promo. Me calenté tanto que envíe un ticket al soporte con pantallazo y le perma banearon la cuenta  {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}