{"poster":"Saagonn","date":"2017-06-19T17:17:12.905+0000","title":"quiero saber como califican en ranked.","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"buenas tardes mi nombre es jonatan.. la verdad q estoy muy decepsionado con la forma de clasificar que tienen.. no entiendo y espero sepan explicarme por que ponene 10 partidas para pocisionar a una persona segun nivel.. si ganando 8 de 10 partidas.. que ponen me clasifican &quot;Bronce v&quot;. por tal motivo directamente que me pongan en ese nivel y no pierdo tiempo en jugar las 10 partidas... y ya esta!.\r\nconocidos perdieron 6 de las 10 y fueron a parar a bronce II es una mentira entonces las clasificaciones..\r\nespero puedan dar una respuesta a esto. sino se trata de un enga&ntilde;o total!","replies":[{"poster":"One Punch Vi","date":"2017-06-19T20:19:16.243+0000","up_votes":3,"down_votes":0,"body":"Esos comentarios , cuanta gente que habla sin saber.{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Jynxwenwencha","date":"2017-06-19T21:28:19.689+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=One Punch Vi,realm=LAS,application-id=v7qsfXsE,discussion-id=6huj9bgE,comment-id=0004,timestamp=2017-06-19T20:19:16.243+0000)\n>\n> Esos comentarios , cuanta gente que habla sin saber.{{sticker:zombie-brand-facepalm}}\n\nCualquier cosa le dijeron ajaajja.. metieron al elo de las normales, los scores, ajajajajajajajajajajajajajajajajjajajajajajajajajaja \n\nAmigo, si tu posicionamiento con 8 de 10 victorias fue culminante para sumergirte en lo más profundo del elo hell, solo hay dos variantes:\n\n1- Jugabas pésimo y tenias un winrate desastroso. Podria ser de un 20 o 30%. (Esto teniendo en cuenta que antes ya habias sido clasificado).\n2- Es mentira dado que es imposible que por primera vez rankees y termines en bronce 5 con una racha de 8 victorias que es practicamente dificilisimo para gente normal, sos un iluminado. Por lo tanto, si es tu caso y sos un suertudo de aquellos, adjuntanos una foto de tu cuenta con datos de la Season anterior para verificar que jamás rankeaste y luego envialo al soporte.","replies":[{"poster":"Deigex","date":"2017-06-19T22:06:31.130+0000","up_votes":1,"down_votes":0,"body":"https://las.op.gg/summoner/userName=Saagonn No es tan dificil darse cuenta que o no es su cuenta o jugo 4 años ranked sin entender el sistema de posicionamiento. Si fue bronce 5 casi todas las season su mmr esta en el peor lugar y solo 10 partidas no arreglan esto.","replies":[]}]}]},{"poster":"9081913DEL1","date":"2017-06-19T19:08:41.092+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saagonn,realm=LAS,application-id=v7qsfXsE,discussion-id=6huj9bgE,comment-id=,timestamp=2017-06-19T17:17:12.905+0000)\n>\n> buenas tardes mi nombre es jonatan.. la verdad q estoy muy decepsionado con la forma de clasificar que tienen.. no entiendo y espero sepan explicarme por que ponene 10 partidas para pocisionar a una persona segun nivel.. si ganando 8 de 10 partidas.. que ponen me clasifican &amp;quot;Bronce v&amp;quot;. por tal motivo directamente que me pongan en ese nivel y no pierdo tiempo en jugar las 10 partidas... y ya esta!.\n> conocidos perdieron 6 de las 10 y fueron a parar a bronce II es una mentira entonces las clasificaciones..\n> espero puedan dar una respuesta a esto. sino se trata de un enga&amp;ntilde;o total!\n\nPero son necesarias para saber que tenes ese nivel.\n\nEn principio lo que te delata es que aun pensas que lol se trata de ganar. El juego es mucho mas amplio y en soloq podes hacer todo bien y perder, ese es parte del chiste al evaluarte. \n\nSaludos!","replies":[]},{"poster":"Suck My Pix","date":"2017-06-19T17:47:15.127+0000","up_votes":1,"down_votes":0,"body":"es depende tu elo, si es el primer año que rankeas, muchos aconsejan que debes seguir ganando normals para aumentar tu elo, cuando tengas muchas ganadas, ahi recien metete en rankeds","replies":[]},{"poster":"ElYodaXD","date":"2017-06-19T17:23:55.483+0000","up_votes":1,"down_votes":0,"body":"como terminaste la season pasada ?  si sos nuevo , es raro que pase ,puede pasar por tu mal desempeño en partida  {{champion:497}}","replies":[]},{"poster":"PRAY4YOURLIFE","date":"2017-06-19T17:47:59.896+0000","up_votes":1,"down_votes":1,"body":"si vos salís 0 10 en todas las partidas y ganas las 10 no te van a poner en diamante porque en ninguna fuiste de ayuda... depende de como salgas no solo que las ganes. Como dice el del anterior comentario.... además lo máximo que te puede posicionar es en gold I según tengo entendido, siempre hablando como que no hayas jugado en la anterior season, si lo hiciste el maximo que podes quedar es por debajo de tu elo anterior, llegando como maximo hasta platino 1 hayas sido desde challenger hasta diamond V. \nPero bueno yo empece la season en platino 3 con otra cuenta y en esta me fue mal y empece en silver 2 aun ganando 8 o 9 pero con un mal desempeño, el sistema funciona.","replies":[]}]}