{"poster":"Cosmotion","date":"2016-05-31T19:26:17.079+0000","title":"Morde´s Zunstand","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey an die hoffentlich vielen Leute und vielleicht auch and ein par von riot.\r\nIch bin ein {{champion:82}} main . Ich mag diesen champ weil einfach seine identit&auml;t als &quot;Master of Metal&quot; ziemlich nice ist und ich ihn gerne als diesen Raidboss spiele. Nur gibt es ja dieses Problem,dass riot ihn nach dem missgl&uuml;ckten versuch ihn auf die Botlane zu schicken ihn nicht mehr ver&auml;ndert haben.Er liegt quasi in irgendeiner Schublade bei riot und alle &uuml;bersehen ihn.Das ist schade weil ich glaube ein par Leute w&uuml;rden ihn in kurzer zeit wieder viable machen.Es ist,denke ich mal, nicht schwer diese mitlerweile useless passive von der w zu nehmen die ihm immer 100% exp gibt auch wenn jemand bei ihm ist,da ihn 80 -90% der leute ihn im jgl oder top spielen.(also sind ja nur 2 leute betroffen davon) Zudem kann man ihm vll mehr utility auf der q geben ,sodass er wenigstens mehr als 1 mal auf der lane seine 3. Q landet.Ein weiteres problem ist diese sehr nervige itemabh&auml;ngigkeit von {{item:3116}} .Ohne dieses item l&auml;uft ihm einfach jeder davon da er ja dazu noch 325 base ms hat.Ich weiss et war f&uuml;r die bot gedacht und darum wurde es gesengt aber er ist Nahk&auml;mpfer und hat kein cc dazu. Man ist also gezwungen neben {{item:3116}}  noch tier 2 {{item:1001}} zu holen weil sonst jeder denkt,dass da ein Rentner hinter ihm her ist. Darum spielen die meinten ihn ja auch mit stormraiders surge.Alles in allem hat man dann fast keine M&ouml;glichkeit mehr etwas anderes mit morde auszuprobieren,da irgendetwas wichtiges dann fehlt.\r\nDanke,dass du bis zum Ende gelesen hast und wenn du einer von riot bist,such mal bitte bei euch nach Mordekaiser und gebt ihm in n&auml;herer Zukunft ein kleiner Update.\r\nU only need to click once, fool  {{champion:82}}","replies":[{"poster":"Kata Ga Kill","date":"2016-05-31T19:55:50.636+0000","up_votes":2,"down_votes":0,"body":"Ich bin der Meinung einfach das Mordekasier einfach Tot ist.\n(Wenn ich hier höre \"Es gibt keine Tot gepatchten Champions\" dann haben diese Leute nicht mehr alle Waffeln...)\n\nDer Rework war ganz ehrlich bis auf dem OP dreier Q instant Tot ziemlich Käse, er kann so ziemlich nix machen.\nDie ganzen Bauarbeiten in den vielen Patches haben ihn auch weiterhin kaput bearbeitet.\n\nDa es Riot so unzählige male versucht hatte diesen komischen Brusier-AP-ADC-Typen in die Kluft reinzubringen und dabei gescheitert sind, denke ich das Riot ihn auch in Zukunft nicht bearbeiten werden wird und ihn ignorieren wird.\n\nDenn andere Champs sitzen momentan mehr auf der Liste wie Yorick, WW, usw.\nOder der kommende Assassinen Update für Champs wie Evelynn, Katarina, Akali, usw.\nOder erneuerte Models von Champs die so gar nicht wie auf den Artworks aussehen wie Sivir, usw.","replies":[]},{"poster":"StillYasuoMain","date":"2016-06-01T08:59:00.584+0000","up_votes":1,"down_votes":0,"body":"Reworken?","replies":[{"poster":"Cosmotion","date":"2016-06-01T14:46:02.755+0000","up_votes":1,"down_votes":0,"body":"Nicht unbedingt.seine w , q und ult sind meiner meinung ziemlich gut designed. seine e fühlt sich useless an noch und die kleinen änderungen ,die schon genannt wurden.es sollen die gleichen fähigkeiten bleiben vom konzept nur man sollte sie so ändern ,dass man mehr  damit machen kann als dass man auf den gegner clickt und es macht schaden.","replies":[]}]},{"poster":"e621 Rengar","date":"2016-05-31T20:37:37.225+0000","up_votes":1,"down_votes":0,"body":"Ich finde Morde atm ganz ok \n\nWenn du mit ihm die Drk Controll hast kannst du ziemlich schnell Pushen \n\nSpiel ihn mal auf der Toplane mit W Max (sec. Q ) der drückt n Schaden und ist tanky af  :D \n{{summoner:4}} {{summoner:12}} {{item:3116}} {{item:3001}} {{item:3009}} {{item:3742}} {{item:3065}} {{item:3053}}  als items / summs  :D","replies":[{"poster":"Cosmotion","date":"2016-05-31T23:36:08.140+0000","up_votes":1,"down_votes":0,"body":"Ja so spiel ich es ja auch aber ... WENN du drk control hast und WENN der gegner in der w bleibt,da wenn man sich nur kurz morde als gegner anguckt weiss man,was die w macht und man wartet kurz die cd ab und geht rein( z.b riven)","replies":[]}]}]}