{"poster":"BigGabe","date":"2019-09-29T05:28:50.251+0000","title":"Al fin lo conseguí, pero no como lo esperaba","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"Estoy feliz, pero no tanto, ya que conseguí llegar a oro después de 5 años jugando al lol. Me hubiera gustado llegar con mi cuenta principal, con todos mis champs y skins, pero por mis estúpidos errores y mi horrible flameo me la banearon permanentemente. Ahora con mi cuenta secundaria he llegado a la meta que tanto me proponía todos los años y que no lo lograba por lo flamer y toxico que era. Al fin pude llegar a oro, yo te dije shiot, one day, mi cuenta principal estará baneada, pero no me imperdirá subir a lo que tanto quería y esta vez de la manera correcta y sin flamear. Fue un proceso rápido, ya que mi elo estaba muy alto y por alguna razón no pasaba por promo, así que estoy contento conmigo mismo por haberme superado en ese aspecto. \r\nGracias por leerme y que tengan una excelente noche o excelente día.\r\n\r\nNotese las referencias xd","replies":[{"poster":"Te voy a Trolear","date":"2019-09-29T15:18:05.724+0000","up_votes":2,"down_votes":0,"body":"Congratulations! ojala muchos de los perma ban fueran como tú.","replies":[]},{"poster":"L EVO 8","date":"2019-09-29T14:30:56.636+0000","up_votes":2,"down_votes":0,"body":"Felicitaciones {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Gałaad","date":"2019-09-29T13:32:29.305+0000","up_votes":2,"down_votes":0,"body":"Hey!\n\nFelicidades! No solo por haber alcanzado tus metas en el sistema de partidas clasificatorias, que también! Sino por haber reconocido todo aquello que te ralentizaba, haber asumido tus errores y haber avanzado no solo hacía ser un jugador mejor clasificado, sino ser un mejor jugador en general.\n\nEsa meta es mucho más importante que cualquier marco, así que sinceramente, ¡felicidades!","replies":[]},{"poster":"Zelos From Jonia","date":"2019-09-29T12:53:26.304+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Lunari Red Mask","date":"2019-09-29T10:00:16.448+0000","up_votes":2,"down_votes":0,"body":"Felicidades.","replies":[]},{"poster":"Dioxidodecarbono","date":"2019-09-29T06:08:28.924+0000","up_votes":2,"down_votes":0,"body":"Felicidades papu \n\n{{sticker:sg-kiko}}","replies":[]},{"poster":"lordeman10","date":"2019-09-29T05:52:34.776+0000","up_votes":2,"down_votes":0,"body":"Crees que tu comportamiento te haya dado alguna ventaja en las partidas o na que ver","replies":[{"poster":"Dioxidodecarbono","date":"2019-09-29T06:07:58.457+0000","up_votes":1,"down_votes":0,"body":"En mi parecer, nada que ver. Llegué a Diamante y estuve 3 temporadas en platino alto y puedo decirte que mientras más Elo, más ego y por lo tanto más flamers. Así que.. el comportamiento tóxico puede influir si molestas a tus compañeros demasiado y estos no saben reaccionar a los ataques porque cuando juego en elo tipo bronce-plata se nota que no saben mutear, callarse y jugar callados, cosa que en platino medio para arriba si sucede ya que ves muchas partidas con \"mute all\";\"mute X persona\";\"Cállense y jueguen\"o simplemente mudas (sobre todo a la mañana xd).\nPor lo que se puede decir que no es solamente el tóxico el que influye, sino como el team se desenvuelve con el tóxico\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Profesor Faka","date":"2019-09-29T12:13:31.424+0000","up_votes":1,"down_votes":0,"body":"yo he tenido suerte que nadie flamea desde que pase de d3 a d2 xd\ndirectamente si alguien va 0/5 no se le dice nada xd\ncada uno se enfoca en su juego","replies":[]}]},{"poster":"BigGabe","date":"2019-09-29T06:18:49.847+0000","up_votes":1,"down_votes":0,"body":"Nada que ver, siempre fue mi forma de jugar, siempre trato de jugar muy bien la línea que voy, que por cierto le pongo comodín automático en el lobby. Los equipos que me tocaron fueron muy buenos, tampoco es que me carreaban, yo también tenía que hacer algo, no me quedaba atrás, era un apoyo mutuo y eso me gustaba porque sabían lo que hacian, puedo decirte con sinceridad que en todo este proceso solo perdí 4 partidas, 2 en posicionamiento y 2 en plata 3. Siempre me mantuve callado en todas las partidas, si mi team hacia algo bien se le daba el respectivo gj o una felicitación, eso influye en la partida, si hacían algo mal no me quejaba en el chat, más bien como a veces ando en llamada con amigos mientras rankeo suelto el flameo por ahí, pero nada que ver, como digo lo mejor es quedarse callado en el chat porque puedes empeorar las cosas con la gente que si flamea y es tóxica.","replies":[]}]},{"poster":"Aria Desen Co","date":"2019-09-29T05:47:50.269+0000","up_votes":2,"down_votes":0,"body":"Felicidades haha","replies":[]},{"poster":"SeanFelices","date":"2019-09-29T05:30:06.503+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BigGabe,realm=LAS,application-id=v7qsfXsE,discussion-id=5YylB4tv,comment-id=,timestamp=2019-09-29T05:28:50.251+0000)\n>\n> Estoy feliz, pero no tanto, ya que conseguí llegar a oro después de 5 años jugando al lol. Me hubiera gustado llegar con mi cuenta principal, con todos mis champs y skins, pero por mis estúpidos errores y mi horrible flameo me la banearon permanentemente. Ahora con mi cuenta secundaria he llegado a la meta que tanto me proponía todos los años y que no lo lograba por lo flamer y toxico que era. Al fin pude llegar a oro, yo te dije shiot, one day, mi cuenta principal estará baneada, pero no me imperdirá subir a lo que tanto quería y esta vez de la manera correcta y sin flamear. Fue un proceso rápido, ya que mi elo estaba muy alto y por alguna razón no pasaba por promo, así que estoy contento conmigo mismo por haberme superado en ese aspecto. \n> Gracias por leerme y que tengan una excelente noche o excelente día.\n> \n> Notese las referencias xd\n\nFelicitaciones.\n\nSaludos .","replies":[]}]}