{"poster":"b3x","date":"2016-09-12T15:30:47.022+0000","title":"suche fun Clan","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi Leute,\r\n\r\nsuche einen Clan der Spass am Spiel hat und trotzdem ein bisschen ehrgeizig ist was zu erreichen.\r\nIhr solltet sehr aktiv sein und &Uuml;18. Ich habe keine Lust mit kleinen kiddys zu spielen die nach 0/2 meinen im ts rumflamen zu m&uuml;ssen.\r\n\r\nDer Clan sollte schon sowas wie eine Struktur haben also Homepage, Forum, TS etc. \r\nWenn Ihr noch Hilfe im organisatorischen Bereich braucht w&auml;re ich durchaus bereit zu helfen hab schon ein paar Leader stellen besetzt in meinem esport Jahren bis jetzt.\r\n\r\nWas Ihr von mir erwarten k&ouml;nnt ist eine hohe aktivit&auml;t und wenn es auch menschlich passt auch eine sehr hohe loyalit&auml;t zum Clan. \r\nTeamspeak etc ist nat&uuml;rlich vorhanden. Bin zwar mit meinen 33 Jahren ein alter Sack im esport hab aber immer noch Lust und Bock auf LoL.\r\n\r\nMeine derzeitige Lanes sind Top und Mid. Main Champs Top: Darius, Fiora, Tryndamere Midlane: Cassio, Annie, Lux, fizz. Mein Account steht momentan auf lvl 22 sollte aber bald auf lvl 30 sein da ich derzeit viel Zeit hab da ich gerade in der Schule bin. \r\n\r\nK&ouml;nnt mich gerne hier im Forum oder auch ingame anschreiben.\r\n\r\nMfg\r\nb3x","replies":[{"poster":"Quniiix","date":"2016-09-12T16:28:20.753+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}