{"poster":"RNGesus","date":"2018-10-27T15:50:25.266+0000","title":"Como hace la gente para morir tanto en las partidas???","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Hay una cuestion que quiero discutir sobretodo con gente de mas ELO que yo, hay algun momento en alguna liga donde la gente entienda que morir no es worth ? yo ultimamente juego con un amigo que es platino 3 y yo oro 2, pero la gente de su elo muchas veces muere mas que yo, y muchas veces muere por razones que no tienen sentido, estar muerto en el LOL es literalmente estar AFK cada tanto, por que es que riot no concientiza a sus jugadores de sobre lo malo que es morir? yo entiendo que existan las malas partidas, pero hay una barrera entre lo que es tener una mala partida e &quot;intear&quot; por no pensar nisiquiera un segundo o tratar de hacerse una idea de por que uno muere tanto.","replies":[{"poster":"PCtronix","date":"2018-10-27T15:55:01.156+0000","up_votes":2,"down_votes":0,"body":"el esta en platino, el sabe que platino es una liga muy toxica, lamentablemente platino a sido una de las ligas mas toxicas y flammers de LAS, yo estuve 3 años y la cantidad de trolls, gente AFK, flammers era impresionante, tambien recuerda que muchas personas que estan en platino son eloboosteados y lamentablemente la comunidad es asi\n\nAyer jugue con una riven que era platino IV en solo Q, murio 2 veces y empezo a feedear a la vez culpando al jungla de que no lo ayudaba mientras se iba a suicidar bajo torre ... el tema del feed se a hablado mucho pero recuerda que hasta hay gente que aveces publica en el foro  sus streamers feedeando y trolleando ..","replies":[]},{"poster":"foxineitor","date":"2018-10-27T17:34:44.795+0000","up_votes":1,"down_votes":0,"body":"Literal, hay gente que se muere 1 vez cada 3 minutos viejo, osea que de esos 3 minutos estuvo inutil 1 minuto entero o mas (entre que revive y sale de base). Es insoportable jugar asi, porque convengamos que si todo tu equipo se muere 15 veces y vos tambien, bueno; pero que tu equipo tenga un promedio de  3 o 4 muertes, y vos con 13, replanteate las cosas hermano.","replies":[{"poster":"RNGesus","date":"2018-10-27T18:37:20.636+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=foxineitor,realm=LAS,application-id=v7qsfXsE,discussion-id=XsI3wURt,comment-id=0002,timestamp=2018-10-27T17:34:44.795+0000)\n>\n> Literal, hay gente que se muere 1 vez cada 3 minutos viejo, osea que de esos 3 minutos estuvo inutil 1 minuto entero o mas (entre que revive y sale de base). Es insoportable jugar asi, porque convengamos que si todo tu equipo se muere 15 veces y vos tambien, bueno; pero que tu equipo tenga un promedio de  3 o 4 muertes, y vos con 13, replanteate las cosas hermano.\n\nRecien me toco un yi 4/12 , despues te dicen \"estas donde te mereces\"","replies":[]}]},{"poster":"adepfuan","date":"2018-10-27T17:31:23.560+0000","up_votes":1,"down_votes":0,"body":"mejor te quedabas en oro o pasas a diamante rapidito porque como dicen platino no es un buen lugar al cual quisieras pertenecer xD","replies":[]}]}