{"poster":"Twissa87","date":"2018-12-23T04:13:39.018+0000","title":"Hace 3 dias que no me toca rol primario.","subforum":"Jugabilidad, balance y narrativa","up_votes":6,"down_votes":0,"body":"Hola, vengo a llorar un poco. Hace 3 dias fue la ultima vez que me toco mi rol primario, suelo tirar queue como MID y TOP, y aunque top no me gusta, usualmente me tocaba pocas veces asi que me la aguantaba, mas la autofill support cada 4, 5 partidas. Hace 3 dias ya que me tocaba puro top y las dodgeaba, dodgie 6 o 7 partidas que me toco TOP y decidi cambiar y meterme como MID y SUP, si no me tocaba mid me tocaba supp, me sacaba el autofill de encima, y para la proxima vez que tiraba queue deberia tener prioridad para mid. Y toco supp, a la partida siguiente tire queue nuevamente MID y TOP, y tuve que dodgear 2 veces mas porque me toco TOP en vez de mid, y como ando odiando top y soy de madera en jg, soy de madera como adc, decidi nuevamente tirar queue como MID y SUP, total un rioter yankee dijo hara 1, 2 a&ntilde;os que el % que te toque support tirando como secundario habia sido mejorado y era como de 15-20% ( no me acuerdo exactamente ), 6 partidas jugadas como support + 6 dodgeadas y sigo sin poder jugar MID que es lo que quiero. Facil casi **20 partidas que no me toca mi rol primario**. Igual miento...me toco una vez mid, estaba contento.......la dodgearon y no volvio a tocar.\r\n\r\nAsi que no se si ando con toda la mala suerte del mundo, el 80% del sv esta intentando ir como mid, o algo esta andando mal...pero vengo a llorar.\r\n\r\n\r\nPD: lo puse en Jugabilidad porque me esta afectando mi jugabilidad, pero la verdad no se donde poner el post.\r\n\r\nTLDR: No me toca jugar de lo que quiero y vengo a llorar al foro para descargarme un poco.\r\n\r\n{{item:3070}} {{item:3070}} {{item:3070}}","replies":[{"poster":"wolfie","date":"2018-12-27T01:24:44.803+0000","up_votes":1,"down_votes":0,"body":"Hay menos gente jugando en preseason, asi que mas autofill. Aparte que lo que mas se mainea es mid (incluido yo)","replies":[]},{"poster":"Jungle Clown","date":"2018-12-23T20:54:14.723+0000","up_votes":1,"down_votes":0,"body":"Yo que maineo mid le pongo mid/jg. El tema es que top es de lo menos jugado (por lo menos en mi elo), ya me tiro alguna q otra vez fill en top, mas que support. Igual con tu tema de que no sabes jugar jg yo jugaria con un duo que ahi casi siempre tocan los roles bien.","replies":[{"poster":"Twissa87","date":"2018-12-24T03:00:53.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SubZero02,realm=LAS,application-id=xQmJPO8F,discussion-id=YfKlfqpx,comment-id=0000,timestamp=2018-12-23T20:54:14.723+0000)\n>\n> Yo que maineo mid le pongo mid/jg. El tema es que top es de lo menos jugado (por lo menos en mi elo), ya me tiro alguna q otra vez fill en top, mas que support. Igual con tu tema de que no sabes jugar jg yo jugaria con un duo que ahi casi siempre tocan los roles bien.\n\nDetesto jg con toda mi alma, es un rol que tenes que aprender sus tiempos y ni dan ganas de aprender porque te putean. Por eso pongo top por m{as de que tampoco me agrade, porque mas o menos la piloteo. Igualmente estoy jugando reclutamiento nada mas estas ultimas semanas, no deberia haber elos.","replies":[]}]},{"poster":"Twissa87","date":"2018-12-24T02:46:29.663+0000","up_votes":1,"down_votes":0,"body":"Entrando al dia 4 sin poder jugar mi rol primario. Hoy decidi seguir entrando como MID y SUP para ver cuantas partidas mas me iba a tocar support, dodgie algunas y dodgiaron otras ( cuando dodgean espero 5' para entrar nuevamente en la cola ), pero basicamente 8 queues mas, support. Llevo mas de 25 partidas, o queues llamemosle porque las dodgeo o las dodgean, que me toca support, o top, y no mi rol primario. Me quiero cortar los genitales =( Algo tiene que estar andando mal -.- Solamente 1 de 19 me tiro rol primario tirando como MID y SUP.......algo tiene que andar mal =( quiero jugar mid\n\nTLDR: Sigo llorando porque no me toca lo que quiero.\n\nEDIT; sigo sumando partidas como soporte. ya tenemos un 5% a que me toque el rol primario cuando tiro MID acompañado de SUP. NO DEBERIA SER ASI.","replies":[]}]}