{"poster":"GRAN OCTAVIO","date":"2018-11-24T07:57:34.961+0000","title":"Juguemos mas \"bosque retorcido\"","subforum":"Charlas Generales","up_votes":10,"down_votes":1,"body":"El bosque retorcido es el modo de juego menos popular y el mas ignorado, sobretodo por los jugadores nuevos. Esta modalidad de juego 3vs3 propone un juego mucho mas corto y rapido,con una tematica visual diferente y algo tenebrosa,un mapa con un paisaje hermoso y llamativo(que se lleno de teorias)! Y sin mencionar las interacciones con algunos personajes y otros secretos mas !!. Me gustaria que mas gente  jugara este modo ,asi pues, no tendriamos que esperar tanto en cola para poder jugar.Se suele esperar entre mas de 3 y 10 minutos (o mucho mas),apoximadamente, para encontrar una partida, esto es algo que desmotiva al elegir jugarlo. Aun asi,algunos,(sobre todos los mas veteranos en LOL) preferimos esperar porque sabemos lo interesante,intensas y buenas que pueden llegar a ser las partidas en el bosque(y nos encanta sus misterios).Seria realmente una pena que llegaran a sacar este modo de juego o lo cambiaran por otro. Pienso que no podria ser remplasado por nada esta modalidad es parte de League of Legends y de muchos de nosotros. Quisiera aclarar que no es mi intencion llevar este juego al modo competitivo,solo quiero ponerlo al nivel (minimo) del Abismo de los lamentos, ya que, siento que quedo por mucho detras de este. Para terminar, yo popongo incluir este mapa en el tutorial,asi, los nuevos que se sumen al juego podran conocer este bello mapa de entrada y no como el tercer modo de lol mas olvidado y tambien poner recompensas unicas para el bosque. ustedes que proponen???.{{sticker:sg-lux}} .                                                                                                                                       \r\nPD:(sabian,que, la ara&ntilde;a Vilemaw baila?)\r\nPD:(mi teclado no tiene para hacer las tildes y mi ortografia es horrible sepan disculparme pero son casi las 5 de la madrugada jajaja){{sticker:sg-miss-fortune}}","replies":[{"poster":"Son Gohanda","date":"2018-11-24T09:23:10.928+0000","up_votes":3,"down_votes":0,"body":"Es un mapa bastante divertido y castiga los errores muy rápido, lo que provoca que las parida duren poco. El problema es que la partida dura lo mismo de lo que esperas para entrar a una. Hay días en que ni esas plantas rodadoras pasan por ese mapa y puedes llegar a estar mas de 20 minutos en cola, lo digo sin exagerar. Muchas veces olvido que me pongo en cola para jugar ese mapa. Ojala riot incentive el jugar ese mapa con algún evento o recompensa de cualquier  tipo como en esencia azul algo simple nada mas y no termine en la papelera como la cicatriz de cristal.","replies":[{"poster":"GRAN OCTAVIO","date":"2018-11-24T09:27:14.240+0000","up_votes":1,"down_votes":0,"body":"si es verdad a veces hasta espere mas de 30 minutos, eso fue horrible. Ojala Riot se ponga las pilas con nuestro bosque","replies":[]}]},{"poster":"Spíroz","date":"2018-11-24T09:08:36.138+0000","up_votes":3,"down_votes":0,"body":"hace mucho no lo juego,pero la posta es que me gusta <3","replies":[{"poster":"GRAN OCTAVIO","date":"2018-11-24T09:25:02.987+0000","up_votes":1,"down_votes":0,"body":"yo cada vez lo juego mas y mas me gusta","replies":[]}]},{"poster":"Golden Shooter","date":"2018-11-24T13:03:51.548+0000","up_votes":2,"down_votes":0,"body":"Extraño dominación, asi se llamaba el de los waypoints?\n\nalguno se acuerda? me re gustaba usar la eve vieja en ese mapa.\n\nLo extraño de verdad, porque fue hace mucho {{item:3070}} {{item:3070}} {{item:3070}}","replies":[{"poster":"Annie Botz","date":"2018-11-24T14:04:24.077+0000","up_votes":1,"down_votes":1,"body":"Dominion?\n\nEn todo caso nadie juega 3v3, yo subí al 30 por allá en el 2012 (?) solo jugando ese modo y la noción que te queda es muy poca, es otro meta, otro tipo de personas (en su mayoría casual) y ahora me sorprende que el modo Nexus Blitz aún no lo reemplace de manera oficial (siento que ofrece algo similar pero de 5 xD)","replies":[]}]},{"poster":"Jinx KDA","date":"2018-11-24T12:36:10.387+0000","up_votes":2,"down_votes":0,"body":"a mi me gusta jugar bosque retorcido, lo encuentro muy divertido la verdad jajaj","replies":[]},{"poster":"Fedefoxa","date":"2018-11-24T10:30:51.699+0000","up_votes":2,"down_votes":0,"body":"me gustaría que pusieras los cambio de la grieta en el modo como lo de mientras mas oro tengas mas recompensa das.","replies":[]},{"poster":"Haidara Enju","date":"2018-11-24T18:09:21.990+0000","up_votes":2,"down_votes":1,"body":"Simplemente no pueden obligar a jugar ese mapa, por desgracia ya perdio su fama y los jugadores se la pasan en normales como alternativa a rankeds y arams.\n Sinceramente me encantaria que riot saque al bosque retorcido y lo cambie por urf {{sticker:sg-lulu}}","replies":[]},{"poster":"GRAN OCTAVIO","date":"2018-11-24T12:25:24.769+0000","up_votes":1,"down_votes":0,"body":"Algo que acabo de notar, mas o menos tipo 5 sacan el bosque y no se a que hora lo ponen creo yo que a la noche. ahora quiero jugar  y no esta. solo aram y normal {{sticker:cass-cry}}","replies":[]},{"poster":"HarpaX","date":"2018-11-24T23:53:49.525+0000","up_votes":1,"down_votes":1,"body":"Las veces que juge en el bosque me toco con duos que me putearon todo el rato, contra premades de 3 que me fornicaron en grupo (aprobechando que los otros de mi team no me ayudaban ni estando al lado)\n\nAsi que no lo toco ni con un palo, suficiente mierda hay en la grieta","replies":[]}]}