{"poster":"Pikorina","date":"2015-10-01T04:42:25.979+0000","title":"Hablemos de las Torretas/Torres.","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Buenos/as d&iacute;as/tardes/noches correspondiendo al momento en que lean esto. Aqu&iacute; yo nuevamente para traerles un nuevo post y escuchar ~~leer~~ sus opiniones respecto a lo que piensan sobre el tema planteado.\n\nTodos sabemos muy bien que nos encontramos en el meta de los &quot;Tanques y Colosos&quot; en donde champs como {{champion:86}} y {{champion:122}} se tanquean hasta la m&eacute;dula, y a&uacute;n as&iacute;, sacan bastante. He aqu&iacute; mi inquietud y d&oacute;nde quiero que presenten sus opiniones sobre mis dudas:\n> \n> ¿No creen ustedes que al ser este un meta en d&oacute;nde champs que se tanquean demasiado, las Torretas o Torres deber&iacute;an infligir m&aacute;s da&ntilde;o?\n\nEsto lo pregunto y con fin de escuchar opiniones, porque he notado que &eacute;stas ya no causan el da&ntilde;o que antes s&iacute; ofrec&iacute;an. Cuando yo comenc&eacute; a jugar, no hace mucho (el a&ntilde;o pasado, en el antiguo mapa), pude notar como varios jugadores, a pesar de ser tanques, no resistian lo que todos conocemos como &quot;diveo&quot;, en el que aguantan el da&ntilde;o causado de una torreta enemiga para poder conseguir kill, o asistir de cualquier forma.\nReci&eacute;n jugando una ranked, hab&iacute;a un Garen en el equipo enemigo. El tipo se tiraba debajo de la torre **de base ** (la que se encuentra antes del inhibidor) y no le hac&iacute;a ni un rasgu&ntilde;o. Cabe aclarar que no hab&iacute;an minions cerca y que la torre **S&Iacute; **le estaba pegando.\n\nEntonces...\n> ¿Es necesario un buff a las torres debido al meta? &iquest;Qu&eacute; se necesitar&iacute;a para que los tanques no resistan tanto los diveos extremos y salir casi ilesos con p&eacute;rdidas nulas de vida?\n\nBueno, aqu&iacute; mis preguntas ya formuladas. Ahora quiero saber sus opiniones respecto al tema.\n\nPoros y saludos{{summoner:31}}","replies":[{"poster":"Typhlosion93","date":"2015-10-01T04:50:15.706+0000","up_votes":3,"down_votes":0,"body":"Podría ser que las torres peguen daño verdadero proporcional a la vida máxima del objetivo.","replies":[{"poster":"FoXSk4IP","date":"2015-10-01T06:04:00.223+0000","up_votes":1,"down_votes":0,"body":"Hay un problema con esto:\n♦Cuando tu te haces tank (por ejemplo, nose, {{champion:2}} ) lo haces por 2 motivos: Aguantar daño de campeones y Aguantar daño de Torres. ¿Suena logico no?\n♦Ahora, tu puedas \"tanquarte\" las torres de tier 1 y 2 (las primeras 2 torres de cualquier linea) sin minions \"bastante\" bien, entre todo digamos.\n♦Pero al llegar a la 3ra torre, ya no, el Laser te baja armadura y cada vez te hace mas daño, esto se hizo para evitar los \"Tank Backdoor\" ({{champion:77}} {{champion:5}} )\n\nSi el efecto de la 3ra torre, se aplicara en TODAS las torres, de que serviria hacerte Tank, si jamas podras divear nada?\n\nCapaz no es lo mas justo, ya que actualmente un {{champion:122}}  o {{champion:86}} pueden divearte y matarte en 1 segundo (porque estan un poquito bastante desequilibrados), pero el resto no tiene esa capacidad tan brutal.\n\n----------------------------------------------------------------------------------------------------------------------\nDeberia aplicarse algo como\n\"Si un Garen divea torre, cada hit le reduce un 75% de su vida\" Kappa","replies":[{"poster":"rokushoger","date":"2015-10-01T11:34:26.716+0000","up_votes":1,"down_votes":0,"body":"Capaz aumentar la proporción de incremento de daño que te hacen las torretas, para que no la puedan tanquear por tanto tiempo, paso a explicar:\n\nCada torreta tiene una proporción de daño incrementado por cada impacto consecutivo, es decir, cuantos más hits te pega más daño te va haciendo. Capaz que aumentar un poco el daño de cada hit adicional llevaría a que pueda tanquearla y por ende valga hacerse tanque, pero que sea por menos tiempo para que no sea tan abusivo.","replies":[{"poster":"FoXSk4IP","date":"2015-10-05T04:16:37.733+0000","up_votes":1,"down_votes":0,"body":"Concuerdo totalmente con vos ahora :)\nMe parece bien eso, no es tan brusco el cambio y \"debilita\" un poco a los diveos","replies":[{"poster":"rokushoger","date":"2015-10-05T13:36:16.403+0000","up_votes":1,"down_votes":0,"body":"Claro, o sea siguen pudiendo divear pero no por tanto tiempo, y a otros pj les da igual dado que no deberían estar exponiendose al fuego de la torre.","replies":[]}]}]}]}]},{"poster":"Sir Crucifix ","date":"2015-10-05T12:13:30.516+0000","up_votes":1,"down_votes":0,"body":"A mi me gusts jugar lux top y no quiero que me reviente la Torre de 1","replies":[]},{"poster":"Ks Erwyn","date":"2015-10-01T17:48:02.759+0000","up_votes":1,"down_votes":0,"body":"El otro dia me tankee 23 golpes de la torre grado 2 con sion y ni fed iba, si ya a partir del min 20/30 ya ni pegan al menos las de grado 1 y 2.","replies":[]},{"poster":"rokushoger","date":"2015-10-01T11:35:11.002+0000","up_votes":1,"down_votes":0,"body":"Fijate lo que le comenté a fox a ver si te sirve, te escribo esto para que te salte como notificación.","replies":[]}]}