{"poster":"Hrd2H1t","date":"2016-08-31T01:02:12.009+0000","title":"Why is mixed damage important?","subforum":"Gameplay","up_votes":3,"down_votes":1,"body":"I know that it is important to have both AD and AP on your team, but why? Any higher Elo players that can tell me why mixed damage is actually important?","replies":[{"poster":"LitAF","date":"2016-08-31T01:05:34.612+0000","up_votes":12,"down_votes":0,"body":"Because then the enemy team can't just build straight armor or straight MR against your non mixed damage team. Requires them to invest gold into different builds","replies":[{"poster":"Hrd2H1t","date":"2016-08-31T01:59:40.712+0000","up_votes":2,"down_votes":0,"body":"Thank you :3","replies":[]}]},{"poster":"Marshbouy","date":"2016-08-31T01:09:50.471+0000","up_votes":3,"down_votes":0,"body":"As a tank when they are all AD i go \"lol woohoo\" \nand go {{item:3143}} {{item:3512}} {{item:3742}}  etc\nbut when they are mixed then i go \"fk\" and try to balance them accordingly, which can be hard.","replies":[]},{"poster":"Jaygo41","date":"2016-08-31T01:07:29.844+0000","up_votes":3,"down_votes":0,"body":"I mean Plat 5 isn't exactly high elo, but let's think about this:\n\nIf you have a team that has only AD damage, the opposing team's tanks are going to be especially strong against AD if they only build armor. The tanks buy a randuins, sunfire, thornmail, and tabi, and you're probably not gonna do that much damage to the guy until you have means to shred that armor. \n\nIf you have a team that has only AP, they will buy a locket and all get banshee's veils and spirit visages and negate both burst AP and sustained AP damage against your team. If they have bruisers, they'll be tanky and kill you.","replies":[]},{"poster":"BluePolarizer","date":"2016-08-31T01:40:55.299+0000","up_votes":2,"down_votes":0,"body":"its gold efficiency too. If enemy team is full AD, you get full gold efficiency against everyone with armor purchases, but with mixed physical and magic damage, you get no gold efficiency out of your armor against AP and vice versa for MR against AD.","replies":[]},{"poster":"MaxDarkwill","date":"2016-08-31T02:23:15.562+0000","up_votes":2,"down_votes":1,"body":"this should have been an obvious one you could have figured out yourself bud","replies":[]},{"poster":"Theorchero","date":"2016-08-31T02:26:45.969+0000","up_votes":1,"down_votes":0,"body":"Prevents stacking of one resistance.\n\nThere's a few exceptions of course. It's perfectly acceptable to have a Yasuo top and a GP mid with your ADC because Yas and GP have high amounts of natural armor penetration.","replies":[]},{"poster":"Girard","date":"2016-08-31T02:26:37.490+0000","up_votes":1,"down_votes":0,"body":"So a Malphite doesn't build {{item:3075}} {{item:3742}} {{item:3157}} {{item:3068}} {{item:3026}} {{item:3047}} against your all AD comp and become literally unstoppable.","replies":[]},{"poster":"Icestar1186","date":"2016-08-31T02:09:52.338+0000","up_votes":1,"down_votes":1,"body":"An all AD team is vulnerable to very high armor builds. Similarly, an all AP team is vulnerable to high MR builds. Take, for example, this build:\n\n{{item:3102}} {{item:3065}} {{item:3190}} {{item:3111}} {{item:3512}} {{item:3083}} \n\nAn all AP team will have a lot of trouble breaking down the tank, so a skilled tank can keep their team alive for far longer than if there was an AD champion there. The same applies for a build like\n\n{{item:3025}} {{item:3047}} {{item:3742}} {{item:3110}} {{item:3143}} {{item:3083}} \n\nwhich an AD champion will have a lot of trouble with. Obviously this can be mitigated with penetration stats, but it is much harder than to just have a mixed damage team.","replies":[{"poster":"Paroe","date":"2016-08-31T02:21:56.620+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Icestar1186,realm=NA,application-id=3ErqAdtq,discussion-id=AHIHBL8v,comment-id=0008,timestamp=2016-08-31T02:09:52.338+0000)\n>\n> An all AD team is vulnerable to very high armor builds. Similarly, an all AP team is vulnerable to high MR builds. Take, for example, this build:\n> \n> {{item:3102}} {{item:3065}} {{item:3190}} {{item:3111}} {{item:3512}} {{item:3083}} \n> \n> An all AP team will have a lot of trouble breaking down the tank, so a skilled tank can keep their team alive for far longer than if there was an AD champion there. The same applies for a build like\n> \n> {{item:3025}} {{item:3047}} {{item:3742}} {{item:3110}} {{item:3143}} {{item:3083}} \n> \n> which an AD champion will have a lot of trouble with. Obviously this can be mitigated with penetration stats, but it is much harder than to just have a mixed damage team.\n\n{{item:3087}} {{item:3085}} {{item:3031}} {{item:3006}} {{item:3071}} {{item:3036}} \nyour build contains about 300 bonus armor. \nI just reduced that to 165. you now have about 250 total.\nI just reduced that 250 to 175. you will always have below 200 effective armor. \nAnd i have 500MS. \nAnd i have 80% crit.\nAnd i have at least 1.5 attack speed (borderline 2.0 depending on champion)\nAnd i crit for at least 500. \nAnd i can sell my boots for a {{item:3153}}, which when you think about it is a very attractive proposition.\n\nMy CC tank support and my other ADCs will burst you down while CC'd one at a time, because a tank comp is only frightening if there are enough of you to actually kill us.","replies":[]}]},{"poster":"MunchCrunchLunch","date":"2016-08-31T02:03:03.205+0000","up_votes":1,"down_votes":0,"body":"its important to have mixed damage as in you can't have all ap team. because a single tank will facetank all five of you and survive. meanwhile. it doesn't matter if you go all ad. i never. seen it matter.","replies":[{"poster":"Paroe","date":"2016-08-31T02:05:57.406+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MunchCrunchLunch,realm=NA,application-id=3ErqAdtq,discussion-id=AHIHBL8v,comment-id=0006,timestamp=2016-08-31T02:03:03.205+0000)\n>\n> its important to have mixed damage as in you can&#x27;t have all ap team. because a single tank will facetank all five of you and survive. meanwhile. it doesn&#x27;t matter if you go all ad. i never. seen it matter.\n\nthis is quite true. \nan all AP team has cooldowns to worry about, an all AD team has a 2.5 total AD scaling ability on generally a 0.5 second cooldown AND something like 54% total armor penetration not including flat A-pen.","replies":[]}]},{"poster":"Dreadlocks","date":"2016-08-31T01:21:11.453+0000","up_votes":1,"down_votes":0,"body":"It was def more important in previous seasons. But basically its easier to itemize against. However, if you have that happen on ur team, just be sure to buy black cleavers and other armor pen items and ull probably shred threw it without much struggle unless they have like a rammus AND a malphite lol.","replies":[]},{"poster":"MagicFlyingLlama","date":"2016-08-31T01:18:04.291+0000","up_votes":1,"down_votes":0,"body":"Because simple math. Building MR and armor is less effective than building all armor.","replies":[]},{"poster":"LadyRenly","date":"2016-08-31T02:06:51.912+0000","up_votes":1,"down_votes":1,"body":"all AD teams are barely hindered this season I find. Sure, you have easier itemization, but adcs have plenty of options with youmuu, cleaver, duskblade, LDR, maw etc.\n\nI've seen a lot of 3-4 AD teams this season and it pisses me off losing to it because such dumb team comps deserve to be punished","replies":[]}]}