{"poster":"Encoder87","date":"2016-04-01T04:10:52.922+0000","title":"U.R.F!!!","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":2,"body":"U.R.F no esta, saluditos &lt;3","replies":[{"poster":"Nombre ofensivo","date":"2016-04-01T04:14:47.492+0000","up_votes":1,"down_votes":1,"body":"pero mira que interesante lo que contas tal como\n\nDesde tiempos inmemoriales los bolivianos han soñado con tres cosas prácticamente imposibles: Volar por el espacio exterior,tener mar y conseguir un político honesto. Cansados de esperar que esto último ocurra, decidieron concentrarse más en hacer realidad lo primero, anhelando así con poder llegar donde nunca antes nadie había llegado, recorriendo el espacio desde Tatooine hasta Pandora, combatiendo el Imperialismo Norte americano y proliferando la coca por todo el espacio.\nLas primeras tentativas por llegar al espacio se remontan a la época incaica en donde los indígenas, en un intento de alimentar al dios del sol por medio de sacrificios, construyeron la primera lanzadera espacial, la cual era un catapulta gigante que arrojaba llamas a mas de 100 metros de altura, todo un logro para la época.\nEn la época colonial, por la ocupación española, los esfuerzo por llegar al espacio fueron puestos en pausa por la población boliviana, no obstante durante este tiempo se realizaron experimentos importantes; como ser \"la desaceleración repentina y sus efectos sobre el cuerpo humano\" realizado por el científico Tomas Katari al caer por un barranco.\nEl siguiente gran avance que se tuvo en la carrera espacial fue producto de la cooperación Boliviano-Germana en 1859, cuando Albert Niemann descubrió la harina de coca cristalina, un avance significativo en lo referente a viajes interdimensionales, todo ello sin siquiera salir de casa.\nPor la década de los 50, la República de Bolivia se lanza a la carrera espacial compitiendo junto a las grandes potencias de sus época: los Estados Unidos y la URSS, en donde fracasa miserablemente cuando los astronautas no logran pedalear lo suficientemente rápido para que la nave se eleve. A pesar de todo una década mas tarde, el honorable pueblo boliviano decide alimentar los sueños de aventura del resto del mundo poniendo a disposición el talco de coca, de esta manera no hace falta ser un astronauta o cosmonauta para tener un vuelo intergaláctico.\nActualmente la República de Bolivia esta retomando sus aspiraciones de gloria espacial con la puesta en órbita del satélite Túpac Katari, previsto para el 2013.","replies":[{"poster":"Encoder87","date":"2016-04-01T04:16:03.904+0000","up_votes":6,"down_votes":0,"body":"Soy taringuero nivel 5, no leo nada que tenga mas de 2 renglones","replies":[{"poster":"Joako121","date":"2016-08-29T19:15:57.370+0000","up_votes":1,"down_votes":0,"body":"Encoder inicie secion  nadamas para darte like jajajajaa","replies":[]}]},{"poster":"LastHope17","date":"2016-04-01T05:11:23.186+0000","up_votes":1,"down_votes":0,"body":"Te la pusieron xD","replies":[]}]},{"poster":"XxlentaoxX","date":"2016-04-01T04:15:29.057+0000","up_votes":1,"down_votes":0,"body":"A las 3 sale.","replies":[{"poster":"Asesino715","date":"2016-04-01T04:39:32.942+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XxlentaoxX,realm=LAS,application-id=J8qpiO2I,discussion-id=eZNoZMMd,comment-id=0001,timestamp=2016-04-01T04:15:29.057+0000)\n>\n> A las 3 sale.\n\nKappa","replies":[{"poster":"XxlentaoxX","date":"2016-04-01T05:20:49.054+0000","up_votes":1,"down_votes":0,"body":"Siempre salen a las 3 los parches, vas a ver, mañana vas a ponerte a jugar y te va a salir una actualizacion.","replies":[{"poster":"Sirek","date":"2016-04-01T18:07:10.523+0000","up_votes":1,"down_votes":0,"body":"Son las 15:00 Hora Chilena... todavía no hay URF xD","replies":[{"poster":"XxlentaoxX","date":"2016-04-01T18:51:37.839+0000","up_votes":1,"down_votes":0,"body":"Porque Riot nos estafo a todos, nos saco el URF del 1 de Abril que duraba 15 dias, a cambio de ponernos URF en 2 fines de semana (3+3=6 dias de URF en el año).","replies":[{"poster":"Sirek","date":"2016-04-01T19:16:41.413+0000","up_votes":1,"down_votes":0,"body":"Pero lo tendrás dos veces en el año!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! (Voz de Smithers para los que cachen xD)","replies":[]}]}]},{"poster":"ISG Dtoke","date":"2016-04-01T06:06:36.217+0000","up_votes":1,"down_votes":0,"body":"Son las 3 y nada..","replies":[]}]}]}]},{"poster":"sors immanis 44","date":"2016-04-01T06:32:45.621+0000","up_votes":1,"down_votes":0,"body":"Aquí tienes a Urf:\n\nhttp://sandbox.yoyogames.com/games/141902-the-day-that-urf-died/download\n\n{{champion:119}} \n\nPD: el creador del link de arriba es Dristant: http://forums.na.leagueoflegends.com/board/showthread.php?t=217977","replies":[]}]}