{"poster":"ChickenMclicken","date":"2017-05-14T08:52:01.981+0000","title":"14 day ban because i said %%%got...","subforum":"Miscellaneous","up_votes":2,"down_votes":6,"body":"Now this is complete bs, Why is this even a thing? if you cant take what people say over the internet then why are you on here? This shouldn&#039;t be a thing because you can mute people, If you don&#039;t like what someone is saying then just mute them, it takes 2 seconds, If you cant handle what people say on the internet then leave, Honestly.\r\n\r\n\r\n\r\n\r\n\r\nChat Log\r\n\r\nGame 1\r\nChickenMclicken: Ikr\r\nChickenMclicken: change the musix\r\nChickenMclicken: music\r\nChickenMclicken: oh\r\nChickenMclicken: i should of flashedsfioasdojoigjfd\r\nChickenMclicken: dude\r\nChickenMclicken: wtf\r\nChickenMclicken: get out\r\nChickenMclicken: i bet u kiss girls %%%got\r\nChickenMclicken: Balance\r\nChickenMclicken: bad\r\nChickenMclicken: i bet u kiss girls %%%got\r\nChickenMclicken: you press q\r\nChickenMclicken: wow\r\nChickenMclicken: nice\r\nChickenMclicken: ur champ takes no skill\r\nChickenMclicken: bad xd\r\nChickenMclicken: well\r\nChickenMclicken: i bet u kiss girls %%%got\r\nChickenMclicken: Overextended?\r\nChickenMclicken: gank em\r\nChickenMclicken: me\r\nChickenMclicken: change the shitty music\r\nChickenMclicken: ?\r\nChickenMclicken: Are you fuckinng retarded?\r\nChickenMclicken: Fucking*\r\nChickenMclicken: lmao this champ is useless\r\nChickenMclicken: I havent played him in like a fucking year\r\nChickenMclicken: ekko doesnt take skill\r\nChickenMclicken: stfu\r\nChickenMclicken: PANTHEON\r\nChickenMclicken: rekt whore\r\nChickenMclicken: ez\r\nChickenMclicken: i bet u kiss girls %%%got\r\nChickenMclicken: Bad\r\nChickenMclicken: Bad\r\nChickenMclicken: i bet u kiss girls %%%got\r\nChickenMclicken: bad?\r\nChickenMclicken: k\r\nChickenMclicken: ez","replies":[{"poster":"Fitzky","date":"2017-05-14T11:36:04.216+0000","up_votes":1,"down_votes":4,"body":"It's technically considered a \"Homophobic Slur\" but Riot obviously doesn't know half the internet uses it as a joke..","replies":[{"poster":"Ninox","date":"2017-05-14T11:59:18.440+0000","up_votes":7,"down_votes":1,"body":"Used as a joke or not, saying it's ok encourages the actual homophobes, and for those who don't care it reinforces the negative culture. It might sound dumb but it's valid psychology that has real effects.\n\nSo yes, it's a homophobic slur that they're enforcing. Besides, this guy, totally not using it as a 'joke'. The rest of his chat isn't great either.","replies":[{"poster":"Broken Scripts","date":"2017-05-14T23:11:16.993+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=Ntey9fRZ,discussion-id=z2pXsQ3y,comment-id=00010000,timestamp=2017-05-14T11:59:18.440+0000)\n>\n> Used as a joke or not, saying it&#x27;s ok encourages the actual homophobes, and for those who don&#x27;t care it reinforces the negative culture. It might sound dumb but it&#x27;s valid psychology that has real effects.\n> \n> So yes, it&#x27;s a homophobic slur that they&#x27;re enforcing. Besides, this guy, totally not using it as a &#x27;joke&#x27;. The rest of his chat isn&#x27;t great either.\n\nThe real question is why straight people get upset when they're called a %%%got? I mean, gay people shouldn't be offended because they are technically a %%%got, but still.","replies":[{"poster":"Ninox","date":"2017-05-15T01:46:20.404+0000","up_votes":3,"down_votes":0,"body":"Funny it's almost like people don't like being directly insulted, especially when the insulter doesn't even have the decency to insult them for *who* they are but instead is insulting them for *what* they are. It's almost like that toxic ass doesn't see them (straight or gay) as a real person and is reducing them to a derogatory word, regardless of what their actual circumstances are.\n\nI know there's no point telling you this, since you're a resident troll here, but it's really not hard to be a jackass. You should try it sometime.","replies":[{"poster":"Fitzky","date":"2017-05-15T03:41:09.513+0000","up_votes":2,"down_votes":2,"body":"You know what's funny? How sensitive and uptight this generation is, it's a bunch of stupid words on the internet. Grow up, if you can't handle dark humor then get off the internet. This isn't real life, if you're getting triggered by as much as a single word then close your fucking laptop screen, turn off your computer, put down your phone, and go outside for once. You obviously don't belong here.","replies":[{"poster":"Mozzie25","date":"2017-05-15T06:29:44.497+0000","up_votes":3,"down_votes":0,"body":"You would be held accountable for those words in person. Just because your on the internet does not magically make it so you can't be hold responsible for your words and actions. \n\nAlso the majority of today's society is run through computers/phones/the internet so saying stay away from them isn't a soloution.","replies":[]},{"poster":"Ninox","date":"2017-05-15T05:39:33.513+0000","up_votes":3,"down_votes":0,"body":"Personally, I'm a fan of dark humour, I'll laugh at dead baby jokes and the like (assuming they are actually jokes). In saying that however, I also acknowledge that I am not everyone else, and that such humour can hit pain points for certain people. If you knew someone who was beaten to death for being gay, you wouldn't exactly be welcoming of the idea that people are throwing around baseless and meaningless hate for the fun of it.\n\nI also acknowledge that it is termed dark humour for a reason, and that just as some people find Jazz offensive to the ears, some people are going to find dark humour more than distasteful. That is why we create smaller communities within bigger ones, to bring people of similar tastes together without forcing those tastes on others.\n\nIt's all well and good to say 'banter' if it's within a friend group, but if you are telling strangers on the internet to go kill themselves you need to seriously reconsider your life.\n\nDo I think some people need to be less offended by things? Yes, absolutely, you aren't going to get by in life if you let every little thing destroy your composure. Do I think, \"it's just words\" is a valid excuse for enabling abusive behaviour? Absolutely fucking not. It's really not hard to not be an asshole. If some idiot points a gun at someone and fires but misses them the response isn't, oh you didn't get hurt there's no problem here.\n\nNoone is perfect, I've called people dickhead or buttmuncher or complete fucking disgrace of a human being in the past (in my defense, this was irl and he totally deserved it) but why does it have to be [insert homophobic slur] or [insert racist slur] when that has absolutely nothing to do with who they are as a person? Whether you mean it in that way or not, it perpetuates the idea that it's ok.\n\nIf someone is an asshole it's because they're an asshole not because they are black, or gay, or chinese, or female.","replies":[]},{"poster":"Arkangyle","date":"2017-05-16T04:00:24.607+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=Ntey9fRZ,discussion-id=z2pXsQ3y,comment-id=00010000000100010000,timestamp=2017-05-15T03:41:09.513+0000)\n>\n> Grow up, if you can&#x27;t handle dark humor then get off the internet. \n\nYou know what would be cool? If people stopped trying to use this line as justification for being a c*nt. \n\nPeople should be allowed to use the internet without being exposed to immature idiots who think because they're sitting in front of a screen they can say whatever they want to whoever they want.","replies":[]}]}]},{"poster":"Roguestoney","date":"2017-05-15T01:14:32.082+0000","up_votes":1,"down_votes":0,"body":"Wut","replies":[]}]}]}]},{"poster":"SEKAI","date":"2017-05-14T18:07:25.750+0000","up_votes":3,"down_votes":1,"body":"No, I think you got banned because of the combination of all the random things you've said in the match:\n\n\"ChickenMclicken: i bet u kiss girls %%%got\" x5\n\"ChickenMclicken: Bad\" x5\n\"ChickenMclicken: ... takes no skill\" x2\n\"ChickenMclicken: ez\" x2\n\"ChickenMclicken: Are you fuckinng retarded?\" x1\n\nSeriously, there were only a total of 40 lines (unless I count it wrong), and at least 15 of them were blatantly either provocative and/or offensive, and you're surprised that you're banned.","replies":[{"poster":"Broken Scripts","date":"2017-05-14T23:11:54.983+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=Ntey9fRZ,discussion-id=z2pXsQ3y,comment-id=0002,timestamp=2017-05-14T18:07:25.750+0000)\n>\n> No, I think you got banned because of the combination of all the random things you&#x27;ve said in the match:\n> \n> &quot;ChickenMclicken: i bet u kiss girls %%%got&quot; x5\n> &quot;ChickenMclicken: Bad&quot; x5\n> &quot;ChickenMclicken: ... takes no skill&quot; x2\n> &quot;ChickenMclicken: ez&quot; x2\n> &quot;ChickenMclicken: Are you fuckinng retarded?&quot; x1\n> \n> Seriously, there were only a total of 40 lines (unless I count it wrong), and at least 15 of them were blatantly either provocative and/or offensive, and you&#x27;re surprised that you&#x27;re banned.\n\n\"ChickenMclicken: ... takes no skill\" x2\n\nHow is that worthy of an offence? Pointing out that a champ takes no skill is not toxic behaviour. It's facts.","replies":[{"poster":"SEKAI","date":"2017-05-16T11:22:59.304+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broken Scripts,realm=OCE,application-id=Ntey9fRZ,discussion-id=z2pXsQ3y,comment-id=00020001,timestamp=2017-05-14T23:11:54.983+0000)\n>\n> &quot;ChickenMclicken: ... takes no skill&quot; x2\n> \n> How is that worthy of an offence? Pointing out that a champ takes no skill is not toxic behaviour. It&#x27;s facts.\n\nAs I've said, it's a combination of all the things they'd said within the match that netted him the ban. The \"takes no skill\" was clearly tossed around as a provocation in the case of OP, not as an expression of opinion or statement of fact. So it adds onto the rest of it.","replies":[]}]}]},{"poster":"macktheboloz","date":"2017-05-14T09:43:38.511+0000","up_votes":3,"down_votes":2,"body":"BL man\n\nSometimes I feel that RIOT created \"Mystery Shoppers\"  in this case players who play the game and try and piss people off on purpose to get a reaction.\n\nhttp://gameinfo.na.leagueoflegends.com/en/game-info/get-started/summoners-code/\n\nKinda of like when you hit the \"agree button\" the you agree to the summoners code where you will try and support and behavior in a certain manner, hence the suggestion that Mystery Shoppers\" are playing to test you out.\n\nMy advice would be to ignore these players, stick to whatever gameplay throws at you, link up with players on the game to advance on the map and win.","replies":[]},{"poster":"trolledallmylife","date":"2017-05-14T18:15:49.651+0000","up_votes":1,"down_votes":1,"body":"Don't cry on the forums lol!","replies":[{"poster":"trolledallmylife","date":"2017-05-14T18:17:30.711+0000","up_votes":1,"down_votes":1,"body":"btw I was the one that report you hahahaha!","replies":[{"poster":"ChickenMclicken","date":"2017-05-14T20:39:38.433+0000","up_votes":1,"down_votes":0,"body":"You weren't even in the game you mug","replies":[{"poster":"trolledallmylife","date":"2017-05-16T19:33:35.318+0000","up_votes":1,"down_votes":1,"body":"I still reported you to riot lol!\n\nu med bro?","replies":[]}]}]}]},{"poster":"Roguestoney","date":"2017-05-14T23:02:11.054+0000","up_votes":1,"down_votes":1,"body":"Lol rekt 🙃","replies":[]}]}