{"poster":"Kale","date":"2018-11-01T03:57:56.912+0000","title":"Emparejamiento","subforum":"Charlas Generales","up_votes":6,"down_votes":1,"body":"&iquest;Alguna vez se preguntaron?: &quot;&iquest;QUE ES ESTE EMPAREJAMIENTO POR DIOS, UNA DAME RIOT, YA VAN 4 PARTIDAS SEGUIDAS QUE NO TENGO TEAM?&quot;\r\n\r\nBueno, eso, que pasa con el emparejamiento? como funciona? pierdo 16 de pl cada vez que pierdo una partida, eso me deja pensar que no tengo un mal elo, porque me emparejan con gente que termina 1/8, 1/11, etc?.\r\n\r\nYa estoy cansado, encima tenes que quedarte callado porque si dec&iacute;s &quot;eh&quot; ya te pueden reportar y banear, &iquest;conclusi&oacute;n?\r\n\r\nSi rankeas te haces mala sangre siempre, este juego no es sano xd","replies":[{"poster":"Lord Shiipoo","date":"2018-11-01T08:37:34.161+0000","up_votes":3,"down_votes":0,"body":"lo peor es que si tu quieres ganar tienes que carrear esas bazofias , ami hace unos días me toco carrear a un idiota que salio 2-13 feedeo , insulto y trolleo y aun así gano ya que la gente del equipo quería ganar , un insulto. \nlos puntos deberian distribuirse por el desempeño en las partidas","replies":[{"poster":"Kale","date":"2018-11-01T21:49:56.342+0000","up_votes":1,"down_votes":0,"body":"Tal cual man, que bronca que da eso, es totalmente estúpido que ganen o pierdan el mismo pl. Cualquiera.","replies":[]}]},{"poster":"VaporAx","date":"2018-11-01T08:18:10.179+0000","up_votes":2,"down_votes":0,"body":"Te juro que te entiendo, bajé de oro 1 a 5 en cuestion de dias, imaginate... Y lo mejor es que, estando en oro 1 me tocaban platas 4 e incluso 5, tieniendo un buen MMR. Sinceramente no se que esperar ya...","replies":[{"poster":"VaporAx","date":"2018-11-01T08:19:20.052+0000","up_votes":2,"down_votes":0,"body":"Mi mayor prueba es por ejemplo la partida de Lissandra, si bien no sali tan bien, gracias a mi hicimos un buen early. Pero no supieron mantener la ventaja, y terminamos perdiendo de manera muy estupida.","replies":[]},{"poster":"Kale","date":"2018-11-01T21:52:32.089+0000","up_votes":1,"down_votes":0,"body":"A mi me llegó a emparejar contra  challengers, no existe el emparejamiento, ponen a los últimos 10 salames que le dieron a \"jugar\" en una partida y listo, que salga lo que salga. Es de no creer.","replies":[]}]},{"poster":"Elixiir","date":"2018-11-01T04:00:35.181+0000","up_votes":2,"down_votes":0,"body":"búscate un duo y aprendan a ganar las partidas entre los dos, así subí yo y es una !\"#$%… te entiendo mucho","replies":[{"poster":"VaporAx","date":"2018-11-01T08:17:25.196+0000","up_votes":1,"down_votes":0,"body":"Si fuera tan facil bro... Me ha pasado de ir ganando con mi duo y cuando queremos acordar nos tiraron todo top, magicamente.","replies":[]},{"poster":"Kale","date":"2018-11-01T04:35:37.671+0000","up_votes":1,"down_votes":0,"body":"Dale gracias, voy a empezar a buscar porque literalmente ya no se puede rankear solo, es lamentable.","replies":[]}]}]}