{"poster":"Nerothus","date":"2015-07-28T20:17:30.614+0000","title":"Skinvorschau wie sie im spiel aussehen","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Gr&uuml;&szlig;e euch,\r\nWie der Titel es schon sagt w&uuml;rde ich mich mal sehr &uuml;ber eine Skin vorschau vom IG Skin freuen bevor ich diesen kaufe den seid der Tundraj&auml;ger - WW Skin ge&auml;ndert wurde sieht man ja, dass das  gar nicht mehr zu der vorschau passt die es gibt (Fr&uuml;her hab ich mir den Skin geholt weil es mich an wow Zeiten als dk Worg erinnert jetzt gleicht er eher einem Paladin) desweiteren auch bevor man einfach Skins &auml;ndert auch die K&auml;ufer fragt oder eine Option gibt das man den alten behalten kann(sehr sauer da Geld extra ausgegeben f&uuml;r Skin der nun zum kotzen aussieht(sry f&uuml;r verbale Ausdrucksart aber ist nun mal so... wer will mit nen Paladin ww rumrennen...)\r\nwas haltet ihr davon oder gibt es eventuell andere vorschl&auml;ge der art","replies":[{"poster":"Wìcked Clown","date":"2015-07-29T05:55:56.039+0000","up_votes":1,"down_votes":1,"body":"Wenn du dir einen Skin ingame anschauen möchtest, empfehle ich dir den YouTube-Kanal SkinSpotlights (Gibt auch andere, das ist aber mein Favorit) zu besuchen. Da kannst du dir jeden einzelnen Skin sowie alle visuellen Überarbeitungen anschauen. \nIch habe mal gehört, dass man Skins direkt nach der Überarbeitung umtauschen kann, wenn sie einem dann nicht mehr gefallen. Sollte halt direkt nachdem die Änderung vorgenommen wurde passieren. Das kann aber auch nur ein Gerücht sein. Vielleicht hat da jemand anders schon Erfahrungen. Sonst einfach mal ein Ticket schreiben und ganz lieb fragen. Kostet nix und mehr als nein sagen kann Riot ja nicht. ^^\n\nFinde allerdings, dass - abgesehene von Warwick, da bin ich bis jetzt auch nicht so begeistert von - die visuellen Änderungen NIE eine Verschlechterung waren.","replies":[{"poster":"Withengard","date":"2015-07-29T05:58:32.626+0000","up_votes":1,"down_votes":1,"body":"Und was ist dann mit dem Haunted Maokai skin?? Den haben sie auch verhunst","replies":[{"poster":"Wìcked Clown","date":"2015-07-29T11:02:02.371+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht das Thema. Außerdem ist das ja eine persönliche Empfindung.","replies":[]}]},{"poster":"Nerothus","date":"2015-07-29T06:54:56.522+0000","up_votes":1,"down_votes":0,"body":"Das stimmte mal laut einen Riotler doch das ist eine weile her, ich hab am gleichen tag der Überarbeitung ein Ticket geschrieben da hieß es das es solch Aktionen mal gab doch dies können sie nicht mehr tun da es zuviel arbeit ist(scheint mehreren schon mehrmals vorher nicht recht gefallen haben)\nso war der skin ja auch schon leicht kantig usw doch der Skin sah halt vorher aus wie ein Schattenanhänger und nun sieht er aus wie ein lichtanhänger also schon eine extreme finde ich","replies":[]}]}]}