{"poster":"EGC Shred","date":"2014-07-03T15:12:34.902+0000","title":"EGC 3 vs. 3 Bajnokság","subforum":"E-sport","up_votes":12,"down_votes":0,"body":"Sziasztok!\n\nHa mindig is szerettétek volna megmutatni, hogy mit tudtok 3 vs 3-ban, most itt az alkalom!  \n**Az Elisonline Gaming Community 3v3 bajnokságot rendez,** melyre szívesen várjuk a jelentkezőket!\n\nJöjjenek a részletek!  \nA versenyeket a **Kanyargó Rengeteg**ben vivják majd a csapatok, egyenes kieséses rendszerben, a döntő és a harmadik helyért zajló meccs azonban már Best of 3 rendszerben zajlik majd, tehát a győzelemhez két nyert meccsre lesz szükség. A döntő és a harmadik helyért zajló meccs már közvetítve is lesz.  \n**Szerk.:** Egyelőre úgy néz ki, hogy több meccset is tudunk majd streamelni, ráadásul van esély arra is, hogy egy meglepetés vendéget is hívunk majd.\n\nA versenyre **3+1 fős csapatok**kal lehet nevezni, a plusz 1 fő helyettesként vehet részt a versenyen, ha az eredeti tagok közül valaki nem tud megjelenni, nyereményt azonban neki **nem** tudunk biztosítani.  \n\n**A helyettes játékos (sub) nem kötelező, a versenyre 3 fős csapattal is lehet nevezni.**\n \nA nyeremények a következők lesznek:  \n**1. hely:** **3200 RP + DIADALMAS RYZE kinézet**, plusz egy-egy szabadon választott kinézet a Különleges (Ultimate) kinézetek kivételével a csapat tagjainak, a boltban kapható kinézetek közül (kivéve a helyettes).  \n**2. hely: 2400 RP** plusz egy zsákbamacska kinézet a csapat tagjainak (kivéve a helyettes).  \n**3. hely: 1600 RP** plusz egy-egy zsákbamacska kinézet a csapat tagjainak (kivéve a helyettes).  \n**4. hely: 800 RP** a csapat tagjainak (kivéve a helyettes).\n\nA versenyre **maximum 64 csapat** jelentkezését várjuk. A selejtezők és a verseny időpontját a jelentkezés lezárta után fogjuk kitűzni.  \n**Szerk.: (A selejtezők július 23-án kezdődnek, a döntőre pedig 26-án kerül majd sor)**  \n**Jelentkezési határidő: 2014. július 17.**\n\nA versenyre jelentkezni a következő űrlap kitöltésével lehet: [**JELENTKEZÉS**](http://community.elisonline.hu/vesreny/reg/Urlap.htm)  \nA verseny hivatalos honlapja: [**LINK**](http://community.elisonline.hu/page.php?16)\n\n#[A végleges ágrajz](http://challonge.com/EGC3vs3)\n\n#[**További infók**](http://community.eune.leagueoflegends.com/hu/c/esport/joMaiJZX-egc-3-vs-3-kupa-megaposzt-es-gyik)\n\n[**Facebook esemény**](https://www.facebook.com/events/717395504993743/)\n\nSzeretettel várjuk a jelentkezéseteket :)\n\n**Szerk.:** Előfordulhat, hogy a regisztrációs űrlap nem működik. Ez esetben jelentkezéseteket e-mailben is elküldhetitek a **lolkupa@elisonline.hu** címre. A levélbe írjátok bele a csapatotok, valamint a 3+1 játékos nevét.  \n~~A hiba kijavítása egyébként folyamatban van, hamarosan ismét működni fog az űrlap is.~~  \n**A hiba javítva, elvileg már működik a dolog.**\n\nÜdv,  \nShred","replies":[{"poster":"Dædalus","date":"2014-07-06T11:06:13.775+0000","up_votes":7,"down_votes":0,"body":"Na, ez nagyon jónak tűnik! Olyannyira, hogy mielőtt a Riothoz kerültem, én szinte csak 3v3-aztam, úgyhogy még el is indulnék szívesen! \n\nDe mielőtt megteszem, azért mindenképp megkérdeznélek titeket itt a fórumon, mi a véleményetek erről. Nem probléma, ha Riotosként elindulok? Mindenképp szeretném ezt előtte tisztázni, nehogy gáz legyen belőle később (\"jó-jó persze, Riotosként mi a halált csinál egy versenyen, mekkora csalás már ez\", stb).\n\nSzóval ha azt mondjátok, nem baj, elindulok szívesen, ha meg inkább ne, akkor azt is megértem! Mi a véleményetek?","replies":[{"poster":"Womath55","date":"2014-07-06T21:44:30.427+0000","up_votes":3,"down_votes":0,"body":"Ha rendbe jött a kezed, akkor miért is ne? Játékosként te is játékos vagy, nem? De. Akkor meg? :-D","replies":[{"poster":"Dædalus","date":"2014-07-07T10:42:40.790+0000","up_votes":4,"down_votes":0,"body":"Igen, ez a bajom még, hogy 21-én veszik le a gipszet, nem tudom, mennyire leszek használható állapotban... :P","replies":[{"poster":"EgcElison","date":"2014-07-07T10:52:17.745+0000","up_votes":1,"down_votes":0,"body":"Nézd a jó oldalát: legalább van mire fogni ha valakitől kikapsz :D\nVagy ez nem is fordulhat elő ?","replies":[{"poster":"Dædalus","date":"2014-07-07T13:28:52.803+0000","up_votes":3,"down_votes":0,"body":"Sajnos tényleg nem jósolnék nagy menetelést magamnak, de tényleg lesz mire fogni az tuti! :D","replies":[]}]}]}]},{"poster":"hi im Milan","date":"2014-07-06T14:11:52.222+0000","up_votes":3,"down_votes":0,"body":"Nyugodtan legalább lesz \"sztárvendég\" :DDDDDDDDDDDDDDDDD","replies":[]},{"poster":"NagyonNagyKM2","date":"2014-07-10T12:15:51.318+0000","up_votes":2,"down_votes":0,"body":"Amíg nem kezdesz lvl 18-n full buildel nekem OK, sőt szívesen küzdenék ellened. A kezed miatt úgy sejtem kicsit gyakorlatlanabb leszel, én meg mindig feedelek, mint az állat, szóval majd versenyzünk, hogy ki a haszontalanabb ;-)","replies":[]},{"poster":"xG3Ry","date":"2014-07-07T17:25:02.574+0000","up_votes":2,"down_votes":0,"body":"Ez lehet rossz ? Én kifejezetten örülnék ha egy Riot-os ellen (vagy esetleg vele) játszhatnék !:D","replies":[]},{"poster":"SstealtH","date":"2014-07-07T14:13:15.079+0000","up_votes":2,"down_votes":0,"body":"És ha esetleg indulnál az egész csapatod meg van már?:D :$","replies":[]},{"poster":"EgcElison","date":"2014-07-06T11:49:54.753+0000","up_votes":1,"down_votes":0,"body":"Szervezői megbeszélést hívtunk össze a topikra és arra jutottunk :\n\nSzerintünk a Riot-osok is nagy valószínűség szerint emberek, bár erre bizonyítékot még nem tudunk felmutatni de dolgozunk erősen az ügyön:D\nMinden esetre minden Idéző egyenrangú kell ,hogy legyen függetlenül a munkahelyétől. Ez nem hiszem ,hogy vitatható lenne. A verseny nyílt versenyként látott napvilágot így bárki akinek EUNE szerveren van accountja az jogosult a részvételre. Én úgy látom ,hogy semmilyen akadálya nincs annak ,hogy Riot Daedalus és csapata regisztráljon, sőt személy szerint szívesen játszanék ellenfélként is, úgyhogy hangsúlyozom bár ez a személyes véleményem, de mindenképp helye van a versenyen a Riot csapatának is...\n\nDe!!! ez a döntés nem rajtam áll ezért kiküldtünk egy kör-mailt a regisztráltakhoz és megkértük őket, hogy nyilatkozzanak...\n\n\nHát tegyék meg ;)","replies":[{"poster":"Dædalus","date":"2014-07-07T10:41:32.102+0000","up_votes":2,"down_votes":0,"body":"Droidok vagyunk mind! :D\n\nKöszi a bizalmat, legyen az akkor, hogy megvárjuk, amíg a többiek is nyilatkoznak. Én szívesen elindulnék az biztos!","replies":[{"poster":"EgcElison","date":"2014-07-07T10:54:09.293+0000","up_votes":1,"down_votes":0,"body":"> Droidok vagyunk mind! :D\n\nSejtettem .... ;)","replies":[]}]}]},{"poster":"EGC Shred","date":"2014-07-08T14:46:29.704+0000","up_votes":1,"down_votes":0,"body":"Igazából mint szervező, csakis elfogultan tudok nyilatkozni a témában, de megpróbálom két irányból megközelíteni a dolgot.\n\nSzervezőként, ha egy Riotos azt mondja, hogy indulni akar a versenyünkön, az mindenképpen nagy dolog, és hatalmas örömmel tölt el. Addig nincs is baj, amíg nem nyerik meg ;)\n\nFüggetlenként, amíg a Riotosok is bizonyíthatóan emberek, addig szerintem semmi akadálya annak, hogy ők is játsszanak a versenyen. Ehhez persze szükségünk van bizonyítékra, hogy valóban emberekkel állunk szemben.\n\nÖsszességében tehát én mindenképp örülnék, ha ti is játszanátok a versenyen, ráadásul reklámnak se lenne utolsó ;)","replies":[]}]},{"poster":"Frecak","date":"2014-07-07T15:50:41.248+0000","up_votes":4,"down_votes":0,"body":"hamar visszakerül az a gipsz ha indulsz :D De csak bátran :D","replies":[]},{"poster":"Kanim","date":"2014-07-07T08:00:14.459+0000","up_votes":3,"down_votes":0,"body":"**Na ez egy fain ötlet.**\n\nVan a játékban 4 pálya, és senki nem használja (képletesen). Amikor még kezdtem az őskorban, akkor volt 5v5, meg az áldott oldschool 3v3 :) \nÉn még szorgalmaznám a Dominion bajnokságot is.\n\nAzt a mappot elhanyagolják úgyszint. Oda teljesen más taknika, csapatösszeállítás kell, mint egy hagyományosabb meccsre, és nem létezik olyan, hogy META (van persze standart hős, de nincs megkötés oda).\n\nVISSZATÉRVE EZ SZTEM EGY JÓ ÖTLET, ÉS MEGNÉZEM, HOGY MIT SZÓLNAK HOZZÁ A HAVERJAIM :D és indulás neki :D","replies":[]},{"poster":"Dædalus","date":"2014-07-28T18:27:17.815+0000","up_votes":2,"down_votes":0,"body":"Gratulálunk a remek szervezésért és kommentálásért a szervezőknek, köszönünk mindent, reméljük, még lesz ilyen!\n\nValamint gratula az összes részt vevő csapatnak is, kiemelve az első négyet:\n\n1. East Mega Power\n\n2. Lightning Rats\n\n3. Team Mortality\n\n4. Laser Rats\n\n*ÚRISTEN A PATKÁNYOK ELÁRASZTOTTÁK A VERSENYT*","replies":[]},{"poster":"EGC Shred","date":"2014-07-09T16:45:15.118+0000","up_votes":2,"down_votes":0,"body":"A nyereményeket frissítettük! Érdemes vetni rájuk egy pillantást :)\n\n#Such prizes, very Ryze, so RP, wow...","replies":[]},{"poster":"Kanim","date":"2014-07-08T22:13:30.682+0000","up_votes":1,"down_votes":0,"body":"Mondjuk én nem tartom fairnek, hogy nem kap a csere semmit :( Ha felváltva tolják, és vetésforgó szerűen mindenki játszik a versenyen akkor úgy megérdemelné Ő is.\n\n~~Viszont ha anyagi korlátok vannak, akkor értek mindent.~~\n\nNem elégedetlenkedek, meg semmi ilyesmi, félre ne értsen senki, csak nem értem ezt a részét a dolgoknak. :(","replies":[{"poster":"EGC Shred","date":"2014-07-09T14:24:44.607+0000","up_votes":2,"down_votes":0,"body":"Ez igazából a full hivatalos versenyeken is így van. Ott is lehet egy csere, de csak a normál játékosok kapnak díjat.\n\nRészletek [**ezen a linken**](http://eune.leagueoflegends.com/en/community/prized-events), a \"My team has a sub...\" résznél.","replies":[]}]},{"poster":"EGC Shred","date":"2014-07-06T11:00:41.556+0000","up_votes":2,"down_votes":0,"body":"A verseny információit frissítettem egy csomó érdekes dologgal ;)","replies":[]},{"poster":"Rafko82","date":"2014-07-23T18:42:53.334+0000","up_votes":1,"down_votes":0,"body":"TWITCH LINK: http://www.twitch.tv/egcstream","replies":[]},{"poster":"EGC Shred","date":"2014-07-18T19:54:23.932+0000","up_votes":1,"down_votes":0,"body":"#[A verseny végleges ágrajza itt](http://challonge.com/EGC3vs3)","replies":[]},{"poster":"MSQRD","date":"2014-07-09T11:58:11.116+0000","up_votes":1,"down_votes":0,"body":"Sziasztok. Nemrég létrehoztunk egy csoportot amely kimondottan a 3v3-ra fókuszál. (tudtommal még nincs ilyen)Versenyinformácikról, aktuális tier listákkal, streamekkel, tanácsokkal frissül minden nap. Csatlakozzatok bátran, és ha nyugodtan hívjatok meg bárkit, akinek az érdeklődési körébe tartozik a kanyargó rengeteg. {{champion:201}} {{champion:157}} \n\n[3v3 Facebook csoport](https://www.facebook.com/groups/794480387237744/)","replies":[]}]}