{"poster":"EGC Shred","date":"2014-07-18T23:02:58.932+0000","title":"EGC 3 vs 3 Kupa MEGAPOSZT és GY.I.K.","subforum":"E-sport","up_votes":6,"down_votes":0,"body":"A regisztráció lezárult, a sorsolás megtörtént, a verseny hamarosan kezdődik!\nKattintóizmokat melegíteni, jegyzetfüzeteket készíteni, itt az ideje elkezdeni nyomozni az ellenfelek után! :)\n\n**Linkek:**    \nÁgrajz: [challonge.com/EGC3vs3](http://challonge.com/EGC3vs3)  \nSzabályzat: [bit.ly/EGCrules](http://bit.ly/EGCrules)  \nHivatalos oldal: [bit.ly/EGC3v3](http://bit.ly/EGC3v3)  \nFacebook esemény: [http://bit.ly/EGC3v3FB](http://bit.ly/EGC3v3FB)\n\n\nHa lehet, **a csapatkapitányok vegyék fel az EGCstream nevű felhasználót a barátlistájukra**. Ezzel számunkra könnyítitek meg a szervezést. Jó ha mindig tudunk valakinek írni a csapatból, és a streameket is könnyebb leszervezni így.\n\n**Az első forduló július 23-án lesz**, innentől továbbjutás esetén minden csapatnak napi 1 további mérkőzést kell lejátszania egészen péntekig. **A döntők és az első 8 csapat meccsei 26-án szombaton, a délután folyamán játszódnak majd.**\n\nA meccsek időpontjával kapcsolatban az egyetlen kitétel, hogy **legkésőbb este 10-ig elkezdődjenek**. Adunk majd versenykódokat, és igyekszünk segíteni a közös időpontok megtalálásában, de kérjük a csapatkapitányok segítségét is az ügyben.\n\nA csapatok közül némelyeket fel fogunk keresni, akiknek a meccseit streamelni szeretnénk.  \nA streamelt meccsek előreláthatólag:\n\n**Csibecsapat** vs. **Villanykapcsoló**  \n**Legend Defenders** vs. **Ripacsgödények**  \n**Royal Flash Crew** vs. **Üregi Pockok**  \n**Csillámhomofiúk** vs. **Occam**  \n\n\n***Néhány gyakori kérdés:***\n\n**Mikor lesznek a streamek?**  \nMinden este 18 órától streamelünk, lehet, hogy két csatornán is. A szombati napot egy csatornán közvetítjük majd, 14 órás kezdéssel.\n\n**Kit keressek, ha baj van?**   \nMegtaláltok minket a játékon belül az EUNE szerveren **EGCstream**, **HatShr3D** vagy **GmOrion** néven. Ezen kívül lehet nekünk írni az alábbi e-mail címek egyikére, és mi meg majd jól válaszolunk:  \n**shred@elisonline.hu  \nelison@elisonline.hu**\n\nFacebookon is írhattok.  \n**bit.ly/ShredFB  \nbit.ly/ElisonFB**\n\nKérdéseiteket itt a fórumon is feltehetitek hozzászólás formájában.\n\n**Hol találom a...?**  \nAjánlom figyelmedbe a **\"linkek\"** részt a bejegyzés tetején. Ha ott sem találod amit keresel, akkor lásd az előző pontot.\n\n\nBiztos, hogy valamit még kihagytam, azt majd beleszerkesztem a bejegyzésbe.\n\n**Az ElisOnline Gaming Community csapata nevében kívánok mindenkinek jó felkészülést, jó versenyzést, és mindenekelőtt jó szórakozást.**\n\nAzt mondtam már, hogy a győztes kekszet is kap? ;)","replies":[]}