{"poster":"Nemin","date":"2018-09-07T18:12:18.242+0000","title":"A dráma konlúziója: A Rioter aki a tweeteket írta és még egy megnevezetlen személy távozik a Riottól","up_votes":2,"down_votes":0,"body":"**Hell&oacute;,**\r\n\r\nA Kotaku c&iacute;mű internetes &uacute;js&aacute;g ma sz&aacute;molt be arr&oacute;l, hogy k&eacute;t Rioter t&aacute;vozott a c&eacute;gtől, majd ezt a cikket az [előző topicban](https://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/3O8evHIv-a-botraany-folytatadik-rioter-kibaszott-sok-privilaogiumod-van) sokat emlegetett posztol&oacute; megosztotta, ezzel igazolva, hogy val&oacute;ban t&aacute;vozott a c&eacute;gtől. A m&aacute;sik szem&eacute;ly kil&eacute;te ismeretlen.\r\n\r\nOlyb&aacute; tűnik van igazs&aacute;g.\r\n\r\n**Mit gondoltok?**","replies":[{"poster":"Trágyalé","date":"2018-09-07T21:33:41.334+0000","title":null,"up_votes":3,"down_votes":3,"body":"***","replies":[{"poster":"Nemin","date":"2018-09-07T21:50:22.750+0000","title":null,"up_votes":4,"down_votes":1,"body":"Ivójáték: Minden \"genny\" után egy feles.","replies":[{"poster":"Trágyalé","date":"2018-09-07T22:18:23.656+0000","title":null,"up_votes":3,"down_votes":2,"body":"***","replies":[{"poster":"Knight Thyme","date":"2018-09-08T10:10:45.505+0000","title":null,"up_votes":2,"down_votes":1,"body":"Mármint menjen dolgozni, mint egy férfi és főzzön is a családjára? Azért neked is érdekes elvárásaid vannak az élettől.","replies":[{"poster":"Trágyalé","date":"2018-09-08T10:45:11.378+0000","title":null,"up_votes":3,"down_votes":2,"body":"***","replies":[{"poster":"Knight Thyme","date":"2018-09-08T10:55:26.743+0000","title":null,"up_votes":3,"down_votes":2,"body":"Nagyon fáj neked az a műköröm. Ha annyira szeretnél, csináltass egyet és próbáld ki. A normálisan megcsinált darabbal teljes életet élhetsz még disznóetetés mellett is, az a vacak ugyanis erősebb, mint a saját körme.\n\nViszont munka mellett hogyan itatsz állatot óránként télen? Főleg amikor napi szinten elvárják a túlórákat, és még haza is kell utána jutnod. Persze, ha mindent megtermelsz, akkor nem kell elmenned vásárolni, de akinek nem a föld az élete, az még arra is időt kell szakítson. Ha a munkaidőm mellett még haszonállatokat kéne tartanom, akkor emlőgyulladást kapna a tehén, mire én hazaérnék megfejni. És hidd el, nem fogadják ezt el kifogásként a főnökeim, hogy miért nem érek rá meló után még melózni nekik :)","replies":[{"poster":"Trágyalé","date":"2018-09-08T11:05:23.329+0000","title":null,"up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"Knight Thyme","date":"2018-09-08T13:15:04.410+0000","title":null,"up_votes":2,"down_votes":1,"body":"Nem jelentettem ki semmit. Kérdést tettem fel, mert a sztorid bár szépen összeszedett volt, voltak benne lukak. Válaszként viszont csak maszatolsz. Hősies óránkénti állatitatásod egyből elintézed azzal, hogy hát az igazából nem is kellett.","replies":[{"poster":"Trágyalé","date":"2018-09-08T14:03:15.662+0000","title":null,"up_votes":2,"down_votes":5,"body":"***","replies":[{"poster":"Vasipari Béla","date":"2018-09-08T14:52:54.290+0000","title":null,"up_votes":4,"down_votes":1,"body":"Nos, először is:\n\nMindenki a saját szerencséjének a kovácsa. Ha valaki olyan nőt szed össze, aki nem partner az életben, akkor magára vessen, engem kurvára nem frusztrálnak más párkapcsolati problémái, és azt sem értem, hogy téged miért.\n\nDe ha már belemegyünk, akkor én speciel férfiaknál többet látom a nem-felnőtt viselkedést (jó, lehet azért mert többet ismerek). Azt hiszik, hogy a napi nyolc óra melóval ők már mindennel végeztek és semmi másra nem hajlandóak. A nő, aki szintén melózik, még lássa is el őket anyuci módra.\n\nNem azt akarom mondani, hogy egyáltalán nincs semmi igazságod. csak azt, hogy ez nem 'női probéma'. Óriáscsecsmők mindkét nemben vannak.","replies":[{"poster":"Trágyalé","date":"2018-09-08T15:11:13.084+0000","title":null,"up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Vasipari Béla","date":"2018-09-08T16:04:38.941+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát csak ugye te említetted fent, hogy a nők 70%-a 'ingyenélő'. Szerintem közel sem ennyire rossz a helyzet","replies":[{"poster":"Trágyalé","date":"2018-09-08T16:14:57.073+0000","title":null,"up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"Jack Eron","date":"2018-09-09T10:59:17.228+0000","title":null,"up_votes":5,"down_votes":0,"body":"Nagyrészt egyetértek veled, részint a melegekkel kapcsolatban is, részint annyira nem. Az igaz, hogy az én gyerekem hozzáállása velük kapcsolatosan jórészt az én nevelésem folyománya lesz, de hogy ki születik melegnek, és ki nem, az már annyira nem egyértelmű.\n\nVan, akinek egyszeri kaland lenne, de megtudja, hogy ez \"teljesen normális\", sőt, menő, mert ma már divat annak lenni, ezt azért csak jókora szemellenzővel lehetne tagadni. Másrészt nekem több tanárom és ismerősöm is állította, és amennyire utánanéztem, még igaz is lehet, hogy a női fogamzásgátlók, hormonok nem bomlanak le, amikor vízbe kerülnek, tisztítás után sem, így aztán azok bekerülhetnek a szervezetbe, ami ugye férfiembernek nem tesz túl jót.\n\nEmellett szól az is, hogy hogyan néznek ki manapság az egészen fiatal lányok is. Amikor a haverodnak odaszólsz, hogy \"hú de helyes csaj\", ő meg \"ember, az az egyik barátom húga, és 13 éves\"... én meg nézek mint borjú az új kapura, hogy mi a fene, legalább 18nak nézett ki. Az én koromban, ami azért annyira nem volt régen, annyira nem álltak így a dolgok.\n\nTehát mindenféle hormonális problémák is közrejátszhatnak abban, hogy ki miért melyik nemhez vonzódik, de én akkor is kijelenteném, hogy szerintem ez nem normális. \n\nEttől nem ítélem el őket. Ettől nyugodtan házasodjanak. Azt tesznek, amit akarnak, de kérem, férfi a férfivel nem kompatibilis, de ha mégis, akkor abból rendszerint durva betegségek születnek. \n\nNos férfi létemre, nyilván kissé más lesz a hozzáállásom a leszbikusokhoz, is, mert hát nagyon ritka az a férfiegyed, aki legalábbis nem találja tetszetősnek, ha két lány kényezteti egymást. Természetesen, én sem vagyok kivétel, ettől függetlenül sem tartom normálisnak, és egyfajta szexuális fétisként kezelem, de attól nem ítélem el, csak fontos lenne, hogy ők is tudják ezt. Nekem is van olyan vágyam, amiről nem is beszélnék itt, de én tudom, hogy annak az enyhe fétis kategóriában van a helye, és úgy is kezelem azt, nem próbálom követendő példának vagy menő dolognak beállítani. \n\nTudományosan meg egyesek szerint melegnek lenni az rendellenesség az agyban, mások szerint meg nem. Mellette és ellene is vannak érvek, ezért nagyon nehéz erről nem saját tapasztalat vagy vélemény alapján beszélni. Az a legnagyobb baj, hogy őket is úgy mint a feministáknál, a kisebb fanatikus réteg alapján ítélik meg.","replies":[]},{"poster":"Jack Eron","date":"2018-09-09T14:44:38.470+0000","title":null,"up_votes":2,"down_votes":0,"body":"Tudják, hogy rendellenesség, de mivel mellette és ellene is bőven van kutatás, ezért az én véleményemet sem kell kidobni az ablakon. Ráadásul leírtam hogy nincs velük bajom. Nem lesznek tőle kevesebbek. Attól, hogy kirekesztő lenne akárhogy hívni egy rendellenességet, attól az még az marad, akkor is, ha nem nevezzük nevén. \n\nAkkor is volt fogamzásgátló gyógyszer, nem ilyen szintű, és nem ennyi. És nem kell köztévénéző agymosott szerencsétlenhez hasonlítani mindenkit, csak mert a véleménye a tiéddel nem egyenlő :D A hormonok nem bomlanak le, és visszakerülnek a rendszerbe. Szerintem ez nem vitatható, de persze itt is van mellette és ellene is szó, úgyhogy megint csak ne hasonlítgassunk itt senkit senkihez, és megint csak ne legyintsünk rá, mert ugyanúgy nem lehet jelenleg bizonyítani az ellenkezőjét egyértelműen, ahogyan az igazát...\n\nVan meleg ismerősöm, éppen ezért írtam, hogy nincs velük bajom. De akkor sem normális. Akármint szeretne, akármit hisz, akár értékes tagja a társadalomnak, akár nem.","replies":[]},{"poster":"Jack Eron","date":"2018-09-09T11:02:05.440+0000","title":null,"up_votes":2,"down_votes":0,"body":"Amúgy ne haragudj, de te nem Gamma Ray vagy? :D Neki voltak hasonlóan hosszú kifakadásai, és éppen ilyen megosztó stílusban.","replies":[]},{"poster":"StąrLady","date":"2018-09-09T13:04:31.408+0000","title":null,"up_votes":2,"down_votes":1,"body":"Pedig Te is nagyon jól alkalmazod mások szavainak átformálását és annak megmagyarázását, kérlek olvasd el jobban azt amit írtam és nem általánosítottam csak véleményt formáltam hogy jobban tetszenek a kinti férfiak mint a bentiek ez van és látom amit írtam az irodai munkásokról azt vagy szándékosan kihagytad vagy szimplán átfutottál rajta vagy negatívan értelmezted azt, idézem: \"Természetesen az irodai munkának is megvan a maga haszna és szépsége'. ;)","replies":[]},{"poster":"StąrLady","date":"2018-09-09T11:22:55.284+0000","title":null,"up_votes":2,"down_votes":1,"body":"Nekem valahogy a szakmabeli férfiak mindig jobban bejöttek, mint akik irodában dolgoztak. Valahogy amikor egy férfin látom a munka nyomát (malter,építkezési por,festék stb.) az jobban bejön, mint mikor valaki erősen parfümmel és hajzselével van megáldva és csak a csillogást látom rajta. Természetesen az irodai munkának is megvan a maga haszna és szépsége, de könyörgöm a szakmunkásokat ne nézze le senki, mert abban dolgozik amiben sőt, ha ők nem lennének megnézném lenne e légkondi az irodában vagy egyáltalán maga az iroda állna e még.\nA többi meg mind általánosítás ami mindenkiben ott van nem kell ahhoz konkrétan bárkinek is lenni illetve szerintem mindenki azt szeret akit akar és ahogy akarja a sztereotípiákat kéne végre legyőzni, hogyha meglátsz egy xy embert akkor nem máris az egész hozzá hasonló emberek jutnak eszedbe hanem megpróbálod külön emberként kezelni és megismerni az már más, hogy csalódsz e benne vagy sem. :)","replies":[]},{"poster":"Knight Thyme","date":"2018-09-08T20:29:53.137+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet látni valami valós statisztikát is erről? Mármint állításod szerint akkor a női népesség 70%-a munkanélküli? És a női népesség hány százalékát reprezentálják a szórakozóhelyekre járó nők, és miképp reprezentálja egy egyéjszakás kapcsolat a teljes életvezetési stratégiájukat?","replies":[]},{"poster":"Vasipari Béla","date":"2018-09-08T17:20:34.697+0000","title":null,"up_votes":1,"down_votes":0,"body":"Épp erre mondtam a fenti kommentemben, hogy nem kifejezetten érdekelnek az ilyen fajta problémák. Ha sok ilyen nő van, akkor az azért van, mert van rájuk kereslet. Nem az én dolgom megítélni más emberek ízlését. Én megvagyok a saját preferenciáimmal, ők is meglehetnek (csak aztán ne sírjanak)","replies":[]}]}]}]}]},{"poster":"StąrLady","date":"2018-09-08T15:13:12.364+0000","title":null,"up_votes":2,"down_votes":0,"body":"Már nem ezért, de ez nem így működik. Én is ugyan úgy lenyírom a füvet, kicserélem az égőt, főzök, mosok,takarítok és rendeben tartok mindent ezzel szemben Vőlegényem is megcsinálja ugyan ezt és nem csak azért mert egyenlőek vagyunk vagy, mert szeretjük egymást hanem egy háztartásban élünk. Mindenkinek ugyan olyan kötelessége a ház körül és azon kívül tevékenykednie nincs olyan, hogy ezt csak a nő a másik dolgot meg csak a férfi tudja megcsinálni vagy kell megcsinálnia, illetve mindig ott van az a bizonyos kompromisszum és alku, de ezek is általában akkor szoktak előfordulni mikor csak játszunk egymással vagy hülyéskedünk a másikkal vagy mikor nagyon  kiakarunk könyörögni valamit a másiktól :D. :)\nEzzel nem azt mondom, hogy minden megtudunk csinálni mert természetesen mindig van olyan dolog amihez a másik jobban ért, de azt is megpróbáljuk megtanulni egymástól. :)","replies":[{"poster":"Trágyalé","date":"2018-09-08T15:45:44.347+0000","title":null,"up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"StąrLady","date":"2018-09-08T15:52:45.332+0000","title":null,"up_votes":2,"down_votes":0,"body":"Látom nem olvastad el az utolsó mondatom vagy rosszul értelmezted azt illetve nézz körbe külföldön hidd  el van női tűzoltós, bádogos (családi rokon) és kamion sofőr is és az egy dolog, hogy magyarban kevesen művelik, de az nem azt jelenti, hogy nem is létezik. :)","replies":[{"poster":"Trágyalé","date":"2018-09-08T15:59:25.543+0000","title":null,"up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"StąrLady","date":"2018-09-08T16:10:56.477+0000","title":null,"up_votes":2,"down_votes":0,"body":"Megegyeztünk! ;)","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Genkwyll","date":"2018-09-08T10:46:52.629+0000","title":null,"up_votes":2,"down_votes":0,"body":"Az előző kommenteiddel nem értettem egyet, de ezzel nagyon.","replies":[]},{"poster":"M4dr4c","date":"2018-09-07T23:10:58.657+0000","title":null,"up_votes":3,"down_votes":2,"body":"Azért nem ártana valamennyire tisztelni a mások által elért eredményeket. Filmet készíteni, bármilyen poszton is, fárasztó dolog és tudás kell hozzá. Ugyanez érvényes még sok más munkára, ami nem téglahordásból áll.\n\nA feminizmussal nekem is vannak gondjaim, nem is kicsik, de te már kezdesz átesni a ló túloldalára.","replies":[]}]},{"poster":"Gregori","date":"2018-09-07T21:59:56.513+0000","title":null,"up_votes":1,"down_votes":0,"body":"~~Ezért szeretjük a szinonimákat.~~","replies":[]}]},{"poster":"Vasipari Béla","date":"2018-09-08T06:56:22.744+0000","title":null,"up_votes":1,"down_votes":0,"body":"jeez...","replies":[]}]},{"poster":"S3dy","date":"2018-09-08T11:34:55.892+0000","title":null,"up_votes":3,"down_votes":0,"body":"Trágyalé szélesebben kéne látni a világot. Elég szűklátókörűen beszélsz... Nem akarok vájkálni az életedben, de úgy beszélsz egy nők szűk rétegéről mintha ez lenne az általános. Pedig nem így van, csupán ez kap hangot a médiában. Ajánlom, hogy ismerkedj nőkkel :)","replies":[]},{"poster":"S3dy","date":"2018-09-10T10:55:12.873+0000","title":null,"up_votes":1,"down_votes":0,"body":"hát sajnos nem tudtam elolvasni a hozzám intézett válaszokat mert törölve lettek :(","replies":[]},{"poster":"Jack Eron","date":"2018-09-07T20:04:09.118+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ekkora nyomás után már várható volt. Nem lett volna fair, hogy én a \"buncs of retek, majomparádé, idiot\" szavak miatt chatbannt meg kitiltás kapok, ő meg nyilvánosan KYS-ezik :D","replies":[{"poster":"Trágyalé","date":"2018-09-07T21:41:03.105+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Jack Eron","date":"2018-09-08T06:53:33.027+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha létezik undorítóbb a szélsőségesen feminista nőnél, az csak a szélsőségesen feminista férfi. Már ha annak lehet nevezni, és nem erőltet magára valami gendert (amiből AKKOR is kettő van). Tényleg rohadt nehéz lett volna legyinteni a barmokra, azután minden eseményhez a mindenkit szívesen várunk táblát társítani...","replies":[]}]}]}]}