{"poster":"[COULD NOT READ POSTER]","date":"2019-08-26T10:00:23.188+0000","title":"Ticketinfos für die Weltmeisterschaft 2019","subforum":"Esports","up_votes":0,"down_votes":1,"body":"[BODY IS EMPTY]","replies":[{"poster":"Desdämona","date":"2019-08-27T21:49:56.210+0000","up_votes":9,"down_votes":1,"body":"    Die Spiele der Vorrunde und Gruppenphase in Berlin werden auf Englisch kommentiert.\r\n    Die Spiele des Viertel- und Halbfinales in Madrid werden auf Spanisch kommentiert.\r\n    Das Finale in Paris wird auf Französisch kommentiert.\r\n    Es gibt keine Funkkopfhörer für eine simultane Übersetzung.\r\n\r\nOkeyyyyyyyyyyyyyyyyyyyyyyyyyyy\r\nwieso zum Kuck Kuck wird sowohl in Paris als auch in Madrid in den Landessprachen gesprochen, aber in Berlin ENGLISCH????\r\nHallo Riot??!!! Wo ist die Logik dahinter??? Ich hätte gerne ein Spiel auf Deutsch gesehen, da mein Englisch nicht das beste ist.\r\nFinde es einfach schlicht weg eine Frechheit!!! Entweder hält man es über all in den Landessprachen ab oder dann über all Englisch!!!!{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"EL1AS","date":"2019-09-07T22:05:14.110+0000","up_votes":2,"down_votes":1,"body":"Es gibt in Frankreich (Spanien wahrscheinlich dann auch) ein Gesetzt, dass vorschreibt dass große Events in Heimatsprache sein müssen.","replies":[{"poster":"HyperionCH","date":"2019-09-20T14:56:02.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EL1AS,realm=EUW,application-id=hGYdiTd1,discussion-id=4ET6i6ad,comment-id=00060000,timestamp=2019-09-07T22:05:14.110+0000)\n>\n> Es gibt in Frankreich (Spanien wahrscheinlich dann auch) ein Gesetzt, dass vorschreibt dass große Events in Heimatsprache sein müssen.\n\nEs gibt aber in Deutschland kein Gesetz, dass vorschreibt, dass sie in Englisch sein müssen. :D","replies":[]}]}]},{"poster":"Bruno der Proll","date":"2019-08-26T13:14:18.585+0000","up_votes":14,"down_votes":6,"body":"Frankreich ist für Europa was Teemo für LoL ist.","replies":[{"poster":"FlashDice","date":"2019-08-28T05:39:26.851+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Bruno der Proll","date":"2019-08-29T06:17:44.512+0000","up_votes":3,"down_votes":3,"body":"XDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD,\n\nich dachte eher an Kot","replies":[]}]}]},{"poster":"SpadesOfNine","date":"2019-09-01T16:26:40.665+0000","up_votes":1,"down_votes":0,"body":"An alle die nicht zum Finale nach Frankreich wollen da dort auf Französisch gecasted wird: lasst euch bitte bitte nicht davon abschrecken. Ich selbst kann 3 Wörter auf französisch und fahre trotzdem mit Freunden hin. Das casten wird bei der Atmosphäre und bei der Stimmung nebensache. Schon im kleinen LEC Studio in Berlin ist immer Party, mag mir gar nicht vorstellen wie großartig das wird auf der großen Bühne! Da kann man auch mal damit leben eben nicht die Caster zu verstehen^^","replies":[{"poster":"ReBreakdown","date":"2019-09-06T12:47:14.548+0000","up_votes":3,"down_votes":0,"body":"Ja aber jeder Mensch mit durchschnittlicher Bildung kann gut genug Englisch um den LEC Cast auf Englisch zu verstehen. Französisch ist einfach ein reudige Sprache, die weder schön klingt noch irgendwie für non native Speaker verständlich ist. Pure Frechheit und peinliche Aktion von Riot. Das ist ein internationales Finale, letztes Jahr in China wurde auch auf English gecastet, warum dann nicht einfach dieses Jahr in Berlin, wo auch Englisch gesprochen werden kann, btw die Weltsprache. Verstehe nicht, wie man ein WORLDS FINAL nicht soweit durchdenken kann, um es für alle zugänglich zu machen.","replies":[]}]},{"poster":"Mahaxim","date":"2019-08-28T10:21:58.095+0000","up_votes":3,"down_votes":0,"body":"Wollte eigentlich auch zum Finale nach Paris. Aber das Finale auf Französisch gebe ich mir sicher nicht ! ","replies":[]},{"poster":"QUIX2468","date":"2019-08-27T12:25:20.792+0000","up_votes":7,"down_votes":4,"body":"Was ist der Unterschied zwischen Gold und Silber  Tickets?","replies":[{"poster":"Ryxah","date":"2019-09-01T10:49:57.745+0000","up_votes":1,"down_votes":0,"body":"Das teilt uns Riot hoffentlich noch mit, wenn sie endlich weiteres zu den Worlds veröffentlichen","replies":[]}]},{"poster":"GrummelNut","date":"2019-09-16T15:07:46.099+0000","up_votes":2,"down_votes":0,"body":"Schön, dass man das Ticket für Paris auch nur auf der französischen Seite kaufen kann und diese seit 1h\r\ndown ist. :D","replies":[{"poster":"Penntüte","date":"2019-09-16T15:11:12.809+0000","up_votes":2,"down_votes":0,"body":"Die Karten wurden schon um 14:00 Uhr bei Ticketmaster.fr released. Also hatte mal sowieso keine Chance. Es gab welche die um 14:30 in der Warteschlange waren und keine Tickets bekommen haben.:/","replies":[{"poster":"GrummelNut","date":"2019-09-16T15:15:19.215+0000","up_votes":2,"down_votes":0,"body":"Hab Karten schon Online gefunden, 1stk 159€.... Haben die brav in Masse gekauft und verdienen sich jetzt dumm und dümmer. Es stand nirgendwo dass die früher im Handel sein werden. Richtig gut organisiert..","replies":[{"poster":"Penntüte","date":"2019-09-16T15:34:07.402+0000","up_votes":1,"down_votes":0,"body":"Gegen die Bots oder Großhändler hat man einfach als normalo  keine Chance. Aber echt frech, dass die so teuer weiterverkauft werden.","replies":[]}]}]}]},{"poster":"Penntüte","date":"2019-09-16T15:06:37.933+0000","up_votes":2,"down_votes":0,"body":"Ich wollte mit meinen Freunden nach Paris um die einmalige Chance zu haben bei einem Worlds Final dabei zu sein. Um 15:40 war ich in der Warteschlange und um 16:02 war ich im Ticket Shop. Naja Ende vom Lied, alle Karten waren ausverkauft. Nach der Enttäuschung war ich auf Twitter unterwegs und habe gelesen das die Tickets um 14:00 schon auf Ticketmaster Released wurden. Keine Ahnung was das abgelaufen ist, aber ich bin sehr traurig darüber das man sowas nicht früher kommunizieren kann. Vielleicht gibt es die Möglichkeit wieder in 4 Jahren um bei so einem Event dabei zu sein. Immerhin habe ich Karten für die Play In Phase ergattern können. Man muss immer das positive un jeder Situation sehen, zumindest kann ich jetzt das Final über den englischen cast verfolgen.:)\r\n\r\nMich würde es aber jetzt mal interessieren, ob hier  jemand überhaupt ein Ticket bekommen hat als nicht Franzose.","replies":[{"poster":"GrummelNut","date":"2019-09-16T15:12:57.887+0000","up_votes":2,"down_votes":0,"body":"Bitte was?? Wieso wurden sie denn um 14Uhr released. Wir hatten die Uhrzeit für 16Uhr und haben jetzt 1h im Shop in der Warteschlange verbracht, wo permanent 16min Wartezeit stand. Dann haben wir probiert beim Accor Hotel anzurufen und als nicht Franzose kommt man da auch nicht weit... :D Aber woher hast du die Info, dass die Karten komplett ausverkauft sind?","replies":[{"poster":"Penntüte","date":"2019-09-16T15:56:11.532+0000","up_votes":1,"down_votes":0,"body":"Ich bin um 16:02 durch die Warteschlange gekommen und alle 3 Sektoren waren ausverkauft. Nach dieser enttäuschung habe ich auf Twitter gesehen das RiotFr einen Beitrag verfasst hat. Und da stand übersetzt das sie ein Teil der Karten schon um 14:00 Released haben auf Ticketmasterfr.","replies":[{"poster":"Penntüte","date":"2019-09-16T16:11:18.745+0000","up_votes":1,"down_votes":0,"body":"Es war League of Legends FR. Das haben sie exakt geschrieben auf Twitter übersetzt: Die Tickets, die heute früh bei Ticketmaster erhältlich waren. Waren nur eine kleine menge keine Panik😉. Der Smily gehört dazu","replies":[{"poster":"GrummelNut","date":"2019-09-16T17:40:16.935+0000","up_votes":1,"down_votes":0,"body":"Gut, es gibt aber Menschen wie mich, die kein Twitter nutzen... Deshalb haben wir dann probiert bei Eventim.fr anzurufen. Aber das hat natürlich auch nicht geklappt. :D \r\nWoher weißt du, dass es nur eine kleine Menge gewesen sein soll? Auf der Seite steht ja nur noch \"complete\". :o)  Und die geben ja nicht nochmal einen 2. Termin raus, für quasi die zweite Ticketwelle... \r\nDas mit der Uhrzeit finde ich dennoch sehr unverschämt. Haben jetzt noch weiter geschaut und Tickets für 400-900€ gefunden. Was ein Witz. :'´D","replies":[]}]}]}]},{"poster":"Elehdwhen","date":"2019-09-19T22:25:02.447+0000","up_votes":1,"down_votes":0,"body":"Hab um 17h15 2 Tickets für Kat3 ergattern können, war zwar nicht was ich wollte aber immerhin 😅","replies":[{"poster":"GrummelNut","date":"2019-09-23T17:26:29.073+0000","up_votes":1,"down_votes":0,"body":"Im ernst? Die Seite war doch perm auf \"ausverkauft\" geschaltet...\r\n","replies":[{"poster":"Elehdwhen","date":"2019-10-09T18:23:22.382+0000","up_votes":1,"down_votes":0,"body":"Sorry hab deine Antwort nicht gesehen, naja ich war seit 15h45 in der Warteschleife und ab 16h04 auf der Seite, da wurden schon alle 3 Kategorien mit 0 Plätzen angezeigt aber ich hab einfach immer wieder Tickets ausgewählt und bestätigt, auf einmal waren 2 im Warenkorb ^^","replies":[{"poster":"GrummelNut","date":"2019-10-10T17:14:25.537+0000","up_votes":1,"down_votes":0,"body":"Okay, das ist echt krasses Glück. Ich warte ja immer noch auf dem Moment, wo sie angeblich die restlichen Tickets online stellen. Sie meinten ja, dass nicht alle online gestellt wurden. Ist einfach echt ne Schande an organisation >.&lt;","replies":[{"poster":"Elehdwhen","date":"2019-10-12T14:13:14.067+0000","up_votes":1,"down_votes":0,"body":"Ich bräuchte auch nochmal 2, da wir eigentlich mit Kollegen gehen wollten ^^ Wurde echt schlecht organisiert... {{sticker:sg-soraka}} \n\nIch drück dir die Daumen!","replies":[]}]}]}]}]}]},{"poster":"SirVanBirne","date":"2019-08-29T13:47:48.460+0000","up_votes":2,"down_votes":0,"body":"Ich wäre gerne zum Finale. Französisch schreckt mich ab, warum tut ihr das? Total daneben. ","replies":[{"poster":"Shiggyvara","date":"2019-09-01T16:36:10.447+0000","up_votes":1,"down_votes":0,"body":"Weil sich die Franzosen nicht klein machen? :)","replies":[]}]},{"poster":"GC Marksman","date":"2019-08-27T11:11:26.544+0000","up_votes":2,"down_votes":0,"body":"Ist der Cast in der Halle in Paris, wie beim LCS Finale auf französich?","replies":[{"poster":"Lele tz","date":"2019-08-28T15:20:55.780+0000","up_votes":1,"down_votes":0,"body":"Ja. Das ist französisches Gesetz und wird daher auch das Worlds Finale betreffen. Das gleich gilt auch für die Runden in Madrid, die auf Spanisch gecastet werden.","replies":[]}]},{"poster":"oO Püppi Oo","date":"2019-08-26T10:45:36.595+0000","up_votes":3,"down_votes":1,"body":"Bitte schaut euch den englischen Text an. Hier gibt es Übersetzungsfehler bei den Ticketsverkaufsdaten! ","replies":[{"poster":"Undread Sazuna","date":"2019-08-27T08:29:31.040+0000","up_votes":1,"down_votes":0,"body":"Fühlt sich irgendwie wie Standard an inzwischen, dass die Sachen falsch ins Deutsche übersetzt werden... Etwas neues zur Abwechslung wäre mal echt nice. Wie z.B. dies hier. Oder Patchnotes. Ich frage mich häufig was das Problem dabei ist die richtigen Zahlen zu kopieren und neu einzutippen ist. Dafür ist Copy Paste da Riot...","replies":[{"poster":"oO Püppi Oo","date":"2019-08-27T10:56:39.969+0000","up_votes":1,"down_votes":2,"body":"Wurde ohne ein Wort geändert. Riot Fehler eingestehen ist sympathisch ","replies":[{"poster":"naniwakaze","date":"2019-09-01T14:10:59.619+0000","up_votes":1,"down_votes":1,"body":"Brauchst du ein Changelog oder was? Und wann war der letzte Fehler in den Patchnotes, das wuerde ich von dem oberen Klugscheisse mal gern wissen.","replies":[]}]}]}]},{"poster":"C9 SuN","date":"2019-10-16T00:56:33.674+0000","up_votes":1,"down_votes":0,"body":"Brauche 2 Tickets für Day 6 der 18.10 Freitag \r\nbitte melden wäre wirklich nett, da ich zum ersten mal zu den Worlds fahren würde.\r\nbitte unter 015128735136 melden \r\nDanke! &lt;3\r\n","replies":[]},{"poster":"Desίre","date":"2019-09-09T14:01:11.197+0000","up_votes":1,"down_votes":0,"body":"Gibt es eine Option für eine Gruppe von 7 Leuten zusammensitzen zu können?","replies":[]},{"poster":"Desίre","date":"2019-09-09T14:01:11.170+0000","up_votes":1,"down_votes":0,"body":"Gibt es eine Option für eine Gruppe von 7 Leuten zusammensitzen zu können?","replies":[]},{"poster":"Í WÌLL BE HOKAGE","date":"2019-08-27T11:59:33.298+0000","up_votes":1,"down_votes":0,"body":"ist das nur auf französisch? oder gibt es auch eine möglichkeit auf englisch zu gucken ???","replies":[{"poster":"Ryxah","date":"2019-09-01T10:51:38.399+0000","up_votes":1,"down_votes":0,"body":"In der Arena vor Ort wird nur Französisch kommentiert. Online wird es sehr wahrscheinlich wie gewohnt auch nen deutschen Livestream geben","replies":[]}]},{"poster":"Imitatía","date":"2019-08-28T14:56:11.377+0000","up_votes":1,"down_votes":0,"body":"Ab wann gibt es denn die Veranstaltung bei Eventim? Da ist noch nichts zu finden, weniger als 48 Stunden vor Verkaufsstart...","replies":[{"poster":"Redbullz","date":"2019-08-30T07:24:47.345+0000","up_votes":1,"down_votes":0,"body":"Würde ich auch gerne wissen ","replies":[]}]},{"poster":"IIusrion","date":"2019-08-26T17:42:12.136+0000","up_votes":1,"down_votes":0,"body":"Jaaa genau \"Tickets für die Vorrunde gehen am 30. JULI in den Verkauf\". Also entweder täusch ich mich aber der 30 Juli war ein Dienstag. Ihr meint wohl 30 August....","replies":[]}]}