{"poster":"[COULD NOT READ POSTER]","date":"2019-09-24T17:00:42.137+0000","title":"Das WM-Tippspiel kommt!","subforum":"Esports","up_votes":0,"down_votes":0,"body":"[BODY IS EMPTY]","replies":[{"poster":"SotE TRAVlS","date":"2019-09-24T17:47:35.383+0000","up_votes":39,"down_votes":9,"body":"Schade, dass man hier nicht mal etwas bei den Preisen abstuft. Beispielsweise ab 34 Punkten das Icon, ab 40 nen einfachen Skin, ab 45 nen besseren und bei 50 nen Coolen. So ist irgendwie der Anreiz nicht wirklich gegeben. Alles richtig hatte meins Wissens nach in den letzten Jahren sowieso niemand... \r\n","replies":[{"poster":"MCtobseLP","date":"2019-09-24T19:16:52.347+0000","up_votes":6,"down_votes":13,"body":"Naja bei der Anzahl der Spieler, wäre die Masse an Skins, Icons etc. die dann verschenkt werden würde, einfach viel zu riesig","replies":[{"poster":"666NamurA666","date":"2019-09-25T09:44:13.598+0000","up_votes":10,"down_votes":5,"body":"dir ist schon klar das skins keinen echten wert haben oder? es kostet rito nichts dir einen skin zu schneken...abstufungen wären absolut logisch..","replies":[{"poster":"Jingin","date":"2019-09-25T20:47:10.779+0000","up_votes":2,"down_votes":2,"body":"Das Problem ist aber, das Skins wertloser werden, desto öfter es sie gibt. Ich meine, wenn du eine von 100 Personen weltweit bist, die einen SKin besitzen, dann ist das megakrass. Wenn du nur eine von 20 Millionen bist, dann ist das \"normal\". Verstehst du?","replies":[{"poster":"Rîmak","date":"2019-10-04T10:47:11.488+0000","up_votes":3,"down_votes":0,"body":"Die Diskussion ist viel zu einseitig... Genau genommen hat ein digitales Produkt, wie ein Skin keinen direkten Wert mehr, nachdem die Kosten der Erstellung dieses Skins gedeckt wurden. Es ist nur Copy and Paste. Allerdings kann Riot trotzdem keine gratis Skins raus geben. Wenn von 100 Spielern, 80 den Skin geschenkt bekommen dann wären viele potentielle Kunden weg. Riot macht keinen Verlust, nur werden sie höchstwahrscheinlich auch nicht mehr so viel Gewinn einfahren. Riot könnte extra Skins für das Pick-em erstellen oder andere Rewards mit einer Abstufung einbringen. Riot hat genug digitale Produkte. Icons, Chromas, hextech chests, Emotes... Wenn die Rewards exklusiv für das 2019 Pick-Em sind, haben sie sogar eine Art Sammler Wert... Riot hat die Möglichkeiten und nutzt sie nicht. :D","replies":[]}]},{"poster":"Steadyy","date":"2019-09-25T10:13:05.436+0000","up_votes":11,"down_votes":8,"body":"Wie meinst du den \"kein echten Wert\" ???\r\nWillst du sagen das kein Mitarbeiter von Riot daran gesessen hat und dafür bezahlt wurde.\r\nWillst du sagen Geld ist immer Bares und Kryptowährung gibt es nicht??\r\nDer einzige Unterschied ist das du die Ware (Skin) nicht direkt wieder zu Geld machen kannst.\r\nTrotzdem hat ein Skin einen Wert, denn du investierst Geld. (Zeit ist Geld)","replies":[{"poster":"WasaWusel","date":"2019-09-30T14:22:05.280+0000","up_votes":4,"down_votes":2,"body":"Er bezieht sich darauf, dass Rito wirklich keine Verluste macht, indem sie Skins verschenken. Es würde an den Verkaufszahlen nichts bis so gut wie nichts ändern, selbst wenn jeder Spielder einen random skin bekommen würde.","replies":[]},{"poster":"B0rnn","date":"2019-09-30T10:57:01.041+0000","up_votes":1,"down_votes":6,"body":"Vorab, wir reden hier über ein Geschenk. (Niemand muss dafür etwas anstrengendes tun)\r\nNur weil dein Patner / deine Patnerin dir aus der Reihe eine kleine Aufmerksamkeit mitbringt, kannst du nicht erwarten, das es nächste Woche genauso ist und weh wenn es nicht etwas größeres ist.\r\n\r\nIch sehe das so wie NIKETRIX. \r\nIch finde diese ganzen Diskussionen immer so lächerlich, die jenigen die immer über \"zu teuer\" klagen, sollten sich wirklich mal vorstellen wie viel Arbeit darein fliest und wie wie viel von den besagten Produkten verkauft werden müssen.\r\nKlar rechnet sich die arbeit ab einer bestimmten Stückzahl mehr aber das ist ein zu kallulierendes Risiko oder es wird dem nächst nur noch Skins aus Kickstarter geben: Neuer ULTIMATIVE SKINS für 5€ sofern den mindestens 10.000 Leute vorbestellen, ansonsten Pustekuchen.","replies":[]}]},{"poster":"ƒorbιddeη","date":"2019-09-30T22:29:18.523+0000","up_votes":2,"down_votes":0,"body":"ihr solltet mal ein bisschen was über den wert von diesen dingen lernen. der wert einer sache, egal was es ist, wird dadurch bestimmt was die leute bereit sind dafür zu zahlen. wenn riot mehr skins vergibt verlieren sie indirekt an wert und das kostet sie indirekt definitiv etwas. unterschätzt das nicht. auch wenn sie nicht 1:1 den wert verlieren, den wir für skins bezahlen","replies":[]},{"poster":"Pizza nom nom","date":"2019-09-28T13:01:05.025+0000","up_votes":1,"down_votes":1,"body":"Man könnte es mal aus Rito Sicht sehen, jeder verschenkte Skin ist ein vielleicht nicht gekaufter Skin.\r\nIch würde schon sagen: auch digitale Dinge haben einen Wert. Nur wird das Meiste zu völlig übertriebene Preisen vertickt, Skins sollten z.B. bei 50 Cent statt 25€ sein.\r\n\r\nIch stimme weiter oben zu, es sollte noch gute Preise für nicht perfekt geben. Wie beim Lotto, da kann man auch was gewinnen wenn man nicht 6 richtige mit Zusatzzahl hat.","replies":[]}]}]},{"poster":"Shiikarii666","date":"2019-09-24T22:54:21.416+0000","up_votes":7,"down_votes":4,"body":"Wie wäre es wenn du deine Denkweise gegenüber \"Gewinnspielen\" mal reflektierst? ","replies":[]},{"poster":"AORUS Yuma","date":"2019-10-07T19:01:06.824+0000","up_votes":1,"down_votes":0,"body":"Dann hast du schlechte quellen. Letztes jahr hatten 5 leute alles richtig","replies":[]},{"poster":"Jennifer420","date":"2019-09-25T04:57:52.584+0000","up_votes":1,"down_votes":0,"body":"ich glaube in den letzten 3 jahren gab es insgesamt 7 leute die alles richtig hatten.","replies":[]},{"poster":"Mea","date":"2019-09-24T21:05:23.996+0000","up_votes":1,"down_votes":0,"body":"klar wär ne Abstufung angenehm, aber mit deinem Beispiel unwirtschaftlich. Sticker oder n \"Pick´em\" Emote für Leute wäre ne Idee. Un es hatte tatsächlich schon jemand alles richtig, sogar öfters. Das Problem ist mittlerweile, dass die Spieler besonders die älteren Ultimativen Skins einfach schon besitzen... ","replies":[]}]},{"poster":"Aelc","date":"2019-09-24T19:03:20.546+0000","up_votes":10,"down_votes":0,"body":"Also mal ganz ehrlich\r\nwar letztes mal unter den besten 1% und habe trotzdem nicht alles richtig getippt - aber auch nichts bekommen. Fand ich schon sad...","replies":[]},{"poster":"Call Μe Senpai","date":"2019-09-24T17:38:16.506+0000","up_votes":6,"down_votes":2,"body":"Was ist wenn man alle skins schon hat ^^ {{summoner:3}} ","replies":[{"poster":"Determann","date":"2019-09-24T17:55:24.305+0000","up_votes":8,"down_votes":0,"body":"Haha ein wahre Legende ","replies":[]},{"poster":"Chompi40","date":"2019-09-24T17:54:31.454+0000","up_votes":8,"down_votes":1,"body":"Dann hast du eh zu viel Geld ins Spiel gesteckt\r\n","replies":[{"poster":"Torpedofritten","date":"2019-09-24T19:49:17.580+0000","up_votes":4,"down_votes":0,"body":"ich habe mir zwei gekauft und 3 durch Kisten bekommen also viel geld war das nicht {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Pottmonster","date":"2019-10-08T18:40:10.552+0000","up_votes":2,"down_votes":0,"body":"Als der \"ultimative Payer\" fand ich dich sympatischer!\r\nJetzt seh ich dich nur noch als sch... lucker :D","replies":[]}]}]}]},{"poster":"EragonLee","date":"2019-09-24T18:51:48.729+0000","up_votes":1,"down_votes":1,"body":"Wir alle spielen lol weil immer etwas unvorhergesehenes passieren kann und wir schauen Elite-Spielern zu um zu sehen wie man sowas perfekt macht, deshalb wird es nie jemand schaffen alles richtig zu machen","replies":[{"poster":"excìte","date":"2019-09-25T10:55:50.770+0000","up_votes":3,"down_votes":0,"body":"also ich hab noch nie einem 'elitespieler' zugesehen {{sticker:slayer-jinx-wink}} ","replies":[]}]},{"poster":"Chompi40","date":"2019-09-24T17:55:32.190+0000","up_votes":5,"down_votes":2,"body":"Ich denke ein besserer Preis währe etwas wie ein Pax-Skin/Neopax-Skin","replies":[{"poster":"Mea","date":"2019-09-24T21:10:00.422+0000","up_votes":1,"down_votes":0,"body":"die werden leider nie wieder kommen... heul... -.-","replies":[]}]},{"poster":"Aphêliοs","date":"2019-09-24T17:37:16.392+0000","up_votes":2,"down_votes":4,"body":"Was ist wenn man schon 2-3 Ultimates hat? Kriegt man dann die RP? ","replies":[{"poster":"naniwakaze","date":"2019-09-24T18:29:41.805+0000","up_votes":5,"down_votes":1,"body":"Ich glaube, du bekommst sie als Shards, kannst sie also dann für Essenzen entzaubern.","replies":[]},{"poster":"FtNx Carbon","date":"2019-09-24T17:48:20.336+0000","up_votes":2,"down_votes":0,"body":"Nope.","replies":[]}]},{"poster":"WhyM","date":"2019-10-09T15:32:37.905+0000","up_votes":2,"down_votes":0,"body":"bin ich der einzige bei dem das Tippspiel nich da is?","replies":[{"poster":"HyperionCH","date":"2019-10-09T17:24:48.525+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhyM,realm=EUW,application-id=hGYdiTd1,discussion-id=vnUEaNK2,comment-id=0011,timestamp=2019-10-09T15:32:37.905+0000)\n>\n> bin ich der einzige bei dem das Tippspiel nich da is?\n\nIm schlimmsten Fall mit mir zusammen die einzigen. :D","replies":[]}]},{"poster":"Selryz","date":"2019-10-02T06:51:18.575+0000","up_votes":2,"down_votes":0,"body":"Wo finde ich denn das Tippspiel?","replies":[]},{"poster":"Challapenjo","date":"2019-09-24T17:48:07.776+0000","up_votes":7,"down_votes":44,"body":"Alle ultimate skins ist echt low für den perfekten pick. Ich glaub letztes Jahr hat es keiner geschafft und das Jahr davor nur 2 Leute. Alle skins freischalten ist echt das Mindeste dafür, vorallem da es euch nichts kostet","replies":[{"poster":"2nd Sin Greed","date":"2019-09-24T18:05:41.699+0000","up_votes":23,"down_votes":7,"body":"Klar du würdest auch einen Großteil deiner Kapitalanlage für ein Gewinnspiel raushauen und verschenken weil einer richtig lag. Riot gibt dir bereits ein komplettes f2p Spiel ohne p2w Aspekte mit regelmäßigen Updates, aber Geier wie du bekommrn wohl nie genug 😂","replies":[{"poster":"Re4p3rr","date":"2019-09-29T15:53:25.523+0000","up_votes":2,"down_votes":7,"body":"Ohne Pay to win Aspekte AHAHAHAHAHA OMEGALUL !! Es gibt mindestens 20 Skins die dir einen Vorteil verschaffen xD. Aber ey gibt immer diesen einen Typ der einfach alles verteidigen muss weil er der übertriebenste Fanboy ist. Gutmenschen ahoi","replies":[{"poster":"2nd Sin Greed","date":"2019-09-29T19:03:40.628+0000","up_votes":4,"down_votes":1,"body":"Interessant wie du meine anderen Argumente mit einbeziehst. Es gibt skins die marginal p2w sind wie zb Surfer Singed der 1 dmg mehr macht wenn er von Nami geulted wird etc oder \"bessere\" Animationen haben. Wenn du dich jedoch an basic Animationen gewöhnt hast ist das auch kein \"Vorteil\" mehr. Und dank der regelmäßigen VU der Helden wird die Qualität überall angehoben sodass sämtliche Animationen gut sichtbar sind. Aber gut vielleicht kennst du ein besseres 100% f2p Spiel :) Spiel das einfach ^^","replies":[{"poster":"Kegse","date":"2019-09-30T10:21:39.938+0000","up_votes":2,"down_votes":0,"body":"also ich glaube 1 dmg mehr ist nicht sooo wild in Lol, da reicht ja wegflashen damit die Hp regeneration das wett macht 🤔","replies":[]},{"poster":"Re4p3rr","date":"2019-09-30T13:09:51.781+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=2nd Sin Greed,realm=EUW,application-id=hGYdiTd1,discussion-id=vnUEaNK2,comment-id=0004000000000000,timestamp=2019-09-29T19:03:40.628+0000)\n>\n> Interessant wie du meine anderen Argumente mit einbeziehst. Es gibt skins die marginal p2w sind wie zb Surfer Singed der 1 dmg mehr macht wenn er von Nami geulted wird etc oder \"bessere\" Animationen haben. Wenn du dich jedoch an basic Animationen gewöhnt hast ist das auch kein \"Vorteil\" mehr. Und dank der regelmäßigen VU der Helden wird die Qualität überall angehoben sodass sämtliche Animationen gut sichtbar sind. Aber gut vielleicht kennst du ein besseres 100% f2p Spiel :) Spiel das einfach ^^\n\nP2w Skin abuser detected","replies":[{"poster":"2nd Sin Greed","date":"2019-10-01T16:03:50.915+0000","up_votes":1,"down_votes":0,"body":"Schade dass man sich nicht vernünftig mit dir unterhalten kann. Ich nehme an wo es \"Fanboys\" gibt, gibt es auch die Hater, die alles meist ohne Sinn und Verstand schlecht machen ^^ Surfer Singed besitze ich zudem nicht, das war nur ein Beispiel :)","replies":[{"poster":"2nd Sin Greed","date":"2019-10-01T16:04:47.487+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2nd Sin Greed,realm=EUW,application-id=hGYdiTd1,discussion-id=vnUEaNK2,comment-id=000400000000000000010000,timestamp=2019-10-01T16:03:50.915+0000)\n>\n> Ich nehme an wo es \"Fanboys\" gibt, gibt es auch die Hater, die alles meist ohne Sinn und Verstand schlecht machen ^^ \n\nMein Beitrag zum Schubladendenken.","replies":[]}]}]}]}]}]},{"poster":"Mea","date":"2019-09-24T21:08:56.261+0000","up_votes":5,"down_votes":0,"body":"Das können wir gerne so einführen! Der/Die Gewinneraccount(s) bekommt alle verfügbaren Skins, meinetwegen sogar in die Zukunft gedacht alle Skins, ABER!!!: Damit das möglich ist wird Pick´em wohl für ALLE Spieler dann 5€ kosten... ok ne deine Idee ist ziemlich mies...","replies":[{"poster":"Pottmonster","date":"2019-10-08T18:44:30.536+0000","up_votes":1,"down_votes":0,"body":"wieso müsst das dann was kosten? Ich mein.. es werden doch eh wieder nur äußerst wenige alle 6 richtige mit Zusatzzahl haben :D","replies":[{"poster":"Mea","date":"2019-10-09T19:06:15.842+0000","up_votes":1,"down_votes":0,"body":"Ja schon, aber es besteht ja die Chance ;P Außerdem ist meine Intention vielmehr zu sagen: Leute das ist ein Tippspiel OHNE Einsatz, also finde ich es nicht in Ordnung, dass Leute meinen dann gierig werden zu müssen. Theoretisch könnten auch optimistisch gesehen mal 10 Spieler das Tippspiel gewinnen und bekommen alle Skins im Wert von 19500 RP! Das sind pro Spieler ~140€, die Riot da herausgibt! Für ein Rate-Spiel! Wenn der Gewinn wahrscheinlicher wäre, wär der Preis um einiges niedriger und das wäre dann der neue Streitpunkt dieser Menschen...","replies":[]}]}]}]},{"poster":"TNL5 Butz","date":"2019-09-24T18:27:05.288+0000","up_votes":2,"down_votes":0,"body":"Also alles richtig erraten/tippen seh da kein Problem\r\n\r\nlol","replies":[]},{"poster":"Kubisili","date":"2019-09-24T17:34:33.010+0000","up_votes":2,"down_votes":0,"body":"eZ Clap {{summoner:31}} ","replies":[]},{"poster":"W33DY91","date":"2019-09-25T11:20:13.754+0000","up_votes":3,"down_votes":1,"body":"Entweder man macht mit oder halt nicht es ist ein Free to Play game also heult mal alles leise Chantals!","replies":[]},{"poster":" Dragon of Green","date":"2019-10-08T19:39:38.794+0000","up_votes":1,"down_votes":0,"body":"Also ich bin einfach froh, dass man überhaupt etwas for free bekommt","replies":[]},{"poster":"Support Hotline","date":"2019-09-30T15:35:10.884+0000","up_votes":1,"down_votes":3,"body":"LoL Habe schon alle Ultimate Skins... ","replies":[{"poster":"Mandarin Duck","date":"2019-10-03T03:27:13.407+0000","up_votes":1,"down_votes":0,"body":"Glückwunsch, Keks gefällig?","replies":[{"poster":"Support Hotline","date":"2019-10-04T09:41:57.266+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mandarin Duck,realm=EUW,application-id=hGYdiTd1,discussion-id=vnUEaNK2,comment-id=000c0000,timestamp=2019-10-03T03:27:13.407+0000)\n>\n> Glückwunsch, Keks gefällig?\n\nDas wäre nett von dir, Danke! Einen Keks habe ich nämlich nicht {{item:2054}}","replies":[]}]}]},{"poster":"NT9 Neogize","date":"2019-10-02T16:35:39.319+0000","up_votes":1,"down_votes":0,"body":"Ich finde es toll, dass Riot uns überhaupt so etwas ermöglich, auch wenn die Gewinnchancen echt niedrig sind. {{sticker:sg-lux}} ","replies":[]}]}