{"poster":"[COULD NOT READ POSTER]","date":"2015-10-24T17:49:30.347+0000","title":"Fnatic: Europas letzte Hoffnung?","subforum":"Esports","up_votes":3,"down_votes":3,"body":"In League of Legends ist Teamwork alles: Je besser Spieler miteinander spielen, umso erfolgreicher können sie sein. Besonders Fnatic und KOO Tigers glänzten in diesem Bereich und bilden sowohl auf der Kluft, als auch im privaten Leben eine perfekte Einheit.","replies":[{"poster":"Tarnatus","date":"2015-10-24T18:56:54.473+0000","up_votes":2,"down_votes":0,"body":"Ich bin für Fnatic. Gegen EDG hat man gesehen, dass es nicht unbedingt Huni braucht damit sie gewinnen und dass auch Febiven oder Rekkles dominieren können, wenn Huni zuviel Druck bekommt. Natürlich ist wie immer ist das gute Shotcalling von Yellowstar entscheidend. Das größte Problem mit dem Fnatic gegen KOO klarkommen muss, ist meiner Meinung nach Smebs Fiora. Smeb ist einfach unfassbar stark damit. Zwar hat Huni gegen KurO gezeigt, dass er mit Riven kontern kann, aber Smeb ist einfach noch um einiges besser damit als KurO. Fiora muss eigentlich ein Pflichtban sein, was aber wieder andere Champs durchlässt. Ich freue mich auf jedenfall auf das Match und denke wenn Fnatic die gleiche Leistung wie gegen EDG zeigt bzw. sich noch steigert und nicht in die Verhaltensweise des ersten Tags der Gruppenphase zurückfällt, werden sie die Nase vorne haben. ","replies":[]},{"poster":"Tealights","date":"2015-10-24T19:11:02.122+0000","up_votes":3,"down_votes":1,"body":"Dear Fnatic,\r\nwhat really seperates you from other teams, is your team spirit. This is something you can be proud of, since it is embodies an attitude that is quite often neglected in eSports.\r\nIn life so as in the rift, your message is \"one for all\" and \"all for one\". Keep up the great work!\r\n#goFnatic","replies":[]},{"poster":"VANILECOLA","date":"2015-10-24T19:19:33.018+0000","up_votes":2,"down_votes":1,"body":"Fnatic wird das schaffen aber skt dieses jahr weltmeister\r\n{{champion:268}} {{champion:266}} {{champion:103}} {{champion:84}} {{summoner:4}} {{summoner:14}} ","replies":[]},{"poster":"Novaquenz","date":"2015-10-24T22:40:10.210+0000","up_votes":1,"down_votes":0,"body":"> Fnatics Gegner im Viertelfinale, die KOO Tigers, sind eine ähnliche Bande. Tippfehler gespottet :D ","replies":[{"poster":"Miso","date":"2015-10-25T10:35:47.324+0000","up_votes":1,"down_votes":0,"body":"Huh?","replies":[{"poster":"Novaquenz","date":"2015-10-26T14:00:36.868+0000","up_votes":1,"down_votes":0,"body":"Koo Tigers sind Fnatics Gegner im Halbfinale. Im Viertel waren es EDG","replies":[]}]}]},{"poster":"LZ Flame","date":"2015-10-25T01:04:08.225+0000","up_votes":1,"down_votes":0,"body":"die Enttäuschung wird groß sein wenn  koo fnatic schlagen wird","replies":[]},{"poster":"Bubblecoin","date":"2015-10-24T20:10:44.311+0000","up_votes":1,"down_votes":0,"body":"Als Koreaner denke ich auch, dass Fnatic gegen Koo Tigers ziemlich bessere Chance hat als Origen gegen SKT. Aber trotzdem ist es falsch zu sagen,dass Fnatic gegen Koo ueberwiegend dominant ist. Also muessen sich die beiden Teams  mit grossem Respekt zueinander auf das kommende Match vorbereiten. Mit der winzigen Unterschaetzung aufeinander muesste das ganze Match verkehrt laufen, weil die Chancen an den beiden Seiten nicht groesser als 50 prozent sind.","replies":[]},{"poster":"Nightshadoof","date":"2015-10-25T15:27:08.156+0000","up_votes":1,"down_votes":1,"body":"Also so wie die heute spielen selbst wenn sie es noch rumreißen, verdient ist es nicht das von Fnatic heute ist Bangkok Titans Niveau. Echt keine gute Leistung.","replies":[]},{"poster":"NeXaReYe","date":"2015-10-24T23:11:55.050+0000","up_votes":1,"down_votes":1,"body":"FNC ist sowieso des beste Team:D{{champion:268}} ","replies":[]}]}