{"poster":"[COULD NOT READ POSTER]","date":"2019-02-19T15:22:40.190+0000","title":"Magie im LEC-Studio","subforum":"Esports","up_votes":0,"down_votes":0,"body":"[BODY IS EMPTY]","replies":[{"poster":"Leonsax","date":"2019-02-21T12:56:52.974+0000","up_votes":2,"down_votes":0,"body":"An sich finde ich das neue Studio mega gut, allerdings bin ich der Meinung, dass der Wartebereich, in den man sich während den Spielpausen aufhalten kann, an Qualität und Content stark abgenommen hat. In Season 8 war ich insgesamt 5 mal im Studio und es war immer wieder schön zu sehen, dass wenn man ins Gebäude kam, der Eingangsbereich mit Pokalen, Brettspielen und Figuren dekoriert war. Zudem gab es auch das League Unlocked Programm, bei dem man sich in den Spielpause eintragen konnte und dann für die nächsten ein oder zwei Wochen auf seinem League Account kostenlose Skins, Champions und ein 5% XP Boost bekam. Für treue Fans gab es auch Stempelkarten, bei der man ab einer bestimmten Anzahl von Besuchen einen goody bag mit kleinen Figuren, Bechern, Schlüsselanhängern, etc bekam. Als ich dann voller Vorfreude in der zweiten Spielwoche in das Gebäude ging, war ich erstmal enttäuscht, da all die Dinge, die ich aufgezählt habe verschwunden waren. Zwar gab es noch ein paar Figuren, welche in Vitrinen standen aber sonst war fast alles Alte weg. Die Idee mit dem Rift Scuttler finde ich an sich gut, jedoch fühlt sich der große Eingangsbereich, trotzt der Baron Statue,sehr leer an. Auch die Features wie League Unlocked und die Stempelkarten habe ich vermisst. Im großen und ganzen, finde ich das neue Studio an sich gelungen, bis halt auf die Änderungen, welche nur der Besucher zu Gesicht bekommt. ","replies":[]},{"poster":"Timur888","date":"2019-02-20T15:10:22.134+0000","up_votes":1,"down_votes":0,"body":"Ich war zwar noch nicht dar aber nen Merch Store wäre lit","replies":[{"poster":"HGS Zurok","date":"2019-02-20T15:15:43.858+0000","up_votes":2,"down_votes":0,"body":"Gibt es doch schon :)","replies":[]}]}]}