{"poster":"[COULD NOT READ POSTER]","date":"2019-08-27T15:00:37.347+0000","title":"Ausblicke auf die Zukunft der „LoL“-E-Sport-Szene","subforum":"Esports","up_votes":0,"down_votes":0,"body":"[BODY IS EMPTY]","replies":[{"poster":"Ryxah","date":"2019-08-28T15:27:47.025+0000","up_votes":7,"down_votes":0,"body":"„Unser Sport [...] wird für den positiven Einfluss, den er auf unsere Gesellschaften hat, anerkannt.“\r\n\r\nWie ist das denn zu verstehen? Von wem wird „unser Sport“ in Deutschland denn bitte anerkannt? Von offizieller Seite? Das letzte was ich da mitbekommen habe, war das genau Gegenteil. Von der Gesellschaft? Falls hier die allgemeine deutsche Gesellschaft gemeint ist, bekomme ich wohl nichts mit. Vielmehr wird die im Volksmund als „zocken von Computerspielen“ bekannte und häufig auch übliche Redensart in der Gesellschaft als negativ angesehen. Vielmehr wird man von vielen (älteren) Mitgliedern der Gesellschaft schlicht nur belächelt, sollte man es wagen sich als „Spieler“ zu outen.\r\nIst hier also mit „unsere[n] Gesellschaften“ nur die jüngeren Generationen zu betrachten? \r\n\r\nMir ist bewusst, dass vor allem die E-sport szene von League weltweit an Popularität mit den traditionellen und weltweit anerkannten Sportarten vergleichbar ist, doch diese Formulierung ist mir direkt ins Auge gesprungen und ich halte sie so, wie sie jetzt, ist vor allem in Deutschland für ‚nicht zutreffend‘. \r\n\r\nIch würde mich über ALLE Antworten in Bezug zu meiner Sicht unabhängig eurer Meinung freuen. \r\n\r\nMfG \r\nHitman\r\n\r\n \r\n","replies":[{"poster":"Taktikfreund","date":"2019-08-28T16:33:13.190+0000","up_votes":2,"down_votes":0,"body":"Dieser Punkt war ja auch auf die Frage bezogen: „Was ist die motivierendste Zukunft für den E-Sport von League of Legends und wie können wir diese verwirklichen?“\r\n\r\nAlso so wie ich das aus dem Artikel herausgelesen habe, glaube ich, dass sie sich diese Aussage als Ziel setzen, d.h., dass man in Zukunft eben sagen soll: „Unser Sport [...] wird für den positiven Einfluss, den er auf unsere Gesellschaften hat, anerkannt.“\r\n\r\nWürde ich jetzt zumindest mal so interpretieren :)","replies":[{"poster":"Ryxah","date":"2019-08-28T21:26:00.097+0000","up_votes":3,"down_votes":0,"body":"Angenommen es wären DIE Ziele von Riot, würde ich sagen: \r\n\r\nPunkt 1 ist seit jeher DAS Konzept von League. Vor allem das Wettkampforientierte war schließlich von Anfang an ein Versprechen der Gründer von Riot. \r\n\r\nPunkt 2 ist bereits erfüllt. Gerade durch ihr besonderes Spiel und durch die Bekanntheit (in der Esport szene) und den hohen Beliebtheitsgrad bei den jungen Spielern. \r\n\r\nPunkt 3 halte ich für nicht umsetzbar (zumindest in den nächsten Jahren), da sehr viele ältere Leute generell gegen Computerspiele sind. Zum Beispiel wurde ich einmal gefragt, ob ich nichts besseres zu tun hätte als ich eines Nachmittags in der Kluft unterwegs war. Diese Person konnte den Wert von Computerspielen einfach nicht nachvollziehen und sah nur die Zeit die ihrer Meinung nach „komplett vergeudet sei“. Vielleicht ist das einfach „der Fluch der Generationen“, geprägt von erlebtem, geformt von Erfahrungen, oder halt in diesem Falle fehlenden Erfahrungen, wie es ist mit PC Games und dem ganzen Medientrubel im Fernsehen, auf sozialen Netzwerken mit der ganzen Welt vernetzt aufzuwachsen. \r\nZudem sollte man nicht vergessen, wie schwer es zu beginn für alle Neueinsteiger ist. League ist leider alles andere als bekannt für seine Einsteigerfreundlichkeit. Ich denke wir alle wissen wie lange es dauert sich in diesem komplexen, manchmal viel zu groß scheinenden, doch mindestens genauso fesselnden Universum zurechtzufinden. \r\n\r\nMfG \r\nHitman\r\n\r\nP.S. Ich freue mich sehr über all eure Kommentare😉","replies":[]}]},{"poster":"Desdämona","date":"2019-09-01T12:00:24.227+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich das mal so sagen darf, seit Ihr in Deutschland bereits gut unterwegs! Hier in der Schweiz, wird es immer noch und viel mehr verpönt, wenn man von Esports redet. \" Das isch ke richtigi Büetz\", nach dem Motto was auf dem Papier keine schwarzen Zahlen bringt oder Steuern bezahlst  ist für  die Katz. Wir haben jetzt immerhin die Swisscom Hero Leage und ich hoffe Sie kann sich weiterentwickeln, aber im Moment steht es ziemlich in den Sternen geschrieben...\r\n\r\nUnd wenn Riot die Worlds unvergesslich machen will dieses Jahr für seine Fans, wieso zum Kuckuck wird nicht für eine Simultane Übersetzung gesorgt, für alle Landessprachen? Wieso dürfen Paris und Madrid in Ihren Landessprachen veranstalten aber Berlin nicht???? Nein die müssen ja auf English!!! Das sind Sache die mich m meisten Sauer machen! \r\n{{sticker:slayer-jinx-unamused}} ","replies":[]}]},{"poster":"Ívy","date":"2019-08-28T17:09:29.116+0000","up_votes":3,"down_votes":0,"body":"Ich finde den Post gerade mehr als passend, und die Gedanken gehen in die richtige Richtung (meine Meinung). Momentan schreibe ich meine Bachelorarbeit über E-Sport in Deutschland und wer was machen müsste um mehr Anerkennung und vor allem Akzeptanz zu erreichen in unserer Gesellschaft. Das ganze steht noch in den Startlöchern. ← vielleicht liest das ja jemand den das Projekt interessiert und mir vielleicht paar Gedanken und Meinungen dazu geben möchte. \r\nLg Ivy ","replies":[{"poster":"Ryxah","date":"2019-08-28T21:50:39.090+0000","up_votes":2,"down_votes":0,"body":"Viel Erfolg erstmal für deine Bachelorarbeit🍀 \r\nIch selbst durfte mich bereits damit ein wenig auseinandersetzen als ich ein Referat über den Esport halten musste. \r\nIch finde, dass der Esport im laufe der Jahre kontinuierlich populärer wird, einfach da die jungen Generationen sich für die verschiedensten Spiele begeistern und die vehementesten Kritiker zu den älteren Generationen gehören. Ebendiese werden immer weniger, während der Esport heute noch ein „aufsteigender Stern“ ist (der unter dem Schutz der Star Guardian steht 😜) und noch lange nicht sein volles Potential erreicht hat. Bereits heute werden große Stadien für Esport-Events genutzt, wie man zum Beispiel an der anstehenden WM festmachen kann, was zeigt, dass obwohl der Esport noch nicht einmal in allen Ländern als Sport anerkannt ist, trotzdem mit den traditionellen Sportarten (Fußball, Basketball,...) konkurrieren kann. \r\nStelle man sich nun einmal den Esport in 10 Jahren als weltweit offiziell anerkannte Sportart vor, die ein fester Bestandteil der Olympischen Spiele ist...\r\n\r\nZudem wurde bewiesen, das der Körper von Profispielern aus dem Esport die selben Stoffe freisetzt, wie der eines „normalen“ Spitzensportlers. \r\nAuch sitzen die Esportler nicht entspannt hinterm Schreibtisch und genießen entspannt die Show. Teilweise wurden bis zu 300 Tastenanschläge pro Minute bei Esportmatches aufgezeichnet. \r\n\r\nWährend Esport immernoch um Anerkennung kämpfen muss, zählt zum Beispiel Schach zu den offiziellen Sportarten. \r\n\r\nIch hoffe es hilft einen Anfang für deine Arbeit zu finden und danke für deinen Kommentar👍\r\n\r\nMfG \r\nHitman","replies":[{"poster":"Ívy","date":"2019-08-29T10:52:51.481+0000","up_votes":2,"down_votes":0,"body":"Danke, danke ; ) \r\nich bin auch der Meinung, dass es immer besser wird aber mir fehlt halt noch der \"große\" Durchbruch es fühlt sich so an als wäre die Gamingszene für sich und die Gesellschaft lebt so drumherum und meine Vorstellung ist eigentlich diese, dass wir als Gemeinschaft akzeptiert werden. Mir geht es so auf den piss wenn man nach seinem Hobby gefragt wird und man zocken/Gaming etc sagt man immer noch sofort abgestempelt wird. Es soll nicht zur Diskussion ob Games gut oder schlecht sind sondern, dass wir ein recht haben normale menschen und gleichzeitig Gamer zu sein. Aber ja du hast recht, Schach ist ne Sportart, Dart ist Sport wenn ich Krocket spielen würde wäre es eher interessant aber Gaming ist leider immer noch ein kleines Problem für viele. Aber das kann leider Riot selbst auch nichts groß ändern aber ich bin schon mal froh, dass sie in die richtige Richtung gehen. ","replies":[{"poster":"Ryxah","date":"2019-08-30T21:49:44.686+0000","up_votes":2,"down_votes":0,"body":"Genau das ist das Problem. Egal was Riot, Blizzard oder auch Epic Games machen, sie sind nicht diejenigen, die entscheiden, wie die Gamingbranche von der Gesellschaft angesehen wird. Wir alle sind zwar nur ein kleiner Bestandteil dieser riesigen Gesellschaft und wir müssen als Community (Gamer) sagen: „Gaming ist unsere Leidenschaft. Esport ist unsere Championleague. League ist nach einem anstrengenden Tag unsere Zuflucht. Das ist es worauf wir Stolz sind und was UNS ausmacht.“\r\n\r\nDamals haben unsere Eltern auch nicht immer alles so gemacht, wie deren Eltern es sich vielleicht gewünscht hätten. Aber heute sind sie die Eltern. Und wir die jüngeren, die, die sagen: „Hey! Wir leben unser Leben und wir haben nicht immer die selben Wünsche und Träume wie ihr. Wir entscheiden uns bewusst für das, was uns viel bedeutet und zwar so, dass wir es später nicht bereuen werden.“ \r\nDie Welt hat sich in den letzten 50 Jahren so sehr verändert. Ferne Kontinente sind näher gerückt. Ozeane geschrumpft und obwohl die Welt fast schon zu einem Dorf wurde, bietet sie doch so viel mehr zu sehen und zu erleben und zu entdecken. Trotz all dem Trubel ist sie nichts im Vergleich zu dem geballten Sturm in der virtuellen Realität, die das Dorf auf die Größe  eines einzigen Zimmer verringert. \r\n\r\nMfG \r\nHitman\r\n\r\nP.S. Mann, ist das schon wieder lang geworden XD\r\n","replies":[{"poster":"Ívy","date":"2019-09-03T12:39:17.862+0000","up_votes":2,"down_votes":0,"body":"@CHRISTALSOLDIER - danke für deine Bemerkungen : )\r\nmir ist schon klar, dass ESport weit aus schwieriger zu fassen ist als \"normaler\" sport :) und mir geht es nicht NUR um die Förderung der ESL in Deutschland sondern mehr um die Anerkennung der Gamingszene in Deutschland. Ich persönlich finde, dass wenn die Situation in der Gesellschaft besser wird, wird auch der ESport sich bessern - denn warum sollte man etwas unterstützen/fördern was in vielen Augen der Leutchen hier in Deutschland verpönt wird? - Da ist eher mein Ansatz zu sagen Die Gamingindustrie ist wichtig und für viele hier relevant in ihren Leben - und wenn das angekommen ist wird der Schritt zum \"ESport fördern\" ein eher kleinerer und hoffentlich einfacher weg. Und so wie ich viele Entwickler(wie Riot) verstehe wollen sie, dass ihr Spiel uA in der ESL gespielt werden und sehe da eher weniger das Problem. Aber den Punkt mit den Besitzrechten des Spiels wird auf jeden Fall ein großer Kritikpunkt bleiben.. \r\n~Ivy","replies":[]},{"poster":"Christalsoldier","date":"2019-09-02T05:42:25.140+0000","up_votes":1,"down_votes":0,"body":"Vom Prinzip stimme ich allem zu aber es gibt nunmal immernoch probleme die rein des esport betreffen und geklärt werden müssen um in Deutschland und anderen ländern offiziell als sport anerkannt zu werden:\r\n1. **WEM GEHÖRT DER SPORT**\r\nDie frage klingt vielleicht doof, aber jeder kann fussball spielen weil der sport niemandem gehört. Soll heissen man braucht etwas das einem ball auch nur ähnelt und schon kann man fussball spielen. Beim esport ist das so n sache, weil man alles extrem abhängig von den entsprechenden etwicklern ist. nur so als gedankenspiel: was ist wenn Riot oder valve oder iwer anderes sagt: _Unser Spiel XY ist uns vorbehalten und niemand anderes darf eine Liga oä veranstalten._ Dann schauen die Gamer doof aus der Wäsche. Der Grund trifft zum Beispiel auf Schach nicht zu: niemand kann dir verbieten Schach zu spielen. aber beim esport kann riot games zum beispiel sagen _Spieler XY ist uns ein Dorn im Auge der wird jetzt gebannt_ und es ist ihr gutes Recht weil das Spiel nunmal ihr persönliches Eigentum ist.\r\n2. **WAS GEHÖRT ZU ESPORT**\r\nWelche Spiele sind denn esport titel und welche nicht? und wer entscheidet wer in diese Liste aufgenommen wird? Auch die frage scheint erstmal blöd dahingestellt aber man muss sich folgendes überlegen: In Deutschland gibt es für Sportler anerkannter Sportarten zum Beispiel besondere Visa, damit sie ihre \"Arbeit\" hier ausführen können. Selbes sollte meiner meinung nach auch für eportler gelten. Nun aber die frage wie diese denn definiert werden. Also welche Spieler welcher Spiele sind denn Sportler im Sinne des epsort? Bei LoL oder CSGO wird jeder sofort zustimmen. Aber wo hört das auf? Hört das auf wenn ich meine eigene Blobby Volley Liga aufstelle oder hört es auf bei sing it oder dance it? Es muss also irgendwie definiert werden \"Was genau ist esport und welche Titel sind teil davon\". Diese Frage ist auch interessant, weil man sich ja nur schwer eine schier endlos lange liste an Titeln abarbeiten kann bevor die Kategorie \"Esport\" in Olypmia abgearbeitet ist.\r\n\r\n\r\nDas sind mal ein paar anreize über die man auf jedenfall nachdenken sollte und auch muss bevor man fordert, dass esport als sport anerkannt werden sollte.\r\n\r\n\r\nPS an den dude mit seiner Bachelorarbeit: wenn nicht schon geschehen dann geh doch mal auf die Seite des Olympischen Komitees und les dir den Artikel durch bzw die Begründung warum es nicht Olympisch geworden ist da sollten ein paar gedankenansätze drin stehen.\r\n\r\nMfG Christalsoldier","replies":[]}]}]}]}]},{"poster":"genrlrambo","date":"2019-08-30T17:01:03.968+0000","up_votes":2,"down_votes":0,"body":"\"Schanghai\" haha","replies":[]},{"poster":"Chisakura","date":"2019-08-28T16:18:33.101+0000","up_votes":2,"down_votes":0,"body":"Ich muss dem leider zustimmen.\r\nGehen wir mal von dem Generationenunterschied  aus, der ja recht weit auseinander liegt, da sind die ältern Spieler eh aus dem rennen und werden als Nerds bezeichnet und die jüngeren sind eben so wenig anerkannt, wenn sie sich als Spieler outen hält die Gesellschaft nicht viel davon, der Stellenwert ist somit gleich Null.","replies":[{"poster":"Ryxah","date":"2019-08-28T21:58:33.023+0000","up_votes":2,"down_votes":0,"body":"Auch an dich ein Dankeschön für deine Antwort. Es tut gut so viele ehrlichen Rückmeldungen zu bekommen. Und um es mal kurz und knapp zu halten: Ja. Genau das ist das Problem. Diese absolute Ablehnung schafft eine große Kluft (hähä) zwischen den Generationen. \r\n\r\nMfG \r\nHitman ","replies":[]}]},{"poster":"Pol Duran","date":"2019-08-31T14:30:05.079+0000","up_votes":1,"down_votes":0,"body":"Ich selbst erwarte grosses von der WM in Paris. Die WM in Berlin war spielerisch und rein von der Partie her super, aber die Show war **erbärmlich** im Vergleich zu den vorherigen und vor allem nachfolgenden Weltmeisterschaften. \r\n\r\nIch hoffe wirklich, dass es dieses Jahr anders ist. Jedenfalls bezüglich der Show. Die Spiele dürfen natürlich wieder toll sein XD\r\n\r\n","replies":[]}]}