{"poster":"Ireliα","date":"2016-01-18T15:51:10.801+0000","title":"Rollenverteilung im neuen Matchmaking bindend?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":2,"body":"Riot hat ja immer viel Wer darauf gelegt die Meta den Spielern nicht zur Pflicht zu machen. Das wird bekanntlich mit der neuem Modus abgeschafft, folglich meine Frage:\r\nWerden Spieler in Zukunft bestraft wenn sie nicht die f&uuml;r sie ausgew&auml;hlte Position besetzen? Gibt es da irgendeine Ank&uuml;ndigung seitens Riot?","replies":[{"poster":"BGGL Silence","date":"2016-01-18T18:28:22.210+0000","up_votes":3,"down_votes":0,"body":"Ich denke, wenn du dich mit deinem mitspieler einigen kannst, könnt ihr die rollen Switchen.","replies":[]},{"poster":"SneakyKitten","date":"2016-01-20T09:29:55.900+0000","up_votes":2,"down_votes":0,"body":"Natürlich kann man trotzdem die Lane wecheln. Ich hatte heut Nacht ein Spiel wo jemand den neuen \"Modus\" ausprobiert hat und ausversehen \"Bot\" statt \"Support\" gewählt hatte. Problem war nur das er Support spielen wollte genauso wie ich. Hatte ihm daraufhin angeboten das ich den ADC spielen kann und schon war ruhe und alle Glücklich :P","replies":[{"poster":"Ireliα","date":"2016-01-20T15:57:53.959+0000","up_votes":1,"down_votes":0,"body":"Das es diese Möglichkeit gibt ist mir klar. Mir geht es eher um die Situation des Spielers der \"only mid\" spielt, seine zweite (eigentlich ungewollte) Rolle bekommt aber vor dem eigentlichen Midlaner picken darf und dann doch die Mitte nimmt.\n\nAber ich scheine mich im Eingangstext nicht klar genug ausgedrückt zu haben, nächstes Mal wird's doch wieder ein Roman^^","replies":[{"poster":"XPekeks","date":"2016-01-21T10:59:40.486+0000","up_votes":2,"down_votes":0,"body":"Wenn ich mich nicht irre kannst du sogar auch only Mid auswählen, dauert dann einfach länger eine Gruppe zu finden. \n\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"A Dragons Heart","date":"2016-01-19T15:20:08.957+0000","up_votes":2,"down_votes":0,"body":"Lyte hat auf ask.fm gesagt, dass es dafür eine Reportfunktion geben wird. Abzuwarten bleibt, inwiefern es Tauschmöglichkeiten der Rolle gibt, wie zB. bei ARAM.","replies":[]},{"poster":"Brofudge","date":"2016-01-18T16:00:53.058+0000","up_votes":3,"down_votes":1,"body":"Ja, aber wenn du etwas von der Meta abweichendes spielen möchtest, kannst du dir ja ein paar Freunde schnappen und das dann mit denen durchziehen, da wird niemand ein Problem mit haben. Aber du musst bedenken, dass wenn du das mit 4 Randys machst, dass sie sich auch irgendwo zurecht aufregen, weil sie hatten kaum Chance sich darauf einzustellen und du dann deinen Spaß über deren stellst. Das verstösst so weit ich weiß, gegen den Pfad der Beschwörer.","replies":[{"poster":"Ireliα","date":"2016-01-18T16:03:43.558+0000","up_votes":2,"down_votes":0,"body":"Ich bin einer der Langweiler der sich quasi nie aus der Meta herausbewegt, insofern sind meine eigenen Bedenken gering. Es geht mir nur um ein allgemeines Verständnis :)","replies":[]}]},{"poster":"SuperplexP","date":"2016-01-21T15:17:25.483+0000","up_votes":1,"down_votes":1,"body":"Ich prophezeie mal ganz prophetisch folgendes:\n\n(vorab, anscheinend kann man beim momentanen Stand nicht Adc oder Support sondern nur Botlane auswählen (Hörensagen von ein paar Streams))\n\nAls Midlaner, Toplaner und Jungler hat man Wartezeiten, die vergleichbar mit dem Teambuilder sind. Die standardmäßigen Vollidioten (\"mid only or feed\" etc.)\nwerden recht schnell die glorreiche Möglichkeit entdecken, doch einfach Botlane zu nehmen, weil da die Wartezeiten ein paar Sekunden sind und dann trotzdem ihre Lane picken. Oder man landet mit zwei Botlane-Pickern in einem Team von dem beide Support oder beide Adc spielen (wollen).\n\nAlles in allem: das neue System ist der größte Müll und macht alles nicht besser sondern sogar schlimmer.","replies":[{"poster":"HyperionCH","date":"2016-01-21T17:44:41.472+0000","up_votes":1,"down_votes":0,"body":"Lyte von Riot hat darauf bereits ein Statement gegeben:\n\nWer eine andere Lane/Rolle spielt, als er in der DQ zugeteilt bekam, wird bestraft (reporten als \"unsportsmanlike\") und dies kann auch rasch zu einem perma führen.\n\nRiot wird also auch darauf achten, dass nicht getrollt wird.","replies":[]},{"poster":"Waldschrat86","date":"2016-01-21T17:29:45.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuperplexP,realm=EUW,application-id=KYnfKGf0,discussion-id=87aKHaIt,comment-id=0007,timestamp=2016-01-21T15:17:25.483+0000)\n>\n> Ich prophezeie mal ganz prophetisch folgendes:\n> \n> (vorab, anscheinend kann man beim momentanen Stand nicht Adc oder Support sondern nur Botlane auswählen (Hörensagen von ein paar Streams))\n> \n> Als Midlaner, Toplaner und Jungler hat man Wartezeiten, die vergleichbar mit dem Teambuilder sind. Die standardmäßigen Vollidioten (\"mid only or feed\" etc.)\n> werden recht schnell die glorreiche Möglichkeit entdecken, doch einfach Botlane zu nehmen, weil da die Wartezeiten ein paar Sekunden sind und dann trotzdem ihre Lane picken. Oder man landet mit zwei Botlane-Pickern in einem Team von dem beide Support oder beide Adc spielen (wollen).\n> \n> Alles in allem: das neue System ist der größte Müll und macht alles nicht besser sondern sogar schlimmer.\n\nNaja ich konnte 1 Spiel machen, bevor es deaktiviert wurde, die Rollenaufteilung ist:\n\nOben, Mitte, Jungle, Unten, Support. Es gibt also immer einen Sup nur das unten, ist recht offen, aber auch ok so, wenn man z.B. 1ADC bereits auf einer anderen Lane hat und dort etwas anderes spielen will.\n\nEs wurde bereits gesagt, dass die glorreiche Möglichkeit recht zügig zu Strafen führen wird.","replies":[]}]},{"poster":"Hannibal L3ctor","date":"2016-01-18T16:42:31.963+0000","up_votes":1,"down_votes":5,"body":"wenn du das spiel für dein team zerstören willst und die moral auf 0 setzen möchtest, mach das... \nkassiere reports und werde für dieses verhalten irgendwann bestrafst, da du dann gegen dein team agierst.\ndu kannst aber in der auswahl vorher mit deinem team versuchen das abzuklären.\n\nvergiss nicht: dies ist ein teamspiel und wenn du das team komplett ignorierst wirst du sehr wahrscheinlich reportet \"und das zurecht\"","replies":[{"poster":"Ireliα","date":"2016-01-18T17:14:07.427+0000","up_votes":1,"down_votes":0,"body":"Ich habe nirgendwo davon geredet, dass ich dies vorhabe. Im Gegenteil, ich hoffe, dass dies in meinen Spielen nicht vorkommt. Trotzdem, oder gerade deswegen, fände ich es interessant zu erfahren ob Riot diese \"Verstöße\" auch bestrafen wird oder es legitim ist.","replies":[{"poster":"Hannibal L3ctor","date":"2016-01-18T18:28:08.672+0000","up_votes":1,"down_votes":3,"body":"dies wird die zeit zeigen.. \naber wie in meinem post erwähnt wird man eher dadurch bestraft, dass man gegen das team agiert und so die strafe bekommt.","replies":[]}]}]},{"poster":"0815xand0r","date":"2016-01-18T16:25:54.655+0000","up_votes":1,"down_votes":0,"body":"Also ich habe nichts darüber gelesen, dass man bestraft würde, wenn man sich nicht an die Rolle hält, die man vorher gewählt hat. Allerdings ist es natürlich dem Team gegenüber unfair, wenn man Top/Jgl wählt und dann \"trollt\" und Mid geht. \nIn Absprache mit dem Team wird das übrigens natürlich und dann folgenlos möglich sein. Du kannst dann zwar ADC/Support wählen, dann aber mit 5 Leuten APCs auf der Toplane spielen. Das Problem ist eher, dass man sich dafür nicht gezielt anmelden kann.\n\nOb eine Bestrafung erfolgt, wenn man so gegen den Willen des Teams agiert, ist unbekannt, eine offizielle Äußerung diesbzgl. ist mir jedenfalls nicht präsent.","replies":[]},{"poster":"EpicDieterBohlen","date":"2016-01-18T15:52:43.808+0000","up_votes":1,"down_votes":0,"body":"gute frage^^ was wenn man double jungle oder double top spielen will (aus welchen gründen auch immer)","replies":[]}]}