{"poster":"Ireliα","date":"2016-10-31T12:08:01.921+0000","title":"Das Report System funktioniert nicht","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":10,"body":"In der Hoffnung, dass die meisten zuerst meinen Post lesen versuche ich es jetzt mal mit einem solchen Titel.\n\nAlso, wir alle kennen Forenmitglieder die sich hier &uuml;ber ihre &quot;ungerechtfertigten&quot; Strafen aufregen und die meisten von uns hatten bereits dieses nette Fenster, dass uns mitteilt ein Spieler w&auml;re auf Grundlage unserer Reports gepunisht worden. Bisher habe ich, wie viele hier im Forum auch, das als Beleg f&uuml;r ein funktionierendes Reportsystem genommen.\n\nJetzt zum eigentlichen, ich habe einen guten RL Freund. Er war eine Zeit lang ein durchweg solider Spieler (Platin 3) hat dann aber f&uuml;r ein paar Monate aufgeh&ouml;rt. Mittlerweile spielt er wieder und es scheint als ob er all sein K&ouml;nnen verloren h&auml;tte denn mittlerweile ist er in Gold 5 gelandet. Ich habe in diesem Zeitraum immer wieder mit ihm gespielt und es war grauenhaft. Konstante Beleidigungen in Richtung des Gegnerteams. Wenn er gewinnt macht er sich (auf beleidigende Art) &uuml;ber sie lustig, wenn er verliert artet es in pure Beschimpfung aus. Wenn eine eigene Lane verliert oder der Jungler Mist baut trifft es diese nat&uuml;rlich auch.\nDabei rede ich nicht nur von &quot;Noob&quot; und &quot;l2p&quot; sondern auch von &quot;Cancer&quot; W&uuml;nschen und allerlei Dingen die ich hier nicht erw&auml;hnen m&ouml;chte. \n\nIch konnte es anfangs nicht fassen und habe aufgeh&ouml;rt mit ihm zu spielen. Ich dachte mir, entweder hat er gerade eine komische Phase oder sp&auml;testens mit der CR f&auml;ngt er sich wieder. So habe ich es alle 1-2 Wochen mal wieder mit ihm probiert ohne, dass eine &Auml;nderung aufgetreten w&auml;re. Das geht mittlerweile seit 2 Monaten (100-150 Games) so.\n\n\nIch frage mich ernsthaft, wie kann es sein, dass dieser Spieler nicht mal eine CR bekommt? Wie lange, wie stark und wie konstant muss man anderen Leuten das Spiel versauen bis man endlich bestraft wird? Es wundert mich nun auch nicht mehr, dass hier noch so viele Beschwerden &uuml;ber toxische Spieler gepostet werden, anscheinend muss man die Strafe wollen um &quot;entdeckt&quot; zu werden.\n\nIch habe dadurch v&ouml;llig den Glauben an das Reportsystem verloren.\n\nEdit: Ich selber habe ihn, die ersten 2-3 Games ausgenommen, bei jeder Runde reported die wir zusammen gespielt haben.","replies":[{"poster":"Ozuraak","date":"2016-10-31T13:31:27.980+0000","up_votes":2,"down_votes":2,"body":"Mal eine andere Vermutung. Hat er vielleicht seinen Account an jemanden anderes verkauft/verschenkt?\n\nDas würde den Rankdrop und das bisher ungewohnten Flaming erklären.","replies":[{"poster":"DontKillMySoraka","date":"2016-10-31T13:46:21.667+0000","up_votes":3,"down_votes":0,"body":"Ich nehme mal an, er war mit seinem Kumpel in ts etc. während der Spiele.","replies":[]}]},{"poster":"MilliDieFrau","date":"2016-10-31T13:04:44.844+0000","up_votes":3,"down_votes":0,"body":"Ich habe mal (ich glaube hier im Forum) gelesen, dass es etwas dauert, bis man die erste CR bekommt, da das System da noch Nachsicht zeigt. Bis zu einem gewissen Punkt. Danach geht es dann wohl ziemlich schnell bis zum Perma-Bann.\n\nIch stelle jetzt mal die Vermutung auf, dass er vielleicht nur so toxisch ist, wenn er mit jemandem zusammenspielt, da er sich dann \"sicherer\" fühlt, da er denkt, noch jemanden auf seiner Seite zu haben. \n\nHast du ihn gefragt, ob er eine CR hatte? Vielleicht hat er die ja schon und du hast es nur nicht mitgekriegt.\nSollte er noch keine haben, würde mich das echt wundern. \"Cancer\"-Wünsche finde ich schon schwer toxisch.\n\nViele Grüße,\nMilli","replies":[{"poster":"Ireliα","date":"2016-10-31T13:28:06.271+0000","up_votes":1,"down_votes":1,"body":"Wir sind so 10 Leute im Freundeskreis mit denen wir zusammen spielen. Dazu kommen noch die ganzen Ingame Kontakte, also spielt er nur selten alleine. Die Leute aus dem RL berichten alle von demselben Level an Flame.\n\nNatürlich habe ich ihn gefragt, sonst würde ich hier nicht schreiben. Zudem sehe ich (wir) ja wie viel er schreibt insofern steht auch eine Lüge nicht zur Debatte :/","replies":[{"poster":"MilliDieFrau","date":"2016-10-31T14:55:45.318+0000","up_votes":1,"down_votes":0,"body":"Es KANN ja VIELLEICHT sein, dass er die 10 Spiele mal schnell woanders abgedödelt hat, klingt aber tatsächlich ziemlich unwahrscheinlich. \n\nAlso wie schon gesagt, bis zur ersten CR dauerts ein bisschen, aber nach so viel Zeit sollte da doch eigentlich mal was passiert sein, wenn er tatsächlich konstant toxisch ist..\n\nHabt ihr ihn mal direkt drauf angesprochen? Du sagst ja, dass du ungern noch mit ihm spielst, kann ich auch voll verstehen.","replies":[{"poster":"Ireliα","date":"2016-10-31T16:52:04.645+0000","up_votes":1,"down_votes":0,"body":"Ja, haben wir. Ich habe da aber keine Lust irgendeinen Streit vom Zaun zu brechen da er im RL völlig anders ist.\n\nMein hauptsächliches Problem liegt darin, dass er mit diesem Verhalten scheinbar durchkommt. Wenn dieses Level an Flame von Riot toleriert wird muss sich keiner über unsere \"toxische\" Community wundern.\n2 Monate oder an die 150 Games sollten mehr als genug sein.","replies":[{"poster":"Atsùra","date":"2016-10-31T22:33:04.199+0000","up_votes":2,"down_votes":0,"body":"Wenn er in RL anders ist, dann kannst du da doch bestimmt besser etwas erreichen, als wenn du ihn reportest. Red doch mal ein ruhiges Wort mit ihm, muss ja kein Streit sein. Frag ihn, weshalb er so toxisch reagiert, ob er das vl euch zuliebe ändern würde, sein Account könnte vl bald gebannt werden (wenn es zu krass wird gibt's ja auch mal nen Permabann, liest man ja oft hier) und das ihr einfach keine Lust auf so einen Spieler habt. Ihr mögt ihn aber nicht sein virtuelles Ich - oder sowas in der Art. Kannst ja auch mit mehreren Freunden mit ihm reden. Vl bringt das ja was. Ich wünsche euch Glück, dass er sein Verhalten vielleicht doch noch ändert.","replies":[{"poster":"Ireliα","date":"2016-11-02T10:28:15.258+0000","up_votes":2,"down_votes":0,"body":"Ich habe diese Geschichte erzählt weil ich Riots System hinterfragen möchte.","replies":[{"poster":"0815xand0r","date":"2016-11-02T15:15:41.554+0000","up_votes":1,"down_votes":0,"body":"Das ganze klingt schon unschön. Ein Weg, um etwaige Strafen zu überprüfen ist nachzusehen, ob er seine Ehrungen (Teamplay, Friendly, etc) verloren hat (diese also bei 0 oder sehr niedrig sind).\n\nAnsonsten kann es durchaus sein - das ist aber reine Spekulation meinerseits -, dass Reports von Premades nicht oder weniger stark gewichtet werden (warum sollte man auch mit jmdn. spielen, der toxisch ist?). Daher ist deine Schlussfolgerung nachvollziehbar, aber eventuell dennoch falsch, da möglicherweise auf falschen Annahmen aufgebaut.","replies":[{"poster":"Ireliα","date":"2016-11-02T15:25:45.360+0000","up_votes":1,"down_votes":0,"body":"Er lügt nicht. Wie gesagt, er schreibt wie ein Bekloppter und das konstant.\n\nIch kann mir auch beim besten Willen nicht vorstellen, dass ich der einzige sein sollte der ihn dafür reported. Seine Random Mitspieler und Gegner haben mehr als genug Gründe dafür.","replies":[{"poster":"0815xand0r","date":"2016-11-02T17:38:29.145+0000","up_votes":2,"down_votes":0,"body":"D.h. er hat noch weiterhin alle seine Ehrungen und die wurden nie zurückgesetzt? \n\nOb er von anderen reportet wurde oder nicht, kann man halt selbst nie wirklich einschätzen. Auch Spieler, die damit drohen, tun es nicht zwangsläufig.\n\nUm mal von diesem konkreten Fall wegzukommen, da es in diesem speziellen Kontext einfach zu viele unbekannte Größen gibt, so dass man eben nicht auf die Wirksamkeit des Systems schließen kann, können wir uns doch mal das ganze in einem größeren Umfange ansehen. Allein hier im Forum gibt es immer wieder und wieder Threads von Spielern, die ihrer Meinung nach ungerechtfertigt gebannt wurden. Es wurden auch schon Streamer live während ihrer Streams gebannt. Es wird also gebannt. Und zwar ohne Berücksichtigung der Bekanntheit oder des investierten Geldes.\n\nWenn wir also übereinstimmen, dass gebannt wird, teilweise auch direkte Permabanns ohne jede Vorstrafe (auch dafür gibt es einen Beispiel, in dem ein Streamer oder Youtuber das erlebt hat), warum sollte ausgerechnet dein Freund dann durchs Raster fallen? Was macht ihn besonders? Sprich: warum funktioniert das System **bei ihm** nicht?","replies":[{"poster":"Ireliα","date":"2016-11-02T17:59:03.936+0000","up_votes":1,"down_votes":0,"body":"Genau diese Frage habe ich mir auch gestellt. \n\nDas er nicht reported wird wäre zwar theoretisch möglich aber ich kann es mir bei der Härte des Flames nicht vorstellen. Einer wird ja wohl den nötigen Klick machen.\n\nDie einzige Antwort die ich mir selbst geben konnte war, dass er vom System als nicht schlimm genug eingeschätzt wird. Das wäre für mich aber absolut inakzeptabel und Riot wäre selber Schuld am Ruf ihrer Community.","replies":[{"poster":"0815xand0r","date":"2016-11-02T18:24:22.589+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist, ob er einfach wirklich genügend Reports kassiert hat, dass das System ihn überprüft. Wenn er dann wirklich wie von dir dargestellt agiert, sollte er keine Überprüfung folgen- und straflos überstehen. Dass er also keine Bestrafung erhalten hat, spricht am ehesten dafür, dass er nicht überprüft wurde.","replies":[]}]}]}]}]},{"poster":"Atsùra","date":"2016-11-03T03:02:19.916+0000","up_votes":1,"down_votes":0,"body":"War ja nur gut gemeint. Du hast ja auch diesbezüglich eine bzw. mehrere Antworten bekommen - deshalb wollt ich mal anders ran gehen.","replies":[]}]}]}]}]}]},{"poster":"IceColdFire","date":"2016-10-31T13:37:48.298+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MilliDieFrau,realm=EUW,application-id=KYnfKGf0,discussion-id=9APW90Ez,comment-id=0001,timestamp=2016-10-31T13:04:44.844+0000)\n>\n> Ich habe mal (ich glaube hier im Forum) gelesen, dass es etwas dauert, bis man die erste CR bekommt, da das System da noch Nachsicht zeigt. Bis zu einem gewissen Punkt. Danach geht es dann wohl ziemlich schnell bis zum Perma-Bann.\n> \n> Ich stelle jetzt mal die Vermutung auf, dass er vielleicht nur so toxisch ist, wenn er mit jemandem zusammenspielt, da er sich dann &quot;sicherer&quot; fühlt, da er denkt, noch jemanden auf seiner Seite zu haben. \n> \n> Hast du ihn gefragt, ob er eine CR hatte? Vielleicht hat er die ja schon und du hast es nur nicht mitgekriegt.\n> Sollte er noch keine haben, würde mich das echt wundern. &quot;Cancer&quot;-Wünsche finde ich schon schwer toxisch.\n> \n> Viele Grüße,\n> Milli\n\n~~> \"Cancer\"-Wünsche finde ich schon schwer toxisch.~~\n\nwas ist das?","replies":[{"poster":"IceColdFire","date":"2016-10-31T13:38:08.380+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zombilla,realm=EUW,application-id=KYnfKGf0,discussion-id=9APW90Ez,comment-id=00010001,timestamp=2016-10-31T13:37:48.298+0000)\n>\n> ~~&gt; &quot;Cancer&quot;-Wünsche finde ich schon schwer toxisch.~~\n> \n> was ist das?\n\nups","replies":[{"poster":"MilliDieFrau","date":"2016-10-31T14:46:43.666+0000","up_votes":2,"down_votes":0,"body":"Cancer?\n\nEnglisch für Krebs. Also jemandem Krebs an den Hals wünschen, wenn du das meinst.","replies":[{"poster":"IceColdFire","date":"2016-10-31T14:56:28.555+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MilliDieFrau,realm=EUW,application-id=KYnfKGf0,discussion-id=9APW90Ez,comment-id=0001000100000000,timestamp=2016-10-31T14:46:43.666+0000)\n>\n> Cancer?\n> \n> Englisch für Krebs. Also jemandem Krebs an den Hals wünschen, wenn du das meinst.\n\ndanke vielmals ^^","replies":[{"poster":"MilliDieFrau","date":"2016-10-31T15:00:19.875+0000","up_votes":2,"down_votes":0,"body":"Immer gerne ^^","replies":[]}]}]}]}]}]},{"poster":"Busty Botter","date":"2016-10-31T12:10:21.397+0000","up_votes":2,"down_votes":0,"body":"Hast du ihn jemals für sein Verhalten reported?","replies":[{"poster":"Ireliα","date":"2016-10-31T12:11:35.485+0000","up_votes":1,"down_votes":0,"body":"Ja, jedes einzelne Game. Werde ich noch oben als Edit anfügen.","replies":[]}]},{"poster":"Noru Dali","date":"2016-11-02T20:21:00.086+0000","up_votes":1,"down_votes":3,"body":"Kann ich bestätigen das report system is lasch und langsam sry aber in 6 spielen 6 afk und troller.\n\nPS: downvotes und rechtschreibfehler kann man behalten #handy\nXD\n\nJetzt ma echt da muss was passieren","replies":[{"poster":"Sirrkas","date":"2016-11-02T20:32:52.942+0000","up_votes":1,"down_votes":0,"body":">Kann ich bestätigen das report system is lasch und langsam sry aber in 6 spielen 6 afk und troller.\n\nDer Leaverbuster funktioniert auch ohne Reports und nur weil das jemand gemacht hat, heißt das noch lange nicht, dass man es hätte verhindern können. Ehe jemand bestraft wird, muss man nämlich erst etwas dafür gemacht haben und Banns gibt es für AFK zudem nur in Ausnahmefällen.","replies":[{"poster":"Noru Dali","date":"2016-11-02T20:57:41.332+0000","up_votes":1,"down_votes":0,"body":"Und genau das ist das problem.\nAfkler werden nicht wirklich bestraft.","replies":[]}]}]}]}