{"poster":"SuperStephanie","date":"2014-10-03T17:32:27.085+0000","title":"Girls being harassed by the League community","subforum":"[ARCHIVED] Miscellaneous","up_votes":47,"down_votes":12,"body":"I posted a Reddit thread earlier about being harassed because my name is in my IGN, so people are aware that I am a girl. The people who commented on the thread reacted terribly, saying it was my fault for showing off that I am a girl. I shouldn't be told in detail how I'm going to be raped, or that I must be fat and ugly because I play. No one deserves that. I think Riot really needs to do something about this. http://www.reddit.com/r/leagueoflegends/comments/2i7bj3/as_a_girl_player_i_am_so_sick_of_the_league/","replies":[{"poster":"MaliceCity","date":"2014-10-04T02:08:58.698+0000","up_votes":40,"down_votes":0,"body":"Hey Stephanie,\n\nI am so sorry to hear about the kinds of things you have to put up with while playing League. As a lady, I understand the kinds of harassment that can get thrown at us so easily by strangers. \n\nAll I can do is assure you that when you report players after a game, it does matter. Riot takes harassment very seriously, and our player behavior initiatives are working to weed out bad eggs. Anyone who thinks the type of behavior you described is acceptable has no place in our community. We will punish them and if they choose not to reform we will permanently ban them.\n\nBut I know that might be cold comfort so all I can do is apologize that you have had to put up with these kinds of behaviors. It would be a shame to lose you as part of the League community, we need all the ladies we can get!\n\nBe sure to always report players. Pre and post-game chat *are* logged, though they were not visible in the original version of the tribunal. Your reports do matter!!","replies":[{"poster":"SuperStephanie","date":"2014-10-04T05:36:36.343+0000","up_votes":11,"down_votes":3,"body":"Thank you very much for your kind words! I will continue to report every time these things happen. I hope that as a community we can weed out the bad eggs together! :]","replies":[]}]},{"poster":"ValyrianBlade","date":"2014-10-03T17:36:35.430+0000","up_votes":22,"down_votes":1,"body":"Those kind of actions should result in permanent bans. I've heard the pre and post game chats are not recorded, so be sure to take screenshots of those and submit tickets if you have to. It's unfortunate but ultimately there's little riot can do on their own about the community, it is up to the good part of the community to identify the problems and bring them to riot's attention. Only when we do this effectively can we expect riot to deal with them.","replies":[{"poster":"SuperStephanie","date":"2014-10-03T17:39:38.449+0000","up_votes":7,"down_votes":2,"body":"Thank you for an actual kind and sensitive comment. I didn't get a single one of those on Reddit. I will start keeping records with screen shots.","replies":[]}]},{"poster":"Cylt","date":"2014-10-03T23:59:52.624+0000","up_votes":14,"down_votes":0,"body":"***","replies":[{"poster":"Pink Sparkles","date":"2014-10-07T20:37:21.323+0000","up_votes":2,"down_votes":0,"body":"I understand your situation completely. I am here to offer you a Teamspeak (Ran by females) to join and enjoy the game of league. We are a female friendly community built to support and give people like you a safe and friendly environment to discuss and play league. Feel free to install Teamspeak and join us! Our Teamspeak Address is: 63.251.20.99:10610","replies":[]}]},{"poster":"BA Tetsuo","date":"2014-10-04T16:13:28.140+0000","up_votes":10,"down_votes":0,"body":"Things I've gathered from this thread:\n\n1. Instead of standing for what you believe, you should inconvenience yourself to appease others.\n2. Any attempts to change the notion the \"games are for guys\" is met with \"well, just don't tell them you're a girl\"\n3. In 2014, a girl still can't play a game without someone telling them how they should get raped.\n4. In 2014, people still think rape is a joke.\n\nAnyway, I'm sorry you had/have to experience this, I wouldn't tell you to change your name, because fuck that. (hint: that's victim blaming.) \"You're getting targeted because of your actions\" and \"you should change your name\" imply that it's your fault that this is happening to you. (It's not)\nJust keep banning and reporting people and hope things change eventually. I know my female friends only play in majority groups of friends, and just insta-mute anyone on the enemy team.","replies":[{"poster":"ShadowKnight1224","date":"2014-10-04T18:07:02.525+0000","up_votes":6,"down_votes":0,"body":"I could not possibly agree more.\n\nThe good thing is that Riot seems to be cracking down on this. The logs are readily visible by them and they seem to be fairly competent at dishing out punishment. What I would like is for them to be escalated straight to a 2-week-ban rather than chat restrictions.\n\nRape is not a joke.","replies":[]}]},{"poster":"Lumus Avatar","date":"2014-10-03T17:53:59.825+0000","up_votes":10,"down_votes":0,"body":"The awful people on the internet are why games have to put a disclaimer that their ratings do not reflect online interactions and those interactions are not the responsibility of blah blah blah.\n\nPoint is, you should never be shamed or abused for being a girl or hiding or not hiding that fact. Everyone is just a player and people need to remember that. \n\nThe internet gives people a mask to hide behind while they say horrible things. Riot needs to modify Tribunal so it looks at pre- and post-game chat logs. It is ridiculous how people can be perfectly silent throughout the game and just tear into each other afterward because they know they won't be penalized for it.\n\nIt needs to change.\n\nOh, also Muting should continue into the post-game lobby. The last thing I want is to mute a toxic player and be happy* for the rest of the game only to get into the post game lobby and have to deal with them again while I'm reporting them.","replies":[{"poster":"SuperStephanie","date":"2014-10-03T18:35:17.109+0000","up_votes":6,"down_votes":0,"body":"I definitely agree with all of that. Especially the muting in the post game lobby. Some of them realize I mute them and just say it all at once. It's terrible. Yes, I should ignore it, but sometimes it just sticks with me and really bothers me.","replies":[]}]},{"poster":"Coffee Ray Gun","date":"2014-10-03T17:45:47.105+0000","up_votes":10,"down_votes":0,"body":"I honestly can't see how people could treat others like that. It baffles me to think causing others emotional hurt pleases people.\n\nSecondly, who cares if you're a girl, a guy, or a potato, if you're a decent person in the game you shouldn't be treated any differently.","replies":[{"poster":"SuperStephanie","date":"2014-10-03T17:48:29.781+0000","up_votes":3,"down_votes":0,"body":"Exactly, thank you! :]","replies":[]}]},{"poster":"SOLOQSUPERHERO","date":"2014-10-03T19:24:32.373+0000","up_votes":7,"down_votes":0,"body":"1. I really wanted to name my summoner Morton Salt Girl (ala https://img2.fastenal.com/productimages/MortonSalt_Logo.jpg ) but I didn't for this exact reason. \n\n2. I'm gay, so believe me I feel your pain. \n\nGood luck out there and just dont let it bug you as best you can.","replies":[{"poster":"SuperStephanie","date":"2014-10-03T19:27:32.210+0000","up_votes":3,"down_votes":0,"body":"HAHAHA i love that name so much!!!","replies":[]}]},{"poster":"Trylobyte","date":"2014-10-03T17:58:09.205+0000","up_votes":8,"down_votes":2,"body":"The upside of the internet:  Everyone is free to say whatever they want.  True freedom of speech in an anonymous environment so nobody can be punished for having unpopular or dissenting opinions and allows the free flow of information to be discussed among millions.\n\nThe downside of the internet:  Everyone is free to say whatever they want.  True freedom of speech in an anonymous environment gives a platform for bigots and assholes to spread prejudice and hatred while giving them an echo chamber of like-minded people assuring themselves they're 'correct.'\n\n\nIt just so happens that the 'gamer' community tends towards rabid misogyny, which is why any female in the 'gamer' community is going to get harassed almost constantly and have all manner of horrible threats laid against them.  As a gamer myself, I find this pretty depressing that louder elements of the community are as childishly immature as they are, but unfortunately that's just how it is right now.  Hope you don't give up because of a few dumbasses with keyboards, though.","replies":[{"poster":"Serpents Embrace","date":"2014-10-03T22:27:38.001+0000","up_votes":6,"down_votes":0,"body":"Yes, and no. \n\nThey're free to say whatever they want, sure. Riot is also free to punish them however they want. \n\n\"Just how it is right now\" is a situation that could be fixed pretty quickly. Making a rape threat to another player should result in a permanent ban. And there really isn't any context that would make that situation okay, so there's no gray area here.","replies":[]}]},{"poster":"12tales","date":"2014-10-03T20:03:49.849+0000","up_votes":5,"down_votes":4,"body":">The people who commented on the thread reacted terribly, saying it was my fault for showing off that I am a girl.\n\nThere's a distinction between establishing a causal relationship and attributing blame. If someone offers me a beverage with a tranquilizer and I drink it, I will be knocked out *because* I accepted a drink from someone untrustworthy. And yet, the fault lies with the asshole who gives people spiked drinks.\n\nObviously, somebody harassing you for any reason, gendered or otherwise, is unfortunate. The people in that reddit thread, however, seem to be making the relatively practical observation that a name change would reduce the harassment you receive - I don't see anyone making the normative claim that your name entitles others to harass you.\n\nI don't really care either way, but it's a pretty important distinction to make.","replies":[{"poster":"Gavran","date":"2014-10-03T21:50:41.795+0000","up_votes":5,"down_votes":2,"body":"Did you not read the top rated comment then?\n\n>Maybe don't tell them you are a girl and stop replying to them? \n\nOr.. any of the comments? I don't see any of the tone appropriate for the suggestion, e.g. \"I know it sucks but maybe you should consider a name change because it's easier to inconvenience yourself than fix other people.\" And I see a hell of a lot of \"You're whining, you shouldn't \"broadcast\"* your gender if you care.\"\n\n*Because summoners with \"man\", \"dude\", \"bro\" or all three in their name totally get discriminated against right?","replies":[{"poster":"12tales","date":"2014-10-03T21:56:22.341+0000","up_votes":7,"down_votes":1,"body":">Maybe don't tell them you are a girl and stop replying to them?\n\nAgain - there is a distinction between practical advice and moral condemnation. In my analogy, a friend might rightly suggest that I shouldn't accept drinks from strangers. That suggestion in no way implies that it's not the fault of the person offering me a spiked drink, and it'd be dishonest of me to afterwards claim as much.\n\n\"Maybe don't accept drinks from strangers\" is in no way synonymous with \"It's your fault for accepting drinks from strangers,\" and claiming that it was for the sake of generating sympathy or getting attention would be both intellectually dishonest and incredibly rude to the person offering the advice. \n\nSimilarly - \"Maybe don't use a feminine name\" is in no way synonymous with \"It's your fault for using a feminine name,\" and claiming that it was for the sake of generating sympathy or getting attention would be both intellectually dishonest and incredibly rude to the person offering the advice. \n\n---\n\nThe word 'fault' appears three times in that thread. Twice when posters are clarifying that it's not her fault, and once when she insists that she's being told it's her fault.\n\nI believe the idiom is something along the lines of 'crucifying yourself.'","replies":[{"poster":"ShadowKnight1224","date":"2014-10-04T04:07:48.559+0000","up_votes":2,"down_votes":0,"body":"You don't actually change anything by taking the personally inconvenient but safer road. Not only are you inconveniencing yourself by changing the way you would normally do a thing, you are also silently accepting the way things are instead of making an effort to change it. Instead of advising people to change the way they act to avoid harassment, programs should be generated to address the culture and harassment in the first place.","replies":[]}]}]},{"poster":"SecretAgentHulk","date":"2014-10-04T13:07:02.949+0000","up_votes":2,"down_votes":0,"body":"There's a distinction, but that distinction can get pretty small in some cases. I'd encourage you to read http://badassdigest.com/2013/11/14/we-need-to-change-how-we-talk-about-rape/ (specifically section 3 but the whole thing is good and really kinda changed my life).","replies":[]}]},{"poster":"CmereCupcake","date":"2014-10-04T10:26:44.548+0000","up_votes":5,"down_votes":8,"body":"Why does gender even get brought up? This is a free game on the internet... you know as well as anyone else that if you antagonize yourself by going \"hey i'm a girl\" then people are going to pick fun.\nHow hard is it to use the mute function, if you are easily offended?","replies":[{"poster":"LeeDark","date":"2014-10-04T14:01:18.644+0000","up_votes":6,"down_votes":4,"body":"Why don't you say that to every guy who has a masculine indicator in his name?  Why is it that you think it's okay for people to \"pick fun\"  (hint: the term you were actually looking for is \"harass\") at girls but not guys?  Why should bigots get to keep playing the game just because a mute option exists?\n\nCongratulations on being part of the problem though.  I bet your mother is proud of you.","replies":[{"poster":"CmereCupcake","date":"2014-10-06T04:01:57.986+0000","up_votes":4,"down_votes":0,"body":"> Why don't you say that to every guy who has a masculine indicator in his name?  Why is it that you think it's okay for people to \"pick fun\"  (hint: the term you were actually looking for is \"harass\") at girls but not guys?  Why should bigots get to keep playing the game just because a mute option exists?\n> \n> Congratulations on being part of the problem though.  I bet your mother is proud of you.\n\nThere are plenty of dudes with fem names. You don't get harassed for being a chick unless you out yourself as a chick.\nPart of the problem? My ass. Bold words for someone who knows nothing about me.\nWhy should bigots get to keep playing? Uhhh I dunno, maybe because people talk shit on the internet and the people you are referring to make up 90% of the population.\n\nUse\nMute.\nIt's that simple.","replies":[]}]}]},{"poster":"Spiritun","date":"2014-10-04T20:31:11.026+0000","up_votes":1,"down_votes":0,"body":"Those kind of things don't happen in EUW..\n\n\nNo, but seriously. I have never seen someone being harassed because they were a girl in a match, and I have seen many kinds of name that could hint that (from Beyonce to common girl names).\n\nAre you really not exaggerating?","replies":[{"poster":"Season 9 Amumu","date":"2014-10-05T00:25:49.245+0000","up_votes":4,"down_votes":0,"body":"> Those kind of things don't happen in EUW..\n> \n> \n> No, but seriously. I have never seen someone being harassed because they were a girl in a match, and I have seen many kinds of name that could hint that (from Beyonce to common girl names).\n> \n> Are you really not exaggerating?\n\nyeah im getting that feeling too. its terrible to be harassed but ive never seen a girl in league harassed as much as op claims to be. to be honest, its hard to play this game and not get harassed at some point. there is a report button, this shouldn't even be this much of an issue. mute and report.","replies":[{"poster":"Spiritun","date":"2014-10-05T15:24:12.436+0000","up_votes":4,"down_votes":0,"body":"I just hope that she does not regard random insults as sexism. The reality is that everyone gets harassed.","replies":[]}]}]},{"poster":"Zelilah","date":"2014-10-04T07:35:41.161+0000","up_votes":4,"down_votes":0,"body":"Hey SuperStephanie and all of the other ladies who've spoken up here! Just wanted to say hi and show my support :)\nAs a fellow lady I too sometimes have to deal with some nasty comments and attitudes in game. The other day an opposing midlaner kept calling me a \"stupid slut\" and saying things like \"f*ck me slut, you gotta make that money somehow you slut\". So yeah, always lovely to hear that sort of thing. I think he was just mad though....kept deleting him with my Syndra ^_^ Anyhow, if you ever want to play with some safe folks feel free to add me (Zelilah) I play a ton (well at least when I'm not getting reconnect bugged :c) and I usually play with another girl and a guy who isn't nasty :P We play a ton of ARAM, some Teambuilder, and we're planning on starting ranked as soon as the reconnect bug gets some Raid. Hopefully your time on the rift is much better in the future!\nGL,HF","replies":[]},{"poster":"Astral Zephyroro","date":"2014-10-03T20:53:58.696+0000","up_votes":3,"down_votes":2,"body":"@12tales I dont think your understanding the point. She should not HAVE to pay money to \"solve\" a problem. While a summoner name change would most likely stop the issue it shouldn't be the established precedent. Yes, the name change will solve the problem but the means does not justify the end result.","replies":[{"poster":"12tales","date":"2014-10-03T21:43:12.445+0000","up_votes":3,"down_votes":5,"body":"Whether or not it *should* be the case is immaterial to whether or not it *is*.\n\nRegardless, as I mentioned, I don't really care. I'm just annoyed that she's martyring herself by misrepresenting what the people on reddit are saying. She's extrapolating normative claims from practical observations, and presenting those assumptions as fact to support her own position. Not really commendable or intellectually honest behavior.","replies":[{"poster":"LeeDark","date":"2014-10-04T13:57:46.515+0000","up_votes":3,"down_votes":2,"body":"\"I don't care, even though I've spent quite a bit of time replying in this thread.\"\n\n\"martyr\"\n\n\"She should just change her name and shut up so I don't have to put up with this.  Oh, but that totally doesn't mean it's her fault she is harassed... let me make that clear since, if I don't, EVERYTHING ELSE I'M SAYING would make it seem like that was my attitude about it.\"\n\nDo you really wonder why you're getting downvoted?","replies":[{"poster":"12tales","date":"2014-10-04T17:32:02.931+0000","up_votes":3,"down_votes":3,"body":"Of course not. It's an emotionally charged topic.\n\nJust to clarify, tho - I don't care about the harassment. Two people I've never met don't get along; some dude out there is sexist; somebody named Stephanie is distraught; these are all things that don't really affect me.\n\nI care about what I see as an intellectually dishonest misportrayal of the interactions the OP has had with Reddit, presumably done for the sake of garnering sympathy. Regardless of the point the OP is trying to make, or the emotional response she's trying to evoke, I would prefer it if she did so through honest means. Putting down other people to get attention for yourself is behavior that I take issue with, regardless of the topic. I assume I'm not alone in that?","replies":[{"poster":"LeeDark","date":"2014-10-05T03:06:46.659+0000","up_votes":1,"down_votes":2,"body":"So, to be clear, sexism doesn't matter to you because it doesn't affect you, but some random person misrepresenting some responses on Reddit affects you... wait, how?  That's just stupid.  You care more about some stuff said on the internet more than you care about sexism.  You take issue with anonymous people being put down (which is dumb because they are anonymous and thus unaffected by anything said here)... but you don't take issue with blatant sexism.  I can't even... \n\nAnd that isn't to say she even misrepresented the responses on Reddit.  You yourself admit that the only way you reached your conclusion was to remove all tone from the responses at all, essentially beginning from the assumption that they were not derogatory in any way.  I have to heartily disagree.  A lot of the posts read like yours.  That is to say, despite the insistence that you aren't the bad guy... a lot of the words you use are the same words a bad guy would use.  Get it?","replies":[{"poster":"12tales","date":"2014-10-05T03:26:29.602+0000","up_votes":3,"down_votes":1,"body":">So, to be clear, sexism doesn't matter to you because it doesn't affect you, but some random person misrepresenting some responses on Reddit affects you... wait, how?\n\nBecause I frequent these boards, and I don't frequent the OP's in game chat.\n\n>You care more about some stuff said on the internet more than you care about sexism. You take issue with anonymous people being put down (which is dumb because they are anonymous and thus' unaffected by anything said here)... but you don't take issue with blatant sexism. I can't even...\n\nThere are thousands upon thousands of instances of sexism occurring over the world that you don't take issue with, because you have no idea they're happening. A wife in the middle east is being beaten while you shop for groceries, and you don't even bat an eye. A woman receives jeers and catcalls every day as she walks to work in Detroit, and you don't pause for a moment to think about it.\n\nIt's not that I don't care - it's that I'm more consistent in what I care about than you are. To me, it's hypocritical of everybody in this thread to fawn over the OP and feed her the attention she wants because they would never *dream* of offering the same support to anyone in the same situation that didn't bitch about it. The only thing that's separating the OP from the presumed countless other women suffering through the same hardships is that the OP made a thread about it while the others didn't. And since I don't consider making a thread to be a particularly significant or commendable action, I don't feel moved to give the OP any more support than I give to the presumed countless other women.\n\nIf the OP were a friend of mine, or if the harassment was occurring in a medium that I was actually present in (say, the chat in a game I'm playing, or these boards), I would take significant issue with it. Just as I don't take issue with intellectual dishonesty elsewhere on the internet, but feel moved to call it out when I actually frequent the medium it's presented in.\n\n>You yourself admit that the only way you reached your conclusion was to remove all tone from the responses at all, essentially beginning from the assumption that they were not derogatory in any way.\n\nCorrection; I reached my conclusion by accepting that there *was* no tone, and that any tone I perceived was a product of my own biases.","replies":[{"poster":"LeeDark","date":"2014-10-05T04:23:23.409+0000","up_votes":1,"down_votes":2,"body":"Making this a separate comment for simplicity.  Please explain how a \"toneless\" reading of the following comments results in a non-sexist comment:\n\n\"1 - you must be telling them you are a girl\n 2 - ignore op.\"\n\n\"Well if you emphasize the fact that you're a girl in game that's the problem.\"\n\n\"Pro tip: dont tell anyone you're a girl.\"","replies":[{"poster":"12tales","date":"2014-10-05T17:29:33.428+0000","up_votes":2,"down_votes":0,"body":"Sure.\n\nFirst quote, I read as something like \"It's obvious why you're having this problem, and the fact that you haven't already fixed the cause means that you aren't worth talking to.\"\n\nSecond and third quotes, I read as something like \"This is happening because you're telling people you're a girl.\"\n\nDisagree?","replies":[{"poster":"LeeDark","date":"2014-10-05T20:20:15.273+0000","up_votes":1,"down_votes":1,"body":"Your rewrites are still obviously sexist.  Do you not know what \"blaming the victim\" is?  I'd prefer to believe you aren't that stupid, but you aren't leaving me much choice.","replies":[{"poster":"12tales","date":"2014-10-05T21:49:32.712+0000","up_votes":2,"down_votes":0,"body":"Ah, there's a difference in definitions going on here. Understandable.\n\nI define sexist as 'drawing legitimacy from gendered narratives.' For instance, the stereotypical 'Get back in the kitched!' snipe is based on the premise that women stay at home while men work. Thus, it's sexist. Alternatively, the super chivalrous dude who tries to carry things for women because he believes women require the help is sexist, even if he isn't malevolent.\n\nIn this case, I think the application is dubious. My rewrites are grounded in the understanding that, if people in League of Legends know you're a girl, they'll be more likely to harass you. That's obviously an understanding that has to do with gender, but it's also a factual observation. \n\nIf those posts were arguing something like 'girls *should* be harassed, so it's you fault for saying that you're a girl,' then yeah, that'd obviously be sexist. But like I said in my first post, you can make practical observations without simultaneously making normative claims.","replies":[{"poster":"LeeDark","date":"2014-10-05T22:39:34.314+0000","up_votes":1,"down_votes":1,"body":"You still don't get it.  Saying \"you have a feminine name, so of course you'll be harassed, and you should change your name to avoid that\" is the same as \"you walk through dark streets on the way home from work, so of course you'll be raped, and you should take a different route to avoid that.\"  It's kind of meaningless once the harassment/rape has already happened.\n\nBy saying she can changed her name if she wants to avoid all this,  you imply that because she hasn't changed her name, she doesn't want to avoid all this.  That is sexist.  Period.  The right answer is \"She shouldn't have to change her name; those people should be banned.\"","replies":[{"poster":"12tales","date":"2014-10-05T23:48:53.032+0000","up_votes":3,"down_votes":0,"body":">The right answer is \"She shouldn't have to change her name; those people should be banned.\"\n\nThat's the normative approach, yeah.\n\n>You still don't get it. Saying \"you have a feminine name, so of course you'll be harassed, and you should change your name to avoid that\" is the same as \"you walk through dark streets on the way home from work, so of course you'll be raped, and you should take a different route to avoid that.\" It's kind of meaningless once the harassment/rape has already happened.\n\nYeah. But if there's actually a causal link between a specific street and raping, is that bad advice? Obviously, we'd all prefer it if raping didn't exist in the first place, but steering clear of hot spots isn't a bad idea, before the police can clear it out.\n\n>By saying she can changed her name if she wants to avoid all this, you imply that because she hasn't changed her name, she doesn't want to avoid all this. That is sexist. Period.\n\nThat doesn't necessarily follow. There are other values that affect the decision. Maybe she has some sort of attachment to her name - maybe she doesn't want to set a precedent of hiding her gender. These are all valid reasons to keep her current name, even if it's true that she'd receive less harassment with a more gender neutral name.","replies":[]}]}]}]}]}]},{"poster":"LeeDark","date":"2014-10-05T04:08:53.569+0000","up_votes":2,"down_votes":1,"body":"Wrong, I take issue with every single one of them, even the ones I don't know about.  I have a problem with all of it, just like I have a problem with racism and homophobia even when I'm not aware of a specific instance.  And I actually donate my time and money to do as much as I can to help fix the problem.  WTF do you do?  Oh yeah, you defend anonymous Redditors from the evils of having their tone read.\n\nOn that note, nothing ever gets said or written without a tone.  Why?  Because people always have intentions with the things they write and say.  Even when you try to eliminate your own tone, you are unsuccessful... unless you are a very experienced, very good writer, probably of fiction.  Your own inability to read the tone is your own personal failing.  Please do not project that failing onto everyone else just to make yourself feel better.\n\nOh, and by the way, there are thousands of people being misrepresented on forums all over the internet of which you aren't aware, so why should you feel moved to defend these poor souls when you don't bat an eye for all the other SoB's who have to suffer at their words being misrepresented?  And yes, I meant that to sound as ridiculous as it was, because your argument is just that silly.  The fact that you are here on these boards means nothing.  You CHOSE to come into this thread and post your ill-informed opinions.  You could have not entered the thread just as easily, and that supposed intellectual dishonesty (which it isn't) would have remained \"elsewhere on the internet.\"  So, for someone how prizes honesty so much, how about you tell us why you're REALLY here?","replies":[{"poster":"12tales","date":"2014-10-05T17:22:42.399+0000","up_votes":3,"down_votes":0,"body":">Wrong, I take issue with every single one of them, even the ones I don't know about. I have a problem with all of it, just like I have a problem with racism and homophobia even when I'm not aware of a specific instance.\n\nA relaxed, comfortable objection. A vague notion that, as you sip coffee in your home, you'd really prefer it if those things weren't happening. A care as significant as the clothes you wear, and donned for much the same reason.\n\nA retroactive 'oh how dreadful' as you go about your day.\n\nI don't ask much - only a moment of silence for each and every catcall as it's uttered. For someone as passionate as yourself, such a *small* sacrifice surely wouldn't be a problem?\n\n>On that note, nothing ever gets said or written without a tone. Why? Because people always have intentions with the things they write and say. Even when you try to eliminate your own tone, you are unsuccessful... unless you are a very experienced, very good writer, probably of fiction. Your own inability to read the tone is your own personal failing. Please do not project that failing onto everyone else just to make yourself feel better.\n\nOh, I read tone. I just have the self awareness to accept that I'm probably wrong. Complete confidence in your ability to read and interpret the intent behind text is misplaced, and an exercise in confirmation bias. \n\n>Oh, and by the way, there are thousands of people being misrepresented on forums all over the internet of which you aren't aware, so why should you feel moved to defend these poor souls when you don't bat an eye for all the other SoB's who have to suffer at their words being misrepresented?\n\n...I just explained that, friend.\n\n>Just as I don't take issue with intellectual dishonesty elsewhere on the internet, but feel moved to call it out when I actually frequent the medium it's presented in.\n\n-\n\n\n>You could have not entered the thread just as easily, and that supposed intellectual dishonesty (which it isn't) would have remained \"elsewhere on the internet.\" So, for someone how prizes honesty so much, how about you tell us why you're REALLY here?\n\nA sinister plot, no doubt.","replies":[{"poster":"LeeDark","date":"2014-10-05T20:25:15.848+0000","up_votes":1,"down_votes":0,"body":"Did you really skip over the part where I donate my time and money to such causes, just so you could pretend I'm not doing anything?\n\nWhile we're on the topic of your selective quoting, you also skipped \"The fact that you are here on these boards means nothing. You CHOSE to come into this thread and post your ill-informed opinions. You could have not entered the thread just as easily, and that supposed intellectual dishonesty (which it isn't) would have remained 'elsewhere on the internet.'\"  So when you say that you \"just explained that, friend,\" you failed to realize that explanation had been shot down.  You chose to frequent this thread on purpose, DESPITE your insistence that sexism against some random girl on the internet doesn't interest you in the slightest.  In fact, it looks like you came into the thread specifically LOOKING for a reason to argue against the OP's position.  You even went so far as to ignore several posts in the Reddit thread that were clearly antagonistic.\n\nSo, are you MRA, or just a troll?  (What am I talking about?  There isn't really a difference.)","replies":[{"poster":"12tales","date":"2014-10-05T23:39:51.651+0000","up_votes":2,"down_votes":0,"body":">Did you really skip over the part where I donate my time and money to such causes, just so you could pretend I'm not doing anything?\n\nYou're not donating money to everybody. Giving time or money to a local cause is admirable, but you're still ultimately giving time and money to a specific subset of people. There are countless women in need of help who'll never feel the effects of your efforts, and you'll never even notice they exist.\n\n>While we're on the topic of your selective quoting, you also skipped \"The fact that you are here on these boards means nothing. You CHOSE to come into this thread and post your ill-informed opinions. You could have not entered the thread just as easily, and that supposed intellectual dishonesty (which it isn't) would have remained 'elsewhere on the internet.'\" So when you say that you \"just explained that, friend,\" you failed to realize that explanation had been shot down. You chose to frequent this thread on purpose, DESPITE your insistence that sexism against some random girl on the internet doesn't interest you in the slightest. In fact, it looks like you came into the thread specifically LOOKING for a reason to argue against the OP's position.\n\nGotta have fun somehow. Usually, I argue about League of Legends, but I admit that this thread has been a lot more interesting than shit about ADC itemization.\n\n>So, are you MRA, or just a troll? (What am I talking about? There isn't really a difference.)\n\nIs it so hard to believe that somebody disagrees with you? I'm giving you the benefit of the doubt, and assuming that everything you're saying is what you actually believe, and you're sincerely trying to teach me what you think is the truth. Extend the same benefit to me.","replies":[]}]}]}]}]}]}]}]},{"poster":"ShadowKnight1224","date":"2014-10-04T04:10:58.949+0000","up_votes":3,"down_votes":2,"body":"Whether or not it *is* is immaterial to whether it *should* be. Resolving an individual case is meaningless if it does not address the culture at large. Making a name change so that this particular person stops being harassed does nothing to address the culture that produces said harassment.","replies":[{"poster":"12tales","date":"2014-10-04T17:43:38.767+0000","up_votes":2,"down_votes":1,"body":">Making a name change so that this particular person stops being harassed does nothing to address the culture that produces said harassment.\n\nNo shit.","replies":[{"poster":"ShadowKnight1224","date":"2014-10-04T17:50:19.414+0000","up_votes":1,"down_votes":1,"body":"And yet you seem keen on defusing conversation regarding the harassment culture by pedantically focusing on what solves this woman's immediate problem. And now you say \"no shit\" to my point, as though you were 100% aware of it, and therefore were doing this on purpose.","replies":[{"poster":"12tales","date":"2014-10-04T17:56:30.790+0000","up_votes":2,"down_votes":2,"body":"I'm keen on avoiding said conversation because I don't care about it. Much like I'd be keen on avoiding conversations about stamps.\n\nIf you enjoy having that conversation, good on you. I wish you luck in finding somebody who's willing to have it with you.","replies":[{"poster":"ShadowKnight1224","date":"2014-10-04T18:04:39.717+0000","up_votes":3,"down_votes":1,"body":"How fortunate it must be to have lived a life where you can reasonably expect to walk into a thread about X and then refuse to have a conversation about X, turning it into a conversation about Y instead.\n\nNo need for luck, we're all having this conversation already whether you like it or not.","replies":[]}]}]}]}]}]}]}]}