{"poster":"Quaxy TV","date":"2017-02-26T22:04:35.304+0000","title":"Main Adc Sucht Team (Dia1) 16 Jahre alt","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"ich suche ein team bei denen ich mich bewerben bzw. ein probe spiel machen darf usw.\r\nwahrscheinlich denkt ihr jetzt 16 Jahre? der ist bestimmt Toxic, ihr k&ouml;nnt mir vertrauen das bin ich mit sicherheit nicht!\r\nich mache gerade Schule und werde auch weiter und weiter schule machen, bis ich glaube das es nichts mit dem Esport wird!\r\nnaja, ein Traum sollte niemand auslassen. Alter ist egal, wenn ihr nett zu mir seid werde ich nett zu euch sein ganz einfach =).\r\nIch kann jeden Tag zirca 2-5 Spiele spielen, Wochenende wird alles frei sein, au&szlig;er wenn ich irgendetwas vor habe. Meine Ziele? \r\nich k&ouml;nnte jetzt sagen nach der Esl ist ende, aber nicht bei mir. Wenn ich mich wohl f&uuml;hle in dem Team w&uuml;rde ich mich sogar auch bereitstellen zu shotcallen, aber ich denke das jeder seine eigenen calls machen sollte, jemand zuh&ouml;rt und dann jemand den besten call bestimmt.\r\n\r\nWas ich m&ouml;chte:\r\n\r\n- Teamspeak (jeder sollte reden k&ouml;nnen, zuh&ouml;ren nat&uuml;rlich auch).\r\n- 1 - 2 Coaches (der eine um uns nochmal extra tipps zu geben und wenn m&ouml;glich noch einen der f&uuml;r uns die Tuniere aus macht.\r\n- keine Spieler die flamen, jedoch spieler die mir Tipps geben und allen anderen auch damit wir besser und besser werden.\r\n- Nat&uuml;rlich m&ouml;chte ich auch an Tunieren teilnehmen (ESL)\r\n- jede Woche hart daran arbeiten ein gutes Team zu werden (8-? Spiele der Woche), mit Stunden die wir brauchen werden, um unser Team zu verbessern (das Spiel anschauen gleichzeitig und schauen was man besser machen kann)\r\n- Eine Whatsapp gruppe damit wir schreiben k&ouml;nnen, wann wir alle Spielen k&ouml;nnen und werden.\r\n- Spieler die nicht Afk gehen, oder trollen oder open mid machen, ich will gewinnen und ihr solltet genauso denken. jedes einzelne Spiel, und Calls machen wie wir wieder zur&uuml;ck ins Spiel finden\r\n- Shotcaller die sagen was wir jetzt machen sollen\r\n- ein Team das in Diamond Master elo Spielt\r\n\r\nnadann ich denke ich habe nichts vergessen was ich hier reinschreiben k&ouml;nnte :D, ich denke meine anforderungen sind f&ouml;llisch in ordnung wie ich finde.\r\nok, wenn ihr entschieden habt mich in eurem Team ein probe Spiel zu machen, oder sogar gleich einstellen dann addet Quaxy TV. \r\n\r\nps. ich habe noch Ferien bis nexte woche Sonntag, {{sticker:slayer-jinx-catface}}","replies":[]}