{"poster":"Done","date":"2016-11-06T14:29:38.304+0000","title":"poque me pasa esto ?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"recien comente otro post con el problema de conexion pero ahora me dieron leaverbuster de 5min por rechazar partida de emparejamiento resulta que yo no rechaze ninguna debido q nuncame me conecto el servidor cada ves que me colocaba para el emparejamiento me desconecta el pvp.net y se sale y ahora me dan baner por nada y aun no puedo jugar ?????????","replies":[{"poster":"9081913DEL1","date":"2016-11-06T14:32:54.154+0000","up_votes":1,"down_votes":0,"body":"Si estas teniendo problemas de conexion juga csutom XD.\n\nEs logico te estas desconectando y aunque no tires del cable ya sabes que tenes problemas. Es un juego donde dependes de 45 personas coordinadas jugando, por eso ahi que ser estricto en las desconexiones.\n\nSaludos.","replies":[{"poster":"Done","date":"2016-11-06T14:41:20.264+0000","up_votes":1,"down_votes":0,"body":":/ q mala no se por que no puedo jugar me desconecta todo el rato y recien hice una prueba de internet en online y tengo todo correcto yo pense q era el internet pero no es el juego por que no puedo jugar ni pvp normal ni contra bots ni ranked me tira a la fila emparejamiento espera 2min y sale recuperando servidor luego de eso tire msj desconectado pvp.net ? no entiendo por que","replies":[{"poster":"9081913DEL1","date":"2016-11-06T14:47:19.163+0000","up_votes":1,"down_votes":0,"body":"Las computadoras son algo complejo. Probablemente te este fallando algo, aunque te funcione el internet.\n\nRevisa drivers, el cliente quizas requiera ya una instalacion limpia, y demas.\n\nSaludos.","replies":[{"poster":"Done","date":"2016-11-06T15:37:12.328+0000","up_votes":1,"down_votes":0,"body":"es ilogico la ultima vez que juge fue ayer en la noche aproximadamenete termine la ultima partida alrededor de las 1:30am y hoy despierto con ganas de jugar y me aparce recuperando servidor desconenctado pvp.net ?? no encuentro explicacion obvia ya que juego todos los dias de la semana y nunca tube un problema igual y ahora no entiendo porque sale esto y probado con diferentes cuenta que tengo y ninguna me funciona y desactivado firewall e cambiado la ip demi net e tratado reniciando el pc ya no se que mas hacer acaso riot no me puede dar una solucion o.O no solo jugadores del servidor.","replies":[{"poster":"9081913DEL1","date":"2016-11-06T15:47:20.784+0000","up_votes":1,"down_votes":0,"body":"Las opciones son muchas, deberias contactar al soporte.\n\nVeamos, que puedo aportar, ve viendo y ojala te sirva.\n\nPrimero ve que el juego en si este bien, esto lleva mucho tiempo, es decir reparar, reinstalar y demas.\n\nVe que tu antivirus o algun programa de segundo plano no este en conflicto. \n\nRevisa tu sistema, si no hay daños de algun tipo. Sistema operativo, programas que se ejecutan mal, virus. \n\nRevisa los drivers, 60% de las veces los drivers de video dan conflictos que parecieran sin conexion con ellos mismos. Actualzialos aunque te diga que estan los ultimos.\n\nFijate si alguien mas en tu zona tiene el mismo problema (de ser posible) aqui asumiriamos que el problema es de la ruta o de riot.\n\nProblemas del disco no suelen dar fallas de ese tipo, nunca esta mal dejarlo mas limpito. Lo mismo aplica a la ram.\n\nSi todo esto es general y rapido, pero si el problema es muy puntual seria muy extenso encontrarlo a ciegas, acude al soporte a partir de alli.\n\nSaludos.","replies":[{"poster":"Done","date":"2016-11-06T16:55:46.688+0000","up_votes":1,"down_votes":0,"body":"si gracias probe actualizando driver ahora entro me cargo esta cargando las imagenes donde salen los teams en vs todos cargaron al 100% y yo me quede en 0 con 19 de ms y se cae tirando otra ves msj recuperando datos del servidor y arriba en la esquina superior izquierda sale un signo de esclamacion rojo que dice desconenctado pvp.net y un mensaje dice problema de conexion pueden ser del servidor le doi click y me manda a estado del servidor pero esta dolo ON en la pagina no se que sera","replies":[{"poster":"9081913DEL1","date":"2016-11-06T16:59:11.595+0000","up_votes":1,"down_votes":0,"body":"En tu escritorio> INICIO> en el espacio para Buscar...> escribe Servicios> entra a Servicios y busca> Aplicación auxiliar IP> tienes que detener esa función.","replies":[]}]}]}]},{"poster":"Done","date":"2016-11-06T15:31:51.732+0000","up_votes":1,"down_votes":0,"body":"si si todo bien yo juege ayer en la noche termine de jugar me sali y apage mi pc normalmente como todo los dias juego todos los dias lol y primera vez que tengo este problema y uan no tengo sulucion la ultima vez que juge fue ayer en la noche por que hoy en la mñn no puedo jugar y tratado toda la mñn son las 12:30pm estoi tratando de jugar de las 10:00 am aun me sale desconectado del servidor o.O","replies":[]}]}]}]}]}