{"poster":"DarksWaves","date":"2017-09-03T20:03:22.910+0000","title":"Los retadores de las - Vision mia -","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":7,"body":"Creo que ya es hora de que se pongan las pilas todos. El nivel que van demostrando los equipos de las es muy bajo, y van a la final donde seguramente pasaran verguenza. \r\n\r\nYo se que no es su culpa, los equipos estan formados por jugadores de &quot;high elo&quot; que son manquitos nomas, vijate osvii.. retador con 35% de winrate lol . Cada cual a su olla . \r\n\r\nAsi vamos mal, pero no es culpa de ellos, es culpa de riot que no le da las herramientas para mejorar. Pongan un tutorial mas zarpado, pongan mas enfasis en las composiciones, con campeones sugeridos o algo. Ayuden los rioters a que mejoren la comunidad.\r\n\r\nEsto deberia ser una competencia entre regiones, no les gustaria decir mi region es op?\r\n\r\nYa basta de carrear aprendan a jugar en equipo, a rotar, a defenderse. Como puede ser que pierdan 3 veces por stomp. y los que estompearon, estompearon bronce, porque the palys bro.....\r\n\r\n\r\nVamos a ponernos las pilas y a mejorar, no digo que yo sea el mejor, que lo soy pero no lo digo, pero podemos ser mucho mejor que esto seguro.\r\n\r\nPongan guias, hagan mejores tutoriales, pongan tips, hagan videos, aporten a que mejore su propia region.\r\n\r\nLas conexiones, pero tan complicado va a ser jugar lol? tratemos de bajar lso requisitos, de dar tips de compra de equipos y demas... Sean proactivos!!!!\r\n\r\nhttp://o.aolcdn.com/hss/storage/midas/cd6628736572c648e878c5ba224f236/205437301/27qyu8.jpg","replies":[{"poster":"Kobalth","date":"2017-09-03T20:25:52.832+0000","up_votes":2,"down_votes":0,"body":"El otro dia vi una entrevista de un jugador español que vino a competir a un equipo en Las,y justo le preguntaron las diferencias entre Europa y Las. \n\nTe dejo el vídeo en el minuto en el que habla de eso:\nhttps://youtu.be/_Lx6Un74cms?t=521\n[LINK](https://youtu.be/_Lx6Un74cms?t=521)","replies":[{"poster":"DarksWaves","date":"2017-09-03T20:44:08.096+0000","up_votes":1,"down_votes":0,"body":"Si totalmente, por eso digo que incentiven la mejora en la region, porque solos evidentemente tienen un limite muy corto.","replies":[]}]},{"poster":"Dasant Ko Fan","date":"2017-09-03T20:07:59.884+0000","up_votes":3,"down_votes":2,"body":"Oye trankilo es un juego nomas","replies":[{"poster":"DarksWaves","date":"2017-09-03T20:15:51.742+0000","up_votes":2,"down_votes":0,"body":"viste cuantos negativos a la guia de annie, siguen sin quererte men.","replies":[]}]},{"poster":"MILFortune","date":"2017-09-03T20:09:06.069+0000","up_votes":2,"down_votes":0,"body":"Entiendo la intención detrás del post. A quién no le gustaría ver a LAS como región dominante? A alguien fuera de LAS, tal vez.\nY con respecto al Winrate de cualquier persona de cualquier liga... irrelevante con respecto al nivel generalizado\nOtra cosa. Si, como decís vos ( y estoy de acuerdo en parte) no hay guías, ni consejos ni nada y de todos modos sin esas herramientas estos tipos alcanzaron el grado Retador.. tanta falta no les hace ¿verdad? . \nMi opinión con respecto a tu preocupación: [a LAS le hace falta más cultura de e-sports e infraestructura](http://.)","replies":[{"poster":"DarksWaves","date":"2017-09-03T20:15:20.522+0000","up_votes":1,"down_votes":2,"body":"Alguien va aser retador.\n\nPone a todos los bronces en un nuevo sistema de elo, y de todos esos bronces algunos van a ser retadores el sistema funciona asi filtrandolos, pero a nivel general, siguen siendo todos bronces solo que con una division mas refinada.\n\nLo que yo digo es poner algo para ampliar y expandir el nivel general. Obvio que el que tiene ams capacidades/tiempo va a destacar mas, pero que lo haga a un nivel mejor.","replies":[]}]},{"poster":"Excorpion","date":"2017-09-03T21:01:51.503+0000","up_votes":2,"down_votes":1,"body":"Lo que le falta a LAS para salir mejor, solo es emparejarse con gente de un nivel más alto, y todos saben que hablamos de Korea.\nActualmente, creo que se están emparejando con Brasil para mejorar su desempeño, al menos así lo hizo KLG antes de ganar la final, pero no creo que se suficiente para que puedan destacar en el Mundial.","replies":[]},{"poster":"lordeman10","date":"2017-09-03T22:05:38.918+0000","up_votes":1,"down_votes":0,"body":"el problema no está en ser mejor o peor sino en el sacrificio que se dan los jugadores de distintas regiones, por más que pongas guias y eso no vale nada si no hay equipos que se sienten todos los días a estudiar el juego y practicarlo, es algo que en otros paises se dan las condiciones para que sea relativamente \"normal\" pero acá es una fantasía que un jugador pueda vivir del lol, es una diferencia cultural importante","replies":[]},{"poster":"ref","date":"2017-09-03T20:26:28.352+0000","up_votes":1,"down_votes":0,"body":"decime que es sarcasmo","replies":[{"poster":"DarksWaves","date":"2017-09-03T20:44:30.945+0000","up_votes":1,"down_votes":0,"body":"q pro op vision gg","replies":[{"poster":"ref","date":"2017-09-03T21:05:51.502+0000","up_votes":1,"down_votes":0,"body":"estas seguro que somos malos porque  no nos dan las cosas necesarias para mejorar o simplemente vos no queres ser mejor, y queres que los que te representan sean buenos cuando vos no te esforzas en mejorar, esperas de los demas mas de lo que queres dar pero bueno, asi estamos.","replies":[]}]}]}]}