{"poster":"Butzel01","date":"2016-10-08T16:01:16.774+0000","title":"ich habe ein problem mir ist ein unrecht wiederfahren","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"da ich nicht weiss wo diese frage hinmuss schreibe ich sie in 2 foren\r\n\r\nalso ich habe eine belohnungs und chat strafe bekommen obwohl ich in dem game in dem ich sie bekam also danach nicht geflamt habe ich sagte nur immer wieder das meine verb&uuml;ndeten feeden w&uuml;rden was sie auch taten und das wir nicht mehr gewinnen k&ouml;nnten ob wir dann nicht aufgeben wollten\r\n\r\nalso ich finde es ungerecht das ich bestraft werde und keine belohnungen mehr bekommen kann letztes mal war dieser belohnungs bann n&auml;hmlich noch nachdem ich die 10 spiele absolviert hatte noch da bitte k&uuml;mmert euch darum","replies":[{"poster":"xBlitzlichTx","date":"2016-10-08T16:26:34.099+0000","up_votes":5,"down_votes":0,"body":"Hallo,\nes ist beabsichtigt, dass du auch nach deiner Strafe keine Hextech Crafting Belohnungen erhalten kannst. Bis das System merkt, dass du dich gebessert hast kannst du keine Belohnungen erhalten. Weitere Informationen über die Einschränkungen im Hextech Crafting kannst du [hier](https://support.riotgames.com/hc/de/articles/209939463-Einschr%C3%A4nkungen-f%C3%BCr-die-Hextech-Werkstatt) finden.","replies":[]},{"poster":"Temudschinn","date":"2016-10-08T19:16:58.568+0000","up_votes":4,"down_votes":0,"body":"Hast du denn das Gefühl, dein \"my team feeding\" würde zum Sieg beitragen?\n\nHast du das Gefühl, ein \"its lost\" würde die Stimmung im Team heben?\n\nWenn nicht, warum schreibst dus dann? Und wie kommst du darauf, dass es andere Spieler nicht stört, wenn du negative Stimmung verbreitest?","replies":[]},{"poster":"Ozuraak","date":"2016-10-09T00:11:44.064+0000","up_votes":3,"down_votes":0,"body":"Das Unrecht ist eher deinen Mates wiederfahren, die einen Mitspieler (nämlich dich) hatten, der im Chat negativ aufgefallen ist.","replies":[]},{"poster":"Wernicke","date":"2016-10-08T16:05:53.549+0000","up_votes":3,"down_votes":0,"body":"> ... ich sagte nur immer wieder das meine verbündeten feeden würden was sie auch taten...\n\nEs geht eben nicht immer nur um direkte Beleidigungen! Es geht um negativen chat! Den hast du laut eigener Aussage ja dann auch an den Tag gelegt.\nGlaubst du wirklich du bekommst nur eine Strafe wenn du Wörter wie Noob usw verwendest? Nope, sry, da haste dich getäuscht...\n\nchatlog btw","replies":[]},{"poster":"Timethief49","date":"2016-10-08T16:17:17.658+0000","up_votes":2,"down_votes":0,"body":"hast du chatlogs erhalten? wenn du wirklich nichts schlimmes geschrieben hast wird es dir ja nichts ausmachen die (uneditierten) chatlogs zu posten","replies":[{"poster":"RAG Ryve","date":"2016-10-08T16:22:03.314+0000","up_votes":1,"down_votes":0,"body":"Meine Wissens nach bekommt man Chatlogs erst beim 14 Tage Bann. Bei den Chatstrafen werden meistens nur Begründungen hingeschrieben warum man gesperrt wurde.","replies":[{"poster":"Sirrkas","date":"2016-10-09T09:46:59.584+0000","up_votes":2,"down_votes":0,"body":"Die werden mit jeder Strafe durch das Instantfeedbacksystem geliefert. Schließlich soll das System Zeitnah das eigene Fehlverhalten vor Augen führen. Ich glaube jedes mal beim einloggen, solange die Strafe noch aktiv ist, wird das angezeigt.","replies":[]},{"poster":"Timethief49","date":"2016-10-08T16:27:14.808+0000","up_votes":1,"down_votes":0,"body":"echt ich dachte da kommt auch was. k then","replies":[]}]}]},{"poster":"RAG Ryve","date":"2016-10-08T16:21:01.339+0000","up_votes":2,"down_votes":0,"body":"Sie kann auch durch ein anderes Game ausgesprochen worden sein, denn so wie du das beschreibst hast klingt es so als würdest du des öfteren flamen. \nUnd auch was du hier geschrieben haben hilft dir nicht. Solche Aussagen wie \"reportet den und den\" und \"die und der feeden\" sind nicht gern gesehen.\nDas System erkennt Feeder, Troller, Flamer und sonst was und dafür braucht man nicht im Chat zum Report aufrufen. Vor allem da das System keinen Unterschied zwischen 1 und 100 Reports macht. Jeder Spieler war nach 1 Report vom System gecheckt und dadurch brauchst du keinen anderen Report außer deinem. \n\nHier noch ein Wort der Warnung. Du befindest dich durch die Chatstrafe auf nen ziemlich schlechten Weg begeben. An deiner Stelle würde ich aufhören negative Dinge in den Chat zu schreiben denn das ist der Weg der zum Permabann führt.\n\nLG","replies":[]},{"poster":"Ascanur","date":"2016-10-21T17:21:11.476+0000","up_votes":1,"down_votes":0,"body":"\"ch sagte nur immer wieder das meine verbündeten feeden würden was sie auch taten und das wir nicht mehr gewinnen könnten ob wir dann nicht aufgeben wollten\"\n\nWenn einer hässlich aussiehst sagst du ihm er sei hässlich? Manchmal kann die wahrheit auch sehr verletztend sein !","replies":[]}]}