{"poster":"Hellion72","date":"2015-11-08T01:45:21.456+0000","title":"Vayne can condemn and stun enemy Azir against his own wall","subforum":"Report a Bug","up_votes":146,"down_votes":5,"body":"Just played a game as Azir and the enemy Vayne condemned me into my ultimate wall on two different occasions (once while ulting, and once after the ult animation had completed).  It is my understanding that the intended behavior for Azir&#039;s wall is that it act as terrain only for enemy units, but not allied units.  If this is the case, then being condemned into an enemy Azir&#039;s wall should pin me to it and stun me, but being condemned into an allied Azir wall should push me through the wall as if it weren&#039;t there, with the stun only being applied if I run into some other terrain during the condemn knockback.  If need be I can provide a replay file of the game.","replies":[{"poster":"TeCoolMage","date":"2015-11-08T02:10:12.348+0000","up_votes":75,"down_votes":1,"body":"Vayne claims to hate the act of practicing black magic\n\nHypocrite.","replies":[{"poster":"Sage Nancy","date":"2015-11-08T21:04:20.535+0000","up_votes":3,"down_votes":11,"body":"> [{quoted}](name=TeCoolMage,realm=OCE,application-id=LqLKtMpN,discussion-id=QB68FKVI,comment-id=0000,timestamp=2015-11-08T02:10:12.348+0000)\n>\n> Vayne claims to hate the act of practicing black magic\n> \n> Hypocrite.\n\nHaha.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"LegacyDAP","date":"2015-11-09T00:18:24.332+0000","up_votes":9,"down_votes":3,"body":"I swear these emoticons need to be removed now.","replies":[{"poster":"TeCoolMage","date":"2015-11-09T09:01:07.512+0000","up_votes":2,"down_votes":0,"body":"Bandwagon hive mind voting strikes again","replies":[]},{"poster":"Gubaguy","date":"2015-11-09T01:59:24.443+0000","up_votes":2,"down_votes":1,"body":"{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"lakeyja900","date":"2015-11-09T05:32:11.560+0000","up_votes":1,"down_votes":1,"body":"{{sticker:zombie-nunu-bummed}}","replies":[]}]},{"poster":"MrWasjig","date":"2015-11-09T11:41:13.875+0000","up_votes":1,"down_votes":0,"body":"Why? They're great. Not to mention adorable.","replies":[]},{"poster":"Sinlaire","date":"2015-11-09T00:54:40.158+0000","up_votes":1,"down_votes":0,"body":"heretic. that jinx is adorable.","replies":[]},{"poster":"Reaper Soraka","date":"2015-11-09T16:02:26.693+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=dapcutscene,realm=NA,application-id=LqLKtMpN,discussion-id=QB68FKVI,comment-id=000000000000,timestamp=2015-11-09T00:18:24.332+0000)\n>\n> I swear we need more emoticons now.\n\nftfy\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"longnecksam","date":"2015-11-09T15:59:07.475+0000","up_votes":1,"down_votes":1,"body":"{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]},{"poster":"Steelflame","date":"2015-11-08T06:11:47.121+0000","up_votes":2,"down_votes":4,"body":"Wouldn't be suprised if the new Graves Q works similarly (Treating it as a wall for the ability instant end to trigger).  I do think its fairly BS that Grave's new Q can be hard-stopped by champion wall abilities.\n\nNow if only Graves himself wasn't so broken as to make it not matter for the most part.","replies":[{"poster":"It Hertz When IP","date":"2015-11-08T16:20:21.138+0000","up_votes":16,"down_votes":0,"body":"I don't know if you've ever fired a shotgun into a brick wall, but it does tend to stop the projectile.","replies":[{"poster":"PK VAGABOND","date":"2015-11-09T03:35:30.443+0000","up_votes":1,"down_votes":0,"body":"It's a magical shotgun called Destiny  with two barrels that fires 3 bullets at a time.","replies":[{"poster":"My Waifu Vanilla","date":"2015-11-09T06:19:32.386+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=PK VAGABOND,realm=NA,application-id=LqLKtMpN,discussion-id=QB68FKVI,comment-id=000300000000,timestamp=2015-11-09T03:35:30.443+0000)\n>\n> It's a magical shotgun called NEW Destiny  with two barrels that fires 10 bullets at a time.\n\nNOW it is fixed","replies":[]},{"poster":"lakeyja900","date":"2015-11-09T05:33:26.554+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=PK VAGABOND,realm=NA,application-id=LqLKtMpN,discussion-id=QB68FKVI,comment-id=000300000000,timestamp=2015-11-09T03:35:30.443+0000)\n>\n> It's a magical shotgun called Destiny  with two barrels that fires **10** bullets at a time.\n\nFixed that for ya","replies":[{"poster":"Zelnorack","date":"2015-11-09T22:19:04.194+0000","up_votes":1,"down_votes":0,"body":"To be completely fair, a 12G shotgun has anywhere from 8-18 pellets depending on the type of ammo used.\n\nImagine if they went with 8 for basic, 13 for crits, and 18 for infinity edge crits. It'd be realistic, sure. But the lifesteal. The AoE.\n\nFor Graves mains, It'd be orgasmic, for almost everyone else, it'd be a nightmare.\n\n\nAlso his shotgun isn't magical. It's just specially made, specifically to Graves's specifications. I wish Riot would actually give him a double barrel shottie though. I'd really enjoy his new passive a ton more if it made any sense.","replies":[]}]}]}]}]},{"poster":"Haestro","date":"2015-11-08T04:29:38.980+0000","up_votes":11,"down_votes":0,"body":"Yeah, it's a weird interaction. If Vayne uses condemn when he casts it he can get stunned even though the wall is clearly in front of him (it makes him look like he gets stunned to something in midair lol).","replies":[{"poster":"Ariel the Cruel","date":"2015-11-08T05:32:56.015+0000","up_votes":12,"down_votes":0,"body":"The wall technically starts behind him to help self-peel.\n\nAlso, It's hilarious using it on an ulting Zed.","replies":[]}]},{"poster":"It Hertz When IP","date":"2015-11-08T16:19:09.180+0000","up_votes":7,"down_votes":1,"body":"Really thought this was going to be another \"but Graves can't have a cigar\" one.","replies":[{"poster":"TeCoolMage","date":"2015-11-09T09:04:58.374+0000","up_votes":2,"down_votes":1,"body":"Vayne can condemn Azir to his own wall.\n\n\n\n\n\n\n\n\nBut Yorick can't have a rework","replies":[]}]},{"poster":"Baron Von Bangin","date":"2015-11-08T02:29:49.697+0000","up_votes":4,"down_votes":0,"body":"Post of this was made a few days ago.  Riot is looking into it they said.","replies":[]},{"poster":"TurquoiseYoshi","date":"2015-11-08T19:55:45.153+0000","up_votes":3,"down_votes":0,"body":"Vayne's E has some dumb interactions. I remember one (I don't know if it's fixed) that stuns Quinn if she gets condemned mid-E.","replies":[]},{"poster":"moonstones","date":"2015-11-10T18:02:16.610+0000","up_votes":2,"down_votes":0,"body":"Hey Hellion72,\n\nThanks for the report! We're aware of the issue and are working to resolve it! ^-^","replies":[{"poster":"pripustas","date":"2015-11-10T18:59:21.029+0000","up_votes":1,"down_votes":0,"body":"Can you fix her Q going trough J4 ult wall?","replies":[]}]},{"poster":"Old Man Teeto","date":"2015-11-09T03:00:17.306+0000","up_votes":1,"down_votes":0,"body":"What do you expect?\n\nPoppy's wall slam and Vayne's condemn are some of the buggiest and worst coded abilities that have been redone more times than probably any other ability.\n\nBe glad that at least large model champions don't get stunned in themselves anymore.  I remember when Poppy could just charge Gragas/Cho'gath and they were guaranteed to be stunned and take the full damage.","replies":[{"poster":"TeCoolMage","date":"2015-11-09T09:09:21.318+0000","up_votes":2,"down_votes":0,"body":">Poppy's wall slam and Vayne's condemn are some of the buggiest and worst coded abilities that have been redone more times than probably any other ability.\n\n{{champion:134}} {{champion:268}} would like to have a word with you.\n\n\nSeriously, who says something like that in an Azir thread","replies":[{"poster":"Old Man Teeto","date":"2015-11-09T14:28:59.246+0000","up_votes":2,"down_votes":0,"body":"Here's some of the various Poppy wall bugs.\n\nPushing the enemy through the wall but not stunning.\nhttps://www.youtube.com/watch?v=P4oV6NT7k7c\n\nPoppy doesn't like people who recall\nhttps://www.youtube.com/watch?v=az0iZyDAZTE\n\nPoppy stunning people against nothing.\nhttps://www.youtube.com/watch?v=9TQImwVjJFU","replies":[{"poster":"TeCoolMage","date":"2015-11-10T08:11:44.381+0000","up_votes":1,"down_votes":0,"body":"Psh, remember when Azir would jump down the lane at 50 glitches per second, his sun disc sometimes disappearing, his ulti only blocking the same dash 1/2 of the time, and his soldiers becoming brainless near bronze players who'd AFK in the middle of lane without attacking (o wait, is Azir's sand sculpting skill so high he makes organs too, if not then nvm they were always brainless)","replies":[]}]}]},{"poster":"My Waifu Vanilla","date":"2015-11-09T06:25:44.874+0000","up_votes":1,"down_votes":0,"body":"At least you can get a stun with it. Currently the stars have to align for you to get the E stun on Poppy since you will most likely drag them against it (even if you shove them straight into it) whereas Condemn is the incredibly forgiving in the stun.","replies":[]}]},{"poster":"The YuBi","date":"2015-11-09T03:18:40.695+0000","up_votes":2,"down_votes":0,"body":"[https://www.youtube.com/watch?v=hJvTrrlsHzY](https://www.youtube.com/watch?v=hJvTrrlsHzY)\n\nYep, and i was recorded a movie with this subject.\nit works on others.","replies":[]},{"poster":"AbyssionKnight","date":"2015-11-08T15:53:22.481+0000","up_votes":1,"down_votes":0,"body":"Well I assume when Condemn is cast, it simply checks for a wall. It doesn't factor in whether the person you're condemning see's it as a wall, only that it is (for you) a wall.  I very much doubt they updated Vayne's condemn since this new type of passable wall was introduced.","replies":[{"poster":"Magearna","date":"2015-11-08T19:12:52.752+0000","up_votes":2,"down_votes":1,"body":"It could also be since it's an unpassable wall for Vayne, it treats it as such. Instead of checking for it being a passable wall for Azir.\n\nOhh the possibilities! Code is amazing :D\n\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Hellion72","date":"2015-11-08T23:01:49.029+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FrosIass,realm=NA,application-id=LqLKtMpN,discussion-id=QB68FKVI,comment-id=00090000,timestamp=2015-11-08T19:12:52.752+0000)\n>\n> It could also be since it's an unpassable wall for Vayne, it treats it as such. Instead of checking for it being a passable wall for Azir.\n\nAs a developer, that's my best guess as to what's going on too.  It can be a pain to retroactively add additional functionality (e.g. allied and enemy terrain) because of all the existing code that has to be touched to handle the new cases correctly.  In my experience, cases often get missed.\n\nAnother possibility that occurred to me is that they've programmed the condemn bolt to be its own unit/minion (on the same team as the Vayne), and the stun is determined by the collision of that unit with terrain (after it's attached to its target) as opposed to the collision of its target with the terrain.  Someone may have thought it was easier to code it this way and figure out the knockback/stun based on character status at different points in the unit's life cycle.  Such an approach seems unintuitive to me, but again, I don't know what their code base looks like or how they handle game state.","replies":[]}]}]},{"poster":"Synx7","date":"2015-11-08T08:11:41.667+0000","up_votes":3,"down_votes":1,"body":"spaghetti codes","replies":[]},{"poster":"PeachsProperty","date":"2015-11-08T19:09:11.463+0000","up_votes":1,"down_votes":3,"body":"you answered your own question i think\n\n\"act as terrain only for enemy units\"\n\nVayne was enemy and the enemies spell hit the wall, which is verified terrain to them which in turn activates stun.","replies":[{"poster":"Jari","date":"2015-11-08T21:13:41.199+0000","up_votes":2,"down_votes":0,"body":"At the same time, it's Azir is an ally to the wall, so the wall doesn't stop allies. She can do it with her ally Azir, where she knockbacks an enemy into her team's wall. Technically the wall is an ally here.\n\nYou gotta pick one or the other.","replies":[{"poster":"PeachsProperty","date":"2015-11-09T07:03:24.330+0000","up_votes":1,"down_votes":0,"body":"the wall may be Azir's ally and not count as terrain, but Vayne as an enemy, causes it to count as terrain because it is her spell checking for terrain.\n\nhow i would see it happening(intended or not)","replies":[{"poster":"Jari","date":"2015-11-09T18:42:36.714+0000","up_votes":1,"down_votes":0,"body":"What I meant was that you have to choose what will count as what, since she can also knock people into her Ally Azir wall to stun (Like it should, since to them it's a wall.) It can't just a both.\n\nUnless the issue is that the wall is being read as a wall before champions hit it. The problem is that it's still a problem, since it should be able to read Azir as an ally to the wall before the actual hit happens.","replies":[]}]}]},{"poster":"Draven Always","date":"2015-11-08T20:14:49.252+0000","up_votes":1,"down_votes":0,"body":"unintended consequence","replies":[]}]},{"poster":"InivtesPreeze","date":"2015-11-09T07:18:27.590+0000","up_votes":2,"down_votes":1,"body":"Riot doesn't want to do anything that harms vayne's BROKE AF status.\n\nSame status as Lee.","replies":[]},{"poster":"PrimeWraith","date":"2015-11-09T23:33:48.931+0000","up_votes":1,"down_votes":0,"body":"vayne can also condemn j4 into his own ult wall","replies":[]},{"poster":"Ńord","date":"2015-11-09T01:43:45.689+0000","up_votes":1,"down_votes":3,"body":"I know I'm gonna get a lot of flame for this (and no i don't play Vayne and never have), but I think this is good counterplay and shouldn't be changed. It's terrain and it should be treated as such. :/","replies":[{"poster":"lakeyja900","date":"2015-11-09T05:36:27.045+0000","up_votes":2,"down_votes":0,"body":"The entire point of Azir's ult is that he creates a wall that only blocks his enemies, and doesn't affect his allies.","replies":[{"poster":"My Waifu Vanilla","date":"2015-11-09T06:27:25.587+0000","up_votes":1,"down_votes":0,"body":"I shouldn't be punished for using my abilities ESPECIALLY since it is a guaranteed stun if we cast them at the same time since my wall will conveniently spawn right behind me.\n\nAlso there isn't much counterplay involved here since one party has to make a mistake for there to be counterplay, and  last I checked me standing by my OWN wall (or simply casting the ability) is 9.99999999/10 not a mistake. Jarvan's makes more sense since you go in KNOWING you are trapping yourself in there with multiple people and you are basically going on a suicide mission anyway for the hope of AoE wombo combos. Azir typically uses the ultimate for peeling purposes to AVOID cc and getting attacked.","replies":[]}]}]},{"poster":"Tapu Fini","date":"2015-11-09T05:46:00.042+0000","up_votes":1,"down_votes":0,"body":"If you consider the idea that the enemy projectile is what triggers the pin, not the champion being knocked back, it makes sense. It's a stretch, but it makes sense.","replies":[{"poster":"My Waifu Vanilla","date":"2015-11-09T06:24:16.268+0000","up_votes":1,"down_votes":0,"body":"Making sense still doesn't change the fact it is a dumb interaction since if anything the Azir should get sped up from going through his own wall as another option to this. Vayne already dicks over Jarvan we don't need any other casualties.","replies":[]}]},{"poster":"Jingerbeardman","date":"2015-11-09T04:41:20.871+0000","up_votes":1,"down_votes":0,"body":"When you get down to the programming semantics azirs ult is always considered a wall even if it is an allied wall.\n\nWhat would be worth more testing is to see if an ally on the azirs team could also be condemned to the wall. If they to can be pinned I would not consider it a bug. If they can not be pinned to it I would think it is a bug.","replies":[]},{"poster":"General Esdeath ","date":"2015-11-09T02:37:42.120+0000","up_votes":1,"down_votes":0,"body":"I would assume that should work like so, since to the Vayne the wall is coded as terrain she can't cross.","replies":[]}]}