{"poster":"penguinZ","date":"2019-12-26T22:37:29.868+0000","title":"\"Trübe\" Grafik","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe einen neuen Monitor, der von den Daten besser ist als der zuvor. Nun ist das Bild allerdings etwas trüb (mehlich / weiß). Kann mir einer sagen, was ich ändern muss?","replies":[{"poster":"IamTiltproofed","date":"2019-12-28T08:12:09.539+0000","up_votes":1,"down_votes":0,"body":"Schau mal an deinem Monitor ob du direkt am monitor einstellungen verändern kannst ob zb. vllt ein augenschonmodus aktiviert ist oder der kontrast oder gamma lichtwert zu hoch ist und dergleichen.","replies":[]},{"poster":"Alustus","date":"2019-12-27T14:53:33.855+0000","up_votes":1,"down_votes":0,"body":"Was heißt bessere Daten?\nEin IPS Display hat zum besipiel immer ein Farbenintensiveres Bild als ein TN Display, und dadurch mMn immer ein schöneres Bild.\n\nTN Displays haben die vorteile in der Energieeffizienz und Reaktionszeit, Bildwiederholungsraten, (Preis).\nMein TN Diplay hat bspw. eine für mich störende \"kristallische\" Folie (weiß nicht ob die standard bei TN Displays ist) welche bspw. Farben matt macht bzw. dunkle Farben bzw Schwarz etwas Milchig/Grau wirken lässt.\n\nIPS Displays sind meist auf 60hz und 5+ms reaktionszeit begrenzt.\n(Auch wenn dieses Jahr einige Modelle rausgekommen/vorgestellt wurden die diesbezüglich bessere Werte haben)\nHaben dafür wie schon gesagt aber eine bessere Farbdarstellung und bessere Schwarzwerte.\nWesshalb diese bei Grafikern, Fotografen etc. beliebter sind.\n\nEs kann aber bei dir aber natrürlich an den Einstellungen liegen spiel dich ein wenig mit den Einstellungen schau im Internet welche einstellungen andere mit genau deinem Monitormodell verwenden...","replies":[]},{"poster":"Eroticat Nimar","date":"2019-12-27T02:43:09.799+0000","up_votes":1,"down_votes":0,"body":"Klingt nach Kontrast Einstellungen.\n\nIn der Regel haben Monitore vorprogrammierte Optionen, schau dir Mal an welche dir davon am besten gefällt (wenn du dich nicht mit den Einstellungen auseinander setzen möchtest)\n\nSonst als Tipp: Farbintensität erhöhen, Kontrast erhöhen\n\nMfg","replies":[]}]}