{"poster":"Lut7","date":"2017-06-02T17:45:33.285+0000","title":"Hola Ge2LimiT","subforum":"Problemas Técnicos","up_votes":4,"down_votes":1,"body":"hace unos 3 meses me queje porque me suspendieron la cuenta permanentemente por una carga de rp ilegalmente que yo no hice y me la suspendieron sin que me de cuenta, y bueno no me respondieron mas y ahora le&iacute; el email que me mandaron y te quer&iacute;a preguntar porque al menos de suspenderme la cuenta me quitan el rp que se me cargo injustamente a mi cuenta.....","replies":[{"poster":"Rosv Stuff","date":"2017-06-02T19:11:25.890+0000","up_votes":1,"down_votes":0,"body":"De hecho esta mal eso, básicamente si una persona egoista y miserable te tiene odio por algo directamente carga rp con una visa robada o algo así y lo manda a tu cuenta , los cargos se revierten entonces tu cuenta queda suspendida.\n\nPero para comprar rp supuestamente te lo tiene que enviar una persona, o desde tu misma cuenta. Es como si un amigo hubiese estado en tu cuenta, compró rp con una tarjeta que no era suya, los cargos no se pagaron y entonces riot decidió banear tu cuenta.\n\nEsta la forma de regalo ( que si te regalan algo con rp y era una visa que no era suya te lo sacan ) y si cargaste rp desde tu cuenta con tarjeta que no era tuya pasan estas cosas.","replies":[{"poster":"Lut7","date":"2017-09-14T17:51:57.143+0000","up_votes":1,"down_votes":0,"body":"Si, pero yo no cargue rp nunca con tarjeta y ahora me piden que pague por paypal y yo no tengo tarjeta y nadie tiene tarjeta de los que conozco y no me permiten ni una forma que me habilite a pagarles.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-06-02T19:18:45.008+0000","up_votes":1,"down_votes":0,"body":"No, si yo por ejemplo te regalo rp a ti y no lo pago, a ti te sacan el Rp y a mi me suspenden hasta que yo lo pague. Tu estas libre de ban.\n\n\nBanean la cuenta que recibe el rp cuando recibe 800 regalos de una cuenta lvl 3 por ejemplo, donde es obvio que es una cuenta para fraude. U otra cantidad masiva de regalos.","replies":[]}]}]}