{"poster":"Snu Snu Waifu","date":"2016-04-14T21:14:50.843+0000","title":"Was mit der Dynamic-Que nicht stimmt","subforum":"Champions & Gameplay","up_votes":15,"down_votes":7,"body":"Liebe Mitspieler, liebes Riot-Team,\r\nSeit vor Beginn der ersten Season spiele Ich LoL, hatte und habe sehr viel Spa&szlig; mit dem Spiel und halte es nach wie vor f&uuml;r das beste MOBA. Auch die Art und Weise wie Riot an den Champions und Items herumschraubt, versucht das Spielerlebnis immer wieder zu variieren und mit neuem Content zu f&uuml;ttern finde ich sehr sch&ouml;n.\r\nAls vor ein paar Monaten die Dynamic Que eingef&uuml;hrt wurde hielt ich sie zuerst auch f&uuml;r eine gelungene &Auml;nderung. Es klang ganz nett, dass man eine der beiden Rollen die man ausw&auml;hlt garantiert bekommt. Und wir alle wissen, dass es vor der Dynamic Que h&auml;ufig Spiele gab, die schon in der Champselect den Bach runter gingen, wenn sich zwei oder mehr pr&auml;pubert&auml;re Kids den Sch&auml;del um die Picks eingeschlagen haben. Dieses Ph&auml;nomen tritt jetzt deutlich seltener auf und das ist sch&ouml;n. Ich behaupte allerdings das dies der einzige Aspekt ist, der durch die neue Que verbessert wurde.\r\nIm folgenden m&ouml;chte ich nochmal kurz und hoffentlich pr&auml;gnant zusammenfassen welche beiden riesigen Probleme die Dynamic-Que hat:\r\n\r\n1. Es dauert viel l&auml;nger ein Spiel zu finden\r\nIch spiele im mittleren Gold Bereich, also einem Bereich wo sich tendenziell recht viele Spieler tummeln m&uuml;ssten. Wenn ich nicht gerade Support oder Fill ausw&auml;hle (wodurch ich innerhalb einer Sekunde als Support in der Champselect lande), dauert es im Schnitt 3-5 Minuten, bis ich als Solospieler das erste Mal in der Champ-Select bin. Gerne dauert es auch mal noch l&auml;nger. Wir alle kennen es, es kommt h&auml;ufig vor dass die Champ-Select von jemandem gedodget wird. Jetzt w&uuml;rde man annehmen, dass ja nur ein Spieler ersetzt werden muss und man direkt wieder in der Champ-Select landen sollte. Es dauert dann aber h&auml;ufig wieder einige Minuten bis man einem neuen Match zugeteilt wird. So ist es eher die Regel als die Ausnahme, dass man von dem Moment in dem man auf Play dr&uuml;ckt, bis zu dem Moment in dem das Spiel startet, gut und gerne 15 Minuten nur in der Que und der Champ-Select h&auml;ngt. Von Spielern im hohen Platin und Diamond mal ganz zu schweigen, von denen ich Horrorgeschichten von 30-60 min&uuml;tigen Ques h&ouml;re.\r\nIch empfinde dies als sehr unbefriedigend, denn es ist schade wenn man z.B. in ner Stunde los muss, noch eine Runde spielen m&ouml;chte und nach 20 Minuten und 3 gedodgeten Champ-Selects entnervt den Client schlie&szlig;t.\r\n\r\n2. F&uuml;r Solo-Spieler ist Ranked nun reines RNG\r\nSchon vor der Dynamic Que war es immer auch ein wenig Gl&uuml;ckssache, wie Spiele ausgingen. Da LoL stark auf Teamplay basiert und mit 10 Spielern gespielt wird, gibt es in jedem Spiel immer noch 9 andere Faktoren, die au&szlig;er einem selbst das Spiel beeinflussen. Auch vor der Dynamic Que kam es schon vor dass irgend ein Diamond Smurf einen DuoQ Partner geboosted hat und dadurch das Spiel verzerrt wurde. Allerdings habe ich damals noch das Argument gelten lassen, dass man selbst die einzige Konstante &uuml;ber alle Rankeds hinweg ist und nach einer gewissen Anzahl von Spielen zu 99% auf einer Elo war, die man verdiente. Seit der Dynamic-Que ist LoL abseits der professionellen E-Sport Szene nur noch ein Witz was Competitive-Play angeht. Ab Gold, aber vor allem in Platin und zum Teil auch in Diamond treiben geboostete Spieler ihr Unwesen, die vollkommen untergehen, wenn sie Solo unterwegs sind und gegen einen Gegner spielen m&uuml;ssen der tats&auml;chlich auf die Elo geh&ouml;rt. Mal hat man 3-4 Premades im eigenen Team, mal hat man 3-4 im Gegnerteam. Diese Premadegruppen w&uuml;rfeln sich teilweise wild zusammen aus Spielern die deutlich zu gut, oder auch deutlich zu schlecht sind f&uuml;r die Elo auf der gespielt wird, haben aber immer den Vorteil dass sie X-mal besser koordiniert sind als 5 Solo-Que Spieler die nur &uuml;ber Pings, oder den Chat miteinander kommunizieren k&ouml;nnen. Das ganze System f&uuml;hlt sich f&uuml;r Spieler die haupts&auml;chlich Solo-Que spielen einfach unglaublich unbefriedigend und zuf&auml;llig an.\r\nMan hat nicht im geringsten das Gef&uuml;hl dass ein fairer Wettbewerb herrscht.\r\nDie Dynamic Que wirkt eher wie ein Casual-Fun Modus, aber keinesfalls wie ein Modus der f&uuml;rs kompetitive Spiel geeignet ist.\r\n\r\nWas k&ouml;nnte man tun um Ranked-Spielen wieder interessant zu machen?\r\nIch wei&szlig; auch nicht was am besten funktionieren w&uuml;rde. Es w&auml;re wahrscheinlich sehr kompliziert eine reine Solo-Que und die Dynamic-Que nebeneinander laufen zu lassen, weil dies dazu f&uuml;hren k&ouml;nnte dass kein Solo-Spieler mehr Dynamic-Que spielt, was in noch viel l&auml;ngeren Wartezeiten f&uuml;r diese resultieren w&uuml;rde. Mittlerweile w&uuml;rde ich tats&auml;chlich sagen, Riot sollte die Dynamic Que bitte auf den normalen Spielmodus verschieben und f&uuml;r Rankeds eine reine Solo-Que und einen 5-er Team Modus einf&uuml;hren. Wenn es sein muss auch noch einen Duo-Que Modus. Das alles bitte mit der Champ-Select wie sie fr&uuml;her war.\r\nDie Dynamic Que gibt ein kompetitives, faires Spielerlebnis meiner Meinung nach im derzeitigen Zustand nicht her und hat damit in der Ranked-Sektion nichts verloren.\r\n\r\nDanke f&uuml;rs lesen.","replies":[{"poster":"gh0stsh3ll","date":"2016-04-14T21:31:20.425+0000","up_votes":5,"down_votes":3,"body":"Ranked sollte SoloQ sein, Teamranked sollte wieder eingeführt werden und DQ kann meinetwegen als normal Gamemode bestehen bleiben","replies":[{"poster":"Megamaexx","date":"2016-04-15T08:50:20.796+0000","up_votes":4,"down_votes":0,"body":"dynamicQ im Normal Mode existiert, seitdem LoL existiert ;)","replies":[{"poster":"Bergelmir32","date":"2016-04-15T09:59:31.798+0000","up_votes":4,"down_votes":1,"body":"ACH BITTE!!!, das ist viel zu viel Realität für einen \"DynQ ist bäh\" Thread.","replies":[]}]}]},{"poster":"fellkefer","date":"2016-04-15T10:14:51.914+0000","up_votes":3,"down_votes":0,"body":"Ich habe bisher noch keinen Solo Spieler gesehen der mit DynamicQ zufrieden ist. Die meisten Leute (inklusive mir) sind einfach nur genervt von dieser Premade party. Die meisten Spiele spielt man mit 3-4 und gegen 3-4 Premades. Das ist einfach nicht competitive für Solo Spieler und ich habe bisher niemanden gesehen der mir auf einer sachlichen Ebene das Gegenteil beweisen will. \n\nAls Folge spielen viele solo Spieler auf ihren smurfs und/oder spielen just for fun. IMO dynamic Q = normal. Es gibt im Moment keinen Spielmodus der sich Ranked nennen darf.","replies":[{"poster":"The Lars22","date":"2016-04-16T13:43:47.932+0000","up_votes":1,"down_votes":0,"body":"Also ich habe bisher kein Problem mit DQ gehabt.\nDas einzige Problem ist, dass man immer noch einen Platz in der Runde frei hat für den freund, mit dem man eigentlich nicht ranked spielen möchte.","replies":[]}]},{"poster":"Sihari","date":"2016-04-15T08:15:08.276+0000","up_votes":4,"down_votes":1,"body":"Ich gebe dir bei fast allen Punkten, die du aufgeführt hast, volkommen Recht. Die DynamicQ ist den alten Warteschlangen total unterlegen und nichts anderes, als ein glorifiziertes Normal-Game.\nDie neue Championselect kann mit kleinen Änderungen gern bleiben. Ich mag das System, dass einem garantiert nicht seine schlechteste Rolle spielen zu müssen, weil man Lastpick ist. Und ich mag es auch, dass die Banngewalt nicht nur bei einer einzigen Person liegt.\nAber ansonsten hätte ich gern eine Queue, mit der ich vergleichen kann, wie gut oder schlecht meine Solo-Performance ist und eine, in der ich den Teamaspekt des Spiels mit jedem Freund den ich mag vollkommen ausleben kann. Egal wie schlecht ich als Solospieler bin!","replies":[]},{"poster":"Marcus Phillida","date":"2016-04-15T08:03:57.378+0000","up_votes":2,"down_votes":0,"body":"Wunderbar geschrieben +1 {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Asteriade","date":"2016-04-14T23:13:20.015+0000","up_votes":1,"down_votes":2,"body":"Punkt 2 kann ich voll unterschreiben, DynamicQ hat Spielern wie mir, die so gut wie gar keine Mates auf selben Spielniveau haben und auch weiterhin kaum Kontakte in LoL besitzen (Weil RL-Freunde mit dem Spiel nichts anfangen können etc.) vollends ins Gesicht geschlagen.\n\nIn der Preseason hab ich es auf Dia4 Promo Dia3 geschafft und habe mich dort richtig wohl gefühlt (Adc/Supp>Top), jetzt sitze ich seit fast 250Games in Plat3/2/1 fest - dass ich Pechvogel nr1 in SoloQ war, war mir und den wenigen Mates bekannt aber durch die einzige Konstante - Ich - hat es über lang trotzdem stetig bergauf geführt. \nJetzt hingegen... Troll, Troll, Troll, Flame, Flame, Flame - Premades lassen ihre Wut an mir \"Randombob\" aus, das FullSoloQteam wird binnen 18Minuten vollständig von den 4 Gegnerpremades auseinander genommen und und und...\nIch kann mich NICHT erinnern, dass ich in den letzten 50Games NICHT geflamte wurde, egal ob 0/10 oder 20/0 war - übertrieben gesagt.\nEinmal hat man nicht so reagiert wie die werten Premades das wollten, schwupps wird man zurecht gestutzt.\nEben Jarvan4 top 11/2 ... richtig ich wurde in Grund und Boden geflamte.\n1 Game später Promo erreicht, direkt 3 Premades gegen Fullrandom... min 25 lose, wunderbares System.\n\nGanz ehrlich, Season6 ist die erste Season die mir nicht wirklich spaß macht, nicht wegen der Balance, nein weil die DynamicQ definitiv nicht richtig durchdacht ist. (spiele seit Ende von Season3)\n\nWenn ich sehe wie das Gegnerteam 3 Premades hat und wir 0,  wovon 2  jeweils 92 und 87%!!! Winrate haben, in über 90 Spielen und der 3. im Bunde seit 3 Seasons in Lowgold vergammelt ist und nun in Plat2 ist mit absolut schrecklichen Stats, dann läuft einfach was ganz gewaltig schief!\n\nMit Lucian hatte ich 65% Winrate in ca 60Games, diese hat sich innerhalb von 2 Tagen auf 53% verschlechter weil in wirklichen jeden Spiel irgendwelche Trollpremades im Team waren. Diese Season ist für wirkliche Solospieler die NICHT am Smurfen sind oder gleich mal 7 8 Divisionen höher gehören pures Glück.\n\nEs wirkt einfach nur noch nach pures Yolo und nicht nach irgendwelchen Plänen oder gar Competive.\n\n\n\n\nDie Aussage, dass Premades gegen Premades spielen kann ich nichtmal im Ansatz bestätigen da ich vor allem auch jedesmal nachfrage wie viele Premades mein Team hat - einfach um den Flame zu entgehen und so zu spielen wie die es gerne hätten.\n\n\nDoch auch habe ich das komplette Gegenteil erfahren, zwar selten aber ist passiert... kriege 2-3Premades ins Team diese haben das Spiel schneller beendet als ich auch nur 1-2Kills/Supports gemacht habe. Auch ein \"sehr schönes\" Spielerlebnis.","replies":[{"poster":"Jastol","date":"2016-04-15T06:26:35.464+0000","up_votes":2,"down_votes":2,"body":"Woher weißt du ob und wie viel Premades das Gegnerteam hat, oder das eigene? Wenn die nicht zufällig alle das gleich Clubtag haben kannst du das nicht wissen und selbst im eigenen Team erlebe Ich selten, dass Spieler das rausposaunen wenn sie premades sind. \n\nDas mit dem Flamen kann Ich auch nicht nachvollziehen. Ich finde es wurde viel viel weniger Flame seit dieser Season. Eigentlich recht angenehm und das obwohl Ich auch fast nur SoloQ spiele und ab und zu mal mit 1-2 Kumpels. Andererseits bin Ich ein sehr Team orientierter Spieler und versuche nicht mein Ego zu massieren und alles Solo durch zuziehen. Daher kann Ich mich auch gut in Premade Teams einfügen.","replies":[{"poster":"Marcus Phillida","date":"2016-04-15T08:03:21.669+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=00030000,timestamp=2016-04-15T06:26:35.464+0000)\n>\n> Woher weißt du ob und wie viel Premades das Gegnerteam hat, oder das eigene? Wenn die nicht zufällig alle das gleich Clubtag haben kannst du das nicht wissen und selbst im eigenen Team erlebe Ich selten, dass Spieler das rausposaunen wenn sie premades sind. \n> \n> Das mit dem Flamen kann Ich auch nicht nachvollziehen. Ich finde es wurde viel viel weniger Flame seit dieser Season. Eigentlich recht angenehm und das obwohl Ich auch fast nur SoloQ spiele und ab und zu mal mit 1-2 Kumpels. Andererseits bin Ich ein sehr Team orientierter Spieler und versuche nicht mein Ego zu massieren und alles Solo durch zuziehen. Daher kann Ich mich auch gut in Premade Teams einfügen.\n\nDie haben meistens den Clubtag wenn sie Premades sind.^^","replies":[{"poster":"Jastol","date":"2016-04-15T09:39:30.697+0000","up_votes":2,"down_votes":4,"body":"Ich spiele mit verschiedenen Freunden zusammen, welche in unterschiedlichen Clubs sind. Neben mir tragen nur 2 meiner Kumpels mein Club Tag als primäres Tag, sprich wenn ich mit den anderen Zusammenspiele, weiß kein anderer das wir premades sind und Ich würde fast sagen das ist öfters der Fall als umgekehrt. Wenn Ich also mit 3 Kumpels, welche alle unterschiedliche Tags haben gegen ein Team spiele bei dem 4 Leute das gleiche Tag haben wäre es für dich 5 Randoms gegen 4er Premade. Das ist dann eine vollkommen irrationale und nicht Sachliche Behauptung oder mit den Worten eines AFD Wählers, dass ist FAKT!!!111. Man kann so etwas gerne aufführen aber es disqualifiziert sich als valide Argumentationsgrundlage.","replies":[{"poster":"Snu Snu Waifu","date":"2016-04-15T12:42:13.613+0000","up_votes":1,"down_votes":0,"body":"Gut, in deinem Beispiel spielen dann 4 Premades und 1 Solo gegen 4 andere Premades und 1 Solo.\nDenkst du, da herrschen für die beiden Solo Spieler die selben Bedingungen, wie wenn 5 Solos gegen 5 andere Solos spielen würden?","replies":[{"poster":"Jastol","date":"2016-04-18T06:34:21.794+0000","up_votes":1,"down_votes":1,"body":"Du scheinst den Sinn meines Posts nicht verstanden zu haben. \nJe nach Tags wissen in beiden Teams die Einzelspieler nicht wie viele Premades im eigenen und/oder im Gegnerischen Team sind. Dadurch entsteht einen emotionale Verzerrung der Wahrnehmung.\n\nWenn Team A 4 Spieler mit identischem Tag hat und Team B 5 Spieler mit unterschiedlichen Tags, dann wird der Solo Spieler in Team B angepisst sein, weil er denkt, dass sie 5 Solo gegen 4er premades spielen.\nHab am We erst wieder mit 3 Premades gespielt und wir hatten insgesamt 3 unterschiedliche Clubtags.","replies":[]},{"poster":"Asteriade","date":"2016-04-15T18:21:29.359+0000","up_votes":1,"down_votes":1,"body":"Ich habe bereits nach 3 Zeilen dieser Antwort von Jastol nur noch überflogen, passiv toxic gespickt mit passiven Unterstellungen, sowas kann ich nicht ernstnehmen.\n\nKomischerweise sehe ich ca aller 3-4Spiele 2-3 Leute mit dem selben Clubtag, kann also nicht soooo selten sein.\n\n\nDeine Ausführung hingegen trifft es direkt auf den Punkt, genau das ist was ich bemängel. Entweder - und das habe ich in meinem Roman auch erwähnt, hat man Premades die so hart carrien das man selber nichts machen kann, weil sie zb. Mitte oder Top schon durchgepusht haben während die Gegnerbotlane und wir noch eine normale Lanephase betreiben - und wieso sollte ich das ändern wenn die 3-4 Premades snowballen wie verrückt - da verhindere ich doch lieber das Backcallen des Gegners.\nDoch genauso umgedreht hatte ich etliche Spiele wo mein Team schon 0vs10 während wir auf der Botlane noch nichtmal die 100Farm erreicht hatten - sprich Premin 10-12.\n\nAmüsant wirds, wenn die Premades sich flamen, dann hat man wenigstens noch etwas zum Schmunzeln.\n\nUnd BEIDE Fälle sind einfach kein schönes Spielerlebnis und \"Fakt!!!111.\" ist - das dies nun deutlich öfter vorkommt.\nIch hatte gestern als 13/1 Shen mein erstes Spiel wo ich NICHT geflamte wurde seit über 50Runden und oh wunder es war ein Spiel komplett ohne Premades - dass das an \"Solo\"-Spiel liegt kann kaum sein wenn man bedenkt, dass ich egal ob Win oder Lose - meisten (nicht immer ofc) - eine K/C also Killbeteiligung von 55-80% aufweise.","replies":[{"poster":"Jastol","date":"2016-04-18T06:29:16.405+0000","up_votes":1,"down_votes":1,"body":"Das sind und bleiben deine Erfahrungen. Ich habe bisher Gegenteilige Erfahrungen in der DynQ gemacht. Sprich, wir beide können das nur Subjektiv beurteilen. Trotzdem habe Ich etwas dagegen wenn jemand sich anmaßt seine eigenen Erfahrungen als die Aller darzustellen bez. von sich auf die Allgemeinheit schließen.\n\nPS: Ja wahrscheinlich war mein Text etwas passiv Aggressiv, aber Unterstellt habe Ich (zumindest dir) darin nichts, hoffe du hast das mit der AFD nicht als Angriff auf dich gesehen, wollte damit eigentlich meinen Absatz (und das passiv aggressive) etwas auflockern. Wenn du dich dadurch angegriffen gefühlt hast ging das wohl nach hinten los. Humor und Satire ist nun mal auch Streitbar und Geshcmackssache ;).","replies":[]}]}]},{"poster":"Marcus Phillida","date":"2016-04-15T12:13:11.449+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=0003000000000000,timestamp=2016-04-15T09:39:30.697+0000)\n>\n> Ich spiele mit verschiedenen Freunden zusammen, welche in unterschiedlichen Clubs sind. Neben mir tragen nur 2 meiner Kumpels mein Club Tag als primäres Tag, sprich wenn ich mit den anderen Zusammenspiele, weiß kein anderer das wir premades sind und Ich würde fast sagen das ist öfters der Fall als umgekehrt. Wenn Ich also mit 3 Kumpels, welche alle unterschiedliche Tags haben gegen ein Team spiele bei dem 4 Leute das gleiche Tag haben wäre es für dich 5 Randoms gegen 4er Premade. Das ist dann eine vollkommen irrationale und nicht Sachliche Behauptung oder mit den Worten eines AFD Wählers, dass ist FAKT!!!111. Man kann so etwas gerne aufführen aber es disqualifiziert sich als valide Argumentationsgrundlage.\n\nWow, da hast du gut drüber nachgedacht, hast jedenfalls recht.^^","replies":[]}]}]}]}]},{"poster":"Neamhoilte","date":"2016-04-14T21:30:20.161+0000","up_votes":3,"down_votes":2,"body":"+1 \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Spicavius","date":"2016-04-14T21:30:00.579+0000","up_votes":4,"down_votes":4,"body":"> Ich empfinde dies als sehr unbefriedigend, denn es ist schade wenn man z.B. in ner Stunde los muss, noch eine Runde spielen möchte und nach 20 Minuten und 3 gedodgeten Champ-Selects entnervt den Client schließt.\n\nSry aber, das hat man auch früher nicht geschafft bzw musste man das Risiko eingehen, dass man entweder vorher aufhört oder zu spät kommt. Deswegen spielt man eben in der Zeit Aram.\nZugegebenermaßen hast du aber in dem Punkt recht, dass es einfach zu viele Idioten gibt, die es immer noch nicht peilen auf \"bestätigen\" zu drücken. Stattdessen pimmeln die Leute auf Youtuber oder Gaypornseiten rum -_- (wenigstens kriegen die Leute eine Zeitstrafe)\n\n\n> Wenn ich nicht gerade Support oder Fill auswähle (wodurch ich innerhalb einer Sekunde als Support in der Champselect lande), dauert es im Schnitt 3-5 Minuten, bis ich als Solospieler das erste Mal in der Champ-Select bin. \n\nBei mir waren es damals immer zwischen 3-5 Minuten. Ergo es hat sich nicht geändert, außer den Idioten, die es nicht hinkriegen auf \"bestätigen\" zu klicken.\n\n___________________________________________\n\n> \n> Mal hat man 3-4 Premades im eigenen Team, mal hat man 3-4 im Gegnerteam. Diese Premadegruppen würfeln sich teilweise wild zusammen aus Spielern die deutlich zu gut, oder auch deutlich zu schlecht sind für die Elo auf der gespielt wird, haben aber immer den Vorteil dass sie X-mal besser koordiniert sind als 5 Solo-Que Spieler die nur über Pings, oder den Chat miteinander kommunizieren können.\n\nHier einige Zahlen zu deiner These, dass man ziemlich oft gegen 5er Gruppen spielt, während man selber in einem Duo/Solo Team ist.\n_\nEin Team nur aus Solo und Duos gegen ein 4er oder 5er Premadeteam kommt nur in 0,21 % der Matches vor.\n4er oder 5er Premadeteams werden in 98,6 % der Spiele gegen andere 4er oder 5er Premades gematcht.\nSolo Que Spieler kommen nur in 3% der Spiele in ein 4er Premadeteam._\n\n\n\nAlso die Essenz deiner Beschwerden sind folgende:\n1. Lange Queuezeiten/Championselectionzeiten ----> Mehr Zeit für ein Spiel\n2. Ungerechte Teams ala \"Solo/Duo-Team vs 5er Premadeteam\".\n\nIn Punkt 1 kann ich, wie schon oben geschrieben, dir zustimmen, aber das ist eben nicht Riots Schuld, sondern eher die Dummheit oder Unaufmerksamkeit der Spieler, die es nicht hinkriegen den \"Bestätigen\"-Button zu klicken.\nAber ja Riots könnte vllt mehr Aufmerksamkeitserregende Pfeile auf den Button richten. Vllt schaffen es dann diese Leute... -.-\n\nIm Punkt 2 kann ich nur auf die Zahlen zurückverweisen. Diese Zahlen zeigen objektiv und neutral wie es momentan IST und nicht zu sein scheint.","replies":[{"poster":"Lohbar","date":"2016-04-15T09:03:35.599+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=0000,timestamp=2016-04-14T21:30:00.579+0000)\n\n> Hier einige Zahlen zu deiner These, dass man ziemlich oft gegen 5er Gruppen spielt, während man selber in einem Duo/Solo Team ist.\n> _\n> Ein Team nur aus Solo und Duos gegen ein 4er oder 5er Premadeteam kommt nur in 0,21 % der Matches vor.\n> 4er oder 5er Premadeteams werden in 98,6 % der Spiele gegen andere 4er oder 5er Premades gematcht.\n> Solo Que Spieler kommen nur in 3% der Spiele in ein 4er Premadeteam._\n\nWenn die Zahlen so gering sind, wieso dann nicht ganz unterbinden? Wenn nur 0,2% der Spiele 5 gegen einzelne oder Duos sind, wieso nicht hardcoded verhindern? Würde die Wartezeit ja nicht erhöhen, da sowieso nur 0,2% der Spiele so zustandekommen und ein Hauptargument der dynamiq Queue Gegner wegnehmen. Also kommt es offensichtlich doch öfters vor.\n\nWobei mich mehr das fehlende Teamranked mit einer Team MMR statt Solo MMR fehlt. Das könte man ebenfalls so einfach einbauen ( 5er Premades weiterhin in der Dynamiq Queue lassen, aber mit Teamwertung wie früher) und würde einige probleme beheben wie z.B. das Spieler stark unterschiedlicher Leistung zusammen spielen können.","replies":[{"poster":"Jastol","date":"2016-04-15T09:45:55.841+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Lohbar,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=00000001,timestamp=2016-04-15T09:03:35.599+0000)\n>\n> Wenn die Zahlen so gering sind, wieso dann nicht ganz unterbinden? Wenn nur 0,2% der Spiele 5 gegen einzelne oder Duos sind, wieso nicht hardcoded verhindern? Würde die Wartezeit ja nicht erhöhen, da sowieso nur 0,2% der Spiele so zustandekommen und ein Hauptargument der dynamiq Queue Gegner wegnehmen. Also kommt es offensichtlich doch öfters vor.\n\nWie kommst du auf die Behauptung, dass es zeitlich keinen Unterschied machen würde? Ich glaube schon dass es den geben würde nämlich zu den Zeiten wo wenig Spieler online sind. Aber solange Ich dazu keine Konkreten Zahlen habe kann ich das nicht beurteilen\n\n> Wobei mich mehr das fehlende Teamranked mit einer Team MMR statt Solo MMR fehlt. Das könte man ebenfalls so einfach einbauen ( 5er Premades weiterhin in der Dynamiq Queue lassen, aber mit Teamwertung wie früher) und würde einige probleme beheben wie z.B. das Spieler stark unterschiedlicher Leistung zusammen spielen können.\n\nZwei verschiedene Bewertungssysteme in eine Q würden glaube Ich zu totalem Chaos führen und 5vs5 ist ja kein Problem sondern dass sich Leute über 5vs4+1 und ähnliches aufregen. Das Problem mit den unterschiedlichen leistungen würde es auch nicht beheben, dann würden halt immer 4+1vs4+1 spielen und du hättest das gleiche. Ausserdem ist in der dynQ wenigstens ausgeglichener als früher im Teamranked wo ein Dia Spieler 4 Bronze boys durchgecarried hat.","replies":[]}]},{"poster":"Sakuraveil","date":"2016-04-15T00:50:04.317+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=0000,timestamp=2016-04-14T21:30:00.579+0000)\n\n> Hier einige Zahlen zu deiner These, dass man ziemlich oft gegen 5er Gruppen spielt, während man selber in einem Duo/Solo Team ist.\n> _\n> Ein Team nur aus Solo und Duos gegen ein 4er oder 5er Premadeteam kommt nur in 0,21 % der Matches vor.\n> 4er oder 5er Premadeteams werden in 98,6 % der Spiele gegen andere 4er oder 5er Premades gematcht.\n> Solo Que Spieler kommen nur in 3% der Spiele in ein 4er Premadeteam._\n\n\nSind die Zahlen von Riot? Falls ja sind sie nicht zuverlässig. Man nimmt keine Statistiken von einer Firma als Quelle über Sie selber ohne transparenz.\n3er premades anscheinend gar keine zahlen und 2er auch nicht.\nEs soll einfach eine 100% Matchqoute her. Ob 3 min warten oder 3:30 is dann auch egal. Es wird so getan als würden die q zeiten auf 20 min steigen.\nDie ganze masche hinter der sache ist ein vergeblicher versuch die taschen zu füllen, siehe premadevorteil via belohnungen usw.","replies":[]}]},{"poster":"Megamaexx","date":"2016-04-15T08:48:09.923+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=mlg Baithoven,realm=EUW,application-id=Wj1wcocU,discussion-id=KIHHEEr2,comment-id=,timestamp=2016-04-14T21:14:50.843+0000)\n>\n\n> Als vor ein paar Monaten die Dynamic Que eingef&amp;uuml;hrt wurde hielt ich sie zuerst auch f&amp;uuml;r eine gelungene &amp;Auml;nderung. Es klang ganz nett, dass man eine der beiden Rollen die man ausw&amp;auml;hlt garantiert bekommt. Und wir alle wissen, dass es vor der Dynamic Que h&amp;auml;ufig Spiele gab, die schon in der Champselect den Bach runter gingen, wenn sich zwei oder mehr pr&amp;auml;pubert&amp;auml;re Kids den Sch&amp;auml;del um die Picks eingeschlagen haben. Dieses Ph&amp;auml;nomen tritt jetzt deutlich seltener auf und das ist sch&amp;ouml;n. Ich behaupte allerdings das dies der einzige Aspekt ist, der durch die neue Que verbessert wurde.\n\nVerwechsle die neue Champion Selection nicht mit dynamc Queue, das sind zwei unterschiedliche Sachen, die zur selben Zeit erschienen sind. Die Champion Selection ist lediglich ein neues Draft Pick, dynamic Queue bezeichnet die Ranked-Warteschlange.\n\n> 1. Es dauert viel l&amp;auml;nger ein Spiel zu finden\n\nDas liegt weniger am neuen System, sondern eher daran, dass keiner mehr in eine Rolle muss, die er nicht spielen möchte (sofern er zwei hat). Damals wurden viele zum supporten gezwungen, da nur auf 5 Spieler gewartet werden musste. Man braucht einfach mehr Supporter. Lösungen hierzu wären höherer Reward für unbeliebtere Positionen, was andere Spieler wiederum als äußerst unfair ansehen würden... Naja... Mehr Supporter braucht das Land! (bzw der Server^^)\n\n> \n> 2. F&amp;uuml;r Solo-Spieler ist Ranked nun reines RNG\n\nDie Smurfs zerstören eben das Matchmaking dezent. Da man dagegen nichts tun kann (bzw. Riot nichts dagegen tun will) ist es manchmal etwas frustrierend. Ich glaube allerdings nicht, dass es so viele Smurfs auf meiner Elo gibt oder man bemerkt sie nicht.\n\n> Was k&amp;ouml;nnte man tun um Ranked-Spielen wieder interessant zu machen?\nMan könnte dynamic Queue nur für 2er, 3er und 5er-Teams anbieten und parallel die SoloQ laufen lassen. Rein theoretisch wäre das auch alles über eine Queue steuerbar. (Solo nur mit anderen Solos, Teams nur gegen Teams, kleinere Premade-Gruppen nur gegen kleinere Premade-Gruppen.)","replies":[]},{"poster":"IreliacarrysU","date":"2016-04-22T16:55:46.836+0000","up_votes":1,"down_votes":0,"body":"Besser kann man das nicht schreiben, momantan einfach nur wertlos und der spass geht auch flöten !!!! ","replies":[]},{"poster":"Floen","date":"2016-04-15T18:51:21.021+0000","up_votes":1,"down_votes":0,"body":"Bin selber momentan Bronze III und habe oft queue times von 10 min oder mehr wenn ich nicht Support oder Fill nehme.\nHoffe es gibt dabald eine Lösung, habe keine Lust nur noch Support zu spielen.","replies":[]},{"poster":"XenesisCH","date":"2016-04-15T05:57:26.531+0000","up_votes":1,"down_votes":2,"body":"Du hast noch einen weitern Punkt für vergessen, welcher meines Erachtens ebenfalls einen massgeblichen Einfluss auf den (teilweise langen) Prozess Warteschlange/Champselect haben kann. Die Champselect könnte man immer noch benutzerfreundlicher gestalten, wenn die Autobestätigung wieder eingeführt wird, wenn der Spieler einen Champion ausgewählt hat, aber nicht manuell bestätigt hat. Es passiert nämlich immer noch regelmässig, dass ein Spieler einen Ban bzw. einen Champion ausgewählt hat und diesen einfach nicht bestätigt (vergisst den Orangen Button zu drücken) und alle wieder aus der Championauswahl fliegen und wieder in die Warteschlange zurückfallen.","replies":[]}]}