{"poster":"Snu Snu Waifu","date":"2018-05-06T04:07:22.036+0000","title":"\"Idc anymore\" - Attitude und das Bestrafungssystem","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Wer kennt es nicht? \nDas Spiel l&auml;uft ganz ordentlich, aber ein Mitspieler z.B. die Toplane verliert ziemlich deutlich, meistens weil er vom gegnerischen Jungler geganked wurde, o.&auml;. \nDarauf angesprochen ob er vorsichtig spielen kann, oder &auml;hnliches kommt die Antwort: &quot;No, idc anymore, our jungle useless&quot; oder vergleichbares, meistens noch &quot;ff this pls&quot;. Dem betreffenden Mitspieler ist es dabei egal, ob die anderen Lanes gut laufen. Er ist jetzt ganz doll sauer weil seine Lane ihm keinen Spa&szlig; mehr macht, strengt sich nicht mehr an und ist oft der Grund warum das Spiel am Ende verloren geht, wenn man ihn nicht Huckepack im Elo-Bobbycar den Berg hochschiebt. \nDiese Sorte Spieler sieht es auch am Ende nicht ein, dass sie etwas falsch gemacht haben, sondern sehen sich noch in ihrer Analyse des Spiels best&auml;tigt (&quot;Told you this was lost, why not just ff at 15&quot;).\nDieses Verhalten sehe ich leider unendlich h&auml;ufig, gerade in der SoloQ. Viel h&auml;ufiger als etwa Leute die absichtlich trollen, inten o.&auml;.\nEinfach diese Kindergartenhaltung &quot;Mir macht das Spiel jetzt keinen Spa&szlig; mehr, also streng ich mich nicht mehr an und verderb es euch auch.&quot;, ungef&auml;hr &auml;quivalent zu den 8 J&auml;hrigen die damals im &quot;Mensch &Auml;rger dich nicht&quot; nicht verlieren konnten und darum einfach das Brett umgeschmissen haben.\n\nViele weinen hier im Forum immer &uuml;ber die &quot;Trolle&quot;, aber einen wirklichen Troll, also jemanden der etwa Nunu mit Ghost Tp pickt und absichtlich von Anfang an das Spiel sabotiert, habe ich vielleicht in einem von 100 Spielen. \nDiese Leute die allerdings ihre Lane verlieren und deshalb allen anderen das Spiel verderben, indem sie sich nicht mehr anstrengen, nicht mehr groupen, nur noch splitpushen oder permanent gecatched werden, sehe ich sehr sehr h&auml;ufig und ich habe das Gef&uuml;hl, dass sie vom Report-System nicht wirklich erfasst und bestraft werden (k&ouml;nnen).\nSpieler die im Chat mit Beleidigungen um sich werfen oder spammen (unabh&auml;ngig von ihren Stats) erkennt das System gef&uuml;hlt sehr zuverl&auml;ssig. Immer mal wieder wenn ich einen schlimmen Flamer reporte, bekomme ich danach ein Report-Feedback. \nWenn ich aber solche Spieler wie oben beschrieben reporte, habe ich das Gef&uuml;hl, dass es absolut vergeblich ist. Das System erkennt dieses Verhalten nicht als Penalty-w&uuml;rdig an und kann folglich auch keine Chat Restriction oder tempor&auml;re Sperre vergeben. Immer vorrausgesetzt nat&uuml;rlich, dass der betreffende Spieler nicht gleichzeitig auch noch viel im Chat beleidigt.\n\nMir ist schon bewusst, dass es sehr sehr schwer ist, dieses Verhalten automatisiert zu erkennen und zu bestrafen. Auf der rein technischen Ebene hast du da eben einen 1-12-3 Yasuo, oder sowas, der ein, zweimal im Chat &quot;Idc no more&quot;, &quot;this is over, ff pls&quot; oder &auml;hnliches geschrieben hat. Ein 1-12-3 Yasuo k&ouml;nnte auch einfach nur ein schlechtes Spiel gehabt haben, das kann man rein von den Zahlen her nicht bestrafen, aber dass an vlt. 7 von den 12 Toden einfach seine Attitude Schuld war, kann das System nicht ausmachen.\nMan kann nicht Tausende Reports pro Tag manuell pr&uuml;fen und ich wei&szlig; nicht, wie viele Reports zumindest Stichprobenartig manuell gepr&uuml;ft werden, aber gef&uuml;hlt sind es zu wenige. Mir f&auml;llt hier spontan auch keine L&ouml;sung ein wie man dieses Problem ohne unverh&auml;ltnism&auml;&szlig;igen Aufwand zu betreiben l&ouml;sen k&ouml;nnte, aber ich w&uuml;rde mir w&uuml;nschen, dass zumindest in der Kategorie &quot;Negative Attitude&quot; deutlich mehr Reports manuell &uuml;berpr&uuml;ft werden w&uuml;rden, gerade bei Spielern die regelm&auml;&szlig;ig in dieser Kategorie reportet werden.\n\nGef&uuml;hlt kann man sich in League of Legends wie der letzte Arsch auff&uuml;hren, solange man im Chat nicht direkt beleidigt/spammt, oder mit 6 Tears eine Lane runterrennt, hat man wenig Konsequenzen zu bef&uuml;rchten und das finde ich schade.\n\nWie seht ihr das? Habt ihr auch h&auml;ufig mit solchen Spielern zu tun? Habt ihr einen L&ouml;sungsansatz, der f&uuml;r Riot nicht unverh&auml;ltnism&auml;&szlig;ig viel Aufwand bedeutet?\nLg","replies":[{"poster":"Pure Cynicism","date":"2018-05-06T05:40:05.028+0000","up_votes":3,"down_votes":0,"body":"Gerade wenn man einen aggressiven, gankanfälligen Toplaner spielt, der die Lane dominieren will (zB Quinn) und dann vom gegnerischen Jungler gecampt wird, kann das sehr frustrierend sein. Du weißt, ihr würdet das 2-2 gewinnen, du weißt, du musst aggressiv spielen damit du nicht nutzlos wirst und dann musst du ständig 1-2 kämpfen. Dass das keinen Spaß macht, ist klar.\n\nWenn der eigene Jungler aber dafür Drakes holt und die Bot campt, dann kommen die meisten Toplaner damit noch gut klar. Nur wenn plötzlich der gegnerische Supporter den Drake stealt und der gegnerische Adc einen Triple Kill holt, während man selbst oben gedived wird, habe zumindest ich auch keine Lust mehr. Und in der SoloQ kommt das oft vor. Es ist selten, dass eine verlierende Lane durch eine gewinnende ausgeglichen wird.","replies":[{"poster":"Nohgolgh","date":"2018-05-06T08:42:12.117+0000","up_votes":1,"down_votes":0,"body":"Kann dem nur zustimmen. Mein persönlicher Eindruck ist sogar genau der umgekehrte, nämlich dass von allen Lanes der Toplaner overall am wenigsten titlet. Solche Tiltmomente erlebe ich persönlich viel viel häufiger bei der Botlane-gerade adc, die alleine eine Sidelane auspushen ansatt einen Teamfight mit einem soliden Top- und Midlaner zu bestreiten, dann gecatcht werden und sterben, nur um nach dem Wiederbeleben die Sidelane nochmal auszupushen, sind keine Seltenheit. Das Szenario, in dem Toplaner tilten, ist dasjenige, dass sie gecampt werden, und die anderen Lanes totzdem nicht laufen und der eigene Jungler keinen Lead hat. Und es sind nicht nur die agressiven Toplaner, die dann ein Problem bekommen. Du bist als Tank so nutzlos, wenn deine Botlane sich denkt, es ist okay, 0/5 zu gehen. Und auch Splitpusher bekommen Probleme, wenn der Gegner drei Leute senden kann und niemand das punishen kann. ","replies":[{"poster":"Snu Snu Waifu","date":"2018-05-06T09:23:43.673+0000","up_votes":1,"down_votes":0,"body":"Ja, der Toplaner war nur ein X-beliebiges Beispiel. Kann natürlich auf jeder Lane passieren, auf der Botlane ist es vlt am schlimmsten, weil einer da den zweiten mitreißt.","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2018-05-06T09:29:00.108+0000","up_votes":1,"down_votes":0,"body":"Man muss da differieren. Wenn ich zB als ADC sehe, dass die Leute zwar Solo Kills abstauben, aber ihre Lane Gegner dann free roamen können und zum zweiten oder gar dritten mal mit 4-5 Mann auf der Botlane sind, dann weiß ich, dass das Spiel verloren ist. Und zwar weiß ich dass, weil mein Team keine Ahnung hat, sie man League spielt und aufgrund von unterlegenem Makroplay nicht gewinnen werden. \nWenn mein Jungler zB Toplane campt, obwohl wir ein winning Matchup Bot+Infernal Drake haben und dann sowohl Tower FB, als auch Drake verlieren, weil der gegnerische Jungler das Spiel verstanden hat, weiß ich auch schon Minute 10, dass es vorbei ist.","replies":[{"poster":"Waldschrat86","date":"2018-05-06T09:59:20.164+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=KYnfKGf0,discussion-id=YHxtWBXA,comment-id=0002,timestamp=2018-05-06T09:29:00.108+0000)\n>\n> Man muss da differieren. Wenn ich zB als ADC sehe, dass die Leute zwar Solo Kills abstauben, aber ihre Lane Gegner dann free roamen können und zum zweiten oder gar dritten mal mit 4-5 Mann auf der Botlane sind, dann weiß ich, dass das Spiel verloren ist. Und zwar weiß ich dass, weil mein Team keine Ahnung hat, sie man League spielt und aufgrund von unterlegenem Makroplay nicht gewinnen werden. \n> Wenn mein Jungler zB Toplane campt, obwohl wir ein winning Matchup Bot+Infernal Drake haben und dann sowohl Tower FB, als auch Drake verlieren, weil der gegnerische Jungler das Spiel verstanden hat, weiß ich auch schon Minute 10, dass es vorbei ist.\n\nBist genau der Typ, den der TE meint.\n\nDie machen n Play bzw. ne bessere Entscheidung, dann noch in low Elo, wo echt fast alles geht, dazu noch im early, aber Herr Uranbrennstab weiß natürlich, dass das Game verloren ist.","replies":[{"poster":"clair de lune289","date":"2018-05-06T10:11:13.146+0000","up_votes":1,"down_votes":0,"body":"das lustige an \"low elo\" ( nein ich bin in keiner hohen Elo ich schließe mich in dieser Aussage mit ein) ist doch das es die absurdesten throws gibt vor allem dann wen der eine strake Spieler im gegnerischem Team langsam übermütig wird,dabei gekillt wird und sich das Team dann im Chat selbst den Gnadenstoß gibt.\n\nich finde Flame selbstverständlich nicht gut und das Spiel wäre besser dran ohne toxisches Verhalten,da es toxisches Verhalten aber gibt und man nicht direkt in dem Spiel etwas dagegen machen kann, ist es nicht verkehrt seinen Spaß daran zu haben.\nwichtig dabei ist,das man selbst **nicht** mit macht und man den anderen nicht an den Kopf wirft wie unterhaltsam das ganze doch sein kann.","replies":[{"poster":"Waldschrat86","date":"2018-05-06T11:34:15.254+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=YHxtWBXA,comment-id=000200000000,timestamp=2018-05-06T10:11:13.146+0000)\n>\n> das lustige an &quot;low elo&quot; ( nein ich bin in keiner hohen Elo ich schließe mich in dieser Aussage mit ein) ist doch das es die absurdesten throws gibt vor allem dann wen der eine strake Spieler im gegnerischem Team langsam übermütig wird,dabei gekillt wird und sich das Team dann im Chat selbst den Gnadenstoß gibt.\n> \n> ich finde Flame selbstverständlich nicht gut und das Spiel wäre besser dran ohne toxisches Verhalten,da es toxisches Verhalten aber gibt und man nicht direkt in dem Spiel etwas dagegen machen kann, ist es nicht verkehrt seinen Spaß daran zu haben.\n> wichtig dabei ist,das man selbst **nicht** mit macht und man den anderen nicht an den Kopf wirft wie unterhaltsam das ganze doch sein kann.\n\nJop, ist halt nur mega nervig und da hab ich dann wirklich wenig Spaß noch, zumindest, wenn ich solo unterwegs bin, wenn es passabel läuft, dann so ein Szenario passiert und ein Silber/Gold Spiel absichtlich weggeworfen wird, eil ein \"Pro\" wieder meint da sei ein Game durch sowas gelaufen, weil es das in der Highelo auch so ist.\n\nDas Beste war mal vor Ewigkeiten, alle Lanes gewinnen bis auf Top, Top pusht aber auch stets wie blöde, lässt sich baiten, wardet nicht und blamet den Jungler, droht mit AfK, wenn kein Gank kommt, Jungler ist grad am Drachen, holt den auch, sagt er geht Base und kommt dann, Top stirbt zum 3. MAL-RQ. Stand Minute 10: 12 : 3 + Drache für uns und alle Lanes bis auf Top weit im Farm ahead. Ende vom Lied nach 50Min. Lose^^\n\nOder vor kurzem eines, da hätte es nur einen Group gebracht, um zu gewinnen, war ab Midgame sehr einseitig. Wir haben es dann aber tatsächlich 30 Min. nicht hinbekommen, dann waren die auch Fullbuild, hatten bessere Scales und haben's halt hinbekommen und schlussendlich gewonnen. Das Game war aber insgesamt sehr lustig^^","replies":[{"poster":"Uranbrennstab","date":"2018-05-06T21:04:10.504+0000","up_votes":1,"down_votes":0,"body":"Es ist schön für dich, wenn du Spaß am Spiel hast, für mich sind Niederlagen allerdings verschwendete Lebenszeit und das nehme ich sehr ernst.","replies":[{"poster":"Sirrkas","date":"2018-05-07T10:43:45.939+0000","up_votes":1,"down_votes":0,"body":"Wenn Niederlagen für dich immer verschwendete Lebenszeit sind, empfehle ich Spiele, bei denen man öfter gewinnt als im Schnitt zu 50 %.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T10:58:40.837+0000","up_votes":1,"down_votes":0,"body":"Oder man gewinnt einfach öfters. ¯\\_(ツ)_/¯\n\nLoL ist ziemlich einfach, die Mitspieler machen es nur unnötig schwer, weil sie nicht bereit sind nachzudenken oder zu lernen. Sollte eigentlich auch Bannwürdig sein, aber naja. Man kann nicht alles haben.","replies":[{"poster":"Sirrkas","date":"2018-05-07T11:15:34.757+0000","up_votes":1,"down_votes":0,"body":"Egal wie gut oder schlecht sie sind, durch das Matchmaking wird so gut wie jeder Spieler irgendwann bei etwa 50 % Winrate landen. Wenn man immer gewinnen will, ist PvP keine gute Wahl, zumindest, solange da ein funktionierendes Matchmaking gegeben ist, dass die Stärke der Spieler in Betracht zieht.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T11:54:50.482+0000","up_votes":1,"down_votes":0,"body":"Sollte dann nicht gerade PvP die beste Wahl sein?  Immerhin gibt es wenig direktere Wege mich mich anderen zu messen. Und nur dort ist ein Sieg auch befriedigend.","replies":[{"poster":"Sirrkas","date":"2018-05-07T12:21:24.979+0000","up_votes":2,"down_votes":0,"body":"Das hängt davon ab, was du jetzt willst. Willst du unbedingt gewinnen, etwas das bei PvP nicht gegeben ist, ist es schlecht. Willst du sehen, wie gut du im vergleich zu anderen bist, macht PvP mehr Sinn. Beides zusammen kann man aber nicht erfüllen, zumindest nicht, wenn man nicht immer nur gegen deutlich schwächere Spieler antreten will. Und das ist in LoL durch das Matchmaking nicht so einfach, außer du spielst jetzt nur noch Customs, gegen schwächere.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T12:33:25.803+0000","up_votes":1,"down_votes":0,"body":"Wieso, man kann doch immer unbedingt gewinnen wollen und es gleichzeitig nicht schaffen. Daran liegt doch der Reiz oder nicht?","replies":[{"poster":"Sirrkas","date":"2018-05-07T12:34:29.265+0000","up_votes":2,"down_votes":0,"body":"Wenn es aber soweit geht, dass jede Niederlage verschwendete Lebenszeit ist, klingt das nicht gerade so, als ob PvP sinnvoll wäre, da man bei solchen Spielen die Hälfte der Spiele eben verlieren wird.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T12:36:35.583+0000","up_votes":1,"down_votes":0,"body":"Fairerweise habe ich auch nicht behauptet, daß League mir oft Spaß macht. Naja, Gold V heißt das Ziel, dann kann ich aufhören.","replies":[{"poster":"Sirrkas","date":"2018-05-07T12:53:38.167+0000","up_votes":2,"down_votes":0,"body":"Dann viel Erfolg.","replies":[]}]}]}]}]}]}]},{"poster":"Waldschrat86","date":"2018-05-07T11:42:33.643+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=KYnfKGf0,discussion-id=YHxtWBXA,comment-id=0002000000000000000000000000,timestamp=2018-05-07T10:58:40.837+0000)\n>\n> Oder man gewinnt einfach öfters. ¯\\_(ツ)_/¯\n> \n> LoL ist ziemlich einfach, die Mitspieler machen es nur unnötig schwer, weil sie nicht bereit sind nachzudenken oder zu lernen. Sollte eigentlich auch Bannwürdig sein, aber naja. Man kann nicht alles haben.\n\nTja es ist so einfach wie es einem die Gegner machen. Stimmt schon über Makro kann man easy selbst total behind gewinnen.\nDennoch unterliegt auch das Gegnerteam dem Matchmaking. LoL ist immer noch PvP und nicht PvE.\n\nNoch garniert mit nem Wunsch nach nem Banngrund, der, würde er existieren, deinen Account schon auf dem Gewissen hätte.\nS4-Silber S5-Silber S6-Silber S7- Gold S8- gerade SilberII mit 50% WR...\n\nUnnötig schwer machen es einem gerade in Silber eigentlich nur die Leute, die Platin+erwarten, aber selbst eben der Elo-entsprechend spielen und dann diese \"its lost\" \"idc\" Attitüde, um die's hier geht, an den Tag legen.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T12:09:33.692+0000","up_votes":1,"down_votes":0,"body":"Gerade ich bin ein absolutes Positiv Beispiel für Lernbereitschaft. Ich war auch in S6 Gold und in S7. Denn ich habe gelernt. Gelernt wie man ADC spielt. Ich habe gelernt zu kiten, ich habe gelernt, wieso man welches Item baut und wieso man welche Masterie benutzt. Ich bin im Makro Bereich auch nicht gerade schlecht. Aber das Micro...  Tja das sind so Dinge die lernt man nicht. Reflexe zum Beispiel, Maussicherheit usw. Und Anfang des 5. Monats vorzuwerfen man wäre nicht Gold ist... Vorschnell. \n\nZumal ich tatsächlich öfters durch alliierte Makrofehler verliere, denn durch eigene Micro Fehler. Wobei man natürlich argumentieren könnte, dass einige Situationen mit besserem Micro hätten gewonnen werden können. Aber naja, wenn das Wörtchen wenn nicht wär.","replies":[]}]},{"poster":"eingew","date":"2018-05-07T11:28:33.862+0000","up_votes":1,"down_votes":0,"body":"Tust du aber ja nicht. Du hast diese Season bisher exakt 50/50 gespielt. Und dasselbe gilt eben für alle Spieler. Nur die wenigsten werden es nach 100 Spielen schaffen überhaupt über die 55% WR hinaus zu gehen und auch das wird sich recht bald einrenken. So funktioniert das System eben.","replies":[{"poster":"Uranbrennstab","date":"2018-05-07T11:55:21.217+0000","up_votes":1,"down_votes":0,"body":"Richtig, tue ich nicht. Aus den genannten Gründen beispielsweise.","replies":[]}]}]}]}]}]},{"poster":"Uranbrennstab","date":"2018-05-06T21:02:54.872+0000","up_votes":1,"down_votes":0,"body":"Klar kann das passieren, aber die Wahrscheinlichkeit ist mir zu gering, um darauf mein Spiel aufzubauen. Wenn mein Team kein Makro beherrscht, verliert es eben, so hat das zu sein und so ist es zum Glück auch oft.","replies":[]}]},{"poster":"Uranbrennstab","date":"2018-05-06T21:01:54.760+0000","up_votes":1,"down_votes":0,"body":"Nein, weil ich einfach normal weiter Spiele und lediglich die Aufgabe Funktion nutze. Ich verlasse mich nunmal nicht auf Glück.","replies":[]}]}]},{"poster":"eingew","date":"2018-05-06T05:33:06.284+0000","up_votes":1,"down_votes":0,"body":"Das ist ja irgendwo auch eine ethische Frage, nicht bloß eine technische. Also bei den Chatnachrichten würde ich dir zustimmen, dafür sollte der Spieler bestraft werden, im Prinzip ist das direkte Sabotage an der Moral des Teams.\n\nAber schlechte Spielentscheidungen treffen? Ab einer gewissen Elo kann man das bestimmt irgendwo sagen. Jemand der auf Dia beispielsweise nicht rechtzeitig groupt, der wüsste es garantiert besser. Jemand der auf Bronze nicht groupt hat dagegen vermutlich einfach eine richtig schlechte Mapawareness. Jetzt ist die Frage, wo man da die Grenze zieht. Sollten Goldspieler bereits die Mapawareness dafür haben oder ist das erst ab Platin der Fall? Kann man das dann für jeden Spieler dort mit Sicherheit sagen? Bei Gold zB wäre ich mir da gar nicht einmal so sicher, jedenfalls in niedrigem Gold.\n\nVorhin habe ich zum Beispiel mit einem Mundo im Jungle gespielt. Er hat richtig schön scheiße gebaut, erst reingefeedet und war später bei TFs nicht mehr anwesend. Das hat uns nicht einmal das Spiel gekostet, das lag eher daran, dass ich selbst noch häufiger gestorben bin und mich häufig habe catchen lassen. Das Ding ist: Der Spieler passt eher auf deine Beschreibung und auch meine Mitspieler sahen das so, jedenfalls wurde im Chat danach gefragt, ihn zu reporten. Bei mir wurde dagegen lediglich bemängelt, dass ich zu selten den ADC shielde. Die Frage ist jetzt: Hat der Mundo zB diesen Report denn verdient? Möglicherweise hätten wir den Teamfight mit ihm tatsächlich gewonnen, es war jedenfalls verdammt knapp und er hätte den entscheidenden Faktor ausmachen können. Andererseits waren wir bereits dabei zu verlieren und wie gesagt würde ich die Scheiße, die ich gebaut habe, als deutlich größer ansehen.\nWäre es also dann bereits sinnvoll, ihn zu bestrafen? Oder war es vielleicht eher so, dass wir gerade mit einem Midlaner wie Ziggs nicht besser in die Defensive gegangen wären und einfach den Tower hätten deffen sollen, statt trotzdem wir behind waren irgendeinen Firlefanz zu veranstalten? Damit hätte die Botlane, auf der Mundo zum Zeitpunkt des Teamfights war, eventuell sogar bis zum Tower durchgepusht. Ich weiß ehrlich gesagt nicht, ob ich das so eine große Fehlentscheidung finde, die der Mundo da gemacht hat.\n\nUnd dieselbe Schwierigkeit hast du halt ganz allgemein bei diesen Dingen. Ist das reiner Tilt, der die Spieler zum Splitpushen bringt? Ich als Support kann das ja sowieso nicht machen. Aber in meinen Spielen ist es meistens so, dass so ein Tilt entsteht, wenn wir bereits einige TFs verloren und uns festgefahren haben. Macht es dann nicht irgendwo Sinn aus der alten Strategie auszubrechen und den Inhibitor bloß zu viert verteidigen zu lassen, während einer der Spieler auf einer Seitenlane für Abwechslung sorgt und eventuell sogar die Aufmerksamkeit von zwei anderen Spielern auf sich zieht? Wäre jedenfalls nicht mein erstes Spiel, bei dem wir so wenigstens einen Inhib oder im Extremfall sogar den Sieg bekommen haben.\n\nAber, um nochmal zu den Chatnachrichten zurückzukommen: Ich denke wenn beides kombiniert wird, keine Anwesenheit und die Verbreitung negativer Stimmung, dann können wir darauf schließen, dass der Spieler nur aus Frust nicht an den TFs teilnimmt und nicht, weil er eine Guerilla-Taktik versucht.","replies":[{"poster":"Snu Snu Waifu","date":"2018-05-06T06:26:34.092+0000","up_votes":1,"down_votes":0,"body":"Ja, nur um das nochmal klarzustellen:\nMir ist völlig klar, dass Leute schlechte Spiele haben, dass das Spielverständnis in Gold/Silber etc. generell niedriger ist, und dass auch gute Spieler, mal dumm splitpushen oder einzelne schlechte Entscheidungen treffen. Um solche Fälle geht es mir nicht.\nIch habe auch kein Problem mit jemandem, der seine Lane verliert, aber ansonsten produktiv mitspielt, evtl sogar \"sry, having a bad game\" o.ä. schreibt. Das sind Loses mit denen ich gut leben kann. \nGefühlt beginnt aber jeder zweite Lose in der SoloQ, mit einem Spieler, der ein schlechtes Spiel erwischt und nach 10 Minuten entscheidet, dass er sich nicht mehr anstrengen will, nach surrender ruft und unproduktiven Unfug treibt.\nUm das hier nochmal anzumerken: Auch die Spieler, die einen schlecht stehenden Spieler im Chat mit Beleidigungen angehen, bzw. erst zu schlechtem Verhalten provozieren gehören selbstverständlich bestraft.\nOft sieht man auch die ganz typischen Rengar/Yasuo/Riven/Zed Mains, die in ihrer Match History entweder Spiele haben in denen sie 10-0, oder 0-10  stehen. Läuft das Early nicht gut, ja mei dann war halt etzad der Jungler nen Hater und hat nicht genug Brügl nausgschmaßt. \nGespielt wird trotzdem, als stünde man 3-0 und nicht 0-3. Darauf angesprochen kommt ein \"idc for this game no more\".\nUnd solche Spieler sind für mich leider nicht die Ausnahme. Ich sehe kaum Trolle, Inter, Master-Smurfs oder über was hier im Forum sonst noch viel genörgelt wird. Auch harte Flamer, die einem den Tod wünschen, o.ä. krasse Dinge schreiben, sehe ich verhältnismäßig selten.\nAber diese Spieler, denen ihre persönliche Lane/Rolle/whatever nach 10 min keinen Spaß mehr macht, weil sie schlecht stehen und die dann anfangen Surrendervotes im 3 min Takt zu spammen und absichtlich nicht produktiv weiterspielen, sehe ich mindestens in 1 von 5 Spielen, eher häufiger.\n\nAuch immer dieser self-fullfilling prophecy-Effekt: Spiel steht 7-9, aber ein Mitspieler steht 0-3-0 und schreibt \"This is over, ff 15 pls\". Spammt dann im 3 min Takt surrender votes, spielt unmotiviert schlecht weiter und nach 30 Minuten geht das Spiel verloren. Diese Leute sagen dann nicht \"sry, i had a bad game\" sondern noch \"Told you this was lost, waste of time...\". Sehen den Lose also noch als Bestätigung, wie toll sie das Spiel eingeschätzt haben, ihr eigenes Verhalten war sicher nicht verantwortlich.\n\nWas für Schlüsse soll ich also daraus ziehen? \nGibt mehrere Möglichkeiten: \n1. Das Report System erkennt dieses Verhalten nicht.\n2. Das Report System erkennt dieses Verhalten, aber es dauert zu lange bis dieses Verhalten bestraft wird.\n3. Das Report System erkennt dieses Verhalten, aber die Strafen sind zu lasch.\n\nMir ist schon klar, dass dieses Problem technisch extrem schwer zu lösen ist, aber evtl. täte eine Bannwelle der Community mal wieder gut.\nD.h. dass Riot eben über den Zeitraum von mehreren Wochen einige Tausend Fälle von Spielern überprüft, die oft für \"negative Attitude\" reportet wurden, und dann die berechtigten Fälle mal eine Woche, von mir aus auch 2 Wochen sperrt. Wäre so die einzige Handhabe, die mir mit vertretbarem Aufwand machbar erscheint. Das schreckt dann möglicherweise andere Spieler ab. \n\nWie gesagt, die Diskrepanz dazwischen, wie schnell schlechtes Verhalten im Chat geahndet wird (das funktioniert ziemlich gut mittlerweile) und wie schnell schlechtes Verhalten im Spiel bestraft wird kommt mir deutlich zu groß vor.","replies":[{"poster":"eingew","date":"2018-05-06T08:16:20.448+0000","up_votes":2,"down_votes":0,"body":"Sehe das denke ich so wie du größtenteils.\n\n> [{quoted}](name=Snu Snu Waifu,realm=EUW,application-id=KYnfKGf0,discussion-id=YHxtWBXA,comment-id=00000000,timestamp=2018-05-06T06:26:34.092+0000)\n>\n> Oft sieht man auch die ganz typischen Rengar/Yasuo/Riven/Zed Mains, die in ihrer Match History entweder Spiele haben in denen sie 10-0, oder 0-10 stehen.[...]\n> Und solche Spieler sind für mich leider nicht die Ausnahme. Ich sehe kaum Trolle, Inter, Master-Smurfs oder über was hier im Forum sonst noch viel genörgelt wird. Auch harte Flamer, die einem den Tod wünschen, o.ä. krasse Dinge schreiben, sehe ich verhältnismäßig selten.\n\nIch denke mal man kann das vorzeitige Aufgeben und nicht mehr auf Sieg spielen schon auch als Trollen bezeichnen. Im Prinzip fällt absichtliches Feeden und sich absichtlich nicht mehr am eigentlichen Spielgeschehen beteiligen in dieselbe Verhaltenskategorie. Es ist beides Sabotage.\n\n> Was für Schlüsse soll ich also daraus ziehen? \n> Gibt mehrere Möglichkeiten: \n> 1. Das Report System erkennt dieses Verhalten nicht.\n> 2. Das Report System erkennt dieses Verhalten, aber es dauert zu lange bis dieses Verhalten bestraft wird.\n> 3. Das Report System erkennt dieses Verhalten, aber die Strafen sind zu lasch.\n\nHier würde ich erstens nehmen, da die Überprüfung nach jedem Report ausgelöst wird und sehr schnell geht (bei Flame maximal 15 Minuten, fürs Trollen/ absichtliches Feeden gibts afaik keine genaue Zeitangabe, dürfte sich aber in ähnlichen Zeiteinheiten bewegen). Die Strafen fürs Trollen sind als erstes ein zweiwöchiger Ban und beim nächsten Vergehen der permanente Ban. Mit diesem Vorgehen bin ich auch sehr zufrieden. Das große Problem ist eben, wie du bereits gesagt hast, die Erkennung von absichtlichen Feedern an sich und nochmal um einiges schwieriger ist es ja dann, zu erkennen, ob ein Spieler sich noch aktiv an strategisch sinnvollen/relevanten Taktiken beteiligt oder ob seine Strategie mittlerweile nicht mehr das erzielen eines Sieges sondern das möglichst schnelle Beenden des Spiels ist.\n\n> Wie gesagt, die Diskrepanz dazwischen, wie schnell schlechtes Verhalten im Chat geahndet wird (das funktioniert ziemlich gut mittlerweile) und wie schnell schlechtes Verhalten im Spiel bestraft wird kommt mir deutlich zu groß vor.\n\nVor allem dem hier würde ich zustimmen. Es wäre schön, wenn Riot jetzt auf diesem Feld so gut nachlegen würde, wie sie es bei Flame getan haben.","replies":[]}]}]},{"poster":"Bärenmarder","date":"2018-05-06T11:39:41.718+0000","up_votes":3,"down_votes":2,"body":"Wieso sollte man das bestrafen, ca 90% der spielerschaft legt dieses verhalten an den tag. Ich denke die meisten Leute resignieren einfach in diesem Spiel, weil man selbst nur mit resignierten Leuten zusammenspielen muss und am Ende ist jeder resigniert. Das größte Problem ist das Matchmaking, sprich die Smurf Accounts von irgendwelchen High elo spielern, die normalen Leuten den Spaß verderben. Natürlich wird man da gefrustet und das äußert sich dann irgendwann. Ich denke man sollte dort ansetzen und nicht versuchen die halbe lol spielerschaft zu bannen.","replies":[{"poster":"Snu Snu Waifu","date":"2018-05-06T12:08:14.017+0000","up_votes":3,"down_votes":1,"body":"Das mit diesen \"Smurf Accounts\" die den ganzen Low-Elo Spielern den Spaß kaputtmachen ist die größte Urban Legend die es in League of Legends gibt. \nCa. 2% aller Spieler sind Dia 5 aufwärts, also überhaupt in irgendeinem Bereich von dem es Sinn machen würde mit einem Smurf im Low Elo zu trollen. Von diesen 2% hat vielleicht jeder zehnte einen Smurf mit dem er ab und zu in Gold Elo oder niedriger spielt.\nIch habe um die 5 Freunde die ebenfalls Dia sind wie ich und von denen smurft kein einziger, ich auch nicht.\nWir reden hier also von vielleicht 0,2% Smurfs, das wäre einer in jedem 50sten \"Low-Elo\"-Spiel. Und das auch nur wenn man unterstellt, dass diese Smurf-Accounts regelmäßig bespielt werden, was ebenfalls sicher nicht der Fall ist.\nDieses Smurfgeweine, weil Gegner XY ein gutes Spiel hat, gefeedet ist und einen weg killt, ist lächerlich.","replies":[{"poster":"Bärenmarder","date":"2018-05-06T12:14:48.216+0000","up_votes":2,"down_votes":2,"body":"Was du da behauptest ist wohl eher die Legende.","replies":[{"poster":"Bärenmarder","date":"2018-05-06T12:18:28.794+0000","up_votes":2,"down_votes":3,"body":"Es sind eben genau solche Leute wie du, die mit ihren Smurfs im low elo bereich rumgeiern und dann im forum heulen, dass es doch garnicht stimmt. Schon stark dann hier eine Diskussion anzufangen, obwohl man selbst Ursache allen Übels ist.","replies":[{"poster":"Snu Snu Waifu","date":"2018-05-06T12:25:46.182+0000","up_votes":2,"down_votes":1,"body":"*Seufz*","replies":[{"poster":"Bärenmarder","date":"2018-05-06T12:39:28.582+0000","up_votes":2,"down_votes":3,"body":"Genau, dann hast noch diese Oberschlauen super elo spieler die alles besser wissen und dann toxic werden und so das spiel verloren geht.","replies":[{"poster":"Snu Snu Waifu","date":"2018-05-06T12:43:29.302+0000","up_votes":1,"down_votes":1,"body":"Ich hoffe für dich, dass du noch prä-pubertär bist, dann wächst du vlt. noch aus diesem Verhalten und eventuell sogar aus der \"Elo-Hell\" wo die ganzen bösen Smurfs dich pisacken raus...","replies":[{"poster":"Bärenmarder","date":"2018-05-06T13:15:59.445+0000","up_votes":2,"down_votes":3,"body":"Ich kann deine Reaktion sogar verstehen. Ich würde an deiner Stelle, als jemand der von diesem System profitiert, auch nicht wollen, dass man diesen Sumpf ausstrocknet. Wäre ja schön blöd.","replies":[]}]}]}]}]},{"poster":"Snu Snu Waifu","date":"2018-05-06T12:23:34.903+0000","up_votes":1,"down_votes":1,"body":"Aha.\nIch hab ein Argument und eine meiner Meinung nach relativ akkurate Rechnung vorgelegt. Die genaue Anzahl der Smurf Accs von High-Elo Spielern weiß ich natürlich nicht, weil ich keinen Zugriff auf Riots Datenbank habe. \nDu darfst mir jetzt gerne vorrechnen, bzw. erklären wie es mathematisch überhaupt funktionieren soll, dass ganz viele Low-Elo Spiele von Smurf-Accounts zerstört werden.","replies":[{"poster":"Bärenmarder","date":"2018-05-06T12:26:08.936+0000","up_votes":2,"down_votes":2,"body":"Traue keiner Statistik, die du nicht selber gefälscht hast. Absoluter Unfug hier irgendwelche Rechnungen zu erfinden, jedes Game haste irgendsolche leute mit \"xSmurfx\" oder \"IIIllllIII\" im gegnerteam. laber mal nicht. Allein die ganzen Seiten, die Acc Boosting anbieten, das sind unzählige.","replies":[]}]}]}]}]},{"poster":"IKartoffelI","date":"2018-05-07T06:14:16.196+0000","up_votes":1,"down_votes":0,"body":"Ich hatte erst lettens genau das Problem:\nUnser Midlaner pickt Karthus in Fizz (nicht die beste Idee :D) und wird von Minute 1 an von Lee gecampt.\nIch konnte Fizz einmal mit ihm töten, aber das hat kaum was geändert. Auf meine Bitte hin passiv zu spielen und zu warden (Visionscore von 2 nach ca 15 min) kam nur ein no idc und er rennt ins Gegnerteam.\nSowas nervt echt, das es nicht so schwer ist ein solches Game zu drehen.","replies":[]},{"poster":"OrangeBubble","date":"2018-05-06T14:06:37.978+0000","up_votes":1,"down_votes":0,"body":"Ich hatte es auch schon, dass ich als ADC extrem behind war (und mad) und die ganze Zeit auf der Sidelane gefarmt und gepusht haben. Ich habe dadurch teilweise bis zum Inhib durchgepusht und so auch Gold für das Team und mich generiert. Ich hielt es zu dem Zeitpunkt für meine beste Option. Und obwohl wir das Spiel gewonnen! haben wurde ich als Troll abgestempelt, denn ich bin net zum TF gegangen. Ich bin mir ziemlich sicher, wäre ich zum TF gegangen, hätten wir verloren, weil ich behind geblieben wäre...","replies":[]},{"poster":"need elo police","date":"2018-05-06T09:47:25.810+0000","up_votes":1,"down_votes":0,"body":"Du hast Recht, aber daran kann man schlecht etwas ändern, da man die Spieler nie wieder sieht, außer im höheren Elo Bereich. Viele wollen dominieren, ihren Gegner zerstören, wollen der Carry sein. Und wenn das nicht funktioniert geben sie halt auf ... es ist aber ein TEAMSPIEL, und am Ende zählt nur der Sieg oder die Niederlage, wenn man das nicht verstanden hat ist es sowieso zu spät.\n\nIch verstehe die Ego Spieler einfach nicht, während du deine Lane verlierst hat vielleicht der Jungler den anderen Lanes geholfen, Drake geholt etc. ... mit dieser negativen Einstellung zerstört du mehr als wenn du deinen Gegner 2 Freekills gibst. Denn die Einstellung des Teams ist sehr wichtig, und wenn man lesen muss dass jemand aufgegeben hat, WIRD es NICHT die Siegeschance erhöhen.\n\nViele wissen nicht und unterschätzen es wie viel man zerstört wenn man etwas negatives in den Chat schreibt.","replies":[]},{"poster":"three stodges","date":"2018-05-06T10:58:32.593+0000","up_votes":1,"down_votes":1,"body":"Das ganze geschreibsel hier ist völlig umsonst :)","replies":[]}]}