{"poster":"Corazza Spinata","date":"2019-05-22T16:18:03.346+0000","title":"statistiche rune a fine partita","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Tutte le statistiche delle rune scrivono tutto, aery scrive i danni e gli scudi, le altre i danni e quello che fanno. Perché scossa di assestamento (una runa TANK) nelle stats scrive solo i DANNI? Perché non si fa vedere tutta la sua utilità (perché è a questo che servono le rune) e non scrivono quanto riduce come succede per corazza ossea?\r\nMagari si va a vedere che scossa di assestamento ha 10/15k di utilità in più delle altre, che in termini di gold equivale a circa 2 item, magari è utile.","replies":[{"poster":"Ringiel","date":"2019-05-22T16:59:47.682+0000","up_votes":1,"down_votes":1,"body":"che senso ha far vedere quanta armor ti ha dato durante tutta la partita?\n\n>e non scrivono quanto riduce come succede per corazza ossea?\n\ncorazza ossea riduce il danno di un ammontare fisso,aftershock no perchè ti da resistenze,come possono calcolare quanti danni hai mitigato?","replies":[{"poster":"Cry of the Celts","date":"2019-05-23T07:20:45.626+0000","up_votes":2,"down_votes":1,"body":"Ho 100 armatura che mi dà 10% di riduzione di danno fisico, con 1 attacco base da 100 attacco prendo 90 danni.\n\nSi attiva aftershock, ho 200 armatura che mi dà 20% di riduzione danno fisico, dallo stesso attacco base ora prendo 80 danni, danno mitigato = 10.\n\nPer la cronaca con celerità o velocità di avvicinamento (non ricordo bene), ti dice pure quanta distanza hai percorso in più grazie alla runa.","replies":[{"poster":"Ringiel","date":"2019-05-23T08:56:35.426+0000","up_votes":1,"down_votes":0,"body":"si ma funzionerebbe solo per l'early game,perchè appena montano arp/lethality non si riesce più a calcolare quanto danno è stato ridotto perchè ci sono troppe variabili,al contrario corazza ossea sai che mitiga 30-60;\n\n>Per la cronaca con celerità o velocità di avvicinamento (non ricordo bene), ti dice pure quanta distanza hai percorso in più grazie alla runa.\n\nl'ms è come fossero i km/h,quindi avendo X di ms è facile per il sistema calcolare quanto ci metti ad arrivare a Y","replies":[{"poster":"Corazza Spinata","date":"2019-05-23T12:49:33.486+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=cAOZwaUi,discussion-id=EO62mPGz,comment-id=000100000000,timestamp=2019-05-23T08:56:35.426+0000)\n>\n> si ma funzionerebbe solo per l'early game,perchè appena montano arp/lethality non si riesce più a calcolare quanto danno è stato ridotto perchè ci sono troppe variabili,al contrario corazza ossea sai che mitiga 30-60;\n> \n> l'ms è come fossero i km/h,quindi avendo X di ms è facile per il sistema calcolare quanto ci metti ad arrivare a Y\n\nquindi il gioco come li calcola i danni che ti arrivano?\nsono calcoli base per un computer e già stanno da qualche parte, devono solo recuperarli e inserirli nelle statistiche...","replies":[{"poster":"Ringiel","date":"2019-05-23T13:01:19.399+0000","up_votes":1,"down_votes":0,"body":"un conto è calcolare quanti danni prendi con 400 armor,un altro è calcolare quanti danni non hai preso grazie a 70 armor data dalla runa,sono due calcoli completamente differenti e non penso che il gioco lo faccia attualmente ... cmq mi puoi spiegare a che pro la tua proposta gioverebbe? una volta che sai che la runa ti da tot resistenze,che ti serve sapere quanti danni non hai subito?","replies":[]}]}]}]}]}]}