{"poster":"loeli","date":"2017-05-29T20:59:53.116+0000","title":"Perma Ban","subforum":"Spielerverhalten & Moderation","embed":{"description":"Live stream and record your content with ease & share it to streaming services like Twitch, YouTube, Facebook, Beam, etc. Start your broadcast today.","url":"https://www.xsplit.com/","image":"https://cdn4.xsplit.com/cms/XSplit.jpg"},"up_votes":2,"down_votes":6,"body":"Hallo Liebe Forums Mitglieder.\r\nJa, ich habe einen Permanenten Bann bekommen welchen ich aber nicht verstehe. Dies steht hier aber nicht direkt zu Disskusion.\r\nSondern ich habe ein Programm XSplit Gamecaster gefunden mit welchem ich direkt auf Youtube stramen kann.\r\n\r\nZur&uuml;ck zum Bann. Ich habe keine Skripts und keine Bot nur den Orginalen Riot Client.\r\nDie Frage ist ob auch jemand schon die Erfahrung mit XSplit Gamecaster gemacht hat und ob ich vielleicht deswegen gebannt wurde?\r\nDas w&auml;re die einzige Erkl&auml;rung dies war das einzige Programm welches ich einmal getestet habe beim Spielen.\r\n\r\nFalls euch klar ist XSplit Gamecaster ist nicht Erlaubt so helft mir bitte, ich weiss nicht was daran b&ouml;se Magie sein soll. \r\n\r\nIch hoffe komme mit dem Support noch ins Gespr&auml;ch und hoffe das Ihr mir da einen Einblick gew&auml;hren k&ouml;nnt :=)","replies":[{"poster":"Undy1ng","date":"2017-05-29T21:24:53.583+0000","up_votes":2,"down_votes":0,"body":"Bist du gebannt worden wegen unerlaubte Programm ect?   Oder wegen flamen...?  Steht ja dabei also schau mal nach.  \n\n\nAlso wenn du wegen Programme gesperrt wurdest,  dann musst du dir überlegen,  was hast du jemals installiert selbst wenn du es nicht mit lol in Verbindung siehst... Hat jemand anders die Möglichkeit dein Account zu nutzen, bzw hast du jemals mit einem anderen Computer gespielt? \n\n\nVersuche alle Möglichkeiten auszuschließen egal wie klein sie ist,  es ist wichtig \n\n\nUnd zu riot,  sie werden dir die Sache richtig schwer machen und sie werden dir nicht helfen,  die Möglichkeit dein Account wieder zu bekommen ist 1 Prozent nicht viel aber auch nicht 0,  stell dich darauf ein riot weiß genau was los ist,  hast du was falsches getan Absichtlich dann wirst du deinen acc nie wieder sehen,  hast du nichts gemacht bzw nicht wissentlich wird es schwer riot davon zu überzeugen,  denn sie gehen gegen solche Spieler sehr hart vor,  was auch richtig ist,  \n\n\nSolltest du nichts getan habe wünsche ich dir alles gut und drücke dir die Daumen  aber falls du was gemacht hast bin ich froh das wieder so ein möchtegern cheater von League weg ist","replies":[{"poster":"loeli","date":"2017-05-30T06:50:54.054+0000","up_votes":2,"down_votes":0,"body":"Ich wurde wegen Unerlaubten Programme gebannt, jedoch habe ich keine weiteren Programme als XSplit instaliert.\nDazu wüsste ich nicht wissentlich das ich Skripte oder so gebrauche. Ich habe jedenfalls keinen Spielvorteil bemerkt.\nDer Zoom ist auch normal.\n\nIch stehe bereits in Kontakt mit Riot und es ist eben sehr Schwer zu erklären das ich nichts gemacht habe.\nDazu geht es mir rauszufinden was das für ein Skript denn gewesen sein soll.\nAuch wenn ich neu Anfangen müsste würde es nicht lange gehen und ich wäre wider gebannt da ich genau gleich spiele wie immer.\n\nDanke für die Antwort","replies":[{"poster":"Eisteesüchtig","date":"2017-05-31T14:13:56.120+0000","up_votes":3,"down_votes":0,"body":"Unerlaubte Programme sind folgende:\n\nAutododge, Custom Skins (Champions und Maps), Jungletimer, alles was dir einen unfairen Vorteil gegenüber anderen gibt. Du kannst unmöglich wegen XSplit gebannt worden sein, da ich selber damit streame.","replies":[{"poster":"TheGratefulDead","date":"2017-06-01T04:37:47.891+0000","up_votes":1,"down_votes":0,"body":">Custom Skins (Champions und Maps)\n\nLmao, Custom Skins sind nicht verboten.","replies":[{"poster":"Coopa123","date":"2017-06-05T11:06:29.641+0000","up_votes":1,"down_votes":0,"body":"Grauzone.\n\nWenn du Custom Skins wie Pulsefire Ezreal oder DJ Sona installierst kannst du aber sowas von davon ausgehen, dass der Account gebannt wird","replies":[{"poster":"TheGratefulDead","date":"2017-06-10T10:37:52.451+0000","up_votes":2,"down_votes":0,"body":"Das ist auch was anderes. Der Grund ist nicht weil es Custom Skins sind, sondern weil es Riot um Geld prellt.","replies":[]}]}]},{"poster":"loeli","date":"2017-06-01T07:16:00.474+0000","up_votes":1,"down_votes":0,"body":"Danke dir das war das einzige Programm das ich gebraucht habe für LoL mal schauen ob ichs rausfinde","replies":[]}]}]}]},{"poster":"loeli","date":"2017-06-12T13:30:12.769+0000","up_votes":1,"down_votes":0,"body":"Der Fall wurde beendet leider mit schlechtem Resultat für mich. Ich werde den Permaban behalten und muss dies akzeptieren leider weiss ich nicht was passiert ist oder ob der Account gehackt wurde Auskunft bekam ich nicht. Finde ich schon ein bisschen Schwach das der Support mir nicht helfen kann wo ich denn gebannt wurde, respektive welcher Spielvorteil ich mir erschafft habe.\nIch habe 3 Tage zuvor RP gekauft und dann war der ACC weg hoffe Riot braucht die Euros um die Permabans mehr für sündigende Spieler einzusetzen und nicht solche welche nichts getan haben, ich weiss nicht was mit meinem ACC gemacht worden ist und durch wen aber ich habe nichts bewusst getan.","replies":[{"poster":"Balmung","date":"2017-06-13T11:34:30.250+0000","up_votes":2,"down_votes":0,"body":"Es mag unfair klingen, jedoch gilt immer folgendes: Ob du etwas bewusst oder unbewusst verbrichst ist irrelevant.\nEbenso ist es vollkommen egal wer auf deinem Account etwas verzapft. Banns sind account- und nicht personenbezogen, es liegt eben in deiner Verantwortung deinen Login sowie Passwort sicher zu verwahren.\nGehackt wurdest du nämlich mit Sicherheit nicht.","replies":[{"poster":"loeli","date":"2017-06-13T14:07:54.132+0000","up_votes":1,"down_votes":0,"body":"Irgendwie muss wer an meine Daten gekommen sein.\nIch habe meinen Account auch nicht geshared.\nGemacht habe ich auch nichts also muss ein Dritter die Programm verwendet/installiert haben.","replies":[{"poster":"Balmung","date":"2017-06-13T15:40:11.741+0000","up_votes":1,"down_votes":0,"body":"\"Irgendwie\" ist in 99.9% eigenes Verschulden durch unsicheren Umgang mit sensiblen Daten.\n\nZusätzlich müssten ja auch Spiele auf deinem Account stattgefunden haben, welche du nicht gespielt hast, ohne das du auf deinem Account etwas bemerkt hättest wie z.B. veränderte IP, LP oder die Matchhistory.","replies":[]}]}]}]},{"poster":"Wernicke","date":"2017-05-30T05:45:11.372+0000","up_votes":1,"down_votes":0,"body":"Mit den Drittanbieter Geschichten ist das immer so eine Sache, da viele unwissentlich Sachen benutzt haben, wenn auch nur indirekt und eben ohne Kenntnis, und im Forum natürlich beschwören sie würden nix nutzen.\nEs langt schon wenn du z.B. bei einem Kumepel aufn PC mit deinem Acc gespielt hast und dieser eben unerlaubte Programme nutzt, somit bist du dan quasi auch am Ar*** . \nOder du hast dir mal einen PC/Lapi geliehen, oder oder oder...\n\nFalls du den Support kontaktieren möchtest, müsstest du ein Ticket erstellen da du hier im deutschen Forum wohl niemanden erreichen wirst der dir diesbezüglich Auskunft geben könnte. ","replies":[{"poster":"loeli","date":"2017-05-30T08:52:36.090+0000","up_votes":1,"down_votes":0,"body":"Ich habe nur meine PC's gebraucht einen Laptop und einen Tower beide haben keine anderen Personen Zugriff drauf.","replies":[{"poster":"Abasin","date":"2017-05-30T10:35:41.005+0000","up_votes":2,"down_votes":0,"body":"Im Prinzip reicht es schon, wenn Du mal bei einem Kumpel gezockt hast. Wenn der irgendwelche verbotenen Programme benutzt, dann bist Du auch dran, selbst wenn Du nix dafür kannst. Ihn würde es aber genauso erwischen, nur als kleiner Trost.","replies":[]},{"poster":"Wernicke","date":"2017-05-30T09:31:42.906+0000","up_votes":1,"down_votes":0,"body":"Waren ja auch nur Beispiele. Was ich sagen wollte, war, dass es manchmal Sachen gibt die einem selbst gar nicht so bewusst sind und ma fest davon ausgeht man habe nix gemacht.","replies":[]}]}]},{"poster":"Alustus","date":"2017-05-29T22:23:39.448+0000","up_votes":2,"down_votes":0,"body":"Ich bezweifle das du wegen xSplit gebannt wurdest, da es eine gängige Software unter LoL Streamern ist und ich noch von keinem Bann diesbezüglich gehört habe.","replies":[{"poster":"loeli","date":"2017-05-30T06:52:05.100+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort das war so meine letzte Hoffnung das es an dem Programm liegt, denn ich habe nur das in der Vergangenheit installiert.\nMal schauen ob der Support mir sagen kann was ich denn für ein Programm verwendet haben soll.","replies":[{"poster":"CYPHΕR","date":"2017-05-30T07:34:37.775+0000","up_votes":2,"down_votes":0,"body":"Soweit ich weiß gibt der Support keine Auskunft darüber, welche Programme genau festgestellt wurden.\n\nBans wegen Drittanbieterprogrammen werden aber eigentlich nur ausgesprochen, wenn sich Riot extrem sicher ist. Die Nutzung der Programme kann dabei aber auch schon eine Weile zurück liegen.","replies":[{"poster":"loeli","date":"2017-05-30T08:51:37.335+0000","up_votes":1,"down_votes":0,"body":"Ich habe in meiner ganzen Zeit seit ich LoL Spiele nie einen Cheat oder dergleichen für LoL verwendet.\nEs muss ein Fehler im System sein nur der beweis wird schwer zu finden sein.\nAuch wenn es schon lange in der Vergangenheit liegt kann ich mir nicht vorstellen was das es sein soll.\nProblematik ist wenn LoL mir nicht sagt was falsch gelaufen ist, kann das anderen unschuldige/unwissende genau so treffen.\n\nVielleicht bin ich Schuld aber ich habe für LoL bis auf erwähnte Programm nichts gebraucht.\n\nHoffe das passiert niemand anderem.\n\nIch werde euch natürlich auf dem Laufenden halten.","replies":[]}]}]}]},{"poster":"eingew","date":"2017-05-30T06:11:33.314+0000","up_votes":2,"down_votes":0,"body":"Unter die Programme, für die man gebannt werden kann, fallen ausschließlich solche, die dir einen unfairen Vorteil gegenüber deinen Mitspielern verschaffen. Ein Programm welches dir ausschließlich ermöglicht, dein Spiel live zu streamen, fällt also eher nicht darunter. Etwas, was da eher drunter fallen würde, wäre zum Beispiel  ein Script oder ein Makro, was es dir ermöglicht mit nur wenigen Tastendrücken komplexe Spielabläufe nicht mehr selbstständig zu steuern, sondern automatisch ablaufen zu lassen. Wir hatten auch schon mal jemanden, der es irgendwie geschafft hat, dass er weiter raus zoomen konnte und somit deutlich mehr von der Map sah, ohne auf die Map selbst gucken zu müssen.","replies":[]},{"poster":"Glaums","date":"2017-06-29T14:37:36.448+0000","up_votes":2,"down_votes":1,"body":"Ich kann Deinen Ärger zum Teil gut verstehen. RIOT nutzt hier in meinen Augen seine Marktmacht aus, um sich vor der Verantwortung gegenüber den Nutzern zu stehlen. Transparenz ist in einer zweiseitigen Kommunikation für Respekt enorm wichtig. Es mag sein, dass diese Transparenz die Arbeit mit \"den Hackern\" schwieriger macht. Aber ein Unternehmen, dass einen solchen gewaltigen Umsatz macht wie Riot, kann es sich leisten, mehr in diesem Bereich zu investieren und dafür dem Kunden ein fairere Kommunikation zu bieten. Ich mache mir da keine Illusionen. Riot wird an dieser Sache nichts ändern. Dafür sind zu wenige davon betroffen und zu vielen ist es egal, so lange es sie nicht selber betrifft. Riot macht in vielen Aspekten auch einen sehr guten Job! So kann man nur hoffen nicht unter den Betroffenen zu sein.","replies":[]}]}