{"poster":"aIoneintokyo","date":"2019-11-07T09:53:17.955+0000","title":"Tilten & Inten","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"Hallo an alle,\r\n\r\nhabe mal eine kurze Frage.\r\n\r\nIch spiele im Diamond Bereich (jngl main) und climbe teilweise immer wieder hoch auf Dia 2 und sobald ich das erreicht habe droppe ich meistens wieder so schnell wie ich geclimbt bin.\r\n\r\nSo Tipps wie nach dem du 3 verloren hast solltest du aufhören zu spielen beachte ich gar nicht erst.\r\n\r\nSobald ich in einer Loosing Streak bin bleib ich da auch die nächsten 3-4 Tage.\r\nHabe es auch selten aus der Loosing Streak rausgeschafft - Sobald ich in der Loosing Streak bin ist eigentlich nichts anderes - meistens geh ich auch 3/0 nach Min. 8 raus.\r\n\r\nDas Problem ist sobald ich einer Lane einen Lead verschafft habe verkackt eine andere.\r\n\r\nAndernfalls wenn ich in einer Win Streak bin, gewinnt jede Lane und hat auch eine Ahnung wo der andere Jungler umgeht.\r\n\r\nEgal wie oft ich Pinge wo der andere Jungler umgeht es interessiert niemanden, was ich ziemlich schade finde da ich eigentlich immer weiß wo er ist, welches Camp von ihm up ist zum Counterjunglen / oder wo er eben umgeht zum Counterganken.\r\n\r\nWie gesagt Ich gewinne meistens das early, aber dann ist 1 Lane schon so fett das ein Gank schon mehr wie useless ist und sogar das Game komplett throwd.\r\n\r\nIch bin ein bisschen ausgeschweift aber bin ich der einzige mit diesem Problem?\r\n\r\nIch werde jetzt einfach wieder versuchen auf Dia 3 zu kommen und am Anfang der nächsten Season wieder höher zu climben da meine MMR ziemlich am Boden ist.\r\n\r\nlg","replies":[{"poster":"HookEmUp","date":"2019-11-07T10:24:44.216+0000","up_votes":2,"down_votes":2,"body":"Jo habe das gleiche Problem. Ich bin eigentlich unfehlbar und der beste Spieler der Welt. Aber Riot drückt mir ständig losing streaks und Vollpfosten. \n\nWäre LoL ein Solo Spiel, würden wir zwei uns wohl um Rank 1 streiten.\n\nIst es das, was du hören wolltest?","replies":[{"poster":"BarretuBf","date":"2019-11-13T10:18:35.522+0000","up_votes":1,"down_votes":1,"body":"Und du bist der Silver 2 Typ der hier streit sucht weil er seine Arams verloren hat und nicht mehr weiß wies weiter geht?\n\nKids.....","replies":[{"poster":"HookEmUp","date":"2019-11-13T10:38:51.078+0000","up_votes":1,"down_votes":0,"body":"Sag ich ja. Meine Mates sind doof. Ich bin eig. der beste Spieler der Welt. Hast du meine Antwort nicht begriffen, oder wieso das Unverständnis?  Mensch Junge, streng deine grauen Zellen mal etwas an..... Aber danke für das Interesse an meiner Person.:)\n\nPs: Ich habe Kids schon als Kids bezeichnet, da war selbst deine Oma nur ein geiler Gedanke. Das ist sowas von 80er.","replies":[{"poster":"BarretuBf","date":"2019-11-13T13:03:02.150+0000","up_votes":1,"down_votes":1,"body":"Wie nennt man das gleich? \n\nAnbei ein Zitat von Goethe für dich:\n\n\"Als Ironie wird ein rhetorisches Stilmittel bezeichnet, das in sämtlichen literarischen Gattungen, in der Rede sowie in der Umgangssprache verwendet wird. Die Ironie beschreibt, dass der Sprechende etwas ausdrückt, wobei er genau das Gegenteil des Ausgedrückten meint. Wesentlich ist allerdings, dass der Empfänger (Zuhörer, Leser, Zuschauer) oder zumindest ein bestimmtes Publikum erkennt, dass die Äußerung ironisch war und das Gegenteil meint. Die Figur ähnelt Sarkasmus, Spott und Zynismus.\"\n\nPS: Du bist ein wirklich cooler Typ wenn du deinen Ironischen Spruch leugnen musst nur dass du nicht als Täter dastehst. Das funktioniert vielleicht bei 12 jährigen mit denen du deine Diskussionen startest.\n\nMit Kids meinte ich deine geistige Person. Ich bin wsl. um einiges jünger wie du aber das macht nichts. Solange ich mich mit meiner Person und meiner geistigen Reife identifizieren kann stimmt alles.\n\nTrotzdem danke, dass du mir nochmal bestätigst, dass \"erwachsene\" Person eigl. nicht erwachsen sind.\n\nUnd btw. haha, meine Oma mit ins Spiel zu bringen die schon längst gestorben ist zeugt von der Reife eines 16 jährigen. Evt. 15.\n\nIch wünsche dir aufjedenfall noch viel Spaß in deinen Arams.\n\nlg","replies":[{"poster":"HookEmUp","date":"2019-11-14T21:24:35.912+0000","up_votes":1,"down_votes":0,"body":"> jünger wie du\n\nals*\n\nWenn du schon dabei bist Goethe zu zitieren.\n\n\t\"Ironie ist das Körnchen Salz, das das Aufgetischte überhaupt erst genießbar macht.\"\n\nDamit ist die \"Diskussion\" mit dir beendet.\n\n\n","replies":[{"poster":"BarretuBf","date":"2019-11-15T07:40:43.850+0000","up_votes":1,"down_votes":0,"body":"Cute, im Eifer des Gefechts ist Stalingrad standhaft geblieben.\n\nDie Truppen des barbarischen Königs Ados Huldus haben die Frontlinie nicht durchbrechen können.\n\n\"Kamerade\", sagte der bisher ungeschlagene General Umpuktus Göddel, wir werden siegen. \n\nDie feindliche Arme vom Norden des Landes, die Ahlimierten kämpften mit großem Geschick gegen den Tyrannen.Doch es reichte nicht. Mit der Staffeleinheit \"noobs\" konnte Umpuktus die Alhlimierten noch zurückdrengen aber am Ende stoßen sie immer weiter vor. Mit rießigem Gummidildogeschossen durchbrachen die Alhimierten abers mehrere Verteidigungslinien. \n\n100.000tausende gaben ihr Leben für den Tyrannen Ados Huldus.\n\nDoch niemand huldigte ihn, und sein Name wurde ihm nicht gerecht.\n\nWenn SIe wissen wollen wie es weiter geht, dann schicken Sie mir doch ein Fax!","replies":[]}]}]}]}]}]},{"poster":"DrakoDRK","date":"2019-11-07T11:44:18.943+0000","up_votes":1,"down_votes":0,"body":"Ich bin zwar nicht in der Höhe deiner Elo, doch was ich dir sagen kann was ich selber als Jungler gemacht hatte.\nIch hatte WW im Jungle und Kayle auf meiner Top Lane, die ihre lane total verloren hatte gegen einen Garen.\nImmer wieder waren 2 bis 3 Leute bei ihr auf der Lane. Sie stand dann innert kurzen Zeit einfach mal 0/2. \nUnd diese Aussage \"Man soll eine Losing Lane nicht ganken\" finde ich persönlich einfach nur falsch. Gerade einer Losing lane sollte man Helfen, damit die wieder eine Chance haben ins Spiel zurück zu kommen und ahead zu werden.\n\nUnd genau das habe ich mit Kayle gemacht. Ich habe angefangen die Top Lane zu sitten, weil Lee Sin immer da oben war und Zed auch immer wieder von der Mitte zur Top ging. Also blieb ich da und half der Kayle.\nIch rettete sie so mehrmals und sie ging am Schluss des Games mit 6/2 aus dem Spiel. \nNachdem ich oft auf der Top war, haben Zed und Lee aufgegeben die Kayle zu Sitten weil ich nämlich da war. Und Dann war die Kayle ahead. Ihre Lane war so gut wie verloren, aber dank meiner Hilfe konnte sie wieder aufholen und konnte dann auch gegen Garen bestehen.\n\nAuch als Jungler gehört es zu deiner Aufgabe einer Schwachen Lane zu helfen um sie wieder nach vorne zu bringen. Und das klappt in den meisten Fällen sehr gut, nicht immer aber so gut wie immer.\n\nIch finde es persönlich ein Fehler wenn man eine Losing Lane ignoriert, denn dann verleiren sie erst Recht. Doch mit der Hilfe des Junglers hat deine Losing Lane wieder eine gute Chance nach vorne zu kommen. Versuche einfach mal diesen Weg. Sag der Losing Lane in deinem Team sie sollen alles warden wenn es geht und die Lane einfach freezen damit du ganken kannst. \nUnd versuch wenn möglich dann den Kill der losing lane zu lassen, wenns nicht anders geht dann nimm den kill. \nHabe dies schon oft gemacht als ich im Jungle war, der Losing Lane in meinem Team geholfen und dadurch kam die Lane dann wieder zurück ins Spiel. Ich habe sehr gute Erfahrungen gemacht damit. Am Schluss gewann mein Team sogar das Spiel, obwohl es am Anfang schlecht aussah. Und das aller wichtigste finde ich auch, dass man sich um die Drakes kümmert, erst recht wenn man eine Losing Lane hat in seinem Team.","replies":[{"poster":"Angel Ayume","date":"2019-11-07T12:32:12.854+0000","up_votes":1,"down_votes":0,"body":"Das kannst du leider so pauschal nicht sagen. Es kommt oft auf den Champ an.\nKayle ist ein Lategamechampion weswegen es sich durchaus lohnt ihre Lane zu ganken selbst wenn sie behind ist. Sie ist in der Lage mit ein pasr entsprechenden Items das Game zu carrien. Hast du da oben einen Tank, dann bringt ganken nicht viel, elbst wenn er dadurch wieder zurück ins Game kommt. Tankitems sind nicht so teuer und seine Aufgabe kann er als Frontline und Peeler für die Carries dennoch sein, selbst wenn er behind ist. \n\nDann lieber die Botlane sitten, den Adc ahead bringen und den Toplaner ignorieren. \n\nDu musst halt wissen, wo eure Winkondition liegt, wenn die NICHT auf der Toplane ist, dann ist es wertvoll vergeudete Zeit die Lane zu campen. Selbst wenn du dem Toplaner damit Kills verschaffst.\nWenn die anderen Lanes alleine klar kommen und ihr Match im 1v1, 2v2 gewinnen, dann kannste sowas machen. Wenn die anderen Lanes aber eher even sind, konzentrier dich lieber auf die Carries.","replies":[]}]},{"poster":"ImBaLanZe","date":"2019-11-07T11:51:16.066+0000","up_votes":1,"down_votes":0,"body":"Du musst vorallem als Jungler versuchen, um die lane zu spielen die am besten snowballen kann. Du spielst ja fast nur jungle und hast auf deinen Main Champs ja keine schlechte Winrate, ich gehe jetzt mal davon aus dass du mit den basics vertraut bist.\nVorallem in D4 würd ich dir immer emphelen, deine Teammates auf OP.gg zu auskundschaften, sobald du einen entdeckst der vlt nicht unbedingt in diese Elo gehört ---> Dodge (das selbe gilt für leute die jedes game, nur am inten sind + Leute die legit nur eine rolle onetricken und autofilled sind)\n\nWenn du das early meistens gewinnst, dann sicher die immer die Drakes (egal welcher einfach machen) + prio auf herald legen sobald, die möglichkeit dafür da ist.\n\nDann wird das schon, zumindest nach D3 zu kommen. Wobei man ehrlicherweise sagen muss, kurz vor Season Ende zu \"climben\" ist nicht so einfach, da die meisten in D4 eh egal ist ob win or loose hauptsache D4 :S + Smurfs die mal in deinem als auch im Gegnerteam seien können.\n\nWas ich dir noch raten würde, such dir einen Duoqueue Partner auf den du dich VERLASSEN kannst! Dann wird es noch ein Stück einfacher aus D4 rauszukommen:) \nHoffe konnte dir einwenig helfen, auch wenn das vlt nicht unbedingt deine Intention war.\n\nLG","replies":[]}]}