{"poster":"SKT T1 Taehoon","date":"2016-02-28T01:56:36.945+0000","title":"Some help from a rioter needed.","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Okay so anyone reading this you probs  think this is just another rant but i want to talk about something serious for a minute here.\r\n\r\nNow in league of legends there is a gifting system which we all know about now a gift is a gift right well. A few days ago i was gifted pool party graves from who i thought was a friend. Now this summoner who gifted me is demanding a skin in return. Now i never asked or forced this summoner to gift me he did it because he wanted to. And now he thinks i scammed him now the definition of a scammer is a confidence game or other fraudulent scheme, especially for making a quick profit. know as i have said already i never forced the summoner to gift me the skin now they are trying to black mail me into gifting them a skin back since they gifted me like i said earlier a gift is a gift. \r\n\r\nRioter help would be nice since his threats have been posting a fake video about me so called scamming him and posting a post on the boards now i am here to clear my name because i have done nothing wrong. Here it isnt my fault that the summoner didnt understand what a gift is \r\n\r\nSo if something is posted about me it is 100% fake and edited because i take time in my day to make sure that i dont do anything to make others upset or feel un-safe. \r\n\r\nIf i could get some assistance from a Rioter it would be nice plz. \r\n\r\n\r\nThank you \r\n\r\nGLHF","replies":[{"poster":"Essembie","date":"2016-02-28T05:56:53.796+0000","up_votes":5,"down_votes":0,"body":"politely tell them to fuck off.","replies":[{"poster":"TrashDonnut","date":"2016-02-29T09:00:40.651+0000","up_votes":1,"down_votes":0,"body":"this.\n\nim dying","replies":[]}]},{"poster":"A Flying Brick","date":"2016-02-29T09:08:14.727+0000","up_votes":2,"down_votes":0,"body":"As well as reporting their account here, you can report the videos for harrasment (youtube and other sites will let you do that).","replies":[]},{"poster":"SephirothSG","date":"2016-02-28T02:02:50.035+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nYou do not have to provide him anything in return, if he provides a gift to you that is a gift plain and simple.\nThe user in question could post whatever he wishes, by the sounds of it you've done nothing wrong and thus have nothing to worry about.","replies":[{"poster":"SKT T1 Taehoon","date":"2016-02-28T02:08:11.531+0000","up_votes":1,"down_votes":0,"body":"Yea i just finished off a game to find a skin had been gifted to me this was 3 days ago and today he has started demanding skins.\nIs there a way for riot to give him like chat bans or something cos he will probs keep doing it to others","replies":[{"poster":"Ninox","date":"2016-02-28T02:18:30.555+0000","up_votes":1,"down_votes":0,"body":"You haven't done anything wrong, as you say, a gift is a gift. The first thing you should do is remove him from your list (if you haven't already) and add him to your block list. If you wish to take it further then you can [submit a support ticket](https://support.riotgames.com/hc/en-us/requests/new), I would recommend having screenshots of your chat with them and maybe of your gift history as well. \n\nSupport will look into it for you, however they cannot tell you about any outcomes. Once they get back to you you'll get a response something to the effect of: \n> \"Please keep in mind; we cannot disclose any disciplinary actions that may be taken due to privacy reasons.\"","replies":[{"poster":"SKT T1 Taehoon","date":"2016-02-28T02:55:01.771+0000","up_votes":1,"down_votes":0,"body":"you sure this works","replies":[{"poster":"Ninox","date":"2016-02-28T02:59:00.526+0000","up_votes":1,"down_votes":0,"body":"If support deems his behaviour inappropriate then they will take action against him, just as they do for toxic behaviour in game. It is up to support to decide what they do with the case/evidence they have.","replies":[]}]}]},{"poster":"SephirothSG","date":"2016-02-28T02:10:18.535+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"SKT T1 Taehoon","date":"2016-02-28T02:12:27.447+0000","up_votes":1,"down_votes":0,"body":"because of him blackmailing people","replies":[]}]}]}]},{"poster":"Talon12","date":"2016-02-28T02:34:58.897+0000","up_votes":1,"down_votes":0,"body":"ahaha i have a friend who wont stop asking me to gift them poolparty graves\n\njust give them an icon or something and tell them to buggeroff.\n\nI don't do gifting unless i trust them and they agree to trade for trade... or its christmas ","replies":[]}]}