{"poster":"PhaseDives","date":"2017-08-15T02:45:18.437+0000","title":"I think Riot forgot that AP is suposed to be a cheaper stat than AD","subforum":"Gameplay","up_votes":154,"down_votes":27,"body":"AD items are completely Outclassing AP items right now.. IE better than Rabadon by a mile Trinity force and duskblade are so much better than LichBane By a mile.\r\n\r\nIts really lame as a AP champion when your best bet is rush either Magic Pen Items only and try snowball with base dmg vs the AD opponent to get item advantage or go for a ton of CDR and hope to kite them.\r\n\r\nThe best item with Ap right now is Gunblade in its own division and theres too many wasted stats that most AP champions cant build it and also cant afford to place this item in their inventory..\r\n\r\nI remember when you could easily have 2 times more AP than AD Late game With Rabadon and a full AP build but now since rabadon is sooooo expensive its soo hard to build and you need too much items to do damage late game with all the retarded ad items they added and buffed over the time..\r\n\r\nIm not talking about ad champs like zed or jhin who have more ad than i have ap late game im talking about pretty much every AD champions who have more AD than i have AP at 5 items if i go for a build like {{item:3152}} {{item:3100}} {{item:3157}} {{item:3135}} {{item:3102}} \r\nAnd the people who are going to tell me (But you have UTILITY with those items)\r\n.\r\nSo does {{item:3156}} {{item:3147}} {{item:3814}} {{item:3812}} \r\n\r\nYou even Rush IE on a ton of ADCs now even when its suposed to be an item you get a bit later to make it more cost efficient with its passive..\r\n\r\nDo you know anybody who goes Rabadon First item? NO because its dog shit but at the same time you NEED that item late game \r\n\r\nRight now on {{champion:245}} i go a build like {{item:3152}} {{item:3100}} {{item:3089}} I Get rabadon 3rd almost all of my games despite mr or not because i know its gonna be too hard to build that item past 3 items.. {{item:3135}} then last item is something with heavy cdr because you also NEED to Cap Cdr late game on a ap champion {{item:3115}} {{item:3165}} \r\n\r\nRiot balance team must probably not play many AP champions because its just lame to be at 4 items without rabadon and trying to build it and even when you have a largerod in your inventory you need 2550 gold to build it.... thats 2 more largerod...\r\n\r\nRemember the TSM VS C9 Spring Final? \r\n\r\nJensen was playing {{champion:245}} late game he had no rabadon at 4 items he was building it 5th item he was sitting with a largerod but had 2k+ gold still he couldnt buy the rabadon because the item is way too fuking expensive so he brought a ludens since it was the most expensive ap item he could buy.\r\nHe spent almost 2k gold for 40 more ap and a discount duskblade passive resulting in him not having enough AP late game for his spells to work properly at that stage so his shield was way too low than he trought it would be and he got insta killed trough his shield.\r\n\r\nI really hope Riot looks into AP Items after all the change they are doing with MR Buffs AD items Buffs Nerfing everything Ability Power Related \r\nI mean stuff like cassio are building tank items now like comon wtf is that?\r\n\r\nAll im saying is that they should probably increase the AP value only on some items and make Rabadon a bit cheaper to compete with all the ad items we have right now.\r\n\r\nTell me what you think.","replies":[{"poster":"A Bad Nasus","date":"2017-08-15T04:13:03.138+0000","up_votes":60,"down_votes":1,"body":"I think it needs to be redone like all the ap items they \"tweaked\".  Hell I remember when {{item:3157}}  was a 120 ap item...","replies":[{"poster":"Divewing","date":"2017-08-15T05:03:44.259+0000","up_votes":43,"down_votes":1,"body":"Back when DFG was in the game (**_Press F to pay respects_**)","replies":[{"poster":"5000000000000000","date":"2017-08-15T05:09:36.688+0000","up_votes":28,"down_votes":2,"body":"{{summoner:4}}","replies":[{"poster":"OyddAWqJ5r","date":"2017-08-15T06:20:27.749+0000","up_votes":44,"down_votes":16,"body":"You mean {{summoner:12}}/{{summoner:11}}/{{summoner:3}}/{{summoner:6}}/{{summoner:7}}/{{summoner:14}}\n\nD is for Flash get it right.","replies":[{"poster":"SH Azykan","date":"2017-08-15T07:32:33.647+0000","up_votes":12,"down_votes":2,"body":"https://youtu.be/GXzqTZ-bUAs","replies":[{"poster":"Glory ln Death","date":"2017-08-15T16:34:51.083+0000","up_votes":5,"down_votes":0,"body":"That's not how the song goes, though...\n\nF is for Flash so you can make big plays, \nD is for Dumb Ignite! \nG is for ping spamming all over your team! \nOut here on Summoner's Rift!","replies":[{"poster":"Nielarken","date":"2017-08-15T17:06:15.079+0000","up_votes":7,"down_votes":1,"body":"D is for dodge F is for fight.","replies":[{"poster":"I suck at Jhin","date":"2017-08-15T17:29:17.490+0000","up_votes":13,"down_votes":0,"body":"ALT+F4 is for dodge, F is flash.\n\nGet it right noobs.","replies":[]}]}]}]}]}]}]},{"poster":"Elikain","date":"2017-08-15T14:29:21.668+0000","up_votes":6,"down_votes":10,"body":"And Zhonya's was nerfed (and made cheaper) because it was meant to be an defensive AP purchase, not a core item that mages would rush after Morello's. Which is what the AP item pass accomplished, to differentiate between items and use cases between champions instead of every mage just buying 3 of the same items over and over again because they are the most stat efficient and an unbeatable combination.","replies":[{"poster":"Aimléss","date":"2017-08-15T14:37:52.894+0000","up_votes":26,"down_votes":1,"body":"You can't nerf powerful items {{item:3157}} {{item:3116}} and not buff garbage items {{item:3285}} then say it's balance. Rylais was overnerfed, and Ludens is suuuuch a bad item. Some may argue that it does AOE damage, but most of the time when it procs, it's hitting 2 tanks and one squishy, and those tanks aren't gonna feel that weak shit. Plus Riot also buffed MR across the board on squishies. That's like nerf after nerf after nerf on AP overall, without one SINGLE buff. And I don't recall AP being that OP to begin with.","replies":[{"poster":"Elikain","date":"2017-08-15T14:48:31.237+0000","up_votes":4,"down_votes":9,"body":"And what are you accomplishing by nerfing the big items and then buffing the \"weak\" items?\nYou're nerfing the overperformers so that every other item can compete with them. You're not trying to replace one top item with the next top item (Nerfing Zhonya's and then for example, buffing Luden's to push them to the top Zhonya's used to be on).\n\nThat's not how proper balance is done. Only if Luden's was underperforming it would be good to think of some buffs but if it was simply overshadowed by bigger and more stat efficient items (per gold invested), then it's reasonable only to nerf and level the playing field for everyone. Yes, AP was overperforming in the past and that's why Riot acted. Mages were literally winning of Morello's and Athene's. Every mage had either this to build or wasn't suited for these purchases and therefore, was never being picked as a result.","replies":[{"poster":"WalkingInACircle","date":"2017-08-15T16:20:13.024+0000","up_votes":4,"down_votes":0,"body":"Ludens is underperforming. Siege mages are the only thing I think its even worth considering on, or as a 6th item replacing boots.","replies":[{"poster":"Thilmer","date":"2017-08-15T21:25:53.066+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WalkingInACircle,realm=NA,application-id=3ErqAdtq,discussion-id=iB5xuK0c,comment-id=00020001000000000001,timestamp=2017-08-15T16:20:13.024+0000)\n>\n> Ludens is underperforming. Siege mages are the only thing I think its even worth considering on, or as a 6th item replacing boots.\n\nYou know what is fun?\n\nWhen they announce it, Luddens was going to replace Death Fire Grasp as \"the other 120 AP ítem\", with Raddabon and Zhonya. But Luddens got nerfed inmediately after its release. And I don't even need to mention how many times has Zhonya been nerfed...","replies":[]}]}]}]}]}]},{"poster":"PopcornBunni","date":"2017-08-15T04:20:11.007+0000","up_votes":22,"down_votes":3,"body":"The problem comes from how AP works as a stat compared to AD.\n\nBuilding AD has a 1:1 ratio with a game element all physical damage dealers use -- their auto attacks. AP however is gated 100% of the time by the AP ratios of champion abilities. \n\nWith AD, it's a simple question to answer: How much gold is adding 10 damage to your auto attacks worth? (It's 350 gold)\n\nHow much gold is adding 20 damage to your skillshot worth? (There isn't an answer)\n\nUnless every single champion that builds AP has at least one skill with 100% AP scaling, it is always going to be a nightmare to itemize while physical damagers get reliable, grokkable AD forever.\n\nThe closest thing in the game to making AP a consistent stat is {{item:3115}}, which still ends up making AP a laughable contribution compared to AD. ","replies":[{"poster":"A Bad Nasus","date":"2017-08-15T04:54:03.343+0000","up_votes":2,"down_votes":7,"body":"It still beats having full ad teams tho.","replies":[{"poster":"RavenMagus","date":"2017-08-15T08:22:12.979+0000","up_votes":50,"down_votes":4,"body":"Full AD teams are actually viable.  They definitely have their drawbacks - you're likely better off with mixed damage - but they CAN work.\n\nMeanwhile full AP teams are such trash as to be completely unthinkable.\n\nPersonally I think that's rather unfair, but I guess that's simply my opinion.","replies":[{"poster":"YumaS2Astral","date":"2017-08-15T18:21:43.199+0000","up_votes":2,"down_votes":0,"body":"Full AD teams are viable if your opponent's team don't have tanks.","replies":[{"poster":"Votable Jester","date":"2017-08-15T19:01:04.731+0000","up_votes":1,"down_votes":1,"body":"{{champion:42}} boom done full ad team (doesn't matter that he does magic damage, he's an ad champ).","replies":[{"poster":"ChaoticPinecone","date":"2017-08-15T20:33:40.835+0000","up_votes":2,"down_votes":3,"body":"What matters is the type of damage you do, not what you build or what your abilities scale with.\n\nCause by your logic, I can just run {{champion:85}} AD. Boom - full AP team, dosent matter if hes an AP champ.","replies":[{"poster":"Votable Jester","date":"2017-08-15T21:11:36.755+0000","up_votes":5,"down_votes":0,"body":"No, you just used the opposite of my logic.\n\nCorki builds primarily AD items, but does magic damage.  That makes him still an ad champion, even though he does primarily magic damage.\n\nThis is a discussion of AD vs AP, not physical damage vs magic damage.  There's a huge difference.","replies":[]}]}]}]},{"poster":"YumaS2Astral","date":"2017-08-16T16:30:29.467+0000","up_votes":1,"down_votes":0,"body":"Also, there is no such thing as full AP teams. There is always at least the ADC doing physical damage. Unless your ADC is Corki (which, even though still AD, does 80% magic damage), which is the only possible situation where you don't have to build armor at all. As a tank, you will almost always have to dedicate half of your item slots to armor just to counter the ADC, and that actually makes \"full AP\" teams (comps with 4 magic damage champions and the ADC) viable. Meanwhile, full AD teams are trash against well made team compositions that have enough tanks. But are viable against squishies, because against them it doesn't matter what you choose, they will die anyway.","replies":[{"poster":"RavenMagus","date":"2017-08-16T20:57:33.582+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=YumaS2Astral,realm=NA,application-id=3ErqAdtq,discussion-id=iB5xuK0c,comment-id=0003000000010002,timestamp=2017-08-16T16:30:29.467+0000)\n>\n> Also, there is no such thing as full AP teams. \n\nYes, that is actually my point, thank you.  :)\n\nYou can run full AD teamcomps fairly well.  They struggle a little in the midgame when tanks have a few items, but they can either dominate and steamroll early on or outscale later on.  Teamcomps with 2 ADCs + 3 tanks are becoming increasingly more common as well.\n\nBut you can't run a full AP team comp.  Your team MUST have an ADC, no matter what, or you pretty much lose.  Even if the enemy team is a bunch of squishies, there are more (and better) options for squishies to build magic resist than armor.\n\nThere's only one role that every team is required to have, and that's ADC.","replies":[]}]}]},{"poster":"PopcornBunni","date":"2017-08-15T05:07:11.126+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Everlasting Tilt,realm=NA,application-id=3ErqAdtq,discussion-id=iB5xuK0c,comment-id=00030000,timestamp=2017-08-15T04:54:03.343+0000)\n>\n> It still beats having full ad teams tho.\n\nIt depends on the AP ratios. If you can consistently deal damage with a spell that has 63% or more AP scaling, AP provides more damage for the gold investment generally.","replies":[{"poster":"Inting Pillow","date":"2017-08-15T14:04:57.671+0000","up_votes":7,"down_votes":0,"body":"{{champion:42}}?","replies":[]}]}]},{"poster":"An Undead brat","date":"2017-08-15T10:39:35.038+0000","up_votes":7,"down_votes":1,"body":"When AD champions' abilities don't deal damage, this might be true. Until then...","replies":[]}]},{"poster":"Fear the Kayn","date":"2017-08-15T03:41:35.401+0000","up_votes":26,"down_votes":2,"body":"I think mages need to have more build variety for sure.","replies":[{"poster":"Wimbledofy","date":"2017-08-15T07:47:45.782+0000","up_votes":3,"down_votes":9,"body":"Mages have plenty of build variety, they just aren't good options for them. All of the options have lowered ap \"because of utility\"","replies":[{"poster":"Cosmic Warper","date":"2017-08-15T16:52:48.196+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Wimbledofy,realm=NA,application-id=3ErqAdtq,discussion-id=iB5xuK0c,comment-id=00000000,timestamp=2017-08-15T07:47:45.782+0000)\n>\n> Mages have plenty of build variety, they just aren&#x27;t good options for them. All of the options have lowered ap &quot;because of utility&quot;\n\nif there aren't good options for them then they don't have build variety....","replies":[]}]}]},{"poster":"PrinceOfStorms","date":"2017-08-15T05:46:31.986+0000","up_votes":26,"down_votes":3,"body":"Part of the problem is that AD items have a ton of extra stuff baked into them. IE gets more crit damage. Maw gets the hexdrinker passive. All of the lethality items have additional stuff on them. Essence Reaver gives Crit -> CDR. GA is an AD item now for whatever reason (AD champions needed *less* defensive itemization, not more).\n\nThe most that AP champions have is the hextech items that were nerfed so hard that only a few champions buy them in the first place, and Zhonyas. Zhonyas doesn't really give that much stats anymore either.\n\nIf Riot's not going to nerf the busted AD itemization, the least they can do is buff AP itemization until it's *at least* as broken. Like making deathcap just increase all healing and magic damage you deal by 35%.","replies":[{"poster":"Over Innsmouth","date":"2017-08-15T06:21:08.136+0000","up_votes":22,"down_votes":0,"body":"Laughs in Vladimir","replies":[]},{"poster":"Tempist","date":"2017-08-15T12:02:41.801+0000","up_votes":6,"down_votes":0,"body":"There are still very efficient and powerful AP items, it's just that alot of them happen to be niche or situational pickups.\n\n{{item:3165}}  and {{item:3151}}  are two items which are very common pickups and also extremely gold efficient. In point of fact, I think Morello's is actually a little too powerful and could be tweaked down a bit.\n\nMoving on, {{item:3115}} , {{item:3040}} , and {{item:3027}}  are all incredibly efficient and powerful items - if your champion actually builds them. And in the case of {{item:3040}} , if they can afford to build a {{item:3070}} .\n\nMost of the complaints regarding AP itemization seem to be centered around {{item:3089}} , {{item:3157}} , and {{item:3285}}  being a bit underwhelming currently. I'm even inclined to agree. If Riot ends up nerfing {{item:3165}} , I would be perfectly fine seeing those three items getting  buffed.","replies":[{"poster":"Sraeg2013","date":"2017-08-15T17:36:22.846+0000","up_votes":4,"down_votes":0,"body":">In point of fact, I think Morello's is actually a little too powerful and could be tweaked down a bit.\n\nThe joke with Morello is that it has everything a mage would require (except m.pen), but at the same time Rito removed the only alternative while simultaneously putting the passive of that item onto Morello.","replies":[{"poster":"Elikain","date":"2017-08-15T20:42:33.362+0000","up_votes":1,"down_votes":3,"body":"Athene's was moved to be an AP oriented support item as mana regen and raw mana were differentiated as stats for mages and supports. Athene's and Morello's before all of this were the same item basically. The only one getting bought was the one who had better stats. That's why Riot gave every AP item different thing and moved some extras for supports.\n\nAthene's isn't bad. If you're a shielding mid laner, your damage serves as a potential heal for allies. But this is rather limited as you'd rather do more damage than heal someone and there are no AP supports that shield or heal that deal damage to benefit from Athene's in that way. Only Soraka or Janna come to mind and they are babysitting supports that are absolutely devoted to supporting an ally. Sona might be there somewhere (and Karma), possibly Lulu but considering how every other genuine support item is better due to Windspeaker's and Censer, pure AP supports like Brand can't even use its passive.","replies":[{"poster":"Sraeg2013","date":"2017-08-15T22:16:07.278+0000","up_votes":3,"down_votes":0,"body":"Morello and Athene were different both in stats, their scope and role.\n\nSaying they were the same item would be like saying Bloodthirster and Blade of the Ruined King are basically the same item.","replies":[]}]}]}]}]},{"poster":"FilDaFunk","date":"2017-08-15T08:41:42.558+0000","up_votes":16,"down_votes":3,"body":"I remember I used to get ~600AP easily.\nNow, I see the enemy Assassin get 400AD while I only have 300AP.","replies":[{"poster":"Squidward Dab","date":"2017-08-15T15:11:45.935+0000","up_votes":18,"down_votes":0,"body":"I remember when 800 AP was easy, now I'm crying every time I wanna buy deathcap cuz everyone just stacks mr so I'm forced to go void staff instead, or they all have ad so I buy an expensive ass item with a pathetic 70 AP.\nPlus I have to go sorc boots otherwise my damage is basically tickling the enemies while AD champs can build defensively and still deal damage","replies":[]},{"poster":"AirKingNeo","date":"2017-08-15T14:55:55.460+0000","up_votes":4,"down_votes":3,"body":"and now you get double the CDR.\n\nWhich actually deals more damage.","replies":[{"poster":"FilDaFunk","date":"2017-08-15T15:52:14.923+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AirKingNeo,realm=NA,application-id=3ErqAdtq,discussion-id=iB5xuK0c,comment-id=00070001,timestamp=2017-08-15T14:55:55.460+0000)\n>\n> and now you get double the CDR.\n> \n> Which actually deals more damage.\n\nWhich requires 2 rotations, back then, mages had buuuuuurst.","replies":[{"poster":"AirKingNeo","date":"2017-08-15T16:25:55.852+0000","up_votes":2,"down_votes":3,"body":"More counterplay and more interactive for everyone.","replies":[{"poster":"I suck at Jhin","date":"2017-08-15T17:47:43.327+0000","up_votes":8,"down_votes":2,"body":"Except for mages that get oneshot in one rotation by AD's, right?\n\nOr ADC's since they just rightclick them without caring, right?","replies":[]},{"poster":"OHminus","date":"2017-08-15T17:43:40.947+0000","up_votes":3,"down_votes":0,"body":"> More counterplay and more interactive for everyone\n\n> Twitch/Jinx/Draven/Vayne autos and crits\n\n... well fuck me then.","replies":[]}]}]}]}]},{"poster":"sutora3","date":"2017-08-15T06:14:44.374+0000","up_votes":2,"down_votes":1,"body":"just play ad or tank ekko","replies":[{"poster":"HeadHonchkrow","date":"2017-08-15T09:40:28.008+0000","up_votes":12,"down_votes":0,"body":">tank ekko\n\nHast thou no honor, good sir?","replies":[{"poster":"sutora3","date":"2017-08-15T10:03:20.675+0000","up_votes":1,"down_votes":1,"body":"theeself hast honor , theeself does but not touched ekko ever in theeself lifetime","replies":[{"poster":"Anidan","date":"2017-08-16T05:19:55.167+0000","up_votes":2,"down_votes":0,"body":"thee? Aren't you referring yourself? If so, that would be essentially just be the same as modern English pronouns, and if you're referring to yourself you also wouldn't use 'hast' because that was used as the second-person singular present from of 'have,' and it's not necessary to refer to yourself in the second-person in this context, because in this context you can't really use second-person pronouns to address yourself due to the fact that you're the subject of the sentence, and also the speaker. Subject-Verb agreement and all that.\n\n\"I have honor; I have not but touched ekko ever in mine* own lifetime.\" would be more correct even if you're trying to mimic older Anglo-Saxon grammatical rules for sake of consistency with HeadHonchkrow.\n\n*'mine' and 'thine' were used to prevent a vowel ending from leading into the second word that is led by a vowel sound because it sounded better, probably due to French influence on the English language, but I'm only guessing on that part.\n\nFor future reference: thou, thee, thyself, thy, and thine are always second-person pronouns.","replies":[{"poster":"sutora3","date":"2017-08-16T06:30:26.565+0000","up_votes":1,"down_votes":0,"body":"yes I was referring to myself\nand thank you I didnt know that theeself is second person pronoun\nhttp://imgur.com/gallery/IW8simF","replies":[{"poster":"Anidan","date":"2017-08-16T06:35:17.676+0000","up_votes":2,"down_votes":0,"body":"No problem :) I have to find a way to apply that trivia somehow, and acting like a pedant (and teaching people about that trivia) online is the most practical way to do so, realistically.","replies":[]}]}]}]}]}]},{"poster":"Skorch","date":"2017-08-15T09:37:37.712+0000","up_votes":8,"down_votes":2,"body":"TLDR, but...\n\nWhere does anything say that AP is supposed to be cheaper than AD?\n\nI know tank stats are cheaper than damage, but i dont think AD being more expensive than AP is said anywhere.","replies":[{"poster":"An Undead brat","date":"2017-08-15T10:42:36.313+0000","up_votes":7,"down_votes":2,"body":"Pretty logical since APs don't gain damage on AAs with it (most of them) but ADs gain damage to their abilities too.","replies":[{"poster":"Skorch","date":"2017-08-15T10:44:45.026+0000","up_votes":3,"down_votes":8,"body":"At almost ALWAYS highly reduced Ratios. As well as AP items just give more, but ADs grant other effects like Crit and AS.\n\nSo again i ask... Where does it say that AP is supposed to be cheaper than AD?","replies":[]}]}]}]}