{"poster":"Tsamsiyu","date":"2016-04-09T15:17:41.355+0000","title":"Überarbeitete Champions als Skin anbieten","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":2,"body":"Moin Moin,\r\n\r\nes gibt ja in letzter Zeit &ouml;fters Aktualisierungen von Championf&auml;higkeiten und Aussehen (was ich an sich gut finde). Ich f&auml;nd es sehr sch&ouml;n, wenn man bei der visuellen &Uuml;berarbeitung eines Champions den Spielern, die diesen Champion besitzen, einen Skin mit dem alten Aussehen zur Verf&uuml;gung stellt. Ich wei&szlig; nicht ob das m&ouml;glich ist, w&auml;re aber ne super Aktion. Auch wenn von die &Uuml;berarbeitungen den Sinn der optischen Verbesserung haben, finden viele (ich eingeschlossen) bei manchen Neuerungen das neue Aussehen eher unsch&ouml;n, bzw. wollen aus nostalgischen Gr&uuml;nden gerne das alte Aussehen behalten.\r\nAktuell z.B. Taric: Hab ich zwar selber nicht, aber wenn jemand Taric mit dem Rosenquarzskin hat, w&auml;re ich daf&uuml;r diesem Spieler nach der Neuerung das alte Aussehen von Taric und den Rosenquarztaric als Skins zur Verf&uuml;gung stellen. Dann kann man selbst entscheiden, ob man den Neuen oder den Alten spielen m&ouml;chte.","replies":[{"poster":"Pandaphiri","date":"2016-04-09T16:05:33.704+0000","up_votes":1,"down_votes":0,"body":"ich denke das problem wäre dann bei sowas das er nen ganz anderes Model hätte womit quasi taric zweimal drinnen wäre in der datensammlung. ein mal das alte model und das neue und sicher würde es dort irwelche komplikationen geben . Das aber ist nur meine meinung  und ob das stimmt kann ich nicht sagen. Glaube daher also nicht dran das es passieren wird.","replies":[{"poster":"Tsamsiyu","date":"2016-04-09T18:30:47.893+0000","up_votes":1,"down_votes":0,"body":"Man kann ja die Skins als \"klassisch\" oder so eintragen, das sollte nicht das Problem sein. Kann man ja auch bei Skins an sich machen, wenn die auch geändert wurden. Ich stell mir da den Mehraufwand nicht so groß vor, die Modelle sind ja vorhanden. (Hab zugegeben aber auch nicht so viel Ahnung von Programmieren)","replies":[{"poster":"Pandaphiri","date":"2016-04-09T21:17:53.916+0000","up_votes":1,"down_votes":0,"body":"das problem wäre trotzdem das es kein Skin wäre sondern ein komplett anderes 3D model der auf einer anderen form beruht als der neue Taric","replies":[]}]}]},{"poster":"Der Wohltäter","date":"2016-04-09T17:24:05.725+0000","up_votes":1,"down_votes":0,"body":"So wie bei Trundle, Karma oder auch Sejuani gibt es ja diese \"Traditionellen\"-Skins. Diese würden zu deiner Idee wohl passen.","replies":[{"poster":"Tsamsiyu","date":"2016-04-09T18:31:23.947+0000","up_votes":1,"down_votes":0,"body":"Genau, ist ja mehr oder weniger ähnlich vom Grundgedanken.","replies":[]}]}]}