{"poster":"iMing","date":"2015-12-15T02:50:04.828+0000","title":"Lag con Fibertel, sobre todo de noche!","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Gene queria saber si alguno de ustedes que tiene como proveedor de banda ancha a Fibertel si est&aacute;n experimentando lag y microcortes durante el juego, sobre todo en este horario, a partir de las 22.00 hs ! Si alguno tiene alguna soluci&oacute;n que no sea llamar y reclamar a Fibertel (ni bola) les agradecere! :D :D","replies":[{"poster":"EzeK","date":"2015-12-15T02:54:32.821+0000","up_votes":3,"down_votes":0,"body":"3mb / 40ms todo el dia.","replies":[{"poster":"iMing","date":"2015-12-15T03:27:24.605+0000","up_votes":1,"down_votes":0,"body":"Gracias x comentar.. ahora vere que hago, sera un problema mio quizas.. de ultima llamare a ver cual es el drama","replies":[]}]},{"poster":"BiXe","date":"2015-12-15T08:12:11.624+0000","up_votes":2,"down_votes":0,"body":"Buenas, primero ¿Qué Velocidad a Internet Tienes, Vives en una zona donde es el único proveedor que llega?\nTengo 12 mbs lo uso por Wifi y tengo 50 ms durante todo el día para chequear te recomiendo ver dentro de la IP del modem que valores de Signal tienes, y dentro de cuales es aceptable que no haya cortes. Te explico brevemente el por qué:\n\n*  Fibertel tiene tendidos de fibra optica pero en las terminaciones (vease desde el nodo a tu casa) el tendido es de cobre que va en un cable coaxial y esto es muy suceptible a temperaturas, clima, movimiento por viento, etc (el calor hace que el cobre se expanda). Por ende si hay algo que afecte directamente al cableado te va a arrojar valores en el modem de señal ruido fuera de lo normal. \n- En el caso de que sea eso puedes pedir al soporte técnico (a traves de teléfono, twitter, facebook) que te envíe un técnico que te pondrá un atenuador de señal de X cantidad de dbs para que no tengas ese problema.\n*  Generalmente Fibertel tiene muy buena conexión **nacional**, pero en lo que respecta a internacional deja algo que desear, te recomiendo que te fijes en lo que es páginas de mediciones internacionales como está el ping (o bien algún medidor de velocidad de Chile ya que allí es en donde está el host de League Of Legends), también puedes realizar la medición desde sps.fibertel.com.ar ó sps.prima.com.ar\n\nDespués deberías chequear \n* Que estés conectado por cable de red al módem (También debe estar en buen estado y ser un buen cable en lo posible, si es muy finito y casi rígido es de mala calidad) \n* Que tu pc no esté usando la conexión de más ( si usas windows que las actualizaciones no se hagan solas sobre todo windows 8 y 10 que son bastante invasivos )\n* Tener un buen antivirus y actualizado (yo uso Baidu y realizo exámenes desde otro disco con Linux)\n* Verifica si hay más pcs que estén afectando la conexión ( incluye celulares que puedan actualizarse, etc )\n* Cuando estés en el juego evita que haya otras cosas ejecutándose (hasta Facebook ocupa una pequeña porción de conexión) \n* Si lo usas por Wifi como en mi caso verifica la calidad de la señal, si el módem es de Fibertel hay algunos que vienen bastante fallados en ese sentido, te recomiendo tengas un router particular y lo configures a gusto y comodidad.\n\nEspero te haya servido\n\n¡Exitos!","replies":[{"poster":"iMing","date":"2015-12-15T16:17:32.474+0000","up_votes":1,"down_votes":0,"body":"Gracias por tomarte el tiempo y la amabilidad para contestarme. Probaré lo que me recomendaste! Gracias!","replies":[]}]},{"poster":"Exit","date":"2015-12-15T06:33:45.923+0000","up_votes":1,"down_votes":0,"body":"lo mismo que el de abajo 30 ms clavados todo el tiempo :p","replies":[]}]}