{"poster":"Malicious Metal","date":"2016-11-08T15:50:01.392+0000","title":"Why is Garen being kept weak for being a \"beginner\" champion but Annie's dominant for patches now?","subforum":"Gameplay","up_votes":153,"down_votes":38,"body":"She&#039;s been having a 54% win rate for a very long time now, while being one of the easiest champions to play, and a quote on quote &quot;beginner&#039;s&quot; champion.\r\n\r\nMeanwhile Garen&#039;s sitting at a measly 47%","replies":[{"poster":"Wolfram Oxford","date":"2016-11-08T16:02:10.445+0000","up_votes":13,"down_votes":12,"body":"I don't think you want to see a strong Garen.","replies":[{"poster":"Malicious Metal","date":"2016-11-08T16:04:25.419+0000","up_votes":39,"down_votes":4,"body":"A decent one would suffice.","replies":[{"poster":"Wolfram Oxford","date":"2016-11-08T16:06:54.238+0000","up_votes":8,"down_votes":16,"body":"He is decent.","replies":[{"poster":"Malicious Metal","date":"2016-11-08T16:09:04.169+0000","up_votes":48,"down_votes":4,"body":"47% win rate, abysmally low pick rate.\nAll while having a basic, straight forward kit.\n\nEh, I'm going to call BS on that.\n\nHe should be less gimped, the villain mechanic was the only thing they changed about him and it took away a ton of power allocated elsewhere.","replies":[{"poster":"Wolfram Oxford","date":"2016-11-08T16:13:04.620+0000","up_votes":4,"down_votes":3,"body":"***","replies":[{"poster":"Malicious Metal","date":"2016-11-08T16:14:39.809+0000","up_votes":26,"down_votes":8,"body":"It was all during the Juggernaut patch.\nNow most Juggernauts are even worse off then pre-rework, except Darius who's become even less fun to play against and makes most champions his bitch.\n\nBut yeah, he could use shifts and changes more than simple buffs","replies":[{"poster":"Sahn Uzal","date":"2016-11-08T16:19:51.333+0000","up_votes":10,"down_votes":3,"body":"> except Darius who's become even less fun to play against and makes most champions his bitch.\n\nI'm sorry, but I doubt that one o.o\nThe difference is that Darius is currently decent while the old one was weak.\nBut fundamentally...","replies":[{"poster":"Blackstone01","date":"2016-11-08T16:25:21.712+0000","up_votes":17,"down_votes":5,"body":"Old Darius was extremely overbearing, and was only \"weak\" because of his being overbearing in land and poor late game transition. Now he's still a super lane bully that also transitions to late game.","replies":[{"poster":"Big Lincoln","date":"2016-11-08T16:28:01.747+0000","up_votes":15,"down_votes":4,"body":"not really, most lanes can fight him and at least go even \n\npre rework he was guaranteed to stomp any melee and then became useless of he didn't end","replies":[{"poster":"Sahn Uzal","date":"2016-11-08T16:28:27.334+0000","up_votes":8,"down_votes":1,"body":"Pretty much this.","replies":[]}]}]}]},{"poster":"5 Stacks GG","date":"2016-11-08T19:51:31.860+0000","up_votes":7,"down_votes":5,"body":"lmao explain to me how darius is unfun and morde isnt?\nalso darius doesnt make everyone his \"bitch\" A LOT of melees can beat him and all ranged beat him.\n\nyou are just a biased pathetic morde main who shall rot in hell because if you think morde is healthier and lessfrustrating to fight than darius you are so wrong.","replies":[{"poster":"Malicious Metal","date":"2016-11-08T20:06:07.815+0000","up_votes":11,"down_votes":2,"body":"Let's be honest here, there isn't a single Juggernaut that's fun to play against.","replies":[{"poster":"Pierce The Veal","date":"2016-11-09T05:56:32.253+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Malicious Metal,realm=EUW,application-id=3ErqAdtq,discussion-id=q48VjmM8,comment-id=00090000000000000000000000050000,timestamp=2016-11-08T20:06:07.815+0000)\n>\n> Let&#x27;s be honest here, there isn&#x27;t a single Juggernaut that&#x27;s fun to play against.\n\nJuggernaut is just keyword for doesn't actually have to build damage to hurt more than a fighter and tank as hard as a tank.","replies":[{"poster":"PB4UAME","date":"2016-11-09T06:15:23.518+0000","up_votes":9,"down_votes":0,"body":"At the cost of range, mobility, and lesser CC, aye.","replies":[{"poster":"OneSmoothDude","date":"2016-11-09T10:12:31.318+0000","up_votes":5,"down_votes":0,"body":"All that, and also the ability to be a good tank as well.\n\nAny champ in the game can build tanky if they want. Nothing stopping your fed Viktor from buying Warmog's into Sunfire into GA if he wants to. Not that he _should_ buy these things, but regardless, if he did he still wouldn't be a tank. He's just be tank_y_. Item builds do not define a champ's class.\n\nSo items don't turn Juggernauts into tanks. Got it. That leaves us with looking towards their kits, so let's take a look at Garen's. \n\nDamage Q, anti-burst W, damage E, and damage R. This guy's kit is obviously designed to murder people. Compare this to the kits of actual tanks like Poppy, Maokai, Braum, etc. who are loaded with CC and HP scalings.\n\nHere's a helpful hint Draco can use in the future: Juggernauts build tanky to empower themselves, whereas tanks build tanky to empower their team.","replies":[]}]}]}]}]},{"poster":"Sire Hippington","date":"2016-11-08T17:45:29.467+0000","up_votes":5,"down_votes":2,"body":"As some one who played alot of old darius, i have to disagree.\nHe was worse in some matchups, but had WAY better ways dealing with mobile shitters and ranged dudes to a point where i would use him as counter to champs like riven, jax or Fiora and even deal \nNow those champions do beat him if played well(they still die fast to him if they fail though) as they have the needed tools to avoid the blade of his Q and disengage befor his passive kicks in.\n\nJust like all the other juggernauts, he simply became more binary. Even more punishing if you make mistakes(like playing an immobile melee) but with even more exploitable weaknesses that can mostly be abused by ranged and/or mobile champs.","replies":[]}]}]},{"poster":"PermabannedGaren","date":"2016-11-08T16:23:46.659+0000","up_votes":13,"down_votes":3,"body":"> [{quoted}](name=Malicious Metal,realm=EUW,application-id=3ErqAdtq,discussion-id=q48VjmM8,comment-id=0009000000000000,timestamp=2016-11-08T16:09:04.169+0000)\n>\n> 47% win rate, abysmally low pick rate.\n> All while having a basic, straight forward kit.\n> \n> Eh, I&#x27;m going to call BS on that.\n> \n> He should be less gimped, the villain mechanic was the only thing they changed about him and it took away a ton of power allocated elsewhere.\n\nI agree, remove the Villain mechanic.","replies":[]},{"poster":"azrolator","date":"2016-11-08T21:00:18.854+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Malicious Metal,realm=EUW,application-id=3ErqAdtq,discussion-id=q48VjmM8,comment-id=0009000000000000,timestamp=2016-11-08T16:09:04.169+0000)\n>\n> 47% win rate, abysmally low pick rate.\n> All while having a basic, straight forward kit.\n> \n> Eh, I&#x27;m going to call BS on that.\n> \n> He should be less gimped, the villain mechanic was the only thing they changed about him and it took away a ton of power allocated elsewhere.\n\n^ THIS!!! They nerfed every part of him to justify giving him more power in his ult against the villain, which often is not the champ that should be being targeted in the team fights. All the knee-jerk reactions about his strength after rework involved this ult power that was very situational or from misunderstanding his damage because of all the hps/damage gear that was added to the game. He isn't so worthless late game now, but how many games go late, especially when you have a gimped champ that doesn't reach his spike until level 16?","replies":[]}]}]}]}]},{"poster":"Ralanr","date":"2016-11-08T15:51:01.929+0000","up_votes":13,"down_votes":0,"body":"Is Garen's power really cut because he's a beginner champion?  Because Poppy is the same price so...","replies":[{"poster":"Malicious Metal","date":"2016-11-08T15:52:04.876+0000","up_votes":32,"down_votes":1,"body":"price=/=beginner\n\nThere are 450 ip champs that are harder to pull off than 6300\n\nPrice is not an indicator for how hard/complex a champion is.","replies":[{"poster":"Ralanr","date":"2016-11-08T15:56:26.172+0000","up_votes":7,"down_votes":0,"body":"Fair enough.","replies":[{"poster":"EROTIC RAID BOSS","date":"2016-11-08T16:52:13.959+0000","up_votes":7,"down_votes":0,"body":"in fairness to you, originally that was probably the intention. but as the game has gone on and champions have changed and we have a better understanding of how to play them, some of the 450s, especially poppy and ryze, have become pretty high level champions","replies":[]}]}]}]},{"poster":"Sahn Uzal","date":"2016-11-08T15:54:48.637+0000","up_votes":30,"down_votes":0,"body":"Garen will be getting some love soon.\nThat doesn't mean Annie can't ... receive a nerf. \n\n_It's much harder to make jokes refering to getting nerfs about Annie. I don't want the ''why don't you take a seat over there'' meme replied to me :/_","replies":[{"poster":"Big Lincoln","date":"2016-11-08T15:56:31.857+0000","up_votes":26,"down_votes":4,"body":"why don't you seat a take over there","replies":[{"poster":"Sahn Uzal","date":"2016-11-08T16:01:51.796+0000","up_votes":17,"down_votes":1,"body":"I'm honestly dissapointed you didn't comment with the actual meme.\nThat's what I expected to happen.","replies":[{"poster":"TheHappyReaperz","date":"2016-11-08T16:12:07.394+0000","up_votes":30,"down_votes":0,"body":"https://ih1.redbubble.net/image.74198873.0413/raf,750x1000,075,t,fafafa:ca443f4786.jpg","replies":[{"poster":"RainbowIcee","date":"2016-11-08T17:32:47.363+0000","up_votes":8,"down_votes":0,"body":"I was gonna make a pedo joke but then i remember these boards are more toxic than the game.","replies":[{"poster":"DeathBot666","date":"2016-11-08T19:32:50.671+0000","up_votes":10,"down_votes":0,"body":"No that's the gamplay section.","replies":[]}]},{"poster":"Sahn Uzal","date":"2016-11-08T16:18:15.123+0000","up_votes":7,"down_votes":0,"body":"That's more like it!","replies":[]}]},{"poster":"ItsOrval","date":"2016-11-08T17:21:58.416+0000","up_votes":8,"down_votes":0,"body":"http://static.comicvine.com/uploads/original/11114/111144451/4135486-3572635671-Hanse.gif","replies":[]}]}]}]},{"poster":"Rivuo","date":"2016-11-08T16:05:16.277+0000","up_votes":13,"down_votes":8,"body":"lmao assassins arent allowed to burst people in 1 second but annie for some reason is","replies":[{"poster":"Verdade","date":"2016-11-08T17:22:39.973+0000","up_votes":19,"down_votes":3,"body":"lmao comparing immobile 500-range champion to most mobile champions with lots of active mitigation skills","replies":[{"poster":"Rivuo","date":"2016-11-08T18:19:47.075+0000","up_votes":3,"down_votes":6,"body":"> [{quoted}](name=Verdade,realm=EUNE,application-id=3ErqAdtq,discussion-id=q48VjmM8,comment-id=000a0001,timestamp=2016-11-08T17:22:39.973+0000)\n>\n> lmao comparing immobile 500-range champion to most mobile champions with lots of active mitigation skills\n\nYes she isnt mobile but in exchange she gets Ranged AOE burst damage while assassins are a bit more singular DPS. (Think fizz ult to annie ult, while its aoe its still not really able to compare)\n\nAlso in exchange she also gets to build {{item:3116}} {{item:3027}} {{item:3157}} {{item:3001}} {{item:3151}}{{item:3152}}  usually theres a 2-3 combination of those items per Annie game. \n\nShe gains massive survivability, and is actually anti-assassin. \n\nAlso there is something called flash and protobelt and ludens ( good movement speed ) ya know\n\nbut hey annies immobile so nobodys allowed to complain amiright.","replies":[{"poster":"Verdade","date":"2016-11-08T19:19:34.249+0000","up_votes":12,"down_votes":0,"body":"Yes, that seems op if you put it that way\nbut instead, compare her to other immobile mages:\n\nVel'koz has 3x as much range as annie, AOE TRUE DAMAGE BURST, extremely good kiting potential, more raw damage\nViktor... don't get me started. More range, more annoying \"pet\" ult, much better at zoning, consistent DPS\nLux has enormous range if slightly less raw damage. However she brings pick potential and extremely long-ranged ult\nSyndra has superior burst, raw damage, pick potential and almost double range\nBrand has % damage, much better range, extremely potent AOE damage, tank shredding....\n\nAnd to other immobile short range mages:\nVladimir is much tankier, heals back like lunatic, resourceless, AOE damage amp, untargetable... oh god why\nCassiopeia MUH DPS\n\nAlso, if enemy picks Annie you can just pick one of these \"I don't want to acknowledge your presence in lane\" champions such as Morgana, Galio or Sivir and just waveclear for days while Annie helplessly cries under her turret.","replies":[]}]}]},{"poster":"Ichiibaru","date":"2016-11-08T17:19:58.012+0000","up_votes":2,"down_votes":1,"body":"Unlike them, she doesn't have any sort of escape or utility.","replies":[{"poster":"dominusx","date":"2016-11-08T17:46:09.416+0000","up_votes":3,"down_votes":0,"body":"unlike them she usually has more than 3k hp with her items and the zhonya active plus the E dmg reduction\nwhere does she find the hp? her core build is this {{item:3027}} {{item:1001}} {{item:3152}} {{item:3116}} {{item:3157}} {{item:3089}} if you think 3k plus hp with the armor from zhonya and the active AND the fucking E isnt enough to keep her alive then you probably suck at annie and if you suck at annie you shouldnt be playing league. or any moba to be exact","replies":[{"poster":"Ichiibaru","date":"2016-11-08T18:07:18.649+0000","up_votes":1,"down_votes":2,"body":"I have 300k and the 7th rank on Annie. If that's how you bulid her - you're everything wrong.","replies":[{"poster":"Rivuo","date":"2016-11-08T18:22:51.519+0000","up_votes":14,"down_votes":1,"body":"> [{quoted}](name=Ichiibaru,realm=EUW,application-id=3ErqAdtq,discussion-id=q48VjmM8,comment-id=000a000000010000,timestamp=2016-11-08T18:07:18.649+0000)\n>\n> I have 300k and the 7th rank on Annie. If that&#x27;s how you bulid her - you&#x27;re everything wrong.\n\nJust because you have 300k on a champ doesnt mean you magically know everything about that champ bud.\n\n\nIf you look at Annie bot ( someone whos challenger and one tricks annie )\n\nhttp://www.lolking.net/guides/188692\n\nThen you'll see that 3 of those items he listed are absolute Core on Annie, and the other 2 are common after the core items.\n\nSo no, Hes not wrong.\n\nYou are.","replies":[]}]}]},{"poster":"Guiboulou","date":"2016-11-08T17:24:16.915+0000","up_votes":4,"down_votes":2,"body":"AoE stun","replies":[{"poster":"Pikmints","date":"2016-11-08T17:29:09.580+0000","up_votes":4,"down_votes":0,"body":"Don't forget the part where the stun is instant and can be up again in 8 seconds without cdr.","replies":[]}]}]}]},{"poster":"GarthBrooksIV","date":"2016-11-08T15:58:48.140+0000","up_votes":14,"down_votes":5,"body":"Maybe its so low because beginners play him more often than experienced players?","replies":[{"poster":"Sire Hippington","date":"2016-11-08T17:49:32.188+0000","up_votes":12,"down_votes":0,"body":"the winrate is for plat+, one would asume people at plat are no longer 'beginners'","replies":[]}]},{"poster":"rG Thundrag","date":"2016-11-08T17:53:09.603+0000","up_votes":11,"down_votes":0,"body":"Theres dozens of ways to bring back garen to a reasonable state.\nMaking his w cap scale higher by increasing the cap for every point in W. Infinite scaling could work but skeptical on that one.\nReturning his tenacity is also an option.\n\nSome people have stated how atrocious his early game is due to his spin dealing beyond mediocre damage early game you gain roughly 14 damage or less for leveling it and that is over 3s pre level 10. Merely adding something like 8/10/12/14/16 base damage to his tick damage would bring him up to speed early. \nFor general math this would add 40/50/72/98/112 damage over 3s if you put a point in e at every opportunity\n\nHis ms has been nerfed in multiple ways by losing 5 on base and 5% boost on Q. These could always be reverted since dead mans has long been nerfed.\n\nThe Rylais meta also hasn't helped him much with his slow cleanse not helping him deal with anything since he is being slowed at every moment.\nI'm skeptical on this but if Garen's Q instead of removing slows made him immune to slows for the first 1s of Q to prevent mass re-application of slows he'd be a LOT better overall.\n\nIf he got even only 1-2 of these changes he'd improve considerably","replies":[]},{"poster":"Big Lincoln","date":"2016-11-08T15:55:38.501+0000","up_votes":11,"down_votes":0,"body":"garen has literally zero mechanics in his kit and Riot added a gimmick instead of doing anything thatd help \n\nthat said I predict he will benefit from several of the itemization changes next patch, but something like letting spin stack new Fervor would be very choice IMO","replies":[]},{"poster":"The Yetii Rider","date":"2016-11-08T19:55:29.527+0000","up_votes":1,"down_votes":2,"body":"Malicious you know the answer to this.\n\nGaren is weak because of the prevalence of Rylai's Crystal Scepter. There's no point in buffing him when they're going to nerf the item that's keeping him down.","replies":[{"poster":"Junkο","date":"2016-11-08T20:26:10.135+0000","up_votes":11,"down_votes":0,"body":"Garen was weak way before Rylai became broken.","replies":[]}]},{"poster":"Critmaster Garen","date":"2016-11-08T17:17:40.130+0000","up_votes":9,"down_votes":0,"body":"imo they should have taken a look at him when they removed boot enchants on the mage update. they just removed a very impactful element from the game without ever really dealing with the consequences that had on a lot of champions actually.\n\nsame, when they nerfed his items over and over throughout the season.\n\nbut since they already waited so long and the season is over anyways, id rather wait 2 or 3 patches for them to buff him according to all the new overpowered preseason shit. so he doesnt get buffed right now, then they release the preseason patch and hes right back in the dumpster.","replies":[]},{"poster":"Chamuel85","date":"2016-11-08T15:59:34.428+0000","up_votes":10,"down_votes":3,"body":"When did Riot say they are keeping Garen weak because he's beginner?","replies":[{"poster":"Verdade","date":"2016-11-08T17:26:25.089+0000","up_votes":9,"down_votes":1,"body":"They did not, they are keeping Garen weak because he's literally ball of stats","replies":[]}]},{"poster":"Off Meta Evan","date":"2016-11-08T17:03:45.869+0000","up_votes":9,"down_votes":1,"body":"agreed. i have to run {{item:3142}} {{summoner:6}} {{item:3742}} right now if i want to not get kited into the ends of the earth by the {{champion:236}} or {{champion:51}} and even then it feels like i'm just picking a more fun but less useful alternative to {{champion:58}}","replies":[]}]}