{"poster":"Malicious Metal","date":"2015-09-19T18:05:54.705+0000","title":"Okay, the more I think about it the dumber it gets (Mordekaiser's W ^^'')","subforum":"Gameplay","up_votes":24,"down_votes":7,"body":"After playing around with Mordekaiser post 5.18 I&#039;ve come to the conclusion that there&#039;s no valid excuse to NOT make Mordekaiser get the damage AoE from his Harvester if not standing right next to an ally.\r\nWith the removal of &quot;Metallic Mastery&quot; the ability got a lot weaker, heck it&#039;s literally only half as strong and yet has such a ridiculous condition to be fulfilled in order to get the full potential.\r\nIt was nerfed quite a bit and it really isn&#039;t powerful enough to have such a dumb restriction to it and I just can&#039;t find ANY reason to make it such a conditional spell. \r\nGiving him access to the full spell would be quite nice for us Solo lane MordHue&#039;s and allow Riot to add some more Metal effects into it (Rito pls!)\r\nBecause as of now you can&#039;t push by yourself and the ability&#039;s damage doesn&#039;t justify the lack of availability.\r\n\r\nBut that might just be my Mordekaiser bias, maybe YOU can tell me why he can&#039;t have the bloody thing :)","replies":[{"poster":"Prospector Pete","date":"2015-09-19T18:13:32.772+0000","up_votes":8,"down_votes":0,"body":"Rito's weird","replies":[{"poster":"Malicious Metal","date":"2015-09-19T18:23:56.459+0000","up_votes":10,"down_votes":1,"body":"Nonono. You're not weird when you're rich.\nYou're eccentric!","replies":[]}]},{"poster":"Kelg","date":"2015-09-19T23:11:39.788+0000","up_votes":5,"down_votes":0,"body":"Riot wants Mordekaiser to be a super minion when he's alone.","replies":[{"poster":"Dextix LT","date":"2015-09-20T03:33:03.544+0000","up_votes":3,"down_votes":0,"body":"Need to force down that bot morde down our throats eh?","replies":[]}]},{"poster":"The Yetii Rider","date":"2015-09-20T01:33:27.871+0000","up_votes":2,"down_votes":0,"body":"They don't want Mordekaiser to be able to push the lane anymore. (Just like how the Gragas rework removed his poke/burst).","replies":[{"poster":"Dextix LT","date":"2015-09-20T03:33:44.196+0000","up_votes":4,"down_votes":0,"body":"Wrong, they dont want mordekaiser to ever play solo anymore.","replies":[]}]},{"poster":"G1Radiobot","date":"2015-09-20T01:56:46.351+0000","up_votes":4,"down_votes":0,"body":"To all those that claim Morde kept his identity, he's completely lost his ability to wave clear well, which to me was something that was part of his identity.","replies":[]},{"poster":"starly135","date":"2015-09-19T21:24:21.117+0000","up_votes":4,"down_votes":0,"body":"I agree it feels weird, I made another post a few days back because honestly I thought it was a bug. In reply on that post someone said \"It makes him feel a bit weird, almost unfinished\" and I'm inclined to agree with him.","replies":[]},{"poster":"stuartk11","date":"2015-09-19T21:55:01.563+0000","up_votes":3,"down_votes":0,"body":"There was a thread kicking around yesterday that had the math for the damage and healing (including scaling) of Mordekaiser's new W. It was quite in-depth, and I wish I had bookmarked it now. But overall, if you don't use Mordekaiser's heal against enemy champions, it doesn't even heal. With the introduction of a scaling health cost, the drop down to 25% damage against minions, and the reduction of maximum units hit down to 2, the health you gain doesn't even outweigh the health cost. The new W is hilariously laughable for solo lane Mordekaiser, because you also lose access the DoT aura it has aswell. I'm amazed by how much this change missed the target by, and I hope Riot feel that they can rectify this error at some point this year.","replies":[{"poster":"Dextix LT","date":"2015-09-20T03:34:57.120+0000","up_votes":3,"down_votes":0,"body":"Rito, fixing reworks? Mate, cassiopeia players are STILL waiting for her to be fixed after her abysmall rework.","replies":[{"poster":"WarlockLaw","date":"2015-09-20T06:18:15.662+0000","up_votes":1,"down_votes":1,"body":"The fix their reworks. They occasionally do new reworks to fix old ones, just look at Evelyn or Skarner.","replies":[{"poster":"Dextix LT","date":"2015-09-20T11:42:59.300+0000","up_votes":2,"down_votes":0,"body":"Oh evelyn? With that passive that makes her impposible to balance properly? Those \"reworks\" surely fixed her. And skarner was fixed? Im sorry, have you seen what happened to skarner before he was made op?\n\nAlso, if they fix their reworks, please explain cass.","replies":[{"poster":"WarlockLaw","date":"2015-09-21T04:08:45.744+0000","up_votes":1,"down_votes":0,"body":"Should have put fix in quotes, my point is give it a few months/years and we will get a new morde rework. Skarner and eve have both had a few","replies":[]}]}]}]}]},{"poster":"Matezoide","date":"2015-09-20T01:34:20.349+0000","up_votes":2,"down_votes":0,"body":"You never answered me :<\n\nDid they seriously remove even more metal out of W's particles?","replies":[]},{"poster":"Narasimha","date":"2015-09-20T00:43:01.627+0000","up_votes":2,"down_votes":0,"body":"My guess is that they're leaving it weak because they've shifted ALL the damage onto his Q. Unless that damage gets moved, it's unlikely he'll get an major damage buffs elsewhere.","replies":[]},{"poster":"Goodnight Nunu","date":"2015-09-19T22:17:54.145+0000","up_votes":2,"down_votes":0,"body":"Even if it wouldn't make him much stronger, it would make Mordekaiser actually feel like a complete champion again.\n+1","replies":[]},{"poster":"Galeo","date":"2015-09-19T18:07:29.108+0000","up_votes":3,"down_votes":1,"body":"Because of the Lulz","replies":[]},{"poster":"Mordepool","date":"2015-09-20T16:58:45.744+0000","up_votes":1,"down_votes":0,"body":"History of the patch.\nRiot unlocks CertainlyT, doesn't check on his work. Launches garbage. Goes in save face mode. Gives back W. hopes noone noticed they fucked up big","replies":[]},{"poster":"TenSlashTen","date":"2015-09-20T13:51:24.941+0000","up_votes":1,"down_votes":0,"body":"what they need to do is gut the fuck out of his Q or the dragon.\n\nYOU CAN TANK A FULL TURRET FROM FULL HEALTH AND KILL IT WITH 1 DRAGON AT LEVEL 6\nWHAT THE FUCK \n\n\nI JUST did it like yesterday with a mord on my team.\n\nLevel 6\nWe all went bot ulted drag and tanked full to dead turret no minions.\n\nIt's so broken!\nThe fact that it got past even alpha phases is beyond me.\n\nRiot's balance makes me sick, so many overloaded bullshit ideas now a days it's just...\n*throw's hands up* ok I give up.","replies":[]},{"poster":"Beertaster","date":"2015-09-20T02:40:51.150+0000","up_votes":1,"down_votes":0,"body":"Riot isn't going to change it because they want morde adc.","replies":[]},{"poster":"Alleo","date":"2015-09-20T01:39:59.468+0000","up_votes":1,"down_votes":1,"body":"That's why I've resigned myself to playing duo bot mord when I have a premade duo partner.  He's no fun to play solo period right now unless you get super fed and can 1v3 (2v3 if you count the dragon) late game and most of the time that only happens if you play him duo bot with a high cc/hook support or get babysat by the jungler to get fed.  While I do think they need to nerf his Q's third hit late game damage (I'm looking at you triforce only for damage builds), he definitely needs some sort of fix to his W to allow for solo lane. The reactivation damage doesn't do anything when you're by yourself and while you still have plenty of waveclear with your Q and E, being limited to 2 skills and an ult that doesn't do much if you already can't 1v1 early game makes early game horrible.","replies":[]},{"poster":"HighH1","date":"2015-09-20T05:50:58.874+0000","up_votes":1,"down_votes":2,"body":"{{champion:82}} needs wards to watch out for ganks~~~~ incoming double kills\n\nBut before he needed a bitch boy to be next to him for his W now he gets it just by himself so his enemies can witness all his spells","replies":[]},{"poster":"SwordGrunt","date":"2015-09-20T02:36:29.929+0000","up_votes":1,"down_votes":2,"body":"Morde does not need buffs as a solo laner, and probably not as a duo laner (I haven't played him as a duo laner as much as I have as a solo laner)\n\nHis W is fine as it is for the self-cast. It's not too good but 70 health when you're in melee range if your opponent is pretty significant.","replies":[]}]}