{"poster":"Malicious Metal","date":"2016-12-13T12:55:34.841+0000","title":"With all the talk about mini-reworks Riot seems to forget an obvious candidate","subforum":"Gameplay","up_votes":175,"down_votes":34,"body":"{{champion:157}}","replies":[{"poster":"Goodnight Nunu","date":"2016-12-13T12:57:31.603+0000","up_votes":102,"down_votes":6,"body":"Expected Mordekaiser.\nWas pleasantly surprised.","replies":[{"poster":"Melledoneus","date":"2016-12-13T16:40:28.218+0000","up_votes":40,"down_votes":0,"body":"Expected Shenpai Hentai.\n\nWas disappointed.","replies":[{"poster":"LordSirChipmunk","date":"2016-12-13T23:20:05.929+0000","up_votes":1,"down_votes":0,"body":"Wait, is Shen not viable or something?   (_is confused._)","replies":[{"poster":"Melledoneus","date":"2016-12-13T23:33:35.700+0000","up_votes":8,"down_votes":0,"body":"Look at the username of the person I replied to.\n\nI'm sure you can put 2 and 2 together at that point.","replies":[{"poster":"LordSirChipmunk","date":"2016-12-14T01:37:23.726+0000","up_votes":4,"down_votes":0,"body":"So... This handsome man over here is Shenpai, a Shen main? (_is astounded and astonished_)","replies":[{"poster":"Melledoneus","date":"2016-12-14T01:39:01.248+0000","up_votes":6,"down_votes":0,"body":"Your innocence is warming my heart.","replies":[]}]}]}]},{"poster":"Sun Wu Ryuumoku","date":"2016-12-14T03:11:40.313+0000","up_votes":1,"down_votes":0,"body":"Hentai.. u mean {{champion:420}}","replies":[{"poster":"Melledoneus","date":"2016-12-14T03:15:11.010+0000","up_votes":1,"down_votes":0,"body":"No I'm not into that pls stop","replies":[{"poster":"Velzard of Koz","date":"2016-12-14T16:40:51.063+0000","up_votes":1,"down_votes":0,"body":"{{champion:161}} No... You're coming with us","replies":[{"poster":"Melledoneus","date":"2016-12-14T17:27:00.491+0000","up_votes":1,"down_votes":0,"body":"*Is getting dragged away*\n\nNOOOOOOOOOOOOOO!","replies":[{"poster":"Velzard of Koz","date":"2016-12-14T17:55:27.061+0000","up_votes":2,"down_votes":0,"body":"Look at my tentacles\nMy tentacles are amazing\nGive it a lick\n\nEww... it tastes just like disintegration\n\nGet on my tentacle\nI'll take you around the void and all the other places too","replies":[]}]}]}]}]}]}]},{"poster":"Sahn Uzal","date":"2016-12-13T13:03:55.448+0000","up_votes":55,"down_votes":2,"body":"A few things that would go a long way when it comes to reducing the frustration he causes, and making him a lot healthier as a champion would be:\n\n- Increase the cooldown on his E in the early game by a respectable amount so people can react to him in the laningphase\n- Remove the ''if at all possible, Yasuo's ultimate will place him outside of tower range'' bullshit, especially now that he's not building completely glass cannon\n- Make it so he can only ult off his own knockup. Why?\n\n> Unlike Assassins, Skirmishers aim to shred through any nearby enemy that approaches. **Because Skirmishers lack high-end burst damage or reliable ways of closing in on high-priority targets**, they are instead armed with situationally powerful defensive tools to survive in the fray, along with extreme sustained damage to cut down even the most durable targets.\n\nthe fact that allied abilities make his ultimate so reliable takes away a big weakness of a Skirmisher.\n\n---\n\nHe'd probably get some compensation buffs, but I think it would do a lot of good in the long run","replies":[{"poster":"Touch My Box","date":"2016-12-13T13:30:42.691+0000","up_votes":26,"down_votes":2,"body":"> [{quoted}](name=Tidal Tyrant,realm=EUW,application-id=3ErqAdtq,discussion-id=aYPiPQFA,comment-id=0003,timestamp=2016-12-13T13:03:55.448+0000)\n>\n> A few things that would go a long way when it comes to reducing the frustration he causes, and making him a lot healthier as a champion would be:\n> \n> - Increase the cooldown on his E in the early game by a respectable amount so people can react to him in the laningphase\n> - Remove the &#x27;&#x27;if at all possible, Yasuo&#x27;s ultimate will place him outside of tower range&#x27;&#x27; bullshit, especially now that he&#x27;s not building completely glass cannon\n> - Make it so he can only ult off his own knockup. Why?\n> \n> the fact that allied abilities make his ultimate so reliable takes away a big weakness of a Skirmisher.\n> \n> ---\n> \n> He&#x27;d probably get some compensation buffs, but I think it would do a lot of good in the long run\n\nI like that last point.\n\nIn eras long forgotten, {{champion:34}}  Frostbite used to proc the double damage from Nunu snowball and Ashe slow. They said \"synergy was too good, nerf so only anivia can cause the proc\"\n\nFast forward to the current season, Yasuo can get all the benefits of everyone else, despite getting everything else handed to him.","replies":[{"poster":"Academy Kayn","date":"2016-12-13T15:50:33.626+0000","up_votes":11,"down_votes":3,"body":"I'm playing Devil's Advocate here, but Yasou doesn't even have access to his own ult, unlike Anivia's Frostbite which she always has access to, but only gets the bonus effect IF she gets the Frozen debuff. Anivia has two ways of applying her own debuff, Yasou only has one, and MAYBE more if his team comp is agreeable (and we all know that those who play Yasou could care less about Team Comps)","replies":[{"poster":"Ahristocats","date":"2016-12-13T16:05:38.196+0000","up_votes":4,"down_votes":1,"body":"anivia nevers uses her E without a frost effect\nnever is a big word but basically 98% of the time she will wait her ulti/Q \n\nand with the new patch her gameplay even changed more, now she uses ulti W to keep you in ulti and then E\nnever saw an anivia using her E without a frost effect","replies":[{"poster":"Academy Kayn","date":"2016-12-13T16:09:15.765+0000","up_votes":1,"down_votes":0,"body":"But she can still use it regardless. Sure, it ain't the best choice, but it still does decent damage and can secure a last minute trade.","replies":[{"poster":"Ahristocats","date":"2016-12-13T16:16:04.719+0000","up_votes":2,"down_votes":0,"body":"sure, let yasuo uses his ulti without knock ups, while making it doing 1/2 of the damage, duration of knock up reduced by 1/2, and armor penetration is reduced by 1/2\n\nno yasuo player will use it without a knock up","replies":[{"poster":"Narasimha","date":"2016-12-13T16:55:38.302+0000","up_votes":6,"down_votes":0,"body":"Kind of defeats the purpose though. Theres a huge difference between 'Use when ideal' and 'Can't use unless'. Yasuo's ult is strong because it has a unique limiter.","replies":[]}]}]},{"poster":"I Q","date":"2016-12-13T19:47:38.422+0000","up_votes":1,"down_votes":0,"body":"Anivia E is on a short CD, and has TWO ways to proc it in her kit, one is basically impossible to miss. (A little hard now, since the change but still so)\n\nYasuo Q has a much longer CD then Anivia Q/Ult together and it also needs to be stackup up, which means you need to prepare before a fight starts to get the most use.\n\nAnivia's E does the damage of a normal ability if she uses it normally. However, it can deal twice the damage of a normal ability if the condition is hit. If you use Anivia as an example, Yasuo's ult should deal average damage on the ult PER PERSON (Which his damage is already pretty low compared to others) and double otherwise.\n\nAnother thing, Anivia is safe when she uses her E, Yasuo is in danger when he ults.","replies":[{"poster":"Nameless Voice","date":"2016-12-13T21:18:13.177+0000","up_votes":2,"down_votes":0,"body":"I think you mean Anivia's ult/e, since Anivia's Q alone has the same cooldown as three of Yasuo's Qs at rank 1(which she generally keeps until level8) and that's before he gets attack speed to lower it further, which he will get far sooner than Anivia will get CDR.)\n\nAs for \"danger\", I think Yasuo's massive shield (especially late-game) makes him much safer than he appears.","replies":[]}]}]}]}]},{"poster":"MagicFlyingLlama","date":"2016-12-13T20:43:43.909+0000","up_votes":6,"down_votes":0,"body":"Making him only able to ult off of actual knockups (seriously, how does he ult off of stuff like vayne E?) instead of all forms of displacement would encourage synergy picks and thought instead of him simply mashing R any time an ally hard CCs someone.\n\nIt would make sense if it only worked off of specific abilities that visibly knock a champion a good distance off the ground for more than 0.125 seconds: {{champion:40}} {{champion:267}} {{champion:163}} {{champion:12}} {{champion:201}} {{champion:54}} , but not stuff like {{champion:254}} {{champion:57}} {{champion:78}} {{champion:412}} {{champion:18}} ","replies":[]}]},{"poster":"Kindlejack","date":"2016-12-14T01:57:54.650+0000","up_votes":37,"down_votes":1,"body":"So it seems the M in M. Night Shyamalan stands for Malicious...","replies":[{"poster":"Malicious Metal","date":"2016-12-14T02:04:14.379+0000","up_votes":19,"down_votes":0,"body":"http://iruntheinternet.com/lulzdump/images/gifs/M-Night-Shyamalan-long-name-forever-amamlamlmalmama-1361619882q.gif?id=","replies":[]},{"poster":"Zedex","date":"2016-12-14T18:33:18.287+0000","up_votes":2,"down_votes":1,"body":"I love how the Red comment on this thread is just a joke post..","replies":[{"poster":"Kindlejack","date":"2016-12-16T06:27:30.974+0000","up_votes":9,"down_votes":0,"body":"I ban Yasuo every game I play, as an artist that's all I can do.\n\nhttp://i.imgur.com/cMfkFGP.gif","replies":[{"poster":"Zedex","date":"2016-12-16T16:15:31.778+0000","up_votes":2,"down_votes":1,"body":"b-b-but he's not overpowered! \n\n\n\n\n\n\n\nOr is he..? \n\n\nSeriously though, everyone hates playing against him, but as a Yasuo player I find him manageable when I play against him. You should try him out, and practice him. You'll learn his weaknesses a lot better this way, and who knows, it might help when you eventually have to face the wind. \n\n\"Dying's the easy part.\" {{champion:157}}","replies":[{"poster":"Kindlejack","date":"2016-12-16T20:56:50.409+0000","up_votes":3,"down_votes":0,"body":"I like your positive attitude!","replies":[]}]}]},{"poster":"TequilaZombie","date":"2016-12-14T20:44:36.502+0000","up_votes":2,"down_votes":0,"body":"Just like our hopes that Yas will be reworked","replies":[]}]},{"poster":"Chad Te Employee","date":"2016-12-14T02:00:39.082+0000","up_votes":1,"down_votes":8,"body":"pretty sure it's manoj","replies":[{"poster":"Electro522","date":"2016-12-14T02:31:01.331+0000","up_votes":6,"down_votes":1,"body":"The Joke ---->\n.\n.\n.\n.\n.\n.\n.\n.\nYour head.","replies":[]}]}]},{"poster":"Envoy of Death","date":"2016-12-13T15:27:57.823+0000","up_votes":31,"down_votes":0,"body":"expect new ryze rework first","replies":[{"poster":"Melledoneus","date":"2016-12-13T16:43:00.959+0000","up_votes":4,"down_votes":1,"body":"This time, his ult gives him 50% bonus magic pen! It's never been done before!","replies":[]}]},{"poster":"Miku Append","date":"2016-12-13T13:35:21.677+0000","up_votes":28,"down_votes":5,"body":"https://i.imgflip.com/z3w70.jpg\n\nIn all seriousness, they need to re-do his passive and remove his shield. ","replies":[]},{"poster":"Giga Kahuna","date":"2016-12-13T16:45:04.634+0000","up_votes":1,"down_votes":9,"body":"http://nexus.leagueoflegends.com/2016/12/ask-riot-yasuos-last-breath/\n\nhow can you whine about yasuo needing to be nerfed when riot said yasuo is going to be nerfed","replies":[{"poster":"Malicious Metal","date":"2016-12-13T16:51:47.913+0000","up_votes":23,"down_votes":2,"body":"Rework=/=nerf","replies":[{"poster":"Giga Kahuna","date":"2016-12-13T17:23:58.864+0000","up_votes":3,"down_votes":18,"body":"then what's so inherently broken about yasuo that simple nerfs wouldn't fix him\n\nhe's a fun character with a decent skill cap, it's not like they haven't hit him with nerfs that hurt him before","replies":[{"poster":"Slythion","date":"2016-12-13T17:50:09.136+0000","up_votes":18,"down_votes":2,"body":"dude, you need to actually *read* people's comment before replying:\n\nMM: \"rework this guy\"\n\nYou: \"why do you say you want him nerfed, he's already getting nerfed\" (which is not related to MM's statement)\n\nMM: \"a rework does not mean a nerf\"\n\nYou: \"but there's nothing strong about yasuo (broken = strong) that a nerf couldn't fix. It's not like he hasn't been nerfed before\"\n\nEven in your last reply, you continue talking about nerfs when it was already stated that no one was talking about nerfs. The only relevant thing you said this entire time has been:\n\n> he's a fun character with a decent skill cap\n\nwhich is a *very* unpopular opinion, although you are still entitled to it. But please, stop talking about nerfs when we're talking about reworks. They are two very different things","replies":[{"poster":"Giga Kahuna","date":"2016-12-13T18:13:19.126+0000","up_votes":2,"down_votes":14,"body":"then wtf\n\nif yasuo doesn't need to be nerfed why does he need to be reworked\n\nwhat's so inherently \"unhealthy\" about yasuo that deems him rework worthy rather than just slapping a few nerfs onto him","replies":[{"poster":"Velzard of Koz","date":"2016-12-13T18:36:43.038+0000","up_votes":4,"down_votes":2,"body":"What's broken should be nerfed.\nWhat's unhealthy should be reworked.\n\nFor example, a passive on champ that is supposed to be strong early that gives him nearly 0 significant effect early, but becomes of broken proportions (1k Health shield, 1k true damage) very late into game is not literally broken, since it does have the weak window. But factors that the champ shouldn't be strong lategame as well AND that the passive is useless to you unless enemies give you lategame make it unhealthy (feast or famine).\n\nA nerf to such passive would make it even more irrelevant early game and fine lategame. A rework might change it or replace it to make the champion overall more healthy, so that they aren't strong or weak.","replies":[{"poster":"Atanchan","date":"2016-12-13T20:45:41.350+0000","up_votes":12,"down_votes":0,"body":"Shouldn't it be \"what's overly strong should be nerfed, what's broken should be fixed, what's unhealthy should be reworked?\"\n\nBecause broken better implied something that just doesn't work the way it's supposed to. Like, say, a ratio being ten times as powerful as it should be because someone forgot a zero in a single part of the code.","replies":[{"poster":"Velzard of Koz","date":"2016-12-13T22:51:04.622+0000","up_votes":1,"down_votes":1,"body":"That's a bug really.","replies":[{"poster":"Atanchan","date":"2016-12-13T23:27:32.758+0000","up_votes":1,"down_votes":0,"body":"Yes, a something that's broken is bugged. That's the point I was making.","replies":[{"poster":"Velzard of Koz","date":"2016-12-13T23:30:22.641+0000","up_votes":2,"down_votes":0,"body":"Well, the word itself, however, is not used in that context much on Boards.\nWhen they discovered the weird interaction of Riven dashield and CC displacement, most people I saw weren't talking much about her being broken. They however do say that If she does more damage than they think she should, however as part of intended number.","replies":[]}]}]}]}]},{"poster":"LatetotheRace","date":"2016-12-13T18:23:17.155+0000","up_votes":6,"down_votes":0,"body":"A rework would give him a more healthy kit which can be easier to tweak. Right now if you tweak anything on Yasuo he becomes incredibly overbearing or underwhelming. (The latter hasn't really happened yet.)","replies":[]}]}]}]}]}]},{"poster":"Nameless Voice","date":"2016-12-13T13:34:39.483+0000","up_votes":6,"down_votes":0,"body":"Something which Ghostcrawler posted today:\n\n> There are champs that we are still trying to solve, say Yasuo and Kallista and Yi. We talk about them all of the time. I don’t know if they need a rework as much as some surgical pruning. It still feels more like the Kat level of update than the Poppy level though.\n\nhttp://askghostcrawler.tumblr.com/post/154401884743/it-feels-like-theres-a-philosophy-at-riot-that\n\nIt's good to hear that they actually *are* talking about him, even if they generally keep silent about it.","replies":[{"poster":"DunkinNoobs","date":"2016-12-13T14:19:23.358+0000","up_votes":15,"down_votes":2,"body":"Even if Riot does change him, it won't be in a way that satisfies his haters.","replies":[{"poster":"Academy Kayn","date":"2016-12-13T16:10:18.154+0000","up_votes":13,"down_votes":2,"body":"I don't think Riot could ever satisfy haters honestly.","replies":[]}]},{"poster":"Bardful","date":"2016-12-13T16:27:29.782+0000","up_votes":6,"down_votes":3,"body":"Why no mention of blitzcrank he is way worse than even yasuo. Before everyone hates me on this one:\n\n1. He only has to land 1 in 12 hooks to be relevant during laning phase\n2. He is tanky so no punishment for failing anything and his w plus range of his q does not help (nautilus would get punished for lack of escape, thresh too, etc. as their hooks bring them closer too)\n3. He is one of (if not the) easiest champ in the game unlike, yasuo which after at least requires something.\n4. He is http://na.op.gg/champion/statistics according to the panel on the right really good win rate with really high picc rate.\n5. He can roam, or stay in lane or do whatever he wants so you don't have to make many decisions just do whatever you want.\n6. As a support, one q puts someone with you and your adc from their side so, it is really good for soloque where you couldnt communicate say a thresh hook.","replies":[]}]},{"poster":"Zachawyy","date":"2016-12-13T17:54:06.862+0000","up_votes":13,"down_votes":1,"body":"I have a strong feeling when Yasuo does get a mini-rework, people are still gonna be complaining about him. Like, I don't want to sound biased or anything but, I don't think it's just primarily Yasuo that's the issue here. I also think that, a lot of the people that have complained about Yasuo as of lately about him being too    broken, too overpowered etc. just don't know how to play against/around him.","replies":[]},{"poster":"Big Lincoln","date":"2016-12-13T14:09:08.787+0000","up_votes":9,"down_votes":0,"body":"\"mini rework\" just means \"mordekaiser him\" i'm sure","replies":[]}]}