{"poster":"Delsaco","date":"2016-09-30T21:07:43.353+0000","title":"Por que los adc no se meten pen armor????","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hace ya mucho que no juego adc, pero recuerdo que casi siempre compraba de tercer &iacute;tem pen amor y casi todo el mundo hacia o mismo, buil por el estilo:\n\nprimero espad&oacute;n despu&eacute;s botas despu&eacute;s terminaba el &iacute;tem de espad&oacute;n onda filo, sanguinaria o cegador, despu&eacute;s un &iacute;tem de velocidad y critico y despu&eacute;s pen armor.\n\nEn mi opini&oacute;n la labor del adc es bajar los tanques (pokear) aparte de meter el da&ntilde;o por segundos y todo ese jaleo.\n\nPero ahora me exra&ntilde;a que se meten dos &iacute;tem de espad&oacute;n filo y espad&oacute;n o segador y espad&oacute;n, osea se meten puro da&ntilde;o que es lo que pasa que solo da&ntilde;o sin pen armor si hay mas de dos tanque terminan no cumpliendo la funci&oacute;n de pokear porque les meten super poco da&ntilde;o.\n\nNO SE SI ESTARE EQUIVOCADO PERO CASI SIEMPRE VEO QUE LOS ADC QUE USAN LA BUILD ANTIGUITA SACAN MEJORES RESULTADOS Y HACEN MAS DIFERENCIA QUE ESTA NUEVA BUILD DA&Ntilde;O....\n\nalguien ME EXPLICA PORQUE SE USA ESTO O ES QUE SE ARMAN MAL NADA MAS. \n\n\"como comentario final no se para que rushear sanguinaria si es tan mala jajajajajjajaj.... después del cambio no se la pongo a niingun campeón es una mierr........ ese escudete de ahorita\"","replies":[{"poster":"Rehrs","date":"2016-09-30T23:10:10.680+0000","up_votes":1,"down_votes":0,"body":"muchos adc se arman a base de pen armor xDDDDDDDDD{{champion:119}} {{champion:202}} {{champion:236}} {{champion:21}}","replies":[]},{"poster":"DanielGarrita","date":"2016-09-30T21:57:21.959+0000","up_votes":1,"down_votes":0,"body":"{{item:3142}}  {{item:3147}}  no se, cada vez esta mas de moda estos items entre los adc. y pegan bastante ademas.","replies":[]},{"poster":"Runth","date":"2016-09-30T21:25:36.590+0000","up_votes":1,"down_votes":0,"body":"{{item:3142}}  {{item:3153}} {{item:3033}} {{item:3071}}","replies":[]},{"poster":"Mr Bard Times","date":"2016-09-30T21:12:55.750+0000","up_votes":1,"down_votes":0,"body":"Porque {{item:3036}} funciona con el bono de armadura, por lo que de 3º objeto no es bueno ya que la gran mayoria no tiene mucha armadura adicional.","replies":[{"poster":"Delsaco","date":"2016-09-30T21:14:39.145+0000","up_votes":1,"down_votes":0,"body":"mmmm puede ser pero de cuarto da igual el hehco es que no entiendo el hehco de meterte la sanguinaria es mucho mejor rey arruinado por ultimo.... ese escudete apesta....","replies":[]}]},{"poster":"Hwaxinghz","date":"2016-09-30T21:12:44.401+0000","up_votes":1,"down_votes":0,"body":"Yo siempre armo primero Espadón, Botas, Filo/Saqueador, Huracán/Statik, Rey/Dominick/Recordatorio. Con eso bajas a los tanques, muchas veces hago Rey Arruinado y Lord Dominick juntos si llegan a tener muchos tanques (3 o más). Lo que he visto mucho es Armarse un Filo, Botas, Statik, Bailarín, Cañón y Sanguinaria, con un montón de crítico, igual se bajan a los tanques relativamente rápidos pero con algo de Armadura (onda más de 300 a lo Rammus) es imposible de bajar con esa build y si le dices que vendan el cañón y que se arme un Lord Dominick o cosas así, te putean y se van afk.","replies":[]},{"poster":"faster51","date":"2016-09-30T21:12:18.724+0000","up_votes":1,"down_votes":2,"body":"a mi no me afecta esto, no juego adc","replies":[]}]}