{"poster":"Delsaco","date":"2017-11-10T17:24:07.178+0000","title":"Aumentaron lo requisitos del pc o hay probemas con el parche?? baja de fps???","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Saludos:\n\nAntes de este parche el juego me corria full a 110 fps con este parche  me bajo cacsi 40 fps menos...\n\nQue paso??? parche aun mal optimizado o se aumentaron lso requisitos del sistema...????{{sticker:slayer-jinx-unamused}}\n\nSi es asi aumentaron BASTANTE LOS REQUISITOS... MUCHA GENTE QUE LO CORRIA JUSTITO DEJARA DE JUGAR!!!! mala idea RIOT!!!!!\n\nes mala idea pedir tanto pc para este juego... la gente se va ir a juegos mas espectaculares gráficamente si pides tanto pc....!!!\n\nUNA DE LAS VIRTUDES DE ESTE JUEGO APARTE DE TODO LO OTRO BUENO QUE TIENE ES QUE CORRE MUUUUUUY BIEN EN PC DE GAMMA MEDIA Y SI A MI CON ESTE LAPTOP GAMMA ALTA ME CORRE ASI.... NO QUIERO SABER COMO ESTAN LOS OTROS PLAYERS....!!!!\n\ntienes que pensar riot que la gente que juega lol es principalmente usuarios de laptops.. la gente que arma tarros créeme no es muy fanática de tu juego....!\n\nCOMO SE DICE VULGARMENTE \n> _TE FUISTE AL PUERCO_!!! MINIMO AVISAR A LA GENTE QUE ESTO IBA A PASAR!!!","replies":[{"poster":"Hendrix","date":"2017-11-10T18:09:22.126+0000","up_votes":1,"down_votes":0,"body":"yo juego a 55 o 60 \"normales\" y en los picos de carga grafica (tf, baron, dragon) cae a 15 o 20, durisimo de manejar","replies":[]},{"poster":"Daiienz99","date":"2017-11-10T18:01:15.944+0000","up_votes":1,"down_votes":0,"body":"Mi laptop lo tiraba a 80fps, ahora tira 30 normales, farmeando 15 y en tf 4 o 5, me parece que voy a dejar el juego, asi no puedo jugar.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-11-10T17:29:38.879+0000","up_votes":1,"down_votes":0,"body":"Creo que el cliente ya no se puede poner en modo bajo rendimiento ni cerrarlo durante las partidas.\n\n\nPrueba entrar a una personalizada y finalizar su proceso.","replies":[{"poster":"Delsaco","date":"2017-11-10T17:33:26.279+0000","up_votes":1,"down_votes":0,"body":"NO ES EL ASUNTO DEL CLIENTE ESO VIENE DEL PARCHE ANTERIOR... ES ALGO RARO EN EL JUEGO DESPUÉS DEL PARCHE....\n\nosea me anda perfecto el juego... pero no me deberia andar este juego a 80 fps... a menos que hayan aumentado los requisitos MUCHO!!!!!","replies":[{"poster":"Hnk Kenshiro","date":"2017-11-10T17:37:20.360+0000","up_votes":1,"down_votes":0,"body":"En el parche anterior lo anunciaron, pero no lo aplicaron.\n\nSolo pruebalo, si no es eso ya queda descartado y ya :p","replies":[]}]}]}]}