{"poster":"Delsaco","date":"2018-06-19T19:24:49.064+0000","title":"Estoy perdidisimo con el meta y como se juega ahora veo cosas que parecen locuras pero funcionan?","subforum":"Charlas Generales","up_votes":6,"down_votes":1,"body":"Saludos!!!\n\nDeje de jugar varios meses un 6 o 7 y volvi a jugar hace poquito unas dos semanas o menos,alguien me podr&iacute;a explicar como va el asunto del meta porque estoy viendo cada configuraci&oacute;n extra&ntilde;a para mi y veo que funciona cosa que antiguamente seria una locura.\n\nejemplos que estoy viendo:\n\n1.- taric en mid con un yi jg: el taric solo controla las oleadas y pr&aacute;cticamente todo el tiempos se dedica a soportear al yi.\n\n2.- bot con solo asesinos\n\n3.- bot con bruisier tipo atrox, talon o irelia...\n\n \"Y LO ESTOY VIENDO ESTOS EJEMPLOS DE MANERA MUY RUTINARIA NO DE MANERA ESPORADICA COMO SI UN DUO ESTA PROBANDO COSAS O UNOS PRO ELO LO HICIERAN\"\n\nLo que noto raro a pesar de ser solamente un plata es que pareciera que los adc carry estan super malos esa es mi percepci&oacute;n est&aacute;n perdiendo linea con asi cualquier otra cosa que sea medio asesino.\n\nYo juego mucho a talon aparte  y tambien noto que esta medio pasado.. osea siempre me fue facil ganar linea en mi elo con el pero ahora lo noto rotisimo por lo menos para mi nivel plata... f&aacute;cilmente puedo reventar a un jg y un mid sin morir y bajar tanques como si nada...\n\nQUE PASA ES SOLO PERCEPCI&Oacute;N MIA HAY ALGO RARO???... en serio yo e ocasiones veo esto y digo ooo vamos a ganar porque est&aacute;n trolendo y al contrario les meten sendas palizas a los bot noramles digamos y termino perdiendo stompeadisimo....\n\n??????????????????????????????????????????????","replies":[{"poster":"ˆJx","date":"2018-06-20T07:02:42.970+0000","up_votes":3,"down_votes":0,"body":"Al principio en el lol no habia roles específicos, solo campeones, Riot sabía esto y tardó lo mas posible en denominar los roles que hoy conocemos (y encima lo hizo de forma vaga, apropósito obviamente), estos campeones eventualmente fueron asociados a ciertas acciones-estrategias-esquemas dentro de las partidas, la comunidad fue creciendo-compartiendo-aprendiendo cuáles son las estrategias óptimas para poder llegar a lo que todos queremos -ganar un game-, así se determinaron ideas como por ej: Bot lane conformada por supp-adc, midlaner al principio enfocado en roams, tops con control de waves, incluso doble top en un principio y la jg era mera visita entre viajes. A lo que voy es que estas estrategias \"raras\" son solo adaptaciones por parte de los jugadores al meta, el problema es que muchos estan acostumbrados y un cambio como este -repentino- les parece un gamebreaker","replies":[{"poster":"Tur1nTur4mb4r ","date":"2018-06-20T11:54:17.753+0000","up_votes":1,"down_votes":0,"body":"Vamos carajo,  no podia ser yo el único pelotudo que lo viera!!  Opino igual,  todo este llanto insistente de \"mi adc no sirve\" pensando en el \"meta\" sin considerar que quizás ya no haya meta o no sea lo principal pensar en tal cosa.  Pero somos animales de costumbres y donde nos sacan o cambian algo quedamos descolocados.  Me parece que es hora de adaptarse al \"antimeta\".  \n\nPd: aclaro que lo del llanto insistente no es por este tema creado si no por todos los que hay en el foro","replies":[]}]},{"poster":"Snicket","date":"2018-06-19T20:05:45.148+0000","up_votes":1,"down_votes":0,"body":"Sí, en el último parche los adc se vieron muy afectados y el meta actualmente funciona así, no te preocupes son cosas que pasan.","replies":[{"poster":"Delsaco","date":"2018-06-19T20:10:42.968+0000","up_votes":1,"down_votes":0,"body":"creo no ser solamente yo que no jugaba hace tiempo que noto que el juego esta super raro...\n\nestoy viendo cualquier cosa en bot veigar, talon, irelia hasta panteon... de hehco muchas veces al principio me decía \"putaaaaa no juego hace meses y entro para que me troleen o al contrario\" y terminaba ganando o perdiendo por palizon contra esta config para mi rarisimas DDDD=\n\ny mucha gente dice que esto no influye nada en elos bajos al contrario donde primero se empiezan a ver estas cosas es en mi elo porque todos los pro con multicuentas las practican en plata asi que se ve muuuy seguido los unicos que se demoran en adptarse somos nosotros los really platas T_T jajajajajaja","replies":[{"poster":"ˆJx","date":"2018-06-20T06:56:42.797+0000","up_votes":1,"down_votes":0,"body":"Un pro con multicuentas no va a tenerlas en plata xd","replies":[{"poster":"Delsaco","date":"2018-06-20T16:47:56.114+0000","up_votes":1,"down_votes":0,"body":"si muchas dejan cuentas ahi para divertirse, segun ellos es muy divertido jajajaja\n\ndiran muy facil","replies":[]}]},{"poster":"TeamSayori","date":"2018-06-19T20:29:53.360+0000","up_votes":1,"down_votes":0,"body":"Por el parche 8.11 el nerf increible a los adcs obligo a mucho a intentar innovar, lo adc ahora tienen menos supervivencia en fase de lineas y sus item core son muy caros por eso se empieza a utilizar cosas nuevas.","replies":[{"poster":"Delsaco","date":"2018-06-19T20:37:37.923+0000","up_votes":1,"down_votes":0,"body":"yo estoy colgadisimo.... con eso de la bot line de hecho tiro plegrias para que no me toque soporte comodín porque realmente no tengo idea que cosa sacar para soportear....\n\nporque si saco janna quizás esta muy mala, si saco blitz quizás tb ya ni se que hacer en esa linea asi que prefiero evitarla a toda costa ahora.\n\naparte como dije y ustedes me han corroborado los adc están malos y soportear mas encima un campeón que no esta bien es mas difícil DDDD=","replies":[{"poster":"TeamSayori","date":"2018-06-19T20:46:52.035+0000","up_votes":1,"down_votes":1,"body":"de soporte por ahora no hay muchos cambios, janna si esta masomenos mal, los que estan masomenos bien son los support mago (zyra, brand, morgana) y los iniciadores (leona, rakan, etc.) y despues los demas estan ok xD. los que mas cambios sufrieron fue adc/bot, mid y jg","replies":[]}]}]}]}]}]}