{"poster":"IcryWhenIpoop","date":"2015-10-17T20:01:33.537+0000","title":"Es laaaaaaaaaaaaaaggttt.......","subforum":"Hilfe & Support","up_votes":20,"down_votes":4,"body":"...wie die H&ouml;lle!  Und nein! Nicht nur bei mir! Mache seit 6 Tagen mal wieder 2 Spiele und in beiden Spielen gibt es mitunter Verz&ouml;gerungen bis zu 3 Sekunden! Ach meine Mitspieler beschweren sich die ganze Zeit &uuml;ber derbe Probleme. Ich hab ne 100 Mbit Leitung. Da lagt nie was! Ich k&ouml;nnte nen Download machen, Arma 3 spielen, nen Porno schauen und nebenher in der Nase popeln und komm nichtmal ins Schwitzen. Also es liegt definitiv nicht an mir. Alles prima. Downloadspeed gecheckt, keine unn&ouml;tigen ressourcenfressenden Programme im Hintergrund, keine Downloads am Laufen, (und bevor jemand damit kommt) Treiber sind sowas von aktuell, meiner Firewall gehts auch gut (die blockt nicht pl&ouml;tzlich LoL oder  was man einem sonst so weismachen will). \nIch bin sicher, dass jetzt wieder ein paar Leute auftauchen die sagen werden : &quot; Bei mir l&auml;uft alles ohne Probleme. Muss also an dir liegen!&quot;\nDann erkl&auml;rt mir mal warum ich nicht der einzige war in den letzten beiden Spielen mit Lags?\nBisher hat Riot auch noch kein Statement dazu herausgebracht. Wird wieder totgeschwiegen wa? W&auml;r doch mal angebracht so ne Nachricht: &quot;Hey Beschw&ouml;rer, derzeit gibt es Latenzprobleme w&auml;hrend des Spielens von.....usw......usw...&quot; \nDanke f&uuml;r die Aufmerksamkeit! Downvotebutton oben Links!\nTsch&uuml;ss\n\nPS.: Da schwirrt mir doch ne Idee im Kopf rum! Könnte es daran liegen, dass wieder einmal diese LoL-Weltmeisterschaft ist und, wie schon öfters aufgefallen bei solchen Turnieren, plötzlich sich keiner mehr kümmert um den armen kleinen Casual und seine (eigentlich ja Riots) Probleme?","replies":[{"poster":"zefezged","date":"2015-10-18T16:43:18.846+0000","up_votes":2,"down_votes":0,"body":"Hier das gleiche. Mein routing ist übrigens über Telefonica/O2. Normal ist ein Ping zwischen 35-40ms und neuerdings hab ich nen Ping von 70ms (mit gefühlten 1.5sek verzögerung und packet loss). Kann über easybell das Routing mittels veränderter Zugangsdaten ändern und habe über das andere normalerweise schlechtere Routing einen Ping von 60 (ohne Verzögerung trotzdem mit massivem packet loss). Nervt höllisch in der Lane und ist definitiv erst seit letzter Woche so. Habe auch entsprechende Pingtest gemacht und außerhalb von lol verhält sich der Ping im absolut normalen Rahmen (+-35ms). Also wirds wohl nich nur am Provider selbst liegen","replies":[{"poster":"Mori no kami","date":"2015-10-18T19:19:39.416+0000","up_votes":2,"down_votes":0,"body":"Mir ergeht es genau so wie dir. Außerhalb von LoL verhält sich alles wie es soll, der Ping konstant bei 42ms, kaum bis gar kein packetloss. Bin genau wie du bei Telefonica/O2. Habe das Problem auch seit fast genau einer Woche. Konstant bei 72ms. An sich ist das ja nichts schlimmes, wenn da nicht noch eine ganz kleine Sache hinzukommen würde. Die \"3 Sekunden\"-Momente. Ohne Vorwarnung bleibt der Champ im Teamfight stehen. Nichts bewegt sich. Dann tauche ich in der Base wieder auf, mit einem Tot mehr.","replies":[]}]},{"poster":"Novas","date":"2015-10-18T10:36:39.179+0000","up_votes":2,"down_votes":1,"body":"Danke dass es einer mal so deutlich auf den Punkt bringt. Ja, habe das selbe Problem. Mehrere Support Tickets, Forenthreads und Redditeinträge haben mir alles gesagt: Ja, is deine Schuld, oder, ja ich hab sowas net du hast ne kack Leitung, oder das beste: du hast Viren auf dem PC die das verursachen. Naja, ich denke wenn ich morgen mal bei meinem ISP anruf wird das auch net viel helfen. Aber naja, solange Worlds laufen kann man ja von Riot nich erwarten dass da mal was kommt oder so. Juckt ja keinen dass die Probleme in den Schulferien sind. Aber egal, mus Riot ja nich jucken. Solange wir unser Geld für Riot Points ausgeben sind die doch vollkommen zufrieden. Mal sehen was sich hier noch ergibt.\n\nEdit: Hey, ich hab was gefunden! Im englischen Forum: http://boards.euw.leagueoflegends.com/en/c/announcements-en/uYhp0bpH-euneeuw-in-game-laggy-responsiveness Anscheinend kümmert doch noch wen was wir Casual noobs machen! Das stimmt mich doch wieder etwas freudiger.. obwohl.. nah, solangs net gefixt is....","replies":[{"poster":"IcryWhenIpoop","date":"2015-10-18T12:00:48.437+0000","up_votes":2,"down_votes":0,"body":"Ich bin Deutscher. LoL bietet die Möglichkeit auf Deutsch zu spielen. Es gibt ein deutsches Forum. Und ab und zu auch mal den ein oder anderen Post von einem Riotler auf deutsch im deutschen Forum. Wieso sollte ich in irgendwelchen ausländischen Foren nach Antworten/Lösungen zu einem Problem suchen? Muss ich demnächst türkisch lernen weil im türkischen Forum mehr Admins unterwegs sind? Von mir gibts dazu ne klare Absage!\nIst nicht abwertend dir gegenüber gemeint. Mich ärgert nur, dass man wie so oft in LoL in anderssprachigen Foren nach Antworten suchen muss.","replies":[{"poster":"legofreak1","date":"2015-10-18T12:34:21.017+0000","up_votes":2,"down_votes":4,"body":"Auf kurz oder lang muss man wohl damit klar kommen, dass man mit \"ich bin deutscher, alles das nicht deutsch ist, interessiert mich nicht\" in den nächsten Jahren nicht mehr weit kommen wird. Die Welt wird immer kleiner und für viele Europäer ist Englisch eine gemeinsame Sprache. Dass bei einem Spiel, dessen Entwicklerstudio in Amerika liegt, Posts, die keine Ankündigungen sind, nicht in jede mögliche Sprache übersetzt werden, sollte eigentlich klar sein.","replies":[{"poster":"Fr3shdumbledore","date":"2015-10-18T18:46:45.321+0000","up_votes":2,"down_votes":0,"body":"Das ist doch gar nicht der Punkt! Die Server laufen nicht, das ist np, kann immer passieren. Aber wieso kann man nicht einfach eine Meldung in den Client packen? Und wenn sie auch englisch wäre, völlig egal. Zumindest, bis eine Übersetzung da ist. Das gilt auch für das Forum! Lieber mal was englisches als gar nix!\n\nEdit.: Im Übrigen sind die Probleme weiterhin vorhanden! Mein Ping ist doppelt so hoch wie normal (dh. 60) und es laggt stellenweise einfach wie Hölle, obwohl das Game mit diesem Ping problemlos spielbar sein müsste. Weiterhin geht auch der Zuschauermodus nicht und das jetzt seit 2 Tagen, in denen sich Riot weiterhin nicht dazu überwinden kann, die Rangliste zu deaktivieren oder zumindest eine Warnung in den Client zu setzen!\n\nAuch im Service Status hier im Forum steht nichts darüber!","replies":[]},{"poster":"IcryWhenIpoop","date":"2015-10-18T16:51:00.808+0000","up_votes":2,"down_votes":0,"body":"Soso. Wozu dann ein deutsches Forum, wenn dieses von Riot kaum genutzt wird? Kann man dann doch gleich entfernen. Das Geld der deutschen Spieler interessiert Riot schliesslich auch. Oder lieg ich da falsch? Also wieso kümmert man sich dann so wenig im deutschsprachigen Forum?\nSo nebenbei gefragt. Erwartest du auch ernsthaft von allen Kindern (ist LoL nicht USK 12), dass sie die englische Sprache beherrschen?\n Und ich habe nirgends geschrieben, dass alles was nicht deutsch ist, mich nicht interessiert. Und bitte komm jetzt nicht mit: \"So wie du schreibst könnte man es denken.\" Halte dich bitte an die Fakten diesbezüglich. Denn es steht dort NIRGENDS dass \"nichtdeutsches\" mich nicht interessiert.","replies":[{"poster":"Glaskanone","date":"2015-10-18T18:24:15.373+0000","up_votes":1,"down_votes":2,"body":"Das Spiel ist F2P und keiner zwingt dich etwas zu kaufen ;)). Such dir doch ein Game vom deutschen Hersteller und mit 12 war ich zumindestens in der Lage MMORPGS in englischer Sprache zu spielen und die Quests zu verstehen.\n\n> [{quoted}](name=FatGuyStoleMyIce,realm=EUW,application-id=7hciEY9w,discussion-id=V2r0HamY,comment-id=00070000,timestamp=2015-10-18T12:00:48.437+0000)\n>\n> Ich bin Deutscher. LoL bietet die Möglichkeit auf Deutsch zu spielen. Es gibt ein deutsches Forum. Und ab und zu auch mal den ein oder anderen Post von einem Riotler auf deutsch im deutschen Forum. Wieso sollte ich in irgendwelchen ausländischen Foren nach Antworten/Lösungen zu einem Problem suchen? Muss ich demnächst türkisch lernen weil im türkischen Forum mehr Admins unterwegs sind? Von mir gibts dazu ne klare Absage!\n> Ist nicht abwertend dir gegenüber gemeint. Mich ärgert nur, dass man wie so oft in LoL in anderssprachigen Foren nach Antworten suchen muss.\n\nMich ärgerts, das leute für ein Thema 1000 Threads erstellt werden, anstatt einfach einmal die Sufu zu benutzen.","replies":[]}]}]},{"poster":"Novas","date":"2015-10-18T12:08:27.362+0000","up_votes":1,"down_votes":1,"body":"Wenn man ein Problem wirklich lösen will muss man wohl oder übel auch mal von seinem Pfad abkommen.","replies":[]}]}]},{"poster":"Atlasbär","date":"2015-10-19T02:13:41.650+0000","up_votes":1,"down_votes":0,"body":"+1 , wie soll man so gewinnen, habe immer lagg spikes , die ms gehen auf 190 hoch so für 5 sekunden","replies":[]},{"poster":"Spicavius","date":"2015-10-17T20:54:08.324+0000","up_votes":2,"down_votes":6,"body":"bei mir funktioniert auch alles.\n\n> Danke für die Aufmerksamkeit! Downvotebutton oben Links!\n\nDanke für den Hinweis, aber habe ihn schon längst benutzt :P\n\nNaja kA. Vllt liegt es an eurem Anbieter oder so.  Also Dein Hause ---- Provider ---- Riot    Vllt verschickt Riot ihre Pakete ohne Probleme, aber dein Provider hat Probleme und somit wiederum du.\nDafür kann ja Riot nichts.  Aber ist nur eine Vermutung.","replies":[{"poster":"Xeranu","date":"2015-10-18T19:17:06.467+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=7hciEY9w,discussion-id=V2r0HamY,comment-id=0001,timestamp=2015-10-17T20:54:08.324+0000)\n\n> Naja kA. Vllt liegt es an eurem Anbieter oder so.  Also Dein Hause ---- Provider ---- Riot    Vllt verschickt Riot ihre Pakete ohne Probleme, aber dein Provider hat Probleme und somit wiederum du.\n> Dafür kann ja Riot nichts.  Aber ist nur eine Vermutung.\n\nGlaube ich eher weniger, ich habe 1und1 und komme auf konstanten 110 Ping (normal 25).\n\nInzwischen wurde Kabel Deutschland, o2 und 1 und 1 genannt und alle haben einen lag mit verlorenen Paketen die gesendet werden. Kabel Deutschland hat meines wissens ein eigenes Netz und 1und1 mietet es von Telekom. Ich glaube eher weniger das es am Anbieter liegt.","replies":[{"poster":"Spicavius","date":"2015-10-18T20:29:50.537+0000","up_votes":1,"down_votes":0,"body":"muss aber mittlerweile hinzufügen, dass ich auch jetzt Ping/Delay habe^^.\n\nTotal nervig x)","replies":[]}]}]},{"poster":"MDragon92","date":"2015-10-18T20:02:26.634+0000","up_votes":1,"down_votes":0,"body":"Das ganze hatte ich heut auch schon dachte es liegt an meiner Leitung doch dieses war nicht der Fall, leider bin ich dadurch mehrmals gestorben weil der Champ einfach nichts mehr gemacht hat ;(","replies":[]},{"poster":"Devine","date":"2015-10-18T18:07:08.981+0000","up_votes":1,"down_votes":0,"body":"ES IST EIN SERVERSEITIGES PROBLEM!","replies":[]},{"poster":"itzAce v2","date":"2015-10-18T15:19:51.681+0000","up_votes":1,"down_votes":0,"body":"Hab das gleiche Problem, immer so 16:30 - 23:00 hab ich 65er Ping statt 32er und Packet Loss :( Das Problem sollte bei Riot liegen, da ich schon extrem viele Beiträge dazu auf Reddit unter r/leagueoflegends gesehen habe. Kann man nix machen... :( Wird wohl nix mehr mit Dia für diese Season \n\nAuch habe ich noch keinen Riotler gesehen der sich dazu geäußert hat oder eine Lösung gefunden hat..","replies":[]},{"poster":"Anopka","date":"2015-10-17T23:54:39.184+0000","up_votes":1,"down_votes":0,"body":"Same here","replies":[]},{"poster":"W0RN","date":"2015-10-17T22:37:19.061+0000","up_votes":1,"down_votes":0,"body":"Bei mir läuft das Spiel auch nicht. Muss Lol über WTFast starten damits läuft ..","replies":[{"poster":"Zero000","date":"2015-10-18T00:06:55.947+0000","up_votes":1,"down_votes":2,"body":"Das würde aber eher auf Anbieter Probleme hindeuten. WTFast ändert den Weg den deine Daten zu Riots Server nehmen. Jedoch ist dein Anbieter dafür verantwortlich welcher Weg genommen wird nicht Riot.","replies":[]}]},{"poster":"Rkoturdo Ndo","date":"2015-10-17T21:15:34.139+0000","up_votes":1,"down_votes":0,"body":"Heya\nWer ist denn dein ISP?\n\nMfG Rkoturdo","replies":[]},{"poster":"Heisl","date":"2015-10-17T21:08:32.107+0000","up_votes":1,"down_votes":0,"body":"Hier auch","replies":[]},{"poster":"Prokolli","date":"2015-10-17T22:33:28.007+0000","up_votes":1,"down_votes":1,"body":"versuch mal \"als administrator ausführen\"","replies":[]},{"poster":"TSZH Saphi","date":"2015-10-17T20:50:18.370+0000","up_votes":2,"down_votes":5,"body":"bei mir läufts lel","replies":[]}]}