{"poster":"I am F A M E","date":"2017-03-01T22:11:21.599+0000","title":"PINGS (ALERTS) PROBLEM","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"When I go to smart ping, my mouse sometimes snaps to a random location on the screen when I first hold it down to open the ping menu. If I hold the mouse still and just do a regular ping it doesn't happen. And this also doesn't happen every single time or in any predictable way. I've tried different directions, different ping hotkeys, dragging it slow or fast, and it still randomly happens. This also only happens in League during smart ping, the snapping to a random location does not happen in any other program or in any other spot in league.","replies":[{"poster":"Porocles","date":"2017-03-01T22:33:43.572+0000","up_votes":1,"down_votes":0,"body":"Are you on a PC or a mac?  Do you have another mouse you can try for troubleshooting purposes, in case there may be an issue with your mouse itself?  Are you on a laptop with a touch pad?  Let me know.","replies":[{"poster":"I am F A M E","date":"2017-03-03T23:22:46.263+0000","up_votes":1,"down_votes":0,"body":"I am on a PC. I dont think the mouse is the issue.As far as i ve seen after every patch the pings works fine for 1-2 days then starts to go crazy.I do not have any sort of problems with the mouse in any other game or even in league, beside the smart pings. I tried to use them with other key (G or watever they key was) but i got the same result.I ve seen on the internet a couple of people that have the same problems and the majority of the answers were something like \"download this 8.1 windows verions setus bla bla\" So everyone has problems with W 8.1. I couldnt find any good solutions for W 10.","replies":[{"poster":"Porocles","date":"2017-03-04T16:26:52.220+0000","up_votes":1,"down_votes":0,"body":"Thanks for the info.  There might be something going on with your config, like a corruption.  Try a config reset and test it out in a custom game.\n\nLog into the game client.\nNavigate to C:\\Riot Games\\League of Legends\\Config\nDelete the file  named **game.cfg** and **persistedsettings.json**\nGo into a custom game and verify that settings have saved properly.  Leave game to sync settings. \n\nLet me know if that works for you!","replies":[]}]}]}]}