{"poster":"spieon","date":"2015-01-19T16:06:05.597+0000","title":"West","up_votes":1,"down_votes":2,"body":"Hali mindenkinek ! Más fél éve játszok easten és átszeretnénk menni haverokkal Westre . Mindenki tudja miért. Meg lehet ezt oldani fizetés nélkül?","replies":[{"poster":"Enforc3r","date":"2015-01-19T16:14:27.051+0000","title":null,"up_votes":1,"down_votes":1,"body":"Pedig nyugodtan mehetne ingyen is, mert még a játékosok 90%-a átmenne, és meg lehetne szüntetni 1 szervert nekik akár...","replies":[{"poster":"iReapU","date":"2015-01-19T16:37:55.302+0000","title":null,"up_votes":1,"down_votes":4,"body":"Azért milyen érdekes a sors iróniája. Aki csak kapta az indokolatlan bannt, egyből menne westre miután én is azt írtam a topicom alatt hogy \"ezek után már nem lehet megbízni a magyar riot társaságban\" és ahogy elnézem egyre többen, éreznek hasonló képpen, és mennének át westre. Amúgy szerintem nem mondasz hülyeséget, én szívesen látnám pl. hogy EU East és West között ingyenes híd van, hogy aki akar az átmehessen. Tény hogy ingyen jöttem át én is westről eastre, de egy dolgot leszámítva, életem egyik legnagyobb kocka hibájának tartom az egészet..... És szerintem nyugodtan kimondhatjuk őszintén hogy : Ezt elb*sztátok magyar riot!","replies":[{"poster":"NalamiHUN","date":"2015-01-19T17:04:22.470+0000","title":null,"up_votes":3,"down_votes":0,"body":"Azt nem értem, miért kell szidni őket, mikor elvileg kevesen vannak még ott magyarokként...\n\nmost lehet hülyeséget mondok, de 5 magyar embertől miért kell azt várni, hogy most azonnal oldjanak meg minden problémát? Amikor lehetett jelentkezni, akkor is láttam egy enyhén szóval gondolkodásra képtelent, aki csúnya szavakkal illette a LoL-t s dicsőítette a DOTÁT, holott az a téma nem arra való.\n\nMeg nekik is életük van emberek, élniük is kell, nem a nap 24 órájában ott lenni készen állva mindenre.","replies":[{"poster":"iReapU","date":"2015-01-19T17:42:15.210+0000","title":null,"up_votes":1,"down_votes":4,"body":"Figyelj, ha neked vna egy munkahelyed, akkor átlag szintne dolgozol ott napi 8 órát 5 napon keresztül (átlagba). A riot mint munkát tette fel a hírdetést, hogy lehet hozzájuk menni dolgozni, ha jól emlékszem talán svéd-be vagy isten tudja már hova. Na msot ha az ember elvállal egy munkát, akkor azt igyekszik tudása legjobbja szerint megcsinálni. Ez alatt azt értem hogy ha pl én dolgoznék a Riotnál mint support, és küldenének nekem egy levelet hogy mittom én, feltörték az accountját valakinek és segítsek neki, akkor:\n\n1. Alapjáraton a napi 8 órámban ott ülök a gépe előtt, és olvasom a leveleket amiket írnak nekem a játékosok, és igyekszek segíteni ahogy tudok\n2. Ha kapok egy fontos üzenetet mint pl az account feltörés akkor, abban a pillanatban ahogy végig olvasom megyek és megnézem mit tehetek, nem pedig másfél hét eltelte UTÁN vetemedek arra, hogy egyáltalán elolvassam a leveleket (mint az én esetemben is)\n3. Külföldön jóval nagyobb a munkából való bevétel mint itt MO-n, és ha már nagyobb bevételről van szó, nem érdekel mi az a meló, magyar ember révén (mivel tudom milyen sz*r itthon a fizetés) nekilátok és csinálom!\n\nMost ezt a 3 szempontot figyelembe véve nézd meg amit a magyar riot csinál!:\n\n- Csúszik jócskán a karácsonyi mystery (apróság ugyan de nem az ígérethez tartják magukat)\n- Indokolatlan bannokat osztanak ki, olyan játékosoknak akik pl a szezonban 1x mentek rankedezni, vagy csak szezon elején, és ELO BOOSTING-al vádolják őket, úgy hogy nagy valószínűséggel semmit sem csináltak az ég világon.\n- Folyamatosan laggol a szerver az utóbbi időben (igen új szezon teljesen érthető, de azért lehetne orvosolni)\n- És ami szerintem a leg érthetetlenebb az az, hogy mi a francért nem méltatnak minket (bannolt játékosokat) arra, hogy válaszolnak a felháborodásunkra?! Eltudom képzelni a jelenetet: \"Te hallod Sanyi nézd már mit írt a bannolt gyerek! Még vissza mer ugatni hogy félre néztük az egészet, meg itt pampog hogy teljesen indokolatlan! Totál kész besz*rás nem? Vissza se írok neki mert úgyis össze vissza kamuzik.\"\n\nMindezek után, ki az aki itt maradna easten, ahol kb a support ránk se bagózik?? Nem kell a nap 24 órájában készen állni, és visszaírni nem ezt várom el. Hanem azt hogy ha bepánikolok mert feltörik az accountomat, és féltem a felhasználót amibe pénzt öltem és félek hogy elveszik, akkor ne másfél, 2 hetet kelljen várnom arra hogy reagáljon rá a support! Meg azt, hogy ha már indokolatlanul kibannolnak, akkor jogomban álljon felháborodni, és normális emberi lények módjára megbeszélni a dolgot, esetleg skypeon, TS-en felvenni velük a kapcsolatot és megbeszélni, nem pedig az hogy kapom a bann-t utána kussolj, ülj le a sarokba és nézzek ki a fejemből, amíg ők lesznek olyan csodálatosan jó fejek hogy visszaadják az accountomat!\n\nRöviden: Elvállalták a munkát hogy segítsenek a magyar játékosoknak, felelősséget vállaltak a támogatásunkért akármi bajunk, nyűgünk van, és mindennek ellenére semmit sem csináltak.  Elég valószínűnek tartom azt is, hogy amiért felháborodásomat forumra merem vésni kapok még + 1-2 hét bann-t de nem érdekel mert a teljes igazságot mondom el ezzel, és ahogy észrevettem 2 topic alatt is, rengeteg játékos van felháborodva  ugyan amiatt a dolog miatt! 2 hete mást sem látok forumon mint azt, hogy valakinek ez nem tetszik az nem tetszik, laggol a játék, hibaüzenet, bann stb. Ki fog mindezzel törődni, ha nem maga a support? Senki. Nincsen diplomám, nyelv vizsgám egyenlőre, de annyit mondhatok hogy ha esetleg én dolgoznék a supportnál, biztos hogy minden erőmmel a munkaidőm alatt arra fókuszálnk hogy akinek szüksége van a segítségre az meg is kapja azt.","replies":[{"poster":"NalamiHUN","date":"2015-01-19T17:59:46.920+0000","title":null,"up_votes":1,"down_votes":0,"body":"Valahol valamelyik tag írta, hogy valószínűleg most nézték meg az egész évet, s lehet, hogy te egy több hónappal ezelőtti miatt kaptad (azért szerintem odaírhatták volna, mikor is volt az az eset), vagy bug az oka, nem tudom.\n\nNem védeni akarom a Riot-ot, mert lehet tényleg tévedés volt, de még fenállhat a lehetőség, hogy valami több hónappal ezelőtt történt, s csak most vették észre (jó lenne már az a Tribunal visszajötte szerintem, elhiheted, mert az automata akármikor elromolhat)\n\nJa elfelejtettem: van melóm, mégpedig olyan, hogy általában rendelésre kell szőni szőnyeget (nem vicc, tényleg ez a melóm!), úgyhogy tudom, milyen az ilyen meló.\n\n+ örülök, hogy akad ilyen tettrekész ember, mint te:) (csak meg ne szívasson a sors)","replies":[{"poster":"iReapU","date":"2015-01-19T18:05:47.577+0000","title":null,"up_votes":1,"down_votes":0,"body":"Őszintén mondom, és már korábban is megmondtam kedves Vadhalál kolegának, hogy semmit sme követtem el! Engem sem boostoltak, barátnőmön kívül nem tudja senki a felhasználói adataimat, ő pedig nem rankedezik mert cska fun gamer. Én egyszer léptem be egyik haveromhoz, akkor sem rankedezni, hanem kipróbáltam nála braumot, mielőtt megvettem. Az más kérdés hogy ugyanez a haveorm egyszer nálam volt, és nálam rankedezett is, méghozzá jó statokkal végzett egymás után 3 zsinor winnel!\n\nNa látod annak én is örülnék ha már rendbe jönne a Tribunal, de a véleményemen nem változtat, mégpedig hogy amint visszakapom az accountomat, egyből megyek westre!","replies":[{"poster":"Zooty","date":"2015-01-19T19:22:56.775+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azt azért tisztázzuk, hogy én csak a fórumokért felelek. Tisztáznod magad nem nálam, hanem a játékostámogatásnál kell. Én nem látok bele az accountod adataidba, csupán ötleteltem, hátha együtt kitaláljuk miért járt a ban..","replies":[]},{"poster":"NalamiHUN","date":"2015-01-19T18:17:22.126+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jó-jó, én elhiszem, mivel én nem látok bele a meccsekbe úgy, mint a supportnál.","replies":[]}]}]}]}]}]},{"poster":"M4dr4c","date":"2015-01-19T16:18:24.067+0000","title":null,"up_votes":1,"down_votes":0,"body":"És az miért lenne jó? Ami felszabadul szerverpark az EUNE nyomán azt fel is kellene használni az EUW megerősítésére.","replies":[]}]},{"poster":"Pilnik","date":"2015-01-19T16:09:14.935+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sajnos nem lehet. 2600 RP-be kerül a transfer.","replies":[]}]}