{"poster":"xxArcanE","date":"2015-09-08T12:59:17.544+0000","title":"Verständnisproblem mit Mordekaiser \"Q\"","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo zusammen\n\nIch war letzhin in einem Spiel in dem Mordekaiser als \"ADC\" auf der Botlane rumgerannt ist. Hab ihn nach dem Rework nicht mehr in einem \nSpiel gesehen deshalb war ich zu Anfang schon etwas verwundert. Doch nachdem er mich als Jungler mit LvL 8  \"One-hittet\", war ich doch ziemlich verwirrt.\n\nIch hab mir die Q Beschreibung mal durchgelesen. \nVerstehe ich die so richtig?:\n\nMordekaiser n&auml;chsten 3 Angriffe werden verst&auml;rkt. Beispiel 100ATK 50AP  Q auf LvL 3 Trinity Force\nDer erst Schlag 4-20 Dmg + (0,2-0,3x AttackDmg) + 0,2x AP  bedeutet ja vor Abzug durch Armor usw. 100+12+0,25x100+10AP = 147 *1,5 (TF) \n=220,5 DMG\n\nDas w&auml;re ja jetzt net so schlimm gewesen. ABER dann gehts ja weiter. \nDie beiden folgenden Attacken vervielfachen den Schaden um das 2-3 fache. \nBei Annahme von 2,5:\n\n220,5 * 2,5 = 551,25 \n\nBis dahin ist aber auch wieder der Effekt von TF bereit und er bekommt dann tats&auml;chlich??? wieder 150%  \ndemnach 551,25*1,5= 826,875 \n\nUnd der ganze Spass kann dann offenbar auch noch critten?!?! \n\nDenn ich habe exakt einen Schlag abbekommen der mir genau 942 DMG gemacht hat und ich war damit direkt hin&uuml;ber. 1 Item 1 Schlag und dann direkt tot??\nIst das wirklich so? \nNicht auszudenken wie der Schaden skalieren w&uuml;rde wenn ich Ludens Echo + Static mit einbeziehen w&uuml;rde.....\n\nBin ich da total auf dem Holzweg?!","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T17:05:21.489+0000","up_votes":1,"down_votes":0,"body":"Ja da liegst du richtig. Du darfst nur nicht vergessen, dass Mordekaiser zwischen diesen 3 Angriffen nur sehr wenig Zeit bleibt. Somit genügt ein minimaler Stun und die Zeit ist vorbei.\n\nAußerdem sollte man nicht vergessen, dass Riot schon vor dem Juggernautpatch gesagt hat, das er Veränderungen geben wird und dieser Patch nur als Testlauf für den Worldspatch dient.","replies":[]},{"poster":"xxArcanE","date":"2015-09-08T13:20:25.975+0000","up_votes":1,"down_votes":0,"body":"In Kombination mit Sorraka ist der Kerl einfach gestört....\nAlso ich bin echt mal gespannt was die LCS-Pros damit anstellen.\n\nAber danke schonmal für die Antwort","replies":[]},{"poster":"Alustus","date":"2015-09-08T13:06:12.518+0000","up_votes":1,"down_votes":0,"body":"Jop der macht gerne mal 1,5 k+ dmg mit dem letzten q.\nDarum immer nur 2 qs tanken oder ihn kiten.","replies":[]}]}