{"poster":"Gestyle","date":"2018-06-28T19:35:19.062+0000","title":"Garen Q Fähigkeit hat jetzt eine kleine Castzeit und ist somit kein Autoattack Reset mehr","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hey Leute und liebes Riot Team, seit dem aktuellen Patch 8.13 hat Garen auf seiner Q eine kleine Castzeit und ist somit kein Autoattack Reset mehr wie vorher.  Zuerst dachte ich das es nur am neuen Skin liegt, daran lag es aber nicht ist bei jeden Skin genau das selbe.  In den Patch Notes habe ich zu dieser &Auml;nderung auch nichts gefunden. Ich wei&szlig; Garen ist ein Bronze champ, aber ich spiele ihn trotzdem gerne und auch im ranked. Diese verz&ouml;gerte Q Ausf&uuml;hrung hat auch wenn es nur ein sehr kleines zus&auml;tzliches Zeitfenster ist, schon einen impact auf die &quot;stumpfe&quot; Spielweise des Helden. W&uuml;rde mich &uuml;ber ein Feedback freuen. Vielleicht ist das ja auch von Riot gewollt und wurde nur nicht den Patchnotes aufgelistet.  \r\n\r\nEinen sch&ouml;nen Abend noch","replies":[{"poster":"Gestyle","date":"2018-06-29T14:24:23.440+0000","up_votes":1,"down_votes":0,"body":"ok anscheinen laut videos  hatte er das schon immer... ist mir aber nie aufgefallen. \n\naber.... ja aber es fühlt sich jetzt so clunky an ihn zu spielen.  Ich hab die letztten Wochen viel Garen gespielt um ihn auf 7 zu bringen und seit dem Patch nunja wirkt das einsetzten ein kleines bissel länger","replies":[]},{"poster":"Gestyle","date":"2018-06-29T14:09:44.936+0000","up_votes":1,"down_votes":0,"body":"https://picload.org/view/dlgrcoww/garenq.png.html\nhttps://picload.org/view/dlgrclgr/garenr.png.html\nhier bilder","replies":[]},{"poster":"Mjölnir Kind","date":"2018-06-29T06:53:49.635+0000","up_votes":1,"down_votes":0,"body":"Ich kann es grad nicht nachprüfen.\nHast du evtl. ein Video wo du das zeigen kannst?\n\nMir ist nämlich, das letzte mal als ich Garen gespielt habe, nichts aufgefallen.","replies":[]},{"poster":"RainerKilltKeina","date":"2018-06-29T06:51:56.481+0000","up_votes":1,"down_votes":0,"body":">Ich weiß Garen ist ein Bronze champ\n\nWenn ich so was schon höre...\nNein ist er nicht!","replies":[]}]}