{"poster":"FrostJäger1","date":"2017-03-16T15:17:25.678+0000","title":"New caracter concept Jagmi The Origami Champion","subforum":"Skin- & Champion-Konzepte","embed":{"description":"Vote Now! [Its a Good idea] [Its a bad idea] [Maybe]","url":"http://www.strawpoll.me/12542451","image":"http://www.strawpoll.me/images/poll-results/12542451.png"},"up_votes":1,"down_votes":1,"body":"Jagami the origami champion (Its A Female Champion) She Kost About 3100 IP or 4800 IP\r\nPassiv : Master of Origami Every 100 Seconds she can make a abiliti of her choice More Powerfull z.b She can make her out of her Q 2 Origami minos.\r\n\r\nHer Q would be She can make a Origami Minon (Abiliti name Master Piece) \r\nHer E would be She Copy the attack From Alies or enemys ( she cant copy Ults ) (Abiliti name Copy and Paste) \r\nHer W would be can heal her self Or Alies (Abiliti name Heal of The Lotus ) \r\nHer R would be she throws a Origami Schuriken (Its Global) (Origami Schuriken) \r\nHer AutoAtack: she throws a Piece of origami \r\nHer Skins Bloodmoon Jagami , Lotus Orden Jagami etc.\r\n\r\nIF U DONT Like The abilitis or skins Ask me or be creative \r\nLG DeathshadowHD ☆_☆","replies":[{"poster":"Alekra","date":"2017-03-16T15:34:16.867+0000","up_votes":2,"down_votes":0,"body":"Nett das du dir so viel Mühe gegeben hast im deutschen Forum alles auf English zu übersetzen.","replies":[{"poster":"FrostJäger1","date":"2017-03-16T19:12:58.403+0000","up_votes":1,"down_votes":0,"body":"Ich kanns ja noch für die deutschen ins deutsche übersetzen weil nicht alle Leute sogut englisch können\n LG DeathshadowHD \nUnd wie findest du die Idee? \n;)","replies":[{"poster":"Alekra","date":"2017-03-16T19:26:52.342+0000","up_votes":1,"down_votes":0,"body":"Hmm also die Passive ist ja praktisch wie die Karma Ult. Ist ja eratmal niz schlechtes aber der Cooldown ist zu hoch.\n\nDie Q kommt mir ein bisschen zu schwach vor. Ich meine was macht denn schon ein Minion?\n\nDie W ist ganz ok. Heal ist immer solide.\n\nDie E ist meiner Meinung nach nicht wirklich machbar. Ich meine du kopierst zb die Yasuo oder Aatrox Q. Wie sähe das denn aus? Die meisten Fähigkeiten können eben mhr von dem einen Charakter ausgeführt werden. Würde sonst echt komisch aussehen.\nAuch bauen viele Fähigkeiten auf anderen auf was die kopierten so git wie useless machen würde.\n\nDie Ult ist halt einfach eine Globale Damage ult. Ist ok.\n\nDas problem ist aber, dass ich hier weder eine Rolle noch eine Position herauslesen kann.\n\nMinion beschwören + Copy + Heal + Globale Ult? Da kommt ja weder Spielspaß noch irgendwelche Combos zustande.\n\nLeiser passt der Champ in keine Position.\n\nSry wenn ich zu unfreundlich war aber das ist halt meine Meinung.","replies":[{"poster":"FrostJäger1","date":"2017-03-17T05:16:22.778+0000","up_votes":1,"down_votes":0,"body":"Ne ist ganz ok schreib mir verbesserung Vorschläge und dAnn haben wir bEide den champion  erfunden \nIch würde sagen die rolle ist Support/....\n\nUnd danke für dein Feedback I mag das was du sagst deswegen warte ich auf deine Verbesserungs vorschläge\n","replies":[]}]}]},{"poster":"FrostJäger1","date":"2017-03-16T19:12:03.436+0000","up_votes":1,"down_votes":0,"body":"Ich kanns ja noch für die deutschen ins deutsche übersetzen weil nicht alle Leute sogut englisch können\n LG DeathshadowHD","replies":[]}]}]}