{"poster":"catch this work","date":"2016-08-31T14:17:37.998+0000","title":"Katarina Rework. The Proper Way","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Ok, so after spending about an hour of so of hard thinking on ways to improve Kat, and considering every known factor I could think of, I made up some changes for MY insight of what reworked Kat should be like. Keep in my mind I&#039;m no novice and I&#039;m being deadly serious in every little change I am proposing, I&#039;m EternalEmVy from the OCE server (later to be known as Lovesick) and I&#039;ve been playing Kat since I started the game mid season 2, so she has a very special place in my heart, and I&#039;m very well aware that she can&#039;t be too broken. So without further ado, here are MY proposed changes **(ability summary at the bottom of the page for those who want simple reasoning).\r\n**\r\n\r\nFirst off base stats. Revoke the 5.2 change to get Kat&#039;s base HP back to 590. This will be needed as Kat is going to be significantly weaker in lane, the 80 HP will give her a small amount of leeway in order to not be useless in lane. In addition, buff Kat&#039;s base MR to 34.1-55.4, it&#039;s a very small buff but it again, makes Kat a little better in lane. HP regen however, is being nerfed to 3.5-11.9, as Assassins shouldn&#039;t be recovering so quickly, Kat is no exception. This still makes Kat weak to AD assassins+GP+ADC, Supp mids, while also helping her against the control and burst mages which poke her down from afar and force her to play into them.\r\nPassive wise I&#039;d like to thank one of the Kat mains on Reddit who suggested this. Add a second passive onto Kat&#039;s passive which acts like a Stormraider&#039;s buff which applies once X amount of stacks is hit (the same method as Luden&#039;s, only movement speed). For that duration she has slow reduction for like 60%.\r\n\r\n\r\nQ wise, keep it the same, skillshot Q doesn&#039;t help with resets or combos. Buff the base damage by 10 each level e,g, 70/95/120/145/170, however, lower the scaling of the initial hit to 35% (I&#039;ll get to the reasoning for this once I get to her E) and lower the mark proc. scaling to 15%.\r\n\r\n\r\n\r\nW, turn it into an ability which throws X amount of daggers in the same manner as fan of knives. Alternatively you could just keep the current W and remove the movement speed, as the 2nd passive already has that, except buff the ratio and change the cooldown to 6 seconds rank 1 scaling, scaling something like 6/5.5/5/4.5/4. \r\nFor the first new W, it&#039;s damage must be mediocre due to the reworked Ult and how this new kit functions, so I&#039;m thinking make it a 7 second CD ability that deals 80/100/120/140/160 per dagger (decreasing by 20 damage per dagger hit on the same target, 40 damage per additional dagger after hitting 2 AND decreases by 10 per target the daggers pass through), and I&#039;m thinking she throws 4 daggers. The only possible way to hit all 4 is to be up close and personal and even then you&#039;re not dealing insane amounts of burst. Ratio wise it scales with 20% AP (25% is too much) and 50% bonus attack damage. This ability works in the same way as the old Graves Q did (however it acts different), it has decent frontal AOE, however isn&#039;t oppressive in its burst.\r\nIf you&#039;re simply reworking this current W, keep it the same, however lower the ratio to 20% AP and remove the movement speed gained and as said change the CD to the one proposed above.\r\n\r\n\r\n\r\nE wise, make it deal low damage and have it act like a Yasuo E on enemies (with lockouts), this way Kat can&#039;t just blindly spam Shunpo in fights and must think about it. Much like what was posted back in 5.4 for tentative Kat changes, have it refund a % of its cooldown if used on ally CHAMPIONS, scaling from 20%/30%/40%/50%/60% each time you level it. This way Kat mains will actually have to decide whether they want safety or waveclear/sustained dps and stronger burst in their leveling order. Also, my experimental idea is to make E have a passive where for every reset Katarina gets, she gets a Jinx-like buff which decays over 5 seconds, this buff gives you a flat amount of bonus AP, imo I&#039;m think +30/40/50 for every reset. This way people will fear your resets and it rewards Katarina players for combo&#039;ing properly and knowing when to clean up/pentakill. THIS is why I&#039;m choosing to nerf the SCALING/RATIOS on her other 2 abilities(if W is reworked, if not then just Q), as with this situational buff she has the potential to deal a lot more than she does now. Key point: Ward hop is being kept, it&#039;s one of Kat&#039;s staple ways of being mobile and with it; it opens up opportunities to outplay your opponent or escape (however the scaling CD reduction is not applied to using E on wards).\r\n\r\n\r\n\r\n\r\nUlt wise, rework it. I don&#039;t have much of an idea as to what to do to it. But my insight for it, is it becomes a reworked Killer Instinct from season 1-mid season 2 Kat. Instead of the minor bonuses, Q now instantly procs your 2nd passive as its 2nd part when ulted AND applies grevious wounds to all targets hit(+it possibly bounces twice to each target, cannot bounce more than 2 on each person), W slows by 30%-40% and they take bleed damage (if old W), if it&#039;s the new W it will now fire daggers around you like your old Ulti; only this time it only fires 1-3 daggers (scaling with new Ult&#039;s level)over the course of 0.75 second which pass through all enemies hit and E applies damage reduction AND your next ability deals X% amount of current HP (+their a % of their BONUS HP, key word being bonus) as damage upon landing from E+ E&#039;s passive bonus is doubled to 60/80/100 per reset (again, scaling with Ulti rank). Cooldown wise make this 80 seconds rank 1, 60 seconds rank 2, 40 seconds rank 3. Note: this Ulti. has no cast time.\r\n\r\nNote 2: E&#039;s passive granting 100 AP might seem huge, but in the grand scheme of things Katarina still won&#039;t do as much as she does now until after 2-3 resets. Full build is around about 748-764ish AP, thereby if Katarina gets 4 resets into a 5th she&#039;ll be 1164 AP to 1264 AP. This is the part which a lot of you will be skeptical about. But from experience, even with 1k+ AP you still don&#039;t deal much damage. As for early game such as roaming bot lane level 6, that&#039;s still only +60 AP if you get 2 people. it&#039;s meaningful, however it&#039;s not busted.\r\nThe whole Ult becoming a reworked Killer Instincts makes the most logical sense for me, as it&#039;s not broken as you will get outscaled due to it being purely situational and for utility, however it gives Kat some more uumph where she needs it, in her basic combos. Her basic combos make Kat, well, Kat. It&#039;s rare to see a Katarina Ult matter atm as usually you get 3-5 daggers off (if that) and you start EQW and EW&#039;ing for resets. With the choice for utility and the proper decision making, Katarina not only has an increased skill cap, but also gains a nice mid game buff, that and she&#039;s actually relevant to her team in the form of high mobility and the choice to either heighten mobility, slow/deal more AOE damage and deal with tanks if the form of minor % damage and gain bonus stats for every reset.\r\n\r\n\r\nThese changes reward Katarinas who can distinguish between the core combos and forces Katarina to buy Luden&#039;s to be fully effective, thus giving her a signature item. In addition it fixes her problem of having to snowball to make a difference, now you can simply turn games by waiting for the right fight (this is even more prevalent in this reworked Kat than now). But, this is balanced because Kat hasn&#039;t gotten any direct lanes buffs and she&#039;s still able to be shut down hard in lane and gains no benefits whatsoever to her trading potential, apart from the new passive. Not only that, but due to E&#039;s passive Katarina is now viable in the hyper late game, as once 1-3 resets occur she is able to go wild or deal enough damage for her team. Not only that but this open up Kat building some more CDR as a viable option, as it allows for more frequent Ulti usage and gives your entire basic kit a significant decrease in cooldown. So possibly, Katarina could run 10% CDR in runes for some matchups now, go Lucidity boots, Abyssal/Zhoynas and Protobelt. \r\n\r\nIn addition, if W is reworked she now has a bigger weakness to being shoved in and counterpushing, so roaming will be harder and possibly more rewarding for her if she&#039;s ever able to shove the lane. If W is kept the same however she retains the current waveclear, however she loses out on the activation movespeed utility No empowered ability is flat out better than the rest, Q is best for chasing, poking and heal denial. Reworked W is best for the huge increase in AOE and when the enemies have blown their main CC and denial spells. Old W is best for extended fights due to the bleed and slow. Empowered E is best for raw cleanup power as it not only makes you able to damage tanks it also gives the most potential damage after a reset, however you must be quick about it, the downside to using empowered E is that you can&#039;t utilise it properly unless you&#039;re winning the fight, thereby separating good Kat players from great Kat players.\r\n\r\n\r\nThe main issue people will say to me is the bonus AP per reset from E. But Lovesick...what if you just don&#039;t empowered E, the bonus AP per reset is still good without it. To that I say, no, not really. To fully embrace this new kit&#039;s full damage you have to play her like the reset and cleanup queen people know her for or use one of the other two options in the correct situation.\r\n\r\n\r\nThat&#039;s my take on the Kat rework. In my eyes I&#039;ve covered everything and I haven&#039;t taken away her identity or made her busted. I&#039;ve simply made her even more of a situational pick since she has lower single target burst, requires more effort to go reset hungry in teamfights and gives Kat players more choice in their actions. Additionally, the 2nd passive gives her the staple movement speed that assassins have, and the changes to her kit satisfy Riot&#039;s goal of increasing burst time windows, except for when she resets. Except that&#039;s for a good reason, Kat should be rewarded for getting resets and it should feel unique to every other champion.\r\n\r\n\r\nI&#039;m not kidding when I&#039;ve considered every possible factor, even Tank Katarina. As due to the fact you NEED to basic combo, Tank Katarina brings nothing to the table unless enemies drop super low, which in that case the fight should already be over. To top it all off she still has noticeable weaknesses and doesn&#039;t really become a pick or ban champ as she still has really shitty matchups ESPECIALLY in the form of Lissandra, Lulu and Anivia, since she&#039;s more reliant on resets and mobility than ever before in this rework.\r\n\r\n\r\nOk, so for any further issues, I am aware that this rework might hypothetically drive away the casual player base due to how situational she now is and how she isn&#039;t meant for &quot;fun&quot; anymore. This can be true, however I personally think that she&#039;ll be even more &quot;fun&quot; and exciting to play with, as and against on both sides of the spectrum.\r\n\r\nThis is my take on what a Kata rework should like, rewarding players of Katarina for making correct decisions and separating the good Kats from the amazing Kats. Moreover she still retains her identity and while yes this kit is overloaded, it isn&#039;t busted and it synergises together perfectly.\r\n\r\n\r\n\r\n\r\n\r\nBraindead summary (for those who want the details now, rather than read):\r\nBase stat buffs: +80 base HP, +2 MR, -2 HP regen.\r\nPassive: Same reset passive. Now has a 2nd passive which will read something like: &quot;Once X amount of stacks has been reached by moving or using abilities, your next ability will grant a movespeed buff for X% and X amount of seconds (probably 25% movement speed and 3 second buff) and she gains 30%/45%/60% (scaling through levels 1,7,13) slow reduction over the duration.\r\n\r\n\r\nBase HP change from 5.2 revoked, as +80 HP helps her somewhat survive in lane since she isn&#039;t designed to hard win lanes anymore, she&#039;s more focused around teamfighting and being an opportunist. Similarly, her base MR is going up by 2, to help her vs long range or lane bully mages. The introduction of the 2nd passive gives her more variety and adds to the high mobility assassin identity that Riot wants, that&#039;s the simple version. Advanced version, it helps her trade in lane, outplay chases, improve her own chasing and be mobile in teamfights.\r\n\r\n\r\n\r\n\r\nQ: 70/95/120/145/170 damage (35% AP scaling on initial hit), (+15% AP scaling on mark proc.) Same cooldown as on the live server.\r\n\r\nThe increase of the base damage by 10 universally over all 5 ranks helps Kat out in the lane, while the % decrease is AP scalings doesn&#039;t make her over the top with her new E passive (seen below).\r\n\r\n\r\n\r\nW (if changed): Throws out a Fan of knives in a frontal cone dealing 80/100/120/140/160 per dagger hit (for each subsequent dagger damage is reduced by 25), daggers pass through units and additionally reduces each dagger&#039;s damage for every unit hit (something around 10, to a minimum of 50/70/90/110/130 respectively). The universal cooldown is 7 seconds\r\nW (if current one is changed): Damage remains the same as the live server&#039;s, Cooldown has been increased to 6 seconds however drops back down to 4 at rank 5 e.g. 6/5.5/5/4.5/4. Movement speed buff has been removed and scaling has been buffed to 30% AP scaling.\r\n\r\n\r\nMy reasoning for having 2 ideas of W is because I&#039;m unsure whether or not this should be changed. If it were to be changed this new W fits nicely as it provides situational poke as well as another factor to differentiate good Kats from great Kats. If it remained the same, the ratio and CD just need a tweak and the movement speed is now removed due to the introduction of the 2nd passive.\r\n\r\n\r\n\r\n\r\nE: Now has a passive which reads; &quot;When Kat kills an enemy champion she gains +30/40/50 AP as a buff, which stacks multiple times.&quot; E now functions like a Yasuo E in the nature that you now get a lockout vs enemy champs for X amount of seconds. E&#039;s cooldown is now reduced by 20/30/40/50/60% when used on an ally CHAMPION. E no longer has the damage mitigation buff.\r\n\r\n\r\nChanging E to have Yasuo&#039;s lockout makes sense, as it prevents Kat from shunpo&#039;ing mindlessly in fights. E refunding % CD upon using it on ally champions makes sense as well, as it is her primary form of getting into fights. E no longer having the damage mitigation buff is due to the new Ult. The new E passive gives Kat more rewards for her resets, while minor the AP buffs make her feel like that voracious assassin that people know, and people will fear her resets even more.\r\nIn addition, ward hopping is kept intact as it is one of Kat&#039;s best options.\r\n\r\n\r\n\r\n\r\nR (Ultimate), aka. Killer Instincts 2.0: This empowers Katarina&#039;s next basic ability. \r\nEmpowered Q now instantly procs. her passive when the ability lands on an enemy, Grevious wounds is applied and potentially Dagger can now bounce between targets 2 times now (though it won&#039;t act like a Fiddle E), each bounce counts towards refilling your 2nd passive.\r\n\r\nEmpowered W (new) turns into an AOE spread of knives starting at 1 wave and increasing to 2 and 3 upon each ultimate rank. This damage is applied over 0.75 second and damage is no longer reduced when passing through units.\r\n\r\nEmpowered W (current, if that route is taken): W now slows by 30-40% and applies magic damage in the form of a bleed effect.\r\nEmpowered E, returns your damage mitigation upon the first time you E, and your next ability deals X% amount of current HP (+their a % of their BONUS HP). Your E passive is also doubled and has a duration of 10 seconds before the potential buff runs out, the bonus of AP now being 60/80/100 per reset.\r\n\r\n\r\n\r\nThis Ultimate in short basically highlights Katarina&#039;s main form of damage, her basic combo, as her current ultimate feels like a revved up basic ability that can be cancelled by any form of hard CC. As such I thought that some utility was needed in the form of buffing up her resets further and giving her options to separate good Kat players from amazing Kat players. No empowerment is directly better than the other. Q is best for chasing and high mobility, W(reworked) is best for high amounts of quick AOE damage; W(old) would have a have slow and apply a bleed in magic damage. E is best designed for cleanup and getting to use the most potential damage. Although the current HP+Bonus HP seems random, it helps her to deal with tanks which are still above 1/2 HP in fights and again, goes with the &quot;all in&quot; playstyle.","replies":[{"poster":"Sloth Almighty","date":"2016-08-31T23:04:36.279+0000","up_votes":1,"down_votes":0,"body":"I don't understand why they are reworking champions? Popular ones in particular. I don't see anything wrong with Kats kit, its not too op nor is it under powered. It all comes down to your skill level with her, and knowing when to engage etc.\nCan't they just put the 'new abilities' and time into making a new champ?","replies":[{"poster":"Miicka","date":"2016-09-01T12:37:16.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sloth Almighty,realm=OCE,application-id=Ntey9fRZ,discussion-id=slwL50RV,comment-id=0001,timestamp=2016-08-31T23:04:36.279+0000)\n>\n> I don&#x27;t understand why they are reworking champions? Popular ones in particular. I don&#x27;t see anything wrong with Kats kit, its not too op nor is it under powered. It all comes down to your skill level with her, and knowing when to engage etc.\n> Can&#x27;t they just put the &#x27;new abilities&#x27; and time into making a new champ?\n\nWhen they update entire classes, it's not really a 'rework' to champions, it's more of a refinement. I totally agree with you though. I hate katarina, but even I have to admit she didn't need a 'rework'.","replies":[]}]},{"poster":"Miicka","date":"2016-09-01T12:35:21.552+0000","up_votes":1,"down_votes":0,"body":"Tl:dr please","replies":[]},{"poster":"DipperOCE","date":"2016-08-31T14:27:44.912+0000","up_votes":1,"down_votes":0,"body":"Based on what Scarra and other people have vaguely said, the leak looks pretty likely and I wouldn't be surprised if that ended up been similar or exactly what it is. Cool idea too!\n\nThat been said everyone who plays Kat is dedicated so separation of them from amateurs wouldn't be that common. Katarina needs to be fast, and needs to have multi-target damage. Whatever the rework ends up like, I don't care as long as it vaguely fits that description.","replies":[{"poster":"catch this work","date":"2016-08-31T14:29:50.883+0000","up_votes":1,"down_votes":0,"body":"Removing ward hopping and not changing Ulti just seems way too iffy to ever push Katarina in the right direction.\n\nAlso, thank you for your appreciation ^_^ Every bit of feedback is helpful as I'm looking to at least guide Riot in the semi-right direction with Kat as she's my favourite champion by far.","replies":[{"poster":"DipperOCE","date":"2016-08-31T14:42:07.139+0000","up_votes":1,"down_votes":0,"body":"To be far, no ward jumping with E is confirmed. More resets for E is also confirmed. This is very ambiguous as to what it means and if she has other means to do similar things but it could also mean that you need targets or allies to jump.","replies":[]}]}]}]}