{"poster":"fmdf","date":"2017-06-30T21:47:06.110+0000","title":"My password got changed but my email is verified and my email was not compromised, possible?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hi,\r\nYesterday I played a decent session of league, took a break for a few hours then went to log back in. \r\nPassword didn&#039;t work. Typed it like 5 times slowly, no good.\r\nChecked my email, had an email from Riot &quot;Riot Games password change request&quot;, time was during my break.\r\nRiots password change email was unread, confident they haven&#039;t gotten access to my email and used the link, so how did they change the password, do they have the original password? I didn&#039;t give it to anyone so I&#039;m trying to figure out what happened. Malwarebytes scan shows perfectly clean.\r\nI then use the link to change it myself.\r\n\r\nSo here&#039;s my questions:\r\nWhat is the minimum information needed to change a password, I am guessing they somehow got my password?\r\nWhere are passwords stored on Riots side / during transmission / in my pc&#039;s local logs, are they encrypted?\r\nIs Riot looking at implementing additional security protocols, I like the sms verification services offered by other companies for things like password or login credential changes.\r\n\r\nMy 2c\r\nTBH for most games no one REALLY cares about account security, but League is a huge time investment to get to 30, and then even more in Ranked. If it was a casual jump in and out no one would care, but for the time and money people put into this game I&#039;d say it is worth upgrading your security to make it more difficult for accounts to be compromised.","replies":[{"poster":"Tele","date":"2017-07-02T01:10:02.458+0000","up_votes":1,"down_votes":0,"body":"I wouldn't be so sure your email wasn't breached. It's not very hard for a hacker to simply mark the email as unread.\n\nLook up your email and username on [haveibeenpwned.com](https://haveibeenpwned.com/). If it returns a positive result for either, change your email password NOW. But I would strongly advise you to do so anyway. It would also be wise to contact [Riot Support](https://support.riotgames.com/hc/en-us/requests/new) and let them know what happened.\n\nNow to answer your questions:\n\n>_What is the minimum information needed to change a password, I am guessing they somehow got my password?_\n\n+ The minimum information is your email log-in info. You can get a password change through Riot support too, but you need an insane amount of personal information.\n\n> _Where are passwords stored on Riots side / during transmission / in my pc's local logs, are they encrypted?_\n\n+ Riot's not releasing info on where they are stored anytime soon, but **Riot Tryndamere** has [confirmed](http://forums.euw.leagueoflegends.com/board/showthread.php?t=727232&page=1) a few years ago that they use _\"encrypted password hashes\"_.\n\n> _Is Riot looking at implementing additional security protocols, I like the sms verification services offered by other companies for things like password or login credential changes._\n\n+ Yes they are actually. There's a SMS system on PBE right now and Riot has announced publicly [here](https://www.riotgames.com/riot-games-security) that SMS verification is coming soon.","replies":[]}]}