{"poster":"LordHippoman","date":"2015-01-24T00:28:55.107+0000","title":"Let's Talk About Lore.  Together.  @Fans, @Riot, @Whoever.","subforum":"Story, Art, & Sound","up_votes":88,"down_votes":6,"body":"People being upset about the retcon is no surprise to any of you, I'd wager.  But this has been going on for months now, and all we can seem to do is argue and point the fingers at eachother.  A lot of the discussion seems to be about if this is Riot's fault, or ours, or whatever.  I think the problem is at least on both ends.\n\nFor every attempt to fix things the Lore team makes, when Jaredan or CarnivalKnights comes into a thread, someone rambles off about how this is (and I'm quoting here) \"the worst decision since the 1933 German elections\".  Remember Opeli?  Remember the death threats?  The Twitter raid GD got dragged into?  Remember the last time someone made a \"Tech Issue Must Be A Lie!\" thread and IronStylus shut them down?  Every attempt to forge a new connection is sabotaged by roughly a handful of people who feel the need to throw out every edgy zinger they think up or think they're fighting some kind of internet war where if you aren't with them, you're against them, and Riot is some crushing entity trying to smash their homes. \n\n And there's issues with communication with Riot, I'm not going to say that's not true.  Lore is an extremely marginalized area.  The president of the company was even unaware about what was going on with Lore.  It's not the biggest focus.  You just have to check the client and see the spot where Nikasaur or Phreak would discuss community fan work and see #BIGPLAYS ZED BLINKS FOR 10 SECONDS STRAIGHT instead to know that the focus towards community has shifted.  It's just the nature of things.  Lore is a super small part of a shrinking focus on fan work, and I doubt the writers are any more happy about that than we are.  And I hate to invoke this, but we saw what happens to MOBAs that put Lore first nowadays.  It was called Dawngate.\n\nThere are a ton of people here who make a ton of good threads.  CaptainMarvelous continues to make solid Lore Discussion threads almost every week.  CupcakeTrap's Bandle City thread and Bilgewater thread were really good, and I've had a great discussion with him in client about reasons we like League's lore, our favorite city states, etc.  And it was great.  I also talked with Rioters on the forums a few times, about dumb stuff like Jarvan's staunch approval of \"The Bro Code\" and more serious things like what was going to happen after the League retcon.  And it was great.\n\n This is so frustrating to me because I don't think we're at a good place right now, I don't like the retcon, but I don't think this is the way to go about fixing it.  This constant fighting and tinfoil hatting over how we're being \"TRICKED AND PACIFIED\", every single red post breaking out into an argument, etc.  I have posted almost exclusively on the Lore Forums for like 4 years now, mostly because I like the people here.  I know a lot of the people here.  And we enjoyed the forums and the discussions, and that demographic is growing with boards because of the international aspect of it.  EUW, NA, LA, etc., are no longer separated, and that opens the floodgates for a ton of potential discussion on Lore.  But it kills me to see that time being spent fighting over absolutely everything.\n\nThis is not a binary issue.  The Lore team's goal is to put out good lore.  That makes them money and gets them appreciation.  Lore fans want to consume good lore.  That makes us happy and gives us stuff to talk about.  So why are we treating it like a fight?  It's not one.  You don't have to declare your allegiance to Riot or the fans.  You should want to work with both.  You don't have to choose between the LeagueFactions lore or the Official Lore, or the Old one or the New one or even the Beta one where Kayle shot fire for some reason.  You can talk about them all, you can enjoy them all, you don't have to pick a side.  You aren't going to stop playing League just because you also like to play WoW or Dota or Smash Bros. or something.  Nobody is forcing you to like the new lore or the old one.  And they shouldn't.  There was such a good community here, folks.  There still is.  This isn't about fighting to \"Take Back Lore\" or to \"Shut up the whiners\".  It's about working with the people who make the Lore to create something we can all enjoy.\n\nCome on, people.  Let's talk about Lore.  Together.\n\nEDIT: Goddamn, top thread on the \"Hot\" sorting for Story and Art, 43 upvotes, and a Red Post.  Certainly did not expect that.  I appreciate it, ladies and gentlemen.  I really don't want to see this community I've loved for so long break apart, and I'm thankful for all the discussion posts and opinions being weighed in in the comments.","replies":[{"poster":"Riot Sweet","date":"2015-01-25T03:33:38.862+0000","up_votes":29,"down_votes":2,"body":"Hey, wanted to hop in here and say this was a really well-crafted post. I can't specifically speak to the Lore team and past/present conditions but I will be sending this discussion thread over to someone on their team, see if they'll consider jumping in for some good back-and-forth. \n\nAppreciate you taking the time to make this. \n{{champion:96}}","replies":[{"poster":"Hellioning","date":"2015-01-25T04:59:36.943+0000","up_votes":22,"down_votes":2,"body":"This is actually a common thing, Sweet. We've had more non-lore rioters come in and say 'we heard you! I'm forwarding this to the lore team!' than actual lore rioters talking about things, it's really sad.","replies":[{"poster":"Jeddy017","date":"2015-01-25T05:53:16.000+0000","up_votes":11,"down_votes":1,"body":"Even if a lore member came,wouldn't they just say the usual response,\"I hear your concerns,but don't worry we got more content on the way.\", & leave once they said it?","replies":[]},{"poster":"Boswick","date":"2015-01-25T05:20:46.635+0000","up_votes":6,"down_votes":2,"body":"This is not the first time i've been excited to see a red post in a lore thread  *(finally!)* only to be let down upon finding out it's not a narrative rioter that can discuss the issue. (No offense Sweet.)","replies":[]}]},{"poster":"TerraRising","date":"2015-01-25T06:14:18.544+0000","up_votes":11,"down_votes":3,"body":"> [{quoted}](name=Riot Sweet,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0012,timestamp=2015-01-25T03:33:38.862+0000)\n>\n> Hey, wanted to hop in here and say this was a really well-crafted post. I can't specifically speak to the Lore team and past/present conditions but **I will be sending this discussion thread over to someone on their team, see if they'll consider jumping in for some good back-and-forth. **\n> \n\nI won't mince words:  Chances are high they won't bother responding.\n\nI'm not going to go into the historical cycle with Narrative and their failures at \"communication\" with their fans, but it's safe to assume that they're already aware of this thread, since \"Riot employees are always looking at the boards, even if they don't respond.\"  Since it's safe to assume they're aware of the thread, if they *really* wanted to start the healing process and discuss things, they would have.\n\nI really, really want a healthy environment where Narrative and their fans can talk about story ideas, important champion concepts and the like.  But until Narrative steps up and starts regular conversations and Riot puts focus on communication away from eSports, skin sales and their other higher priorities, that's not going to come close to happening.","replies":[]},{"poster":"Xano501","date":"2015-01-25T04:28:14.974+0000","up_votes":5,"down_votes":11,"body":"***","replies":[{"poster":"kitcat300","date":"2015-01-25T05:20:45.593+0000","up_votes":9,"down_votes":1,"body":"Why? They are friends because they have something in common, both are now residents of Ionia who were animals who developed human like traits because of magical intervention. \n\nNothing was changed at all. Adding to a story is how character development works.","replies":[]}]}]},{"poster":"Nybx4life","date":"2015-01-24T03:21:29.853+0000","up_votes":19,"down_votes":0,"body":"You know what I'd like? I think an Archive of its previous lore to be accessible by the community would be nice. I'd like to see how the lore specifically changes per champion and as a whole, and I think it would be great to analyze it, and maybe ask some of the writers what they thought about certain aspects of the lore changes.\n\nI mean, comic books do reboots all the time, as do their canon. At least there you can see how a character changed.","replies":[{"poster":"LordHippoman","date":"2015-01-24T03:50:17.432+0000","up_votes":6,"down_votes":1,"body":"I usually use ThorRush's archived sticky thread on the old Lore Discussion boards, but an official site would be cool.","replies":[{"poster":"Nybx4life","date":"2015-01-24T04:25:22.975+0000","up_votes":4,"down_votes":0,"body":"Yeah. I mean, there seems to be enough people that care about the lore, and there's a good amount of writers in Riot that care about the lore (despite what some may say), so an official spot where all the lore can be seen would be nice. Hell, since it seems that there's a retcon coming, I'd like to see also some of their trashed ideas. Might be something worth bringing up to make a new champ or faction.","replies":[]}]}]},{"poster":"TerraRising","date":"2015-01-24T03:30:37.255+0000","up_votes":19,"down_votes":2,"body":"In theory, this would be ideal and I'd fully support it...\n\nIn practice, there are a few flaws:\n\n* **Narrative is in full charge of the conversation:** Someone from Narrative could, in theory, come in and say \"*we're not going to discuss the ret-con or anything else, but what do you think of ?*\" and use that to gather ideas and provide feedback.  Even if they didn't use a single idea, the notion of them *asking* for feedback would be a powerful start.\n* **The silence has gone on too long:**  Except for one message from Carnival Knights on a joke thread and a handful of standard Riot-issue non-answers about Foundations from Riot Whren, they've gone into complete silence for the past two months.  Nothing new about the tech issues supposedly preventing them from releasing content or progress on the new bios and the retcon, etc.  The cycle of silence and broken promises from Narrative/Lore has fully repeated once again.\n\nAgain, I'd love to put all that history in the past and start fresh, but the first step has to come from Narrative.  They have to be willing to start the conversation and stick with it.  They have to provide some feedback on the ideas we have and be willing to work through the wall of ice they and their previous associates have built.  And they should do it as soon as possible.","replies":[{"poster":"RiotJaredan","date":"2015-01-26T01:25:10.773+0000","up_votes":15,"down_votes":5,"body":"> [{quoted}](name=TerraRising,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004,timestamp=2015-01-24T03:30:37.255+0000)\n>\n> In theory, this would be ideal and I'd fully support it...\n> \n> In practice, there are a few flaws:\n> \n> * **Narrative is in full charge of the conversation:** Someone from Narrative could, in theory, come in and say \"*we're not going to discuss the ret-con or anything else, but what do you think of ?*\" and use that to gather ideas and provide feedback.  Even if they didn't use a single idea, the notion of them *asking* for feedback would be a powerful start.\n> * **The silence has gone on too long:**  Except for one message from Carnival Knights on a joke thread and a handful of standard Riot-issue non-answers about Foundations from Riot Whren, they've gone into complete silence for the past two months.  Nothing new about the tech issues supposedly preventing them from releasing content or progress on the new bios and the retcon, etc.  The cycle of silence and broken promises from Narrative/Lore has fully repeated once again.\n> \n> Again, I'd love to put all that history in the past and start fresh, but the first step has to come from Narrative.  They have to be willing to start the conversation and stick with it.  They have to provide some feedback on the ideas we have and be willing to work through the wall of ice they and their previous associates have built.  And they should do it as soon as possible.\n\nI'm fine with discussing the reset of Runeterra, the issue is I've put forward answers that folks, understandably, don't agree with and it's hard to respond with points that will be satisfying as they're dependent on the content we want to produce due to the changes we have made. When I continue to give similar answers, the response from players on the boards (again, understandably) is that I'm not saying anything new and that \"trust us\" isn't a viable response in the time between content.\n\nI can reiterate until the cows come home, but until they're carrying some stories with them (that metaphor got away from me quickly), I feel like I'm just being annoying to a bunch of folks—mainly as they tell me how annoyed they are.\n\nThe tech issue has been about as frustrating as it could be all around. From my perspective, being able to talk specifically about new content, about those champs and their affect on the world of Runeterra, is the primary way to really engage about the world of story we want to build without it being hypothetical. For folks on the board, it must seem bewildering that something as apparently simple as putting words on a web page can go on for so long. The complexities are there though. We're trying to get a solution that frees us to deliver content a little differently from a technical standpoint and there have been hiccups as we go, as seen by the unfortunate Amumu-related occurrence last month. That was a test run that didn't work out.\n\nThe tech-issue alone has not been the complete reason for the delay in some of the content we want to deliver.\n\nNarrative is undergoing a number of changes as we attempt to level up in much the way the Art team has in recent years. I'm not going to be able to talk specifics, but it includes prioritization, organizational structure, personnel and so on. In other words: lots of stuff. Before anyone asks: I'm not going to talk about specific people who are not part of the Narrative discipline out of respect for them. It's an endeavor that has taken up a lot of my personal time, but I certainly should be engaging more than I have. I'm attempting to rectify that.\n\nMy personal lack of engagement in the last couple of months is, no matter the circumstances, utterly my fault, and I apologize for that. Continuing to foster a positive dialogue with you should always be a priority and I've been unable to respond in the way I want to.\n\nI greatly appreciate everyone's passion on these boards, I share it, as does every member of the Narrative team. I simply want to be one of the many folks helping to move things forward, both in the content Narrative produces, and in the conversations between us and you, the players.","replies":[{"poster":"EnvyDragon","date":"2015-01-26T01:33:53.325+0000","up_votes":11,"down_votes":0,"body":"What bothers me about responses like this is that it amounts to \"We'll talk eventually, maybe, possibly,\" when you could literally create one official discussion post, check it once a day for a day or two, and solve 90% of the crowd's concerns.\n\nFrom our side, it looks like *complete silence.* I know consciously that you guys are probably working feverishly behind the scenes, but saying \"it'll get there eventually\" doesn't help when you are literally giving words to excuse the lack of words you have given.\n\nMost of the people complaining are consistent forumgoers. This is the case because the people who want more *actively seek out more.* You're clearly capable of posting on the forums, and since the forums are a much less formal environment, you could post some bits and pieces, or a Q&A, or even just have a casual discussion and people would be - if not totally satisfied - then at least a little bit sated.","replies":[{"poster":"RiotJaredan","date":"2015-01-26T01:47:17.698+0000","up_votes":16,"down_votes":2,"body":"> [{quoted}](name=EnvyDragon,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=000400000000,timestamp=2015-01-26T01:33:53.325+0000)\n>\n> What bothers me about responses like this is that it amounts to \"We'll talk eventually, maybe, possibly,\" when you could literally create one official discussion post, check it once a day for a day or two, and solve 90% of the crowd's concerns.\n> \n> From our side, it looks like *complete silence.* I know consciously that you guys are probably working feverishly behind the scenes, but saying \"it'll get there eventually\" doesn't help when you are literally giving words to excuse the lack of words you have given.\n> \n> Most of the people complaining are consistent forumgoers. This is the case because the people who want more *actively seek out more.* You're clearly capable of posting on the forums, and since the forums are a much less formal environment, you could post some bits and pieces, or a Q&A, or even just have a casual discussion and people would be - if not totally satisfied - then at least a little bit sated.\n\nAbsolutely fair point. I'll put something up this week for specific discussion. If you'll forgive me if I don't right now as I have a shivering man-flu and the spots in front of my eyes mean I don't fully trust my ability to rationally produce words. I just wanted to make sure I addressed the thread in some form as I've been wanting to get on the boards a while and a fellow Rioter kindly poked me about this in particular.","replies":[{"poster":"Slushi Simcambi","date":"2015-01-29T02:51:28.631+0000","up_votes":2,"down_votes":0,"body":"So... are you going to put something up for discussion?\nIt's halfway through the week and I was just wondering...\n\nI might have missed it, but would be very disappointed if you just fled back to the ever elusive Lore Department.\n\nSorry If I'm acting jumpy, but this is the first hint of positive Riot interaction around here in a while and I would be loathe to have it destroyed.","replies":[{"poster":"RiotJaredan","date":"2015-01-30T19:06:33.682+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Slushi Simcambi,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=00040000000000000002,timestamp=2015-01-29T02:51:28.631+0000)\n>\n> So... are you going to put something up for discussion?\n> It's halfway through the week and I was just wondering...\n> \n> I might have missed it, but would be very disappointed if you just fled back to the ever elusive Lore Department.\n> \n> Sorry If I'm acting jumpy, but this is the first hint of positive Riot interaction around here in a while and I would be loathe to have it destroyed.\n\nYes we will be, sorry. I'm out sick as the proverbial dog at the moment. Something will go up today.","replies":[]}]},{"poster":"Jeddy017","date":"2015-01-26T05:58:15.166+0000","up_votes":7,"down_votes":0,"body":"All I want & do believe I can reasonably get are 2 discussions:\n 1) Where we basically talk about the overall direction of the world of Runeterra & it's inhabitants.It's plain,it's simple,everyone can post & discuss their ideas (Reds included) & the narrative team don't have to worry about spoilers.We're talking ideas,not who dies at the ends\n2) Ways of bringing this lore to the LOL community.There is a good chunk of LOL players who aren't aware or care about the lore.Whether it be it's own website with an ad in-client or some newsfeed that tell people,\"Hey,we got this new lore material about Helmet Bro we want you to come check out.\"","replies":[]}]}]},{"poster":"TerraRising","date":"2015-01-26T05:08:35.866+0000","up_votes":13,"down_votes":0,"body":"I'm glad a Red from Narrative finally posted on this thread.  I'm sad that it took another non-Narrative Red to poke you in the right direction.  Frankly, I really don't like the precedent being set that someone else has to get you guys to start posting here..\n\nOkay, I'll get straight to the point.  I'm seeing a number of things that troubles me in your post, whether it's intentional or not.\n\n>The tech issue has been about as frustrating as it could be all around. From my perspective, being able to talk specifically about new content, about those champs and their affect on the world of Runeterra, is the primary way to really engage about the world of story we want to build without it being hypothetical.\n\nThen why not do something else in the interim since the tech issue doesn't appear to be getting fixed in the near future?  If the boards aren't an ideal solution (like Azir, Xerath and Kalista) aren't the best option for you, is there a workable alternative you can use right now that's available to you?  Is this truly a matter of \"It has to be done the right way or there's no way we do it at all?\"\n\n>For folks on the board, it must seem bewildering that something as apparently simple as putting words on a web page can go on for so long. The complexities are there though.\n\nIt doesn't seem bewildering.  It **IS** bewildering.  Supposedly, Riot hires the best people in the business and an issue that you said would be \"fixed in a week or so\" continues to plague both creator and consumer.  Compound that with the fact that there are still a bunch of half-written bios (Shurima and Shadow Isles) floating on the website and the client with no updates about if or when they may be finished and we.\n\n>We're trying to get a solution that frees us to deliver content a little differently from a technical standpoint and there have been hiccups as we go, as seen by the unfortunate Amumu-related occurrence last month. That was a test run that didn't work out.\n\nNice to see you're trying.  However, when I posted that story in these forums, one of you could have popped in and said \"We're just trying something to alleviate the tech issues we've.   Please bear with us.\"  Instead, we got nothing from Narrative and were led to assume that these issues were fixed when they were not.\n\n>The tech-issue alone has not been the complete reason for the delay in some of the content we want to deliver.\n>\n>Narrative is undergoing a number of changes as we attempt to level up in much the way the Art team has in recent years. I'm not going to be able to talk specifics, but it includes prioritization, organizational structure, personnel and so on. In other words: lots of stuff. \n\nAnother one of these?  We had one when the Journals of Justice and League Judgements were shut down in mid 2012.  We had a few during the post-Freljord debacle and we just had one Immediately after the Retcon announcement.  All these changes to Narrative, be it the direction, the goals, the personnel, the prioritization or whatever, and it always winds up with a whole lot of silence towards the fans who care about this stuff the most.\n\n>Before anyone asks: I'm not going to talk about specific people who are not part of the Narrative discipline out of respect for them. It's an endeavor that has taken up a lot of my personal time, but I certainly should be engaging more than I have. I'm attempting to rectify that.\n\nIt shouldn't be up to one person to tank the brutality the *entire department* is responsible for.  You all write as a team, you all create as a team, you all should be willing to accept direct criticism (and anger) as a team.  No one needs to be a martyr.\n\nHell, if the Narrative team can spend hours working on and playing the weekly D&D game over Twitter, surely they can spend a few hours talking on the forums with fans and finding out what our thoughts are?\n\n>My personal lack of engagement in the last couple of months is, no matter the circumstances, utterly my fault, and I apologize for that. Continuing to foster a positive dialogue with you should always be a priority and I've been unable to respond in the way I want to.\n\nAgain, why is it up to you, and you alone, to communicate with us when there's an entire team working on these issues?  Teamwork OP and all that.\n\nThis last one is just a side question:\n>I greatly appreciate everyone's passion on these boards, I share it, as does every member of the Narrative team. I simply want to be one of the many folks helping to move things forward, both in the content Narrative produces, and in the conversations between us and you, the players.\n\nI have to ask if using phrases like \"We appreciate your passion\" and \"We understand your disappointment\" are new company policy when dealing with fans.  I've heard these exact words far too often when conversing with people from Riot about my issues with them, from Tryndamere down to people on the customer service / support level.  I mean, it's getting to the point with me where question the sincerity of the statement.","replies":[]},{"poster":"CupcakeTrap","date":"2015-01-26T18:15:12.397+0000","up_votes":13,"down_votes":1,"body":"Thanks for posting, and I hope you feel better. (**[Take Nurse Flan's medicine, and don't push yourself too hard.](http://leaguefactions.net/nyroth-update-5/)**) As usual, I'm writing a somewhat critical post; I don't feel that anything else would be honest. But I do respect your passion and believe you're trying to do the right thing. (I should also perhaps add that I've really enjoyed some of the material you guys have put out; the Rek'Sai piece was particularly good, and fully consistent with established lore. I could say the same for the new Sion. I like my League lore a little derpy, but you sold me on the played-straight Sion.)\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=00040000,timestamp=2015-01-26T01:25:10.773+0000)\n> I can reiterate until the cows come home, but until they're carrying some stories with them (that metaphor got away from me quickly), I feel like I'm just being annoying to a bunch of folks—mainly as they tell me how annoyed they are.\n\nI don't think that's quite accurate. Indeed, I'd prefer that Narrative engaged with the community before those metaphorical cows returned laden with stories. My principal objection to Narrative's current modus operandi is that it involves appearing out of nowhere with sweeping retcons that tear up the foundations of the established lore. With years and years of community investment in League's lore—not just in terms of enjoyment, but in terms of community creativity and content creation—this approach is highly problematic.\n\nIf what you're releasing is standalone or \"backwards-compatible\" lore, i.e. lore that does not implicitly retcon major pieces of established lore, then I guess shock reveals are okay. Shock reveals are exciting, at least, and sometimes you really want the idea to be judged in its intended context of a finished story; sometimes ideas sound really awful until you see them in practice. Fair enough.\n\nBut if you're thinking about major retcons—deleting the Brackern, moving the Crystal Scar out of Kalamanda, erasing the Mothership, whatever—then I think the debatable advantages of the shock reveal must yield to community engagement. \"So, we're thinking of making Zed and Shen best friends now, what do you think?\" or \"We think Annie should be from Shurima and no longer have any ties to Noxus.\"—these sorts of changes warrant some kind of discussion. League's lore is a living universe, which means there's a significant cost to disruptive retcons. If you were writing a book, or developing a new universe, the only justification needed for a change would be \"I think it's better.\" When you're talking about a lived-in universe, you need more than that, and sometimes it's worthwhile to accept a little awkwardness or handwaving to maintain backwards compatibility. Even when they retconned much of the Star Trek universe for the new movies, they took pains to explain the \"alternate timeline\" idea, not because it was a particularly interesting plot element in itself, but out of respect for the massive Star Trek lore universe.\n\nI'm not advocating design by democracy. But I really don't like the approach of \"slap something down, cause a lot of damage, show up to snap photos and make some jokes, then run off to start working on the next volley.\" It conditions us, in an almost Pavlovian way, to fear Narrative. It makes me, at least, feel like Narrative is a cannon blasting away at the League universe. I'd feel a lot better if you guys would at least **show up and talk about these ideas while they're still somewhat malleable.** You don't have to adopt the community's opinion, but I think it's fair that you at least hear us out and engage with us before radically altering established lore.\n\nAt this moment, I have no clue what Narrative is releasing next. That's not a good thing. I don't know if you're going to expand the League universe with your next update, or completely rewrite lore that we've been relying on for years.\n\nIf Narrative is planning more major retcons, I'd like to see them discussed publicly, and not in a one-way \"this is what we're doing, period, and we'll tell you about it now but we're already 100% committed\" form. It's your decision at the end of the day, but at least hear us out. Maybe we'll convince you to change directions. Maybe we'll come to see it your way. Maybe we'll put forward a small addition which you can use to keep the same essential story without treading on established lore. Or maybe you'll just pick up some extra ideas to mix in: we've been designing and re-designing the League universe for years, and I think we have some good ideas to contribute.","replies":[{"poster":"RiotJaredan","date":"2015-01-30T20:59:19.368+0000","up_votes":11,"down_votes":4,"body":"> [{quoted}](name=CupcakeTrap,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=000400000006,timestamp=2015-01-26T18:15:12.397+0000)\n>\n> Thanks for posting, and I hope you feel better. (**[Take Nurse Flan's medicine, and don't push yourself too hard.](http://leaguefactions.net/nyroth-update-5/)**) As usual, I'm writing a somewhat critical post; I don't feel that anything else would be honest. But I do respect your passion and believe you're trying to do the right thing. (I should also perhaps add that I've really enjoyed some of the material you guys have put out; the Rek'Sai piece was particularly good, and fully consistent with established lore. I could say the same for the new Sion. I like my League lore a little derpy, but you sold me on the played-straight Sion.)\n> \n> I don't think that's quite accurate. Indeed, I'd prefer that Narrative engaged with the community before those metaphorical cows returned laden with stories. My principal objection to Narrative's current modus operandi is that it involves appearing out of nowhere with sweeping retcons that tear up the foundations of the established lore. With years and years of community investment in League's lore—not just in terms of enjoyment, but in terms of community creativity and content creation—this approach is highly problematic.\n> \n> If what you're releasing is standalone or \"backwards-compatible\" lore, i.e. lore that does not implicitly retcon major pieces of established lore, then I guess shock reveals are okay. Shock reveals are exciting, at least, and sometimes you really want the idea to be judged in its intended context of a finished story; sometimes ideas sound really awful until you see them in practice. Fair enough.\n> \n> But if you're thinking about major retcons—deleting the Brackern, moving the Crystal Scar out of Kalamanda, erasing the Mothership, whatever—then I think the debatable advantages of the shock reveal must yield to community engagement. \"So, we're thinking of making Zed and Shen best friends now, what do you think?\" or \"We think Annie should be from Shurima and no longer have any ties to Noxus.\"—these sorts of changes warrant some kind of discussion. League's lore is a living universe, which means there's a significant cost to disruptive retcons. If you were writing a book, or developing a new universe, the only justification needed for a change would be \"I think it's better.\" When you're talking about a lived-in universe, you need more than that, and sometimes it's worthwhile to accept a little awkwardness or handwaving to maintain backwards compatibility. Even when they retconned much of the Star Trek universe for the new movies, they took pains to explain the \"alternate timeline\" idea, not because it was a particularly interesting plot element in itself, but out of respect for the massive Star Trek lore universe.\n> \n> I'm not advocating design by democracy. But I really don't like the approach of \"slap something down, cause a lot of damage, show up to snap photos and make some jokes, then run off to start working on the next volley.\" It conditions us, in an almost Pavlovian way, to fear Narrative. It makes me, at least, feel like Narrative is a cannon blasting away at the League universe. I'd feel a lot better if you guys would at least **show up and talk about these ideas while they're still somewhat malleable.** You don't have to adopt the community's opinion, but I think it's fair that you at least hear us out and engage with us before radically altering established lore.\n> \n> At this moment, I have no clue what Narrative is releasing next. That's not a good thing. I don't know if you're going to expand the League universe with your next update, or completely rewrite lore that we've been relying on for years.\n> \n> If Narrative is planning more major retcons, I'd like to see them discussed publicly, and not in a one-way \"this is what we're doing, period, and we'll tell you about it now but we're already 100% committed\" form. It's your decision at the end of the day, but at least hear us out. Maybe we'll convince you to change directions. Maybe we'll come to see it your way. Maybe we'll put forward a small addition which you can use to keep the same essential story without treading on established lore. Or maybe you'll just pick up some extra ideas to mix in: we've been designing and re-designing the League universe for years, and I think we have some good ideas to contribute.\n\nThanks for the kind words, and I'll reply as briefly as I can as I'm currently thinking around a quite beautiful sinus infection. Hopefully I don't cause too much consternation or say anything too daffy.\nI understand how changes cause issues, particularly when people are passionate about them and particularly disagree with them. It's honestly challenging on many occasions to give advance warning on them. \n\nThe \"shock reveal\" as you term it, is usually just an essential element of storytelling. It's hard to give you the crux of a thematic change to character in advance that would appear in any way positive without the context of the story to go along with it. If we tease parts of a story to give an idea of what it will be, then it's easy to misconstrue the intent and impossible to include all of the aspects of the character. Then we're giving answers of \"Wait for the full story.\" If we give you a rough version of the story (I'm sorry, this will never happen for many reasons, including legal ones), then we've essentially released the story, just in an incredibly unsatisfying way for most players.\n\nLet me use a hypothetical example of a movie I'm looking forward to this year. I can't ask J.J. Abrams for an advance copy of the script, or the outline, or the treatment for Episode VII without pretty much destroying the experience for myself. If I was to ask this in public, then anyone else who reads it is equally in spoiler territory. Also, if I made suggestions and they were then used in the script and the resulting movie, I could sue JJ's arse off for using my ideas without proper credit or compensation. \n\nI'm not saying Narrative is JJ Abrams and his team or a particular short story is Star Wars, but the point is that giving advance notice of stories is counter-productive for numerous reasons, including that it tips off not just what we are working on but also the work being done by the many teams that we are a part of.\n\nNarrative is not an independent body that just comes up with stories or characters. Most of the stories we create are directly to help fuel the Champion team with new champions and to express them in a way that makes them appealing to play and as new members of an enthralling world of story. In doing so we are also working to help with many other teams to deepen a unique IP that will hopefully last until the sun burns out. \n\nIn that process, there will be changes, and we're trying to make sure that we preserve the essence of those characters in whatever we do whenever we can.  To be honest, there will be times when we make changes that you don't agree with. Our task is to do so only when the benefits are greater than the costs for the players, for Runeterra and for the IP. The problems are very much pronounced when the benefits of those changes aren't immediately obvious to the players as we can't get the quantity and quality of stories out at that point. This is why we're working so hard behind the scenes to evolve the Narrative team to be able to do a much better job of doing that.\n\nEven then, there will be stories and changes that people don't like even with full context. There will be things that people prefer remained the same. Folks like you Cupcake, who decide that you want the version of the world that you like to live on and do something about that by creating your own stories is bloody wonderful. I've read all of Factions and had a good time doing so.\n\n\nWe don't want to just tear things up and start over. As you mentioned, quite a few of the stories recently have been perfectly conducive with the previous lore. The reason being that there are certainly strong elements that we will carry forward. Runeterra is the wellspring from which everything we do occurs, so most of it will be very similar.\n\nI'm starting to go round in circles in my ever decreasing mind so I'll wrap up in an utterly inelegant way.\n\nWe as a team, and I personally, need to do better in our communication with you. It means I'm going to be as clear as I can as often as I can. In the past it's been challenging, to be honest, because I've felt I need to parse every word so I don't infuriate this board in particular. The smallest post means I spend a bunch of time editing it. For example, I made a half-arsed joke months ago about Nashorzilla and that's been used as evidence that Narrative doesn't understand Runeterra or deserve to work on it.   I'm learning the best way to talk with all of you and I hope my stream of consciousness in this post in the midst of a repeating explosion of green gunge is taken in the way I intend: I just want to be honest and I want us to figure out a way that we can move forward.\n\nSpeaking of which: with the things I've said in mind, what does everyone want to talk about? What would be a cool series of things we would do weekly to just chat about? I know folks have made suggestions before, but something to just refer to here would be cool, mainly as I need to go lie down now. We're going to put something up today on the boards in the meantime, but I'd like a repeated conversation that helps us communicate openly to be born out of your ideas.\n\nBloody hell my \"brief reply\" went on.","replies":[{"poster":"Chromatic Eagle","date":"2015-01-30T22:25:47.219+0000","up_votes":9,"down_votes":2,"body":"That line of you preserving the essence of a champion worries me. What does Riot think of when they say that? Look at Xerath. If you asked the fans, many of us would say he's a man who's obsessed with magic. Unlimited magic without form. He does it for magic's sake, but was willing to give it up for love. New Xerath, post retcon, is a man who uses magic as a tool for revenge. Had he gotten his freedom, he wouldn't be as skilled with it as he is today. \n\nSomeone is going to come in here and mention Trundle. Old Trundle was an outcast who wanted the approval of his people. He made sacrifices to gain respect. New Trundle is a brute who wanted to be leader out of ego. Both versions sold out their people, but for different reasons. \n\nHow Riot sees a champion, and how players see a champion are different. Take Poppy for example. If IronStylus hadn't ask us how we saw Poppy, would you have settled for the same identity as the fans? Taric is another example.\n\nAs for things to discuss, what are we allowed to discuss? Can we discuss world building? The challenges of removing the League (not whether or not it should've been done), such as what has kept Demacia and Noxus from fighting each other, or how the past conflicts were settled without the League? Are we allowed to discuss currency? You mentioned Noxian coin, but what about Demacia and other nations? What type of world are you looking to build? A serious world despite Rammus and Gragas? A light-hearted world despite Sion and Rek'Sai?","replies":[{"poster":"CupcakeTrap","date":"2015-01-30T23:30:21.248+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=Chromatic Eagle,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=00040000000600000006,timestamp=2015-01-30T22:25:47.219+0000)\n>\n> That line of you preserving the essence of a champion worries me. What does Riot think of when they say that? Look at Xerath. If you asked the fans, many of us would say he's a man who's obsessed with magic. Unlimited magic without form. He does it for magic's sake, but was willing to give it up for love. New Xerath, post retcon, is a man who uses magic as a tool for revenge. Had he gotten his freedom, he wouldn't be as skilled with it as he is today. \n\nI have to agree on Xerath. I feel that revenge is becoming overused as a motivation. (The running joke is that \"And then CHAMPION joined the League of Legends.\" is being replaced with, \"And now CHAMPION wanders Valoran, in search of vengeance.\") I preferred the idea of Xerath simply becoming obsessed with power and the cosmos. The two ideas are not totally incompatible, of course, but it felt…unnecessary? I don't think you need the \"slave\" backstory to explain animosity between Xerath and Azir. My version was just to have **[cults to Xerath](http://leaguefactions.net/12-secrets-of-shurima/)** springing up in the aftermath of all that Ascension nastiness, and Xerath naturally being unwilling to share power with some lowly mortal.\n\nIt wasn't bad, though. My favorite part of the new lore was the exploration of what a telepathic society might be like. But yes, the reliance on vengeance as a motivation seemed weak.","replies":[]}]},{"poster":"CupcakeTrap","date":"2015-01-30T23:22:46.110+0000","up_votes":8,"down_votes":0,"body":"I believe this is the most thoughtful and honest reply we've received on this topic from Riot so far. I appreciate it. And while it seems others are more cynical, I do believe it helps to point the way forward.\n\n**TL;DR:** If Narrative is planning radical changes to any of League's major settings, I think it's not unreasonable to ask for some kind of community discussion beforehand. Not a vote, a discussion. Perhaps just be a thread or two discussing the major proposed changes (\"we're going to move Demacia underwater\" or \"we think Piltover and Ionia should really hate each other\" or whatever), posted up early enough in the process that we're not just talking about what's already set in stone. This would also be an opportunity to ask the community, e.g., \"So what's important about Bandle City?\" or \"What ideas have you come up with for the Bandle City setting?\" I think this would greatly reduce the shock factor. It would also give us a chance to share our ideas with you. The lore community has come up with lots of ideas during Riot's long sleep.\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n> \n> Also, if I made suggestions and they were then used in the script and the resulting movie, I could sue JJ's arse off for using my ideas without proper credit or compensation. \n\nI'd like to start with this, and request some clarification. Do you mean that you've been warned by Riot Legal not to share **drafts** publicly (makes sense), or that they've told you that you can't solicit or discuss **ideas** with the community? The latter sounds pretty extreme. I know that Riot has made many skins based on community ideas, and regularly solicits feedback on Champion mechanics.\n\nIf Riot Legal tells you \"do not discuss lore ideas with the community, or read community lore ideas\", then I think we're pretty much dead in the water. But, though I'm no IP lawyer, that sounds very strange to me. Even if such a risk exists, surely it could be mitigated with a notice posted in idea threads along the lines of, \"By participating, you license Riot Games to make use of your ideas in original or modified form with or without attribution\" or whatever?\n\nI think this is important, because if you really can't even look at the community's ideas without massive legal risk, and there's no way to mitigate that risk to acceptable levels, then this whole thing is a non-starter.\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n>\n> The \"shock reveal\" as you term it, is usually just an essential element of storytelling. It's hard to give you the crux of a thematic change to character in advance that would appear in any way positive without the context of the story to go along with it. If we tease parts of a story to give an idea of what it will be, then it's easy to misconstrue the intent and impossible to include all of the aspects of the character. Then we're giving answers of \"Wait for the full story.\" If we give you a rough version of the story (I'm sorry, this will never happen for many reasons, including legal ones), then we've essentially released the story, just in an incredibly unsatisfying way for most players.\n\nSurprise is definitely an important part of storytelling. \"Ooh, what happens next?\" is an important motivator for the audience. I agree it would be super awkward to post a thread along the lines of, \"So, we're thinking Garen and Darius are going to fight. And Darius will wound Garen pretty badly, but then Soraka will patch him up and they'll talk about Ionia and Demacia.\" That would suck the excitement out of the story.\n\nIn this case, though, I'm talking about major thematic retcons, not specific plot developments. To continue the above example, \"So we're thinking that Ionia will actually be a floating island that hasn't had contact with the rest of Valoran in hundreds of years.\" That's a big thematic change, from Ionia as an internationalist state heavily invested in the politics of Valoran to Ionia as a mysterious new entrant that nobody had ever heard of before. That's the sort of thing that I think should be discussed beforehand.\n\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n> \n> Even then, there will be stories and changes that people don't like even with full context. There will be things that people prefer remained the same. Folks like you Cupcake, who decide that you want the version of the world that you like to live on and do something about that by creating your own stories is bloody wonderful. I've read all of Factions and had a good time doing so.\n\nWow! Thank you. I'm very happy to hear that. (You should share that with Riot DyQuill; he was a member of the Factions lore team before joining Riot, and did **[some great work](http://leaguefactions.net/shon-xan-update-8-scarlet-spring/)** on Shon-Xan. He also was the first to put forward the general concept of a **[\"lich queen\"](http://leaguefactions.net/hextech-revolution-update-2-opening-moves/)** character. Not that I'm recommending that you poach him from the team he's on, but poach him from the team he's on.) I'm not sure which specific pieces you worked on in the new lore, but I've liked most of it, and especially the Rek'sai piece.\n\nAll that said, even with a rather built-up universe of our own to maintain, I don't think we in Factions are completely averse to change. We've incorporated many significant lore changes as they've been released. We moved the latest arc to a mysteeerious island far, far away in part because we suspected that Narrative would be reworking Shurima considerably, and we didn't want to trip over any of that. (I think we dodged a bullet with **[Hextech Revolution](http://leaguefactions.net/hextech-revolution/)**, which so far isn't directly in conflict with anything from the new Shurima lore.) We lucked out with Sion, in that the retcon of his character coincided with the dimension-warping Battle of Shurima, which provides a great excuse for a jokey Last Action Hero reference and a magic ticket that will transform him into New Sion.\n\nHonestly, we'd like to be supportive of Narrative, and provide some grassroots energy for League lore generally. The problem is that Narrative's first major act was the Great Retcon. To call it a \"shot across the bow\" would be minimizing; it was a broadside. We'd rolled with many changes from Narrative, and honestly, we had fun with them—Udyr's shifting loyalty, for instance, or the arrival of Azir. But the erasure of the League and Summoners we simply couldn't adapt to.\n\nOn the bright side, most of the changes since then have been readily backwards-compatible, and I've enjoyed a lot of the new material. (I've said some snarky things about certain pieces of it; I hope you'll forgive me. It was, in part, a way to cope with the shock. ***THE ANCIENT WEAPON IS A KEY!*** #sorrynotsorry But I've genuinely enjoyed much of it, and said so.)\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n> \n> We don't want to just tear things up and start over. As you mentioned, quite a few of the stories recently have been perfectly conducive with the previous lore. The reason being that there are certainly strong elements that we will carry forward. Runeterra is the wellspring from which everything we do occurs, so most of it will be very similar.\n\nI for one greatly appreciate that the new lore is largely backwards-compatible. Thank you. Those little handwaves and off-hand references that keep it connected mean a lot.\n\n> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n> \n> We as a team, and I personally, need to do better in our communication with you. It means I'm going to be as clear as I can as often as I can. In the past it's been challenging, to be honest, because I've felt I need to parse every word so I don't infuriate this board in particular. The smallest post means I spend a bunch of time editing it. For example, I made a half-arsed joke months ago about Nashorzilla and that's been used as evidence that Narrative doesn't understand Runeterra or deserve to work on it. \n\nI suppose I should apologize for that, but it seemed consistent with the overall context of condemning the League as \"all-powerful puppetmasters\". Perhaps I have harped on it too often, but we don't have a lot of material from Narrative to draw on, and (to be perfectly honest) I sometimes feel like a tiny mouse throwing pins at the foot of a giant to say, \"Hey! I'm here! Don't step on me!\" Lacking Narrative's bully pulpit, us mouse-people (in this increasingly awkward metaphor) tend to resort to the sharpest material we have in order to get noticed.\n\nImplicit in that imagery is the idea of conflict. I'm not really happy with that conceptual frame. For one thing, it's ridiculous for a mouse to think about fighting a giant, so to speak. But I also really don't like that we have, or have had, an antagonistic relationship. I'm getting tired of throwing rocks at windows, or pins at giants' feet, or metaphors at a computer screen.","replies":[{"poster":"Finnical","date":"2015-01-31T06:00:00.669+0000","up_votes":8,"down_votes":0,"body":"> In this case, though, I'm talking about major thematic retcons, not specific plot developments. To continue the above example, \"So we're thinking that Ionia will actually be a floating island that hasn't had contact with the rest of Valoran in hundreds of years.\" That's a big thematic change, from Ionia as an internationalist state heavily invested in the politics of Valoran to Ionia as a mysterious new entrant that nobody had ever heard of before. That's the sort of thing that I think should be discussed beforehand.\n\nI think it would be acceptable to shock-reveal if Ionia SUDDENLY shot into the sky. That would be a major event with huge implications and would be a really fascinating thing to explore. It would be unacceptable to shock-reveal if you say Ionia has ALWAYS been floating in the sky. This changes Ionia's identity completely, where-as if it happened suddenly Ionians would be just as surprised as everyone else. It's akin to the difference between erasing someone in this instant and erasing someone from EVER existing. If you erase them in this moment there would still be memories of them. \n\nYou shouldn't shock reveal an identity change. You should shock-reveal new events or details in the same identity framework. All major identity changes should be discussed with the player-base as we are not talking about launching a new game here, we're talking about a well-established and well loved game.\n\n\n> Honestly, we'd like to be supportive of Narrative, and provide some grassroots energy for League lore generally. The problem is that Narrative's first major act was the Great Retcon. To call it a \"shot across the bow\" would be minimizing; it was a broadside. We'd rolled with many changes from Narrative, and honestly, we had fun with them—Udyr's shifting loyalty, for instance, or the arrival of Azir. But the erasure of the League and Summoners we simply couldn't adapt to.\n\nYep. This describes my feeling on it well. It was too much too fast. Years of near-silence in Narrative, followed by a brief moment of carnage (the Retcon) and then more near-silence. I might have been able to come to grips with the change if I had a little heads up.\n \n> I've enjoyed a lot of the new material.\n\nYep! If the institute were still around I would be all for it I think. Kinda like the new material is a new outfit I'm trying on, but without my soul (the institute) it's a lot harder to care.","replies":[]},{"poster":"AmbushIntheDark","date":"2015-01-30T23:49:52.185+0000","up_votes":5,"down_votes":0,"body":"Cupcake, I wish i had your patience/ understanding. To a \"casual\" lore fan who doesnt delve much into fan created content you either have the patience of a saint or small case of serious brain damage.\n\nEither way, keep up the fight.","replies":[]}]},{"poster":"Hellioning","date":"2015-01-30T21:33:17.564+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0004000000060000,timestamp=2015-01-30T20:59:19.368+0000)\n>\n> Thanks for the kind words, and I'll reply as briefly as I can as I'm currently thinking around a quite beautiful sinus infection. Hopefully I don't cause too much consternation or say anything too daffy.\n\nGlad you're talking with us even in your sickness. Hope you get better soon!\n\n> The \"shock reveal\" as you term it, is usually just an essential element of storytelling. It's hard to give you the crux of a thematic change to character in advance that would appear in any way positive without the context of the story to go along with it. If we tease parts of a story to give an idea of what it will be, then it's easy to misconstrue the intent and impossible to include all of the aspects of the character. Then we're giving answers of \"Wait for the full story.\" If we give you a rough version of the story (I'm sorry, this will never happen for many reasons, including legal ones), then we've essentially released the story, just in an incredibly unsatisfying way for most players.\n> \n> Let me use a hypothetical example of a movie I'm looking forward to this year. I can't ask J.J. Abrams for an advance copy of the script, or the outline, or the treatment for Episode VII without pretty much destroying the experience for myself. If I was to ask this in public, then anyone else who reads it is equally in spoiler territory. Also, if I made suggestions and they were then used in the script and the resulting movie, I could sue JJ's arse off for using my ideas without proper credit or compensation. \n> \n> I'm not saying Narrative is JJ Abrams and his team or a particular short story is Star Wars, but the point is that giving advance notice of stories is counter-productive for numerous reasons, including that it tips off not just what we are working on but also the work being done by the many teams that we are a part of.\n\nI don't particularly want you to give us spoilers about future champions or plots and stuff. But I do want you to talk to us and ask us 'what do you like about this champion/faction? what are you not particularly attached to about this champion/faction?'\n\nYou're not dealing with an entirely new universe, and you're not dealing with future additions to an existing universe. What I, and probably Cupcake, are worried about, are the various retcons to champions and factions that you've been doing recently. Maybe the new versions are better characters, maybe they're not, but you have to fight through a part of a person's brain that goes 'but I liked the old version. Why did you have to change it?' and have to explain to them why narrative thinks that Trundle would be much cooler as a burly ice troll than a scrawny plague runt.\n\nWe've seen it several times in the past, and have had various rioters comment on the complaints with things like 'yeah, we didn't know you guys liked Karma's fans that much. Our bad!' That's what I want to talk about, not asking for spoilers on new champs.\n\n> Narrative is not an independent body that just comes up with stories or characters. Most of the stories we create are directly to help fuel the Champion team with new champions and to express them in a way that makes them appealing to play and as new members of an enthralling world of story. In doing so we are also working to help with many other teams to deepen a unique IP that will hopefully last until the sun burns out. \n> \n> In that process, there will be changes, and we're trying to make sure that we preserve the essence of those characters in whatever we do whenever we can.  To be honest, there will be times when we make changes that you don't agree with. Our task is to do so only when the benefits are greater than the costs for the players, for Runeterra and for the IP. The problems are very much pronounced when the benefits of those changes aren't immediately obvious to the players as we can't get the quantity and quality of stories out at that point. This is why we're working so hard behind the scenes to evolve the Narrative team to be able to do a much better job of doing that.\n\nI can agree with that. I think a lot of the complaints about the various retcons, including the Big One, is that Riot said things like 'we believe that the new version is more conductive to new stories' and then you either release a bunch of lore that was perfectly compatible with the old version, or, like the Trundle change, you release basically nothing afterwards.\n\n\n> We don't want to just tear things up and start over. As you mentioned, quite a few of the stories recently have been perfectly conducive with the previous lore. The reason being that there are certainly strong elements that we will carry forward. Runeterra is the wellspring from which everything we do occurs, so most of it will be very similar.\n\nA Runeterra without a governing body that's trying to keep the whole thing together is a very different Runeterra. It honestly sounds to me like you're trying to have your cake and eat it too; you're getting rid of something you don't like, the institute, but deciding that Runettera without the IoW is exactly the same as the old one, just without those pesky summoners. I severely doubt that would be the case.\n\n> I'm starting to go round in circles in my ever decreasing mind so I'll wrap up in an utterly inelegant way.\n> \n> We as a team, and I personally, need to do better in our communication with you. It means I'm going to be as clear as I can as often as I can. In the past it's been challenging, to be honest, because I've felt I need to parse every word so I don't infuriate this board in particular. The smallest post means I spend a bunch of time editing it. For example, I made a half-arsed joke months ago about Nashorzilla and that's been used as evidence that Narrative doesn't understand Runeterra or deserve to work on it.   I'm learning the best way to talk with all of you and I hope my stream of consciousness in this post in the midst of a repeating explosion of green gunge is taken in the way I intend: I just want to be honest and I want us to figure out a way that we can move forward.\n\nSo do I! I'd love to move forwards. You've got roughly three years to be making up for, though, and I've long since lost my patience with Narrative. You guys really need to start talking more.\n\n> Speaking of which: with the things I've said in mind, what does everyone want to talk about? What would be a cool series of things we would do weekly to just chat about? I know folks have made suggestions before, but something to just refer to here would be cool, mainly as I need to go lie down now. We're going to put something up today on the boards in the meantime, but I'd like a repeated conversation that helps us communicate openly to be born out of your ideas.\n\nAgain, if you're thinking about making changes to old content again, I'd love for you to come talk to us to make sure that what Riot thinks the public likes about a champion is actually what people like about the champion; otherwise you'd start to get things like 'Ezreal was embarrassed.'\n\n> Bloody hell my \"brief reply\" went on.\n\nThat's good! I'd much rather have you talk too much than too little.","replies":[{"poster":"Finnical","date":"2015-01-31T05:25:54.044+0000","up_votes":1,"down_votes":0,"body":"> Maybe the new versions are better characters, maybe they're not, but you have to fight through a part of a person's brain that goes 'but I liked the old version. Why did you have to change it?' and have to explain to them why narrative thinks that Trundle would be much cooler as a burly ice troll than a scrawny plague runt.\n\nI was upset with the Trundle change too, but that one actually got addressed by Riot on the forum. Apparently there were a pretty large number of people who thought plague Trundle was really gross both in his lore and in his visuals. From what I understand it was not a small number of people and they complained very loudly, though I never saw it myself. I think Narrative may have had to make that change, better or worse, and the Freljord was just a convenient out at the time.\n\n> A Runeterra without a governing body that's trying to keep the whole thing together is a very different Runeterra. It honestly sounds to me like you're trying to have your cake and eat it too; you're getting rid of something you don't like, the institute, but deciding that Runettera without the IoW is exactly the same as the old one, just without those pesky summoners. I severely doubt that would be the case.\n\nThis is a HUGE concern of mine. Runeterra without the Institute should be a CRATER. The rune wars were impossibly terrifyingly devastating and should break out almost immediately if the institute just disappears. I actually think a stronger Retcon would have included the institute as a smaller governing body with considerably less power and the Rune Wars should have been deleted. However, that would be a MUCH weaker story(scary rune wars are interesting), the old story is still better.\n\nAnd if you say \"well there would be no summoners either, so no Rune Wars,\" there would still be people and creatures with terrfying power that could tear up the landscape just as easily. Brand vs Syndra, Xerath vs. Annie, Zyra vs. Vel'Koz, ANY of these fights would destroy the surrounding area. The Institute of War gave these powerful opponents containment, protecting Runterra from them. \n\nEVEN FURTHER: Every nation in Runeterra is battle-ready and well armed. No IoW, no peace. There would be constant warfare, Runeterra would be a very scary and sad place.","replies":[{"poster":"Hellioning","date":"2015-01-31T05:36:33.722+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Finnical,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=000400000006000000010000,timestamp=2015-01-31T05:25:54.044+0000)\n\n> I was upset with the Trundle change too, but that one actually got addressed by Riot on the forum. Apparently there were a pretty large number of people who thought plague Trundle was really gross both in his lore and in his visuals. From what I understand it was not a small number of people and they complained very loudly, though I never saw it myself. I think Narrative may have had to make that change, better or worse, and the Freljord was just a convenient out at the time.\n\nIf I don't enjoy something's looks and lore, I simply don't play that thing. Sure, you might have to play with or against it, but it's not like they're completely changing Elise because some people have arachnophobia. I get that some people don't like old Trundle, and that's fine. But niche things that some people like don't need to be changed because some people don't like them.\n\n> This is a HUGE concern of mine. Runeterra without the Institute should be a CRATER. The rune wars were impossibly terrifyingly devastating and should break out almost immediately if the institute just disappears. I actually think a stronger Retcon would have included the institute as a smaller governing body with considerably less power and the Rune Wars should have been deleted. However, that would be a MUCH weaker story(scary rune wars are interesting), the old story is still better.\n> \n> And if you say \"well there would be no summoners either, so no Rune Wars,\" there would still be people and creatures with terrfying power that could tear up the landscape just as easily. Brand vs Syndra, Xerath vs. Annie, Zyra vs. Vel'Koz, ANY of these fights would destroy the surrounding area. The Institute of War gave these powerful opponents containment, protecting Runterra from them. \n> \n> EVEN FURTHER: Every nation in Runeterra is battle-ready and well armed. No IoW, no peace. There would be constant warfare, Runeterra would be a very scary and sad place.\n\nYeah, exactly. I don't think narrative thought out that background entirely.","replies":[]}]}]},{"poster":"Cuix","date":"2015-01-30T21:37:06.381+0000","up_votes":8,"down_votes":4,"body":"> The \"shock reveal\" as you term it, is usually just an essential element of storytelling[...] giving advance notice of stories is counter-productive[...] Most of the stories we create are directly to help fuel the Champion team with new champions and to express them in a way that makes them appealing to play[...] In that process, there will be changes, and we're trying to make sure that we preserve the essence of those characters[...] there will be times when we make changes that you don't agree with[...] I've felt I need to parse every word so I don't infuriate this board in particular[...] \n\nOooh boy. These lines in particular have pretty well doused whatever hope I had for the official lore. It's not your fault, Jar-Bear. It's just... this approach doesn't involve or engage us. If Narrative wants to go make up cool backstories for a series of action figures, that's fine, very marketable and fun, but I'd been enjoying the deep and complex weave which old Lore fostered. At this point, there's little reason to care about a champion's motivations or story, since they're so fragile and shallow. Did Karma retain her \"essence\"? Trundle? Xerath? Skarner?\n\nI hope this doesn't make you feel bad. You're coming to talk with us, even while you're sick and hesitant, so you're fine. No issues with you as a person. I'm just officially fully disconnected from whatever Riot wants to call lore.\n\n> Speaking of which: with the things I've said in mind, what does everyone want to talk about?\n\nLots of stuff, but why bother?","replies":[]}]}]},{"poster":"Cuix","date":"2015-01-26T01:58:57.674+0000","up_votes":10,"down_votes":2,"body":"More excuses for the silence don't help when history has vividly shown that openness is helpful and secrecy is harmful.\nMore assurances that there will be more content when simply pumping out content isn't the solution.\nMore apologies while showing a commitment to neither listening nor changing.\n\nYeah, folks are annoyed. It's not just \"understandable\"; it's justified and right.","replies":[]},{"poster":"Starlighte","date":"2015-01-26T02:03:30.454+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=00040000,timestamp=2015-01-26T01:25:10.773+0000)\n\n>I'm fine with discussing the reset of Runeterra\n\n>~snip\n\n> I greatly appreciate everyone's passion on these boards, I share it, as does every member of the Narrative team.** I simply want to be one of the many folks helping to move things forward**, both in the content Narrative produces, and in the conversations between us and you, the players.\n\nJaredan real talk man, isn't this just your way of saying \"We are ok with talking about the retcon, but only if you agree that we aren't going to talk about un-doing the retcon\"? And if you're putting asterisks on conversations about what is and isn't on the table, don't you see how this continues to make people mistrust your department?\n\nYou guys are plagued by slow content, lack of communication, lack of transparency, and what many would argue is a lack of a sense of what the community truly wants.\n\nYou gotta speak to these issues... because if you don't, people are going to fill in the gaps.","replies":[]},{"poster":"Solideus","date":"2015-01-26T08:35:08.864+0000","up_votes":2,"down_votes":0,"body":"Is {{champion:429}}/{{champion:421}}'s lack of Friends/Rivals on the site part of the technical issues or is it something you're just going to stop doing?","replies":[{"poster":"BlackSunNocturne","date":"2015-01-26T19:37:03.644+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Solideus,realm=EUNE,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=000400000005,timestamp=2015-01-26T08:35:08.864+0000)\n>\n> Is {{champion:429}}/{{champion:421}}'s lack of Friends/Rivals on the site part of the technical issues or is it something you're just going to stop doing?\n\nI think they have a lack of friends/rivals because-\nKalista doesn't care about anything but vengeance\nRek'Sai is feral and lacks the concept of anything that isn't \"food\", \"my brood\", \"things to kill\"","replies":[]}]}]}]},{"poster":"Baron Perenolde","date":"2015-01-24T02:45:02.503+0000","up_votes":16,"down_votes":1,"body":"Good show, friend. I wasn't fully aware of the lore when I first joined League over three years ago, but I loved reading each champion's backstory and judgement. I remember thinking \"Wow, this JoJ stuff is so cool! I wonder how Riot is going to build on it!\". Then I was left puzzled with the various decisions as of late, namely the retcon and denying the existence of us Summoners. I could care less about the Top Plays of whatever; I want to know how things are going in Bandle City or if Jarvan really is Leblanc. Stories help flesh out the game and its characters in a meaningful way, and I feel that League in its earlier days did this better than EVERY other moba out there. :(","replies":[]},{"poster":"NorthernDruid","date":"2015-01-27T11:04:01.912+0000","up_votes":13,"down_votes":0,"body":"What honestly confuses me is why they made the retcon in the first place.\n\nBecause you don't do that kind of retcon, you don't go and say \"everything in our story is no longer the story, and will be something else\" and then you go on to say nothing for the next few months.\n\nHeck, the idea of retconning a dynamic medium like League in the first place is the most staggeringly careless thing I can think to do. And unlike a retcon in a static medium, since League changes with it's lore (not that it has done so yet after the retcon) you are robbing people of those stories.\n\nThat's why Trundle was (and still is) so badly recieved. Because not only does he no longer exist, you cannot go back and experience the part where he did.\n\nIf someone reboots my favourite static media (whether it be a game series, a comic book series, a book series, a tv series, what have you) I can just ignore the new stuff and enjoy the old static stuff that I still have.\n\nIf you rip the summoners out of the game, if Sona no longer communicates telepathically with only me, if the champions stop adressing me. Then that story element is gone and the only way for me to know it ever existed is through my own memories or whatever static media have recorded the situation.\n\nSo when you alter a story which is told continously, then you're not only taking away the future of the story that I want to find out, you're taking away the past and present as well.\n\nOnce Riot goes as far as to take away the setting elements from the game itself, the story won't just be dead. It will be obliviated.\n\nThey won't just be betraying my investment by not following up on it. They'll be tearing down the foundation that investment is built on in the first place. They'll be taking away from me the dreams they encouraged me to dream in the first place.\n\nSo when you say \"Trust us!\" the reason we won't isn't because we think we won't like what new things you make up, it's because you've promised to go kill something we've invested ourselves in while we could be investing in static media which cannot be taken away from us.\n\nThe only reason I'm still interested in anything the narrative team says, is because they haven't actually done any of the things they said they'd do yet.\n\nThey've said they're removing the IoW and the Summoners and the LoL. But they haven't actually given us anything which goes against it. Or which couldn't have existed within the oh-so-constricting base premise of the entire setting.\n\nSo not only are the threats to purge the fiction we've invested our emotions in horrifying to us, so far they've been empty.","replies":[]},{"poster":"CupcakeTrap","date":"2015-01-25T17:56:12.712+0000","up_votes":13,"down_votes":0,"body":"You are truly a Lord among the Hippomen, fellow Summoner.\n\nI should begin by saying, in accord with your optimistic tone, that I think the members of the Narrative team are passionate and talented. They tell some good stories. And of course it's irrelevant whether or not I agree with their \"vision\", and even less relevant whether or not they agree with mine. It would, however, be nice if we could get some more meaningful community engagement going, rather than persisting in the present state of affairs, which has Narrative slapping down pre-fabbed lore without prior discussion. In the present state of affairs, I confess that my first reaction to new lore being posted is still one of, well, panic, as I frantically skim it to see if they've just retconned another essential story element.\n\nIt would certainly be nice if this thread helped catalyze a change in Narrative's modus operandi, away from the shock reveals and blank-slate rewrites without opportunity for community input. I already feel the cynicism creeping up, but there's some reason to be hopeful. I have noticed that, recently, Narrative has steered largely clear of drastic rewrites. In the first wave, they were quite casual about literally deleting the lore of dozens of characters. Now, though, they're mostly focusing their \"blank slate\" methods on open thematic space, which is a much more appropriate place for it. I also think the quality is quite good—though there have been some awkward stumbles that more open community review might well have prevented.\n\nAt the risk of being wildly offensive, I'm going to appropriate a story from a much more serious context.\n\n> A ship lost at sea for many days suddenly sighted a friendly vessel. From the mast of the unfortunate vessel was seen a signal,“Water, water; we die of thirst!” The answer from the friendly vessel at once came back, “Cast down your bucket where you are.” A second time the signal, “Water, water; send us water!” ran up from the distressed vessel, and was answered, “Cast down your bucket where you are.” And a third and fourth signal for water was answered, “Cast down your bucket where you are.” The captain of the distressed vessel, at last heeding the injunction, cast down his bucket, and it came up full of fresh, sparkling water from the mouth of the Amazon River.\n\nThis all began with Narrative wringing its collective hands over the League itself, trying to make the eponymous centerpiece of the lore of League of Legends \"work\". By their account, they just couldn't do it. They couldn't come up with a version of the League that was not \"all-powerful puppetmaster Summoners enslaving Champions to fight forever\", and they couldn't think of a way to have this (caricature of the) League fall. They apparently thought that maybe having Baron Nashor go berserk and destroy the League would work, but then decided against it. (This itself speaks volumes of the difficulties they were having understanding the League.) So they retconned it.\n\nIf they'd \"cast down their buckets\" into the waters of the lore community, they would have found well-tested solutions to these problems. Perhaps a discussion with the community would have explained to them that the League is not some kind of crazy magocracy that mind-controls Champions, but a supranational entity with aspects of the European Union, European Court of Justice, World Trade Organization, and United Nations—not a unitary, monolithic actor, but an amalgam of power and interest roughly channeled by idealistic institutions into a more or less functioning (but far from ideal, and questionably stable) whole. It exists because of the consensus among its member-states. It is at once a dispute resolution mechanism and an international forum, sponsoring both idealistic visions of a new Runeterra without war (a reality it never quite manages to achieve for long) and cutthroat realpolitik bargaining. It resolves many mundane (but important) legal disputes among nations concerning trade and the like, and it furthers the study of magic (trying to sequester the most dangerous Rune Wars magic in spooky library-vaults). When war does break out, it enforces the laws of war and strives to contain the fighting—even as both combatants use their influence within the Institute to try to gain an advantage under the guise of \"enforcing the rules\". All the while, the specter of collapse, and a return to unchecked warfare, looms in the background. If \"Nashorzilla\" physically destroyed the League, but the political will behind it remained, it would simply be rebuilt. Baron Nashor attacking the Institute would certainly make for a very bad day for some Summoners and Champions, and perhaps make lunch out of others, but it would be very unlikely to destroy the League itself. Nor would a grand revelation of corruption do more than weaken it; the powers that be already know the League has its share of corruption, just as they have within their own borders.\n\nIf you wanted to destroy the League, you would set up another Kalamanda. In Kalamanda, when Demacia and Noxus openly ignored a League peace edict and began what could well have become a full-scale war—on top of a nexus, no less, providing a perfect recipe for Rune War-level catastrophe—the League used all its strength to forcibly break up the two (relatively small) detachments. This was more a statement than anything: a show of force that told both Demacia and Noxus, \"If you guys really want to do this, you know we can't stop you, but you'll do it through us, and the League will fall.\" To avert a more gradual collapse, the League put everything on the line and issued this ultimatum. That time, Demacia and Noxus decided they weren't ready for another round of Rune Wars, and grudgingly agreed to back down. The League (and Valoran) might not be so lucky next time.\n\nAnyway. I get it. The League's out of Narrative's picture. And, at the risk of running counter to Hippoman's valuable message of togetherness, I will say I'm kind of okay with that. I wasn't impressed by the vision of the League they presented when retconning it, which I found quite shallow and uninspired. I'm not sure I want Narrative writing League lore. They're pretty good at Runeterran lore, and I enjoy a lot of what they've written, but I was able to come out of my post-retcon melancholy when I asked myself—wait a second, do you really want these guys writing the League in the first place? Would you rather go through the trouble of incorporating their League-less Runeterra lore into Factions, or would you rather have to alter Factions to follow each and every meandering step in their \"all-powerful puppetmaster Summoners\" League story? I realized that this may well have been a blessing in disguise. If the League's story doesn't speak to them, and other stories do, then hey, I say they go for those other stories and leave the League to the community.","replies":[]},{"poster":"RiotJaredan","date":"2015-01-26T01:28:57.636+0000","up_votes":14,"down_votes":1,"body":"I just wanted to say thanks to LordHippoman for such a constructive and positive post. \nGreat stuff.","replies":[{"poster":"LordHippoman","date":"2015-01-26T01:43:19.181+0000","up_votes":7,"down_votes":0,"body":"I appreciate that.  This has been a really rough few months in my personal and family life, and writing/reading/talking about League lore has been a welcome escape from a lot of what I've been going through, and helps gives me something to do in my free time but mope around.  I really like this story, and I really like its fans and writers, and I'll do all I can to help hold things together so it can bring other people the joy it has brought me and my friends, especially during times when something that's just entertaining is really all you need.\n\nThanks for the reply.","replies":[]}]},{"poster":"alagore","date":"2015-01-24T05:26:26.638+0000","up_votes":8,"down_votes":17,"body":"On the subject of the retcon, it was needed. The reason I say it was needed was because the institute of war was a story breaker. They were waaaaaaaaaaay too powerful. Since it is late, and I'm on mobile, I'm just gonna copy paste this here. \n\nThe much maligned-retconning of the in-universe League could have a point to it. It was backed by extremely powerful summoners, which means any threat to Valoran's safety was squelched immediately. One can see this in the backstory to the Crystal Scar; it was a war zone, complete with hextech nukes, until the Institute said \"No. Stoppit.\" and stopped time around it. They could have done that at any point during the story, could still do that at any point. Which means that the Black Mist of the Harrowing is nothing more than a heavy fog to them, The Void becomes a mere annoyance in their presence, and the Demacia/Noxus cold war has no means of going hot without drawing the Institute's ire.\n\nWhile I don't have much of a position on the new lore, I think it will become better, once more champion lore is updated, so the story connects with itself better. Just my 2 cents.\n\nEDIT: I don't know why I am being downvoted. I just said my opinion. Sorry D:","replies":[{"poster":"LordHippoman","date":"2015-01-24T05:55:03.132+0000","up_votes":15,"down_votes":0,"body":"I know some people aren't fans of this whole idea, but I always thought the biggest credible threat to the IoW was the IoW itself.  One crazy High Summoner and Runeterra is in serious shit.  There were a few hints that they weren't exactly who they said they were.  Brand mentions in the JoJ that you can't trust the League, although what stock you want to put into the words of a world destroying monster is sort of up to you.  Vayne wouldn't let them read her mind, suspicious of...something?  She is good at finding evil magicians.  Even in stories like Olaf's old Lore, they promised to help him find Lokfar if he fought in their matches, then conveniently just...never seemed to find it.  All the champs that were forcefully summoned ala Kayle, Morgana, Taric...there was probably something shady going on in the League.  Honestly, I was a fan of the idea that if League had a big final villain, it would probably be Vessaria Kolminye or one of the other high summoners.  So much power at their disposal, and they just seemed to get more and more.\n\nThe retcon does add a lot more power to the city states, however, and that does ramp up the whole angle of a world constantly on the verge of war, but unwilling to do so, lest they completely tear the planet apart with their rune magic.  Champions can also canonically die now!  Although I doubt it'll happen (or if it does they'll go for someone like {{champion:83}} or {{champion:26}}, the poor unloved nobodies of the League fandom), or there will be a lot of very angry fans.  So I can see both sides of that argument, and it's a more complex one than a lot of people give it credit for.  I think the IoW needed to be \"nerfed\" a little somehow, I don't know if a full on delete was the best choice, but eh.  Stakes are one of the hardest things to manipulate in a story.","replies":[{"poster":"GreenLore","date":"2015-01-24T14:25:41.238+0000","up_votes":9,"down_votes":0,"body":"The whole \"the league may be secretly evil\" deal was something very interesting in my opinion too,but it was one of these plots that would be hinted at,but probably never resolved,because it would end the whole premise of the story.\nI think they could have used it to write the league out of the game though.","replies":[]}]},{"poster":"Solaxo","date":"2015-01-24T11:41:16.615+0000","up_votes":13,"down_votes":2,"body":"> [{quoted}](name=alagore,realm=NA,application-id=6kFXY1kR,discussion-id=jNiytgM9,comment-id=0008,timestamp=2015-01-24T05:26:26.638+0000)\n>\n> On the subject of the retcon, it was needed. The reason I say it was needed was because the institute of war was a story breaker. They were waaaaaaaaaaay too powerful. Since it is late, and I'm on mobile, I'm just gonna copy paste this here. \n> \n> The much maligned-retconning of the in-universe League could have a point to it. It was backed by extremely powerful summoners, which means any threat to Valoran's safety was squelched immediately. One can see this in the backstory to the Crystal Scar; it was a war zone, complete with hextech nukes, until the Institute said \"No. Stoppit.\" and stopped time around it. They could have done that at any point during the story, could still do that at any point. Which means that the Black Mist of the Harrowing is nothing more than a heavy fog to them, The Void becomes a mere annoyance in their presence, and the Demacia/Noxus cold war has no means of going hot without drawing the Institute's ire.\n> \n> While I don't have much of a position on the new lore, I think it will become better, once more champion lore is updated, so the story connects with itself better. Just my 2 cents.\n\n\nStory breaker? Journal of Justice disagrees. We had MANY interesting stories","replies":[{"poster":"GreenLore","date":"2015-01-24T14:21:55.500+0000","up_votes":6,"down_votes":13,"body":"you mean like that all out war between demacia and noxus?Oh wait the league solved that by freezing the 2 strongest armies of the continent in time.\n\nOr Malzahar vs Kassadin?Oh no that was stopped by the league too\n\nOr the Noxus invasion?I mean how are the ionians going to....oh wait one league match and it was over...\n\nAll those are instances where the league acted directly as a story breaker,stopping an interesting conflict with their overwhelming power.\n\nWhile I agree that there were good stories too(the conspiation part of the kalamanda conflict was cool),they did solve some problems in a rather anticlimatic way and it was evident that they were grasping for straws to find ways to write around the league(which is why noxus more or less attacked everyone not protected by it)","replies":[{"poster":"Sneak Dog","date":"2015-01-24T15:08:09.374+0000","up_votes":10,"down_votes":2,"body":">you mean like that all out war between demacia and noxus?Oh wait the league solved that by freezing the 2 strongest armies of the continent in time.\n\nYou mean the steel and slugs skirmish between two oversized detachments sent only to ensure the safety of the city-state leaders present? Ah, the IoW was well-prepared to stop that since they themselves orchestrated the whole thing.\n\n> Or Malzahar vs Kassadin?Oh no that was stopped by the league too\n\nThe league? You mean the power node that blew up after Kassadin tried to kill Malzahar because Malzahar was sacrificing his daughter. Or do you mean their second meeting, where Malzahar was using the adjudicators to save him (at which point Kassadin probably realized his plan and also just surrendered)?\n\n>Or the Noxus invasion?I mean how are the ionians going to....oh wait one league match and it was over...\n\nOh hey, Noxus is freely using Zauns techmaturgy in an all-out war. But Ionia isn't part of the League, how sad that we can't help them. If only Ionia were part of the League with all related rights and obligations... Oh, Ionia joined us? Time to do our job then.\n\nThe league did not lend itself well for plain war stories. It was used for plots and corruption though. \nThe IoW also seemed fine with steel and slug skirmishes as long as they didn't threaten anything dangerous, I'm sure the Noxus-Demacian border was still skirmishing along. They set up the whole Kalamanda deal though.\nI would've loved it as an institution that hunted down (or contracted others to hunt down) any risky use of runemagic and that on the side simply *offered *an alternative to war instead of forcing it. The IoWs power is only its supporters, it won't stop dead any conflict and it has a clear goal.","replies":[]}]}]},{"poster":"Destínum","date":"2015-01-29T10:57:11.690+0000","up_votes":1,"down_votes":0,"body":"The problem that OP is talking about is right here. Every time someone says they think the retcon was a good idea, they get downvoted into oblivion.","replies":[{"poster":"Shíny","date":"2015-01-30T19:55:33.276+0000","up_votes":4,"down_votes":0,"body":"The reason they're downvoted is almost never just because they agree with the retcon, but that their reasoning why it had to be done is usually faulty. Bad arguments get downvoted no matter where you are.","replies":[]}]}]},{"poster":"Gray Fanchon","date":"2015-01-24T02:35:26.288+0000","up_votes":10,"down_votes":1,"body":"You, sir, are getting an upvote. :D I absolutely think this approach is a good idea; it's understandable that some don't like the change to the lore, but there's still so many chances to tell stories for Rioters and fans alike here. It'd be a shame to squander that, especially now! I mean, this is the time when Riot is forming a lot of what Runeterra is going to be going forward, yeah? \n\nThis is a great time to give feedback, thoughts, try and influence things. Riot is *constantly* looking at what we're saying and taking it into account - it'd be a shame if bitterness made that a non-issue with the lore, especially with how much some of the playerbase really seem to care about the stories of this world.","replies":[]},{"poster":"Sneak Dog","date":"2015-01-24T15:57:32.163+0000","up_votes":11,"down_votes":3,"body":"> This is not a binary issue. The Lore team's goal is to put out good lore. That makes them money and gets them appreciation. Lore fans want to consume good lore. That makes us happy and gives us stuff to talk about. So why are we treating it like a fight?\n\nI used to be a lore fan. Now Riot retconned my favorite champion, retconned the premise of the lore and changed another champions main motivation and modus operandi.\n\nSure, I could move past the premise change, but I can't move past my favorite champion just getting retconned.** I can't invest in the lore when I know that my favorite character could be unceremoniously removed. **Given Riots current level of communication, this could be announced tomorrow, without any Q&A or other way to give feedback and it could replace everything I love about that champion. It has happened before to me.\n\nFor me, this *is* a binary situation. Riot is telling me they do not mind to just retcon and change champions or even the premise on their own whims for their own reasons. I can disagree, give valid and constructive feedback or even rant all I want, **Riot does not seem to care about my opinion.** \nThis is actually unique to narrative: The skin team tops all others Imo in gathering feedback consistently, Vesh just put out a Q&A for his little side-project, Stashu's Cassiopeia rework regularly has discussion, every now and then gameplay gets discussed by Rioters, but *narrative hasn't bothered to make a Q&A after releasing a dev blog stating they change the very premise of the lore.*\n\nSo yeah, for over a year now I've been frustrated with the way the lore is going. Especially since narrative isn't even coming out and just bluntly stating that they are willing to change the core of champions. \nI'm not going to flame any rioter responding here since that'd be stupid and uncalled for. **My frustration is aimed at the department**, not to the people in the department, but I don't have to be nice and welcoming either. I don't have to hail and praise them for finally coming out of their shell when they do. They shouldn't expect or even wish for a community welcoming them after such a long time of silence, their at least one false argument in the dev blog and questioned retcon.\n**\nWhat we should be is constructive and civil. That's all.**","replies":[{"poster":"Gray Fanchon","date":"2015-01-25T01:54:20.645+0000","up_votes":3,"down_votes":1,"body":"I can't comment on the rest of this so much, but somebody at Riot more or less commented that they weren't going to do another rework like Trundle's - he would've kept more of his original theme.\n\nMistakes are going to be made. They aren't going to improve without screwing it up a few times.","replies":[{"poster":"Sneak Dog","date":"2015-01-25T02:32:17.030+0000","up_votes":7,"down_votes":1,"body":"They retconned him with the following in mind:\n\n> if Trundle was going to be a frost troll, how could we make him into the “coolest” frost troll he could be?\n\nHow in the world is this a good way to redo an existing champion?\n\n> New Trundle undergoes a similar transformation, though it may be a touch more subtle. When he becomes the Troll King, the power may have begun to go to his head. He’s never been looked up to, he’s never been treated with respect, he’s so used to humiliation that the right to rule has added a darkness to him that may or may not grow into something more. \n\nThis is a different transformation with a different end result. It's not the same troll anymore after this.\n\n>We’ve taken a lot of steps to make Trundle the greatest frost troll he can be while still preserving the key elements of who he once was.\n\nThe new troll is not Trundle, just like Darius is not Riven.\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?p=36508044#post36508044\n\n***\n\nI think the admission you are thinking of is something else. I believe at some point Riot admitted they should've been clearer that they weren't going to keep that much of old Trundle. Not the awkward three-limbed walk for example. I believe they only admitted to communication mistakes, not result mistakes.\n\n***\n\nRiot doesn't think the Trundle retcon was a mistake though. They like it! Why do you think I am so vehemently arguing against it right now? It's entirely obvious to me that **Riot is entirely willing to take a champions character, throw it away and make a new one for that champion.** Right now, they're rewriting a dozen champions. If they do it with the same mindset as they rewrote Trundle with, it'd just make me quit LoL lore instantly, there and then. Only reason I haven't yet is due to the lack of real lore with the new system.\nHeck, if you want a recent example, though not as dramatic, look at Xerath. His main motivation and modus operandi were changed. That'd be like Batman now fighting with guns and explosives for patriotism. Would it still be batman? Riot apparently thinks it would be, I don't.\n\nMistakes are going to be made, I agree. They should also be fixed.** You don't accidently break a window and then just leave a gaping hole in your house. I just hope Riot can agree with me that changing an existings champions character is a mistake**, so far they actively disagree.","replies":[]}]}]}]}