{"poster":"DV nRoyality","date":"2019-01-25T17:40:40.014+0000","title":"DeVotion Clan sucht Member","subforum":"Clans & Teams","embed":{"description":"Take screenshots, screen GIFs, and full page captures you can instantly share now and search later. Get the free app for Windows, Mac, and mobile.","url":"https://gyazo.com/64df0611299ee63c03ad45905dcaa0bb","image":"https://i.gyazo.com/thumb/1200/64df0611299ee63c03ad45905dcaa0bb-png.jpg"},"up_votes":1,"down_votes":0,"body":"Du bist ehrgeizig und talentiert?\nDu kennst dich bestens in deinem Spiel aus?\nDu zeigst Eigeninitiative und bist immer motiviert?\nDu zockst alleine oder im Team und willst Mitglied von etwas Gr&ouml;&szlig;erem sein?\nDann bist du bei uns genau richtig!\n\nEgal ob Einzelspieler, Team oder komplette(r) Gilde / Clan, wir ( Devotion Esports ) sind stetig auf der Suche nach aktiven Spielern. Der Spa&szlig; am Spiel steht im Vordergrund, auch wenn viele unserer Gaming-Abteilungen ehrgeizig und kompetitiv in ihrem Bereich unterwegs sind. Progress oder Casual? Bei uns ist beides m&ouml;glich.\nDie ELO spielt keinerlei Rolle, denn der freundliche Umgang miteinander hat zur Folge, dass Spieler nicht auf ihre ELO reduziert werden. Des Weiteren stellt die ELO kein Aufnahmekriterium dar und hindert euch auch nicht daran, bei uns ein Team zu erstellen oder einem beizutreten.\n\nWas wir von euch erwarten:\n&bull; Das Mindestalter betr&auml;gt bei uns 16 Jahre.\n&bull; Ein angemessener Umgangston sowie Team- und Kritikf&auml;higkeit.\n&bull; Ein aktives Auftreten auf dem Teamspeak.\n&bull; Du besitzt ein funktionierendes Headset (inklusive Mikrofon),\nwei&szlig;t dich anst&auml;ndig zu benehmen, kannst dich klar ausdr&uuml;cken und nimmst konstruktive Kritik nicht als Flamen auf, dann bist du bei uns genau richtig.\nAlles andere wird sich ergeben und zeigen wenn du bei uns bist.\n\nDa wir einiges erwarten haben wir aber auch einiges zu bieten:\n&bull; ne sehr spa&szlig;ige Zeit mit vielen tollen Mitgliedern ( aktuell ca 900-1000, 180-210 gleichzeitig auf dem Ts3 ).\n&bull; Einen eigenen TS3-Server\n&bull; Eine gro&szlig;e, lustige und aktive Community, in der du herzlich Willkommen bist.\n&bull; Die M&ouml;glichkeit einem Team beizutreten oder ein eigenes Team zu &ouml;ffnen und zu leiten, ( aktuell ca 20 aktive Teams auf dem Ts3 ).\n&bull; Mit deinem Team an interen und externen Turnieren teilzunehmen, evtl. sogar in der ESL anzutreten.\n&bull; Ein rund um die Uhr aktives Adminteam\n&bull; Erfahrene Coaches die euch mit Rat und Tat zur Seite stehen\n&bull; Zudem bieten wir eine Plattform f&uuml;r Streamer sich zu vergr&ouml;&szlig;ern und mit uns zu wachsen ( aktuell 15 aktive Streamer mit 15-100 viewer ).\n\nIch hoffe euch gef&auml;llt unsere &bdquo;Communitywerbung&ldquo; und gebt uns und der Community eine Chance.\nAlso, worauf wartest du noch? Schaut vorbei.\nWir freuen uns auf dich!\n\nWie kann ich mich bewerben?:\nSchreibe uns auf Facebook: https://www.facebook.com/lolDevotion/ \nSchreibe mir eine Email: Info@Devotion-Clan.de\nBesuche uns auf unseren Teamspeak: dv-devotion.de\n\nOder direkt auf den Post antworten","replies":[]}