{"poster":"Paranøid","date":"2018-10-12T03:50:04.201+0000","title":"La razon por la que muchos malos jugadores no mejoran: No se dan cuenta de que son malos","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"No Talon, cuando estas 0/3 a los 6 minutos, no es porque el campe&oacute;n del enemigo esta roto.\r\nTampoco es porque el jungla enemigo &quot;armo la carpa en mid&quot;.\r\nY tampoco es porque el top aliado no tiro una MIA.\r\nY no... No es la culpa del jungla.\r\n\r\nEs porque vos, vos hermano, SOS. MALO.\r\n\r\n\r\nNo es un pecado ser malo. Todos empezamos como novatos. Pero en alg&uacute;n punto jugando a este juego, nos mandamos cagadas, fedeamos, perdimos cs, nos agarraron en una mala posici&oacute;n repetidas veces. Y perdimos partidas debido a eso. Que hicimos?\r\n\r\nNos detuvimos por un segundo y nos dijimos &quot;Ok, la re cagu&eacute; ah&iacute;&quot;. Y reci&eacute;n ah&iacute; mejoramos. Aprendimos a wardear. Dejamos de jugar campeones que no podemos jugar. Aprendimos matchups. Mejoramos nuestras mec&aacute;nicas para esquivar skillshots. Practicamos skillshots y last hit.\r\n\r\nSi este post te ofende, probablemente no est&eacute;s haciendo eso.\r\n\r\nEn su lugar, buscas excusas. Es lo que los psic&oacute;logos y neur&oacute;logos llaman &quot;disonancia cognitiva&quot;... Te ves a vos mismo como un muy buen jugador, entonces, si algo sale mal, tu cerebro busca una raz&oacute;n para explicar lo que haya pasado, que no incluye que haya sido tu culpa.\r\n\r\nEntonces culpas al jungla, o el support no wardeo lo suficiente, o Ahri esta rota. O... o... o...\r\n\r\nLo &uacute;nico que no estas considerando es que tal vez seas malo. Que cometiste un error, que sos el responsable de lo que acaba de pasar. \r\n\r\nPodr&iacute;a tu equipo haber jugado mejor? Seguramente. Nadie es perfecto, siempre hay lugar para mejora. Pero por qu&eacute; deber&iacute;as ser emparejado con jugadores mejores que vos, cuando no quer&eacute;s, no sent&iacute;s la necesidad, de mejorar en primer lugar?\r\n\r\nConclusi&oacute;n: Si quer&eacute;s volverte un mejor jugador, empez&aacute; a culparte por lo que pasa en tus partidas.","replies":[{"poster":"Shulys","date":"2018-10-12T04:02:32.929+0000","up_votes":3,"down_votes":0,"body":"Leo esto, y ya se... tienes razon.\n\nSi regalo muchas muertes, es mi culpa y solo mia. \nCulpaba al jungla por que me sentia impotente, debil, malo. \nTodos en lugar de ayudarme y decirme, tranquilo, quedate bajo torre y farmea lo que puedas, pronto te ayudaremos. No... Me insultaban, me decian troll. Eso... Eso me daba rabia, me hacia sentir peor, y por ello, para ignorar mi culpa y evitar la realidad, yo para proteger mi debilidad, culpaba al team por no ayudarme. \nCuando me tiro a la tf y no lo hago bien, culpo al team por no protegerme. Por que no quiero aceptar que no entiendo cual es el momento correcto de lanzarse. Algunos la tienen clara, pero yo no! Y no lo entienden!\n\nPero ya se.. ¡Ya se que es mi culpa!\nEs que.. es que no tolero que otros juegen mejor que yo, no me gusta levantarme despues de tropezar 2 veces con la misma piedra.\nYa se que soy malo, pero odio que me lo recuerden...\nPero por mas que lo intente... siguen molestandome... Es dificil mejorar... pero no me entienden.\n\nIgual no importa, seguire jugando y algun dia mejorare, lo juro.\n\nhttps://i.imgur.com/POCsIh2.jpg","replies":[]},{"poster":"Hierro IV 0 LP","date":"2018-10-12T03:59:12.578+0000","up_votes":1,"down_votes":6,"body":"Lo dice un Oro V , que tiene 9 partidas perdidas de la ultimas 11 ...................{{sticker:zombie-brand-clap}}","replies":[{"poster":"marmota159","date":"2018-10-12T04:01:39.118+0000","up_votes":4,"down_votes":0,"body":"Sin ir mas lejos vos llevas 751 partidas en platino y no podes salir {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Hierro IV 0 LP","date":"2018-10-12T19:31:52.977+0000","up_votes":1,"down_votes":2,"body":"si tarde mucho , pero ya tengo un progreso de tantas derrotas , revisa mi historial desde que baje a platino 5 y como lo subi en 2 semanas a platino 2 con lag y con 68% de win rate","replies":[{"poster":"marmota159","date":"2018-10-12T19:34:38.265+0000","up_votes":2,"down_votes":0,"body":"No tiene nada que ver, seguis en platino, podes tener 100% de win rate, pero no salis igual o sea, estas estancado, no critiques entonces.","replies":[]}]}]},{"poster":"chato peludo1","date":"2018-10-12T06:29:22.236+0000","up_votes":2,"down_votes":0,"body":"¿has escuchado de scarra alguna vez? Scarra es un jugador profesional, jugo dota desde que salio, juega lol desde el beta. Llego a ser el n1 de challenger en NA, es un jugador profesional-coach-streamer.  Sabe todo del juego, ha visto practicamente todo juego competitivo de toda escena competitiva en lo que se refiere a league of legends. ¿por qué te estoy contando esto? Simple, scarra el 25 de agosto perdió 19 partidas seguidas en challenger mientras jugaba transmitiendo en vivo.\nImagen del historial: https://imgur.com/r/leagueoflegends/t7Zl0Z8\nIncluso los pros más grandes de league of legends tienen como máximo un\n65-70% de victorias smurfeando, es decir, HAY PARTIDAS INGANABLES. NADIE \ngana el 100% de partidas en league of legends, nadie se salva de tener una mala\nracha de vez en cuando. ni siquiera faker (el mejor jugador del mundo, con\ncontratos por 1 millon de dolares, con 60% de gane en challenger kr), de 100 partidas faker NO PUEDE carrear 40. Si el mejor jugador del mundo no puede, no esperes que Paranøid  lo haga.","replies":[]},{"poster":"Paranøid","date":"2018-10-12T04:05:54.348+0000","up_votes":2,"down_votes":0,"body":"No te parece que alguien en pesima racha es la persona indicada para decir esto? Podria tranquilamente estar culpando a todos los que me tocaron, el hecho de que yo haya hecho este post no significa que no me incluya en quien es malo. Pero jamas culpo al resto, perdi 9 porque no supe jugarlas, tuve ventajas tempranas y no las use bien. Me tiltee como un animal esta tarde, pero nunca le tire la piedra al de al lado.","replies":[]}]},{"poster":"rokushoger","date":"2018-10-12T13:37:22.653+0000","up_votes":1,"down_votes":0,"body":"> Es porque vos, vos hermano, SOS. MALO.\n\nO porque el rival es mejor que vos.\n\nMe gusta tu mensaje, pero tampoco te tires tan abajo. Es decir, no siempre perdemos porque seamos horribles. Simplemente con que el rival sea mejor ya es suficiente para perder.\n\nPero si, tienes mucha razón, cuando una partida se pierde, todos somos culplables de eso, así hayamos hecho 26 asesinatos y muerto 0 veces, es también nuestra culpa por no saber aprovechar esa ventaja. \n\n+1","replies":[{"poster":"Paranøid","date":"2018-10-12T16:50:28.397+0000","up_votes":2,"down_votes":0,"body":"Concuerdo, pero creo que la forma de hacer que tu cerebro deje de darte palmadas en la espalda y te diga \"tranquilo, ellos la cagaron\" es diciendote a vos mismo, soy igual de malo que mis compañeros y cometo errores igual o peores. Entonces ahi nos bajamos de nuestra nube y nos damos cuenta de que hay mucho por mejorar","replies":[{"poster":"rokushoger","date":"2018-10-12T16:56:47.790+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo en eso, es mejor mentalizarse de esa manera.","replies":[]}]}]},{"poster":"marmota159","date":"2018-10-12T03:56:27.928+0000","up_votes":2,"down_votes":2,"body":"El otro dia nos estabamos cagando a puteadas a lo lindo con un Lee jg, que era bastante bastaante malo, ya tener 1 solo kill y asistencia con Lee un champ full early al min 20 dice mucho.\n\nPero lo bueno que despues de un rato dijo: \"Si loco soy malo, cual hay? que problema hay? soy re malo que queres que haga\" y ahi le dije: \"Nada ni un problema, tan dificil era admitir y decir soy malo?\" y no discutimos mas.\n\nSimplemente queria que admitiera lo malo que era (?)","replies":[{"poster":"Shulys","date":"2018-10-12T04:05:50.799+0000","up_votes":2,"down_votes":0,"body":"https://i.imgur.com/nbDXmJ2.jpg","replies":[]}]},{"poster":"VikingoATR","date":"2018-10-12T03:58:26.840+0000","up_votes":2,"down_votes":0,"body":"Soy malisimo man horrible no me sale un combo con camille con el trynda tiraba la R y ya staba muerto con jax no me salia escaparme con el ward hoy juego trundle y nose q item buildear pero weno sigo jugando x q me gusta h m divierte","replies":[{"poster":"Shulys","date":"2018-10-12T04:03:52.802+0000","up_votes":1,"down_votes":0,"body":"maestro, jamas te rindas.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"fenixerege","date":"2018-10-12T13:57:48.149+0000","up_votes":1,"down_votes":0,"body":"hasta un diamante es malo en la liga que esta porque es inferior al maximo que se puede aspirar, los que llegan son los que cometen menos errores, y aun asi llegan cambia el meta y descienden divisiones facilmente hasta que corrigen el error y a seguir\ncomo ser antes de que {{champion:266}} fuera reworkeado, vi como un jugador llego a challenger solo usando atroxx que casi nadie lo jugaba ni siquiera lo baneaba, mientras que en su cuenta principal no puede pasar de diamante, no es solo 1 condicion en este juego el sber jugar bien es tambien saber adaptarte mejor y rapido a los cambios obligados","replies":[]},{"poster":"PússySlap","date":"2018-10-12T04:52:39.886+0000","up_votes":1,"down_votes":0,"body":"cuando tienes conocimientos pero no los aplicas xdddd (si llegaste a diamante 3+ retiro lo dicho alv)","replies":[{"poster":"Paranøid","date":"2018-10-12T05:31:10.397+0000","up_votes":1,"down_votes":0,"body":"No se de que conocimientos hablas, solamente tengo una mentalidad de superarme a mi mismo, no le di a nadie una estrategia para subir 10 divisiones","replies":[]}]},{"poster":"VikingoATR","date":"2018-10-12T04:17:06.440+0000","up_votes":1,"down_votes":0,"body":"Hasta Faker pierde q qdara para el resto \nq stara haciendo faker alentara x algun eqipo de korea )?","replies":[]}]}