{"poster":"Ilies267","date":"2017-09-05T17:31:51.283+0000","title":"Anfängerin sucht nette Leute zum Üben und Spielen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hall&ouml;chen zusammen, ich suche ein paar nette Leute zum spielen.\r\nEin bisschen was zu mir: ich hei&szlig;e Vanessa, bin 27 jahre alt und habe vor noch nicht allzu langer Zeit mit LoL angefangen. Leider geh&ouml;rt sterben immer noch zu meinen st&auml;rken :D aber ich hoffe das sich wer findet der vielleicht mit mir zusammen etwas &uuml;ben will oder vielleicht auch jemand der mir ein guter Lehrer w&auml;re. Zur Zeit spiele ich gerne Shyvana auf der Top, Ahri auf der Mid und habe mir auch Sona f&uuml;r Supp geholt.\r\nFalls jemand Interesse hat, einfach melden\r\n\r\n*Knutscha* {{sticker:sona-playing}}","replies":[{"poster":"BARBIΈ","date":"2017-09-06T12:56:11.632+0000","up_votes":1,"down_votes":0,"body":"Hey :D wir sind zwar nicht in deinem alter aber wenn du Nette aufgedrehte Leute suchst dann melde dich einfach :3 wir sind 5 Leute aber eigentlich nie ganz zu 5 xD 3 Jungs (keine sorge alle gay ;D) und 2 Mädchen. falls du lust hast kannst du mir in lol schreiben : PrincessFoxFire :D schicke dir au eine Anfrage. achso und unsere lol erfahrung liegt bei 2-4 Jahren. hätten au disscord oder ts","replies":[{"poster":"Boy of the Void","date":"2017-09-07T09:51:20.315+0000","up_votes":0,"down_votes":0,"body":"Heyy wie alt seid ihr so weil ich suche auch leute zum spielen und die mir bisschen helfen besser zu werden (bin 17 und auch gay)","replies":[{"poster":"BARBIΈ","date":"2017-12-24T22:57:32.762+0000","up_votes":1,"down_votes":0,"body":"sorry das ich mich so spät melde haha. wir sind 16-18 jahre alt","replies":[{"poster":"Boy of the Void","date":"2018-02-05T15:45:34.188+0000","up_votes":1,"down_votes":0,"body":"kd haha würdest du mich villeicht adden ig Name cherylbomb2507","replies":[]}]}]}]},{"poster":"Jacek","date":"2017-12-25T04:11:33.100+0000","up_votes":1,"down_votes":0,"body":"hei vanessa wir sind ein sehr guter multi gaming clan der immer wieder gerne neue member sucht \nwir helfen dir auf jedenfall besser zu werden ich selber bin dia 1 und kann dir natürlich auch gerne helfen wenn du interesse hast dann komm doch auf unseren teamspeak schau da mal vorbei sag das du von mir kommst sag von Dennis dann weis jeder bescheid :) \ndas wäre die ts id: 149.202.86.112:1337","replies":[]},{"poster":"Hi Im SeniorDeku","date":"2017-09-07T09:20:32.033+0000","up_votes":1,"down_votes":0,"body":"wenn du willst kannst du mich ja mal adden xD Können dann gern zocken momentan bin ich supp main und spiele thresh und so xD","replies":[]},{"poster":"Papa Whiskey","date":"2017-09-06T02:06:21.016+0000","up_votes":1,"down_votes":0,"body":"was ich dir anbieten kann ist eine ganze Community voller netter Menschen die dir helfen deinen Skillevel zu erreichen. Die AeQ Community ist stehts um ihre Member besorgt. Von Bronze bis Challanger ist alles Vertreten. Auf unserer Homepage https://aeq-esports.de oder ganz einfach auf unserem TS erfährst du mehr. :)","replies":[]},{"poster":"Miss Fluffiness","date":"2017-09-05T18:49:39.863+0000","up_votes":1,"down_votes":0,"body":"Hallo :D ich habe dir eine Anfrage in Lol geschickt (Ceylanie) dann könnten wir mehr klären.\nZu mir: Wir sind ein Dreier-Team (manchmal auch vier). Spielen recht gerne und sind schon seit 1 1/2 Jahren in Lol. Die besten Spieler sind wir nicht aber dennoch haben wir recht viel Spaß und all zu schlecht sind wir auch nicht. Wir denken ein bisschen was können wir dir schon beibringen :D Wir würden uns auf eine nette Mitspielerin freuen. \n\nLg\n\nCeylanie","replies":[]},{"poster":"Punks1232","date":"2017-09-05T18:35:57.531+0000","up_votes":1,"down_votes":1,"body":"https://boards.euw.leagueoflegends.com/de/c/clans-teams-de/hfoeAEJw-pyrolyse-gaming-groae-multi-gaming-community-sucht-dich","replies":[]}]}