{"poster":"VenMos","date":"2018-05-05T02:43:33.216+0000","title":"Buddy got Permabanned any way to appeal?","subforum":"Player Behavior","up_votes":4,"down_votes":2,"body":"Today my friend got permabanned for no good reason at all. He was playing with another friend and they were getting flamed. After trying to defend himself he got permabanned for no reason at all. He spent an astronomical amount of Money on league and I can tell he&#039;s hurting. If there&#039;s anyway sombody can help I would be gracious.","replies":[{"poster":"Marshbouy","date":"2018-05-05T02:52:33.715+0000","up_votes":2,"down_votes":1,"body":"No. Barring highly specific circumstaces (account got hacked), appeals will not result in you getting your account back. Everyone knows what the rules for this game are and we must follow them. \n\nyour friend had a chat restriction and a temp ban as a warning. \n\nIf you still want to appeal, be my guest, but do not expect much from it. If you must appeal, then make sure that you post the full chat log when you write your post.","replies":[{"poster":"Zallamance","date":"2018-05-05T03:44:39.609+0000","up_votes":4,"down_votes":0,"body":"If you honestly want to appeal, don't do what he said. Don't create a post with your chat log, send a support ticket in and make a case. Get someone from Riot to look it over who can see both sides of the story and have them give you an answer. Just because the public might agree with you, doesn't mean Riot will. Talk to them and try to convince them, not us, if you want to change the punishment.","replies":[{"poster":"Marshbouy","date":"2018-05-05T12:46:11.644+0000","up_votes":1,"down_votes":0,"body":"yep you're correct.","replies":[]}]}]},{"poster":"InstaKill yi","date":"2018-05-05T15:13:33.776+0000","up_votes":2,"down_votes":0,"body":"riots logic is like someone trying to rob your house and you are supposed to leave your house and run away..but when you try to defend it and you kill the thief you are sent to prison for murder...so if u ever try to defend ur self u will be the one who actually get banned...sadly its how the system works","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-05-05T03:34:07.250+0000","up_votes":3,"down_votes":1,"body":"> After trying to defend himself he got permabanned for no reason at all.\n\nAfter flaming back, he got permbanned for flaming after ignoring multiple previous warnings.\n\nPermbanned accounts are never unbanned unless it was an accident, and it was obviously not an accident. He should be considering what he did wrong and if he wants to start over or not, because if he is stubborn enough to get permed once, he will just get permed again.","replies":[]},{"poster":"Fegone","date":"2018-05-08T13:36:02.106+0000","up_votes":1,"down_votes":0,"body":"Doesn't matter how much money he spent. \nIf he's toxic enough to get permbanned, that's it. Say goodbye to that money. Hope he learns from it.","replies":[]},{"poster":"Sukishoo","date":"2018-05-05T20:21:34.442+0000","up_votes":1,"down_votes":0,"body":"Permanent means permanent. So it's unlikely to be overturned.","replies":[]},{"poster":"JeonGoyangi","date":"2018-05-05T20:14:50.487+0000","up_votes":1,"down_votes":0,"body":"Hello! Retaliation is never ok. If your friend was permabanned it means that he had previous chat restrictions/ bans. The IFS (Instant Feedback System) works on 4 tiers. The first is a 10 game chat restriction, then a 25 game. After that is a 14 day ban, and then a permaban. It doesn't matter what the amount of toxicity is, if you continue to be toxic, eventually you will be permabanned. Just as a head's up, when you're on the 14 day ban, all it take is one instance of validated toxicity to get your account permabanned. You could always try to make a [support](https://support.riotgames.com/hc/en-us) ticket to see if they can further explain the reasoning that caused you to get permabanned.\n\n~KittySuppSquad {{sticker:sona-playing}}  {{sticker:sg-soraka}}","replies":[]},{"poster":"Summonah12369","date":"2018-05-05T16:01:40.648+0000","up_votes":1,"down_votes":0,"body":"Going through the same thing I've gotten no response from Riot.","replies":[]},{"poster":"Scary Door","date":"2018-05-05T05:56:52.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VenMos,realm=NA,application-id=ZGEFLEUQ,discussion-id=yAKehNJm,comment-id=,timestamp=2018-05-05T02:43:33.216+0000)\n>\n>After trying to defend himself he got permabanned \n\nSounds like he used some pretty toxic speech to get an insta-perma, my guess is that he's been banned previously, your friend should come here so we can see the chat logs.  \n\n>for no reason at all. \n\nSounds like a good reason to me.  \"Defending yourself\" in an online game or on the internet in general is a concept I'll still never understand.","replies":[]},{"poster":"breakordoom444","date":"2018-05-05T05:56:40.383+0000","up_votes":1,"down_votes":0,"body":"You can't defend yourself (sounds bad)\n\nYou can't flame back a flamer, someone's actions does not justify you doing something equally as bad.\n\nfor example, if someone robs a bank, that doesn't make it ok for me to rob a bank.","replies":[]},{"poster":"Xellex420","date":"2018-05-05T09:35:59.300+0000","up_votes":2,"down_votes":2,"body":"Average player age = 26\n\nSaying a bad word = Permaban\n\nLeague of legends = a joke","replies":[]}]}