{"poster":"waz0n","date":"2017-12-29T17:40:15.531+0000","title":"Duda sobre el sistema de Honor","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":1,"body":"Buenas, tengo una duda al igual que unas cuantas personas que le&iacute; en este foro. En mi cuenta recib&iacute; anteriormente (hace mas de 3 meses) dos sanciones de restricci&oacute;n de chat por pelearme con otros jugadores. Ahora bien despu&eacute;s de eso no recib&iacute; mas sanciones y aun as&iacute; mi honor quedo en el nivel 1. Mi duda es la siguiente: puede estar bug el sistema de honor? o realmente tardas tanto en subir de nivel?\r\nComo punto a parte leyendo me encontr&eacute; con gente que subi&oacute; muy r&aacute;pido del nivel 2 al 4 o 5, por eso me llama la atenci&oacute;n que despu&eacute;s de tanto tiempo ni si quiera haya podido recuperar el nivel 2.\r\nSaludos","replies":[{"poster":"waz0n","date":"2017-12-30T19:24:20.258+0000","up_votes":1,"down_votes":0,"body":"Bueno gracias por sus respuestas! Y yo tambien tenia entendido que cuando empezaba la temporada nueva todos volvian al nivel inicial que seria el nivel 2. Pero bueno de no ser asi para los niveles 0 y 1, supongo que habra que seguir esperando y portarse bien jaja. Saludos","replies":[]},{"poster":"WhiteMax","date":"2017-12-29T18:14:59.814+0000","up_votes":1,"down_votes":0,"body":"Yo diria que el sistema tiene un problema, no puede ser que cuando salio el sistema la gente subia de nivel en 1 semana y ahora haya que esperar meses y aun no subir de nivel.\n\nIgual cuando termine el año o empieze nueva temporada todos empezamos con honor nivel 2.","replies":[{"poster":"I WAS IN ALPHA","date":"2017-12-29T22:20:15.796+0000","up_votes":1,"down_votes":0,"body":"La gente subia rapido porque sacaron este sistema cuando ya casi finalizaba la season entonces que todos subieran rapido era intencional (o eso quiero creer) ademas de que nadie hubiera ganado las recompenzas xD, probablemente el sistema en la S8 si que te tardes mas que cuando salio asi que mejor no sacar conclusiones apresuradas jaja {{champion:11}}","replies":[]},{"poster":"El Impostor","date":"2017-12-29T18:45:59.127+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=PJAKt7ph,discussion-id=iKr9uBiV,comment-id=0001,timestamp=2017-12-29T18:14:59.814+0000)\n> \n> Igual cuando termine el año o empieze nueva temporada todos empezamos con honor nivel 2.\n\n\n\nNo, habían dicho que los honor 0 y 1 se quedan ahí mismo, el resto tiene un inicio basado en su honor al comenzar la temporada.","replies":[{"poster":"WhiteMax","date":"2017-12-29T18:49:20.341+0000","up_votes":1,"down_votes":0,"body":"Ahhh es verdad, se me olvido que dijeron eso de que los honor 5 pasarian a 4 o algo asi.","replies":[]}]},{"poster":"Enferiol","date":"2017-12-29T18:32:37.581+0000","up_votes":1,"down_votes":0,"body":"Saludos Invocador!\n\nsabes que sucede antes era para tener el icono sobre el marco de inicio de partida, luego fue para un centinela, y ahora es por llaves que te dan recursos que generalmente son dinero para Riot... a que voy... que Riot no le quiere dejar las cosas tan faciles mas cuando se trata de contenido que les genera dinero\n\n:Saludo con un Fail Flash: {{summoner:4}} \n\nEnferiol","replies":[]}]},{"poster":"Enferiol","date":"2017-12-29T18:30:29.077+0000","up_votes":1,"down_votes":0,"body":"Saludos invocador!\n\nCreo que el problema no es que este bug, creo que las sanciones restan constantemente de tus puntos de honor y por eso no se sube,  creo que los de Riot Games no implementaron el honor negativo todavia y por eso lo resta constantemente hasta que lo recuperes, y si cuesta estuve 6 meses para llegar al rango mas alto y no tuve ni una sancion en estos 2 ultimos años\n\nOjala sea un simple bug y se soluciones\n\n:Saludo con un Fail Flash: {{summoner:4}} \n\nEnferiol","replies":[]},{"poster":"Este No Es Zelos","date":"2017-12-29T18:40:17.966+0000","up_votes":1,"down_votes":1,"body":"Buenas!\nEl sistema de honor, en mi experiencia con el, funciona solo como un refuerzo positivo.\nAlgo como: \"te portas bien hay porogalleta, te portas mal hay puerta\".\n\nEntonces el sistema avanza conforme tu demuestras actitudes positivas, y se trasa si tienes las negativas.\nTe puedo decir que eh subido de nivel en un dia jugando 6-8 horas corridas, pero todas con buenas actitudes y callandome cuando las cosas salian mal. 8 Horas de juego son una semana de poca conexion, pero el tema esta en ser buena gente, ser constante, y entender que si te tilteas, te frenas solo.\n\nBueno no es una ciencia exacta no puedo decir ahgan esto o aquello, pero usen el :\n{{sticker:slayer-pantheon-thumbs}} \nEse gesto gratuito alienta mucho, aprendan a reconocer una buena jugada, a participar en equipo, compren el pink, y ponganlo para un aliado, no para ustedes (porque ya sabemso que ustedes si miran el mapa), traten de rotar, de participar sobre los objetivos.\n\nAh y eso si, no flameen en las salas de chat, no digo que eso cuenta, pero con uan partida toxica, aun si te quedas callado no vas a sumar mucho. Solo no incentiven eso, mute y a seguir jugando.\n\nSaludos y suerte!","replies":[]},{"poster":"V for Vice","date":"2017-12-29T17:56:33.476+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=17t-uO477rI\nDejaré esto por aquí y me iré lentamente...","replies":[]}]}