{"poster":"PotatoeGanker","date":"2016-08-13T14:37:15.710+0000","title":"Nerf de campeones // RITO PLS","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Desde hace casi un a&ntilde;o vengo jugando al LoL. Cuando inicie me gustaba mucho el juego, la comunidad flammer y los trolls me daban igual, yo disfrutaba. Ahora cada vez que juego contra ciertos campeones me da mucho asco, campeones practicamente inmortales? Que es esto Riot?\r\nEn fin, quisiera leerles mi Death Note en la cual digo que, si yo trabajara en Riot Games, eliminaria o nerfearia MUCHISIMO a los siguientes campeones:\r\nYasuo (curacion, da&ntilde;o y practicamente inmortal)\r\n Vayne (true damage en un adc... really?)\r\n Zed (se pasa un poco con el da&ntilde;o)\r\n Yi (creo que todos ya conocemos a un Yi en late...)\r\n Katarina (la reina de los pentakills, ahora desde nivel 6)\r\n Fizz (que tenga un escape esta bien, que tenga da&ntilde;o verdadero.. ok, puedo soportarlo. Pero de ahi a que sea un destructor con solo 1 item... ya nos pasamos un poco)\r\n Teemo (creo que no hacen falta explicaciones de porque deberian nerfearlo)\r\n\r\nY bueno hasta aca este post, Riot, si lees esto quiero que sepas que... los odio a todos.\r\nSi quieren amenazarme de muerte pueden hacerlo en le juego. Gracias","replies":[{"poster":"Diosmo","date":"2016-08-13T22:39:42.038+0000","up_votes":1,"down_votes":0,"body":"Hay que reconocer que Riot siempre esta modificando los campeones para tratar de nivelar y que ninguno este \"roto\". \nMuchos de esos campeones que mencionas si bien tienen mucho daño tambien son blandos, salvo a Yasuo y Zed que deberian erradicarlos del juego :P\nSi jugas con campeones tank como mencionaron no deberias tener problema.","replies":[{"poster":"PotatoeGanker","date":"2016-08-14T00:00:23.244+0000","up_votes":1,"down_votes":0,"body":"Hombre... como que son antitanques tambien algunos pero bueno","replies":[]}]},{"poster":"Guimoo","date":"2016-08-13T17:11:37.471+0000","up_votes":1,"down_votes":0,"body":"Entre a tu historial y vis que jugas con rammus, alistar, amumu, blitz, voli y no podes parar a estos campeones?\n\nTe esta faltando aprender a jugar mejor individualmente.","replies":[]},{"poster":"Krilin Noda Oro","date":"2016-08-13T15:21:08.299+0000","up_votes":1,"down_votes":0,"body":"Creo que si están desbalanceados algunos campeones pero no los que nombraste excepto por fizz, de todas formas balancear a todos y con la cantidad de items que existen es una tarea muy difícil,  pero al menos de vez en cuando lo intentan.","replies":[]},{"poster":"ryuzakihimura096","date":"2016-08-13T15:08:08.874+0000","up_votes":1,"down_votes":1,"body":":V pobre tipo , practicas mas men te falta muxo ;)","replies":[]},{"poster":"skysoul fenrir","date":"2016-08-13T15:01:46.652+0000","up_votes":1,"down_votes":1,"body":"y acaso tu palabra vale de algo entre los lideres de riot games","replies":[]},{"poster":"Thatchie","date":"2016-08-13T14:54:08.915+0000","up_votes":1,"down_votes":1,"body":"Es sarcasmo, no?","replies":[]}]}