{"poster":"RaisinDaRoof","date":"2017-12-17T17:44:15.184+0000","title":"im from malaysia which is so far from america, should i still be playing league in NA?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"i have about 210 - 290 pings (255 mostly.) and sometimes (i mean super rare) it spikes (also please answer, is that ping a good ping or a bad ping?). i`ve been thinking.. should i leave NA? i`ve been playing NA for like 2 years. i know its not a lot like season 3 4 or something but it is a lot of games and friends. idk if i want to leave or not. OR I COULD USE 2 SERVERS!. no. im gonna die using 2 accounts at once. and i have pbe..... rip lmfaoooooooooooo ( ps: i main {{champion:55}} )","replies":[{"poster":"Broporo","date":"2017-12-18T01:50:09.977+0000","up_votes":1,"down_votes":0,"body":"Well, as Kokua said most players would call that \"unplayable\", but in reality 200-300 isn't too terrible overall. Especially if you've been able to make due up until now! I myself have to deal with 125~ usually and there's no notable difference between that and 25 tbh. \n\nHonestly, I would try running some traceroutes to the other servers or possibly just try out a new account on the other regions to see if the improvement would be worth losing your progress overall. I know it'd suck majorly to lose your levels/skins and most importantly friends, but if your overall gameplay is better it might be worth it? There's nothing stopping you from keeping both accounts so that you can freely play with friends in either region to ^_^!","replies":[]},{"poster":"Chinchinchan","date":"2017-12-18T07:02:31.316+0000","up_votes":1,"down_votes":0,"body":"I'm not a very tech-savvy person, but I'm pretty sure 100-200 ping is playable as long as your computer is up to par. While many people do consider having above 100 ping as \"hard to play\" and anything beyond 150 as \"unplayable,\" in truth, you can still play quite well with pings around 200-250. The only difference is that you might have to play safer, or you might have to predict skill shots in a different style and a lot faster reflexes. There's also the fact that ping represents the time in which data gets transferred to and from the servers, but, correct me if I'm wrong, there's also the time it takes for the computer to process said information into your client. I've experienced before where my ping is constantly around 60, but my client was freezing around and characters were hopping all over the place. So as long as your computer is good, your reflexes better, then you can probably do it.","replies":[{"poster":"RaisinDaRoof","date":"2017-12-23T06:32:42.830+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No Racism Pls,realm=NA,application-id=osqw6G4M,discussion-id=1N8MP075,comment-id=0003,timestamp=2017-12-18T07:02:31.316+0000)\n>\n> I&#x27;m not a very tech-savvy person, but I&#x27;m pretty sure 100-200 ping is playable as long as your computer is up to par. While many people do consider having above 100 ping as &quot;hard to play&quot; and anything beyond 150 as &quot;unplayable,&quot; in truth, you can still play quite well with pings around 200-250. The only difference is that you might have to play safer, or you might have to predict skill shots in a different style and a lot faster reflexes. There&#x27;s also the fact that ping represents the time in which data gets transferred to and from the servers, but, correct me if I&#x27;m wrong, there&#x27;s also the time it takes for the computer to process said information into your client. I&#x27;ve experienced before where my ping is constantly around 60, but my client was freezing around and characters were hopping all over the place. So as long as your computer is good, your reflexes better, then you can probably do it.\n\nlol i played in the SEA server and it got to 27... i havent seen any difference tho. i still get fed and sometimes pentakill when i played on NA (255 ms). i played katarina. do you think katarina needs a lot of reflex?","replies":[{"poster":"Chinchinchan","date":"2018-01-02T03:43:45.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RaisinDaRoof,realm=NA,application-id=osqw6G4M,discussion-id=1N8MP075,comment-id=00030000,timestamp=2017-12-23T06:32:42.830+0000)\n>\n> lol i played in the SEA server and it got to 27... i havent seen any difference tho. i still get fed and sometimes pentakill when i played on NA (255 ms). i played katarina. do you think katarina needs a lot of reflex?\n\nWhat Katarina needs is not a lot of reflex, but more of timing. You have to time when you cast your skills and also adjust to the situation around you.","replies":[]}]}]},{"poster":"Kokua","date":"2017-12-17T17:57:37.944+0000","up_votes":1,"down_votes":0,"body":"You could try to make different accounts on the different servers to see if your ping changes for the better. 200-300 ping definitely isn't ideal. It could also be an issue with your ISP. I personally play with 100-200 ping, and many people would consider that to be high. Many of my friends believe 50-100 ping to be \"unplayable\" for them.","replies":[{"poster":"RaisinDaRoof","date":"2017-12-18T00:50:35.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kokua,realm=NA,application-id=osqw6G4M,discussion-id=1N8MP075,comment-id=0001,timestamp=2017-12-17T17:57:37.944+0000)\n>\n> You could try to make different accounts on the different servers to see if your ping changes for the better. 200-300 ping definitely isn&#x27;t ideal. It could also be an issue with your ISP. I personally play with 100-200 ping, and many people would consider that to be high. Many of my friends believe 50-100 ping to be &quot;unplayable&quot; for them.\n\ni know that the server that are in SEA (south east asia) would be good (super good cuz my country is super close to singapore (the server) ), but i would lose a lot of progress. nah its not an issue with my ISP, try going on google map and see the distance from NA to MY (malaysia). the problem is, i would lose a lot of progress... oh well, 210 - 299 is still a green on the server","replies":[{"poster":"Kokua","date":"2017-12-18T04:10:21.202+0000","up_votes":1,"down_votes":0,"body":"I'm personally around 6000 miles away, and you're around 8500 miles away from California. Last time I checked, my ISP had a 47/100 connection score with their server, with my personal connection being 29/100, and the best ISP in my area had a connection score of 55/100. I live deep in my community, farm from my ISP, and recently another ISP just started laying down lines in my area. If I were to switch to them, I probably would get a better connection.\n\nJust checking the [Lag Report](https://lagreport.na.leagueoflegends.com/en/) again, my ISP is down to 45/100, with my connection also going down to 21/100, and the best in the area up to 56/100. It also names the ISP so you know who to switch to if you plan on switching.","replies":[]}]}]},{"poster":"RaisinDaRoof","date":"2017-12-17T17:45:31.338+0000","up_votes":1,"down_votes":0,"body":"#ThisIsMyFirstBoard","replies":[]}]}