{"poster":"DrMedConner","date":"2016-04-25T11:51:11.145+0000","title":"TrueDamageGaming sucht neuen Supporter und Midlaner","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"**_ZURZEIT SIND ALLE ROLLEN WIEDER BELEGT BITTE KEINE ANFRAGEN MEHR _**\n\nTrueDamageGaming sucht neuen Supporter und Midlaner\n\nWas bietet dir TrueDamageGaming ?\n\nGemeinsame Verbesserung, Ranked Aktivit&auml;t, Turnier Teilnahmen, Gegner Herau&szlig;forderungen, eine Professionele Homepage ( http://truedamagegaming.de , einen Eigenen Teamspeak Server\n\nWas solltes du mitbringen :\n\nAktivit&auml;t, ein funktionierendes Headset, Silber 1 bis Gold 2 Division, eine Champion Auswahl auf deiner Lane\n\nFalls du denkst du bist der richtige dann melde dich einfach bei TempelKriegerGG\nvlt sieht mann sich als neuen Teampartner bei TrueDamageGaming\n\nLG TempelkriegerGG (Teamleiter und Clanf&uuml;hrung)","replies":[{"poster":"Meeps","date":"2016-04-25T14:49:01.251+0000","up_votes":1,"down_votes":0,"body":"Servuzz :P Also ich bin Umut, 21 Jahre alt, werde nächste Woche 22, ich würde mich gerne für die MID oder Sup Rolle bewerben ^^''\nAktuell bin ich Plat 3, da ich ehrlich gesagt die Motivation verloren habe Solo Queue zu suchten ( soll nicht heißen das ich generell keinen Bock habe zu spielen :P ) Letzte Season war mein High Peak , Dia 2 als SUP / MID.\n\nAlso ich Spiel LOL seid mitte/ende Season 2 und war schon immer MID laner oder SUPPORT\nwas meinen Championpool angeht sieht es wie folgt aus:\n\nMID:\n\nZed, Lulu, Orianna, Azir, LeBlanc, Viktor, Zyra das sind so meine Favourites ^^''\n\nSupport :\n\nThresh, Braum, Lulu, Blitzcrank, Leona, Taric, Alistar, Bard\n\nTeam Ranked erfahrung habe ich auch, war von Season 3 bis Ende Season 5 in einem Team und haben auch an verschiedenen Wettkämpfen Teilgenommen, musste mich leider aber aus dem Team verabschieden da ich mit einigen Personen rein Charakterlich nicht klargekommen :D\n\nPersönliches Ziel ist eig mit vielen Leuten Spaß zu haben und ein einigermaßen Vertrauenswürdiges Team zu \"Führen\" bzw ein Teil solch eines Teams zu sein.\n\nIn League ist mei Ziel einfach das ich mit meiner eigenen Leistung zufrieden bin.\n\nZeit habe ich eig. jeden Tag vo 19:00 bis Open End :D je nach Tag und absprache auch Früher.\n\nFreue mich schon auf eure Nachricht :P\n\nGreetz\n\nUmut\n\nPS: Ich bin ein Flame Freier und Blame Freier Spieler der, die Fehler eigentlich erst immer an mir selber sucht und versucht diese zu beheben. :)","replies":[]},{"poster":"xCpt Blood Moon ","date":"2016-04-25T13:44:59.462+0000","up_votes":1,"down_votes":0,"body":"Hallo :)\n\nAktuell Gold I letze Season Platin I Main Support! ^_^\nIch bin seid Ca. Season 3 Main Supporter :-) \nDaher ist mein Championpool bis auf ein paar Ausnahmen die ich einfach nicht spiele unbegrenzt.\nJedoch hier mal nach Prio, Häufigkeit & Meisterung aufgelisetet:\n{{champion:40}}!!!! <3  {{champion:412}} {{champion:12}} {{champion:111}} {{champion:201}} {{champion:16}} {{champion:37}} {{champion:53}} {{champion:432}} {{champion:63}} {{champion:1}} {{champion:25}} {{champion:267}} \n\nIch bin jeden Tag nach der Arbeit online und gerne für jeden Spaß zu haben.\nIch bin sehr wissenshungrig und lasse mich trz. immer gerne verbessern solange es konstruktiv bleibt.\n\nAnsonsten ich bin ein sehr ruhiger und konzetrierter Spieler und keine Rampensau.\nIch bin auch kein Trickser also predicted flash Hooks random ins dunkle ist bei mir eher eine Seltenheit ich setze auf eine stabile, sichere und konstant gute Art des gamings.\n\nAnsonsten ja. Wenn Ihr Interesse habt gerne einfach mal melden! :)\n\nWürde mich freuen! \nVllt. bis dann!{{champion:40}}  {{summoner:6}}","replies":[]},{"poster":"404 Madi","date":"2016-04-25T12:38:39.304+0000","up_votes":1,"down_votes":0,"body":"Hey ich bin Gold 3 , Main- Supp , jeden Tag on , kann jeden Supp spielen, Mains : {{champion:412}} {{champion:201}} {{champion:53}} {{champion:432}} {{champion:48}} \nHab dich ig geaddet ^^","replies":[]},{"poster":"Talon The First","date":"2016-04-25T12:26:08.855+0000","up_votes":1,"down_votes":0,"body":"Hallo platin2 main mid zed talon und bald corki ich bin euer mann für den job!","replies":[]}]}