{"poster":"waiting for WoW","date":"2017-12-16T12:58:24.642+0000","title":"Phase Rush is still terrible and scales far too slowly","subforum":"Gameplay","up_votes":44,"down_votes":2,"body":"I almost never see anyone taking Phase Rush unless it&#039;s on a champion that it is absolutely essential on like Cassiopeia. It&#039;s 3-hit mechanic makes it too hard to proc for a lot of mages, and it&#039;s early-mid game movespeed is too slow for juggernauts like Nasus to prioritize taking it over klepto or grasp.\n\nPhase Rush is now just a niche keystone for a tiny subset of champions like Asol and Cassiopeia, and even then it&#039;s bad on them but what choice do they have? This is all they have left from stormraider&#039;s.","replies":[{"poster":"Blåbæret","date":"2017-12-16T17:09:56.193+0000","up_votes":26,"down_votes":1,"body":"And yet they nerfed it. Riot's balance team is so freaking dumb.","replies":[{"poster":"LeafyGreen","date":"2017-12-17T04:34:05.687+0000","up_votes":1,"down_votes":0,"body":"They nerfed it for melee users like Darius who were extremely powerful. They actually buffed it for ranged users by giving them the movespeed penalty reduction also","replies":[{"poster":"D357R0Y3R","date":"2017-12-17T06:09:38.546+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=LeafyGreen,realm=NA,application-id=3ErqAdtq,discussion-id=ixkmqOzq,comment-id=00070001,timestamp=2017-12-17T04:34:05.687+0000)\n>\n> like Darius who were extremely powerful.\n\n\n......\n?","replies":[]}]},{"poster":"korg023","date":"2017-12-17T12:04:26.962+0000","up_votes":2,"down_votes":0,"body":"And when i say that i dont mean to offend them just for purpose of rant but i really think they make some dumb decisions like wtf are you guys even doing?","replies":[]},{"poster":"ShaolinToilet","date":"2017-12-16T19:06:53.453+0000","up_votes":1,"down_votes":11,"body":"Maybe you should apply for riot I'm sure you'd do great","replies":[{"poster":"Shablagoo","date":"2017-12-17T01:12:15.637+0000","up_votes":5,"down_votes":1,"body":"Still doesnt change the fact that they do a bad job does it though?","replies":[]}]}]},{"poster":"wildfox99","date":"2017-12-16T14:14:05.404+0000","up_votes":12,"down_votes":0,"body":"well,same for electrocute that is taken over dark harvest in 99% of the cases because it isn't as good as electro in early and it takes too much for scale\n\nor aery that gives a better trade/poke with a lower CD than comet (15~40 + 0.1AP 3 sec CD vs 30/100 + 0.2 AP 20~8 sec CD) and  its shield is better than  guardian -> 30~80 + 0.25AP 3 sec CD vs 60~150 + 0.1AP (which you wont build as tank) + 10% bonus hp (which you wont build as enchanter,so just one of them) 45 sec CD (15 times higher)\n\nsame for waterwalking , minion dematerializer or approach velocity that feels so bad to use\n\njust reminding that it isn't the only issue\n\nthey should buff its movement speed at early ranks as without boots it wouldn't be so effective anyway,and a bit more for lategame (like 35~55% based on level)\n\ni want kidnapper {{champion:223}} run even faster  {{sticker:sg-jinx}}","replies":[{"poster":"THE RlVER KlNG","date":"2017-12-16T20:53:12.600+0000","up_votes":2,"down_votes":0,"body":"haha its not even good on tahm in lane bc grasp or tempo is so much better for trading","replies":[{"poster":"wildfox99","date":"2017-12-16T20:58:36.299+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=THE RlVER KlNG,realm=NA,application-id=3ErqAdtq,discussion-id=ixkmqOzq,comment-id=00010000,timestamp=2017-12-16T20:53:12.600+0000)\n>\n> haha its not even good on tahm in lane bc grasp or tempo is so much better for trading\n\nbut it is funny  {{item:3009}} {{summoner:6}} {{item:3800}} {{item:3069}}","replies":[]}]},{"poster":"korg023","date":"2017-12-17T12:06:39.756+0000","up_votes":2,"down_votes":0,"body":"Yeah they really made it so obvious which one keystone does more so you cant really have fair competition when one has way more utility and dmg over another choices. Like you wanna poke? Aery deals just way more dmg,want burst? Electrocute since its more consistent than any other choice in that tree. Etc Etc.","replies":[]}]},{"poster":"Namulith","date":"2017-12-16T13:54:52.569+0000","up_votes":4,"down_votes":0,"body":"It's real fun on the Kench","replies":[]},{"poster":"Tychusfindlay918","date":"2017-12-17T06:06:12.607+0000","up_votes":3,"down_votes":0,"body":"the movespeed being too slow isnt the reason nasus doesnt take phase rush. It's the fact that nasus lost the abilitiy to just smack someone with a q and almost guarantee an SRS proc. That was huge mid and late game, now it feels INCREDIBLY clunky trying to get phase rush (new SRS) to work on nasus.","replies":[]},{"poster":"WubbaLubbaDubDab","date":"2017-12-16T14:45:05.798+0000","up_votes":2,"down_votes":2,"body":"play darius with phase rush and ghost :D","replies":[{"poster":"DeusVult","date":"2017-12-16T21:55:49.341+0000","up_votes":3,"down_votes":0,"body":"Its the same as Stormraiders Surge, but worse.  Like it is worse than stormraiders for 90% of the game, and harder to proc for the people that want to run Phase Rush.","replies":[]}]},{"poster":"SanKakU","date":"2017-12-16T15:54:30.597+0000","up_votes":3,"down_votes":0,"body":"It's okay on Vel'koz but at that cooldown I'd rather take something else. Also, if you're playing him support and your ally can't keep up with you, it's far worse than when you flash away and leave your ally behind to die...because you're potentially leaving them behind around 3 times a minute or so.\n\nThe champs it works on like VK, it is just not good on. It was an epic failure of a keystone IMO. All the champs that used to love Stormraider's Surge now have to adjust their play style and if that's not possible, they just lose.\n\nBeing able to take a kill before anyone has boots because someone was too squishy...I think with the lack of defensive runes, more champions would have benefited from Stormraider's Surge than before, so it might have been a very common keystone. They probably were worried about it becoming too common if it was left as it was. But a lot of the runes in this rune rework aren't as good as you'd hope they were.\n\nStormraider's Surge was useful both for disengage and for chasing. You can't say the same about this new keystone. I only tried it on Vel'koz because I bought him recently, and it only is useful on him for disengaging. \n\nI actually haven't been particularly successful like I used to be with Veigar. It's a lot harder to punish enemies with a quick Q R combo when they go for my lane partner too hard because I can't activate the keystone properly in a timely manner. The red keystone isn't any better because it's not available until you have boots and nobody can start boots as their gold income item.\n\nIf I could take 'E hat' instead of 'R hat', then we'd have something to talk about for support Veigar. But at the moment, it seems pretty dead.","replies":[]},{"poster":"Mokuto Bunshi","date":"2017-12-16T23:38:23.431+0000","up_votes":1,"down_votes":0,"body":"I think the only champs that love it are those with self slows. And of them the only one I know can ~~ab~~use it well is Kench with this build: https://www.youtube.com/watch?v=4hW46xSSNPw So that the slows either don't affect you.","replies":[{"poster":"5000000000000000","date":"2017-12-17T01:17:02.783+0000","up_votes":1,"down_votes":0,"body":"Vi and Varus can't use it. Rammus is questionable, and Urgot could be interesting. Haven't seen it yet.","replies":[{"poster":"Declareas","date":"2017-12-17T04:31:47.091+0000","up_votes":2,"down_votes":0,"body":"Urgot's self slow is intentionally a reduction in base movement speed so that slow resistance doesn't effect it.","replies":[{"poster":"5000000000000000","date":"2017-12-17T06:16:00.544+0000","up_votes":1,"down_votes":0,"body":"Damn, so basically just Tahm Kench can abuse it?","replies":[{"poster":"Declareas","date":"2017-12-18T03:30:47.851+0000","up_votes":2,"down_votes":0,"body":"Yeah, pretty much.","replies":[]}]}]}]}]},{"poster":"Solidair3","date":"2017-12-17T01:33:18.351+0000","up_votes":2,"down_votes":1,"body":"I feel like for it to be better the children would have to be longer","replies":[{"poster":"One35","date":"2017-12-17T19:18:07.799+0000","up_votes":2,"down_votes":0,"body":"wat","replies":[{"poster":"Solidair3","date":"2017-12-18T01:36:56.741+0000","up_votes":2,"down_votes":0,"body":"lmao did that on my phone it autocorrected duration to children for some reason","replies":[]}]}]},{"poster":"korg023","date":"2017-12-17T12:03:21.396+0000","up_votes":2,"down_votes":0,"body":"Its funny how they wanted to make it \"more consistent\" but its acutally more inconsistent since you need 3 abilities or unique attacks to proc it when before you could just proc it with one ability lets say Nasus Q or graves Q or any ability that deals some dmg. I now feel like i never proc it ever and even when i do it feels terrible since my target is usually already dead anyways.","replies":[]},{"poster":"Durzaka","date":"2017-12-16T17:10:14.442+0000","up_votes":2,"down_votes":0,"body":"Yeah, Phase Rush sucks. It is supposed to replace Stormraider's, but half the people who used to use stormraider cant use Phase Rush because it requires a stupid 3 hit mechanic.","replies":[]},{"poster":"YumaS2Astral","date":"2017-12-16T16:47:16.105+0000","up_votes":2,"down_votes":0,"body":"Just a question, does it work with {{champion:6}}? Because in theory it seems like it is the best keystone for him besides Press the Attack, which I am reluctant to take because going this tree means gaining attack speed which is useless for Urgot.","replies":[{"poster":"Entheos Geon","date":"2017-12-16T20:23:41.788+0000","up_votes":2,"down_votes":1,"body":"He doesn't slow himself by a percentage, he loses flat movement speed during W so Phase Rush really isn't good on him. You're better off going Comet or Electrocute.","replies":[]}]},{"poster":"Barkley","date":"2017-12-16T17:18:58.912+0000","up_votes":2,"down_votes":1,"body":"Phase rush darius gives me PTSD.","replies":[]},{"poster":"Troll for Trump","date":"2017-12-16T16:44:24.225+0000","up_votes":2,"down_votes":1,"body":"Darius still needs it to make up for how shitty he is","replies":[{"poster":"Raid Boss Morde","date":"2017-12-17T08:28:53.205+0000","up_votes":1,"down_votes":0,"body":"He doesn't need it though. He's got slows and a pull, along with some good movement speed. Now there is someone who I miss taking it on... ahem","replies":[{"poster":"Troll for Trump","date":"2017-12-17T10:15:13.956+0000","up_votes":1,"down_votes":2,"body":"Slows and a pull are nothing compared to the cc required today to force an all-in. Slows and pulls would be fine if Darius were supposed to engage in short trades, but he isn't.\n\n340 movement speed isn't good either, it's pretty average.","replies":[]}]}]},{"poster":"KlydeFrog","date":"2018-01-31T22:04:14.591+0000","up_votes":1,"down_votes":0,"body":"Meh I don't see the point of it . I mean I would rather have more damage then anything and if your chasing approach velocity is better because it has no cd","replies":[]},{"poster":"Moon Mom","date":"2017-12-17T13:29:21.454+0000","up_votes":1,"down_votes":1,"body":"the old SRS was really unbalanced. It needs a small adjustment early and it will be fine. I take it on Diana as my primary keystone.","replies":[{"poster":"ChaddyFantome","date":"2017-12-18T17:35:47.974+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dìana,realm=NA,application-id=3ErqAdtq,discussion-id=ixkmqOzq,comment-id=0015,timestamp=2017-12-17T13:29:21.454+0000)\n>\n> the old SRS was really unbalanced. It needs a small adjustment early and it will be fine. I take it on Diana as my primary keystone.\n\nIn what regard was it unbalanced? Imo, it was always underrated if anything.","replies":[]}]},{"poster":"ChaddyFantome","date":"2017-12-18T17:35:18.654+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}} {{champion:91}} {{item:3070}}","replies":[]},{"poster":"Onandaga","date":"2017-12-17T22:25:33.499+0000","up_votes":1,"down_votes":0,"body":"Another part of it is that a lot of juggernauts, the class that used stormraiders the most, are better off with the health they get for Resolve then they are with the AD/AP form Sorcery. That on top of phase rush itself sucking just makes it a no go for them.","replies":[]},{"poster":"Jerry SeinfeId","date":"2017-12-17T16:59:36.497+0000","up_votes":1,"down_votes":0,"body":"i wanted to use this on singed but aery feels so much better.","replies":[]},{"poster":"Swittz","date":"2017-12-17T11:49:56.101+0000","up_votes":1,"down_votes":0,"body":"{{champion:82}} = me happy","replies":[{"poster":"leakinb","date":"2017-12-17T14:33:30.684+0000","up_votes":1,"down_votes":0,"body":"I think {{champion:82}} with PR is only good when against champ with big slow{{champion:122}} {{champion:23}} {{champion:36}} \notherwise i would rather take arey","replies":[]}]},{"poster":"strut","date":"2017-12-17T12:13:07.529+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}} {{champion:8}} {{item:3070}}","replies":[]},{"poster":"Succubús GF","date":"2017-12-17T09:20:35.560+0000","up_votes":1,"down_votes":0,"body":"its good on Diana :D","replies":[]},{"poster":"shicky97","date":"2017-12-16T18:15:44.030+0000","up_votes":1,"down_votes":0,"body":"Phase Rush is magical on Tahm Kench though. Kidnapper Kench baby!","replies":[]},{"poster":"leakinb","date":"2017-12-16T15:50:23.431+0000","up_votes":1,"down_votes":0,"body":"I usually take it when laning against champ with a big slow like{{champion:122}} {{champion:75}} \nJust kite them much more easily as without those slow they are shit\nBut against other champ i rather take comet or arey\n\nEdit: I feel the same with you, they scale too slow","replies":[]},{"poster":"Terozu","date":"2017-12-17T01:11:59.959+0000","up_votes":1,"down_votes":1,"body":"Annie, Eve, and Kayn are great with it.","replies":[]},{"poster":"Azadethe","date":"2017-12-16T19:36:14.990+0000","up_votes":1,"down_votes":1,"body":"I can proc Phase instantly on Morgana or Evelynn, but that's beside the point. I wouldn't mind it doing slightly more early on, since Fleet footwork put adcs on a flat increase and a huge buff, and with the early assassins dominating every role.","replies":[]},{"poster":"Giggling Granny","date":"2017-12-17T08:14:28.901+0000","up_votes":1,"down_votes":2,"body":"lets be honest phase rush the and the old one was never balanced....Riot finally balance it so no every broken champion can use it have 2k ms for no reason on top of their stupid outdated kit or broken kit","replies":[]}]}