{"poster":"KiubyZaya","date":"2015-05-17T00:20:45.049+0000","title":"Soraka y fiora que a pasaso","subforum":"Charlas Generales","up_votes":1,"down_votes":12,"body":"Hola abro este pos nomas solo para que reduscan el infriamiento a las avilidades de fiora Tardan mucho su Q tarda mucho su R todos el team tiene R menos ella y de ai lo putean a uno por no tener R atiempo son 25 sg mas de espera Soraka se volvio un hero despresiado por todos estoy rankiando metoca soporte y pongo a soraka empiesa a desir que soraka no sirve es mal hero no tiene nada bueno agan algo con soraka era ates la mejor ia ora umillada. soraka te amamos simpre &lt;3\r\n\r\nsi ahy algien que apolle asoraka selos agradeseria mucho Grasias","replies":[{"poster":"ZorroDorado","date":"2015-05-17T00:55:53.402+0000","up_votes":3,"down_votes":0,"body":"Wazaaaaaaaaa!:\nNo te lo tomes a mal, compañero, pero mejora tu ortografía si quieres esperar resultados positivos de la sociedad. \nRecuerda que una buena ortografía es el reflejo de tu estudio y educación ^-^\n\nEn cuanto a tu tema:\nTanto Soraka y Fiora aun están OP, si Fiora tuviera su R en un tiempo menor al estimado seria una desventaja para el equipo contrario. Lo mismo Soraka, un tanque podría tirar 2 torres solo con la ayuda de Soraka y su R... Desde mi punto de vista sus tiempos de espera están mas que bien (y)\nSaludos!!","replies":[]},{"poster":"Tordo RHCP","date":"2015-05-17T07:12:55.715+0000","up_votes":1,"down_votes":0,"body":"mucho dota me parece","replies":[]},{"poster":"Sonatic","date":"2015-05-17T03:13:36.441+0000","up_votes":1,"down_votes":0,"body":"Soraka ahora es lo más, con Eco de Luden se vuelve loca.\nAunque igual me hubiera gustado usarla  cuando ella daba Mana.","replies":[]},{"poster":"AporroGrantz","date":"2015-05-17T01:50:11.379+0000","up_votes":1,"down_votes":0,"body":"esto es sarcasmo?","replies":[]},{"poster":"Demon of Mercy","date":"2015-05-17T01:15:23.265+0000","up_votes":1,"down_votes":0,"body":"adoro a soraka tal cual esta ahora xD es pero creo que del tipo de sup que helea , la mejor (es solo mi opinion)en cuanto a fiora tal cual esta ahora con alguien con buena habilidad en el juego y si mainea a fiora, esta rota xd","replies":[]}]}