{"poster":"Sanghul","date":"2015-12-22T01:30:26.599+0000","title":"[Graunacht-Kurzgeschichte]  Im Bann der Graunacht","subforum":"Community-Kunstwerke","up_votes":2,"down_votes":0,"body":"Hallihallo!\r\nIch habe gerade gesehen, dass einige ihre Geschichten zur Graunacht hier hochgeladen haben. Da es in letzter Zeit so ruhig um den Wettbewerb geworben ist und ich nat&uuml;rlich traurig war, dass keine R&uuml;ckmeldung in meinem Postfach gelandet ist... werde ich meine Story hier auch mal zum Besten geben! \r\nW&auml;re sch&ouml;n wenn sich jemand die Zeit nimmt, sie zu lesen. Ich habe echt einiges an Aufwand, vor allem auch Recherche hinein gesteckt. Mal schauen wer alle Referenzen zum Spiel und Champions entdecken kann! (Ist aber auch lang geworden, gerade so an der Grenze: 2993 W&ouml;rter! :D)\r\n\r\n**_IM BANN DER GRAUNACHT_**\r\n\r\n**_D_**ie K&auml;lte des nahenden Winters war bereits sehr deutlich im Wind zu sp&uuml;ren. Nicht mehr lange, und er w&uuml;rde Schnee und Eis von Norden &uuml;ber das Meer nach Valoran tragen. Eine starke B&ouml;e erfasste seine ausgebreiteten Fl&uuml;gel. Er legte sich in den Wind, schloss die Augen und lie&szlig; sich treiben. Die bei&szlig;ende K&auml;lte konnte sein Federkleid nicht durchdringen und so segelte er beinahe schwerelos durch die L&uuml;fte. Rechts von ihm erstreckte sich der endlose Ozean, links reckten sich die zerkl&uuml;fteten, wei&szlig;en Berge von Freljord in die H&ouml;he, als wolle jeder den anderen an Gr&ouml;&szlig;e und Erhabenheit &uuml;bertrumpfen.\r\n Und trotz seiner scharfen Augen sah er sie nur als verschwommene Schemen am Horizont. Auch das Wasser um sich herum konnte er nun schon seit einigen Tagen nicht mehr zur G&auml;nze &uuml;berblicken. Etwas verhinderte die Sicht. Etwas kroch da &uuml;ber die Wogen des Meeres, verbreitete sich. Und es kam immer n&auml;her. \r\n  Valor kniff die Augen zusammen und sp&auml;hte in Richtung Westen. Am Horizont tauchten Umrisse auf, erst undeutlich, dann immer deutlicher. Eine Insel sch&auml;lte sich aus dem Nebel. Und dann noch eine und noch eine - oder&hellip; war es umgekehrt? Kamen gar nicht die Inseln aus dem Nebel, sondern vielmehr der Nebel von den Inseln?\r\n  Der gro&szlig;e Adler stie&szlig; einen Warnschrei aus, schlug zweimal mit den m&auml;chtigen Schwingen und legte die Fl&uuml;gel an. Mit dem Schnabel voran fiel er nach unten, wurde schneller und schneller. Wie ein Pfeil stie&szlig; er durch eine niedrige Wolkendecke und schoss senkrecht auf das Deck des Schiffes zu, das sich weit unter ihm unter vollen Segeln durch die Wellen schob.\r\n\r\n\r\n  _**Q**_uinn stand ganz vorne am Bug, mit einer Hand umklammerte sie die Takelage. Mehr als zwanzig Fu&szlig; unter ihr brachen sich die Wellen am Rumpf der Malphite und wirbelten die Gischt auf. Sie streckte die Nase nach vorn und atmete die salzige Luft ein, sp&uuml;rte den Wind auf ihrem Gesicht. Freiheit. Nichts roch und f&uuml;hlte sich sch&ouml;ner an als die Freiheit. Vor allem nachdem man dem Gestank von Bilgewasser entkommen war, dieser Suppe aus Menschen, Dreck, ausgeweideten Kadavern und Tod. \r\n  Der Fahrtwind blies ihr die Haare ins Gesicht. Innerhalb der letzten Tage hatte der Nebel daf&uuml;r gesorgt, dass sich ihr r&ouml;tlicher Schopf an den Spitzen lockte. Leichter Regen befeuchtete ihre Wangen und erschwerte es die Augen offen zu halten. Seit einer Woche hing der seltsame Nebel &uuml;ber dem Meer, die Sonne versteckte sich hinter dunklen Wolken und trocken blieb es an Deck selten. Aber sie genoss das Wetter. Die See schickte es ihnen.\r\n  Es musste nun ein gutes Dutzend Tage her sein, seit die Malphite im Schlachterhafen abgelegt hatte. Unter vollen Segeln waren sie aus den stinkenden Gew&auml;ssern Bilgewassers hinausgefahren, w&auml;hrend hinter ihnen die Stadt unterging. Der Admiral hatte geahnt, dass es so kommen w&uuml;rde, und so hatten sie die Beute ihrer letzten Kaperfahrt bei dem erstbesten H&auml;ndler gegen Gold, Proviant und Rum getauscht, zu einem Kurs, dass ihnen die B&auml;rtige Dame h&ouml;chstpers&ouml;nlich daf&uuml;r in die Fischsuppe gespuckt haben musste. Doch kurz darauf war Gangplank gest&uuml;rzt worden und man h&auml;tte nirgends in der gesamten Stadt auch nur noch eine Hafenratte gefunden, bei der man eine Silberschlange erhandeln h&auml;tte k&ouml;nnen. Und w&auml;hrend die hinterh&auml;ltigsten, brutalsten und &uuml;bel riechendsten Banden in Bilgewasser begannen, sich gegenseitig zu zerfleischen, waren Admiral Garen und seine kleine Crew hinaus auf den Ozean gefahren und hatten sich auf den langen Weg um die n&ouml;rdliche K&uuml;ste Valorans bis nach Demacia gemacht.\r\n  Auf der H&ouml;he von Piltover hatte es dann begonnen, ungem&uuml;tlich zu werden. Leichter Nebel schwebte &uuml;ber dem dunklen Wasser, der Wind frischte auf und Regenwolken zogen vor die Sonne. Je n&auml;her sie den Gebirgsz&uuml;gen Freljords kamen, desto dichter wurde die Suppe. Es dauerte nicht lange und sie konnten die K&uuml;ste nicht mehr mit blo&szlig;em Auge erkennen. Auch anderen Schiffe begegneten sie nichtmehr, die Malphite glitt einsam durch die Wogen. \r\n  Nicht nur, dass der Dunst sich nicht verzog und tagelang ihr einziger Begleiter auf hoher See war, war seltsam. Es war auch die Farbe, die ihnen Sorge bereitete. Die Nebelschwaden schienen dunkler zu sein als herk&ouml;mmliche, ein tiefes Schwarz durchzog sie wie Verluste die Erinnerungen. Irgendetwas war in diesem Nebel, so schien es. Es musste an der nahenden kalten Jahreszeit liegen, man h&ouml;rte Ger&uuml;chte &uuml;ber das Erwachen einer alten Hexe im Ewigen Eis, tief in den schroffen, lebensfeindlichen Bergen Freljords. Der Dunst musste von ihnen herr&uuml;hren. Sollte diese Hexe doch im Eis bleiben, der Ozean geh&ouml;rte ihnen. \r\n \r\n Gepolter an Deck riss Quinn aus ihren Gedanken. Hinter ihr hatte Aatrox etwas aus dem Meer gezogen. Der gro&szlig;e Mann, halb Mensch halb Hammerhai, stand &uuml;ber eine im Netz gefesselte Kreatur gebeugt. Graue Haut spannte sich &uuml;ber die deutlich darunter zu sehenden Muskeln, die Regentropfen spiegelten die Umgebung w&auml;hrend sie dar&uuml;ber liefen. Aus dem skurrilen Haikopf musterte ein Paar kleiner Augen, blau und klar wie ein S&uuml;&szlig;wassersee, wachsam seine Beute. Bei dem, was er sah, fletschte er seine Z&auml;hne. Mehrere Reihen messerscharfer Waffen kamen zum Vorschein.\r\n  Unter Seem&auml;nnern gab es viel Garn dar&uuml;ber, wie der unbarmherzige K&auml;mpfer zu seinem Aussehen kam. Nicht wenige behaupteten, sein Vater sei ein ber&uuml;chtigter Piratenkapit&auml;n gewesen, der eines Nachts zu tief in die Flasche geschaut und einem Fischfang seinen Samen zum Geschenk gemacht habe. Andere erz&auml;hlten sogar von einem riesigen Ungeheuer, dass Aatrox&rsquo; Vater so lange gejagt habe, dass er es irgendwann zu lieben gelernt h&auml;tte. Weniger aber wagten, von einer Hure aus Bilgewasser zu reden, die ihre Beine f&uuml;r jeden und alles breit machte, egal wie viele Z&auml;hne oder Flossen es hatte. Nur eines stand auf jeden Fall fest, n&auml;mlich dass keiner der Narren, die ihre Version der Geschichte in Aatrox N&auml;he verk&uuml;ndeten, noch eine Zunge besa&szlig;. Quinn war zumindest froh, Aatrox zu ihren Br&uuml;dern auf See z&auml;hlen zu k&ouml;nnen.\r\n  &ldquo;Was hast du da?&rdquo;, fragte sie und lief in Richtung des zappelnden Etwas, das dort auf den Planken lag.\r\n  Aatrox knurrte. &ldquo;Kein Fisch. Naja, zumindest nicht ganz.&rdquo; Neben allerlei Muscheln und Krebsen hatte sich eine junge Frau in dem Netz verfangen. Sie besa&szlig; ein h&uuml;bsches Gesicht und w&auml;re auch ein sehr ansehnlicher Mensch gewesen, h&auml;tte sie nicht &uuml;berall auf der Haut Schuppen gehabt. Anstelle von Beinen endete ihr Rumpf in einen gro&szlig;en Fischschwanz, ebenfalls &uuml;bers&auml;t mit gl&auml;nzenden Schuppen. Das Gesch&ouml;pf versuchte mit den H&auml;nden einen gro&szlig;en Stab zu fassen zu bekommen, der sich weiter hinten im Netz verheddert hatte. \r\n  &ldquo;Sie mal einer an. Beim unrasierten Bart der Dame, was bist du?&rdquo; Quinn umrundete das wundersame Wesen und trat den Stab mit dem Fu&szlig; aus seiner Reichweite. &ldquo;Sprichst du unsere Sprache, Sch&ouml;nes? Verstehst du uns?&rdquo;\r\n  Die Kreatur spuckte Wasser und keuchte. Es schien ihr schwer zu fallen, an Land zu atmen. &ldquo;Bitte&hellip;&rdquo;, brachte sie ersch&ouml;pft hervor.\r\n  Quinn wechselte einen kurzen Blick mit Aatrox. &ldquo;Wer bist du? Hast du einen Namen? Was machst du hier?&rdquo;, verlangte sie zu wissen. &ldquo;Wir sind normalerweise gar nicht so, wei&szlig;t du. Wir sind echt freundlich und hilfsbereit. Es sind eben nur schwere Zeiten&rdquo;, f&uuml;gte der gro&szlig;e Menschenhai hinzu und feilte sich mit einem Entermesser die Z&auml;hne.\r\n  &ldquo;Bitte&rdquo;, stammelte sein Fang und spuckte erneut Wasser. &ldquo;Nami&hellip; man nennt mich Nami&hellip;&rdquo; Beim Sprechen verzog sie schmerzvoll das Gesicht.\r\n  &ldquo;Das ist ja schonmal ein guter Anfang&rdquo;, l&auml;chelte die Korsarin. \r\n  &ldquo;Ihr versteht nicht&hellip; Bitte. Ihr m&uuml;sst&hellip;&rdquo; &ldquo;Wir m&uuml;ssen gar nichts&rdquo;, unterbrach sie Aatrox. Eine gro&szlig;e Welle lie&szlig; das Schiff schaukeln. Gischt spritzte &uuml;ber die Reling und ein Schwall kalten Wassers ergoss sich &uuml;ber Nami. Sie hustete und keuchte. &ldquo;Der Nebel&hellip; er ist&hellip; Bitte&rdquo;, versuchte sie die Worte hervor zu pressen als stecke ihr ein Anker quer in der Kehle. \r\n  Die beiden Piraten sahen sich fragend an. Auf einmal b&auml;umte sich die arme Kreatur unter ihnen auf, als h&auml;tte man ihr einen Enterhaken in den R&uuml;cken gerammt und ihn zweimal umgedreht. Ihre Lippen formten einen stummen Schrei, mit den H&auml;nden schien sie zu versuchen, irgendetwas von ihrem Hals und ihrer Brust zu kratzen, wobei die Haut aufriss und Blut hervorquoll. Quinn und Aatrox wichen einen Schritt zur&uuml;ck.\r\n  Nami warf sich von einer Seite auf die andere, k&auml;mpfte mit etwas Unsichtbarem. Dann kam der geschundene K&ouml;rper zur Ruhe und blieb leblos auf dem Deck liegen. Der Haimann schnaubte und ging vor, um ihn sich n&auml;her anzuschauen. Er beugte sich &uuml;ber sie, h&ouml;rte weder ihren Atem, noch sah er Licht in ihren Augen. \r\n  Pl&ouml;tzlich packten ihn H&auml;nde an den Schultern, zogen ihn hinunter. Der Leichnam riss die Augen auf, das liebliche Gesicht hatte sich verdunkelt und sah eingefallen aus. Die Wangenknochen stachen scharf aus der Haut hervor, auf beiden Backen hatten sich blutige Kiemen tief in verfaultes Fleisch gefressen. Aus dem von spitzen Z&auml;hnen &uuml;bers&auml;ten Mund sch&auml;lte sich ein Schrei, der Mark und Knochen durchdrang und Quinn am ganzen Leib fr&ouml;steln lie&szlig;.\r\n  Aatrox konnte sich gerade noch aus den Klauen befreien und erschrocken zur&uuml;cktorkeln, bevor das untote Fischwesen ihm das Gesicht zerbei&szlig;en konnte. &ldquo;Die Graunacht!&rdquo;, schrie es stattdessen, mit einer Stimme, die sich wie mit Widerhaken bew&auml;hrt in den Kopf zu fressen drohte. &ldquo;Sie ist da! Der Nebel&hellip;&rdquo; Das Gesch&ouml;pf wand sich abermals wie unter h&ouml;llischen Qualen. Es drehte den schrecklichen Kopf zur Seite, sah Quinn aus leeren Augenh&ouml;hlen an. Dann grinste es sp&ouml;ttisch und fauchte: &ldquo;Der schwarze Nebel. Er hat euch hierher gef&uuml;hrt. Hat er euch einmal im Griff, l&auml;sst er euch nicht mehr los. Ihr seid der H&ouml;lle entkommen und segelt in eine viel schlimmere hinein. Sie hat euch! Nun ist es um euch geschehen. Betet, dass euer Tod schnell kommen m&ouml;ge! Spart euch den Widerstand, spart euch die Schmerzen.&rdquo; \r\n Mit einem letzten markersch&uuml;tternden Schrei verabschiedete sich das, was von Nami &uuml;briggeblieben war. Der K&ouml;rper l&ouml;ste sich in Asche auf, die vom Wind erfasst und &uuml;ber Bord geblasen wurde. Zur&uuml;ck blieb ein leeres Netz mit Algen und Schalentieren. Quinns Herz h&auml;mmerte in ihrer Brust, Aatrox stand wie erstarrt an Ort und Stelle.\r\n  \r\n  &ldquo;Was ist da unten los?&rdquo;, rief die unverkennbare Stimme Garens. Der Nebel hatte das Schiff verschluckt. Schwarz waberte es &uuml;ber die Holzplanken. Man konnte kaum noch zehn Fu&szlig; weit sehen. &ldquo;Ein&hellip; Zwischenfall&rdquo;, antworte Quinn, als sie die Sprache wiedergefunden hatte. Sie sp&auml;hte hin&uuml;ber zu ihrem Kameraden. In Aatrox&rsquo; Gesicht fand man keine Angst, nur Wut.\r\n  Weit &uuml;ber ihren K&ouml;pfen h&ouml;rte sie den Warnschrei ihres treuen Freundes. &ldquo;Valor&hellip;&rdquo;, murmelte sie und rannte an die Reling. Wie hatte der Nebel so schnell so dicht werden k&ouml;nnen? Wieso hatten sie nichts bemerkt? Um sie herum konnte man nicht einmal das Meer ausmachen. Nur vor der Malphite schien sich der der Dunst wie auf magische Art und Weise in einer geraden Linie aufzul&ouml;sen.\r\n  Valor landete kreischend oben auf dem Kr&auml;hennest. Der Zweimaster grummelte. &ldquo;Ich hasse es, wenn er das tut&rdquo;, brummte es tief aus dem Schiffsbauch. Dann stie&szlig; sich der Adler erneut ab und flatterte hinab auf ihre Schulter. Der majest&auml;tische Vogel nickte mit dem Schnabel in Fahrtrichtung. Quinn verstand sofort. Sie folgte seinem Blick und suchte angestrengt den verschleierten Horizont ab. Dann sah sie es. Inseln. Land und B&auml;ume, so grau wie der Nebel selbst und von ihm eingebettet wie in eine alte Ruhest&auml;tte.\r\n  &ldquo;K&auml;pt&rsquo;n&rdquo;, rief sie &uuml;ber die Schulter in Richtung Achtern. &ldquo;Das solltest du dir mal ansehen.&rdquo; \r\n  Garen lie&szlig; das Steuerrad los und schwang sich &uuml;ber das Gel&auml;nder des Achterdecks. Die Planken unter seinen Stiefel knarrten beim Aufprall vorwurfsvoll. Mit langen Schritten st&uuml;rmte er nach backbord und lehnte sich neben Quinn &uuml;ber die Reling um auf das Meer hinaussp&auml;hen zu k&ouml;nnen. &ldquo;Sieht so aus, als g&auml;b&rsquo;s nur einen Weg.&rdquo; Er grinste bitter. &ldquo;Das Freljord-Gebirge macht nicht einfach so vor der K&uuml;ste Halt. Wenn wir in diesen verfluchten Nebel reinfahren dauert es keine f&uuml;nf Minuten bis wir auf einen Felsen laufen. Dann d&uuml;rfen wir uns unseren letzten Schiffszwieback mitten im eisigen Meer mit den Haien teilen. Man kann ja nichtmal die eigene Hand vor Augen sehen, wie dann bitte ein Riff?&rdquo; Er schnaubte ver&auml;chtlich.\r\n  &ldquo;Also der Stra&szlig;e nach, die uns der Nebel zeigt? Zu diesen Inseln?&rdquo;, stellte Quinn fest. Valor kreischte auf ihrer Schulter.\r\n  Aatrox nickte zustimmend. &ldquo;Also der Stra&szlig;e nach.&rdquo;\r\n  Der K&auml;pt&rsquo;n drehte sich zu ihnen um. Er nickte grimmig.\r\n  Das Schiff unter ihnen st&ouml;hnte und gab grummelnde Ger&auml;usche von sich. \r\n  &ldquo;Keine Sorge, alter Freund.&rdquo; Garen legte beschwichtigend eine Hand auf Malphites Reling. &ldquo;Wir sind  zusammen schon durch ganz andere Gew&auml;sser gefahren&rdquo;, lachte er. &ldquo;Mir macht eher Sorgen, was uns auf diesen Inseln erwartet.&rdquo;  \r\n Mit einem Satz sprang er zur&uuml;ck auf das Achterdeck, auf dem Gesicht wieder dieses bittere Grinsen, das seit dem Tag, an dem er aus Demacia verbannt worden war, nicht mehr von seiner Seite gewichen war.\r\n\r\n  Der Sand knirschte unter ihren Stiefeln, als sie am Strand landeten. Schwarzer Dunst umwaberte ihre F&uuml;&szlig;e, zerrte an dem Korsarentrupp als wolle er an etwas in ihrem Inneren. Irgendetwas ist in diesem Nebel, erinnerte sich Quinn. Die Nebelschwaden schienen zu pulsieren, sie schienen zu leben. Und wie eine vereinte Kraft str&ouml;mten sie auf die Piraten zu, umh&uuml;llten sie, lie&szlig;en sie nicht mehr los. Sie musste an l&auml;ngst vergangene Jahre denken. Graun&auml;chte, die sie in Bilgewasser miterlebt hatte. Hatten die sich nicht auch immer durch einen solchen Nebel angek&uuml;ndigt? \r\n  Sie begann zu zittern. Valor wippte unruhig auf ihrer Schulter, Aatrox knurrte, Garen knirschte mit den Z&auml;hnen. Hinter ihnen erhob sich ein monstr&ouml;ses Konstrukt aus Planken, Segeln und Kanonen aus dem Meer. Wasser str&ouml;mte an Malphite hinunter, w&auml;hrend sich das Schiff unter lautem Get&ouml;se zusammenfaltete und zu einer menschen&auml;hnlichen Gestalt formte. Der Gigant aus Holz und Tauwerk trat hinter sie. Malphite brummte. &ldquo;Auf geht&rsquo;s&rdquo;, nickte Garen.\r\n  Die f&uuml;nf trotteten auf den Wald zu, ihre H&auml;nde ruhten auf den Waffen, bereit f&uuml;r das, was sie im Innern dieser Insel erwarten mochte. Alles um sie herum wirkte irgendwie tot. Kein Vogel, der zwitscherte, keine kleinen Tiere auf dem Boden. Die B&auml;ume sahen abgestorben und traurig aus, alles war grau und still und tot. Vielleicht lag das auch nur am Nebel. \r\n  Quinn meinte, Gestalten in ihm erkennen zu k&ouml;nnen, die mit kn&ouml;chernen Fingern nach ihr griffen. Entsetzen und Furcht zierte ihre Gesichter, Schreckensschreie ihre Lippen. Doch hinter den M&auml;ulern warteten spitze Z&auml;hne nur darauf, ein St&uuml;ck Fleisch zu fassen zu bekommen. In den leeren Augen sah sie Hunger, Hunger nach etwas Lebendigem. \r\n  Ein Schauer lief ihr &uuml;ber den R&uuml;cken. Immer enger zog sich der geisterhafte Nebel zu. Sie wandte ihren Blick von den schemenhaften Gestalten ab. Wo war ihre Crew? Sie fand sich allein mit Valor mitten in dem gespenstischen Wald wieder. &ldquo;Garen?&rdquo;, rief sie z&ouml;gerlich. &ldquo;Aatrox? Malphite?&rdquo; \r\n  Ein Ger&auml;usch. Sie fuhr herum. Durch den dunklen Schleier ersp&auml;hte sie den Admiral. Das Mondlicht spiegelte sich auf seiner riesigen, demacianischen Klinge. Er drehte sich im Kreis, in alle Richtungen gegen den mysteri&ouml;sen Nebel k&auml;mpfend. &ldquo;K&auml;pt&rsquo;n!&rdquo; Sie begann zu rennen, versuchte sich durchs Dickicht zu schlagen, in die Richtung zu gelangen, aus der sie die Ger&auml;usche vernahm. Valor stie&szlig; sich von ihrer Schulter ab und erhob sich mit einem Schrei in die L&uuml;fte.\r\n  Das Geh&ouml;lz wurde dichter, knochige &Auml;ste ragten auf wie Arme, die nach ihr greifen wollten. Dornen hingen von ihnen herab, wie F&auml;den schwarzen Blutes. Quinn blieb immer wieder h&auml;ngen und riss sich Kleidung und Haut auf. Dann tat sich der Wald pl&ouml;tzlich vor ihr auf und sie stolperte auf eine Lichtung, von der jegliches Leben gewichen war. Eine Felswand ragte schwarz und bedrohlich vor ihr auf. Hinter ihr versperrte eine Phalanx aus &Auml;sten und Gestr&uuml;pp den Weg zur&uuml;ck. Panisch wirbelte Quinn herum, suchte einen Ausweg.\r\n   Ein Kinderchor begann in ihrem Kopf ein Lied zu singen, ein altes, vergessenes Lied.\r\n  \r\n  &ldquo;Kling Klang machen die Ketten, jemand will dich finden&rdquo;\r\n\r\n  Die Korsarin hielt sich den Kopf, sch&uuml;ttelte ihn, versuchte die Melodie loszuwerden. \r\n  Derweil schob sich der Schatten einer jungen, sch&ouml;nen Frau auf den Felsen. Die Silhouette hatte lange Beine und eine wohlgeformte Taille. Als sie zu sprechen begann, war jeder Ton wie Nektar f&uuml;r die Ohren. S&uuml;&szlig; wie Honig umspielte sie das Geh&ouml;r, w&auml;hrend der Schatten mit den Fingern elegante Bewegungen vollf&uuml;hrte, als male sie ein Netz an die Wand.\r\n   &ldquo;Die Schatteninseln&hellip;ihr glaubt sie seien nur ein M&auml;rchen, das Gro&szlig;eltern ihren Enkeln in kalten N&auml;chten am Feuer erz&auml;hlen.&rdquo;\r\n  \r\n  &ldquo;Kling Klang machen die Ketten, der W&auml;chter ist schon hinter dir&rdquo;, ging das Lied aus dem Innern ihres Kopfes weiter.\r\n\r\n  &ldquo;Ich war da&rdquo;, fuhr die junge Frau fort. &ldquo;Und ich bin hier, seit vielen Jahren. Ein sch&ouml;ner Ort, findet ihr nicht? So sch&ouml;n, dass ich einmal im Jahr Besuch bekomme. Dieses Jahr seid ihr arme Seelen gekommen. Wie nett von euch.&rdquo; Das Lachen eines sch&uuml;chternen M&auml;dchens ert&ouml;nte aus allen Richtungen.\r\n  Dann verwandelte sich die h&uuml;bsche Silhouette in ein weitaus h&auml;sslicheres Wesen. Der Schatten einer riesigen Spinne huschte nun an der Felswand entlang. Haare waren auf den vielen Beinen zu erkennen. Hinter dem gro&szlig;en Unget&uuml;m wuselten unz&auml;hlige kleine Insekten.\r\n  Quinn vernahm das Tippeln undendlich vieler Gliedma&szlig;en auf ihrer linken Seite. Dann das Klacken auf dem Stein von rechts. \r\n\r\n  &ldquo;Schnell jetzt, du musst fliehen, die Ketten finden dich. \r\n   Halt nicht an, laufe weiter, du musst den Ketten entkommen.&rdquo; \r\n\r\n  Die Knabenstimmen wurden immer leiser, das letzte Wort war fast gefl&uuml;stert.\r\n  Blitzschnell drehte sich Quinn auf dem Absatz um und legte zwei Pfeile auf die Sehne. Sie sah nurnoch den Schatten, der auf sie zust&uuml;rzte, als sie in der selben Sekunde die Armbrust abfeuerte. Der Adler wurde einige Meter zur&uuml;ckgeworfen und an einen Baumstamm genagelt. Zwei Bolzen steckten ihm in der Brust, auf der an einigen Stellen die Federn ausgefallen waren. Darunter war verfaultes Fleisch aufgerissen worden, die Rippenknochen stachen scharf daraus hervor. \r\n  &ldquo;Valor!&rdquo; Verzweifelt lief die Sch&uuml;tzin zu ihm. Sie beugte sich &uuml;ber den schlaffen Leichnam. Kreischend schlug der Vogel mit den Fl&uuml;geln auf, riss Schnabel und Augen auf und hackte auf ihr Gesicht ein. \r\n  &ldquo;Ich bestehe darauf, meine G&auml;ste &uuml;ber Nacht da zu behalten&rdquo;, s&auml;uselte die Stimme der jungen Frau hinter ihr, w&auml;hrend Valor ihr das Fleisch aus den Wangen zupfte. Quinn wollte schreien, doch das letzte, was sie sah, waren Spinnenweben. Ein Kokon fesselte sie an ihren untoten Vogel.\r\n\r\n  \r\n_**  M**_it dem schwarzen Nebel lief in der Graunacht ein Schiff von den Schatteninseln aus. Die Crew war blass und eingefallen. Sie hielten Kurs auf Demacia. Doch Rache war ihr eigentliches Ziel. Die Rache der Toten an den Lebenden.","replies":[{"poster":"dugg","date":"2015-12-22T14:01:39.542+0000","up_votes":1,"down_votes":0,"body":"Oh je, wenn diese Geschichte nicht gewonnen hat... wie gut sind denn die Geschichten der Gewinner? Ich bin immer gespannter. =)\n\nDanke für deinen Beitrag.","replies":[{"poster":"Sanghul","date":"2015-12-22T23:49:42.843+0000","up_votes":1,"down_votes":0,"body":"Freut mich, das zu hören :)\nBis auf den Aspekt, dass es für mich trotzdem nicht gereicht hat natürlich^^","replies":[]}]},{"poster":"Flumbro","date":"2015-12-22T13:27:28.792+0000","up_votes":1,"down_votes":0,"body":"Find ich super :) Echt gut gelungen ^^","replies":[{"poster":"Sanghul","date":"2015-12-22T23:48:26.132+0000","up_votes":1,"down_votes":0,"body":"Dankeschön! :)","replies":[]}]}]}