{"poster":"Der Großmugister","date":"2015-09-21T17:10:46.166+0000","title":"Klärungsbedarf","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":1,"body":"Eigentlich sind die Verhaltensregeln in LoL denkbar einfach, &quot;Benimm dich nicht wie ein A**loch&quot; ist die Devise.\r\nDennoch denke ich, dass es viel Frust und vor Allem viele immer gleiche Forenbeitr&auml;ge sparen w&uuml;rde, wenn es mal einen verbindlichen &Uuml;berblick &uuml;ber m&ouml;gliche Strafen geben w&uuml;rde.\r\nDer Post &uuml;ber das &uuml;berarbeitete System f&uuml;r Chatbeschr&auml;nkungen war schonmal ein guter Anfang, allerdings habe ich lange daf&uuml;r gebraucht zu verstehen, dass die dort vermerkten Regeln eben nur f&uuml;r genau das gelten, f&uuml;r Beschr&auml;nkungen.\r\nDie vier Eskalationsstufen gelten nur f&uuml;r Vergehen, die unter die Rubrik CR/RR fallen. Es kann also durchaus passieren, dass man bereits nach dem ersten Vergehen, sollte es schlimm genug sein, gebannt wird.\r\n\r\nWeiterhin sind lange nicht alle Spieler im Forum aktiv, ich denke also es w&auml;re ganz gut, w&uuml;rde man das neue System als Vorwand nutzen, mal einen Informations-Post in den Launcher zu setzen.\r\nIn Diesem sollten neben Informationen &uuml;ber die Eskalationsstufen und der M&ouml;glichkeit zum sofortigen Bann, auch ein paar Infos &uuml;ber die Arbeitsweise des Instant-Feedback-Systems enthalten sein.\r\nIch habe beispielsweise vor meinem Forenbeitritt nicht gewusst, dass Aufrufe zum Report bestraft werden k&ouml;nnen. Mag sein, dass ich nur besonders dumm bin und das f&uuml;r normale Spieler selbstverst&auml;ndlich ist, aber vielleicht gibt es ja noch andere die so bl&ouml;d sind wie ich.\r\nAuch, dass die Chat-Analyse ein komplexes System mit vielen Feinheiten und nicht nur eine plumpe Worterkennung ist, musste ich erst einmal herausfinden.\r\n\r\nLeider habe ich keine Ahnung, ob ich hier auch nur die Chance habe Jemanden zu erreichen, der so Etwas verwirklichen k&ouml;nnte, aber versuchen kann man Es ja mal. :)","replies":[{"poster":"hshtagniemehrcdu","date":"2015-09-21T17:53:03.539+0000","up_votes":6,"down_votes":0,"body":"Also, was Riot noch machen könnte:\n\n-Erwähnten Link im Launcher\n-Hinweise im Ladebildschirm\n-Wenn jemand einen Bann erhält, sollte bei den Chatlogs ein Link zu den FAQ/Erklärungen sein\n\nWenn man im Launcher nicht schon mit Strafen \"\"\"drohen\"\"\" möchte, kann man es auch einfach nur bei Punkt 3 belassen; hier würde nur die betroffene Zielgruppe angesprochen.\n\nDie Information auf der Support-Website ist teilweise falsch.\nEin Spieler hat hier im Forum vor eiigen Wochen mal einen Link gepostet, wo noch immer von 1 Tage, 3 Tage Banns usw. gesprochen wurde.\nHier:\nhttps://support.riotgames.com/hc/de/articles/201752984\n\nDas sollte echt nicht sein; hier wird mit SIcherheit etwas \"falsch\" gemacht.\n\nZudem erweckt die Formulierung der Warnung bei Häufigen Reports deutlich den Eindruck, dass nur nach der Anzahl bestraft wird.\nHier mal ein Bild der Nachricht:\nhttp://www.baronbuff.de/sites/www.baronbuff.de/files/behavioralAlert4.png\nDort steht: Dein Verhalten weicht ab (als Tatsache formuliert).\nBegründung dieser \"\"\"Anklage\"\"\": Du wurdest häufig reportet.\nDas man hier sehr leicht ein falsches Bild erhalten kann, ist denke ich nachzuvollziehen.\nUnd wenn man sich informieren will, gibt es im Forum und der Support-Website unterschiedliche Angaben.\nDas kann man durchaus verbessern.\n\nEdit: Und zumindest in Ymirs Sticky steht schonmal nichts, was den nachvollziehbaren Schluss automatischer Reports/Simplen Wortfilters wiederlegt.\n\nEdit2: Auch im anderen Sticky-Thread wird die Funktionsweise der Chat-Analyse nicht erklärt.\nAuch im weiterführendem Link zum Instant-Feedbac System steht nichts darüber.\n\nDie Informationspolitik ist stark verbesserungsfähig.","replies":[{"poster":"Humpelstilzche","date":"2015-09-22T08:38:28.502+0000","up_votes":1,"down_votes":0,"body":"An Ymirs Post können wir vermutlich nichts ändern, an der Knowledgebase jedoch (vermutlich, no promises) schon. Wenn mir jemand übersichtlich zusammenfasst welche Textstellen nicht passen und warum, kann ich das weitergeben. \nIch muss jedoch dazu sagen, dass ich das in einer so präzisen und übersichtlichen Form brauche, dass ich es ohne große Überarbeitung direkt weitergeben kann, da ich momentan leider nicht so viel Zeit für solche Dinge habe :(","replies":[]},{"poster":"Phobos Selini","date":"2015-09-21T21:11:55.322+0000","up_votes":1,"down_votes":0,"body":"Dem stimme ich in allen Punkten zu. Vor allem die Supportseite muss dringend besser gepflegt werden.","replies":[]}]},{"poster":"Haudruppmoor","date":"2015-09-22T07:38:19.311+0000","up_votes":1,"down_votes":0,"body":"Die Idee ist gut, kriegt nen Upvote. Wird aber vrmtl. nicht den erhofften Effekt haben. \n\nIch will ja jetzt nicht Schwarzmalen ... aber äh ... die Bereitschaft sich vorher zu informieren ist hier doch sehr gering. Es kommen immer wieder dieselben Threads hoch mit denselben Inhalt. Wie Ruaga und Sirrkas schon geschrieben haben, da kann der Infothread oben angepinnt sein und trotzdem kommen Post's die genau dazu Fragen stellen bzw. wo die Leute es wieder einmal nicht verstanden haben obwohl es weiter oben lang und breit erklärt wird. \n\nErinnert mich an das Handbuchproblem. Da wird ein techn. Gerät gekauft und sofort wird losgelegt es zu benutzen. Erst wenn man nach tagelangem Probieren nicht mehr weiterkommt wird ein Blick in das Handbuch geworfen. \n\nOk, man könnte dann einfach in den neu erstellten Frage-Threads immer wieder den Link zum Erklärthread posten , spart man sich halt Schreibarbeit.\n\nIs wie das Problem mit den \"Warum krieg ich in mein Team nur Idioten\" oder \"Unfaires Matchmaking\"  wo dann eben die Rechnung mit der Teamzusammenstellung gepostet wird . Die könnte man auch mal sticky machen da Beschwerden zum Matchmaking auch immer wieder kommen, obwohl ein Thread weiter unten die Thematik schon durchgekaut wurde.\n\nDie Info's in dem Launcher unterzubringen find ich jetzt net schlecht. Kann man vlcht. als \"Tipp des Tages\" in ein modalem Fenster einblenden. Jedesmal wenn man in den Hauptschirm/Startschirm wechselt kann man kurz gefasst immer mal wieder eine Regel einblenden. Ich mein , Werbung oder Events werden da ja auch angezeigt .\n\nmfg\nMB","replies":[{"poster":"hshtagniemehrcdu","date":"2015-09-22T07:51:36.623+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Haudruppmoor,realm=EUW,application-id=KYnfKGf0,discussion-id=vcsK6QfL,comment-id=0004,timestamp=2015-09-22T07:38:19.311+0000)\n>\n> Die Idee ist gut, kriegt nen Upvote. Wird aber vrmtl. nicht den erhofften Effekt haben. \n> \n> Ich will ja jetzt nicht Schwarzmalen ... aber äh ... die Bereitschaft sich vorher zu informieren ist hier doch sehr gering. \n> mfg\n> MB\n\nUnd woran genau machst du das fest?\nAn der Anzahl der QQ Threads?\n\nDie Leute, welche sich nicht informieren, erstellen diese Threads, dass kann man also \"messen\".\nDie Leute, die diese Stickys durchlesen, erstellen keinen Thread mehr zu einer beantworteten Frage, dass kann man also nicht abschätzen.\n\nAußerdem: Wo in den in diesem Forum angepinnten Stickkys steht etwas über eine  Chatanalyse, welche erklärt, dass das Programm mehr als nur ein simpler Wortfilter ist?\nIn keinem der 3 Stickys.\n\nAlso: Unabhängig von der Bereitschaft, sich zu informieren, ist das nicht einfach....","replies":[{"poster":"Haudruppmoor","date":"2015-09-22T09:21:57.820+0000","up_votes":2,"down_votes":1,"body":"p.s.:\nWas heißt eigentlich QQ-Thread ? Ich mein wofür steht das QQ ?\n\nmfg\nMB","replies":[{"poster":"Sirrkas","date":"2015-09-23T10:50:29.373+0000","up_votes":4,"down_votes":0,"body":"Ich habe mal gelesen, dass es ursprünglich aus Starcraft kommt, bei dem der Shortcut vor das Verlassen des Spiels 2 mal Q enthielt. Glaube sowas wie STRG halten + Q + Q. Wurde scheinbar öfter an den Gegner als \"why you don´t simply QQ?\" geschrieben, wenn der ein offensichtlich verlorenes Spiel noch nicht aufgeben wollte. Aber inzwischen wird es von der Allgemeinheit als weinende Augen angesehen. Ich finde das eigentlich auch passender.\n\nEdit: Anscheinend war es also mit Alt. Hier der Beitrag aus dem [Urban Dictionary](http://de.urbandictionary.com/define.php?term=QQ).","replies":[{"poster":"Der Großmugister","date":"2015-09-23T11:26:16.278+0000","up_votes":3,"down_votes":0,"body":"The more you know, das war mir widerrum neu^^","replies":[{"poster":"Haudruppmoor","date":"2015-09-23T11:35:00.752+0000","up_votes":2,"down_votes":0,"body":"Mir auch, und ich hab gerne und viel Starcraft gespielt, allerdings nur die Solokampagne . Tsss, was man hier so alles mitnimmt :D\n\nbtw. dieses QQ liest man halt und nimmt des eben so hin, macht sich normalerweise keine Gedanken drum . Hab es für mich persönlich eben als \"**Q**uengel - **Q**uengel\" übersetzt. Quasi die Steigerung von quengeln oder rumnörgeln. An emoticon hab ich da jetzt net gedacht und weil Eleandor317 des so explizit schrieb hab ich so gemerkt \"Ich weißt gar nicht wirklich was QQ bedeutet\" , nuja und hab halt gefragt. Wollte jetzt net trollen oder so :/\n\nDanke nochmal für die Aufklärung :D\n\nmfg\nMB","replies":[]}]}]},{"poster":"Der Großmugister","date":"2015-09-22T09:28:26.829+0000","up_votes":4,"down_votes":0,"body":"Es sieht zwei Augen mit kleinen Tränchen ähnlich^^","replies":[{"poster":"Haudruppmoor","date":"2015-09-22T09:30:20.728+0000","up_votes":3,"down_votes":0,"body":"Ach  Heulthread  ...\n\nhttp://double.facepalm.de/images/facepalm.jpg\n\n... ich geh in mich und bleib da !\n\nmfg\nMB","replies":[]}]}]},{"poster":"Haudruppmoor","date":"2015-09-22T08:33:51.547+0000","up_votes":1,"down_votes":0,"body":"> An der Anzahl der QQ Threads?\n\nZum Beispiel. Es sollte auch nicht abwertend klingen. Wenn es sich so las, dann Entschuldigung dafür. Ist meine persönl. Meinung dazu. Jmnd. der sich vorher informiert hat mit ziemlicher Sicherheit weniger Fragen, sofern das was er sich durchliest seine Fragen beantwortet.\n\n> Die Leute, welche sich nicht informieren, erstellen diese Threads,\n\nIst meine Meinung, ja. Bin halt nen Pessimist ;)\n\n\n>ass kann man also \"messen\".\n\nDAS hast Du behauptet. Ich messe hier gar nichts, ich habe etwas festgestellt und habe meine Meinung dazu geäussert. \n\n> ußerdem: Wo in den in diesem Forum angepinnten Stickkys steht etwas über eine Chatanalyse, welche erklärt, dass das Programm mehr als nur ein simpler Wortfilter ist?\nIn keinem der 3 Stickys.\n\nHab nix dazu geschrieben, hab ich nicht behauptet. Wenn Du eben aufmerksam gelesen hättest, hättest Du bemerkt, daß ich mich recht allgemein gehalten hab ,oder etwa nicht ? \n\n\n> Also: Unabhängig von der Bereitschaft, sich zu informieren, ist das nicht einfach....\n\nDas stell ich auch nicht in Abrede. Aber gerade was das Matchmaking z.B. anging kamen da schonmal 4 Threads in Folge die alle das Gleiche behandelten, die gleichen Fragen und gleiche Antworten hatten. Das war weder ne Verurteilung, noch eine Messung sondern lediglich eine Feststellung. Man könnte ja auch vorher ein bischen im Forum stöbern, bevor man einen neuen Thread aufmacht. Könnte man, muß man aber nicht.\n\nDem TE geht es doch darum , soweit ich das Verstanden hab, Informationen besser an den Mann/Frau zu bringen, oder etwa nicht ? Und deshalb fand ich die Idee sowas nicht nur im Forum zu machen, weil eben sehr viel nicht hier unterwegs sind, sondern Ingame im Launcher z.B. sehr gut. Das war so meine eigentlich Kernaussage. Alles andere davor waren persönliche Eindrücke/Erfahrungen . Weder repräsentativ noch objektiv.\n\nmfg\nMB","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2015-09-22T08:49:22.115+0000","up_votes":3,"down_votes":0,"body":"Es wäre zwar durchaus positiv, wenn mehr Spieler mehr über die PB Systeme wüssten, aber es ist leider nicht so leicht. \n\nLoL ist ein riesiges Spiel und die Menge der Dinge, die (selbst wenn man das Spiel selbst außer Acht lässt) gut zu wissen wären, ist gewaltig.\n\n* Es wäre gut wenn die Leute wüssten, dass bei einem DC auch dann nicht Riot schuld sein muss, wenn Youtube noch funktioniert\n* Es wäre gut wenn die Leute wüssten, dass ein Spiel das durch einen Drophack beendet wird, meist nicht von einem Spieler in besagtem Spiel verursacht wurde, da immer gleich ganze Gameserver angegriffen werden, nicht einzelne Spiele\n* Es wäre gut wenn die Leute wüssten, welche Bedeutung die Winratio eigentlich hat\n* Es wäre gut wenn die Leute wüssten was Elo ist\n* Es wäre gut wenn die Leute wüssten wie das Ligen-System und die Verteilung von LP funktioniert\n* ....\n\nDie Liste könnte ewig weiter gehen und ich könnte vermutlich stundenlang über Dinge erzählen, die LoL und die Community verbessern würden, wenn mehr Leute davon wüssten. Informationen über die PB-Systeme sind nur eins von vielen Dingen.\n\nDas Problem daran ist: Das ist für den durschnittlichen Spieler, ja sogar für die meisten hardcore-Spieler, schlicht und einfach zu viel. So gut wie alle Spieler wollen einfach nur das Spiel spielen und haben keinerlei Anlass sich für diese Dinge zu interessieren, bis es sie direkt betrifft. Diese Spieler wären, zu Recht, genervt wenn Riot sie ständig mit Infos über irgendwas bombardieren würde was zwar theoretisch \"nice to know\" ist, aber für das Spiel an sich völlig irrelevant ist. Und selbst wenn Riot das tun würde, also zum Beispiel bei jedem mal Einloggen ein langer Info-Text über irgendwas erscheint, kann kein Mensch die Leute zwingen das zu lesen oder es gar zu erinnern. Es ist schlicht und einfach zu viel.","replies":[{"poster":"Haudruppmoor","date":"2015-09-22T08:59:12.373+0000","up_votes":2,"down_votes":0,"body":"Ja, ok, so gesehen hast Du da recht. Vlcht. muß man in der Informationsflut den Rotstift ansetzen :/ . \n\nOder eben nur allgemeine Sachen anbringen, wie z.B. das ein Permabann überhaupt möglich ist. Hier war doch mal ein Thread, wo einer einen Permabann kassiert hat und sich dann laaang und breit damit entschuldigt hat derjenige nicht wußte, daß ein Permabann möglich ist. Wenn er/sie es gewußt hätte, dann hätte er/sie sich anders verhalten. Oder Kurzinfos ala \"Grundlose Reports werden nicht berücksichtigt\" oder so ähnlich. \n\nbtw. bevor mich jmnd. fragt, wo man Infos kürzen sollte: Ich weiß es nicht. \n\nEdit:\nAls ich anfing zu spielen wußte ich noch nix von Schimpfwörtern im Chat. Ich wär auch nie auf die Idee zu kommen da sowas reinzuschreiben. Zugemüllt hab ich ihn aber trotzdem mit Witzchen und Scherzchen. Kam auch nicht immer gut an. \n\nAls ich mal Warwick im Jungle gespielt hab und Firstblood war schrieb einer rein \"Report Warwick\" , ich dann so \"ok\" - \"I go in Jungle\" - \"i go on toplane\" \"i go base\" ... ich nahm an \"Report\" wär jetzt so das ich immer mein aktuellen Status reporten soll. Quasi alles was ich mache/machen will in den Chat schreiben soll.  Hab da doch nicht an das Reportsystem für negative Spieler gedacht. Ich wußte schlichtweg nix von dem System. \n\nmfg\nMB\n\n","replies":[]}]},{"poster":"SoloQisMentlBoom","date":"2015-09-21T17:56:13.548+0000","up_votes":3,"down_votes":0,"body":"Das ist das Gleiche wie mit dem (deutschen) Gesetz. Es ist zwar da, jeder weiß davon, aber niemand informiert sich, obwohl darin alles beantwortet wird (vielleicht etwas komplexer aber denoch).\nIch denke nicht, dass es hier anders laufen würde. Die Leute lesen einfach ungern. Vor allem nicht Dinge, die sie selbst nicht betreffen. Du kannst 10.000 Posts übers Permabannen machen. Solange derjenige noch nicht betroffen ist, wird er es wahrscheinlich nicht lesen. Wenn er es dann ist, ist es sowieso zu spät.","replies":[]},{"poster":"eingew","date":"2015-09-21T17:12:51.981+0000","up_votes":2,"down_votes":0,"body":"Ist alles schon in den News gewesen und es gibt sehr ausführliche FAQs zu jedem Thema auf der Supportwebsite... ich weiß nicht, ob Riot da wirklich so viel falsch macht...","replies":[{"poster":"Der Großmugister","date":"2015-09-21T17:25:11.520+0000","up_votes":2,"down_votes":0,"body":"Ich denke nicht, dass Riot wirklich was falsch macht, ich denke nur, die Tatsache, dass bei vielen Spielern so viel Unklarheit darüber herrscht (sonst würden nicht immer wieder die gleichen Fragen auftauchen) lässt durchaus den Gedanken zu, Etwas verbessern zu wollen. \nSollte es tatsächlich schonmal solche Infos, außerhalb der Patchnotes und des Forums gegeben haben, hab ich sie wohl übersehen, was sehr deutlich aussagen würde, dass mein Vorschlag doch nicht so Sinnvoll ist.^^","replies":[{"poster":"Sirrkas","date":"2015-09-21T18:16:09.527+0000","up_votes":2,"down_votes":0,"body":"Solche Fragen wird es immer geben. Ich sehe auch beim Forum zu einem Spiel im Steamhub immer wieder die Frage, was in der Collectorsedition enthalten ist. Der Thread dazu ist gleich auf der ersten Seite des Steamhubs angepinnt und fast genau neben \"Diskussion öffnen\".","replies":[]}]}]},{"poster":"PlanetenPlatzer","date":"2015-09-21T17:38:01.829+0000","up_votes":1,"down_votes":0,"body":"Naja das Forum besteht aus folgenden Spielern:\n\nLeute, die nur ein einziges Mal ins Forum kommen, das falsche Unterforum auswählen, sich über irgendwas aufregen und dann nicht wissen wie man auf einen Kommentar antwortet und deswegen einen neuen Kommentar erstellen.\nLeute, die meistens Müll schreiben und andere eigentlich nur nerven (da gehöre ich dazu).\nLeute, die über etwas völlig Anderes diskutieren.\nLeute, die die Frage nicht verstehen.\nLeute, die viel zu viel Text schreiben, den man sich unmöglich durchlesen kann.\nUnd die, die immer niveauvoll antworten.\n\nGibt noch mehr, aber bei mir fängt gerade das nächste Spiel an..","replies":[]}]}