{"poster":"Der Großmugister","date":"2016-01-27T17:30:33.754+0000","title":"Das ist alles nur in deinem Kopf","subforum":"Ligen & gewertete Spiele","up_votes":5,"down_votes":0,"body":"Wie wir ja mittlerweile bemerkt haben, wurde die Ligawertung durch die Einstufungsspiele, allgemein verringert.\r\nDas bedeutet, dass JEDER schlechter eingeordnet wurde, als er zu Anfang von Season 5 , mit der gleichen MMR platziert worden w&auml;re.\r\n\r\nDamit sind wir auch schon beim Knackpunkt angelangt, denn wenn JEDER schlechter bewertet wurde, wurde im Endeffekt NIEMAND schlechter bewertet.\r\nDie vermeindliche Ungerechtigkeit besteht nur in eurem Kopf, da ihr die Ligen &agrave;&acute;la Bronze, Silber, Gold, etc. nun schon recht lange als feste Einheit gesehen habt.\r\nDas ist aber einfach nicht richtig!\r\nDie Ligen erhalten ihren Stellenwert einzig und allein dadurch, wie schwer sie zu erreichen sind und diese Schwierigkeit hat nun eben einen k&uuml;nstlichen Schubser erhalten.\r\nGrob gesagt ist das was in S5 Platin1 war, nun Gold1, was Silber 2 war, ist nun Bronze 2.\r\n\r\nH&auml;tte man nur Einzelne nach diesem neune Ma&szlig; gemessen, w&auml;re es nat&uuml;rlich unfair, aber wir wurden ALLE strenger bewertet, im Endeffekt hei&szlig;t das, dass alles gleich bleibt, nur unter anderem Namen.\r\nIm Laufe der Season wird das immer mehr Leuten klar werden und zu Anfang der n&auml;chsten Preseason, ist dann der Platin-Rahmen das gleiche Statussymbol  wie es nun der Diamant-Rahmen ist.\r\n\r\nLasst euch also nicht von eurer eigenen Warnehmung t&auml;uschen, alles in Allem hat sich nur die Farbe eures Rahmens ver&auml;ndert, die Spieler die ihr treffen werdet, sowohl Gegner als auch Mitspieler, sind noch immer die Selben.\r\n\r\nStellt euch einfach vor, Jedem Menschen, jeder Regierung und jedem Unternehmen, w&uuml;rden von einem Moment auf den Anderen, 50% ihrer Verm&ouml;genswerte abgenommen, ohne sie wieder in den Wirtschaftskreislauf einzuf&uuml;hren.\r\nEs w&uuml;rde sich Nichts ver&auml;ndern, Jeder w&auml;re noch genauso reich oder arm wie vorher, da kleinere Geldsummen, einen entsprechend h&ouml;heren Wert h&auml;tten.\r\n\r\nKurz gesagt, es gab eine fl&auml;chendeckende Ligen-Deflation, nicht Mehr und nicht Weniger, alles andere spielt sich nur in euren K&ouml;pfen ab.","replies":[{"poster":"FDG DragonSlayer","date":"2016-01-29T06:07:45.876+0000","up_votes":1,"down_votes":0,"body":"Das stimmt nicht... Ich Platin 4 8 g 2 v Silver 1 n Kollege Platin 5 4g 6 v Gold 2 und kommt mir jetzt nicht mit Seine mir war gut, das war sie nämlich nicht.","replies":[{"poster":"Der Großmugister","date":"2016-01-29T13:07:48.336+0000","up_votes":1,"down_votes":0,"body":"Das konnte schon damals passieren, es geht bei den Placements nicht um die reine Anzahl der Siege, im Stickypost in diesem Forenabschnitt findest du mehr Infos darüber.\n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[]}]},{"poster":"sN00Bdogg","date":"2016-01-27T18:12:29.101+0000","up_votes":1,"down_votes":0,"body":"**Das ist alles nur in deinem Kopf**\n\nDas stimmt nicht ganz. Allerdings bekommt jeder Spieler zum Saisonwechsel eine \"neue\" ELO. Top-Spieler werden gedrückt, Bronze+Silber-Spieler werden angehoben.\nDadurch wirds nicht langweilig, weil sich jeder im Saison-Verlauf erstmal wieder in seine alte Klasse hineispielen muss. \n\nDaß die meisten zu diesem frühen Zeitpunkt tiefer aus den Placements rauskommen als sie letzte Saison waren, liegt einzig und allein am dahinter liegenden mathematischen Algorythmus des ELO-Systems.\n\nIch hab das hier mit eigenen Worten erklärt:\n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/nQJwFWL2-placement-matches?comment=0001\n\nHab dann später auch noch nen Forumsbeitrag gefunden, in dem  ein RIOT-Mitarbeiter das ganze genauso bestätigt hat und sogar mit genauen Zahlenangaben dabei. Leider weiss ich nichts mehr bzgl. Überschrift / Unterforum / Name","replies":[{"poster":"Der Großmugister","date":"2016-01-27T18:31:32.869+0000","up_votes":1,"down_votes":0,"body":"Dieses System hat aber eindeutig neue Werte bekommen, dadurch spricht es nicht gegen Das, was ich in meinem Beitrag erwähnt habe.\nIm Endeffekt, sprichst du ein komplett anderes Thema an so wie ich das sehe.","replies":[{"poster":"sN00Bdogg","date":"2016-01-27T19:30:29.088+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=ip27PlEH,discussion-id=91vaAYAK,comment-id=00010000,timestamp=2016-01-27T18:31:32.869+0000)\n>\n> Dieses System hat aber eindeutig neue Werte bekommen, dadurch spricht es nicht gegen Das, was ich in meinem Beitrag erwähnt habe.\n> Im Endeffekt, sprichst du ein komplett anderes Thema an so wie ich das sehe.\n\nDu hast Recht. Ich hab mich da selbst verwirrt und Mist geschrieben. Und jetzt nachträglich meinen Post oben verbessert.","replies":[{"poster":"Der Großmugister","date":"2016-01-27T20:02:11.724+0000","up_votes":1,"down_votes":0,"body":"Passiert mir auch gerne mal^^","replies":[]}]}]}]},{"poster":"sN00Bdogg","date":"2016-01-27T18:21:25.339+0000","up_votes":1,"down_votes":0,"body":"Heureka!\n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[]},{"poster":"MeMyselfandBaal","date":"2016-01-27T17:49:30.108+0000","up_votes":1,"down_votes":0,"body":"solange Riot auch die Belohnungen anpasst und allen Leuten in Silber den Siegreichen Skin zuweist...\n\nUnd ja, der eine oder andere spielt Ranked wegen der Belohnung. Und wenn Silber jetzt das neue Platin ist, führt das auch nur dazu, dass diese Belohnungen für 90% der Spieler unerreichbar bleiben...\n\nDeswegen bin ich ja so verwirrt über diesen so harten Reset: Riot schadet sich damit selbst. Denn es werden Spieler nur deswegen die Lust auf LoL verlieren. Das Spiel deinstallieren und zu Dota2 wechseln, da ihre Freunde ihnen sagen, dass das Spiel so einen Scheiß nicht mit ihnen macht.\n\nBisher ist Riot da eigentlich immer eine andere Politik gefahren... also dass es einfacher ist, Auf- als Abzusteigen... weil sie die Frustrationsmomente alt reduzieren wollten.","replies":[{"poster":"Der Großmugister","date":"2016-01-27T17:57:11.168+0000","up_votes":1,"down_votes":0,"body":"Ja...ich fürchte da könntest du Recht haben, einen Gefallen getan hat sich Riot wahrscheinlich nicht, wenn da nicht noch was kommt.\nZumindest eine Erklärung hätte kommen sollen.","replies":[]}]}]}