{"poster":"xxCheatsrichter","date":"2015-04-27T20:31:41.483+0000","title":"dolch des zauberdiebs vs. dorans ring","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Moin, \r\nin letzter zeit habe ich &ouml;fter den supportgegenstand dolch des zauberdiebs Als first item auf der midlane ausprobiert. Ich finde es da sogar ziemlich stark, durch den passiven goldverdienst. Ausserdem ist es g&uuml;nstig und man kann sich direkt noch ein ward + potts oder mehr potts kaufen. \r\nWas haltet ihr davon?\r\n\r\n\r\n\r\nDolch des Zauberdiebs \r\nGold 365\r\n\r\n+5 F&auml;higkeitsst&auml;rke\r\n+2 Gold alle 10 Sekunden\r\n+25 % Grundwert f&uuml;r Manaregeneration \r\n\r\nEINMALIG, Passiv - Tribut:\r\nF&auml;higkeiten und normale Angriffe gegen Champions oder Strukturen verursachen 10 zus&auml;tzlichen Schaden und gew&auml;hren 5 Gold. Dies kann alle 30 Sekunden bis zu dreimal passieren. Durch das T&ouml;ten eines Vasallen wird dieser passive Effekt 12 Sekunden lang deaktiviert.\r\n\r\n\r\nDorans Ring\r\nGold 400\r\n\r\n+60 Leben\r\n+15 F&auml;higkeitsst&auml;rke\r\n+3 Manaregeneration per 5 Sekunden\r\n\r\nPassiv: Todesst&ouml;&szlig;e an Einheiten stellen 4 Mana wieder her.","replies":[{"poster":"Imb4lanced","date":"2015-04-28T16:20:55.842+0000","up_votes":2,"down_votes":0,"body":"Keine HP was 150gold statts entspricht, 10 weniger ap was 250goldwert statts entspricht. dann die sp reg beim lasthitten ist enorm wichtig. Nicht umsonnst kaufen viele progamer ab und zu sogar 3 dorans um die lane durch sp sustain zu snowballen.  \n\nIst nur für anfänger die nicht lasthitten können und doof traden dadurch mehr tränke brauchen. Sonnst verliert es extrem an statts. du musst in 30 sekunden 6 minions lasthitten als midlaner. sprich alle 5 sekunden 1 minion. passive von dem gold item reagiert erst nach 12 sekunden nicht lasthitten. Dabei kann man als midlaner mit dem blue buff auch jungle nehmen und da ist dorans wieder besser. \n\nGlaube muss man nicht drüber reden. Haben andere schonmal angesprochen und es ist einfach kacke)))","replies":[]},{"poster":"MetaBunny","date":"2015-04-27T21:22:24.486+0000","up_votes":2,"down_votes":0,"body":"Ohne die passive ist der Gegenstand fast nutzlos, und diese funktioniert mid nicht, ausser man lasthittet sowieso nicht, aber dann würde ich am lasthitten arbeiten..","replies":[]},{"poster":"Derrish","date":"2015-04-27T20:46:23.455+0000","up_votes":2,"down_votes":0,"body":"Dorans ist schon stärker, weil du die Passive des Zauberdiebs nicht auspielen kannst. Wenn es zu einem frühen Fight auf der Lane kommt, bist du mit Dorans einfach besser dran.\nAber wenn du besser damit klar kommst, spiel es einfach. Sei die aber bewusst das es nicht das effizienteste sein wird.","replies":[]},{"poster":"Bergelmir32","date":"2015-04-28T02:38:43.546+0000","up_votes":1,"down_votes":4,"body":"[Suchfunktion!](http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/GAWyGWsF-dolch-des-zauberdiebs-startitem-midlane)","replies":[]}]}