{"poster":"Mugman Rojo","date":"2017-11-23T22:19:46.689+0000","title":"Como le gano a un asesino en mid?","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"tengo 22 armadura y el asesino tiene 32 resistencia magica y 30 armadura y tiene mas vida que yo\r\nel asesino tiene habilidades que atraviesan subditos y de gap closer\r\n\r\nel asesino tambien tiene un mini sorbehechizos","replies":[{"poster":"Hell Darking","date":"2017-11-23T23:30:02.163+0000","up_votes":2,"down_votes":0,"body":"no jugando mid y jugando top\n\nBest advice ever","replies":[]},{"poster":"Nisman on bush","date":"2017-11-23T22:26:46.196+0000","up_votes":2,"down_votes":1,"body":"depende que asesino sea y que champ uses, pero por lo general se lleva exausth y se los pokea para no dejarlos farmear bien y tenerlos con por lo menos la mitad de vida para que no hagan roaming  y si lo hacen q sea con vida baja con riesgo de morir, eso si, siempre bien posicionado y sin comerte agro de los minions y jugar safe","replies":[]},{"poster":"Danshid","date":"2017-11-24T01:24:05.408+0000","up_votes":1,"down_votes":0,"body":"Farmear hasta late donde en tf el decae, haste zonias, suele hacer counter a todos los asesinos (y ahora que esta el reloj de 600 es mas fácil aún) y mantente pokeandolo y evita su burst\n\nTambién, si pickean antes que tu saca un mago safe (malzha es lo mejor con su r, su escudo y además de que tiene uno de los mejor winrates de mis)","replies":[]},{"poster":"iZac","date":"2017-11-23T23:36:14.275+0000","up_votes":1,"down_votes":0,"body":"Nada es verdad, Todo esta permitido.","replies":[]},{"poster":"MILFortune","date":"2017-11-23T22:25:29.834+0000","up_votes":1,"down_votes":0,"body":"Hay campeones que son fuertes al principio y débiles luego, comparados con otros campeones. Farmea hasta que dispongas de tu kit de habilidades y no busques activamente matarlo","replies":[{"poster":"Nisman on bush","date":"2017-11-23T22:29:09.660+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MILFortune,realm=LAS,application-id=v7qsfXsE,discussion-id=4ZZbgQV4,comment-id=0000,timestamp=2017-11-23T22:25:29.834+0000)\n>\n> Hay campeones que son fuertes al principio y débiles luego, compara con otros campeones. Farema hasta qeu dispongas de tu kit de habilidades y no busques activamente matarlo\n\nclaro, hay q farmear, ganar la linea vs un asesino es : que no te mate y pokearlo para que este low hp o al menos 50% y evitar su roaming pero siempre jugando seguro bien posicionado","replies":[]}]},{"poster":"El Impostor","date":"2017-11-23T22:47:32.060+0000","up_votes":1,"down_votes":2,"body":"Rompiendo su nexo.\n\n\n/r/koreanadvice","replies":[]}]}