{"poster":"Mugman Rojo","date":"2018-12-17T01:32:18.879+0000","title":"PETICION: Mantener el precio de los RP, pero bajar el precio de todo lo que cuesta RP en LAS","subforum":"Charlas Generales","up_votes":44,"down_votes":10,"body":"a ver, Tenemos 3 posibles razones del aumento del RP\nRazón 1: Aumento del dolar en argentina\nRazón 2: Rito quiere $$$\nRazón 3: un inteligente de EUW dijo que te puedes hacer una cuenta en LAS comprar rp mas barato y cambiarte al servidor de tu cuenta original y regalarle skins. (link borrado porque puede ser Witch Hunting)\ny mi idea es\n\nBajar todos los costos de RP, Ya sea skins, paginas de runas, campeones, skins de wards, pases, iconos, etc.\nDe este modo:\n\n* Pueden seguir manteniendo los precios actuales del RP, q ya de por si son algo caros.\n* No se puedan hacer trucos de comprar rp barato.\n* Las ofertas la tienen solo las cuentas originarias de LAS (si tu cuenta es extranjera no habrá oferta)\n* Podras Comprar skins a menor precio. Todas!","replies":[{"poster":"Excorpion","date":"2018-12-17T01:40:38.361+0000","up_votes":28,"down_votes":5,"body":"Y tu crees que a Riot le importa que tan pobre somos en LAS ?","replies":[{"poster":"Cabo xD","date":"2018-12-17T03:09:29.370+0000","up_votes":4,"down_votes":3,"body":"Espero que se de tremenda baja en la demanda de RP en LAS, así rito sufre un poquito y se da cuenta, no solo el precio es alto (aunque este en U$D), si no que tenemos que pagar un 21% extra (ty gatito).\n\nAunque en parte me siento confundido al decir/pensar que si bien en todo el mundo esta así el precio, en esta zona, y en este momento la mayoría de los users no se pueden permitir esos precios.","replies":[{"poster":"bombastico","date":"2018-12-17T17:04:10.525+0000","up_votes":2,"down_votes":2,"body":"¿Desde cuando uno, al no tener dinero para gastar en lujos, le pide a las empresas que bajen sus precios?","replies":[{"poster":"Draconis","date":"2018-12-17T18:25:56.401+0000","up_votes":5,"down_votes":1,"body":"No le pide, deja de comprar y los fuerza a bajar precios .","replies":[{"poster":"EXzZed","date":"2018-12-17T22:52:12.607+0000","up_votes":4,"down_votes":1,"body":"tremendo turn down for wath le hiciste","replies":[]},{"poster":"bombastico","date":"2018-12-18T02:59:13.477+0000","up_votes":1,"down_votes":0,"body":"Lo mismo decian de los dlc y mira como está la industria.","replies":[{"poster":"Draconis","date":"2018-12-18T18:30:17.533+0000","up_votes":1,"down_votes":0,"body":"Mira como esta BF5 o Fallout 76, tuvieron que tomar un kilo de medidas y aun asi por ambicion, perdieron mas de lo que ganaron a largo plazo.","replies":[]}]}]},{"poster":"Hombre Venenoso","date":"2018-12-18T00:23:07.184+0000","up_votes":2,"down_votes":0,"body":"el tema es que en esto riot no pierde \"materia prima\" por cada skin que vende, mas bien se trata de ver hasta que precio podes llegar sin hacer que la gente deje de comprar","replies":[]}]}]}]},{"poster":"iNGENiO","date":"2018-12-17T02:39:26.703+0000","up_votes":13,"down_votes":1,"body":"A riot games no le importa cuanto pagamos el RP en LAS.\n\nSi les importara no lo hubieran dolarizado para Argentina.\n\nClaramente no les interesamos.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2018-12-17T10:44:51.944+0000","up_votes":3,"down_votes":1,"body":"A mi me sorprende que todavía haya gente que tenga dudas","replies":[]}]},{"poster":"AC Wolf","date":"2018-12-17T03:46:06.229+0000","up_votes":8,"down_votes":0,"body":"Mmm la solución desde mi Punto de vista es que riot considere dejar un precio fijo en pesos argentinos como método de pago en efectivo, uno no tan elevado como el actual, pero si parecido al anterior.\n\nArgentina es el único país (por lo que he visto) que no conserva su moneda como método de pago nacional.\n\nSi les soy sinceró actualmente me saldría más barato comprar RP desde una página de 3ros desde Chile (utilizando el método nacional de Chile) que comprando desde argentina.\n\n**Esto no es un incentivó a las páginas de 3ros ya que son muy peligrosas y en su mayoría estafan, pero si es una crítica a riot y su nueva implementación de precios.**","replies":[{"poster":"AC Wolf","date":"2018-12-17T03:55:30.985+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AC Wolf,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=0009,timestamp=2018-12-17T03:46:06.229+0000)\n>\n> Mmm la solución desde mi Punto de vista es que riot considere dejar un precio fijo en pesos argentinos como método de pago en efectivo, uno no tan elevado como el actual, pero si parecido al anterior.\n> \n> Argentina es el único país (por lo que he visto) que no conserva su moneda como método de pago nacional.\n> \n> Si les soy sinceró actualmente me saldría más barato comprar RP desde una página de 3ros desde Chile (utilizando el método nacional de Chile) que comprando desde argentina.\n> \n> **Esto no es un incentivó a las páginas de 3ros ya que son muy peligrosas y en su mayoría estafan, pero si es una crítica a riot y su nueva implementación de precios.**\n\n(Es la solución que propongo por el caso número 3)","replies":[]}]},{"poster":"Rayito","date":"2018-12-17T16:44:08.397+0000","up_votes":4,"down_votes":0,"body":"no les compren mas nada, hace tiempo que yo no lo hago y mira que tengo como 200 skin de cuando me gustaba comprar cajas. Pero sigue pasando el tiempo y el server es una mierda, esta lleno de flamers, afks, ect y aparte ponen el rp en dolares? pudiendo tener mercados localizados? piensan que tenemos el nivel de vida igual que en yankilandia.\n\nCon lo que sale una skin de 1350 me compro JUEGASOS en steam. No regalen su plata aunque sea poca, densela a un desarrollador que se la merezca y la necesite.","replies":[{"poster":"Danimilz","date":"2018-12-17T23:42:00.595+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]},{"poster":"Mazoku","date":"2018-12-17T19:25:03.427+0000","up_votes":1,"down_votes":3,"body":"No entiendo quienes fueron los \"inteligentes\" que le dieron +1 a este hilo.\n\nA fin de cuentas es lo mismo que duplicar el costo del transfer.\n\n-1 btw","replies":[{"poster":"Mugman Rojo","date":"2018-12-18T01:39:35.959+0000","up_votes":4,"down_votes":0,"body":"https://i.kym-cdn.com/photos/images/facebook/001/019/905/89e.png","replies":[{"poster":"Mazoku","date":"2018-12-18T11:49:56.606+0000","up_votes":1,"down_votes":2,"body":"Esta buena la imagen porque flowey trata de engañar a la persona pero al final no puede. Como en este caso, vos siendo flowey y yo el jugador.\n\nGracias por darme la razon.\n\n+1 al comentario.","replies":[{"poster":"Mugman Rojo","date":"2018-12-19T01:02:21.166+0000","up_votes":1,"down_votes":1,"body":"Este es un AU en el que el flowey intenta advertirle que el RP va aumentar mas y mas, pero el jugador no lo escucha.\n\nY tu lo dijiste, yo soy flowey y tu el jugador\n(Aunque viniendo de ti, no me sorprendería nada que respondieras este comentario)","replies":[{"poster":"Mazoku","date":"2018-12-19T02:20:03.879+0000","up_votes":1,"down_votes":1,"body":"> Este es un AU en el que el flowey intenta advertirle que el RP va aumentar mas y mas, pero el jugador no lo escucha.\n\nNo entendiste la historia de undertale.\n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Mugman Rojo","date":"2018-12-19T02:39:42.692+0000","up_votes":1,"down_votes":1,"body":"No entendiste mi comentario\n{{sticker:zombie-brand-facepalm}} \n\n[](http://Ahyveoquecitastemicomentarioporfavornolorespondas)","replies":[{"poster":"Mazoku","date":"2018-12-19T02:59:49.285+0000","up_votes":1,"down_votes":1,"body":"Si, entendi que quisiste usar una imagen y te salio el tiro por la culata. Para negar eso, te hiciste el que no entendiste la historia del juego jaja","replies":[{"poster":"Mugman Rojo","date":"2018-12-19T03:49:37.288+0000","up_votes":1,"down_votes":1,"body":"Es un universo alterno creado por mi, yo solo conozco la historia de ese universo.","replies":[]}]}]}]}]}]}]}]},{"poster":"MexicanoPromedio","date":"2018-12-17T16:51:07.499+0000","up_votes":3,"down_votes":0,"body":"Solucion: solo podes comprar a precio argentina si estas en argentina.","replies":[{"poster":"bombastico","date":"2018-12-17T17:05:43.387+0000","up_votes":1,"down_votes":0,"body":"Pero los demás países también queremos RP barato :c","replies":[{"poster":"SBL Nightel","date":"2018-12-18T01:48:23.640+0000","up_votes":2,"down_votes":0,"body":"Pero para nosotros no es barato, por mas que nuestra moneda este devaluada nuestro sueldo/ingreso tambien se devalua. Sinceramente a este precio sentis que estas tirando plata a la basura.","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2018-12-17T12:11:24.457+0000","up_votes":3,"down_votes":0,"body":"No veo posible algo asi, se perderia todo el sistema de precios xd\n\nCada servidor tiene cierta autonomia igual, rusia sigue con el programa de referidos para ganar cajas hextech, Turkia tiene el doble de skins en oferta, y existen otros eventos o mini torneos para premios.\n---------\n\n¿Quizas tener un mejor bonus de Rp y que el Rp no se transfiera entre servidores?\n\nSi te sobra Rp puedes comprarte las cosas antes del cambio.\n\nO habilitar la transferencia desde el nivel 20, dudo que alguien suba 20 niveles para ahorrarse algo de dinero","replies":[]},{"poster":"Zindro","date":"2018-12-17T02:08:18.811+0000","up_votes":4,"down_votes":1,"body":"Si cambiaron la probabilidad de aparición de gemas para China (quien sabe la razón) no es imposible esta idea. (80 gemas una skin hextech?)","replies":[{"poster":"Draconis","date":"2018-12-17T18:37:36.405+0000","up_votes":1,"down_votes":0,"body":"China es la region mas grande de LOL, no pueden perderla, a diferencia de LAS que es un agregado pequeño, nisiqueira es importante dentro de las regiones pequeñas, por que el dinero de Latinoamerica, viene de Brazil realmente.","replies":[]},{"poster":"TapateLasPatitas","date":"2018-12-17T02:45:40.080+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zindro,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=0003,timestamp=2018-12-17T02:08:18.811+0000)\n>\n> Si cambiaron la probabilidad de aparición de gemas para China (quien sabe la razón) no es imposible esta idea. (80 gemas una skin hextech?)\n\nEn China es ilegal el gambling, muchos juegos gacha aumentan sus rates e incluso aseguran premios para evitar problemas porque en China es ilegal apostar y los gacha entran en categoría de gambling para China, por eso suben rates c: Por si te sirve de algo.\n\n\nEjemplo en un juego tipo gacha, una unidad tiene 10% de salir y en China es 100% seguro que sale después de un limitado numero de invocaciones.","replies":[]}]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-12-17T02:31:13.696+0000","up_votes":5,"down_votes":2,"body":"Si todo muy lindo pero rito solo lo haría si observa una baja considerable en la compra de RP de LAS\n**Muy buena idea por cierto**","replies":[]},{"poster":"TvTLucio22","date":"2018-12-17T02:43:56.354+0000","up_votes":5,"down_votes":13,"body":"...\n\nno solo es una de las ideas mas estupidas que he visto en mucho tiempo, sino que carece de sentido total. la razon?\n1. no conviene modificar los valores de un unico server, ya que puede atraer muchisimos mas problemas\n2. el \"aumento\" del rp (que en realidad es una actualizacion del precio) es unicamente para argentina, segun vos que tan justo seria que a los demas tambien les bajen el precio de los skins? y como, exactamente, gana algo riot con eso?\n3. vos decis \"cuenta originaria\", pero hay muchos pelotudos como yo, que venimos de na. nosotros que hacemos? miramos y aplaudimos como pelotudos? dale... genial...\n4. el super truco, dicho en el foro por un chileno, era que cambiabas el pais de pago y les salia mas barato comprar como argentino, ni siquiera era necesario cambiar de server...\n5. la culpa no la tiene riot, ya que ellos no devaluaron el peso para que pase de estar 1 dolar = 20 pesos a 1 dolar =40 en una semana. ellos no se pueden hacer cargo de la economia de cada pais... y esperarlo es superar la pelotudez extrema\n6. como dijo uno antes, por que tienen que vender su laburo mas barato? si bien es digital, hacer las cosas lleva su tiempo, su gente y sus sueldos...\n7. decis que riot quiere plata como si fuese algo malo y/o nuevo... es una empresa, pibe, siempre busca generar ganancias (y si no, no venderia skins)\n8. tooooooooooooodo este quilombo, para que al final absolutamente todo lo que compras con rp, es unicamente estetico y/o se puede conseguir gratuitamente (lease, be o coso hextech), so...","replies":[{"poster":"Hayato","date":"2018-12-17T18:53:42.511+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=0006,timestamp=2018-12-17T02:43:56.354+0000)\n>\n> ...\n> \n> no solo es una de las ideas mas estupidas que he visto en mucho tiempo, sino que carece de sentido total. la razon?\n> 1. no conviene modificar los valores de un unico server, ya que puede atraer muchisimos mas problemas\n> 2. el &quot;aumento&quot; del rp (que en realidad es una actualizacion del precio) es unicamente para argentina, segun vos que tan justo seria que a los demas tambien les bajen el precio de los skins? y como, exactamente, gana algo riot con eso?\n> 3. vos decis &quot;cuenta originaria&quot;, pero hay muchos pelotudos como yo, que venimos de na. nosotros que hacemos? miramos y aplaudimos como pelotudos? dale... genial...\n> 4. el super truco, dicho en el foro por un chileno, era que cambiabas el pais de pago y les salia mas barato comprar como argentino, ni siquiera era necesario cambiar de server...\n> 5. la culpa no la tiene riot, ya que ellos no devaluaron el peso para que pase de estar 1 dolar = 20 pesos a 1 dolar =40 en una semana. ellos no se pueden hacer cargo de la economia de cada pais... y esperarlo es superar la pelotudez extrema\n> 6. como dijo uno antes, por que tienen que vender su laburo mas barato? si bien es digital, hacer las cosas lleva su tiempo, su gente y sus sueldos...\n> 7. decis que riot quiere plata como si fuese algo malo y/o nuevo... es una empresa, pibe, siempre busca generar ganancias (y si no, no venderia skins)\n> 8. tooooooooooooodo este quilombo, para que al final absolutamente todo lo que compras con rp, es unicamente estetico y/o se puede conseguir gratuitamente (lease, be o coso hextech), so...\n\nTodo de acuerdo pero... sabias que hay una solución que Riot puede implementar pero no lo hará (porque es una empresa china ahora), supongo conoces Valve y su tienda Steam y a Blizzard, no?\n\nEllos tienen precios según país y región respectivamente, sus tiendas esta bloqueadas y nadie que no pertenezca al país o la región puede comprar en esas tiendas digitales.\n\nPondré como ejemplo a Steam, en Argentina los precios son mucho mas bajos que en otros países pero solo pueden comprar con esos precios en Argentina, ni los chilenos, ni los uruguayos, ni nadie de otro país puede aprovecharlos ya que si lo intentan les aparece un mensaje indicando que no pueden hacerlo y que la compra no se efectuará, ni siquiera yo siendo Argentino puedo regalarle un juego a alguien de otro país (lo intenté y el sistema no me dejó)\n\nSI Riot hiciera eso, podría poner precios acordes, razonables, terrenales a cada país o región y todos felices. Pero son chinos... olvidate que lo hagan.\n\nSobre el sistema Hextech, es un sistema muy tramposo ya que suelen tocar mas fragmentos de campeones que de aspecto, el sitema debería detectar que tenés todos los campeones y solo tirarte fragmento de aspectos, y encima cuando te los tira.. suelen ser de aspectos que ya tenés. Suponiendo que te tiró un aspecto que no tenés, el costo en esencia naranja y la poca cantidad que te dan al desencantar fragmento de aspectos hace que sea muy lento conseguir canjear el aspecto deseado, estuve cerca de 8 meses juntando esencia naranja para un aspecto de 1350, por lo que dije \"Basta!\", ahora cada tres fragmentos de aspecto los mando a la licuadora y que me toque lo sea.","replies":[{"poster":"TvTLucio22","date":"2018-12-18T00:35:14.533+0000","up_votes":1,"down_votes":1,"body":"Ta perfecto el ejemplo (bah, steam, a blizzard deje de tener idea hace tiempo), sólo que para mi, pese a que riot tuviese el juego más jugado del mundo en su momento (no se si sigue siendolo), riot es una empresa mucho menor que esas 2. Pensalo bien: riot tiene 1 juego, vs 2 compañías con múltiples juegos hiper conocidos Y una plataforma destinada a venderlos (en el caso de steam, no sólo los suyos)","replies":[{"poster":"Hayato","date":"2018-12-18T03:39:27.147+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=000600010000,timestamp=2018-12-18T00:35:14.533+0000)\n>\n> Ta perfecto el ejemplo (bah, steam, a blizzard deje de tener idea hace tiempo), sólo que para mi, pese a que riot tuviese el juego más jugado del mundo en su momento (no se si sigue siendolo), riot es una empresa mucho menor que esas 2. Pensalo bien: riot tiene 1 juego, vs 2 compañías con múltiples juegos hiper conocidos Y una plataforma destinada a venderlos (en el caso de steam, no sólo los suyos)\n\nAcá encontré el articulo https://www.hd-tecnologia.com/league-of-legends-sigue-siendo-mas-popular-que-fortnite-y-dota-2-en-2018/","replies":[]},{"poster":"Hayato","date":"2018-12-18T03:29:47.901+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=000600010000,timestamp=2018-12-18T00:35:14.533+0000)\n>\n> Ta perfecto el ejemplo (bah, steam, a blizzard deje de tener idea hace tiempo), sólo que para mi, pese a que riot tuviese el juego más jugado del mundo en su momento (no se si sigue siendolo), riot es una empresa mucho menor que esas 2. Pensalo bien: riot tiene 1 juego, vs 2 compañías con múltiples juegos hiper conocidos Y una plataforma destinada a venderlos (en el caso de steam, no sólo los suyos)\n\nRiot no es una empresa pequeña ni mucho menos como steam o blizzard (de hecho blizzard esta en decadencia ya que quito personal de heroes y cancelo varios torneos para el 2019) y actualmente a día de hoy League of Legends lidera el puesto de mas jugado, por encima de fornite. (estoy buscando le articulo donde lo leí pero no recuerdo la página)","replies":[{"poster":"TvTLucio22","date":"2018-12-18T04:18:52.601+0000","up_votes":1,"down_votes":1,"body":"ta perfecto, pero igualmente riot tiene 1 juego nomas, es obvio que no puede tener las politicas de otras empresas que tienen varios juegos, una plataforma propia, dlc's y la venta de juegos de terceros (para el caso de steam). igualmente, esa solucion seria la mejor, pero quedaria en mas o menos lo mismo que ahora si dolarifica el precio de los rp (cosa que es lo que pasa ahora, te dicen el costo en dolares y abajo cuantos pesos terminas pagando)","replies":[{"poster":"Hayato","date":"2018-12-18T15:03:07.372+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=00060001000000000000,timestamp=2018-12-18T04:18:52.601+0000)\n>\n> ta perfecto, pero igualmente riot tiene 1 juego nomas, es obvio que no puede tener las politicas de otras empresas que tienen varios juegos, una plataforma propia, dlc&#x27;s y la venta de juegos de terceros (para el caso de steam). igualmente, esa solucion seria la mejor, pero quedaria en mas o menos lo mismo que ahora si dolarifica el precio de los rp (cosa que es lo que pasa ahora, te dicen el costo en dolares y abajo cuantos pesos terminas pagando)\n\nNo tiene nada que ver la cantidad de juegos, Riot actualmente es una de las empresas (sino la que mas) factura, recordá que el dinero viene de publicidad, torneos, contenido (que sería el equivalente al DLC), venta de merchanding físico, entre otras cosas.\n\nSteam y Blizzard venden en moneda local, Riot puede hacer lo mismo, no necesita ponerlo en dolares. Eso es un capricho, te repito son chinos y como tales no les importan ciertos mercados.\n\nDe hecho no me extrañaría que en poco tiempo cierren los servidores latinos, fijate que van apuntando hacia eso con todas las medidas que toman. Sin contar que tengo algo de info que no puedo revelar porque así me lo pidieron.","replies":[{"poster":"TvTLucio22","date":"2018-12-18T15:36:59.958+0000","up_votes":1,"down_votes":0,"body":"> recordá que el dinero viene de publicidad, torneos, contenido (que sería el equivalente al DLC), venta de merchanding físico, entre otras cosas.\n\nok:\n\n* la publicidad les es un costo, ya que seria un beneficio si fuese un juego pago, como cualquiera de blizzard o steam (por seguir con tus ejemplos\n\n* torneos, no se si los participantes tienen que pagar un minimo para participar, pero supongamos que si, seria lo mas \"logico\" (y lo pongo entre comillas por que, por el tamaño del evento en si, no se si seria alto taaaaaaaaaan logico)\n\n* contenido no es totalmente equivalente al dlc, ya que estos pueden ser de distintas cosas (personajes, misiones, extension de alguna forma del juego) mientras que lo de riot es unicamente estetico. literalmente no cambia en nada el comprarlo o no (dicho sea de paso, lo podes obtener gratis)\n\n* el merchanding (creo que falta alguna letra ahi, pero no tengo ganas de buscar) fisico esta bastante limitado. por lo general es a NA y a algun lugar donde se haga un torneo importante de lol (como cuando hacen los oficiales para mandar al ganador vs los ganadores de los demas paises de la region)\n\n> no necesita ponerlo en dolares\n\nes chistoso, pero no es exactamente eso lo que paso. esta el precio en dolares, pero abajo figura cuantos pesos pagas (que, a final de cuentas, seguis pagando en pesos). la unica diferencia es que el precio varia dependiendo del dolar oficial, que depende principalmente de las politicas del gobierno argentino. o sea, lo que hizo riot fue un \"bueno, las politicas del gobierno que votaron mandaron a la mierda su moneda, pero no es nuestra culpa. aca esta lo que cuesta nuestro laburo, si lo pueden pagar bien por ustedes, total damos cosas gratis para quien no pueda\", y realmente no  puedo pensar que estan mal...\n\n> Sin contar que tengo algo de info que no puedo revelar porque así me lo pidieron.\n\nooooooooooooooohh, señor con info cofidencial... por algo, no me creo esa ultima parte... probablemente tenga que vere con tantos casos onda richi phelps...","replies":[{"poster":"Hayato","date":"2018-12-18T17:54:31.279+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=0006000100000000000000000000,timestamp=2018-12-18T15:36:59.958+0000)\n>\n> ok:\n> \n> * la publicidad les es un costo, ya que seria un beneficio si fuese un juego pago, como cualquiera de blizzard o steam (por seguir con tus ejemplos\n> \n> * torneos, no se si los participantes tienen que pagar un minimo para participar, pero supongamos que si, seria lo mas &quot;logico&quot; (y lo pongo entre comillas por que, por el tamaño del evento en si, no se si seria alto taaaaaaaaaan logico)\n> \n> * contenido no es totalmente equivalente al dlc, ya que estos pueden ser de distintas cosas (personajes, misiones, extension de alguna forma del juego) mientras que lo de riot es unicamente estetico. literalmente no cambia en nada el comprarlo o no (dicho sea de paso, lo podes obtener gratis)\n> \n> * el merchanding (creo que falta alguna letra ahi, pero no tengo ganas de buscar) fisico esta bastante limitado. por lo general es a NA y a algun lugar donde se haga un torneo importante de lol (como cuando hacen los oficiales para mandar al ganador vs los ganadores de los demas paises de la region)\n> \n> es chistoso, pero no es exactamente eso lo que paso. esta el precio en dolares, pero abajo figura cuantos pesos pagas (que, a final de cuentas, seguis pagando en pesos). la unica diferencia es que el precio varia dependiendo del dolar oficial, que depende principalmente de las politicas del gobierno argentino. o sea, lo que hizo riot fue un &quot;bueno, las politicas del gobierno que votaron mandaron a la mierda su moneda, pero no es nuestra culpa. aca esta lo que cuesta nuestro laburo, si lo pueden pagar bien por ustedes, total damos cosas gratis para quien no pueda&quot;, y realmente no  puedo pensar que estan mal...\n> \n> ooooooooooooooohh, señor con info cofidencial... por algo, no me creo esa ultima parte... probablemente tenga que vere con tantos casos onda richi phelps...\n\nLa publicidad la cobra Riot, te doy otro ejemplo. En el horario que está Showmatch todas las tandas publicitarias y toda la publicidad se la pagan a Tinelli y pagan muchísimo. Lo mismo ocurre con Riot, toda la publicidad que hay en sus torneos es pagada a Riot y no al revés.\n\nLos torneos se pagan solos básicamente derivado del punto anterior, sabias que Riot factura más como eSports que por contenido en RP?\n\nEl contenido es totalmente equivalente al DLC, no hay vuelta a eso. EL DLC es contenido adicional descargable que no tiene porque ser P2W, ni limitarse a los contenidos que vos mencionaste. Dead or ALive 5 tiene mucho DLC y es unicamente cosmético. StarCraft II tiene DLC que incluye contenido cosmético y te puedo seguir la lista eternamente de jeugos co nDLC cosmético. Lo que si puedo concederte es que no es \"descargable\"\n\nEl merchandising es poco pero existe.\n\nYo sé que el problema es por los gobiernos que ha tenido Argentina, no obstante si deseas vender un producto en un mercado, sabés que tenes que ajustarte a su mercado, no tu mercado al del lugar de venta. Sino simplemente no tendrás ventas y será perdida. Que es lo que eventualmente le pasará con Argentina, si bien los otros paises le aportarán ganacias una gran parte no lo hará. \n\nSobre lo ultimo que puse, Riot está haciendo muchos cambios que no son favorables para latinoamerica, que eventualmente terminará en lo que le está ocurriendo a Heroes of the Storm por los cambios que ha realizado Blizzard en la región, similares a los que está haciendo ahora Riot y sinceramente no me importa si me crees o no. El tiempo dirá si sigue LoL en Latinoamerica, después de todo no seria el primer juego que cierra un servidor o lo reestructura por no dar ganancias.\n\nMuy lindo el debate pero me cansé, no responderé más después de este mensaje, de todas formas sentite libre de responderlo pero te aviso que ni lo leeré.\n\nSaludos","replies":[{"poster":"TvTLucio22","date":"2018-12-18T21:51:27.996+0000","up_votes":1,"down_votes":0,"body":"...\n\nHoy, en \"me voy y me llevo la pelota\"...","replies":[]}]}]}]}]}]}]}]},{"poster":"Del0reaN","date":"2018-12-17T09:33:40.739+0000","up_votes":1,"down_votes":3,"body":"¡Hola pa!\nNo creo que sea tan así como exponés.\n\n1- Me gustaría saber qué problemas. No entiendo tu punto.\n2- Actualización de precios, aumento... es lo mismo. En fin, el \"problema\" que acarrea es el mismo.\n3- No entiendo por qué usar insultos para algo tan simple: en NA el poder adquisitivo que se tiene con 5 dólares no es el mismo que en Argentina. Por ende, lo que pagas en LAS \"duele más\", por decirlo de una manera sencilla. Esto se traduce en menos ventas. Te pongo un ejemplo: en Estados Unidos, con 5 dólares comprás poco menos de 2kg de pan. En Argentina comprás casi 4kg. Pero... el salario MÍNIMO en Estados Unidos es de u$S1.256,70. Cambialo a pesos argentinos y te da la módica suma de $48.759,96 (con el valor de intercambio actual). En Argentina el salario mínimo no se acerca ni de casualidad a esa suma.\n4- No habla de ese \"super truco\", sino de un estudio que hicieron sobre cómo engañar a Riot para comprar muchísimo más barato. Te paso el link por si te interesa, aunque ya no aplica como antes: https://boards.euw.leagueoflegends.com/es/c/miscelanea-es/05R0GU1L-riot-responde-a-la-forma-de-conseguir-mas-rp-por-menos-dinero-precio-de-rp-en-euw-vs-otros-servido?show=flat\n5- Nadie espera que Riot se haga cargo de la economía del país. El tipo pidió que bajen los precios de las cosas en LoL, no pidió que recuperen los impuestos a la minería o que le aumenten las AUH. =P\n6- Muchas veces es vender más barato para tener más ganancia. A veces, una pequeña fluctuación en los precios te puede causar pérdidas gigantes a una empresa. En realidad, no es que Riot gane más dinero con estos cambios de precio tan abruptos, simplemente les da igual perder unos dólares en una región en la cual el movimiento de dinero no es la gran cosa. LAS no es de las que más compran. Es una realidad.\n7- Concuerdo totalmente. Es una empresa, quiere dinero porque así se mantienen, pero difiero en lo último (siempre busca generar ganancias). En este caso, generó pérdidas. Pérdidas menores, por supuesto, pero pérdidas en sí. Perdió muchísima gente que, posiblemente, recupere con el tiempo en la medida que se acostumbren a los nuevos precios, pero no le convenía tener usuarios que abusen de esa diferencia por la imagen que generaba frente a los usuarios.\n8- Si es simplemente por algo estético, ¿cuál sería el problema del reclamo? Pobre pibe, dejalo que sea feliz reclamando por lo que a él le parece bien. Está en todo su derecho, así como vos estás en el tuyo de exponer lo que escribiste. ;)\n\nUn abrazo.","replies":[{"poster":"TvTLucio22","date":"2018-12-17T17:26:52.245+0000","up_votes":1,"down_votes":2,"body":"Todo lo que decís está perfecto, salvo por un pequeño detalle: Argentina es quien se está hundiendo gracias a nuestras políticas, no las ni el mundo. Es por eso que, si le bajan el precio de rp, se hace exactamente lo mismo por lo que se subió en un principio: es injusto a nivel Server (antes era local, con ese cambio sería entre Servers). \n\nPoniéndolo simple, dijeron que aumentaron el precio del rp en arg porque era más barato (en dolares) que en el resto de la región (lo que es cierto) y que es injusto para los otros países (de nuevo, cierto). Modificando el costo de los rp como quiere el op, se vuelve injusto para los otros servers E injusto para la arg ya que, como decis, no tenemos el mismo poder adquisitivo.  De vuelta pregunto: donde ven la justicia de precio en eso?","replies":[{"poster":"Del0reaN","date":"2018-12-17T18:27:58.175+0000","up_votes":2,"down_votes":0,"body":"Jajajaja. Te respondería, pero... Ni Riot va a bajar los precios, ni vos vas a cambiar de opinión. Básicamente, vamos a seguir redundando en lo mismo que ya dijimos.\n\nUn abrazo.","replies":[]}]}]},{"poster":"Draconis","date":"2018-12-18T00:19:14.144+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=0006,timestamp=2018-12-17T02:43:56.354+0000)\n>\n\n> 2. el &quot;aumento&quot; del rp (que en realidad es una actualizacion del precio) es unicamente para argentina, segun vos que tan justo seria que a los demas tambien les bajen el precio de los skins? y como, exactamente, gana algo riot con eso?\n\nSeguro eres de esos genios que piensa que si llega y por que si le sube el precio a algo 1000 veces mas se va a hacer millonario","replies":[{"poster":"Hayato","date":"2018-12-18T17:56:09.055+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Busoshoku,realm=LAS,application-id=v7qsfXsE,discussion-id=r7Es5sv8,comment-id=00060002,timestamp=2018-12-18T00:19:14.144+0000)\n>\n> Seguro eres de esos genios que piensa que si llega y por que si le sube el precio a algo 1000 veces mas se va a hacer millonario\n\nNo tiene mucho sentido que discutas seriamente en este foro, la mayoría son \"adultos\" de 13 - 16 años, yo traté de darles ejemplos y explicaciones y te siguen insistiendo con la misma boludez","replies":[]}]}]},{"poster":"Tsukuyomi100","date":"2018-12-18T01:49:31.452+0000","up_votes":2,"down_votes":0,"body":"Ahora hace una encuesta y peticion de que te regalen RP gratis {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"AMD Radeon RDNA","date":"2018-12-17T01:42:31.126+0000","up_votes":3,"down_votes":5,"body":"Claro que si campeon, van a bajar el precio de su trabajo.","replies":[{"poster":"Ren Rojo","date":"2018-12-17T02:24:08.985+0000","up_votes":6,"down_votes":5,"body":"jajaja, lo decís como si Riot fuese un señor que vende películas pirateadas en la calle xD Pobres Rioters, no vaya a ser cosa que se queden en la calle y no puedan seguir viviendo en sus mansiones lujosas {{item:3070}}","replies":[{"poster":"TvTLucio22","date":"2018-12-17T02:36:08.867+0000","up_votes":3,"down_votes":5,"body":"sabes todo el trabajo que lleva hacer un skin decente? estamos hablando del concep art, la idea detallada, el modelado, las particulas, los sonidos, la revision de como queda todo en conjunto (que, si no queda bien, hay que retocarlo o volverlo a hacer de 0, dependiendo de que tan bien o mal haya quedado), publicidad (lease, skin trailer) y su lanzamiento correcto a nivel mundial. \n\nsi eso no te parece que merezca un precio justo y que no se mueva, no se que queres...","replies":[{"poster":"1997TDA","date":"2018-12-17T03:44:13.817+0000","up_votes":2,"down_votes":1,"body":"El otro día estuve hablando con Jenifer, una de las artistas que trabajó en el diseño de Neeko y me decía que les tomo algo de 4 meses hacerlo y la verdad yo como artista igual entiendo lo que cuesta hacer una ilustración, un diseño y todo eso \nAcá el perfil de la artista  Neeko - League of Legends\nhttps://artstn.co/p/XB1bVR\nJennifer Wuestling\nIllustrator - Riot Games\n--\nShare via Artstation Android App, Artstation © 2018","replies":[]}]}]}]}]}