{"poster":"Mugman Rojo","date":"2019-08-04T19:23:36.486+0000","title":"Esto es reportable?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":6,"body":"https://i.imgur.com/FJVcgPS.png&amp;noredirect\r\n\r\nQue baneen tu campeon, cuando ya hiciste pre-pick Y sos primer pick. asi que no te lo pueden robar...","replies":[{"poster":"xaxesis","date":"2019-08-04T19:27:04.515+0000","up_votes":3,"down_votes":0,"body":"No es sancionable, todos son libres de banear canpeones a libertad asi esten preseleccionados...\n\nEsa es la respuesta oficial de soporte","replies":[{"poster":"Monserrat tu sup","date":"2019-08-04T20:23:26.748+0000","up_votes":1,"down_votes":1,"body":"en que parte del soporte dice eso?","replies":[{"poster":"xaxesis","date":"2019-08-04T20:26:31.780+0000","up_votes":1,"down_votes":0,"body":"Vas a soporte de riot games sacas ticket y en preguntas frecuentes ahi te enteras las respuestas oficiales y si buscas en foro hasta post de lo mismo encuentras.","replies":[]}]},{"poster":"LéonKaiser","date":"2019-08-04T19:36:52.147+0000","up_votes":1,"down_votes":3,"body":"De hecho, necesitas 20 campeones para poder jugar rankeds por si se da el raro raro raro caso de que aunque baneen 10 pj que tengas y pickeen 9 que también tengas, sigas teniendo algo en lo que jugar.\n\nEvidentemente no es muy deportivo y la gente que hace eso... en fin. Pero no es sancionable. \n\nA mi a veces me lo echan en cara, tiendo a hacer autoban de Yasuo en todos los games, y a veces alguien lo prepickea, no lo veo o no me doy cuenta ~~(o le miro el historial)~~, y lo baneo sin querer.","replies":[{"poster":"xaxesis","date":"2019-08-04T19:53:38.893+0000","up_votes":1,"down_votes":0,"body":"Y?","replies":[]}]}]},{"poster":"I Love KaiSa","date":"2019-08-04T20:19:45.615+0000","up_votes":2,"down_votes":0,"body":"No.","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-08-04T20:21:12.691+0000","up_votes":3,"down_votes":1,"body":"Puedes reportar todo lo que no te agrade, el sistema ya se encarga de interpretar.","replies":[]},{"poster":"Ghoperef","date":"2019-08-04T22:15:41.581+0000","up_votes":1,"down_votes":0,"body":"mmm realmente todos como players que somos tenemos malas experiencies con gente jugando ciertos campeones en nuestro team.\n\nPor ejemplo para mi tener una katarina mid o un ezreal adc es casi que me digan que voy a perder. Si ya me como una racha de derrotas y alguien pickea katarina, puedo optar a veces por banearla y evitarme el problema. O el tipo se tiltea o dodgea.","replies":[{"poster":"Vaaš","date":"2019-08-05T01:52:28.640+0000","up_votes":1,"down_votes":0,"body":"> una katarina mid... es casi que me digan que voy a perder.\n\nUuuff x2 que \"recuerdos\" je como odio ese champ.","replies":[]}]}]}