{"poster":"Plummo","date":"2019-02-02T12:18:28.649+0000","title":"Help with streaming in obs","subforum":"Streams & Videos","up_votes":2,"down_votes":0,"body":"Id like some help to set up my stream. Just give me your suggestions and I will try them out, based on my stats just let me know what you think works best with my setup. Here&#039;s my pc specs and my internet speed. \r\n\r\nProcessor: i5 8400\r\nVideo card: Nvidia Geforce GTX 1050\r\nRam: 8 GB\r\n\r\nhttps://www.speedtest.net/my-result/a/4653506202","replies":[{"poster":"Plummo","date":"2019-02-02T12:29:37.656+0000","up_votes":1,"down_votes":0,"body":"I also forgot to mention, my base resolution is 1600x900. And i have googled this and ran my own tests but I haven't found a good setup that looks smooth and clear when moving around  in game. Which is my main issue here. Its not terrible but its also not good. I know i wont get 1080p quality but I would like it better than it is now. My current setup in obs is 720p, 264x encoding, 3500 bitrate and 60fps. I was wondering if 60 fps is maybe my issue. I am able to stream overwatch perfectly fine with these settings, in fact I can use NVENC and get even better quality, but league seems to be weird with it. I have no issues with framerate drops at this setup, it's just blurry","replies":[{"poster":"michaelchan","date":"2019-02-02T13:23:15.537+0000","up_votes":2,"down_votes":0,"body":"Try 2300-2600 bitrate and 30FPS. 720 downscale is fine. Let me know if that’s any better.\n\nSoftware encoding is better, from what my research tells me.","replies":[{"poster":"Plummo","date":"2019-02-03T03:24:40.037+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wuks,realm=NA,application-id=EBBIvmVK,discussion-id=eY1m8xJ1,comment-id=00000000,timestamp=2019-02-02T13:23:15.537+0000)\n>\n> Try 2300-2600 bitrate and 30FPS. 720 downscale is fine. Let me know if that’s any better.\n> \n> Software encoding is better, from what my research tells me.\n\nThanks I'll try that. All my other games stream fine at these settings. Is 30 fps enough for league? 2300-2600 seems like it might be poor quality but I'll give it a try. I just read that the best setting for 720p is 3500 bitrate, which is normal for this quality but maybe league is different. I'm not sure ","replies":[]}]}]},{"poster":"KFCeytron","date":"2019-02-03T03:59:14.626+0000","up_votes":1,"down_votes":0,"body":"I stream at 2500; 3500 should be fine as well. 60 FPS looks nice, but 30 is still quite watchable, particularly if it's smooth. I stick with the software x264 encoder, as the hardware encoder on my graphics card (labeled in OBS \"H264/AVC Encoder (AMD Advanced Media Framework)\" because I have an AMD card) produced really blocky video when I tried it a while ago.\n\nThe thing to keep in mind is that your bandwidth (3500kbps in your case) is limited by your Internet, the streaming service, and so on, so you have to make do with that. Encoding more pixels or more frequent frames is going to spread that bandwidth thinner. If it can't meet the demand you're placing on it, it'll start producing blurry or choppy video. Also note that high motion video is tougher to encode than low-motion: my system kinda struggles with 720p30 LoL streams, but I can stream coding sessions in 1080p30 just fine.","replies":[]}]}