{"poster":"RitoStopTheBans","date":"2017-12-19T09:39:53.327+0000","title":"Aram Suggestions and other stuff. (!warning, wall of text!)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Sorry for wall of text! \n\nHello Fellow summoners (And hopefully Riot employees) , I hope everyone is enjoying the holy days and getting nice skins in your personal store. The purpose of this post is what the title suggest, I have some things about Aram and other small thing in the game, although I am happy with League of Legends as it is clear that Riot puts so much love and effort into the game, but even with that, I think Riot can always use feedback from the players. I've been playing league for a long time now and I am posting this on my smurf as my main got a well deserved ban, over the years, I've seen the game change and evolve, champs enter and leave the meta and experience great things on the game, but something that stayed behind gathering dust is Aram since it was released back in 2012. Although i understand all the focus is centered on the summoners rift ( which is perfectly understandable ), this leaves the amount of players that want a more casual, random and relaxed experience with something that, doesn't really feel good or fun, and although, I am not a part of that group as I enjoy ranked game play, I play Aram every now and then, and It is clear why is not that fun compared to 5v5 and why is less popular also, so allow me to stop ranting and lets go to what i think is frustrating about the game mode and how to improve it:\n\n1- The random factor: But, isn't the point of Aram being, random? Yes! But that is not the problem, the problem is that when you get random champions, you also get random roles, what  i mean with this, is that one team might get a really solid comp with a tank, a support, 2 mages and an ADC, while the other team might get 3 supports, a bruiser and a weak ADC, leading to unfair loses and frustrating moments.\nSuggested Fix: Keep the Random aspect of Aram, but make both teams get the same roles, 1 or 2 random tanks, an ADC, a Mage and a Support, this would make the mode fair, more fun, and way less frustrating. Something to point out is that, in case one team doesn't own a champ for an specific role either use one from the free rotation or, if there is not, for example, a tank on free rotation, then choose something 100% at random.\n\n2- A new type of re roll: Everyone that has played Aram Before knows that, after a few games, you gain a re roll, that allow you to get a different random champion if you use it, i think this is fine as it is, but I have something I would like to add, an special type of re roll that a player would get if he or she wins 3 Aram games, this re roll would allow the player to get a new random champ, with the difference that it would not use the ones on free rotation, but one of the champs this person owns, as it can be frustrating playing Aram and never getting champions you enjoy.\n\n3- Give more HP to the towers: This one is self explanatory, there are many instances in which you face a team that is really good at early game siege, which leads to games snowballing out of control for one of the teams, even more if the team you are on requires some time in order to reach the power spike, I would like some opinions on this one as i am not that sure if more tower HP would be a good change.\n\n\nNow, some things I would love to see in the future, It is personal preferences more than anything else, but it would be neat to have them!\n\n1- Right now, we have the Dynamic background for your profile, that shows your most played champion in your last 20 games, something I would like to see ( and I hope others too ) is an option to choose what background you like based on your champion mastery, let's say I have {{champion:35}} , {{champion:103}}  and {{champion:40}}  as mastery 7, maybe one day i feel like showing my skill with Janna on my profile, and other day Shaco! This is something that is not needed on the game like a fix or a Nerf/Buff, but i think it is a good idea to consider.\n\n2- This one is linked to number 1 in the sense that, on top of being able to choose what champ we have on our profile, allow us to choose a skin that we own as the background of that champ!\n\nThis last one I am really disappointed with, as I'm sure other players are, this being the way you unlock Masteries now. I do not dislike fusing PI with BE to create a new system, but with this change it was not taken into account the fact that masteries were unlocked with BE, and now, they have the same price as a champion! this is just excessive and unnecessary, right now, getting BE takes forever, and if you are unlucky, you can easily get cheap champs like poppy in a capsule to end up with 90 BE, and let's be honest, if anyone has to choose between a masterie, or buying a champ to expand their champion pool, or to save for a rune page, the last 2 will always be a priority, In my opinion, with the new changes to the system, the way you get BE, the masteries should be free, to compensate, make the players acquire 4 shards for level 6, and 5 for level 7, I think this would be a fair trade to fix the cost of the masteries.\n\nThis is all I can come up with, I would like to hear everyone's opinion on this, do you agree? If you don't, feel free to comment on this post! \n===Oh also, I don't want to come as I don't appreciate Riot for their hard work, I know they are busy trying to make the game better for us, this is something I would like to see in the future, as I know league will be around for a long long time, so thanks for the hard work!===\n\nHappy Holidays summoners!\n {{sticker:sg-kiko}}","replies":[{"poster":"Broporo","date":"2017-12-19T22:34:51.380+0000","up_votes":1,"down_votes":0,"body":"There are a lot of pretty cool ideas here, but they'll go rather unnoticed here in Help & Support tbh =(. Generally, we would delete and request that you repost it in the correct area, but since you put so much work into it I'd hate for that all to go to waste. \n\nPlease copy this and repost it over in General Discussion/Gameplay for the best visibility and responses!","replies":[]},{"poster":"Kokua","date":"2017-12-19T11:21:55.319+0000","up_votes":2,"down_votes":0,"body":"I like ARAM the way it is personally. Not everyone would be happy to be thrown into a specific champion pool right from the beginning, as it would then make your rerolls seem less valuable, knowing you'll get the same type of champion if you rerolled. Also, champions can be played in many different ways, especially in ARAM - one of the reasons why I love it so much. 3 supports in an ARAM could also prove quite the force to deal with, and shouldn't be instantly thought of an unfair disadvantage. In fact, when played right, your opponent could feel like YOU have the unfair advantage with 3 supports. Your suggestion for the new type of reroll makes little sense to those of us who own every champion, and would be too easily abused by people who literally make accounts and own a handful of specific champions that they believe would give them the upper hand as opposed to others. \n\nIn contrast to that, I believe ALL champions should be available to EVERYONE in ARAM, as to give everyone fair access to every champion, so that there aren't people who literally make smurfs to play with only a handful of champions. This also would expose people to the full champion pool even if they didn't have access to every champion, and would allow people to experience new things without having to wait for the free champion rotation. \n\nAs someone who has played at least a couple thousand ARAMs, I think the turrets are fine as they are. It isn't too often where they go down early enough to give a massive advantage, and there is SO MUCH back and forth in ARAM to the point that turrets don't seem to make such a significant impact on the next engagement.\n\nAs for the profile changes, I wouldn't mind your suggestions there. I think it would be cool to choose what champion I would like displayed on my profile, and a skin I own with that champion.","replies":[]}]}