{"poster":"Lil Besom","date":"2018-08-25T22:36:54.343+0000","title":"Absolut harte freeze laggs bisher unfixbar","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\nerstmal entschuldige ich mich f&uuml;r den Titel ich finde aber er passt schon ganz gut :D\r\nIch kann nicht genau sagen wie lange ich schon das hier habe aber ich komme mal zum Punkt.\r\nIch kriege eine Match gefunden nachricht und klicke auf annehmen, dann l&auml;dt es und l&auml;dt da steht ja &quot;warte auf andere spieler&quot; und es l&auml;dt und l&auml;dt viel zu lange. wenn jmd nicht annehmen w&uuml;rde, w&uuml;rde es nicht einmal so lange dauern. und dann geht die anzeige weg und die n&auml;chste poppt auf und ist direkt weg weil ich zu langsam war obwohl ich sie gradmal eine halbe sekunde gesehen habe.\r\ndies f&uuml;hrte schon mehr mals dazu, dass ich dann 5min oder so warten musste weil der client buggt. Nein es ist nicht mein Ping ich habe LAN 40ms und es knabbern auch keine ratten an meinem kabel xD\r\nWenn das nicht das schlimmste w&auml;re kommt noch das hier.... ich bin also in der championwahl und muss bannen beim draft pick und ich klicke einen champion an dr&uuml;cke auf bannen und der bannen butten ist dann gelockt aber es geht nicht weiter es ist wie als ob ich 2000ms h&auml;tte dann komme ich wenn ich zb 1. bin beim picken gef&uuml;hlt 5 min sp&auml;ter an (ironie..)\r\ndann haben wir es endlich geschafft ich wei&szlig; nicht wen ich picken soll nasus oder urgot? ich bin auf urgot drauf hab net gelockt und will doch nasus spielen gehe dann auf nasus und alles h&auml;ngt wieder und nasus wurde nicht ausgew&auml;hlt. (ich wei&szlig; jetzt grad net ob dann urgot gelockt wird oder ob man kick bekommt aber es passiert einfach das was passiert , wenn man auf einem champion ist und die zeit abl&auml;uft) wenn ich dann noch ingame bin NUR ABER IN DER KLUFT kriege ich dann mitten im spiel absoluten lagg und mein charakter bewegt sich nicht aber mein ping ist straight auf 40 ms und im discord/teamspeak kann ich normal mit freunden reden...\r\ndann gestern im aram game:\r\nich habe irgendeinen champ und biete einem twitch einen trade an. die zeit l&auml;uft bis zum ende ich dr&uuml;cke noch abbrechen weil ich bei der h&auml;lfte keine geduld mehr hatte und wieder es freezed einfach ich kann nix mehr klicken und da bleibt diese nachricht mit dem trade. w&auml;hrrenddessen sehe ich wie twitch im chat schrieb &quot;u want twitch?&quot; aber ich bekam erst im loading screen mit, dass jemand skins ausgegeben hat und dass dieser twitch spieler mit jmd anderes dann getauscht hat.# und ich hatte trotzdem den champ den ich anfangs gekriegt hab.\r\nauch bei aram: oben sind ja champions neuerdings aufgelistet die man noch nehmen kann wenn jmd rerollt. un d wenn man den champ nicht hat ist sein bild GRAU aber der von ashe war nicht GRAU weil ich ashe habe und ich dr&uuml;cke auf sie drauf aber NICHTS passiert wieder mal. ich habe schon vorher mal lol neu installiert aber langsam nervt es mich echt hart weil ich keine lusst mehr auf bans usw habe erst recht nicht wenn ich bald rankeds spiele -.-\r\nich wei&szlig; einfach nicht mehr wie ich das gefixxt kriege es nervt mich einfach nur noch und lol macht so kaum noch spa&szlig; auch ohne gameplay.\r\nich mein auch wenn ich wieder mal 2/11 stehe macht es spa&szlig; aber nicht mit diesen komischen freeze laggs oder wie ich das nennen soll bitte helft mir ich will einafch nur noch normal spielen :(\r\n\r\nWas ich schon dagegen versucht habe: Dateien auf fehler nachgeguckt im lol client und lol neu installiert.. ich &uuml;berlege meine festplatte zu formatieren und alles neu zu installieren aber ich habe keine lusst noch alle driver etc neu zu installieren &lt;.&lt;\r\nbitte helft einem noob :( ich w&auml;re &uuml;beraus dankbar und achtet nicht auf diese rechtschreibung xD","replies":[]}