{"poster":"BiatchpleaseLP","date":"2018-03-04T16:36:05.724+0000","title":"Ein Appell an alle Spieler im \"Low-Elo\" Bereich","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":11,"body":"**Hallo liebe Community,**\r\n\r\nIch hatte vor einer Woche einen &quot;kleinen&quot; Wutanfall nach einer ziemlich belastenden Partie LoL und dachte mir ich sollte dazu mal einen Beitrag im Forum gestalten.\r\nEs war zwar ein Normal-Game, wo es nat&uuml;rlich klar ist, dass man von Trolls und Neulingen umgeben ist (&uuml;berhaupt, wenn man selbst noch nicht Eingestuft wurde), als ich bemerkt habe wie wenig sich gewisse Spieler mit dem Spiel befassen. Ich meine es ist klar, dass man das Spiel noch lernen muss oder Fehler passieren und Verbindungsabbr&uuml;che aufgrund der beschissenen Versorgung auch passieren. \r\nAber am meisten triggern mich die Leute die entweder 2-mal sterben weil der Gegner einfach besser ist und dann AFK gehen ohne es zu versuchen aufs Lategame zu spielen oder die Jungler, welche dich flamen weil man in der Laningphase verkackt aber dir nach 23min noch kein einziges mal gegankt haben.\r\n\r\nIch traue mich nicht mal mehr weiter meine Rankedgames zu spielen um eingestuft zu werden, da ich im Ranked als auch im Normal nur solche Patienten in die Partien bekomme. Es f&uuml;hlt sich einfach jedes Game an als w&uuml;rden wir gegen irgendwelche asiatischen Pro-Gamer spielen, weil mein Team nicht nachdenken will bevor es einen Schritt nach vorne setzt. Ich wei&szlig; so wie ich hier gerade meine Meinung kund tue h&ouml;rt es sich an als w&auml;re ich der gr&ouml;&szlig;te LoL-Spieler aber ich wei&szlig; genau, dass ich auch Fehler mache aber wie vorhin erw&auml;hnt es ist nicht schlimm Fehler zu machen. Nur mich st&ouml;rt einfach diese sture Spielweise der einzelnen Spieler (die &uuml;berhaupt im Low-Elo Bereich zuhause sind) und es gewissen Leuten so schwer machen nach oben zu den kompetenteren &quot;Genossen&quot; zu kommen.\r\n\r\nIch hoffe ich finde jemanden der mich und mein Problem versteht und eventuell ein paar Tipps f&uuml;r mich hat was ich machen soll.\r\n\r\n**Viel Spa&szlig; beim spielen,**\r\n**Biatchplease**","replies":[{"poster":"Oriius","date":"2018-03-04T17:02:12.742+0000","up_votes":1,"down_votes":12,"body":"was du als erstes machen solltest wäre dein Name ändern.\n\nSo was du machen sollst ist schwierig konkret zu sagen. Man könnte dir jetzt allgemeine Spieltipps da hin knallen aber all das wird dir unter Umständen nichts bringen. Ich hab bestimmt 500 rankeds oder 1k rankeds hinter mir und solche Runden wirst du unterhalb von der \"Highelo\" regelmäßig haben. Sprich bis du nach oben zu den kompetenteren \"Genossen\" gelangt bist wirst du selbst wenn du den Skill dafür besitzt  unter Umständen auch erst 5k Games spielen müssen.\n\nIch persönlich würde daher klar mich selber erst einmal verbessern sogut es geht oder sogut es eben machbar zum jetzigen Zeitpunkt ist denn seien wir mal ehrlich. Jeder der nur mit & gegen 0815-Spieler spielt wird NICHT BESSER!!! , mir einen Premade suchen mit dem man gut klarkommt das erhöht die Siegeschancen ungemein in der \"lowphase\"  und ich würde um jeden Preis eine Position und einen Champ spielen die dazu in der lage ist jeglichen Fehler seiner mates auszugleichen. Hierfür spricht besonders die Midlane , aggresive Toplaner möglicherweise (Fighter oder Bruiser like Fiora/Darius) und vllt der Adc. \nAls Premade würde ich immer Adc und Midlane , Adc und Support oder Midlane+Jungle bevorzugen damit das Potenzial bei den im schlimmsten fall einzig \"normalen tiltfreien Spielern\" bleibt.\n\nWas mir unglaublich geholfen hat um besser zu werden ist es gegen erheblich stärkere Gegner zu spielen. Durch die Herausforderung wurde auch ich immer stärker so das ich früher oder später eine Bedrohung für die Leute darstellte. Habe lange Zeit auch wenn ich mich für besser hielt auf silber oder maximal Gold 5 niveau gespielt was nicht nur daran lag das ich mich einfach nicht darauf konzentriert habe vllt besser zu werden sondern auch das meine Gegner auf diesem Niveau keine große Herausforderung für mich darstellten. Irgendwann fing es an dann ich recht rapide bessere Gegner erhielt angefangen mit regelmäßigen Goldgegnern die mich zwar auch noch nicht großartig gestört haben aber man hat den Unterschied gemerkt , auf einmal hatte ich die ersten Platingegner wo ich dann langsam anfing mich mehr aufs Spiel zu konzentrieren. Ich wurde besser was meine mechanischen Fähigkeiten angeht , meine Tastenbelegungen wurden aktiv optimiert und sind aktuell wieder auf umlegung , mein Championpool hat sich ungewöhnlich geändert ich spiele mittlerweile gerne Assasine oder Mages statt Tanky toplaner und habe generell anspruchsvollere Champs lieben gelernt wie zb Riven. Mein Chatverhalten hat sich aktiv verändert , nahezu 0 Flame mehr , meine AFK-Rate geht fast gegen 0 (vllt mal 1 aus 500 tiltspielen oder so ) , mittlerweile bin ich eigentlich generell der Callmaker in meinen Games , ich reagiere wesentlich schneller auf Pings /Hilfeanfragen meines Teams , ich versuche weniger solo zu spielen sondern mehr mit meinem Team. Natürlich gibts noch genug Sachen die sich verbessern lassen aber auch das würde vermutlich erst mit Niveauvolleren Gegnern geschehen. \n\nAm Ende bin ich dann bei regelmäßigen Diagegnern gelandet. hin und wieder mal nen Master , ganz selten nen Challenger wo ich mich als Silberspieler einfach mega geehrt fühle wenn ich gegen einen der top 200 Spieler EUW spielen \"darf\" . \n\nMeine Gegner hielten sich dann aber doch eher auf den Fixpunkt Hohes Platin-tiefes Dia und ja dadurch hat sich mein Skill größtenteils verbessert.\n\nwas ich damit eigentlich nur schildern möchte , Such dir unter Umständen jemanden der gegen dich spielen möchte aber auf Dia niveau spielt. Vielleicht auch mit dir denn das gehört dazu. \n\nDurch diese erheblichen Verbesserungen ist es mir möglich trotz 1-2 afk´s alle 2 matches meine 50% winrate zu halten und sogar minimal drüber zu kommen. Wenn ich jetzt noch meine Position ändern würde und mich auf die Midlane konzentrieren würde könnte ich vermutlich sogar eine winrate von 60-70% erzielen. \n\nAlso wenn du eine ruhige Seele hast , viel zeit , ein bisschen weniger Pech als ich , kontakte zu besseren Spielern dann wirst du früher oder später rauskommen und das von ganz automatisch.","replies":[{"poster":"Nycaria","date":"2018-03-04T17:39:01.714+0000","up_votes":10,"down_votes":0,"body":">Am Ende bin ich dann bei regelmäßigen Diagegnern gelandet. hin und wieder mal nen Master , ganz selten nen Challenger wo ich mich als Silberspieler einfach mega geehrt fühle wenn ich gegen einen der top 200 Spieler EUW spielen \"darf\" .\n\nWann kriegen wir eigentlich endlich mal Beweise dafür? Das höchste sind bei dir ab und zu Dia 5 Spieler in den Games und zwar im **Aram**.","replies":[{"poster":"Abasin","date":"2018-03-05T09:30:43.849+0000","up_votes":2,"down_votes":0,"body":"In ARAM hatte ich auch schon nen Challenger im Gegnerteam. {{sticker:poppy-wink}}  War aber noch nicht mal richtiges ARAM, sonden ein arrangiertes Spiel im Club auf der ARAM Map. Mit sowas sollte der liebe Oriius lieber nicht ums Eck kommen. Nur mal so am Rande..","replies":[]}]},{"poster":"eingew","date":"2018-03-04T17:57:52.742+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Oriius,realm=EUW,application-id=KYnfKGf0,discussion-id=wIoiwAU7,comment-id=0002,timestamp=2018-03-04T17:02:12.742+0000)\n>\n> was du als erstes machen solltest wäre dein Name ändern.\n> \n> So was du machen sollst ist schwierig konkret zu sagen. Man könnte dir jetzt allgemeine Spieltipps da hin knallen aber all das wird dir unter Umständen nichts bringen. Ich hab bestimmt 500 rankeds oder 1k rankeds hinter mir und solche Runden wirst du unterhalb von der &quot;Highelo&quot; regelmäßig haben. Sprich bis du nach oben zu den kompetenteren &quot;Genossen&quot; gelangt bist wirst du selbst wenn du den Skill dafür besitzt  unter Umständen auch erst 5k Games spielen müssen.\n\nDas ist Quatsch. Ich will dir ja jetzt wirklich keine Träume zum Platzen bringen, aber wenn du nach deutlich über 1/2k Spielen noch nicht Dia bist, wirst du vermutlich nie zum Status des \"Pros\" gehören. Solange du unter Dia 2 bist hast du wenige bis keine Chancen, auch nur in die Nähe professioneller Teams zu kommen. Ich weiß nicht, wie alt du bist, aber wenn du deinen Zenit vom körperlichen Potential her bereits überschritten hast, wird sich daran auch in Zukunft nichts mehr ändern.\nDu wirst, wie ich und 99% aller Spieler, wohl für immer einem professionellen Spiel nur von den Zuschauerbänken aus beiwohnen können.\n\n> Ich persönlich würde daher klar mich selber erst einmal verbessern sogut es geht oder sogut es eben machbar zum jetzigen Zeitpunkt ist denn seien wir mal ehrlich. Jeder der nur mit &amp; gegen 0815-Spieler spielt wird NICHT BESSER!!! , mir einen Premade suchen mit dem man gut klarkommt das erhöht die Siegeschancen ungemein in der &quot;lowphase&quot;  und ich würde um jeden Preis eine Position und einen Champ spielen die dazu in der lage ist jeglichen Fehler seiner mates auszugleichen. Hierfür spricht besonders die Midlane , aggresive Toplaner möglicherweise (Fighter oder Bruiser like Fiora/Darius) und vllt der Adc. \n> Als Premade würde ich immer Adc und Midlane , Adc und Support oder Midlane+Jungle bevorzugen damit das Potenzial bei den im schlimmsten fall einzig &quot;normalen tiltfreien Spielern&quot; bleibt.\n\nNatürlich steigert es den eigenen Skill ungemein, mit und gegen bessere Spieler zu spielen (sofern man dafür bereit ist, komplett auseinander genommen zu werden und *daraus etwas mitzunehmen*). \nDa solltest du dich aber, wenn du wirklich gut bist und sein willst, auch selbst hin spielen können. Idealerweise lernst du dabei aus Streams oder gar von einem kompetenten Coach (wobei da ausführliche Überprüfungen der Seriösität des Angebots nötig sind. Immerhin kostet das ganze Geld und afaik sind da viele Betrüger unterwegs).\n\n> Am Ende bin ich dann bei regelmäßigen Diagegnern gelandet. hin und wieder mal nen Master , ganz selten nen Challenger wo ich mich als Silberspieler einfach mega geehrt fühle wenn ich gegen einen der top 200 Spieler EUW spielen &quot;darf&quot; . \n> \n> Meine Gegner hielten sich dann aber doch eher auf den Fixpunkt Hohes Platin-tiefes Dia und ja dadurch hat sich mein Skill größtenteils verbessert.\n> \n> was ich damit eigentlich nur schildern möchte , Such dir unter Umständen jemanden der gegen dich spielen möchte aber auf Dia niveau spielt. Vielleicht auch mit dir denn das gehört dazu. \n> \n> Durch diese erheblichen Verbesserungen ist es mir möglich trotz 1-2 afk´s alle 2 matches meine 50% winrate zu halten und sogar minimal drüber zu kommen. Wenn ich jetzt noch meine Position ändern würde und mich auf die Midlane konzentrieren würde könnte ich vermutlich sogar eine winrate von 60-70% erzielen. \n> \n> Also wenn du eine ruhige Seele hast , viel zeit , ein bisschen weniger Pech als ich , kontakte zu besseren Spielern dann wirst du früher oder später rauskommen und das von ganz automatisch.\n\nDu redest hier aber halt von Normals, oder nicht? Die sind nicht aussagekräftig über deinen tatsächlichen Skill. Wenn du wirklich wissen willst, wie gut du bist, solltest du wieder Rankeds spielen, musst dir dabei aber eben auch bewusst sein und damit leben können, dass du vielleicht deutlich schlechter bist, als du dir gerade vorstellst.","replies":[{"poster":"Nycaria","date":"2018-03-04T18:00:37.265+0000","up_votes":3,"down_votes":0,"body":"Er redet von Rankeds. Seine Aussage in einem anderen Thread:\n\n>Vielleicht bedenkt Riot ja den individuellen Skill schon das würde erklären wie ein silberspieler selbst in rankeds mit&gegen Diamonds spielen muss hehe ....\n\nAuf die Beweise für diese Aussage warten wir schon seit einer ganzen Weile ^^","replies":[{"poster":"eingew","date":"2018-03-04T18:03:57.574+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sçathach,realm=EUW,application-id=KYnfKGf0,discussion-id=wIoiwAU7,comment-id=000200010000,timestamp=2018-03-04T18:00:37.265+0000)\n>\n> Er redet von Rankeds. Seine Aussage in einem anderen Thread:\n\nDann hat er ein gutes Gedächtnis, denn sein letztes Ranked war im August letzten Jahres...","replies":[{"poster":"Canis858","date":"2018-03-04T18:26:40.478+0000","up_votes":1,"down_votes":0,"body":"Ist das in höheren Elos immer so, dass sich die Spieler gegenseitig zerfleischen und sich ihre Aussagen gegen den Kopf schmeißen, wenn ja bleibe ich wohl lieber unranked! Ihr solltet vielleicht besser Mal auf euer Karma achten....:)\n@BiatchpleaseLp: Du unterstellst damit einer ganzen Elo nur aus Trollen, Unfähigen und ein paar wenigen Guten zu bestehen, aber für viele die in dieser Spielen ist dies nur ein Zeitvertreib und nichts ernstes.\nUnd zu denen die dann AFK gehen - einen gutes Team zeichnet sich dadurch aus, dass es auch in Unterzahl gewinnen kann und wenn dieses Team es nicht schafft, dann gibt es für den Einzelnen auch noch die Einzelwertung!","replies":[{"poster":"CMan","date":"2018-03-04T18:44:20.690+0000","up_votes":2,"down_votes":0,"body":">Ist das in höheren Elos immer so, dass sich die Spieler gegenseitig zerfleischen und sich ihre Aussagen gegen den Kopf schmeißen\n\nNein.\nDen meisten Leuten sind die anderen Spieler und deren Aussagen wahrscheinlich völlig wurst.\n\nDas hat auch absolut nichts mit der Elo zu tun, sondern einfach damit, dass dieser eine Kandidat ein bekannter Troll ist (sowohl hier im Forum als auch ingame), der schon seit einer Weile derartige Märchen und Verschwörungstheorien verbreitet.\n\nDass da Leute ankommen und ihm widersprechen ist eigentlich logisch. Und dies geschieht hier vor allem mit Argumenten und Fakten, also durchaus gesittet.\n\nWer sich anständig präsentiert, dem gegenüber werden sich auch die anderen entsprechend verhalten, völlig egal wie gut man in dieser Freizeitbeschäftigung ist.","replies":[{"poster":"Canis858","date":"2018-03-04T18:52:25.864+0000","up_votes":1,"down_votes":0,"body":"Hää, aber das was Eingew schreibt hat dich Hand und Fuß und ist nicht von der Hand zu weisen, oder habe ich dich falsch verstanden?","replies":[{"poster":"Canis858","date":"2018-03-04T18:55:32.373+0000","up_votes":2,"down_votes":0,"body":"Achso.... Ich hatte gerade nicht nur ein Brett sondern einen ganzen Ivern vorm Kopf:)","replies":[{"poster":"Waldschrat86","date":"2018-03-04T18:58:49.471+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Canis858,realm=EUW,application-id=KYnfKGf0,discussion-id=wIoiwAU7,comment-id=00020001000000000000000000000000,timestamp=2018-03-04T18:55:32.373+0000)\n>\n> Achso.... Ich hatte gerade nicht nur ein Brett sondern einen ganzen Ivern vorm Kopf:)\n\nSolang du keinen {{champion:57}} im Auge hast :D","replies":[]}]}]}]},{"poster":"Nycaria","date":"2018-03-04T18:51:06.974+0000","up_votes":2,"down_votes":0,"body":">Ist das in höheren Elos immer so, dass sich die Spieler gegenseitig zerfleischen und sich ihre Aussagen gegen den Kopf schmeißen, wenn ja bleibe ich wohl lieber unranked! Ihr solltet vielleicht besser Mal auf euer Karma achten....:)\n\nAuf was genau beziehst du dich mit der Aussage denn bzw auf wen? Sofern ich das richtig verstehe bezieht sich das auf meine Aussage bzw das Zitat aus einem anderen Thread (wenn ich damit falsch liege tuts mir leid^^). \n\nFalls es sich darauf bezogen hat, hier ne Erklärung dazu (wenn nicht, einfach ignorieren). \nMein Zitat hat nichts mit zerfleischen zu tun, jeder halbwegs aktive Forennutzer weiß, dass man die Aussagen von Oriius zum Thema Matchmaking nicht allzu ernst nehmen sollte, ich habe nur Eingew darauf hingewiesen. Wenn du das als \"zerfleischen\" auffasst.. nun jeder hat ne eigene Meinung dazu ^^\n\nBtw bin weder ich noch derjenige auf den mein Kommentar bezogen war High-Elo :)","replies":[]}]},{"poster":"Sirrkas","date":"2018-03-05T13:35:06.863+0000","up_votes":1,"down_votes":0,"body":"Und das beste, der stärkste Gegner daraus, hat mit Gold 3 abgeschlossen^^","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2018-03-05T13:31:00.023+0000","up_votes":4,"down_votes":0,"body":">So was du machen sollst ist schwierig konkret zu sagen. Man könnte dir jetzt allgemeine Spieltipps da hin knallen aber all das wird dir unter Umständen nichts bringen. Ich hab bestimmt 500 rankeds oder 1k rankeds hinter mir und solche Runden wirst du unterhalb von der \"Highelo\" regelmäßig haben. Sprich bis du nach oben zu den kompetenteren \"Genossen\" gelangt bist wirst du selbst wenn du den Skill dafür besitzt unter Umständen auch erst 5k Games spielen müssen.\n\nNetter Versuch. Aber op.gg zeigt nur 348 Rankeds bei dir an. Das geht zurück bis Season 3. Du musst gar nicht versuchen, dich als guter oder erfahrener Rankedspieler zu profilieren.\n\n> und ich würde um jeden Preis eine Position und einen Champ spielen die dazu in der lage ist jeglichen Fehler seiner mates auszugleichen. \n\nDas klingt eher nach Soraka oder Janna. Die können so gut wie jeden retten, der mal einen Fehler macht. Fiora dagegen, würde eher Fehler der Gegner bestrafen, nicht die des eigenen Teams ausgleichen.\n\n> Habe lange Zeit auch wenn ich mich für besser hielt auf silber oder maximal Gold 5 niveau gespielt was nicht nur daran lag das ich mich einfach nicht darauf konzentriert habe vllt besser zu werden sondern auch das meine Gegner auf diesem Niveau keine große Herausforderung für mich darstellten. Irgendwann fing es an dann ich recht rapide bessere Gegner erhielt angefangen mit regelmäßigen Goldgegnern die mich zwar auch noch nicht großartig gestört haben aber man hat den Unterschied gemerkt , auf einmal hatte ich die ersten Platingegner wo ich dann langsam anfing mich mehr aufs Spiel zu konzentrieren. Ich wurde besser was meine mechanischen Fähigkeiten angeht , meine Tastenbelegungen wurden aktiv optimiert \n\nNur, dass das immer noch nicht stimmt. Bisher spielst du immer noch nur auf Silberniveau, bzw. du hast noch nicht bewiesen, so gut wie Platin zu sein. Mach das doch endlich mal.\n\n>Am Ende bin ich dann bei regelmäßigen Diagegnern gelandet. hin und wieder mal nen Master , ganz selten nen Challenger wo ich mich als Silberspieler einfach mega geehrt fühle wenn ich gegen einen der top 200 Spieler EUW spielen \"darf\" .\n\nHast du nie, zumindest nicht im Ranked, obwohl du das dauernd behauptest. \n\nHör bitte endlich mit deinen Märchen auf. Damit schadest du höchstens den Leuten, die dir eventuell glauben schenken könnten.","replies":[]}]},{"poster":"Sirrkas","date":"2018-03-05T13:20:21.318+0000","up_votes":3,"down_votes":0,"body":">Es war zwar ein Normal-Game, wo es natürlich klar ist, dass man von Trolls und Neulingen umgeben ist (überhaupt, wenn man selbst noch nicht Eingestuft wurde)\n\nNach meinen bisherigen Erlebnissen, ist es im Normal bisher eher angenehmer gewesen. Zudem hat die Einstufung im Ranked überhaupt keinen Einfluss auf das Normal-Matchmaking.\n\n>Ich traue mich nicht mal mehr weiter meine Rankedgames zu spielen um eingestuft zu werden, da ich im Ranked als auch im Normal nur solche Patienten in die Partien bekomme. \n\nIch dachte du meinst, es ist im Normal schlimmer? \n\n>Es fühlt sich einfach jedes Game an als würden wir gegen irgendwelche asiatischen Pro-Gamer spielen, weil mein Team nicht nachdenken will bevor es einen Schritt nach vorne setzt. \n\nKeine Angst, es ist dann wohl eher nur gefühlt so. Die Spieler in beiden Teams sind grundsätzlich gleich stark/schlecht. Spätestens wenn man richtig eingestuft ist, wird das der Fall sein. Wenn man selber neu in der Rangliste ist, kann es etwa noch sein, dass man aktuell zu hoch eingestuft ist und deswegen die Gegner für einen zu stark sind. Das regelt sich aber von selbst mit der Zeit. \n\n>Ich weiß so wie ich hier gerade meine Meinung kund tue hört es sich an als wäre ich der größte LoL-Spieler aber ich weiß genau, dass ich auch Fehler mache aber wie vorhin erwähnt es ist nicht schlimm Fehler zu machen. Nur mich stört einfach diese sture Spielweise der einzelnen Spieler (die überhaupt im Low-Elo Bereich zuhause sind) und es gewissen Leuten so schwer machen nach oben zu den kompetenteren \"Genossen\" zu kommen.\n\nDer untere Bereich der Rangliste entscheidet sich eben insbesondere dadurch zum Rest, dass hier mehr, größere und schwerwiegendere Fehler gemacht werden. Gerne gepaart mit weiteren Defiziten. Allgemein nimmt das nach oben hin ab, aber man wird wohl nie auf Spieler treffen, die perfekt spielen. \n\nUm weiter hoch zu kommen, muss man selber beweisen, besser zu sein. Wenn ich op.gg nach deinen Solo-Rankeds befrage, zeigt das 4 Spiele. 3 davon als Supporter. Das erste was mir auffällt, du hast dein Trinket nicht gewechselt. Das solltest du spätestens machen, wenn du deine Quest des Supportitems erfüllt hast. Ab da ist das ein Sightstone und das Trinket sinnvoller wenn es gegen {{item:3341}} getauscht wird. Dann kann man nicht nur Sicht generieren, sondern auch negieren.\n\nDes weiteren:\nBei deiner Nami sieht der Build recht gut aus, aber statt {{item:3301}} wäre wohl {{item:3303}} besser gewesen. Damit kannst du Gold generieren, während du die Gegner ärgerst und gegen einen Braum, sollte das in der Laningphase gut klappen, auch gegen die Tristana, deren Reichweite ist da noch nicht so toll. \n\nBei Leona würde ich dir von  {{item:3057}}/{{item:3025}} eher abraten. Auch wenn der Glanzproc erst mal gut klingt, da man zum Beispiel das gleichzeitig mit dem Q auslöst, ist das Item doch eher verschwendet. Als Leona macht man für gewöhnlich eine Kombo am Stück und kann dabei nur ein mal Glanz auslösen. Im Idealfall sieht das etwa so aus:\n\nW aktivieren, E treffen, Autohit, Q + Instantautohit, in der Nähe bleiben um W für den Schaden zu haben. Je nach Level und Situation natürlich noch mit einer Ult darin. Das Problem ist hier, der Glanz wird bei einem kurzen Angriff nur 2 mal ausgelöst und zwar beim ersten Autohit. Danach muss man 2 Sekunden warten, um den erneut nutzen zu können. Aber deine Fähigkeiten sind da meist alle auf Abklingzeit.\n\nStattdessen wäre etwas wie {{item:3109}} hilfreicher, damit lenkst du Schaden vom Carry auf dich um und dein Carry heilt dich auch noch. Das sollte einen stärkeren Einfluss haben, als etwas Bonusschaden. \n\nNoch als kleiner Tipp, falls du mit Leona dich noch nicht so auskennst. Ihr Q ist ein Autohitreset. Das bedeutet, im Idealfall, machst du einen Autohit und drückst, sobald der beendet ist, sofort Q. Dann macht sie sofort einen weiteren, diesmal mit Q Effekt. Damit kannst du mehr Schaden austeilen und gerade im Early, kann das einen Unterschied machen. \nEine weitere nützliche Anwendung dafür ist etwa das zerstören von gegnerischen Wards. Wenn ein Gegner etwa, genau neben dir, einen Ward platziert, kannst du einen Autohit darauf machen, dann Q drücken und hast schon 2 von 3 HP entfernt. Da der Ward kurz angreifbar bleibt, kannst du einen dritten Autohit machen, wenn du schnell genug warst und den komplett zerstören.","replies":[]},{"poster":"eingew","date":"2018-03-04T17:49:43.665+0000","up_votes":3,"down_votes":0,"body":"Also wenn ich du wäre, würde ich als erstes meinen Blickwinkel aufs Spiel verändern. Immer dieses \"aufsteigen\". Das ist doch nicht wichtig. Das Spiel sollte dir für sich selbst gesehen Spaß machen. Auch unabhängig davon, ob deine Mitspieler grad Mist bauen. Wenn du das nicht so sehen kannst... also ich würde mir dann ohnehin schon etwas anderes suchen. Ein Hobby muss doch Spaß machen, sonst macht es ja keinen Sinn.\n\nDann würde ich mich an deiner Stelle über das [Elosystem](https://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo) informieren. Wie dir schon gesagt wurde: Deine Mitspieler und Gegner sind dir in Rankeds spätestens nach 100 Spielen ebenbürtig. So etwas wie ein Team, das dich zurückhält, sei es durch Leaver oder Feeder, gibt es nicht.\n\nUnd zuletzt würde ich mich an deiner Stelle mithilfe dieser Guides aufs Ranked vorbereiten:\n\nDer [Ranked Guide für Dummies](https://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/c0e2BmdT-der-ranked-guide-far-dummies-i-am-a-champion)\nSanctuarys \"[Werde Motivator und Manipulator](http://forums.euw.leagueoflegends.com/board/showthread.php?t=613136)\"\nund [Humpels Psycho Guide](http://forums.euw.leagueoflegends.com/board/showthread.php?t=1418213)\n\nWenn du noch weitere, vielleicht konkretere Fragen hast, scheue dich nicht sie zu stellen. Sollten diese eher Aspekte des Skills betreffen, würde ich dir auch das Unterforum \"[Level up: Guides und Tipps](https://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de)\" empfehlen.","replies":[]},{"poster":"Pandeonor","date":"2018-03-04T17:10:31.958+0000","up_votes":2,"down_votes":0,"body":"Wenn Du besser bist als die anderen dann musst Du zusehen das Du was daraus machst. Das lernst Du am Besten in den Normals.","replies":[]},{"poster":"JustAHandsomeMan","date":"2018-03-04T16:54:04.076+0000","up_votes":1,"down_votes":0,"body":"ganz ehrlich .. wenn du da alleine nicht raus kommst, such dir nen duo Partner und wenn das nicht reicht, weißt du, du bist da wo du hingehörst. Und ne \"Elo-Hell\" gibt's nicht.\n\nGern geschehen.","replies":[]}]}