{"poster":"NightSecret808","date":"2019-02-11T18:25:02.631+0000","title":"Transformar en aspecto permanente aleatorio.","subforum":"Problemas Técnicos","up_votes":5,"down_votes":1,"body":"Hola, el tema es que hace poco complete 3 aspectos en artesan&iacute;as hextech y al transformar en aspecto permanente aleatorio me dieron la skin Irelia Cuchillas Divinas, no tenia al campe&oacute;n as&iacute; que me lo compre(aun que se supone que deberia salirme una skin de algun campe&oacute;n que tenga)\r\nEl punto es que igual tengo que gastar Esencia Naranja y se supone que la skin es permanente y no deber&iacute;a gastar nada, &iquest;c&oacute;mo puedo solucionar esto?\r\nSin mas que agregar y esperando respuesta de cualquiera y en especial de alg&uacute;n Soporte de RIOT me despido gracias.{{sticker:slayer-jinx-wink}}","replies":[{"poster":"lllHeisenberglll","date":"2019-02-11T23:09:20.589+0000","up_votes":3,"down_votes":0,"body":"Al intercambiar 3 skins te da como resultado una skin PERMANENTE y ALEATORIA, no importa si tienes el campeon o no. Yo tengo como 6 skins con este marco dorado, pero no tengo al campeon viste xD Asi que permanecen ahi hasta que compre al champ.\n\nDato importante, si compraste a Irelia LUEGO de hacer el re roll, haz click izquierdo en la skin y te saldra una opcion que dice \"ADQUIRIR DE FORMA PERMANENTE\" o \"DESBLOQUEAR\" no recuerdo muy bien xD Y no te costara esencia porque el precio ya lo pagaste re rolleando 3 skins \n\n{{sticker:slayer-jinx-wink}} \n\nSi tiene el recuadro dorado esa skin en tu baul significa que ya es tuya","replies":[]},{"poster":"Rod Flanders","date":"2019-02-11T22:48:21.756+0000","up_votes":2,"down_votes":0,"body":"En realidad cuando compres a Irelia, por RP o escencia azul, vas a poder desbloquear el aspecto sin tener que poner esencia naranja nuevamente. O sea está disponible para activar cuando tengas el champ.","replies":[{"poster":"NightSecret808","date":"2019-02-11T23:09:24.523+0000","up_votes":1,"down_votes":0,"body":"si eso ya me habia pasado antes, pero cuando compre al campeón sigue en botin y me pide que lo compre con esencia naranja","replies":[{"poster":"Rod Flanders","date":"2019-02-11T23:14:28.628+0000","up_votes":2,"down_votes":0,"body":"Hmmm debe estar bug, yo que vos mando un ticket a soporte, como casi todo está bug en LATAM lo más probable\n\nSoporte: https://support.riotgames.com/hc/es-419","replies":[]}]}]},{"poster":"Muy homosensual","date":"2019-02-11T19:40:39.539+0000","up_votes":2,"down_votes":0,"body":"Al combinar 3 aspectos te da una skin aleatoria de cualquier campeón. Esas no cuestan esencia naranja, tal vez se bugueo, probaste reiniciando el cliente?","replies":[{"poster":"NightSecret808","date":"2019-02-11T23:08:41.597+0000","up_votes":1,"down_votes":0,"body":"si lo hice pero igual me pide que lo compre con esencia naranja:/","replies":[]}]},{"poster":"NightSecret808","date":"2019-02-11T23:32:33.925+0000","up_votes":1,"down_votes":0,"body":"Hola NightSecret808\n\nEs un gusto poder escribirte.\n\nRespondiendo a este tema, los aspectos que son permanentes que se otorgan son aspectos Míticos, este no forma parte de los aspectos Míticos, por lo que me temo que no se otorga de forma permanente.\n\nNosotros de cualquier manera quedamos al pendiente si cuentas con alguna duda adicional.\n(eso me respondieron en soporte de riot)","replies":[{"poster":"Muy homosensual","date":"2019-02-11T23:42:51.151+0000","up_votes":1,"down_votes":0,"body":"Qué les escibiste? los miticos no son los únicos porque los definitivos igual no cuestan esencia, alta respuesta te dieron xd","replies":[{"poster":"NightSecret808","date":"2019-02-11T23:46:04.140+0000","up_votes":1,"down_votes":0,"body":"Prácticamente lo mismo que puse arriba, pero mas resumido.","replies":[{"poster":"Muy homosensual","date":"2019-02-11T23:54:16.585+0000","up_votes":1,"down_votes":0,"body":"Mmmm qué raro, preguntaba porque con esa respuesta tal vez no te entendieron lo que quisiste decir :/","replies":[]}]}]}]}]}