{"poster":"Elotüte","date":"2015-10-27T22:32:15.451+0000","title":"Trolls unterwegs?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":10,"body":"Hi \r\n\r\nich habe grade 2 mal in Folge nen Draftmode verlassen m&uuml;ssen weil meine mitspieler teils beschissen bzw. gepickt haben was sie wollten.\r\nIch muss jetzt nen paar minuten warten weil grade ne Katarina auf der AD Carry Position gepickt wurde. Oder sie geht mitte und der TF (zweiter Pick) flamed dann nur noch. Starten einige ne Abwechselne Wahl mit den Hintergedanke nur einen Champ spielen zu wollen? Und wenn es ne Katarina Supp sein muss?\r\nIn beiden F&auml;llen war ich first pick und ich hasse es blind irgendwo was reinzupicken weswegen ich 2 mal hintereinnander Supp pickte. \r\nWann sieht man nen Support First Pick. Letzter Pick h&auml;tte nen ADC sein sollen was aber ne Kata wurde wo ich nur sage dankesch&ouml;n.\r\n\r\nSinnvoll es zu verlassen bevor man sich mindestens 20 min lang geflame etc. antuen muss.","replies":[{"poster":"OrangeBubble","date":"2015-10-28T01:09:15.508+0000","up_votes":4,"down_votes":0,"body":"Man kann nur mit nem ADC gewinnen. Das Thema hatte ich letzten in meinem Ranked Game, wo der Last Pick mehrmals sagte, dass er keine ADC aufn Acc hat und dann Brand für Botlane gepickt hatte. Und oh Wunder, die Botlane, wo der Brand Spieler und ich waren (nein wir waren nicht premade) hat als einzige Lane ausgeglichen gespielt. Die Selbsternannten Möchtegernbesserwisser haben allesamt reingefeedet und tdm noch die Dreistheit gehabt, den Brand anzuflamen, denn dieser hat ja keinen ADC gepickt. \n\nIch hab durchaus auch schon Spiele gewonnen, die nicht nach der Meta gingen und wo der Typ einfach wusste, was er zu tun hatte auf der Lane und wo einfach jeder mal still war und sich auf das Spiel konzentriert hat.\n\nWenn du so ein Problem mit Off-Meta hast, dann such dir ein 5er Premade Team. Da kannst ja dann diskutieren, dass jeder nach der Meta spielen muss.\n\nGenerell muss man kein \"Troll\" sein, nur weil man statt ADC eine Kata pickt. Wenn ihr mit Level 6 die Botlane abräumt und Kata den gegnerischen ADC zerstört und daraus snowballt und ihr so das Spiel fix beenden könnt, ja dann tut dir auch der fehlende ADC nicht weh.","replies":[{"poster":"HansMowlWurf","date":"2015-10-28T03:50:24.604+0000","up_votes":1,"down_votes":0,"body":"Mhm, ich habe dich gerade fuer MemyselftandBaal (ich hoffe ich habe den Namen richtig geschrieben) gehalten.\n\nSolche Geschichten sind irgendwie sein Markenzeicehn ;)","replies":[{"poster":"OrangeBubble","date":"2015-10-28T16:40:50.246+0000","up_votes":1,"down_votes":0,"body":"Ich kenn den Typen nicht mal :P","replies":[]}]},{"poster":"Crounty","date":"2015-10-28T09:03:52.127+0000","up_votes":1,"down_votes":0,"body":"Ich durfte mal full ap nunu mit nem trundle support spielen, auf der bot in nem ranked natürlich, hab gewonnen, lane und game :)","replies":[]},{"poster":"ÆonFox","date":"2015-10-28T02:52:59.470+0000","up_votes":1,"down_votes":0,"body":"Zudem giebt es immer mehr ADC´s auf anderen Positionen, Kindred im Jungel, Varus in der Mitte, eine Quinn Mitte oder Top oder auch ein Jayce auch gut Top oder Mid können das fehlen eines klassischen ADC sehr leicht ausgleichen, gerade da Mordebot auch aktuell ist.\nViele packen es nur nicht um die Ecke zu denken und verpassen somit neue Erfahrungen und Spielstiele die sehr gut zum erfolg führen können.\n\nBTM FTW^^\n\nHab z.B. letztens mit einem APC Teemo auf der Botlane ein Spiel gehabt, dank Lee im Jungl und mir mit Quinn Top war genug AD da und es hat sehr gut funktioniert, Doppelblind OP.","replies":[{"poster":"Eibert Rümmel","date":"2015-10-28T06:16:04.178+0000","up_votes":1,"down_votes":0,"body":"das war bestimmt ich :)","replies":[]}]}]},{"poster":"Lematique","date":"2015-10-28T04:05:36.701+0000","up_votes":2,"down_votes":0,"body":"Sorry, ich muss gestehen, dass ich dein Problem gar nicht erst verstehe.\nAlso das mit wann wer pickt.... ist vielleicht auch zu früh für mich. ^^","replies":[]},{"poster":"Eibert Rümmel","date":"2015-10-27T22:38:33.311+0000","up_votes":2,"down_votes":0,"body":"bin mittlerweile 3 kata Only spielern begegnet. Es war ein Genuss, das miterleben zu dürfen. Alle waren genial ob als Sup oder ADC. \nHast dich evt um eine tolle Spielerfahrung gebracht ;)","replies":[]},{"poster":"Veezey","date":"2015-10-28T01:03:20.816+0000","up_votes":3,"down_votes":1,"body":"Du hast einfach eine scheiß Einstellung.","replies":[]},{"poster":"Im a Papaya","date":"2015-10-28T10:52:09.285+0000","up_votes":1,"down_votes":0,"body":"Ich hab als adc mal nen kata support gehabt und das lief klasse. Sicher farmen bis level 6 und dann einfach auf kata warten und den adc Lasthitten. Das lief so gut das ich die Kata beim dc nicht reportet hab. \nNunu Top Lane wird auch viel geflamet, aber wenn ich dann als Ap Tank Nunu die Riven zum verzweifeln bringe und den Teamfight mit einer Ult drehe sind alle ruhig. \nWenn du etwas siehst das nicht der Meta entspricht kann es sehr gut sein das dein Gegner keine Ahnung hat wie er sich verhalten soll und extreme Fehler macht. Hör dir mal das lol Lied \"Ad Carry Maokai\" an von Instalock da wird besungen wie stark out of meta ist ^^","replies":[]},{"poster":"Alustus","date":"2015-10-28T09:30:05.516+0000","up_votes":1,"down_votes":0,"body":"Ich suche immer noch den Troll.\n\nIch sehe hier nur NoN-Meta, was aber nichts mit Trollen zu tun hat.","replies":[]},{"poster":"Patter91","date":"2015-10-27T22:40:36.144+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Invoker1990,realm=EUW,application-id=KYnfKGf0,discussion-id=o24PW2Er,comment-id=,timestamp=2015-10-27T22:32:15.451+0000)\n>\n> Hi \n> \n> ich habe grade 2 mal in Folge nen Draftmode verlassen m&uuml;ssen weil meine mitspieler teils beschissen bzw. gepickt haben was sie wollten.\n\nWillst du uns verarschen? Oder bist du echt so ein %%%%%%%%%, das anderen vorschreibt, dass sie NICHT das spielen dürfen, was sie wollen? VOR ALLEM in einem Normal?","replies":[{"poster":"HansMowlWurf","date":"2015-10-28T04:42:48.780+0000","up_votes":1,"down_votes":0,"body":"Ich frage mich bei wievielen bans du mitlerweile bist?! (also im Forum)\nMir kommt es so vor, als wuerdest du immer an den Forenbans vorbeigleiten ;D\n(da ich kurz vorm Perma bin, muss ich ja meine Zeit nocht etwas nutzen ;D)","replies":[{"poster":"Patter91","date":"2015-10-28T06:53:25.966+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HansMowlWurf,realm=EUW,application-id=KYnfKGf0,discussion-id=o24PW2Er,comment-id=00010001,timestamp=2015-10-28T04:42:48.780+0000)\n>\n> Ich frage mich bei wievielen bans du mitlerweile bist?! (also im Forum)\n> Mir kommt es so vor, als wuerdest du immer an den Forenbans vorbeigleiten ;D\n> (da ich kurz vorm Perma bin, muss ich ja meine Zeit nocht etwas nutzen ;D)\n\nTatsächlich erst bei 2 ;) Einer war vor... 2 Jahren oder so (1 Woche)? Der andere vor 2 oder 3 Wochen (1 Tag).","replies":[{"poster":"HansMowlWurf","date":"2015-10-28T07:46:00.306+0000","up_votes":1,"down_votes":1,"body":"Uff, unerwartet ;D\nOkay, weitermachen lol ;D","replies":[]}]}]},{"poster":"Elotüte","date":"2015-10-27T23:57:44.377+0000","up_votes":1,"down_votes":4,"body":"Ne das nicht aber es wird nen spiel mit geflame sein worauf ich keine lust hatte.","replies":[]}]},{"poster":"LZ Flame","date":"2015-10-28T00:01:25.993+0000","up_votes":1,"down_votes":1,"body":"Die Mehrzahl im Deutschen von Troll ist Trolle nicht Trolls","replies":[{"poster":"ÆonFox","date":"2015-10-28T00:19:19.986+0000","up_votes":1,"down_votes":0,"body":"Troll wie wir es nutzen kommt aus dem Englischen und nicht vom Fabelwesen, Trolls als Anglizismus ist durchaus ok.","replies":[]}]},{"poster":"Elotüte","date":"2015-10-28T19:52:09.557+0000","up_votes":1,"down_votes":1,"body":"Ich hatte grade nen Bard als Toplaner. \n\nWas machte er? Er flamte nur so über die ganzen ganks. \n\nWas andere in normals picken ist mir scheißegal solange sie nicht flamen.","replies":[]}]}