{"poster":"Elotüte","date":"2015-12-03T14:19:36.004+0000","title":"Wie spielt ihr euch warm","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":0,"body":"Hi an alle \r\n\r\nIch wollt wohl meinen tagessieg f&uuml;r heute machen. Erstes spiel habe aber ein problem. Ich f&uuml;hle mich grade irgendwie als w&uuml;rde ich anderen so richtig das spiel versauen wenn ich denn eins spielen w&uuml;rde. Meine H&auml;nde sind etwas kalt. L&ouml;sung daf&uuml;r habe ich schon gefunden heizung an und da aufw&auml;rmen.\r\n\r\nWie spielt ihr euch warm wenn ihr das gef&uuml;hl habt ihr seid absolut schei&szlig;e immoment?\r\n\r\nIch habe das schon &ouml;fters gehabt und erstelle mir dann immer ein spiel mit 5 bots und spiele dann 1 gegen 5. Wichtig hierbei ist es nicht einfach zu spielen sondern sich ziele zu setzen. \r\n\r\n1. M&ouml;glichst viele pentas machen. \r\n2. Keinen Inhibitor verlieren \r\n3. Nicht Sterben\r\n\r\nOder ich spiele ein paar runden ARAM. :)","replies":[{"poster":"Bakugo Katsukí","date":"2015-12-03T14:23:42.438+0000","up_votes":6,"down_votes":0,"body":"ich starte einfach soloq","replies":[{"poster":"Tokogawaruf","date":"2015-12-03T14:49:00.784+0000","up_votes":3,"down_votes":0,"body":"Nicht vergessen einen Champ \"First time\", sogar ohne über die Fähigkeiten gelesen zu haben, zu locken, und dann dies 2 Sekunden vor Spielbeginn zu verkünden.","replies":[{"poster":"roseBRA","date":"2015-12-03T16:00:32.278+0000","up_votes":3,"down_votes":0,"body":"Während das Spiel lädt einfach das erste Ergebnis bei Google aufrufen bezüglich: XXX-Champion Guide.\nEgal zu welchem Patch der sich bezieht.\n\nDem folgen und die Pentas kommen noch vor den Minions.","replies":[]},{"poster":"Tungsteel","date":"2015-12-04T09:55:48.496+0000","up_votes":1,"down_votes":0,"body":"Und am besten dann noch fragen: Is this champ ap or ad?????\n\n:)","replies":[]}]}]},{"poster":"AyRe CoNteMpT","date":"2015-12-03T14:23:46.910+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Sirius00","date":"2015-12-03T15:55:27.552+0000","up_votes":3,"down_votes":0,"body":"Ich hoffe jetzt einfach mal, dass du entweder ein totaler Ausnahmefall von Toxic Player in Dia bist oder das unglaublich schlecht getrollt ist\n\nMfG Sirius00{{champion:15}}","replies":[{"poster":"roseBRA","date":"2015-12-03T16:07:24.597+0000","up_votes":2,"down_votes":0,"body":"Ich habe 2 Freunde die mir irgendwann mal verraten haben dass die auch LoL Spielen und beide waren Dia 1-3.\nAls ich nach einem Tipp fragte kam genau das was AyRe gesagt hatte: Versuch einfach nicht zu sterben und du wirst sehen dass der Rest teils von selbst kommt.","replies":[{"poster":"Sirius00","date":"2015-12-03T20:17:27.303+0000","up_votes":1,"down_votes":0,"body":"Ich habe nicht vom \"nicht-sterben\" geredet, sondern von seiner Ausdrucksweise, welche nicht sehr nett war.\n\nMfG Sirius00{{champion:15}}","replies":[]}]},{"poster":"AyRe CoNteMpT","date":"2015-12-03T16:02:37.097+0000","up_votes":1,"down_votes":1,"body":"oder du akzeptierst einfach die realität.  is doch immer schön, noch ne dritte option zu haben ; )","replies":[]}]}]},{"poster":"roseBRA","date":"2015-12-03T16:05:23.007+0000","up_votes":2,"down_votes":0,"body":"Für mich persönlich und meiner Erfahrung nach sind die Dinge die du tust genau das Falsche.\nSowohl bei Starcraft als auch bei UT2k4, CS, LoL, Magic.. keine Botgames oder spielfremde Ziele.\n\nPentas kannst du sowieso kaum beeinflussen.. da stehen halt immer nur die Sterne richtig.\nARAM oder 3er Map haben nichts mit dem 5v5 zu tun und verwaschen nur den Eindruck des richtigen Spiels.\nBots bewegen sich komplett anders als Spieler und du bewirkst damit nur dass du darauf hin keine Skillshots mehr triffst. (Übertrieben gesagt)\n\nIch habe in all den eSports-Spielen die ich bisher gespielt habe NIEMALS die Kampagne gespielt, gegen Bots gespielt (außer in SC2 für BO reinhämmern) oder Funmaps gespielt. Die einzigen Funmaps die ich gespielt habe, waren Trainingsmaps um gewisse Aspekte zu lernen wie zB Mental Checklist bei den SC2 Zerg.\n\nDas einzige was ich mache ist: einfach spielen.\nDer SC2 spieler Honor zB fängt auch einfach direkt mit einem Ladder-Game an. Einfach direkt rein in's Wasser und zack ist auch die Rübe an.\nEin Botgame würde dich eher noch weiter einlullen.\n\nWie gesagt: mein Eindruck.\n\n**Ich habe ein wenig in dem Thread hier gelesen und habe den Eindruck dass dieser Beitrag hier vielen helfen könnte:**\nhttp://wiki.teamliquid.net/starcraft2/Dealing_with_anxiety\n","replies":[]},{"poster":"xXTheFalloutXx","date":"2015-12-03T21:56:32.672+0000","up_votes":1,"down_votes":0,"body":"Nun ich vorbereite mich auf ein Ranked game indem ich simpel ein 5vs5 Spiele,\nnormalerweise mit meinem Main oder Ausnahmen um diese, falls ich eine Position bekomme die ich nicht so gut kann, zu trainieren.\nWenn ich merke das ich heute schlecht spiele oder kaum laune habe spiel ich erst keine Ranked, liegt aber auch dran das ich pro tag kaum mehr als 3-4 Matches spiele. ^^","replies":[]},{"poster":"xKabutomaru","date":"2015-12-03T15:03:22.775+0000","up_votes":1,"down_votes":0,"body":"Ich spiele immer im Freien Spiel gegen Bots oder ein Kooperatives Spiel, um mich warm zu spielen oder wenn ich weiß das ich keine 30-45 Minuten zur Verfügung habe.","replies":[]},{"poster":"Tokogawaruf","date":"2015-12-03T14:51:03.426+0000","up_votes":1,"down_votes":0,"body":"Hab IMMER ein schlechtes Gefühl die ersten 10-15 Minuten des ersten Normals am Tag (War noch nie Ranked). Vorallem wenn ich meine Lieblingsposition ADC spiele. Das kalte Hände Gefühl kenne ich auch nur zu gut. \nMir hilft es enorm wenn mein Bester Freund mit von der Partie ist. Da geht aller leichter von der Hand.","replies":[]},{"poster":"Phirippu","date":"2015-12-03T14:30:13.191+0000","up_votes":1,"down_votes":0,"body":"Ich spiele halt mind. ein game vor rankeds...\nWenn ich das schlecht spiele noch eins bevor ich mit rankeds anfange oder spiele an dem tag nur noch normals.","replies":[]},{"poster":"Nephirelle","date":"2015-12-03T14:25:31.573+0000","up_votes":1,"down_votes":0,"body":"Hm... ehrlich gesagt spiele ich gar nicht, wenn ich mich nicht 100% in Laune dafür fühle.\nUnd wenn ich zwar Laune habe, aber zum Beispiel von der Arbeit noch schwächele, dann versuche ich erstmal so zu entspannen - heiße Dusche oder so und schön schluffige Klamotten :D\nAnsonsten ist ja auch der Coop-Modus 'ne ganz nette Sache, wenn man nicht gänzlich allein auf dem Schlachtfeld rumeiern möchte. Da kann man anderen auch eigentlich nicht groß was versauen.","replies":[]}]}