{"poster":"Detava","date":"2015-06-18T00:47:26.994+0000","title":"jinx merece ser nerfeada? cuantos adc le ganan linea con facilidad? cuantos adc aportan tanta tf?","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"{{champion:222}} {{item:3057}}","replies":[{"poster":"LGBT Valentina","date":"2015-06-18T01:55:28.019+0000","up_votes":4,"down_votes":1,"body":"jinx sigue en god tier\nlos nerf que le hicieron fueron pateticos\nel de la R, a rango mele, osea 0 a 150 de rango si es un nerf\npero a rango de metralleta solo le bajaron 50 el daño y el 25% siguio intacto\n\na la Q, tampoco es el gran nerf, el AS que gana es simplemente OP para conseguir objetivos rapidos, en las TF se usa poco, para que 525 de rango y mucho AS, cuando tenes el 3 rango mas alto de los ADC y tus ataque son en area y hacen un bonus de daño que tambien se aplican a los criticos\nno digo que no se use la minigun en TF, pero sean sinceros...\n\ntiene un early dentro de todo pobre, siempre lo tuvo, pero sigue op\nashe esta mejor que jinx, pero tampoco es la gran diferencia\n\n\nlos nerf, fueron mas a la gente que pedian un nerf\npracticamente lo que hicieron fue bajarle TODO el daño y AS de la descripciones y el daño-as apenas se lo tocaron\n\n\ntalvez la vuelvan a nerfear, pero el proximo nerf es probable que le peguen duro\nsi le tocan la pasiva y el carapescado, en las TF se va a notar\nsi se pudren (cosa que DUDO MUCHISIMO, tienen q hacer varios cambios en general para que la nerfen y cuando digo general, es a items-meta-champs) el carapescado la va a comer duro","replies":[{"poster":"NGreppi","date":"2015-06-18T02:03:28.772+0000","up_votes":1,"down_votes":0,"body":"Exacto, este pibe tiene toda la razon. Los nerfs que se vinieron estos parches son para que la gente piense que esta \"nerfeada\" y que se lo merecia porque esta op. Es absurdo como un adc puede tener zoneo, pokeo, cc y mucho aoe, si Vayne tiene late, Jinx pff.","replies":[{"poster":"LGBT Valentina","date":"2015-06-18T02:14:10.263+0000","up_votes":1,"down_votes":0,"body":"Haber tampoco asi, es un hyper carry, pero no se si tan a ese limite\npero realmente, si sabes kitear con jinx, tenes un peel decente (si es que tienen asesinos) y te paras bien\nque te importa, por que si pensas, es onda twitch-kog'maw\npero la W de jinx escala de 10, la E le va un buen zoneo y la Q, no lo vuelvo a repetir\nla pasiva en las TF, es un asco no me digan que no, es un escape o un follow tremendo\n\nrealmente la nerfearon (no mucho), pero no le nerfearon realmente su poder real, no tocaron su fortaleza ni se acercaron a eso","replies":[{"poster":"NGreppi","date":"2015-06-20T00:05:14.157+0000","up_votes":1,"down_votes":0,"body":"No lo considero un hyper carry ya que si no tenes un buen peel o por lo menos un team iniciador como que no vas a aportar lo que una Vayne podria, aun asi si sabes kitear, los asesinos te deletean en 2 segundos.","replies":[]}]}]}]},{"poster":"FelipeTwister","date":"2015-06-18T01:51:34.761+0000","up_votes":1,"down_votes":2,"body":"Ya la nerfearon 2 veces en poco tiempo. Vayne, Draven y Lucian la violan, y cualquier otro que lo sepa usar tambien. Ya no es el mejor champ. Nerfeame a Zed y el ulti de Ekko.","replies":[{"poster":"NGreppi","date":"2015-06-18T02:05:21.585+0000","up_votes":1,"down_votes":0,"body":"Claro que si campeón, un Lucian con 500 de rango ganarle a un adc con 600 (si no me equivoco) con los cohetes, Vayne puede ser, depende como juego la Jinx en early game, si va agresivo le termina ganando y Draven siempre le gano en early como a la mayoría de los adc.","replies":[{"poster":"NiggPowah","date":"2015-06-18T02:10:38.684+0000","up_votes":1,"down_votes":0,"body":"Un Lucian que la pokee como es debido la deja en silla de ruedas antes de lvl 3","replies":[{"poster":"NGreppi","date":"2015-06-20T00:03:27.011+0000","up_votes":1,"down_votes":0,"body":"Lucian pokeo? La Q es bastante facil de esquivar, tiene 500 de Rango con basicos, la W no hace daño. Ah y me equivoque, es 700 el rango que llega con los cohetes con la Q al lvl 5.","replies":[]}]}]}]},{"poster":"Neoburstx","date":"2015-06-18T16:56:35.246+0000","up_votes":1,"down_votes":0,"body":"{{champion:42}} {{champion:429}} {{champion:15}}","replies":[]},{"poster":"NelsonFT","date":"2015-06-18T15:34:40.185+0000","up_votes":1,"down_votes":0,"body":"No se, pero yo jugando con Sivir le bloqueo todas las W que se te puedan ocurrir. Primero uso la Q para desgastarla y después hago un bait para llevarme el maná con la E... No es una línea tan difícil. Solo que jode un poco con el rango del Lanzacohetes!","replies":[]},{"poster":"XVII The Star","date":"2015-06-18T14:19:06.010+0000","up_votes":1,"down_votes":0,"body":"Pero si jinx está diseñada desde la pasiva hasta el ult para la tf.\nCualquier adc le gana 1vs1","replies":[]},{"poster":"gambito700","date":"2015-06-18T03:52:57.438+0000","up_votes":1,"down_votes":0,"body":"para el meta actual esta bien.","replies":[]},{"poster":"LaReinaPingüino","date":"2015-06-18T01:47:45.977+0000","up_votes":1,"down_votes":0,"body":"ya la han nerfeado demasiado","replies":[]},{"poster":"RNGesus","date":"2015-06-18T01:40:20.713+0000","up_votes":1,"down_votes":0,"body":"Pues jinx tampoco es tan fuerte , en late si es una bestia ,pero no podes dejar que se fedee o dejarla haciendo daño","replies":[]},{"poster":"Uchih4 M4dara","date":"2015-06-18T00:56:30.585+0000","up_votes":1,"down_votes":0,"body":"si jinx recibe un nerf mas quedara inutil, se le gana con vayne, dravn e incluso un buen lucian le gana pero depende de tu habilidad","replies":[]}]}