{"poster":"iDeathHearth","date":"2017-06-04T15:43:33.614+0000","title":"Cual servidor es más difícil ¿LAS o LAN?","subforum":"Charlas Generales","up_votes":2,"down_votes":10,"body":"Quiero sus opiniones frente a esto. Yo soy servidor de Las pero mi ping es mucho mas alto que Lan (No se, lo veo raro ya que soy de Latinoamérica Sur) Pero la cosa es que en todo los 6 meses que voy jugando, síempre en Las he visto que es más fácil ganar y/o dominar tu línea. PERO en Lan que llevo jugando hace 2 semanas, primero mi ping va menos y claramente es mejor, pero he visto que es más difícil que Las. Ya que si siendo nvl 1 o 5, la mayoría juega como si fueran nvl 20 a más. Solo es una duda, por favor sean serios y cuenten su experiencia si han jugado en los dos o uno de ellos","replies":[{"poster":"9081913DEL1","date":"2017-06-04T16:00:46.722+0000","up_votes":5,"down_votes":0,"body":"No te parece muy relativo la dificultad jugando en un parametro de lvl 1-30?\n\nYo creo que no podriamos afirmar nada dentro de esa escala.\nSaludos!","replies":[{"poster":"Gretta Thunberg","date":"2017-06-04T18:03:00.239+0000","up_votes":1,"down_votes":2,"body":"actualmente LAN tiene mejor nivel que LAS no lo digo yo lo dicen las estadisticas, Lyon gaming se paseo a isurus como si fueran broncecitos, no es que estuviera peleada la partida lyon no quizo terminar la partida al minuto 15 por que iba a ser demaciado humillante, estaban disfrutando matar a la gente de isurus con eso te digo todo","replies":[{"poster":"9081913DEL1","date":"2017-06-04T18:13:02.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FNC Rekkess,realm=LAS,application-id=v7qsfXsE,discussion-id=EfjRgFyX,comment-id=00010000,timestamp=2017-06-04T18:03:00.239+0000)\n>\n> actualmente LAN tiene mejor nivel que LAS no lo digo yo lo dicen las estadisticas, Lyon gaming se paseo a isurus como si fueran broncecitos, no es que estuviera peleada la partida lyon no quizo terminar la partida al minuto 15 por que iba a ser demaciado humillante, estaban disfrutando matar a la gente de isurus con eso te digo todo\n\nEsos no son estadisticas, eso es un resultado de un equipo que se preparo y de otro que no supo responder. A ver conozco a varios y aun asi no soy fan de isurus, pero no es que no tengan nivel. \nSeamos realistas, como representantes de las lo que tienen es sponsors, no son ni de cerca lo mejor del servidor.\n\nSaludos!","replies":[{"poster":"Gretta Thunberg","date":"2017-06-05T03:40:02.129+0000","up_votes":1,"down_votes":0,"body":"Es la unica forma de demostrar que servidor tiene mas nivel, puedes comparar la cantidad de bronces en cada region pero yo fui bronce la temporada pasada por que no rankee eso pasa mucho. \n\nEn este momento LAN tiene mejor nivel que LAS como en algun tiempo pasado LAs tuvo mejor nivel que LAN.\n\nLo cierto es que al lado de otras regiones emergentes se quedan no un escalon mas abajo si no que 3 o 4","replies":[]}]}]}]},{"poster":"Hayato","date":"2017-06-04T16:07:56.773+0000","up_votes":3,"down_votes":0,"body":"Yo he jugado mucho tiempo ne ambos servidores y no noto diferencia, flammean igual, manquean igual, trollean igual.","replies":[]},{"poster":"Nitrobacter","date":"2017-06-04T16:25:52.180+0000","up_votes":2,"down_votes":0,"body":"Cuando no sos siquiera lvl 30 te emparejan con cualquier cosa (bronces , oros , diamantes , etc).","replies":[]},{"poster":"Texter Redrum","date":"2017-06-04T18:44:02.648+0000","up_votes":1,"down_votes":0,"body":"Estos lvl 19 me dan tanta risa JAJAJAJAJAJAJA","replies":[]},{"poster":"Sir Crucifix ll","date":"2017-06-04T18:01:48.157+0000","up_votes":1,"down_votes":0,"body":"Todos los servidores son iguales","replies":[]},{"poster":"RAYOT GUEIMS","date":"2017-06-04T17:22:35.966+0000","up_votes":1,"down_votes":0,"body":"Jugué en LAN desde la Alpha hasta hace 5 meses apróx. por el problema del ping alto, mi trayectoria durante todas las seasons en ranked fue desde Bronze hasta Diamante, y ahora estoy en LAS (con mejor ping) y por ahora estoy en Platino 5 (me pusieron en Oro 1, no sé como son las ligas inferiores). Debo decir que LAS es mucho más fácil que LAN desde lvl 1-30 (Los 2 teniendo gente nueva y smurf + experiencia personal, no digo que esto aplique para todos) y luego respecto a los rankeds, LAS y LAN son exactamente lo mismo, gente pro, gente buena, gente promedio, gente mala, gente troll, gente afk, gente tóxica y flamer al mismo nivel en ambos servers.","replies":[]},{"poster":"Aprobe Algebra","date":"2017-06-04T16:03:47.972+0000","up_votes":1,"down_votes":0,"body":"Son iguales... Talves te esten poniendo con gente con cuentas smurfs o con gente de nivel alto como dices.. En caso de lo segundo ten en cuenta la diferencia entre maestrias y esas cosas. Yo tambien he jugado en lan asi como en euw .. Y no me ha parecido que fuese mas dificil ni mas facil.. Excepto en euw cuando comenzaba que habia puesto que no tenia experiencia en este tipo de juegos xD. Pero luego comenzo a ponerme con gente que al menos sabia que items ponerse. Y asi hasta colocarme con gente que si sabia.","replies":[{"poster":"iDeathHearth","date":"2017-06-04T16:13:46.872+0000","up_votes":2,"down_votes":2,"body":"Pues mi caso es igual xd. En 2 partidas vi a un Nasus support, La cosa es que a mi siempre me tocan con otras personas que 1 o 2 no saben como jugar, mientras los rivales todos saben. Yo lo noto raro o no se xd, Pero es que siempre mi equipo uno es malo y el equipo rival ninguno","replies":[]}]},{"poster":"Americans","date":"2017-06-04T15:55:53.971+0000","up_votes":1,"down_votes":0,"body":"Son iguales, y como no hay ninguna estadística que se pueda usar mas que la población en cada server, que en ambos son iguales, esta discusión es simplemente sobre opiniones.","replies":[]}]}