{"poster":"Perfect Summoner","date":"2014-12-19T21:29:56.872+0000","title":"Ranged Junglers","subforum":"Gameplay","up_votes":4,"down_votes":0,"body":"Seeing as the new jungle monsters, Summoner's Rift Visual Update, and all of the preseason changes have been out for a little while now, I think this is a good time to talk about ADCs in the jungle. I will probably get quite a bit of hate for this post, but I want to get the community's thoughts on this idea. \r\n\r\n*Note: I only have extensive experience playing Vayne in the jungle, but over the coming weeks, I plan to test out other marksmen as well. \r\n\r\nWhy I believe ranged junglers (mostly ADCs and Gnar) could work:\r\nWe all know the new jungle hits hard. Most junglers after their level three clear either have to go back, or are too low to gank, the obvious exceptions he being sustain junglers like Warwick, Nunu, Fiddlesticks,  etc. As a ranged junglers  you can kite the melee jungle camps, and if you stand in the right place, they won't attack you, but they also won't reset for a little while. \r\n\r\nMy experience with Vayne jungle:\r\nIn one word, triumphant. After your first clear, even with 1 pot left in your inventory, you can have 80 or 90 percent health if you kite the monsters correctly. Then, because you have higher health than the enemy jungle, you should be able to gank without fear of a strong countergank. Using your condemn, you can launch the enemy top laner into the wall, or maybe into your teammate. Usually, I am able to get a successful level 3 gank (killing the enemy laner)  80 percent of games. \r\n\r\nMy favorite  part about Vayne (and ADCs in general when jungling) is your itemization choices. From my experience, the best item is the one which gives you Chilling Smite. Not only does it make your smite do damage, the 50 percent slow (20 percent movement  speed steal on PBE) greatly increased your kiting and ganking power. \r\n\r\nJust an idea that I plan on testing, but if you start your top huff, especially on blue side, you can jump over Baron pit wall (using an ability like Ezreal's E, Corki W, etc.),  you should be able to k steal their buff and get off a successful level 2 gank top if they are overextended. \r\n\r\nI'm not sure how you guys feel about this, but I generally feel that I do pretty well until it gets to mid game, although most of my difficulty comes from my terrible positioning on all ADCs. Just let me know what you think. Any constructive criticism is appreciated, but pleas  don't tell me that other junglers do their job better. Although it  may be true, the point of this innovation is exactly that: trying something new. \r\n\r\n**(Pretty long) TL;DR: I personally feel that Vayne and other ADCs in the jungle have very high potential due to their ability to kite jungle monsters without them resetting, giving them unrivaled sustain. Also, with a wall jump ability,  you could jump over baron,  steal the enemy buff, and level 2 gank top. All of these are experimental ideas,  so please don't say that other junglers are better.  Im just trying som thing new and would like the community's opinion. **","replies":[{"poster":"Perfect Summoner","date":"2014-12-19T21:32:47.939+0000","up_votes":2,"down_votes":1,"body":"I forgot to mention that in order to effectively pull this off, you would need tanks in the top lane and support roles because there will not be one in the jungle.","replies":[]},{"poster":"Zair Umbras","date":"2014-12-20T09:02:59.273+0000","up_votes":1,"down_votes":0,"body":"Personally, when I returned to League after some silliness IRL, my first games were actually with Gnar in the jungle and that's kinda how I've played him on a number of occasions. He does work and does it incredibly well, especially since he does have amazing base damages, a Q that slows and if you time your passive for a gank, you have a Q to slow them, your W to stun, your E to close gaps, and after your R, you have your R to toss them from that turret, to your turret, or slam them into a wall for the stun. Gnar is unlike actual marksmen though. He can get his jungle item, then a BotRK, and then build pure tank after that and be not only a monster in his own jungle with his huge AoE damage, incredible single target, and his high mobility, but he brings all of that to the lanes and to the enemy jungle, something a lot of ADC's can't do. What a lot of people forget about when it comes to ADC's is their incredible need for items. A jungle can't be an item-hungry burst machine. They have to able to rely on their bases. \n\nGraves can be a monster, but he needs big AD items to accentuate his high ratios and needs the CDR and mana to spam them properly for actual clears. \n\nCait is a mana-whore and moves far too slow to gank. Out of the question. \n\nBruiser Vayne is highly possible due to how she scales with both AD and AS. An old friend of mine used to run bruiser AS Vayne and still does from time to time where you would simply get AS items and some tankiness and abuse your passive. BotRK and a Devourer with tank items afterwards would be a murder machine. Her passive would keep her on target, especially when you pop your R. Your R gives you the AD you need, and you have the AS to murder people with your W. Obviously this build is very W reliant and would require you to play very differently. \n\nEzreal is out of the question since he has two abilities that can help him jungle. His W is completely useless in the jungle. He has no mobility outside of his E and he's more of a poke-champion. He'd be pretty useless in the jungle since he provides nothing.\n\nQuinn is highly viable. Her potency with a Warrior enchant, BotRK, and a LW and then tanky items would sky rocket her through the roof. Her AoE blind, her E that'll stutter the mobs and interrupt attacks, her passive and W boost her damage, and her R gives her incredible ganking potential. She was used as an ADC, Jungler, and Top on release and still does wonderfully on all of these now. She's got CC, a Blind, damage, and can build Bruiser.\n\nTwitch is iffy. He's always been able to jungle. Ever since his release, people have been abusing his stealth as part of jungling to scare the bejeebus out of people with his incredible damage and high mobility. He can work, but his team needs a really tanky top and there has to be CC in every lane, much like what a normal assassin jungle would require.\n\nJayce in the jungle is not only troll, but it's also hilarious. He really is NOT meant to be here, but for the sake of the Lulz of it all, he needed to be mention. He does have high clear speeds, he can Q+E combo poke as his entrance, Q at the target with his W going in hammer mode and then E them at your partner. It can work, but much like Twitch and other damage-building junglers, you need tanky, CC-based tops and supports to make up for his squishiness. \n\nCorki is a no. Much like Ez, he provides absolutely nothing to a gank, has very limited damage in the jungle, is a mana whore when forced to spam his abilities, and his main item is a Trinity, which is very expensive on a jungler's budget.\n\nDraven can jungle, but why would you jungle Draven? Draven doesn't waste his time hitting mobs. He wants to be admired, to be loved, and steal every single kill. How can he steal the kill if he's gotta take his own red? That's unDravenlike. That's now a word. Patented. \n\nMiss Fortune has her passive to make her camp-to-lane movements quick, but her E doesn't last very long to do much to jungle creeps, her Q has to be angled too perfectly for it to maximize damage, and her gank potential is pretty crap since she lacks CC and won't be clearing her camps very quickly until she's an item or two in.\n\nTristana is... She's got damage, but due to the nature of her needing levels and her dire need for items to do damage makes her a bit lacking. I could see AP Trist working since those level 6 ganks would be INSANE. Come in from the back, W+E+R them from behind to force them to flash away or die. Her clears would suck though due to her low damage. And yes, I know, her bases are high, but her CD's are HUGE, so her overall DPS is low while her poke is high.\n\nVarus and Kog'Maw move at turtle speeds and are mana whores when they have to spam abilities. Both have poor early games outside of their poking ability and the jungle is unforgiving on squishies. \n\nJinx could be funny, but her E would be useless outside of ganks. Her damage early is pretty lackluster outside of her poke. Her ganks would also suck due to her lack of mobility like Kog and Varus.\n\nLucian would be kinda funky. I mean, I would expect a Devourer on him for his passive to abuse. It could work, but his lack of CC would make it a bit hard to actually gank.\n\nTeemo is hilarious. The Goal of Teemo is to take your buffs, then head to their Wolves or Gromp if they started blue, Wraiths if they started Red, and sit there for a moment, wait for them to come take them as they respawn and murder him. I recommend running Blue smite and Ignite to guarantee kills. I also recommend using a vision trinket so you can ward their buffs and sit in rather odd places where they're unlikely to check and wait for them to start the buff. As it gets low, and thus them getting low, blind them, go for the kill. Smite the buff if needed. Try to avoid doing this at red since they can smite red and heal off it and possibly get away because of it. I do not recommend playing Teemo jungle, but if you're wanting to try something hilarious, try out AP Counter Jungle Teemo. Go pure AP. Magus enchant, DFG rush and then what ever fits your fancy after that. Watch your enemies explode and bitch at their laners for not helping them.\n\nSivir has good clear speeds, amazing poke, an even better initiation, can benefit incredibly well from a Warrior Enchant and has her E to counter possible gank-stoppers like Syndra's E, Ahri's E, etc. She also comes with her innate ability to run at god speed. Like many other CC-less junglers, make sure your team has CC in the lanes.\n\nKalista is.... weird. She can jungle, especially with her passive, but you'd have to have communication with who ever wants to be thrown at the enemies, which is exactly who you'd be ganking for all game long. If your top is a highly aggressive Renekton, Gnar, or something of that sort who likes to be in the enemy's face and can mix will with you, then I'd say go for that and get fed off top. Her E also works well as a secondary smite. A devourer enchant or rushing a BotRK after choosing your smite will definitely help amplify clear speeds, especially if you level your E first.\n\nAshe is bad. Her laning phase is already iffy and her clear speeds since she has ONE damage ability on a rather long CD early on, plus her E's passive wouldn't scale well with the jungle. Her R would make for good ganks and timing her passive would be a nice way to start a gank, but her clear speeds would be like Shaco who only has his Q. It would suck.\n\nIf I left any out that are considered Marksman, go ahead and mention it and I'll try it out. I've pretty much tried everything I've mentioned. I had far too much time on the PBE while waiting for S5 preseason changes. >>","replies":[]},{"poster":"Bears Dont Care","date":"2014-12-20T04:56:52.799+0000","up_votes":1,"down_votes":0,"body":"I think its stupid really, ranged junglers should be prey to the same mechanics as melee junglers.\nIf Riot wants to stop level 3 ganking, then they should deal with this current problem rather than let it remain so prevalent.","replies":[]},{"poster":"Narasimha","date":"2014-12-20T04:50:59.938+0000","up_votes":1,"down_votes":0,"body":"It CAN work, but it puts your team at some huge disadvantages.\n1. You'll be mostly afk farming. None of the adcs can gank that well. Chilling Smite only helps if you have cc to augment it, otherwise its more of a nuisance. Twich can do it decently, but he lacks the cc on his own to have map pressure. And if you're going to be afk farming anyway, you may as well pick a champion that really benefits from it (Noc, Yi, WW, etc). \n2. They all clear slowly. Lack of AOE clears means their speed is much slower than most common junglers. This in turn leaves them open to be counterjungled.\n3. (Mostly a Solo Que issue) You're HOPING your team can make up for it. If your top laner and support don't tank up, you'll have a team of squishies waiting to be eaten up.","replies":[]},{"poster":"AccountaBilabudy","date":"2014-12-20T00:29:54.541+0000","up_votes":1,"down_votes":0,"body":"No one in the game ganks better than Twitch.  MAYBE Shaco.","replies":[]},{"poster":"Troy242621","date":"2014-12-19T23:00:40.798+0000","up_votes":1,"down_votes":1,"body":"I'd imagine Twitch jungle would be the best ADC jungler. Stealth for ganks, with his DoT and Expunge burst his clears wouldn't be tremendously bad. Great ganks. If I had to jungle an ADC, I'd pick him. Used to jungle him anyways, back when FF was first released, and he was an absolute monster.\n\nI'd have to test it myself, but assuming you had tankiness and CC elsewhere in your team composition, AND needed more attack dmg, AND your team doesn't mind a double ADC comp, it might work. I plan on testing it now, because I loved my Twitch jungle.","replies":[]},{"poster":"AccountaBilabudy","date":"2014-12-19T22:51:48.542+0000","up_votes":1,"down_votes":1,"body":"Twitch jungle is beast mode","replies":[]}]}