{"poster":"Bears and Bulls","date":"2019-10-21T07:06:09.653+0000","title":"Permabanned carryover","subforum":"Player Behavior","up_votes":1,"down_votes":5,"body":"Is there a way to carry over in game settings (or copy paste) from my permabanned accounts? I'm tired of constantly having to set them up every couple days it takes 5-10 mins per account. Just a small annoyance but one none the less.","replies":[{"poster":"Articus43","date":"2019-10-21T08:55:47.744+0000","up_votes":1,"down_votes":0,"body":"To answer your question: No. \n\nI'm also going to lock the thread because \"stop getting permabanned\" is not an appropriate response to the question. Also because the question itself isn't even a Player Behavior topic and should have been posted in GD or AtC.","replies":[]},{"poster":"Jhins Girlfriend","date":"2019-10-21T07:18:07.680+0000","up_votes":8,"down_votes":0,"body":"Maybe don't get permabanned every few days...?","replies":[]},{"poster":"DuskDaUmbreon","date":"2019-10-21T07:11:16.750+0000","up_votes":6,"down_votes":0,"body":"Solution: Stop getting permabanned constantly.","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:13:29.364+0000","up_votes":1,"down_votes":1,"body":"easier said than done\n\nyou can behave for hundreds of games and troll a single time or drop one slur and youre gone\n\ntried many times... take this account for instance, I was clean for 19 levels and one game later im gone for two weeks","replies":[{"poster":"DuskDaUmbreon","date":"2019-10-21T08:29:21.523+0000","up_votes":1,"down_votes":0,"body":"No. It's done just as easily as said.\n\nHundreds of games. A single warning is all I've had.\n\nMaybe if you have that much trouble keeping your temper in check you should try a therapist.","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:32:47.398+0000","up_votes":1,"down_votes":1,"body":"It has nothing to do with temper lol, you guys always make assumptions. All it takes is the wrong trigger words or phrases and typing too much irrelevant nonsense it chat. Every time I get banned I'm completely calm or in a good mood just calling people shitters or sister fuckers. Not every ban is some pc nerd smashing his keyboard into his monitor from his moms basement.","replies":[{"poster":"Sinful Succubus","date":"2019-10-21T08:40:40.651+0000","up_votes":2,"down_votes":0,"body":"so you'd rather make a new account every time someone annoys you instead of hitting the mute button and keeping your account?\n\ncool hobby you got there!","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:45:15.394+0000","up_votes":1,"down_votes":0,"body":"I mean yeah once you lose your first account you go into a mindset of having nothing to lose. Am I going to play seriously again to regain the last 3-4 years worth of progress? Obviously not. So I treat accounts like they are disposable now because that's exactly what they are when you have nothing of value to lose on the accounts. Not even trying to be edgy, that's just the reality of how permabans work. They are designed to keep you away, so when you actually keep playing and make new accounts its breeds a care free mindset. ","replies":[{"poster":"Sinful Succubus","date":"2019-10-21T08:51:06.520+0000","up_votes":1,"down_votes":0,"body":"if you had a care free mindset, you wouldn't care enought to flame anyone anymore\n\nbut here you are getting triggered every single time over the smallest things. you're not so much edgy as you are full of it","replies":[]}]}]}]}]}]}]},{"poster":"Hotarµ","date":"2019-10-21T07:24:07.073+0000","up_votes":4,"down_votes":0,"body":"Alternatively, you could just stop copping permabans lol","replies":[]},{"poster":"GreenKnight","date":"2019-10-21T07:18:19.101+0000","up_votes":3,"down_votes":0,"body":"Making a new account after permad is a \"small annoyance\"? Are you just bragging about your loser streak?","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T07:37:01.226+0000","up_votes":1,"down_votes":2,"body":"no I figured people would think im trolling, I actually was curious cause its annoying.","replies":[]}]},{"poster":"KFCeytron","date":"2019-10-21T08:16:50.899+0000","up_votes":1,"down_votes":0,"body":"You take no personal responsibility for annoying people _constantly_, but one small annoyance to you needs to be resolved?","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:17:56.052+0000","up_votes":1,"down_votes":1,"body":"I take full responsibility for my actions, I just disagree with the rules so I choose to ignore them at my own expense. And it doesn't need to be resolved I was just curious if they have ways to transfer settings between accounts. Wants and needs are two different things. \n","replies":[{"poster":"KFCeytron","date":"2019-10-21T08:20:44.374+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bears and Bulls,realm=NA,application-id=ZGEFLEUQ,discussion-id=7l4w6jJF,comment-id=00040000,timestamp=2019-10-21T08:17:56.052+0000)\n>\n> I take full responsibility for my actions, I just disagree with the rules so I choose to ignore them at my own expense.\n\nYou do whatever you want, and you think anyone else will do whatever you want?","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:24:43.669+0000","up_votes":1,"down_votes":1,"body":"what are you talking about? I'm just asking If there's a feature to transfer settings between accounts. Its a request not a demand.","replies":[{"poster":"KFCeytron","date":"2019-10-21T08:47:47.981+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bears and Bulls,realm=NA,application-id=ZGEFLEUQ,discussion-id=7l4w6jJF,comment-id=0004000000000000,timestamp=2019-10-21T08:24:43.669+0000)\n>\n> what are you talking about? I'm just asking If there's a feature to transfer settings between accounts. Its a request not a demand.\n\nAllow me to rephrase.\n\nWith your attitude, why do you think anyone would lift a finger to help you?","replies":[{"poster":"Bears and Bulls","date":"2019-10-21T08:52:08.107+0000","up_votes":1,"down_votes":0,"body":"I have no attitude, don't assume my gender through text please, I think that could be considered hate speech in 2019. Jokes aside, it has nothing to do with helping me. The feature would be available to all players if it existed. Did you even real my initial post? I wasn't asking for help or a new feature to be added. I was asking if said feature already existed in the game because it would be convenient.","replies":[]}]}]}]}]}]}]}