{"poster":"PokemonFan19","date":"2018-12-16T08:49:37.508+0000","title":"Who Are the Best Supports at the Moment?","subforum":"Gameplay & Strategy","up_votes":0,"down_votes":0,"body":"I currently main some Enchanters and Vanguards, such as Alistar and Nami, but who are also very viable in the current meta? \nDo note that I can only list 10 Champions for the Poll, and if the Champion you are looking for is not on the list, please name them. If you want to, you can insert a Champion icon, as well.\nAlso, **PROVIDE** your reasons for the Champion you have chosen.\n\n\n\nPlease? \n{{sticker:sg-soraka}} ","replies":[{"poster":"Ninox","date":"2018-12-16T09:17:43.379+0000","up_votes":1,"down_votes":0,"body":"{{champion:117}} \nShe has highs and lows in the meta like any champ, but her versatility means she's always viable. You can't really go wrong with Lulu, she can match most play-styles and benefit basically any bot laner/teammate, excels at both aggressive and defensive play, and has a very flexible kit. If you play support and don't know how to play Lulu, I can't recommend her enough. \n\nJanna is fairly similar in this respect, but I don't play her enough to offer much feedback.\n\n{{champion:89}} {{champion:12}} \n\nPersonally, I don't enjoy tank supports all that much, with Braum really being the only one I'll play. That said, Alistar is usually up there on my ban list. Ali and Leona are both very reliable supports, able to excel even when they aren't in the height of the meta. If you enjoy playing tanks and aren't scared to get in there and meat shield, they're a good place to start.\n\n{{champion:412}} \n\nThresh is a play-maker. That means he's never going to be a bad support, but it also means he has a high skill cap. Thresh's don't really have average games. There's really good or there's sub-par. If you tilt easily, Thresh is probably one to avoid, you don't have the safety or security that you do in most other supports, and if you are performing poorly you don't have all that much to offer. He isn't tanky enough to meat shield against a fed team, and his CC is much less reliable, putting that much more pressure on peeling.\n\n{{champion:53}} {{champion:143}} {{champion:37}}\n\nThese tend to be ride or die supports. Unless you play them a lot, I probably wouldn't recommend them (much as I love my Zyra). All are fairly weak at the moment, and struggle a lot when they are behind. Blitz especially really goes one way or the other. Zyra and Sona at least have CC/sustain to fall back on, but if a Blitz gets behind his Q (which is basically the centre of his support potential) can often do more harm than good.\n\n{{champion:63}} {{champion:161}} \n\nThey suffer the same obstacles as any kill lane. If you don't get fed, it's not going to be fun. Not impossible by any stretch, but very difficult. You have to get kills, and you have to do it as early as possible. Much of this pain is alleviated with Vel'Koz because he has reliable CC/poke and high base and true damage that mean even when behind he can still dish out decent damage, but a feeding Brand is not a threat at all to the enemy team.","replies":[{"poster":"PokemonFan19","date":"2018-12-16T09:45:11.186+0000","up_votes":1,"down_votes":0,"body":"I appreciate for giving me good answers, Seras, I might try some of them, except the last six who often get into trouble. \nI have not seen Lulu much, but Leona and Alistar, yes, just a couple of times, though.\n\nAnyone else you want to also mention?","replies":[{"poster":"Ninox","date":"2018-12-16T12:54:16.343+0000","up_votes":1,"down_votes":0,"body":"I mean Nami is my main for a reason. She's my comfort pick, I adore her and can play her with my eyes closed (though it's not recommended). That comes down to personal choice though, much as I hate to admit it I'd probably argue that Lulu is a better support overall (though each of course has their perfect niche), Nami just clicks, I enjoy her playstyle.","replies":[{"poster":"PokemonFan19","date":"2018-12-16T13:22:36.180+0000","up_votes":1,"down_votes":0,"body":"Nami is a fine Enchanter but struggles a lot against Ability Power Supports, such as Zyra, Brand and Vel'Koz. For Lulu, I do agree that she is amazing to play as once you have mastered her kit. In the current meta now, is Lulu still a good pick?","replies":[{"poster":"Nightjar","date":"2018-12-16T14:40:17.303+0000","up_votes":2,"down_votes":0,"body":"lulu isn't really meta atm, but even when she's a bottom of the barrel support; running into a Lulu Kogmaw duo botlane in soloq is a nightmare.\n\nShe's best suited for atkspeed reliant adcs who might suffer limited mobility (think Kogmaw, Twitch) , and kai sai. Lulu tends not to synergies too well with Lucian, Caitlynn and especially not with Ezreal. It can work, but in these cases picking Soraka, Janna, Nami or Karma would have probably been a better choice.\n\nThat said, Lulu is somewhat of a 'worst case scenario, do it yourself enchanter supports', in a similar bucket to Karma, Sona, Morgana, Bard and Nami, so winrate isn't really the most important factor. Since if you're good, you'll still be able to harass the enemy laner enough to hold your ground for half the game, regardless of how incompetent your adc is.","replies":[]},{"poster":"Ninox","date":"2018-12-16T13:38:54.750+0000","up_votes":1,"down_votes":0,"body":"I mean, I'd argue you shouldn't really be all that worried about meta until you hit high diamond. Below that, consistent player skill is going to have a much greater impact than the advantage an on meta champ will give you. There are of course some champions that are nerfed almost to the point of uselessness as a bandaid because they were problematic, but those are few and far between, aside from those you can pretty much play anything.\n\nIf you focus on improving your overall skill (map awareness, vision control, wave management, CS etc etc.) with a small champion pool, you'll benefit much more than you will trying to expand your champ pool too much too quickly by playing what's on meta (because it shifts each patch). In essence, macro before micro. It's all well and good to have perfect CS, but if you have bad positioning/awareness and just get caught out, it's not going to help you.\n\nTo answer your question though, Lulu isn't always on meta, but she's never off meta either, which is one of the reasons I say she's a good reliable pick if you're looking for something to main. She's not flavour of the patch at the moment (at least in my bracket), but she's far from weak. She's also an *excellent* anti-assassin which is a huge plus.","replies":[{"poster":"PokemonFan19","date":"2018-12-17T05:52:04.476+0000","up_votes":1,"down_votes":0,"body":"I absolutely agree that she is amazing against Assassins, as her Polymorph and her Ultimate are great against them. \n\nI am not much of a meta-heavy player, either, as some of my mains are doing currently well, like Nami and Leona, but I might try others for a bit of change. \n\n\nWhat do you guys think of Soraka, Braum and all others, including Maokai?","replies":[{"poster":"Ninox","date":"2018-12-17T10:23:01.967+0000","up_votes":1,"down_votes":0,"body":"I like Soraka, but she's niche. I'd never first pick her and she has glaring weaknesses (Ignite supports, anyone who buys or can buy grievous, etc). She's really strong when played into/against the right comps, but is also easily countered if picked early.\n\nLove Braum, just not the strongest tank supp atm. Reliable, and you can't really go wrong, but I'd argue there are stronger picks. Personally I don't enjoy other tanks supps so I'd pick him anyway, but I'd usually stay away from tanks in ranked cause I'm not as comfortable with them.\n\nMaokai is fun, but again very niche. You need the right laner (and ideally a duo comfortable with the lane as well) and you need to be versing the right enemies. He's a tank though, so it's pretty hard to go wrong.\n\nI'm enjoying Neeko supp atm, and it has been quite effective but that's very subject to how she changes over the next couple patches and people are still earning to play/play against her.","replies":[]}]}]}]}]}]}]},{"poster":"PokemonFan19","date":"2018-12-17T12:30:52.631+0000","up_votes":1,"down_votes":0,"body":"Thank you all for the answers!\n{{sticker:sg-ahri-2}}","replies":[]}]}