{"poster":"Viiperfish","date":"2017-02-19T02:23:40.585+0000","title":"Clases de tilteo","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Por que se tiltean tan rapido hoy en dia?, si bien es una estrategia valida, por que se tiltean tanto?... cuando digo valida es sin flamear obviamente.\r\n\r\nDestrozar al enemigo en linea es una formpa pasiva de tiltear.\r\nPero siempre da buenos resultados?, la mayor parte de las partidas si.\r\n\r\nVeamos y reconozcamos a los jugadores que son faciles de tiltear:\r\n\r\n1&ordm; El mas comun, es el que muere una vez, y instantaneamente te dice algo, puede ser algo como: &quot;pfff&quot;, &quot;balanceado&quot;, &quot;dat da&ntilde;o&quot;, &quot;que asco ese campeon&quot;, etc etc. Este tipo de tilteo no es tan grave, porque todavia es consciente. Ese es un jugador al que podes tiltear facilmente e incluso hacer que se vaya afk, solo matandolo.\r\n\r\n2&ordm; El que se come el primer gank y muere, generalmente dice: &quot;no podes solito?&quot;, esos son los mejores, porque si tenes un jg que usa la cabeza, lo destruis mentalmente, hoy estaba en talon top contra un yasuo, una mala jugada tira una E, se come un golpe de torre, se queda en nada de vida, justo entra mi udyr, lo stunea y lo mato, vuelvo a base vuelvo full vida, el udyr seguia por la zona, vuelve a gankear, vuelve a morir y el yasuo pone: &quot;boeeee que camper de mier%$&quot;.\r\n\r\nA lo que el udyr inteligentemente, vuelve a gankear y asi siguio, hasta que el yasuo llego a ir 0/10, ese yasuo nos dio la partida, porque abandono top, se puso a hacer roaming, inutilmente, no sacaba kills, torres nada, termino quedando 4 lvls mas abajo, flameando a todos y bueno, gg yasuo.\r\n\r\n3&ordm; El tilt cegado, me toco un jax en mi team, que fue contra un talon top, murio una vez, y le habia dicho algo al talon, no me acuerdo bien ahora que dijo, pero si me acuerdo que por dentro me dije a mi mismo: &quot;gg este jax nos hunde&quot;, volvio a morir al min, minuto y medio como mucho.\r\n\r\nDije ya esta, este es un cegado no va a parar mas, llego a morir 6 veces en 7 min, le sacaba 3 lvls el talon iba lvl 8 y jax 5, no dejaba de espamear ayuda y flamearme diciendo que lo tenia que gankear, sinceramente, no iba a perder el tiempo, era un caso perdido ese jax, iba a perder mas experiencia, bufos y demas si iba a ayudarlo, sabiendo que lo mas probable murieramos los 2.\r\n\r\nTermino 5/20 ese jax, nos jodio la partida, pero no importaba, ya era re obvio lo tenia asumido asi que me dio igual.\r\n\r\n4&ordm; El tilteo de que no te sale una, hoy a un zed enemigo lo campeon un shaco, todo el dia flameando el zed, lo peor, era que jugaba bien el zed, simplemente estaba ultra tilteado, no miento, con uno de mi team nos reiamos porque habra dicho unas 20 veces esto: &quot;boeee, que culo, pura suerte&quot;, asi todo el dia, llego a decir: &quot;me matan de culo nomas, yo los mecaniqueo como quiero&quot; jajaja, llego a ese punto, pero como dije, no le salian las cosas porque estaba tilteado de tanto que le campeo el shaco, porque jugaba bien, sin ese tilt era otra cosa.\r\n\r\nPero por ultimo esta el tilteo interior, el que no se demuestra a nadie, por ejemplo, hoy en la partida que tuve al jax que yo era jg, me habia quedado jg de ultimo roll, no se porque me tilde estaba meta pensar: &quot;que voy que voy? que uso en la jg?&quot; me quedaron pocos segundos y pickee a teemo, fui teemo jg.\r\n\r\nEn un invade con varus, nautilus y yasuo, mori yo, primero pero mi team se llevo 2 kills, dije bueno fue worth dentro de todo, se llevaron 2 kills y yo 1 asistencia.\r\n\r\nPero me estaban esperando en otro campamento, yo iba caminando feliz como tejon por su grieta, me salen del bush me parten en 28, y encima casi mato a uno, en ese momento casi exploto, estaba puteando por dentro como nadie, pero dije bueno, si con jax ya esta perdida, para que me voy a calentar?. \r\n\r\nTrate de recuperarme en farm, me puse a farmear como loco, pero dentro de todo me recupere llegue a ir en racha con 12/4, pero igual termine con un score de 15/10 horrible, pero bueno, ese es otro de los tilteos que se pueden manejar.\r\n\r\nPor que no juegan todos asi?, a no tiltearse?, a enfriarse 2 segundos y pensar en: &quot;me puedo recuperar si hago las cosas bien&quot;, por que tanto tilt?","replies":[{"poster":"Ks Erwyn","date":"2017-02-19T14:06:25.705+0000","up_votes":1,"down_votes":0,"body":"Yo me tilteo de nada, aunque siempre interno y no soy de contestar por chat a rivales a no ser que se pongan densos.Con aliados es otro asunto, no me cayo nada, de echo soy insoportable...","replies":[]},{"poster":"TSW Rorschach","date":"2017-02-19T02:42:35.045+0000","up_votes":1,"down_votes":0,"body":"Yo me tilteo nomás cuando veo que la estoy cagando en grande y no logro recomponerme. Tomar decisiones equivocadas, no ver el minimapa y comerme el baiteo de mi vida, enfrentarte solo a uno creyendo que lo matás y te parte en 8, que justo me meta mal a la tf, cosas así me tiltean feo. Cuando alguien de mi equipo la caga, entro en modo Nasus y me olvido de todo lo demás poniendome a farmear o en caso de ser supp/jg ver a quién de mi team feedear(?)\n\nIgual, el peor tilt que vi fue cuando jugué con una amiga, solemos hacer duo bot pero justo nos quedó mid y top. Decidi meterme a top con Kennen porque supuse que si ya de por si tenía 300 ms y nunca juego la línea, no se me iba a dificultar tanto ya que con la ulti y el zhonya te manejás(?)\nMe toca contra un Yasuo que me deja bajo torre (porque con 300 ms uno farmea para el traste y los Yasuos siempre pushean todo) y casi a nada de vida porque no podía esquivar los tornados. Sale la curiosidad que cada vez que el Yasuo me quería terminar de reventar (vease diveos, flash para meterme el tornado o intentos de 1vs1) siempre venía mi jg a ayudarme y obviamente con una ulti de kennen que se tiró Zhonya no podés hacer mucho(?). Y cuando no era mi jg, venía mi premade de mid a matarlo xDDD cuando el pobre iba 1/8 ya siempre por lo mismo y con la linea re perdida, me re flameó en el chat, diciendo que era un cobarde de mierda porque nunca le enfrentaba como hombre (:D?????) o algo así. Lo que sí sé es que se fue al carajo con el flammeo de ahí en mas xDDD terminó como 1/10.\n\nHay que admitir que tuvo paciencia, toleró ocho muertes hasta explotar(?)","replies":[]},{"poster":"La Ciruelita","date":"2017-02-19T03:57:32.970+0000","up_votes":1,"down_votes":2,"body":"Yo no me tilteo, es un juego xd","replies":[{"poster":"Matas23","date":"2017-02-19T17:34:14.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Don Ciruelin,realm=LAS,application-id=v7qsfXsE,discussion-id=uF6MLAc9,comment-id=0002,timestamp=2017-02-19T03:57:32.970+0000)\n>\n> Yo no me tilteo, es un juego xd\n\nPara algunos,es una \"droga\" :p","replies":[]}]},{"poster":"Hi im Eleven","date":"2017-02-19T03:47:06.169+0000","up_votes":1,"down_votes":1,"body":"Yo me tilteo cuando veo que puedo ganarle (Y lo hago) al rival, pero llega un punto que no puedo salir de torre por el campeo que me hacen, eso me deja ultra tilteado.","replies":[]}]}