{"poster":"Viiperfish","date":"2017-04-26T16:21:04.313+0000","title":"Una pregunta sobre Jayce...","subforum":"Charlas Generales","up_votes":3,"down_votes":4,"body":"Puede usar {{item:3748}} ?... \r\nPorque el mazo es a mele, es como cualquier otro campeon que pueda usarla, recien ahora me surgio esa curiosidad y no lo tengo a Jayce como para comprobarlo...","replies":[{"poster":"Charlôtte","date":"2017-04-26T16:33:42.878+0000","up_votes":2,"down_votes":0,"body":"Sí, tanto {{item:3077}} como {{item:3085}}","replies":[{"poster":"Viiperfish","date":"2017-04-26T16:35:54.377+0000","up_votes":1,"down_votes":0,"body":"Y cuando pasa a modo ballesta? o viceversa?, se supone que los de rango no pueden usar {{item:3077}} o {{item:3748}} , al igual que los mele {{item:3085}}","replies":[{"poster":"Charlôtte","date":"2017-04-26T16:47:36.204+0000","up_votes":1,"down_votes":0,"body":"Creo que Kayle también puede usar ambos, y creo que en los dos campeones los efectos se aplican para el tipo de AA que estés haciendo. O sea, el de la hydra para cuando están melee y el del huracán para cuando estén tiradores.\nLo que creo que hace posible ver a Nidalee y Elise con ambos items, haciendo los efectos correspondientes para el tipo de AA que estén teniendo. Creo...","replies":[{"poster":"Viiperfish","date":"2017-04-26T16:53:33.453+0000","up_votes":1,"down_votes":0,"body":"Me habia olvidado lo de Kayle con runan, gracias, me sacaste varias dudas...","replies":[]}]}]}]},{"poster":"Rohaerlynn","date":"2017-04-26T16:22:05.295+0000","up_votes":2,"down_votes":2,"body":"no le sirve el item al champ, si bien podes aplicar el efecto, conseguis mejores atributos de la penetracion de armadura y la letalidad.","replies":[{"poster":"Viiperfish","date":"2017-04-26T16:24:05.968+0000","up_votes":3,"down_votes":6,"body":"Mi pregunta no fue si le sirve o no... porque se que items le sirve a Jayce.\n\nSimplemente quiero saber si lo tiene prohibido usar como otros campeones o no.","replies":[{"poster":"Rohaerlynn","date":"2017-04-26T16:25:06.788+0000","up_votes":3,"down_votes":3,"body":"y entonces por que preguntas? para empezar si sabes tanto de jayce deberias saber que es originalmente mele, no tendria sentido que no pueda usar hidras.","replies":[{"poster":"AavatarisII","date":"2017-04-26T18:01:46.184+0000","up_votes":2,"down_votes":1,"body":"Si le respondes cualquier cosa menos lo que respondió solo por entregar TU opinión entonces claramente estas mal tu.\nMás aun luego, respondiendo de vuelta con tanta soberbia y enfado cuando el solo esclareció su duda ya que pareciera que NO ENTENDISTE ¬¬","replies":[]},{"poster":"Viiperfish","date":"2017-04-26T16:27:03.250+0000","up_votes":4,"down_votes":5,"body":"Retirate por favor...","replies":[]}]}]}]},{"poster":"AavatarisII","date":"2017-04-26T18:04:49.322+0000","up_votes":1,"down_votes":0,"body":"No sé si actualmente es así, pero en su momento hice pruebas con Gnar y Jayce (hace unos 6 meses ya), ambos permitían llevar objetos melee y distancia, pero solo se activaban las pasivas según la instancia en que se encontraban.\nAsí, por ejemplo, con placa de hombre muerto Gnar corría a una gran velocidad todo el juego sin descargarla, y en el momento de transformarse golpeaba con las cargas.","replies":[]}]}