{"poster":"Szabadkőműves","date":"2016-01-21T23:43:54.267+0000","title":"Köszönjük RIOT!","subforum":"Általános beszélgetés","up_votes":12,"down_votes":0,"body":"Sziasztok!\r\n\r\nSok embernek nem fog tetszeni amit most &iacute;rok, azok akik t&eacute;m&aacute;t nyitottak azzal kapcsolatosan, hogy alacsony divbe ker&uuml;ltek ne is olvassanak tov&aacute;bb!!!\r\n\r\nK&ouml;sz&ouml;nettel tartozom &eacute;n, &eacute;s m&eacute;g sok j&aacute;t&eacute;kos akik az&eacute;rt j&aacute;tszanak, hogy kikapcsol&oacute;djanak, j&oacute;l &eacute;rezz&eacute;k magukat &eacute;s fejlődjenek, most, hogy mindenki oda ker&uuml;lt ahova ker&uuml;lnie kell, vagy kellett volna sokkal sz&iacute;nvonalasabb j&aacute;t&eacute;knak lehet&uuml;nk tan&uacute;i az elk&ouml;vetkezendőkben.\r\n\r\nSokan tavaly az&eacute;rt s&iacute;rtak mert xy sz&eacute;t trollkodta a meccs&eacute;t silverbe goldba meg platba.\r\n\r\nTudom a trollok mindenhol ott vannak, de ezeknek t&ouml;bb mint 50%-uk az&eacute;rt volt &eacute;ppens&eacute;ggel troll mert k&eacute;pess&eacute;gei nem &uuml;tt&eacute;k az adott div&iacute;zi&oacute; m&eacute;rc&eacute;j&eacute;t.\r\n&Eacute;n &uacute;gy l&aacute;tom, hogy a RIOT időben kezdte ovosolni a probl&eacute;m&aacute;t, hogy sz&iacute;nvonalas j&aacute;t&eacute;kot ny&uacute;jtson, amire mi 2 &eacute;vig s&iacute;rtunk azt ő m&aacute;r tudta 3 &eacute;vvel előtte csak nem akart drasztikusan beavatkozni. \r\nL&aacute;sd az &eacute;n p&eacute;ld&aacute;m, mikor legelsőre r&eacute;szt vettem a besorol&aacute;son Gold IV-be ker&uuml;ltem, h&aacute;t mit ne mondjak, &ouml;r&uuml;ltem neki de tudtam, hogy annyit nem &eacute;rek, azt&aacute;n tavaly Silver V, id&eacute;n meg tal&aacute;n bronz k&ouml;rny&eacute;k&eacute;re fogok ker&uuml;lni.\r\n\r\nNem demotiv&aacute;l&oacute; ez nekem annak ellen&eacute;re sem, hogy tudom fejlődtem ez idő alatt m&eacute;gis egyre lejeb ker&uuml;l&ouml;k, mert azt t&uuml;kr&ouml;zi csup&aacute;n, hogy a RIOT a sz&iacute;nvonalas j&aacute;t&eacute;k megteremt&eacute;s&eacute;re hajt.\r\n\r\nAz&eacute;rt &iacute;rom ezt a k&ouml;sz&ouml;net levelet mert tavaly &eacute;n is sokat vesződtem troll&eacute;k miatt &eacute;s nagyon ideges&iacute;tő volt, hogy nem siker&uuml;lt 1-ről a 2-re jutni, &uacute;gy &eacute;rzem id&eacute;n sokkal t&ouml;bb es&eacute;lyem lesz az &uacute;j hősv&aacute;laszt&aacute;s rendszerrel.\r\n\r\nNem fog senki sem sz&aacute;jba galambot kapni, meg kell k&uuml;zdeni &eacute;rte, lejeb ker&uuml;lt&eacute;l mint tavaly? Motiv&aacute;ljon, hogy nem csak te hanem azok is akik eddig az agyadra mentek &eacute;s amiatt nem jutott&aacute;l fentebb a rangl&eacute;tr&aacute;n!\r\n\r\nL&aacute;sd meg a rosszban a j&oacute;t!","replies":[{"poster":"Zooty","date":"2016-01-22T15:19:30.131+0000","up_votes":4,"down_votes":0,"body":"Én annyit tennék hozzá a dologhoz, hogy szerintem rengetegen rosszul állnak a témához. Sokan úgy gondolják, hogy a 10 besoroló meccsen múlik a teljes szezon. Közbe csak ott kezdődik el az egész. Több száz lejátszott meccs után, a szezon végén elért eredmény a mérvadó, és nem 10 meccs alapján fog eldőlni a játékbeli tudásod.\nCsak ugye mindenki szeretné a könnyű és gyors utat választani, olyan pedig nem igen van. \nA másik tévhit pedig az, amikor úgy gondolkodnak az emberek, hogy az \"elo hell\"-nek titulált szintből kijutni nem lehet, és ezért akar kapásból mindenki jó helyen kezdeni..\n\nSzóval mindenkinek azt üzenem, hogy játsszon, fejlődjön, és jusson fel minél magasabbra, és ne érdekeljen az, hogy éppen hova sorolt be a rendszer!\nhttp://i.imgur.com/ONqFRKH.gif?1","replies":[{"poster":"Vasipari Béla","date":"2016-01-22T16:20:04.273+0000","up_votes":1,"down_votes":0,"body":"Sajnos nem mindeni tud lejátszani többszáz rankedet egy szezon alatt, és ebben az esetben tényleg elég frusztráló lehet,  egyrészt ha rosszul kezdődik az egész, vagy, ha egypár rossz meccs miatt úgy érzed, hagy teljesen értelmetlen a rankedezés.\n(Nem mondom, hogy rossz a besoroló rendszer, csak megértem, ha valaki frusztrált, kéretik nem belémkötni)","replies":[{"poster":"Zooty","date":"2016-01-22T17:20:55.092+0000","up_votes":2,"down_votes":0,"body":"Hát de ez másképp nem megy.\n\nHa komolyan és kompetitíven szeretnéd játszani ezt a játékot, akkor bele kell fektetned (relatív) csomó időt. A reanglétra magasabb fokain azok állnak, akik napi szinten játszanak, és eléggé problémás lenne, hogyha valaki 10 meccsel felkerülhetne oda..\nDe ez az élet más területein is így van. Hogyha például azt mondod, hogy versenyszintű teniszező szeretnél lenni, de nincs időd eljárni edzésekre,  akkor egyszerűen nem fog menni a dolog..\n\nHa nagyon nincs időd játszani, akkor sincsen semmi baj. Max nem versenyszerűen játszol, hanem csak összeülsz 1-2 meccset marhulni a haverokkal hétvégénként. Még jobban is szórakoztok!","replies":[]}]}]},{"poster":"Lashrath","date":"2016-01-22T04:37:05.022+0000","up_votes":4,"down_votes":0,"body":"A rangsoroltban mindig is az zavart hogy a csapat és a véletlen összjátéka volt az hogy a tőlem tellhető legjobbat tudtam-e nyújtani - aminek követelménye a fő ösvényem. Igen persze, minden lanen kell tudni játszani valamennyire. De tény hogy NEM véletlenül láthatjuk streameken is hogy a lobbyban megjegyzi az adott játékos hogy \"OMG we have 4 support players\" - ez nem azt jelenti hogy ők rosszak, de ha valaki játszott 5000 meccset toposként és 200-200-at a többin, lehet, hogy nem szeretné, ha az ADC ismerete alapján kerülne besorolásra. És bár valószínűtlen példa, de ha két azonos tudású játékos közül egy mindig megkapja azt az ösvényt amin a leggyakorlottabb, egy meg sosem/kevésszer akkor esélyes hogy jelentős különbségek lesznek a besorolásukban is. Nyilván normálban szívesen játszok akármit - rangsoroltban viszont okkal hozott feszültséget, ha valaki nem kapta meg az ösvényét (esetleg zsinórban 10-szer) és érettségétől függően tette a dolgát(rosszabbul) vagy instalockolt/trollkodott. Ebből talán idén kevesebb lesz.","replies":[]},{"poster":"TwoFourFour","date":"2016-01-22T07:18:11.629+0000","up_votes":1,"down_votes":11,"body":"***","replies":[{"poster":"FirstFizz","date":"2016-01-22T07:29:56.217+0000","up_votes":2,"down_votes":0,"body":"képzelem miket írhattál nekik...meg hát egyből nem kapsz permabant, szóval már előtte is volt sok figyelmeztetés amit figyelembe se vettél :) ez van kezd újra rage nélkül","replies":[{"poster":"TwoFourFour","date":"2016-01-22T07:36:47.378+0000","up_votes":1,"down_votes":9,"body":"annyira nem írtam dúrvákat, nem kívántam senkinek sem rákot, meg az anyját sem szidtam, maximum a feederre mondtam hogy %%%%%%... ennyi.\nÉs valóban, több játékban is flameltem, ezt nem is tagadom. de sosem ok nélkül. sosem flameltem olyat, aki nem érdemelte volna meg. mert tisztában vagyok azzal, hogy nekem is vannak olyan napok amikor rosszul megy. viszont akkor is próbálom a legjobbat nyújtani, nem pedig 6 perc után elkezdeni trollkodni....","replies":[{"poster":"Looter","date":"2016-01-22T08:32:29.615+0000","up_votes":5,"down_votes":0,"body":"A fórumon nem tudsz káromkodás nélkül egy postot megírni, szóval nem csodálom, hogy bannoltak.\nÉn személy szerint jót röhögnék rajta ha bronz 5 be sorolna be a játék, mert tudom, hogy pillanatok alatt kiverekedném onnan magam.\n\nAkinek gondot jelent a bronz 5 ből való kijutás az tényleg jobban teszi, ha abbahagyja a játékot.","replies":[{"poster":"isitpossible","date":"2016-01-22T10:48:19.208+0000","up_votes":1,"down_votes":8,"body":"neked annyi eszed lehet mint egy hintalónak...","replies":[{"poster":"M4dr4c","date":"2016-01-22T10:52:15.980+0000","up_votes":6,"down_votes":0,"body":"És még mindig okosabb nálad.","replies":[{"poster":"isitpossible","date":"2016-01-22T12:02:32.992+0000","up_votes":1,"down_votes":8,"body":"pont te beszélsz? :DDD","replies":[{"poster":"M4dr4c","date":"2016-01-22T12:06:50.863+0000","up_votes":5,"down_votes":0,"body":"Még ez a fantasztikus, jól átgondolt visszavágás! Teljesen lenyűgöztél éleslátásoddal és ragyogó elméddel! Ja, nem is...","replies":[{"poster":"KuvinFukinAtya","date":"2016-01-22T13:36:49.329+0000","up_votes":3,"down_votes":0,"body":"Ezt adom. :3","replies":[]},{"poster":"Lashrath","date":"2016-01-23T11:45:02.551+0000","up_votes":1,"down_votes":0,"body":"és csodálkozik hogy miért bannolták.... lol...","replies":[]}]}]}]},{"poster":"Looter","date":"2016-01-22T22:00:40.915+0000","up_votes":3,"down_votes":0,"body":"Az lehet, de legalább platos hintaló vagyok.","replies":[]}]}]},{"poster":"M4dr4c","date":"2016-01-22T10:38:45.048+0000","up_votes":5,"down_votes":0,"body":"A fórumposztod alapján a permaban jogos és örükök neki. Nincs olyan ugyanis, hogy indokolt flame. Lehet az illető nem trollkodik csak rossz napja van, te meg nekiállod ott bashelni szegény fejét és még inkább rosszul fog játszani. Well done.","replies":[]},{"poster":"atr0p0sz","date":"2016-01-23T09:06:42.304+0000","up_votes":3,"down_votes":0,"body":"Permabant  nem adnak csak úgy. Annak adnak, aki visszaeső  flamer, állandóan reportolják és nem lightos formában fogalmazza meg a mondanivalóját, mint ahogy azt próbálod itt beadagolni az embereknek. Örülök, hogy más elfoglaltságot keresel. Örülök, hogy egy flamerrel kevesebb lesz a játékban.","replies":[]}]}]},{"poster":"kameszka","date":"2016-01-24T09:47:33.380+0000","up_votes":1,"down_votes":0,"body":"Osztom a gondolataidat, vicc ez az egész: 10-ből 7 győzelemmel bronz 5. (Nyugati szerveren)","replies":[{"poster":"Lashrath","date":"2016-01-24T10:35:29.523+0000","up_votes":1,"down_votes":0,"body":"Mert ez nem besoroló hanem újrasoroló. A különbség az hogy besorolót csak egyszer tudsz játszani - mikor elkezded a ranked pályafutásod - ilyenkor nyersz 10 meccset és az MMR-ednek megfelelő divbe rak be. Az újrasoroló jóval szigorúbb. Ezt az első ranked szezonod utáni frissítésekkor kell játszanod - ugyanaz a rendszere csak ez NEM az MMR-edre tesz be hanem kb egy egész divizióval alá - ezzel akarják aprítani az ebayes acokat - fair vagy nem fair lehet róla vitatkozni - mert rendben én értem hogy nem fair ha a gold acc lemegy silver 5-re, de az sem igazán fair ha egy kartonpapír8-as képességeiel megáldott gyerkőc ebayen vesz magának egy diamond accot és meccsek százait teszi tönkre mire kihullik onnan.","replies":[]}]},{"poster":"SmartB0y","date":"2016-01-27T12:53:12.757+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=ugXC7g3p0JU\n\nÉrthető?","replies":[]},{"poster":"Szabadkőműves","date":"2016-01-25T21:31:28.926+0000","up_votes":1,"down_votes":0,"body":"Minek olvastad tovább? :D\nMost nézd meg van egy csomó minuszod mert mi vagyunk a hibásak, hogy te nem jutottál oda ahova képzeled magad, én csak óvni akartalak :'(\nNa jó nem tetőzöm, iszok egy sört az egészségedre!","replies":[]}]},{"poster":"SquatEye","date":"2016-01-22T05:59:19.568+0000","up_votes":2,"down_votes":0,"body":"\"Motiváljon, hogy nem csak te hanem azok is akik eddig az agyadra mentek és amiatt nem jutottál fentebb a ranglétrán!\"\n\nMindennel egyetértek, kivéve ezzel... sajnálom azokat a kezdőket, akik bronzból kell hogy kiverekedjék magukat, és ennyi idióta mellett, akiket igyekszik rájuk tolni a RIOT, kell megtanulniuk rendesen játszani... bár ha ironizálni akartál, akkor viszont hatalmas pluszpont! :D\n","replies":[{"poster":"Norb Cena","date":"2016-01-22T15:46:58.336+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SquatEye,realm=EUNE,application-id=VFnq5EbB,discussion-id=G2rgwdri,comment-id=0002,timestamp=2016-01-22T05:59:19.568+0000)\n>\n> ennyi idióta mellett, **akiket igyekszik rájuk tolni a RIOT, **kell megtanulniuk rendesen játszani\n\nAzért megvan a fejemben ahogy Céci, Deadalus, Lyte, Ghostcrawler meg Marc Merrill ülnek egy sötét, szivarfüstös szobában és arról tárgyalnak hogy XxXÉNVOKGARENHUNxXx-nek milyen csapattársakat toljanak be, majd előhozzák a listát a fíderekről meg a \"ghostplayerek\"-ről és egyesével beválogatják mellé a csapatot míg az enemy csapatba kerül Faker, Apdo, Shy, Mata meg Imp.\n(egyébként az a szomorú hogy vannak akik kajak ezt hiszik, mármint hogy így megy a matchmaking)","replies":[{"poster":"SquatEye","date":"2016-01-22T16:23:56.901+0000","up_votes":1,"down_votes":0,"body":"A szándékos félreértelmezés lett a hobbid?","replies":[{"poster":"Norb Cena","date":"2016-01-22T16:56:56.789+0000","up_votes":1,"down_votes":0,"body":"wow calm your tits fam, its just a joke","replies":[]}]}]},{"poster":"Szabadkőműves","date":"2016-01-22T06:44:14.275+0000","up_votes":2,"down_votes":0,"body":"Próbáltam olyan hangnemben fogalmazni, hogyha netalán mégis egy olyan ember végig olvasná aki végig sírta a fél világot a csúnya Ritó miatt, akkor derüljön picit.","replies":[]}]},{"poster":"Shirodrake","date":"2016-01-22T00:27:06.679+0000","up_votes":1,"down_votes":0,"body":">  ...lejeb kerültél mint tavaly? Motiváljon, hogy nem csak te hanem azok is akik eddig az agyadra mentek és amiatt nem jutottál fentebb a ranglétrán!\n\nXD","replies":[]}]}