{"poster":"Cheola","date":"2015-12-18T15:06:44.020+0000","title":"Suchen Midlaner und Jungler fürs Teamranked!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"&Uuml;ber uns:  Einer von uns ist 13 und ich und der andere sind beide 15. Wir lachen viel und haben sehr viel Humor...\r\n                   Die anderen beiden sind noch level 29 und haben eine gro&szlig;e auswahl an Champions.\r\nWas du haben musst: Erstmal nicht ragen^^Dann recht oft online sein und vorallem Spa&szlig; am Spiel haben.\r\n                                        Was auch noch sehr wichtig ist das ihr auch in Zukunft bei uns bleibt weil wir drei uns sehr gut kennen gelernt haben und wir suchen eben noch zwei leute die auch dazu geh&ouml;ren wollen^^\r\n\r\n\r\nWenns noch fragen gibt schreibt sie unter dem Beitrag","replies":[{"poster":"CoGa Skyrora","date":"2015-12-18T15:08:57.672+0000","up_votes":1,"down_votes":0,"body":"Hallo, ich suche schon sehr lange nach einem netten Team, daher würde ich gerne mitmachen. =)\nIch wohne im schönen Bundesland Brandenburg, bin 15 Jahre alt und bin im Moment Silber III. Spaß am Spiel habe ich auf jedenfall auch ebenso wie die Eigenschaft nicht zu ragen :) Meine Main Position ist die Mitte. (Könnte auch junglen aber da bin ich ungefähr auf Silber V :D)\nWäre cool wenn ihr/du dich mal meldest.\nLG  Jan / Skyrora {{sticker:slayer-jinx-catface}} ","replies":[{"poster":"Cheola","date":"2015-12-18T15:38:05.419+0000","up_votes":1,"down_votes":0,"body":"Das Klingt schonmal gut^^\nWie lang spielst du denn pro tag? Und welche champions spielst du?","replies":[{"poster":"CoGa Skyrora","date":"2015-12-18T15:48:04.485+0000","up_votes":1,"down_votes":0,"body":"Pro Tag kann ich nicht so richtig sagen, naja In der Woche mal 2 Stunden mal 5 und am Wochenende, will ich mal nicht so laut sagen...xD\nFast durchgängig. \nVon den Champions her bin ich sehr vielfältig. Ich kann fast jeden Champion auf jeder Lane spielen.\nAber meine besten Champions in der Mitte sind Yasuo, LeBlanc, Kassadin, Syndra, Anivia (naja wie gesagt ich kann echt fast alle Midlane Champs relativ gut spielen. :D) Habe außerdem noch die folgenden auf Stufe 4-5 vom Midlane spielen: Ezreal, Katarina, Zed, Nidalee, Riven, Blitzcrank  {{sticker:slayer-jinx-wink}} \nWenn du möchtest kannst du ja mal in meine Match-History gucken, habe ziemlich viele sehr gute Games (20/3 oder sowas in der Richtung)","replies":[{"poster":"Cheola","date":"2015-12-18T16:06:47.203+0000","up_votes":1,"down_votes":0,"body":"Bin überzeugt^^\nWir sind ja alle drei noch unranked, aber ich sag einfachmal das wir recht gut sind und im Team auch silber 3 erreichen werden.\nAlso wenn du sympathisch bist und auch noch länger bei uns bleibst dann spricht eigentlich nichts dagegen das du mit machen kannst:)","replies":[{"poster":"CoGa Skyrora","date":"2015-12-18T16:10:34.668+0000","up_votes":1,"down_votes":0,"body":"Wäre echt cool ^^ Habe echt lange gesucht bis mal ein Team auch einen Silber Spieler nehmen würde. Sonst suchen immer nur welche Platin oder Diamant Spieler :/ Ich hoffe doch, dass ich sympathisch bin und aktive Ranked Teams habe ich nicht, also werde ich auf jedenfall wenn es mir gefällt bei euch bleiben :)","replies":[{"poster":"Cheola","date":"2015-12-18T21:02:31.832+0000","up_votes":1,"down_votes":0,"body":"Morgen können wir gerne weiter reden, muss erstmal mein lol neu downloaden weil ich auf windows 10 gewechselt bin.","replies":[{"poster":"CoGa Skyrora","date":"2015-12-18T22:47:12.484+0000","up_votes":1,"down_votes":0,"body":"Okay, kein Problem. Kannst mich ja in Lol anschreiben dann. Das Forum ist dafür nicht so gut geeignet. :)","replies":[]}]}]},{"poster":"CoGa Skyrora","date":"2015-12-18T17:29:01.011+0000","up_votes":1,"down_votes":0,"body":"ich habe dich übrigens auf dem Euw Server geaddet.","replies":[]}]}]}]}]}]}