{"poster":"dome025","date":"2016-02-26T14:32:43.047+0000","title":"Danke Riot","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Heut hab ich das Dominion Symbol bekommen, obwohl ich zum Zeitpunkt des &quot;Schnappschusse glaub 93 Dominion Siege hatte (hab am Abend als der Beitrag kam die 101 vollgemacht). \nUnd wollte einfach nur Danke an Riot sagen &lt;3\n\nPs: Denkt ihr der neue Drachen Champion wird bald kommen (also im 6.6 PBE Cycle)?  Er soll ja mit dem Mount Targon in Verbindung stehen (Ao Shin wurde ja ?erstmal? ?gecancelt?). K&ouml;nnte mir gut vorstellen, dass er im Verlauf des Events geteasert wird.","replies":[{"poster":"Megamaexx","date":"2016-02-26T14:51:32.705+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dome025,realm=EUW,application-id=YnZkMR0R,discussion-id=Br8Ta5w1,comment-id=,timestamp=2016-02-26T14:32:43.047+0000)\n>\n> Ps: Denkt ihr der neue Drachen Champion wird bald kommen (also im 6.6 PBE Cycle)?  Er soll ja mit dem Mount Targon in Verbindung stehen (Ao Shin wurde ja ?erstmal? ?gecancelt?). K&ouml;nnte mir gut vorstellen, dass er im Verlauf des Events geteasert wird.\n\nJa, Ao Shin wurde gecancelt, dafür kommt Aurelion Sol. Klingt für mich einfach nur nach einer Umbenennung und ich glaub auch, dass er während des Events etwas von sich zeigt.","replies":[{"poster":"dome025","date":"2016-02-26T16:41:17.870+0000","up_votes":1,"down_votes":0,"body":"Ist etwas mehr als eine Umbenennung. Da Ao Shin ein Sturmdrache sein sollte und Aorelion Sol wird ein Sonnendrache. Also ein anderes Konzept, auch wenn vieles von Ao Shin vielleicht übernommen ist. Und ich glaub in dem Beitrag wurde nie von einem endgültigem Status von Ao Shin gesprochen, auch wenn ich selber glaube, dass Riot nicht mehr an Ao Shin in irgendeiner Form arbeiten wird.","replies":[{"poster":"feines","date":"2016-03-03T20:21:51.857+0000","up_votes":1,"down_votes":0,"body":"Du hast ein Dominion Symbol bekommen!  Da werden dich ja alle beneiden! Überleg mal auf was du wert legst und warum riot das macht. Wiviele Stunden hast du dafür gezockt und andere wichtige dinge vernachlässigt.? Wie oft haben deine Eltern sich über das gezocke geärgert. Mach mal was Sinnvolles.","replies":[{"poster":"dome025","date":"2016-03-09T18:49:23.317+0000","up_votes":1,"down_votes":0,"body":"> Mach mal was Sinnvolles.\n\nDas kommt von jemandem, der sich über einen anderen aufregt, weil dieser ein Dankeschön an Riot sagt. Und deswegen einen ziemlich unnötigen Kommentar schreibt. Mach also du mal etwas sinnvolles.\nPs: Wenn ich mich über das Symbol freue, ist dann die extra Zeit für 7 Spiele, die ich aufgebracht habe nicht sinnvoll?","replies":[]}]}]}]},{"poster":"2B4GOT10","date":"2016-02-27T21:03:30.370+0000","up_votes":1,"down_votes":0,"body":"Glücklicher B*stard ich hab 260 wins und warte immernoch....","replies":[]}]}