{"poster":"dome025","date":"2015-12-21T22:03:41.017+0000","title":"etwas härtere strafe für toxic spieler","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":7,"body":"wie findet ihr die idee, dass bestrafte spieler (egal wie schwer oder leicht die strafe ist) nicht die funmodes (porok&ouml;nig,urf, usw ...) benutzen d&uuml;rfen?","replies":[{"poster":"IIIPinkGuyZedIII","date":"2015-12-21T22:26:07.162+0000","up_votes":1,"down_votes":4,"body":"Ich sags mal so es gibt auch manchmal unfaire reports z. B wenn man einfach so Reportet wird weil mann alleine mit 4er premade spielt^^","replies":[{"poster":"Veezey","date":"2015-12-21T23:23:44.360+0000","up_votes":3,"down_votes":1,"body":"Für unbegründete Reports wird aber niemand bestraft.","replies":[{"poster":"The valiant Hero","date":"2015-12-22T06:25:53.618+0000","up_votes":3,"down_votes":1,"body":"Stimmt nicht ganz. Es wird schon aufgezeichnet. Für jeden miss-report wird der Einfluss des Reporters auf zukünftige Reports gesenkt. \n\nOder kurz: Wer einmal lügt, dem glaubt man nicht, auch wenn er mal die Wahrheit spricht.","replies":[]},{"poster":"dome025","date":"2015-12-22T13:13:55.639+0000","up_votes":1,"down_votes":1,"body":"Nicht immer sonst würde es gar keine Spieler geben die zu Unrecht bestraft wurden, aber es gibt welche. Wie viele das sind, weiß ich natürlich nicht, aber auf jedenfall gibt es wenige,  deren Vergehen sich der Support angeschaut hat und bemerkten, dass da kein wirkliches Vergehen war.","replies":[{"poster":"Veezey","date":"2015-12-22T13:41:38.789+0000","up_votes":2,"down_votes":1,"body":"Ausnahmen bestätigen die Regel  ;)","replies":[{"poster":"dome025","date":"2015-12-22T14:43:05.726+0000","up_votes":1,"down_votes":1,"body":"Stimmt auch wieder. ^^ Totzdem ist die Aussage \"Für unbegründete Reports wird aber niemand bestraft.\" falsch. Besser wäre wahrscheinlich: Für unbegründete Reports wird man nur bestraft, wenn das System einen Fehler gemacht hat.","replies":[{"poster":"Veezey","date":"2015-12-22T17:06:38.504+0000","up_votes":2,"down_votes":1,"body":"Im Prinzip wird ja auch niemand dafür bestraft, sollte man sich beim Support melden, wenn die Strafen unbegründet sind :D","replies":[]}]}]}]}]},{"poster":"Waldschrat86","date":"2015-12-21T23:33:11.509+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Darksouldragon,realm=EUW,application-id=KYnfKGf0,discussion-id=Vew6vbmY,comment-id=0004,timestamp=2015-12-21T22:26:07.162+0000)\n>\n> Ich sags mal so es gibt auch manchmal unfaire reports z. B wenn man einfach so Reportet wird weil mann alleine mit 4er premade spielt^^\n\nJo und das hat genau  0 Auswirkungen. Echt mega unfair.","replies":[]}]},{"poster":"Lagbeard","date":"2015-12-21T22:20:25.166+0000","up_votes":2,"down_votes":1,"body":"Die Funmodes sind relativ selten, und auch nicht für alle interessant. Die Strafe würde also Spieler unterschiedlich hart treffen, und wäre damit ziemlich ungerecht. Mich würde es nicht interessieren, kein Legend of the Poro King spielen zu dürfen, tu ich ohnehin nicht.","replies":[{"poster":"dome025","date":"2015-12-21T22:38:21.668+0000","up_votes":1,"down_votes":3,"body":"Mit Chat Restriction und Ranked Restriction wäre aber das selbe Problem. Da es Spieler gibt denen es unterschiedlich viel bedeutet. Den einen kümmerts kaum da er sowieso den Chat nur benutzt zur Freude am Tilten und der andere kann sich öfter nicht beherschen, wenn Beispiel 1 die ganze Zeit im Chat rumflamt, aber ansonsten den Chat positiv nutzt und diesen auch braucht.","replies":[{"poster":"Rainbow Dashie","date":"2015-12-22T08:07:32.863+0000","up_votes":1,"down_votes":2,"body":"jo Flamer brauchen den Chat.  Hab ich oft schon gelesen mit dem dazugehörigen Log und NEIN ein Flamer braucht keinen Chat für positiven Stuff.\nEin Flamer braucht den Chat nur für seinen Flame. Ergo CR ist eindeutig berechtigt.\n\nDie RR gibt es seit dem Instant Feedback System nicht mehr. Da gibt es nurnoch 2 mal die CR 14 Tage Bann Perma Bann.","replies":[{"poster":"dome025","date":"2015-12-22T13:07:07.140+0000","up_votes":2,"down_votes":1,"body":">jo Flamer brauchen den Chat. Hab ich oft schon gelesen mit dem dazugehörigen Log und NEIN ein Flamer braucht keinen Chat für positiven Stuff.\nEin Flamer braucht den Chat nur für seinen Flame. Ergo CR ist eindeutig berechtigt.\n\nEs geht nicht darum ob die Strafe berechtigt ist oder nicht, sondern um die Tatsache, dass Chat Restriction, die es ja gibt, Spieler genauso unterschiedlich hart treffen, wie die härtere Strafe die ich vorgeschlagen habe. \nUnd zu der Tatsache, dass Flamer den Chat nicht für positive Sachen gebrauchen: Woher willst du wissen ob eine Person, die eine CR hatten den Chat auch nicht für positive Sachen nutzen? Es gibt welche, die wirklich andere nur  beleidigen/belästigen Aber es gibt auch welche die sich provozieren lassen, dadurch selber für das ein Spiel toxisch werden (wenn  dieser jede Woche pro Tag 2-3 Spiele mit toxischen Leuten hat, kommt schon was bei zusammen), sodass sie eine CR bekommen, aber den Chat ansonsten für neutrale oder sogar positive Dinge gerne benutzen.\n\n>  Die RR gibt es seit dem Instant Feedback System nicht mehr. Da gibt es nurnoch 2 mal die CR 14 Tage Bann Perma Bann.\n\nWusste ich nicht, dass es die RR nicht mehr gibt, aber wie oben ist das zu meinem vorherigen Kommentar nicht relevant. Trotzdem gut zu wissen.","replies":[{"poster":"eingew","date":"2015-12-23T06:48:33.768+0000","up_votes":2,"down_votes":1,"body":"Wer eine CR hat, hat den Chat vielleicht auch positiv genutzt, ja. Aber er dieses Positive wird hinfällig, wenn man bedenkt, dass das negative überwiegt. Daher ist eine CR durchaus sinnvoll, selbst wenn dann eventuelle positive Kommentare wegfallen könnten.","replies":[{"poster":"dome025","date":"2015-12-23T09:43:21.432+0000","up_votes":1,"down_votes":1,"body":"> Wer eine CR hat, hat den Chat vielleicht auch positiv genutzt, ja. Aber er dieses Positive wird hinfällig, wenn man bedenkt, dass das negative überwiegt. Daher ist eine CR durchaus sinnvoll, selbst wenn dann eventuelle positive Kommentare wegfallen könnten.\n\nWerd ich grad die ganze Zeit missverstanden? Wie schon erwähnt **geht** es jetzt **_nicht darum ob die CR berechtigt ist noch ob die CR sinnvoll ist_ **(wir rücken immer weiter vom ersten Kommentar zu meinem Post ab und dass nur weil ich versucht habe zu erklären, dass CR Spieler auch unterschiedlich hart treffen, als Antwort auf den ersten Kommentar der behauptet, dass meine härtere Strafe Spieler unterschiedlich hart trifft)\n\n> Die Funmodes sind relativ selten, und auch nicht für alle interessant. **Die Strafe würde also Spieler unterschiedlich hart treffen, und wäre damit ziemlich ungerecht.** Mich würde es nicht interessieren, kein Legend of the Poro King spielen zu dürfen, tu ich ohnehin nicht.\nZitat von Aeolas Dustchild \n\n{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"eingew","date":"2015-12-23T09:50:06.729+0000","up_votes":1,"down_votes":1,"body":"Bist du zufällig in der chronologischen und nicht in der Diskussionsansicht? Ich habe nämlich auf genau das Kommentar geantwortet, wo du eindeutig nur über die Effizienz einer CR geredet hast. Natürlich schweift das dann ab. Deinen Eröffnungspost habe ich in mein Kommentar ja auch gar nicht mit einbezogen.","replies":[{"poster":"dome025","date":"2015-12-23T10:01:46.216+0000","up_votes":1,"down_votes":1,"body":"War in der chronologischen.\n\n> Mit Chat Restriction und Ranked Restriction wäre aber das selbe Problem. Da es Spieler gibt denen es unterschiedlich viel bedeutet. Den einen kümmerts kaum da er sowieso den Chat nur benutzt zur Freude am Tilten und der andere kann sich öfter nicht beherschen, wenn Beispiel 1 die ganze Zeit im Chat rumflamt, aber ansonsten den Chat positiv nutzt und diesen auch braucht.\n\nAber in diesem Kommentar von mir hatte ich trotzdem nicht die Absicht die Effizienz, den Sinn oder ob es gerechtfertigt ist in Frage zu stellen oder zum Mittelpunkt der Diskussion zu machen. Sondern wollte in einem anschaulichem Beispiel zeigen, dass die CR Spieler unterschiedlich hart trifft, da jeder Spieler anders ist.\n\nEdit: Sorry, ich bin grad durcheinander gekommen welchen Kommentar du meintest. Wenn du meinen zweiten Kommentar meintest, dann war das eine Antwort auf Rainbow Dashie, wo ichs nochmal versucht habe zu verdeutlichen. Aber ich hatte in diesem ganzen Post nicht den Sinn oder sonstwas von der CR in Frage gestellt.","replies":[]}]}]}]}]}]}]}]},{"poster":"dome025","date":"2015-12-21T22:15:19.571+0000","up_votes":1,"down_votes":1,"body":"> Die Idee an sich ist nicht blöd, wenn auch eventuell ein bisschen zu hoch gegriffen. Immerhin erhält man für milde Vergehen ebenso milde Strafen wie Chat-Restrictions und für verheerende Vergehen Strafen, bei denen zusätzliche Bestrafungen komplett unnötig sind. Denn was bringt es, jemanden aus Funmodes auszuschließen (ich nehme an, du meinst temporär, da permanent ja schon ziemlich krass wäre), wenn derjenige eh zwei Wochen oder permanent von allen Spielinhalten ausgeschlossen ist?\n> \n> Aber mal ganz davon abgesehen, fürchte ich, dass das keine besonders große Wirkung hätte. Immerhin sind die Funmodes nun wirklich nur ein kleiner Teil von League of Legends, der meist nur für Spieler interessant ist, die unabhängig von der Situation Freude am Spiel haben. Wer sich im Ranked Game die Stimmbänder rausschreit und seine Teammates beleidigt, fällt sowieso nicht unter die Kategorie der Spieler, die von sowas ernsthaft getroffen werden.\nZitat von Lyle\n\n Hatte ein Game mit Brand in Porokönig der nur am tilten war, deshalb würde soetwas, die  an diesen Modi spaß haben wollen schützen.","replies":[{"poster":"Lyle","date":"2015-12-21T22:16:17.809+0000","up_votes":1,"down_votes":1,"body":"Hab's der Übersichtlickeit zugunsten gerade nochmal gepostet. Wenn du's schöner haben möchtest, kannst du da gerne nochmal antworten lol","replies":[{"poster":"dome025","date":"2015-12-21T22:30:59.362+0000","up_votes":1,"down_votes":1,"body":"^^ dachte in den allg. chat könnte quasi alles rein da ich beim erstellen des ersten posts nicht wusste wo das  thema hin sollte","replies":[]}]}]},{"poster":"CooL Ice Tea","date":"2015-12-21T22:09:09.588+0000","up_votes":1,"down_votes":1,"body":"Wirkliche Toxic player werden in der Regel schnell mit einem 2 wochenbann belegt, wenn das nicht reicht kommt der Perma. Somit können die harten fälle während Ihrer Strafphase sowieso nicht spielen. Die Toxic leute dann aber in Normals und in Ranked zu drücken während ihren CR spielen halte ich für weniger sinnvoll.","replies":[{"poster":"dome025","date":"2015-12-21T22:28:29.453+0000","up_votes":1,"down_votes":1,"body":">  Die Toxic leute dann aber in Normals und in Ranked zu drücken während ihren CR spielen halte ich für weniger sinnvoll.\n\nDie toxischen Leute sind ja aber selber Schuld (außer das System hat einen Fehler gemacht,was aber eine andere Sache ist), dass sie eine Strafe haben und des Rest des Jahres können sie ja sowieso den Modus nicht benutzen, also denken sie vielleicht zwei Mal darüber nach ob sie Toxic sind, wenn sie den Modus benutzen möchten. Und für mich geht es vor allem darum, dass die wo dran Spaß haben möchten nicht mit denen zusammen spielen müssen. Denn auch wenn sie vielleicht nur 3 oder 5 Sätze schreiben können reicht es aus um die Stimmung zu zerstören und auch ohne etwas in den Chat zu schreiben können sie die Stimmung zerstören.","replies":[]}]},{"poster":"Lyle","date":"2015-12-21T22:15:37.868+0000","up_votes":1,"down_votes":1,"body":"Die Idee an sich ist nicht blöd, wenn auch eventuell ein bisschen zu hoch gegriffen. Immerhin erhält man für milde Vergehen ebenso milde Strafen wie Chat-Restrictions und für verheerende Vergehen Strafen, bei denen zusätzliche Bestrafungen komplett unnötig sind. Denn was bringt es, jemanden aus Funmodes auszuschließen (ich nehme an, du meinst temporär, da permanent ja schon ziemlich krass wäre), wenn derjenige eh zwei Wochen oder permanent von allen Spielinhalten ausgeschlossen ist?\n\nAber mal ganz davon abgesehen, fürchte ich, dass das keine besonders große Wirkung hätte. Immerhin sind die Funmodes nun wirklich nur ein kleiner Teil von League of Legends, der meist nur für Spieler interessant ist, die unabhängig von der Situation Freude am Spiel haben. Wer sich im Ranked Game die Stimmbänder rausschreit und seine Teammates beleidigt, fällt sowieso nicht unter die Kategorie der Spieler, die von sowas ernsthaft getroffen werden.","replies":[]}]}