{"poster":"Sloth Almighty","date":"2016-08-27T15:56:22.592+0000","title":"Social Club needed","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I feel there is a need to create a IM League service (instant message). Because the last game i played garen, for once had my top lane dominated and was 1v2&#039;ing quite easy enough... Then about 30mins in my team mates start talking in chat about a bunch of random crap and even during team fights, kept stopping to reply. So we threw hard and lost.\r\nAny way, im not the tilted or salty type, so whatevs. But I have seen this happen a lot, clearly some play more for the social aspect, so lets create an avenue for them kind and might just not have games thrown on anyone in the future xD","replies":[{"poster":"Miicka","date":"2016-08-27T16:06:21.918+0000","up_votes":2,"down_votes":0,"body":"Vayne does the best gosu outplay ever, 1v5s, gets the quadra, and sona, the last person on there team, is standing there, with 1 health. All Vayne has to do is auto attack and the penta and the game will be hers. She will have won her promos to challenger tier.\n\nBut nup. Instead she stops to reply to what her favourite kind of WonderWheats cookies is.","replies":[{"poster":"Sloth Almighty","date":"2016-08-27T16:19:24.640+0000","up_votes":1,"down_votes":0,"body":"Lol, THIS. This is what I am talking about exactly. We need a direct outlet for these socialites","replies":[]}]},{"poster":"Pikachoochoo","date":"2016-08-28T03:58:40.256+0000","up_votes":1,"down_votes":0,"body":"That's why I vented out on the forums lol. http://boards.oce.leagueoflegends.com/en/c/team-recruitment/y3y9Hcgn-aram-team-serious-aram-players-only?comment=0009\n\n+ + only typing while dead, resting in shop, buying items in shop, staying in xp range as support when I can't harass much any more or roaming while I know where enemies are","replies":[{"poster":"Pikachoochoo","date":"2016-08-28T04:01:56.210+0000","up_votes":1,"down_votes":0,"body":"Oh I can't do the + sign without a test/number in front of it, lol it makes me think of Equinox https://i.ytimg.com/vi/uo0s_Recy5w/hqdefault.jpg I was just trying to see if it'd work with a + +","replies":[]}]}]}