{"poster":"Bloodyrains","date":"2016-04-17T02:14:33.539+0000","title":"Hextech Crafting Suggestions/improvements","subforum":"GD","up_votes":2,"down_votes":0,"body":"Hey everyone, Bloodyrains here. I just wanted to throw my thoughts out about the new Hextech Crafting. I&#039;ll try to summarize my thoughts the best I can to make reading this as quick as possible.\n\n**Things I like about Hextech Crafting...**\n\n1. Randomness of it all.\nI really enjoy how random it can be, the thought of getting almost anything in-game always puts me on edge. \n\n2. It&#039;s Free. \nFree skins/items are always great, it makes players feel rewarded for their efforts and time.\n\n**Things I dislike about Hextech Crafting...**\n\n1. Lack of confirmation.\nI don&#039;t like how the chests lack confirmation. I&#039;m pretty sure this has been addressed for champions but not Icons/Wards. We don&#039;t know what Icons/Wards can be obtained through chests. To clarify, is it only Icons/Wards offered in the store or are event wards also accessible through chests? Examples would be &quot;Vengeful Wraith&quot; from 2012 Harrowing Event or even the 2014 Snowdown Showdown Poro Icons.\n\n2. No option to decline Summoner Icons/Wards.\nI love the fact that you can pick and choose if you want a skin/champion that comes out of a chest. It helps those players that like to have a &quot;perfect&quot; account with content they only want on it. Sadly, you can&#039;t do the same with Icons/Wards, They&#039;re automatically added to your roster of Icons/Wards. Not to mention some players have no desire to use certain Icons/Wards so they&#039;d just go to waste. In Essence this would also feel like their chest of the month and key were wasted. I do think an option to keep/disenchant these should be implemented if possible. \n\n3. Champion Essence.\nThis has been addressed if I recall correctly but I would like to add my opinions on it. I don&#039;t own every champion in the game yet so Champion Essence is beneficial to me but for those that do own every champion it&#039;s not to them. Blue Essence or Champion Essence should be used for other things, such as Runes, Rune Pages or even some IP. \n\n4. Key Drop-Rate \nThe rate of acquiring keys seems ridiculously low. I&#039;ve seen people say and I have a friend who personally has not gotten a key fragment in 3 weeks despite playing daily. In my opinion, the Drop-Rate should be around 15%-20%~ with the requirement of also winning the game of course. This should make it easier for players to be rewarded for their time. I also think an &quot;unlucky&quot; system should be placed for this. Some people have horrible luck. A simple fix for this would be to add 3%-5%~ increase every single win to the Drop-Rate. This system would also rely on other factors to make sure it can&#039;t be abused for an easier key. \n\nAnyways, that&#039;s all! Thanks for reading.. skimming.. or just clicking! If you have any opinions/suggestions I&#039;d love to here it in the comment section below!","replies":[]}