{"poster":"Rest in Rip","date":"2016-03-03T00:44:47.088+0000","title":"PC stürzt ständig ab","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hey Leute mein pc st&uuml;rzt st&auml;ndig beim LoL spielen ab. Hat alles vor nem Monat angefangen ist auf einmal w&auml;hrend dem Ranked komplett heruntergefahren und als ich nach 10 min wieder ingame war ist er instant wieder nach ner min abgest&uuml;rzt... kein bluescreen oder so er st&uuml;rzt einfach ab und dannach kommt beim hochfahren das bild mit windows normal starten oder im abgesichtertem modus usw. (hab auch nen tag danach noch ein game versucht hat mich aber alle 2 min rausgehauen und nach dem 4. reconnect hatte ich auch keine lust mehr)\nder pc wurde jetzt auch komplett neu aufgesetzt mit windows 10 und komplett auseinandergebaut, saubergemacht und wieder zusammengebaut (sogar das bios wurde geupdatet) und trotzdem funzt lol nicht, bzw. ich kann es nicht mal starten weil es schon w&auml;hrend dem updaten den kompletten rechner runterfahren l&auml;sst... und falls der rechner nicht total abst&uuml;rzt kommt halt nur das bugsplat fenster nach dem absturz\nbei anderen spielen l&auml;uft er einwandfrei (metro 2033 ging ohne probleme mit h&ouml;chsten einstellungen, mal so als benchmark test)\nmit admindrechten wird es auch gestartet also daran kann es auch nicht liegen\nhatte ja schon viele probleme in der vergangenheit mit pcs (die allt&auml;glichen die jeder kennt wie zb. w&auml;rmeleitpaste leer, &uuml;berhitzt, netzteil defekt, hatte ich alles schon oft genug und diese fehler liegen hier auch nicht vor) aber dass ein spiel den ganzen rechner schon allein w&auml;hrend dem updaten abst&uuml;rzen lassen kann ist mir neu...\n\nund aufr&uuml;sten oder sonstiges mit neuanschaffung kommt nicht in frage\n\nhier mal der pc: \n\nhttp://fs5.directupload.net/images/160303/dqkvpgnb.jpg\nhttp://fs5.directupload.net/images/160303/nakiqjia.jpg\n\nbitte um hilfe wei&szlig; nicht weiter\n\n\nEDIT: gerade auch nochmal versucht lol zu starten während der IP-Hilfsdienst deaktivert ist (viele challenjour meinten dass windows 10 und lol sich deswegen beißen) und das hat auch nichts gebracht... der rechner ist nach knapp 2 minuten lol-updaten wieder komplett abgestürzt","replies":[{"poster":"Rest in Rip","date":"2016-03-09T18:02:17.539+0000","up_votes":1,"down_votes":0,"body":"UPDATE: Gestern bin ich ganz normal ohne Probleme zum einloggen gekommen und konnte sogar ein normal spielen (50 min) und in den 20 min queue-zeit ist auch alles problemlos gelaufen, verstehe echt nicht was der rechner für ein problem hat...","replies":[]},{"poster":"Rest in Rip","date":"2016-03-07T15:13:16.070+0000","up_votes":1,"down_votes":0,"body":"Corsair CX 750","replies":[]},{"poster":"Rest in Rip","date":"2016-03-07T03:46:11.420+0000","up_votes":1,"down_votes":0,"body":"jo sry leute hatte paar tage kein i-net deswegen antworte ich erst so spät^^ \n\nich habe gerade btw mal wieder versucht lol zu starten und habe auf reparieren gedrückt und es hat dieses mal sogar geschafft fertig zu updaten und konnte mich dann auch einloggen. (ist das erste mal dass seit der pc formatiert ist ich überhaupt bis zum login screen gekommen bin)\nHab mich dann auch eingeloggt und in der queue bzw. zeitstrafen queue  ist er wieder komplett abgestürzt. \n\nEreignisanzeige: http://fs5.directupload.net/images/160307/dz82eebd.png\n\nTemperaturen:   http://fs5.directupload.net/images/160307/nqfrrews.png\n                            http://fs5.directupload.net/images/160307/he4hfl88.png","replies":[{"poster":"Rainbow Dashie","date":"2016-03-07T10:09:40.274+0000","up_votes":1,"down_votes":0,"body":"ok da es ein ID 41 Error ist direkt mal die Frage was für ein Netzteil ist verbaut? Bitte die genaue Bezeichnung schreiben.","replies":[]}]},{"poster":"Alustus","date":"2016-03-03T11:28:28.277+0000","up_votes":1,"down_votes":0,"body":"Muss fast ein Hardwareseitiges Problem sein, bzw. Windows/Treiber.\n\nProgrammcode von LoL und Internetoptionen sollten nicht den PC abstürtzen lassen. \nHöchstens das der Antivirus einen \"Maleware Code\" erkennt das \"böse programm\" blockiert und mit einem System neustart löscht.\n\nNormalerweise ist ein solcher neustart eine schutzfunktion um einen weitere schäden zu verhindern.\n\nWenn es nicht nur bei LoL passieren würde, würde ich sagen dass es ein Problem mit dem Netzteil/Mainboard gibt oder überhaupt mit der Stromversorgung(spannungsschwankungen, gerade bei alten häusern nichts außergewönliches) an sich.  (stecker/kabel mit wackel kontakt, bzw die Stromversorgung am mainboard )\n\n\nOder das Betriebssystem welches beispielsweise durch Festplattendefekts nicht richtig läuft.","replies":[{"poster":"Rainbow Dashie","date":"2016-03-03T14:05:48.963+0000","up_votes":1,"down_votes":0,"body":"ähm das mit dem NT muss nicht bei allen Spielen der Fall sein.\nHatte selbst so ein Problem, das allerdings lediglich bei MMOs und Mobas. Bei Singleplayer Games und selbst 100% Auslastung von CPU, RAM, GPU, Platten 0 Probleme.\n\nFehler war letzten endes das mein Nt wohl ein Problem bei der Spannungswandlung hatte oder vielleicht lags auch daran das es ein Silvesterböller war. Nach dem Austausch ist alles wieder unproblematisch.","replies":[{"poster":"Alustus","date":"2016-03-03T14:20:16.588+0000","up_votes":1,"down_votes":0,"body":"okay gut zu wissen.\nwieder was gelernt","replies":[{"poster":"Rainbow Dashie","date":"2016-03-03T23:55:58.555+0000","up_votes":1,"down_votes":0,"body":"kommt aber wie gesagt auf das Netzteil an ich hatte ein [Kissquite](http://www.planet3dnow.de/vbulletin/threads/403955-350-420W-Roundup-4-guenstige-Netzteile-im-Test)","replies":[]}]}]}]},{"poster":"Rest in Rip","date":"2016-03-03T10:05:54.146+0000","up_votes":1,"down_votes":0,"body":"treiber sind alle aktuell - pc wurde doch erst neu aufgesetzt (manuell draufgezogen nicht mit windoof 10)\n\nlüfter ist es auch nicht sonst würde der bei den anderen spielen die viel mehr leistung als lol beanspruchen auch abstürzen (es riecht nicht verschmort wie schon gesagt hatte solche probleme öfters in der vergangenheit sowas hätte ich gleich gemerkt) \n\nereignisanzeige wär ne idee stell ich dann rein, bin grad noch unterwegs\n\nglaube mein problem ist nicht so richtig rübergekommen^^ der pc stürzt NUR bei lol ab und seit dem er neu aufgesetzt wurde schaffe ich es nicht mal bis zum login screen weil er die patches nicht schafft fertigzuladen (entweder stürzt der ganze pc ab oder ich kriege 24/7 bugsplat) \n\ntendiere eher zu einem softwareproblem und nicht hardware, weil wie schon gesagt alles andere einwandfrei läuft, bloß lol nicht (RIP)","replies":[{"poster":"Alustus","date":"2016-03-03T11:34:40.922+0000","up_votes":1,"down_votes":0,"body":"der pc stürzt NUR bei lol ab und seit dem er neu aufgesetzt wurde schaffe ich es nicht mal bis zum login screen weil er die patches nicht schafft fertigzuladen (entweder stürzt der ganze pc ab oder ich kriege 24/7 bugsplat)\n\nIch kann nur vermuten, aber für mich hört sich das stark nach einem festplatten problem an, dass dort ein bestimmer bereich nicht mehr funktionier wie er soll.\n\nIch hatte etwas in der Art, nur bei mir wurde es mit der Zeit immer auffälliger da die Speicherkapazität der Festplatte immer weniger wurde, bis am ende sogar das Betriebssystem nicht mehr funktioniert hat.\n(hatte auch PC abstürze/neustarts aber nicht nur in LoL)\n\nDurch neues aufsetzen hat es dann immer wieder ein bisschen funktioniert bis ich wieder ein gewisses datenvolumen erreicht habe.","replies":[{"poster":"Rainbow Dashie","date":"2016-03-03T14:08:05.398+0000","up_votes":1,"down_votes":0,"body":"dem könnte ja ein Platten Check abhelfen wie mit [HD Tune](http://www.hdtune.com/). Das sollte auskunft geben wieviele Sektoren hin sind.","replies":[]}]}]},{"poster":"Homunculi","date":"2016-03-03T07:08:40.665+0000","up_votes":1,"down_votes":0,"body":"Adobe Air installiert/geupdatet?\nAlle Treiber drauf/auf dem neuesten Stand?\n\nLaufen alle Lüfter? Hat es mal verschmort gerochen? \nAuch das von Rainbow Dashie wäre interessant zu wissen.","replies":[]},{"poster":"Shadow l Eagle","date":"2016-03-03T06:54:54.799+0000","up_votes":1,"down_votes":0,"body":"Alles geupdated ?","replies":[]},{"poster":"Rainbow Dashie","date":"2016-03-03T06:23:18.591+0000","up_votes":1,"down_votes":0,"body":"Was sagt den die [Ereingnisanzeige](http://windows.microsoft.com/de-de/windows/open-event-viewer#1TC=windows-7)von windows? \nWie siehts mit den Temperaturen aus?\nDie kannst du am besten mit [Open Hardware Monitor überprüfen](http://openhardwaremonitor.org/)","replies":[]}]}