{"poster":"Kasten4","date":"2016-05-05T10:55:14.148+0000","title":"Ist Poppy tot?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Ich wollte nur wissen was ihr zu dem nerf an Poppy haltet. Sie ist f&uuml;r mich komplett unspielbar geworden, da jungle jetzt komplett von ihr genommen wurde d.h. noch langsamere clear zeiten, kyting ist nicht mehr m&ouml;glich mit der E und gegen counter jungles kann man nichts machen weil man einfach so viel schw&auml;cher ist. toplane wurde sie geschw&auml;cht und dadurch auch selten brauchbar. Ich wei&szlig; dass dieser nerf ne weile her ist aber ich finde rito h&auml;tte sie nicht so zerst&ouml;ren sollen besonders weil sie halt nicht in allem super gut war. sie hatte kaum einen escape und konnte nichts gegen kyting tun. ihr k&ouml;nnt mir ja mal sagen was ihr von der ganzen sache haltet.","replies":[{"poster":"MeDontEnglish","date":"2016-05-05T13:19:49.443+0000","up_votes":1,"down_votes":0,"body":"Finde Poppy eig sehr gut so wie sie jetzt ist.\n\nSie ist einfach nicht mehr der \" Ich kann Poppy in jede Teamcomp picken \" champ.\n\nSie passt sehr gut in Hypercarry comps da sie sehr gut peelen kann.\nEbenso ist sie ein sehr guter Counter zu zbs: {{champion:7}} {{champion:107}} {{champion:54}} {{champion:102}} usw, da dort ihre W unglaublich stark ist und einen Teamfight entscheiden kann. ( engage der Gegner verhindert - Selbst engagen )\n\nIm Jungle mochte ich Poppy eh nie so wirklich ^^","replies":[{"poster":"TerrorRaven","date":"2016-05-05T13:30:49.074+0000","up_votes":3,"down_votes":0,"body":"Kleine Korrektur: Poppy kann die Malphites Ulti nicht aufhalten, da er wie bei der Sion Ulti Unaufhaltsam ist.","replies":[{"poster":"MeDontEnglish","date":"2016-05-05T14:03:31.231+0000","up_votes":1,"down_votes":0,"body":"Ups, okay wusst ich gar nicht, danke ^^","replies":[]}]}]},{"poster":"Revilous","date":"2016-05-05T11:06:58.699+0000","up_votes":2,"down_votes":0,"body":"In der MSI wird sie auch noch häufig gespielt, also kann sie nicht so schlecht sein.","replies":[]},{"poster":"LittleDiva1986","date":"2016-05-05T12:00:27.806+0000","up_votes":1,"down_votes":0,"body":"Ich spiel Poppy auch noch gern also sie ist nicht mehr so op das man mit ihr eben alles sofort zerlegt aber sie kommt ihrer Rolle als Offensivertank sehr gut nach sie drück noch Schaden hält dabei viel aus also alles ok","replies":[]}]}