{"poster":"Kasten4","date":"2016-03-29T00:19:54.957+0000","title":"Hextech Unboxing ist schrecklich","subforum":"Champions & Gameplay","embed":{"description":"■ TWITTER - http://twitter.com/themattcastro ■ ► SEND MAIL: PO BOX 248 San Marcos CA 92079 ► SNAPCHAT - heyitsmagikarp ► INSTAGRAM - https://instagram.com/magikarpusedfly ► TWITCH - http://twitch.tv/magikarpusedflylol ═════════════════════════════════════ Join the TeamSpeak Server - ts76.gameservers.com:9219 Play FAN GAMES by joining the Karp Krew chatroom on League of Legends ═════════════════════════════════════","url":"https://www.youtube.com/watch?v=THH6M3UQaJI","image":"https://i.ytimg.com/vi/THH6M3UQaJI/hqdefault.jpg"},"up_votes":2,"down_votes":3,"body":"Fangen wir an. In dem neuen Hextech crafting System gibt es leider mehrere dinge die unangenehm oder einfach dumm sind.\r\n\r\n Mir bringt es nichts. Die ganze crafting Sache kommt mir unn&uuml;tz und langweilig vor weil man zu viele Begrenzungen hat wie z.B. \r\n1.Man kann nur durch ein S eine Kiste bekommen. \r\n2.Man bekommt auch nur eine Kiste wenn man nicht schon eine mit diesem Champ verdient hat. \r\n3.Man muss sich einen schl&uuml;ssel zusammen bauen. \r\n4.Du kriegst nur einen Schl&uuml;sselfragment wenn du ein A hast und das spiel gewinnst. \r\n5.Du kannst Fragmente von Skins/Champions bekommen, die du schon hast\r\n6.Die Fragmente haben keinen wert wenn man sich etwas Neues draus bauen m&ouml;chte\r\n7. Riot will schon wieder nur Geld von etwas v&ouml;llig wertlosem\r\n8. Die Schl&uuml;sselfragmente und Kisten bekommt man &ouml;fters v&ouml;llig random\r\n\r\nIch erwarte nicht, dass ich einfach mal so Skins hinterher geschmissen bekomme, aber ich will auch nicht nur 3 Kisten in einer\r\nSeason &ouml;ffnen k&ouml;nnen weil es einfach zu viele Begrenzungen gibt.","replies":[{"poster":"Vischkopf","date":"2016-03-29T00:51:38.448+0000","up_votes":2,"down_votes":0,"body":"Vorwort:\nAlles was ich hier schreibe beruht auf meiner \"_**eigenen**_\" Meinung. Jeder hat seine eigene Meinung und diese respektiere ich auch. Ich gebe nur mein Kommentar und \"_**meine**_\" Meinung zu den genannten Punkten des Threadautors ab. :)\n\nZu Punkt 1:\nGanz einfach. Die Kisten wären sonst zu unselten. Was bringt es die Shards fast in jedem Game zu bekommen? Du wirst halt für deine guten Leistungen in einem Game belohnt.\n\nZu Punkt 2:\nDas soll die Leute dazu bringen auch noch andere Champions auszutesten um dem Beschwörer das volle Spielerlebnis zu zeigen. Dazu könnte es _**neuen**_ Spielern dabei helfen, \"seinen Champ\" und die passende Rolle zu finden, da es später, wenn du wirklich climben willst, wichtig ist sich auf 2 - 3 Champions zu fixieren also zu \"mainen\". Also wieso sollten diese nicht belohnt werden, wenn sie sich den langen Weg vornehmen und teilweise gute Leistungen erzielen. Wenn du ein OneTrickPony bist oder kein Bock drauf hast ist da nix zu machen, ist ja auch deine Entscheidung da sag ich nix gegen.\n\nZu Punkt 3:\nEiner der Gründe wieso es Hextech \"Crafting\" heißen könnte. Finde ist nicht zu bestreiten. Du kannst Skins bekommen die dich normalerweise 20€ (Ultimates) kosten. Da finde ich es nur richtig es \"schwerer\" zu machen um diese zu permanenten Skins aufzuwerten.\n\nZu Punkt 4: \nDas konnte ich bisjetzt nicht feststellen ob es wirklich so ist. Falls es so ist, begründe ich dies mit meiner Meinung zu Punkt 3.\n\nZu Punkt 5:\nKonnte ich auch noch nicht feststellen. Das verlinkte Video habe ich mir ehrlich gesagt nicht angeschaut. Muss ich auch nicht um meine Meinung abzugeben.^^ Aber falls es wirklich so ist, muss ich dir da zustimmen. Es ist wirklich sinnlos, wenn man Shards von Champions (hab ja schon alle) oder Skins bekommen kann, die man schon besitzt, wobei man diese zum \"rerollen\" nutzen könnte.\n\nZu Punkt 6:\nIch schätze mal du meinst damit die \"Reroll\" Funktion. Inwiefern ist das denn ein Kritikpunkt. Ich interpretiere es jetzt mal so, dass man, obwohl man als Beispiel 1 Legendary Skin für 1820 RP und 2 975 RP Skins, trotzdem nen 750 RP Skin statt nen Ultimate rausbekommen könnte. Das ist dann eben Glückssache und ja, das heißt es ist fast unmöglich in einem absehbaren Zeitraum alle Skins zu finden und aufzuwerten zu permanenten Skins. Aber da kann ich Riot verstehen. Sie bieten eine Community mit 31 Millionen Spielern allein auf EUWest als \"Free2Play\" Spiel. Da werde ich Rito bestimmt nicht kritisieren, wenn sie eine ihrer wenigen Geldquellen nicht komplett aufgeben wollen, um dieses Spiel am laufen zu halten.\n\nZu Punkt 7:\nIch verweise auf die letzten Sätze meines Kommentars zu Punkt 6.\n\nZu Punkt 8:\nKann ich nicht viel zu sagen.\n\nSchlusswort:\nMeiner Meinung nach kann man mehr als 3 Truhen pro Season öffnen.^^ Hab ja jetzt schon 7 geöffnet OHNE mir Schlüssel oder Kisten zu kaufen.\nRechtschreibfehler dürft ihr behalten und nochmal: Das ist alles meine Meinung. Falls ihr ne andere Meinung zu habt, dürft ihr diese hier gerne kommentieren. Ich kritisiere hiermit niemanden. Ich gebe ledeglich meine Meinung als Antwort auf die von Kasten4 genannten Punkte.\n\nMFG der Seraph.^^","replies":[{"poster":"Kasten4","date":"2016-03-29T14:37:52.464+0000","up_votes":1,"down_votes":0,"body":"Das mit den 3 Truhen war nur eine Gefühlssache. Außerdem habe ich nur ein Problem mit der masse an Begrenzungen nicht mit Begrenzungen selbst.","replies":[]},{"poster":"BoomstreetJr","date":"2016-03-29T01:01:03.448+0000","up_votes":1,"down_votes":0,"body":"Kann ich mal fragen, wie du 7 öffnen konntest? Hast du etwa 3 Juwelen bekommen?","replies":[{"poster":"Vischkopf","date":"2016-03-29T01:13:14.714+0000","up_votes":1,"down_votes":0,"body":"Jup.^^","replies":[{"poster":"BoomstreetJr","date":"2016-03-29T01:34:26.624+0000","up_votes":1,"down_votes":0,"body":"Glückspilz{{sticker:slayer-pantheon-rainbows}} ","replies":[{"poster":"Pandaphiri","date":"2016-03-29T05:56:08.599+0000","up_votes":1,"down_votes":1,"body":"hatte auch ein war aber nur nen alistar drinnen und mehr nicht o.o pechtruhe x.x","replies":[{"poster":"Teemo Main","date":"2016-03-29T06:23:53.257+0000","up_votes":1,"down_votes":1,"body":"HexTech Annie skin interessiert dich nicht so? ;D","replies":[{"poster":"Pandaphiri","date":"2016-03-29T06:31:16.442+0000","up_votes":1,"down_votes":1,"body":"keine ahnung wie du da drauf kommst aber ich wollte es nur mal testen. keine ahnung warum du das wissen musst aber bitte da hassu deine info o.o dazumal gesagt wurde das es wegen dem hextech annie skin später noch irgendwelche andere kisten geben soll.","replies":[{"poster":"Teemo Main","date":"2016-03-29T09:15:06.720+0000","up_votes":1,"down_votes":1,"body":"super deutsch danke fürs gespräch.","replies":[{"poster":"Pandaphiri","date":"2016-03-29T09:23:41.246+0000","up_votes":1,"down_votes":1,"body":"keine ahnung wo dein problem ist. hat dir jemand dein Müßli geklaut oder deine Milch heute nicht bekommen? Wenn de nix zu sagen hast sag am besten nichts anstatt andere über ihre Schreibweise zu Kritisieren.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Kasten4","date":"2016-03-29T14:34:59.468+0000","up_votes":1,"down_votes":0,"body":"Also, nochmal um das klarzustellen. Ich finde es gibt zu viele begrenzungen dafür das es mir etwas wert ist. Das finde ich schade da ich schon viel spaß mit CS:GO Kisten hatte, da nicht so viel um den heißen Brei herumgeredet wird. Ausserdemhabe ich 6. etwas schlecht erklärt, also hier ein Szenario:\n\nDu baust dir aus einem 1350Rp skin, einem 1820Rp skin und einem 520Rp Skin einen Permanenten Random Skin. Du Bekommst aber nur einen 520Rp skin daraus. Dies passiert bei Skin unboxings sehr oft, was anscheinend bedeutet, dass der 1350rp skin shard und der 1820rp skin shard nicht gerade zum Wert beitragen. Es frustriert mich ja schon so, dass ich nur selten was gutes bekomme aber ich möchte auch nicht, gute skin shards die ich schon habe ''wegwerfen'' weil sie keinen Wert haben.{{sticker:slayer-pantheon-popcorn}}  ich freu mich schon auf die kommentare.","replies":[]},{"poster":"BoomstreetJr","date":"2016-03-29T00:39:13.702+0000","up_votes":1,"down_votes":0,"body":"1. S+, S und S-\n2. Es hilft ungemein, mit einem Freund zusammenzuspielen. Man kann auch einfach seine Mains spielen. Es sind im Moment sowieso erstmal 4 Truhen.\n3. Naja\n4. Man kriegt Fragmente durch Siege. Die Bewertung spielt dabei keine Rolle.\n5. Ist alles nur Zufall\n6. Entzaubere sie oder wandle sie um.\n7. Das ist unnötig.\n8. Das soll auch so sein, sonst könnte man das System total ausnutzen.\n\nInsgesamt kann man 52 Kisten kostenlos pro Saison öffnen. Beschwer dich nicht. Ein Grund mehr, mit Freunden und mit neuen Champs zu spielen.\n(Ich habe meine 4 Truhen in den ersten 4 Spieken sofort bekommen, es ist also nicht schwer)","replies":[]}]}