{"poster":"Lucid Rage","date":"2016-12-10T14:16:27.015+0000","title":"Aktiver Clan sucht neue Member!","subforum":"Clans & Teams","up_votes":17,"down_votes":15,"body":"**Hallo LoL-Community**,\r\n\r\nwir sind ein  **sehr aktiver Clan** , der noch weitere Spieler f&uuml;r seinen Clan sucht.\r\nWir setzen auf Gemeinschaft und ein freundliches Miteinander, wollen uns zwar stetig vergr&ouml;&szlig;ern, wobei es uns sehr auf das freundschaftliche Miteinander ankommt. Daher ist es uns sehr wichtig neue Member und Interessenten in unsere Community zu integrieren.\r\n\r\nAu&szlig;erdem bieten wir interne Turniere und Spielabende f&uuml;r League of Legends, CS Go und einigen anderen Spielen. Diese Veranstaltungen finden bei uns regelm&auml;&szlig;ig statt und sind f&uuml;r jeden zug&auml;nglich. &Uuml;ber deine Beteiligung am Clanleben und deine Vorschl&auml;ge w&uuml;rden wir uns sehr freuen, denn uns ist die Meinung unserer Member wichtig!\r\n\r\nSolltet ihr nun also ein Team suchen, so werdet ihr hier zwar auf jeden Fall f&uuml;ndig werden, jedoch soll sich das weitere Clanleben dann auf keinen Fall nur darauf beschr&auml;nken, sondern es sollte auch au&szlig;erhalb noch zur Interaktion mit weiteren Spielern kommen.\r\n\r\nAuch bieten wir unseren Membern ein LoL-Training an. Dabei besprechen wir viele relevante Themen um bei League of Legends besser zu werden und coachen euch anschlie&szlig;end individuell. Auch sind viele Diskusionen &uuml;ber die Meta, Builds und viele andere Themen dabei.\r\n\r\n**Gemeinschaft und Zusammenhalt - Wie wir uns das vorstellen &hellip;**\r\n\r\nWir m&ouml;chten, dass nicht nur kleine Gruppen auf dem TS3 hocken, die Nichts miteinander zu tun haben, wie es leider in gro&szlig;en Clans/Communities &ouml;fter der Fall ist.\r\n\r\nDas alles versuchen wir durch verschiedene Ma&szlig;nahmen zu erreichen. So gibt es regelm&auml;&szlig;ig Turniere in allen Bereichen, verschiedene Eventabende, wo auch mal CS:GO- und LoL-Spieler zusammentreffen. Au&szlig;erdem gibt es Clanbesprechungen, wo ein Ausblick &uuml;ber die Clanzukunft gegeben wird und noch dazu bem&uuml;hen wir uns alle teamsuchenden Spieler nach ihren W&uuml;nschen unterzubringen.\r\n\r\nWenn ihr es also leid seid einem Clan oder einer Community zu joinen, wo es nur kleine Gr&uuml;ppchen gibt, die Nichts miteinander zu tun haben (wollen) und sich zum Teil nicht einmal kennen und noch nicht ein einziges Mal f&uuml;r mehr als 5 Minuten im selben Channel waren, dann seid ihr bei uns genau richtig!!!\r\n\r\n\r\n**Das k&ouml;nnen wir euch bieten&hellip;**\r\n\r\n 1. Unterst&uuml;tzung bei der Teamsuche und Teamgr&uuml;ndung\r\n&bull; wenn jemand ein Team gr&uuml;nden m&ouml;chte, bekommt dieses Team entsprechende Channels\r\n&bull; bei der Teamorganisation und Membersuche f&uuml;rs Team helfen wir auch gern\r\n&bull; au&szlig;erdem gibt es zus&auml;tzlich 1mal in der Woche ein Treffen von allen teamlosen Spielern!\r\n\r\n2. Ein freundschaftliches und lustiges Miteinander\r\n\r\n3. Finden von Mitspielern f&uuml;r LoL, CS Go und viele aktuelle Spiele!\r\n&bull; **LoL (100 Spieler)** - ist unser Hauptspiel (Silber &ndash; Diamant)\r\n&bull; **CS:GO (75 Spieler)** - spielen hier ebenso sehr viele Leute\r\n&bull; **7 Days To Die (15 Spieler)** - ist bei uns das beliebteste Survival-Game\r\n&bull; **Overwatch (10 Spieler)** - Gerade neu und viele fangen gerade an\r\n&bull; **Hearthstone (10 Spieler)** - das Spiel hat fast jeder hier, aber wenige richtig aktiv\r\n&bull; und noch viele weitere (sind auch immer f&uuml;r Neues offen)\r\n\r\n\r\nDurchschnittsalter der Member liegt zwischen 22 und 23!\r\n\r\n\r\n**Eine Vielzahl an claninternen Kommunikationsm&ouml;glichkeiten**\r\n&bull; Homepage und Forum zur Koordinierung unserer Veranstaltungen\r\n&bull; zwei Whatsapp-Gruppen (eine wird als Chat genutzt, die andere nur f&uuml;r wichtige Infos)\r\n&bull; eine Facebook-Gruppe\r\n&bull; mehrere Steamgruppen\r\n\r\n\r\n**Das setzen wir unbedingt voraus...**\r\n&bull; Alter 18+\r\n&bull; kommunikativ ohne &uuml;bertrieben zu flamen\r\n&bull; Interesse an einer gr&ouml;&szlig;eren Clangemeinschaft (nicht nur an einem Team!!!)\r\n&bull; Interesse an den Dingen, die im Clan geschehen (Turniere, Abstimmungen etc.)\r\n&bull; dazu bieten wir sowohl Clanbesprechungen als auch ein aktives Forum an\r\n\r\n\r\n**Wie l&auml;uft die Bewerbung ab?**\r\n\r\nIhr added einen unserer Admins &bull; ** Lucid Rage **  &bull; einfach in LoL und wir kl&auml;ren dann vorab ein paar kleine Formalit&auml;ten. Daraufhin werdet ihr in den Teamspeak eingeladen und der Rest findet dort in einem lockeren Gespr&auml;ch statt. Die Termine f&uuml;r die Gespr&auml;chae auf dem Ts teilen wir euch dann bei LoL mit. Falls wir euch nicht direkt annehmen schreibt uns gerne an wenn ihr uns online seht.\r\n\r\nDie ersten Gespr&auml;che fangen heute Abend um **17 Uhr** an!\r\n\r\n**Wir freuen uns auf euch!**","replies":[{"poster":"LetoTheQueen","date":"2016-12-11T10:51:55.790+0000","up_votes":1,"down_votes":0,"body":"Nehmt ihr auch Anfänger auf, die kein Ranked spielen? :o\n\n(Nur auf LoL bezogen, in Overwatch kenn ich mich bestens aus)","replies":[{"poster":"Gooflike","date":"2016-12-12T08:28:10.612+0000","up_votes":1,"down_votes":0,"body":"Ja haben paar Leute die auch erst angefangen haben","replies":[]}]},{"poster":"Shadowbalder","date":"2016-12-11T15:23:31.525+0000","up_votes":1,"down_votes":0,"body":"Habe ihn geaddet und würde mich freuen wenn ich eingeladen werde\n\nLg Shadowbalder","replies":[]},{"poster":"ClaptrapTheGreat","date":"2016-12-11T14:44:37.820+0000","up_votes":1,"down_votes":0,"body":"könnt ihr was alter angeht auch ausnahmen machen? bin zwar unter 18 aber weiss wie man sich verhalten soll","replies":[]},{"poster":"I Make U Zed","date":"2016-12-11T13:47:51.458+0000","up_votes":1,"down_votes":0,"body":"Hört sich echt gut an, was ihr hier in eurem Thread erzählt :) Hab den guten Lucid Rage bereits geaddet, und hoffe bald mal vorbeischauen zu dürfen :)","replies":[]},{"poster":"Supportsmanlike","date":"2016-12-11T04:25:04.499+0000","up_votes":1,"down_votes":0,"body":"Schaut gern alle mal vorbei, ist echt chillig bei uns :3","replies":[]},{"poster":"Coinflîp Support","date":"2016-12-10T20:40:22.172+0000","up_votes":1,"down_votes":0,"body":"Ist Lucid Rage noch Online ?","replies":[]}]}