{"poster":"McKieran","date":"2017-04-13T03:25:30.771+0000","title":"Can I use a USB drive to hold some of LoL's files and hold the client start up on my laptop and play","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"My laptop has a 32GB HD and the system's apps and such take about 20GB.\r\n\r\nIs it possible to hold some of the files on a usb drive and some on the laptop and play the game?{{summoner:6}}","replies":[{"poster":"Porocles","date":"2017-04-13T17:57:08.831+0000","up_votes":1,"down_votes":0,"body":"Na, League will want to save to your main directory.  Attempting to use a USB would only cause the patcher to redownload patches every time you load the game and would only last temporarily.  Per the [minimum specs guide](https://support.riotgames.com/hc/en-us/articles/201752654-Minimum-and-Recommended-System-Requirements), you'll want at least 8 gb of space.  If possible, you may want to look into upgrading your hard drive.  Let me know if that clears things up!","replies":[{"poster":"DarkRitual","date":"2017-04-13T22:09:15.984+0000","up_votes":1,"down_votes":0,"body":"Generally, laptops have removable and upgradeable Hard Drives.\n\nHowever, using a USB hard drive, windows detects it as an additional hard drive that shows up as a Local Disk. I've moved my old laptop hard drive to one on my desktop.\nIt's possible to change windows' default directory for program installs, but LoL doesn't even use that.\n\nUsed to be able to select an install directory, and am confused as to why that would have been removed.\n\nI want to say there is likely a solution, but would probably be pretty convoluted and risky with modifying registry stuff.\n\n\n/endrandomthoughts","replies":[{"poster":"McKieran","date":"2017-04-14T01:41:30.828+0000","up_votes":1,"down_votes":0,"body":"Thanks guys, I think I will just save up and get a new one. feelsbadman{{champion:32}}","replies":[{"poster":"DarkRitual","date":"2017-04-14T02:41:01.620+0000","up_votes":1,"down_votes":0,"body":"Looking just on EBay, $50 should get you plenty of space. Just make sure that whatever you end up getting is compatible with your laptop.","replies":[]}]}]}]},{"poster":"McKieran","date":"2017-04-13T03:26:31.494+0000","up_votes":1,"down_votes":0,"body":"inb4 i know it's shitty. but no trolls pls. Seriously want to know.{{item:1038}}","replies":[]}]}