{"poster":"Antipeel","date":"2017-10-12T05:32:51.735+0000","title":"Kartenaufmerksamkeit Stellenwert","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Hallo =)\r\nIch spiele Lol schon seeeehr lange und habe es stehts geschafft die Minimap zu ignorieren.\r\nHabe es mittlerweile mit Spielern im Bereich Gold1-Platin 2 zu tun und es f&auml;llt auf das ich oft Nachteile dadurch habe.\r\n\r\nMich interessiert Deine Erfahrung zur Mapawarness,quasi ein Vorher/Nachher - Vergleich.\r\nEtwas strikt runtergebrochen, wenn ( ja ist immer nur ein sehr vager Wert) die Normal MMR auf ca 1800 ist und ich anfangen w&uuml;rde\r\nmich mit dermapawarness zu besch&auml;ftigen, wie viel mmr kann das ausmachen?\r\nIch habe viel Spa&szlig; in Normals,merke aber das durch schlechte Mechanics und** sehr** mieserable Aufmerksamkeit mein Team einen gro&szlig;en Nachteil mit mir hat =(\r\n\r\nStumpf gefragt, wieviel mmr+ kann das bringen? \r\nMap was ist das? ---&gt; ich gucke alle 3 Sekunden auf die Karte  \r\n\r\nTut mir Leid f&uuml;r die merkw&uuml;rdige Frage aber als fauler Mensch muss ich abw&auml;gen ob sich der Aufwand _etwas_ oder_ sehr _lohnt ^^","replies":[{"poster":"ninju7su","date":"2017-10-12T06:59:23.688+0000","up_votes":2,"down_votes":0,"body":"League ist ein Teamspiel. Du kannst nur im Team spielen, wenn du die nötigen Informationen hast, was wann wo passiert. Zu sagen das die Map der RÜckspiegel sei, finde ich noch untertrieben. Map ist eher der Scheinwerfer in der Nacht. Klar siehst du ohne, was zwei Meter vor dir passiert, aber dann ist eh jede Entscheidung zu spät. \n\nAls Supporter fühle ich mich auch als Shotcaller. D.h. ich schaue nicht nur auf die Map um zu wissen was abgeht, sondern auch um andere vor eventuellen Fehlern zu warnen. Auch wenn ich auf der Bot bin und sehe das der Midlaner Richtung Toplaner roamt, Ping ich das. Oder wenn jemand geflankt wird. oder sonstwas. Man kann nicht genau definieren, wie viele Tode man im eigenen Team verhindert, aber lass es pro Spiel mal zwei Tode sein die du alle 3 Spiele somit verhinderst. Dann hast du alle 3 Spiele ein erheblich besseres early. Weniger geflame und bessere Startchancen zu snowballn. Alleine das kann eine oder zwei Divisionen ausmachen. Dazu kommen noch die Tode die du dir selbst ersparst, weil du nicht blindlinks irgendwo reinrennst. Oder die Kills die du mit guter Mapawareness noch bekommen könntest. \n\nMeiner Meinung nach ist Mapawarenis ein fundermentaler Baustein und kann dich locker von Silber ins Gold bringen, wenn du vorher wirklich komplett ohne gespielt hast.","replies":[{"poster":"Antipeel","date":"2017-10-12T10:29:48.550+0000","up_votes":1,"down_votes":0,"body":"das klingt sehr sehr gut=) dann will ich das versuchen, gerade weil ich der Supporter bin =)","replies":[]}]},{"poster":"Awsane","date":"2017-10-12T12:38:59.575+0000","up_votes":1,"down_votes":0,"body":"Also wenn du deinen Map Umgang verbessern willst lohnt es sich entweder die Wecker Methode (also alle paar Sekunden piept er und dann schaust du auf die karte) zu nutzen oder mit Freunden die gut im umgang der karte sind zu spielen die immer callen wo wer ist und das man das dadurch übt.\n\nder umgang mit der Map hat wirklich sehr viel Einfluss darauf wie gut man ist, weil zu wissen von wo und wie viele Gegner kommen ist für die meisten fights unglaublich wichtig. Zudem kam man auch durch map Plays Gegner gezielt aus dem SPiel nehmen.\n\nIch denke nicht man kann sagen welchen Einfluss das absolut haben wird aber ich denke 1 Liga ist Locker drinnen wenn mans vorher gar nicht gemacht hat und smart damit am Ende umgeht.","replies":[{"poster":"Antipeel","date":"2017-10-18T09:49:26.752+0000","up_votes":1,"down_votes":0,"body":"die idee mit dem wecker ist stmupf und gleichzeitig witzig^^ das probier ich aus =)","replies":[]}]},{"poster":"Gordalf","date":"2017-10-12T16:25:36.539+0000","up_votes":1,"down_votes":0,"body":"Wie willste denn jemals richtig engagen oder rotations machen, wenn du nicht weißt wo die Gegner oder auch teammates sind?\nWobei teammates könntest noch mit den F-keys machen, aber das bezweifle ich das du das machst xD\n\nSelbst in low elo solltest du regelmässig auf die minimap schauen.\nMir völlig unverständlich wie man sowas selbstverständliches in Frage stellen kann.","replies":[{"poster":"Antipeel","date":"2017-10-18T09:47:40.495+0000","up_votes":1,"down_votes":0,"body":"ja du liegst richtig das nutze ich bis jetzt auch noch nciht^^","replies":[]}]},{"poster":"ouhw","date":"2017-10-13T09:35:32.709+0000","up_votes":1,"down_votes":0,"body":"Es gibt keine Formel, mit der du ausrechnen kannst, wieviel Mapawareness einfluss auf deinen persönlichen Ladder Climb hat, positiv auswirken wird es sich aber definitiv.","replies":[]},{"poster":"Abasin","date":"2017-10-12T06:00:21.632+0000","up_votes":1,"down_votes":0,"body":"Alles was Deine MMR verbessert, lohnt sich, und Minimap schauen ist wie der Rückspiegel im Auto. Warum Du überhaupt so eine Mühe auf Dich nimmst und eine an sich überflüssige Frage stellst, ist mir allerdings unbegreiflich, wenn Du so faul bist wie Du behauptest.","replies":[{"poster":"Antipeel","date":"2017-10-12T10:28:57.184+0000","up_votes":1,"down_votes":0,"body":"ja die frage ist merkwürdig räume ich absolut ein. Stelle mich nur ziemlich blöde an bei der Karte.","replies":[]}]},{"poster":"XenesisCH","date":"2017-10-12T06:56:39.129+0000","up_votes":1,"down_votes":0,"body":"Ich würde mal sagen, dass dir die Minimap schon viele Vorteile bringen kann und zu wissen, dass z. B. der gegnerische Jungler weit weg ist und dich beim nächsten Trade, All-in oder beim Towerpushen  etc. nicht stören kann, ist halt wirklich Gold wert. Also ja die Minimap ist ein ausgezeichnetes Entscheidungstool für deine geplanten Aktionen, natürlich ist die Entscheidung immer eine Ermessens Sache, sprich sie hängt dann von deinem Wissen und Erfahrung ab ;-)","replies":[]}]}