{"poster":"Absynthfee","date":"2016-07-20T17:36:09.097+0000","title":"Was heist es für euch \"Ranked\" zu spielen?","subforum":"Level Up: Guides & Tipps","up_votes":8,"down_votes":0,"body":"Hey Summoners,\nIch habe diese Woche meine Rankeds gespielt. Habe im September angefangen LoL zu spielen und in der Zeit einiges an Erfahrung gesammelt. Es macht meega Spa&szlig; Normals zu spielen, obwohl da ab und zu mal paar unsch&ouml;ne Spiele mit flaming, afk und trolling dabei sind. Von Youtubern und Freunden weis ich aber, dass das ja nur in normals sind und in Rankeds getryhardet wird....... **Dachte ich**\nJetzt spiele ich also meine **Rankeds** guter Hoffnung, dass die Leute **alles geben was sie k&ouml;nnen**. Doch leider wurde ich hier gewalltig entt&auml;uscht. In 4 -** ja 4!** - Spielen sind Leute** afk gegangen. Warum??** Bei nem SPielstand von 8 zu 10 f&uuml;rs andere Team in **Minute 20**. In einem anderen Fall, weil der Talon (top) dem Zed (mid) den Bluebuff stiehlt. {{sticker:zombie-brand-mindblown}} \n\nMeine Placements liefen jetzt mit 3 zu 7 aus... Wenn ich mir &uuml;berlege, dass wir 4 von 7 Niederlagen 4v5 gespielt haben.... Das deprimiert gewalltig.\n**Hiermit bitte ich jeden Beschw&ouml;rer sich zu &uuml;berlegen, warum er Ranked spielt, und was Ranked bedeutet.**\n\nF&uuml;r mich heist Ranked\n- sich mit anderen zu messen\n- alles zu geben\n- sehen, wie gut ich im Vergleich mit anderen bin\n- ein Feedback auf meine Leistung zu bekommen\n\nBIs jetzt kann ich mein Silber 5 leider nicht als Feedback sehen, sondern einfach nur als Schande f&uuml;r die Community. F&uuml;r solche Teammitglieder Sch&auml;me ich micht. W&uuml;rde jeder neue Spieler mit denen gematched werden, w&uuml;rde er das Spiel nicht weiter spielen, weil es frustriert, egal ob du selbst gut oder schlecht spielst. \n\n**Schreibt mal eure Meinung dazu. Hatte ich in den 10 Spielen einfach nur Pech? Was heist es f&uuml;r euch &quot;_Rankeds zu spielen?_&quot;**\n\n\nEure Absynthfee :D{{sticker:slayer-jinx-wink}}","replies":[{"poster":"ΑοΚι","date":"2016-07-20T21:42:25.477+0000","up_votes":4,"down_votes":0,"body":"Also für mich persönlich sind rankeds die Bestätigung zu sehen, ob man sich verbessert bzw. um zu sehen was die anderen \"bösen\" Gegner so können...was man selbst noch nicht so gut kann ;)\nEs ist nunmal so, dass man nur durch rankeds direkt seinen Fortschritt erkennt (wo war ich vor 2 Monaten und wo bin ich jetzt beispielsweiße). In normal games üben die meisten neue Sachen - tryhards gibt's immer - und somit kann man nie wirklich sagen wie man jetzt den Sieg oder die Niederlage werten soll. Darüber hinaus kann man in normals ruhiger und entspannter spielen, da man nichts vor Augen hat wo einem gezeigt wird wo man \"steht\". \n\nUm noch auf eins zwei Dinge einzugehen die ich weiter oben gelesen habe...\nSilber 5 ist mehr oder weniger der Standard für neue Spieler. Ja ich meine die Blutsanfänger! Und nicht die ganzen Smurfs c: \nEs wird sich mit der Zeit zeigen wo du hingehörst bzw. wirst du selbst erkennen wo deine Grenze ist sobald du nicht mehr climbst. Die Rede ist nicht von 20-30 Spielen in derselben Division, sondern eher von einigen x... ja viele halt :p\nEs muss sich somit nicht nach 100 games zeigen wo du hingehörst (wurd iwo hier mal erwähnt) sondern es können auch wie bei mir puuh...bin ich schon bei 600 rankeds die season? Naja man kann immer weiter climben solange man aus seinen Fehlern lernt und sich stets bessert.\n\nNoch ein paar Anmerkungen:\n1. Ich spiele seit season 5 rankeds. Ich war am Ende der letzten season Silber 4 und stehe nun in Platin 3...hab mich also ordentlich verbessert. Man kann also überall rauskommen ;) War auch ziemmich lange in Bronze und weiß daher von was ich rede :D\n2. Es ist immer und überall die Rede von den toxics/flamern/trolln/afk's/etc... Man muss das ganze einmal nüchtern betrachten und sich seine eigenen Fehler eingestehen. Ja jeder macht Fehler von Bronze 5 bis Challenger. Nur sehen es die einen in der Regel ein und die anderen schieben es auf ihre teammates! Es ist immer ein 5vs5 wovon man selbst einer ist. Also können im eigenen Team nur 4 potenzielle *hust* Chaoten sein und im gegnerischen Team 5, wenn man davon ausgeht das man alles richtig macht. Man kann also im Prinzip eine win rate von 50% aufweisen egal wie oft man getrollt wird, da man selbst \"gut\" ist. Um es einmal anders zu betrachten...nehmen wir die 10 placements und die 10 Spieler im jeweiligen Spiel. Wenn man selbst besser als seine jetztige elo ist bedeutet es ja im Grunde das man nur in jedem 11 Spiel einen fatalen Fehler machen darf. Mit den Fehlern meine ich jetzt einmal alles! Feeden (muss nicht beabsichtigt sein!), afk gehn für einige minuten, teammates flamen sodass sie ragn/quitn/etc., usw. diese Geschichten sollten glaube ich jedem bekannt sein. Denn in den statistisch betrachtet anderen 10 games hat man entweder alleine/mit anderen gecarryt oder war neutral dabei, wodurch man keinen sonderlichen Nachteil hatte und es somit auf Dauer nur dazu kommen kann das man aufsteigt.\n\nZu viel geschrieben.... erstmal ne Pause ._.","replies":[]},{"poster":"EviLTeDDi Bear","date":"2016-07-20T18:03:37.467+0000","up_votes":2,"down_votes":5,"body":"Fange vllt erstmal an die Schuld bei dir zu suchen und nicht bei anderen.","replies":[{"poster":"RM Heartmeander","date":"2016-07-20T18:14:48.095+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=EviLTeDDi Bear,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=0001,timestamp=2016-07-20T18:03:37.467+0000)\n>\n> Fange vllt erstmal an die Schuld bei dir zu suchen und nicht bei anderen.\n\nFang vielleicht ersmal an den Beitrag zu lesen bevor du postest.","replies":[{"poster":"EviLTeDDi Bear","date":"2016-07-20T18:21:53.414+0000","up_votes":1,"down_votes":7,"body":"Das solltest du vllt tun da hast du Recht.","replies":[{"poster":"OT Riku","date":"2016-07-20T18:30:11.577+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=EviLTeDDi Bear,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=000100000000,timestamp=2016-07-20T18:21:53.414+0000)\n>\n> Das solltest du vllt tun da hast du Recht.\n\nSeine Post war nur eine Frage warum wir Ranked spielen.\nnicht ich hab wegen afks verloren auch wenn es so ausgebe mag.\nIch beschwere mich auch über Afks in dem einen oder anderen Spiel oder Flamen oder sonst was aber ich weiß  das ich wegen jenen Leuten auch mal gewinne td frustet es in sowas wie den Placements.","replies":[{"poster":"EviLTeDDi Bear","date":"2016-07-20T18:38:08.958+0000","up_votes":1,"down_votes":5,"body":"Heißt nicht das meine Antwort verboten ist^^","replies":[{"poster":"OT Riku","date":"2016-07-20T19:08:28.681+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EviLTeDDi Bear,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=00010000000000000000,timestamp=2016-07-20T18:38:08.958+0000)\n>\n> Heißt nicht das meine Antwort verboten ist^^\n\ndas weiß ich aber ich wollte nur mal klarstellen ob du diesen Post nicht falsch interpretiert hast ;)","replies":[]}]}]}]}]},{"poster":"Absynthfee","date":"2016-07-20T20:09:02.025+0000","up_votes":4,"down_votes":0,"body":"Ich könnte jetzt natürlich sagen, dass es nicht an mir lag und natürlich nur an den anderen. Aber du hast recht, nach Gold gehöre ich wahrscheinlich noch nicht, dafür habe ich die CHampions meistens noch nicht gut genug drauf. So habe ich auch das ein oder andere Spiel meine Midlane verloren. Und meine Mates haben mir in dem einen Spiel zum Sieg verholfen. Weil sie bis zum Schluss alles gegeben haben. Und ich auch. Und so findet man seine Liga. Mich stört die** Art und Weise des Verlierens**. Die leute bemühen sich (in meinen Rankeds zumindest (in einigen)) weniger als in normals, so empfinde ich es zumindest.\n\nIn dieser Runde gehts nicht darum, ob jemand (oder ich) gut oder schlecht is. Mir gehts darum, dass man sich bemüht und alles gibt. Immer mit dem gedanken, es spielen auch andere mit, die meine Hilfe brauchen. Deshalb sind es Rankeds - und deshalb gibt es Normals (wenn ich nur mal zum entspannen 60% geben will und nich 110%)","replies":[{"poster":"InfectedGreed","date":"2016-07-21T09:00:49.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Absynthfee,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=00010001,timestamp=2016-07-20T20:09:02.025+0000)\n>\n> Ich könnte jetzt natürlich sagen, dass es nicht an mir lag und natürlich nur an den anderen. Aber du hast recht, nach Gold gehöre ich wahrscheinlich noch nicht, dafür habe ich die CHampions meistens noch nicht gut genug drauf. So habe ich auch das ein oder andere Spiel meine Midlane verloren. Und meine Mates haben mir in dem einen Spiel zum Sieg verholfen. Weil sie bis zum Schluss alles gegeben haben. Und ich auch. Und so findet man seine Liga. Mich stört die** Art und Weise des Verlierens**. Die leute bemühen sich (in meinen Rankeds zumindest (in einigen)) weniger als in normals, so empfinde ich es zumindest.\n> \n> In dieser Runde gehts nicht darum, ob jemand (oder ich) gut oder schlecht is. Mir gehts darum, dass man sich bemüht und alles gibt. Immer mit dem gedanken, es spielen auch andere mit, die meine Hilfe brauchen. Deshalb sind es Rankeds - und deshalb gibt es Normals (wenn ich nur mal zum entspannen 60% geben will und nich 110%)\n\nIch würde nicht behaupten das die Leute sich im Ranked weniger reinhängen.\n\nEs ist vielmehr so, das man ab einer bestimmten Elo weiß, wann ein Game gelaufen ist.\n\nEin Beispiel:\nDein Team hat in der 25 Minute 20 Deaths, das Gegnerischer hat nur 5 Deaths.\n\nAlso 20Kills vs 5 Kills...wenn das Gegnerische Team jetzt auch noch den besseren Farm und möglicherweise mehr Tower und Drakes hat, dann ist das so ein Fall wo man einfach weiß das dass Game gelaufen ist, es sei denn dein Team schafft es ins Lategame (45min +).\n\nUnd da geben halt viele schon vorher auf.\n\nIn Normals weiß kaum einer wie man ein Game in der 25Minute beendet, das halt der Unterschied.","replies":[{"poster":"BMG Seddy","date":"2016-07-23T16:04:55.079+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=InfectedGreed,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=000100010000,timestamp=2016-07-21T09:00:49.135+0000)\n>\n> Ich würde nicht behaupten das die Leute sich im Ranked weniger reinhängen.\n> \n> Es ist vielmehr so, das man ab einer bestimmten Elo weiß, wann ein Game gelaufen ist.\n> \n> Ein Beispiel:\n> Dein Team hat in der 25 Minute 20 Deaths, das Gegnerischer hat nur 5 Deaths.\n> \n> Also 20Kills vs 5 Kills...wenn das Gegnerische Team jetzt auch noch den besseren Farm und möglicherweise mehr Tower und Drakes hat, dann ist das so ein Fall wo man einfach weiß das dass Game gelaufen ist, es sei denn dein Team schafft es ins Lategame (45min +).\n> \n> Und da geben halt viele schon vorher auf.\n> \n> In Normals weiß kaum einer wie man ein Game in der 25Minute beendet, das halt der Unterschied.\n\nAuch nicht wirklich.\nIch hatte einmal ein Spiel, wo der Gegner über 30 Kills hatte und wir gerade mal 10. Wir haben es aber trotzdem durch perfektes Teamwork geschafft das Spiel zu wenden. Soweit ich mich erinnern kann, habe ich sogar versehentlich gefeedet und wurde schon im Early game 5 mal gekillt aber trotzdem bedeutet das ja noch gar nichts. Man muss nur wissen wie man in so einer Situation sein Nexus verteidigt dann kann man auch ein Spiel gewinnen der aussichtslos scheint ^^\nWer auf Hellseher macht und meint das Spiel ist eh verloren, hat meiner Meinung nach auch nichts in Rankeds zu suchen. Man verliert wenn der Nexus down ist, davor kann man alles wenden.","replies":[]}]}]},{"poster":"BMG Seddy","date":"2016-07-23T15:59:22.768+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EviLTeDDi Bear,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=0001,timestamp=2016-07-20T18:03:37.467+0000)\n>\n> Fange vllt erstmal an die Schuld bei dir zu suchen und nicht bei anderen.\n\nSchon wieder so einer.\nDann zeig mal bitte ein Spiel welches du ganz alleine carriest und dann glaube ich dir dass man ganz alleine Schuld an einem verlorenen Spiel ist.\nWeil viel labern kann jeder ^^","replies":[]}]},{"poster":"BMG Seddy","date":"2016-07-23T15:56:24.029+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Absynthfee,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=,timestamp=2016-07-20T17:36:09.097+0000)\n>\n> Hey Summoners,\n> Ich habe diese Woche meine Rankeds gespielt. Habe im September angefangen LoL zu spielen und in der Zeit einiges an Erfahrung gesammelt. Es macht meega Spa&amp;szlig; Normals zu spielen, obwohl da ab und zu mal paar unsch&amp;ouml;ne Spiele mit flaming, afk und trolling dabei sind. Von Youtubern und Freunden weis ich aber, dass das ja nur in normals sind und in Rankeds getryhardet wird....... **Dachte ich**\n> Jetzt spiele ich also meine **Rankeds** guter Hoffnung, dass die Leute **alles geben was sie k&amp;ouml;nnen**. Doch leider wurde ich hier gewalltig entt&amp;auml;uscht. In 4 -** ja 4!** - Spielen sind Leute** afk gegangen. Warum??** Bei nem SPielstand von 8 zu 10 f&amp;uuml;rs andere Team in **Minute 20**. In einem anderen Fall, weil der Talon (top) dem Zed (mid) den Bluebuff stiehlt. {{sticker:zombie-brand-mindblown}} \n> \n> Meine Placements liefen jetzt mit 3 zu 7 aus... Wenn ich mir &amp;uuml;berlege, dass wir 4 von 7 Niederlagen 4v5 gespielt haben.... Das deprimiert gewalltig.\n> **Hiermit bitte ich jeden Beschw&amp;ouml;rer sich zu &amp;uuml;berlegen, warum er Ranked spielt, und was Ranked bedeutet.**\n> \n> F&amp;uuml;r mich heist Ranked\n> - sich mit anderen zu messen\n> - alles zu geben\n> - sehen, wie gut ich im Vergleich mit anderen bin\n> - ein Feedback auf meine Leistung zu bekommen\n> \n> BIs jetzt kann ich mein Silber 5 leider nicht als Feedback sehen, sondern einfach nur als Schande f&amp;uuml;r die Community. F&amp;uuml;r solche Teammitglieder Sch&amp;auml;me ich micht. W&amp;uuml;rde jeder neue Spieler mit denen gematched werden, w&amp;uuml;rde er das Spiel nicht weiter spielen, weil es frustriert, egal ob du selbst gut oder schlecht spielst. \n> \n> **Schreibt mal eure Meinung dazu. Hatte ich in den 10 Spielen einfach nur Pech? Was heist es f&amp;uuml;r euch &amp;quot;_Rankeds zu spielen?_&amp;quot;**\n> \n> \n> Eure Absynthfee :D{{sticker:slayer-jinx-wink}}\n\nSelbe Erfahrung gemacht.\nIch denke mir \"hey cool komm spiel manl Rankeds da kommen bestimmt gute Spieler die alles geben\" aber ich wurde haushoch enttäuscht als ich gemerkt habe, dass es in Rankeds teilweise sogar viel schlimmer ist als in Normals. Ohne ein Team kommst du da nicht weit voran egal wie gut du spielst. Mir wurde oft erzählt man müsse carrien können was aber auch totaler Quatsch ist da kannst du jeden hinstellen den du willst, egal ob Vollprofi oder Fortgeschrittener ein Spiel in dem deine Mates nur feeden, leaven und flamen wird auch ein Pro nicht gewinnen weil 1 vs 5 carrien kann man nur wenn das Teamwork stimmt.\n\nUnd nein du hast nicht Pech das ist ganz normal das du mit Leuten gematched wirst (in Rankeds!!!) die ständig nur rum flamen und dazu führen dass du erst gar nicht dazu kommst zu climben.\nIch selbst war Bronze 1, bin runter auf Bronze 5 (wegen dem von dir beschriebenen Problem) und habe es einfach nicht geschafft zu climben weil ich bei fast jedem Spiel 1 vs 5 war. Dann habe ich Normals gespielt und gute Mates gefunden mit denen ich in einem tag auf Bronze 3 hochgestiegen bin (im Vergleich dazu habe ich es in einem Monat nicht mal geschafft LP zu verdienen weil ich Solo gespielt habe). Spiele lieber Normals und suche dir Premates die gut sind, das ist immer noch das beste um überhaupt eine bessere Elo zu bekommen bzw. zu climben. :)","replies":[{"poster":"Chopper7777","date":"2016-07-24T20:51:13.628+0000","up_votes":2,"down_votes":0,"body":"Aua...es tut schon fast weh das ganze zu lesen.\n\nDu solltest erstmal das \"du musst carrien können\" verstehen. Damit ist nicht gemeint 1 vs 5 zu gewinnen. Damit ist gemeint das du gemeinsam mit deinem Team das Spiel carriest.Und das geht in jeder Elo,man muss den Leuten nur gut zureden,sie motivieren,bei Fehlern nicht kritisieren sondern sagen das es egal ist und man weiter kämpfen soll,evtl auch sagen das man bald ganken kommt (ja auch als Mid oder Supp!!!) Solltest du mir nicht glauben dann sieh mal bitter hier rein. http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2765794567/27842164?tab=overview\n\nWar ein 4vs5 und ich habe das Team als Thresh mit guten Hooks und Engages gecarried,das Team hätte fast aufgegeben aber ich habe ihnen gesagt das wir es schaffen können. Hab gute Calls gemacht,ihnen gezeigt das wir auch ohne unseren ADC gewinnen können. Das ganze hat sie offenbar motiviert nicht aufzugeben und wir haben so im Team gearbeitet und ein sehr knappes 4vs5 gewonnen.\n\n\"Und nein du hast nicht Pech das ist ganz normal das du mit Leuten gematched wirst (in Rankeds!!!) die ständig nur rum flamen und dazu führen dass du erst gar nicht dazu kommst zu climben.\"\n\n\nIst auch purer schwachsinn,natürlich wird man immer mal wieder solche Matches haben,aber ich habe mich selber von Silber 3 zu Gold 5 gespielt. Innerhalb 30 Spiele. Und komm nicht mit \"in Bronze ist es schlimmer\" je höher du steigst desto schlimmer wird es,denn da rennen die richtigen Tryhards rum die heulen sobald man 1 cs verfehlt hat.\n\nDass du von B1 nach B5 gedroppt hast sagt auch einiges über dein LoL Spielverhalten aus,kombiniert mit dem Text. Ich sage einfach mal,das du in Bronze 5 gelandet bist ist deine Schuld und nicht die der Teammates.Ein Blick auf deine Matchhistory verrät den rest. Doppelte Warmogs auf einer Support Soraka?! Ein Warmogs wäre ja noch okay.aber zwei? Das ist pure verschwendung.\n\n\"Spiele lieber Normals und suche dir Premates die gut sind, das ist immer noch das beste um überhaupt eine bessere Elo zu bekommen bzw. zu climben. :)\"\n\nAlleine diese Einstellung wird dich niemals besser werden lassen. Keine Ahnung wie lange du bereits LoL aktiv Spielst,aber das was du hier schreibst ist absoluter Schwachsinn. Wenn du glaubst dich von Freunden carrien zu lassen,nur zu. Aber beschwer dich dann nicht wenn du von noch besseren Gegnern fertig gemacht wirst.\n\n\nUnd wie gesagt alleine das anschauen dieses Beitrags+deine Matchhistory reicht dafür das ich sagen kann,du gehörst in Bronze.Aber das ist nicht mal schlimm.Jeder fängt irgendwo mal an,und es liegt an dir dich zu verbessern (das heißt nicht weiterhin Warmogs auf einer Soraka zu stacken) und weiter das Spiel zu lernen. Ich spiele Seit 2011 LoL und bin erst jetzt richtig aktiv Rankeds am zocken,und ich bin in Gold 5,hab mich alleine in Gold gecarried und ich fühle mich dort mehr als wohl.\n\nSetz deine Erwartungen nicht zu hoch,das MMR System von LoL ist zwar nicht perfekt,aber es ist schon ziemlich gut darin Leute richtig zu placen.Und schieb deine verlorenen Matches nicht immer auf deine Teammates,schau erstmal in den Spiegel,bevor du andere Leute kritisierst.","replies":[{"poster":"BMG Seddy","date":"2016-07-28T15:52:09.630+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chopper7777,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=00120000,timestamp=2016-07-24T20:51:13.628+0000)\n>\n> Aua...es tut schon fast weh das ganze zu lesen.\n> \n> Du solltest erstmal das &quot;du musst carrien können&quot; verstehen. Damit ist nicht gemeint 1 vs 5 zu gewinnen. Damit ist gemeint das du gemeinsam mit deinem Team das Spiel carriest.Und das geht in jeder Elo,man muss den Leuten nur gut zureden,sie motivieren,bei Fehlern nicht kritisieren sondern sagen das es egal ist und man weiter kämpfen soll,evtl auch sagen das man bald ganken kommt (ja auch als Mid oder Supp!!!) Solltest du mir nicht glauben dann sieh mal bitter hier rein. http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2765794567/27842164?tab=overview\n> \n> War ein 4vs5 und ich habe das Team als Thresh mit guten Hooks und Engages gecarried,das Team hätte fast aufgegeben aber ich habe ihnen gesagt das wir es schaffen können. Hab gute Calls gemacht,ihnen gezeigt das wir auch ohne unseren ADC gewinnen können. Das ganze hat sie offenbar motiviert nicht aufzugeben und wir haben so im Team gearbeitet und ein sehr knappes 4vs5 gewonnen.\n> \n> &quot;Und nein du hast nicht Pech das ist ganz normal das du mit Leuten gematched wirst (in Rankeds!!!) die ständig nur rum flamen und dazu führen dass du erst gar nicht dazu kommst zu climben.&quot;\n> \n> \n> Ist auch purer schwachsinn,natürlich wird man immer mal wieder solche Matches haben,aber ich habe mich selber von Silber 3 zu Gold 5 gespielt. Innerhalb 30 Spiele. Und komm nicht mit &quot;in Bronze ist es schlimmer&quot; je höher du steigst desto schlimmer wird es,denn da rennen die richtigen Tryhards rum die heulen sobald man 1 cs verfehlt hat.\n> \n> Dass du von B1 nach B5 gedroppt hast sagt auch einiges über dein LoL Spielverhalten aus,kombiniert mit dem Text. Ich sage einfach mal,das du in Bronze 5 gelandet bist ist deine Schuld und nicht die der Teammates.Ein Blick auf deine Matchhistory verrät den rest. Doppelte Warmogs auf einer Support Soraka?! Ein Warmogs wäre ja noch okay.aber zwei? Das ist pure verschwendung.\n> \n> &quot;Spiele lieber Normals und suche dir Premates die gut sind, das ist immer noch das beste um überhaupt eine bessere Elo zu bekommen bzw. zu climben. :)&quot;\n> \n> Alleine diese Einstellung wird dich niemals besser werden lassen. Keine Ahnung wie lange du bereits LoL aktiv Spielst,aber das was du hier schreibst ist absoluter Schwachsinn. Wenn du glaubst dich von Freunden carrien zu lassen,nur zu. Aber beschwer dich dann nicht wenn du von noch besseren Gegnern fertig gemacht wirst.\n> \n> \n> Und wie gesagt alleine das anschauen dieses Beitrags+deine Matchhistory reicht dafür das ich sagen kann,du gehörst in Bronze.Aber das ist nicht mal schlimm.Jeder fängt irgendwo mal an,und es liegt an dir dich zu verbessern (das heißt nicht weiterhin Warmogs auf einer Soraka zu stacken) und weiter das Spiel zu lernen. Ich spiele Seit 2011 LoL und bin erst jetzt richtig aktiv Rankeds am zocken,und ich bin in Gold 5,hab mich alleine in Gold gecarried und ich fühle mich dort mehr als wohl.\n> \n> Setz deine Erwartungen nicht zu hoch,das MMR System von LoL ist zwar nicht perfekt,aber es ist schon ziemlich gut darin Leute richtig zu placen.Und schieb deine verlorenen Matches nicht immer auf deine Teammates,schau erstmal in den Spiegel,bevor du andere Leute kritisierst.\n\nHabe ich je behauptet dass ich zu einer anderen Elo gehöre? nein. Lies bitte zuerst bevor du so einen Schwachsinn schreibst.\nIch spiele erst seit 6 Monaten LoL und spiele zurzeit nur Normals um mehr Erafhrung über Champs zu gewinnen um dann später Rankeds zu spielen. 4vs5 gecarried habe ich mehr als oft genug, ich rede aber davon das 4 mates inaktiv sind und du ganz alleine gegen 5 spielen musst , was bei Bronze nunmal sehr häufig der Fall ist und da kenn ich mich aus (ich bin schließlich Bronze). Zu deinem Satz \"lass dich ruhig von Freunden carrien\" ist auch wieder so ein Blödsinn. Ich rede hier von guten Leuten die ebenfalls in der selben Elo sind, die aber als Team agieren, so das man auch in einer niedrigeren Elo ein besseres Teamwork erlernt und hochsteigt.\n+ wer rum heult gehört nicht in eine höhere Elo, Ende und aus, denn genau das ist Bronze Verhalten.\nZudem ist es denke ich mal nicht verkahrt als Neuling verschiedene Sachen und ihre Wirkungen auszutesten (wie z.B: Soraka mit 6 x Warmogs) von daher verstehe ich dein Problem nicht oder meinst du ich weiß alles von vorn herein?\nLies bitte einfach vernünftig durch und lerne zu verstehen ich habe nie gesagt das ich der aller beste bin und in Challenger - Elo gehöre ich sagte nur das es sich besser (viel viel besser) spielen lässt, wenn man mit Premates spielt die eben etwas vom Teamwork verstehen, ist meine Eigene Erfahrung die ich mit ihm geteilt habe daher ist dein Kommentar totaler Schwachsinn.Außerdem ist mein Verhalten gegenüber meinen Mates einwandfrei, das ich zu Bronze gehöre liegt darin dass ich vielleicht nicht genug Erafahrung habe, logisch ich spiele erst seit 6 Monaten und das nicht durchgehend weil ich noch ein Privatleben habe ^^\nVerstehe echt dein Problem nicht :D","replies":[{"poster":"Chopper7777","date":"2016-07-29T10:36:15.492+0000","up_votes":1,"down_votes":0,"body":"Mein Problem liegt darin wie du deinen ersten Text formulierst hast.\nEs kam alles so rüber als würdest du versuchen eine menge Schuld an deine Mates abzugeben,und zu empfehlen,Leute zu finden die BESSER sind als man selber damit man in der Elo steigt.","replies":[{"poster":"BMG Seddy","date":"2016-07-29T14:41:17.762+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chopper7777,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=0012000000000000,timestamp=2016-07-29T10:36:15.492+0000)\n>\n> Mein Problem liegt darin wie du deinen ersten Text formulierst hast.\n> Es kam alles so rüber als würdest du versuchen eine menge Schuld an deine Mates abzugeben,und zu empfehlen,Leute zu finden die BESSER sind als man selber damit man in der Elo steigt.\n\nNein das wäre Boosting. Mit guten Mates meine ich Mates die wirklich als Team agieren und eben nicht flamen. Mates mit denen man kommunizieren kann und die auch wissen das man Spiele auch mal verliert und nicht jedes Spiel gewinnen kann ^^ Ich selbst such auch ab und an mal Mates mit denen das Spiel einfach sopaß macht denn genau mit solchen Mates gewinnt man sehr häufig weil man das Blatt häufiger wenden kann. Das war alles was ich gesagt habe ich habe niemals etwas davon gesagt das man Spieler aus höherer Elo suchen soll um sich von denen bossten zu lassen, sondern lediglich , dass man Mates suchen soll die für einen gut geeignet sind (eben gute Mates). Ich slebst würde auch nur mit Leuten aus meiner Elo spielen, wenn ich sehe das diese etas vom Teamwork ingame verstehen aber es giobt nunmal viele Mates die sehr egoistisch sind und eben nicht wirklich als Teammate agieren sondern eher gegen das eigene Team.\nNatürlich trifft in einem verlorenen Spiel niemanden die Schuld, wenn alle Mates das beste geben aber das gegnerische Team nunmal gewonnen hat aber wenn die eigenen Mates trollen und wirklich mit Absicht feeden dann ist die Schuldzuweisung klar und deutlich und da kann man noch so gut sein ^^ Ich gewinne auch öfters Spiele in denen ich mit meinen Mates 4vs5 carrie aber oft verliert man solche Spiele auch und das war alles worüber ich gesprochen habe ^^\nIch spiele auch mit leuten Rankeds die gegen mich 1 vs 1 verloren haben das ist kein problem die müssen also keineswegs besser sein aber eben gut und teamfähig das reicht völlig aus aber die meisten sind es eben nicht (eigene Erfahrung). Jeder macht andere Erfahrungen ich teile meine mit ihm weil er hier im Forum eine Frage gestellt hat und eine Situation erläutert hat für die ich Verständnis zeige aber das muss natürlich nicht auf absolut jeden zutreffen da jeder eien andere Erfahrung macht was Rankeds betrifft. Ich selbst habe aber eben (leider) die Erfahrung gemacht, das die meisten in Solo q eben absichtlich afk gehen, rage leaven, absichtlich feeden (und ja ich meine wirklich mit purer ABSICHT) oder die ganze Zeit den Chat mit flame gelaber zumüllen und eine vernünftige Kommunikation absolut unmöglich machen.\nDu aber hast anscheinend die Erfahrung gemacht (dein Glück) das du mit Mates gematched wurdest, mit denen du ein Spiel carrien kannst bzw. mit denen auch ein Ranked Game spaß macht und ich wette du warst noch nie in einem Team wo alle deine Mates leaven und du 1vs5 spielen musst und das fast durchgängig in fast jedem Spiel denn sonst wüsstest du was ich meine ^^\nMein Beitrag war auf keinen Fall im negativen Sinne gepostet sondern ich wollte lediglich meien Erfahrung teilen und tipps geben wie man geflame in Rankeds vermeiden kann und am besten geht es eben mit Premates, weil man diese etwas besser kennt und je mehr spiele man mit denen Spielt, desto besser wird das teamwork bzw. desto besser wird man selbst weil man in jedem Spiel mehr Erfahrung sammelt :)\nDas war alles, verstehe nicht was an meinem Beitrag so schlimm sein soll.","replies":[]}]}]}]},{"poster":"Absynthfee","date":"2016-07-25T12:10:16.317+0000","up_votes":1,"down_votes":0,"body":"Leider bin ich nicht ganz deiner Meinung,\nnachdem ich die Placements gespielt habe, hatte ich auch schon richtig coole spiele, die sehr viel Spaß gemacht haben, und in denen alle 4 Mates im Team gearbeitet haben. \nIch glaube, dass ich jetzt 3 Spiele verloren und 5 gewonnen habe (oder so). Stehe jetzt mit 65 LP in S5.\n\nIch bin auch davon überzeugt, dass man recht passend vom System eingeordnet wird, also dass man auf eine ca. 50% winrate kommt, wenn man sich ok anstellt. Da kann es vorkommen, dass man von 20 Spielen mal 14 verliert, die nächsten 20 Spiele dann aber wieder 16 gewinnt oder so. \nMatchmaking passt meiner Meinung nach, Probleme machen mir die Moves, und der Chat usw... Man gewinnt ja auch mal, obwohl man 4 flamer hat. Aggresiv, beleidigend oder nicht groupend bedeutet ja nicht, dass man verliert. Die können ja trotzdem gute Spieler sein und dich zum Sieg führen - macht halt nur keinen Spaß ;-)","replies":[]}]},{"poster":"DeathFresh","date":"2016-07-21T13:08:08.058+0000","up_votes":1,"down_votes":0,"body":"Silver 5 ist eigentlich gut. :D Wurde von S1 auf B5 eingestuft xD.\nZu dem Kopf hoch und weiter machen ;) jeder kennt diese Phase.\n\nZu dem ist Ranked für mich einfach motivierender als Normalos. In Ranked will man aufsteigen um darum kämpft man auch härter :D\nObwohl einige Spieler zu härt kämpfen und dann anfangen extremst zu flamen ;/","replies":[{"poster":"Lagbeard","date":"2016-07-21T15:47:21.998+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=DeathFresh,realm=EUW,application-id=vatevpvi,discussion-id=i06vwhxU,comment-id=000f,timestamp=2016-07-21T13:08:08.058+0000)\n>\n> Silver 5 ist eigentlich gut. :D \n\nDas ist deine Sicht der Dinge :D","replies":[{"poster":"Chopper7777","date":"2016-07-21T20:11:50.637+0000","up_votes":1,"down_votes":0,"body":"Silber 5 ist auch nicht schlecht.","replies":[{"poster":"Lagbeard","date":"2016-07-21T20:26:01.070+0000","up_votes":2,"down_votes":0,"body":"Wenn ihr das so seht, ist das wie ich schon sagte, eure Sicht der Dinge. Ich habe das nicht wertend gemeint, ich bin selbst Silber 5 und halte mich nicht für einen guten Spieler. Ich bin mit meiner ELO unzufrieden, nicht weil ich glaube woanders hin zu gehören, sondern weil ich meine spielerische Leistung einfach für nicht ausreichend halte. Also ist meine Sicht der Dinge die, dass S5 für mich persönlich nicht gut genug ist.","replies":[{"poster":"Chopper7777","date":"2016-07-24T20:54:55.726+0000","up_votes":1,"down_votes":0,"body":"Ist ja auch vollkommen okay. Ich finde es sogar gut das du erwähnst dass du nicht mit dir selber zufrieden bist. Von den meisten Leuten hört man fast nur das es an den Teammates liegt. Ich wünsche dir viel Glück beim ranked.\n\nMein Tipp,der Spaß sollte im Vordergrund sein.Das hilft enorm.","replies":[]}]}]}]}]},{"poster":"Chopper7777","date":"2016-07-21T02:00:10.027+0000","up_votes":2,"down_votes":0,"body":"Was \"Ranked\" für mich heißt? Hmm...eigentlich nichts anderes als ein normal mit ein paar mehr Tryhardern,und afkler dazu ein Rang-System.\nNichts besonderes,ich hatte nie wirklich lust auf Ranked,war mir zu blöd wegen den ganzen geflame und was da noch so passiert.\n\nUnd ich dachte mir das ich nurnoch Normals machen werde,bis ich dann mein komplette Placement Matches ausversehen,ja ausversehen, gemacht habe. Wurde in Silber 3 geranked und war nach knapp 50 Matches (30 davon gewonnen) Gold 5.\nAls ich gemerkt habe,das ich meine Placementmatches ausversehen gemacht habe ist mir klar geworden das ich einfach mit dem Ziel,spaß zu haben,in das Match gehen soll.Den Champ picken denn ich gerne spielen will(nicht unbedingt welche die exrtem schwach sind)und nicht auf flame einlassen,nicht ragen.\n\nIch sehe meinen Rang als Bonus an,an dem ich am ende der Season sehe wie ich laut LoL bin. Früher war ich immer mit dem Ziel zu gewinnen ins Ranked gegangen...oh gott was wurde ich teilweise salty :D \n\nJetzt mit dem Ziel wirklich NUR Spaß zuhaben ist es viel entspannter,ich rege mich fast garnicht mehr auf wenn jemand afk geht flamed oder was auch immer macht.Vor 2 Seasons kam ich nie aus Silber raus weil ich mich immer demotivieren lassen hab.\nUnd jetzt nach 50 Matches von Silber 3 in Gold 5.\n\n\n\"Für mich heist Ranked\n- sich mit anderen zu messen\n- alles zu geben\n- sehen, wie gut ich im Vergleich mit anderen bin\n- ein Feedback auf meine Leistung zu bekommen\"\n\nhast du geschrieben.\n\nNatürlich gebe ich auch alles,versuche besser als mein Gegner zu sein.Genau das von dir geschriebene erwartet man eigentlich von Rankeds.\n\nDas wichtigste ist,zu lernen mit Flame umzugehen. Vergiss mal den Rang,seh es so wie ich als kleinen Bonus am ende der Season,und auch als Motivation dieses Ziel in der nächsten Season zu schlagen.\nGeh in das Match mit dem Ziel spaß zu haben.Du wirst zu 100% entspanntere Matches haben.\n\nBist gestorben und ein Mate flamet dich? Einfach nicht reagieren.Niemals auf einen Flamer antworten.Wenn du ihm antwortest streitet ihr euch erst richtig,was dich ablenkt und direkt sauer/traurig macht.Und dann passieren die ganz schlimmen Fehler.\n\n\nTL;DR\n\n\"Ranked\" bedeutet für mich nichts anderes als \"Normal\" nur mit einem aktiven Rang-System.Behandle Rankeds wie Normals,hab Spaß und du wirst zu 100% erfolgreicher werden. Versteife dich nicht auf den Rang.Hab Spaß,das ist was Zählt.\n\n\n\nPS:Meiner Meinung nach ist der Rang eher irrelevant. Man hat genauso die gleichen Leute in Diamond wie in Silber. Meiner Meinung nach wird es mit steigender Elo schlimmer,da dort die Tryharder sitzen die nur auf einen Rang aus sind und direkt Leaven weil sie ne Minion Wave verpassen.\n\nPPS:Wenn du probleme hast es so wie ich zumachen,nehme ich dich gerne mal mit in eine Runde (:\n\nViel glück und viel Spaß.\n\n\nGott ich habe diesen Text viel zu....ordentlich geschrieben passt eigentlich net zu mir aber meh...","replies":[{"poster":"Absynthfee","date":"2016-07-21T12:47:33.651+0000","up_votes":2,"down_votes":0,"body":"Ach weist du, mir gefällt dein Text :D","replies":[{"poster":"Chopper7777","date":"2016-07-21T15:58:58.623+0000","up_votes":1,"down_votes":0,"body":"Der ist doch viel zu lang xd aber danke (:","replies":[]}]}]},{"poster":"InfectedGreed","date":"2016-07-21T08:50:32.425+0000","up_votes":2,"down_votes":0,"body":"Ich spiel fast nur Rankeds und das vor allem weil man besser werden will.\n\nIn Normals kannst du nicht wirklich besser werden, weil die Motivation da eine ganz andere ist.\n\nAber, dir sei gesagt, Trolle gibts überall, egal ob Ranked, Normal oder Aram, es wird immer wieder AFK´ler geben oder Spieler die tilted werden weil irgendein Objective geklaut wurde oder weil der Spieler seine Lane verloren hat.\n\nUnd ja du hattest einfach Pech, das kommt vor.\n\nLetzendlich reicht es ja, wenn du mehr als 50% deiner Spiele gewinnst um aufzusteigen, allerdings muss man das langfristig betrachten.\n\n\nBei mir und vielen meiner Freunden kommts halt vor das man z.b. von S2 auf S1 aufsteigt und obwohl man vorher z.b. 5 Spiele in Folge gewonnen hat, verliert man plötzlich 4-5 Spiele.\n\nLast but not Least:\nDU kannst durchaus ein Spiel carrieren, dazu mußt du evtl. noch lernen was man in bestimmten Sitationen macht...z.b. lieber Drake oder Bot Tower holen ?","replies":[]},{"poster":"Zulwar","date":"2016-07-21T05:04:44.946+0000","up_votes":2,"down_votes":0,"body":"Rankeds.\n\nRanked heißt für mich:\n\n- Das ich Champions, die ich auf meiner Main-Position beherrsche, spiele und versuche Fehler die ich mit denen begehe zu vermeiden.\n- Sich mit anderen zu messen, um zu sehen, wie gut ich meinen Champion beherrsche denen gegenüber.\n- In schwierige Situationen, auch mal was neues auszuprobieren.\n\nIm Grunde also ein Normal Spiel, nur mit dem einzigen unterschied, das ich einen deutlich kleineren Championpool zur Verfügung habe und mich auf eine Rolle beschränke.\n\nDer Sieg oder die Niederlage eines einzelnen Spieles, hat keinen Wert. Sondern erst nach einigen dutzend Spielen, kann ich sehe, wohin ich gehöre und welche Fehler ich immer wieder mache.\n\nDeswegen, seh das nicht zu eng, wenn man nur 4vs5 spielt. Seh es als Herausforderung, das du auch in der Lage bist, mit einer Person weniger zu spielen. Wenn du gelernt hast, deine Gegner und deine Mitspieler richtig einzuschätzen, dann wirst du auch solche Spiele gewinnen können.","replies":[]},{"poster":"oasterlukas","date":"2016-07-20T18:32:02.778+0000","up_votes":2,"down_votes":0,"body":"Da kommt noch einiges mehr auf dich zu :D. Gewöhn dich daran :D\n\nNein Scherz. Also Rankeds spielte ich früher viel zu oft. Mitterlweile weich ich auf Normals aus. Rankeds nehm ich natürlich ernster, dass sollte man auch meiner Meinung nach, da Team Mates hier ja doch mehr Ehrgeiz haben und alles unbedingt gewinnen müssen. Also spiel ich rankeds ab jetzt nur noch wenige und wenn dann in einem guten \"leistungsfähigen\" Zustand. Ich bin ein Spieler für den Gewinnen zweitrangig ist, etwas das wahrscheinlich 80% hier nicht verstehen werden. Klar ich möchte meine Liga verbessern, aber ich weiß selber was ich kann und brauch dafür keine Liga wertung und Spaß steht einfach im Vordergrund. Hoffe irgendjemand kann das nach voll ziehen. :D Also ja das sind Rankeds fü r mich: Spiele mit einen kleinen Faktor namens Ehrgeiz  und \"leistungsernstere\" Gegner. Also ein wenig aufregender :D","replies":[]},{"poster":"Liberini","date":"2016-07-20T20:46:39.838+0000","up_votes":3,"down_votes":1,"body":"Jo, geht mir genau so. Jedoch muss ich auch sagen, dass ich bis jetzt nur die Placements + 3 Rankeds gespielt habe, also noch kein abschließendes Feedback geben kann. \nFür mich bedeuten Rankeds aber auch sich mit anderen zu messen, jedoch idealerweise auch immer im Hinterkopf behalten sich selbst weiter verbessern zu **wollen** und eben (gesunder) Ehrgeiz. Und man sollte seine eigenen Fehler auch einsehen und pragmatisch rausfinden, woran es denn nun gescheitert ist. Hatte aber bisher auch **ob** mega Pech (AFK, feeden, flamen, meilenweiter Unterschied beim Score) oder mega Glück (krasse Führung aber eben keine Herausforderung). Ist halt mal so mal so. Manchmal versuche ich mir die Zeiten in denen man spielt als Richtwert zu nehmen. Jetzt in den Ferien spielen die Kiddies (ich erlaube mir jetzt mal ganz dreist Pauschalisierungen) bestimmt eher Vormittags, wo Mami und Papi schön auf der Arbeit sind ^^ Und die die arbeiten und älter sind bestimmt eher abends. Muss auch zugeben, dass meine Teammates abends immer besser (und auch besser drauf) waren als in sonst irgendwelchen Uhrzeiten, aber das hat ja absolut nichts zu bedeuten. Und es gibt immer Leute bei denen man sich fragt, was sie sich wohl bei dem denken was sie so machen. Da ist es komplett egal wo man spielt, ob Bronze 5 oder Dia 3. \n\n~~Schöne~~ Beispiele:\n- 0/10 Ryze Midlane, geht 1v1 in einen 3 Level höheren 10/0 Zed (und das nicht nur einmal)\n- 2/11 Teemo, hat ihn auf AD gebaut und laut seiner Match history IMMER damit verloren (wieso baut man diesen build dann? Unklar :D)\n- 0/6 Ashe, flamed den Supp, geht immer irgendwo alleine hin (wo sie dann gesnackt wird), beim poken auf der Stelle stehen bleiben etc.\n- 2/16 Lux Supp, hat sich noch nicht mal die Mühe gemacht Supp-Items zu kaufen, geht trotzdem alleine gegen eine 8/0 Tristana und spamt den Chat nach jedem Tod mit \"wtf\", \"I can 1v1 all noobs\" etc. zu\n\nSachen gibt's, die gibt's garnicht. Schön sind ja auch immer die Leute die \"I'm AFK\" schreiben und welche man dann des Todes betteln muss, damit die wieder mitspielen {{summoner:3}} \n\n\n\nAber deinen Beitrag finde ich schön, vor allem den letzten Teil, in dem du die Leute dazu ermahnst mal darüber nachzudenken was Rankeds bedeuten etc.\nJeder der ein guter LoL-Spieler ist, wird sich dies zu Herzen nehmen. Und jeder der es nicht tut, ist kein guter LoL-Spieler ;-)\nTilten, flamen, feeden und afk ist definitiv nicht der richtige Weg, weder für sich selbst noch für das Team.\nAlways stay positive summoner!","replies":[{"poster":"Absynthfee","date":"2016-07-20T20:52:59.704+0000","up_votes":1,"down_votes":0,"body":"Habe mit solch umfangreichen Kommentaren gar nicht gerechnet :D\n\nAber danke für dein Feedback, du hast verstanden, was ich (unter anderem) mit diesem Post erreichen wollte. EInfach noch mal nachdenken und mir unwissenden Neuling mal schreiben, wie ihr das seht.","replies":[]}]},{"poster":"Bocherto","date":"2016-07-21T12:59:19.292+0000","up_votes":2,"down_votes":1,"body":"Ich mach keinen Unterschied zwischen Rank´s und normal Games. Beides hat das gleiche Ziel, nur finde ich das Matchmaking im Ranked besser und am Ende der Season bekomm ich auch noch eine Belohnung dafür. Von daher spiel ich nur Ranks. Egal ob ich Champ´s üben möchte, andere Lanes oder mit Kumpels zocke auch wenn man da nicht immer ernst bei ist.","replies":[{"poster":"Zulwar","date":"2016-07-21T13:32:46.990+0000","up_votes":1,"down_votes":0,"body":"Auch eine mögliche Einstellung.\nDas gute ist, das du so gelassen bleist.","replies":[]}]},{"poster":"Wîndfury","date":"2016-07-28T12:23:07.907+0000","up_votes":1,"down_votes":0,"body":"Ich spiele Ranked um den Lol Community Weg zu lernen. Für mich heißt Ranked zu spielen hochkommen zu wollen und alles zu geben dementsprechen fange ich auch schon in der Championselect damit an meine Mitspieler dazu zu bringen vernünftige Picks und banns zu picken bzw zu machen wie zum Beispiel Teemo denn, den mag ich nicht. Gehen diese darauf nicht ein oder ignorieren mich versuche ich Sie mit Beleidigungen und Drohungen wie zum Beispiel Krebs und Aids auf mich Aufmerksam zu machen. Dies hilft meistens auch und es entwickelet sich eine leidenschaftliche Diskussion über unsere Schwächen und was man besser machen könnte oder sollte.\nFängt das Spiel ersteinmal an habe ich natürlich meine Lane wo ich am besten bin nämlich die Mitte und zwar immer, auch wenn andere dort seien wollen gehe ich einfach auch dort hin. Denn ich will ja mein bestes geben und gewinnen, daher versuche ich sie mit vielen Pings und weiteren Drohungen wie zum Beispiel das ich sie wie Nocturne in ihren Alpträumen heimsuche dazu zu bringen mir die Lane zu überlassen damit ich carrien kann. Meisten funktioniert das auch aber ich sterbe dann oft, weil der Jungler mir keinen Blue buff gibt oder der andere wonna be midlaner. zuviel ep geklaut hat. Das kann natürlich nicht sein wodurch ich natürlich eine taktische diskussion anstreben muss, dass der ***** Jungler mir gefälligst den blue geben soll und die ***** bot meine lane nicht feeden soll. Was soll ich auch wards kaufen wenn ich das geld brauche um den unskill meiner teammates auszugleichen.\nMeistens verliere ich dann weil mein Team es mir so schwer macht diese bronze scrubs zu carrien, dabei mache ich immer alles richtig und bin eigentlich besser als Faker,Gosu und Rekkles zusammen.\nWas soll ich bloß tun damit ich meine mir zustehende challenger elo kriege ?\n\nAlles in allem bin ich somit ein respektables mitglied der community.\n\n*Ironie Aus*\n\nRanked für mich bedeutet sein bestes zu geben um zu gewinnen sei es auf spielerischer oder zwischenmenschlicher Ebene, alle Kanäle werden genutzt, sowohl  Runen Masteries Champs und Können als auch Psychologische Kriegsführung sei es für das eigenen Team oder gegen den Gegner.\n\nPS: An alle leute die hier wieder auf den QQQ das team train aufspringen ihr seid wie mein bronze 5 hidden challenger ego oben. Ihr seid der einzig beeinflussbare faktor das heißt ihr seid die variable in konstanten das heißt ihr verliert oder gewinnt. Das ist sowohl statistisch als auch praktisch erwiesen.\n\nLG \n\nWîndfury","replies":[]},{"poster":"IcedOutMissplays","date":"2016-07-25T07:05:06.351+0000","up_votes":1,"down_votes":0,"body":"Rankeds haben für mich keinen Wert da ich immer wieder sehe wie es ausartet wenn ich diesen Modi spiele entweder will mein Team ffen ob wohl das Spiel noch nicht mal angefangen hat etc. da Spiel ich lieber normals und ich finde es abartig das man meistens einfach nach seinem rang statt dem skill selbst behandelt wird","replies":[]},{"poster":"Balmung","date":"2016-07-21T14:21:34.424+0000","up_votes":1,"down_votes":0,"body":"Für mich ist Ranked eigentlich Normal mit nem Skin, vlt auch Champ, am Ende der Season.\n\nIch versuche zwar meinen Championpool auf meine stärkeren Picks zu beschränken, eventuell auch teamorientiert zu spielen wenn man bemerkt das der Carry auch Ahnung vom carrien hat...aber naja, wenn nicht und man eben verliert isses eben so.\n\nKann gar nicht zählen wie oft ich schon geflamed wurde weil ich auf dem Account \"nur\" ~150 Normalwins habe und daher ja gar nicht \"erfahren genug für Ranked sein kann\"...","replies":[]},{"poster":"Namlesshero","date":"2016-07-21T14:05:32.396+0000","up_votes":1,"down_votes":0,"body":"Ich spiele nicht gerne Ranked. Ich geh immer mit einem unguten Gefühl in ein Ranked. So wie:\" Hoffentlich habe ich kein AFK\" oder \"Flamen sie schon wieder in der Champ select?\" \n\nWenn ich im Spiel bin, bin ich eher einer der ruhigen Spieler, vlt noch ein scherz am Anfang um die Stimmung zwischen meinem Team aufzulockern. Ich versuch auch Streit in der Champselect zu schlichten, was sich oft aber als Riesenaufgabe herausstellt. Schlussenldlich versuch ich trotzdem jede Woche ein Ranked zu spielen, einfach um zu sehen was passiert.","replies":[]},{"poster":"DanionVibit","date":"2016-07-21T07:19:16.365+0000","up_votes":1,"down_votes":0,"body":"Ranked ist mittlerweile für mich nichts anderes mehr als Normals indem man das spielt was man kann. Mir ist es egal ob ich am ende unbedingt gewinne oder ob ich eine ausgeglichene Runde verlieren denn der Spaß steht im Vordergrund.\n\nFür 98% aller Spieler macht es eh kein Sinn es anders zu sehen. Ich behaupte einfach mal keiner von uns wird jemals in den Genuss kommen vernünftig Geld mit LoL zu verdienen, wenn doch dann hau rein.\n\nIch finde es nur schlimm das im Ranked die Leute immer anfangen so hart zu tilden nur wenn mal etwas nicht so läuft wie es soll. Diese Leute tryharden und wenn ihr Team mal nicht 100% Performance bringt dann fangen sie an zu trollen um dann absichtlich zu verlieren obwohl sie eigentlich alles daran gesetzt haben zu gewinnen - Paradox.","replies":[{"poster":"Zulwar","date":"2016-07-21T13:30:41.036+0000","up_votes":1,"down_votes":0,"body":"Ich kann mir vorstellen, das diese Leute verlieren wollen, wenn sie der Meinung sind, das sie das nicht Carrien können.","replies":[]}]},{"poster":"abmurxer","date":"2016-07-21T09:12:14.183+0000","up_votes":1,"down_votes":0,"body":"Für mich ist ranked:\n\n- Ich spielen gegen Silber 2 Spieler oder besser obwohl ich Bronze 1 bin (wenn ich alleine spiele ohne premades)\n- unfaire Placements: 8 Siege 2 Niederlagen 6,5/5,5/8 KDA und Bronze 1 (GEGE)","replies":[]},{"poster":"Good Guy Putin","date":"2016-07-20T17:53:33.699+0000","up_votes":1,"down_votes":0,"body":"Ich spiele Rankeds um in Gold zu kommen, ansonsten isses es mir egal :D\n\nDu hast bis jetzt nur die Placements gemacht oder? Diese sind nur dazu da um grob einzuschätzen wo du hin gehörst. Deine richtige Elo erreichst du nach ca 100 Spielen. Dann kannst du dir recht sicher sein, dass du da auch hingehörst.\nDazu kann ich noch sagen, dass du mit den Afklern Pech hattest. In meinen letzten 50 games, war da nur einer das ganze game afk und ein paar mal gabs Leute die nur 5-7 min afk waren.","replies":[{"poster":"Absynthfee","date":"2016-07-20T20:19:55.998+0000","up_votes":1,"down_votes":0,"body":"Mir geht es nicht um die Elo. Natürlich möchte ich so wie möglich Spielen und alles geben.\n\nIch sehe es wie z.B. Volleyball:\n- wer in einem Team spielt gibt immer alles. Und für manche reicht es halt \"nur\" für die Landesklasse und nich Regio oder Bundesliga. Dennoch geben sie alles, und haben Spaß\n\nIch geben in den Rankeds auch alles, und wenn ich nicht über Gold V komme, dann ist dem halt so. Aber ich bemühe mich. Amsonsten könnte ich normals spielen (Volleyball mit Freunden im Park)\n\n**Mich interressiert, ob ich zu Ehrgeizig bin, und welche Einstellung andere zu Rankeds haben.**","replies":[{"poster":"InfectedGreed","date":"2016-07-21T09:04:34.555+0000","up_votes":1,"down_votes":0,"body":"Ja man kann zu ehrgeizig sein, das führt evtl. zu einem Mentalen Problem hin...kenn ich selbst, kennen generell viele Sportler, auch E-Sportler natürlich.\n\nIch geh Rankeds schon ernsthaft an, aber mit einer gewissen Lockerheit, es bringt nichts verbissen ein Ergebniss erzwingen zu wollen und schafft man es nicht ist die Demotivation höher.\n\nVor allem, bei einem 4vs5 kannst du nix machen, du kannst dich nur reinhängen und versuchen so gut es geht das Spiel hinter dich zu bringen, manchmal gewinnt sogar so ein Spiel.","replies":[]},{"poster":"Good Guy Putin","date":"2016-07-20T20:51:37.584+0000","up_votes":1,"down_votes":0,"body":"Ja ich versuche ja auch so gu wie möglich zu spielen nur ist mein Ziel halt nur Gold wegen den Rewards. Danach reichen mir auch Normals.","replies":[]}]}]},{"poster":"Braumerama","date":"2016-07-21T08:33:45.366+0000","up_votes":1,"down_votes":0,"body":"Spiele glaube ich vieeeeel zu oft Rankeds.... für mich bedeuten Rankeds 100% zu geben , auch wenn ich Bronze bin!","replies":[]},{"poster":"Oriius","date":"2016-07-20T23:56:21.609+0000","up_votes":1,"down_votes":0,"body":"Bei so einigen Kommentaren wie dem von Evilteddi da frage ich mich wo das Gehirn ist -.- Was kann man dafür wenn andere Afk sind xd\n\nAber naja B2T: Ranked spielen heißt für mich da ich in Silber bin. Mach dich auf alles gefasst von Afk bis Flame as Fck und gerade solche Französischen fail premades die eh alles ruinieren. Trotzdem versuche ich alles zu geben auch wenn afk etc dabei ist manchmal gewinnt man auch 4v5","replies":[]},{"poster":"gyyyr","date":"2016-07-20T18:31:12.190+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich habe in Ranked viel mehr toxische leute, da sie dort alles geben.","replies":[]},{"poster":"iTz Alcosta","date":"2016-07-20T19:06:32.103+0000","up_votes":1,"down_votes":5,"body":"Das klingt jetzt zwar komisch, aber ranked ist immer ein 1v9 carry. Man ist in der elo, in der man 1v9 carrien kann, oder man sucht sich eigene premates, das ist die traurige wahrheit.\n(find ich auch kacke btw)\n","replies":[{"poster":"Zulwar","date":"2016-07-21T05:15:09.762+0000","up_votes":1,"down_votes":0,"body":"Wenn dies wirklich der Fall wäre, dann wäre ich jetzt nicht da wo ich derzeit bin.\nSondern weit aus tiefer.","replies":[]}]}]}