{"poster":"ValorDragon","date":"2015-09-16T17:45:02.645+0000","title":"14 Tage Unnötig gesperrt!","subforum":"Spielerverhalten & Moderation","embed":{"description":"ValorMaster, You have received a 14 day ban following an extensive audit of in-game behavior within recent League of Legends matches. Your peers judged your behavior to be far below the standards of the League of Legends community. Think through the conversation and reflect on your words.","url":"http://link.email.riotgames.com/YesConnect/HtmlMessagePreview?a=liCT_etp7RoGJmJtqm0IyLc8&msgVersion=web","image":"http://media.4at5.net/email_domains/ris/143833/images/RiotGames.png"},"up_votes":1,"down_votes":15,"body":"Hallo!\r\n\r\nIch habe gerade vor paar Minuten eine Meldung bekommen das mein Account 14 Tage gesperrt wird!\r\n\r\nKomplett UNN&Ouml;TIG. Wenn ich mir den Text durchlese den ich im Spiel geschrieben habe f&auml;llt mir nichts auf was zu einem Bann f&uuml;hrt!\r\n\r\nIch war alleine gegen ein 4er Premade Team die mich die ganze Zeit meinten das alle mich reporten und ich dann eine Sperre bekomme?\r\n\r\nWegen &quot;Instalock&quot; und &quot;Feeding&quot;!\r\n\r\nIch war schon angepisst das die eben meinen mich fertig zu machen die direkt in den ALL Chat schreiben &quot;Report Kog&#039;Maw&quot; und die Gegner dann schreiben &quot;OK&quot;. Dann muss man sich doch wehren!\r\n\r\nAlso den Bann bitte aufheben! Da er komplett &uuml;bertrieben ist. H&auml;tte mich schon bei einem Chat Bann aufgeregt aber das geht zu WEIT!\r\n\r\nLg Valor","replies":[{"poster":"HansMowlWurf","date":"2015-09-16T17:45:11.997+0000","up_votes":9,"down_votes":1,"body":"Verdient, definitiv.\nUnd vermutlich sinnlos dir zu erklaeren warum, wenn du das bei dem Chatlog selbst nicht siehst.\nDir ist eh nicht zu helfen, drum viel spass mit dem Permaban.","replies":[{"poster":"ValorDragon","date":"2015-09-16T17:47:18.696+0000","up_votes":1,"down_votes":6,"body":"Nicht zu helfen? Hallo geht es noch? Anscheinend beachtet keiner was die anderen schreiben?","replies":[{"poster":"LG bumper","date":"2015-09-16T17:50:13.927+0000","up_votes":1,"down_votes":12,"body":"tja das neue system ist halt nicht ausgerefit also Heul leise du hast Mist gebaut ^^","replies":[{"poster":"Der Großmugister","date":"2015-09-16T17:52:50.126+0000","up_votes":5,"down_votes":0,"body":"Wieso ist es nicht ausgereift?\nHier wurde ein übler Flamer erkannt und bestraft, funktioniert also super.","replies":[{"poster":"ValorDragon","date":"2015-09-16T17:58:57.738+0000","up_votes":1,"down_votes":8,"body":"Was übler Flamer? Hast du eine Ahnung mit welchen Leuten ich ins Team manchmal komme... z.B Die werden nicht gesperrt. :)","replies":[{"poster":"Humpelstilzche","date":"2015-09-16T18:08:03.615+0000","up_votes":9,"down_votes":0,"body":"Ja, übler Flamer. Mal im Ernst, praktisch alles was du geschriebne hast ist ziemlich unhöflich. Es macht dein Verhalten kein Stück besser, dass auf der großen weiten Welt Personen existieren die noch schlimmer sind als du, das ändert genau garnichts an dem was du getan hast. \nDu hast mehrfach beleidigt, rassistische Bemerkungen gemacht, Mitspieler beschuldigt/dumm angemacht, dich über die Leistung deiner Mitspieler lustig gemacht...kurz gesagt: Du warst einfach das ganze Spiel über extrem toxisch, da gibts nichts dran zu rütteln. \nJa, vielleicht waren die anderen noch schlimmer, keine Ahnung, kann sein. Ändert aber nichts dran, dass du dich wie Sau verhalten hast und insofern die Strafe verdient hast. Deine Mitspieler vielleicht auch, das ist aber dann deren Bier und hat mit deinem Bann nichts zu tun. Die haben ihre eigenen Chatlogs, das ist für dich irrelevant. \n\nUnd wie dir bereits schon gesagt wurde, ist die nächste Stufe schon der Perma. Nur um das deutlich zu machen: Ein einziges weiteres Vergehen und dein Account ist für immer weg! Dannach ist es zu spät für Einsicht, Reue oder Entschuldigungen. Permabans werden nicht zurückgenommen, no matter what. \n\nEs wäre also zu deinem eigenen Besten wenn du aufhörst nach leeren Rechtfertigungen (\"Aber der Kevin hat zuerst Sand geschmissen\") zu suchen, und dich statdesse der unangenehmen Tatsache stellst, dass du dich schlicht und einfach falsch verhalten hast. Kann passieren, nobody is perfect. Es liegt an dir das beste drauß zu machen und dich nicht aus Dummheit permabannen zu lassen. Deine Entscheidung. Ich wünsche dir dabei viel Erfolg.","replies":[{"poster":"ValorDragon","date":"2015-09-16T18:15:51.493+0000","up_votes":1,"down_votes":2,"body":"Klar aber das ist nun mal eine Reaktion wenn 4 Leute auf einen los gehen und noch weitere Leute \"anreisen\". Klar tut es mir auch Leid aber z.B im Gegner Team war ein Rengar der mich verstanden und sogar gehonored hat. Weil meine Mitspieler eben totalen Müll gequatscht haben. Aber sie haben geschafft was sie erreichen wollten. Aber was soll man mehr machen als sich nun zu entschuldigen?","replies":[{"poster":"TheT0xicAvenger","date":"2015-09-16T21:08:43.515+0000","up_votes":2,"down_votes":0,"body":"Ich sags mal ganz ehrlich - hört sich für mich ein wenig so an, als ob das gegnerische Team einfach gezielt das schon vorhandene Flame-Feuer angeheizt hat.\n\nDas ist zwar unsportlich, aber vermutlich auch sehr effektiv, denn wer flamed spielt in der Tippzeit schon mal nicht, lenkt zusätzlich die Mitspieler ab und ist unkonzentriert. Das spielt dem Feind quasi in die Hände, also wäre es opportun, einen vorhandenen Flame im Gegnerteam aufzustacheln.\n\nDie feine englische Art ist das natürlich nicht, ich hab aber schon ingame mitbekommen, dass sowas gemacht wird.","replies":[]},{"poster":"Humpelstilzche","date":"2015-09-17T09:51:11.024+0000","up_votes":2,"down_votes":0,"body":">  Aber was soll man mehr machen als sich nun zu entschuldigen?\n\nNichts. Vergangenheit ist Vergangenheit. Sorg einfach dafür, dass das nicht wieder vorkommt. Ich denke das ist nicht zu viel verlangt und sollte für jeden mit ein wenig Grips im Kopf (und ich hab keinerlei Anlass zu glauben dass das bei dir nicht der Fall ist) locker machbar sein.","replies":[{"poster":"Pumpgun Willy","date":"2015-09-17T09:54:26.708+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=00000000000100000000000200000002,timestamp=2015-09-17T09:51:11.024+0000)\n>\n> Nichts. Vergangenheit ist Vergangenheit. Sorg einfach dafür, dass das nicht wieder vorkommt. Ich denke das ist nicht zu viel verlangt und sollte für jeden mit ein wenig Grips im Kopf (und ich hab keinerlei Anlass zu glauben dass das bei dir nicht der Fall ist) locker machbar sein.\n\nHast du auch noch eine Antwort auf meine gestellte Frage auf Seite 3? Oder gibt es dazu keine Auskünfte? Denke das würde viele neue Threads ersparen in nächster Zeit :D\n\nLG","replies":[{"poster":"Patter91","date":"2015-09-17T09:56:42.293+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=iSwearSheeeWas18,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=000000000001000000000002000000020000,timestamp=2015-09-17T09:54:26.708+0000)\n>\n> Hast du auch noch eine Antwort auf meine gestellte Frage auf Seite 3? Oder gibt es dazu keine Auskünfte? Denke das würde viele neue Threads ersparen in nächster Zeit :D\n> \n> LG\n\nGuck mal, du befindest dich doch schon im Unterforum \"Spielerverhalten\". Dort gibt es extra angepinnte Threads diesbezüglich. Unter anderem zu den jetzigen Wechseln. Dort findest du deine Antwort.\nAber um dir die allzu schwere Arbeit abzunehmen, deine Äuglein anzustrengen:\n\n> [{quoted}](name=Ymir,realm=EUW,application-id=KYnfKGf0,discussion-id=jjIMv1b0,comment-id=,timestamp=2015-09-15T18:41:40.240+0000)\n>\n> Noch ein letzter Hinweis: Aufgrund der neuen Ausrichtung dieser &Auml;nderungen werden alle Chat- und Ranglisteneinschr&auml;nkungen zur&uuml;ckgesetzt und vorangegangene Einschr&auml;nkungen z&auml;hlen im neuen System nicht mehr. Jeder erh&auml;lt also eine wei&szlig;e Weste (bez&uuml;glich dieser Einschr&auml;nkungen), weshalb dies ein wunderbarer Zeitpunkt ist, ein neues Kapitel aufzuschlagen.","replies":[{"poster":"Pumpgun Willy","date":"2015-09-17T10:00:51.692+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Patter91,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=0000000000010000000000020000000200000000,timestamp=2015-09-17T09:56:42.293+0000)\n>\n> Guck mal, du befindest dich doch schon im Unterforum \"Spielerverhalten\". Dort gibt es extra angepinnte Threads diesbezüglich. Unter anderem zu den jetzigen Wechseln. Dort findest du deine Antwort.\n> Aber um dir die allzu schwere Arbeit abzunehmen, deine Äuglein anzustrengen:\n\nDer Grund, warum ich nochmal nachgefragt habe ist, das dass für mich nicht ganz eindeutig ist. Ich lese mir alle Neuerungen durch, von wegen mit Augen anstrengen und so ;-) \nSind mit \"vorangegangenen Einschränkungen\" die 14 Tage Banns gemeint? Kann sein das ich es falsch lese, aber ich lese da nichts über das Thema.\n\nLG","replies":[{"poster":"Patter91","date":"2015-09-17T10:04:59.505+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=iSwearSheeeWas18,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=00000000000100000000000200000002000000000000,timestamp=2015-09-17T10:00:51.692+0000)\n>\n> Der Grund, warum ich nochmal nachgefragt habe ist, das dass für mich nicht ganz eindeutig ist. Ich lese mir alle Neuerungen durch, von wegen mit Augen anstrengen und so ;-) \n> Sind mit \"vorangegangenen Einschränkungen\" die 14 Tage Banns gemeint? Kann sein das ich es falsch lese, aber ich lese da nichts über das Thema.\n> \n> LG\n\nIst das dein fucking Ernst??? Es steht explizit da: \n> werden alle Chat- und Ranglisteneinschränkungen zurückgesetzt\n\nWie kann man DAS nicht verstehen??\nIch seh schon meine Rente verbrennen....","replies":[{"poster":"Pumpgun Willy","date":"2015-09-17T10:07:31.374+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Patter91,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=000000000001000000000002000000020000000000000000,timestamp=2015-09-17T10:04:59.505+0000)\n>\n> Ist das dein fucking Ernst??? Es steht explizit da: \n> \n> Wie kann man DAS nicht verstehen??\n> Ich seh schon meine Rente verbrennen....\n\nChat und Ranglisteneinschränkung = 14 Tage Bann? \n\nGlaube ich bin nicht der einzige der das, wenn es so ist, nicht wusste. Aber der Ruf über die Community kommt nicht von ungefähr. Stellt jemand eine normale Frage weil er nicht das allwissende Lol Orakel ist, kommt irgendeiner daher mit patzigen Aussagen. Whatever, Rente sollten die bekommen, die etwas dafür tun {{champion:32}} ","replies":[{"poster":"HansMowlWurf","date":"2015-09-17T10:24:22.499+0000","up_votes":4,"down_votes":1,"body":"Mal davon ab das ich dir keinen downvote gab, ist die Frage geklaert.\nDort steht Chat und Ranglisteneinschränkung werden zurueckgenommen, nicht 14 Tage Banns.\nDiese Leute muessen den Bann noch aussitzen, bekommen dann aber keine Chat und Ranglisteneinschränkung anschließend (sofern sie eine bekommen haetten).","replies":[]},{"poster":"HansMowlWurf","date":"2015-09-17T10:09:37.073+0000","up_votes":3,"down_votes":1,"body":"Nein, Chat und Ranglisteneinschränkung =Chat und Ranglisteneinschränkung und 14 Tage Bann = 14 Tage Bann.","replies":[]},{"poster":"Sirrkas","date":"2015-09-17T11:08:14.579+0000","up_votes":1,"down_votes":0,"body":"Da werden wir auf eine Riotantwort warten müssen. Falls ich eine finde, werde ich versuchen daran zu denken, sie hier zu verlinken.","replies":[]},{"poster":"TheT0xicAvenger","date":"2015-09-17T10:28:33.207+0000","up_votes":1,"down_votes":0,"body":"Ja, das wird vermutlich eins der ganz großen ungeklärten Geheimnisse bleiben. *Akte X Melodie ertönt* scnr m)","replies":[]}]}]}]}]}]}]},{"poster":"eingew","date":"2015-09-16T18:27:35.939+0000","up_votes":1,"down_votes":0,"body":"Die Leute zu muten finde ich persönlich immer sehr hilfreich.","replies":[]}]}]},{"poster":"Gorantharon","date":"2015-09-17T08:33:10.587+0000","up_votes":4,"down_votes":0,"body":"\"No Monkey Langauage pls.\"\n\nKlingt für mich mal nach absolutem Rassisten. Um's mit Barlow zu sagen: \"Geh doch einfach mal gepflegt...\" Ah, dafür gäb's nen Bann.","replies":[]},{"poster":"Busty Botter","date":"2015-09-16T18:05:49.848+0000","up_votes":1,"down_votes":1,"body":"Du weist doch gar nicht, ob sie nicht auch gebannt werden. Nebenbei hast du nun Zeit, dein Englisch etwas aufzubessern.","replies":[{"poster":"AirForce Panda","date":"2015-09-17T08:03:38.866+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Busty Botter,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=000000000001000000000000,timestamp=2015-09-16T18:05:49.848+0000)\n>\n>Nebenbei hast du nun Zeit, dein Englisch etwas aufzubessern.\n\n\nDas aber auch nicht sehr Nett.","replies":[]}]},{"poster":"Sirrkas","date":"2015-09-16T18:05:55.779+0000","up_votes":1,"down_votes":0,"body":"Das kannst du nicht wissen.","replies":[]}]}]}]},{"poster":"HansMowlWurf","date":"2015-09-16T17:49:05.817+0000","up_votes":2,"down_votes":0,"body":"Weil es total egal ist. \nWas denkst du wozu es die mute und reportfunktion gibt?\nWenn die dich flamen, dann mute sie und reporte am Ende des spieles. Das es Strafen gibt, siehst du ja ... offensichtlich.","replies":[]},{"poster":"Rirol","date":"2015-09-16T17:50:41.134+0000","up_votes":1,"down_votes":0,"body":"Doch wenn Sie reported werden, werden sie irgendwann geprüft und evt bestraft.","replies":[]}]}]},{"poster":"Rirol","date":"2015-09-16T17:48:33.062+0000","up_votes":4,"down_votes":0,"body":"Wer Lesen kann ist STARK im Vorteil.\nDu drohst mit Feeden.\nDu forderst zum Reporten auf.\nDu nennst eine andere Sprache Affensprache, (kann man \nRassistisch auslegen) auf jedenfall beleidigend... und und und....","replies":[{"poster":"ValorDragon","date":"2015-09-16T17:52:27.058+0000","up_votes":1,"down_votes":6,"body":"Kann mal einer den sehen was die anderen geschrieben haben? Du werden natürlich nicht gebannt... Aber wenn die direkt schreiben am Spiel Beginn: Report \"Name\" for Instalock and feeding! Und dann schreiben dir Gegner \"OK\". Wie würdet ihr reagieren?","replies":[{"poster":"Rirol","date":"2015-09-16T17:53:32.102+0000","up_votes":3,"down_votes":0,"body":"Nicht so wie du. Ich halte den Mund,  mute Notfalls und zieh MEIN Spiel durch.","replies":[{"poster":"ValorDragon","date":"2015-09-16T17:55:12.346+0000","up_votes":1,"down_votes":5,"body":"Wie will man das Spiel in Ruhe durchziehen wenn man weiß das man mind. 4 mal Reportet wird? Wenn nicht mehr weil die Gegner eben auch \"OK\" schreiben","replies":[{"poster":"Sirrkas","date":"2015-09-16T18:01:29.757+0000","up_votes":5,"down_votes":0,"body":"Ganz einfach. Selbst wenn du 9 mal gemeldet wirst, passiert dir nichts, solange du dich anständig benimmst. Ich würde sogar soweit gehen, dass du höchstens eine 10 Spiele CR erhalten hättest, wenn du nur die ironischen \"gj\"s verwendet hättest. \n\nWenn sie dir drohen dich zu melden, einfach im Hinterkopf behalten, die können dir gar nichts, solange du nichts falsch machst. Reporte sie dann für die Reportdrohungen und du kannst dir sicher sein, dass die Premades dann ins Forum kommen und sich darüber beschweren, eine Strafe erhalten zu haben Obwohl sie doch 4 vs 1 gemeldet haben und der pöhse Random sicher keine Strafe erhalten hat.","replies":[]}]}]},{"poster":"Groath","date":"2015-09-16T17:59:28.904+0000","up_votes":4,"down_votes":0,"body":"Ich kann verstehen, wieso dich das aufregt. Vollkommen. Es fühlt sich nicht gut an, wenn sich 4 Leute gegen einen stellen.\n\nIhre Reports bewirken allerdings nur, dass das System dich beobachtet. Wie du dich dann verhältst ist deine ganz eigene Sache. Wenn du austickst, beleidigst und drohst, zu feeden, dann sieht das System genau das, was das 4er Premade will: Einen Flamer. Die provozieren dich und du springst ohne zu zögern drauf ein.\n\nWenn sich das nächste Mal 4 Leute gegen dich stellen, sei einfach höflich und nett und spiel dein Spiel. Was meinst du, wie viel Genugtuung sie durch deinen Ban bekommen haben? Spiel ihnen nicht in die Hand und gib nichts von dir, das dazu führt, dass du negativ auffällst. So rächst du dich am Besten bei ihnen. Nämlich wenn sie eben keine Nachricht darüber bekommen, dass jemand, den sie reported haben gebannt wurde.\n\nDer direkte Weg über den Chat mag zwar der einfachste sein, aber manchmal ist es um einiges effektiver, passiven Widerstand zu leisten und einfach nicht das zu tun, wozu du gedrängt wirst.","replies":[{"poster":"ValorDragon","date":"2015-09-16T18:04:57.288+0000","up_votes":1,"down_votes":2,"body":"Danke für dein Verständnis. Werde ich das nächste mal versuchen. Nun haben die erreicht was sie wollten. Außerdem kommt man nach Hause, ist gestresst will ein lockeres Spiel machen und dann so etwas... :-( Also heißt es nun 14 Tage warten? Bzw. wieso bekommt man für so etwas keinen Chat Bann mehr?","replies":[{"poster":"HyperionCH","date":"2015-09-16T18:44:45.487+0000","up_votes":1,"down_votes":0,"body":"Wenn das Vergehen zu gross ist, wird direkt ein 2-Wochen-ban ausgesprochen. Und dieser ban ist die letzte Stufe vor dem perma ban.\n\nDu hast über 60 Nachrichten geschrieben; so ziemlich alle sehr negativ (die \"gj\" waren sicherlich sarkastisch gemeint). Das Game dauerte 30 Minuten.\nNehmen wir an, dass du pro Nachricht 10-15 Sekunden brauchst (überlegen, was man schreiben will / schreiben / Antworten lesen / wieder überlegen, was man schreiben will / etc.). Dann hast du 10 - 15 Minuten nur mit dem Chat verbracht statt mit dem Game; also 1/3 bis 1/2 der gesamten Spielzeit. Das finde ich enorm viel, wenn wie gesagt so gut wie alle Nachrichten auch toxisch waren.\n\nIch verstehe, dass man angepisst ist, wenn ein 4er Premade sich schlecht verhält.\nDies rechtfertigt jedoch nicht, sich selber so schlecht zu verhalten.\n\nZudem: Was genau wolltest du erreichen?\nDie 4er Premades reporten dich eh; ob die Gegner dich reporten ist so oder so egal (es ist nicht wirklich wichtig, ob man in einem Game 1 oder 9 Reports kriegt). Wenn du dich korrekt verhälst, können dich sogar in jedem Game 9 Spieler reporten und nichts geschieht.\nAber sich so toxisch zu verhalten bringt wie gesagt nichts; im Gegenteil! Damit werden die Reports bzw. damit auch die Strafe gerechtfertigt.\n\nDeshalb: in solchen Fällen einfach muten und kein negatives Wort sagen. Wenn du dich an die Regeln hällst, kann dich niemand bestrafen, egal wie viele Reports du kriegst.","replies":[]},{"poster":"Groath","date":"2015-09-16T18:27:51.947+0000","up_votes":1,"down_votes":0,"body":"Ja, leider haben sie das geschafft und du musst eine 14 Tage lange Spielpause einlegen.\n\nEhrlich gesagt finde ich eine Strafe zwar gerechtfertigt, aber einen 2-Wochen Ban sehe ich dort nicht unbedingt. Es kann sein, dass das System vor Allem das \"monkey language\" als rassistisch gesehen und die Strafe dadurch härter gemacht hat. Rassismus wird als sehr schwerwiegend gesehen in dem System, das könnte den 2-Wochen Ban erklären. Ein kleiner Ausrutscher, der aber leider sehr stark ins Gewicht fällt.\n\nDu könntest die 2 Wochen etwas runterkommen von dem ganzen League Stress und danach versuchen, neu anzufangen. Vielleicht hilft die Pause auch dabei, etwas mehr Abstand von dem Spiel und den Leuten, denen man ständig begegnet zu nehmen.\n\nIch wünsche dir auf jeden Fall alles Gute! Und hoffe, dass du nicht noch mal gebannt wirst :)","replies":[{"poster":"eingew","date":"2015-09-16T18:41:00.237+0000","up_votes":1,"down_votes":0,"body":"Ich finde \"monkey language\" sollte man nicht herunterspielen. Egal wie es gemeint ist, der Satz ist äußerst rassistisch und rechtfertigt in meinen Augen auch einen zweiwöchigen Ban.","replies":[]}]},{"poster":"eingew","date":"2015-09-16T18:39:05.987+0000","up_votes":1,"down_votes":0,"body":"Weil Riot der Auffassung ist, dass die Spieler durch diese Strafe eher über ihr Verhalten nachdenken.","replies":[]},{"poster":"Sirrkas","date":"2015-09-16T18:32:16.355+0000","up_votes":1,"down_votes":0,"body":"Falls du noch Tipps willst, wie man mit dem Ärger gut umgehen kann, da finden sich hier sicher einige, die helfen können, wenn du willst.","replies":[]}]}]}]},{"poster":"Manwe Sulimo","date":"2015-09-21T08:35:21.688+0000","up_votes":1,"down_votes":6,"body":"mit feeden zu drohen kann auch als hilflosigkeit ausgelegt werden. \n\nreportcalls auch aber da bin ich auch dagegen obwohl es mir auch mal passiert dass ich das schreibe\n\nwenn der begriff affensprache geeignet ist die art und weisse des geschireben passend zu beschreiben ist es doch ok. affensprache im sinne von gossensprache wäre völlig akzeptabel. affensprache als flame gegen eine andere sprache an sich hingegen nicht. **können wir hier aber nicht beurteilen.**\n\nund jetzt? vielleicht hast du ja gelesen, aber noch mehr im vorteil ist wer dabei auch versteht. sorry für den bissigen Kommentar aber wer sich wie du aus dem Fenster lehnt muss auch die Höhe vertragen. Dein Kommentar ist einfach schrecklich undifferenziert. Aber bei diesem Thema ist das leider oft an der Tagesordnung.","replies":[{"poster":"Rirol","date":"2015-09-21T10:18:54.059+0000","up_votes":3,"down_votes":0,"body":"Naja, wie man in den Wald ruft so schallt es wieder heraus.^^ Komm ich klar mit...\nVerstehen tu ich auch. Affensprache ist abwertend / beleidigend, wenn ich jemanden nicht verstehe teile ich ihm dies vernünftig mit. Hätte der TE monkey weg gelassen, wäre es völlig okay gewesen.\nAuf der Straße / Arbeit würdest du glaube ich niemanden einfach so antworten \" ich verstehe ihre Affensprache nicht\", wenn dich jemand in einer anderen Sprache oder schlechtem Deutsch anspricht. \nUnd wir können davon ausgehen, dass die anderen Chatteilnehmer entweder in ihrer Muttersprache oder ganz schlechtem Englisch geschrieben haben und nicht Ugh und iieek. ;)\nWarum soll das in einem Chat akzeptabel sein?\nUnd der Hausherr scheint das genauso zu sehen, sonst wäre es nicht Strafbar.\nEs gibt in dem Punkt halt eine 0 Toleranz Politik und keine \"der hat aber auch\" oder \"bei uns ist das aber alltags Gerede\" (sprich \"normal\") ausrede.","replies":[{"poster":"eingew","date":"2015-09-21T16:17:16.301+0000","up_votes":1,"down_votes":0,"body":"Welcher normale Mensch will schon ernsthaft, dass sein Laden Nazis als Stammkunden hat?","replies":[]}]}]}]},{"poster":"crit in ur anus","date":"2015-09-16T20:56:37.082+0000","up_votes":2,"down_votes":0,"body":"du schreibst am besten nichts mehr was nicht das spiel betrifft alskein flame jeder art da nach dem 14 tage bann der permafolgt^^","replies":[]},{"poster":"Jumper113","date":"2015-09-16T19:06:04.793+0000","up_votes":1,"down_votes":0,"body":"Wow, \n\nAlso wenn du selbst mit Vorlage deines Chatlogs nicht einsiehst, dass der Bann gerechtfertigt ist, ist dir nicht mehr zu helfen. \n\nIch könnte dir jetzt auf Anhieb ~15 report Gründe nennen, aber das macht eh keinen Sinn. \n\nIch würde dir nochmal ans Herz legen,  einen Englisch Kurs zu besuchen, weil deine \"Monkey Langauge\" warscheinlich genauso abgrundtief schlecht ist wie die deiner Mitspieler.\nVielleicht verbesserst du dich ja irgendwann\n\nMfg Jumper","replies":[{"poster":"ValorDragon","date":"2015-09-16T19:21:47.173+0000","up_votes":1,"down_votes":3,"body":"Bitte lies die anderen Antworten die ich schreibe auch danke. Bzw. bitte reg dich nicht auf wenn man selber noch Fehler macht. \n\n*wahrscheinlich\n\nPS: Mach keinen auf Lehrer mein lieber.","replies":[{"poster":"Jumper113","date":"2015-09-16T19:44:32.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ValorMaster,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=00050001,timestamp=2015-09-16T19:21:47.173+0000)\n>\n> Bitte lies die anderen Antworten die ich schreibe auch danke. Bzw. bitte reg dich nicht auf wenn man selber noch Fehler macht. \n> \n> *wahrscheinlich\n> \n> PS: Mach keinen auf Lehrer mein lieber.\n\nIch habe einen Fehler gemacht, du ca. 25. \n\nEin Tipp: du musst deine Mitspieler nur in der Championselect ertragen. Es gibt nämlich so einen schönen Befehl, der nennt sich /mute all (kannst du ganz einfach Ingame eingeben). Dann macht das Spiel auch auf einmal wieder viel viel mehr Spaß.\n\nMfg Jumper\n\n\nPS: Ich habe nie versucht einen auf Lehrer zu machen, aber wenn du das so auffasst. Naja...","replies":[{"poster":"eingew","date":"2015-09-16T19:51:39.649+0000","up_votes":1,"down_votes":0,"body":"Naja, dafür redest du ziemlich von oben herab :P","replies":[{"poster":"Jumper113","date":"2015-09-16T20:03:21.275+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=UotHu8gV,comment-id=0005000100000000,timestamp=2015-09-16T19:51:39.649+0000)\n>\n> Naja, dafür redest du ziemlich von oben herab :P\n\nJa mag sein :b, aber ich hoffe er lernt daraus und flamet nicht weiter. Dann würde ich mich auch freuen wenn ich mal mit ihm gematcht werde. \n\nMfg :3","replies":[{"poster":"eingew","date":"2015-09-16T20:53:48.956+0000","up_votes":2,"down_votes":0,"body":"Die meisten Menschen reagieren auf sowas aber eher mit Trotz, als mit Verständnis und Einsicht.","replies":[]}]}]}]}]},{"poster":"Jumper113","date":"2015-09-16T19:12:26.770+0000","up_votes":1,"down_votes":0,"body":"\n>\n","replies":[]}]},{"poster":"Killerkante","date":"2015-09-16T18:23:20.566+0000","up_votes":2,"down_votes":0,"body":">Zed report too ok\n>Now i feed bot\n>Now cry\n>And you say report?\n>No Monkey Langauage pls.\n>Report Kalista for flame\n>Feed bot yay\n>:D\n>Kid?\n>Blitz i dont unterstand your monkey langague\n>But np i report you all too\n>Ban for what?\n>Feeding?\n>Not give that ban\nI> no flame\n>only salty\n>kid\n>My team will report me for feeding and i will got a banned. haha. :D\n>Kalista feed\n>Nice Stats Kalista\n>Nice Kalista\n>No\n>Kid go sleep pls\n> have a reason to report you. :D\n>You have no reason kid?\n>Kalista say im feed and look her stats... So funny\n>Easy. xD\n>I \"troll\" with feeding but Kalista feed more..\n\n\nDu verschwendest scheinbar das ganze Spiel über Deine Zeit damit, mit den Leuten auszudiskutieren, dass du keinen Bann verdienst, deine Gegner aber schon.\nZudem Trashtalkst du einfach durchgehend.\nMein eigenes Englisch ist zwar auch nicht das beste, allerdings bekomme ich von deinem Englisch echt starke Kopfschmerzen^^\nVerdient ists jedenfalls, du hast aber Glück dass bald das neue System erscheint. (oder ist das schon da?)\nFalls ja nehm ich des zurück, dann bist du deine Belohnungen quit.","replies":[{"poster":"ValorDragon","date":"2015-09-16T18:55:48.216+0000","up_votes":1,"down_votes":2,"body":"Wieso hab ich Glück wenn das neue System erscheint? Passiert dann etwas? Naja z.B \"Now i feed bot\" war eigentlich eine Antwort. Oder \"Blitz i dont unterstand your monkey langague\" ist z.B sogar falsch geschrieben und ich bin mir nicht mal sicher ob der jennige überhaupt Englisch konnte.","replies":[]}]}]}