{"poster":"ValorDragon","date":"2015-12-05T14:52:54.928+0000","title":"Angst! Vor einer Sperrung.","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Huhu,\r\n\r\nhabe mal eine Frage... Und zwar: Habe heute ein Match gemacht wo ich geschrieben habe: noob broken Champ und gg easy.\r\n\r\nUnd am Ende des Games meinte ein Gegner zu mir das ich jetzt Permanent gesperrt werde!\r\nStimmt das? \r\nHabe gerade Angst um meinem Account.\r\n\r\nLg Valor","replies":[{"poster":"legofreak1","date":"2015-12-05T14:59:53.832+0000","up_votes":4,"down_votes":0,"body":"Wegen eines Ausrutschers wirst du nicht sofort instant Permagebannt werden. Wenn du aber andauernd schlechtes Verhalten an den Tag legst, dann wirst du auf Dauer Restriktionen, bis hin zum Permabann, erhalten.","replies":[{"poster":"ValorDragon","date":"2015-12-05T15:09:19.413+0000","up_votes":1,"down_votes":0,"body":"Also eher nicht. Okay danke. Aber wenn man \"easy\" schreibt. Ist das negativ?","replies":[{"poster":"hshtagniemehrcdu","date":"2015-12-05T15:41:34.372+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=ValorMaster,realm=EUW,application-id=KYnfKGf0,discussion-id=hP3v5zmn,comment-id=00000000,timestamp=2015-12-05T15:09:19.413+0000)\n>\n> Also eher nicht. Okay danke. Aber wenn man \"easy\" schreibt. Ist das negativ?\n\nEs gibt kaum einen schnelleren Weg zum Ban als \"easy\".\nWeil's einfach nur asozial ist.\n\n> deswegen habe ich es geschrieben.\n\nWird bei einer Strafe nicht berücksichtigt, warum.\nEntweder du hast so etwas geschrieben oder nicht.\nFertig.","replies":[]},{"poster":"Lance90","date":"2015-12-05T15:13:51.780+0000","up_votes":1,"down_votes":0,"body":"Da scheiden sich die Geister.\n\nKommt wohl auf den Kontext an. Wenn du das Spiel tatsächlich dominiert hast und sowas im Allchat spamst kann man das wohl negativ auffassen. Positiv ist es sicher nicht.\n\nWenn du die Runde hart verloren hast wird aber wohl keiner dafür reporten.","replies":[{"poster":"eingew","date":"2015-12-05T16:28:01.661+0000","up_votes":1,"down_votes":0,"body":"Doch. Hätte ich auch nicht mit gerechnet, aber ich habe hier im Forum durchaus schon Leute gefunden, die das ebenso als negativ empfinden.","replies":[{"poster":"Metalmonni","date":"2015-12-05T16:32:25.615+0000","up_votes":2,"down_votes":0,"body":"Stimmt, ich reporte zum Beispiel jedes \"Ez\", \"Easy\", \"rekt\" oder \"Noob\" das mir unterkommt, egal von wem und wann. Ist für mich einfach ein Unding. Es ist unsportlich und soll den Gegner herabwürdigen, das hat für mich in einem kompetitiven Wettstreit nichts verloren. \n\nAber es sit ja nur meine Meinung die auf diesem Wege in die Chatanalyseprogramme einfließt... Wenn der Großteil es am Ende doch für okay hält kann ich damit leben :).","replies":[]}]},{"poster":"ValorDragon","date":"2015-12-05T15:20:08.942+0000","up_votes":1,"down_votes":0,"body":"Okay. Dort war eben so ein Spieler im Gegner Team der meinte das ich schlecht bin etc. Wir waren am Anfang sehr schlecht aber wir haben eben dann trotzdem gewonnen deswegen habe ich es geschrieben. Danke für die Antwort.","replies":[{"poster":"Metalmonni","date":"2015-12-05T16:24:12.080+0000","up_votes":2,"down_votes":1,"body":"In so einem Fall den Gegner lieber einfach muten & hinterher melden. Es ist niemals gut auf so etwas zu antworten, schreib einfach gar nichts und gönne den Flamern nicht das Gefühl, dich zu einer Reaktion provoziert zu haben. \n\nEinfach ignorieren, das ist das Gesündeste für dich und deinen Account.","replies":[]}]}]},{"poster":"Jinpaxchi","date":"2015-12-05T18:06:30.067+0000","up_votes":1,"down_votes":0,"body":"Kommt darauf an. Ich finde es meist beleidigend. Man spielt 40 Minuten recht ausgeg,ichen liegert sich tolle fights und hat dann einmal wirklich Pech und wird geaced und verliert dann. Wenn dann einer schreibt easy finde ich das beleidigend.\n\nAber das ist bisher bei mir noch nicht vorgekommen, meist gratuliert man sich unter eineinander und die \"Honorable Opponents\" purzeln nur so.\n\nWen Du aber öfter solche Sache schreibst dann könnte es zum kurzban kommen.","replies":[]}]}]},{"poster":"clair de lune289","date":"2015-12-05T15:12:28.376+0000","up_votes":3,"down_votes":0,"body":"sachen wie \"gg easy\" werden als unsportlch betrachtet.\nDas kann, wenn du es wederholt machst, zu ener Strafe führen (ja auch zu einem Bann wenn du aus den ersten Strafe ncht lernst)\nDe allenge Aussage das ein Champ \"broken\" ist, sollte erlaubt sein wenn du damit nemanden direkt ansprichst sondern nur deneMenung über desen Champ äußersts. (z.B. wenn der Gegner den Champ hat NCHT!! im allchat)","replies":[]},{"poster":"Erhardt","date":"2015-12-05T15:41:39.603+0000","up_votes":2,"down_votes":1,"body":"Wenn du Pech hast bekommst du sogar durch dieses eine mal nur eine Chat Sperre.","replies":[]},{"poster":"nox5555","date":"2015-12-06T08:58:14.146+0000","up_votes":1,"down_votes":0,"body":"leider nein-","replies":[]}]}