{"poster":"Zaramonth","date":"2017-06-12T00:57:14.585+0000","title":"Perdida de paquetes en el lol, fin de semana 09/06 11/06","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"&iquest;Alguien me podria explicar que es lo que esta sucediendo con la constante perdida de paquetes que hubo este fin de semana?\r\n\r\nEs un desastre la mantencion que esta teniendo el servidor, Perdi 2 rankeds seguidas por esta problematica, alguien mas experimenta los mismos problemas?\r\n\r\n\r\nMi internet no es ya que tengo un pingeo constatnte con un cmd y no se corta en ningun momento, es solo algunas zonas de argentina o que es lo que sucede?","replies":[{"poster":"SuparK","date":"2017-06-12T01:09:05.308+0000","up_votes":2,"down_votes":0,"body":"SIIIIII, Gracias a dios no soy el unico la pta madre, me costaron 2 rankeds loco, puede alguier responder que es lo que pasa? es un desastre esto, ya el nuevo cliente anda mal y ahora esto, dale men derrota activada pls, nadie piensa en los pobres lps?","replies":[]},{"poster":"Nerwal","date":"2017-06-12T01:02:23.315+0000","up_votes":2,"down_votes":0,"body":"A que te referis con perdida de paquetes?, quiero saber si es lo mismo que me pasa a mi...","replies":[]},{"poster":"Furious Gixa","date":"2017-06-12T01:00:08.364+0000","up_votes":2,"down_votes":0,"body":"Coincido totalmente es un desastre el servicio que estan dando, se me corta todo el tiempo y tengo que cerrar y volver a cargar cliente el plena partida, es una mierda esto, estaria bueno que alguien de riot se pueda acercar y pueda explicar que pasa","replies":[]},{"poster":"Xzayoi","date":"2017-06-12T14:03:47.310+0000","up_votes":1,"down_votes":0,"body":"Soy de Chile, ya desde hace 4 días empezé a tener 220ms constantes, y ahora tengo 240ms, y eso que jugaba con 15 ms mínimo. Es imposible jugar, gracias a esto me dieron colita de baja prioridad :)","replies":[]},{"poster":"POLK4","date":"2017-06-12T05:46:00.373+0000","up_votes":1,"down_votes":0,"body":"Hola en Misiones pasa lo mismo :v","replies":[]},{"poster":"Zaramonth","date":"2017-06-12T01:01:14.957+0000","up_votes":1,"down_votes":1,"body":"bueno me deja tranquilo saber que no soy el unico, algun red post que pueda pasasrse y responder?","replies":[{"poster":"Róms","date":"2017-06-12T02:39:15.496+0000","up_votes":1,"down_votes":0,"body":"Hola de nuevo,\n\nTe respondí, no soy un red post, pero soy un agente de soporte de igual manera. Si no inicias una solicitud de asistencia no podremos ayudarte, ya que por el momento no hay problema alguno con el servidor.\n\n¡Saludos!","replies":[]}]},{"poster":"HYG Vyacheslav","date":"2017-06-12T02:30:01.161+0000","up_votes":1,"down_votes":0,"body":"También me pasa lo mismo, me costaron 2 rankeds. Es terriblemente frustrante estar tratando de jugar concentrado y no saber si al momento de hacer algo te vas a quedar trabado o no por la perdida de paquetes.","replies":[]},{"poster":"Zaramonth","date":"2017-06-12T01:03:11.751+0000","up_votes":1,"down_votes":0,"body":"los champs se quedan como patinando, no ves los creeps, es como si estarias conectado pero todo en camara lenta y sin reacciones","replies":[]},{"poster":"Róms","date":"2017-06-12T01:15:58.474+0000","up_votes":1,"down_votes":1,"body":"Hola !\n\nVeo que no has enviado una solicitud o chat con tu problema. Te invito a iniciar uno de estos para analizar que está sucediendo.\n\n - https://support.riotgames.com/hc/es-419/requests/new\n\n¡Saludos!\n\n{{champion:119}} {{champion:119}}","replies":[]}]}