{"poster":"Nordwolf87","date":"2017-07-24T12:12:27.870+0000","title":"noobfrage \"meta champ\"","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo\r\n\r\nWiee der titel schon sagt ist das sicher eine noobfrage aber: ich habe immer wieder gelesen jayce ist ein &quot;meta champion&quot;. Da ich ihn selbst ab und zu spiele w&uuml;sste ich gern:\r\n\r\nWas ist ein &quot;meta champion&quot; bzw was macht einen champion zu einem &quot;meta champion&quot;?\r\n\r\nDanke und Lg","replies":[{"poster":"Nordwolf87","date":"2017-07-24T12:23:07.205+0000","up_votes":2,"down_votes":0,"body":"Ah ok. Danke! Dachte das kommt von seinem R dass er nah UND fernkämpfer ist und daher meta. Soe wie eine meta studie andere studien zudammenfasst, fasst er mehere champs zusammen (melee und range) :-D da lag ich voll daneben :-/\n\nStimmt habe unlängst jayce nach langem mal wieder gespielt (hatte grad keine lust auf taliyah in der mid lane :-D) die lethality änderung hat ihm echt viel dmg gebracht.","replies":[{"poster":"franticFurball","date":"2017-07-24T13:00:38.530+0000","up_votes":1,"down_votes":0,"body":">Soe wie eine meta studie andere studien zudammenfasst\n\n\"Meta\" steht in dem fall nicht für den griechischen Wortstamm \"inmitten, zwischen, übergeordnet\", sondern ist ein simples Akronym:\n\n**M**ost **E**fficient **T**actic **A**vailable\n\nDu wirst die Bezeichnung \"Meta\" oder \"Etwas ist Meta\" in fast allen Onlinespielen finden, wenn es um Stärken/Schwächen von Helden, Fraktionen, Einheiten, Taktiken, Teamcompositionen, Farmmethoden, etc. geht.","replies":[{"poster":"Nordwolf87","date":"2017-07-24T13:34:28.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=franticFurball,realm=EUW,application-id=Wj1wcocU,discussion-id=LxYfPTPU,comment-id=00020000,timestamp=2017-07-24T13:00:38.530+0000)\n>\n> &quot;Meta&quot; steht in dem fall nicht für den griechischen Wortstamm &quot;inmitten, zwischen, übergeordnet&quot;, sondern ist ein simples Akronym:\n> \n> **M**ost **E**fficient **T**actic **A**vailable\n> \n> Du wirst die Bezeichnung &quot;Meta&quot; oder &quot;Etwas ist Meta&quot; in fast allen Onlinespielen finden, wenn es um Stärken/Schwächen von Helden, Fraktionen, Einheiten, Taktiken, Teamcompositionen, Farmmethoden, etc. geht.\n\nDas erklärts! Dieses akronym war mir bisher unbekannt.","replies":[{"poster":"The mute Swan","date":"2017-07-24T13:37:27.556+0000","up_votes":1,"down_votes":0,"body":"Und ich dachte immer das wären nur die champs, die meine Nachbarin Metha spielt. Dammit. Man kann hier aber auch echt zu viel missverstehen...","replies":[]}]}]}]},{"poster":"Necromant","date":"2017-07-24T12:16:20.337+0000","up_votes":2,"down_votes":0,"body":"Ich würde stumpf nach der Statistik geht, umso weiter oben in der Winrate Liste, umso besser passt der Champ in die aktuelle Meta.\nhttps://euw.op.gg/champion/statistics\n\nMeta Champions sind solche, die gut mit aktuellen Änderungen Synergiert. z.B. Jayce durch die Lethality-Änderungen ;)","replies":[]},{"poster":"Pure Cynicism","date":"2017-07-24T12:28:43.659+0000","up_votes":1,"down_votes":3,"body":"Die Meta wird nicht nur von der Winrate beeinflusst. Siehe Ryze, der in der LCS immer noch gespielt wird, obwohl er für die SoloQ tot ist.\n\nMeta ist einfach das, was bei nahezu 100% fehlerfreiem Spiel am stärksten ist. Da aber von uns normalsterblichen Spielern niemand auch nur annähernd in diese Skillbereiche kommt, ist die Meta für uns völlig egal.","replies":[{"poster":"Kaorî","date":"2017-07-24T12:51:18.172+0000","up_votes":1,"down_votes":0,"body":"Entweder ist meine Quelle falsch oder ich bin zu blöd zum suchen, aber in dieser Season wurde in der Profi Liga (Rift Rivals, EU LCS, MSI, Spring Playoffs, LCK, etc) nicht ein einziges Mal Ryze gepickt. Sehe da nur die typischen Pro-Champs, also LeBlanc, Orianna, Cassiopeia, Talon, Corki, Jayce, etc.","replies":[]}]},{"poster":"Asgorah","date":"2017-07-24T12:15:17.129+0000","up_votes":1,"down_votes":0,"body":"naja die einfachste erklärung wäre das, dass meta ist was die pros vergeben \nhalt sehr vereinfacht","replies":[]},{"poster":"Vampire Knight97","date":"2017-07-24T12:31:33.678+0000","up_votes":1,"down_votes":4,"body":"Champs die momentan extrem stark sind, oft gewinnt man weil man den op champ spielt nicht wegen skill.\n\nmomentan sinds zb ahri, jayce, ka und alle duskblade champs","replies":[]}]}