{"poster":"Nordwolf87","date":"2017-07-21T09:17:08.792+0000","title":"Shen?","subforum":"Champions & Gameplay","up_votes":3,"down_votes":0,"body":"Hallo.\n\nIch verfolge recht gern die LCS und schau mir einige spiele an um mir tricks und so abzuschauen bzw was &uuml;ber possitioning und items adaption an unterschiedliche gegner zu lernen ;-) \n\nSeit einiger Zeit ist mir aufgefallen dass man nur mehr ganz selten einen Shen in der TopLane sieht. Meist sind es Renek, gnar, rumble und jarvin.\n\nIch finde Shen macht viel Spass und ist auch recht stark (leider fehlt ihm finde ich bisschen das waveclearing im vergleich mit galio, rumble oder renek).\n\nHab ich einen nerf &uuml;berlesen oder wei&szlig; zuf&auml;llig jemand warum er so unbeliebt geworden ist (er wird gro&szlig;teils nicht mal gebannt, scheinbar geht keiner davon aus dass er genommen wird)?\n\nDanke und Lg\n\nNordwolf","replies":[{"poster":"xSyruSx","date":"2017-07-21T13:48:14.177+0000","up_votes":1,"down_votes":0,"body":"Ich würde nicht sagen das er kaum Schaden drückt, er hat nur keinen wirklich effektiven Weg um auf Schaden zu bauen außer mit Titanic Hydra.\n\nAuf der Lane allerdings hat er einen der stärksten Lvl 1/2 Trades wenn man die Geisterklinge richtig benutzt. Damit drückt man dem Gegner ganz gerne mal mit 3 AA's über 60% HP.\n\nAuf der Lane muss man Shen ohnehin deutlich aggressiver Spielen als den alten. Immer wieder mit E rein, Q durch den Gegner Jagen und in den Tot Autohitten. Bei Gegenwehr hilft der Passiv Schild, der sich verdammt schnell erneuert wenn man mit Spells Gegner trifft und sein W, was vielen Toplanern ein richtiger Dorn im Sack ist.\n\nWas Shen jedoch fehlt sind die Tankwerte für nen Champion der als Tank klassifiziert wird, und der Sustain auf der Lane. Ein HP Scaling auf der Ult würde dem Ninja auch ganz gut tun...es ist manchmal echt frustrierend wenn dein Verbündeter, trotz guter Reaktion vom Shen Spieler, einfach umgeballert wird...gegen EINEN einzigen gegnerischen Champion. Achja, der Waveclear vor Sunfire bzw. Titanic ist auch..ja...nennen wir es mal bescheiden.\n\nAußerdem hat Shen ein Matchup welches er nicht gewinnen kann, und das ist {{champion:122}} . Da der Typ im Soloq noch relativ beliebt ist, kann es schon verdammt frustrierend sein, wenn man von vornherein weis dass die Toplane nen Lose wird.","replies":[{"poster":"Nordwolf87","date":"2017-07-22T00:41:16.714+0000","up_votes":1,"down_votes":0,"body":"Lvl 1/2 trades sind fine aber ich hab letztens auf einen toplane lucian null dmg bekommen und nur den 1. Trade gewonnen, ab lvl 3 hat der mich aufgemacht...das war nimmer lustig...","replies":[]}]},{"poster":"Leylania","date":"2017-07-21T09:31:12.618+0000","up_votes":1,"down_votes":1,"body":"Ja er ist generft worden, das Schild von seinem Ult ist jetzt davon abhängig wie wenig Leben das anvisierte Ziel noch hat. Damit ist es nicht mehr so effektiv zum Schutz direkt am Anfang des Kampfes den ADC mit vollem Leben zu ulten damit der möglichst wenig Schaden bekommt oder z.B. auf Rengar zu ulten damit der vollkommen sicher reinspringen kann und Shen gleich mitbringt ( jetzt besteht eher die Gefahr dass er vorher stirbt). Außerdem ist der Cooldown vom Ult höher geworden. Und (als wärs nicht langsam mal genug) der Schaden von seinem Q gegen Vasallen und Monster ist reduziert worden was seinen Waveclear schlechter macht. \nHier die Patchnotes dazu http://euw.leagueoflegends.com/de/news/game-updates/patch/patchnotizen-78#patch-shen","replies":[{"poster":"Nordwolf87","date":"2017-07-21T10:14:37.826+0000","up_votes":1,"down_votes":0,"body":"Hmmm ok das erklärts...schade um ihn ich fand ihn einen der spannendsten toplaner. den nerf hab ich offenbar überlesen. Habe aber auch selbst gemerkt dass ich mir mit ihm sehr schwer tu...\n\nDanke!","replies":[{"poster":"Leylania","date":"2017-07-21T11:09:47.894+0000","up_votes":1,"down_votes":0,"body":"Die Nerfs klingen zwar hart aber er ist immernoch spielbar, ich mag ihn auch nach den Nerfs immernoch sehr gerne ^^","replies":[{"poster":"Nordwolf87","date":"2017-07-21T12:01:32.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Leylania,realm=EUW,application-id=Wj1wcocU,discussion-id=8XnAeqEj,comment-id=000000000001,timestamp=2017-07-21T11:09:47.894+0000)\n>\n> Die Nerfs klingen zwar hart aber er ist immernoch spielbar, ich mag ihn auch nach den Nerfs immernoch sehr gerne ^^\n\nIch mag ihn auch gerne, hat mich nur gewundert, dass er so komplett aus LCS verschunden ist ;-) \n\nhab nur das problem dass ich sehr oft in meiner lane zurückgedrängt werde, weil viele andere toplaner schnelleres waveclear haben. Ich helf mir dann immer wieder mim sunfire...aber gegen zauberlastige teams geht das schlecht ;-)","replies":[]}]},{"poster":"franticFurball","date":"2017-07-21T10:34:32.422+0000","up_votes":1,"down_votes":0,"body":"Der nerf ist halt nicht der Grund für den aktuellen Slump, denn er wurde nach dem Nerf genauso gespielt...","replies":[]}]}]},{"poster":"franticFurball","date":"2017-07-21T09:33:42.623+0000","up_votes":1,"down_votes":0,"body":"Problem ist, dass Shen zwei Schwächen hat:\n\n* Dmg Lastige Carrytoplaner die einfach über ihn drüberlatschen\n\n* Champions die seinen Ult interrupten können\n\nDerzeit sind einfach sehr viele Toplaner en vogue die eines oder beides exzellent beherrschen, so können zb. Rene und J4 ihn beide in der Lane dominieren, und haben beide die Möglichkeit seinen Ult abzubrechen (Rene: Stun, J4: Knockup).\n\nAbgesehn davon erfordert Shen auch einen anderen Teamaufbau, da er selber kaum dmg drückt, das muss die composition dann natürlich ausgleichen können.","replies":[]}]}