{"poster":"lMaknusl","date":"2015-01-30T01:15:58.004+0000","title":"Problemas de descarga Parche 5.2","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hola... bueno mi problema es que ,con la llegada de este parche ,al intentar actualizarse el juego no descarga nada .... empezaba a descargar y solo llegaba al 3% y ya no descargaba mas ,se quedaba pegado, entonces decidí ''Reparar el juego'' . Luego de repararse empezó a actualizarse y solo llego al 1% , lo deje toda la noche y seguía en 1 % ( no tengo un mal Internet son 15 MB ). Como no funciono desinstale el juego y desactive el firewall. El juego se instalo bien pero al llegar a las actualizaciones se detuvo nuevamente. \r\n\r\n**No creo que el problema sea una descarga muy lenta ya que lo deje toda una noche.**\r\n\r\nOjala puedan ayudarme a solucionar este problema se los agradecería mucho  ( ya e buscado y veo que a nadie le a pasado , si me equivoco y ya había un post con esto mismo, lo siento )\r\n\r\nSaludos.-","replies":[{"poster":"jesusoldschoolhc","date":"2015-02-06T06:16:06.452+0000","up_votes":1,"down_votes":0,"body":"ME ESTA PASANDO LO MISMO LO QUE REALICE FUE DESINTALAR  TOTAL MENTE DE LA PC TODAS LAS CARPETAS NO SE EN TU PC PERO MI PC TIENE EL DISCO DURO COMPARTIDO EN D Y EN C UNA VES QUE LO DESINTALES TOTAL MENTE QUE NO QUEDE NADA DE LEGUE OF LEGUEND O RIOT GAMES EN TU PC INSTALA DE NUEVO Y CUANDO TE APAREZCA EL PROGRAMA DE INSTALACIÓN Y LE DAS SIGUIENTE HASTA LLEGAR A LA OPCIÓN 3 QUE TE DICE EN QUE CARPETA QUIERES INSTALAR EL LOL LO INSTALAS EN LA CARPETA D PROBÉ DE ESA MANERA Y AHORA SI ESTA CARGANDO CORRECTAMENTE ESPERO QUE SE SOLUCIONE SI NO NO SE QUE VOY HACER EN YOUTUBE APARECEN UN MONTÓN DE VÍDEOS DONDE DICE PROBLEMAS DE ACTUALIZAR EL LOL Y CORREGIR LOS ERRORES COMO ERROR 33% O 99%  DE LA ACTUALIZACIÓN  PERO NO ME FUNCIONO NO HAY NINGUNA SOLUCIÓN PARA EL PARCHE 5.2\nPRUEBA DE ESA MANERA IGUAL SI ACTUALIZA CORRECTAMENTE VOY A SUBIR UN TUTORIAL PARA TODOS LO QUE LES PASO LO MISMO","replies":[]}]}