{"poster":"FacerollKatarina","date":"2017-10-14T01:42:12.188+0000","title":"What I feel is missing on the new Katarina skin...","subforum":"Story, Art, & Sound","up_votes":4,"down_votes":1,"body":"Some sort of voice effects!\r\nOne of the things with PROJECT Katarina is that she has sounds effects on her daggers, but she also has sound effects on her voice lines, making everything feel connected.\r\nThat's what I think this skin is REALLY missing!\r\nHer abilities feel like they don't connect with her because she sounds normal with all these spooky ability sounds, is there a chance that we can add a voice filter over it to make it sound and feel a whole lot better? Even if it had to be held back for a bit, it would feel so much better.\r\nThoughts?","replies":[{"poster":"semipriceysoap","date":"2017-10-14T07:47:28.794+0000","up_votes":9,"down_votes":1,"body":"Hi FacerollKatarina!\n\nDeath Sworn Katarina actually does currently have voice effects! However, it was a bit difficult to hear, so I added some sound effect elements to it when she speaks. It didn't go out with the original PBE release, but should be on PBE now if you have access or wanna watch some PBE streams with her in it. :) Hope that addresses this!","replies":[{"poster":"FacerollKatarina","date":"2017-10-14T14:54:32.939+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=semipriceysoap,realm=NA,application-id=6kFXY1kR,discussion-id=BQE6lFEF,comment-id=0000,timestamp=2017-10-14T07:47:28.794+0000)\n>\n> Hi FacerollKatarina!\n> \n> Death Sworn Katarina actually does currently have voice effects! However, it was a bit difficult to hear, so I added some sound effect elements to it when she speaks. It didn&#x27;t go out with the original PBE release, but should be on PBE now if you have access or wanna watch some PBE streams with her in it. :) Hope that addresses this!\n\nAh Thank You! Also I have another visual question about katarina, not sure if you'd be able to answer it. Awhile ago she had a running animation https://www.youtube.com/watch?v=soCg5RbgYIA&t=163s (you can see it here)\nBut it was taken out of the game for some reason or another, any idea why? It's been a LONG time since its been removed, not sure if there was a bug or something.","replies":[]},{"poster":"Terozu","date":"2017-10-14T21:23:07.630+0000","up_votes":1,"down_votes":0,"body":"Im with face roll, that old running animation is awesome.","replies":[]},{"poster":"Xenos von Faneli","date":"2017-10-16T01:12:45.147+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=semipriceysoap,realm=NA,application-id=6kFXY1kR,discussion-id=BQE6lFEF,comment-id=0000,timestamp=2017-10-14T07:47:28.794+0000)\n>\n> Hi FacerollKatarina!\n> \n> Death Sworn Katarina actually does currently have voice effects! However, it was a bit difficult to hear, so I added some sound effect elements to it when she speaks. It didn&#x27;t go out with the original PBE release, but should be on PBE now if you have access or wanna watch some PBE streams with her in it. :) Hope that addresses this!\n\noh look Rioters being allowed to care about tiny details to make the best final product they could, must be nice #NeverforgetYorick","replies":[]},{"poster":"zrWQMdGHtY","date":"2017-10-14T13:30:22.440+0000","up_votes":2,"down_votes":15,"body":"Just asking. Cause I'm a random. When will my voice as a person with 7k or even more hours spent on Katarina, an  around 40+ chapters long fanfiction based on her and literally preaching love towards her will finally be heard? All your mods do is go punish me around for the same things they defend other players, but nobody seems to actually care to notice my thread and to finally hear my voice for once.\n\nEven if I dislike this whole idea with Katarina been dead in this skin, I literally beg for the high heels to be removed and to put her original hair style, because this one looks pretty bad and there's literally no logic to put high heels on Katarina. She always wore boots and it's logical and more realistic for her to keep using boots. Not high heels. Boots. \n\nAnd the swords are ugly as fk. \n\nAnd I know you'll just simple ignore my post and a majority of the community who dont even like Kat will just downvote me cause that's what happens. \n\nWOULD YOU KINDLY FINALLY LISTEN TO ME? Hell... Do I need to make a little cult that praises me as the Katarina main and the person who loves Katarina like literally for real, so I can finally be heard! Guess I do... \n\nExcuse. My buddies at support told me to find a redname in the boards to whine about this cause you guys clearly don't allow them to contact you and give you information. ^^ \nC'mon be a dear, why do I have to have bad feelings with you devs? I mean you guys destroyed me for months mentally when you released that disgusting project ugly robot skin. But at least listen me a bit for this one. At least for the bloody heels... Seriously I'm trying to buy a new Kat skin from 3 years (warring kingdom last) and I never get the chance to. Feels discriminated. (still waiting for pool party and crimson elite leader skin)","replies":[{"poster":"Colonel J","date":"2017-10-15T16:45:56.378+0000","up_votes":2,"down_votes":0,"body":"I'm a bigger Kat fan than you :/","replies":[{"poster":"zrWQMdGHtY","date":"2017-10-15T19:40:10.753+0000","up_votes":1,"down_votes":2,"body":"Are you planning to stalk me or yes?","replies":[]}]}]}]}]}