{"poster":"Kecko","date":"2017-03-17T16:19:24.919+0000","title":"Wieso wird man durch ein gutes Spiel bestraft ???","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"Hallo\r\n ich find es langsam einfach nur lachhaft....\r\nMan spielt sein Game, gewinnt seine Lane, aber das Team macht einfach nichts. Sie sind mit ihrem Support unzufrieden, das passt nicht, dies passt nicht, alles ist schei&szlig;e und quitten dann. Dadurch habe ich schon so viele Games verloren....\r\nJetzt meine frage an Riot , WIESO ZUR H&Ouml;LLE KRIEGE ICH DESWEGEN EINEN DEMOTE, WAS KANN ICH DENN DAF&Uuml;R DAS DIE SO ABNORMAL TOXIC SIND ??????????","replies":[{"poster":"Nocì","date":"2017-03-17T16:35:05.406+0000","up_votes":2,"down_votes":0,"body":"Das ist eine dumme Idee,\ndas ganze Teamplay würde zerstört werden, warum sollte dann, wenn die Gegner die Midlane pushen der 6/0/2 ADC helfen?\nEr hat ja seine super tollen stats, und wenn das spiel gleich verloren ist bekommt er ja keine LP agbezogen wie der 1/8 Midlaner. Der ADC kann dann ja schön in der Base rumlaufen, vielleicht noch 1-2 Waves farmen und sobald Gegner kommen geht er in die Fountain und wartet das gefinished wird.\nEr bekommt dann +10 LP, aber ist ja nicht im Vergleich zum 1/8 Midlaner und 2/5 Jungler die alles versucht haben zu verteidigen und dafür -20 LP bekommen.\n\nDas würde nur dafür sorgen, dass Leute mit Guten Stats sich nicht mehr auf einen Kampf einlassen, wenn ein Gegner gefeedet ist. Vor allem bei Tanks oder Bruisern, sie würden sehr schnell sterben und ihre Stats verschlechtern, während vielleicht das eigene Team dann noch aufräumt, aber davon hat man ja auch nicht so viel weil man als 0/10/20 Maokai keine LP bekommt weil die Stats scheiße sind.\n\nLOL ist ein Teamspiel und die Stats sind nicht so wichtig wie Teamwork. Ein Splitpusher kann auch 10mal sterben, aber immer 2 Gegner vom Rest des Teams fernhalten, hat er dadurch weniger LP verdient weil er gestorben ist? der Rest des Team aber aufräumen konnte? Nein.\n\nDie paar wenigen Trolle oder AFKler würden zwar härter bestraft werden, alledings würde dies auch recht schnell Leute treffen, welche einfach ein schlechtes Spiel hatten oder nur bei Splitten erwischt wurden.","replies":[{"poster":"Kecko","date":"2017-03-17T16:56:01.636+0000","up_votes":1,"down_votes":1,"body":"Es ist ja ok ein schlechtes Spiel zu haben und die spieler die in dem Game gut waren sollen keine + Lp bekommen einfach nur neutral bleiben damit man nicht mit einem Lose wo man 9/3 steht einen demote bekommt weil im team 2 Leute afk waren weil sie unzufrieden mit irgend welchen kleinigkeiten sind","replies":[{"poster":"Nocì","date":"2017-03-17T21:31:40.321+0000","up_votes":4,"down_votes":0,"body":"Nein, das ist ja immer noch das Problem, dass jemand der seine Lane gewinnt selber afk geht, weil bot und mid vllt etwas hinten liegen oder 2 mal gestorben sind. Er hatte ja ein gutes Spiel und bekommt kein Loose, warum also anstrengen und carrien. \n\nDas würde die ganze Spiel Mentalität zerstören. Jeder würde nur versuchen seine Lane zu gewinnen und dann aufgeben wollen sobald einer im Team schlecht spielt. \nWarum sollte ich dir als 2/5 Top helfen, ich steh 5/0 und bekomm keine Lp verloren, hatte ein super spiel. du wurdes vom jungler gecampt und bist 5 mal gestorben, unsere Mid wird super stark im Lategame, du und der Jungler auch. Die Gegner haben aber auch ein 7/1 Zed, der Tot für mich als ADC. Da geh ich doch nach 20min in die Base und bleibe da mit meinen super stats. Wenn Zed mich tötet bekomme ich ja LP abgezogen wegen meiner schlechten Leistung. Also warte ich darauf das der Surrender Vote durchkommt. Du verlierst LP und ich nicht. \nObwohl wir das Spiel total leicht hätten gewinnen können, da wir sie super outscalen. \n\nSO würde jedes Game ausgehen. Einer im Team spielt nur mittelmäßig, weil er gecampt wurde und der Rest des Teams geht afk um ihre stats zu schützen. Nur einer verliert LP und der Rest geht ins nächste Game um das gleiche zu machen. Kaum ein Spiel wäre länger als 20 Min. \n\nUnd das wäre dann auch kein schönes League.\n\nSo wie es jetzt ist, ist es schon gut. Wenn man besser zusammenspielt gewinnt gewinnt man. Selbst wenn der Gegner 1 gefeedeten Toplaner hat, kann man den oft im TF rausfocusen oder durch Vision anders Vorteile bekommen. \nKein Spiel wird durch die Stats einer Person gewonnen, sondern duch Teamplay mit den Mitspielern.","replies":[]}]}]},{"poster":"Mi3zekatze","date":"2017-03-17T20:45:18.310+0000","up_votes":3,"down_votes":0,"body":"Ich habe beim Fußball meinen Gegenspieler immer im Griff laufe aber nicht einmal für meinen Innenverteiliger zurück und decke niemanden. Außerdem biete ich mich nie an und bringe das Spiel nicht weiter. ABER meinen Mann habe ich im Griff der hatte noch nie eine Aktion! Voll unverdient das es 0/5 am Ende steht... scheiß Team","replies":[]},{"poster":"Zanlan","date":"2017-03-17T19:51:13.145+0000","up_votes":1,"down_votes":0,"body":"Sorry, hab die Frage nicht richtig gelesen und für \"Ja!!!\" gestimmt. mb","replies":[{"poster":"Nohgolgh","date":"2017-03-17T20:01:45.776+0000","up_votes":3,"down_votes":0,"body":"Ich finde durchaus, dass man nach Leistung Punkte verliert. Kriterium für die Leistung sollte sein, ob man gewinnt oder verliert.","replies":[{"poster":"Zanlan","date":"2017-03-17T20:15:30.685+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Nohgolgh,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=00080000,timestamp=2017-03-17T20:01:45.776+0000)\n>\n> Ich finde durchaus, dass man nach Leistung Punkte verliert. Kriterium für die Leistung sollte sein, ob man gewinnt oder verliert.\n\n+1","replies":[]}]}]},{"poster":"legofreak1","date":"2017-03-17T16:23:08.023+0000","up_votes":3,"down_votes":0,"body":"LoL ist ein Teamspiel. Du gewinnst als Team und du verlierst als Team. Daher ist es auch wichtig, dass nicht nur deine individuelle Leistung deine Platzierung in der Rangliste beeinflusst, sondern auch deine Fähigkeit im Team zu spielen, dich anzupassen und deinem Team zum Sieg zu verhelfen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-03-17T17:06:15.393+0000","up_votes":1,"down_votes":0,"body":"Wenn du nach einem Spiel direkt absteigen könntest, hättest du bestimmt ein Argument. Da du aber 3 Spiele in Folge verloren hast... und insgesamt nur 44% deiner Ranked Spiele gewinnst... \nUnd ja, wenn du es konstant nicht schaffst deine gewonnene Lane auf dein Team zu übertragen, wirst du irgendwann absteigen. Ist halt so. Die Laningphase ist halt nur ein Teil des Spiels. Der Teil, den du wahrscheinlich gut beherrscht. \n\nEs gibt halt 2 Arten seine Lane zu dominieren: Man konzentriert sich nur auf sich selbst und schlägt verzweifelt die Hände über den Kopf zusammen, wenn die anderen Lanes nicht so funktionieren, wie man das genre hätte (oder noch schlimmer, wirft denen aus seiner Sicht \"Kleinigkeiten\" vor, welche diese zum Ragequitten bringen)...\nUnd diejenigen, die nach ihrem Lanesieg ihre Teammates aufbauen und ihnen helfen. Kannst ja mal raten, welche Spieler mehr Spiele gewinnen... TeamworkOP...","replies":[{"poster":"Kecko","date":"2017-03-17T19:03:13.855+0000","up_votes":1,"down_votes":1,"body":"Es geht doch darum das ich nichts machen kann weil 2 Leute afk sind wie soll ich denn innerhalb von 8 minuten meine Lane krass gewinnen und eine andere lane carrien ???\nLest doch mal bitte, ich habe geschrieben es waren 2 mann afk ...","replies":[{"poster":"MeMyselfandBaal","date":"2017-03-18T02:32:16.648+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kecko,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=00060000,timestamp=2017-03-17T19:03:13.855+0000)\n>\n> Es geht doch darum das ich nichts machen kann weil 2 Leute afk sind wie soll ich denn innerhalb von 8 minuten meine Lane krass gewinnen und eine andere lane carrien ???\n> Lest doch mal bitte, ich habe geschrieben es waren 2 mann afk ...\n\nUnd die 2 Spiele davor? Also ja, dass das eine Spiel so verlaufen ist, ist ärgerlich. Aber du bist halt nicht wegen dieses einen Spieles abgestiegen. Es ist ja nicht so, dass du sofort absteigst, sobald du auf 0 LP fällst. Sondern wenn du konstant um die 0 LP rumgurkst. Wenn du 3 Spiele in Folge bei 0 LP verlierst. Wenn dein Gesamtniveau der letzten Spiele unter (in deinem Fall) Platin IV Niveau gespielt hast...\n\nOder um das ganz große Bild zu zeichnen, dass du in dieser Saison eine Winrate von 45% hast... natürlich muss Riot dich dann irgendwann absteigen lassen. Das liegt aber niemals nur an dem einen Spiel. Und auf dieses eine Spiel solltest du dich einfach nicht versteifen. Ja, teilweise verliert man spiele, weil der Jungler den Support flamet und der deswegen AFK geht. Da kann man dann einfach nichts dafür. Das passiert allen mal. Und wenn man deswegen auch noch absteigt, ist das extrem tilting. Dass man aber nur noch eine Niederlage (egal wie diese zustande kam) vom Abstieg entfernt war, liegt keinesfalls an diesen Teammates sondern hauptsächlich an einem selbst. Darauf solltest du deinen Fokus legen.","replies":[]}]}]},{"poster":"Benfazus","date":"2017-03-19T00:42:54.723+0000","up_votes":1,"down_votes":0,"body":"Wie kann ich ein Spielreplay einstellen, in Youtube bin ich nicht vertreten.\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3108229345/230100569\nDieses Spiel war eine REINE Teamleistung, sieht man an den 50 unterstützungen, auch wenn Lee 18 Kills hat, gehen die Hälfte auf die Teamkollegen, und vor allem wir waren nur zu 4. ab Minute 20, lagen bis 5k Gold zurück. Aber jeder hat seinen Beitrag zum Sieg beigetragen. Ich war in der ersten viertelstunde der die wichtige Mitte im Griff hatte, Soraka und ich haben die Nahkämpfer von uns fern gehalten gehalten, Lee hat die ADC beseitigt. Wir haben alle clever gespielt. Auch im Replay waren nicht alle Laufwege perfekt, auch von mir, hat manchmal auch zu lange gedauert,aber generell war das von allen ein Megaspiel, mit diesen Leute würde ich sofort wieder spielen, ka welchen Rang sie haben, mir egal,  hat alles gepasst, Kommunikation, Playing, Abstimmung(vor allem wenn man mal schnell ne andere Line von Vasallen clearen musste). Vllt von der Spielqualität sah ich noch optimierungen, aber generell Fehlentscheidungen von uns konnte ich nicht sehen, zur passenden Zeit auch richtig den Drachen gekillt bei nur 4 Spielern.\n\nSo und das wievielte Spiel war das jetzt, wo man ein gutes Team hatte? Und das war sogar nur unranked, die meisten sind noch nicht mal Level 30 , spielen aber vom Teamplaying zehnfach besser als die Hirnis in der Bronze RL!\nWürde gern das Video zeigen, kann sich jeder selbst ein Bild machen","replies":[]},{"poster":"Eternal Torment","date":"2017-03-17T23:13:31.638+0000","up_votes":1,"down_votes":0,"body":"League of Legends ist nun halt ein teamspiel, und als solches wird deine Leistung als team bewertet. dass du Pech hast ist halt Pech, aber vertrau mir, nimm nach schlechten spielen ne kurze trink und verschnauf pause. Es kommt vor dass man verliert, zur hölle ich hab heute morgen mich im forum getiltet und es auf die schnelle bereut. wieso denkst du wohl? \"ja okay hatte ein schlechtes team\" ABER du bist ein teil des teams, ein teil einer kette. und wenn da ein Kettenglied absackt, verstärke es. wenn der support unzufrieden mit deiner Leistung ist, versuch halt es mit seiner Methodik, wer weiss, es könnte tatsächlich das game gewinnen. ich war auf einer massiven lose-streak als ich zuerst in silver 5 ankam, 1 spiel gewonnen, 4-6 hintereinander verloren. keinen interessierts meine positive kda, keinen interessiert die krassen D1 outplays die ich auf dem zed bringe. was zählt ist wie die anderen mit mir gearbeitet haben, UND WIE ICH MIT IHNEN GEARBEITET HABE. Du kannst noch so gut und pro sein, einer allein gewinnt das game nicht. Nicht einmal super-carrys wie vayne und gp können das spiel komplett solo gewinnen. daher nimm diesen aus eigenerfahrung geboosteten rat und versucht mit deinem team zu kommunizieren. Auch wenn manche Ideen halt dumm klingen, denke daran, dumme Sachen erwarten schlaue menschen nicht. du hast keine Ahnung wie oft ich ganze teamfights gewann nur weil ich eben die dinge getan habe von denen die meisten heut zu tage als \"noob Plays\" abstempeln, weil es ein rat eines mates war und ich halt auf meinen teammate zugehört habe.","replies":[{"poster":"Benfazus","date":"2017-03-18T00:06:19.339+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ScaRy Taiger Grr,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=000a,timestamp=2017-03-17T23:13:31.638+0000)\n>\n> League of Legends ist nun halt ein teamspiel, und als solches wird deine Leistung als team bewertet. dass du Pech hast ist halt Pech, aber vertrau mir, nimm nach schlechten spielen ne kurze trink und verschnauf pause. Es kommt vor dass man verliert, zur hölle ich hab heute morgen mich im forum getiltet und es auf die schnelle bereut. wieso denkst du wohl? &quot;ja okay hatte ein schlechtes team&quot; ABER du bist ein teil des teams, ein teil einer kette. und wenn da ein Kettenglied absackt, verstärke es. wenn der support unzufrieden mit deiner Leistung ist, versuch halt es mit seiner Methodik, wer weiss, es könnte tatsächlich das game gewinnen. ich war auf einer massiven lose-streak als ich zuerst in silver 5 ankam, 1 spiel gewonnen, 4-6 hintereinander verloren. keinen interessierts meine positive kda, keinen interessiert die krassen D1 outplays die ich auf dem zed bringe. was zählt ist wie die anderen mit mir gearbeitet haben, UND WIE ICH MIT IHNEN GEARBEITET HABE. Du kannst noch so gut und pro sein, einer allein gewinnt das game nicht. Nicht einmal super-carrys wie vayne und gp können das spiel komplett solo gewinnen. daher nimm diesen aus eigenerfahrung geboosteten rat und versucht mit deinem team zu kommunizieren. Auch wenn manche Ideen halt dumm klingen, denke daran, dumme Sachen erwarten schlaue menschen nicht. du hast keine Ahnung wie oft ich ganze teamfights gewann nur weil ich eben die dinge getan habe von denen die meisten heut zu tage als &quot;noob Plays&quot; abstempeln, weil es ein rat eines mates war und ich halt auf meinen teammate zugehört habe.\n\nIch kann den Ersteller verstehen. Ich muss etwas Schmunzeln, ja Teamspiel. In meinem letzten Spiel haben 2 gegnerische Helden das Spiel gewonnen, von 25 Kills haben die beiden 18 gemacht 18! Ich war in dem spiel Suppotter, ich war von 9 Kills an 6 beteiligt, und konnte nichts, absolut Null machen. Ich war bei den beiden Kills der jeweiligen generischen besten beteiligt. Und? bringt mir das was? Zudem hatte ich mal wieder Bugs, die ich seit Anbeginn hier hatte. Und sieht man das wo? Nein!\n\nDer Draven da hatte am Anfang null Werte, aber rasierte uns beiden unten mit einem schlag 350 Leben weg :D. Wir konnten den Turm sehr lange gut verteidigen, aber gegen die OP helden, hatten wir keine Chance, ka was da in der Programmierung immer schief läuft. Aber die Schadensberechnung ist ein anderes Thema.\nAber ich finde das Ligasystem unglücklich gelöst! Es sollte vllt so eine art \"Ehrenpunkte\" eingeführt werden, wo man selbst bei einer Niederlage gewinnt, für gutes Playing, das meint der Ersteller wohl.\n\nIch weiß ja, das es geht, sehe ich im unranked, hat man insgesamt tollere Matches als im Ranked, wo es spielerisch gesehen hochklassischer ist als im Ranked, das gibt mir zu bedenken!","replies":[{"poster":"Eternal Torment","date":"2017-03-18T00:14:14.068+0000","up_votes":1,"down_votes":0,"body":"Das ist eben genau die Art Einstellung die dich ruinieren wird. Du denkst dir jetzt \"ja kack teammates, kack Op picks bei Gegner, kann da nichts machen, ich verdiene privat annerkennung wenn ich gute Leistung bringe\" das wird nie geschehen. war nie existent und wird es nie sein. League ist nun halt mal ein Teamspiel, und wenn der draven euch halt rasiert hat, dann solltet ihr euch aufs counterplay fokusieren. Draven bei nem all-out zu kontern ist von allen ADC der einfachste. \n\nIch sehe hierbei halt wieder deinen UND deines Kameraden fehler. Ihr solltet nicht härter versuchen, sondern schlauer. Dich im forum darüber aufzuregen und ein (verzeih die grobe art) dummes referrendum zu verlangen wird dir nur das eigene fleisch schneiden. Starke picks gibt es, aber jeder champ ausnahmslos hat schwächen, und anstatt dich immer aufzuregen solltest du für nahe oder ferne Zukunft diese schwächen lernen. \n\nDieses Lernen zu verweigern macht dich zum Hauptschuldigen, weil du nämlich die chance hast aus den fehlsituationen zu lernen und es besser zu machen es aber bewusst verleugnest. Daher sag ich dir, schieb nicht schuld auf andere, in einem Organisiertem Teamspiel sind alle 5 gleich schuld. Die einen fürs verkacken, die anderen fürs niederreden und für das magere beitragen und helfen. so oder so gibt es keinen \"nur er\" \"nur ich\" etc.","replies":[{"poster":"Benfazus","date":"2017-03-18T08:50:52.156+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ScaRy Taiger Grr,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=000a00000000,timestamp=2017-03-18T00:14:14.068+0000)\n>\n> Das ist eben genau die Art Einstellung die dich ruinieren wird. Du denkst dir jetzt &quot;ja kack teammates, kack Op picks bei Gegner, kann da nichts machen, ich verdiene privat annerkennung wenn ich gute Leistung bringe&quot; das wird nie geschehen. war nie existent und wird es nie sein. League ist nun halt mal ein Teamspiel, und wenn der draven euch halt rasiert hat, dann solltet ihr euch aufs counterplay fokusieren. Draven bei nem all-out zu kontern ist von allen ADC der einfachste. \n> \n> Ich sehe hierbei halt wieder deinen UND deines Kameraden fehler. Ihr solltet nicht härter versuchen, sondern schlauer. Dich im forum darüber aufzuregen und ein (verzeih die grobe art) dummes referrendum zu verlangen wird dir nur das eigene fleisch schneiden. Starke picks gibt es, aber jeder champ ausnahmslos hat schwächen, und anstatt dich immer aufzuregen solltest du für nahe oder ferne Zukunft diese schwächen lernen. \n> \n> Dieses Lernen zu verweigern macht dich zum Hauptschuldigen, weil du nämlich die chance hast aus den fehlsituationen zu lernen und es besser zu machen es aber bewusst verleugnest. Daher sag ich dir, schieb nicht schuld auf andere, in einem Organisiertem Teamspiel sind alle 5 gleich schuld. Die einen fürs verkacken, die anderen fürs niederreden und für das magere beitragen und helfen. so oder so gibt es keinen &quot;nur er&quot; &quot;nur ich&quot; etc.\n\nAlso das ist aber auch eine sehr sehr naive Einstellung:\nGehen wir chronologisch vor:  Die Picks: \nIch war als erstes dran. Ich nahm speziell diesmal Lux weil  dieser universiell noch einsetzbar ist(Mideline-Support, sogar auch oben noch )\nDraven war der letzte Pick des Gegners. Ich habe gerechnet er geht Top. Es war nicht so, egal. Um etwas Gegendruck aufzubauen habe ich nicht das Golditem gepickt, sondern erst den komischen Ring da. Runen auf Magiedurchdringung. \nEs war im Grunde ganz gut gegen Draven direkt, jedoch Lulu hielt mich von ihm weg. Mein ADC war zu langsam um zu farmen, ich half ihm und musste etwas Gold dadurch mitnehmen, er regte sich auf, also gut beschloss ich defensiver zu sein, ja, die Vassallen waren dadurch immer bei unseren Turm und Draven blüte auf. Unserer Jungler versuchte uns zu helfen. War ganz okay, jedoch das nötige Glück fehlte uns auch , die beiden schafften es mit Mega Dusel sich zu retten. Beim 2. Versuch klappte es und wir konnten bzw ich den Draven killen, Lulu kam wieder davon..... war vllt Minuten 10-12 . Ich habe keinen Plan, aber Draven war dort schoin 2 Level besser, obwohl wir beide gleich viel auf der Lane waren, ich war ganze 2 mal in der Base nur gewesen!\nAb Minute 15 vllt war das Spiel durch, obwohl sie keine nennenswerte Stats hatten teilten sie Schaden ohne Ende aus, ich hatte ähnlich viel F-Stärke. Ha denkste ich machte irgendwie Schaden? Zudem haben wir einen Drachen gekillt und die Gegner gar keinen. Und das Spiel war nach 20 Minuten verloren.\nDas war eines der besseren Spiele die ich als TEAM hatte. Ich kann meinen TEamkollegen eigentlich nichts vorwerfen, sie sind nicht Blind in eine 1/3 Situation(als Bsp) gerannt oder ähnliches. Sie waren einfach an der Stärke ingesamt unterlegen.\nSie haben ihr bestes versucht, und anhand des goldes waren wir ja alle ungefähr gleich. Es war auch interessant zu sehen, dass sie ebenfalls ratlos waren wie die einen in 20 Minuten nieder machen konnten.\nSo das war mal ein kleiner Spielbericht. Ich stelle mir die Frage jetzt, wie ging das so schnell? Ja mehr Kills hatten sie, unglückliche EReignisse im Spiel kommen dazu, dazu wieder Helden die wieder Schaden austeilen können ohne jeglich Werte zu haben im Earlygame. 3x mal entkamen alle 5 Helden von ihnen mit 50 Leben aus unserer Base..... wieder Pech gehabt.... das zog sich das ganze spiel durch. Waren die besser? Meiner Meinung nach nicht, mehr Glück als können war das eigentlich nur. So wie in vielen Spielen, dann kommen noch Faktoren wie Ping und Rechenleistung des PCs hinzu. Normal denkste, du machst den Kill, ha am Ende biste tot weil du zu \"langsam\" warst, ja warum eigentlich, du hast 1 Sekunden eher geklickt!","replies":[{"poster":"Eternal Torment","date":"2017-03-18T15:16:49.325+0000","up_votes":1,"down_votes":0,"body":"also, ich will einige punkte klarstellen.\n1. ich hab dich nicht nach den Details des Ereignisses gefragt weil sie bloss meine aussage untermauern. Schuldschieberei in league gibt es nicht, du bist andauernd nur die fehler andere am ausspicken und verleugnest jegliches falschtuhen von deinerseite. Wie gesagt, schuldschieberei gibt es nicht. \n2. League ist ein organisiertes teamspiel, wo jeder spieler ein eigengehirn hat. Demendsprechend ist es eure pflicht als team euch zu verständigen und miteinander abzusprechen. Das gegnerteam hat es spürbar besser hinbekommen, während ihr euch nur auf das kritisieren konzentriert habt. In einem team gibt es keine alleinschuldigen, jeder fehler kommt von jeder seite. Wenn sich dein adc mispositioniert, ist es deine aufgabe als supporter ihn zu decken. Umgekehrt auch. Steckst du in der klemme, dann sollte dein adc die situation zu Gunsten verwenden und die Gegner abmurksen während sie dich beplänkeln.\n3. Pech und glück sind nun mal halt teile des spiels, und auch teil des lebens. da kannst du alles und jeden verfluchen bis an dein Lebensende, es wird sich nicht ändern. Es lief mies, dan lief es halt mies. Pech und glück halten nie ewig an, also kannst du die dinge positiv sehen. Wenn die Gegner in diesem spiel so viel glücksvorteil hatten, dann kann es im nächstem spiel gar nicht so schlecht für dich gehen. Hast du das schlimmste hinter dir, kann es immernoch schlechtes vor dir geben, aber nichts wird so schlecht sein wie das, was hinter dir ist. \n4. in punkt 3 erwähnt, positive Einstellung. In league kann dein emotionaler Standpunkt dein entscheidungsvermögen sehr stark beeinflussen, ich weiss das aus 2+ jahren eigenerfahrung. Tilt macht dich schlechter. Wenn du mies gelaunt bist, dann beruhige dich. Während des revive-countdown kannst dir auf die eile ein glass wasser holen, oder entschuldige dich beim team für ne minute und geh pissen, kein plan was du in den pausen machst. aber verhindere, dass du dich selbst aufregst. League ist nun halt mal ein sehr nervenstrapazierendes spiel, glaub mir ich leide ab und zu auch darunter XD aber lass dich davon nicht kleinkriegen. \n\nKurz gesagt, du hast eben als teamverloren, und je mehr ihr alle als team euch gegenseitig auskritisiert habt, haben die Gegner euren tilt zum Vorteil genutzt und letztendlich das spiel gewonnen. Das emotionale wesen in league hat sehr viel einfluss auf dein spielen als Person und auf euer gesamtauftreten als team. Ist der eine nur ein bisschen geflippt kann das das spielende bedeuten. umgekehrt auch, einmal tief durchatmen kann dir plötzlich das spiel gewinnen. Ich sags nun nochmal, ruhig und gelassen. Schiebe nicht die schuld auf andere, vorallem nicht wenn du keine eigenverantwortung annehmen kannst. In Teamarbeiten, egal ob in league oder auch im echten leben, ist jeder gleich schuld. League ist im vergleich noch ein sehr verzeihender platz für gefailtes teamplay, aber lass das nicht einfluss auf dich haben. Du kannst spiele gewinnen und gute wertungen kassieren, alles was es braucht ist ein ruhiges gemüt und gute Kommunikation. \nWenn du im soloQ nicht weiter kommst weil du egal aus welchem grund einfach nicht mit den teams klarkommst dann hol dir ein paar premades und organisiere dich noch bevor dem spiel selbst. Wie gesagt, league of legends ist ein organisiertes teamspiel. es gibt kein \"ich kann das nicht\" es gibt nur \"ich kann das NOCH nicht\"","replies":[{"poster":"Benfazus","date":"2017-03-18T17:09:40.919+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ScaRy Taiger Grr,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=000a0000000000000000,timestamp=2017-03-18T15:16:49.325+0000)\n>\n> also, ich will einige punkte klarstellen.\n> 1. ich hab dich nicht nach den Details des Ereignisses gefragt weil sie bloss meine aussage untermauern. Schuldschieberei in league gibt es nicht, du bist andauernd nur die fehler andere am ausspicken und verleugnest jegliches falschtuhen von deinerseite. Wie gesagt, schuldschieberei gibt es nicht. \n> 2. League ist ein organisiertes teamspiel, wo jeder spieler ein eigengehirn hat. Demendsprechend ist es eure pflicht als team euch zu verständigen und miteinander abzusprechen. Das gegnerteam hat es spürbar besser hinbekommen, während ihr euch nur auf das kritisieren konzentriert habt. In einem team gibt es keine alleinschuldigen, jeder fehler kommt von jeder seite. Wenn sich dein adc mispositioniert, ist es deine aufgabe als supporter ihn zu decken. Umgekehrt auch. Steckst du in der klemme, dann sollte dein adc die situation zu Gunsten verwenden und die Gegner abmurksen während sie dich beplänkeln.\n> 3. Pech und glück sind nun mal halt teile des spiels, und auch teil des lebens. da kannst du alles und jeden verfluchen bis an dein Lebensende, es wird sich nicht ändern. Es lief mies, dan lief es halt mies. Pech und glück halten nie ewig an, also kannst du die dinge positiv sehen. Wenn die Gegner in diesem spiel so viel glücksvorteil hatten, dann kann es im nächstem spiel gar nicht so schlecht für dich gehen. Hast du das schlimmste hinter dir, kann es immernoch schlechtes vor dir geben, aber nichts wird so schlecht sein wie das, was hinter dir ist. \n> 4. in punkt 3 erwähnt, positive Einstellung. In league kann dein emotionaler Standpunkt dein entscheidungsvermögen sehr stark beeinflussen, ich weiss das aus 2+ jahren eigenerfahrung. Tilt macht dich schlechter. Wenn du mies gelaunt bist, dann beruhige dich. Während des revive-countdown kannst dir auf die eile ein glass wasser holen, oder entschuldige dich beim team für ne minute und geh pissen, kein plan was du in den pausen machst. aber verhindere, dass du dich selbst aufregst. League ist nun halt mal ein sehr nervenstrapazierendes spiel, glaub mir ich leide ab und zu auch darunter XD aber lass dich davon nicht kleinkriegen. \n> \n> Kurz gesagt, du hast eben als teamverloren, und je mehr ihr alle als team euch gegenseitig auskritisiert habt, haben die Gegner euren tilt zum Vorteil genutzt und letztendlich das spiel gewonnen. Das emotionale wesen in league hat sehr viel einfluss auf dein spielen als Person und auf euer gesamtauftreten als team. Ist der eine nur ein bisschen geflippt kann das das spielende bedeuten. umgekehrt auch, einmal tief durchatmen kann dir plötzlich das spiel gewinnen. Ich sags nun nochmal, ruhig und gelassen. Schiebe nicht die schuld auf andere, vorallem nicht wenn du keine eigenverantwortung annehmen kannst. In Teamarbeiten, egal ob in league oder auch im echten leben, ist jeder gleich schuld. League ist im vergleich noch ein sehr verzeihender platz für gefailtes teamplay, aber lass das nicht einfluss auf dich haben. Du kannst spiele gewinnen und gute wertungen kassieren, alles was es braucht ist ein ruhiges gemüt und gute Kommunikation. \n> Wenn du im soloQ nicht weiter kommst weil du egal aus welchem grund einfach nicht mit den teams klarkommst dann hol dir ein paar premades und organisiere dich noch bevor dem spiel selbst. Wie gesagt, league of legends ist ein organisiertes teamspiel. es gibt kein &quot;ich kann das nicht&quot; es gibt nur &quot;ich kann das NOCH nicht&quot;\n\nFinde mal ein gutes Team, das spiel ist auf den unteren Rängen nur von Eigenprödlern gezeichnet, sind 2 von denen gut, gewinnen sie alleine die Spiele. Toll, hab ich generelll Bock drauf! Ich geb schon mein bestes, und ich opfere mich gerne fürs TEam, das habe ich schon oft gemacht und einen 3/4/5-1 kill damit erreicht. Aber wie gesagt auf den unteren Rängen eher mangelware! Im unranked spielt man auch mit besseren, da merke ich den Unterschied, da macht das spielen auch Spaß, und man spielt generell besser, aber ranked bronze 4 ist so sinnlos.... sorry nicht abwertend soll das jetzt gemeint sein, aber als Supporter ist es eine reine Qual, und ja, andere Positionen kann ich außer top vllt mit cho gath nicht spielen anhand der schlechteren heros!","replies":[{"poster":"Eternal Torment","date":"2017-03-18T17:18:11.484+0000","up_votes":1,"down_votes":0,"body":"also ich persönlich hab zwar schon schlechte Momente aber auch gute. Ich habs immerhin geschaft von bronze auf silber hochzugehen und ich spiele in meinen 2+ jahren das erste mal seriös ranked, also ich denke mal aus Erfahrung dass es so geht. Jede Liga hat seine guten und schlechten spieler, bronze bis hin zu meister. Sieh dir mal die YouTube masters an, faker, bjergsen, etc. auch die machen mal anfängerfehler. Liga hat da wirklich nichts damit zu tun, du hattest einfach nur Pech, und dieses Pech wird auch zuende gehen. Ich spiele Attentäter champs, die Definition von nicht-teamkompetitiven picks, und habs von bronze auf silber geschaft. und wenn ich das kann, dann kannst du das auch. es braucht halt Durchhaltevermögen.","replies":[]}]}]}]}]}]}]},{"poster":"Kecko","date":"2017-03-17T16:27:23.676+0000","up_votes":1,"down_votes":1,"body":"Natürlich ist es ein Team game aber wenn 2 Leute aus deinem \"Team\" afk gehen kann man doch kein demote bekommen das doch einfach nur nen schlechter scherz...","replies":[{"poster":"legofreak1","date":"2017-03-17T16:35:09.597+0000","up_votes":1,"down_votes":0,"body":"Dieselben Spieler sind auch im gegnerischen Team, das bekommst du nur nicht so deutlich mit. Wenn du selber kein negativer Spieler bist, dann hat der Gegner 5 und du nur 4 potentielle negative Spieler im Team, sobald du dich positiv verhältst, ist die Stimmung in deinem Team tendenziell besser als bei den Gegnern.\n\nEdit: Wenn du auf bestimmte Beiträge antworten möchtest, dann verwende bitte die \"Antworten\" Funktion des Forums. Das verbessert die Übersicht und sendet deinem Vorposter eine Benachrichtigung, dass diesem geantwortet wurde.","replies":[{"poster":"Kecko","date":"2017-03-17T16:59:10.530+0000","up_votes":1,"down_votes":1,"body":"Das kommt ja auch noch dazu dann sieht man nur Beleidigungen im Chat vom eigenen Team und dann schreibt man was positives und entweder kommt keine Reaktion oder die schreiben das man die Fre**e halten soll .... Es müsste einfach eine härtere Strafe für solche Spieler eingeführt werden. Vorallem wenn man zu beginn des Gmes 0/8 hinten liegt , heißt es ja nicht das das Game verloren ist, aber 80% der Spieler sehen das leider so ...","replies":[{"poster":"legofreak1","date":"2017-03-17T17:42:30.707+0000","up_votes":1,"down_votes":0,"body":"Es ist natürlich blöde, dass man an dieser Stelle nichts anderes machen kann, als einen kurzen Versuch zu starten, die Situation zu entschärfen und die Spieler im Notfall zu muten, aber über viele Spiele hinweg gleicht sich das eben aus.\nHärtere Strafen werden hierbei übrigens nicht helfen. Der meiste Flame entsteht, weil Spieler einen schlechten Tag haben aber von sich aus nicht toxisch sind, sondern sich von anderen toxischen Spielern oder Spielern mit einem schlechten Tag anstecken lassen oder tilten. Führt man hier zu harte Strafen ein, führt das eher zu Trotzreaktionen und man erreicht genau das Gegenteil. Tatsächlich ist es sogar so, dass 95% der Spieler, die jemals eine CR für wiederholtes negatives Verhalten erhalten, später niemals eine weitere Strafe erhalten, obwohl diese einige Spiele danach unter Beobachtung stehen und leichter weitere Strafen nach der ersten erhalten.\nIch habe übrigens gerade deine Matchhistory durchgesehen, in deinen letzten 10 Siegen hast du insgesamt 4 afkler im Gegnerteam, in deinen letzten 10 Niederlagen hattest du Leaver in deinem Team nur in der letzten Niederlage.","replies":[]}]}]}]},{"poster":"Coopa123","date":"2017-03-17T16:33:42.755+0000","up_votes":1,"down_votes":0,"body":"Da fragt man sich, wie viele Spiele du gewonnen hast, wo das Gegner Team toxic war und aufgegeben hat ...","replies":[]},{"poster":"Alekra","date":"2017-03-17T16:23:45.817+0000","up_votes":1,"down_votes":0,"body":"Nach leistung? Joa nice ich geh jetzt Zed Supp spielen #freeelo kack auf mein team","replies":[]},{"poster":"Patter1991","date":"2017-03-17T16:21:39.669+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kecko,realm=EUW,application-id=Wj1wcocU,discussion-id=uPecpeBi,comment-id=,timestamp=2017-03-17T16:19:24.919+0000)\n>\n> Hallo\n>  ich find es langsam einfach nur lachhaft....\n> Man spielt sein Game, gewinnt seine Lane, aber das Team macht einfach nichts\n\nOk, warum soll das Team was aus DEINEM Lanesieg machen? Warum solltest nicht DU was daraus machen?","replies":[]},{"poster":"Webturnier","date":"2017-03-17T17:41:19.540+0000","up_votes":1,"down_votes":5,"body":"Guten Tag, ich habe für Ja gestimmt, weil ich genau deiner Meinung bin. Es kann ja nicht sein dass man nur wegen schlechtspielenden Teammates Minuspunkte bekommt.","replies":[]}]}