{"poster":"GragasTheCatfish","date":"2016-02-14T12:07:19.751+0000","title":"proposta nuova modalita per accelerare le partite","subforum":"Creazioni della community","up_votes":1,"down_votes":10,"body":"la gente penso che si scazza a fare partite lunghe con code lunghe 8mi scazzo io) quindi propongo una modalit&agrave; che acceleri il game con una massima durata di 20 minuti. detto ci&ograve; andremo  a punti. \r\n1Se vi siete accorti il problema di giocare a livelli bassi e trovare un team con un support un jungler un midlaner un toplane un adc/apc\r\nquindi ognuno sceglie il champion che vuole e si combinano 5 persona a caso.  qua tempi accelerati...\r\n2 tempi di arrivare in lane: allora quando si arriva al venti e quando si starta si ha un passo accelerato e nel resto del game no. deto ci&ograve; propongo che in questa modalit&agrave; se si aspetta 5 secondi fermi senza subire danni o cose del genere si ottera un aumento della velocita riducendo quindi i tempi della partita.\r\n3 richiamo base e una cosa necessaria ma bisogna aspettare un pezzetto prima di essere full con mana e tutto quindi la mia proposta e che quando si torna in base, tramite richiamo o morte, si diventa subito full vita e mana, e altra cosa di ridurre drasticamente i tempi di rinascita dopo la morte.\r\n4 negozio: prezzi diminuiti aumento di gold al secondo pi&ugrave; rapido e pi&ugrave; soldi dai minion\r\n5 torri e Minion: vita diminuita \r\n6 Vittoria: dopo massimo venti minuti di game, se non si ha distrutto il nexus, vince il team con pi&ugrave; kill","replies":[{"poster":"A Yordle ln Heat","date":"2016-02-14T12:19:32.622+0000","up_votes":3,"down_votes":0,"body":"URF 2.0 con più malattia. Carino.\nComunque stai andando completamente dalla parte sbagliata; la gente vuole partite che durino di più, non che durino di meno. Un casino di gente si lamenta che ora che siamo in S6 la durata delle partite si è abbassata mediamente di quasi 15 minuti.","replies":[{"poster":"GragasTheCatfish","date":"2016-02-14T13:01:02.353+0000","up_votes":1,"down_votes":1,"body":"a me e sempre parsa una cosa positiva e che durino di meno","replies":[{"poster":"A Yordle ln Heat","date":"2016-02-14T13:14:01.425+0000","up_votes":2,"down_votes":0,"body":"Sei uno di pochi.","replies":[]},{"poster":"Nabbomaster","date":"2016-02-14T15:54:12.149+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=word globe,realm=EUW,application-id=P9Wi6QlB,discussion-id=VaLvOENP,comment-id=00010000,timestamp=2016-02-14T13:01:02.353+0000)\n>\n> a me e sempre parsa una cosa positiva e che durino di meno\n\nfatti un aram o una 3vs3","replies":[]}]}]},{"poster":"BrattishSolid6","date":"2016-02-14T14:39:32.816+0000","up_votes":2,"down_votes":0,"body":"Quella che stai descrivendo è una partita URF giocata in ARAM. Te ne rendi conto vero?\nPessima combinazione di statistiche a mio parere. \nSono contrario.","replies":[]},{"poster":"fedy99","date":"2016-02-14T12:11:35.459+0000","up_votes":2,"down_votes":0,"body":"aumentiamo pure i danni dei singoli champ  e mettiamo che si possa avere il 100% dicdr","replies":[{"poster":"GragasTheCatfish","date":"2016-02-14T12:17:05.343+0000","up_votes":1,"down_votes":1,"body":"pensavo che cosi si troverebbero sbilanciati i champion tank e trovare un buon compromesso di ap ad sarebbe stato difficile e il cdr ci sta","replies":[]}]}]}