{"poster":"ßL4CKH0L3","date":"2015-08-16T20:58:49.882+0000","title":"Ban Totalmente Ingiusto!!!","subforum":"Discussioni generali","up_votes":1,"down_votes":6,"body":"Personalmente sono pi&ugrave; che stufo del sistema reporting ecc che vige qui su LoL.\r\nSono due volte di fila che perdo ranked per gente capace solo di feedare a bestia e se scrivo &quot;report pincopallino&quot;,\r\nvengo reportato a mia volta..oggi, come ieri, sono stato reportato per &quot;molestia : abuso verbale&quot; dopo aver scritto &quot;pls report pincopallino for unexperienced player&quot; e fino a qui nulla i strano...vado nella schermata per loggare e mi ritrovo &quot;account sospeso fino al 30/08/15&quot;.\r\nOra io non so se veramente si possa fare qualcosa in questi casi, dove ingiustamente si viene reportati senza aver insultato nessuno o essere andati afk o roba simile...ma credo che difficilmente riprender&ograve; a giocare dopo questa mazzata...nonostante abbia speso dei soldi per pagine di rune e cavolate varie...\r\n\r\nRIOT FIX UR BRAIN","replies":[{"poster":"Nabbomaster","date":"2015-08-16T21:09:21.042+0000","up_votes":8,"down_votes":0,"body":"fanno bene a reportarti, non vedo come i tuoi report tizio o report caio possano essere di qualche aiuto al tuo team se non per far incazzara la gente\nsencondo il tuo ragionamente poi il primo ad essere bannato dovresti essere tu visto che vedo che con sion a nasus feedi","replies":[]},{"poster":"Italian Monkey","date":"2015-08-16T21:06:52.681+0000","up_votes":7,"down_votes":0,"body":"Forse ti suonerà nuovo ma scrivere \"report tizio caio\" è flaming ed è reportabile. Secondo, per essere arrivato al ban, sarai stato parecchio tossico in molti game","replies":[]},{"poster":"SKFF1R SubZero","date":"2015-08-16T21:34:46.486+0000","up_votes":5,"down_votes":0,"body":"Ennesimo post in cui ci si lamenta del ban ingiusto che tanto ingiusto non è.\nCome fate a dire che non funziona il Tribunale quando banna tantissimi di questi soggetti che, si spera, imparino la lezione?\nGrazie Tribunale :)","replies":[]},{"poster":"ßL4CKH0L3","date":"2015-08-16T21:12:40.079+0000","up_votes":1,"down_votes":5,"body":"1 - ho scritto quel che ho scritto a fine partita e non durante il game.\n2 - i soggetti in questione non solo feedavano a bestia ma non ascoltavano nessun ping, nessun compagno del team e non hanno mai fatto un SS.\n3 - con un tank che magari si sacrifica a prendere le botte sperando che l' adc e l' apc facciano danni mentre incassi i colpi il discorso è totalmente diverso che con un midlaner che non può fare 0-8 nei primi 20 minuti..\n4 - il report per giocatore inesperto esiste appositamente e ha come scopo quello di fare giocare i segnalati in questione con giocatori di livello più basso dell' attuale così da non essere \"fuor d' acqua\"","replies":[{"poster":"Ringiel","date":"2015-08-16T21:29:30.412+0000","up_votes":5,"down_votes":0,"body":">2 - i soggetti in questione non solo feedavano a bestia ma non ascoltavano nessun ping, nessun compagno del team e non hanno mai fatto un SS.\n3 - con un tank che magari si sacrifica a prendere le botte sperando che l' adc e l' apc facciano danni mentre incassi i colpi il discorso è totalmente diverso che con un midlaner che non può fare 0-8 nei primi 20 minuti..\n\nhai presente che giochi in bronzo? o pensi di essere in master \n\n>4 - il report per giocatore inesperto esiste appositamente e ha come scopo quello di fare giocare i segnalati in questione con giocatori di livello più basso dell' attuale così da non essere \"fuor d' acqua\"\n\nno,influenza solo le normal","replies":[{"poster":"ßL4CKH0L3","date":"2015-08-17T00:34:06.667+0000","up_votes":1,"down_votes":3,"body":"certo ma infatti cerco di aiutare come posso e stare tranquillo...\nma questi che regalano 8 kill senza fare un cavolo manco farmare bene se ne fregano perchè se muori 8 volte di fila\nsignifica che non te ne frega niente di feedare e che stai solo \"sfanculando\"..invece di ascoltare giocare difensivo e aspettare una gank..\nsono sempre stato contro il flaming ma a forza di perdere partite su partite per il lastpicker che non vuole fare il sup e viene mid con te (in ranked) o gli afk in promo addirittura perdi la pazienza..\nci sono persone che ti ridono in faccia mentre fanno ste cose dicendoti \"fuck your promo\"...\ncomunque vabbè come al solito sto gioco penalizza gente che ci perde tempo seriamente e si impegna invece di loggare appositamente per far innervosire gli altri..\nl' unico rimpianto è che ci ho speso soldi per le pagine di rune..perchè a sapere prima come funzionano queste cose me ne sarei guardato bene!..\nc' è gente che ti reporta perchè gli \"steali\" una kill qui...bella merda che per una cagata del genere magari la prossima volta potrei trovarmi la sospensione permanente..\nnon potrò mai scordare una ranked dove sono andato sup, ho visto che il mio adc andava troppo yolo pigliando troppi AA e gli pingavo e parlavo per farlo giocare più calmo..mi disse : \"speak or ping again and i go afk and report u\"\n\nil sistema di report di lol non funziona perchè dovrebbe essere mirato a bannare quelle persone..non i giocatori seri come me.","replies":[{"poster":"73668109_DEL","date":"2015-08-17T04:37:10.513+0000","up_votes":3,"down_votes":0,"body":"Secondo te il sistema dovrebbe bannare i giocatori scarsi che giocano nella lega piu' scarsa o i giocatori tossici che sanno solo insultare i propri compagni ?","replies":[]},{"poster":"Whommy","date":"2015-08-17T08:44:54.167+0000","up_votes":2,"down_votes":0,"body":"il problema di base è che passate più tempo a scrivere in chat che a farmare\n\nentri in partita? subito muta gli avversari e al primo accenno di flame muta anche il tuo team.\nusa i ping non spammarli 1-2 volte per segnalare bastano.\n\nè inutile dire al team avversario di reportare qualcuno, se deve ricevere un report lo riceverà anche da loro.\nnon è solo la quantità che genera la punizione ma la qualità del report.\n\nappuntati che abuso verbale non è propriamente flame, ma lo devi intendere come abuso della chat stessa.\nse siete ancora a scuola sfogate la vostra vena scrittoria nelle ore di italiano non sulla chat di  lol.","replies":[]},{"poster":"Menfrix","date":"2015-08-17T05:59:02.481+0000","up_votes":2,"down_votes":0,"body":"Lo sai vero che lasciare il supp. Come ultimo Pick è una super bronzata? \nL'ultimo Pick a ragion di logica dev'essere il mid ond evitare che venga counterpickato...\n\nChe il tank possa morire qualche volta nella speranza che il resto del team uccida qualcuno è legittimo, ma oltre alla seconda morte per nulla, se continui, allora sei tu che sbagli.\n\nCome ti han già detto evita di scrivere report qua o report la, non è in alcun modo costruttivo.","replies":[]}]}]}]}]}