{"poster":"lkeras","date":"2017-02-04T20:27:34.811+0000","title":"Grundlagen","subforum":"Level Up: Guides & Tipps","up_votes":7,"down_votes":2,"body":"Hi Leute!\n\nVorweg hier das ganze angenehm leserlich im PDF-Format: [How to Legue of Legends.pdf](https://www.dropbox.com/s/cck1xqgzkz34ok0/How%20to%20Legue%20of%20Legends.pdf?dl=0))\n\nBei der heutigen nahzu schon Zwangsverdummung durch Medien und Spiele mit sinkendem Anspruch auf mechanische Leitung bei immer besser werdender Grafik gibt es Leute die diese auf sich wirken lassen und andere die sich ihren Intelekt beibehalten. Was Legue of Legends angeht bin ich wohl einer der ersteren. Zum Glück ist unser Gehirn lernfähig und kann durch Eingewöhnung, Training und Gedult unsere kognitiven Fähigkeiten steigern. Was das mit LOL zu tun hat? Die Population des Elosystems in LOL ist mit einer Pyramide vergleichbar wobei das Fundament die schlechteren Spieler kennzeichnen und die Spitze wenige gute. Viele im niederen Bereich halten LOL für ein unkomplexes und einfaches Spiel verlgleichbar mit vielen Ego-Shooter-Spielern, die statt strategisch vorzugehen, einfach drauf zu rennen und den Ersten den sie sehen umballern. Dem ist zum Glück nicht so!\n\nKnowledge, Machanics und Decisions. Die 3 Bereiche sind meines Erachtens nach fundamental für Legue und wenn man in der Lage ist alle zu meistern erreicht man das Gefühl wie bei einer Schachpartie statt sinnloser Aktionen bei denen keiner weis wo sie genau hinführen. Zu jeder der Einzelnen Kategorie gibt es viele Punkte die man lernen, trainieren und sich angewöhnen muss um sein Können in diesem Spiel zu steigern.\n\n**Knowledge**\n\n\n_Vor dem Spie_l\n\n- Runen\nSie sorgen für ein angenehmeres und besseres Earlygame. Hier sind 3 Standartrunenseiten für AD-, AP- und ADC-Champions. Man sollte diese immer den eigenen Bedürfnissen anpassen, jedoch sollte dies auch Sinn ergeben und zum Champion passen.\n\nStandart AD\nRot:         9 * 1,60 Tödlichkeitsfaktor / Lethality\nGelb:       9 * 1,00 Rüstung / Armor\nBlau:       9 * 1,34 Magieresistenz / Magicresistance\nLila:         3 * 2,25 Angiffsschaden / Attackdamage\n\nStandart AP\nRot:         9 * 0,87 Magiedurchdringung / Magicpenetration\nGelb:       9 * 1,00 Rüstung / Armor\nBlau:       9 * 1,34 Magieresistenz / Magicresistance\nLila:         3 * 4,95 Fähigkeitsstärke / Abilitypower\n\nStandart ADC\nRot:         9 * 0,95 Angriffsschaden / Attackdamage\nGelb:       9 * 1,00 Rüstung / Armor\nBlau:       9 * 1,34 Magieresistenz / Magicresistance\nLila:         3 * 4,5% Angriffsgeschwinigkeit / Attackspeed\n\n\n- Meisterschaften\nBei Unsicherheit immer defensivere Varianten nehmen. Am besten direkt in der Pick&amp;Bann-Phase auf das Gegnerteam angepasst erstellen.\n\n\n- Pick und Bann Phase\n\n\n1. Rollen\n\nAssassinen\n\nMerkmale: Sie haben hohen Schaden und hohe Mobilität, sind dafür aber sehr weiche Ziele.\n\nAufgabe: Das Ziel mit dem potentiell höchstem Schaden so schnell wie möglich erledigen oder am Ende eines Kampfes wenn viele CD´s benutzt worden sind aufzuräumen. Da sie hervorragend im 1vs1 sind eignen sich auch einige sehr gut zum Splitpushen.\n\nSchwäche: Assassinen haben einen initiativen Burst den Tanks/Brucer überleben. Da diese auch meistens CC-Fähigkeiten haben, können sie diese Handlungsunfähigmachen wodurch sie dann schnell in große Gefahr geraten.\n\nPosition: Am effektivsten wenn sie aus dem Fog of War in einen laufendem kampf einschreiten.\n\nKämpfer\n\nMerkmale: Sie sind Offtanks, welche 1 bis 3 Aggressive Gegenständer bauen. Dadurch haben sie eine solide Mischung zwischen Tankyness und Schaden. Oft haben Kämpfer weniger CC, gleichen dies jedoch mit ihrem Schaden aus.\n\nAufgabe: Gegnerische Carry´s aus dem Kampf zu zonen, sie zu beschäftigen oder gar zu erledigen.\n\nSchwäche: Guter Peel für die Carrys und ordentliche Teamkoordination.\n\nPosition: Bildet alleine oder mit einem anderen (Off-)Tank die Frontline.\n\nMagier\n\nMerkmale: Magischer Schaden des Teams. Oft auch etwas CC und guten Waveclear. Situativer Schaden wegen CD´s. \n\nAufgabe: Möglichst viel Schaden am gegnerischem Team austeilen. Nicht sterben. (Dem ADC beim erledigen des Tanks helfen)\n\nSchwäche: Tanks und Brucer können sie Zonen und lange beschäftigen. Auch sind sie in der Lage, wie auch Assassinen sie zu erledigen.\n\nPosition: Mit dem ADC und optimalerweiße einem \"Peel-\"Supporter in der Backline.\n\t\t\t\t\nSchütze\n\nMerkmale: Der hauptsächliche kontinuierliche physische Schaden im Team. scalieren ebensfalls oft gut ins mid/lategame da ihr schaden potentiell steigt und sie auch so gut türme einreisen können. sollten in der backline stehen um einkommende gefahren mit hilfe von peel des supprters bekämpfen zu können.\n\nAufgabe: Die gegnerische Tankfrontline zu erledigen und danach möglichst viel Schaden am gegnerischem Team austeilen. Nicht sterben. Türme belagern.\n\nSchwäche: Tanks und Brucer können sie Zonen und lange beschäftigen. Auch sind sie in der Lage, wie auch Assassinen sie zu erledigen.\n\nPosition: Mit dem APC und optimalerweiße einem \"Peel-\"Supporter in der Backline.\n\nUnterstützer\n\nMerkmale: Es gibt Tank-/Heil-/Schadenssupporter. Oft geringere Goldresourcen als alle anderen im Team. Holen sich oft Utility-Items zum Unterstützen ihrer Mitglieder.\n\nAufgabe: Peel für die eigenen Carrys.\n\nSchwäche: Der Tod des eigenen Teams.\n\nPosition: Oft situativ bedingt jedoch optimaler weiße bei den Carrys in der Backline.\n\nTank\n\nMerkmale: Ihr Schaden skaliert oft mit defensiven Items. Haben oft viel CC und gute Basiswerte.\n\nAufgabe: Schaden für die Carrys abfangen. In das gegnerische Team diven und so viele deren Resourcen aufbrauchen wie möglich. Im Optimalfall die Gegnerischen Carrys zonen, beschäftigen oder gar töten.\n\nSchwäche: Durch den koninuierlichen Schaden sind ADCs mit die besten um Tanks zu beseitigen.\n\nPosition: Bildet alleine oder mit einem anderen (Off-)Tank die Frontline.\n\n\n#########################################\n~Tank/Brucer > Assassine > AP/AD-Carry > Tank/Brucer~\n#########################################\n\n2. Kompositionen\n\nWichtige elemente eines Guten Teams sind:\n\n##############################\nWaveclear, Splitpush, Engage/Disengage\n##############################\n\nFür den Waveclear sind oft Mages dank ihrer AOE-Spells verantwortlich.\n\nEinige Brucer und Assassinen eignen sich sehr für den Splitpush da sie sehr gute Duellanten und mindestens 2 Leute vom gegnerischem Team verlangen. Dadurch erreichen sie für den Rest des Teams eine Überzahlsituation aus und könnten eventuell selber mit einem Teleport folgen.\n\nDer Engage ist meistens die Aufgabe der Tanks/Brucer da diese lange genug im gegnerischem Team überleben bis der follo up des eigenem teams kommt.\n\nFür einen Disengage sind einige Supporter gut ausgerüstet.\n\n\nSplitkomposition (1-4-0/1-3-1)\nEin (oder 2) Assassine/Brucer übt druck auf eine (oder beide) der Sidelanes aus während der Rest des Teams in der mitte Druck aufbaut. Hatt der Splitpusher Teleport zur Verfügung, so ist er schenll verfügbar für einen Kampf. Ist dies nicht der Fall disengaged das eigene Team sobald ein Kampf droht.\n\nEngagekomposition\nBesteht aus einem engagestarkem Tank und einem Team mit genügend Follow-Up um das gegnerische Team in einer möglichen Überzahlsituation zu überaschen. Oft sind solche Teams schadenorientierter aufgebaut.\n\t\nFlankkomposition\nHier gruppieren sich 4 der eigenen Teammitglieder vor dem gegnerischem Team und der flankierstarke Champion bleibt versteckt um in einer günstigen Situation von der Seite oder von Hinten in die Backline zu gelangen und dort die Carrys zu bescshäftigen oder gar rauszunehmen.\n\nPokekomposition\nEine Komposition die auf Spells mit hoher Reichweite das gegnerische Team aus sicherer Entfernung beschießt und somit versucht die Gegner zum Backport zu zwingen um Objekte zu forcieren.\n\n\n#########################################################################\nEngagekomposition > Splitkomposition > Flankomposition > Pokekomposition > Engagekomposition\n#########################################################################\n\nAnmerkung: Flank und Poke sehe ich persöhnlich als Zusatz zu einer Komposition\t\n\n3. Beschwörerzauber\n\nGeist: Erhöht für 10s das Lauftempo für 28 bis 45%. 180s CD\nGuter 2. Defensiver Spell mit Flash.\n\nHeilen: Heilt um 90 bis 345 HP und erhöft das Lauftempo für 1s um 30%. 240s CD\nAls ADC Standart da man den Supporter damit auch retten kann.\n\nBarriere: Gibt einen Schild von 115 bis 455 für 2 s. 180s CD\nAuf Longrange Midlanern mit die schlauste Wahl (gut gegen Assassins im Early).\n\nErschöpfen: LT &amp; AS des Ziels für 2s - 30%. A &amp; MR - 10 &amp; Schaden - 40%. 210s CD\nGuter Counterspell gegen viele Assassins und ADCs.\n\nLäuterung: Entfernt CC sofort und nachfolgende cc wird um 65% verringert. 210s CD\nGute Wahl für Midlaner bei viel gefährlichem CC im Gegnerteam. (Ashe, Cassio,...)\n\nTeleportation: Teleportiert nach 4,5s zu einem Turm, Versallen oder Ward. 300s CD\nOft auf Toplane genutzt um deren Mappresure zu erhöhen.\n\nBlitz: Teleportiert dich ein kurzes Stück richtung Mauszeiger. 300s CD\nWichtigster Spell in Legue of Legends. Lasst euch nicht blenden!\n\nEntzünden: Verursacht über 5s 70 bis 410 absoluten Schaden + Sicht auf Ziel. 210s CD\nWichtig falls man early Killpresure hat um zu snowballen.\n\nZerschmettern: 390-1000 Schaden an Monstern oder Versallen. 75s  CD\nUnerlässlig im Jungle da man mit Smite mehr EP von den Camps bekommt. Auch wichtig um Dragon, Harold und Nashor zu securen.\n\n##########################################################################################################\nBlitz in 95% aller Fälle mitnehmen!!! \nTop: Teleport | Jungle: Zerschmettern | Mitte: Barriere, Entzünden, Erschöpfen, Läuterung, Teleport | ADC: Heilen | Support: Erschöpfen, Entzünden\n##########################################################################################################\n\n_Ingame-Phasen:_\n\nDie Phasen des Spiels sind nicht von einer gewissen Minutenzahl abhängig sondern von der Komposition und den Powerspikes jedes einzelnen Champions. Die wird selbstverständlich beschleunigt indem man besser farmt! Hat eine Vayne zb. miserablen farm (zb. 120 bei minute 30) so erreicht sie ihr nichtmal ihr Lategame bevor das Spiel endet.\nEs gibt jedoch gewisse Richtlinien die besagen das die Phasen im 10 minuten Tackt wechseln also 0 - 10 Early / 10 - 20 Mid / 20 - 30 Late.\n\n\nEarlygame (Laningphase)\n\n\nIn der Laningphase geht es hauptsächlich ums Lasthitten! Jedoch muss man darauf anchten gegen was man spielt. Einige Champions sind im Earlygame sehr stark (Assassins zb.) und fangen nach einem Kill das snowballen an.\n\t\t\nCooldowns\nMan muss nicht alle auswendig wissen, sollte jedoch ein Gefühl dafür haben. (Meine Empfehlung: spielt auch mal ARAM). Da die meisten Spells in der Laningphase ähnliche CD´s haben könnt ihr direkt nachdem euer Gegner einen Spell benutzen der eine ähnliche Abklingzeit hat. Somit entwickelt ihr ein Gefühl für die CDs (wasted nicht zu viel Mana!).\n\nPowerspikes\nGrundsätzliche wollt ihr immer die erste Wave pushen! Somit erreicht ihr euren lvl 2 Powerspike früher als euer Gegner, seid jedoch vorsichtig denn bei einigen kommt da klare Killpresure auf. Achtet auch auf Items und Traded zb nicht einen Corki mit Trinity ohne jegliche Resis.\n\nScalings/Basewerte\nSeit euch im Klaren über die Rolle eures Gegners. Spielt Ihr gegen einen Assassin? Powerspike verschoben auch wenn ihr ahead seid -> defensiv bauen!. Die Rolle eines Assassins in der Lane ist es euch zu snowballen und den Lead auf andere Lanes zu übertragen. Seid ihr behind? Dann baut Defensiv! Euer ziel ist es ersmal den schaden des Gegners and euch zu reduzieren um Lasthitten zu können ohne die Gefahr für ein CS zu sterben. Seid ihr ahead und dass gegen keinen Lanebulli? Dann könnt ihr ruhig Schaden bauen und mehr Presure auf ihn aufzubauen.\n\t\n\t\nMidgame\n\n\nSpätestens im Midgame werden die ersten Drachen, der Herold oder gar die ersten Türme fallen. Hier geht es hauptsächlich darum Objectves zu contesten.\n\nDrachen\nEs gibt 5 unterschiedliche Elementardrachen in Summoners Rift wobei der 5. nach der 35 Minute in 10 minuten Abständen neu Spawnt. Jeder der \"kleineren\" Drachen gibt einen Buff der bis zu 3 mal stackbar ist wenn man denn den Drach des jeweiligen Elementes 3 mal erledigt.\n\nCloud: + 25 / 50 / 75 Lauftempo außerhalb des Kampfes. (Priorität: Nice to have but no risk for it).\nInfernal: + 8 / 16 / 24 % erhöhter Angriffsschaden und Fähigkeitsstärke (Priorität: AUFJEDENFALL CONTESTEN!!!Stealversuch für Tod wert.)\nMountain: + 10 / 20 / 30 % zusätzlicher Schaden and Türmen und neutralen Monstern (Priorität: Skaliert stark ins Mid-/Lategame. Contesten! Aber nicht dafür sterben.)\nOcean: stellt auserhalb des Kampfes alle 5s 4 / 8 / 12 % des fehlenden Lebens und Manas wieder her. (Priorität: Nice to have, vll auch ein Geplänkel wert aber keinen Trade.)\n\nElder: Erhöht die Buffs der anderen Drachenbuffs auf 50 %. Gewärt aud Spells und Autoattacks 45 für jeden getöteten Elder Drachen + 45 für jeden Elemental Drachen and Truedmg an allem Außer Türmen. (Priorität: Nashor >= Elder, Wenn gegner Nash machen ist der Drache ein solider Trade)\n\nTürme\nFirstblood-Turret lohnt sich immer! Von daher vielleich mehr presure auf die Lane ausüben anstatt zu roamen. Die T1 Türme (ab der Mauer) regenerieren mit der Zeit HP, zwar nicht so schnell, jedoch sollte man da den Druck aufrecht halten.\n\nHerold\n5% weniger erlittener Schaden wenn kein Verbündeter in der Nähe ist. Bei 100 Stacks macht der nächste Autoattack 15 bis 270 magischen Schaden (halbiert für Reichweitenchampions).\n\t\n\nLategame\n\n\t\nSpätestens hier geht es darum das spiel zu beenden oder zu mindestest (wenn schon nicht passiert) die ersten Inhibitoren zu holen. Die Deadtimer sind hier schon relativ lang was bedeutet das jeder Tod sich spielentscheident auswirken kann. Darum ist in dieser Phase Vision das A und O. Richtig positionierte Wards um den Baron und den Elder-Drake sind Pflicht! Diese müssen aufjedenfall Contestet werden wenn möglich.\n\t\nBaron\nGibt allen Teammitgliedern des Teams die ihn bezwungen haben zusätzliche AD, AP und Regenerationswerte. Auch verstärkt er verbündete Versallen sodass diese viel mehr aushalten und auch austeilen. Man sollte den Buff unbedingt ausnutzen und den Druck auf die Gegner damit erhöhen. Ich persöhnlich favorisiere einen 1-3-1-Push jedoch ist dies oft recht riskant. Man sollte jedoch zumindest für die Duration mit dem Team groupen und einige Türme einreißen.\n\nInhibitoren\nZerstörte Inhibitoren haben einen Superversal auf der Lane des zersörten Inhibs zur folge. sind alle 3 zersört worden so kommen pro lane 2, also insgesamt 6 Superversallen.\n\n\nWissenswertes\nKills\nFirstblood gibt dem Tötendem 400 und den Assisstirenden 200 Gold.\n\nFolgende Tabelle Zeigt die Belohnung bei einem Shutdown/Kill eines 0/10 laners.\n\nTier  Consecutive kills  Consecutive deaths  Kill bounty  Assist bounty  Team bounty  In game announcement\n5      5 or more                                                   300            150                   90                   Unstoppable\n4      4                                                                  300            150                   70                   Rampage\n3      3                                                                  300            150                   60                  Killing spree\n2      2                                                                  300            150                   30\n1      See below                                                  300            150                   20\n0      0 or 1                      0 or 1                          300            150\n-2                                     2                                  274             137\n-3                                     3                                  220             110\n-4                                     4                                  176             88\n-5                                     5                                  140             70\n-6                                     6                                  112             56\n--7                                     7                                  90              45\n-8                                     8                                  72               36\n-9                                     9                                  58               29\n-10                                   10 or more                 50               25\n\nSomit lohnt es sich sogar zb den Supporter für einen Bounty-Reset zu opfern :3\n\n**Mechanics**\n\nAlle Punkte aus der Kategorie Knowledge sind informativer Natur und haben nicht mit der Spielmechanik an sich zu tun jedoch hängen alle Kategorien doch zusammen denn ohne vollwertiges Wissen kann man keine guten Entscheidungen treffen.\nIn dieser Kategorie geht es hauptsächlich um Mechaniken im Spiel. Damit mein ich jetzt nicht um Plays, Pentakills usw. sondern Grundlegende Dinge die einen so schon geschätzt auf platin bringen.\n\nLegue ist Spiel indem man schnell in eine Art tunnel geriet. Man Fokusiert sich zu schnell auf eine Sache vergisst dann andere wichtige kleinigkeiten. Hier geht es darum Schritt für Schritt die Grundlegenden Mechanicen die essenziell einen guten Lol-Spieler ausmachen sollten.\nMach einen Schritt so lange bis du ein persöhnliches ziel erreicht hast und es immer und immer wieder erreichst und dass nach und nach ohne großartig darüber nachzudenken.\n\t\n1. Farmen\nDas A und O in Lol. Der sicherste UND höchste Goldincome im gesammten Spiel.\n60 CS pro 10 min ist das mindeste was man haben sollte.\n80 CS / 10 min ist für lowere Elo ertragbar\nZIEL: 100 CS / 10 min sollte das Ziel sein!!!\n\n2. Jungletracking\nGanks sind nicht zufällig! Dein jungler startet botside? auf Low elo starten viel Jungler Bot machen Wölfe, Blue und dann top oder mid gank. Trotzdem sind viele überascht.\nWenn dein Jungler fertig mit seinem 2 Camp ist, ist es and der Zeit zu warden. \nWenn Top reinpusht dann rotiere dahin! Er wird Ganken! Siehst du auf der Midlane kurz das Gegnericon nicht und dein Midlane ist fulllive? Dann will er Ganken oder kriegt den Bluebuff, heißt entweder pingst du deine Bot zurück oder machst dich TP-ready.\nVersuche einen Sinn dafür zu entwickeln. Solltest du ihn richtig tracken dann kannst du ihn auch nachem du deine Wave gepusht hast invaden und einen Ward plazieren damit du ihn noch besser tracken kannst und dein Team rechtzeitig warnen kannst.\nZIEL: Verhindere in 10 Games einen Gank und invade im selben Spiel den gegnerischen jungler 10 mal bis der zweite Turm fällt.\n\n3. Mapreading\nBestimmt hast du beim Jungle-tracking oft auf die Map geschaut und zb erkannt wann ein Lee Sin sein Q Benutzt oder ob Hecarims Ultimate auf CD ist und und und.\nWenn dir dass nicht aufgefallen ist dann mal mehr drauf achten. Über die Hälfte eines Lol Spiels sollte man mit den Auf der Minimap verbringen. Vielleicht sogar über 75%! Deine Mapawarness wird die viel weniger Tode und mehr Presure für die Gegner beschehren.\nZIEL: Bringe in 10 Games beide Sidelanes zum Sieg (positive KDA bis minute 15).\n\n4. Wavemanipulation\nVersallen sind zum Lasthitten da. Ja klar! Aber anstatt dumm reinzupushen kann man auch die wave intelegent \"stellen\". Push die Wave rein bevor du Back gehst schon verliert dein Gegner ein paar cs. Freeze wenn du ihn Bullist und er verliert die nächsten. Spielst du selber gegen einen Bulli auf der Toplane? \nWarum die Wave dann nicht nah am eigenen Tower halten um nicht Gegankt zu werden, den Laufweg in die \"Sicherheit\" so kurz wie möglich zu halten und den Gegner Gankanfällig machen?\nAuf Bot würde ich zum beispiel immer dann Backporten wenn eine Cannonwave da ist. zwar gibt die alleine am meisten Gold jedoch schafft man es meistens rechtzeitig auf die Lane für die 3 casterversallen die zusammen wiederrum mehr als das Kanonenminion geben.\nZIEL: Erreiche 10 mal einen Lead von min 50 CS wenn du lanedominant bist und einen lead von 20 CS wenn du gegen einen Bulli Spielst.\n\n5. Lanecontrol\nStellt euch nicht einfach so in die Lane und reagiert auf den gegnerischen Laner. Sondern für selber an. Stellt ihr euch Midlane zb. rechts and den River so verschiebt der Gegner automatisch zum linken River macht ihr das andersrum so spiegelt er das wider. Führt ihn an somit könnt ihr Ganks effektiver gestallten ihn einige CD missen lassen und euren Lead weiter ausbauen.\nZIEL: Preperiere so in 10 Spielen Ganks für deinen Jungler.\n\n6. Information\nDas ist eventuell der einfachste Teil von allem. Schaut euch immer zu wenn ihr oder er die Lane betritt die Items an. überlegt euch was sinnvoll ist gegen seine items bzw gegen den champion an sich zu bauen und macht das overcapped mit einigen stats nicht (cdr als beispiel). Sorgt für Vision -> je weniger Fog of War desto mehr Informationen für euch. Treibt eure Gegner in die Irre. Führt sie an der Nase herum. Macht ein paar Mindgames, denn hinter den anderen Spielern sitzen immerhin menschen mit psychologie.\n\n4EVER hinterfrage jedesmal was du anders hättest bauen können. + bring 3 leute zum leaven indem du sie durch den FOG of War verwirrst.\n\n**Decisions**\nHat man nun das Wissen über die jeweilige Funktionalität einiger Elemente in LOL und beherscht den Großteil aller ansprechender Mechaniken dann ist man in der Lage vernünftige Entscheidungen zu treffen. Dieser Punkt steigert sicht mit mehr und mehr Spielen und mit eigenen Analysen.\n\nBin ich wissentlich nicht aktuell oder solltet ihr auch Tipps &amp; Tricks kennen die anderen helfen könnten dann bitte her damit! Fühlt euch frei eure Kritik zu hinterlassen beachtet jedoch bitte die Eloabhängigkeit. Dank unser anfangs beschriebenen Elo-Population ist dies wahrscheinlich auch für den niedrigeren Elo-Bereich hilfreicher als für die besseren Spieler unter uns.\n\nHoffe euch helfen gekonnt zu haben.\n\nGruß sLeXx","replies":[{"poster":"Swampsn","date":"2017-12-26T10:05:14.444+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für diesen Post ist zwar schon was länger her :D aber immer noch Hilfreich!\nvlt könnte mir noch jemand ein paar tipps geben für die kalkulation und die vorbereitung von fights wann gehen ich rein wann breche ich den trade ab? gibt es dort besondere situationen auf die ich achten sollte ?\n\nLg Swampsn","replies":[]},{"poster":"lkeras","date":"2017-04-24T15:17:22.823+0000","up_votes":1,"down_votes":0,"body":"Hier ist wie versprochen die etwas angenehmere Form (sogar mit Linkverzeichnis <3) des Threads als PDF. \n\n[How to Legue of Legends.pdf](https://www.dropbox.com/s/cck1xqgzkz34ok0/How%20to%20Legue%20of%20Legends.pdf?dl=0)","replies":[]},{"poster":"Mi3zekatze","date":"2017-02-04T21:01:44.395+0000","up_votes":1,"down_votes":0,"body":"Zugegeben ich habe mir nicht komplett alles durchgelesen weil ich die Basics kenne aber grade für Anfänger toll zum Verständnis! \nHabe früher danach gesucht um zu checken was ich weiß was nicht. Danke ;) \n\nÜbrigens standard AD Runen sind keine Lethality. Denk mal an Ezreal ASC was soll der damit? :)","replies":[{"poster":"lkeras","date":"2017-02-05T20:28:43.440+0000","up_votes":1,"down_votes":0,"body":"war und ist immernoch meine standart ad runenseite weil ich auf dem pappier den meisten schaden auf ca lvl 6 7 ausmachen wo häufiger gekämpft wird. mit Zed zb. nehme ich gerne Flat leben in den gelben und full armor penn in den roten und den essenzen da diese auf den niedrigeren leveln sehr effizient sind und man so sehr einfach snawballen kann.\n\nselbstverständlich sollte man sie champion für champion spezialisieren auf heca zb nehm ich gerne 3 movementspeed essenzen mit usw.","replies":[{"poster":"Mi3zekatze","date":"2017-02-06T12:07:37.748+0000","up_votes":1,"down_votes":0,"body":"Generell nehmen ADCS As und kein Lethality","replies":[{"poster":"lkeras","date":"2017-02-06T18:21:13.002+0000","up_votes":1,"down_votes":0,"body":"\"\nStandart ADC\nRot: 9 0,95 Angriffsschaden / Attackdamage\nGelb: 9 1,00 Rüstung / Armor\nBlau: 9 1,34 Magieresistenz / Magicresistance\nLila: 3 4,5% Angriffsgeschwinigkeit / Attackspeed\n\"\n\neventuell schlecht erkennbar wegen der formatierung sorry :)","replies":[{"poster":"Mi3zekatze","date":"2017-02-06T19:54:18.559+0000","up_votes":1,"down_votes":0,"body":"Oh sry ich habe mich verlesen tut mir leid :( musst duch nicht entschüldigen ist meine schuld!\n\nGenerell finde ich es ziemlich scheiße von der Community hier dich nicht kräftig zu upvoten! Du machst dir hier Mühe für Einsteiger die Hilfe bitter nötig haben wegen dem tollen System von Lol und dann wird es quasi kommentarlos abgefertig. Richtig mies! \n\nTrotzdem vielen Dank Dude :)","replies":[{"poster":"Mi3zekatze","date":"2017-02-06T20:11:50.052+0000","up_votes":1,"down_votes":0,"body":"Und ich denke du hast wirklich alles was man teoretisch lernen kann aufgeschrieben. Wer deinen Thread gelesen hat wird ein genaueres Verständins ingame haben! Zudem wird er teoretisch immer wissen wann er was zu tun hat, dass er es nicht sofort umsetzen kann ist klar aber es hilft seine eigenen Fehler einzusehen. Ich denke grade für Anfänger und Leute in Bronze super hilfreich (teilweise wäre ich froh würden mal ein paar Leute in Gold das lesen!).","replies":[{"poster":"lkeras","date":"2017-02-19T19:06:42.171+0000","up_votes":1,"down_votes":0,"body":"Danke für das Kompliment :) \n\nupvotes wären vll echt nicht schlecht damit der thread eventuel viele spieler erreicht aber sobald ich wenigstens ein  paar Lesern helfen konnte bin ich ebenfalls glücklich :)\n\ngruß und viel glück und spaß für incomming rankeds!\n\nps: ist auch etwas schwierig zu lesen muss ich eben zu geben weil es eine gute masse hat und dank der geringen Formatierungsmöglichkeiten leider zum größten Teil auch so bleibt. ich schau mal die Tage dass ich daraus eine angenehm veranschauliche pdf erstelle downloadlink werde ich hier selbstverständlich auch vermerken :).\n","replies":[{"poster":"Mi3zekatze","date":"2017-02-19T20:44:43.082+0000","up_votes":1,"down_votes":0,"body":"+3 :)","replies":[]}]}]}]}]}]}]}]},{"poster":"lkeras","date":"2017-02-04T20:29:08.319+0000","up_votes":1,"down_votes":0,"body":"PS: Seh grad das was mit der Formatierung nicht so ganz hingehauen hat werde mich morgen oder so drum kümmern. Sollte auch der Wunsch aufkommen dies mal als pdf oder sowas Lokal speichern zu können kann ich dem ebenfalls nachgehen.","replies":[]},{"poster":"lkeras","date":"2017-02-06T18:48:24.051+0000","up_votes":0,"down_votes":0,"body":"____","replies":[]}]}