{"poster":"HORSE OF FORCE","date":"2015-02-25T03:28:04.780+0000","title":"Relative Team Colors Rehash","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"So about the [most recent patch notes](http://oce.leagueoflegends.com/en/news/game-updates/patch/patch-54-notes#patch-sr), it's mentioned that you can now have your team's structures and minions have the same colour scheme as your UI HUD, thus making them match. Aside from me being a bit ticked off that this is a default, I thought of another solution to this.\n\nInstead of changing the colour of the structures and minions, just allow us to change the colour of our UI elements, such as health bars and minimap icons. This way, north base still remains as \"red base\" and south base still remains \"blue base\", making people who reference the bases by colour make a lot more sense. It'd probably also be a lot easier to program in, than changing the models of each minion and structure. There's also the case of how something looks to one player and how it looks to the other. Now you'll have instances were a champion is attacking a **red** inhibitor, but another champion is defending a **blue** inhibitor. That's sure to cause confusion at some point.\n\nAlso, what's going to happen in spectator mode? Is everything just going to be blue?\n\nI apologise in advance if someone's already suggested this but after a quick search, I found nothing about it.","replies":[{"poster":"Crusader charlie","date":"2015-02-25T23:06:39.270+0000","up_votes":1,"down_votes":0,"body":"just get a sense of direction lol.","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-26T05:05:12.688+0000","up_votes":2,"down_votes":0,"body":"I already have that; I'm just concerned about players who use colour to locate themselves. Remember when they did the rework of Summoner's Rift? They mentioned that each jungle quadrant must be identifiable when isolated from the rest of the map, and they did that by subtle colour hues. It's quite inconsistent of them to go and do this, without at least also giving us this option.","replies":[]}]}]}