{"poster":"TiorFior","date":"2016-03-30T02:33:02.528+0000","title":"I don't think I know how to play?","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":2,"body":"Alright, so I am pretty new to the game, but I thought I at least knew how to join a game. Apparently not.\r\nWhen I click on the play button, it takes me to the game board \"pvp\"etc, but that's not the issue.\r\nOnce I'm there, where there would usually be a joining button or something, but now it just has information about the games, and the home button at the bottom. The only games I seem to be able to play are custom games as opposed to pvp and co-op games.\r\nMaybe I'm an idiot and don't know what I'm doing. Call me out on it, please. \r\nAnyways, this happened after I left/surrendered in a training battle against bots due to connection issues. I thought the leavebuster only applied in ranked and qued games, not training battles, and I didn't get any emails about suspension or ban.\r\nSo if you guys could maybe help me, it would be appreciated. \r\nSorry.","replies":[{"poster":"RiotBok","date":"2016-03-30T04:14:42.196+0000","up_votes":3,"down_votes":0,"body":"I'm not seeing any Leaverbuster penalties on your account so that doesn't seem to be a problem.\n\nCan you show a screenshot of what your client looks like? Could be a case of assets failing to load properly, but that's usually fixed by restarting the client (or sometimes even by clicking \"Home\" then trying to create a game again).","replies":[]},{"poster":"TiorFior","date":"2016-03-30T22:01:16.993+0000","up_votes":1,"down_votes":0,"body":"Ok thank you, I figured it out.","replies":[]},{"poster":"EyesOfTheFox","date":"2016-03-30T15:35:52.896+0000","up_votes":1,"down_votes":0,"body":"It's been over a year since I was a \"new\" player (I'm still learning how to die less lol) but I remember there being level restrictions for a lot of game modes. Unfortunately I can't recall what levels you unlock everything at but this may be a contributing factor to your situation. If you are already level 30 and having this experience, I'm not sure what could be affecting your ability to play certain game modes.","replies":[]},{"poster":"Photos of Ghosts","date":"2016-03-30T12:21:06.209+0000","up_votes":1,"down_votes":0,"body":"Leaverbuster does apply to any queue, but it's something visible that takes your whole screen with a pop-up, this is a random bug","replies":[]}]}