{"poster":"wolf454","date":"2016-09-21T18:02:35.560+0000","title":"fragwürdige runen...","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"ich habe mich mal ein wenig im shop umgeschaut und ein paar interesante runen entdeckt desen effekt man irgendwie schwer einsch&auml;tzen kann..\r\nzb die essenzen.\r\nes gibt die essenze der energie die energie gibt... (der mana eratz f&uuml;r viele champs).\r\nAber funktioniert die auch bei allen champs? da wir ja viele verschiedene arten von energie haben (zb{{champion:240}} ) und bringt es &uuml;berhaupt was extra energie zu haben?\r\nich liste mal alle auf die ich komisch finde\r\nveringerter todeszeit\r\nmehr gold/exp\r\nkrtischer schaden\r\nkrit chance\r\nlauftempo\r\nzaubervampir\r\nmeine frage sind die alle nutzlos? sind ein paar praktische dabei? ich bleibe lieber bei meinen damage/leben runen^^\r\n{{sticker:slayer-pantheon-thumbs}} \r\n\r\nund ich w&uuml;rde auch gerne mal eure meinungen zu runen wissen^^ riot hat ja irgendwo gesagt das ihnen das runen system nicht gef&auml;llt und sie das verbessern wollen. was haltet ihr von dem system?\r\nwechselt ihr h&auml;ufig eure runen? bleibt ihr immer &quot;Meta&quot; oder nutzt ihr runen die man sonst selten sieht (zb. mana runen auf {{champion:13}} )","replies":[{"poster":"Gang Hei","date":"2016-09-22T06:04:35.224+0000","up_votes":2,"down_votes":0,"body":"Zaubervampir Runen sind ein Must-Have auf allen Damage over Time Castern","replies":[]},{"poster":"TerrorRaven","date":"2016-09-21T18:23:11.635+0000","up_votes":2,"down_votes":0,"body":"Energie-Runen sind nur für Champs nutzbar, die Energie als Ressource haben. Das wären Zed, Shen, Kennen, Akali und Lee Sin. Der Rest kann damit nichts anfangen.\n\nDie Gold-Runen stammen noch aus der Zeit, als es noch keine Support-Items gab.\n\nLauftempo wird ab und an noch benutzt (z. B. Hecarim)\n\nAußerdem hat Riot angekündigt, dass Runen-System in der nächsten Season zu überarbeiten.","replies":[{"poster":"wolf454","date":"2016-09-21T18:24:34.736+0000","up_votes":1,"down_votes":0,"body":"okay^^ also keine runen mehr kaufen? \nund nutzen diese energie champs auch diese runen?","replies":[{"poster":"TerrorRaven","date":"2016-09-21T18:26:11.557+0000","up_votes":1,"down_votes":0,"body":"Die Energie-Runen werden von denen nicht benutzt.\n\nBezüglich Runen kaufen kann ich nichts sagen, da noch nicht bekannt ist, inwieweit die Runen überarbeitet werden.","replies":[{"poster":"wolf454","date":"2016-09-21T19:37:01.992+0000","up_votes":1,"down_votes":0,"body":"okay ^^ ich glaube energie recovery wäre irgendwie praktischer.-. naja trotzdem vielen dank^^","replies":[]}]}]}]}]}