{"poster":"1471juan","date":"2017-11-27T15:56:47.421+0000","title":"Porque no sacan las normales ocultas y dejan las de reclutamiento?","subforum":"Charlas Generales","up_votes":5,"down_votes":4,"body":"Son in&uacute;tiles ,sin bans y sin ganar la linea se queda muy atras en cuanto a lo que sale worth de jugar ahi... relamente a nadie le gusta, de paso a los jugadores nuevos a la hora de jugar ranked he visto que se confunden mucho sin haber jugado en reclutamiento y se Autobanean su champ pensando que van a pickear... pues eso...","replies":[{"poster":"Zeuš","date":"2017-11-27T16:55:18.337+0000","up_votes":3,"down_votes":0,"body":"Por el simple hecho de qué es rápido, no perdes tiempo baneando y también por el factor que para mí es el más importante y es que si una persona lamentablemente (is a joke) quiere jugar Yasuo, Vayne, Darius, Kayn o los campeones nuevos que salen no pueden, ¿por qué? por el simple hecho de qué son los campeones más baneados del juego.. y seria injusto que sólo este el modo reclutamiento y estas personas no puedan jugar esos campeones que tanto quieren jugar..\n\nAdemás seguramente el %65 de los Jugadores que juegan Reclutamiento es porque tienen una mala computadora como para cantar las líneas en el blind pick, el otro %30 juega reclutamiento por que está cansado de los campeones nombrados anteriormente y el %5 restante juega para practicar como si fuesen rankeds.","replies":[]},{"poster":"rokushoger","date":"2017-11-27T16:29:54.518+0000","up_votes":2,"down_votes":0,"body":"Porque, como se dijo ya bastantes veces, la gente que prefiere blind pick es mayor a la que prefiere reclutamiento.","replies":[]},{"poster":"Chisolino","date":"2017-11-27T16:00:57.259+0000","up_votes":3,"down_votes":2,"body":"Desde que salio reclutamiento ni he pisado esa cola, ni la pienso tocar, y te aseguro que hay muchos como yo que prefieren una partida rápida y no 10 minutos de selección con riesgo de que te lo cancelen y esperar otros 10 minutos","replies":[{"poster":"Not Personal","date":"2017-11-27T17:37:37.029+0000","up_votes":1,"down_votes":0,"body":"Eso, es algo que me harta, muchas veces me voy al blind por que se me salen 3 veces de la seleccion 10 segundos antes de iniciar, o se van afk y sale rmk, y me tengo que comer 2 min de cola mas unos 5 min de pickear, cuando en 1 min y medio juego con la blind.","replies":[]}]},{"poster":"GDPhyros","date":"2017-11-27T17:26:45.928+0000","up_votes":1,"down_votes":0,"body":"creo yo que seria bueno, en ultimo caso que lo dejen asi un par de dias a modo de prueba, ver cuantos se ponen a llorar en el foro. xD","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-11-27T16:02:56.779+0000","up_votes":1,"down_votes":0,"body":"Para que los que no tengan suficientes campeones puedan jugar :p","replies":[]}]}