{"poster":"Meight","date":"2015-04-01T22:25:33.545+0000","title":"Equipo Serio Busca Top Oro5+","subforum":"Reclutamiento","up_votes":1,"down_votes":0,"body":"Hola, Somos un equipo relativamente nuevo pero con buenas ambiciones, todos estamos dentro del elo de ORO 5 + y estamos buscando un MAIN TOP si es posible exclusivamente TOP, necesitamos que este disponible de 21:00 a 0:00 hora Arg/Uy\r\npara jugar con nosotros\r\nRequisitos: -Seriedad\r\n-Disponibilidad horaria como se especifica arriba\r\n-No flamear\r\n-ORO 5  en adelante (Pueden haber excepciones en este caso)\r\n- Siempre tener &aacute;nimo y ganas de jugar, si en alguno de los casos no podr&iacute;as jugar con nosotros un d&iacute;a, avisar por WhatsApp ^^\r\n- Tener M&Iacute;NIMO 15 a&ntilde;os, no exigimos que seas mayor de edad pero buscamos seriedad a la vez, por eso este requisito.\r\nCualquiera que est&eacute; interesado puede: A) Comentar este post y te contactaremos por el juego\r\nB) Contactarse con Why YopS o Why Mocho dentro del juego\r\nSaludos y muchas gracias a quienes se tomen la molestia de leer el post!","replies":[{"poster":"Cyrax001","date":"2015-04-05T02:27:11.244+0000","up_votes":1,"down_votes":0,"body":"yo soy plata 2 pero tengo un elo bastante bueno, maineo fiora darius wukong nasus pantheon volibear, y no solo estoy disponible de 21:00 a 00:00 sino que tambien estoy durante la mañana, tengo 18 años","replies":[]},{"poster":"ChoripanMacrista","date":"2015-04-04T00:56:33.263+0000","up_votes":1,"down_votes":0,"body":"Main adc edad 17\ns2 bronce\ns3 silver\ns4 oro\ns5 oro (actualmente)\n\nchamps mas usados: varus, jinx, graves","replies":[{"poster":"Meight","date":"2015-04-04T18:31:46.639+0000","up_votes":1,"down_votes":0,"body":"Estamos buscando Top, gracias por no leer","replies":[]}]},{"poster":"Kakes","date":"2015-04-02T15:17:48.019+0000","up_votes":1,"down_votes":0,"body":"Hola soy diamante V no juego excesivamente top, pero puedo jugar bastante bien y tengo los champs necesarios, el único problema que tengo es el horario, como tengo 15 años y ademas me cambiaron a un colegio muy exigente solo podría jugar como máximo, de domingo a jueves 1 partida cada dia (9 a 10) y de viernes a sábado las 3 horas que pones hay o mas. Nose si te interese, si es verdad que no puedo cumplir con todo el horario creo que no es necesario jugar tanto para salir adelante, igual influyen otros factores, como la practica de lvls 1, las team comps, etc.","replies":[]},{"poster":"pandullce","date":"2015-04-02T02:06:01.472+0000","up_votes":1,"down_votes":0,"body":"Holaa soy oro 3 y soy verdaderamente main adc,pero de segunda juego bien en top, mis mains en top son {{champion:75}}  y {{champion:54}},tengo 14 años pero me tomo todo como un juego.si te sirve ahi te mande la soli!\nCya nub <3","replies":[]},{"poster":"MisterKnight","date":"2015-04-01T22:31:12.513+0000","up_votes":1,"down_votes":0,"body":"Lo que daría por jugar con gente que juegue en serio y que no trollee.. Pero cuando juegas solo rankeds, mueres en bronce. Como yo. Lastima de no estar bien clasificado, si no, me apuntaría. Saludos","replies":[]}]}