{"poster":"LeBítch","date":"2015-09-14T16:20:00.070+0000","title":"Evento por riven de campeonato","subforum":"Torneos y Eventos de la Comunidad","embed":{"description":"Los Elegidos del Mundial es un reto en dos partes donde tú puedes predecir cuáles equipos jugarán mejor en el Mundial 2015.","url":"http://pickem.las.lolesports.com/es-AR#my-picks/group","image":"http://cdn.lolesports.com/bracketology/assets/images/worlds-logo-93x93-57ddb5aa6c4fc15bba068993fbd70a33.png"},"up_votes":1,"down_votes":3,"body":"Algun rioter que me saque esta duda.\r\nHace poco salio este nuevo evento que estan spameando por todos lados diciendo que podes ganar a championship riven.\r\nYo creo que es fake y aqui mis razones:\r\n1-  cuando entras a ese link, la pagina te pide que te logees a pesar de ya estar logeado en la pagina de rito, como si se tratara de phishing\r\n2- en el inicio de noticias de la pagina oficial de rito no sale ningun articulo al respecto, cosa rara con semejante premio\r\n3- lo mismo que arriba, pero en la pagina de Esports\r\nsi algun rioter lee esto, que me saque la duda &lt;3","replies":[{"poster":"WáF WíthoütEquál","date":"2015-09-14T16:27:15.715+0000","up_votes":3,"down_votes":1,"body":"Enfermo, es real.","replies":[{"poster":"LeBítch","date":"2015-09-14T16:31:34.477+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ím SímplyÁmázíng,realm=LAS,application-id=QXeEMrF7,discussion-id=sFz9hM7i,comment-id=0000,timestamp=2015-09-14T16:27:15.715+0000)\n>\n> Enfermo, es real.\n\nwow, gracias por argumentar tan bien tus razones por las cuales crees que es real, me sacaste todas las dudas, capo! ¿que seria la comunidad sin gente como vos?\nevito insultarte porque es el foro y quiero que un rioter me conteste...","replies":[{"poster":"WáF WíthoütEquál","date":"2015-09-14T16:46:15.696+0000","up_votes":1,"down_votes":0,"body":"Viejo, hasta en reddit esta el evento, si fuera falsa no crees que ya perderiamos las cuentas? A mi nisiquiera me pidio loguearme, ya estaba logiado, con eso ya me basta para saber que es real.","replies":[{"poster":"LeBítch","date":"2015-09-14T16:48:42.134+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ím SímplyÁmázíng,realm=LAS,application-id=QXeEMrF7,discussion-id=sFz9hM7i,comment-id=000000000000,timestamp=2015-09-14T16:46:15.696+0000)\n>\n> Viejo, hasta en reddit esta el evento, si fuera falsa no crees que ya perderiamos las cuentas? A mi nisiquiera me pidio loguearme, ya estaba logiado, con eso ya me basta para saber que es real.\n\nen 4chan dijeron que justin bieber tenia cancer y salieron miles de fans a raparse en apoyo a el... eso hizo que la noticia fuese real? \nrekt","replies":[{"poster":"WáF WíthoütEquál","date":"2015-09-14T16:51:27.424+0000","up_votes":3,"down_votes":0,"body":"Y eso que tiene que ver? a mi me aparecio logeado al entrar a la pagina y eso es suficiente, pero bueno, hace lo que quieras, no seguire discutiendo con alguien tan terco como tu, basta con ver el link para saber que es real, la url de las.leagueoflegends.com es la oficial de Riot ellos mismos dicen cuales son los links verdaderos de ellos y al tener  las.leagueoflegends.com en la url basta para saber que es real, las que realmente son fake serian las paginas que como las del evento pool party y las de bilgewater, recuerdas esos links que enviabas a tus amigos y al hacer click te daba ''puntos'' que desbloqueabas skins, esos si eran fake.","replies":[]}]}]}]}]},{"poster":"sensual flanders","date":"2015-09-14T16:49:14.815+0000","up_votes":1,"down_votes":0,"body":"abris el CMD de windows-------- tracert las.leagueoflegends.com\n\n\nmiras los datos y despues comparas con los de la otra pagina","replies":[]}]}