{"poster":"Blaïr","date":"2018-03-21T09:50:12.284+0000","title":"Spielweise gegen Talon im Mid/Lage Game","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Hallo,\r\n\r\nich hatte neulich die Ehre gegen einen Talon zu spielen. Er war nicht mein Lane Gegner, war f&uuml;r mich im mid game aber ein ziemliches Problem. Ich spielte als Ahri und f&uuml;hlte mich Regel recht machtlos gegen ihn. Ich war nicht f&auml;hig ihn davon zu stoppen unsere squishies zu bursten, konnte ihn nicht t&ouml;ten. \r\n\r\nIch hab sicher viele spielfehler gemacht und auch die itemwahl war nicht gut ( Banshees UND zhonya). Aber abgesehen davon, wie spiele ich gegen einen Talon? \r\nEs schien dass er immer flankieren kann, ulten und 1-3 Leute alleine t&ouml;tet, selbst wenn der (versuchte) team -/Fokus auf ihm liegt. Das exhaust war zu sp&auml;t, entweder ist er &uuml;ber eine wand, oder wenn er aus der ult kommt ist es schon zu sp&auml;t und einer stirbt.\r\n\r\nWie haltet ihr einen, (nicht) gefgefeedet aber ahead, Talon nach der laningphase auf?\r\n\r\nLG Poro","replies":[{"poster":"Caaarl","date":"2018-03-21T17:20:25.397+0000","up_votes":2,"down_votes":0,"body":"amor+life= gg ad assassin?","replies":[]},{"poster":"SuckThisFist","date":"2018-03-28T22:58:41.039+0000","up_votes":1,"down_votes":0,"body":"Also Zhonyas war schon super gegen Talon, allgemein ist das Item super gegen alle ad Assassinen. Ich würde allgemein den Teil von Zhonyas mit Armor als erstes bauen gegen solche Matchups wenn man Zhonyas nicht als Firstitem komplett bauen möchte. Gegen Assassinen lohnt es sich auch die Stopwatch durch die Runen mit zunehmen. Und als Ahri lohnt es sich auch durch zu Puschen und zu Roamen, wenn man denkt das man den Gegner auf der eigenen lane nicht killen kann, da du mit ihr wirklich gute Gangs machen kannst","replies":[]},{"poster":"Gin","date":"2018-03-21T10:18:13.754+0000","up_votes":1,"down_votes":0,"body":"Push. Push. Push.\n\nDu hast als Mage so gut wie immer mehr Waveclear als Talon, und er muss sich wenn er roamen will entscheiden ob er versucht auf den anderen Lanes was zu machen, und riskiert dass er Minions/Farm verliert und sein Tower attackiert wird, oder da bleibt und farmt und im Laufe des Spieles immer mehr abfällt.\n\nPoke als Mage so viel wie du kannst solange er auf der Lane ist, und respektiere sein \"Engage-Zone\". (Die Reichweite seiner W und Q)\n\nWenn er seine W zum Waveclearen benutzt, kannst du ihn so gut wie immer bestrafen weil er einen Großteil seines Schadens aufgegeben hat.\n\nOhne seine W kann er seine Passive nicht procen, und die W ist, wenn man die R nicht mitzählt, sein einziger Schadensspell.","replies":[]},{"poster":"SuicidePlank","date":"2018-03-21T10:06:07.307+0000","up_votes":1,"down_votes":0,"body":"CC, Tanks, seine W dodgen und wie bei einem gefeedeten Kha'Zix warden, da Talon gerne die selben Routen nimmt.","replies":[]}]}