{"poster":"Rito JeZylZ","date":"2017-07-02T13:36:56.743+0000","title":"Una Pregunta.","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola,hace mucho que no dentro a lol desde el 6 de junio ya que mi pc murio y queria preguntar  cuanto tiempo tiene que pasar para que te borren la cuenta ya que el 17 de julio voy a tener un nuevo pc\r\n\r\n\r\nPd: soy lvl 30 plata 4  no se si eso influye","replies":[{"poster":"2801","date":"2017-07-02T13:42:32.861+0000","up_votes":1,"down_votes":0,"body":"No te pueden quitar una cuenta porque estes inactivo.\nYo estuve sin jugar como 1 año y 1/2, volví y solo no me acordaba la contraseña jaja\nSeria ilegal que te quiten algo en lo que invertiste tiempo y creaste con la regla de que nunca te la quitaran :v","replies":[{"poster":"WhiteMax","date":"2017-07-02T13:46:37.771+0000","up_votes":2,"down_votes":0,"body":"> Seria ilegal que te quiten algo en lo que invertiste tiempo y creaste con la regla de que nunca te la quitaran \n\nEntonces no existirian los baneos.{{sticker:zombie-brand-clap}} \n\nFuera de eso, como hacen entonces para \"recuperar nombres\" tipo yo quiero llamarme de una forma pero hay un jugador que desde hace 9 meses no juega, segun tenia entendido Riot te podia dar el nombre o algo asi.","replies":[{"poster":"2801","date":"2017-07-03T01:23:09.859+0000","up_votes":1,"down_votes":0,"body":"Los baneos son por causas ilegales en el juego, si has hecho algo erroneo, esta bien que te baneen, pero si estas inactivo..\npara nada.\nY eso del nombre nunca se fijan.","replies":[]},{"poster":"Rito JeZylZ","date":"2017-07-02T13:51:32.655+0000","up_votes":1,"down_votes":0,"body":"por eso pregunte un amigo me habia dicho sobre eso","replies":[]}]}]},{"poster":"Charlôtte","date":"2017-07-02T13:40:50.092+0000","up_votes":2,"down_votes":0,"body":"Nunca te la borran, tranqui","replies":[{"poster":"Rito JeZylZ","date":"2017-07-02T13:55:30.009+0000","up_votes":1,"down_votes":0,"body":"ty","replies":[]}]},{"poster":"Keyz","date":"2017-07-02T14:44:03.658+0000","up_votes":1,"down_votes":0,"body":"la realidad es que las cuentas que presentan inactividad mayor a 3 años son borradas, esto quiere decir que si no tiene por lo menos 1 partida en el historial, se borra automaticamente al pasar estos 3 años.\n\nen el caso de los nicks es diferente, puedes usar el nombre que tiene otro invocador siempre y cuando éste haya estado inactivo de 1 a 3 años, la duracion de la inactividad depende de cuanto haya jugado ese usuario, por ejemplo, si un nivel 1 hace 6 meses que no juega y solo restringe un nick, entonces se lo puedes afanar, ahora si es un chabon que es lvl 30, y jugo durante 3 temporadas, obviamente no será la misma duración :P","replies":[]},{"poster":"WhiteMax","date":"2017-07-02T13:39:44.939+0000","up_votes":1,"down_votes":0,"body":"Desconozco cual es el tiempo limite pero te aseguro que no te la van a borrar (siempre y cuando empiezes a jugar cuando tengas la nueva Pc).","replies":[{"poster":"Rito JeZylZ","date":"2017-07-02T13:56:31.541+0000","up_votes":1,"down_votes":0,"body":"si voy a jugar de una me aburro xd","replies":[]}]},{"poster":"Nutria Deliciosa","date":"2017-07-02T13:41:46.128+0000","up_votes":1,"down_votes":0,"body":"La cuenta no te la sacan, te restan puntos de liga pero apartir de platino","replies":[{"poster":"Rito JeZylZ","date":"2017-07-02T13:53:48.550+0000","up_votes":1,"down_votes":0,"body":"ok vale","replies":[]}]}]}