{"poster":"Jun Long","date":"2016-02-26T09:18:14.040+0000","title":"YOU GOTTA BE KIDDING ME RIOT","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":1,"body":"I just got done with the 6.4 patch which took a reinstall to do. That took HOURS. First of all you nerfed Ahri -cmon man!- Second of all I launched after it was done; then logged out because I had to do stuff. Not even 20 minutes later, I come back launch it and it says 33%. WHAT THE FRIGGITY FRUITY. Those many hours of patching and it let me launch afterwards, WHAT HAPPENED TO THAT?!! YOU GOTTA BE MESSING WITH ME RIOT I SWEAR!","replies":[{"poster":"Maraudaur","date":"2016-02-26T21:39:30.210+0000","up_votes":2,"down_votes":0,"body":"Hey man,\n\nIf you have continued tech issues I would contact player support or start a thread in help and support!\n\nAs for the Ahri Nerf heres some additional insight. \nBalance team member SmashGizmo's rebuttal to various Ahri nerf complaints\nhttp://www.twitlonger.com/show/n_1sobp97\n\n> I'll try to go through the major points in your post as best I can:\n> \n> \"Getting to the point, all you need to do to nerf Ahri and achieve the effect you want is make her Q's movement speed scale off of either the level of her Q or her ult. Every argument you have made towards changing charm in the way you have has made me more and more frustrated.\"\n> \n> - This is missing the point. I'm not just trying to nerf Ahri, I'm trying to strip away a strength that feels out of place given her mobility, damage, and range profile and make her CC feel more consistent with the most analogous CC (Fear and Taunt).\n> \n> \"You claim charm is too punishing for the person dashing, saying that \"anyone who uses their dash to close has no control over engagements with Ahri, it's on her to mess up for them to suceed\". This is not how the game works. All the control is in the hands of the player using the dash.\"\n> \n> - Guess we have to agree to disagree. If you're a character who needs to close on Ahri and your main way of closing on opponents is via a dash, I firmly believe that Charm gives Ahri almost all agency over engagements, especially if your dash is targeted.\n> \n> \"Ahri cannot FORCE SOMEONE to use their dash.\"\n> \n> - Right and some characters don't function if they don't get to dash at opponents. So she doesn't force them to dash, she just holds charm and fucks them if they ever do, so just by existing, she has robbed them of any ability to play.\n> \n> \"You have stated that Ahri should not get rewarded more for hitting someone, but why not?\"\n> \n> - Because she's a mobile, ranged, assassin, kite-mage carry. The character is overloaded on strengths. Being a jack of all trades means you don't get to be better than everyone else at the things you're doing.\n> \n> \"After all, every champion has their unique reward for CC....\"\n> \n> - Morgana doesn't. Brand doesn't. Annie doesn't. I don't wanna get into splitting hairs here, but this argument doesn't really hold any water for me. Just because other characters have other mechanics attached to their CC doesn't mean that Ahri needs some too. See above, when you're strength are incredibly diverse, they can't be particularly strong individually.\n> \n> \"Furthermore, if this change goes through, based on this logic Thresh and Blitz hook need to change. Sure they are displacements, but why should they get rewarded more for hitting a dashing target? It is just as hard to do it with Ahri as it is Blitz, though I will admit doing it on Thresh is harder as he has a windup for his hook that is significantly longer than either champion.\"\n> \n> - Don't want to keep beating a dead horse, but again, no it doesn't, this is about what tools Ahri has aside from Charm, so stuff like, \"based on this logic Thresh and Blitz need to change\" is kinda missing the point of the nerf. Also once again, displacements are different mechanically, they actually basically need to work the way they do to make any sense visually, and because of this, we budget power differently on a knockup/knockback than we do on other types of CC.\n> \n> \"If, as you have pointed out, \"Ahri's core character is about being a nimble assassin/mage\", why are we forced to play like Xerath or Lux for the first 6 minutes of the game? If the focus is parity, why are you making her pre-6 so massively bad in comparison to similar champions like Zed and Leblanc?\"\n> \n> - Because her range profile is much more similar to Xertah and Lux than it is to Zed/LB. Again, this is the price a character pays for having so many strengths, she ends up paying for it in terms of early damage and ability to aggress. I'm not in love with the character's laning pattern, but it being boring makes perfect sense to me given what she's good at and until we start better defining what strengths she's supposed to have and which she isn't, this is just the way it has to be.\n> \n> \"My argument is that charm is its own unique thing, as it is the only CC in the game that makes a champion walk towards the caster without attacking.\"\n> \n> - Fear makes a champion walk away from the caster without attacking. It doesn't stop their dashes.\n> \n> \"If you remove all the unique parts of every CC you have a very boring game.\"\n> \n> - You're strawmanning pretty freaking hard here. This change isn't an attack on mechanical differences between CC, it's about the status effect behaving the way players expect and aligning this effect with Ahri's kit's strengths and weaknesses.\n> \n> \"You have not changed these things because they are interesting and bring about diversity in the skill pool. Charm causing people to stop dashing is part of Ahri's identity. It has not been removed for years because it is not overpowered and not, as it is presented, a bug (this is one of few cases where, if it was a bug at first, it actually has developed into a feature). It has remained in the game because it is part of Ahri's identity. It is part of what makes playing against her, as her, and with her so exciting. Removing its ability to stop dashes is one more step towards Ahri and all of League a little less interesting, a little less diverse, a little less fun.\"\n> \n> - I don't get how Charm stopping dashes is part of Ahri's identity. I get that it's a mechanic that players have played around for years, but I still haven't heard any Ahri players tell me what else they're willing to give up in order to keep best in class CC and stopping power. Like, basically what I keep hearing is, Ahri's strengths are that she's super fast, super safe, and is awesome at catching people, and her weakness is damage. Yet she does a ton of damage practically and when people are throwing out what changes they think I should make, none of them are about reducing the damage she deals. So I'd rather chip away at her catch and safety being top notch and instead make those only really freaking good (even after this change, she's still really damn good at this) and accept her as a jack of all trades mage for the time being.","replies":[]},{"poster":"jomoko2012","date":"2016-02-26T09:58:05.883+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jun Long,realm=NA,application-id=FjGAIbRv,discussion-id=4szsek1U,comment-id=,timestamp=2016-02-26T09:18:14.040+0000)\n>\n> WHAT THE FRIGGITY FRUITY. \n\nLmao best thing I have ever heard hahaha","replies":[{"poster":"Jun Long","date":"2018-03-07T21:59:37.555+0000","up_votes":1,"down_votes":0,"body":"Holy shit I was cringy. IDK why this suddenly came up as recent. Also, lo and behold, more patch problems lol. Gotta uninstall and reinstall.","replies":[{"poster":"HEIPILAOGONG","date":"2018-03-09T02:48:08.692+0000","up_votes":1,"down_votes":0,"body":"Back just in time for Ahri nerf next patch :)","replies":[]}]}]},{"poster":"lordofrage","date":"2016-02-26T09:41:11.381+0000","up_votes":1,"down_votes":0,"body":"ahri needed the nerf shes bullshit as it is","replies":[{"poster":"Volcanuz","date":"2016-02-27T14:14:45.456+0000","up_votes":1,"down_votes":0,"body":"Amen. Her sustain, poke, damage and cool downs are all just too good imo for a mage. She can push nearly anyone out of lane.","replies":[{"poster":"lordofrage","date":"2016-02-27T17:25:22.557+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Volcanuz,realm=OCE,application-id=FjGAIbRv,discussion-id=4szsek1U,comment-id=00000000,timestamp=2016-02-27T14:14:45.456+0000)\n>\n> Amen. Her sustain, poke, damage and cool downs are all just too good imo for a mage. She can push nearly anyone out of lane.\n\nshe  needs more nurfs she needs to be in the maokai nurf section","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2016-02-26T10:30:12.271+0000","up_votes":1,"down_votes":0,"body":"Ahri is the most powerful mage in the game atm, she has a 53% win rate (incase you didn't know, thats quite high) so why are you complaining that they nerfed her?? thats the real issue here.","replies":[{"poster":"Volcanuz","date":"2016-02-27T14:13:48.467+0000","up_votes":1,"down_votes":0,"body":"Personally i think Annie and Veigar are underated as mages. They are some of the best mages if played right. Ahri kind of relys too much on landing her shit and kiting. Annie just drops her junk on your head and you go oh hey screen is grey... Oh im dead. \n\nSame with Veigar. Man i can't tell you how many times i've been one shot by veigar even with tons of MR. I've never been 100-0 by one Ahri combo. Usually she has to auto me once or twice and hit me with another Q to get the kill. Veigar or Annie some times i don't even need full combo to die or kill someone.\n\nNow if you are saying most powerful MOBILE mage i TOTALLY agree with you. She is the best chaser, escaper, juker assassin like mage in the game. If you can land her abilities..","replies":[]}]},{"poster":"MeJewGold","date":"2016-02-26T20:49:40.512+0000","up_votes":1,"down_votes":0,"body":"You need a new computer because by the sounds of it your one of those guys who lags out in a game and ruins it for the rest of us my league takes me like 30 seconds to dl and each patch is about 20 seconds so i would suggest upgrading to a better pc before playing such an amazing strategy game as this.","replies":[{"poster":"Volcanuz","date":"2016-02-27T14:09:40.804+0000","up_votes":1,"down_votes":0,"body":"Because the PC makes you download faster. Lol.","replies":[]}]},{"poster":"JasonWazza","date":"2016-02-26T10:44:59.395+0000","up_votes":1,"down_votes":0,"body":"1. The ahri nerf is fine honestly.\n2. They needed to fix what they screwed up, Elise not making any noise was getting on my nerves.","replies":[]},{"poster":"TrashDonnut","date":"2016-02-26T09:54:32.663+0000","up_votes":1,"down_votes":0,"body":"TL;DR\n\nPersonal problems.","replies":[]}]}