{"poster":"Sir Nova","date":"2018-04-28T16:46:15.452+0000","title":"Podrian hacerle un rework a Mordekaiser ?","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Saludos invocadores {{sticker:sg-ahri-2}} \r\nSoy nuevo posteando en el foto, queria escribir esto para que con suerte algun rioter lo vea. Sabemos que riot esta trabajando en el nuevo champ support y que en sus planes de rework estan trabajando en {{champion:266}} ,{{champion:84}} y {{champion:20}} ...\r\nQueria preguntar: podrian hacerle un rework ( almenos visual ) a {{champion:82}} ?\r\nEs un champ que al igual que {{champion:83}}  no es muy comun verlo en la grieta, un amigo mio empezo a masterisar a {{champion:83}}  y la verdad que no esta nada mal teniendo en cuenta el meta, yo empeze a mainear {{champion:82}}  y la verdad que esta en la misma situacion, su pasiva, capasidad de cura, su definitiva, es un campeon muy fuerte que puede dar un gran apollo al equipo ( mas si saca con la maldicion el dragon ).\r\nEl punto es que por mas que sea un muy buen champ, a mi forma de verlo, su dise&ntilde;o lo hace muy poco vistoso, casi no aparenta movimiento alguno, tanto a la hora de usar sus habilidades como moverse, lo mismo pasa con sus skins ( excepto la skin del Rey de basto que lo &quot;disfraza&quot; un poco ). Escribo esto ya que ultimamente riot puso bastante manos a la obra en lo que reworks respecta, me resultaba raro que aun no allan puesto bajo su lupa a este campeon, si algun rioter llegara a ver este post quisiera preguntar lo suguiente: \r\nLuego de trabajar en los 3 reworks visuales y t&eacute;cnicos anunciados de {{champion:266}} , {{champion:84}}  y {{champion:20}} , tienen en mente hacerle alg&uacute;n rework completo o solo le har&iacute;an una actualizaci&oacute;n de modelo ?\r\nCompa&ntilde;eros invocadores, ustedes que opinan del estado actual de {{champion:82}} , necesita un rework urgente de modelo o completo ?","replies":[{"poster":"0nlyRenektonSolo","date":"2018-04-28T17:07:51.297+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Sir Nova","date":"2018-04-28T17:12:57.091+0000","up_votes":1,"down_votes":0,"body":"Te comprendo amigo, yo creo que el tema de su kit se debe a que riot no supo definir la orientación del campeón en si, por ejemplo tema runas, no hay una elección fija para el, todas se le adaptan muy bien, ademas sin olvidar que hubo un tiempo en que lo cambiaron para orientarlo de top a support.","replies":[{"poster":"Dog Bulling","date":"2018-04-28T23:30:20.667+0000","up_votes":1,"down_votes":0,"body":"¿Support? En realidad querían un Morde ADC con item de support al inicio, lo cual todos sabemos que fracasó porque para empezar ni siquiera hablamos de alguien que pelee a rango, algo obligatorio para el que aporta daño en la botlane. Fueron los 2 peores meses de mi vida como main soporte.\n\nEn cualquier caso si, necesita un rework si o sí. Hablamos de un campeón carente de 2 cosas obligatorias en el LoL: movilidad mínimamente confiable y CC. El único control de masas que presenta es el que aplica con el rylai, porque antes de ello es como un soldado que pelea con espadas en campo abierto, en vez de armas semi-automáticas como el resto de los soldados (Pegará muchísimo, pero nadie en su sano juicio se pondría a su rango en primer lugar).","replies":[]},{"poster":"The Alex17","date":"2018-04-28T22:16:40.972+0000","up_votes":1,"down_votes":0,"body":"Imaginate ir AD critico y pegarle las 3 con electrocutar\n\nUff","replies":[]}]}]},{"poster":"Marcset","date":"2018-04-29T00:19:14.693+0000","up_votes":1,"down_votes":0,"body":"Personalmente no creo que necesite un rework COMPLETO, si uno visual (visualmente da bastante asco). Su problema de la movilidad se arregla con items, aunque 15 o 20 mas de velocidad de movimiento base no le vendría mal, lo mismo con la armadura base, y están planeando agregar esas dos cosas o sacar el tiempo de reactivación de la w. Su kit es bastante fuerte pero al estar en desventaja en velocidad de por si es difícil sacarle TODA la utilidad, ademas de que la pasiva de la W es medio inútil. Por lo demás el campeón no esta mal, ofrece bastante daño y puede aguantar bastante a cambio de no tener movilidad (Como todo juggernaut). PD: Si se lo aprende a jugar mid tiene mas potencial por estar mas cerca del dragón pero es mas difícil la fase de lineas, aun estoy en proceso de aprenderlo en mid). PD: lo que si tendrían que hacer seria corregirle los 180 bugs que tiene xd\nEditado: La fuente de lo que dije viene de conclusiones propias y del servidor de discord de mordemains.","replies":[]}]}