{"poster":"Azukus","date":"2015-06-23T06:22:17.871+0000","title":"Okay, so this may be a very odd or dumb question, but here goes.","subforum":"Tips & Tricks","up_votes":2,"down_votes":0,"body":"How exactly do I improve my mechanics? I can read a Blitzcrank&#039;s &quot;body language&quot; and know when the hook is coming. I can sniff out things and tell when certain things will happen. I can predict all sorts of things and my mind will even react to them, but for some reason.. I can&#039;t sidestep it? My eyes will follow the enemy {{champion:25}}  snare or the {{champion:76}} spear.. And yet.. I just can&#039;t sidestep it. It&#039;s so simple... I know when it&#039;s coming, my eyes and mind react to it, but my mind doesn&#039;t say &quot;dodge&quot; and my hand doesn&#039;t respond... Should I just train at dodging in a custom game or what?","replies":[{"poster":"AirSonance","date":"2015-06-23T15:38:41.669+0000","up_votes":1,"down_votes":0,"body":"Perhaps it's some kind of \"deer in the headlights\" reaction where you know it's coming but just don't react? It should probably go away eventually, but for now, try to focus on reacting to it in some way.","replies":[]},{"poster":"S2C2Xd9KOy","date":"2015-06-23T08:16:01.598+0000","up_votes":1,"down_votes":0,"body":"If you move unpredictably in lane and stay behind minions when simply just farming, you should be fine. If you're Ezreal and you're against a Blitzcrank, just think in your head if you get hooked, what will you do? E away obviously and flash if you really need to.","replies":[]},{"poster":"TehNACHO","date":"2015-06-23T06:40:23.630+0000","up_votes":1,"down_votes":0,"body":"...Do you happen to watch DBZ Abridged? I mean I swear to god you sound like Gohan.\n\nPlay dodgeball with a friend, that tends to help.\n\nOh, I do want to point something out though before you beat yourself up over not dodging. Most players are really good at throwing skill shots in a way that makes it hard to dodge. Talk to any Hooker Main and they may just mention something about aiming with the lane. What you really want to do is juke their shots before they even fire it. Run a certain direction then pull a 180 the moment you can sense their telegraph, for example. It's much easier to dodge when you make them fire in the wrong direction entirely.","replies":[{"poster":"Azukus","date":"2015-06-23T07:03:14.674+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TehNACHO,realm=NA,application-id=WEuoGbmp,discussion-id=LnrmsEuz,comment-id=0001,timestamp=2015-06-23T06:40:23.630+0000)\n>\n> ...Do you happen to watch DBZ Abridged? I mean I swear to god you sound like Gohan.\n> \n> Play dodgeball with a friend, that tends to help.\n> \n> Oh, I do want to point something out though before you beat yourself up over not dodging. Most players are really good at throwing skill shots in a way that makes it hard to dodge. Talk to any Hooker Main and they may just mention something about aiming with the lane. What you really want to do is juke their shots before they even fire it. Run a certain direction then pull a 180 the moment you can sense their telegraph, for example. It's much easier to dodge when you make them fire in the wrong direction entirely.\n\nThe part though is that I main Thresh and I am a beast at landing hooks so I know how they'll do it, but for some reason, I just don't even move sometimes despite knowing it's coming. And yes, I do watch TFS.","replies":[]}]},{"poster":"tonzillacrayon","date":"2015-06-23T06:31:31.529+0000","up_votes":1,"down_votes":0,"body":"Lots of game play . If you keep playing and focus on that stuff just keep mental tracks if you know a spell is up stand behind the minions and move back and forth there and always change the angle you go in to trade with .","replies":[]}]}