{"poster":"Heibord3000","date":"2017-07-29T17:11:17.825+0000","title":"el chico pleyboy","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":2,"body":"Minuto 1 de seleccion de campeon, no banea, y yo le pongo: &quot;Si no sabes que banear, pregunta&quot;\r\nEsta persona comenta, &quot;Hago lo q se me canta low elo de mierda&quot;\r\nEscribo en el chat &quot;Ya se a quien mutear apenas inicie la partida&quot;\r\nY despues Sigue flameando y etc.\r\nAl principio de partida lo muteo, y pido report por el. \r\nVamos perdiendo y veo mucha escritura en el chat, decido desmutearlo y ver porq tanta escrituras, lo primero q leo de parte de el es: &quot;Son unos malos de mierda&quot; &quot;Lows elos&quot;\r\nApenas termina la partida, me envia una solicitud de amistad, y esto es lo q me escribe\r\noro III\r\nni\r\nplatino sos\r\ntriste\r\nde mierda\r\nJAJKD\r\nlow elo mediocre\r\nquedate\r\nen mi lista\r\nasi\r\nvez\r\ncomo en 2 dias\r\nte saco\r\n2 ligas\r\n(este soy yo) tranqui\r\nde dif\r\ngordito\r\nmanco\r\n(este soy yo) te bloqueo\r\n(este soy yo) ya\r\nd2\r\nex maestro\r\ns6\r\n(este soy yo) y te mando al foro\r\ndale\r\nsalu2\r\n(este soy yo) por captura\r\nlow mediocre\r\nchao\r\n\r\nEs del tipo de personas q quieren provocar a las personas (q por mala suerte suerte no hay pocas en el servidor) , pienso q no debe tener mas de 14 a&ntilde;os.\r\nLo q recomiendo en casos de este tipo de personas es mutear y bloquear y no agregarlas como hice yo. Y si por alg&uacute;n motivo, no pueden, agarrar y cagarse de risa con lo q escribe. El lo unico q quiere hacer q la pasen mal. Porq le van a dar esa satisfacci&oacute;n","replies":[{"poster":"SeeYouLaterMorde","date":"2017-07-29T20:25:34.402+0000","up_votes":3,"down_votes":0,"body":"Para que lo agregaste , no creo que enviandote la solicitud te mandaria besos y cariños, era obvio que te seguiria insultando.  Aunque yo tambien hago eso, experimento antiocial lolero jajaj","replies":[{"poster":"Heibord3000","date":"2017-07-29T23:56:39.739+0000","up_votes":1,"down_votes":0,"body":"lo agregue porq pense q era de esos niños q decian \" era una broma nomas jaja equizde saludos\"\nAunq te digo q tampoco es q no esperaba esa reaccion de el.","replies":[]}]},{"poster":"stonerock","date":"2017-07-29T18:19:07.796+0000","up_votes":1,"down_votes":0,"body":"A veces nos gana la curiosidad, pero no tenes que acpetar esas solicitudes, es obvio que va a seguir comportandose igual, el chico debe sufrir de falta de atencion y trollea para poder tener la atencion de otros, solo tenes que ignorarlo y listo","replies":[{"poster":"Heibord3000","date":"2017-07-30T00:01:47.418+0000","up_votes":2,"down_votes":0,"body":"En verdad tienes toda la razon, pero como dije antes, creia q era otra clase de persona. Me equivoque","replies":[{"poster":"stonerock","date":"2017-07-30T00:45:17.516+0000","up_votes":1,"down_votes":0,"body":"siempre estan estas personas, por eso nunca agrego a personas con las que no tuve una buena relacion en la partida, hay muchos nenes en la comunidad lamentablemente, espero que no te vuelva a pasar ajajja (Ni a mi)","replies":[]}]}]},{"poster":"Mind Crush","date":"2017-07-29T23:00:43.649+0000","up_votes":1,"down_votes":0,"body":"soy yo que pasa porque no arreglamos esto como hombres y no viniendo a llorar al foro?","replies":[{"poster":"Heibord3000","date":"2017-07-30T00:00:57.649+0000","up_votes":1,"down_votes":1,"body":"(se q no lo eres) Si eso es una amenaza te aplaudo con los pies, se nota q no tienes coherencia en las palabras q dices. Porq tendria q arreglar algo contigo, el foro esta para hacer este tipo de cosas, (y si fueras tu) \"(este soy yo) y te mando al foro\ndale\nsalu2\"\nVos me diste permiso, asi q no me fui llorando señor, fui con toda libertad de expresion :)","replies":[{"poster":"Mind Crush","date":"2017-07-30T00:05:03.056+0000","up_votes":1,"down_votes":0,"body":"hala chaval pero que no te enojes tio que era un trolleo para mi amigo el maiky","replies":[]}]}]}]}