{"poster":"Twisted Feder","date":"2017-12-08T15:02:46.633+0000","title":"¿Por que dopa tira la e antes que la w con zed?","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"https://www.youtube.com/watch?v=9WkHR-sSdVg\n\nPues no soy jugador  de zed pero en todos sus videos veo que siempre hace lo mismo Tira la e antes que la W.\nAlguien que juegue zed me dice porque es.\nYo solo he jugado zed en aram cuando me salia y siempre tiro la w y despues la e.\n\nPueden ver lo que comento en los primeros segundos, pero si miran todo el video o cualquiera donde juegue zed hace siempre lo mismo\n\nPD: Mirando detenidamente creo que es porque le pega los ultimos frames de la animacion de la E al tirar la w ¿es correcto?","replies":[{"poster":"RazorToddy","date":"2017-12-08T15:06:11.517+0000","up_votes":2,"down_votes":0,"body":"Usa la E justo después de presionar W.","replies":[]},{"poster":"lKatsuo","date":"2017-12-08T15:07:06.158+0000","up_votes":1,"down_votes":0,"body":"El input de la e queda en el buffer de entrada y se lanza cuando cae la sombra de manera instantanea.","replies":[{"poster":"Twisted Feder","date":"2017-12-08T15:10:59.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lKatsuo,realm=LAS,application-id=8sKIclmi,discussion-id=Oj0EnWRM,comment-id=0001,timestamp=2017-12-08T15:07:06.158+0000)\n>\n> El input de la e queda en el buffer de entrada y se lanza cuando cae la sombra de manera instantanea.\n\nDebe ser ESo del input que comentas. pero  en mis partidas bronce en D5 nunca vi a los zeds hacer eso. Por eso cuando lo vi me sorprendi, ademas que lo hace instantaneo.\n\nRazorToddy No. fijate en camara lenta que la E se pone en CD antes  de tocar la W.","replies":[{"poster":"WhiteMax","date":"2017-12-08T17:50:15.544+0000","up_votes":1,"down_votes":0,"body":"> RazorToddy No. fijate en camara lenta que la E se pone en CD antes de tocar la W.\n\nPorque la animacion de la E es mas rapida, es W-E.","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-12-08T17:43:10.437+0000","up_votes":1,"down_votes":0,"body":"Es un W-E, pasa que lo hace muy rapido. La animacion de la E es mas rapida que W ya que en ella tiene que llegar la sombra.","replies":[]}]}