{"poster":"Captain Nic","date":"2015-06-02T15:31:02.628+0000","title":"Counter-Picks (Low Elo und High Elo)","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"Hi Leute,\r\n\r\nIch wollte nur einmal eure Meinung zu einer Diskussion zwischen einem Freund und mir h&ouml;ren. Unsere Diskussion handelt von Counterpicks, und wie stark diese einen Unterschied in Low Elo Spielen und High Elo Spielen machen. Ich denke, dass Counterpicks gerade auf meiner Elo (Low Elo, Gold V) einen starken Unterschied machen, da viele Leute ihre Champions einfach nicht beherrschen und es deshalb nicht auf Skill ankommt, sondern einfach auf die jeweiligen Champs. Logischerweise bin ich deshalb auch der Meinung, dass Counterpicks in den High Elo Spielen (Dia-Challenger) &uuml;berhaupt nicht viel ausmachen sollten, da normalerweise jeder seinen Champ zu 100% kann und die Leute in dieser Elo so viel Skill haben, auch gegen Counterpicks ein ordentliches Spiel zu absolvieren. Beispielsweise h&ouml;re ich nie bei LCS Spielen oder Dia-Challenger Streams, wie sich die Spieler wegen \"Counterpicks\" beschweren. Mein Freund ist der Meinung, dass Counterpicks gerade auf High Elo Spielen einen gro&szlig;en Unterschied machen und auf Low Elo Spielen Skill das Match entscheidet, was meiner Meinung aber wenig Sinn macht.\r\n\r\nFreue Mich auf Antworten und w&uuml;nsche viel Spa&szlig; in LOL :)\r\nNic","replies":[{"poster":"Stealth Cat","date":"2015-06-02T16:11:49.268+0000","up_votes":1,"down_votes":0,"body":"Auf Highelo macht es viel mehr aus.\nBei deinem beispiel:\nAuf Highelo kann jeder seinen Champ perfekt, daher fällt jeder Vorteil auf.\nAuf Lowelo reicht es wenn du gut farmst und wardest und du gewinnst die Lane, daher machen Counterpicks kaum einen Unterschied.","replies":[]},{"poster":"Evenrider","date":"2015-06-02T16:02:45.761+0000","up_votes":1,"down_votes":0,"body":"Eher andersherum.\nWas bringt dir ein Counterpick, den du nicht kannst und bei dem du nicht verstehst, warum dieser Champion ein Counterpick ist. Dein Gegenspieler beherrscht seinen Champion wesentlich besser und kann dich dadurch schlagen.\n\nIn High Elo, da wo jeder seine Champions beherrscht machen diese kleinen Unterschiede, wer kontert wen, den Unterschied.\nAuf LowElo machen wir viel zu viele Fehler, als dass es auf diese Unterschiede ankommt.\n\nOder anders gesagt:\nDein Freund hat recht.","replies":[]}]}