{"poster":"Jaden101","date":"2016-12-04T23:14:22.484+0000","title":"¿Hay reporte para este tipo de cosas?","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":1,"body":"Acabo de jugar una partida con teemo, donde me hice primera sangre, yo ganaba l&iacute;nea pero el jungla y el mid eran top (literalmente, triple top.). El mid hab&iacute;a ya tirado mid y el jg no s&eacute; porque pero no gankeaba ninguna l&iacute;nea a excepci&oacute;n de top. Estuve contra los 3 desde el min 5 y nadie ven&iacute;a... me cansaba de pedir ayuda y ayuda y nadie ven&iacute;a. En una vienen mi jg (darius) y mi mid (tf) y mueren los dos, y comienzan a hacerme signos de pregunta desde ese momento hasta el final de la partida junto al adc. Es decir, desde el min 17 aprox, hasta el fin de la partida todo el d&iacute;a haciendome se&ntilde;al de signo de pregunta y en cuando me escribieron algo los mutie.\r\n\r\nMe molest&oacute; mucho los siguientes hechos:\r\n\r\n1) Que el mid y el jungla no me ayudaran en mi l&iacute;nea.\r\n2) Que El mid ni me avisara que el mid rival no estaba (as&iacute; yo retroced&iacute;a)\r\n3) Que me hicieran se&ntilde;as toda la partida.\r\n4) Que me dijeran teemo manco cuando yo iba 10/6 de score.\r\n\r\nLos reporte por actitud anti deportiva, abuso verbal y sacrificio intencional (todos fedearon menos el jugla). Y no me lleg&oacute; ning&uacute;n cartel de que riot haya hecho algo...\r\n\r\nPor favor, aquellos que quieran jugar partidas sin troll, agreguenme en LAS, soy Jaden101, saludos\r\n\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Li Grim","date":"2016-12-04T23:23:08.162+0000","up_votes":1,"down_votes":0,"body":"En orden, (3) y (4) son reportables.\n\nYa que no podemos verificar si no ayudaban por que no querían hacerlo, y tampoco podemos asegurar que te querían ver muriéndote. \nCuidado con reportar por sacrificio intencional, porque es muy distinto morir por estar enojado (sin querer hacerlo), que por trollear de verdad.\n\nY por lo que me dices, creo que es lo primero, si estaban tan tilteados debieron despreocuparse de su juego y comenzar a morir más.","replies":[{"poster":"Jaden101","date":"2016-12-04T23:30:19.968+0000","up_votes":1,"down_votes":0,"body":"Perdón culpa mía, mientras yo peleaba contra 3 ponía yo: \"ESTOY CONTRA 333 VENGA ALGUIEN NO PUEDO SOLO\" y darius, jinx y tf me ponían:\n\nY?\nY?\nY?\n\nComo si no les importara y no venían, y luego me pingueaban. Muchas gracias por responder! ¿Cual es el reporte para los pings?","replies":[{"poster":"Li Grim","date":"2016-12-04T23:37:25.744+0000","up_votes":2,"down_votes":0,"body":"Para el spam de señas contra uno, se usa el \"molestia\" que está arriba de abuso verbal.","replies":[]}]},{"poster":"Zevko","date":"2016-12-04T23:30:50.697+0000","up_votes":1,"down_votes":0,"body":"la 3 es reportable? desde cuando ..","replies":[{"poster":"Li Grim","date":"2016-12-04T23:36:45.311+0000","up_votes":2,"down_votes":0,"body":"Hacer señas a un jugador durante toda la partida es acoso y es reportable, a poco es muy agradable que tu personaje se la pase cubierto de señas. ¿O no?","replies":[]},{"poster":"TeamSayori","date":"2016-12-04T23:53:11.957+0000","up_votes":1,"down_votes":0,"body":"aparentemente desde siempre, un rioter me contesto esa duda hace mucho y si, es baneable, quizas no al nivel de flamear, pero lo es","replies":[]},{"poster":"Top Lucian","date":"2016-12-04T23:35:53.101+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=PJAKt7ph,discussion-id=YpzY9j2F,comment-id=00010001,timestamp=2016-12-04T23:30:50.697+0000)\n>\n> la 3 es reportable? desde cuando ..\n\n Cuenta como Actitud Antideportiva (Molestia)","replies":[]}]}]},{"poster":"Sir Crucifix ","date":"2016-12-04T23:21:24.106+0000","up_votes":1,"down_votes":0,"body":"pingeales vos tambien y se callan , es psicologico","replies":[{"poster":"Jaden101","date":"2016-12-04T23:30:40.493+0000","up_votes":1,"down_votes":0,"body":"Eran 3 pingueandome y 4 cuando thresh volvió de estar afk... Me ganaban D:","replies":[{"poster":"TeamSayori","date":"2016-12-04T23:54:02.964+0000","up_votes":1,"down_votes":0,"body":"es que eras teemo, el team enemigo te tenian mania y el tuyo tambien(? xD","replies":[]}]}]}]}