{"poster":"Jaden101","date":"2016-11-14T16:56:49.238+0000","title":"Todos con smite está roto?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Tirar smite a los bichos da vida... todos menos el adc podr&iacute;an ir con smite, esto da muchos beneficios: \r\n\r\n-Imposible de perder dragones/barones.\r\n-Farmeo f&aacute;cil en l&iacute;nea, ya que el subdito grande, o si vas mal, el mega subdito, caer&aacute; mucho mas r&aacute;pido con el smite en fase de l&iacute;neas.\r\n-Cualquiera podr&iacute;a hacer contra jungla y robar un blue o un red\r\n-En invade, si se hizo tarde, en vez de volver a base, solo se smaitea alg&uacute;n bicho y van r&aacute;pido a l&iacute;nea\r\n-En Late, 4 smite son 4000 de da&ntilde;o al baron... esto asegura toda la jungla.\r\n-Hacerse el heraldo f&aacute;cilmente (El jg gankea top a nivel 6 y ya con eso podr&iacute;a hacerse heraldo al tener 2 smite)\r\n\r\nSi trae desventajas:\r\n\r\n-Si se lleva smite no tenes f&aacute;cil escape a gankeos (no flash, salvo el adc) aunque, al tener todos smite, podr&iacute;an hacerse el cangrejo, comprar ping, wardear y evitar muchos gankeos.\r\n-75 segundos de enfriamento.","replies":[{"poster":"Paranoid","date":"2016-11-14T17:15:27.335+0000","up_votes":2,"down_votes":2,"body":"este bronce si se puede ver","replies":[{"poster":"Jaden101","date":"2016-11-14T17:43:54.822+0000","up_votes":2,"down_votes":1,"body":"vos terminaste 2/7 con lissandra, por eso eres bronce? Solo di una opinión, no por eso uno es bronce, es mas, das mucha lástima, porque al ser plata, oro, platino, al menos llevas tiempo en el juego y maduraste algo, pero no, sigues diciendo BRONCE a un nivel 11 que solo quiso aportar una idea y que los demás opinaran nada mas.","replies":[]}]},{"poster":"Sirek","date":"2016-11-14T17:54:22.060+0000","up_votes":1,"down_votes":0,"body":"No funciona por que esa skills. No solo se basa en dragones y barones, claro son objetivos, pero los primordiales son botar las torres, ya que para ganar necesitas destruir el nexo enemigo). \n\n- Si fueran todos con Smite, pierdes muchas habilidades útiles, como el Teleport (Que esa persona tiene presencia global mientras tengan un ward), el ignite (Que ademas de hacer daño, quita efectividad a las curaciones), el Extenuar (Que reduce velocidad de Movimiento, armadura, m. resist y su daño).","replies":[{"poster":"Jaden101","date":"2016-11-14T18:54:24.503+0000","up_votes":1,"down_votes":1,"body":"En eso tienes razón... Pero estoy hablando de un equipo donde los campeones tengan sinergia, por ejemplo:\n\nZED top TP Y SMAITE (la sombra, no necesita de urgencia el flash)\nMID kassadin (Ulti, no necesita flash,  smite y ignaite)\nADC ashe (no lleva smite, curar y flash)\nSUP Bardo (movilidad, stun, ulti para escapar) (smite y extenuar)  (también podría ir aquí leona con la maestría del escudo)\nJG Volibear o Zac ( gran movilidad, es JG, Smite y flash)\n\nLo veo rentable, tenes AD, AP, tanque, ultis que sirven en tf (una flecha de ashe, buena ulti de bardo, zed que deletea, zac o volibear que pueden iniciar)","replies":[{"poster":"Sirek","date":"2016-11-14T19:06:31.155+0000","up_votes":1,"down_votes":0,"body":"Nada esta escrito en el LOL, pero tener a 4 personajes sin flash te quita mucha utilidad. Yo jugaba Shyvanna Top son Ignite y TP, pero es porque tenia medido que hasta LVL 6 no tenia via de escape. Varias veces gane la linea, pero era el blanco favorito del JG enemigo (tenia todo wardeado para poder jugar asi). \n\nSigo insistiendo, nada esta escrito en el LOL, pero a pesar de todo, por algo el Flash es la Skill más usada.","replies":[]},{"poster":"Hell Darking","date":"2016-11-14T19:00:14.837+0000","up_votes":1,"down_votes":0,"body":"entonces lo que dices tu que todo este post solo aplica para gente en premade de 5, porque aca en normales todos juegan el campeon que quieren.. sin importar si tiene sinergia con los demas, si tienen mucho ap, si no hay ap y solo adc, etc","replies":[]}]}]},{"poster":"Salvor","date":"2016-11-14T18:35:30.730+0000","up_votes":1,"down_votes":0,"body":"Yo lo usaría contra mids de desgaste ziggs xerath etc.","replies":[]},{"poster":"rokushoger","date":"2016-11-14T18:03:31.636+0000","up_votes":1,"down_votes":0,"body":"Depende como lo platees:\n\nSi sacas el flash de la ecuación, entonces mantenes todas las ventajas de los demás summoners sumado a las ventajas que pones del smite, pero perdés un montón de movilidad y una forma de escape muy segura. Hay campeones que literalmente no puden dejar esta alternativa.\n\nPor otro lado si planteas todos flash + smite perdés una cantidad de utilidad enorme según la linea de la que hablemos, siendo la más significativa el tp del top.\n\nEs una jugada que la veo viable pero arriesgada, un todo o nada por así decirlo.","replies":[]},{"poster":"Geeik","date":"2016-11-14T17:45:23.520+0000","up_votes":1,"down_votes":0,"body":"no, porque en un momento se vuelve raro ya que:\no te quita un espacio de la skill porque no te compras el item para mejorar smite\nO te quita un espacio de objetos porque lo compras y no completas la build\nno {{summoner:12}} \nque hay con la fase de lineas? el cangrejo no visita la linea para que puedas smitearlo\n{{summoner:14}}  se va haciendo casi imposible 1vs1 con algunos mids","replies":[]},{"poster":"clonmorfo","date":"2016-11-14T17:04:39.527+0000","up_votes":1,"down_votes":0,"body":"buena teoria, probalo y contanos ;)","replies":[]}]}