{"poster":"Evo Moon ","date":"2015-05-21T16:17:48.346+0000","title":"Buildare Shyvana da tank e fare danni","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"io in genere per Shyvana uso questa build:{{item:3022}} {{item:3068}} {{item:3102}} {{item:3143}} {{item:3065}} pi&ugrave; le scarpe situazionali. Ma ora che c&#039;&egrave; la nuova mannaia oscura che ne pensate di metterci la suddetta mannaia al posto del Omen?? O magari consigliarmi una build come tank dameger AD... Grazie in anticipo","replies":[{"poster":"Best Chair Euw","date":"2015-05-21T18:31:08.556+0000","up_votes":1,"down_votes":0,"body":"{{item:3091}}  dipende molto dalla situazione secondo me, non lo definirei core item ( anche se mi piace molto su ww e shyvana). Comunque concordo con le precedenti indicazioni (botr-randuin-visage/banshee etc.)","replies":[]},{"poster":"JollyJack360","date":"2015-05-21T16:57:31.909+0000","up_votes":1,"down_votes":0,"body":"Io non sono un main di shyvana{{champion:102}}, ma nella build non ci starebbe male{{item:3091}}, in quanto offre magic resistant ed attack speed? se non erro la w rimane attiva per ogni auto attacco di shyvana?","replies":[]},{"poster":"Nibbio Bianco","date":"2015-05-21T16:32:51.116+0000","up_votes":1,"down_votes":0,"body":"è bruttina questa build su shyvana. è un campione che per fare danno deve avere attack speed e deve avere abbastanza slow dagli items, in quanto lei non ne ha. I suoi oggetti di base sono {{item:3143}} {{item:3153}}, ma la blade puoi farla anche dopo aver preso abbastanza oggetti difensivi. \n\nSe hai come tuo avversario un campione che fa danno fisico, inizia con {{item:3143}} \nSe hai contro un tank puoi anche iniziare con la {{item:3153}} \nSe hai contro un ap inizia con la {{item:3102}} \nScarpe {{item:3111}} \nAltri ottimi oggetti su shyvana sono {{item:3075}} {{item:3083}} {{item:3190}} ( in caso non dovesse farlo il tank o il support ) {{item:3026}}.\nSe sei feeddato e ti serve ancora più danno, perché il tuo team non ne fa abbastanza, {{item:3172}} \n\nFrozen mallet non funziona bene su shyvana perché non ha cc, ergo se l'avversario scappa non riesci nemmeno a dargli il primo attacco base per slowarlo, e comunque anche se dovessi riuscire a darlo non è un cc molto forte, l'avversario di solito riesce a uscire con facilità da quel tipo di cc, sopratutto quando ne riceverai tu qualcuno. Sunfire cape, ti dà più danno, ma è meglio omen di randuin per l'attiva. Entrambe ti possono far escludere altri oggetti molto buoni dalla build. Spirit visage hai la passiva che non riesci a sfruttarla proprio perfettamente e il cdr non è poi così importante su shyvana, perché riattiva la sua W col contatto e la sua R funziona a furia, quindi te ne fai poco. Black cleaver no, perché anche se è bello ridurre l'armatura all'avversario, non è bello farlo solo con gli attacchi base e sopratutto quando hai un campione basato sui danni misti, si, perché shyvana fa danni misti. Zefiro è una scelta migliore se mai dovessi decidere di fare un altro oggetto offensivo su shyvana, sia perché sfrutta molto bene l'attack speed insieme alla E, che è la mossa più forte di shyvana, sia perché riesci a sfruttare tutte le caratteristiche dell'oggetto, l'importante è se decidessi di farla di non buildare le mercury treads ma bensì le ninja tabi.","replies":[]}]}