{"poster":"rockokok","date":"2015-02-16T03:07:37.275+0000","title":"Supuesto \"arreglo\" de server","subforum":"Problemas Técnicos","up_votes":15,"down_votes":1,"body":"Vengo de 3 dias jugando con lag y mis ms estan en 90 como siempre, en el juego tarda bastante en tirar las habilidades y cuando la tiran hacia mi parece que sigue de largo y despues hace el daño. no se a que se referian a ese \"arreglo del server\" ya que a mi y probablemente a mucha gente le siga andando igual o peor","replies":[{"poster":"FeedMeLumia","date":"2015-02-16T05:27:11.499+0000","up_votes":8,"down_votes":0,"body":"Este server debería estar en fase beta o alpha.","replies":[]},{"poster":"TakingUout","date":"2015-02-16T04:54:30.261+0000","up_votes":8,"down_votes":0,"body":"Es lamentable el estado del servidor, es injugable, juego 1 game bien, 3 con delay, tenes q pasar 2 horas o 4 horas esperando q se arregle... jugas de nuevo seguro vuelve a tener el mismo problema.\nUna vergüenza.","replies":[]},{"poster":"IIIØÜØÜØÜØIII","date":"2015-02-16T03:40:14.163+0000","up_votes":3,"down_votes":0,"body":"Yo en tu caso estoy peor, desde ese \"arreglo\" mi bello ping de 40ms se paso a 157ms fijo y no baja, jamás se desconecta pero a veces observo lo que tu dices que es pérdida de paquetes, cuando tiras dos skills y salen todas juntas después, acá hay un hilo de pronto puedes expresar tu opinión ahí o ver que similitud tienes con muchos usuarios a los que nos pasa lo mismo o peor como dices :( \n\nhttp://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/isLzAueL-inconvenientes-con-proveedor-gigared-sa-masivo","replies":[]},{"poster":"Raptor","date":"2015-02-16T03:09:09.709+0000","up_votes":3,"down_votes":0,"body":"a mi me paso exactamente lo mismo recien en un aram, tuvo q cambiar a mi conexion de speedy (estaba con telecentro) y dps de 5 min se arreglo","replies":[]},{"poster":"Yrox the Third","date":"2015-02-16T20:18:48.469+0000","up_votes":2,"down_votes":0,"body":"No se dan cuenta que hacer lo que Riot esta haciendo es bastante dificil y no es algo que sea de un dia para otro?\nMientras arreglen el server construyendo otro completamente nuevo va a demorar.","replies":[]},{"poster":"devasitas","date":"2015-02-16T19:06:40.902+0000","up_votes":2,"down_votes":0,"body":"Ami 1 de cada 4 juegos no me deja jugarlo, me dice recuperando coneccion y no me deja jugar hasta que se termine la partida, por mas que cierre y vuelva abrir el juego. 2 de cada 4 juegos me anda con delay de 1 a 2 segundos durante toda la partida, y 1 de cada 4 juegos me anda relativamente bien...\nAdemas de que tarda mas de 7 seg en elegir el champion que pickees, 3 a 5 seg para cambiar las maestrias y hechizos..","replies":[]},{"poster":"G H P","date":"2015-02-16T06:34:13.352+0000","up_votes":2,"down_votes":0,"body":"Ahora vendrá riot a decir que es culpa de tu isp","replies":[]},{"poster":"Saínt Tears","date":"2015-02-17T05:34:20.204+0000","up_votes":1,"down_votes":0,"body":"saben que riot va a recompensar a los jugadores de las y lan con 400 rp por las caidas del server ?? yo no me preocuparia tanto los picos de ping son de dia entonces jugas de noche y listo o almeno es lo que yo ago si juego de dia 850 de ping y de noche 100 esa es una solucion temporaria asta que se arregle para mi","replies":[]},{"poster":"VampiroMedicado","date":"2015-02-17T01:19:24.818+0000","up_votes":1,"down_votes":0,"body":"Tanto se quejan, pero yo aprendi a farmear con 200 de ping jaja.","replies":[]},{"poster":"xTro74n","date":"2015-02-16T18:20:43.864+0000","up_votes":1,"down_votes":0,"body":"yo vengo experimentando lag desde el viernes, soy del norte de Argentina.","replies":[]},{"poster":"JulianaAnywhiter","date":"2015-02-16T11:48:07.173+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa que entro a normal o nemesis y entro con 0 fps,despues suben a lo normal que tengo siempre,que al parecer desde unas semanas es 20 D:... pero cada vez que vuelvo a base los y abro la tienda se traba y baja a 0,y si se traba demaciado el juego crashea y me sale algo de que \"la memoria no se pudo leer\" y tengo que volver a abrir.{{champion:32}} {{item:3151}}","replies":[]},{"poster":"Greiz","date":"2015-02-16T08:28:23.583+0000","up_votes":1,"down_votes":0,"body":"No se pero ya me sancionaron por afk xD traigo 2 horas de sancion si abandono una partida jajajjaa xd","replies":[]},{"poster":"Ojota Voladora","date":"2015-02-16T19:57:11.074+0000","up_votes":1,"down_votes":1,"body":"inhumano jugar con picos de 850 de ping... lo arreglaron por 2-3 dias... q verga loco","replies":[]},{"poster":"MrUsu","date":"2015-02-16T15:33:06.464+0000","up_votes":2,"down_votes":2,"body":"Ya se avisó que aun estaban en pruebas, que para unos funcionaría y otros aún verían el problema ¿Acaso nadie lee los post de los RIOTERS? Yo ando jugando con 225 ping (mi normal era 150 a 170) hasta la semana pasada me iba pesimo (retraso de skills en momentos cruciales o reconectado al servidor) pero el fin de semana que me puse a jugar por el PI x 2, me fui bien, la misma cantidad de ping pero podía jugar bien) Todo es un proceso, no esperen que todo salga de la noche a la mañana.","replies":[]}]}