{"poster":"Crank Machine","date":"2016-05-02T00:27:18.394+0000","title":"Silver climbing.","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":0,"body":"So basically im stuck in silver. And i know its my fault etc. I do try every game and i just struggle to reach lategame without their wholeteam being really fed. I make many mistakes and get full of myself.  But honestly need help with climbing. I enjoy getting better at the game and im open to all advice :D\r\nFeel free to chuck me some advice. Critizism is welcome :)\r\nI got to silver 3. And now im s5 haha fun.","replies":[{"poster":"Ingénue","date":"2016-05-02T02:17:48.097+0000","up_votes":2,"down_votes":0,"body":"Add me ingame and I can spectate a couple of your matches and give you a play-by-play analysis on how to improve :D\n\n* **A quick review of your match history shows me that you like to fill**. This is completely understandable, as it lowers your queue times and you don't get bored of playing the same role over and over again. Unfortunately, filling roles isn't very conducive to climbing because you become a jack of all trades, master of none. There aren't any champs or roles you will know like the back of your hand. \n\n>Dynamic queue allows you to choose two roles, so you have 100% chance of getting of your fave/best roles. Pick up a few comfort champs in each, learn all there is to know about them so you know things like build paths and matchups like the back of your hand. Fill is your worst enemy. Leave filling roles to normals. If you really want, you can switch your main roles every couple of months so you don't die of repitition.\n\n* **Sometimes your CS is great, other times if leaves a bit to be desired** (probably due to switching roles all the time). \nHappens to all of us, but with a bit of work, your CS can start to become pretty consistent (more cs=more gold= more damage= more wins).\n\n>>Here is a specific guide to [CS](http://imgur.com/orWUCKH). While you're at it, why not spend some time to brush up on other important league skills such as:  [warding](http://www.mobafire.com/league-of-legends/build/support-guide-map-control-warding-344910), positioning, [teamcomps](http://www.liquidlegends.net/forum/lol-strategy/476270-picks-and-bans-understanding-team-compositions), and [being a nice person and encouraging your team](http://gameinfo.na.leagueoflegends.com/en/game-info/get-started/summoners-code/). If you need help with some of this, you could[ consider hiring a coach](http://www.lol-coaching.com). \n\n>Unfortunately, [my favourite analysis site](http://chess.egg-one.com/lolprofiler) isn't working when I enter your summoner, but when I compared us it did. From what I can see your ward clearing is great, so is your warding in general. \n\n>If you look over [on this site](http://oce.soloq.gg) you can see how you feared against different lane matchups, and maybe look to practice some skills related to that (like dodging things).\n\n* ** Be super aware of your improvements, strengths and weaknesses by keeping track **\n\n>Most of my improvement comes from my ranked diary. After every game I write down who I was playing, my score, CS, wards placed, LP gained/lost and a quick summary of the game. I also like to write down 3 things I did well, and 3 things I need to improve. That way, you are really processing the game and learning from your mistakes. It also gives you something to consciously work towards improving in the next game. \n\nLastly, \n\n*** Join a premade team.**\n\n>Playing as a ranked 5 will definitely lessen your chances of being matched with trollers/afks/other toxins. It also allows you to become familiar with the play patterns of your teammates (so you don't have to keep adjusting your style every game) and you have way better communication. With the implementation of a dynamic queue where this is possible, there is literally no reason not to. You also get lots of cool bonuses like extra IP, mastery points and Hextech stuff.","replies":[{"poster":"Bad Bandit","date":"2016-05-02T06:31:10.464+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Princess Yaia,realm=OCE,application-id=FjGAIbRv,discussion-id=hzm5Z6V5,comment-id=0001,timestamp=2016-05-02T02:17:48.097+0000)\n>\n> Add me ingame and I can spectate a couple of your matches and give you a play-by-play analysis on how to improve :D\n> \n> * **A quick review of your match history shows me that you like to fill**. This is completely understandable, as it lowers your queue times and you don&#x27;t get bored of playing the same role over and over again. Unfortunately, filling roles isn&#x27;t very conducive to climbing because you become a jack of all trades, master of none. There aren&#x27;t any champs or roles you will know like the back of your hand. \n> \n> * **Sometimes your CS is great, other times if leaves a bit to be desired** (probably due to switching roles all the time). \n> Happens to all of us, but with a bit of work, your CS can start to become pretty consistent (more cs=more gold= more damage= more wins).\n> \n> * ** Be super aware of your improvements, strengths and weaknesses by keeping track **\n> \n> Lastly, \n> \n> *** Join a premade team.**\n\nAre you a girl?","replies":[{"poster":"Fitzky","date":"2016-05-02T14:34:38.373+0000","up_votes":2,"down_votes":0,"body":"Hi I'm a grill add me for some wholesome slow cooked beef :)","replies":[]},{"poster":"RonyStark","date":"2016-05-02T07:00:45.964+0000","up_votes":1,"down_votes":0,"body":"The reply above is so relevant to the thread.. just like this reply\nOops.. sorry my finger was slipped clicking the down arrow","replies":[{"poster":"Bambooze","date":"2016-05-02T09:34:21.831+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-rainbows}} Savage","replies":[]}]}]}]},{"poster":"RonyStark","date":"2016-05-02T06:59:58.039+0000","up_votes":1,"down_votes":0,"body":"The best way to evaluate you is for you to evaluate yourself\nThis can be done by watching your own replay.\n\nPay attention to the part where you died.\nAsk yourself\nWhat can be improved?\nWhat should I do in that situation if it happens again next time?\n\nYou cant keep expecting for others to carry you.\nIf you play carry champs, you have to carry the scrubs\nLearn from mistakes, climb higher.","replies":[{"poster":"Crank Machine","date":"2016-05-03T05:04:11.446+0000","up_votes":1,"down_votes":0,"body":"its not i expect to be carried, just some advice to climb :D","replies":[{"poster":"RonyStark","date":"2016-05-03T08:10:33.095+0000","up_votes":1,"down_votes":0,"body":"The sure-way to climb is to carry the team\nThat way you dont rely on your team. You lead the team, your team rely on you","replies":[]}]}]},{"poster":"Hansoy","date":"2016-05-02T02:00:29.803+0000","up_votes":1,"down_votes":0,"body":"How old are you?","replies":[{"poster":"Crank Machine","date":"2016-05-03T05:01:39.917+0000","up_votes":1,"down_votes":0,"body":"im 18 :D","replies":[]}]},{"poster":"Main Line","date":"2016-05-02T13:08:36.141+0000","up_votes":1,"down_votes":0,"body":"Goat, stick with the AusDave team. Don't give up so easily after a few defeats!","replies":[]},{"poster":"WE WUZ KINGZ","date":"2016-05-02T05:51:44.406+0000","up_votes":1,"down_votes":0,"body":"Provisionals put me on S5. Climbed to S3. Dropped to S5 again. I'm back to S3 now. #silverlife","replies":[]}]}