{"poster":"Camílo ","date":"2018-11-19T00:28:41.615+0000","title":"Problemas con League of voice","subforum":"Jugabilidad, balance y narrativa","up_votes":1,"down_votes":0,"body":"Hola ! tengo un problema muy específico con league of voice y mi ordenador, y quería ver si alguien me podía ayudar. \r\nResulta que juego desde un macbook, hasta hace cerca de un mes usaba el league of voice con total normalidad, pero resulta que salió hace poco una actualización para Mac os (el software de Mac) y actualicé mi computador.\r\n\r\nLuego de actualizar mi computador, league of voice dejo de funcionarme. Revisando en la configuración me di cuenta de que la aplicación del LOL no tiene acceso al micrófono de mi macbook, pero tampoco se está solicitando, es decir no puedo autorizar porque el LOL no busca los permisos para acceder al micrófono de mi ordenador.  Por tanto puedo recibir sonido, pero no emitir.\r\n\r\nSi alguien (aunque dudo) le ha pasado lo mismo, o sabe de Macbooks, porfavor ayuda :(    (sé que existen otras plataformas para comunicarse durante el juego -discord,ts3,etc-, pero quiero solucionar esto).","replies":[{"poster":"HellFishDark","date":"2019-04-20T07:44:09.044+0000","up_votes":1,"down_votes":0,"body":"Yo tengo el mismo problema y encontré una solución temporal ahora.\nHay que abrir el cliente del juego mediante la consola y poner 2 dos comandos, luego que uno se fija si funciona el micrófono ya se puede cerrar la consola. La primera vez va a saltar un cartel preguntando si la Terminal puede usar el micrófono, le dan que sí.\nA mí me funciona incluso con el Discord abierto, el único embole es tener que abrir el juego siempre con esos comandos en la terminal, ya que una vez que cerres el cliente deja de funcionar si se abre de la forma usual sin la terminal.\n\nSolucion al micrófono que no funciona en el chat de voz con Macbook Pro y Mojave\n\nSolución temporal del problema iniciando el juego desde la terminal:\n1. Abra la \"Terminal\"\n2. Copie los siguientes comandos en el terminal y presione enter después de cada uno de ellos:\n\n2.1 cd '/ Aplicaciones / League of Legends.app/Contents/LoL/'\n2.2 ./LeagueClient.app/Contents/MacOS/LeagueClient\n2.3 Ahora debes abrir automáticamente el cliente LoL\n\nInicie sesión con sus datos de inicio de sesión\nIr a la configuración de voz LoL\n4.1 Debería ver una ventana emergente de Mac que le pide que permita que la Terminal use el micrófono;\n4.2 Haga clic en \"SI\" ¡Disfrute! Repite los pasos 1 y 2 cada vez que quieras jugar LoL\n\nEspero que les funcione y que RIOT se ponga las pilas y solucione el problema que ya van varios meses con este problema.","replies":[]},{"poster":"ReDwaT","date":"2018-11-19T00:33:52.610+0000","up_votes":1,"down_votes":0,"body":"Hola Camílo, te dejo información que encontré buscando por internet, espero te sirva!\n\nPaso 1\nHaz clic en el icono de \"Preferencias del Sistema\" en el Dock para abrir las Preferencias del sistema. Como alternativa, también puedes acceder a tu sistema de preferencias a través de tu carpeta \"Aplicaciones\" o en el menú \"Apple\" en la esquina superior izquierda de la pantalla.\n\nPaso 2\nHaz clic en el panel \"Seguridad\", bajo el título \"Personal\".\n\nPaso 3\nHaz clic en la pestaña \"Firewall\" y luego haz clic en \"Configurar acceso a servicios y aplicaciones específicos\" si no tienes esta opción activada.\n\nPaso 4\nHaz clic en el icono \"+\", que se encuentra justo debajo de la ventana de la lista de aplicaciones y servicios autorizados.\n\nYa en este paso deberías buscar la aplicación del micrófono y permitir el acceso\n\nSaludos!","replies":[{"poster":"Camílo ","date":"2018-11-20T18:43:27.521+0000","up_votes":1,"down_votes":0,"body":"Gracias por responder, lo intenté de esa forma dado tu comentario, pero no resulto :(. gracias de todas maneraas","replies":[]}]}]}