{"poster":"Deycide","date":"2016-10-25T22:37:17.953+0000","title":"You know you played support well when...","subforum":"Memes & Games","up_votes":141,"down_votes":0,"body":"you receive a friend invite from the enemy adc","replies":[{"poster":"Ben Sharpio","date":"2016-10-26T00:13:48.565+0000","up_votes":26,"down_votes":4,"body":"Or because you're a Janna main and the ADC wants freelo","replies":[{"poster":"rtbf225618241","date":"2016-10-26T11:04:21.546+0000","up_votes":4,"down_votes":1,"body":"As a Janna main, you'd have to have a pretty good Adc if you want free elo on her.","replies":[{"poster":"LEEROY KLEDKINS","date":"2016-10-26T15:56:25.146+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LightTrack,realm=EUW,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=00000002,timestamp=2016-10-26T11:04:21.546+0000)\n>\n> As a Janna main, you&#x27;d have to have a pretty good Adc if you want free elo on her.\n\nI agree on this.\n\nas a janna main among many other supports I main you still need a good adc.\n\nOh the amount of times I've told my adc that i've seen the enemy top laner/mid or predicted or saw a jungler gank then 10s later my adc dies because he didn't pay attention.\n\nWhats nearly just as bad is when my adc or top or mid laner (thats right im talking to you riven and yasuo mains) engages 2v2..... when i have no mana\n\nAs of ranked games it pretty much takes up about 10% of the games i play in league and in silver 2 almost silver 1 I will only play ranked if im in a super happy go lucky mood I will even go as far as to virtual hug or type \"<3\" or \"Dont worry, I still like you.\" just so that one salty loser on my team can turn his frown upside down.\n\nAnd yes it works.\n\nSupport mains should consider giving positive morale for players to make em feel better.","replies":[{"poster":"Votable Jester","date":"2016-10-26T21:17:04.833+0000","up_votes":3,"down_votes":0,"body":">Whats nearly just as bad is when my adc or top or mid laner (thats right im talking to you riven and yasuo mains) engages 2v2..... when i have no mana\n\nI think they just forgot what mana was.","replies":[]},{"poster":"Dolasaur","date":"2016-10-26T23:47:22.436+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RumbleMyBunghole,realm=EUW,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=000000020001,timestamp=2016-10-26T15:56:25.146+0000)\n>\n> I agree on this.\n> \n> as a janna main among many other supports I main you still need a good adc.\n> \n> Oh the amount of times I&#x27;ve told my adc that i&#x27;ve seen the enemy top laner/mid or predicted or saw a jungler gank then 10s later my adc dies because he didn&#x27;t pay attention.\n\nI really love it when I'm duoing with someone who's streaming and stuff like that happens. I happen to check minimap at a good time and say \"Annie just left mid heading towards bot...\" in voice chat.  I start backing off, and then do a danger ping when a ward near dragon spots Annie again. 10 seconds later ADC is blaming me for not telling him Annie was MIA.\n\n30 minutes later I'm like \"watch your stream\".  Feels soooooo good.","replies":[{"poster":"LEEROY KLEDKINS","date":"2016-10-29T21:25:57.431+0000","up_votes":1,"down_votes":0,"body":"I know its annoying.\n\nIronicly as someone who is decent at adc i tend to watch the map and fog a bit too much.\n\nI kind of have that support mentality more than the adc mentality which means i miss cs but at least it prevents me from dying to mid.","replies":[]}]},{"poster":"rtbf225618241","date":"2016-10-27T04:37:08.081+0000","up_votes":1,"down_votes":0,"body":"Janna's designed to carry the entire team not just one person by keeping everyone alive and engaging/disengaging.\n\nThe most annoying thing in relation to this is when my team fights without me because they think they are stronger than they really are when they were stronger because of me earlier and are walking to death now.\n\n\"sigh\"","replies":[{"poster":"LEEROY KLEDKINS","date":"2016-10-29T21:22:53.027+0000","up_votes":1,"down_votes":0,"body":"Well (Rolls eyes takes deep breath and exhales in dread) you know well that adcs absolutely hate it when a support carries the adc.\n\nI try to not kill steal but i have to secure the kill but you know how adcs still hate it even if you secure it when the enemy adc is out of his/her reach and your ally doesn't have any flash or mobility set skills to get that kill.\n\nBut yeah I feel you on this.\n\nSupporting ain't easy to keep on doing.","replies":[]}]}]},{"poster":"Onkel Malte","date":"2016-10-26T14:53:05.231+0000","up_votes":2,"down_votes":1,"body":"I got from Bronze 3 to Gold 1 this season with Janna only.\nShe's super strong unless your carry suicides hard.","replies":[{"poster":"Ethan Allen","date":"2016-10-26T17:34:05.272+0000","up_votes":2,"down_votes":0,"body":"You are literally playing a game of Who's Your Daddy?\nYou have to nuetralize every threat and watch them at all times. And never leave their side","replies":[{"poster":"Samflash3","date":"2016-10-27T02:56:26.524+0000","up_votes":1,"down_votes":0,"body":"_blue cars spawn for no reason_","replies":[]},{"poster":"RainbowIcee","date":"2016-10-26T22:16:22.775+0000","up_votes":1,"down_votes":0,"body":"It's really hard to fight off a baby sitting janna but it's easy to punish by roaming and side ganking other lanes and coming back beefy enough to beat them up after.","replies":[]},{"poster":"Onkel Malte","date":"2016-10-26T21:44:23.126+0000","up_votes":1,"down_votes":0,"body":"It really is babysitting at it's finest. \nAlways trying to keep all your babies safe!!\nAnd if you succeed and they are vicotrious in a brawl you feel really really proud even though they think they did that all on their own.","replies":[]}]}]}]},{"poster":"Yooba","date":"2016-10-26T02:45:53.260+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=l   Sion Bot   l,realm=NA,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=0000,timestamp=2016-10-26T00:13:48.565+0000)\n>\n> Or because you&#x27;re a Janna main and the ADC wants freelo\n\nlol","replies":[]},{"poster":"Rorana","date":"2016-10-26T16:32:33.248+0000","up_votes":1,"down_votes":0,"body":"or they want to hop on that {{champion:43}} support freelo train\n\n[proof](http://na.op.gg/summoner/userName=zynri)","replies":[{"poster":"Masala Chai","date":"2016-10-27T13:38:45.494+0000","up_votes":1,"down_votes":0,"body":"Tank Karma Best Karma.","replies":[]}]},{"poster":"5000000000000000","date":"2016-10-26T14:34:56.984+0000","up_votes":1,"down_votes":0,"body":"I picked up Janna recently to climb and I keep getting S ranks.","replies":[]},{"poster":"Dracocrash","date":"2016-10-26T10:36:57.912+0000","up_votes":1,"down_votes":0,"body":"lol yeah, whenever i was tilted i took a break from my freelo junglers (amumu/skarner/warwick) and played janna","replies":[]}]},{"poster":"No flash no life","date":"2016-10-26T02:39:15.983+0000","up_votes":17,"down_votes":0,"body":"that happened to me once after I left post game lobby\n\n...and the enemy adc proceeded to accuse me of hacking and scripting, then unfriended me.\n\n{{item:3151}}","replies":[{"poster":"Velzard of Koz","date":"2016-10-26T10:40:21.933+0000","up_votes":9,"down_votes":0,"body":"If someone falsely accuses you of scripting, that should be actually considered compliment.\nThat is... If we assume you didn't script ( ͡° ͜ʖ ͡°)","replies":[{"poster":"3tyson","date":"2016-10-26T14:11:11.718+0000","up_votes":2,"down_votes":0,"body":"ikr its like that time you walk into the gym and some new kiddo accusses you of steroids \n\nwhile you all natural considering to use steroids cause you feel small\n\nall of a sudden not that smal aint i!!!! :p","replies":[]},{"poster":"PaladinNO","date":"2016-10-26T16:00:29.729+0000","up_votes":1,"down_votes":0,"body":"I was sent a friend invite from an enemy too once, after we had won the game...but he only wanted to say \"fcking random nice ending 5v4... sucker and boosted\".\n\nMind you, this was an ARAM game. And the guy saying this was [Diamond V](http://www.lolking.net/summoner/eune/26205523) (while I was Gold V).\n\nSo...isn't that like a compliment (and a major contradiction)? I mean, if I was a boosted sucker, playing with an MMR way above my real skill level, shouldn't _they_ have easily won?\n\nAnd I never saw any leavers on their team, except for the last 20 seconds when we already were pushing down their Nexus.\n\nLooking at his profile in the client now, he has 0 honour points. Go figure.\n_...I really hope he's managed to make himself ineligible to get the season rewards._\n","replies":[]}]},{"poster":"Wensless","date":"2016-10-26T12:50:10.817+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=No flash no life,realm=NA,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=0002,timestamp=2016-10-26T02:39:15.983+0000)\n>\n> that happened to me once after I left post game lobby\n> \n> ...and the enemy adc proceeded to accuse me of hacking and scripting, then unfriended me.\n> \n> {{item:3151}}\n\nI think being accused of hacking when youre actually not is something every gamer should aspire to. So far it's happened to me twice in League and once in Tribes: Ascend","replies":[{"poster":"Elq","date":"2016-10-26T13:43:19.091+0000","up_votes":1,"down_votes":0,"body":"upvote for tribes: ascend","replies":[]}]},{"poster":"Deycide","date":"2016-10-28T17:29:39.297+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No flash no life,realm=NA,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=0002,timestamp=2016-10-26T02:39:15.983+0000)\n>\n> that happened to me once after I left post game lobby\n> \n> ...and the enemy adc proceeded to accuse me of hacking and scripting, then unfriended me.\n> \n> {{item:3151}}\n\nahahah good one","replies":[]}]},{"poster":"Unstoppable Monk","date":"2016-10-26T03:12:28.598+0000","up_votes":4,"down_votes":0,"body":"You know you played Singed well when you get reported by the enemy ADC after winning a game.","replies":[]},{"poster":"Venomar","date":"2016-10-26T02:54:35.964+0000","up_votes":4,"down_votes":0,"body":"I added a gift Thresh one time becuase we clicked and we both went aggro at the same time and played off each other and got fed and carried together and he called me a noob.   \n\nGranted he was plat,  and I'm a lowely silver,  but it was just norms bruh.  \n\nFeelsbadman.","replies":[]},{"poster":"Lord Galvatron","date":"2016-10-26T16:03:12.393+0000","up_votes":3,"down_votes":0,"body":"Or when your adc does't flame you, Jk, your adc will flame you anyway. \n\n#supportlife","replies":[]},{"poster":"ThePikol","date":"2016-10-26T12:58:38.710+0000","up_votes":3,"down_votes":0,"body":"Once enemy team agreed that I (Soraka) carry my team. Best moment ever :D","replies":[{"poster":"Robert Smith","date":"2016-10-26T14:06:35.339+0000","up_votes":1,"down_votes":0,"body":"Enemy agreed I carried when I stole Baron as Soraka","replies":[{"poster":"It Hertz When IP","date":"2016-10-26T15:55:20.059+0000","up_votes":1,"down_votes":0,"body":"Please tell me it was with a banana.","replies":[{"poster":"Robert Smith","date":"2016-10-26T16:11:09.176+0000","up_votes":1,"down_votes":0,"body":"It was with Q, But i had the Order of the Banana skin on.","replies":[{"poster":"It Hertz When IP","date":"2016-10-26T19:40:13.860+0000","up_votes":2,"down_votes":0,"body":"Not the same, but almost there.","replies":[]}]}]}]}]},{"poster":"Kynami","date":"2016-10-26T02:24:53.232+0000","up_votes":5,"down_votes":4,"body":"Or when three of the enemy team are telling your ADC in the post game lobby that the only reason that they won was their support carried them. (Boy did I surprise an Ori mid by roaming as Zyra after first back and successfully killing her that particular game.)","replies":[{"poster":"SpecterVonBaren","date":"2016-10-26T02:36:50.990+0000","up_votes":10,"down_votes":17,"body":"That's really not saying much of anything, you played Zyra, she's not a support even if she's partnered with the ADC, she's a mage that can function on a low gold income while still dealing tons of damage.\n\nCarrying with an ACTUAL support like Nami or Thresh or Alistar while building supportive items and doing so well at it that the enemy team notices is a genuine accomplishment that should be praised, doing that because you took Brand or Zyra or Vel'Koz bot lane and snowballed out of control with all your damage is nothing compared to that.","replies":[{"poster":"Kynami","date":"2016-10-26T02:57:59.245+0000","up_votes":11,"down_votes":4,"body":"Zyra not a support? Suppose you're going to try claiming Morgana isn't a support either with that line of thinking. She has CC, she has zone control, she can peel, she yes indeed does have damage... but so does even Janna if she knows how to properly harass using her shield.\n\nAll I really had by the end of that game was ~45 flat MR pen from runes, masteries, guise and sorc boots and a giants belt on top of my bog standard AP sightstone and pink.\n\nI've gotten similar comments when I've been up 9 kills on Sona by the end of the game because they positioned badly early on when at that sweet 30% mark that begs for a AA-Q-AA+Powerchord handing out first blood. And yes I indeed have items like {{item:3174}} on board for the extra healing for allies. Not to mention taking me to 45% CDR cap for team fight shields for days.\n\nSupport is NOT only restricted to champions that are strictly labeled as support.","replies":[{"poster":"SpecterVonBaren","date":"2016-10-26T03:16:45.869+0000","up_votes":7,"down_votes":14,"body":"Zyra isn't a support though. She's not picked to support someone, she's picked to deal damage, your second comment...\n\n\"All I really had by the end of that game was ~45 flat MR pen from runes, masteries, guise and sorc boots and a giants belt on top of my bog standard AP sightstone and pink.\"\n\n...says it all, you didn't build support, you weren't there to protect your allies, you were there to deal tons of damage and outright kill the enemy yourself, that's not a support, that's a carry. That is not the same as Sona who can't solo carry a game with damage because most of her power is in her heal, shield, ally empowered auto, slow, speed boost, and stun. Her being able to deal damage is a nice benefit in addition to her utility.\n\nI play Tahm a lot and he can deal a hefty amount of damage himself, but that isn't why I pick him bot lane, I pick him because of his utility, his ability to deal damage is a supplement to his utility and on a support income he can't solo carry a game JUST by being a damage threat.\n\nA support is not a carry that happens to have gone bot, a support is someone that enables their allies to be the carries by protecting and empowering them.","replies":[{"poster":"Kynami","date":"2016-10-26T04:20:44.842+0000","up_votes":5,"down_votes":0,"body":"They had Darius, Lee Sin and had already picked Blitz. Now the little thing about Blitz is either you pick a tank that can turn his hook into a free engage *or* you play a very heavy poker with CC that punishes his attempts. And I'll freely admit that I don't prefer playing tanks for the most part. But picking Janna, Nami, or Soraka into Blitz with a Lee also in the mix is mostly just asking for trouble. Morg's black shield is only good for one target, one Lee Sin kick or Blitz hook on the unprotected target and you still have problems. Zyra has a far larger radius of control because of the range at which you can summon plants and the passive sprinkling seeds both in front and behind you. Zyra is also extremely good at punishing engages... which their team really wants to do considering they also have Ori with three viable ball delivery options.\n\nI say again, support is more than just those directly labeled as support. And with a mere 65 AP I sure wasn't building for full damage. The Rylais I was aiming for eventually with the giants belt was because slows across all abilities immensely improves both catches and peel potential. Also go look at Champion.gg the common core build actually *is* your sightstone, sorc boots, guise/liandrys, rylais...","replies":[]},{"poster":"TeCoolMage","date":"2016-10-26T12:17:08.927+0000","up_votes":3,"down_votes":0,"body":"boys we got a support elitist here. Take him down.\n\nPS. cc = enabling.","replies":[{"poster":"Odinakos","date":"2016-10-27T07:11:56.779+0000","up_votes":1,"down_votes":0,"body":"More like support purist. \n\nOr a classic salty ~~Vayne~~ adc that hates when his support is doing more damage than him. While providing utility and sight.","replies":[]}]},{"poster":"Oleandervine","date":"2016-10-26T11:21:07.212+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=SpecterVonBaren,realm=NA,application-id=Ir7ZrJjF,discussion-id=oMeaqZcE,comment-id=0001000000000000,timestamp=2016-10-26T03:16:45.869+0000)\n>\n> Zyra isn&#x27;t a support though. She&#x27;s not picked to support someone, she&#x27;s picked to deal damage, your second comment...\n> \n> &quot;All I really had by the end of that game was ~45 flat MR pen from runes, masteries, guise and sorc boots and a giants belt on top of my bog standard AP sightstone and pink.&quot;\n> \n> ...says it all, you didn&#x27;t build support, you weren&#x27;t there to protect your allies, you were there to deal tons of damage and outright kill the enemy yourself, that&#x27;s not a support, that&#x27;s a carry. That is not the same as Sona who can&#x27;t solo carry a game with damage because most of her power is in her heal, shield, ally empowered auto, slow, speed boost, and stun. Her being able to deal damage is a nice benefit in addition to her utility.\n> \n> I play Tahm a lot and he can deal a hefty amount of damage himself, but that isn&#x27;t why I pick him bot lane, I pick him because of his utility, his ability to deal damage is a supplement to his utility and on a support income he can&#x27;t solo carry a game JUST by being a damage threat.\n> \n> A support is not a carry that happens to have gone bot, a support is someone that enables their allies to be the carries by protecting and empowering them.\n\nYou are quite *wrong.* Sheer utility is not the only means of supporting your ADC. There exist such a thing called poke supports, and these champion support their ADC by aggressively poking down enemy HP and either set up kills or drive them from the lane. Sona functions almost exclusively as a primary poke support, and in fact, her build paths usually begin with Spellthief, combine it into the Eye, and then she goes Luden's Echo and pretty much an AP build to poke down enemies. Zyra, Karma, and Morgana also build in this fashion. You can still lend aid to your allies with your CC that's in your spells and/or your shielding, but your primary source of assistance is your damage dealing potential in combat. Do not underestimate or knock poke supports if you cannot understand and appreciate their role in the game.","replies":[{"poster":"Odinakos","date":"2016-10-27T07:10:36.474+0000","up_votes":1,"down_votes":0,"body":"And its not like Zyra (or any other ap support) dont have a good chuck of utility. I mean an aoe root, zoning plants and a gtfo zone that can split or royaly screw enemies is a decent amount of utility.","replies":[]}]}]}]}]}]},{"poster":"Maiziea","date":"2016-10-26T03:05:33.598+0000","up_votes":2,"down_votes":0,"body":"I got added by the enemy support a couple of times lol, never thought about it that way tho :P.","replies":[]},{"poster":"Champlooge","date":"2016-10-27T21:34:57.990+0000","up_votes":1,"down_votes":0,"body":"(bans janna as hates her low impact freelo)","replies":[]},{"poster":"Reket DeAlk","date":"2016-10-27T02:57:52.969+0000","up_votes":1,"down_votes":0,"body":"Well now I have a new goal next time I play.","replies":[]},{"poster":"GULAG 4 U","date":"2016-10-26T23:37:43.051+0000","up_votes":1,"down_votes":0,"body":"I thought supports were always playing perfeclt and simply aren't allowed to be blamed for anything?","replies":[]},{"poster":"Evetiger22","date":"2016-10-26T05:25:11.620+0000","up_votes":1,"down_votes":1,"body":"You get mystery gifted other support champions.","replies":[{"poster":"Flashes","date":"2016-10-26T21:39:31.976+0000","up_votes":1,"down_votes":0,"body":"I got gifted by a person based off of my username, and got Noxus Poppy qq\n\n\n\nMy mind went:\n\"But i already had lollipo...\"\n\"SHUT UP ITS A SKIN\"","replies":[]},{"poster":"Gary B Enkelis","date":"2016-10-26T16:20:47.174+0000","up_votes":1,"down_votes":0,"body":"I think they're telling you to stop one tricking and play something with skill. Kidding.","replies":[]}]}]}