{"poster":"TSH Pharynx","date":"2015-02-22T19:49:22.730+0000","title":"Eingespielte Botlane sucht Team/Clan [Plat2]","subforum":"Clans & Teams","up_votes":2,"down_votes":2,"body":"Hallo,\nMein Name ist Dustin, ich bin 18 Jahre jung und komme aus dem schönen (?) NRW.\nMein DuoQ-Partner und ich sind jetzt schon lange auf der Suche nach einem Clan/Einem Team, der/das Lust hat uns aufzunehmen, da der Clan in dem wir jetzt sind, nur aus Just4Fun Spielern besteht, und wir auch gerne mal etwas ernster Spielen wollen, außerdem befinden sich in unserem aktuellen Clan nur Spieler im Bereich von Silber 5 bis Gold 5(Ca. 90%).\nWir suchen hiermit ein Team, dass sich auf unserem, oder auf einem höheren Level bewegt, um besser zu werden.\n\nWir spielen seit Ca. einem Jahr zusammen und am liebsten auf der Botlane.\nDabei übernehme ich die Rolle des ADC und mein Kollege Supportet mich.\n\nWir sind sehr Kooperativ und Teamfähig und würden gerne noch mehr über LoL lernen.\nAußerdem besitzen wir beide TS3 und ein funktionierendes Headset mit guter Sprachqualität\n\nHier noch ein paar Hardfacts:\n\nIGN: Pharynx\nRolle: ADC\nChamps: Draven, Lucian, Graves\nElo: Plat 2\n\nIGN: Hi im Jàba\nRolle: Support\nChamps: Leona, Thresh, Blitzcrank\nElo: Plat 2\n\nIm Voraus schon mal Danke für eure Antworten :)\n\nPeace,\nPharynx & Hi im Jàba","replies":[{"poster":"BG PikaGirl","date":"2015-02-23T18:41:58.453+0000","up_votes":2,"down_votes":0,"body":"hey ich bin Sven und mein Team heißt \"Dreams\"\nunser Clan existiert seit Season 3 und wir spielen im High Plat Bereich.\nWir nehmen auch öfter an einigen Turnieren teil, kamen bis jetzt aber noch nicht so weit.\nLeider hat uns unsere Botlane verlassen müssen und nun sind wir auf der Suche nach neuen Mitspielern.\nEure Facts klingen schon mal ganz gut, vielleicht kann man sich mal persönlich darüber unterhalten.\nKann mir vorstellen, dass dies was werden kann wenn ihr persönlich auch in Ordnung seid.\nKönnt mir ja mal schreiben. \n\nLG","replies":[]},{"poster":"New 3ra","date":"2015-02-23T03:45:23.122+0000","up_votes":2,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/MBEsA989-neugegrandetes-5-on-5-team-sucht-verstaarkung","replies":[]}]}