{"poster":"Skydago","date":"2015-08-22T19:20:40.886+0000","title":"Ragazzi sapete che succede?","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Ragazzi da poco ho riscontrato un problema col client. Ogni volta che la connessione crasha momentaneamente, mi da la solita schermata \"tentativo di riconnessione\". Quando ritorna la connessione nella partita continua ad esserci la scritta \"tentativo di connessione\". Allora decido di uscire e rientrare dal client, ma ora non mi fa fare neanche il caricamento. E continua cos&igrave; finch&egrave; non riavvio il pc.\n1. la connessione non pu&ograve; essere perch&egrave; comunque mi fa aprire google e youtube\n2. il pc non &egrave; perch&egrave; me lo ha fatto sia con il mio vecchio portatile che con il nuovo fisso.\nNel mio vecchio pc avevo windows 8, mentre nel nuovo ho windows 8.1. Sapete come posso risolvere il problema?\nNo, perch&egrave; mi sono preso ben da 5 partite in coda a bassa priorit&agrave; da 20 minuti pi&ugrave; volte per colpa di questo errore del client, e nom vorrei conseguisse un ban.","replies":[{"poster":"Wigur","date":"2015-08-23T12:17:03.074+0000","up_votes":1,"down_votes":0,"body":"A me ieri il champ ad un certo punto non si muoveva più in 3 partite su 3 , ma la partita andava avanti senza problemi . Dopo un 10-20 secondi crashava. Certe volte si risolve subito e altre volte no.","replies":[]},{"poster":"lucanomax1994","date":"2015-08-22T20:55:09.355+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Skydago","date":"2015-08-22T22:28:38.978+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Heart of Draenor,realm=EUW,application-id=98NGV4Al,discussion-id=VQPsERaE,comment-id=0001,timestamp=2015-08-22T20:55:09.355+0000)\n>\n> devi chiudere tutto dal task manager, TUTTI i processi di LoL - pvp.net - process tuazia.exe. Dovrebbe farti riloggare cosi! Praise ctrl+alt+canc\n\nAh grazie\nMa solo quelli di LoL o tutti in generale. Intendo tipo se ho ts aperto, devo chiudere anche quello?","replies":[]}]},{"poster":"StitchedClone","date":"2015-08-22T19:58:25.007+0000","up_votes":1,"down_votes":0,"body":"anche a me è successo ho passato tutto il mese di giugno così poi si è ristabilito da solo","replies":[]}]}