{"poster":"Skydago","date":"2016-05-09T08:02:15.345+0000","title":"NA SI DISFA","subforum":"Esport","up_votes":2,"down_votes":1,"body":"Dopo il ban degli [Impulse](http://ie.gg/s/1UIi) ora vengono pure i [Renegades (REN) e i Team Dragon Knights (TDK)](http://ie.gg/s/1UIh).\nIl ban degli impulse &egrave; stato causato da un&#039;idagine della Riot nella quale &egrave; emerso che i player non erano stipendiati (contro il regolamento degli esport riot che stabiliscono che i player devono avere un salario minimo di 11 000/ 12 500 $ a split), e non risultavano **avere un vero e proprio contratto con la societ&agrave; degli Impluse**. Ai proprietari sono stati dati 10 giorni di tempo per vedere la squadra e disfarla, o comunque riorganizzarla, cio&egrave; il tempo di riprendere gli lcs.\n\nIl ban dei TKD e renegades &egrave; stato causato, da quanto ho capito, per aver aderito ad un&#039;associazione vietata dalla riot e hanno messo a repentaglio la salute dei player.\n---\nIl Na ha perso a mio parere tre grandi team, come pensate si evolver&agrave; la cosa?","replies":[{"poster":"Nibbio Bianco","date":"2016-05-09T08:42:21.625+0000","up_votes":5,"down_votes":2,"body":"\"3 grandi team\"","replies":[{"poster":"Skydago","date":"2016-05-09T09:34:09.379+0000","up_votes":1,"down_votes":0,"body":"Era per enfatizzare.","replies":[]}]},{"poster":"SpideyPizza","date":"2016-05-09T08:03:48.517+0000","up_votes":1,"down_votes":0,"body":"Voglio avere anche io quei soldi :O \n\nma a mio parere verranno presi i singoli per formare altre squadre","replies":[{"poster":"Skydago","date":"2016-05-09T08:16:22.668+0000","up_votes":2,"down_votes":0,"body":"Già :3\n\nPossibile, ma magari potrebbero essere acquistati da altre squadre.","replies":[{"poster":"SpideyPizza","date":"2016-05-09T08:40:49.125+0000","up_votes":1,"down_votes":0,"body":"infatti, tanto e' un mercato nuovo\n\nse i player meritano perche non essere presi altrove :D","replies":[{"poster":"Skydago","date":"2016-05-09T09:35:06.791+0000","up_votes":2,"down_votes":0,"body":"Io sto aspettando scarra e qtpie ai dignitas.","replies":[{"poster":"Darki200","date":"2016-05-09T16:15:30.221+0000","up_votes":1,"down_votes":0,"body":"sto aspettando anch'io quel giorno.. ma non arrivera' mai. \nQtpie con i soldi che si è fatto in stream può fondare un team da solo","replies":[{"poster":"Skydago","date":"2016-05-09T20:22:57.070+0000","up_votes":1,"down_votes":0,"body":"Mai dire mai.","replies":[]}]}]}]}]}]},{"poster":"Hell88","date":"2016-05-09T11:45:31.515+0000","up_votes":2,"down_votes":3,"body":"ormai la riot ha più regole (metà senza senso) che il codice civile italiano...stà proseguendo verso il sentiero dell'esl...un sentiero che porta alla disfatta.","replies":[{"poster":"Ste the ripper","date":"2016-05-09T12:28:35.400+0000","up_votes":4,"down_votes":3,"body":"Hai ragione, è pazzesco che fissino un salario minimo dei giocatori e condizioni di salute.\nMa dove andremo a finire di questo passo?","replies":[{"poster":"Hell88","date":"2016-05-09T12:31:39.869+0000","up_votes":2,"down_votes":4,"body":"salario minimo boh non saprei...se vinci guadagni,se non vinci non guadagni a meno tu non abbia uno sponsor importante.\nPoi condizioni di salute..non è che li mandino a lavorare nelle miniere di carbone.","replies":[{"poster":"Ste the ripper","date":"2016-05-09T12:44:45.093+0000","up_votes":4,"down_votes":3,"body":"L'ignoranza è una brutta bestia...\nMai sentito parlare di rischi dovuti alla sedentarietà? Anche l'ansia può causare gravi problemi.... Un lavoro seppur non fisico comporta sempre una certa fatica e relativo stress fisico.\nInoltre siccome dedicano a questo lavoro oltre 12 ore al giorno è sempre dovuto un salario minimo che ovviamente può crescere in base ai risultati","replies":[{"poster":"Hell88","date":"2016-05-09T12:48:03.585+0000","up_votes":2,"down_votes":2,"body":"io anche sto davanti ad un pc per 12 ore per lavoro o meno eppure...sono stressato?una passeggiata e passa.","replies":[{"poster":"Ste the ripper","date":"2016-05-09T12:49:46.717+0000","up_votes":2,"down_votes":1,"body":"Tu se non vinci vieni licenziato?\nMal che ti vada compi 1000 volte la stessa azione :)","replies":[{"poster":"Hell88","date":"2016-05-09T12:50:58.026+0000","up_votes":2,"down_votes":2,"body":"se io non \"vinco\" fallisce la mia azienda... XD","replies":[{"poster":"Ste the ripper","date":"2016-05-09T13:11:01.707+0000","up_votes":3,"down_votes":3,"body":"La gente esagera sempre quello che fa senza accorgersi di quello che fanno gli altri.\nSe ti fa piacere pensare di essere il miglior lavoratore di sempre che fa il lavoro più difficile e pesante di tutti continua così, evidentemente sei furbo tu e scemi gli altri.\nMa alla fine seguendo la tua logica arrivo a una conclusione: tu lavori di più e se fallisci fallisce la tua azienda gli altri fanno poco, hanno diritti sindacali e se falliscono capita nulla.\nMa allora penso non è che lo scemo sei tu e loro sono furbi? :)","replies":[{"poster":"Hell88","date":"2016-05-09T13:24:49.178+0000","up_votes":3,"down_votes":2,"body":"Parli pensando che il mio prima lavoro sia stato questo..ho fatto pure io il dipendente eh!\nNon penso ne di essere il migliore ne il più bravo etc etc...Ma spacciare lo stare al pc come lavoro usurante è una bestemmia bella e buona.oltre al fatto che tu decontestualizzi la questione e spacci il videogiocare come un lavoro vero cosa che non è...infatti di solito a 25 anni o poco più si trovano un'altro lavoro.","replies":[{"poster":"Ste the ripper","date":"2016-05-09T14:11:24.924+0000","up_votes":3,"down_votes":3,"body":"Smettono perché non hanno più i riflessi mica per altro, come capita a un calciatore che smette perché non ha più il fisico, come capita al muratore, come capita a un qualunque anziano che va in pensione, il fatto che quel lavoro sia disponibile a una fascia d'età troppo limitata per andare in pensione li costringe a cambiare lavoro così come capita agli sportivi.\n\nLa definizione di lavoratore è:\n> \nDal punto di vista giuridico, sociale, sindacale, la persona che per contratto si obbliga, mediante retribuzione, a prestare la propria opera alle dipendenze e sotto la direzione dell'imprenditore ( l. subordinato o prestatore di lavoro subordinato ) oppure a cedere al committente, dietro un corrispettivo, il risultato del proprio lavoro ( l. autonomo o prestatore d'opera ).\n\nMi sembra che ricada ampiamente nella definizione di lavoro, inoltre sono sottoposti a malattie professionali come la tecnopatia, hanno elevati rischi di contrarre malattie dovute alla sedentarietà, hanno orari minimi da dedicare alla professione.\nMentre per quanto riguarda lo stress è un tuo parere personale, c'è chi a causa dello stress a scuola ha sfoghi cutanei, chi ha crisi di ansi e addirittura attacchi di panico, non credo tu abbia le conoscenze mediche per discriminati quali fattori siano causa di ansia e quali no.\nPuò non piacerti, ma giuridicamente sono dei lavoratori :)","replies":[{"poster":"kernel panic","date":"2016-05-10T07:57:37.988+0000","up_votes":2,"down_votes":1,"body":"Mettere un lavoro come i tipi dell'esport o i calciatori, e paragonarli a chi fa il muratore è un insulto per questi ultimi.","replies":[{"poster":"Ste the ripper","date":"2016-05-10T10:17:06.451+0000","up_votes":2,"down_votes":3,"body":"Hai ragione, molti calciatori hanno un livello d'istruzione superiore al muratore.\nCapisco che si possa essere invidiosi dei guadagni, ma la virtù di un lavoro rispetto ad un altro non risiede nella fatica fisica rapportata al guadagno :)\n\nA parte le \"provocazioni\" dimmi, secondo te cosa definisce la dignità di un lavoratore rispetto ad un altro?","replies":[{"poster":"kernel panic","date":"2016-05-10T12:37:40.667+0000","up_votes":2,"down_votes":1,"body":"Quindi per te i lavori e, il modo in cui sono trattati i lavoratori, sono tutti uguali?\n\nTutti i lavoratori, dal calciatore al collaboratore part-time, hanno pari diritti, tutele e dignità?","replies":[{"poster":"Ste the ripper","date":"2016-05-11T14:01:57.516+0000","up_votes":2,"down_votes":1,"body":"Ok, questione di piccoli dettagli formali...\nAnziché parlare di salario diciamo che allora la dignità di un lavoro è data esclusivamente dal benessere che ti procura, riassumo meglio il tuo punto di vista? :)\nQuanto più questo benessere è migliore, quanto meno sei dignitoso, siccome un calciatore è meno lodevole di un muratore perché il calciatore ha condizioni di lavoro migliori, salari migliori, ecc. ( cit: Mettere un lavoro come i tipi dell'esport o i calciatori, e paragonarli a chi fa il muratore è un insulto per questi ultimi.).\nIl calciatore è anche meno lodevole del medico, ma il medico è meno lodevole del muratore, facendo una scala possiamo dire:\nRaccoglitore di castagne > muratore > medico > calciatore\nGiusto?\n\nComunque un dirigente di una grande azienda non è stabile, un qualunque libero professionista non è stabile, un calciatore non è stabile, un allenatore ( specie se del palermo) non è stabile.\nLe condizioni di lavoro di un calciatore non sono nemmeno le migliori possibili visto che può capitare che si alleni e giochi sotto la pioggia. Le prospettive di un calciatore sono a dir poco pessime, superati i 40 anni oltre il 70% dei calciatori resta disoccupato e spesso a restare disoccupati non sono quelli che han fatto i milioni in serie a, ma quelli che in lega pro ( o peggio) lavoravano per stipendi assolutamente normali.\nValutare la dignità di un lavoro come vedi non è proprio così semplice, ci sono molte sfaccettature che fanno saltare gli schemi più rigidi.","replies":[]},{"poster":"kernel panic","date":"2016-05-10T14:20:14.293+0000","up_votes":2,"down_votes":1,"body":"Un calciatore che fa il mestiere da \"professionista\" guadagna abbastanza da poter vivere onestamente e tranquillamente.\n\nI nuotatori, atletisti etc..chissà come mai, ad eccezione dei super famosi tipo la pellegrini, magnini etc, son tutti arruolati presso forze dell'ordine.\n\nLa dignità di un lavoro è data anche dalla stabilità che uno ha da quel lavoro, dalle condizioni in cui lavora, dal salario, dall'ambiente, dalle prospettive.\n\nVorrei dire che un qualsiasi precario ha le stesse tutele di un calciatore?","replies":[]},{"poster":"kernel panic","date":"2016-05-11T13:29:42.051+0000","up_votes":1,"down_votes":0,"body":"Ma leggi solo quello che ti pare?\n\nHo scritto \"data anche dalla stabilità che uno ha da quel lavoro, dalle condizioni in cui lavora, dal salario, dall'ambiente, dalle prospettive.\"\n\nMa ok...dipende solo dalla paga...","replies":[]},{"poster":"Ste the ripper","date":"2016-05-11T13:21:52.889+0000","up_votes":2,"down_votes":2,"body":"Ok, entrano nelle forze armate, ma poi cosa cambia? Mica fanno i carabinieri, si allenano tutto il giorno in totale indipendenza,_ **solo hanno un salario minimo**_, altrimenti sarebbe impossibile vivere di sport solo in base ai propri successi :)\n\nQuindi meno si guadagna più un lavoro è dignitoso? Un punto di vista pittoresco diciamo :)\nCredo che limitarsi a definire un lavoro in base alla busta paga sia riduttivo ( uno stimato medico che salva migliaia di vite è quindi meno meritevole di un raccoglitore di castagne?), ma ognuno vede la vita a modo suo.","replies":[]},{"poster":"Ste the ripper","date":"2016-05-10T13:18:16.986+0000","up_votes":1,"down_votes":1,"body":"Sai vero che non tutti i calciatori guadagnano milioni? \nE se parlassimo di nuotatori cambierebbe il senso? \n\nAnziché rispondere con altre domande, dimmi, cosa definisce la dignità di un lavoro?","replies":[]}]}]},{"poster":"Darkinknight","date":"2016-05-10T15:05:06.870+0000","up_votes":2,"down_votes":1,"body":"Perche sarebbe un insulto? Il lavoro non è solo ammassare mattoni o zappare.  non si considera lavoro solo dove torni a casa con le ossa a pezzi..i giocatori hanno un regolare contratto,con doveri e diritti,orari dove esercitare obbligatoriamente una mansione e un corrispettivo..danno un servizio di cui i fans usufruiscono ,esattamente come quando si guarda una partita di qualsiasi sport in tv o allo stadio/palestra/ecc..non è cosi semplice..personalmente riuscirei a fare il muratore,ma non arriverei mai a fare una professione da sportivo,semplicemente perche non ne ho ne le capacita, ne ci ho messo impegno e costanza..magari il lavoratore precario doveva studiare,doveva fare gavetta ma ha preferito un lavoro stipendiato pieno subito,potrebbe cercare altro..detto semplicemente,perche lui è un calciatore e l'altro è precario?","replies":[{"poster":"Floppyz","date":"2016-05-11T07:21:36.280+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=wqlqxm93,discussion-id=dB4lBKLk,comment-id=000300000000000000000000000000010000000000010001,timestamp=2016-05-10T15:05:06.870+0000)\n>\n> perche lui è un calciatore e l'altro è precario?\n\nQuesta la so io!\n\nPerché lui è particolarmente bravo a giocare a calcio, mentre l'altro ha la sfortuna di vivere in una società che incentiva disgustosamente il precariato.","replies":[{"poster":"Floppyz","date":"2016-05-12T07:47:00.950+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=wqlqxm93,discussion-id=dB4lBKLk,comment-id=00030000000000000000000000000001000000000001000100000000,timestamp=2016-05-11T23:09:33.046+0000)\n>\n> Oppure perche uno ha saputo sfruttare,lavorare,faticare e impegnarsi su un suo talento..e l&#x27;altro invece no e ha preferito subire gli eventi cosi come venivano bello piegato a 90°per poi lamentarsi della sua vita..che la societa sia a puttane non ti do certo torto,ma uno davvero bravo in qualcosa ci diventa con impegno costanza e sudore,certo non ci nasce..nessuno regala nulla\n\nÈ una possibilità anche quella che esponi tu, ma ti assicuro che è pieno di persone che sfruttano, lavorano faticano e si impegnano su un proprio talento, e nonostante ciò rimangono precarie. Se neghi ciò significa che non conosci la realtà.\n\nCosì come peraltro, è pure possibile che uno nasca con del talento o in un contesto privilegiato, e grazie a questo riesca.\n\nNessuno regala nulla, ma in questa società troppo spesso nessuno riconosce il giusto a chi lo merita.","replies":[]},{"poster":"Darkinknight","date":"2016-05-11T23:09:33.046+0000","up_votes":1,"down_votes":0,"body":"Oppure perche uno ha saputo sfruttare,lavorare,faticare e impegnarsi su un suo talento..e l'altro invece no e ha preferito subire gli eventi cosi come venivano bello piegato a 90°per poi lamentarsi della sua vita..che la societa sia a puttane non ti do certo torto,ma uno davvero bravo in qualcosa ci diventa con impegno costanza e sudore,certo non ci nasce..nessuno regala nulla","replies":[]}]}]}]},{"poster":"Hell88","date":"2016-05-09T14:40:36.326+0000","up_votes":2,"down_votes":2,"body":"cerca l'elenco dei lavori usuranti sul sito dell'inps.Hanno cmq le stesse malattie professionali di chi lavora in un ufficio qualsiasi...cmq veramente non puoi mettere in comune un videogiocatore,un calciatore e un muratore...il muratore lo smetti di fare perchè ormai a 65 anni sei cotto,fisicamente distrutto...il calciatore/videogamer perchè non sei più competitivo non perchè non potresti più farlo.videogamer/calciatore lo sei per 10 anni-15 se ti va bene...40 anni per i muratori.\nSenza parlare dei stipendi dei calciatori o i premi di chi vince gli lcs a lol...non dico che non siano lavoratori i senso stretto ma sono dei lavoratori privilegiati...\nMi spiace ma la pensiamo diversamente.","replies":[{"poster":"Bronze II","date":"2016-05-09T21:04:38.707+0000","up_votes":1,"down_votes":1,"body":"sono molti i lavori in cui si è privilegiati e vengono considerati senza ombra di dubbio lavori veri e propri...considerare LoL un lavoro, per i pro, può sembrare una cosa strana, ma penso sia solo per il fatto di essere un concetto nuovo quindi difficile da accetare","replies":[{"poster":"Skydago","date":"2016-05-10T11:04:26.998+0000","up_votes":2,"down_votes":1,"body":"> ma penso sia solo per il fatto di essere un concetto nuovo quindi difficile da accettare\n\nColto in pieno.","replies":[]}]},{"poster":"Darkinknight","date":"2016-05-09T23:21:25.993+0000","up_votes":1,"down_votes":1,"body":"Meh lavoratori privilegiati..certi se mi dici che è sbagliato che uno prenda 15 milioni all'anno per calciare un pallone di certo non ti do torto..ma cio che fanno si considera lavoro a tutti gli effetti..ma non so quanto guadagnino i pro di lol,poi vincono il torneo e vincono un grosso montepremi? Sti cazzi fosse facile..per me anche un direttore, professore,un personal trainer e molti altri sono lavori privilegiati,un sacco di soldi senza fare fatica..cosa gli da questo privilegio?tutto il lavoro antecedente,esattamente come i pro di lol.. Gli unici a non fare una beata minkia ed essere privilegiati in tutto è la classe politica ma quello è un mondo a parte","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2016-05-09T09:57:35.209+0000","up_votes":3,"down_votes":2,"body":"3 grandi team? Erano tutti sul fondo del barile della classifica...\nGli rng ad esempio erano il Palermo della serie a, durante la season hanno fatto più cambi loro che tutte le altre messe insieme","replies":[{"poster":"Skydago","date":"2016-05-09T10:22:33.568+0000","up_votes":1,"down_votes":0,"body":"Perdere 3 team è comunque molto...","replies":[{"poster":"Ste the ripper","date":"2016-05-09T12:25:47.749+0000","up_votes":2,"down_votes":1,"body":"2 di quei 3 li avrebbero persi per retrocessione","replies":[{"poster":"Skydago","date":"2016-05-09T14:34:49.984+0000","up_votes":1,"down_votes":0,"body":"Ma ne avrebbero acquistate altre due. Ora invece perse a prescindere.\nP.s. Non sono stato io a metterti -1","replies":[{"poster":"Ste the ripper","date":"2016-05-09T15:44:02.147+0000","up_votes":2,"down_votes":2,"body":"Excusatio non petita, accusatio manifesta.\n\nComunque non mi è mai importato dei -1, diciamo che sarebbero utili per capire il parere della gente se non fosse che vengono dati quasi solo a simpatia ( e io sono notoriamente uno poco simpatico), ma decisamente i -1 sono l'ultimo dei miei problemi.","replies":[{"poster":"Skydago","date":"2016-05-09T15:44:51.455+0000","up_votes":1,"down_votes":0,"body":"Sei libero di pensare come credi :D\n\nPiù che altro ci tengo a non passare come omino dei -1 haha","replies":[]}]}]}]}]}]},{"poster":"Vileblood Pyke","date":"2016-05-11T13:00:58.335+0000","up_votes":1,"down_votes":0,"body":"I \"tag\" sono REN e TDK.","replies":[{"poster":"Skydago","date":"2016-05-11T13:52:28.749+0000","up_votes":1,"down_votes":1,"body":"Ah ho sgarrato i renegades. Seguire gli msi non mi ha fatto bene.\nE poi anche un mio amico fa parte di un team chiamato \"renegades eSports\" con tag rng.","replies":[]}]}]}