{"poster":"Skydago","date":"2018-04-22T09:34:29.486+0000","title":"Raga faccio schifo","subforum":"Discussioni generali","up_votes":5,"down_votes":0,"body":"Allora premetto che sto post non sapevo bene in quale sezione inserirlo, quindi lo scrivo qui.\r\nBeh raga quello che vi voglio dire &eacute; che starei cercando una persona che mi possa aiutare a migliorare. Penso non ci sia molto da dire, il semplice fatto di dire alla gente che sono hard stuck s4 fa salire il cringe pure a me ma non riesco a migliorarmi. Ho provato di tutto: riguardare i miei game per sapere dove sbaglio, cercare di essere concentrato al massimo in ogni singola ranked, ma niente. Ho pure pensato di farmi boostare nella disperazione, ma poi un mio amico mi ha parlato e ci ho rinunciato. Alla fine i miei errori li conosco (a parte quelli puramente meccanici come il farmare male o le skill meccaniche in se): pusho troppo, anche quando abbastanza basso di vita, e spesso mi faccio prendere dal greed stupido. Oh e il positioning.\r\n\r\nQuello che chiedo &egrave; se c&#039;&egrave; qualcuno disposto ad aiutarmi per migliorare (gratuitamente sono senza soldi, al massimo una mistery) e farmi raggiungere non dico il gold,ma almeno il silver alto.\r\nGrazie dell&#039;eventuale attenzione.","replies":[{"poster":"Emerald25","date":"2018-04-23T06:51:58.918+0000","up_votes":1,"down_votes":0,"body":"aggiungimi ti posso dare qualche consigli per quanto riguarda adc supp e mid","replies":[]},{"poster":"SideshowEMS","date":"2018-04-22T21:18:02.891+0000","up_votes":1,"down_votes":0,"body":"Gioco da quando è uscito Braum, sto in bronzo 5 dal primo piazzamento, e non ho mai imparato a farmare; ho una media di ben 2.5 minion al minuto secondo il recap di fine stagione.\n\nQuando penserai  di nuovo di far schifo, ricordati di me, e ti sentirai subito meglio !","replies":[]},{"poster":"BabacioLegend","date":"2018-04-22T11:54:18.416+0000","up_votes":2,"down_votes":5,"body":"Io ho due profili, uno e' stuck s4 con il 30% winrate (ripperoni) l'altro e' s2,  prendo 30 lp a botta saltando una divisione alla volta con il 70 % winrate. I gold ed ex plat in team sono meglio dei silver bronzi. In determinate leghe il team fa molto e nulla in base alle situazioni.  Tutti hanno dei limiti come penso di essere gold 3 o inferiore. Se gia' capisci i tuoi errori significa che meriti almeno una categoria superiore.","replies":[{"poster":"KCM Randagio I","date":"2018-04-22T14:27:51.975+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BabacioLegend,realm=EUW,application-id=MJVj50Jw,discussion-id=nN4yYQfq,comment-id=0002,timestamp=2018-04-22T11:54:18.416+0000)\n>\n> Io ho due profili, uno e&#x27; stuck s4 con il 30% winrate (ripperoni) l&#x27;altro e&#x27; s2,  prendo 30 lp a botta saltando una divisione alla volta con il 70 % winrate. I gold ed ex plat in team sono meglio dei silver bronzi. In determinate leghe il team fa molto e nulla in base alle situazioni.  Tutti hanno dei limiti come penso di essere gold 3 o inferiore. Se gia&#x27; capisci i tuoi errori significa che meriti almeno una categoria superiore.\n\nChe ca**o?","replies":[{"poster":"BabacioLegend","date":"2018-04-22T17:15:15.828+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KCM Randagio I,realm=EUW,application-id=MJVj50Jw,discussion-id=nN4yYQfq,comment-id=00020000,timestamp=2018-04-22T14:27:51.975+0000)\n>\n> Che ca**o?\n\nsi direi che sono stato molto unlucky e in parte ho fatto cacare, quello che dico e' che rendersi conto dei propri errori e' gia' il primo metodo per migliorare. Nel mio caso ha funzionato e da s4 stuck ho sfiorato il gold","replies":[]}]}]},{"poster":"KCM Randagio I","date":"2018-04-22T14:28:37.463+0000","up_votes":1,"down_votes":0,"body":"Se vuoi aggiungimi io gioco per divertirmi, ma se sono in vena ti di queste dritta.. quindi almeno ti diverti","replies":[]},{"poster":"HaIIeIujah","date":"2018-04-22T09:45:46.696+0000","up_votes":3,"down_votes":3,"body":"Puoi aggiungermi sul gioco. Occhio a copincollare il nome esatto dal forum.","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-04-22T10:35:34.552+0000","up_votes":1,"down_votes":7,"body":"buona fortuna","replies":[]}]}