{"poster":"Skydago","date":"2016-06-29T12:57:16.092+0000","title":"Quel momento in cui capisci che....","subforum":"Discussioni generali","up_votes":5,"down_votes":4,"body":"Che ad un certo punto &egrave; meglio chiudere baracche e burattini ed andarsene.\r\nEsattamente 5 minuti fa ho disinstallato LoL, e spero di non rivedere mai pi&ugrave; quell&#039;icona.\r\n\r\nIl mio problema &egrave; che non sono portato in questo gioco. Due anni in questo gioco non sono bastati a farmi migliorare le mie abilit&agrave;, e quindi questo mi fa capire che questo gioco non &egrave; adatto a me, sono arrivato al massimo delle mie capacit&agrave;. Dopo l&#039;ennesima sconfitta in questo gioco per colpa della mia scarsezza, mi sono fatto un esame di coscienza e ho capito che forse devo cambiare gioco, che lo strategico e il gioco di squadra non fanno per me.\r\nNon so farmare, tilto facilmente per il flame  e talvolta me ne gratto beatamente le balle del /mute all, alimentando il flame.\r\nHo iniziato a giocare ad agosto del 2014, quando usc&igrave; {{champion:150}}. Inizialmente come tutti fino al livello 15 provai tutti i campioni ma infruttuosamente, poi, quando comprai katarina, iniziai a spammarla fino al livello 20, per poi conoscere lui: Malzahar.\r\nNon &egrave; il malzahar che tutti vediamo ora, ma quello prima del rework, nella quale la sue w era la cosa pi&ugrave; cancerogena contro i tank (bens&igrave; oltre allo scaling di ap toglieva il 4% della salute massima del bersaglio per ogni secondo in cui era attiva!) e nessuno sapeva che divarmi sotto torre mentre avevo la ulti era qualcosa di stupido, incredibilmente stupido.\r\nFu amore a prima vista e iniziai a spammare il mio allenatore di voiling con le sue void-ball fino al livello 30. Poi un nuovo champion entro tra i miei preferiti: {{champion:245}}. Iniziai a giocarlo in normal e lo trovai assolutamente divertente (Plaun plaun!) E quindi anche lui entr&ograve; nella mia rosa. Dulcis in fundo conobbi {{champion:103}} trovandola una volta in free rotation, e quando la provai carriai il game first time, quindi decisi di fare il risparmiatore folle e comprarla. Quando iniziai le ranked venni piazzato S4 con 6 win e 4 lose, assolutamente immeritate, trovandomi un mese dopo bronzo. La scorsa season terminai bronzo 3 a 55 lp, coi miei vani tentativi di diventare silver.\r\nQuesta season dopo 400 ranked osno riuscito ad arrivare silver, e poi riscendere bronzo.\r\nLa scorsa season ho giocato lo stesso numero di ranked e mi sono ritrovato bronzo comunque, quindi questo implica che non sono migliorato. Questo mi fa capire quando io sia scarso. Ho capito di essere senza speranza quando oggi, giocando Malzahar ho perso contro una katarina. E aveva lo smite. Sono stufo di perdere, di farmi il sangue amaro per questo gioco, e se cerco di divertirmi e basta non ci riesco, perch&eacute; &egrave; troppo frustrante giocare contro katarina 2/0 mentre tu sei 0/1. E&#039; ancora pi&ugrave; frustrante venir flammati e vedere quella katarina spammare il ballo a destra e a manca cos&igrave;, perch&eacute; sta vincendo. Questo bellissimo gioco sta venendo rovinato dalle persone che ci giocano, e io dico che se ci fossero dei ban molto pi&ugrave; pensato e controlli severissimi saremmo pochi ma buoni. Ma non voglio discutere di questo ora.\r\nVolevo comunque ringraziare le persone che mi hanno accompagnato in questa avventura, che mi hanno dato consigli e cercato di aiutarmi, e volevo scusarmi con loro, ma io sono cos&igrave;, forse non migliorer&ograve; mai pi&ugrave; di cos&igrave; ed &egrave; per questo che ho deciso di cambiare\r\n\r\nFrattaglia\r\niLoud\r\nDantazzo\r\nSeaman\r\nDurbo\r\nSorcio\r\nCommon\r\n\r\nE ce ne sono ancora molti altri che mi hanno aiutato, che involontariamente dandomi del bronzo e dandomi la carica, chi volontariamente, dandomi consigli e s~~u~~opportandomi.\r\n\r\nPurtroppo &egrave; illegale, ma se potessi metterei a disposizione il mio account per chi volesse provare skin o champion che ho io.\r\nAd ogni modo volevo salutarvi ragazzi.\r\nMi avete comunque fatto crescere come persona e farmi passare da quel ragazzino che sapeva solo dire &quot;stfu noob&quot; a essere positivo, ad aiutare e spingere sempre il mio team alla vittoria.\r\n\r\nBuona fortuna nelle arene della giustizia ragazzi!","replies":[{"poster":"Frattaglia","date":"2016-06-29T13:38:37.875+0000","up_votes":4,"down_votes":0,"body":"Quoto esattamente Ciack. Premesso che credo che l'abilità in questo gioco, almeno fino a un certo livello (platino) sia solo una questione di testa, però penso che uno dovrebbe giocare a un gioco perché gli piace, non perché è forte.\n\nGioca tranquillo fino a che ti diverte, se non sei portato per la competizione non devi per forza competere. :)","replies":[{"poster":"Skydago","date":"2016-06-29T14:34:43.054+0000","up_votes":1,"down_votes":0,"body":"> Sono stufo di perdere, di farmi il sangue amaro per questo gioco, e se cerco di divertirmi e basta non ci riesco, perché è troppo frustrante giocare contro katarina 2/0 mentre tu sei 0/1.","replies":[{"poster":"I Homura I","date":"2016-06-29T21:52:46.867+0000","up_votes":1,"down_votes":0,"body":"Mai provato a giocare tanto per? A sbattertene del meta e giocare (in normal eh) nami mid per esempio? Se poi giochi per vincere pure le normal allora ti quoto.","replies":[]}]}]},{"poster":"Floppyz","date":"2016-06-29T13:19:28.013+0000","up_votes":5,"down_votes":1,"body":"Uhm... mandami a quel paese se vuoi, ma io sono dell'idea che l'unico motivo per cui smettere volontariamente di giocare ad un gioco debba essere che questo non ti diverte più, non che non sei bravo.\n\nPoi capisco pure che se non sei bravo (e te lo dice uno che non lo è) la community di LOL ce la mette veramente tutta per farti sentire una nullità, e questo ovviamente influisce anche sul piacere di giocare...\n\nBeh che altro dire... Se la tua scelta è davvero definitiva, ti auguro buon proseguimento su altri lidi.","replies":[{"poster":"Skydago","date":"2016-06-29T14:34:15.801+0000","up_votes":1,"down_votes":0,"body":"Hai ragione, ma\n\n> Sono stufo di perdere, di farmi il sangue amaro per questo gioco, e se cerco di divertirmi e basta non ci riesco, perché è troppo frustrante giocare contro katarina 2/0 mentre tu sei 0/1.","replies":[{"poster":"Kazushi San","date":"2016-06-29T14:45:07.964+0000","up_votes":2,"down_votes":0,"body":"Se sei stufo di perdere...gioca con i bot fin quando il tuo pessimismo va via, oppure gioca ad overwatch e rilassati...vai a mare, guardati un film insomma non scoraggiarti","replies":[]},{"poster":"Floppyz","date":"2016-06-30T06:59:12.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skydago,realm=EUW,application-id=MJVj50Jw,discussion-id=0y7gLKJP,comment-id=00010000,timestamp=2016-06-29T14:34:15.801+0000)\n>\n> Hai ragione, ma\n\nSì, ho letto e posso capire la frustrazione, per questo ti dico che se per via di quelle situazioni viene a mancare il divertimento, fai bene ad abbandonare LOL: è un gioco, non un lavoro, quindi puoi scegliere, e il miglior criterio di scelta credo sia appunto questo; volevo solo sincerarmi che non lo facessi per il semplice motivo che non sei particolarmente bravo.\n\n> [{quoted}](name=Poro May Cry,realm=EUW,application-id=MJVj50Jw,discussion-id=0y7gLKJP,comment-id=00010001,timestamp=2016-06-29T21:54:01.657+0000)\n>\n> A maggior ragione la gente che scassa le balle dovrebbe avere 0 voce in capitolo. Esiste il tasto mute per un motivo, dato che ormai la chat soprattutto quella nemica, serve solo per sfottere.\n\nScusa ma non ho capito cosa vuoi dire. Se ti riferivi al discorso che ho fatto sulla community mi riferisco più alla parte fuori dalla partita, visto che come dici giustamente, gli altri li muti se danno fastidio.","replies":[]}]},{"poster":"I Homura I","date":"2016-06-29T21:54:01.657+0000","up_votes":1,"down_votes":0,"body":"A maggior ragione la gente che scassa le balle dovrebbe avere 0 voce in capitolo. Esiste il tasto mute per un motivo, dato che ormai la chat soprattutto quella nemica, serve solo per sfottere.","replies":[]}]},{"poster":"Lazy Evaluation","date":"2016-06-29T22:03:08.577+0000","up_votes":4,"down_votes":1,"body":"Tranquillo, arriva per tutti quel momento in cui ti rendi conto che LoL fa' schifo, in primis la sua community, e disinstalli il gioco. Il problema e' che riprendi a giocare quasi subito perche' e' una droga; piu' sconfitte ci sono, piu' la vittoria che le segue sa' di divertimento e soddisfazione.","replies":[]},{"poster":"SunWukongInAcids","date":"2016-06-30T10:02:35.610+0000","up_votes":3,"down_votes":3,"body":"meno male ! noi tutti della landa ringraziamo !","replies":[{"poster":"Skydago","date":"2016-06-30T12:36:04.539+0000","up_votes":2,"down_votes":0,"body":"Tanto anche tu sei scarso perciò hai poco da ringraziare :D","replies":[{"poster":"SunWukongInAcids","date":"2016-07-01T11:18:56.572+0000","up_votes":2,"down_votes":0,"body":"quello che lascia sei tu :) hanno pure fatto la skin per celebrare l'evento !","replies":[{"poster":"Skydago","date":"2016-07-01T12:25:54.316+0000","up_votes":1,"down_votes":0,"body":"DI me hanno considerazione, di te no u.u","replies":[{"poster":"SunWukongInAcids","date":"2016-07-01T13:00:59.467+0000","up_votes":3,"down_votes":1,"body":"Xd beh cmq il livello globale di lol si è già alzato ;)","replies":[{"poster":"Skydago","date":"2016-07-01T13:51:42.209+0000","up_votes":2,"down_votes":1,"body":"di testa no, e tu lo dimostri","replies":[{"poster":"SunWukongInAcids","date":"2016-07-02T10:22:14.113+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Skydago","date":"2016-07-02T12:26:50.476+0000","up_votes":1,"down_votes":0,"body":"Se ti riferisci a quello che serve per il tuo nick penso che tu non lo abbia proprio, visto che ci hai dedicato un nome: deve essere che ti manca molto!\nO altrimenti sei rocco, ma non credo :D","replies":[]}]}]},{"poster":"Ste the ripper","date":"2016-07-01T13:10:55.777+0000","up_votes":2,"down_votes":1,"body":"Investo su di te, usa il mio +1 con saggezza","replies":[{"poster":"SunWukongInAcids","date":"2016-07-02T10:21:37.606+0000","up_votes":1,"down_votes":0,"body":"grazie, ci ho comprato le sigarette","replies":[]}]}]}]}]}]}]},{"poster":"Darkinknight","date":"2016-06-29T16:57:32.096+0000","up_votes":2,"down_votes":0,"body":"E quindi?stavi perdendo la lane non vedo il problema..specialmente con malza dato che il suo punto forte è bloccare il feedato di turno i qualsiasi momento..ok non sali,non sei portato in questo game..e quindi?..nessuno di noi prendera dei soldi o gli faranno una statua perche sta a gold platino diamond..si gioca per divertirsi anche se vincere aiuta la cosa 😊","replies":[{"poster":"Skydago","date":"2016-06-29T18:49:01.615+0000","up_votes":1,"down_votes":0,"body":"Come disse il mio saggio cugino\n_Vincere non è importante ma perdere fa schifo_","replies":[{"poster":"Darkinknight","date":"2016-06-29T19:28:51.925+0000","up_votes":1,"down_votes":0,"body":"Se tu non ti diverti piu ed è diventato solo frustrazione mollalo pure..pero se ti piace giocarci fregatene del non salire, gioca solo per divertirti..in piu a giocare per far bene non per vincere,in realta tendi a vincere di piu","replies":[]}]}]},{"poster":"Killer SurpRyze","date":"2016-06-29T15:01:57.206+0000","up_votes":2,"down_votes":0,"body":"mah, ti capisco perché anche io sono scarso e penso che il gioco non faccia per me (infatti non gioco quasi più. Per fortuna hanno messo la rotazione delle speciali nei fine settimana). Un gioco deve servire a divertirsi: non è un lavoro, non è un impegno, non deve essere una costrizione. Il tempo limitato che abbiamo è meglio impegnarlo in cose che ci piacciono e che danno soddisfazione, piuttosto che incaponirci su qualcosa che ci lascia con l'amaro in bocca.\nBuone future videogiocate","replies":[]},{"poster":"Campanello","date":"2016-06-29T14:25:58.985+0000","up_votes":2,"down_votes":0,"body":"FRAGATENE SE SEI SCARSO E' UN GIOCO DIVERTITI!!!","replies":[]},{"poster":"SpideyPizza","date":"2016-06-29T13:14:03.994+0000","up_votes":2,"down_votes":0,"body":"Ti aspetteremo :D","replies":[]},{"poster":"Ryukito","date":"2016-06-29T13:50:10.019+0000","up_votes":3,"down_votes":1,"body":"Ciao Sky, non è la scarsezza di un solo player che fa perdere i games, si gioca in 5 e non si è soli in partita. Oltre a saper carriare, bisogna saper essere carriati e accettare la sconfitta in lane, contro un avversario che è piu bravo di noi. Alla katarina che balla neanche devi farci caso, è un atteggiamento provocatorio, per farti arrabbiare e spingerti a commettere errori. Se cadi in questi tranelli, bè Sky, allora la tua lega è il bronzo. Si ribaltano games che sembrano impossibili, per via del nuovo flusso di oro. Katarina 2/0 e te 0/1... Mi sono ritrovato in situazioni peggiori, dove ho dato fiducia al resto della squadra, aspettando il loro aiuto, aspettando il mio momento, ribaltando cosi la situazione. Proprio ieri, nell'unica rank del giorno che ho fatto, il mio team voleva arrendersi dicendo che era impossibile vincere. Dopo 67 minuti di partita abbiamo beccato uno di loro fuori posizione, lo abbiamo killato e killato in seguito il resto della squadra, compreso il nexus. Quello fuori posizione era l'unico tank che avevano, ma un tank che ne vale 3, illaoi.\nIn questo gioco non basta solo l'abilità nel saper usare il proprio campione, serve anche furbizia, tenacia, strategia, una mente ferma. Quello che giudichi di te stesso è solo il lato negativo. Giudica il tuo lato positivo e lavora su quello, fallo diventare un punto a tuo favore. Sicuramente ne hai uno, hai uno stile di gioco tuo su cui devi lavorare. Ci sarà sempre il nemico che riuscirà a capire il tuo gioco, ma ci sarà anche il nemico che andrà in tilt. Sono dell'idea che non bisogna mai mollare e giocare per divertirsi, lasciando perdere il comportamento degli altri giocatori. Cmq, a parte il gioco, buona fortuna per tutto. Spero un giorno di rivederti in game con lo spirito giusto, quello da vincente e quello me ne freghista verso il flame. + GAME - FLAME. A presto","replies":[]},{"poster":"A Yordle ln Heat","date":"2016-06-29T18:08:31.345+0000","up_votes":2,"down_votes":1,"body":"<3","replies":[]},{"poster":"TheKingOfTroll","date":"2016-06-29T16:39:28.357+0000","up_votes":2,"down_votes":1,"body":"Se hai fatto 400 ranked e non sei ancora in silver non vuole dire che sei scarso.. si può sempre migliorare.. Questo è un gioco ma nella vita come in questo gioco non bisogna mai arrendersi!!  NEVER SURRENDER!","replies":[]},{"poster":"Seaman93","date":"2016-06-29T15:22:11.045+0000","up_votes":2,"down_votes":1,"body":"tu mi devi far incazzare per forza....per un cazzo di demoting disinstalli? ....smettila e torna a giocare....non mi dire cacate che fai schifo ecc .. ti ho spiegato + e + volte come funziona sto game...e che l'elo prima o poi migliora.....adesso prenditi na pausa e poi rinizia...sei solo tiltato e demoralizzato","replies":[]},{"poster":"Piemoo","date":"2016-07-01T13:18:48.017+0000","up_votes":1,"down_votes":0,"body":"Ci rivediamo a settembre ciao ciao!\n\nAnche io più volte ho disinstallato lol, ma alla fine son sempre tornato, con la fregatura di aspettare tutta l'installazione. Prenditi una pausa e torna quando hai lo stimolo.","replies":[]},{"poster":"I Homura I","date":"2016-06-30T11:13:27.209+0000","up_votes":1,"down_votes":0,"body":"Ora che ci penso, hai provato a staccare per 1 mese o 2? Ci fu un periodo che lol mi stava talmente sulle balle che non mi dvertivo più. Ho staccato per 1 mese e poi è tornato tutto come prima. Provaci","replies":[]},{"poster":"Kazushi San","date":"2016-06-29T14:42:22.225+0000","up_votes":1,"down_votes":0,"body":"Io nel giro di 10 giorni da gold 1 a gold 4, sono Mad? Sí disinstallare? Nah\nHo ancora mesi per recuperare anche se attualmente odio questo game, ma so che è momentaneo","replies":[{"poster":"Ricorda il Baby","date":"2016-06-29T20:56:08.616+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kazushi San,realm=EUW,application-id=MJVj50Jw,discussion-id=0y7gLKJP,comment-id=0005,timestamp=2016-06-29T14:42:22.225+0000)\n>\n> Io nel giro di 10 giorni da gold 1 a gold 4, sono Mad? Sí disinstallare? Nah\n> Ho ancora mesi per recuperare anche se attualmente odio questo game, ma so che è momentaneo\n\nSi ma tu non fai altro che camminare per la toplane, se fai schifo vinci comunque da solo.\n\n\n\n\nPer Sky: Mi dispiace, spero che un giorno tu riprenda a giocare.\nOppure gioca GP, pure se sei nabbo con quel champ (come me) ti diverte comunque.","replies":[{"poster":"Kazushi San","date":"2016-06-29T22:03:11.570+0000","up_votes":1,"down_votes":0,"body":"Lo sto mainando effettivamente gp.","replies":[]}]}]}]}