{"poster":"Hanselot","date":"2016-09-15T05:44:12.594+0000","title":"Tips Vs. Shaco Jg.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola, queria rescatar algunos tips para jugar contra shaco jg, generalmente para los primeros niveles, donde generalmente hace invade. Juego con Xin Zhao, Trynda, Amummu generalmente en el rol de jg. Y bueno ultimamente me topado con este pj que me ha dado dolores de cabeza sobre todo en primeros leveles, y donde, cuando juego con amumu o xin arranco por el lado del blue, y no me ayudan con vision en red, me es dificil. Asi que bueno, cualquier tipo de ayuda sera agradecida. Muchas Gracias.","replies":[{"poster":"Borriic II","date":"2016-09-15T12:16:30.950+0000","up_votes":3,"down_votes":0,"body":"Shaco es un personaje que mete una presion extrema en el juego temprano, para jugar contra un shaco se necesita una tactica de equipo, no basta con que solo hagas bien tu trabajo como jungla, si tu team no comprende que debe jugar defensivo probablemente sea mucho mas problematico\n\nLa mayor debilidad de shaco es su late si no se feedea, shaco depende principalmente de 2 cosas\n1 Feedearse el lo suficiente para en una tf poder entrar en sigilo y borrar a tu carry\n2 Abusar lo suficiente de las lineas para dejar a todos sus aliados en ventaja por sobre los tuyos\n\nestamos en LAS, la mayoria de la gente no sabe jugar con ni contra un shaco, asi que es probable que tu team no deje de pushear como subnormales y se coman ganks, pero tambien es muy probable que el team rival se dedique a forzar teamfights donde shaco es debil y no abusen de la presion y ventaja que ese personaje genera al dividirse los teams\n\nEn general\n-No lo feedees\n-Intenta leer su modo de juego\n-No se si seria un bug visual de parches anteriores o era intencional, pero su clon no tiene items, si tienes dedos rapidos sabras bien a cual golpear\n-Si se te aparece en un campamento, retrocede un poco, que los monstruos le peguen a el y no a ti, luego lo atacas\n\nEn Early\n-Si eres un jungla de late como vendria a ser amumu, shyvana,trynda etc evita al shaco lv2, pon wards de avanzada, si lo ves, simplemente no pelees con el 1v1 al menos en los primeros niveles, de verdad bro un camp no vale dejarle los 400g de la primera sangre\n-Si lo ves pingea en el mapa, es cierto que tu team debiese estar alerta al mapa y nada mas verlo aparecer comenzar a moverse pero bue, sabemos que eso no pasa, pingea, pingea como si no hubiera mañana, por lo general la gente ante una sukulemtha kill se mueven, una vez que gasto su invisibilidad shaco es muy vulnerable\n-Trata de poner un pink estrategico en la jungla propia si el shaco es muy dado a invadir, si es de los que se dedican full a dañar las lineas o es derechamente malo y no te causa daño en la jungla pon un pink en un paso estrategico del rio o la linea aliada mas vulnerable\nSiendo amumu: evitalo, a lvl 3 con 2 niveles en tu E le puedes tradear pero como el lleva ignite y tu no, iras en desventaja, no es un matchup favorable en early asi que evitale tanto como puedas ya despues de pasado el lvl 5 llendo tank lo haras explotar\nSiendo trynda: a lvl 3 te lo comes, tu acumulacion de furia y tus criticos constantes lo revientan manten un buen nivel de vida en la jungla para evitar sorpresas,    si tienes la sospecha que puede aparecer ten un dedo en la E para evitar la caja cuando la ponga y es todo, ganaste el trade , si tu team te ayuda mejor aun\nSiendo xin: tienes un early muy fuerte, si logras adivinar sus movimientos y lo esperas puedes hacer que su jugada le salga en contra, si puedes leer donde va a gankear tus counterganks son letales a lvl 6 si lo golpeas y saca su clon, tu marca aun quedara sobre el real y te daras cuenta facilmente a cual atacar\n\nDe mid en adelante\n-Si no lo feedearon, el shaco hara el intento de splitpushear, fuerza tantas tf como puedas, su team lo insultara, habra caos y ganaras la partida\n-Si esta fed, hara el intento de borrar a tu adc, mantente en posicion defensiva, haz un cerco de pinks y borralo a el antes que el borre a tu adc, mientras mas avanza la partida, mas perdera su powerspike hasta el punto de ya no poder borrar al carry y ahi ya habras ganado\n-Si se fedeo, NO dividas a tu team, eso seria darle la partida en bandeja\n-Las tf son su mayor debilidad, si tu carry se para bien, es un 4v5\n-No caigas en el juego de perseguir a un shaco, con sus cajas y trucos varios se complica mucho y es contraproducente, si se aparece ante ti matalo, sino pues que se le va a hacer valen mas los objetivos","replies":[{"poster":"Hanselot","date":"2016-09-16T00:12:17.938+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]},{"poster":"DanielGarrita","date":"2016-09-15T16:07:22.304+0000","up_votes":1,"down_votes":0,"body":"lo bueno es que si sobrevives al early de shako y no logra estompear fuertemente. es como si el equipo enemigo fuera uno menos, es un campen bastante inutil en late.","replies":[{"poster":"Hanselot","date":"2016-09-16T00:14:05.558+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]},{"poster":"9081913DEL1","date":"2016-09-15T10:18:35.485+0000","up_votes":1,"down_votes":1,"body":"Con xin hacete tu buffo con ayuda y espera el invade. Xin es mas fuerte y sale shaco mas tocado. simplemente no lo persigas por toda la jungla. Deja wards (baratija al menos) avanzados. Sabes que tiene un rango para hacerse invi, si se hace mucho antes no llega al gank, asique tus wards mas extendidos, si lo ves asumi que va a tu posicion.\n\nCon amumu, mas dificil, hasta nivel 3, despues donde lo veas le tradeas, y anda tank, shaco es bueno gankeando pero sufre horrores un countergank (si uso su invi).\n\n\nCompra pink rosa, si hay 5 en el mapa (uno por cada uno mejor) vos pone el tuyo.\n\nSaludos.","replies":[{"poster":"Hanselot","date":"2016-09-16T00:13:43.095+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]},{"poster":"Kyousuke","date":"2016-09-15T15:53:39.969+0000","up_votes":1,"down_votes":0,"body":"la mejor manera de evitar un robo de buffos y la que uso yo para joderlo (siempre vienen a buscar y pierden tiempo) es hacerte primero los buffs, no te hagas ni sapo ni golems arranca directo en tus red/blue y anda corriendo por el otro buff, normalmente no llega a tiempo a robártelo y deja wardeado en zonas donde hace saltos, yo aprendi a ganarle y jugarlo viendo los vídeos de reve XD casi todos los shacos piensan lo mismo y si le jodes sus planes se quedan atrás. pink siempre presentes y decirle a tu equipo que no pushee sin visión profunda.\na un shaco se le gana con estrategia y trabajo en equipo nada mas","replies":[{"poster":"Hanselot","date":"2016-09-16T00:13:22.399+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-09-15T08:50:27.473+0000","up_votes":1,"down_votes":0,"body":"Shaco hace 2 tipos de invasiones tipicas, su red y luego invade tu blue o su blue para invadir tu red, por lo general si eres un pick sencillo de matar a lvl 2, procurara empezar en el mismo lado que tú, para encontrarte haciendo tu primer buffo, si no solo se conformara con robarte el otro buffo.\n\nHay varias manera de contrarrestar, las comunes son iniciar en tu primer buffo e ir corriendo al segundo o a la zona del segundo para wardearlo, shaco mata por que agarra desprevenido y con agroo del buffo al rival, pero sin cajas y solo con su W y Q para tradear, deja que desear en sus intercambios de daño aun si tiene ignite.","replies":[{"poster":"Hanselot","date":"2016-09-16T00:13:01.508+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]},{"poster":"Niankochan","date":"2016-09-15T07:17:18.303+0000","up_votes":1,"down_votes":0,"body":"Si tu team no te ayuda wardeando y echando un ojo a los buffs, el early es una ###### , ademas de que tu team deja mucho que desear realmente. Si el shaco es \"malo\" (como el 90% de los shacos) se va a llevar todas las kills y no va  a carrear ni al escurridizo. Si tu bot usa pinks (como el 90% de los botlane NO lo hace) no va a fedear, el shaco  va  a perder tiempo y vas a poder repuntar. En mid/late amumu/xin son mas fuertes y utiles para el team. Yo ayer jugue elise jg y no saque 1 red hasta el min 10, e igual la ganamos porque la bot lane se mantuvo wardeada todo el tiempo.","replies":[{"poster":"Hanselot","date":"2016-09-16T00:12:39.271+0000","up_votes":1,"down_votes":0,"body":"-muchas gracias","replies":[]}]}]}