{"poster":"CeBoomCeBoom","date":"2015-09-20T18:30:07.375+0000","title":"Silber Spieler Sucht Dou Q Mate und Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nich bin derzeit in Silber 3 (war schon mal in der Gold-Promo) und &uuml;bernehme am liebsten die Rolle des Supporters oder Toplaners. Und suche ein Team in meiner Elo, gerne auch etwas h&ouml;her. Es sollte sich dabei um ein Team handeln, welches Spa&szlig; am Spiel zu 5 hat und in dem eine freundliche Atmosph&auml;re herrscht. Es sollte keine mega Tryhard-Team sein, jedoch sollten regelm&auml;&szlig;ige Trainings (2-3 mal pro Woche) und Verbesserungen der Spielweisen und Spieler stattfinden.\r\n\r\nAngaben zu mir:\r\nDiese Angaben sind f&uuml;r ein Team, aber vieles ist auch f&uuml;r ein Duo Q-Partner wichtig.\r\n\r\n* Alter 18 Jahre\r\n* Spiele seit Season 2, jedoch seit ende Season 3 Rankeds und auch regelm&auml;&szlig;iger.\r\n* Bin Main-Support {{champion:12}} {{champion:89}} {{champion:412}} ; Ausweichen kann ich auf die Toplane {{champion:150}} {{champion:39}} {{champion:68}} oder in den Jungle{{champion:421}} {{champion:2}} {{champion:20}}    \r\n* Meine derzeitige Elo ist wie gesagt Silber 3, jedoch denke ich dass Gold diese Season noch drin ist und das auch meine &quot;wahre Elo&quot; wiederspiegelt (bin Bronze 4 diese Season gestartet).\r\n* Meine gr&ouml;&szlig;te Schw&auml;che Ingame ist oft eine zu aggressive Spielweise, werde beim Warden oft gecatched.\r\n* Meine gr&ouml;&szlig;te St&auml;rke ist die Vision-control Ingame, ich bin als Support zu 90% der der die meisten Wards gestellt und zerst&ouml;rt hat.\r\n* Kommunikation ist bei mir nur &uuml;ber Ts m&ouml;glich, w&uuml;rde daf&uuml;r sogar einen eigenen Server zur Verf&uuml;gung stellen.\r\n* Ich suche wie oben genannt ein Team dass 2-3 mal die Woche trainiert, jedoch bin ich Zeitlich ab 8 Uhr leider selten online, wegen Training im Wasser, bin aber ab 16 Uhr immer bereit f&uuml;r Spiele. Zudem sollten auch mal Teilnahmen an kleinen Turnieren oder so mal ins Auge gefasst werden.\r\n* Ich war zudem bereits Kapit&auml;n zweier Teams, im hohen Silber-Gold Bereich, die sich jedoch aufgrund von Zeitproblemen aufgel&ouml;st haben\r\n\r\n\r\nW&uuml;rde mich &uuml;ber viele ernst gemeinte R&uuml;ckmeldungen freuen un, egal ob Team oder Dou q.\r\n\r\nAddet mich einfach Ingame und stellt euch kurz vor (2-3 S&auml;tze, was ihr such usw.)\r\nCeBoomCeBoom","replies":[]}