{"poster":"General Elephant","date":"2015-03-21T05:21:57.247+0000","title":"So... Urgot... I think I get him now.","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":5,"body":"So, for the longest time I made the same assumptions other people have... spam q for poke, build tear and turn it into muramana... i even used to max q first, which is STUPID.\n\nI've messed around a bit with different builds on him and came to a conclusion.... don't build mana items. The fewer mana items I built, the better I did. the trick is to max Q LAST and max e first, even though it is slightly higher in cost, you don't spam it, and the damage off it is pretty gnarly especially with the scaling armor shred. it is clearly his best asset. my end build looks kinda like this:\n\nedit: removed mallet cause bad idea\n\n{{item:3260}} {{item:3071}} {{item:3508}} {{item:3800}} {{item:3172}} {{item:3026}} \n\nedit2: disregard \"not use q very much\" and replace it with \"he needs to use his Q selectively in order to maintain mana balance while being able to stack AD\" He will spam Qs, but only when following up an E, or applying a slow off of w, or last hitting out of AA range. \n\nnote the lack of mana/mana regen. it is because Urgot should not use his q very much. it is the only reason he is is so mana starved, and if you use it only during all ins or to snag that last hit off a cannon, you can stay in lane without too much of a worry going oom. also getting blue when you can makes you godly when you have AD items.\n\nI'm probably gonna get a super amount of flame for suggesting such heresy by going against what literally everyone in the history of Urgot has said to build on him, but I feel that muramana takes too long to scale into effectiveness for him (and his early game is wher he needs help the most)that it actually makes sense to just pass on it and sink that gold into some hard and delicious AD. you don't need to spam q when it does massive amounts of damage due to a 1.0 ratio. also his E scales off of AD, and maxing it first and stacking AD and getting that armor shred all lead into the same path, doing a ton of damage.\n\nUrgot is meant to be played by making the most of his skills per use, not by abusing the stupid low CD on his Acid Hunter (q) because you'll just do little to no damage, go OOM, and be screwed.\n\nif you don't believe me, do a test run, play a bot game on him, and build him like you normally would, then try it my way and see what works better. I can tell you, Essence Reaver is a game changer for him.","replies":[]}