{"poster":"Tentakill Myself","date":"2015-08-09T14:21:36.294+0000","title":"@Riot, we are in dire NEED of 5 bans per side, and I'd like context on why this hasn't been added.","subforum":"Gameplay","up_votes":214,"down_votes":79,"body":"126 champs now, and we&#039;re still forced to ban only 6 of them. Here are ban-worthy candidates right now, please tell us how we are supposed to choose 3 to ban while the enemy team gets 3.\r\n\r\n{{champion:103}} {{champion:1}} {{champion:31}} {{champion:105}} {{champion:24}} {{champion:55}} {{champion:111}} {{champion:92}} {{champion:67}} {{champion:112}} {{champion:412}} {{champion:429}} {{champion:102}} \r\n\r\n@Riot, please explain what cancer I am supposed to choose to ban. ty.","replies":[{"poster":"PiVoRx","date":"2015-08-09T14:50:14.783+0000","up_votes":89,"down_votes":2,"body":"\"Ammount of bans is not an issue, ammount of shit we have to ban is\"\n- PiVoRx since forever","replies":[{"poster":"LaceUp23","date":"2015-08-09T18:59:17.493+0000","up_votes":7,"down_votes":13,"body":"This is exactly the problem lol. I don't see 5 bans being good for competitive play either. I mean, TSM would suck donkey nuts if they just banned Bjergsen's top 5 mid laners.","replies":[{"poster":"AMYS GRAVE","date":"2015-08-09T19:48:03.767+0000","up_votes":23,"down_votes":5,"body":"Well then maybe Bjergsen needs to learn more champs and/or TSM needs to learn to carry the game around him instead of relying on him to carry every game.","replies":[{"poster":"The Pungulator","date":"2015-08-09T20:13:32.779+0000","up_votes":9,"down_votes":17,"body":"How can one guy, even if he is a Pro Player, be at a pro level on more than 5 champions?\n\nI can understand being mediocre at a few champions, but being able to play them in pro level game play, and having full understanding of more than 5 champions? Even to me that seems a little unreasonable. \n\nOr maybe i'm just underestimating Bjergsen.","replies":[{"poster":"Seyunx","date":"2015-08-10T01:15:09.130+0000","up_votes":17,"down_votes":0,"body":"Or you know, the rest of the team has to actually be relevant on more than just one champ.","replies":[]},{"poster":"LaceUp23","date":"2015-08-09T20:29:47.023+0000","up_votes":8,"down_votes":2,"body":"No, you are correct. One of the biggest problem of lower elo players is that they try to play too many champs, so they don't have enough of them mastered.","replies":[]}]}]},{"poster":"Incandecense","date":"2015-08-10T03:01:03.065+0000","up_votes":2,"down_votes":0,"body":"there are technically 4 other players the opposing team has to account for. Nobody wins a game 1 v 5, especially at the pro scene.","replies":[]}]}]},{"poster":"RiotRepertoir","date":"2015-08-10T06:53:56.955+0000","up_votes":59,"down_votes":3,"body":"> please explain what cancer I am supposed to choose to ban\n\nThough I personally don't know why the ban count is three instead of 4 or 5 or even 2, what has actually changed recently that would make it so that you now need 2 additional bans per team? I could see the size of the roster growing being  a reason, but it's really not THAT much larger than it was at the beginning of the year.\n\nI actually think that having another ban or two could be cool, but mostly for reasons that are due to my own personal preference, and not necessarily because I think it makes the ranked play system any better. Even in the example you provided above, assuming those champions are ban worthy, the two captains could still only ban 10 of those 13 champions, and there would still be 3 left over. And of course, there would be all the champions that every other player in the game thinks are ban worthy that did not get banned, so it's hard to tell in that case if we'd really be any better off. One thing that would be especially painful about having 4 more total bans during the ban phase is how much longer each Draft Queue game would take. It may not sound like a big deal, but champion select already seems to drag on an eternity sometimes. I guess at the end of the day, I'm not really sure if we'd better or worse off with more bans.\n\nMaybe a different ban system entirely would be cool, like one where everyone in the game gets to ban 1 champion in the first thirty seconds or something. That would be faster, though it would come at the cost of ban overlap or team miscommunication getting a team off to an unfriendly start. Maybe ranked 5s and competitive play should be using a different system than solo queue; not sure entirely.\n\nWe were talking internally about some adjustments to the draft phase of champ select about a year ago, but I'm not sure any particular idea stuck out as the right solution. It's probably something worth exploring some more, since it is a part of every draft queue game we play.","replies":[{"poster":"Beoridas","date":"2015-08-10T07:05:21.378+0000","up_votes":8,"down_votes":0,"body":"Hey Repertoir.\n\nI think other logics could be applied here. You said how is more bans make ranked play better or that we NEED two more bans compared to the beginning of the year? Well two answers: how is 3 and not 1 makes it better? if you have an answer to give--then it can be applied to any numbers.  Also, this has been something people wanted for more than a year--actually since season 2-3. Now the champ difference is much larger than just the beginning of the year.\n\nDo you know also about the banning system of DoTa 2? i dont play that game but i saw a tournament once and it seemed pretty cool.\n\nI think each side had 3 bans since beta and 50 champs :p\n\n\nAlso to the exemple about the OP's list.  my previous logic still applies. the point is to ban not only super strong champions, but things that could threaten our team comp or specific lanes. Not everyone masters all these champs, but it does help filling these 3 reasons why we ban who we ban.","replies":[{"poster":"RiotRepertoir","date":"2015-08-10T07:21:49.944+0000","up_votes":30,"down_votes":2,"body":"Yeah, I didn't mean to suggest necessarily that this is a new problem this year. With that comment, I more meant to suggest to ask OP why the need was so dire now as opposed to before.\n\nI definitely agree that it would be great if the draft system was better suited for building out team comps better as a team and banning out stuff that threatened it rather than just banning the fotms.","replies":[{"poster":"Beoridas","date":"2015-08-10T07:32:41.058+0000","up_votes":10,"down_votes":0,"body":"I dont think its a matter of being dire NOW. But rather that this issue is accentuating with every new champ going into the pool. \nSince its been something in demand from season 2-3; needless to say that the feeling has only increased. \n\nIm not sure how the system could be better tbh. But i do believe, with all the arguments on the boards about it--you would find enough reasons why its not necessarily a bad idea (besides pro scene)\n\nOn a side note: If you see meddler, tell him to pop in on the boards. ive got a thread/trap just for him *evil laughter *cough *cough","replies":[{"poster":"Personwithhat","date":"2015-08-10T16:24:33.194+0000","up_votes":1,"down_votes":0,"body":"The issue ISN'T how many bans you have, it's how many CHAMPS are ban-worthy.\n\nWhen there are 13+ champs that are considered game-breaking and toxic, you have a problem.\n\nExtra bans don't solve it , it's like a tiny band-aid. -.-","replies":[{"poster":"Beoridas","date":"2015-08-10T16:35:42.088+0000","up_votes":2,"down_votes":1,"body":"even if there was 1 champ ban worthy. There would still be the team comp and lane threats to consider. When you think that since the 3 bans were implemented--that there is 50 champs difference btw then and now. You would then know that the game is vastly different but the need of bans have increased. More champs means more lane threats, more comps possible and more ban worthy champs. The eco-system of the game is vastly more complex. and there is always-ALWAYS going to be top dogs. IF we ever reach 200 champs: then that number will naturally go up.","replies":[{"poster":"Personwithhat","date":"2015-08-11T03:53:14.780+0000","up_votes":2,"down_votes":1,"body":"However it's impossible to go and create enough bans. 5 bans per team isn't enough , there are WAY to many toxic champions.\n\nIf LoL wasn't broken, and didn't have such a high quantity of broken champs, then yes, your reasoning would work.\n\nThat's a \"idealistic\" situation with an idealistic problem. For me though, the first step is reducing the amount of toxic champions, call it damage control. Then you give people more bans.\n\nIf I can ban all the toxic champions in the game, and then have 2-3 more personal bans, this would be a much more playable game. Sadly, even 10 bans isn't enough...... \n\nSo it's makes much more sense to reduce the amount of toxic champions than to hand out more bans when people would always ban the same champion anyway, for the same reason...obviously those champs have issues.....","replies":[{"poster":"Beoridas","date":"2015-08-11T04:05:21.771+0000","up_votes":1,"down_votes":0,"body":"thats beside the point. No one is saying there will be enough bans at X point. Or that all the champions I hate should be all banned from the game. Its a strategic decision. But when do the strategic decision makes sense or is relevant?-- is the real question to be asked. Even if a perfect number of bans were to be reached, it wouldnt matter because lane counters and counter-comps always exists. And its not because that perfect number is impossible that means we should have a status quo. Might aswell have no banning phase with that logic no?\n\nAs i said previously, the state and purpose of the banning phase is more or less relevant for the 3 major reasons we usual ban a champ. im not suggesting 5 bans. But im saying more than 3 will make that phase of the champ select more relevant strategically. (lets say ban disengage champs if you are going divers, and add shyvana cause shes op for instance) But current amount of choices makes it impossible to make such strategic choices.\n\nAnd as i said: there always will be top dogs. always.","replies":[{"poster":"Personwithhat","date":"2015-08-11T04:32:47.626+0000","up_votes":2,"down_votes":1,"body":"Again, unrelated to what I said.\n\nTake Vi for example. She fits into any comp, and singlehandedly changes the comp structure. She's broken, OP, and has a 20%+ ban rate for a reason.\n\nthere will be top-dogs with respect to champion counters, etc.\n\nChampions with little to no counterplay are BS. Topdogs with no counterplay are BS.\n\nTherefore removing toxic champs helps more anyways.....","replies":[{"poster":"Beoridas","date":"2015-08-11T05:14:15.852+0000","up_votes":1,"down_votes":0,"body":"I think you are talking about several things at once.\n\nfirst of all. What I was talking about with repertoir was that the numbers of bans doesnt change ranked for the better or not--that it wasnt because of the 5-6 new champs this year that its been called out to be done. You came i nthe conversation and added something saying that its all about the OP champs. So its not like im being irrelevant to the subject and OP. Even with 0 toxic champions, you need bans. Period. Helping or not helping that fact doesnt matter. When new items, nerfs to champs happens, new toxic patterns are born.\nNow if you mean that toxic design needs to be removed, then no one will argue with you. But its only a fragment of bans. Sated devourer for instance brought an enourmous amount of BS in the game. But thats not the champions who used them per se that are the problems)\n\nsecond of all: your Vi argument is a personal subjective one. I dont want to get into a Vi discussion with you. But ive heard people say that about every champ in the game and saying shes broken OP based on ban rate is a straw man. Besides: her ban rate is 1.3% which is 20X less than you say it was. Ban rate and perceived power doesnt equal broken.\nAlso, you need to understand something about comps. There is niche, there is broad purposes and roles.\nVi fitting in **most**comp is ok. Shes is ganker and a team fighter. J4 could fit in any comps just as much as her. Teams will always need these sort of champions.\nThen there is niche: Kassadin, veigar, urgot and trundle are niche. They fill specific roles as a solution to specific problems in the enemy composition while broad picks are to fit your own. Besides: i dont see vi going into a poke comp, life would be very lonely for her. But she would be great to fight into a poke comp/mage comp.\n\nthirdly: Top dogs was an illustration. I meant that no matter what happens in the game, there always will be stronger champs than others in specific categories : the broad purpose i was talking about. There always will be a better top laner, a better mid laner etc... thats just how the game is. its role-centric and doesnt fill a particular role other than being the stronger option.\n\nAlso, my stance is the same as Riot when it comes to counterplay. Counterplay is one aspect of balance. Its not all there is to it.\n\nThere is tradeoffs, champion eco-balance, weaknesses (which isnt necesserly a counterplay) and gameplay patterns.\n\nI would think you were talking about toxic designs, which everyone agrees with. But thats nto connected to bans anyway since you always will need those. but its part of the solution indeed. To eventually get access to strategic options.","replies":[{"poster":"Personwithhat","date":"2015-08-11T17:46:24.603+0000","up_votes":2,"down_votes":0,"body":"Nvmind about the ban-rate, used the wrong site. Lolking's better XD (sorry)\n\n'Even with 0 toxic champions, you need bans. Period. '\n\nI never argued against that.\n\nGod, I would love to hav ea match where , instead of banning toxic champions, I'd ban champions based on our comp and their comp and so on. That's what I hope for.\n\nALL I mean to say was that, until we remove the toxic champs, adding more bans will make much less of an impact.\n\nLess toxic champs -> bans now more worthy instead of the same every game, -> NOW adding more bans is much much better.\n\nAll I wanted to say Q_Q","replies":[]}]}]}]}]}]}]}]},{"poster":"Minrog","date":"2015-08-10T18:31:08.129+0000","up_votes":3,"down_votes":0,"body":"Too many overloaded champion kits.  {{champion:268}} {{champion:245}} {{champion:150}} {{champion:429}} new in the last year and {{champion:22}} {{champion:69}} {{champion:60}} {{champion:81}} {{champion:41}} {{champion:111}} {{champion:98}} {{champion:14}} were all modified to make them strong (I missed some I'm sure).\n\nThat's not to say all of these are toxic auto-ban cancers, but I saw just yesterday what happens when you have a character like {{champion:429}} show up in last rotation when UoL played Roccat in the Quarterfinals.  She hard counters an entire class of characters, the same as {{champion:157}} does, and 3 bans isn't enough to cover the OP class-based hard counter champions.\n\nIt's probably needed more bans since late Season 1, with the rate the characters are added.","replies":[]},{"poster":"dEAdbUs","date":"2015-08-10T13:21:24.110+0000","up_votes":3,"down_votes":0,"body":"I think its ok to ban fotms - people will be motivated to learn some more picks. Especially this will be great in new ranked draft, with only 2 roles per person.","replies":[]}]}]},{"poster":"Gixia","date":"2015-08-10T07:45:14.939+0000","up_votes":11,"down_votes":0,"body":"Personally, I like the idea of there being 5 bans per team only because I like the idea of each player getting 1 ban, instead of all the ban power going to just one player chosen at random. For professional play, or even ranked team queue, one person having all the bans is fine, because everyone is (theoretically) operating as a cohesive unit. But in solo queue this is absolutely not the case. Especially when every player has their own idea of what's ban worthy and what isn't.\n\nOne possible thing you could do I think, would be to have the ban phase operate on a level similar to blind pick, except without the blind. A 60 second window where all ten players can pick one champ at the same time and see each other's picks, including what the enemy team is choosing. These 10 picks will be the bans. That way each player gets one, everyone is picking at the same time so it speeds things up by only having one 60 second window instead of the 6 we have now, and everyone can see each other's bans so that there's no overlap.","replies":[]},{"poster":"Teridax68","date":"2015-08-10T15:47:40.470+0000","up_votes":2,"down_votes":0,"body":"I feel reducing per-player frustration might be a reason in itself to extend the number of bans from 6 to 10, and grant each player one ban. Ultimately, I don't think this would really change the competitive landscape all that much, since the next 4 most banned champions would enter pick-or-ban status and the pecking order wouldn't change, but it would likely give teams more ban flexibility, particularly in Solo queue games. Well-organized teams already have the communication to recommend their bans to the captain, who'd have the teamwork to ban champions in accordance with their team's strategy, but right now less organized teams are at the mercy of a captain who may not always have the time, pick-or-ban knowledge or team communication to choose the \"right\" champions, and so giving each of those players their own ban would level the playing field a lot more, and allow for individual players to each take some pressure off, even if their overall ban strategy may still not be the best in the world or include high-level planning.","replies":[]},{"poster":"IS1a442cd69a169ed293a39","date":"2015-08-10T11:17:20.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=VBEVLTvh,comment-id=004b,timestamp=2015-08-10T06:53:56.955+0000)\n>\n> Though I personally don't know why the ban count is three instead of 4 or 5 or even 2, what has actually changed recently that would make it so that you now need 2 additional bans per team? I could see the size of the roster growing being  a reason, but it's really not THAT much larger than it was at the beginning of the year.\n> \n> I actually think that having another ban or two could be cool, but mostly for reasons that are due to my own personal preference, and not necessarily because I think it makes the ranked play system any better. Even in the example you provided above, assuming those champions are ban worthy, the two captains could still only ban 10 of those 13 champions, and there would still be 3 left over. And of course, there would be all the champions that every other player in the game thinks are ban worthy that did not get banned, so it's hard to tell in that case if we'd really be any better off. One thing that would be especially painful about having 4 more total bans during the ban phase is how much longer each Draft Queue game would take. It may not sound like a big deal, but champion select already seems to drag on an eternity sometimes. I guess at the end of the day, I'm not really sure if we'd better or worse off with more bans.\n> \n> Maybe a different ban system entirely would be cool, like one where everyone in the game gets to ban 1 champion in the first thirty seconds or something. That would be faster, though it would come at the cost of ban overlap or team miscommunication getting a team off to an unfriendly start. Maybe ranked 5s and competitive play should be using a different system than solo queue; not sure entirely.\n> \n> We were talking internally about some adjustments to the draft phase of champ select about a year ago, but I'm not sure any particular idea stuck out as the right solution. It's probably something worth exploring some more, since it is a part of every draft queue game we play.\n\nUpvoting for a serious reply from Riot. Good job, regardless of the content, it's really nice to see Rioter replying sensitive topics.","replies":[]},{"poster":"Attysu The Poro","date":"2015-08-10T06:56:19.960+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=VBEVLTvh,comment-id=004b,timestamp=2015-08-10T06:53:56.955+0000)\n>\n> Though I personally don't know why the ban count is three instead of 4 or 5 or even 2, what has actually changed recently that would make it so that you now need 2 additional bans per team? I could see the size of the roster growing being  a reason, but it's really not THAT much larger than it was at the beginning of the year.\n> \n> I actually think that having another ban or two could be cool, but mostly for reasons that are due to my own personal preference, and not necessarily because I think it makes the ranked play system any better. Even in the example you provided above, assuming those champions are ban worthy, the two captains could still only ban 10 of those 13 champions, and there would still be 3 left over. And of course, there would be all the champions that every other player in the game thinks are ban worthy that did not get banned, so it's hard to tell in that case if we'd really be any better off. One thing that would be especially painful about having 4 more total bans during the ban phase is how much longer each Draft Queue game would take. It may not sound like a big deal, but champion select already seems to drag on an eternity sometimes. I guess at the end of the day, I'm not really sure if we'd better or worse off with more bans.\n> \n> Maybe a different ban system entirely would be cool, like one where everyone in the game gets to ban 1 champion in the first thirty seconds or something. That would be faster, though it would come at the cost of ban overlap or team miscommunication getting a team off to an unfriendly start. Maybe ranked 5s and competitive play should be using a different system than solo queue; not sure entirely.\n> \n> We were talking internally about some adjustments to the draft phase of champ select about a year ago, but I'm not sure any particular idea stuck out as the right solution. It's probably something worth exploring some more, since it is a part of every draft queue game we play.\n\nWe have over 120 champions now to what used to be 50 or 60 champs or something. This is an overdue change just for the sake of the roster growing.","replies":[{"poster":"TotalJerk","date":"2015-08-10T06:59:41.113+0000","up_votes":2,"down_votes":0,"body":"I'm more inclined to say back then 6 bans was too many. Being able to completely remove an entire tenth of the roster from play seems a bit much. In general I feel like the draft system stifles diversity because one is forced to go safe during their first pick to avoid being counter picked, and the rest of the picks revolve around that first pick, leading to a game where the meta revolves around the champions with the softest counters.","replies":[]}]}]},{"poster":"colesy","date":"2015-08-09T14:28:20.445+0000","up_votes":63,"down_votes":21,"body":"katarina and jax ban worthy\n\nahahahahahahahaha","replies":[{"poster":"Tentakill Myself","date":"2015-08-09T14:54:53.260+0000","up_votes":57,"down_votes":12,"body":"> [{quoted}](name=colešy,realm=EUW,application-id=3ErqAdtq,discussion-id=VBEVLTvh,comment-id=0000,timestamp=2015-08-09T14:28:20.445+0000)\n>\n> katarina and jax ban worthy\n> \n> ahahahahahahahaha\n\nIn my personal opinion and experience, I'd rather wipe my ass with a cheese grater than go against another devourer jax.","replies":[{"poster":"Sassmast3r","date":"2015-08-09T16:36:58.761+0000","up_votes":27,"down_votes":6,"body":"Upvoted since someone down voted you and lets be honest, if the rest of the community sees one down vote, then your post is automatically going to get down voted about 50 times because of sheeple. Honestly unsure why this even got downvotes, devourer Jax is an atrocity right now. Same with Kayle, Udyr, Shyvana, etc. Sated Devourer has created some of the biggest atrocities I myself have ever even seen.","replies":[{"poster":"magic pole","date":"2015-08-09T16:52:19.224+0000","up_votes":12,"down_votes":0,"body":"{{champion:10}}  lmao...\n\nnothing noteworthy...but then as soon as she gets {{item:3933}}, kills anyone in like 3 aa's, not even exaggerating. especially true because it's not uncommon for her to have it by 20-25 mins, when even tanks aren't very tanky yet.  gotta be one of if not the biggest power spike I've ever seen","replies":[{"poster":"Ancestor007","date":"2015-08-09T18:45:28.800+0000","up_votes":9,"down_votes":0,"body":"Oh boy {{champion:10}} {{item:3933}} {{item:3115}} {{item:3085}} {{item:3116}} {{item:3006}} {{item:3153}} = gg","replies":[{"poster":"Trash ADC Btw","date":"2015-08-09T23:53:23.194+0000","up_votes":2,"down_votes":0,"body":"correction.\n\n{{champion:10}} {{item:3933}} {{item:3153}}  = gg","replies":[{"poster":"Ancestor007","date":"2015-08-10T05:58:52.227+0000","up_votes":3,"down_votes":0,"body":"No,no. I mean 1 v 5 gg","replies":[]}]}]}]},{"poster":"Remlap1223","date":"2015-08-09T17:42:57.288+0000","up_votes":3,"down_votes":0,"body":"> Upvoted since someone down voted you and lets be honest, if the rest of the community sees one down vote, then your post is automatically going to get down voted about 50 times because of sheeple.\n\nBoards in a shellnut (yes, I'm intentionally being ironic.  Yes, I'm intentionally using nutshell incorrectly.)","replies":[]}]},{"poster":"Knalxz","date":"2015-08-10T01:40:24.610+0000","up_votes":17,"down_votes":0,"body":"https://24.media.tumblr.com/8bef1830dc03107edb0e7deaa1299e8e/tumblr_n5c2gkWNBG1rb05gbo1_400.gif","replies":[]},{"poster":"T RexHasTinyArms","date":"2015-08-09T18:12:47.629+0000","up_votes":3,"down_votes":0,"body":"The problem with this statement is that Xin, Kayle, and Udyr are all better devourer champs than jax and not on the list.","replies":[]}]},{"poster":"Saianna","date":"2015-08-09T19:03:39.334+0000","up_votes":4,"down_votes":0,"body":"kat might be a crap in team vs team with teamspeaks and great cooridination, but in solo que, she's quite beast'ish.\n\nStill some people dislike playing against her, so giving slightly bigger ban pool could fix that :)","replies":[]}]},{"poster":"Keevalroy","date":"2015-08-09T15:50:23.362+0000","up_votes":11,"down_votes":10,"body":"You want context?  Once again, the pro scene is taking a much higher priority than the rest of us.  They want LCS to be fun an exciting for spectators by showing them the fluid and practiced hands of pro players on champion's they've mastered rather than forcing them onto something they aren't prepared for and watching them hesitate and second-guess themselves while playing.  It doesn't make for an exciting match, so they won't touch the bans.\n\nIf bans are that big of a problem, keep 6 bans for your precious little LCS stars, and add 4 bans to the MAJORITY of the playerbase.  Spectators should NEVER come first Riot, and judging from this awful patch coming up, you have forgotten yet again.","replies":[{"poster":"ChaoticPinecone","date":"2015-08-09T16:26:25.818+0000","up_votes":19,"down_votes":5,"body":"not everybody wants an increase of bans.","replies":[{"poster":"Trash ADC Btw","date":"2015-08-09T23:54:40.848+0000","up_votes":7,"down_votes":2,"body":"Hence the word \"Majority\" and not \"Entirety\".","replies":[]}]}]},{"poster":"Dengeden","date":"2015-08-09T17:03:57.758+0000","up_votes":17,"down_votes":5,"body":"There's nothing in the game that's pick or ban, it's all a matter of personal preference. \n\nDon't like snowball? Ban Vayne, Kat and Riven. Don't like solid picks that never fall off? Ban Viktor, Naut and Thresh. Don't like cheese? Ban Fizz, Jax and Cho.\n\n@community, don't use the word \"cancer\" and/or other inflammatory terms if you're interested in a red response, ty.","replies":[{"poster":"Trash ADC Btw","date":"2015-08-09T23:55:44.202+0000","up_votes":8,"down_votes":1,"body":"Not pick/banning sated users is currently concession if the enemy player is halfway good.","replies":[{"poster":"Dengeden","date":"2015-08-10T04:47:10.053+0000","up_votes":1,"down_votes":2,"body":"Well, firstly, banning 2 of the 3 I mentioned usually provokes the 3rd of the 3 I mentioned. \nSecondly, really? Aren't there way too many sated devourer junglers for any 1 of them to be a problem?","replies":[{"poster":"Trash ADC Btw","date":"2015-08-10T04:53:33.423+0000","up_votes":3,"down_votes":1,"body":"Kayle, Vayne, Yi, Jax, Shyvana. Those are the ones I've seen the most.","replies":[{"poster":"Dengeden","date":"2015-08-10T13:48:38.558+0000","up_votes":1,"down_votes":1,"body":"And none of them really stand out, do they? If they pick one, you pick one (if you want), fight fire with fire.","replies":[{"poster":"Trash ADC Btw","date":"2015-08-10T15:02:46.679+0000","up_votes":2,"down_votes":0,"body":"It shouldn't be a necessary thing to have a single item on the team. Ever.","replies":[]}]}]}]}]}]},{"poster":"Diode","date":"2015-08-09T17:13:38.256+0000","up_votes":7,"down_votes":0,"body":"lol i see wat yu did thar, Dire(dota 2), 5 bans (dota 2).\nvery cleverl.","replies":[]},{"poster":"HumanPerfect","date":"2015-08-09T14:35:05.948+0000","up_votes":6,"down_votes":0,"body":"I think the general reasoning they previously gave for not increasing number of bans is that they did not want to increase the amount of time players spend in champ select. I think 4 bans per team is a good number, maybe decrease the amount of time players have to select a champion / time to trade or dodge after all champs are selected to compensate.","replies":[]},{"poster":"KilljoyX","date":"2015-08-09T14:52:56.237+0000","up_votes":9,"down_votes":14,"body":"Why? So you can force junglers to master 12 champions to get a playable jungler? Everyone bans out the jungle every freeking game anyway.","replies":[{"poster":"Tails Doll","date":"2015-08-09T16:36:54.185+0000","up_votes":13,"down_votes":5,"body":"> [{quoted}](name=KilljoyX,realm=NA,application-id=3ErqAdtq,discussion-id=VBEVLTvh,comment-id=0006,timestamp=2015-08-09T14:52:56.237+0000)\n>\n> Why? So you can force junglers to master 12 champions to get a playable jungler? Everyone bans out the jungle every freeking game anyway.\n\nWould that be so bad?","replies":[{"poster":"Icestar1186","date":"2015-08-09T17:00:10.124+0000","up_votes":9,"down_votes":4,"body":"Yes, actually. I prefer to be able to play my main role without having to master a huge number of champions.","replies":[]}]}]}]}