{"poster":"koochario","date":"2018-07-03T04:46:23.011+0000","title":"\"Having A Verified E-mail Will Become Mandatory In A Month\"","subforum":"Gameplay","up_votes":8,"down_votes":1,"body":"Why does Riot need my personal info? I get that it helps security but why force it on me? That seems incredibly overbearing. I want my privacy and if Riot isn't selling personal data, why not respect that? \n\nAs a side note, why not let people put their status to offline. In high ELO, a lot of people on one's friend list frequently target ban. You should be able to hide your status. This is a basic feature.","replies":[{"poster":"Chermorg","date":"2018-07-03T05:07:11.771+0000","up_votes":1,"down_votes":0,"body":"Players are reminded that any type of \"inorganic\" voting, defined as voting through means that do not identify one player who legitimately found a thread to one legitimate vote on that thread, is prohibited by the [Universal Rules](https://boards.na.leagueoflegends.com/en/c/community-moderation/ITFIpNUE). Examples of this include, but are not limited to, \"brigading\" others to have them come vote when they would not see a thread otherwise, asking others to upvote/downvote threads, using alternate accounts to vote on threads, persuading friends to come to the boards and begin using them to vote on your thread, and any other means by which a vote count may be artificially altered (up or down). As it is evident that this thread is a victim of inorganic voting, the voting has been locked on this thread. If you have any questions about this please do not hesitate to contact us in the [Boards Moderation Discord server](https://boards.na.leagueoflegends.com/en/c/community-moderation/7rtKBZLi-boards-moderation-discord-verification).\n\nPlease remember also that this is not necessarily a reflection on the original poster of this thread - it is wholly possible for vote manipulation to occur by users other than the original poster.","replies":[{"poster":"Aptest","date":"2018-07-05T18:04:09.930+0000","up_votes":1,"down_votes":0,"body":"Chermog is reminded that his current remark is [insert appropriate derogatory term], and that the \"universal\" rules should, with respect to this case, both change their title and also [redacted].","replies":[]},{"poster":"UpDownLeftRightAB","date":"2018-07-03T10:22:24.877+0000","up_votes":1,"down_votes":0,"body":"Why is this even a rule if the points don't matter?","replies":[]}]},{"poster":"Colonel J","date":"2018-07-06T06:39:07.697+0000","up_votes":1,"down_votes":0,"body":"What happens if I don't bother verifying my current email?","replies":[]},{"poster":"SwiftKitten88","date":"2018-07-05T16:26:16.001+0000","up_votes":1,"down_votes":0,"body":"if this thread is locked how does it keep getting bumped\n\nmay want to fix that riot","replies":[{"poster":"HalcyonDweller","date":"2018-07-05T16:43:12.290+0000","up_votes":1,"down_votes":0,"body":"Switch to chronological view. You will see that people are still having discussions in the comments.","replies":[]}]},{"poster":"BlackEyesBlue","date":"2018-07-03T13:03:23.935+0000","up_votes":1,"down_votes":0,"body":"Sounds like a potential counter measure to the growing smurf problem to me. A way to connect two accounts besides IP address which could punish the innocent.\n\nForgive me if there is something I'm missing... but how much privacy do you expect? Companies have needed an active e-mail account to render services since the cyber age began! The only freedoms I see this impacting are :\n\n1) People's ability to create disposable smurf accounts, Which are regularly responsible for ruining OTHER players gaming experience... and;\n\n2) Buying accounts, which goes against the terms of use in the first place!\n\nSounds like a sound idea from my point of view.","replies":[{"poster":"Madsin25","date":"2018-07-03T15:17:04.143+0000","up_votes":1,"down_votes":0,"body":"You can't stop people from smurfing through an IP address.(well you can but that would be a dick move)\n\nYou have brothers/sisters/fathers that play on different computers through the same IP.","replies":[{"poster":"HalcyonDweller","date":"2018-07-03T15:24:08.298+0000","up_votes":1,"down_votes":0,"body":"Actually, it would be simple enough to make it reparable with an appeal system. That brings attention to the person in the household who is behaving immorally in the game while still allowing the household to get their access to the game back.","replies":[{"poster":"BlackEyesBlue","date":"2018-07-03T21:11:31.023+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HalcyonDweller,realm=NA,application-id=3ErqAdtq,discussion-id=AcNtcHMO,comment-id=000600000001,timestamp=2018-07-03T15:24:08.298+0000)\n>\n> Actually, it would be simple enough to make it reparable with an appeal system. That brings attention to the person in the household who is behaving immorally in the game while still allowing the household to get their access to the game back.\n\nProblem there is it's not just households.\n\nDorms, apartment buildings, prisons, heck even McDonalds! I know banning the address is impossible. But if you have 2+ accounts on one e-mail address? Chances are its one person.","replies":[{"poster":"HalcyonDweller","date":"2018-07-03T21:25:41.863+0000","up_votes":1,"down_votes":0,"body":"I'm not suggesting it be done to just the whole house, there are ways to ensure it only affects the computer that was used to play on the accounts in question. And if that computer is shared, well... then the appeals process still enables people to have it lifted.\n\nHave you tried making multiple accounts with the same email address? As far as I knew that was a 1 for 1 deal, you couldn't just have 2 league accounts for the same email.","replies":[{"poster":"Sys","date":"2018-07-04T10:13:31.856+0000","up_votes":1,"down_votes":0,"body":"I might have misunderstood something, but IP bans become useless when you actually don't ban the ip (\"there are ways to ensure it only affects the computer\"), but the device instead. And if it was made into PC/device ban, anyone could evade the ban with 1 simple software.","replies":[{"poster":"HalcyonDweller","date":"2018-07-04T18:45:34.339+0000","up_votes":1,"down_votes":0,"body":"There's ways for Riot to do it, I don't want to go into detail in case they already do, because that would help people look for ways to circumvent it. But there are absolutely ways. It involves combining information from a variety of checks and methods.","replies":[{"poster":"Sys","date":"2018-07-05T16:13:06.858+0000","up_votes":1,"down_votes":0,"body":"There is no such thing as an absolute ban.\nHow to avoid any ban 101, install new OS on a new disk partition, use a proxy and mask your hardware.","replies":[{"poster":"HalcyonDweller","date":"2018-07-05T16:24:45.344+0000","up_votes":1,"down_votes":0,"body":"Actually there's lots of ways to track things. It's not perfect but it doesn't have to be. It just has to be too much trouble to bother with. If it takes too much effort to circumvent then the toxic idiots who would otherwise make more accounts will give up after their first few bans. Additionally, by affecting a shared computer or network, you can turn social pressure of people who share that connection with them against them.","replies":[{"poster":"Sys","date":"2018-07-05T16:33:58.193+0000","up_votes":1,"down_votes":0,"body":"True, didn't think about that.","replies":[]}]}]}]}]}]}]}]},{"poster":"DrCyanide","date":"2018-07-03T15:19:28.035+0000","up_votes":1,"down_votes":0,"body":"Yes, that's why they said \"A way to connect two accounts besides IP address *which could punish the innocent.*\"","replies":[]}]}]},{"poster":"Carezam","date":"2018-07-05T10:56:06.396+0000","up_votes":1,"down_votes":0,"body":"Why do you need my personal information? It is none of your business. There are always people prying me for information like Riot does now.\n\n> For those of you worried about your personally identifying data, we do not share, sell or trade it for rare Pokémon, you can read the privacy policy here. Also as we announced a few months back, as part of the GDPR evaluation we have taken steps to better protect & encrypt player data that we store.\n\nYour false promises are not good enough. Bye LoL.","replies":[]},{"poster":"DeathBurst","date":"2018-07-03T23:48:36.616+0000","up_votes":1,"down_votes":0,"body":"If that's your worry, it's pretty easy to create a throw-away email. I have 5 personal addresses I'm using right now, + 1 for every lab/company I ever worked at. And that's all *real* emails, it's even easier to create fake/throwaway emails.","replies":[{"poster":"BlackEyesBlue","date":"2018-07-04T13:43:15.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeathBurs7,realm=EUW,application-id=3ErqAdtq,discussion-id=AcNtcHMO,comment-id=000b,timestamp=2018-07-03T23:48:36.616+0000)\n>\n> If that&#x27;s your worry, it&#x27;s pretty easy to create a throw-away email. I have 5 personal addresses I&#x27;m using right now, + 1 for every lab/company I ever worked at. And that&#x27;s all *real* emails, it&#x27;s even easier to create fake/throwaway emails.\n\nTrue enough but it's still an extra layer of effort to create a disruptive account. In my experience? making things even a little bit more complicated is enough to keep most people from doing it if they are just in it for the LOL's.","replies":[{"poster":"DeathBurst","date":"2018-07-04T16:40:55.633+0000","up_votes":1,"down_votes":0,"body":"True, but on the other hand, giving a mail isn't exactly handing over your whole private life to Riot.\n\nMost people won't bother and will give a tiny amount of data to Riot, and no big deal, and for the few who cares, it's easy enough to workaround. Riot is no Google or Facebook.\n\nNot to mention that a lot of people have *already* given an email, so the impact of this change is even smaller once you take that into account.","replies":[]}]}]},{"poster":"Riot Ruin3d","date":"2018-07-03T16:36:18.378+0000","up_votes":1,"down_votes":0,"body":"Verified emails provide a number of benefits that we felt outweighed any potential pain caused by having to go through this process.\n\nAs just one example:\nWithout a verified email if your account is compromised we need to manually verify you are the account owner through the Player Support team which means you aren't able to play for hours.\n\nWith verified emails we can make that process automated, allowing you to unlock your own account quickly and easily. \n\nIt also allows us to add more security features like multi factor authentication which will be coming soon(TM) so you can better protect your accounts.\n\nFor those of you worried about your personally identifying data, we do not share, sell or trade it for rare Pokémon, you can read the privacy policy [here](https://na.leagueoflegends.com/en/legal/privacy).  Also as we announced a few months back, as part of the GDPR evaluation we have taken steps to better protect & encrypt player data that we store.\n\nEmail preferences for marketing mails are also separate so this doesn't mean you are suddenly going to start getting promotional mails or anything like that (unless you decide to opt in). In the future we plan to add a preferences center to make it a little easier to manage what types of emails you do or do not want to get from Riot.","replies":[]},{"poster":"Dokueki Kenshin","date":"2018-07-03T15:42:14.830+0000","up_votes":1,"down_votes":0,"body":"I seriously think they should have all accounts be SMS verified. You avoid the issue of blanket banning people with IP addresses who don’t deserve it while having a fairly reliable method of preventing deviant players from reentering the playerbase.","replies":[]},{"poster":"DrCyanide","date":"2018-07-03T15:21:30.088+0000","up_votes":1,"down_votes":0,"body":"Ironically, verified email accounts might be required as a result of following privacy laws that the EU passed.\n\nBesides, are you *really* signing up for new services with random email addresses that you don't own?","replies":[]},{"poster":"Devaliah","date":"2018-07-03T14:59:39.720+0000","up_votes":1,"down_votes":0,"body":"Honestly, surprised its not already mandatory. MOST services require you to verify your account with an email at MINIMUM. This helps with account recovery, emails for promo's and news (usually opted in/out by choice) protects your account with an extra layer of security, and helps limit \"shadier\" occurrences in game. If you are outraged by this you better throw your Windows/Mac computer out the window. I got bad news for you >.>\n\nSecond: I would actually love an invisible status, for my more antisocial days. As it is i already set my status to DND most the time.","replies":[]},{"poster":"Daddy Ants","date":"2018-07-03T10:34:49.012+0000","up_votes":1,"down_votes":0,"body":"Verified email addresses is a layer of security on your account.\n\nIf someone logs in and tries to change your password or email address, they can't without a verification code sent to your verified email.","replies":[]},{"poster":"deathgod5","date":"2018-07-03T10:30:47.808+0000","up_votes":1,"down_votes":0,"body":"Any email you make on Gmail or Microsoft Outlook is verified if riot sends a confirmation email. Although I agree with you, if you want your privacy to remain so just make an outlook account, they even give you the options to make pseudonym email(alternative names on the same email) addresses so that companies can't know your true email name.\n\n\nHaving said all that, it is bullshit that this is an obligation.","replies":[]},{"poster":"Unstoppable Monk","date":"2018-07-03T06:05:52.664+0000","up_votes":1,"down_votes":0,"body":"So you can just shut down any poll you want as long as voting is slightly messed up? Seems legit.","replies":[]},{"poster":"C9 Rush","date":"2018-07-03T05:27:48.600+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}}","replies":[]},{"poster":"Periscope","date":"2018-07-03T04:50:13.749+0000","up_votes":1,"down_votes":0,"body":"Where was that said?","replies":[]}]}