{"poster":"Feyvin","date":"2015-12-11T11:44:54.040+0000","title":"Suche evtl einen Clan","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Community (; \r\nMein Name ist Michelle, ich bin 19 Jahre, aktuell Gold &amp; ja.. \r\nIch besitze TS&sup3;, Skype etc. \r\n\r\nNun mal zu meinem Anliegen:\r\nIch bin schon h&auml;ufiger durch die Weiten des Forums getigert &amp; habe h&auml;ufiger Posts von sogenannten &quot;Clans&quot; gesehen, habe sie mir auch das ein ums anderemal durchgelesen, aber nie wirklich aktiv nach einem &quot;Clan&quot; gesucht. \r\nLetztens hat mich dann mein Mid Laner mal darauf angesprochen, ob wir uns denn nicht einen &quot;Clan&quot; suchen wollen, denn es w&auml;re doch eine &quot;Bereicherung&quot; ..\r\nIch war etwas gemischter Gef&uuml;hle, habe mich dann doch mal auf die Suche gemacht. \r\nAllerdings war ich schon in den ersten Minuten demotiviert.. \r\n\r\nAlso hab ich mir gedacht, warum nicht einfach mal die Community fragen ? :D\r\n\r\nK&ouml;nnt ihr irgendwas empfehlen ? \r\nWenn ja postet es doch bitte in die Kommentare (;","replies":[{"poster":"Skill3s","date":"2015-12-13T13:22:51.687+0000","up_votes":1,"down_votes":0,"body":"Naja, die meisten Angebote, die ich hier sehe sind für Positionen in Teams. Ich würde dir empfehlen dir eine LoL-Community mit TS zu suchen, wo der Sinn des TS nur ist, dass man Leute zum zocken findet.","replies":[]},{"poster":"EnP DonPR","date":"2015-12-12T11:02:25.495+0000","up_votes":1,"down_votes":0,"body":"Was soll ich da gross sagen :)\n\nIch war jetzt kürzlich in diversen Clans und muss einfach dazu sagen, dass man das ganze nicht für die Ewigkeit macht. Schau rein, freunde dich mit den Spielern an, bei denen du das Gefühl hast, das klingt doch gut und falls du keine eigene Plattform zum quatschen hast, habt ihr ja den entsprechenden TS-Channel.\n\nIch mache jetzt hier heftige Werbung für unseren eben erst gegründeten Clan, mit nicht weniger als zwei sehr umgänglichen Clanleadern.\n\nDer Clan ist nicht mal ein paar Tage alt, dementsprechend sind wir momentan noch sehr bodenständig und mir persönlich liegt auch immer das Wohl der Community am Herzen. Die Ziele sind hoch, dementsprechend fördern wir die Mitglieder und versuchen zusammen besser zu werden.\n\nZudem ist langjährige Führungserfahrung vorhanden und ebenfalls Videomaterial, falls nach spezifischen Champions gefragt wird. Wie gesagt, mir liegt das Wohl der Mitglieder am Herzen und mein Partner versucht die Motivation für die persönliche Verbesserung in Richtung eSports zu fördern.\n\nKannst mich gerne mal Ingame adden und dann können wir sicher mal ein kleines Schwätzchen halten, sofern du interessiert bist :)\n\nIGN: EnP DonPR\n\nLG\nIvan","replies":[]},{"poster":"GoW Phoenix","date":"2015-12-11T14:47:49.218+0000","up_votes":1,"down_votes":0,"body":"Hi Michelle ^^ uns gib es jetzt seit gut 2 jahren. habe 8 aktive Teams d.h. über 40 user die den namen GoW im game schon tragen und suchen immer nette und aktive member. Kannst ja einfach mit deinem Kumpel vorbei schauen. ts3:  Gowclan.4np.de       Mit Herzlichen Grüßen GoW Phoenix","replies":[]},{"poster":"Phirippu","date":"2015-12-11T13:10:42.131+0000","up_votes":1,"down_votes":0,"body":"Ich selber habe versucht einen clan aufzustellen, was zu ca 10 leuten geführt hat, die aber nicht wirklich \"clan-aktiv\" waren und auch nicht wirklich ein Team wollten und sich dahinter geklemmt haben. \nIch will hier aber damit keine Werbung machen, sondern dir zeigen, dass es verschieden Clans, mit verschiedenen Zielen gibt.\nDu musst dir halt überlegen, was der clan bieten soll, welche Anforderungen hat und was er erreichen will.\nSchau doch mal auf  www.clans.de ,\n wenn du ganz runter scrollst siehst du sogenannte Clans-des-monats und erfolgreiche Clans, vielleicht findest du da was.\nAnsonsten hilft auch oft ein kleines Gespräch mit den admins des Clans, so dass dir schnell klar wird ob ihr da rein passt oder nicht.\n\nAlso viel Glück bei deiner Suche\nFirippu1y0","replies":[]},{"poster":"Nephirelle","date":"2015-12-11T12:00:34.773+0000","up_votes":1,"down_votes":0,"body":"Ich war schon in diversen Spielen in Clans, aber ich muss sagen, dass es schon echt schwierig ist, an einen zu geraten, dem nicht nach spätestens drei Monaten die aktiven Mitglieder ausgehen. Oft werden die schnell gegründet, weil jemand mal Chef spielen wollte und genauso schnell wieder geschlossen, wenn das Interesse schwindet. \n\nIch würde dir daher bei deiner Suche raten nach Clans Ausschau halten, bei denen es mehr als nur einen Organisator gibt und der schon ein Weilchen existiert, vielleicht so ein Jahr lang. Denn eines ist meiner Meinung nach schon richtig: Ein guter Clan kann eine enorme Bereicherung sein was die soziale Komponente in Online-Spielen angeht.\n\nZudem solltest du dich auch fragen, was genau du in dem Spiel erreichen willst: Willst du einfach nur ein bisschen Spaß haben und dich mit anderen unverbindlich austauschen oder willst du dich so weit wie möglich nach oben kämpfen und bestehst auf ständiges Training, Clan-Wars oder was auch immer da noch so existiert. Da sind die einzelnen Clans tatsächlich auch sehr unterschiedlich orientiert.","replies":[{"poster":"NGC Polyxena","date":"2015-12-11T12:05:31.617+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nephirelle,realm=EUW,application-id=ElKI1ocy,discussion-id=jTphdOEP,comment-id=0001,timestamp=2015-12-11T12:00:34.773+0000)\n>\n> Ich war schon in diversen Spielen in Clans, aber ich muss sagen, dass es schon echt schwierig ist, an einen zu geraten, dem nicht nach spätestens drei Monaten die aktiven Mitglieder ausgehen. Oft werden die schnell gegründet, weil jemand mal Chef spielen wollte und genauso schnell wieder geschlossen, wenn das Interesse schwindet. \n> \n> Ich würde dir daher bei deiner Suche raten nach Clans Ausschau halten, bei denen es mehr als nur einen Organisator gibt und der schon ein Weilchen existiert, vielleicht so ein Jahr lang. Denn eines ist meiner Meinung nach schon richtig: Ein guter Clan kann eine enorme Bereicherung sein was die soziale Komponente in Online-Spielen angeht.\n> \n> Zudem solltest du dich auch fragen, was genau du in dem Spiel erreichen willst: Willst du einfach nur ein bisschen Spaß haben und dich mit anderen unverbindlich austauschen oder willst du dich so weit wie möglich nach oben kämpfen und bestehst auf ständiges Training, Clan-Wars oder was auch immer da noch so existiert. Da sind die einzelnen Clans tatsächlich auch sehr unterschiedlich orientiert.\n\nEinerseits ist es richtig, dass man sich genau informieren sollte was die Struktur und die Pläne des Clans / der Community angeht. Aber direkt zu sagen man muss nach Clans schauen, die mehr als 1 Jahr bestehen ist falsch. Wir bestehen auch noch nicht lange und ich kann mit Sicherheit  sagen, dass unsere Vorstände große Pläne haben und zum Teil selbst mehr als 7 Jahre Communities geleitet haben. \n\nGesundes Misstrauen ist an sich immer gut, aber übertreiben sollte man es nicht (das wollte ich damit ausdrücken ;) ).","replies":[{"poster":"Nephirelle","date":"2015-12-11T12:25:42.598+0000","up_votes":1,"down_votes":0,"body":"Auch Clans, die länger als ein Jahr bestehen, bestehen vorher erstmal nur drei Monate, dann vier Monate, ... Irgendwo muss man ja anfangen. Die Ambitionen sind bei allen erstmal recht groß. Was ich damit sagen will: Bei Clans, die schon länger bestehen, ist die Chance einfach größer, dass sie auch noch eine Weile weiter bestehen werden als bei einem gerade frisch gegründeten.\n\nIch finde ein Jahr jetzt nicht so viel. Aber ich bin auch schon ein etwas älteres Semester ;)","replies":[]}]},{"poster":"Feyvin","date":"2015-12-11T12:31:11.340+0000","up_votes":1,"down_votes":1,"body":"Mir geht es zum einen darum Spaß zu haben, das steht fest, denn Spaß gehört in einem Spiel nunmal dazu. \nSicherlich wollen wir einfach spielen um eben diesen Spaß zu haben & zum anderen möchte ich auch dazu lernen, denn man kann sich immer verbessern. Und die Vielfalt eines Clans kann dazu auch beitragen, indem man sich untereinander austauscht ... \n\nAndererseits möchte ich mich auch zu nichts \"verpflichtet\" fühlen. \nDas heißt Clanaktivität gut & schön, aber \"Clan Tags\" & sowas kann ich nicht gebrauchen :D\nMan stelle sich nur mal vor, dass eine Aufnahmebedingung wäre sich umzunennen & dann kommt man doch nicht mit allen Leuten klar oder merkt früher oder später, dass es nicht passt & nennt sich nochmal um. \nSo lange spiel ich nun auch nicht um mir das ständig (via IP) leisten zu können .","replies":[{"poster":"NGC Polyxena","date":"2015-12-11T13:19:04.793+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kônekô,realm=EUW,application-id=ElKI1ocy,discussion-id=jTphdOEP,comment-id=00010001,timestamp=2015-12-11T12:31:11.340+0000)\n>\n> Mir geht es zum einen darum Spaß zu haben, das steht fest, denn Spaß gehört in einem Spiel nunmal dazu. \n> Sicherlich wollen wir einfach spielen um eben diesen Spaß zu haben & zum anderen möchte ich auch dazu lernen, denn man kann sich immer verbessern. Und die Vielfalt eines Clans kann dazu auch beitragen, indem man sich untereinander austauscht ... \n> \n> Andererseits möchte ich mich auch zu nichts \"verpflichtet\" fühlen. \n> Das heißt Clanaktivität gut & schön, aber \"Clan Tags\" & sowas kann ich nicht gebrauchen :D\n> Man stelle sich nur mal vor, dass eine Aufnahmebedingung wäre sich umzunennen & dann kommt man doch nicht mit allen Leuten klar oder merkt früher oder später, dass es nicht passt & nennt sich nochmal um. \n> So lange spiel ich nun auch nicht um mir das ständig (via IP) leisten zu können .\n\nAlso ich spiele mal auf das Thema \"Tags\" an. Ich habe mir das Tag einfach so gemacht, weil ich es wollte :) bei uns gibt es keine Verpflichtungen außer sich immer mal wieder blicken zu lassen und im Forum registriert zu sein. Wir wollen auch keine solcher Verpflichtungen einführen, da es wie du bereits sagtest immer sein kann, dass etwas passiert (man mag die Community doch nicht so, hat andere Vorstellungen, usw.)\n\nSelbst Spieler, die eines unserer Teams joinen sind nicht dazu verpflichtet auch der Community beizutreten noch ist das Team verpflichtet den Namen NOVA zu nutzen!","replies":[]}]}]},{"poster":"NGC Polyxena","date":"2015-12-11T11:48:15.796+0000","up_votes":1,"down_votes":0,"body":"Hallöchen Michelle,\n\nwenn du möchtest kannst du dir gerne einmal unsere Community ansehen: http://nova.community . Wir sind eine relativ frisch gegründete ü18 Multigaming Community und haben bereits mehr als 100 Trial Mitglieder im LoL Bereich aufgenommen. Bei uns findet ihr beiden jeden Abend einige lustige, verrückte und vor allem erwachsene Mitspieler für Normals / Rankeds / Arams und Co.\n\nFalls ihr Fragen habt zögert bitte nicht euch an mich zu wenden.\n\nLiebe Grüße und vielleicht bis bald\nNOVA Polyxena | Julia","replies":[]}]}