{"poster":"Evocati","date":"2017-10-23T02:25:42.323+0000","title":"Riot i need help plus i may need cops..","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"i played a ranked game and another player added me to after it. so i said fine ill add it.\r\ni added it and and all his texts are talking about killing me and killing my family.. i feel scared and im shaking atm. i dont have naything wrong. CAN YOU PLEASE HELP ME!!!!! this is beyond toxic this is a life... help me","replies":[{"poster":"kattzkitti","date":"2017-10-23T04:27:29.367+0000","up_votes":3,"down_votes":0,"body":"The player is most likely not serious about their threats, and are just trolling to get a rise out of you. However, there is always the chance they are serious about it. They are rare but there are real occurrences of gamers committing heinous acts against other gamers over negative experiences that happened in a game.\n\nIn a case like this where there are death threats on the table, I would say err on the side of caution and report this to your local police using the non-emergency line. If you happen to have the chat messages still available, take screenshots to show them in the case they request such. _**Be sure not to edit the screenshots in any way.**_","replies":[]},{"poster":"Broporo","date":"2017-10-23T03:35:30.581+0000","up_votes":3,"down_votes":0,"body":"First off, delete that person from your friend's list so they can't keep sending you hostile messages. It's no good to have someone like that added as a friend where they can freely message you. Make sure you block them.\n\nTake any screenshots of the conversations you might have and shoot them over to us in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). We may be able to help out if serious enough.","replies":[]},{"poster":"Evocati","date":"2017-10-23T02:32:29.921+0000","up_votes":1,"down_votes":0,"body":"prob not cops but just riot to help remove this player from the game","replies":[]}]}