{"poster":"Creapery","date":"2015-08-15T12:52:03.000+0000","title":"LeBlanc Olaf Juke","subforum":"Champions & Gameplay","embed":{"description":"LeBlanc Jukes Olaf Hard Song https://www.youtube.com/watch?v=UHTFCZgm6HU","url":"https://www.youtube.com/watch?v=aSJVpFK2QhI","image":"https://i.ytimg.com/vi/aSJVpFK2QhI/hqdefault.jpg"},"up_votes":2,"down_votes":6,"body":"Hey Leute ich hab ein Video auf meinen Kanal hochgeladen und wollte fragen wie ihr den Juke findet und so.\n{{champion:7}} Jukes{{champion:2}}","replies":[{"poster":"jungle sûcks","date":"2015-08-15T14:32:26.620+0000","up_votes":2,"down_votes":2,"body":"Wieso hakt ihr alle auf ihm rum ?\nEr hat ein Video gemacht weil es ihm gefallen hat und wollte es euch zeigen.\n\nDa müsst ihr nicht auf \"groß\" tun und sagen \"ist nichts besonderes\"","replies":[{"poster":"haha weed lol xd","date":"2015-08-15T14:52:24.140+0000","up_votes":3,"down_votes":0,"body":"Er hat nach unserer Meinung gefragt \n\n>Hey Leute ich hab ein Video auf meinen Kanal hochgeladen und wollte fragen wie ihr den findet und so.\n\nWo ist jetzt das Problem ?","replies":[{"poster":"jungle sûcks","date":"2015-08-15T15:53:16.365+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=CharIíe Shen,realm=EUW,application-id=Wj1wcocU,discussion-id=PAVe1FTV,comment-id=00020000,timestamp=2015-08-15T14:52:24.140+0000)\n\n\"Hey Leute ich hab ein Video auf meinen Kanal hochgeladen und wollte fragen wie ihr den findet und so.\"\nUnd du antwortest darauf:\n\"Tut mir leid, aber was ist jetzt das besondere daran ?\"\n\nDas hat rein gar nichts mit Bewertung zu tun!","replies":[{"poster":"Stahlvormund","date":"2015-08-15T16:05:31.165+0000","up_votes":2,"down_votes":0,"body":"Wenn ich schreibe: \n1 von 5 Sternen, ist das eine bessere Bewertung als zu sagen: \"Ich kann nichts Besonderes/Außergewöhnliches daran finden.\"?","replies":[]}]},{"poster":"Creapery","date":"2015-08-15T19:58:58.008+0000","up_votes":1,"down_votes":0,"body":"Also besser gesagt wollte ich fragen wie ihr also du den Juke gefunden hast.","replies":[{"poster":"haha weed lol xd","date":"2015-08-16T14:13:33.546+0000","up_votes":1,"down_votes":0,"body":"Ja war ganz ok. Aber sowas sieht man öfters, trotzdem ganz nettes Mindfuck für Olaf x)","replies":[]}]}]},{"poster":"Misaki Alien","date":"2015-08-16T14:52:47.724+0000","up_votes":1,"down_votes":0,"body":"Es gibt einfach tausende von diesen Videos. Es ist halt einfach nichts besonderes im Gegensatz(und teilweise genauso wie) zu den anderen Videos.\nHöchstens die Bildqualität, aber da gibts auch einige die genauso gut sind.\nDie Musik ist nich so Mainstream, ganz ok, passend, aber das Video an sich zeigt mir nur wie ein Olaf verzweifelt eine LB killen will, die LB spielt halt wie ne LB spielen sollte. \nDaher find ich das Video nicht besonders, da es mit Plays sowieso immer so ist: Iwer hat es schonmal gebracht...evtl sogar besser.\n\nAußerdem: Meiner Meinung wäre die LB gestorben, wären nicht ihre Teammates dazugekommen. Weiß ja nicht ob das SoloQ war oder nen Full-Premade-Team.","replies":[]},{"poster":"Killerkante","date":"2015-08-16T14:42:42.424+0000","up_votes":1,"down_votes":0,"body":"Was geht denn mit dir? Er fragt nach unserer Meinung und er bekommt sie, Leute die so denken wie du brauchen sich hier mit sowas garnicht blicken zu lassen.","replies":[]},{"poster":"Creapery","date":"2015-08-15T19:58:17.664+0000","up_votes":1,"down_votes":0,"body":"Danke das du es verstehst :D","replies":[]}]},{"poster":"haha weed lol xd","date":"2015-08-15T13:19:53.399+0000","up_votes":2,"down_votes":2,"body":"Tut mir leid, aber was ist jetzt das besondere daran ?","replies":[{"poster":"Creapery","date":"2015-08-15T13:22:46.677+0000","up_votes":1,"down_votes":0,"body":"Der juke :D","replies":[{"poster":"Stahlvormund","date":"2015-08-15T13:28:19.772+0000","up_votes":3,"down_votes":0,"body":"Naja, der Olaf war aber auch nicht der Hellste...","replies":[{"poster":"Creapery","date":"2015-08-15T19:59:44.337+0000","up_votes":1,"down_votes":0,"body":"Ja xD","replies":[]}]},{"poster":"haha weed lol xd","date":"2015-08-15T13:33:55.365+0000","up_votes":1,"down_votes":1,"body":"Ich hab das Video gesehen. Und das war nichts besonders um ehrlich zu sein. Keine Ahnung warum man dazu ein ganzes Video machen muss.","replies":[{"poster":"Creapery","date":"2015-08-15T20:00:42.244+0000","up_votes":1,"down_votes":0,"body":"Bei mir wird jeder LoL Match automatisch aufgenommen und ich dachte, ich könnte es einfach mal so aus spass hochladen xD","replies":[]}]}]}]},{"poster":"3PercentHookRate","date":"2015-08-15T13:31:49.081+0000","up_votes":3,"down_votes":2,"body":"Das Intro und Outtro war ja mal richtig schlecht","replies":[{"poster":"Creapery","date":"2015-08-15T19:57:37.132+0000","up_votes":2,"down_votes":1,"body":"Ok ist deine Meinung.","replies":[]}]},{"poster":"Misaki Alien","date":"2015-08-16T15:00:19.178+0000","up_votes":1,"down_votes":0,"body":"Die Musik ist mal was anderes zu den anderen tausend Juke-Videos, die ich bisher gesehen habe.\nIntro und Outtro passen überhaupt nicht zu dem Video, zu der Musik und irgendwo allgemein zusammen, das ganze ist irgendwie verstörend wenn man in so kurzer Zeit so unterschiedliche Musik hört.\n\nDer Play: Wären deine Mates nicht gekommen hättest du sicherlich nich ewig überlebt und hättest ihn denke ich auch nicht unbedingt gekillt. Wenn doch, dann wäre das ein Video gewesen, was interessanter geworden wäre als das hier.\nAn für sich war die LB genauso wie eine LB sein muss. Vllt nicht Bronze LB, aber definitiv nichts extrem Besonderes.\n\nDas Video an sich: Gute Bildqualität, aber es ist kurz und sagt nicht viel aus. Eine LB die ihre Skills nutzt und dann mit ihrem Team zusammen den Gegner killt, während der Olaf ein wenig vertrottelt rüberkommt. Oder wie jemand der noch nich so lang spielt.","replies":[]},{"poster":"Killerkante","date":"2015-08-16T14:47:19.298+0000","up_votes":1,"down_votes":0,"body":"Ist nichts persönliches, aber solche \"jukes\" seh ich in jedem game wo leblanc zu sehen ist \n\nUnd zum Knirps über/unter mir (was auch immer) nochmal, solche \"plays\" werden ab einer bestimmten Elo einfach üblich, während das in Silber V wirklich hardcore outplaying ist (sieh es als kompliment, für high elo spieler sind meine mechanics z.B auch ein witz), wärst du in höherem Goldbereich oder so schon eher richtig mies wenn du sowas nicht gebracht hättest, oder bei dem versuch stirbst nen Champ zu kiten, der keine gapcloser oder sonstiges hat um dich überhaupt zu bekommen.\nIst nicht böse gemeint","replies":[]}]}