{"poster":"99White Terror99","date":"2016-08-08T09:35:05.353+0000","title":"Parlando seriamente del topino infernale","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Parlando seriamente cio&egrave; di teemo, ho trovato nei chest la skin omega squad quindi vorrei giocarlo, perch&egrave; &egrave; l&#039;unica che lo rende giocabile, per&ograve; lasciando stare i soliti commenti o osservazioni che teemo &egrave; un cancro, &egrave; il diavolo sceso nella landa, i flame e tutto il resto, quindi seriamente, teemo come posso giocarlo perch&egrave; sia utile in team? ho letto da qualche parte che coi funghi in base a dove e come li metti puoi fare certe cose oltre a sapere dove sono i nemici, tipo puoi rendere sicura la lane, gli obiettivi, insomma ditemi","replies":[{"poster":"zYaichi","date":"2016-08-08T11:42:50.962+0000","up_votes":2,"down_votes":1,"body":"E' il bully laner per giunta ranged  più forte del gioco, con uno stile di gioco così  {{champion:58}} {{champion:80}} {{champion:122}}  possono accompagnare solo.\n\nAdesso tornando seri si , il suo ruolo in lane è bullare l'avversario e il teamfight fare dps su qualsiasi cosa grazie alla sua combo R+{{item:3151}} butti giù anche i tank con tanta vita e poi c'è il midgame , eh si stai sempre toplane rendi la toplane il tuo paradiso e l'inferno per gli avversari riempiendo di funghi il territorio marchiandolo manco fossi un cane ~~finche non arriva il tizio di turno con il red trinket~~\n\n_\"Never underestimate the power of the Scout's code\"_  {{champion:17}} ","replies":[]},{"poster":"Ermengardo1","date":"2016-08-08T14:22:01.120+0000","up_votes":1,"down_votes":0,"body":"Piu che un topino infernale mi sembra un criceto","replies":[]},{"poster":"SenseiMabuni","date":"2016-08-08T13:20:14.298+0000","up_votes":1,"down_votes":0,"body":"La cosa più importante per me, a mio modesto parere, è che teemo è un counterpick.","replies":[]},{"poster":"StitchedClone","date":"2016-08-08T12:58:13.594+0000","up_votes":1,"down_votes":0,"body":"farmi, vinci la lane e pushi la gente verrà a gankarti a quel punto non ti resta che stare in un bush e iniziare a sparare e ammazzare gli avversari, quando avrai fatto ciò continui a pushare, vai back \"intanto che loro perdono tempo con te\", i tuoi alleati pushano, quindi mettete pressione sulle lane","replies":[]},{"poster":"Liorenato","date":"2016-08-08T11:57:34.851+0000","up_votes":1,"down_votes":0,"body":"In lategame ti metti dietro un muro e lanci i funghi sui nemici.\nSe i nemici sono tutti compatti esplodono tutti senza che nessuno ingaggi.\nSe usano gli sweeper e ti tolgono i funghi, tu li lanci sui minion quando passano vicino ai nemici e bon.","replies":[]},{"poster":"Kazushi San","date":"2016-08-08T10:51:45.795+0000","up_votes":1,"down_votes":0,"body":"Usatelo con dead man frozen mallet wit's trinity scarpe swift e hurricane e divertitevi","replies":[]},{"poster":"oroora6","date":"2016-08-08T10:47:47.669+0000","up_votes":1,"down_votes":0,"body":"teemo si può usare benissimo senza problemi, è chiamato cancro ma dopo tutto è solo un meme, come personaggio è forte nella laning phase e disturbande nel late game, ti consiglio di buildartelo semi-velocità di movimento, ossia ti oprendi stivali della velocità e armatura dell uomo morto che può sembrare siano inutili su teemo, ma uno che gira alla velocità della luce, che fa danni e (grazie all uomo morto) ha anche resistenza, fa molto in combattimento, tu in pratica ti nascondi nel nulla assieme al team, aspetti che subentrino tutti ed inizino a combattere e poi compari dal nulla per riempire tutti di veleno e fuggire alla velocità della luce, comunque come primo oggetto direi che devi andarci di dente di nashor, poi di stivali della velocità, tormento di liandry per i funghi, e situazionalmente ora dovresti trovarti in late game, quindi o ci vai di violenza con la rabadon, o vai di tattica con l armatura dell uomo morto (la velocità che ti da la puoi anche usare per piazzare funghi in giro per la mappa!) infine concludi con un bastone del vuoto dato che con l ultimo oggetto i nemici avranno sicuramente della resistenza, e se vuoi cambia gli stivali della velocità con l uragano di Runaan, che è davvero distruttivo nelle teamfight\n{{summoner:14}} {{summoner:14}} {{summoner:14}} \n{{summoner:14}} {{champion:17}} {{summoner:14}} \n{{summoner:14}} {{summoner:14}} {{summoner:14}} \nHAIL TEEMO","replies":[]},{"poster":"Łinkimaru","date":"2016-08-08T10:04:40.869+0000","up_votes":1,"down_votes":0,"body":"Va Be teemo è buono  solo a splitpushare, piazzi funghi ovunque così se vengono a prenderti riesci a scappare e pushi come un animale. Gg easy.\nIn teamfight non è il massimo, a parte il blind non ha molta utilità e viene shottato istant.","replies":[]},{"poster":"Floppyz","date":"2016-08-08T09:41:59.756+0000","up_votes":1,"down_votes":0,"body":"Allora, tanto per cominciare sono inc...invidioso perché lo volevo trovare iooooooooo!\n\n_In secundis_, dovresti portare più rispetto per nostro signore Teemo: lui è uno scout Yordle, non un _topino infernale_!\n\nPer il resto, premetto che ho praticamente smesso di giocarlo, quindi potrei dire sciocchezze, e nel caso correggetemi, ma credo sia tornata di moda la build (praticamente) full AP, quindi credo che la sua utilità stia principalmente nel posizionare bene le trap, (non solo nei punti caldi della mappa, ma anche prima dei teamfight) e nel molestare l'ADC nemico col blind, che full AP fa pure maluccio. Ah, quando riesci magari fatti pure inseguire sulle trap, che male (a te, perlomeno) non fa.","replies":[{"poster":"99White Terror99","date":"2016-08-08T10:00:54.386+0000","up_votes":1,"down_votes":0,"body":"ho provato a cambiare il titolo ma non si può T-T\ncomunque avevo intenzione si di giocarlo full ap, così davvero tutti hanno paura ad andare in giro che se pestano un fungo mezza vita gli parte, e ho capito più o meno che intendi sul posizionare le trappine","replies":[{"poster":"Floppyz","date":"2016-08-08T10:04:31.879+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=99White Terror99,realm=EUW,application-id=cAOZwaUi,discussion-id=RIswxvUc,comment-id=00000000,timestamp=2016-08-08T10:00:54.386+0000)\n>\n> ho provato a cambiare il titolo ma non si può T-T\n> comunque avevo intenzione si di giocarlo full ap, così davvero tutti hanno paura ad andare in giro che se pestano un fungo mezza vita gli parte, e ho capito più o meno che intendi sul posizionare le trappine\n\nAh, dimenticavo. IMPORTANTE: potresti trovare in giro, specialmente nei cespugli, dei prelibati pasticcini. NON TOCCARLI PER NESSUN MOTIVO!\n\n\n\n\n{{champion:51}} {{item:3070}}","replies":[]}]}]}]}