{"poster":"99White Terror99","date":"2015-07-03T16:55:01.477+0000","title":"La trinity","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Qualcuno mi spiega l&#039;utilit&agrave; di buildare la trinity su rengar? vorrei specializzarmi nel oneshottare gente e guardando video su youtube ho visto gente che ce l&#039;ha nella build, quindi riassumendo ho due domande: trinity e rengar, che vantaggi ci sono a buildargliela e quando farlo? se avete build (anche con rune e maestrie) per giocare rengar oneshot\r\n\r\nQualsiasi aiuto, consiglio o altra cosa &egrave; ben accetta, grazie a chiunque risponda :)","replies":[{"poster":"TerrorVodka","date":"2015-07-03T20:23:04.498+0000","up_votes":2,"down_votes":0,"body":"la trinity su rengar va bene come ultimo item se si è abbastanza sicuri di non avere bisogno di item difensivi.\nper le masteries classiche 21 9 e per le rune di solito vado di 19 armorpen 5 cdr 5 cdr per lvl  e 9 armor.\nin giunla fai un po fatica early poi vai tranquillo, invece top vinci i trade a lv 3 contro quasi ogni toplaner, basta saper sfruttare la fury.\nbuild {{item:3074}} {{item:3142}} {{item:3031}} {{item:3035}} {{item:3078}} e scarpette a scelta\n\nps rengar main :P","replies":[{"poster":"99White Terror99","date":"2015-07-04T08:46:25.905+0000","up_votes":1,"down_votes":0,"body":"infatti io la buildavo alla fine di tutto per sostituire gli stivaletti ma dopo aver completato la build\nsolitamente lo buildo {{item:3706}} {{item:3117}} -->{{item:3707}} -->{{item:3077}} -->{{item:3142}} -->{{item:3071}} -->{{item:3074}} -->{{item:3143}} o {{item:3102}}\nalla fine mi trovo {{item:3074}} {{item:3707}}{{item:3117}}{{item:3071}}{{item:3142}}{{item:3143}} o {{item:3102}} \nora, apparte la trinity che proverò a fare esperimenti in game su se e quando buildarla, la build sopra la usi top o vendi l'oggetto da giungla? e mi spieghi un attimo le rune perchè non le ho capite bene (si, forse sono nabbo, ma sto imparando piano) ","replies":[{"poster":"TerrorVodka","date":"2015-07-04T19:19:03.998+0000","up_votes":1,"down_votes":0,"body":"si quella è la build da top, in jungla io non finisco subito l'item da jungla ma prendo la tiamat per l'aoe, poi yomumu e quindi finisco l'item da jungla per poi finire l'hidra.\nle rune con 19 di armor penetration vanno molto bene se ti senti molto sicuro di non fare schifo in early e punti molto sul mid/late game, stessa cosa per il cooldown reduction.","replies":[{"poster":"99White Terror99","date":"2015-07-05T07:53:40.059+0000","up_votes":1,"down_votes":0,"body":"le rune le ho già: marchi 9 arm pen, sigilli 9 arm, glifi 9 cooldown red, quintessenze 3 atk dam\n19 arm pen come lo faccio?","replies":[{"poster":"TerrorVodka","date":"2015-07-05T09:25:46.891+0000","up_votes":1,"down_votes":0,"body":"3 quint da armorpen e i 9 mark stessa roba","replies":[{"poster":"99White Terror99","date":"2015-07-05T10:07:39.531+0000","up_votes":1,"down_votes":0,"body":"ok, capito, comunque ho appena finito un game con rengar, buildando prima tiamat e poi finendo l'oggetto da giungla e si va meglio","replies":[]}]}]}]}]},{"poster":"Ste the ripper","date":"2015-07-03T21:36:43.241+0000","up_votes":1,"down_votes":0,"body":"la trinity è un oggetto da mid game, infatti worka bene su tutti champ che hanno il powerspike in mid game, farla come ultimo item non ha alcun senso dato che le statistiche che ha a fine partita sono buone ma non eccelse","replies":[{"poster":"TerrorVodka","date":"2015-07-04T19:25:16.458+0000","up_votes":1,"down_votes":0,"body":"ho imparato rengar spectando le partite di Pridestalker (primo rengar al mondo su lolskill )\n quindi non mi sto inventando niente ;)","replies":[{"poster":"Ste the ripper","date":"2015-07-04T20:05:13.839+0000","up_votes":1,"down_votes":0,"body":"Le patch cambiano, il meta cambia, devi valutare in che condizioni è stato fatto...\n\n[http://www.probuilds.net/champions/Rengar](http://www.probuilds.net/champions/Rengar)\n\nComunque fai cosa ti pare","replies":[]}]}]}]},{"poster":"Ste the ripper","date":"2015-07-03T21:38:48.460+0000","up_votes":1,"down_votes":0,"body":"La trinity conviene poco su rengar, se proprio non sai cosa fare dopo hydra, yomuu, lw puoi andare per pd e infinity","replies":[]},{"poster":"Lord Valotz","date":"2015-07-03T16:59:49.280+0000","up_votes":1,"down_votes":0,"body":"il 200% di danno fisico sull'autoattacco dovuto allo {{item:3057}} dopo aver usato un'abilità. Quindi usato in combo con la tua Q potenziata dalla furia, fa diciamo malino.","replies":[{"poster":"Yes0d30","date":"2015-07-03T17:08:53.083+0000","up_votes":1,"down_votes":0,"body":"danno fisico BASE, bisogna specificare. Un rengar che colpsice con la q, fa più danno per la q che per la trinity","replies":[]}]}]}