{"poster":"99White Terror99","date":"2015-03-29T15:43:57.518+0000","title":"Rengar: stili di gioco","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao, non appena ho scaricato LoL avevo deciso di comprare e imparare a usare questo gran bel micione bianco{{champion:107}} ed &egrave; stato il primo champ che ho comprato; l&#039;ho giocato sia jungler che top e mi sono trovato meglio in quest&#039;ultio ruolo per&ograve; non riesco ad ottenere i risultati che vorrei, non riesco a farlo fruttare come dovrebbe.\r\n\r\nChiedo quindi a quelli che riescono a distruggere gli avversari e a fargli implorare piet&agrave; col leone bianco di spiegarmi le tattiche di gioco e lo stile con cui giocare Rengar e arrivare a fine partita soddisfatti. Qualsiasi consiglio sar&agrave; accettato, grazie mille","replies":[{"poster":"Ste the ripper","date":"2015-03-29T17:24:58.526+0000","up_votes":2,"down_votes":0,"body":"Perché rengar è decisamente molto meglio come jungler che come top laner...\nIn top se non fai il flic floc ( mi sembra si chiami così) ti aprono e anche se lo fai devi conoscere benissimo i matchup e quando puoi vincere il trade.\n\nAnche a me piace molto rengar, ma l'ho lasciato perdere, è uno dei jungler con lo skill cap più alto, è inutile prendere lui quando ci sono svariati altri champ molto più facili e altrettanto efficaci","replies":[{"poster":"Yamero Senpai","date":"2015-04-08T08:10:12.590+0000","up_votes":1,"down_votes":0,"body":"Rengar è meglio come jungler? assolutamente no, rengar è squishy e non ha molta clear speed.Va decisamente giocato top.","replies":[{"poster":"Ste the ripper","date":"2015-04-08T08:23:20.224+0000","up_votes":1,"down_votes":0,"body":"Perché invece kha zix è un tank...","replies":[]}]},{"poster":"99White Terror99","date":"2015-03-29T17:41:32.875+0000","up_votes":1,"down_votes":0,"body":"Ho preferito il ruolo top perchè trovavo difficile la prima route nella giungla, riuscendo a fare 2/3 campi e poi dovevo tornare in base perchè avevo poca vita.\nForse adesso che ho un pò più esperienza sarà più facile, proverò in sti giorni","replies":[{"poster":"Ste the ripper","date":"2015-03-29T20:38:27.695+0000","up_votes":1,"down_votes":0,"body":"Prova a rivedere rune e maestrie, comunque con il 60% dei jungler non riesci a fare più di 3 campi, quindi è normale.\nInoltre tutti conviene a tutti recallare dopo il 3° ( al massimo puoi fare un gank e recallare), perché evolvere lo smite ti dà più gold\n\nah ma ho visto ora che sei al 20... è ovvio che non riesci a fare più di 2 campi, io quando lo usavo sullo smurf recallavo dopo il blu","replies":[{"poster":"99White Terror99","date":"2015-03-30T13:48:24.295+0000","up_votes":1,"down_votes":0,"body":"l'ho usato oggi jungle e ho provato a immobilizzare con la e, ma mi sarà riuscito 1 volta su 4/5 grazie ai minion che rompevano le balle\ncomunque sono riuscito a pulire 3 campi senza dover recallare alla prima route, quindi non è male.\nMi mancava completamente la combo con la E, proprio non la conoscevo, conoscevo la teori per fare la tripla Q, ma è stradifficile, quella con l E è un pò più semplice e più utile nei gank\ngrazie a tutti per i consigli in ogni caso","replies":[]}]}]}]},{"poster":"RMRs","date":"2015-03-30T00:02:50.631+0000","up_votes":2,"down_votes":1,"body":"Io non lo uso spesso, ma ogni tanto lo uso.. La build dipende da varie situazioni, ma ci sono un paio di oggetti d'obbligo con lui! \nComunque prova a vedere pridestalkerr, notice me Dakar, bestkittycat! Giocano in eu, è il loro main, io ho imparato da loro, c'è ne sono altri due bravi, ma\nNon mi vengono in mente","replies":[]},{"poster":"Lord Exis","date":"2015-03-29T18:42:39.646+0000","up_votes":2,"down_votes":1,"body":"Io lo buildo da assassino,come è giusto che sia,AD fino alla morte,in genere faccio hydra,black cleaver,last whisper,bt,ovviamente stivali,cooldown o magic resist a seconda della situazione e in caso di molti AP/AP feedati faccio Malmortius,se non si presentano nessuno dei due casi di prima faccio la youmuu.\nIo ti so dire qualcosa come jungler,perche come top laner so poco e niente. \nGanka dal livello 6 in poi,se ti senti coraggioso puoi gankare anche dal 3,ma è abbastanza rischioso,ganka sempre con 5 stack di passiva,usi la E,avversario immobilizzato e giù con le mazzate.\nSpero di esserti stato di aiuto. :)","replies":[{"poster":"Ste the ripper","date":"2015-03-29T20:43:38.874+0000","up_votes":2,"down_votes":1,"body":"Se devi aspettare il 6 per gankare tanto vale prendere ww...\nComunque è meglio fare gemma cacciatore, youmuu, poi tank, oppure se sei feedato fai ancora hydra e poi tank, all'occerenza puoi anche fare la molmortius\n\nPer gankare vai con 4 stack, così prima slowi di e, poi è più facile beccare lo stun. Fai questo perché lo stun è la cosa più importante non puoi missarlo, io in genere uso anche lo smite per rendere ancora più lento l'avversario","replies":[{"poster":"Lord Exis","date":"2015-03-30T12:36:32.126+0000","up_votes":1,"down_votes":1,"body":"Che posso dire,è il mio stile di gioco ahahah,tu sicuramente ne avrai uno diverso dal mio,ma questo è il mio..e finchè mi trovo bene con quello stile lo userò sempre. :)","replies":[{"poster":"Ste the ripper","date":"2015-03-30T13:46:46.248+0000","up_votes":1,"down_votes":1,"body":"è come bere con il cucchiaino, certo che puoi farlo, ma ci metti di più...\nNon è una questione di stile di gioco, è come si usa un champ\n\nCome se tu mi dicessi che ti trovi bene con ahri ad, nessuno ti impedisce di buildarla ad, ma non stai usando correttamente il champ","replies":[{"poster":"Lord Exis","date":"2015-03-30T19:18:11.632+0000","up_votes":1,"down_votes":1,"body":"Quello si,ovvio,ma l'esempio di ahri ad è una boiata unica (non voglio creare litigate o robe simili),io ho i miei stili di gioco con i miei campioni,esempio:con gli assassini/combattenti sono aggressivo (non troppo,il giusto)...\nPer Zed buildo quasi sempre l'hydra,non lo fa quasi nessuno,ma finchè andrà bene a me e finchè giocherò bene con Zed con la mia build la continuerò a usare :) \nNon voglio creare flame inutili,giusto farti capire come penso. :)","replies":[{"poster":"Ste the ripper","date":"2015-03-30T21:39:04.649+0000","up_votes":1,"down_votes":1,"body":"Ho visto gente giocare ahri ad, si trovavano bene, ora se il criterio è quello perché dici che è una boiata?\n","replies":[]}]}]}]}]}]},{"poster":"Yamero Senpai","date":"2015-04-07T21:19:36.375+0000","up_votes":1,"down_votes":0,"body":"\n\ngioco Rengar dalla s3, posso dirti che parlare su questo champ non serve a niente, vuoi insegnarti le mechanichs? scaricati curse voice o robe simili e addami su lol e ti insegnerò tutto quello che so","replies":[]},{"poster":"lVertigol","date":"2015-04-02T18:43:22.397+0000","up_votes":1,"down_votes":0,"body":"Ti consiglio di guardare sulla piattaforma di streaming cinese (della quale non ricordo il nome) Rengoland. Maina Rengar top. In streaming parla inglese e si riesce a capire. Di solito builda Idra, youmu, black cleaver, mercury s, last whisper e botrk","replies":[]},{"poster":"Xalilag X","date":"2015-03-29T17:10:46.746+0000","up_votes":1,"down_votes":1,"body":"idra, easy win gg wp","replies":[]}]}