{"poster":"NSP","date":"2016-01-18T00:27:05.002+0000","title":"Ayuda/Consejos de algún Main Zac o buen jungle","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Como andan amigos? Hace poco me compre a  {{champion:154}} , hace rato me llenaba la atenci&oacute;n y decid&iacute; comprarlo. \r\nMe vendr&iacute;a muy bien algunos consejos o alg&uacute;n tipo de gu&iacute;a de alguien que lo mainee.\r\nMuchas gracias y suerte en la grieta","replies":[{"poster":"ManuelAlcayaga","date":"2016-01-18T01:18:34.856+0000","up_votes":1,"down_votes":0,"body":"zac es un personaje jungla tanke. no es un personaje de \"carry\" (como riven o kata)\nla forma en que carrea, es generando snowball en una linea en particular (generalmente bot)\n\nes decir, encuentra una linea que tenga buena capacidad de snowball (top jax por ejemplo)\ny lo gankeas hasta romper la torre de top. luego ese jax feed te va a carrear.\n\nsi tu equipo va ganando, tu deber es iniciar tf.\nsi tu equipo va perdiendo, tu debes es hacer peeling al mejor de tu team.\n\nrunas / maestrias / items -> http://champion.gg/champion/zac","replies":[{"poster":"NSP","date":"2016-01-19T01:31:10.162+0000","up_votes":1,"down_votes":0,"body":"Gracias, esa pagina es Dios {{item:3070}}","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-01-18T01:42:32.498+0000","up_votes":1,"down_votes":0,"body":"Zac, es probable uno de los mejores jg actuales para stompear linea, tiene una gran capacidad de gankear linea tras linea de manera consecutiva y rápido, algo que poco hacen como por ej. lee y shaco o rammus, esto se debe a que gank tras gank tiene a capacidad de recuperarse rapido en vida haciendo camp, y abarcar mucho territorio con su movilidad.\n\nsi inicia en el lado azul tiene las de ganar, empieza abajo hace esa zona que abarca el red y no pierde vida por q hace el red con smite y gankea ya sea bot o mid a lvl 3, como no nesecita el blue se lo puede dejar muy tempranamente al mid aliado para que ya saque una ventaja en su linea, esto en parte lo libera de gankearlo momentáneamente si no lo necesita realmente.\n\nel metodo de gankeo simple, campamento>gank, camp. para recuprar vida>gank y asi consecutivamente, tiene un genial gank por linea si se infiltra sin q no lo vean en el primer arbusto del carril de bot o de top.\n\nsus stats bases son muy buenos así que no dudes en comprar en el primer backeo unas {{item:3117}}  para ejercer mayor presión en las lineas.","replies":[{"poster":"NSP","date":"2016-01-19T01:30:17.733+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias, voy a darle caña","replies":[]}]},{"poster":"Ánzu","date":"2016-01-18T01:40:00.939+0000","up_votes":1,"down_votes":0,"body":"el otro día me toco un zac con marco de maestro nos dijo que es challenger con zac y lo unico que hizo con sus premade fue esconderse en los arbusto de bot esperando que peleasen para el momento que comenzó el primer trade en bot ya les sacaban 2 lvl por culpa del zac mega camper XD","replies":[{"poster":"Ks Erwyn","date":"2016-01-18T02:34:54.936+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Azurx,realm=LAS,application-id=8sKIclmi,discussion-id=sd4s67s1,comment-id=0001,timestamp=2016-01-18T01:40:00.939+0000)\n>\n> el otro día me toco un zac con marco de maestro nos dijo que es challenger con zac y lo unico que hizo con sus premade fue esconderse en los arbusto de bot esperando que peleasen para el momento que comenzó el primer trade en bot ya les sacaban 2 lvl por culpa del zac mega camper XD\n\neso pasa seguido con el, gankeas desde el arbusto del carril de bot, matas al duo rival con tu linea de bot, y que haces, recaleas?, NO!, te quedas en el mismo arbusto y cuando vuelvan otra vez lo mismo.","replies":[{"poster":"Ánzu","date":"2016-01-18T17:36:49.414+0000","up_votes":1,"down_votes":0,"body":"si pero en el momento del trade no solo murieron sus premades si no el también xD","replies":[]}]}]}]}