{"poster":"BLACK T UNG","date":"2016-04-10T17:20:28.697+0000","title":"Beleidigungen hoch 10 ... war kein schönes Spiel","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":6,"body":"Ich habe mal die Screenshots vom Champselect gemacht - was soll ich sagen?\n\n*Hier Stand mal ein Link mit einem Bild auf dem ich eindeutig belegt habe, dass jemand \"Meine Mutter f*** will\" ... das interessiert aber niemanden bei Riot sondern ich soll die InGame Report Funktion nutzen und warten*\n\nSehr nette Menschen und das ging das ganze Spiel so ... :-(\n\n\n*edit*\nRiot ... wenn das Euer Ernst ist ... Danke für nichts!","replies":[{"poster":"TerrorRaven","date":"2016-04-10T17:28:40.563+0000","up_votes":4,"down_votes":0,"body":"Wenn du niemanden anprangern willst, dann mach die Namen auf den Screenshots unkenntlich.\n\nEdit:\nSpieler kannst du nach dem Spiel in der Lobby reporten (auf den ! neben den Namen klicken, das entsprechende Vergehen auswählen und ggf. noch kurz dazu schreiben, was passiert ist). . Und die Stelle, die du zitiert hast, bezieht sich auf die Chatlogs, die man erhält, wenn man wegen Flamen gebannt wurde.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:30:09.198+0000","up_votes":1,"down_votes":5,"body":"\"Wo\" muss ich denn dann mit solchen Screenshots hin, damit die entsprechenden Personen bestraft werden?\nDachte das wäre hier das offizielle LOL-Board zum Thema \"Spielerverhalten\"?\n\nOder ist es Riot egal wenn so welche in deren Spiel rumlaufen?","replies":[{"poster":"TerrorRaven","date":"2016-04-10T17:35:53.819+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BLACK T UNG,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=00010000,timestamp=2016-04-10T17:30:09.198+0000)\n>\n> \"Wo\" muss ich denn dann mit solchen Screenshots hin, damit die entsprechenden Personen bestraft werden?\n> Dachte das wäre hier das offizielle LOL-Board zum Thema \"Spielerverhalten\"?\n> \n> Oder ist es Riot egal wenn so welche in deren Spiel rumlaufen?\n\nWenn du willst, dass die Bestraft werden, dann musst du das Ingame-Report-System nutzen. Der Bereich \"Spielerverhalten\" handelt im erster Linie über die Diskussion über den Umgang mit Flamer und Trollen. Oder Diskussionen darüber, wenn man eine Strafe erhalten hat und ob diese Gerechtfertigt ist (was gefühlt 90% der Threads hier ausmachen).","replies":[{"poster":"AI RealSuperSand","date":"2016-04-10T17:38:51.090+0000","up_votes":4,"down_votes":10,"body":"ich seh aber keinen report button in der champ select.\nich seh auch keinen report button im lobby chat.\ndas' ja komisch.\n\nleute dürfen mich zusammenscheißen, solange sie kein spiel mit mir spielen. ergibt sinn.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:40:59.239+0000","up_votes":2,"down_votes":7,"body":"Danke ... endlich mal jemand der mich versteht ... das System hinkt. Undzwar gewaltig.","replies":[{"poster":"Patty91","date":"2016-04-10T17:44:06.200+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=BLACK T UNG,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=00010000000100000000,timestamp=2016-04-10T17:40:59.239+0000)\n>\n>  das System hinkt. Undzwar gewaltig.\n\nUnd das kannst du behaupten, weil? Offenbar hast du dich kein Stück mit dem System beschäftigt, wie du mit folgendem bewiesen hast:\n> [{quoted}](name=BLACK T UNG,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=0000000000000000,timestamp=2016-04-10T17:39:31.933+0000)\n>\n> Ich weiss was passiert ... 3 Premades reporten mich ... dann ist mein Report gegen die 1 Cent wert ;-)","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:48:00.100+0000","up_votes":2,"down_votes":8,"body":"Sei es wie es will ... dann ist das halt so wie mir gerade beschrieben wurde. Danke für die Aufklärung.\n\nTrotzdem wird hier nur um den heißen Brei geredet und obwohl ich beweisen kann, wie jemand meine Mutter und im späteren Verlauf meine Familie aufs übelste beleidigt interessiert es niemanden ...\n\nDa könnt ihr euch das System schönreden wie ihr wollt. Da stimmt was nicht.\nFaulheit - was anderes ist es nämlich nicht wenn man Screenshots nicht auswerten will\" - ist kein Punkt der ein Spiel nach vorne bringt.\nSorry","replies":[{"poster":"Der Großmugister","date":"2016-04-10T18:01:41.643+0000","up_votes":3,"down_votes":0,"body":"Du weißt aber, dass du hier nur mit anderen Spielern und nicht mit Mitarbeitern von Riot sprichst?","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T18:21:38.367+0000","up_votes":2,"down_votes":4,"body":"Riot hat also sein Copyright von \"leagueoflegends.com\" an eine \"private Community\" hergegeben und hat nixdamit zutun?","replies":[{"poster":"Sirrkas","date":"2016-04-10T18:25:21.515+0000","up_votes":5,"down_votes":1,"body":"Riot hat Forenrichtlinien und Moderatoren dagelassen. Hier der Ausschnitt, der sich auf dein Thema bezieht:\n\n>Andere Spieler melden\nBitte meldet einen möglichen Fall von Fehlverhalten eines Spielers nicht in diesen Foren. Wenn ihr mitbekommt oder hört, dass eine andere Person gegen die Regeln verstößt, nutzt die Report-Funktion oder schickt uns ein Ticket, so dass wir den Vorfall untersuchen und entsprechend vorgehen können. Wir wissen, dass Spieler andere mit besten Absichten öffentlich anzeigen, aber oftmals führt das nur zu Hexenjagden und kaum jemals zu positiven Diskussionen. Wir werden Maßnahmen gegen Spieler ergreifen, die gegen Regeln verstoßen haben, also meldet diese Spieler bitte auf korrekte Weise.\n>\n>Moderatoren halten nach Folgendem Ausschau:\n● Beiträge, die andere Spieler des miesen Verhaltens im Spiel bezichtigen\n● Beiträge, in denen anderen böswilliges Verhalten vorgeworfen wird\n● Beiträge, in denen anderen Cheaten, Betrügen oder die Inanspruchnahme unerlaubter Dienstleistungen vorgeworfen wird\n● Beiträge, in denen Anderen Rumtrollen in Foren vorgeworfen wird (dafür gibt es die Meldefunktion)","replies":[]}]}]},{"poster":"TerrorRaven","date":"2016-04-10T17:51:29.371+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=BLACK T UNG,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=0001000000010000000000000000,timestamp=2016-04-10T17:48:00.100+0000)\n>\n> Sei es wie es will ... dann ist das halt so wie mir gerade beschrieben wurde. Danke für die Aufklärung.\n> \n> Trotzdem wird hier nur um den heißen Brei geredet und obwohl ich beweisen kann, wie jemand meine Mutter und im späteren Verlauf meine Familie aufs übelste beleidigt interessiert es niemanden ...\n> \n> Da könnt ihr euch das System schönreden wie ihr wollt. Da stimmt was nicht.\n> Faulheit - was anderes ist es nämlich nicht wenn man Screenshots nicht auswerten will\" - ist kein Punkt der ein Spiel nach vorne bringt.\n> Sorry\n\nIst ja nicht so, dass man Screenshots nicht manipulieren kann.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:57:00.485+0000","up_votes":2,"down_votes":6,"body":"Ich hätte alternativ noch den Ausschnitt aus dem Livestream auf Twicht ;-) aber das Video habe ich natürlich auch eben in 2 Minuten bearbeitet.\n\nKim-Jong Un in Nordkorea verteidigt übrigens auch vehement seine Politik als die richtige ;-)\nNur mal zum drüber nachdenken.","replies":[{"poster":"legofreak1","date":"2016-04-10T18:09:52.061+0000","up_votes":6,"down_votes":2,"body":"Wird die Nazi-Keule immer unbeliebter und das Forum inzwischen lieber mit Nordkorea verglichen? Scheint mir in letzter Zeit zumindest so vorzukommen.\n\nDas Forum ist nicht der richtige Ort, um Leute anzuprangern, Hexenjagden sind nicht umsonst seit hunderten Jahren aus der Mode. Nur weil du der Ansicht bist, dass jemand schuldig ist, kannst du nicht Selbstjustiz üben, für diese Fälle gibt es Systeme von RIOT.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T18:22:34.976+0000","up_votes":2,"down_votes":6,"body":"Ich hätte jedes x-beliebige System als Vergleich nehmen können, das nicht funktioniert und als \"gottgleich\" dargestellt wird. Nordkorea fiel mir nur als erstes ein.\nDas es schon problematisch ist mit dem Champselect steht ja wohl außer Frage.","replies":[{"poster":"Megamaexx","date":"2016-04-10T19:52:45.196+0000","up_votes":2,"down_votes":0,"body":"Wenn du unbedingt willst, dass das irgendwie Beachtung bekommt, kannst du das dem Support zusenden.","replies":[{"poster":"Megamaexx","date":"2016-04-10T19:53:30.859+0000","up_votes":1,"down_votes":0,"body":"Also den Screenshot","replies":[]}]},{"poster":"eingew","date":"2016-04-11T18:58:25.301+0000","up_votes":1,"down_votes":0,"body":"Wieso gottgleich?\n\nAn welcher Stelle wird das System als gottgleich dargestellt, wenn Riot persönlich zugibt, dass es Fehler macht?","replies":[]}]}]},{"poster":"eingew","date":"2016-04-11T18:57:40.948+0000","up_votes":3,"down_votes":0,"body":"Srsly... **Jeder** (auch Jesus, Buddha, Ghandi, ...) hält seine \"Politik\" (gleichzusetzen mit Einstellung usw) für definitiv richtig.\n\n*Du selbst* verteidigst deine Meinung vehement. Bist du jetzt Kim Jong II (oder wie auch immer dieser unwichtige Gnom heißt?)\n\n___\n\nNatürlich gibt es auch Leute, die an sich selbst zweifeln.\nAber die können genauso Recht oder Unrecht mit ihrer Meinung haben, wie jemand der von sich überzeugt ist.","replies":[]}]}]},{"poster":"eingew","date":"2016-04-11T18:53:44.708+0000","up_votes":2,"down_votes":0,"body":"Wieso sollte das niemanden interessieren? De facto kann man für derartiges Fehlverhalten sogar Stufen überspringen und dadurch deutlich schneller umso härter bestraft werden.","replies":[]}]}]}]},{"poster":"Abasin","date":"2016-04-12T05:18:46.357+0000","up_votes":2,"down_votes":0,"body":"> ich seh aber keinen report button in der champ select.\nich seh auch keinen report button im lobby chat.\ndas' ja komisch.\n\n\nDa gehört er auch noch nicht hin. Ein Spiel beginnt schon in der Champselection und endet im Afterchat. Genau deswegen wird erst da reportet. Ist genau wie im Fussball. Da wird auch erst nach Spielende reklamiert, wenn etwas unstimmig war. \n\nAlso lieber erst nachdenken und dann schreiben. {{sticker:slayer-jinx-wink}}","replies":[{"poster":"AI RealSuperSand","date":"2016-04-13T10:47:49.011+0000","up_votes":1,"down_votes":4,"body":"sagt der typ, der meine beiträge nicht verstanden hat. köstlich.","replies":[{"poster":"Abasin","date":"2016-04-13T10:52:27.042+0000","up_votes":2,"down_votes":0,"body":"Extra für Dich hab ich den Bezug nochmal reineditiert. {{sticker:zombie-brand-clap}}","replies":[{"poster":"AI RealSuperSand","date":"2016-04-13T11:05:16.584+0000","up_votes":1,"down_votes":3,"body":"nö, da ist kein bezug. ich kann leute immer noch erst dann reporten, nachdem wir gespielt haben. \nvielleicht warst du vor lauter emoticon spam zu abgelenkt, aber du scheinst ein gutes beispiel gesucht zu haben.\nhier ist eins:\n\nwir verabreden uns zu einem fußballspiel. kurz vor dem spiel trete ich dir mit anlauf in die eier und geh nach hause, weil mir deine nase nicht gefällt und weil ich kein problem damit hab, vor dem nächsten spiel 5 minuten zu warten. viel spaß bei der erklärung, inwiefern gelb-rot dir weiterhilft, während du keuchend am boden liegst.","replies":[{"poster":"Haudruppmoor","date":"2016-04-13T11:15:05.178+0000","up_votes":3,"down_votes":0,"body":"Wenn ich so Beispiele lese, dann denke ich immer :\n\n\"LOL ist wie Fußball beim Schach, nur ohne Würfel !\"\n\nmfg\nMB","replies":[{"poster":"AI RealSuperSand","date":"2016-04-13T11:51:10.754+0000","up_votes":1,"down_votes":0,"body":"sorry, war nicht meins. war seins in sinnvoll.","replies":[{"poster":"Haudruppmoor","date":"2016-04-13T12:15:45.437+0000","up_votes":1,"down_votes":0,"body":"Ok, aber was ich auch meine ist, Du fährst ja jetzt net wortwörtlich zu dem Spieler nach Hause, gehst rein und kloppst ihm vor die Klöten und fährst dann wieder. Das der Spieler dann vor Schmerzen keine Maus mehr bedienen kann, kann ich mir schon vorstellen. \n\nDu meinst das Ganze ja verbal, oder ? Also Du startest ein Spiel und in der Championselection beleidigt Dich jemand übelst und dodge dann oder wie das heißt. Er verläßt das Spiel bevor es beginnt. Dann kommt das Spiel ja sowieso nicht zu Stande und man startet dann eben ein Neues. \n\n\"Kopf kratz\" - so richtig versteh ich das Problem jetzt nicht. Wenn der Flamer sich schon in der Championselection verabschiedet, dann beeinflußt das doch net das Spiel danach. Insofern machts jetzt net wirklich Sinn im Prechat zu reporten. Ich mein das Spiel wird aufgelöst und man kann dann erstmal ne Tasse Milch trinken und startet dann ein neues Spiel oder ? Schlimmer ist es doch, wenn der Spieler drin bleibt und vielleicht weiterstänkert. Dann kann man ihn allerdings am Ende reporten .\n\nOder seh ich da was falsch ?\n\nWorüber schonmal diskutiert wurde (find den Thread grad nicht) war ein \"Auflösungsbutton\" bzw. \"Abbruch Button\" damit man zu Beginn in der Championauswahl ohne Leaverstrafe aus der Selection rausgehen kann, wenn's einem zu bunt wird. Ging irgendwie auch um Instalock , Prechatflame und Lanereservierung oder so.  D.h. das man selber dann beeinflussen kann, ob das Spiel im Endeffekt stattfinden soll oder nicht. Gab aber bei näherer Betrachtung zu viele Ungereimtheiten ...\n\nmfg\nMB\n\np.s.:\nWas man aber machen kann in der Selection, wenn der andere Spieler so'n übelsten Flame abläßt, ist ein Screenshot vom Verlauf. Muß man halt schnell auf die DRUCK-Taste (oder ALT+DRUCK ) drücken und den Screen einfach an den Support schicken. Wär nen Versuch wert .","replies":[{"poster":"AI RealSuperSand","date":"2016-04-13T12:55:07.356+0000","up_votes":1,"down_votes":0,"body":"das kann man sicher machen (ob es konsequenzen hat, weiß ich nicht), aber eigentlich ist es nicht meine aufgabe, aufwand zu betreiben, weil jemand anders seine arbeit nicht gemacht hat.\n\nman könnte ja auch reports abschaffen. dann gehste zu lol replay, lädst dir das replay runter, suchst im replay die stelle mit dem fehlverhalten, lädst dein replay online hoch und schickst link und zeitstempel an den support.","replies":[]}]}]}]},{"poster":"Abasin","date":"2016-04-13T11:19:37.237+0000","up_votes":2,"down_votes":0,"body":"Oben drüber...{{sticker:slayer-jinx-unamused}} ","replies":[]}]}]}]}]},{"poster":"TerrorRaven","date":"2016-04-10T17:48:17.553+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AI RealSuperSand,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=0001000000010000,timestamp=2016-04-10T17:38:51.090+0000)\n>\n> ich seh aber keinen report button in der champ select.\n> ich seh auch keinen report button im lobby chat.\n> das' ja komisch.\n> \n> leute dürfen mich zusammenscheißen, solange sie kein spiel mit mir spielen. ergibt sinn.\n\nIst zwar blöd, aber im Moment nicht änderbar.","replies":[{"poster":"AI RealSuperSand","date":"2016-04-10T18:11:26.435+0000","up_votes":2,"down_votes":5,"body":"ne. zwischen \"nicht änderbar\" und \"sehr leicht änderbar, weils ja nach dem game auch geht, aber es juckt uns nicht\" ist ein großer unterschied.","replies":[{"poster":"Macolm Merlyn","date":"2016-04-10T21:13:07.401+0000","up_votes":2,"down_votes":0,"body":"Ich versteh immer noch nicht warum man nicht einfach bis nach dem Spiel mit dem reporten warten kann. Kannst du mich dahingehend mal aufklären?","replies":[{"poster":"AI RealSuperSand","date":"2016-04-11T01:40:04.353+0000","up_votes":1,"down_votes":2,"body":"was fürn spiel? ich kann deiner gesamten familie den tod wünschen und dann aus der champ select gehen.\ndann kann ich dich ne woche später als freund adden, dir sachen über deine mutter erzählen und dich dann löschen.\n\nund jetzt warte mal bis nach dem spiel.","replies":[{"poster":"Waldschrat86","date":"2016-04-11T05:24:26.387+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AI RealSuperSand,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=00010000000100000001000000000000,timestamp=2016-04-11T01:40:04.353+0000)\n>\n> was fürn spiel? ich kann deiner gesamten familie den tod wünschen und dann aus der champ select gehen.\n> dann kann ich dich ne woche später als freund adden, dir sachen über deine mutter erzählen und dich dann löschen.\n> \n> und jetzt warte mal bis nach dem spiel.\n\nTolles Hobby. Ich schlottere jetzt schon vor solchen Gestalten...und meine Mutter erst...brrr.","replies":[{"poster":"Macolm Merlyn","date":"2016-04-11T05:32:39.116+0000","up_votes":2,"down_votes":0,"body":"Ist mir nach 1000 Games noch nie passiert","replies":[]},{"poster":"AI RealSuperSand","date":"2016-04-11T05:35:13.022+0000","up_votes":1,"down_votes":2,"body":"sehr schön, warum dann nicht die reportfunktion ganz entfernen?\nstock und stein brechen dir das bein.","replies":[{"poster":"Waldschrat86","date":"2016-04-11T15:21:56.602+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AI RealSuperSand,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=0001000000010000000100000000000000000001,timestamp=2016-04-11T05:35:13.022+0000)\n>\n> sehr schön, warum dann nicht die reportfunktion ganz entfernen?\n> stock und stein brechen dir das bein.\n\nWas hat das damit zu tun? Wenn sie die \"Taktik\" anwenden, die du so schön dargestellt hast, muss ich doch eh nie mit denen spielen und die Spiele, wo sie dann machen, werden sie reportet und fertig. Sollte ich mal wirklich aus Langeweile irgendeinen wildfremden nach Wochen adden (wie gesagt tolles Hobby, wenn der extra meinen Nick notiert, nachschaut, sich merkt nach so langer Zeit) haste nicht gesehn wie schnell der auf der Ignoreliste landet.\nAlso entweder bestreitet der Spaßvogel eh keine Spiele und die Wartezeit vor dem joinen einer Lobby steigt und steigt oder er spielt tatsächlich irgendwann mal und dann greifen die Systeme.","replies":[{"poster":"AI RealSuperSand","date":"2016-04-11T18:00:21.242+0000","up_votes":2,"down_votes":3,"body":"man kann sich auch jeden scheiß religionsartig schönreden.\nam ende ist das fehlen der reportfunktion im chat und in der champ select ein feature und gehört gefeiert. is klar.","replies":[{"poster":"Waldschrat86","date":"2016-04-11T20:53:42.093+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AI RealSuperSand,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=000100000001000000010000000000000000000100010000,timestamp=2016-04-11T18:00:21.242+0000)\n>\n> man kann sich auch jeden scheiß religionsartig schönreden.\n> am ende ist das fehlen der reportfunktion im chat und in der champ select ein feature und gehört gefeiert. is klar.\n\nIch hätte nichts gegen die Funktion. Finde es aber nicht wichtig, warum habe ich im letzten Post erklärt. Tut mir leid, dass es mir einfach egal ist, was irgendein Typ, den ich nicht kenne und der mich nicht kennt, für tolle BEleidigungen und Hasstiraden kennt. Interessiert mich einfach nicht, im Gegensatz zu Flame, der das Spiel beeinflusst.","replies":[]}]}]},{"poster":"SeaHorseCalamity","date":"2016-04-11T11:39:43.454+0000","up_votes":2,"down_votes":0,"body":"sie wird nicht entfernt, weil sie super funktioniert^^\nwenn leute sowas ein zwei mal schreiben, müssen sie sich in der regel einen neuen account machen um ihr hobby fortzusetzen. sie können dich auch nicht als freund adden, wenn du ein bisschen darüber nachdenkst, wer das sein könnte und dann gezielt leute ablehnst, die du nicht haben willst.","replies":[]}]}]}]}]}]}]},{"poster":"eingew","date":"2016-04-11T18:52:28.676+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AI RealSuperSand,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=0001000000010000,timestamp=2016-04-10T17:38:51.090+0000)\n>\n> ich seh aber keinen report button in der champ select.\n> ich seh auch keinen report button im lobby chat.\n> das&#x27; ja komisch.\n> \n> leute dürfen mich zusammenscheißen, solange sie kein spiel mit mir spielen. ergibt sinn.\n\nEs steht dir frei in diesem Falle ein Ticket an Riot zu schicken und dich dort darüber zu beschweren.","replies":[]}]}]},{"poster":"Patty91","date":"2016-04-10T17:32:20.993+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BLACK T UNG,realm=EUW,application-id=KYnfKGf0,discussion-id=x2OrfP5G,comment-id=00010000,timestamp=2016-04-10T17:30:09.198+0000)\n>\n> \"Wo\" muss ich denn dann mit solchen Screenshots hin, damit die entsprechenden Personen bestraft werden?\n\n\nNirgends. Alles, was mit einem Spiel zusammenhängt, und da zählt die CS dazu, wird über Ingamereport abgehandelt.","replies":[]}]}]},{"poster":"Patty91","date":"2016-04-10T17:21:32.485+0000","up_votes":5,"down_votes":1,"body":"> Wir weisen insbesondere darauf hin, dass dieses Forum und auch alle anderen Bereiche, nicht zum Anprangern oder Melden einzelner Spieler gedacht sind, egal unter welchen Umständen.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:24:57.674+0000","up_votes":2,"down_votes":4,"body":"Wo genau kann ich dann Spieler reporten?\n\nDachte\n\n\"Wichtiger Hinweis: Copy&Paste-Kopien der Chatlogs zählen NICHT als vollständige Chatlogs. Bitte benutzt entweder den Link aus der Email oder Screenshots auf denen eindeutig der ganze Chat zu sehen ist.\"\n\nsteht so in eurem Thread?\n\n*edit*\nIch will niemanden anprangern ... ich will das über eine Bestrafung nachgedacht wird.","replies":[{"poster":"Zaddok","date":"2016-04-10T17:37:26.932+0000","up_votes":3,"down_votes":2,"body":">Ich will niemanden anprangern ... ich will das über eine Bestrafung nachgedacht wird.\n\nWird es wenn du sie gemeldet hast.\n\nAber bitte, nehme die Screens raus oder zensiere die Namen, da naming und shaming hier unter Strafe steht.","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:39:31.933+0000","up_votes":2,"down_votes":6,"body":"Ich weiss was passiert ... 3 Premades reporten mich ... dann ist mein Report gegen die 1 Cent wert ;-)\nNamen sind raus ... und ich auch","replies":[{"poster":"Zaddok","date":"2016-04-10T17:41:42.834+0000","up_votes":4,"down_votes":0,"body":">Ich weiss was passiert ... 3 Premades reporten mich ... dann ist mein Report gegen die 1 Cent wert ;-)\n\nNein, ist er nicht. Warum sollten Premade-Reports deinen eigenen zunichte machen? Woher weißt du ob sie dich reported haben?","replies":[{"poster":"BLACK T UNG","date":"2016-04-10T17:43:27.070+0000","up_votes":1,"down_votes":5,"body":"Weil die 3 die Gegner nach dem Spiel aufgefordert haben mich und den anderen aus unserem Team wegen \"Flaming, trolling, etc.\" zu reporten.\n\nJetzt reporten mich 3 Leute ... und ich reporte die 3 ... die nackten Zahlen lassen darauf schließen, dass ich das schwarze Schaf bin. Deswegen die Screenshots. Aber wie gesagt ... wenn \"ich f*** deine Mutter\" niemanden interessiert ...","replies":[{"poster":"Zaddok","date":"2016-04-10T17:48:32.763+0000","up_votes":4,"down_votes":1,"body":"Woher weißt du denn dass niemanden interessiert?\n\nDu hast sie reported, das System checkt sie und die Bestrafung wird bestimmt bei diesem Verhalten folgen.","replies":[]},{"poster":"eingew","date":"2016-04-11T18:50:45.859+0000","up_votes":2,"down_votes":0,"body":"Über ungerechtfertigte Reports brauchst du dir keine Sorgen zu machen. Bevor Riot eine Strafe ausspricht, wird ausführlich geprüft, ob du überhaupt schuldig bist. Solange du dich also vollkommen normal und nicht irgendwie asozial benommen hast, kannst du gar nicht bestraft werden.\n\nSollte das dennoch der Fall sein wird der Support auf Wunsch deine Strafe erneut manuell prüfen und dabei wahrscheinlich den Fehler feststellen und rückgängig machen.","replies":[]}]}]},{"poster":"SorisDynasty","date":"2016-04-10T17:44:32.312+0000","up_votes":3,"down_votes":0,"body":"Dann weißt du etwas Falsches. Denn Premade-Reports zählen als ein Report, und Reports negieren sich schon mal gar nicht gegenseitig...","replies":[]}]}]}]}]}]}