{"poster":"Fritongo","date":"2017-02-22T20:46:27.572+0000","title":"¿Cómo desinstalo el juego?","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Antes de que me fundan en negativos por hacer una pregunta relativamente tonta, d&eacute;jenme aclararles un poco.\r\nNo puedo desinstalarlo mediante el desinstalador de programas de windows ya que el juego no sale, es como si ni siquiera estuviera instalado, tampoco aparece cu&aacute;ndo intento desinstalarlo con programas como el CCleaner, Glary Utilities, etc.\r\nQuisiera que me dijeran si hay otro m&eacute;todo de desinstalar el juego de forma correcta.\r\n\r\nNo estoy dejando el juego, solo lo quiero reinstalar ya que no puedo instalar el cliente actualizado y van a eliminar el cliente de legado pronto.\r\n\r\nGracias &lt;3 {{champion:420}}","replies":[{"poster":"Auren Seven","date":"2017-02-22T21:30:12.650+0000","up_votes":2,"down_votes":0,"body":"Tranquilo no es una pregunta tonta. Mira fijate si tenes el instalador del Lol(Dudo que lo tengas si es que jugas hace mucho), si no lo tenes, lo bajas de aca: https://signup.las.leagueoflegends.com/es/signup/redownload, lo abris y te aparece la opcion de desinstalar.","replies":[]},{"poster":"Desaroll","date":"2017-02-22T20:53:49.763+0000","up_votes":2,"down_votes":0,"body":"Hayo!\n\nSi no te aparece en el desinstalador de programas, es probable que no lo tengas instalado de forma correcta, si no simplemente, funcional.\n\nBusca la carpeta del juego, y borrala. Si Windows no sabe que está instalado, no lo extrañará ;-)\n\nSuerte!","replies":[]},{"poster":"Ozarcus","date":"2017-02-22T21:44:57.729+0000","up_votes":2,"down_votes":3,"body":"Muy fácil, usas el programa **Iobit Unistaller**. Solo haz click derecho sobre el acceso directo o archivo y selecciona **\"Desinstalación profunda\".**\n\nEnlace: http://www.iobit.com/es/advanceduninstaller.php\n\nSalu2 {{summoner:4}} ","replies":[{"poster":"California Love","date":"2017-02-23T02:32:38.016+0000","up_votes":1,"down_votes":0,"body":"Lindo spam","replies":[{"poster":"Ozarcus","date":"2017-02-23T02:44:44.920+0000","up_votes":1,"down_votes":0,"body":"Solo aporto solución a un problema. Ni que me pagaran por hacer publicidad.\nIobit Unistaller es un potente desinstalador de programas, no solo protagoniza una desinstalación normal, sino que realiza análisis profundo en busca de archivos y claves de registro que se alojan en tu PC sin consentimiento del usuario.","replies":[]}]}]}]}