{"poster":"Isaac68","date":"2015-02-20T22:05:53.873+0000","title":"Bildschirmauflösung ingame zur falschen Größe geändert, jetzt kein Bild mehr ingame","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nich habe die Bildschirmauflösung während eines Games geändert und leider war es das Falsche.\r\nJetzt ist nur ein Bild mit \"großer Bereich\" oder so was zu sehen.\r\n\r\nWie kann ich das jetzt wieder ändern? Ingame geht das ja schlecht, wenn ich nichts sehe.\r\nHabe auch ein paar Threads über dieses Thema gesehen, aber bei mir in dieser Cfg.datei sind nur zwei Zeilen, mehr nicht.\r\n\r\nBitte um Hilfe.","replies":[{"poster":"Hinasaki","date":"2015-02-20T23:37:57.630+0000","up_votes":1,"down_votes":0,"body":"Versuche mal bei game.cfg es zu ändern. Hab es mal im Bild eingekreist. Schau dann mal im Spiel genau nach. Ob es geht.\n\nEdit: UPS vergessen das Bild zu zuschneiden.^^  Einfach mal nach rechts scrollen dann siehst du es. Zum schliessen nach rechts unten scrollen.\nsry nochmal für das große Bild.","replies":[{"poster":"Bulle420","date":"2016-07-08T05:40:15.311+0000","up_votes":1,"down_votes":0,"body":"Hat super funktioniert! Hab einfach die Auflösung der Anzeigeeinstellung übernommen und jetzt stimmt alles Ingame.","replies":[]}]},{"poster":"Yaxtee","date":"2015-02-20T22:10:03.340+0000","up_votes":1,"down_votes":0,"body":"Hey du :) \nDu kannst deine Bildschirmauflösung in LOL auch ändern, wenn du nicht ingame bist.\nDazu löscht du einfach deinen Config ordner im lol Hauptordner. \nDann sind allerdings auch Tastenbelegungen etc. weg die musst du dann neu einstellen :)","replies":[{"poster":"Isaac68","date":"2015-02-20T22:14:23.864+0000","up_votes":1,"down_votes":0,"body":"Hat leider nicht geklappt","replies":[{"poster":"BCC Björn","date":"2015-02-21T01:10:45.006+0000","up_votes":1,"down_votes":0,"body":"Sofern das Problem noch besteht könntest du, wenn du keinen anderen weg findest, auch die Reparier Funktion im Patcher nutzen. Kann allerdings etwas lange dauern (10 min bis vill zu 1std). Damit würden dann noch alle deine Persönlichen Einstellungen wie z.b Itemsets und Tastenkombinationen die du selber eingestellt hast, auf Standart zurückgestellt werden bzw bei dem Itemsets sind diese ganz weg","replies":[]}]}]}]}