{"poster":"Billγ","date":"2018-09-03T20:52:51.174+0000","title":"D3 ADC & D4 Support LF Team","subforum":"Clans & Teams","embed":{"description":"Real-time LoL Stats! Check your Summoner, MMR, Live Spectate and using powerful global League of Legends Statistics!","url":"http://euw.op.gg/multi/query=%CB%87metaabuse%CB%87%2Casrwonreasley","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"Hey,\r\nmein Kumpel Justin und Ich (Billy) suchen ein kompetitives Team mit gesetzten Trainingszeiten und die ein oder anderen Turniere. Justin spielt seit Season 3 und hat auch schon immer ADC gemaint und kann sich schnell der Meta anpassen (siehe Mage Botlane). Alles gar kein Problem. Ich spiele seit S1 und habe so gut wie jede Rolle schon gespielt. Seit ungef&auml;hr S7 maine ich aber Support und bin generell ein Fan von vielen verschiedenen Dingen (siehe mein op.gg). Ich bevorzuge Playmaker oder Braum. Ansonsten spielen Justin und ich eigentlich schon den Gro&szlig;teil der Season zusammen und haben eine gute Synergy in der Zeit aufbauen k&ouml;nnen. Turnier Erfahrung bringen wir beide ebenfalls durch vorherige Teams bereits mit. \r\n\r\nZu uns:\r\n\r\nJustin ist 18 Jahre alt und hat dieses Jahr sein Abitur gemacht und hat daher viele freie Kapazit&auml;ten und so gut wie immer Zeit zum spielen.\r\nIch bin 21 Jahre alt und studiere derzeit Oecotrophologie im dritten Semester. Ich habe also auch gen&uuml;gend Zeit f&uuml;r ein seri&ouml;ses Team.\r\nGenerell sind wir sehr interessiert an der Pro-Szene und sind immer auf dem laufenden was Teamcomps und power picks angeht.\r\n\r\nFalls ihr Fragen habt oder uns sogar in euer Team aufnehmen wollt, dann addet entweder mich oder Justin einfach ingame.\r\n\r\nSch&ouml;nen Abend,\r\n\r\nBilly","replies":[{"poster":"Yoshíko","date":"2018-09-04T07:53:55.141+0000","up_votes":1,"down_votes":0,"body":"Hay :) bin ebenfalls auf der Suche nach d3+ Spielern für teams :P könnt mich gerne bei Interesse adden oder auf unser TeamSpeak kommen :) ooesports.teamspeak.de","replies":[]},{"poster":"Radynexx","date":"2018-09-03T22:05:07.511+0000","up_votes":1,"down_votes":0,"body":"+","replies":[]},{"poster":"LOLpRoXis","date":"2018-09-03T21:51:06.158+0000","up_votes":1,"down_votes":0,"body":"Hi Interesse dann melde dich TS³ 92.42.44.98:1337 by www.exquisit-clan.de","replies":[]}]}