{"poster":"scribbles782","date":"2017-08-12T06:10:25.236+0000","title":"Renekton's Weakness?","subforum":"Gameplay","up_votes":32,"down_votes":9,"body":"Like most of my &#039;balancy&#039; posts, I&#039;m going to preface this with a statement-\r\n\r\nI am in bronze, so take everything I say with DEAD SEA levels of salt. Thank you.\r\n\r\nWhen I think of Renekton, I think that he has everything. Just let me list it out-\r\n- Uses no resource\r\n- Lifesteal\r\n- AOE Damage\r\n- Hard CC\r\n- Mobility (crazy mobility with minions)\r\n- Crazy Tankiness\r\n- More AOE Damage\r\n- And on top of all of that, insane burst combos.\r\n\r\nI just feel like in lane if Renekton has access to enemy minions to get a double dash off, he can just counter any champion. Even against a ranged match up he can just dash-stun-burst. He out-sustains a lot of top laners because he has no resource+lifesteal off minions. He outclasses every champ I play top of the same class (Vi, Camille, Kled, Kayn, ect.) in terms of damage and tankiness. \r\n\r\nAny help with this and just ONE weakness that he has would be greatly appreciated! {{sticker:slayer-jinx-catface}}","replies":[{"poster":"LoliKnight","date":"2017-08-12T09:57:37.009+0000","up_votes":14,"down_votes":1,"body":"Jayce works pretty well vs Renekton. When you see him dash in, just switch to hammer for movespeed and unit walking, and mash E. The trick is to position in such a way that he has to expend both dashes to get to you. Even if happenstance he gets the jump on you with one dash, Change hammer for resists , and immediately E him away. If he by chance uses the second E after stunning you to get behind you, Q to him and walk in front of him while he's slowed and E him away. Then wait a couple of seconds and try to burst him down in cannon form QE into Hammer form QE .\n\nPantheon outright wins the matchup. There's no two ways about it. The trick is to maintain your Aegis, and avoid fighting in cannon waves as cannon minion autos can consume your aegis. If you are without aegis as he comes in to trade, immediately w him as he dashes in to refresh it. If he cant stun you, he auto loses the trade. \n\nGaren has plenty of ways to deal with the Renekton trade. W just when he dashes in to reduce duration of his W, or preemptively silence him.\n\nIf you invest enough time into becoming a Singed main, there's no way you lose to Renekton\n\nMordekaiser absolutely shits on Renekton. \n\nTrundle can savage him pretty hard. Just remember to ult after he ults so you steal more health.\n\nEDIT: \n\nYou can cheese him lv 1 as Tryndamere provided he starts Q . Build up fury as fast as you can , spin onto him and ignite and auto him to death. ofc if he starts W this wont work\n\nAnd ofc there's everyone's favourite yordle Teemo. Renekton isn't winning this lane. Period. Just Q him so he can't stun you and move into your own minion wave and auto him . The result will most probably be him expending both his dashes to get to you, wasting his W, leaving him with only his Q, and once he exhausts his cooldowns he's food for you","replies":[{"poster":"Melledoneus","date":"2017-08-12T13:55:12.086+0000","up_votes":6,"down_votes":0,"body":"Shen is a pretty darn good champion to play against him, surprisingly.\n\nRenekton's big thing is his mobility. Guess who else's big thing is mobility? Riven. And a good Shen can destroy Riven. A great one will turn her into a snowball. Shen can negate Renekton's all-in by interrupting Renekton's dash with his own.\n\nAnother big thing with Renekton is that he can stun you with a point and click stun. Shen's W completely negates it. While he's doing the animation you can jump him and destroy him.\n\nAnother problem people have with Renekton is his survivability. Shen's Q melts large health bars when empowered, and Renekton is serving you the buff on a silver platter by dashing at you. \n\nRenekton's Q can also be absorbed by Shen's passive shield EASILY. Shen is also energy-based so he can keep up with Renekton all day.\n\nCombine all these things and you get a surprisingly difficult matchup for Renekton.","replies":[{"poster":"LoliKnight","date":"2017-08-12T15:09:17.952+0000","up_votes":1,"down_votes":0,"body":"Ahh, I've never played Shen post his VGU. But it does seem to be indeed in Shen's favor. What are the item choices to follow vs a Renekton? I hear SFC is pretty garbo now. Is an early TH a good investment? And do you force trades vs Renekton as Shen or do you bait him into unfavorable trades?\n\nEDIT:\n> And a good Shen can destroy Riven. A great one will turn her into a snowball.\n\nPls impart relevant knowledge kind Sir. You have piqued my interest.","replies":[{"poster":"Melledoneus","date":"2017-08-12T21:00:03.703+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LoliKnight,realm=EUNE,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=000700000000,timestamp=2017-08-12T15:09:17.952+0000)\n>\n> Ahh, I&#x27;ve never played Shen post his VGU. But it does seem to be indeed in Shen&#x27;s favor. What are the item choices to follow vs a Renekton? I hear SFC is pretty garbo now. Is an early TH a good investment? \n\nThe best thing to do against Renekton is bulk up. He relies on base damages mostly, so reducing those is crucial. Also, your Q gives ample damage in trades, so until he can afford to stock up on MR don't waste your time on Titanic Hydra. It is best to get some early armor and HP (especially HP, since Shen is lacking a bit in that department and he scales pretty well with it). \n\n>And do you force trades vs Renekton as Shen or do you bait him into unfavorable trades?\n\nWith Shen, it is almost always about being on the counter-attack. Renekton will try to assert his dominance because he has to. Let him try, then negate his tools and destroy him. If you have the advantage in HP and overall attrition, start forcing trades (Beware jungler presence, of course) to deny him his sustain. Renekton can do nothing to stop you if you land a taunt on him, so make sure you always move erratically to throw him off-guard. \n\nAnd remember to walk with him if he runs so you can get another trio of empowered autos to whittle him down with. Renekton is great with short trades, but extend it a bit and he falls short. But do beware because if you mess up he WILL hurt. A lot.\n\n> EDIT:\n> \n> Pls impart relevant knowledge kind Sir. You have piqued my interest.\n\nRiven is a champion who thrives on killing her opponent by being aggressive and faster. Shen can:\n1. Cancel her combos with a well-placed taunt.\n2. Negate her passive with his W.\n3. Shield her AoE damage early on.\n4. Bulk up while still having great damage against her.\n5. Leave lane and snowball his carries at her biggest power spike.\n\nShen, besides Garen, is perhaps the ultimate \"fuck you\" to Riven when played correctly. However, ever since she got decreased delays on her animation cancelling Riven is less freelo of a matchup because if your reaction time isn't godly she can pull off combos faster than one can react (which I believe is hardly fair considering her counterplay is reactive and not preventative).\n\nBesides that tidbit, play counter-aggressive and play near your turret. You can force her into starvation if you manage to freeze the wave, too, because only a fool would go under a Shen's turret.\n\nThat's about all I got. If you want more expert advice, talk to Fluttershen. He's an excellent Shen player and although I play a different Shen than him, his skill is respectable and formidable.","replies":[{"poster":"LoliKnight","date":"2017-08-13T11:23:36.033+0000","up_votes":1,"down_votes":0,"body":"This is more than what I asked for. Thanks a lot for your time and response.","replies":[{"poster":"Melledoneus","date":"2017-08-13T12:33:08.987+0000","up_votes":1,"down_votes":0,"body":"No problem. Not a lot of people are ever genuinely interested in Shen, so it's my pleasure to help someone who is. If you want to try getting into him as a champion (top or jungle preferred), I'd be more than happy to help you get started.","replies":[]}]}]}]}]}]},{"poster":"Eternal Torment","date":"2017-08-12T06:24:45.761+0000","up_votes":3,"down_votes":9,"body":"honestly, renektons weakness is rivalry. he is outmatched by even worse lanebullies than him. namely jax, jayce and irelia. and a good gp will always survive rekentons all ins due to good use of remove scurvy. \n\nrenektons biggest weakness is that he falls off lategame. his strength lies in earlygame due to his ability to quickly get off all of his combos, he has relatively high flat base damage OR good scalings, depending on which Skill we talk about. BUT if renekton doesnt go full ad he wont do any damage lategame, he will be a bruiser and honestly just a focus bait with a single-target stun. the only Person to who renekton becomes a threat post-35 minutes is the adc and that only because of his stun, if he gets the enrage-boosted one with 1.5 seconds.\n\nyou want to win lane vs renekton? Play something he can't outsustain.\nnamely, as i said, irelia and gp and darius too can fare really well vs renekton. jayce is an arguable pick, a good jayce can stomp renekton hard, BUT it requires being decently good with jayce, and ignite top. with jayce youre fukd if renekton catches you low on mana, so a careful well thought out Approach is to be considered.\n\nEdit: Renekton also has a very predictable combo. he will rarely ever do anything other than E-AA-W-Q-E so you can prepare yourself by watching his movement carefully and have an itchy trigger finger on your disengages.\n\nalso, how come people hate what i say so much when theres literally others saying the same but get plus upvotes? salty because i forgot to mention Pantheon? ","replies":[{"poster":"Rustling Bush","date":"2017-08-12T07:04:57.344+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Eternal Torment,realm=EUW,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=0003,timestamp=2017-08-12T06:24:45.761+0000)\n>\n> honestly, renektons weakness is rivalry. he is outmatched by even worse lanebullies than him. namely jax, jayce and irelia. and a good gp will always survive rekentons all ins due to good use of remove scurvy. \n> \n> renektons biggest weakness is that he falls off lategame. his strength lies in earlygame due to his ability to quickly get off all of his combos, he has relatively high flat base damage OR good scalings, depending on which Skill we talk about. BUT if renekton doesnt go full ad he wont do any damage lategame, he will be a bruiser and honestly just a focus bait with a single-target stun. the only Person to who renekton becomes a threat post-35 minutes is the adc and that only because of his stun, if he gets the enrage-boosted one with 1.5 seconds.\n> \n> you want to win lane vs renekton? Play something he can&#x27;t outsustain.\n> namely, as i said, irelia and gp and darius too can fare really well vs renekton. jayce is an arguable pick, a good jayce can stomp renekton hard, BUT it requires being decently good with jayce, and ignite top. with jayce youre fukd if renekton catches you low on mana, so a careful well thought out Approach is to be considered.\n\nisnt {{champion:126}} one of the hardest champions to mechanically play?","replies":[{"poster":"Pierce The Veal","date":"2017-08-12T11:39:57.798+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Summoner Grey,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=00030000,timestamp=2017-08-12T07:04:57.344+0000)\n>\n> isnt {{champion:126}} one of the hardest champions to mechanically play?\n\nI think you forgot the /s","replies":[]},{"poster":"dominusx","date":"2017-08-12T11:04:55.080+0000","up_votes":7,"down_votes":0,"body":"I'm on my knees praying for you to be completely sarcastic.","replies":[]},{"poster":"Eternal Torment","date":"2017-08-12T07:37:16.787+0000","up_votes":1,"down_votes":2,"body":"yeah, that he is. between mana management and skillcombo use he is really hard to master even for some pro Players, but once you have the knack of him you can be a beast. \n\nhes one of the champions id recommend to thoroughly practice in bot games and practive Tools before going into the rift vs players","replies":[{"poster":"Pierce The Veal","date":"2017-08-12T11:40:35.112+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Eternal Torment,realm=EUW,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=000300000000,timestamp=2017-08-12T07:37:16.787+0000)\n>\n> yeah, that he is. between mana management and skillcombo use he is really hard to master even for some pro Players, but once you have the knack of him you can be a beast. \n> \n> hes one of the champions id recommend to thoroughly practice in bot games and practive Tools before going into the rift vs players\n\n? He's easy as fuck to play idk what you're smoking.","replies":[{"poster":"Eternal Torment","date":"2017-08-12T12:10:35.142+0000","up_votes":1,"down_votes":0,"body":"well sorry to dissapoint you then, look at jayce in low elo vs jayce in high elo. the difference is so ridiculously visible it hurts almost.\n\njayce is really difficult to Play. sure, he can safely poke, he has some strong Tools to help him survive difficult situations. but it is combining those Tools that make him so difficult. positioning, mana control, itemization and decisionmaking on jayce are very big. \nyeah, maybe as a champion hes SOMEWHAT easier, but he is definetly a hard champ to Play if you wanna measure gameknowledge. \npushing, split pushing, trading, all in-ing, flanking with his ranged QE and hitting his ranged QE. he is very very wide in content to learn.\n\nwhat im smoking is called knowing how to Play jayce. sure, i dont have much points on him nor mastery 7, but in those times i do Play i badly lose the teams whole game if i start being careless for even a second","replies":[{"poster":"Pierce The Veal","date":"2017-08-12T23:17:01.896+0000","up_votes":1,"down_votes":0,"body":"I mean, every champion will cause the whole team to lose if they are careless for even a second. This is a team game. None of what you said is something special to Jayce.","replies":[{"poster":"Eternal Torment","date":"2017-08-13T05:17:10.338+0000","up_votes":1,"down_votes":0,"body":"false. there are champions who are made to be successful on passive playstyles. there are champions made to be successful on passive-aggressive playstyles. and some are successful in aggressive playstyles. jayce Needs to excell in ALL 3 OF THEM to be good. \n\njust because you played jayce once against someone who had no idea what they do does by a longshot not mean he is easy.\ntheres a difference between your champ being easy and the enemy being bad, a difference you dont seem to know all that well.","replies":[]}]}]},{"poster":"GayFluffyUnicorn","date":"2017-08-12T13:45:14.387+0000","up_votes":1,"down_votes":0,"body":"He has animation cancels, auto resets, important powerspikes you need to know and he's very vulnerable to ganks and dives with CC. \nNo he is not as easy to play as a lot of people think just because they play against idiots who stand in every EQ combo and let you freely harass them.","replies":[{"poster":"Pierce The Veal","date":"2017-08-12T23:15:33.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GayFluffyUnicorn,realm=EUW,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=00030000000000000001,timestamp=2017-08-12T13:45:14.387+0000)\n>\n> He has animation cancels, auto resets, important powerspikes you need to know and he&#x27;s very vulnerable to ganks and dives with CC. \n> No he is not as easy to play as a lot of people think just because they play against idiots who stand in every EQ combo and let you freely harass them.\n\nWell I'm not gonna try to take you off your high horse, but Jayce isn't nearly as difficult as you purport him to be.","replies":[]}]}]}]}]},{"poster":"LankPants","date":"2017-08-12T10:30:59.220+0000","up_votes":2,"down_votes":0,"body":">he is outmatched by even worse lanebullies than him. namely jax, jayce and irelia\n\nHow is Irelia even a lane bully let alone a worse one than Renekton. Irelia has a powerspike midgame, Ren's is early.","replies":[{"poster":"Eternal Torment","date":"2017-08-12T11:01:58.718+0000","up_votes":1,"down_votes":0,"body":"Sure, irelia has a bit of a later timer for her powerspike but if you max E first on her during laning phase it should give you some room to act. renek's stun timer is set whereas yours as irelia grows into 2 seconds at lvl 9, which outmatches his 1.5 seconds, assuming he hits with 50& fury bar. that it is a point and click Skill makes it easier, if you see renek Approach, just click your E on him already, since it is a targeted cast it will automatically proc the second renek gets in range, likely stunning him to which you can either trade him or make a run for it.\n\nalso, renek has because of his W and E cooldowns almost twice the recovery time than irelia between 2 trades, making his all Outs a double edged sword which will likely force him to retreat, even if just a bit.\n\nit's all about how you Play it. renekton can technically be countered by anyone if played smart enough, his pattern is predictable as fuck, and irelia is weirdly strong against predictable enemies. thought, i will not lie, it takes some getting used to playing her around that pattern.","replies":[{"poster":"LankPants","date":"2017-08-12T11:46:59.788+0000","up_votes":4,"down_votes":0,"body":">if you max E first on her during laning phase\n\nhttp://lolalytics.com/champion/Irelia/\n\nNobody does that. E max on Irelia hasn't been good for a very long time. If you max E on Irelia you just won't have the damage to trade with Renekton anyway.","replies":[]}]}]}]},{"poster":"waiting for WoW","date":"2017-08-12T06:17:12.651+0000","up_votes":7,"down_votes":1,"body":"{{champion:150}}","replies":[{"poster":"scribbles782","date":"2017-08-12T06:20:00.626+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=Blessed1990,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=0000,timestamp=2017-08-12T06:17:12.651+0000)\n>\n> {{champion:150}}\n\nDash-Dash-Stun-Combo. Renekton has early burst to probably kill Gnar early. If not, Renekton will probably buy a Ninja Tabi and Black Cleaver anyway to counter the damage and the armor Gnar will probably be building. Also if the Renekton is good enough he can predict Gnar ult and try to dash out.","replies":[{"poster":"CamilleRule34","date":"2017-08-12T06:22:59.427+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=scribbles782,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=00000000,timestamp=2017-08-12T06:20:00.626+0000)\n>\n> Dash-Dash-Stun-Combo. Renekton has early burst to probably kill Gnar early. If not, Renekton will probably buy a Ninja Tabi and Black Cleaver anyway to counter the damage and the armor Gnar will probably be building. Also if the Renekton is good enough he can predict Gnar ult and try to dash out.\n\nGnar out ranges even reneks Double Dash. Often you can see when a Renek will double dash, and its just before he gets 50 fury. Not when, but just before.","replies":[]},{"poster":"waiting for WoW","date":"2017-08-12T06:25:33.177+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=scribbles782,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=00000000,timestamp=2017-08-12T06:20:00.626+0000)\n>\n> Dash-Dash-Stun-Combo. Renekton has early burst to probably kill Gnar early. If not, Renekton will probably buy a Ninja Tabi and Black Cleaver anyway to counter the damage and the armor Gnar will probably be building. Also if the Renekton is good enough he can predict Gnar ult and try to dash out.\n\nDon't get me wrong I know that Renekton is a very strong laner. An equally skilled gnar can outplay everything he does, however. Renekton is a very predictable champion with a very predictable pattern of play.","replies":[]},{"poster":"PhDs Nuts","date":"2017-08-12T07:42:03.689+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=scribbles782,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=00000000,timestamp=2017-08-12T06:20:00.626+0000)\n>\n> Dash-Dash-Stun-Combo. Renekton has early burst to probably kill Gnar early. If not, Renekton will probably buy a Ninja Tabi and Black Cleaver anyway to counter the damage and the armor Gnar will probably be building. Also if the Renekton is good enough he can predict Gnar ult and try to dash out.\n\nGnar shouldn't be getting armor early aside from Tabi.  He builds BC and often a Mallet before going tank.","replies":[{"poster":"ABlueQuaker","date":"2017-08-12T15:11:35.330+0000","up_votes":1,"down_votes":0,"body":"{{champion:150}} really only needs {{item:3071}}.\n\nFrom there he can go into {{item:3075}} or {{item:3065}} for Tankiness, {{item:3812}} for duelling, or {{item:3022}} for kiting power.\n\nI personally put a fairly low priority on {{item:3022}} .","replies":[{"poster":"Votable Jester","date":"2017-08-12T18:11:19.831+0000","up_votes":1,"down_votes":0,"body":"{{item:3022}} also helps you chase enemies down (giving you more time for more autos and Qs).\n\nBut you do you, I've almost never played {{champion:150}} myself, and do some strange builds on my own champions. xD","replies":[]}]}]}]}]},{"poster":"Zëd Lęppelin","date":"2017-08-12T13:05:13.661+0000","up_votes":5,"down_votes":0,"body":"Steve Irwin","replies":[{"poster":"LoliKnight","date":"2017-08-12T15:11:38.879+0000","up_votes":1,"down_votes":0,"body":"Too soon?\n\n{{sticker:zombie-nunu-tears}}","replies":[]}]},{"poster":"Hyrum Graff","date":"2017-08-12T14:46:06.731+0000","up_votes":5,"down_votes":1,"body":"The listing thing. Can we not? It adds nothing to the conversation, because any champ looks OP on paper if you list everything out. Ezreal still has all the strengths he had a year ago, so my list would look the same, but then he was good and now he's trash. The more important thing is to analyze why the strengths are relevant compared to weaknesses.\n\nRenekton's 1v1 ability falls off later in the game. So do the other picks you mentioned (although not as hard), but they are all better at engaging teamfights than Renekton is, so they have a fall-back plan if the other team has someone that can answer their splitpush.","replies":[]},{"poster":"Champion Skin","date":"2017-08-12T19:26:59.866+0000","up_votes":1,"down_votes":2,"body":"> - Crazy Tankiness\n\nNo he doesn't really.... he gains some durability from his ult....otherwise it is all in the sustain he gets from his Q.... it is just that he usually builds semi-defensive items which any champion can do really....\n\nAnd if all you want to do is win top lane then {{champion:223}} is pretty good.... his passive makes him deal 1% of max hp on AA stacking up to 3% (goes up to 1.5% --> 4.5% with levels) and it also makes his Q stun if he gets 3 stacks.... this makes him quite good in a level 1 punch fight (if your opponent lets you)\n\nAnd of course his W deals quite a lot of damage (but be aware that it removes stacks)\n\nAnd his E gives him tankiness/sustain\n\n\nBut... Tahm just as Renekton pays for it by being weaker later on.... Renekton in that his damage falls off to some degree (unless he snowballs) and he ends up as just a stun bot.... while Tahm pays for it by being gated by needing stacks (it is a lot harder to get 3 stacks on an enemy in a teamfight) and well all of his single target damage and delayed stuff is a lot less reliable in teamfights (though of course he can save allies with his W but then he loses most of his damage and he needs to be close to the target as well)\n\nThere is also Pantheon.... there are quite a lot of champions that are difficult to beat in lane because they are strong early.... and if they beat you early and snowball they feel very OP (most champions feel OP if they get feed) but if they don't snowball they often end up quite weak or even almost useless","replies":[{"poster":"Håppy","date":"2017-08-12T21:50:49.023+0000","up_votes":2,"down_votes":0,"body":"Why..... are you typing like this..... it comes off as really condescending on top of just being edgy.......","replies":[]}]},{"poster":"Elkington VI","date":"2017-08-12T19:39:37.018+0000","up_votes":2,"down_votes":0,"body":"In the old days, his weakness was his late game, since his damage would fall off of a cliff (and his utility is limited), but that doesn't really happen anymore. If defensive scaling/masteries/itemization were stronger than Renekton would actually fall off. There needs to be more %damage reduction in both masteries and itemization. The fact that he can rush Black Cleaver and not worry about getting wrecked in mid game teamfights just goes to show how much strategy has been removed from both itemization and teamfighting. ","replies":[]},{"poster":"Sire Hippington","date":"2017-08-12T13:31:15.154+0000","up_votes":2,"down_votes":0,"body":"He is gated by CDs alot, bothhis mobillity, burst and CC(which is only singletarget) have way aboth avrage CDs, only his sustain/aoe is rather spamable.\nAlso, neither sustain, burst or cc are particular strong unless he has furry to empower his skills.\nHis mobillity is not that great, the E has rather short range, and while the double dash is potent, it's conditions make his engage patterns outside of lane very predictable and easy to deny without flash.\nHe's also one of the few champs with no soft cc at all.\nRenekton is powerfull in lane, and that's what he's ment to be, but if he gets to teamfights without beeinf rather far ahead, he struggles alot. It's easy to kite him, once he used the double dash+W he's just strandet with not much more to offer, and later on his tankiness is meaningless as carries rip through it in no time anyway while his damage also falls of as soon as he stops itemizeing for it, and if he builts agressive he just explodes in teamifghts.\n\nIf you want to deal with him, just play save and respect that he is a stronger laner, if you don't feed him you'll outscale him for teamfights. \nAnd while he's stong in lane, he's not impossibler to beat. If his ragebar is low, you can trade well with him on most champs(camile and Kayne have a rather bad earlygame, so don't expect to figth THE eralygame toplaner with them), and if he uses his E-Aa-W-Q-E combo, you have a ~13 sec window to deal with him after that as his AAs are not particular strong and the Q is the only low cd spell. Renekton doesn't win lane by superior trades usually, but by outsustaining and out pushing.\nAnd try to stay away formyour minions a bit, renkton usually wants to land his Q on you and your wave for more heal/furry.\n\nAnd most ranged champs can easily win vs renekton in lane, cause his gapcloser has a huge cd early on and is rather predictable, though you need to be somewhat skilled, cause getting cought once can already be the end.\n\nSo the main weaknesses for renekton are that his dps for all-ins without ult isn't that great because of high CDs, he's rather predictable and his lategame is still pretty weak.","replies":[{"poster":"Champion Skin","date":"2017-08-12T20:04:29.888+0000","up_votes":1,"down_votes":0,"body":"> If you want to deal with him, just play save and respect that he is a stronger laner, if you don't feed him you'll outscale him for teamfights.\n\nWell yes.... though don't respect him too much and just let him trade with you and just back off after his burst.... since you should hit him back when he has used all of his abilities and can't do much for a while so you should use that opportunity\n\nAnd Renekton isn't that good at level 1 like I pounded him as {{champion:223}} (his passive damage + Q stun is really good at level 1 if anyone even thinks about brawling) though yes at level 2 Renekton probably wins (especially if he gets empower W) and level 3 it is probably a toss up.... with Renekton having better short trades but if Tahm is able to get on Renekton and stick to him then he can pound him with AA + passive damage + Q stun + W damage\n\nThough the Renekton I played against possibly wasn't that good given that he took  Thunderlords against Tahm.... which to be fair can be good for early cheese and snowballing (he did take ignite) though Fervor might have been the better choice when trying to punch through a tank like Tahm","replies":[]}]},{"poster":"Sohleks","date":"2017-08-12T06:28:26.698+0000","up_votes":2,"down_votes":0,"body":"He was originally designed to be a hard to survive lane bully that falls off to contrast his brother Nasus. A long time ago. Pantheon holds that crown a lot more accurately now. So yeah his ability to dash in and stun and heal in lane is pretty dang good. He does have some avenue of play around for his opponent though being his rage mechanic. For every 50% rage he gets that will be an ounce of hurt which by default requires him to push or fight to obtain. He can be beaten if he makes an error with no rage.\n\nHe is great atm now however because he doesn't fall off super hard anymore. You can thank fervor of battle quickly granting him 1000+ gold of AD when he triple attacks with his stun as melee with cleaver and titanic granting him tremendous burst for that. His ability to tank up and still be lethal is very easy thanks to that. So he's the \"ideal\" top lane menace because he doesn't give up much bulk for all his threat his ult granting some too.\n\nNot saying his old powercurve was fantastic fun. These days most champions are impactful at least for 2/3rds of the game. 1/3rd type champs are just archaic and difficult to make satisfying and fair. Hence updates like Darius and Sona.","replies":[]},{"poster":"PhearBunny","date":"2017-08-12T16:00:45.402+0000","up_votes":3,"down_votes":1,"body":"Renekton is like Riven. He doesn't have a weakness. His weakness is players being unable to master him. However when u master him there is no counterplay, and u just have to hope your carries are doing well enough to deal with him.\nOnly thing id really feel comfortable laning against Renekton with is Gnar.","replies":[]},{"poster":"kargish","date":"2017-08-12T12:50:30.082+0000","up_votes":2,"down_votes":1,"body":"{{champion:80}} \n\nEnjoy free win","replies":[]},{"poster":"Dasdi96","date":"2018-01-28T00:01:02.997+0000","up_votes":1,"down_votes":0,"body":"{{champion:58}} is actually extremely shit atm. He gets fucking outtraded by {{champion:57}} {{champion:516}} when they buy {{item:3076}} in laning phase. Not to mention he is absolutely shit in teamfights when enemy adc gets 3 items.","replies":[{"poster":"AdamFrostyBeast","date":"2018-01-28T01:18:48.922+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dasdi96,realm=NA,application-id=3ErqAdtq,discussion-id=OyYqgeMh,comment-id=0027,timestamp=2018-01-28T00:01:02.997+0000)\n>\n> {{champion:58}} is actually extremely shit atm. He gets fucking outtraded by {{champion:57}} {{champion:516}} when they buy {{item:3076}} in laning phase. Not to mention he is absolutely shit in teamfights when enemy adc gets 3 items.\n\nrenekton is still a godly bully if you master his mechanics and he will forever be like that unless they rework him or gut his absurd W base damage and ad scaling. he is also meant to be built full ad rather than off tank due to his insane splitpush potential always pulling at least 2 champions to get him to stop... he does suck in teamfights when his flash is down but given enough fury build up and flash up he can be an excellent initiator instantly removing a squishy.","replies":[]}]},{"poster":"AdamFrostyBeast","date":"2018-01-27T23:07:22.357+0000","up_votes":1,"down_votes":0,"body":"sorry i'm resurrecting but i'm a renekton main (former d1) and there aren't any champions that he is weak against but he has one major drawback. You see here, communication is the key and every single renekton player out there will eventually push the wave one way or another. His main weakness is his reliability on E to escape or set up his combo. His E on rank 1 without cdr has a whopping 17 seconds cd and since i have played against renektons myself in every elo from bronze to low master, i can say that almost all of them will use their E to harass you with Q or go for a full combo with W aa blah blah blah... The second they use their E they are probably the most vulnerable champion to ganks. Definitely, your jungler won't be there all the time but patience is the key. Just like riven back in s3, s4 before she got gutted into oblivion, so renekton are lane bullies. They are supposed to be oppressive during the laning phase. If you are not feeling confident about the matchup you may aswell ask from one of your teammates to play top instead or pick a champion that is either ranged or too tanky. It doesn't matter if you are down 20-30 minions (no i won't be bringing the renekton falls off during the late game because that's untrue). What you are trying to do here is not let him snowball off of you by killing you over and over again. Renekton relies on his flash too much to make a heavy impact in teamfights, especially when against full cc since his E is rather predictable, slow and at the end of its animation renekton is sort of \"microstunned\" just like when casting his W though compared to it the stun is barely noticeable but is still there.\n\nThe only champion that really made me want to swap lane is quinn. There is absolutely nothing you can do against her as renekton so if you are feeling confident playing quinn be my guest. Also renekton will never touch a highly competent and cautious jayce. Also, tahm kench was a nightmare back in his glory top lane days.","replies":[]},{"poster":"SpookyNeedle","date":"2017-08-13T15:30:19.345+0000","up_votes":1,"down_votes":0,"body":"Move back and forth really quickly, in and out of his threat range, when he E's onto you, he'll miss and he probably also tried to W. As soon as the green above his head goes away, trade because he used two abilities.","replies":[]},{"poster":"dont trust girls","date":"2017-08-13T12:10:28.077+0000","up_votes":1,"down_votes":0,"body":"\n>(Vi, Camille, Kled, Kayn, ect.)\nVi? noooo xD.\nOkay so  early in the game he has a lot of damage but most of the time he cant 1v2 so you can ask for an early gank to alleviate the pressure. His early game is really good and his late game is realllly bad. So just don't LOSE to him in lane. Focus on minions and get as much cs as you can and you will probably outscale him past the 20 minute mark.","replies":[]},{"poster":"AFK Push","date":"2017-08-12T10:23:31.598+0000","up_votes":1,"down_votes":0,"body":"Renekton has very little kill pressure against tanks if they actually know how to lane, and ranged tops like jayce, teemo, and quinn can gimp his lane phase as well. Trust me a good ranged top player, or good tank player won't let you have your way with them. You have to rely on your team, and get shit done during mid game. Honestly, if you do land your combos as Camille you have more burst than renek in the early game (especially with sheen/tri force). Kled makes nearly every melee top laners life hard, that isn't an easy match up for renekton, because he can't be bursted and his all ins are brutal.","replies":[{"poster":"Champion Skin","date":"2017-08-12T20:36:50.567+0000","up_votes":1,"down_votes":1,"body":"{{champion:223}} can also beat Renekton.... since Renekton doesn't have enough burst to kill Tahm and in extended fights Tahm wins with the sustained damage from his passive (at 3 stacks it deals 3% - 4.5% of Tahm's max hp which is added to his AA's, Q's and W)\n\nAlso Tahm Q has 6 seconds cooldown and in an extended fight having a 1.5 seconds stun every 6 seconds is really powerful\nWhile for comparison Renekton Q has 8 and his W has 13 (scales down to 9) and E has 18 (scales down to 14)\n\nTahm can fight at level 1 though he needs to avoid taking too much minion damage somehow.... level 2 he should probably avoid fighting and at level 3 Renekton wins short trades while Tahm wins if he can stick to Renekton after Renekton has used his cooldowns (though he does have to watch out for fury as Renektons empowered abilities are quite strong.... his non-empowered abilities not so much)","replies":[{"poster":"AFK Push","date":"2017-08-13T02:47:45.854+0000","up_votes":1,"down_votes":0,"body":"If renekton actually uses his minions not letting tahm q him, then renekton won't be getting eaten. It does take a lot of trades I admit to kill a tahm. He builds full tank, has very good sustain, and won't allow anything but the shortest of trades. Tahm outscales, so all he has to do is play safe honestly and peel for his team (he also outroams thanks to his ult), so if I was renekton I would push tahm into tower, so he couldn't roam or punish the roam by taking all of top.\n\nps: tahm can beat any melee champ, especially melee carries. He makes their lane phase hell.","replies":[{"poster":"Champion Skin","date":"2017-08-13T03:26:51.958+0000","up_votes":1,"down_votes":0,"body":"Well yeah Tahm is quite strong against melee champions in lane\n\nAfter all in lane it is so much easier to build up stacks (especially against melee champions who have to get in melee range) and the fact that all of his damage/CC is single target doesn't matter all that much when there is only one enemy\n\nAnd yeah he scales decently with the utility of his W\n\nthough how useful that is depends on the enemy team since it isn't great against DPS because the DPS just switches targets and the ally eaten by Tahm is still out of the fight for a while because of the delay on W re-cast and and there is also AoE where he can only protect one ally or if he gets hit by AoE CC before he is able to eat the target.... though it can really screw over burst/pick/CC champions or if there is one ally the enemy team needs to kill to be able to win fights\n\nTahm W is kind of a weird ability\n\nThough of course Tahm also have the option to just build {{item:3800}} and force the enemy carries to focus him (or if they don't he does have decent damage and CC to punich them ignoring him) but he isn't really the best for that job but he can at least cause some problems for immobile carries","replies":[]}]}]}]},{"poster":"PACIFlC MALL","date":"2017-08-13T03:25:58.932+0000","up_votes":1,"down_votes":0,"body":"1. memorize his double dash range and flash e range\n2. memorize cooldowns\n3. trade back if you can after he uses cooldowns so he doesn't get free damage, just like you would any caster \n4. abuse weak level 1\n5. watch for level 2 and 3 especially with ignite\n6. play champions that can farm safely if you can't fight him\n7. his abilities push wave so try to freeze at your turret to deny his healing and set up ganks, ranged champ makes this easy \n8. tell your jungler not to gank from in front or he will double dash","replies":[]},{"poster":"Onandaga","date":"2017-08-13T01:20:39.126+0000","up_votes":1,"down_votes":0,"body":"I've reliably beat every Renekton I've faced as Nasus. Buy a crap ton of potions and spam them so you can stay in lane, stack Q, lifesteal off the minions whenever possible and DON'T engage until you at least have Shen+ Frozen Heart. Renekton will very painfully feel his lack of scaling against Nasus, all you need to do as Nasus is play like should you with pretty much anything other matchup and focus on freezing the lane/not dying.","replies":[]},{"poster":"Imperial Japan","date":"2017-08-12T23:57:57.209+0000","up_votes":1,"down_votes":0,"body":"His scaling is lacking. A lot of power goes into his early and mid game and he falls off kind of like pantheon. (A little less hard though)","replies":[]}]}