{"poster":"dbydalek","date":"2015-05-04T19:57:17.353+0000","title":"CHROMA SKIN LEAK???","subforum":"Concepts & Creations","up_votes":1,"down_votes":0,"body":"so i was messing around and saw that rocket girl tristana had chroma pack available??? Not sure if this was a leak but it sure looks like one.","replies":[{"poster":"Chocolate Waifu","date":"2015-05-04T22:01:29.062+0000","up_votes":2,"down_votes":0,"body":"If it was on PBE, high chance, if not, no not really.","replies":[]},{"poster":"mοno","date":"2015-05-04T20:46:46.032+0000","up_votes":1,"down_votes":2,"body":"Even if it was a leak, it wouldn't be on the **official league client**.\n\n*facepalm*","replies":[{"poster":"macromite","date":"2015-05-05T03:29:11.766+0000","up_votes":1,"down_votes":0,"body":"Go check it then, unless your chicken.","replies":[{"poster":"mοno","date":"2015-05-06T00:52:11.931+0000","up_votes":1,"down_votes":0,"body":"Oh lordy.\n\nYou don't **leak** something, ON THE OFFICIAL CLIENT.\n\nIf it's on the client, then it's not being _leaked_. Your grasp of common words relate more to a chicken than anything else here. -.-\"","replies":[{"poster":"macromite","date":"2015-05-06T21:34:11.084+0000","up_votes":1,"down_votes":0,"body":"A leak can be described as something secret or unknown becoming known. it was never mentioned that the tristana skin was getting a chroma, therefore, it is a leak. call it what you want, just understand what it is.\n\nI was calling you a chicken so you would actually check the damned thing, because when you said it could not be a leak, I thought you were implying that it could not exist. check your wording better, or be more descriptive of your meaning from here on.\n\na question that you make me want to ask though, is if it is not a leak, what in gods name is it? because it is a leak.","replies":[]}]}]}]},{"poster":"coeurloyal","date":"2015-05-04T22:47:38.654+0000","up_votes":1,"down_votes":0,"body":"Nooooo. Even if it was accidentally slipped into the actual league client, they would have released a follow-up patch to remove it. It's probably just Photoshop.\n\nThat would be a good chroma skin, though.","replies":[{"poster":"dbydalek","date":"2015-05-05T01:56:15.050+0000","up_votes":1,"down_votes":0,"body":"i took the screenshot directly form the lol client. if you own the skin, check it out!","replies":[{"poster":"Fertsa","date":"2015-05-05T02:53:43.908+0000","up_votes":1,"down_votes":0,"body":"It's there. i noticed it too.","replies":[{"poster":"coeurloyal","date":"2015-05-06T01:01:14.616+0000","up_votes":1,"down_votes":0,"body":"I checked as well, and it's there. That's interesting. And awesome :)\n\nSorry about the doubt... I thought you had meant that you found it somewhere online and not in the client yourself.","replies":[]}]}]}]},{"poster":"JerrBear7","date":"2015-05-05T05:32:34.187+0000","up_votes":1,"down_votes":0,"body":"It's there on the live server. I think it's for hype and maybe leak. Either one looks like they're making a chroma rocket girl Tristana!","replies":[]},{"poster":"lxlLilybellelxl","date":"2015-05-04T22:58:06.395+0000","up_votes":1,"down_votes":0,"body":"On PBE there is indeed a Chroma option wheel onoRocket Girl Tristana but there are no actual Chromas released or yet announced for this skin.","replies":[]},{"poster":"SeductiveGrandpa","date":"2015-05-04T20:06:00.962+0000","up_votes":1,"down_votes":0,"body":"I dont think it was a leak considering it was on the PBE too, maybe it was just there to hype the players?","replies":[]}]}