{"poster":"JoBilly","date":"2015-11-16T18:04:21.064+0000","title":"Auf ein Wort","subforum":"Champions & Gameplay","up_votes":4,"down_votes":1,"body":"Guten Tag Leute,\n\nWie ihr wisst gibts recht extremen Unmut wegen dem neuen Preseason Patch. Ich selbst habe manchmal meine Probleme damit. \n\nJEDOCH! Schaut euch das Wort an. PRE season. Das bedeutet Vorsaison. Die Zeit bevor es wieder &quot;ernst&quot; wird. Vieles wird sich &auml;ndern und man wird sich daran gew&ouml;hnen. \nEinige von euch kennen das vielleicht von YouTube. Es gibt eine visuelle &Auml;nderung und alle verlieren ihre Kr&uuml;mel. (vom G+ change abgesehen) Kratzt es euch heute noch? Gr&ouml;sstenteils nicht.\nRiot hat jetzt einen extrem gewagten Schritt gewagt und hat ein halbneues Spiel herausgebracht. Ich habe keine Ahnung von den Details aber es wird bei einer solchen Menge von changes garantiert imba Situationen geben. \n\nWie viele Male wurde ein Champ als OP eingestuft (Hab ich selbst auch schon gemacht, ich weiss) ist aber &uuml;ber die Zeit aus der OPness verschwunden? Manchmal durch ein Riotnerf, manchmal aber auch durch das aktive Auseinandersetzen mit dem OP Umstand und dem Ausdenken von Counterplay gegen diesen. Bei vielen dieser Umst&auml;nde ist das Counterplay nat&uuml;rlich um EINIGES schwieriger als bei anderen\n\nDie vom PBE sind auch nicht unbedingt zu blamen. Wie viele sind auf dem PBE und k&ouml;nnen alles auf OPness testen? Viele spielen mit 200+ ping, machen Bot oder Custom Games. Die &quot;Sample Size&quot; ist schlicht und einfach zu niedrig um alle Sachen in zwei Wochen abzudecken. Die Millonen Games die jeden Tag auf dem regul&auml;ren Server gespielt werden sind da schon um einiges besser. Zum Beispiel Warlords Bloodlust wird auf den n&auml;chsten Patch generft, Morde auch. Kog kriegt ein Buff.\n\nSie h&ouml;ren auf euch auch wenn es nicht so danach scheint... mehr oder weniger.\n\nDenkt daran. JEDER f&auml;ngt in diesem Spiel in den gleichen Startl&ouml;chern an, vom Comtent her gesehen. Einige sind einfach Schnellstarter, andere nicht so.\n\nIch kann wirklich nicht den Moralapostel spielen da ich auch manchmal hart gefrustet wurde trotz des Versuchs von aktivem Counterplay. Gebt Riot Zeit.\n\nTl;Dr: \nSeht die Preseason Zeit als erweiteretes PBE an da dadurch die Bugs und imbalances bis zur regul&auml;ren Season ausgeb&uuml;gelt werden k&ouml;nnen, mit eineren weit GR&Ouml;SSEREN playerbase als der PBE es jemals schaffen wird.\nEs gab so viele Changes, dass es imbalances geben wird. Darum helft Riot, gebt konstruktive Kritik und Vorschl&auml;ge. Diskutiert. Es ist erst der 5te Tag der Preseason also ist bei weitem nichts verloren.\n\nTlDr;TlDr\nGebt Riot Zeit und Geduld. Sie haben einen Haufen Sand und Steine auf den Boden geworfen. Wir sind jetzt zu einem gewissen Teil mit verantwortlich, dass daraus kein Katzenklo, sondern eine Sandburg mit Uzis und Blackjack entsteht.\n\nHoffe ihr habts gelesen. Wenn ja, danke, wenn nicht... Ja dann halt nicht, was kann ich da schon tun.\n\nGreets und GL in eurem n&auml;chsten game,\nJoBilly","replies":[{"poster":"OrangeBubble","date":"2015-11-17T05:06:48.870+0000","up_votes":1,"down_votes":0,"body":"Quellen zu den Buff-Ankündigungen??","replies":[{"poster":"JoBilly","date":"2015-11-17T05:11:44.579+0000","up_votes":1,"down_votes":0,"body":"http://www.surrenderat20.net/p/current-pbe-balance-changes.html?m=1\n&\nhttp://leagueoflegends.wikia.com/wiki/VPBE\n\nDss mit warlord Bloodlust war win fehler meinerseits. Es wird natürlich generft.","replies":[]}]},{"poster":"eXtremeF1ght","date":"2015-11-16T19:42:11.206+0000","up_votes":1,"down_votes":0,"body":"ich hoffe soraka wird generft haha nicht dass sie jetzt mega op ist\naber geht aufn sack","replies":[{"poster":"JoBilly","date":"2015-11-16T19:57:43.133+0000","up_votes":1,"down_votes":0,"body":"Aber ist schon krass. Die hat vielleicht schon seit 20 Patches keinen sinifikanten Buff oder Nerf erfahren. Ich habe erst vor kurzem erfahren dass sie ein regulärer Ban im höheren Elobereich oder NA ist.","replies":[{"poster":"Sihari","date":"2015-11-16T21:08:14.046+0000","up_votes":1,"down_votes":0,"body":"mhm... so schlimm finde ich Soraka eigentlich gar nicht :3 Da gibt es weitaus nervigere Supporter xD","replies":[{"poster":"Dula Peep","date":"2015-11-16T21:51:22.439+0000","up_votes":1,"down_votes":0,"body":"Kommt drauf an :D Solang man Soraka im Fight zuerst rausnimmt ist es ganz ok , auf der Lane ist sie echt nervig aber dagegen kann man auch was tun","replies":[]}]}]}]}]}