{"poster":"koshkyra","date":"2018-06-20T21:14:08.295+0000","title":"PSA: ATTACK THE NEXUS","subforum":"Gameplay","up_votes":24,"down_votes":2,"body":"Just lost a completely winnable game bc my team didnt attack the nexus and i was the only one. Let me tell you a brief story:\r\n\r\nAfter a long game of neither team ever really having an advantage, our team won a teamfight and left 4 people dead in exchange for only 1 on our side. I, the adc mf, was taking down turrets with my team while the enemy tank shyvana was distracting us. We get to the nexus, aaand im the only one attacking it, while the other 3 members of my team are trying to kill the tank shyvana. \r\n\r\n10 seconds later, ive gotten the nexus to like 40% hp while all of my teammates are STILL trying to chase the tank shyvana down, when all of the enemies respawn and charge us down, killing us all and then ending the game (we lost.)\r\n\r\nSo please, ladies and gentlemen. Dont put yourself in my story, losing a game for no reason, and attack the nexus. It is the only thing you have to do to win the game.","replies":[{"poster":"EkyonKun","date":"2018-06-20T23:11:53.523+0000","up_votes":10,"down_votes":1,"body":"https://www.youtube.com/watch?v=y34JvG5gY_U\n\nBeen a while since I got to use this.","replies":[{"poster":"Warlord Rhinark","date":"2018-06-21T10:16:25.406+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=EkyonKun,realm=NA,application-id=3ErqAdtq,discussion-id=KAE38rmE,comment-id=0001,timestamp=2018-06-20T23:11:53.523+0000)\n>\n> https://www.youtube.com/watch?v=y34JvG5gY_U\n> \n> Been a while since I got to use this.\n\nAh, a fellow member of the Brickade.","replies":[]}]},{"poster":"Woodakoodashooda","date":"2018-06-21T00:53:28.441+0000","up_votes":9,"down_votes":1,"body":"Lol, there have been times I've been reported for killing the nexus, denying an ally their pentakill.\n\nAnd some of my allies are all, 'wtf dude!'\n\nI don't care about your or my KDA. I only care about winning.","replies":[{"poster":"Snowman Arc","date":"2018-06-21T09:02:19.166+0000","up_votes":4,"down_votes":2,"body":"Funny thing, the past 4 months, the only thing I really care about is my KDA. I know that winning and losing is a coinflip and regardless of what I do, I don't seem to have much of an impact, so I might as well have good KDAs to show for someting.","replies":[]},{"poster":"koshkyra","date":"2018-06-21T02:14:16.708+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Chocolate Frost,realm=NA,application-id=3ErqAdtq,discussion-id=KAE38rmE,comment-id=0002,timestamp=2018-06-21T00:53:28.441+0000)\n>\n> Lol, there have been times I&#x27;ve been reported for killing the nexus, denying an ally their pentakill.\n> \n> And some of my allies are all, &#x27;wtf dude!&#x27;\n> \n> I don&#x27;t care about your or my KDA. I only care about winning.\n\n^^^","replies":[]}]},{"poster":"z63XnLCMwX","date":"2018-06-20T22:48:55.564+0000","up_votes":6,"down_votes":1,"body":"I'm impressed an ADC wasn't able to take down a nexus in ten seconds.","replies":[{"poster":"Z3Sleeper","date":"2018-06-21T01:28:13.985+0000","up_votes":2,"down_votes":1,"body":"ADC in 2k18.\n######not that anyone cares","replies":[]}]},{"poster":"Skins Project","date":"2018-06-21T18:12:32.162+0000","up_votes":2,"down_votes":0,"body":"I played a game where the other team was way ahead of us, but we had a few lucky teamfights and thus were at their nexus (Also their Leona went AFK)\n\nSo the other team didn't have any real DPS but they try to baron with like a inhib and nexus up in midlane. \n\nMy team chooses to go for the baron fight instead of the Inhib when I was basically screaming to group and then end. \n\nTheir ego got in front of the facts. Yes we got lucky shit earlier, but we are 5-8k gold behind. They CANNOT kill baron fast, they don't have a DPS, THUS we can end in time or at the very least force them off baron. \n\nBut no, they ran into baron, died then we eventually lost the game as the Leona came back & they abused their gold lead.","replies":[]},{"poster":"SammyDayspring","date":"2018-06-21T16:29:25.779+0000","up_votes":2,"down_votes":0,"body":"This type of thing happens to me all the time. Let's pad the KDA instead of winning the game.","replies":[]},{"poster":"big boi edri","date":"2018-06-21T15:08:01.897+0000","up_votes":2,"down_votes":0,"body":"I don't know whats more tilting, losing because your team chased instead of killing the Nexus; or losing because your team was spamming mastery and running around instead of killing the Nexus. However rare, I've seen both happen, lol.","replies":[]},{"poster":"Kirn","date":"2018-06-21T21:42:49.278+0000","up_votes":1,"down_votes":1,"body":"\"I nEED to GETmy KDa up rEEeeeeEEeEEeEe\"","replies":[]},{"poster":"PowerSlave993","date":"2018-06-21T20:39:16.481+0000","up_votes":1,"down_votes":3,"body":"I had a game where enemy team tried to take our Nexus down and Irelia respawned and killed 2 of them left. So Nexus was about 10% health. OK we continue.\n\nThen next time, they again come and there were just 2 of us defending. EVERYBODY ATTACKED OUR NEXUS BUT ONLY THEIR LULU WAS HAVING A BREAKFAST! she didn't and nexus had 1% health left. And then report lulu afk, hope you get this cancer lulu in your team,gg fcuk this game and we won.\n\nYeah Lulu mains...","replies":[]},{"poster":"Battalion","date":"2018-06-21T07:47:22.101+0000","up_votes":1,"down_votes":3,"body":">PSA: ATTACK THE NEXUS\n\nNo.","replies":[]},{"poster":"Colton147","date":"2018-06-21T01:13:48.122+0000","up_votes":1,"down_votes":5,"body":"#StopNexusAbuse2k18","replies":[]}]}