{"poster":"HaraldWurstWampê","date":"2019-04-02T18:01:25.556+0000","title":"April April oder ist das Wirklich so ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Hallo und zwar  bekomme ich seit  2 Tagen nur noch Anfänger  also Neue Spieler in mein Team und die Gegner nur  100-200+ Spieler selbst wenn der Gegner mal 10+ Spieler hat sind es zu 100% immer Smurfs  ist das normal und ich habe jetzt 10 Games  hintereinander Verloren das ist nervt extrem die Leute sind Völlig lernresistent ich bin auch nicht perfekt aber ich habe Augen im Kopf .","replies":[{"poster":"Angel Ayume","date":"2019-04-02T23:09:12.512+0000","up_votes":2,"down_votes":0,"body":"Wer sagt denn, dass Spieler mit wenig Level Anfänger sind? Und wer sagt, dass jemand mit hohem Level besser spielen kann? \nViele Level heißt nur, dass jemand viel gespielt hat, seit dem es das Level over 30 gibt, mehr nicht. Ich hab viele Leute die erst Level 40 oder so sind, weil sie seit dem nur selten gespielt haben aber teilweise schon seit Season 3 oder so dabei sind..\nUnd selbst wenn er unter Level 30 ist, weißt du immer noch nicht, ob es vllt nen Smurf ist.\n\nDas ist ganz sicher nicht der Grund, weswegen du 10 Games verlierst.","replies":[{"poster":"HaraldWurstWampê","date":"2019-04-19T13:27:11.867+0000","up_votes":1,"down_votes":0,"body":"Natürlich ist das der Grund was denn sonst wenn man nur Müll als Mitspieler bekommt wie soll man dann Je aufsteigen mehr als 20 /0 kann ich nicht machen wenn die Leute so Hirnlos sind und das meistens in meinem Team und der gegner vollgestopft ist mit  smurfs oder 200+ Spielern sry aber  oder der gegner bekommt ne 3 mill  MF .. jo alles klar .. und ich nen 0 Punkte Zed  danke ...","replies":[{"poster":"Angel Ayume","date":"2019-04-19T15:55:59.476+0000","up_votes":1,"down_votes":0,"body":"3 Mio Punkte auf MF sagt nur aus, dass er diesen Champion sehr viel spielt. Aber noch lange nicht, dass er den Champion auch gut beherrscht.\n\nDer Yasuo mit den meisten Mastery Points ist hardstuck in Bronze.. das war jedenfalls mein Stand vor 2 Jahren. Du siehst, Mastery Points sagen gar nichts über das können aus.\n\nUnd wenn du 20/0 stehst und das Spiel nicht zu euren Gunsten drehen kannst, dann machst du was falsch. Kills sind nicht alles. Das Spiel gewinnt der, der den Nexus zerstört und nicht wer die meisten Kills hat. \n\nUnd du kannst absolut nicht behaupten, dass nur du diese Spieler von denen du behauptest sie wären Anfänger in dein Team bekommst. \n\nAch ja und wenn du natürlich nur auf die Fehler anderer achtest und nie auf deine Fehler, wirst du nicht aufsteigen. Weißt du, wenn du mit besseren Spielern zusammen spielen willst, dann musst du erstmal beweisen, dass du dazu berechtigt bist indem du aufsteigst. Das wird aber nicht passieren wenn du nie auf deine Fehler achtest und dran arbeitest. Oder glaubst du etwa, du seist fehlerfrei?","replies":[]}]}]},{"poster":"Setagawa","date":"2019-04-02T18:28:23.266+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"HaraldWurstWampê","date":"2019-04-02T18:40:07.194+0000","up_votes":1,"down_votes":1,"body":"Ja aber ich meine warum ist das Gegner Team 300 lvl im unterschied ?  was soll denn das für ein ausgleich sein ?","replies":[{"poster":"eingew","date":"2019-04-03T05:45:41.906+0000","up_votes":1,"down_votes":0,"body":"Deine Matchhistory sagt was völlig anderes.\n\nAbgesehen davon sind Normalgames immer etwas weniger ausbalanciert als Rankeds, weil die meisten Spieler sich weniger Mühe geben und es eher tages- oder gar spielabhängig ist, wie gut ihre Leistung ist. Wenn du möglichst ausgeglichene Spiele willst empfiehlt es sich, in die Rangliste zu gehen.","replies":[]}]}]}]}