{"poster":"Serkhet","date":"2016-03-14T07:55:22.742+0000","title":"Support/ADC sucht ADC/Support für gemeinsame Botlane :)","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hey,\r\n\r\nIch bin zerofake, 19 Jahre alt und derzeit Silver 2 in Promo zu 1. \r\nHaupts&auml;chlich suche ich einen entspannten Mitspieler, der mit mir den Weg zu Gold bestreiten will und bereit ist mit mir zu lernen und sich zu verbessern.\r\nAn sich spiele ich gerne alles au&szlig;er Toplane, mein &quot;Zuhause&quot; ist aber definitiv die Botlane ^^\r\nNat&uuml;rlich k&ouml;nnen sich auch Leute melden die andere Rollen bevorzugen, ich spiele immer gerne mit netten Menschen!\r\nTeamspeak + Server ist vorhanden und wird Skype gegen&uuml;ber bevorzugt. Was nicht hei&szlig;t, dass Skype ein absolutes No-Go ist. \r\nAu&szlig;erdem ist Curse installiert und einsatzbereit - falls jemand das tats&auml;chlich benutzt x)\r\n\r\nIch freue mich auf Adds ingame unter zerofake - oder hinterlasst einfach eine Antwort auf diesen Beitrag.\r\n\r\nGr&uuml;&szlig;e!","replies":[{"poster":"qWinniehPooh","date":"2016-03-14T14:19:51.697+0000","up_votes":1,"down_votes":0,"body":"Hej,\nhab dich mal geaddet:)\nWar vor 3 Tagen oder so selbst noch S3 aber bin dann auf ner losing streak gelandet ..xD\nGrundsätzlich spiele ich ADC/Mid/Supp ~zu 80% aber Supp Main da nmd die Rolle übernehmen will.\nWenn du möchtest kannst du dir ja meine Stats mal ansehen und vllt. wird das ja was:)\nIch würd mich freuen, nen Spielpartner zu haben^^ (IGN: Qzeey)","replies":[{"poster":"TSM Fabian","date":"2016-03-14T14:29:27.358+0000","up_votes":1,"down_votes":0,"body":"wenn du mit ihm nicht zufrieden bist kannst du ja mal mit mir spielen suche ein supp bin adc main =) nicht böse für ihn gemeint aber vieleicht ist er ein def adc und du ein offens. supp ","replies":[{"poster":"qWinniehPooh","date":"2016-03-14T14:45:50.936+0000","up_votes":1,"down_votes":0,"body":"Ich freue mich über jeden neuen Freund:D\nGerne, also grundsätzlich hab ich so ziemlich fast jeden Support mehr oder weniger gemastert. \nAdde mich doch ingame, dann können wir ja mal schauen ob wir gut synchronisiert sind:)","replies":[]}]}]},{"poster":"IllIlIllIllI","date":"2016-03-14T10:16:55.452+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal ingame geaddet,\n\nGruß\nBraintroniX","replies":[]},{"poster":"FetteKatze","date":"2016-03-14T09:59:16.148+0000","up_votes":1,"down_votes":0,"body":"Hey , \n\nich hätte durchaus Bock auf ein paar Duos .\nDer einzige Nachteil ist, dass mein Account noch nicht lvl 30 ist. Mein  Main Account  (Gold IV) wurde vor einiger Zeit gehackt und bisher habe ich ihn noch nicht wieder, wird wahrscheinlich auch nichts mehr :P \nAllerdings habe ich Extra XP Boosts aktiviert und EP Boosts ebenfalls , damit ich auf 30 direkt mit ranked starten kann ( runen usw).\nIch habe in zwei Tagen durch den Boost schon lvl 21 erreicht und gehe davon aus das ich diese WOche die 30 definitiv schaffe.\n\nVielleicht noch kurz was zu mir persönlich, ich bin 34 , arbeite in 3 Schichten bei VW und bin eigentlich ein recht umgänglicher Zeitgenosse :)\n\nFalls Interesse besteht können wir ja gerne ein paar randoms zusammen machen.\n\nDu kannst mich gerne  adden :)\n\nLiebe grüße\n\n\nDennis \n\nP.S: Ich schicke Dir ingame einfach schon mal eine Einladung :P","replies":[]},{"poster":"Mipha","date":"2016-03-14T07:58:06.149+0000","up_votes":1,"down_votes":0,"body":"Hallöchen,\n\nwenn du möchtest kannst du dir ja gerne Mal unsere Forum Werbung anschauen:\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/AUFZTUQc-die-nova-gaming-community-sucht-dich\n\nWir sind eine familiäre ü18 Multigaming Community seit November 2015 und haben einen Altersdurchschnitt von ca. 25 Jahren. Bei uns findest du neben einem aktiven Forum außerdem sich gründende Teams, die noch engagierte Mitglieder suchen.\n\nFalls du Fragen hast kannst du dich gerne an mich wenden.\n\nLiebe Grüße\nBell Cránel","replies":[]}]}