{"poster":"Ankha","date":"2016-02-01T00:53:47.672+0000","title":"Dudas Ranked's","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Buenas, tengo una serie de preguntas:\r\n\r\nEs mejor Rankear ahora o mas adelante? (Exceso de trolls, por los que quedaron en B5, Jugadores con mejor habilidad, que de igual manera quedaron en bronce, etc)\r\n\r\nTengo entendido que desciendes un par de ligas de la que estabas originalmente, esto es as&iacute; siempre? (Todos los a&ntilde;os lo mismo?)\r\nPor EJ: Si juego ahora se que quedare en B5,  pero que pasa si juego rankeds dentro de unos meses? quedare en B5 igual o quedare en otra liga? o no tiene nada que ver?\r\n\r\nGracias por leer","replies":[{"poster":"Jota312","date":"2016-02-01T01:11:14.839+0000","up_votes":1,"down_votes":0,"body":"Cuando es mejor rankear ? claramente despues de vacaciones , bajan las raticas .Pero puedes rankear igual de echo si juegas bastante es mejor rankear ahora e ir subiendo (ya que talves pierdas 1 o 2 mas  ,pero luego con una semana lo subes).\n\n____________________________________\n\nSe suele bajar ? Si , en promedio todos bajan .\n( de echo los diamantes master y challengers solo pueden bajar )\nEn mid elo [platino diamante5] se puede subir pero es muy dificil .\nEn low elo [bronce plata oro] se puede subir es \"facil\" pero con los jugadores nobatos se suele perder.\n\nAlfinal estos reset son para bajar a toda la gente y asi se genera esta pelear por subir nuevamente al puesto mas alto.\n\n________________________________\n\nNo importa cuando las jueges , se te dan los mismos puntos , solo que \"el dicho popular\" es que a inicios de season juegan los peores jugadores y es mas dificil ganar la primeras 10.\n\nYa para terminar , yo era platino 4 y juge las 10 , Gane 2 Perdi 8 (no por mi culpa , pero da igual, yo solo queria ver cuanto bajaba xd) , me dejaron oro III y ahora ya estoy oro I en promo.\n\nTe recomiendo : Si juegas poco (1 ves a la semana aprox) rankea mas tarde , si juegas arto /rankeas arto (todos los dias , o 5 dias a la semana) rankea ahora y con el tiempo subiras si lo mereces.","replies":[]},{"poster":"EliaahTheTrolo","date":"2016-02-01T01:09:07.324+0000","up_votes":1,"down_votes":0,"body":"1.- Nosé Viejo,Esto es LAS,estamos infectado de lo peor.{{item:3151}} .\n2.-Nosé,yo mi primera promo la hice el año pasado,y bajé de  PlataIII a BronceIII.Y ésta terminé en BronceV.\nY si juegas en unas más creo que habría un porcentaje decimal (Osea,muy pequeño)De que hayan cambios.\nNos vemos!{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Czdr","date":"2016-02-01T01:06:43.626+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo\nDependera mas de tu skill como player, que de un niño caprichoso, el subir mas rapido o estancarte en una liga","replies":[]}]}