{"poster":"Kysart Sarglin","date":"2016-05-19T15:40:25.061+0000","title":"Modificatore di skin","subforum":"Aiuto e supporto","up_votes":3,"down_votes":2,"body":"Salve, ho letto e visto video sui cosiddetti modificatori di skin, solo estetici (non ai fini del gioco) e solo per chi li utilizza, ma ancora non ho capito, sono vietati oppure no?","replies":[{"poster":"Yamero Senpai","date":"2016-05-19T21:31:38.419+0000","up_votes":2,"down_votes":1,"body":"Se intendi le custom skins, no, non sono vietate ma devi usarle a tuo rischio e pericolo perchè posso avere alcune particelle o animazioni mancanti e ti mandano in crash il gioco e nella maggior parte dei casi ti obbliga il repair.Dovrei avere la risposta del supporto riguardo le custom skins, se la trovo la posto per maggiori chiarimenti\n\nQ: so the next one is: Are custom skins bannable? like using the old 3vs3 map, or \"batman\" nasus skin per say, because i've seen it on streams and i've been wondering if i should have reported it or just let it be.\n\nA: I also understand that you would like to know if custom skins are allowed. While we don’t strictly condemn the use of third-party modifications, these programs can be dangerous and worthy of suspension where they violate our Terms of Use. I can’t tell you whether a particular third-party modification is against our Terms of Use or not, but you can follow these general guidelines:\n\nWe identify and suspend accounts for using third-party programs intended to offer a competitive advantage by affecting gameplay in any way\nWe cannot control what a third-party developer makes or changes, so a program that was once acceptable may have versions which violate the Terms of Use\nSome third-party developers may not have your best interests in mind, so please be aware that these types of files can contain keyloggers, viruses, and malware.\nThird-party modifications may affect your game in unexpected ways, so if you’re having technical issues, try uninstalling these programs before doing anything else.\nIn general, if you find a third-party modification suspicious, it’s best to avoid using it. I hope this clears things up a bit, but if you have any other questions, please let me know.\n\nSpine Splitter\n\nOra vediamo cosa sono le custom skins, come si possa intendere dal nome sono skin personalizzate o modificate, dove usano texture diverse a mo' di recolour, solo poche cambiano l'aspetto del champion eo delle sue abilitá,ad esempio io prima usava batman rengar dove la E era lo batrang(?) e con la ulti mi faceva \"nanananananana\"ma ora uso principalmente gentleman rengar o masterchef rengar. Non hanno bisogno di nessun programma da terze parti, puoi farlo a mano, o utilizzare l'installer wooxy e quindi giá il Terms of use è impotente al riguardo, l'unico prpblema che ti possono fare e che cambi i file del gioco ma non credo che ti bannino perché mon danno nessun aiuto competitivo, ma comunque meglio non giocarle in ranked","replies":[]},{"poster":"Kysart Sarglin","date":"2016-05-22T00:29:06.209+0000","up_votes":1,"down_votes":0,"body":"Ah capito, quindi mi state dicendo che se uso uno di questi programmi è a mio rischio e pericolo qualora modificasse altro oltre all'aspetto estetico.\nMa questa cosa delle skin vale solo per le custom skin o anche per le riot skin? Tipo posso usare la skin di batman rengar ma non posso usare la skin di project yasuo tanto per dirne una?","replies":[{"poster":"Floppyz","date":"2016-06-10T07:13:40.382+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kysart Sarglin,realm=EUW,application-id=98NGV4Al,discussion-id=EpoRf00X,comment-id=0004,timestamp=2016-05-22T00:29:06.209+0000)\n>\n> Ah capito, quindi mi state dicendo che se uso uno di questi programmi è a mio rischio e pericolo qualora modificasse altro oltre all&#x27;aspetto estetico.\n\nSì, ma pure se modificano solo l'aspetto grafico.\n\n> Ma questa cosa delle skin vale solo per le custom skin o anche per le riot skin? Tipo posso usare la skin di batman rengar ma non posso usare la skin di project yasuo tanto per dirne una?\n\nVale per tutte le modifiche al client, quindi entrambi i tipi di skin.\n\n> [{quoted}](name=Kysart Sarglin,realm=EUW,application-id=98NGV4Al,discussion-id=EpoRf00X,comment-id=0005,timestamp=2016-06-10T00:17:23.463+0000)\n>\n> Quindi? Le skin custom (non esistenti in game) possono essere usate mentre quelle riot no?\n\nNo, **qualunque** modifica fai la fai a tuo rischio e pericolo.","replies":[]}]},{"poster":"Kysart Sarglin","date":"2016-06-10T00:17:23.463+0000","up_votes":1,"down_votes":0,"body":"Quindi? Le skin custom (non esistenti in game) possono essere usate mentre quelle riot no?","replies":[]},{"poster":"Chroniicles","date":"2016-05-20T06:05:59.671+0000","up_votes":1,"down_votes":1,"body":"È tutto esattamente come detto da yamero senpai.","replies":[]},{"poster":"Kysart Sarglin","date":"2016-05-20T02:48:55.318+0000","up_votes":1,"down_votes":1,"body":"Ok, attendo conferme da uno staffer.","replies":[]},{"poster":"DuckQuack0","date":"2016-05-19T15:45:14.302+0000","up_votes":1,"down_votes":2,"body":"Si, sono vietatissimi, tutti questi ban che girano sono dovuti a programmi come MKLoL","replies":[]}]}