{"poster":"Kinch","date":"2017-11-21T21:54:19.989+0000","title":"Soy el unico que tiene este problema? [IMAGEN]","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Alguien mas esta en esta situaci&oacute;n??? \r\n[(ven la imagen por favor)](https://ibb.co/nPAgq6)","replies":[{"poster":"Painstrike","date":"2017-11-21T21:56:59.481+0000","up_votes":1,"down_votes":0,"body":"Si!\n\nComo dije en otro post es porque la cantidad de usuarios estan saturando los servidores probablemente :) Se va a solucionar dentro de poco, es hora pico en estos momentos para Lol, asi que tranqui que se soluciona de un momento al otro","replies":[{"poster":"2801","date":"2017-11-21T21:58:24.216+0000","up_votes":1,"down_votes":0,"body":"''Se soluciona de un momento a otro'' hace una hora esta este problema, y momento a otro no es lo que va a suceder... básicamente es un error y no es por la saturación.","replies":[{"poster":"Kinch","date":"2017-11-21T22:07:23.299+0000","up_votes":1,"down_votes":0,"body":"Vos sos el de los streams en Twich?","replies":[{"poster":"Painstrike","date":"2017-11-21T22:16:56.165+0000","up_votes":1,"down_votes":0,"body":"Negativo, no stremeo en Twitch. Why?","replies":[]}]},{"poster":"Painstrike","date":"2017-11-21T22:00:08.744+0000","up_votes":1,"down_votes":0,"body":"En algún momento del día se va a solucionar, esto significa:\n Momento uno= No funciona (2.3525 segundos despues) Momento dos= Funciona\n\nFuera de chiste, es verdad que a algunos le andan mal y a otros bien, yo recien juge una partida y hay gente como vos que todavia no entran al cliente. Es tener paciencia :) Ya se va a solucionar","replies":[]}]},{"poster":"Kinch","date":"2017-11-21T22:03:20.529+0000","up_votes":1,"down_votes":0,"body":"gracias por tu amable respuesta, ojala se desconectaran asi puedo descargarlo felizmente y trollear.., digo digo, jugar esas ranked.\nQue ansiedad, igualmente cerre y volvi a abrir y ahora me descarga mas rápido. Gracias ;)","replies":[{"poster":"Painstrike","date":"2017-11-21T22:06:35.301+0000","up_votes":1,"down_votes":0,"body":"Genial!\n\nRecien juge una partida con la Nueva Zoe... Si bien nuestra Zoe feedeo feo a un Nasus... De una skill le sacaba mas de 1/4 de vida al Nasus... Da miedo esta nueva campeona, para serte sincero se veo algo aburrida desde mi punto de vista pero talvez me equivoco, la mecanica de agarrar skills e items del piso todavia me suena raro","replies":[{"poster":"Kinch","date":"2017-11-21T22:11:11.606+0000","up_votes":1,"down_votes":0,"body":"Y si, me acuerdo cuando salio jhin yo siendo un total manco de adc gane cantidad de partidas seguidas donde quedaba re fedeado, hay q esperar q la bajen a tierra y banearla de las ranked.","replies":[]}]}]}]}]}