{"poster":"SirGGtheWanderer","date":"2016-08-21T09:11:44.845+0000","title":"Counterjungling - Come lasciare i campi?","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Solitamente quando faccio del counterjungling cerco sempre di pulire completamente i campi. Tuttavia vedo molta gente che lascia sempre un 1 mostro. Secondo voi qual &egrave; la tecnica migliore?","replies":[{"poster":"zYaichi","date":"2016-08-21T09:28:22.386+0000","up_votes":3,"down_votes":1,"body":"Decisamente è la scelta migliore in ogni caso,ma contro un jungler aggressivo come lee sin,shaco,elise anche gragas per esempio che passeranno l'intero game a gankare dal lv.3 non gli importeranno di uno due campi indietro e devi lasciargli un mostro,invece se vuoi far un bel danno a champ che preferiscono farmare devi pulire tutto come master yi e amumu  per fare due esempi,poi vedi tu se ti servono quei 10 gold in più e l'exp per chiudere un core item o livellare prendili\nInvece blue e red io preferisco prendere anche i piccoli per rubare ancora dopo o lasciare una pink ward nella loro jungle e lasciargli un minion in questo modo puoi tentare di rubarlo appena respawneranno di nuovo.\nIl blue spesso viene dato al mid quindi sarebbe più worth lasciargli un minion ma prima dare il tuo blue al tuo mid,e al respawn del blue 3min dopo il tuo mid avrà il blue prima del mid avversario\nRipeto in generale è sempre la scelta migliore invadere e lasciare un mostro piccolo.\n","replies":[{"poster":"TSB Sharp","date":"2016-08-21T09:55:15.886+0000","up_votes":5,"down_votes":0,"body":"Coi nuovi timer globali ora conviene lasciarne uno piccolo ai buff.\nPer quanto riguarda gli altri campi, se hai tempo di farne solo uno lasciane uno piccolo, ma se puoi fare entrambi i campi piccoli sullo stesso lato, conviene clearare tutto su uno, in modo che gli rovini i timer di spawn (spawneranno in tempi nettamente diversi e non potrà fare un full clear).","replies":[]}]},{"poster":"AnDGames","date":"2016-08-22T07:45:04.194+0000","up_votes":2,"down_votes":0,"body":"lupi e pappagalli lasciane 1, gli incasini i tempi di respawn\n\nblu e rosso dipende da te.\nse glieli vuoi fregare sempre pulisci il campo, in modo che te lo ritrovi coi tempi giusti al giro successivo.\nse glielo vuoi fregare occasionalmente, lasciane uno.","replies":[]},{"poster":"wellyT93","date":"2016-08-21T10:04:53.804+0000","up_votes":3,"down_votes":1,"body":"Se vai ad invadere da subito pulisci tutto, dato che l'exp in early è fondamentale, dal lv 6 in poi lascia sempre 1 cs, così ritardi lo spawn di quel campo negando farm al jgl avversario (il cd di respawn del campo inizierà quando il jgl nemico pulirà quel cs che hai lasciato).","replies":[]},{"poster":"SirGGtheWanderer","date":"2016-08-21T10:19:15.735+0000","up_votes":1,"down_votes":0,"body":"Grazie a tutti per i consigli, ai livelli medio alti secondo me sono le scelte migliori.\n\nPerò ho notato che al mio livello (unranked, c.a. bronzo 4) se lascio un mostro dopo 10 min trovo ancora quel mostro! In questo caso non mi conviene fare una pulizia totale per aver disponibile anche il loro buff?","replies":[{"poster":"Ziovi","date":"2016-08-21T11:16:26.934+0000","up_votes":1,"down_votes":0,"body":"se ritrovi ancora solo quel mostro significa che il jungler nemico non ha mai ripulito quel campo, il che è un po' strano ma probabilmente significa che non gli importa di farlo, quindi tanto vale che tu lo completi.\nNel caso dei buff, sarebbe molto strano se il jungler nemico si rifiutasse di ripulire il campo, perché non si capisce come mai dovrebbe disinteressarsi del buff.\n\nP.s.: a cause di un errore di battitura hai scritto \"ho notato\" senza \"h\". Capita a tutti, è normale... ma potresti correggerlo? mi fa male il cuore a vederlo (anche se, come ho detto, capisco bene che è solo un errore di battitura) :p","replies":[{"poster":"SirGGtheWanderer","date":"2016-08-21T12:48:29.219+0000","up_votes":1,"down_votes":0,"body":"Per questo di solito li completo (buff inclusi). A volte capita anche che mi vada bene e che non se ne accorga.\n\nPS: Corretto. Grazie per avermelo fatto notare. ^_^","replies":[]}]}]}]}