{"poster":"Soju Puppy","date":"2014-12-31T11:54:14.261+0000","title":"Dominus eSports Recruitment - Diamond +","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Greetings,\r\n\r\nFor a long time I've been wanting to start a team and would like to grant the opportunity for players to experience the natures of playing as a team. As much as I would love to see players grow as a team, I would love to see a team grow as a family. Although I won't be part of the team roster, I will be managing the team and taking notes on weaknesses, strengths etc. So if you're interested in joining this team, I will be providing a template for you to insert your details.\r\n\r\n(sorry for putting these in caps, easier to read that way)\r\nIGN:\r\nAGE:\r\nMAIN ROLE:\r\nCHAMP POOL:\r\nSKYPE:\r\nPREFERRED PLAY TIME:\r\nREASON FOR APPLYING FOR TEAM:\r\n\r\nAnother thing I would like to add. Don't bother if you're just going to leave after joining, we all have lives and time is worth too much to be wasted.","replies":[{"poster":"Tseu Tsey","date":"2015-01-14T13:08:20.667+0000","up_votes":1,"down_votes":0,"body":"Can't get out of Bronze :/ would love to join a SA team though...","replies":[]},{"poster":"Daemoon","date":"2015-01-04T02:13:50.781+0000","up_votes":1,"down_votes":0,"body":"IGN: Daemon\nAGE: 21\nMAIN ROLE: Mid>Support\nCHAMP POOL: Vast. Most Mids and over half the supports.\nSKYPE: Yes I use, I won't post it though ;)\nPREFERRED PLAY TIME: Almost anytime, I'm NZ based but pretty flexible.\nREASON FOR APPLYING FOR TEAM: Pretty generic. Love the game, but the solo que grind gets old. 5's is tons of fun and I'm competitive so teams that can't stick together/have less emphasis on winning disappoint me.","replies":[]},{"poster":"Saucygibbon","date":"2015-01-03T01:48:07.601+0000","up_votes":1,"down_votes":0,"body":"IGN: Saucygibbon\nAGE: 23\nMAIN ROLE: Top\nCHAMP POOL: Irelia, renek, nasus to name a few\nSKYPE: Yes\nPREFERRED PLAY TIME: Any time\nREASON FOR APPLYING FOR TEAM: Enjoy playing 5s","replies":[]},{"poster":"Gizzel AniviaGod","date":"2015-01-02T12:28:38.715+0000","up_votes":1,"down_votes":0,"body":"IGN: ALL Gizzel LoL\nAGE: 26\nMAIN ROLE: Mid\nCHAMP POOL: Alot\nSKYPE: Yes\nPREFERRED PLAY TIME: Any time\nREASON FOR APPLYING FOR TEAM: Solo q doesnt excite me. \n\nI'm D4 after a break, i have another account almost diamond aswell, ive played in pretty much every online/lan tournament.","replies":[]},{"poster":"Prombear","date":"2015-01-02T00:46:55.617+0000","up_votes":1,"down_votes":0,"body":"IGN: Prombear (Currently P1 after decay, Peaked d3)\nAGE: 20\nMAIN ROLE: ADC\nCHAMP POOL: In order of ability: Vayne, Caitlyn/Lucian, Tristana, Graves, Corki\nSKYPE: Benz-jammin\nPREFERRED PLAY TIME: Any time, I am based in NZ\nREASON FOR APPLYING FOR TEAM: Predominantly looking to join a team so I can add some more structure to my game play. Grinding soloq feels fairly meaningless at the moment, it would be cool to find a bunch of hardworking players that are willing to commit as much time and effort to the game as I am.","replies":[]}]}