{"poster":"20320","date":"2019-12-07T17:32:04.203+0000","title":"Come si farmano bene i minion, dopo la laning phase?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve, non gioco da moltissimo e in questi tre mesi in cui ho giocato ho cambiato ruolo in continuazione. Ma finalmente ho trovato un ruolo che mi piace, cioè la mid. Per ora so usare solo {{champion:136}} . Credo di giocarlo abbastanza bene, ma il problema è che non riesco a fare neanche 200 cs a partita. Dopo la laning phase non so come muovermi, di solito il mio team fighta in continuazione e poi arriva o l'adc o il toplener a fregarmi i minion. Che posso fare? Aurelion non è molto veloce negli spostamenti (non posso usare la E, ha 1 minuto e passa di cooldown), quindi non so mai dove andare a farmare. Avete qualche consiglio per un piccolo novellino?","replies":[{"poster":"XPY99","date":"2019-12-07T17:48:08.105+0000","up_votes":2,"down_votes":0,"body":"L'ideale è arrivare a 100 minion intorno a 10/15 minuti, arrivato a quel punto i minion vanno gestiti a livello di ondate (guardati qualcosa sullo slow push)\nPer il resto vedendo il tuo storico hai degli ottimi score, se ti farmi i nemici puoi fregartene di finire a meno di 200 cs","replies":[{"poster":"20320","date":"2019-12-08T11:26:32.319+0000","up_votes":1,"down_votes":0,"body":"Si hai ragione, riesco quasi sempre a finire la build anche senza avere troppi CS. Il problema è che non riesco a fare S perché ho poco farm e sento che non sempre avrò  sempre molte kill da poter completare la build. Comunque grazie mille del consiglio","replies":[{"poster":"XPY99","date":"2019-12-08T21:41:29.447+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=20320,realm=EUW,application-id=MJVj50Jw,discussion-id=HOBbYIZ5,comment-id=00000000,timestamp=2019-12-08T11:26:32.319+0000)\n>\n> Si hai ragione, riesco quasi sempre a finire la build anche senza avere troppi CS. Il problema è che non riesco a fare S perché ho poco farm e sento che non sempre avrò  sempre molte kill da poter completare la build. Comunque grazie mille del consiglio\n\nIn genere la build la si finisce intorno a 40 minuti, con un guadagno di gold medio","replies":[]}]}]}]}