{"poster":"OLY dubble","date":"2015-09-13T13:03:42.013+0000","title":"League of Legends Tools?","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":2,"body":"Ich kenne schon ein paar &quot;League of Legends Tools&quot;, welche Ingame ziemlich hilfreich sind, wie z.B Curse Voice oder LoL Summoner Information, aber darf man die &uuml;berhaupt benutzen und welche dieser Programme kennt ihr noch?\r\nIch versuche einfach ein bisschen besser in League zu werden\r\n\r\nVielen Dank schonmal im Vorraus!  {{champion:150}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-13T16:29:02.614+0000","up_votes":1,"down_votes":0,"body":">Ich versuche einfach ein bisschen besser in League zu werden\n\nWie willst du das mit solchen Tools schaffen?\nDein Skill hängt doch nicht von der Kommunikation oder der Information solcher Seiten ab. Dass du weißt, dass dein Gegner in einer höhren Elo ist spornt dich entweder an oder demotiviert dich. Ein kurzweiliger Einfluss.\n\nAuf Langzeit betrachtet wird dir sowas nicht helfen.","replies":[{"poster":"Bemte","date":"2015-10-03T23:21:47.544+0000","up_votes":1,"down_votes":0,"body":"Es kann schon nützlich sein. Ein Blick auf die gegnerischen Masteries sagt einem, ob er eher aggressiv oder deffensiv spielt. Ein Blick auf die Runen sagt einem, ob man ihn poken sollte oder besser farmen (zB ob der Gegner Deff/MR in seinen Runen hat und wenn ja wie viel).\nNatürlich geht es auch ohne, aber das Wissen schadet nicht.\nWas allerdings nicht sehr sinnvoll ist, ist auf die Elo zu schauen. Es gibt in jeder Elo Leute die gut sind, Leute die schlecht sind und Leute die halt einfach mal einen neuen Champ ausprobieren.","replies":[]}]},{"poster":"Alustus","date":"2015-09-13T13:11:22.902+0000","up_votes":1,"down_votes":0,"body":"Kommt darauf an welche.\n\nCurse Voice hatte, oder hat noch immer verbotenes dabei. (ich weiß es nicht da ich es nicht verwende)\n\nautomatische gegnerjungle Timer usw. sind verboten.\nScripte und Makros auch.","replies":[{"poster":"ImtheNOSE","date":"2015-10-03T23:08:30.135+0000","up_votes":1,"down_votes":0,"body":"was sollen dir macros bringen? ich habe eines auf meiner Blackwidow dass wenn ich M1 drücke gl hf in den all chat schreibt. Und man kann jetzt auch kein Makro erstellen dass für einen farmt oder so es ist ja nur eine abfolge von Tasten und naja inteligent ist das ja nicht oder so...\n\nscripten oder die jungle timer sind natürlich einfach nur unfair und auf jeden Fall verboten!\n\nCurse ist ein kleines Fenster dass sich öffnet wenn du tab drückst in dem du ähnlich wie in TS nen servernamen oder so eingaben kannst. Wenn du mit einem Premade Skypst ist das ja auch nicht verboten. Man könnte genausogut mit dem Handy mit seinem Premade telefonieren. Was daran verboten werden soll oder ist verstehe ich nicht\nLG","replies":[{"poster":"Bemte","date":"2015-10-03T23:19:06.559+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImtheNOSE,realm=EUW,application-id=vatevpvi,discussion-id=usMwJqgP,comment-id=00000000,timestamp=2015-10-03T23:08:30.135+0000)\n>\n> was sollen dir macros bringen? ich habe eines auf meiner Blackwidow dass wenn ich M1 drücke gl hf in den all chat schreibt. Und man kann jetzt auch kein Makro erstellen dass für einen farmt oder so es ist ja nur eine abfolge von Tasten und naja inteligent ist das ja nicht oder so...\n\n\nNaja, doch, Makros können schon einiges ausmachen und sind deshalb verboten (hab ich selbst vor ein paar Tagen erfragt^^).\nDu kannst mit dem Druck einer Taste mehrere Tasten auf einmal hintereinander ausführen.\nDamit kannst du beispielsweise sowas wie einen Wardjump (Lee Sin oder Jax) innerhalb eines Sekundenbruchteils zielgenau ausführen.\nOder du kannst als Burstchamp deine gesamte Kombo aller Skills auf eine einzelne Taste legen - dann musst du nur mit der Maus über den Gegner, die eine Taste drücken und BAM, tot in 0,01 Sekunden. Am besten baust du auch noch Flash mit ein, damit du den Gegner absolut unvorbereitet triffst...\nNormalerweise müsstest du hier einen Skill abfeuern, dann den nächsten,... Zusammen mit ggf. Flash dauert das schon 1-2 Sekunden; da hat der Gegner noch den Hauch einer Chance, Zhonyas zu aktivieren oder wegzuflashen - wenn alles auf einmal kommt geht das nicht; daher: unfair, also verboten.\n\nReine Textmakros, die etwas nettes in den Chat schreiben, sind eine andere Sache, hier bin ich nicht ganz sicher bzw. wüsste nicht, warum die verboten sein sollten. Aber alles, was Skills/Items mit einem Active/Summoners/... hintereinander als Makro ausführt ist verboten - und kann wahrscheinlich auch vom System erkannt werden, dass du nicht QWER innerhalb von 0,01 Sekunden von Hand gedrückt hast. xD","replies":[]},{"poster":"Alustus","date":"2015-10-03T23:19:02.348+0000","up_votes":1,"down_votes":0,"body":"Ward Jumbs auf lee sind zum Beispiel mit Makros kein problem.\nOder lee wardjump flash ult q .\nman muss nur 1 taste klicken anstatt 2 oder mehr.\n\n> \n> Curse ist ein kleines Fenster dass sich öffnet wenn du tab drückst in dem du ähnlich wie in TS nen servernamen oder so eingaben kannst. Wenn du mit einem Premade Skypst ist das ja auch nicht verboten. \n\n\n\nFrüher gab es bei Curse Voice eben auch jungletimer usw.\n\nAuch wenn das jetzt nicht mehr so ist würde ich nicht darauf wetten, das es legal ist.\nCurse Voice liest ja daten vom clienten aus und kann daher trotzdem verboten sein auch wenn es keinen Vorteil bringt-","replies":[]}]}]},{"poster":"XExEcUtOrX04","date":"2015-09-13T14:06:53.584+0000","up_votes":1,"down_votes":0,"body":"Es ist alles verboten was dir einen Vorteil gegenüber Leuten gibt die dieses Etwas nicht benutzen.\n\nInwieweit Curse Voice erlaubt ist kann ich dir allerdings nicht sagen.","replies":[{"poster":"ImtheNOSE","date":"2015-10-03T23:02:55.358+0000","up_votes":1,"down_votes":0,"body":"das ist so wie TS nur mit einem kleinem fenster dass sich benn man tab drückt öffnet. Legit wie ich finde","replies":[]}]},{"poster":"Hamrio","date":"2015-09-13T13:12:11.417+0000","up_votes":1,"down_votes":0,"body":"curse voice und lolnexus etc sind erlaubt nur würde ich dir lol necxus lol skill etc nicht emphelen da es deine einstellung zum spiel ändert","replies":[]}]}