{"poster":"Paramatus","date":"2016-10-28T15:49:00.414+0000","title":"Suche Leute zum Spielen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heyho,\nIch suche Leute zum Normals spielen. (Duerfen sich gerne mehr als nur 4 Leute melden)\nMir ist es egal welche Elo ihr spielt es geht mir nur um den Spass am spielen.\nAuserdem ist es egal welche Lanes ihr spielen koennt bzw meint spielen zu koennen.\nDie einzigen Vorrausetzungen die ich hab  sind:\n\n- Angemessenes Verhalten d.h. nicht flamen/beleidigen\n- Discord account besitzen (ich persoenlich halte Discord fuer meinen zweck passender als TS3) und wer nicht weis was das ist: https://discordapp.com/\n- Mic haben\n\nWer interesse hat pn an : YoungesHebl\n\nPS: der letzte Buchstabe ist ein kleines L\nPPS: Das forum zerstoert meine umlaute\nPPPS: Geschlecht ist egal, aber wer irgendjemanden belaestigt fliegt leider raus...\nPPPPS: PS steht fuer Poststriptum: https://de.wikipedia.org/wiki/Postskriptum","replies":[{"poster":"Doomy McLovin","date":"2016-10-28T17:40:41.672+0000","up_votes":1,"down_votes":0,"body":"Hallo YoungestHeBl,\n\nmit den gleichen Leuten immer wieder spielen ist  förderlich für Spaß und Erfolg (in der Regel :-P)\nSchon einmal daran gedacht einer Community beizutreten?\n\nVielleicht sind wir ja was für dich :-)\nWir sind eine Ü18-Community, die außer Normals auch (Team-)Rankeds spielen.\nDa wir auf den Umgang miteinander achten, sind wir eine sehr harmonische Community,\ndie trotz ihrer Größe einen Zusammenhalt der Community zeigt.\n\nWir freuen uns auf Besuch und bei Fragen oder Interesse kann man mich gerne adden :)\n[★ Nerds Go Casual ★](https://nerdsgocasual.de/community)\n\nPS. ;-) nutzen nur TS.\n\nLiebe Grüße\nStephan (Ingame: Doomy McLovin)","replies":[{"poster":"Paramatus","date":"2016-10-28T18:37:15.051+0000","up_votes":1,"down_votes":0,"body":"Gib fuer mich nur ein problem: TS... ich finde da ist es immer so schwer \"neue leute zum spielen zu finden bzw man haengt nur mit den gleichen 5 rum und nicht mit den gleich z.B.10 . Das problem loest sich im grosen und ganzen ueber discord (kein fan mehr von ts3)","replies":[{"poster":"NGC Polyxena","date":"2016-10-29T08:03:49.364+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YoungestHeBl,realm=EUW,application-id=ElKI1ocy,discussion-id=0VBzgWMZ,comment-id=00000000,timestamp=2016-10-28T18:37:15.051+0000)\n>\n> Gib fuer mich nur ein problem: TS... ich finde da ist es immer so schwer &quot;neue leute zum spielen zu finden bzw man haengt nur mit den gleichen 5 rum und nicht mit den gleich z.B.10 . Das problem loest sich im grosen und ganzen ueber discord (kein fan mehr von ts3)\n\nIch kann deine Bedenken durchaus verstehen. Dennoch würde ich dir einfach Mal raten dir selbst ein Bild zu machen :) ! Discord ist für ordentliche Cläne / Communities eher nix, da es sich dort um öffentliche Server handelt, die man schlecht selbst sichern und verwalten kann da man schlichtweg nicht den Zugriff auf diese Administration hat wie etwa bei Teamspeak ;) .\n\nDurch die regelmäßigen Events, die wir veranstalten lernt man auch nochmal immer mehr verschiedene Spieler/innen kennen und im Allgemeinen haben wir bisher nur positive Resonanz erhalten. Selbst Overwatch- und LoL-Spieler tummeln sich gemeinsam in unseren Aufenthaltschannel.","replies":[{"poster":"Paramatus","date":"2016-10-30T11:50:47.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=P0lyxena,realm=EUW,application-id=ElKI1ocy,discussion-id=0VBzgWMZ,comment-id=000000000000,timestamp=2016-10-29T08:03:49.364+0000)\n>\n> Discord ist für ordentliche Cläne / Communities eher nix, da es sich dort um öffentliche Server handelt, die man schlecht selbst sichern und verwalten kann da man schlichtweg nicht den Zugriff auf diese Administration hat wie etwa bei Teamspeak ;) .\n\nDas stimmt so nicht ich klann dir versprechen:\n1. ohne Einladung ( die durch einen einfachen link versendet werden kann) kommst du nicht auf den channel\n2. Discord ist weit besser geschuetzt vor ddos angriffen als TS3\n3. Discord zieht wweniger Leistung (CPU & internet) gut fuer Leute mit shclechtem Internet\n4. Du kannst durch die allgemeinen Chats viel besser alle erriechen (Meine Erfahrung bei TS3 war, dass das Event oder andere Ankuendigungen irgendwo in irgenwelchen beschreibungen stand oder eine eigens angelegte Website erstellt wurde.\n5. Server kostet nichts\n6. Man verfuegt ueber alle noetigen admin rechte wenn man den Server erstellt\n\nNoch einen Punkt der nicht so interessent ist aber fuer mich noch bedeutung hat:\n\n7. Discord hat kein Windows 98 design wie TS3 sondern sieht ansprechend aus und ist sehr benutzerfreundlich\n\n\nMein Tipp deswegen: Erstell dir doch einmal nur aus spass einen eigenen Discord server (siehe 5.) und mach mal ein paar einstellungen.\n\nUnd ich will nur die Vorurteile aus dem Weg raeumen. Wenn du sagst TS3 gefaellt dir trotzdem besser weil: Warum auch immer. Soll mir das recht sein. Dann wuensche ich dir noch viel Spass in Lol und viel Erfolg mit deiner Community/Clan.\n\nPS: Ich kennen mehrerre Streamer id eDiscord fuer ihre Communities verwenden...","replies":[{"poster":"Ezcabur","date":"2016-10-30T16:53:05.172+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht um die Sicherung gegen User die zufällig auf den Server joinen, es geht um die Sicherung vor Datenklau oder Zugriff unbefugter auf den Physischen Server oder generelle Administrative arbeiten am Server und vllt. sogar Softwareübergreifende zusammenarbeit von Programmen wie Website und TS-Server.\n\nSchutz vor DDOS? Will jemand einen Server lahmlegen mit DDOS dann ist das egal ob TS oder Discord, auch große Server wie die von Blizzard gehen dann down.\n\nZieht weniger Leistung&CPU? CPU vllt. , aber man kann andere Sprachcodices auf TS verwenden um die Internetlast zu reduzieren.\n\nDas Chatsystem in TS ist dem von Discord wirklich unterlegen, aber der TS-Server ist eher als mittel der Sprachlichen Kommunikation gedacht und nicht als Hauptmedium für die Ankündigung von Events.\n\nServer Kosten sind kein Kritikpunkt. Wenn man mit dem Server ausreichend arbeitet sind die Kosten akzeptabel und die Vorteile eines Eigenen Servers sind enorm.\n\nNein du verfügst über alle nötigen Adminrechte um den Server zu verwalten, nicht aber um ihn nach deinen Wünschen oder den Anforderungen deiner Community zu customisieren.\n\nDamit möchte ich nicht sagen, das du Unrecht hast mit deiner Aussage das Discord seine Vorteile hat.\nAber für die Skalierung und die Anforderungen größerer Communities, die ihren Kommunikationsserver auch in andere Elemente mit einbinden möchten ist TS3 immernoch die bessere Wahl.\n\nIch hoffe ich konnte rüberbringen was ich damit sagen möchte.","replies":[{"poster":"Paramatus","date":"2016-11-08T17:01:40.244+0000","up_votes":1,"down_votes":0,"body":"Ahh nein\n1. Wer so wichtige Daten auf einen Ts laedt sollte sich gedanken machen\n2.Um zu DDOSen muss man einiges an Leistung und koennen haben bei einen Ts server kann das jeder nach 5 min googlesn. Bei Discord muss man sich auskennen, da Die Server nicht in kleine Server unterteilt werden sondern es sehr gorse virtuelle Server sind.\n3. Ich hab messungn angestellt. das Macht einen unterschied von etwa 100% aus...\n4. darueber laesst sich streiten\n5. Das ist auch ansichtssache aber gerade fuer wachsende Communities, bei denen die Ueberlebenschancen nicht aluzu hoch sind ist die Frage ob es sich lohnt.\n6. Immerhin sieht Discord nicht so aus wie der Internet Explorer auf Windows 98... Alles andere kann man so einstellen wie man will. Man muss nur wissen wie\n7. Ich habe nicht Unrecht und du hast Nur Recht, dass du sagst, dass Teamspeak seine Vorteile ahat. Du hast aber anscheinend keine Ahnung von Discord und kannst deshalb anscheinend keine glaubwuerdige Aussage abgeben.\n8. Discord kann wenn der User es will sich mit Steam League of Legends Twitch etc. verbinden und kann so der User es will anzeigen, wenn jemand in einem game ist. Auserdem ist die nutzung von Discord um einiges Angenehmer waehrend man ingame ist.\n\n(ich habe etwa 2-3 Jahre Ts3 genutzt biss ich Discord entdeckt hab.)\n\nPS: die Punkte beziehen sich auf deine Vorherige gliederug)","replies":[]}]}]}]}]}]}]}