{"poster":"Ritos Elo Police","date":"2015-02-17T15:17:39.621+0000","title":"Funmode LoL 1.0","subforum":"Karten & Spielmodi","up_votes":19,"down_votes":5,"body":"Moin erstmal,\nIch spiele League of Legends nun seit ca. 5 Jahren. Mittlerweile gibt es ja relativ viel abwechslung durch Funmods wie Aram, Urf etc. jedoch fände ich es richtig episch wenn Rito das komplett ungepatchte LoL sprich version 1.0 als Funmod rausbringen würde. Irgendwie vermiss ich ja einen Garen mit 5 Sonnenfeuer Umhängen, oder einen Jax mit 70% ausweichen. (ist ja leider nichtmehr möglich weil LoL competetiv ist)\nWas haltet ihr davon? machbar, lust drauf?\n\nps.: R.I.P Naturgewalt/DFG/Leiden/Herz aus Gold und alles was mir grad nicht einfällt x) ","replies":[{"poster":"St4rsh00ter","date":"2015-02-17T15:26:22.940+0000","up_votes":1,"down_votes":3,"body":"Also, moin Youtube Tirador!\n\nSoweit ich mit verfolgt habe, kann man auch in der jetzigen Version (5.x.x) auf Garen 5x Sonnenfeuer Umhang bauen, die haben nur ein Limit auf Boots(da die Leute damit getrollt haben) und Pots (was auch teilweise \"Trolling\" war, wenn man als Mordekaiser mit 13 Pots auf die Lane geht) gesetzt.\n\nLG St4rsh00ter","replies":[{"poster":"Ritos Elo Police","date":"2015-02-17T15:28:17.216+0000","up_votes":3,"down_votes":0,"body":"Klar kann man noch 5 mal Sonnenfauer bauen, das Problem dabei ist nur dass das eine einmalige Passive hat, das war früher anders x)","replies":[]}]},{"poster":"ad ap tank supp","date":"2015-02-23T07:55:14.352+0000","up_votes":2,"down_votes":0,"body":"vote yes ^^ ..  ich meine als funmode und abwechslung wäre dies der hammer .. endlich wieder ap yi zocken ^.^","replies":[]},{"poster":"Revilous","date":"2015-02-17T15:41:39.957+0000","up_votes":1,"down_votes":0,"body":"Also ich hätte bei so einem Mode ganz sicher Spaß :D Aber die Frage ist: Was ist mit den neuen Champs? Es waren damals ja nur sehr wenige Champs verfügbar und ich weiß nicht, inwieweit die alle damals möglich gewesen wären. Cool fänd ich es, wenn alle Champions in ihrer ersten Erscheinung (heißt ohne Nerfs) zu spielen sind. \n\nmfG","replies":[{"poster":"Ritos Elo Police","date":"2015-02-17T20:50:55.379+0000","up_votes":2,"down_votes":1,"body":"ajo, die neuen werden dann halt auch ungenerft reingestellt, da gibts gar keine Probleme ;D","replies":[]}]},{"poster":"AgrhonakSTB","date":"2015-10-18T13:51:47.805+0000","up_votes":1,"down_votes":0,"body":"hört sich gut an aber nicht realisierbar\n{{champion:203}}","replies":[]},{"poster":"Rotten Onion","date":"2015-02-24T22:07:24.785+0000","up_votes":1,"down_votes":0,"body":"ich würde mir SOOOOOO extrem einen LAN-Version wünschen!! (LAN->mehr Spaß, weniger ernst = z.b. so eine frühe Version)\n\nEin LoL für das man meinetwegen ein paar cents bezahlen muss, dafür dann ne lustige Version, vll mit vielen spielmodi hat, welches man auf ner LAN Party ohne Internet spielen kann. \nWir sind öfters mal 7-10Leute auf ner LAN und wenn lol gezoggt wird geht der Ping immer wundervoll in die Höhe","replies":[]},{"poster":"Fuzzknock","date":"2015-02-21T13:47:29.994+0000","up_votes":1,"down_votes":0,"body":"Da könnte ich doch wieder 100% CDR-Ult-Stations-Heimwacht-Gangplank spielen.","replies":[]},{"poster":"Tonid Artet","date":"2015-02-18T04:10:08.501+0000","up_votes":1,"down_votes":0,"body":"Ich fände alleine schon für die alte Grafik würde sich das lohnen.\nIch hab grad erstmal season 1 finlale geguckt :D\n\n\n-------------------------------------------------------------------------------------------------------------------------\nJune 12, 2009 Patch: Reworked\n\nReduced range to 800 from 900.\nChanged functionality: Flash.png Flash is now cast without the need of a target indicator (i.e. it is cast towards the position of your mouse pointer).\nFlash.png Flash will automatically flash to the furthest valid range in the direction it is cast at.\nFlash.png Flash no longer has a cast time (to 0 from 0.5).\n\noh man 900 range flash :D","replies":[{"poster":"Ritos Elo Police","date":"2015-02-18T18:57:32.261+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen die alte Grafik vermiss ich gar nicht mal so sehr.\nWas aber auf jeden fall lustig wird ist, wenn dann die ganzen leute ausversehen wieder minions igniten. :D","replies":[]}]},{"poster":"XxKampflappenxX","date":"2015-02-18T07:33:49.476+0000","up_votes":1,"down_votes":0,"body":"Champions ungenerft? Junge gib es doch zu dass du unbedingt Xin Xao auf Release zocken willst :P\n\nIch höre sie jetzt schon alle schreien","replies":[]}]}