{"poster":"UGA Kuschelteddy","date":"2019-11-23T13:58:58.970+0000","title":"Kaufvorschläge für einen billig laptop","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Moin. Da ich viel unterwegs bin und nicht auf lol verzichten will brauche ich einen kleinen Laptop mit dem ich LoL auf ca 50 fps spielen kann. Grafik sollte ungefair bei mittel liegen. Jetzt bin ich ein reiner technik noob, Azubi, also pleite wie immer. daher habe ich ein maximales budget von 500€. \r\nKann mir jemand einen Laptop vorschlagen der meinen anforderungen entspricht?\r\n\r\nVielen Dank an euch ****{{sticker:sg-soraka}} ****","replies":[{"poster":"MSF Akito","date":"2019-11-23T14:40:46.534+0000","up_votes":2,"down_votes":0,"body":"Lenovo scheint relativ gute Laptops für unter 500€ zu haben, allerdings haben die eine Intel Graka. Für die würde ich meine Hand nicht ins Feuer legen. Ich persönlich habe einen Medion Erazer für unterwegs. Die gibts von billig bis teuer. Wenn du da 500€ reinhaust sollte das mehr als genug sein um LoL ohne Probleme spielen zu können. Auf der anderen Seite würde ich aber nicht nochmal einen Laptop \"nur\" für LoL kaufen. Früher oder später findet man weitere Spiele, die man unterwegs spielen möchte &amp; dann ist die Enttäuschung groß, wenn der aktuelle Laptop nicht genug Leistung hat. Wenn du also in absehbarer Zukunft mehrere Spiele spielen möchtest, dann greif lieber etwas tiefer in die Tasche. Gute Laptops zum spielen sind nämlich teuer. \n\nWenn es aber bei LoL bleibt solltest du mit jedem Laptop der über eine GeForce verfügt gut beraten sein.","replies":[{"poster":"Izaya Kumiho","date":"2019-11-23T14:52:03.704+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=MSF Akito,realm=EUW,application-id=YnZkMR0R,discussion-id=I4wZJETU,comment-id=0001,timestamp=2019-11-23T14:40:46.534+0000)\n>\n> [...] **Medion Erazer** [...]\n\n\nOh no.\n./ screams in aldi\n\nMedion wirkt vielleicht auf dem ersten Blick \"günstig\", ist aber in den meisten Fällen überteuert AF.\nDeren Tower sind 'n brutaler Scam und es würde mich ganz ehrlich bei den Laptops nicht wundern.\n\nWenn deiner läuft: Nice. Aber du wirst sehr wahrscheinlich trotzdem zu viel für das Ding gezahlt haben. Das ist für Medion ziemlich normal. @_@\n\nBut yeh...es wäre wohl eine Option, sollte der TE echt nicht viel mit dem Laptop machen wollen.","replies":[{"poster":"MSF Akito","date":"2019-11-23T15:04:21.873+0000","up_votes":2,"down_votes":0,"body":"Er packt LoL mit über 100 FPS auf höchster Grafik &amp; für unterwegs ist das in Ordnung. Und zum Thema Preis-Leistung.. darum habe ich gesagt, dass ich das Geld nicht nochmal nur für LoL ausgeben würde, weil der eben sonst nicht wahnsinnig viel schafft. :)","replies":[]}]}]},{"poster":"Thresh Player","date":"2019-11-23T20:53:35.368+0000","up_votes":1,"down_votes":0,"body":"Hey, \nBei einem Computer, egal ob Tower oder NoteBook/Laptop, sollte man immer auf einige Sachen achten, auch dass die Komponenten aufeinander abgestimmt sind. Wenn du also eine mega Grafikkarte eingebaut hast, dann aber den letzten Schrottprozessor hast, kannste gute Grafiken oder viel Leistung auch vergessen. Gerade bei FertigComputern stimmt die Zusammenstellung oft nicht. \nIch würde dir empfehlen auf ein paar Dinge zu achten;\n- Arbeitsspeicher sollte DDR4 sein \n- Nicht mehr als 16 GB Arbeitsspeicher 4-8 reichen locker (meisten Programme unterstützen eh nur bis 16 GB, wenn man es nicht umstellt)\n- Eine richtige Grafikkarte, keine intigrierte Grafik (Nvidia, AMD Radeon, ...)\n- SSD Speicher, da dieser schneller ist als HDD (kann auch beides besitzen, wie die meisten PCs)\n- AMD  (Ryzen) Prozessor, gegenüber Intel billiger, bringen nur weniger FPS, heißt aber nicht dass sie schlechter sind\n- 2GB VRam, da der Laptop ja zum Zocken benutzt werden soll\nWenn man das alles berücksichtigt merkt man schnell, dass die Auswahl bis 500€ knapp ist, da müsste man irgendwo Abstriche machen, oder einen Schnapper machen.\n\nHier ist ein Laptop für 520€ den ich gefunden habe, evt wäre er etwas, ich habe jetzt aber auch nur 10 Minuten gesucht;\nhttps://www.notebooksbilliger.de/notebooks/asus+vivobook+f512dk+ej202t\n\nDie Bewertungen sagen, dass er sich von der Verarbeitung nicht soo hochwertig anfühlt und dass der Bildschirm besser sein könnte, das wären dann evt Abstriche die man eingehen könnte, zumindest wäre es für mich in Ordnung.\n\nHabe mich aber nie wirklich mit Laptops beschäftigt, nur mit Towern, da ich mir vor 1 Jahr selbst einen zusammengestellt habe.  \nHoffe ich konnte dennoch helfen ^^","replies":[]},{"poster":"Daser","date":"2019-11-23T14:05:12.195+0000","up_votes":1,"down_votes":2,"body":"50FPS? Ich bekomm dieses EbolaAids wenn ich mit 60 spiel....\nIch sag dir, tu dir das nicht an.\n\n\nUnd dazu würde ich lieber mit 60FPS und auf lowster Grafik spielen, als mit 50 FPS auf Ultra.","replies":[]}]}