{"poster":"NaytGueld","date":"2019-09-08T03:48:25.221+0000","title":"no hace nada el server","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"hice un foro y me lo borraron asi tratan a sus clientes? mira vos que bien no me cansare les hare un resumen de lo que decia me silenciaron el chat por 9 partidas y les explicare el por que me parece injusto 3 tipos que eran premade me reportaron por ir mal en la linea hasta ahi bien pero despues me flamearon toda la partida a mi y a mi premade que era el top luego de eso volvemos a jugar una partida y adivinen que me vuelven a tocar los mismos tipos de la anterior a lo cual yo decido no darles importancia y mutearlos el caso es que cuando termina la partida me reportan y me silencian el chat por 9 partidas YO SIN DECIR NADA EN LA SEGUNDA PARTIDA! lo que digo es que riot se deja llevar por cantidad de reportes que por quien es la culpa en si me parece muy injusto de su parte y espero que no me borren la discusion por que seria el colmo!","replies":[{"poster":"BC Shuh","date":"2019-09-08T04:45:23.244+0000","up_votes":1,"down_votes":0,"body":"A mi me pasó eso. Por eso siempre que veo premades me salgo en la selección. Onda a veces son re piolas y se re copan jugando, pero a veces se ponen de acuerdo para flamearte, pedir report, e incluso decir q uno gano la linea cuando ni la canto en la seleccion onda.","replies":[{"poster":"NaytGueld","date":"2019-09-14T20:30:16.488+0000","up_votes":2,"down_votes":0,"body":"Encima están de sensibles les robas un minion y te trollean o sea que onda jjajaja son un chiste esos tipos.","replies":[]}]},{"poster":"Edikiita","date":"2019-09-08T03:50:50.477+0000","up_votes":1,"down_votes":1,"body":"Copia el chat que supuestamente es injusto y mandá un reporte al soporte.","replies":[{"poster":"Liosha","date":"2019-09-08T04:33:54.800+0000","up_votes":1,"down_votes":0,"body":"El sistema de soporte es una leyenda urbana  {{sticker:sg-miss-fortune}}","replies":[{"poster":"NaytGueld","date":"2019-09-14T20:29:15.568+0000","up_votes":1,"down_votes":0,"body":"solo te ponen eso para que digas ahh van a hacer algo jajajja que risa best soporte","replies":[]}]},{"poster":"NaytGueld","date":"2019-09-14T20:28:29.536+0000","up_votes":1,"down_votes":0,"body":"ahí hay otro bot amigo ya lo intente y sigo esperando al \"humano\"","replies":[]}]},{"poster":"Kai Fox","date":"2019-09-08T04:01:34.596+0000","up_votes":1,"down_votes":0,"body":"no escribas durante la partida no escribas nada men te lo digo por experiencia propia el bot que penaliza no  toma en cuenta lo que escribes sino cuánto escribes además las premades son los más especiales del lol si le dices algo a cualquiera de ellos te amenazan con que te meteran 4 reportes tremendo mongolos además buscan tiltearte para que les respondan y te reporten si no escribes nada aunque te reporte todo el mundo no te va  pasar nada.","replies":[{"poster":"NaytGueld","date":"2019-09-14T20:27:37.141+0000","up_votes":1,"down_votes":0,"body":"En la segunda partida no dije absolutamente nada, En la primera ni los flamie solo hablaba con mi premade en top que el tiene micro y yo no y seguramente me banearon por eso que dices, por que ponen un bot y te banean por cantidad. Me parece que deberían ponerse las pilas y poner gente para quitar a las {{champion:29}}","replies":[]}]}]}