{"poster":"Zoral","date":"2016-12-19T20:31:50.690+0000","title":"Rework al rework de los asesinos","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Su rework fue un asco o quedaron permaban o peor que antes\r\n\r\ny la supuesta &quot;temporada de asesinos&quot; es de tankes, veo tankes hasta en el rey poro \r\n\r\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"DkA Darkito","date":"2016-12-20T01:29:36.100+0000","up_votes":2,"down_votes":0,"body":"Siempre vas a ver Tanks, porque los tanks les ganan a todos, es así de simple aunque moleste","replies":[]},{"poster":"IroNNNN","date":"2016-12-19T20:59:01.073+0000","up_votes":1,"down_votes":0,"body":"Asesinos op: Kata, Yi, Leblanc, Zed, Ekko, Rengar, Talon, Shaco, Fizz, Khazix.\n\nAsesinos no muy op: Eve, Noct, Kassa, Akali, Nidalee.\n\nY los asesinos op, estan muuuy op.\nAsesinos > Magos > Tiradores > Tanques > Asesinos.","replies":[{"poster":"Mosh","date":"2016-12-20T05:11:14.248+0000","up_votes":1,"down_votes":0,"body":"**Campeon / Winrate**\nKatarina 48.04%\nMaster Yi 47.49%\nLeBlanc 49.82%\nZed 46.7%\nEkko 51.12%\nRengar 47.25%\nTalon 47.91%\nShaco 54.78%\nFizz 48.68%\nKha'Zix 49.82%\n\nAsesinos OP?","replies":[{"poster":"IroNNNN","date":"2016-12-20T08:28:03.541+0000","up_votes":1,"down_votes":0,"body":"Los winrate no dicen mucho, solo que claramente hay gente que no sabe usarlol... Kata se esta sacando en competiciones, Rengar, Kha y Talon tambien... Incluso Dopa en su ultimo stream dijo que muchos estaban op.","replies":[{"poster":"Mosh","date":"2016-12-20T15:38:20.716+0000","up_votes":1,"down_votes":0,"body":"¿Maestro YI y Zed?","replies":[{"poster":"IroNNNN","date":"2016-12-20T19:23:52.735+0000","up_votes":1,"down_votes":0,"body":"Zed tiene mecanicas, compara al Zed de Faker con el de un plata cualquiera...\n\nY bue, Yi no es mecanica, pero hay que saber cuando meterse.\n\nIncluso deberias saber el potencial de Yi, Zed, Kata, Diana, Leblanc, Talon y Fizz teniendolos maestria 5, 6 y 7. Vamos ! no te averguenzes de decir lo que son, yo maineo Viktor y se que esta roto.","replies":[{"poster":"Mosh","date":"2016-12-21T00:10:01.630+0000","up_votes":1,"down_votes":0,"body":"Es que para mi no están rotos, roto estaba Udyr con un 65% de winrate, Kata se come un CC y esta muerta. Yi, lo mismo, estaba roto cuando lo podías armar tanque, ahora no esta para nada fuerte. Zed en este momento no es una buena opción, esta super nerf en early. Talon solo lo use un par de veces después del rework y no me gusto mucho. LeBlanc y Fizz los veo fuertes, pero no rotos.\n\nAntes del rework Kata, LB y Fizz eran más fuertes. Ahora tardas bastante más en matar y eso es un nerfeo bastante grande.\n\nCon todos lo asesinos lo único que tenes que hacer es cuidarte en early, si no snowballean no sirven. Obvio que cualquier campeón que va 20/0 va a ser fuerte. Muchos ven un Yi o un Zed que va 20/0 y dicen que fuerte, y no, el campeón en si no esta fuerte pero si lo dejas que escale así es lógico que te gane la partida.","replies":[]}]}]}]}]},{"poster":"Eowolith","date":"2016-12-20T00:04:24.062+0000","up_votes":1,"down_votes":0,"body":"Perdon pero leblanc la dejaron useless ya no es mas el tipico asesino que burstea y se va, Lo unico que sirve es su E ya que explota el combo de esa habilidad pero hasta que regenere la pasiva si no lo matas con la primera ya estas muerto, El personaje es muy debil y squishy para esperar 2 seg a que explote su E, en esos 2 seg un champ con mas burst lo destruis y lo digo por experiencia que una lb fedeada antes que me explote la E la mate con un combo de Diana y la verdad me parece que la dejaron useless.\nZed ya no pega nada, si no acumula daño con su ulti es useless tambien, en early rusheando lv 6 primero antes era kill asegurada , ahora tiro ulti a una syndra e incluso le clave las 3 shuriken cosa que no es muy comun de mi, y no le saque nada de vida lo cual me sorprendio cosa que antes con 2 shuriken y una E deleteabas.\nLos otros que nombrastes no puedo decir nada porque todavia no testie la mayoria casi nunca me encuentro con katarinas y si las encuentro son realmente muy mancos. despues talon y k6 los use y si lo usas bien el early ya para mid-late game ganas la partida pero eso ante todo","replies":[{"poster":"IroNNNN","date":"2016-12-20T08:24:13.382+0000","up_votes":1,"down_votes":0,"body":"Bueno, contra Lb no juego hace mil, pero la ultima vez que la vi maso menos hace 2 semanas, pegaba mucho.\nLo de Zed op lo digo porque siempre que me toca en mid re snowbollea la lane (no en el sentido de que pierdo lane, sino que roamea y nadie me hace caso a las mias entonces mata a todos).","replies":[]},{"poster":"GordoNils","date":"2016-12-20T01:02:02.334+0000","up_votes":1,"down_votes":0,"body":"> pero leblanc la dejaron useless ya no es mas el tipico asesino que burstea y se va\n\nLamento informarte que a eso apuntaba Riot. Ellos no querían que Le Blanc de un combo te mate y se vaya con vida, sino que la otra persona tengo mas tiempo de reacción y que diga: ¿En que fallé para que me mate? Y no que diga lo típico de: No tuve nada que hacer\n\nSaludos {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Zevko","date":"2016-12-19T21:18:29.830+0000","up_votes":2,"down_votes":2,"body":"Zed op? con eso ya te das cuenta que lo que decis no tiene sentido","replies":[{"poster":"IroNNNN","date":"2016-12-20T08:21:40.786+0000","up_votes":1,"down_votes":0,"body":"Buen jugador de Zed = Op Zed.","replies":[]}]}]},{"poster":"IJN Akagi","date":"2016-12-19T21:33:12.151+0000","up_votes":1,"down_votes":0,"body":"Es Obvio,los counter de los asesinos son los tanks,Los tanks son capaces de matar a los asesinos faciles xD","replies":[]},{"poster":"faster51","date":"2016-12-19T21:20:09.319+0000","up_votes":1,"down_votes":0,"body":"es verdad que talon,kata y fizz necesitaban rework, pero lo demas esta muy roto y no necesitaban rework :/(menos zed y quizá shaco, ahí la cagaron)","replies":[]},{"poster":"GinTaicho","date":"2016-12-19T20:37:31.920+0000","up_votes":1,"down_votes":0,"body":"No entiendo, según tu quedaron malos y rotos al mismo tiempo?\nEn todo caso, con tantos asesinos es normal que la gente saque tanques, como el piedra, papel y tijeras.","replies":[]},{"poster":"Sherpard","date":"2016-12-19T21:32:59.301+0000","up_votes":1,"down_votes":1,"body":"Que yo sepa, en ningun momento dijeron que con la actualizacion de asesinos se transformaba automaticamente en la temporada de asesinos.\n\nEso si, hay un par de asesinos que quedaron olvidados.","replies":[]}]}