{"poster":"xDogMeatx","date":"2019-08-15T12:06:24.455+0000","title":"Stocks never lie","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"https://www.tradingview.com/symbols/NASDAQ-RIOT/\n\nThis is the current condition of if league is dying or not.\n\nHold on wait if there is a actual link link me it to correct it.\nNeutral post btw. Review it and tell me what you think.\n\nEdit: look at DuskDaUmbreon's Post he's got the answer there props looking it up.","replies":[{"poster":"Daddy Ants","date":"2019-08-15T12:24:59.299+0000","up_votes":3,"down_votes":0,"body":"Hahahaha thats not Riot Games\n\n\n>** Sector: Financials\n> Industry: Financial &amp; Commodity Market Operators\n> Employees: 6**\n> Riot Blockchain Inc., **formerly Bioptix, Inc**., is focused on gaining exposure to the blockchain ecosystem through its cryptocurrency mining operations, internally developed businesses, joint ventures, and targeted investments in the sector. The Company\n\n\nYou really should stop typing Riot into stock sites and picking the first thing you see :)","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:26:16.484+0000","up_votes":2,"down_votes":1,"body":"I'm sorry I just caught that. If there is a link to correct it though I'll be happy to change the link.","replies":[{"poster":"DeathBurst","date":"2019-08-15T12:37:46.024+0000","up_votes":2,"down_votes":0,"body":"Riot is not a publicly traded company. There is no Riot stocks.\n\n(And stocks definitely can lie, but that doesn't even matter here. Riot stocks don't exist...)","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:42:19.100+0000","up_votes":1,"down_votes":0,"body":"I thought that stocks in corporations exist in some degree though 0_o","replies":[{"poster":"Eedat","date":"2019-08-15T13:32:48.224+0000","up_votes":1,"down_votes":0,"body":"No.  Privately owned businesses do not have stocks or stock holders. However,  Riot is owned solely by Tencent which is a publically traded corporation.  Tencent is an investment firm though so their stocks reflect a wide variety of things","replies":[]}]}]}]}]},{"poster":"DuskDaUmbreon","date":"2019-08-15T12:40:16.284+0000","up_votes":2,"down_votes":0,"body":"The SEC has precisely one filing for Riot Games, Inc., a [Form D from 2009](https://www.sec.gov/Archives/edgar/data/1469145/000146914509000001/0001469145-09-000001-index.htm), which is a Notice of Exempt Offering of Securities. I'm not an expert on this form (I deal with the more normal forms for publicly-traded non-investment companies), but I believe this means they can't be publicly traded in any way, shape, or form. At least not to a degree that you could look at stocks.\n\nAnd they're fully owned by Tencent. Tencent can just set the price because they have absolutely all the stock in Riot.\n\nBecause of this, you can't really look at their stocks as an indicator, because their stocks won't really change.","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:47:36.203+0000","up_votes":2,"down_votes":0,"body":"Thx for this information","replies":[{"poster":"DuskDaUmbreon","date":"2019-08-15T12:53:58.826+0000","up_votes":1,"down_votes":0,"body":"yw. I appreciate any opportunity to use my knowledge from work on winning internet arguments. :P","replies":[]}]}]},{"poster":"KFCeytron","date":"2019-08-15T12:32:01.331+0000","up_votes":1,"down_votes":0,"body":"Stocks certainly can lie. They're just a measure of investor confidence. For example, Tesla and Uber each have tremendous valuations, but they also each lose over half a billion dollars a quarter. If they weren't getting constant infusions of cash from VCs and stock sales, they would go under immediately. Riot, on the other hand, makes... what, over a billion dollars a year? \"Dying\" is a pretty nebulous term at best, anyway. Riot's sales are down, yes, but that's relative to their previous sales, which have been very high. I'd find it reasonable to claim that they've peaked, but I don't think they're even close to dying.","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:36:20.015+0000","up_votes":1,"down_votes":0,"body":"I thought stocks = company spending money towards essential things like ranging from bills to maintenance.","replies":[{"poster":"KFCeytron","date":"2019-08-15T12:48:16.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Corrector1,realm=NA,application-id=3ErqAdtq,discussion-id=IYXR3NET,comment-id=00020000,timestamp=2019-08-15T12:36:20.015+0000)\n>\n> I thought stocks = company spending money towards essential things like ranging from bills to maintenance.\n\nhttps://i.ytimg.com/vi/NIgfiSzCy1o/hqdefault.jpg","replies":[]}]}]},{"poster":"preternatural","date":"2019-08-15T12:44:43.286+0000","up_votes":1,"down_votes":0,"body":"stocks were highest in 2007\ngood graph.","replies":[]},{"poster":"SEKAI","date":"2019-08-15T12:16:01.978+0000","up_votes":1,"down_votes":0,"body":"Click on the \"All\" view at the bottom of the graph.\n\nIt's just a tiny fluctuation that may or may not matter in a short period but across a long period and grand scheme of things it doesn't seem to matter at all.\n\nNot to mention, if you look at \"5Y\" (5 year) you can see it's just returning to the same level as Season 6 and Season 7 after the Season 8 which had a massive upward spike for 1 reason or the other (since everyone had been bitching about the game hardcore since Season 8 but I guess that's also when Riot's stocks worthed the most in the last 5 years). So the level we're seeing now seems to be pretty normal for Riot.","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:17:45.531+0000","up_votes":1,"down_votes":0,"body":"Is this the correct link to them or \"meh close enough\"?","replies":[{"poster":"SEKAI","date":"2019-08-15T12:20:41.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Corrector1,realm=NA,application-id=3ErqAdtq,discussion-id=IYXR3NET,comment-id=00000000,timestamp=2019-08-15T12:17:45.531+0000)\n>\n> Is this the correct link to them or \"meh close enough\"?\n\nI am not sure, actually. I am not that into stock market and that sort of thing so I just kinda read the graph.","replies":[{"poster":"xDogMeatx","date":"2019-08-15T12:22:10.177+0000","up_votes":1,"down_votes":0,"body":"K if anyone finds any info that says otherwise I'll update the post/link when available.","replies":[]}]}]}]}]}