{"poster":"Claynol","date":"2019-11-08T08:44:27.127+0000","title":"Problemi di accesso","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Buongiorno, cercherò di esporre brevemente il mio problema: ieri sera, in corso di partita, il pc si è improvvisamente freezzato impdendomi di fare nulla, se non essere costretto a procedere con un riavvio forzato. Al riavvio, tuttavia, non mi è stato più possibile accedere alla schermata di accesso del gioco (per capirci, quella in cui, prima del recente aggiornamento, si era soliti inserire nome utente e pw). Le ho provate di tutte: ho disintallato il game e reinstallato, ho usato lo strumento di riparazione Hextech, ho provato ad avviare il gioco anche dalladirectory, come amministratore e non, ma nulla. Cosa mi consigliereste di fare oltre che accendere un cero alla madonna? Grazie \r\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"CHARLIE CHINASKI","date":"2019-11-08T10:05:08.623+0000","up_votes":1,"down_votes":0,"body":"Prova a chiudere forzatamente il gioco, so che non è la via giusta, ma dopo un tot di tentativi ti fa entrare. Per quanto riguarda una soluzione.. non saprei proprio. Sul forum è stato aperto un post simile ma le soluzioni suggerite non funzionano per me","replies":[{"poster":"Kaori","date":"2019-11-08T13:51:23.640+0000","up_votes":1,"down_votes":0,"body":"Questa è la soluzione più veloce anche per me, yep. Killa i processi da Gestione Attività (quello di League, e RiotClientServices) e poi prova a rilanciarlo.","replies":[{"poster":"CHARLIE CHINASKI","date":"2019-11-08T14:11:48.061+0000","up_votes":1,"down_votes":0,"body":"Giochi con Mac?","replies":[{"poster":"Claynol","date":"2019-11-08T14:30:26.139+0000","up_votes":1,"down_votes":0,"body":"No, gioco da Windows, e comunque non posso chiudere il gioco ripetutamente, dal momento che cliccando sull'icona di gioco, non mi apre nemmeno la schermata di accesso","replies":[]}]}]}]},{"poster":"Jyoxes","date":"2019-11-08T10:05:28.289+0000","up_votes":1,"down_votes":0,"body":"Io sono nella stessa situazione ma praticamente mi si è bloccato nella schermata di caricamento (arrivato al 100%) con annesso freeze del pc. Ho disinstallato e reinstallato il gioco  e al nuovo accesso mi si blocca alla home ,mi compaiono solo la mia icona(in game) ,la lista amici e il menù (con mondiali 2019,panoramica....). Non so cosa fare aiuto!","replies":[{"poster":"CHARLIE CHINASKI","date":"2019-11-08T10:36:53.587+0000","up_votes":1,"down_votes":0,"body":"Prova a uscire forzatamente con il monitoraggio attività, dopo un tot di volte ti fa entrare. So che è una soluzione drastica ma funziona.","replies":[]}]}]}