{"poster":"EI Máquina ","date":"2017-01-18T05:09:09.711+0000","title":"Me Repugnas Riot, el alza de los precios de RP harán que pierdan mas de lo que ganaran","subforum":"Comportamiento del jugador","up_votes":16,"down_votes":5,"body":"no solo soy yo el molesto por la nueva noticia de la &quot;nivelaci&oacute;n&quot; de precios en Las, muchos usuarios se ven molestos, ya que no es f&aacute;cil para todos costear rp, de hecho en chile ya es bastante caro cargar rp y lo mismo me imagino para otros pa&iacute;ses de latinoamerica sur, esto solo nos demuestra que lo unico que piensan es en dinero, pero con ese pensamiento acaban de perder a un comprador regular y creo q no solo sere yo.","replies":[{"poster":"KodigoPicante","date":"2017-01-18T12:49:25.913+0000","up_votes":12,"down_votes":0,"body":"Comprar una skin decente = Juego nuevo en steam\n{{champion:32}}","replies":[]},{"poster":"SenpaiDeathx","date":"2017-01-18T22:11:04.128+0000","up_votes":1,"down_votes":0,"body":"espero que al menos al bono por comprar X monto de rp haya aumentado si suben el precio, minimo -.-","replies":[{"poster":"nXs Steeler","date":"2017-01-19T01:41:30.135+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJAJAJAJAJAJA\nEstás gracioso.","replies":[{"poster":"SenpaiDeathx","date":"2017-01-19T02:14:14.255+0000","up_votes":1,"down_votes":0,"body":"ajjajjajaja que buen chiste no? XD","replies":[{"poster":"nXs Steeler","date":"2017-01-19T03:27:32.644+0000","up_votes":3,"down_votes":0,"body":"Es como que piensen en nosotr@s y no en el dinero jajajaj","replies":[]}]}]}]},{"poster":"Kloud Ztrife","date":"2017-01-18T13:59:06.724+0000","up_votes":1,"down_votes":1,"body":"Yo no estoy de acuerdo para nada, si quieren nivelar precios simplemente en donde este mas caro nivelarlo con el valor de rp mas barato, en cambio quieren dejar a todos con el mismo valor del precio de rp mas alto.\nCon esto me doy cuenta que solo piensan en el negocio y deberían pensar aunque sea un poco en el bolsillo de sus jugadores.\nEsta es una estrategia para ganar mas dinero y se escudan diciendo que van a nivelar los precios para que el desconcierto no sea para todos.","replies":[{"poster":"Force2018","date":"2017-01-18T15:55:46.833+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Kloud Ztrife,realm=LAS,application-id=PJAKt7ph,discussion-id=ahUE9iLj,comment-id=0005,timestamp=2017-01-18T13:59:06.724+0000)\n>\n> Yo no estoy de acuerdo para nada, si quieren nivelar precios simplemente en donde este mas caro nivelarlo con el valor de rp mas barato, en cambio quieren dejar a todos con el mismo valor del precio de rp mas alto.\n> Con esto me doy cuenta que solo piensan en el negocio y deberían pensar aunque sea un poco en el bolsillo de sus jugadores.\n> Esta es una estrategia para ganar mas dinero y se escudan diciendo que van a nivelar los precios para que el desconcierto no sea para todos.\n\nTu argumento se contradice con los hechos, si niveláramos hacia arriba en ningún país bajaríamos los precios.","replies":[{"poster":"nXs Steeler","date":"2017-01-18T17:47:30.218+0000","up_votes":4,"down_votes":0,"body":"La verdad no estoy a favor de este argumento en especifico, pero en realidad no se contradice si lo llegas a entender o a pensar un poco mas. A lo que creo que el se refiere es que si quieren nivelar los precios deberían bajarlo en todos los países en los que esta mas caro apuntando al que esta mas barato y no encontrando un punto medio ya que a la gran mayoría nos sube el precio. \n¿Se entiende? Si no se entiende es probable que sea mi error al expresarme o que este equivocado.\nGracias.{{sticker:slayer-jinx-wink}}","replies":[{"poster":"  Xîü","date":"2017-01-18T21:32:06.038+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=nXs Steeler,realm=LAS,application-id=PJAKt7ph,discussion-id=ahUE9iLj,comment-id=000500000000,timestamp=2017-01-18T17:47:30.218+0000)\n>\n> La verdad no estoy a favor de este argumento en especifico, pero en realidad no se contradice si lo llegas a entender o a pensar un poco mas. A lo que creo que el se refiere es que si quieren nivelar los precios deberían bajarlo en todos los países en los que esta mas caro apuntando al que esta mas barato y no encontrando un punto medio ya que a la gran mayoría nos sube el precio. \n> ¿Se entiende? Si no se entiende es probable que sea mi error al expresarme o que este equivocado.\n> Gracias.{{sticker:slayer-jinx-wink}}\n\n No estás equivocado.. Es así tal cual lo decis.. Por eso no te responde.. Porq tenés razón y punto.","replies":[]}]}]}]},{"poster":"Craxxguitarrist","date":"2017-01-21T04:37:58.063+0000","up_votes":2,"down_votes":0,"body":"si bien es cierto que cuando el pan caliente vende hay que subir los precios, no es necesario llegar a subirlos tantos, con trabajo me cuesta algunas veces comprar mas de 15mil pesos en rp (aunque de todas formas sea una buena cantidad de rp). Creo que para no tanto descontento podrian agregar un poco mas de rp a la cantidad que venden","replies":[]},{"poster":"NerfMySkill","date":"2017-01-18T07:18:05.788+0000","up_votes":3,"down_votes":2,"body":"Quien te dijo que va a subir?, estan nivelando...porque en chile va a ser mas barato que en argentina o en otros paises?, es mas aca los precios locales dice que van a bajar porque ahora estamos pagando de mas","replies":[{"poster":"MyDear 2k15","date":"2017-01-18T08:16:07.933+0000","up_votes":3,"down_votes":1,"body":"Totalmente de acuerdo, es mas... a nosotros ya nos habia subido el precio del rp el año pasado, que de por si era caro.\nAhora por 120 pesos te dan 1220 rp que para la mayoria de skins buenas y nuevas no te alcanza...\nY por tarjeta internacional visa esos 1220 rp los pagaba 90 pesos, y depende el banco no tenias ningun recargo, por lo que te salian 90 pesos limpios.\n\nDesde mi punto de vista, gastar mas de 120 pesos en una skin es Mucho. Si bien hoy dia con esa plata no hacer mucho que digamos.\nPero la realidad es que es lo que uno se gasta por ej en la Sube por sermana como minimo siendo estudiante primario/secundario.\n\nIgual el planteo de rito esta bien... O ya se olvidaron que cuando el rp estaba en \"condiciones\" para nosotros, nuestros hermanos latinos abusaban comprando rp en ARG para que les salga mas barato aun. Razon por la cual nos aumentaron solo a nosotros.\nPero con este nuevo metodo, se estaria solucionando ese problema.","replies":[{"poster":"Okicarde","date":"2017-01-18T09:24:20.555+0000","up_votes":2,"down_votes":2,"body":"Esta bien la nivelacion hay gente que se aprovecha comprando con tarjetas para otros paises donde esta mas barato ..","replies":[{"poster":"RcJuampy","date":"2017-01-21T04:10:36.803+0000","up_votes":2,"down_votes":0,"body":"Nivelar significa que en todos los lugares tiene que estar igual , eso no significa aumentar donde esta barato , significa bajar donde esta caro{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Choro Trigger","date":"2017-01-18T15:06:41.504+0000","up_votes":1,"down_votes":0,"body":"Pero ya nos subieron el precio del rp (chile) porque en arg el precio era mayor.","replies":[]}]},{"poster":"AdamLastQuarters","date":"2017-01-21T01:56:02.470+0000","up_votes":2,"down_votes":0,"body":"ahora va a ser aun mas caro comprar skin, y se sabe que hay paises que son mas baratos y mas encima les rebajan el precio {{item:3070}}{{item:3151}}  ?\nenhorabuena, ahora podre tener mi negocio de rp desde argentina a todo LAS, siganle nomas riot que me aran lucrar mucho  {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Koijhy","date":"2017-01-19T19:43:44.968+0000","up_votes":2,"down_votes":0,"body":"te suben el precio de una moneda ficticia, GG \nyo cargaba vía TCI y Paypal y me afecta de forma negativa esto, asi que guardare mis dinero para gastarlo en cualquier otra cosa menos RP","replies":[]},{"poster":"Caballero Shion","date":"2017-01-18T17:10:56.284+0000","up_votes":2,"down_votes":0,"body":"en Argentina con TC aumentan dejate de joder.. ya lo habian aumentado y uno calladito siguio invirtiendo mas allá de la excusa de una skin nueva tambien uno lo hace para aportar al game que tanto le gusta pero que haya tantos aumentos quitan las ganas de dar ese aporte monetario de mi parte. Diran \"nadie te obliga a pagar\" , y si es verdad nadie obliga a meter dinero aqui pero es algo irrelevante es un gusto de cada quien y si a algo que vos te gusta te lo van aumentando de precio de una manera hipocrita diciendo que es una \" nivelacion\" cuando ves que a CHILE y otros paises tambien les molesta te das cuenta que no es solo el pensamiento de una sola persona sino mas bien de toda una comunidad que a gritos pide PRECIOS JUSTOS .. entienden por otra parte lo que es \"comunismo\" ? no es lo mismo la palabra IGUALDAD que EQUIDAD.. ser igualitario es darle a otro lo mismo siendo que por ahi no medis las diferencias realmente entre cada persona simplemente sos igualitario en cambio EQUITATIVO es tener en cuenta REALMENTE la situacion de cada lugar. Aca en ARGENTINA estamos pasando por un mal momento y con este tema de los aumento que se sume tambien el RP hacen acortar gastos por ende CHAU cargas de RP..y si ensima no mejoran los reportes o la eficacia en ello perderan mas jugadores. un -10 para riot.. sinceramente.{{champion:32}}","replies":[]},{"poster":"DarkBlack20","date":"2017-01-18T12:42:36.004+0000","up_votes":1,"down_votes":2,"body":"pero porq no se fijan en lo q dicen en chile es el único país afectado en los demás hasta los favorecen bajan el precio en tarjetas locales ósea piensenlo","replies":[{"poster":"NexonF15","date":"2017-01-19T05:49:08.267+0000","up_votes":2,"down_votes":0,"body":"Chile no es el único afectado, por ejemplo en Uruguay sube el precio de tarjetas locales {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"KodigoPicante","date":"2017-01-18T12:48:26.375+0000","up_votes":1,"down_votes":0,"body":"Las tarjetas locales son una basura","replies":[{"poster":"Mascheranox","date":"2017-01-18T13:54:46.782+0000","up_votes":1,"down_votes":0,"body":"solo por que era mas caro que la targeta ? o por que no queres salir de la cueva (?","replies":[{"poster":"KodigoPicante","date":"2017-01-18T14:54:38.547+0000","up_votes":1,"down_votes":0,"body":"me descubriste jejejeje","replies":[]}]}]}]},{"poster":"MyselfSick","date":"2017-01-19T21:29:16.846+0000","up_votes":2,"down_votes":1,"body":"cuando vez las cosas de tal forma en que te da lo mismo la skin, sino la habilidad de jugar, la forma de subir escalas en el nivel competitivo a base de practica y habilidad, en ese instante, te sentiras como yo, y sabras que te importan 3 kilometros de pepino que suban o bajen el precio de los RP xD.\n\nPD: respeto el argumento de alguien que diga que gastar dinero para comprar RP para adquirir campeones de forma mas rapida o bien comprar skins.","replies":[]},{"poster":"Sandungero","date":"2017-01-22T04:50:00.963+0000","up_votes":1,"down_votes":0,"body":"Nivelando hacia arriba clasico de Riot{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Cruners2","date":"2017-01-19T01:44:25.065+0000","up_votes":1,"down_votes":0,"body":"Siguen sin entender lo que rito piensa.......... se dieron cuenta recien con esto, en serio? ajajajjaja.","replies":[]},{"poster":"Neko360","date":"2017-01-18T17:11:06.395+0000","up_votes":1,"down_votes":0,"body":"Yo aprecio el trabajo de Rito por la nivelacion del rp y esas cosas, pero para muchas personas se vuelve algo incomodo tener que pagar mas de lo que uno acostumbra, ya sea con cualquier tipo de moneda.\nPor mi parte estoy en desacuerdo ya que para mi no es facil acceder a rp, (no es que sea pobre :v, pero igual la gasto en rp xD) ya que esta mas caro que antes y haora esto, lo que faltaba :V.","replies":[]},{"poster":"DarkSoterios99","date":"2017-01-18T13:41:45.974+0000","up_votes":1,"down_votes":0,"body":"si quieren nivelar los precios simplemente que le bajen a los países que está caro y que a los otros los dejen normal en vez de subirlo","replies":[]},{"poster":"WhiteMax","date":"2017-01-18T10:05:46.252+0000","up_votes":1,"down_votes":1,"body":"Si el precio del dolar sube, porque el del RP no?","replies":[{"poster":"gatitokun3","date":"2017-01-18T12:43:25.381+0000","up_votes":1,"down_votes":0,"body":"el problema es que el alza y la baja del dólar es constante, y no creo que rito haga una nivelación mensual o dependiendo de el precio del dólar actual, se quedarían con el precio aunque el dólar suba y que pasara con eso, los que compran con tarjetas internacionales, sentiran ese alza","replies":[{"poster":"WhiteMax","date":"2017-01-18T12:44:12.294+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"gatitokun3","date":"2017-01-18T12:47:06.497+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]},{"poster":"zex","date":"2017-01-22T04:35:12.474+0000","up_votes":1,"down_votes":1,"body":"Es tan sencillo como que no compres skin si no tienes dinero para ella... No es necesario aparentar, o si? Con tu encuesta y esfuerzo no vas a lograr nada, es su juego con el cual ganan SU dinero, su trabajo. Mejor gasten sus esfuerzos en cambiar las cosas en su país para que sus rp sean más baratas o lo que sea, seguramente debe haber cosas por las cuales quejarse y solucionar antes que la suba de unas rp sin importancia.","replies":[]},{"poster":"Edul","date":"2017-01-21T04:04:54.311+0000","up_votes":1,"down_votes":1,"body":"Deja de llorar, deja de sufrir ♫","replies":[]},{"poster":"Allegretto","date":"2017-01-21T03:58:31.738+0000","up_votes":1,"down_votes":1,"body":"Os invito a pensar bajo la premisa de que League of Leyends es un juego gratuito, y la inversiòn de dinero dentro de èste es sòlo una excentricidad innecesaria, mejor solucionemos el àmbito de empatìa y competencia. Un saludo cauros !","replies":[]}]}