{"poster":"Dessem","date":"2016-03-24T00:41:53.969+0000","title":"Mt Targon story: long delays make it hard to remain excited.","subforum":"Story, Art, & Sound","up_votes":13,"down_votes":1,"body":"As title. I loved the Mount Targon stories when they were released and eagerly checked back for updates on the story. We got new backstory for Leona, Diana and Pantheon, with two empty spots!\r\n\r\nAfter two weeks, we got Aurelion Sol&#039;s backstory, and it all comes together in that Pantheon sees Aurelion Sol coming and there&#039;s something big about to happen.\r\n\r\nBut then there&#039;s nothing again. \r\n\r\nI get that you don&#039;t want to tie in events every time something lore-related happens. That&#039;s all right. However, the Bilgewater Lore event set a standard. Some in-game achievements to acquire, story that&#039;s continuously updated and fleshes out existing characters (and revamps their backstory a bit), all interconnected in some way...\r\n\r\nAnd now we get four stories, but unlike the Bilgewater event, these stories are moreso champion biographies with a short story added. In fact, that&#039;s exactly what they are.\r\n\r\nThe Bilgewater event was exciting, updated continuously, provided some interactivity, tied in with the game state and overall was a resoundingly good experience.\r\n\r\nThe Mount Targon event doesn&#039;t come close even a little. It does not update continuously. It does not seek to provide fiction for people to eagerly read as the stories published are &#039;complete&#039; for that character. We don&#039;t get multiple publications that slowly unfold the stories, the stories are there, they&#039;re done.\r\n\r\nAt least, that&#039;s the current way they come across. Maybe they&#039;ll be something more, but then I saw Jhin&#039;s story, and there was a special page for it, with special numbering, but then some tech broke, they never updated that page and it was quietly added to his champion page (which has me wonder, what tech broke that disallowed you from posting that to his champion page?).\r\n\r\nWhat I&#039;m trying to say is, I really enjoyed the Bilgewater Lore event and am bummed the Mt Targon event isn&#039;t anywhere close to resembling it. We get no special prose (beyond the singular piece of prose each champion appears to be getting), we get no in-game achievements, no events, no regular updates, no nothing.\r\n\r\nA champion, I suppose, but Illaoi&#039;s introduction in Bilgewater was more interesting; we got to know Illaoi before we were told she&#039;d be a champion, and we only got the art after reading about her in the story. Aurelion Sol was only mentioned the moment he was revealed as a champion.","replies":[{"poster":"RiotJaredan","date":"2016-03-24T01:28:23.661+0000","up_votes":12,"down_votes":5,"body":"The Targon reveal was in no way meant to be an event of the kind that you mention with Burning Tides. I completely understand why that might seem the case, and we need to do a better job in clarifying these things.","replies":[{"poster":"Hellioning","date":"2016-03-24T01:45:36.991+0000","up_votes":14,"down_votes":1,"body":"Ugh. Guess the thought of getting more than one big lore event a year was a pipe dream after all.","replies":[{"poster":"The Soulforged","date":"2016-03-24T04:00:31.714+0000","up_votes":9,"down_votes":1,"body":"The thought of getting one is a pipe dream.","replies":[]},{"poster":"Sharjo","date":"2016-03-24T06:35:50.238+0000","up_votes":3,"down_votes":0,"body":"Well it's not like big lore events a la Burning Tides are all that easy to produce considering you need to get so many things made for it.","replies":[]},{"poster":"GreenLore","date":"2016-03-24T10:38:23.398+0000","up_votes":1,"down_votes":0,"body":"Well but it might mean that they get more lore rewrites done in the future(and also change a bit the lore layout?I mean the targon site could be used in the future as well,getting updated when a new targon champion gets released/someone gets retconned into a targon-champ).\n\nWhile I hope that we get at least one lore event this year,I would be ok if they don't do a second one if it means that we'll finally see some updates to the existing lores.","replies":[]}]},{"poster":"Stars Shaper","date":"2016-03-24T09:14:59.437+0000","up_votes":2,"down_votes":0,"body":"- Shurima kind of was but tech issues and poor story telling as it flattened many chars and we have to wait 2 years (if this is the year) to have champions' Bios (Awesome game mode though).\n- Bilgewater was it and basically had a part 2 in Shadows of Fortune which only intent was to deepen up Miss Fortune character and introducing Illaoi\n- Shadow Isles wasn't, it had some good change of character Bios but the main event wasn't even supposed to make SI champions as central characters, even Olaf got more space than them.\n- Ionia/Jhin wasn't.\n- Targon is not it and Taric has still one patch cycle at least before it's been seen (basically killing the hype).\n\nThe more it goes on and more it seems that the choice behind what and what not is going to be an event is entirely decided by how much X part of Riot teams likes certain champions. Expecially considering how easy would it be to make players feel part of an event (Summoners icons, ward skins, etc.) it feels really underwhelming. I know that creating icons and ward skins can't be done in the blink of an eye but surely it's less time  and resource consuming than champion bios, color texts and game modes/maps.","replies":[]},{"poster":"Dessem","date":"2016-03-24T09:26:47.994+0000","up_votes":2,"down_votes":1,"body":"Thanks for the answer. I really appreciate it! I do hope Burning Tides isn't going to be a one-off event; I enjoyed it an immense lot, and regularly checked back for the text updates specifically. So I do hope you'll repeat such an event, and thanks again for the answer! I'll also manage my own expectations and not think Burning Tides will repeat whenever some story content is released.","replies":[]}]},{"poster":"Wulf Helhammer","date":"2016-03-24T00:43:23.263+0000","up_votes":3,"down_votes":1,"body":"It's not an event. It's just them releasing new individual champion lore for a group, and seeing as that group is all connected, they set up a microsite so people could find it easier.","replies":[]},{"poster":"kitcat300","date":"2016-03-24T01:09:45.979+0000","up_votes":1,"down_votes":1,"body":"Maybe when the fifth slot is reveled and filled in the whole thing will come full circle some how.","replies":[{"poster":"DorkunedAuras","date":"2016-03-24T13:00:12.108+0000","up_votes":1,"down_votes":0,"body":"It's {{champion:44}}, Aurelian Sol's VO has confirmed this.","replies":[]}]}]}