{"poster":"Zoupic","date":"2018-04-19T06:35:32.442+0000","title":"Dale Riot ya no tenes excusa para Arreglar por completo este servidor","subforum":"Charlas Generales","up_votes":2,"down_votes":19,"body":"Dale Riot ya no tenes excusa para Arreglar por completo este servidor,LAS siempre fue unos de los peores server no solo por la cuminidad si no por la mierda de server que es por que se cae siempre anda mal te desconecta ect,cuando va a llegar el dia en que lo arreglen? estamos en 2018 y todabia no lo pueden arreglar? GG riot los felicito por la mierda de server que tenemos los Latinos !!  (LAS).","replies":[{"poster":"Yitán","date":"2018-04-19T06:48:23.262+0000","up_votes":4,"down_votes":0,"body":"yo no se como no te permabanean en el juego, dudo mucho que seas callado ingame","replies":[{"poster":"Faras","date":"2018-04-19T12:12:20.467+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Yitán,realm=LAS,application-id=v7qsfXsE,discussion-id=qvABhPsX,comment-id=0000,timestamp=2018-04-19T06:48:23.262+0000)\n>\n> yo no se como no te permabanean en el juego, dudo mucho que seas callado ingame\n\nCuando dijo lo que es la peor comunidad, pense, \" vos sos parte el problema\". Porque es obvio que esto ingame es super flammer.\n\nReferente al juego, no se... capaz hay otros que son mejores. Pero si lo comparo con otros juegos online que he jugado, este gana por lejos en servidor y soporte.\nPero reitero, capaz que porque los otros que he jugado eran de lo peor, no se..","replies":[]},{"poster":"Zoupic","date":"2018-04-19T16:43:14.115+0000","up_votes":1,"down_votes":1,"body":"Tengo honor 4 jaja no creo que por ser flamer llegue a honor 4 pero we xD","replies":[]}]},{"poster":"AxElL93","date":"2018-04-19T12:32:43.646+0000","up_votes":1,"down_votes":0,"body":"la falla de desconexiones empezó recién en este parche jajajaj para decir \n\"cuando va a llegar el día en que lo arreglen? estamos en 2018 y todavia no lo pueden arreglar?\"\nno todo es perfecto cada juego tiene errores las cuales los estan haciendo lo imposible para areglarlo\ncon el problema de lag no es a todos para decir que el server esta mal\na mi me va bien \nasi que déjate de andar quejándote como mina","replies":[]},{"poster":"Hwaxinghz","date":"2018-04-19T10:31:02.014+0000","up_votes":1,"down_votes":0,"body":"Hace muchos meses que no tengo problemas con el server. Y eso que uso Arnet, best ISP in the world.\n\nNo se puede quejarse por un error que ocurre de vez en cuando, cuando siempre anduvo perfectamente bien.\n\nEvita quejarte de las cosas repentinas, es la primera vez en el año que falla algo realmente importante dentro de los servidores, el resto de problemas siempre fueron por ISP que cambian sus rutas o fibras de Otros ISP que se rompen, todo ajeno a Riot.","replies":[]},{"poster":"NLG Walter","date":"2018-04-19T06:48:29.246+0000","up_votes":1,"down_votes":0,"body":"Soy de argentina y creo que la ultima vez que tuvo problemas riot fue hace 7 meses, no me puedo quejar, anda perfecto, no existen hacks, no hay problemas fisicos en sus servidores, solo el routeo a veces se caga pero no es todo culpa de ellos, sino de los proveedores de internet.","replies":[]}]}