{"poster":"NoisyShoot","date":"2017-07-17T17:38:33.681+0000","title":"Gründung eines neuen Teams (Gold2+ gesucht : Support, Mid, Top, Coach)","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Wir suchen noch, wie ihr im Titel lesen k&ouml;nnt, noch einen Midlaner, einen Toplaner, einen Supporter und einen Coach.\nWir m&ouml;chte ein Team welches mehrmals die Woche trainiert, an Scrims und Turnieren teilnimmt und sich auch neben des Trainings oder der Team Aktivit&auml;ten generell sich gut versteht und auch mal eine Runde Duo spielt da man sich einfach gut versteht.\n\nTop: \nJungle: \nMid: P3-Spieler\nADC: \nSupport:\n\nWas ihr mitbringen solltet ist..\n- die Motivation das durchziehen zu k&ouml;nnen, man muss mehrmals die Woche sich die Zeit nehmen, genauere Zeiten werden vereinbart sobald das Team komplett ist.\n- ein Grundwissen was eure Position betrifft, also keine Leute die zum Spa&szlig; mal das in einem Team spielen wollen, ihr solltet eure Rolle mainen !\n- ein anst&auml;ndiges Mikro\n- die F&auml;higkeit Kritik zu &auml;u&szlig;ern aber auch welche anzunehmen\n\nSeid einfach nett und vor allem tilted oder flamed nicht, ein Team das sich gegenseitig flamed, bleibt nicht sehr lange bestehen.\nWenn ihr bis zu diesem Punkt noch am lesen seid, habe ich eventuell euer Interesse geweckt. Wenn dem so ist dann added mich einfach und wir gehen auf weitere Informationen ein.\nMfG Taktik Tiger&acute;s\n\nBei interesse einfach adde NoisyShoot","replies":[{"poster":"NoisyShoot","date":"2017-07-18T20:37:34.542+0000","up_votes":1,"down_votes":0,"body":"Also es sind noch für ein Zweites Team P2 und P3 Elo folgende Plätze frei:\n\n-Midlaner\n\n-Jungler\n\n-ADC\n\n\nWer Interesse hat bitte einfach in game adde\n\nManagement von Taktik Tiger´s","replies":[]},{"poster":"Tabi","date":"2017-07-18T19:41:02.771+0000","up_votes":1,"down_votes":0,"body":"Hi, wir sind Main Toplane P3 und Main Support P2. Ich hab dich geaddet. Würde mich freuen, wenn du dich bei mir melden würdest. :)","replies":[]},{"poster":"MasterShaiLi","date":"2017-07-18T18:16:59.151+0000","up_votes":1,"down_votes":0,"body":"Hey Leute :D\n\n- Freundlichkeit ist natürlich selbstverständlich. :)\n- Elo bin ich aktuell Gold 3\n- Teamfähigkeit habe in diversen vielen Teams bereits gespielt und selbst Teamleiter gewesen.\n- Zuverlässigkeit sagt mir den Tag und ich bereite mich vor :)\n- Pünktlichkeit? Ich hoffe ihr seit nicht zu spät :P\n\nIch spiele ADC seit 3-4 Monaten nun schon aktiv und ich habe im Laufe der Jahre seit ich LoL Spiele nun jede Rolle ausprobiert. Da kam ich dann zu entschluss nach meiner 10 Winstreaks mit ADC in Folge das mir im Vergleich zur Midlane, ADC sehr taugt und vor allem viel Spaß dran habe. Neben bei bin ich Coach bei einer Community und anaylisiere oft meine eigenen Replays.\n\nFalls ihr Interesse habt erreicht ihr mich natürlich ingame: **MasterShaiLi**\n\nAlso haut rein {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Vladimirus","date":"2017-07-17T21:25:50.162+0000","up_votes":1,"down_votes":0,"body":"Nabend,\n\nwürde Toplane oder Support wählen sofern die noch offen sind.\nWollte noch fragen, sofern das Restliche Team nichts dagegen hat kann man auch Flex spielen oder?^^","replies":[]},{"poster":"FeS Finnsterr","date":"2017-07-17T18:16:53.478+0000","up_votes":1,"down_votes":0,"body":"Sind aktuell noch die Rollen für Support und Midlane open?","replies":[]}]}