{"poster":"SMR16","date":"2019-09-04T04:17:53.940+0000","title":"Mi pc se quemó antes de poder jugar","subforum":"Charlas Generales","up_votes":11,"down_votes":1,"body":"Buenas noches comunidad, hoy les traigo mi tristes historia.\r\nComo era normal iba a ponerme a jugar cuando de repente mi apartamento se quedó sin electricidad provocando un apagón momentáneo, haciendo que mi pc se apagará forzosamente y así quemando mi pc.\r\nEs triste ya que no tengo el dinero para comprar otra y justo estaba en promo a bronce 2... Si no es la gran cosa,pero de hierro 4 hasta bronce 2 para mi fue un muy buen avance.\r\nPero bueno tendré que ver como logró jugar a este maravilloso juego :c","replies":[{"poster":"PasoPackXHonores","date":"2019-09-04T06:28:48.290+0000","up_votes":2,"down_votes":1,"body":"Lo mas probable es que solo se te haya quemado la fuente.","replies":[{"poster":"SMR16","date":"2019-09-04T15:52:18.866+0000","up_votes":1,"down_votes":1,"body":"Lo peor que no es la fuente,ya que la probé y anda perfecta :/","replies":[{"poster":"Soul Of Cinders","date":"2019-09-04T18:35:14.381+0000","up_votes":2,"down_votes":1,"body":"F","replies":[]}]}]},{"poster":"Tilt247","date":"2019-09-04T05:25:28.662+0000","up_votes":1,"down_votes":0,"body":"Entra al grupo \"Compra y Venta de \"Hardware\" Argentina\" y manguea una fuente generica que funcione, seguro alguien va a tener para regalarte una, no necesita una fuente wow tu pc para funcionar, si fue eso lo que se quemo..","replies":[{"poster":"SMR16","date":"2019-09-04T15:54:03.508+0000","up_votes":1,"down_votes":0,"body":"Ya anduve viendo componente por componente y lo que se quemó por desgracias fue el procesador,la fuente,la ram y el resto de las cosas andan perfecto","replies":[]}]},{"poster":"Del0reaN","date":"2019-09-04T10:38:10.392+0000","up_votes":1,"down_votes":1,"body":"Los microcortes son lo peor. No te dan tiempo de hacer absolutamente nada y, al volver, siempre lo hace con un pico de tensión. Cuando se corte la luz, si te da tiempo, desenchufa todo.\n\nAh, y lo más probable es que sea lo que te dijeron. No es muy caro el arreglo y hasta lo podés hacer vos mismo en caso que consigas alguna regalada o puedas comprar una fuente nueva.","replies":[{"poster":"SMR16","date":"2019-09-04T15:53:12.103+0000","up_votes":1,"down_votes":0,"body":"Concuerdo contigo,es de lo peor\nY sobre lo otro,la fuente no es,ojalá lo fiera,la probé y anda perfecto :/","replies":[]}]},{"poster":"Tilt247","date":"2019-09-04T04:47:33.154+0000","up_votes":1,"down_votes":0,"body":"Que componentes tiene tu pc?","replies":[{"poster":"SMR16","date":"2019-09-04T04:54:18.212+0000","up_votes":1,"down_votes":0,"body":"Una mother Asus e35m1, con un procesador amd e350, la gráfica integrada es una ati radeon 6310, 4gb de ram y un disco de 500 gb","replies":[]}]}]}