{"poster":"TheFalc","date":"2015-10-04T19:53:03.257+0000","title":"Que pasa con el Honor?","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Ultimamente no veo a nadie dar honor, osea, darle *rival honorable* a un enemigo, *amigable*, *atento*, o *compa&ntilde;erismo* a un aliado. Yo casi siempre doy, y ademas cuando me dieron el Emblema de Compa&ntilde;erismo, casi lloraba, habia sido la meta de mi a&ntilde;o, apenas siendo lv 16. Porfa, gente, sigan dando honor, a todos nos hace feliz ser reconocidos. o no?","replies":[{"poster":"artistafracasado","date":"2015-10-04T20:09:14.652+0000","up_votes":6,"down_votes":0,"body":"Se da cuando se merece.","replies":[{"poster":"XxZYCOxX","date":"2015-10-05T09:29:22.684+0000","up_votes":2,"down_votes":0,"body":"no, se da cuando eres lvl bajo y recien estas aprendiendo a jugar, luego te crees pro y el ego no les deja reconocer las habilidades del rival.","replies":[]}]},{"poster":"pandi heather","date":"2015-10-05T03:59:30.778+0000","up_votes":3,"down_votes":0,"body":"antes se daba mucho honor ahora ultimamente ya no, es mas la concentracion por reportar que por dar honor.\nhe visto suports hacer muy buenas jugadas para el adc y luego por un solo error en ves de honor vas report por un 0/2/13","replies":[]},{"poster":"ll Leoh ll","date":"2015-10-04T20:04:10.573+0000","up_votes":4,"down_votes":1,"body":"de que sirve si gana el que menos afk o troll tiene xD\n\nahora enserio creo que no se da porque gastan tiempo en dar algo que no les afecta en nada al que lo envía, eso pienso yo.","replies":[{"poster":"Elwinhg","date":"2015-10-05T01:29:03.740+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ll Leoh ll,realm=LAS,application-id=v7qsfXsE,discussion-id=Np3ffAa7,comment-id=0000,timestamp=2015-10-04T20:04:10.573+0000)\n>\n> de que sirve si gana el que menos afk o troll tiene xD\n> \n> ahora enserio creo que no se da porque gastan tiempo en dar algo que no les afecta en nada al que lo envía, eso pienso yo.\n\nMe hiciste cagar de risa y dijiste la verdad, hoy pude jugar 3 partidas y en las 3 hubo hubo afks.... lamentable","replies":[]}]},{"poster":"HiKewne","date":"2015-10-05T01:53:50.496+0000","up_votes":2,"down_votes":0,"body":"Supongo que es porque el hecho es reconocer a quienes realmente lo merecen, y no a aquellos que sólo no insultaron. Todos tenemos el DERECHO de disfrutar de una partida tranquila, pero sólo el privilegio de que en esas partidas encontremos gente merecedora de tales honores. Quienes quieran reconocerlo y quienes no, depende de ellos.","replies":[]},{"poster":"tomfunes","date":"2015-10-04T23:06:33.673+0000","up_votes":2,"down_votes":0,"body":"Creo que debería haber un sistema que evalúe el honor dependiendo de quien lo da. Yo doy poco honor, cuando lo doy es realmente merecido. Tengo un par de reglas:\n\n1- No me importa si carreó la partida, no doy honor por \"buen jugador\". Si carreó pero flameó, tanto al team contrario como al mio, se come denuncia.\n\n2- El honor lo reservo a aquellos que fueron \"rivales honorables\" (caballeros tanto en la victoria como en la derrota), amigables (un tipo que no importa como fue la partida, le puso onda e intentó pasarla bien), atento (aquel que  si vio que estabas haciendo algo mal, en lugar de flamear te pregunta si te molesta que te de un concejo y te ayuda mejorar) y compañerismo (aquel que \"dio la vida\" por el team, el jg que te gankeo varias veces cuando estás perdiendo la linea, el mid que no tiene problemas en dejar su linea para ayudar en otra, el top que tiró un teleport para salvar a un compañero, el adc que no abandona al team completo por un par de minions o una kill, el supp que wardea bien y se cansa de salvarle el culo al resto del team, etc).\n\nDebería ser como las denuncias, si denunciás todas las partidas a cuatro jugadores, el sistema le da menos validés que a aquel que denuncia cuando realmente es merecido.","replies":[]},{"poster":"Runth","date":"2016-01-04T08:33:32.364+0000","up_votes":1,"down_votes":0,"body":"honor? se come? sabe a leche? {{champion:31}}","replies":[{"poster":"TheFalc","date":"2016-01-05T11:21:49.317+0000","up_votes":1,"down_votes":0,"body":"...","replies":[]}]},{"poster":"Canstainer","date":"2016-01-04T05:42:53.980+0000","up_votes":1,"down_votes":0,"body":"En las nadie da honor como en otras regiones.\nAca está más cargado instular al equipo rival que felicitarlo.\nIzi mid, izi bot, izi todos. \neso es lo unico que te van a dar aca.\n\nA todo esto aun existen moderadores en este foro ?","replies":[{"poster":"TheFalc","date":"2016-01-05T11:20:05.639+0000","up_votes":1,"down_votes":0,"body":"...","replies":[]}]},{"poster":"Sir Crucifix ","date":"2015-10-04T22:09:29.535+0000","up_votes":1,"down_votes":1,"body":"Yo no le voy a dar honor a nadie , salvo aquel que vaya taric top.. que le tengo que dar honor a un papafrita que usa un Darius toca 2 botones y ah Como esta roto se cree que es un buen jugador","replies":[{"poster":"LanaDelReyVEVO","date":"2015-10-04T22:12:11.177+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir Crucifix ,realm=LAS,application-id=v7qsfXsE,discussion-id=Np3ffAa7,comment-id=0002,timestamp=2015-10-04T22:09:29.535+0000)\n>\n> Yo no le voy a dar honor a nadie , salvo aquel que vaya taric top o poppy top\n\nLa otra ves un taric top nos carreo, y  poppy full ad esta rota","replies":[{"poster":"Platinum491","date":"2015-10-04T23:25:55.650+0000","up_votes":1,"down_votes":0,"body":"Full AD? Full Ap baby","replies":[]},{"poster":"Nozarkanoz","date":"2015-10-04T22:42:57.133+0000","up_votes":1,"down_votes":0,"body":"PF!!! \n{{champion:17}} + {{item:3077}}  = carrito","replies":[{"poster":"Nozarkanoz","date":"2015-10-04T22:44:18.564+0000","up_votes":1,"down_votes":0,"body":"P.D.T: Si quieres ganar antes del minuto 20 compra  2X {{item:3077}}  para tener doble poder  y que tus enemigos tiemblen ante el poder de temacia","replies":[]}]}]}]},{"poster":"CJ14","date":"2015-10-05T04:48:49.184+0000","up_votes":1,"down_votes":2,"body":"Pedir honor es deshonroso","replies":[]}]}