{"poster":"TheFalc","date":"2017-05-21T16:59:41.143+0000","title":"[Concurso de Conceptos Campeones] Sladne, el traidor de Naciones","subforum":"Creaciones de la comunidad","up_votes":8,"down_votes":4,"body":"Hola gente, vengo a publicar mi concepto retocado para [el concurso de Excidar](https://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/UgalwYBu-concurso-de-campeones):\nEste concepto iria a la categoria de Top Laner AD\n________\nLore/ Historia:\n\n> Sladne nacio en Demacia, fue soldado en ella, muy reconocido por su habilidad para usar espadas en ambas manos.\n> Participo en todas las batallas de su nacion como le fue posible y logro completar misiones en solitario que muchos creian que era una expedicion suicida, saliendo sin ningun rasgu&ntilde;o.\n> \n> La gente lo recibia a gritos cuando volvia de sus misiones. Debido a esto, poco a poco, Sladne aumento su ego, y empezo a sentir quenunca daba su maximo potencial. Sentia que seguir en Demacia solo le generaba un techo para su desarrollo como mercenario. Ide&oacute; un plan para simular su muerte en su siguiente expedicion, pero fallo en algo. Lo habian asignado en una mision normal, muy simple.\n> \n> Un dia lluvioso en gran parte de Runaterra, la falsa noticia de su muerte llego a Demacia. Para entonces, Sladne ya estaba en las entradas de la gran Noxus.\n> \n> Sladne vio en cada una de sus batallas contra Noxus, un potencial peligro, un verdadero riesgo de muerte. Sintio que Noxus era el lugar indicado donde podia aumentar su poder y capacidad.\n> \n> El primer paso que le dio su entrenamiento en Noxus fue el encadenar una de sus espadas a su brazo. Sladne no dudo, sabia que Noxus lo iba a hacer poderoso, y encadeno su espada con la que mas mato a un brazalete.\n> \n> Asi, aprendio nuevas tecnicas de pelea, que le dieron la satisfaccion que Demacia no le daba. Se sentia fuerte y poderoso, capaz de vencer a un ejercito entero. Pero luego de sus nuevas misiones, mas secretas y sangrientas, no recibia los alagos que tanto amaba, no veia un felicitacion, lo trataban como a un soldado mas y Sladne sintio que sus mayores lo subestimaban.\n> \n> Lleno de ganas de destacar, Sladne logro infiltrarse en una batalla contra Demacia, e intento hacer lo posible para demostrar a sus superiores que el era el mejor. Salto a la linea delantera, pero lo que sucedio no fue lo que &eacute;l planeo. Vio que las tropas enemigas a sus anteriores compa&ntilde;eros, Sladne no pudo hacer nada. Se quedo inmovil, vio rostros familiares, conocidos, gente de su nacion que lo admiraba. Masacrarlos seria abandonar los alagos que tanto extra&ntilde;aba.\n>\n> En un acto repentino, Sladne desarmo a su general, dejandolo indefenso y vulnerable. Paso seguido escap&oacute;, dejando que las tropas demacianas tomen el credito de su captura.\n> \n> Sladne reconocio que extra&ntilde;aba a su nacion, pero que volver era demostrar que infringio el codigo de honor demaciano. Por lo que decidio vagar por Runaterra, sin rumbo, con el unico objetivo de mejorar sus artes belicas y encontrar de alguna manera el perdon de Demacia.\n\n________\nDescripcion:\n\n> Sladne es un mercenario ex demaciano, ex noxiano. Era muy engreido y arrogante, ya que su habilidad con dos espadas deslumbraba a los demacianos.\nLleva un ropa negra con un sobretodo negro. La espada que usa con la mano izquierda es de color Blanco y la que usa con la mano derecha es negra y esta encadenada a un brazalete.\nPerdon, me gusta hacer estas cosas:\n###Trivia: Saldne viene del Macedonio, Zaludno, Engreido\n\n______\nIn-Game (habilidades, estilo de juego, build, maestrias convenientes, etc): (vamos con lo dificil)\n\n> Pasiva: tiene dos espadas, una de ellas es negra y est&aacute; encadenada a su mu&ntilde;eca, mientras que la otra es blanca y m&aacute;s filosa. Cada ataque b&aacute;sico o habilidad intercambia de espada, as&iacute; intercambiando su conjunto de habilidades. Se indica en la barra de vida la espada que usar&aacute; despu&eacute;s. La bonificaci&oacute;n de velocidad de ataque se reduce en un 70%. Que un enemigo &eacute;ste cortado significa que cuando reciben da&ntilde;o proveniente de Sladne, consumen la marca y reciben da&ntilde;o f&iacute;sico adicional. Mientras m&aacute;s tiempo perdure la marca, m&aacute;s da&ntilde;o se le causar&aacute;, siendo como m&aacute;ximo 0~45% despu&eacute;s de 3 segundos. Adem&aacute;s, si la marca se consumi&oacute; con una habilidad que &quot;corte&quot;, no se aplicar&aacute; otra marca, a menos que lo aclare.\n##ANALISIS RAPIDO:\n* Utilizar habilidades o ataques basicos intercambian tu kit de habilidades\n* Algunas habilidades &quot;Cortan&quot; a los enemigos, es un debuf que dura un tiempo, la marca se activa cuando Sladne usa una habilidad o ataques sobre el marcado, causando da&ntilde;o adicional, ese da&ntilde;o aumenta hasta un 45% mientras mas tiempo estuvo la marca. Esta marca no dura mucho.\n* Se reduce tu velocidad de ataque adicional. &iquest;Por que?. Porque si tenes una velocidad de 2.5, es casi imposible poder utilizar tus habilidades correctamente, por lo que intento retirar la idea de armar velocidad de ataque con este campeon.\n* Se indicaria en la barra de vida que espada toca, y por ende que habilidades tiene a mano, de la siguiente manera:\nhttps://image.ibb.co/gugxNa/barras_de_vida.png\n________\nQ espada negra: el siguiente ataque b&aacute;sico causa da&ntilde;o adicional y ralentiza por un porcentaje igual a la mitad del porcentaje de vida faltante del enemigo. Si el objetivo es un campe&oacute;n cortado, tiene rango incrementado  y duplica la cantidad de ralentizaci&oacute;n.\n>\nQ espada blanca: lanza una estocada, atravesando y causando da&ntilde;o a todas las unidades. Corta a los campeones y si uno de los objetivos fue un campe&oacute;n previamente cortado, causa da&ntilde;o adicional a todos los objetivos y gana velocidad de movimiento.\n##ANALISIS RAPIDO:\n* La Q del kit de la espada negra es un reset de autoataque. Al seleccionar a un campeon cortado, el rango se incrementa y lo atacaras cuando estes en rango de ataque. Si lo deselecciona, y selecciona a otra unidad, se reduce el rango.\n* La Q del kit de la espada blanca es una habilidad como la W de Fiora, solo que no ignora control de masas y causa da&ntilde;o fisico, ademas de las caracteristicas ya mencionadas\n_______\nW espada negra: por un breve periodo de tiempo, no puede atacar. Luego de ese tiempo, empuja a los enemigos que est&eacute;n encima de &eacute;l (rango menor al de ataque). Si logra empujar a alguien, sus dos siguientes ataques cortan al enemigo.\n>\nW espada blanca: pasiva con enfriamiento. Este se reduce cada vez que se intercambie de espada. (El enfriamiento es considerablemente alto). Al estar disponible, el siguiente ataque b&aacute;sico (con la espada blanca) hacia un campe&oacute;n enemigo hace que lo atraviese y se coloque a espaldas de este.\n##ANALISIS RAPIDO:\n* Aunque esta habilidad traiga control de masas a la mesa, la W de la espada negra esta dise&ntilde;ada para contrarrestar a enemigos que tengan movilidad ofensiva, mas que para utilizarla ofensivamente. Por ejemplo, si utilizas esta habilidad porque el Lee Sin enemigo te acerto la Q, y este la utiliza nuevamente, cancelaras el da&ntilde;o porque el desplazamiento se niega con control demasas pesados. (Piensenlo como una W de poppy pero que requiere un correcto uso del tiempo)\nhttps://image.ibb.co/ij3Bha/WEN.png\n* Es como la W de Kled, y su tiempo en enfriamiento es reducido cada vez que se cambia de kit. La idea es que el jugador este incentivado a dar constantemente sus ataques basicos, mas que planear una jugada, esperando con el kit con el que quiere iniciar esta jugada.\n_______\nE espada negra: lanza brucamente su espada negra hacia una direcci&oacute;n, causando da&ntilde;o menor por cada enemigo impactado. Ademas, ralentiza a los objetivos cortados. Esta al caer, sera atraida lentamente para volver a tu mano, mientras esto suceda, solo contaras con el kit de la espada blanca.\n>\nE espada blanca: blande la espada en un semic&iacute;rculo y corta a los campeones. Si dio a un campe&oacute;n cortado, no rota esta habilidad y se podr&aacute; relanzar en los siguientes 3 segundos, para causar m&aacute;s da&ntilde;o y cortarlo nuevamente. Al lanzarse por segunda vez, vuelve a la rotacion normal. Si lanza otra habilidad o un ataque b&aacute;sico, el relanzamiento se cancela y vuelve a la rotaci&oacute;n normal.\n##ANALISIS RAPIDO:\n* Lanza la espada como una armp&oacute;n con su E de la espada negra\nhttps://image.ibb.co/jsCbFv/EEN.png\n* Nada que aclarar sobre la segunda\n_______\nR espada blanca: no rota de espadas. da una voltereta en el aire y cae al lado de un campe&oacute;n seleccionado (no lo persigue si este se mueve de lugar). Si se usa Q en el medio, esta se ejecutar&aacute; al final del movimiento. Si el siguiente ataque b&aacute;sico es contra ese campe&oacute;n, lo corta. Si ya estaba cortado, el enfriamiento de ve reducido un poco.\n>\nR espada negra: empieza a revolear su espada negra para lanzarla y luego tirar de ella para que vuelva. Cuanto m&aacute;s tiempo haya revoleado la espada, a mayor rango se la podr&aacute; tirar. Da&ntilde;a f&iacute;sicamente todas las unidades atravesadas en la ida, y se ancla campeones o terreno en la vuelta. Si el enemigo esta en el extremo de la cadena, el que tenga m&aacute;s velocidad arrastrar&aacute; otro, restando ambas velocidades. Reactivar la habilidad hace que Saldne se lance hacia la ubicaci&oacute;n de donde est&eacute; anclado. Si se ancla en terreno, el enfriamiento es drasticamente reducido. El efecto dura 2.25 segundos sobre el enemigo y mientras el efecto perdure, esta habilidad no rota, y s&oacute;lo dispondr&aacute;s de la espada blanca. Si fue usado en un enemigo, se pone en un enfriamiento compartido, sin depender del kit.\n##ANALISIS RAPIDO:\n* La seleccion es como la E de Katarina, osea, podes seleccionar a un campeon enemigo y a la vez, en que zona cercana a el queres caer, solo que el radio del circulo de la seleccion (no el rango de la habilidad) es mas grande y te permite caer en mas puntos cercanos al enemigo\n* Esta habilidad antes del retoque estaba en la Q, era demasiado fuerte jajaj. Es como un gancho de Kled, mezclado con la definitiva de Poppy con una mezcla de la Q de Nautilus, pero no con el primer terreno que toca, sino a la vuelta, y eso te permite atravesar terreno, no acercarte a este.\nhttps://image.ibb.co/gM7F8F/REN.png\n_________\n* Rol: Seria un Luchador (Asesino), segun el genero de clases y subclases nuevo, Sladne ser&iacute;a un embestidor, osea, un campeon con jugabilidad parecida a la de Fiora, Yasuo y Riven\n* Build: La Fuerza de la Trinidad le puede ir muy bien, como tiene 6 habilidades basicas, puede activar el Brillo facilmente; Algun item de letalidad; Algun item ofensivo-defensivo como Sterak, Angel Guardian si estas muy por detras, Malmortius, etc\n* Maestr&iacute;a: Fervor de Combate seria muy eficaz con &eacute;l, pero si quiere una fase de lineas m&aacute;s segura, puede utilizar las Tenazas del Inmortal o para un early m&aacute;s abusador el Decreto del Se&ntilde;or de la Tormenta\n* Mec&aacute;nica: la mecanica es cortar al enemigo y ver que, a trav&eacute;s de ello podes con la QEB pushear m&aacute;s facil la linea, con la QEN pokearlo y acestarle skillshots m&aacute;s facil, con EEB causarle bastante da&ntilde;o, y la REB te da movilidad con enfriamiento reducido\n* Pros: Buen duelista, control de masas liviano y pesado, dominio de la linea si se juega bien\n* Cons: complicado de jugar, no tiene da&ntilde;o magico, no tiene buena movilidad para escapar, fragil si focuseado\n\n______\nBueno, espero que les haya gustado, y suerte a todos en el concurso","replies":[{"poster":"Ingratitud","date":"2017-05-21T17:43:55.584+0000","up_votes":3,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"SV 001","date":"2017-05-25T22:26:35.961+0000","up_votes":2,"down_votes":0,"body":"Me encanto,muy buena historia,habilidades y aspecto original.Sigue asi y suerte en el concurso.","replies":[{"poster":"TheFalc","date":"2017-05-26T10:34:44.687+0000","up_votes":1,"down_votes":0,"body":"Gracias e igualmente","replies":[]}]},{"poster":"Nombre ofensivo","date":"2017-05-21T17:03:01.265+0000","up_votes":2,"down_votes":1,"body":"Macri gatito","replies":[{"poster":"TheFalc","date":"2017-05-21T17:04:02.325+0000","up_votes":1,"down_votes":0,"body":"{{champion:107}}","replies":[]}]},{"poster":"BORTx","date":"2017-05-21T18:44:20.444+0000","up_votes":1,"down_votes":0,"body":"mejor nerf irelia... xD","replies":[]}]}