{"poster":"LemonNade Männy","date":"2015-06-03T04:48:38.040+0000","title":"Verbindungsaufbau scheitert bei einem abgebrochenem Spiel","subforum":"Hilfe & Support","up_votes":5,"down_votes":1,"body":"Mein Kollege wollte ein Game starten, kam auch ins Spiel und nach 7 min Spielzeit hat sich sein PC aufgehangen!\r\nEr wollte ganz normal Reconnecten und bekommt nun die Meldung, dass er aufgrund von Verbindungsproblemen nicht mehr ins Game kommt.\r\nSeine Runde ist mittlerweile auch vorbei aber trotzdem &auml;ndert sich sein Fenster nicht und das Spiel m&ouml;chte ihn weiterhin dazu dr&auml;ngen zu reconnecten.\r\n- Client Neustart \r\n- Router Neustart\r\n- PC Neustart\r\nalles hat nichts gebracht!\r\n\r\nKann jmd. einen n&uuml;tzlichen Tipp raushauen","replies":[{"poster":"Gruppenhase","date":"2015-06-03T10:25:36.749+0000","up_votes":2,"down_votes":1,"body":"ich komme auch nicht mehr ins Spiel, dieses Mal war mein Ping normal, aber es lässt sich keine Verbindung aufbauen. In 2 Games davor hatte ich einen Ping von knapp 400 und der Verbindungsaufbau war innerhalb weniger Sekunden wieder da.","replies":[]},{"poster":"Rhetoteles","date":"2015-06-03T09:07:10.707+0000","up_votes":2,"down_votes":1,"body":"Sind die Drophacks, da kannst du dann nicht mehr connecten :/","replies":[]},{"poster":"KingLordLars","date":"2015-06-04T20:37:09.796+0000","up_votes":1,"down_votes":0,"body":"Gleiches auch hier, kommt in letzter Zeit häufiger mal vor, was ist los Riot??","replies":[]},{"poster":"Sheldon23","date":"2015-06-03T22:41:02.940+0000","up_votes":1,"down_votes":0,"body":"Rito very bad!!!\ndas ist nicht das erste mal das mit das passiert...\nich bin ingame im rank und auf einmal irgentwann heißt es ich habe verbindungsprobleme was aber nicht stimmt.  inernetverbindung ist immer stabil      habe router mehrmals neugestartet    das spiel immer versucht zu starten... ging nicht... jedes mal die selbe meldung...  bis das game zu ende ist dann kann ich mich wieder einloggen...   im verlauf steht dann verlassen  und verlier sehr viele punkte...  fair rito?  l2p rito!!   50% verlorenen games waren disconnects      mal konnte ich wieder reinkommen aber dann war das spiel schon verloren weil es 4 vs 5 war...   is halt von patch zu patch immer das selbe  und ihr könnt nix machen...   habe sogar mehrmals das spiel neu geladen...     mei rechner ist ein gamer pc   der hält lol locker aus... bitte rito... l2p","replies":[]},{"poster":"Carlsberg5","date":"2015-06-03T19:46:16.043+0000","up_votes":1,"down_votes":0,"body":"Gerade auch, plötzlich ein total hoher Ping und ich war draußen. Beim Reconnecten kommt die Meldung, dass meine Firewall mich daran hindert, beizutreten.\nDANKE! \n..und das in nem ranked.... das heißt dann wohl 9 mal report wegen leave. danke riot","replies":[]},{"poster":"Obezyana","date":"2015-06-03T19:11:29.746+0000","up_votes":1,"down_votes":0,"body":"Same shit over and over again","replies":[]},{"poster":"Di3KLiNg3","date":"2015-06-03T17:26:35.854+0000","up_votes":1,"down_votes":0,"body":"Ich hab das gleiche Problem. \nRanked gestartet und direkt nach der championauswahl wars auch schon vorbei...\n\nschon x mal versucht zu reconnecten. Keine reaktion!\nMeine Internetverbindung ist 1a. Daran liegt es ganz sicher nicht!","replies":[]},{"poster":"Snowgaze","date":"2015-06-03T10:29:24.405+0000","up_votes":1,"down_votes":0,"body":"Hallo, bei mir ist es im Ladescreen passiert. Beim reconnecten kommt die Meldung, dass mit meiner Firewall-Einstellung etwas nicht stimmt. Zuvor hat alles ganz normal funktionierten. Ich find es scheiße ganz ehrlich. Riot sollte daran arbeiten, sowas zu verhindern.","replies":[]},{"poster":"Darnell","date":"2015-06-03T12:11:16.657+0000","up_votes":1,"down_votes":8,"body":"***","replies":[{"poster":"xXBrotbärXx","date":"2015-06-03T14:21:56.040+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LauchiDream,realm=EUW,application-id=7hciEY9w,discussion-id=gBiIFfmm,comment-id=0003,timestamp=2015-06-03T12:11:16.657+0000)\n>\n> Hallo Liebe LoL Community,\n> \n> ich möchte euch gerne unseren League of Legends Public Teamspeak 3 Server vorstellen, auf unseren Server ist jeder herzlich willkommen!\n> \n> 9 Gründe, mit uns im TeamSpeak zu sein!\n> \n> Aktive & nette Community\n> Unser TS beheimatet nette Mitglieder in einem freundschaftlichen Umfeld!\n> \n> TS mit Wohlfühlklima\n> Bei uns brauchst du dich nicht über unfreundliche und beleidigende Leute ärgern. Wir legen sehr viel wert auf einen reifen und netten Umgangston.\n> \n> Aktives Mod-Team\n> Ein Freundliches Team ist immer für dich verfügbar.\n> \n> Multi-Gaming TS\n> Neben LoL-Spielern findest du bei uns auch Spieler für andere Games.\n> \n> 200 Slots\n> Genügend Platz für alle. Bringe gerne deine Freunde mit!\n> \n> Spielen mit Freunden\n> Wir bieten neutrale Channels, damit du dich mit Bekannten in einer kleinen Gruppe zurückziehen kannst.\n> \n> Eigener Channel\n> Bei uns kann und darf sich jeder User ein Channel für sich oder sein Team erstellen.\n> \n> 24/7 online\n> Der TS-Server ist selbstverständlich rund um die Uhr online.\n> \n> Keine Kosten\n> Natürlich ist alles komplett kostenlos für unsere Nutzer.\n> \n> Die Teamspeak Daten\n> \n> IP: adl.teamspeak.me (178.33.37.216:9998)\n> \n> Mit freundlichen Grüßen\n> ADL Community\n\nnächster themenfremder Beitrag.\nBenutzt doch einfach einen Extrabeitrag\n\nGruß SLICER{{champion:34}}","replies":[]}]}]}