{"poster":"00shots00","date":"2019-04-02T03:54:05.476+0000","title":"ill be updating my riot support card in this discussion","subforum":"Player Behaviour","up_votes":1,"down_votes":2,"body":"00SHOTS00\r\nApril 2nd 2019, 2:52:34 pm\r\nhttps://www.leagueofgraphs.com/summoner/oce/oceshots\r\n\r\nhttps://www.leagueofgraphs.com/summoner/oce/00shots00\r\n\r\nThose links are for the last 8 games i played last night.\r\n\r\nThe 8-14 trolls in those games are the result for my out-burst and because i said something this account that i have spent well over $10,000.00 on is now perma banned..\r\n\r\nIs this league of legends now? you guys care more for things said than peoples actions but even with a request you wont ban chat for people who are aware of what they are like?\r\n\r\nSo explain this, ATLEAST explain this for me - how am i meant to react after 8 games of torture? \r\n- i had a break \r\n- i ate \r\n- i went to the toilet \r\n- i laid down with my partner \r\n- i tried everything\r\n\r\nbetween those games and you want made me tick the box (If you 1) have absolutely no negativity in your reform card, 2) would like more information on how to deal with others' abusive behavior and tips to avoid tilting, or 3) would like to better understand what sort of behavior can get you a penalty and why, you're in the right place!) - explain how i am not meant to tell someone they are dumb when i've tried everything else and wasted all my time.\r\n\r\nfor someone who has spent well and truly over the amount, to have all of their accounts treated like shit since I've verified them all with 1 email is such a poor act on a business behalf. call me paranoid but those 8 games are clear as day that you guys have put me with trolls and the rest only.\r\n\r\ni have reported them, i have tried being nie, what else am i to do riot?","replies":[{"poster":"Ninox","date":"2019-04-02T07:00:44.081+0000","up_votes":4,"down_votes":1,"body":"- Disable your enter key while in game.\n- Drag your chat off-screen.\n- Mute everyone at the start of the game.\n- Stop worrying about what other people (who you can't control) are doing, and worry about your own play.\n- Play games that aren't ranked sometimes so you aren't constantly in high stakes matches.\n- Put less emphasis on winning, and more on improving.","replies":[{"poster":"00shots00","date":"2019-04-02T09:19:08.978+0000","up_votes":1,"down_votes":3,"body":"$10,000.00 and i have to disable MY enter key when i can get the company i've paid money to, to do a very simple thing while they make pointless game ruining patches every 2 weeks..... hmmmm \n\ndont know how to do that\n\n\"stop worrying about...\" seras don't be a typical female man just read and keep knowledge with what you just read mate... jesus YIKES! i don't worry until we're at our tier 3 towers getting ass fucked just because!?\n\ni have a new account lvl 26 \"crazedshots\" try again sweetheart \n\nok.... soooo somehow go to a trollers house and hang him ? 8 games mannnnnnnn read what you are replying to!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! fuck!!!!!!!!!!!\n\nyou should change your name to serasbrickfuckingwall","replies":[{"poster":"Ninox","date":"2019-04-02T14:15:16.594+0000","up_votes":4,"down_votes":1,"body":"Do you expect your boss to turn off your emails because you can't think a bit about how you respond to them? Reform is encouraged, but at the point of perma-ban the system isn't there to hold your hand, it's there to stop you badly affecting other players.\n\nThe rest...well you lost me, but it doesn't seem there's any value in responding so, goodnight I suppose.","replies":[{"poster":"Outis","date":"2019-04-03T05:54:32.814+0000","up_votes":1,"down_votes":1,"body":"so if it's more about not affecting other players then the best way is to mute their account rather than ban their account.... (if their behaviour is largely chat based)\n\nthis person says they spent 10k (probably an exaggeration but still) on it so they are likely to continue playing it even if muted rather than just go onto a new account and be even angrier, now with nothing to lose. you yourself have said the numbers show that someone that is perm banned is very unlikely to change their behaviour long-term on a new account.","replies":[{"poster":"Ninox","date":"2019-04-03T06:29:26.065+0000","up_votes":4,"down_votes":0,"body":"But the data also supports that permanent chat bans aren't effective. They used to do infinitely stacking chat bans, they didn't work. All they accomplished was moving toxicity into spaces that are harder and take longer to moderate like gameplay.","replies":[{"poster":"00shots00","date":"2019-04-03T20:05:37.079+0000","up_votes":1,"down_votes":1,"body":"So when a person ASKS for it because i think i know myself better than ANY of you, \"stats\" from people who are not me effect if i do or do not ask for?","replies":[{"poster":"Ninox","date":"2019-04-04T11:57:34.996+0000","up_votes":4,"down_votes":0,"body":"Let's assume that is the case, and you wouldn't move your toxicity elsewhere. \n\nThe percentage of punished players is already small, the percentage of punished players asking for permanent chat bans is tiny, and the percentage of punished players asking for permanent chat bans for whom it would actually be an effective deterrent is minuscule. This is what the data supports.\n\nShould RIot be expected to create an exception in the system, and take the time and resources to apply a unique punishment, just for you, and at best a handful of other players?","replies":[]}]}]},{"poster":"TheDemonEmperor","date":"2019-04-03T09:13:04.613+0000","up_votes":1,"down_votes":0,"body":"He is an anomaly. This is not a simple, mute and fix; The guy clearly have issue in real life. His dreadful behavior is not going to be tempered by playing league in silient.\n\nAll case and point, he dont even understand why he got banned. To him, its all because the \"trolls\" held him back. Aslong as he justify his tantrum with reasons, this guy will never change.\n\nHey  00shots00. You're just a leaf on a tree in a forest. The ECOSYSTEM, is not gonna morph itself to accommodate you. Get that into your head, and decide what to do from there.","replies":[{"poster":"00shots00","date":"2019-04-03T20:06:27.199+0000","up_votes":1,"down_votes":1,"body":"Pot calling the kettle black here buddy :/ \n\ndidnt you just get your other comment removed?","replies":[{"poster":"TheDemonEmperor","date":"2019-04-05T07:19:33.946+0000","up_votes":1,"down_votes":0,"body":"> Pot calling the kettle black here buddy :/ \n\nPlease elaborate, i dont understand the correlation.\n\n> didnt you just get your other comment removed?\n\nYes it did get removed. What about it?","replies":[]}]}]},{"poster":"00shots00","date":"2019-04-03T20:56:50.980+0000","up_votes":1,"down_votes":2,"body":"Just an FYI,\n\ni never won skins, and i had a total of \n- 568 skins\n-125 chromas\n- 2 prestige skins (kai'sa+Aatrox)\n- ALL gemstone skins besides the cho gath one\n- paid for all the passes \n\na 3 year account so maybe not 10 but atleast $5-6,000.00","replies":[]}]},{"poster":"00shots00","date":"2019-04-02T20:22:25.116+0000","up_votes":1,"down_votes":4,"body":"ummmmm YES! - here's one retard! if you hire/employ a handicapped person do you think you're not required to cater to them after hiring them? fkn spastic don't try talking business.\n\nI replied to each of your points just didn't put them in point form... didn't think that was hard to workout o.O","replies":[{"poster":"Broken Scripts","date":"2019-04-03T01:17:31.101+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=00shots00,realm=OCE,application-id=T8eq2lFQ,discussion-id=7bcV58iN,comment-id=0000000000000000,timestamp=2019-04-02T20:22:25.116+0000)\n>\n> ummmmm YES! - here's one retard! if you hire/employ a handicapped person do you think you're not required to cater to them after hiring them? fkn spastic don't try talking business.\n> \n> I replied to each of your points just didn't put them in point form... didn't think that was hard to workout o.O\n\nImagine being so upset you have a sook on the forums and then abuse other people because you're a delirious Tyler1 wannabe. Your account was worth jackall, regardless. You were hardstuck gold, so Riot just purged your crap account and gave you the tools to start again.\n\nIf you are going to be toxic, own up to it and do not be a whiny toxic person.","replies":[{"poster":"00shots00","date":"2019-04-03T02:53:41.582+0000","up_votes":1,"down_votes":2,"body":"good ol \"riot Riot removes shit that they don't like\" \n\nanyways don't throw stone from glass houses. \n\nThis is my lowest account.\n\nRead what the post is before commenting.\n\nDon't tease on peoples rank when you play norms most the time.","replies":[]}]}]}]}]}]},{"poster":"Pikachoochoo","date":"2019-04-02T19:25:42.287+0000","up_votes":1,"down_votes":2,"body":"have you tried sharing/giving tips or switching ques or waiting 5min between matches to avoid getting paired with noobs/trolls again? o_o It's pretty much like babysitting when you're with trolls/noobs and you'll just have to counter build for their feeding, play style, and build or even just sticking to skill shot champs if you can't trust them at all. Riot are the parents xD O_O Riot are the parents T_T Poor Riot, think of all the messages >.&lt;","replies":[]},{"poster":"00shots00","date":"2019-04-02T20:38:23.248+0000","up_votes":1,"down_votes":1,"body":"JINXED PORO\nApril 2nd 2019, 11:03:41 pm\nHello,\n\nBuzzing through your ticket here.\n\nJinxed Poro scouting ahead for the Player Behavior Team.\n\nThank you for writing in and sharing your thoughts on this matter.\n\nOur systems reviews the behavior of all players equally but on an individual basis. So it doesn’t matter what someone else was doing or saying in your games as retaliation of any kind isn’t okay. If other players’ behavior needs to be addressed they will be reviewed as well and issued the correct punishment in time. Remember, you are responsible for your own behavior only and it doesn't matter who \"started it.\"\n\nThere is no need to let yourself get dragged down with negative players when you have the easy option of muting and ignoring them. Choosing to lash out at others in this manner isn’t acceptable and only makes the game experience worse for everyone else.\n\nKeep in mind, that even if you yourself do not find the use of certain words to be offensive, we take our feedback directly from our community.\n\nCalling someone \"retard\", \"%%%%\" or \"fkn wastes of air\" for example or dropping the \"F\" bomb are not tolerated in our community and it is considered negative behavior, as is making fun of other players (\"18:33] 00shots00 (Kled): and a root you virgin | 00shots00 (Kled): who actually wins in life? | 00shots00 (Kled): deffs not your mother | 00shots00 (Kled): she gave birth to you\").\n\nRegardless of the other player’s actions, this does not justify your own behavior. You alone are responsible for your actions within the game.\n\nI personally mute and report negative behavior and use pings and emotes to communicate with the team, focusing only on my own gameplay.\n\nThe break you took and the other activities were a good idea, sadly tempers still ran high and it ended in this bad situation. :(\n\nThe two week suspension was meant to serve as a last warning and a chance for you to improve your in-game behavior. The punishments do escalate, I really can't give you too many details regarding how exactly our IFS system works as it is sensitive information and it can easily be abused. What I can tell you is that you are closely being monitored after you get a toxicity punishment and it there is still a negative behavior pattern in your games it escalates to the next step. The reform period is a lot longer than you surmised, we really do need to see a lot of continuous clean games before we can consider restoring an account's good name.\n\nWe treat all our players the same, and we hold everyone accountable for their own behavior. We expect everyone to be civilized and considerate of other people they are playing with. For this reason, we don't condone any type of unsportsmanlike and negative behavior in League of Legends.\n\nWhile we understand that emotions run high and there are situations where everyone is short-tempered that does not mean we won't take action if players cross the line.\n\nThat being said, I am sorry to inform you that we will neither remove nor modify your account suspension.\n\nI sincerely hope you understand and wish you good fortune.\n\nJinxed Poro\nPlayer Support Specialist\n\n\n00SHOTS00\nApril 3rd 2019, 7:37:32 am\nAs much as i respect this reply,\n\nI ticked a box saying that i must accept ways to improve... you did not address this at all as well as just blamed me for my actions... you guys take my time away from me by not punishing people that actually deserve the punishment instead you monitor what people say as a way to ban people that are addicted (because we are addicted that's why we have passion for your game) and leave the people that are ruining the game go freely...\n\nso 8 games - what do i do? if this can't be addressed i will do you all on the OCE riot team a favor and farewell this game.","replies":[]}]}