{"poster":"Davvid","date":"2017-11-07T20:30:35.691+0000","title":"LOL CLIENT MIT SPRACHE AUF KOREANISCH UM STELLEN","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"huhu :)\r\n\r\nwollte mal fragen ob und wie es m&ouml;glich ist den client so umzustellen so dass ich noch auf meiner region zocken kann?\r\n\r\nwenn man es tut wird man dann gebannt?","replies":[{"poster":"Gin","date":"2017-11-08T07:50:47.110+0000","up_votes":1,"down_votes":0,"body":"Nein, das ist und wird in naher Zukunft nicht möglich sein.\n\nWenn du am Client und/oder am Gameclient von dir aus irgendwelche Änderungen vornimmst, würde ich da sehr vorsichtig sein da das durchaus zu einem Ban führen kann. \n\n(Abhängig davon was du änderst und wie das System arbeitete dass Modifikationen am Client entdeckt.)\n\n---\n\nHinweis:\n\nBitte prüfe beim nächsten Mal ob andere bereits einen Thread zum Thema erstellt haben. (Auf die Suchfunktion im Forum würde ich mich nicht verlassen.)\n\nIn den letzten Monaten gab es nämlich ~20-30 Threads wo jemand den europäischen Client auf japanisch oder koreanisch haben wollte. Oder jemand den türkischen Client auf Deutsch.\n\n---\n\nIch wünsche dir trotzdem noch viel Spaß und hoffe ich habe dich damit jetzt nicht verschreckt :p\n\nIch wünsche dir ansonsten noch einen schönen Tag und viel Spaß damit in der Preseason mit den neuen Runen zu experimentieren, und bis zur Unendlichkeit zu leveln.","replies":[{"poster":"Davvid","date":"2017-11-08T13:30:08.166+0000","up_votes":1,"down_votes":0,"body":"danke für die antwort^^","replies":[]},{"poster":"Qbert","date":"2017-11-08T09:47:48.730+0000","up_votes":1,"down_votes":0,"body":"Und vergiss nicht den Tipp mit dem LAN-Kabel!\n\n*rennt schnell davon :D*","replies":[{"poster":"Gin","date":"2017-11-08T10:24:45.201+0000","up_votes":1,"down_votes":0,"body":"https://media.tenor.com/images/7ed5ed9cb4c80e0f7deb6eb4154210d2/tenor.gif\n\nDone. (Es ist echt schwer Kabel-Gifs zu finden.)","replies":[]}]}]},{"poster":"AI Yjuq","date":"2017-11-08T06:40:26.597+0000","up_votes":1,"down_votes":0,"body":"Offiziell gar nicht. Es geht  allerdings mühselig, fehleranfällig und bannbar.","replies":[]},{"poster":"Qbert","date":"2017-11-08T06:29:38.210+0000","up_votes":1,"down_votes":0,"body":"Ich meine mal hier im Forum gelesen zu haben, dass es geht.\nEntweder mit Dateien ändern oder einem Dritt-Programm. Beides trägt aber das Risiko mit sich, dass du gebannt wirst.","replies":[]},{"poster":"Alustus","date":"2017-11-08T00:55:00.912+0000","up_votes":1,"down_votes":0,"body":"Irgendwie kann man es sicher ändern, aber du hast dann immer das Risiko gebannt zu werden.","replies":[]},{"poster":"KageNoOkami","date":"2017-11-07T22:31:56.021+0000","up_votes":1,"down_votes":0,"body":"Edit: Ich möchte nichts gesagt haben~","replies":[{"poster":"Davvid","date":"2017-11-07T23:22:15.751+0000","up_votes":1,"down_votes":0,"body":"hey komischer kauz ^^\n\nja ich bin der sprache mächtig da das mein heimatland ist xD","replies":[]}]}]}