{"poster":"Fast and Udyrous","date":"2017-07-31T05:54:07.154+0000","title":"Hextech-Kisten für OTPs","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich spiele nur Udyr und mit diesem Carry ich regelm&auml;&szlig;ig. Mein Problem ist jetzt, dass ich 7 Schl&uuml;ssel und keine Kisten habe. Ich habe auf allen anderen Champs, die mir gefallen schon eine Kiste bekommen, wie soll ich als OTP jetzt an Kisten kommen? Ich finde, man sollte, sobald man auf einem Champ eine Kiste erhalten hat, bei jedem S+ eine weitere Kiste bekommen.","replies":[{"poster":"The mute Swan","date":"2017-07-31T10:21:08.854+0000","up_votes":2,"down_votes":0,"body":"Naja... Wenn du nur einen Champ spielst, brauchst du auch irgendwie keine Skins für andere Champs. \nUnd ich geh mal davon aus, dass du wie ein Ordentlicher OTP zumindest 1-2 skins für deinen Champ selbst kaufst.\n\nWozu willst du also die Kisten, frage ich mich da :D\n\nSvenson Out","replies":[]},{"poster":"Bobby Bonkers","date":"2017-07-31T09:41:24.925+0000","up_votes":2,"down_votes":0,"body":"Da man eh nur maximal 4Kisten im Monat bekommen kann werden dich 4 Games auf nem anderen Champ schon nicht umbringen ^^.\nZumal 4 Runden Aram echt schneller gemacht sind","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-07-31T12:01:57.905+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir ja folgendes empfehlen: Suche dir nen paar Freunde, spiele mit denn andere Champions im Normal. Und einer von euch spielt immer seinen \"Main\" und generiert so die S Bewertungen, die ihr braucht.","replies":[]},{"poster":"Timethief49","date":"2017-07-31T08:59:25.894+0000","up_votes":1,"down_votes":0,"body":"Ich bin eigentlich auch Zac otp, spiele aber einfach ne paar Spiele auf anderen champs für Kisten is ja kein großes ding","replies":[]},{"poster":"ShiroNoKamii","date":"2017-07-31T07:28:24.878+0000","up_votes":1,"down_votes":1,"body":"Es gibt 137 Champions, und um eine Kiste zu bekommen musst nicht mal perse du das S bekommen. Es reicht auch wenn ein Mate eins hat.\nAlso sollte eigentlich die Chance selbst für OTPs bestehen, ihren Horizont wenigstens in Normals zu erweitern.\nMach paar Arams und probier möglichst viele Champs aus und teste diese dann in Normals. \nHilft bei Kistenproblemen möchte ich meinen.\n\nGruß Shiro","replies":[]},{"poster":"Necromant","date":"2017-07-31T06:56:31.476+0000","up_votes":1,"down_votes":1,"body":"Same .. & mit den Ehrungen werden die Schlüssel immer mehr ...","replies":[]},{"poster":"ninju7su","date":"2017-07-31T05:58:46.605+0000","up_votes":1,"down_votes":1,"body":"Ich hab glaub 32 fertige Schlüssen -.- Die werd ich im Leben nimmer los.","replies":[]}]}