{"poster":"Battletaker","date":"2016-01-19T14:28:24.115+0000","title":"Ping und FPS Probleme","subforum":"Hilfe & Support","up_votes":0,"down_votes":0,"body":"Hallo \r\n\r\nIch habe schon seit l&auml;ngerem ein Problem mit meinem FPS bei Lol, dass zwischenzeitlich einfach der Bildschirm einfriert f&uuml;r 1-2 Sekunden und das alle 1 - 2 Minuten. H&auml;ufig passiert das bei Beginn oder innerhalb von Teamfights oder einfach K&auml;mpfen mit anderen Spielern.\r\n\r\nZus&auml;tzlich habe ich seit kurzem das Problem das mein Ping kurze Zeit stabil ist aber immer wieder die Verbindung kurz aussetzt oder der Ping einfach in die H&ouml;he geht bis 600-700 ms. Der geht dann wieder Runter aber passiert das innerhalb eines Spiels h&auml;ufig und l&auml;sst dadurch nicht wirklich ein normales Spiel zu.\r\n\r\nAlso mit den FPS Probleme kann es an der Leistung meines Notebooks nicht scheitern ich habe ein:\r\n\r\nAsus G 750JX - T 4052H\r\nhttp://www.amazon.de/Asus-G750JX-T4052H-Notebook-4700HQ-schwarz/dp/B00D7E3TOU\r\n \r\nInternet Leitung ist eine DSL 16000 bei der Telekom\r\n\r\nHabe es auch bereits von 2 verschiedenen Internetleitungen jeweils DSL 16000 bei der Telekom ausprobiert aber beim Ping problem ergab sich dadurch keine L&ouml;sung.\r\n\r\nIch hoffe ich hab hier nichts wichtiges an Daten ausgelassen und man kann mir weiterhelfen","replies":[{"poster":"Battletaker","date":"2016-01-21T14:29:10.490+0000","up_votes":1,"down_votes":0,"body":"Also ich habs jetzt mal Auf meine SSD installiert bisher keinerlei Probleme gehabt \n\nAber bei den Ping problemen muss es irgendeinen anderen Grund als den Provider haben ... \nDas Problem beschränkt sich nämlich nicht nur auf League of Legends sondern auch auf andere Anwendungen und Spiele. Es ist auch nicht Konstant sondern funktioniert es manchmal Fast ohne Probleme und dann auf einmal wieder nicht. Hatte jetzt gerade zum Beispiel ein Spiel wo ich durchgehend einen 500 ms Ping hatte obwohl es sonst nur gelegntlich hochgeht auf 200-300 für 1-2 Sekunden. Mein Mitbewohner hat auch keinerlei Probleme mit seinem Internet  das beschränkt sich nur auf meinen PC.\n\nEs wundert mich auch das es aus dem nichts kommt, da ich an meinem Computer nicht wirklich was verändert habe.","replies":[]},{"poster":"Th3St0rmD3Ath","date":"2016-01-19T18:47:44.382+0000","up_votes":1,"down_votes":0,"body":"Guten Abend, \n\nIch kann dir vllt bei einem deiner beiden Problemen helfen. Ich besitze ein Asus G750JZ und hatte ebenfalls solche Aussetzer für 1 bis 3 Sekunden. Ich hatte das Spiel auf der HDD installiert und dann Testeshalber mal auf die SSD verschoben. Siehe da - Problem gelöst!\n\nZusammenfassung: Einfach mal schauen ob du das Spiel auf deiner HDD oder SSD hast. Wenn HDD mal verschieben\n\nMfg St0rm","replies":[]},{"poster":"Hannibal L3ctor","date":"2016-01-19T15:43:42.224+0000","up_votes":1,"down_votes":0,"body":"hatte ich auch mit der 16k leitung von telekom... jetzt habe ich eine 50k leitung und es ist etwas besser.\ndieses problem betrifft aber nur lol.  ich denke das hängt mit den servern zusammen.. und du kannst da momentan nicht viel machen","replies":[]}]}