{"poster":"s10 toplaner","date":"2016-09-14T20:55:18.116+0000","title":"¿Cómo le juego a una Fiora?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Pos, lo del t&iacute;tulo. Se jugarle a todos los toplaners menos a Fiora, la intento stompear en early pero me gana todos los intercambios, no me deja farmear y una vez que comienza a pegar no puedo pararla... Y ni hablar del late game, en donde es una bestia.\r\nConsejos se agradecen ^^","replies":[{"poster":"Exit","date":"2016-09-14T22:35:12.928+0000","up_votes":2,"down_votes":0,"body":"en torre y esperá que te divee","replies":[{"poster":"Ziwod","date":"2016-09-23T15:38:31.756+0000","up_votes":1,"down_votes":0,"body":"Re cagon.","replies":[]}]},{"poster":"LGBT Valentina","date":"2016-09-14T23:45:21.494+0000","up_votes":1,"down_votes":0,"body":"La realidad es:\n1: Tenes que tradearle cuando tiene la marca en una posicion que le es incomoda y le tradeas \"kiteando\", para que le cueste o la obligues\n2: Tenes que evitar a toda costa la W, con algun tipo de dash y sobre todo, si tenes una ulti visible o de finish hit (syndra-veigar-darius, que tienen animacion) \"baiteala\", digamos:\nSi fiora tiene 150 de vida y se le acerca cho que tiene r (que saca 300 de true dmg), fiora va a usar la W cuando tenga a cho'gat en la cara o \n3: El unico counter play real de la ulti, es que te pegues a 1 pared\nPro: No puede activar su curacion y se limita a 3 marcas de daño\nContra: Si te pones contra la pared, te quedas contra la pared hasta que termine el efecto o sepas que no tiene la W y la podes burstear\n\n\nPuedo alargar las especificaciones pero es un resumen breve en si\nOtro consejito, es que si fiora usa su Q y no impacta en NADA, castigala y que sufra mucho por que  tiene un CD bastante alto y es su movilidad/daño (los 2) en si  (16 / 14 / 12 / 10 / 8)","replies":[]},{"poster":"TSW Rorschach","date":"2016-09-14T22:25:11.834+0000","up_votes":1,"down_votes":0,"body":"Uso algo a Fiora pero no soy main ni soy main parándola, aunque espero ayudar en algo(?\n\nNaturalmente tenés que castigarla cuando intente explotarte las marcas de la pasiva en los tradeos, cosa que es bastante fácil si tenés ventaja de minions (tampoco te le pongas delante para que te pegue a la marquita que casualmente tiene enfrente), si ya ves que está muy a su alcance procurá tener cuidado o alejarte un poco hasta que desaparezca y cambie. En early es squishy, así que dejarla a media vida no es muy complicado. Guardarte el cc la mayor cantidad de veces ya que si lo tirás y te lo devuelve estando vos mal posicionado, te va a dejar en coma, así de simple (aprovechá que esa cosa tiene un enfriamiento alto también, por ejemplo, en el caso de un gankeo si ella quiere bloquear el cc de tu jg, vos se lo tirás después y fue). Y si te puso R, a menos que veas que la podes matar antes de que te golpee en más de una o dos marcas, lo mejor es no pelearle naturalmente porque encima que te baja en relación a tu vida, se cura sin hablar de la velocidad de movimiento que le da la misma. Si te alejás lo suficiente su ulti desaparece, así que no te preocupes(?.\n\nCreo que lo mejor es joderle el early ya que ahí es muy débil y no resiste tanto, solo tiene la W para parar 1 cc/daño heavy y una Q para escapar (que si no alcanza un enemigo tiene un enfriamiento de puta madre...). Aunque acordate que es más un campeón de contraataque que iniciador, así que iniciar y tirarte de jeta contra ella es... suicidio(? es mejor esperar a que se equivoque para reventarla :v\n\n--También es muy efectivo en el caso del cc \"Predecible\" tirárselo melé (vease E de Shen) para que no llegue a reaccionar a pararlo. Es cuestión de ver cuántos reflejos tiene la Fiora a la que te enfrentas, hay algunas que te paran hasta el slow de Tryndamere pero hay otras... que usan la W para farmear nomas...","replies":[]},{"poster":"Sir Crucifix ","date":"2016-09-15T00:03:25.196+0000","up_votes":1,"down_votes":1,"body":"yo soy main y ni a palo te digo las debilidades , pero como soy generoso y buena persona , te voy a decir que farmees ,  nada mas","replies":[]}]}