{"poster":"call me pawn","date":"2016-03-13T16:40:54.242+0000","title":"CAPITOLO 3: rottura di palle!","subforum":"Off-topic","up_votes":2,"down_votes":2,"body":"Apparte che non so perch&eacute; metto capitolo 1,2,3 eccetera ai miei post.... Comunque, il fatto &egrave; che lol oramai mi ha annoiato e cercavo altri giochi ( magari free), che non fossero moba per riempire il mio tempo libero. Sono aperti i consigli!","replies":[{"poster":"call me pawn","date":"2016-03-15T13:21:10.967+0000","up_votes":1,"down_votes":0,"body":"Donkey kong che fa un fottio di danni?","replies":[]},{"poster":"Giorgio di villa","date":"2016-03-13T18:50:50.277+0000","up_votes":1,"down_votes":0,"body":"Brawlhalla!\nPraticamente È lo smash bros dei poveri, un po' più sbilanciato di smash (non che smash sia bilanciato eh cough CLOUD! LINK! BAYONETTA! DUO DUCK HUNT! CLOUD! CLOUD! CLOUD!!!cough.....nintendo pls) e con un po' meno personaggi ma è ancora in beta quindi continueranno ad aggiungere eroi ","replies":[{"poster":"call me pawn","date":"2016-03-14T16:29:52.513+0000","up_votes":1,"down_votes":0,"body":"> Praticamente È lo smash bros dei poveri, un po' più sbilanciato di smash (non che smash sia bilanciato eh cough CLOUD! LINK! BAYONETTA! DUO DUCK HUNT! CLOUD! CLOUD! CLOUD!!! LITLE MAC CHE ONE SHOTTA!!! cough.....nintendo pls) e con un po' meno personaggi ma è ancora in beta quindi continueranno ad aggiungere eroi U.U.","replies":[{"poster":"Giorgio di villa","date":"2016-03-14T16:55:33.705+0000","up_votes":1,"down_votes":0,"body":"Non ho aggiunto Mac proprio perché è il mio main e ci sono affezionato D:\nAh già e mi sono dimenticato di aggiungere i fucilieri mii che non hanno counterplay \nNon so chi sia più sbilanciato tra i fucilieri mii o cloud......\nÈ un vero peccato che i mii non si possano usare online......loro assieme a dark pit e little mac sono i miei preferiti","replies":[{"poster":"call me pawn","date":"2016-03-14T17:21:34.639+0000","up_votes":1,"down_votes":0,"body":"Però, non hai menzionato lo smash meteora che ti oneshotta in aria di mario !","replies":[{"poster":"Giorgio di villa","date":"2016-03-14T17:36:44.453+0000","up_votes":1,"down_votes":0,"body":"È una combo difficile da fare quindi non mi sembrava il caso\nQuella combo con cloud la si fa premendo tasti a caso","replies":[]}]}]}]}]}]}