{"poster":"Oriating","date":"2020-01-16T01:41:10.474+0000","title":"I got falsely perma banned?","subforum":"Player Behavior","up_votes":1,"down_votes":1,"body":"So I logged in today to finish up my placements. And I log in to see that it says I've been perma banned for the use of 3rd party software. Yet I don't use any besides Blitz, is Blitz a bannable 3rd party software? I'm really scared because I've spent money on this game and I don't know what I did wrong. I don't know if my account got somehow hacked. I would really like a solution to find out what \"third party software\" got me banned from League. Keep in mind this is my first time logging in for like 3 days. https://imgur.com/a/sS0jOAE","replies":[{"poster":"Imperial Pandaa","date":"2020-01-16T01:49:19.504+0000","up_votes":3,"down_votes":0,"body":"Well, if you haven't played for 2 days; you may want to check your match history and submit a support ticket.\n\nActually, just check your match history in general for unfamiliar games.","replies":[{"poster":"Oriating","date":"2020-01-16T01:53:39.194+0000","up_votes":1,"down_votes":0,"body":"wait i just checked that i haven't played in 3 days and my most recent game was on yasuo from 2 days ago. but i remember that i used my account to play an akali ranked game. i'm pretty sure i was hacked.","replies":[{"poster":"MagicFlyingLlama","date":"2020-01-16T01:56:38.860+0000","up_votes":2,"down_votes":0,"body":"If so, submit a report ticket explaining it. People usually get hacked accounts back.\n\nThe most common causes of this are entering your password on non-riot sites, or using the same username and password on multiple games/services, another of which was hacked or compromised.","replies":[{"poster":"Oriating","date":"2020-01-16T02:09:15.553+0000","up_votes":1,"down_votes":0,"body":"Yeah, I use this name and password for almost all of my games. I think I got hacked because of the widespread Riot name change, I changed my name back to my original summoner name. That was also very annoying the wide name change. Anyways, I submitted a ticket so I'm hoping for the best. Pray for me please. :(","replies":[{"poster":"MagicFlyingLlama","date":"2020-01-16T05:08:18.933+0000","up_votes":1,"down_votes":0,"body":"You cant \"get hacked\" by a name change, or get hacked at all. League accounts simply dont \"get hacked\", short of someone breaching riot's servers, which has never happened as far as we know.\n\nA different game probably got breached, and someone got that information and tried it on other games. Standard practice. Never use the same password in multiple places.","replies":[{"poster":"Squallsy","date":"2020-01-16T13:27:19.175+0000","up_votes":2,"down_votes":0,"body":"Hacked is very rarely used on the internet, when a person admits that they share all usernames and passwords across all accounts, they are probabaly also the kind of person that users their birthdate or something, which makes accounts absurdly accessible.\n\nBASIC PASSWORD SECURITY PLEASE PEOPLE","replies":[]}]},{"poster":"Tele II","date":"2020-01-16T02:57:07.452+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oriating,realm=NA,application-id=ZGEFLEUQ,discussion-id=KfG3xyi2,comment-id=0000000000000000,timestamp=2020-01-16T02:09:15.553+0000)\n>\n> Yeah, I use this name and password for almost all of my games. I think I got hacked because of the widespread Riot name change, I changed my name back to my original summoner name. That was also very annoying the wide name change. Anyways, I submitted a ticket so I'm hoping for the best. Pray for me please. :(\n\nWidespread Riot name change? I didnt hear about that. Buncha people had to change their names, or what happened?","replies":[]}]}]}]}]},{"poster":"Rebel 986","date":"2020-01-16T13:32:16.977+0000","up_votes":1,"down_votes":0,"body":"Looks like boosting and probably used a script and therefore 3rd party software.","replies":[]},{"poster":"Ph03n1xb1rd","date":"2020-01-16T13:21:21.419+0000","up_votes":1,"down_votes":0,"body":">  I'm really scared because I've spent money on this game and I don't know what I did wrong.\n\nWell, spending money on this game is wrong. :D\n\nPs.: Just check your history if there are games you did not play. If there are just write a ticket.","replies":[]},{"poster":"Tele II","date":"2020-01-16T02:55:50.538+0000","up_votes":1,"down_votes":0,"body":"Yeaah maybe. Definitely try to contact Riot support. Dont bump your ticket as that will send it to the back of the line. If first interaction with support fails, then try again until you get the right support person. Ive seen people get those overturned after several attempts with support. Just takes the right person at the right time to dig a little deeper into it.","replies":[]},{"poster":"Arammus","date":"2020-01-16T01:52:07.874+0000","up_votes":1,"down_votes":0,"body":"botting/bought acc?","replies":[{"poster":"Oriating","date":"2020-01-16T02:12:14.945+0000","up_votes":1,"down_votes":0,"body":"No, I made this account and I don't let anyone else use it.","replies":[]}]}]}