{"poster":"crisgamerxD","date":"2016-01-31T19:05:01.548+0000","title":"ya olvidaron al heraldo","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"yo creo que el heraldo no se toma mucho en cuenta es como un mounstro neutral olvidado las unicas partidas en que se le mata es una donde este un {{champion:75}} {{champion:35}} {{champion:19}} {{champion:9}}  y no se ven mucho en esta TP ademas el bufo al inicio es el unico lugar donde sirve y al inicio o debes estar 30/0 o aserla con 4 personas minimo. esa es mi propuesta cualquier cosa que encuentren un desacuerdo diganmelo {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Ks Erwyn","date":"2016-01-31T23:09:34.778+0000","up_votes":1,"down_votes":0,"body":"Es mas útil que el primer dragón, pero es imposible hacérselo antes de lvl 5 o hasta terminar el item de jungla.","replies":[]},{"poster":"AuroraExecution","date":"2016-01-31T19:07:23.505+0000","up_votes":1,"down_votes":0,"body":"Es un objetivo situacional y no tan importante como un dragon. De acuerdo a como se desarrolle la partida y la fase de lineas puede hacerce o no.","replies":[{"poster":"crisgamerxD","date":"2016-01-31T19:09:11.260+0000","up_votes":1,"down_votes":0,"body":"igual aunque esten ganando deberia el enemigo de linea estar ausente para aprovecharlo por lo \nmenos al 50%","replies":[{"poster":"Lazuli Finn","date":"2016-01-31T19:25:04.233+0000","up_votes":1,"down_votes":0,"body":"Igualmente si vamos a lo tecnico incluso el Dragon y el Baron pueden volverse objetivos secundarios cuando se trata de tirar torres o de ganar la partida. Por ejemplo el enemigo puedo ir a hacer Baron, y tal vez con el tiempo que tardan en eso un enemigo puedo \"escabullirse\" en una linea y pushearla hasta un nexo o mas\n\nA fin de cuentas todo se trata de priorizar objetivos","replies":[]}]}]},{"poster":"Guzmanicus","date":"2016-01-31T19:12:08.112+0000","up_votes":1,"down_votes":0,"body":"Es un insta-win de linea, en especial con campeones que pushean fuertemente, como nasus.\n\nPero tiene varios riesgos asociados, no deja de ser un mini baron de early","replies":[]},{"poster":"kiuhm","date":"2016-01-31T19:09:23.129+0000","up_votes":1,"down_votes":0,"body":"El heraldo nada mas sirve para llenar mas rapido el devorador, la verdad es que el buffo ese te perjudica un poco, sos free gank.","replies":[{"poster":"crisgamerxD","date":"2016-01-31T19:10:13.929+0000","up_votes":1,"down_votes":0,"body":"bueno pensandolo asi por eso puse 4 junglas xD","replies":[]}]}]}