{"poster":"Emiya Shirö","date":"2018-11-18T16:36:18.743+0000","title":"Darius support :c","subforum":"Charlas Generales","up_votes":7,"down_votes":2,"body":"Buenas, soy diamante, pickeo darius support en ranked, me va bien generalmente, pero la gente siempre me comunica que me va a reportar... se puede hacer algo con respecto a eso, &iquest;por que los picks originales siempre son motivo de report aun cuando funcionan?","replies":[{"poster":"Ąvÿ","date":"2018-11-18T17:52:39.881+0000","up_votes":3,"down_votes":2,"body":"Entonces... No te molestaría si en tu promo a X liga uso en mid a camille? Digo según tus argumentos,entonces yo diria :\n\"Porque es un campeón de mucha variedad\" sin importar el Winrate que tenga. \nNo se digo como ejemplo. =P","replies":[{"poster":"Hadion","date":"2018-11-18T23:48:51.023+0000","up_votes":2,"down_votes":0,"body":"Iluso... Camille fue tier1 en mid por unos cuantos meses cuando salio, hasta Rakan mid full ap se usaba en master-challenger.","replies":[]},{"poster":"Supasanik","date":"2018-11-18T17:58:46.888+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Reï,realm=LAS,application-id=v7qsfXsE,discussion-id=7OgEWt8u,comment-id=0004,timestamp=2018-11-18T17:52:39.881+0000)\n>\n> Entonces... No te molestaría si en tu promo a X liga uso en mid a camille? Digo según tus argumentos,entonces yo diria :\n> &quot;Porque es un campeón de mucha variedad&quot; sin importar el Winrate que tenga. \n> No se digo como ejemplo. =P\n\nVos te crees que no se usa Camille mid seriamente? ..","replies":[{"poster":"Ąvÿ","date":"2018-11-19T03:51:06.871+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Supasanik,realm=LAS,application-id=v7qsfXsE,discussion-id=7OgEWt8u,comment-id=00040000,timestamp=2018-11-18T17:58:46.888+0000)\n>\n> Vos te crees que no se usa Camille mid seriamente? ..\n\nNo se la usa más, y menos en profesionales en la midlaner.","replies":[]}]}]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-11-18T19:44:39.301+0000","up_votes":1,"down_votes":1,"body":"Podes mutearlos nomas, mientras juegues para ganar por mas reportes que te den CREO que no te va a pasar nada **~~como el singed support con castigo~~**","replies":[{"poster":"Devillic","date":"2018-11-18T21:02:31.521+0000","up_votes":2,"down_votes":0,"body":"Fue muy triste eso","replies":[]},{"poster":"AavatarisII","date":"2018-11-18T21:10:46.744+0000","up_votes":1,"down_votes":2,"body":"Me banearon permanente esta cuenta por, según dijo el Soporte al Jugador, **acumulación de reportes premades**.\nTuvieron que **debanearme la cuenta (tras revisar 4 meses de comportamiento sin culpas), pero igual me dejaron 14 días de sanción**, porque \"era lo mejor que podían hacer\".\nhttps://ibb.co/fzHnH0\n\nEl sistema automático es una burla, **solo cuenta reportes y palabras censurables, beneficiando a premades y/o trolls**.\n-----\nAdemás, el mute no soluciona trolls, feeders que no juegan en equipo, ni muchas otras cosas ...por el contrario, te impide saber quien flameo/provoco y merece reporte","replies":[{"poster":"IIIIIIIIIIIIIIII","date":"2018-11-18T22:50:35.901+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=7OgEWt8u,comment-id=00050001,timestamp=2018-11-18T21:10:46.744+0000)Además, el mute no soluciona trolls, feeders que no juegan en equipo, ni muchas otras cosas ...por el contrario, te impide saber quien flameo/provoco y merece reporte\n\nEstás comentando fuera de contexto, el post es de un jugador que juega antimenta (darius sup) y su team lo acosa pidiendo report, cosa que no es reportable pero si molesto. \nEn ningún momento el post habla de trolls o flamers.","replies":[{"poster":"AavatarisII","date":"2018-11-18T23:16:05.007+0000","up_votes":1,"down_votes":2,"body":"Pues, DENTRO DEL CONTEXTO: \nEl otro día fui Gnar Supp y en bot salimos bien, pero el mid estuvo flamer por mi selección (desde Selección de Campeones, aunque mi premade top le aseguro que yo no trolleaba) y feeder intencional, trolleando porque \"ya estaba perdida\".\n\nAsí que, repito, el mute no te protege de las malas actitudes que toman los demás por \"no tolerar un pick no-meta\", sea culpando y reportando sin criterio o trolleando (....y demás).","replies":[{"poster":"IIIIIIIIIIIIIIII","date":"2018-11-19T03:06:09.463+0000","up_votes":1,"down_votes":1,"body":"Seguis opinando fuera del tema central del post\n> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=7OgEWt8u,comment-id=0005000100000000,timestamp=2018-11-18T23:16:05.007+0000)Así que, repito, el mute no te protege de las malas actitudes que toman los demás\n\nNunca nadie dijo que el mute protege/sirve de un troll","replies":[{"poster":"AavatarisII","date":"2018-11-19T03:45:33.594+0000","up_votes":1,"down_votes":1,"body":"El tema trata de las malas actitudes que toman quienes se cierran a nuevas posibilidades y tu comentario, en especifico, habló de que \"solo mutealos\" era la \"solución\" (mentira).\n\nEstoy diciendo que eso no lo soluciona porque **no se limitan a solo el chat esas actitudes**, dando claros ejemplos, evidenciando con un caso y **argumentando**.\n\nDonde \"estoy fuera de tema\"? o solo no se te ocurre una verdadera respuesta? ¬¬","replies":[]}]}]}]}]}]},{"poster":"AavatarisII","date":"2018-11-18T16:58:59.513+0000","up_votes":4,"down_votes":2,"body":"La mayoría de los jugadores ni saben de que va el juego, **solo se van a las kills y tratar ganar linea** , pero **regalan los objetivos y la partida** (\"No es un shooter, bestias! **es de equipos y estrategia**\" XS ).\nAsí que siempre van a flamear, reportar y/o trollear si alguien prueba algo \"innovador\" o diferente, aún si lo probaste en bots, puliste y ya sabes usarlo.\n\nDarius no es de mi preferencia, pero tampoco Sona. Todo depende del jugador, su modo de jugar y adaptarse (y del equipo, que ante los feeders, AFK y trolls pocas veces se puede remontar XS )\n\nPersonalmente, uso 77 champs de Supp: \nShen, Zac, Janna, Tresh, Lulu, Ivern, JayCe, Fiora, Dr. Mundo, Leona, Rakan, Zilean, Maokai, Irelia, Zoe, Ornn, Shaco, Bardo, Aatrox, Gnar, Mordekaiser, Vladimir, Fiddlesticks, Pyke, Trundle, Ziggs, Quinn, Morgana, Yorick, Rek' Sai, Kayle, Kennen, Lee Sin, Shyvana, Blitzcrank, Tahm Kench, Braum, Annie, Swain, Renekton, Skarner, Urgot, Jarvan IV, Sejuani, Lissandra, Gangplank, Rumble, Galio, Syndra, Karma, Vel' Koz, Udyr, Nami, Ahri, Camille, Sion, Olaf, Illaoi, Riven, Ryze, Veigar, Elise, Nautilus, Xerath, Kalista, Nasus, Nidalee, Kog' Maw, Kled, Jhin, Zyra, Te emo, Rengar, Tryndamere, Garen, Zed y Katarina\n...todos funcionan (incluso, mi mejor racha el año pasado fue con Katarina Supp, 17 seguidas) y aún tengo que probar 29 más (35 descartados).","replies":[]},{"poster":"PlayWithLau","date":"2018-11-19T04:59:18.439+0000","up_votes":1,"down_votes":0,"body":"Yo te daría honores amigo, te felicito por saber jugar este tipo de picks y hacerlo bien, y no creas en el antimeta. Si tiene un stun, agarre, o realentizacion es un support :P...","replies":[]},{"poster":"Hadion","date":"2018-11-18T23:56:48.613+0000","up_votes":1,"down_votes":0,"body":"La gente es especial, no les des bola... \n\nLa linea entre lo que es viable o no, meta o no, es muy fina... Si a vos te funciona algo jugalo, que los demas la chup*n :)\n\nEs como el caso de Ziggs Bottom/Inferior/ADC, el campeon siempre fue viable en bot, que la gente no lo usara es cosa de la gente.","replies":[]},{"poster":"Renekor","date":"2018-11-18T23:16:45.076+0000","up_votes":1,"down_votes":0,"body":"Nunca vi un darius sup. De verdad no es tan troll? funcionaria en oro y en platino? xd","replies":[]},{"poster":"Mascheranox","date":"2018-11-18T17:33:17.610+0000","up_votes":1,"down_votes":0,"body":"Habia leido alguna vez de un Nunu que iba suport con smite y aunque termino bien en las partidas lo banearon por que la gente lo denunciaba","replies":[]},{"poster":"hierroyque","date":"2018-11-18T17:28:31.466+0000","up_votes":1,"down_votes":0,"body":"muy bien por ti a mi mi elo por que pikeo fiddestick soporte me dices puras tonteras y tengo un winrate de 90% pero darius lo malo que necesita si o si farm  alguna kill es un pik preligroso al igual que kindread adc","replies":[]},{"poster":"Este No Es Zelos","date":"2018-11-18T16:51:04.754+0000","up_votes":1,"down_votes":0,"body":"Hola soy tham y me gusta tu pick. XDDDD ya enserio. \nEl pick no tiene nada de malo, no se por que te sorprende eso, yo iba senj mid y me bardeaban (hasta midgame donde todo el mundo te aplaude cuando ve lo que pasa)….\nEs mas era de los que espameaba el viejo galio (y eso que estaba op) es el desconocimiento amigo, la ignorancia es muy persuasiva. Mute y a tu juego, es medio …. un tiron de huevos porque de soporte necesitas coordinar, osea darius va para adelante y para adelante pero bueno son gustos.\n\nLo importante es que no te sancionan por antimeta, eso si, negarte a comunicarte y actitud negativa si caen si pickeas lo que se te canta y después no vas a lo que vas, ten en cuenta que es un juego de equipo y si tu elección es caprichosa y sin valor real entonces es igual a trolear.\n\nSaludos!","replies":[]}]}