{"poster":"chriss p bacon","date":"2016-09-19T14:34:02.445+0000","title":"Wie Spielstil verbessern","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Guten Tag Beschw&ouml;rer.\r\nVorweg &uuml;ber mich:\r\nIch spiele Lol seit Anfang Season 4. Ich war sowohl in preseason 4 als auch preseason 5 Silber und aktuell Pendel ich zwischen Silber 3 und 4. (Bin in Season 6 Bronze 4 gestartet.)\r\nAktuell meine ich Support mit Soraka. Spiele aber auch recht gut Zyra und Lux (sowohl mit und Support) und Amumu im Jungle.\r\n\r\nMein Problem: es geht f&uuml;r mich aktuell nicht weiter.\r\nMein Problem ist: Ich w&uuml;rde &uuml;ber mich selbst sagen, dass ich mechanisch nicht der beste Spieler bin, aber daf&uuml;r umso besser im Decissionmaking und Taktik. Ich habe schon &uuml;ber 3000 Games gespielt seit Season 4.\r\nNur leider verliere allzuoft games, weil ich mein Team leider nicht dazu bewegen kann meinen Pings zu vertrauen.\r\nSehr oft sitze ich fassungslos vor dem Game und Frage mich &quot;wieso rusht ihr jetzt Baron, anstatt durchzupushen&quot;\r\nOder &quot;wir haben gerade einen Teamfight gewonnen, wieso rotiert ihr jetzt, anstatt zu Pushen&quot;\r\nOft liegen wir auch in den Kills deutlich vorne. Dann wird das Team greedy und anstatt zu Pushen Chased jeder nur noch Kills hinterher. Und dann verlieren wir trotz riesigem killlead.\r\n\r\nObwohl ich im mittleren Silberbereich spiele habe ich viel zu oft den Eindruck, dass es den Spielern am grundlegenden Verst&auml;ndnis der Spielmechanik mangelt.\r\nViele games verliere ich nicht, weil die Leute so unglaublich schlecht spielen (okay, wenn deine Toplane nach 10 minuten 0/15/0 steht....), sondern einfach durch schlechte Entscheidungen (roamen ohne einzupushen und so die Lane verlieren, Timing von Baron/Drakes etc)\r\n\r\nUnd gerade als Support f&uuml;hle ich mich oft aufgeschmissen. Wenn mein ADC schlecht ist kann ich gerade als Soraka oftmals wenig tun. Und ich w&uuml;rde ungern meinen Champ aufgeben m&uuml;ssen.\r\nIhr k&ouml;nnt ja auch gerne mal auf mein Profil gehen. Ich denke schon dass ich sie recht gut spiele.\r\nWie kann ich also meinem Team helfen. Mehr auf einen zu h&ouml;ren. Mehr auf Pings zu achten.\r\n\r\nVielleicht will ja auch jemand von euch, der h&ouml;her als ich spielt mal 1 oder 2 Runden mit mir Spielen oder mir zugucken und mir bei eigenen Fehlern helfen, die mir vielleicht selbst nicht auffallen.\r\n\r\nLiebe gr&uuml;&szlig;e\r\n\r\nChris","replies":[{"poster":"MeMyselfandBaal","date":"2016-09-19T17:02:16.981+0000","up_votes":1,"down_votes":0,"body":"Also meine Erfahrung mit Entscheidungen treffen ist ja... je mehr die Leute sehen, um so mehr sind sie gewillt den Pings zu folgen. Wenn du dir also denkst \"hey, wir könnten jetzt Drachen machen\", du dann aber nicht für Vision in dem Gebiet sorgen kannst (weil du den ROA wichtiger einschätzt als den Sightstone).\n\nUnd meine Erfahrung in allen Elos unter Platin ist halt: Zwar können wenige Spieler wirklich warden, aber viele Spieler kriegen es doch mit, wenn für sie gewardet wird. Wenn du also willst, dass die Spieler sich an dein \"Calls\" halten, dann zeige ihnen auf der Mini Map, dass dies die sicheren Calls sind. In dem du (wenn du durchpushen willst) die Wards nach dem Teamfight so platzierst, dass ihr den euch vielleicht in den Rücken fallenden Gegner mit Sicherheit kommen seht...\n\nAn sonsten ist die Frage ob Turm oder Nashor eine der spannendsten im Spiel. Also es kann in dem Moment, den du da beschreibst, auch einfach so sein, dass du dich vollkommen falsch verhältst und der Rest des Teams den richtigen Call macht. Und das die anderen sich dann genau so über dich \"lästern\" wie du hier über sie...\nUnd ja, den Baron zu machen ist im seltensten Fall der Falsche Call. Also wenn ihr den ohne Verluste down nimmt. Das einzige, was wirklich instant wichtiger ist, wäre ein Inhibitor. Denn wenn man den Baron erst Mal auf 2 oder 3 Leuten hat, fallen die Türme eh ziemlich schnell. Ein Turm bringt dir was... 650 Gold fürs Team und Druck auf der Karte. Ein Baron Powerplay (das ja meistens in mehreren Türmen endet) bringt dir gerne 4-5.000 Gold und den Sieg. Nur um mal zu verdeutlichen, dass der Ansatz, den Baron ab Minute 30 in den Vordergrund zu rücken, vielleicht gar nicht so verkehrt ist. \nUnd ja, ab einer gewissen Elo reicht ein Toter Jungler (oder ein noch geringerer Vorteil... das 2 Gegner in die Base müssen) aus, damit ein Team sich in Minute 32 sofort den Baron sichert. Da wird dann teilweise sogar schon im die Vision beim Baron gekämpft. Und da wäre dann jedes Team froh, wenn ihr Nachteil nur in dem Verlust eines Turms endet...","replies":[{"poster":"chriss p bacon","date":"2016-09-19T17:28:40.680+0000","up_votes":1,"down_votes":0,"body":"Ich gebe dir da zum Großteil recht.\nAllerdings wollte ich damit auf Situationen anspielen, in denen wir 1 oder 2 Türme haben, während das Gegnerteam auf jeder Lane schon an den Inhibtürmen steht oder teils schon down hat. Wir sind seit 10 Minuten dauerhaft am deffen und können keinen Druck aufbauen.\nDa gibt es ein Teamfight, die Gegner machen einen Fehler und wir acen sie.\n\nIn solch einer Situation würde ich es doch im deutlichen Vorteil sehen eine Lane bis zum Inhib durchzupushen und so ein wenig Pressure zurückzubekommen, als Nash zu rushen, nur um dann doch wieder den Buff zu vergeuden, da wir nach dem Baron doch wieder nur am Deffen sind.\n\nIch bin zwar nur Silber aktuell, aber in so einer Situation weiß ich nicht, wie ein Baron mehr bringen soll als ein wenig Druck auf der Map zurückzugewinnen.\n\nKorrigiert mich bitte, wenn ich da falsch liege.","replies":[{"poster":"MeMyselfandBaal","date":"2016-09-19T19:39:14.775+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=chriss p bacon,realm=EUW,application-id=Wj1wcocU,discussion-id=i0O1qw71,comment-id=00010000,timestamp=2016-09-19T17:28:40.680+0000)\n>\n> Ich gebe dir da zum Großteil recht.\n> Allerdings wollte ich damit auf Situationen anspielen, in denen wir 1 oder 2 Türme haben, während das Gegnerteam auf jeder Lane schon an den Inhibtürmen steht oder teils schon down hat. Wir sind seit 10 Minuten dauerhaft am deffen und können keinen Druck aufbauen.\n> Da gibt es ein Teamfight, die Gegner machen einen Fehler und wir acen sie.\n> \n> In solch einer Situation würde ich es doch im deutlichen Vorteil sehen eine Lane bis zum Inhib durchzupushen und so ein wenig Pressure zurückzubekommen, als Nash zu rushen, nur um dann doch wieder den Buff zu vergeuden, da wir nach dem Baron doch wieder nur am Deffen sind.\n> \n> Ich bin zwar nur Silber aktuell, aber in so einer Situation weiß ich nicht, wie ein Baron mehr bringen soll als ein wenig Druck auf der Map zurückzugewinnen.\n> \n> Korrigiert mich bitte, wenn ich da falsch liege.\n\nIn der Situation solltest du nicht bis zum Inhib durchkommen. Und dann ist der Baron (und sich danach auf 2 Lanes aufteilen) definitiv der richtige Call. \nDer Baron bringt mehr, weil du mit ihm einfach unglaublich gut pushen kannst. Eine Gebuffte Kanone schießt weiter als der Turm. Du musst dich nur neben die Kanone stellen, diese am Leben erhalten (wenn du ganz fies bist, kombinierst du das noch mit dem Banner of Command, dann kriegt der Gegner das Ding einfach nicht Tod) und dann fallen die Türme reihenweise. Oder sie müssen unangenehme Kämpfe annehmen. Entweder sie schicken 2+ Spieler auf die Splitpush Lane (in dem Moment, wo die unten sind, teleportiert er sich zum 5vs3 Towerdive auf die Midlane...), oder sie müssen im 4vs4 oder 1vs1 den Kampf in den gebufften Minions forcieren... oder sie gucken dabei zu, wie die Türme Stück für Stück platt gemacht werden.\nWenn ihr es dann schafft, mit dem Baron auf 2 Lanes zu pushen, hat der Gegner quasi keine Chance die 2 Türme zu halten, die ihr durch das schnelle pushen bekommen hättet. Ein Baron Power Play endet nicht zufällig gerne bei Plus 3.000 Gold. Und das ist noch nicht mal ein gutes. So sieht zumindest die Theorie aus...\n\nDie allgemeine Faustregel bei Globalen Objekten lautet: Nexus (Offensichtlich, bringt 10 Gold), Inhibitioren, Baron, Feuer- und Berg-Drache, Türme, alle anderen Drachen.\n\nBeim Drachen ist das ganze halt nen bisschen komplizierter. Wenn du schon 3 Drachen hast, kannst du zum Beispiel auch gerne den Baron gegen den Elderdrake tauschen. Wenn der Elderdrake dein erster Drache wäre, solltest du das auf keinen Fall machen. (Btw: Die Random Drachen einzuführen war eine gute Entscheidung. Auch dass nicht alle Drachen gleich stark sind. Da bringt so viele Variablen in die Entscheidungsfindung ein, während man vorher ganz klar sagen konnte: \"Der erste, dritte und fünte Drache sind mehr Wert als Türme, die anderen weniger...\" und seine Entscheidungen entsprechend anpassen konnte...\n\nUnd ja, die Frage, ob das Ace gereicht hätte um den Nexus oder nen Inhibitor zu machen, ist eine der spannenden Fragen, mit denen man sich immer wieder auseinandersetzen muss. Und das sind Entscheidungen, die ich auch gerne mal falsch einschätze. Also wo ich den Baron pinge, der Rest allerdings meint, wir machen den Inhib. Dann folge ich denen halt. Ich bin ja überzeugter Demokrat und habe auch die mehr Wissen als die anderen in meinem Team... Auch wenn es manchmal dazu führt, dass wir vor dem Inhib das \"CoutnerAce\" kassieren. 5 respawnende Gegner mit Homeguards können echt fies sein.... Das musst du halt in der Situation auch bedenken... Wenn ihr in der beschriebenen Situation zwar den Inhibitor gerade so kriegt, danach aber 4 Kills und den Baron abgebt... verliert ihr in genau dem Moment definitiv das Spiel. Und ja, das ist eine der beliebtesten Varianten Spiele zu entscheiden: In dem man beim Push nach dem Ace zu lange bleibt...\n\nDas ist halt das schöne an LoL: Es gibt nicht immer die einfache und definitiv richtige Entscheidung. Sondern man muss jedes Mal innerhalb von Sekunden die Situation bewerten und umsetzen. Aber ich sag das mal so: Mit nem Baron nach nem Ace hast du auf jeden Fall als Team nicht die falscheste Entscheidung getroffen. Das ist (gemeinsam mit dem Elder Drake und Inhibitoren) eines der Gamechanging Objectives.","replies":[]},{"poster":"OrangeBubble","date":"2016-09-19T19:21:39.104+0000","up_votes":1,"down_votes":0,"body":"Baron kann dabei helfen, die Base zu deffen, falls man befürchtet, dass der Druck vom Gegner zu groß wird und man nicht gegen Gegner + Minions deffen kann. \nEs ist durchaus eine Entscheidung, die man treffen kann *schulterzuck*\n\nIch persönlich würde auch für Baron gehen, ist nicht so riskant, da man den Baron 100% bekommt und man hat dadurch eben bessere Chancen zu deffen, ich geh aber jetzt auch von einem Szenario aus, wo alle Inhibs von meinem Team down sind, ist nur einer down , dann würd ich einen da lassen und zu 4 eine Lane durch pushen.","replies":[]}]}]},{"poster":"Gang Hei","date":"2016-09-21T13:48:42.789+0000","up_votes":1,"down_votes":0,"body":"In dieser Elo solltest nicht du den Ton angeben. Ist zwar Bescheuert, aber so ist das nunmal. In dieser Elo steigen die Gewinnchancen am ehesten in dem das Team einfach dem gefeedsten nachläuft. Versuche in dieser Elo nicht deepwards zu setzen, wenn dein Team behind ist. Sondern halte dich immer in der Nähe eines Tanks oder eines gefeedeten Mitspielers auf. Und wenn dein ADC meint er müsse Splitpushen (was nämlich fast jeder ADC in dieser Elo meint), dann folge ihm halt und versuche ihn zu unterstützen in dem du für vision sorgst, wenn der midlaner kein SS pingt (Was er wohl eher nicht wird in dieser Elo).... xD\n\nAch und übrigens so als Faustregel für diese Elo: Teamkampf immer auf der Lane machen, niemals im Jungle (vorallem nicht im gegnerischen Jungle, da der Gegner dort wohl die bessere Vision hat)","replies":[]},{"poster":"hshtagniemehrcdu","date":"2016-09-19T15:32:58.736+0000","up_votes":1,"down_votes":0,"body":"Erst einmal...\nAlles, was du an deinem Team bemängelst-\nSchlechte Toplaner, falschen Entscheidungen, schlechter ADC,\nall dass hast du auch im Gegnerteam.\nDaran liegt's also bei 3k Spielen nicht.\n\nAn der Rolle wird es wohl auch nicht liegen.\nAls ich mit Ranked angefangen habe, hatte ich eine grüne Matchhistory mit Soraka und Sona, dabei war ich nur eine Liga zu tief eingestuft worden.\nÜber Championpicks brauchste dir vor Challenger Series keine Gedanken zu machen.\nDas ist ein Tropfen in einem vollem Fass.\nWechsele Champions/Rolle wie du willst, an deiner Winrate wird sich nix ändern.\n\nAlso, was sich zu verbessern lohnt....\nPunkt 1: Vision.\nDein Ward-Verhalten ist extrem schlecht.\nHast auch nur in den seltensten Fällen einen Sightstone.\nDabei ist Vision mit das wichtigste im Spiel.\nMan kann den Fluss über 2 Punkte betreten.\nWenn du beide wardest, hilfst du sowohl deinem Midlaner als auch deiner eigenen Lane.\nEin Ward am Blue/Redbuff, und dein Team weiß, wo der Jungler ist/bzw. nicht ist.\nDementsprechend kann man agressiv oder Passiv spielen.\nDu verlässt dich nur auf dein Glück.\n\nDu beschwerst dich, dass niemand deinen Calls folgt.\nWenn man nicht weiß, wo der Gegner ist, kann man auch selten eine gute Entscheidung treffen.\nWenn du siejst, das der Gegner zur Mitte läuft, und du das Pingst, wird dein eigene Jungler viel öfter zum Countergank kommen.\nUnd do solltest wirklich mal überlegen, ob deine Calls wirklich die richtigen sind- zumindest dein Build ist stellenweise echt grütze.\n\nWenn der andere Support weiß, wie man Support spielt, werden sie eure Bewegungen immer sehen können,\nihr tappt hingegen immer im dunklem (du clearst ja auch keine Wards...)\nDas ist wirklich **extrem **schlecht.\n\nIn einem der wichtigesten Aspekte eines Supports herrscht bei dir Totalversagen.\nSoviel zum grundlegendem Verständnis der Spielmechanik.\n\n\nSoraka ohne Flash...\nDu stirbst zwar nicht häufig, bessere Teams werden deine fehlende Mobility aber gnadenlos ausnutzen.\n\nRod of Ages würde ich als Support generell nicht bauen.\nDu brauchst sehr viel länger für dieses Item als andere APler, hast den Effekt ergo erst viel Später (und da das Stacken muss....).\n\n{{item:3020}} {{item:3136}}  zusamen mit 13 Magic-Pem Sorgt dafür, dass du 43 Flat Magic Pen hast (für knapp 3k Gold).\nAn Gegnern ohne zusätzliche MR (ausser Runen) richtest du damit absoluten Schaden an.\nDas ist relativ günstig und effektiv.\nBei Zyra definitv der empfohlene Item-Weg.\nich würde mit dem Q starten, und das W maxen.\nCC hält länger--> Pflanzen/Team greifen länger an.\n\nBei Brand würde ich die Schuhe und Rylais nehmen, aufgrund des Perma-Slows.","replies":[{"poster":"chriss p bacon","date":"2016-09-19T16:35:57.337+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für die harte, aber ehrlich Antwort. Mein Wardverhalten will ich auf jedenfall verbessern. Ist mir auch schon öfter aufgefallen. Aber wenn du auf deiner Lane gewinnst und keinen Stress hast, fällt dir selbst gar nicht so auf, dass du scheiße würdest.  Nehm ich mir aber sehr zu Herzen. \nSoraka mit Heal statt Flash werde ich noch spielen. Zur Zeit passt mir das besser und wenn ich doch mal aufs Maul fliege bin ich ja offen zu switchen. \n\nMit den Calls an meine Mates meine ich eher so Sachen wie \"es ist unsinnig jetzt Baron zu forcen\" Oder direkte backcalls nach Nem ace statt zu Pushen.\n\nEdit:\nUnd weil du sagst, das hat jeder im Team, auch die Gegner:\nIch hab mir tatsächlich mal ne ganze Zeitlang notiert wie oft ich afks im Team hab und wie oft die Gegner.\nUnd ich hatte tatsächlich deutlich mehr. Etwa Faktor 3.\nAber ich hab bei sowas generell immer Pech. Nicht nur bei lol oder online gaming. Aufs Matchmaking kann keiner Einfluss nehmen. Da muss man eben durch.\nNur mal als kleine Info am Rande. ","replies":[]}]},{"poster":"Doo ","date":"2016-09-19T19:13:48.631+0000","up_votes":2,"down_votes":2,"body":"Bitte spiel kein Lux Support. Wenn ich eine Lux Support im Team habe verliere ich immer, wenn der Gegner Lux support hat gewinne ich immer. \nUnd die winrate von Lux Support ist auch grottig.","replies":[{"poster":"chriss p bacon","date":"2016-09-19T22:28:01.187+0000","up_votes":1,"down_votes":0,"body":"Lux Spiele ich auch nur in der Mitte, Zyra sowohl als auch. Und Soraka, klar nur als Support.\n\nDas Problem an euren Theorien ist: das ist ja alles logisch. Aber erzählt das mal einem Bronze Team, die nur \"group\" und \"we have late\" kennen....","replies":[]}]}]}