{"poster":"SpectralWraithX","date":"2015-03-17T06:32:26.680+0000","title":"Gael, The Keeper of the Tower","subforum":"Concepts & Creations","embed":{"description":null,"url":"http://img1.wikia.nocookie.net/__cb20110305105749/finalfantasy/images/0/09/FF4PSP_Dark_Kain_CGI.jpg","image":null},"up_votes":4,"down_votes":1,"body":"Gael\nThe Keeper of the Tower\n\nOk, so while I was reading Lutzburg’s champion concept for Galahad, I had this idea and put it up for him as a possibility to be used for Galahad. He recommended I post this as a separate piece of work, so I decided to create this character for the idea’s I had in mind for Galahad. \nGael is a melee Ap mage, that draws from Lissandra, Heimerdinger, Jarvan and morgana. Like Galahad, he too is melee but has a few tricks up his sleeve. This is how I envision Gael looking like although this picture is Kain from Final fantasy 4.\nhttp://img1.wikia.nocookie.net/__cb20110305105749/finalfantasy/images/0/09/FF4PSP_Dark_Kain_CGI.jpg\n\n\n I am unsure how to analyse weaknesses, but he will be a more mobile version of Galahad. Using his tower, he gains buffs for his other abilities that give him a lot of zoning options but also require skilful use of positioning and knowing how to use them to poke your opponents down. \n\nDesign goals: When I was looking at Lutzburg's champion concept, he mentioned use of a lightning rod. So, I got the idea that maybe there could be a champion that uses a lightning tower and all his abilities and strengths come from him correctly using his tower. I wanted to make him in a way that he was fun to play and yet had definite drawbacks as well. He is similar to heimerdinger in that he falls off without his tower. And yet, since that is also his strength, I had to make it something difficult to do, but not too difficult. I hope I have succeeded in that. Enjoy :)\n\nLore\nTwo twin boys named Gael and Galahad were raised in the mountains outside Ionia. It was there that they learned their craft. The boys discovered that they both had an affinity to electricity and lightning. They both trained under the same master, who suggested that they go to Zaun to train for a bit. While there in Zaun, they the two brothers laid eyes on Janna. The two fell instantly in love with her. Both vowed to do their best to win her heart. From that moment on, they became more rivals then brothers. After returning to Ionia the two continued to train under their master, preparing for the trial to join the famous storm knights. The day finally came, for the trial. Gael watched as his brother effortlessly passed the tests. He watched as his brother donned the armour of the storm knights and took up his new sword. And than, it was his turn. He too effortlessly did all that was asked in the trial. Proudly bearing himself to the examiners, he awaited their verdict. When they shook their heads, he was shocked. \"Why? I did everything that Galahad did.\" He cried out. \"You also revealed a weakness and the darkness of your heart. In Galahad, there was no darkness.\" The examiner told him. Gael was absolutely shattered. Then rage entered his heart and he did the unthinkable. Using his powers he shot a lightning bolt at the examiners back which killed him instantly. As the rage left him, he realised what he had done. He fled from the city of Ionia and wandered the country. As he wandered his thoughts continually were drawn to Janna. In his current state he knew she would never accept his love. Depressed, he wandered from city to city. Eventually he reached the city called Piltover. It was there that he met the father of Orianna, Corin Reveck. Corin invited Gael to his home, feeling sorry for the man. It was there that he first met Orianna. Corin had just finished creating her and told him of his daughters dream to join the league of legends. Gael was captivated by the quality of the clockwork girl and it suddenly came to him that Corin could help him. He told Corin everything, from meeting Janna to his failing to join the storm knights and killing the examiner. After hearing Gael's story, Corin flatly refused to help him unless he made a promise to never kill anyone else. Gael, agreed to Corin's terms and Corin used his knowledge of electricity and lightning to form a transportable tower. The tower would receive strength from Gael’s own electrical abilities as well as strengthening his abilities. He stayed with Corin for a few years, developing and perfecting his talents, growing used to the mechanical symbiotic relationship between him and his tower. During this time, Orianna left to join the league After several years, his master came to piltover and told him that Galahad had joined the league of legends, boasting that he would win Janna’s heart by winning the infamous league. Outraged, Gael decided to join too. He thanked Corin, who then asked him to protect his daughter Orianna. Gael promised him he would and joined the league. Upon joining, as promised he again met with Orianna. While he does struggle to get past her alien robotic nature, he becomes her first friend, accepting her for who she is. Disdaining swords, because it was his brother’s signature weapon, he instead takes to the spear. \n“I will defeat my brother.” \n\n\nPassive: Electrified weapon –When within range of tower, he gains magic damage equal to 5% of his ability power added to his auto attacks. \nStorm charge –After every 5th spell used, a lightning bolt will strike his weapon from the sky, granting him 1 charge for his ultimate. If not in range of his lightning tower it takes 7 spells. Upon reaching full storm charges his spear deals 15% of his ability power as magic damage in his auto attacks. This bonus is lost when the ultimate is used and reverts back to the 5% ap ratio.  \n\nhttp://www.hiveworkshop.com/forums/resource_images/11/icons_10972_atc.jpg Q, Lightning bolt. Single target straight line projectile skill shot that damages first enemy struck dealing magic damage. Deals 80/115/150/185/220 magic damage. Cd will be similar to Lissandra’s q.  \n\nPassive: Amplifier, when lightning bolt is cast at the tower it acts as an amplifier giving it more range and an aoe effect. The range extension is fixed and when you target the tower it will show you how much more range you get. The range extension works similar to syndra’s q, e combo. The closer you are to the tower, the further the lightning bolt will go. If you are far away from the tower, the bolt will only get a little boost past the tower.  This ability is like a weird mix of syndra’s q,e combo, combined with the aoe effect of Lissandra’s q. Could also be considered to be near to Jayce’s e, q combo. \n\n\nW, Electrical Current. A short dash to aoe damage spell. Gael dashes 200 units forward and thrusts his spear into the ground, sending out an electrical current that deals aoe magic damage over time in a cone. The current lasts for 5 seconds. I am unsure about damage ratio’s for this. \n\nPassive: Electromagnetic pull, when his electric current is used within tower range, all enemies within the current are slowed by 10-15% depending on how close to the tower they are. The closer to the tower, the bigger the slow.  \n\n\nE, Lightning Tower, Gael throws out a pre made rod that instantly turns into a lightning tower. Does give gold on destruction of tower. The amount of gold given is yet to be determined. This tower deals 100/125/150/175/200 magic damage to a random enemy within its range. It attacks once every 3 seconds and will remain standing until destroyed (similar to heimerdinger’s turrets). It will help buff his other 2 basic abilities. Can be destroyed by auto attacks and abilities. Once destroyed, it goes on cd. The ability can be reactivated. When reactivated, the tower becomes a rod once more and can be repositioned. Repositioning can only happen once every 20 seconds. Has a 10 second cd once destroyed. \n\n\nR. Electrical Discharge. Cooldown, 120/100/80 seconds. Requires 20/15/10 storm charges in order to cast. No mana cost. Gael leaps 700units to the tower and thrusts his spear into it, emptying all storm charges into the tower. The tower becomes overcharged with electricity until it can’t take anymore. The tower unleashes all the stored energy with in, electrocuting and stunning enemy champions within the range of the tower. It does 175/250/325 magic damage. Once this effect has ended the tower is completely devoid of power for 7 seconds, losing the bonus effects and damage. Tower reactivates after 7 seconds. Stun duration, 1.5 seconds at all levels. \n\nWhen playing as Gael. Use your abilities passives to make the most use of your tower. Make the enemy scared to come in tower range and just poke from a distance. Another way to play him is from the front of your tower, last hitting minions and using your w to slow them when they try to engage you.  Once you’ve got some items under your belt, you can leap into the fray. \n\nWhen playing against Gael. Use ranged abilities and auto attacks to bring down his tower. Without his tower his battle effectiveness greatly drops. Once he gets his ult, be careful of his initiation. He may be a squishy melee mage but he can reposition his turret than leap to it with his ult, causing a massive aoe stun that can allow your team to be caught in a wombo combo. Be aware also that he can use his ult to disengage. However it has a fairly long cool down so when you know it’s down, have at him. Keep an eye out also for when he repositions the tower. Once he does that he cannot do it again for 20 seconds. \n\nLet me know what you guys think.","replies":[{"poster":"SpectralWraithX","date":"2015-03-20T00:31:06.940+0000","up_votes":2,"down_votes":0,"body":"Since this champion was only possible because of Lutzburg's Galahad concept I figured I would post the link to his concept here. Hope you guys enjoy both of our concepts. http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/ZgHJ1QrE-galahad-the-storm-knight","replies":[]},{"poster":"SpectralWraithX","date":"2015-07-30T03:50:32.598+0000","up_votes":1,"down_votes":0,"body":"Hey guys, been a while. Just giving a bump to my single champ concept to see if I can get some feedback before I give up and completely retire from trying to make champ concepts.","replies":[]},{"poster":"SpectralWraithX","date":"2015-05-15T09:30:10.860+0000","up_votes":1,"down_votes":0,"body":"Looking for feedback on this concept. Constructive criticism is welcomed.","replies":[]},{"poster":"SpectralWraithX","date":"2015-04-19T01:27:06.935+0000","up_votes":1,"down_votes":0,"body":"Bump","replies":[]},{"poster":"SpectralWraithX","date":"2015-04-07T07:16:46.836+0000","up_votes":1,"down_votes":0,"body":"At a suggestion from my brother, I am considering changing the ult. Instead of jumping to the tower, cause everyone will likely avoid the tower, he jumps forward 800 units and unleashes all storm charges in his spear. This causes a straight line of electrical energy from his starting point to his end point. It is very narrow but because the electrical power is so strong, all enemies caught in the path are stunned for 1.5 seconds. The damage is the same as specified above. I want to hear everyone's opinions on this before I change it from what it currently is.","replies":[]},{"poster":"SpectralWraithX","date":"2015-04-02T01:51:44.315+0000","up_votes":1,"down_votes":0,"body":"Hi guys, Gael wants feedback. No matter how 'shocking' it might be.","replies":[]},{"poster":"FlameHalbrdOkido","date":"2015-03-26T04:11:13.163+0000","up_votes":1,"down_votes":0,"body":"Its real cool to see another champion concept creator team, working together across miles of terrain, yet we are all so close here on the boards","replies":[{"poster":"SpectralWraithX","date":"2015-03-26T08:19:00.082+0000","up_votes":1,"down_votes":0,"body":"Lol, well he was the one that sort of got me going on trying to tweak other peoples concepts. And yeah, it's nice. I'm actually surprised that no one else has commented on the fact that I'm from the oceania region.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-03-25T18:58:12.635+0000","up_votes":1,"down_votes":0,"body":"I sent the draft.  :)","replies":[{"poster":"SpectralWraithX","date":"2015-03-25T19:15:06.018+0000","up_votes":1,"down_votes":0,"body":"Sent a brief email requesting clarification on a couple of things.","replies":[]},{"poster":"SpectralWraithX","date":"2015-03-25T18:59:16.045+0000","up_votes":1,"down_votes":0,"body":"Reading it now. Give me a few minutes.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-03-25T18:51:29.209+0000","up_votes":1,"down_votes":0,"body":"Got it!","replies":[{"poster":"SpectralWraithX","date":"2015-03-25T18:54:30.946+0000","up_votes":1,"down_votes":0,"body":"Sorry for bothering you at work.....","replies":[]}]},{"poster":"Riot Lutzburg","date":"2015-03-25T18:39:17.970+0000","up_votes":1,"down_votes":0,"body":"I already updated my Galahad lore.  Check it out when you can.  :)\n\nIf you can't sleep and want something cool to look at... Maybe I can show you my current rough draft of Rabadon, the Death Mage.  {{item:3089}} \n\nShoot me an email address and I'll send it to you in a few minutes.  You can delete it off the forums as soon as I see it so that no one else can see it and hassle you.","replies":[{"poster":"SpectralWraithX","date":"2015-03-25T18:48:37.731+0000","up_votes":1,"down_votes":0,"body":"Did you manage to see it before I deleted it?","replies":[{"poster":"Riot Lutzburg","date":"2015-03-25T18:50:30.005+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=zGURZERq,comment-id=00040001,timestamp=2015-03-25T18:48:37.731+0000)\n>\n> Did you manage to see it before I deleted it?\n\nCrap, I got pulled into a design meeting at work.  I'm standing by now, I'll catch it as soon as you post it!","replies":[]}]}]},{"poster":"Riot Lutzburg","date":"2015-03-25T18:31:14.826+0000","up_votes":1,"down_votes":0,"body":"New lore looks great!  I like how you went down this \"evil twin\" path where the story now becomes about redemption and finding one's own path.  Really neat.\n\nI will adjust my lore a bit to include this angle.  :)","replies":[{"poster":"SpectralWraithX","date":"2015-03-25T18:35:50.766+0000","up_votes":1,"down_votes":0,"body":"Glad you like it. Sigh. 2:34am and still can't sleep..... Give me a concept to tweak lol.","replies":[]}]},{"poster":"SpectralWraithX","date":"2015-03-23T13:18:12.824+0000","up_votes":1,"down_votes":0,"body":"Hey guys, just wondering what you think is a reasonable range for his lightning tower. If you have also have feedback on my concept overall then feel free to comment.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-03-17T17:49:39.650+0000","up_votes":1,"down_votes":0,"body":"I really love the twist you put on my Galahad concept and I fully endorse Gael as a separate entity and worthy brother of Galahad!","replies":[{"poster":"SpectralWraithX","date":"2015-03-18T14:51:07.220+0000","up_votes":1,"down_votes":0,"body":"Glad you approve. I am aware that I may need to tweak his kit a bit. What did you think of the lore? Also, could you identify his strengths and weaknesses as you see them? I think I did an ok job at outlining how to play against him but I need an expert opinion.","replies":[{"poster":"Riot Lutzburg","date":"2015-03-19T01:35:31.878+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectralWraithX,realm=OCE,application-id=A8FQeEA8,discussion-id=zGURZERq,comment-id=00000000,timestamp=2015-03-18T14:51:07.220+0000)\n>\n> Glad you approve. I am aware that I may need to tweak his kit a bit. What did you think of the lore? Also, could you identify his strengths and weaknesses as you see them? I think I did an ok job at outlining how to play against him but I need an expert opinion.\n\nLore looks good to me.  I like the connection to Orianna a lot.  Our lores are fairly different but I don't think that's an issue.\n\nI think you actually did fine on analyzing strengths and weaknesses.  The positioning and need to protect his lightning rod is of the utmost importance which could limit his effectiveness during team fights.  His mobility and ability to dash in and out will help compensate for that, though.","replies":[{"poster":"SpectralWraithX","date":"2015-03-19T10:38:58.627+0000","up_votes":1,"down_votes":0,"body":"Lore is now updated. I had to change a few things. For example, I had put that they were raised outside Zaun whereas you said they were raised in Ionia. So I changed mine to match yours. Let me know what you think.","replies":[]},{"poster":"SpectralWraithX","date":"2015-03-19T10:05:48.511+0000","up_votes":1,"down_votes":0,"body":"Cool. I'll update the lore and give a more concrete reason why he left his training with his brother and went his own way. That'll give you something to look forward to. :) Also, I know this is a selfish request, but do you think you could put Gael somewhere in your lore after reading the updated version of my lore?","replies":[]}]}]}]}]}