{"poster":"lightdragoon88","date":"2015-04-10T18:25:27.554+0000","title":"Why the Caster Hate on Malzahar?","subforum":"Esports","up_votes":22,"down_votes":2,"body":"https://www.youtube.com/watch?feature=player_detailpage&amp;v=cNUYUsOEYO0#t=4686\r\n\r\n\r\nSo Malzahar was picked today in the LCK and despite winning and with a positive KDA, the Casters kept S****** on the Malzahar pick the entire time. They weren&#039;t even really casting the game. They just spent the entire time making fun of the player who picked Malzahar. \r\n\r\n\r\nWhat was their deal?","replies":[{"poster":"Chromatic Eagle","date":"2015-04-12T00:49:16.108+0000","up_votes":1,"down_votes":3,"body":"EU casters trashed Yorick when he was picked. I think he won too.","replies":[{"poster":"SpecterVonBaren","date":"2015-04-12T05:42:57.290+0000","up_votes":9,"down_votes":1,"body":"Actually, they were just surprised but complimented it because they recognized the strategy from earlier seasons.","replies":[{"poster":"lightdragoon88","date":"2015-04-13T04:08:16.075+0000","up_votes":4,"down_votes":1,"body":"Meanwhile these guys are like \"Yeah Malzahar has a %HP pool and if they fight on said pool it can work, but Orianna could of done that better.\"\n\nHow the heck can Orianna do that better?","replies":[]}]}]},{"poster":"Akeydel","date":"2015-04-12T10:46:02.589+0000","up_votes":7,"down_votes":1,"body":"Before watching the video, I thought this was just a Malz-main QQ post\n\nBut shit, dude, they talk down on him for the MAJORITY of the time they were talking, the hell is wrong with them?\nHe gets a great ult pick that lets the team take down mid inhib and they say \"congrats on the only malz ult that will ever do anything\". A few minutes later he keeps the adc alive with the suppress on hec. \nThey talk about the fact he DOESNT SELL DORANS ffs","replies":[{"poster":"lightdragoon88","date":"2015-04-12T11:11:48.736+0000","up_votes":2,"down_votes":1,"body":"I KNOW RIGHT!!?\n\nIf the Malzahar player ended up like how that Garen did (I like playing Garen too but that was a poor showing of Garen) then I wouldn't of done this. \n\n\nBut aside from being first-blooded, he played Malzahar really well.","replies":[]}]},{"poster":"MusicTeacherSona","date":"2015-07-04T21:31:05.300+0000","up_votes":5,"down_votes":0,"body":"Lol \"jax is the only real damage source\" with not just mal but also a sivir whose chunking people and the random \"mal is such a bad pick\" while they take baron.... like what?","replies":[{"poster":"lightdragoon88","date":"2015-07-05T02:29:32.908+0000","up_votes":1,"down_votes":0,"body":"Cause jax and sivir are \"meta\" picks or something.","replies":[]}]},{"poster":"Yfrappefort","date":"2015-07-04T19:55:44.848+0000","up_votes":5,"down_votes":1,"body":"1:41:27 : \"They are gonna take him out immediatly because he's Malzahar.\"\n\nThat right there just blew my mind. So if he took another immobile mage, like Viktor, and died in the same way (chain CC), it would have been ok, but not for Malzahar?\n\nI find this very unrespectful and lacking professionalism.","replies":[{"poster":"lightdragoon88","date":"2015-07-05T02:23:35.041+0000","up_votes":1,"down_votes":0,"body":"Agree. Heck a mobile mage would of die too from the chained CC.","replies":[]}]},{"poster":"xJLx MCHammer","date":"2015-04-14T21:03:09.627+0000","up_votes":5,"down_votes":1,"body":"Monti hates on anything that goes outside the meta. He refuses to accept changes till it's so obvious. He also has that attitude that makes me want to slap him. His remarks about players and predictions is laughable. \n\nI loved watching him in IEM tournament, as the GE Tigers got destroyed and he kept saying how they are number one and leagues above it. Laughably he kept saying it as they lost lol\n\nHe is a joke","replies":[{"poster":"Earl Eulrich","date":"2015-07-07T14:39:14.799+0000","up_votes":2,"down_votes":0,"body":"same goes for the power-rankings, it´s just soo obvious he can´t acceppt that Koreas level of play dropped rather dramatically after all of their best players just left for good.\n\nThough if Faker would play Malz it would certainly be the best champ in the world all of a sudden...","replies":[]},{"poster":"lightdragoon88","date":"2015-04-14T22:19:37.999+0000","up_votes":2,"down_votes":1,"body":"Wonder why they are keeping him then?","replies":[{"poster":"xJLx MCHammer","date":"2015-04-14T22:49:09.492+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=lightdragoon88,realm=NA,application-id=9hBQwnEU,discussion-id=lXlFBwjX,comment-id=000a0000,timestamp=2015-04-14T22:19:37.999+0000)\n>\n> Wonder why they are keeping him then?\n\nHe knows facts. He does states a lot of statistical information or general info. But apparently, they are ok with him stating his bias opinion because it's mostly in favor of the Koreans","replies":[]}]},{"poster":"Helmight","date":"2015-07-05T02:36:35.206+0000","up_votes":1,"down_votes":0,"body":"Bless this post. Monte is awful and I'm SO glad I only ever have to hear him twice a year (MSI and Worlds).","replies":[]}]},{"poster":"skyfall619","date":"2015-04-13T05:05:32.254+0000","up_votes":5,"down_votes":1,"body":"coco gonna dies instantly here beasue he is malz. like cmon wat squishy survived a hec ult and cho combo","replies":[{"poster":"lightdragoon88","date":"2015-04-14T02:28:37.126+0000","up_votes":2,"down_votes":1,"body":"Well they seem to think every squishy but Malzahar.","replies":[]}]},{"poster":"jerradwolf","date":"2015-08-14T08:25:57.619+0000","up_votes":2,"down_votes":0,"body":"yeah wtf is this caster saying?? even if Orianna got dove like malz did like that she wouldn't have survived that. as malzahar as one of my mains, this caster is so ignorant. Why would riot let someone that talks down about any champion like that voice an event. It shouldnt matter if a champ is unpopular or seen as bad. hell! remember the poppy plays that happened and then she picked up in popularity? In my opinion, a caster should talk about strategies and plays ...not rag on a champ because they are bias as fuck.","replies":[{"poster":"lightdragoon88","date":"2015-08-14T13:58:28.030+0000","up_votes":3,"down_votes":0,"body":"I remember the Poppy game. Whenever the Poppy got a kill or did something good they praised the player for using poppy so well. Whenever this guy did a good play with Malzahar, they were like \"who cares it Malzahar. Let's go back to making fun of him carrying doran's ring\"","replies":[{"poster":"jerradwolf","date":"2015-08-14T18:37:25.987+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=lightdragoon88,realm=NA,application-id=9hBQwnEU,discussion-id=lXlFBwjX,comment-id=00170000,timestamp=2015-08-14T13:58:28.030+0000)\n>\n> I remember the Poppy game. Whenever the Poppy got a kill or did something good they praised the player for using poppy so well. Whenever this guy did a good play with Malzahar, they were like \"who cares it Malzahar. Let's go back to making fun of him carrying doran's ring\"\n\nexactly! wtf is wrong with these people. just contributing to the toxic community that is league. way to lead by example riot","replies":[]}]}]},{"poster":"D1egend","date":"2015-07-04T20:09:53.579+0000","up_votes":1,"down_votes":1,"body":"i am too lazy to go through the entire game LOL can you give me some time stamps for examples?","replies":[{"poster":"LittleBeazle","date":"2015-07-07T01:35:26.991+0000","up_votes":3,"down_votes":0,"body":"Try the entire video?","replies":[]}]},{"poster":"7ha7guy777","date":"2015-07-04T20:47:55.994+0000","up_votes":3,"down_votes":0,"body":"I'm amazed that they were trash talking his damage and the fact that he was building Rylai's. On a semi related note, does this mean malz has a 100% win rate in competitive?","replies":[{"poster":"lightdragoon88","date":"2015-07-05T02:24:09.801+0000","up_votes":1,"down_votes":0,"body":"Maybe? I don't know of other games this season.","replies":[]}]},{"poster":"soh1gh2","date":"2015-04-10T18:34:47.866+0000","up_votes":3,"down_votes":0,"body":"idk i think malz is a good pick in tank meta and he can stop dives","replies":[]},{"poster":"Trídent","date":"2015-05-18T04:19:47.511+0000","up_votes":5,"down_votes":2,"body":"They deserve to be fired. This makes me sick","replies":[]},{"poster":"darkmatchwaldo","date":"2015-08-14T16:35:47.971+0000","up_votes":1,"down_votes":0,"body":"Lol it was a good pick. The percent damage was damn effective. Especially for that baron.","replies":[{"poster":"agbudar","date":"2015-08-14T16:37:33.101+0000","up_votes":2,"down_votes":0,"body":"it has a max damage cap against monsters.\n\nbut yes a well placed W in team fights is devastating","replies":[{"poster":"darkmatchwaldo","date":"2015-08-14T17:00:08.772+0000","up_votes":1,"down_votes":0,"body":"Not familiar with him i had no idea lol","replies":[{"poster":"lightdragoon88","date":"2015-08-14T17:20:00.959+0000","up_votes":1,"down_votes":0,"body":"Neither was the caster.","replies":[]}]}]}]},{"poster":"The1Adventurer","date":"2015-07-07T13:41:56.990+0000","up_votes":1,"down_votes":0,"body":"I would make an AD Malz joke or something but I haven't even watched the video yet. Judging from the comments this is just a sad day for Malz. {{item:3070}} {{item:2044}}","replies":[{"poster":"lightdragoon88","date":"2015-07-07T19:23:34.227+0000","up_votes":2,"down_votes":0,"body":"What a sad day for Malzahar players and therefore: The World.","replies":[]}]},{"poster":"insaiyanbacca","date":"2015-07-04T20:59:17.451+0000","up_votes":2,"down_votes":0,"body":"wow","replies":[]},{"poster":"RottedApples","date":"2015-07-02T23:52:58.728+0000","up_votes":2,"down_votes":0,"body":"to be fair i hate on cho'gath mids like the casters do, but it doesn't make it bad. Infact we've already proved that it is good.","replies":[]},{"poster":"Daedalus871","date":"2015-04-12T01:40:41.121+0000","up_votes":3,"down_votes":1,"body":"I can no longer take anything Korean casters seriously. And the first time I watched them too.","replies":[{"poster":"lightdragoon88","date":"2015-04-12T01:54:54.751+0000","up_votes":2,"down_votes":1,"body":"I guess we aren't missing much then.","replies":[]}]},{"poster":"ZeroAnarchy","date":"2015-04-10T20:03:18.282+0000","up_votes":2,"down_votes":5,"body":"Because Malzahar is just a win lane champion, he doesn't offer much because of the fantastic item {{item:3140}}","replies":[{"poster":"lightdragoon88","date":"2015-04-11T00:08:41.799+0000","up_votes":3,"down_votes":1,"body":"You can say the same thing about Zed yet he played a lot.","replies":[]}]},{"poster":"DatPikachuTho","date":"2015-04-10T18:26:40.910+0000","up_votes":2,"down_votes":4,"body":"The casters are stupid most of the time.","replies":[{"poster":"lightdragoon88","date":"2015-04-10T18:28:15.822+0000","up_votes":3,"down_votes":1,"body":"Yeah but most of the time it funny stupid. This was just mean stupid.","replies":[{"poster":"DatPikachuTho","date":"2015-04-10T18:43:25.445+0000","up_votes":3,"down_votes":1,"body":"That's because MonteCristo is an asshole.","replies":[{"poster":"Jahsuo Onfroy","date":"2015-04-12T09:26:48.967+0000","up_votes":2,"down_votes":1,"body":"I do not think montecristo is in any position, caster or not, to be so disrespectful. We should have professional analysts commentate montecriso, they can boost their self-image off of taking shots at him.","replies":[]},{"poster":"Stillname","date":"2015-04-12T05:33:34.611+0000","up_votes":2,"down_votes":1,"body":"AFAIK MonteCristo doesn't even play the game anymore so I have no idea how he thinks he is credible for non meta champion picks... I mean if someone in the pros doesn't pick them he literally doesn't even see them. \n\nAnd I'm pretty sure even when he did play league the best he ever got to was silver rank which is average but for someone who spends their whole day around league, well I guess the video speaks for itself. He is clueless.\n\nIt is funny to see him at worlds every year talking like hes trying to get the Korean players in bed or something.","replies":[]},{"poster":"lightdragoon88","date":"2015-04-10T18:45:31.504+0000","up_votes":2,"down_votes":1,"body":"I see....","replies":[]}]}]}]},{"poster":"Only Play Darius","date":"2015-04-12T07:13:17.586+0000","up_votes":4,"down_votes":2,"body":"That video made me sick, those guys are scum. I feel like I need to take a shower, just hearing all that makes me feel dirty.\n\nBeing a sarcastic asshole like that would get you chat banned in soloQ. Meanwhile these guys are getting paid to publicly belittle someone's accomplishments in a professional match, all because they picked an uncommon champ, and actually did well. The shoutcasters acted the exact same way that one game garen was picked, and even though garen actually did nothing that game, they had no right to publicly humiliate that player and turn him into a laughing stock.\n\nThere is no place for that kind of talk in any league game,especially if it wants to be treated as a legitimate sport, and letting the casters get away with that kind of caustic banter only breeds contempt for the league esports community.","replies":[{"poster":"lightdragoon88","date":"2015-05-18T04:17:08.492+0000","up_votes":2,"down_votes":1,"body":"I agree.","replies":[]}]},{"poster":"Xeno Dragoon","date":"2015-04-14T22:38:19.453+0000","up_votes":2,"down_votes":1,"body":"Its Been A while my fellow dragoon","replies":[{"poster":"lightdragoon88","date":"2015-04-14T23:56:20.034+0000","up_votes":2,"down_votes":1,"body":"Oh hey Dragoon.","replies":[]}]},{"poster":"SpecterVonBaren","date":"2015-04-12T06:12:22.199+0000","up_votes":2,"down_votes":1,"body":"I guess it just means it doesn't matter if its a player or a caster, people will still be a$$holes for their picks. Seriously, they sounded just like the kinds of people you run into in solo que, I mean holy shit the amount of times they just rage on him is disgusting.","replies":[{"poster":"lightdragoon88","date":"2015-04-12T19:43:16.141+0000","up_votes":2,"down_votes":1,"body":"I wonder if we can report them for Verbal Abuse?","replies":[]}]},{"poster":"Thresh Outta Fux","date":"2015-08-14T16:55:00.630+0000","up_votes":1,"down_votes":0,"body":"I feel like the casters really had no idea what they were talking about.\n\nThe Malzahar player had most farm on his team, while knowing enough about his mechanics to play him skillfully.\n\nThat being said, the build he chose for Malzahar seems like someone who likes to play other champions, and just carried over the build onto Malz. Not very efficient.\n\nBut the casters weren't ripping on him for his poor itemization choices. They were ripping on the champion itself.\n\nAlso, their team was centered around Jax snowballing. Malzahar may have just been bait to take the heat off Jax.","replies":[]}]}