{"poster":"frakvancion","date":"2017-12-22T22:53:04.426+0000","title":"Miért nem lehet normálisan játszani?","up_votes":3,"down_votes":2,"body":"Mi&eacute;rt nem lehet, azt megoldani, hogy a gy&eacute;m&aacute;nt rang&uacute; j&aacute;t&eacute;kosok, amikor az ez&uuml;st haverjaikkal j&aacute;tszanak ne ez&uuml;st ellens&eacute;ghez dobja, hanem a legnagyobb rangba l&eacute;vőkh&ouml;z. Nekem nem egy  ilyen meccset j&aacute;tszottam m&aacute;r &eacute;s akkor is kikaptam, mert term&eacute;szetesen engem okoltak az&eacute;rt, mert teszem fel 0/15/2-ben voltam a gy&eacute;m&aacute;nt 5 rangban l&eacute;vő ellen. Szerintem, ez&eacute;rt lesz egyre rosszabb a ez a j&aacute;t&eacute;k. (M&eacute;g sz&eacute;p szavakkal fogalmaztam).","replies":[{"poster":"Anesydora","date":"2017-12-25T17:26:01.703+0000","title":null,"up_votes":1,"down_votes":0,"body":"Énis beszo... ezt az mmr dolgot elkezdtem rankedezni S5 be sobott be nem is volt gond amig egyszer nem vesztesz ugy hogy 0/5 (vagy roszabb) ba vegzel mert a hulye team nem tud pingelni stb.. na akkor itt mar csokken az mmr ed es szarabb jatekosokat kapsz ugyhogy innentol csak lefele vezet az ut :’) S4 80lp rol S5 0 lp re estem vissza mert egyszeruen nem kapok jo jatekosokat.. persze fenyezhetem magam h en soha semmit nem rontok el.. de enis el szoktam rontani valamit de altalaban nem rajtam mulik hogy vesztunk mert mindig nyerem a lanem.. Namoat ennek koszonhetoen jatszani se merek mar rankedet mer felek h visszafob B1 be ugyhogy meg nemtom mi lesz... szeretnek majd egy normalis team et es talan ugy elkezdeni megint mert akkikel mostanaba sorsol ossze.. szegyen....","replies":[]},{"poster":"Vágottszemu","date":"2017-12-23T08:46:38.428+0000","title":null,"up_votes":2,"down_votes":2,"body":"Mert semmi köze a rangnak ahoz hogy milyen ellenfelet dob be normálon. Mert normálon külön MMR van.\n---\nVágottszemu","replies":[{"poster":"frakvancion","date":"2017-12-23T18:12:15.418+0000","title":null,"up_votes":1,"down_votes":2,"body":"Az egy dolog, hogy nincs köze, de attól még megcsinálhatná a RIOT, hogy a premade legmagasabb rangját vegye figyelembe.","replies":[{"poster":"Complex VN","date":"2017-12-23T20:53:10.827+0000","title":null,"up_votes":1,"down_votes":0,"body":"És az miért is lenne jó? Normálnak az a lényege, hogy nem nézi a rangot. Ha mondjuk egy silveres barátommal akarok játszani akkor ő kapjon maga ellen diások. Vagy ha 5-ös premadebe megyünk akkor kapjunk magunk ellen full diás premadet? Kicsit átgondolatlan ötlet. \n\n> lesz egyre rosszabb a ez a játék\n\nA normal matchmakingjébe szerintem a kezdetek óta nem nyúltak bele, szóval kicsit fura azt mondani, hogy pont emiatt lesz rosszabb.","replies":[]},{"poster":"Vágottszemu","date":"2017-12-23T19:06:33.778+0000","title":null,"up_votes":1,"down_votes":4,"body":"Látszik hogy nem tudod felfogni hogy  a rendszer  a rangokat nem veszi figyelembe.\n---\nVágottszemu","replies":[]}]}]},{"poster":"ptlg225","date":"2017-12-23T10:29:25.823+0000","title":null,"up_votes":1,"down_votes":2,"body":"Azért mostanában tényleg elég vacak tud lenni ez az MMR-es rendszer, bárhol is játszol.\nMúltkor is úgy kedden én B1 és barátom UNRANKED mentünk gondoltam megmutatom neki milyen a Ranked egyéni.\n\nKapunk szépen enemynek egy Silver valami WW-t, aki igazából a másikon Flex PLATINA.\nGondolom valami SMURF lehetett vagy keveset játszott Egyénit és neki kicsi maradt, csak a Flexet persze nem nézi a rendszer, mert az másik MMR.\nMondanom kell milyen könnyű dolga volt a másik csapatnak?\n\nOké ezután megyünk Flexre én S3 és barátom még mindig UNRANKED, hát megint valami \"fajinul\" számolt a rendszer.\nEnemy-ben az ADC Egyénin PLATINA, aki gondolom épp az S supportot Boostolta, na köszi megint RIOT matchmaker. De még a MID Talon is beírta, hogy ő is Egyénin DIA igazából, csak azt megint nem nézte a matcmaker, mert MÁSIK MMR.\nVégűl beírhatták az \"IZI\"-t, mert tényleg az volt nekik.\nNa ekkor lett elegem egy időre a Rankedből .\n\nDe igazából mostanában így van normálon is, vagy könnyen nyersz vagy gyakorlatilag esély nélkül porig aláz az ellenfél.\n\nLehet tényleg te is csak kikaptál párat ezek közül.\nÉn is tudom milyen idegesítő tud lenni a játék, de azért sok sikert a továbbiakhoz.","replies":[{"poster":"frakvancion","date":"2017-12-23T18:10:59.511+0000","title":null,"up_votes":1,"down_votes":1,"body":"Nem egy volt. Persze volt 1-2 alkalom amikor velem volt egy diamondos de azt a meccset nem élveztem mert mindenféle nehézség nélkül nyertünk ( persze a diamondos is beírta hogy \"izi\"). Csak azt nem értem, hogy miért nem csinálja meg a RIOT. hogy a premadeket a csapat legnagyobb rangját nézze vagy esetleg, ha az egyik csapatban van diamond akkor a másikba is rakjon egyet.","replies":[]}]}]}