{"poster":"InfernosDio","date":"2015-05-31T14:37:31.390+0000","title":"Connection Failure?","subforum":"Report a Bug","up_votes":3,"down_votes":1,"body":"I use a mac and when I open League once and sign in, it tells me there is a connection failure. When I open it a second time, I log into the client. I ensure you, I have a secure internet connection. Is this a bug on mac, or not?","replies":[{"poster":"FONEmobile","date":"2015-05-31T14:51:10.213+0000","up_votes":3,"down_votes":0,"body":"This happens to me also, without fail.  The first login will show \"Logging in...\", then pop up a Connection Error window.\n\nClosing the Client and logging in again will be successful.  If I tried to close the Client before logging in, it will still give the same Error pattern.  Seems that it needs to try to log in first, fail, then be successful.\n\nThis is pretty irritating behavior.  Please help.\n\nI'm on a PC, Windows 7.","replies":[]},{"poster":"CoderDood","date":"2015-06-01T20:39:38.403+0000","up_votes":1,"down_votes":0,"body":"Same here... First I thought it could be a routing issue since I'm playing on NA servers from another continent but then I googled it and it was clear it's a recent bug affecting many players... \n\nFirst login always fail, client closes itself. Next time it works.","replies":[]},{"poster":"Solomons Key","date":"2015-05-31T21:33:41.813+0000","up_votes":1,"down_votes":0,"body":"I am also having this issue since last week. I have to log in multiple times. Nothing has changed on my computer except patches from Riot.","replies":[]},{"poster":"moonstones","date":"2015-05-31T17:12:27.424+0000","up_votes":1,"down_votes":0,"body":"Hey InfernosDio,\n\nThis is an issue we're currently aware of and investigating. We have set up a [post](http://boards.na.leagueoflegends.com/en/c/help-support/KxOhw3OU-login-issues-on-na) with a few ways to potentially troubleshoot the issue. \n\nAs the post mentions, if these potential solutions aren't helping you, feel free to submit a ticket to Player Support, and we'd be happy to assist you further there.","replies":[]},{"poster":"Lothàrs Edge","date":"2015-05-31T16:55:11.015+0000","up_votes":1,"down_votes":0,"body":"No, it's just one of the many bugs that many of us are receiving.\n\nI'm not about to mess around with my computer for the sake of one game when no other game has had this issue or suggested those \"solutions\" that would most likely cause more problems than solve anything... lol.","replies":[]},{"poster":"God of Earth","date":"2015-05-31T16:23:32.246+0000","up_votes":1,"down_votes":0,"body":"Same here my comp has nothing else on it and has a 50 mb/s connection so its definitely a problem with his last patch as far as i can tell.\n\nIm on windows 8.1 as well","replies":[]},{"poster":"Troll Broats","date":"2015-05-31T16:19:24.889+0000","up_votes":1,"down_votes":0,"body":"I also have the same issue in Win 8.1","replies":[]}]}