{"poster":"Warmachine GV5","date":"2018-03-13T20:02:35.375+0000","title":"Nach welchen Kriterien wählt die Queue meine Mitspieler aus, dass mein Team immer grottig ist?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":7,"body":"Entschuldigt den l&auml;cherlichen Titel, aber ich wei&szlig; einfach nicht mehr weiter. Man sagt mir immer, ich soll meine Teammates nicht beschuldigen etc. etc. Aber ich wei&szlig; einfach nicht, wie ich gegen solche Gegner ankommen soll. Es f&uuml;hlt sich wahrhaftig jedes einzelne Game an, wie ein 1v9. Ich spiel jetzt seit 2013 oder so, bin also wirklich nicht unerfahren, aber ich bin echt ratlos, was ich bei sowas tun soll. Es geht mir nicht mal ums climben, das habe ich sowieso aufgegeben, deswegen versuche ich aus diesem Spielen wenigstens ein bisschen Spa&szlig; zu beziehen. Aber es gelingt mir einfach nicht, wenn ich Game um Game um Game verliere. Und jetzt sagt mir bitte nicht, ich bin einfach schei&szlig;e. Obwohl... kann ich eigentlich nicht von dieser Community erwarten.\r\nIch habe sogar einen neuen Account erstellt, weil ich damit lvl 30 erreichen wollte, um dann mal zu sehen, ob ich nicht in Bronze lande und dann besser climben kann. Aber sogar hier tu ich mir auf lvl 5!!! schon schwer, zu gewinnen. Ich hab jetzt 4 Games gespielt und alle verloren. Und jedes mal war ich nicht derjenige, der feedet. Aber Ahri, Renkton und Miss Fortune stehen ALLE 1/15 oder sowas. Und wenn ich versuche zu roamen, rennen sie vor mir weg oder machen einfach garnichts. Ehrlich mal... ich wei&szlig;, dass das teilweise Anf&auml;nger sind... zum gr&ouml;&szlig;ten Teil sogar, aber es f&uuml;hlt sich jedes Mal so an, als w&auml;ren die in meinem Team allesamt. Weil der gegnerische Garen steht 18/1, Ahri 9/2, Ashe 13/1 und Brand 5/1 (nicht so krass, aber immerhin feedet er nicht). Und (tut mir echt Leid) es kommt mir so vor, als w&auml;ren Anf&auml;nger in League of Legends geistig stehengeblieben. In anderen Games laufen die rum, probieren irgendwas, LERNEN aus ihren Fehlern... aber nicht so in LoL. Da stehen sie nur rum und machen &uuml;berhaupt nichts oder verhalten sich, als h&auml;tten sie noch nie einen Computer gesehen. Ich meine... die haben es doch zumindest irgendwie gegen die Bots geschafft bis lvl 5 zu kommen, wieso spielen sie dann gegen andere Menschen so, als h&auml;tten sie noch nie irgendwas von LoL geh&ouml;rt?!\r\nIch bin echt am verzweifeln... gerade hatte ich ein Spiel mit Xin Zhao und egal was ich probiert habe, ich habe die gegnerische Miss Fortune einfach nicht fighten k&ouml;nnen, obwohl ich 29/5 stand oder so. Obwohl ich einen gap-close, einen knock up und schaden ohne ende habe, ist sie einfach nicht gestorben... und auch jedes mal, wenn ich versucht habe zu split-pushen ist mir diese Mf entgegen gekommen. Und da ist es ja offensichtlich, dass ich da nicht an sie rankomme, weil sie mich outzoned... aber dass ich sie sogar nicht im 1v1 fighten kann, wenn ich sie aus nem Busch anspringe?! Ich mein, was mach ich denn bitte falsch?\r\n\r\nSorry, f&uuml;r den langen Text, aber es kommt mir echt nicht normal vor. Entweder, ich schaue zu viele Lets Plays und habe durch die Teams der YouTuber ein falsches Bild von der Community, weil die meistens nicht feeden wie Gro&szlig;m&uuml;tter... oder aber irgendwas stimmt wirklich nicht, weil ich echt nicht dran glaube, dass es an mir liegt. Nicht nachdem ich so lange LoL spiele und nicht mal im Anf&auml;ngerbereich was rei&szlig;e!\r\n\r\n{{summoner:3}} {{item:3107}} {{sticker:cass-cry}} {{champion:32}}","replies":[{"poster":"Abasin","date":"2018-03-14T08:54:19.946+0000","up_votes":4,"down_votes":0,"body":"Ich sehe bei Dir auf op.gg für die letzten 40 Spiele eine Winrate von 55%. Lediglich in den gezeigten Rankeds sieht es schlecht aus, die Normals verlaufen im Schnitt besser. Das alleine entkräftet bereits Deine Vorwürfe. Und selbst in SoloQ stehst Du mit 24:23 noch im Plus. Also alles normal und nichts ungewöhnliches. \n\nIch kann Dir nur ein kräfitges \"Chantal, heul leise!\" mitgeben, denn ich sehe keinen Grund für grosse Beschwerden.","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T13:37:43.649+0000","up_votes":1,"down_votes":4,"body":"So du Schlauberger, dann sag mir doch auch einmal, wieso ich auf meinem Zweitaccount mit lvl 7 mehrere Games in Folge verliere, obwohl ich nahezu immer die beste KdA habe und oft den meisten Schaden verteile?","replies":[{"poster":"Avorox","date":"2018-03-14T14:16:17.662+0000","up_votes":5,"down_votes":0,"body":"Weil du offensichtlich beschissen spielst. Wenn du mit 29/5 als Xin keine MF töten kannst musst du so viel falsch machen. Anstatt zu smurfen und Anfänger zu kritisieren arbeite lieber mal an dir. Du beschwerst dich, dass die schlecht sind und nichts lernen, steckst aber selber mit einem Level über 40 in der niedrigsten Liga, also lernst du doch selber nicht!?\n\nSchau dir halt mal Streams an, denk drüber nach was eigentlich das Ziel des Spiels ist und wenn du die Grundlagen drauf hast gewinnst du auch mehr Spiele.","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T19:54:24.025+0000","up_votes":1,"down_votes":3,"body":"Hä, du bist genau so ein typischer LoL Spieler. Sofort beleidigen etc. Und wie gesagt: Keine Ahnung, wieso ich die Mf nicht killen konnte, ich habe nichts anders gemacht als bei anderen Gegnern und Mf ist als Adc logischerweise nicht tankier als die anderen. Außerdem hab ich nen Knockup nen gap close etc. und trotzdem stirbt die einfach nicht, so viel ist da nicht falsch zu machen. E Q W und dann wenns nicht reicht noch R, aber so gefeedet wie ich war, hab ich alles bis auf Mf mit 2 oder 3 Autoattacks weggeschnetzelt, sogar Tanks. Also hör mal lieber auf mit deinem \"Öh, der is Bronze, der muss ja scheiße sein!\", etc. \nAuch wenn es wie eine Ausrede klingt, ich habe einfach keinen Bock mehr Rankeds zu spielen, deswegen steig ich auch nicht auf... ich hab auch einige 1v1 gegen Platinspieler gewonnen, auch wenn Platin noch nicht Highelo ist. Laut dir ja anscheinend besser als Bronze. \nUnd ganz im Ernst, ich habe doch gesagt, in anderen Games probieren die meisten Beginner irgendwas und sammeln Erfahrungen, aber in LoL sehe ich einfach viele, die rumstehen und nicht mal Autoattacken... ich meine, die haben doch zumindest schon gegen Bots gespielt, wo ist der Unterschied, wenn das jetzt plötzlich echte Gegner sind?\nUnd ja ich schau mir Streams an und Vids und Tutorials, ich bin nicht ganz so eingeschränkt, dass ich da nicht auch schon drauf gekommen bin. Man, ich spiel seit 2013.","replies":[{"poster":"Avorox","date":"2018-03-14T20:06:35.527+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Warmachine GV5,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=0004000000010000,timestamp=2018-03-14T19:54:24.025+0000)\n>\n> Hä, du bist genau so ein typischer LoL Spieler. Sofort beleidigen etc.\n\nIch hab dich nicht beleidigt, sondern dir nur mitgeteilt, dass du schlecht spielst. Das ist die logische Schlussfolgerung die aus deiner Platzierung folgt, wenn dich das stört sprich das Thema nicht an.\n\n> [{quoted}](name=Warmachine GV5,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=0004000000010000,timestamp=2018-03-14T19:54:24.025+0000)\n>\nich hab auch einige 1v1 gegen Platinspieler gewonnen, auch wenn Platin noch nicht Highelo ist. Laut dir ja anscheinend besser als Bronze. \n\nDas ist leider schon wieder ein Punkt der dafür spricht, dass du keine Ahnung hast. Was sagt denn ein 1v1 schon aus? Das Spiel hat mit pressure, Teamplay, Mapawarness und vielem mehr zutun. Ein 1v1 in dem 95% der Faktoren eines richtigen Spiels wegfallen ist allerhöchstens ein Indikator für deine Mechanics, mehr auch nicht.\n\nIch finds halt sehr lächerlich, dass du uns hier erzählst, dass du smurfst und dich dann darüber aufregst, dass Leute mit Level 5 schlecht spielen. LoL ist nunmal ein sehr komplexes Spiel und viele gehen es dann vorsichtig an. Wieso sollten die mit Level 5 irgendwas wissen? Gegen Bots zu spielen vermittelt ja quasi gar kein vergleichbares Gameplay wie ein richtiges Spiel.\n\nFang halt an dich mit dem Game auseinander zu setzen wenn du gewinnen willst. Ich höre immer wieder dieses \"mimimi ich spiele schon seit Jahren LoL ich hab also Ahnung...\", aber das ist halt bullshit. Und wenn du seit Beginn der Beta spielen würdest, nur durchs Spielen lernt man das Spiel nicht.","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T21:40:41.364+0000","up_votes":1,"down_votes":5,"body":"Achso, der Spruch \"Learning by doing\" zählt also quasi überall nur bei LoL nicht, weil LoL ja so ein hoch kompliziertes Spiel ist, für das man sich arrogant fühlen kann, wenn man Silber und höher ist.\nUnd nur zu deiner Ausdrucksweise: Du hast mich nicht darauf hingewiesen, dass ich schlecht spiele, du hast eindeutig behauptet: \"weil du offensichtlich beschissen spielst.\" Bevor du hier also einen auf Gutmensch machst, lerne erstmal deine Ausdrucksweise unter Kontrolle zu bringen.\nEin 1v1 sagt nicht einzig und alleine etwas über Mechanics aus, sondern auch über Decisionmaking, gucken, was der Gegner für Items hat, wissen, welche Fähigkeiten der gegnerische Champ besitzt und wie viel Mana diese brauchen und der Gegner noch übrig hat. Kann alles dazu verhelfen, die Laningphase zu gewinnen.\nUnd (meine Fresse, tut mir Leid, wenn dich das in deinem Stolz kränkt, wenn ich sage, Anfänger in LoL sind schlecht, weil du genau so warst), obwohl LoL ja so hoch komplex ist, sollte ein Beginner zumindest nach den Games gegen Bots wissen, wer in seinem Team und wer im Gegnerteam ist, dass Objekte (wie Tower) gefährlich sind, wenn man zu nah rangeht und wenn nichtmal das Vorhanden ist, dann sollte er zumindest wissen, dass man sich mit einem Rechtsklick auf die Map fortbewegen kann. Ansonsten haben sie kein Tutorial gespielt, oder waren Sturzbesoffen dabei.\nUnd ja: ich spiele seit Jahren LoL, ich gucke seit Jahren Let's Plays und Tutorials darüber, etc. etc. wenn das nun endlich in deinen Schädel gehen würde: der Mensch lernt dabei. Kann sein, dass es bei dir nicht so ist, aber im Normalfall schon!","replies":[{"poster":"Avorox","date":"2018-03-14T21:44:34.974+0000","up_votes":3,"down_votes":0,"body":"Sorry aber mit dir zu diskutieren ist halt irgendwie komplett unnötig. Du beschwerst dich über Anfänger, wenn du nach 5 Jahren immer noch nicht die Grundlagen des Spiels beherrschst. Du bist nach 5 Jahren immer noch Bronze und erzählst was von lernen.\n\nIch muss mich hier jetzt echt aus der Diskussion zurückziehen, wird mir ein wenig zu lächerlich.","replies":[]}]}]},{"poster":"Sirrkas","date":"2018-03-14T20:29:38.517+0000","up_votes":1,"down_votes":0,"body":">Keine Ahnung, wieso ich die Mf nicht killen konnte, ich habe nichts anders gemacht als bei anderen Gegnern und Mf ist als Adc logischerweise nicht tankier als die anderen. Außerdem hab ich nen Knockup nen gap close etc. und trotzdem stirbt die einfach nicht, so viel ist da nicht falsch zu machen.\n\nEs gibt da einige Fehler, die in solchen Situationen gemacht werden. Vor allem im unteren Elobereich und Gold schließe ich hier diesmal ausdrücklich da mit ein. Und zwar habe ich schon zahllose Assassinen daran scheitern sehen, den gegnerischen ADC zu bursten, weil sie etwa vergessen haben, dass der ADC noch ein Team hat. Du glaubst gar nicht, wie oft schon Leute auf meinen ADC gesprungen sind, alles raushauen was sie haben und sich wundern, dass der ADC noch steht. Dabei musste ich als Soraka in der Situation oft nicht mehr machen, als 3 mal W und einmal R drücken. Manchmal noch Solari aktivieren oder Exhaust zünden. \n\nUnd wie schon gesagt, das habe ich auch schon öfter bei Goldgegnern gehabt. Teilweise stand ich da sogar näher an den DDlern der Gegner, als mein ADC und die gehen dennoch lieber auf meinen ADC. Obwohl die eigentlich nach 5 gescheiterten Versuchen merken müssten, dass das zum scheitern verurteilt ist, solange sie die Soraka nicht beseitigen.\n\n>Auch wenn es wie eine Ausrede klingt, ich habe einfach keinen Bock mehr Rankeds zu spielen, deswegen steig ich auch nicht auf... ich hab auch einige 1v1 gegen Platinspieler gewonnen, auch wenn Platin noch nicht Highelo ist. Laut dir ja anscheinend besser als Bronze.\n\nHierzu möchte ich erwähnen. 1vs1 sagt fast gar nichts über dein Können aus. Es zeigt höchstens, dass du unter bestimmten Bedingungen einen bestimmten Gegner besiegen kannst. \n\nDas fängt bei der Championwahl an, einige Konstellationen sind da nachteilhaft für eine Seite. Man muss die Powerspikes der einzelnen Champions betrachten, Lanebullies kommen in so einer Situation grundsätzlich besser weg als in einem 5vs5 Spiel. Die können nämlich einen frühen Vorteil durch ihre spezifischen Earlystärke erreichen und den weiter ausbauen. In einem 1vs1 muss man sich zudem keine Sorgen um Ganks, Teamfightpotential und Skalierung ins Lategame machen.\n\nWobei dein \"einige\" hier auch Interpretationsspielraum lässt, wie deine Winrate hier liegt. Das könnte 10 % sein, was eher zeigt, dass du schlechter als Platin bist oder 90 % was ein Indikator dafür sein könnte, dass du eine gute Lane spielst. Das würde sich auch mit deinen tollen KDAs decken, die du erwähnst. Bedeutet dann aber auch, dass du in vielen anderen Bereichen, deutlich schlechter als Bronze sein wirst, da du mit mittelmäßigen Fähigkeiten in den anderen Bereichen und einer tollen Kombination aus Skill für die Laningphase ohne Probleme wenigstens oberes Silber erreichen würdest.\n\n> ich meine, die haben doch zumindest schon gegen Bots gespielt, wo ist der Unterschied, wenn das jetzt plötzlich echte Gegner sind?\n\nIch habe auch schon Anfänger gesehen und auch gemerkt, was manche von denen in Botspielen treiben. Bei einigen reicht es nicht für viel mehr, als ziellos über die Karte laufen und mal Q, W, E und R zu drücken, wenn sie einen Gegner sehen.","replies":[]}]}]},{"poster":"Abasin","date":"2018-03-14T14:02:50.209+0000","up_votes":2,"down_votes":0,"body":"Ich urteile nur über das gesehene, von einem Zweitaccount - den auch bitte benennen, danke - kann ich nichts bewerten, wenn ich keine Info habe. Also mach einfach eine quantitative Retrospektive und beschwere Dich dann anstatt pauschal loszujammern. KDA und Killbeteiligung sagen über Siegchancen im Übrigen fast gar nichts aus. Ich habe Niederlagen in meiner History, wo ich 80% Killbeteiligung hatte und Siege mit 35%. Das waren nicht mal Einzelfälle. Gestern beim Gegner einen Teemo gehabt, der doppelt soviel Schaden wie unser bester Damage Dealer rausgehauen hat, es hat seinem Team nicht zum Sieg gereicht. Versteif Dich also nicht auf unterstützende Kofaktoren, sondern nur auf Sieg und Niederlage. Das Einzige, was halbwegs hilfreich ist als Indikator ist der Goldvorsprung, wenn er denn in vernünftige Items umgesetzt wird.","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T19:56:35.186+0000","up_votes":1,"down_votes":1,"body":"Schön und gut, aber wenn das \"Team\" oder wie man es nennen mag auch nur ein paar Gramm vertrocknete Hirnmasse besäße, dann könnten sie doch auf die Idee kommen, sich um Map Pressure zu kümmern, während ich mich um die Gegner kümmere...","replies":[{"poster":"Abasin","date":"2018-03-14T20:15:49.841+0000","up_votes":1,"down_votes":0,"body":"Ich habe eingangs Deine Spielergebnisse kommentiert und ausgezählt. Die Zahlen sprechen für sich.","replies":[]}]}]}]}]},{"poster":"eingew","date":"2018-03-15T06:19:05.610+0000","up_votes":2,"down_votes":0,"body":"Ich schließe den Thread mal, weil er eigentlich nicht in dieses Unterforum gehört, das ist dazu gedacht, über den aktuellen Zustand des Spiels im Sinne von Patches, Stärken und Schwächen im Gameplay, Balancing, usw, usf zu reden. Für Diskussionen über das Matchmaking haben wir ein eigenes Unterforum namens \"Ligen und gewertete Spiele\" (auch wenn der Name vielleicht nicht der passendste ist. Dort findest du auch einen angepinnten Erklärungsthread darüber, wie das mit der Elo ganz genau funktioniert, falls du genug Interesse am Thema hast, dich so genau damit auseinander zu setzen.\n\nWas deine Leistungen im Ranked (oder in Normals) angeht, so würde ich dir das Unterforum \"Level up: Guides und Tipps\" empfehlen. Dort kannst du, falls du das möchtest, auch darüber reden, wie du in Zukunft vielleicht besser sowohl deine eigenen, als auch die Fehler deiner Mitspieler ausgleichen kannst.","replies":[]},{"poster":"Marksmansitter","date":"2018-03-14T03:31:49.681+0000","up_votes":1,"down_votes":0,"body":"Man kann mal pech mit den Mates haben aber auf lange Sicht kommt es nzr auf die eigene Leistung an. Doch es liegt an dir, du spielst einfach nicht gut genug aber du siehst deine Fehler nicht.","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T13:32:05.736+0000","up_votes":1,"down_votes":3,"body":"ja oke, aber in wiefern soll ich mich verbessern, wenn ich mit 29/5 immer noch verliere? Ich meine, ich klaue ja nicht mal die ganzen Kills, sonst würden meine Teammates ja nicht 1/15/1 stehen oder so...","replies":[{"poster":"Marksmansitter","date":"2018-03-14T14:32:41.388+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warmachine GV5,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=00020000,timestamp=2018-03-14T13:32:05.736+0000)\n>\n> ja oke, aber in wiefern soll ich mich verbessern, wenn ich mit 29/5 immer noch verliere? Ich meine, ich klaue ja nicht mal die ganzen Kills, sonst würden meine Teammates ja nicht 1/15/1 stehen oder so...\n\nIch stimme da Avorox zu, dein decisionmaking scheint nicht gut zu sein. Du musst deine Entscheidungen mehr hinterfragen","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T19:57:48.018+0000","up_votes":1,"down_votes":0,"body":"Bezieht sich Decision Making nicht darauf, wann ich engage und wann ich lieber laufen sollte? Weil das hätte ich mit der KdA ja ganz gut hinbekommen, also wo ist das Problem?","replies":[{"poster":"Sirrkas","date":"2018-03-14T20:36:37.492+0000","up_votes":1,"down_votes":0,"body":"Decisionmaking beinhaltet hier vieles. Im Grunde wägt man ab, welches Vorgehen das beste ist. Wann mache ich Drache? Nehme ich den Turm oder helfe ich Mitte? Brauche ich früh Zhonyas oder Quecksilberschärpe?\n\nWenn man gerade keine Sicht auf Jungler und Midlaner der Gegner hat, könnte es etwa eine richtig miese Idee sein, den Towerdive auf Top zu versuchen, auch wenn man das 1vs1 sicher gewinnen würde, da die beiden Spieler der Gegner fehlen, die am ehesten dich auf der Toplane stören könnten. \n\nWenn man aber sieht, der Jungler ist Tod und hat mitgekriegt, der gegnerische Midlaner muss gerade in die Base, da er nur noch 10 % HP hat, wäre der Towerdive eher sinnvoll, da sich kein Gegner einmischen kann. \n\nÄhnlich sieht das aus, wenn Jungler und Botlane sich überlegen, den Drachen anzufangen. Wie sieht das Spiel aus? \nKann unser Midlaner den gegnerischen Midlaner in Schach halten, damit der uns nicht stört? Haben die Gegner Sicht auf uns und wissen, was wir vorhaben? Wie ist der Zustand der gegnerischen Botlane? Tod, verletzt, hoffnungslos unterlegen oder können sie zu zweit euch aufreiben, wenn sie euch überraschen? Lebt der gegnerische Jungler? Wo ist er? Hat er gerade Toplane gegankt, kann er nicht rechtzeitig zum Drachen kommen und ihr könnt euch das Objective holen, ohne dass er stören kann.","replies":[]},{"poster":"Marksmansitter","date":"2018-03-14T20:27:51.784+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warmachine GV5,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=0002000000010000,timestamp=2018-03-14T19:57:48.018+0000)\n>\n> Bezieht sich Decision Making nicht darauf, wann ich engage und wann ich lieber laufen sollte? Weil das hätte ich mit der KdA ja ganz gut hinbekommen, also wo ist das Problem?\n\nNicht nur, das umfasst jede Entscheidung die du triffst. z.B. wie du deine Prioritäten setzt (objectives/farm/kills/focus/lane preasure/items/win conditions/etc.). Wenn du eine gute KDA hast und trotzdem andauernd verlierst machst du grundlegende Dinge falsch. \n\nDas spiel ist kein Deathmatch, die KDA sagt nicht so viel aus wie du denkst, genau so wenig sind 1v1 alles was man können muss, Spielverständnis ist viel wichtiger.","replies":[]},{"poster":"Avorox","date":"2018-03-14T20:11:32.247+0000","up_votes":1,"down_votes":0,"body":"Unter anderem, aber auch auf Wavemanagement, Rotationen, Baits, Baroncalls und alles andere, was du entscheiden musst.\n\nLeague ist halt ein taktisch sehr tiefgreifendes Game, es gibt viel zu beachten und man kann vieles falsch machen, was einem ohne das richtige Wissen gar nicht auffällt.","replies":[]}]}]},{"poster":"Avorox","date":"2018-03-14T14:17:29.557+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Warmachine GV5,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=00020000,timestamp=2018-03-14T13:32:05.736+0000)\n>\n> ja oke, aber in wiefern soll ich mich verbessern, wenn ich mit 29/5 immer noch verliere?\n\nGerade das ist doch der Fehler. Wenn ich in nem Game 29/5 stehe werde ich das ganz sicher nicht verlieren. Dein Macro scheint große Fehler zu haben, denn mit den Stats die du bei diesem Score hast sollte es ganz leicht sein, das Spiel einfach runter zu spielen.\n\nJeder kann nen guten Score haben, weil er irgendwie ahead gekommen ist. Richtig spielen tust du aber erst dann, wenn du diese Lead in einen Win verwandeln kannst.\n\nSchau dir doch einfach mal die 300 unranked to diamond streamer an, die können das ja auch. ","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T19:59:52.300+0000","up_votes":1,"down_votes":1,"body":"Ehm, ich weiß nicht, wie lückenhaft dein Gedächtnis ist, aber trotz meiner KdA konnte ich die gegnerische Mf nicht fighten. Im 1v1 nicht und im Teamfight bzw. 1/x erst recht nicht. Wenn ich splitpushen wollte, war die sofort zur Stelle, weil sie dank ihrer W nicht so schrecklich unmobil ist, wie andere Adcs.","replies":[{"poster":"Avorox","date":"2018-03-14T20:10:05.261+0000","up_votes":1,"down_votes":0,"body":"Ja, aber nur weil du es nicht kannst, heißt das ja nicht, dass es nicht geht. Ein Challengerspieler hätte das auch easy gecarried. Jetzt kommt bestimmt wieder die Aussage, dass das ein schlechtes Beispiel ist, weil du ja nicht sagst, dass du wie Challenger spielst.\n\nFakt ist aber, wenn ein Challengerspieler das hinbekommt, dann ist es gameplaytechnisch möglich. Somit ist es durch besseres Spielen umsetzbar und daher ist die Lösung für dein Problem besser zu spielen.","replies":[]}]}]}]}]},{"poster":"Noxempire","date":"2018-03-13T20:24:17.638+0000","up_votes":1,"down_votes":0,"body":"Zum Zweitaccount: Als Smurf wird man gegen Smurfs gematched. Ergo spielst du sowohl gegen Bronze als auch Platin+ Spieler. \nIn der Regel hilft es dir auch nicht wirklich dich auf einem zweiten Account hochzuspielen. \n\nWirklich was empfehlen kann ich dir nicht. Nur das deine Chancen zu climben nicht besser werden, wenn du verzweifelst. \n\nNiemand sagt das es unmöglich ist, dass man durch teammates auch spiele verliert. Manchmal kann man einfach nichts machen. \nTrotzdem. Jemand der konstant besser spielt als alle anderen, wird climben. \n\nWenn es wirklich soweit ist, dass du keinen Spaß mehr am Spiel hast, dann hör auf zu spielen. Niemand zwingt dich dazu. Oder nach zur Abwechslung ein paar Normals ^^ \n\nMehr kann ich dir dazu nicht sagen :/ ","replies":[{"poster":"Arsael","date":"2018-03-14T05:51:32.295+0000","up_votes":1,"down_votes":1,"body":"Wie kommst du darauf?\nWoher soll den LoL wissen, dass du ein Smurf bist?\nUnd bitte sag nicht wegen der IP weil das stimmt definitiv nicht...","replies":[{"poster":"Haudruppmoor","date":"2018-03-14T08:16:42.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Arsael,realm=EUW,application-id=Wj1wcocU,discussion-id=3rz98mAH,comment-id=00000001,timestamp=2018-03-14T05:51:32.295+0000)\n>\n> Wie kommst du darauf?\n> Woher soll den LoL wissen, dass du ein Smurf bist?\n> Und bitte sag nicht wegen der IP weil das stimmt definitiv nicht...\n\nDie ELO passt sich an. Nach ein paar Spielen wirst Du automatisch mit Smurfs zusammengesteckt. Vlcht. nicht alle aus Deinem/Gegnerteam, aber zumindest ein paar. Außerdem ist, wenn ich das richtig verstanden hab, eine gewisse Art Smurfdetection im Spiel. Ein Smurf spielt einfach anders als ein Anfänger. Seine Handlungen, Reaktionszeiten, Erfahrungen usw.\n\nmfg\nMB","replies":[]}]},{"poster":"Warmachine GV5","date":"2018-03-13T22:18:02.595+0000","up_votes":1,"down_votes":1,"body":"Danke, Normals spiele ich die ganze Zeit, weil ich keine Lust habe mich in Rankeds noch mehr aufregen zu müssen. An sich spiele ich LoL halt, weil ich immer wieder denke, es würde Spaß machen, und selten stimmt das auch, aber ist halt wie gesagt eine Seltenheit. Obwohl ich sagen muss, wenn ich mit meinem Bro Duo Queue mache geht climben ganz gut. Nervt mich trotzdem dann jede Season von neuem anfangen zu müssen... das zerstört den Reiz so ein bisschen. \nAber woher wollen die wissen, dass ich smurfe?","replies":[]}]},{"poster":"Cut","date":"2018-03-14T07:49:48.854+0000","up_votes":1,"down_votes":0,"body":"Wie ein weiser Mann einmal sagte: \"Du musst jedes mal wenn du ein Ranked startest denken, dass du alleine dastehst und 1v9 spielst\"","replies":[{"poster":"Warmachine GV5","date":"2018-03-14T13:32:36.286+0000","up_votes":1,"down_votes":2,"body":"Wäre noch hilfreich zu wissen, wie man ein 1v9 gewinnt?","replies":[]}]},{"poster":"Tarum20","date":"2018-03-13T21:12:27.820+0000","up_votes":1,"down_votes":0,"body":"Naja in Lowlevel kannst du auf alles treffen.\nDa kann ein Diasmurf im Gegnerteam und deinem Team ein neuer Spieler oder auch umgekehrt\nist halt alles möglich.\nZum Leveln ist der Gewundene Wald aber einfach finde ich.","replies":[]}]}