{"poster":"Time96","date":"2020-02-23T01:40:43.560+0000","title":"Spielmodus ARURF (U.R.F. alle zufällig)","subforum":"Karten & Spielmodi","up_votes":6,"down_votes":0,"body":"Ich spiele extrem gerne den Spielmodus ARURF! (U.R.F. alle zufällig)\r\n\r\nIch habe das so gerne gespielt, weil man wie bei ARAM alle zufällige Champions bekommt aber auf der 5 vs 5 Karte gespielt hat.\r\nUnter anderem fand ich es auch cool, weil man die Fähigkeiten immer nutzen konnte ohne Mana verbrauch und sonstiges.\r\n\r\nWARUM GIBT ES DEN SPIELMODUS NICHT IMMER???","replies":[{"poster":"ascaridevito","date":"2020-02-23T08:33:56.597+0000","up_votes":3,"down_votes":1,"body":"wenn der modus immer da ist macht er weniger spaß. das hat riot auch schon anfang 2019 gesehen wo es sehr lange draußen war. am anfang extrem viele leute aber immer weniger über zeit und die gingen wieder  nach SR.\n\nes ist grad eigentlich alles gut mir den spielmodi","replies":[{"poster":"Asulia","date":"2020-02-23T09:29:43.143+0000","up_votes":4,"down_votes":0,"body":"Ich kann jetzt nur für mich sprechen, aber Ich spiele jetzt seit November durchgehend ARURF, PBE dann hier jetzt immer noch auf dem PBE spielbar und Ich bekomme nicht genug davon.\nSelbst der miese Ping hält mich nicht ab und bei Wartezeiten von ein paar Sekunden bin Ich faktisch nicht der einzige.","replies":[{"poster":"WR Maupy","date":"2020-02-24T18:06:32.224+0000","up_votes":2,"down_votes":0,"body":"genau so geht es mir auch!","replies":[]}]},{"poster":"DerNameDa","date":"2020-02-24T17:53:22.732+0000","up_votes":3,"down_votes":0,"body":"5er is auch immer da und macht kein spaß mehr.. 3er und urf im gegensatz dazu nicht..","replies":[{"poster":"Time96","date":"2020-02-24T18:42:28.915+0000","up_votes":1,"down_votes":0,"body":"Da gebe ich dir recht.","replies":[]}]}]},{"poster":"Eroticat Nimar","date":"2020-02-23T08:31:29.538+0000","up_votes":1,"down_votes":2,"body":"Weil die gesammt spielerzahlen immer weit runter gehen kurz nachdem URF in irgendeiner form rausgekommen ist.","replies":[{"poster":"Time96","date":"2020-02-24T18:49:59.717+0000","up_votes":2,"down_votes":0,"body":"Das kann/muss aber nicht an URF liegen.  URF ist ein sehr beliebter Spielmodus, dass gibt sogar League of Legends zu. Bei mir ist es sogar so, dass ich nur URF gespielt habe. Seitdem es nicht mehr da ist, habe ich keine Lust mehr zu spielen. Dann haben sie das  gegenteil bewirkt.","replies":[{"poster":"Eroticat Nimar","date":"2020-02-25T01:29:10.620+0000","up_votes":2,"down_votes":0,"body":"https://nexus.leagueoflegends.com/de-de/2019/10/dev-lets-talk-about-urf/","replies":[]}]}]},{"poster":"DerNameDa","date":"2020-02-24T18:14:49.600+0000","up_votes":2,"down_votes":0,"body":"Ich verstehe allgemein nicht, wieso nicht einfach alle modis da sind, dann kann sich jeder aussuchen was er gerne mag\n\nich spiel nur noch gerne aurf und vielleicht ab und zu mal aram.. die 3er map ist ja leider auch nichtmehr da, welche ich früher am liebsten gespielt habe..\nscheint als würden immer die modis die ich gerne mag rausgenommen werden und ich kenne paar andere denen es gleich geht..","replies":[{"poster":"Time96","date":"2020-02-24T18:51:03.382+0000","up_votes":2,"down_votes":0,"body":"Das wäre cool, alle könnten sich aussuchen was sie spielen wollen!","replies":[]}]},{"poster":"cr3eK","date":"2020-02-24T18:21:47.887+0000","up_votes":2,"down_votes":0,"body":"Man könnte den Spielmodus auch erweitern. Ein wenig rumspinnen und OFA-URF ausprobieren. Ohne die Möglichkeit das beide Teams den gleichen Champion bekommen. U.a. das ganze aufs ARAM auszuweiten als kleiner Test. Die Map entsprechend ein wenig anpassen. Es gäbe schon einige Ideen Spaß unter den Beschwörer zu bringen. Was mir an DOTA immer sehr gut gefallen hat, sind die All Random Abilities, oder Ability Draft. Damit beschwört man ein riesen Chaos das sicher vielen Spaß bringen kann. Ich würde es lieben. Am besten dann den All-Chat deaktivieren und dem ganzen eine Chance geben.","replies":[]}]}