{"poster":"MSV1902","date":"2016-05-14T16:55:35.087+0000","title":"Ranked Team: Raus aus Bronze!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Leute,\r\n\r\nich denke jeder von euch der Low-Elo spielt wird es wissen.\r\nWenn man solo ein Game sucht, ist in jeder Runde mindestens einer Afk, einer geht w&auml;hrend des Spiels Afk und einer der feeden zu seinem Hobby macht.\r\nDa mir das Ganze ganz sch&ouml;n auf die N&uuml;sse geht, wollte ich mich einfach mal umsehen nach einem Ranked-Team, in dem Spieler spielen die das gleiche Problem haben oder die es einfach Leid sind immer alleine zu spielen. \r\n\r\nGesucht werden hierbei Leute, die in einer niedrigen Elo spielen. Ob Smurf oder nicht ist mir eigentlich relativ egal, so lange die Person &uuml;ber ein wenig Skill verf&uuml;gt, m&ouml;glichst oft on ist,  ein Headset/Mikro hat und bestens auch TS 3.0! \r\nEuer Alter ist mir ziemlich egal, aber am besten w&auml;re ab 16 aufw&auml;rts. (Da ab diesem Alter meistens die geistige Reife einsetzt nicht f&uuml;r jeden Sche*&szlig; zu flamen und direkt surrendern zu wollen)\r\nMir ist wichtig, dass ihr wenn ihr da Bock drauf habt auch gut als Team spielen k&ouml;nnt und nicht nur super Einzelleistungen bringt. \r\n\r\nKurz zu mir:\r\nIch bin 17 Jahre alt. \r\nSpiele soweit ich kann jeden Tag ein paar Stunden.\r\nSpiele eigentlich am liebsten Champs wie \r\nLissandra {{champion:127}} \r\nYasuo {{champion:157}} \r\naber auch Champs wie \r\nXin {{champion:5}} \r\noder Ryze {{champion:13}} \r\n\r\nWenn ihr Bock darauf habt dann addet mich einfach in Skype und schreibt mich an.\r\nBei Skype findet ihr mich ganz einfach unter meiner Mail-Adresse (Ja die habe ich extra daf&uuml;r gemacht :D ) \r\n\r\ngaming.leagueoflegends@outlook.de\r\n\r\nWenn ihr noch Fragen habt oder einfach mal ne Runde zum &quot;testen&quot; mit mir spielen wollt, k&ouml;nnt ihr das nat&uuml;rlich auch einfach bei Skype schreiben! \r\n\r\nAlso wenn ihr Bock drauf habt, vielleicht bis sp&auml;ter {{summoner:4}}","replies":[{"poster":"DrNeotrimos","date":"2016-05-14T19:10:00.585+0000","up_votes":1,"down_votes":0,"body":"Hey :) wäre interessiert.","replies":[]}]}