{"poster":"Pulchritudinous","date":"2017-04-24T19:54:48.657+0000","title":"Authenticating","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Seen a few posts like this but I haven't been able to log into league for almost 2 weeks now. When I enter my login details and go to login it initially tells me I'm in a queue of people trying to log in, then I get an \"encountered error message\". When I try to log in again it puts me straight to authenticating and it will authenticate all day long if I let it. I've tried everything on the \"login issues\" page and have re-installed the game twice, along with trying other accounts. Any fix for this?\r\n\r\nI've spent quite a lot of money on the game plus I can't live without my procrastination so would be a shame not to get back on soon.","replies":[{"poster":"Broporo","date":"2017-04-24T20:36:14.846+0000","up_votes":1,"down_votes":0,"body":"Nice first step trying out that login issues guide. Since that one wasn't able to help, the main issue might be somewhere between your network and our servers. Possibly some kind of settings that's keeping your connection from reaching the login queue. Try out the steps in our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) and we should be able to get this sorted out!","replies":[{"poster":"Yøµ","date":"2017-08-11T16:21:31.731+0000","up_votes":1,"down_votes":0,"body":"Why does it work when i run Cyberghost. i can login but i got 250 ms instead of 36 ms.....so its not the solution. Im just wondering why without this program i can't login. like everybody, imk stuck on authenticating","replies":[{"poster":"Broporo","date":"2017-08-12T00:40:31.772+0000","up_votes":1,"down_votes":0,"body":"Cyberghost is a type of VPN that will route your connection in a different way than your ISP is trying to. Thanks for letting me know that using that VPN worked, as that clues me in to what might really be going on.","replies":[]}]}]}]}