{"poster":"x TITÁN x","date":"2016-11-13T21:33:59.846+0000","title":"Se fue todo al diablo - Flex Q por favor, la última metida de pata de RIOT","subforum":"Charlas Generales","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/b9076d51cc32d72ce0d72e9246c5df5a","image":"https://i.gyazo.com/thumb/1200/_62792b815fa5c93ab5c95ebbd298c3f4-png.jpg"},"up_votes":6,"down_votes":2,"body":"Cuando RIOT no sab&iacute;a como empeorar m&aacute;s el juego, a alguien se le ocurri&oacute; una fantastica idea, EL FLEX Q!!!! Muy buena RIOT, ustedes si que incentivan a la gente a jugar.\r\nLo que m&aacute;s me molesta es que si no jugas normal oculta (lo cual es un modo rancio porque no podes ver que pickean del otro team, y todas las partidas se juegan con los mismos champs OP) no podes jugar Flex tampoco porque los teams son una basura y los emparejamientos peores todav&iacute;a; asi que lo &uacute;nico que lograron es que los jugadores abandonen el juego por una estupidez tan grande como la que hicieron.\r\n\r\nVoy a dejar una captura de pantalla, de mi &uacute;ltima partida en la fant&aacute;stica Flex Q","replies":[{"poster":"KLR Nachito","date":"2016-11-14T01:00:55.179+0000","up_votes":1,"down_votes":0,"body":"A mi me.metio todos platinos de enemigos y enmi team yo era el único platino, después todos platas y bronce.\nNo me quejo de que me hayan culeado. Porque jugaron mejor.\nMe quejo de que me haya matcheado para el orto.\nEl jg enemigo se re movio y el mío lo único que destacó fue que después queme divearon los enemigos el intento divear al otro mid yle regalo otra kill lo que tiro la partida porque ese mid salió 7-0.\n\nHabrá que esperar a que la mayoría rankee para jugar mejor","replies":[]},{"poster":"HechiMadafakaZ","date":"2016-11-13T21:51:07.194+0000","up_votes":1,"down_votes":0,"body":"PERO MIRA ESE DIAMANCO Y MASTER PAPA :3","replies":[]},{"poster":"Bienzahar","date":"2016-11-13T21:37:55.493+0000","up_votes":1,"down_votes":0,"body":"Pero que bonito.","replies":[]}]}