{"poster":"Nekoboobs","date":"2017-02-26T11:16:47.850+0000","title":"Problem mit URF","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":8,"body":"Also am Wochenende gabs ja wieder URF und ich denke mal viele von euch werden das gespielt haben.\r\nUnd wird dabei immer und immer und immer wieder auf dieselbe Handvoll an Champions geto&szlig;en sein.\r\nWahrscheinlich in der Riege von: {{champion:53}} {{champion:13}} {{champion:91}} {{champion:238}} {{champion:74}} {{champion:120}} \r\nUnd mir ist dabei immer &ouml;fter aufgefallen, dass man oft gegen Spieler spielt die nicht Level 30 sind.\r\nMeine Vermutung liegt daher da, dass die Leute diesen Account spielen um spezifisch Champions f&uuml;r URF freizuschalten um die Wahrscheinlichkeit zu reduzieren, etwas zu bekommen, dass nicht ganz so stark ist.\r\n\r\nDas reduziert den Spielspa&szlig; f&uuml;r manche immens, da es keinen Spa&szlig; macht immer wieder gegen Zed oder immer wieder gegen Talon zu spielen, da nun auch noch mit dem Edge of Night ein Item vorhanden ist, dass Null Counterplay erm&ouml;glicht gegen solche Champions.\r\nDie L&ouml;sung daf&uuml;r w&auml;re ganz einfach, indem man einfach den Championpool f&uuml;r jeden Spieler im AR URF &ouml;ffnet sodass jeder jeden Champion bekommen kann, auch wenn dieser garnicht im Besitz ist.\r\n\r\nFinde das ne einfache L&ouml;sung die das **All Random** in dem Modus doch ein bisschen mehr Random macht.","replies":[{"poster":"Undy1ng","date":"2017-02-26T16:56:33.241+0000","up_votes":1,"down_votes":0,"body":"jup hier ist einer ganz ehrlich bedanke dich bei riot fertig aus. warum ganz einfach \n\nich komme aus der ddr und finde in mein leben wurde ich genug eingesperrt da mir nach 6 jahren lol nur noch urf spaß macht lol zu zocken spiele ich urf so oft ich kann da riot sich warum auch immer entschieden hat urf in aruf zu ändern hat mir gezeigt das spiel nimmt langsam sein ende season 1 und 2 war das beste dann gings mit lol bergab \n\nzu verdeutlichung ich spiele urf um auszurasten und alles zu killn was ich sehe , dazu nehme ich champions die mir spaß machen das sind eve und wukong only ab und zu irleia xin aber nicht oft , und wenn ich in ar urf jax lee sin shaco malphite ali bekomme instant leave und logge mich in meinen 10 anderen lol accs ein um so die warte zeit zu überbrücken sry aber ich wurde von riot gefickt ich ficke gerne zurück sowas gibts nicht und da ich nun mal urf sehr gerne spiele gibts für mich keine option von aufhören sondern halt eine andere lösung bedanke dich bei riot ich mach nur das was mir freisteht um meine champs zu spielen dich ich will und nicht die riot mir vorschreibt .............is so","replies":[]}]}