{"poster":"All I do is best","date":"2014-12-12T12:09:38.126+0000","title":"FPS DROPS!!! FROM 187 TO 36","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":0,"body":"Hey, this new patch is out and my fps is normal about (187) when we start fighitng i experience a lags and my fps drops from 125 to 36 and its driving me crazy. \r\n\r\nAny ideas ?","replies":[{"poster":"Digital Ram","date":"2014-12-12T21:35:53.245+0000","up_votes":2,"down_votes":0,"body":"Hey there!\n\nHave you checked out the steps in the [Wrenchmen's Toolbox](http://boards.na.leagueoflegends.com/en/c/help-support/peVhMJAo-the-wrenchmens-toolbox-common-solutions-to-your-problems-technical-issues) yet? If you have, could you attempt to delete your Game.cfg file? You can do this by following these steps:\n\n- Navigate to Your Install Installation (Usually C:) > Riot Games > League of Legends > Config\n- Locate the game.cfg file\n- delete the game.cfg file\n- relaunch League.\n\n\nNOTE: This will reset your graphics settings. Please try this in a custom match to verify everything is functioning properly before playing a real match!","replies":[{"poster":"Draernor","date":"2014-12-14T20:31:05.454+0000","up_votes":2,"down_votes":0,"body":"So just wanted to jump in here with the following steps I've taken to eliminate this problem since 4.1ish. It seems to be getting worse and worse as new patches/champs come out. The new SumRift map is virtually unplayable.\n\nI've had 60-120fps since first season with all settings at max. Since around 4.1 it has been dropping in team fights, more so with specific champs: {{champion:112}} {{champion:236}} {{champion:7}} {{champion:161}}. The nexus/inhib blowing up also has a delay as well.\n\nNvidia EVGA GTX 285 2gb ddr 340.52\nCore i7 920 2.67mhz\n12GB ddr3 RAM @ 1600mhz\nWin 7 x64\n\nNo reason this computer cant run league. So this is what I've done...\n\n1. Defrag HD\n2. Cleaned System registry w/ ccleaner\n3. Antivirus scan = negative\n4. Updated video drivers from Nvidia \n5. Changed Game.cfg file w/ following (yes I took out the double entries).\n   [UnitRenderStyle]\n    Inking=0\n    AdvancedReflection=0\n    PerPixelPointLighting=0\n6. Deleted Game.cfg, Reinstalled League\n7. Uninstalled League.\n8. Fully resinstalled League.\n9. Rolled back graphic driver 3x. \n10. Uninstalled Nvidia Card.\n11. Reinstalled Nvidia Card.\n12. Disabled Sound\n13. All video settings to lowest setting with everything unchecked.\n14. Disabled all non-essential services in windows.\n15. Set all windows settings to \"best performance\" aka uncheck everything.\n16. Used OpenHardware monitor to watch temps, GPU under 80c while Leaguing. 36% Ram in use.\n17. Edited Registry to increase TdrDelay to 10sec.\n18. Repaired League through ingame repair tool.\n19. Reset Nvidia 3D settings to default.\n20. Uninstalled Adobe Air, Reinstalled\n21. Uninstalled DirectX, Reinstalled\n22. Removed PandoMediaBooster.\n23. Read through the R3D logs and cant find anything worth looking at.\n24. Set League exe to high priorty. Closed everything else non system related.\n25. Removed Grpahics Card from system. Cleaned throughly with Air. Cleaned PCI slot, reseated card.\n26. Tested RAM with MemTest, no errors.\n27. Replaced RAM with 8gb DDR3 @ 1600mhz, no difference.\n28. Changed PCI slot for Nvidia Card. \n29. Updated BIOS.\n30. Posted on League Forum Help & Support (here)\n\nThe updates that have been done to the graphics for better use on lower end cards is negatively impacting high end cards. No idea why. League is the only game I've had trouble with, and it has only been since 4.1. Judging by the amount of FPS lag posts in recent weeks, there's something very wrong with the graphics.","replies":[{"poster":"Digital Ram","date":"2014-12-15T18:27:19.508+0000","up_votes":1,"down_votes":0,"body":"That's pretty strange actually, since you've got a pretty awesome setup. I recommend you actually [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new) about this as we'll be able to work on this a little better on a one on one scenario!","replies":[]}]},{"poster":"Flemman","date":"2014-12-12T21:50:46.413+0000","up_votes":1,"down_votes":0,"body":"there are massive lag in all game mode, you just need luck to avoid it\n\nIn a 3 premade, the first game (SR) 2 of us where lagging, in the second (aram) the one not lagging before was the only one lagging, and in a third against bot it was the same \n\nMaybe it's euw server who broke again >-","replies":[{"poster":"Draernor","date":"2014-12-14T20:43:06.119+0000","up_votes":1,"down_votes":0,"body":"FPS lag and IP lag are two entirely different things","replies":[]}]}]},{"poster":"Eambo","date":"2014-12-13T03:33:55.063+0000","up_votes":2,"down_votes":0,"body":"@StealWolverine,\n\nTo answer your question, anything over your monitor's refresh rate is a waste. Most monitors run at 60Hz, which basically means it can refresh a maximum of 60 times a second. This equates to 60FPS - so a solid 60FPS would be the ideal scenario.\n\nIf you have less than 60FPS, you get lag. If you have more than 60FPS, you get syncing issues - screen tearing and the like. Everything over that 60 is wasted :-)","replies":[]},{"poster":"Kilane","date":"2014-12-27T20:30:45.385+0000","up_votes":1,"down_votes":0,"body":"So any reasons why my CPU and memory are taken up so much by LoL? I've never seen any game work my computer this hard before.\n\nAMD A10-5750\nDDR III 8GB; 1TB (SATA) 7200rpm\n15.6-inch Full HD Non Reflection\nATI Neptune XT R9-M290X 2GB GDDR5\n\nStill my fps drops from 80 to 15-30. \n\nIt's 80 at the spawning pool. But when I look at the lane where creeps spawn and fights or champs start to gather, it drops all the way to 15-30.\n\nNo, I don't have lolreplay.","replies":[]},{"poster":"StealWolverine","date":"2014-12-13T03:33:34.768+0000","up_votes":1,"down_votes":0,"body":"187fps???\n40 is normal for me. is there really any difference?","replies":[{"poster":"Draernor","date":"2014-12-14T20:35:57.985+0000","up_votes":1,"down_votes":0,"body":"Up to about 60fps, yes. There's a difference. After that... not really. The monitor refresh rate is normally around 60-80 fps, so anything above that doesnt mean anything useful for playing.","replies":[]}]},{"poster":"All I do is best","date":"2014-12-12T21:30:52.992+0000","up_votes":1,"down_votes":0,"body":"I hope they fix this.","replies":[]},{"poster":"LordTekron","date":"2014-12-12T20:36:22.727+0000","up_votes":1,"down_votes":0,"body":"Can confirm framerate shenanigans going on this patch, tried to do dragon and then the enemy team tried to contest it, during the whole everything I had a whooping 5 frames during it, so I was basically a sitting duck the whole time.","replies":[]},{"poster":"Pako gv","date":"2014-12-12T18:34:29.940+0000","up_votes":1,"down_votes":0,"body":"Im having the same problem, I used to have 50-80 fps on the old map but now im getting 14-60 fps in the new one with frequent drops... i really hope riot fix this... Im even considering quitting and start playing somthing else... I really like LoL but right now it is completely unplayable :( , Ive tried everything from defragging, uninstallling all unnecessary programs and even reinstalling my OS","replies":[]},{"poster":"Eambo","date":"2014-12-12T12:20:14.390+0000","up_votes":1,"down_votes":0,"body":"Are the games you're having issues with with Lucian? If so I think that's pretty much universal, a lot of people have posted about this issue since patch 4.21.\n\nIt's also recommend you try closing out of Curse Voice, just incase that may be causing an issue (It shouldn't, but it's worth a try)","replies":[{"poster":"All I do is best","date":"2014-12-12T12:30:44.174+0000","up_votes":1,"down_votes":0,"body":"Already tried it,its not causing any problems. If you came up with idea post here.","replies":[]}]},{"poster":"Eambo","date":"2014-12-12T12:12:06.974+0000","up_votes":1,"down_votes":0,"body":"Hi All I do is best,\n\nThere are known issues this patch with LoLReplay and other recording programs, so if you have any third party programs I recommend disabling them to see if it helps.\n\nThere's also a known issue with Lucian's Q causing a lot of FPS drops I believe.","replies":[{"poster":"All I do is best","date":"2014-12-12T12:19:03.982+0000","up_votes":1,"down_votes":0,"body":"Hi Eambo,\n\nI dont use such programs, i only using Curse Voice.\nI play a lot with lucian. But i did not experience drops like this before just this patch.\n\nThanks!","replies":[]}]}]}