{"poster":"Riccardo III","date":"2016-11-19T15:50:38.154+0000","title":"Fiora Late Game","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve ragazzi volevo chiedervi un po di cosette.\r\nEro illaoi contro fiora. diciamo una lane phase medio difficile ma ne persa ne vinta,un paio di kill a testa. fiora dopo la fase di mid game quindi almeno 4 item e nel late game era ingestibile. mi faceva 2k di true dmg con la full combo. 1 vs 1 era insostenibile. quali sono i champion che late game( in top lane) possono tenere testa 1 v 1   ?","replies":[{"poster":"Kazushi San","date":"2016-11-20T10:37:31.968+0000","up_votes":1,"down_votes":0,"body":"jax","replies":[{"poster":"Riccardo III","date":"2016-11-20T13:12:46.483+0000","up_votes":1,"down_votes":0,"body":"ho provato in custom contro un mio amico fiora vs jax. jax buildato 2 item armor vita trinity botrk  e last whisper. lo scioglievo. poi ha provato full ad e ha vinto lui ","replies":[]}]},{"poster":"Dantazzo","date":"2016-11-20T11:59:22.765+0000","up_votes":1,"down_votes":0,"body":"Una volta ero {{champion:106}}  con 350 armor e 4000 di vita, mi ha ucciso con una combo....\nIn late ha più possibilità un adc che un tank contro di lei.","replies":[]},{"poster":"DuckQuack0","date":"2016-11-19T15:54:12.071+0000","up_votes":1,"down_votes":0,"body":"Mi viene in mente solo Poppy e forse Renekton\n\nD'altronde la potenza di Fiora sta proprio nell'1v1, poi se è feeddata è un altro conto\nUn po' come Riven e Yasuo, li trovi sempre scarsi e che perdono la lane e poi appena prendono 2-3 oggetti sembrano feeddati anche se 0/10","replies":[{"poster":"TSM Helios","date":"2016-11-20T11:46:50.262+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DuckQuack0,realm=EUW,application-id=MJVj50Jw,discussion-id=K6LbQR5h,comment-id=0000,timestamp=2016-11-19T15:54:12.071+0000)\n>\n> Mi viene in mente solo Poppy e forse Renekton\n> \n> D&#x27;altronde la potenza di Fiora sta proprio nell&#x27;1v1, poi se è feeddata è un altro conto\n> Un po&#x27; come Riven e Yasuo, li trovi sempre scarsi e che perdono la lane e poi appena prendono 2-3 oggetti sembrano feeddati anche se 0/10\n\nIn late game gli unici che possono tenerli testa sono yasuo se saputo giocare, jax, riven e altri champ basati sul dps (yi, ww, irelia ..)","replies":[]},{"poster":"Riccardo III","date":"2016-11-19T16:14:32.841+0000","up_votes":1,"down_votes":0,"body":"eravamo entrambi a full build. il problema è che ignorava le mie resistenze con il true dmg. quindi essere poppy non so come possa aiutare","replies":[{"poster":"DuckQuack0","date":"2016-11-19T16:32:47.902+0000","up_votes":1,"down_votes":0,"body":"non può usare la Q e anche tu fai danni in percentuale---\n\nPerò fare un 1v1 contro una Fiora full build è quasi impossibile","replies":[{"poster":"Riccardo III","date":"2016-11-19T16:34:54.056+0000","up_votes":1,"down_votes":0,"body":"la w di poppy non è infinità. con la mov speed della ulti riesci  a stargli addosso sia per attaccare nomralmente sia per i punti vitali. la q di poppy non è difficile da evitare con fiora.","replies":[]}]}]}]},{"poster":"BrattishSolid6","date":"2016-11-19T17:22:09.792+0000","up_votes":1,"down_votes":0,"body":"Negli 1v1 **in late game **i migliori (imho) sono:\n{{champion:23}} Tryndamere, {{champion:114}} Fiora, {{champion:11}} Master Yi, {{champion:5}} Xin Zhao, {{champion:24}} Jax, {{champion:39}} Irelia, {{champion:10}} Kayle, {{champion:92}} Riven. Tutti combattenti con grande sustain, danni continui (o combo da cd bassi), enorme output di danni, capaci di andare da 0 a 100 in pochissimo tempo. \n\nMenzione speciale per {{champion:75}} Nasus. In base a quante stack ha può essere una kill facile facile o una terribile minaccia. \n\n_________________________________________________________________\n\nSe invece parliamo di **early game** i tre che mi sento di mettere sul podio sono:\n{{champion:122}} Darius, {{champion:80}} Pantheon, {{champion:58}} Renekton.","replies":[{"poster":"Kim114","date":"2016-11-19T20:24:52.263+0000","up_votes":1,"down_votes":1,"body":"{{champion:157}} {{champion:2}} {{champion:39}} {{champion:86}} dove li metti","replies":[{"poster":"BrattishSolid6","date":"2016-11-19T22:32:36.032+0000","up_votes":1,"down_votes":0,"body":"Irelia l'ho messa.\nYasuo secondo me non è sempre al pari degli altri. Perderebbe contro un Tryndamere, perderebbe contro un Irelia, perderebbe contro un Jax. (Ovviamente a parità di gold parlo, o a full build se preferisci).\nOlaf sì, concordo.\n\nGaren. Eh. Garen lo maino, ho quasi 200k punti su di lui, l'ho giocato nel 60% delle ranked in S6. Negli 1v1 posso assicurarti che non regge il confronto con un Master Yi, una Fiora o un'Irelia. Riesce a fronteggiarli (e anzi, ad annientarli) se è in vantaggio, questo **ASSOLUTAMENTE SI**. Ma a full build un Garen non batte un Tryndamere. Garen è un tank da prima linea che si deve occupare del carry nemico (apc o adc, a seconda anche di chi ha il marchio o di chi è la minaccia maggiore). In un 1v1 con un apc ovviamente ha la meglio, ma se parliamo di 1v1 con fighters, allora è una tacca sotto agli altri. Non perché non abbia i suoi punti di forza, ripeto, ma perché il **suo** punto di forza non è l'1v1.","replies":[]}]}]},{"poster":"Kryofire","date":"2016-11-19T19:29:22.018+0000","up_votes":1,"down_votes":0,"body":"Io contro fiora ci sono finito con olaf, e a parte i primi livelli in cui dovevo stare un po difensivo dopo la esplodevo sempre.","replies":[]},{"poster":"Darkinknight","date":"2016-11-19T17:17:04.336+0000","up_votes":1,"down_votes":0,"body":"Io con aatrox in late game la tengo senza problemi,di contro mi da piu problemi in early..ma in teoria anche master y,irelia,riven e yasuo nel late dovrebbero tenerle testa senza troppi problemi\nCon illaoi è normale,ha una lane phase dove schiaccia chiunque..poi negli 1 vs 1 perde molto","replies":[]},{"poster":"xMCM","date":"2016-11-19T17:06:43.626+0000","up_votes":1,"down_votes":0,"body":"In late game devi disingaggiare quando lei attiva l ultimate.","replies":[]}]}