{"poster":"Remira","date":"2014-10-01T21:01:20.243+0000","title":"Tresh hiba","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"sziasztok\r\n\r\na hiba amit észrevettem a követező: elkaptam enemy tristanat a horgonnyal, de morgana lepajzsozta azt, majd miközben tristana zavartalanul sétált tovább a pajzs miatt, keresztül sétált egy wardon, amit így ha csak egy pillanatra is, de felfedett előttünk.","replies":[{"poster":"CSZDragon","date":"2014-10-01T21:16:18.254+0000","up_votes":1,"down_votes":0,"body":"Amúgy ez mikor volt? Csak mert néztem op.gg-n a match historyt, és az utóbbi 4 hónap meccsei között nincs nagyon Thresh :D Csak azért kérdezem, mert meg akartam nézni, hogy esetleg nem volt-e veletek egy Nidalee, Cait, TF, bármi, ami esetleg adhatott volna valahogy visiont.","replies":[{"poster":"Remira","date":"2014-10-06T18:08:53.195+0000","up_votes":1,"down_votes":0,"body":"Elhiheted, hogy játszottam:) nem tudom mikor frissül az adatbázis ahol nézted, de mivel most volt free champ, ezért gondoltam kihasználom, és eközben vettem észre ezt. (lehet, hogy nem a main accomon voltam, de ezt meg nem mondom már, ezer bocsi)","replies":[{"poster":"CSZDragon","date":"2014-10-06T21:31:40.514+0000","up_votes":1,"down_votes":0,"body":"Ok, elhiszem, nem azért írtam, csak úgy kíváncsiságból, hogy nem volt-e valamilyen olyan hős, vagy valami olyan képesség. Mindettől függetlenül lehetett bug. Én még nem találkoztam ilyennel egyelőre.","replies":[]}]},{"poster":"iSPZ","date":"2014-10-01T21:21:45.160+0000","up_votes":1,"down_votes":0,"body":"(Jogos!)","replies":[]}]},{"poster":"iSPZ","date":"2014-10-01T21:13:17.497+0000","up_votes":1,"down_votes":0,"body":"Ezt most nem teljes mértékben értem, hogy miért Thresh hiba, hisz akkor tulajdonképpen Tristana-t védte Morgana Fekete pajzsa, így a lánccal nem tudtad oda húzni, ő pedig el tudott futni. Átfutott egy őrszemen amit ti pedig észrevettetek, igaz?\n\nNem lehetséges, hogy épp akkor tette oda mondjuk Morgana, vagy Tristana? Esetleg pont úgy 'álltatok', hogy mondjuk Tristana eltakarta azt a vizuális megjelenést amit akkor láthatsz ha valaki elhelyez egy őrszemet. Biztos tudod mire gondolok, ha egy ellenség oda megy a bokor mellé és lerak oda egy őrszemet, Te pedig ott állsz tőle nem messze akkor látod, hogy lerakta. Tehát ezt a jelenséget kitakarta Tristana és épp odaraktak egy őrszemet, amit ugyebár látni lehet akkor mikor leraknak, még nagyjából fél/egy másodpercig. Persze, minek rak oda őrszemet mikor azon ügyködnek, hogy túléljék, de lehet hogy például életerőitalt akarta aktiválni, de helyette véletlen őrszemet rakott ki. Szóval, ez nem lehetséges?","replies":[{"poster":"CSZDragon","date":"2014-10-01T21:21:58.070+0000","up_votes":1,"down_votes":0,"body":"Az is lehet, hogy ha így volt, akkor nem véletlenül rakott le wardot. Ha az ellenfél attack-move-ot használ, akkor az az 1 ward életet menthet.","replies":[{"poster":"Remira","date":"2014-10-06T18:59:58.486+0000","up_votes":1,"down_votes":0,"body":"mind2re egyben válaszolnék, remélem nem baj.\n\nnem az a hiba, hogy nem rántottam be trsit, hisz rajta volt a pajzs. hanem amíg a pajzs és a horgony is rajtam volt egyszerre addig ő átfutott egy wardon (amit biztos nem akkor raktak le, mert már ment le az idejéből jócskán) amit láttam utána.\n\nlehet nem tresh bud, lehet morgana blackshield bug is, vagy a kettő kombója:D nem tudom, csak leírtam amit tapasztaltam:)","replies":[]}]}]}]}