{"poster":"Flashtutorde","date":"2018-03-01T19:03:10.947+0000","title":"HOHER ping","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich hab eine Freundin die hat ein problem mit dem ping hat ne 10k leitung bekommet 2 k und 3k upload\r\nihr ping ist 5000 schwankend.\r\nhabe schonmal pingplotter benutz erster link ist das von meiner freundin\r\nund zweiter link ist das von meinem wo ich 27 ping habe bitte kann mir einer helfen und wenn wie meine freundin das problem beheben kann\r\n1.  https://pastebin.com/dtSUJYUv \r\n2. https://pastebin.com/NTbBiGE7","replies":[{"poster":"legofreak1","date":"2018-03-01T19:13:06.086+0000","up_votes":1,"down_votes":0,"body":"Deine Freundin hat einen extrem hohen Ping zu ihrem Router und bis zu 45% Packetloss. Wie sie damit überhaupt spielen kann, ist verwunderlich. Ich vermute, dass sie WLAN verwendet. Sollte dies der Fall sein, soll sie bitte zumindest testweise auf eine rein kabelgestützte Verbindung zum Router umsteigen, auch wenn das bedeutet, dass sie für ein Spiel zum testen mit dem PC umziehen muss.\n\nUnd da sie wohl einen League of Legends Account besitzt, darf sie auch gerne selbst hier antworten, da Support über Dritte die ganze Angelegenheit nur unnötig verkompliziert und verlangsamt.","replies":[{"poster":"Flashtutorde","date":"2018-03-01T20:49:49.400+0000","up_votes":1,"down_votes":0,"body":"sie kennt sich mit pc garr nichts aus so rein gar nicht\ndeswegem frag ich..\nUnd ist nein lan kabel oder dlan die einzige möglichkeit daran was zu ändern ?","replies":[{"poster":"Pandeonor","date":"2018-03-01T21:05:50.815+0000","up_votes":1,"down_votes":0,"body":"Die WLAN Verbindung ist grottenschlecht. Ein Repeater wäre eine Möglichkeit der Verbesserung, kostet aber u.U. mehr wie ein DLAN (neu 40EUR, gebraucht die Hälfte) bei schlechterer Qualität. \n\nSie kann sich auch (viel) näher zum Router setzen. Ich nehme an sie ist in einem Zimmer mit mindestens 2 Wänden zwischen ihr und dem Router.","replies":[]},{"poster":"legofreak1","date":"2018-03-01T20:58:31.923+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flashtutorde,realm=EUW,application-id=7hciEY9w,discussion-id=LNtujmM3,comment-id=00000000,timestamp=2018-03-01T20:49:49.400+0000)\n>\n> Und ist nein lan kabel oder dlan die einzige möglichkeit daran was zu ändern ?\n\nEs geht erstmal nur darum, das ganze zu testen und die genaue Ursache des Problems zu finden. Sobald die gefunden ist, kann man schauen, wie man weiter vorgeht. Im Allgemeinen ist eine LAN-Verbindung einer WLAN-Verbindung zum spielen vorzuziehen, weil letztere deutlich anfälliger für Störungen ist.","replies":[]}]}]}]}