{"poster":"BigfootNamedYeti","date":"2015-09-01T03:42:55.762+0000","title":"Why Do You Kepp Playing","subforum":"[ARCHIVED] Miscellaneous","up_votes":3,"down_votes":0,"body":"Hey guys what's up? I honestly wanted to know what keeps you other League addicts from leaving or if you did leave why did you come back. To make this fair I guess I'll tell you my reason, my friends, obsessive, annoying, obnoxious, pain in the ass, overly caring, better than me at everything friends who honestly make the game fun this game is a home for me and everyone that I play with whether I want to chop your head off for not pinging the fizz mia or thanking the mighty rito that you are fizz, you are part of this great family. So drop a comment below and share your story or if you want to leave a picture I get very entertained by pictures Have an awesome day on the rift guys. Also there isn't a single champ who is just smiling that isn't a lunatic.{{champion:35}}","replies":[{"poster":"Merxamers","date":"2015-09-01T20:26:23.239+0000","up_votes":3,"down_votes":0,"body":"Sunk cost fallacy","replies":[]},{"poster":"moonstones","date":"2015-09-01T19:50:37.671+0000","up_votes":3,"down_votes":0,"body":"~~I work on the game!~~ That's actually not it at all - no one is forcing my hand to play. :P\n\nI've been playing League of Legends since 2010 (Olaf came out two days after I started playing, and Kog'Maw shortly after). \n\nWhat started me playing the game is the same reason I continue to play - my friends. It's a fun way for my friends and I to keep in touch. Now that we're older, we live all across the US, which makes IRL meetings pretty tough. Playing League together is a way for us to hang out, catch up via voice comm, and have some fun.","replies":[]},{"poster":"Sneak Dog","date":"2015-09-02T11:47:18.081+0000","up_votes":2,"down_votes":0,"body":"I used to love the game and lore and play it a ton.\nThen Riot removed one of my favorite champions. Now I only play with friends, because this is the moba of their choice.","replies":[{"poster":"BigfootNamedYeti","date":"2015-09-02T15:15:22.786+0000","up_votes":1,"down_votes":0,"body":"That sucks man who is your favorite champ","replies":[{"poster":"Sneak Dog","date":"2015-09-02T22:03:24.827+0000","up_votes":1,"down_votes":0,"body":"Long version of the story, short version is my initial post. (I'm not a professional writer, I'm not good yet at concise writing, this is a wall of text. Feel free to stick with the initial post.)\n\nTrundle is the one that got removed, all that remain are an outdated voice-over and disappointing skin. (Trundle was never a big hulk :/ ) Happened out of the blue too. We were told he'd be mostly the same, just as a frost troll. Then he is released and he is a big sadistic hulking power-hungry bully instead of a sadistic tragic martyr runt turned bitter.\n\nAlready been well over two years. Riot initially admitted his identity was changed, but they liked the end result. Significantly later, I've seen Rioters admitting his removal was a mistake.\nSadly, Riot never has shown any intent of solving this mistake. The good old Trundle I knew is just gone and Riot doesn't really care. \n\nThe lore department, before the new lore finally started coming, was awful when compared to the rest of Riot. The rest of the departments do all kinds of awesome things like releasing amazingly unique champions, explaining balance philosophies, implementing anti-toxicity features, release temporary gamemodes etc. Lore was just silent for years. I only had an awful Freljord event to remember. \n\nNow finally they picked up the slack and started producing technically great stuff, but over the years I've started caring less and less. Still they haven't fixed the part, or even shown intention to fix the part, that is preventing me from investing in their new lore: Riot blatantly retconned a main (playable) character from their lore and don't even seem to care.\nHowever well their new lore might be, I just don't care and this makes me sad. I would've liked to be able to really enjoy and invest in this well-written lore, but I can't if I constantly have to remember any and all characters could just be retconned overnight, for that is what happened to Trundle.\n\nSo by now I just browse this subforum a bit out of habit and play the game only when friends ask me to. I hope a (subjectively) better moba comes out, but don't expect it to, seeing how Dawngate got cancelled. (Now that game knew how to do lore right from the offset!)","replies":[]}]}]},{"poster":"Guardman","date":"2015-09-02T01:16:30.365+0000","up_votes":2,"down_votes":0,"body":"Why do I keep playing? It’s a question I’ve been asking myself a lot lately.\n\nI first started playing because I was active on MTGSalvation at the time, but was mostly just staying to play Mafia since I was jobless and couldn’t afford to keep throwing money at magic. Some of my friends on there played League so I figured it was something to get into to replace Magic since it was free. \n\nI joined just after Vayne was released. The first champion I feel in love with and bought was Garen. But once I got level 30 I found myself being drawn to the jungle. The season 1 jungle was probably the most satisfying of any jungle. Not the most fun or the best, that distinction belongs to Season 4, but you when you succeeded in Season 1 you felt like you earned it.\n\nI don’t know how or why I stayed through Season 2. The jungle was awful and you felt bad playing it. Really it was probably just because I enjoyed playing Gragas mid that I stayed. There was something satisfying about playing a fat man and dealing a ton of damage with alcohol and body fat.\n\nSeason 3 was more about proving that I could be better at the game.\n\nSeason 4 was the best. The jungle was fun to play. Conservation was great. And Spirit of the Elder Lizard was the most satisfying item I’ve ever played with in league, especially on Garen. Also I could feel myself get better and by the time the season ended I was high Gold.\n\nPreseason 5 was fun for the novelty of the changes and being able to do stupid cheesy things with Pantheon. But overall I would say that the jungle is average, better than Season 2 and 3, worse than Season 1 and 4. The smite changes while cool at first, soon lost their novelty. But thanks to honing my game and the introduction of runeglave allowing me to spam Poppy jungle I was able to achieve Platinum.\n\nBut at this point I am at a crossroads. I think I could reach Diamond. But it’s something I would have to dedicate myself to. And I don’t think I want to put in the extra time. I would have to give up other things I enjoy to make it possible. But at the same time I feel like I am around my plateau with my current amount of play and dedication.\n\nAlso I am beginning to think the drive to get platinum was what was really driving me to keep playing. I don’t mean to imply the game isn’t fun. Because it is still a blast to play. But it is the other stuff around the game that is making playing tough.\n\nTo understand why this is, you have to understand almost every single champion I have played a lot and tried to main gets changed into something I just don’t enjoy playing because they take away what I enjoy playing about them. \n\nThey changed Gragas from a burst mage to a tank. AP Yi which they just removed from the game. They changes Zilean’s reliable double Q into a hard to hit skill shot. I tried to learn Veigar after the Zilean change. But by the time I started to enjoy him they changed his Q to a skillshot and added a delay to his E, which just made him awkward to play. And Morde who they changed from a burst mage to a juggernaut (though I do love Ghost Dragon). And that is only mid lane.\n\nThey changed my ever reliable Garen into a champion that no longer has what I loved and thought was unique about him, a strong silence and the best early game in the game, for a mini game passive and a late game. And right now I am sort of resigned to the fact that Poppy is going to change soon, and she is going to lose some of the things I love about her.\n\nAt this point the only champion I play regularly that I feel won’t soon be or hasn’t been changed will be Nasus. But even then I do expect if Nasus ever needs to be nerfed, the nerfs will hit me harder than other Nasus players, because I don’t play Nasus the prescribed way. I don’t go out of my way to stack my Q. I don’t like mini games. But I love the rest of Nasus’s kit, which works out fine for me now because Q is his weakest skill. So I play Nasus in a way that maximizes the rest of his kit. But because his Q is his identity any nerf will probably be to the other parts of his kit.\n\nAt this point in time I am just beginning to feel resigned to the fact that Riot doesn’t want to support the way and type of champions I want to play. I can’t remember the last time Riot has released a champion that I said I want to main this champ. All champs (plus the champs they rework) nowadays seem to be all skillshots, overloaded, mobility, overly complex, have some sort of mini game mechanic, or some combination of these. Where I enjoy simple champions, with few to no skillshots (or at the very least easy to hit), no mini games, with strong reliable damage, but with a strong drawback(s) that has to be managed. I can’t remember the last time a champion like that was released.\n\nI don’t really blame Riot for this. I understand why they want to go in the direction they are. But I won’t say coming to this realization has been easy. So if I had to say the reason I keep playing LoL would be because I want to enjoy it while I can. Because I expect someday there will be no more champions I love to play.","replies":[]},{"poster":"Zyorhist","date":"2015-09-01T19:55:01.006+0000","up_votes":2,"down_votes":0,"body":"I log in almost every night.  I stream my hours of enjoyment to myself.  Why?  I do it because out there somewhere is one person who enjoys my company, and so long as they are out there I will continue to spend my time playing for them.","replies":[]},{"poster":"Crowe Stalker","date":"2015-09-02T22:25:24.715+0000","up_votes":1,"down_votes":0,"body":"I've spend two hundred dollars and more on this game and as much as I hate it and would love to quit at times, the fact is I can't because I am attached to those purchases, and they were honestly good investments. Sometimes I regret things like having to last hit and buy items, sometimes I hate playing one champion and being locked in that very specific playstyle (Heroes of the Storm does feel more Reactive in that I can build multiple ways and feel different for each one, even if some builds are weak and others are strong) or the feeling of losing everything at the end of the match when I win or lose and having to start from scratch (I'll admit I loved World of Warcraft back in Wrath of the Lich King and I've sinked more of my time, money and effort into Star Wars: The Old Republic than any other game) but I also love playing {{champion:27}} and running around like a headless chicken while laughing, and I love playing Final Boss {{champion:45}} and the particle effects. I hate how Pro-Centric the game has become, but I'd be lying if I said I didn't love playing {{champion:223}} or {{champion:37}} in my Low Elo games.\n\nSometimes, I really hate the mechanics of the game, but then I remember I invested my heart and soul into the Lore of the World, and that there's an expansive community in all corners of the world devoted to expanding this world and exploring it. There have been times I've forced myself to quit after losing streaks of twelve to sixteen games, but then I remembered my friends in League Factions, and I remember the fun I had when I was representing someone, like Noxus or Zaun. We all say that Community has one of the most Toxic communities, but when you find the right part of it, it's really something else.\n\nNothing's worse to me than losing to a {{champion:92}} {{champion:67}} {{champion:105}} {{champion:77}} or {{champion:11}} because I don't feel Outplayed, I feel Cheated because anyone can get shut down through Hard Crowd Control. But at the same time, I feel an exhilarating feeling when I play {{champion:112}} and I land that Four man Gravity Field into a full combo, or if I play {{champion:161}} and I get off an uninterrupted Lifeform Disintegration Ray.\n\nThere are pitfalls in this game, I'm not going to pretend there aren't. I hate {{item:3931}} and I hate certain champions. I hate Multiplayer Online Battle Arenas because at the end of that twenty minutes to an hour I lose everything, but I can't pretend there aren't Highs too, like the time I 1v3ed with Old {{champion:82}} in the top lane and got a Triple Kill, or that one incredible time I completely controlled a match with a 21/0/12 Blackfrost {{champion:34}} and felt like a God among men.\n\nThere are things about the game that you will hate, don't pretend there aren't because League of Legends is far from the Perfect Game. No matter what Riot does they won't be able to quite change the game to meet the likes of Smite or Heroes of the Storm, but that's okay, because League was the start and it's stayed for almost six years now. It's held fast and held tight and held strong and there are still people who log on every day and play hard to reach that new Division or wake up to grind for that new Champion.\n\nLeague of Legends is amazing, and there are times I want to quit it forever, to turn my back on it and pretend this part of my life didn't happen... But I'd be lying to myself, because League of Legends is a great game at it's core, and as much as we love to hate it, with {{champion:67}} having more than a third of the population playing her, or {{champion:412}} becoming the god of utility while {{champion:37}} gets left in the dark, or when {{champion:92}} gets another skin but {{champion:50}} hasn't gotten so much as a peep. I hate some things that Riot does, and that this game does and is, but I'm going to keep coming back to these forums, and to my roleplaying community, and even logging on the game because at the end of the day the Good shines just as bright.","replies":[]},{"poster":"Eleshakai","date":"2015-09-02T01:46:31.677+0000","up_votes":1,"down_votes":0,"body":"I visit the forums every so often... but I don't play the game anymore. Just watch the LCS.\n\nHowever, I still respect the game and would give it a chance if not for Riot adding something that I don't agree with. So I don't play.\n\nSo what is keeping me playing? I guess nothing ;)","replies":[]},{"poster":"Bemapon","date":"2015-09-02T01:20:26.501+0000","up_votes":1,"down_votes":0,"body":"I am not going to lie, I enjoy playing Dota 2 a lot more as a game, but my friends play League, and I like playing with friends.","replies":[]},{"poster":"kitcat300","date":"2015-09-01T20:46:35.055+0000","up_votes":1,"down_votes":0,"body":"Its one of the few, if not only competitive game that I'm relatively decent at. \n\nI like the characters. \n\nI also get exited whenever the next PBE cycle roles out.","replies":[]},{"poster":"Catastrop","date":"2015-09-01T20:32:57.007+0000","up_votes":1,"down_votes":0,"body":"I like the champions.\n{{champion:9}} {{champion:40}} {{champion:127}} {{champion:43}} {{champion:429}} {{champion:90}} {{champion:117}} {{champion:50}} {{champion:134}} {{champion:18}} {{champion:161}} {{champion:110}} {{champion:115}} {{champion:101}} {{champion:143}} \nAs long as Riot keeps making great champions like these, I'll never leave this game.","replies":[]},{"poster":"Big Lincoln","date":"2015-09-01T19:55:51.613+0000","up_votes":1,"down_votes":0,"body":"i like {{champion:432}} {{champion:82}} {{champion:45}} enough that they keep me playing","replies":[]},{"poster":"team never group","date":"2015-09-01T19:51:57.032+0000","up_votes":1,"down_votes":0,"body":"Well i hate my life so that's basically why.","replies":[]},{"poster":"Proƒyt","date":"2015-09-01T05:04:12.008+0000","up_votes":2,"down_votes":5,"body":"i just uninstalled because i think this game is dogshit","replies":[{"poster":"D Bag","date":"2015-09-01T20:16:16.077+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Xx GodMaw xX,realm=NA,application-id=cIfEodbz,discussion-id=7zG6KVVE,comment-id=0000,timestamp=2015-09-01T05:04:12.008+0000)\n>\n> i just uninstalled because i think this game is dogshit\n\nBetter work on that Dota skill, I need my $19 M.\n\n\nhttp://www.auplod.com/u/auopld60eff.png","replies":[]}]}]}