{"poster":"Peritheus","date":"2018-03-02T17:14:57.626+0000","title":"REMOVE TEEMOBUSTER","subforum":"Gameplay","up_votes":1,"down_votes":2,"body":"wHaT KiNd oF SiCk jOkE Of a pAsSiVe cAlLeD GuErIlLa wArFaRe iF I&quot;M NoT AlLoWeD To hIdE In fRoNt oF ThEiR NoSeS  iN  tHe rIvErS/LaNeS/JuNgLe sPoOkInG/TuRnInG ThE TiDeS FoR ~~ThE InStItUe oF WaR~~ SaCrIfIcE, dUaNkInG ThE BiG FiShY SqUiShIeS BeFoRe i gEt/cOnTrIbUtE To aUtOmAtEd lOw pRiOrItY QuEuE. iT LiTeRaLlY Is wHaT MaKeS ThE PaSsIvE ViAbLe aNd fUn aNd mInD TrIcK PlAy 4D cHeSs wOrThY SiNcE I&quot;M NoT In tHe iNfErIoR VeRsIoN Of a  WaRdEd&lt; ReDtRiNkEtEd&lt; ThRoWn aOeS At&lt;oBvIoUs cOnTrOlLeD BrUsH\r\n\r\nI had sometime ago received the, hey ty for serving and not being leaverbuster worthy message you&#039;re totes awesome, my reaction was BRUH  THAT WAS like a YEAR AGO, oh I bet they are going to reset my TWEENTY MINUTE 5 LOWPRIORTY QUEUES TO 5, NOPPPPEEE BIG FAT MIDDLE FINGER  after recents  1 ineligible you don&#039;t deserve nothing even if you played 24 hour hard freezing crash match, and 1 remake dsl issue (ty I totally wasted 1Min and 30 secs of your time and deserve it) after bunch of games of teemo jg This is exactly why you don&#039;t see teemo players often really using his awesome passive, because it&#039;s legit toxic to fight leaverbuster from not thinking you&#039;re afk when you&#039;re just patiently waiting for someone to step on your thought out trapb knowing eventually they&#039;ll step on it and you get the jump on them or backdoor the backline adc,solo their jgler and support etc,\r\n\r\n it&#039;s dummmmb just like the honor and ban system, if you on the verge on 4th permaban, dishonorable (it takes literally 3/4 of a year in  months to gain honor back to where ypu were and prob stays slow)20 min leaver busters queue, now there&#039;s blue essence once 20 hour win since BE (IP) per win/loss anymore,just xp, what&#039;s stopping you from creating a new account with all the benefits and lesser punishments if there&#039;s literally no recovery, no lowered penalty after a reasonable amount of time,rewards ideal besides an automated message that you really should be hating on where you&#039;ll eventually see how pure bs and flawed some parts of the  system really is, but hey it&#039;s their game right? ~~WRONG~~(insert x files theme dunadunaduna some crazy horroy theorys).","replies":[{"poster":"Eedat","date":"2018-03-02T23:02:40.578+0000","up_votes":2,"down_votes":0,"body":"That is the ugliest block of text I think I have ever seen. Holy hell dude","replies":[{"poster":"Peritheus","date":"2018-03-04T00:11:43.237+0000","up_votes":1,"down_votes":1,"body":"!EsRoW StEg yLnO Ti","replies":[]}]},{"poster":"DuskDaUmbreon","date":"2018-03-02T18:40:17.400+0000","up_votes":2,"down_votes":0,"body":"I...I can't read it.\n\nWhat...what does this even say?","replies":[{"poster":"Peritheus","date":"2018-03-04T00:20:09.412+0000","up_votes":1,"down_votes":1,"body":"A bunch of run ons and grammar mistakes;  Copy paste/cut the irregular structures into convertcase.net and choose Sentence case, ty for reading my stool post ;^).","replies":[]}]},{"poster":"Xion The XIV","date":"2018-03-02T17:27:12.017+0000","up_votes":1,"down_votes":0,"body":"Wait are you saying that you are mad that you became a permanent ward and were punished for it?","replies":[{"poster":"Peritheus","date":"2018-03-04T00:13:36.142+0000","up_votes":1,"down_votes":1,"body":"Wardmo is a legit support thing, that filthy xp stealing moocher, using your passive gets you punished, especially when there's no minions around and nobody stepping on your shrooms.","replies":[]}]},{"poster":"ZephyrDrake","date":"2018-03-04T00:15:40.166+0000","up_votes":1,"down_votes":1,"body":"welp nothing to see just your typical angry rant thread that not even the OP has any idea what he is talking about","replies":[{"poster":"Peritheus","date":"2018-03-04T00:51:03.073+0000","up_votes":1,"down_votes":1,"body":"Alright pal, enlighten me since you're so soo condescendingly knowledgeable, experienced heavily in your reasoning since you claim that you know the ins and out of what I mention in this salty, shite post, I mean surely surely! you're just not talking out your @ss without backup that others have never before experienced/ can relate to while being ignorant of such fact you legit come into others post like  mine and downvote my new comments for THEIR eyes to see and judge below that were sarcastic,grain of truth and \"helpful\" with your biased cocky attitude, infact I'm sure you can't even respond \"normally\" without thinking carefully now which is something to scoff at you cactus(~~prick if you couldn't decipher that~~) you.","replies":[{"poster":"ZephyrDrake","date":"2018-03-04T00:56:22.540+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Peritheus,realm=NA,application-id=3ErqAdtq,discussion-id=OmoMbgTQ,comment-id=00030000,timestamp=2018-03-04T00:51:03.073+0000)\n>\n> Alright pal, enlighten me since you&#x27;re so soo condescendingly knowledgeable, experienced heavily in your reasoning since you claim that you know the ins and out of what I mention in this salty, shite post, I mean surely surely! you&#x27;re just not talking out your @ss without backup that others have never before experienced/ can relate to while being ignorant of such fact you legit come into others post like  mine and downvote my new comments for THEIR eyes to see and judge below that were sarcastic,grain of truth and &quot;helpful&quot; with your biased cocky attitude, infact I&#x27;m sure you can&#x27;t even respond &quot;normally&quot; without thinking carefully now which is something to scoff at you cactus(~~prick if you couldn&#x27;t decipher that~~) you.\n\nnothing to see here, just an even worst post from the OP that has no idea what he is talking about.","replies":[]}]}]}]}