{"poster":"DeathshotNEO","date":"2016-10-16T18:09:52.873+0000","title":"Bringt das Melden etwas?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Hallo liebe League of Legends Community,\r\n\r\nBitte nicht falsch verstehen, aber langsam aber sicher habe ich das Gef&uuml;hl das Melden nichts      bringt. Ich habe schon unz&auml;hlige Flamer und Feeder gemeldet, aber ich bekam noch keine einzige R&uuml;ckmeldung.\r\n\r\nBringt Melden wirklich nichts oder mach ich es falsch?\r\n\r\nMfG\r\nDeathshotNEO","replies":[{"poster":"Awsane","date":"2016-10-16T18:24:36.771+0000","up_votes":4,"down_votes":0,"body":"Du bekommst die Meldung nur dann, wenn dein Report der letzte vor der Strafe war\n\nman sollte auf jeden Fall einen Spieler der sich nicht an die Regeln hält Reporten\nnur sollte man nicht erwarten, dass man eine solche Meldung bekommt\n\nweil es auch immer eine Toleranzgrenze gibt, die derjenige der die Strafe begeht erst überschreiten muss und dazu sind in der Regel mehrere Reports notwendig\nnur ganz selten kommt es vor, das jemand nach einem einzigen Regelverstoß eine Strafe erhält, dazu muss er in einem game schon sehr hart übers Ziel hinaus geschossen sein","replies":[{"poster":"0815xand0r","date":"2016-10-16T21:34:53.000+0000","up_votes":4,"down_votes":0,"body":"> Du bekommst die Meldung nur dann, wenn dein Report der letzte vor der Strafe war\n\nMit der Einschränkung, dass man sie selbst dann nicht immer bekommt. Deswegen gibt's die so selten.","replies":[]}]},{"poster":"Homunculi","date":"2016-10-18T09:11:58.168+0000","up_votes":2,"down_votes":0,"body":"Schau des öfteren mal hier in das Spielerverhalten Forum.\n\nDann merkst du, dass Reporten etwas bringt.","replies":[]},{"poster":"Good Guy Putin","date":"2016-10-16T19:54:19.129+0000","up_votes":2,"down_votes":0,"body":"Dein Report muss wie gesagt der letzte sein und selbst dann bekommt man die Meldung nicht immer. Ich hatte die Meldung bisher auch nur 2 mal.\nDu kannst dich aber darauf verlassen, dass Spieler die öfter Flamen früher oder später bestraft werden.","replies":[{"poster":"DeathshotNEO","date":"2016-10-17T10:56:07.940+0000","up_votes":1,"down_votes":0,"body":"Es wäre aber toll zu wissen, ob eine Person aus dem Verkehr gezogen wurde.","replies":[{"poster":"eingew","date":"2016-10-17T11:41:02.816+0000","up_votes":1,"down_votes":0,"body":"Etwas so spezifisches wird Riot niemals einführen. Sie wollen in ihrem System erreichen, dass League im Allgemeinen weniger Flame beinhaltet. Es geht also darum, dass die Personen sich bessern, nicht, dass irgendjemand zufrieden sein kann, dass sie eine Strafe bekommen haben. \n\nRiot wird immer versuchen, derartige Rückmeldungen über erfolgreiche Reports anonym und schwierig nachvollziehbar zu halten.\n\nAn sich ist deine Sicht aber auch verständlich. Dass man aktiv etwas tun will und dass diese Aktivität auch wahrnehmbar sein muss, ist doch völlig klar. An sich wird sich das vielleicht irgendwann mal durch die Wiedereinführung des Tribunals möglich sein, wo man vermutlich wieder seinen eigenen Einfluss deutlich sehen kann. Da das aber vermutlich noch einige Zeit dauern wird, schlage ich dir vor, dass du regelmäßig diesem Unterforum hier einen Besuch abstattest. Hier kann man regelmäßig die Funktionstüchtigkeit der Chatanalyse begutachten.","replies":[{"poster":"Good Guy Putin","date":"2016-10-17T12:57:15.531+0000","up_votes":1,"down_votes":0,"body":"Es wäre aber mal ganz nett, wenn man zum Beispiel am Ende einer Season eine Nachricht bekommen würde in der steht, bei wievielen Bestrafungen man tatsächlich mitgewirkt hat :D","replies":[{"poster":"eingew","date":"2016-10-17T14:16:28.941+0000","up_votes":2,"down_votes":0,"body":"Mein persönlicher Favorit wäre, wenn man alle 100 Reports eine genaue Liste bekommen würde, wo steht, wie viele Überprüfungen und wie viele Bestrafungen man durch diese ausgelöst hat.","replies":[{"poster":"Good Guy Putin","date":"2016-10-17T14:41:05.001+0000","up_votes":1,"down_votes":0,"body":"Das wäre auch ziemlich nice.","replies":[]}]}]}]}]}]},{"poster":"Sakunosuke Oda","date":"2016-10-16T18:14:11.093+0000","up_votes":2,"down_votes":0,"body":"In der Tat und die beste Nachricht ist wenn du einen toxischen Spieler reported hast und dann am nächsten Tag eine Mitteilung kommt\n\"Danke Beschwörer,\nDer Spieler den du vor kurzem gemeldet hast wurde bestraft\"\n\nIrgendsoeine Mitteilung kommt dann ;)","replies":[{"poster":"Megamaexx","date":"2016-10-16T20:04:45.182+0000","up_votes":2,"down_votes":0,"body":"Die kommt nicht immer, wenn nicht sogar eher selten.","replies":[]}]},{"poster":"Busty Botter","date":"2016-10-17T11:01:25.501+0000","up_votes":1,"down_votes":0,"body":"ich habe vorher wieder eine bekommen :)\nWenn du wissen willst ob deine Reports etwas bewirken, also wenn der Übeltäter mehrere Spiele so ein Fehlverhalten an den Tag legt, notiere dir doch einfach die Namen von den ganz schlimmen Fingern und schau einmal die Woche auf op.gg oÄ auf ihr Profil. Sollten da ca 2 Wochen keine Spiele sein kannst du stark davon ausgehen, dass diese Person bestraft wurde.","replies":[]}]}