{"poster":"Málnás","date":"2016-09-21T20:02:46.241+0000","title":"Just  O.o.... pls :'(","up_votes":1,"down_votes":0,"body":"Sziasztok ! Valaki volna olyan kedves &eacute;s elmagyar&aacute;zn&aacute; nekem , hogy mi&eacute;rt kapok j&oacute; mmr -mre tot&aacute;lis kezdőket akik azt&aacute;n lehuzz&aacute;k &eacute;s minden kezdődik előr&ouml;l. Konkr&eacute;tan f&eacute;l &eacute;ve ugyan az a szek&eacute;r. b3-b&oacute;l feljutottam g3 ig. azt&aacute;n megrekedtem gold5 ben de &uacute;gy hogy.  iszonyat sok lose . azt&aacute;n pikk pakk g4 prom&oacute; . 1 win promon 2 lose. azt&aacute;n 15 lose sorozatban. (kb) majd csak vissza silverbe... &eacute;s megint kezdődik a pikk pakk g4 promo 1 win 2 lose , majdnem silver. f&eacute;l &eacute;ve ugyan ez megy mindig . JUST WTF ( K&eacute;rem az &quot;oda val&oacute; vagy&quot; &eacute;s &quot;elősz&ouml;r a saj&aacute;t port&aacute;don n&eacute;zz k&ouml;r&uuml;l &quot; hozz&aacute;sz&oacute;l&aacute;sokat hanyagoljuk)  Most j&ouml;n a tipikus &eacute;n nem feedelek stb duma. de ritka az amikor &eacute;n r&aacute;kezdek. El&eacute;g j&oacute; statjaim szoktak lenni.  (igyekeztem r&ouml;viden t&ouml;m&ouml;ren fogalmazni)","replies":[{"poster":"Xescure","date":"2016-09-21T20:08:44.090+0000","title":null,"up_votes":2,"down_votes":1,"body":"Bocs, tudom, hogy különbnek érzed magad, de nem vagy az. Nagyon klasszikus poszt... :-/ Gondolkozz el azon, hogyha nem is a játékoddal, hanem valami mással van a baj ami esetleg rosszul befolyásolja a többieket (khm toxicitás)... Vagy lehet, hogy mégsem vagy olyan jó :-/ A Riot MMR rendszere a \"nem is olyan vészes\" kategóriába tartozik, szóval a hiba valahol benned van! ╚(ಠ_ಠ)=┐","replies":[]},{"poster":"Málnás","date":"2016-09-21T20:17:42.933+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ezt a hiba bennem van dolgot még s5 ben korigáltam(be is jött) . Tisztában vagyok a képességeimmel. Ha épp nem hozom a kötelezőt akkor nem erőltetem a dolgot. és ha úgy tetszik \"def\"-re  váltok . chatet igyekszem nem használni . próbálok csak dicsérni. egy két noob azért becsúszik mikor minden egyes percben 3-4x közli  a bemondó hogy na megint kimurdelt a csapatod xy tagja. Na meg rengeteg unrakedet kapok holott goldban vagyok egy újabb just wtf.","replies":[{"poster":"SS Éjjeli Féreg","date":"2016-09-22T09:22:01.594+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem mindenkinek való ez a játék én például próbáltam megtanulni starcraftozni de még a botokat 1v1-ben is alig tudtam elverni egyszerűen nem ment béna voltam hozzá .Nem vagyunk egyformák javaslom keress olyan játékot ami jobban azonosul a képességeiddel.","replies":[]}]},{"poster":"Tetth","date":"2016-09-22T04:20:57.763+0000","title":null,"up_votes":1,"down_votes":0,"body":"A poén az hogy az mmr javulásának és romlásának MÉRTÉKE attól függ hogyan játszol.\n\nMindenki azzal jön hogy \"mindig megnyertem a lane-m miért feedel mindenki más?!\", holott okos mozgással a mapon könnyebbé teheti a dolgokat mindenki számára, és sokszorosát éri annak mintha megnyernéd a lane-t.\n\nNem tudom, wukonggal 70% win rate-m van 20 játék alapján silverben. Na vajon miért? :3 Early-ben NAGYON gyenge a laning phase-e. (Egyenlőre úgy tűnik nem is állok meg goldig, overall 78% win rate-el büszkélkedhetek jelenleg)\n\nA többieknek igaza van, mmr-ről csak közelítő értéket kaphatsz, a pontos számok nem publikusak.","replies":[]},{"poster":"BazsikaHu","date":"2016-09-21T21:06:12.014+0000","title":null,"up_votes":1,"down_votes":0,"body":"Melyik accodal csinálod ezt?:D","replies":[]},{"poster":"Nemin","date":"2016-09-21T20:56:23.576+0000","title":null,"up_votes":1,"down_votes":0,"body":"A divízió még mindig irreleváns, csak az MMR számít, ami viszont még mindig szigorúan titkos.\n\nAz ilyen oldalak mint az OP.GG sose fognak pontos értéket mutatni, szóval fölös azzal jönni, hogy ilyen meg ilyen az MMR-em.","replies":[]},{"poster":"Málnás","date":"2016-09-21T20:22:38.380+0000","title":null,"up_votes":1,"down_votes":0,"body":"Viszont mostanában elég pozitív a support téren felhozatal.arra nem tudnék választ adni mikor buktam utoljára mint adc a bot lanet. ha csak nem 4v2 ben kell tolni :) , szóval ha bukom a meccset sem volt probléma boton.kivéve ugye ha 2 en vagyunk mindenki ellen :) feljebb vannak a gondok. van amit nem lehet lehozni.","replies":[]}]}