{"poster":"yay nibbers","date":"2016-01-18T16:31:04.538+0000","title":"Can switching Smite upgrades for free be a thing again now that Trailblazer is gone?","subforum":"Gameplay","up_votes":213,"down_votes":12,"body":"http://i.imgur.com/DKF7k67.png\nWe can switch between the Hydras for free, why not Smite upgrades? I remember way back near the beginning of Season 5 we could switch between upgrades before buying the gem upgrades for free but that was too OP because Trailblazer existed. They had to tack a price onto it because people would buy Trailblazer initially for the sustain then switch upgrades for free. This is no longer an issue however since they removed Trailblazer. Since the problem is removed, why does it still cost a couple hundred gold to switch?\n\nOn a similar note, it&#039;d be cool to be able to switch smite upgrades after the gem upgrades too, it&#039;s not often that you&#039;d actually need to switch but this  but then how often do you actually need to switch Hydras?","replies":[{"poster":"ZephyrDrake","date":"2016-01-18T16:58:48.114+0000","up_votes":4,"down_votes":23,"body":"well first they'd have to increase the price of devourer since it's not the same price as the other enhancements for whatever reason","replies":[{"poster":"yay nibbers","date":"2016-01-18T17:01:57.183+0000","up_votes":41,"down_votes":0,"body":"I don't mean switch enchantments, I want to be able to switch the smites, Stalker's(Chilling) to Skirmisher's(Challenging) for example.","replies":[]},{"poster":"The Yetii Rider","date":"2016-01-18T20:07:17.489+0000","up_votes":1,"down_votes":11,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=0002,timestamp=2016-01-18T16:58:48.114+0000)\n>\n> well first they'd have to increase the price of devourer since it's not the same price as the other enhancements for whatever reason\n\nIt's not the same because you need to start stacking it earlier and the power of the item on buy is delayed by stacking, so the power of Warrior and Cinderhulk on-buy is delayed by gold.","replies":[{"poster":"Mimaropa","date":"2016-01-19T04:01:04.196+0000","up_votes":6,"down_votes":0,"body":"Captain here,\n\n{{item:3706}} {{item:3715}} {{item:3711}}  all cost 1050 gold to build.\nEnchantments costs are varied({{item:1403}}   = 2450g ,{{item:1401}}   = 2625)\nRon is saying that you could switch from the 3 since they cost the same and not the enchantments.\n\nCaptain flies away...","replies":[{"poster":"The Yetii Rider","date":"2016-01-19T04:15:02.139+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Mimaropa,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=000200010000,timestamp=2016-01-19T04:01:04.196+0000)\n>\n> Captain here,\n> \n> {{item:3706}} {{item:3715}} {{item:3711}}  all cost 1050 gold to build.\n> Enchantments costs are varied({{item:1403}}   = 2450g ,{{item:1401}}   = 2625)\n> Ron is saying that you could switch from the 3 since they cost the same and not the enchantments.\n> \n> Captain flies away...\n\nCheck the patch notes. The first tier jungle items now cost 1000 gold each, not 1050.","replies":[{"poster":"rtbf223219960","date":"2016-01-19T11:36:11.695+0000","up_votes":6,"down_votes":0,"body":"how to point out someones mistakes for no reason 101...","replies":[{"poster":"The Yetii Rider","date":"2016-01-19T14:17:17.732+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CyanideDrift,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=00020001000000000000,timestamp=2016-01-19T11:36:11.695+0000)\n>\n> how to point out someones mistakes for no reason 101...\n\n'No reason'? I said it because it sounded like he actually hadn't read the Patch Notes yet, and he should because TL isn't the only good mastery anymore and he needs to be aware of that. \n\nLots of people don't read the patch notes, you should always encourage others to stay current.","replies":[]}]},{"poster":"Laurënt","date":"2016-01-19T17:18:10.603+0000","up_votes":1,"down_votes":0,"body":"I think you misunderstood Ron.. He meant that switching between the type of smite should be free ( Red - Yellow - Blue ) not the enchantment ( Cinderhulk - Devourer - Warrior - Runic Echoes ). It doesn't matter if its 1050 or 1000 for all first tier jungle item, we should be able to switch the first tier even when it is upgraded. Ex. {{item:1401}} {{item:1409}} {{item:1413}} They are 3 different jungle items with the same upgrade. Their first tier costs are the same, their upgrade cost are the same. Then why can't we switch between them for free? Stalker Tracker and Skirmisher all cost 1k gold why do we have to pay 17(2) gold to switch between them? and their enchantments cost the same ( Stalker-Devourer, Skirmisher-Devourer and Stalker-Devourer ) why can't we switch between the smite?\n\nTD;DR: **WE SHOULD BE ABLE TO SWITCH SMITE FOR FREE EVEN AFTER THE UPGRADE, HOWEVER SHOULD NOT BE ABLE TO SWITCH THE UPGRADE**","replies":[]}]}]}]}]},{"poster":"AyRe CoNteMpT","date":"2016-01-18T16:40:49.166+0000","up_votes":2,"down_votes":33,"body":"the hydra switch is fucking retarded and shouldnt exist and the smite switch shouldnt exist aswell, not even for money. sell it and buy a new one if you really need to switch it.\n\nor they should make it so that you can switch every item into every other item and if you switch it into a cheaper one, you get back the remaining gold while if you switch it into a more expensive one, you have to pay the extra gold too. so they can remove recipies entirely and just make it so you start with a dorans item and can switch it into anything.","replies":[{"poster":"yay nibbers","date":"2016-01-18T16:44:44.229+0000","up_votes":17,"down_votes":0,"body":"Switching Hydras and Smites exist because the different respective items are so closely related with such similar build paths and prices but serve slightly different purposes. Being able to switch between extremely similar items like this is a cool feature. You're just being ridiculous about all that other stuff.","replies":[{"poster":"AyRe CoNteMpT","date":"2016-01-18T17:14:16.431+0000","up_votes":1,"down_votes":26,"body":"all the BF sword items are the same too, can we switch through them please?\nall the NLR items are the same too, switch?\ndorans same, switch?\n\nthis game just simply doesnt have alot of item diversity","replies":[{"poster":"yay nibbers","date":"2016-01-18T17:19:28.074+0000","up_votes":14,"down_votes":0,"body":"I fail to see how IE, a crit item for critting, is the same as the Bloodthirster, a lifesteal item for sustaining. Or how Zhonya's is even remotely similar to Deathcap besides the one item they share in their build paths. There's plenty of diversity, you're just oversimplifying things to make a poor point.\n\nThis is about function, the Hydras are waveclear items that give the user AOE auto attacks and actives. The smite upgrades, well, upgrade your smite to be used on champions.","replies":[{"poster":"Mecha MaIphite","date":"2016-01-18T22:03:20.671+0000","up_votes":2,"down_votes":0,"body":"He's being sarcastic. It's not very evident, but I'm fairly certain that he is.","replies":[{"poster":"Cobbler Potato","date":"2016-01-19T05:46:44.880+0000","up_votes":1,"down_votes":0,"body":"This isn't related, but you're the first person besides myself that I've seen with the Group icon! xD","replies":[]}]},{"poster":"MunchCrunchLunch","date":"2016-01-20T08:21:35.768+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ron Pitts,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=0001000000000000,timestamp=2016-01-18T17:19:28.074+0000)\n>\n> I fail to see how IE, a crit item for critting, is the same as the Bloodthirster, a lifesteal item for sustaining. Or how Zhonya's is even remotely similar to Deathcap besides the one item they share in their build paths. There's plenty of diversity, you're just oversimplifying things to make a poor point.\n> \n> This is about function, the Hydras are waveclear items that give the user AOE auto attacks and actives. The smite upgrades, well, upgrade your smite to be used on champions.\n\nthey serve different purposes. you can get the chilling smite for ganks and late game you might want the red smite for sustain. or the warding smite since u don't have access to more wards because of full build.","replies":[]}]}]},{"poster":"ChaoticPinecone","date":"2016-01-18T21:46:54.745+0000","up_votes":2,"down_votes":0,"body":"No, he actually has a point. The NA casters mentioned a hidden benefit of the \"switch\" as well - the Titanic actually has a better build path than the Ravenous. \n\nThe Jaurim's fist + Ruby Crystal is worth 1325 gold with no stacks, 1725 at max stats. The Vamp Scepter + Long Sword is worth 1250 gold. (And the Titanic has a 700 combine cost compared to the 1050 of Ravenous, allowing you to back and buy with more frequency with smaller powerspikes instead of a huge powerspike after sitting on a bunch of gold.) However, the Titanic is worth 3250 in gold while the Ravenous is worth 3375 (both without passive or active included). \n\nIts an objectively smarter decision to build up the Titanic then switch once the full item is built. The Trailblazer didnt even have that type of onesided advantage - Trailblazer was only the better buy if you couldnt use chilling/challenging smite to secure a kill.","replies":[]}]}]},{"poster":"Vistha Kai","date":"2016-01-18T18:04:18.572+0000","up_votes":3,"down_votes":1,"body":"Trailblazer?\nWhat's that?\nCan you eat it?","replies":[{"poster":"DrProfVibeCheck","date":"2016-01-18T18:52:58.640+0000","up_votes":2,"down_votes":2,"body":"Purple Smite","replies":[{"poster":"AATTRROOXX","date":"2016-01-18T19:19:55.436+0000","up_votes":4,"down_votes":2,"body":"The joke\n\nYour head","replies":[{"poster":"137434","date":"2016-01-18T20:04:42.012+0000","up_votes":9,"down_votes":0,"body":"Was an odd joke considering Trailblazer was fairly popular though. Its not like we are talking about Poacher's Knife.","replies":[{"poster":"ntbcool","date":"2016-01-18T22:01:28.533+0000","up_votes":1,"down_votes":0,"body":"Poacher's Knife?{{champion:83}}","replies":[{"poster":"Odinakos","date":"2016-01-19T07:05:25.621+0000","up_votes":6,"down_votes":0,"body":"An exclusive item for Nunu when he wanted to make the enemy's jungler life a real hell. Statistics show that people doing that are 12984% more likely to become terrorists.","replies":[]}]}]}]}]},{"poster":"Boxpencil","date":"2016-01-18T20:30:22.526+0000","up_votes":1,"down_votes":0,"body":"is trailblazer an instrument?","replies":[{"poster":"Nahara","date":"2016-01-18T21:36:37.344+0000","up_votes":1,"down_votes":0,"body":"No, Patrick, Trailblazer is not an instrument...","replies":[]},{"poster":"Vistha Kai","date":"2016-01-18T20:59:32.355+0000","up_votes":1,"down_votes":0,"body":"Now that you mention it...\nReminds me of this guy:\nhttps://www.youtube.com/watch?v=EPydRKuhuEk","replies":[]}]}]},{"poster":"IronwallJackson","date":"2016-01-18T17:14:45.777+0000","up_votes":9,"down_votes":0,"body":"I think a part of why the Hydras are switchable is to make them mutually exclusive in your inventory. But yeah, now that Trailblazer's gone, I don't see too much of an issue with changing enchantments. Well, aside from Devourer being a thing. Switching out those out might result in a stack reset, so who knows what sort of coding would be involved, given how awful Riot's older code is.","replies":[{"poster":"My Waifu Vanilla","date":"2016-01-18T18:57:02.961+0000","up_votes":2,"down_votes":0,"body":"I believe he means switching your chosen smite (blue/red/green) after you put an Enchantment in it. For example, you have Green Smite Devourer but are having trouble sticking to targets so you want to switch to Blue Smite Devourer. The Devourer part would stay the same it is just the chosen smite you have that would change which is currently impossible to do once you put an Enchantment inside of the smite item.","replies":[{"poster":"IronwallJackson","date":"2016-01-18T19:01:30.058+0000","up_votes":2,"down_votes":2,"body":"The portion of my post talking about Devourer was meant to address that. If I were to hazard a vaguely-educated guess, I'd say that enchantments do not exist independently of the things they're attached to, so changing your Skirmisher's Sabre for a Stalker's Blade would result in a new Devourer enchantment rather than one that kept its current stacks.","replies":[{"poster":"yay nibbers","date":"2016-01-18T20:02:48.784+0000","up_votes":2,"down_votes":0,"body":"I cant imagine it would be hard to code considering Tear of the Goddess transfers its stacks to its upgrades","replies":[{"poster":"IronwallJackson","date":"2016-01-18T20:07:41.384+0000","up_votes":6,"down_votes":1,"body":"I don't trust Riot's coding.","replies":[{"poster":"Awkward Couch","date":"2016-01-18T21:33:04.188+0000","up_votes":8,"down_votes":0,"body":"http://cookdiary.net/wp-content/uploads/images/Spaghetti_15818.jpg","replies":[{"poster":"IronwallJackson","date":"2016-01-18T21:41:59.923+0000","up_votes":1,"down_votes":0,"body":"Pretty much. Only thing worse than legacy code is inherited legacy code. Luckily, Riot deals with the former instead of the latter, as far as I know, anyway.","replies":[{"poster":"Awkward Couch","date":"2016-01-18T21:46:18.031+0000","up_votes":3,"down_votes":2,"body":"I kind of wish that Riot would re make the game from scratch.  Maybe then there wouldn't be all this Spaghetti?  I've only taken a couple comp. sci classes, but I would think starting fresh would be better than putting a band aid on the situation (like Riot has done for years).","replies":[{"poster":"IronwallJackson","date":"2016-01-18T22:50:45.909+0000","up_votes":1,"down_votes":0,"body":"Oh, it certainly would make things better, given the talent they have at their disposal now. Trouble is, actually undertaking such a task would be nothing short of monumental. League's a big game, and it would take a long, long time to do remake all of it, time made that much longer by the progress of the existing game since Riot can't afford to close shop for a couple of years.","replies":[]}]}]}]}]}]},{"poster":"RisenDarkKnight","date":"2016-01-19T04:19:51.009+0000","up_votes":1,"down_votes":0,"body":"That's not how it works, luckily.  Riot \"remember's\" your devourer stacks even if you sell it.  Many times late game I've sold my ranger's devourer for a skirmisher's (before the preseason).","replies":[{"poster":"Kritty","date":"2016-01-19T06:10:12.519+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RisenDarkKnight,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=0005000000000001,timestamp=2016-01-19T04:19:51.009+0000)\n>\n> That's not how it works, luckily.  Riot \"remember's\" your devourer stacks even if you sell it.  Many times late game I've sold my ranger's devourer for a skirmisher's (before the preseason).\n\nThat actually used to cause issues, too, since players could buy a second Devourer enchant in a new item, and then stack it up and get double enchants.\n\nThose were some disgusting videos.","replies":[]}]}]}]}]},{"poster":"Phoenix Kotori ","date":"2016-01-18T16:39:39.923+0000","up_votes":9,"down_votes":0,"body":"+1 I'd like this change.","replies":[]},{"poster":"junglerboy16","date":"2016-01-18T17:03:16.245+0000","up_votes":1,"down_votes":2,"body":"Actually, most Hydra users switch consistently by the end of the game, since Ravenous is much stronger early and Titanic outscales Ravenous's damage and survivability.\n\nI can't think of any reason to switch the smite upgrades actually.","replies":[{"poster":"My Waifu Vanilla","date":"2016-01-18T18:59:32.976+0000","up_votes":6,"down_votes":0,"body":"Finding out your team sucks at warding or the fact you are now suddenly having a problem sticking to targets in teamfights would be a viable choice to switch.","replies":[{"poster":"Dar Raksada","date":"2016-01-18T20:57:51.460+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=My Waifu Chocola,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=00040000,timestamp=2016-01-18T18:59:32.976+0000)\n>\n> Finding out your team sucks at warding or the fact you are now suddenly having a problem sticking to targets in teamfights would be a viable choice to switch.\n\nIt happens too often that the support neglects to get sightstone, or just doesn't use it.","replies":[{"poster":"Shilöh","date":"2016-01-19T12:58:00.689+0000","up_votes":1,"down_votes":0,"body":"There are four other people on the team who can contribute to warding. I don't think it is just the supports job to ward. Having the trackers knife is also a safe way to keep your jungle warded from invades.","replies":[{"poster":"Dar Raksada","date":"2016-01-19T13:04:16.131+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Full Malice,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=0004000000010000,timestamp=2016-01-19T12:58:00.689+0000)\n>\n> There are four other people on the team who can contribute to warding. I don't think it is just the supports job to ward. Having the trackers knife is also a safe way to keep your jungle warded from invades.\n\nYes, but just because everyone should ward doesn't mean the support shouldn't ward. The reason I don't just automatically buy Poachers is because sometimes I need red smite to duel the enemy jungler, it helps me kill stuff like Yi, Xin, Rengar etc. 1v1 as well as enabling me to dive the enemy team better (on {{champion:56}} ). While blue smite is very valuable for {{champion:9}}  to keep people in range of drain/stalk people with your ult, or on {{champion:14}} to keep people from casually strolling out of your Q.\n\nTo be fair I miss green wards/proper trinket upgrades, I used to use those a lot, to the point where I outwarded supports* sometimes.\n\n","replies":[]}]}]}]}]},{"poster":"Athenes Lulu","date":"2016-01-19T03:08:16.239+0000","up_votes":4,"down_votes":0,"body":"Even if they have a price tag for switching, I'm all in for it.\n\nEspecially when you finally realized that your idiot Brand support *refused* to buy a Sightstone.","replies":[]},{"poster":"FirePower247","date":"2016-01-19T15:23:09.811+0000","up_votes":1,"down_votes":0,"body":"Ithink the problem would be that people wouild switch to the warding one then ward the jungle/lanes then quickly back and switch back to better smite, so people will just use it for free wards.","replies":[{"poster":"Uiru","date":"2016-01-19T18:11:31.483+0000","up_votes":3,"down_votes":0,"body":"Trinkets have proven that people are too stupid to use wards even when they're free.","replies":[]}]},{"poster":"LostFr0st","date":"2016-01-18T23:27:42.995+0000","up_votes":1,"down_votes":4,"body":"No, please no.  Maybe they could let us switch before we pick our enchant, but not after.\n\nThe blue smite is arguably the best for ganks, red for teamfights, green for vision after you switch to scanner (if you find there's a lot of ward debris).\n\nThe hydras have a very similar purpose, these do not.","replies":[{"poster":"PogChampEleGiggl","date":"2016-01-19T01:10:31.908+0000","up_votes":2,"down_votes":0,"body":"not exactly.. The {{item:3748}} helps you survive a larger amount of burst while still retaining some damage, where as {{item:3074}} helps you sustain health for long periods of time and stay alive more with high burst but much lower defense\n\nthey are much different.","replies":[]}]},{"poster":"allthemuslims","date":"2016-01-18T21:41:36.634+0000","up_votes":2,"down_votes":0,"body":"As much as I would like for this to happen, here's what's going to keep it in my dreams instead of being a reality:\nI start off with chilling smite for my early ganks,\nMid game/farming time swap to warding smite to keep on top of objective control, then when teamfights hit just back for challenging smite. If you need vision control of your own jungle just back swap ward and swap back. Not to mention junglers being forced into ward mules like supports, \"Just back and swap we want vision everywhere but we don't want to upgrade our trinkets or palce a single ward ourselves, you can swap again right after\".","replies":[]},{"poster":"Erockandroll","date":"2016-01-18T17:02:14.442+0000","up_votes":2,"down_votes":1,"body":"They done with it on the Jungle items because, at the time. Swapping between Smites, didn't make the game interesting. You always started with Trailblazer because that gave you the best clears, and only prior to completing your item you always swapped to either challenging smite, or chilling smite.\n\nThat said, I'm not sure how Hydra is any different. Titanic hydra basically has a better Build path than Ravenous, and yet, it doesn't mean anything since you can swap them without considering the build path. \n\n> [{quoted}](name=Ron Pitts,realm=NA,application-id=3ErqAdtq,discussion-id=Z6ltbQx5,comment-id=00010000,timestamp=2016-01-18T16:44:44.229+0000)\n>\n> Switching Hydras and Smites exist because the different respective items are so closely related with such similar build paths and prices but serve slightly different purposes. Being able to switch between extremely similar items like this is a cool feature. You're just being ridiculous about all that other stuff.\n\nBy this logic, it would make sense to allow the energized items to be swapped. Since RFC and Shiv have the exact same build path, and the cost the exact same gold wise. Yet, I can't see doing so, making either item a more interesting experience.","replies":[]},{"poster":"V1CTIS HONOR","date":"2016-01-20T02:19:51.857+0000","up_votes":1,"down_votes":0,"body":"Lee Sin buffs incoming.","replies":[]}]}