{"poster":"PrZontech","date":"2017-10-08T20:13:05.978+0000","title":"Emparejamiento desigual.","subforum":"Charlas Generales","embed":{"description":null,"url":"https://3.bp.blogspot.com/-8t2NUd8Zr3Y/WdqGnP7f4DI/AAAAAAAABR0/A6NUxemaAQsjkcRKY8R22DqMGmiO4opwwCLcBGAs/s1600/Captura%2Bde%2Bpantalla%2B%2528123%2529.png","image":null},"up_votes":6,"down_votes":2,"body":"Hoy entr&eacute; a una partida de soporte, todo muy normal con mi adcarry, arrasamos en linea, hice buen peel y mi adc se feede&oacute;.\r\nFue diferente en otras lineas, un yasuo mid termin&oacute; 2/11, un garen con 40 de farm minuto 30, un jax que no ganke&oacute; ninguna linea en toda la partida.\r\nAl terminar la partida decid&iacute; visitar los perfiles de los jugadores y ah&iacute; me doy cuenta de la raz&oacute;n de su rendimiento.\r\nJax y Yasuo unranked, en su primera partida de posicionamiento, sin ning&uacute;n campe&oacute;n en maestr&iacute;a +4. Garen bronce V con 0 pl.\r\nYo soy plata III, el adc que me toc&oacute; supportear era plata II, y ac&aacute; es donde veo la injusticia, TODO el equipo enemigo era +plata III, incluso hab&iacute;a un oro. \r\nEsto no es un lloriqueo, estoy acostumbrado a ganar y a perder partidas, pero de verdad me sale mal perder solo porque el sistema de emparejamiento me jug&oacute; una mala pasada. No s&eacute; si habr&aacute; una forma de pulir este sistema, y si no la hay, este solo es un mensaje para desahogarme.\r\nGracias por leerme.","replies":[{"poster":"Stailuz","date":"2017-10-08T21:52:47.068+0000","up_votes":1,"down_votes":0,"body":"Borra el post o cambia la imagen, te van a dar ban por postear nicks de otros players :v","replies":[]},{"poster":"Mecha Sétt","date":"2017-10-08T20:26:03.368+0000","up_votes":1,"down_votes":0,"body":"Hola, de todos modos considera que quizas tenga que ver con el mmr. Hay gente que fueron unranked y otros que tienen un alto mmr y simplemente se habran tildeado por X Y Z motivo, como puede ser que haya algun smurf que efectivamente se note que carreara. \n\n Mi recomendación es que persistas, no te rindas. en la medida que vallas ganando, lograras que te toque con gente con mas mmr. Y en caso que quieras asegurar 1 jugador con quien tener afinidad, puedes probar hacer duo. Pero \"ojo\", la idea del duo es que sea con alguien quien conozcas y te divierta jugar con el, sin olvidar el usar algun programa para comunicarse por voz para aprovechar esto. Un abrazo grande.","replies":[{"poster":"Zafphlyn","date":"2017-10-08T20:52:59.141+0000","up_votes":1,"down_votes":0,"body":"como van a tener mmr siendo unranked?","replies":[]}]},{"poster":"Annie Botz","date":"2017-10-08T20:38:21.240+0000","up_votes":1,"down_votes":0,"body":"Esto se da por un mal emparejamiento en las normal, mi sobrino tiene menos 50% winrate en normal (de cuando era incapaz de matar bots xD) y ahora que sabe juar un poco más siempre dice que es \"fácil\" y que los demás no saben jugar. Es verdad que no saben jugar, pero eso lo lleva a pensar que él es mejor.\n\nComo resultado tiene 39%winrate en soloQ, es bronce 1 en promo a plata 5. La cosa es que las ranked le exigen mucho más de lo que está acostumbrado a jugar, a pesar de que el elo sea de plata-bronce.","replies":[]}]}