{"poster":"Sasaki Kojíro","date":"2017-10-12T15:26:44.346+0000","title":"¿Recompensa por reportar a personas?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":17,"body":"Pense que capas las personas que ayudan a la comunidad, reportar a flamers etc, podrian recibir alguna recompensa simple, un iconito o algo que este en tu marco...\r\n\r\n&iquest;Que creen?","replies":[{"poster":"Aslicolly17","date":"2017-10-12T17:39:58.333+0000","up_votes":4,"down_votes":0,"body":"se podría prestar para reportes sin sentido, no lo veo factible","replies":[]},{"poster":"Lapou","date":"2017-10-12T20:35:12.630+0000","up_votes":3,"down_votes":0,"body":"http://quebolu.com/facebook-img/uploads/meme1472144859gen.jpg","replies":[]},{"poster":"Not Personal","date":"2017-10-12T16:39:12.017+0000","up_votes":2,"down_votes":0,"body":"Por ahi abajo dijeron 25 de PI y se me ocurrio una idea, capaz darte escencia azul o experiencia si se llega a banear al jugador reportado, y alguna penalizacion por muchos reportes injustificados.","replies":[]},{"poster":"devilman10","date":"2017-10-12T16:06:58.090+0000","up_votes":2,"down_votes":0,"body":"Yo diría que si es un buen reporte y si se logra banear que te den 25 de pi","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-10-12T15:27:44.325+0000","up_votes":2,"down_votes":1,"body":"¿Tener un juego más limpio no es una recompensa en si?\n\nAdemas aumentaria los que reportan por cualquier cosa ;/","replies":[{"poster":"Sasaki Kojíro","date":"2017-10-12T15:32:20.420+0000","up_votes":1,"down_votes":0,"body":"Obviamente, los reportes por cualquier cosa no sirven de nada, y estar reportando todo el tiempo, por cosas que no tienen sentido al usuario sera penalizado.","replies":[{"poster":"Hnk Kenshiro","date":"2017-10-12T15:44:32.645+0000","up_votes":1,"down_votes":0,"body":"Una iniciativa para reportar y reportar bien lo apoyo.\n\nAlgo con recompensas me parece que no es lo correcto.","replies":[{"poster":"Sasaki Kojíro","date":"2017-10-12T15:49:06.005+0000","up_votes":1,"down_votes":0,"body":"Si pero seria como, algo simple, un iconito o algo en el marco asi nomas.","replies":[{"poster":"Hnk Kenshiro","date":"2017-10-12T15:51:47.526+0000","up_votes":1,"down_votes":0,"body":"Es que va a cumplir hasta que tenga el icono y después volverá a su conducta de no reportar :p\n\nEl objetivo es que reporten bien, y el premio por eso sera un icono, suena bien, pero seguramente para ellos el objetivo sea el icono y reportar bien solo el escalón para tener el icono.","replies":[]}]}]},{"poster":"TSW Rorschach","date":"2017-10-12T15:35:27.108+0000","up_votes":1,"down_votes":0,"body":"Entonces comenzarían a hacer el truco de hostigar a un aliado para que este explote y se pueda reportar válidamente y de esa forma se puedan tener recompensas. Lo he visto bastante y con un sistema que te indique reportar más, creo que esto sería mucho más frecuente.","replies":[]}]}]},{"poster":"SuperGranMaestro","date":"2017-10-12T17:34:34.160+0000","up_votes":1,"down_votes":0,"body":"Que me den un centavo por cada reporte que envié ( sin que sucediera absolutamente nada )  y hoy ya  tendría millones de dolares :)\nBásicamente en un par de  cuentas de Elo bajo donde reporto .. si me dieran ese centavo por reportar AFKs  yo hoy conduciría un Bugatti Chirion :)\nNo pueden dar recompensas ... seria imposible.","replies":[{"poster":"WL Leo","date":"2017-10-12T20:18:51.073+0000","up_votes":1,"down_votes":0,"body":"Bugatti Chiron*","replies":[]}]},{"poster":"Yitán","date":"2017-10-12T16:55:33.601+0000","up_votes":1,"down_votes":0,"body":"tu recompensa es eliminarte de un troll","replies":[]},{"poster":"Paradisco","date":"2017-10-12T16:04:53.076+0000","up_votes":1,"down_votes":0,"body":"O que de verdad hagan algo cuando reportes, esa sería buena recompensa.\n{{champion:60}}","replies":[{"poster":"Sasaki Kojíro","date":"2017-10-12T16:06:05.916+0000","up_votes":1,"down_votes":0,"body":"Es que se si le cae un report, no lo aceptan, y supongo que si caen mas reportes a esa persona, ahi si tomaran las riendas(?","replies":[]}]},{"poster":"yOCobain","date":"2017-10-12T15:54:28.326+0000","up_votes":1,"down_votes":0,"body":"Para mí ya con que me muestren el cartel de feedback que de hecho me lo muestran en la mayor parte de los reportes que hago, me deja tranquilo y conforme. \n\nA lo sumo si hubiera un contador de reportes que hayas hecho correctamente, ganarte un título de sheriff de piltover o un icono de \"Brazo de la ley\" (?) Jajajaja .\n\nLa verdad no imagino mucho mas. Creo que nosotros reportamos primero que nada por y para nosotros mismos, para evitar que esa persona nos  vuelva a tocar en una partida. Obviamente eso también ayuda a la comunidad pero creo que es casi un deber reportar cuando sabemos que algo no  va con las normas... no creo que amerite un premio.\n\nSaludos!!","replies":[]},{"poster":"Rebkans","date":"2017-10-12T15:51:37.187+0000","up_votes":1,"down_votes":0,"body":"No, no veo que sea necesario regalar algo por reportar.\n\nSi queremos una comunidad mejor, se debe reportar sin esperar algo a cambio.","replies":[]},{"poster":"Im Gloria Borger","date":"2017-10-12T15:45:16.385+0000","up_votes":1,"down_votes":0,"body":"No veo necesario el recompensar por reportar a alguien que merece ser sancionado xd","replies":[{"poster":"Sasaki Kojíro","date":"2017-10-12T15:50:10.235+0000","up_votes":1,"down_votes":0,"body":"Gracias por la respuesta {{sticker:sg-ahri-2}}","replies":[]}]}]}