{"poster":"iè na vit amàr","date":"2015-09-29T01:22:39.403+0000","title":"Positività! Positività! Positività!","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Salve a tutti,\r\navreste dei suggerimenti pratici da donarmi per le Ranked Solo? Come evitare di perdere la pazienza dopo infinite partite perse di seguito? Come mantenere la calma quando ti rendi conto che non riesci a sviluppare un game decente perch&eacute; il team non te lo consente, seppure si tenta di carriare disperatamente risultati impossibili? Semplicemente come poter accettare di utilizzare il proprio tempo a questa maniera: unirsi a delle partite con altri 9 sconosciuti e sperare che le persone che ti capitano non siano gamers che giocano per arrendersi continuamente o senza la minima voglia di comunicare con il team alleato? Perch&eacute; dei 4 players alleati ci sono talmente troppi casi di inesperienza e di basso rendimento? La scorsa season ero riuscito a carriarmi Gold con Fiddlesticks esasperato in tutte le lanes, Mid, Jungle, Supp. Adesso noto la stessa esasperazione nella gente che non si degna neanche a salutare appena entrano in team selection pickando champion a caso, non trovando nemmeno il tempo di creare una sinergia costruttiva tra tutti i campioni in gioco. Il tutto avviene troppo frettolosamente, non si ha il tempo di capire lo stile di gioco dell&#039;alleato che appare come un perfetto sconosciuto di cui non frega assolutamente niente di chi si trova accanto, ma si limita a fare chase a casaccio ovunque si presti una buona occasione, senza il minimo controllo della mappa mentale o delle previsioni che mettono a rischio la validit&agrave; di una pushata.  Cio&egrave; quello che ho notato &egrave; una frenetica rincorsa alla Kill, non c&#039;&egrave; un vero e proprio lavoro di squadra, dove alla minima variazione di presenza nemica si ha una consapevolezza esatta del drago in pre-early game.\r\nD&#039;accordo, queste parole possono suonare molto generali e ridondanti, con una puntina di noia.\r\nMa ho davvero bisogno di capire come uscire dalla elo Hell, e ritornare in Gold come l&#039;anno scorso.\r\nIo ci perdo del tempo di fronte a questo gioco, per quanto l&#039;idea idiota sia, ma non &egrave; ammissibile poter vincere una partita a fortuna su 6 match. Perch&eacute;? Le ragioni le sapete tutti. &egrave; diventato veramente complicato inculcare ed mantenersi in uno stile di gioco safe, dove ogni minimo spostamento rispetta un proprio perch&eacute; e non viene tentato a casaccio per tentare di ottenere un esito positivo da una battaglia rischiosa. Mi chiedo cosa spinge i gamers ad inseguire ogni minimo movimento avversario e di volerlo finire l&igrave; all&#039;istante, sapendo benissimo di potercela fare 1 v 1 ma non rendendosi conto di andarsi ad impelagare troppo all&#039;interno delle schiere nemiche. Come si fa a rendere possibile l&#039;ascolto in game? Bisogna scrivere delle frasi ad effetto per calmare un giocatore agitato dalle innumerevoli morti? O semplicemente fare ci&ograve; che fanno tutti, e cio&eacute; continuare a giocare la propria partita concentrati e senza condizionamenti negativi. Ma come pu&ograve; funzionare quando una valanga nemica si &egrave; formata dalla superbia del pushing della propria lane? Non conosco l&#039;esperienza di chi si pu&ograve; permettere di pushare in continuazione e di rimanere illeso alla gank proveniente dalla giungla o addirittura di guadagnarsi un doppia uccisione. Preferisco rimanermene sotto torre a farmare diligentemente e pregustare la build in costruzione tra giocate safe e late game del tutto rilassati. Purtroppo questo stile di gioco, che in questo periodo preferisco, non &egrave; sempre possibile, giacch&eacute; chi sta subendo gravi botte nella propria lane non riesce a rendersi conto di quanto possa essere essenziale fermarsi e farsi un analisi di coscienza, di fare un passo indietro e di aspettare l&#039;arrivo del jungler. magari recuperando un po&#039;  il ritmo del gioco osservando la vita dei minion calare al momento giusto per incassare seppure in piccola quantit&agrave; d&#039;oro, e intanto sviluppare una comprensione generale della mappa e del ventaglio di scelte che si possono compiere, o di sfruttare quei brevi momenti in cui il pushatore avversario si dimena dall&#039;impazienza e restituirgli pan per focaccia avvicinandosi sempre pi&ugrave; lentamente ad una vendetta lenta ma sicura, lontano dal rischio di subire una caterva di danni senza motivazione.\r\nBene, se voi avete letto questo messaggio, ma credo davvero in pochi, per l&#039;eccessiva prolissit&agrave;, vi chiedo qualche consiglio.. non so qualche trucchetto per accattivarsi la positivit&agrave; dal team ed instillare in loro il gioco consapevole.\r\nPosso dire che tutto questo discorso non mi convince, soprattutto quando mi riferisco a persone in generale che non riguardano me medesimo, , poich&eacute; far ricadere le responsabilit&agrave; delle proprie mosse su altri &egrave; sicuramente una distrazione o un bad positioning. in ogni caso ci&ograve; che vorrei &egrave; una soluzione teorica per uscire da una serie sconcertante di sconfitte apparentemente non dovute al mio operato. Accetto solamente commenti costruttivi, gli altri cercher&ograve; di trasformarli il pi&ugrave; possibile, grazie.\r\nP.s.{{summoner:2}} questa spell si riferisce all&#039;intera mappa o ad un range non troppo distante dalla posizione del campione attuale?","replies":[{"poster":"Dr LouD","date":"2015-09-29T07:25:03.450+0000","up_votes":3,"down_votes":0,"body":"Volente o nolente, non si può cambiare l'atteggiamento di certe persone con una frase in game, quando probabilmente giocando cosi da 500 games.\nPuoi provarci, dire due o tre frasi come \"Stay in team, we have a strong tf\" oppure \"focus on turrets and drake, we got this\" ecc\nMa se vedi che il team non reagisce oppure ti flamma di conseguenza, desisti, mutali, e continua la tua partita.\n\nLa SoloQ è una lama a doppio taglio, capitano i game dove il team è in perfetta sintonia e quelli dove davvero non ci si riesce a coordinare nemmeno per una torre.\n\nSolamente non destabilizzare il tuo equilibrio mentale per altre persone che non rivedrai mai più, its just a game.\n\nGL per il Gold comunque! Vedi che con un pò di impegno ci si arriva facile! :D","replies":[]},{"poster":"iè na vit amàr","date":"2015-09-29T22:21:42.738+0000","up_votes":1,"down_votes":0,"body":"Ragazzi i vostri racconti risolleverebbero il kda di qualsiasi gamer, per questo vi ringrazio.. la chiave è la Pazienza!!! Farò tesoro delle frasi ad effetto e la furbizia nel coinvolgere non troppo personalmente un altro player, ma di cogliere l'attimo per lanciare un commento costruttivo tramite items e obiettivi del gioco. La filastrocca è decisamente la svolta magica per nutrire lo spirito del gamer che c'era in te, troppo bello tutto il seguito, grande!!!! Devo dire che l'uscire e andare a cercare lavoro è la scelta migliore, infatti ora proprio son tornato a casa e ho fatto il primo game della giornata... INDOVINATE!!!? sono stato baciato dal karma: ho strafiddato un game involontariamente, iniziato benissimo con {{champion:119}}  adc. la lane era cominciata ottimamente anche perché finche noi eravam arrivati al 3, la loro vayne è ritornata probabilmente da una disconnessione. La loro Vi, intanto faceva strage top e mid. sono andato mid per risollevare il morale del team che era alle pezze già dall'inizio e gli altri membri hanno guadagnato delle kill, onestamente non sono riuscito a lasthittare per ottenerne anche io qualcuna, e questa pecca mi ha segnato per tutto il game. Ho iniziato a giocare distrattamente per rispondere al nostro Malzar che minacciava di andare afk e nei teamfight gli avversari se al scampavano sempre con poca vita o sbagliato qualche movimento e perdevo tempo prezioso per hittare, tant'è che in qualsiasi posizione mi trovassi per farmare o solo per junglare o per aiutare qualcun'altro che si trovava magicamente in mezzo a 3 ho regalato l'ammontare di una decina di kill, permashottato, giacché il team ha pensato bene di scrivermi di disinstallare League of Legends, che mi avrebbe reportato a fine game qualsiasi cosa sarebbe successa; intanto chiedevo aiuto, ma loro partivano senza di me e andavano a cercare di ingaggiare continuamente il team avversario a casaccio nella loro giungla, e vi dirò, mi stavano carriando. Io non riuscivo comunque a recuperare un risultato perché mi flammavano in continuazione, tant'è che ho iniziato a farmare esclusivamente in giungla, perché non facevo in tempo a capire se nella nebbia ci fosse qualche nemico o no che spuntavano -----> bliz annie vi vayne e Nasus che me le suonavano per bene, ero senza stuff in confronto a tutti e per di più morivo sempre all'ultimo pelo. Se ancora non l'aveste capito rotolava sempre più grossa la valanga di insulti, ma alla fine spilucchiando un po di qua un po' di là ho iniziato a guadagnare qualche kill. Pensavo che ormai il game era risanato, ma mi sbagliavo, è stato il nostro team intero a lasciarsi andare alla giungla avversaria ed iniziare a morire uno alla volta come i mostriciattoli spawnanti da quel portale strano viola che regala un mucchio di difese. \nIn conclusione ho finalmente compreso. qual è la dinamica che ruota attorno al feeder, al flamer e all'afk.\nPer quanto mi riguarda non fiddavo così da tempi immemori, mi sembrava che ogni passo che facessi per guadagnare un minimo d'oro era nella trincea nemica, e il brutto era che loro avevano qualsiasi cc per controllare la mia fuga, di conseguenza, da solo avevo solo il tempo di farmare un po' tornare indietro e accorgermi che qualche avversario si era accampato  nella nostra giungla per farmare su di me e sui miei passi al buio xD\nPrendendo invece in considerazione il flamer, tral'altro era il mid che eravamo saliti ad aiutare un po' tutti. {{champion:90}} lui ad ogni brontolio dello stomaco bestemmiava il team avversario, e appena vedeva che io non riuscivo a concludere niente perché letteralmente il mio team mi aveva messo in QUARANTENA togliendomi la farm da tutte le lanes  (AHAHAHA), è andato afk per un po', convinto che io lo stavo facendo perdere e continuava a togliermi tutte le kill anche quando li inseguivamo con poca vita. è stato bruttissimo sentirsi scartati da tutti. Soprattutto essere stato abbandonato dal support che non avendo compreso bene la dinamica continuava ad ingaggiare sperando che con la mia build inesistente riuscissi a sconfiggere l'adc avversario che s'era caricato di 3 kill altrove xD Infatti poi ha iniziato a giocare dal lato opposto da dove mi trovavo e ( {{champion:412}} ) proseguiva indisturbato il suo game con double kill allucinanti. Mi sentivo trollato addirittura dal support xD Il nostro {{champion:2}} poi si divertiva a vedere come riuscivo faticosissimamente a far calare la vita dell'avversario per dar loro SEMPRE l'ultimo colpo di grazia. Insomma, MARCHIATO come inutile, feeder, noob, reported, uninstaller e messoinquarantena perché non meritavo di banchettare con loro il bottino di squadra. Finendo 2/11/7\nDa oggi finalmente mi sono reso conto di questi errori madornali che tutti possono compiere durante un qualsiasi game a League of Legends, e che flammare e il peggiore dei mali.\nP.s. e dire che il 28 (2 giorni fa) ero riuscito a destreggiarmi egregiamente con {{champion:62}} 12/0/16  ed {{champion:61}} 7/0/11 , mentre il 26, sempre con lei 9/0/18\nIn più penso che questo gioco sia TOTALMENTE inutile per le persone che ci giocano semplicemente per passare il tempo, perché non è definibile un'attività sana e reale xD Di meno potrebbe esserlo per chi nutre il sogno di gareggiare il challenger e magari di guadagnare qualche soldino tra i vari tornei!\n\nOra sto iniziando un'altra duo, ma con mio fratello :P","replies":[{"poster":"iè na vit amàr","date":"2015-09-29T22:58:34.963+0000","up_votes":1,"down_votes":0,"body":"niente, ho provato un altro game, ma vedendo che per 4 combattimenti di seguito tutti loro si salvavano con 1 hp contato ho deciso di disinstallare questo gioco che mi sta trollando alla grande, buona redenzione anche a voi.","replies":[]}]},{"poster":"Sorcio84","date":"2015-09-29T15:56:08.162+0000","up_votes":1,"down_votes":0,"body":"- errori\nmai far presente un errore, mai far pesare il kda, mai dire cose che possono essere palesemente intese come negative\n\n- consigli\nattenzione ai consigli che dai. molti giocatori si sentono pro anche se fanno errori idioti. i consigli funzionano meglio con gli amici piuttosto che con gli sconosciuti.\nper esempio un mio amico giocava con alcune rune di tier2 e gli ho consigliato di prendere quelle tier3 contando che le hanno scontate per sempre.\nSe consigli un item o di prendere ward, sai che è un lancio di moneta tra\npotrebbe prenderla bene\nsi potrebbe incavolazzare\npersonalmente preferisco premere <tab> e dare info sui nemici, così riduco il rischio di toccare un punto sensibile degli alleati.\nesempio : \"morellonomicon or ignite can counter vlad spellvamp\"\n\n- kda\nse hai un kda in positivo è più facile che ti seguano , ma non è mai sicuro.\nse vncete un teamfight parti subito in chat e ping su un obiettivo\ne se riesci spiegando anche perchè\n\" ok we won, take tower and back so they don't recover the kills\"\n\" let minions push the mid tower, we go drake and is 2for1 \"","replies":[]},{"poster":"FuryTheFenix ITA","date":"2015-09-29T08:48:48.015+0000","up_votes":1,"down_votes":0,"body":"Io ero in una lose streak di 13(vedi la mia %di vittorie ranked)e sono volato dal Silver II al quasi silver IV).\nUn giorno,mio cugino si è messo a fare una filastrocca orrenda su Lulù e quindi ho comprato questo campione...\nNiente da dire niente da fare,su 7partite con lei ne ho vinte 6.\nComunque,quando entro in lobby provo a fare \"il simpatico della situazione\" e se in partita qualcuno gioca male,chiedo cortesemente al jungler o a chi disponibile di aiutarlo o al massimo ci vado io,risollevando il morale di quella persona in maniera assurda:per esempio,avevamo un Jayce mid che dopo aver dato il first blood non riusciva a concludere nulla.\nAllora,visto che il mio adc aveva un cervello e ci eravamo iper feedati(io da solo mi facevo l'adc nemico)e riuscivamo a fare 2 vs 3 senza problemi,siamo andati mid e jayce si è ripreso,finendo in 7/1/x .\nO ancora,ci siamo ritrovati con 2top(rengar e zac)e all'inizio si flammavano a vicenda....dopo hanno creato il roaming team ed è stata la fine per la squadra nemica.","replies":[]},{"poster":"Frattaglia","date":"2015-09-29T07:05:48.134+0000","up_votes":1,"down_votes":0,"body":"Eh... Ti posso dire che le lose streak capitano a tutti, ma una cosa che sicuramente ti consiglio di fare è fare una pausa dopo la seconda sconfitta di fila.\nTi fai una normal, un'aram, una partita coi bot o ti guardi un telefilm, ma rimettersi in coda dopo averne perse un po' vuol dire rientrare in partita deconcentrato.\n\nOltre a questo non so che consigli darti, io maino una lane e sono arrivata in gold sempre giocando la stessa; dovrei forse rivedere le tue partite, ma non è che sono molto più esperta di te.\nHai mai provato a fare duo con una persona con cui ti trovi bene?","replies":[]}]}