{"poster":"ShadowAmbushed","date":"2018-03-19T16:48:35.714+0000","title":"Restrizioni mai applicate alla gente che trolla o rimane afk in partite classificate","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Allora, vorrei riportare una cosa molto importante di questo gioco. che a molte persone e altri giocatori da fastidio.\r\nsi parla di partite e matchmaking delle partite ranked, inizio col dire che va bene che si possano trovare persone inesperte e che non sanno giocare ancora bene, contro magari altri che sanno le basi, ma non &egrave; possibile che io mi possa ritrovare con la chat limitata perch&egrave; segnalo che il giocatore avversario cambia lane, e mi ritrovo con l&#039;avversario stra feedato ed io che sono ancora a score 0/0/0. \r\ne oltretutto questa persona ha anche il coraggio di minacciare le altre persone di reportarmi perch&egrave; gli ho detto che ha feedato lui il mio avversario e perch&egrave; si sente insultato da questa cosa, dopo che mi ha insultato per tutto il game, PER TUTTO IL GAME.\r\nCi sono due cose da fare, o applicate delle regole inflessibili a gente del genere, ovvero iniziate ad applicare dei ban anche di una giornata a gente che fa la stupida, almeno nelle partite classificate, o altrimenti continuerete ad avere post del genere, dove i giocatori che cercano di migliorare e giocare per divertirsi si lamentano del sistema di matchmaking, della community di lol e di altre persone che entrano nel gioco solo per sfogarsi violentemente su altri solo perch&egrave; ha delle brutte giornate.\r\nNON RITENGO SIA GIUSTO CHE IO DEBBA MERITARMI DELLE PENALIT&agrave; CHE NON MERITO, OVVERO ESSERE LIMITATO NELLA CHAT ED AVERE ANCHE L&#039;ONORE ABBASSATO A LIVELLO 1 PER COLPA DI UNA PERSONA CHE DICE FALSIT&agrave; SUL MIO CONTO, E LUI SE LA SCAMPA BELLA.\r\nSeconda cosa, non ho potuto nemmeno inviare un ticket alla riot perch&egrave; mi continua a dire, nonostante sia loggato nel sito, che devo accedere per inviare una richiesta di supporto (ticket), Invece di aggiungere nuovi champion, nuovi aspetti, iniziate a sistemare un po&#039; gli errori del sito e del client, visto che fino all&#039;altra notte, all&#039;uscita dei gruppi aperti, non si &egrave; potuto nemmeno creare una stanza.\r\nDato che c&#039;&egrave; gente anche che spende in questo gioco, usate quei soldi per ottimizzarvi non per essere avidi di potere e di soldi, e ascoltate di piu i giocatori che cercano di divertirsi e che cercano di poter cambiare la community di questo gioco super tossico, pieno di gente falsa, di gente che reporta gente che non deve essere reportata e di gente che entra nelle partite classificate e rimane afk per tutto il game, oppure di gente che usa bot per farmare la esperienza.\r\nSpero di riuscire a far ragionare almeno una persona dello staff della Riot e di far capire quanto questo gioco non sia cambiato da quando &egrave; uscita la prima volta, almeno non in fatto di comunit&agrave; della gente, perch&egrave; continuano a fare quello che vogliono","replies":[{"poster":"astenar","date":"2018-03-19T18:50:12.548+0000","up_votes":2,"down_votes":0,"body":"ragionamento:\nsono stato punito ---------> la riot non punisce\nmi manca l'implicazione logica.\ndopo la parte stupida,inizio a fare il serio. la gente viene punita, tu ne sei un esempio, e anche in modo maggiore di quanto venisse punita nei primi anni di vita di lol (praticamente questo è l' unico campo in cui non si può criticare la riot). tu non puoi sapere se la persona da te reportata viene bannata, ti viene inviata un messaggio se la persona da te reportata viene instabannata. \nparliamo del comportamento da avere in partita: a tua detta, hai risposto a colui che ti stava \"minacciando\", insultando? ovviamente lui ha tenuto un comportamento sbagliato, ma tu hai avuto un comportamento altrettanto sbagliato a rispondergli. le persone che sbraitano verso la squadra avversaria sono le prime ad essere bannate, in pratica scrivere report X, è già un buon passo per essere bannati ( che sia vera o falsa l accusa). METTITI bene in testa questa cosa, non si viene bannati per non aver commesso nulla, questo ti sia di risposta al tuo comportamento ma anche al tuo avversario, se ti reportano 9 persone ma tu non hai fatto nulla di male il sistema non ti banna e le persone che hanno reportato a caso verranno screditate dal sistema. non flammare, non rispondere, usa la chat solo a scopo utile per brevi call incoraggiamenti etc. \n\nla parte finale la evito di commentare,","replies":[{"poster":"ShadowAmbushed","date":"2018-03-19T21:34:59.910+0000","up_votes":1,"down_votes":3,"body":"non hai capito nemmeno te il mio discorso","replies":[{"poster":"astenar","date":"2018-03-19T22:35:57.542+0000","up_votes":1,"down_votes":0,"body":"Ok rispiegamelo","replies":[]}]}]},{"poster":"Player A","date":"2018-03-19T18:18:28.656+0000","up_votes":1,"down_votes":0,"body":"Se tu guardassi un po' in giro per il forum, troverai, per fortuna, gente che si lamenta di essere stata permabannata e punita. Inoltre, le condizioni per diventare punibili sono scritte in modo abbastanza chiaro quindi basta rispettarlo e non riceverai nessuna punizione. Qui è pieno di gente che parla di bann ingiusto quando nemmeno hanno dato un'occhiata al regolamento.","replies":[]},{"poster":"Floppyz","date":"2018-03-19T17:14:43.728+0000","up_votes":1,"down_votes":0,"body":"Se sei stato punito evidentemente hai fatto qualcosa di sbagliato. Dovrebbero averti inviato i chat log di alcune delle partite in questione, inutile invece contattare il supporto, che non rimuoverà la punizione in alcun caso.","replies":[{"poster":"ShadowAmbushed","date":"2018-03-19T17:48:47.211+0000","up_votes":1,"down_votes":1,"body":"non hai letto bene la discussione","replies":[]}]},{"poster":"Darkinknight","date":"2018-03-20T08:17:04.316+0000","up_votes":1,"down_votes":1,"body":"Il solito cumulo di stronzate.\nSei stati punito perche hai flammato. Il motivo del perche lo hai fatto non importa,non giustifica,non attenua.\nPer essere stato punito inoltre evidentemente non eri nemmeno ai primi episodi,oppure hai spammato come un maiale in quello.\nSe i report sono dati a caso sono nulli. Non prendi la punizione perche 100 player ti hanno reportato ove non era vero.\nChiarito che la punizione te la sei meritata (no,perche magari credevi davvero di esser nel giusto), passiamo al resto.\nInviare un ticket per cosa? Per segnalare l'altro player? Per lamentarti di quanto la riot sia ingiusta e punisce te?lascia perdere,oltre ad essere inutile faresti anche piu bella figura. Inoltre se non accedi probabilmente è perche non ne sei in grado TU.\nChi crea champ skin ecc ecc ecc non ha nulla a che fare con chi sistema bug e simili.\nPer tutta la serie di vaccate alle fine invece, come vedi tu stesso sei la prova che si vienw puniti. Se hai ancora dei dubbi flamma ancora qualche game ;)","replies":[{"poster":"ShadowAmbushed","date":"2018-04-04T23:04:05.959+0000","up_votes":1,"down_votes":1,"body":"nemmeno te hai capito il senso del mio discorso","replies":[{"poster":"Darkinknight","date":"2018-04-05T07:11:55.999+0000","up_votes":1,"down_votes":1,"body":"Per assurdo qui l'unico a non aver capito il senso del tuo discorso sei proprio tu.\nO beh,i vicini prossimi ban ti sveglieranno","replies":[]}]}]}]}