{"poster":"Don Draven","date":"2016-04-18T16:15:55.417+0000","title":"Se sei forte sali!","subforum":"Discussioni generali","up_votes":6,"down_votes":10,"body":"&egrave; vero,se sei forte sali,a meno che sei sfigato come me.\n\nhttps://imageshack.com/i/pm0OyEvxp\n\nJ4 : https://imageshack.com/i/pnF3OFbJp\nTalon: https://imageshack.com/i/plwnYgRZp\nekko: https://imageshack.com/i/porJSWBQp\nshaco: https://imageshack.com/i/plizbWfap\n\nquella che ho messo con shaco l&#039;ho vinta ma la metto ugualmente per far vedere quanto fosse ridicolo il team,la pi&ugrave; utile &egrave; stata katarina ADC!\n\nNon dico di averle giocate tutte al meglio e di non aver fatto errori! assolutamente! per&ograve; una di quelle potevo vincerla eh!\nforse se ci fosse stato un platino diamond c&#039;&egrave; l&#039;avrebbe fatta ma io sto solo cercando di uscire dalla silver,gi&agrave; ero arrivato nella scorsa season pi&ugrave; di una volta a s1-s2 e non so manco come ho fatto,ma a me dopo giornate del genere mi cade il morale,ci sta una partita o due con situazioni del genere ma quasi ogni volta no!\n\nse vedete nella primissima foto con la lista l&#039;ultima che ho vinto con shaco,sono riuscito a rovinare tutti e far tiltare lucian nemico della quale ho abusato violentemente,ci manca solo che dopo una giornata simile non mi pigliavo la vittoria!eccome!lui tornava in lane in bot,i miei non lo toccavano,nessun problema,lo uccido io,lo dico qui,non mi faccio problemi.\n\nCosa dovevo fare io in quelle partite? non ditemi di usare yi o devourer simili perch&egrave; non mi riescono..puntualmente io vengo scoppiato o comunque non sto dietro a tutto ci&ograve; che bisogna fare..preferisco usare la testa e portare avanti il team rendendo difficile la sconfitta..con shaco riesco a split pushare meravigliosamente far tiltare e ragequittare..\n\nio come mi dovrei sentire dopo una giornata simile?cavolo non dico vincerle tutte ma almeno una!non prendo le partite con naut e annie quando ero supp perch&egrave; non ho fatto un ottimo lavoro quindi non contesto nulla...per&ograve; porco demonio!\n\nva bene perdere la lane,possibilissimo anche io la perdo ed è giusto funziona così,ma se muori 10 volte e passa significa che non hai voglia di giocare e cazzeggi a danni altrui,l'alternativa è che siamo in un periodo di boost pesante e si trovano in lane tutti i super smurf che li spaccano,ma veri smurf!mica l'amico gold platino...\n\nCavolo qualche settimana fa ho avuto una premade afk di 2 non potevano venire anche in quei game?! sarebbe stato pi&ugrave; facile!\n {{sticker:zombie-brand-facepalm}}\n\n\nWOOOPSSS http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/2620025810/202979075?tab=builds\n\nin quella con ekko non avevo neanche le quints,cioè ridicolo xD,dovevo essere l'unico a fare schifo!","replies":[{"poster":"Harkrade","date":"2016-04-18T17:04:30.419+0000","up_votes":7,"down_votes":1,"body":"Se sei forte sali, è la verità ed è innegabile. Semplicemente se sei di un livello parecchio più alto, sali facilmente ed in poco tempo; se invece non sei molto più bravo del livello in cui ti trovi salirai comunque ma in un tempo più dilazionato!\n\nE, in ogni caso, non essere così sicuro di avere più capacità degli altri. Avere un buono score comporta poter decidere le sorti della partita, ergo, chiediti cosa potevi fare per vincere: gankare una lane in difficoltà, prendere un obbiettivo o semplicemente cercare di guidare i tuoi compagni.\n\nProva a non dare la colpa a loro perchè loro sbagliano ma tu non puoi cambiarli e non essendo un challenger farai molti errori! Parti da quelli, migliora le tue meccaniche e salirai! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Don Draven","date":"2016-04-18T17:36:10.308+0000","up_votes":2,"down_votes":1,"body":"Ma guarda vorrei poter sentire i tuoi consigli ma sembra che tu mi stia prendendo in giro,hai esperienza come jungler?non direi...se ganki un laner con troppe kill o comunque troppo più avanti del tuo laner crepate in due,gankalo un renekton bravo con 2-3 kill di vantaggio.\n\nse quindi non hai solide occasioni puoi solo sperare che i laner sbagliano (accade meno spesso di quanto tu creda sir gold)\n\nd'altro canto tu stesso adesso mi stai dicendo che è come dici,nonostante sei gold 3 (sono andato a vedere lo ammetto),quindi tu stesso stai dichiarando di avere più capacità di me...\n\nse io puntualmente outfarmo il jungler nemico,lo invado,lo counterganko (raro in silver eh?forse anche in gold..) e puntualmente in quasi tutti i game sono superiore al jung avversario è chiaro che qualcosa non quadra,poi magari potrei migliorare sul fatto di far andare i laner diversamente,ma sta il fatto che se le tue 3 lane perdono magari un jungler diamond può gestire la cosa e vincere,ma io no! non trovo il tempo,in più neppure mi va di gankare una lane con 1-2 liv in meno,un diamond invece sa considerare certe cose,ha un tempo migliore a fare le scelte,questo è,ma io devo arrivare in gold non ho certo la skill di un diamond,manco lontanamente.","replies":[{"poster":"Harkrade","date":"2016-04-18T18:22:13.347+0000","up_votes":2,"down_votes":0,"body":"Ed è appunto quello che intendo! In realtà ho qualche esperienza da jungler ma vale per ogni ruolo. Ti sto solo che devi capire cosa sbagli e perchè (un diamond è tale semplicemente perchè commette meno errori di te). Più riuscirai a capire i tuoi errori e più salirai, l'importante è che tu stia sereno e non tilti, pensa a te stesso. :)","replies":[{"poster":"Don Draven","date":"2016-04-18T18:38:53.849+0000","up_votes":1,"down_votes":1,"body":"ma un diamond non commettendo errori fa 1 2 3 4 5 6 7 8 kill tutte in fila nei primi 20 e vince da solo,io non commettendo errori possio giocare una buona partita,cosa che faccio spesso,posso prendere le 7 kill ma non in 20 min,come ho fatto con jarvan,li io ero qualcosa, shottavo il graves feddato,ma il mio team non mi credeva,dicevano che ormai era andato quel game e manco ci hanno provato concretamente  nell'ultimo fight,ho shottato graves ignorando janna e intanto mi hanno gradato crepare...","replies":[]}]},{"poster":"Darkinknight","date":"2016-04-18T19:57:02.202+0000","up_votes":1,"down_votes":0,"body":"Se tu giochi jng e sei superiore al jng avversario,ma le tue lane sono inferiori alle lane avversarie, senza cattiveria ma hai sbagliato qualcosa..","replies":[]}]}]},{"poster":"Dreadful Force","date":"2016-04-23T15:56:03.965+0000","up_votes":2,"down_votes":0,"body":"ragas non confondete il se sei forte sali, con il se sei gold sali easy il silver.\npersino canelupo ha detto che se sei forte sali è una cazzata, lui è diamond e sale, grazie è diamond se gioca contro i silver sale easy, cazzo è normale, ma se sei gold e magari un pelo piu del gold e vuoi salire il silver è l'inferno, tutti e due i team non sanno che cazzo stanno facendo e perdi ogni singolo game perche uno del tuo pensa di essere pro e si suicida 1v5.\nquindi se sei forte sali è una boiata, perche se sei esageratamente piu forte sali è corretto, ma che cazzo paragoniamo i challenger a i bronzi è ovvio che i challenger sono challenger e i bronzi sono bronzi, se metti un challenger in bronzo sale, se metti un silver in bronzo non sale perche è piu forte dei bronzi, sale perche ha il culo di trovare gente che per lo meno non trolla o va afk","replies":[{"poster":"Frattaglia","date":"2016-04-23T18:47:10.181+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dreadful Force,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=0008,timestamp=2016-04-23T15:56:03.965+0000)\n>\n> ragas non confondete il se sei forte sali, con il se sei gold sali easy il silver.\n> persino canelupo ha detto che se sei forte sali è una cazzata, lui è diamond e sale, grazie è diamond se gioca contro i silver sale easy, cazzo è normale, ma se sei gold e magari un pelo piu del gold e vuoi salire il silver è l&#x27;inferno, tutti e due i team non sanno che cazzo stanno facendo e perdi ogni singolo game perche uno del tuo pensa di essere pro e si suicida 1v5.\n> quindi se sei forte sali è una boiata, perche se sei esageratamente piu forte sali è corretto, ma che cazzo paragoniamo i challenger a i bronzi è ovvio che i challenger sono challenger e i bronzi sono bronzi, se metti un challenger in bronzo sale, se metti un silver in bronzo non sale perche è piu forte dei bronzi, sale perche ha il culo di trovare gente che per lo meno non trolla o va afk\n\nBah, è solo palloso perché ti richiede più partite per salire che se fossi diamante. Ma certo non ci resti bloccato, l'errore è quello. Magari per 30 partite non ti smuovi, ma se dopo 200 partite sei ancora lì, sicuro non vali da una lega superiore.","replies":[]}]},{"poster":"Hell88","date":"2016-04-18T16:52:28.729+0000","up_votes":2,"down_votes":5,"body":"se hai culo sali questa è la verità ...a meno che tu non sia un challanger con un champ che carria e stia facendo uno smurf in bronzo.","replies":[{"poster":"Dr LouD","date":"2016-04-18T17:27:25.051+0000","up_votes":4,"down_votes":1,"body":"Ma se si sale per culo, anche i challenger ci sono arrivati li per culo, quindi se si mettono a smurfare in bronzo risalgono solo per culo, giusto?\n\nNo perchè se ammetti che un player di alto elo smurfando ritorna in alto elo per bravura allora non vuol dire che se hai culo sali, perche anche al suo tempo quel giocatore è passato dagli elo bassi prima di diventare forte\n\nGiusto?","replies":[{"poster":"Don Draven","date":"2016-04-18T17:41:51.757+0000","up_votes":1,"down_votes":1,"body":"ma è quello il punto,uno smurf diamond basso,arriva tranquillamente in platino,poi però circa gold alto già vedi che non la prende alla leggera come in silver bronzo (che poi tra i due secondo me è meglio in bronzo).\n\nil cane stesso ha detto di aver portato 3 account in diamond e non sa manco lui come ha fatto che batte la testa contro il muro a gold 3 (pur salendo ma si incazza)\n\nio sono non altro che un silver,non mi va di dire che sono da gold o silver alto,però dico che in silver alto ci sono arrivato spesso sfiorando la gold.\n\nil punto e che di esperienza ne ho un botto,sarò quasi alle 2k ranked (fidati che le ho) s4-s5-s6\n\ne infatti lo vedo,talvolta vinco in lane,in jungla vinco quasi sempre,ma che iella!sono uno che non è aiutato dalla reazione umana,dai un vantaggio di la e lo buttano di la,vai a sistemare le cose la e lo ributta di la,intanto la bot che si incazza,se c'è una cosa che mi fa veramente battere il pugno sulla scrivania è la gente che inizia a parlar male del tuo lavoro in jungla quando loro stessi perdono la propria lane,cioe dovresti sentirti una merda e chiedere cortesemente aiuto altrochè! mica vojo e quindi merito da idiota.","replies":[{"poster":"Dr LouD","date":"2016-04-18T19:29:17.130+0000","up_votes":2,"down_votes":2,"body":"Mi dispiace, ma già che hai nominato il \"cane\" come esempio mi fa perdere la voglia di discutere, soz","replies":[{"poster":"Don Draven","date":"2016-04-18T20:27:28.304+0000","up_votes":1,"down_votes":1,"body":"io ho visto casualmente un suo stream su twt e ha detto quello,se poi perdi voglia di parlare con me perchè ho citato un high elo player ok...","replies":[{"poster":"kernel panic","date":"2016-04-20T06:06:44.348+0000","up_votes":2,"down_votes":0,"body":"Cane ed high elo non si possono leggere nella stessa frase :D","replies":[{"poster":"Don Draven","date":"2016-04-20T13:44:43.092+0000","up_votes":2,"down_votes":0,"body":"beh fattene una ragione http://www.lolking.net/summoner/euw/29224770","replies":[]}]},{"poster":"Frattaglia","date":"2016-04-19T07:23:44.431+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=00000000000000000000,timestamp=2016-04-18T20:27:28.304+0000)\n>\n> io ho visto casualmente un suo stream su twt e ha detto quello,se poi perdi voglia di parlare con me perchè ho citato un high elo player ok...\n\nSi ma ci sale uguale, da gold 3, come hai detto anche tu stesso.\n\nÈ anche normale che man mano che ti avvicini al tuo elo la percentuale di vittorie si abbassa. Io in bronzo avevo/potrei avere un win rate dell'85%, in silver del 65%, in gold potrei arrivare al 50-55% (non so di preciso perché è un mesetto che non ranko, sono certa che se mi ci mettessi arriverei in platino spammando i miei due champ).\n\nUn diamante potrebbe avere un win rate del 90-95% in bronzo, dell'85-90% in silver, del 70% in gold, etc etc.","replies":[{"poster":"Don Draven","date":"2016-04-19T13:34:15.448+0000","up_votes":1,"down_votes":0,"body":"vedi che però una win rate del 65 so che è tanta ma io con shaco ho 66 +- quindi,già qualcosa del tuo discorso non mi arriva,tu potresti persino arrivare in platino dici...perciò perche io non potrei tornare a silver alto?","replies":[{"poster":"Frattaglia","date":"2016-04-19T14:02:08.039+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=0000000000000000000000000000,timestamp=2016-04-19T13:34:15.448+0000)\n>\n> vedi che però una win rate del 65 so che è tanta ma io con shaco ho 66 +- quindi,già qualcosa del tuo discorso non mi arriva,tu potresti persino arrivare in platino dici...perciò perche io non potrei tornare a silver alto?\n\nSe hai veramente il 66% continua a giocare dato che vinci più partite di quante ne perdi. Se noti non ho detto nulla riguardo al tempo che ci potrei mettere per arrivarci... inutile far troppe lamentele, si sale solo giocando. ^^\n\n\np.s. per shaco per rallentare puoi usare anche l'exaust, senza contare che per le gank dovresti sempre cercare di piazzare la bambolina dietro al nemico...","replies":[{"poster":"Don Draven","date":"2016-04-19T14:05:57.513+0000","up_votes":1,"down_votes":0,"body":"vero,se controlli è così,non me lo invento,ma purtroppo il lavoro che faccio con shaco a volte lo rovino io perchè magari sbaglio e perdo qualche partita o perchè comunque la gente e qui confesso che mi sto innervosendo solo a scriverlo...prova un odio comune per shaco,sia con che contro,se è con non ti danno un minimo di fiducia,esigono gank entro i 5 minuti e ti danno dell'inutile in fight (poi quando killi sia l'apc che l'adc in 3 colpi stanno zitti si intende),perciò a volte me lo bannano pure pur di non farmelo pickare,ovviamente non sempre a ogni game chiaro ma succede,altre volte addirittura cercano di mettermi i bastoni fra le ruote,proprio per l'atteggiamento bambino del (piuttosto perdiamo in 2 che darti ragione) fidati che non me la sto campando in aria sta storia...","replies":[{"poster":"Frattaglia","date":"2016-04-19T14:14:07.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=000000000000000000000000000000000000,timestamp=2016-04-19T14:05:57.513+0000)\n>\n> vero,se controlli è così,non me lo invento,ma purtroppo il lavoro che faccio con shaco a volte lo rovino io perchè magari sbaglio e perdo qualche partita o perchè comunque la gente e qui confesso che mi sto innervosendo solo a scriverlo...prova un odio comune per shaco,sia con che contro,se è con non ti danno un minimo di fiducia,esigono gank entro i 5 minuti e ti danno dell&#x27;inutile in fight (poi quando killi sia l&#x27;apc che l&#x27;adc in 3 colpi stanno zitti si intende),perciò a volte me lo bannano pure pur di non farmelo pickare,ovviamente non sempre a ogni game chiaro ma succede,altre volte addirittura cercano di mettermi i bastoni fra le ruote,proprio per l&#x27;atteggiamento bambino del (piuttosto perdiamo in 2 che darti ragione) fidati che non me la sto campando in aria sta storia...\n\nPurtroppo su Shaco sono d'accordo col pregiudizio comune, ho perso troppe partite per colpa dello Shaco del mio ragazzo xD\n\nScherzi a parte, Shaco come anche altri campioni tipo Lee Sin, ha dei grossi punti di forza e dei grossi limiti. Se sai già quali sono quei limiti sai anche come giocare per evitare di trovarti nelle situazioni in cui Shaco non funziona bene. Però è quello il motivo per cui alcuni campioni non sono apprezzati; tutt'al più se qualcuno ti rompe in champion select tu copia il link del tuo profilo per mostrare che con Shaco te la cavi.","replies":[{"poster":"Don Draven","date":"2016-04-19T15:00:40.963+0000","up_votes":1,"down_votes":0,"body":"che limiti ha uno shaco,è invisibile,è ovunque,ha un ulti che lo rende imbersagliabile per mezzo secondo e io riesco a usarla bene quindi credo possa chiunque,la sua Q è uno stealth e anche un dash,la marionetta è una fear e fa anche danni assurdi e la sua E avvelena passivamente e all'uso avvelena e slowa,la sua passiva gli permette di fare il 20% di danno in più alle spalle e questo pagliaccio si può sdoppiare ed è quasi come fosse un altro champ che pusha,ti fai le intere lane di torri in 2 back,secondo me di limiti sto campione ne ha pochi,poi se sei una di parte allora non mi va di perdere tempo.","replies":[{"poster":"Frattaglia","date":"2016-04-19T15:05:48.269+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=00000000000000000000000000000000000000000000,timestamp=2016-04-19T15:00:40.963+0000)\n>\n> che limiti ha uno shaco,è invisibile,è ovunque,ha un ulti che lo rende imbersagliabile per mezzo secondo e io riesco a usarla bene quindi credo possa chiunque,la sua Q è uno stealth e anche un dash,la marionetta è una fear e fa anche danni assurdi e la sua E avvelena passivamente e all&#x27;uso avvelena e slowa,la sua passiva gli permette di fare il 20% di danno in più alle spalle e questo pagliaccio si può sdoppiare ed è quasi come fosse un altro champ che pusha,ti fai le intere lane di torri in 2 back,secondo me di limiti sto campione ne ha pochi,poi se sei una di parte allora non mi va di perdere tempo.\n\nNei teamfight è molto meno utile di altri jungler, se resta indietro è molto più inutile rispetto ad altri jungler etc. Tutti i campioni hanno dei punti di forza e dei difetti, sapere quali sono è già un buon punto di partenza.","replies":[{"poster":"Don Draven","date":"2016-04-19T15:08:15.485+0000","up_votes":1,"down_votes":0,"body":"Ma perchè insistete,rengar è utile in fight?ovvio,shotta l'adc,stessa cosa shaco,rengar usa le prime 5 per la Q e ne farà un'altra ma di regola lo shotta già con la prima,shaco gli va dietro e fa lo stesso identico lavoro,la differenza è che shaco ci scappa,rengar o picchia tutti o crepa...","replies":[{"poster":"Dr LouD","date":"2016-04-19T15:14:54.666+0000","up_votes":2,"down_votes":1,"body":"Frattaglia non sta dicendo che sono inutili in totale, ma che non sono utili quanto altri campioni nei teamfight.\n\nCerto, Shaco e Rengar sono assassini che uccidono comparendo dal nulla, ma questa meccanica da il meglio di se quando il bersaglio è isolato.\nIn teamfight questa tecnica inizia ad essere poco efficace in quanto il team sarà gruppato, e uccidere un carry diventerà molto più difficile in queste condizioni.","replies":[]},{"poster":"Don Draven","date":"2016-04-19T17:40:26.022+0000","up_votes":1,"down_votes":0,"body":"io ho il 100% di win rate su una decina di partite con volibear..ma mi secco,non posso giocare un champ solo perchè mi porta a vincere,dal mio punto di vista,manco ci arrivo al gold che mi impicco...","replies":[]},{"poster":"Frattaglia","date":"2016-04-19T16:57:19.208+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=00000000000000000000000000000000000000000000000000000005,timestamp=2016-04-19T16:02:09.436+0000)\n>\n> so cos&#x27;è il meta,non mi hai detto qual&#x27;è adesso.\n\nA spanne, direi questi\n[http://champion.gg/statistics/#?sortBy=general.winPercent&order=descend&roleSort=Jungle](http://champion.gg/statistics/#?sortBy=general.winPercent&order=descend&roleSort=Jungle)\n\np.s. comunque fregatene del meta eh... fino a diamante alto conta di più e sai giocare il tuo campione rispetto a chi è forte in quella patch","replies":[]},{"poster":"Don Draven","date":"2016-04-19T16:02:09.436+0000","up_votes":1,"down_votes":0,"body":"so cos'è il meta,non mi hai detto qual'è adesso.","replies":[]},{"poster":"Frattaglia","date":"2016-04-19T15:47:51.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=00000000000000000000000000000000000000000000000000000003,timestamp=2016-04-19T15:22:28.922+0000)\n>\n> qual&#x27;è il meta?\n\nPuoi definire il meta come \"quello che va di moda\". \nA ogni patch alcuni campioni o oggetti vengono buffati o nerfati, diventando più o meno forti, e magari cambiando lo stile di gioco o la build di alcuni campioni (ad esempio vedi gli Ekko e le Akali che sono improvvisamente diventati tank). Alcuni campioni possono ricevere un buff anche solo semplicemente perché il loro counter viene nerfato. Altri campioni diventano molto giocati perché ad esempio c'è un qualche koreano che ha portato agli LCS una build diversa ed è diventato improvvisamente forte. \nEcco, rengar come anche shaco al momento sono poco giocati poichè al momento ci sono campioni più forti. Poi ci sono le persone a cui piacciono uguale e che li giocano uguale però, siccome di solito alla gente piace vincere e siccome molti sono dei pecoroni che giocano quello che vedono giocato agli LCS, di solito scelgono campioni che in quel periodo e in quella patch se la cavano meglio. Tutto là.","replies":[]},{"poster":"Don Draven","date":"2016-04-19T15:22:28.922+0000","up_votes":1,"down_votes":0,"body":"qual'è il meta?","replies":[]},{"poster":"Don Draven","date":"2016-04-19T15:21:24.396+0000","up_votes":1,"down_votes":0,"body":"non ti seguo,io piglio il mio vantaggio..in fight tutti gruppati dal muro dei pappagalli o lupi,dipende dal lato o comunque situazioni.. premi Q.cammino in mezzo a loro,vado alle spalle del lucky guy e \"wtf\".\n\nho capito che sejuani e amumu bloccano un intero team,li ho usati,sejuani ci sta assaissimo,amumu invece non lo tocco manco più early troppo troppo debole,viene uno xin o un udyr e devono solo prenderti di  attacchi base.\n\nsejuani invece non la picko perchè mi sono accorto che comunque lo splitpush è un arma mostruosa con un champ che abbia qualche danno AD.","replies":[]},{"poster":"Frattaglia","date":"2016-04-19T15:14:25.063+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warevoker,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=0000000000000000000000000000000000000000000000000000,timestamp=2016-04-19T15:08:15.485+0000)\n>\n> Ma perchè insistete,rengar è utile in fight?ovvio,shotta l&#x27;adc,stessa cosa shaco,rengar usa le prime 5 per la Q e ne farà un&#x27;altra ma di regola lo shotta già con la prima,shaco gli va dietro e fa lo stesso identico lavoro,la differenza è che shaco ci scappa,rengar o picchia tutti o crepa...\n\nInfatti non pensavo di paragonarlo a un altro assassino (che tra l'altro al momento è fuori meta), pensavo più a gente tipo Amumu o Sejuani che hanno stili di gioco totalmente diversi.\nAmumu è un jungler con dei punti di forza e punti di debolezza ben diversi da Shaco, è debole early e fortissimo in late e permette alla squadra di avere uno stile di gioco diverso, meno incentrato sullo splitpushing e più sui teamfight.\n\n**Non sto dicendo che Shaco fa schifo, eh. Sto dicendo che ha uno stile di gioco particolare, che necessita di essere giocato in un determinato modo e che, come ogni campione, ha dei grossi punti di forza e dei grossi difetti.**\n\nPoi a me personalmente non piace perché averlo in squadra mi costringe a giocare in un modo che a me non piace, ma quello è solo mio gusto personale.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Dr LouD","date":"2016-04-19T07:59:23.809+0000","up_votes":2,"down_votes":2,"body":"Io sinceramente mi soffermerei a guardare i MIEI errori prima di andare ad accusare i compagni per ogni sconfitta.\n\nAnalizziamo il tuo profilo.\n\n - La prima cosa che balza all'occhio è il kda medio: \nMuori tanto, anche troppo per chi si sente che deve carriare. Da morto non si fanno kill, non si prendono obiettivi, non si fa nulla. Cerca di pensare di più a quello che fai in game per non fare azioni troppo avventate che ti possono portare alla morte\n\nTip: da jungler, per evitare di morire a causa di azioni avventate, ti suggerisco di tenere costantemente wardata la jungla nemica per tenere sotto controllo i movimenti del jungler nemico\n\n- Il farm:\nFarmi veramente poco, sia da jungler che da laner. Il farm è la prima fonte di gold, molto più importante delle kill. In lane sembra scontato saper farmare, ma spesso e volentieri i jungler mettono questa cosa in secondo piano. Cosa assolutamente sbagliata, i mob della jungle conferiscono tantissimi gold, lasciarli li a riposare è un grave errore.\n\nTip: quando non sei impegnato in gank, presa obiettivi ecc, farma, SEMPRE\n\nSei Silver 5, già con questi due accorgimenti vedrai che salire da quest'elo sarà uno scherzo, basta solo impegnarsi un pochettino di più e smetterla di stare a guardare ogni singolo errore degli altri, che tanto alla fine non potrai cambiarli, quello che può cambiare sei tu","replies":[{"poster":"Don Draven","date":"2016-04-19T13:30:21.942+0000","up_votes":1,"down_votes":0,"body":"ah meno male non facevi prima a dirmi questo risparmiandomi la ramanzina da high elo??\n\nriconosco in effetti che,dopo essermi calmato un attimo mi ero accorto di ste cose..apparte in quella con j4 che almeno sono morto 3 volte,o meglio,la 3 l'ho sostanzialmente regalata a fine game nel tentativo di difendere il nexus,comunque.\n\nio cerco di pulire i campi più che posso...soprattutto lupi e pappagalli che in genere sono i più vicini,è vero comunque che mi sembra veramente dura stare in linea coi livelli gold exp dai campi di jungla oltre ad aiutare gli alleati,invadere e counterjunglare,però non credi che questo conti più sul jungler che usi?uno shaco o j4 non starà mai dietro a una shyvana o un udyr in teoria.\n\nper il morire lo so,è che in genere muoio soprattutto perchè aiuto gli alleati in azioni rocambolesche,poi quando vedo le mie deaths rovinate sembra quasi che inizi a ignorare il fatto che muoia,è sbagliato lo so,cercherò di evitare ulteriori morti il più possibile,vediamo un po che succede,in genere quando crepo poco mi accorgo di avere quel livello in più.\n\npiù che altro sono altre le situazioni che mi spiazzano,tipo mi invadono,io mi salvo perchè probabilmente me l'aspettavo ma,intanto che quello si piglia il mio farm?io pensavo di fregare il suo a mia volta ma non sempre è possibile,questo mi tiene indietro per tutto il game.\n\ndovrei buildare la sightstone?io mi trovavo benissimo con le ward verdi,veramente era una malattia,la gente mi diceva di comprarne di meno,almeno 2 le prendevo e le mettevo in jungla nemica,ora però mannaia le hanno tolte e solo con la pink mi trovo da culo!il trinket giallo dura appena 1 minuto assurdo!\n\nVedi che comunque io pensavo di fare altri  errori importanti ma a questi due posso rimediare facilmente,questa tua puntualizzazione mi aiuterà,grazie.","replies":[{"poster":"Dr LouD","date":"2016-04-19T13:48:45.926+0000","up_votes":1,"down_votes":1,"body":"La mia ramanzina non era riferita all'high elo, ma al modus operandi di quello youtuber, a mio avviso molto \"discutibile\"\nTLDR un flammone tossico\n\nTi ricordo che esiste uno smite {{item:3711}} fatto apposta per wardare, che si ricarica ogni volta che torni in base\n\nPer il farm, è ovvio che se sei un Lee Sin o uno Shaco non puoi rimanere al passo di una Shyvana o un Udyr, ma è altrettanto vero che champion come questi non devono solo gankare e basta, perchè altrimenti rimangono indietro di livelli e gold.\nRipeto, non ti sto dicendo di afk farmare, ma dopo una gank, aiuti a pushare il tuo alleato e magari prendi la torre, e se poi non hai nulla da fare, torna a farmare, evita momenti morti nel tuo gameplay, ogni momento deve essere impegnato nel fare qualcosa.\n\nNon rimanere a gironzolare nel fiume per un minuto pensando a cosa fare, puoi farlo anche mentre ti farmi 1-2 campi\n\nPer il counterjungle, la cosa principale è tenere traccia della posizione del jungler nemico.\nHa appena gankato la top lane e tu sei bot? Se non hai possibilità di gankare o di gruppare per il drago, hai tutta la jungle botside nemica da farmare, approfitta di questo momento (se ganka top, tranne che non ha abilità tipo Pantheon o Reksai, non tornerà bot per almeno 30 secondi) e rubagli exp e gold, in più a mettere visione con le ward","replies":[{"poster":"Don Draven","date":"2016-04-19T14:01:04.976+0000","up_votes":1,"down_votes":0,"body":"vero,quello lo faccio su lee,ma una la tengo per un wardjump di fuga,invece,non sempre posso farla su tutti i champ,cioe anche il blu e quello rosso fanno gola o meglio\n\nse uso shaco ok che ha la E per rallentare ma insomma,un blue smite aiuta,invece con lee sin che ha tutto la faccio,anche se quest'ultimo preferisco non pickarlo,rischio di failare e comunque se faccio feddare gli alleati non è detto che potrò stare sereno,perciò.\n\nquindi appunto,anche decidessi di rinunciare su molti jungler agli smite blu rossi (ne sono scettico) farei ugualmente fatica con appena 2 wards, o meglio,una dal red nemico,una dal blue,la pink uso metterla nel bush poco prima dal drake perchè in genere l'herald non lo cagano o comunque cagano di più il drago e il mid tende a rommare bot...\n\nfarei male a prendere una sightstone come jungler secondo te?ok sono 800 gold ma ti da vita e 3 wards.","replies":[{"poster":"Dr LouD","date":"2016-04-19T14:04:43.647+0000","up_votes":2,"down_votes":0,"body":"MA io non ti sto dicendo di tenere 1000 ward nella jungle nemica\n\nConsidera che il numero max di ward piazzabili contemporaneamente è 3+1(pink), quindi anche solo il trinket giallo (piu la pink, SEMPRE) può essere utile.\n\nPerò considera che da jungler è utilissimo anche il triket rosso per pulire le ward, quindi diciamo che la coppia migliore per tenere alta visione è {{item:3711}} {{item:3364}} \n\nPoi puoi decidere se tenerne anche solo uno, dipende da te","replies":[{"poster":"Don Draven","date":"2016-04-19T14:26:16.614+0000","up_votes":1,"down_votes":0,"body":"il rosso c'è l'ho sempre..comunque è impossibile che tu possa mettere 3 ward col coso,una ward dura 3 minuti circa mi sembra,te ne piazzi 2..per poter piazzarne 3 devi andare back entro 3 min?","replies":[{"poster":"Dr LouD","date":"2016-04-19T14:42:26.860+0000","up_votes":1,"down_votes":0,"body":"Le ward che hai con il triket giallo o con lo smite verde + la pink sono sufficienti se sai dove piazzarle, la sightstone imho non è worth in soloQ, 800g sono tanti e possono essere investiti meglio","replies":[{"poster":"Don Draven","date":"2016-04-19T15:02:56.779+0000","up_votes":1,"down_votes":0,"body":"ma se ho la Lens rossa come faccio ad avere il trinket giallo? {{item:3341}}  sempre strausata perchè la butto sul bush,li può esserci quello che vuole tanto tutte le ward vengono accecate quindi passo indisturbato...si se posso le distruggo ma intanto ganko furtivamente ò.ò","replies":[{"poster":"Dr LouD","date":"2016-04-19T15:10:13.232+0000","up_votes":2,"down_votes":1,"body":"Se scegli il trinket rosso sei obbligato a prendere lo smite verde se vuoi mettere anche visione, con una sola pink per volta fai poco\n\nO puoi anche ovviamente comprare la sightstone, a patto che sai gestire il rallentamento che la tua build subisce","replies":[{"poster":"kernel panic","date":"2016-04-20T06:11:47.227+0000","up_votes":1,"down_votes":0,"body":"Però sta cosa del trinket rosso ---> smite verde obbligato non esiste proprio :D\n\nTroppi jungler beneficiano dallo smite blu o rosso.\n\nLa vision puoi darla anche al contrario, utilizzando il trinket rosso per toglierla ai nemici.\n\nAltrimenti, ti immagini giocare kindred, shyvana o altri senza lo smite rosso giusto perchè ti serve quello verde per wardare?","replies":[{"poster":"Dr LouD","date":"2016-04-20T07:05:57.945+0000","up_votes":2,"down_votes":1,"body":"Infatti se leggi bene ho scritto: puoi anche decidere se tenerne uno solo, dipende da te\n\nLui mi ha chiesto come si fa a ottenere la massima visione da jungler, e gli ho risposto di conseguenza","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Bramby93","date":"2016-04-19T07:14:08.448+0000","up_votes":2,"down_votes":1,"body":"Mi spiace dirtelo ma qui non si tratta di essere sfortunati (come dici tu), giochi da 3 season, hai 504 partite ranked giocate e sei bloccato in silver 5, la prima cosa che mi è saltata all'occhio guardando il tuo profilo, ad esempio le partite con shaco, è che fai SEMPRE la stessa build, identica. A mio modesto parere dovresti iniziare a buildarti in base ai nemici che hai contro, in estremis a testare nelle normal nuovi oggetti. Lo stesso discorso vale per le maestrie, le hai quasi tutte col thunderlord; contro alcuni nemici è meglio avere frenesia del duello o il tocco bruciante. Idem le rune, se ti serve un early più forte è inutile mettere rune che scalano con i livelli (sia CDR che difesa magica etc.). Spero di esserti stato d'aiuto.\n\nCordiali Saluti\n\nBramby","replies":[{"poster":"Don Draven","date":"2016-04-19T13:18:01.471+0000","up_votes":2,"down_votes":1,"body":"no il fatto è che ho molto più di qua e di la ma giustamente,se tu vedi su questo profilo non puoi saperlo,non so se posso fartelo sapere così in pubblico a vista di tutti (niente di illegale o che vada contro il regolamento ma semplicemente mi da fastidio dirlo) ma fidati che ho più partite e esperienza di quanto sembra,se poi non ci credi pazienza.\n\nlo terrò in mente ma vedi che se lo faccio è perchè a) quelle cose le prendo da gente capace e più brava di me,la build di shaco chiaramente è sempre quella perchè con quei 2 item l'adc/apc che si builda a sua volta sempre uguale implode,se vedi dopo tende a cambiare,difatti con shaco ho un winrate del 66% quindi immagino che quello che faccio sia giusto,il 66% di un 65w 33l qualcosa del genere,perciò-\n\nle rune invece prevalentemente prese da shaclone e agua,alcune fatte da me ma sempre sulla loro linea..\n\ndovresti dirmi dove il Fervor o il death touch credo siano questi che dici tu,perchè non mi sembrano molto meglio sulla maggior parte dei champ che uso,nè tantomeno al mio playstyle,cioè,il fervore da quando lo hanno nerfato non lo uso perchè in un trade dover dare tot atk per usarlo mi sembra troppo,preferisco cose che mi diano tutto e subito.","replies":[{"poster":"Dr LouD","date":"2016-04-19T13:56:34.401+0000","up_votes":2,"down_votes":0,"body":">no il fatto è che ho molto più di qua e di la ma giustamente,se tu vedi su questo profilo non puoi saperlo,non so se posso fartelo sapere così in pubblico a vista di tutti ma fidati che ho più partite e esperienza di quanto sembra,se poi non ci credi pazienza.\n\nQuello che intende è l'esatto opposto di quello che stai pensando.\n\nTi sta dicendo che 3 season di gioco e 2k di partite giocate sono TANTE per essere ancora bloccato in elo basso per colpa della sfortuna, di solito con questo numero di partite e tempo giocato si è già abbastanza proiettati verso l'alto.\n\nQuello che sta cercando di dirti è che hai giocato davvero tanto e comunque sei ancora abbastanza in basso, quindi non è una questione di \"sfortuna\", dato che magari la sfortuna conta nel breve periodo, ma va totalmente scemando nel lungo periodo","replies":[]}]}]},{"poster":"DuckQuack0","date":"2016-04-18T17:41:25.747+0000","up_votes":3,"down_votes":1,"body":"Pensa che a me mi avevano piazzato in Bronzo 2, già ero tipo \"oh cazz e quando esco più...\", ora sono gold 2 xD\n\nTi auguro la meglio fortuna, per quanto riguarda me sono sfortunato con l'hextech, 4 forzieri e 0 frammenti... RIP Hexduck.\n\nIl silver per me è quell'elo che va a culo, puoi trovare persone meglio dei platini e persone peggio dei bronzi. ","replies":[]},{"poster":"anagoor","date":"2016-04-18T18:18:43.825+0000","up_votes":1,"down_votes":0,"body":"il culo serve di sicuro ma alla lunga se sei forte sali, in questa season ho incominciato da silver 3 e ne sono uscito dal silver in qualche settimana, avevo un win rate superiore all'80% nonostante delle partite di qualificazione ne persi 4 per afkers, non bisogna essere challenger per salire, già un gold in silver ci rimane poco se gioca da gold, e questo è valso solo per me, **quasi tutti coloro** che erano gold e si sono ritrovati in silver sono saliti senza problemi in gold.\nLa verità è che le persone sono sempre le più forti, tutti sono challengiur dentro ma perdono a causa degli altri, una scusa che varrà sempre e per qualsiasi cosa.","replies":[]},{"poster":"Xehanört","date":"2016-04-18T17:12:38.103+0000","up_votes":1,"down_votes":1,"body":"Purtroppo la gente non considera che in Season 6, se sei forte non sali più, perché fuck DynamicQ.\n\nHo fatto game in cui ero qualcosa come 10 3 e 13 6 in mid (Lissandra ed Ahri, se non erro), io e il mio team totalmente random e suicida contro il simpaticissimo team con 3 premade nemici. Per quanto potessi essere feedato ed oneshottare tutto, essendo l'unico che faceva qualcosa in team, bastava che i 3 premades nemici coordinati mi focussassero a morte e praticamente, morto io, il fight era già vinto.\n\nDai su, provate a negarlo che la DynamicQ ha fottuto l'unica speranza che si aveva di salire da soli in SoloQ. Ormai o giochi coi tuoi amichetti premade e focussi il tizio feedato tutto il game, oppure mi disp enjoy -18lp.","replies":[{"poster":"Nabbomaster","date":"2016-04-18T18:15:47.747+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Xehanört,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=0002,timestamp=2016-04-18T17:12:38.103+0000)\n>\n> Purtroppo la gente non considera che in Season 6, se sei forte non sali più, perché fuck DynamicQ.\n> \n> Ho fatto game in cui ero qualcosa come 10 3 e 13 6 in mid (Lissandra ed Ahri, se non erro), io e il mio team totalmente random e suicida contro il simpaticissimo team con 3 premade nemici. Per quanto potessi essere feedato ed oneshottare tutto, essendo l&#x27;unico che faceva qualcosa in team, bastava che i 3 premades nemici coordinati mi focussassero a morte e praticamente, morto io, il fight era già vinto.\n> \n> Dai su, provate a negarlo che la DynamicQ ha fottuto l&#x27;unica speranza che si aveva di salire da soli in SoloQ. Ormai o giochi coi tuoi amichetti premade e focussi il tizio feedato tutto il game, oppure mi disp enjoy -18lp.\n\neh si infatti la gente che si fa pagare per boostare ti fa salire l'account per culo\nstate tutti a portare gli esempi di una partita, quando con una partita vale si e no 24 punti\nok in quella partita non sei riuscito a carriare ma in tutte le altre? hai una scusa per tutte?\nanche a me che sono platino spesso in gold e silver avevo partite dove mi trovavo in jungla il tempo di fare un giro completo e il mio team aveva gia dato 10 kill ma partite cosi capita di rado, e non sono quelle che determinano il tuo elo, sono la maggioranza delle partite normali, poi adesso che c'e la free win quando ritenti al promo non arrivare ad oro e' impossibile se sai giocare un minimo","replies":[{"poster":"Xehanört","date":"2016-04-18T19:36:46.384+0000","up_votes":1,"down_votes":1,"body":"Il problema è che la mia percentuale di trovarmi contro almeno 3 premade è talmente alta che inizio a credere di avere una percentuale di sfiga un tantino esagerata.\nOk, ci sono game che perdo ANCHE per colpa mia, ovviamente c'è gente più brava di me che mi fa il culo e questo è innegabile, ma il mio commento era rivolto a tutt'altra questione.\nHo solo detto che nelle scorse season era molto più semplice salire se si era effettivamente di un livello superiore alla propria lega/divisione, mentre ora con la questione dei team premade per i giocatori di SoloQ è davvero un parto riuscire a vincere un game da soli se si ha a che fare con la bot+Lulu premade (auguri a killare l'adc).","replies":[]}]},{"poster":"SguzzoNV","date":"2016-04-18T17:30:11.405+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Xehanört,realm=EUW,application-id=MJVj50Jw,discussion-id=0bscl2ya,comment-id=0002,timestamp=2016-04-18T17:12:38.103+0000)\n>\n> Purtroppo la gente non considera che in Season 6, se sei forte non sali più, perché fuck DynamicQ.\n> \n> Ho fatto game in cui ero qualcosa come 10 3 e 13 6 in mid (Lissandra ed Ahri, se non erro), io e il mio team totalmente random e suicida contro il simpaticissimo team con 3 premade nemici. Per quanto potessi essere feedato ed oneshottare tutto, essendo l&#x27;unico che faceva qualcosa in team, bastava che i 3 premades nemici coordinati mi focussassero a morte e praticamente, morto io, il fight era già vinto.\n> \n> Dai su, provate a negarlo che la DynamicQ ha fottuto l&#x27;unica speranza che si aveva di salire da soli in SoloQ. Ormai o giochi coi tuoi amichetti premade e focussi il tizio feedato tutto il game, oppure mi disp enjoy -18lp.\n\ngiusto ma la maggior parte delle volte non mi preoccupano i premade avversari ma quelli del mio team","replies":[]}]}]}