{"poster":"Nøxian Maiden","date":"2017-05-23T20:42:46.147+0000","title":"Build Camille","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"Ho da poco comprato Camille, e ho visto sui vari siti che tutti su di lei ci buildano la Trinity!\r\nA me onestamente non fa impazzire, perch&egrave; non sono molto brava a farmare ed in early ho problemi di gold, quindi ci metto fin troppo tempo per comprarla!\r\nPersonalmente mi trovo molto bene con l&#039;Idra famelica, pareri?\r\nE che ne pensate di una build simile a quella di Fiora? E&#039; tanto sbagliato farla tipo la sua o potrebbe workare?","replies":[{"poster":"NOLIMIT Vladimir","date":"2017-05-24T08:47:02.289+0000","up_votes":1,"down_votes":0,"body":"Io personalmente la buildo:\n{{item:1412}}, {{item:3111}} oppure {{item:3009}} , {{item:3078}} ,{{item:3074}} ,{{item:3065}} ,{{item:3026}} in giungla, poi sostituisco le scarpe o con{{item:3156}} o {{item:3193}} .\nin top generalmente la buildo più tanky: {{item:3078}} ,{{item:3111}}  oppure {{item:3047}} , {{item:3748}} , {{item:3156}}  ,{{item:3026}} ,{{item:3193}} o {{item:3143}} (per gli hyper fastidiosi da late). \nLa {{item:3193}} worka bene insieme alla tua R che ti fa essere al centro del fight in pochi secondi che pur diminuendo i danni che infliggi ti permette di essere un buon wall grazie ai vari cc di E e di W. Ovviamente se nel tuo team sono presenti più tank (3 ad esempio) l'attiva della {{item:3193}} non conviene attivarla o direttamente non conviene buildarla poichè con così tanti tank amenochè non avete un hyper e un mage da teamfight ({{champion:55}} ,{{champion:1}} ,{{champion:63}} ) non avrete sufficienti danni per spuntarla bene in un 5v5.","replies":[]},{"poster":"Warzekra","date":"2017-05-23T21:04:47.537+0000","up_votes":1,"down_votes":0,"body":"Ciao provo ad aiutarti, visto che ultimamente gioco spesso camille. Anchio come te preferivo l  idra  poi trinity, ma dopo un po' di partite ho provato a fare subito la trinity, e devo dire che è molto meglio:\n-danno bonus della folgore\n-velocità di movimento\n-velocità d' attacco\nLa cosa interessante e che quando chiudi l' oggetto di velocità di attacco puoi fare tre AA tra le due Q al posto di 2.\nPoi io faccio così: se sono in vantaggio o il mio team non ha abbastanza danno vado di idra famelica, invece se sono in svantaggio vado di titanica. Poi full tank","replies":[]}]}