{"poster":"NelsieLisnen","date":"2019-04-24T15:20:17.238+0000","title":"Are Reworks coming out Fast Enough?","subforum":"Gameplay","embed":{"description":"Hey all, it's that time of the year again when we get to talk about the awesome new champions and updates we're working on right now. I won't be talking about the new enchanter support today since I already talked about her in the last roadmap and she's just around the corner.","url":"https://nexus.leagueoflegends.com/en-us/2019/04/champion-roadmap-april-2019/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2019/04/LOL_CMS_275_Tile_01-Feature_H35-V50-min_zxaiuahdel3qm4ruholm-1200x630.jpg"},"up_votes":9,"down_votes":5,"body":"* So on this second Roadmap for the year, Reav3 wrote that riot will be changing their approach to reworks since their bucket list has gotten pretty short. Less reworks per year, more time put into new champs. And I'm sitting here like.. really? I mean sure, outdated champs have lessened, but, is this really the right time for Riot to let their veteran roster stagnate even more? Last year was one of the most interesting ones in terms of steps taken to modernize league. All the new reworks and runes finally created this ambitious momentum and it felt like league was well on its way to bring its content up to modern standards, regardless of reception. Reading reav3's thoughts I could not help flooding my brain with all the champs that are either in dire need of a complete overhaul or straight up look outdated aesthetically. Feel free to disagree but all the following champs, I think, really need some kind of rework: \r\n* Amumu, \r\n* Anivia, \r\n* Annie, \r\n* Cho, \r\n* Corki, \r\n* Mundo, \r\n* Garen, \r\n* Janna, \r\n* Gragas, \r\n* Kennen, \r\n* Kog'maw, \r\n* Malphite, \r\n* Yi, \r\n* Olaf, \r\n* Shaco, \r\n* Sivir, \r\n* Udyr, \r\n* Veigar, \r\n* Zilean, \r\n* Lux, \r\n* Leblanc, \r\n* Cassio, \r\n* Karma, \r\n* Jarvan, \r\n* Nocturne, \r\n* Lee, \r\n* Brand, \r\n* Rumble, \r\n* Wukong, \r\n* Skarner, \r\n* Talon, \r\n* Riven, \r\n* Xerath, \r\n* Voli, \r\n* Zac, \r\n* Jax, \r\n* Kassadin, \r\n* Ashe, \r\n* frickin MALZAHAR and VLAD, \r\n* Fiddle \r\n* Quinn of course. \r\nThey are not in order of importance or anything like that, but I shaped it into a column to stress the sheer volume of work that must be put into this monolith of a game. I just can't see how riot can afford to sport 40+ blatantly outdated champs and still feel like there's no reason to rush. If they're going for 3-4 reworks a year, well, you do the math, because I don't even want to think of how long it would take for the current roster to fully evolve. Is there anyone else that feels like Riot should focus almost exclusively on reviving old characters from the depths of time and sparingly release new ones?","replies":[{"poster":"Smurfraka","date":"2019-04-24T18:13:41.884+0000","up_votes":2,"down_votes":0,"body":"You forgot Tryndamere.","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T19:19:52.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Smurfraka,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0006,timestamp=2019-04-24T18:13:41.884+0000)\n>\n> You forgot Tryndamere.\n\nYes, I actually didn't know if I wanted to include him, I kinda don't know what to think about him. Can any mains give insight?","replies":[{"poster":"Valor Bot","date":"2019-04-27T16:11:22.187+0000","up_votes":2,"down_votes":0,"body":"I'm no Tryndamere main, but his kit has always felt far too simplistic and binary on top of his outdated visuals. I think he has a lot more potential as a Freljordian barbarian than what his current kit has to offer.","replies":[{"poster":"DarkinPrime","date":"2019-04-29T00:06:41.575+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Valor Bot,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=000600000000,timestamp=2019-04-27T16:11:22.187+0000)\n>\n> I'm no Tryndamere main, but his kit has always felt far too simplistic and binary on top of his outdated visuals. I think he has a lot more potential as a Freljordian barbarian than what his current kit has to offer.\n\nYes, much more so than old Aatrox, who got the fucking chop. Tryndamere deserved to be deleted more than Aatrox did.","replies":[]}]}]}]},{"poster":"Sukishoo","date":"2019-04-24T19:19:17.676+0000","up_votes":1,"down_votes":0,"body":"I disagree with a large portion of these as they have already received either a visual update or gameplay update with visual tweaks. Such as \n\n>Annie, Garen, Janna, Yi, Sivir, Zilean, Cassio, Karma, Talon, Zac, Ashe, Mazlahar \n\nOut of those, Zilean and Talon could use some more Visual, Audio, Animation, ect type work.\n\nAshe is even getting VFX for her spells in the next patch, and Zac is currently having some work done to his Ult (again).  Other than that, the rest of them are decent.\n\n>Amumu, Anivia, Cho, Corki, Mundo, Gragas, Kennen, Kog'maw, Malphite, Olaf, Shaco, Udyr, Veigar, Jarvan, Nocturne, Lee, Brand, Rumble, Wukong, Skarner, Riven, Xerath, Voli, Kassadin, Fiddle, Quinn, Jax, Leblanc, , Lux\n\nThese are the ones that could use mid to large scale reworks.","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T19:38:40.263+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sukishoo,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0009,timestamp=2019-04-24T19:19:17.676+0000)\n>\n> I disagree with a large portion of these have already received either a visual update or gameplay update with visual tweaks. Such as \n> \n> Out of those, Zilean and Talon could use some more Visual, Audio, Animation, ect type work.\n> \n> Ashe is even getting VFX for her spells in the next patch, and Zac is currently having some work done to his Ult (again).\n> \n> These are the ones that could use mid to large scale reworks.\n\nI see what you're saying. In the first group you mention, for me, the overarching issue is either outdated models, or models that are out of sync with League's current aesthetic, i.e. Garen's armor or Zilean, Talon and Malz having the ragdoll syndrome. I'm also not a fan of those VFX updates as they just seem like an easy way to avoid the issues of a champ by temporarily appeasing their fans. Now Annie is a concept I can't wrap my head around. What is an anime kindergarden lolita with a cat-ear tiara and a school bag doin in a world of warring kingdoms and magic anyway? Blows my mind.","replies":[{"poster":"Sukishoo","date":"2019-04-24T19:48:13.539+0000","up_votes":1,"down_votes":0,"body":"I mean, Annie looked far worse back in the day\n\nhttp://1.bp.blogspot.com/-2GEJPtGVu4c/UPdCrNcYHaI/AAAAAAAAHL0/HEtQHIgI9UY/s1600/before-and-after-annie.jpg\n\nHer visual rework from 2012 has held up pretty well imo and Riot has also commented on it saying that what we saw from the [Annie: Origins trailer](https://www.youtube.com/watch?v=aUTU-GnxVuM) last year was what she was like before League and what we have in-game is what she became.  So they don't have any plans to change the look for now.\n\nRagdoll... hmm. I don't feel that way on most of them.  I feel that way towards ones like {{champion:24}} as he's never had any kind of model changes, texture fixes, anything that really tried to improve or uphold the quality.  {{champion:90}} for example at least has had some adjustments done to him to make his current model a bit better.","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T20:16:43.145+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sukishoo,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=000900000000,timestamp=2019-04-24T19:48:13.539+0000)\n>\n> I mean, Annie looked far worse back in the day\n> \n> http://1.bp.blogspot.com/-2GEJPtGVu4c/UPdCrNcYHaI/AAAAAAAAHL0/HEtQHIgI9UY/s1600/before-and-after-annie.jpg\n> \n> Her visual rework from 2012 has held up pretty well imo and Riot has also commented on it saying that what we saw from the [Annie: Origins trailer](https://www.youtube.com/watch?v=aUTU-GnxVuM) last year was what she was like before League and what we have in-game is what she became.  So they don't have any plans to change the look for now.\n> \n> Ragdoll... hmm. I don't feel that way on most of them.  I feel that way towards ones like {{champion:24}} as he's never had any kind of model changes, texture fixes, anything that really tried to improve or uphold the quality.  {{champion:90}} for example at least has had some adjustments done to him to make his current model a bit better.\n\nIt's all about comparison to me. Yes they've made some texture updates on champs like malz but compare their models to a Poppy, Akali, Irelia, Warwick to name a few, with all their fluid animations and rich expression. Next to these they look like Ps1 characters. If I mained one of them I'd be bummed they're not gettin some love. My problem with Annie is not the quality of her model, that has somewhat caught up, but her nonsensical theme. I can't see a bipolar murderous schoolgirl archetype fitting into the unified fantasy world of league's lore.","replies":[]}]}]}]},{"poster":"Sire Hippington","date":"2019-04-24T18:35:47.250+0000","up_votes":2,"down_votes":0,"body":"the problem is that they really shouldn't rush their reworks and first have to work on their design values, else we end with more irelias and Aatroxes that require tons of followup work  or even another rework because of how hard to balance they are, while also often totally alienateing the original playerbase.\nInstead of worriing about the quantity, we first need to have a better quality to not get into a loop like ryze...","replies":[]},{"poster":"Düff McWhalen","date":"2019-04-24T17:27:59.585+0000","up_votes":3,"down_votes":1,"body":"I think Riot tries to reinvent the wheel too often rather than doing simple little VGU and tiny reworks. Ezreal was damn good for instance, Aatrox was not. There is way too much Aatrox and not enough Ezreal style reworks.","replies":[{"poster":"Snowbrand","date":"2019-04-24T18:02:32.745+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Düff McWhalen,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0005,timestamp=2019-04-24T17:27:59.585+0000)\n>\n> I think Riot tries to reinvent the wheel too often rather than doing simple little VGU and tiny reworks. Ezreal was damn good for instance, Aatrox was not. There is way too much Aatrox and not enough Ezreal style reworks.\n\nI disagree, most Aatroxx style reworks have been good. Last year with Swain (probably best rework last year), Irelia, Akali, Nunu and Aatroxx was all good or even some very good ones. There is few or none of these VGUs that I think should be reverted for example. I think Aatroxx was a pretty good rework, not the best maybe but not bad. If they kept his stat-check, no brain kit, that would've been a bad decision.","replies":[]},{"poster":"NelsieLisnen","date":"2019-04-24T17:33:39.411+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Düff McWhalen,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0005,timestamp=2019-04-24T17:27:59.585+0000)\n>\n> I think Riot tries to reinvent the wheel too often rather than doing simple little VGU and tiny reworks. Ezreal was damn good for instance, Aatrox was not. There is way too much Aatrox and not enough Ezreal style reworks.\n\nHard agreed, this is the kind of work I'd like to see. Although I actually liked new Chadtrox :O","replies":[]}]},{"poster":"boricCentaur1","date":"2019-04-24T16:50:58.207+0000","up_votes":3,"down_votes":1,"body":"Ummm did you make this list based off of years and not if the champion actually needs one.\nAshe,j4,veigar,kennen and many more are all fine champions.\n\nLike you put riven,talon and FUCKING ALWAYS MOST PLAYED JG LEE SIN IN THIS LIST. i could understand most of these if you were asking for a VU not no you SAID list of champions who need a rework.","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T17:27:53.019+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=boricCentaur1,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0004,timestamp=2019-04-24T16:50:58.207+0000)\n>\n> Ummm did you make this list based off of years and not if the champion actually needs one.\n> Ashe,j4,veigar,kennen and many more are all fine champions.\n> \n> Like you put riven,talon and FUCKING ALWAYS MOST PLAYED JG LEE SIN IN THIS LIST. i could understand most of these if you were asking for a VU not no you SAID list of champions who need a rework.\n\nI tried to make it clear. I said \"some kind of rework\", without necessarily meaning full-on VGU. In my opinions ALL of these champs, whether they could use gameplay changes or not, need to be freshened up on the visual side at least.","replies":[{"poster":"hrooza dota ","date":"2019-04-24T19:20:22.942+0000","up_votes":1,"down_votes":1,"body":"im pretty sure they were talking about the full vgu updates will be slowed down in the road map.\n\n> After Mordekaiser’s VGU this year, we’ll have gotten through the last of the champions in need of his level of work (think updates the size of Urgot’s, Nunu’s, and Swain’s). So for the rest of 2019 and for the foreseeable future, we’re going to focus more on new champions and less on large-scale visual-gameplay updates.\n\nthey did not say slower visual updates and small kit reworks or whatever.","replies":[]}]}]},{"poster":"AR URF","date":"2019-04-24T15:34:35.145+0000","up_votes":2,"down_votes":1,"body":"NO DON'T TOUCH {{champion:34}}.","replies":[{"poster":"Oleandervine","date":"2019-04-24T15:39:26.190+0000","up_votes":3,"down_votes":2,"body":"She could do with a minor VgU like Ezreal. She's got some clunkiness to her kit that could use modernizing. Plus, she and Volibear kind of need to be brought in line visually with Ornn in some way, since they're all supposed to be siblings.","replies":[{"poster":"AR URF","date":"2019-04-24T15:49:59.472+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Oleandervine,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=00010000,timestamp=2019-04-24T15:39:26.190+0000)\n>\n> She could do with a minor VgU like Ezreal. She's got some clunkiness to her kit that could use modernizing. Plus, she and Volibear kind of need to be brought in line visually with Ornn in some way, since they're all supposed to be siblings.\n\nOnly thing that needs a change is her q.","replies":[{"poster":"Oleandervine","date":"2019-04-24T16:02:15.029+0000","up_votes":1,"down_votes":0,"body":"It could use some smoothing out, but I find her E to be a pretty uninspired, lacking ability.","replies":[]}]}]},{"poster":"NelsieLisnen","date":"2019-04-24T17:25:18.099+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AR URF,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0001,timestamp=2019-04-24T15:34:35.145+0000)\n>\n> NO DON'T TOUCH {{champion:34}}.\n\nI think Anivia's kit is perfect and her being a frost bird somewhat covers up her terrible polygons. Still though...","replies":[]},{"poster":"Febos","date":"2019-04-24T15:57:24.803+0000","up_votes":1,"down_votes":1,"body":"Anivia is in a pretty good spot. Solid theme and implementation. The only thing she needs is a VU, so something like Morgana.\nThe only time I see that happening is after they do something about Volibear, since they're connected by lore. Doesn't make sense touching Anivia before that.","replies":[]}]},{"poster":"General Matty","date":"2019-04-24T15:25:12.593+0000","up_votes":1,"down_votes":0,"body":"IMO i believe that the reworks are coming out at a good pace. It takes a lot of time to redesign a character and their kit while also giving them new voicelines as well as interactions and such with other champions. Also some of the characters you listed don't even need reworks they just need a visual update.","replies":[{"poster":"DarkinPrime","date":"2019-04-29T00:06:03.945+0000","up_votes":1,"down_votes":0,"body":"Riot has too many incompetent designers on staff. This game is a clusterfuck.","replies":[]},{"poster":"NelsieLisnen","date":"2019-04-24T17:39:36.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=General Matty,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0000,timestamp=2019-04-24T15:25:12.593+0000)\n>\n> IMO i believe that the reworks are coming out at a good pace. It takes a lot of time to redesign a character and their kit while also giving them new voicelines as well as interactions and such with other champions. Also some of the characters you listed don't even need reworks they just need a visual update.\n\nI also included champs I think only need visual updates. My point is, things that need patching are way too many to be focusing on new champs. Besides, and I wanted to discuss this too, I feel like the last few new champs are suffering from creative drought, especially Neeko and Sylas, whose kits are boring rehashes of already existing mechanics, with a gimmicky mechanic thrown in clumsily to make them feel somewhat unique. But I find that last year's VUs/VGUs where much more interesting conceptualy.","replies":[{"poster":"Snowbrand","date":"2019-04-24T17:57:35.251+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NelsieLisnen,realm=EUNE,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=00000000,timestamp=2019-04-24T17:39:36.913+0000)\n>\n> I also included champs I think only need visual updates. My point is, things that need patching are way too many to be focusing on new champs. Besides, and I wanted to discuss this too, I feel like the last few new champs are suffering from creative drought, especially Neeko and Sylas, whose kits are boring rehashes of already existing mechanics, with a gimmicky mechanic thrown in clumsily to make them feel somewhat unique. But I find that last year's VUs/VGUs where much more interesting conceptualy.\n\nYea, the risk is that they will eventually stop coming up with interesting new champions and just make variations of already existing ones. There is a limit how many new and unique champions you can come up with, even though I hope it won't stop for a long time. Putting more time into VGUs would help solve this issue though.","replies":[]}]}]},{"poster":"TheMundanePigeon","date":"2019-04-25T06:41:18.418+0000","up_votes":1,"down_votes":0,"body":"I really can’t stress enough how much Zilean needs a VU, a champ that has been around for so long, and has not received any semblance of a VU in all these time. It’s greatly disheartening as a Zilean main, who adores almost every aspect of him.","replies":[{"poster":"NelsieLisnen","date":"2019-04-27T20:43:47.633+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheMundanePigeon,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=000d,timestamp=2019-04-25T06:41:18.418+0000)\n>\n> I really can’t stress enough how much Zilean needs a VU, a champ that has been around for so long, and has not received any semblance of a VU in all these time. It’s greatly disheartening as a Zilean main, who adores almost every aspect of him.\n\nI second that. I've also been thinking of doing another post to discuss how Zilean, albeit kinda fun, is a perfect example of a champ that's been left behind on almost all levels: Visuals, Theme, place in the meta etc.","replies":[]}]},{"poster":"FrozenFrostFyre","date":"2019-04-24T16:01:09.939+0000","up_votes":1,"down_votes":0,"body":"Anyone who actually plays aniv will tell you to fuck right off, aka me. she has one of the most unique and balanced kits in the game that has endured throughout time. There is nothing on her kit that isn't designed exactly as it is suppose to be. She is the perfect control mage. \n\nMost the champions you list have ALREADY had reworks. If you want people to take this seriously only list champions that actually need it.","replies":[{"poster":"Snowbrand","date":"2019-04-24T17:55:21.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrozenFrostFyre,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0002,timestamp=2019-04-24T16:01:09.939+0000)\n>\n> Anyone who actually plays aniv will tell you to fuck right off, aka me. she has one of the most unique and balanced kits in the game that has endured throughout time. There is nothing on her kit that isn't designed exactly as it is suppose to be. She is the perfect control mage. \n> \n> Most the champions you list have ALREADY had reworks. If you want people to take this seriously only list champions that actually need it.\n\nExcept her model looks like 2009. Her gameplay is mostly fine though except that they could update her e maybe.","replies":[{"poster":"FrozenFrostFyre","date":"2019-04-25T14:56:00.382+0000","up_votes":1,"down_votes":0,"body":"Oh idk what she even looks like anymore been using blackfrost for so long. Maybe just a visual update.","replies":[]}]},{"poster":"NelsieLisnen","date":"2019-04-24T17:32:08.593+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrozenFrostFyre,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=0002,timestamp=2019-04-24T16:01:09.939+0000)\n>\n> Anyone who actually plays aniv will tell you to fuck right off, aka me. she has one of the most unique and balanced kits in the game that has endured throughout time. There is nothing on her kit that isn't designed exactly as it is suppose to be. She is the perfect control mage. \n> \n> Most the champions you list have ALREADY had reworks. If you want people to take this seriously only list champions that actually need it.\n\nI love that I tried to make the post as impartial as possible, yet people still find reasons to take it personaly. Read my criteria again. I included champions that, in my opinion, also need visual updates, if not VGUs. Learn to discuss.","replies":[]}]},{"poster":"HA I am Shaco HA","date":"2019-04-24T22:39:21.450+0000","up_votes":1,"down_votes":0,"body":"Shaco legit existing from the very start and not been visually updated at all, only had a color change and ability icon changes, then he got a trash rework that killed the champion","replies":[]},{"poster":"NEßULA","date":"2019-04-24T19:39:01.568+0000","up_votes":1,"down_votes":0,"body":"I've been reading some of your responses, and most of these champs don't need any sort of GAMEPLAY update. You compared to Ezreal, and Ezreal got some nice animations and stuff, but his W also got reworked. I don't think that champs like Anivia need an ability changed. However, Anivia did recently get some visual updates, and a lot of champions are , too. If that's what you're referring to, then they are doing these relatively recently. I don't recall all the champions but I know that Teemo, Jax, Ashe, Renekton, Anivia, Blitzcrank, and a LOT of others have recently gotten vfx updates. Lee is a good example of this, I think he could get some particle updates and stuff but his gameplay is perfectly fine in my opinion. Some notable ones that you pointed out that I agree with on this list are: Fiddlesticks, Volibear, Wukong, Udyr, Amumu, and Mundo. These are just my opinions so feel free to disagree but these all feel like genuinely outdated kits.","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T19:59:39.651+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Painted Lady,realm=NA,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=000b,timestamp=2019-04-24T19:39:01.568+0000)\n>\n> I've been reading some of your responses, and most of these champs don't need any sort of GAMEPLAY update. You compared to Ezreal, and Ezreal got some nice animations and stuff, but his W also got reworked. I don't think that champs like Anivia need an ability changed. However, Anivia did recently get some visual updates, and a lot of champions are , too. If that's what you're referring to, then they are doing these relatively recently. I don't recall all the champions but I know that Teemo, Jax, Ashe, Renekton, Anivia, Blitzcrank, and a LOT of others have recently gotten vfx updates. Lee is a good example of this, I think he could get some particle updates and stuff but his gameplay is perfectly fine in my opinion. Some notable ones that you pointed out that I agree with on this list are: Fiddlesticks, Volibear, Wukong, Udyr, Amumu, and Mundo. These are just my opinions so feel free to disagree but these all feel like genuinely outdated kits.\n\nThanks for the comment, I'm actually impressed by the amount of people debating Anivia. She falls in this group I feel could use a change of aesthetic direction, while she doesn't have a problematic kit at all. The issue with her is, her largely geometric design is able to accomodate her low polygon model, yet I still think they could opt into making her more, visually interesting let's say, with more dynamic animations, less clunky flight animations etc. And it's a pity especially because flying characters can have A LOT of freedom of movement","replies":[]}]},{"poster":"hrooza dota ","date":"2019-04-24T19:25:24.120+0000","up_votes":1,"down_votes":0,"body":">After Mordekaiser’s VGU this year, we’ll have gotten through the last of the champions in need of his level of work (think updates the size of Urgot’s, Nunu’s, and Swain’s). So for the rest of 2019 and for the foreseeable future, we’re going to focus more on new champions and less on large-scale visual-gameplay updates.\n\n\n> we’ll also be doing smaller gameplay-only reworks on a case-by-case basis.\n\njust saying they never said they will stop/slow down minor/small reworks (like morgana) what they gonna slow down is the huge updates that completely change a champion (like kayle/nunu level changing)","replies":[{"poster":"NelsieLisnen","date":"2019-04-24T19:44:12.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=hrooza dota ,realm=EUNE,application-id=3ErqAdtq,discussion-id=FquabE8g,comment-id=000a,timestamp=2019-04-24T19:25:24.120+0000)\n>\n> just saying they never said they will stop/slow down minor/small reworks (like morgana) what they gonna slow down is the huge updates that completely change a champion (like kayle/nunu level changing)\n\nI sure hope that's the case, while it's up for debate which champs need a full VGU. Although it's up to Riot's whims at the end of the day. Even so, at their current pace, it'd take heeeella long to update all the roster.","replies":[]}]},{"poster":"Power Cosmic","date":"2019-04-24T18:58:33.046+0000","up_votes":1,"down_votes":0,"body":"A lot of people that play League are not on this Board or on Reddit.","replies":[]},{"poster":"Moody P","date":"2019-04-24T16:20:07.989+0000","up_votes":1,"down_votes":2,"body":"No, reworks are dumb","replies":[]}]}