{"poster":"jewish cthulhu","date":"2015-11-04T23:47:15.614+0000","title":"Nidalee feels too weak after patch 5.15","subforum":"Gameplay","up_votes":7,"down_votes":6,"body":"After the 5.15 nerfs, Nidalee {{champion:76}} just feels too hard to land spears with and when they are landed, without as much of a reward unless landing them on a carry. Others have posted about this, but I wanted to make my voice heard because I consider myself a fairly avid nidalee player, who should land spears more spears. I have a few points to make about this.\r\n\r\n1. The risk reward factor.\r\nNidalee spears have been thought of as &quot;toxic, cancer, op&quot; etc. The general philosophy is to dodge them, usually accompanied by some insult about being bronze 5 or whatever. The damage nerf was helpful to removing nidalee as a good competitive jungler, but what I find the most problematic is the cast time nerf. The spears were thought of as low risk high reward, but they have become low risk, but almost no reward unless hitting a carry, when that almost never happens due to bodyblocks, mobility, and the slowness of spears. Overall, the risk is low, but the reward is almost nonexistent unless landing a spear onto a priority target.\r\n\r\n2. Nidalee needs to have the cast time nerf reverted to be properly playable.\r\nNidalee is a very playable champion, a decent jungler, and a strong assassin. The problem with all that is that nidalee&#039;s on paper power is much higher than in game. On paper, nidalee will hit a max range rank 5 spear (390 +1.2 ap), hunting the target and gaining MS buff, pounce in  (50-200 + .3ap), autoattack swipe (100% ad + 70-230 + .45 ap) then takedown for max damage (13.3-300 + 2.50 ad 1.2 ap). This all sounds great in theory, adding up to a total of 1120 magic dmg, 3.15 ap, 3.5 ad, which equates to a lot of damage. The problem with all this is Nidalee&#039;s inherent reliance on landing a spear to do all this damage. With the nerf to spear cast time, landing said spear is extremely difficult, made slightly less difficult by terrain interaction (over the wall spears, when an enemy is near a wall and cannot dodge, etc). The other problem with this is Nidalee needing to jump in to do all this damage. In the current game state, and as long as cc and AOE damage exist, nidalee jumping into the back line of a fight **_even when on to a carry that she hit a long range spear on to_**, she will get deleted. A late game nidalee may kill the carry, but is guaranteed to die, sub a zhonyas and a team to back her up. Nidalee being unable to do much in teamfights and her nerfed ability to do something out of them, makes her in need to be able to land her primary damage source. The other problem is the speed problem. Like many assassins, Nidalee is supposed to do her damage quick, which she does, but when running away, she feels like trying to kite with an adc that has no attack speed due to the long spear cast time.\r\n\r\nTl;dr: Revert Nidalee spear cast time nerf from 5.15, she is too weak in most stages of the game unless fed.\r\n\r\n**What I am asking for: Revert Nidalee spear cast time nerf from patch 5.15, and if Riot is feeling really generous, a buff to bushwack vision so that i can actually check the entire river brush (estimate about 650 range of vision).**{{champion:76}}\r\n\r\nIf you have an opinion that is not something along the lines of &quot;noob nid cant hit spears go back to wood 7&quot; that would be appreciated","replies":[{"poster":"Twitch Chat","date":"2015-11-05T03:54:35.216+0000","up_votes":2,"down_votes":0,"body":"...isn't \"low risk no reward unless you hit an important target\" the way it should be?","replies":[]},{"poster":"Slamurai Jack","date":"2015-11-05T01:35:56.938+0000","up_votes":2,"down_votes":1,"body":"Nidalee jungle has a 52.74% win rate and you want to buff it?","replies":[{"poster":"Zair Umbras","date":"2015-11-05T07:55:26.302+0000","up_votes":1,"down_votes":0,"body":"Top Kayle has a 54% and top Heimer has a 56% win rate, yet you'll never see them played because while they might win more games, they're played only by people who have a minimum of 100 games on the champ, whereas there's champs like Kindred at 54% with an average of 6 games... Seriously, fricken 6... Morde at 55% with 14 games on average, etc. Most champs with high win percents are because the champions aren't played often and when they are, they're played by some one who has a mastery of the champ on top of the enemy likely being like 'WAIT, HOW DO I PLAY AGAINST -THAT-?!?!?!' Admit it. You haven't seen a Nid in ranked in ages. When she does finally come around, you're like 'Crap, gotta relearn juking those spears.' When you run out of practice against certain things and stop playing against it for a whiiiiiiiiiiiiiiile, when they do finally make a return, you don't have the same juking or micromanaging skills towards that champ to actually play against it properly. \n\nThere's very few champs with high win rates that also have huge pick rates.\n\nPlus, if we went with high win rate, you'd just be justifying all the nerfs Shaco has gotten over the last couple of years despite his playrate always being in the toilet.","replies":[{"poster":"YumaS2Astral","date":"2015-11-05T08:32:53.187+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zair Umbras,realm=NA,application-id=3ErqAdtq,discussion-id=Onen0NEX,comment-id=00020000,timestamp=2015-11-05T07:55:26.302+0000)\n>\n> Top Kayle has a 54% and top Heimer has a 56% win rate, yet you'll never see them played because while they might win more games, they're played only by people who have a minimum of 100 games on the champ, whereas there's champs like Kindred at 54% with an average of 6 games... Seriously, fricken 6... Morde at 55% with 14 games on average, etc. Most champs with high win percents are because the champions aren't played often and when they are, they're played by some one who has a mastery of the champ on top of the enemy likely being like 'WAIT, HOW DO I PLAY AGAINST -THAT-?!?!?!' Admit it. You haven't seen a Nid in ranked in ages. When she does finally come around, you're like 'Crap, gotta relearn juking those spears.' When you run out of practice against certain things and stop playing against it for a whiiiiiiiiiiiiiiile, when they do finally make a return, you don't have the same juking or micromanaging skills towards that champ to actually play against it properly. \n> \n> There's very few champs with high win rates that also have huge pick rates.\n> \n> Plus, if we went with high win rate, you'd just be justifying all the nerfs Shaco has gotten over the last couple of years despite his playrate always being in the toilet.\n\nIs there any problem with that? I mean... Not all champions need to be popular. If anything, the fact that those champions have high winrates means that, despite what people may think, they are actually very strong.","replies":[{"poster":"Zair Umbras","date":"2015-11-05T12:56:55.814+0000","up_votes":1,"down_votes":0,"body":"Sadly, most win rates don't work that way. A champion with incredibly low pick rate, but high winrate usually is just there's a couple of mains here and there that play every now and then, which completely throws off players who have never gone against it. \n\nMany low pick rate champs tend to do incredibly well with a few exceptions for incredibly gutted champions like Yorick, who surprisingly played more often than mid Kog'Maw. You can even [check](http://champion.gg/statistics/#?sortBy=general.playPercent&order=ascend) for yourself. All the ones with low win rates are because they're not in the lane they do best in.\n\nWhen people don't play against something for a long time, they forget how to play against it, so when some one who mains one of those long forgotten champs come around and they win the game not because their champ is amazingly powerful or anything, but because the enemy team is staring at it like 'wut'. As a player in Plat, I can definitely tell you that if you take a low pick rate champ like Karma mid or Kayle top and the enemies will be completely confused and calling these champs 'broken' and 'OP'. \n\nA good example of this happening in Pro Play was actually recently Veigar mid after people thought he was gutted into oblivion and before that was Trundle Support, which made little to no sense, yet it confused the crap out of the enemies so hard.","replies":[]}]}]}]},{"poster":"YumaS2Astral","date":"2015-11-05T07:34:26.915+0000","up_votes":1,"down_votes":0,"body":"The problem is that when Nidalee is good, she is oppressive. I would rather have her weak, or reworked. Yeah, even though she already received a rework last year.\n\nTechnically, Nidalee IS good. It is just that now she is actually balanced; she is essentially an AP Lee Sin; a champion that is extremely strong early game and has a lot of utility, can snowball for her team, but falls off hard late game. A good Nidalee WILL make plays and allow her team to have a lead.","replies":[]},{"poster":"jewish cthulhu","date":"2015-11-05T05:23:46.458+0000","up_votes":1,"down_votes":0,"body":"Something else about Nidalee, she is forced into the conundrum of \"if i build full ap to assassinate a carry its suicide, but if I don't build full ap and build somewhat tanky to live I won't oneshot the carry,\" changing the spear cast time to where every long time {{champion:76}} is comfortable with will help somewhat to alleviate this while not making her a \"noob spear chucker to do 90% adc hp\" that she was pre-rework in patch 4.10.","replies":[]},{"poster":"jewish cthulhu","date":"2015-11-05T05:09:49.730+0000","up_votes":1,"down_votes":0,"body":"The real qualm i have is that the spear feels sluggish to cast, being a slow skillshot should have its difficulty to land though","replies":[]},{"poster":"NoBootsAllowed","date":"2015-11-05T00:51:12.086+0000","up_votes":1,"down_votes":0,"body":"i remember the nidale before 5.15... it was cancer op.. so dont talk","replies":[]},{"poster":"Sasogwa","date":"2015-11-05T00:08:19.324+0000","up_votes":1,"down_votes":0,"body":"Idk. What I know with Nidalee is that even if she's not good at all if you don't play her very well, she becomes insanely good when a high elo main plays her. \nImo, kinda like Azir, if she's in a decent spot she dominates high elo/ competitive\nI guess we could buff back her cast time, but I'd have a lot of reserve if she was to be further buffed.","replies":[]}]}