{"poster":"Swadoh95","date":"2015-11-09T21:04:17.367+0000","title":"Come giocare contro Le Blanc?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Salve, mi spiegate come mi devo comportare in lane contro una le Blanc?","replies":[{"poster":"Ucr0niA","date":"2015-11-09T21:39:54.935+0000","up_votes":3,"down_votes":0,"body":"Se proprio non sai come fare:\n{{champion:3}}","replies":[{"poster":"sboboo","date":"2015-11-11T15:48:24.831+0000","up_votes":1,"down_votes":0,"body":"Full ignoranza , starti col {{item:3028}} e poi full MR. izi counter","replies":[]}]},{"poster":"LightIsMyPath","date":"2015-11-09T21:39:57.567+0000","up_votes":2,"down_votes":0,"body":"ciao!io avevo problemi mostruosi contro lb, mi spaventava il solo vederla in lane...brr\n\nDopo qualche partita con una main lb che mi ha spiegato ben bene come analizzarne i movimenti e i cd delle spells, oltre che prevedere quando cerchera' di attaccarti e quando invece non le sara' conveniente la situazione e' molto migliorata...\n\ncomunque quando so di averla contro prendo {{champion:25}} mid...il suo scudo rende a lb difficile assassinarti nei primi livelli, e il tuo push costante di w la obbliga a finire il mana per farmare, inoltre non potra' roammare se non vuole perdere taanto farm. In late tu avrai con ogni probabilita' farmato piu' di lei, e sarai molto piu' utile al team.","replies":[]},{"poster":"samael00","date":"2015-11-09T23:26:39.057+0000","up_votes":1,"down_votes":0,"body":"Le cose che puoi fare sono:\n\n1) quando hai la sua q sopra allontanati per non farti prendere di w, se è brava cercherà di prenderti di E dopo la w ma è facile da schivare e spreca un sacco di mana.\n\n2) Puniscila dopo che usa la w, ha un cd molto alto sopratutto all'inizio.\n\n3) Se sei un ap che deve giocare a distanze ravvicinate (ahri,diana) prendi abyssal first item\n\n4) Se sei un ap da harass e sei in difficoltà puoi prendere athene, comunque è facile fare harass dalla distanza a lb\n\n5) quando si sdoppia vedi gli item, quella senza item è quella falsa.","replies":[{"poster":"Pasticcionex","date":"2015-11-10T09:02:53.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=samael00,realm=EUW,application-id=cAOZwaUi,discussion-id=xmOBXlXz,comment-id=0006,timestamp=2015-11-09T23:26:39.057+0000)\n>\n> Le cose che puoi fare sono:\n> \n> 1) quando hai la sua q sopra allontanati per non farti prendere di w, se è brava cercherà di prenderti di E dopo la w ma è facile da schivare e spreca un sacco di mana.\n> \n> 2) Puniscila dopo che usa la w, ha un cd molto alto sopratutto all'inizio.\n> \n> 3) Se sei un ap che deve giocare a distanze ravvicinate (ahri,diana) prendi abyssal first item\n> \n> 4) Se sei un ap da harass e sei in difficoltà puoi prendere athene, comunque è facile fare harass dalla distanza a lb\n> \n> 5) quando si sdoppia vedi gli item, quella senza item è quella falsa.\n\nil primo consiglio non è efficacie perchè a meno che la lb contro non è lenta nei movimenti spesso dopo che si fa la Q si fa automaticamente la W con una velocità che schivarla è difficile se chi hai contro è forte","replies":[{"poster":"samael00","date":"2015-11-10T11:31:04.974+0000","up_votes":1,"down_votes":0,"body":"Bho a me capita che mi mettono la Q sopra e poi sono troppo distante per essere preso di W, comunque è valido nel caso non ti faccia  subito la W. Cioè se hai la Q sopra e non ti fa subito la full combo meglio non darle la possibilità no? \n\nDiciamo che forse un consiglio migliore sarebbe che quando ti mette la Q ti devi aspettarti che vuole venirti addosso e farti la full combo e quindi vedere che fare in base al champ che hai.","replies":[]}]}]},{"poster":"One Punch Morde","date":"2015-11-10T08:43:30.447+0000","up_votes":1,"down_votes":0,"body":"Per me è una delle lame più facili lB, si basa solo sul danno e non ha waweclear, counterarla è super easy basta pushare la lane così dovrà decidere se attaccarti e perdere farm o farmare e lasciarti in pace. Allo stesso tempo pushando le impedisci di rommare (che è quello il vero problema) quindi due piccioni con una Fava.","replies":[]},{"poster":"Lee Pugno Divino","date":"2015-11-10T00:36:33.614+0000","up_votes":1,"down_votes":0,"body":"Prima di tutto, con quale champ?\nComunque Leblanc ha un harass fastidioso e infligge una quantita' considerevole di danni. \nDetto questo.\nIl suo unico Waveclear e' la sua W, contro Leblanc devi cercare di pushare e giocare aggressivo nelle prime fasi della partita.\nPusha la wave e costringila a sprecare le spell sui minion, se la forzi sotto la sua torre e' piu' probabile che perda farm.\nNon renderti un target appetibile, stai lontano dai tuoi minion maghetti, altrimenti gli concedi la possibilita' di harassarti e pushare la wave in un colpo solo.","replies":[]},{"poster":"IrrationalNumber","date":"2015-11-09T23:08:49.527+0000","up_votes":1,"down_votes":0,"body":"Ricordati che se usa il seal of silence, ti sta per jumpare addosso. Non permettergli di fare la combo. I primi due livelli e' molto debole, puoi abusarne per farle perdere farm. E dopo niente, devi giocartela a secondo del tuo pick. La forza di leblanc sta nel roammare e assassinare altrove, se la feedi gia' in linea snowballa male male.","replies":[]},{"poster":"Ste the ripper","date":"2015-11-09T22:30:19.994+0000","up_votes":1,"down_votes":0,"body":"Se sai usare ahri diventa uno skill match up, tu devi tenere lo charm per quando ti entra in faccia di w, se ci riesci vinci sempre partendo di doppio ring e abyssal.\nCon gli altri champ dipende chi usi, comunque in linea generale cerca di stare safe, piuttosto recalla spesso, ma se non muori quasi di sicuro scali meglio di lei in late e vinci.","replies":[]},{"poster":"Fappelion Dong","date":"2015-11-09T21:15:26.188+0000","up_votes":1,"down_votes":0,"body":"Devi pushare la lane, {{champion:7}} fa fatica a farmare sotto torre, in questo modo dovresti mantenere un certo vantaggio nell'early. In midgame puoi solo anticiparla e colpirla con poke dalla distanza o saltarle addosso quando ha usatogli scattini. In late invece qualunque altro midlaner le apre in una combo\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"kirchhoff","date":"2015-11-09T21:07:13.000+0000","up_votes":1,"down_votes":0,"body":"{{item:1033}} -> {{item:1057}} -> {{item:3111}} -> {{item:3211}} -> {{summoner:21}}","replies":[]}]}