{"poster":"Jurela Owner","date":"2017-05-17T23:17:30.696+0000","title":"Largas colas para mi, y no para los demas, porque?","subforum":"Problemas Técnicos","up_votes":4,"down_votes":1,"body":"Pues el titulo lo dice todo, soy nivel bajo, no llego a 15, y mis colas de espera, aunque diga aproximadamente 1 minutos, he llegado a pasar 12 minutos, y alguien que tengo agregado en amigos de nivel similar, se pasa 1 minuto esperando y encuentra partida, porque?","replies":[{"poster":"Attyla","date":"2017-05-17T23:18:45.510+0000","up_votes":1,"down_votes":0,"body":"Sera por la hora en que juegas","replies":[{"poster":"Jurela Owner","date":"2017-05-17T23:22:25.552+0000","up_votes":1,"down_votes":0,"body":"Pero si yo mismo estando 5 minutos en la cola, veo que loguea un amigo, el se conecta, entra a cola y dos minutos despues encuentra partida y a mi me dura hasta 12 minutos... que tendrá que ver la cola... Como explicas que él si encuentre partida y yo no?","replies":[{"poster":"Cris300","date":"2017-05-18T01:52:24.991+0000","up_votes":1,"down_votes":0,"body":"ten en cuenta q no solo te pasa a ti, yo he estado en cola durante 25m pero no me molesta, en ese tiempo puedo hacer cosas q no puedo hacer en partida como mirar twitter, facebook, ver videos, hablar por skype (con un \"amigo\" afk solo para divertirme con el) y varias cosas mas","replies":[{"poster":"Jurela Owner","date":"2017-05-18T11:55:53.661+0000","up_votes":1,"down_votes":0,"body":"Este comentario no responde mi pregunta... me da igual no ser el único al que le pasa, o todos o ninguno... y como he explicado arriba, se ve que solo a algunos... porque?","replies":[{"poster":"Cris300","date":"2017-05-18T14:05:09.886+0000","up_votes":1,"down_votes":0,"body":"y q respuesta quieres? de saber como acortar esos tiempos o q? cada cola funciona como debe, la de aram tarda mucho porq casi nadie lo juega porq es aleatorio, oculto lo juegan la mayoria ya q no te banean a un campeon, reclutamiento juega menos gente hay porq hay veces q un aliado banea un pick del aliado (ej: mi top se escoge a camille y el primero en banear de mi equipo banea a camille solo para trollear), en rankeds es un poco menos larga la cola q en normal ya q son rankeds y todos quieren las recompensas de la liga y punto, ademas de q tambien depende a la hora q estas jugando ya q como el juego es gratis hay niños y se deben acostar a dormir para ir al colegio","replies":[{"poster":"Jurela Owner","date":"2017-05-18T21:03:10.125+0000","up_votes":1,"down_votes":0,"body":"No soy nuevo, soy oro 3 en europa, juego aqui con mi novia, y en europa el tiempo estimado se aproxima muchisimo al tiempo que tardas en buscar una partida, aqui es exageraaado, dice 1 minuto 30 segundos y tarda 12 minutos, porque!?? eso es lo que busco, porque el tiempo aproximado y el real, no se parecen en nada...","replies":[]}]}]}]}]}]}]}