{"poster":"notice me Sin pi","date":"2017-06-03T04:12:06.523+0000","title":"Darius gets rewarded for successful ult. Can Garen also get rewarded for successful ult?","subforum":"Gameplay","up_votes":69,"down_votes":23,"body":"**when i say &quot;rewarded&quot;, i mean being able to make meaningful contributions to teamfights, not just the kill gold.**\r\n\r\nWhen Darius pulls off a successful ultimate, he is rewarded with ~~more slaughtering~~ even more damage, which makes him threatening in teamfights.\r\nWhen Garen pulls off a successful ultimate, he is rewarded with nothing but the kill gold and a visual effect that has no real effect on the rest of the teamfight.\r\n\r\nI think the problem with Garen&#039;s ult can also be a good spot to reinforce his identity as the magic-hating Might of Demacia, and also as an opposing force against Hand of Noxus; currently Darius brings **_offensive_** threat against multiple enemies on his ult, so it would be thematically make sense for Garen to bring a **_defensive_** threat via allies. For example, making allies near the ult-executed enemy champion gain magic shield ~~morgana shield without the cc immunity part~~ would actually give him something to contribute in teamfights.\r\n\r\nBalance-wise, I think it would also reduce the win rate gap between low and high elo. Because 1vs1 or 2v2 skirmishes have high impact on win/lose in low elo, a change to Garen&#039;s ult affecting allies would barely affect his performance in low elo. At same time, a change to Garen&#039;s ult affecting allies would affect his performance in high elo significantly due to teamfights being a lot more important in high elo compared to in low elo.","replies":[{"poster":"VoraciousX","date":"2017-06-03T05:43:38.762+0000","up_votes":54,"down_votes":0,"body":"{{champion:86}} hates magic, ult deals magic damage. Logic at it's finest.","replies":[{"poster":"Saianna","date":"2017-06-03T09:49:21.245+0000","up_votes":4,"down_votes":2,"body":"Dunno if you know, but Garens ultimate used to deal true damage. it also had alot more favourable scalling.","replies":[{"poster":"VoraciousX","date":"2017-06-03T10:13:39.439+0000","up_votes":13,"down_votes":2,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=00070001,timestamp=2017-06-03T09:49:21.245+0000)\n>\n> Dunno if you know, but Garens ultimate used to deal true damage. it also had alot more favourable scalling.\n\nIt only started doing true damage when he was reworked to be a juggernaut, and it still does, just only to the villain. It's always dealt magic damage afaik otherwise.","replies":[{"poster":"Saianna","date":"2017-06-03T14:27:00.971+0000","up_votes":12,"down_votes":0,"body":"No mate. I mean when he was relased, long long ago, it truly did deal true damage ;)\n\nThat's why when they relased Darius with his ultimate I was like \"you assholes nerfed Garen to unplayablility, yet now you relase exactly the same shit in different skin?!\"","replies":[{"poster":"Pierce The Veal","date":"2017-06-03T21:50:54.494+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=0007000100000001,timestamp=2017-06-03T14:27:00.971+0000)\n>\n> No mate. I mean when he was relased, long long ago, it truly did deal true damage ;)\n> \n> That why when they elased Darius with his ultimate I was like &quot;you assholes nerfed Garen to unplayablility, yet now you relase exactly the same shit in different skin?!&quot;\n\nThis.","replies":[]}]}]}]},{"poster":"SSShutTheDuckUp","date":"2017-06-03T12:59:44.463+0000","up_votes":4,"down_votes":0,"body":"Well, an axes throwing gladiator gets stronger buying swords, a rat with a blowgun can beat a star creating dragon, a blind monk inside a smokescreen sees less, a dwarf rides his plane faster with boots and so on. League does not make a lot of sense when think about it in details","replies":[{"poster":"Zero Skill Tank","date":"2017-06-03T16:02:30.226+0000","up_votes":4,"down_votes":0,"body":"This rat with a blowgun is rumored to be an incarnation of an ancient demon, so this one is pretty much fine :3","replies":[]},{"poster":"SzGamer227","date":"2017-06-03T23:08:45.971+0000","up_votes":2,"down_votes":0,"body":"Gun toting sniper gets stronger bullets by buying swords, and improves its fire rate by buying daggers.\n{{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"Fondling Gems","date":"2017-06-03T08:48:00.863+0000","up_votes":3,"down_votes":0,"body":"Well that is why he strives to smite villains with it, so that he can do true damage instead.","replies":[]}]},{"poster":"Stars Shaper","date":"2017-06-03T14:41:24.112+0000","up_votes":23,"down_votes":0,"body":"For each Ultimate/Villain kill, Garen voice volume rises by 10% when saying \"Justice\".","replies":[{"poster":"TheRealBaz","date":"2017-06-03T19:23:59.355+0000","up_votes":11,"down_votes":0,"body":"also he does push ups 20% faster","replies":[]},{"poster":"Kahl Drogo98","date":"2017-06-03T16:03:11.374+0000","up_votes":3,"down_votes":0,"body":"Riot hire this person immediately","replies":[]}]},{"poster":"Doozku","date":"2017-06-03T04:21:12.756+0000","up_votes":10,"down_votes":0,"body":"A shield would be cool. Also maybe a speed buff, or even doing AOE magic damage if your target dies could be other options.","replies":[{"poster":"SnakDatSmilesBak","date":"2017-06-03T15:46:32.186+0000","up_votes":3,"down_votes":0,"body":"Magic damage aoe equal to overkill damage? One of the best ideas ive seen for garen. If it's the villain u kill then true damage aoe?","replies":[]},{"poster":"Yalathanil","date":"2017-06-03T13:15:18.132+0000","up_votes":3,"down_votes":0,"body":"The AOE shockwave would be awesome! Otherwise, I think his ult is fine.","replies":[]}]},{"poster":"Ok sure but why","date":"2017-06-03T05:11:36.864+0000","up_votes":16,"down_votes":5,"body":"Garen should *work* towards a successful ult, too. Not just spinning next to them for a few seconds or RNG making them a \"villain.\"","replies":[{"poster":"Wolfeur","date":"2017-06-03T13:19:51.988+0000","up_votes":10,"down_votes":1,"body":"The villain is absolutely not RNG…","replies":[{"poster":"Kritty","date":"2017-06-03T13:40:38.306+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Wolfeur,realm=EUW,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=00030001,timestamp=2017-06-03T13:19:51.988+0000)\n>\n> The villain is absolutely not RNG…\n\nIt kinda is, sometimes. If there are multiple carries on the enemy team with the same amount of kills, and you kill the current \"villain\", it decides which champion is the next villain by RNG. I've been the villain as a 1-kill support when mid and jungle both were 1/0 as well. It's a strange system, one I'd like more clarity on, personally.","replies":[{"poster":"Critmaster Garen","date":"2017-06-03T14:40:07.719+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Kritty,realm=NA,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=000300010000,timestamp=2017-06-03T13:40:38.306+0000)\n>\n> It kinda is, sometimes. If there are multiple carries on the enemy team with the same amount of kills, and you kill the current &quot;villain&quot;, it decides which champion is the next villain by RNG. I&#x27;ve been the villain as a 1-kill support when mid and jungle both were 1/0 as well. It&#x27;s a strange system, one I&#x27;d like more clarity on, personally.\n\nwho is the villain is decided by who has the most kills within the last 5 minutes on the enemy team.\n\nwhen your carry was executed the game looked for the next guy in line. this means out of you 3, you had the largest number of the most recent kills.","replies":[]},{"poster":"Wolfeur","date":"2017-06-03T14:06:04.794+0000","up_votes":4,"down_votes":0,"body":"> If more than one enemy has the same bounty, the enemy who received it first is marked as the Villain.\n\nhttp://leagueoflegends.wikia.com/wiki/Garen","replies":[]}]}]},{"poster":"Saianna","date":"2017-06-03T09:50:20.743+0000","up_votes":1,"down_votes":0,"body":"That's one of the issues of his whole concept. He's too straightforward and should recieve some lil rework to make him less \"spin4win\"","replies":[{"poster":"SnakDatSmilesBak","date":"2017-06-03T15:45:10.943+0000","up_votes":4,"down_votes":0,"body":"It's been spin2win since forever don't you go trying to change our oldest memes","replies":[{"poster":"Saianna","date":"2017-06-03T21:37:00.818+0000","up_votes":2,"down_votes":0,"body":"I'm not saying remove spin or win or meme. Just make it less binary and that's all :)\n\nRight now it's something like this: Press E -> look things get sliced\n\nI'm proposing: E has different effects if Garen is under his shield-buff or if he silenced his targets first, etc","replies":[{"poster":"SnakDatSmilesBak","date":"2017-06-03T21:54:50.818+0000","up_votes":2,"down_votes":0,"body":"If you meant to say spin4win so that someone would tell you the meme is \"spin2win,\" then you're very clever.","replies":[{"poster":"Saianna","date":"2017-06-03T23:02:17.457+0000","up_votes":2,"down_votes":0,"body":"actually, my brain derped x.x","replies":[{"poster":"SnakDatSmilesBak","date":"2017-06-03T23:42:45.396+0000","up_votes":2,"down_votes":0,"body":"Well it was clever how you salvaged it by saying that you meant to suggest a change to make garen less binary. Since the meme is spin2win, and u said spin4win.","replies":[]}]}]}]}]}]}]},{"poster":"Pater Gascoigne","date":"2017-06-03T08:47:50.657+0000","up_votes":8,"down_votes":0,"body":"Upon killing a villain, his surrounding allies are inspired by the justice brought upon by Garen and recieve a small speedboost. Maybe something like this?","replies":[]},{"poster":"JusticePauldrons","date":"2017-06-03T18:12:33.600+0000","up_votes":7,"down_votes":0,"body":"Garen main here, and I will say that at this moment Garen is probably in one of the better spots he has been in a while. While I will agree that Garen's ult is weaker in teamfight scenarios than a similar champion like Darius, what he brings to the table with his ultimate is the ability to effectively counter any champion who has been declared the villain. No matter who they are, they know that when that mark is above their head they are at the risk of instant death from a cursory glance. \n\nThe problem comes from when that mark is gone. I am sure many of you have experienced cases where there just _is no villain_. Sometimes this will occur during the middle of the match when the timer goes off, despite whether someone on the enemy team had gotten kills or not. I have had multiple occurrences where someone is stomping my team, and the villain mark simply vanishes. This leads to situations where the element of Garen's ult that is unique, is completely lost. Bugs aside lets get to the real meat of the issues here. \n\nNow when I look at the differences between Darius and Garen there is one thing that strikes me as the main difference in what makes one more beneficial over the other, and it might surprise you that it is not the ultimate. \n\nWhat {{champion:122}} has and what {{champion:86}} lacks is crowd control. Darius can maintain his massacre through the use of his slows and most importantly _his pull_. This allows Darius to function not only as an offensive bruiser, but a tank as well. He can peel for his team as well as wreck havoc on the enemy lines, he can initiate a fight safely, where as with Garen his only choice is to charge straight at the enemy. \n\nAm I saying we should give Garen easily accessible hard crowd control? Hell no, that would be ridiculous. But what I think we need to do is better reinforce on what Garen already capitalizes on, _mobility_ . My suggestion has been around for a while but I will throw it out again for good measure, I believe Garen's Q should leap at targets, similar to a Rengar leap it would occur while the skill is active and if he is within jumping distance, aside from that it would function as usual. I fully believe that this change alone could be what gives Garen as solid identity as a more offensive focused juggernaut than the ones that have crowd control to allow them to play safe.\n\nSo lets say that idea sounds too ridiculous for you. Perhaps eliminating his crappy engage makes him too strong against enemy backliners? Well what then? Well my next suggestion is one I feel also fits Garen's theme as a paragon of Demacia. \n\n\n\nWhat is the thing that nearly all Demacian champions have it common? Displacement. Yes nearly everyone from Demacia including \n{{champion:5}} \n{{champion:3}} \n{{champion:78}} \n{{champion:133}} \n{{champion:102}}\n{{champion:59}} \nAll have abilities that displace the enemy; whether that be isolating them, knocking them up/away this seems to be a running theme with the Demacian military, with the two exceptions being the crownguard siblings of {{champion:86}} and {{champion:99}}. \n\n\n\nMy suggestion would be to add a similar theme to Garen's _ultimate _ where upon being cast the sword would knock champions away from the impact site. This would keep more in line with the theme of the other champions as well as allow his ult a little bit of utility outside of the execution to create slightly more options during teamfights. With the crowd control being on his ultimate only, it would prevent him from abusing it with his already otherwise powerful kit. \n\n**Tl;dr:** \n\n* Put a small Rengar like leap on Garen's Q\n* Or knock champions slightly away from the impact site of his R.","replies":[{"poster":"notice me Sin pi","date":"2017-06-03T23:16:00.134+0000","up_votes":2,"down_votes":0,"body":"Rengar-like leap on Garen doesnt sound so [Might of Demacia] to me personally.\nI do think hard cc around his R fits his thematics really well tho","replies":[{"poster":"JusticePauldrons","date":"2017-06-04T01:57:31.516+0000","up_votes":2,"down_votes":0,"body":"Well....he already leaps with his q, it has both a cast time and animation for it during the auto. The only difference would be that this leap actually goes somewhere.","replies":[]}]},{"poster":"Automated Riven","date":"2017-06-03T19:40:27.626+0000","up_votes":2,"down_votes":0,"body":"What if him getting a kill or assist started his passive which would be active in combat until he is out of combat. (With champions)","replies":[]}]},{"poster":"Decrit","date":"2017-06-03T12:46:15.281+0000","up_votes":5,"down_votes":1,"body":"... why? they are 2 different champions. I agree they are temathically similar, but other than that i see no reason to keep it like that. It's like to say that Veigar needs some effect after ulting someone to death, or Syndra, or Rek'Sai, or Nocturne, or Akali, or...","replies":[{"poster":"Dale Wardark","date":"2017-06-03T12:56:52.641+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Decrit,realm=EUW,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=0012,timestamp=2017-06-03T12:46:15.281+0000)\n>\n> ... why? they are 2 different champions. I agree they are temathically similar, but other than that i see no reason to keep it like that. It&#x27;s like to say that Veigar needs some effect after ulting someone to death, or Syndra, or Rek&#x27;Sai, or Nocturne, or Akali, or...\n\nDarius and Garen are in the same class umbrella and Garen's ult is an execution, just like Darius. Garen's ult has no stat scaling, unlike Darius, Veigar, Syndra, Rek'sai, Nocturne, Akali, or...","replies":[{"poster":"Decrit","date":"2017-06-03T13:00:03.015+0000","up_votes":2,"down_votes":1,"body":"aaaaand that's a good reason to make them different.","replies":[{"poster":"Dale Wardark","date":"2017-06-03T13:02:32.929+0000","up_votes":6,"down_votes":0,"body":"Absolutely, but you miss the point that Darius has more choices and remains a greater threat than Garen solely because his ult can be used multiple times if used properly and effectively.","replies":[{"poster":"My Heartshaker","date":"2017-06-03T13:33:12.933+0000","up_votes":4,"down_votes":1,"body":"Thing is, Garen's ult does more damage than darius does, unless he gets 5 stacks of his passive on you.\n\nDarius actually NEEDS to put in work to maximize the damage on his ult, just a darius ult on its own does pitiful amounts of damage.","replies":[{"poster":"Dale Wardark","date":"2017-06-03T13:38:54.025+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=I am Undefeated,realm=EUW,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=00120000000000000001,timestamp=2017-06-03T13:33:12.933+0000)\n>\n> Thing is, Garen&#x27;s ult does more damage than darius does, unless he gets 5 stacks of his passive on you.\n> \n> Darius actually NEEDS to put in work to maximize the damage on his ult, just a darius ult on its own does pitiful amounts of damage.\n\nBut, in the same regard, Garen, solo laning, needs to put in a large amount of work to kill his enemy laner, even if they're your Villain. It's easier to proc your ult in a team fight than Darius, but Darius has much better in combat sustain.","replies":[{"poster":"chipndip1","date":"2017-06-03T16:04:50.669+0000","up_votes":4,"down_votes":2,"body":"The point is that it takes half a brain and 3/10 fingers to play Garen. There's actual variance in output to Darius's kit, so he gets *better reward for landing what could otherwise miss or be less effective.*\n\nThe issue is simple, but Garen players don't like it: Garen needs to be a harder champion. Period. Otherwise, it's tough noodles.","replies":[{"poster":"Dale Wardark","date":"2017-06-03T17:00:06.069+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=0012000000000000000100000000,timestamp=2017-06-03T16:04:50.669+0000)\n>\n> The point is that it takes half a brain and 3/10 fingers to play Garen. There&#x27;s actual variance in output to Darius&#x27;s kit, so he gets *better reward for landing what could otherwise miss or be less effective.*\n> \n> The issue is simple, but Garen players don&#x27;t like it: Garen needs to be a harder champion. Period. Otherwise, it&#x27;s tough noodles.\n\nThere's nothing wrong with mechanically simple champions. Not every champion should be on Azir's or Draven's or Elise's level. You're sort of implying Garen players play Garen because they can't play anything else that's more complicated. I love playing Garen because of his theme and his relatively uncluttered kit.","replies":[{"poster":"chipndip1","date":"2017-06-03T17:05:58.288+0000","up_votes":2,"down_votes":3,"body":"Look at old Warwick, now look at Garen. Look at what Riot did with Warwick, thus making new Warwick, and now look at how we DIDN'T do that for Garen.\n\nIf you can't put the pieces together at this point then color me surprised.","replies":[{"poster":"Dale Wardark","date":"2017-06-03T17:14:25.770+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=001200000000000000010000000000000000,timestamp=2017-06-03T17:05:58.288+0000)\n>\n> Look at old Warwick, now look at Garen. Look at what Riot did with Warwick, thus making new Warwick, and now look at how we DIDN&#x27;T do that for Garen.\n> \n> If you can&#x27;t put the pieces together at this point then color me surprised.\n\nWarwick had an activateable passive on his w, a toggle passive in his e, an ult that was hard cc plus damage. Old Warwick was outdated and useless before six. Garen has at least some breakdown of ability combinations that can be worked around.","replies":[]}]}]}]}]}]},{"poster":"Decrit","date":"2017-06-03T13:23:53.282+0000","up_votes":2,"down_votes":0,"body":"Darius has different choices than Garen, and arguabily has more than Garen overall, but not only because of the ult.\n\nAgain, because they are different champions. They even do core different things even if they are of the same class.","replies":[{"poster":"Dale Wardark","date":"2017-06-03T13:33:54.891+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Decrit,realm=EUW,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=00120000000000000000,timestamp=2017-06-03T13:23:53.282+0000)\n>\n> Darius has different choices than Garen, and arguabily has more than Garen overall, but not only because of the ult.\n> \n> Again, because they are different champions. They even do core different things even if they are of the same class.\n\nThe solution to all our problems appears to be a rework of Garen lol","replies":[{"poster":"JusticePauldrons","date":"2017-06-03T18:41:48.846+0000","up_votes":1,"down_votes":0,"body":"He really does not need a major rework. At best he needs a tweak to solidify what kind of role riot wants for him. Should he be a tank? Give him crowd control then. Should he be the kind of guy who rushes the enemy back lines? Give him a better initiation then but no crowd control. \n\nI think either a Rengar-like leap when within range on his Q would be best to solidify his role as the guy who jumps into the thick of it just do damage. \n\nBut if they wanted to give him some level of crowd control without over blowing it I would say some kind of displacement on his ultimate like the other Demacian champions would work really well. Something like \"other enemy champions are knocked away from the impact site\" and have it only affect a small area around the targeted champion to separate clusters of enemies.","replies":[{"poster":"chipndip1","date":"2017-06-03T19:44:04.309+0000","up_votes":2,"down_votes":1,"body":"If Garen was going to be a tank, he'd need a ton of damage removed and cc added. If he was gonna be a diver, he'd need a full on dash.\n\nHalf-assing changes isn't going to fix Garen. Garen's basically the new \"old Poppy\". I'm fully prepared to see Garen complained about until a major game play update is announced or people don't care anymore.","replies":[{"poster":"JusticePauldrons","date":"2017-06-03T22:49:12.781+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=00120000000000000000000000000001,timestamp=2017-06-03T19:44:04.309+0000)\n>\n> If Garen was going to be a tank, he&#x27;d need a ton of damage removed and cc added. If he was gonna be a diver, he&#x27;d need a full on dash.\n\n\nAt this point it just seems like your shit posting for the sake of it. You literally repeated my points back to me, then told me my solutions were half assed that literally included the exact things you said he needed. From your other posts you clearly want some kind of massive rework that even you don't know the details of, so at this point your repeated comments are essentially \"This champ needs a complete rework because Poppy and Warwick got one\". Garen is for most purposes, fine as he is. There is nothing incredibly wrong with his kit, but due to the fact he has no crowd control you will likely not see him at high levels of play where other champions can trade less damage for much better team fighting potential. \n\nSo unless you have an actual suggestion, comment, concern or point to make, I don't see why you are still here complaining about a champion to the point where you would make your own whine thread in response to one, because I guess people discussing improvement on a champion \"not in your elo\" for some reason tilts you off the face of earth.","replies":[]}]},{"poster":"Dale Wardark","date":"2017-06-03T18:53:54.013+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JusticePauldrons,realm=NA,application-id=3ErqAdtq,discussion-id=ZOagcpgx,comment-id=0012000000000000000000000000,timestamp=2017-06-03T18:41:48.846+0000)\n>\n> He really does not need a major rework. At best he needs a tweak to solidify what kind of role riot wants for him. Should he be a tank? Give him crowd control then. Should he be the kind of guy who rushes the enemy back lines? Give him a better initiation then but no crowd control. \n> \n> I think either a Rengar-like leap when within range on his Q would be best to solidify his role as the guy who jumps into the thick of it just do damage. \n> \n> But if they wanted to give him some level of crowd control without over blowing it I would say some kind of displacement on his ultimate like the other Demacian champions would work really well. Something like &quot;other enemy champions are knocked away from the impact site&quot; and have it only affect a small area around the targeted champion to separate clusters of enemies.\n\nI really enjoyed building Garen full tank with a, Sunfire before the tank update, but now it feels better building Deadmans or BC first","replies":[]}]}]}]}]}]}]}]},{"poster":"lich Roland","date":"2017-06-03T08:12:33.506+0000","up_votes":2,"down_votes":1,"body":"Activating his passive for 2 seconds for the team would be cool","replies":[{"poster":"Cowseed","date":"2017-06-03T17:36:49.368+0000","up_votes":4,"down_votes":0,"body":"Doesn't that make him like fiora though?","replies":[]}]},{"poster":"Joseraph","date":"2017-06-03T16:27:10.182+0000","up_votes":4,"down_votes":0,"body":"They should get rid of the stupid Villain mechanic, and give his ult some real power. I've seen squishy villains get popped from Q>R","replies":[]}]}