{"poster":"Vileblood Pyke","date":"2015-07-30T01:58:33.521+0000","title":"[Fanfic] Storia su Tahm Kench - Bilgewater","subforum":"Creazioni della community","up_votes":4,"down_votes":3,"body":"In una notte come un&#039;altra a Bilgewater, tra le bische clandestine, gli assi pi&ugrave; numerosi del normale, le pistole e il rum, un giovane senza futuro viene sbattuto fuori da una taverna tra le peggiori nei bassifondi dell&#039;isola. Eccolo rialzarsi e barcollare, ubriaco marcio e senza neanche un serpente d&#039;argento in tasca.\nDa un vicolo, una voce lo chiama: \"Eccoti qui, ragazzo!\"\nIl sangue gli gela nella vene. Riconosce quella voce.\n**Tutti** a Bilgewater conoscono **quella** voce.\n\"Gangplank!\" si volta spaventato il ragazzo.\n\"Tu hai un debito, mi pare.\" dice il vecchio pirata, avvicinandosi con passo sicuro e calcolato.\n\"Pagher&ograve;, lo giuro.\" urla terrorizzato il giovane, cercando di mantenere le distanze.\n\"Certo che pagherai...con l&#039;oro o con il sangue.\" dice Gangplank sguainando la sua sciabola, che sembra quasi prendere fuoco a contatto con l&#039;aria, dando al gi&agrave; temibile pirata un&#039;aria davvero spaventosa.\nIl ragazzo inizia a correre, terrorizzato. Deve allontanarsi. Deve scappare da Bilgewater. Nessuno in citt&agrave; si prenderebbe la briga di proteggerlo ed aiutarlo.\nSi volta per vedere se il pirata lo sta inseguendo. Vede il fuoco della lama di Gangplank avvicinarsi sempre pi&ugrave;.\nDestra, sinistra, sul pontile, scivola, salta barili e barche, schiva i ratti. L&#039;alcol gli fa brutti scherzi, prende male le distanze. Inciampa. Si rialza. Sente volare vicino alla nuca i proiettili di Gangplank. \"La fortuna &egrave; dalla mia, stavolta...\" pensa il giovane, correndo tra i vicoli.\nContinua a muoversi nell&#039;oscurit&agrave;, finch&eacute; la sua fuga finisce ad un molo. Nessun posto dove correre, nessun luogo sicuro in cui nascondersi.\nLe acque nere sono illuminate dal riflesso della luna, mentre squali e pesci diavolo sono in attesa dell&#039;ultima vittima del Re dei pirati.\n\"Ehi, ragazzo!\" una voce suadente sembra chiamarlo dall&#039;acqua \"So che non hai tempo da perdere, quindi ecco la mia proposta: io ti salvo dall&#039;uomo a cui devi dei soldi in cambio di un pasto caldo.\"\n\"C-Chi sei?\" chiede il giovane, spaventato dall&#039;idea di avere altri debitori.\n\"Bimbo mio, non &egrave; importante adesso\" risponde la strana creatura \"accetti l&#039;accordo o preferisci farti trapassare da parte a parte come uno spiedino?\"\nGangplank si sta avvicinando, le sue imprecazioni hanno attirato una folla di suoi seguaci. Il ragazzo non ha possibilit&agrave; di fuggire: **deve** accettare!\n\"ACCETTO, PORTAMI VIA DA GANGPLANK!\" urla alla creatura.\n\"Perfetto, ti porter&ograve; nel luogo dove vuoi davvero andare.\" detto questo, una bocca gigantesca esce dall&#039;acqua e una lingua mostruosa afferra il giovane, per portarlo nelle profondit&agrave;.\n\"Dove &egrave; finito quel lurido topo di fogna?\" domanda Gangplank.\n\"Avr&agrave; preferito buttarsi a mare, tra gli squali, piuttosto che pagare.\" afferma uno dei suoi uomini, notando uno strano movimento dei predatori acquatici.\n\"Che questo sia di lezioni per tutti: solo la morte vi salver&agrave; da **ME**!\" conclude Gangplank, con una grassa risata.\n\nMolto distante dal Re dei pirati, la strana creatura emerge. Sputa il giovane, che prende fiato, riposandosi sull&#039;erba.\n\"Che cosa sei tu?\" domanda il giovane incuriosito guardando il suo strano salvatore \"e dove mi hai portato?\"\n\"C&#039;&egrave; chi mi chiama demone, chi Re del fiume... Sono semplicemente un gentiluomo con dei gusti raffinati.\" il gigantesco pesce-mostro si aggiusta con fierezza la giacca \"e ti ho portato da **tuo padre**.\"\n\"Mio padre?\" ripete il giovane \"Non l&#039;ho mai conosciuto.\"\n\"Lo puoi trovare poco pi&ugrave; in l&agrave;...\" risponde la creatura, indicando la direzione da seguire.\nIl giovane si alza e in pochi passi raggiunge una serie di lapidi.\n\"Quella di tuo padre &egrave; quella in mezzo\" aggiunge la creatura.\nIl giovane crolla in ginocchio di fronte alla lapide del genitore che non ha mai conosciuto.\n\"Io non ho niente, non ho nessuno, sono un fallimento... Cosa potrebbe andare peggio?\"\n\"Potresti non avere addosso il delizioso sapore della disperazione\" aggiunge il demone alle sue spalle.\nIl ragazzo si volta, appena in tempo per vedere le spaventose fauci di Tahm Kench spalancarsi e divorarlo, facendo a pezzi le sue ossa e banchettando con la sua carne.\n\n\"Forse avrei dovuto lasciarlo cuocere un po&#039; dal vecchio pirata, ma il sapore non era affatto male.\" afferma Tahm Kench, prima di sparire di nuovo nelle nere acque da dove &egrave; venuto, aspettando la sua prossima vittima.\n\n**MAI** fare accordi con Tahm Kench!\n\n{{champion:432}} **LINKS**\n Hai scritto altro? [Racconti di un Esperimento Zaunita](http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/LtEbvt8A-fanfic-racconti-di-un-esperimento-zaunita) e [Racconti di un Esperimento Zaunita - Incubi e Misteri](http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/BAbThO0p-fanfic-racconti-di-un-esperimento-zaunita-incubi-e-misteri).\nEsiste un posto dove sono raccolte tutte le fanfic del forum italiano? [La Biblioteca](http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/dvvixXez-piccola-biblioteca-alessandrina?show=new).","replies":[{"poster":"Polarize","date":"2015-08-04T11:01:18.815+0000","up_votes":2,"down_votes":1,"body":"0/10\n\n\n\nPebble not proud","replies":[]},{"poster":"iBox360","date":"2015-08-04T10:00:57.004+0000","up_votes":1,"down_votes":0,"body":"Mi ha un pò deluso il finale, ma comunque è bellissima! I <3 {{champion:223}}","replies":[]},{"poster":"Azharidan","date":"2015-07-30T13:03:48.959+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, anche se la storia è stata ben realizzata vedo Tahm kench come uno che gode delle sofferenze altrui, infatti nel suo trailer fa vedere che salva il ragazzo, come promesso, ma si mangia tutto ciò che ha ricevuto in cambio del patto godendo quindi della sua sofferenza, quindi praticamente, salvare il ragazzo di questa storia per poi mangiarlo non avrebbe molto senso, dato che alla fine tahm kench è uno che rispetta le promesse pattuite.\nPoi la cosa del parente che non conosce morto lo trovo un pò inadeguato .\nApparte questo , bella storia .","replies":[]}]}