{"poster":"Octragon","date":"2016-11-06T10:48:24.427+0000","title":"Spielverhinderung ETP gegen Rainbowpwnies","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":1,"body":"Guten Morgen/Mittag/Abend meine Damen und Herren\r\n\r\nLeider steht ETP vor dem Problem das 3 unserer mitglieder am angesetzten Termin f&uuml;r unser Match mit arbeitenden Pflichten verhindert sind.\r\nBisher war es mir leider noch nicht m&ouml;glich den Teamleiter unserer Mitspieler zu erreichen, dennoch wollte ich hiermit m&ouml;glichst schnell mitteilen das es uns nicht m&ouml;glich sein wird heute noch anzutreten, gerne aber nehmen wir einen neuen Termin wahr.\r\nSofern dieser fr&uuml;h genug bekannt gegeben wird sollte es unsererseits auch keine weiteren Schwierigkeiten geben\r\n\r\nMFG\r\n\r\nOctragon","replies":[{"poster":"Octragon","date":"2016-11-06T12:48:42.053+0000","up_votes":1,"down_votes":0,"body":"Habe soeben noch Kontakt mit dem Teamleiter von Rainbow aufgenommen, da es uns nicht möglich ist heute zum spiel anzutreten wurde unsererseits eine Verschiebung vorgeschlagen die jedoch abgelehnt wurde.\n\nWeiteres vorgehen hinsichtlich dessen sein nun den oberen Instanzen überlassen.","replies":[{"poster":"Cunctor","date":"2016-11-06T12:56:22.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Octragon,realm=EUW,application-id=U1AH627U,discussion-id=nb0yy568,comment-id=0001,timestamp=2016-11-06T12:48:42.053+0000)\n>\n> Habe soeben noch Kontakt mit dem Teamleiter von Rainbow aufgenommen, da es uns nicht möglich ist heute zum spiel anzutreten wurde unsererseits eine Verschiebung vorgeschlagen die jedoch abgelehnt wurde.\n> \n> Weiteres vorgehen hinsichtlich dessen sein nun den oberen Instanzen überlassen.\n\nWenn ihr zum angesetzten Zeitpunkt nicht könnt und eure Gegner einer Verschiebung nicht zustimmen, wird euch das als Niederlage angerechnet. Ihr habt noch bis zum Spieltermin Zeit, ein vollständiges Team auf die Beine zu stellen, ansonsten gewinnen eure Gegner, wenn sie vollständig antreten.\n\nLG\nCunctor","replies":[{"poster":"L3GE ART1S","date":"2016-11-06T13:10:04.849+0000","up_votes":1,"down_votes":0,"body":"Hi ich bin die Teamleiterin der Rainbowpwnies\n\nDa Octragons Team erst nächstes Wochenende spielen wollte / konnte, mussten wir leider ablehnen den Termin zu verschieben.\n\nKönnen wir nun also damit rechnen, dass wir nicht spielen werden um 18:00 Uhr? Auch nicht kurzfristig?\nNicht, dass ich jetzt meinem Team absage für heute und es dann trotzdem geht und wir dann die Niederlage haben weil wir damit gerechnet haben nicht spielen zu können.\n\nLiebe Grüsse\n\nL3GE ART1S","replies":[{"poster":"Cunctor","date":"2016-11-06T13:16:45.390+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=L3GE ART1S,realm=EUW,application-id=U1AH627U,discussion-id=nb0yy568,comment-id=000100000000,timestamp=2016-11-06T13:10:04.849+0000)\n>\n> Hi ich bin die Teamleiterin der Rainbowpwnies\n> \n> Da Octragons Team erst nächstes Wochenende spielen wollte / konnte, mussten wir leider ablehnen den Termin zu verschieben.\n> \n> Können wir nun also damit rechnen, dass wir nicht spielen werden um 18:00 Uhr? Auch nicht kurzfristig?\n> Nicht, dass ich jetzt meinem Team absage für heute und es dann trotzdem geht und wir dann die Niederlage haben weil wir damit gerechnet haben nicht spielen zu können.\n> \n> Liebe Grüsse\n> \n> L3GE ART1S\n\nHallo L3GE ART1S,\nbitte haltet euch heute um 18:00 Uhr trotzdem bereit, das Spiel zu bestreiten, denn bis dahin hat Octragon theoretisch Zeit, doch noch ein Team auf die Beine zu stellen. Außerdem habt ihr nach den Regeln ebenfalls verloren, wenn ihr zum Spieltermin nicht zu fünft anwesend seid. \n\nLG\nCunctor","replies":[{"poster":"L3GE ART1S","date":"2016-11-06T17:02:59.056+0000","up_votes":1,"down_votes":0,"body":"Also wir sitzen jetzt zu fünft in der Lobby, aber vom gegnerischen Team ist niemand hier.\n\nIch nehme an es wird nicht gespielt?","replies":[]}]}]}]}]},{"poster":"Octragon","date":"2016-11-06T13:00:57.014+0000","up_votes":1,"down_votes":0,"body":"Da es und wohl oder übel unmöglich ist auch nur ein halbes team bis zum termin aufzustellen ist dies wohl ein recht kampfloser untergang für ETP danke dennoch für die rasche antwort","replies":[{"poster":"GummibaumXYZ","date":"2016-11-06T13:10:45.752+0000","up_votes":1,"down_votes":0,"body":"Hallo Octragon,\n\nda ihr bisher noch kein Spiel verloren habt, habt ihr durch das Doppel-K.O-System im Verliererbracket ja trotzdem noch die Chance euch für die Endrunde zu qualifizieren.\n\nVielleicht könnt ihr in der Zwischenzeit ja noch ein paar Ersatzspieler finden und anmelden, damit so etwas nicht wieder passiert.\n\nLieben Gruß\nGummibaumXYZ","replies":[]}]},{"poster":"Cunctor","date":"2016-11-06T10:57:55.409+0000","up_votes":1,"down_votes":0,"body":"Hallo Octragon,\njede Terminverschiebung muss von euch mit euren Gegnern ausgemacht werden - Wenn ihr den Teamleiter der Gegner nicht erreicht, könnt ihr versuchen, über ein anderes Mitglied Kontakt aufzunehmen, aber ich kann natürlich nicht versprechen, dass das von Erfolg gekrönt sein wird.\nAufzwingen können wir euch jedenfalls keinen anderen Termin.\n\nLG\nCunctor","replies":[]}]}