{"poster":"NobodyLikeRito","date":"2019-03-06T18:52:50.733+0000","title":"Immernoch keine Seasonbelohnung erhalten, fühle mich gescammt","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich sag hier nicht viel zu. Ich spiele derzeit auf EUNE und war am Seasonende Honorstufe 1 und habe mich bis zum 11.2 auf 2 zurückgespielt und warte seitdem auf meine Reward. Auch von Support gibt es derzeit keine Antwort. \r\nDaher bitte ich nen Riotler, der das hier liest : MACH BITTE ETWAS. Das ist Scam.","replies":[{"poster":"ImTheFox115","date":"2019-03-06T19:05:44.139+0000","up_votes":1,"down_votes":0,"body":"Was für eine Belohnung denn?\nDer Skin ist Shit und den Rahmen bekommst du nur ganz unauffällig angezeigt...","replies":[{"poster":"NobodyLikeRito","date":"2019-03-06T19:08:15.843+0000","up_votes":1,"down_votes":0,"body":"Ich hab 20 euro für den Wechsel nach Eune gezahlt und zahle 20 für den Weg zurück nach EUW :D das mit dem Qualifizieren für den 11.2 kam ein paar Tage später. von Daher muss sich das lohnen auch wenn der Skin nicht der schönste ist. mir gehts eher um den Champ :D","replies":[{"poster":"00 M4ddin 00","date":"2019-03-07T06:32:44.787+0000","up_votes":1,"down_votes":0,"body":"Also zahlst du 40€ um einen champ zu bekommen der für was 4800 be zu haben ist ? .... wp","replies":[]}]}]},{"poster":"This is Destıny","date":"2019-03-06T19:02:45.610+0000","up_votes":1,"down_votes":0,"body":"Scheint so als wüsstest du nicht was Scam ist ! Du hast ja kein Geld oder anderes gegeben.","replies":[{"poster":"NobodyLikeRito","date":"2019-03-06T19:03:53.273+0000","up_votes":1,"down_votes":0,"body":"Nur einige Stunden in LoL, die ich hätte sinnvoller nutzen können.","replies":[{"poster":"This is Destıny","date":"2019-03-06T22:57:27.378+0000","up_votes":1,"down_votes":0,"body":"Ja is aber nicht die Schuld von Riot xD","replies":[]}]}]},{"poster":"Yatsuki","date":"2019-03-06T19:03:44.582+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\ndu bekommst deine Rewards nur wenn du lediglich höchstens **EINE** Chatsperre während der letzten Season hattest. Kann es sein, dass du mehr Strafen erhalten hast? Das wäre die einzig logische Schlussfolgerung.\n\n> * Wenn du **nur** in der vergangenen Saison mit einer **Chateinschränkung** bestraft wurdest und auf Ehrungsstufe 0 oder 1 zurückgefallen bist, bekommst du die Möglichkeit, bis 11.Februar 2019 wieder Ehrungsstufe 2 zu erreichen. Wenn du bis zu diesem Zeitpunkt wieder Ehrungsstufe 2 erreichst, bekommst du alle Belohnungen, die du dir mit Blut, Schweiß und Tränen erkämpft hast.\n> \n> * Das gilt jedoch nicht für Fälle von schwerwiegenderen Strafen wie 2-wöchige Sperren, die Verwendung von Bots/Cheats, eine Manipulation der ELO-Wertung oder dauerhafte Sperrungen. Wenn du neben deiner Chateinschränkung noch eine andere Strafe erhalten hast, bist du nicht berechtigt, an diesem Angebot teilzunehmen.  \n\nGruß Yatsuki","replies":[{"poster":"NobodyLikeRito","date":"2019-03-06T19:06:48.727+0000","up_votes":1,"down_votes":0,"body":"Also auf Euw war ich eh Ehrungstufe 0. Ich habe dann kurz vor dem Seasonende auf EUNE eine bekommen, aber habe sie direkt abgespielt und war, bevor die Season endete, nicht mehr für Rewards gesperrt. Desweiteren hatte ich während der Preseason eine Sperre, die aber ein Fehler des Systems war und von einem Supporter behoben wurde. Ich hatte mich bis zum 11.2.2019 für die Reward qualifiziert mit Honorstufe2 und Gold5 auf EUNE.","replies":[{"poster":"Yatsuki","date":"2019-03-06T19:09:49.731+0000","up_votes":1,"down_votes":0,"body":"Dann musst du wohl auf die Antwort des Supports warten. Dort dauert es aktuell nur länger. Ich kann dir nicht sagen ob dieses Angebot auch auf EUNE Servern gilt, ich weiß es lediglich von EUW.","replies":[{"poster":"NobodyLikeRito","date":"2019-03-06T19:13:32.384+0000","up_votes":1,"down_votes":0,"body":"Oh was??? Das gilt laut deinem Wissensstand nur für EUW? Verdammt, ich google mal. Danke für diese Antwort, die könnte mich eventuell voran bringen.","replies":[{"poster":"Yatsuki","date":"2019-03-06T19:16:17.529+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir hier noch den offiziellen Post zu dem ganzen Verlinken. Mehr hab ich nicht. Hätte aber auch nichts von dem Angebot in anderen Regionen gelesen :) \nhttps://boards.euw.leagueoflegends.com/de/c/ankundigungen-de/BdbwXydv-ehrungsvoraussetzung-far-belohnungen-zum-saisonendea-aktualisierung","replies":[{"poster":"NobodyLikeRito","date":"2019-03-06T19:18:46.878+0000","up_votes":1,"down_votes":0,"body":"Würde sich aber echt unfair anfühlen, wenn es nur für euw gilt.","replies":[]}]}]}]}]}]}]}