{"poster":"SNAKELION","date":"2016-09-15T19:19:44.718+0000","title":"Riot nerf a yasuo urgente...puedo dar posibles consejos para el nerf...","subforum":"Charlas Generales","up_votes":3,"down_votes":14,"body":"Yasuo....ese personaje que con 2 items mata a todo un equipo el solo.... es uno de los personajes mas molestos de league of legends...y necesita un nerf urgente incluso perdiendo linea, ir 0/20/5, puede matar sin problemas al carry no importa lo fedeado que este est&eacute;... puedo dar algunos consejos de como podr&iacute;a ser su nerf... en primer lugar... su movilidad en early game... la E...cd de 0,3 sec podr&iacute;a ser de 1 / 1.5 sec reduciendose por nivel 1,5 - 1 - 0,8 - 0,6 - 0,3 asi se reduce la movilidad en early game; La Q no esta mal eso no es necesario cambiarlo o se arruinar&iacute;a el champ completamente la W que deje cruzar algunas skills por que a algunos campeones no les deja hacer absolutamente nada con ese maldito muro... y lo mas importante la pasiva.... en lugar de doblar la cantidad de critico podria aumentarlo un 50% en lugar del 100% asi estaria obligado a comprar minimo 3 items de critico para completar su 100% y bajar su da&ntilde;o por critico de 10% menos a 20% por que es lo que lo hace imparable en late, su da&ntilde;o y si lleva sanginaria o la maestria del robo de vida es lo que le salva...espero que los de riot lean esto y almenos hagan los de la pasiva por que en serio ese champ es muy problematico con esos da&ntilde;os actuales...asta en early pega demasiado...se que algunos opinaran lo contrario de que es muy dificil y tal... pero expreso mi opinion respecto a ese champ y lo que podrian cambiarle.\r\npd:(disculpen si hay muchas faltas ortogr&aacute;ficas :v)","replies":[{"poster":"Vaendrys","date":"2016-09-15T19:24:52.123+0000","up_votes":6,"down_votes":2,"body":"Me alegro de que no estés en el equipo que balancea campeones.","replies":[{"poster":"SNAKELION","date":"2016-09-15T19:36:08.584+0000","up_votes":3,"down_votes":1,"body":"di una opinión de lo que podría ser para balancearlo un poco. Ese campeón esta completamente debalanseado y me parece logico hacer algo como lo que escribi ahí, mucho menos potente en early pero en late hace casi la misma cantidad de daño","replies":[{"poster":"Vaendrys","date":"2016-09-15T19:43:45.638+0000","up_votes":2,"down_votes":1,"body":"Distes la opinion de como dejarlo bien en el pozo.Yasuo actualmente no esta tan desbalanceado.Lo que daba un poco de asco era su build tanke que pegaba demasiado,y aguantaba mucho,pero esa build ya no es viable,y el yasuo full daño es un asesino mas,facil de contrarrestar.","replies":[{"poster":"SNAKELION","date":"2016-09-15T20:02:57.063+0000","up_votes":1,"down_votes":0,"body":"no tanto en el pozo un 10% menos de daño critico se compensa con el filo del infinito y con lo del 50% de aumento de critico en lugar del 100% bueno asi se usarian mas las runas de critico y aumento de critico que ya estaban en el olvido tecnicamente y con 3 items de critico tendria el 100% (podria ser bailarin espectral, daga static, y filo del infinito) y ademas la static da mucho daño...200 al dar un critico y con valecidad de ataque que se alcanza no estaría mal y con lo de facil de contrarrestar eso no es tan correcto... los stuns normalemente o los mas usados son skillshots (q morgana, q de lux, etc.) y se paran con el muro si es bien usado claro","replies":[{"poster":"DLeonel99","date":"2016-09-15T22:03:17.360+0000","up_votes":1,"down_votes":0,"body":"en la pasiva dice, hace un 10% menos de daño critico por mas que tenga filo infinito, un randuin hace que yasuo no haga nada directamente","replies":[]}]}]}]}]},{"poster":"Gaunits","date":"2016-09-15T20:03:38.026+0000","up_votes":2,"down_votes":1,"body":"si el adc se posiciona mal si lo deletea de dos basicos :v hay que saber jugarle nomas","replies":[{"poster":"SNAKELION","date":"2016-09-15T20:06:23.398+0000","up_votes":1,"down_votes":0,"body":"si es verdad aunque igual no es tan dificil llegarle, si es por linea por la movilidad entre subditos enemigos y eso :v","replies":[{"poster":"Gaunits","date":"2016-09-15T23:00:39.592+0000","up_votes":1,"down_votes":0,"body":"cuando tenes un yasuo no te acercas a los minions :v a menos que tengas un supp con mucho cc como leona, ahi yasuo no tiene nada que hacer","replies":[]}]}]},{"poster":"Anung Un Rama a","date":"2016-09-15T20:32:59.288+0000","up_votes":1,"down_votes":0,"body":"La w no frena todo, por ejemplo los ataques que consisten en lasers, como el rayo de Viktor o la definitiva de Lux. Tampoco aquellos que no van de frente al personaje, como los ataques de area de Brand, Miss Fortune y la definitiva de Kog'Maw.","replies":[{"poster":"SNAKELION","date":"2016-09-15T20:36:37.733+0000","up_votes":1,"down_votes":0,"body":"de hecho frena la E de victor su q lo que no frena es su ulti... tambien frena la q de lux la ulti de mf... bran es buen couenter de yasuo pero con la movilidad puede evitar todas las skills","replies":[{"poster":"Anung Un Rama a","date":"2016-09-18T02:05:15.200+0000","up_votes":1,"down_votes":0,"body":"No hablaba de la ulti de MF, sino de su E. Y de ese modo hay bastantes mas skills que no pueden ser evitadas con el muro de Yasuo.","replies":[]}]}]},{"poster":"Rick Hunt3r","date":"2016-09-16T16:09:21.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SNAKELION,realm=LAS,application-id=v7qsfXsE,discussion-id=EyNwbj0t,comment-id=,timestamp=2016-09-15T19:19:44.718+0000)\n>\n> Yasuo....ese personaje que con 2 items mata a todo un equipo el solo.... es uno de los personajes mas molestos de league of legends...y necesita un nerf urgente incluso perdiendo linea, ir 0/20/5, puede matar sin problemas al carry no importa lo fedeado que este est&amp;eacute;... puedo dar algunos consejos de como podr&amp;iacute;a ser su nerf... en primer lugar... su movilidad en early game... la E...cd de 0,3 sec podr&amp;iacute;a ser de 1 / 1.5 sec reduciendose por nivel 1,5 - 1 - 0,8 - 0,6 - 0,3 asi se reduce la movilidad en early game; La Q no esta mal eso no es necesario cambiarlo o se arruinar&amp;iacute;a el champ completamente la W que deje cruzar algunas skills por que a algunos campeones no les deja hacer absolutamente nada con ese maldito muro... y lo mas importante la pasiva.... en lugar de doblar la cantidad de critico podria aumentarlo un 50% en lugar del 100% asi estaria obligado a comprar minimo 3 items de critico para completar su 100% y bajar su da&amp;ntilde;o por critico de 10% menos a 20% por que es lo que lo hace imparable en late, su da&amp;ntilde;o y si lleva sanginaria o la maestria del robo de vida es lo que le salva...espero que los de riot lean esto y almenos hagan los de la pasiva por que en serio ese champ es muy problematico con esos da&amp;ntilde;os actuales...asta en early pega demasiado...se que algunos opinaran lo contrario de que es muy dificil y tal... pero expreso mi opinion respecto a ese champ y lo que podrian cambiarle.\n> pd:(disculpen si hay muchas faltas ortogr&amp;aacute;ficas :v)\n\n\nMe parece o no leiste el ultimo parche...... Acaban de nerfeara yasuo, y te puedo asegurar que se nota,..... Yasuo es un champ itendependiente en extremo y mas alla de lo que muchos que no juegan Yasuo hablan, es un champ que si no tiene minions carece de mobilidad un cc y chau yasuo, el muro sirve si, pero hay un monto de habilidades queno las detiene. Puede deletear a todo el equipo el solo, si! pero tiene que ir overfed y tenes que tener buenas mecanicas, algo que requiere muuuuuuucho timepo, de echo hay muchisimos mas campeones que requieren menos mecanicas y con mas potencial de carreo. El problema es que la gente no sabe jugarle, se paran todos en fila o se escapan corriendo alado de la fila de minions para que yasuo pueda chasearlos, le pushean la linea y se quedan alado de los minions, para que el yasuo baile cargue la Q y te detone..... Hay mil cosas que veo que la gente hace mal... Saes el tiempo que lleva aprender a saltar las paredes de los camps de jg??? No te quejes de un champ que no esta ROTO ni mucho menos, que si en fase de lineas no farmea y no saca unos cuantos kills lo mas probable es que se convierta en un minion.... Es un campeon como se lo suele llamar, Alto riesgo, Alta recompensa. O terminas con 20 kills o terminas con 20 muertes.... Te reto a que intentes masteriarlo paraque entiendas que no necesita un nerf.","replies":[]},{"poster":"Tamer 01","date":"2016-09-15T22:11:19.792+0000","up_votes":1,"down_votes":0,"body":"Es mas facil counterearlo para que nerfearlo?","replies":[]},{"poster":"SuperLoky","date":"2016-09-15T20:40:19.585+0000","up_votes":1,"down_votes":0,"body":"Solo te voy a decir una cosa, Yasuo esta mas cerca de un Buff que de un Nerf ( el yasuo normal no el yasuo tanke aclaro )","replies":[{"poster":"SNAKELION","date":"2016-09-15T20:53:33.280+0000","up_votes":1,"down_votes":0,"body":"por?\nah, eres main yasuo...con razon lo dices 7.7 ....","replies":[]},{"poster":"SNAKELION","date":"2016-09-15T20:52:25.242+0000","up_votes":1,"down_votes":0,"body":"por?","replies":[]}]},{"poster":"Salvor","date":"2016-09-15T19:47:49.297+0000","up_votes":1,"down_votes":1,"body":"El campeón esta desbalanceado, es un hecho, apoyo la moción con toda violencia + 1 lince.","replies":[]}]}