{"poster":"Omni Presents","date":"2015-09-09T14:57:52.265+0000","title":"AFK's GONE MAD AFK's GONE MAD AFK's GONE COMPLETLEY MAD... Ranked discussion","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"And here is the solution you have allllllll been waiting for on what to do with all those AFK in ranked.\r\n\r\nOK, so here we have the low ranking queue, generally those 12 year old&#039;s who can&#039;t play, no, refuse to play unless they get the role they want, get lots of ganks, get fed, get all the CS and you know the drill, BRONZE and SILVER!\r\n\r\nSo here is the deal, I vote as such, if you have an AFK ANYWHERE on the team for more than X amount of minutes before the game ends, or X amount of minutes total just in case you have an AFK that comes back when it is pointless, DO NOT ALLOW THE GAME TO AWARD LP.\r\n\r\nGive the win or the lose, but lose prevented. It is NOT fair on anyone to have an AFK, it is especially not fair to have FOUR AFK. I hate losing when it is not my fault, I hate winning when it is not a deserved win. But you ask, &quot;What happens if someone just goes AFK for X minutes, the team surrenders and no lose on the other 4?&quot;\r\n\r\nGet some low level accounts, join the Gold/Diamond ranks with a duo, if you are about to lose, just AFK the low rank, right? WRONG! So terribly wrong.\r\n\r\nSo here it is, get an AFK, no LP gained or lost, still get the win or lose, but nothing other than stats in a game that meant nothing. Next, to deal with those who purposely screw you over just by AFK so they get no LP problems, this is what we do.\r\n\r\nFor every AFK you get leave busted for you get a mark against your name that decays over time. Each mark in that respective queue will disable the queue from there up and stop you playing in that queue for that many marks. If you DC, one mark, if you AFK 2, 3, 5, 8 times in a game, you get that many marks. So if you AFK in ranked, you cannot play X amount of ranked games until you have played that many games in another queue.\r\n\r\nIf you AFK in normals, you cannot play normals or ranked, you have to either wait for the decay, or choose another queue to play in. The same goes for reports, if you get reported for the same issue enough times, start placing the same marks against your name. But here is the kicker, every queue you get a mark in, that stops you playing ranked no matter what.\r\n\r\nGet a mark in ARAM? Can&#039;t play ARAM or ranked until the mark is gone. Get a mark in Bots? Can&#039;t play Bots, normals or ranked. The same for TT.\r\n\r\nThis will give you a chance that if you are a little shit, get reported, go AFk or anything against the rules, it will stop you playing ranked and allow those who genuinely want to play and try their best to rank up to do so without interruptions. If you are just bad? Oh well, that we will deal with, but if you do something that ruins the game, that can be changed.\r\n\r\nTL;DR\r\nYou go AFK or get reported in ranked, there should be some system in place that stops you from playing X amount of ranked games, but still choose other queues.","replies":[{"poster":"Hyde","date":"2015-09-09T20:32:16.089+0000","up_votes":1,"down_votes":0,"body":"This sounds like a good idea, ranked is too precious to have the trolls of the game swarming all over it. My friend got disconnected from internet issues and everyone must have reported him because he got a 20 min extra wait for his games which would hurt so bad, so I mean there are things in place already but I think it is a very good idea to disable ranked ques while you have an infringement again your name. good thinking :)","replies":[]}]}