{"poster":"Marcus Phillida","date":"2015-12-20T18:11:43.041+0000","title":"Neue Schützen zu Stark?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Hey Leute,\r\n\r\nwas haltet ihr von den neuen Sch&uuml;tzen?\r\nich habe Heute ein Spiel als{{champion:54}} gespielt und hatte auch schon{{item:3110}} {{item:3068}} {{item:3742}} .\r\nTrotzdem killt mich eine Vayne mit 6 Autoattacks(und ich bin Malphite!)\r\n\r\nAusserdem haben sie ja auch keine Manaprobleme mehr dank des Essenzreaver.\r\nIch war 11/0 und sie 5/2.","replies":[{"poster":"OT Riku","date":"2015-12-20T18:40:49.902+0000","up_votes":3,"down_votes":0,"body":"Ja ich finde das die Adcs immernoch die Opfer der Kluft sind \nund wenn man bedenkt das du Malphite bist dich beschwerst das Vayne dich killt hast du das Prinzip von Vayne nicht verstanden\n sorry soll nicht böse klingen und wenn du mit Fulltanks Probleme gegen Adcs hast Bau Dornenpanzer das Ding ist das beste um Adcs zu killen.... \n\nLG Riku","replies":[{"poster":"Gorn21","date":"2015-12-21T06:25:29.978+0000","up_votes":1,"down_votes":0,"body":"Draven und Vayne juckt ein Dornenpanzer relativ wenig.","replies":[{"poster":"Ra1nDr0ps","date":"2015-12-21T16:03:30.621+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=-Il5o9ucaWE\n\nSchau dir das mal an =) Klar ist ein rammus aber da soll mir mal jemand sagen Dornenpanzer ist gegen draven useless!","replies":[]},{"poster":"OT Riku","date":"2015-12-21T12:12:30.216+0000","up_votes":1,"down_votes":0,"body":"Das würde ich nicht behaupten. Klar können sie sich gut gegenhealen aber schaden ist schaden und je schneller sie down sind desto besser können deine mates sie klatschen \nIch finde die Adcs zu schwach. Nach der fehlenden Synergie von stattiks und rapidfire","replies":[{"poster":"Gorn21","date":"2015-12-21T13:24:25.689+0000","up_votes":1,"down_votes":0,"body":"Was ich damit sagen wollte war, das Dornenpanzer nicht automatich die Wunderwaffe gegen ADCs ist. Den das beste mittel um einen ADC zu Handlen ist ein schneller tötlicher burst. Dornenpanzer ist ein netter Bonus für die Tanks denen es ein wenig an Schaden mangelt.","replies":[]},{"poster":"InfectedGreed","date":"2015-12-21T12:30:04.351+0000","up_votes":1,"down_votes":0,"body":"Im Gegensatz zu nem Brand, sind die ADC`s tatsächlich zu schwach.\n\nOder Mundo ist zur Zeit auch ein wenig OP, zumindest waren die letzten die ich gesehen habe irgendwann unzerstörbar, nichtmal mehr vom ADC.","replies":[]}]}]}]},{"poster":"Tungsteel","date":"2015-12-21T09:48:01.081+0000","up_votes":2,"down_votes":0,"body":"Vayne macht True Damage in Höhe eines Prozentsatzs deines maximalen Lebens. Dazu hatte die Vayne noch Blade of the Ruined King, das heißt, sie mach pro Auto Attack noch %Hp deines momentanen Lebens als Schaden. Mit Blade und PD  und den Berserker Schuhen hat sie genug Attackspeed, dass sie recht flott auf ihre drei AAs kommt. Dazu noch IE für Krit und BT für Lifesteal. Deine Rüstung durchdringt sie mit ihrem Mortal Reminder. \nSie hatte zu dem Zeitpunkt noch nicht all die Items, aber so oder so macht sie %max Life true damage.","replies":[]},{"poster":"InfectedGreed","date":"2015-12-21T12:27:57.189+0000","up_votes":1,"down_votes":0,"body":"Wenn du nur die drei Items hattest, fehlt dir halt der DMG.\n\nIch würd auf Malphite immer erst Rod of Ages bauen(damit es sich hochstacken kann)\n\nDanach hat man immer noch Zeit für Tankequipment.\n\nNa auf jeden Fall braucht ein Tank auch ein wenig DMG sonst kann man ihn ja links liegen lassen, im TF....","replies":[]},{"poster":"W0RN","date":"2015-12-21T10:10:10.995+0000","up_votes":1,"down_votes":0,"body":"Spiel mal andere ADC´s gegen Malphite oder Mundo, dann siehste was Sache ist .. \nUnd was Essenzreaver angeht, das Item alleine reicht nicht, um die Manaprobleme zu beheben. Du brauchst da schon mind. 40% Crit dafür.","replies":[]},{"poster":"e621 Rengar","date":"2015-12-20T18:15:12.480+0000","up_votes":1,"down_votes":0,"body":"Da Vayne 12% max hp true dmg macht ...ja der buff war unnötig... und durch 2 items schon genug crit hat ist das normal.\nAtm find ich aber fine","replies":[]}]}