{"poster":"Ezcru","date":"2017-08-04T22:37:04.369+0000","title":"Champ select timer stuck at zero","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Is this ever going to be fixed? Been experiencing this since 2016 and many people still get this. \r\n\r\nSomeone is picking their champion and the game \"loses connection\" so I'm stuck seeing it count down to zero, and then just stay there. The selection never moves on. Even if I am LAST PICK, and this occurs with the FIRST PICK of champ select, I'm \"stuck\" alllllll the way until my pick and then alllll the way until my timer reaches zero (of course I can't see my timer). And then I'm booted and lose LP. \r\n\r\n???\r\n\r\nI can still type in champ select chat and see people talking. They can see what I type the whole time.\r\n\r\nSo I don't get how I can be disconnected from the selection but not the chat. Are these two different IP addresses I'm connecting to? What's going on?\r\n\r\nI can browse the web with no problem during the time I'm \"stuck\". This occurs on different computers. \r\n\r\nCan you overhaul this ridiculous system? At least make it whatever I've selected as my \"intended to play\" champ will become my chosen champ if timer reaches zero for me. \r\n\r\nThis is just silly considering the LP loss and dodge timer. I got 120/20 internet.","replies":[{"poster":"Broporo","date":"2017-08-05T01:41:07.933+0000","up_votes":1,"down_votes":0,"body":"So you're right about the game lobby and the chat being two different servers first off, it's completely feasible that you might be connected to the game but not the chat servers or vice versa. Essentially, if your client loses its connection to the game servers then your client won't ever be able to send your champion pick intent either. The only way to get through the lobby successfully is to make sure you're able to maintain that stable connection until the game begins to launch.\n\nLet's quickly check up on your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to make sure there isn't some stray setting that's making this happen. Focus on port forwarding and flushing your DNS, but also be sure to hit the rest of those troubleshooting steps just in case the issue lies there.","replies":[]}]}