{"poster":"Dentablend","date":"2017-11-09T22:10:54.332+0000","title":"Wie kann man seinen account bei riot auflösen lassen?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":5,"body":"Hallo alle miteinander, ich m&ouml;chte mich von diesem Spiel befreien. Da ich aber ca etwas mehr als 200 euro hineingesteckt habe wollte ich fragen ob jemand wei&szlig;, ob man das geld zur&uuml;ck verlangen kann wenn man riot drum bittet diesen account aufzul&ouml;sen den ich sehe es nicht ein vertrieben zu werden..das geld aber da zu lassen. Immerhin wird der account ja nicht mehr existieren und f&uuml;r riot ist es auch keine arbeit ihn aufzul&ouml;sen. ich finde es besser als ihn zu verkaufen und damit irgendwelche lieblosen personen ins spiel zu holen die das game dann ruinieren f&uuml;r die anderen. Bitte schreibt wenn ihr etwas wisst oder theorien/ideen habt wie man das machen k&ouml;nnte!\r\n\r\nUnd falls fragen kommen wieso ich das machen m&ouml;chte dann schreib ich nur : ich bin das tausendste mal in promo zu silber und wie &uuml;blich in promos nicht die ...erfahrensten spieler im team aber das ist nicht schlimm! schlimm ist es das ich danach oder kurz danach jedes game verliere weil so viele kaum reagieren, warden, roamen oder auch nicht(je nachdem was gerade besser w&auml;re) pushen oder auch nicht(je nachdem was gerade besser w&auml;re). Man erlebt immer wieder dieselben und gleichen fehler spiel f&uuml;r spiel und nach jahren der fr&ouml;hlichkeit merke ich wie mich das immer negativer denken l&auml;sst..pausen helfen auch nix weil wenn man wieder spielt sofort dieselben dinge passieren wie sonst immer..und es ist v&ouml;llig egal wie man das team unterst&uuml;zt oder Versucht zu carrien. Die leute haben keine erfahrung in dem spiel und ruinieren es somit leider zu oft als das ich fr&ouml;hlich bleiben kann. es ist einfach traurig das riot/besonders new china riot die auf jedenfall m&ouml;glichkeiten haben, leute zusammen in ein spiel bringen die jahre unterschied von erfahrung und gespielten spielen haben. es geht hier nicht darum das jemand mal ein schlechtes game hat..das kann man erkennen in dem die person trotzdem und ohne zu flamen weiterspielt und das ist in ordnung hat jeder mal. ich rede von leuten die gerade mal 2 rollen k&ouml;nnen und meinetwegen ihre 200 normal games haben(wobei das noch zu viel ist)  leute die Wirklich auf zu wenig achten im spiel sodass der gedanke von warum ist dieses etws in meinem team aufkommt. Und dazu mal ne frage..: wann darf oder sollte man von euch aus ranked anfangen? Ich pers&ouml;nlich habe &Uuml;ber tausend normal games gezockt, habe gegen jeden champion gespielt und die h&auml;lfte aller champions gemaint(von denen die damals da waren) Vor den meisterschaftsplaketten/platzierungen nur f&uuml;r die die jetzt mein account beglotzen. Ich meine ich hab mich ernsthaft darauf vorbereitet wie man es auch eigentlich tuhen sollte(meiner meinung nach) ich meine wenn man eine 1 will lernt man..oder nicht? Ich spiele jetzt knapp ein jahr ranked und bin Immer noch bronze und allein das freunde die gold sind zu mir sagen du bist doch voll gut warum bist du noch bronze gibt mir zu denken..ich meine ich besiege meine kollegen(ich sag nicht es ist leicht) aber es ist so und auch wenn wir zusammen normals spielen oder mal flex what ever wundern die sich wieso ich hier henge. Ich sehe ranked zum gewinnen! um spa&szlig; zu haben oder auch mal zu trollen spiele ich normals, es ist n&auml;mlich viel zu riskant sowas im ranked zu tun. Und ich sage niemals es sind schlechte spieler ich sage gewisse erfahrung fehlt vor allem f&uuml;r action/reaction. Noch dazu kommen zu viele smurfer und leute die(wie ich oben bereits schrieb) den account verkaufen und somit das ranking v&ouml;llig durcheinander bringen..und es werden leute geboosted die das vom skill her garnicht verdienen und da es zu viele negative optionen gibt die oft zu 90% f&uuml;r loses sorgen werde ich aufh&ouml;ren! Ein kleines beispiel: neulich ein game, in der champion auswahl tauscht der jungel mit support (den tausch habe ich &uuml;brigens auch vorgeschlagen da der spieler nicht supp wollte oder kann) in diesem fall habe Ich leider nicht gesehen(ich war mitte) das der jungel ryze kein smite hat...soweit sogut als ich mitte war kam ryze auch in die mitte und meinte er ist mitte er hat mit leo unserem supp in dem spiel getauscht. Und genau Das meine ich... der hat nicht einmal darauf geachtet das die person mit der er getauscht hat jungle war! ich denke man Sollte eine gewisse erfahrung haben bevor man ranked startet! gut in diesem beispiel hatte die person einfach keine augen aber alleine die 50% zu 50% chance das er im spiel dann auch keine augen hat ist zu gro&szlig;! Aber ist ja nur ein KlEINES beispiel!\r\nund falls hier welche on denen sind die eventuell nach meinem acc/history check alles auf mich schieben zu denen sage ich welche stats von welchem spiel ihr euch auch anguckt ich bin gerne bereit mit euch per ts dieses spiel zu schauen und dar&uuml;ber zu reden bzw das was ihr dann bem&auml;ngelt zu besprechen oder auch gewisses klar zu stellen(als beispiel: warum warst du grad an der position und nicht an der anderen? weil sonst dieses oder jenes!) Beispiel ende xD\r\n\r\nund nat&uuml;rlich was man immer schreiben muss.. achtet nicht auf grammatik das hier ist Keine bewerbung zum professor! xD xD und vergesst nicht worum es geht..eigentlich um account loswerden &uuml;ber riot!","replies":[{"poster":"Uranbrennstab","date":"2017-11-10T07:53:47.788+0000","up_votes":4,"down_votes":0,"body":"Willst du wirklich wissen, warum du verlierst?  Oder willst du nur Mitleid?\n\nIch kann dir exakt sagen was dein Problem ist:\nVon deinen Top 10 most played Champions sind 6 davon Assasins, ein ADC und dann auch noch ein schlechter, ein Fighter und zwar das größte Kiteopfer, ein okayischen Tank und einen Guten Ardent Support. \nDas bedeutet, dass von deinen 10 Top Champions Season 7 einfach 8 Müll sind für dich und deine Elo, deswegen Gewinnst du auch keine Promos, weil du nicht gut genug bist um mit mittelmäßig guten oder mechanisch Anspruchsvollen Assasins zu carryn und dich vorallem konsequent weigerst die starken Champions zu spielen, wie Sejuani, wie Tristana, wie Ornn. Du gehst halt für die flashy Montageplays anstatt auf Sieg.\nDas ist der Grund warum du Bronze bist und nicht deine Teammates.","replies":[{"poster":"Homunculi","date":"2017-11-10T09:48:32.653+0000","up_votes":2,"down_votes":0,"body":"http://i0.kym-cdn.com/entries/icons/facebook/000/011/848/cold.jpg","replies":[]},{"poster":"Dentablend","date":"2017-11-11T03:50:11.098+0000","up_votes":1,"down_votes":0,"body":"Leute wie du(wirklich sry das ich dich gerade in eine schublade stecke xD)..solche leute picken sich ob bewusst oder unbewusst leider nur die sachen wie: ich gehöre nicht in die elo oder das team ist nicht so gut raus aber hättest du über meinen text richtig nachgedacht/gelesen würde dein geschriebenes garnicht zutreffen oder sinn ergeben. Lies bitte nochmal..hahaha.. wie ich halt auch geschrieben hab können wir uns die spiele gerne anschauen und ich kann dir beweisen das ich diese champions kann(oh und du musst aufpassen ich hatte auch schonmal champions in der top liste die ich schon seit eineinhalb wochen nicht mehr angerührt hab und ich spiele Viel..kurz gesagt das was du angeschaut hast muss nicht unbedingt stimmen weil die statistiken Manchmal nicht mehr zutreffende oder veraltete sachen anzeigt..ich betone Manchmal nochmal! Hab ich öfter schon gehabt/gesehen. Hmm ich möchte meinen text nicht nochmal hier hinschreiben,.. ich weiß nicht in welcher elo du gerade bist aber Bitte bedenke! Das league Immer mehr zuwachs bekommt und es eines der meistgespielten oder das meist gespielte (weiß ich nicht genau) spiel ist. Und jetzt rechne mal ungefähr im kopf wie viele und auch wie schnell das geht, neulinge die wie auch in meinem text geschrieben kaum erfahrung haben dann natürlich in bronze sind..und jetzt bitte ich dich mach dir einen neuen account und zocke mal bronze und zwar viele games hintereinander und du wirst merken das es wahrscheinlich sehr lange dauert oder du keine lust mehr hast und zu deinem richtigen acc gehst weil so viele beginner..und wie ich wieder schon schrieb sind die anfänger Nicht mein problem das ich hier mitteilen will sondern eher die smurfer und die die sich boosten lassen und alles durcheinander bringen(Und Ja dadurch geht das system durcheinaner bzw sind oft viele falsche personen in falschen elos und dann kann so etwas passieren: Ich hatte vor einigeen tagen wieder promo zu silber. alles lief gut team hat nicht unvernünfig gepickt..dann zum spiel ich war top oder mitte weiß ich nicht mehr genau(ich nehm die spiele ja nicht mit ins grab vorallem die schlechten xD) und nach kurzer zeit hat die botlane ja beide personen gefeedet. Wir haben alle weiter gespielt und versucht was draus zu machen.. es wurde auch von allen bot geholfen doch..einfach Wie die gespielt haben(botlane) und sich bewegt/reaction gezeigt haben hat einen an seine anfangs zeit erinnert(ja wo man schlecht war natürlich) nach dem game was wir auch verloren haben habe ich geschaut und ich konnte es halt nicht fassen das die botlane beide silber waren aber das supp 1/11 und adc weiß nicht mehr genau vllt so 2/7-8 gehen ist echt heftig! Die gegner hatten auch 3 oder 4 silber spieler also gegen die aufteilung kann man nie etwas sagen aber sehr oft sind wenn man silber spieler im team hat..das irgendwie keine wirklichen silber skills moves whatever. aber wie ich vorhin schrieb war das verhalten einfach so das ich Weiß das das geboostete personen sein müssen die vielleicht Eigentlich b3 oder meinetwegen auch b2 gehören aber auf Keinen fall silber! und genau Diese personen ruinieren das game ich meine überleg mal es treten dadurch einfach viel zu Unbalancte teams auf, wenn meinetwegen ein smurfer oder ein normaler silber spieler in meinem team ist(oh und alleine das müsste schon beweisen das ich Einigermaßen gut bin denn wenn ich schon ab b2 immer silber gegner bekomme heißt das auch von berechnungen von riot und diesen ganzen mmr shiit usw xD das man gegner bekommt die ungefähr meinen skill besitzen) dann kommen die vielen bronze spieler und auch anfänger damit aber nicht klar und verlieren halt weil sie bessere gegner haben was aber unfair ist! Deswegen verliere ich diese games und nicht weil wie Du meinst ich falsche champions spiele. Riot müsste einfach dafür sorgen das man gleichwertige spieler im team hat aber dann von berechnugnen wie zum beispiel : normal und ranked games/Anzahl vergleichen! Das heißt.. Spieler eins hat als beispiel 843 normlas gespielt und 211 rankeds. dann wird ein team aus leuten die auch UNGEFÄHR so viele spiele in diesen kategorien haben zusammengestellt und nicht so wie es zuzeit berechnet wird(da halt zu viele smurfs und auch geboostete unterwegs sind) die einen sind dann nämlich zu schlecht für die elo die anderen zu gut und dadurch müssen dann die normalen spieler die sich hochkämpfen sehr drunter leiden..siehe beispiel mit der silber botlane die am Schlechtesten aus dem team waren bzw Könnte man sagen richtig gefeedet haben! ich denke einfach das wenn riot nicht abgegeben worden wäre es viel besser sein würde denn china kümmert sich leider nur um coole optik(ob an champions oder menü) und nur um die lcs aber nicht um die spieler selbst..die bekommen es wahrscheinlich garnicht mal mit was in bronze abläuft weil denen das egal ist..Schade!Hey bin fertig! wenn du bis hier angekommen bist respekt und Danke für deine zeit!","replies":[{"poster":"Uranbrennstab","date":"2017-11-11T12:19:12.350+0000","up_votes":1,"down_votes":0,"body":"Ich habe deinen Text gelesen. Ja deine Mates haben das Spiel verloren (deiner Meinung nach) aber du hast das Spiel auch nicht gewonnen (faktische Realität).\nIch brauche mir auch keinen neuen Account machen, weil ich mich jetzt zwei Season in Folge von Bronze nach Gold gecarried habe. Das hat zwar fast die ganze Season gedauert, aber war nicht unendlich schwer. \nIch habe das geschafft weil ich Meta Champions bzw Tanks gespielt habe, weil Tank spielen der Hidden easymode in Lowelo war. \nMein Kumpel spielt das Spiel erst seit zwei Jahren ist Mundo Otp und hat eine höhere Elo als ich. \nWenn du es also nicht schaffst mit Assasins das Spiel zu gewinnen, dann ist da kein ander dran schuld als du. Da brauche ich mir auch keine endlosen Ausreden anhören warum jetzt genau das und das schief gelaufen ist. \nSowas würde ich bei den alten Tanks, Support oder ADCs gelten lassen, weil die wirklich Probleme haben/hatten ein Spiel alleine zu entscheiden.","replies":[]},{"poster":"Dentablend","date":"2017-11-11T03:51:31.728+0000","up_votes":1,"down_votes":0,"body":"entschuldigung für schreibfehler und so weiter. xD","replies":[{"poster":"Revilous","date":"2017-11-11T12:05:04.693+0000","up_votes":1,"down_votes":0,"body":"Niemand hat Bock, sich deine langen, schlecht formatierten und mit haufenweise Fehlern bestückten Texte durchzulesen. Du kannst deinen Account nicht auflösen lassen und du bekommst auch kein Geld zurück. Wenn du nicht mehr spielen willst, dann lass es einfach. Juckt übrigens auch niemanden.","replies":[]}]}]}]},{"poster":"Abasin","date":"2017-11-10T11:36:41.888+0000","up_votes":1,"down_votes":0,"body":"> ob man das geld zurück verlangen kann wenn man riot drum bittet diesen account aufzulösen\n\nDas ist kein Sparbuch.{{sticker:zombie-brand-facepalm}}\n\n> und natürlich was man immer schreiben muss.. achtet nicht auf grammatik das hier ist Keine bewerbung zum professor!\n\nAber es geht um Lesbarkeit an sich und ums verstanden werden. Da mangelt es dann bei Deiner Schreibweise massivst dran.","replies":[{"poster":"Dentablend","date":"2017-11-11T04:07:56.777+0000","up_votes":1,"down_votes":1,"body":"Danke für die Stirnklatsche xD\nRechtlich gesehen..Klar Könnte ich dagegen angehen aber das wäre ein zu langer und unnötiger prozess für alle angehörigen, dennoch mit Rechtsbeistand, Ja würde ich geld wieder bekommen Können. Es reicht nächstes mal einfach ein : Nein ohne Mehr geld auszugeben kriegst du dieses geld nicht wieder. Und wegen der Lesbarkeit..ich denke leute mit Gehirn werden diese kleinen fehler schon richtig verstehen aber tut mir leid wenn man kurz 1-2 sekunden mal nachdenken muss..lass es dir am besten nächstes mal von deiner oma vor lesen dann muss sie sich mit den schreibfehlern und dem verständis rum ärgern xD xD","replies":[{"poster":"Darkr3sQ","date":"2017-11-11T11:38:08.694+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dentablend,realm=EUW,application-id=YnZkMR0R,discussion-id=5BmpBj02,comment-id=00080000,timestamp=2017-11-11T04:07:56.777+0000)\n>\n> Danke für die Stirnklatsche xD\n> Rechtlich gesehen..Klar Könnte ich dagegen angehen aber das wäre ein zu langer und unnötiger prozess für alle angehörigen, dennoch mit Rechtsbeistand, Ja würde ich geld wieder bekommen Können. Es reicht nächstes mal einfach ein : Nein ohne Mehr geld auszugeben kriegst du dieses geld nicht wieder. Und wegen der Lesbarkeit..ich denke leute mit Gehirn werden diese kleinen fehler schon richtig verstehen aber tut mir leid wenn man kurz 1-2 sekunden mal nachdenken muss..lass es dir am besten nächstes mal von deiner oma vor lesen dann muss sie sich mit den schreibfehlern und dem verständis rum ärgern xD xD\n\nUnd was genau macht Dich so sicher, dass Du mit rechtlichem Beistand Dein Geld wiederbekommen würdest?\nDu hast für Dein Geld von RIOT eine Leistung erhalten: Die Umwandlung in RP. Mit diesen RP hast Du Dir für die aktive Zeit die Nutzungsrechte an bestimmten Inhalten erworben.\nUnd jetzt musst Du mir mal ganz genau erklären, auf welcher Grundlage Du nun Dein Geld von RIOT zurück bekommen sollst.\nIch meine, wenn Du Deine Mietwohnung nun kündigst, weil Du irgendwo anders hinziehst, bekommst Du schließlich auch nicht die Miete für die genutzte Zeit wieder zurück.\n\nEdit:\nUnd bezüglich Deiner Lesbarkeit:\nDu willst, dass wir uns Deinen Text durchlesen und auf dessen Grundlage mit Dir diskutieren. Dann ist es auch in Deiner Pflicht, zumindest durch Absätze, Deine Wall of Text lesbar zu machen, und nicht einfach in den Raum zu werfen, dass Leute mit Gehirn das schon verstehen werden. Es hat nichts damit zu tun, ob man Deine Wall of Text versteht oder nicht. Es tut einfach in den Augen weh, einen riesen Text ohne jegliche Absätze zu lesen.","replies":[]}]}]},{"poster":"Night Lead","date":"2017-11-10T10:57:35.242+0000","up_votes":1,"down_votes":0,"body":"Warum geld zurück? Du hast freiwillig Riot unterstützt. Das Geld ist in entwicklung und den Server geflossen. Oder wie würdest du es finden Wenn du zum beispiel im Einzelhandel arbeitestund wenn jemand was zurückgibt es von deinem Gehalt abgezogen wird?","replies":[{"poster":"Sirrkas","date":"2017-11-10T11:03:13.018+0000","up_votes":1,"down_votes":0,"body":"Ich glaube das Beispiel wäre verständlicher, wenn jemand entlassen wird und die letzten 7 Jahre Gehalt, doch bitte wieder an das Unternehmen erstattet werden sollen, schließlich will man die Person als Arbeitnehmer nicht mehr.","replies":[]}]},{"poster":"AI Yjuq","date":"2017-11-10T00:40:33.346+0000","up_votes":1,"down_votes":0,"body":"Warum sollte Riot Games dir dein Geld zurück geben? Du hast dafür doch irgendwas gekauft und konntest es über den Account nutzen, oder nicht? Was du damit getan hast ist eine Lizenz zu erwerben. Der Account und sämtliche Inhalte gehören alleine Riot Games. Riot hat dir ein Nutzungsrecht bei deiner Registration eingeräumt mit einer AGB. Du hast der AGB zugestimmt und kannst den Account entsprechend Nutzen. Durch deine Käufe über den Client hast du weitere Nutzungsrechte eingekauft die Accountgebunden sind. Du hast dieses Nutzungsrecht noch und wirst es immer haben. Wenn du Riot Games darum bittest deinen Account aufzulösen sagst du denen damit dass du deine Nutzungsrechte nicht mehr haben möchtest.\n\nKurz gesagt: Nein, das Geld wirst du nicht zurück bekommen. Warum denn auch?\n\nPS: Den Account darfst du by the way auch nicht verkaufen. Wenn du dies tust wird der Account schlichtweg gebannt. Wenn du keine lust mehr auf LoL hast dann lass es doch. Dafür muss der Account nicht extra aufgelöst werden. Vielleicht bekommst du irgendwann nochmal Lust und dann ist es doch toll wenn du deinen Account noch hast, oder nicht?\n\nAlles andere wäre in meinen Augen schlichtweg dämlich. Ansonsten wende dich an den Support von Riot Games.\n\n- Achja, bevor jemand mich hier korrigieren will: Tut es, ich bin kein Jurist und kann sein dass ich mich ein wenig in den Begrifflichkeiten vertan habe. Aber das Prinzip dürfte klar sein und hoffentlich auch das, was ich ausdrücken wollte. xD","replies":[{"poster":"Megamaexx","date":"2017-11-10T05:29:15.699+0000","up_votes":1,"down_votes":0,"body":"Ich meine mal gehört zu haben, dass man seine letzten Transaktionen der letzten 30 Tage zurückverlangen kann. Ich vermute aber mal, dass das eine Kulanz-Regelung ist.","replies":[{"poster":"BlackAjani","date":"2017-11-10T07:08:49.178+0000","up_votes":1,"down_votes":0,"body":"Ist das nicht einfach die Einkäufe zurück geb Sache, wo man 3 Aufladungen hierfür hat?\nSollte ja auch eigentlich ausreichen.","replies":[{"poster":"Qbert","date":"2017-11-10T07:10:42.127+0000","up_votes":1,"down_votes":0,"body":"du kannst nur 3x refunden ... 3x auf die Account-Geschichte gerechnet! ^^","replies":[{"poster":"BlackAjani","date":"2017-11-10T07:15:25.561+0000","up_votes":1,"down_votes":0,"body":"Ja genau, wenn man ein wenig sparsam hiermit ist, dann hat man für den Fall der Fälle ja so etwas.\nIch nicht, weil ich es einfach gewasted habe, egal xD","replies":[{"poster":"Qbert","date":"2017-11-10T07:16:02.066+0000","up_votes":1,"down_votes":0,"body":"hab's auch gewasted ... ist aber schon Jahre her :S\n\nWo bleibt eigentlich unser TGSG-Thread??","replies":[{"poster":"Timethief49","date":"2017-11-10T08:43:46.988+0000","up_votes":1,"down_votes":0,"body":"Dann hat man aber wieder nur rp und kein echtes Geld zurück.","replies":[{"poster":"BlackAjani","date":"2017-11-10T09:18:59.776+0000","up_votes":1,"down_votes":0,"body":"Ja wenn man Geld umwandelt, dann sollte man nicht überrascht sein, es nicht mehr wieder zu sehen. Oder liege ich da falsch?\nwenn ich mir früher zu einem Automaten gerannt bin der allerlei buntes Zeug inne hatte, dann hab ich da auch eine DM reingeschmissen und nie wieder gesehen. \nScheint normal.{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Timethief49","date":"2017-11-10T09:38:12.930+0000","up_votes":1,"down_votes":0,"body":"Völlig korrekt, hat sich nur so angehört als würdest du sagen man könnte rp-käufe refunden.","replies":[{"poster":"BlackAjani","date":"2017-11-10T09:42:21.996+0000","up_votes":1,"down_votes":0,"body":"Bei so einer Handhabung wäre Riot nach Veröffentlichung direkt zu Grabe getragen worden :D","replies":[]}]}]}]},{"poster":"BlackAjani","date":"2017-11-10T07:19:19.755+0000","up_votes":1,"down_votes":0,"body":"Ja ich hab des 2010 nach 5 Spielen schon verhauen gehabt, weil ich alle 3 Skins ausprobiert hatte ^^\nIch war gerade schon am überlegen, ob ich einen aufmache, aber gestern war es wieder so ruhig.","replies":[]}]}]}]},{"poster":"Megamaexx","date":"2017-11-10T07:38:09.891+0000","up_votes":1,"down_votes":0,"body":"Ich meinte tatsächlich RP zurückgeben und die Euros dafür erhalten. Ich habe allerdings auch keine Belege dafür, ob das stimmt.","replies":[]}]}]},{"poster":"Qbert","date":"2017-11-10T06:00:26.494+0000","up_votes":1,"down_votes":0,"body":"Du hast schon Recht.\nRiot gewährt dir lediglich ein Nutzungsrecht. Auch das Kaufen von Skins gewährt du nur ein Nutzungsrecht selbiger. Du bist ergo nicht Eigentümer und darfst dementsprechend den Account nicht veräußern :)","replies":[]}]},{"poster":"Timethief49","date":"2017-11-10T08:45:33.135+0000","up_votes":1,"down_votes":0,"body":"Der Support kann deinen Account auflösen schreib ihm einfach ein Ticket. Aber Achtung dies kann nich wieder rückgängig gemacht werden. Dein Geld wirst du auch nich zurückerhalten, warum auch, du hast die Leistung erhalten für die du gezahlt hast. Den Account verkaufen ist außerdem verboten.","replies":[]},{"poster":"Qbert","date":"2017-11-10T05:58:56.391+0000","up_votes":1,"down_votes":0,"body":"Du wirst ja nicht wirklich vertrieben, du gehst freiwillig. Vertreiben würde man dich mit einem Permabann.\n\nIch gebe dir mal ein Beispiel:\nDu wirst aus deiner Wohnung geschmissen, weil der Vermieter Eigenbedarf angemeldet hast.\nDu gehst nun vor Gericht verlangst ALL die Miete wieder, die du jemals gezahlt hast, weil du ja vertrieben wirst!\nDeine Forderung wird als \"Witz des Jahres\" in die Gerichtskantine gehangen.\n\nSo ist das auch mit deinem Lol-Account.\nDu hast das Geld bezahlt um gewisse Leistungen in Anspruch zu nehmen. Nur weil du nun nicht mehr spielen möchtest, heißt es nicht, dass diese Leistungen zurück erstattet werden müssen.","replies":[]},{"poster":"AI Marko","date":"2017-11-10T04:00:00.071+0000","up_votes":1,"down_votes":0,"body":"Wenn man besser als Bronze spiel steigt man auf Silber auf\nWenn man besser als Silber spiel steigt man auf Gold auf\nSollte es nicht auf dich zutreffen dann ist es nun mal nicht so","replies":[]},{"poster":"XExEcUtOrX04","date":"2017-11-09T22:47:01.077+0000","up_votes":1,"down_votes":0,"body":"Dein Geld kriegst du nichts zurück aber du kannst deinen Account bestimmt vom Support auflösen lassen.","replies":[]},{"poster":"TerrorRaven","date":"2017-11-09T22:11:43.101+0000","up_votes":1,"down_votes":0,"body":"Schreib den Support an","replies":[]}]}