{"poster":"Hermiderpin","date":"2014-10-27T00:28:24.035+0000","title":"Unusual Top Champions?","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"Hey Everyone,\r\n I've been starting to play more and more League lately and been veering off towards top lane champions that don't really get picked much at all lately, but still work rather well. I was just wondering what unusual underplayed champions you play or work good, and wether it would work good for a newer player like myself. \r\n I'm not terrible at hitting skillshots, just so you guys know.\r\n                          Thanks :)","replies":[{"poster":"Creamy Seaman","date":"2014-10-27T00:57:22.660+0000","up_votes":1,"down_votes":0,"body":"nidalee.\n{{item:3078}} {{item:3087}} {{item:3279}} {{item:3135}} {{item:3065}} {{item:3110}}\n\nJust keep poking them. If they come at you, transform to cougar then w away.\nif you ever land a spear w onto them then q them in cougar form. Then run away. Repeat. Make sure you don't take too much damage.\nStart with crystaline flash 1 health pot and 2 mana pots.","replies":[{"poster":"Rinky Dinky","date":"2014-10-27T01:16:04.068+0000","up_votes":4,"down_votes":0,"body":"> nidalee.\n> {{item:3078}} {{item:3087}} {{item:3279}} {{item:3135}} {{item:3065}} {{item:3110}}\n> \n> Just keep poking them. If they come at you, transform to cougar then w away.\n> if you ever land a spear w onto them then q them in cougar form. Then run away. Repeat. Make sure you don't take too much damage.\n> Start with crystaline flash 1 health pot and 2 mana pots.\n\nNid is not an unusual toplaner.","replies":[{"poster":"Creamy Seaman","date":"2014-10-27T14:18:59.478+0000","up_votes":1,"down_votes":2,"body":"Yes she is. Barely played now.","replies":[{"poster":"Rinky Dinky","date":"2014-10-29T11:28:53.184+0000","up_votes":2,"down_votes":0,"body":"> Yes she is. Barely played now.\n\nDoesnt make it an unusual pick\n\nWhenever I see her I see her top.\n\nRenekton isnt played much right now, is he an unusual top?\n\nNu","replies":[]},{"poster":"ATMACS","date":"2014-10-28T03:19:59.371+0000","up_votes":1,"down_votes":0,"body":"kind of wrong, her main position is top.","replies":[]}]}]}]},{"poster":"Chicken Sailor","date":"2014-10-28T03:08:05.771+0000","up_votes":1,"down_votes":0,"body":"{{champion:154}} \nZac is fun, definitely not the best in lane. You usually just want to farm up for late game and be a tanky CC machine. The passive is great bait though. I've had so many people tower dive me just to see me pop out into a few blobs and then the turret finishes them off. I usually build something like:\n{{item:3260}} {{item:3065}} {{item:3143}} {{item:3116}} {{item:3083}} {{item:3151}} \nLike any good build it varies depending on the situation but you basically want to be super tanky and have just a little bit of damage tacked on so you can be a potential threat by yourself.","replies":[{"poster":"EndlessSorcerer","date":"2014-10-28T05:05:08.284+0000","up_votes":2,"down_votes":0,"body":"Why do you get Rylai's Crystal Scepter before Liandry's Torment?  Zac has CC on three of his abilities and they are all AoE, so you get a pretty minimal slow.\n\nI'd probably recommend a build closer to:\n{{item:3020}} or {{item:3158}} ,{{item:3068}}, {{item:3143}}, {{item:3065}}, {{item:3151}}, {{item:3075}} \nIf jungling, switch {{item:3068}} for {{item:3207}}. \n\n\nZac has good base damages and percent health damage, so it is nice to have Magic Penetration to take advantage of that.  Sorcerer shoes are better for (burst) damage, while Ionian boots are better for mobility, CC, and sustained damage.\n\nSunfire Cape, Liandry's Torment, and Thornmail give him good damage at all points in the game.  They also benefit from Magic Penetration and provide good defenses.\n\nThis build also provides a good mix of resistances and health.","replies":[]}]},{"poster":"EndlessSorcerer","date":"2014-10-27T01:29:51.365+0000","up_votes":2,"down_votes":0,"body":"You can take Taric {{champion:44}} top lane against most melee carries and bruisers, especially AD Casters.  It works great when the enemy team is AD heavy and your lane opponent can't really deal with your armor stacking and sustain.\n\nMasteries:\n9(AD)/21/0\n\nRunes:\nArmor Quints, Hybrid Pen Marks, Scaling Health Seals, MR/CDR Glyphs\n\nItem Build:\n{{item:3117}} {{item:3025}} {{item:3068}} {{item:3143}} {{item:3190}} {{item:3075}}","replies":[{"poster":"Argomecha Perdix","date":"2014-10-27T02:35:32.077+0000","up_votes":1,"down_votes":0,"body":"I second this, but change {{item:3190}} for {{item:3065}} , to increase your heals to ridiculous levels.","replies":[{"poster":"EndlessSorcerer","date":"2014-10-28T04:56:44.026+0000","up_votes":2,"down_votes":0,"body":"Spirit Visage gives pretty good additional healing, especially since they added the bonus health scaling.  I prefer Locket of the Iron Solari because it lets me provide an MR aura (in addition to my armor, AD, and AP auras) and gives me a shield to protect my team in fights.\n\nIf you find yourself fighting without your team a lot, Spirit Visage is a good option.  Definitely personal preference.","replies":[]}]}]},{"poster":"Hideous Z","date":"2014-10-27T20:21:25.803+0000","up_votes":2,"down_votes":0,"body":"Quinn! I play a ton of solo lane Quinn. She's not unheard of anymore (read: I don't get raged at for picking her anymore), but she's still relatively rare. And so strong if played right.\n\nI also have a lot of fun with Urgot in a solo lane. He's a little tricky to learn as he's kinda handicapped right now (he has a rework coming at some point). But he still plenty strong enough to win a lot of lanes, and if you take TP he has a crazy strong gank with his ult.","replies":[]},{"poster":"Patric322","date":"2014-10-27T03:13:07.190+0000","up_votes":2,"down_votes":0,"body":"Rammus hard to farm but can absolutely stomp a lot of AD champs","replies":[]},{"poster":"GIJose65","date":"2014-10-28T03:39:57.043+0000","up_votes":1,"down_votes":0,"body":"annie top can be annoying if the matchup is right","replies":[]},{"poster":"Tooth Burglar","date":"2014-10-27T11:13:34.724+0000","up_votes":1,"down_votes":0,"body":"Volibear dumps all over Tryndamere and I will always pick Voli into Tryn if I have the chance.\n\nHeimer and Viktor top are pretty strong.\n\nVi top does a bucketload of damage.\n\nRengar still works fine as a top even though most people take him jungle now.\n\nAs another guy said Rammus top wrecks melees.\n\nTeleport/Ignite Shaco top is also pretty fun.  On blue side you can steal the enemy red solo, go b, then port back to lane at level 2 against a level 1 top laner (aka free kills).","replies":[]},{"poster":"Draven or Draven","date":"2014-10-27T10:55:32.442+0000","up_votes":1,"down_votes":0,"body":"Hecarim top","replies":[]},{"poster":"7ha7guy777","date":"2014-10-27T03:15:00.169+0000","up_votes":1,"down_votes":0,"body":"is karthus top as annoying as he sounds?","replies":[{"poster":"xDingwithsalad","date":"2014-10-27T03:19:15.167+0000","up_votes":1,"down_votes":0,"body":"nah hes not that great, but can work. who cares, though, if youre good with karthus you can play in whatever lane you want.","replies":[]}]},{"poster":"Scrambled Anivia","date":"2014-10-27T02:29:11.910+0000","up_votes":1,"down_votes":0,"body":"ive played {{champion:89}}  top with a lot of success i pretty much built her like the old ad niddalee","replies":[]},{"poster":"CrispCrustacean","date":"2014-10-27T02:17:01.008+0000","up_votes":1,"down_votes":1,"body":"Use {{champion:133}}, She is the best lane bully you can get, as far as builds go i get\n{{item:3087}} {{item:3072}} {{item:3252}} {{item:3031}}  {{item:3142}} {{item:3078}} \nand take {{summoner:4}} {{summoner:14}}  or{{summoner:12}} {{summoner:6}}","replies":[{"poster":"xDingwithsalad","date":"2014-10-27T02:24:17.731+0000","up_votes":1,"down_votes":0,"body":"not an unusual top champ. lol","replies":[]}]},{"poster":"doubleguac","date":"2014-10-27T01:23:28.602+0000","up_votes":1,"down_votes":0,"body":"Karma is a good top laner that you don't often see. She can bully the crap out of melees in lane, and is extremely hard to gank. She's super strong in the early and mid game. Her damage scales down a bit in the late game, but she has amazing peel for her ADC, and ends up filling a sort of poke/off-support role. \n\nGP is known for being a top laner, but he's not popular at all right now. GP is one of my favorite champions to play. I carried myself to plat maining him in ranked. He's criminally underrated right now in my opinion. If you're interested, I'd be happy to give you advice on building/playing him up top.\n\nSwain is starting to catch on in the top lane, but you can still surprise people with this. He's a massive lane bully who beats pretty much every melee in the game post-6. \n\nVolibear isn't in a great spot, balance wise, but he's still a super fun (if horribly predictable) top laner. Don't pick him though, unless you know you are going against a melee who wont be able to kite you. Volibear lanes horribly against ranged champions, since he has no reliable sustain, no wave clear, and is easy to kite.","replies":[]},{"poster":"OolongCheeseTea","date":"2014-10-28T02:38:26.043+0000","up_votes":1,"down_votes":1,"body":"swain{{champion:50}} op champ and not seen people play it much","replies":[]}]}