{"poster":"Beas7ie","date":"2017-09-08T16:20:31.378+0000","title":"For the Second Time I get hit with a 15 minute dodge penalty for just ONE dodge.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I dodged a normal game and get a 15 minute dodge penalty.  This is the first game of the day I dodged, I tried joining others but someone else dodged.  I have NOT declined going into queue previously either.\r\n\r\nNot too long ago the same thing happened to me also.\r\n\r\nWhy is the system giving me 15 minute penalties for just ONE dodge?  Is this intentional or is something bugged?","replies":[{"poster":"FNC kcal12","date":"2017-09-09T01:15:00.195+0000","up_votes":1,"down_votes":2,"body":"\" This is the first game \"*of the day*\" I dodged\" <------- Just LOL . \n\"I try to do so only in what I would consider extreme circumstances such as teammates already flaming/raging at each other, atrocious team comp vs a cancerous team comp, someone intentionally banning a teammates's pick etc.\" <---------- for \"extreme\" circumstances you do have a lot of differents reasons to do this \"rarely\". I love your \"etc.\" at the end. \n\nYou're toxic in your own way and it makes me laugh cause you don't even realize it.","replies":[{"poster":"Beas7ie","date":"2017-09-09T12:23:48.420+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=GRbkA5dN,comment-id=0001,timestamp=2017-09-08T23:44:39.495+0000)\n>\n> Have you recently dodge any other game mode, or the current featured game?  The queue dodge timer will be counted throughout all matchmade games, so doing it consistently willy escalate your timer.\n\nNo.  When I say that was the first time I dodged, that was my first dodge across ALL game modes.  And I don't recall dodging the day before either.  I always thought the Timer went something like    5min  - 10min and then 15 min if you dodge consecutively or within a short time span, but it really was my first dodge and it was boom instant 15 minutes.\n\nSame thing happened last week or so.\n\n\n\n\n\n> [{quoted}](name=kcal12,realm=EUW,application-id=osqw6G4M,discussion-id=GRbkA5dN,comment-id=0002,timestamp=2017-09-09T01:15:00.195+0000)\n>\n> &quot; This is the first game &quot;*of the day*&quot; I dodged&quot; &lt;------- Just LOL . \n> &quot;I try to do so only in what I would consider extreme circumstances such as teammates already flaming/raging at each other, atrocious team comp vs a cancerous team comp, someone intentionally banning a teammates&#x27;s pick etc.&quot; &lt;---------- for &quot;extreme&quot; circumstances you do have a lot of differents reasons to do this &quot;rarely&quot;. I love your &quot;etc.&quot; at the end. \n> \n> You&#x27;re toxic in your own way and it makes me laugh cause you don&#x27;t even realize it.\n\n\nPlease explain in detail how dodging a game if you think it is going to end horribly such as teammates are already arguing, you suspect someone is a troll, yadda yadda yadda makes one \"toxic\".  You act like I do this all the time when really these scenarios rarely happen bad enough where I feel I have to dodge.  Right now the only toxic one I see here is you.","replies":[{"poster":"FNC kcal12","date":"2017-09-09T17:46:39.865+0000","up_votes":1,"down_votes":0,"body":"It's the way you wrote it. HOw is what i said toxic ? hahaha it's people like you, just not liking hearing stuff like that then call people toxic that make this game toxic. \nJust try to make the game happen and then if they really are feeding etc then report them. As easy as that.","replies":[{"poster":"Beas7ie","date":"2017-09-09T23:01:06.273+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kcal12,realm=EUW,application-id=osqw6G4M,discussion-id=GRbkA5dN,comment-id=000200000000,timestamp=2017-09-09T17:46:39.865+0000)\n>\n> It&#x27;s the way you wrote it. HOw is what i said toxic ? hahaha it&#x27;s people like you, just not liking hearing stuff like that then call people toxic that make this game toxic. \n> Just try to make the game happen and then if they really are feeding etc then report them. As easy as that.\n\nMost of the times I DO try to make the game happen which is more than what most people I've been matched with do as they WILL dodge or more often than not, try and force others to dodge.  Anyways most of the times I try to \"make the game happen\" things go to crap pretty fast.  I've got a lot going on and limited time to play.  As such I don't want to take a bunch of extremely long shot gambles that things will work out and if they don't the only consolation I have is being able to report someone if they're extreme asshole after wasting about 30 min of my time and causing me to lose LP.\n\nAlso calling someone toxic is also considered toxic so um yeah.","replies":[]}]}]}]},{"poster":"Porocles","date":"2017-09-08T23:44:39.495+0000","up_votes":1,"down_votes":0,"body":"Have you recently dodge any other game mode, or the current featured game?  The queue dodge timer will be counted throughout all matchmade games, so doing it consistently willy escalate your timer.","replies":[]},{"poster":"Kokua","date":"2017-09-08T16:28:44.670+0000","up_votes":1,"down_votes":0,"body":"How often do you dodge games? It may have been your first *today*, but how many have you dodged this week? I've yet to dodge a game this year.","replies":[{"poster":"Beas7ie","date":"2017-09-08T16:32:36.434+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kokua,realm=NA,application-id=osqw6G4M,discussion-id=GRbkA5dN,comment-id=0000,timestamp=2017-09-08T16:28:44.670+0000)\n>\n> How often do you dodge games? It may have been your first *today*, but how many have you dodged this week? I&#x27;ve yet to dodge a game this year.\n\nPretty rarely.  I try to do so only in what I would consider extreme circumstances such as teammates already flaming/raging at each other, atrocious team comp vs a cancerous team comp, someone intentionally banning a teammates's pick etc.","replies":[]}]}]}