{"poster":"TWB Princess","date":"2016-05-05T05:59:53.971+0000","title":"Cassiopeia kann sich wieder in das Loch verkriechen wo sie her kam?","subforum":"Champions & Gameplay","up_votes":7,"down_votes":0,"body":"Hallo, Leute.\r\nIch bin Cassio-Main und kann mit den neuen Patch nichts mehr anfangen, weil sie kein DMG mehr macht und der CD zu hoch ist...\r\nWie ist eure Meinung ist sie das ein Buff or Nerf?","replies":[{"poster":"Nitrado","date":"2016-05-05T22:55:51.418+0000","up_votes":2,"down_votes":0,"body":"Ich sage nerf aber wenn man 3 mal denn feuerdrache + blue buff + enddrache kommt man auf mehr schaden als die alte was aber eher unwarscheinlich ist","replies":[]},{"poster":"Rv Sabo","date":"2016-05-05T10:50:41.317+0000","up_votes":3,"down_votes":2,"body":"Cassio mains haben nun dass Problem dass sie nicht nur 3 Fähigkeiten sondern 4 Fähigkeiten benutzen müssen um alles aus ihr rauszuhohlen.","replies":[]},{"poster":"Markishi","date":"2016-05-05T06:16:11.555+0000","up_votes":3,"down_votes":2,"body":"Also ich find die neue Cassio ziemlich gut. Ich hab sie jetzt noch nicht gespielt, weil ich Support bin, aber was ich gesehen habe, fnde ich echt nicht schlecht. Okay, die Passive ist nicht die stärkste, cih find sie aber witzig, ausserdem hast du jetzt einen Itemplatz mehr zur verfügung. \nDie Q macht immer noch gut Schaden, und wenn du einen Champ trifst, kriegst du ein echt ordentlichen Lauftempo-Boost. \nDie W finde ich ich schon echt stark. Extrem großer Bereich, guter Schaden, und ein richtig fieser Slow. Nicht nur das, du verhinderst damit auch ein Dash oder Flash aus dem Bereich, und kannst einen Kampf so mehr als nur gut teilen. Selbst wenn man die Ulti mal nicht vernünftgi getroffen hat, und nur slowt, mit dem neuen Miasma muss man echt keine Angst haben, das der Gegner wegflasht. Find ich extrem stark.\nDie E mag nicht so viel Schaden machen, aber der CD ist jetzt anfangs schon bei ich glaube 0,9, das heisst du kannst am Anfang schon wunderbar spammen damit, wenn der Gegner vergiftet ist, heilst du dich auch noch jedes mal. Damit kannst du schon lang in Kämpfen bleiben, mit diesem konstanten Heal. Solltest du einen damit killen, kriegst du auch das aufgewendete Mana wieder.\nDie R hat eine kürzere Abklingzeit, und das der Slow etwas weniger ist, finde ich ehrlich gesagt überhaupt nicht schlimm. BEdenke, das du deine W hast, udn damit schon quasi keiner mehr raus, bzw dadurch kommt. Und sobald du die Q getrofen hast, kommst du sowieso hinterher.\n\nIch mag das jetzt vielleicht nicht so gut beurteilen können, als Support Main, aber ich finde, die neue Cassio im vergleich zur alten überhaupt nicht schwach. Ich denke sogar, das sie stärker ist. Extra Item PLatz durch passives Lautempo. Die Q Powerspikes sind nach wie vor da und du wirst extrem schnell. Die W ist jetzt ein extrem gutes Teamfight- Werkzeug. EInfach in die Mitte von allen machen, und du hast quasi eine Azir- Ult da, da kann ja auch kein Gegner durch dashen. Die E hat jetzt konstant einen niedrigen Cooldown, macht mehr Schaden an vergifteten Zielen und heilt dich. Sher praktisch. Und die Ulti hat sich für mich nicht besonders viel verändert.\nIch denke, Cassio hat mehr von dem \"Rework\" profitiert, als das sie darunter gelitten hat.","replies":[{"poster":"TWB Princess","date":"2016-05-05T06:54:38.194+0000","up_votes":1,"down_votes":1,"body":"Ich hab sie einmal probiert und du machst halt kein Schaden das ist das Problem....","replies":[{"poster":"Santas hoe","date":"2016-05-05T07:14:55.454+0000","up_votes":1,"down_votes":0,"body":"Inwiefern machst du keinen Schaden? Ich habe zwar bis jetz ebenfalls keine cassio gezockt, weil ich ebenfalls in die sup ekke gehöre aber ich habe gegen eine gespielt. Die hat durchaus einiges an dmg rausgedrückt. Das meiste hat mein vorgänger ja schon erzählt, worauf ich aber nochmal hinweisen möchste sind die Schuhe. Du hast einen inventarplatz und 1100 Gold mehr zu verfügung als alle anderen in der Kluft. Heißt du hast ein dmg item mehr. Weiß noch wie es an dmg fehlen kann, wenn man mehr dmg items zur verfügung hat als sonstwer. Natürlich bist du nichtmehr ganz das machinengewehr wie früher wenn ein Gegner vergiftet war und deine e nen 0,5 cd hatte, aber du bist das so gut (zumindest auf niedriger stufe, hab nich im Kopf wie es auf hoher is) was ich sehr wichtig finde v.a. Im earlygame. Ich habe früher ein paar mal cassio gezockt, ich war kein Main aber ich fand es ein Problem, dass wenn man den Gegner nicht vergiften konnte weil er ausgewichen ist (was für Leute wie zed, fizz, ... Garnich soo schwer war) du useless warst. Heute kannst du dich dann wenigstens noch wehren. \nDas is natürlich nur meine bescheidene bronzemeinung ;*.\nLg\nThe_evil_in_pink","replies":[{"poster":"xExerionx","date":"2016-05-08T07:43:04.377+0000","up_votes":1,"down_votes":0,"body":"Ihr E macht null scheden ohne Gift von daher kann man sich nicht wehren.... Ihr altes W war super um Gegner zu vergiften und ein Q zu landen weil sie verlangsamt wurden. Des weiteren war W auch super zum Kiten oder einfach abhauen. Das neue W ist cool wenn man ganked! ABER für einen selbst ist es nutzlos mit der min. Range die es hat (kein Fizz,Yas oder Zed wird von dem Ding gestoppt!)","replies":[]},{"poster":"Bergelmir32","date":"2016-05-05T11:25:43.532+0000","up_votes":1,"down_votes":0,"body":"Ist ja schön und gut das ich mir ein weiteres Dmg Item kaufen kann, vorher habe ich 30% auf meine AP bekommen und 25% CDR. Wenn man 334 AP zusammen hatte war die %-Erhöhung der passiven mehr als die 100 AP Items mir jetzt geben.\nAuf unvergiftete Ziele macht die E jetzt ein bisschen mehr als AA Schaden, im Grunde genommen AA die einen 80 Mana kosten. Das ist so sehr sich wehren wie sich ne Nami oder ähnliche Supports wehren. Hinzu kommt das ich persönlich viel lieber ihr W zum vergiften genutzt habe, weil es mir sehr viel verlässlicher vorkam aber das ist, sofern man nicht an einer Wand steht, nur noch sehr begrentzt möglich.","replies":[{"poster":"Wendin","date":"2016-05-05T17:34:47.190+0000","up_votes":1,"down_votes":0,"body":"Vorallem Ist die skalierung auf E verringert wurden. Von .6 auf .45 (auf vergiftete Gegner)","replies":[{"poster":"Bergelmir32","date":"2016-05-05T17:53:10.273+0000","up_votes":1,"down_votes":0,"body":"von 0.55 auf 0.45","replies":[]}]}]}]},{"poster":"Senpai Gurke","date":"2016-05-05T12:09:13.998+0000","up_votes":1,"down_votes":0,"body":"Da stimme ich dir zu.\nHabe früher Cassio gesuchtet und jetzt wurde sie hart generft.\n\nDie passive ist einfach ein schlechter Witz. Auf lv 18 hast du jetzt 400 ms, das is einfach viel zu wenig, und verbunden mit ihrer Inmobilität fühlt sie sich extrem clunky an.\nDie Q manakosten wurden auf stufe 1 um 20 mana erhöht und das merkst du in der laningphase sehr. \nFrüher konnte man die Q noch beliebig oft spammen, jetzt bist du nach 5 Qs oom.\nWas mir an der neuen W überhaupt nicht gefällt ist, dass man sie nicht direkt vor sich setzen kann und nur auf einen gewisse minimaldistanz casten kann. Das ist ziemlich supotimal gegen assasinen, die an dir dranbleiben wollen.\nAußerdem gibt kannst du die W nicht mehr über Wände machen. Früher habe ich das oft in Büsche gemacht, damit mir es Vision gibt falls ich keinen ward hatte.\nDie neue E ist eigentlich ganz nett fürs lasthitten und stelt jetzt sofort leben wieder her ohne, dass du 150 stacks brauchst, aber macht halt weiniger schaden. Gerade auf der Midlane, wenn der weg zum Tower gering ist, kannst du maximal 3 Es auf den gegner machen und er ist wieder sicher.\nDie Ult bestraft dich jetzt mehr, wenn die gegner dich nicht angucken.\n\nWas mich aber am meisten stört ist, dass du den gegner mit einer sneaky Ult combo nicht mehr wegbursten kannst, da die E cd jetzt verdoppelt wurde.\nIch denke cassio ist jetzt nicht mehr diese DPS Monster sondern eher ein supportmage, welcher dem team mit seinem w und aoe stun helfen kann und ein bisschen schaden mit dem e macht.","replies":[]},{"poster":"MATRIX LORD ZIP","date":"2016-05-05T08:39:46.284+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OptiMister,realm=EUW,application-id=Wj1wcocU,discussion-id=m6Mmn5KR,comment-id=00000000,timestamp=2016-05-05T06:54:38.194+0000)\n>\n> Ich hab sie einmal probiert und du machst halt kein Schaden das ist das Problem....\n\nKann man an 1-2 Tagen sagen ob der Champ nicht in die Kluft passt?\nIch würde mindestens den Champ an 5 Tagen 5 mal spelen um zuschauen wie sie sich gegen andere Champs so ist. Übrigens gabs ein Viktor bei mir ingame der weniger dmg gemacht obwohl sein dmg ja gebufft worden ist.\nLG","replies":[]}]}]},{"poster":"Szok","date":"2016-05-05T16:49:02.993+0000","up_votes":2,"down_votes":1,"body":"Sie ist einfach tot.. Ende\nbsp? https://docs.google.com/spreadsheets/d/1-jGvnveUXwuzZko-OWDqNq9e-5I3TtV4aynDgimy-pc/edit#gid=0","replies":[]},{"poster":"Wendin","date":"2016-05-05T16:40:22.692+0000","up_votes":2,"down_votes":1,"body":"Jo, ebenfalls Cassio main.\nRichtig behindert. Fühlt sich einfach an als wär jeder Spell genervt.\n**Q** hat weniger range - Ich komm kaum noch an die Gegner ran um mir den Movementspeed zu holen. Das der decayed ist richtig behindert. Da der E CD erhöht wurde brauch ich jetzt noch dringender den Movementspeed die ganze Zeit über.\n**W** Hinterlässt nicht mehr den wichtigen debuff nachdem die Gegner rausgelaufen sind. Bis jetzt hat mir das grounden nicht so viel geholfen da die Gegner meistens einfach wieder rauslaufen können.\n**E** Macht weniger Damage, kostet early meher Mana (hat sich schon vorher auf lvl 1 nicht gelohnt den Spell zu casten), mehr CD, man kann kein Mana mehr regen und muss die Creeps vergiften um ordentlich zu lasthitten was wiederum noch mehr Mana kostet. Vor dem ersten mal back und der Träne lohnt es sich garnicht mit dem Gegner zu kämpfen.\n**R** Slowt weniger.\n\n**Passiv**: Das Passiv ist cooler aber warum die E Ratio nerven und ihr gleichzeitig AP wegnehmen?\n\nMeine Spielerfahrung allgemein:\n**Early game** total aufgeschmießen. Mit Q kann man nicht mehr ein wenig Poken oder \"engagen\" (war schon vorher schwierig ist jetzt aber quasi unmöglich da W auch nur solange slowt solang sie in der Zone sind) Kein Manareg auf E um nach einem Kampf etwas zu reggen. Ohne GIft ist es schwieriger zu lasthitten da E kein dmg mehr macht. Man kann auch gegen Ganks nicht mehr einfach W in sich reinlegen um effektiv etwas gegen Melees zu machen.\n\n**(Team-)Fights**\nEs ist einfach irre wie nah man an die Gegner ran muss um Q zu treffen. Und was bekommt man dafür? Ein bisschen dotdmg decaying movmentspeed. Kann dan hinterher für ein E oder W. E hat halt mehr CD daher muss man länger hinterherrennen für weniger DMG.\n\nKeine Ahnung was der Held jetzt eigentlich kann außer Gegner zu grounden. Aber selbst da fand ich den alten W deutlich nützlicher wegen den 2sec slow/poison.","replies":[]},{"poster":"Play Maker Cobra","date":"2016-05-05T13:21:11.324+0000","up_votes":2,"down_votes":1,"body":"Ja du hast recht ich bin auch Cassio main und ich finde sie schlecht.\nSie hat Mehr cd auf ihre e es ist nicht mehr so richtig zufällig mit ihrer Q Combo.\nDas problem ist du machst deine Combo und kannst höchstens 2 mal E einsetzen das war es auch schon \nsie kann nicht mehr aggresiv den gegner tot kiten.\nIhre manakosten sind viel zu hoch allein schon ihre q und die e sind mindestens 200 mana weg mit der combo \nsie ist stark mit ap skalierung aber das problem ist wie oft kann sie es einsetzen?!\nCass ist leider auch für mich Rip.\nsie ist im early viel zu schwach \nwenn sie es nicht schafft im late zu kommen dann ist sie useless...\n{{item:3070}} {{champion:69}}","replies":[]},{"poster":"SotE TRAVlS","date":"2016-05-08T17:59:52.164+0000","up_votes":1,"down_votes":0,"body":"Cassio wurde krass generft. Man macht jetzt halt nurnoch ca. den halben Schaden weil der cd vom e fast doppelt so hoch ist.","replies":[]},{"poster":"Killerkante","date":"2016-05-05T12:57:24.964+0000","up_votes":1,"down_votes":0,"body":"Sofern du dein Q triffst ist der DMG nichtmal so übel.\nTriffst dus nicht kannst den fight/dein duell direkt aufgeben :D\n\nIch bin nur der Meinung dass die Manakosten von E zu hoch sind.","replies":[{"poster":"xExerionx","date":"2016-05-08T07:43:38.863+0000","up_votes":1,"down_votes":0,"body":"Der Dmg ist so niedrig, dass es eh egal ist :D","replies":[]}]},{"poster":"fokko1023","date":"2016-05-06T04:29:19.587+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/xjvV0YeJ-69-balance-hotfix-going-out-soon\n\ncassio is anscheinend viel zu schwach und wird noch vor dem nächsten patch gebufft","replies":[{"poster":"StillYasuoMain","date":"2016-05-06T22:31:47.223+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=fokko1023,realm=EUW,application-id=Wj1wcocU,discussion-id=m6Mmn5KR,comment-id=000e,timestamp=2016-05-06T04:29:19.587+0000)\n>\n> http://boards.na.leagueoflegends.com/en/c/gameplay-balance/xjvV0YeJ-69-balance-hotfix-going-out-soon\n> \n> cassio is anscheinend viel zu schwach und wird noch vor dem nächsten patch gebufft\n\nUnd ich hoffe malza generft^^","replies":[]}]},{"poster":"StillYasuoMain","date":"2016-05-05T18:43:02.846+0000","up_votes":1,"down_votes":0,"body":"kauf dir 45% cdr. Dann sollte es 0.45 sekunden sein, genau wie vorher, nur kannst du es im notfall auch auf unposioned ziele schiessen.","replies":[{"poster":"Wendin","date":"2016-05-06T20:41:00.566+0000","up_votes":1,"down_votes":0,"body":"Man konnte vorher im Notfall auch auf nicht vergiftete Gegner E casten. Jetzt macht es aber keinen Sinn mehr einfach flat den E rainzucasten weil er keinen dmg macht. Ist also eher noch schwerer als leichter da man noch weniger kann wenn man seine Gifte nicht trifft.","replies":[]}]},{"poster":"LIN","date":"2016-05-05T23:07:00.763+0000","up_votes":1,"down_votes":0,"body":"Ich muss dir leider recht geben. Ich kann ebenfalls nicht viel mit Cassiopeia anfangen. \n\nPassiv:\nAlso ich persönlich schaffe ich gerade mal in 1 von 3 oder 4 Spiele ein Kompletten Set zusammen zukaufen. Wenn man ist die Fähigkeit nur gut für late late late game. Und davor ist Cassio sogar schwächer weil sie langsamer ist.  \n\nQ:\n Okay mal sehen. Q ist ein Buff. Aber es ist nicht stark genug als Hauptschaden Zauber.\nQ war schwach aber das war mir nicht so wichtig weil er dmg von E kommt. sobald du getroffen hast konntest du E spammen. Ich benutzte E sogar als last hit tool weil man Mana wiederbekam + 2,5% maximal Mana. Auf die Weise hast du nie wirklich Mana probleme. Jetzt spamme ich 3 Q und bin schon unter 50%\n\nW hat eine Cooldown von 22 Sekunden!!! Ich weiß nicht mal wann ich das benutzen soll? Es wäre okay wenn ich es direkt vor mir zaubern kann aber das geht nicht. Es hat eine Minimum Reichweite. Gegen Melee ist es also absolute nutzlos. Wann dann? Naja man kann es benutzen damit Feinde nicht so leicht entkommen. ........ Tja.....toll.... \nW war Früher ein Zauber mit den ich Defensive arbeiten kann als escape. Ich kann es Überall hin platzieren. Offensive als slow und wenn ich mit Q verfehle. Ich konnte damit farmen und es gab mir sogar Sicht. Jetzt dauert es 22 Sekunden bis ich es wieder benutzen kann. Kann es nicht über Mauern werfen, bleibt kürzer bestehen, hat mindest Reichweite. Q und W und dann E spammen....das waren Zeiten.\n\nE: \nDer Schaden ohne das der Feind vergiftet ist , ist ein Witz. So stark wie ein autoattack. Cooldown auf 0.9 macht es nicht besser. Was bringt mir niedrige Cooldown wenn es kein Schaden macht.\nWenn der Feind vergiftet ist dann heilt es und macht gut schaden aber ist meine Meinung nach trotzdem schwächer. \nFrüher hat E viel Schaden gemacht. Wenn du ein Feind vergiftet hast dann konntest du 3-4 E hinterher werfen und das auf niedrige Stufe.  Wenn nicht vergiftet konntest du trotzdem den Feind Schaden zufügen. Jetzt schaffst du gerade mal 2-3 E wegen den etwas längere cooldown. Und ohne Gift ist es nutzlos. \nUnd ja mehr Mana bekommt du jetzt auch nicht zurück.\nIch habe sie geliebt weil man mit ihr wirklich gut early last hitten kann. \n\nR: ist so ziemlich gleich. \n\nMeine Meinung nach 7 Matches. Ich war richtig gut mit Cassio. Oft Carry mit über 8-9 kills. Heute hab ich nicht mehr als 6 geschafft und bin so oft gestorben.  \n\nWer weiß vielleicht brauch ich noch mehr übung.","replies":[]},{"poster":"Synatics","date":"2016-05-05T13:03:40.701+0000","up_votes":1,"down_votes":0,"body":"Also ich hab sie auch gespielt und muss sagen das sie sich ganz anders und vorallem sehr viel schwächer anfühlt als vorher. Ihr E hat einen zu hohen CD wenn man vergiftete Ziele angreift. (Jeder der Cassio oft davor gespielt hat weiß was ich meine) Außerdem ist der E schaden selbst an vergifteten Zielen eher meh. Und ohne gift brauchst du erst garnicht anfangen ist nur Manaverschwendung.","replies":[]},{"poster":"ClAO KAKAO","date":"2016-05-05T10:49:23.745+0000","up_votes":1,"down_votes":1,"body":"Sie macht Schaden, besonders weil das Scaling einfach fast verdoppelt wurde auf dem Gift. Es wurde ja der Fokus auf das Gift gelegt und nichtmehr auf das wilde Rumgespamme von der E. Ich hab sie schon gespielt und dass du keine Boots brauchst ist einfach ein riesen Vorteil","replies":[{"poster":"xExerionx","date":"2016-05-08T07:46:57.450+0000","up_votes":1,"down_votes":1,"body":"So ein misst. Ihr Schaden, der einzige Punkt der sie zu einem gefährlichen Midlaner gemacht hatte, ist komplett generft worden. E verstärkt zum einen die Gifte nichtmehr, was aber viel schlimmer ist, es hat einen weitaus längeren CD und geringeres scaling. Normalerweise vergiftet man nach dem rework die Gegner auch nur noch mit Q nichtmehr mit W. W vergiftet nur wenn man drinn steht (früher 2s generell) und jeder ohne Gehinschaden kann einfach rauslaufen innerhalb von 1s, wenn man das W überhaupt gelandet hat mit der dämlichen min Range. Kein Zed, Fizz oder Yas lassen sich von W treffen.","replies":[]}]},{"poster":"RankaxLee","date":"2016-05-06T07:59:58.646+0000","up_votes":1,"down_votes":1,"body":"Kurz: Ja sie kann sich wieder ins Loch verkriechen und konnte sie auch vorher schon.","replies":[]},{"poster":"Belezebell","date":"2016-05-05T12:35:37.258+0000","up_votes":1,"down_votes":1,"body":"Leute wartet doch erstmal ab.. Als Graves und Poppy verändert wurden, haben auch viele viele Leute rumgejammert und die beiden als nutzlos oder schwach abgestempelt und nun werden beide in der LCs, MSI  gespielt!\n\nAlso lasst die Champions doch erstmal wirken und dann sieht man bald wie sich die Champs schlagen und wo sie hingehören.","replies":[]},{"poster":"Bergelmir32","date":"2016-05-05T11:57:15.527+0000","up_votes":1,"down_votes":2,"body":"Bei ihrer letzten Änderung haben die Mains und die \"Mains\" auch alle ewig rumgeheult wie schlecht sie jetzt sei und wie nutzlos etc etc. Also passt euch an oder sucht euch nen anderen Champ und lasst neue Leute zu Mains und \"Mains\" werden.\nUnabhängig davon, als jemand der Cassio auch ab und an mal ganz gern gespielt hat, bin ich von den Änderungen auch nicht begeistert. Sie fühlt sich irgendwie schwerfälliger und träger an. Ich fands immer recht schwer mit dem Q jemanden zu vergiften, desshalb habe ich da lieber das W verwendet aber das ist jetzt kaum mehr möglich.\nWas den Schaden angeht, Ihr E hat 10% weniger scale aber 95 mehr Grundschaden. Man müsste also 950 AP haben damit der per spell Dmg weniger wäre als vorher. Natürlich wurde der CD fast verdoppelt, dafür profitiert man jetzt auch hier von CDR. Ihr Q Schaden wurde an sich gesehen erhöht, wird aber nicht mehr durch ihr e verbessert und ist zieht jetzt erst ab 1057 AP gleich. Ihr W Schaden wurde erhöhrt, ist mMn aber schwerer anzubringen.\nWas ihre Passive angeht, wenn man davon ausgeht das man sich Rabbadons und Seraphs auch vorher schon geholt hat, kann man jetzt im höchsten Falle noch 100 AP drauf packen, die die alte Passive bei 334 AP auch gegeben hat bzw sogar noch mehr danach.\n\nWer sagt sie würde jetzt keinen Schaden mehr machen, muss auch sagen das sie davor nur wenig Schaden gemacht hat und da das nicht der Fall ist, ist kein Schaden übertrieben und schlicht falsch. aber weniger ist es allemal besonders wenn ihr W nicht ordentlich reinhaut, welches dafür jetzt besser zum zonen ist.","replies":[]}]}