{"poster":"TWB Princess","date":"2015-10-02T16:43:44.183+0000","title":"In wie weit sollte ich das gewinnen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"Mein letztes Game wo ich Chogath spielte war das Endergebnis 3/18. Ich wei&szlig; nicht was ich da machen soll. Ich hatte nur Anfangs das Problem das Trynda 2 Early Ganks machte und denn nicht mehr. Aber der Zed kam 2x Hoch und starb gegen GAREN!!! Denn kam mein Jungler leider nicht obwohl ich oft gebittet hab und Gepingt habe und gegen Garen war es noch einigerma&szlig;en schaffbar aber denn war es 2/15 und denn war eh vorbei und die wollten Surrendern und ich nicht aber 4 - 1 ist trotzdem surr. Was sollte ich da machen... Ich muss als Gegner von Garen einfach versuchen das er kein Feed bekommt das habe ich einigerma&szlig;en geschafft, aber es gab mein Team. Wurde am Ende f&uuml;r Flame reportet (Was ich nicht tat).\r\n\r\n\r\nWas soll ich da tun???\r\n\r\n\r\nP.s. wurde auf S5 abgestuft -.-","replies":[{"poster":"FeuerfalkeFX","date":"2015-10-02T17:05:17.390+0000","up_votes":2,"down_votes":0,"body":"In diesem Fall einfach ne Beruhigungspille einschmeissen und auf was einschlagen. {{item:3184}} \n\nAber mal im ernst, es gibt Spiele bei denen du einfach nichts machen kannst.\nTrotzdem solltest du niemals flamen (ich unterstelle dir nicht es getan zu haben), da deine teammitglieder nur noch schlechter drauf sind, was sich auch negativ auf Ihr spielverhalten aussübt.","replies":[]},{"poster":"i had fun once","date":"2015-10-03T08:39:59.253+0000","up_votes":1,"down_votes":0,"body":"Es gibt Games da verkackt einfach jede Lane. Kann man nichts machen. Unlucky lets go next.\nAufregen bringt da auch nix, ist nur ein Game von vielen. Das eine Spiel macht dann nicht den großen Unterschied.\nDafür gibts aber auch Games bei denen man selbst ordentlich reinfeeded und das eigene Team einen carryed :D","replies":[]},{"poster":"HooQueue","date":"2015-10-02T18:49:15.283+0000","up_votes":1,"down_votes":0,"body":"Bitter, aber ich denke jeder muss/musste früher oder später in den sauren Apfel beißen und wegen inkompetenten Team Mitgliedern absteigen...\nMachen kann man da eh nichts... \nAlso aufstehen, weiter machen.\nOder Wahlweise den Rat des Kollegen befolgen und etwas (nicht jemanden!) durch die Gegend schmeißen :P","replies":[]}]}