{"poster":"TheWreckover","date":"2018-11-07T03:48:34.564+0000","title":"Kai’Sai","subforum":"Gameplay","up_votes":3,"down_votes":1,"body":"I was playing Miss Fortune (yea I know, I didn&rsquo;t want to play her) and I was doing overall well that game. My team goes in, does their stun bullshit and Is being focused. I&rsquo;m back line, let out an ult, and then Kai&rsquo;Sai being a adc/assassin (yea I know that’s the assassins point), takes some damage, but breaks away and deletes me in a manner of a few seconds (she had decent CS, and kills, not super fed ) \nI don&rsquo;t really think she is that broken , but what do you guys think? Does she need a buff or nerf? (I think she could really use a small nerf as her damage can build up in a manner of seconds.) how do you guys feel about having an assassin that can also be adc? There must be a reason she is meta rn  and people gravitate towards banning her.","replies":[{"poster":"Jikker","date":"2018-11-20T22:27:47.387+0000","up_votes":1,"down_votes":0,"body":"Hey guys,\n\nLet's either let this thread die away instead of continuing to bump it or continue the discussion in a respectful way.  Leave insults, name calling, mocking, etc... out of the conversation.\n\nThanks\n\n{{sticker:poppy-wink}}","replies":[]},{"poster":"KFCeytron","date":"2018-11-07T04:48:20.220+0000","up_votes":2,"down_votes":2,"body":"The irony of someone complaining about being bursted by a marksman while playing MF.","replies":[{"poster":"TheWreckover","date":"2018-11-18T08:06:20.007+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=OJ4JViG5,comment-id=0002,timestamp=2018-11-07T04:48:20.220+0000)\n>\n> The irony of someone complaining about being bursted by a marksman while playing MF.\n\nWho was complaining? No one. Go away troll. I even stated I didn’t want to. Try not to be so quick to jump on peoples’ asses next time . I literally avoided complaining about her.","replies":[{"poster":"KFCeytron","date":"2018-11-18T08:57:10.505+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=TheWreckover,realm=NA,application-id=3ErqAdtq,discussion-id=OJ4JViG5,comment-id=00020000,timestamp=2018-11-18T08:06:20.007+0000)\n>\n> Who was complaining? No one. Go away troll. I even stated I didn’t want to. Try not to be so quick to jump on peoples’ asses next time . I literally avoided complaining about her.\n\n\"Kai'Sa killed me in just a few seconds, and here I am on the forums saying she needs a nerf! But I'm not complaining. I'm not saying she needs a nerf, but she does. Do you think she needs a nerf? She obviously does.\"","replies":[{"poster":"TheWreckover","date":"2018-11-19T06:01:46.580+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"KFCeytron","date":"2018-11-19T09:13:43.417+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TheWreckover,realm=NA,application-id=3ErqAdtq,discussion-id=OJ4JViG5,comment-id=0002000000000000,timestamp=2018-11-19T06:01:46.580+0000)\n>\n> The statement that she killed me in seconds is a fact... and I also said she is not that broken, so stop being a troll and just leave.  I wouldn’t call anything I said a complaint. Learn how to write indirect quotes, too. People like you are the reason League has such a toxic playerbase, because people like you want to start unnecessary conflicts. You like to play Devil’s Advocate in attempt to imitate some sort of intellectual ability, but instead you just come off as an insufferable, asinine troll who has nothing better to do than troll forums. You must be fun at parties. That being said, I’ve come to the conclusion to no longer respond to you, because trolls like you strive for the attention that their parents didn’t care to give them.\n\nDo you behave like this in game, too, or only on Boards?","replies":[]}]}]}]}]},{"poster":"Iźuku Midoriya","date":"2018-11-07T05:11:49.372+0000","up_votes":2,"down_votes":1,"body":"Late game her Q single target does over 1000 damage","replies":[]},{"poster":"Wacky9","date":"2018-11-07T04:39:45.897+0000","up_votes":2,"down_votes":1,"body":"Miss Fortune will always have way higher burst than Kai'sa.","replies":[]},{"poster":"DeracadaVenom","date":"2018-11-07T03:49:12.976+0000","up_votes":1,"down_votes":0,"body":"FIRST IM FAST\n\nTo the real question, i think shes a bit like Zoe or Teemo, not to good and not to bad, but SUPER annoying kit","replies":[]}]}