{"poster":"Critmaster Garen","date":"2015-05-02T22:50:23.471+0000","title":"Idea for an AD spellvamp item","subforum":"Gameplay","up_votes":3,"down_votes":5,"body":"i have posted this a long time ago in some random thread on the old gd. since there is still room for such an item in this game, i would like to open a new discussion here.\n\nfrom one of the old discussions with a rioter, the issue with such an item would be, that a spellvamp item for ad casters would need a large amount of spellvamp to be effective. however, if the amount of spellvamp would be too large, the item might actually be picked up and stacked with other spellvamp items by champs like morgana or vlad and push their sustain far over the top. and that the item might generally benefit champions its not aimed at too much.\n\nso the idea ive come up with to taylor the item to ad stacking caster type champions, would be to make the spellvamp itself scale with bonus ad. one primary attribute that ad casters have in common, is that they like to stack large amounts of flat ad. even more so than ad carries. id leave the base stas of the item up to riot, but its passive would look something like this:\n\n> unique passive: gain 10% + (.1 bonus AD) spellvamp\n\n(this would add up to roughly 40% spellvamp at around 300 bonus ad)\n\nwhile the base stats itself of the item are minor. its supposed to serve as an item that would be weak on its own, but that you would like to buy if you stack other big ad items with it.","replies":[{"poster":"Provengreil","date":"2015-05-02T22:54:31.766+0000","up_votes":2,"down_votes":2,"body":"{{champion:84}}","replies":[{"poster":"Critmaster Garen","date":"2015-05-02T22:58:43.205+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Provengreil,realm=NA,application-id=3ErqAdtq,discussion-id=LlIfERvK,comment-id=0000,timestamp=2015-05-02T22:54:31.766+0000)\n>\n> {{champion:84}}\n\nso what? i said the base stats of the item itself would be rather low. if youre not intending to build full on ad, you might aswell go {{item:3152}} \n\nits supposed to be an item that only gets effective if you really stack a lot of ad. in on itself it would be rather weak. exactly to prevent exploits from ap champs with inbuilt spellvamp.","replies":[{"poster":"Provengreil","date":"2015-05-02T23:07:54.185+0000","up_votes":1,"down_votes":0,"body":"I'm saying you've built an item that contains just about half of her passive, and would probably stack with it. They'd ahve to balance the item entirely around her all of a sudden, and there's already one item that literally no one else uses for this exact reason.{{item:3146}}","replies":[{"poster":"Critmaster Garen","date":"2015-05-02T23:13:19.368+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Provengreil,realm=NA,application-id=3ErqAdtq,discussion-id=LlIfERvK,comment-id=000000000000,timestamp=2015-05-02T23:07:54.185+0000)\n>\n> I'm saying you've built an item that contains just about half of her passive, and would probably stack with it. They'd ahve to balance the item entirely around her all of a sudden, and there's already one item that literally no one else uses for this exact reason.{{item:3146}}\n\ngunblade has really strong base stats though, that increase both, ap, ad, spellvamp and lifesteal. so it synergizes with every aspect of her kit.\n\nthe ad scaling passive like i posted would merely give her half of what gunblade has to offer. unless she really stacks a ton of ad. in which case her actual spells wouldnt deal much damage, as they scale mostly with ap.\n\nso even with a ton of spellvamp, she wouldnt get much out of it. at least not more than stacking gunblade with wota and building otherwise ap.\n\nyou have to remember, that the passive i proposed really only kicks in if youre building a ton of ad items. in which case most of akalis spells wouldnt deal much damage to profit from the spellvamp. as only her e scales with ad.\n\nif youre gonna build ad akali, most of her damage would come from her auto attacks, at which point bloodthirster would do more for you than spellvamp.\n\n> [{quoted}](name=LilxPaprika,realm=NA,application-id=3ErqAdtq,discussion-id=LlIfERvK,comment-id=0002,timestamp=2015-05-02T23:11:08.318+0000)\n>\n> I would like to see a spellvamp item that builds like vamp scepter with just tome directly into a 10% spellvamp item. \n> a few ad champs could benefit from a more ad spell vamp, yorick, udyr's q, fiora q and w.\n\nspellvamp triggers on physical damage dealing spells aswell as on magic damage dealing spells. anything that is a damage dealing spell triggers spellvamp.\n\nthe only exception are a few rare spells that trigger on hit effects, like wukongs q. which count as empowered auto attacks and would trigger lifesteal.\n\n> [{quoted}](name=Hagane No Arashi,realm=EUNE,application-id=3ErqAdtq,discussion-id=LlIfERvK,comment-id=0003,timestamp=2015-05-02T23:12:40.335+0000)\n>\n> the thing is that (if i remember correctly) riot doesnt realy want to give ad's spellwamp becaus it caused some problems\n> \n> im trying to recal their post but it was sooo old\n\nyes, because if they gave an ad item just enough flat spellvamp, so it would become attractive to ad casters, it might end up benefiting other types of champions more than the champions the item was aimed at.\n\nits a similar problem of trying to make an ad item for bruisers, that doesnt end up being stronger on champs bruisers are trying to fight (ad carries for example).\n\nbut thats why i proposed to have the spellvamp it grants scale with bonus ad instead of just slapping a flat value on an item.","replies":[{"poster":"Zair Umbras","date":"2015-05-02T23:38:20.426+0000","up_votes":1,"down_votes":0,"body":"Akali's passive is 1% spell vamp per 6 AD. Yours is 1% per 1 AD. With just a Gunblade, she gains 20% from it and 6% from her own passive. With a Gunblade and the item you speak of, she'd have 4% from just the gunblade added in, plus what ever the item has. It doesn't sound like a lot, but that could get really scary really fast with her.\n\nBut more importantly, with how most AD champs actually work, the item itself would be virtually useless because Spell Vamp only heals for a third of the damage dealt on multi-hit/target abilities and it's very uncommon to find any champ who has abilities that are single target. Fiora only has her Q since her R procs on-hit, thus not proc'ing spell vamp. Jax can build a Gunblade and benefit more since he's more AA reliant. Talon has one single target ability and much like Wu, it's an AA so it procs LS, not Vamp. Riven's entire kit is AoE, Zed's kit is AoE except for his R and he doesn't need that healing him, Zix's main ability is single target but that'd cost him damage or tankiness for some minor bits of sustain...\n\nAll in all, most AD champs use abilities that would only benefit a third of the spell vamp. Even if you have 40% vamp, you're only healing for about 13.33% of your abilities if you have 300 bonus AD, which is really hard to do for most AD champs right now since the tank meta has them needing to pick up defensive items.","replies":[{"poster":"Critmaster Garen","date":"2015-05-02T23:41:26.361+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zair Umbras,realm=NA,application-id=3ErqAdtq,discussion-id=LlIfERvK,comment-id=00000000000000000000,timestamp=2015-05-02T23:38:20.426+0000)\n>\n> Akali's passive is 1% spell vamp per 6 AD. Yours is 1% per 1 AD. With just a Gunblade, she gains 20% from it and 6% from her own passive. With a Gunblade and the item you speak of, she'd have 4% from just the gunblade added in, plus what ever the item has. It doesn't sound like a lot, but that could get really scary really fast with her.\n> \n> But more importantly, with how most AD champs actually work, the item itself would be virtually useless because Spell Vamp only heals for a third of the damage dealt on multi-hit/target abilities and it's very uncommon to find any champ who has abilities that are single target. Fiora only has her Q since her R procs on-hit, thus not proc'ing spell vamp. Jax can build a Gunblade and benefit more since he's more AA reliant. Talon has one single target ability and much like Wu, it's an AA so it procs LS, not Vamp. Riven's entire kit is AoE, Zed's kit is AoE except for his R and he doesn't need that healing him, Zix's main ability is single target but that'd cost him damage or tankiness for some minor bits of sustain...\n> \n> All in all, most AD champs use abilities that would only benefit a third of the spell vamp. Even if you have 40% vamp, you're only healing for about 13.33% of your abilities if you have 300 bonus AD, which is really hard to do for most AD champs right now since the tank meta has them needing to pick up defensive items.\n\ni dont follow your calculation.\n\nits .1 bonus ad in spellvamp. meaning the 40 attack damage with the 10% base would give her 14% from the item, adding up to a total of 34% with gunblade.\n\nand then whatever he passive gives her.\n\n\nhow is that more spellvamp than the 20% from gunblade combined with 20% from wota for a total of 40%? not to mention, that she would sacrifice actual spelldamage by building this item, since it wouldnt grant any ap.\n\nyea, she could probably max out the spellvamp she can get by stacking all 3 items. but shes sacrificing an item slot for sustain where she still needs items to do her actual job. shes not going to assassinate anyone with that build.\n\n\nstacking spellvamp items without actually having damage on her spells is not going to get her anywhere. its like the old darius 6 bloodthirster build. sounds op on paper, but its not practical in an actual game.\n\n\nas for the calculation for area effects. im not sure right now. ~~if i remember correctly, it used to be 40% and they incresed it at some point during season 3. however i might be totally wrong here.~~ nvm, it used to be 33% and was increased to 40%","replies":[{"poster":"Zair Umbras","date":"2015-05-03T00:19:30.938+0000","up_votes":1,"down_votes":0,"body":"Honestly? Akali doesn't even assassinate anymore. She just drain tanks. Sometimes she's killing a squishy, but a majority of the time, she's just sustaining through the damage that's being dealt to her. She also is capable of doing damage without much AP. Most of her builds have about 300 or less AP compared to most mages who have over 600-800 AP. Her builds have always been lacking because she has huge bases and her ratios are so high that she doesn't need damage to do damage. If that was the case, people would've been doing DFG Akali and 100-0'ing anyone and anything with a DFG+Q+R+E combo, but she could've just 100-0'd you without having to use the DFG! IF she needed damage, she could also get a Luden's now, but people still rush the Gunblade despite the Luden's giving a lot more damage. People play her to sustain and abuse the hell out of her huge bases and very little need for actual damage items.","replies":[]}]}]}]}]}]}]},{"poster":"Kerrigan 4 Prez","date":"2015-05-02T22:54:48.757+0000","up_votes":1,"down_votes":1,"body":"One small problem i see with this is that is looks like a luxury item, like DFG(if anyone still remembers it). It would have to be more essential to an ad caster to be usable instead of removable.","replies":[{"poster":"Wulf Helhammer","date":"2015-05-02T23:31:11.988+0000","up_votes":1,"down_votes":0,"body":"Umm, DGF wasn't really a luxury item on those that built it. It was usually their first item, and was a central part of their build.","replies":[]}]},{"poster":"Knight SoIaire ","date":"2015-05-02T23:12:40.335+0000","up_votes":1,"down_votes":0,"body":"the thing is that (if i remember correctly) riot doesnt realy want to give ad's spellwamp becaus it caused some problems\n\nim trying to recal their post but it was sooo old","replies":[]},{"poster":"LilxPaprika","date":"2015-05-02T23:11:08.318+0000","up_votes":1,"down_votes":0,"body":"I would like to see a spellvamp item that builds like vamp scepter with just tome directly into a 10% spellvamp item. \na few ad champs could benefit from a more ad spell vamp, yorick, udyr's q, fiora q and w.","replies":[]}]}