{"poster":"Teddy John","date":"2016-02-21T17:48:17.730+0000","title":"Hilfe für Anfänger oder ,,Low Elo´´","subforum":"Level Up: Guides & Tipps","up_votes":5,"down_votes":1,"body":"Hey, meine Name ist Lukas und Ich bin ein Diamond (peak 2 ) Spieler. Da es mir viel Spa&szlig; macht Spielern zu helfen und deren Improvements zu sehen , stehe ich jedem der mich added mit Tipps und Tricks,Builds,Guides,Runes und vorallem Rotations und Gameknowledge zu Verf&uuml;gung. Ich hab in den letzen Seasons jede Rolle gespielt , wurde am Ende aber Main Support, Bin also nicht nur f&uuml;r Main Supports n&uuml;tzlich :). Also wenn jmd Hilfe braucht einfach adden und ich versuch mein Bestes:). (und nein ich will daf&uuml;r nichts haben ) \r\n\r\nUnd weil ein paar Leute mich schon gefragt haben , hab ich mir einen Stream eingerichtet.Du kannst ja mal vorbeischauen und gucken ob ich dir helfen kann.     twitch.tv/flockedlol","replies":[{"poster":"Grimbergen650","date":"2016-03-02T07:24:18.110+0000","up_votes":1,"down_votes":0,"body":"Hi\n\nIch spiele schon ne Weile LoL. Mein Peak war mal Gold 5, aber durch Inaktivität und weil ich keine Zeit mehr hatte bin ich damals wieder gedroppt. Habe es damals nicht wieder auf Gold 5 geschafft.\nAls ich angefangen habe LoL zu spielen, war ich ständig ADC. Nun mit der neuen Dynamic Q spiele ich zu 90% Supporter. Es macht mir Spass, aber ich merke das meine ADC Skills nach und nach verschwinden.\nEin grosses Problem von mir ist meine Passivität. Es habe ein paar Freunde die es vermeiden mit mir Ranked zu spielen, weil ich ihnen zu passiv spiele. Daran würde ich gerne etwas ändern.\nIch würde meine Main Role als Botlaner bezeichnen. \nFalls du mal Lust und Zeit hast kann ich dir gerne meine Ziele mal Ingame beschreiben und dich über meine bekannten Schwächen aufklären.\n\nEs grüsst\nGrimbergen650","replies":[{"poster":"Teddy John","date":"2016-03-02T17:50:25.098+0000","up_votes":2,"down_votes":0,"body":"Support will keiner spielen. Es ist normal das du erstmal nur Support bekommst. und gerade ADC is ne Rolle die sich natürlich durch Mechanics auszeichnet.  Es ist also normal das du da schlechter wirst. Dadurch das du weniger ADC spielst wirst du natürlich auch unsicher, was dazu führt das du als ADC viel passiver stehst als eigentlich nötig. wichtig ist immer die Frage : Was kann mir wirklich passieren ?  Wenn du die Champions alle kennenlernst wirst du merken das du vor ganz vielen situationen gar keine Angst zu haben brauchst. Als Tipp für den anfang würd ich dir erstmal raten : Riskiere so viel wie möglich! am besten im Normalgame. Wichtig ist dabei nicht das du oft reinflashed, sondern dass du wirklich aus den Situationen lernst was und ob du was falsch gemacht hast. Gerade als ADC musst du viel spielen. da bringt dich die Theorie nicht so weit wie die Praxis. Hab keine Angst was falsch zu machen denn du lernst was nur aus Fehlern :)","replies":[{"poster":"Grimbergen650","date":"2016-03-03T06:22:44.891+0000","up_votes":1,"down_votes":0,"body":"Danke für den Tipp.\nIch versuche mal sehr aggressiv zu spielen, um zu schauen wo meine Grenzen liegen.\n\nUnd ich spiele sehr gerne Support :) Man will es kaum glauben :)\nAber da habe ich oft das selbe Problem wie beim ADC. Ich bin viel zu Passiv.\nIch hab einfach den Trick noch nicht raus, wann ich traden kann und wann nicht. \nOft eröffne ich einen trade und überleb es nur knapp.\n\nIch muss mir auch oft anhören warum ich nicht roame. Dazu muss ich dann einfach sagen das ich meistens nicht genau weiss wann der richtige Zeitpunkt dafür gekommen ist. Und gibt es überhaupt den richtigen Zeitpunkt.\n\nHeute Abend habe ich Zeit, werde dich Ingame adden und teste meine Grenzen :)","replies":[{"poster":"Teddy John","date":"2016-03-03T16:01:14.526+0000","up_votes":1,"down_votes":0,"body":"Als Support ist das ähnlich wie bei dem ADC. Du hast einfach zu wenig Erfahrung , also spiel spiel spiel ... !! :D . Auch hier musst du dich fragen : Was kann mir wirklich passieren ? Und sollange dein ADC farmen kann läufts ja erstmal nicht schlecht. Grundregel : Als Support musst du immer dafür Sorgen das der ADC keine Probleme bekommt. Bist du also low oder musst du back, ist das erstmal ganz schlecht. und das ist auch das Risiko beim Roamen. Klar wenn du was bekommst dann is das nice für deinen Midlaner z.b. aber schlecht für deinen ADC wenn du es falsch angehst. und ja : wenn du roam wird dein ADC in 80 % aller Fälle sterben, gerade in ,,low elo´´ weil der meistens garnicht merkt das du weg bist :p. Oft ist farmen ja schon Mittelpunkt der Konzentration weil da auch zu wenig Selbstvertrauen/Erfahrung ist.","replies":[{"poster":"Teddy John","date":"2016-03-03T16:03:35.162+0000","up_votes":1,"down_votes":0,"body":"Auf das Roamen geh ich später nochmal ein , da ich jetzt keine Zeit habe. Ich schreib das aber nochmal hier rein damit alle das lesen können .Adde mich einfach oder guck auf meinem Stream vorbei wenn du glaubst das ich dir helfen kann , der sollte eig am Wochenende wieder laufen können :)","replies":[]}]}]}]}]},{"poster":"Teddy John","date":"2016-04-06T14:10:21.545+0000","up_votes":1,"down_votes":0,"body":"PUSH","replies":[]},{"poster":"Teddy John","date":"2016-03-12T16:24:17.703+0000","up_votes":1,"down_votes":0,"body":"Stream ist wieder up, also wenn ihr noch irgendwelche Fragen habt könnt ihr mich auch auf Twitch finden","replies":[]},{"poster":"Caeldric","date":"2016-03-07T19:10:07.139+0000","up_votes":1,"down_votes":0,"body":"Hi, du scheinst ja den einen oder anderen schon geholfen haben. \nIch denke für mich und für mein team könnte ich diese auch gebrauchen. Bin zwar schon eine weile 30 aber irgendwie bin ich nicht so gut wie ich es gern wäre. schaue mir gern die Lcs an aber dadurch wird man ja nicht automatisch besser. Hast du irgendwelche anfänger tipps die man der reihenfolge nach abarbeiten kann? Main rolle hab ich noch nicht gefunden, zurzeit Supporte ich um schlimmer es zu vermeiden. Wobei ich andere Laines/ Champs interessant finde diese zu können.\nDanke für deine Tipps und deine Zeit.\nCaeldric","replies":[{"poster":"Teddy John","date":"2016-03-07T23:50:49.700+0000","up_votes":1,"down_votes":0,"body":"Hi Caeldric , \nerstmal ist es wichtig eine Mainrolle zu finden. Dazu finde ich es besonders wichtig erstmal so viele Champions wie möglich zu testen. Denn , auch wenn LCS sich nach der Meta richtet, es ist wichtig das du die Champions/Rolle findest an der du erstmal am meisten Spaß hast.Danach kann man konkreter werden was die Reihenfolge der zu erlernenden Fertigkeiten geht. Aber generell kann ich dir schon mal die wichtigsten Attribute nennen die ein guter Spieler haben/können muss: **Wissen über alle Champions**(betrifft Matchups/Stärken/Schwächen usw.) aber keine Sorge Basiswissen reicht meistens außerhalb deiner Mainlane sollange du nicht LCS spielen willst. **Map awareness**,**Geistige Reife**(tilt unter Kontrolle haben wenn es drauf ankommt),**Selbstvertrauen **(es ist das Internet, du kannst sein Wer du willst und keine kann dich verurteilen in dem Spiel außer wenn du mal ein schlechtes Spiel hast. Gerade ein wichtiges Attribut für Sololaner die das 1v1 haben) und **Durchhaltevermögen**. Rom wurde auch nicht in einem Tag errichtet. Wenn ich noch Was grundlegendes vergessen habe kommentiert hier drunter aber das fiel mir jetzt auf die schnelle ein. \n\nEs gibt natürlich bestimmte Eigenschaften und vllt auch Charakterzüge die sich in den Verschiedenen Lanes Herauskristallisieren (Beschrieben wie ich glaube das man sein muss um sich zu verbessern, das bedeutet nicht das alle Mainlaner in die Beschreibung passen): \n\nToplaner: Weiß was er kann, sucht die Herausforderung auch im 2v1, lässt sich auch von Camps nicht aus der Ruhe bringen , hat ein gutes Auge für Teleportmöglichkeiten und hat ein Händchen für gute Engages und Potential eine Lane zu dominieren. \n\nJungler: Hat ein gutes Verständniss vom gesamten Geschehen und kennt jeden Champion in und auswendig, Gankt die Lanes die das größte Potential haben das Spiel zu entscheiden, Nutzt die Stärken seines Teams konsequent und konzentriert, hat kein Problem damit aus unerklärlichen Gründen auf einmal der Mittelpunkt des Hasses zu sein und hat keine Angst die komplizierteste Rolle des Spielst zu haben, \n\nMidlaner: Weiß was er  kann,sucht die Herausforderung auch im 2v1, lässt sich auch von Camps nicht aus der Ruhe bringen , versteht, dass er als zentrale Rolle überall sein kann um seinen Mitspielern zu helfen, sieht Möglichkeiten aus unaufmerksamen Entscheidungen Kills und Leads zu machen,ist sich bewusst dass er zsm mit dem Jungler das größte Snowball-Potential (auf das gesamte Spiel gesehen) besitzt und nutzt dieses auch.\n\nADC: Weiß was er  kann,ist sich darüber im klaren das ein falscher Schritt einen Teamfight entscheiden **kann**,weiß das er sich early auf einen Support verlassen muss ( ja Leute auch wenn ihr euch für Gosu haltet der Support ist ein wichtiger Bestandteil in eurem Spiel),kann auch in hektischen Situationen die Ruhe bewahren,steht immer gut genug um bei vielversprechenden Engages auch DMG machen zu können, weiß das er grundsätzlich gefocust wird.\n\nSupport: Ist quasi das Hirn des Team, weiß das er es nutzen musst nicht farmen zu brauchen,bewahrt grundsätzlich Ruhe,legt dem Team die Kills vor, weiß aber das es zu mehr als vorlegen manchmal nicht reicht, kann sich auch in hektischen Situationen zwischen Engage und Peel entscheiden , hat immer die Minimap im Blick, Pingt die Gefahren auch für die andern Lanes ( ob Gank, Missing, Hilfe) und weiß das er auch durch Roaming seinem Team hilft.Ein Support ist für alle zuständig nicht nur für den ADC.\n\nSo das war jetzt erstmal ne Textwand. Ich sag es gerne nochmal : es heißt nicht das jeder Laner so ist wie beschrieben , aber oben stehen wichtige Attribute die ihr für eure jeweilige Rolle beherzigen solltet.\n\nHoffe ich konnte dir irgendwie helfen. Wenn du was hast kannst du mich gerne Adden oder hier in dem Forum posten .","replies":[{"poster":"Teddy John","date":"2016-03-07T23:52:41.361+0000","up_votes":1,"down_votes":0,"body":"Manche Tipps sind natürlich auch Rollen übergreifend und ich habe bestimmt auch viel vergessen. Wenn ihr mit einer bestimmten Aussage nicht zufrieden seid schreibt es drunter und wir diskutieren gemeinsam darüber :)","replies":[]}]}]},{"poster":"Teddy John","date":"2016-03-02T17:51:12.959+0000","up_votes":1,"down_votes":0,"body":"Der Stream geht wieder online sobald Unitymedia das Loch in meiner Internet-Leitung gefixt hat,","replies":[]},{"poster":"ponzu","date":"2016-02-23T17:38:49.785+0000","up_votes":1,"down_votes":0,"body":"Wie carried man deiner Meinung nach am besten ein game? Selbst wenn ich 6/1 stehe und als jungler anderen kills oder assist gegeben habe ist es für mich ein Problem das auszunutzen und das Spiel richtig zu carrien","replies":[{"poster":"Teddy John","date":"2016-02-23T22:09:09.858+0000","up_votes":1,"down_votes":0,"body":"wichtig sind nicht nur die kills. Wenn du 6/1 stehst dann bist du in einer guten Position die Objectives zu contesten. kill nicht nur die Gegner , push auch die Turrets weg. Invade den Gegner-Jungler auf der Seite mit deinen gefeedeten Mates und nimm alle Drakes und Heralds die du kannst. Benutze die Starken Lanes um das Game zu dominieren. . Versuche nicht die Lane die behind ist auch hoch zu bekommen , sondern versuche die Starken noch stärker zu machen und mit denen das spiel zu gewinnen. Und denk dran : Vision gewinnt Games. Kaufe immer Pinks und zwinge deine Mates die auch zu kaufen .","replies":[{"poster":"SethHaveron","date":"2016-02-28T02:33:07.136+0000","up_votes":1,"down_votes":3,"body":"geht das auch auf deutsch???     diesen englisch müll solltet ihr euch echt mal abgewöhnen","replies":[{"poster":"Teddy John","date":"2016-02-28T11:50:32.749+0000","up_votes":1,"down_votes":0,"body":"wichtig sind nicht nur die Tötungen. Wenn du 6/1 stehst dann bist du in einer guten Position die Objekte zu umkämpfen. töte nicht nur die Gegner , reiße auch die Türme weg. Falle in den  Gegner-Dschungel auf der Seite mit deinen starken Team-Mitgliedern ein und nimm alle Drachen und Herolde die du kannst. Benutze die starken Verbündeten um das Spiel zu dominieren. . Versuche nicht die Verbündeten die etwas zurückgeworfen wurden auch hoch zu bekommen , sondern versuche die Starken noch stärker zu machen und mit denen das Spiel zu gewinnen. Und denk dran : Sicht gewinnt Spiele. Kaufe immer magische Augen und zwinge deine Teammitgliedern die auch zu kaufen .\n\n\nHoffe das macht dich glücklich. Aber die meisten Leute spielen das Spiel halt auf Englisch und gucken auch die Englische LCS. Die englischen Wörter sind oft nicht so umständlich und wie ich finde klingen sie besser ( Siehe ,,Lane´´,, Mates`` ,, Pinks´´). Wichtig ist das man versteht was ich meine. In deinen Games spielst du ja fast ausschließlich mit Leuten außerhalb Deutschlands.","replies":[]},{"poster":"Abasin","date":"2016-03-03T12:48:04.617+0000","up_votes":1,"down_votes":0,"body":"Lerne lieber diesen Sprachgebrauch. Nicht jeder wird Dir die Gefälligkeit erweisen, seinen Jargon zu übersetzen.","replies":[]}]}]}]},{"poster":"CestLeMoi","date":"2016-02-28T08:14:41.086+0000","up_votes":1,"down_votes":0,"body":"Hallo :)\nIch würd dich gerne ingame adden, wenn ich darf :^)","replies":[{"poster":"Teddy John","date":"2016-02-28T11:40:59.534+0000","up_votes":1,"down_votes":0,"body":"gerne :)","replies":[]}]},{"poster":"Beli Vitez","date":"2016-02-21T20:25:34.029+0000","up_votes":1,"down_votes":0,"body":"machst du auch analysen?","replies":[{"poster":"Teddy John","date":"2016-02-21T22:15:55.735+0000","up_votes":1,"down_votes":0,"body":"hab da noch nie drüber nachgedacht aber wieso nicht :)","replies":[{"poster":"invite mich mal","date":"2016-02-24T19:47:10.279+0000","up_votes":1,"down_votes":0,"body":"Sag mir bitte wa sich early/mid besser machen könnte.\n\nreplay.gg/search/euw/Num5 to victory#2533876381","replies":[{"poster":"Teddy John","date":"2016-02-25T13:11:07.117+0000","up_votes":1,"down_votes":0,"body":"hast du ein bestimmtes game oder soll ich einfach das letzte nehmen ?","replies":[{"poster":"invite mich mal","date":"2016-02-26T10:45:57.467+0000","up_votes":1,"down_votes":0,"body":"Am besten das Illaoi Game","replies":[]}]}]}]}]},{"poster":"xSena","date":"2016-02-25T23:10:06.284+0000","up_votes":1,"down_votes":0,"body":"Hey :) ich wollte mal fragen wann du den meistens streamst oder ob das überhaupt regelmäßig machst :3","replies":[{"poster":"Teddy John","date":"2016-02-26T06:54:04.301+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne regelmäßig streamen, hab im Moment aber ein paar Schwierigkeiten mit meiner Internetleitung. Sobald alles klar ist werde ich auch in die Streambeschreibung die Zeiten schreiben damit auch alle Bescheid wissen :)","replies":[]}]},{"poster":"Elyosano","date":"2016-02-24T12:43:44.610+0000","up_votes":1,"down_votes":0,"body":"Hey ich spiele auch main Support und ein paar allgemeine tipps wären sehr cool. also abgesehen von den grundlegenden dingen :)","replies":[{"poster":"Teddy John","date":"2016-02-24T19:06:08.761+0000","up_votes":1,"down_votes":0,"body":"das problem ist: jeder hat seine eigene Vorstellung von grundlegenden Dingen. Deshalb würd ich dir vorschlagen du addest mich mal ingame und wir können ein bißchen konkreter werden,","replies":[{"poster":"Elyosano","date":"2016-02-25T10:34:45.836+0000","up_votes":1,"down_votes":0,"body":"Hey ja klar kann ich gerne machen :)","replies":[]}]}]},{"poster":"HallowedDream","date":"2016-02-23T22:39:33.769+0000","up_votes":1,"down_votes":0,"body":"Kann den Herr'n hier nur Empfehlen :D Dank seinen Tipp's bin ich nun innerhalb 2 Tagen 2 divisons aufgestiegen . Danke dir nochmal das du dich Abends noch um mich gekümmert hattest :)","replies":[{"poster":"Teddy John","date":"2016-02-24T07:33:13.388+0000","up_votes":1,"down_votes":0,"body":"Das ist ja super ! Freut mich das ich helfen konnte :) Wenn noch was ist dann schreib mich einfach an :)","replies":[]}]},{"poster":"Reaz83","date":"2016-02-22T13:11:07.193+0000","up_votes":1,"down_votes":0,"body":"Mir ist auf gefallen das viele eine positive kda haben so wie ich ... wie kann das sein das man nicht aufsteigt ...\n\nWeil theoretisch killt man mehr als man stirbt ... also sollte man ja aufsteigen früher oder später ... sehe auch Leute mit schlechter kda in der selben liga ? Glück ?\n\nSind bloß meine Gedanken die mir durch den Kopf gehen ...\n\n\nWas ist im low elos besser ... z.b.\nMein team hat kein tank ... sollte ich dann ein Tank picken und hoffen das die anderen dmg machen oder einfach ego modus und picken was man spielen will ?","replies":[{"poster":"Teddy John","date":"2016-02-22T23:08:46.112+0000","up_votes":1,"down_votes":0,"body":"zu Frage 2 : \nIch finde es persönlich in Low Elos besser einen Champ zu spielen mit dem man selbst Carrien kann WICHTIG : Vorraussetzung ist das man auf ihm wirklich gut ist und das Ziel hat die lane zu stompen. Sonst kann so ein Pick auch gerne mal in die Hose gehen . Dein Ziel ist ja dann kein 29-29 sondern ein 30 - 6 fürs ganze team damit du vor dem Zeitpunkt an dem die Teamcomb entscheidet schon gewonnen hast. spielst du allerdings ne Lane die du nicht oft spielst und safe spielen willst, dann bieten sich cc tanks natürlich an. Merke : es macht nur Sinn wenn du dir sicher bist das du was kannst. gehst du behind ist der pick nutzlos im vergleich mit einem tank. Dann hast du nämlich 5 squishys die von den gefeedeten Gegnern zerstört werden :)","replies":[]},{"poster":"Teddy John","date":"2016-02-22T17:19:39.133+0000","up_votes":1,"down_votes":0,"body":"erstmal ist zu sagen das die KDA viel zu hoch angesehen wird, gerade in  bronze/silber/gold. du bist keine besserer spieler als ein anderer nur weil deine KDA besser ist. wenn einer 3 mal stirbt aber dafür das team 3 teamfights gewinnt ist das natürlich besser als wenn du vermeidest zu sterben weil du auf deine kda achtest und dann nicht so viel dmg machst wie du könntest. und selbst bei einer Positiven KDA gibt is natürlich unterschiede. Wenn du als midlaner zum Beispiel 7/2/4 stehst, dann heißt das du hast -- von der KDA her-- gut gespielt. Wenn du aber 9/9/2 stehst hast du auch eine positive KDA aber du hast gleichzeitig auch gefeedet, also ist irgendeiner von den gegnern auch stark. Und wie ich oben schon geschrieben habe. Wenn du die 7/2/4 KDA hast und das game verlierst hast du wahrscheinlich zu wenig gemacht. Selbst wenn du nur verlierst wenn dein ADC sich catchen lässt, hättest du mit diesem Start das Game schon viel früher dominieren müssen. Das ist ja das selbe prinzip was es den Pros so leicht macht in der low elo zu smurfen. Bjergsen kommt nicht in die Situation in der er sich im Lategame aufs Team verlassen muss. Ich hoffe das hast du irgendwie verstanden auch wenn das jetz viel text war. Wenn ich dir das genauer erklären soll oder du noch andere Fragen hast  guck doch mal in meinem Stream vorbei. Den zweiten Teil deiner Frage beantworte ich nachher da ich jetz keine zeit habe","replies":[]}]},{"poster":"ELOW Cronos","date":"2016-02-22T12:56:23.083+0000","up_votes":1,"down_votes":0,"body":"Ich versuche mir gerade als Zweitlane Mitte anzutranieren und denke ich könnte da den ein oder anderen Tipp gut gebrauchen, da ich ziemlich schlecht bin in der Rolle (und ja ich weiss das mein Farm be********  ist).","replies":[{"poster":"Teddy John","date":"2016-02-22T16:16:02.681+0000","up_votes":1,"down_votes":0,"body":"dann empfehle ich dir dich auf erstmal 2-3 champions zu beschränken. gerade wenn mitte deine zweitlane ist bekommst du die nicht so oft es sei den du bist main toplaner. Farm kommt vom Spielen und von Erfahrung , du bist am anfang immer schlecht .wenn du nicht weiter weißt guck dir ein paar soloq games von den profis an. vergleiche deren runen und masteries und vorallem ihren Manahaushalt. Für viele Leute ist der nämlich das wirkliche problem. Versuche auf jeden fall alle lasthits die möglich sind mit autoattacks. Im Detail erkläre ich dir das am Besten im Stream oder wenn ich mal Zeit habe. Aber ich hoffe die Tipps von oben helfen dir erstmal :)","replies":[]}]},{"poster":"Teddy John","date":"2016-02-22T10:13:14.911+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]}]}