{"poster":"MonkeyCarriesU","date":"2016-09-16T07:51:34.789+0000","title":"Haiku Pro - Plat/Diamond Team","subforum":"Reclutamento","up_votes":1,"down_votes":0,"body":"Salve, con il ritorno delle team ranked e con l&#039;annuncio della presenza dei premi pure per il TR ho deciso cos&igrave; di creare, o almeno provare a creare un team. \r\n\r\n**Requisiti per poter partecipare al team:**\r\n\r\n* Elo: Plat 3 +,\r\n* Avere disponibilit&agrave; a fare almeno 2-3 ranked team al giorno,\r\n* Essere disponibili a migliorare ed accettare critiche, si include il fatto di essere autocritici,\r\n* Non &egrave; necessario essere santi, pure io sono una persona leggermente tossica, per&ograve; in caso di errori o quant&#039;altro se ne dovr&agrave; parlare a tempo perso e non durante il game,\r\n* Disponibili a partecipare ad eventuali tornei online sia 5v5 che 3v3.\r\n\r\nPer altre informazioni aggiungetemi in game oppure commentate qui sotto.","replies":[{"poster":"MonkeyCarriesU","date":"2016-09-16T20:05:04.575+0000","up_votes":1,"down_votes":0,"body":"Un account creato giusto per screditarmi, simpatica la cosa. Se per secondo account intendi il tuo allora si, è ora che ti riformi ed impari a controllarti poichè a quanto pare necessiti di uno psicologo, uno di quelli bravi.\n\nP.S.: Non ho mai negato che sono a volte tossico ed altra cosa, è decisione di ciascuno vedere se giocare con me o meno, non cosa che spetta a te in quanto non artefice delle decisioni altrui.","replies":[{"poster":"pipino97","date":"2016-09-16T20:42:07.339+0000","up_votes":1,"down_votes":1,"body":"Per scrivere sul forum bisogna essere al livello 30 comunque, e comuque ti conosco da tempo e so che flammi troppo e tutti per qualsiasi errore. Toxic on the road.","replies":[]}]},{"poster":"pipino97","date":"2016-09-16T19:07:31.300+0000","up_votes":1,"down_votes":1,"body":"Non giocate con kassadin, roamma solamente dalla mattina alla sera, secondo account perchè il primo bannato per flaming. Enjoy!\n\n[modificato da mod per name e shame]","replies":[]}]}