{"poster":"DarkkEvill","date":"2018-05-11T06:57:23.026+0000","title":"Solicito un nerfeo a Maestro Yi.","subforum":"Charlas Generales","up_votes":2,"down_votes":9,"body":"Hola buenas a todos, hago este post para solicitar un nerfeo a M&aacute;estro yi, &uacute;ltimamente este champ de destaca de una manera descomunal en el juego, y al parecer es el jungla m&aacute;s baneado despu&eacute;s de jax... no hace falta kills para que est&eacute; fuerte, ya que en muchos partidas vi a un m&aacute;ster yo s&eacute; destacaba de una manera exagerada, solo pido que por favor hagan un nerf en sus habilidades, ya que es extremadamente r&aacute;pido y tiene much&iacute;simo da&ntilde;o, en mi &uacute;ltima partida contra yi iba 14/3 con zed apareci&oacute; yi por atr&aacute;s con su R no me di&oacute; tiempo a nada, nisiquiera estaba feed que ya me baj&oacute; 2k con su Q y 2 b&aacute;sicos, esto es una exageraci&oacute;n y eso no es nada t&eacute;rmino la ranked con una pentakill, solo quer&iacute;a pedir esto nom&aacute;s y si alguien est&aacute; de acuerdo que coment&eacute;, de lo contrario ahorrar comentarios negativos, muchas gracias..","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2018-05-11T07:04:22.079+0000","up_votes":5,"down_votes":0,"body":"JAJAJAJA y como no va a carrear si tu equipo eran 5 papeles ({{champion:202}} {{champion:99}} {{champion:238}} {{champion:17}} {{champion:121}}) y los únicos que compraron \"algo\" de armadura fueron vos con el GA y las {{item:3047}} del K6. Mientras tanto, su team ({{champion:21}} {{champion:11}} {{champion:3}} {{champion:53}} {{champion:8}} ) con 2 iniciadores y daño bien distribuido. Quisiera saber quién fue el genio de tu equipo que decidió que era buena idea ir full daño contra esa composición.","replies":[]},{"poster":"DarkkEvill","date":"2018-05-11T08:25:55.423+0000","up_votes":2,"down_votes":2,"body":"La verdad que tenés toda la razón, pero de todas formas el máster yi tiene un daño inmenso, y merece un nerfeo.. por lo menos más enfriamiento en su Q..  y en cuanto la composición cada uno elige la que quiere y sabes cómo es esto, le dices a tal jugador que vaya tanque y no te hacen caso, así es este Elo silver en el que estoy atrapado, hay muy poca gente que se elige champs de acuerdo a la necesidad de un equipo, y te puedo asegurar que en bronce hay más equipo y buenas personas que en silver..","replies":[{"poster":"rokushoger","date":"2018-05-11T14:08:53.293+0000","up_votes":2,"down_votes":0,"body":"> le dices a tal jugador que vaya tanque y no te hacen caso\n\nEntonces el problema no es master yi sino las personas que le juegan en contra. No se puede balancear un campeón solamente porque alguien no sepa como jugar con o contra él.\n\nSaludos!","replies":[]},{"poster":"Juice Wrld","date":"2018-05-11T12:48:04.118+0000","up_votes":1,"down_votes":0,"body":"Dat jajajajahahaja","replies":[]}]},{"poster":"B r a n d ø n","date":"2018-05-11T13:20:24.369+0000","up_votes":1,"down_votes":0,"body":"jajajajjajaj si ban a nerfear a yi porque un silver llora en los foros","replies":[]},{"poster":"DIOS TUTI","date":"2018-05-11T13:16:25.215+0000","up_votes":1,"down_votes":0,"body":"pickea lulu o fidlesticks, apreta w o q respectivamente, no es muy dificil, con 2 muñones lo logras, y cuando se la tiras o lo convertis en un animal por 2 segundos, o le tiras un fear que lo manda a su base al master yi porque es inmune a ralentizaciones, respectivamente.","replies":[]},{"poster":"Pinke","date":"2018-05-11T10:13:33.615+0000","up_votes":1,"down_votes":0,"body":"{{item:3047}} {{item:3075}} {{item:3143}} {{champion:33}} Entre otras opciones si no sabes como hacerle counter con cc :/\n{{sticker:slayer-jinx-wink}}","replies":[]}]}