{"poster":"Fuq the Meta","date":"2016-09-03T05:36:31.576+0000","title":"Second time i DC'd in the lobby.... TODAY!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"This is the second time i disconnectd in the lobby today. I had 0 problems this entire day playing leauge of legends or any other time. But today Leauge decdided to disconnect me 2 times in the lobby. The first time i had to wait 6min and -3lp, which is bs because its not my fault so i understand. Now my second DC is while i am in promos! WTH RIOT! This is not fair! Now i lost a lot more lp, and i have a LOSS in my promos AND i have to wait another 30 minutes?\r\nWhy am i being dc'd? And dont even let me bring up the fact that i ONLY get a lag spike in a game when its a team fight ( not when im farming or going to lane or anything safe) Whats up with all these conspiracies?\r\n\r\nPlease take off this 30min wait, restore my lp, and take off my loss in my promos. This is not fair, this is not fair! Please me fair for once!\r\nPLEASE DO SOMETHING RIGHT! PLASE!","replies":[{"poster":"Porocles","date":"2016-09-03T22:28:33.481+0000","up_votes":1,"down_votes":0,"body":"Your network may be having problems maintaining a connection, and leaving you behind.  Go over our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot this and get you fixed up.  Leaving will count as a [queue dodge](https://support.riotgames.com/hc/en-us/articles/201751844-Queue-Dodging), and not something that can be removed.  The best way to resolve it is by fixing whatever is causing you to leave.  Let me know if you have any questions.","replies":[{"poster":"Fuq the Meta","date":"2016-09-04T09:55:25.312+0000","up_votes":1,"down_votes":0,"body":"I checked my internet speed. It never gets disconnected or has bumps in its signal. It is literally only with your game that disconnects me. Persay i can load up and interact with facebook while it is \"Attempting to reconnect\". But its okay, its not only the lobby where i dc. It happens when i get ganked, or dove on, or when its a team fight! :D","replies":[]}]},{"poster":"BenneCloff","date":"2016-09-03T07:26:39.273+0000","up_votes":1,"down_votes":0,"body":"Having the same shit since the last 2 weeks","replies":[]},{"poster":"Fuq the Meta","date":"2016-09-03T05:38:23.599+0000","up_votes":1,"down_votes":0,"body":"And for the love of jesus, stop running away from these costumer problems by deleting the thread and saying \"not in the right board\" and actually help us out.","replies":[]}]}