{"poster":"Akurojin","date":"2015-02-28T21:15:17.979+0000","title":"Lag of Legends - Vergognoso","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"Premessa: non ho problemi di rete, né un computer scarso. Gioco senza problemi a giochi come Titanfall o Battlefield 4 senza lag, senza crash e senza cali di frame rate.\n\nPoco fa stavo giocando una partita classificata. Non sono un grande giocatore, ma quando succedono certe cose mi altero.\nAd un certo punto \"Lag of Legends\" - a causa di una perdita di connessione di UN secondo - ha crashato. Non è la prima volta che succede da 2 o 3 patch a questa parte.\nAbbiamo perso la partita perché non son più riuscito a connettermi, se non alla fine, anche se la connessione comunque andava. Ho dovuto riavviare il computer, cambiare DNS ed aspettare che il launcher si avviasse.\n\nVorrei capire perché diamine ogni volta che manca la connessione per un solo secondo il gioco crashi. Non è un problema del mio computer, perché prima delle patch andava tutto bene.\n\nAd ogni modo sono stato riportato. Niente da dire, anche io riporterei giocatori che si disconnettono in una classificata. Mi fa incazzare (fatemi passare il termine) il fatto che io mi sia beccato una penalità di 5 partite in una coda con bassa priorità \"perché AFK\", quando in realtà è il gioco che crasha per qualche ORRORE a livello di codice (e so di cosa parlo).\n\nQuesto non è un gioco. Questo è un bug con elementi di gioco qua e là. Decidetevi a fare patch che risolvano bug e soprattutto, non bannate persone a cavolo. Per tre partite di fila mi son beccato la stessa persona in ranked e per tre volte ha \"trollato\". Abbiamo perso e questa qui continua a giocare, mentre io ho la penalità.\n\nA qualcun altro capitano 'sti crash vergognosi?","replies":[{"poster":"cicicicacacaca","date":"2015-03-01T00:06:58.686+0000","up_votes":1,"down_votes":0,"body":"E' da una settimana quasi che non riesco a giocare per i crash, connesione ok, fps 60 e boh si disconnette... ho anche formattato il PC ieri ma comunque oggi non sono riuscito a giocare... spero risolvano.","replies":[{"poster":"Heretic Dream","date":"2015-03-01T01:00:46.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=cicicicacacaca,realm=EUW,application-id=98NGV4Al,discussion-id=UxJ9lEHA,comment-id=0000,timestamp=2015-03-01T00:06:58.686+0000)\n>\n> E' da una settimana quasi che non riesco a giocare per i crash, connesione ok, fps 60 e boh si disconnette... ho anche formattato il PC ieri ma comunque oggi non sono riuscito a giocare... spero risolvano.\n\nPiù persone riscontrano lo stesso problema, state tranquilli ovviamente risolveranno, non serve impanicare al punto di formattare, nel caso comunque pensiate che ci siano problemi al vostro client è sufficiente utilizzare la funzione *Ripara*.","replies":[{"poster":"Akurojin","date":"2015-03-01T09:24:28.675+0000","up_votes":2,"down_votes":0,"body":"Essendo gli sviluppatori a conoscenza del problema, non dovrebbero avvertire i giocatori o comunque essere un po' più \"elastici\" sulle penalità? Ormai le ho scontate (giocando contro i bot a livello beginner per vincere velocemente), ma dover attendere minimo 5 minuti di coda per 5 partite, a causa di un loro errore, non è che mi vada molto a genio!","replies":[]},{"poster":"cicicicacacaca","date":"2015-04-02T18:10:37.028+0000","up_votes":1,"down_votes":0,"body":"A me non è stato risolto nulla, non so per gli altri","replies":[]},{"poster":"cicicicacacaca","date":"2015-03-02T15:34:28.436+0000","up_votes":1,"down_votes":0,"body":"Avevo già eseguito il repair ma nessun progresso. Avevo già in programma di formattare il PC e ne ho approfittato per vedere se cambiasse qualcosa... spero risolvano presto.","replies":[]}]}]},{"poster":"kremis88","date":"2015-03-01T13:46:02.139+0000","up_votes":1,"down_votes":0,"body":"anchio ho notato qualche isolato lag ogni tanto ma si tratta di poco o nulla per il resto gioco tranquillamente","replies":[]}]}