{"poster":"xxxMadLionxxx","date":"2018-05-10T22:11:55.779+0000","title":"Does lichbane and nashors need some love?","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"title...","replies":[{"poster":"DW Diana","date":"2018-05-10T22:17:18.316+0000","up_votes":3,"down_votes":0,"body":"Lichbane is actually in a really good spot for those that use it. \nNashors scales really well but is a poor starting item on most (I think only {{champion:268}} and {{champion:10}} actually rush it anymore) but is still good on people later on {{champion:131}} {{champion:17}} etc. This thing is for it's cost Nashors Tooth gives a LOT. It gives on hit on your aa that scales off AP, 50% attack speed, 80 AP AND 20% CDR. I'm not sure what else they can do for it really. It was always a bit of a niche item anyway.","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-05-10T22:20:32.551+0000","up_votes":1,"down_votes":2,"body":"Lichbane is just fine. Good lategame pick for almost any mage, espeically if they want to splitpush or seige due to team being monkeys. Core item on a lot of duelist or assassin mages.\n\nNashors probably needs a rework, but the real issue is the same thing rageblade has: the pool of champs that use AP and attack-speed/onhit is just {{champion:10}} {{champion:268}} {{champion:131}}","replies":[{"poster":"Infernape","date":"2018-05-10T22:22:35.332+0000","up_votes":2,"down_votes":0,"body":"Teemo and Varus both build AP, AS and on hit items.","replies":[]},{"poster":"DW Diana","date":"2018-05-10T22:21:26.833+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=bjwbP4Eu,comment-id=0001,timestamp=2018-05-10T22:20:32.551+0000)\n>\n> Lichbane is just fine.\n> \n> Nashors probably needs a rework, but the real issue is the same thing rageblade has: the pool of champs that use AP and attack-speed/onhit is just {{champion:10}} {{champion:268}} {{champion:131}}\n\nAnd changing it in any drastic way would fuck them over lol.","replies":[]}]},{"poster":"SwiftKitten88","date":"2018-05-11T02:22:15.496+0000","up_votes":1,"down_votes":1,"body":"{{item:3100}}  is absolutely fantastic.. it gives every single stat you could ask for on an ap assassin..\nCDR movement speed decent AP, some mana and a decent proc\n\ni mean with damage creep the way it would be better increase the proc damage to be in line with the other items. 50% ap is nothing compared to what AD gets on things like {{item:3147}}  which get an adtinally and completely busted blackout passive on top of that. (is if warding properly wasnt hard though to do after the removal of trackers)\n\nbut im still pretty hesitant to ask to add more damage creep just because everything else is op.","replies":[]},{"poster":"AirKingNeo","date":"2018-05-11T02:00:53.772+0000","up_votes":1,"down_votes":1,"body":"Nashors is fine, and I'm a Kayle main.\n\nLich Bane needs help though. A cost reduction preferably.","replies":[]},{"poster":"remakoro","date":"2018-05-10T22:27:03.218+0000","up_votes":1,"down_votes":1,"body":"Give them love. Hot and passionate. They deserve it {{champion:17}}","replies":[]},{"poster":"Aatrox Mid 1v5","date":"2018-05-10T22:42:11.832+0000","up_votes":1,"down_votes":3,"body":"Nashors should cost a lot less, give reduced AP and increase the amount of ap is converted to on hit damage.","replies":[]}]}