{"poster":"xxxMadLionxxx","date":"2016-11-30T14:33:40.852+0000","title":"Some skins are so awsome they could have been a new Champ entirely.....","subforum":"Gameplay","up_votes":31,"down_votes":4,"body":"Before you down vote.... just here me out.\r\n\r\nFor example, {{champion:18}} dragon trainer/pet skin could have been a new ADC all by itself. The concept of someone wielding a mini dragon as a gun would make for a great ADC. I feel like it is a great skin, but it would have more potential as a new champ.\r\n\r\nSame with elemental Lux, Fabulous skin! Would have made for a great idea for new a mage. \r\n\r\nThe idea could have been a mage that had too much power and could not fully control which element she used. So her passive would be that the mage would randomly switch elemental modes every x amount of seconds. There would only be like 3 element cause 9 is just way to much and each element would add a passive effect to her base spells. For example, fire element would add some AOE DOT. Ice element would add some slows and snares. Lightning would add some move speed buffs and electric charge bonus damage. \r\n\r\nThe catch is she can&#039;t pick which element she would want.\r\n\r\nAnyway... all in all, the point I want to make is that there are some skins that are so cool, they would have made great themes for new champs.","replies":[{"poster":"hunterspec","date":"2016-11-30T14:41:18.030+0000","up_votes":4,"down_votes":11,"body":"lol, riot is only good at making new skins. when is the last time they made a good champ? jhin?","replies":[{"poster":"TheHappyReaperz","date":"2016-11-30T14:54:58.381+0000","up_votes":15,"down_votes":2,"body":"Jhin, Tahm, Kled, Yorick rework (almost a new champ), etc.","replies":[{"poster":"hunterspec","date":"2016-11-30T15:00:16.313+0000","up_votes":2,"down_votes":12,"body":"> [{quoted}](name=TheHappyReaperz,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=00010000,timestamp=2016-11-30T14:54:58.381+0000)\n>\n> Jhin, Tahm, Kled, Yorick rework (almost a new champ), etc.\n\nyorick? lol I loved him before it he was one of my fav champs now he sucks and kled? good joke","replies":[{"poster":"TheHappyReaperz","date":"2016-11-30T16:04:04.796+0000","up_votes":11,"down_votes":0,"body":"Yorick is awesome. He used to be, \"Let's get tear, spam E, win lane\". He also looked terrible, he looked like a jumping tumor. New Yorick has a defined role, cuter ghuols, and overall is just more interactive and fun to play. Kled has one of the best VO's in the game, and is a blast to play.","replies":[{"poster":"YumaS2Astral","date":"2016-11-30T17:49:01.124+0000","up_votes":7,"down_votes":0,"body":"I still think new Yorick has some problems. Namely the fact that despite what Riot said about his new ultimate, it doesn't actually is good for splitpushing. This is because towers focus on the Maiden of Mist and it is killed by only a few tower shots. His ultimate honestly is only useful for 1x1 duels and is useless otherwise, especially because of its long cooldown. Also, Yorick's ghouls are one shotted late game, which is a problem especially with AoE abilities and ADCs with Runnan's Hurricane. If both of those problems were solved, Yorick would feel really good to play right now. At least he is way healthier than his old self.","replies":[{"poster":"Darth Sidiouss","date":"2016-11-30T19:40:23.303+0000","up_votes":2,"down_votes":0,"body":"Dont ever leave the maiden alone you never leave her alone you push with her and attack anything that comes near you.","replies":[]}]},{"poster":"Muddafragot","date":"2016-11-30T23:32:05.348+0000","up_votes":2,"down_votes":0,"body":"Kled is just a mobile, cd version of Darius. By which I mean you're an asshole for playing him.","replies":[]},{"poster":"hunterspec","date":"2016-11-30T16:13:07.063+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=TheHappyReaperz,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=0001000000000000,timestamp=2016-11-30T16:04:04.796+0000)\n>\n> Yorick is awesome. He used to be, &quot;Let&#x27;s get tear, spam E, win lane&quot;. He also looked terrible, he looked like a jumping tumor. New Yorick has a defined role, cuter ghuols, and overall is just more interactive and fun to play. Kled has one of the best VO&#x27;s in the game, and is a blast to play.\n\nyes I found him fun. I had around 100k points in him. he looked terrible I can agree but the new voice for yorick and his lines? uhhhhh no thanks the lines on the old one 100x better. \"you will remember yorick Morrie\" etc.  So now VO's now define if champs are good or not? I admit I played nami for her sexy ass Japanese voice but she didn't turn into my favorite support.","replies":[{"poster":"TheHappyReaperz","date":"2016-11-30T17:07:09.853+0000","up_votes":2,"down_votes":0,"body":"\"but the new voice for yorick and his lines? uhhhhh no thanks\" + \"So now VO's now define if champs are good or not?\"\n\nAlrighty then. Regardless, Kled's VO improve's his gameplay, making it more fun, but his skills and playstyle are still pretty awesome, even if you don't feel like listening to him.","replies":[{"poster":"hunterspec","date":"2016-11-30T17:28:55.884+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=TheHappyReaperz,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=000100000000000000000000,timestamp=2016-11-30T17:07:09.853+0000)\n>\n> &quot;but the new voice for yorick and his lines? uhhhhh no thanks&quot; + &quot;So now VO&#x27;s now define if champs are good or not?&quot;\n> \n> Alrighty then. Regardless, Kled&#x27;s VO improve&#x27;s his gameplay, making it more fun, but his skills and playstyle are still pretty awesome, even if you don&#x27;t feel like listening to him.\n\nI was comparing new vs old yorick lines not saying \"old yorick is only good because his lines.\" lmfao","replies":[]}]}]},{"poster":"Dynamiku Entry","date":"2016-11-30T21:12:26.720+0000","up_votes":1,"down_votes":0,"body":"Holy SHIT! WHERE THE HELL ARE WE?!?!","replies":[]},{"poster":"Big Lincoln","date":"2016-11-30T20:38:50.413+0000","up_votes":1,"down_votes":1,"body":"yorick is just a shittier nasus with ghouls that die from any auto attack\n\nprobably the least interesting juggernaut","replies":[]}]}]},{"poster":"THE RlVER KlNG","date":"2016-11-30T20:31:25.966+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheHappyReaperz,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=00010000,timestamp=2016-11-30T14:54:58.381+0000)\n>\n> Jhin, **Tahm**, Kled, Yorick rework (almost a new champ), etc.\n\nBest champ EVER released imo","replies":[]}]},{"poster":"Ayame Isaki","date":"2016-11-30T21:05:52.158+0000","up_votes":2,"down_votes":0,"body":"{{champion:163}} \n\nTaliyah was awesome up until they replaced her W with a vector cast (which really hurt her kits flow IMO). She is still one of my favorite champs, nonetheless.","replies":[{"poster":"hunterspec","date":"2016-11-30T21:25:24.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayame Isaki,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=00010001,timestamp=2016-11-30T21:05:52.158+0000)\n>\n> {{champion:163}} \n> \n> Taliyah was awesome up until they replaced her W with a vector cast (which really hurt her kits flow IMO). She is still one of my favorite champs, nonetheless.\n\nI played her for the first time recently she was ok. not the worst. {{champion:136}}","replies":[]}]},{"poster":"Trenitaliyah","date":"2016-11-30T22:08:37.824+0000","up_votes":1,"down_votes":0,"body":"Guys, Illaoi is great in every single feature she has (in design and techniques and art and story and kit).\nSame for Kled, but just design in there. And I seem to like Camille very much.","replies":[{"poster":"hunterspec","date":"2016-11-30T22:10:12.842+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=KhalKheos,realm=EUW,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=00010002,timestamp=2016-11-30T22:08:37.824+0000)\n>\n> Guys, Illaoi is great in every single feature she has (in design and techniques and art and story and kit).\n> Same for Kled, but just design in there. And I seem to like Camille very much.\n\nillaoi is another \"who\" champ that no one plays","replies":[{"poster":"Trenitaliyah","date":"2016-12-01T11:15:41.599+0000","up_votes":1,"down_votes":0,"body":"Well, you really should cause she is OP atm.","replies":[]}]}]},{"poster":"FioraWillCarry","date":"2016-12-01T11:19:15.323+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Whorem0nes,realm=NA,application-id=3ErqAdtq,discussion-id=dpaWAOr4,comment-id=0001,timestamp=2016-11-30T14:41:18.030+0000)\n>\n>  when is the last time they made a good champ? jhin?\n\nCamille, Kindred, Ekko, Azir(the best champ ever designed).","replies":[]}]},{"poster":"koreansmurf8751","date":"2016-11-30T14:36:10.852+0000","up_votes":8,"down_votes":0,"body":"Now you are right in one sense. But all of riots rly dedicated skins have some kind of theme. Ex) new elementalist Lux is her \"true\" form where she's mastered light and can control the other elements. Also, changing effects and having cool shit is completely different from balancing a new champion into this already tipsy time, especially in pre season","replies":[]},{"poster":"Swarovsko","date":"2016-11-30T19:09:24.337+0000","up_votes":1,"down_votes":6,"body":"Honestly? I was waiting an ''elementalist'' oriented champion. I don't like that rng-based passive you've developed but it's still kinda cool.\nRiot has like every benter + lots of mages but not a wizard who can control elements and that sucks imo. Was expecting a champ based on elements, not a skin. Now we probably won't have the typical wizard who control elements because it would be Elementalist Lux 2.0, unless Riot puts effort on that champ. ( which is something they rarely do these days i.e: Kled, Camille, Bard and others).","replies":[{"poster":"kamikazephyr","date":"2016-11-30T21:13:57.811+0000","up_votes":4,"down_votes":0,"body":"No effort... Kled and Bard both introduced mechanics entirely unique to them. So did Ivern. What a brainless hater. They've been constantly trying to spice up gameplay with reworks, both on champions and the main map. So yeah. They definitely put effort in champs.","replies":[{"poster":"Leetri","date":"2016-11-30T21:45:08.478+0000","up_votes":1,"down_votes":0,"body":"People complain that Riot adds too many unique mechanics to champions, people complain that champions have \"boring, no-effort kits\". Someone will complain no matter what you do.","replies":[]}]},{"poster":"Piotyr","date":"2016-11-30T20:04:14.338+0000","up_votes":1,"down_votes":0,"body":"Riot went for mages that control one element rather than one that controls multiple.","replies":[{"poster":"Chembaron Yamada","date":"2016-12-01T18:01:32.376+0000","up_votes":1,"down_votes":0,"body":"And I think they are right to do so. Champions have a pool of 4 skills. As long as you don't want the elementalists kit to change depending on the element (which would be broken because it offers way too many skills) that champ would have 1 skill for each element. That wouldn't feel like an elementalist at all, at least for me.","replies":[]}]}]},{"poster":"Xela Syab","date":"2016-11-30T21:31:29.238+0000","up_votes":2,"down_votes":0,"body":"Upvoted and agree, but Riot is trying to diversify the champion pool that already exists instead of making more champions. I hope with the Diver update they fix brawler champs like Dr.Mundo, Udyr, Skarner, and Shyvana because you can pretty much play them the same way and same style except with Skarners new crystal gimmick.","replies":[{"poster":"Chembaron Yamada","date":"2016-12-01T18:03:42.306+0000","up_votes":1,"down_votes":0,"body":"All these champions you listed are not part of the diver subclass, they are Juggernauts.\nShyvana just had a small rework, I doubt she will be part of the update. And Dr. Mundo is on the list for a total VGU, so he probably won't be touched either.","replies":[]}]},{"poster":"AttackOnTeemos","date":"2016-11-30T15:01:02.583+0000","up_votes":2,"down_votes":0,"body":"Tris's dragon is actually {{champion:102}} 's baby.","replies":[]},{"poster":"AninLegions777","date":"2016-11-30T23:19:26.063+0000","up_votes":2,"down_votes":1,"body":"The major one is Spirit Guard Udyr. That should be the rework of Udyr. The movement animation and all that.","replies":[{"poster":"Supreme Senpai69","date":"2016-12-01T10:30:43.914+0000","up_votes":3,"down_votes":1,"body":"Tbh I'd argue it WAS the rework of Udyr. It's just that to rework Udyr it would cost money, and what better way to make money to pay for that than a new skin? It's like they said \"Hello Udyr mains. If you pay us 35 dollars we will rework your champion into something amazing.\"","replies":[{"poster":"AninLegions777","date":"2016-12-02T23:04:59.271+0000","up_votes":1,"down_votes":0,"body":"I would like to agree but it just reminds me of Victorious morg. The skin made Riot change the VFX of morgs spells. So I was hoping they'd do the same ot Udyr.","replies":[]}]}]},{"poster":"CarameI Frappe","date":"2016-11-30T21:53:15.190+0000","up_votes":1,"down_votes":0,"body":"Personally i'm just happy with Riot's rework of {{champion:78}}, huge success in my book.\nAlso funny- I think Camille is the result of what Riot wanted Xin to be. Instead of remaking him / updating him, they gave us a new champion with the same mechanics he has (but altered of course). So you're getting what you  asked for OP :D","replies":[]},{"poster":"Akali Prime","date":"2016-11-30T21:07:49.482+0000","up_votes":1,"down_votes":0,"body":"dark star thresh could've easily been a new celestial champion","replies":[]},{"poster":"Piotyr","date":"2016-11-30T20:17:41.761+0000","up_votes":1,"down_votes":0,"body":"So what I want is the opposite of what you want, I want entirely new champions as skins! It would give us more characters to plot around without having to make an entirely new champion to balance etc.","replies":[]},{"poster":"Muddafragot","date":"2016-11-30T23:32:26.017+0000","up_votes":1,"down_votes":2,"body":"Instead, you just paid a bunch of money for the same champion. Stupid.","replies":[]},{"poster":"Darth Sidiouss","date":"2016-11-30T19:38:29.352+0000","up_votes":1,"down_votes":2,"body":"YYYep lmao its all for marketing purposes, most of the money Riot makes is definitely from the skin department.","replies":[]}]}