{"poster":"TrikzterzArma","date":"2018-08-15T12:44:55.498+0000","title":"Soooo what's the reason having a death recap if it doesn't even work?","subforum":"Gameplay","up_votes":13,"down_votes":1,"body":"Riot obviously won&#039;t fix it, as it has been busted for many years. So why even have it there? What&#039;s the reason to have something in the game that literally doesn&#039;t work?","replies":[{"poster":"Andrey0345","date":"2018-08-15T14:00:14.409+0000","up_votes":7,"down_votes":0,"body":"To laugh when you open it and see that you got smited by a friendly caster minion for 500 true dmg.\n\nI mean, it's really brilliant, this game can be really unfun at times but death recap being so bugged is actually hilarious.","replies":[]},{"poster":"rayzo","date":"2018-08-15T15:23:09.785+0000","up_votes":2,"down_votes":0,"body":"this game is in a depressing state... death recap gives everyone a nice laugh to get away from it all","replies":[]},{"poster":"Lakega","date":"2018-08-16T03:28:42.507+0000","up_votes":1,"down_votes":0,"body":"Think Riot needs to stop releasing champs, and re do the entire code of the game...","replies":[{"poster":"afmghost","date":"2018-08-16T03:36:24.159+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lakega,realm=NA,application-id=3ErqAdtq,discussion-id=lEUcJ9Ib,comment-id=0005,timestamp=2018-08-16T03:28:42.507+0000)\n>\n> Think Riot needs to stop releasing champs, and re do the entire code of the game...\n\nThey're a cashgrab company (like EA, but not to that extreme). There's no money in actually improving the game, but plenty in releasing new skins and champions.\nWe need to organize some kind of strike, where when a skin or champion comes out, nobody gives them any money. If it shakes them up enough they might listen.","replies":[]}]},{"poster":"DuskDaUmbreon","date":"2018-08-15T15:41:50.317+0000","up_votes":1,"down_votes":0,"body":"Mostly to see *who* you died to and how fast.\n\nAlso tbh it works a lot more than you'd think by looking at the boards. Most of the weird bugs aren't that common.","replies":[{"poster":"LeftyRaydy","date":"2018-08-15T16:23:53.522+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=lEUcJ9Ib,comment-id=0002,timestamp=2018-08-15T15:41:50.317+0000)\n>\n> Mostly to see *who* you died to and how fast.\n> \n> Also tbh it works a lot more than you&#x27;d think by looking at the boards. Most of the weird bugs aren&#x27;t that common.\n\nYour kidding right. So first off I will have Death recaps that do not add up even close to all my damage. it shows top 3 damage abilities and it will not even equal 75% of my health. Or it will say an enemy champion from across the map did 100 True damage basic attack to me when they were no where near me. This is broken hands down they won't fix it.","replies":[{"poster":"Fondling Gems","date":"2018-08-16T03:35:56.591+0000","up_votes":1,"down_votes":0,"body":"Sure, and 9/10 times when I look at it the damage is pretty accurate and makes sense.  Even if I can't see every source of damage I can see all the major ones and know whether my last item should be MR, Armour, or Health.","replies":[]}]},{"poster":"TrikzterzArma","date":"2018-08-15T15:47:21.632+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=lEUcJ9Ib,comment-id=0002,timestamp=2018-08-15T15:41:50.317+0000)\n>\n> Mostly to see *who* you died to and how fast.\n> \n> Also tbh it works a lot more than you&#x27;d think by looking at the boards. Most of the weird bugs aren&#x27;t that common.\n\nYes they are. The Death recap havent worked a single time for me.","replies":[]},{"poster":"CloudedLogic","date":"2018-08-15T15:46:04.628+0000","up_votes":1,"down_votes":0,"body":"It doesn't even give you a wide frame of information though. It shows up to three sources of damage from three sources of people.\n\nSo I could have taken 900 damage from swain burst, but the rest of the damage (and the damage that killed) could be from someone autoing me down like vayne, taric, Lee sin.\n\nAs far as bug's go, I was playing brand once and zyra did over 300 true damage to me with my own passive","replies":[]}]},{"poster":"BadPiriPiri","date":"2018-08-16T02:58:36.077+0000","up_votes":1,"down_votes":0,"body":"Because it would break the entire spaghetti code.\nIt is a complete mess and I would not be surprised if it is removed it would break the entire game.","replies":[]},{"poster":"TheCodeisCupCake","date":"2018-08-15T22:20:47.467+0000","up_votes":1,"down_votes":0,"body":"_Looks at death recap_\n\n\"Ah, fuck, the infernal drakes {{item:3087}} got me, well guess I gotta kite him next time!\"\n\nAlso it irritates me as a juggernaut/tank player that I have 5k hp late game and it shows me the 1.5k dmg I took. Like, cool, where's the rest of it?{{sticker:sg-lux-2}}","replies":[]}]}