{"poster":"Ao Dracona","date":"2019-02-21T06:07:07.011+0000","title":"Who do u hope will get a legendary skin this year?","subforum":"Story, Art, & Sound","up_votes":6,"down_votes":1,"body":"For me it’s shen","replies":[{"poster":"Sukishoo","date":"2019-02-21T13:23:10.354+0000","up_votes":4,"down_votes":0,"body":"{{champion:202}} {{champion:238}} for sure","replies":[]},{"poster":"Lewanor","date":"2019-02-21T13:17:30.130+0000","up_votes":4,"down_votes":0,"body":"We are waiting for Project Talon for a loooong time. It'd be awesome if it was a legendary","replies":[]},{"poster":"Falrein","date":"2019-02-21T07:17:05.242+0000","up_votes":4,"down_votes":0,"body":"Syndra. There's so much potential (pun intended). Especially with Coven.","replies":[{"poster":"Bishasaurus Flex","date":"2019-02-21T12:38:32.926+0000","up_votes":1,"down_votes":0,"body":"{{champion:134}}","replies":[]}]},{"poster":"Mordepool","date":"2019-02-21T08:15:19.788+0000","up_votes":3,"down_votes":3,"body":"{{champion:82}} if it doesn't happen this year i don't think it ever will","replies":[{"poster":"GDIvsNOD","date":"2019-02-21T17:06:19.321+0000","up_votes":2,"down_votes":1,"body":"{{champion:82}} {{champion:82}} {{champion:82}} {{champion:82}} {{champion:82}} \n\n> [{quoted}](name=Mordepool,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=0001,timestamp=2019-02-21T08:15:19.788+0000)\n>\n> {{champion:82}} if it doesn't happen this year i don't think it ever will\n\nDon't lose hope so fast! While there's bound to be work done on existing skins during the full rework (I'm hoping Dragon Knight and/or Infernal become actual skins and not just recolor chromas), new skins are still another matter. I can see them waiting until after the rework for a number of reasons, especially for a Legendary tier or better, because...\n\n1. Reasons of time and effort needed to make one.\n\n2. Being a rather low played champion right now, it's probably a harder sell to justify from Riot's perspective (doesn't count out chances entirely as we saw with {{champion:77}} though, and this would actually further help interest with a champion during a time Riot is putting other work into it, so it could go either way).\n\n3. I think {{champion:50}} and {{champion:20}} didn't get new skins with their updates right away either?\n\nI can see (and do hope!) that at least one skin, hopefully higher tier, will come with the rework, if not then hopefully not too long after. Right now, there's not even a 1350 or above tier skin for him (his most recent, which is anything but recent, wasn't even 975), and his skin count for his age is really low, especially considering two are essentially chromas right now.\n\nAll in all, I'd be not only disappointed but surprised if there isn't at least one new (not reworked existing) skin for {{champion:82}} by like a year from whenever his VGU lands public. It miiiiight not be that Ultimate (here's to hoping), but I would be surprised if by that point he still lacks a 1350 or above offering entirely.","replies":[{"poster":"Mordepool","date":"2019-02-21T17:31:26.947+0000","up_votes":1,"down_votes":0,"body":"I will remind you Morde is  getting to the Top of the list of Champions who hasn't recieved a skin in X years.  Rework tinkering doesn't change that.\n\nHe is Due a skin, he is getting a Rework.\nHe will never be Popular,\nHis likely hood of getting a Legendary at his Rework is Better than  his chances over the next 10 years","replies":[{"poster":"GDIvsNOD","date":"2019-02-21T18:14:21.942+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mordepool,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=000100010000,timestamp=2019-02-21T17:31:26.947+0000)\n>\n> I will remind you Morde is  getting to the Top of the list of Champions who hasn't recieved a skin in X years.  Rework tinkering doesn't change that.\n> \n> He is Due a skin, he is getting a Rework.\n> He will never be Popular,\n> His likely hood of getting a Legendary at his Rework is Better than  his chances over the next 10 years\n\nI am aware of/agree with most of this. I was just saying to keep some hope yet. No Legendary or Ultimate skin same day as rework hits doesn't mean never IMO.","replies":[{"poster":"Mordepool","date":"2019-02-21T18:15:50.840+0000","up_votes":2,"down_votes":0,"body":"Being a Morde main for 8 years and Morde being mistreated by Riot for almost as many years has made me a pessimist.","replies":[{"poster":"GDIvsNOD","date":"2019-02-21T18:43:33.178+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mordepool,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=00010001000000000000,timestamp=2019-02-21T18:15:50.840+0000)\n>\n> Being a Morde main for 8 years and Morde being mistreated by Riot for almost as many years has made me a pessimist.\n\nOh, I feel ya. A friend's brother introduced me to this in 2012 and the free rotation that week included Morde and Jarvan IV. I started grinding IP to get Morde as my first champion and never looked back. Between friends leaving, getting tired from having played a few years (started late season 2, left sometime season... 4 or 5?), and Mordekaiser's pseudo rework that came with the juggernaut update, I sort of stopped playing for some years except for the rare game here or there until I came back late last year.\n\nI only have like ~130k mastery on him since mastery points weren't a thing the majority of the time I played him. My one friend was always heckling me that \"you don't always play Morde, but when you do, it's all the freak'n time\" and \"you don't play League of Legends, you play League of Morde versus others\". Never was really good at the game and mostly stuck to normals and playing casually, but with a friend playing again now, I'm having some fun, and this rework news is a treat so I guess I'm just praying for the best to come of it. I see Morde so infrequently that I always get excited to see another, especially a main. Hopefully the rework doesn't make him pick or ban level broken meta though.","replies":[]}]}]}]}]},{"poster":"Rose Muffins","date":"2019-02-21T16:47:39.031+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Mordepool,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=0001,timestamp=2019-02-21T08:15:19.788+0000)\n>\n> {{champion:82}} if it doesn't happen this year i don't think it ever will\n\nBut he's getting a rework. You want a rework AND a legendary? You greedy noise.","replies":[{"poster":"GDIvsNOD","date":"2019-02-21T17:20:51.087+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Rose Muffins,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=00010000,timestamp=2019-02-21T16:47:39.031+0000)\n>\n> But he's getting a rework. You want a rework AND a legendary? You greedy noise.\n\nTo be fair, the rework is loooooooooong overdue, as is more skin offerings. Name a champion that...\n\n1. Is almost as old as the game...\n\n2. Yet only has three skins besides his basic (actually five, but two are chromas/recolors)...\n\n3. Doesn't even have an offering that is considered worthy of 1350 or above quality.\n\n4. Newest skin was in 2015 and was only 750 quality, not even 975.\n\nYes, there's champions without Legendary skins, and yes, there's champions with only one or two skins, sure (Rek'Sai, Ivern, and some others, the latter is getting one finally), but how many OLD, nearly original, champions only have essentially three skins, none even 1350, and the last one like almost four years ago? That list is very, very short. I wonder who else is even on it. I'm sure someone is but I'm drawing blanks, the list is that short.\n\nA rework is nice, but no new skins would be a disappointment, and the needed rework is precisely WHY no new skins were made in the last many years. NOW that the rework is happening, maybe it can happen (even if not right away).","replies":[{"poster":"Mordepool","date":"2019-02-21T18:12:42.635+0000","up_votes":1,"down_votes":1,"body":"An ultimate/Legendary would go far by way of an apology for the 2 years of  torture  riot put us through.","replies":[]}]},{"poster":"Mordepool","date":"2019-02-21T17:23:55.780+0000","up_votes":1,"down_votes":1,"body":"140 champions  Chogath has 2 Legendarys \n no one likes Morde or his mains apparently. His Playrate will never Be large enough to warrant a Legendary. So my thoughts are  if they Dont give him a Legendary With his Rework it wont ever Happens since Riot fucking Hates Morde.  \n\nIm Not asking for anything im making a Logical supposition based off 8 years of Company knowledge.","replies":[]}]}]},{"poster":"Jeddy017","date":"2019-02-21T15:49:41.539+0000","up_votes":2,"down_votes":0,"body":"Well, not this year specifically, but I would love to see {{champion:83}} {{champion:78}} {{champion:267}} {{champion:201}} {{champion:1}} {{champion:32}} {{champion:44}} get a legendary (or ultimate) skin one day. Yes, all of these are some of my top played champs (beside Amumu because I don't jungle)","replies":[]},{"poster":"Anns","date":"2019-02-21T14:21:19.746+0000","up_votes":2,"down_votes":0,"body":"SYNDRA","replies":[{"poster":"Anns","date":"2019-02-21T14:22:01.202+0000","up_votes":2,"down_votes":0,"body":"but don't give her arcade or some other colorful shitskin please. that would break my heart. as if star guardian was not enough.","replies":[{"poster":"Bishasaurus Flex","date":"2019-02-21T16:33:21.396+0000","up_votes":1,"down_votes":0,"body":"I wonder what concept would fit her tbh.  Everything so far is kind of meh, but I loved the idea of an Anti SG leading an army of void beings.  Maybe Dark Star?  Or cosmic","replies":[{"poster":"Anns","date":"2019-03-16T14:15:31.300+0000","up_votes":1,"down_votes":0,"body":"daaamn I really love void creatures and if any skin of syndra had a connection with them i'd be in teeeeears","replies":[]}]}]}]},{"poster":"General Matty","date":"2019-02-21T13:06:06.982+0000","up_votes":3,"down_votes":1,"body":"Ivern or Maokai. Shen is cool too.","replies":[]},{"poster":"Kelg","date":"2019-02-21T11:32:49.925+0000","up_votes":3,"down_votes":1,"body":"pls pls pls {{champion:82}}","replies":[]},{"poster":"Hexs Fortune","date":"2019-02-21T21:51:20.640+0000","up_votes":2,"down_votes":1,"body":"{{champion:161}} {{champion:21}} {{champion:28}} {{champion:102}} {{champion:44}} {{champion:90}} {{champion:136}} {{champion:33}} ","replies":[]},{"poster":"Bishasaurus Flex","date":"2019-02-21T12:46:18.702+0000","up_votes":2,"down_votes":1,"body":"If Morde gets a legendary skin, then he wont get a vgu anytime soon, which he desperately needs more than a 3250 skin.","replies":[{"poster":"Oleandervine","date":"2019-02-21T14:44:55.818+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Anl0rian,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=0004,timestamp=2019-02-21T12:46:18.702+0000)\n>\n> If Morde gets a legendary skin, then he wont get a vgu anytime soon, which he desperately needs more than a 3250 skin.\n\nThe confirmation that Mordekaiser is getting a VGU this year is PRIME for him also to get a 3250 skin, or at the very least an 1820 skin. They're already going to have his voice actor on hand for the VGU, so it's simply a matter of having that actor spit out another set of dialogue for a new skin while they have him in the studio. Granted, I don't think he's remotely worthy of an ultimate skin, but I'm just saying they could do it since they had the actor already scheduled. I'd believe an 1820 skin before a 3250 skin for Morde.","replies":[{"poster":"Bishasaurus Flex","date":"2019-02-21T16:31:29.279+0000","up_votes":1,"down_votes":0,"body":"Ah yeah I forgot the 3250 are ultimate.  Yeah I can agree to an 1820.","replies":[]}]},{"poster":"Mordepool","date":"2019-02-21T18:21:14.453+0000","up_votes":1,"down_votes":0,"body":"Riot has not Opted to work on any thing about  Morde other than Game breaking bugs.  For the last 3 years. And before the Rework it was the same.\n\nThey  don't allocate Resources to him Ever.\nI don't think that will change much if at all after the rework\n\n Currently They are Forced too. So they May aswell actually make a Skin worth Buying","replies":[]},{"poster":"Warlord Rhinark","date":"2019-02-21T13:03:18.277+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Anl0rian,realm=NA,application-id=6kFXY1kR,discussion-id=rXgqBi8w,comment-id=0004,timestamp=2019-02-21T12:46:18.702+0000)\n>\n> If Morde gets a legendary skin, then he wont get a vgu anytime soon, which he desperately needs more than a 3250 skin.\n\nHis rework is already confirmed to be in the making.","replies":[]}]},{"poster":"The E77","date":"2019-03-16T18:53:48.382+0000","up_votes":1,"down_votes":0,"body":"{{champion:107}} {{champion:101}} {{champion:90}} {{champion:121}}","replies":[]},{"poster":"Warwick Main","date":"2019-03-16T18:49:15.667+0000","up_votes":1,"down_votes":0,"body":"Personally:\n\n{{champion:19}} {{champion:245}} {{champion:62}} \n\nIncredibly unlikely though. Warwick has very small and short range particles not very suited to a legendary skin. Wukong is a bit better but until we see a VGU I doubt that even close to a possibility since his player base is so small. Ekko is the best chance for my champion pool as he has a lot of pretty and long range aoe effects but I don't think he has the player base dedicated to justify that kind of skin.","replies":[]},{"poster":"Raven Redeemed","date":"2019-02-21T19:19:55.030+0000","up_votes":1,"down_votes":0,"body":"There are some good suggestions here. I’ll go with Quinn. Xayah and Rakan would be awesome too but I think there are other champs more deserving at the moment.","replies":[]},{"poster":"Predatorator","date":"2019-02-21T19:02:37.752+0000","up_votes":1,"down_votes":0,"body":"{{champion:101}} along with skarner, he's the champion that's waiting the most time for a skin, nearly 4 years. He got no balance changes underway, he's not problematic. Dark Star would definitely be the most fitting theme right now, especially since there are some very cool concepts around!","replies":[]},{"poster":"AbiwonKenabi","date":"2019-02-21T18:26:14.307+0000","up_votes":1,"down_votes":0,"body":"I'd like to see some lore-related legendary skins. I'm not sure who would be the best candidate, but some sort of \"what if\" skin or a \"past version\" skin. Blackfrost Anivia sort of falls into this category, and its really cool (no pun intended). \n\nI know Kayn recently received a legendary, but some skin for him that shows a theoretical future where he and Rhaast cooperate instead of defeat one another would be neat. More recently, I got the idea for some \"Past Morgana\" skin, where she hasn't bound her wings yet and still looks more similar to Kayle. Maybe a \"Dark Kayle\" skin to pair with it, where she ends up looking more like Morgana.","replies":[]},{"poster":"Anomander","date":"2019-02-21T17:15:31.760+0000","up_votes":1,"down_votes":0,"body":"{{champion:48}}  Make Trundle Troll Again!","replies":[]},{"poster":"Myrmiron","date":"2019-02-21T12:00:54.546+0000","up_votes":1,"down_votes":0,"body":"Anyone but {{champion:120}} .\nI have made up my mind to never spend money on this game again, and Hecarim as my main would make it hard for me to resist.","replies":[]},{"poster":"mrmeddyman","date":"2019-02-21T20:59:30.782+0000","up_votes":1,"down_votes":1,"body":"{{champion:202}} {{champion:238}}  are assured for a legendary or even this years' ultimate. Jhin has the highest playrate and Zed is at #7 and they've never got a significant skin like that.\n\nWhat I would like though?\n{{champion:427}} {{champion:101}} {{champion:104}} {{champion:136}}","replies":[]},{"poster":"MasterLico","date":"2019-02-21T19:35:49.581+0000","up_votes":1,"down_votes":1,"body":"{{champion:142}} {{sticker:sg-soraka}}","replies":[]},{"poster":"Forbidden Siren","date":"2019-02-21T16:32:05.552+0000","up_votes":1,"down_votes":1,"body":"{{champion:43}} \n\nStill hopeful she gets one.","replies":[]},{"poster":"Camille Ferrøs","date":"2019-02-21T22:10:09.022+0000","up_votes":1,"down_votes":2,"body":"{{champion:1}} {{champion:103}} {{champion:99}}  {{sticker:sg-miss-fortune}}","replies":[]}]}