{"poster":"2Teemos1Cup","date":"2016-01-14T01:15:58.877+0000","title":"Illaoi mas rota que la ****","subforum":"Charlas Generales","up_votes":4,"down_votes":6,"body":"Miren, tengo claro que es un personaje sin movilidad, que tiene muchos counters, que hay muchas formas de jugar contra ella....\r\n\r\n\r\nPERO UN PERSONAJE CON 4K DE VIDA Y 200 DE ARMADURA, NO PUEDE ONESHOTEARTE, DE NINGUNA MANERA, NO DEBER&Iacute;A, OSEA, QUE ONDA RIOT\r\n\r\n\r\nTENGO CLARO QUE ES UN PERSONAJE COUNTEREABLE Y QUE POR ESO DEBEN DARLE DA&Ntilde;O, PERO TIENE DEFINITIVAMENTE UN PROBLEMA CON LOS N&Uacute;MEROS, NO TE PUEDE METER 1600 DE DA&Ntilde;O EN 0,2 SEGUNDOS SOLO CON UNA BLACK CLEAVER  Y FULL TANK!!!!!!!!!!!!!!!!!!!!!!!!!!!! WTFFFFFFF","replies":[{"poster":"mSv16","date":"2016-01-14T01:29:07.912+0000","up_votes":1,"down_votes":0,"body":"Nose pero a varias illaoi les eh ganado en late como early con mi amigo ryze...\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:41:56.875+0000","up_votes":1,"down_votes":1,"body":"Creo que no entendiste el punto... hasta el antiguo jax cuando existía el dodge tenía counters, hasta la evelyn que te stuneaba cuando salía de la invisibilidad tenía counters... hasta el heimer que sus granadas tenían mas rango que las mismas torres convencionales (y, para variar, las granadas le hacían daño a las torres), ese heimer que se podía solear baron poniendo las torretas fuera de la fountain del baron (atrás ahi donde está el red del equipo de arriba) tenía counters\n\nHasta el twisted fate que su ulti antes no tenía un límite de rango, sino que era global, y que, para más remate, antes no era su ulti, antes twisted se teletransportaba a cualquier parte del mapa solo con su E, el twisted que stuneaba en área con la W, el twisted que su ulti no solo los revelaba a todos, sino que los ralentizaba a todos en un 40%, Y QUE NO LE SALÍAN LAS CARTAS EN EL PISO QUE TE AVISAN DONDE VA A SALIR, SIMPLEMENTE APARECÍA COMO EL ANTIGUO RENGAR, HASTA ESE PERSONAJE TIENE COUNTERS.\n\n\nYA TENGO CLARO QUE ILLAOI TIENE COUNTERS, PERO QUE UN PERSONAJE TENGA COUNTERS NO LE QUITA EL HECHO DE QUE PUEDE ESTAR MÁS ROTO QUE  LA **** (censurado xd) \n\nAsí que, POR FAVOR, no va en mala, no va con ganas de ser tóxico, pero decirme el nombre de un campeón que le gana a Illaoi NO es un argumento para decir que el personaje no está roto. Gracias!!!!!!!!!!!!!!!!!","replies":[{"poster":"Dayren","date":"2016-01-15T02:23:20.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2Teemos1Cup,realm=LAS,application-id=v7qsfXsE,discussion-id=E4GmtbB1,comment-id=00010000,timestamp=2016-01-14T01:41:56.875+0000)\n>\n> Creo que no entendiste el punto... hasta el antiguo jax cuando existía el dodge tenía counters, hasta la evelyn que te stuneaba cuando salía de la invisibilidad tenía counters... hasta el heimer que sus granadas tenían mas rango que las mismas torres convencionales (y, para variar, las granadas le hacían daño a las torres), ese heimer que se podía solear baron poniendo las torretas fuera de la fountain del baron (atrás ahi donde está el red del equipo de arriba) tenía counters\n> \n> Hasta el twisted fate que su ulti antes no tenía un límite de rango, sino que era global, y que, para más remate, antes no era su ulti, antes twisted se teletransportaba a cualquier parte del mapa solo con su E, el twisted que stuneaba en área con la W, el twisted que su ulti no solo los revelaba a todos, sino que los ralentizaba a todos en un 40%, Y QUE NO LE SALÍAN LAS CARTAS EN EL PISO QUE TE AVISAN DONDE VA A SALIR, SIMPLEMENTE APARECÍA COMO EL ANTIGUO RENGAR, HASTA ESE PERSONAJE TIENE COUNTERS.\n> \n> \n> YA TENGO CLARO QUE ILLAOI TIENE COUNTERS, PERO QUE UN PERSONAJE TENGA COUNTERS NO LE QUITA EL HECHO DE QUE PUEDE ESTAR MÁS ROTO QUE  LA **** (censurado xd) \n> \n> Así que, POR FAVOR, no va en mala, no va con ganas de ser tóxico, pero decirme el nombre de un campeón que le gana a Illaoi NO es un argumento para decir que el personaje no está roto. Gracias!!!!!!!!!!!!!!!!!\n\n{{champion:150}} , {{champion:67}} , {{champion:8}} ,{{champion:27}} , {{champion:24}} ,{{champion:238}} ,{{champion:78}} ,{{champion:17}} , {{champion:22}} , {{champion:201}} , {{champion:223}} , {{champion:429}} , {{champion:107}} ,{{champion:89}} ,{{champion:99}} ,{{champion:268}} ,{{champion:119}} . conclusion : hay demasiados champs que le hacen frente","replies":[]},{"poster":"mSv16","date":"2016-01-14T01:49:18.073+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2Teemos1Cup,realm=LAS,application-id=v7qsfXsE,discussion-id=E4GmtbB1,comment-id=00010000,timestamp=2016-01-14T01:41:56.875+0000)\n>\n> Creo que no entendiste el punto... hasta el antiguo jax cuando existía el dodge tenía counters, hasta la evelyn que te stuneaba cuando salía de la invisibilidad tenía counters... hasta el heimer que sus granadas tenían mas rango que las mismas torres convencionales (y, para variar, las granadas le hacían daño a las torres), ese heimer que se podía solear baron poniendo las torretas fuera de la fountain del baron (atrás ahi donde está el red del equipo de arriba) tenía counters\n> \n> Hasta el twisted fate que su ulti antes no tenía un límite de rango, sino que era global, y que, para más remate, antes no era su ulti, antes twisted se teletransportaba a cualquier parte del mapa solo con su E, el twisted que stuneaba en área con la W, el twisted que su ulti no solo los revelaba a todos, sino que los ralentizaba a todos en un 40%, Y QUE NO LE SALÍAN LAS CARTAS EN EL PISO QUE TE AVISAN DONDE VA A SALIR, SIMPLEMENTE APARECÍA COMO EL ANTIGUO RENGAR, HASTA ESE PERSONAJE TIENE COUNTERS.\n> \n> \n> YA TENGO CLARO QUE ILLAOI TIENE COUNTERS, PERO QUE UN PERSONAJE TENGA COUNTERS NO LE QUITA EL HECHO DE QUE PUEDE ESTAR MÁS ROTO QUE  LA **** (censurado xd) \n> \n> Así que, POR FAVOR, no va en mala, no va con ganas de ser tóxico, pero decirme el nombre de un campeón que le gana a Illaoi NO es un argumento para decir que el personaje no está roto. Gracias!!!!!!!!!!!!!!!!!\n\nMira te diría si me acordara,pero,desde que salio illaoi y me a tocado en el team contrario siempre eh cagando o porque tengo un buen top o porque cuando voy top nose le gano :v pero para mi no esta rota solo,es un poco fuerte :p\n\nPD: Tu nombre me hizo acordar a algo muy asqueroso xD","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:53:34.693+0000","up_votes":1,"down_votes":1,"body":"Algún día te va a tocar una que tenga alguna simple idea de como usarla, te va a oneshotear a vos y a 3 aliados más, (quadra kill) luego dirás \"Pero que onda, como la habrán fedeado tanto\", verás los scores y te darás cuenta que antes del cuadra solo tenía 1 kill y un farm común.\n\n\nLuego me dirás si está rota o no :p","replies":[]}]}]}]},{"poster":"Javitronix14","date":"2016-01-14T01:31:31.947+0000","up_votes":1,"down_votes":0,"body":"La diferencia esta en que es un puto cono en movilidad, y que si la sacas de su zona segura, es mas inutil que un Yi tanque. Es un campeon de posicionamiento, no te le tires a lo loco, o no vas a salir.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:47:08.799+0000","up_votes":1,"down_votes":0,"body":"O sea que simplemente por el maldito hecho de que es una illaoi, no debes acercarte nunca jamás a ese personaje porque sino te mueres.\n\nEse es el consejo de counter de illaoi? Un personaje al cual NO le puedes iniciar una tf porque si le inicias te marca el piso, y si estás ahí adentro, no importa que pase, vas a perder igual?\n\nNo se trata de tirarse a lo loco, se trata que en este juego que se llama League Of Legends existe algo llamado CAMPEONES MELÉ, Y ENTONCES, SEGÚN LO QUE TU ME DICES, SI ERES UN CAMPEÓN MELÉ (a exepción de nasus) Y JUEGAS VS ILLAOI, PERDISTE? HELLOOOOOOOOOOOOOOOOOO","replies":[{"poster":"Javitronix14","date":"2016-01-14T07:02:02.400+0000","up_votes":1,"down_votes":0,"body":"Nop, para nada, no entendiste mi punto. La idea es que ella inicie, a no ser que tengas una clara ventaja. Obviamente va a haber matchups mas y menos difíciles, pero eso no significa que el campeón sea inmortal.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T15:59:50.111+0000","up_votes":1,"down_votes":0,"body":"Mira, más allá de qué campeón sea (shen, teemo, ashe o illaoi) si te lo buildeas full tank el campeón va a ser inmortal, entiendes? es un tema de builds, no de el campeón.\n\n\nPERO, si te buildeas a shen, teemo o ashe full tank, literalmente solo serán tanks y no harán nada de daño (bueno, shen tiene daño base, pero no te oneshotea) pero illaoi? será inmortal con full armor y mr pero aún así illaoi te va a meter 2k de daño de 1 golpe con la ulti, osea, está bien que le den daño, está bien su kit, pero exageraron, como cuando salió ekko, todos teníamos claro que meter la ulti de ekko era difícil y que deberían darle mucho daño, pero cuando salió todos sabemos que se pasaron con el daño, simplemente te oneshoteaba y ya! que nadie entiende lo que trato de decir? Que illaoi meta daño está bien, PERO NO TANTO.\n\n\nNO PORQUE KHA'ZIX SEA UN ASESINO LE VAMOS A DAR 6K DE DAÑO POR BASICO GENTE, DENLE MUCHO DAÑO ESTÁ BIEN, PERO NO TANTOO","replies":[{"poster":"Javitronix14","date":"2016-01-14T20:40:26.621+0000","up_votes":1,"down_votes":0,"body":"Es que vos seguis sin entender el punto de Illaoi y lo que te estoy diciendo. Illaoi no puede hacer ese one shot donde quiere, sino que tiene posicionarse bien. En cambio Kha'zix al ser un asesino, sus habilidades no dependen tanto del posicionamiento. Si es verdad que hay muchos items offtank buenos, pero sin eso y sin un escalado alto, Illaoi seria inutil.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-15T01:27:41.589+0000","up_votes":1,"down_votes":0,"body":"Amigo, no es muy difícil posicionarte cuando eres full tank, es decir, tu crees que un mundo se preocupa de algo cuando va hacia el adc a matarlo? por supuesto que no! simplemente camina en medio de todos hasta llegar, illaoi es lo mismo, un flash+w y r = posicionamiento perfecto y los matas a todos, no tiene ciencia, apuesto que eres un jugador de illaoi.","replies":[{"poster":"Javitronix14","date":"2016-01-15T01:38:36.026+0000","up_votes":1,"down_votes":0,"body":"No es posicionamiento de Illaoi, es posicionamiento de tu equipo. Jugue a Illaoi las pocas veces que estuvo gratis, y el rango que tiene su ultimate no es tanto. Si saco 5 tentaculos es porque estan todos amontonados y ahi si, obviamente, ya que te esta pegando el daño de su Q x6. Pero alejandote un poco y denegando su ultimate, pierde muchisimo daño.","replies":[]}]}]}]}]},{"poster":"CALAMBRITO1","date":"2016-01-14T02:05:00.888+0000","up_votes":1,"down_votes":1,"body":"ocupa a olaf y deja de llorar , su ulti no deja ocupar la w de la illaoi , y tambien dejas useless la ulti","replies":[]}]}]},{"poster":"quityelmejor13","date":"2016-01-14T17:33:50.918+0000","up_votes":1,"down_votes":0,"body":"hay q ser enfermo para dejar q te pegen los tentaculos si son re lentos, es re izi ganarles a las ilaoi","replies":[{"poster":"2Teemos1Cup","date":"2016-01-15T01:26:23.270+0000","up_votes":1,"down_votes":0,"body":"Claro, es re facil esquivar 5 tentáculos!","replies":[]}]},{"poster":"TeemoTankeTiamat","date":"2016-01-14T01:32:36.262+0000","up_votes":1,"down_votes":0,"body":"yo no la veo tan fuerte, esquivas los tentáculos, rompes los tentáculos, un slow y la obligas a retroceder.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:45:14.252+0000","up_votes":1,"down_votes":1,"body":"Lo que pasa es que en top lane los tentáculos aparecen en ciertos lugares en donde no tienes súbditos protegiéndote, entonces, si vas a romper un tentáculo que sale de la pasiva, pues ella te tira su q o su e y tiene FREE harass.\n\nEntonces, el punto de romper los tentáculos queda fuera (a menos que juegues un pj de rango claro).\n\nEsquivar los tentáculos... es bastante complicado si intentas hacerle daño, no crees? Es decir, si vas a pelear contra una illaoi, claro que puedes esquivarle todos los tentáculos moviendote a todas partes, pero, moviéndote no le haces daño a nadie, ella definitivamente va a ganar. \n\nEntonces, la conclusión de este punto es que ella siempre te va a ganar el trade o el 1v1, solo que hay una forma de que no te mate (pero no forma de matarla) \n\nUn slow y la obligas a retroceder? realmente no entendí xd.","replies":[{"poster":"TeemoTankeTiamat","date":"2016-01-14T02:11:39.515+0000","up_votes":1,"down_votes":0,"body":"tomemos a nasus por ejemplo, el va top contra illaoi y comprende lo que significa entonces se queda bajo torre, cuando iilaoi  se aleja vos vas con nasus y farmeas los tentáculos (si, si se pueden farmear y te dan stacks) entonces ella se acerca para protegerlos vos le tiras slow y ella lo interpreta de forma agresiva y se va a alejar.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T15:55:36.621+0000","up_votes":1,"down_votes":0,"body":"Lo sé, le he ganado a illaoi en top, todos lo hemos hecho, pero mi punto es que, no importa que tan débil sea el campeón en términos de movilidad, de diversidad de habilidades, de CC, de nada... no puede oneshotear gente si es un tanque con 4k de vida!!! no importa ningún otro argumento, si tiene 4k de vida NO TE PUEDE ONESHOTEAR, comprendes lo que trato de decir? Illaoi tendrá un kit molesto y todo, y claro, tiene debilidades y por eso deberían darle daño, PERO NO TANTO, JESÚS, ES OBVIO QUE TIENE UN PROBLEMA CON LOS NÚMEROS DEL DAÑO.","replies":[{"poster":"TeemoTankeTiamat","date":"2016-01-14T18:06:24.871+0000","up_votes":1,"down_votes":0,"body":"\" no importa que tan débil sea el campeón en términos de movilidad, de diversidad de habilidades, de CC, de nada... no puede oneshotear gente si es un tanque con 4k de vida\" Garen, Darius, Cho'gath.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-15T01:24:20.408+0000","up_votes":1,"down_votes":0,"body":"Garen se demora en matarte, no es un oneshot, darius tiene que meterte las 5 cargas para poder meterte un true dmg decente, y cho'gath si está roto xd","replies":[]}]}]}]}]}]},{"poster":"nahuatl","date":"2016-01-14T12:25:11.574+0000","up_votes":1,"down_votes":0,"body":"si esta tan fuerte, compratela y ve como te ganan y asi jugarle vos","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T16:04:25.371+0000","up_votes":1,"down_votes":0,"body":"Me gasté el pi en otra cosa, pero tengo otra cuenta en la cual me compré a illaoi cuando salió (como 8k de pi tenía) y, sí, perdí las primeras partidas porque no tenía idea que hacer, pero jugué un par mas y, créeme, es una estupidez (hasta parece hack) como me oneshoteo a la gente.\n\nIncluso una vez me hice un cuadra 1v4 casi oneshoteandolos a todos, bastante parecido a este penta https://www.youtube.com/watch?v=3jowu1DWkqg pero en el tribush de bot.\n\n\nMira eso, no importa que tan countereable sea el campeón, si tiene o no tiene movilidad, si tiene o no tiene CC, SIMPLEMENTE UN TANQUE NO DEBERÍA PODER HACER ESO, UN TANQUE ES UN TANQUE NO UN ASESINO INMORTAL!","replies":[]}]},{"poster":"o Trafalgar o","date":"2016-01-14T01:39:57.449+0000","up_votes":1,"down_votes":0,"body":"El tema es que siempre hubo/hay un problema en este juego , y es que siempre hay algun campeon Tanke que se supone que solo tankea , que saca igual o mas a un luchador. Es como si fueran Tankes/Luchadores... osea lo que vos decis con Illaoi paso con Shen, ahora con Rammus tambien , etc.","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:47:42.482+0000","up_votes":1,"down_votes":1,"body":"Es que no es lo mismo con shen o con rammus... shen claro que pega, rammus también, pero no te meten 1600 de daño en área en 0,3 segundos!","replies":[{"poster":"o Trafalgar o","date":"2016-01-14T02:05:47.566+0000","up_votes":1,"down_votes":0,"body":"Ah si eso si, igual los Tankes en si tendrian que ser como Sion, solo Tankes, no tendrian que sacar tanto. A Illaoi tendrian q definir mas que quieren... si lo quieren como Tanke , bajarle el daño y si la quieren mas como Luchador , nerfearle la armadura y la vida .","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T15:56:32.329+0000","up_votes":1,"down_votes":0,"body":"Ese es mi punto! No me molesta que sea tanque y que pegue, me molesta que sea tanque y que pegue tanto! osea, denle daño (se lo merece, no tiene cc, no tiene movilidad), pero le pusieron un 0 de más a los números! NO LE DEN TANTO DAÑO JESUS","replies":[]}]}]}]},{"poster":"FedecarboneroUY","date":"2016-01-14T01:29:34.720+0000","up_votes":1,"down_votes":1,"body":"Nooooooooooo pero si le esquivas los tentaculos y ya esta, rompes los tentaculos que spawnean y ya esta no tiene movilidad, necesita Buff ...\n\nGG Illaoi, todavia me acuerdo clarito cuando yo tenia un heca que iba 2/0 y fui a gankearlo, gastamos los 2 la ulti y el heca murio, despues de que la Illaoi quedase a 30 de Mana me mato a mi tambien ... jaja izi pizi Black Cleaver en bici","replies":[]},{"poster":"DASENxxX1998","date":"2016-01-14T01:18:48.575+0000","up_votes":1,"down_votes":1,"body":"Concuerdo contigo, en serio deben cambiarle cosas","replies":[{"poster":"2Teemos1Cup","date":"2016-01-14T01:22:12.309+0000","up_votes":1,"down_votes":1,"body":"es que muchos campeones tienen muchas debilidades y por eso les dan daño explosivo, (veigar, katarina, maestro yi)\n\nPERO, TE GUSTARIA QUE UN VEIGAR 5K DE VIDA TE ONESHOTEE? QUE TE ONESHOTEE UN YI INMATABLE TIPO RAMMUS? CLARO QUE NO.\n\n\nEs que en definitiva no importa NINGÚN argumento sobre las debilidades de algún campeón, si tiene o no tiene movilidad, si tiene o no tiene cc, si gasta o no gasta mucho mana, si es muy kiteable o no... pero, de ninguna manera, ningún campeon con 5k de vida y toneladas de resistencias debería oneshotear a NADIE.","replies":[]}]},{"poster":"TSEA Power Point","date":"2016-01-14T02:06:16.956+0000","up_votes":1,"down_votes":2,"body":"esta igual que tu gfa salu2","replies":[]}]}