{"poster":"Finnthehorrible","date":"2015-06-21T06:09:24.098+0000","title":"PVP.net Down?","subforum":"Hilfe & Support","up_votes":4,"down_votes":0,"body":"Hi leute ich wollte fragen ob PVP.net down ist\r\nweil ich kann league of legends grad ned spielen wenn ihr\r\nne l&ouml;sung habt dann schreibt sie","replies":[{"poster":"Meeping Death","date":"2015-06-21T06:51:51.148+0000","up_votes":1,"down_votes":0,"body":"http://status.leagueoflegends.com/#euw Kannst du hier jederzeit nachschauen, ob das gerade down ist","replies":[{"poster":"Sexual Laura","date":"2015-06-21T19:30:20.317+0000","up_votes":1,"down_votes":0,"body":"mir ist das  auch gerade passiert aber ein paar minuten später war ich wd auf der startseite","replies":[]}]},{"poster":"Fragnator","date":"2015-06-21T07:57:23.990+0000","up_votes":1,"down_votes":0,"body":"Jo bei mir auch client hängt sich auf im loadingscreen und reconnecten geht auch net. nach 2 minuten warten kommt immer die Meldung meine verbindung sei abgebrochen und ich soll doch neu verbinden.\nversuche seit ner halben stunde zu reconecten.\nalles andre läuft normal ist definitiv nen lol fehler gibt keine ausreden.{{summoner:12}}","replies":[{"poster":"Meeping Death","date":"2015-06-21T08:17:40.393+0000","up_votes":1,"down_votes":0,"body":"Ich hab das in letzter Zeit auch ab und zu mal, dass ich erst nach 5 Minuten das Game starten kann (nachdem ich den Client nochmal neu gestartet habe). Es scheinen wohl im Moment viele ein Problem zu sein. Ich hoffe (und denke) mal, dass daran beim nächsten Patch was getan wird. Auf Dauer macht es einfach keinen Spaß, wenn man erst ein paar Minuten später in das Game kommt (heute hab ich allerdings noch keins gemacht, wenn ich das schon mitbekomme, kann ich das ja für heute lieber sein lassen...)","replies":[]}]},{"poster":"Totermann","date":"2015-06-21T07:17:22.543+0000","up_votes":1,"down_votes":0,"body":"Hi, habe ein änliches problem. mein spiel ist gestartet, ca. nach 2 min. hat es sich aufgehängt und es gab keinen neu verbindungs versuch.\nhabe lol dann komplett ausgeschaltet und wieder aufgerufen. kahm natürlich die meldung das noch ein spiel läuft also verbindung wiederherstellen, \nnach 30sekunden konnte die verbindung nicht aufgebaut werden.\nhabe das noch 5 mal versucht aber ohne erfolg. \nworan kanns noch liegen.\nmein w-lan funktioniert. selbst wenn das mal w-lan bedinngt unterbrochen wird baut sich die verbindung ja selbst wieder auf.","replies":[]}]}