{"poster":"Jesus our Exodus","date":"2017-09-16T08:14:22.428+0000","title":"I'm sorry, but truth must be spoken. [Boards discussion]","subforum":"Discuss the Boards","up_votes":54,"down_votes":10,"body":"Boards was a really cool concept compared to the old forums. I&#039;m not saying the old forums were much better, but there is one undeniable fact that I can&#039;t simply ignore if I want to use this one:\n\nThese forums are impressively primitive. Most other big game companies had better forums back in 2005. Not only do you not allow your moderators the ability to move a thread in the wrong section, but instead forcing them to delete it, thereby removing any discussion currently going on in it, but you also created a reddit-like toxicity level with your instant feedback system (voting).\n\nLook at Runescape&#039;s forum, look at World of Warcraft&#039;s forum, look at Dota 2&#039;s steam forum. None of them have an instant feedback system, and are better off for it. It&#039;s friendlier, it&#039;s more cooperative, people don&#039;t get shouted out of the forums when they make their first thread. And best of all - the moderators have all the tools they need to make the experience great for everyone.\n\nLets be honest - Instant feedback was about shutting down low quality and inappropriate threads, not to disagree with someone, but that&#039;s what it&#039;s being used for. Additionally, it&#039;s being used for bullying, stalking other people and downvoting anything they post. It&#039;s toxic, and I don&#039;t know if I can take it anymore. \n\nIn comparison to other successful games, these forums are state-of-the-art crap. League of Legends deserve better, and so do you. So the solution I&#039;m proposing is very simple: Remove the instant feedback system. Upvoting is not a bad thing, so keep that in place if you must have a hot and best section. However, downvoting&#039;s gotta go.\n\nSecondly, add a &quot;move this thread&quot; tool to the moderator&#039;s arsenal. They want it badly, the rest of the community wants it badly, and I&#039;ve seen some Rioters mention they want it too. What are you even waiting for? Take responsibility for your forums.\n\nThird and lastly, crack down on toxicity in comments with no remorse. Make it clear that no personal attacks or demeaning comments are allowed on these boards. You have many immature people reading and posting on these forums without adult supervision, and they need a firm hand to parent them while they&#039;re here. For their own good.\n\nRegardless whether you agree or disagree, please respect my opinion. I have used forums since 3rd grade of primary school (now I'm a computer engineer). I&#039;ve used all the forums imaginable, and I know how to spot a bad one when I see it. Take into consideration that I&#039;m not trying to be demeaning towards the Riot staff that worked on this forum. I simply claim they made a bad decision, probably deriving from Reddit&#039;s &quot;success&quot; as a popular forum. But what you don&#039;t see is the over 50% of reddit threads that are being bullied out of existence by its toxic community.\n\nNow ask yourselves, is that the kind of experience you want a player of your game to have when trying to discuss it? Carry on.","replies":[{"poster":"Melledoneus","date":"2017-09-16T20:27:17.225+0000","up_votes":18,"down_votes":1,"body":"I would like to see a system where downvotes are replaced with reports. So if a comment is inappropriate or toxic, enough reports will make it hidden by default (this comment is below the threshold for X reason. This will definitely alert a Warden and we can look at it, and if it is not allowed we remove it.\n\nTo avoid abuse cases Wardens could be allowed to also look at the comment and remove the hidden status if it was just a bunch of people abusing the system and disagreeing. That way we can work together as a community to filter out the inappropriate and malicious content while not creating a \"bullying\" system as you brought up.\n\nAny thoughts on that?","replies":[{"poster":"AirKingNeo","date":"2017-09-16T21:05:25.480+0000","up_votes":2,"down_votes":1,"body":"I like it but don't forget adding in \"moving threads to different sections\".\n\nOf course I have a slight bias because I'm often downvoted because people tend to downvote truths they dislike, but it sounds logical to make an upvote only system in other ways.","replies":[{"poster":"Melledoneus","date":"2017-09-17T01:47:30.605+0000","up_votes":3,"down_votes":0,"body":"Let me start out by saying that having the ability to move threads is something I support 100%. That being said, the problem I see with moving a thread to a different section is that it'll be difficult to determine if we should add it as a \"new\" post to that section or if it gets transferred there as if it always existed.\n\nFor example, I make a post about Cho'gath being OP in Memes and Games. It obviously doesn't belong there. So, a post that I posted 2 hours ago gets noticed by the Wardens (because said person posted at a late hour) and we transfer it to Gameplay. Now, the issue is that we can either:\n\n**1. **Have it show up as \"posted just now\" in the 'new' section of Gameplay, or\n**2.** Have it show up as \"posted two hours ago\" in Gameplay as if it was always there.\n\nEven if we do get that feature I think it will be hard to determine which feature will cause less confusion and chaos.","replies":[{"poster":"ˉˉˉˉˉˉ","date":"2017-09-17T02:09:21.154+0000","up_votes":7,"down_votes":0,"body":"Just do \"Posted 2 hours ago in [Memes & Games](https://boards.na.leagueoflegends.com/en/c/memes) (moved to [Gameplay ](https://boards.na.leagueoflegends.com/en/c/gameplay-balance)just now)\"","replies":[{"poster":"Melledoneus","date":"2017-09-17T02:19:55.270+0000","up_votes":5,"down_votes":0,"body":"Hm... I like this idea.","replies":[]}]},{"poster":"DrCyanide","date":"2017-09-17T02:18:48.062+0000","up_votes":1,"down_votes":0,"body":"Option 2 makes the most sense to me.\n\n* If you're using the Boards Home, it makes no difference which Board it was in originally, only the time it was originally made/last updated.\n* If you're only looking at New then you're looking to be first in a discussion and don't care much about it after that outside of replies to you. (Because you won't see that post in New again)\n* It's better to keep the chronology than to screw up \"it's new, but posted 2 hours ago\"","replies":[]}]}]},{"poster":"Firethorn","date":"2017-09-16T22:00:45.929+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Melledoneus,realm=NA,application-id=6heBIhQc,discussion-id=sbmqzAqB,comment-id=0003,timestamp=2017-09-16T20:27:17.225+0000)\n>\n> I would like to see a system where downvotes are replaced with reports. So if a comment is inappropriate or toxic, enough reports will make it hidden by default (this comment is below the threshold for X reason. This will definitely alert a Warden and we can look at it, and if it is not allowed we remove it.\n> \n> To avoid abuse cases Wardens could be allowed to also look at the comment and remove the hidden status if it was just a bunch of people abusing the system and disagreeing. That way we can work together as a community to filter out the inappropriate and malicious content while not creating a &quot;bullying&quot; system as you brought up.\n> \n> Any thoughts on that?\n\nYeah I like the idea","replies":[]}]},{"poster":"Leylania","date":"2017-09-16T08:39:02.229+0000","up_votes":9,"down_votes":3,"body":"I love how the dislikes that you get prove exactly what you said. People don't even comment what they like or dislike about your post, they just slam the dislike button for whatever reason. Hope someone like a moderator (or whoever manages the board in particular) sees your post and changes something, this board has a huge problem. The like/dislikes make it seem like it's a competition while it really shouldn't be one. Competitions will always create toxicity.","replies":[]},{"poster":"Risk of Fate","date":"2017-09-16T15:37:22.458+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"Jesus our Exodus","date":"2017-09-16T20:03:33.796+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Fate Fire,realm=NA,application-id=6heBIhQc,discussion-id=sbmqzAqB,comment-id=0001,timestamp=2017-09-16T15:37:22.458+0000)\n>\n> I&#x27;m all in favor for removing downvotes as they just beg for people to be negative. I&#x27;ve stated this a couple times, but I was a Moderator for Planet Minecraft for a few years and they had rid of the systems long before I joined. People there were friendly, they participated in discussions, and generally encouraged people to do better...Until EULA and Microsoft....then the community went to hell in a handbasket as everyone treated the game like it was their career path (coughAntVenomcough)\n> \n> When I was forums and something was in the wrong place, we simply moved it to the correct board. As annoying as it was, I would rather do a thousand of those than having to deal with one person multiposting across various accounts (the longest in my time I found was 5 separate people with 12 threads between them for a server). I don&#x27;t exactly know what the system here is, but I can probably bet it&#x27;s better than what we had which was something like BBoards from like 2007 which was more archaic than shit.\n> \n> ...and they updated them to be worse so not sure how that happened when they were in development for 6 years. I complain about reddit&#x27;s...\n\nAh, BBoards, I kind of miss those forums. Mostly because I moderated and developed one way back in the day. Even they were better than the current League Boards in my opinion. But yeah, they got old fast.","replies":[{"poster":"It Hertz When IP","date":"2017-09-17T04:15:55.177+0000","up_votes":1,"down_votes":0,"body":"BBoards are love\nBBoards are life\n\nBut seriously, I cut my internet community teeth on that format when I first started getting online as a kid. You can never beat that nostalgic feeling.","replies":[]}]}]},{"poster":"flibitydoo","date":"2017-09-16T21:16:04.710+0000","up_votes":3,"down_votes":0,"body":"the old forums had a voting sytem\n\nbut it was infinitely better than this crappy reddit esque one.\n\nit had upvotes and downvotes, with the only difference being where the votes were.\n\nand because they put the upvote/downvote in the bottom right of every post, they forced everyone to actually read through the post before voting. Which is why it was so much better.\n\ninstead, the current system allows you to just literally glance at the title from the front freaking page and downvote/upvote from there. This doesn't spark discussion. this sparks circlejerking and vote appeasing (aka, making posts specifically just to farm votes).\n\nactual discussion gets drowned out by memes and games and jokes that don't actually talk about the reality of the game and instead delude most of the readers into become \"board warriors\"\n\nyou know how people still think lee sin hasn't been nerfed (despite, y'know, the fact that he's seen a bunch of adjustment this year and last)? yeah they genuinely believe that because of all the memes surrounding him that they read about. and then they perpetuate the \"I hate lee sin\" circlejerk by making more shitposts in memes and games because they know for a fact it will garner upvotes.\n\nThe only issue the old forums actually had was that moderation did not exist. page 2 was a thing. Hell, page 2 went on for like 30 pages before the mods finally cracked down on it. And now that we actually have community mods, that issue no longer exists.","replies":[]},{"poster":"Attysu The Poro","date":"2017-09-18T20:50:48.745+0000","up_votes":2,"down_votes":0,"body":"I really like this thread, I love seeing the community give suggestions and have polite discussion about how to make our community better.\n\n> Secondly, add a \"move this thread\" tool to the moderator's arsenal. They want it badly, the rest of the community wants it badly, and I've seen some Rioters mention they want it too. What are you even waiting for? Take responsibility for your forums.\n\nI really like this idea! I think it'll be a lot less of a hassle, and can lead to less time being spent on wrong board reports and more on the other problems you suggested. I've seen it done on several other forums, and it would just be overall better\n\nThe idea I personally want to see is being able to embed images into our comments instead of having to find an image and copying its image address. A bit of a weird and underplayed request, but it would save so much time for people who have to take a screenshot, save it to desktop, go to imgur, upload it, wait for it to finish, get the RIGHT image address (there are several,) and then pasting the image into the text box, only for it to possibly not work all the time. But may that's the inner memester in me who likes posting in M&G. {{sticker:sg-miss-fortune}}","replies":[]},{"poster":"I Main Swain","date":"2017-09-17T03:28:45.410+0000","up_votes":1,"down_votes":0,"body":"has anybody else noticed as well that upvotes and downvotes tend to attract more exponentially?  for example, if i make a comment that receives a few upvotes, people seem to be more likely to upvote it than they would if it had none, and the more upvotes it has the more people want to upvote it.  same goes for downvotes.  am i just crazy?","replies":[{"poster":"Jesus our Exodus","date":"2017-09-17T22:50:54.228+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=I Main Swain,realm=NA,application-id=6heBIhQc,discussion-id=sbmqzAqB,comment-id=0007,timestamp=2017-09-17T03:28:45.410+0000)\n>\n> has anybody else noticed as well that upvotes and downvotes tend to attract more exponentially?  for example, if i make a comment that receives a few upvotes, people seem to be more likely to upvote it than they would if it had none, and the more upvotes it has the more people want to upvote it.  same goes for downvotes.  am i just crazy?\n\nYes, it's called the bandwagon effect. It's a real psychological thing you can look up on google. While comments also garner this effect in people, actually having to express your negative opinion with words is more a deterrent to just trolling a topic than having the ability to silently judge it by voting.","replies":[{"poster":"I Main Swain","date":"2017-09-17T23:27:00.830+0000","up_votes":1,"down_votes":0,"body":"oh yeah i know, i was just wondering if anybody else had noticed it or if i was the only one","replies":[]}]},{"poster":"StairCasexd","date":"2017-09-17T21:44:48.555+0000","up_votes":1,"down_votes":0,"body":"That's how it is in Lots of things in the net,  you do get people who post a meme or something on a YouTube comment and upvote it to get the ball rolling.  And the same thing happens with downvotes,  there definitely are some people on this boards and other communities who just read the title,  see the thread is at -1 and downvote as well without actually knowing what it's about.","replies":[]}]},{"poster":"Vhan8765","date":"2017-10-06T07:06:12.724+0000","up_votes":1,"down_votes":0,"body":"Ahh, so this is the post why Boards has been feeling so much more strict recently.\nI'm 100% for the changes, glad to see some charge actually being taken around the forums; although I am going to miss the ability to be openly snide.\nGuess I'll just have to go back to clever wordage and witty word play.\nBut alas, tis all for the better; maybe now Gameplay can have more then a single real discussion out of every ten posts.\nLooking forward to what the days bring; still shaky on the whole Warden Act, but they've done well enough.\n120%, a hell of a lot more communicative then Rito employees ever have been though, and that is something I can largely appreciate.","replies":[]},{"poster":"Jet Sett","date":"2017-09-17T16:47:56.977+0000","up_votes":1,"down_votes":0,"body":"It'd also help cases where people are arguing over where a topic should be. Like that one about minion block that was closed off with the mod saying to move it over to M&G because Gameplay is for discussing gameplay, which it was, but there are probably more specifics than what was put into the message.","replies":[]},{"poster":"Rafatinoni","date":"2017-09-17T15:21:23.779+0000","up_votes":1,"down_votes":0,"body":"Another problem with downvoting is that if you post an unpopular opinion your post will probably get downvoted because many people downvote everything they don't agree with. This also encourages a lot popular opinion posts, where you post something that most of the community agrees with so you get lots of upvotes since otherwise you'll get downvoted, making you only posting stuff you think the majority of the community thinks and not exactly what you actually think.","replies":[]},{"poster":"Vashtrall","date":"2017-09-17T13:28:36.624+0000","up_votes":1,"down_votes":0,"body":"And Riot's employees are against free speech.","replies":[]},{"poster":"Stillname","date":"2017-09-17T00:16:00.519+0000","up_votes":1,"down_votes":0,"body":"I agree that they should just get rid of the downvote button. If you disagree with someones opinion you should say why not just press a downvote button and move on just because you didn't like the first sentence they wrote.\n\nAlthough I completely disagree that Dota 2 and wow have better forums (can't say about the runescape ones). Blizzard only just recently got rid of the downvote button on wow forums and it is still up on all of their other games. It hasn't really improved the discussion though because people generally stop discussing the actual forum post topic about 3 pages in and trail off on a random argument. Wow and Overwatch posts also move way to fast. The hearthstone ones are more manageable but that game is not as popular.","replies":[]},{"poster":"SanKakU","date":"2017-09-16T17:28:41.634+0000","up_votes":1,"down_votes":0,"body":"I would just like to chime in that I'm tired of not being able to block other posters. Sometimes I just get someone being extremely rude and shaming me while slandering me and it gets old fast but the only defense I have against such harassment is to delete my own posts.","replies":[{"poster":"Jesus our Exodus","date":"2017-09-16T20:05:56.605+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SanKakU,realm=NA,application-id=6heBIhQc,discussion-id=sbmqzAqB,comment-id=0002,timestamp=2017-09-16T17:28:41.634+0000)\n>\n> I would just like to chime in that I&#x27;m tired of not being able to block other posters. Sometimes I just get someone being extremely rude and shaming me while slandering me and it gets old fast but the only defense I have against such harassment is to delete my own posts.\n\nOr report their posts for harassment. If they're truly shaming and slandering you, they should not be allowed to post on the forums.","replies":[{"poster":"SanKakU","date":"2017-09-16T23:13:33.919+0000","up_votes":1,"down_votes":0,"body":"I don't think that function does what we want it to do.","replies":[]}]}]},{"poster":"Blåbæret","date":"2017-09-16T20:57:07.184+0000","up_votes":1,"down_votes":0,"body":"It's rather impressive that Riot has such a shitty discussion site. It's functional, but barely so. It's the same in the launcher though: The store is a pain to use and the categorization makes little sense.","replies":[]}]}