{"poster":"Hype GENERAL ZOD","date":"2015-11-26T09:59:14.085+0000","title":"vel","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Salve s tutti. Ora come ora il buon {{champion:161}}  come &eacute;? Forte?fuori meta? Parlo sia mid che support.","replies":[{"poster":"StayM","date":"2015-11-26T10:53:54.579+0000","up_votes":1,"down_votes":0,"body":"in realtà vel'koz ha sempre avuto un win rate alto solo che ora, poiché le partite sono un po' più veloci e avendo lui danni alti di base (con bassi scaling) e danni puri risulta estremamente forte.\nAh sì la ulti ovvero il mega raggio della morte.\nE poi pensa a tutte le battute che ci puoi fare","replies":[{"poster":"Hype GENERAL ZOD","date":"2015-11-26T12:07:48.067+0000","up_votes":1,"down_votes":0,"body":"quindi non rende nel late game?","replies":[{"poster":"StayM","date":"2015-11-26T12:10:57.724+0000","up_votes":1,"down_votes":0,"body":"molto meno di quanto possa sembrare in ogni caso liandry+deathfire+true damage fanno il loro sporco danno, il punto è che devi usare moltissima armor pen per rendere al meglio.","replies":[{"poster":"Chroniicles","date":"2015-11-26T13:28:11.179+0000","up_votes":2,"down_votes":0,"body":"*magic penetration\n\nNon mi focalizzerei sugli scale bassi, proprio perchè ha true damage che stacca facilmente e puoi demolire qualsiasi cosa anche buildando un rylai come primo oggetto (cosa che in realtà è tanto worth su di lui).\nI veri problemi di velkoz sono altri, e te lo dico da persona che lo ha spammato all inverosimile sia sup che mid: \n- ha un kit composto da 4 spell, tutti skillshot. Se non ci prendi sei inutile, se sbagli la E per disingaggiare sei spacciato (o se la butti a caso ti rendi facile preda degli avversari)  perchè non hai escape, per questo soffri anche gli assassin (nessuno ti vieta però di giocare come afk farmer per ovviare a una lane phase un pò pressante). \n- sei troppo team dipendente, hai bisogno del classico \"muro\" in frontline che prende botte e fa sprecare cc mentre tu si spera stia decimando a suon di q il loro team. Ovviamente allo stesso modo paghi carissimi gli errori di posizionamento\n- sei un mago da burst, usata la combo puoi solo aspettare ti si resetti qualcosa (nel mentre sei alla stregua di un due di picche) e quindi se non hai un pò di cdr questo genere di situazioni si ripete spesso, troppo spesso.\n\nnulla toglie che sia il mio champ preferito in assoluto e che, anche se meno di altri, sia un pò op","replies":[]}]}]}]},{"poster":"Il Freddo","date":"2015-11-27T10:54:20.948+0000","up_votes":1,"down_votes":0,"body":"semplicemente divertente","replies":[]},{"poster":"Tankerous","date":"2015-11-26T11:08:51.486+0000","up_votes":1,"down_votes":0,"body":"Non è il top in nessuno dei due ruoli, ma è valido.","replies":[]}]}