{"poster":"Hype GENERAL ZOD","date":"2015-09-18T10:14:15.633+0000","title":"veigar","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"Salve. Nn ho mai provato questo champ ma stavo valutando di prenderlo,lo consigliate? Opinioni? Pro e contro? Grazie","replies":[{"poster":"ubercodlegend200","date":"2015-09-18T10:48:08.181+0000","up_votes":1,"down_votes":0,"body":"Pro:  dio del late, buon waveclear, ottimo burst, antimago , stun ad area, è simpatico come personaggio\n\n\nContro: pippa in early , la w é difficilissima da piazzare senza stun ,  la stun perde di efficacia se buildano i mercury e non riesci a piazzare la w, niente mobility ,molto squishy, problemi di mana, sensibilissimo ai burst \n\n\nIn pratica se arrivi al late ai vinto...  però devi arrivarci","replies":[{"poster":"Rokman","date":"2015-09-18T11:02:07.762+0000","up_votes":1,"down_votes":0,"body":"Ha un mid più significativo del late, se in first sei riuscito a farmare","replies":[{"poster":"Lucouss","date":"2015-09-18T12:09:47.223+0000","up_votes":1,"down_votes":1,"body":"Con Veigar hai bisogno di 3 oggetti fondamentali: {{item:3040}}, quindi devi stackare la tear, {{item:3089}}, per aumentare notevolmente il potere magico, e {{item:3157}} per non farti uccidere subito. Inoltre deve farmare parecchio, quindi secondo me è più significativo il late game se non sei feedato.","replies":[{"poster":"Coldeath00","date":"2015-09-18T12:40:12.371+0000","up_votes":2,"down_votes":0,"body":"Mi permetto di aggiungere la mia umile opinione. Credo che il Seraph non sia affatto un core, e al posto di quell'item prendere invece un Athene{{item:3174}} per vari motivi:\n\nNon fornisce mana ma garantisce molta più regen, che unita alla passiva unica e alla passiva di veigar(sinergia op) gli danno accesso ad un mondo praticamente manaless. È come avere un blue.\n\nRende il tuo early molto meno debole. Mentre la lacrima va stackata per un bel po di tempo e non dà neanche AP, l'athene fornisce maggiore mana regen, ap, utilissima magic resist, e cosa fantastica il 20% di cdr.\nAiuta ad arrivare al late più velocemente e a stare in lane per più tempo così da farmare meglio la Q.\n\nIl seraph lo consiglio sono in caso di team comp avversaria full ad. Ma anche in quel caso preferisco il morello{{item:3165}} \n\nSecondo item(contro AD) è la zhonya.\nSe vi trovate contro un AP (molto meglio, dato che outscalate qualsiasi AP) il secondo item è il rabadon.\n\n\"Ma noooh, il rabadon va fatto alla fineh per aumentare drasticamente l'ap\"\n\nNOH!\nCol rabadon aumentare anche il potere magico derivato dai lasthit di Q. Quindi non ne guadagnate 1, ma 1,35 che può sembrare poco ma è un enorme aiuto a raggiungere prima la parte del gioco in cui siete più forti (verso il late).\n\nIMPORTANTE\nricordatevi di spammare per bene la vostra risata. Perché si.\n\nBuon divertimento.","replies":[{"poster":"JollyJack360","date":"2015-09-18T19:09:27.457+0000","up_votes":1,"down_votes":1,"body":"si ma con feigar se sei furbo ti build full magic penetration tanto l'ap lo hai con la passiva della q XD\nè un rischio, ma diamine che danni...XD","replies":[{"poster":"Coldeath00","date":"2015-09-18T20:01:49.378+0000","up_votes":1,"down_votes":0,"body":"Certo che si, io ho elencato solo i primi che ti devi fare, poi certamente un bel voidstaff ci sta da dio :)","replies":[]}]},{"poster":"Lucouss","date":"2015-09-18T13:12:55.763+0000","up_votes":1,"down_votes":0,"body":"Grazie per il tuo commento!\nLo proverò come dici, siccome ho sempre fatto il Seraph perché mi dà mana, scudo e molto potere magico. Il Rabadon lo faccio anch'io subito.","replies":[{"poster":"Coldeath00","date":"2015-09-18T15:51:40.806+0000","up_votes":1,"down_votes":0,"body":"Di niente dude :)\nIl seraph è da preferire su chi ha bisogno di stackare molto mana come ryze (o l'altro oggetto di mama ma AD su urgot, il muramana)\n\nP.S.\nSpamma la risata. No, sul serio, fallo. È un taunt come quello di rammus ma più frustrante. \n\n\"Ma coooold, ma una risata non può essere un taaaaaunt\"\nMai giocato contro un teemo/veigar feeddato full AP? È così meravigliosamente squishy che quando ride vi prende la \n\"Lee Sin Syndrome\"\nMy mind is telling me noohh.....\nBut my body...\nMy body...\nIs telling me YEEEES\n\nE poi in genere morite.","replies":[{"poster":"Lucouss","date":"2015-09-18T18:38:44.419+0000","up_votes":1,"down_votes":0,"body":"> E poi in genere morite.\n\nBello! Ahahahah","replies":[]}]}]}]},{"poster":"Rokman","date":"2015-09-18T12:35:06.485+0000","up_votes":1,"down_votes":0,"body":"{{item:3040}} è situazionale","replies":[]}]}]}]},{"poster":"K4idor","date":"2015-09-19T09:53:45.740+0000","up_votes":1,"down_votes":0,"body":"Veigar è un champ fantastico, personalmente è stato il primo che ho comprato perchè assomigliava a vivi di ff IX.\nVeigar va bene contro qualunque mid laner, solo yasuo lo sovrasta (barriera, scudo passivo, mobility eccezionale). In early game è mediocre, non è consigliabile pokkare l'avversario per i problemi di mana, perchè se ne userà tanto per lasthittare di q, comunque si fa rispettare, perchè il danno della w si sente subito. Dopo il livello 6 la situazione cambia, perchè ti trovi un champ che 1 vs 1 può scalare la vita avversaria in un secondo. Generalmente buildo {{item:3027}} ,per abitudine su ogni mago, gli altri oggetti situazionalmente a seconda del game, se ho bisogno di + mana morellonicon o graal e spammi le skill in continuazione, o zhonya, che altrimenti sarebbe il secondo item. Poi dipende con cosa ti trovi meglio, luden, void staff(consiglio perchè da un burst immenso), rabadon. \nDiffida da chi dice che contro ad non funziona, perchè la combo r+q shotta tranquillamente ogni adc. è fragile, ma in teamfight la sua presenza è enorme grazie alle e che è uno stun aoe, la w smezza la vita di chiunque nel team avversario. \nI contro sono che non ha mobility, se riescono ad arrivarti non hai molte possibilità(ovviamente dipende chi, perchè comunque con la combo r+q non sarai l'unico a morire). la e non sempre è una salvezza, perché può essere aggirata in molti modi, primo fra tutti il flash. Ti consiglio di provarlo comunque, è davvero divertente vedere gli avversari esplodere in un secondo =D","replies":[]},{"poster":"Fiat480 EdVeneto","date":"2015-09-18T13:24:12.006+0000","up_votes":1,"down_votes":0,"body":"E' l'unico champ penso che ha così tanto danno in inizio game, la sua W fà 160 di damage :D","replies":[{"poster":"Coldeath00","date":"2015-09-18T20:03:30.949+0000","up_votes":1,"down_votes":0,"body":"La sua W è la mossa non-ulti più forte del gioco in termini di danno ;)","replies":[]}]},{"poster":"JollyJack360","date":"2015-09-18T19:08:13.378+0000","up_votes":1,"down_votes":0,"body":"è il champ più forte di tutto il gioco nella season 3 come mage, contro? è maledettamente fragile.\nil suo punto forza è farmare ed arrivare in late game per poi camminare contro il team avversario come un piccolo Boss.\ndavvero ora invece ha avuto dei nerf in certi punti e piccoli buff in altri ma è ancora viabile, unica pecca è che veigar è un anti mage, quindi contro un team full ad fa fatica, in quanto l'ulty si basa in base all'ap del nemico, in particolare 80%\nper questo è considerato un anti mage a tutti gli effetti.\nè un champ che sa dare molto, ma richiede un minimo di pratica.","replies":[]},{"poster":"Ste the ripper","date":"2015-09-18T18:42:26.189+0000","up_votes":1,"down_votes":0,"body":"A me piace, ma onestamente se stai cercando un mate per le ranked ti consiglio di cercare altrove.\nHa troppi difetti per essere competitivo, ma in normal è molto divertente e la fina boss secondo me è la skin più bella di lol\n\n\nIl pro di vergar è che la e è una skill fortissima","replies":[]},{"poster":"Coldeath00","date":"2015-09-18T12:46:33.546+0000","up_votes":1,"down_votes":0,"body":"Compra la skin figa e se hai contro un AP questo se la farà addosso credendoti un pro veigar.\ngg wp ez.","replies":[]},{"poster":"Rokman","date":"2015-09-18T11:01:08.310+0000","up_votes":1,"down_votes":0,"body":"Veigar è un mid-laner che gioca molto sul farm. I primi 7 minuti di partita sono quasi del tutto dedicati al farm di Q (per ogni last-hit che prendi con la Q aumenti il tuo potere magico di 1, e la Q può prendere fino a 2 minion/campioni).\n\nEcco le spell di veigar:\nPassiva: Equilibrio. Ogni secondo Veigar ripristina una piccola quantità extra del suo mana mancante\nQ : Colpo distruttivo. Lancia una sfera di energia in avanti che può colpire fino a 2 bersagli. Per ogni minion/campione/mostro ucciso con questa spell Veigar guadagna un bonus di ap (+1 per last hit) permanente. In più assist e kill garantiscono a Veigar un ulteriore bonus sull'ap (+1/+2/.../+5)\nW : Materia oscura. Veigar evoca un enorme FAGIOLO VIOLA che dopo un secondo circa precipita nell'area bersaglio, infliggendo grossi danni.\nE : Punto di non ritorno. Dopo qualche secondo di canalizzazione Veigar evoca un *pentagono magico di energia* che stunna chiunque tocchi i lati (senza però fare danni)\nR : Esplosione Primordiale. Anche chiamata \"Cos'era quello? Un Apc?\". Infligge un enorme quantitativo di danni su un singolo bersaglio, che si basano sia sull'Ap di Veigar (100% del suo Ap) che su quello dell'avversario (80% )\n\nEcco una lista di Pro e contro:\nPro\n-Scaling infinito di Ap\n-Elimina facilmente i campioni che si basano sull'Ap\n-Rigenerazione mana dalla passiva\n-W e R scalano con il 100% dell'Ap\n-CC ad area molto efficace se ben piazzato\n-Un buon pick contro Ahiri (non ne esistono molti di Ap buoni contro Ahiri)\n-Waveclear decente\n\nContro \n-Spell lente (in late la lentezza della W e della E si sentono moto)\n-Appunto perde un po di potenza in late\n-Soffre molto assassin (soprattutto Ad)\n-Non a mobility\n-Richiede più abilità di quanto non sembri \n\nPer la Build:\nOvviamente starta di {{item:1056}} e 2 {{item:2003}} \nPoi ( non necessariamente in quest'ordine)\n{{item:3174}} / {{item:3165}}  (o molto più situazionale {{item:3040}} )\n{{item:3089}} (è un must)\n{{item:3020}}    (  {{item:3158}}  se ti sei fatto {{item:3040}} )\n{{item:3285}} (Ottimo su Veigar)\n{{item:3157}} / {{item:3116}}  ( anche {{item:3152}} , ma  MOLTO SITUAZIONALE)\nOvviamente {{item:3135}} \n\nPer le maestrie fai le classiche da Apc\nPer le rune ti consiglio un po di Cd reduction e magic pen, piuttosto che ap flat.","replies":[{"poster":"Coldeath00","date":"2015-09-18T12:43:11.008+0000","up_votes":1,"down_votes":0,"body":"W il fagiolo viola. Seriamente, tanta stima per quel paragone.","replies":[]}]},{"poster":"Ringiel","date":"2015-09-18T10:45:54.350+0000","up_votes":1,"down_votes":0,"body":"è un nasus versione mago,all'inizio soffre e deve farmare di Q,potenziando l'ap,per poi iniziare a fare danno in late game;\n\npro:\nalti danni in late game\nun ottimo stun\nla R è a targhet e scala anche con l'ap del nemico,infatti è ottima per burstare i mage\nla Q potenzia l'ap,potenziando il danno a tutte le sue abilità;al contrario nasus potenzia sono il danno della Q.\n\ncontro \n3 skillshot\nfacile da focussare,visto che è privo di mobility\nin early non fa danni\nva facilmente oom nella lane phase","replies":[]},{"poster":"UnknownEV","date":"2015-09-18T12:39:03.494+0000","up_votes":1,"down_votes":1,"body":"Premi R e shotti tutti {{champion:45}}","replies":[]},{"poster":"kirchhoff","date":"2015-09-20T00:38:41.253+0000","up_votes":1,"down_votes":2,"body":"Non prenderlo, è inutile.","replies":[]}]}