{"poster":"Hype GENERAL ZOD","date":"2016-03-05T23:41:38.294+0000","title":"opinioni build top laner j4 e zac","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"{{champion:59}} ={{item:3071}} {{item:3748}} {{item:3022}} {{item:3143}} {{item:3065}} {{item:3047}} (rune rosse att. Damege,gialle vita,blu cdr(10percento),quint. Att.speed,18-0-12 fervore( o warlord )\r\n{{champion:154}}= {{item:3143}} {{item:3068}} {{item:3065}} {{item:3025}} {{item:3111}} {{item:3742}} rosse Ap pen,gialle vita,blu Cdr,quint.vita 12-0-18(presa dell&#039;immortale)\r\nQuesti sono i build che pensavo di fare,j4 volevo basarlo sul essere un tank da engage e utility( tramite lo stendardo,il CC e lo slow sugli AA del frozen) oltretutto con la Titanic dovrebbe fare anche un discreto numero di danni.\r\nMentre Zac volevo provarlo visto che mi pare i tank AP top siano molto gettonati in questo meta. Ma onestamente nn saprei come buildarlo.........full tank cosi rende o comunque dovrei buildargli un po di AP({{item:3151}} {{item:3027}} )? Opinioni?","replies":[{"poster":"Dr LouD","date":"2016-03-06T00:47:16.854+0000","up_votes":2,"down_votes":5,"body":"Fai\nTroppi\nCalcoli\n\nGIOCAAAAAAAA","replies":[{"poster":"73668109_DEL","date":"2016-03-06T06:25:08.428+0000","up_votes":3,"down_votes":0,"body":"L'apoteosi dell'\"ignoranza\".\nFare le build , rune , maestrie e tutte le strategie in generale fa parte del divertimento .\nLui sta giocando e tu non lo capisci .\n\nSu zac non posso dire nulla non avendo mai cercato di capire il campione.\nPer j4 invece una build , on hit non ce la vedo bene , da quello che ho capito e' piu' un burster caster che un autoattacker.","replies":[{"poster":"Dr LouD","date":"2016-03-06T10:02:33.657+0000","up_votes":1,"down_votes":1,"body":"Sai, se vai a guardare io sono il primo che commenta OGNI post di Hype consigliando le build.\n\nironia portami viaaa","replies":[{"poster":"73668109_DEL","date":"2016-03-06T10:04:37.221+0000","up_votes":2,"down_votes":0,"body":"mi dispiace , ma per me non sei cosi interessante da andare a vedere ogni tuo singolo post .","replies":[{"poster":"Dr LouD","date":"2016-03-06T10:07:41.216+0000","up_votes":1,"down_votes":1,"body":"E allora non parlare :v","replies":[{"poster":"73668109_DEL","date":"2016-03-06T10:44:06.911+0000","up_votes":2,"down_votes":0,"body":"Casomai non scrivere m8 .","replies":[]}]}]}]},{"poster":"Hype GENERAL ZOD","date":"2016-03-06T08:55:10.800+0000","up_votes":2,"down_votes":0,"body":"Mi hai capito perfettamente XD pensare alle build e tutto é quasi meta del divertimento per me XD poi andare in game senza avere le idee chiare su cosa fa/potrebbe fare o come buildare e gestire il proprio campione equivale a non ottimizzarlo e non divertirsi nemmeno XDMmmh per j4 nn so e che cmq vista la passiva Dell E in late( mid late diciamo dai) ottieni un buon att.speed ,comunque piu che altro nn saprei come altro buildarlo,essendo un champ da engage deve essere tank senno muore tempo 2 secondi, piu che altro la Titanic la vedo troppo forte ora come ora su chiunque si buildi tank, senno una build come{{item:3142}} {{item:3812}} {{item:3071}} {{item:3742}} {{item:3065}} {{item:3047}}  ,meglio secondo te?","replies":[{"poster":"73668109_DEL","date":"2016-03-06T09:34:24.705+0000","up_votes":1,"down_votes":0,"body":"non sono un main j4 , ma se proprio dovessi utilizzarlo lo farei cosi :\n{{item:3748}} {{item:3047}}  {{item:3742}} {{item:3102}}  {{item:3190}} {{item:3083}}","replies":[]}]}]},{"poster":"Hype GENERAL ZOD","date":"2016-03-06T09:02:01.011+0000","up_votes":2,"down_votes":0,"body":"Fare calcoli e pensare alle build personalmente mi diverte XD","replies":[{"poster":"Dr LouD","date":"2016-03-06T10:04:01.085+0000","up_votes":1,"down_votes":0,"body":"Il mio commento è ironico :v (data la mole immensa di post che apri per 120 campioni e 120 build diverse)\n\nQuello che ti dico è.. Sperimenta! Gioca con 100 build diverse e poi fai da solo i tuoi calcoli!\n\nImho è mille volte più divertente così che chiedere ad altri ;)\n\nAnyway, se ti serve una build per j4 top, io farei:\n\n{{item:3142}} {{item:3071}} {{item:3748}} {{item:3158}} {{item:3742}} {{item:3065}} ","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T11:51:02.808+0000","up_votes":1,"down_votes":0,"body":"Ah capitonn mi ricordavo di te XD bom onestamente nn vedo il problema di aprire post. Se ho dubbi chiedo,nn mi pare di aver mai fatto post offensivi ,inadatti o spammando streaming o simili. Nn capisco il problema. Voglio provare un champ ma nn so come buildarlo e piuttosto che giocare e rischiare di far perdere il team chiedo agli altri consigli........cmq provo la build dopo grazie XD ","replies":[{"poster":"Dr LouD","date":"2016-03-06T12:00:13.727+0000","up_votes":1,"down_votes":1,"body":"Ma non c'è nessun problema .-.\n\nStavo scherzando .-.-.-.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T16:26:51.170+0000","up_votes":1,"down_votes":0,"body":"A oki XD cmq bom sono io che tolti i 3-4 main che ho sono sempre alla ricerca di nuovi main ma nn so mi annoiano tutti XD","replies":[]}]}]}]}]}]},{"poster":"Ucr0niA","date":"2016-03-06T09:22:35.270+0000","up_votes":3,"down_votes":2,"body":"Ti prego Hype, {{champion:154}}  con {{item:3025}}  o {{item:3027}}  no, ti scongiuro.\nZac top è particolare comunque, dovessi giocarlo top (lo maino, ma jung) forse lo giocherei così:\n{{item:3158}} {{item:3065}} {{item:3068}} {{item:3151}} \nCome certi\n\nE poi proverei a ottenere un restante 20% CDR trimite Gilfi/quint o/e grazie a un altro item quale {{item:3056}} (che non da mana, da hp, armor e CDR)","replies":[]},{"poster":"kirchhoff","date":"2016-03-06T15:47:05.857+0000","up_votes":1,"down_votes":0,"body":"Lascia stare zac top.","replies":[]},{"poster":"Kazushi San","date":"2016-03-06T14:00:06.489+0000","up_votes":1,"down_votes":0,"body":"Prendi il blink dagger.","replies":[]},{"poster":"iKharon","date":"2016-03-06T13:53:20.296+0000","up_votes":1,"down_votes":0,"body":"My 50 cents for J4:\nFirst item: {{item:3071}} Per una molteplicità di ragioni questo item è un must per Jarvan. Buildalo come primo che non sbagli mai.\nSecond: {{item:3156}} oppure {{item:3142}} perchè nell' early-mid ha danni atroci, con un all-in eseguito nel modo corretto sei in grado di shottare quasi tutti i champ. Se invece per necessità devi andare tank scegli tra {{item:3143}} {{item:3065}} {{item:3742}} {{item:3102}} {{item:3190}} (a seconda del tipo di danni che ha il tuo nemico in lane)\nSituational: {{item:3110}} {{item:3053}} {{item:3026}} {{item:3075}} {{item:3078}} {{item:3074}} {{item:3748}} {{item:3800}} {{item:3083}} \nSono tutti oggetti che hanno il loro perchè, scegli con cura a seconda del tuo team e di quello nemico. Ciao.","replies":[]},{"poster":"Ste the ripper","date":"2016-03-06T11:34:35.606+0000","up_votes":1,"down_votes":0,"body":"Quella di zac può workare, non farei mai una build a prescindere ma ci può stare, quella di j4 no.\nIl mallet è un item da early game, non puoi farlo come 3° ed è ingiocabile su 3/4 dei champ di lol perché ha un build path bruttissimo oltre al fatto che non verrebbe adeguatamente sfruttato, praticamente solo gnar può giocarlo.\nLe scarpe vanno fatte in base alla situazione e la bc è un bell'item ma non la farei a prescindere, dipende dagli avversari, ricorda che ci sono tanti begli item atm come la malmortius, inoltre anche l'omen è buono ma non a prescindere, se hanno poca crit chance c'è di meglio.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T11:46:49.914+0000","up_votes":1,"down_votes":0,"body":"Per i build ho messo gli oggetti in ordine sparso,le scarpe nn le farei mai come quinto e sesto oggetto XD cmq ovvio sono build indicativi ( e che variano in base a cosa ha di feedato il team nemico o quanti AD o AP posseggono),chiedevo solo una linea guida,ossia se la combinazione titanic+ Black cleaver e full tank su j4 renda o sia meglio una combinazione di 3 ogetti AD e 2 tank von scarpe tank.","replies":[{"poster":"Ste the ripper","date":"2016-03-06T12:24:45.828+0000","up_votes":1,"down_votes":0,"body":"titanic più bc può workare :)","replies":[]}]}]},{"poster":"A Yordle ln Heat","date":"2016-03-06T07:44:48.753+0000","up_votes":1,"down_votes":1,"body":"Zac Top, per funzionare, deve essere buildato molto più AP di quanto la gente si aspetta, inoltre si sposta troppo velocemente (e smuove con sé in nemici in range troppo alti) perché il {{item:3025}} sia efficacie. E togli anche il {{item:3143}}; è estremamente situazionale, e stai anche parecchio versatile con le scarpe; non dare per scontato che ti servano per forza le Mercury; certo, resistenza magica e resistenza agli impedimenti sono molto buoni su di lui, ma in certi matchups potresti avere bisogno di più mobility o di quel tocco di armor in più; l'unico paio di scarpe che Zac non può mettersi sono quelle per l'attack speed, praticamente.\nIo direi che potresti mettere, al posto di Mallett e Randuin, una {{item:3151}} e un {{item:3116}}.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T08:58:20.592+0000","up_votes":1,"down_votes":0,"body":"Scusa ma{{item:3116}}  a cosa serve su zac? Nn rallenta già con la Q e lancia in aria con la E? Cioè la buildarei solo per le Stat ignorando la passiva praticamente? Cmq si le mie sono build indicative ovvio,le scarpe le avevo messe perché avevo inserito solo 1 oggetto mr. Poi ovvio che in base al game vario XD  cmq ok piu AP su zac mi sembra logico effettivamente ma avevo seguito lo schema del build in giungla XD","replies":[{"poster":"A Yordle ln Heat","date":"2016-03-06T10:23:45.993+0000","up_votes":1,"down_votes":1,"body":"La Rylai ti da uno slow continuo e costante sulla ultimate, che non è da sottovalutare in teamfight. Inoltre ti da AP e HP, che servono sempre a Zac Top.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T11:57:09.656+0000","up_votes":1,"down_votes":0,"body":"Vero mi ero scordato della ultimate,cosi si ha slow sulla W e ultimate ad area. Sembra ottimale XD ok ricapitolando faro cosi {{item:3151}} {{item:3116}} {{item:3143}} {{item:3065}} {{item:3047}}  e un ultimo oggetto tank in base al team nemico ( ovvio omen o il mantello e le scarpe in base alla situazione ,giusto indicativamente per rappresentare un oggetto armor e uno mr.pensavo cosi)","replies":[]}]},{"poster":"sboboo","date":"2016-03-06T09:43:43.811+0000","up_votes":1,"down_votes":1,"body":"Vero, {{item:3116}}  è inutile, ti aggiunge solo un piccolo slow alla W. Meglio {{item:3001}}  o {{item:1312}}","replies":[]}]}]},{"poster":"kernel panic","date":"2016-03-06T07:49:11.927+0000","up_votes":1,"down_votes":1,"body":"Zac con il guanto o la roa no.\n\nIn più, per quanto in top lane il suo harrass di Q sia buono, ad un certo punto i tuoi danni vengono del tutto ignorati dal laner nemico se è anche lui un tank.\n\nJarvan IV in top ogni tanto si vede ed è molto più competitivo rispetto a zac. IMHO.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T09:00:44.682+0000","up_votes":1,"down_votes":0,"body":"Li ho tutti e due e j4 lo ho Strà usato nella s5 ,volevo provare zac top visto che in giungla mi diverte ma ho jungler che mi attirano di piu XD per il build di J4 pensi vada bene cosi o meglio un build più bruiser? Piu che altro dall uscita della Titanic nn lo ho usato molto quindi per quello chiedo","replies":[{"poster":"kernel panic","date":"2016-03-06T10:27:11.069+0000","up_votes":1,"down_votes":0,"body":"J4 ha molta flessibilità di build. Credo dipenda da come ti stia andando il game. Personalmente toglierei {{item:3022}} e lo sostituirei con uno {{item:3053}} .\n\nSe sei feedato puoi anche sostituire la {{item:3065}}, con un {{item:3156}} , in quanto gli hp che non hai dalla visage li prendi dallo sterak. In più la malmortius mi sembra davvero forte come item al momento.","replies":[]},{"poster":"sboboo","date":"2016-03-06T09:19:51.802+0000","up_votes":1,"down_votes":1,"body":"Allora:\nZac top ha 2 start principali: {{item:3068}}  o {{item:3065}} . Se sei contro un tank low damage, maxa la W (es. {{champion:54}} ) Ti permette di avere un danno sostenuto migliore, il push potential è lo stesso della Q, e solitamente puoi bullare usando la W appena si avvicina. Appena hai la {{item:3065}} hai un powerspike immenso, recuperi ogni trade con i blob. La q si maxa contro squishy/champ che non puoi tradare (Poppy, riven, fiora). La build che preferisco è questa : {{item:3065}} {{item:3151}} {{item:3143}} {{item:3001}} {{item:3020}}  Altro item tank. Mantieni una buona tankiness se ti sai giostrare con la passiva, e buoni danni.","replies":[]}]}]},{"poster":"x A N D R E","date":"2016-03-06T06:49:42.408+0000","up_votes":1,"down_votes":0,"body":"A zac serve un po di ap o non reggi la lane","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-03-06T08:55:42.397+0000","up_votes":1,"down_votes":0,"body":"A ok,mai provato in lane e usato solo 2 volte in giungla per quello chiedevo XD","replies":[{"poster":"x A N D R E","date":"2016-03-06T09:45:04.038+0000","up_votes":1,"down_votes":0,"body":"In giungla fatti la gemma dell'eco, non il tank; sei molto più ultile alla squadra","replies":[]}]}]}]}