{"poster":"Chubby Teddy","date":"2017-09-19T15:02:25.002+0000","title":"14  Tage Sperre","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":8,"body":"Hallo, anbei der Banntext\r\n\r\nSpiel 1\r\nChubby Teddy: sona u are the only who wasnt connected xD\r\nChubby Teddy: gj\r\nChubby Teddy: ty for holdin\r\nChubby Teddy: i pinged it btw\r\nChubby Teddy: i know\r\nChubby Teddy: lucian is solo\r\nChubby Teddy: she hit me with her knockback\r\nChubby Teddy: idc\r\nChubby Teddy: im getting gangbanged by thresh and kayn 24/7\r\nChubby Teddy: 2*\r\nChubby Teddy: for?\r\nChubby Teddy: getting ganked\r\nChubby Teddy: yeah\r\nChubby Teddy: this crying in normal games\r\nChubby Teddy: you are 24/7 top j4 still 0/0 how about dat\r\nChubby Teddy: what excatly do i do?\r\nChubby Teddy: getting ganked? well sorry\r\nChubby Teddy: sorry dat they have a jungler and we meh\r\nChubby Teddy: u all dont care about me as well\r\nChubby Teddy: why should i care about u\r\nChubby Teddy: is ee\r\nChubby Teddy: u let mid fall\r\nChubby Teddy: ganked me when i was dead\r\nChubby Teddy: very much caring\r\nChubby Teddy: i mute u all this is getting way to childish cho if u wanna win carry it, u tilted me to much hf\r\nChubby Teddy: can u report riven and cho pls they flame me just bcs i try a new champ and im not good with it, ty\r\nChubby Teddy:  i didnt say anthing stop lying\r\nChubby Teddy: yeah right\r\nChubby Teddy: and they see riven lying\r\nChubby Teddy: if u want tryhard play rank\r\nChubby Teddy: dude\r\nChubby Teddy: bcs i get telled 24/7 &#039;&#039;nice ping&#039;&#039; you guys are tiling as hell what u expect from me\r\nChubby Teddy: u dont get it\r\nChubby Teddy: u take this game to serious maybe u should take a break from it\r\nChubby Teddy: cho just play its pointless to talk\r\nChubby Teddy: im so happy i can u report u all after this\r\nChubby Teddy: for?\r\nChubby Teddy: getting flamed nice report reason\r\nChubby Teddy: dat is no reason\r\nChubby Teddy: u and cho being toxic\r\nChubby Teddy: much better?\r\nChubby Teddy: u act like one cho\r\nChubby Teddy: with your c\r\nChubby Teddy: about losing\r\nChubby Teddy: a normal game\r\nChubby Teddy: ah so u also dont care good to know\r\nChubby Teddy: mate i dont wanna here the story of your life and im not here to make u feel good\r\n\r\nWieso werde ich wegen sowas direkt 14 Tage gesperrt? Ich wurde in dem Spiel beleidigt ohne Ende und ich finde das was ich geschrieben habe ist nicht wirklich toxisch","replies":[{"poster":"Angel Ayume","date":"2017-09-19T15:41:56.100+0000","up_votes":4,"down_votes":1,"body":"Wenn du komplett eine weiße Weste hättest, dann wäre das sicher kein Grund für einen 14-Tage Bann. Aber du warst in der Vergangenheit sehr häufig toxisch. Da Reportaufrufe eben auch toxisch sind, hat dieses Game gereicht, um das Fass zum überlaufen zu bringen. \nDu hättest auch Beleidigungen schreiben können, das hätte keine Rolle gespielt. Den Bann hättest du so oder so bekommen, da jegliches toxisches Verhalten in deinem Fall wohl zu einem Bann gereicht hätte.\nSei einfach nicht mehr toxisch und verstehe, dass dein Verhalten falsch ist und du musst auch nicht befürchten einen Perma zu kassieren.\n\nBtw. ist das falsch was du gesagt hast. Spieler die regelmäßig beleidigen bekommen auch irgendwann einen Bann. Wer aber sonst nie toxisch ist und in einem Game mal ein Noob, Arschloch oder Pisser oder so raushaut, der wird wohl kaum einen Bann bekommen.","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:45:13.898+0000","up_votes":1,"down_votes":2,"body":"ich verstehe nicht was daran toxisch ist dazu aufzurufen toxische Spieler zu reporten und ich glaube das kann man auch nicht logisch erklären","replies":[{"poster":"Humpelstilzche","date":"2017-09-19T16:01:09.238+0000","up_votes":6,"down_votes":0,"body":"Es ist zum einen einfach wahnsinnig nervig. \nStell dir einfach mal vor das wäre im echten Leben auch so. Statt einfach zur Polizei zu gehen und selber ein Verbrechen zu melden, würden die Leute erstmal in der Nachbarschaft von Tür zu Tür gehen und alle darum bitten das Verbrechen doch bitte bei der Polizei zu melden.\nDas klingt albern, aber echt genauso albern ist das in League. Völlig nutzlos, völlig unangebracht und einfach nur nervig. \n\nDazu kommt noch, dass es einfach miese Stimmung verbreitet. Was ist das denn für ein Team, das permanent darüber diskutiert, wer alles gemeldet werden sollte? Klar, man kann argumentieren dass die Stimmung in Teams wo geflamed wird ja eh schon im Eimer ist, aber die Leute fragen ja bei jedem Pups für völlig unangebrachte Gründe nach Reports, z.B. schlechtes Spielen das dann mal ganz schnell als \"inting\" oder \"trolling\" etikettiert wird.","replies":[]},{"poster":"Angel Ayume","date":"2017-09-19T16:00:16.073+0000","up_votes":4,"down_votes":1,"body":"Doch kann man. \nReportaufrufe sind völlig unnötig, da der Report von dir völlig ausreichen würde. Dazu verbreitet es noch negative Stimmung und auf diese negative Stimmung kann man getrost verzichten! Es reicht wenn ein Spieler flamed, da musst du nicht noch Unmut verbreiten. Zudem zeigst du dem Gegner, dass dein Team schlecht gelaunt ist und sie können, indem sie provozieren noch mehr Tilt bringen und das Spiel einfacher gewinnen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-09-19T17:14:00.298+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chubby Teddy,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=00050000,timestamp=2017-09-19T15:45:13.898+0000)\n>\n> ich verstehe nicht was daran toxisch ist dazu aufzurufen toxische Spieler zu reporten und ich glaube das kann man auch nicht logisch erklären\n\nNaja... also... ich sage das mal so... ich habe schon Spiele gewonnen, nur weil der Gegner \"Report X for AFK\" in den All Chat geschrieben hat... Ich bezeichne so was ja immer gerne als \"Feeding\"... als \"Thx for feeding me that information... I will now abuse the fact, that you guys are arguing...\"\n\nIn dem Fall macht mein Team dann erst Mal nen Drachen... und danach den Baron... Oder im 3vs1 den Botlane Tower, je nachdem, wer (oder wann) der disconnect auftritt. Und dann reconnected der Spieler wieder, das Spiel wird aber trotzdem verloren.\n\nWarum sollte ich meinen Gegner mit für ihn eventuell wichtigen Informationen versorgen? Warum sollte ich ihn wissen lassen, dass ich tilted bin? Dass der Jungler und ich uns uneins sind? \nWelchen Vorteil hat dein Team davon? Genau genommen hat nur das Gegnerteam einen... und Dinge in den Chat schreiben, von denen nur der Gegner profitiert, ist halt... nun ja... toxisch und unnötig. \n\nUnd Reportaufrufe im eigenen Chat... nun ja... Also deine Teammitglieder kriegen ja mit, was ihr beide so schreibt. Und die Stimmung ist dann in Team eh schon schlecht. Die wird dann bestimmt nicht besser werden, in dem du etwas rein destruktives schreibst.","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2017-09-19T15:10:36.976+0000","up_votes":2,"down_votes":1,"body":"das \"reporte xy\" ist inzwischen ein banngrund.\n\n>Chubby Teddy: can u report riven and cho pls they flame me just bcs i try a new champ and im not good with it, ty","replies":[{"poster":"Bontukuck","date":"2017-09-19T15:13:52.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pride Òó,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=0001,timestamp=2017-09-19T15:10:36.976+0000)\n>\n> das &quot;reporte xy&quot; ist inzwischen ein banngrund.\n\ndann hab ich mich ja richtig erinnert. würde einfach nicht weiter drüber diskutieren und draus lernen.","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:21:49.999+0000","up_votes":1,"down_votes":0,"body":"wie lange dauert es bis der Support antwortet? Waren 4 permates in meinem Team und die haben wie gesagt die gegner auch noch aufgefordert mich zu reporten, also vielleicht habe ich ja 6 Reports oder so kassiert und es lag daran","replies":[{"poster":"OwE Trickster","date":"2017-09-19T15:25:57.376+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chubby Teddy,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=000100000000,timestamp=2017-09-19T15:21:49.999+0000)\n>\n> wie lange dauert es bis der Support antwortet? Waren 4 permates in meinem Team und die haben wie gesagt die gegner auch noch aufgefordert mich zu reporten, also vielleicht habe ich ja 6 Reports oder so kassiert und es lag daran\n\nNein 6 Reports sind gleichwertig wie 1 Report!","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:29:04.508+0000","up_votes":1,"down_votes":0,"body":"Was bringt das dann überhaupt? xD","replies":[{"poster":"Humpelstilzche","date":"2017-09-19T15:55:39.247+0000","up_votes":4,"down_votes":0,"body":"Das ist eigentlich ganz simpel. Du kannst das mit einer Anzeige bei der Polizei vergleichen. Wenn ein Vergehen gemeldet wird, wird diese Meldung überprüft. Wenn man bei dieser Überprüfung tatsächlich Vergehen entdeckt, gibts eine Strafe. Wenn nicht, dann nicht. \nGenauso wie bei der Polizei ändert es auch bei Reports nichts, wie viele Leute das melden. So lange es mindestens einer meldet, kommt es zur Untersuchung und das Urteil hängt nur vom Ausgang dieser Untersuchung ab, nicht davon wieviele Leute diese Untersuchung ausgelöst haben. \nDas wäre doch dumm, wenn du automatisch schuldig wärst, nur weil mehrere Leute dich beschuldigen.","replies":[]}]}]},{"poster":"Bontukuck","date":"2017-09-19T15:24:04.820+0000","up_votes":1,"down_votes":0,"body":"das macht kein unterschied, egal wer dich reportet und wieviele, es zählt als 1 mal.{{champion:78}}","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:32:01.898+0000","up_votes":1,"down_votes":0,"body":"wieso sollte es dann Strafbar sein, andere dazu aufzurufen, wenn es doch eh nix bewirkt..","replies":[{"poster":"Bontukuck","date":"2017-09-19T15:34:22.739+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chubby Teddy,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=00010000000000000000,timestamp=2017-09-19T15:32:01.898+0000)\n>\n> wieso sollte es dann Strafbar sein, andere dazu aufzurufen, wenn es doch eh nix bewirkt..\n\ndu drohst leuten und feuerst sie mit sowas nur noch mehr an.","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:36:02.298+0000","up_votes":1,"down_votes":3,"body":"Das heißt drohen Leute zu reporten > Kys, noob, l2p, piece of Sht, Nazi ins Gas ?","replies":[{"poster":"legofreak1","date":"2017-09-19T15:39:04.096+0000","up_votes":1,"down_votes":0,"body":"Nein, aber beides stellt Regelverstöße dar und wird entsprechend bestraft. Im richtigen Leben werden immerhin Ladendiebe auch verfolgt, obwohl es noch Mörderer gibt, welche deutlich schlimmere Strafen begehen.","replies":[{"poster":"Chubby Teddy","date":"2017-09-19T15:40:56.238+0000","up_votes":1,"down_votes":2,"body":"Richtig so, aber ein Mörder bekommt nicht die selbe Strafe wie ein Ladendieb oder wie in diesem Fall wurden die wirklich toxischen Leute ja offenbar gar nicht gebannt","replies":[{"poster":"clair de lune289","date":"2017-09-19T15:50:12.246+0000","up_votes":1,"down_votes":0,"body":"aber auch ein Ladendieb wird nach dem X-Mal für eine lange Zeit ins Gefängnis kommen. Nach der CR warst du auf Bewährung und auch im RL würde eine Bewährungsstrafe bei JEDEM Vergehen ,das über ein Ordnungsgeld geht, widerrufen werden.\nDu solltest dir die EMail zum Bann gut durchlesen,diese erwähnt explizit das es beim deinem nächsten Vergehen,egal wie \"harmlos\" das auch seien sollte, einen Permabann gibt.\nDieser wird bei einer gerechtfertigten Strafe unter KEINEN Umständen aufgehoben.","replies":[]},{"poster":"Humpelstilzche","date":"2017-09-19T15:49:17.785+0000","up_votes":1,"down_votes":0,"body":"Auch in Leage wird durchaus ein Unterschied gemacht. Bei extremeren Verstößen werden gerne mal ein paar Strafstufen übersprungen.","replies":[]},{"poster":"legofreak1","date":"2017-09-19T15:47:44.728+0000","up_votes":1,"down_votes":0,"body":"Woher weißt du, dass die anderen Spieler nicht ebenfalls eine Strafe erhalten haben? Man bekommt bei weitem nicht für jede verteilte Strafe eine Benachrichtigung und CR kann man nicht über die Matchhistory eines Spielers erkennen.\n\nWiederholte Ladendiebe können außerdem ebenfalls eine Gefängnisstrafe erhalten, nur dauert es dafür eben länger. In lol kann man für härtere Vergehen Strafstufen überspringen und ich weiß gerade nicht, ob wir dafür Belege haben, aber das Strafsystem scheint bei neuen Accounts etwas intensiver eingestellt zu sein, um toxische Zweitaccounts schnell auszusortieren. Es mag Zufall sein, du wärst aber nicht der erste Spieler unter level 30, welcher sich mit einem eher mildem Chatlog über eine Strafe beschwert.\n\nWo ich außerdem dabei bin, möchtest ich kurz auf folgende Regel aufmerksam machen, bevor dies wahrscheinlich später auftauchen wird:\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/MaP0LRjY-chatlogs-or-it-didnt-happen-eine-neue-regel-in-den-spielerverhalten-boards\nKopier bitte deinen Chatlog in Form eines Screenshots in deinen Eröffnungspost hinein.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Chubby Teddy","date":"2017-09-19T15:30:33.724+0000","up_votes":0,"down_votes":3,"body":"Wie wahrscheinlich ist es denn, dass die Strafe aufgehoben wird? Ein Freund von mir war in 2 Games absichtlich AFK, wurde 14 Tage gebannt, hat den Support angeschrieben und es wurde aufgelöst und das noch am selben Tag","replies":[{"poster":"Humpelstilzche","date":"2017-09-19T15:45:32.461+0000","up_votes":4,"down_votes":0,"body":"Eh, nein, das ist nicht passiert, schon allein weil Bans fürs AFK gehen gar nicht existieren. Haben sie auch noch nie. \n\nGanz generell ist die Chance dass dein Ban aufgehoben wird unheimlich gering. Das Ban-System ist äußerst zuverlässig und nur wenn du komplett unschuldig wärst (was du nicht bist), würde der Ban aufgehoben. \n\nDarf ich dich um einen Gefallen bitten?\nKönntest du bitte Screenshots der kompletten Nachricht machen, die du im Client erhalten hast und sie dann hier posten?\n\nIch möchte die Möglichkeit ausschließen, dass du uns hier etwas vorenhältst. Entschuldige bitte mein Misstrauen, aber du glaubst nicht wie oft das hier passiert. Das ist nichts persönliches und nichts gegen dich, es ist einfach nur eine traurige Erfahrung, dass bei derartigen Threads gelogen wird bis sich die Balken biegen. Ich würde das in deinem Fall gerne ausschließen. \n\nedit: Außerdem wüsste ich gerne, ob das nun deine allererste Strafe ist, oder ob du schon vorher Restrictions hattest. Diese Frage wurde dir hier schon ein paar Mal gestellt, aber du hast sie nicht beantwortet (außer ich hab was übersehen). Das ist eine sehr sehr wichtige Frage!","replies":[{"poster":"KéksRind","date":"2017-09-19T16:51:59.639+0000","up_votes":1,"down_votes":0,"body":"Humpelstilzche, natürlich hatte er vorher Strafen, sonst würde er diese frage, ob er welche hatte nicht so ignorieren er antwortet auf ales, nur auf diese frage nicht? ok.  Und wieso errinert er sich an die beleidigungen? weil sie im chatlog stehen und er sie hinaus genommen hat. und nun nurnoch mimimimimimi kommt.","replies":[]}]}]},{"poster":"Honkidibonki","date":"2017-09-20T10:51:22.243+0000","up_votes":1,"down_votes":4,"body":"Hallo Chubby Teddy\n\nIch hole mal eben kurz aus... da es mir ähnlich Verfahren ist wie dir, wenn auch im ranked. Ich habe vor ca 1,5 Jahren einen Chatbann erhalten wegen \"unangemessenem Verhalten?... \". Zu jener Zeit wurde ich häufig grundlos reportet. Da ich as dem Diamandbereich komme, aber vorher ein Onetrackpony war und mich entschied radikal umzustellen und auf meinen mainchamp komplett zu verzichten, bin ich auf gold 4 abgestiegen und wurde monatelang als \"geboostet\" reportet. Mir wurden dort auch 2 Chatverläufe gepostet bei denen ich mich zumindest laut Riot und dieser Community hier falsch verhalten habe. Bei dem ersten wurde ich zugeflamt weil ich mich aus irgendwelchen Gründen nicht einloggen konnte ( war noch vor der 3 minuten Regel) zu spät ins spiel kam. Und dann paarmmal gedived wurde von top+jgl... (welcome to fairplay)... einige male  starb und leider keine Hilfe bekam. Beim zweiten wurde ich von einem Tresh reportet der von anfang an geflamt hat und dann später getrollt hat... sich mit absicht am turret des gegners killen lies. In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\n\nWie du also siehst besteht hier eine Ähnlichkeit.\nMeine Erfahrung sagt mir gerade wenn du häufig neue Sachen ausprobierst und nicht immer die besten Spiele hast wird in der LoL-Community gerne mal reportet. Und wenn dann noch ein paar Spiele dazu kommen bei denen du auf das geflame anderer reagierst bist du schnell der Boomann. Auch bei mir wurde das gleiche palaver der Leute an den Tag gelegt. \" für report aufrufe kann man gebannt werden\". wobei das hier noch vergleichsweise human zugeht... ich wurde damals regelrecht zerissen. xD Deswegen würde ich dir einfach empfehlen, wenn überhaupt, mach sowas nach dem Spiel, denn auch wenn, report aufrufe am Ende des Spiels, kurz bevor der Nexus fällt, nicht mehr das Spiel beeinflussen können. Soweit reicht der Horrizont mancher Leute nunmal nicht, wenn sie sich den Chatverlauf durchlesen. \nIch empfehle dir auch die Leute und zur Not auch die Pings zu muten. Auch hier hat das ganze seine Grenzen (wurde neulich nachdem ich nen Flamer gemutet hab, von ihm mit Absicht mit dem Blastcone in die Gegner geschickt), aber generell wenn er das Spiel auch gewinnen möchte, so wirst du so dem tilt entgehen und kannst entspannt weiterspielen. Was ich dagegen nicht gut finde ist das /mute all denn letztenendes gewinnt man auch wenn man gut zusammen spielt, das ist weniger der Fall wenn man keine Calls mehr mitbekommt und nicht alles ist über Pings zu regeln.\n\n\nWas deine Beschwerde bei Riot anbelangt, da muss ich dich leider enttäuschen eine Beschwerde bei Riot oder auch hier im Forum, hilft dir nicht weiter, denn Riot interessiert das nicht und wenns nach den Leuten hier ginge sollten alle Menschen emotionslose Roboter sein. Das traurige ist, dass Leute die sich verteidigen teilweise genauso hart bestraft werden wie diejenigen die mit dem geflame angfangen. Und die wissen das und warten nur darauf dass du was zurückschreibst. Also tu dir n gefallen mute die Vögel und lass dich nicht von Ihnen tilten... ich weiß leichter gesagt als getan.\nIch habs geschafft, aber nur weil ich wieder besser geworden bin mit den andren Champs und nicht die ganze Zeit geflamt werde, aber auch weil ich öfters mal den Mutebutton drücke.\np.S. Meine Reportaufrufe nach dem Game haben mir noch keinerlei Banns seither eingebracht.\nUnd ich glaube nicht dass ein einzelner Report gleich viel bringt wie mehrere. Vielleicht gleichviel wie der von 4 Premates. Aber generell kriegt man das häufig mit... dass sich jemand in nem game total daneben verhalten hat. 4-9 report kassiert und man paar stunden später gesagt bekommt dass eine Person bestraft wurde.","replies":[{"poster":"Honkidibonki","date":"2017-09-20T11:32:50.430+0000","up_votes":1,"down_votes":3,"body":"P.P.S. \n\nHumpelstilzche  &  legofreak1  waren damals auch von bei mir tätig looooooool. Was für trolls. Habt ihr überhaupt ein Leben, oder sucht ihr euch gezielt solche Posts aus um die Leute runterzumachen und euer Ego zu Pushen.\nAlter Verwalter... ihr seid schlimmer als die ganzen flamer dort drausen da ihr euch daran ergötzt andere Leute mit eurem ach so belehrendem Geschwätz zu Nerven. Oder vielleicht sogar, nur eine Theorie von mir, ein und die selbe Person weil es besser wirkt das ganze mit zwei \"Characteren\" anzustacheln?\nSirrkas noch so einen von diesen Leuten gefunden ;-) Ihr scheint ja echt Spaß zu haben hier!","replies":[{"poster":"Qbert","date":"2017-09-20T11:39:19.219+0000","up_votes":2,"down_votes":0,"body":"Wow, du bist ja ein ganz cleveres Kerlchen!\nSchmeißt hier erst einmal mit Beleidigungen um dich ohne vielleicht mal 1cm weiter als bis zur Stirn zu denken.\n\nVielleicht ist dir aufgefallen das Humpel und Sirrkas grün sind, und Lego orange ist, statt des normalen Braun-Tons?\nDas ist so, weil sie freiwillige Rollen innerhalb des Forums für Riot übernehmen. Sie stehen mit Rat und Tat zur Seite und wollen hier niemanden verunglimpfen.\nWas du hier abziehst unterstreicht nur, dass dein Bann gerechtfertigt war. Du kannst dich nicht ein bisschen sachlich äußern, eine Debatte ist völlig sinnlos bei dir.\n\nBitte, überdenke doch einfach mal kurz das was du schreibst, bevor du es abschickst.\nIst ja schlimm.\n\nUnd nun warte ich auf niveaulosen Flame deinerseits.","replies":[{"poster":"Honkidibonki","date":"2017-09-20T13:14:39.811+0000","up_votes":1,"down_votes":2,"body":"Nein nein ich habe schon alles gesagt was ich wollte... schönnen Tag noch :-)\nWobei ... \" Sie übernehmen freiwillig Rollen innerhalb des Forums für Riot\" ... alles klar ... bin kein Experte im Forum war mein zweiter Post hier^^\nUnd dass sie freiwillig andere Leute \"Belehren\" machts nicht besser","replies":[{"poster":"Qbert","date":"2017-09-20T13:19:00.492+0000","up_votes":1,"down_votes":0,"body":"Unwissenheit schützt vor Strafe nicht.\nZum Thema \"Belehren\", kann man sagen was man möchte. Man muss es ja nicht mögen, aber letztendlich wissen sie, wovon sie reden. Wenn sie dir den Hinweis geben, was als flame gilt und was nicht, dann hat das schon seine Richtigkeit und man sollte sich das zu Herzen nehmen.\nSie belehren dich nicht um sich besser zu fühlen, sondern eher um dir eine Richtung zu geben, mit der du weiter Lol spielen kannst ohne eben einen Bann oder was auch immer befürchten zu müssen.","replies":[{"poster":"Honkidibonki","date":"2017-09-20T15:27:44.776+0000","up_votes":1,"down_votes":0,"body":"Ach ja btw hab noch nen alten Bekannten gefunden ... \nWaldschrat86 (EUW)\nDiesmal mit ganz normaler  \"Brauner Farbe\"","replies":[{"poster":"Waldschrat86","date":"2017-09-20T17:22:02.961+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Honkidibonki,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=001300010000000000000000,timestamp=2017-09-20T15:27:44.776+0000)\n>\n> Ach ja btw hab noch nen alten Bekannten gefunden ... \n> Waldschrat86 (EUW)\n> Diesmal mit ganz normaler  &quot;Brauner Farbe&quot;\n\nWar noch nie anders...\n\nBtw hat Sirrkas nicht wahlos irgendwas rausgepickt und selbst wenn, hat er den Link zu deinem alten Thread eingefügt.\nGrad mal drauf gegagangen und mir nochmal das angeblich nur am Ende zum report-Aufruf-Game gegeben.\nNaja, kann sich jeder sein Bild machen, ich tat's vor nem Jahr...","replies":[{"poster":"Honkidibonki","date":"2017-09-20T21:55:19.333+0000","up_votes":1,"down_votes":1,"body":"Nicht wahllos sondern gezielt aber zusammenhanglos ;-)\nUnd teilweise mit falschaussagen bestückt.\nUnd ja kann sich jeder sein eigenes Bild zu machen ... aber beenden wir das hier ... geht hier ja nicht um mich sondern um das was \"Chubby Teddy\" hier gepostet hat.","replies":[{"poster":"Sirrkas","date":"2017-09-20T22:42:35.568+0000","up_votes":1,"down_votes":0,"body":"Jetzt wüsste ich aber gerne, was die Falschaussagen sein sollen. Wenn du mit Zusammenhang meinst, dass du geflamt wurdest, das interessiert weder mich, noch das Reportsystem. Schon im Tribunal ging ich nur danach, was der Spieler schreibt, nicht warum. Schreibt er \"noob\" klick ich auf den Punishbutton. Egal ob der andere ihm Cancer gewünscht hat oder nur Hallo sagen wollte. ","replies":[{"poster":"Honkidibonki","date":"2017-09-21T13:07:23.026+0000","up_votes":1,"down_votes":0,"body":"Eig. wollte ich das jetzt ja closen aber du möchtest ja sicher eine Antwort so wie ich halt auch Antworten erwarte.\nEin Beispiel was ich mit Falschaussage meine:\n \"   Honkidibonki: are u kidding me\n    Honkidibonki: haha\n    Honkidibonki: u could have coutnerganked top at least once\n    Honkidibonki: stfu idioto\n\nMachst dich über wen lustig und beleidigst. \"\nDu sucht dir gezielt die schlimmsten Stellen des Chats heraus und schreibst dann hier unter meinen Chatverlauf quasi eine interpreation des geschehens. \nDie so absolut  nicht an das herankommt wie es wirklich ablief. \nich gebe eine andere Interpremation wenn wir schon am interpretieren sind^^\n\"Fragt sich ob die andere Person das wirklich ernst meint, weißt darauf hin dass wenn man sich darüber beschwert dass man ständig stirbt wenn man gedived wird, auch doch mal ein Countergank hilfreich gewesen wäre und bittet in dem Falle schon unhöflich (das stfu hätte ich nicht verwenden sollen) darum dass der andere doch nicht Humbug in den allchat schreiben solle.\"\nDu kannst natürlich das ganze nicht so interpretieren wie ich da dir dein backgroundwissen dazu fehlt, allerdings hatte ich das auch in meinem post erwähnt was die andren dazu schrieben.\nDoch versucht du ebenfalls mit Interpretation das ganze möglichst schlecht darstehen zu lassen.\nUnd wie ich ja mitlerweile weiß ist es irrelevant was die anderen dazu geschrieben haben.\nWell thanks god dass es wieder soloq/duq gibt... da verbünden sich nicht mehr die 4 premates von dynamicq um den einzelnen fertig zu machen.\n\nInsofern habe ich ja nebst dem muten durchaus was von euch mitgenommen wie das ganze wie gesagt gehandhabt wird. (Nochwas mitgenommen: Report aufrufe nach dem game können ebenfalls zum ban führen... mache ich auch nur sehr sehr selten in extrem fällen, deswegen gab es wohl noch keine weiteren Strafen). Wobei das nicht bedeutet dass wir einer Meinung sein müssen. Ob das System so gerechtfertigt is oder nicht darüber liese sich wohl streiten. Aber kein System ist perfekt.\n(Und ich schreibe dies hier nun in der Annahme dass ihr ernsthaft versucht anderen weiterzuhelfen, denn alles andere wäre wirklich traurig. Ich würde mich also freuen wenn etwas von dem ich hier schreibe von euch aufgenommen würde. Denn ich bin sicherlich nicht der einzige der so denkt. Wir wollen doch alle eine bessere Gemeinschaft und ihr macht einen freiwilligen Job hier der gerade dafür sorgen soll, oder nicht?)\nAlso was mich an eurer Art und Weiße stört (wie ihr gemerkt habt bin ich hier euch gegenüber mit einer gewissen negativen Einstellung verbunden gewesen) ist die Tatsache dass ihr von oben herab mit den Leuten redet wie ein Ankläger mit einem Angeklagten. Aber warum erstellt man aber einen Threat? Ja um zustimmung zu erhalten und nicht blöd angequatscht zu werden. (Auch wenn man manchmal im nachhinein bemerkt, ja man hat sich in der Tat aus der Emotion heraus in diesem Spiel falsch verhalten. Und es gibt gewisse Regeln, mit denen man nicht einverstanden sein muss aber die Riot auferlegt hat, und die es einzuhalten gilt. Und wie ich bereits einige male sagte ist deswegen für mich die einzige Lösung, da ich auf gewisses geflame durchaus verärgert reagieren kann, die anderen zu muten. Hat mir am meisten geholfen und würde ich \"Chubby Teddy\" wirklich auch nahe legen,... nicht nur schreiben sondern auch tun. ) Man sollte dieser Person, psychologisch gesehen, die solche Posts meist schon in einer recht negativen Stimmung veröffentlichte nicht noch von oben herab erniedrigen, sondern versuchen die positiven als auch die negativen Aspekte gleichermaßen zu beleuchten. Denn du musst eines bedenken, wenn jeder der 4-5 Leute die hier freiwillig ihren Dienst verrrichten gezielt negative Sachen heraussuchen, und sich nicht versuchen in die andere Person hineinzuversetzen, so führt das in einigen Fällen zu einer gewissen Abwehrhaltung. Man will nicht einsehen was diese \"unhöfliche Person\" auf der anderen Seite \"von der ich nicht weiß wer sie ist was sie tut, ich kenne nicht ihren Bildungsgrad noch ihr Alter etc.\"  einem versucht beizubringen oder zu erklären. Ich möchte nur darauf hinweißen dass man Kritik positiver verpacken kann, ich mit kein Experte auf diesem Thema, aber generell in einer Diskussion auf Aspekte einzugehen die gut sind und nicht immer nur wirklich zu versuchen alles negative herauszufischen, hat defnitiv eine größere Chance erfolgreich zu sein. Denn immerhin handelt es sich hier nicht um \"Ladendiebe\" und \" Mörder\" wie von \"Legofreak\" oben als Vergleich benutzt, sondern um des Rechts durchaus bemühte Staatsbürger. Dies führt dann zu einem besseren Gespräch, das sich nicht anfühlt wie \"alle gegen einen \" und \"Wer das letzte Wort hat, hat gewonnen\", sondern zu einem Gespräch bei dem man dem anderen auf GLEICHER EBENE begegnet, bei dem ihr der anderen Person dann auch etwas mitgeben könnt, das er gerne annimmt. Denn ich weiß nicht warum ihr hier eure Tätigkeit betreibt, aber wenn ihr den Threaterstellern hier wirklich helfen wollt, dann sollte dies nicht auf Basis eines Prinzips des \"Angkläger und des Angeklagten \" geschehen. Ich weiß ist sicher nicht so einfach und wahrscheinlich hat keiner von euch eine psychologische Ausbildung hinter sich. Aber ihr wollt den Leuten helfen und wollt dass das was ihr sagt bei den Leuten aufgenommen wird. \nIch hoffe dass meine offene und ehrliche Kritik bei euch nicht so negativ rüberkommt wie eure an mir ;-)","replies":[{"poster":"Sirrkas","date":"2017-09-21T15:29:09.986+0000","up_votes":1,"down_votes":0,"body":">Du sucht dir gezielt die schlimmsten Stellen des Chats heraus und schreibst dann hier unter meinen Chatverlauf quasi eine interpreation des geschehens.\nDie so absolut nicht an das herankommt wie es wirklich ablief.\n\n\nDer Kommentar von dir, macht das mit dem lustig machen nicht besser und ich wüsste auch nicht, wo das meine Interpretation widerlegt. \n\n>fizz saying its your own fault I should just paly safe at turret and farm... which I tried to... but is hard when u get dived every time and killed cause u so far behind vs ekko and zac\n\nDer Teil von Fizz, dass es deine eigene Schuld ist, wenn du stirbst stimmt doch. Ob es einfach ist, aus einem Rückstand aufzuholen und ob sein Kommentar hilfreich war, steht auf einem anderen Blatt. Am Ende lachst du aber über seinen Kommentar, deshalb schrieb ich, du machst dich über ihn lustig.\n\n>well here is my \"stfu idiot combined with another explanation why... I was afk at start\" after tf says again sth like its my own fault cause I was afk and I shoudl stop feed\n\nAuch wenn TF gemein zu dir war, gibt dir das nicht das Recht, ihn Blödmann zu nennen. \n\nFalschaussage kann ich hier deshalb nicht nachvollziehen. \n\n>Du kannst natürlich das ganze nicht so interpretieren wie ich da dir dein backgroundwissen dazu fehlt, allerdings hatte ich das auch in meinem post erwähnt was die andren dazu schrieben.\n\nDeine Kommentare ändern aber nichts an dem, was du geschrieben hast. Es juckt weder mich, noch das System, ob du \"stfu idiot\" schreibst, weil jemand nett war und versucht dir zu helfen oder dich geflamt hat. Du hast beleidigt. Ende. \n\n>Wobei das nicht bedeutet dass wir einer Meinung sein müssen. Ob das System so gerechtfertigt is oder nicht darüber liese sich wohl streiten. Aber kein System ist perfekt.\n\nDas Problem ist, wenn man jetzt dein \"Idiot\" an TF als nicht strafbar ansieht, weil du einen Grund dafür hattest. Dürfte man am Ende niemanden dafür bestrafen. Du hast das geschrieben weil er dich mit dem Chat genervt und gereizt hat. Wenn der TF dir in der Situation \"idiot\" an den Kopf wirft, hat er aber auch einen Grund gehabt. Du hast dein Spiel durch Fehlzeit gestört und weil du gestorben bist. Das ist kein guter Grund und keine Entschuldigung dafür, sollte er dich Idiot nennen, aber ein Grund. \n\nWenn man das auf die Spitze treibt, dürfte jeder absolut alles sagen, ohne bestraft zu werden. Gründe kann man immer finden. Das eigene Team hat einen Champion der ihm nicht passt. Toplane hat nicht miss gepingt, Jungler war nicht bei Minute 2 Botlane. Mitte steht noch nicht 12/0/5 bei Minute 10 etc. Die müssen nicht mal sinnvoll sein, aber das wären andere Gründe dafür, Idiot ans Team zu schreiben.\n\nAber ja, das System ist nicht perfekt. Es macht aber was es soll. Es kann darin noch besser werden. \n\n\n> ist die Tatsache dass ihr von oben herab mit den Leuten redet wie ein Ankläger mit einem Angeklagten.\n\nMein Ton hängt nun mal auch davon ab, wie der Beitrag aussieht, auf den ich antworte. Wenn ich auf etwas eingehe, bei dem jemand behauptet, er wäre unschuldig und die Strafe ungerecht, endet das eben darin, dass ich daran zweifle, bis mir das belegt wurde. So etwas gab es hier schon viel zu oft. Gebannte regen sich über den ungerechtfertigten Bann auf, sobald der Chatlog vorhanden ist, sieht man aber, dass da nichts ungerecht ist. \n\nWenn jemand fragt, was genau an dem Chatlog falsch war, sind die Antworten im Forum darauf auch viel freundlicher. Dann hat der Threadersteller schon gezeigt, er will sich bessern und will, das man ihm hilft. Fängt der TE aber damit an, über das Reportsystem zu hetzen, sollte er sich darauf gefasst machen, auf kräftigen Gegenwind zu stoßen. \n\n> Denn du musst eines bedenken, wenn jeder der 4-5 Leute die hier freiwillig ihren Dienst verrrichten gezielt negative Sachen heraussuchen, und sich nicht versuchen in die andere Person hineinzuversetzen, so führt das in einigen Fällen zu einer gewissen Abwehrhaltung. \n\nSowas habe ich auch schon oft versucht. Leider hatte das bisher, nach meiner Erinnerung, keinen anderen Effekt. \n\nDa startet man dann zum Beispiel damit, dass man versteht, der Bann ist nervig und dass die anderen schlimm waren. Sobald man aber erklären will, was am Chatlog vom TE ebenfalls nicht gepasst hat, kommt trotzdem die Abwehrstellung. Du kannst dir nicht vorstellen, wie oft man hier schon lesen durfte \"die anderen waren aber viel schlimmer\" \"der hat aber angefangen\". Der Gebannte muss zumindest ein wenig Einsicht zeigen, wenn er will, das man ihm hilft. Das bringen aber leider die wenigsten mit. \n\nIch kann gerne versuchen bei den TEs etwas freundlicher zu werden. Aktuell müsste ich meine Posts durchsuchen, wenn du sehen willst, wie ich normalerweise auf einen TE reagiere, der seinen Bann nicht versteht. \n\nDich nahm ich hier aber anders wahr, weil du kein Thema zu deiner Strafe erstellt hast, sondern aus meinen Augen eher hier rein kommst und einfach nur gegen das System gewettert hast. Woran das Wiederentdecken deiner Chatlogs nichts gebessert hat. \n\nAber wenn du magst, kannst du mir ja sagen, wie du meinen ersten Beitrag hier einschätzt, der an den TE ging:\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/TXPYiEBP-14-tage-sperre?comment=000b\n\n>Ich weiß ist sicher nicht so einfach und wahrscheinlich hat keiner von euch eine psychologische Ausbildung hinter sich.\n\nHumpel studiert auf dem Gebiet. Aber ich persönlich habe da bisher nie wirklich groß etwas damit zu tun gehabt.","replies":[{"poster":"Honkidibonki","date":"2017-09-21T18:41:48.671+0000","up_votes":1,"down_votes":0,"body":"Du hast recht dass ich hier herein kam und durchaus meinen Unmut an dem System klar gemacht habe, denn auch der Threatleiter scheint nicht ganz damit zufrieden zu sein dass letztenendes Leute die zuerst flamen gleich behandelt werden, wie jene die emotional und möglicherweise auch flasch reagieren. Das war auch der Grund dafür dass ich meine Story miterzählt habe, damit er sieht es sind auch Leute hier drinne die das ähnlich sehen wie er. Ich wollte also zeigen auch andere hatten schon mit diesen Problemen zu tun und kommen jetzt trotzdem besser damit zurecht. Indem wie ich bestimmt zickmalerwähnt habe wirklich häufiger mal den mute button drucke bevor ich getiltet werde. Das ist meiner Meinung nach die einzige Lösung für Leute wie uns die selber generell keinen Streit ingame anfangen wollen und von sich aus andere nicht provozieren. Es sollte also eine Hilfestellung mit nem Seitenstich an das System sein. Das sollte wohl noch erlaubt sein oder? \n\nIch habe mir deinen Text durchgelesen, und du versucht das ganze neutral rüberzubringen, wobei du immer das ganze sehr kritisch betrachtest, vermutlich weil du schon deine Erfahrungen gemacht hast.\n\"Wenn du wirklich glaubst, du hast die Strafe nicht verdient, noch keine 2 CRs gehabt und weißt, dass du nichts verschweigst und auch nicht in Pre- und Aftergamechat toxisch warst, kannst du dich an den Support wenden.\"\nIch versuche das jetzt freundlicher zu formulieren\n\"So wie ich das sehe ist die Strafe in dem Maßen nicht gerechtfertigt. Allerdings greift eine solche Strafe meist erst zu wenn du bereits vorher mit chatrestrictions verwarnt wurdest. Und wenn du auch im Pre und Afterchat keinerlei toxische Bemerkungen hinterlassen hast kannst du dich ja mal an den Support wenden.\" \nKlingt weniger kritisch wie \" wenn du wirklich glaubst\".\n\nDu kannst dir nicht vorstellen, wie oft man hier schon lesen durfte \"die anderen waren aber viel schlimmer\" \"der hat aber angefangen\".\nDann mach ihnen auf freundliche Art und Weiße klar dass jeder gerne seine eigene Meinung haben kann, du nicht die Regeln aufstellst und letzten Endes die Leute damit klarkommen müssen auch wenn sie nicht der gleichen Meinung sind (wie bei mir).\n\n\"Humpel studiert auf dem Gebiet. Aber ich persönlich habe da bisher nie wirklich groß etwas damit zu tun gehabt.\"\nNa das ist doch schonmal positiv\n\n\"Mein Ton hängt nun mal auch davon ab, wie der Beitrag aussieht, auf den ich antworte. Wenn ich auf etwas eingehe, bei dem jemand behauptet, er wäre unschuldig und die Strafe ungerecht, endet das eben darin, dass ich daran zweifle, bis mir das belegt wurde.\"\nKann man durchaus machen ich finde trotzdem dass man versuchen sollte einen netteren Ton anzuschlagen auch wenn man den nicht immer so zurück bekommt. Weil wie schon gesagt die meisten Leute die so einen Threat erstellen und bereits recht genervt über die Strafe sind. Das führt zumindest im Verlauf des Gespräches denke ich mehr zum Erfolg... und das sollte ja nicht sein den schlagabtausch gewonnen zu haben, sondern das \"reformieren \" eines Spielers, oder wenn er Recht behalten sollte im dabei zu helfen seinen Bann zu entschärfen.\n\nIch lass die comments zu meinem Spiel jetzt mal außen vor bzw. möchte mich nur einem widmen, bei dem ich dir absolut nicht recht geben kann!!! \n\n\"Der Teil von Fizz, dass es deine eigene Schuld ist, wenn du stirbst stimmt doch. Ob es einfach ist, aus einem Rückstand aufzuholen und ob sein Kommentar hilfreich war, steht auf einem anderen Blatt.\"\nAlso hör mal ich hätte in dem Moment afk in der Base stehen können, dann wäre ich nicht gestorben. Man kennt das ja man kommt zu spät ins game wegen bagsplat etc. jeder hate wsowas mal oder fast jeder. Und dann leb ich normalerweise nach dem Motto genauso wie bei dcten auch wenns nen ranked ist... lässt man den lvl 1 er in Ruhe und dived ihn nicht mit nem ekko und zac lvl 6... da kannst du nichts tun :-). Das ist nicht deine Schuld auch nicht die der andren, wobei die am ehesten dir dann noch bestehen sollten anstat dich zu flamen, was wie du schön beschrieben hast \" Ob es einfach ist, aus einem Rückstand aufzuholen und ob sein Kommentar hilfreich war, steht auf einem anderen Blatt.\". \nUnd das wichtigste . \n\"Wenn der TF dir in der Situation \"idiot\" an den Kopf wirft, hat er aber auch einen Grund gehabt. Du hast dein Spiel durch Fehlzeit gestört und weil du gestorben bist.\" \nNein, das ist kein grund einen zu beleidigen auf gar keinen fall, und nicht ich habe das Spiel mit Fehlzeit gestört, sondern mein pc, der riot server etc, whoever knows, ich konnte mich nicht nach bugsplat einloggen was ich auch geschrieben habe. Und wenn man jedem der stirbt das Wort \"Idiot\" an den Kopf wirft, na dann gute Nacht.\nUnd ich denke das siehst du ja genauso. Hoffentlich, weil sonst zweifle ich definitiv noch mehr am System hier.","replies":[{"poster":"Honkidibonki","date":"2017-09-21T20:21:56.094+0000","up_votes":1,"down_votes":0,"body":"Btw. das ist ne interessensfrage meinerseits. Damit ich weiß in wie weit man bestraft werden kann.\nWas wenn dich jemand zuflamt und du darauf am Ende des Spiels schreibst:\n\"I guess I have to report SOMEBODY\" , damit greift man den Spieler ja nicht direkt an und es dürfte damit kein Grund für eine Chatrestriction geben oder? Oder sehe ich das falsch?\nOder wie im letzten spiel wenn jemand im /all chat schreibt \" report this useless kayle\" (war nicht ich mit gemeint ;-) sonder der jgler im gegnerischen team) und man antwortet mit /all \" i guess i have to report someone else\"?","replies":[{"poster":"Honkidibonki","date":"2017-09-22T11:53:49.030+0000","up_votes":1,"down_votes":0,"body":"Alles klar danke für deine Antworten wünsche dir noch nen schönen Tag\nPeace und sign out an dieser Stelle","replies":[]},{"poster":"Sirrkas","date":"2017-09-21T21:05:00.349+0000","up_votes":1,"down_votes":0,"body":"Bei solchen schnippischen Kommentaren ist das immer schwierig. Wie schon gesagt. Ich habe noch nie gesehen, dass jemand alleine für eine Reportaufforderung oder auch Ankündigung bestraft wurde. Deswegen würde ich aktuell eher davon ausgehen (wichtig, meine eigene Meinung, ich kann das nicht mit Sicherheit sagen), dass man dafür nicht bestraft wird. \n\nIch würde aber dennoch eher davon abraten, so etwas zu schreiben. Das kann jetzt übervorsichtig sein. Allerdings muss man im Hinterkopf behalten, dass das System selbstständig lernt. Es kann also sein, dass Heute, in EUW, das völlig in Ordnung wäre. In einem halben Jahr aber zu einer Strafe führt. \n\nEs gibt leider (oder zum Glück) keine öffentliche Liste, was aktuell zu einer Strafe führen kann, die müsste dann auch ständig up to date gehalten werden, sonst veraltet die schnell. Wenn es Riotintern eine geben sollte, habe ich natürlich keinen Zugriff darauf.\n\nAls Grundsatz kann man nehmen \"sei kein Arsch\" und \"Was du nicht willst, das man dir tut, das füg auch keinem Andern zu.\"\n\nAuf der anderen Seite gab es mal einen Riotkommentar (Quelle habe ich gerade keine), bei dem es hieß, ein wenig den Gegner im Chat zu ärgern ginge in Ordnung. Ich stelle mir darunter dann sowas wie \"ty for the dragon/rescue\" vor. ","replies":[]}]},{"poster":"Sirrkas","date":"2017-09-21T21:21:07.555+0000","up_votes":1,"down_votes":0,"body":"Ja, die Formulierung ist besser. Ich werde versuchen das etwas besser in Zukunft zu gestalten. \n\nDas mit dem hypothetischen \"Idiot\" von TF an den Spieler der gerade zurück ins Spiel kam und starb ist kein Grund, jemanden zu beleidigen.  Das ist mir auch bewusst und ich wollte damit zeigen, dass wenn man anfängt zu sagen, \"Idiot\" war in dem Fall in Ordnung, dann kann man schwer eine Grenze ziehen, ab wann genau es ok ist und wann nicht mehr.\n\nEigentlich gibt es im Spiel keinen Grund jemanden zu beleidigen.","replies":[{"poster":"Honkidibonki","date":"2017-09-22T11:52:54.839+0000","up_votes":1,"down_votes":0,"body":"Ok freut mich :-)","replies":[]}]}]}]},{"poster":"Honkidibonki","date":"2017-09-21T13:07:50.898+0000","up_votes":1,"down_votes":0,"body":"P.S. danke für die Zeit die du dir nimmst das hier durchzulesen xD","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Sirrkas","date":"2017-09-20T11:10:44.950+0000","up_votes":2,"down_votes":0,"body":">Mir wurden dort auch 2 Chatverläufe gepostet bei denen ich mich zumindest laut Riot und dieser Community hier falsch verhalten habe. Bei dem ersten wurde ich zugeflamt weil ich mich aus irgendwelchen Gründen nicht einloggen konnte ( war noch vor der 3 minuten Regel) zu spät ins spiel kam. Und dann paarmmal gedived wurde von top+jgl... (welcome to fairplay)... einige male starb und leider keine Hilfe bekam. Beim zweiten wurde ich von einem Tresh reportet der von anfang an geflamt hat und dann später getrollt hat... sich mit absicht am turret des gegners killen lies. In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\n\nAuch Reportaufrufe gelten als toxisch. Allerdings habe ich noch nie gesehen, dass jemand wirklich nur für ein einzelnes \"Report XY\" bestraft wurde. Hast du die Chatlogs dazu noch? Ansonsten gilt auch hier. Wenn die anderen Fehlverhalten zeigen, gibt das dir nicht automatisch das Recht ebenfalls Fehlverhalten zu zeigen.\n\n\n>Wie du also siehst besteht hier eine Ähnlichkeit.\nMeine Erfahrung sagt mir gerade wenn du häufig neue Sachen ausprobierst und nicht immer die besten Spiele hast wird in der LoL-Community gerne mal reportet. \n\nDas kann durchaus sein. Ist allerdings egal. Die Reports lösen immer nur eine Untersuchung aus, hat man kein Fehlverhalten gezeigt, gibt es keine Strafe. \n\n>wenn überhaupt, mach sowas nach dem Spiel, denn auch wenn, report aufrufe am Ende des Spiels, kurz bevor der Nexus fällt, nicht mehr das Spiel beeinflussen können. Soweit reicht der Horrizont mancher Leute nunmal nicht, wenn sie sich den Chatverlauf durchlesen.\n\nTja, da muss ich dich enttäuschen. Auch für den Aftergamechat kann man noch gemeldet und bestraft werden. Es ist auch egal, ob du 5 Sekunden vor Schluss, 5 Sekunden nach Spielstart oder 5 Minuten nach Spielende negativ auffällst. Dafür kann man dann bestraft werden. \n\n>Was deine Beschwerde bei Riot anbelangt, da muss ich dich leider enttäuschen eine Beschwerde bei Riot oder auch hier im Forum, hilft dir nicht weiter, denn Riot interessiert das nicht und wenns nach den Leuten hier ginge sollten alle Menschen emotionslose Roboter sein. \n\nEin Ticket zu einem Fall kann durchaus etwas bewirken. Allerdings nur dann, wenn die Strafe unangebracht ist. Niemand wird entbannt, wenn er sich falsch verhalten hat und die Strafe gerechtfertigt ist. Mit etwas Glück hat das System etwas überbewertet und das wird dann auf eine CR reduziert. \n\nZudem muss auch niemand völlig emotionslos sein. Wenn man will kann man gerne im TS über den Random meckern, den Bildschirm anschreien und fluchen. Das juckt keinen, außer vielleicht die Leute im TS. Dafür kriegt man aber dann keine Strafe. \n\n> Das traurige ist, dass Leute die sich verteidigen teilweise genauso hart bestraft werden wie diejenigen die mit dem geflame angfangen. \n\nAuge um Auge ist hier nunmal nicht.\n\n>p.S. Meine Reportaufrufe nach dem Game haben mir noch keinerlei Banns seither eingebracht.\n\n~~Die Nachricht kriegt man nicht immer und man kriegt auch keine bei CRs. ~~ Nachtrag: Das scheint ja ein weitere Beleg dafür zu sein, dass du davor geflunkert hast, siehe Edit am Ende.\n\n>Und ich glaube nicht dass ein einzelner Report gleich viel bringt wie mehrere\n\nIst aber so, auch wenn du das nicht glaubst. \n\n>Aber generell kriegt man das häufig mit... dass sich jemand in nem game total daneben verhalten hat. 4-9 report kassiert und man paar stunden später gesagt bekommt dass eine Person bestraft wurde.\n\nWas jetzt? Kriegst du die Meldungen, dass wer bestraft wurde oder nicht?\n\n**Edit**: Ich habe eben deine Chatlogs gefunden. Fängt [hier ](https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/Id0fXgej-riot-pls-check-the-background-of-the-reports-more-siriously?comment=0005)an. \n\nDas war deutlich mehr als Reportcalling. \n\n>Honkidibonki: u fialed your jump\nHonkidibonki: I saw it\n\nBlame\n\n>Honkidibonki: they camp me\nHonkidibonki: and fizz\nHonkidibonki: dping nothing\n\nBlame\n\n>Honkidibonki: are u kidding me\nHonkidibonki: haha\nHonkidibonki: u could have coutnerganked top at least once\nHonkidibonki: stfu idioto\n\nMachst dich über wen lustig und beleidigst. \n\n>Honkidibonki: are u stupid\nHonkidibonki: I tried to sruvive\nHonkidibonki: I report u for not ebing able to read and shittlak\n\nBeleidigung und Blame im Reportcall\n\n>Honkidibonki: fien report me I'm afk\n\nDrohung afk zu gehen.\n\nIch schätze mal das reicht um zu belegen, dass\n\n>In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\n\nalles andere als der Realität entspricht. ","replies":[{"poster":"Honkidibonki","date":"2017-09-20T14:34:10.452+0000","up_votes":1,"down_votes":0,"body":"ok ich habe mir das durchgelesen und wie gesagt es handelte sich um 2 Spiele du hast total contentlos ein paar sachen herausgepickt und kannst nicht einmal differenzieren dass ich mit \"In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\" das zweite Spiel das mir riot gepostet hat mit dem thresh der geflamt und getrollt hat gemeint hatte. \nDie Art und Weiße wie ihr \"Riotforumhelfer\" eure Belehrungen angeht ist wie bei manchen Interviews, in denen ein Interview geführt wird nur um dann die Sätze und den Content komplett zu verdrehen um damit den Interviewten möglichst schlecht dastehen zu lassen.\nUnd mir war bewusst dass das passieren würde, wenn ich so etwas hier hinein poste, aber du scheinst deinen freiwilligen Job ja gerne zu machen um Leuten zu \"Helfen\" ;-)\nIch möchte hier jedoch nicht alte Kamellen aufwärmen und es war wohl etwas kindisch von mir dich zu provozieren. \nIch bin nur auf diesen Post gestoßen der meinem von damals ähnelte und wollte dem guten \"Chubby Teddy\" hier meine Erfahrung übermitteln wie das so gehandhabt wird, und da wie oben beschrieben oder von dir auch geantwortet nach dem Prinzip geht\"es ist mir egal ob dich 3 oder 4 Premates erst grundlos zugeflamt haben wenn du antwortest bist du der dumme\" gibt es wohl nur eine Lösung, die das spielen auch entspannter macht und das ist das muten. Traurig aber wahr. ","replies":[{"poster":"Sirrkas","date":"2017-09-20T22:25:53.848+0000","up_votes":1,"down_votes":0,"body":">ok ich habe mir das durchgelesen und wie gesagt es handelte sich um 2 Spiele du hast total contentlos ein paar sachen herausgepickt und kannst nicht einmal differenzieren dass ich mit \"In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\" das zweite Spiel das mir riot gepostet hat mit dem thresh der geflamt und getrollt hat gemeint hatte.\n\nIch kann sehr wohl differenzieren. Allerdings macht das hier keinen Sinn. Du bist für den Fall bestraft worden. Nicht nur für eines der beiden Spiele. Was contentlos bedeuten soll, musst du noch erläutern. Deine Stellungnahme ist aber nichts, was es dir erlaubt, selbst toxisch zu werden. \n\nWobei der Teil mit \n\n>In diesem Spiel rief ich lediglich am Ende des Spiels, wie ich bei dir zu einem report auf.\n\nSchonmal nicht stimmt. Zum einen waren das 2 Reportaufrufe, zum anderen kann das nicht am Spielende gewesen sein, wenn du noch Drake ansagst. Ob man dein Vorhalten seiner angeblich schlechten Einstellung als negativ sehen kann, steht dann auch noch zur Debatte. \n\n>Die Art und Weiße wie ihr \"Riotforumhelfer\" eure Belehrungen angeht ist wie bei manchen Interviews, in denen ein Interview geführt wird nur um dann die Sätze und den Content komplett zu verdrehen um damit den Interviewten möglichst schlecht dastehen zu lassen.\n\nSchließe bitte nicht von deiner Vorgehensweise auf andere. Du bist hier derjenige, der es so aussehen lassen will, als wärst du für einen einzigen Reportaufruf bestraft worden. Was hier nicht der Fall ist. \n\nIch gebe zu, dass ich beim erstellen des Beitrags wohl vergessen habe, dass du damit nur das zweite Spiel gemeint hast. Der Kontext der sich aber aus deinem Beitrag ergibt ist, dass du 2 Chatlogs erhalten hast, in einem einen einzigen Reportaufruf gemacht hast und dafür bestraft wurdest. Das entspricht nicht der Wahrheit. \n\n>Ich habe vor ca 1,5 Jahren einen Chatbann erhalten wegen \"unangemessenem Verhalten?... \". Zu jener Zeit wurde ich häufig grundlos reportet. \n\nAuch dieser Teil zielt von dir wieder darauf ab, dich als unschuldig darzustellen. Das bist du aber nicht. Vielleicht wurdest du ungerechtfertigt gemeldet, als du neue Champs gespielt hast. Die CR war aber berechtigt. Also behaupte nicht, du hättest die nicht verdient gehabt. \n\n>Und mir war bewusst dass das passieren würde, wenn ich so etwas hier hinein poste, aber du scheinst deinen freiwilligen Job ja gerne zu machen um Leuten zu \"Helfen\" ;-)\n\nJa, ich bin gerne hier. Die Wahrheit über das Reportsystem zu verbreiten ist mir nun mal wichtig. Dazu gehört eben auch, Posts wie deinen anzugehen, bei denen offensichtlich Fehlinformationen verbreitet werden. Selbst wenn du davon nicht überzeugt wirst, kann ich so zumindest mein bestes geben, dass andere nicht solchen falschen Behauptungen zum Opfer fallen. \n\nWenn ich das nämlich einfach so stehen lasse und jemand kommt hier her und liest das und sieht darunter nicht sofort etwas das dagegen spricht, hält der das vielleicht für die Wahrheit. Und das möchte ich eben verhindern. \n\n>Ich bin nur auf diesen Post gestoßen der meinem von damals ähnelte und wollte dem guten \"Chubby Teddy\" hier meine Erfahrung übermitteln wie das so gehandhabt wird, und da wie oben beschrieben oder von dir auch geantwortet nach dem Prinzip geht\"es ist mir egal ob dich 3 oder 4 Premates erst grundlos zugeflamt haben wenn du antwortest bist du der dumme\" gibt es wohl nur eine Lösung, die das spielen auch entspannter macht und das ist das muten. Traurig aber wahr.\n\nDann hättest du deinen alten Post nicht erwähnen sollen und ihm einfach nur den Tipp geben können. Dagegen kann man schlecht etwas sagen. Aber solche Behauptungen wie du sie aufgestellt hast, kann ich nicht guten Gewissens unkommentiert stehen lassen.","replies":[]}]}]}]},{"poster":"Durkheim ","date":"2017-09-19T22:58:25.939+0000","up_votes":2,"down_votes":0,"body":"{{champion:48}}","replies":[]},{"poster":"hshtagniemehrcdu","date":"2017-09-19T21:21:57.433+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chubby Teddy,realm=EUW,application-id=KYnfKGf0,discussion-id=TXPYiEBP,comment-id=,timestamp=2017-09-19T15:02:25.002+0000)\n>\n> Hallo, anbei der Banntext\n> \n> Spiel 1\n\n> Chubby Teddy: this crying in normal games\n> Chubby Teddy: you are 24/7 top j4 still 0/0 how about dat\n\n> Chubby Teddy: sorry dat they have a jungler and we meh\n> Chubby Teddy: u all dont care about me as well\n> Chubby Teddy: why should i care about u\n> Chubby Teddy: is ee\n> Chubby Teddy: u let mid fall\n> Chubby Teddy: ganked me when i was dead\n> Chubby Teddy: very much caring\n> Chubby Teddy: i mute u all this is getting way to childish cho if u wanna win carry it, u tilted me to much hf\n> Chubby Teddy: can u report riven and cho pls they flame me just bcs i try a new champ and im not good with it, ty\n> Chubby Teddy:  i didnt say anthing stop lying\n> Chubby Teddy: yeah right\n> Chubby Teddy: and they see riven lying\n> Chubby Teddy: if u want tryhard play rank\n> Chubby Teddy: dude\n> Chubby Teddy: bcs i get telled 24/7 &amp;#039;&amp;#039;nice ping&amp;#039;&amp;#039; you guys are tiling as hell what u expect from me\n> Chubby Teddy: u dont get it\n> Chubby Teddy: u take this game to serious maybe u should take a break from it\n\n> Chubby Teddy: im so happy i can u report u all after this\n\n> Chubby Teddy: u and cho being toxic\n\n> Chubby Teddy: u act like one cho\n> Chubby Teddy: with your c\n> Chubby Teddy: about losing\n> Chubby Teddy: a normal game\n> Chubby Teddy: ah so u also dont care good to know\n> Chubby Teddy: mate i dont wanna here the story of your life and im not here to make u feel good\n> \n> Wieso werde ich wegen sowas direkt 14 Tage gesperrt? Ich wurde in dem Spiel beleidigt ohne Ende und ich finde das was ich geschrieben habe ist nicht wirklich toxisch\n\nDer weitaus größte Teil deines Chatlogs besteht aus blamen.\n\"Wir haben keinen Jungler= Boah ist unser jungler shclecht/wir verlieren wegen des junglers\" etc.\nFast alles, was du schreibst, dient einzig und alleine dazu, deine Mates zu provozieren.\nIch gehe mal davon aus, dass du bereits eine 25er CR hattest.\nIn diesem Fall erhälst du den 14-Tage Bann, weil du dich kontinuierlich weigerst, mit dem flamen aufzuhören.\nWenn vorherige Strafen nicht wirken, wird das Strafmaß angezogen - und wer es nicht lernen will, der bekommt irgendwann einen 14-Tage Bann und dann einen Perma.","replies":[]},{"poster":"Rena","date":"2017-09-19T16:18:09.123+0000","up_votes":1,"down_votes":0,"body":"Diese Chatlogs verdienen meiner Meinung nach keines wegs einen 14 Tage ban. \nDa es Seasonende ist heisst das, dass du keine Rewards bekommen wirst.\nSchreib darum umbedingt den Riot Support an. Die Chance entbannt zu werden ist bei dir gross.","replies":[{"poster":"KéksRind","date":"2017-09-19T16:43:52.672+0000","up_votes":1,"down_votes":0,"body":"Was für \"die chance ist groß\" es spielt keine Rolle ob es season ende ist, hätte er sich benommen hätte er keinen bann und Riot wird auch niemanden entbannen, nur weil es season ende ist, wenn er sich nicht bnimmt hat er selbst schuld.","replies":[{"poster":"Rena","date":"2017-09-19T17:17:04.977+0000","up_votes":2,"down_votes":0,"body":"Ich will damit nur sagen, dass diese Chatlogs keinen 14 Tage ban verdienen meiner Meinung nach. Ich weiss jedoch nicht ob er sonst oft flamet, wenn ja ist das eine andere Sache. Ich sage er soll den Support kontaktieren **anhand der chatlogs**.","replies":[]}]}]},{"poster":"Sylvánas","date":"2017-09-19T16:59:30.872+0000","up_votes":1,"down_votes":0,"body":"Wenn du schon CRs davor hattest, ist es gerechtfertigt. Wenn das allerdings deine erste Strafe ist, finde ich das ein wenig hart. Er hat ja wirklich niemanden beleidigt, und nur wegen dem \"report xy\" direkt 2 Wochen gebannt zu werden hab ich auch noch nicht gesehen. An der Frequenz kanns eigentlich auch nicht liegen. Er war anfangs eig sogar recht freundlich (mit dem ty for holding, etc). Also wenn da noch keine CRs waren, würde ich gerne die Begründung vom Riot Support dazu hören.","replies":[]}]}