{"poster":"CMG Tsundere","date":"2015-02-05T19:27:32.996+0000","title":"DJ Sona (Neue zukünftige Beats ?)","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Eine Frage an alle die auch das Riot-Team interressieren dürfte: Es geht wie im Titel um DJ Sona. Wie währe es eigentlich, wenn man den Skin besitzt und man genug von der Musik hat und neue möchte ? Hier meine idee: Es könnten ja (unter erlaubnis) ja wie bei Skins Fanarts gemacht werden für DJ Sonas Musik wie: Remixes oder andere arten wie House oder so erstellt werden.^^ Ok ich bin zwar nicht jemand der sowas machen kann, aber das machen bestimmt viele als Hobby oder haben Erfahrung damit.\nAn Riot: Sollte dies irgendwie tumult anrichten von wegen: \"Warum mach ihr das nicht !?!?!,, oder euch vollspamen würde ich mir wünschen das diese Diskussion aufgelöst wird da ich euch keinen Stress bereiten möchte :D\n\nSchöne Grüsse^^ euer BooMKroatien / TsundereEvolved {{summoner:31}} {{item:2010}}","replies":[{"poster":"eingew","date":"2015-02-05T19:29:16.381+0000","up_votes":1,"down_votes":0,"body":"Ich würde sagen dazu würde es besser passen, wenn man im Allgemeinen für sich selbst Custom Musik in LoL einfügen könnte. Quasi eigene Playlists, die auch sonst im Hintergrund spielen. Riot kann ja einen einzelnen Ordner für Sona einbauen. Aber ich denke sonst gehört die Musik einfach zum Skin und sollte im Allgemeinen nicht erweitert/verändert werden.","replies":[{"poster":"CMG Tsundere","date":"2015-02-05T20:18:28.529+0000","up_votes":1,"down_votes":0,"body":"das problem bei der eigenen plalist währe ja das die musik in deinem ordner dann gestreamt werden müsste oder wie meinste das ?","replies":[{"poster":"eingew","date":"2015-02-05T20:21:48.442+0000","up_votes":1,"down_votes":0,"body":"Ich meine damit, dass die Musik in deinem Ordner nur für dich ist. Ein Stream wäre zu aufwändig und auch nicht angebracht.\n\nFür den Skin würde ich mir keine neue Musik wünschen, denn wie gesagt gehört die Musik, die jetzt schon bei dem Skin ist dazu... eine Änderung wäre für den Skin also nicht sinnvoll. Das wäre wie, wenn jetzt jemand eine neue Stimme für den Ultimate von Ezreal will, aber das wäre schließlich auch nicht wirklich sinnvoll, zumal der Ezreal Skin bereits seine eigene Stimme hat, genauso wie Sona nur ihre eigene Musik spielt :)","replies":[{"poster":"CMG Tsundere","date":"2015-02-05T20:31:56.081+0000","up_votes":1,"down_votes":0,"body":"Stimmt hast recht. Danke für dein Feedback ;)","replies":[]}]}]}]}]}