{"poster":"MewMewKittyCutie","date":"2016-02-03T05:48:18.347+0000","title":"La Historia del sup que quera ser mas ( por favor leean mi humilde historia mini libro  )","subforum":"Charlas Generales","up_votes":8,"down_votes":4,"body":"Bueno no se como empezar miren yo soy un main supp jugador frecuente de {{champion:40}} y {{champion:117}}  el 99% de mis partidas son de supp y dir&iacute;a 100% si no estuviera &uacute;ltimamente probando otras lineas la verdad no me gusta mucho ir full da&ntilde;o ... me canse de ir de sup con los adc de ahora que por tener thunderlor se creen dios que critican todo , despu&eacute;s siguen la kill y lo matan , flamea  , etc ( sobre todo las  {{champion:67}} son las mas cre&iacute;das se creen que tienen early  ) entonces quise saber que se siente tener da&ntilde;o no deve ser tan dificil digo yo pues me busque unos campeones que se ve&iacute;an op y con mi ahorros de pi me los compre {{champion:420}} {{champion:127}} {{champion:114}}  entre otros  \n\ny saben que fue lo que paso nunca me hab&iacute;a sentido tan desprotegido con tanto temor no hab&iacute;a ni un ward el jungla mataban a todos mis compa&ntilde;eros y no pod&iacute;a hacer nada me sent&iacute;a tan in&uacute;til  sent&iacute;a que no tenia rango  as&iacute; que jugu&eacute;  con {{champion:51}} y {{champion:21}}   porque {{champion:114}}  y {{champion:127}}  se me dificultaba mucho son demasiado dif&iacute;ciles no pod&iacute;a ni salir de torre savia que hab&iacute;a alguien ay afuera apenas salia de torre me gankeaban   bueno con cait y miss me fue bien tenia much&iacute;simas kill en faces de linea pero en tf me quedaba totalmente congelado no savia que hacer tenia miedo de dar un paso en falso y ser deleteado fue tan as&iacute; que terminaba abandonando las tf me sentia tan desprotegido sent&iacute;a que no tenia control del mapa no tenia control de la partida no tenia control de los objetivos . siendo adc creia que todos estaban contra mi tiraban todo para matarme todo quer&iacute;an saltarme en sima {{champion:107}}  todos quer&iacute;an ... mi oro \nademas cuando quer&iacute;a ir supp nadie me dec&iacute;a nada ni me trataba de quitar linea era tan f&aacute;cil nadie ademas del adc me flameaba \npero como cometas un error siento adc mid o top todos ... bueno lo explicare mejor de esta manera \n\n aunque paso de verdad \n\nYO : ( we quiero probar a liss es de hielo :3 uno de mis elementos favoritos ) avise a los de mi equipo en el chat que me ayudaran porque no savia mucho de los mids \n( me salio en contra de una {{champion:103}}  en contra )\n\nyo: we rengar ay&uacute;dame un poco mas que los otros estoy aprendiendo \n\n{{champion:107}} : .... cri cri cri\n\n( farmeo sin salir de torre la ahiri completamente gankeable es ignorada asta el lvl 10 )\n\nyo : bueno rengar no viene pusheare un poco estoy perdiendo farm aqu&iacute; en torre  \n\n ( pusheo un poco despu&eacute;s vienen {{champion:103}} {{champion:67}} y {{champion:412}}  me asen un mega bucaque )\n\n{{champion:107}} : /all report liss manca de mierda fedder \n\nyo : pero rengar no e hecho nada loco no puedo ni salir de torre \n\n{{champion:107}}  : ...... zzzzzzzzzz \n\n( segu&iacute; farmeando bajo torre y me divearon y el rengar muy sentado asiendo los p&aacute;jaros esos me ignoro completamente para despues seguirme flameando )\n\n\n.... bueno ir a otra lineas no fue tan f&aacute;cil como yo pensaba la verdad no me gusto esa experiencia y me dejo con un poco de angustia despu&eacute;s jugu&eacute; con janna y quede 3/3/26 y se me paso un poco la verdad no hab&iacute;a notado lo importante que era de sup si quer&iacute;a que las cosas se hagan bien tenia que hacerlas yo \n\n\nas&iacute; decid&iacute;   que me gustaba ser sup sin mi de sup los pobres no sab&iacute;an ni donde estaba el drag&oacute;n ( no es chiste estos rengar  de ahora ni drag&oacute;n hacen ) y asi fui feliz de sup \n\n\n                                                                                                                                                                          ------- FIN ....... o no tan tan tan \n\n\n si les gusto la historia por favor denle + 1 es mi experiencia propia y me tome el trabajo de resumirla y compartirla con ustedes","replies":[{"poster":"Casandra Lange","date":"2016-02-03T07:11:37.356+0000","up_votes":2,"down_votes":0,"body":"Yo soy main supp y me aterra cuando juego en otras líneas y los supps no son capaces ni de wardear el río. Y me pasa lo mismo, me siento rara cuando no juego de supp. Lo que he hecho es usar campeones que usualmente llevo supp a otras líneas: Tahm top, Leona Jg, Blitz mid y así, la gente cree que trolleas pero luego cuando vas feed se ríen y tú también. :) Ahora, así como yendo de supp wardeas, hazlo cuando vas a las otras líneas para que tengas una visión al menos parcial del mapa.  Si haz perdido tu línea, ve a otras líneas a ayudar y evitar que se pierda esa también y de paso puedes conseguir alguna kill o asistencias. ;)","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T17:06:14.189+0000","up_votes":2,"down_votes":0,"body":"jugando otras lineas extraño mi {{item:2049}} y mi {{item:2045}} . y a mis fantasmitas que buscan a la gente  {{item:3092}}","replies":[{"poster":"Casandra Lange","date":"2016-02-04T00:10:11.657+0000","up_votes":1,"down_votes":0,"body":"Pues los midlanners ahora están utilizando el Filo de robahechizos como objeto inicial y lo upgradean hasta la Proclamación de la reina de hielo por la utilidad que les da en línea...","replies":[]}]}]},{"poster":"Wolvi","date":"2016-02-03T11:02:31.570+0000","up_votes":2,"down_votes":0,"body":"¿Qué culpa tiene el rengar? Vos no tenías un buen manejo del campeón y tampoco hiciste un mínimo esfuerzo en hacer roam, era obvio que de esa forma no ibas a carrear. Te convertiste en un saco vacío, ¿y que pasa cuando pones tus posibilidades de ganar en un saco vacío? Perdes, por eso no te gankearon.","replies":[{"poster":"nahuatl","date":"2016-02-03T12:55:57.022+0000","up_votes":1,"down_votes":1,"body":"y supuestamente si te va mal deberia de gankearte el jg, o por lo menos cuando usas un champ que no tenes buen manejo de el, deberian de darte consejos o ayudarte al menos","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T16:56:01.362+0000","up_votes":1,"down_votes":0,"body":"es mas yo gankie bot  me conseguí unas cuantas kill pero la {{champion:103}}  no me dejaba de perseguir con su jungla por todo el mapa","replies":[]}]}]},{"poster":"MenoxX","date":"2016-02-03T06:04:17.715+0000","up_votes":2,"down_votes":1,"body":"{{sticker:zombie-brand-clap}}  Still a Better Love Story than Twilight","replies":[]},{"poster":"xXLawea777xx","date":"2016-02-03T06:15:38.439+0000","up_votes":1,"down_votes":0,"body":"te recomiendo estos:\ntop: {{champion:2}} {{champion:111}} {{champion:58}} \nMid:{{champion:63}} {{champion:105}} {{champion:112}} \njg:{{champion:254}} {{champion:5}} {{champion:80}} \nAdc:{{champion:236}} {{champion:81}} {{champion:15}}","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T06:17:42.093+0000","up_votes":1,"down_votes":0,"body":"ahora no tengo pi me lo gaste todo en champ que no me gustaron XD","replies":[{"poster":"dscpnak","date":"2016-02-03T07:37:07.412+0000","up_votes":1,"down_votes":0,"body":"te recomiendo algo, maineo lissandra y la verdad es rotisima y muy util en tf tenes zonhya incorporado( tu R) y tenes un flash en tu E  (algo lento pero meh hay que anticipar a lo que te van a hacer y funciona como flash) tenes stun en ulti y W y como si fuera poco tenes una Q que hace daño en area cada 2 seg...en resumen segui practicando con esa marvilla anti zeds {{champion:127}} {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T17:21:03.220+0000","up_votes":1,"down_votes":0,"body":"me pasa que tiro la q y no de da el rango para pegarle a los minion . y todos los campeones que use son re lentos  o me dio esa impresión","replies":[{"poster":"dscpnak","date":"2016-02-03T18:41:10.573+0000","up_votes":1,"down_votes":0,"body":"mid laner el 90% son lentos hay que saber posicionarse...tenes que acostumbrarte a pegarle a los minion y sigue un poquito mas la q siempre y cuando el ataque impacte en un minion o campeon","replies":[]}]}]}]}]},{"poster":"Help Support","date":"2016-02-03T18:08:34.307+0000","up_votes":1,"down_votes":0,"body":"Hay que reconocer que ser sup y jg no es para todos. Hay jg que no ayudan. O van a ayudad una linea que esta perdida y muy fedeada. No sacan dragones ni por mas regalados que esten. Sos. Jg tenes una lisandra que mete mucho daño y cc en tf es obio que la tenes que ayudarla ella puede asegurar la tf casi sola si la ayudas a fedearce. Sacas kill o asistencias como sea. Sacas oro free. Pero hay jg que ayudan y pierden oro gratis por no gankear lineas ganadas o lineas con buen daño y cc como el caso de una lisandra mid. Pero si gankean lineas perdidas tipo top 0 5 0 y termina regalando oro y dragones por no gqnkear lineas con kill seguras y asegurar objetivos mas facilmente con una ganancia de oro mas sustanciosa . Despues ya armado poder ayudar a remontar una linea perdida.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-02-03T06:33:03.941+0000","up_votes":1,"down_votes":0,"body":"**\"...por favor leean mi humilde historia mini libro.\" ** = Es un relato :P","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T06:37:00.656+0000","up_votes":2,"down_votes":2,"body":"es mi historia yo hago lo que quiero si quiero el final podría ser me hice un penta con janna top .... ademas ya me fije que la cague con el titulo se me olvido cambiarlo al final porque escribí el titulo antes de toda la historia y lo publique así sin darme cuenta XD ademas tiene un tono dramático :V\n\nademas es la historia de un main janna que intento ir a otras lineas :P ","replies":[{"poster":"ZanahoriaAsesina","date":"2016-02-03T07:10:49.521+0000","up_votes":1,"down_votes":0,"body":"En ningún momento dije que no podías hacer lo que quieras.Pero vos mismo dijiste \"que era algo que te paso\".\nUn relato es un conocimiento que se transmite, por lo general en detalle, respecto a un cierto hecho.\n\nSuerte. (:","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T17:04:52.911+0000","up_votes":1,"down_votes":0,"body":"bueno pero no se puede cambiar el titulo y si hubiera puesto todo  lo que me flamearon quedaria un libro igual XDD","replies":[]}]}]}]},{"poster":"matiaszpot","date":"2016-02-03T06:02:49.126+0000","up_votes":1,"down_votes":0,"body":"siento que eso nos pasa a los suports :c (o cuando eres blitzcrank y creen que tu q tiene radio de morgana y atraviesa minions :C)","replies":[]},{"poster":"MewMewKittyCutie","date":"2016-02-03T06:13:42.368+0000","up_votes":1,"down_votes":2,"body":"perdonen por una que otra falta de ortografía mi teclado es antiguo y no responde muy bien las iré arreglando con el paso del tiempo","replies":[{"poster":"MewMewKittyCutie","date":"2016-02-03T06:32:43.633+0000","up_votes":1,"down_votes":1,"body":"ahora me doy cuenta que mi teclado me trolio en el titulo O_O #tecladomalotroll2016 el titulo no se puede arreglar pt vida tt","replies":[]}]}]}