{"poster":"MewMewKittyCutie","date":"2015-10-25T17:33:16.591+0000","title":"Concepto de campeón : Agatha ( nombre no fijo :v ayuden con los detalles  V1.0 )","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":1,"body":"*  Para comenzar esper&oacute; que comenten cosas que aporten a la idea y no los t&iacute;picos comentarios de esta roto cosas de troles {{champion:48}}   en primera instancia ase mucho tiempo que estoy pensando en este campe&oacute;n pero no me decido por el nombre tenia pensado en Agatha pero es un nombre com&uacute;n as&iacute; si me podr&iacute;an ayudar con el nombre estar&iacute;a agradecido . El campe&oacute;n seria una hechicera de magia oscura que paso a mejor vida pero volvi&oacute; desde las sombras  para vengarse de los que la condenaron .  Ahora con sus habilidades :v \r\n   \r\nPASIVA : Dolor compartido - una parte de TODO  el da&ntilde;o que te causen se le devolver&aacute; a tus atacantes  ( 10% a lvl 1 35% a lvl 18 APROXIMADO ) \r\n\r\nQ : agon&iacute;a - habilidad  de poco recurso ( mana ) y de muy poco cd que sirve para farmear mientras mas se use contra el mismo objetivo mas da&ntilde;o provocara \r\n\r\nW: liberar sombras - libera un mont&oacute;n (entre 3 y 6 dependiendo del nivel ) de criaturas de sombras id&eacute;nticas al las del v&iacute;deo musical de amumu (https://www.youtube.com/watch?v=0AvWV6Mk374) minuto 2:33 al 3:00 son muy r&aacute;pidas y atacan al objetivo seleccionado \r\n\r\nE: poseer entidad : posees a una unidad dependiendo de que sea habr&aacute;n un efecto es similar al devorar de {{champion:223}}  pero no igual ya que tu te metes en la unidad \r\nAliado : te vuelves invulnerable y tu aliado gana 25% de velocidad y tu pasiva durante 5 segundos ( puedes salir cuando quieras )\r\nMinion : ganas 50% de velocidad te vuelves invulnerable y controlas al minion pero no puedes lanzar habilidades  durante 5 segundos ( puedes salir cuando quieras ) \r\nEnemigo : te vuelves invulnerable y le pones una slow de 60% por 3 segundos y lo obligas a que se provoque da&ntilde;o si es ad 3 b&aacute;sicos si es ap 40 % de su ap  \r\n \r\nR: maldici&oacute;n - maldice a el campe&oacute;n ( canaliza 3 segundos ) enemigo que tu quieras   ( global ) impidi&eacute;ndole regenerar recursos ( vida , mana ,energ&iacute;a la cual la reduce pero no la detiene  , etc ) ( ojo que es regenerar ejemplo soraka {{champion:16}}  te cura igual pero no te regeneras pasivamente ni puedes usar potis ) ademas de infligirle 1.5% - 2.5% - 3.5% de su vida m&aacute;xima cada 5 segundos como da&ntilde;o m&aacute;gico asta que tu o el muera  . ademas  que suena una m&uacute;sica dram&aacute;tica como esta :D (https://www.youtube.com/watch?v=uwNTQO50bQE)\r\n\r\nEspero que les guste la idea gracias por leer :v  aporten sus ideas y opiniones por favor \r\n LO CREE por mi odio a yasuo y zed :D {{champion:238}} {{champion:157}}","replies":[{"poster":"FallenDemonX","date":"2015-10-27T00:49:00.909+0000","up_votes":2,"down_votes":0,"body":"Esta interesante. Tiene sus cosas y lo veo muy potente si se usa bien.\n\nPasiva: Holy sh... ahem; quiero decir, un reflect de 10% ya es bastante incluso si solo se aplica a basicos como la {{item:3075}}, pero que en late escale hasta el 35%? Dame un momento...\nUna skill normal en late inflige entre 200 y 400 de daño X (contando defensas). 35% de 200 es 70, por lo tanto el de 400 es 140. Recuerda, eso es daño que REFLEJAS, no el que tu mismo infliges, tambien recuerda que los que infligen mayor daño son los mas blandos. Piensa en eso un momento.\n\n\nQ: Una espameable con un aumento progresivo de daño. No hay muchos detalles por lo que es complicado sacar un veredicto, pero la idea base no esta mal.\n\n\nW: Interesante, hay cosas similares ya in-game pero la verdad es que la idea encaja muy bien con el resto del kit, ya que proporciona una fuente de daño segura en caso de estar ulteando o usando la E.\n\n\nE: Una ult de Life Stealer basicamente, aunque con alguno que otro cambio. La verdad es que seria muy interesante ver una habilidad asi en el juego.\n\n\nR: Ummmm, me gusta mucho pero eso de que es global me parece demasiado. El problema es que sin eso seria como la ult de {{champion:90}}. \n\nPor cierto, creo que esto es mejor: https://www.youtube.com/watch?v=RVkcmx2l3WA","replies":[{"poster":"MewMewKittyCutie","date":"2015-10-27T14:04:29.362+0000","up_votes":1,"down_votes":0,"body":"Pasiva : si pero tiene un tick de 5 segundos tu al provocar daño se va poniendo una marca que va creciendo y después de ese tick se devuelve el daño pondrá el daño  ademas que le ayudara a ser una mago que pueda usarse de jungla y en mid  si la deleteas antes del tick no hará  daño  ademas que este champ no es para nada tanque es como una {{champion:67}} \n\n R : la verdad no es nada parecido a la ulti de {{champion:90}}  ya que no estunea solo hay que canalizarla ( como la r de {{champion:30}} ) es muy buena pero hay  manera de contrarrestarla  \n1- que maten a Agatha y adiós a la maldición \n2- tener sustain ya que impide la regeneración no la curación {{item:1053}} {{champion:37}} {{champion:16}} {{champion:432}}  {{champion:8}} {{champion:103}} entre otros \n\na quien jode esta ulti ? \n\n{{champion:36}} : no regenerara vida y ase daño por vida maxima \n{{champion:157}} : le reventara el escudo cada 2 por 3 y no podrá generar tan rápido flujo \n{{champion:238}} : tendrá problema de energía y no podrá abusar como lo ase normalmente","replies":[{"poster":"MewMewKittyCutie","date":"2015-10-27T14:10:10.620+0000","up_votes":1,"down_votes":0,"body":"ademas la idea que yo tenia es un champ que pueda ase  ruming sin salir de su linea y estando seguro ya que puedes mandar a las sombras a que vallan por el adc y le tiras el ulti izi :v ademas si vas a la jungla las sombras sirven como las cajas de {{champion:35}}\n\n\nademas esa canción no esta mal pero al final es muy alegre yo quiero que el enemigo sepa que va a morir el algún momento CX imagina la marca de {{champion:203}}  pero que te ponga daño por % de vida cada 5 segundos y te impida regenerar recursos vida / mana y cueste mas regenerar energía furia flujo etc asta que mueras o mates a agatha ","replies":[{"poster":"MewMewKittyCutie","date":"2015-10-27T14:25:49.429+0000","up_votes":1,"down_votes":0,"body":"ademas esta inspirada en las brujas que las queman y las cuelgan :v por acusarlas de brujería a pesar que fueron buenas :v\nsoy muy original :D \nhttps://www.youtube.com/watch?v=EOSvXVBCe7E\nriot igual {{champion:106}}  adasdsadasdas \nhttps://www.youtube.com/watch?v=b8Tp9SPLVHQ\n","replies":[]}]}]}]},{"poster":"NeiDei Ks","date":"2015-10-25T17:43:36.256+0000","up_votes":1,"down_votes":0,"body":"Me gusta tu idea pero encuentro que el poseer debería tener un limite de tiempo y la pasiva enfriamiento.\nUna idea de nombre podría ser  Malumei o algo por el estilo, porque como dijiste Agatha es muy común.","replies":[{"poster":"MewMewKittyCutie","date":"2015-10-25T17:50:32.505+0000","up_votes":2,"down_votes":0,"body":"con aliados y minions son 5 segundos máximo con enemigos 3 - la pasiva no tiene enfriamiento por que antes de mi nerf bloqueaba el % daño y lo devolvía ahora solo lo devuelve al atacante que es para evitar el pockeo  . respeto tu idea y me gusta ese nombre :D","replies":[{"poster":"NeiDei Ks","date":"2015-10-25T18:26:26.141+0000","up_votes":2,"down_votes":0,"body":":D","replies":[{"poster":"MewMewKittyCutie","date":"2015-10-25T18:44:03.455+0000","up_votes":1,"down_votes":0,"body":"el ultimate originalmente era un gancho de {{champion:412}}  tele dirigido global con daño verdadero por vida %  XD y dije esto esta muy roto al imaginármelo in game","replies":[]}]}]}]},{"poster":"Reimu Hakurei","date":"2015-10-25T18:16:45.653+0000","up_votes":2,"down_votes":0,"body":"Te felicito por tu idea.","replies":[]}]}