{"poster":"zrs1337","date":"2014-08-19T17:17:42.453+0000","title":"Azok a csodálatos magyar pro playerek...","subforum":"Általános beszélgetés","up_votes":1,"down_votes":1,"body":"Sajnos sok az olyan ember a LoL-ban, aki csak flamelni tud, hiába ő rontja el a dolgokat, unskilled de csak annyit tud csinálni, hogy a másikat flameli... és sajnos azt tapasztalom, hogy a magyarok ebben élen járnak. Itt mindenki egy low elon ragadt challenger, mindenkinél mindent jobban tud, igaz, hogy kb. egy beginner bot szintjén mozognak, de sajnos 80 IQ-val nehéz felfogni... Van is egy ilyen neten is terjedő mondás \"Ha meghalsz, te nem tudsz róla, hogy halott vagy, csak a többieknek nehéz. Ugyanez a helyzet akkor is, ha hülye vagy.\"\n\nEz a baj az emberekkel és ezáltal a LOL játékosokkal, egyszerűen nem látják a hibáikat, mert túl buták, hogy felfogják ha valamit rosszul csinálnak. Csak annyit tudnak mondani, hogy \"noob jungler report\" \"report my team\" \"retard team\" etc... a magyarok meg ugye anyáznak... \nMost játszottam egy rankedet és magyar premade botot kaptam, már mikor megláttam, hogy magyarok tudtam, hogy kikapunk, de megpróbáltam, nem jött össze. Aztán ment a nagy flame, hogy reportoljanak engem, mert egy noob vagyok :) persze, mert jungler voltam, ki más lenne a hibás az ő balfaszkodásukért? Support wardok nélkül, mikor megyek gankelni, nem várják meg, hogy én kezdeményezzek inkább az enemy ADC elé állnak 200 hpval és meghalnak mielőtt bármit csinálnék, tipikus low elo play. Aztán jön, hogy \"fuckin noob jungler report\" stb... Akkor elszóltam maga, hogy mégis miért engem kéne reportolni az ő hibáikért? Ekkor jön részükről az anyázás, meg hogy elegük van az ilyen nyomorék boostolt szarokból, mint én... Valószínüleg én vagyok a boostolt, nem a 20 perc/80 cs adc meg a 0 ward support, akik csak úgy osztogatják a free killt, mintha karácsony lenne és mellő még a flame is megy rendesen... Á dehogy, ők csak szegények az elo hell miatt vannak goldban, igazából kint lenne a helyül LCS-en..\nNem hogy örülnének, hogy egyáltalán goldba felcarryzték őket, mert még bronzeban is vannak 10x jobb játékosok..\n\nItt egy kép ezekről a kedves gyerekekről, akit érdekel, hogy kit kerüljenek játékban, azok a match historyban megtalálják a nevüket. :)\nhttp://s30.postimg.org/kavidar29/magyarlol.jpg","replies":[{"poster":"Csou","date":"2014-08-19T20:22:43.098+0000","up_votes":3,"down_votes":0,"body":"Miért van az hogy folyamatosan csak a rosszat hallom a magyar lolosokról de még egy ilyennel sem találkoztam.\nHa ráakadok egy magyarra a játékban azonnal felveszem a barátlistára és megpróbálok meg is barátkozni vele.\nSzerintem ha pozitívan viszonyulsz az emberekhez ők is ugyan így viszonyulnak hozzád.\nEz csak egy játék még akkor is ha ranked ezt nem szabad elfelejteni és mint ilyen célja a szórakoztatás ha rosszul érzed magad amiért veszítettél akkor ez nem a te játékod. Lehet hogy mindez naivan hangzik de nekem még soha nem anyázott egyetlen magyar sem pedig jó párral találkoztam már.","replies":[{"poster":"R3wan","date":"2014-08-20T10:50:35.403+0000","up_votes":1,"down_votes":0,"body":"Kaptunk már haverokkal teljes premade magyar teamet magunk ellen. Az elején még el is beszélgettünk velük. Aztán, ahogy kezdtek rosszul állni, elkezdtek nagyon csúnyán flamelni. Szóval örülj, hogy eddig nem találkoztál ilyenekkel. Kívánom, hogy így is maradjon. :)","replies":[{"poster":"Csou","date":"2014-08-21T11:25:16.025+0000","up_votes":1,"down_votes":0,"body":"De tényleg ahány magyarral csak találkoztam eddig mind jó fej volt.\nA haverjaim között (akiket máshonnan ismerek nem játékból) van pár gyökér ember akik szintén ha rosszul állnak az természetesen más hibája de őket tiltom is. Szerintem ez a két út van: Emberi szinten képes kommunikálni, vagy sehogy, velem legalábbis.","replies":[]}]},{"poster":"zrs1337","date":"2014-08-20T13:42:01.139+0000","up_votes":1,"down_votes":0,"body":"Én 1x találkoztam értelmes magyarokkal, ők is duóban tolták, champ selectnél dumáltunk, felhívtak ts-re, letoltuk a játékok, értelmesen elvoltunk... de sajnos 90%ban ha tudják, hogy magyar vagy megy a flame... Kb. 1 hete volt hogy 3 magyar került be a teamembe, de azokhoz inkább hozzá se szóltam, már a meccs elejétől ment az arcoskodás egymás közt, hogy ők mennyi jól tolják meg okoskodtak a championokról, de szánalmas volt annyi hülyeséget hordtak össze, aztán persze kikaptunk mert az egyik elfeedelt vayne volt és mid gameben minden áron szólóban akart nekimenni az enemy teamnek, ki is kaptunk miatta aztán persze jött a szokásos pofázás, hogy reportoljanak mindenkit mert ők 2v5 duo bot nem tudják megnyerni egyedül  a meccset ilyen balfasz csapattal.. :D","replies":[]},{"poster":"Zooty","date":"2014-08-20T10:32:45.411+0000","up_votes":1,"down_votes":0,"body":"> Szerintem ha pozitívan viszonyulsz az emberekhez ők is ugyan így viszonyulnak hozzád.\n\nÁltalában igen, de ritkán van hogy még akkor sem, az pedig elég szar érzés... Kb dupla pofáraesés :/","replies":[]}]},{"poster":"l3ullet","date":"2014-08-19T19:01:14.324+0000","up_votes":2,"down_votes":0,"body":"Eléggé rossz hozzá állás h másokban keresi az ember a hibát, annak tekintetében h rajtuk nem tud változtani, saját magán viszont igen.. Ezt kéne mindenkinek belátni rankeden és akkor sokan nem ott lennének ahol..\n\nJah és ilyen esetekbe sose habozz használni az ignore gombot.. Csodákra képes. Még ha meccs kimenetelét nem is de a hangulatod némiképp befolyásolja.","replies":[]},{"poster":"Zooty","date":"2014-08-19T18:47:13.256+0000","up_votes":1,"down_votes":0,"body":"És most mi is a célod ezzel a qq post-tal?","replies":[{"poster":"zrs1337","date":"2014-08-20T13:38:21.219+0000","up_votes":1,"down_votes":0,"body":"Semmi célom, tisztában vagyok vele, hogy értelmetlen, de jobb kiadni magamból, mint  a gameben ragelni, mint ők...","replies":[]},{"poster":"l3ullet","date":"2014-08-19T18:57:46.219+0000","up_votes":1,"down_votes":0,"body":"Gondolom semmi célja, de sokszor nagy megkönnyebbülés kiönteni a a lelked egy-egy ilyen poszt formájában a jofféle community miatt.","replies":[]},{"poster":"Nforce877","date":"2014-08-19T19:32:28.918+0000","up_votes":1,"down_votes":1,"body":"Talán elégtételt valamilyen szinten, hogy hát ha az is látja aki csinálta és majd meggondolja magát. De sajnos nem így van még régebben egy magyar csapattársam így kijelentette: \"*csak azért nem anyázokneked meg noobozlak mert velem vagy* \" az ilyen hozzáálású emberek nem tudom mit várnak.","replies":[]}]},{"poster":"Invisible Dye","date":"2014-08-19T19:57:30.443+0000","up_votes":1,"down_votes":0,"body":"Meg se nézem a képet. **Meglehet**  rosszul játszottak, van ilyen nekem is és mindenkinek van 1-2 meccs ahol az ember nem tudja kezében tartani az irányítást. Viszont ez baromira nem azt jelenti, hogy egyébként esetleg  ne lennének jó játékosok. Ezzel amit itt leírtál, megosztottál velünk, csak azt bizonyítod, hogy Te vagy a nagyobb gennyzsák, nem ők, még ha flameltek és anyáztak is. Mindenki figyelmébe ajánlom [ezt a posztot](http://forums.eune.leagueoflegends.com/board/showthread.php?p=6338958#post6338958)","replies":[]}]}