{"poster":"anastashs02","date":"2017-05-12T16:02:27.228+0000","title":"parmanemtly banned from 2 games while 0 offencive words are included","subforum":"Player Behavior","up_votes":1,"down_votes":14,"body":"dear riot , i just got permabanned .after my 14 day ban which was well deserved to me i have stoped flaming. i would haras my teamates or enemies in almost every single game thats why i got 14 day banned . but now my permabanned punishment is outragius. in my games of course i will have my arguement as all players have but not only i have stoped harasing my allies / enemies i have even stoped saying the word noob . not even oncein a game . in my last 2 games wich got me permabaned in one of them i joined loby .. my midlaner said he doesnt want to win and he caaled us f*****g b******s . we joined the game and he all chated to report me for whishing him cancer. he said he will troll i told he him u think im scared of  u ? u trash . in the end he ended up troling and losing the game for us.. i dont hink u are trash deserves permaban as in every game i join at least two players curse in the chat like 10 times.. 2nd game i had an arguement with enemy top laner which was greek as me . we both flamed each other in greek so we didnt tilt or alliess or enemies . just 2 people flaming each other for who is the best . a fight between 2 people both flaming each other . these are the reasons i got permabaned. PERMABANED Y ACCOUNT WHICH IS PLATINUM 3 AND I HAVE spent money on it is gone for and arguement with a player and a u are trash to a troller . riot plz i have spend my life in this account worked hard to be plat 3 and 2 games of not even minor harasing is a ridiculus reason to be permabaned . also in every every game i play i ALWAYS credit my team for geting a kill doing a play EVERYTHING I ALWAYS CREDIT THEM and i believe im now a positive overall player and even if i get flamed i answer with  : ok , i aggree , or point out their mistakes so they stop flaming me . . i woild highly appreciate and unban or even another 14 day ban also u can permaban me from chat as i am obsesed with the game and if they all flame me i might return a bad word or 2 which hasnt hapened until now . .. plz answer me.  these are my chat logs :  Game 1\nanastashs02: GJ\nanastashs02: lvl irelia?\nanastashs02: ?\nanastashs02: yeye\nanastashs02: im sure about that\nanastashs02: :(\nanastashs02: ?\nanastashs02: ?\nanastashs02: lol 3 ganks\nanastashs02: and speak\nanastashs02: u would do shi if lee ddnt come to help u :(\nanastashs02: yeye\nanastashs02: ?\nanastashs02: ?\nanastashs02: XDDD\nanastashs02: lee 4 gaks top\nanastashs02: 400 ms ? :(\nanastashs02: gragas\nanastashs02: are u drunk\nanastashs02: get carried irelia\nanastashs02: from 3v1?\nanastashs02: and 4 ganks from lee in lane?\nanastashs02: lul\nanastashs02: thats why u need  5 gank :(\nanastashs02: and i stil win u lol\nanastashs02: yy\nanastashs02: i still win u :(\nanastashs02: cuz its a 5v5 game look at my bot.. if it was 1v1 game u would be bronze 5\nanastashs02: th dikia sou thn poutana gamoane stamata na feedraeis\nanastashs02: u wasted r ignite..\nanastashs02: XD\nanastashs02: u too good for me ..\nanastashs02: i wonder how can u be 2/4 with 6 ganks and i still win u 1v1 thats intresting..\nanastashs02: u wasted ignite \nanastashs02: im smart to keep ignite..\nanastashs02: poutsa \nanastashs02: ?\nanastashs02: dn ksereis poso kalo ine to ignite kai apla to petakses ides pos se exosa meta me to ingite?\nanastashs02: ponao pou gia akoma mia fora to antipalo top tha kouvalithei\nanastashs02: akoma kai an se kseftilisa :(\nanastashs02: ?\nanastashs02: ponas?\nanastashs02: 2/6?\nanastashs02: 2/6?\nanastashs02: ponese poli sory\nanastashs02: we can still win\nanastashs02: i oneshot caitlyn\nanastashs02: why dont wat me wukog\nanastashs02: ?\nanastashs02: we can still win\nanastashs02: we have wukong if h gets good combo\nanastashs02: re gamomane eisai 3/8\nanastashs02: kai milas kiolas\nanastashs02: pooutanas gie\nanastashs02: caitlyn frozen malet?\nanastashs02: no?\nanastashs02: adc will always be oneshoted\nGame 2\nanastashs02: zed u already got reported\nanastashs02: u think im scared of u ?\nanastashs02: u trash\nanastashs02: XXXXXXXXDDDDDDDDDDDDDDDDD\nanastashs02: LOOOOOOLL\nanastashs02: XD\nanastashs02: he threatens all team to troll \nanastashs02: and he flamed from loby \nanastashs02: all report zed \nanastashs02: ?\nanastashs02: lee \nanastashs02: u\nanastashs02: why did u kic khim\nanastashs02: man he was 250 hp i left him for u\nanastashs02: u didnt e gim\nanastashs02: befor kick\nanastashs02: rito nerf rumble r.. 100 % slow\nanastashs02: flash?\nanastashs02: engage\nanastashs02: ?\nanastashs02: ?\nanastashs02: when amumu and ori cant click r and kill us all .. riot games\nanastashs02: stack magic resist..\nanastashs02: zaira buid full ap we need ap\nanastashs02: no moresup items\nanastashs02: zed they are all low\nanastashs02: now that i got titanic it will be very easir to flash oneshot lucian..\nanastashs02: free baron..\nanastashs02: gift from lee\nanastashs02: I GO IN\nanastashs02: ..\nanastashs02: lee\nanastashs02: u could not solo\nanastashs02: next drake focus\nanastashs02: boots don win game\nanastashs02: if u give free baron u lose game\nanastashs02: 0 FOLOW GG\nanastashs02: this troll zed..\nanastashs02: U THIN KBOOTS WILL WIN GAME\nanastashs02: lol\nanastashs02: this zed trolls man .. he said u free win ..\nanastashs02: he lets u \nand always remember . it was 2 games.","replies":[{"poster":"Michael702","date":"2017-05-12T16:50:19.788+0000","up_votes":1,"down_votes":15,"body":"If you say anything in chat and get reported by more than 2 people, you can get penalized. Even if you just said \"gg\". It happened a lot last season with Flex Queue.","replies":[{"poster":"Mizuki Zahra","date":"2017-05-12T16:59:10.732+0000","up_votes":6,"down_votes":1,"body":"not true all reports do is flag someone weather it be 1 report or 9 and then someone checks out what happened.","replies":[{"poster":"Michael702","date":"2017-05-12T17:08:55.277+0000","up_votes":2,"down_votes":14,"body":"Actually more reports carry more weight.\nAnd yes, I have seen people get chat banned for saying gg just because their entire team reported them. This was all back in S6 during the infamous flex queue but it did happen and I'm sure it still does.","replies":[{"poster":"Riot Tantram","date":"2017-05-12T20:36:43.832+0000","up_votes":12,"down_votes":0,"body":"> Actually more reports carry more weight.\n\nThere is no report weighting. Reports (whether 1 or 9) flag a game for review.\n\n> And yes, I have seen people get chat banned for saying gg just because their entire team reported them. \n\nIf you have a case of this happening, please share the link. I've been an engineer in Player Behavior for over 5 years and have never seen a case like this. It's theoretically impossible.","replies":[{"poster":"HowPlayGAEM","date":"2017-05-12T21:00:16.126+0000","up_votes":1,"down_votes":7,"body":"I've been chat banned and had my account suspended and have said almost nothing in chat.\n\nLeague players are cancer and like cancer, they want to destroy any happiness of other players.","replies":[{"poster":"Riot Tantram","date":"2017-05-12T21:05:47.506+0000","up_votes":12,"down_votes":1,"body":"> I've been chat banned and had my account suspended and have said almost nothing in chat.\n\nPost the logs here, or post from the account in question if you were suspended for saying almost nothing, so that I can see it. That's not how the system works.","replies":[{"poster":"HowPlayGAEM","date":"2017-05-12T21:24:19.076+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"AzureDragoon","date":"2017-05-13T17:14:01.349+0000","up_votes":1,"down_votes":0,"body":"Then what was the account that was banned so Tantram can look it up?","replies":[]},{"poster":"This Is Your Dad","date":"2017-05-13T00:39:28.190+0000","up_votes":3,"down_votes":2,"body":"You're nothin' but a bluffer. Stick that pea shooter back in its holster. This thread ain't big enough for the two of you. ;)","replies":[]}]}]}]}]},{"poster":"AzureDragoon","date":"2017-05-12T17:15:01.683+0000","up_votes":4,"down_votes":0,"body":"That is false. It has been stated by Rioters, Arbiters, etc. Reports simply flag a game for review, multiple reports in a single match do not add any more \"weight\" to the review, than a single report. It specifically done so that Premades can't abuse the system. \n\nMultiple and frequent games with legitimate complaints play a factor, but not the amount of reports in a single match.","replies":[]},{"poster":"HalcyonDweller","date":"2017-05-12T17:17:37.295+0000","up_votes":5,"down_votes":1,"body":"Riot doesn't allow this now. The system prevents it.\n\nPlease stop spreading misinformation. You're making things worse.","replies":[]},{"poster":"Mizuki Zahra","date":"2017-05-12T17:13:50.075+0000","up_votes":2,"down_votes":0,"body":"I don't think that's the only reason for a report and you have to remember its all computer programs until it finally gets to a mod","replies":[]}]},{"poster":"Michael702","date":"2017-05-12T17:12:03.287+0000","up_votes":1,"down_votes":9,"body":"Let's use your scenario and say you're a mod. Somebody gets reported by 1 person. You see this all the time. 99/100 the 2 just don't get along and flamed each other all game.\n\nThen you see someone get reported by their entire team. You think to yourself, \"Well, this person surely did something bad to piss off their entire team.\"","replies":[{"poster":"Mizuki Zahra","date":"2017-05-12T17:14:22.067+0000","up_votes":2,"down_votes":0,"body":"its all a computer program until it gets reviewed by someone","replies":[]},{"poster":"Xidphel","date":"2017-05-13T13:18:15.405+0000","up_votes":1,"down_votes":0,"body":"Then that person's a shit mod that can't do his job right.","replies":[]}]}]},{"poster":"Kei143","date":"2017-05-12T17:05:29.817+0000","up_votes":2,"down_votes":0,"body":"Heh, when you read the chat logs of those that claim they were punished due to mass reporting, you'd find that their chat was indeed punishable.","replies":[{"poster":"Michael702","date":"2017-05-12T17:12:30.983+0000","up_votes":1,"down_votes":5,"body":"no, really. they just said gg. Like I said, this was last season when it was 1v4 on the team so all 4 would gang up on that 1.","replies":[{"poster":"HalcyonDweller","date":"2017-05-12T17:16:31.835+0000","up_votes":1,"down_votes":0,"body":"EDIT: moved to more relevant spot.","replies":[]},{"poster":"Kei143","date":"2017-05-12T17:33:49.030+0000","up_votes":2,"down_votes":0,"body":"yea, I wouldn't trust that too much. There was a mass chat restriction / 14-day ban in TUR server and the chatlogs showed nothing.\n\nTurns out there were super toxic in post game chat.\n\nWhat you see here is just a small glispe of the story.","replies":[]}]}]}]},{"poster":"HalcyonDweller","date":"2017-05-12T16:08:46.015+0000","up_votes":5,"down_votes":0,"body":"You chit-chat with people a lot. It's too easy to mistakenly say something too close to being harassment. Several things you said weren't blatant flaming but they were pretty damn close.\n\nTry not talking about the past on your next account. Literally, if you focus on just discussing what is happening and what will happen it's nigh impossible to say something blaming because most blame is spoken in the past tense. This will also improve your gameplay because you will be typing less and playing more of the time.","replies":[{"poster":"anastashs02","date":"2017-05-12T16:31:07.684+0000","up_votes":1,"down_votes":3,"body":"you are right man .. so it seems i have some tiny thing to do before completely reforming. thats why im asking a big chat restriction like a month of no chat at all because i worked hard in this acc.. so creating a new one wont reform me i will be in the same level just starting all over again","replies":[{"poster":"HalcyonDweller","date":"2017-05-12T16:38:41.209+0000","up_votes":2,"down_votes":2,"body":"Unfortunately Riot probably won't reverse the punishment in this case because you had moved up the tiers of punishment already. It takes really good behavior for quite some time to get out of the danger zone.\n\nYour best bet is to submit a support ticket here:\nhttp://support.riotgames.com/\n\nAnd hope that they take pity on your case and like how much you have improved. It will also help to show them your plan for how you intend to continue improving your behavior.","replies":[{"poster":"anastashs02","date":"2017-05-12T16:45:47.607+0000","up_votes":1,"down_votes":2,"body":"thanks a lot man","replies":[{"poster":"HalcyonDweller","date":"2017-05-12T17:15:16.187+0000","up_votes":1,"down_votes":2,"body":"{{sticker:slayer-pantheon-thumbs}} \n\nBest of luck.","replies":[]}]}]}]}]},{"poster":"Chønklord","date":"2017-05-13T02:10:39.576+0000","up_votes":3,"down_votes":0,"body":"anastashs02: zed u already got reported\nanastashs02: u think im scared of u ?\nanastashs02: u trash","replies":[]},{"poster":"Anomander","date":"2017-05-12T19:55:08.068+0000","up_votes":3,"down_votes":1,"body":"I think that calling people names and feeders in other languages is still pretty toxic.\n\n\nEnjoy your ban.","replies":[]},{"poster":"Anastaecia","date":"2017-05-12T16:12:00.494+0000","up_votes":2,"down_votes":1,"body":"You know what every one of these posts has in common.  The chat log is longer than everyone's chat combined in most games.   STOP CHATTING AND START PLAYING.  Maybe then you wont say something bad accidentally.","replies":[]},{"poster":"YerroFever","date":"2017-05-13T15:44:31.025+0000","up_votes":1,"down_votes":0,"body":"I think you should be aware that just because you don't say an \"offensive word\" like a racial slur, homophobic slur, sexist slur, etc... does not mean how you talk to people is not toxic.","replies":[]},{"poster":"AzureDragoon","date":"2017-05-12T17:19:56.318+0000","up_votes":1,"down_votes":0,"body":"When you're recently off a 14 day ban you are on very thin ice, and anything worthy of any sort of punishment will lead to a permanent ban unless you reform.","replies":[]}]}