{"poster":"DevilKurama","date":"2017-10-11T10:12:11.280+0000","title":"Sticker! Kritik!","subforum":"Allgemeiner Chat","up_votes":6,"down_votes":2,"body":"Also erst mal ich feier die Sticke die sind super kawaii. ABER 350 RP? DAFUQ Lieber 3150 Ep f&uuml;r einen als 350 rp.... Oder das man sie auch mit EP kaufen kann aber why nur RP? Ich wollte sie haben ohne Geld auszugeben :c{{sticker:sg-janna}}","replies":[{"poster":"KledRekt","date":"2017-10-11T11:57:42.795+0000","up_votes":7,"down_votes":1,"body":"Diese Sticker sind mehr als überflüssig. Das Spiel wird immer lächerlicher und kindlicher. Ich misse wirklich die alte Season 2, als es nur um das Gameplay ging und der Fokus nicht so stark auf kosmetischen Veränderungen lag. Hoffe nur diese Dinger kommen nicht in die Hextechtruhen, finde es ja schon schade, einen Champion aus der Truhe zu ziehen statt einem Skinsplitter. Wenn jetzt auch noch alles mit diesen Emotes überflutet wird, Prost Mahlzeit.","replies":[{"poster":"5weeds","date":"2017-10-11T12:03:04.819+0000","up_votes":2,"down_votes":2,"body":"Riot's Fokus liegt sehr wohl auf dem Gameplay.\nNur dass Riot jetzt um ein paar Hundert Angestellte stärker ist, als vor ein paar Jahren.\nAlso kümmern sich halt ein paar der Leutchen um solche Sachen wie Sticker.\n\nZudem, wenn bei dir das Gameplay im Vordergrund steht, kann es dir ja egal sein, wie sich die Optik von LoL verändert.\nDas Gameplay bleibt schließlich (im Kern) immer gleich.\n{{sticker:sg-lulu}}","replies":[{"poster":"KledRekt","date":"2017-10-11T12:12:51.754+0000","up_votes":5,"down_votes":1,"body":"Dann steckt man die zusätzlichen Ressourcen doch lieber in die Championentwicklung oder überlegt sich neue Konzepte für Spielmodi oder Maps. Eben Dinge, die wirklich einen Mehrwert bieten, nicht nervige Extras wie diese Emotes.","replies":[{"poster":"5weeds","date":"2017-10-11T12:21:57.165+0000","up_votes":3,"down_votes":1,"body":"Ohne solchen \"nervigen Extras\" wie Skins, Augenskins usw. hätte Riot _überhaupt keine_ Ressourcen.\nEs ist immer noch ein F2P Game, komplett Frei von Pay to Win.\nWie sollen sie sich denn sonst Finanzieren? 10 Sekunden Werbungen beim Backport?\nEine Werbeschriftzug oben am Bildschirm? Gesponserte Champions mit Werbung auf Trikot?\n\nSoll kein flame sein.\nIch habe kein Interesse daran, dass diese Sticker eingeführt werden.\nAber sich deswegen aufregen verstehe ich auch nicht.","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2017-10-11T12:03:20.445+0000","up_votes":4,"down_votes":1,"body":"Beschwert sich über den zunehmenden Wahn kosmetischer Veränderungen und ärgert sich über Champion, statt Skinsplitter. Lul.","replies":[{"poster":"KledRekt","date":"2017-10-11T12:06:59.212+0000","up_votes":1,"down_votes":0,"body":"Skins sind seit jeher Bestandteil des Spiels und werden es immer bleiben. Alles weitere ist unnötig.","replies":[{"poster":"5weeds","date":"2017-10-11T12:38:07.480+0000","up_votes":3,"down_votes":0,"body":"Augenskins, Chromas, Meisterungs Embleme, Rahmen für Ladebildschirme, Ehrungssystem, Eventmissionen, Clubs, alternative Spielmodi.\n\nAlles Dinge, die erst eingeführt wurden.\nAlles Dinge, die abdingbar sind.\nAlles Dinge, die dem Spiel gutgetan haben.","replies":[{"poster":"KledRekt","date":"2017-10-11T14:46:11.919+0000","up_votes":1,"down_votes":0,"body":"Ja gut da ist was dran.","replies":[]},{"poster":"Uranbrennstab","date":"2017-10-11T13:37:14.018+0000","up_votes":1,"down_votes":0,"body":"^This","replies":[]}]},{"poster":"Uranbrennstab","date":"2017-10-11T12:26:04.597+0000","up_votes":2,"down_votes":1,"body":"Ist das so? Wenn es unnötig wäre, würde es nicht angeboten werden.","replies":[]}]}]}]},{"poster":"h0rrrny","date":"2017-10-11T11:37:00.906+0000","up_votes":3,"down_votes":0,"body":"Hallo allerseits,\n\ngrundsätzlich finde ich die Idee eines neuen Kommunikationsmittels aufjedenfall gut. Zu den Erschwinglichkeiten wurde hier ja schon etwas Kund getan.... \n\nIch wollte noch ergänzen, dass ich die Sticker nicht für alle Spielergruppen für geeignet halte. Ich bin in den 30igern und spiele LoL immer noch gerne, aber die angebotenen Sticker scheinen eher für die Zielgruppe von 10 - 16 Jahren zu sein. Ich werde also bestimmt kein \"kleines Kätzchen\" Sticker und auch sonst keinen sonstigen (Kleinkind)-Sticker benutzen. Vielmehr sollte die zu vermittelnde Information im Mittelpunkt stehen und nicht ein lustiges Gesicht von Sir Pungu.\n\nWir sehen uns auf den Richtfeldern (mit oder halt auch ohne Stickers)","replies":[{"poster":"5weeds","date":"2017-10-11T11:45:13.349+0000","up_votes":1,"down_votes":0,"body":"Nicht alle Sticker werden Süß und Klebrig sein.\nZ.B. den \"Daumen Hoch\" Sticker finde ich ziemlich gut.\nDein Support hat was gut gemacht? Hau den Daumen raus und er weis es, ohne dass das Team ein vereinzeltes \"gj\" im Chat aufploppen sieht.\n\n> die angebotenen Sticker scheinen eher für die Zielgruppe von 10 - 16 Jahren zu sein.\n\nP.S. Ich bin 20 und find die Idee gar nicht mal so schlecht (obwohl es mich ehrlich gesagt nicht wirklich interessiert ob Sticker nun eingeführt werden oder nicht).\nHabe mir die Sticker aber auch noch nicht alle angeguckt.","replies":[{"poster":"KledRekt","date":"2017-10-11T12:02:36.234+0000","up_votes":1,"down_votes":0,"body":"Natürlich sind diese Sticker für Kinder gedacht. Altzocker wie ich und Horrrny (wie er selbst behauptet) finden diese Sticker einfach nur kitschig. Das Spiel sollte anfangen sich wieder ernst zu nehmen und sich mehr um das eigentliche Gameplay zu kümmern.","replies":[{"poster":"5weeds","date":"2017-10-11T12:14:47.084+0000","up_votes":2,"down_votes":1,"body":"Immer dieser Wahn, dass Riot sich nicht mehr um das Gameplay kümmert...\nRiot expandiert wie kaum ein anderes Studio.\nDurch ihre SEHR viel höhere Masse an Angestellten, können sie nun mal auch ganze Abteilungen solchen Dingen zuweisen.\n\nSind Sticker unnötig?   \n Ja.\nSprechen sie alle Spieler an?   \n Nein.\nWerden sie das Spiel ruinieren und ein My Liddle Pony Franchise aus LoL machen?  \n~~Wahrscheinlich ~~   \nNein.","replies":[]}]},{"poster":"h0rrrny","date":"2017-10-11T12:00:47.785+0000","up_votes":1,"down_votes":0,"body":"Dein Wort in Rito's Ohr... :)","replies":[]}]}]},{"poster":"hi im seb","date":"2017-10-11T10:37:45.542+0000","up_votes":1,"down_votes":0,"body":"warte der mist kostet geld? war jetz 2 Tage nich on aber sind das die Emotes ingame oder fürn Chat?","replies":[{"poster":"Sirrkas","date":"2017-10-11T10:40:28.416+0000","up_votes":2,"down_votes":0,"body":"Die sind ingame. Kann man über dem Kopf des eigenen Champions erscheinen lassen. Ein Thumps Up ist aber frei für jeden verfügbar.\n\nIch kann mir aber gut vorstellen, dass die auch beim Hextechloot später mal als Beute eingeführt werden.\n\nEdit:\n\nDer Abschnitt hier\n\n>Kommen alte Sticker zurück?\n>\n>Nicht direkt, wir suchen aber nach Möglichkeiten, die Sticker von alten Events (wie Arcade oder Licht gegen Dunkelheit) wieder zurückzubringen. Wir haben jedoch nicht vor, alte E-Sport-Sticker zurückzubringen. Falls wir einen Sticker zurückbringen, den du dir bereits verdient hast, bekommst du ihn von uns geschenkt.\n\naus den [FAQ ](https://support.riotgames.com/hc/de/articles/115012374028)ist auch interessant.","replies":[{"poster":"hi im seb","date":"2017-10-11T11:37:17.989+0000","up_votes":2,"down_votes":0,"body":"da muss ich jetzt aber auch fragen ob der mute button für emotes wieder da ist. und das die dem loot hinzugefügt werden ist meine größte sorge, fänd ich genauso blöd wie icons, ich will nicht noch ne geringere chance skins zu bekommen o.O","replies":[]},{"poster":"Hellosager","date":"2017-10-12T14:38:15.406+0000","up_votes":1,"down_votes":0,"body":"> Werden die Sticker zur Beute hinzugefügt?\n>\n>Noch nicht, es ist aber nur eine Frage der Zeit.","replies":[{"poster":"Sirrkas","date":"2017-10-12T15:08:54.933+0000","up_votes":1,"down_votes":0,"body":"Danke, aber das habe ich dann auch noch gelesen, als ich die FAQ ansah. Ich habs nur nicht mehr reingeschrieben.","replies":[]}]}]}]},{"poster":"Cute Pancham","date":"2017-10-11T11:36:01.599+0000","up_votes":2,"down_votes":1,"body":"Für son mist 450 rp (ohne sale, sie sind ja grad sogar für 22% im sale) also sorry aber das ist einfach nur noch lächerlich rito :)\nSogar für 50 rp fänd ich den mist schon fast überteuert aber 450? Für 1 bild mit dem du bm-en kannst was sowieso dann 50% der Leute muten? Lächerlich. Und für den mist kann man jetz auch die Mastery-emotes blocken. Danke rito dass das game heute wieder etwas schlechter geworden ist x)","replies":[]},{"poster":"Janna best Waifu","date":"2017-10-12T11:20:48.918+0000","up_votes":1,"down_votes":0,"body":"Ich hab gehört, es soll auch leute geben die spaß am spiel haben, rollenspiel betreiben, den merch store besuchen und sich für die Lore intressieren (mich).\nEs geht nicht nur um ELO und gewinnen, es geht um Spaß und als Hobby.\nDie ganzen kleinen sachen, ist das was LoL so einzigartig und regelmässig frischen wind ind spiel fägt.\n\nIch sags ganz ehrlich, würd es keine masterysystem/stickers/events und den Wochenend spielmodus nicht geben, würd ich als auch viele bekannte, das spiel nicht mehr spielen :).\n\nIch war ca 3 jahre inaktiv und kam eig nuf wieder wegen dem Masterysystem und Elementalist Lux das man was zu tun hat und spaß haben kann.\n\nAußerdem ist es immer toll, was besonderes in form von skin/emote oder ähnlichem zu haben.\nIch werds nie vergessen, wo ich mit meinem preorder Humsn Ryze, den streamer so emotional beglückt habe, das da sogar tränen flossen :)\n\nIn diesem sinne, wenns dir nicht gefält ok, aber bitte nicht alles schlecht reden.\n\nliebe Grüße,\nLuxienna","replies":[]},{"poster":"MrSnowy","date":"2017-10-11T21:22:06.586+0000","up_votes":1,"down_votes":0,"body":"Bitte Bedenkt auch das Sticker Später in den Shop kommen wenn die Neue Ingame Zahlmethode Blaue Essenzen kommen werden *Sofern man sich das hier auf dem Bildchen mal anschaut. \n*Zitat* \n>WILLKOMMEN IM ESSENZ-WUNDERLAND\n\n>Nach der Umstellung werden einige Spieler Unmengen blauer Essenzen haben, die in ihrer Beute nur einstauben würden. Deswegen haben wir uns etwas Besonderes überlegt. Zu Beginn der Vorsaison, nachdem alle EP in blaue Essenzen umgewandelt worden sind, öffnen wir für kurze Zeit einen „Blaue Essenz“-Shop. In diesem Shop wirst du Dinge wie Augenskins, Chromas und (besonders für unsere Veteranen) sogar ein paar sehr seltene Gegenstände wie den URFWarwick-Skin kaufen können. [Quelle](http://euw.leagueoflegends.com/de/featured/preseason-update)\n\nso wenn man nun die Preise mal bei seite lässt und auch den rest drum herrum finde ich das ganze gar nicht so schlecht. es ist etwas neues was ein kurzzeitlichen Hype auslöst, lass den leuten den spaß doch :)\n\nDesweiteren kann man auch wie fast alles andere die Stickers Deaktivieren.\n**Unter Optionen Oberfläche~Chat ~Gegnerische Emote/Stickers stummschalten**. \nSo kann man auch diese Hype-Phase überwinden und ist davon auch nicht gestört.\nIch denke das neues immer erstmal was komisches ist, aber man gewöhnt sich da schon dran :p\n\nWenn die Emots dann mit den Blauen-Essenzen gekauft werden können werden das sicherlich auch viele machen die hier nun etwas meckern (Was ich absolut nachvollziehen kann) 350RP sind schon extrem viel keine frage. \n\nAber ich hoffe das man nun nicht alles so negativ sieht o:","replies":[]},{"poster":"IcedOutMissplays","date":"2017-10-11T10:47:32.105+0000","up_votes":1,"down_votes":1,"body":"Meiner Meinung nach hätte mindestens noch einen Daumen nach unten dazugehört um auch mal in der Lane aussagen zu können das es was sch*ße ist oder läuft. So ist das mal wieder nur Geldschneiderei aber so finanzieren sich nun mal F2P games. \n\nMfG. GKLP","replies":[{"poster":"manial fly","date":"2017-10-11T12:18:37.805+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GabelkeksLP,realm=EUW,application-id=YnZkMR0R,discussion-id=PIuNyR8l,comment-id=0001,timestamp=2017-10-11T10:47:32.105+0000)\n>\n> Meiner Meinung nach hätte mindestens noch einen Daumen nach unten dazugehört um auch mal in der Lane aussagen zu können das es was sch*ße ist oder läuft. So ist das mal wieder nur Geldschneiderei aber so finanzieren sich nun mal F2P games. \n> \n> MfG. GKLP\n\nDamit es noch ne Möglichkeit mehr gibt zu flamen?","replies":[{"poster":"IcedOutMissplays","date":"2017-10-11T17:08:50.798+0000","up_votes":1,"down_votes":0,"body":"Man kann natürlich alles schlecht reden statt nachzudenken.\n\nNein man könnte damit Leuten zeigen das jetzt ein schlechter Moment für nen engage oder so ist oder einfach nur um kleine dinge wie einen trade zu bewerten dadurch das diese emotes so simple sind sind auch ihre verwendungsmöglichkeiten endlos sind\nzumal wenn dich damit jemand flamen will kannst du die emotes muten \n\ndeshalb meine Bitte statt immer die negativen dinge zu sehen mal versuchen die positiven Aspekte eines konstruktiven Vorschlages zu sehen\n\nMfG. GKLP","replies":[{"poster":"Phazôn","date":"2017-10-11T20:29:12.494+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GabelkeksLP,realm=EUW,application-id=YnZkMR0R,discussion-id=PIuNyR8l,comment-id=000100000000,timestamp=2017-10-11T17:08:50.798+0000)\n>\n> Man kann natürlich alles schlecht reden statt nachzudenken.\n> \n> Nein man könnte damit Leuten zeigen das jetzt ein schlechter Moment für nen engage oder so ist oder einfach nur um kleine dinge wie einen trade zu bewerten dadurch das diese emotes so simple sind sind auch ihre verwendungsmöglichkeiten endlos sind\n> zumal wenn dich damit jemand flamen will kannst du die emotes muten \n> \n> deshalb meine Bitte statt immer die negativen dinge zu sehen mal versuchen die positiven Aspekte eines konstruktiven Vorschlages zu sehen\n> \n> MfG. GKLP\n\nwie zb ich sehe das positive : riot verdient geld\ndas negative                           : ich müsste geld für unnützen scheis ausgeben                 \n{{sticker:zombie-nunu-hearts}} hoffe ich konnte das positiv genug betrachten falls dies dein wunsch war :D","replies":[]}]}]}]},{"poster":"Phazôn","date":"2017-10-11T20:27:08.914+0000","up_votes":1,"down_votes":0,"body":"jetzt ernsthaft der ranz kostet mal wieder nur rp?\n\nwieso nicht mal was für ip  gibt ja nicht genug die seid sehr langer zeit nichts mehr dafür kaufen können\n\nab dem neuen update kaann man wardskins für ip kaufen aber sticker sind so hyped und cool und usefull ..... mom SIE SIND GARKEINE RP WERT!","replies":[]},{"poster":"erdnnussxenton","date":"2017-10-11T20:01:39.413+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-soraka}}  Ich hab mich auch voll gefreut als ich diese Sticker gesehen habe .. einfach zu Cute *Q* aber dann hab ich RP gesehen ... und Geld für sowas? hmmm ne... das lohnt sich echt nicht :( versteh dich zu gut fände es au 100% mit ep besser oder vielleicht als honor Belohnung bzw in Truhen\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Megamaexx","date":"2017-10-11T14:48:04.374+0000","up_votes":1,"down_votes":0,"body":"Wenn niemand dafür Geld ausgeben wird, werden die sicherlich für blaue Essenzen erhältlich sein ;)\nAus jetziger Sicht werde ich mir keine kaufen. Bei den Icons habe ich bisher auch nur eins mit RP gekauft.","replies":[]},{"poster":"Durkheim ","date":"2017-10-11T10:51:51.605+0000","up_votes":1,"down_votes":0,"body":"Naja wenns das dann im Hextechcrafting gibt gehts ja. Im Prinzip hat das nichts mit dem Spiel an sich am Hut also passt es ein bisschen in Ritos konzept...","replies":[]}]}