{"poster":"Gym Leader Koopa","date":"2017-12-27T01:54:25.508+0000","title":"League Freezes then I have to force restart","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Basically, now when I play league it freezes then i have to restart my computer. Sometimes it will stutter and i can catch it b4 it freezes by using ctrl+alt+del and will allow me to continue to play. I don't think its the vid card, no other game has this problem. I run 60 fps on pubg and higher on other games. If anyone has anything i can try or any tips id be grateful. I also have all drivers updated, Nvidia included. thats what im thinking the problem is but im not sure. im also running windows 7.","replies":[{"poster":"pachiporomari","date":"2017-12-27T23:24:44.637+0000","up_votes":1,"down_votes":0,"body":"It sounds like this might actually be more of a connection issue. I know you might be thinking, 'But Pachi, my internet works fine on everything else!' and it's possible for it to work fine on the rest of your programs, but you could still be experiencing an interruption with your network to the server.\n\nMy first suggestion would be to [release/renew IP and flush DNS](https://support.riotgames.com/hc/en-us/articles/201752664#wq10) and see if that helps with your connection. If that doesn't work, there are a few more steps on that guide that could help out, such as making sure you're on a wired connection, checking on packet loss and buffering, or port forwarding.\n\nIf none of the steps on that guide help out, [send a ticket](https://support.riotgames.com/hc/en-us/requests/new) to our Tech team and we'll take a closer look at the issue so we can troubleshoot some more! :)","replies":[]},{"poster":"87870959DEL1","date":"2017-12-27T05:01:41.969+0000","up_votes":1,"down_votes":0,"body":"Are you running any programs related to mouse, headsets, anti virus, desktop display/screen savers programs? Any thing that you recently added?","replies":[{"poster":"Gym Leader Koopa","date":"2018-01-02T00:19:37.906+0000","up_votes":1,"down_votes":0,"body":"I have corsair utility running, and Microsoft security essentials, ccleaner, and that's about it. its so weird tho, league is the only game that does this.","replies":[]}]}]}