{"poster":"Framah","date":"2019-03-13T13:04:32.449+0000","title":"Dealing with Jarvan IV jungle.","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"Hi everyone, in desperate need for some help\r\n\r\nTo give you a bit of context I finished last season at around silver V so that gives you an idea of my skill level as well as those I am playing with. I main Jungle atm mostly playing {{champion:141}}  but branching out into {{champion:20}} , {{champion:516}} , {{champion:5}}  and {{champion:28}} . For the life of me I cannot cope playing against. \r\n\r\nNow usually I like to ban Xin if I'm not playing him or Yi, but everytime I am against a Jarvan I just seem to lose. If I don't ward he just hops over whatever camp I am farming, kills me, takes my camp and then ganks a lane and picks up a kill. If I do ward I'm forced to let him take whatever camp I was working on while spamming ping for someone to collapse on him, either they don't or by the time they arrive Jarvan finishes my camp and then leaps over and gets away. It's just so tilting to play against because he can just walk into my jungle and I have to let him take what he wants because I can't fight him, plus his early game ganks are extremely strong and while I try to counter gank he puts out a lot of upfront damage that my laner is forced to back off instead of collapsing. \r\n\r\nBasically what I'm asking is if there any strategies I can employ to try and deal with him that doesn't rely on my team responding, or if I should give up my ban on Xin/Yi and be forced to us it on Jarvan. I'm not here to complain, I want advice.","replies":[{"poster":"Therzair","date":"2019-03-13T21:32:10.796+0000","up_votes":1,"down_votes":0,"body":"Hey Framah!\n\nI see your problem, although I cannot see what you are doing wrong :( as I have not seen you play.\nHowever, I can give you a few tips that may or may not help you. \n\n1. Warding is very very important it can alert you to when he is coming. \nhttps://i.imgur.com/p6mcMf5.jpg\n\n2. Use your pings to alert others to Jarvins positions. If you know hes coming and your not ready to fight him then ping for help. I know you asked for help in regards so your team doesn't have to come help, but this is a team game. Nothing wrong with a bit of help :)\n\n3.  Counter jungle. If he keeps coming for your camps, go for his instead. Here is a youtube link to show you https://www.youtube.com/watch?v=ZOK1yRzRg54\nhttps://www.youtube.com/watch?v=z0YgszQUPP8\n\nReally good counter jungling video  https://www.youtube.com/watch?v=OyKpEr4QF7w&amp;t=544s\n\n4. Counter pick at champion select.  Have a look at this link https://lolcounter.com/champions/jarvan-iv      you will learn who he is weak against etc.\n\nI hope this somewhat helps you. \n\n{{sticker:slayer-jinx-catface}} \nTherzair","replies":[]}]}