{"poster":"CooolDown","date":"2019-05-29T23:21:15.915+0000","title":"How to play with Yuumi as an ADC?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I lost every solo fight when I was matched up with this champ at bot lane. Please advice?","replies":[{"poster":"CooolDown","date":"2019-06-01T01:01:18.037+0000","up_votes":1,"down_votes":0,"body":"Great and detailed advice:) I guess most of those Yuumi players and myself at our elo just doesn't have the knowledge to get the best synergy of it. I felt that Yuumi is a very underwhelming support. She can pokes a little and heals a little and that is it! I may need to make more use of her passive the next time I play with another one. Thanks for the great advice.","replies":[{"poster":"Ninox","date":"2019-06-02T03:28:01.153+0000","up_votes":1,"down_votes":0,"body":"Yeah she's not the simplest support, and I find a lot of people struggle with generalist champs. Take Lulu for example. A lot of Lulus I play with seem to use their abilities on allies *or* enemies, rather than both. It's like they get stuck in that playstyle and it takes a hot sec to remember that she isn't just a poke support, or isn't just a defensive support, etc.\n\nIf you recall also when Pyke was first released, no-one knew how to play as or with him, and it caused some drama. Then for a while, he was a top pick. Just like Yuumi, it's something new that people have to get used to. Yuumi isn't just another enchanter, in much the same way as Pyke was the first ever assassin support.","replies":[]}]},{"poster":"Ninox","date":"2019-05-30T03:38:29.548+0000","up_votes":1,"down_votes":0,"body":"I couldn't say what exactly applies to you, and I'm a supp main who plays Yuumi not an ADC main, but my main tips would be: (by solo I assume you mean your lane vs theirs without Jng help, but correct me if I'm wrong)\n\nStand in the minion wave not behind it. The reliable way to dodge her Q is to have it hit something else, and being in the wave means you only have to take at most a half step to do that. It also has the added bonus of messing with the enemy ADs cs.\n\nPunish her when she's detached, especially if she detaches early. Early game the cooldown to redetach is high, so if you see her hop off soon after attaching, this is your moment. She has the lowest base health in the game and is very vulnerable on her own. The more you punish her, the less worth her passive is for her ADC, the less she can detach to get it without substantial risk, and the more mana and cooldowns she has to spend on heals.\n\nCC her when she tries to reattach. It puts her W on cooldown and leaves her very vulnerable, and way less useful to her ADC since her Q loses the aim and she can't heal them. The slightest interrupt as she's travelling is enough, and it's reasonably easy to predict when she's trying to retreat.\n\nHer heal is so much stronger when her or her target are below 40% health and it has two charges, but it's also a long cd. Punish her while it's on cd, but when engaging remember that they have at least half a health bar more of effective health that you'll have to cut through.\n\nPredict her ult. This isn't super hard, since if you're gaining on her/them and putting them in danger (or visa versa) she's probably going to use it (it's a low cd and low dmg). Be unpredictable, look like you're going to walk up, then walk down when she ults, she can't change its direction and you'll at least put them in an awkward position.","replies":[{"poster":"CooolDown","date":"2019-05-31T04:10:04.320+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply but I was asking how to play with Yuumi together and not against her.","replies":[{"poster":"Ninox","date":"2019-05-31T09:43:30.593+0000","up_votes":1,"down_votes":0,"body":"Ohhhhhhh yeah I see how I misread that. Ok then take 2!\n\nHer attach range is pretty long, but try to stay within it so she can jump back to you quick. If possible try to put her path behind minions to help protect her from damage and CC while she's travelling. Really just an extra facet to positioning.\n\nYuumi's will often take Heal/Exhaust and Ignite instead of having Flash. This is good for you, since you get an extra summoner in lane, but means making yourself available for her attach is that much more important. They often don't build boots either, so without an ally, they just aren't going to get out. She can attach over walls, so use that to your adavantage.\n\nHer Q fires from your position, so don't stand on top of minions, or she won't be able to poke. Once it's out, you'll see the range indicator for it. If the enemy is moving out of range, move up with them (assuming it's reasonably safe to do so. Don't let her Qs peter out at max range for no reason, put the enemy in range for her.\n\nA good Yuumi will be jumping out to auto every time her passive is up. When she jumps back in with that passive shield, that's when you go aggressive. That shield isn't timed, it lasts until it breaks, but you should be using it where you can (i.e use the shield before her passive is back up). So if you have the shield, time to poke.\n\nHer heals work better when you are lower health, so don't be surprised if they aren't always just topping your health off. Know that you have that extra health in fights, but once those charges are up she doesn't have much to protect you.\n\nYuumi is a generalist. She's good at a lot of things, but doesn't excel at any of them. She has CC, poke, engage, disengage, mobility, heals and shields, but not the best of any of those things. What this means is that she is very versatile, but also not as strong in hard engages as champs more designed for it. A Nami will have better CC, a Soraka better sustain, etc etc. Basically, be aware of your matchups, and where her strengths lie in relation to that.\n\nShe is also quite niche, reasonably complicated, and requires a deeper knowledge of bigger picture type stuff than most enchanter supports that can can get by much better on just pressing buttons on their ADC and watching the map. The short version: she has a higher skill curve than most supports. Some people will just be bad with her, and often those that do bad, will do *very* bad. The best advice I can give in this case is just to make do with what you've got and don't rely on her too much, which holds true for any champ really, just more so the high skill cap ones.","replies":[]}]}]}]}