{"poster":"DerkleineEisbär","date":"2019-02-21T15:40:22.017+0000","title":"\"Dein Konto wurde in eine andere Region übertragen\"","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi Ihr :3 \r\nHat vielleicht noch jemand das Problem, dass er sich seit dem Patch heute nicht mehr anmelden kann, da sein Konto angeblich in eine andere Region übertragen worden ist?\r\nIch poste das hier unter meinem Zweitaccount, der mit der selben Mailadresse erstellt wurde, da mein erster nun nicht mehr verfügbar zu sein scheint, auf keinem der Server. Ich habe weder eine Mail im Postfach zu einem Serverwechsel noch etwas zu Passwort-/ Mailänderungen, daher finde ich es auch etwas merkwürdig, dass meine bisheriger Kontodaten auf keinem der Server funktionieren. Beim Anfordern eines Passwortresetlinks kommt bei meiner Email genau nichts an, egal in welcher Region. In EUW jedoch verweigert er es da das Konto in eine anderen Region übertragen worden ist ...\r\nVor dem Patch ging alles noch ohne Probleme. \r\nClient neugestartet -> Anmelden wollen -> \"Dein Konto wurde in eine andere Region übertragen\"\r\n\r\nVielen lieben Dank für Eure vielleicht hilfreichen Tipps &amp; ähnlichen Erfahrungen.","replies":[{"poster":"Auulay","date":"2019-02-22T03:02:50.682+0000","up_votes":1,"down_votes":0,"body":"Melde dich damit direkt beim Support: https://support.riotgames.com/hc/de/requests/new\nEventuell ists nur ein komischer Account fehler, oder jemand hat deinen Account gestohlen, was mir mal nicht hoffen wollen.","replies":[{"poster":"DerkleineEisbär","date":"2019-02-22T12:38:45.179+0000","up_votes":1,"down_votes":0,"body":"Hab ich schon, das merkwürdige ist, dass meine anderen Accounts unter der gleichen Mail nicht betroffen sind. Auch dass die Tickets des Accounts einfach dem Anderen zugewiesen worden sind ist etwas merkwürdig ... \nBeim Support gemeldet habe ich mich schon vor etlicher Zeit, bisher aber noch überhaupt keine Antwort erhalten, nicht einmal eine automatisierte. Ich hoffe das liegt nicht daran, dass mein neuer Account eben nicht Challenger oder über Level 30 ist, sonst war der Support eigentlich immer top.","replies":[{"poster":"Elthision","date":"2019-02-23T15:59:10.330+0000","up_votes":1,"down_votes":0,"body":"Zur Zeit braucht der Support gerade etwas mehr Zeit zum Bearbeiten der Tickets.\n\nDenk daran, dass du nicht auf deine eigenen Tickets antworten solltest, bevor ein Support darauf geantwortet hat - sonst wird dein Ticket wieder an das Ende der Warteschlage befördert und die Wartezeit beginnt erneut.\n\n> Ich hoffe das liegt nicht daran, dass mein neuer Account eben nicht Challenger oder über Level 30 ist\n\nUm ein Account-Wiederherstellungs-Ticket zu schreiben muss man sich ausloggen und eine E-Mail-Adresse angeben.\nInsofern hat dein neuer Account nichts mit dem Ticket zu tun.","replies":[{"poster":"DerkleineEisbär","date":"2019-02-23T19:06:28.103+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elthision,realm=EUW,application-id=7hciEY9w,discussion-id=kT675WAi,comment-id=000000000000,timestamp=2019-02-23T15:59:10.330+0000)\n>\n> Zur Zeit braucht der Support gerade etwas mehr Zeit zum Bearbeiten der Tickets.\n> \n> Denk daran, dass du nicht auf deine eigenen Tickets antworten solltest, bevor ein Support darauf geantwortet hat - sonst wird dein Ticket wieder an das Ende der Warteschlage befördert und die Wartezeit beginnt erneut.\n> \n> Um ein Account-Wiederherstellungs-Ticket zu schreiben muss man sich ausloggen und eine E-Mail-Adresse angeben.\n> Insofern hat dein neuer Account nichts mit dem Ticket zu tun.\n\nNaja, nachdem der Support mir sonst immer innerhalb eines Tages geantwortet hat und mir nun seit drei Tagen überhaupt keine Antwort gibt, spricht in mir die Vermutung dass Accounts mit keiner entsprechenden History benachteiligt behandelt werden.","replies":[]}]}]},{"poster":"DerkleineEisbär","date":"2019-02-23T15:44:24.152+0000","up_votes":1,"down_votes":0,"body":"Tag 3 Ohne LoL Account :(","replies":[]}]}]}