{"poster":"Eternal Torment","date":"2020-01-24T21:25:10.549+0000","title":"I don't think the \"200 years of collective experience\" is actually a true statement, I did the math","subforum":"General Discussion","up_votes":13,"down_votes":14,"body":"The Infamous statement that has been Riot's latest excuse states that the Dev team is confident in the bullshit they serve by \"Having 200+ years of collective experience over 20+ employees\"\r\n\r\nDidn't really sound right to me, so I did some math...\r\n\r\n#THE GRAMMATIC DEFINITIONS:\r\n\r\nFirst, I had to take the highest numbers that would be correct on a grammatic level so that misunderstandments would be avoided. The words used were 20+ and over 200.\r\n\r\n- First, the employee number: 20+ would mean between 20 to 25, since 26 to 29 would of gone under \"Around 30\" since \"Around (X Number)\" stands for X number and it's values from the next lowest to next highest Median of numbers multiplied by 10, in this case from 26 to 35. So, the highest grammatically correct value of Employees to take would be 25 employees.\r\n\r\n- Then there is the years of experience. For this, I took the lowest number available, which would be 200, since Over 200 implies any number between 200 to 299, and the lowest being 200, duh.\r\n\r\n#THE MATHS:\r\n\r\nSo the values are 25 Employees who together have 200 years of experience. Divide 200/25 and you get 8 years of experience per employee, assuming every single one of them worked at the exact same time, the exact same duration, every single day, 365 days of a year. (Again, disregarding every 4th 366 day-year)\r\n\r\nSo if we subtract the amount of annual vacations they are promised via Lawful Obligations, they have 4 - 5 weeks per year of vacations, let's take 5 and assume they got 2 weeks summer break. Remove also a total of 11 days for all the Holidays (That I know of in America) (Excluding christmas season, already included in 1 of the 5 weeks of Vacation) and remove all the weekends (Saturday and Sunday), and you get a rounded up 52'097 true work days.\r\n\r\nDivide 73'000/52097 and you get a n-factor of 1.401 (73000 being the amount of days in 200 years if you account all 365 days a year, excluding every 4th 366 day-year)\r\n\r\nMultiply 8 with that Factor n, being 1.401 and you get 11.208 Years of true work days for Experience.\r\n\r\nThe game has only been out for a bit over 10 years, so if we accumulate all true work days and put them into proper Value of Experience by Years, compared with the statements given, then each employee would have had to been employed for 11.208 years of Work Days.\r\n\r\nAnd that's assuming the maximum number of employees with the minimal number of years of cummulative experience, meaning that 11.208 years is the *smallest* number of True value.\r\n\r\nAnd even if we wanna be friendly and say \"Okay, let's just take the lower number\" it still means each and every single one of those Employees would have had to be working in league's dev team for 8 years uninterrupted, provided they all started at the very same day. And we all know that some of them had to be either moved or were replaced entirely, such as good ol' Morello, meaning there were indeed interruptions in the span of Worker-experience by Employee.\r\n\r\n#CONCLUSION:\r\n\r\nTheir excuse is utter bullshit. I did the math. And I will give them the benefit of doubt and say No chance in hell was every single one of them working for 8 years and some and managed to not listen to the community **ONCE**.","replies":[]}