{"poster":"shdwzone","date":"2016-09-30T01:03:17.560+0000","title":"BARD IS LIFE","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Hello Everyone.\r\nI thought id take a bit of time and talk about  {{champion:432}}  and see what what everyone else thinks of him currently.\r\nI feel People vastly underestimate Bard&#039;s versatility, and i was hoping to get some insight on what everyone else think&#039;s.\r\nSo id like to discuss the following:\r\n\r\nWhat role does he/you play in a team composition when playing Bard?\r\n\r\nWhat are the core items you built on him?\r\n\r\nWhat are your  rune/mastery setups?\r\n\r\nWhat champions do you think synergize well with bard?\r\n\r\nWhat is the counterplay against him?\r\n\r\nOut of all the supports where do you see him placed in rank/efficiency \r\n\r\nNow I know you can google all of this and it can be very extensive and situational , but non the less id love to heard what you all think on him as a champion and his roles in a team.\r\n\r\nSo feel free to chime in with your thoughts.\r\n\r\nCheers Shdw {{champion:432}}","replies":[{"poster":"Requiemsfire","date":"2016-10-02T00:19:32.909+0000","up_votes":1,"down_votes":0,"body":"He acts as a disengager, an initiator, a disruptor, a diver, a healer, a strong roamer, a tank, burst mage and provides some mobility to his team in the jungle. \n\nI play him as support and he does take some practice to use properly as opposed to other supports who are relatively easy to pick up.\n\nHis Q is very basic yet also very potent, it's ability to stun if it connects with a wall or a minion means it can be very unpredictable as to how you use it. It's base damage is really high at level 1, he has half an ADC's health bar with AA>Q>AA thunderlords proc alone.\n\nHis R is arguably the most versatile spell in his kit in the game in that it can disrupt an entire backline, catch out stray targets from a mile away, it can be used to cancel channel abilities like miss fortunes ultimate, lock out priority targets from a fight and disengage from unwanted battles.\n\nPersonally I build {{item:3092}}  {{item:3190}} {{item:3110}} {{item:3117}} {{item:2045}}  as core due to playing him in the support role.\n\nHis greatest weakness is ranged CC or lane bullies that will be able to punish his short range with a lot of damage if he messes up and that while he can use his magical journey to pass through walls, he is not the fastest champion nor is he truly uncatchable. ","replies":[]},{"poster":"Glow","date":"2016-09-30T21:01:02.413+0000","up_votes":1,"down_votes":0,"body":"I know very little about the support role and haven't played much with a Bard so here goes nothing:\n\nA pick support, what with his slow/stun and ulti. Also a fair bit of roaming going on.\n\nAbsolutely no idea with items (without googling). Movespeed/health/standard support items?\n\nI feel like Cait would be nice with him, and maybe Ez for a heavy poke lane.\n\nCounterplay might be hard cc/bursting him down. Also not getting baited into his magical journeys of death where his team is on the other side.\n\nRank and efficiency really depends, as his ulti is a unique skill and how he uses it absolutely determines how effective he is. When you consider its potential to turn baron/dragon plays, allow turret dives etc then he can have a huge impact. If he's just using it as a zhonya to save teammates then maybe not so much.\n\nWhat are your thoughts on him?","replies":[]},{"poster":"Nightjar","date":"2016-09-30T05:27:28.596+0000","up_votes":1,"down_votes":0,"body":"For me he's a tank with loads of utility. His chimes do decent base damage and I take him as a tank support since it can be hard to position to land his stun if you can get blown up quickly. His ult is very good for isolating people, catching them out or really any number of things since it's so flexible. Personally I go 0-18-12 for thunderlords. My runes are early ap dueling power since he can be a really lane bully early on with his meeps, with some flat ap quints, flat mr blues, armour seals and either ad marks or magic pen marks.\nMy build is just straight up as tanky as possible though if I don't have many chimes early on I may switch frozen heart for the frozen gauntlet.\n{{item:2301}} {{item:3110}} {{item:3190}} {{item:3102}}{{item:3143}}  {{item:3117}} \nMy other build is more ap focused\n{{item:2301}} {{item:3060}} {{item:3050}} {{item:3100}}{{item:3151}}  {{item:3009}} \n\nI feel he's a decent support with alot of utility if used right and is very good if you are confident you can carry the botlane with him, but he can be situational depending on the enemy picks, especially if they have alot of early kill pressure. He's a very aggressive support but he also has good roaming. He's about average as support champions go though unless you have a skill advantage over the enemy team.","replies":[]}]}