{"poster":"Zetâ","date":"2015-11-23T21:43:25.111+0000","title":"Riven meine Ehefrau der Kluft","subforum":"Champions & Gameplay","up_votes":1,"down_votes":6,"body":"1.\n\nSeit einem gewissen Zeitraum steht ein Riven Nerf im Raum der mich besonders St&ouml;rt. Das ist aber nicht das einzige sondern auch abgebrochene &Auml;nderung (oder aufgeschoben , man wei&szlig; ja nicht) st&ouml;ren mich sehr.\nIch komm direkt zur sache\nCOOLDOWN 110/80/50 seconds &rArr; 130/95/60 seconds \nFinde ich pers&ouml;nlich sehr Krass was einen Nerf angeht. Das mag f&uuml;r manche verr&uuml;ckt klingen doch ich Spiele Riven sehr h&auml;ufig und seit dem Nerf f&uuml;hle ich mich auf der Lane unsicher. Sobald man einmal ab lvl 6 oder 7 die Ulti raus hat sei es ein Teleport gank oder ein sonstiger g&uuml;nstiger Moment um das gegnerische wesen zu zerst&ouml;ren steht man erstmal ganz sch&ouml;n bl&ouml;d da.\nMan geht zur&uuml;ck auf die Lane und wartet und wartet und wartet bis man einem Engage des Gegenspielers bestrafen kann.\nIch finde man hat hier Riven ihre lane und roam Dominanz genommen und der Gegenspieler hat ein einfaches Comeback von dem missplay ( so doof es doch klingt wo es &quot;nur&quot; 20 sekunden sind. )\nDas ist nur meine pers&ouml;nliche Meinung und ich finde das wenn Riven generft werden soll, das der falsche weg sei..\nMann kann jetzt zwar mit der CDR &auml;nderung in den Masteries auf 45% CDR kommen aber als Riven sollte man schon in den Attack Tree gehen au&szlig;erdem dauert es seine zeit bist man full CDR ist um auf der 3.ten Stufe auf 33 sekunden Cooldown ( mit 5% mastery ) zu kommen.\nDa versteh ich es nicht warum Yasuos Ult ( welche viel mehr Impact hat ) hier einen so geringen Cooldown aufweist.\nDer vergleich ist nicht gut aber der |Schaden x CC| stimmt mit den Schaden von Riven ungef&auml;hr &uuml;berein.\n\nWas haltet ihr davon \n2.\n\nWarum wurde die neue Riven &auml;nderung mit den Edge&acute;s nicht &uuml;bernommen ? \nEinfache Frage.\nhttps://www.youtube.com/watch?v=k1UfGvq9A-8\nRechtschreibfehler k&ouml;nnt ihr Behalten {{champion:36}} \nBitte keine {{item:3070}}","replies":[{"poster":"ÆonFox","date":"2015-11-23T21:52:39.266+0000","up_votes":2,"down_votes":0,"body":"Es ist einfacher geworden an CDR zu kommen, das Schwarze Beil wurde auch weiter von den Tanks entfernt zu den Bruisern, auch Tanz des Todes ist wie für Riven gemacht, gib ihr noch den Schlund von Malmortius und Panzer des toten Mannes und du erhälst eine Riven die neben massig Schaden auchnoch Tanky ist wie sonstwas...\nGieb der Änderung eine Chance, lass sie auf dich wirken und versuch für dich die Vorteile zu finden und auszunutzen...\n\nBtw meine Ehefrau..... Sicher nicht.....","replies":[{"poster":"Gregor Gysi","date":"2015-11-23T22:02:54.617+0000","up_votes":1,"down_votes":1,"body":"Die Item changes sind eher schlecht für Riven. Generell sind die Items teurer geworden, d.h. sie kann nicht mehr so leicht snowballen - auch wenn ihr Lategame so leicht gestärkt wurde. Weiterhin scheint mir Tanz des Todes etwas merkwürdig für Riven, da sie so Schaden bekommt, auch wenn sie Burst mit ihrem Schild abwehrt - kann aber auch vorteilhaft sein, wenn sie es nicht schafft etwas zu blocken. \nDas Hauptproblem ist allerdings, dass unser Lieblingsitem l33t aus dem Spiel genommen wurde. Es gibt auch kein Äquivalent um für wenig Gold CDR, flat armor pen und AD zu bekommen. Das führt alles dann dazu, dass RIven tatsächlich die Buffs benötigt, die sie wohl in 5.24 und evtl. weiteren Patches bekommen wird.","replies":[{"poster":"ÆonFox","date":"2015-11-24T00:17:47.732+0000","up_votes":2,"down_votes":0,"body":"{{item:3142}} ... Daneben hat {{item:3156}} auchnoch Pen bekommen...\nEine Riven mit {{item:3142}} {{item:3071}} {{item:3156}} {{item:3812}} {{item:1001}} (deiner Wahl) und {{item:3742}}  hätte 40% CDR, FlatArP, Doubleliferegain, MR, Armor und AD ohne Ende, zu tanky um leicht gekillt zu werden und viel zu viel Schaden um ignoriert zu werden...\n\nDass es den Brutalisierer nichtmehr giebt ist doch kein Nachteil, es muss nur anders an die Sache herrangegangen werden...","replies":[{"poster":"Gregor Gysi","date":"2015-11-24T15:43:42.863+0000","up_votes":1,"down_votes":0,"body":"Inwiefern ersetzen Endgame Items den Brutalisierer? Ich habe nie behauptet, dass Riven irgendwie Probleme hat insgesamt an CDR/Armor Pen oder sonst etwas zu kommen. Das Problem ist, dass Riven im Early/Midgame (also Rivens starken Phasen, in denen man versucht so viel wie möglich rauszuholen) nicht mehr diese perfekte Mischung aus CDR/AD/PEN gegen die Toplane Bruiser hat. \nDie Endgamebuild ist vollkommen irrelevant, da man im Idealfall so weit nicht kommt, sondern vorher schon gewinnt. Wie willst du mit diesen Items an early CDR und arPen komen? Du brauchst mindestens 2200 Gold für die {{item:3142}} Komponenten - und musst damit Ghostblade eigentlich auch gleich ausbauen.\nDamit verlierst du die Flexibilität Brutalizer -> {{item:3155}}  ODER {{item:3074}}  ODER {{item:3071}}.\nDie neue Build ist langsamer, teurer, weniger flexibel und somit überhaupt nicht, was Riven braucht. Jetzt mal ganz abgesehen davon, dass man jetzt sowieso schon kaum early CDR hat, da die Masteries geändert worden sind - das verschärft die ohnehin schon prekäre Lage.","replies":[{"poster":"ÆonFox","date":"2015-11-24T18:30:38.187+0000","up_votes":1,"down_votes":0,"body":"Der Brutalisierer war ansich nicht gut designt, er hatte viel zu viele Werte für ein Voritem was den Ausbau erschwehrt hat, du musst jetzt hald genauer schauen ob du als erstes die CDR oder die Pen brauchst.\nEs ist eigentlich nicht so schwehr sich anzupassen wenn man dazu bereit ist, andere jammern nur den alten Begebenheiten hinterhehr...\nDie Neuen Meisterschaften sind für Riven nahezu OP und das du nun 5% statt 5% nehmen kannst wenn du willst....\nSchonmal erlass des Donnerfürsten auf ihr Probiert?","replies":[{"poster":"Gregor Gysi","date":"2015-11-24T21:35:07.736+0000","up_votes":1,"down_votes":0,"body":"In Anbetracht dessen, dass AD Caster aktuell die schlechteste Itemauswahl haben und alle AD Caster CDR&Pen brauchen, hätte man sehr leicht weitere Ausbauitems hinzufügen können.\nNatürlich passe ich mich den Gegebenheiten an, allerdings ist es ein Fakt, dass Riven nun deutlich schlechter dasteht als vor den Nerf. Oder meinst du wirklich, dass Riven auch nur ansatzweise stark ist, wenn selbst die-hard Mains nicht einmal eine 47%ige Winrate haben? -> champion.gg\n\nTief in den Cunning Tree zu gehen lohnt m.E. nicht. Die AD Skalierung ist recht gering und man verliert 7% arPen. Sollte man in der Midlane gegen Squieshys fighten/Yasuo Top erwischen dann geht es vielleicht. Aber Riven TOP braucht definitiv den Ferocity Tree und hat damit keine 5% CDR. \n\n5.23 tut Riven allerdings insgesamt gut und spätestens in 5.24 sollte sie wieder recht viable sein, da dann diverse Mages generft werden, die stark gegen Riven sind.","replies":[{"poster":"ÆonFox","date":"2015-11-25T00:42:04.611+0000","up_votes":1,"down_votes":0,"body":"Das {{item:3071}} ist noch näher an ADCaster herrangerückt, der {{item:3156}} wurde hart gebufft, {{item:3142}} ist nicht schlechter geworden, {{item:3158}} sind OP und es giebt neu den {{item:3812}} , nur der Brutalisierer wurde weil er für ein Zwischenitem zu viele Werte trug verändert, alles in allem sind sogar mehr Items die für ADCaster interressant sein könnten zur Verfügung.\n\nIch bin kein großer Riven Spieler aber ADCaster sind in meinem Repertoire tief verankert und alles in allem ist vieles einfacher/übersichtlicher geworden.\n\nVersuchs dochmal mit Erlass des Donnerfürsten, diese Mastery ist ein auf 3 Schläge ausgelegtes Kampftool und wurde jetzt sogar nochmal gebufft, zudem ist dieser Schaden Magisch und kann dich durch die Zeit mit wenig arPen führen wärend du den CDRTeil vom Ghostblade baust...\n\nBtw Einschätzungen können sich als Falsch herrausstellen, das habe ich auchschon oft erlebt und wird durch über den Tellerrand blicken gemildert.","replies":[{"poster":"Gregor Gysi","date":"2015-11-25T14:03:43.199+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n> Das {{item:3071}} ist noch näher an ADCaster herrangerückt\n\n500 Gold mehr (besser für's lategame, schlechter für early/mid)\n100 HP weniger (kann Riven durchaus gut gebrauchen)\n15 AD mehr (kann Riven sehr gut gebrauchen)\nInsgesamt: fullbuild buff, early/mid nerf\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n>der {{item:3156}} wurde hart gebufft\n\nAuf jeden Fall sehr gut, wenn man gegen APler spielt (gerade das Kennen matchup profitiert davon).\nAber das Item ist abgesehen von einem Ausnahmefall relativ weit hinten in der Build order.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n>{{item:3142}} ist nicht schlechter geworden, \n\nTeurer, mehr AD. Wenn es brutalizer noch gäbe, wäre das Item großartig.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n> {{item:3158}} sind OP \n\nEarly CDR boots = schlechtere combat stats - lategame gibt es bessere Möglichkeiten die 40% zu treffen - obendrein sind die Tabi sehr stark. Aber warum reden wir über die CDR boots, die haben sich doch nicht geändert?\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n>  und es giebt neu den {{item:3812}}\n\nDessen Nutzen für Riven wie gesagt sehr ambivalent ist.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n>nur der Brutalisierer wurde weil er für ein Zwischenitem zu viele Werte trug verändert, alles in allem sind sogar mehr Items die für ADCaster interressant sein könnten zur Verfügung.\n\n{{item:3035}}  ist jetzt shit für AD Caster, damit wären wir bei -/+ 0, selbst wenn wir {{item:3812}} mitzählen.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000000100000000000000000000,timestamp=2015-11-25T00:42:04.611+0000)\n>\n> Btw Einschätzungen können sich als Falsch herrausstellen, das habe ich auchschon oft erlebt und wird durch über den Tellerrand blicken gemildert.\n\nUnd wieso nimmst du an, dass das nur für mich gilt?","replies":[{"poster":"ÆonFox","date":"2015-11-25T14:28:35.571+0000","up_votes":1,"down_votes":0,"body":"{{item:3158}} wurden verändert...\n\n> Und wieso nimmst du an, dass das nur für mich gilt?\n\nWeil ich schon einige Rivens habe, härter als jeh zuvor, rasieren sehen, es ist ohne weiteres möglich und daher gehe ich davon as das dir bei deiner Spielweise was entgeht...","replies":[{"poster":"Gregor Gysi","date":"2015-11-25T21:37:06.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=000000010000000000000000000000000000,timestamp=2015-11-25T14:28:35.571+0000)\n>\n> {{item:3158}} wurden verändert...\n\nAh stimmt. Da die Booties billiger sind, ist das nicht übel.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=000000010000000000000000000000000000,timestamp=2015-11-25T14:28:35.571+0000)\n>\n> Weil ich schon einige Rivens habe, härter als jeh zuvor, rasieren sehen, es ist ohne weiteres möglich und daher gehe ich davon as das dir bei deiner Spielweise was entgeht...\n\nDas mit dem härter als je zuvor bezweifel ich ja, aber natürlich kann Riven noch rasieren.\nAnsonsten schau dir halt meine match history an, wenn du glaubst, dass es an meiner Spielweise liegt.","replies":[{"poster":"ÆonFox","date":"2015-11-26T07:22:05.873+0000","up_votes":1,"down_votes":0,"body":"> Ah stimmt. Da die Booties billiger sind, ist das nicht übel.\n\nHast was übersehen.\n\n> Das mit dem härter als je zuvor bezweifel ich ja, aber natürlich kann Riven noch rasieren.\n\nIch kenne 2 begeisterte Rivenspieler und die beiden haben sich schon einige Zeit mit den Änderungen angefreundet und kommen prima darauf klar, an deren Spielweise könnte natürlich mehr Flexibilität sein, wer weiß...","replies":[{"poster":"Gregor Gysi","date":"2015-11-26T10:28:14.478+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=00000001000000000000000000000000000000000000,timestamp=2015-11-26T07:22:05.873+0000)\n>\n> Hast was übersehen.\n\nMacht aber keinen großen Unterschied.\n\n> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=00000001000000000000000000000000000000000000,timestamp=2015-11-26T07:22:05.873+0000)\n>\n> Ich kenne 2 begeisterte Rivenspieler und die beiden haben sich schon einige Zeit mit den Änderungen angefreundet und kommen prima darauf klar, an deren Spielweise könnte natürlich mehr Flexibilität sein, wer weiß...\n\nNur weil ich feststelle, dass Riven in 5.22 sehr schwach ist und in 5.23 auch UP ist, heißt das nicht, dass ich persönlich schlechte Ergebnisse mit Riven einfahre. Andersherum ist es auch kein Beleg für Rivens Stärke, dass du irgendwelche Freunde hast, die passabel mit Riven sind.","replies":[{"poster":"ÆonFox","date":"2015-11-26T15:33:49.568+0000","up_votes":1,"down_votes":0,"body":"Ich finde 25% Abklingzeitverringerung auf deine Beschwörerzauber sind zielmlich krass...\n\nNun da ich welche kenne die mit Riven gut Spielen und teilweise sogar von leichten Buffs reden ist damit aber auch kein Beleg für Rivens vermutete Schwäche...","replies":[{"poster":"ÆonFox","date":"2015-11-26T16:55:34.129+0000","up_votes":1,"down_votes":0,"body":"So viele die sich noch nicht anpassen konnten...\nIn Folge wird Riven gebufft werden und ist dann absolut OP...","replies":[]},{"poster":"Gregor Gysi","date":"2015-11-26T15:59:41.945+0000","up_votes":1,"down_votes":0,"body":"champion.gg Daten für 5.22:\n\nRiven least improved champion (-31)\navg. winrate: 43.82%\nwinrate für Rivenspieler mit 125+ games: 46.89\nWinrate drop um 8%\n\n'Vermutete Schwäche'","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Zetâ","date":"2015-11-23T21:59:27.961+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=NeoDesertfox,realm=EUW,application-id=Wj1wcocU,discussion-id=iQAAIwh6,comment-id=0000,timestamp=2015-11-23T21:52:39.266+0000)\n>\n> Es ist einfacher geworden an CDR zu kommen, das Schwarze Beil wurde auch weiter von den Tanks entfernt zu den Bruisern, auch Tanz des Todes ist wie für Riven gemacht, gib ihr noch den Schlund von Malmortius und Panzer des toten Mannes und du erhälst eine Riven die neben massig Schaden auchnoch Tanky ist wie sonstwas...\n> Gieb der Änderung eine Chance, lass sie auf dich wirken und versuch für dich die Vorteile zu finden und auszunutzen...\n> \n> Btw meine Ehefrau..... Sicher nicht.....\n\nRiven is my waifu q_q\n\nIch finde man muss nicht alles ändern. Tanz des Todes ist aber ganz witzig ja.","replies":[{"poster":"ÆonFox","date":"2015-11-24T00:10:40.985+0000","up_votes":2,"down_votes":0,"body":"Es muss sich immer alles verändern. LoL ist ein Spiel das ohne stetigen Fluss an Veränderungen nicht Balancebar wäre, der stetige Wandel ist die Balance.\n\nWaifu? SER???","replies":[]}]}]},{"poster":"XxFeedMeMore","date":"2015-11-27T07:56:18.618+0000","up_votes":1,"down_votes":0,"body":"Bin ich froh das ich mich 0 für riven intressiere da ich\nA den champ net spiele\nB ich sie eigtl immer zerstöre da ich mit meinen mains 0 probleme gegen sie hab\nC sie einfach net tanky genug ist um einen guten focus zu überleben","replies":[]},{"poster":"Zêph","date":"2015-11-24T18:16:53.862+0000","up_votes":1,"down_votes":0,"body":"Oha Riven \"Main\" hier am start :D nene nur Spaß spiele sie selber oft genug um zu bemerken,dass der Nerf garnicht so hart ist wie alle denken. Ist schon ein bisschen nervig weil man's ja gewohnt ist,dass man die Ult nach einem Kill schnell wieder ab hat aber naja. Früher fand ich den \"Mini\"-Cooldown auf der Ult echt schon zu stark. Zum zweiten Punkt: es war einfach zu OP. In manchen anderen Videos in denen man diese Änderung sieht,sieht man,dass das übelst stark war. Eigentlich schon ZU stark. Deswegen wurde es nicht implementiert und das finde ich auch gut so.","replies":[]},{"poster":"Kata Ga Kill","date":"2015-11-24T10:02:33.558+0000","up_votes":1,"down_votes":0,"body":"Spiele selber Riven ganz gerne aber habe keine Probleme mit der CD Ulti Nerf. \n\n{{item:3071}} {{item:3158}} {{item:3812}}  \nmachen sie schon fertig gebaut der Rest ist nur noch Schadenspitze aufstocken.\n{{item:3074}} {{item:3072}} {{item:3036}}","replies":[]},{"poster":"Schesam","date":"2015-11-23T21:54:40.531+0000","up_votes":1,"down_votes":0,"body":"Riven muss nicht umbedingt in den 1. Baum gehen, die Keystones sind zwar nicht schlecht, jetz aber auch nicht wirklich ein muss.\n\nIch würde auf ihr einfach auf den Thunderlord oder Stormraider gehen, ersteres mehr dmg und zweites mov-Speed. Kann man beides auf ihr gebrauchen, einfach mal ausprobieren. Dann kann man auch die 5% CDR mitnehmen, wenn man sie umbedingt haben will","replies":[]}]}