{"poster":"IF Six","date":"2016-03-04T15:17:30.919+0000","title":"Hola soy un numero mas que consume de esta empresa multinacional Riot Games, Inc.","subforum":"Off-topic y temas personales","up_votes":20,"down_votes":12,"body":"Bueno antes que nada me presento, Hola soy un numero mas que consume de esta empresa\r\nmultinacional Riot Games, Inc.\r\n\r\nAntes de explayarme, les comento que es la primera vez que abro una discusi&oacute;n, que tambi&eacute;n le&iacute; el\r\nreglamento del foro y espero no borren el post.\r\n\r\nTambi&eacute;n cabe recalcar que es un reclamo y queja (aunque mas de esta ultima), as&iacute; que fans de riot abstenerse a comentar.\r\n\r\n\r\nHace como 4 a&ntilde;os y poco mas, un amigo me presenta este maravilloso juego. En ese momento era todo una novedad un moba \r\ncon un laucher, un sistema de b&uacute;squeda, emparejamiento seg&uacute;n el elo, etc. Lo &uacute;nico &quot;feo&quot; en ese momento era que cuando \r\nempezabas tenias una trsite rotaci&oacute;n semanal de 10 campeones, el resto los tenias que ir &quot;comprando&quot; y algunos ven&iacute;amos\r\nacostumbrados a otra cosa.\r\n\r\nEn ese momento no era tan conocido, aunque ya se estaba jugando el segundo mundial que si mal no recuerdo lo gano TPA.\r\nAs&iacute; que los que viv&iacute;amos de este lado del mundo solo ten&iacute;amos la posibilidad de jugar en un servidor, NA.\r\n\r\nMi estad&iacute;a alla fue solo de un a&ntilde;o. Se tenia un ping elevado, pero jugable 130ms o algo as&iacute;. Al menos durante ese \r\ntiempo no experimente ca&iacute;das del servidor, &quot;partidas Fantasmas&quot;, ni subidas de ping extremas.\r\n\r\nSi recuerdo que una semana y media el servidor estuvo en mantenimiento sin tirarlo, lo cual se hacia muy dif&iacute;cil jugar\r\npero al finalizar este, RIOT como buena empresa en plena expansi&oacute;n auge-econ&oacute;mico nos dio a todos los usuarios que jugamos\r\ndurante esa semana RP de regalos, &iexcl;SI RP GRATIS!\r\n\r\nCuriosamente y en me experiencia alla, la comunidad no era tan toxica. Si bien toxicidad hay por todos lodos, al menos \r\nyo lo notaba menos. Alg&uacute;n &quot;TACO TACO&quot; te com&iacute;as pensando que eras Mexicano. Por otro lado se ve&iacute;a much&iacute;simo mas los listones,\r\ncintas o lo que sean, si esas que pensas que son un mito la verde, la amarrila, la roja y la azul\r\n\r\nUn d&iacute;a como todos logueo, y me sale un anuncio que ocupaba 3/4 del launcher, en espa&ntilde;ol, que anunciaba la apertura de un nuevo servidor\r\nen LAS. Cree una cuenta testee ping (39ms) , y no dude mucho mas en transferir la cuenta.\r\n\r\nEl primer a&ntilde;o, perfecto. No recuerdo haber tenido muchos problemas, a excepci&oacute;n del t&iacute;pico choque entre Argentinos y Chilenos, que\r\nno es nada raro, ya que en otros juegos lo es entre Argentinos, Brasileros, Chilenos, Peruanos, etc.\r\n\r\nLo divertido de LAS es durante estos dos &uacute;ltimos a&ntilde;os, realmente no recuerdo o mejor dicho no puedo contabilizar la cantidad de veces\r\nque funciono mal este servidor. Ping extremadamente alto, partidas fantasmas, ca&iacute;das, inestabilidad, falta de compromiso por parte RIOT\r\na todos nosotros que somos CONSUMIDORES, ausencia y claridad en las respuesta.\r\n\r\nMuchos podr&aacute;n decir, pero si es gratis, por que te quejas..\r\n\r\nPrimero me quejo, porque se puede y lo permite el reglamento de este foro.\r\n\r\nSegundo me quejo, porque aunque adquirir y no tener una cuota mensual/anual, no significa que no gaste dinero/tiempo en el,\r\nlo cual me convierte en un CONSUMIDOR y como tal tengo derecho a quejarme si algo no esta bien.\r\n\r\nTambi&eacute;n podr&aacute;n decir, por que no te vas a otro servidor...\r\n\r\nCon gusto, si no fuese que te cobran por transferir la cuenta.\r\n\r\nEstar&iacute;a muy bueno que habiliten las transferencias free a otros servidores, tambi&eacute;n que tengan la sutileza de al menos recompensar\r\na todo esta comunidad que se aguanta su inestabilidad al menos UNA! vez.\r\n\r\nOjala esto empiece a cambiar para mejor, y no vaya decayendo.\r\n\r\n Saludos atentamente a Riot de Ale, un numerito mas que consume de su producto.","replies":[{"poster":"Yrox the Third","date":"2016-03-04T16:14:13.315+0000","up_votes":16,"down_votes":1,"body":"Otra vez el mismo tema. \nPara empezar te apoyo que la comunidad antes era mejor,  pero era porque el juego era menos conocido,  ahora es toxico en todos lados. \nLo del Rp gratis no lo recuerdo,  y juego desde la season 1.\nAdemas,  si paso,  fue una vez y nada mas,  EUW tiene millones de veces mas problemas de lo que nosotros podemos imaginar y ni siquiera les han dado un bono de IP (y les prometieron algo hace años). \nLas cintas ya casi nadie las tiene en ningun server,  es un hecho,  el sistema esta fallando y necesita un rework. \nY te digo,  que odio completamente a los que dicen \"es gratis no te quejes\".... Osea,  que les pasa. \n\nEl server tiene sus problemas,  si,  pero no somos lo peor y no estamos cerca.","replies":[{"poster":"IF Six","date":"2016-03-04T17:00:49.441+0000","up_votes":8,"down_votes":2,"body":"Perdón por lo de mismo tema, como comente mas arriba, no entro casi al foro. Pero tenia ganas de formular una queja. Al menos así en las estadísticas saben que al menos uno mas esta desconforme con ellos.","replies":[]},{"poster":"SieghartX","date":"2016-03-04T17:36:16.292+0000","up_votes":1,"down_votes":0,"body":"En NA nos dieron RP una vez, **una**, y creo que fue por conmemorar un evento o algo así (y solo gente sin baneos podía obtenerlos). Por lo demás concuerdo, es tóxico en todos lados desde que se hizo popular, la gente se queja aquí porque es el server donde más juegan, porque yo estuve una temporada en EUW y LAN para jugar con amigos y eran tan tóxicos como acá.","replies":[{"poster":"Yrox the Third","date":"2016-03-04T19:05:29.770+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SieghartX,realm=LAS,application-id=J8qpiO2I,discussion-id=4YZlwwNY,comment-id=00030001,timestamp=2016-03-04T17:36:16.292+0000)\n>\n> En NA nos dieron RP una vez, **una**, y creo que fue por conmemorar un evento o algo así (y solo gente sin baneos podía obtenerlos). Por lo demás concuerdo, es tóxico en todos lados desde que se hizo popular, la gente se queja aquí porque es el server donde más juegan, porque yo estuve una temporada en EUW y LAN para jugar con amigos y eran tan tóxicos como acá.\n\nSi recuerdo bien,  fue por no haber tenido ningun castigo en un tiempo y fueron 400 rp,  pero nada mas.","replies":[]}]},{"poster":"Tyrr Judicator","date":"2016-03-04T17:57:14.379+0000","up_votes":1,"down_votes":0,"body":"yo empeze al final de la season 2 y me acuerdo de los rp en NA por lo menos los dieron tenias 400 rp que te daban al llegar a nivel 10 y otros 400 que regalaron 800 rp de regalo algo son por lo menos","replies":[]}]},{"poster":"Spencer Elden","date":"2016-03-04T16:01:59.981+0000","up_votes":9,"down_votes":1,"body":"Izi pissi shiot","replies":[]},{"poster":"MaStER of Kaiser","date":"2016-03-04T15:57:41.165+0000","up_votes":9,"down_votes":1,"body":"TE SHE KABE ALEETITASIVIR ONE DAY SHIOT","replies":[]},{"poster":"Dyaebl","date":"2016-03-04T15:33:46.252+0000","up_votes":7,"down_votes":23,"body":"Los problemas de ping son por cableado externo a riot la mayoria de las veces, partidas fantasma es un bug viejisimo que hay en las lan na kr cn etc\n\nSegun los terminos que no leiste gastar plata en el juego te convierte en un donador, no un consumidor\n\nSi hubieras tenido en cuenta que el server estaba en chile seguramente no te hubieras pasado aca pero lo hiciste igual y ahora te quejas\n\nTe invito a levear una cuenta en br si sos de arg o uruguay, en lan si sos de paraguay bolivia peru, en na si estas obsesionado con la estabilidad y no te importa el ping","replies":[{"poster":"NICO PELDAÑO","date":"2016-03-04T16:17:54.003+0000","up_votes":10,"down_votes":0,"body":"A mi sinceramente me chupa un huevo la plata que gaste en este juego porque no llegue a gastar 1000 pesos aun , pero si gaste mucho tiempo, entiendo la molestia que tiene el jugador que posteo el foro, yo también me enojo si a veces quiero jugar mi única partida del día y esta caído el server o hay unos 400 ms de base siendo que es la única del día y por cuestiones de tiempo en este momento no puedo jugar mucho.","replies":[{"poster":"Dyaebl","date":"2016-03-04T16:26:27.004+0000","up_votes":2,"down_votes":14,"body":"Gasta un poco mas y andate a br, la transferencia apenas tarda y te evitas tanto lag y problemas","replies":[{"poster":"Caipirinhã","date":"2016-03-04T16:49:12.999+0000","up_votes":9,"down_votes":0,"body":"Pero no entendes nada de lo que dicen y no podes hacer calls salvo que vos y tu team sepan ingles o que vos sepas portugues...","replies":[{"poster":"RectoDePerro","date":"2016-03-04T17:00:39.161+0000","up_votes":1,"down_votes":5,"body":"Si se puede xd, se llaman SEÑALES, con las cuales llegas si las sabes usar derecho a oro jaja. No hay nada de relevancia que poner en el chat además de lo que es practicante igual, por ejemplo\n\nNida F\nCorki Heal\n\nY seria todo, lo demás son señales y punto","replies":[]}]},{"poster":"NICO PELDAÑO","date":"2016-03-05T02:54:21.985+0000","up_votes":1,"down_votes":0,"body":"Tengo buenos amigos acá en Lan , me tendría que ir con todos ellos , a parte muchísimos de mis amigos con los que me junto juegan conmigo en LAN, y por ultimo no se hablar portugués, si supiera hablar portugués y mis amigos se van conmigo a BR no tengo problema :D","replies":[]}]}]},{"poster":"IF Six","date":"2016-03-04T15:40:59.214+0000","up_votes":14,"down_votes":4,"body":"Con gusto acepto tu invitación. Me quejo por tengo derecho hacerlo repito por si no leíste. Donador o consumidor, me da igual. Tiempo y dinero se gasta.","replies":[{"poster":"Dyaebl","date":"2016-03-04T16:28:06.057+0000","up_votes":3,"down_votes":17,"body":"No, no tenes porque la cuenta no te pertenece, no compraste donaste, te pasaste bajo tu propia responsabilidad sin informarte.\nAprobechando que aceptaste tu invitacion espero nunca ver un post o encontrarte en una partida en las, gracias por aportar a que haya menos gente como vos en el server.","replies":[{"poster":"MaStER of Kaiser","date":"2016-03-04T16:45:39.970+0000","up_votes":9,"down_votes":0,"body":"Loco andate a otro post, deja de andar diciendo pelotudeces, menos si no es para decir algo constructivo o solucionar dicho problema","replies":[]},{"poster":"IF Six","date":"2016-03-04T16:54:31.236+0000","up_votes":9,"down_votes":1,"body":"A ver compañero si nos entendemos, si tengo derecho a quejarme. En ningún lado dice que no lo puedo hacer. Lamentablemente hasta que no pongan free las transferencias me vas a ver en Las, en los foros lo dudo ya que no entro mucho por acá. **Y con eso \" de gente como vos\" la verdad lo siento bastante despectivo si no te gusta lo que escribí abstenete a no leerlo,** ya que vos quizás lo veas mal, yo lo toma como una critica constructiva.","replies":[]}]}]},{"poster":"Cac0","date":"2016-03-05T00:35:58.922+0000","up_votes":1,"down_votes":0,"body":"Lo de problema de Ping me sorprende que todavía haya gente que cree que es culpa de algo externo a riot (Si ese fuera el caso por que no cambian de compañía etc etc)","replies":[{"poster":"Dyaebl","date":"2016-03-05T20:36:39.129+0000","up_votes":1,"down_votes":0,"body":"El cableado de argentina-chile esta manejado por una sola empresa, creo que era level3.\nPaso de todo con el cableado, hasta un tractor le paso. No pueden cambiar de compañia simplemente xq no existe otra compañia\nLos lagazos a pricipios de año era por tormentas fuertes, no se pudieron ni acercar a la zona a arreglar los cables por ej\n\nEl unico lag de riot que no arregla es el del cliente q creo q estan por hacer un mantenimiento para arreglarlo","replies":[]}]}]},{"poster":"KlaudioXx","date":"2016-03-04T17:02:59.576+0000","up_votes":6,"down_votes":1,"body":"Report rito ya fue","replies":[]},{"poster":"Pablove90","date":"2016-03-04T17:59:56.948+0000","up_votes":6,"down_votes":2,"body":"siempre va a ser mas facil quejarse que agradecer...\nno podes comprar la cantidad de gente que juega ahora de la que jugaba antes no es joda alvergar a tantos juegadores esto no es un mmo que se agrega una cosita cada una semana como una armadurita o una extension de un mapa aca todo el tiempo se modifican cosas para que el juego no sea siempre el mismo\nla plata que invierte riot en sus jugadores es una bestialidad, las promociones, los descuentos, las rotaciones, los eventos, los torneos, etc... y siempre motiva a jugar en equipo y a ser compañeros (a diferencia de otros games)\nla posibilidad que le da a los jugadores de poder jugar sin gastar 1 solo peeso no te da la da practimentente ningun juego\ntiene los mismos derechos el que invierte 1 peso como el que invierte 5.000 cosa que en otros juego no pasa\nsi invertis mensualmente es tu problema, lo haces por querer salir de lo estandar, estoy seguro que como todos tenes mas de una skin y le as metido plata al juego y si tenes para esto tenes para pasarte de server\nla mayoria de las veces que el server anda mal aca en ARGENTINA es por problemas de comunicaciones NUESTROS desinversion cableados precarios, etc y riot busca el problema y hace todos los reclamos que estan a su alcance y mas tambien\nel launcher quedo atras... se esta emparchando este pero se esta haciendo uno nuevo que promete ser mas eficiente que este y sin matar maquinas como suelen hacer en otros juegos \n(para mi) vos y otros tantos foreros que en su mayoria son Argentinos (COMO YO) estan viendo el problema desde un punto equivocado (con respecto al malfuncionamiento)... Riot no es el que tiene ''desinversion'' somos nostros... riot no es maldito con la gente... es la ''gran parte'' de la gente que lo juega (no todos claro)\nlos trolls y afk siempre va a estar.. aca abundan y esto es por la ''cultura'' que tenemos los latinos no por riot... el problema viene de aca de casa .. el flameo que hay en america no hay en ningun lado con este grado de violencia, xeonfobia, racismo, falta de compromiso, falta de respeto, irresponsabilidad, etc\nyo jugue muchisimos juegos y juego muchos hoy en dia (no de la forma en que jugaba antes) ya que tengo 26 años mi propio comercio, mi propia casa, mujer, hijo, 3 perros, empleados, auto, gastos, gastos, etc, etc... pero a lo que voy es que de todos los juegos que jugue es la primera ves que veo tanto compromiso y trabajo de parte de una ''multinacional'' digamos... y mira que jugue MUCHISIMOS juegos...\ny si me puse medio agresivo te pido perdon.. pero estoy segurisimo que me van a llover negativos y lo hago igual porque este es un tema del cual se hablo incontables veces en el foro\ny con todo esto no estoy diciendo que el juego es ''perfecto'' no soy fan lol, ni fan riot...","replies":[{"poster":"IF Six","date":"2016-03-04T18:29:26.473+0000","up_votes":3,"down_votes":2,"body":"Es verdad que siempre es fácil quejarse, que agradecer. En lo particular esta es la primera en 4 años.  Yo no te note para nada agresivo, de hecho quizás concuerde en varias cosas que decís. Pero en otras no tanto, como lo de  compararlos con otras empresas/juegos ya que los hay mejores y peores. Me gustaría poder nombrarte cada uno, pero no se si se podrá, de los cuales son free to play en los que jamas tuve problemas. Así que no se hasta que punto el problema viene de nuestra desinversion . Por ahí vos hablas de Riot a nivel global, y yo hoy me estoy quejando puntualemente de LAS.\nSi le tengo que agredecer algo a este juego, sera las horas de oseo, nuevas y buenas amistades en estos años.","replies":[]},{"poster":"Luni","date":"2016-03-05T02:14:04.714+0000","up_votes":1,"down_votes":1,"body":"Campeón Riot no es beneficiencia, no lo harían si no ganaran con ello. Los eventos, los sponsor, las transmisiones, el RP que se debe gastar, lo mínimo y más importante, si vas hacer 50000 skins para que tus jugadores compres, es que el server funcione dignamente. Y no así.","replies":[{"poster":"Pablove90","date":"2016-03-05T02:35:01.343+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luni,realm=LAS,application-id=J8qpiO2I,discussion-id=4YZlwwNY,comment-id=00050001,timestamp=2016-03-05T02:14:04.714+0000)\n>\n> Campeón Riot no es beneficiencia, no lo harían si no ganaran con ello. Los eventos, los sponsor, las transmisiones, el RP que se debe gastar, lo mínimo y más importante, si vas hacer 50000 skins para que tus jugadores compres, es que el server funcione dignamente. Y no así.\n\npapu pero que me diciendo ''campeón'' ? quien dijo que era gratis obviamente que gana plata de que me estas hablando?\nyo estoy diciendo que riot hace las cosas bien a diferencia de muchos otros juegos y que no estafa o lucra como otros juegos... que si pagas tenes mejores ''manos'' digamos y el server no es lo que anda mal papu... yo tengo 1,5 megas y juego con 38 a 48 ms y rara ves al año me anda con ping a los chilenos rara ves les anda con ping no es siempre culpa del server el problema esta aca entendelo y es ajena al server y riot hace lo que puede hacer siempre aveces mal aveces bien pero hace y muchas veces reclama por nosotros y por ellos mismos tambien OBVIAMENTE que no quieren perder clientes o te pensas que si? \nno te enganches mal si te vas a enganchar lee todo aca nadie esta diciendo que las cosas andan perfectamente si tenes ganas de resongar llama a tu compania de internet pero conmigo no te la agarres","replies":[{"poster":"Luni","date":"2016-03-05T03:17:22.643+0000","up_votes":1,"down_votes":0,"body":"Yo tambien tengo poco pin usualmente no más de 50 entre 45 y 48. Y muchas veces hay momentos en que se van a 2k de pin de golpe. Y configure todo absolutamente toda mi red, mi internet, mi línea todo, como lo dice el soporte de RIOT y si, me anda mejor que antes, lo cual es de esperar, pero a veces pasa eso,o despues de la media hora se va a 200 es cierto que las empresas en argentina en casi todo, no solo en las comunicaciones lucran con todo exageradamente y no invierten ni dos pesos partidos a la mitad y aumentan la boleta como si uno usara 100 mbps.\n\nEn ese caso, ya que todos nos quejamos de ese tipo de cosas, podríamos presentar una solicitud para que los usuarios juntos a las empresas de juegos online que debe representar seguro una porción significativa del mercado, presente una queja o algún trámite legal en coso del consumidor por todos los perjuicios generados en base a que no hay ningun tipo de actualización de ningún tipo. \n\nSi vamos a ser \"coherentes\" vamos hacer todos coherentes. y creo que si Riot se ve tan afectado por las quejas de ese tipo, creo que debería apoyarlas. ya que eso representaría tambien un beneficio para ellos, por que capaz ellos pueden decir, \"pero nuestro servidor lo revisamos todo el tiempo y en las se quejan constantemente entonces, no sabemos al final si es por que nustro servidor anda horrible, o si son las cabronas de las empresas de internet\", así que nada. supongo que si alguien quiere una solución así debe ser.","replies":[{"poster":"Pablove90","date":"2016-03-05T05:59:09.419+0000","up_votes":1,"down_votes":0,"body":"ahora si te entiendo.. estoy deacurdo con esto que me desis y tambien con lo que me respondio el dueño del post... tienen razon ... y si estaria bueno que haya un enteregulador o algo que controle el ping bajada y subida de los sevicios que nos brindan internet yo es la 3er empresa de internet que voy usando.. pase por speedy... una derivada de arnet y ahora estoy con una que vende por nodos pero sinceramente no se a quien le compra internet la cosa es que recien ahora puedo jugar lol y juegos de NA donde estan la mayoria de los mmo que tanto me gustan.. gaste muchisima plata y mas que te piden esos ''contratos de de x meses'' ... yo tengo la esperanza de que este gobierno va a ir invirtiendo en los sectores de comunicacion que tan atras nos fuimos quedando... hay muy poca ''fibra'' y muchos usuarios de internet que quieren ''mas'' velocidad de la que se ofrece en su domicilio.. en mi caso hay solo 3 companiasde las cuales pago 2 en el mismo domicio (una para mi y la otra para mi mujer y netflix) y la que mas me da es esta con 1,5 mb y conozco gente que solo puede 512 de speedy por cable adsl y hay gente que puede tener NADA ni siquiera por nodos... (vivo en el segundo partido mas grande de la prov de buenos aires que es merlo ) \nahi esta el problema que tenemos los argentinos y como siempre no podemos hacer nada mas que gastar y gastar y probar y probar como hice yo ... con esto no quiero desir que RIOT sea ''perfecto'' y que no tenga la culpa de nada pero hace una banda de cosas por nosotros y siempre va haber algo por mejorar\nes mas como queja me gustaria que los comunicadores de riot nos acompañaran un poco mas con las noticias estos problemas y de estas cosas... generalmente te enteras de lo que paso a las 48 hs minimo parece que cuando hay problemas se esconden todos.. pero bueno ...tal ves solo reciven ordenes de no desir nada no se...","replies":[{"poster":"2l2","date":"2016-03-05T06:15:11.182+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pablove90,realm=LAS,application-id=J8qpiO2I,discussion-id=4YZlwwNY,comment-id=00050001000000000000,timestamp=2016-03-05T05:59:09.419+0000)\n>\n> ahora si te entiendo.. estoy deacurdo con esto que me desis y tambien con lo que me respondio el dueño del post... tienen razon ... y si estaria bueno que haya un enteregulador o algo que controle el ping bajada y subida de los sevicios que nos brindan internet yo es la 3er empresa de internet que voy usando.. pase por speedy... una derivada de arnet y ahora estoy con una que vende por nodos pero sinceramente no se a quien le compra internet la cosa es que recien ahora puedo jugar lol y juegos de NA donde estan la mayoria de los mmo que tanto me gustan.. gaste muchisima plata y mas que te piden esos ''contratos de de x meses'' ... yo tengo la esperanza de que este gobierno va a ir invirtiendo en los sectores de comunicacion que tan atras nos fuimos quedando... hay muy poca ''fibra'' y muchos usuarios de internet que quieren ''mas'' velocidad de la que se ofrece en su domicilio.. en mi caso hay solo 3 companiasde las cuales pago 2 en el mismo domicio (una para mi y la otra para mi mujer y netflix) y la que mas me da es esta con 1,5 mb y conozco gente que solo puede 512 de speedy por cable adsl y hay gente que puede tener NADA ni siquiera por nodos... (vivo en el segundo partido mas grande de la prov de buenos aires que es merlo ) \n> ahi esta el problema que tenemos los argentinos y como siempre no podemos hacer nada mas que gastar y gastar y probar y probar como hice yo ... con esto no quiero desir que RIOT sea ''perfecto'' y que no tenga la culpa de nada pero hace una banda de cosas por nosotros y siempre va haber algo por mejorar\n> es mas como queja me gustaria que los comunicadores de riot nos acompañaran un poco mas con las noticias estos problemas y de estas cosas... generalmente te enteras de lo que paso a las 48 hs minimo parece que cuando hay problemas se esconden todos.. pero bueno ...tal ves solo reciven ordenes de no desir nada no se...\n\nSiempre que hay un error o problena aparece un rioter con un post oficial que lo va actualizando a medida que solucionan el problena, pero los argetinos llegan, ven que tienen lag y empiezan a spamear temas, dejando el post oficial enterrado en temas diciendo que tienen lag y maldiciendo a riot.\n\n\nAca en chile lo minimo son 4 mb de internet, pero en muchos casos no tienes eleccion, ya que las empresas se coluden con precios y zonas por lo que estas obligado a comprarle a una empresa solamente.. Aca en chile antes de comprar una casa siempre se pregunta que servicios de telefonia, cable e internet llega xd","replies":[{"poster":"IF Six","date":"2016-03-06T05:52:14.281+0000","up_votes":1,"down_votes":0,"body":"\"Pero los Argentinos\"...  Aca nadie mete nacionalidades de por medio. Así que por favor abstenete a comentar algo objetivo.\n\nCon respecto a lo que nombran mas arriba de las empresas proveedoras de Internet es un tema totalmente aparte, al lado de algunas de estas, RIOT es  un santo.\n\nPero con ellas, al menos yo particularmente, siempre recurrí a DEFENSA DEL CONSUMIDOR.\n\nTambién es interesante, lo que plantea  LUNI. Pero como conscientizas a toda una comunidad que es activa en este juego a generar una SUGERENCIA a una empresa de este nivel, si cuando generas una queja la mitad de los comentarios son: \"crypost\" \"No tenes derecho a quejarte·\" \"La cuenta no te pertenece\" \" Abandona la región \" \"el juego es gratis\"","replies":[{"poster":"2l2","date":"2016-03-06T17:34:07.152+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RBT Alesito,realm=LAS,application-id=J8qpiO2I,discussion-id=4YZlwwNY,comment-id=0005000100000000000000000000,timestamp=2016-03-06T05:52:14.281+0000)\n>\n> \"Pero los Argentinos\"...  Aca nadie mete nacionalidades de por medio. Así que por favor abstenete a comentar algo objetivo.\n> \n> Con respecto a lo que nombran mas arriba de las empresas proveedoras de Internet es un tema totalmente aparte, al lado de algunas de estas, RIOT es  un santo.\n> \n> Pero con ellas, al menos yo particularmente, siempre recurrí a DEFENSA DEL CONSUMIDOR.\n> \n> También es interesante, lo que plantea  LUNI. Pero como conscientizas a toda una comunidad que es activa en este juego a generar una SUGERENCIA a una empresa de este nivel, si cuando generas una queja la mitad de los comentarios son: \"crypost\" \"No tenes derecho a quejarte·\" \"La cuenta no te pertenece\" \" Abandona la región \" \"el juego es gratis\"\n\nTodos sabemos de manera objetiva los crypost que se crearon hace 2 meses por el lag. Incluso había uno que alcanzó casi 800+ para que movieran el servidor a argentina, el foro dejo de ser un lugar para consultas, exponer ideas o guias a una iglesia donde venían a llorar por el lag, y todos ellos eran argentinos y uruguayos.\n\nRiot le arrienda fibra a level 3, la cual a sufrido más desgracias que el coyote... En menos de 2 meses se corto 3 veces, y como dijeron arriba, hasta un tractor le paso encima! \n\nA riot la molesta la situación actual, incluso esta impulsando su propia fibra óptica (al más estilo de google fiber) en eeuu, se llamaba algo de riot conecta creó... La cosa es que quieren crear una fibra que sea utilizada sólo para los juegos online. Pero eso llevará tiempo, pero es hermoso saber que la empresa no se que de en lo que es lol he invierta pensando en el futuro.\n\nYo  cuándo he tenido lag, me quejó directamente con mi isp, así he logrado soluciones súper efectivas. Como tu apelando a los derechos del consumidor y al \"neutralidad de internet\" que existe en Chile, que obliga a las empresas a tener en su web todas las medidas de navegación (ping, descarga, subida, nacional e internación) y si no es cumplida es incumplimiento de contrato.","replies":[]}]}]}]}]}]}]}]},{"poster":"NGreppi","date":"2016-03-05T19:45:50.839+0000","up_votes":1,"down_votes":0,"body":"1. Soy de las y tengo 2 listones, el amarillo y el rojo. El motivo de que antes se veia mas es porque el sistema de honor cambio y ahora no se lo dan a cualquiera, no porque en NA fueran mas amables.\n2. Flamers, afk, trolls, etc. hay en todos los servers, ninguno es menos toxico, de echo al menos en latinoamerica la rivalidad de Chilenos, Argentinos, Brasileros, Peruanos, etc esta presente en todos los juegos online y Riot no puede hacer nada al respecto.\n3. Esta permitido quejarse, pero vos pensas que tu crypost va a cambiar algo? sabiendo que hay 1000 mas?\n4. El servidor me anda bien, mucho mejor que hace 2 meses donde si tenia lag, soy argentino y tengo 55-70 ms, a veces mas pero es por mi internet, ya que lo usan varias personas.\n5. NA no tenia partidas fantasmas, caidas, lag, etc. porque en ese momento lo jugaba mucho menos gente que ahora.","replies":[{"poster":"IF Six","date":"2016-03-06T05:56:50.092+0000","up_votes":1,"down_votes":1,"body":"\"Esta permitido quejarse, pero vos pensas que tu crypost va a cambiar algo? sabiendo que hay 1000 mas?\", con esa mentalidad no vas a llegar a ningún lado. \n\nSuerte en la vida.","replies":[{"poster":"NGreppi","date":"2016-03-06T17:03:53.658+0000","up_votes":1,"down_votes":0,"body":"No voy a llegar a ningún lado? Quien es el que se esta quejando desde una pantalla teniendo la posibilidad de cambiar el proveedor si ese es el problema? Si no es eso, podes mudarte a br. Dejate de llorar por favor, no esperes que te solucionen todo.","replies":[]}]}]},{"poster":"F0RZAKEN","date":"2016-03-05T18:41:19.408+0000","up_votes":1,"down_votes":0,"body":"Otro crypost...sean mas creativos!","replies":[]},{"poster":"2l2","date":"2016-03-05T06:10:36.198+0000","up_votes":1,"down_votes":0,"body":"Bueno como ya te dijeron, no sirve muchi quejarse, puedes hacerlo, pero no obtendras nada con ello. \n\nA mi el servidor siempre me ha andado bien, soy de chile y juego casi siempre con 27 ms.","replies":[]},{"poster":"Hi im InsecZeref","date":"2016-03-04T23:16:51.671+0000","up_votes":1,"down_votes":0,"body":"Vieja ami culpa de que el server se colgo me degradaron de liga, en donde me puedo comunicar o algo tenia puntos y todo y me bajarno igual por uun bug de ellos!!","replies":[]},{"poster":"NickMachineBroke","date":"2016-03-04T21:08:51.095+0000","up_votes":1,"down_votes":0,"body":"A mi me impresiona el tan poco soporte que tiene esto, mucho menos que Steam, y esta es una comunidad mucho mas chica :P","replies":[]},{"poster":"Tryhard X","date":"2016-03-04T19:09:13.058+0000","up_votes":1,"down_votes":2,"body":"No me canso y no me voy a cansar de decirlo! Me pase a br y me cambio la vida!!!!!!!!! No se que edad tenes, no se si laburas pero si tanto te molesta el server queda en vos hacer algo! Si sos menor y no trabajas no te cuesta nada ahorrar 300 pesos (si sos argentino) y comprar rp y hacer el traspaso!","replies":[{"poster":"Zabivaka","date":"2016-03-04T19:26:32.639+0000","up_votes":1,"down_votes":1,"body":"Puedo poner el idioma en español latinoamerica mientras juego con mi cuenta brazuqueña?","replies":[{"poster":"Tryhard X","date":"2016-03-04T19:51:45.879+0000","up_votes":1,"down_votes":2,"body":"Obvio papu!! En 160 partidas 2 trolls en la misma partida y 1 afk... Nada mas! Flamers? Si, uno que otro pero nadaaaaaa que ver al nivel de flameo de aca!!","replies":[{"poster":"Zabivaka","date":"2016-03-04T19:59:43.395+0000","up_votes":1,"down_votes":1,"body":"Menos mal porque no sabia si pasarla o no a las","replies":[{"poster":"Tryhard X","date":"2016-03-04T21:50:19.862+0000","up_votes":1,"down_votes":2,"body":"Pasarla a LAS??? O pasarte de LAS a BR??","replies":[{"poster":"Zabivaka","date":"2016-03-04T22:48:29.527+0000","up_votes":1,"down_votes":1,"body":"Pasar la cuenta de BR a las","replies":[{"poster":"Tryhard X","date":"2016-03-04T23:19:40.428+0000","up_votes":1,"down_votes":1,"body":"jajja estas re loco! yo me fui de las a br! no sabes donde te metes en LAS","replies":[]}]}]}]}]}]}]}]}