{"poster":"Aesah","date":"2016-10-05T18:04:03.438+0000","title":"Patch Chat with the Playtest Team - 6.20, Ivern release","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"https://news-a.akamaihd.net/public/na_images/PCHCHT/Minions.jpg\nHeader art by inkiness\n\nHey guys! Welcome to Patch Chat, a Dev Corner thread we make to talk about our new patches every two weeks: http://na.leagueoflegends.com/en/news/game-updates/patch/patch-620-notes\n\nI&#039;m Aesah on Riot&#039;s Playtest Team, a group of Diamond+ players who play with the new champions, reworks, balance tweaks, items, and map updates before they are released. It&#039;s our job to the test the changes that our designers come up with and ensure that we&#039;re introducing positive changes to LoL in terms of both balance and fun. We&#039;ll be watching this thread to answer as many questions as we can.\n\nThe big thing for patch 6.20 is the release of Ivern,  the Green Father. Ivern is a supportive jungler who excels at enabling juggernauts with his Q as well as protecting his carries with shields and brush. Ivern has an extremely unique playstyle so we&#039;re expecting it to take some time before players figure him out, but we&#039;ll be watching his performance closely. As for the rest of the cast, Ashe, Cho&#039;gath, and Vladimir received some game-health changes we expect to be relatively power neutral while Nunu and Taliyah were buffed and Jinx got a small nerf.\n\nAll of us on the Playtest Team are avid gamers so feel free to talk to us as fellow LoL players!\n\nAdam &quot;Afic&quot; Cohen\nBen &ldquo;Cezium&rdquo; Burkhardt\nShawn &ldquo;I Am The IRS&rdquo; Currie\nDon &ldquo;Aesah&rdquo; Ding\nNicolas &ldquo;Gleeb&rdquo; Haddad\nDan &ldquo;penguin&rdquo; Hardison\nMiles &ldquo;Daydreamin&rdquo; Hoard\nBao &ldquo;Bao&rdquo; Lam\nRobert &ldquo;ROBERTxLEE&rdquo; Lee\nNicholas &ldquo;Nickwu&rdquo; Smith\nBlake &ldquo;S0be&rdquo; Soberanis\nTrevor &ldquo;ThEntropist&rdquo; Thernes","replies":[{"poster":"Utility Veigar","date":"2016-10-05T18:33:59.000+0000","up_votes":17,"down_votes":1,"body":"Any changes to Heimer? He seems to have been forgotten. And speaking of turrets, any changes on Ohmwrecker? That's also floating around.","replies":[{"poster":"imVash","date":"2016-10-05T18:44:01.654+0000","up_votes":3,"down_votes":2,"body":"pls no heim buffs. he is fucking annoying to play against.","replies":[{"poster":"Utility Veigar","date":"2016-10-05T18:46:23.617+0000","up_votes":5,"down_votes":1,"body":"Really? I think Heimer is bottom tier tbh. I never had a problem against one.","replies":[{"poster":"Champion Skin","date":"2016-10-05T20:50:24.226+0000","up_votes":5,"down_votes":0,"body":"Depends a lot on what champions you are playing... a lot of melee champions have a hard time dealing with Heimer... clearing turrets is a pain to do and trying to do it often just results in losing a lot of HP... and going all in on heimer while he has turrets is often a bad idea\n\nThough ranged champions usually won't have as much trouble with heimer as they can more easily clear the turrets and often don't have to get close to heimer to trade back or kill heimer so they can also more easily ignore the turrets","replies":[]}]}]},{"poster":"Kosovo je Serbia","date":"2016-10-06T10:47:19.761+0000","up_votes":2,"down_votes":0,"body":"Why does Heimers R only restet the Q CD and not the CD from other abilitys {{item:3070}} \nBut I think Heimer need a complete gamplay update.","replies":[]}]},{"poster":"The12thman94","date":"2016-10-05T18:08:14.346+0000","up_votes":5,"down_votes":0,"body":"Rengar obviously synergizes well with Ivern, but is there any fun interactions that you guys have found that may not be immediate thought about?","replies":[{"poster":"Aesah","date":"2016-10-05T19:46:41.367+0000","up_votes":15,"down_votes":0,"body":"Blitzcrank grabbing a target while simultaneously taking Ivern's Q","replies":[{"poster":"Glyph of Change","date":"2016-10-05T19:54:36.123+0000","up_votes":5,"down_votes":0,"body":"Oh shit. And we already saw in the spotlight how amazingly Blitz can synergize with his spot brush creation...","replies":[]}]},{"poster":"playtestpenguin","date":"2016-10-05T20:29:35.336+0000","up_votes":8,"down_votes":0,"body":"Caitlyn is great with him because you can increase her headshot rate with brush.","replies":[]},{"poster":"Shas O","date":"2016-10-05T19:39:53.746+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=The12thman94,realm=NA,application-id=A7LBtoKc,discussion-id=glBV9vYL,comment-id=0000,timestamp=2016-10-05T18:08:14.346+0000)\n>\n> Rengar obviously synergizes well with Ivern, but is there any fun interactions that you guys have found that may not be immediate thought about?\n\nKha'Zix passive unseen threat","replies":[]}]},{"poster":"warpenguin555","date":"2016-10-05T18:11:40.043+0000","up_votes":4,"down_votes":0,"body":"How is the LeBlanc rework? It's the one I'm the most excited for out of all the assassins.","replies":[{"poster":"Aesah","date":"2016-10-05T22:42:55.844+0000","up_votes":8,"down_votes":1,"body":"She'll have some interesting new ways to live her fantasy as a Deceiver.\n\nIn exchange for her new power, she can no longer instantly kill you from fog with EQRW.","replies":[{"poster":"Landorin","date":"2016-10-05T23:18:53.073+0000","up_votes":2,"down_votes":3,"body":"I mean... I guess I'll reserve judgment until the details of the rework are shared, but as someone who's played a lot of Leblanc in the past and was excited that she might be getting revamped, that's extremely discouraging to me. Bleh.","replies":[{"poster":"Michael Sykes","date":"2016-10-06T09:08:31.204+0000","up_votes":1,"down_votes":1,"body":"same here. Hopefully she is still able to kill her target fast, but not _that_ fast.","replies":[{"poster":"CrimsonCobra3","date":"2016-10-06T14:51:26.632+0000","up_votes":1,"down_votes":0,"body":"My guess is that it'll depend on her target and how fed she is. She's still an assassin, and these days even tanks can kill ADCs in seconds if the power-difference is large enough. (That is a level or two, and maybe an item.)","replies":[{"poster":"Michael Sykes","date":"2016-10-07T11:50:00.308+0000","up_votes":2,"down_votes":0,"body":"of course she will be able to kill adc's efficiently, but I fear that she is going to be similar to Shaco, a champion I hate very much.\nAnd her ability to kite heavier targets with her chains was pretty awesome. I hope she is able to do this better with her \"deception tool\"","replies":[]}]}]}]},{"poster":"Shadow Hazard","date":"2016-10-05T22:57:48.448+0000","up_votes":2,"down_votes":0,"body":"god bless","replies":[]}]}]},{"poster":"9 Alexandru 9","date":"2016-10-06T17:06:17.284+0000","up_votes":1,"down_votes":0,"body":"you guys know that now with this patch riven can combo ultrafast","replies":[{"poster":"Aesah","date":"2016-10-07T17:41:13.055+0000","up_votes":6,"down_votes":0,"body":"It's a bug, we're considering a hotfix","replies":[]}]},{"poster":"FAR CRY DREAM","date":"2016-10-05T19:41:45.172+0000","up_votes":6,"down_votes":0,"body":"Well, hope you guys doing well. I just came by to say thank you for a champion like Ivern with the kind of theme I like. Never was a jungler but I think I'll start learning Jungle with Ivern now.","replies":[{"poster":"Aesah","date":"2016-10-05T22:34:40.619+0000","up_votes":6,"down_votes":0,"body":"hell yeah","replies":[]}]},{"poster":"Mysticman89","date":"2016-10-05T21:06:24.807+0000","up_votes":1,"down_votes":0,"body":"Do you think Ivern will primarily end up being played as support or primarily as jungle (or even elsewhere)?\n\nHas there been concerns with troll iverns intentionally providing brush to aid the enemy being an issue? Bard ult for example gets a lot of flak since it can very actively hinder allies, but it's at least tied up in an ultimate, but I could imagine bushes being placed to obscure vision that the allied team would actually want to have and/or giving the enemies brush to hide in instead.","replies":[{"poster":"Bao","date":"2016-10-05T21:24:12.474+0000","up_votes":6,"down_votes":0,"body":"I think he will be primarily played as Jungle... I played him a couple of times as support and it felt pretty bad... his lane is horrible (he is like worse morgana) but it becomes _okay_ at level 6. Not to mention his passive is pretty useless as support (you don't get to instantly clear camps) and you are usually just counter-jungling your own jungler (as you are too squishy to invade and wait for a camp to be harvested).\n\nI don't think we generally are concerned about it... a lot of champion abilities can be 'troll' (i.e. TK devour, Bard ult, troll Thresh lanterns) and there isn't really much we can do it about it... most players follow the Summoner's Code fairly well :)","replies":[]}]},{"poster":"DrPapillon","date":"2016-10-05T19:42:56.021+0000","up_votes":1,"down_votes":1,"body":"Please don't make Leblanc non-counter-able when you rework her and the assassins, right now it seems the only counter is stay away from her","replies":[{"poster":"Dark Star Cho","date":"2016-10-05T19:45:17.573+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=DrPapillon,realm=NA,application-id=A7LBtoKc,discussion-id=glBV9vYL,comment-id=0008,timestamp=2016-10-05T19:42:56.021+0000)\n>\n> Please don&#x27;t make Leblanc non-counter-able when you rework her and the assassins, right now it seems the only counter is stay away from her\n\nsorry, can confirm even if on fountain she will still kill you.","replies":[]}]},{"poster":"Lobster07","date":"2016-10-05T20:27:20.351+0000","up_votes":2,"down_votes":3,"body":"I thought {{champion:22}} was going to make it to the Worlds FInals, but rito hates her :(","replies":[{"poster":"Cezium","date":"2016-10-05T20:47:39.374+0000","up_votes":5,"down_votes":0,"body":"The changes she received this patch aren't part of the world's patch.","replies":[]}]},{"poster":"Dark Star Cho","date":"2016-10-06T02:47:30.432+0000","up_votes":3,"down_votes":1,"body":"Anyone going to address how these cho nerfs made it to live without the promised compensation? Will he be playable before the end of the season?","replies":[{"poster":"elFa86","date":"2016-10-06T06:05:08.124+0000","up_votes":3,"down_votes":2,"body":"The changes of Cho are a buff.","replies":[{"poster":"Omnomimous","date":"2016-10-06T14:24:15.301+0000","up_votes":3,"down_votes":1,"body":"They really aren't, how hard did you look at them?","replies":[{"poster":"Cezium","date":"2016-10-07T00:08:53.034+0000","up_votes":3,"down_votes":2,"body":"It was a net positive change =)","replies":[{"poster":"Champion Skin","date":"2016-10-07T01:36:53.702+0000","up_votes":3,"down_votes":2,"body":"How was it a net positive?\n\nThe changes make Cho'gath even weaker against mobile champions as his W is less reliable (though he might be stronger against immobile champions thanks to the extra range)\n\nIn lane he can use W more often to harass with yes... but it is rather mana gated (and if the opponent avoids a couple of W's because of the change then it doesn't really help much with the lower cooldown)\n\nAnd in teamfights having 0.5 seconds silence duration hurts way more then the lower cooldown helps\nBecause you are unlikely to get a second round of silence off... and even if you do at that point the enemy might have their abilities on cooldown already?","replies":[{"poster":"Cezium","date":"2016-10-07T16:48:02.644+0000","up_votes":4,"down_votes":0,"body":"Because his win rate increased from the changes? I understand there are situations where it's probably a little weaker and there are situations where it's probably a little stronger, but for the general game of Cho'Gath his power went up","replies":[{"poster":"Hellioning","date":"2016-10-07T16:57:51.779+0000","up_votes":1,"down_votes":0,"body":"Didn't Riot just release a post in which they talked about all the various issues that come from using 'winrate' as a balancing metric?","replies":[{"poster":"Cezium","date":"2016-10-07T20:27:53.374+0000","up_votes":4,"down_votes":0,"body":"Using it as the only balancing metric is obviously not good (and that's not what's happening here either), but it is the simplest way to point out that the claim that it was a complete nerf with no compensatory buffs is completely wrong.\n\nI get that the changes are frustrating and I understand that people are upset they can't use him the same as they always have, but it was something that was pretty necessary to bring him in line with pretty much everything else in League. The compensatory buffs for the most part add enough power elsewhere that overall he's a little bit stronger than before the changes - and it's power we're capable of giving him because of the change.","replies":[{"poster":"Hellioning","date":"2016-10-07T20:40:38.699+0000","up_votes":1,"down_votes":0,"body":"I think claiming that Champion Skin's post was stating that it was 'a complete nerf with no compensatory buffs' is a bad off. Their argument was that it wasn't a net buff, not that it was a complete nerf.","replies":[{"poster":"Cezium","date":"2016-10-08T01:20:32.636+0000","up_votes":4,"down_votes":0,"body":"I'm referencing the original post and the general sentiment","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Slyssa","date":"2016-10-06T18:33:29.570+0000","up_votes":1,"down_votes":0,"body":"So  i was wondering if the synergy between Mordekaiser and Ivern was intentional. Despite Iverns bad laning, if Ivern lands a Q and Morde is ready he can go ham on the adc or squishy support then a E from Ivern and a W from Morde getting some tankiness and extra damage. Morde hitting hit 3 from  Q and an E from morde is alot of damage. if one of them isnt dead they are certainly pushed out of lane. And lvl 6 it gets better. Morde and Ivern can solo dragon and or counter jungle the bottom side. Idk about you guys but i thought if i saw a Morde and his pet Dragon with Ivern and his Pet Golem (daisy) basicaly a 4v2 in bot lane im thinking Oh shit RIOT PLEASE HELP because you made Mordekaiser Viable again. Also if you guys didnt notice yet i certainly did Ivern takes towers down super fast like jinx fast his W passive damage make a bush by the turret get your extra damage go ham on turret....................buddy and i did a custom game ivern v ivern with same bots either side all intermediate. I noticed when i snuck into my buddies base and took down 2 inhibs and spent i think 5 secs taking down 1 inhib and about the same at the next probably faster if you have daisy too anyway. was just curious about the synergy and if you all from riot had designed a support specificaly tailored for Mordekaiser or if it was a complete accident.","replies":[{"poster":"Cezium","date":"2016-10-07T00:10:42.864+0000","up_votes":3,"down_votes":0,"body":"Yeah, actually, it is pretty great synergy. But it's not something we expect to be overbearing in any regard, primarily because Ivern just isn't that great of a support. That one syngery is great, but it's probably more interesting if Ivern is jungling and Morde is bot lane or something.","replies":[]}]},{"poster":"La Bello","date":"2016-10-05T20:44:03.237+0000","up_votes":1,"down_votes":0,"body":"Couple Questions\n\n1. When is Teambuilder coming back if ever?\n\n2. Why change Nunu in a way like this? this isnt adding any sort of meaningful interaction or counterplay to him its essiently just turned him into a ball of stats who gets away with greedier builds (Which is something Riot doesnt like). Nunu is already a champion that is unfun to play against in most cases most fun felt from playing Nunu comes from the satisfaction of denying the other team fun and sowing suffering so why actually buff Nunu as opposed to sweeping under the rug until his eventual rework (ala the Old yorick ,{{champion:266}} {{champion:23}} {{champion:429}}  treatment) he doesn't any sort of interesting dynamic to teamfights and really only has 1 skill in most skirmishes.\n\n3.Will the changes to Flat pen also effect Runes? ","replies":[{"poster":"Cezium","date":"2016-10-06T00:02:57.400+0000","up_votes":3,"down_votes":0,"body":"The designer and I had pretty lengthy discussions about Nunu. We both more or less felt like Nunu needs a minor rework more than some number changes, but it was pretty far outside of the scope of what we would be able to accomplish for one patch. The goal of the changes was to make him feel better and hopefully be a little more fun, which was mostly accomplished imo.\n\nHonestly, though, I feel like he needs some work before he's in a good spot and it's going to take more than number changes.","replies":[{"poster":"SonicÐeHedgedawg","date":"2016-10-06T00:12:46.003+0000","up_votes":2,"down_votes":0,"body":"I mean, from the layman's perspective, he's got pretty low interactivity.  His ult is great from a design standpoint, but other than his ultimate, he's got a PvE-only nuke, a low-apreciation level and not-overly-strong design wise buff leaving his only real reliable PvP tool to be a reliable point-and-click slow.\n\nIt's troll-y and maybe that's a fine design direction, but it's really really non-interactive for all parties involved","replies":[{"poster":"Cezium","date":"2016-10-06T00:18:29.352+0000","up_votes":3,"down_votes":0,"body":"Yeah, it's pretty meh. We discussed ways of upping the interactivity and making the W and E more interesting. Obviously nothing going in yet though.","replies":[]}]}]}]},{"poster":"EROTIC RAID BOSS","date":"2016-10-05T20:47:44.254+0000","up_votes":3,"down_votes":0,"body":"What do you guys build on Ivern? I was kinda torn between jungle items, as well as whether or not ardent censer could be good on him","replies":[{"poster":"Cezium","date":"2016-10-06T00:03:51.692+0000","up_votes":3,"down_votes":0,"body":"I think we were mostly building AP into tank on him. Stuff like Protobelt, Rylai's, etc. into stuff like Randuins, Deadmans, etc.","replies":[]}]},{"poster":"QLerin","date":"2016-10-05T20:14:16.426+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Cezium","date":"2016-10-05T20:46:51.208+0000","up_votes":3,"down_votes":0,"body":"That was something we discussed with the designer. We didn't feel like it was absolutely needed and the cooldown changes were pretty power positive, so we didn't pull the trigger. If he turns out to be too weak/strong after the patch, we can always adjust him down the road, although we feel like he's in a decent spot for right now. It's always difficult to see exactly how much power there really is in the pre-cast lock over post-cast lock and providing the right amount of compensation.","replies":[]}]},{"poster":"Tanzil","date":"2016-10-05T20:03:36.764+0000","up_votes":2,"down_votes":0,"body":"What are some interesting tricks were you guys thinking about when playing Irving? Would it be possible to jungle botside and get lv 3, leaving your ADC to 2v1 in the early game? (letting your jungle clear top and get an early lv 3 gank on top/mid)?","replies":[{"poster":"playtestpenguin","date":"2016-10-05T20:30:22.982+0000","up_votes":3,"down_votes":0,"body":"Not really feasible since you need to wait pretty long for your camps and you don't get much experience without the jungle items. I did fool around with SmashGizmo and toplane Ivern, but it uh...didn't have the best results.","replies":[]}]},{"poster":"SaikoticKind","date":"2016-10-13T10:13:06.107+0000","up_votes":2,"down_votes":0,"body":"In my mind I kinda want master yi to be completely reworked...I mean hes not exactly balanced and even though most champs arent ( {{champion:55}} {{champion:420}} {{champion:39}} {{champion:105}} {{champion:114}} {{champion:90}} ) yi has been broken for a while, the only thing to counter him is cc, but you have to realize that cc counters everyone. Its not too much fun playing against plat lvl players who main yi. Its no fun having yi in the game sometimes","replies":[]}]}