{"poster":"Marquis","date":"2017-04-14T18:57:13.250+0000","title":"New Computer is not running League.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"When I installed it with the setup wizard, the .NET Framework 3.5 feature did not run/work. I'm not sure if that is the problem, but it is a start. When I try to run league it will take me to the login portion of the new client, then bluescreen sometime during the patching process.","replies":[{"poster":"Porocles","date":"2017-04-14T21:05:27.314+0000","up_votes":1,"down_votes":0,"body":"This could be an OS issue and possibly hardware if your screen continues to go blue.  I agree with Postal Twinkie, but the overall issue might be that your OS is out of date and failing to properly use drivers or locate necessary programs.  You may be lacking not just the framework but other products like Visual C++ and may run into more errors.  As your first step, I highly recommend updating your Windows to its current version.  Once complete, try again and let me know if you run into any trouble.","replies":[{"poster":"Marquis","date":"2017-04-14T21:14:45.371+0000","up_votes":1,"down_votes":0,"body":"I tried updating windows via the settings    >   update&security   >   check for updates, but while I was running the updates the computer bluescreened again.","replies":[{"poster":"Porocles","date":"2017-04-14T21:45:08.169+0000","up_votes":1,"down_votes":0,"body":"Ouch.  It sounds like there might be some kind of hardware failure.  Are there any error messages with the blue screen that could indicate what is specifically failing?","replies":[{"poster":"Marquis","date":"2017-04-15T03:31:49.140+0000","up_votes":1,"down_votes":0,"body":"Usually MEMORY_MANAGEMENT","replies":[{"poster":"Porocles","date":"2017-04-15T15:12:08.124+0000","up_votes":1,"down_votes":0,"body":"Thanks for this.  It looks  like there might be a pretty critical failure with your hardware, so this can happen at any moment and not just with League.  You can run through the [game crash](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes+) guide to check your system.  Also, take a gander around your PC as a whole and make sure your vents are clear to prevent any overheating.  If those steps don't work out, then you may need to get your pc checked in for some maintenance or repairs.  Hopefully, the guide will do the trick.","replies":[]}]}]}]}]},{"poster":"Postal Twinkie","date":"2017-04-14T20:15:28.713+0000","up_votes":1,"down_votes":0,"body":"You just need to download and install the Microsoft .Net Framework, located here....\n\nhttps://www.microsoft.com/net/download\n\nEDIT: Feel free to grab the latest version available. ","replies":[{"poster":"Marquis","date":"2017-04-14T21:13:19.338+0000","up_votes":1,"down_votes":0,"body":"When I tried to install it, it failed, saying: \nThe component store has been corrupted.\n\nError code: 0x80073712","replies":[{"poster":"S4t4nFollower","date":"2017-04-14T21:25:30.563+0000","up_votes":1,"down_votes":0,"body":"Hi, add me -snip-\ni think i can help you","replies":[]}]}]}]}