{"poster":"Candy Galaxy","date":"2018-11-19T12:30:11.658+0000","title":"Ayúdame a mejorar 💞","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Hola, si pudieran ayudarme con guias, consejos o videos, para poder mejorar, quiero poder llegar a mas este a&ntilde;o.","replies":[{"poster":"Winter Jones","date":"2018-11-23T17:33:32.290+0000","up_votes":1,"down_votes":0,"body":"Hola!\n\nYo me concentraría en un farmeo perfecto y en rotar siempre a tiempo. Para eso te recomiendo ver vídeos como éste: https://www.youtube.com/watch?v=CTdua0ita9E\n\nLuego echarte un vistazo al meta cada semana, en cada parche cada mínimo cambio te puede suponer una ventaja brutal.\n\nY lo que mejor te vendría sería tener una champion pool enorme. Que no importe que te baneen uno u otro, ya que siempre tendrás una reserva.\n\nSuerte con ello amigo ^^","replies":[]},{"poster":"FMT Distorsion","date":"2018-11-20T00:49:36.487+0000","up_votes":1,"down_votes":0,"body":"te recomiendo mirar los videos de youtube que compilan proplayers, y los que te parezca que te van a servir a vos, empezá a seguirlos, yo que intento mainear jg miro mucho elojoninja que es un crack español, chusmia quienes son los pros de los mundiales e intenta seguirlos, dps literalmente hay 8 millones de guias, con aprender a farmear y jugar defensivo estas bien, dps de eso vaas a ir aprendiendo a tirarte, sabiendo tus daños y los del rival","replies":[]},{"poster":"SifGreatGreyWolf","date":"2018-11-19T20:07:15.960+0000","up_votes":1,"down_votes":0,"body":"Queres mejorar? Juga mas, asi vas a ir aprendiendo","replies":[]},{"poster":"Goser","date":"2018-11-19T16:43:04.263+0000","up_votes":1,"down_votes":0,"body":"Bueno, soloq se basa en carrear y para carrear necesitas capitalizar errores (Necesitas experiencia que solo ganas jugando). Usa uno o dos personajes si queres, o juga meta pero te volves bueno con un champ (otp) o jugas lo que este mas fuerte depende de vos. No es muy complicado, cuando dejas de echarle la culpa a tu team y empezas a fijarte porqué no pudiste carrear es cuando empezas a subir.","replies":[]},{"poster":"Doven","date":"2018-11-19T14:03:11.938+0000","up_votes":1,"down_votes":0,"body":"Lo que veo en tu opgg es que tenes miedo a fallarle a tu equipo, te estresa salir con un mal score y sentir que perder la partida es enteramente tu culpa. Esto claramente es malo y te esta impidiendo subir, lo que necesitas es mentalizarte de que todas las personas de tu equipo van a tener un nivel de juego peor al tuyo y que tu unica opcion es carrearlos. Yo no creo que estes aprovechando cada ventana a jugar agresivo y ahi recae el problema. Tus kdas tan buenos y tu pool champ de champs seguros no te va a servir para subir a platino. Creo que deberias empezar a jugar top o mid y centrarte en los fundamentos basicos del juego. Me gustaria ver una partida tuya para ver que cosas podrias hacer para mejorar, si queres agregame y te puedo ayudar. Tambien tengo algunas guias que te puedo pasar cuando las encuentre.","replies":[]},{"poster":"Este No Es Zelos","date":"2018-11-19T12:41:46.058+0000","up_votes":1,"down_votes":0,"body":"Habria que ver las partidas.\nAsi a priori te diría que con lux tenes 43% de wr, asique no se que tan viable sea tu forma de jugarla. Quizas pienses que es tu mejor pick, pero puede que no estes logrando objetivos con ella.\n\nPor otro lado con tresh estas en 50% y viendo que rondas el 38% de participación de kill (Y tresh es mucho mas iniciador que lux) asique quizás con el te estas enfocando mas en objetivos, yo diría que por estos simples números podes mejorar aun mas con tresh y apuntaría ahí. Otra buena opción de tu repertorio es lulu, sin duda.\n\nLux no es mala pero es inmóvil, y tresh, lulu y ahri si basan su juego en su movimiento entre y hacia campeones, puede que ese sea un factor clave en tu modo de juego.\n\nSaludos! y suerte!","replies":[]}]}