{"poster":"sindarin ithil","date":"2015-11-13T10:08:55.596+0000","title":"[Team] sucht einen Toplaner","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nWir sind auf der Suche nach einem Toplaner im Bereich gutes Silber bis mittleres Gold, wenns nen bisschen besser w&auml;re, ginge das auch noch, aber bewusst wollen wir keinen Platin- oder Diamant-Toplaner. Aber auch keinen Bronzespieler, wichtig sind Erfahrungen auf der Toplane und grundlegende Mechaniken (wie Positionierung,Farmen, Matchups und Teamfights unter anderem).\r\n\r\nWer wir sind:\r\nEine nette Truppe, freundlich aber direkt, und wir planen f&uuml;r die neue Season ein Team zu gr&uuml;nden, was das Teamspiel in den Hauptfokus setzt. Dabei spielt es keine Rolle ob du m&auml;nnlich oder weiblich bist, beide Geschlechter sind erw&uuml;nscht, wir sind eh schon geschlechtlich durchmischt.\r\n\r\nWir besitzen einen Teamspeak Server.\r\nUnsere Trainingszeiten sind momentan auf Dienstag und Donnerstag 19:30-22:30 festgelegt (wobei wir mindestens 3 Spiele pro Trainingseinheit absolvieren werden), und daran l&auml;sst sich momentan auch nicht viel r&uuml;tteln, Sonntag steht als freier und ungebundener Tag zur Verf&uuml;gung, wenn alle da sind und Lust aufn Zock, spricht nichts dagegen auch ein paar Rankeds zu spielen, ist aber im Gegensatz zu Di und Do keine Pflicht.\r\n\r\nWas die absolute Grundvorraussetzung f&uuml;r dich ist:\r\nDu besitzt ein funktionierendes Headset, TS3, P&Uuml;NKTLICHKEIT (sp&auml;ter wird es sicherlich auch m&ouml;glich sein, eine Whatsappgruppe zum abmelden o.&auml;. zu gr&uuml;nden bzw. auf anderen Plattformen)\r\nEs wird nicht ger&uuml;lpst, gefurzt oder gegenseitig geflamt im TS wir haben ANSTAND\r\nWie gesagt, wir sind grundlegend respektvoll unseren Gegnern gegen&uuml;ber und auch den Mitgliedern des Teams, aber es wird sicherlich auch Kritik verteilt und auch gern bekommen. Unser Shotcaller besitzt w&auml;rend des Spiels Allmacht, wir brauchen niemand der nur nach eigenem Ermessen handelt und sich nicht ins Team und seine Struktur einbinden kann.\r\nWir w&uuml;nschen uns, wenn du keine Teamrankeds spielst, dennoch deine favourisierte Lane die Toplane bleibt, sodass du stetig mit dem Anspruch herangehst, dich selbst in dieser Rolle zu verbessern. Wichtig w&auml;re uns, dass dein Interesse an unserem Team mit der Zeit sehr pr&auml;sent wird.\r\n\r\nWir sind alle im Altersdurchschnitt 24-29, w&auml;re nicht schlecht, wenn du in einem &auml;hnlichen Alter steckst, aber &auml;lter geht immer und minimum die Vollj&auml;hrigkeit sollte erreicht sein (sofern du erwachsen genug f&uuml;r uns bist, Geistige Lappen brauchen wir nicht)\r\n\r\nSolltest du noch Fragen haben und wir dein Interesse geweckt haben kannst du dich gern Ingame bei &quot;sindarin ithil&quot; (ohne Anf&uuml;hrungsstiche) melden","replies":[{"poster":"Vladimirus","date":"2015-11-14T00:11:10.903+0000","up_votes":1,"down_votes":0,"body":"Hey Sindarin Ithil,\n\nich hätte Interesse bei euch mit zu machen sofern ihr mir die Erlaubnis gibt, weil ich bin in SoloQ & Teamrank (5v5) Platin+. ._.\n\nIch bin 21 Jahre alt und habe mit LoL in Season 1 angefangen\nIch Spiele in Season 5 öfters Toplane hauptsächlich in SoloQ sofern es möglich ist. \nIn Teamrank hab ich unterschiedliche Rollen gespielt je nachdem wer dabei war.\n\nGut das ihr schon ein festen Shotcaller ausgewählt habt. Weil das immer so ein Problem war in manchen Teams oder Gruppen. \n\nBenutzt ihr evtl. Skype zum abmelden oder zum alternativen kontaktieren? Ts ist eh kein Problem solang es für euch kein Problem ist das ich hauptsächlich ts vorbei komme wenn es Gespielt wird bzw. Training oder was besonders Ansteht. Weil bin nicht wirklich so der Ts gammler Typ. xD\n\nAnsonsten wenn alles okay ist, bitte ich euch einfach mich zu adden und wünsch euch viel Spaß. ^^\n\nMfG\nVladimirus","replies":[]}]}