{"poster":"MasterRightClick","date":"2018-04-15T04:31:28.322+0000","title":"Maggical hablemos del spoiler ... foro ≠ reddit","subforum":"Esports","up_votes":13,"down_votes":2,"body":"Queria hacerte llegar este mensaje, sobre spoilers, supongamos que m&aacute;s de uno no pudo ver X final, como ya es costumbre te dicen quien gano en la pantalla de inicio de la sesi&oacute;n del tama&ntilde;o de 3/4 de la pantalla para que no te pierdas el spoiler... (como siempre hago, si no he visto X final no me meto al launcher ni al foro)... pero se podr&iacute;a hacer que el anuncio del foro no sea tan &iquest;spoiler? &quot;klg campe&oacute;n cls&quot; \r\n\r\nDigo... para alguien que por ahi por algun motivo de su vida no vio X final del dia y llega a su house a verla: 1- no tiene que meterse al foro 2- al juego... hasta ver la final (seeee... my bad... me meti al foro y me spoilee entero). Es una sugerencia que cambien un poco eso, porque alguien que se spoliea despues no ve la repeticion del encuentro (basicamente para ver esports del lol tenes que verlo en vivo)\r\n\r\nPero reddit tiene algo especial, ellos no te spoilean, no te dicen quien gano. Te sale el titulo del encuentro... ejemplo:\r\n\r\n**Mad Lions vs. Movistar Riders / EU Masters 2018 Spring - Group D / Post-Match Discussion **\r\n\r\nMe entendes? A menos que yo habra el link ellos no me spoilean con el titulo quien gano, y ese es mi punto, que el Anuncio deber&iacute;a ser as&iacute; y no tan bestialmente claro con respecto a quien gano...\r\n\r\n**-Simplemente personal**::: porque ahora no veo la final y eso baja la audiencia de la gente que ve el replay de su esport y como yo hay miles m&aacute;s porque se spoilean antes de poder ver lo que quer&iacute;an ver\r\n\r\nUn saludo","replies":[{"poster":"Riot Maggical","date":"2018-04-15T05:12:15.018+0000","up_votes":16,"down_votes":1,"body":"Se entiende. Lo tendré en cuenta aunque no puedo prometer hacerlo, la verdad es que el título del Foro se genera automáticamente con la Noticia de la página, no los puedo controlar por separado.\n\nIgualmente te invito a ver la Final, fueron partidas impresionantes... ¡Un abrazo!","replies":[{"poster":"Mioen","date":"2018-04-15T11:56:27.859+0000","up_votes":4,"down_votes":0,"body":"¿Por qué anuncios tiene siempre -1?\n\nEsa es una pregunta que siempre re dejo intrigado.","replies":[]},{"poster":"Nuke","date":"2018-04-15T11:54:45.693+0000","up_votes":1,"down_votes":8,"body":">  el título del Foro se genera automáticamente con la Noticia de la página\n\nWow que locura :V\nEl futuro es hoy, viejo xdxd","replies":[]}]},{"poster":"FrankRAM","date":"2018-04-17T18:50:38.707+0000","up_votes":1,"down_votes":0,"body":"algún día vas a estar como yo, que me meto a este foro una vez por año, aguante Reddit.","replies":[{"poster":"MasterRightClick","date":"2018-04-17T20:23:40.882+0000","up_votes":1,"down_votes":0,"body":"Se, lo he pensado seriamente. Me esta empezando a dar asco el foro por muchas cosas que pasan acá y allá no","replies":[]}]},{"poster":"Ch4puLin","date":"2018-04-15T22:47:58.136+0000","up_votes":1,"down_votes":0,"body":"Estoy totalmente de acuerdo.\nUna vez había propuesto que pongan títulos sin spoiler, arruina totalmente las ganas de ver las partidas.\nDigamos un \"Y el campeón es...\"\nCualquiera que lo lea sabe que ya se jugó, cumple la función de informar, y es decisión del espectador entrar a ver el resultado o ver los partidos.","replies":[]},{"poster":"Hiei ValianT","date":"2018-04-15T20:45:55.279+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lulu}}","replies":[]},{"poster":"asdmaskldmnkfl","date":"2018-04-15T19:35:17.752+0000","up_votes":1,"down_votes":0,"body":"Maggical extraño tu entrevista post partido del año pasado","replies":[]},{"poster":"Rakiltx","date":"2018-04-15T14:23:29.462+0000","up_votes":1,"down_votes":0,"body":"Quizas es la costumbre.\nYa que siempre en otros ambitos por ejemplo de futbol, no ponen un titulo como: Quien gano? El barca o el real? Sino ponen: \"Real Madrid campeon!!!\"\nPero igual suerte y la prox acordate de que aparece en el launcher.","replies":[]}]}