{"poster":"SirKraht","date":"2017-03-03T17:35:54.794+0000","title":"Rework della mummia triste","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Vorrei tanto che reworkassero amumu, &egrave; praticamente da quando &egrave; uscito che &egrave; rimasto cos&igrave;....secondo me un rework ci starebbe non solo come ma vi starebbe.\r\nCos&igrave; magari diventa felice ahahahah.\r\nDitemi: voi che ne pensate?","replies":[{"poster":"O V T R Λ G E","date":"2017-03-04T10:23:13.282+0000","up_votes":2,"down_votes":0,"body":"amumu è ancora un buon pick per la giungla molto semplice da usare e da molte soddisfazioni al momento si vede che è vecchiotto ma più che nel suo kit onestamente lo è nell'aspetto imho un rework grafico al massimo sarebbe buono ma come gameplay sta bene al momento","replies":[{"poster":"SirKraht","date":"2017-03-12T17:16:10.116+0000","up_votes":1,"down_votes":0,"body":"è vero che nel kit è messo bene comunque ma se è per questo anche altri champ che sono stati recente mente reworkati: come yorick ad esempio, non era il massimo ma la sua ulti ad esempio era una specie di sion, ma un po piu forte e i suoi ghoul erano molto piu utili di adesso....ovviamente secondo me.\ncomunque grazie di aver risposto{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Jeanne dˆArc","date":"2017-03-03T17:47:15.243+0000","up_votes":2,"down_votes":0,"body":"Per quanto sia vecchio il kit di Amumu, è ancora funzionale e personalmente amo giocarlo. Al momento Amumu è un champion a cui la Riot vorrebbe effettuare un rework completo, ma al momento ci sono già altri rework programmati e la lista di altri champ che vogliono reworkare è bella lunga, quindi non ti aspettare nulla nel breve periodo.","replies":[{"poster":"SirKraht","date":"2017-03-12T17:11:23.935+0000","up_votes":1,"down_votes":0,"body":"anche a me piace giocarlo ma è un champ che non viene reworkato da quando è nato sia l'aspetto che il kit.\ncomunque si, è bello giocarlo, ma un bel rework ci starebbe su di lui secondo me.\ngrazie per la risposta{{champion:32}}","replies":[]}]},{"poster":"Khail the Crow","date":"2017-03-04T02:34:58.142+0000","up_votes":1,"down_votes":0,"body":"Non è nel rework they tank e non è previsto un rework del champ da solo. In effetti funziona, si sente che è vecchiotto ma funziona.","replies":[{"poster":"SirKraht","date":"2017-03-12T17:12:40.018+0000","up_votes":1,"down_votes":0,"body":"vecchiotto?\nzilean in confronto è un giovanotto{{sticker:slayer-jinx-wink}}","replies":[]}]}]}