{"poster":"Luminous Raven","date":"2019-07-29T09:16:57.323+0000","title":"Zu den aktuellen Connection Problemen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe gerade ein Ticket an den Support geschrieben und recht zügig eine Antwort bekommen :\r\n\r\nMassenantwort incoming :v\r\n\r\nWir haben gesehen das es in EUW und EUNE sehr viele Probleme gibt.\r\nWas genau und wo wissen wir noch nicht, jedoch möchte ich mich vorerst schonmal bei Euch melden.\r\nDa der Loss-Prevented anscheind auch nicht angeht.\r\n\r\nVORERST KEINE RANKEDS SPIELEN!\r\nWahrscheinlich kannst du das sogar auch gar nicht.\r\nAber nur im Fall der Fälle.\r\n\r\nDenn nachträglich können wir nicht ins Matchmaking eingreifen... Die LP und MMR sind daher weg...\r\n\r\nEs dauert eine Weile bis wir es korrekt durchgereicht haben und wie groß der Impakt dieses Problem ist.\r\nTut mir echt leid das die Woche so beginnen muss :(\r\n\r\n\r\n\r\nFür weitere Infos (die momentan nicht existieren), schau auf unseren Live-Ticker:\r\nhttps://status.leagueoflegends.com/#euw\r\n\r\nAuch wenn es dort nicht steht heißt es nicht das wir es nicht wissen...\r\nEs wurde halt noch nicht übersetzt und global ausgegeben.\r\n\r\nWas wir als Kompensation bzw. Gutmachung hergeben ist auch noch nicht bekannt.\r\nDiese Nachricht ist rein informativ :c\r\n\r\nVersuch soweit es geht nicht auf diese Nachricht zu antworten.\r\nWir haben einfach zu viel hierzu q_q\r\n\r\nSorrrry!\r\nLiebste Grüße!\r\n\r\nWalldasher\r\nRiot Game Player Support Adviser Tech Specialist","replies":[{"poster":"Dreyka Kintaso","date":"2019-07-29T10:05:51.145+0000","up_votes":1,"down_votes":0,"body":"Pfft und meinen Freunden die sich auch beim Support gemeldet haben bekommen nur die Antwort \"Das liegt an deinem PC nicht an uns. Bitte deaktivier alles und probier es aus ob es klappt wenn nicht meld dich nochmal.\" Dann meldet man sich nochmal darauf und es kommt mehr wie \"tja pech\" als das man versucht zu helfen. Gut das die davon Wissen und dran arbeiten wollen wenn die herausgefunden haben woran es liegt. Danke das du zeigst dass da auch eine normale Anwort kommt.","replies":[{"poster":"Luminous Raven","date":"2019-07-29T10:23:41.373+0000","up_votes":1,"down_votes":0,"body":"Ich hatte bisher bei allen Anliegen mit dem Support nur gute Erfahrungen. Oft dauert es zwar etwas bis sie antworten (heute nicht aber sonst) aber trotzdem wirken sie recht kompetent ^^","replies":[{"poster":"Dreyka Kintaso","date":"2019-07-29T10:50:10.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Snipertod,realm=EUW,application-id=7hciEY9w,discussion-id=nlGEh7ge,comment-id=00010000,timestamp=2019-07-29T10:23:41.373+0000)\n>\n> Ich hatte bisher bei allen Anliegen mit dem Support nur gute Erfahrungen. Oft dauert es zwar etwas bis sie antworten (heute nicht aber sonst) aber trotzdem wirken sie recht kompetent ^^\n\nNormalerweise bekomme ich bzw. meine Freunde auch gute Antworten die wirklich helfen, aber bei dem Problem leider nicht. :(","replies":[]},{"poster":"COWAS NoMercy","date":"2019-07-29T10:31:45.867+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Snipertod,realm=EUW,application-id=7hciEY9w,discussion-id=nlGEh7ge,comment-id=00010000,timestamp=2019-07-29T10:23:41.373+0000)\n>\n> Ich hatte bisher bei allen Anliegen mit dem Support nur gute Erfahrungen. Oft dauert es zwar etwas bis sie antworten (heute nicht aber sonst) aber trotzdem wirken sie recht kompetent ^^\n\nSie versuchen zumindest immer ihr Bestes.","replies":[]}]}]},{"poster":"Bot Garbage","date":"2019-07-29T09:28:06.082+0000","up_votes":1,"down_votes":0,"body":"Aber auf die Idee Ranked zu disablen kommen die nicht. Oder eine Warnung im Client zu packen, dass man LP verlieren kann aktuell durch diese Probleme. Wäre ja wieder zu viel Arbeit für eine Small-Indie-Company.","replies":[]}]}