{"poster":"Grazii99","date":"2015-12-25T20:14:07.802+0000","title":"Premade... E allora?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Da quello che ho capito (correggetemi se sbaglio) i premade sono coloro che giocano con uno o pi&ugrave; amici..\r\nNel caso in cui io abbia ragione, perch&eacute; dovrebbero avere la precedenza sugli altri giocatori?\r\n\r\nGrazie in anticipo e buon Natale :3\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"TinderBow","date":"2015-12-27T01:29:44.967+0000","up_votes":2,"down_votes":0,"body":"Se non ti minacciano, magari fai l'anima Pia e lasciagli la bot, altrimenti sbattitene e gioca cosa hai chiamato.\nDel report fregatene, mi hanno minacciato cosi tante volte(senza motivo per giunta) e non sono mai stato bannato, i report dei premade non contano molto.","replies":[]},{"poster":"kirchhoff","date":"2015-12-27T01:22:04.534+0000","up_votes":2,"down_votes":0,"body":"Che precedenza?","replies":[]},{"poster":"XxShido91xX","date":"2015-12-26T16:05:32.894+0000","up_votes":2,"down_votes":0,"body":"non hanno la precedenza! se scrivi xx bot premade whit yy allora si ok, hanno giustamente chiamato la bot per primi e qui non ci piove...ma se tu scrivi adc prima e loro dopo se ne escono con premade whit bla bla bla allora là sei tu che decidi se lasciargli la lane o meno...possono minacciarti di report e tutto ma cmq sia chi ultimo arriva mal alloggia si sà, quindi fregatene e ricordaglielo","replies":[]},{"poster":"Pls Buff Shen","date":"2015-12-25T23:01:23.204+0000","up_votes":2,"down_votes":0,"body":"ma come? non è bello quando una premade di spagnoli con tf adc e anivia supp feddano andando 0/20? mah non ti capisco(storia vera).","replies":[]},{"poster":"ShowterX","date":"2015-12-25T20:55:38.303+0000","up_votes":3,"down_votes":1,"body":"penso che con precedenza intenda che, quando entri in una stanza se tu scrivi bot, ma ci sono 2 premade bot loro vogliono avere la precedenza, ovvero andare bot anche se lo hanno scritto per ultimi ... cosa che anche io odio e infatti instanlokko subito così si attaccano al cazz..","replies":[{"poster":"Grazii99","date":"2015-12-26T01:19:41.945+0000","up_votes":1,"down_votes":0,"body":"Con precedenza intendevo proprio questo :)\nIl bello è che poi ti minacciano pure il report (che poi ancora vorrei capire con quale motivazione vorrebbero reportarmi..)","replies":[]}]},{"poster":"Tankerous","date":"2015-12-25T20:47:33.362+0000","up_votes":1,"down_votes":0,"body":"Non so di che \"precedenza\" tu stia parlando, ma è abbastanza palese che la Riot stia spingendo verso un gameplay più favorevole alle premade. La rimozione della differenza tra \"solo\" e \"duo\" nelle ranked, anzitutto. Il che ha senso: favorisci la collaborazione tra giocatori, ed è più probabile 1) attirare nuovi giocatori, invitati da amici, e 2) tenersi stretto i giocatori attuali grazie ai legami che crei.","replies":[]},{"poster":"ubercodlegend200","date":"2015-12-25T20:42:54.262+0000","up_votes":1,"down_votes":0,"body":"nei report? nei report se giochi premade e reporti qualcuno il tuo report vale la metà tipo in generale ha ragione chi ha ragione non è che  se due persone dicono una cosa è giusta","replies":[]},{"poster":"MyXanadu","date":"2015-12-25T20:28:22.789+0000","up_votes":1,"down_votes":0,"body":"Non hanno nessun tipo di precedenza mi pare","replies":[]},{"poster":"Mytlix","date":"2015-12-25T20:21:06.611+0000","up_votes":1,"down_votes":0,"body":"In che senso avere la precedenza?","replies":[]}]}