{"poster":"UltraLion","date":"2016-03-03T13:39:21.095+0000","title":"Tempo x iniziare un Game??","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Trovo assolutamente nauseabondi i tempi di attesa osceni per startare un game, sono in coda da 18 minuti e 30, a circa 10 ero in selezione, poi qualcuno non ha loccato qualcosa o &egrave; uscito, ed ecco che prosegue a cercare, in media poi prima di startare un game devo rifare la selezione 3 o 4 volte, complice la follia di fare uscire dalla selezione se non si locca il ban o il campione...\r\nSuccede solo a me o anche a voi? Quanto impiegate per startare un game?","replies":[{"poster":"SuperVergo","date":"2016-03-03T14:29:32.108+0000","up_votes":2,"down_votes":0,"body":"Dipende...se vai support tempo 1 minuto e sei nella selezione se cambi ogni tanto mi ci vuole anche 5 minuti buoni, quando vedo che ci impiega tanto annullo e la rifaccio, tempo 30 secondi e ti trova un game","replies":[{"poster":"Foschìa","date":"2016-03-03T15:17:52.973+0000","up_votes":1,"down_votes":0,"body":"Idem.\n\nIo gioco solo la sera, massimo 1 minuto e sono in lobby. Se arrivo a 2 minuto chiudo e ristarto la coda, tempo 30 secondi ed entro. Con ruoli Mid e Top eh","replies":[]}]},{"poster":"DuckQuack0","date":"2016-03-03T19:09:46.956+0000","up_votes":1,"down_votes":0,"body":"Fammi indovinare\nRuolo principale Mid\nRuolo secondario Top","replies":[{"poster":"UltraLion","date":"2016-03-04T14:09:42.504+0000","up_votes":1,"down_votes":0,"body":"Giungla e mid.. prima 4 minuti ho iniziato una nuova coda e sono già a 3 e passa, ora una nuova ancora... che noia","replies":[]}]},{"poster":"CicciaBauBau","date":"2016-03-03T21:57:21.243+0000","up_votes":1,"down_votes":0,"body":"Oggi ho messo Mid e Support\n\nMi ha messo Mid. {{champion:36}}","replies":[]},{"poster":"UltraLion","date":"2016-03-03T18:11:09.493+0000","up_votes":1,"down_votes":0,"body":"Anche io se supero i 2 minuti rifaccio e trova subito, o meglio, così mi accadeva, oggi è andata diversamente, magari sarà stato un caso, ma la selezione da rifare 8 volte però potrebbero evitarcela, se qualcuno non locca il ban è così problematico? Se uno ha scelto il campione e deve andare un attimo al bagno stile capatonda, e lasciatelo andare zzarola","replies":[]},{"poster":"LionHeartV","date":"2016-03-03T16:43:46.756+0000","up_votes":1,"down_votes":0,"body":"spero reintroducano il cercasquadra da affiancare alla coda dinamica","replies":[]},{"poster":"Killer SurpRyze","date":"2016-03-03T16:38:11.832+0000","up_votes":1,"down_votes":0,"body":"boh, io cerco sempre top o mid (e incredibilmente a volte mi mette mid!) e difficilmente devo aspettare più di 5 minuti. Ma magari sono fortunato con gli orari","replies":[]},{"poster":"Ucr0niA","date":"2016-03-03T14:09:44.250+0000","up_votes":1,"down_votes":0,"body":"Metti fill.","replies":[]},{"poster":"ShowterX","date":"2016-03-03T13:52:09.404+0000","up_votes":1,"down_votes":1,"body":"a me non succede quasi mai... solo in aram ecco.. massimo una volta non di più....","replies":[]}]}