{"poster":"UltraLion","date":"2015-06-27T15:50:45.792+0000","title":"Maestrie","subforum":"Discussioni generali","up_votes":4,"down_votes":3,"body":"Ciao gente, ora che il gioco a fine partita da un voto al giocatore singolo, non potrebbero assegnare i punti nelle ranked in base a quello? Ne hanno mai parlato? Se &egrave; una cattiva idea perch&egrave; lo &egrave;?\r\nSe davvero il sistema ranked deve restare cos&igrave; com&#039;&egrave;, almeno mi piacerebbe una modalit&agrave; alternativa, per chi si vuole divertire facendo anche partite classificate, dove viene premiato il suo andamento singolo in game, potrebbero chiamarla Runkid o Ubaldo, poco importa, a qualcuno piacerebbe?","replies":[{"poster":"Re Sombra","date":"2015-06-27T16:19:11.344+0000","up_votes":5,"down_votes":0,"body":"Amico da quanto giochi a lol????\nNo perche vedo che ti e sfuggito un particolare.\nLOL E UN GIOCO DI SQUADRA!\nOra se la gente non sa farlo o e troppo deficente per  non capirlo e un'altro discorso,ma cio non significa che si debba cambiare tutto quanto.","replies":[]},{"poster":"NiraBlade","date":"2015-06-27T16:38:15.800+0000","up_votes":2,"down_votes":0,"body":"prova a pensare un momento: se il voto fosse la cosa che stabilisce gli lp, molte persone quando ci sono i tf scapperebbero a gambe levate quando le cose si mettono male per non rovinarsi il punteggio. Fai conto che mi è capitato un silver che nelle normal diceva questo, quindi figurati se passasse la tua idea il caos che si creerebbe. \nPenso per questo motivo l'obiettivo che hai è eliminare il tuo nexus, non importa se devi trascinarti i tuoi compagni dietro perché sono più inesperti di te, non importa se devi buildarti un support come un adc perché quello che doveva fare danni ha abbandonato la nave. Butta giù quel nexus, il resto non conta.\n\nBtw credo che avere modalità di gioco diverse sia una cosa bella, perciò avere una modalità a parte dove il KDA/voto a fine partita conti qualcosa non mi dispiacerebbe (anche se penso dovrebbero fare una mappa a parte dove l'obiettivo sia diverso). Bisognerebbe ristudiare l'intero concept del game solo per questa modalità, quindi significa molto lavoro e credo non sarà facile.","replies":[]},{"poster":"UltraLion","date":"2015-06-27T16:44:52.954+0000","up_votes":1,"down_votes":0,"body":"Non ci avevo pensato, anche se ci sono dei però.. A potrebbero lasciare tot punti assegnati a seconda del se si vince o si perde, B se non stai nei team fight, non puoi ne killare ne avere assist, quindi se lo fai perchè il tuo risultato in quel momento è 5/2/5, sei comunque un ca**one, perchè il tuo team perderà il tf, il nemico si fidderà, e quando ti imbatterai in qualcuno avrai poche possibilità ugualmente di mantenere il tuo score positivo. (ovvio che andare afk dovrebbe comportare un voto negativo ugualmente)\nA parte tutto il voto delle mastrie dipende solo dal KDA, o vede anche altri aspetti? Non sono informato..","replies":[{"poster":"Lord Valotz","date":"2015-06-27T17:06:21.180+0000","up_votes":1,"down_votes":0,"body":"Kda, presenza alle kill, minion farmati al minuto, ward piazzate e distrutte, danni inflitti, gold guadagnato, torri distrutte, ecc. Il tutto rapportato alla media generale che si ottiene con quel personaggio  in quel  ruolo.","replies":[{"poster":"UltraLion","date":"2015-06-27T18:38:35.953+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Valotz,realm=EUW,application-id=MJVj50Jw,discussion-id=Nr9jTEFV,comment-id=00030001,timestamp=2015-06-27T17:06:21.180+0000)\n>\n> Kda, presenza alle kill, minion farmati al minuto, ward piazzate e distrutte, danni inflitti, gold guadagnato, torri distrutte, ecc. Il tutto rapportato alla media generale che si ottiene con quel personaggio  in quel  ruolo.\n\nNon male come sistema di valutazione!","replies":[{"poster":"Lord Valotz","date":"2015-06-27T18:42:58.808+0000","up_votes":1,"down_votes":0,"body":"Sulla carta dovrebbe funzionare così se poi sia più  o meno preciso non so a volte da voti più  alti di quello che uno si aspetta e a volte più  bassi, però  in linea di massima è  abbastanza coerente.","replies":[]}]}]},{"poster":"Ryuuzouji Fyrom","date":"2015-06-27T17:05:09.602+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UltraLion,realm=EUW,application-id=MJVj50Jw,discussion-id=Nr9jTEFV,comment-id=0003,timestamp=2015-06-27T16:44:52.954+0000)\n>\n> Non ci avevo pensato, anche se ci sono dei però.. A potrebbero lasciare tot punti assegnati a seconda del se si vince o si perde, B se non stai nei team fight, non puoi ne killare ne avere assist, quindi se lo fai perchè il tuo risultato in quel momento è 5/2/5, sei comunque un ca**one, perchè il tuo team perderà il tf, il nemico si fidderà, e quando ti imbatterai in qualcuno avrai poche possibilità ugualmente di mantenere il tuo score positivo. (ovvio che andare afk dovrebbe comportare un voto negativo ugualmente)\n> A parte tutto il voto delle mastrie dipende solo dal KDA, o vede anche altri aspetti? Non sono informato..\n\nda il voto in base ai kda migliori del server su quel champ","replies":[]}]},{"poster":"UltraLion","date":"2015-06-27T16:27:22.998+0000","up_votes":1,"down_votes":1,"body":"Il fatto che il gioco sia fatto in un modo non vuol dire che non possa essere cambiato da nuove idee, League Of Legends è in costante sviluppo e cambiamento; detto questo aggiungere una modalità classificata differente non cambierebbe il sistema già consolidato, che a molti piace ma a me per niente.\nGioco di squadra quando sei  nelle \"solo\" , già il nome stride con squadra, con sconosciuti che fanno quello che capita, ed il massimo della comunicazione che c'è è ricevere insulti, non credo che sia la definizione migliore.","replies":[]}]}