{"poster":"TheGoose111","date":"2017-07-30T00:16:34.167+0000","title":"Perma Stuck at honor Level 1??","subforum":"Miscellaneous","up_votes":1,"down_votes":4,"body":"Okay so I got chat bans literally a few days after honor came out, and, I was demoted to level 1. But recently, everyone has been hitting level 3, and I still haven&#039;t got back up to level 2 yet with COUNTLESS clean games. I&#039;ve had over 100 Games without flaming or anything like wtf. They said themselves a few clean games will get you back up. No it is not LOCKED anymore, it stayed locked for about 5 days and then now I can level up to 2 but i don&#039;t think I&#039;m making any progress. My friend was demoted for like 20 games with chat bans and low priority queue, and he got back to honor level 2 in like 3 days?? Tf? I&#039;ve been stuck like this for over a month. Help meeee.","replies":[{"poster":"prodigally","date":"2017-09-15T16:51:12.016+0000","up_votes":2,"down_votes":0,"body":"Hello, have you made any progress ? Seems like exact same thing for me...","replies":[]},{"poster":"Comcraze53","date":"2017-09-28T13:19:29.054+0000","up_votes":2,"down_votes":1,"body":"yup, ive got this, drunk flamed everyone a month or so ago, dropped from level 3 to 1, now ive been stuck at level 1 for way longer than it took me to go from lvl 2-3. I've given up trying to be honest, its the hope that kills you. I play dota more than lol anyways these days now, the community is nicer so you feel bad flaming, virtuous circle and all so I've never got in trouble there.","replies":[{"poster":"DipperOCE","date":"2017-09-29T08:34:12.687+0000","up_votes":2,"down_votes":1,"body":"the dota community is just as bad as league lol they are either toxic tryhards, hardcore anime avatar weeaboos or no-life 4 chan users (my best friend has been 4000-5000 mmr btw)","replies":[]}]},{"poster":"Nikkip","date":"2017-07-30T03:38:34.008+0000","up_votes":1,"down_votes":0,"body":"Well they've said that just playing to win and getting clean games will give you progress, but I expect it's somewhere between a pittance and completely negligible compared to getting honor directly from your teammates. If you aren't getting honor occasionally, or frequently, from your team you might be playing all season just to climb up one level.\n\nI'm still not sure if them saying that 'playing to win and getting clean games can still give you progress' wasn't just them referring to the little extra honor everyone gets when all team mates give out an honor after a match, which they may have assumed would happen more frequently than it does, which would mean that a lot of matches where you're not getting reported or anything may still be giving no honor progress at all.","replies":[]}]}