{"poster":"Tresalia","date":"2019-08-16T10:30:49.273+0000","title":"Perchè perdo sempre nelle ranked?","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"salve ragazzi, nelle ranked perdo sempre e non sono male come support ma nei team capitano sempre gente che è piu impedita di me perchè????\r\n{{sticker:sg-soraka}}","replies":[{"poster":"liberodaniele","date":"2019-08-16T12:35:33.377+0000","up_votes":2,"down_votes":1,"body":"Secondo me il problema sta nella frase\n\n>ma nei team capitano sempre gente che è piu impedita di me perchè?\n\nCome mai ti sembra sempre che i tuoi compagni facciano un sacco di errori?\n\nCi sono due possibilità:\n1) Hai moltissima sfortuna e ti capitano sempre compagni di squadra molto scarsi.\n2) Discorso lungo, che ha bisogno di una lunga premessa. Ognuno di noi mentre gioca ha un'idea abbastanza precisa di quale sia la cosa ottimale da fare in una certa situazione, e classifica come errori tutti i comportamenti che si discostano da questa idea. Questo semplice fatto ha due implicazioni:\n\n- Dato che nessuno è perfetto capita che quello che per noi sarebbe un comportamento ottimale in realtà non lo sia, e andiamo a quindi a giudicare certe cose come errori anche se in realtà non lo sono. \n\n- Dato che tendezialmente ci comportiamo nella maniera ritenuta da noi ottimale ai nostri occhi non facciamo mai errori\n\nPer spiegare quello che intendo provo a fare anche un esempio di una cosa che succede abbastanza spesso botlane. \nFase lane, adc + supp vs adc + supp\nUno dei due supp vede una situazione che secondo lui è favorevole e si convince che se ingaggiasse si riuscirebbe a uccidere la botlane nemica. L'adc invece per come è messa la lane è convinto che anche con un buon ingaggio non si riuscirebbe a combinare niente.\nIl support decide di ingaggiare, entra in mezzo ai nemici e inizia a picchiarsi. Il suo adc invece continua a farmare. Il supp muore.\nIl supp si arrabbia con l'adc perchè non l'ha seguito, l'adc si arrabbia col supp perchè ha ingaggiato in un momento poco opportuno. Risultato: entrambi sono convinti di aver giocato correttamente e che il suo compagno di squadra sia un \"incarriabile rifiuto umano\" o qualcosa del genere. Magari uno aveva ragione, magari avevano torto entrambi. L'unica cosa certa è che entrambi sono sicuri di essere nella ragione.\n\nTutta questa premessa era per dire che l'altra possibilità è che ti sembra che gli altri facciano molti più errori rispetto a te perchè non vedi i tuoi di errori. Se prendi un'altra persona e le fai vedere i replay delle tue partite vedrai che ti indicherà un sacco di tuoi movimenti (che tu reputavi corretti) come \"errori\"; migliori saranno le capacità \"lollistiche\" della persona interpellata e più le sue indicazioni saranno tendenzialmente corrette.\n\nTL.DR. Ti sembra che gli altri sbaglino più di te perchè non vedi i tuoi errori, per provare a migliorare prendi qualcuno di più bravo e fatti dire cosa sbagli.","replies":[{"poster":"Tresalia","date":"2019-08-16T12:43:00.291+0000","up_votes":2,"down_votes":0,"body":"buahhahahahaha ma io sono d'accordissimo mi ci ritrovo benissimo in quello che dici ma perchè anche il jungle il mid e il top? e due afk? e il support nemico muore 3000 volte ma vincono lo stesso non potevo fare io parte di quel team io aspetto ancora una risposta e credo che sia... TRESALIA SIEDITI DEVO DIRTI UNA COSA...SEI UNA SFIGATA!!!!!!!! xD","replies":[{"poster":"liberodaniele","date":"2019-08-16T14:05:42.419+0000","up_votes":1,"down_votes":0,"body":"Mi sa che ti è sfuggito il punto: cerca di guardare i tuoi errori, correggili (il modo più veloce è avere l'aiuto di qualcuno) e vedrai che le cose cambieranno. \nComunque in un ultimo disperato tentativo di farti capire quanto sia distorta la tua visione delle cose riporto i punteggi dei support nemici nelle tue sconfitte e i tuoi punteggi nelle tue vittorie:\n12/5/16\n7/0/25\n6/1/12\n0/5/7\n16/2/9\n5/4/13\n8/7/15\n2/5/13\n5/3/5\n7/5/18\nkda medio = 201/37=5.43\nmorti medie = 3.7\n0/4/8\n0/2/9\n4/7/16\n1/2/4\n1/5/5\nkda medio = 48/20=2.4\nmorti medie = 4\nOvviamente il kda e le morti non sono tutto, ma come vedi in media i supporti avversari quando vincono hanno meno morti e un kda più alto rispetti a quelli che hai tu quando vinci. In 10 partite di cui ho preso i punteggi in un singolo caso un supporto nemico ha vinto con un brutto (&lt; 2) kda.","replies":[]}]}]},{"poster":"Bylloo","date":"2019-08-16T10:52:26.193+0000","up_votes":1,"down_votes":0,"body":"Ho visto i tuoi game: 3 appunti\n\n1) Yuumi non è un champion da giocare ad elobasso, essenzialmente perchè serve coordinazione (cosa che giustamente non esiste nell' elo-hell)\n2) Non cerchi mai di salvare il tuo adc, piuttosto scappi facendo morire la persona che più deve carryare nel tuo team\n3) i support come soraka,yuumi,lulu etc.. ossia che non hanno dano e si basano tutti sulla bravura del proprio adc, sono ingiocabili nell'elo basso per motivi ovvi, per ora ti consiglio di giocare supprot che hanno alti danni e che possono carryara senza adc, un adc è bravo quando ha almeno 6 minion per minuto, se non li ha, rubagli tutte le kill e carrya da midlaner\n\ndi nulla :)","replies":[{"poster":"liberodaniele","date":"2019-08-16T11:46:23.711+0000","up_votes":2,"down_votes":1,"body":"Questi consigli (a prescindere dalla loro validità) secondo me sono inadatti alla domanda. Guardando il wr complessivo viene spontaneo pensare che più che un problema di campioni giocati alla base ci siano gravi carenze per quello che riguarda la conoscenza delle meccaniche di gioco.","replies":[{"poster":"Tresalia","date":"2019-08-16T12:21:25.567+0000","up_votes":1,"down_votes":0,"body":"ma proprio il win rate è il mio problema perchè tutti muoiono e trollano lo capisci!!! un sona adc!!!! vabbe basta ora gioco urgot support e vediamo cosa mi dicono","replies":[{"poster":"liberodaniele","date":"2019-08-16T12:54:50.025+0000","up_votes":1,"down_votes":1,"body":"Nella tua ultima partita hai avuto sona adc e hai perso, in quella prima eri contro veigar adc e hai perso, in quella prima ancora eri contro alistar mid e hai vinto, in quella prima ancora eri contro sona mid e hai perso, in quella prima ancora avevi graves adc e avete vinto un po' di partite prima eri contro jax/riven bot e avete perso.\n6 partite\n2 con pick \"troll\" dalla tua, ne hai vinta 1, wr 50%\n4 con pick \"troll\" contro e ne hai vinta sempre una, wr 25%\n\nIl tuo winrate contro i trollpick è la metà rispetto a quando li hai in squadra. Prega per trovarti più sona adc!\n\nComunque come vedi i troll sono ovunque, sia con che contro, e tutto sommato non sembra che sia così vero pick troll = sconfitta. Il campione che si gioca ha un peso relativo, conta molto di più avere e mettere in pratica un \"piano di gioco\" solido (che consideri i punti di forza/debolezza del campione che si sta giocando). Per il resto ho fatto un commento più lungo sopra.","replies":[]}]}]},{"poster":"Tresalia","date":"2019-08-16T12:06:54.535+0000","up_votes":1,"down_votes":0,"body":"guarda allora non credo che hai visto i miei game perchè con yuumi cerco di stare seduta sul adc proprio per curarlo quando ha poca vita lo riempio di buff con tutti i support che uso lulu annessa quindi sicuramente può essere come dici che pretendo troppo da questi adc e devo sempre giocare lux o morgana, poi mi riferisco al commento di liberodaniele (buahahahahahhaa) cioè dai ragazzi ok facciamola seria la cosa perchè ci sono tornei e viene considerato uno sport con sacchettino scalda polso, però cercate di fare meno i professori e arroganti sembra che qualsiasi giocatore di lol con un elo superiore l'oro sia stato incaricato a costudire il mistero di league of legend e delle meccaniche di gioco per salire di elo nelle ranked  cioè ho semplicemente chiesto perchè perdo sempre è statisticamente improbabile, anche perchè i support del team avversario ha 0/13/8 eppure si ritrova con jungler o top che fanno 20 kill spiegatemi questo e quello che voglio sapere!!!! grazie di vero cuore","replies":[{"poster":"C0RTES","date":"2019-08-18T00:58:12.835+0000","up_votes":1,"down_votes":0,"body":"Partiamo dal fatto che c’è una base di skill, a parte i campioni che possono essere più o meno rotti, ma se non hai le mani non ci fai un cazzo. Guardando i tuoi game più o meno tutto il team ha un KDA molto negativo, ora, dato che non ho modo di vedere realmente le partite che hai fatto, non posso dire quante cagate possiate aver fatto tu e quelli del tuo team, ma possono essere innanzitutto nella conoscenza del gioco in sé, nei trade, o nei teamfight. Come detto da altri utenti a elo basso non si può contare troppo sull’ADC, nei tf conterebbe di più perfino il supp, ma anche tu hai la tua parte di colpa guardando il KDA. I troll in un modo o nell’altro ci sono sempre, ma sono troll che funzionano se hanno un senso e se il player ci sa fare, quindi sarebbe come un champ normale. Statisticamente è quasi impossibile perdere l’80% delle volte, può essere vero, ma solitamente vieni messo con gente più o meno del tuo stesso elo, ed è più probabile che siano scarsi, quindi le conseguenze puoi trarle facilmente. Ora, ti parlo da compagno del bronzo, se vuoi proprio giocare support, prendi un tank, è quasi una garanzia. Da troller ti direi di provare anche qualche champ troll, ma che funzionano piuttosto bene (es gragas o malph full ap), ma se vuoi giocare serio vai con champ come nautilus o Leona, se non vinci la bot, avrai comunque una possibilità di dare utility al team con i cc e tankando","replies":[]},{"poster":"liberodaniele","date":"2019-08-16T13:29:13.534+0000","up_votes":1,"down_votes":1,"body":"Ricapitolando:\n\n- Sai che è \"tatisticamente improbabile\" avere il team peggiore nell'80% dei casi\n- Sai quindi che qualcosa sbagli, e chiedi aiuto per capire cosa (o ha aperto questo postper sentirti dire \"eh hai solo sfortuna, non puoi farci niente\"?)\n- Insulti chi ti dice che avresti bisogno di un aiuto per correggere in tuoi errori\n \nTra l'altro vorrei evidenziare la perla:\n\n>sembra che qualsiasi giocatore di lol con un elo superiore l'oro sia stato incaricato a costudire il mistero di league of legend e delle meccaniche di gioco per salire di elo\n\nAspetta aspetta, stai forse dicendo che chi è salito un minimo (perchè arrivare la gold è banale) conosce almeno un metodo sicuro per riuscirci? E io che credevo che fossero i ferro 4 a conoscere le misteriose \"meccaniche per salire\". Se vuoi capire dove sbagli tira fuori un po' di umiltà e ascolta le risposte di chi è stato nella tua stessa situazione in passato ed è riuscito ad uscirne.","replies":[]}]},{"poster":"Luckynanix","date":"2019-08-16T11:14:14.186+0000","up_votes":1,"down_votes":0,"body":"Con i primi due punti sono d'accordo l'ultimo invece è una cagata semplicemente perché il support non deve per forza seguire l'ADC (eccetto per la fase della corsia in cui puoi comunque rommare se la bot è persa) ma deve aiutare il carry che non è sempre l'ADC (anzi molto spesso non è l'ADC)","replies":[{"poster":"Bylloo","date":"2019-08-16T11:26:24.591+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luckynanix,realm=EUW,application-id=98NGV4Al,discussion-id=jKGETlOL,comment-id=00000000,timestamp=2019-08-16T11:14:14.186+0000)\n>\n> Con i primi due punti sono d'accordo l'ultimo invece è una cagata semplicemente perché il support non deve per forza seguire l'ADC (eccetto per la fase della corsia in cui puoi comunque rommare se la bot è persa) ma deve aiutare il carry che non è sempre l'ADC (anzi molto spesso non è l'ADC)\n\nun daryus può carryare, ma se l'ashe nemica ha preso vantaggio in early e continua a prenderlo c'è poco da fare","replies":[]},{"poster":"Bylloo","date":"2019-08-16T11:25:20.065+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luckynanix,realm=EUW,application-id=98NGV4Al,discussion-id=jKGETlOL,comment-id=00000000,timestamp=2019-08-16T11:14:14.186+0000)\n>\n> Con i primi due punti sono d'accordo l'ultimo invece è una cagata semplicemente perché il support non deve per forza seguire l'ADC (eccetto per la fase della corsia in cui puoi comunque rommare se la bot è persa) ma deve aiutare il carry che non è sempre l'ADC (anzi molto spesso non è l'ADC)\n\ncerto, ma se vuoi carryare da support la scelta è solo quella di prendere quelli citati sopra, in elo basso l'adc solitamente è vero che non carrya, tuttavia più si sale e più l'adc sarà l'elemento chiave per vincere le partite, dando senso alla frase \"better bot wins\"","replies":[]}]}]},{"poster":"AebelothAngel","date":"2019-08-17T03:18:56.496+0000","up_votes":1,"down_votes":0,"body":"Perdi perchè sei scarso.","replies":[]},{"poster":"Täkı","date":"2019-08-16T18:42:08.107+0000","up_votes":1,"down_votes":0,"body":"Capita anche a me, ho perso così tante promo per Silver 4 a causa di team molto nabbi, tra afk, troll e feeders, che non ti dico. Sono main jungler, ma sto giocando molto più mid (il mio ruolo secondario) e adc, e nell'ultimo caso, trovo sempre support idioti. Se vuoi ti aggiungo, così proviamo ad uscire dal silver insieme, maino Jhin, Caitlyn e Draven in bot. XD","replies":[]},{"poster":"xThoon","date":"2019-08-16T14:01:48.482+0000","up_votes":1,"down_votes":0,"body":"io ti sconsiglio di giocare support nel tuo elo perchè si carrya oggettivamente di meno però se proprio vuoi continuare a giocare support non usare dei peeler. \ngioca dei dmg dealer  come zyra brand velkoz-\nnon ha molto senso peelare gente che non sa giocare.","replies":[]},{"poster":"permabandre","date":"2019-08-16T13:56:20.086+0000","up_votes":1,"down_votes":0,"body":"I tuoi compagni di squadra, così come i nemici sono, statisticamente parlando bravi o scarsi esattamente quanto te.\nPuò capitare la losing streak, il game con gli afk o la winning streak. Ma se in quasi 60 ranked ne hai perse 45 il problema sei tu.\nE non lo dico per flammarti, ma prima accetterai questa verità prima ti scatterà la molla per cominciare a migliorare. \nNessuno è hardstuck da nessuna parte per \"colpa dei team mates\". La colpa è solo di chi gioca.","replies":[]}]}