{"poster":"Bylloo","date":"2016-08-18T15:02:48.881+0000","title":"Idea per LeaverBuster","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Allora partiamo dal fatto in cui con LoL ho avuto un periodo totalmente nero nel quale il pc mi crashava ed avevo il leaverbuster, di 20 minuti,20 fo*********i minuti comunque dopo un bel periodo in cui ne il pc ne il client mi crashava non avevo l&#039;odiosissimo leaverbuster, poco fa mi &egrave; crashata un altra partita e non riuscivo ad entrare,quindi avranno fatto remake, di fatti dopo 5 min. entro e guarda guarda! leaver buster di 20 min........................................... veniamo al dunque, se dovete dare il leaver buster cara Riot almeno fate che se il giocatore non va afk o gli crasha il pc per qualche arcano motivo, fate che il leaver buster duri sempre di meno.","replies":[{"poster":"Náos","date":"2016-08-18T18:10:41.543+0000","up_votes":1,"down_votes":1,"body":"A una mia amica è arrivato oggi un messaggio del leave buster che le notificava che finalmente il suo account è pulito. Ha passato diverso tempo di code a bassa priorità da 20. \nPer me questa è la dimostrazione che il sistema funziona","replies":[{"poster":"OADM","date":"2016-08-19T18:14:35.125+0000","up_votes":1,"down_votes":1,"body":"Ho creato oggi una nuova discussione sempre su questi argomento è dico anche qui che il LeaveBuster non è cosa giusta dato che ci sono potenzialmente 9 report di cui 4 ne sono sicuri visto che i nemici non è detto che reportino ma la tua squadra sì. Dovrebbero levare questo sistema automatico attirato da un computer che non guarda in faccia niente e nessuno. Lasciamo la decisione ad una mente umana non ad un computer, questa è giustizia","replies":[]}]},{"poster":"oroora6","date":"2016-08-18T17:13:44.952+0000","up_votes":1,"down_votes":1,"body":"la riot non ha modo di sapere se il tuo è un crash volontario o involontario, con il leaverbuster ti sta intimando di risolvere i tuoi problemi.","replies":[]},{"poster":"Andreiv14","date":"2016-08-18T15:40:30.437+0000","up_votes":1,"down_votes":1,"body":"Visto che il crash non si verifica in modo eccezionale, ma ti è capitato diverse volte, non hai pensato che il problema fosse il tuo computer o la tua connessione? I tempi del leaver buster sono giusti per fare in modo che gente come te non rovini l'esperienza di gioco ad altre persone.\nNon è una questione personale ma sto parlando dal punto di vista di un tuo compagno di squadra/avversario che deve ricominciare una partita dopo 3 minuti di gioco + schermata di caricamento + selezione campioni + coda di attesa. Quindi con un tuo problema di qualsiasi tipo, 9 persone sono costrette a perdere del tempo e tu sei costretto a sistemare i tuoi problemi prima di cominciare a giocare, altrimenti arrivano altre code.\n\n{{champion:7}} \"Trust me!\"","replies":[]}]}