{"poster":"Bylloo","date":"2017-11-09T18:12:01.078+0000","title":"Come sarà secondo voi il rework di Swain?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Hanno detto solo che strappa le anime e c&#039;&egrave; quell&#039;immagine.","replies":[{"poster":"HaIIeIujah","date":"2017-11-09T18:58:07.128+0000","up_votes":2,"down_votes":0,"body":"Mi aspetto che la W rimanga simile a com'é ora, dato che è l'abilità più soddisfacente del suo kit.\n\nManterrà certamente una forma di Sustain ma penso che la trasformazione sarà meno legata al mana e più ad una risorsa secondaria di un qualche tipo, che siano stacks o danno inflitto o qualcosa di nuovo. Non penso che diventerà un mutaforme puro.\n\nPer quel che riguarda il lato artistico penso che verrà spostato più verso il cremisi e il nero, con meno effetti verdi, per mantenere lo schema di colori di Noxus.","replies":[{"poster":"Blehic","date":"2017-11-09T19:02:04.703+0000","up_votes":1,"down_votes":1,"body":"Da quello che ha detto Terenas, si baserà sul mana e ne avrà molto bisogno, come quello attuale","replies":[{"poster":"HaIIeIujah","date":"2017-11-09T19:06:41.484+0000","up_votes":1,"down_votes":0,"body":"E la fonte di Terenas sarebbe?","replies":[{"poster":"Blehic","date":"2017-11-09T20:02:21.639+0000","up_votes":1,"down_votes":0,"body":"La riot, ha contatti con rioter e ha accesso a informazioni che non sono manco sul pbe :p","replies":[]},{"poster":"Saibbo","date":"2017-11-09T20:02:02.583+0000","up_votes":1,"down_votes":0,"body":"da quello che ho sentito l'opinione di Marc merrill, ceo di lol, swain era l'unico campione che avrebbe eliminato dal gioco perché le skill non hanno senso, quindi immagino che sara totalmente un nuovo campione.","replies":[]}]}]}]},{"poster":"Náos","date":"2017-11-09T18:50:26.150+0000","up_votes":1,"down_votes":0,"body":"Quale immagine? Linki per favore? Mi sa che mi sono perso roba","replies":[{"poster":"Giorgio di villa","date":"2017-11-09T19:25:08.711+0000","up_votes":1,"down_votes":0,"body":"https://euw.leagueoflegends.com/sites/default/files/styles/scale_xlarge/public/upload/dsfjhdas.jpg?itok=xKu3EsRm","replies":[]}]},{"poster":"MaVkS","date":"2017-11-09T21:03:01.433+0000","up_votes":1,"down_votes":1,"body":"non saprei... aspettiamoci di tutto, e capace che sale sul drago e carrya tutti.\ntanto ormai i nuovi champions o rework sono sgravi quindi... :P","replies":[]},{"poster":"4rchon","date":"2017-11-09T20:10:05.140+0000","up_votes":1,"down_votes":1,"body":"Io adoro swain per cui sono abbastanza deluso da sta cosa... Bah, togliesse tryndamere dal gioco piuttosto, swain non va bene ma un champ basato solo su rng si? No comment.","replies":[]}]}