{"poster":"Shadowlites","date":"2019-02-20T15:32:17.077+0000","title":"Como es que vas a hacer una solicitud al soporte y te responde un bot?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Son joda? Eso que leyeron. Como puede ser que el soporte sea RESPONDIDO POR UN BOT. Ninguno atiende el caso, ni siquiera leyeron lo que plantie en el soporte. Solo me menciono mis 2 partidas con &quot;Abuso de chat&quot; y no lo que plantie anteriormente por un invocador que en sala de pick ya estaba trolleando. Re triste la verdad.","replies":[{"poster":"Nexxs","date":"2019-02-20T16:17:36.572+0000","up_votes":1,"down_votes":0,"body":"Vos tambien infórmate un poco mas. Te responde un bot mostrándote tus registros del chat y si te parece insuficiente tenes que responderle al bot en el ticket y ahí te contacta un rioter.","replies":[{"poster":"Tortuguita","date":"2019-02-20T16:31:26.696+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nexxs,realm=LAS,application-id=v7qsfXsE,discussion-id=AWmKeyXs,comment-id=0001,timestamp=2019-02-20T16:17:36.572+0000)\n>\n> Vos tambien infórmate un poco mas. Te responde un bot mostrándote tus registros del chat y si te parece insuficiente tenes que responderle al bot en el ticket y ahí te contacta un rioter.\n\n¿? 4 tickets, 4 bots. Explícame eso.","replies":[]}]},{"poster":"Fízz","date":"2019-02-20T15:40:24.539+0000","up_votes":1,"down_votes":0,"body":"porque a soporte no les interesa lo que pasa","replies":[]},{"poster":"Fristay4","date":"2019-02-20T17:06:01.731+0000","up_votes":1,"down_votes":1,"body":"Y mira pa, para facilitar el trabajo usan bots que puedan responder lo básico, si tenes problemas graves como que no podes jugar o que te robaron la cuenta ya te atiende una persona, hay creo que más de 400 mil jugadores en LAS vos pensas que pueden atender a tantos usuarios. Y seguramente estás enviando mal el ticket, todas las veces que contacté con el soporte, por más mínima que sea la situación me atendieron a los 3 minutos MÁXIMO.","replies":[]}]}