{"poster":"Shadowlites","date":"2018-03-07T01:09:00.548+0000","title":"Sistema de honor","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Pregunta, Como funciona el sistema nuevo de honor? hace ya mas de 2 semanas que vengo con 3 honores partida por medio como promedio 3 honores cada 2 partidas. Voy al punto, cuando se sube a nivel 3? Y otra pregunta, como funciona el sistema de llaves? antes recibia menos honor y ganaba mas llaves y ahora es al reves y no lo entiendo. Gracias.","replies":[{"poster":"Shadowlites","date":"2018-03-07T02:03:19.650+0000","up_votes":1,"down_votes":0,"body":"Gracias por los comentarios, lo tomare en cuenta de no ser ambisioso por subir rapido de honor. Saludos!","replies":[]},{"poster":"Shirotani","date":"2018-03-07T01:30:42.388+0000","up_votes":1,"down_votes":0,"body":"> Como funciona el sistema nuevo de honor? hace ya mas de 2 semanas que vengo con 3 honores partida por medio como promedio 3 honores cada 2 partidas.\n\nSe necesita mucho más que sólo dos semanas para subir de honor. **Se sube lento, pero se sube, siempre y cuándo no te sancionen.**\n\n\nEn cuanto a las llaves:\n\n* Para conseguir fragmentos de llaves sólo tenés que **jugar partidas y no tener el honor bloqueado**. Los fragmentos no aparecerán inmediatamente después de las partidas, sino que aparecerán más tarde o al iniciar sesión después de jugar un par de partidas.\n\n\n* También podés conseguir fragmentos de llaves al alcanzar una meta en el sistema de honor o cuándo subís tu nivel de honor.\n\n\n* Cuándo sos nivel de honor 3 o más, cada cierto tiempo te dan orbes de honor los cuales tienen fragmentos de llaves.\n\nSaludos.\n\n\nPara más información, podés ver las [Preguntas frecuentes sobre el sistema de Honor](https://support.riotgames.com/hc/es-419/articles/115008474148).","replies":[]},{"poster":"Tortuguita","date":"2018-03-07T01:28:05.166+0000","up_votes":1,"down_votes":0,"body":"El honor tarda , así que debes ser muy paciente y tener buena actitud para recibirlo.","replies":[]},{"poster":"Ootel","date":"2018-03-07T01:13:31.915+0000","up_votes":1,"down_votes":0,"body":"Primero, hacete la idea de que te llevara como minimo un mes alcanzar el honor 3 y otro mes para alguna meta.\n\nlo de las llaves, no estoy seguro, pero creo que aumenta el spam cuando subes tu nivel de honor.","replies":[]}]}