{"poster":"Shadowlites","date":"2019-09-10T20:53:06.708+0000","title":"problemas tecnicos vs skins","subforum":"Charlas Generales","up_votes":3,"down_votes":10,"body":"Che y si en vez de pagarle a unos giles para que hagan skins, le pagan  A UN SOLO buen hombre que arregle el servidor ? Salu2","replies":[{"poster":"TvTLucio22","date":"2019-09-10T21:44:36.554+0000","up_votes":3,"down_votes":1,"body":"Che, y si en vez de venir con el mismo planteo RANCIO de siempre, de pibito que evidentemente no entiende como funciona una empresa NI la programación, dejas de decir gansadas?","replies":[{"poster":"Shadowlites","date":"2019-09-10T23:12:14.281+0000","up_votes":1,"down_votes":4,"body":"Una empresa funciona por venta de pixeles ? No seas tan cabeza de tacho. No te van a dar nada por defenderlos. Tengo 300 megas de fibertel. Es el unico juego que se cae en sala de pick/partida. Perdi mas de 50pl por esas caidas. Te repito EL UNICO JUEGO QUE ME PASA. Rankeo en overwatch, rainbow six, csgo, dota2 y en ningun juego me pasa eso. Asi y mucha gente del servidor mugroso este. Te puedo mencionar miles de casos. Ni hablar el poco criterio que tienen para las sanciones.","replies":[{"poster":"TvTLucio22","date":"2019-09-10T23:22:09.034+0000","up_votes":1,"down_votes":0,"body":"...\n\nOk, sos bastaaaaante pelotudo...\n\nNo los defiendo, atacó a los tarados como vos que dice \"dejen de azed zquinz\", cuando las no tiene ni voz ni voto al momento de hacer skins. De hecho, usando media neurona se puede llegar a la conclusión de que el equipo de desarrollo de champs, el de skins, el del Estado del Server y el del balance son 4 equipos distintos que tienen poca o casi ninguna interacción entre ellos (y eso es en el Server de na, en las es todavía menos), so...\n\nPero bueno, pensar es gratis, y muchos consideran que lo gratis es malo...","replies":[{"poster":"Shadowlites","date":"2019-09-11T19:44:16.741+0000","up_votes":1,"down_votes":1,"body":"A eso voy. Por que no le pagan a un equipo para mantener los servidores estables ? La gente se cansa de los maltratos por el servidor. No pedi que no hagan skins. Hice enfasis en que hay otras prioridades mas que hacer skins. Si vos abarcas todo el desarrollo del juego solamente en pixeles no vas a llamar a nadie mas que a los que tienen plata, lo cual no son muchos. Ahora bien, mantener el servidor estable e ir creciendo en otros aspectos, la gente no se te va. SI vos recibis constantes caidas del servidor, pero te sacan una hermosa skin. Vos crees que alguien con un poco de sentido comun quiera jugar igual? Se como funciona una empresa, no soy ningun pelotudo. Podes estar de acuerdo conmigo o no. Pero la realidad es que anda mal el servidor, y en vez de solucionarlo priorizan otras cosas. La empresa es la misma. No son 4 empresas separadas.","replies":[{"poster":"TvTLucio22","date":"2019-09-12T02:26:41.313+0000","up_votes":1,"down_votes":0,"body":"> Se como funciona una empresa, no soy ningun pelotudo.\n\nDiscrepo, porque si tu afirmación fuese correcta, no estarías diciendo esto...\n\nOk, entonces tu super idea es que cancelen todo proyecto de skin/champ para que se pongan a trabajar DESDE NA en el estado del servidor en ALGÚN PAÍS DE LAS, YA QUE NO SON TODOS LOS QUE SUFREN EL PROBLEMA (dicho sea de paso, solamente es el octavo país más grande del mundo, con una variedad climática que sólo abarca más del 90% de los distintos ecosistemas de la superficie), todo porque el señor \"zave komo fumzioma uma hempdeza, mo zoi un pelodudo\"... ok...","replies":[{"poster":"Shadowlites","date":"2019-09-13T02:25:31.315+0000","up_votes":1,"down_votes":1,"body":"No tenes, ni dije que tenias que dejar de hacer contenido en el juego. Pero, veo que la tutuca que tenes en el cerebro no te deja interpretar las cosas. No tenes que dejar de crear contenido, pero ponele más empeño a otras areas que funcionan mal. El hype de una skin que dura unos dias y ya, si el servidor anda mal no vas a seguir jugando por mas que saques una skin intergalactica que se consigue una vez en la vida.","replies":[]}]}]},{"poster":"SpectreChazer","date":"2019-09-11T02:15:51.880+0000","up_votes":1,"down_votes":0,"body":"Este juego es gratis (?","replies":[{"poster":"TvTLucio22","date":"2019-09-11T04:15:16.383+0000","up_votes":1,"down_votes":0,"body":"No se, hay quienes pagan con partes del alma, estado mental y/o esperanza de vida...","replies":[]}]}]}]}]},{"poster":"Zindro","date":"2019-09-10T23:53:12.192+0000","up_votes":1,"down_votes":0,"body":"Ufff, que fácil es decir \"paguen a este y arreglado\"  \n\nCuando estudies informática me explicas.","replies":[{"poster":"Shadowlites","date":"2019-09-11T19:40:03.843+0000","up_votes":1,"down_votes":1,"body":"Estoy estudiando informatica bb. Es más simple arreglar un problema de conexiones que desarrollas skins y campeones nuevos.","replies":[]}]}]}