{"poster":"Shadowlites","date":"2018-09-25T21:12:12.879+0000","title":"Honor, bans y cierre de temporada","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":2,"body":"Primero, alguien sabe cuando termina la temporada? Porque hace 2 dias termino mi sancion de 14 dias y ya pude desbloquear el honor. Necesito saber cuanto tiempo tengo para jugar support y llorar por un poco de honor jajaja. Otra pregunta, si bien recibi 14 dias de ban, hay alguna manera, no digo que vaya a suceder o eso es lo que menos quiero, pero hay alguna manera que en el caso de que se me &quot;chifle el mo&ntilde;o&quot;(Como decia mi abuela), la sancion no sea permanente? Tipo si levanto el honor y llevo tiempo sin sanciones por mas tiempo que pase la que sigue es permanente ? o se puede remediar? Gracias!","replies":[{"poster":"Silcardo Jenazad","date":"2018-09-25T23:11:56.975+0000","up_votes":1,"down_votes":3,"body":"cuando desbloqueas el honor se estima mas o menos 6 meses de posibilidad de permaban en caso de reincidir con las actividades roedoras... solo te digo que por la mas minima estupides que escribas en el chat te puede caer el ban permanente.. mi consejo segui flameando y trollea si es posible asi te comes el permaban y dejas un poco mas limpia esta comunidad... ahora siempre tenes la posibilidad de reformarte, no hables en el chat para nada y cuando haya pasado el tiempo no vuelvas al flameo...no seas una ratita usa esta experiencia para reformarte...sin embargo..despedite de las recompensas de final de season..no creo que llegues a nivel de honor 2 ya... pero bueno, merecido castigo por ser una alimaña","replies":[{"poster":"Shadowlites","date":"2018-09-26T17:58:13.467+0000","up_votes":1,"down_votes":0,"body":"Solo te voy a dejar un \"xD\" como para que no te sientas tan mal y veas que te puse algo de atencion, ya que por lo visto en tu casa no la recibis.","replies":[{"poster":"Silcardo Jenazad","date":"2018-09-27T04:53:25.979+0000","up_votes":1,"down_votes":0,"body":"mmmm a ver pensemos.... un flamer con ban me dice que no tengo atencion en mi casa...a mi... justo a mi que en mi cuenta no tengo ni un solo ban de ningun tipo...no flameo..no toxiqueo... no trolleo ni me voy afk... aaahh pero vos flameas sea por la razon que fuere... no quiero ser adivino pero generalmente viene el pack completo con la gente como vos o sea habras trolleado alguna que otra o te habras ido afk..por ahi no.. pero si tuviera que apostar diria que si. El punto es yo no tengo la atencion en mi casa? yooo? te confundiste.. puede que seas vos que tenes la necesidad de pudrir la comunidad como tantos otros pero despues te ofende que te digan la verdad.. por que yo no menti en ningun momento creo... te banearon y si te dieron ban es por rata, la pura realidad mi buen compañero roedor..","replies":[{"poster":"Shadowlites","date":"2018-09-27T14:56:16.928+0000","up_votes":1,"down_votes":0,"body":"Tranquilo chiquitin, que de toxico no tengo nada. El ban no solamente puede ser por ser toxico. Replantea tu vida que, que no tengas un ban, no significa que seas un pobre infeliz. Hasta aqui llega el olor a queso ratoide. Tu negatividad en estos post se me hace que eres un pobre infeliz y que no tengas una sancion no significa que no lo seas. Nada que decir de un goldie mimadito","replies":[{"poster":"Silcardo Jenazad","date":"2018-09-28T11:00:10.941+0000","up_votes":1,"down_votes":0,"body":"como vos digas...claro..como vos digas... vos sos el del ban y la rata soy yo? algo no esta funcionando en esa cabeza tuya.. decis incoherencias... ni me gasto ratita... goldie mimado? se te nota lo rata ya...bardeando con el elo? vos debes ser el que es malisimo en su liga y en vez de preocuparse por mejorar le gusta burlarse de los de abajo... tipico rasgo RATA que se cree mas de lo que es... te dejo ratita... prefiero jugar o mirar videitos..","replies":[]}]}]}]}]},{"poster":"Nariaku","date":"2018-09-25T22:39:28.119+0000","up_votes":1,"down_votes":0,"body":"- Creo que habian dicho una fecha estimada durante la primera o segunda semana de noviembre.\n- No importa cuanto tiempo pase, el \"nivel se sancion\" por asi decirlo nunca baj (asique si tu siguiente sancion es permamente, no importa que te la den mañana o en 1 año....seguira siendo permanente)","replies":[]},{"poster":"ILoner","date":"2018-09-25T22:33:32.419+0000","up_votes":1,"down_votes":0,"body":"Creo que todavía no dieron la fecha justa pero debe ser a principios/mitad de noviembre. Si se te acaba de ir la sancion igual probablemente tenes bloqueado el honor y dudo que llegues a honor 2 en menos de un mes aunque siempre podes intentarlo... con respecto a lo ultimo creo que no podes hacer nada mas que dejar de flamear, no importa cuanto pase la proxima es permanente.","replies":[]}]}