{"poster":" Sborrachiodi","date":"2018-07-05T12:34:11.969+0000","title":"Con le gambe nel putrido","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"Da qualche settimana nel 80% delle partite, fanno troll pick botlane senza adc fiddano e/o provano a surrendere a minuto 15.\nHo capito che quando vedo pick strani o pre-flame in champ select &egrave; meglio uscire subito e perdere quei pochi punti che buttare 30 minuti della propria esistenza a provare a mantene la calma anche se ti riempono di offese (il mute funziona ma &egrave; come coprirsi le orecchie e fare blablabla). Oppure conviene prendersi una pausa ? La gente sta troppo fissata a seguire questi &quot;meta&quot; che fa pick pericolosi in ranked fregandosene che &egrave; un gioco di squadra. Un mio amico l&#039;altro giorno ha preso GP top e gli hanno chiesto se GP fosse stato buffato e se era di nuovo in &quot;meta&quot;. \nE&#039; davvero cos&igrave; ? si possono solo giocare i campioni che sono in &quot;meta&quot;?  \n\nE&#039; sempre pi&ugrave; raro trovare giocatori genuini in game, ma quando li si trova l&#039;onore a fine partita &egrave; assicurato perch&eacute; &egrave; sicuro che si &egrave; giocati una partita divertente dove c&#039;&egrave; intesa e se si fa una giocata stupida ci si scherza sopra. Ma in molte partite vedo solo lamenti, offese, insulti anche razziali. \nIo amo league of legends ma per dio ho 24 anni e mi sembra di giocare con i bambini a volte... \nAnche per i pi&ugrave; pazienti mantenere la calma non &egrave; sempre possibile, ma io piuttosto preferisco scrivere qui e provare a conversare con persone serie perch&eacute; credetemi provare a far ragionare quella gente non &egrave; per niente possibile.\nQualcuno sta provando la stessa frustrazione ? e se &egrave; si, come affrontate la situazione ? &egrave; una cosa che passer&agrave; chess&ograve; con le prossime patch ? \nRicordo che in gold 3-2 giocavo partite pi&ugrave; serene e divertenti, ma da quando sono sceso in gold 5 &egrave; una costante ansia ogni volta che clicco Trova partita :S.","replies":[{"poster":"The Fluffy Lamb","date":"2018-07-05T13:38:22.429+0000","up_votes":1,"down_votes":3,"body":"Cosa faccio? Oh izi.\nChiudo occhi e orecchie e gioco IL MIO Game. Penso solo a me, a migliorare in kda e farm. Non puoi fare altro. La community è ormai schiava del meta. 5 game di fila contro jhin. 3 game di fila contro Jax o con. Ci sono 130 campioni e sti bimbi del cazzo con i denti da latte ne giocano solo 30","replies":[{"poster":"Ardens33","date":"2018-07-05T14:48:37.354+0000","up_votes":3,"down_votes":0,"body":"Sti bimbi del cazzo con i denti da latte sono competitivi, a differenza tua.","replies":[]}]},{"poster":"Linkimaru","date":"2018-07-05T14:16:11.008+0000","up_votes":2,"down_votes":0,"body":"Non è che “ti sembra” di giocare con i bambini, è così spesso e volentieri... l’eta Media dei giocatori di lol è ben più bassa Della tua, troverai tantissimi minorenni nei tuoi Game alcuni perfino undicenni o giù di li...","replies":[]},{"poster":"Jonathan Shooter","date":"2018-07-05T13:43:28.037+0000","up_votes":3,"down_votes":2,"body":"Ti dico solo una cosa, fottitene.\nIl meta non esiste, io gioco Jax toplane (non in meta perché la sua posizione migliore é Jungle), Lissandra mid (fuori meta da secoli), Kassadin mid ( idem come per Lissa) e Riven, Aatrox e Yorick toplane (fuori meta uno peggio dell'altro, c'è gente secondo me che manco sa che Yorick sia un champion esistente...).\nCerca di migliorarti, gioca più normal che ranked e divertiti, senza star troppo a pensare ai ritardati che ti becchi nel team: dopotutto è solo un gioco, quel che sei nella vita non cambia a seconda dei tuoi LP.\nSpero di esserti stato di sostegno morale.\nCi si becca nella Landa.\n\nGenerale Jonathan Wood","replies":[{"poster":"SuraKnight","date":"2018-07-05T14:14:12.170+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=0002,timestamp=2018-07-05T13:43:28.037+0000)\n>\n> Ti dico solo una cosa, fottitene.\n> Il meta non esiste, io gioco Jax toplane (non in meta perché la sua posizione migliore é Jungle), Lissandra mid (fuori meta da secoli), Kassadin mid ( idem come per Lissa) e Riven, Aatrox e Yorick toplane (fuori meta uno peggio dell&#x27;altro, c&#x27;è gente secondo me che manco sa che Yorick sia un champion esistente...).\n> Cerca di migliorarti, gioca più normal che ranked e divertiti, senza star troppo a pensare ai ritardati che ti becchi nel team: dopotutto è solo un gioco, quel che sei nella vita non cambia a seconda dei tuoi LP.\n> Spero di esserti stato di sostegno morale.\n> Ci si becca nella Landa.\n> \n> Generale Jonathan Wood\n\nChe il meta esista è innegabile, ci sono e ci saranno sempre champ che avranno la vita più facilitata nella landa a seconda dei periodo. Giocare champ fuori meta non significa perdere un game. L'importante è saperli usare :D","replies":[{"poster":"Nabbomaster","date":"2018-07-06T14:39:09.844+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuraKnight,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=00020000,timestamp=2018-07-05T14:14:12.170+0000)\n>\n> Che il meta esista è innegabile, ci sono e ci saranno sempre champ che avranno la vita più facilitata nella landa a seconda dei periodo. Giocare champ fuori meta non significa perdere un game. L&#x27;importante è saperli usare :D\n\nconfondi il meta con i campioni op\nesempio quiin adc non e' in meta perche' e' poco pickata eppure ha un winrate osceno\nmeta e' cioe' che va per la maggiore in quel periodo","replies":[{"poster":"SuraKnight","date":"2018-07-06T18:05:52.241+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabbomaster,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=000200000000,timestamp=2018-07-06T14:39:09.844+0000)\n>\n> confondi il meta con i campioni op\n> esempio quiin adc non e&#x27; in meta perche&#x27; e&#x27; poco pickata eppure ha un winrate osceno\n> meta e&#x27; cioe&#x27; che va per la maggiore in quel periodo\n\nIl meta non è assolutamente ciò che va per la maggiore. Se domani tutti i giocatori di lol cominciassero ad usare lissandra, questa resterebbe comunque non in meta per questa patch.\nCon meta ci si riferisce in generale all'insieme di campioni e strategie considerate \"migliori\" o \"più forti\". Un campione è \"in meta\" quando è considerato una valida scelta da giocare, e quindi, come conseguenza, diventa più frequente. \nQuesto significa che, in base ai cambiamenti di statistiche, item etc.. applicati in ogni patch, ci saranno champ favoriti e champ svantaggiati. \nQuesti sono fatti abbastanza oggettivi ed innegabili. Come accade in lol, accade in tutti i game che si evolvono nel tempo.\n\nEDIT \nMeta- Abbreviazione di metagame. Indica le convenzioni che governano le scelte di gioco attuali, quali come occupare le corsie, la composizione della squadra, e i campioni preferibili.\nQuesta è una definizione che ho trovato in un post \"glossario\" di lol.\nCome vedi non c è nessun riferimento alla frequenza di pick, ma solo alle scelte di gioco attuali e preferibili","replies":[{"poster":"Jonathan Shooter","date":"2018-07-06T19:12:14.673+0000","up_votes":1,"down_votes":0,"body":"Resta il fatto che quelli citati ed usati da me non sono assolutamente in meta...","replies":[{"poster":"SuraKnight","date":"2018-07-06T21:36:03.712+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=00020000000000000000,timestamp=2018-07-06T19:12:14.673+0000)\n>\n> Resta il fatto che quelli citati ed usati da me non sono assolutamente in meta...\n\nInfatti non mi sembra di aver detto niente a riguardo... Ho solo puntualizzato che il meta esiste e non è una favoletta come hai scritto xD","replies":[{"poster":"Jonathan Shooter","date":"2018-07-06T22:55:49.306+0000","up_votes":1,"down_votes":0,"body":"Secondo me è in larga parte un'illusione dei giocatori.\nAltrimenti non mi spiegherei il mio devastare GP o anche Darius con il mio bel becchinazzo...","replies":[{"poster":"SuraKnight","date":"2018-07-07T08:19:58.654+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=0002000000000000000000000000,timestamp=2018-07-06T22:55:49.306+0000)\n>\n> Secondo me è in larga parte un&#x27;illusione dei giocatori.\n> Altrimenti non mi spiegherei il mio devastare GP o anche Darius con il mio bel becchinazzo...\n\nProvo a spiegarlo un'ultima volta. Non c'è un \"secondo me\" quando si parla di meta. Il meta esiste ed esisterá sempre. Non è una cosa su cui si può discutere. questo però non sognifica che se usi i champ fuori meta allora perdi. Semplicemente i champ in meta hanno un piccolo aiutino (alcune volte pure grande). Se sai usare bene un champ, che sia in meta oppure no, ottieni un ottimo risultato a prescindere. Poi agli elo bassi influisce ancora meno il meta.\nComunque, continua a credere in ciò che vuoi, ma le cose stanno così :D","replies":[]}]}]}]}]}]}]},{"poster":"Nabbomaster","date":"2018-07-06T14:40:10.751+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=Enjomsfu,comment-id=0002,timestamp=2018-07-05T13:43:28.037+0000)\n>\n> Ti dico solo una cosa, fottitene.\n> Il meta non esiste, io gioco Jax toplane (non in meta perché la sua posizione migliore é Jungle), Lissandra mid (fuori meta da secoli), Kassadin mid ( idem come per Lissa) e Riven, Aatrox e Yorick toplane (fuori meta uno peggio dell&#x27;altro, c&#x27;è gente secondo me che manco sa che Yorick sia un champion esistente...).\n> Cerca di migliorarti, gioca più normal che ranked e divertiti, senza star troppo a pensare ai ritardati che ti becchi nel team: dopotutto è solo un gioco, quel che sei nella vita non cambia a seconda dei tuoi LP.\n> Spero di esserti stato di sostegno morale.\n> Ci si becca nella Landa.\n> \n> Generale Jonathan Wood\n\njax top e' in meta, e' uno dei campioni piu' usati top attualmente, che poi soffra in quella lane e' un altro discorso","replies":[]}]},{"poster":"ComradeShumo","date":"2018-07-05T13:25:46.352+0000","up_votes":1,"down_votes":0,"body":"Effettivamente dovrebbero allenarsi in draft normale,ma che ci possiamo fa'","replies":[]}]}