{"poster":"oOFreiBierOo","date":"2016-01-21T21:29:14.089+0000","title":"Was soll der Mist?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"So liebe Riot Community und ich vll. auch leiber Support :D\r\nIch versteh nicht wie ihr diese Season wertet bzw. was der Mist denn soll?\r\nIch gewinne 6 Spiele und 4 verliere ich und war Gold 5 und komme in Bronze 1?? \r\nDas ist ja nicht das schlimme ich gewinne 3 Games hintereinander und verliere 1 was passieren kann und dann bekomm ich statt Spieler in meiner Elo Bronze und Silber 5 Spieler?? Die teils ml Zed AP spielen oder Teemo ADC oder mich flamen weil ich als Midlaner einen Bluebuff m&ouml;chte &quot;Blue ist Jungle soll ich mir merken. Vi braucht ihn mehr als Galio und ganken tut der werte Jungler keine Idioten die nen Blue wollen&quot;. Das Game mit dem Jungler konnte man gewinnen und habe ich auch aber das mit AP Zed und Teemo ADC kann man nicht gewinnen wenn nebenbei der Support alle 5 min AFK geht und der Top Laner das selbe tut.\r\nIch f&uuml;r meinen Teil beende heute meine Season auf diesen Mist hab ich keine Lust. Das ist einfach eine Frechheit und ich bin sicher nicht der Einzige der das so sieht.\r\n\r\nGG Riot ich werde definitiv kein Geld mehr ausgeben, hat mir bis heute gefallen euer Spiel aber das ist definitiv genug.","replies":[{"poster":"Alustus","date":"2016-01-21T23:00:53.653+0000","up_votes":1,"down_votes":0,"body":"Das ist das DynamicQ rating nicht das SoloQ rating, (auch wenn dieses wieder offline genommen wurde, gehört die mmr zur DynamicQ)\n\nEs wird in 1-2 Wochen eine eigene SoloQ warteschlange geben, ob dor die Placements anders aussehen weiß ich nicht grundsätzlich sollte man aber bedenken das der jetzige standpunkt nur indirekt etwas  mit dem SoloQ rating zu tun hat.\n\nNach den jetzigen Informationen;\n\nAltes und neues SoloQ(welches erst online kommen muss) beeinflussen das DynamicQ rating.\nDynamicQ rating hat aber kein Einfluss auf das soloQ rating.\n\nDas neue SoloQ wird man nur Solo spielen können.\nKein DuoQ.\n\nEs gibt kein Teamrank mehr denn das ist jetzt DynamicQ (wo ihr jetzt eure placements gemacht habt)\n\n\nSprich es ist noch zu früh um zu heulen.\nDiese Informationen entsammen aus dem Englshen forum in dem Riot informationen rausgibt und fragen beantwortet \n\nhttp://boards.na.leagueoflegends.com/en/c/miscellaneous/HGblb9fH-the-2016-ranked-season-updates-on-dynamic-ranked-and-your-feedback","replies":[]},{"poster":"E4RLy","date":"2016-01-21T21:48:46.597+0000","up_votes":1,"down_votes":0,"body":"Leute das ist das rank fürn DynQ... nicht soloq  eure mmr wird zwar beachtet aber kommt ihr den system nicht gerecht wo ihr ein sicheren win haben sollten passiert sowas halt! Wartet ein paar wochen bis soloq da ist und hört auf euch zu beschweren ohne euch zu informieren!","replies":[]},{"poster":"ouhw","date":"2016-01-21T21:32:03.630+0000","up_votes":1,"down_votes":0,"body":"Wein nicht, ich bin von Platin 3 auf Silber 3 gerutscht dankt dem Reset. :D Aber spiele gegen Diamond und Platinum in S5 gerankt, alle aber Silber 3 in S6. xD","replies":[{"poster":"oOFreiBierOo","date":"2016-01-21T21:34:57.675+0000","up_votes":1,"down_votes":0,"body":"Das ist hart und ich musste meinen Frust los werden :D das letzte Game gab mir einfach den Rest.","replies":[{"poster":"CooL Ice Tea","date":"2016-01-21T21:39:19.333+0000","up_votes":1,"down_votes":0,"body":"Ernsthaft, den Platin leuten geht es nicht anders mit dem runter fallen, nur wir weinen nicht so hart ;)","replies":[]}]}]},{"poster":"DrYatty","date":"2016-01-21T22:31:39.766+0000","up_votes":2,"down_votes":2,"body":"http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/yQE7EzVy-ich-habe-eine-gute-nachricht-far-euch\n\nLies dir das durch, von mir aus auch über den Link im Thread im englischem Forum. Da wird alles erklärt.\n\nhttp://boards.na.leagueoflegends.com/en/c/miscellaneous/HGblb9fH-the-2016-ranked-season-updates-on-dynamic-ranked-and-your-feedback","replies":[]}]}