{"poster":"Schluck","date":"2016-08-23T04:27:43.144+0000","title":"Laptop keyboard randomly breaks while playing League","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"This is a problem that has been occurring to me for a while, and I should have reported it a while ago to see if anyone knew how to solve it. \r\n\r\nBasically, my laptop's keyboard will randomly, but ONLY when playing League (has not happened with any other game or application), completely shut off. No binds, no keyboard commands of any kind will work, and I am forced to plug in an external keyboard (which will work) to make it through the game. Strangely enough, however, the problem continues even after the game is over, and I can no longer use my laptop's keyboard unless I restart the computer, but if I do not unplug both the charger cord and the wireless mouse usb port before restarting the computer, I will continue to be unable to type anything.\r\n\r\nThis is a very strange bug, and I honestly don't know for sure if it's a problem league is causing somehow, or if it's just a problem with my kinda old laptop. But since it's happening only with league, I decided to come here finally after having this problem occur in two back-to-back games.","replies":[{"poster":"Schluck","date":"2016-08-23T20:21:54.195+0000","up_votes":1,"down_votes":0,"body":"No, it's just the keyboard in my laptop. I'll try the repair tool.","replies":[]},{"poster":"Porocles","date":"2016-08-23T17:18:52.534+0000","up_votes":1,"down_votes":0,"body":"Are you using a fancy keyboard with special programs or functions?  The best way to troubleshoot this is by swapping another keyboard and testing it to see if it persists.  Otherwise, this issue could also happen if you've made modifications to your game files.  To rule out the possibility of bad files, you can use our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to perform a clean reinstall for a fresh slate.  I hope that helps!","replies":[]},{"poster":"Schluck","date":"2016-08-23T16:17:19.377+0000","up_votes":1,"down_votes":0,"body":"*bump because this is a major problem for me*","replies":[]}]}