{"poster":"ItzNinjaa","date":"2017-02-25T04:43:26.856+0000","title":"League crashes on game start","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":1,"body":"This is starting to get seriously annoying, whenever i find a match and get through the champ select screen my game crashes and will not let me reconnect because of subsequent crashing, I'm not sure if its just me or if anybody else has experienced this issue but i have had a few 20 min bans already and would like to be able to play properly again. The game will load up and work fine after maybe 2/5 attempts. Any help will be greatly appreciated, Thanks\r\n\r\nbtw I have reinstalled the client and tried to repair it twice now","replies":[{"poster":"Porocles","date":"2017-02-25T17:18:07.817+0000","up_votes":1,"down_votes":0,"body":"If the crash you're getting is a bugsplat, then your might have bad game files or drivers failing to render the game.  You should go over the steps in the [game crash](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes+) guide to get that fixed up.  Make sure to test it in a custom game to be sure so you don't get anymore [leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) penalties.  Let me know if you have any questions!","replies":[{"poster":"MrRadicalsheep","date":"2017-10-25T00:42:32.809+0000","up_votes":1,"down_votes":0,"body":"When I start a game it loaded everything but then screen  freezes once it opens, I restart my PC, login again and rejoined  the game then a bug splat appears once it’s done loading in, then I reconnect one more time and the game loads","replies":[]},{"poster":"ItzNinjaa","date":"2017-02-27T07:21:54.408+0000","up_votes":1,"down_votes":0,"body":"Thank you, I am going to uninstall the game and try again shortly","replies":[]}]},{"poster":"They","date":"2017-02-25T10:05:57.565+0000","up_votes":1,"down_votes":0,"body":"Same, just hope they'll fix it. Been thinking about upgrading my pc to Windows 10, we'll see.","replies":[{"poster":"ItzNinjaa","date":"2017-02-27T07:23:04.045+0000","up_votes":1,"down_votes":0,"body":"Yeah, I am on Windows 10 now but a patch would be very appreciated","replies":[]}]},{"poster":"CrusedFire","date":"2017-02-25T08:36:03.430+0000","up_votes":1,"down_votes":0,"body":"I hav the same thing.After i go into the game i can play for 5-10 sec and then the crashes start happening and its not evryday","replies":[]}]}