{"poster":"The Bíg Ticket","date":"2015-10-08T16:07:50.548+0000","title":"Do people realize now that AoE crits from 700 range are not really balanced?","subforum":"Gameplay","up_votes":26,"down_votes":26,"body":"When the same adc also has max attack speed in melee range...but yeah Jinx is balanced.","replies":[{"poster":"Blue Kaozi","date":"2015-10-08T16:27:44.709+0000","up_votes":16,"down_votes":3,"body":"I dont think that jinx is that much of an issue, shes very weak to assassins since her mobility isnt on demand. If I was to nerf anything, I'd hit her safety by increasing the arm time on chompers. Ask any teemo main what .5 seconds of arm time does.","replies":[]},{"poster":"alasarcher","date":"2015-10-08T16:11:32.513+0000","up_votes":7,"down_votes":7,"body":"Oh come on... people now complain about Jinx?","replies":[{"poster":"Lugg","date":"2015-10-08T16:15:43.506+0000","up_votes":16,"down_votes":7,"body":"Are you really going to go there? Jinx hasn't been anywhere close to balanced since her release.","replies":[{"poster":"Silents429","date":"2015-10-08T17:02:50.711+0000","up_votes":4,"down_votes":4,"body":"No but after her last set of changes she was deemed fine and the boards shut up about her.\n\nBut like clockwork they come back around to continue the raging on the usual.","replies":[{"poster":"Lugg","date":"2015-10-08T17:15:49.125+0000","up_votes":6,"down_votes":5,"body":"It  was the classic case of Riot giving one of their favorite champs a \"softball\" nerf that was very, very minor. I called it when it happened, that it was a joke. People are finally waking up and realizing that it was ineffective nerf. Plus the fact that Riot released the grossly OP Juggernauts to mask how broken so many champs are right now.","replies":[{"poster":"Silents429","date":"2015-10-08T17:29:17.954+0000","up_votes":3,"down_votes":0,"body":"You are going to argue it took people a few months to figure that out?\n\nAnd by people you mean these boards, The less then 1% of the playerbase.\n\nJinx being \"OP\" isn't all that widespread and I have found a lot of people confused when I bring it up to them.","replies":[{"poster":"Lugg","date":"2015-10-08T17:37:56.688+0000","up_votes":1,"down_votes":0,"body":"She is a hyper carry who doesn't have a weak early game and her only \"weakness\" is no escapes which is totally nullified by her Flame Chompers.","replies":[{"poster":"Earl Eulrich","date":"2015-10-08T18:35:07.657+0000","up_votes":4,"down_votes":0,"body":"to be fair, vayne and kog also have really strong early games...that´s more of a basic failure in Riots design of hyper-carries right now.\n\nthe main problem for Jinx is that she gets rewarded too much for success, which is also a problem for the likes of Tristana and Yi - Champs that are strong at cleaning up and taking objectives at the same time.","replies":[{"poster":"Lugg","date":"2015-10-08T21:12:24.644+0000","up_votes":1,"down_votes":1,"body":"Kog's early game is nowhere near as good as Vayne and Jinx. All he has is a slow. Vayne has a knockback and her tumble. Jinx has flame chompers which root. I will take a root over a slow any day. \n\nI do agree with your second paragraph though.","replies":[{"poster":"Earl Eulrich","date":"2015-10-08T22:45:52.933+0000","up_votes":2,"down_votes":0,"body":"i beg to differ, kog has high range and insane basestats...it´s one of the few carries i pick into graves to win lane. Just watch some of Imps Kog-games this season, i doubt you´ll find a game when he didn´t dominate his lane despite firstpicking the \"weak\" carry.","replies":[]}]}]},{"poster":"Silents429","date":"2015-10-08T17:40:21.159+0000","up_votes":1,"down_votes":1,"body":"You could just go around them.\n\nEven if you want to argue her early game has no weakness, her immobility becomes increasingly more difficult for her to deal with as the game carries on.","replies":[{"poster":"Lugg","date":"2015-10-08T18:14:15.091+0000","up_votes":2,"down_votes":1,"body":"Going around them gives her the time to get away. So once again, no real weakness. \n\nLate game her immobility is overcome by her passive which procs off champs and structures.","replies":[{"poster":"Silents429","date":"2015-10-08T18:18:42.228+0000","up_votes":1,"down_votes":0,"body":"Yeah maybe for another immobile champion, but we have been in a long ongoing meta with champions that 100-0 a champion like Jinx with ease, and have plenty of tools to get around her chompers.\n\nShe is also doomed if more then 1 person were to go for her, or any amount of CC snags her.\n\nHer passive isn't exactly that commonly used, and I don't reasonably expect her to have it ready for times where she needs it for escape. It's better used for chasing.","replies":[{"poster":"Lugg","date":"2015-10-08T18:30:58.046+0000","up_votes":1,"down_votes":1,"body":"If Jinx has lifesteal, you are going to have a hard time 100-0 her. \n\nMore than 1 person and CC works on ANY champion in the game. So that isn't a weakness.","replies":[{"poster":"Silents429","date":"2015-10-08T18:41:07.453+0000","up_votes":2,"down_votes":0,"body":"Assuming the Jinx lands even 1 auto attack before Zed, LB, Rengar, or the many other assassins kill her.\n\nAnd yes it is actually a weakness, some champions are capable of dealing with multiple people while others can't, And yes it is actually a legit strategy to use team work or crowd control on champions, as some marksmen are also good at dealing with those.\n\nWe can make any champion overpowered if we pick and choose what counts as strengths or weaknesses.","replies":[{"poster":"Lugg","date":"2015-10-08T21:04:33.170+0000","up_votes":1,"down_votes":1,"body":"And we have come around full circle to the point that Jinx really doesn't have any real weakness that isn't shared by all ADCs. That's the whole point.","replies":[{"poster":"Silents429","date":"2015-10-08T22:27:36.267+0000","up_votes":2,"down_votes":1,"body":"What's {{champion:22}}  weakness?\n\nShe has better CC, high damage output, aoe zoning, range.","replies":[{"poster":"Silents429","date":"2015-10-09T01:27:06.412+0000","up_votes":1,"down_votes":0,"body":"Nothing you listed was a weakness of Ashe, you were only comparing the aspects I mentioned with others.\n\nIt doesn't matter if she can be out damaged (Though I fully disagree they outdamage her) she still has high damage, zoning, CC, and range just like Jinx.\n\nSo why is Ashe completely balanced and fine with supposed weaknesses, but Jinx has none somehow?\n\nSo again, What is weakness that isn't just listing people that do things better?","replies":[]}]}]}]},{"poster":"Dar Raksada","date":"2015-10-08T21:33:25.562+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lugg,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=0000000000000000000000000000000000000000,timestamp=2015-10-08T18:30:58.046+0000)\n>\n> If Jinx has lifesteal, you are going to have a hard time 100-0 her. \n> \n> More than 1 person and CC works on ANY champion in the game. So that isn't a weakness.\n\n{{champion:2}} \n\nI agree with you, but I had to.","replies":[]}]}]}]},{"poster":"LordGeovanni","date":"2015-10-08T20:13:08.972+0000","up_votes":1,"down_votes":0,"body":"considering that adcs build boots and most attack speed items for adcs carry a speed boost i dont think that is correct people like to forget the 5% movement speed on jinx ashe and adcs a class with lots of damage /cc / utility/ saftey (because being ranged is already an advantage over melee characters and many of the class has mobility boosts dashes  or and or have cc in slows some have stuns and they get supports with these same cc abilities  and can speed them up or heal them too","replies":[]},{"poster":"LordGeovanni","date":"2015-10-08T20:08:20.971+0000","up_votes":1,"down_votes":0,"body":"when ever i say that about yasou's wind wall i get treated like a mental patient but you can also walk through the wind wall","replies":[]}]},{"poster":"IcyPepper","date":"2015-10-08T17:40:50.550+0000","up_votes":1,"down_votes":0,"body":"I wouldn't say \"totally\" nullified. Those things aren't 100% reliable if your opponent knows what they're doing","replies":[{"poster":"Lugg","date":"2015-10-08T18:15:12.492+0000","up_votes":1,"down_votes":0,"body":"It's a WAY stronger ability than the Kog slow and Kog isn't near as strong early as Jinx.","replies":[{"poster":"IcyPepper","date":"2015-10-08T18:37:40.993+0000","up_votes":1,"down_votes":0,"body":"Escape-wise? No, not he is not. In solo queue, he might as well be served on a silver platter if he doesn't have his own personal guard playing the game.\n\nI'm saying it's not completely reliable, but it is pretty reliable.\n\nAlthough Kog'Maw deals more dps I believe than Jinx can to a team, but requires more protection to do so. Out of the three most popular hypercarries, Vayne is the best duelist but requires the least protection, Kog is the best teamfighter but requires the most protection, and Jinx is the best at sieging and is somewhere between the two.","replies":[{"poster":"Lugg","date":"2015-10-08T21:09:46.719+0000","up_votes":1,"down_votes":0,"body":"I would say that Jinx does much more damage to a team. Her rockets crit over 1k in an AoE and are non stop. The closest Kog can do is his ult which has a 1 second CD and uses WAY more mana. Plus once Jinx gets that first kill or assist, she becomes insanely mobile and cleans up the entire enemy team. Kog can just try to poke with an easily dodged ult. \n\nKog does do the most damage to single targets of any ADC since he has percent health damage like Vayne. I have 1v1'd a fed and stacked Nasus on Kog.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Very Hard Engage","date":"2015-10-08T16:23:38.759+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=alasarcher,realm=EUNE,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=0000,timestamp=2015-10-08T16:11:32.513+0000)\n>\n> Oh come on... people now complain about Jinx?\n\njust compare {{champion:222}}  rockets (Q ability) to {{champion:29}}  (R ability (ult)). twitch can hit less targets and even gets diminishing returns on additional targets. jinx has full 100% damage to everyone, (yet hydra does lesser splash damage and can not crit), jinx has both,  built in!\n\nthe best part is.... it doesn't even have a cooldown. \n\ntell me, why does she get extra range, and full damage? what part of the rest of her kit lacks to compensate? nothing? still straight ADC material? so why should ANY ability that heavily over loaded.","replies":[{"poster":"therealdragon","date":"2015-10-08T16:29:05.461+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=CrestKnight,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=00000001,timestamp=2015-10-08T16:23:38.759+0000)\n>\n> just compare {{champion:222}}  rockets (Q ability) to {{champion:29}}  (R ability (ult)). twitch can hit less targets and even gets diminishing returns on additional targets. jinx has full 100% damage to everyone, (yet hydra does lesser splash damage and can not crit), jinx has both,  built in!\n> \n> the best part is.... it doesn't even have a cooldown. \n> \n> tell me, why does she get extra range, and full damage? what part of the rest of her kit lacks to compensate? nothing? still straight ADC material? so why should ANY ability that heavily over loaded.\n\npeople are still saying jinx is op? seriously? to answer your question what part of her kick compensates?\n1. Rockets cost mana\n2. She has low mobility (something twitch DOES have including invisibility)\n3. She's squishy (but that applies to all adcs)\n\nThats what compensates. If she didn't have rockets at all, she'd be useless as to do her job, she'd always be in melee range and die in an instant. So she has to have rockets or she dies and does nothing. \n\nBut again, her doing well was just CLG's fault, they were like \"screw squishies. Lets attack tanks!\" and unloaded all their kit on tanks.","replies":[{"poster":"Sir Yamazuki","date":"2015-10-08T17:28:36.632+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Licojee,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000000010000,timestamp=2015-10-08T16:29:05.461+0000)\n>\n> people are still saying jinx is op? seriously? to answer your question what part of her kick compensates?\n> 1. Rockets cost mana\n> 2. She has low mobility (something twitch DOES have including invisibility)\n> 3. She's squishy (but that applies to all adcs)\n> \n> Thats what compensates. If she didn't have rockets at all, she'd be useless as to do her job, she'd always be in melee range and die in an instant. So she has to have rockets or she dies and does nothing. \n> \n> But again, her doing well was just CLG's fault, they were like \"screw squishies. Lets attack tanks!\" and unloaded all their kit on tanks.\n\nI'm hoping you're joking when you say twitch has mobility... It's a minor move speed buff that requires him to stealth, and in a team fight Jinx ix 100x more mobile due to having a lot of aoe, so guaranteed assists to proc passive. She also gets it after a tower, so gl getting her as she finishes one, where as Twitch just dies due to the long delay on his stealth. There's also a cool down, where as Jinx does not have one, and she has more safety than Twitch in addition to all that.","replies":[{"poster":"therealdragon","date":"2015-10-08T18:29:32.675+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Yamazuki,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=0000000100000000,timestamp=2015-10-08T17:28:36.632+0000)\n>\n> I'm hoping you're joking when you say twitch has mobility... It's a minor move speed buff that requires him to stealth, and in a team fight Jinx ix 100x more mobile due to having a lot of aoe, so guaranteed assists to proc passive. She also gets it after a tower, so gl getting her as she finishes one, where as Twitch just dies due to the long delay on his stealth. There's also a cool down, where as Jinx does not have one, and she has more safety than Twitch in addition to all that.\n\nShe's a turret eater. It's her identity. Just like elise is the cocoon champ or darius is the pentakill champ. \n\nNow if you were to compare jinx to trist, that'd be more accurate as they're both turret pushers. They both get resets on their mobility, they both eat turrets. They both have AS boosts. And I don't see you complaining about trist.\n\nBut you can't compare Jinx to twitch when they're both 2 completely different identities. \n\nAlso, jinx DOES have counters and weaknesses. How about instead of complaining Jinx is op, try playing draven or vayne and have fun stunning her or bursting her. Both draven and vayne counter her. Just gotta know how to do it.","replies":[{"poster":"Iceoh","date":"2015-10-08T20:51:48.306+0000","up_votes":1,"down_votes":0,"body":"Vayne hardly counters jinx lol >_<","replies":[{"poster":"therealdragon","date":"2015-10-08T22:52:00.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Iceoh,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000000010000000000000001,timestamp=2015-10-08T20:51:48.306+0000)\n>\n> Vayne hardly counters jinx lol >_<\n\nvayne totally counters jinx o.o\n\nShe has mobility and an invis that even zap doesn't show. She can condemn jinx and because jinx is squishy and stunned, she'll literally 3 shot her.\n\nThey're actually both counters to each other. It's whichever plays smarter and gets their kit off first. If position ok and jinx lands her chompers on vayne, vaynes screwed. If vayne goes invis and manages to condemn jinx, jinx is screwed.","replies":[]}]},{"poster":"Sir Yamazuki","date":"2015-10-08T18:45:56.650+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Licojee,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=00000001000000000000,timestamp=2015-10-08T18:29:32.675+0000)\n>\n> She's a turret eater. It's her identity. Just like elise is the cocoon champ or darius is the pentakill champ. \n> \n> Now if you were to compare jinx to trist, that'd be more accurate as they're both turret pushers. They both get resets on their mobility, they both eat turrets. They both have AS boosts. And I don't see you complaining about trist.\n> \n> But you can't compare Jinx to twitch when they're both 2 completely different identities. \n> \n> Also, jinx DOES have counters and weaknesses. How about instead of complaining Jinx is op, try playing draven or vayne and have fun stunning her or bursting her. Both draven and vayne counter her. Just gotta know how to do it.\n\nMy response is purely about your comment stating Twitch has mobility, I did not mention anything other than mobility.","replies":[{"poster":"therealdragon","date":"2015-10-08T19:37:43.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Yamazuki,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000000010000000000000000,timestamp=2015-10-08T18:45:56.650+0000)\n>\n> My response is purely about your comment stating Twitch has mobility, I did not mention anything other than mobility.\n\nmy bad. You're right. dunno where I got the rest from o.o.\n\nand Twitch does have mobility. I'm stating that he can use his anytime whereas Jinx HAS to get a kill or assist on a champion to use hers. Other than a kill or assist she has no mobility whereas twitch does.","replies":[{"poster":"Dar Raksada","date":"2015-10-08T21:41:03.051+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Licojee,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=0000000100000000000000000000,timestamp=2015-10-08T19:37:43.360+0000)\n>\n> my bad. You're right. dunno where I got the rest from o.o.\n> \n> and Twitch does have mobility. I'm stating that he can use his anytime whereas Jinx HAS to get a kill or assist on a champion to use hers. Other than a kill or assist she has no mobility whereas twitch does.\n\nHe can use his anytime except in a fight (or did they change it?)","replies":[]}]}]}]}]}]}]},{"poster":"Dar Raksada","date":"2015-10-08T21:32:19.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=alasarcher,realm=EUNE,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=0000,timestamp=2015-10-08T16:11:32.513+0000)\n>\n> Oh come on... people now complain about Jinx?\n\nPeople have been complaining about jinx a lot, you may have noticed her R nerf earlier?","replies":[]}]},{"poster":"therealdragon","date":"2015-10-08T16:25:49.154+0000","up_votes":2,"down_votes":2,"body":"This wasn't Jinx being OP. This was CLG being stupid. They all just went straight for the tank. After about 3s of them going for the tank, thats when they realized they screwed up and tried to run. \n\nBut this was CLG's fault. If they were smart, they would've gone for Jinx or morg or lb. But nooooooo they HAD to go for the malphite which has a slow and a knockup. No stun, no mobility, nothing except just being tanky and the ult initiate. And yet all of CLG is like \"cmon guys! Kill the malph with 500 armor!\"","replies":[{"poster":"The Bíg Ticket","date":"2015-10-08T17:15:35.864+0000","up_votes":4,"down_votes":0,"body":"Jinx won 7 out of 8 games at worlds and I have been trying to convince people how brokene she is months ago.","replies":[]}]},{"poster":"Lugg","date":"2015-10-08T16:16:32.257+0000","up_votes":6,"down_votes":5,"body":"I am already laughing at the people who are going to downvote you and try to justify this. Her rockets shouldn't be able to crit at all.","replies":[{"poster":"Valor Simulator","date":"2015-10-08T17:38:20.472+0000","up_votes":1,"down_votes":0,"body":"There an auto attack why would they not be able to crit?","replies":[{"poster":"Lugg","date":"2015-10-08T18:17:16.990+0000","up_votes":3,"down_votes":0,"body":"Because is makes her too strong. She can stand safely at long range and take out your entire team. Cait and Tris have to at least focus just one person at a time.","replies":[{"poster":"MohawkBird","date":"2015-10-08T18:41:18.481+0000","up_votes":1,"down_votes":0,"body":"Honestly they should really tone down the bonus range of the rockets. There is literally **_zero_** downside to having them on in team fights. She gets ridiculous range, even _more_ damage, and to top it all off she can crit in AoEs for 1,000 damage to multiple people at once. I don't care what anyone says, but her rockets are far from balanced considering you get all that from 1 ability.\n\nLet's not forget the fact that the team fight is pretty much over once she gets a passive proc, which isn't hard **at all**, especially given the rest of her kit.","replies":[{"poster":"Lugg","date":"2015-10-08T20:59:42.512+0000","up_votes":2,"down_votes":0,"body":"I like your idea of lowering the range. It would at least make her have to take on some risk when she uses them. She would still have good poke with her zapper.","replies":[]}]}]}]}]},{"poster":"IcyPepper","date":"2015-10-08T17:02:18.038+0000","up_votes":3,"down_votes":0,"body":">When the same adc also has max attack speed in melee range\n\nShe can have max attack speed, *or* rockets. She can't have both :V Her attack speed per level is low without the minigun to prevent rocket spam.\n\nThat aside, even though I do'nt support just gutting Jinx her rockets either need a splash damage reduction (like Yasuo Q?) or the inability to crit *except* for the intended target.","replies":[{"poster":"Dar Raksada","date":"2015-10-08T21:43:05.277+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tombdragon,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000f,timestamp=2015-10-08T17:02:18.038+0000)\n>\n> She can have max attack speed, *or* rockets. She can't have both :V Her attack speed per level is low without the minigun to prevent rocket spam.\n> \n> That aside, even though I do'nt support just gutting Jinx her rockets either need a splash damage reduction (like Yasuo Q?) or the inability to crit *except* for the intended target.\n\nshe can sorta have both if she keeps swapping right? It's been a while since I played her.","replies":[{"poster":"IcyPepper","date":"2015-10-09T00:03:43.950+0000","up_votes":1,"down_votes":0,"body":"*Sort of,* if you want to get technical about it.\n\nIIRC she'll hold onto the minigun stacks she's accumulated until she fires her first rocket, which then she starts at her lowest base attack speed at her level (with no bonus from her Q). If she switches to minigun after firing a rocket, she'll start at 0 stacks but builds up. If she switches from gun to rocket back to gun without firing, she keeps her stacks (but they continue to decay).","replies":[]}]}]},{"poster":"Narasimha","date":"2015-10-08T16:42:15.843+0000","up_votes":5,"down_votes":3,"body":"So a champion who is meant to be strong in mid-game team fights... is strong in mid game team fights?\n\nLet me guess, you want to nerf Tristana's range and Vayne's true damage too.","replies":[{"poster":"Hayaishi2","date":"2015-10-08T16:58:06.771+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Narasimha,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000d,timestamp=2015-10-08T16:42:15.843+0000)\n>\n> So a champion who is meant to be strong in mid-game team fights... is strong in mid game team fights?\n> \n> Let me guess, you want to nerf Tristana's range and Vayne's true damage too.\n\nIf only she was just \"strong\" she is as opressive as Vayne, her kit is too overloaded,   being inmobile doesnt matter when you have 700 range chompers and a passive that gives a fuck load of mobility.","replies":[{"poster":"Silents429","date":"2015-10-08T17:31:21.191+0000","up_votes":3,"down_votes":3,"body":"Her passive requires her to get a kill or assist, and only a brief movement speed boost?\n\nThat's a \"fuck load of mobility\" to you?\n\nWhat about dodging the chomps? \n\nIf anything Jinx is an immobile ADC with just the right kind of power and weaknesses, it's just easier to demand nerfs then get better at the game.","replies":[{"poster":"Hayaishi2","date":"2015-10-08T17:37:28.460+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=GGsfpxpv,comment-id=000d00000000,timestamp=2015-10-08T17:31:21.191+0000)\n>\n> Her passive requires her to get a kill or assist, and only a brief movement speed boost?\n> \n> That's a \"fuck load of mobility\" to you?\n> \n> What about dodging the chomps? \n> \n> If anything Jinx is an immobile ADC with just the right kind of power and weaknesses, it's just easier to demand nerfs then get better at the game.\n\n175% bonus movement speed isn't a fuckload? Chomps problem is not dodging it, it serves as an area control to give her peel, the entire point of chompers is to zone someone from an area. You talk about getting better at the game and you don't even know basic stuff.\n\nShe'a an immobile adc whos only weakness is not having on demand mobility but still has mobility anyways. If you think that's enough weakness for a champion with  the amount of strengths jinx has i feel sorry for you.","replies":[]}]}]}]}]}