{"poster":"ABCMonster","date":"2015-03-11T17:00:23.098+0000","title":"Dia Team [5v5] sucht Jungler","subforum":"Clans & Teams","up_votes":5,"down_votes":5,"body":"Hallo,\r\n\r\nwir halten z.Zt. ausschau nach einem Main Jungler welcher Spielerisch und Menschlich zu uns passt.\r\n\r\nWir sind alle 20+ jung, aufgeschlossene und Kommunikative Spieler, welche klare Richtlinien Verfolgen. Regelmäßiges Spielen, Teilname an Turnieren sowie Scrims sind selbstverständlich. Somit orientieren sich Trainigszeiten meistens an einer Absprache via Whats App. In der Regel spielen wir in der Woche bis zu 4/5 mal.\r\nUnser Team kann mit Beständigkeit glänzen, somit muss ein Bewerber keine Angst haben das sich dieses Team in der nächsten Woche auflöst. Mit kleinen Line Up Veränderungen besteht das Team seit über 8 Monaten.\r\n\r\nErwartungen an dich?\r\n\r\n- Shoutcall bereitschaft/erfahrung\r\n- Kommunikativer Jungler der einen ausgewogenen Championpool mit sich bringt.\r\n- Teamerfahrung! Warding, Objektiv Control sollten keine neuen Begriffe für euch sein.\r\n- Main Jungler!!\r\n- Ab 18Uhr verfügbar sein, ausnahmen möglich.\r\n- Kritikfähigkeit (Fähig sein Kritik zu formulieren und sie ebenfalls anzunehmen).\r\n eine alters Selektierung findet bei uns nicht statt\r\n- Elo Technisch solltet ihr euch im High Plat - Dia 3 bereich aufhalten\r\n- Wollt ihr mehr über das Team erfahren oder habt nur ein paar fragen, schreibt mich Ingame unter \"Abcmonster\" an, bzw addet Nuktal.","replies":[{"poster":"ABCMonster","date":"2015-03-24T15:51:29.156+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"ABCMonster","date":"2015-03-23T13:09:03.752+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"ABCMonster","date":"2015-03-18T16:59:24.197+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]},{"poster":"ABCMonster","date":"2015-03-13T15:37:31.788+0000","up_votes":1,"down_votes":0,"body":"hoch damit","replies":[]},{"poster":"ABCMonster","date":"2015-03-12T20:02:46.282+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"Unknown Buggy","date":"2015-03-12T10:26:33.759+0000","up_votes":1,"down_votes":0,"body":"Moinsen bin zwar nur Plat 3 aber versuche mich in SoloQ vorranzubringen :)\n\nZu mir ich bin 23 studiere Momentan noch (Masterarbeit schreiben ftw) ;D  \n\nTeamerfahrung ist da, 18 uhr klappt bei mir halt bis auf dienstag und donnerstag da habe ich training :) aber ausnahmen gibt es ja immer xD\n\nZu meinem Championpool: gib mir ein champion und ich spiele diesen aber spiele lieber utillity jungler also wie sejuani, skarner, hecarim, nautilus und auch die meta jungler wie jarvan, vi und nidalee(diese nur wenn gewollt :D)\n\nkannst dich ja melden wenn ich in frage komme ansonsten viel glück und so :)\n\nund immer schön den drake smiten nicht vergessen xD btw rift scuttler ist dein freund nicht dein feind","replies":[]}]}