{"poster":"PiggyTheAstro","date":"2018-04-21T15:28:41.853+0000","title":"Rengar is severely UP","subforum":"Gameplay","up_votes":1,"down_votes":10,"body":"Alright, let&#039;s talk about his passive first, firstly, the fact that he can only leap out of a bush at a target, like, not just leap over terrain from a bush or anything, he NEEDS to leap onto a target, which is stupid since he&#039;s ALREADY immobile, and even when chasing, the enemy can avoid bushes, or place traps (like Teemo mushrooms) into the bushes to slow down the Rengar, which makes you extremely predictable while playing him.\r\n\r\nHis ferocity gimmick is nice, but the fact that he just loses it if the enemy simply walks away from him is... weak, building it is hard since your abilities would most likely already be on cooldown after you built it.\r\n\r\nHis bonetooth necklace is, well, decent but Rengar has really weak ganks (especially pre-6) so it will take a while to build it. (You have an excuse to scream at your team for kill stealing though)\r\n\r\n**Q:** Not bad, I can&#039;t say something negative except from the fact that a steroid is the last thing Rengar needs.\r\n\r\n**W:** Is he a diver or a slayer? That&#039;s what Riot need to decide, some wise person once said &quot;prevention is better than cure&quot; and guess what? I&#039;d rather be able to leap out of that Ziggs&#039; ultimate and take no damage rather than healing 50% later...\r\n\r\n**E:** So, once that Blitzcrank calmly walks away from you, you decide that the only thing you can do is throw a bola at him, its ferocity effect is neat, but again, you&#039;d most likely use it to build said ferocity.\r\n\r\n**R:** Should say &quot;Rengar tells the entire enemy team he&#039;s coming, they group up and you can&#039;t kill anything&quot; oh and guess what? If you do, you&#039;ll probably die next unless you can outwalk the enemy, but I doubt you can. Honestly though, even Jinx has a better way to get out after a kill.\r\n\r\nAnd guess what? Assassins are meant to be squishy but compensate that with 1) Dealing a lot of damage\r\n~~2) High mobility~~ crossed out because it&#039;s something Rengar doesn&#039;t have anywhere except his dreams. \r\n\r\nThis is what I propose: (implement 2 of these changes)\r\n\r\n1) Can leap anywhere while being in bushes\r\n2) Doesn&#039;t need to be in bushes to leap\r\n3) Rework his W and Q\r\n4) No one except Rengar and his team knows when he ults\r\n5) Make his W into a dash of some sort\r\n6) His W now also grants him health and protections\r\n7) His E  **always** roots","replies":[{"poster":"Kelg","date":"2018-04-21T16:14:39.665+0000","up_votes":5,"down_votes":0,"body":"Did you mean to put this in Memes & Games?","replies":[]},{"poster":"Jbels","date":"2018-04-21T15:47:14.255+0000","up_votes":4,"down_votes":0,"body":"Can confirm this is bullshit. I've watched Rengars with just 3 items completely one-shot squishies out of ult, and his Bola's slow is coming very close to crossing over the line into the realm of \"An assassin shouldn't have this\". The slow on it is reeeediculous, to the point where you don't even need to waste ferocity on the root. Rengar is NOT underpowered. He does what he was meant to do, and maybe a little too well at that.","replies":[{"poster":"PiggyTheAstro","date":"2018-04-21T16:19:08.795+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Jbels,realm=NA,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=0000,timestamp=2018-04-21T15:47:14.255+0000)\n>\n> Can confirm this is bullshit. I&#x27;ve watched Rengars with just 3 items completely one-shot squishies out of ult, and his Bola&#x27;s slow is coming very close to crossing over the line into the realm of &quot;An assassin shouldn&#x27;t have this&quot;. The slow on it is reeeediculous, to the point where you don&#x27;t even need to waste ferocity on the root. Rengar is NOT underpowered. He does what he was meant to do, and maybe a little too well at that.\n\nWhen did I say that Rengar can't kill people with his ult? I think you didn't read through the post really well, I said that Rengar has no way of escaping after getting a pick since the enemy team will be ready due to the fact that the ultimate alerts the enemy.\n\nFunnily enough, you only mentioned about him killing stuff with his ult (what about pre-6? Heh?\n\nYou might have also misunderstood my bola sentence, I'm saying that Rengar relies on his E too much, with him not being able to chase or escape without the slow.","replies":[]}]},{"poster":"OniZetsu666","date":"2018-04-21T16:38:50.747+0000","up_votes":2,"down_votes":0,"body":"Apparently you have never seen a dark harvest Rengar shred through just about everyone like they were wood in a chipper shredder.","replies":[]},{"poster":"PiggyTheAstro","date":"2018-04-21T16:24:10.481+0000","up_votes":1,"down_votes":2,"body":"Alright guys, name me ONE assassin weaker than him.","replies":[{"poster":"Jbels","date":"2018-04-21T16:30:35.367+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PiggyTheAstro,realm=EUW,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=0002,timestamp=2018-04-21T16:24:10.481+0000)\n>\n> Alright guys, name me ONE assassin weaker than him.\n\nEkko.","replies":[{"poster":"PiggyTheAstro","date":"2018-04-21T16:40:44.031+0000","up_votes":1,"down_votes":2,"body":"He is mostly played mid, not the jungle, so he is balanced around mid, he WILL be weaker than an actual jgler, but even though he is mostly mid, he still is superior to Rengar at ganking since he has better mobility than Rengie which will allow him to chase and thus finish off weak targets better. Oh and his ult gives him some \"tankiness\" which Rengar doesn't (but should) have","replies":[{"poster":"Jbels","date":"2018-04-21T17:00:40.255+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PiggyTheAstro,realm=EUW,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=000200000000,timestamp=2018-04-21T16:40:44.031+0000)\n>\n> He is mostly played mid, not the jungle, so he is balanced around mid, he WILL be weaker than an actual jgler, but even though he is mostly mid, he still is superior to Rengar at ganking since he has better mobility than Rengie which will allow him to chase and thus finish off weak targets better. Oh and his ult gives him some &quot;tankiness&quot; which Rengar doesn&#x27;t (but should) have\n\nRengar gets tankiness from his W. We weren't talking about chasing down and killing, we were talking about upfront, blink and you die damage output. Ekko pales in comparison to Rengar's ability to completely destroy people in the blink of an eye. A ton of Ekko's damage is tied to an ult that more often than not won't ever be used for its damage.","replies":[{"poster":"PiggyTheAstro","date":"2018-04-21T17:27:21.670+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Jbels,realm=NA,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=0002000000000000,timestamp=2018-04-21T17:00:40.255+0000)\n>\n> Rengar gets tankiness from his W. We weren&#x27;t talking about chasing down and killing, we were talking about upfront, blink and you die damage output. Ekko pales in comparison to Rengar&#x27;s ability to completely destroy people in the blink of an eye. A ton of Ekko&#x27;s damage is tied to an ult that more often than not won&#x27;t ever be used for its damage.\n\nAnd where did I say we aren't talking about chasing down and killing?\n\n","replies":[{"poster":"Jbels","date":"2018-04-21T17:28:59.714+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PiggyTheAstro,realm=EUW,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=00020000000000000000,timestamp=2018-04-21T17:27:21.670+0000)\n>\n> And where did I say we aren&#x27;t talking about chasing down and killing?\n\nEither way, Rengar beats Ekko in that as well. The slow he gets on Bola makes getting away from him a chore even with flash. Ekko is still a worse assassin than Rengar currently is","replies":[{"poster":"PiggyTheAstro","date":"2018-04-21T18:15:59.185+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Jbels,realm=NA,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=000200000000000000000000,timestamp=2018-04-21T17:28:59.714+0000)\n>\n> Either way, Rengar beats Ekko in that as well. The slow he gets on Bola makes getting away from him a chore even with flash. Ekko is still a worse assassin than Rengar currently is\n\nAnd that goes back to my point of Rengar currently relying on his bola, let's assume that he doesn't use his bola at all. He is pretty much dead. \n\nActually, screw that, if he loses an engagement (maybe because the enemy used his ult) he can't do anything, he's a dead cat, literally. \n\nIf he is considered \"tanky\" because he has a self heal, {{champion:36}}  and {{champion:19}}  are vanguards.\n\nHe has NO surprise element, there is no \"oh crap I'm dead\" feel when you see a {{champion:121}}  (who is a direct upgrade to Regnar) or when you see the mentioned above {{champion:19}} or even  a{{champion:35}} .\n\nIf you read my proposed changes, I mentioned the fact that Rengar shouldn't alert anyone when he ults.\n\n\nEven if he manages to get through the laning phase, he is totally useless in teamfights, and due to his lack of mobility, he can't split push and his ult (and the fact that the enemy team probably has a CC heavy tank like {{champion:79}}  or {{champion:54}} ) makes him useless late game.","replies":[{"poster":"Jbels","date":"2018-04-21T20:08:46.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PiggyTheAstro,realm=EUW,application-id=3ErqAdtq,discussion-id=5lEAifdy,comment-id=0002000000000000000000000000,timestamp=2018-04-21T18:15:59.185+0000)\n>\n> And that goes back to my point of Rengar currently relying on his bola, let&#x27;s assume that he doesn&#x27;t use his bola at all. He is pretty much dead. \n> \n> Actually, screw that, if he loses an engagement (maybe because the enemy used his ult) he can&#x27;t do anything, he&#x27;s a dead cat, literally. \n> \n> If he is considered &quot;tanky&quot; because he has a self heal, {{champion:36}}  and {{champion:19}}  are vanguards.\n> \n> He has NO surprise element, there is no &quot;oh crap I&#x27;m dead&quot; feel when you see a {{champion:121}}  (who is a direct upgrade to Regnar) or when you see the mentioned above {{champion:19}} or even  a{{champion:35}} .\n> \n> If you read my proposed changes, I mentioned the fact that Rengar shouldn&#x27;t alert anyone when he ults.\n> \n> \n> Even if he manages to get through the laning phase, he is totally useless in teamfights, and due to his lack of mobility, he can&#x27;t split push and his ult (and the fact that the enemy team probably has a CC heavy tank like {{champion:79}}  or {{champion:54}} ) makes him useless late game.\n\nI see what you're saying, but all I'm getting is \"Rengar's intended weaknesses shouldn't be there\". Champions shouldn't be dumbed down like that. It makes them way too easy to play and they invariably end up being the weakest champions, power and experience. As for that feeling of \"oh shit\", I challenge you to find someone who hasn't gotten away with half health from a fight and when that Rengar symbol appears over there head and they hear the noise from his ult, HASN'T shit themselves. \n\nBelieve it or not, if Rengar's ult didn't alert you, it would take away the feeling of dread somebody feels just from being allowed to fear for their lives for a second. Imagine if there was no indication and suddenly you were just dead. This was what made old Rengar one of the most hated champions in league. He's fine the way he is right now","replies":[]}]}]}]}]}]}]}]},{"poster":"PhearBunny","date":"2018-04-21T17:55:46.518+0000","up_votes":1,"down_votes":0,"body":"Rengar is the same damn thing as Nocturne.\nExcept better.","replies":[]},{"poster":"Winterwings","date":"2018-04-21T17:46:29.393+0000","up_votes":1,"down_votes":0,"body":"\"And guess what? Assassins are meant to be squishy\"\nvs.\n\"6) His W now also grants him health and protections\"\n\nI find this contradiction really funny!\nAlso, on topic... I don't think it's so much of a Rengar being UP, rather than the fact that Kha'zix is just a superior version of him at any stage when compared as Assassins...\n\nRengar just feels like Riot tried really hard (almost too hard) to make him a Assassin that fights like a Bruiser... which was ofc doomed to fail...\nAnyways, playing against a fed Rengar is still a hellish experience if you're the ADC in low and mid elos...","replies":[]}]}