{"poster":"Brandenburg","date":"2017-07-07T14:46:41.296+0000","title":"New Player Queue Times","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Whats up with MM for new players? Are there no bad players in OCE server or something? It is typically 7-10 minutes queue time for normals before I get a match, and at times the match maker seems to really spazz out when it gets to these long times. I just had a match where I spent 16:20 in queue, and the match barely made it to 18 minutes. At the moment I have been in queue for nearly 18 minutes.\n\nObviously at time of post this isn&#039;t quite prime time for the server, but regardless of time of day or which day, it is pretty much guaranteed I will be waiting over 5 minutes for a match. At five minutes, I wonder why I bother waiting for a game. At ten minutes, I tend to get the pokies addict feeling of &quot;it is right around the corner now&quot;. Combine this with what at times seems to be quite clearly unbalanced MM, I really wonder if I want to keep playing the game.\n\nI don&#039;t really want to play against bots any more, firstly because I am getting to the point where I can destroy them and hard carry whatever team. It is also incredibly boring when good players end up in your team against bots, it really doesn&#039;t matter if you play or not. So is there a solution for this? My only hope is I can be good enough that my MMR or whatever climbs to an acceptable level (queue time wise) very quickly because I struggle to see myself putting up with these ridiculous queue times for much longer.\n\nedit: 24 minutes at the moment. I have had time to have a cigarette, use the toilet, post this, and a handful of other miscellaneous things. at this stage it is getting to the point where I will be waiting for as long as an average match. Logged out","replies":[{"poster":"Brandenburg","date":"2017-07-08T06:16:53.239+0000","up_votes":1,"down_votes":0,"body":"Thanks for your advice. I have noticed the few ARAM games I have played queue times are sometimes better, but sometimes just as bad. Does ranked and ARAM have better player numbers across all skill levels then normals? I had planned to save my IP for the better runes upon hitting level twenty, but if ranked has better queue times across all MMRs then I might be better off trying to rush 20 champions and do the runes later.\n ARAM is fun, but completely different. I guess it would help a lot with regards to general champ knowledge and such","replies":[{"poster":"Ninox","date":"2017-07-09T02:19:58.044+0000","up_votes":1,"down_votes":0,"body":"I wouldn't recommend playing ranked fresh off level 30. The minimum recommendation is 300 normal wins before jumping into ranked, since anything less and you just won't have the game knowledge or mechanics to compete, and will inevitably fall to low Bronze, which, given the polarising nature of the games, is a lot harder to get out of even if you up your skill, and if you are the kind of person to refuse to play normals, you'll likely get stuck there, because the environment there stunts skill growth.\n\nI also wouldn't recommend playing ranked without at least tier 2 runes.\n\nARAM actually has a lower pop than normals, but at lower levels it is higher. If you play ARAMs/bots through to about lvl 15-20 then things will get much better in normals. Ranked has a lower population than normals as well, partly because the queues are split, but also just in general.","replies":[]}]},{"poster":"Ninox","date":"2017-07-08T05:48:13.951+0000","up_votes":1,"down_votes":0,"body":"Tele pretty much covered it, but if you're up for a bit more of a challenge, you could queue with a higher level friend's smurf (or they're main depending how ambitious you're feeling). It'll mean harder games for you since you'll be mostly playing with people of a much higher skill, but it means your queue times will be a lot shorter.","replies":[]},{"poster":"Tele","date":"2017-07-07T21:36:09.108+0000","up_votes":1,"down_votes":0,"body":"Unfortunately what happens is that most players at your level only play bots. So since the normals population is really low, the system has a choice of really long queue times, or matching you up unfairly with experienced level 30 players.\n\nIf you're looking for reasonably satisfying PVP but without huge queue times, I'd recommend you queue up for ARAM. The queue times should be much shorter at low levels, and the games should be higher quality than the ones you're getting in normals now.","replies":[]}]}