{"poster":"Isekai Kitsune","date":"2016-09-23T15:20:01.016+0000","title":"ArUrf","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":12,"body":"Jetzt mal ganz im Ernst, wie kann man den Urf modus mit aram verschmelzen. Nicht nur, dass ich mir keinen tollen Champion mehr w&auml;hlen darf, nein, jetzt verschwende ich meine ARAM rerolls daf&uuml;r, anderen bullshit zu bekommen ? Ich pers&ouml;nlich bin der Meinung, dass Riot damit den gr&ouml;&szlig;ten Mist seit 2 Jahren gebaut hat.","replies":[{"poster":"TerrorRaven","date":"2016-09-23T15:22:38.353+0000","up_votes":8,"down_votes":1,"body":"Finde ich nicht. Dadurch hat der Modus endlich wieder eine Existenzberechtigung außerhalb von Sandbox-Ersatz. Bei den letzten beiden Male hat sich schnell eine Meta festgefahren, von der man nicht abweichen konnte. Jetzt, da jeder einen zufälligen Champ bekommt, gibt es nun endlich Abwechslung.","replies":[{"poster":"Julian Chopper","date":"2016-09-24T12:48:07.012+0000","up_votes":1,"down_votes":4,"body":"Jetzt wird das Spiel erst recht in der Champselect entschieden. Ein Team kann zu 99% gleich in der Base bleiben, da sie eh keine Chance haben zu gewinnen. Einfach nur langweilig.","replies":[{"poster":"TerrorRaven","date":"2016-09-24T13:00:58.901+0000","up_votes":4,"down_votes":1,"body":"Mit der Einstellung kannst du gleich mit LoL aufhören, da sowas immer passieren kann, egal ob Normal, Ranked, 3v3, Hexakill, URF, One for All, Aufstieg, ARAM, Legende des Porokönigs, Eindeutig nicht Dominion oder Nexus Belagerung.","replies":[{"poster":"Julian Chopper","date":"2016-09-24T13:59:11.255+0000","up_votes":2,"down_votes":4,"body":"Was für ein Schwachsinn. Urf wird durch die Champs entschieden. In Normals kann ich einen Champ meiner Wahl spielen und auf die gegnerischen Picks reagieren.","replies":[{"poster":"TerrorRaven","date":"2016-09-24T16:04:02.483+0000","up_votes":3,"down_votes":0,"body":"Als ob das in normalen URF anders gewesen wäre.","replies":[{"poster":"Julian Chopper","date":"2016-09-24T21:35:40.436+0000","up_votes":1,"down_votes":1,"body":"Nein, aber da konnte ich wenigstens auch was starkes picken und nicht so einen Krampf wie Bard.","replies":[{"poster":"Sirrkas","date":"2016-09-24T21:37:02.270+0000","up_votes":2,"down_votes":0,"body":"Bard ist in Urf ziemlich stark.","replies":[]},{"poster":"TerrorRaven","date":"2016-09-24T21:53:37.993+0000","up_votes":1,"down_votes":0,"body":"In normalen URF hat man jede Runde die selben Champs gesehen. Das wurde nun abgeschwächt.","replies":[]}]}]}]}]}]},{"poster":"Avor Ashkeno","date":"2016-09-23T15:27:30.250+0000","up_votes":2,"down_votes":1,"body":"Wo du recht hast, hast du recht.","replies":[]},{"poster":"Xortexus","date":"2016-09-23T21:56:35.940+0000","up_votes":1,"down_votes":4,"body":"Abwechslung schön und gut, aber wenn ich als Taric einer Lux hinterher rennen muss macht das meiner Meinung nach deutlich weniger Spaß, als immer den selben Champion zu spielen, den ich dafür aber gerne spiele. \nIch habe bisher nur 4 Runden gespielt und wurde dabei von Champs wie Veigar etc. komplett gestomped, während ich nur crap bekommen hab. vielleicht ist es unglaublich unbalanced, vielleicht hatte ich aber auch einfach nur Pech - aber alleine dass Glück entscheidet, ob ich Spaß haben darf, lässt mir die lust an dem Modus vergehen (ist beim aram zwar ähnlich, aber bei weitem nicht so schlimm). \nIch finde Riot hätte eher versuchen sollen, Urf mehr zu balancen, sodass es immer noch das selbe Chaos bleibt, aber andere Champs auch eine Chance haben. --> Man sollte die Spieler dazu bringen, andere Champions picken zu _wollen_, anstatt sie ihnen aufzuzwingen","replies":[{"poster":"TerrorRaven","date":"2016-09-23T23:14:35.894+0000","up_votes":2,"down_votes":1,"body":"URF kann man nicht balancen, wenn die Grundlage schon nicht ganz gebalanced ist.","replies":[]},{"poster":"Sirrkas","date":"2016-09-23T22:57:38.349+0000","up_votes":2,"down_votes":1,"body":"Wie viel Energie hätten sie denn in die Balance von Urf stecken sollen und wer würde sich die Patchnotes dazu überhaupt ansehen?","replies":[]}]}]}]}