{"poster":"Z3Sleeper","date":"2019-03-26T12:51:05.495+0000","title":"49 days later, Spear of Shojin still exists","subforum":"Gameplay","up_votes":74,"down_votes":12,"body":"When is this Beta item that got leaked to live servers gonna be removed?\r\n\r\nThere is absolutely nothing healthy that it brings to the game. All it does is make those that can abuse it absolutely unbearably strong in both teamfights and duels, with heavy emphasis on the latter.\r\n\r\nThe common counterplay to champions that build Spear is to simply end the game before they can buy it. That's it. There's a large majority of champions who are just outright screwed against Spear users.\r\n\r\nI'm surprised it's even been in the game for 4 patches without a single change.","replies":[{"poster":"BALDG1VEN BOOMER","date":"2019-03-26T13:50:35.289+0000","up_votes":32,"down_votes":1,"body":"Riot: Damage is high \n\nAlso Riot: Let’s introduce an item that’ll maximize your DPS","replies":[]},{"poster":"Frosted Tips","date":"2019-03-26T14:33:39.915+0000","up_votes":24,"down_votes":3,"body":"It has been 1357 days since phantoms hits have been added to the game and they are still plaguing this game, currently through Vayne.","replies":[]},{"poster":"Galaxyburstz","date":"2019-03-26T13:42:01.978+0000","up_votes":25,"down_votes":6,"body":"As a {{champion:92}} main, I hate you.\n\nAs a League player, I agree with you.","replies":[{"poster":"Nevrankroaton","date":"2019-03-27T06:31:29.350+0000","up_votes":1,"down_votes":0,"body":"Most honest answer I saw here, big respect.\n\n(As a filthy renekton fill player, I feel you).","replies":[]}]},{"poster":"Nea104","date":"2019-03-26T14:49:17.592+0000","up_votes":7,"down_votes":0,"body":"Maybe because this company keeps working the same way as in Season 8? When they destroyed their own game?\n\nAnd since the people there are basically the same from 1 year ago, things can't get any better, since they lack of competence, skills and so on? :D","replies":[]},{"poster":"KlydeFrog","date":"2019-03-27T01:00:20.831+0000","up_votes":2,"down_votes":5,"body":"No one cares. Essence reaver used to have the same passive so why is it a issue now?","replies":[{"poster":"Illabethe","date":"2019-03-27T01:17:53.476+0000","up_votes":7,"down_votes":0,"body":"Because it's now on an item with 250 HP in addition to all Essence Reaver's stats.\n\nP.S. People complained about it as Essence Reaver too....\n\nAnd yes. Renek and Riven were building Essence Reaver, even though they don't have Mana.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T00:48:41.105+0000","up_votes":1,"down_votes":0,"body":"And? It doesn't have mana regeneration. Fine get rid of the hp then and you'd still be on here crying about it. Better also nerf and or delete triforce as well cause it works and is strong on renekton.","replies":[{"poster":"Illabethe","date":"2019-03-29T04:53:15.694+0000","up_votes":1,"down_votes":0,"body":"Triforce doesn't put a fixed cooldown champ against a champ whose cooldowns drop 20% every time they auto attack. Never before in the history of league have these champs been able to spam skills for free, no cost, and no counterplay.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T05:29:21.616+0000","up_votes":1,"down_votes":0,"body":"lol okay essence reaver before would make ur aa also go faster after ult so whats your point?","replies":[{"poster":"Illabethe","date":"2019-03-29T11:04:07.575+0000","up_votes":1,"down_votes":0,"body":"Once again..... Renekton/Riven etc were all using Essence Reaver too. And their win rates began skyrocketing once they did. This isn't a new conversation. It's been around for about 9 months. And Riot hasn't changed a thing.","replies":[]}]}]}]}]},{"poster":"BeatzBoyFTW","date":"2019-03-27T02:29:43.633+0000","up_votes":2,"down_votes":0,"body":"Huh? That item was already complained before. It's just that Spear of Shojin favors a more wider variety of bruisers using it, instead of the Mana ER grants.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T00:46:49.131+0000","up_votes":1,"down_votes":0,"body":"Again no one cares . Stop complaining,  so what one unused thing to get the passive ohh man. Also triforce might as well nerf that and delete it . Cause garen and renekton get it cause its strong","replies":[{"poster":"BeatzBoyFTW","date":"2019-03-29T05:07:02.278+0000","up_votes":1,"down_votes":0,"body":"You honestly made no sense, and gets angry for completely no reason.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T05:30:04.023+0000","up_votes":1,"down_votes":0,"body":"says the person crying over a item that anyone can use and make do","replies":[{"poster":"BeatzBoyFTW","date":"2019-03-29T05:49:17.601+0000","up_votes":1,"down_votes":0,"body":"Pretty sure they were completely fine **before the item was introduced**. It all literally started when Essence Reaver was originally intended for ADCs to use it well until Renekton &amp; Jax players started abusing the item. \n\nAnd the item right now just looks really unnecessary to give bruisers such an URF debuff in a normal mode. It's like cooldowns doesn't matter in League anymore.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T07:18:46.653+0000","up_votes":1,"down_votes":0,"body":"right because ad and 20% cdr is bad on anyone ?","replies":[{"poster":"BeatzBoyFTW","date":"2019-03-29T07:24:14.546+0000","up_votes":1,"down_votes":0,"body":"It's the passive that's bad, not the stats. Stats would've been nice on an item with a different passive, but giving URF mode to literally anyone is just straight up unbalanced.","replies":[]}]}]}]}]}]}]}]},{"poster":"BeatzBoyFTW","date":"2019-03-27T02:28:47.529+0000","up_votes":5,"down_votes":0,"body":"9 years later, newly released champions are STILL allowed in Ranked games...","replies":[]},{"poster":"Abibyama II","date":"2019-03-26T13:23:19.388+0000","up_votes":10,"down_votes":29,"body":"I think it's overrated, but fuck it.\n\nWeeb spear bad upvotes to the left ","replies":[{"poster":"LTK KoRo","date":"2019-03-26T13:49:12.436+0000","up_votes":5,"down_votes":22,"body":"because it is overrated, and for sure hard overcried on boards.\n\npeople are complaining about spear all the time, while only jax builds it as his second or third item. Also spear is viable on like three champions, jax, renekton and riven. Jax builds it frequently, Riven usually ignores it because stuff like DD, Cleaver etc. suit her better, and Renekton is busy rushing tiamat and cleaver. Spear is literally used often on a single champion, but boards are crying about it like it's a core item on adcs","replies":[{"poster":"Z3Sleeper","date":"2019-03-26T14:16:34.928+0000","up_votes":13,"down_votes":2,"body":"Those 3 champions are the exact reason why it's problematic (less so Renekton, but it's still obnoxious).\n\nIt doesn't need to be broken on every champion to be problematic. Hell its current iteration dissuades anyone but those who can abuse it to buy and it boy do they abuse it.\n\nBut hey, don't take my word for it, let the stats speak for themselves:\n\nRiven - 63% winrate upon completion of it as a 4th item\nhttps://u.gg/lol/champions/riven/build/\n\nRenekton - It's a core item\nhttps://u.gg/lol/champions/renekton/build/\n\nJax - 64% winrate as a 4th item\nhttps://u.gg/lol/champions/renekton/build/\n\nThe pick rates of the items are low, which is why their overall win rates aren't as high. Because the game is typically ending before they can finish the item. But they are the most popular pickups for 4th item and for Renekton's 3rd item.","replies":[{"poster":"KlydeFrog","date":"2019-03-29T05:31:49.558+0000","up_votes":1,"down_votes":0,"body":"no your making no sense now. its not a rushed item and anyone can use it .","replies":[]}]},{"poster":"Sir Saltarin","date":"2019-03-26T14:30:48.543+0000","up_votes":6,"down_votes":1,"body":">Jax builds it frequently\n\nYup\n\n>Riven usually ignores it because stuff like DD, Cleaver etc. suit her better\n\nThird most bought item https://lolalytics.com/ranked/worldwide/platinum/plus/champion/Riven/\n\n>and Renekton is busy rushing tiamat and cleaver\n\nSpear is his second most bought item https://lolalytics.com/ranked/worldwide/platinum/plus/champion/Renekton/\n\n>Spear is literally used often on a single champion,\n\nNo, just no, and Yi also has it as his third most bought item btw.\n\n>but boards are crying about it like it's a core item on adcs\n\nSpear of Shojin rush on MF PogChamp, outside jokes I also think that the Boards cry too much about it, but dont go the other way.","replies":[{"poster":"AceAlex031","date":"2019-03-27T13:53:07.978+0000","up_votes":1,"down_votes":0,"body":"Maybe nerf the effect for ranged champs?  ¯\\_(ツ)_/¯","replies":[]}]}]}]},{"poster":"PaladinNO","date":"2019-03-27T08:39:15.064+0000","up_votes":3,"down_votes":0,"body":"But, but...wouldn't a Beta item fit right in in a Beta client, written about on the Beta boards? :O","replies":[]},{"poster":"O Fallen Scholar","date":"2019-03-26T14:14:12.321+0000","up_votes":3,"down_votes":0,"body":"People who go SoS first are trash at this game.","replies":[]},{"poster":"Saianna","date":"2019-03-26T16:44:25.861+0000","up_votes":3,"down_votes":1,"body":"This passive would make a whole lot more sense for mages tbh.","replies":[{"poster":"FCJAAAAGOOOO","date":"2019-03-26T16:49:00.432+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=xhW6VJUB,comment-id=0009,timestamp=2019-03-26T16:44:25.861+0000)\n>\n> This passive would make a whole lot more sense for mages tbh.\n\n***vomits***","replies":[{"poster":"Saianna","date":"2019-03-26T16:50:55.140+0000","up_votes":3,"down_votes":1,"body":"Just think about it. Mages would have to AA someone, which brings a lil bit of risk-reward. Not to mention I doubt you'd find a mage who's willing to build AS just to AA enemy champion more than twice without the risk of punishment.\n\nEdit: and finally, mages are the class that relies on thier spells the most.","replies":[]}]},{"poster":"Z3Sleeper","date":"2019-03-26T16:51:19.874+0000","up_votes":2,"down_votes":0,"body":"{{champion:518}} says hi.\n\nAttack Speed on-hit Neeko with permasnare E oh boi.","replies":[]}]},{"poster":"Dragonface","date":"2019-03-27T03:31:55.127+0000","up_votes":1,"down_votes":0,"body":"I'm waiting on Riot to come out and do something about it.  I mean look at the track history of items they've nerfed because they \"have no counter\"\n\nDodge removal from Zeal/PD back in the day.\nQSS for Zed ult.\nLocket (RIP)\nAtma's (Atmog's)\nStacking Sunfire's on Garen before they became unique.\nLantern which was removed SPECIFICALLY because of Lee (and then they released warding trinkets...)\nDFG\nFQC\n\nSome of these items even still had counters and they were deemed \"too strong\" and could have just been nerfed but were removed anyway (DFG, Locket, Lantern).  Shojin has no counter besides \"Get lucky and kill them before they use it\" or \"Win the game before it's bought\".\n\nI got stomped by 3 Rivens in a row that bought Spear and I haven't touched normal/ranked since.\n\nThe point of the CD on Riven's ult is so she has highs and lows.  Reducing these times makes her feel way too powerful and removes a lot of her weaknesses.\n\nCall me bad, but ultimately, if a champion is just unfun to play against on just about any champ, you might want to rethink the direction you're sending that champion.","replies":[{"poster":"GigglesO","date":"2019-03-27T04:33:04.688+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dragonface,realm=NA,application-id=3ErqAdtq,discussion-id=xhW6VJUB,comment-id=0016,timestamp=2019-03-27T03:31:55.127+0000)\n>\n> Call me bad, but ultimately, if a champion is just unfun to play against on just about any champ, you might want to rethink the direction you're sending that champion.\n\nThis is how I feel about getting instantly burst. \n\nIt just feels bad. Thats why I want them to buff tanks and defense.","replies":[]}]},{"poster":"Afk on Lane","date":"2019-03-27T09:22:45.422+0000","up_votes":2,"down_votes":1,"body":"I just don't understand opinion of some people, that there was an{{item:3508}} before, why no one was complaining about it before and now people complain about {{item:3161}} . The answer is that mana from er was converted to the HP and the only ones who where using this item were bruisers except {{champion:15}} {{champion:67}} sometimes but these were rarely seen builds.\nMainly {{champion:24}} {{champion:58}} {{champion:92}} . I didn't even complain about ER, because this item was only giving dps, These champions didnt have 250 hp, so i could just kill them easier. But with this hp they are less punishable, they  scale better into the next item which will also give them hp{{item:3748}} {{item:3053}} or in the riven case she will buy maybe {{item:3812}} which also gives her tons of survability. In previous season I wasnt even buing ER on jax due to the fact that i needed to build HP in every moment of the game. Right now I just buy it as second item on because it gives me hp . Lmao there's even no point to buy tiamat 2nd or early, if i  am not much behind or destroyed I just delete enemy back lane and winning the game. I don't even just care about k/d/a I just split if possible or winning lane , get SoS and do my job. The only way to delete me from the teamfight is to pick {{champion:34}} or maybe {{champion:69}} on top,mid but cassio has less zoning and is less annoying than anivia.","replies":[{"poster":"karolmo","date":"2019-03-27T15:03:31.135+0000","up_votes":1,"down_votes":0,"body":"People was complaining about essence reaver for a long time. You didn't face lucian on the old reaver days did you","replies":[{"poster":"Afk on Lane","date":"2019-03-27T15:22:22.747+0000","up_votes":1,"down_votes":0,"body":"Well, I did, but forgot about him lmao, Whatever u build on lucian second is op so ,whatever xd.","replies":[]}]}]},{"poster":"DrippyBrownHole","date":"2019-03-26T20:00:09.314+0000","up_votes":2,"down_votes":1,"body":"Yasuo also still exists\n\nThere's a lot of things that still exist that really shouldn't","replies":[]},{"poster":"AS I LAY FEEDING","date":"2019-03-26T17:53:05.532+0000","up_votes":2,"down_votes":1,"body":"Tbh i havent even seen spear of sojin in ages.","replies":[]},{"poster":"JedenVojak","date":"2019-03-27T02:25:08.786+0000","up_votes":1,"down_votes":0,"body":"Are you going to update the thread title every day this item exists or just post a new one?","replies":[{"poster":"Z3Sleeper","date":"2019-03-27T03:54:38.902+0000","up_votes":1,"down_votes":0,"body":"Too much work nah. Also I think the same person repeatedly posting the same topic is detrimental to the subject as it makes it seem like that one person is the only one that has an issue with it. I'm just adding to the pot of \"remove spear\".","replies":[{"poster":"JedenVojak","date":"2019-03-27T23:45:19.616+0000","up_votes":1,"down_votes":0,"body":"Is the spear fun to use?","replies":[{"poster":"Z3Sleeper","date":"2019-03-28T09:09:54.168+0000","up_votes":1,"down_votes":0,"body":"Being able to faceroll your keyboard and watch as your opponent burns in a hellfire of 0 counterplay is always fun.","replies":[{"poster":"JedenVojak","date":"2019-03-28T09:43:08.912+0000","up_votes":1,"down_votes":0,"body":"Nice. You should use it all the time then.\n\nNothing get's riot to nerf something faster than 90% usage across champions.","replies":[{"poster":"Z3Sleeper","date":"2019-03-28T09:46:48.536+0000","up_votes":1,"down_votes":0,"body":"If only it was good on all champs. It's only good on 4 people.","replies":[]}]}]}]}]}]},{"poster":"Kyovulpes","date":"2019-03-27T02:55:10.426+0000","up_votes":1,"down_votes":1,"body":"I mean nice to know you don't build armor/ health on whatever squishy champ you play I suppose. Cause thats's main gripe of these post usually.\n\n\"this item appeared and instead of My team and I deciding to counter build against it. We played selfish and we lost can you believe that? rito nerf please\"\nboards-","replies":[{"poster":"Z3Sleeper","date":"2019-03-27T03:35:46.332+0000","up_votes":1,"down_votes":0,"body":"Is everything okay man? That's a pretty baseless accusation and unsurprisingly false.","replies":[{"poster":"Kyovulpes","date":"2019-03-27T13:34:22.248+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Z3Sleeper,realm=NA,application-id=3ErqAdtq,discussion-id=xhW6VJUB,comment-id=00150000,timestamp=2019-03-27T03:35:46.332+0000)\n>\n> Is everything okay man? That's a pretty baseless accusation and unsurprisingly false.\n\nwith everything being online says your a *Yorick* top main lane that, \n*heres the kicker*\nrun the core items of {{item:3078}} {{item:3812}} {{item:3053}} \nwith the probability of then maybe running some armor in the form of {{item:3026}} \nand you end up losing most games against {{champion:58}}.  (which makes sense in the form of this post) \n\nso yeah a prime squishy frontliner bruiser ,who if, instead build probs meta golem instead would probably not suffer so hard in those matches. \nbut hey like I said\n\n\"this item appeared and instead of My team and I deciding to counter build against it. We played selfish and we lost can you believe that? rito nerf please\" \nboards-  \n\nbut congrats on being NA's 6th best yorick can't wait till I get there! GL and good climb! hope you make to grandmaster!","replies":[{"poster":"Z3Sleeper","date":"2019-03-27T15:51:18.414+0000","up_votes":1,"down_votes":0,"body":"6th best? According to which site? I thought I held the title of THE best in NA.\n\nhttps://www.leagueofgraphs.com/rankings/summoners/yorick/na\n\nAlso no, building defense against Renekton as Yorick aint gonna work. Due to spear, he’s gonna get 2 full rotations off if you survive the first and you still won’t kill him in that time. With the damage build you can atleast burst him down before the 2nd stun but still survive his initial burst with Steraks.\n\nAlso I’m moreso posting this cuz of Jax tbh.\n\nAnyway, the fundamental principle of Shojin is that they are both squishier but pump out WAY more damage. There’s no way you could actually believe that increasing your defense (by like, a measly 1.3x at best) is gonna make you *win* against them. You’re just gonna take 0.4s longer to die while doing 0 damage to them (Rene stun + heal, Jax counter + stun, Riven shield + DD). You need the power to punch through their sustain and take advantage of their squishier build while building just enough defense to survive their initial burst (that’s what steraks is for). Icing on the cake is that Riven and Rene both rush BC and Jax deals mixed damage. Good luck building defense vs that anyway.\n\nIt’s not like i made this post right after losing to a spear user. My last time facing a rene was what, 6 days ago or something?","replies":[]}]}]}]},{"poster":"Spooky Skeleton","date":"2019-03-27T06:58:55.726+0000","up_votes":1,"down_votes":0,"body":"If they didnt remove rageblade yet there's no chance they'll remove this cancer either. I think Riot's only regret is that neither are good on Yasuo.","replies":[]},{"poster":"Inkling Commando","date":"2019-03-27T02:32:32.678+0000","up_votes":1,"down_votes":0,"body":"topic complaining about an item being broken *marks on bingo card* now i just need a topic about a player complaining about their punishment and i will have a bingo.","replies":[]}]}