{"poster":"s3 Clover s3","date":"2015-06-26T15:55:59.016+0000","title":"Too much armour pen/reduction","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"Last few games I&#039;ve had where we&#039;ve had 2-3 tanks vs full ad teams us tanks with 300-400 armour and 3-5k health still seem to just get melted, what&#039;s up with that, it never used to be like this? The ad teams don&#039;t even need to flank and dive the backline they can just go head on. Any tips ?\n\nIt seems like there are too many armour piercing items that couple with plenty of champion's ability to do the same.\n\n","replies":[{"poster":"McRuthless","date":"2015-06-26T18:26:28.558+0000","up_votes":2,"down_votes":0,"body":"You should not be losing with 2-3 tanks vs a full AD team, especially if they're not even going on the backline. I assume your team either a) was way behind in items; or b) was playing the fights poorly","replies":[{"poster":"JasonWazza","date":"2015-06-26T19:06:32.875+0000","up_votes":1,"down_votes":0,"body":"They don't have to really be behind to be losing the fight, the fact that the gold worth of most of the items they were buying (300 armor and 3-5k health when both works against you), it basically means that a lot of that gold would have been wasted, and that you can easily be behind without actually being behind in gold/items.","replies":[]}]},{"poster":"SexP3ke","date":"2015-06-28T12:39:29.059+0000","up_votes":1,"down_votes":0,"body":"how are there a lot of armor piercing items, there's a total of 3 if you even include 20 armor pen from youmuus, which no one really buys other than zed or maybe talon.\n\nno one builds a last whisper and black clever as first two items, by the time last whisper is build the game is like over half way. and no carry builds a black clever, theres really no room for it and games dont last usually till the 6th item. \n\nlast whisper has been nerfed so many times throughout leagues history, it use to be like 45 percent armor penetration from memory and the mastery tree had like 10 percent armor penetration along with flat armor pen, and people still cried out tanks are op, compared to now you should be happy.\n\nwhen i think or malphite, amumu or shen, nothing but horror fills my mind from how annoying they are. Malphite just wins anything ad in top lane and on top they buffed the shit out of him lately. SHen is literally unkillable. Amumu wins team fights.\n\nthen theres the likes of sejuani, who is pretty strong, very strong. Zac, is a CC machine who deals a fuck load of damage for having no AP. Dont see what else you could want. You cant even punish the likes of leona or thresh, if caught out they take about 15 minutes to kill.\n\nWhat seems to be the problem for tanks are mages, mages melt the shit out of tanks, tanks hardly build magic resist, and magic resist NEVER surpasses the 200 mark, even with like full magic resist items. So thats stupid, armor can pass 300 with like 3 items.\n\nThe only person i find stupid with penetration is ZED and Yasuo. Zed buys only penetration and tank shredding items like BOTRK, he doesnt need crit, or any other functional items like phantom dancer or infinity edge like carrys. He gets botrk, youumuss and last whisper as first three items and its game over to armor in general. The only downfall would be that those items dont give a lot of AD, however he gets that stupid bonus AD and along with masteries and dragon so he still has stupid high amounts still. Y\nasuo's ult just wrecks face, if he isnt CC'd well.\nRANT OVER","replies":[]},{"poster":"TouchMyKimchi","date":"2015-06-28T10:56:33.065+0000","up_votes":1,"down_votes":0,"body":"Your carries must have been sht..\n\nWhen that happens go off-tank and get enough dmg yourselves","replies":[]},{"poster":"JasonWazza","date":"2015-06-26T16:15:39.777+0000","up_votes":1,"down_votes":0,"body":"Honestly stacking armor is now extremely inefficent with BC being an item in most games and LW being a core on ADC's (your looking at losing around about 45-60% of your armor from this.)\n\nAnd this is why the tank meta is starting to die off more or less, because Armor pen is just so abundant.\n\nBut yeah with 300 Armor, your looking at about 100-150 actual armor.","replies":[{"poster":"s3 Clover s3","date":"2015-06-26T16:50:36.107+0000","up_votes":1,"down_votes":0,"body":"How to counter tank meta -> full ad team =D","replies":[]}]}]}