{"poster":"üü  SGC RIVEN üü","date":"2015-07-04T17:26:53.667+0000","title":"Porque ahora veo usando ezreal mid con castigo?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"??????? {{champion:81}} {{summoner:11}}  ","replies":[{"poster":"LagunaStein","date":"2015-07-04T17:55:47.581+0000","up_votes":2,"down_votes":5,"body":"es la moda amigo , o no te acuerdas del {{champion:105}} jg (ad es muy patetico) , {{champion:412}} adc o {{champion:201}} top . siempre se quiere imitar al resto . pero la rubia no va a durar mucho en  mid con castigo ,solo es tiempo de esperar que se acabe la moda y surge una nueva.","replies":[{"poster":"potato support","date":"2015-07-04T23:15:30.696+0000","up_votes":5,"down_votes":1,"body":"mirate marin jugando fizz ad top si te parece patetico. \n\n\nte falta entender porque se hacen estas cosas.","replies":[]}]},{"poster":"Neo Gaussrik","date":"2015-07-05T01:25:49.015+0000","up_votes":4,"down_votes":3,"body":"Es una interaccion no deseada entre el encantamiento Guja Runica y el Eco de Luden.\n\nEs una moda interesante, pero tambien una que consideramos un bug, y probablemente lo removamos en el futuro cercano.\n\n( Daria mas detalles, pero siento que las otras respuestas en la discusion lo explican bastante bien! )","replies":[{"poster":"Ciencia","date":"2015-07-06T13:15:27.756+0000","up_votes":1,"down_votes":0,"body":"Me gustaria saber porque es considerada un bug si la aguja runica funciona de forma muy parecida al liche , y   q de ez aplica  efectos e impacto , al mismo tiempo que al ser un hechizo hace que salte el eco .","replies":[{"poster":"Neo Gaussrik","date":"2015-07-06T13:33:11.264+0000","up_votes":2,"down_votes":0,"body":"OK, te explico.\n\nEsto fue un bug del que no nos dimos cuenta durante el desarrollo. El eco de Luden se activa cuando hagas daño de hechizo, que son fuentes de daño que aplican efectos como la ralentizacion del Rylais, o el vampirismo de hechizo del revolver hextech. El daño de \"proc\" no interactua con estos efectos- por eso, la capa de fuego solar no te ralentiza permanentemente cuando tienes el cetro de Rylai. Adicionalmente, a el Luden no le importa que tipo de daño se aplica, asi que incluso habilidades que hacen daño fisico como la Q de Talon activarian el efecto del objeto si alguna vez lo construyeran.\n\nLa Guja Runica debiera ser daño tipo proc, como el Liche, pero el daño en el objetivo primario estaba categorizado incorrectamente, por lo que estaba activando efectos proc. Este es el bug al que me referia, y ya esta deshabilitado en el PBE.\n\nGracias por tu pregunta!","replies":[]}]},{"poster":"ByFrag","date":"2015-07-06T03:55:17.602+0000","up_votes":1,"down_votes":0,"body":"-3 Maquinola,Reportado,Despedite de tu cuenta lince de las praderas riotianas {{item:3151}} ","replies":[]}]},{"poster":"alop55555","date":"2015-07-04T19:50:19.566+0000","up_votes":1,"down_votes":0,"body":"una de las formas de evitar la q y la w de ezreal es parándose detrás de un minion pero si tienes smite borras el minion y la q y la w llegan directas haciendo harto daño","replies":[{"poster":"Matrox OpKarthus","date":"2015-07-05T15:16:19.687+0000","up_votes":2,"down_votes":0,"body":"la W pasa a a traves de los minions....","replies":[]}]},{"poster":"zPrydez","date":"2015-07-04T23:11:13.820+0000","up_votes":2,"down_votes":0,"body":"AP Ez tiene su powerspike después de su segundo ítem y su Q solo te servia para aplicar lich bane y nada mas (el ap ratio es bastante bajo), en cambio con Smite podes comprar Runeglaive con Skirmisher Sabre lo cual le da un poco de AOE a tu Q, cuesta muchísimo menos que LB (ayudando a tener tu powerspike despues de comprarla) y de paso el skirmisher te da una ventaja cuando laneas contra un asesino. Lo mas importante es que que ahora tu Q aplica on-spell (Rylais , WOTA, Y LUDEN'S ECHO) mejorando mucho todo lo que ap ez aporta. Ah y nunca hay que quejarse de mana y CDR en ap Ez!.","replies":[]},{"poster":"n1zAkK","date":"2015-07-04T17:54:15.654+0000","up_votes":1,"down_votes":0,"body":"Porque ahora Ezreal con el nuevo item que regenera mana y ademas hace un daño en area cuando tira Q , W. Spamea mucho y si llegas a late (y te terminas la build) es imposible perder a caso que no tengas manos para tirar los skills.\n\nPodes buscar las 2 partida donde \"Pepinero\" el MID de GIANTS en la LCS EU lo usa. Y gracias a el, el ultimo juego lo ganaron vs SKG (creo*) iban perdiendo y fue GG gracias a el y {{champion:6}} \n\n[Youtube](http://www.youtube.com/n1zAkK) - [Twitter](http://www.twitter.com/n1zAkK)  <3","replies":[{"poster":"LagunaStein","date":"2015-07-04T18:02:55.843+0000","up_votes":1,"down_votes":0,"body":"pepinero es el único bueno de su equipo y las partidas que pierden es por culpa de los demás me da penita jajaja , ademas la tiene dificil en contra de fnatic , h2k y origen . pero ganaron gracias a que el es muy bueno y no gracias a ez.","replies":[{"poster":"n1zAkK","date":"2015-07-04T18:23:39.576+0000","up_votes":1,"down_votes":1,"body":"Obviamente, nunca dije que Pepinero fuera malo, pero si hubiese hecho otro pick les habria costado muchisimo ganar y hasta perder. \n\nNo se si vos viste la partida, pero el que marco la diferencia fue Ezreal con el daño, el spam y el buen posicionamiento de Pepinero. Al igual que el top de GIANTS no se quedo atras jugo de 10, para la ventaja que tenia SKG (creo que eran esos)","replies":[{"poster":"OG Noah do Bree","date":"2015-07-06T20:53:34.563+0000","up_votes":1,"down_votes":0,"body":"Y no solo contra SK, contra Fnatic peppinero se cargo el equipo al hombro y si hubo partida equilibrada era porque el se comia solo al otro equipo, fue ridiculo que con dos habilidades se encargara de borrar a medio Fnatic","replies":[]}]}]}]},{"poster":"iFailTheSkill","date":"2015-07-06T00:42:45.930+0000","up_votes":1,"down_votes":0,"body":"Es un meta que de momento funciona nada mas con {{champion:81}}\nMirate la LCS para saber que sirve o que rinde o que metas usan, como {{champion:102}}  TOP {{summoner:12}} {{summoner:11}}  O {{champion:120}}  TOP {{summoner:12}} {{summoner:14}} o algunos mas comunes como {{champion:79}}  Jungla o {{champion:111}} o {{champion:85}} Support.\n\nEs gusto de cada uno usar eso, pero tampoco tirarle la partida a tu equipo como algunos hacen :/\n\nSaludos! {{summoner:31}} ","replies":[]},{"poster":"mew under track","date":"2015-07-05T13:41:26.004+0000","up_votes":1,"down_votes":0,"body":"Porque esta roto","replies":[]},{"poster":"mauro71404","date":"2015-07-05T02:59:33.559+0000","up_votes":1,"down_votes":0,"body":"Chicos, chicos, sus explicaciones son muy buenas.. pero.. ¿un poco complicadas de explicar? solo estoy tratando de decir que si esta persona no sabe porque le toca ezreal con castigo es porque no mira la lcs y no sabe lo que esta de moda o op y miles de cosas mas, osea, no está entendiendo nada de lo que le dicen.","replies":[]},{"poster":"potato support","date":"2015-07-04T23:14:04.509+0000","up_votes":1,"down_votes":0,"body":"ap ez mid runeglaive con trailblazer ahora tiene mejor waveclear, tiene un powerspike mas rapido, con solo runeglaive, sorc boots y un deathcap/luden hace danio ridiculo.\n\nla pasiva de runeglaive y trailblazer te da mucho mas sutain (ap ez tiene sustain choto)\n\ntambien deja lugar a que el top use otro tipo de summoner y podes asegurar objetivos como baron/dragon/buffs.","replies":[]},{"poster":"Straw Hat Zoe","date":"2015-07-04T22:07:15.980+0000","up_votes":1,"down_votes":0,"body":"Asi es por Pepi de Giants\nAca te dejo las runas , maestrias y la orden de build q uso \nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/TRLH3/1001220070?gameHash=0e14cb721685588d&tab=builds&participant=8","replies":[]},{"poster":"Ketil","date":"2015-07-04T19:55:00.599+0000","up_votes":1,"down_votes":0,"body":"El nuevo item de jg, le da daño magico en area haciendo que su Q, tambien se  algo como ap, lo cual trasforma a ez practicamente en un champ. ap. La regeneracion de mana es buena pero nada del otro mundo. a todo esto sumale que  podes tener daño verdadero por 4 seg. gracias al smite, doble smite para asegurar objetivos. y un daño insano en late, obvio en el early no tenes nada de daño.","replies":[]},{"poster":"Tronald Dumb","date":"2015-07-04T18:28:34.423+0000","up_votes":1,"down_votes":0,"body":"Con el item de jg nuevo, mas allá de que pegue o no pegue más, la q ahora si funciona con el ludens echo, asi que es casi la misma razón de por qué se juega kog mid, por el ludens ! tiras q y sale ludens, es op","replies":[]},{"poster":"RNGesus","date":"2015-07-04T18:19:00.937+0000","up_votes":1,"down_votes":0,"body":"Por que es muy bueno el item.","replies":[]},{"poster":"Nyán","date":"2015-07-04T18:00:01.376+0000","up_votes":1,"down_votes":0,"body":"Runeglaive.","replies":[]},{"poster":"Texter Redrum","date":"2015-07-04T17:31:54.169+0000","up_votes":1,"down_votes":0,"body":"Debe ser por el nuevo item de jungla que te regenera maná y hace daño en area :v","replies":[]},{"poster":"4hsy","date":"2015-07-04T17:28:43.460+0000","up_votes":1,"down_votes":0,"body":"Es una moda con el ultimo cambio al encantamiendo de ap del machete se usa ez mid debido a que el dot del encantamiendo del machete tiene buena sinergia con la Q de ezreal lo que le permite un buen daño en area con su Q mas que nada,\ny no solo es ezreal nasus ap con ese item tambien se esta viendo bastante en el meta y elos altos.\n\nSalu2\n{{champion:20}} {{summoner:11}}","replies":[]},{"poster":"Sir Crucifix ","date":"2015-07-05T00:46:01.171+0000","up_votes":1,"down_votes":3,"body":"es que creen que usando lo roto van a conseguir borrarse el bronce de su piel , esta bien , vos podes ser oportunista platino V , oro 2 , pero ... \n\nhabilidad e inteligencia se aprende usando los peores personajes :)","replies":[]}]}