{"poster":"Enuknia","date":"2018-10-07T08:25:18.420+0000","title":"please let me turn off skins","subforum":"Gameplay","up_votes":5,"down_votes":4,"body":"I can't tell some of them apart... Enough said. \r\n\r\n i mean it lets us turn off those annoying event minion reskins why not let me turn everything to default.. So much easier to climb that way imho","replies":[{"poster":"Sukishoo","date":"2018-10-12T19:52:25.337+0000","up_votes":3,"down_votes":0,"body":"Turning off skins for Champions, isn't quite the same as the minions and map assets. So that'd be far more difficult for them to do actually.","replies":[{"poster":"LeftyRaydy","date":"2018-10-12T22:13:31.029+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sukishoo,realm=NA,application-id=3ErqAdtq,discussion-id=EMAvoKYf,comment-id=0002,timestamp=2018-10-12T19:52:25.337+0000)\n>\n> Turning off skins for Champions, isn&#x27;t quite the same as the minions and map assets. So that&#x27;d be far more difficult for them to do actually.\n\nI do not believe it would be. To have your character look different on your screen or to have their character be default on your would not change anything. it is exactly like map extras, because the hitbox, abilities, and everything else on the champion are the same from the default to the regular skin. If you remove the added effects blam done no problem.","replies":[]}]},{"poster":"zoliking","date":"2018-10-07T08:53:53.907+0000","up_votes":1,"down_votes":1,"body":"Come on, they make a living from selling skins. Which would lose 90% of their value if they didn't show up consistently.","replies":[{"poster":"Enuknia","date":"2018-10-11T22:54:56.850+0000","up_votes":2,"down_votes":2,"body":"It would show up EVERY time for people who actually want the skins... It's so easy to just add the option. as i said they already do let you turn off te gimmicky shit on minions . WHY? Because it obviously fucks with people. Certain Syndra skins for me for example are a nightmare.","replies":[{"poster":"zoliking","date":"2018-10-11T23:53:29.421+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Enuknia,realm=NA,application-id=3ErqAdtq,discussion-id=EMAvoKYf,comment-id=00000000,timestamp=2018-10-11T22:54:56.850+0000)\n>\n> It would show up EVERY time for people who actually want the skins... It&#x27;s so easy to just add the option. as i said they already do let you turn off te gimmicky shit on minions . WHY? Because it obviously fucks with people. Certain Syndra skins for me for example are a nightmare.\n\nI don't know about you, but when I equip a skin, it's partly so I can see it and partly to show it off. I have a few skins and a significant part of their value is that when I use them, others can see. I think most people who buy skins feel the same way too and skin sales would drop by a lot if we couldn't be sure that when we equip one people in the game will see it.","replies":[{"poster":"Enuknia","date":"2018-10-12T19:38:07.199+0000","up_votes":2,"down_votes":1,"body":"You must be some kind of a-hole to WANT to show someone something that they feel gives you an advantage. Also they DON\"T want to see your skin.. Besides I doubt alot of people will actually want to turn them off. So I doubt you'll even run into  1/100 games where no one has the feature on. because imho most people enjoy skins. It just really bugs me... Especially the syndra and zyra examples. Those sprout/seed reskins are a pain in the ass to adjust to. \nEspecially that bullshit tombstone one.. like wtf is that, doesn't look ANYTHING like the others","replies":[{"poster":"zoliking","date":"2018-10-12T21:23:54.982+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Enuknia,realm=NA,application-id=3ErqAdtq,discussion-id=EMAvoKYf,comment-id=0000000000000000,timestamp=2018-10-12T19:38:07.199+0000)\n>\n> You must be some kind of a-hole to WANT to show someone something that they feel gives you an advantage.\n\nNo, just a regular guy happy to show off the shiny baubles I get. In this case skins. And you feeling they give me an advantage won't make it so.\n\n> Also they DON&quot;T want to see your skin..\n\nOkay.\n\n> Besides I doubt alot of people will actually want to turn them off. So I doubt you&#x27;ll even run into  1/100 games where no one has the feature on. because imho most people enjoy skins.\n\nThat's a great argument for Riot to implement a feature.\n\n> It just really bugs me... Especially the syndra and zyra examples. Those sprout/seed reskins are a pain in the ass to adjust to. \n> Especially that bullshit tombstone one.. like wtf is that, doesn&#x27;t look ANYTHING like the others\n\n:( I'm sure you'll get used to it over time.","replies":[]}]}]}]}]},{"poster":"yeulx","date":"2018-10-07T14:02:08.998+0000","up_votes":1,"down_votes":0,"body":"Imo the skins doesnt effect ones ability to climb  its your skill level,   there are some skins that make it harder like the Iblitz skin.. particles.. but theres not alot of those skins around and let alone theres not alot of people who use those, Be happy riot doesnt give us the harrowing rift or the winters rift in ranked","replies":[{"poster":"LeftyRaydy","date":"2018-10-12T22:15:38.662+0000","up_votes":1,"down_votes":0,"body":"google LOL skins that give a buff and they are a very slight buff in most cases, but one was pretty OP (frostfire annie) before she got the 4 stack bar because you couldn't see her stun was ready.\n\nEdit: this is also why some skins are not allowed in tournaments.","replies":[]},{"poster":"Tr4shB4NSYST3M","date":"2018-10-12T19:45:02.577+0000","up_votes":1,"down_votes":0,"body":"Steel legion lux is another example, her Q particle animation is TINY but the hitbox is more like the size of a no-skin lux Q, this is deceptive.\n\nSimilar story w/ the new Odyssey yasuo skin's Q,  skins like that w/ animations that do not match the hitbox are frustrating to me and appear to be a pay to win mechanic at least to a small extent,","replies":[]}]},{"poster":"LeftyRaydy","date":"2018-10-12T22:10:29.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Enuknia,realm=NA,application-id=3ErqAdtq,discussion-id=EMAvoKYf,comment-id=,timestamp=2018-10-07T08:25:18.420+0000)\n>\n> I can&amp;#039;t tell some of them apart... Enough said. \n> \n>  i mean it lets us turn off those annoying event minion reskins why not let me turn everything to default.. So much easier to climb that way imho\n\nI agree there are some really annoying skins such as that one Xerath one who has a ear cringing AA sound and it drives me nuts. I upvoted all your stuff, because someone just wants to seem to downvote you.","replies":[]}]}