{"poster":"SN4CKT4STIC","date":"2016-05-28T16:55:47.758+0000","title":"RIOT! Ändert BITTE das Surrender- Voting!!!","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":7,"body":"Platin III Ranked, SoloQ gematchmaked mit 4x Premades. \r\nMinute 20 surrendern die Premades direkt. Es stand 19 - 25 Drakes 2 - 0.\r\nEs gab keinen Grund zum Aufgeben das Spiel w&auml;re zu locker 80% gewonnen gewesen.\r\nEs ist vollkommend frustrierend mit solchen ,sry f&uuml;r meine wortwahl, &quot;Idioten&quot; gematchmaked zu werden, die einfach aufgeben. Es gibt nichts frustrierenderes als wenn man wei&szlig;, dass das Spiel ein Sieg ist und man &uuml;berstimmt wird. Das ist mir schon so oft passiert.\r\nIch muss sagen es gibt in lol mittlerweile nicht mehr viele frustrierende Dinge, aber dieses Aufgeben-System ist ganz sicher Nummer 1. \r\nIch habe es schon immer gehasst aufzugeben, vorallem weil ein spiel nur ganz selten wirklich zu 100% verloren ist.\r\n\r\nBitte Riot, von mir aus lasst die dynamic-queue, aber f&uuml;hrt ein, dass wenn der solospieler nicht aufgeben m&ouml;chte er nicht &uuml;berstimmt werden kann.\r\nIch wei&szlig; nicht, macht einen check-filter, dass die Leute schon w&auml;hrend dem Spiel gewertet werden, und wenn der eine Spieler, der nicht aufgeben m&ouml;chte bei einem A oder S liegt und carrien kann nicht &uuml;berstimmt werden kann wenn er weiterspielen m&ouml;chte.\r\nJeder, wirklich Jeder kennt diese Spiele in denen man aufgeben m&ouml;chte, es weitergespielt wird und man schlie&szlig;lich noch gewinnt.\r\n\r\nBitte diesen Thread upvoten, vielleicht k&uuml;mmert sich dann ja jemand drum.","replies":[{"poster":"agumbale","date":"2016-05-28T17:42:21.394+0000","up_votes":3,"down_votes":0,"body":"Sowas passiert die vielleicht einmal von 1000 Games...","replies":[]},{"poster":"JannaTheSecond","date":"2016-05-28T18:04:35.998+0000","up_votes":2,"down_votes":0,"body":"Das System ist gut, nur einpaar Spieler haben nicht alle Tassen im Schrank. Schade, dass es so viele Trolls in einem Kompetitiven Spiel wie League of Legends, aber manchmal hat man Pech. {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"OrangeBubble","date":"2016-05-30T19:19:09.896+0000","up_votes":1,"down_votes":0,"body":"Vielleicht wollten sie nach Bronze kommen und nutzen so einen legalen Weg?","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-05-29T09:37:15.150+0000","up_votes":1,"down_votes":0,"body":"Demokratie mein Freund. Irgendwer kommt immer zu kurz, aber die Mehrheit ist glücklich.","replies":[]},{"poster":"Wernicke","date":"2016-05-28T17:52:48.030+0000","up_votes":1,"down_votes":0,"body":"> Bitte diesen Thread upvoten, vielleicht kümmert sich dann ja jemand drum.\n\nWer?\nWir forenuser? ^^\nAnsonsten wirst du hier niemanden antreffen ^^","replies":[]},{"poster":"Shiggyvara","date":"2016-05-28T17:52:00.798+0000","up_votes":1,"down_votes":0,"body":"4 Spieler wollen nicht mehr spielen und du wirst kein 1 vs 5 gewinnen.\nNimmst du ihnen die Möglichkeit zu surrendern werden halt zu viert die Dschungelcamps gemacht das Ergebnis ist das Gleiche außer, dass das Spiel vielleicht noch 5 Minuten länger geht.","replies":[]},{"poster":"Numerus","date":"2016-05-28T17:24:05.348+0000","up_votes":1,"down_votes":0,"body":"Ich bin zufrieden mit dem System!","replies":[]}]}