{"poster":"Keic0","date":"2019-09-19T06:15:42.275+0000","title":"Sobre el equipo de balance del juego (es una OPINION/IDEA)","subforum":"Charlas Generales","up_votes":6,"down_votes":0,"body":"No seria mejor volver a trabajar en la forma en que lo hacian en las seasons 3/4/5?\r\nPorque cambiaron y dieron un cambio de 180 grados?\r\nExplico, durante esos años (Creo que Morello trabajaba o era jefe del equipo de balance) se solian hacer 3 buffs a campeones solamente y el resto eran nerfs (Entre 7 y 11 nerfs cada parche).\r\nAhora, si vemos como es actualmente podemos ver que hace ya varios parches se buffean muchos campeones y se nerfean menos. \r\nYo personalmente creo que el problema de esta season es la cantidad de daño que hay en el juego. \r\nSiendo un campeon no tank, te burstean en 0,5 segundos y si te tankeas cuanto mas podes durar? 2 segundos?\r\nSi buffean mucho a los tanks el juego vuelve a las aburridas seasons 5, 6 y 7. Donde eran todos tanks o hipercarrys y el supp era lulu o janna.\r\nSi dejan como estan a los tanks, el juego sigue igual.\r\nPero y si redujeran el daño en general y a todos los campeones equitativamente? No seria mas saludable para el juego? Con solo quitar un poco de todo el daño del juego que hay actualmente creo que mejoraria muchisimo.\r\nLo que mas extraño de todo, es la capacidad de outplayear realmente, no como es ahora. Antes tenias que realmente outplayear a tu rival porque al todos tener menos daño, no explotaban por los aires todos los campeones. Ahora el que primero ataca es el que generalmente mata.","replies":[{"poster":"SpectreChazer","date":"2019-09-19T06:33:56.380+0000","up_votes":1,"down_votes":0,"body":"También un problema que hay es que cualquier cosa mete Daño Verdadero, antes había poco daño verdadero. Pero hoy en dia te fijas en la gráfica de el daño que te mete Yi o Vayne por ej. y ves que te metieron 2k de daño verdadero en 3 seg.","replies":[{"poster":"Keic0","date":"2019-09-19T07:11:53.316+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SpectreChazer,realm=LAS,application-id=v7qsfXsE,discussion-id=1lmKcTBA,comment-id=0000,timestamp=2019-09-19T06:33:56.380+0000)\n>\n> También un problema que hay es que cualquier cosa mete Daño Verdadero, antes había poco daño verdadero. Pero hoy en dia te fijas en la gráfica de el daño que te mete Yi o Vayne por ej. y ves que te metieron 2k de daño verdadero en 3 seg.\n\nDios por que me haces acordar de eso man no quiero ni pensar en eso ajajajja\n\nEs que con conqueror literalmente todos los campeones podrian hacer daño verdadero (Obviamente seria contraproducente para muchos). Yo creo que dentro de todo, lo que safa son las ejecuciones, el resto en cuanto a daño verdadero deberian sacar todo o casi todo.\nEl de camille, el del conqueror, etc etc (el unico que dejaria es el de vayne, no porque la use sino porque siempre estuvo y nunca genero mucho problema)","replies":[]}]},{"poster":"Mona","date":"2019-09-19T14:56:10.543+0000","up_votes":1,"down_votes":0,"body":"No se de que hablas, si esta temporada no están buffeando nada. De hecho los últimos parches no hicieron ningún cambio por Worlds, exceptuando buffs a campeones que quieren ver en Worlds","replies":[{"poster":"Keic0","date":"2019-09-19T15:50:07.940+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gremp,realm=LAS,application-id=v7qsfXsE,discussion-id=1lmKcTBA,comment-id=0004,timestamp=2019-09-19T14:56:10.543+0000)\n>\n> No se de que hablas, si esta temporada no están buffeando nada. De hecho los últimos parches no hicieron ningún cambio por Worlds, exceptuando buffs a campeones que quieren ver en Worlds\n\nEfectivamente, no sabes del tema que hablo.\nParche 9.19: 6 nerfs/ 18 buffs (Si, el triple)\nParche 9.18: 5 nerfs/ 11 buffs (Uno mas que el doble)\nParche 9.17: 1 nerf/ 9 buffs (a neeko le hicieron un cambio que mejora su jugabilidad pero no lo voy a contar como buff) (9 veces mas buffs que nerfs)\nParche 9.16: 9 nerfs/ 13 buffs\nParche 9.15: 3 nerfs/ 16 buffs\n\nClaramente voy a dejar de buscar parche por parche porque me da paja buscar uno por uno solo para demostrar que tengo razon y vos no, es una discucion que no me interesa ganar, pero podes pensar lo que vos quieras, los datos e informacion respaldan lo que yo digo.","replies":[{"poster":"Mona","date":"2019-09-19T17:10:59.158+0000","up_votes":1,"down_votes":0,"body":"Este es Bardo {{champion:432}} , quizás lo conoces porque lo ves 3 veces por año.\n[Esta es la lista de cambios de Bardo.](https://leagueoflegends.fandom.com/wiki/Bard/History) Si te fijas, el tipo solo recibió buffs a lo largo de su historia, sin embargo lo seguís viendo 3 veces por año y el campeón no sirve para nada.\n\nDe que te sirve contar buffs y nerfs si no te dedicas a ver el impacto que tienen y lo que significan? Desde hace varios parches que ninguno de esos cambios son relevantes por lo que te dije, el meta se tiene que mantener igual para Worlds y los campeones que reciben cambios son los que Riot quiere incentivar que los equipos pickeen {{champion:64}}  es el mejor ejemplo.\n\nFijate que tan poco significativos son la mayoría de buffs que mandan por parche que los campeones que entran y salen del meta no lo hacen porque tienen a sus counters buffeados, si no que simplemente los nerfean y por consiguiente aparece otro \"menos malo\" {{champion:268}}  y {{champion:42}}  son el mejor ejemplo este año (a pesar de que el primero recibió algunos cambios), que no entraron al meta porque \"los buffearon un montón\", sino porque los campeones que impedian que se jueguen {{champion:84}} y {{champion:517}} son buenos ejemplos, fueron nerfeados hasta el piso en competitivo.\n\nAdemás de que no son unicamente los cambios a los campeones los que hacen que sean mas meta o no. Despúes de los cambios al cangrejo (los del año pasado) empezaron a surgir un montón de campeones que antes no se veian como {{champion:5}}  y otros como {{champion:60}}  desaparecieron sin haber recibido ningún cambio.\nEste año mágicamente {{champion:60}}  y {{champion:113}} vuelven a aparecer. No cuando recibieron cambios, sino cuando el resto del juego les dio un espacio (AKA: scuttle al 3:15).\n\nEntonces en lugar de hablarme desde un punto de superioridad, sumando buffs y nerfs como si significara algo, agarrá y para que tu punto valga de algo, fijate cada campeón que cambiaron durante esos parches que no entren dentro del espectro de \"los buffeamos para Worlds\" y fijate como cambió su pickrate a lo largo de los parches que nombraste. Ahí te vas a quedar con los cambios que realmente significan algo y los que no y en lugar de decir \"cuantos buffs y nerfs hicieron\", vas a hablar de \"cuantos campeones entran y salen del meta\" que es lo que es verdaderamente importante, porque sino {{champion:432}} es el campeon mas fuerte del juego.","replies":[]}]}]},{"poster":"Neeko","date":"2019-09-19T16:15:51.060+0000","up_votes":1,"down_votes":0,"body":"Cuando dieron a luz a ZOE dije \"se fue a la v.. el meta\"\n\nAhora es: un cc y te moris porque te oneshotean","replies":[]},{"poster":"Zelos From Jonia","date":"2019-09-19T13:55:08.454+0000","up_votes":1,"down_votes":0,"body":"Siempre lo dije, los metas se enfocan demaciado en el daño y muy poco en tu propia viveza.\n\nEs tan asi, que pickeas un counter y tenes una linea ganada sin siquiera saber por que es counter, te pickeas un draven y con limpiar tenes de hija a ashe aunque sea la mejor ashe de las. Es muy muy dependiente de quien hace el daño y la cantidad absurda de daño. Tanto que a campeones tanks los derriten champs que no deberian tener forma siquiera de herirlos, o en otro paso estan tan duros que no les haces daño XD es ilogico.\n\nLo de kayle, que es una torreta que se hace invulnerable, ¿que clase de mecancia es esa? es un kog que ademas no se muere XDDDDDDDD\n\nEl balance de riot esta enfocado en lo atractivo, si buscas la \"estrategia\" cada vez se aleja mas de pensar y se hacerca mas a \"apretar mas teclas para ganar\"","replies":[]},{"poster":"The Blood Lord","date":"2019-09-19T13:04:03.364+0000","up_votes":1,"down_votes":0,"body":"Yo creo que es un tema del meta, y los gustos son depende el jugado, por ejemplo cuando estaba fuerte el pebetero, yo que en ese entonces jugaba soporte pero no de sustain, y no jugaba adc ME DABA CANCER JUGAR, pero era por el meta, riot es quien decide que las guias de la meta, con sus buff/nerfs. A uno solo le queda adaptarse o no jugar, pero no me parece mal, la variedad es lo que hace que este juego haya sobrevivido 10 años.\nSi este meta no es para vos (yo tampoco juego asesino, pero juego vlad, asi que me rio xd) simplemente no te comas la cabeza, juga otra juego, ya no falta mucho para el mundial y el fin de la season.","replies":[]}]}