{"poster":"HeavenlyMind","date":"2014-11-06T22:59:38.849+0000","title":"PATCH 4.19 ISSUES -- ALT TAB IS NOT THE PROBLEM","subforum":"Report a Bug","up_votes":3,"down_votes":1,"body":"Since the patch many have had this \"alt tab\" issue, and because that is what riot has said the issue is many think you don't hit alt tab, then you're okay. The problem with this news feed of \"alt tab\" being the issue is that many people believe that if their game does not load and they did not hit \"alt tab\", then it's another issue and simply will not attempt to reconnect. I will point out that since the patch I have had to task manager force quit LoL EVERY single game since the patch, and sometimes multiple times just to reconnect. I will add that I NEVER hit alt tab. I understand some people alt tab to turn on music or whatever but I'm just looking to play the game. My computer/net are beyond handling LoL so not the issue. First, I would suggest that the wording on the news feed be updated to something more general with quick bug solution fixes as I have already mentioned. This will help keep thousands of people from losing/leaver games for no reason other than a faulty patch. Second, Fiddlesticks needs a new skin.\n\n******************UPDATE********************\nSeveral hours after posting this I suddenly no longer have the problem and neither do my teammates or enemy team. I am guessing that it is fixed now. If there are some that still have errors please post.","replies":[{"poster":"Rinky Dinky","date":"2014-11-07T01:21:02.522+0000","up_votes":1,"down_votes":1,"body":"You dont have to exit the game every time, just wait 2-3 minutes.\n\nThe game has always loaded up for me, even if the loading screen has crashed.\n\nThe game will just randomly start","replies":[{"poster":"HeavenlyMind","date":"2014-11-07T02:43:45.209+0000","up_votes":2,"down_votes":0,"body":"I have waited it out 3 times for up to 10 minutes, and it did not load. That may work for some people but in most cases seems incorrect.","replies":[]}]},{"poster":"HeavenlyMind","date":"2014-11-07T02:46:23.578+0000","up_votes":1,"down_votes":0,"body":"Thanks for the comments everyone. Let's keep them going and see if Riot will use some of this information to fix the issue. If they still believe it's an alt tab issue then it will never get fixed.","replies":[]},{"poster":"Pıglet","date":"2014-11-06T23:12:08.842+0000","up_votes":1,"down_votes":0,"body":"I couldn't even force close the patcher when i was unable to rejoin a game that crashed for some odd reason.","replies":[{"poster":"HeavenlyMind","date":"2014-11-07T02:45:30.166+0000","up_votes":1,"down_votes":0,"body":"I had force close issues with some of the games, but not most. Another extended issue of the patch.","replies":[]}]},{"poster":"Jenvas","date":"2014-11-06T23:27:15.533+0000","up_votes":1,"down_votes":0,"body":"I have a setup with two screens and my loading screen gets stuck everytime","replies":[{"poster":"HeavenlyMind","date":"2014-11-07T02:45:04.036+0000","up_votes":1,"down_votes":0,"body":"I only have one screen so it can't be monitor related.","replies":[]}]},{"poster":"annador3","date":"2014-11-06T23:29:23.372+0000","up_votes":1,"down_votes":0,"body":"One thing that I have noticed when this happens (only had one game post patch that has actually loaded the first time), it always seems to happen when there is at least one person on the loading screen not connected yet. Not sure if that's relevant to anything, but it's kinda irksome when you're trying to figure out who you're facing, and instead get frozen at whatever random percent loaded.","replies":[{"poster":"HeavenlyMind","date":"2014-11-07T02:44:42.276+0000","up_votes":1,"down_votes":0,"body":"This is a good point. Someone in one of my games said the same thing, and I'm not sure if it's a snowball DC or not.","replies":[]}]},{"poster":"juugs","date":"2014-11-07T00:42:18.256+0000","up_votes":1,"down_votes":0,"body":"so far im at 3000 files scanned....","replies":[]},{"poster":"MontiR","date":"2014-11-06T23:48:42.054+0000","up_votes":1,"down_votes":0,"body":"I was disconnected while trying to load during a provisional and now it is scanning files and stuck on 33%","replies":[]},{"poster":"WinterMage42","date":"2014-11-06T23:40:35.669+0000","up_votes":1,"down_votes":0,"body":"I've had one time the game didnt crash on me. Riot needs to get their shit together. Now my patcher is stuck at scanning files, and refuses to work. 4.19 broke League worse than the release of Teemo.","replies":[]}]}