{"poster":"themagicanboy","date":"2015-12-05T17:49:15.227+0000","title":"laggs und reconnect nicht möglich","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"hi \r\nalso seit heute funktioniert lol nicht mehr normal bei mir anfangs ist alles gut ich komme gut in die championsauswahl und dann in den ladebildschirm aber ab dann geht alles schief ich komme ins spiel und habe 500ms die ganze zeit.\r\nhabe vieles schon probiert sogar lol neu installiert!\r\nalle anderen programme die &uuml;bers internet laufen, laufen gut nur lol nicht \r\nich spiele mit lan-kabel falls das ne n&ouml;tige info ist^^ \r\ndanke schon mal f&uuml;r die antworten \r\n\r\nthemagician","replies":[{"poster":"legofreak1","date":"2015-12-05T20:47:24.823+0000","up_votes":1,"down_votes":0,"body":"Kannst du bitte, wenn du im Spiel bist, Pingplotter laufen lassen?\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> 1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n> 3. trace starten\n> 4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten oder das Programm besser noch komplett während eines Spiels im Hintergrund laufen lassen.\n> Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts vermutlich nutzlos.\n> 5. Sollten Verbindungsprobleme aufgetreten sein, müssen die Ergebnisse exportiert werden:\n> Edit > Copy as Text\n> Nach [Pastebin.com](http://pastebin.com/) gehen, das Ergebnis dort einfügen, auf \"submit\" klicken und den Link zum Ergebnis im Forum posten.","replies":[]}]}