{"poster":"Flay and Prey","date":"2017-06-17T03:44:50.269+0000","title":"Refunding my Nightbringer Yasuo Icon and border","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":1,"body":"I purchased the nightbringer Yasuo Icon And Border by purchasing 2,     140 chaos tokens with RP. What I didn't know was that the border only worked IF I had the particular skin. I do not have anymore refunds on my account, and I request that I get a refund for both these purchases as they aren't what I thought they were. I would really appreciate it if I could, thank you.","replies":[{"poster":"Renekton ˆºˆ","date":"2017-06-17T03:52:28.654+0000","up_votes":3,"down_votes":1,"body":"I have the same problem, I purchased the riven Icon and border and I did not know that you would ONLY get the border if you had a certain skin equipped along side the icon. This is not fair, as nowhere does it mention this is required. All it says is Icon and Border. On top of that, even though I have refunds the item is non-refundable, which is also not fair. I also request that I get a refund for this icon as I spent 5 dollars on it. Thank you.","replies":[]},{"poster":"Luciéd","date":"2017-06-29T19:59:43.746+0000","up_votes":1,"down_votes":0,"body":"Hey, I read then I buy \"Chaos Icon and border\" so I thought I would get a border. I only got this token for 280 chaos essence. I really don't want that. I thought I would get something more like it looked on the website \"http://na.leagueoflegends.com/en/featured/events/vs-2017\". But I it looks like you need the skin that I will not get. I doesn't say anything about needing a the skin for that. I feel tricked and would like a refound please <3","replies":[]},{"poster":"Obliviatus","date":"2017-06-28T19:54:43.363+0000","up_votes":1,"down_votes":0,"body":"Exactly the same problem here. Spent my Chaos Tokens only to realize it wasn't explicit (at all) that the border would only appear for Nightbringer Yasuo, which I do not own nor intend to now or ever.\n\nI want a bloody refund!","replies":[]},{"poster":"ChrisCoroner","date":"2017-06-25T06:24:10.371+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Superabhipandu,realm=NA,application-id=osqw6G4M,discussion-id=m18UZUZg,comment-id=,timestamp=2017-06-17T03:44:50.269+0000)\n>\n> I purchased the nightbringer Yasuo Icon And Border by purchasing 2,     140 chaos tokens with RP. What I didn&amp;#039;t know was that the border only worked IF I had the particular skin. I do not have anymore refunds on my account, and I request that I get a refund for both these purchases as they aren&amp;#039;t what I thought they were. I would really appreciate it if I could, thank you.\n\n\n\nyep.. this is completely fucked.. a dog act.. a lie.. chaos orb for 140 is way better value.. scammers.. should fix this RIOT","replies":[]},{"poster":"Broporo","date":"2017-06-17T03:55:46.408+0000","up_votes":1,"down_votes":0,"body":"We can't really process refunds here on the boards so there's not a whole lot I can do to help sadly. I'm not entirely sure how refunds will work for those tokens, but your best bet is to reach out to the billing team in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) to see what can be done!","replies":[{"poster":"SuckHerWee","date":"2017-06-21T21:22:11.554+0000","up_votes":1,"down_votes":0,"body":"I'd like to reach out to your billing team through a support ticket but I'm not sure which request type from the ones it gives you I should address it to?","replies":[{"poster":"Broporo","date":"2017-06-22T21:33:03.380+0000","up_votes":1,"down_votes":0,"body":"For any billing questions, you should probably pick the option \"I have a question about purchasing RP\" and that'll get you to the right people!","replies":[]}]}]},{"poster":"FirexSpin","date":"2017-06-21T19:41:45.444+0000","up_votes":1,"down_votes":1,"body":"Same problem.... Bought 140 chaos tokens for 295 RP.....\n\n{{champion:32}}","replies":[]},{"poster":"24509432DEL1","date":"2017-06-18T18:12:11.524+0000","up_votes":2,"down_votes":2,"body":"Same problem i checked evrywhere and it never sayd Yasuo only Border\neven on the event page it says Chaos Icon and border\nNot yasuo only border\n\nFalse advertising once again","replies":[]}]}