{"poster":"Blake78","date":"2015-03-07T18:14:51.420+0000","title":"Los Report","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":1,"body":"Como ya estuvimos viendo ultimamente los reports ya no hacen efecto,por ejemplo, si nosotros queriamos reportar a un troll o a un afk ya los reports ni contaban y todos se terminan riendo de los los mismos asi que por favor,, HAGAN QUE LOS REPORTS VUELVAN A SER LOS MISMOS DE ANTES PLS  YA ESTOY CANSADO DE QUE SE ME RIAN EN LA CARA DE LOS REPORTS QUIERO QUE HAGAN ALGO.\r\nGracias{{item:3151}}","replies":[{"poster":"hijo del potasio","date":"2015-03-09T20:29:59.107+0000","up_votes":1,"down_votes":0,"body":"hay que pasarse a otro server, uno de verdad, es preferible tener ping a tener que seguir jugando en este server, en el cual nada es respetado :D","replies":[]},{"poster":"Kuito","date":"2015-03-09T14:27:40.055+0000","up_votes":1,"down_votes":0,"body":"La unica forma de saber si banean seria que pongan los nombres de los baneados cuando hacen las oledas de baneo\nasi podemos ver los nombre y si vemos alguno que reportamos podemos estar seguros que los banean aunque sea que los meustren 1 vez","replies":[]},{"poster":"Jhin Freecss","date":"2015-03-07T18:59:12.808+0000","up_votes":1,"down_votes":0,"body":"Y tu como sabes que los reports no sirven? no te puedes haber dado cuenta y al jugador que reportaste ya lo pueden haber baneado","replies":[{"poster":"Blake78","date":"2015-03-07T20:22:38.436+0000","up_votes":1,"down_votes":0,"body":"MIS AMIGOS ME REPORTAN SIEMPRE POR Y NO ME BANEAN NUNCA","replies":[{"poster":"Anusbis","date":"2015-03-09T13:21:09.606+0000","up_votes":1,"down_votes":0,"body":"SI TE REPORTAN SIN TENER BUEN MOTIVO LOS REPORTES NO SIRVEN\nSI TE REPORTAN Y VOS FLAMEAS, INSULTAS, SI TE VAN A SANCIONAR","replies":[]}]}]},{"poster":"Anusbis","date":"2015-03-07T19:45:50.098+0000","up_votes":1,"down_votes":0,"body":"Perdon OP pero sos vos que no entiendes nada.\nLos reportes hacen algo. Mira el foro y las oleadas semanales de ban.\nIgual lee eso para saber como sirven tus reportes:\nhttp://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/fz81kh4i-todo-lo-que-un-sancionado-debe-saber-restriccian-de-chat-tribunal-afk-y-leavebuster","replies":[]}]}