{"poster":"Sh ee N n Kill a","date":"2015-05-28T19:45:56.367+0000","title":"WARUM DIE 7800 EP ????","subforum":"Champions & Gameplay","up_votes":1,"down_votes":11,"body":"hi leute,\r\nich wollte mal fragen wieso die neuen Champions immer 7800 Ep kosten und nicht gleich 6300. Ist riot so geil darauf dass wir Geld ausgeben ? Oder weshalb ist dass so.\r\nLg","replies":[{"poster":"Kaitri","date":"2015-05-28T20:33:36.145+0000","up_votes":1,"down_votes":0,"body":"diese aussage ist genauso sinnlos wie undurchdacht. was zur hölle haben ep/ip mit geld ausgeben zu tun?\nklar du kannst dir einen ip boost kaufen damit du mehr ip kriegst aber darauf kannst du doch unmöglich anspielen oder???\nund ja jede firma ist darauf aus das ihre kunden geld ausgeben, sonst könnten sie nicht überleben und müssten zumachen","replies":[{"poster":"Evenrider","date":"2015-05-28T20:36:34.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kaitri,realm=EUW,application-id=Wj1wcocU,discussion-id=HY8AErs4,comment-id=0001,timestamp=2015-05-28T20:33:36.145+0000)\n>\n> diese aussage ist genauso sinnlos wie undurchdacht. was zur hölle haben ep/ip mit geld ausgeben zu tun?\n> klar du kannst dir einen ip boost kaufen damit du mehr ip kriegst aber darauf kannst du doch unmöglich anspielen oder???\n> und ja jede firma ist darauf aus das ihre kunden geld ausgeben, sonst könnten sie nicht überleben und müssten zumachen\n\nIch hätte jetzt gedacht, er spielt darauf an, dass nur die IP kosten erhöht sind, um so zu erzeugen, dass die Leute statt 7800 IP und statt einer Woche zu warten eben die RP kosten zahlen (975?), da die genauso hoch sind, wie die eines 6300 Champions.","replies":[{"poster":"Sh ee N n Kill a","date":"2015-05-30T16:35:40.138+0000","up_votes":1,"down_votes":0,"body":"Hast recht so meinte ich es, danke :)","replies":[]},{"poster":"Kaitri","date":"2015-05-28T20:55:37.130+0000","up_votes":1,"down_votes":0,"body":"durch die ganzen möglichen arten wie man das betrachten kann ist es schwer zu sagen ohne ein statement des erstellers... aber du könntest damit auch recht haben","replies":[{"poster":"Gorantharon","date":"2015-05-29T09:14:27.483+0000","up_votes":1,"down_votes":0,"body":"Ne, das ist eigentlich ziemlich klar. \n\nUnd die Antwort an den TE ist: JA! Riot möchte Geld, aber es hat auch den kleinen Nebeneffekt, dass nicht alle gleich den neuen Helden kaufen, sodnern einige etwas warten.","replies":[]}]}]},{"poster":"Sh ee N n Kill a","date":"2015-05-30T16:34:46.612+0000","up_votes":1,"down_votes":0,"body":"Vielleicht liest du dir meine Frage nochmal durch ? :)\nIch frage einfach nur warum die neuen Champions 7800 EP kosten und nicht gleich 6300, da mir dass sinnlos erscheint, da diese Champions in der nächsten Woche eh wieder auf 6300 EP gesenkt werden.....","replies":[]}]},{"poster":"Evenrider","date":"2015-05-28T19:51:00.783+0000","up_votes":1,"down_votes":0,"body":"Freu dich doch.\nAnstatt das, könnten sie alle Champion 1 Woche später releasen. Also statt Heute erst nächste Woche Donnerstag. So kannst du ihn schon heute Spielen nur eben für 1,5k IP mehr.\nEs gibt genug Spieler die sich schon aufregen, dass man Skins nicht mit IP kaufen kann, weil sie alles andere besitzen und sich die IP ins 6-stellige steigern. Die haben dann auch die 7800 oder nicht? Und irgendwie muss man denen doch die Möglichkeit geben ihre IP loszuwerden :D","replies":[]}]}