{"poster":"FedAsFuk","date":"2015-01-30T00:37:19.379+0000","title":"DC/AFK RANKED Penalty","subforum":"[ARCHIVED] General Discussion","up_votes":2,"down_votes":2,"body":"Okay so this is a semi rant post but actually ranting to myself came up with an idea I would love to see implemented. Now we have all played RANKED games with someone who is constantly DCing/Rage quitting/AFK and it does nothing but ruin the game for everyone. Now this is not a \"If you ever DC you should be banned post\" because shit happens storms knock out power, internets just stop randomly, this is however fr the people who queue up MULTIPLE times with connection issues. I just played with a Darius who was DCing every 20 seconds or so....i Q up again and he is in my lobby, so I immediately dodge. Now what I am proposing is tentative and open to discussion/tweaks, but the concept is that if your internet is dropping and you DC and reconnect to a game more than 2x (so 1 time loading into game+ TWO DC+recconects) you are disabled from SOLO/DUO Q (if your ranked teams want to take the chance that is 100% up to them) for a week (this is where it is widely open to debate, the timing of the ban). Now it would do nothing to hurt your rank or anything at all it would simply be that for a week you would have to play normals to prevent the fairly constant DCing.\r\n\r\nNow why do I say this should happen? Is it because I'm salty I got demoted because of a DC? Yeah a bit but it also was a trend when I was moving up in ranks (last season) people would DC and reconnect 10-20 times a game, ontop of essentially playing 4v5 the constant \"A summoner has recoonected/disconnected\" announcer is enough to drive anyone insane.\r\n\r\nAlso I have a further idea for SCALING bans for people who just don't have internet to stay connected or rage quit all the time, it would be similar to the leaver buster program in that the final recourse would be a permanent (for the season) ban from ranked SOLO/DUO, I want to stress this, this system will only apply to soloQ not ranked teams.\r\n\r\nLet me know what you think of this idea, any tweaks you think may work as well as if you think I am a dumbass I want feedback because personally I would love for this system to be in place","replies":[]}