{"poster":"FedAsFuk","date":"2015-04-15T22:18:54.969+0000","title":"Explaining The Ranked System","subforum":"Gameplay","up_votes":2,"down_votes":9,"body":"Okay so I am back at this thing called the forums again. About me, I have 2 accounts currently in Gold, this one and another I am about to start placements for. I am a Riven one trick pony, for those of you who don&#039;t know what that is it means I am a person who plays almost exclusively RIven, with a very small champ pool outside of her, I play Riven in 4 roles with pretty good comfort and success (Top, Mid, Jungle and Support). I spend alot of my time on this account trying to climb as well as helping out IRl friends who are learning. Anyways onto the actual point, understanding this ranked system.\r\n\r\nNow I will start off with there are some issues, no system can be perfect, however as a whole, this system is very very fair and ACCURATE. Now you may ask &quot;Wait you are gold on 2 accounts but bronze here, how is that fair?&quot; the answer is because for whatever reason on this account I, me, MYSELF, play terribly, I make dumb choices I don&#039;t help team, lose lane sometimes, these games have all gathered themselves into one account. And that is FINE, I know eventually I will stop making decision errors, fix the few mechanical errors I have, most of those stem from bad choices anyways. Now for those of you who say &quot;It is close minded to judge someone by their rank&quot; this is true, especially as the season starts, I saw bronze kids from last season placed in gold and a plat placed in silver 5, however the season began in January/February, After 3 months people are at the elo they deserve, for the most part, does that mean you can&#039;t improve this season? No, absolutely not, just that as of now, you have earned your elo. And there is nothing wrong with that, Bronze honestly means, you need to improve your mechanics (probably play more Annie less Zed, simple mechanic champs&gt;hard champs that can be difficult to do the correct things on) and you also don&#039;t have much game knowledge, AND THAT IS FINE. Your job isn&#039;t League, if you lose 3 games in a day nobody at work will shun you. \r\n\r\nI got off topic again, the key point is that your elo is most likely very accurate of your skill (maybe a few divisions off), but let us take a look at what a rank really is, it is a word, designated by riot, to associate with a range of numbers that riot uses to determine your MMR (Match Making Rating), all rank is, at its core, is a word for a range of numbers. Now let us look at those range of numbers, the MMR of this account as pf 2:46 PM PST on April 15th, is 1,003 , the average MMR for my rank is 927, now the average MMR of s4 is 1,162. Okay so those number don&#039;t mean much without perspective, let us say today I go and play well, if I win 8 games in a row, my MMR will climb to about 1,100, so really if you are feeling down about your rank &quot;because your friends are higher&quot; all it means is they went on a winstreak (if CLOSE to same elo, obviously a plat friend is better than a silver friend). So who cares? I see it all the time on this account, I play with silvers mostly because of my MMR, so they use bronze as an insult, most of them are s5 0 LP, insulting bronze 1 in promos, they are legitamently win 3 of next 5 games and at same level you are, why is that an insult? Because we tie so much meaning to a word tied to a range of numbers, silver ranges from average 1000 MMR at Silverr V  to 1,392 average MMR at Silver I, now let us go back to my point of if I won 8 games in a row I would gain a little more or less than 100 MMR, so the ONLY difference between Silver V and Gold V or Bronze V and SIlver V is roughly *Drumroll* 35 wins. 8 wins = roughly 100 MMR, MMR gap for entire division is 1,000 to 1,392, so 4 sets of 8 wins and an additional 3 wins to be higher MMR than Silver I, meaning you are now on equal grounds as a Gold V player, according to Riots system. Now that we have your perspective adjusted we can begin discussing ranked calmly.\r\n\r\nSo do a set of numbers really define any of us as players? Yes they do, are those numbers unchangeable? No. Does riot give us the tools to improve? In my opinion they do not, without a replay system spotting mistakes is very difficult, which is what makes this community amazing, there is something missing, so instead of complaining and demanding Riot does as we want, we have made many programs to record games and store them on your PC, as well as a FREE service form OP.GG to record games you want by a simple click of a button while you load into game, personally I do it as I check enemy runes/masteries. Now in all honesty just watching your gameplay and looking for mistakes you can find will improve you, but as a community we do better than that still, there are THOUSANDS of extremely friendly people who ENJOY helping, myself included, most of my friends also coach a dozen or so lower elo players, I have a few diamond Riven players I discuss ideas with and mechanics and matchups and how they handle certain situations, all for free, simply look on the forums, or be friendly in game and you can these players. Another option is a youtube series done by unswlolsoc, is called &quot;LeagueCraft101&quot; , and here is the link https://www.youtube.com/playlist?list=PL9RdXhXESRJz4Z_mPEizexEeqXcTIylzN , will break down many many important concepts of the game and inform you of many you do not know about.\r\n\r\nSo now you are asking &quot;well this is all cool but how does this apply to my games?&quot; the answer is a bit difficult, it mostly applies through allowing you to adjust your attitude, putting less importance on games and more on overall skill, which leads you to winning more games. If you have any questions or want to discuss this further please feel free to add this account in game or comment below, I will try to answer everything quickly and to the best of my ability. Thank you all for reading this, best of luck summoners.","replies":[{"poster":"Shockwhite","date":"2015-04-15T22:23:33.790+0000","up_votes":9,"down_votes":0,"body":"\"I'm in gold\"\n\"I am a Riven one trick pony\"\n\nNot reading that, enjoy the downvote.","replies":[{"poster":"FedAsFuk","date":"2015-04-15T22:42:29.742+0000","up_votes":2,"down_votes":2,"body":"So instead of disliking something for the facts of the post you dislike it for the background of the player posting? Oh and by the way, you wanted to read what was below it, because you CLICKED ON THE LINK, or do you spend alot of time opening things you don't want to read? How much time do you spend pushing on doors that say pull in a day?","replies":[{"poster":"Shockwhite","date":"2015-04-15T23:49:00.011+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Mezzie,realm=NA,application-id=3ErqAdtq,discussion-id=oKVdkvhE,comment-id=00000000,timestamp=2015-04-15T22:42:29.742+0000)\n>\n> So instead of disliking something for the facts of the post you dislike it for the background of the player posting? Oh and by the way, you wanted to read what was below it, because you CLICKED ON THE LINK, or do you spend alot of time opening things you don't want to read? How much time do you spend pushing on doors that say pull in a day?\n\nYou're cancer.","replies":[{"poster":"FedAsFuk","date":"2015-04-16T02:15:07.546+0000","up_votes":2,"down_votes":1,"body":"And you have more than few posts where the entire premise of anything is \"He is diamond backdown\" guess what, you are diamond on North American server, congrats you are a slightly sprinkled pile of shit, instead of a less sprinkled pile of shit.","replies":[]}]}]}]},{"poster":"Sacklet","date":"2015-04-15T22:25:47.217+0000","up_votes":4,"down_votes":0,"body":"I love Shockwhite he's cool","replies":[]}]}