{"poster":"Dude A","date":"2016-09-29T06:55:21.360+0000","title":"Help","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So today I got on league Queued up for an ARAM game and when champ select was over my screen went black and then i was back at my login screen for my computer. So i log back on, reconnect to my game and my fps is 7-10 fps. So i restart my computer which only takes about 2 Minutes and i reconnect and again same Fps 07-15max. I look in my task manager and it is showing league using 60-90% of my cpu. And it only does that with league. Is it a league problem or a problem with my computer. Also it was the first time i played league today. And i played league fine yesterday.","replies":[{"poster":"Porocles","date":"2016-09-29T15:52:30.520+0000","up_votes":1,"down_votes":0,"body":"That allocation makes me think that there may be third party programs that aren't playing well with league, and causing fps issues as well.  For example, a recent Windows update auto-enabled the [Xbox Game Bar](http://www.tenforums.com/tutorials/8637-game-bar-turn-off-windows-10-a.html), which has been causing similar issues for some players.  Disabling that may get this resolved!  Additionally, remove any third party apps you might have running like play.tv or overlays just in case.  Let me know if you have any questions!","replies":[{"poster":"Glomerious","date":"2016-09-29T16:55:03.293+0000","up_votes":1,"down_votes":0,"body":"i have seen that windows xbox game bar thing ever since the windows update, and ever since then ive had like horrible fps drops and the client freezes sometimes and i got like 20 minute bans forever because i try to play and the game freezes so its a vicious neverending cycle, and im getting those bans like im leaving the game. can you help? is there any way to fix these update to smoothly transition back into normal performance so we can play like before again and not lag? my laptop is brand new so it has nothing except league and curse, and even then it ran just fine at a solid 60 fps","replies":[]}]}]}