{"poster":"Silberner Dolch","date":"2016-02-15T16:06:50.406+0000","title":"Wann kommt eigentlich...","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"der Malphite Nerf?\r\n\r\n-hoher Schaden trotz Tank Build (Sunfire)\r\n-500Armor sind keine seltenheit\r\n-keine sinnvollen Armorpen Gegenst&auml;nde im Spiel vorhanden (LW ist nen schlechter Witz im vergleich zu vorher)\r\n-nicht interruptbarer Escape der wohl gleichzeitig der wohl st&auml;rkste Engage &uuml;berhaupt ist\r\n-zu guter letzt noch einen AoE AS-Slow/Slow\r\n\r\nSchw&auml;chen?\r\n-vielleicht CC ansonsten kann man nichts gegen ihn ausrichten\r\n-bannen und sich daf&uuml;r mit anderen tollen Champs wie Mundo/Xin/Udyr rumschlagen die auch wieder vollkommen eskalieren gerade\r\n-unterm Tower pushen ist auch Geschichte, da Riot ja die tolle Idee hatte Sunfire zu buffen (kommt ihr noch klar?)\r\n\r\nIch dachte man wollte diese Season weg von den Juggernauts die trotz Fulltank jeden ADC oneshotten k&ouml;nnen. Aktuell ist es schlimmer als jemals zuvor. Sagte Riot nicht immer das man sich entscheiden muss zwischen Schaden und Tankyness? Ich sehe bei diesem Champ (und einigen anderen mehr) inzwischen gar keine Entscheidung mehr. Man baut einfach seine Reihenfolge an Items ,ohne gro&szlig; nachzudenken und hat damit quasi alles richtig gemacht.\r\nDas ist doch schei&szlig;e!\r\n\r\nPS: Vote for Irelia Passiv Buff/Rework\r\nPPS: Vote for mehr Armor Pen Gegenst&auml;nde","replies":[{"poster":"Doo ","date":"2016-02-15T17:15:59.211+0000","up_votes":2,"down_votes":0,"body":"hat nix mit dem Thema zu tun, aber..\n\nWann kommt eigentlich sie SoloQ raus?","replies":[]},{"poster":"HowIGankedYou","date":"2016-06-17T16:09:38.112+0000","up_votes":1,"down_votes":0,"body":"Sorry, aber da du zu der Elo-Unterschicht gehörst, bist du nicht in der Lage eine fachkundige Meinung abzugeben. Desweiteren hat Riot das Hausrecht über dieses Spiel und nicht du. Ich meine, wo kämen wir hin, wenn Riot Meinungen wie deine wertschätzen würde. \n\n> Ich möchte nicht Respektlos sein, aber ich denke nicht, dass du über das nötige \"Fachwissen\" verfügst um hier eine Fachkundige Meinung abgeben zu können.\nSilberner Dolch\n\n> Die Meinung von 99% der Spielerschaft ist nichts wert.\nSilberner Dolch\n\n>  Riot besitzt das Hausrecht über das Spiel. Daher kann Riot entscheiden, was mit dem Spiel passiert\nSilberner Dolch \n\nhttp://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/oxzcKz9r-fizz-ist-zu-stark?comment=00030003000100000000000000000000000000000001000000000000","replies":[]},{"poster":"TerrorRaven","date":"2016-02-15T18:52:10.803+0000","up_votes":1,"down_votes":0,"body":"Er hat Schwächen: Keinen Gap-Closer außer der Ulti, skaliert auf Rüstung -> kaum Magieresistanz -> nicht so Effektiv gegen AP-Champs (speziell {{champion:8}} ). Nur ein Tipp: {{champion:114}} nimmt dank prozentualen True Damage und der Möglichkeit, JEDEN Spell mit ihren W zu blocken, fast jeden Tank auseinander (sofern man das Timing drauf hat).","replies":[]},{"poster":"Megamaexx","date":"2016-02-15T16:28:22.657+0000","up_votes":1,"down_votes":0,"body":"Die Ausbaustufen von {{item:3035}} sind stärker als das alte Letzter Atemzug, da 45% Bonus-Armor ignoriert werden, was gegen Malphite ebenso stark ist wie 40% Gesamt-Armor. Dazu haben Sie noch einen weiteren Effekt. Rüstung soll ja nicht komplett nutzlos sein.\nMalphite ist tatsächlich zu stark, da geb ich dir recht. Im Endgame vernichtet er grundsätzlich alles und jeden. Seine W sollte etwas reduziert werden, aber der nächste Patch wird schon was ändern.","replies":[]},{"poster":"Alustus","date":"2016-02-15T16:14:53.401+0000","up_votes":1,"down_votes":0,"body":"Nächsten Patch bekommt er einen.\n\n\n> PS: Vote for Irelia Passiv Buff/Rework\n\nbesser einen nerf\n\n> Schwächen?\n\nkeine mobilität außer ult.\nWenig bis kaum mana wesshalb er im early fast permanent oom ist.\nGroße hitbox sprich er ist gegen skillshot anfällig.\nKaum waveclear bis er sunfire oder bamis hat.\nkeinen lebensraub skill oder ähnliches.\nAußerdem ist er gegen Ap truedmg usw. anfällig hat bis auf die Ult(welche eine lange cd hat) keinen gapcloser.\n\nDas soll nicht heißen das er im moment nicht etwas zu stark ist, aber er hat durchaus counter und schwächen.","replies":[]}]}