{"poster":"StayInBronce","date":"2018-02-22T20:57:50.190+0000","title":"Se siente tan bien que hayan matado al ciego y a zoe","subforum":"Jugabilidad, balance y narrativa","up_votes":9,"down_votes":6,"body":"En 9 de cada 10 partidas te encontras al ciego {{champion:64}} , 9 de esas 10 las perdes porque el ciego no hace nada, solo poner un ward para dar vision, saltar, morir... hasta perder el game.\n\nPor ahi mete un insect a un mundo {{champion:36}} o a un malph full tank {{champion:54}}  para tirarselos a su team, pero es lo comun... lee sin mains players\n\nY en cuanto a la pelirojaa petite {{champion:142}} , al fin la matan, al fiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiin, chaboon hasta Dopa decia que ese campeon estaba terriblemente desbalanceado,  que era pick o ban hasta que Riot la mate un poco....\n\nQ + Pasiva = Anda viendo que comprar en la tienda ... y vienen a quejarse de que no merecia el nerf??\n\nReally?? 1 item y medio y te hace oneshot vayas lo que vayas y dicen que no merece nerf?? Pls .... zoe mains wanna be \n\nQue hermoso parche Rito querido ","replies":[{"poster":"Hwaxinghz","date":"2018-02-22T23:04:24.631+0000","up_votes":3,"down_votes":0,"body":"El nerf a Lee Sin es super merecido. Desde que salió que ha estado en el Meta, siempre brillando (del lado enemigo por supuesto) por sus Play's que jamás pasan de moda.\nY, en cuanto a Zoe, creo que está bien que haga mucho daño, pero que no lo haga en área. Así que opino que el Nerf al \"área\" de la Q y al cambio en el Teleport (que no lancen los Minions) está perfecto. Aunque yo personalmente quitaría la posibilidad de que salgan \"cosas\" en Minions, simplemente que salgan sólo si los Enemigos usan Summs. Me ha pasado en el que Zoe está en coma, mata 2 minions con globitos y les sale un Heal y una Redención (¿Really?) y termine sobreviviendo.","replies":[]},{"poster":"OzymandiasV","date":"2018-02-22T22:17:54.868+0000","up_votes":2,"down_votes":0,"body":"Quedate tranquilo que cambiaron Zoe por Rengar.\n\nEl daño que hace es increíble.","replies":[]},{"poster":"Ks Erwyn","date":"2018-02-23T10:13:19.903+0000","up_votes":1,"down_votes":0,"body":"que la coma Lee sin y todo sus main, sobretodo vos Fede ;) ....\n\n\n{{sticker:sg-lulu}}","replies":[]},{"poster":"Yanx99","date":"2018-02-22T21:44:54.194+0000","up_votes":1,"down_votes":0,"body":"Si esa es pelirroja yo soy rubio","replies":[]},{"poster":"2801","date":"2018-02-22T21:31:26.980+0000","up_votes":2,"down_votes":3,"body":"Discúlpame, pero yo los Lee que me encuentro no hacen eso en mi equipo ni en el contrario, inclusive yo hago las cosas mejor que esas pelotudeces que decís :P","replies":[]}]}