{"poster":"dominusx","date":"2016-11-19T13:37:43.796+0000","title":"Hurry up and bring out the 10bans already.","subforum":"Gameplay","up_votes":128,"down_votes":36,"body":"I&#039;m tired of dodging at least one game per day because the enemy has some cancer champ that simply rolfstomps you without braincells because*meta* And now that we got Vayne back in the meta we have one extra reason to dodge.","replies":[{"poster":"Denims Wrath666","date":"2016-11-19T13:40:57.922+0000","up_votes":27,"down_votes":3,"body":"a ban for each person makes sense.","replies":[{"poster":"dominusx","date":"2016-11-19T13:42:36.462+0000","up_votes":5,"down_votes":25,"body":"can't ban everything . you have to ban a few select cancer champs and you also need to ban a few champs who are really strong in the meta even tho you wont call em cancer. my priority ban for this patch has been {{champion:61}}  but if i ban her cant ban braindead pile of trash {{champion:154}} and {{champion:120}}  and the games are always fun against these 2","replies":[{"poster":"DJMason88","date":"2016-11-19T17:46:53.965+0000","up_votes":26,"down_votes":11,"body":"Did you just say Orianna is a brain dead champion?","replies":[{"poster":"PermabannedGaren","date":"2016-11-19T17:53:59.293+0000","up_votes":25,"down_votes":0,"body":"> [{quoted}](name=DJMason88,realm=NA,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=000000000001,timestamp=2016-11-19T17:46:53.965+0000)\n>\n> Did you just say Orianna is a brain dead champion?\n\nNo, he was referring to Zac and Hecarim as brain-dead.","replies":[]},{"poster":"Velzard of Koz","date":"2016-11-19T20:03:09.514+0000","up_votes":8,"down_votes":2,"body":"Oh that reading comprehension...","replies":[{"poster":"DJMason88","date":"2016-11-21T20:17:36.382+0000","up_votes":1,"down_votes":0,"body":"I was tired at read that too quick.","replies":[]}]},{"poster":"dominusx","date":"2016-11-19T18:08:00.644+0000","up_votes":8,"down_votes":3,"body":"no she is just too good atm. not braindead. ALso a good Orianna is too scary vs my champion pool.","replies":[{"poster":"sir d wreck","date":"2016-11-19T20:19:28.559+0000","up_votes":2,"down_votes":9,"body":"***","replies":[{"poster":"Velzard of Koz","date":"2016-11-19T21:32:20.885+0000","up_votes":9,"down_votes":1,"body":"He didn't explain why he thinks she's too good so hardly could that be biased when we don't know his point of view. He said she's too scary against his picks, but remember he was talking about why he bans her, so that's not \"biased\", that's \"counterban\".\n\nIf he asked for nerf to her based on that, that would be biased.","replies":[{"poster":"Votable Jester","date":"2016-11-20T10:47:16.288+0000","up_votes":1,"down_votes":2,"body":"Well he did say \"she is just too good atm\" which goes a bit beyond just considering her a counter to his pool.","replies":[{"poster":"dominusx","date":"2016-11-20T17:51:57.048+0000","up_votes":1,"down_votes":0,"body":"even when yasuo was bugged i still didnt find him a problem why would i be biased towards ori i just respect her strenghts and rather avoid them by banning her. the mage i'm biased against is Ahri but i dont ban her.","replies":[{"poster":"Votable Jester","date":"2016-11-20T18:04:59.519+0000","up_votes":1,"down_votes":0,"body":"I wasn't saying you were biased against Ori.  I was simply pointing out that what you said was more than that she was a counter to your champion pool.  You said that she was too good atm, which suggests general strength.\n\nIn no way am I accusing you of anything.  I was simply countering Nostormo's point.","replies":[]}]},{"poster":"dominusx","date":"2016-11-20T13:03:09.945+0000","up_votes":1,"down_votes":0,"body":"i'm playing kha zix / Graves / Diana / Victor . Even tho i can dive her at most times if i missplay it and get hit by her combo i'mma get raped into oblivion also the items on her are really really strong! Morello is good on her Rylais is also good on her zhonya now gives cdr etc etc . and her shield is strong as fuck at least imo. She isnt nerf worthy by any means but i prefer to ban her out for safety that is all. I'm only biased vs tanks and 4 adc's you wont really see me complain about mages except a little qq about Syndra but i adapted to her playstyle hitboxes after i played like 7games with her in a row.","replies":[{"poster":"Votable Jester","date":"2016-11-20T17:38:07.683+0000","up_votes":1,"down_votes":0,"body":"I still prefer old Zhonya's.  Between 50 AP and 10% cdr I'll take the 50 AP every time.\n\nAnyways, Rylai's is already acknowledged as an op item atm, and I'm in full support of it getting nerfed/shifted in role.  I never liked having to build it anyways.  Its dominance just reduced build diversity further (though mages do need a couple more items for flexible builds).","replies":[]}]}]}]}]},{"poster":"RainbowIcee","date":"2016-11-20T06:04:52.879+0000","up_votes":3,"down_votes":1,"body":"Oriana has high burst but requires near perfect positioning. She's harder to pull off than what she seems. She is strong but a nerf would just make her almost entirely unwanted because she'd be in a situation like draven Where he is really strong is it worth it to go through all the trouble of making him work vs another champion that can just AA and follow like caitling for the same result?","replies":[{"poster":"WoonStruck","date":"2016-11-23T06:36:04.770+0000","up_votes":1,"down_votes":0,"body":"Orianna is not hard. \n\nShe requires more forethought than a lot of champions, but she can hardly be considered difficult. There's not a champion in LoL that's really 'difficult' outside of _maybe_ Azir in teamfights.","replies":[]}]}]}]},{"poster":"Spoofghoul","date":"2016-11-19T19:49:29.954+0000","up_votes":5,"down_votes":1,"body":"the only braindead champ i know is {{champion:14}} :D","replies":[{"poster":"dominusx","date":"2016-11-20T13:04:56.413+0000","up_votes":2,"down_votes":0,"body":"{{champion:9}}  :3","replies":[]},{"poster":"IronLeaguePro","date":"2016-11-20T05:16:14.741+0000","up_votes":2,"down_votes":0,"body":"What about {{champion:429}} and {{champion:30}} ?","replies":[]}]},{"poster":"statelesskiller","date":"2016-11-19T16:30:20.932+0000","up_votes":5,"down_votes":4,"body":"zac takes a modicum of skill though. his jump while being absolute cancer takes abit of game and champion knowledge and sometimes trust in your team to pull off correctly","replies":[{"poster":"dominusx","date":"2016-11-19T18:08:47.426+0000","up_votes":2,"down_votes":0,"body":"or you miss it and sit into 4people tanking till your team disposes of the front line. I've been watching tarzaned he just dives in and sits there.","replies":[]}]}]}]},{"poster":"Almighty","date":"2016-11-19T22:43:17.337+0000","up_votes":9,"down_votes":1,"body":"I can already see the ban list.\n\n{{champion:157}} {{champion:67}} {{champion:107}} {{champion:154}} {{champion:120}} {{champion:121}} {{champion:238}} {{champion:122}} {{champion:64}} +the most recently released/reworked champion.\n\n_**Almighty.**_","replies":[{"poster":"Prestige Eve","date":"2016-11-19T23:27:51.915+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Almighty,realm=EUNE,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=0008,timestamp=2016-11-19T22:43:17.337+0000)\n>\n> I can already see the ban list.\n> \n> {{champion:157}} {{champion:67}} {{champion:107}} {{champion:154}} {{champion:120}} {{champion:121}} {{champion:238}} {{champion:122}} {{champion:64}} +the most recently released/reworked champion.\n> \n> _**Almighty.**_\n\nWell maybe this'll tell Riot that there really is something up with these Champion's balancing.","replies":[{"poster":"EROTIC RAID BOSS","date":"2016-11-20T00:27:54.405+0000","up_votes":2,"down_votes":1,"body":"lol like zed or darius are really that great","replies":[{"poster":"Cosmic Warper","date":"2016-11-20T08:25:08.456+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Monado II,realm=NA,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=000800000000,timestamp=2016-11-20T00:27:54.405+0000)\n>\n> lol like zed or darius are really that great\n\nYeah darius and zed can go, but the others are super obnoxious to play against","replies":[{"poster":"Blåbæret","date":"2016-11-20T12:48:25.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cosmic Warper,realm=NA,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=0008000000000000,timestamp=2016-11-20T08:25:08.456+0000)\n>\n> Yeah darius and zed can go, but the others are super obnoxious to play against\n\nYou have to be ranged to beat Darius in lane.","replies":[{"poster":"Rimgon","date":"2016-11-20T14:23:56.903+0000","up_votes":2,"down_votes":1,"body":"{{champion:14}} What was that?","replies":[]}]}]}]},{"poster":"J Epstein","date":"2016-11-20T01:13:58.464+0000","up_votes":2,"down_votes":1,"body":"is it bad that rengar, kha and hec are my  top bans?  ","replies":[]},{"poster":"SmileInABox","date":"2016-11-20T04:10:51.556+0000","up_votes":1,"down_votes":0,"body":"And then those champs will get demolished, and be a replaced by another permaban roster. A really pointless cycle.","replies":[{"poster":"ƒoes","date":"2016-11-21T21:10:03.820+0000","up_votes":1,"down_votes":0,"body":"Well put.","replies":[]}]}]},{"poster":"EndlessSorcerer","date":"2016-11-19T23:29:01.907+0000","up_votes":5,"down_votes":0,"body":"I eagarly await the moment Yasuo is 100% permaban.\n\nThrough our efforts, he shall surpass Season 3 Kassadin's ban rate.","replies":[{"poster":"ƒoes","date":"2016-11-20T08:28:16.412+0000","up_votes":1,"down_votes":0,"body":"tbh most Yasuo mains are dreading that, we actually want his winrate to go down and him to stop being OP. fuck it im willing to see his windwall get nerfed to shit because its what everybody complains about - anything to lower his banrate PLEASE","replies":[{"poster":"EndlessSorcerer","date":"2016-11-20T14:14:22.121+0000","up_votes":2,"down_votes":0,"body":"Honestly, it isn't even his winrate that bothers me; I just find him rather annoying to play with or against due to the nature of his kit.\n\nI'm well aware that he isn't overpowered but I find several aspect of his kit rather irritating and he tends to attract toxic players.\n--------------------------\nIf they do decide to nerf him, some decent ideas may be:\n\n* Windwall has a slight delay before taking effect (so he can't block projectiles by casting it in the complete opposite direction)\n* Ultimate no longer positions Yasuo outside of tower range whenever even remotely possible","replies":[]},{"poster":"Meritas","date":"2016-11-20T14:00:36.300+0000","up_votes":1,"down_votes":0,"body":"They complain about it since release. I somehow doubt it's getting nerfed _now_.","replies":[]}]}]}]},{"poster":"Vistha","date":"2016-11-19T19:21:45.633+0000","up_votes":3,"down_votes":21,"body":"Truth be told I'm against 10 bans.\n\nI'd rather have Riot give bans to the first 3 picks instead.\n\nReason: I actually like playing against and - sometimes - as Yasuo.","replies":[{"poster":"NiceTryVi","date":"2016-11-19T19:45:48.578+0000","up_votes":1,"down_votes":7,"body":"If the bans went to the first 3, then the last 2 picks on each team would be sitting there dominated by the first picks again. Moving the bans to the last people allowed them some power in the pick process instead of being at the mercy of the first few players.","replies":[{"poster":"EndlessSorcerer","date":"2016-11-19T19:53:52.480+0000","up_votes":10,"down_votes":1,"body":"At the moment, players lower in the pick order get to ban champions and have the best chance of counterpicking their opponents.\n\nFirst picks are just getting counterpicked.","replies":[{"poster":"NiceTryVi","date":"2016-11-21T00:56:49.594+0000","up_votes":1,"down_votes":1,"body":"Counterpicking doesn't matter for the grand majority of the playerbase. For about 90-95% of the players of this game, playing the champion you are most comfortable with is best.","replies":[{"poster":"EndlessSorcerer","date":"2016-11-21T01:25:24.589+0000","up_votes":1,"down_votes":0,"body":"While playing a champion you know is best, there is nothing wrong with knowing multiple champions and picking the best one of the situation.\n-----------------------\nFor example, suppose I were a top laner with the following champion pool (whom I am comfortable and experienced with):\n{{champion:57}} {{champion:78}} {{champion:27}} {{champion:39}} {{champion:122}} {{champion:111}} \n\nCertain champions are far better in certain matchups than others.\n\nAm I against Riven?  Poppy is great at denying her the opportunity to snowball and at shutting her down during teamfights.\n\nAm I against Nasus?  Darius is fantastic at zoning and killing Nasus throughout the game.\n\nAm I dealing with a squishy ranged opponent?  Irelia will survive, farm and tear them to pieces.\n-------------------------\nI don't recommend picking a champion you don't know just because it happens to counter your opponent.  If you don't know how to use your champion or how the matchup plays out, you won't be very useful.\n\nHowever, if a champion you are experienced with happens to counter your opponent, you can get a massive advantage before the game even starts.","replies":[]}]}]},{"poster":"Vistha","date":"2016-11-19T19:59:55.475+0000","up_votes":6,"down_votes":2,"body":">If the bans went to the first 3, then the last 2 picks on each team would be sitting there dominated by the first picks again. \n\nExcuse me, but do you actually remember why first picks were \"dominating\"?\nWhy, of course you don't.\n\nIt would've been fair for last picks to have bans in Seasons 1 through 5, because the lower was your pick, the lower was your chance to get the role you wanted, due to Pick Order being the rule.\n\nNot in Season 6 and 7 where everybody gets to pick the role they want without fail.\n\nThere is zero advantage for being a first pick in Solo Queue, because the possibility of a champion trade is nearly non-existent, while it makes no difference for premades.\n\n>Moving the bans to the last people allowed them some power in the pick process instead of being at the mercy of the first few players.\n\nLast picks currently get:\n\n- roles they want\n- a very high chance to counterpick the enemy\n- an ability to shield their picks with bans.\n\nMeanwhile first picks:\n\n- open themselves to getting outright counterpicked\n- don't get any sort of protection for their picks\n- are at the mercy of last picks to ban champions they will have problems with - which doesn't happen most of the time, because Yasuo must be banned, even if he's a shit champ that's easily counterable with most champions.","replies":[{"poster":"NiceTryVi","date":"2016-11-21T01:01:10.704+0000","up_votes":1,"down_votes":0,"body":"Last picks currently get no threat of their champ being banned by salty people who dont get their preferred role as well. Like I said above, counterpicks dont matter to about 90-95% of players because you are more likely to win on your most comfortable champion anyway. They aren't at the mercy of the last picks, because last picks will ban the champions that the whole team will have a problem with, instead of just banning someone cause they want to firstpick another strong champ and force a weaker laner, but maybe not a weaker teamfighter.","replies":[{"poster":"Vistha","date":"2016-11-21T15:52:39.795+0000","up_votes":1,"down_votes":0,"body":"No, ultimately people always ban champions they find frustrating, not champions that are strong and actually give the enemy team a chance to win.\n\nFor example last season I was telling people to not ban Yasuo.\nNot because I wanted to play him, but because if the enemy team picked him, they'd instantly play a 4v5 match, either because Yasuo would be obliterated or because his jungler would have to lane with him the whole time.\nBut the same champion would get shit on by Zed in most cases.\n\nCounterpicks do matter.\nAt least for people like me.\nI'm not affraid to pick a different champion if I had to put myself in a losing position otherwise.\n\nFor example Heimer vs Syndra. Heimer isn't going to win, unless Syndra player is a potato.\nWould you gamble picking Heimer knowing they have Syndra or rather pick Diana who dumpsters Syndra at level 6+ or Lux who can play safe and scale better?","replies":[]}]}]},{"poster":"Hyrum Graff","date":"2016-11-20T04:10:46.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiceTryVi,realm=NA,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=00030000,timestamp=2016-11-19T19:45:48.578+0000)\n>\n> If the bans went to the first 3, then the last 2 picks on each team would be sitting there dominated by the first picks again. Moving the bans to the last people allowed them some power in the pick process instead of being at the mercy of the first few players.\n\nI feel like the people who need the bans most are the first picks, since they're more likely to be counterpicked. Later gets the benefit of being able to counterpick.\n\nI dunno, I'm sure there are people who just play a few champs and it's really valuable to be able to grab a power pick, but I much prefer counterpicking.","replies":[{"poster":"NiceTryVi","date":"2016-11-21T01:04:14.560+0000","up_votes":1,"down_votes":1,"body":"Again, like I said above, counterpicks dont matter to about 90-95% of players because you are more likely to win on your most comfortable champion anyway. You people all bring up the same non-issue. The first picks dont need the bans, because if you remember, back when the first guy had all the bans, he just banned the people he didn't want to see in his lane, instead of banning team-oriented or overpowered threats.","replies":[{"poster":"Hyrum Graff","date":"2016-11-21T05:36:41.156+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiceTryVi,realm=NA,application-id=3ErqAdtq,discussion-id=OZUp2vgt,comment-id=0003000000020000,timestamp=2016-11-21T01:04:14.560+0000)\n>\n> Again, like I said above, counterpicks dont matter to about 90-95% of players because you are more likely to win on your most comfortable champion anyway. You people all bring up the same non-issue. The first picks dont need the bans, because if you remember, back when the first guy had all the bans, he just banned the people he didn&#x27;t want to see in his lane, instead of banning team-oriented or overpowered threats.\n\nExcept the first summoner wouldn't have three bans, they'd have one. So the three people who are liable to get counterpicked each get to ban one counterpick that they don't want to deal with. Seems legit to me.\n\nThat said, I'd prefer 5 bans.","replies":[]}]}]}]}]},{"poster":"Oakleaf Ranger","date":"2016-11-19T20:33:53.921+0000","up_votes":5,"down_votes":0,"body":"I don't really share the same sentiment of the actual post but I do agree with the title. GIVE ME THE 10 BANS ALREADY","replies":[]},{"poster":"Diri","date":"2016-11-20T15:19:15.404+0000","up_votes":4,"down_votes":0,"body":"I really don't like the idea of not seeing a certain champion ever. There should absolutely be an opportunity to ban counters, and remove any champions you just don't like playing against, but there should be room for learning how to play against those champions, rather than just perpetuating the problems you already have with them.","replies":[]},{"poster":"takeZOOOOOO","date":"2016-11-20T13:33:49.650+0000","up_votes":3,"down_votes":0,"body":"wonder how shitty the game will become when this comes out, so sad.","replies":[]},{"poster":"Summonerrr 1","date":"2016-11-19T19:51:30.163+0000","up_votes":3,"down_votes":0,"body":"Being able to ban less than 5% of the champion pool now when there's more than 10% of champions that either aren't as healthy for the game as they should be (either due to age or mechanics) or just not fun to play against is stupid.\nIncrease it to 10.","replies":[]},{"poster":"Flemman","date":"2016-11-20T14:53:10.651+0000","up_votes":2,"down_votes":0,"body":"Even with ten ban, the reason behind mine will still be the same\n\nfirst category to ban : manaless and rewarding champ still open (aka only weakness is player experience on it : lee, zed, yas,...)\nsecond : is there any tank assassin still left (fizz, ekko)\nthird : are champion who synergise to well with the meta still open ( ghostblade top item, botrk top item, tank itemisation)\nlast : champ that actually counter what I want to play","replies":[]}]}