{"poster":"JedenVojak","date":"2014-10-18T08:07:33.431+0000","title":"Soraka needs a buff","subforum":"Gameplay","up_votes":2,"down_votes":3,"body":"Soraka just can't effectively hold lane against all in champions (like Zed or Talon) or champions with lots of ranged poke (like Ziggs or Xerath). The hard counter to her entire kit is any tier 2 boots + alacrity.\n\n1) She needs her old base move speed back, it's just too hard to dodge the skillshots with only 325 movespeed\n2) Q either needs it's speed normalized across all ranges, or the sweet spot should stun - it's just not good enough for how hard it is to land at range\n3) The W passive should work against large monsters. This would give Soraka back her jungle sustain (which she badly needs)\n4) Either E needs to work against minions and monsters to let her farm more efficiently (which would let her jungle again), OR it should *apply* silence to those hit by it. It's too easy to simply run out of for how long of a cooldown it has.","replies":[{"poster":"Nielarken","date":"2014-10-18T09:57:53.324+0000","up_votes":2,"down_votes":0,"body":"you dont even need alacrity tier 2 boots alone give you the speed to walk out of her e even with the 35% slow from starfall her kit need crazy work","replies":[{"poster":"jjookkeerr","date":"2014-10-18T10:08:44.492+0000","up_votes":1,"down_votes":0,"body":"starcall","replies":[]}]},{"poster":"eztarg3t","date":"2014-10-18T18:27:52.527+0000","up_votes":1,"down_votes":0,"body":"She won't be reciving any buffs with the preseason close in hand. All the changes coming may actually benefit Soraka greatly. Although, that is just a guess, it may do shit. \n\nBUUUUUUT a few buffs to her MS and making her Q more rewarding isn't something I'm against.","replies":[]},{"poster":"Raptamei","date":"2014-10-18T09:59:18.805+0000","up_votes":1,"down_votes":0,"body":"She's intentionally useless without teammates because she's supposed to be a support.","replies":[{"poster":"JedenVojak","date":"2014-10-18T10:10:47.082+0000","up_votes":1,"down_votes":0,"body":"> She's intentionally useless without teammates because she's supposed to be a support.\n\nLulu, Nami, Leona, Taric, Alistar and even Janna can meaningfully function without other mans around.\n\n> But shes useless now with teammmates shes at a point where your team is trying to keep you alive instead of you keeping them alive\n\nEhh... she's not actively bad with teammates around. She's just very snowbally with them, in the sense that, if your teammates are fed, she basically slams the door shut in the other teams face for looking for shutdowns, but if your teammates are behind, you can't heal enough fast enough to get rid of the pain.\n\nIt's more the problem of being completely unable to function independently. Her W is basically a dead skill in her bar, and her Q doesn't work on minions or monsters, making it a champ only ability, but it's one that is very easy to not have its full effect since the enemy can just run out of it. Some people like it, but I consider it just plain worse than her old single target silence, since that was guaranteed to work for the full duration.","replies":[]},{"poster":"Nielarken","date":"2014-10-18T10:04:23.763+0000","up_votes":1,"down_votes":0,"body":"But shes useless now with teammmates shes at a point where your team is trying to keep you alive instead of you keeping them alive","replies":[]}]},{"poster":"jjookkeerr","date":"2014-10-18T10:02:41.392+0000","up_votes":1,"down_votes":0,"body":"remove the mana cost from W\n\nincrease speed from starcall and lower the fucking mana cost\n\nincrease her abse ms\n\nnow she is viable","replies":[]},{"poster":"Rinky Dinky","date":"2014-10-18T10:47:45.556+0000","up_votes":1,"down_votes":2,"body":"Play her as a supp \n\nThe way she was intended to be played. \n\nGG you won","replies":[]}]}