{"poster":"BRG Freez","date":"2017-12-27T18:18:48.795+0000","title":"[Dia 3] Allrounder LFT D5+","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo,\r\nerstmal ein paar Infos &uuml;ber mich. Ich hei&szlig;e Philipp und bin 19 Jahre jung. Ich besitze einen D3 Acc, einen D4 Acc und einen D5 Acc. Momentan habe ich keine Main Rolle und kann alles auf einem guten Niveau: Jgl/Adc--&gt; Mid--&gt;Top----&gt;Supp. Ich habe in Season 6 mehrere Monate in einem high Dia Team gespielt und erfolgreich Tuniere gewonnen bzw. die oberen Pl&auml;tze belegt. Season 7 habe ich auch in mehreren Teams mein Gl&uuml;ck versucht und an verschiedenen Tunieren teilgenommen. Ich suche ein D5+ Team das Zeit mit sich bringt und auch lust hat an Tunieren teilzunehmen.\r\n\r\nhttp://prntscr.com/hs4lnn\r\nhttp://prntscr.com/hs4lyg\r\nhttp://prntscr.com/hs4m5j\r\n\r\nKurzbeschreibung:\r\n-Teamerfahrung (in high Dia+ Teams)\r\n-Tuniererfahrung\r\n-Flame oder Tilte nicht\r\n-Kritikf&auml;hig\r\n-TS3 oder Discord m&ouml;glich\r\n-Season 5 &ndash; Season 6 Main Rolle: Jgl, Mid\r\n-Season 7 Main Rolle: Adc, Mid, (Top)\r\n\r\nChampionpool (Champs die ich momentan gut beherrsche):\r\n-Adc: Xayah, Jinx, Vayne, Caitlyn, Ezreal, Jhin, Varus, Miss Fortune, Lucian\r\n-Jgl: Lee Sin, Kayn, Kha Zix, Seju, J4, Gragas\r\n-Mid: Azir, Zed, Xerath, Ziggs, Varus, Malzahar, Orianna, Taliyah\r\n-Top: Ornn, Rumble, Jayce, Riven, Kennen, Jax, Gnar, alle Tanks\r\n\r\nBei weiteren Fragen oder Interesse mich Ingame anschreiben.\r\n\r\nMfG\r\n\r\nFreez987","replies":[{"poster":"rrexev","date":"2017-12-27T20:31:52.506+0000","up_votes":1,"down_votes":2,"body":"boosted stats are real. junge junge","replies":[{"poster":"BRG Freez","date":"2017-12-28T09:36:24.548+0000","up_votes":2,"down_votes":0,"body":"Alles klar. Hast du dir mal die Stats angeschaut? Ich liege ja nur bei einer win rate von über 53% und die Stats auf meinen main Champs sind ja nur über dem Durchschnitt, wenn du trollen willst nerve bitte jemand anderes. ^^","replies":[{"poster":"rrexev","date":"2018-01-03T20:08:46.067+0000","up_votes":1,"down_votes":1,"body":"Was deine overall WR ist juckt nicht solange deine Championsstats awkward af sind.","replies":[]}]}]}]}