{"poster":"Quinntessénse","date":"2015-11-09T17:42:11.461+0000","title":"Lulu mid/top S6","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Lulu giocata full AP in mid o top, &egrave; uno dei miei pick preferiti, volevo sapere, anche se &egrave; ancora presto, come pensate possa cavarsela come solo laner in questa futura season :) Vi ringrazio in anticipo dei pareri","replies":[{"poster":"Ste the ripper","date":"2015-11-09T17:51:44.246+0000","up_votes":2,"down_votes":0,"body":"Bah bene o male lulu worka sempre, finché ci sarà un assassino o un adc in giro lei potrà fare il suo lavoro.\nPoi per sapere se sarà top tier devi aspettare 3 giorni allo stato attuale nessuno può dorlo con certezza","replies":[{"poster":"Quinntessénse","date":"2015-11-09T17:52:47.123+0000","up_votes":1,"down_votes":0,"body":"Perchè proprio fa 3 giorni ?","replies":[{"poster":"Lee Pugno Divino","date":"2015-11-09T17:58:27.994+0000","up_votes":2,"down_votes":0,"body":"I support da peeling beneficiano dei buff gli adc che stanno facendo. Io credo che diventera' permapickata ed abusata per il suo peeling, e con mio rammarico nerfata...","replies":[{"poster":"Quinntessénse","date":"2015-11-09T18:08:47.726+0000","up_votes":1,"down_votes":0,"body":"Come support penso possa essere viabile il tuo ragionamento, ma che mi dici per quanto riguarda la solo lane ?","replies":[{"poster":"Lee Pugno Divino","date":"2015-11-09T21:16:03.741+0000","up_votes":1,"down_votes":0,"body":"Io la gioco support, top e mid. Ho 100k masteries circa. E' un champ che adoro.\nCome support avra' un po' di spazio, ti dico che e' piu' difficile giocarla support che in lane, perché essendo squishy e non potendo farmare ed essendo sempre un po' dietro a livelli hai bisogno di avere un ottima laning phase e prendere vantaggio per avere la possibilita' di buildare un po' di ap senza renderti troppo fragile.\nPer quanto riguarda la solo lane, sara' peggio di adesso, sicuramente. Il fattore che rende Lulu una solo laner e' che rispetto a tanti altri support ha un ottimo waveclear.","replies":[]},{"poster":"Vileblood Pyke","date":"2015-11-09T20:38:18.887+0000","up_votes":1,"down_votes":0,"body":"Lulu solo laner tende comunque ad essere incentrata sul peeling come Lulu support: cambia la build, ma la base è quella.\nNon la picki per i danni, ma per i controlli e il peeling extra che può offrire.\n\nSecondo me continuerà ad aver senso come pick in composizioni \"protect the Kog\" o simili...","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2015-11-09T18:26:23.853+0000","up_votes":1,"down_votes":0,"body":"Top lane a mio avviso nn avrà piu senso. Oggetti ap nerfati e armature per la resistenza magica buffate. Ora come ora direi che ha senso come support( e li sarà veramente un mostro) ma top o mid perde moltissimo secondo me ( per i costi maggiori,le resistenze magiche migliori e le nuove maestrie)","replies":[]}]}]},{"poster":"Revo21","date":"2015-11-09T17:57:48.386+0000","up_votes":1,"down_votes":0,"body":"perche tra 3gg mettono la patch nuova con le modifiche pre season","replies":[{"poster":"Hype GENERAL ZOD","date":"2015-11-09T18:27:47.412+0000","up_votes":1,"down_votes":0,"body":"Esce giovedì o mercoledì? XD","replies":[{"poster":"Revo21","date":"2015-11-09T18:53:15.529+0000","up_votes":1,"down_votes":0,"body":"dovrebbe mercoledì in teoria però tanto il giorno prima mettono tutto sulle notizie","replies":[]}]}]},{"poster":"Ste the ripper","date":"2015-11-09T17:58:43.917+0000","up_votes":1,"down_votes":0,"body":"Non vorrei sbagliarmi ma tra 3 giorni dovrebbero patchare e fare il cambiamento della season","replies":[]}]}]},{"poster":"StayM","date":"2015-11-09T20:02:28.450+0000","up_votes":1,"down_votes":0,"body":"Io credo che finché ci sarà un adc da salvare, uno squishy da scudare, un juggernaut da speedare, Lulu non tramonterà.","replies":[]},{"poster":"Ucr0niA","date":"2015-11-09T19:13:43.716+0000","up_votes":1,"down_votes":0,"body":"Io credo sarai con ogni probabilità più in difficoltà rispetto alla season tramontante.\n\nIn primis perchè vedrai Adc spammati quali solo Laner, Corki mid, Quinn top, questi sono i primi a venirmi in mente, i più appropiati fra i reworkati, ma sono certo ne vedremo di tutti i colori; E beh gli adc con ogni probabilità _potrebbero_ (Sottolineo l'eventualità della cosa perchè solo giocando lo scopriremo realmente, fare pronostici è avventato) essere sopra i toni ad inizio patch, accade spesso che le new entry siano calibrate in maniera vagamente eccessiva (per non dire OP che a me non piace), per poi essere aggiustate tempo dopo.\nIn secondo luogo, il remake dell'itemizzazione complessiva, favoreggerà molto coloro che potranno mirare ad una certa specificità, crit, range, atk speed, ma pur sempre nell'ottica degli AA e all'AD; verranno di contro buffati anche i quantitativi di HP e di res di oggetti come Omen, Spirit visage e altri, quindi anche i tank-fighter ne usciranno vagamente avvantaggiati (sebbene incredibilmente in difficoltà verso champ più fighter-assasin, o quantomeno rispetto a quanto visto in S5) , ma in tutto ciò non vedremo buff sostanziosi agli Item AP (se non abbassamenti di costi in gold che però riguarderanno anche altri item).\nTrovo quindi che se la S5 è stata definita una patch contro gli Adc, questa patch ridarà loro lustro a discapito dei tank, ma coloro che rimarranno un po in panchina potrebbero essere i mage.\n\nAd ogni modo, essendo comunque Lulu munita dei suoi bei CC, non sarai certo fra i più penalizzati.","replies":[]},{"poster":"Fappelion Dong","date":"2015-11-09T21:21:28.208+0000","up_votes":1,"down_votes":1,"body":"Se c'è una cosa che mi hanno insegnato i mondiali di LoL è che ogni anno {{champion:117}}  è sempre in meta \nlurido cancro\n{{sticker:zombie-brand-mindblown}}","replies":[]}]}