{"poster":"D357R0Y3R","date":"2018-07-20T15:36:31.021+0000","title":"Why are people complaining about new Akali's mobillity?","subforum":"Gameplay","up_votes":63,"down_votes":20,"body":"&quot;with akali rework it&#039;s going to be so unfair to play immobile champions&quot;\n\n&quot;mobility creep is retarded&quot;\n\n??\n\nshe loses her blink on W, instead gets a CONDITIONAL 600 range dash because she has to hit a skillshot\nthat skillshot has 16 seconds cd\nher ult cd got increased to 120 sec\nthe reset on ult got removed\nthe range on her ult got reduced\n\nwhat&#039;s wrong with new akali&#039;s mobility?","replies":[{"poster":"Zetahertz","date":"2018-07-20T15:40:33.453+0000","up_votes":6,"down_votes":42,"body":"the new rework is wrong, Akali was a played champ anyway. Idk why they reworked her","replies":[{"poster":"Alex h8721","date":"2018-07-20T15:43:06.010+0000","up_votes":66,"down_votes":4,"body":"because current akali is point and click stat check cancer.","replies":[{"poster":"RainXBlade","date":"2018-07-20T20:39:54.123+0000","up_votes":3,"down_votes":2,"body":"And so is Yi, and people have been begging Riot to nerf or even rework him to something much healthier.","replies":[{"poster":"Teêmo Bót","date":"2018-07-20T23:20:56.861+0000","up_votes":2,"down_votes":7,"body":"there's champs like voli and nunu but they rework akali? amazing dev team","replies":[{"poster":"SooFr0sty","date":"2018-07-20T23:58:46.656+0000","up_votes":15,"down_votes":1,"body":"It's almost like nunu is next.\n\nThat and they had a solid direction for Akali","replies":[]},{"poster":"Ifneth","date":"2018-07-20T23:58:26.320+0000","up_votes":2,"down_votes":0,"body":"Nunu is next!","replies":[]}]}]}]}]},{"poster":"FridgesArePpl2","date":"2018-07-20T16:21:29.472+0000","up_votes":37,"down_votes":6,"body":"Because these boards complain about literally everything","replies":[{"poster":"Melledoneus","date":"2018-07-20T20:13:17.638+0000","up_votes":15,"down_votes":4,"body":"Shen's slow on his Q is oppressive.\n\nPlease nerf it to 3.5% thank you OP mongoloid champ","replies":[{"poster":"Need Gold 4 Tent","date":"2018-07-20T20:28:53.778+0000","up_votes":3,"down_votes":0,"body":"you'd have to build triforce now to apply all 3 hits of the Q. And go hail of blades.","replies":[]}]}]},{"poster":"CaptainMårvelous","date":"2018-07-20T17:25:49.883+0000","up_votes":31,"down_votes":5,"body":">what's wrong with new akali's mobility?\n\nThe fact that she has mobility at all I guess. Guess people were hoping Akali wouldn't have any dashes and instead had to slowly walk up to you.","replies":[{"poster":"Salron","date":"2018-07-21T00:56:03.175+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=CaptainMårvelous,realm=NA,application-id=3ErqAdtq,discussion-id=3s4z9E9Q,comment-id=0007,timestamp=2018-07-20T17:25:49.883+0000)\nGuess people were hoping Akali wouldn&#x27;t have any dashes and instead had to _**slowly walk up to you**_.\n\nA-And downsmash?","replies":[{"poster":"CaptainMårvelous","date":"2018-07-21T02:40:38.661+0000","up_votes":5,"down_votes":0,"body":"\"That ain't Akali!\" - r/akalimains","replies":[]}]},{"poster":"YuGiHo","date":"2018-07-21T09:41:54.727+0000","up_votes":5,"down_votes":1,"body":"what kind of ninja dosn't have a dash?","replies":[{"poster":"CaptainMårvelous","date":"2018-07-21T15:55:04.841+0000","up_votes":4,"down_votes":1,"body":"\"A balanced one\" - Gameplay","replies":[]}]},{"poster":"Smart Girl","date":"2018-07-21T02:06:46.357+0000","up_votes":2,"down_votes":0,"body":"right! like https://i.imgur.com/Ed4LdEW.jpg what do you want if they had it their way that's what she would do","replies":[]},{"poster":"The DrBonjigollo","date":"2018-07-20T22:18:39.683+0000","up_votes":2,"down_votes":0,"body":"Isn’t that what Assassins do?","replies":[]},{"poster":"StillHittinLicks","date":"2018-07-21T01:01:13.386+0000","up_votes":1,"down_votes":11,"body":"Its too much mobility. Zed can only blink twice. Yasuo can only dash through 1 unit per 10 seconds. Fizz's inv move has a LONG cd, and without landing it, he cant really trade. Kat's only mobile move is shunpo, and only does damage if it retrieves a dagger. Akali can dash 3 times, shroud, and has a 600 meter dash at that. NO champion is that mobile. Not even pyke. Not to mention, you cant even place a pink to find where she is in the shroud or target her with point clicks. She is too mobile. Shes so mobile that you cant trade with her. She can shroud, attack, gain energy, repeat. No assassin is like this. After an assassin champ goes all in, they're done. Not with Akali though. She can go forever. Its not like with Zed or Kat when you have to really plan how to use your skills to gain a kill. If Zed misses his shurikens, its over, If Yasuo misses his nado, its over, if kat mis shunpo's to a dagger, its over. Akali, none of that matters because you cant SEE her but she can SEE you.","replies":[{"poster":"KennysDreamGirl","date":"2018-07-21T04:19:39.225+0000","up_votes":1,"down_votes":0,"body":"i think you completely missed the point. we are talking about new akali here","replies":[{"poster":"StillHittinLicks","date":"2018-07-21T08:10:05.828+0000","up_votes":1,"down_votes":2,"body":"im talking about new akali too?...","replies":[{"poster":"KennysDreamGirl","date":"2018-07-21T15:15:58.716+0000","up_votes":3,"down_votes":1,"body":"\"Akali can dash 3 times, shroud,\"\n\nno you aren't. for one, akali has only 2 dashes now and they are skillshots so she can miss the damage on them. shroud doesnt blink anymore and she doesnt have resets for ult.","replies":[{"poster":"Velzard of Koz","date":"2018-07-21T18:50:42.034+0000","up_votes":1,"down_votes":0,"body":"2 dashes? She can dash with E and twice with ult. She has MS boost towards circle, once she crosses the circle and inside shroud. The only ability not giving her any way to fuck up any skillshot-based champion is her Q.\n\nBut I do like the \"She must hit skillshot\" and \"Her ult has 120 cd\" excuses. There are champions who must hit 4 skillshots to do their job and those who have equally high cd on ultimate.\n\nEDIT: And this is excluding the backflip she does with E, lol.","replies":[{"poster":"KennysDreamGirl","date":"2018-07-21T22:23:37.862+0000","up_votes":1,"down_votes":0,"body":"ok ill take the l on this. I forgot about the e","replies":[]}]}]},{"poster":"ValentDs","date":"2018-07-21T11:33:14.662+0000","up_votes":3,"down_votes":1,"body":"new akali have 2 dash in 120 seconds...","replies":[{"poster":"StillHittinLicks","date":"2018-07-21T20:24:34.805+0000","up_votes":2,"down_votes":1,"body":"Her e is a dash too.","replies":[]}]}]}]}]}]},{"poster":"EinarUlfar","date":"2018-07-20T16:42:07.013+0000","up_votes":22,"down_votes":4,"body":"Boards often reacts to things at face-value.\n\nNew Akali has high CDs, conditional damage, and as a result she has a strong diving tool. The stealth isn't absurd IMO, neither is her map-wide pursuit/dash, it's conditional and she's gated by high CDs/energy costs.","replies":[{"poster":"yay nibbers","date":"2018-07-20T21:25:30.015+0000","up_votes":5,"down_votes":0,"body":"It's so dumb that people complain about map-wide pursuit when it's such a situational thing and more importantly *already done before.* Nobody complained when Warwick gained the ability to do it with his Q from his rework (which, incidentally, was also done by CertainlyT, though anyone complaining about CertainlyT will only ever mention Yasuo or Zoe), and I don't think I've ever seen anyone talk about how Zed and Kayn can do it with their ults.","replies":[]}]},{"poster":"Elkington VI","date":"2018-07-20T20:56:46.281+0000","up_votes":3,"down_votes":4,"body":"Probably because she no longer requires a target to get away from you now, which is especially annoying if you're playing a champ that's immobile or can't keep her locked down.","replies":[{"poster":"GrReaper96","date":"2018-07-20T21:57:30.864+0000","up_votes":9,"down_votes":0,"body":"Yeah but now you can also dodge her ult","replies":[]}]},{"poster":"Thefrostyviking","date":"2018-07-20T23:10:37.983+0000","up_votes":9,"down_votes":1,"body":"People are just flipping their tables because it looks like a functional rework for a hated champion.\n\n\nTo me it certainly looks like there is more counterplay possible for both sides and more interaction which are both good, but i guess that even people who realize this are rattled by her W working even under towers.\n\nI personally find that last part to be a bit much too x)","replies":[]},{"poster":"my nama jeff","date":"2018-07-20T22:06:38.386+0000","up_votes":7,"down_votes":0,"body":"people seem to forget that even before the rework akali is a very mobile champion","replies":[]},{"poster":"remakoro","date":"2018-07-20T16:09:38.210+0000","up_votes":4,"down_votes":23,"body":"> CONDITIONAL 600 range\n\nSuch interesting way to spell GLOBAL... \n\n>what's wrong with new akali's mobility?\n\nPerhaps that its now mobility? Her ult limited her in where she can dash. So it made her extremely predictably though very sticky.","replies":[{"poster":"Wulf Helhammer","date":"2018-07-20T16:24:35.933+0000","up_votes":19,"down_votes":4,"body":"> Such interesting way to spell GLOBAL\n\nYes, because there are so many instances where that will actually happen.\n\nIf you wanted to get nitty-gritty, Warwick also technically had a global dash, as his Q will follow stuff if you get the hold down, and then his ult can conceivable reach the dragon pit from blue base.\n\nDo those happen? Basically never.","replies":[{"poster":"remakoro","date":"2018-07-20T16:33:28.167+0000","up_votes":3,"down_votes":18,"body":"Her dash wont stop after 600 range and it will follow you for as long as it takes. \nGlobal dash on WW are pretty much a bug and quite hard to replicate. \nWhile what Akali has is pretty much Lee Sins Q. But with no limit to follow distance and with no limit to reactivation range. \nDo you see some difference?","replies":[{"poster":"Pika Fox","date":"2018-07-20T17:08:13.465+0000","up_votes":6,"down_votes":3,"body":"Akalis is basically the same as snowball in aram, just with a much shorter throw range. How often do you get a cross the map snowball after only landing it about half its max range? Exactly.","replies":[{"poster":"remakoro","date":"2018-07-20T17:18:03.620+0000","up_votes":4,"down_votes":13,"body":"Its like saying - how often do you hit Ezreals ult all the way across the map. From bot t1 to top t1. Rarely? Well then its not global.","replies":[{"poster":"Pika Fox","date":"2018-07-20T17:34:10.714+0000","up_votes":8,"down_votes":1,"body":"Her shuriken range is NOT global. Dash range AFTER you land it is.","replies":[{"poster":"remakoro","date":"2018-07-20T17:43:53.985+0000","up_votes":2,"down_votes":9,"body":"Good job repeating what i already said.","replies":[{"poster":"D357R0Y3R","date":"2018-07-20T18:07:40.663+0000","up_votes":10,"down_votes":2,"body":"what you said literally made no fucking sense\nezreal's ult is global because it's point and click area on ground\nakali's dash is only global IF SHE HITS YOU WITHIN 600 RANGE that's literally as different as lions and ants","replies":[{"poster":"remakoro","date":"2018-07-20T18:29:37.150+0000","up_votes":4,"down_votes":13,"body":">**akali's dash is** only **global**\n\nOh! SO IT IS GLOBAL.","replies":[{"poster":"D357R0Y3R","date":"2018-07-20T18:30:19.506+0000","up_votes":11,"down_votes":3,"body":"yes sir, she's going to teleport across the map like tf with a point and click spell and rip off your team's head\n\nyou have the art of being funny\ngj","replies":[]}]}]}]}]}]}]}]},{"poster":"The Space Cowboy","date":"2018-07-20T20:15:30.127+0000","up_votes":2,"down_votes":0,"body":"Right!? She’s going to globally dash to the enemy fountain. It reminds me of scarner going along for the ride with scion. Or poppy ultimate on scarner lol.","replies":[]}]}]},{"poster":"Netorare","date":"2018-07-20T18:12:03.923+0000","up_votes":7,"down_votes":1,"body":"At least she doesn't have a retarded windwall that blocks everything and doesn't have counterplay...","replies":[]},{"poster":"La Bello","date":"2018-07-20T23:24:41.045+0000","up_votes":7,"down_votes":2,"body":"for me its silly that people complain about Mobility creep on a ASSASSIN of all champs.\n\nMOBILITY ON A ASSASSIN IS LITERALLY THE ENTIRE REASON YOU ARE SUPPOSED TO PICK THEM.\n\na control mage can actually put out the same kind of high damage as an assassin but what sets them apart is that assassins have SUPERIOR mobility and target selection.\n\n{{champion:34}} {{champion:45}} {{champion:134}} {{champion:99}} {{champion:61}} {{champion:69}}{{champion:1}}  generally have insane enough damage at later stages of the game that they can kill in one rotation. Even {{champion:86}}  can go full Lethality and insta-gib a squishy target.\n\nWhat makes the entire class of assassins viable is that they have unmatched mobility or some sort of stealth that helps them pick off ViP. Its literally part of their class fantasy.\n\nIf you removed stealth or mobility from assassins there would literally be no reason to pick them over control mages or hyper scaling bruisers like {{champion:164}} {{champion:24}} {{champion:114}}","replies":[]},{"poster":"Teridax68","date":"2018-07-20T23:15:59.798+0000","up_votes":7,"down_votes":3,"body":"I don't speak for everyone, but the issue I've been taking so far with new Akali's mobility is that it looks much more difficult to outplay than the old Akali's. Old Akali had a ton of mobility, and so should the new one, but at least the near-totality of old Akali's mobility was unidirectional: she's great at getting into fights, but not so good at escaping them. This was a defining weakness of hers, and when on equal footing (which was admittedly rare), meant that she could be punished if she entered a fight at the wrong time. There are a ton of issues to her kit that make that counterplay a lot less clear (she's super stat-checky, for example), but that is nonetheless a clear, unique weakness among assassins.\n\nBy contrast, new Akali has three dashes that are completely free-targeted. What this means is that, if a fight doesn't go her way, she can just use her mobility to escape, which in turn means that she will now get complete control over when fights start and end. This would be okay if she had to be more opportunistic about when to engage or not, but this doesn't seem to be the case, particularly since most hypermobile champions we've seen so far are also excellent duelists. As such, the fear here isn't that new Akali is mobile, but that she's mobile in a way that will give her far too much agency over combat, to the detriment of champions who lack such agency, i.e. immobile champions.","replies":[]},{"poster":"AnAggravatedPimp","date":"2018-07-20T15:51:13.709+0000","up_votes":7,"down_votes":4,"body":"People saw CertainlyT and though \"overblown kit.\" They heard TRUE Stealth and though \"broken.\" So they merged the two concepts and ignored any weaknesses her kit has compared to the former.\n\nLike a conditional dash or stealth that just makes her unclickable but not immune to damage already in transit, AoE and that is in a donut shape so she has a set area of operation as opposed to that big circle from before.","replies":[{"poster":"Shiki Ryougi","date":"2018-07-20T16:41:41.977+0000","up_votes":3,"down_votes":6,"body":"> [{quoted}](name=AnAggravatedPimp,realm=NA,application-id=3ErqAdtq,discussion-id=3s4z9E9Q,comment-id=0001,timestamp=2018-07-20T15:51:13.709+0000)\n>\n> People saw CertainlyT and though &quot;overblown kit.&quot; They heard TRUE Stealth and though &quot;broken.&quot; So they merged the two concepts and ignored any weaknesses her kit has compared to the former.\n>\n> Like a conditional dash or stealth that just makes her unclickable but not immune to damage already in transit, AoE and that is in a donut shape so she has a set area of operation as opposed to that big circle from before.\n\nYou realize that's how all stealth works in regards to the targeting, right? There's no trade-off. It's a straight up buff because you can't reveal it at all now even under turret or with abilities that give 'true'sight.","replies":[{"poster":"Pika Fox","date":"2018-07-20T17:09:52.297+0000","up_votes":8,"down_votes":3,"body":"You can reveal her, you just cant target her.","replies":[{"poster":"LordGeovanni","date":"2018-07-21T22:42:22.793+0000","up_votes":1,"down_votes":1,"body":"No you cant reval New akali under any circumstances other than her using her own abilites or auto attacking nothing else will reveal her.","replies":[{"poster":"Pika Fox","date":"2018-07-21T22:46:06.182+0000","up_votes":1,"down_votes":1,"body":"False; You can reveal her, but you cant target her as a result. It will show you where she is and where shes going, and allow you to target her with AoEs and skillshots, but wont let you use point and click or autos (or towers to hit her)","replies":[{"poster":"LordGeovanni","date":"2018-07-22T15:13:01.662+0000","up_votes":1,"down_votes":1,"body":"So im watching all these youtube videos wrong then?","replies":[]}]}]}]}]}]}]}