{"poster":"D357R0Y3R","date":"2018-10-31T21:06:14.528+0000","title":"\"We don't want to kill top viktor\"-Meddler","subforum":"Gameplay","up_votes":4,"down_votes":7,"body":"Hahaha\r\n\r\nfor some reasons I love the bias\r\n\r\nTank ekko\r\nTank fizz\r\nthey were the pinacle of anti-fun BECAUSE IT IS NOT FUN TO FIGHT SOMETHING TANKY THAT DEALS A LOT FO DAMAGE HELLO?\r\n\r\nbut for some reason, you&#039;re only going to nerf top viktor damage a bit instead of killing it\r\nwhy not?\r\nI&#039;m sure a lot of people like to fight a character that is x2 more tanky than them with infinity shield while dealing as much damage than glass canon swain and runs at jhin&#039;s movement speed\r\n\r\nchrist","replies":[{"poster":"Olath Quortek","date":"2018-10-31T21:31:04.137+0000","up_votes":4,"down_votes":0,"body":"Viktor is meant to be a battle mage, which means they want him to feel good buying bruiser items. Fizz and Ekko are not, and as ADC eat dog food said, have an abundance of mobility and invulnerability tools and are meant to be burst assassins, not bruiser-y sustained damage dealers. He should be more compared to Swain or Vlad, both of which have sustain in place of Viktor's shields.","replies":[]},{"poster":"Jinzo Torrance","date":"2018-10-31T21:16:55.608+0000","up_votes":6,"down_votes":2,"body":"Those champ had mobility and invulnerability frames\nViktor doesn't\n\nIf Riot were to nerf tanky champs who deal damage they would gut every bruiser/diver/juggernaut","replies":[{"poster":"Fízz v2","date":"2018-10-31T21:35:18.083+0000","up_votes":3,"down_votes":1,"body":"Viktor has range and a spamable shield + speed boost \nThose champs dont","replies":[{"poster":"saltran","date":"2018-10-31T23:19:52.831+0000","up_votes":1,"down_votes":0,"body":"I mean, Ekko tank was even harder to kill than toplane Viktor right now imo.\n\nAnd it was bullshit that doesn't change that Viktor toplane should be removed aswell.","replies":[]}]},{"poster":"LeftyRaydy","date":"2018-10-31T21:24:50.166+0000","up_votes":2,"down_votes":1,"body":"If I remember A lot of the problems stemmed from the OP Iceborn Gauntlets at the time.","replies":[]},{"poster":"D357R0Y3R","date":"2018-10-31T21:53:57.187+0000","up_votes":2,"down_votes":2,"body":"Yea\n\nhe just has 13% max mana+26% ap shield every 2.2 seconds, AOE slow/stun\nand 30% movement speed boost\n\nhmm, AND RANGE","replies":[{"poster":"Jinzo Torrance","date":"2018-10-31T23:46:14.679+0000","up_votes":1,"down_votes":0,"body":"Yes, that seems about Viktor's kit.\n\nNow, you can damage Viktor without him blinking or going invulnerable while doing the damage so you can fight back and Riot is specifically nerfing the amount of damage he does when he chooses a tanky build (like they did for Fizz and Ekko) so what exactly is the problem here?","replies":[]}]}]},{"poster":"vgamedude","date":"2018-11-01T03:46:56.631+0000","up_votes":1,"down_votes":0,"body":"I like having Viktor top, I like anything that adds diversity to this stale game \n\nBut it is very ironic when they did a 180 on their bot lane diversity when mages started being a viable option bot but now that they go top its somehow fine.","replies":[]},{"poster":"Kingslayer Riven","date":"2018-11-01T00:54:36.886+0000","up_votes":1,"down_votes":0,"body":"It's almost like pseduo juggarnauts with range and or gapclose are op\n:thonking:","replies":[]},{"poster":"Fízz v2","date":"2018-10-31T21:34:01.370+0000","up_votes":2,"down_votes":2,"body":"Obvious difference: they are assassins and riot hates assassins lul","replies":[{"poster":"saltran","date":"2018-10-31T23:21:31.045+0000","up_votes":1,"down_votes":1,"body":"Dont dare you to say this on this ~~christian~~ mage boards.","replies":[]}]}]}