{"poster":"D357R0Y3R","date":"2018-05-19T14:52:04.957+0000","title":"Riot doesn't know how to balance Melee carries","subforum":"Gameplay","up_votes":50,"down_votes":13,"body":"Or carries in general\nthis game is going nowhere\nThe reason marksmen are meta is because of the combination of this:\n-insane laning phase against melees in 2v2\n-insane objective control\n-too safe making the lack of range a huge punishement\n\nNow the laning phase is being fixed with FFW nerf and base stats nerf\nAs an adc main I can testify that NOTHING can manage to properly lane bot lane against an adc+support\nnot even ranged mages because to apply pressure they need to use their spells and eventually will end up out of mana, while adcs can still basic attack if they don&#039;t have mana. And even if you manage to take a good trade against them they will sustain everything back.\n\nThe objective control is being nerfed because IE damage will only work against champions\n\nnow, we still have the third problem and this is where riot is fucking up so hard\nmarksmen are too safe, so what do we do to convince players to play melees? we turn them into tanks\n\nSpirit of shojin or idr the name is the example of this\n**I do agree that melees need ways to avoid damage** they&#039;re not ranged, they&#039;re melees and take risks. This is why I don&#039;t mind yasuo windwall, if he didn&#039;t have this he couldn&#039;t work because he would die instantly\nDo you realise the difference between this item and windwall? that&#039;s right, **one takes SKILL to use**. windwall needs a good timing, if you  use it for nothing the oppenents won&#039;t use spells against it and you won&#039;t absorb any damage, then since it has 20 sec cd you&#039;re going to get fucked up in teamfight.\nNow you give all melees, flat damage reduction WITHOUT DOING ANYTHING.\nWe already struggle to deal with Yasuo/Vayne with {{item:3046}} , so we decided to add even more free tankiness without any inbuilt counterplay\n\nYou know why melees work in Dota2? because they have this item called black king bar, where you have to activate it at the right time to dodge spells or cc, where if you don&#039;t use it in time you get chain cc&#039;ed (because unlike olaf ult you can&#039;t use it during ccs) and DIE.\n\nSpirit of shojin should have been a 350 hp morgana black shield on active instead of a retarded damage reduction\n\nBut you know what else is a problem?\n\n{{item:3031}} {{item:3087}} {{item:3094}} those items have the same problem\nonly stats, nothing should be used at the right time\nto a point where riot buffs crit cost when it&#039;s shit, then nerf it once again when it&#039;s overpowered, and will never ever balance crit\n\nI guess this is the state of the game, a game slowly returning to stat checking each others","replies":[{"poster":"Besteal","date":"2018-05-19T16:13:32.119+0000","up_votes":19,"down_votes":24,"body":"> Do you realise the difference between this item and windwall? that's right, one takes SKILL to use. windwall needs a good timing\n\nOh boy. Wind Wall takes skill now, huh?","replies":[{"poster":"Mordepool","date":"2018-05-19T16:19:50.871+0000","up_votes":26,"down_votes":4,"body":"He's does have a point.  Timing is important. More items with powerful actives less passives stat checks.  \n\n","replies":[]},{"poster":"D357R0Y3R","date":"2018-05-19T16:21:21.659+0000","up_votes":19,"down_votes":1,"body":"I guess? I'm watching those yasuo games in MSI and you  have Maple not using windwall against taliyah ult, while Kuro used it every single time against taliyah ult\nif two players do not do the same thing it means something separated them\n\nan item giving damage reduction without doing anything will not separate players","replies":[{"poster":"Ralanr","date":"2018-05-19T18:37:37.931+0000","up_votes":17,"down_votes":1,"body":"A very good point that I think a lot of people don’t take into consideration. \n\nI don’t like Yasuo, but even I understand that a good Yasuo player is vastly different from a regular Yasuo player. This I believe makes his champion design relatively great (minus my own personal issues which I won’t bring up) because it shows different player skill. \n\nHence why benefits that come from too passive abilities (like the spear) or champions that are “balls of stats” (like Pantheon) are bad design. They don’t have a real expression of master curve mechanically, only in macro.","replies":[{"poster":"LordGeovanni","date":"2018-05-21T02:29:55.754+0000","up_votes":1,"down_votes":0,"body":"In this same vane i dont fault the windwall in yasou's kit but rather that he has his passive shield absurd crit chance and spamable E too.\nOne thing is that windwall needs to start at some point not behind yasou and not delete things that have already halfway passed the winwall spawn point.","replies":[]}]}]},{"poster":"Z3Sleeper","date":"2018-05-19T23:23:42.271+0000","up_votes":1,"down_votes":0,"body":"Hehexd","replies":[]},{"poster":"Sun Wu Ryuumoku","date":"2018-05-19T21:50:02.066+0000","up_votes":1,"down_votes":0,"body":"yeah it take... same for using properly your spells.","replies":[]}]},{"poster":"Critmaster Garen","date":"2018-05-19T16:53:07.955+0000","up_votes":7,"down_votes":1,"body":"im not a big fan of the new spear item, but for the reason that it looks like it doesnt benefit the correct champions.\n\nthe new atmas clearly benefits juggernauts more than anyone else. we just love stacking large amounts of health to be able to stay alive long enough to get someone in melee range, live through cc, and enemy aoe teamfight ults, and then still keep fighting. the ramping up damage makes it fit very well for this type of champion.\n\nhowever shojin or what its called, looks like it was intended to be a diver item, and is probably going to be the most effective on some assassins instead. jhin is probably just going to straight up break it.\n\nit just doesnt seem diver specific enough.","replies":[{"poster":"mack9112","date":"2018-05-19T18:32:50.725+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=YlOXiOJd,comment-id=0003,timestamp=2018-05-19T16:53:07.955+0000)\n>\n> im not a big fan of the new spear item, but for the reason that it looks like it doesnt benefit the correct champions.\n> \n> the new atmas clearly benefits juggernauts more than anyone else. we just love stacking large amounts of health to be able to stay alive long enough to get someone in melee range, live through cc, and enemy aoe teamfight ults, and then still keep fighting. the ramping up damage makes it fit very well for this type of champion.\n> \n> however shojin or what its called, looks like it was intended to be a diver item, and is probably going to be the most effective on some assassins instead. jhin is probably just going to straight up break it.\n> \n> it just doesnt seem diver specific enough.\n\nJhin dosnt benefit from already stated","replies":[{"poster":"Raid Boss Morde","date":"2018-05-20T08:34:19.210+0000","up_votes":1,"down_votes":0,"body":"He still benefits from it, he just doesn't get the Dragon's Heart passive.","replies":[]},{"poster":"Percentages","date":"2018-05-20T02:47:39.436+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mack9112,realm=NA,application-id=3ErqAdtq,discussion-id=YlOXiOJd,comment-id=00030000,timestamp=2018-05-19T18:32:50.725+0000)\n>\n> Jhin dosnt benefit from already stated\nI thought they had to be close for the passive to proc or is it on hit? I know it refreshes on takedown.","replies":[]}]},{"poster":"Sun Wu Ryuumoku","date":"2018-05-19T21:52:26.832+0000","up_votes":1,"down_votes":0,"body":"i can't see any assassins having a better utility of this than a {{champion:62}}\n\nwill be garbage on range.","replies":[]}]},{"poster":"Blades of Navori","date":"2018-05-19T16:44:30.294+0000","up_votes":7,"down_votes":6,"body":"The vast majority of fighters that go in and unleash their combo like {{champion:164}} {{champion:92}} {{champion:24}} etc. just get murdered instantly after. Riven's shield exists to block damage as Camille's, but that doesn't mean they'll survive the engage, it just means they'll survive long enough to kill someone. Who would like a playstyle where you're just a kamikaze pilot? Nobody and I haven't liked it, you have to be extraordinarily good or the enemy has to misplay somewhere otherwise it's a one for one trade and why turn every fight into a 4v4? Melee carries should of course remain late game scaling champions with bad early games why is this an issue? That's why {{item:3053}} is getting a change. Can you imagine a Camille jumping into a fight, taking very little damage, **and** getting off her full combo so she is practically untouchable? They're removing damage from them to add more health and survability that's how balance works. Champions who use sterak's lose damage but can use Spear to survive.","replies":[{"poster":"TempName54846","date":"2018-05-19T19:17:31.244+0000","up_votes":5,"down_votes":0,"body":">Who would like a playstyle where you're just a kamikaze pilot?\n\nall the old rengar mains","replies":[{"poster":"saltran","date":"2018-05-20T07:28:27.126+0000","up_votes":1,"down_votes":0,"body":"Wait, old? I thought it was still the same.","replies":[{"poster":"TempName54846","date":"2018-05-20T14:10:12.618+0000","up_votes":1,"down_votes":0,"body":"he has his cleanse and health back and speedup shit now to potentially get up, back in the day he had nothing after the jump","replies":[]}]}]},{"poster":"D357R0Y3R","date":"2018-05-19T17:18:17.106+0000","up_votes":8,"down_votes":5,"body":"You are NOT MADE to engage a fight, that's the role of a tank\nif you're in the frontline and get murdered this is working as intended\n\nthe role of riven or jax is to get into the fight only when their tank cc'ed the enemy team and made sure they can enter without getting deleted\n\nAdditionally you talk about camille and jax, but act as if every single melee builds sterak+triforce atm\ndo you think darius cares about triforce? No, he's just going to build sterak and Shojin, be extremely tanky while dealing a huge amount of damage with sterak that will now **gives damage to his passive and ult** in addition to atma now\n\nand this is ridiculous, the answer to make melee carries viable is not to turn them into freaking tanks","replies":[{"poster":"TheCodeisCupCake","date":"2018-05-19T20:03:26.030+0000","up_votes":3,"down_votes":6,"body":"LOL? DID U SAY TANK? \n\n{{item:3153}} {{item:3036}} {{item:3033}} {{item:1416}} {{item:3151}} {{item:3071}}  New{{item:3031}} \n> Conqueror\n\n{{champion:67}} {{champion:63}} {{champion:122}} {{champion:86}} {{champion:202}} {{champion:141}} (Darkin){{champion:240}} {{champion:11}} {{champion:23}} {{champion:8}} \n\nBare in mind i haven't mentioned everyone thats good with conqueror, because they might very well fit in here. My point being tanks are just not the best pick right now. Riot is GIVING OUT true damage and % damage. Unless your a tank that can regenerate hp stupid fast \n ({{champion:36}} ) Or Darkin Kayn (which is also a tank killer), your gonna die the second you get close to the Ad carry or enemy bruiser because of, For example, Leona CC's you or maybe Brand (support)gets a Q off you while DOT'ing half your hp, Vayne chunks half your hp or Camille's 1k true damage Q, This is before any of the mages or jungles move.\n\nI know some of my facts are incorrect, Maybe your a tank that can engage and somehow stay alive ({{champion:12}} {{champion:27}} ). But these two are the only ones that come to mind Because of A) singed's 2k move speed with 4k hp and HP regen. B) Alistar's R, Which may become useless due to true damage not giving a shit about his dmg reduction.\nBut my point is, Tanks are literally incapable of doing the engages unless they regenerates shit tons of hp, engage-disengage and repeat(which i don't think makes you a tank) Or in the rare case (such as leona) CC you so much you can't fight back. So you cannot use the excuse, 'you will get murdered'.\n\nThis game is currently  'Who can murder the other one first?'","replies":[{"poster":"MAGA MAN X 2020","date":"2018-05-20T10:47:32.999+0000","up_votes":1,"down_votes":1,"body":"Tanks are useless in the current meta and it's only going to get worse because MOAR TRUE DAMAGE! Riot balance team is so fucking trash these days. Fire them all, make League great again.","replies":[{"poster":"sixhandsenpai","date":"2018-05-20T16:59:12.533+0000","up_votes":1,"down_votes":1,"body":"Agreed","replies":[]}]}]}]},{"poster":"saltran","date":"2018-05-20T07:29:31.818+0000","up_votes":1,"down_votes":0,"body":"If you pick the champs with strongest 1vs1 in the game and best split pushers in general they NEED to be less efective on teamfights or have any kind of weakness.","replies":[]},{"poster":"LDG Jiambles","date":"2018-05-19T21:42:43.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RuneBladeRiven,realm=NA,application-id=3ErqAdtq,discussion-id=YlOXiOJd,comment-id=0002,timestamp=2018-05-19T16:44:30.294+0000)\n>\n> Who would like a playstyle where you&#x27;re just a kamikaze pilot?\n\nAP Kamikaze Rammus is insanely fun. It's certainly not viable in high elo serious ranked games, but its a great way to have a bit of fun.","replies":[]}]},{"poster":"THE RlVER KlNG","date":"2018-05-19T16:39:16.757+0000","up_votes":9,"down_votes":4,"body":"that spear of sojin item can burn in hell on anyone.","replies":[]},{"poster":"Teridax68","date":"2018-05-20T00:02:25.390+0000","up_votes":5,"down_votes":1,"body":"I think part of the problem with melee champions in League right now is that the game is so oversaturated with cheap anti-melee gameplay, that melee champions need something equally cheap and overly strong to have a chance at carrying. The reason we have bullshit mechanics on champions like Yasuo, Nasus, Yi, etc. is because that is the amount of power required for them to even stand a chance of surviving teamfights, let alone have real agency past mid game. Frequently, even this is not enough, as champions like Nasus and Yasuo, both intended to be carries, tend to fall off precisely because they're still not good at teamfighting. Tanky champions in League still get melted far quicker than in any other MOBA, and the sheer amount of CC around, particularly CC that is easy to apply at melee range, means it's not all that uncommon for melee champions in teamfights to find themselves stunlocked for their entire lifespan. In this respect, because there is so much that melee champions can't really outplay, the quickest solution to have them carry would indeed be to give them something with equally little counterplay.\n\nPersonally, though, I agree that this is a terrible mode of balance, and I'd much rather Riot made a real effort to balance the game properly around melee champions, instead of trying to pull a Dota 2 and respond to something broken with another, equally broken set of mechanics. Right now, the game is very clearly balanced around ranged champions in mind, as there are a whole bunch of mechanics that screw over melee champions automatically, or otherwise act as if all champions were at a certain distance from each other. Even some melee champions are balanced in complete ignorance of other melee champions, which is why so many juggernauts tend to auto-win melee combat whenever they're strong. On top of that, the fact that every champion has, on average, one hard CC and one soft CC effect, often more than that, means that in combination with CDR creep it's not particularly costly or difficult to dump all of that CC onto any incoming melee champion. This is made all the worse by the fact that these mechanics are often conveyed through skillshots, as opposed to ground-targeted effects or the like, which cause those effects to have fine counterplay at a distance, but little to none at point-blank range. Coupled with the excessive amounts of damage overall in the game, and it's effectively impossible for a melee champion to do their job of going into heated group fights without either getting obliterated, or having to pull some obscene shit like total unstoppability, damage immunity, and so on.\n\n**TL;DR:** As long as League continues to have too much damage, too much CC, and too much of it conveyed through mechanics with little to no counterplay at melee range, melee champions, especially melee carries, will never be able to function properly without having some equally unfair mechanics in response. Spear of Shojin offers one such mechanic, one I think is a band-aid to the larger problem that will only make the overall environment less healthy in the long run. If Riot truly wants fighters, melee carries, etc. to be more viable, then they need to do a game-wide pass where they desaturate all of the excessive damage, crowd control, possibly CDR, etc., that has been added to the game over time, and reevaluate what remains to make sure it has outplay potential at melee range. Only then will melee champions be able to function properly without requiring low-counterplay mechanics of their own each time.","replies":[]},{"poster":"Verxint","date":"2018-05-19T19:36:26.120+0000","up_votes":5,"down_votes":2,"body":"Melee carries work in DotA because of far more than BKB. It's not even a required item.\nThey work because ranged autoattacks don't dictate lane control at level 1, damage block items with melee bonuses exist, melee heros have MASSIVE base stat advantages over ranged heros, and ranged heros don't get kiting, self peel, long range, mobility, and high dps all in one.","replies":[{"poster":"Spank the Fox","date":"2018-05-19T23:30:11.207+0000","up_votes":2,"down_votes":0,"body":"Okay, one, kiting isn’t a benefit in the same way mobility and high range are. Kiting is gameplay mechanic found in all classes if your range matches/exceeds your opponent, eg every ranged character with ranged abilities can kite. Even Melee champs can kite if they have decent ranged skills.\n\nSo ignoring kiting, a lot of ranged heroes in DotA do have self peel, good range, mobility and DPS if they purchase certain items. Drow’s kit is a massive fuck you to all non-spell immune enemies + Shadow Blade. Hurricane Pike is self-peel for any ranged right clicker to buy.\n\nMelee carries work in DotA because turn rate, overtuned stats and a lot of brainless mobility, hard CC and crits built into their kits. Having inherent crit in your kit is far superior than having to a waste a precious item slot on crit. Ranged heroes in DotA have more access to DPS, mobility, and self peel, even when their kit has NONE, than any League champion can dream of.","replies":[{"poster":"Verxint","date":"2018-05-19T23:57:22.162+0000","up_votes":2,"down_votes":1,"body":"They have items they can purchase to cover their weaknesses - that's fine. Champions like Tristana have all of that built into their kit so they can simply stack the most DPS possible. At least you have to buy the hurricane pike.\nThey also don't have strong early games like Caitlyn or Xayah with a strong lategame. Carries with strong early games in DotA don't scale nearly as hard as their counterparts in league.","replies":[{"poster":"Spank the Fox","date":"2018-05-20T01:38:31.968+0000","up_votes":1,"down_votes":0,"body":"Sure, in DotA, you won’t have Quinn boning Darius all lane long, instead they’ve opted into tri-lanes to deny the farming carry even harder than League’s standards.\n\nCarries in League are largely fine. Melee’s here are only bad because Riot’s design philosophy (counterable at all stages of the game) favors range. If we gave Yi and Tryn hard CC and better crit steriods, they’d run over any ranged champion in a heartbeat. Yasuo is already some proof what happens when you give a melee carry some agency.\n\nRanged champions should be slippery and fragile. Melee should be made more durable, but the problem is obscene damage and being durable is a huge turn-off for League’s community.","replies":[]}]}]}]},{"poster":"honzakiec","date":"2018-05-19T23:12:01.556+0000","up_votes":1,"down_votes":2,"body":"I am main too. My lane was dying. I was useless in every game. No matter if I had 1/12 or 12/1, better ADC always won. Now I see how my lane is useless. But other lanes are completly dying and I still cant understand how Riot can buff something different than ADCs. Now the meta I will love come true. I was bullied by them since ardent cancer meta and now I can take a revenge.","replies":[{"poster":"BigFatYak","date":"2018-05-20T08:54:50.813+0000","up_votes":3,"down_votes":0,"body":"You watch too much anime","replies":[]},{"poster":"honzakiec","date":"2018-05-19T23:12:28.001+0000","up_votes":1,"down_votes":1,"body":"*top","replies":[]}]},{"poster":"The Yetii Rider","date":"2018-05-20T00:02:17.782+0000","up_votes":1,"down_votes":5,"body":"> Spirit of Shojin should have been a 350 HP Morgana Black Shield on active\n\nYou mean the item we already have in the game? {{item:3814}}","replies":[{"poster":"D357R0Y3R","date":"2018-05-20T00:14:32.053+0000","up_votes":4,"down_votes":0,"body":"No that's not morgana black shield, unless you don't know what morgana black shield does","replies":[{"poster":"The Yetii Rider","date":"2018-05-20T04:05:26.647+0000","up_votes":1,"down_votes":0,"body":"So you literally just want to give divers CC immunity for 5 seconds? What happens to Olaf then?\n\nThis is a good item. It will help full damage melee carries survive as long as they need to to kill their enemies.","replies":[{"poster":"D357R0Y3R","date":"2018-05-20T10:26:56.350+0000","up_votes":2,"down_votes":0,"body":"it's a **SHIELD** that can be broken\n\nthis means the melee who builds it needs to time it at the perfect time to block a cc else the shield gets broken and he gets cc'ed and dies","replies":[]}]}]},{"poster":"Soulslasher1","date":"2018-05-20T08:18:39.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=YlOXiOJd,comment-id=0006,timestamp=2018-05-20T00:02:17.782+0000)\n>\n> You mean the item we already have in the game? {{item:3814}}\n\nNah it is {{item:3156}}","replies":[]}]},{"poster":"Nanuk Pihoqahiak","date":"2018-05-20T04:10:42.430+0000","up_votes":2,"down_votes":0,"body":"I've often wondered if they could make a melee only Doran's item that had a short cooldown ranged active that could be used to execute minions.  This would allow them to farm, without the item being used to abuse other melee, and would allow them to actually do something in ranged matchups.  Maybe even go as far as adding it as a rune?","replies":[{"poster":"BigFatYak","date":"2018-05-20T08:54:08.122+0000","up_votes":2,"down_votes":1,"body":"Sir, I bring to you: the minion dematerialzer. I agree, it needs a CD and not charges, but heck, it exists.","replies":[{"poster":"Nanuk Pihoqahiak","date":"2018-05-20T21:13:03.280+0000","up_votes":1,"down_votes":0,"body":"I'm aware that it's a thing.  I think the game could use way more options for melee, though.","replies":[]}]}]},{"poster":"Kelg","date":"2018-05-20T20:57:08.745+0000","up_votes":1,"down_votes":0,"body":"And marksmen are point and click stat checks that you have no way of outplaying as an immobile melee, whats your point? Even if crit was removed, ADCs would still be able to build {{item:3124}} and stuff while 3 champs exist on their team only to peel for them. Fun game.","replies":[{"poster":"egOrhythm","date":"2018-05-21T06:28:06.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=YlOXiOJd,comment-id=0010,timestamp=2018-05-20T20:57:08.745+0000)\n>\n> And marksmen are point and click stat checks that you have no way of outplaying as an immobile melee, whats your point? Even if crit was removed, ADCs would still be able to build {{item:3124}} and stuff while 3 champs exist on their team only to peel for them. Fun game.\n\nImmobile melee? Name one that's not a tank/juggernaut/support.\n\nCuz pretty much every single melee carry has a gap closer of some kind: blink, teleport, dash, leap, jump, w/e. Take a 6 item Yi into a 6 item ADC and you'll disintegrate them with one Q and two autos.","replies":[]}]},{"poster":"JustcallmeSoul","date":"2018-05-21T06:13:31.130+0000","up_votes":1,"down_votes":0,"body":"Keep in mind that Riot balances the game around what they make money doing. All players get skins, professional players get balance updates.","replies":[]},{"poster":"ToddnK","date":"2018-05-21T05:46:26.894+0000","up_votes":1,"down_votes":0,"body":"Riot doesn't know how to balance*\n\nFTFY","replies":[]},{"poster":"MorganFreemanBot","date":"2018-05-21T01:51:14.350+0000","up_votes":1,"down_votes":0,"body":"These items are the EXACT way to balance melee carries, with one caveat.\n\nThey're not melee exclusive.\n\nLack of melee exclusivity has been a plague upon Riot's balance for ages, because any item which is good on melee winds up being better on ranged due attack range being nothing but a bonus.\n\nThis has been the problem with NUMEROUS items introduced to help melee; Gauge & Ruined King are great examples of items designed and implemented with the intent of being 'for melee', which were subsequently brutalized because of ranged abusers.","replies":[]},{"poster":"Shiznyte","date":"2018-05-20T19:26:57.771+0000","up_votes":1,"down_votes":0,"body":"Black king bar sounds a lot like Edge of night and or QSS...","replies":[]},{"poster":"ChimeraQ","date":"2018-05-20T10:28:33.690+0000","up_votes":1,"down_votes":0,"body":"I'm fairly new to league, I played like 50 games or less.(so please take want I say with a grain of salt) And after reading a the entire first page of comments. It seems like majority of people are more pissed at the available items at champions disposal rather than how specific champions stats actually play out. And that makes sense to me because some items are completely useless or just overly good. As a noob sifting through 100 items and finding out that specific characters are broken because of 1 or 2 items it feels pretty deterring to try other build and flat out dumb. \n\nI think riot needs to change their focus from individuals or specific classes and veiw their entire item list. I know it's not a perfect solution but I think if you can tune AND NARROW items for specific purposes and lay off nerfing and buffing champions every week to month I think a more stable meta can emerge, or at the least show what characters actually need stat changes.","replies":[]},{"poster":"Ryusaether","date":"2018-05-20T08:29:01.839+0000","up_votes":1,"down_votes":0,"body":"I agree with you, but now think about the item design:\n\nIt baing an acrive would mean that you could get the AD based dmg reduction whenever you activate it. This would make it abusable by squishies who won't ever get mear 3 enemies but could use the amolified reduction in other scenarios.\n\nIf they can make it so that if you activate it when in the middle of 3 enemies you get the bonus, fine, but good luck telling when you're exactly in 500 range and not fuck up because when you activate it someone flashes or blinks, and you wasted an active. If they can make it like Morg's R so you can't waste it if there aren't 3 people in that range then fine. But going into pressing the item button in the middle of the fight is the thing they specifically said they wanted to avoid with this item","replies":[]},{"poster":"Soulslasher1","date":"2018-05-20T08:14:10.282+0000","up_votes":1,"down_votes":0,"body":"Honestly from what I've been reading and my personal opinion tanks are virtually useless . I mean you will get a lucky game that you have a good tank that can actually survive. In our time right now I can honestly say that building armor and magic resistance is pointless you would be better off buying 3 Warmog's a steraks gauge a pair of ninja Tabis or mercury treads and a gargoyles stone plate. Be with items like liandry's torment lord Dominik's regard or mortal reminder practically makes everything you built to be tanky with nullified.","replies":[]},{"poster":"Hyquiem","date":"2018-05-20T05:51:43.561+0000","up_votes":1,"down_votes":0,"body":"But then no ones looking at how much mages get hurt. But melees should get the spear items b/c no should have to deal with being ahead and bursted when trying to fight. They only way they could Ever balance crit is by making the damage greater in terms of resistance so if some one has 450 armor the crit damage should be great, while if some one has 55 armor crit damage should not be harsh but low.","replies":[]},{"poster":"l Ryden l","date":"2018-05-20T05:41:30.828+0000","up_votes":1,"down_votes":0,"body":"From what I've gathered over the years of playing dating back to Riven's release I've noticed every fighter type champion has been designed with repeatable mobility with a low cooldown and momentary survivability. \n\nSince then we've seen \n{{champion:24}}  dodge become timed \n{{champion:114}} old and new Riposte (both timed)\n{{champion:157}} wind wall\n{{champion:92}} shield duration reduced\n{{champion:164}} passive and ulti i-frame\n{{champion:5}} current ulti\n{{champion:141}} ulti intangablity\n{{champion:39}} current W\n\nGenerally these skills will trigger a fight or flight decision, do I expend this moment to go even and get a kill or two? Or do I just let it end and make a run for it?\nAfter choosing one or the other, you're more like to stick to that decision as those abilities tend to have long cooldowns. After which they become extremely vulnerable. Some more than others. \n\nSo I would say that those changes have been methods of correcting this stat-check gameplay.\n\nHowever some still exist in the form of \"I'm going to do this thing, and 1 of two things are going to happen. 1) I'm going to win this fight because I'm 1 whole kill ahead of you or 2) I'm not going to lose because I'm still 1 whole kill ahead of you.\"\n\n{{champion:23}} {{champion:11}} {{champion:78}} {{champion:10}} {{champion:2}} {{champion:77}} {{champion:80}} {{champion:48}} \n\nMany times when going against the latter group, almost any choice you make in order to stay even may be incredibly regretful. But when playing as them\nthey tend to not have as much of an exposed weakness than the former group. The latter group have kits with contingencies to fall back on such as lifesteal/healing/resets/passive triggers whereas the first group mentioned need to purchase/build in order access to them.","replies":[]}]}