{"poster":"Akesgeroth","date":"2018-04-18T13:12:02.419+0000","title":"What... What did you do to Malzahar?","subforum":"Gameplay","up_votes":20,"down_votes":4,"body":"Oh my god. I stopped playing for 8 months and I come back to 3 nerfs to his ult, 2 nerfs to his Q and a slight nerf to his E. Why? What the hell warranted this?","replies":[{"poster":"HaIlMonitor","date":"2018-04-18T14:00:44.276+0000","up_votes":30,"down_votes":1,"body":"He saw pro play.","replies":[{"poster":"Bioness","date":"2018-04-18T16:17:15.468+0000","up_votes":17,"down_votes":0,"body":"> [{quoted}](name=HaIlMonitor,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=0002,timestamp=2018-04-18T14:00:44.276+0000)\n>\n> He saw pro play.\n\nWhere all champs go to die.","replies":[]},{"poster":"AirKingNeo","date":"2018-04-18T22:05:58.218+0000","up_votes":7,"down_votes":0,"body":"and also he was broken in high elo for invalidating people with R.","replies":[{"poster":"deadlychuck","date":"2018-04-19T02:16:09.559+0000","up_votes":2,"down_votes":1,"body":"Ironically only AFTER his trash rework","replies":[{"poster":"AirKingNeo","date":"2018-04-19T22:58:07.834+0000","up_votes":1,"down_votes":0,"body":"not really. The issue was his R, not his passive.\n\n1300 gold taxes are pretty broken.","replies":[]}]},{"poster":"revliledpembroke","date":"2018-04-19T03:40:11.205+0000","up_votes":1,"down_votes":0,"body":"Yeah, but that's his shtick. You'd think pro players would know how to deal with it. It hasn't exactly changed all that much since he was first introduced.","replies":[{"poster":"AirKingNeo","date":"2018-04-19T22:57:46.658+0000","up_votes":1,"down_votes":0,"body":"Pay a 1300 gold tax.","replies":[]},{"poster":"Automated Riven","date":"2018-04-19T06:01:23.102+0000","up_votes":1,"down_votes":0,"body":"except that the way top level players played around it was with cc. Which now you need 2 or 3 forms of hard cc to stop it. and or 2 spells and 1 hard cc. This is not only extremely difficult to micro manage with other players, but by the time 3 seperate abilities have hit him the damage has already been done. Now that banchees was changed to an AP item (garbage change imho) it left malz in a state where he simply cannot be even remotely viable because of it combined with his passive.","replies":[]}]}]}]},{"poster":"Kelg","date":"2018-04-18T13:32:44.209+0000","up_votes":23,"down_votes":2,"body":"> [{quoted}](name=Akesgeroth,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=,timestamp=2018-04-18T13:12:02.419+0000)\n> What the hell warranted this?\n\nHis R","replies":[{"poster":"OverpoweredSoap","date":"2018-04-18T20:35:35.960+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=0000,timestamp=2018-04-18T13:32:44.209+0000)\n>\n> His R\n\nWith the combination of his new passive which made it harder to poke him out of lane if he plays correctly. \n\nHis new passive is stupid tbh.","replies":[{"poster":"Heckin Support","date":"2018-04-19T01:22:57.277+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=OverpoweredSoap,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=00000001,timestamp=2018-04-18T20:35:35.960+0000)\n>\n> With the combination of his new passive which made it harder to poke him out of lane if he plays correctly. \n> \n> His new passive is stupid tbh.\n\nThis is honestly his biggest issue IMO.\nHis passive is *very* opressive. Makes it hard to poke, trade, basically do anything. His passive is so strong to the point they have to lower the power of the rest of his kit. It's the Sejuani issue all over again where her ult was so strong the rest of her kit had to suffer.","replies":[]}]},{"poster":"FlyingRoboticCow","date":"2018-04-18T13:42:03.023+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=0000,timestamp=2018-04-18T13:32:44.209+0000)\n>\n> His R\n\nthis","replies":[]},{"poster":"Malix Farwin","date":"2018-04-19T11:13:06.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=0000,timestamp=2018-04-18T13:32:44.209+0000)\n>\n> His R\n\nMore specifically \"The Ultimate Hat\".","replies":[]}]},{"poster":"Zéychin","date":"2018-04-18T18:30:47.604+0000","up_votes":16,"down_votes":0,"body":"They created a champion which is broken. Broken doesn't mean overpowered, it means that he has a kit that is very binarily overpowered or underpowered, based on the numbers attached to his kit or the items/runes he uses. The issues are his passive and his ult being on the same champion, along with easy and mana efficient waveclear patterns.\n\nThese issues are most apparent in melee low-range or poor waveclear mage matchups. He AFK shoves you into tower because his waveclear becomes mana efficient very quickly and if you try to fight back, you have to pop his passive first. Once you pop his passive, you really hope his jungler isn't nearby because if the jungler is there, he pops ult and you die with about 95% certainty. You have trouble getting wards out because you've been stuck under your tower attempting to deal with his waveclear. Even if he never kills you, he forces many champions to remain under tower until it is gone unless you have considerable jungle pressure. Sure, you can try to gank him, but his passive will deny the initial engage and his minion wave will probably be under your tower, so it may not even be gold efficient to try to kill him.\n\nNo, not every matchup works this way, and players with stronger game knowledge and effective jungle pathing/pressure can abuse him, but it's enough of a problem in enough scenarios that they had to gut him. This is without even mentioning that his Flash R with his passive and Banshee's Veil preventing his ultimate from being stopped is a near-guaranteed kill in teamfights in solo queue because not all five enemy players will have a QSS or a Mikael's Crucible on the support.\n\nMalzahar was better off, balance-wise, before his rework. Now he is destined to either be permaban status or drastically underpowered, based on how his kit numbers are adjusted or the items and runes he uses are adjusted.\n\ntl;dr: I hope to see his passive changed to a different effect entirely or even a full revert to his prior kit, so that he is allowed to be a champion again.","replies":[{"poster":"DW Diana","date":"2018-04-19T00:44:08.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illaominati,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=0005,timestamp=2018-04-18T18:30:47.604+0000)\n>\n> They created a champion which is broken. Broken doesn&#x27;t mean overpowered, it means that he has a kit that is very binarily overpowered or underpowered, based on the numbers attached to his kit or the items/runes he uses. The issues are his passive and his ult being on the same champion, along with easy and mana efficient waveclear patterns.\n> \n\nActually his issue is his W and his ult. His passive is not only fine but needed but I'll get to that in a sec\n\n> These issues are most apparent in melee low-range or poor waveclear mage matchups. He AFK shoves you into tower because his waveclear becomes mana efficient very quickly and if you try to fight back, you have to pop his passive first\n>\n\nKill his void spawns and his wave clear and mana efficiency are gone. You can even tank his space aids early withough taking much damage on most champions as it scales well of ap but has a pretty low base damage. This again really screws up his wave clear and leaves him manaless very quickly. Having done this a simple auto attack will bread his passive for 20 second leaving plenty of time to gank. Malz mains often see this as a prelude to a gank so will back right off allowing to to farm at will even when your jg is not near. Malz is super immobile and any cc you can throw at him is potentially fatal.\n\nWhat malzahar lacks as the moment is solo kill pressure. It's been that way since last season when they destroyed his voidlings. To compensate for it the buffed his ult meaning all of his kill pressure resided on his point and click stun. Then this season they nerfed everything but his voidlings leaving him in the sorry state he's in now.\n\nIn conclusion they need to make his voidlings good again which will mitigate the nerfs to his ult and make him viable once more. His voidlings should have the movement speed towards targets of his e returned, as well as a attack speed increase/extra damage effect as well. This will mean his ult is no longer his only means of killing people. At this point it can be changed to a beam channelled slow rather than hard cc, maybe with a silence included, and his q can be a form of actual cc (like most mages he should have some way to cc that doesn't rely entirely on his ult)\n\nAnywho, rant over, it's nothing that hasn't been said by 10-15 other malz mains on the forums over the last 6 months and riot will no doubt continue to ignore it.","replies":[{"poster":"deadlychuck","date":"2018-04-19T02:15:28.656+0000","up_votes":1,"down_votes":0,"body":"Simple solution rework him. \n\nWith the same design, and maybe slightly lower Q and R numbers, that existed on him at the start of 2016. They didn't solve any of the problems with the rework, they just justified the champion being enough of a problem to gut him.","replies":[{"poster":"DW Diana","date":"2018-04-19T11:12:00.888+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=deadlychuck,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=000500000000,timestamp=2018-04-19T02:15:28.656+0000)\n>\n> Simple solution rework him. \n> \n> With the same design, and maybe slightly lower Q and R numbers, that existed on him at the start of 2016. They didn&#x27;t solve any of the problems with the rework, they just justified the champion being enough of a problem to gut him.\n\nI agree. He needs a mini rework/revert like ahri/lb just got. His W needs to go back to when his voidlings were scarey (people used to run from them, now they just auto attack)","replies":[{"poster":"deadlychuck","date":"2018-04-19T21:30:46.697+0000","up_votes":1,"down_votes":0,"body":"To clarify, the MYMU happened mid 2016, so this would be a revert, and the voidlings on his W would be gone. Back to his passive and his current problematic passive would be gone.","replies":[{"poster":"DW Diana","date":"2018-04-20T08:33:21.341+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=deadlychuck,realm=NA,application-id=3ErqAdtq,discussion-id=zGKyvLjf,comment-id=00050000000000000000,timestamp=2018-04-19T21:30:46.697+0000)\n>\n> To clarify, the MYMU happened mid 2016, so this would be a revert, and the voidlings on his W would be gone. Back to his passive and his current problematic passive would be gone.\n\nI was thinking when they dicked his voidlings last year but if there was something earlier than that then sure. It can't be any worse then now lol","replies":[]}]}]}]}]},{"poster":"deadlychuck","date":"2018-04-19T02:13:29.989+0000","up_votes":1,"down_votes":0,"body":"Actually it's the combination of his Ult, W, and Passive. \n\nIt makes him too safe, and the extra damage during the ult was new and insanely strong. Instead of just dealing E + R damage (and sometimes Null zone damage), the new malz dealt E + W + Null Zone + R Beam damage. \n\nWith the Old QSS and champion, it was possible to literally remove all the damage of his combo if done well (granted most malzahar players learned to bait the QSS with E, then R), because it removed ALL debuffs. \n\nNow his lack of consistency means that they have to balance around the average damage of the combo, meaning that it will swing either extremely high if it's consistent or extremely low if it's inconsistent. This exacerbates any nerf/buff given to him. \n\nWith respect to his passive, it's honestly not good for purpose, it's pretty shit outside of lane, but the lane use to be his main weakness. Fighting to not over extend, but also having zero defense and being terrible at 2v1 or even 2v2 fights.","replies":[]}]},{"poster":"Zane Zephyr","date":"2018-04-18T17:09:24.331+0000","up_votes":11,"down_votes":0,"body":"Threw him in the gutter because they put too much power in his passive at the mage update so they constantly nerfed him ever since then. It sucks.","replies":[{"poster":"RainXBlade","date":"2018-04-19T22:35:33.336+0000","up_votes":1,"down_votes":0,"body":"If they could revert that passive, that would be great. I'm still asking myself on why Riot added a spell shield to Malzy when in the first place, he didn't need one.","replies":[]}]},{"poster":"nm1010","date":"2018-04-18T16:18:56.904+0000","up_votes":7,"down_votes":0,"body":"My favorite part is when the enemy jungler builds cinderhulk and I can never get my w to do damage while they are around (it insta kills voidlings).","replies":[]},{"poster":"DW Diana","date":"2018-04-19T00:26:17.199+0000","up_votes":5,"down_votes":0,"body":"They killed him, sent him back to the void, and are now kicking his corpse. Every mage player is currently up in arms about the nerfs to mages riot has proposed, while anyone who is a malz main is so used to having they favourite champion skull fucked by riot that they barely notice it anymore.\nI actually tested building adc items on him and got an extra 400-500 damage out of him just auto attacking when compared to his full ap ult combo.\nWelcome back!!!!","replies":[]},{"poster":"iTaLenTZ","date":"2018-04-18T13:57:05.459+0000","up_votes":4,"down_votes":0,"body":"I have been asking this question for 3 years now. Can't believe its been so long since they fucked up his rework.","replies":[{"poster":"OP Garen Support","date":"2018-04-18T19:57:30.617+0000","up_votes":1,"down_votes":0,"body":"They gutted him in season 7 though.","replies":[]}]},{"poster":"Dope Solo","date":"2018-04-19T03:17:49.506+0000","up_votes":2,"down_votes":1,"body":"Faker died. LC$$$$$$$$$$$$$$$$$$$$$$$$. I feel like the changes to MalzR were warranted, but its sad what it took to finally get it fixed. ","replies":[]},{"poster":"Killer of Night9","date":"2018-04-18T22:52:43.281+0000","up_votes":2,"down_votes":1,"body":"His ult instead of a suppress should've a slow...\nThis will make him to get again a good Q and a ult that actually deal damage.\nThey \"fix\" ryze problem giving to him a slow instead of Flash + CC and i think this is the right way to bring his damage back...\nLike now his ult reward nothing than \"Get a QSS then i become useless\".","replies":[]},{"poster":"Newbie128749","date":"2018-04-20T00:34:54.567+0000","up_votes":1,"down_votes":0,"body":"he was extremely powerful in general, dominated both soloq and pro play","replies":[]},{"poster":"Schenix","date":"2018-04-19T22:50:18.239+0000","up_votes":1,"down_votes":0,"body":"His new passives existence sharing a power budget with his R.","replies":[]},{"poster":"DW Diana","date":"2018-04-19T11:06:54.831+0000","up_votes":1,"down_votes":0,"body":"I swear guys, his passive isn't all that. One auto and it's gone. What's he gunna respond with pre 6? If he uses q then just auto him again. If he uses e w then just walk away happy in the knowledge he just screwed his csing and gave you 3g. Again it does very little damage so you shrug it off.\nHis passive gives him something his lack of mobility and cc doesn't: a chance to live a little longer.","replies":[]},{"poster":"FrostQueensPlane","date":"2018-04-19T10:27:32.150+0000","up_votes":1,"down_votes":0,"body":"Repetoir happened.  90% of his reworks have been reverted btw but not this one.  Oh and he got promoted.  Best turn back now there's nothing but death waiting for you in this game.","replies":[]},{"poster":"ÈvilMorty","date":"2018-04-19T05:28:59.658+0000","up_votes":1,"down_votes":0,"body":"All he did was press R and he won games so nerfs","replies":[]},{"poster":"Sire Hippington","date":"2018-04-19T00:26:55.372+0000","up_votes":1,"down_votes":0,"body":"His new passive combined with his R, a rather longranged point n click lockdown with next to no counter as the first cc you throw to him gets absorbed by the passive.","replies":[{"poster":"INoble KnightI","date":"2018-04-19T01:09:34.417+0000","up_votes":1,"down_votes":0,"body":"{{item:3140}}","replies":[{"poster":"Sire Hippington","date":"2018-04-19T02:15:32.659+0000","up_votes":1,"down_votes":0,"body":"1350g that doesn't built into anything if you aren't an adc\nIt sure helps, but you can't afford to rush it so the first ~15min of the game his flash ults are a save kill if he works well with his jungler, and even if QSS is buyed, his sole existence delays the built off his opponents by 1350g...that's a total of 6750g if everyone gets QSS","replies":[]}]}]},{"poster":"deadlychuck","date":"2018-04-19T02:06:38.068+0000","up_votes":1,"down_votes":0,"body":"What are you talking about? Don't you know they fixed him back in 2016? \n\nHe's no longer a balance problem like he was before, so now they can nerf his Q and R damage (which clearly wasn't possible, before not enough \"levers\").","replies":[]},{"poster":"revliledpembroke","date":"2018-04-19T03:42:57.786+0000","up_votes":1,"down_votes":1,"body":"Who knew that giving him a passive where he occasionally has 99% damage resistance and ignores CC would break him? Oh, wait, LITERALLY EVERYONE ON THE PLANET!","replies":[]},{"poster":"Dead flag blues","date":"2018-04-18T20:37:00.260+0000","up_votes":3,"down_votes":3,"body":"Zed mains who can't buy a qss","replies":[]}]}