{"poster":"Was 1 Deutscher","date":"2019-03-06T16:57:39.829+0000","title":"Was soll man da machen?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Es macht keinen Spaß mehr. Ich kann in diesem Spiel einfach nicht besser werden.\r\n\r\nWenn ich Jungler spiele, spiele ich Nunu.\r\n\r\nIch ganke Mitte Level 2 mit Red Buff. Ahri immer noch Level 1 ich fange sie ab. Sie rennt in den Dschungel nach unten dann zurück nach oben zum Tower.. wir bekommen sie auf 10% und Olaf auf 30% ohne groß Schaden zu nehmen.\r\nIch gehe dann weg damit wir nicht durch Ahri die vielleicht in dem Moment Level 2 wird von dem Charme in den Tower gezogen werden (also nach hinten zurück in den Dschungel um bei Olaf weiter zu machen) irgendwie schafft es dieser Veigar dann aber so lange sich falsch zu positionieren um in der 2vs1 Situation immer noch solange da zu stehen um eine Axt von Olaf ab zu bekommen. Natürlich sah ich das voraus und bin ihm hinterher. Er flasht, Olaf hinter. Ahri Level 2.. ich werde vom Charme getroffen und sterbe auch.\r\n\r\nNach dieser Situation habe ich die Mitte 5x versucht zu ganken und Ahri immer wieder in Gefahr gebracht.. leider kontrollierte Olaf dabei die ganze Map in der Zeit. Botlane war er nie. Nur mal Toplane wo ich eh nie hin ging. Also hatte ich die Chance Mitte zu gewinnen und dann mit Veigar irgendwie zu versuchen den Drake zu contesten..\r\n\r\nTja wie gesagt.. also ich erkläre es mal. Ein Jungler hat bis er Level 5,6 oder 7 ist ca. 5 gute Ganks die er verteilen kann um nicht zu viel zu ganken bzw. sinnlos nicht vom Level abzufallen. Diese habe ich alle in die Mitte gesteckt da es die Lane mit der meisten Killpressure war. Ohne Erfolg.\r\n\r\nIrgendwann war Olaf dann 4/0 und das ist genug von einer KD her um mich im Dschungel zu kontrollieren. Er war ja schon 2/0 nach den ersten paar Minuten.. da geht ein 4/0 echt schnell.. nicht meine Schuld.. jedenfalls konnte ich den Dschungel nicht contesten. Er hat mich nicht counterjungelt aber dabei hatte er natürlich free spot auf Drake und die kleinen Krabben im River. Ich verstehe das die Leute auf Gold 4 keine Ahnung vom Drachen haben. \r\n\r\nDaher war er auch nie gewarded.. generell versuche ich nicht den Drachen zu contesten außer ich sehe mein Spiel liegt auf dem Elo schon 10 Kills vor..\r\n\r\nSorry.. aber wenn ein Spiel zu der Zeit schon 10 Kills hinten liegt weiß ich es einfach aus Erfahrung > die Leute können es nicht. Bottomlane ist meist die \"idc lane\" Mitte versagt dann 1on1 in dem Fall und auf der Toplane hast du zwar wen gutes aber der dann am flamen ist.. kann ich auch verstehen..\r\n\r\nWenn du ein Game gewinnen willst musst du a) ADC sein und dein Jungler super, mitte Super und dann auf der Bottomlane einfach nur folgen und nicht verkacken.\r\n\r\nDas Problem als ADC ist das ich dort oft die nerven verliere weil ich oftmals keine Synergie mit meinem Support habe. Ich vertraue leider leider leider wirklich meinen Supports nie. Sorry. Ich traue mich nicht oftmals rein zu gehen weil ich denke es ist ein Gank wenn jemand wild aggressiv spielt ohne vorher zu warden. Am liebsten poke ich einfach solange bis der gegner dann auf 10% ist und finish dann aber ich mag keine 100 zu 0 engages außer wir haben eine combi wie leona ezreal wir haben wards ich hab cds up.. oder der gleichen.. sonst mache ich so etwas nicht..\r\n\r\nworauf ich aber keine lust habe sind games als adc wo ich farme farme farme und ich mich versuche zusammen zu reißen aber dann auch wieder vom team abhängig sind weil niemand grouped.. das wort ist ja heute sowieso ein fremdwort. die leute wissen einfach nicht mehr wann und wie man grouped. sie wissen es nicht.\r\n\r\nich weiß nicht wieso aber ich habe das gefühl das hat einfach extrem stark abgenommen. ich erlebe viele teams die einfach wie aufgescheuchte hühner durch die gegend rennen unterstreichen tut das sowieso die mentalität das niemand mehr lust darauf hat zu gewinnen wenn man schon 10 kills zurückliegt. da merkt man. es nimmt ab. \r\n\r\nanders ist es aber in spielen wo ich dann der 0/7 nunu bin und von meinem veigar bestärkt bekomme \"klar können wir das gewinnen\" nach dem der einfach keinen einzigen kill in der mitte bekommt nach dem ich 5x ganke. ja olaf war echt gut und hat auch immer gecountert.. aber veigar hat die lane ja dennoch 1o1 schon vorher verloren..\r\n\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Nordwolf87","date":"2019-03-07T05:42:15.804+0000","up_votes":3,"down_votes":0,"body":"Möglicherweise solltest du auch die Jgl Basics wiederholen.\n\nDu gankst die Lanes die\n\na) guten Dmg haben oder\nb) guten CC haben oder\nc) der/die gegner schlechten Escape haben/immobil sind\n\n1. Deine Riven hat die Toplane gestomped. Dh sie hatte wohl die meiste Zeit Lane Priority besonders gegen eine Kayle. Dh Herald müsste ziemlich free gewesen sein. Setz ihn auf die Toplane zur gewinnenden Splitpusherin und die gegner *müssen* reagieren, da sonst ihr Base weg ist.\n\n2. Warum gankst du eine Ahri? Sie hat a) guten escape und b) veigar scaled von alleine durch seine Passive, wenn er einfach nur farmt und poked.\n\n3. Deine Botlane hatte mit Thresh guten CC umd mit Sivir guten Dmg. Ja Ezreal hat einen guten escape...aber Nami nicht. Da hätte man wohl einen pick machen können und anschließend einen Drake oder Tower.\n\n4. Wenn du siehst, dass Olaf um Topside Jgl herumspielt, klau ihm auf der Botside seine Camps während er Riven ganked.","replies":[]},{"poster":"Awsane","date":"2019-03-06T18:40:03.502+0000","up_votes":2,"down_votes":0,"body":"Bei dem 1. Play bei dem du gestorben bist, den Veigar sterben lassen damit du eben nicht stirbst und es so snowballt. Man kann auch versuchen ihn wegzupingen. Gerade dann, wenn du schon siehst, dass er nicht gut spielt \n\n> irgendwie schafft es dieser Veigar dann aber so lange sich falsch zu positionieren um in der 2vs1 Situation immer noch solange da zu stehen um eine Axt von Olaf ab zu bekommen. Natürlich sah ich das voraus und bin ihm hinterher.\n\nIn solchen Scenarios auch nicht so viele Ganks in einen schlechten Spieler stecken sondern farmen und/oder andere lanes/Counterganks Prioritisieren.","replies":[]},{"poster":"Pure Cynicism","date":"2019-03-07T16:38:05.553+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Was 1 Deutscher,realm=EUW,application-id=YnZkMR0R,discussion-id=izRuanxZ,comment-id=,timestamp=2019-03-06T16:57:39.829+0000)\n>\n> Nach dieser Situation habe ich die Mitte 5x versucht zu ganken und Ahri immer wieder in Gefahr gebracht.\n\n1. Lektion als Jungler: Never gank a losing lane. Das Spiel lebt seit jeher vom Snowball. Wenn zwei Lanes verlieren, musst du die dritte snowballen und nicht einer verlorenen Lane noch mehr Gold hinterherzuwerfen.","replies":[]}]}