{"poster":"Was 1 Deutscher","date":"2018-10-06T02:19:57.101+0000","title":"Die Zukunft von Esports, Scouts - ein Spieler muss gefördert werden.","subforum":"Esports","up_votes":1,"down_votes":7,"body":"Ich sage ich bin, war - gut in League of Legends. Viele andere Spieler wissen wahrscheinlich das selbe wie ich..\r\n\r\nWarum werden wir nicht besser? Was hat Mathematik damit zu tun? Sind die 1% besten Spieler der Welt in League of Legends wirklich besser als ich? Nun, sie neigen zu weniger Fehlern, darum gewinnen sie und sind statistisch besser.\r\n\r\nWas unterscheidet einen Spieler der es wei&szlig; und einen der es macht? Passion? Geduld? Einen gro&szlig;en Willen zum Ziel haben wir alle. Sonst w&uuml;rden nicht so viele Spieler beleidigen. Aber warum werden wir nicht besser?\r\n\r\nFinde einen Lehrer und &uuml;be was du kannst.\r\n\r\nNun.. da w&auml;ren wir nun auf einer alten chinesischen Lehrmeister Tradition. Wollen es viele nicht? Kann ich wirklich besser werden wenn ich nicht beleidige? Muss ich meine Grenzen erkennen? Gebe ich auf?\r\n\r\nIch frage mich aus einem soziologischen Aspekt daraus, wie wahr diese Antwort sein kann. Es ist nach wie vor ein Teamspiel das verh&auml;ltnism&auml;&szlig;ig nicht als solches gef&ouml;rdert wird. Wenn ich lese, das ein Challenger Spieler sein ganzes Team muted.. dann frage ich mich zu welchen Bedingungen man Stolz darauf sein kann in League of Legends etwas erreicht zu haben. Stolz bin ich auf mich, wenn ich meinen Champion spielen kann. Das k&ouml;nnen mittlerweile sehr viele Spieler! Hut ab!\r\n\r\nAber es f&auml;ngt eine Art Stagnation an. Die Grenzen nach oben werden immer schmaler. Es werden nur noch die gut.. die mit dem Gegner spielen.. ich habe letztens gegen welche gespielt die extrem viel ausgewichen sind und damit meine Nerven blank gemacht haben und mich nebenbei dennoch angegriffen haben. Ich denke die m&uuml;ssen wahrscheinlich erst 15 oder so gewesen sein. Top frisch f&uuml;r solche Games.\r\n\r\n(es ist ein Unterschied ob ich gut in League of Legends bin oder ob ich Elite Soldat bin / von meinem Nervensystem) ein alter Mann kann vieles leisten.. ein junger optimal programmierter Mensch m&uuml;sste man sein, um aus dieser Meta momentan das beste zu holen. Ich sehe das sich diese Spieler, nervlich, einfach noch viel schneller generieren k&ouml;nnen. Muss mir aber vorstellen das es unseren K&ouml;rper eine Tonne kostet diese Spielweise so aufrecht zu erhalten. Der Rest von dem Spiel, also selbst die Challenger Spieler machen zwar &quot;gute Plays&quot; aber sie sind nicht auf dieser geistig jungen Psyche von manchen sehr jungen Spielern. 14-15 Jahre alt, die dritte Generation des Internets.\r\n\r\nDaher meine ich ist es immer noch eine Sache mehr daraus geworden &quot;ob man sich das geben will&quot;.\r\n\r\nKlar, es ist ein Spiel. Ich spiele dieses Spiel vielleicht einfach zu viel, konzentriere mich wirklich darauf besser zu werden. Auch wenn ich alle Matchups ca. wei&szlig;.. und so weiter.. ist der Wille zum Sieg eben nicht mehr da.. da mal n Fehler.. hier einer.. &quot;die Gro&szlig;e Erf&uuml;llung&quot; ist es nach 8 Seasons nicht mehr. Vor allem nicht nach 2000 Spielen vielleicht. :D\r\n\r\n\r\nIst es also die Frage.. wie kann ich mich verbessern.. ist es nicht aber dennoch eine allgemeine Frustration, die jeder Spieler besitzt &quot;ich bin auf mich alleine gestellt / es ist eigentlich ein Teamspiel?\r\n\r\nIch meine ganz wirklich. Jeder sagt dir &quot;um die Solo Q zu gewinnen spiele selbst am besten.\r\n\r\nWas ist das denn f&uuml;r eine Ellbogenmentalit&auml;t? Ja. Ich soll mich auf mich konzentrieren.. hei&szlig;t das ich sehe meinem Teamkameraden beim sterben zu und sage &quot;deine Schuld?&quot; hei&szlig;t das ich renne wie auf Heroin durch das Spiel, schreibe gar nichts und versuche eine 30/0 KDA zu erlangen?\r\n\r\nWo ist denn die Grenze zum Spa&szlig; und Humanen wenn es immer mehr als Erfolg angesehen wird in dem Spiel gut zu sein aber auch hier wieder die individuelle F&ouml;rderung versagt? \r\n\r\nAnders als in unserer gegenw&auml;rtigen Situation mit dem Schulsystem haben wir in League of Legends wirklich ein System wo man sagen kann: Ich nehme den Champ und die Lane! Die soziale Abh&auml;ngigkeit ist aber nicht mehr gegeben. Ich f&uuml;hle mich ehrlich gesagt sehr frustriert in dem Spiel durch den Punkt meinen Mitspielern nicht vertrauen zu k&ouml;nnen. \r\n\r\nAus eigener Schuld, trotz das ich gerne Tanks spiele.. spiele ich immer Assasinen (Meta eben) das aus dem Punkt resultiert das ich denke &quot;naja, da gankst nicht der trifft den Stun nicht, der trifft das nicht..&quot;\r\n\r\nIch bringe lieber selbst alles mit zur Party und sorge daf&uuml;r das es nicht schief gehen KANN. Das ist meine Spielweise. \r\n\r\nVielleicht sollte ich mich daher wirklich dem Meta entgegensetzen und versuchen mehr mit meinem Team zu kommunizieren, an es zu appellieren und zu hoffen. \r\n\r\n\r\nIch sage damit auch nur.. der generelle Aufbau der Spiele ist momentan nicht f&ouml;rderungsm&auml;&szlig;ig. Bei so viel sprachlicher Gewalt ist es keine Grundlage einen Spieler zu f&ouml;rdern. Ich m&ouml;chte nicht das der Esport genauso wird wie die Stra&szlig;en von Afrika, F&ouml;rderung ist hier genauso wenig da weil niemand bei vorbelasteten Menschen sucht.\r\n\r\nWarum muss dieses Meta so sein? Warum sind die alle so aggressiv? Warum entwickelt sich dieses Spiel so?\r\n\r\nMeiner Meinung nach ist es immer noch weil die Karte zu klein und der Schaden zu gro&szlig; ist. \r\n\r\nIch frage mich sowieso wieso League of Legends nach so langer Zeit im eSport Bereich immer noch die selbe Karte spielt.. \r\n\r\nWorld of Warcraft.. andere Spiele.. wieso ist es immer noch die selbe Karte? Seit ein paar Jahren. Da kann man doch etwas ver&auml;ndern das die Spieler andauernd an andere Sachen adaptieren lassen muss. Denn der Mensch ist so aufgebaut dass er es nicht schafft sich sp&auml;ter in kleinen Bereichen zu verbessern. Ich meine Formel 1 - dort sind die Fahrer so das man nicht mal blinzeln kann so wenig liegt zwischen ihrem K&ouml;nnen und trotzdem [...]\r\n\r\nIch frage mich einfach gerade im Interesse der Menschheit. Wo wollen wir denn noch besser werden in diesem Spiel?\r\n\r\nDieses Spiel regiert noch immer eines der besten Online Games der Welt und ihr entwickelt es nicht weiter. Sch&ouml;n wenn neue Menschen auf das Spiel sto&szlig;en. Aber was ist mit den alten Spielern? Haben wir nicht mal etwas neues verdient?\r\n\r\nWarum habt ihr das Monopol daf&uuml;r und entwickelt es nicht? Was ist denn an neuen Karten so schwer? An Moden wo Spieler abh&auml;ngig davon sind wenn sie von sich gegenseitig profitieren? \r\n\r\nWeil die Menschen das nicht spielen wollen? No way. Sie m&uuml;ssen es nutzen. Au&szlig;erdem habt ihr das Monopol. \r\n\r\nEs ist die Pflicht den Menschen mal etwas neues zu bieten. \r\n\r\n\r\n\r\nIch wei&szlig; nicht wie viele schei&szlig; Spiele ich schon in diesem Spiel gespielt habe. Ich vermisse diese Befreiung von dem Sinn her &quot;Oh das ist Cho&#039;Gath&quot; - nein, das ist ja nicht mehr Cho&#039;gath, das ist ein Champion den ich ausw&auml;hle der gerade im Meta ist oder nicht.\r\n\r\nMeine Spielweise ist nicht mehr die das ich sage &quot;Ich bin auf dem Schlachtfeld der Legenden und ich habe den Champion gew&auml;hlt&quot; nein, es ist nur noch &quot;mein one Trick Pony&quot;. \r\n\r\nWas ich einfach nur noch damit verbinde ist Frustration, vielleicht bin ich einer der sich schnell entwickelt und schneller lernt als andere und ihr merkt das noch nicht. Aber.. es wird kommen. Das ist keine gute Richtung. Ich merke das ich mit meinem Denken sehr alleine bin. Das ist schei&szlig;e. Denn MIR ist langweilig. Sobald man sich aufregt h&ouml;ren einem Menschen ohnehin nicht mehr zu.\r\n\r\nAber wo ist dieser mystische Punkt? \r\n\r\nFehlt mir vielleicht meine Arbeit im Leben? Das n&uuml;chterne damit ich das hier zu sch&auml;tzen wei&szlig;? Ich kann auch f&uuml;r etwas brennen.. ich muss nicht n&uuml;chtern sein.. schei&szlig;e man was ist los mit dieser Welt.. \r\n\r\nIn den letzten Jahren war eine Sache in meinem Kopf vorhanden: Improvement, improvement, improvement. Nur. Ich glaube nicht das es der Welt anders geht denn sie diktatiert es uns VOR. Manche sind anf&auml;lliger, manche weniger, manche m&uuml;ssen noch eine menge lernen..\r\n\r\n\r\nIhr denkt euch bestimmt ich rede ohnehin nur irgendwelchen Bl&ouml;dsinn. \r\n\r\nIch habe viele Sachen gesehen.. \r\n\r\nIch wei&szlig; gerade nicht mal mehr was ich in League of Legends will. Ja eigentlich nichts. Es hei&szlig;t nicht das ich gehen will bevor mich jetzt wieder so ein Randliner hier antritt. Es ist einfach nur noch.. \r\n\r\n\r\n\r\n\r\nIch w&uuml;rde mir w&uuml;nschen das die Karte von League of Legends neu wird. Neu und gr&ouml;&szlig;er. Die Spieler m&uuml;ssen wieder gr&ouml;&szlig;ere Distanzen davon legen um sich z.B von Kills zu erholen oder von ihrer Lane zu sonst was.. das w&uuml;rde dem Spiel extrem gut tun (dem Moba Prinzip in seiner jetzigen Form) das diese Karte gr&ouml;&szlig;er wird.","replies":[{"poster":"Pure Cynicism","date":"2018-10-06T06:49:10.507+0000","up_votes":3,"down_votes":0,"body":"Du solltest dich erst mal fragen, WARUM du dich überhaupt verbessern willst. League kann auch Spaß machen, wenn man sich bewusst nicht verbessern möchte. Meiner Meinung nach macht es gerade dann umso mehr Spaß, je weniger man sich Mühe gibt.","replies":[]},{"poster":"Humpelstilzche","date":"2018-10-06T06:20:14.197+0000","up_votes":3,"down_votes":0,"body":">  Ich soll mich auf mich konzentrieren\n\nDas bedeutet, dass du auf deine eigenen Fehler achtest, nicht die anderer. Das hat nichts mit der Art und Weise zu spielen zu tun, es hat mit Fehleranalyse zu tun. \n\n> Wo ist denn die Grenze zum Spaß und Humanen wenn es immer mehr als Erfolg angesehen wird in dem Spiel gut zu sein\n\nDas muss jeder für sich entscheiden, wie wichtig der Erfolg in League ist. Erfolg in League ist für mich so weit wichtig, dass ich in jedem Spiel versuche zu gewinnen, sogar Arams. Mir ist es allerdings nicht wichtig, einen hohen Rang zu haben. Für andere vielleicht schon. Und für wieder andere ist unter Umständen noch nicht einmal das Gewinnen super wichtig. Das muss jeder für sich entscheiden und ja, das kann auch so weit gehen, dass es nicht mehr um Spaß geht. Das ist in League nicht anders als in jedem anderem Sport. Um an der absoluten Spitze zu stehen, muss eben manchmal der Spaß ein wenig leiden. \n\n>  Ich fühle mich ehrlich gesagt sehr frustriert in dem Spiel durch den Punkt meinen Mitspielern nicht vertrauen zu können. \n\nSuch dir ein Team oder einen Freundeskreis in Leauge, wenn dir das wichtig ist. League ist einfach ein anderes Spiel, wenn man es mit Freunden spielt. \n\n> Warum muss dieses Meta so sein? Warum sind die alle so aggressiv? Warum entwickelt sich dieses Spiel so?\n\nKurz zusammengefasst:\na) Das Meta entwickelt sich organisch und häufig chaotisch auf Grund von unzähligen Faktoren als allgemein anerkannte effektive Spielweise\nb) Weil die Kombination aus PvP, die Wichtigkeit von Skill und das stark verzahnte Teamplay eine Situation schaffen, in der Aggression leicht entstehen kann.\nc) Wie?  \n\n> World of Warcraft.. andere Spiele.. wieso ist es immer noch die selbe Karte?\n\nDas kann man natürlich nicht so verallgemeinern, aber tendenziell neigen Spieler dazu, das Spiel zu verlassen wenn sich grundlegende Aspekte des Spiels, das sie so sehr lieben, bis zur Unkenntlichkeit verändern, insbesondere wenn diese Änderungen um der Änderung willen passieren und nicht gut begründet sind und einen Gameplay-Vorteil bringen.  \n\n>  Wo wollen wir denn noch besser werden in diesem Spiel?\n\nTaktik und Teamplay. \n\n> ihr entwickelt es nicht weiter\n\nDas ist schlicht und einfach nicht korrekt. Alle zwei Wochen kommt neuer Content. Es gibt fast kein Spiel das so regelmäßig weiter entwickelt wird wie Leauge. Und ich sage das als jemand, der von der Konkurrenz, einer Firma die ebenfalls Free2Play-Spiele vertreibt, kommt: Riot sind wohl die besten Live Producer, die es in der Branche gibt. \n\n> Was ist denn an neuen Karten so schwer? \n\nViel. Geringer Nutzen, kaum bis gar kein Monetarisierungswert, extremer (!) Aufwand für Art, bei paralleler Verwendung mehrer Karten Zersplitterung der Community und längere Queue-Zeiten. Das sind nur einige der Nachteile. \nDavon mal abgesehen...sind Nexus Blitz und Odyssey an dir Vorbei gegangen? \nDu hast dir einen SEHR ungewöhnlichen Zeitpunkt ausgesucht um dich darüber zu beschweren, dass Riot keine neuen Karten und Modi bringt. Ausgerechnet jetzt, wo Riot gerade erst in kurzem Abstand zwei neue Modi mit neuen Karten rausgebracht hat?\n\n> Meine Spielweise ist nicht mehr die das ich sage \"Ich bin auf dem Schlachtfeld der Legenden und ich habe den Champion gewählt\" nein, es ist nur noch \"mein one Trick Pony\". \n\nDas ist aber deine persönliche Entscheidung. Ich spiel immernoch worauf ich Lust habe. \n\n>  vielleicht bin ich einer der sich schnell entwickelt und schneller lernt als andere und ihr merkt das noch nicht.\n\nWenn du Leute erreichen willst, kann ein wenig mehr Bescheidenheit nicht schaden. Aussagen wie die obige lassen dich extrem arrogant und unsympathisch wirken...und kommen außerdem nie von Leuten, auf die diese Aussagen tatsächlich zutreffen. \n\n> Ihr denkt euch bestimmt ich rede ohnehin nur irgendwelchen Blödsinn. \n\nTeilweise, ja. Du hast offensichtlich versucht dich gewählt auszudrücken, was teilweise ordentlich schief gegangen ist und außerdem dazu geführt hat, dass vielen deiner Aussagen der tatsächliche Inhalt fehlt und, ohne deine Gedanken lesen zu können, tatsächlich ein wenig wie Blödsinn wirken. Ich bin mir sicher du hast dir sehr viele Gedanken gemacht, aber du hast sie leider nicht sehr klar zu Papier (bzw. Forum) gebracht.","replies":[]},{"poster":"MeMyselfandBaal","date":"2018-10-06T05:40:08.860+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Was 1 Deutscher,realm=EUW,application-id=hGYdiTd1,discussion-id=6UAoMoHz,comment-id=,timestamp=2018-10-06T02:19:57.101+0000)\n>\n> Ich w&amp;uuml;rde mir w&amp;uuml;nschen das die Karte von League of Legends neu wird. Neu und gr&amp;ouml;&amp;szlig;er. Die Spieler m&amp;uuml;ssen wieder gr&amp;ouml;&amp;szlig;ere Distanzen davon legen um sich z.B von Kills zu erholen oder von ihrer Lane zu sonst was.. das w&amp;uuml;rde dem Spiel extrem gut tun (dem Moba Prinzip in seiner jetzigen Form) das diese Karte gr&amp;ouml;&amp;szlig;er wird.\n\nFangen wir mal mit der Antwort auf das Ende an: Weil die Karte von LoL absurd gut gebalanced ist. Also die Frage, auf welcher Seite du startest (abgesehen von dem einen oder anderen schlechten Profi Patch) kaum Einfluss auf den Ausgang des Spieles hat. \n\nGerade wo du von Distanzen sprichst: Die sind halt, Stand jetzt, genau ausgemessen. Und genau heißt hier: Du hast nach dem frühen Tod deines Gegners genau so viel Zeit um deinen Vorteil auszunutzren.\n\nWenn man die Karte vergrößern würde, müsste man als nächstes alles andere anpassen. Oder Teleport entfernen, denn je größer die Map, um so mächtiger ist \"Fast Travel\"... Derzeit ist die Karte noch so klein, dass Teleport noch nur im Profibereich OP ist. Wenn du jetzt zur Karte 20% Fläche (womit auch immer man die füllt) hinzufügt, kannst du (abgesehen vom Jungler) die Summoner Spell Auswahl auch abschaffen... weil dann jeder Teleport braucht. Oder du überlegst das anders auszugleichen... was auch nur wieder zum Endergebnis führst: Wenn du irgendwas an der Map änderst, musst du so viele Dinge beachten, dass es echt ausartet...\n\nAlso überlege dir einfach nur mal, wie die Profi-Jungler ursprünglich reagiert haben, als die Krabbe nur noch auf einer Seite des Jungles erscheint. Klar, die haben auch überreagiert, aber deren Ansage war ein \"Nimm einen Champion, der auf Level 2 richtig gut ist, geh zur Krabbe, gewinne das Spiel\"... Weil Riot ein Detail an der Karte geändert hat, haben alle eine übelste Meta-Katastrophe erwartet... Ähm... dann lasst es doch lieber so wie vorher...","replies":[]},{"poster":"SvenniGod2004","date":"2018-10-06T02:22:19.794+0000","up_votes":2,"down_votes":0,"body":"Steht die Mauer etwa wieder? Sieht ganz so aus^^","replies":[]},{"poster":"Was 1 Deutscher","date":"2018-10-06T02:39:26.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SvenniGod2004,realm=EUW,application-id=hGYdiTd1,discussion-id=6UAoMoHz,comment-id=0000,timestamp=2018-10-06T02:22:19.794+0000)\n>\n> Steht die Mauer etwa wieder? Sieht ganz so aus^^\n\n\nWas meinst du damit xD {{item:2050}} ","replies":[]}]}