{"poster":"Kehiski","date":"2019-07-28T21:03:26.124+0000","title":"5ping test ma 50ms in gioco Perche?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Come dal tittolo ho fatto un test nello speedtest del Ookla e mi risulta 5ping 90Mbs+ Download e 90Mbs+ Upload, connessione Wind e fibra, sono pure vicino in centro di Bologna che dovrebbe avere una buona connessione.\r\nOra mi chiedo come puo essere possibile?\r\nCosa posso fare?\r\n\r\n{{sticker:sg-janna}}","replies":[{"poster":"Kehiski","date":"2019-07-29T16:24:45.466+0000","up_votes":1,"down_votes":0,"body":"Un mese fa giocavo con 27 di ping (stabile) nella mia vecchia casa con la fibra fastweb, distante 4Km da dove sono ora.\nNon penso che possa essere un problema di posizione nel mio caso (?)","replies":[]},{"poster":"XPY99","date":"2019-07-28T21:49:39.500+0000","up_votes":1,"down_votes":0,"body":"Prima di tutto devi capire cos'è il ping, che può essere definito semplicemente come il tempo che passa tra quando chiedi un informazione al server e quando effettivamente la ricevi\nOokla misura il tempo che ci mette un singolo pacchetto a fare il tragitto casa -server -casa il server a cui ti appoggi dipende dalla zona (in media 2 per regione anche se può capitare che si venga collegati a quelli di roma/milano)\nLol invece va a misurare il tempo di comunicazione con i loro server  che però sono ad amsterdam per i giocatori euw, quindi un certo ping c'è sempre\n\nQuindi per rispondere alla tua domanda 50 di ping è normalissimo, la mia connessione su ookla è 1 di ping, 900 download e 300 upload, eppure in gioco ho un ping di 40/45, dall italia difficilmente avrai un ping inferiore ai 30/35","replies":[{"poster":"Linkimaru 2099","date":"2019-07-29T07:03:51.176+0000","up_votes":1,"down_votes":0,"body":"Io a milano ho un Ping di 25 abbastanza stabile, in ogni caso sono abituato a giocare anche con 50/60 di Ping (tipo adesso che sono in Sicilia dai miei) e la differenza c’è ma ti ci abitui facilmente dopo un paio di giorni.\n Mi chiedo comunque come sia possibile che a milano abbia 25 di Ping forse perché ho la ftth mentre giù ho la ftts perché per il resto la velocità di down/up è circa uguale così come il gestore che è tim in entrambi i casi.","replies":[{"poster":"XPY99","date":"2019-07-29T13:44:22.068+0000","up_votes":1,"down_votes":0,"body":"La differenza è dovuta dalla distanza da amsterdam, più è grande e più è alta, dalla sicilia anche con la ftth non penso scenderesti sotto i 40","replies":[]}]}]},{"poster":"dragonskiller49","date":"2019-07-29T08:51:32.271+0000","up_votes":1,"down_votes":0,"body":"lo speed test di connette al server di Milano, i server di Riot Europa stanno a Berlino mi pare","replies":[]},{"poster":"Zataηηa","date":"2019-07-29T08:12:10.257+0000","up_votes":1,"down_votes":0,"body":"Io mai avuto un ping più basso di 45 su LoL.\nE anche a me dal ping test risulta inferiore, sui 17.\nL’unica cosa realmente bassa sono i frame xD ma vabbe, quello dipende dalla carriola del mio pc suppongo","replies":[]},{"poster":"Luckynanix","date":"2019-07-28T21:06:26.200+0000","up_votes":1,"down_votes":0,"body":"Lol usa moooolta più connessione ma sembra comunque strano.\nComunque con 50 ms è possibile giocare tranquillamente.\nProva con altri giochi e al massimo contatta il tuo provider","replies":[]},{"poster":"Kian987","date":"2019-07-28T22:30:40.461+0000","up_votes":1,"down_votes":1,"body":"È come lamentarsi del fatto che per andare da Roma ad Amsterdam ci vuole molto più tempo che per andare da Roma Latina. Comunque sia non è **SOLO** un fatto di distanza ma non sto qui a spiegare i dettagli. La banda, diversamente da come hanno scritto altri, non c'entra una mazza con il ping.\n\nLascia che ti dia il miglior consiglio che tu possa ricevere. Non essere un feticista del ping. Con 50ms si gioca bene. Vuoi di meno? Trasferisciti davanti al datacenter dove ci sono i server di LoL. Ha senso secondo te? Ovviamente no. E allora smettila di guardare il ping e gioca contento.\n\nSon 15 anni che gioco al PC e da altrettanti anni leggo inutili discussioni sul perché il ping sia X piuttosto che Y. Se anche ti spiegassi scientificamente perché il ping è esattamente quello che hai, non potresti comunque far **NULLA** per cambiarlo. Tanto vale risparmiarsi la fatica a me di spiegarlo e a te di capirlo perché, come già detto, non farebbe alcuna differenza. 50ms hai e 50ms avrai :)","replies":[]}]}