{"poster":"Darth Lumiya","date":"2015-02-13T00:14:23.854+0000","title":"Kha Zix Evolutionsthema verfehlt","subforum":"Champions & Gameplay","up_votes":3,"down_votes":0,"body":"Guten Tag,\n\nwie man sicherlich schon weiß ist bei Kha Zix die Evolution der Kern des Champs.\n\nLeider finde ich persönlich, dass man das nicht gut gelöst hat. Zum einen ist der entwickelte Q zu unberechenbar um ihn wirklich Wirkungsvoll einzusetzen, zudem störte mich schon immer, dass man nicht alle Fähigkeiten ausbauen konnte.\n\nDaher habe ich mir seit einiger Zeit ein paar Gedanken gemacht.\n\nZum Q:\n\nIch habe damals den Wegfall des Prozentschadens auf dem Q mit großen Murren zur Kenntnis genommen. \n\nDaher habe ich mir das so vorgestellt, dass Kha Zixs Q sich mit der Zeit immer weiter verstärkt und zwar abhängig davon, wie viele Jungle Monster er tötet. Der Q wird also, durch töten von Jungle Monstern immer stärker (ähnlich wie das Stacken von Mejais oder bei der Träne). Die Grundwerte und Skalierungen bleiben gleich und werden auch nicht durch das Töten von Monstern beeinflusst. Lediglich der %Schaden des Q erhöht sich pro großem Monster um einen geringen, prozentualen Wert, der durch Tests ermittelt werden muss.\nDadurch gibt man Kha wieder Tradepotenzial gegen Tanks, macht den Q ansich mehr berechenbar und baut zusätzlich noch eine Komponente ein die auch zum Champ passt. \n\nEvolve Mechanik:\n\nPassend zum Q würde ich das Evolven auch abändern. Ich habe mir das so vorgestellt, dass die Talente nach einer festgelegten Reihenfolge entwickelt werden. \nDirekt bei Beginn des Spiels baut sich der Q automatisch aus (damit man ihn auch vernünftig stacken kann).\nLevel 6 E\nLevel 11 W\nLevel 16 R\n\nSo hat man das Gefühl einen vollwertigen Kha Zix zu spielen und man ist nicht gezwungen auf eine Evolution zu verzichten. Zudem wird Kha Zix, von seiner Schadensentwicklung her, rationaler. Das erlaubt, meiner Meinung nach, ein besseres Balancing. \n\nIch behaupte nicht, dass der aktuelle Kha Zix schlecht ist oder so, sondern ich finde das sein Konzept Fehler aufweist. Es fühlt sich nicht so an, als wäre das mit dem Evolven Konsequent zuende gedacht worden. Zudem finde ich Kha einfach zu Random mit seinem Q. Wenn man nicht gerade Feed ist, hat man es sehr schwer etwas downzubursten, solange es sich im Team bewegt und nicht isoliert ist. \n\nDas sind meine Gedanken zu Kha Zix aktuell. Was haltet ihr davon? Hab ich einen entscheidenen Faktor übersehen?\n\nmfg ITAkantinenfritte","replies":[{"poster":"FeS Dregorin","date":"2015-02-13T20:41:45.059+0000","up_votes":4,"down_votes":0,"body":"Kha'Zix ist ein schwieriges Thema finde ich. Ich kann ja gut verstehen, dass dich der fehlende %-Schaden stört, aber ich denke das es auch nicht seine Aufgabe ist, Tanks zu schreddern. Und wenn man dem Kha'Zix nun ein paar änderungen verschaffen möchte dann muss man Zwei Konzepte gleichzeitig beachten. Erstens, er soll durch töten (oder fressen {{champion:121}} ) stärker werden. Zweitens, er soll wie ein Assassin funktionieren. Reinhüpfen, {{champion:22}} wegbursten und wieder raushüpfen.\n\nGeben wir dem Q jetzt Prozent schaden der über zeit immer stärker wird, passt das zwar zum Charackter aber nicht wirklich zum Spielstil. Er soll ja nicht reinhüpfen, alles wegbursten und sich dann freuen.\n\nThema anpassung hätte ich mich ja speziell über auswahl gefreut. Im moment entscheidet man sich eher, welches der Vier upgrades man nicht nehmen möchte, als das man sich entscheidet, welches denn am nützlichsten wäre.\n\nBei dem Q könnte man z.b entscheiden lassen, ob man einen geringen %-schaden erhalten möchte, oder einen etwas verstärkten Basisschaden.\nBei dem W, ob die Salve etwas mehr phyischen, oder ein geringen magischen Schadensanteil bekommt.\nBei dem E, ob man einen reset bei kill oder assist bekommen möchte, oder 2 aufladungen mit cooldown. (wie beim smite)\nUnd beim R, ob man 3 mal kurz stealth bekommen möchte, oder ein mal etwas länger.\n\nDas wären für mich alles änderungen die Kha'Zix zu einem wirklich anpassungsfähigen Jäger machen würden.\nVielleicht kann man die Upgrades dann ja auch nur freischalten lassen, nachdem man eine gewisse Menge Junglecreeps getötet hat, oder sowas. (Mir ist bewusst, das ihn das komplett in den Jungle verbannen würde)\n\nDann sollte man sich eventuell bei diesen insgesamt Acht auswahlmöglichkeiten 3 stück VÖLLIG FREI aussuchen können. Bsp. zusätzlicher physischer und magischer Schaden auf dem W. Und wenn man den guten Rengar dann getötet hat, kann man sich eine 4te verbesserung aussuchen.\n\nIch denke all diese Dinge würden deinem gewünschten Spielgefühl entsprechen. Das wäre doch mal ein verdammt cooler champion haha.\nÜber das balancing muss Riot sich dann gedanken machen, wenn die das mal aufgabeln sollten :P","replies":[{"poster":"Gelban der Reihe","date":"2015-02-13T21:02:27.207+0000","up_votes":1,"down_votes":0,"body":"Das scheint doch genau in die Richtung zu gehen, wo der TE hin will, denke ich.\nKlingt meiner Meinung nach super.","replies":[]}]},{"poster":"Marauth","date":"2015-02-13T09:25:59.595+0000","up_votes":2,"down_votes":0,"body":"Kah skaliert aufm Q stark mit bonus-AD. Wenn er keine Items hat, zieht er keinen Dmg.\n\nEine Anpassung würde ich zusprechen. Momentan gefählt mir der Käfer nicht. Das mit dem Isolieren ist sowieso extrem schwer hinzukriegen. Sowas passiert nur im Low-Elo, dass jemand bei einen Kah im Match alleine rumwandert.\n\nKah braucht defintiv wieder liebe, damit er das wird, was er sein soll: eine tötliche Leerenkreatur, nach unstillbaren Hunger nach Weiterentwicklung :)","replies":[{"poster":"Darth Lumiya","date":"2015-02-13T15:14:18.786+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=B0oMkin,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=0001,timestamp=2015-02-13T09:25:59.595+0000)\n>\n> Kah skaliert aufm Q stark mit bonus-AD. Wenn er keine Items hat, zieht er keinen Dmg.\n> \n> Eine Anpassung würde ich zusprechen. Momentan gefählt mir der Käfer nicht. Das mit dem Isolieren ist sowieso extrem schwer hinzukriegen. Sowas passiert nur im Low-Elo, dass jemand bei einen Kah im Match alleine rumwandert.\n> \n> Kah braucht defintiv wieder liebe, damit er das wird, was er sein soll: eine tötliche Leerenkreatur, nach unstillbaren Hunger nach Weiterentwicklung :)\n\nNaja wie oben geschrieben: Ich halte den aktuellen Kha nicht für zu Schwach sondern für zu Random. Kriegt man aktuell nen Carry zu fassen, während er isoliert ist, dann ist der quasi Instant tot. Problem ist, wenn Isolation nicht greift bekommt man echt Probleme außer man ist Feed.","replies":[{"poster":"Marauth","date":"2015-02-16T07:52:26.387+0000","up_votes":1,"down_votes":0,"body":"Ich würde es nicht als Random bezeichnen. Ohne Isolierung eines Targets, fehlt enorm Schaden. Diese Passive zu nutzen geht garnicht, wenn der Gegner ein bisschen Hirn hat. Da hilft einen auch kein Challenger-Skill in Bronze.\n\nMomentan ist Kah eigentlich nur ein Noobfilter und Low-Elo-Farmer. Sobald die Spieler bisschen Hirn haben, wird der Käfer faktisch nutzlos und schiebt keinen Dmg mehr.\n\nSelbst Skill bringt einen nicht weiter, wenn man nicht mal mehr die Passive nutzen kann.","replies":[]}]}]},{"poster":"Caligo","date":"2015-02-13T14:31:29.258+0000","up_votes":2,"down_votes":0,"body":"ich finde es schade, dass rengar von der quest viel merh hat als kha. und nun ist es sogar, so dass rengar seine stacks nie verlieren kann.\nIch fände, dass man die Reihenfolge selber entscheiden kann. es wäre cool, wenn er q nicht nicht wie bei nasus, sondern wie du es geschrieben hast wie bei mejas ist. man kann die stacks verlieren, jedoch ist es full stacked sehr stark\n\nhabe mich nicht auf rechtschreibung geachtet, also sry.\nmfg mischa","replies":[{"poster":"Darth Lumiya","date":"2015-02-13T20:48:52.326+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=D3P Caligo,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=0003,timestamp=2015-02-13T14:31:29.258+0000)\n>\n>\n> Ich fände, dass man die Reihenfolge selber entscheiden kann. es wäre cool, wenn er q nicht nicht wie bei nasus, sondern wie du es geschrieben hast wie bei mejas ist. man kann die stacks verlieren, jedoch ist es full stacked sehr stark\n\n\nFinde ich persönlich nicht so gut. Meiner Meinung nach ist etwas permanentes besser als eine Art Mejais Q. Zudem würde das den Snowball-Effekt ziemlich verstärken, was ja nicht unbedingt nötig ist. Ich halte Kha Zix wie gesagt nicht für zu schwach. \n\nMir gefällt nur sein Konzept nicht, dass irgendwie unfertig wirkt. Daher habe ich überlegt wie man das besser hin bekommt und das oben ist das Ergebnis :)","replies":[]}]},{"poster":"Stealth Cat","date":"2015-02-13T06:09:15.570+0000","up_votes":1,"down_votes":0,"body":"Man kann auch so alle 4 Evolutionen erreichen, such dir nur ein Gegnerteam die Rengar haben, töte ihn sobald die Quest anfängt, und tada... 4 Evolutionspunkte.","replies":[{"poster":"Davoro","date":"2015-02-13T07:58:37.452+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Rekhyten,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=0000,timestamp=2015-02-13T06:09:15.570+0000)\n>\n> such dir nur ein Gegnerteam die Rengar haben.\n\nScherzkeks.","replies":[]},{"poster":"Darth Lumiya","date":"2015-02-13T15:10:57.786+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rekhyten,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=0000,timestamp=2015-02-13T06:09:15.570+0000)\n>\n> Man kann auch so alle 4 Evolutionen erreichen, such dir nur ein Gegnerteam die Rengar haben, töte ihn sobald die Quest anfängt, und tada... 4 Evolutionspunkte.\n\nKlar geht das auch. Aber wenn man ehrlich ist, ist das ziemlich schlecht gemacht. Da fallen mir spontan diverse Möglichkeiten ein, wie man das mit dem 4ten Evolutionspunkt besser lösen kann. \n\n\n\nNochmal zum Q:\n\nIch habe mir das so vorgestellt, dass Kha Zix durchs töten von Jungle Monstern langsam die % Komponente des Q hochstackt. Meinetwegen fängt man bei 2% Bonusschaden an und stackt dann in 0,1% Schritten die Fähigkeit hoch bis man irgendwann 8% erreicht (vorausgesetzt man jungled ordentlich). Gleichzeitig sorgt man durch diese Mechanik auch dafür, dass Kha Zix jungeln muss um seinen Q hochzuhalten. Daher er kann nicht die ganze Zeit ganken ohne Schaden zu verlieren (was ja das Hauptproblem des alten Kha Zix war).","replies":[{"poster":"Gelban der Reihe","date":"2015-02-13T15:39:47.004+0000","up_votes":1,"down_votes":0,"body":"FInde die Ide gut, aber an den Zahlen müsste noch geschraubt werden.\nSchau mal, wenn man auf 8% kommen kann und will, aber nur in 0,1% Schritten vorwärts kommt, dann braucht man 60 (große?) Monster, um auf maximale Stacks zu kommen.","replies":[{"poster":"Darth Lumiya","date":"2015-02-13T16:17:23.323+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gelban der Reihe,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=000000010000,timestamp=2015-02-13T15:39:47.004+0000)\n>\n> FInde die Ide gut, aber an den Zahlen müsste noch geschraubt werden.\n> Schau mal, wenn man auf 8% kommen kann und will, aber nur in 0,1% Schritten vorwärts kommt, dann braucht man 60 (große?) Monster, um auf maximale Stacks zu kommen.\n\nWar nur rein hypothetisch. Man muss wie gesagt testen damit die Kurve bei den Stacks gut hinkommt. Nicht das man plötzlich 8 % hat und noch level 9 ist xD","replies":[]}]}]}]},{"poster":"iJUKEuQQ","date":"2015-02-15T12:37:05.905+0000","up_votes":1,"down_votes":0,"body":"kha passt halt einfach nicht in jedes team sonst denk ich mitlerweile er ist gut wie er ist.im rrichtigen setup kann man immer noch aller vernichten, nur gibts jetzt tatsächlich counterplay^^","replies":[]},{"poster":"Stay Pawsitive","date":"2015-02-13T12:16:38.237+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich liebe den Käfer :D und finde es schade das er so stark zurückgefallen ist, denn er war eigentlich immer einer meiner lieblings Jungler bzw in Season 3 sogar mein lieblings Midlaner. Das Konzept der jetzigen Evolution ist zwar schon ganz nett aber deine Idee einer neuen, besser zum Champ passenden, Entwicklung ist einfach super (z.B. Stacks). Kha´Zix{{champion:121}}  ist nunmal ein Wesen welches sich an seine Umgebung anpasst und umso mehr er tötet umso mehr kann er \"absorbieren\" und umso stärker wird er. Passt einfach wesentlich besser zu Kha´Zix{{champion:121}}  ;D","replies":[{"poster":"Darth Lumiya","date":"2015-02-13T15:16:17.683+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Krake98,realm=EUW,application-id=Wj1wcocU,discussion-id=WMWnB2wy,comment-id=0002,timestamp=2015-02-13T12:16:38.237+0000)\n>\n> Ich persönlich liebe den Käfer :D und finde es schade das er so stark zurückgefallen ist, denn er war eigentlich immer einer meiner lieblings Jungler bzw in Season 3 sogar mein lieblings Midlaner. Das Konzept der jetzigen Evolution ist zwar schon ganz nett aber deine Idee einer neuen, besser zum Champ passenden, Entwicklung ist einfach super (z.B. Stacks). Kha´Zix{{champion:121}}  ist nunmal ein Wesen welches sich an seine Umgebung anpasst und umso mehr er tötet umso mehr kann er \"absorbieren\" und umso stärker wird er. Passt einfach wesentlich besser zu Kha´Zix{{champion:121}}  ;D\n\nGenau das dachte ich mir auch als ich die Idee hatte. Meine Vorgeschlagene Spielweise würde sogar besser zum Vorbild (die Alien Filme) passen. Da bereiten sich die Aliens auch immer vor, bevor sie auf Raubzug gehen.","replies":[]}]}]}