{"poster":"SSJ Didy","date":"2016-12-23T21:31:56.256+0000","title":"Perma Ban","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":2,"body":"Hallo ich wurde perma gebannt den grund wei&szlig; ich leider nicht ich habe ihn meine email geschaut habe aber leider nichts bekommen was soll ich jetzt tun?\r\n\r\nLG Didy\r\n\r\nPS: ist es m&ouml;glich entbannt zu werden ?","replies":[{"poster":"legofreak1","date":"2016-12-23T21:35:58.643+0000","up_votes":3,"down_votes":0,"body":"Ob du entbannt wirst hängt vom Grund des Banns ab. Bann für toxisches Verhalten, flamen, absichtliches feeden, eloboosting, cheaten, scripten und andere Verstöße gegen die Nutzungsbedinungen dieser Art werden nur wieder aufgehoben, wenn der Bann fehlerhaft ausgesprochen wurde, andernfalls bleibt dieser bestehen. Bei einem Bann für Flaming wird dir im Client eine Reformkarte angezeigt, die dein Chatlog der für den Bann maßgeblichen Spiele enthält.\nWenn du gebannt wurdest, weil du dir kürzlich per Lastschriftverfahren RP gekauft hast, dein Konto nicht gedeckt war und die RP deswegen nicht bezahlt wurden, wirst du wieder entbannt werden, sobald RIOT das Geld erhalten hat. In diesem Fall musst du dich an den [Support](https://support.riotgames.com/hc/de/requests/new) wenden, um das Verfahren in die Wege zu leiten bzw du solltest den Support im Allgemeinen anschreiben, wenn du nicht weißt weswegen du gebannt wurdest und auch keine E-Mail dazu erhalten hast.","replies":[{"poster":"SSJ Didy","date":"2016-12-23T22:55:47.952+0000","up_votes":1,"down_votes":0,"body":"Ah cool danke hab nämlich vor paar tagen eine last schrift gemacht bezahle das dann mal :)","replies":[{"poster":"Sirrkas","date":"2016-12-23T23:01:25.692+0000","up_votes":1,"down_votes":0,"body":"Am sichersten wäre es für dich wohl, wenn du den Support vorher anschreibst und fragst, wie du ihnen das Geld zahlen sollst. Ich bin zwar selber noch nicht in die Verlegenheit gekommen, bei Riot im Zahlungsverzug zu sein, es kann aber durchaus sein, dass da noch etwas zu beachten ist. Über die Feiertage wird sich jetzt aber eh erstmal nichts tun.","replies":[]}]}]}]}