{"poster":"BEWULF THE KING","date":"2015-02-16T21:11:02.317+0000","title":"Ranglistensperre ist übertrieben","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":15,"body":"Ich würde gerne fragen warum es die Ranglistensperre gibt. Es ist sinnlos, da die Spieler sich dadurch auch nicht ändern. Außerdem verlieren viele Spieler dadurch die Lust am Spielen. Ich finde das mit dem 5 Minuten warten bevor man in die Warteschlange eingereiht werden kann viel sinnvoller, da dass sehr nervig sein kann und einen eben nicht für 35 x 30-45 Minuten von Ranglistenspielen abhält. Ich meine das sind mit 35 x 30 schon 1050 Minuten die man sinnlos in dieses Spiel investieren muss. Ich würde euch bitten euch eine passendere Sperre auszudenken. Die League of Legends Regeln sind sehr streng geworden und die Strafen sind umso schlimmer. Aber wie soll man den reagieren, wenn man z.B. der einzige im Team ist der nicht feedet und gut spielt und der Rest des Teams einfach alle Gegner gefeedet hat. Ich habe eine Chatsperre bekommen, warum? Ich habe meine Gegner gefragt, ob sie einen aus meinem Team der vorsätzlich gefeedet hat, melden können. Dafür werde ich gemeldet, als hätte ich jemanden beleidigt. Was ebenso schlimm ist, dass das niemand beurteilen kann, da Riot nicht genug Zeit hat sich alles durchzulesen und es ein Computer einfach auflistet und nach genug Reports einfach ne Chat- oder Rankingsperre reinhaut. Ich habe keine Ahnung was ihr da tun könntet, da ich mich mit sowas nicht gut auskenne. Aber ich würde es beherzigen, wenn ihr euch etwas überlegt um dieses Problem zu lösen. Denn so wie es für mich aussieht muss man jemanden einfach nur melden, egal ob er was gemacht hat oder nicht.\r\nMit feundlichen Grüßen BEWULF THE KING","replies":[{"poster":"Humpelstilzche","date":"2015-02-16T21:33:21.189+0000","up_votes":10,"down_votes":0,"body":"> Was ebenso schlimm ist, dass das niemand beurteilen kann, da Riot nicht genug Zeit hat sich alles durchzulesen und es ein Computer einfach auflistet und nach genug Reports einfach ne Chat- oder Rankingsperre reinhaut. \n\nWenn es denn so wäre, wäre das wohl tatsächlich schlimm. Glücklicherweise ist das System deutlich ausgefuchster und bewertet nur Reports, die auch tatsächlich berechtigt sind. \nBei Ranked-Sperren gilt das in verstärktem Maße, da diese primär auf Basis der Chatanalyse vergeben werden. Die Chatanalyse liest deinen Chat und bestraft dich, sofern da ein hohes Maß an inakzeptablem Verhalten nachweisbar ist. \n\nReport-Aufforderunge (die übrigens auf Grund der Funktionsweise des Reports-Systems absolut nutzlos sind, aber das nur nebenbei) sind ein Teil dieser nicht akzeptablen Verhaltensweisen. \nWenn du der Meinung bist jemand feedet absichtlich: Behalt das für dich und melde ihn einfach. Und da absichtliche Feeder alle paar dutzend oder hunderte Spiele mal vorkommen, ist auszuschließen dass du ausschließlich für Report-Aufforderung gegenüber tatsächlich absichtlichen Feedern bestrafst wurdest. Das würde hinten und vorne nicht für eine Restriction reichen. \nDa muss schon noch deutlich mehr gewesen sein. Was das ist, kann ich nich sagen, ich kenne deine Chatlogs nicht. Aber du, du weißt ganz genau was du so schreibst...und jetzt weißt du auch, dass ein großer Teil davon absolut nicht ok ist. Nun liegt es an dir, dein Verhalten zu bessern. Viel Erfolg dabei!","replies":[]},{"poster":"Blaqck","date":"2015-02-16T21:46:25.629+0000","up_votes":8,"down_votes":0,"body":"Fast dein kompletter Text enthält Unwahrheiten, ich werde das so gut wie möglich aufklären. Bei Bedarf, kannst du Statistiken zu den tatsächlichen Werten leicht im Internet finden.\n\n> Es ist sinnlos, da die Spieler sich dadurch auch nicht ändern.\n\nEs gibt seitens Riot Belege die zeigen, dass sich Leute mit Ranglistensperren in ihrem Verhalten signifikant gebessert haben. Zur Tribunalzeit wurden 75% nach der ersten Strafe reformiert, inzwischen dürfte sich dieser Wert durch die Ranglistensperren erhöht haben.\n\n> Ich meine das sind mit 35 x 30 schon 1050 Minuten die man sinnlos in dieses Spiel investieren muss.\n\n\"sinnlos\"? Das einzige was sich verändert ist, dass du nach dem Spiel keine Zahl mehr angezeigt bekommst. Das Spiel an sich bleibt exakt das gleiche. Normal Drafts haben sogar ein eigenes Matchmaking.\n\n> Die League of Legends Regeln sind sehr streng geworden und die Strafen sind umso schlimmer.\n\nStrafen müssen als solche wahrgenommen werden, um zu funktionieren.\n\n> Aber wie soll man den reagieren, wenn man z.B. der einzige im Team ist der nicht feedet und gut spielt und der Rest des Teams einfach alle Gegner gefeedet hat.\n\nDu munterst deine Mitspieler auf, damit sie nicht so niedergeschlagen sind.\n\n> Ich habe meine Gegner gefragt, ob sie einen aus meinem Team der vorsätzlich gefeedet hat, melden können. Dafür werde ich gemeldet, als hätte ich jemanden beleidigt.\n\nDu hast zwar niemanden beleidigt, aber du hast deinem Mitspieler gedroht. Eine Drohung ist ebenso ungern gesehen wie eine Beleidigung.\nAußerdem ist 1 Report im Grunde genau so viel Wert wie 9 Reports, es wird nach \"Spiele mit Meldung\" und nicht nach \"Meldungen pro Spiel\" gerechnet.\nDein eigener Report reicht dementsprechend aus, jeder soll selbst entscheiden, ob er Person X melden möchte oder nicht.\n\n> ein Computer einfach auflistet und nach genug Reports einfach ne Chat- oder Rankingsperre reinhaut.\n\nDas entspricht nicht der Wahrheit. Der Algorythmus für die Chat-Analyse ist so angepasst, dass er keine unschuldigen bestraft. Zur Zeit der Chatsperre gab es gerade einmal 2 Leute die ungerechtfertigt eine Bestrafung erhalten haben und diese waren Extremfälle in denen sich die Spieler andauernd selbst beleidigt haben. Einen Link zur genaueren Funktion findest du in diesem Thread: http://forums.euw.leagueoflegends.com/board/showthread.php?t=1842052\nIm Grunde ist immer noch das gleiche System aktiv.\n\n> Ich habe keine Ahnung was ihr da tun könntet, da ich mich mit sowas nicht gut auskenne.\n\nWenn du dich mit etwas nicht auskennst, solltest du keine Thesen aufstellen und diese als Wahr darstellen. Frage nach und informiere dich, bevor du mit Behauptungen um dich wirfst. Diesen Rat solltest du nicht nur in LoL, sondern in allen Lebenssituation befolgen.\nTatsächlich gibt es das Problem garnicht, über welches du dich beschwerst. \n\n> Denn so wie es für mich aussieht muss man jemanden einfach nur melden, egal ob er was gemacht hat oder nicht.\n\nDas System erkennt wenn jemand grundlos Leute meldet die unschuldig sind. Das Report-Gewicht wird in so einem Fall so weit runtergsetzt, dass zukünftige Meldungen direkt in den digitalen Mülleimer landen und der Vote solcher Person keinerlei Einfluss mehr hat.\n\nAnstatt dich zu beschweren, solltest du froh sein überhaupt noch spielen zu dürfen. In anderen Online-Spielen wärst du nicht so leicht davon gekommen. Riot ist in Sachen Strafe und Reformation schon ziemlich revolutionär.\n\n\nIch hoffe ich konnte dir weiterhelfen, einen schönen Tag wünsche ich noch.\n{{champion:58}}\n\n\n€dit: Man habe ich lange gebraucht für den Text ._. double ninja'd","replies":[{"poster":"BEWULF THE KING","date":"2015-08-20T02:16:45.722+0000","up_votes":1,"down_votes":4,"body":"Achja und mal davon abgesehen, ob ich jemand beleidigt habe oder nicht (was zwar nicht der Fall war, aber ok), ich glaube keiner hat Lust eine meiner Meinung nach total Überzogene Strafe zu bekommen. Ich meine du hast wahrscheinlich keine Ahnung, was es heißt solche Spiele gewinnen zu müssen. Mal abgesehen ob es nervt oder nicht. Aber würdest du deine Zeit damit verschwenden (mir egal ob du jemals einen Report bekommen wirst), indem du erstmals Draft Pick, dann 35 Spiele gewinnen, was wenn ein schlechter Spieler, diesen Bann bekommt, locker auf 150 Spiele hochgehen kann, und drittens damit überhauptnichts erreichts. Ich meine prinzipiell vergeudest du deine Lebenszeit damit, natürlich ist eine Strafe in diesem Fall angemessen, aber das League of Legends mit den neuen Regeln damals von 0 auf 100 gegangen ist, fand ich total zum kotzen. Denn von keiner Sperre, direkt auf 200 Spiele, wie ich es bei den meisten mitbekommen habe. Es gibt immer Leute wie dich, die wohl nicht besseres zu tun haben, als jedes Ranked Spiel zu verlieren und wie die meisten hochgekauften zwischen Gold 4-5 zu hängen und gerade noch dem Absturz fern zu bleiben. Also bitte nutz deine Zeit mal sinnvoller, denn du denkst jawohl wirklich nicht, dass ich (auch wenn von dir nicht so aufgefasst) deine meinermeinung nach total provokativen (jedenfalls die Abschnitte die ich überflogen habe) und total unangemessenen Text, wobei du keine Ahnung hast weshalb ich gemeldet wurde. Und Revolutionär? Bist du bescheuert? Wenn du Geld für dieses Spiell ausgibst ( nicht in meinem Fall) und du wegen Kleinigkeiten, welche oberflächliche Kiddies wie du nicht nachvollziehen können, gemeldet wurden. Weißt du wenn du das wärst, dann wärst du meiner Meinung. Aber du bist halt ziemlich oberflächlich und beurteilst andere viel zu schnell. Naja viel Spaß beim weiteren Verlieren. Achso und nochwas \"Das System erkennt wenn jemand grundlost Leute meldet die unschuldig sind\" von der Rechtschreibung mal abgesehn, ist ein Computer kein Mensch, sondern eben ein Computer. Er fasst solche Dinge anders auf und kann sie eben nur nach gegebenen Masstäben beurteilen. Was heißt, dass er kein Urteilsvermögen besitzt, er kann nicht prüfen, ob das nun wirklich seine Schuld ist oder nicht, weil er nicht denken kann und selbst wenn da Leute sitzen die Arbeiten und möglichweise genau sowas tun, wie eure unnützen Reports anzuschauen und durchzulesen (wobei kein Mensch sowas je in normalen Verhältnissen machen würde, da das jawohl keine Arbeit wäre, die die irgendwie fordert oder bei der du gut verdienst), also schlage ich mal vor, dass du hier nicht einen auf Klug machst, wenn du noch nicht Mal die deutsche Grammatik 100%tig beherrscht. Und wie gesagt ein Computer kann nicht denken, er sucht \"Fluchtwörter\" oder \"beurteilt\" reports und meldet, die von den Spielern gemeldeten ohne drüber nachzudenken, weil ein Computer sowas nicht kann.\n\"Wenn du dich mit etwas nicht auskennst, solltest du keine Thesen aufstellen und diese als Wahr darstellen. Frage nach und informiere dich, bevor du mit Behauptungen um dich wirfst. Diesen Rat solltest du nicht nur in LoL, sondern in allen Lebenssituation befolgen.\nTatsächlich gibt es das Problem garnicht, über welches du dich beschwerst. \" Du wagst es mir sowas zu schreiben? Nachdem du selber ohne jeden Beweis davon ausgehst ich hätte jemanden beleidigt? Schäm dich.","replies":[{"poster":"Sirrkas","date":"2015-08-20T07:44:42.696+0000","up_votes":2,"down_votes":0,"body":">Draft Pick, dann 35 Spiele gewinnen, was wenn ein schlechter Spieler, diesen Bann bekommt, locker auf 150 Spiele hochgehen kann, \n\nDa man im Schnitt 50 % der Spiele gewinnen wird, solange man mit gleichstarken Gegnern zusammenkommt. Sollten die meisten Spieler nach spätestens 100 Spielen das geschafft haben. Schließlich kriegt man mit jeder Niederlage wieder leichtere Gegner und eine Winrate von 23 % wäre schon äußert ungewöhnlich (wie das bei 150 Spiele für 35 Siege der Fall wäre). Um die zu erreichen, müsste man wohl schon absichtlich verlieren.\n\n> Denn von keiner Sperre, direkt auf 200 Spiele, wie ich es bei den meisten mitbekommen habe. \n\nIch bin viel im Forum unterwegs, dass die \"meisten\" direkt 200 Spiele RR erhalten haben, ist mir aber nicht aufgefallen. Das gängigste scheint eher 75 CR + 35 RR zu sein, wenn sie sich im Forum melden. Aber ich glaube auch kaum, dass viele den Aufwand als angemessen ansehen, für etwas wie 5 CRs ins Forum zu kommen. Schließlich kann man die an einem Tag abspielen.\n\n> Es gibt immer Leute wie dich, die wohl nicht besseres zu tun haben, als jedes Ranked Spiel zu verlieren und wie die meisten hochgekauften zwischen Gold 4-5 zu hängen und gerade noch dem Absturz fern zu bleiben. \n\nWarum sind für dich alle, die nicht deiner Meinung und in Gold platziert sind gleich Trolle, die es nicht verdient haben in Gold zu sein?\nWenn du aufsteigen willst, wäre es hilfreich für dich unter anderem mehr zu Warden. Von jemandem, der sich für Gold hält, erwarte ich, dass er zumindest das Trinket regemläßig ausbaut und es auch nutzt. 5 Wards in 35 Minuten und 3 Wards in 25 Minuten, sind fast schon eine Verschwendung des Trinketslots. Das Wardtrinket hat eine CD von 2 Minuten. Selbst wenn man in den ersten 3 Minuten noch kein Ward platzieren muss, weil nicht viel passieren sollte, hast du in deinen letzten 2 Jaxspielen dein Trinket zu etwa 70 % der Zeit nicht genutzt. Bei deinem Spiel als BC Support, hat sogar euer Midlane mehr Wards als du platziert. Das scheint sich bei dir durch alle Spiele zu ziehen. Nutze dein Trinket häufiger, das hilft. \n\n>dass ich (auch wenn von dir nicht so aufgefasst) deine meinermeinung nach total provokativen (jedenfalls die Abschnitte die ich überflogen habe) und total unangemessenen Text, wobei du keine Ahnung hast weshalb ich gemeldet wurde. \n\n-\n\n>Dann will ich dir mal was sagen. Lern lesen. \n\nDanach gibt es leider wieder nur Beleidigungen und haltlose Behauptungen von deiner Seite. Bist du dir ganz sicher, dass du wirklich unschuldig bist/warst?\n\n>Du wagst es mir sowas zu schreiben? Nachdem du selber ohne jeden Beweis davon ausgehst ich hätte jemanden beleidigt? Schäm dich.\n\nAlternativ könntest du dich auch informieren, bevor du dich über ein System beschwerst, dass du nicht kennst. \n\n_____\n[Rankedrestrictions](https://support.riotgames.com/hc/de/articles/203259670-Ranglisteneinschr%C3%A4nkungen#h1q1)\n\n>Sobald ein Spieler in einem beliebigen Spielmodus die Mindestanzahl an Meldungen **und bestätigten Chatverstößen überschreitet**, wird die Ranglistenwarteschlange für diesen Spieler gesperrt.\n\n_____\n\n>Sowohl Chateinschränkungen als auch Ranglisteneinschränkungen werden durch dasselbe ausgelöst: unangebrachtes Verhalten, das durch Meldungen dokumentiert wurde, und bestätigte Chatverstöße. Bei Ranglisteneinschränkungen ist die Schwelle zur Bestrafung jedoch höher. Es sind mehr Meldungen und mehr Beweise für negatives Verhalten vonnöten, bis Ranglisteneinschränkungen verhängt werden. Ein Spieler kann Chateinschränkungen unterliegen ohne Ranglisteneinschränkungen aktiviert zu haben.\n\n_____\n\n[Fehlerquote](https://www.reddit.com/r/leagueoflegends/comments/38g6ns/riot_lyte_are_you_aware_of_how_support_operates/cruylpx)\n>I'll say one additional thing: if you did get to a Player Support \"Behavioral Specialist,\" and they did review your account... if they found an error, or no evidence of the punishment, they have the right to reverse the punishment or reduce it. It doesn't happen often because usually the systems are pretty accurate (the latest currently hovering around 1 error in every 5000 cases to 6000 cases), but I see cases every once in awhile that have their punishments reduced.\n\nThe fact that the Player Support Specialist did not remove or reduce your punishment does suggest that there's evidence that justifies the punishment. I'll double check everything tomorrow.\n\n_____\n\n[Reportaufforderungen  und -drohungen](https://www.reddit.com/r/leagueoflegends/comments/38g6ns/riot_lyte_are_you_aware_of_how_support_operates/cruylpx)\n>When you entirely avoided responding to toxic players, you were OK from the Reform System during that time.\n\nIf you continue ignoring toxic players, muting them, reporting them and moving on, I'm sure you won't have any issues again. Slumber_Jack and I will review your case and make a decision on what to do in this case, but please, for me, don't retaliate with toxic players and don't threaten players with reports--both are against the Summoner's Code and will get you penalties.","replies":[{"poster":"HyperionCH","date":"2015-08-20T08:38:25.287+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=aiF36AZf,comment-id=000200000000,timestamp=2015-08-20T07:44:42.696+0000)\n>\n> Da man im Schnitt 50 % der Spiele gewinnen wird, solange man mit gleichstarken Gegnern zusammenkommt. Sollten die meisten Spieler nach spätestens 100 Spielen das geschafft haben. Schließlich kriegt man mit jeder Niederlage wieder leichtere Gegner und eine Winrate von 23 % wäre schon äußert ungewöhnlich (wie das bei 150 Spiele für 35 Siege der Fall wäre). Um die zu erreichen, müsste man wohl schon absichtlich verlieren.\n\nUm dies noch mit einem Beispiel zu untermauern:\n\nWorst Case einer 35 RR:\nEin Bronze 5-Spieler kriegt 35 RR und hat noch nie Normal Draft Pick gespielt.\n\nEinne MMR wäre dann etwa (genau wie beim allerersten Ranked) etwa bei Silber 2-3.\nSehr gut möglich, dass so ein Spieler die ersten 10 Games (wie bei der Einstufung) verliert. Dann wird aber seine MMR wohl bereits im mittleren Bronze liegen (Bronze 2-3 wird man bei 0:10 in etwa eingestuft).\n\nIch runde jetzt grosszügig und sage: nach 20 Games ist seine MMR in Bronze 5; voraussgesetzt, niemand konnte das Game trotzdem noch carrien. Ab dann sind die Gegner gleich schwach wie er und die winrate müsste bei 50% liegen. Somit müsste ab dann 70 Games reichen.\nZusammengefasst: 20 Niederlagen (um in der MMR auf B5 zu kommen) + 70 Games (50% winrate) + 10 Games, falls man Pech hatte und keine 50% winrate hatte = 100 Games\n\n100 Games ist aber wirklich worst case (für B5-Spieler, die nie Normal Draft Pick spielten).","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-02-17T00:12:16.386+0000","up_votes":4,"down_votes":0,"body":"Warte, was forderst du da? Eine Strafe, die dich nicht stört? Und du gehst davon aus, dass sich das Verhalten von Spielern eher ändert, wenn man ihnen mit Sanktionen droht, die ihnen egal sind?\n\nDie Ranked Restriction ist (für die Ranked Q, an sonsten eher nicht) das effektivste, was sich Riot je hat einfallen lassen. Sie haben herausgefunden, dass die sportliche Komponente das \"toxische Verhalten\" am ehesten fördert. Sie nehmen den Spielern, die sich in diesem Modus toxisch verhalten, diesen sehr geschätzten Modus weg. Diese Spieler haben dann 2 Varianten: Ihre Sperre abspielen und ihr Verhalten verbessern. Oder weiterhin toxisch bleiben und nie wieder Ranked zocken... \nDementsprechend führt diese Bestrafung sehr wohl dazu, dass Spieler ihr Verhalten überdenken müssen. Und das Klima in meinen Ranked Games hat sich seit dem wirklich verbessert...\n\nUnd was sind denn die Alternativen? Ein Timeban, den man einfach Aussitzen kann? AKA \"Oh mein Gott, ich muss 2 Wochen lang auf meinem Smurf zocken\"? Das sind Strafen, die man einfach aussitzen kann, ohne sein Verhalten zu überdenken. Wenn sein Main Account dagegen eine Ranked Restriction hat, muss man aktiv an seinem Verhalten arbeiten, um diese wieder loszuwerden.","replies":[]},{"poster":"Sirrkas","date":"2015-02-16T21:33:29.332+0000","up_votes":3,"down_votes":0,"body":"Die Strafe scheint ja ihren Sinn zu erfüllen, wenn du dich dadurch genervt fühlst.\n\nÜbrigens musst du 35 Spiele gewinnen, dadurch verdoppelt sich die Zeit in etwa, die du brauchst.\n\nWenn du es geschafft hast, vom aktuellen System bestraft zu werden, musst du sehr oft gemeldet worden sein und zudem auch entsprechende Sachen in den Chat geschrieben haben. Bisher sind nur zwei Chatsperren bekannt, die unrechtmäßig verteilt wurden, die wurden auch wieder zurückgenommen. \n\nDass du also nicht nur eine Chatsperre sondern auch eine Rankedsperre erhalten hast, lässt also darauf schließen, dass du dir beides hart erarbeitet hast. Dein \"pls Report feeder\" ist einfach nur unnötig und stört die anderen Spieler, dass du angeblich immer wieder Feeder im Team hast, die absichtlich sterben gehen ist unwahrscheinlich. \n\nDeine Mitspieler zu reports aufzufordern ist auch nur nervig. Wer ein Vergehen mitkriegt, ist auch in der Lage es zu melden. Es besteht keine Notwendigkeit, zu Reports aufzurufen. Ich könnte ja auch jede Runde schreiben \"pls Report Bewulf the King, allways flaming and blaming teammembers for his fails\".","replies":[{"poster":"BEWULF THE KING","date":"2015-08-20T02:03:37.050+0000","up_votes":1,"down_votes":4,"body":"Achso? Und das weißt du genau? Dann will ich dir mal was sagen. Lern lesen. Ich habe geschrieben, dass ich gemeldet wurde wegen \"Flame\" oder \"Toxic\" wie ihr Verlierer dass nennt. Und ich habe auch nicht irgendwelche Spieler aufgefordert. Ich habe gefragt ob sie ihn melden könnten. Junge du bist schon irgendwo hinterblieben was? Ich habe sie gefragt, nicht gesagt \"report him or i report you\". Und von so kleinen Losern, die wahrscheinlich noch Milchzähne haben, würde ich sowas unqualifiziertes garnicht hören (und nur als nebeninfo, falls jetzt irgendwelche von denen die sich das hier durchlesen, dazu bewegt fühlen irgendetwas gegensätzliches zu schreiben, dann lasst es, denn ich werde es mir nicht durchlesen). Ich meine du stellst hier irgendwelche Vermutungen auf, für die die nicht nur jeder Beweis fehlt, sondern auch jeder Grund. Ich meine wenn ein Spieler im Ranked feedet, mal beiseite ob gut oder schlecht, dann sollte man in melden, denn wenn er allen anderen das Spiel versaut, (wobei ich mir vorstellen kann, dass du einer dieser \"Menschen\" bist), dann sagst du also man sollte ihm einen Honor geben, für sein professionelles Spiel. Auch wenn er anderen die Serie versaut, obwohl er das natürlich nicht wissen kann, aber das ist so ein Faktor der wohl bei dir nicht zutrifft, denn du hast wohl keinerlei Ahnung was ein \"sinnvoller Report\" ist. Und ja vielleicht hat Riot recht, sie verändern das Verhalten der Spieler, ich habe mich auch geändert und selbst wenn du es mir nicht glaubst (was mir relativ egal ist) ich habe nicht eine einzige Beleidigung geschrieben und war immer der, der am seltensten seine Lane verloren hat. Ich wurde, wie ich bereits geschrieben habe, weil ich 1-2 Mal gefragt habe ob man doch nicht einen Feeder oder einen total schlechten Spieler melden könnte, denn dafür gibt es die Kategorie im Report-Bereich \"Schlechter Spieler\". Ob das dein Gehirn nun nachvollziehen kann oder nicht ist irrelevant, denn du glaubst mir ja sowieso nicht, also habe ich wohl wieder meine Zeit vergeudet um kleinen Kindern zu zeigen wie sehr sie doch im Unrecht sind. Und nur so, so wie ich das sehe, gehst du immer sofort davon aus, dass jeder der einen Report hat ein richtiges ********* ist und sich auch im realen Leben so verhält (bitte nicht abstreiten ich weiß, dass es stimmt). Also halt dich hier mal Lieber raus.\nMit freundlichen Grüßen BEWULF THE KING","replies":[{"poster":"Sirrkas","date":"2015-08-20T07:11:33.140+0000","up_votes":3,"down_votes":0,"body":">Und ich habe auch nicht irgendwelche Spieler aufgefordert. Ich habe gefragt ob sie ihn melden könnten.\n\nIst faktisch das gleiche. Der Unterschied zwischen \"Report XY\" und \"Report XY, pls\" ist kaum nennenswert. Auch ein \"can you pls Report XY\" wäre immernoch eine Reportaufforderung. \n\n>Ich habe sie gefragt, nicht gesagt \"report him or i report you\". \n\nDas wäre dann auch eine Drohung gewesen und nicht nur eine Aufforderung.\n\n>und nur als nebeninfo, falls jetzt irgendwelche von denen die sich das hier durchlesen, dann lasst es, denn ich werde es mir nicht durchlesen\n\nDann hättest du nach 6 Monaten es auch einfach sein lassen können zu antworten.\n\n>(wobei ich mir vorstellen kann, dass du einer dieser \"Menschen\" bist), \n\nWarum beschwerst du dich über haltlose Anschuldigungen, wenn du dann selbst welche machst? Du könntest dir auch einfach mein Profil ansehen und dir überlegen, ob ich schonmal gefeedet habe. Das lässt sich ziemlich einfach nachprüfen. \n\n\n>Ich meine wenn ein Spieler im Ranked feedet, mal beiseite ob gut oder schlecht, dann sollte man in melden, denn wenn er allen anderen das Spiel versaut,\n\nDann mach das doch. Reports zählen auch, wenn sie von nur einem kommen. Man muss nicht vom ganzen Team gemeldet werden, damit etwas passiert. \n\n>dann sagst du also man sollte ihm einen Honor geben, für sein professionelles Spiel.\n\nDas habe ich nie behauptet. Also solltest du dir deinen eigenen Rat zu Herzen nehmen:\n\n>Dann will ich dir mal was sagen. Lern lesen.\n\n.\n\n>Auch wenn er anderen die Serie versaut, obwohl er das natürlich nicht wissen kann, aber das ist so ein Faktor der wohl bei dir nicht zutrifft, denn du hast wohl keinerlei Ahnung was ein \"sinnvoller Report\" ist. \n\nDa ich mich regelmäßig über das Reportsystem informiere, kann ich dir ziemlich genau sagen, was sinnvolle Reports sind. Der Feederbuster ist leider noch nicht tätig, die Reports für Sabotage sollte man aber trotzdem geben. Alle Reports zu toxischem Chatverhalten werden von der Chatanalyse berücksichtigt. Die einzigen sinnlosen Reports (neben unberechtigten Reports) sind schlechter Spieler und Kommunikationsverweigerung. \n\n>Und ja vielleicht hat Riot recht, sie verändern das Verhalten der Spieler, ich habe mich auch geändert und selbst wenn du es mir nicht glaubst (was mir relativ egal ist) ich habe nicht eine einzige Beleidigung geschrieben und war immer der, der am seltensten seine Lane verloren hat.\n\nMir kann dein Verhalten auch ziemlich egal sein. Ich werde dich vermutlich nie ingame treffen. Es kann auch sein, dass du nie beleidigt hast. Das schließt aber noch lange nicht aus, dass deine Strafe ungerechtfertigt ist. Du könntest ja auch permanent am Blamen sein. Das könnte dann etwa so aussehen: \"omg, Syndra failed that teamfight\" \"thx jungler, you lost our baron\" \"you just lost my promo\"\nAlles keine Beleidigungen, das wird aber von den Mitspielern als störend empfunden. Ähnlich wie das bei gehäuften Reportaufrufen der Fall sein kann. \nDeine Lane zu gewinnen oder zu verlieren hat keinen Einfluss auf das Strafmaß oder eine Bestrafung.\n\n>Ich wurde, wie ich bereits geschrieben habe, weil ich 1-2 Mal gefragt habe ob man doch nicht einen Feeder oder einen total schlechten Spieler melden könnte, denn dafür gibt es die Kategorie im Report-Bereich \"Schlechter Spieler\".\n\nFür eine RR muss da schon deutlich mehr vorgekommen sein als 2 Reportaufrufe. Nachdem ich erwähnt habe, dass \"schlechter Spieler\" nicht einmal eine Strafe nach sich zieht, ist es eine eher schlechte Idee, Leute aufzufordern, jemanden als schlechten Spieler zu melden. Das geht wohl bestenfalls in irgendwelche Statistiken ein. \n\n> Ich meine du stellst hier irgendwelche Vermutungen auf, für die die nicht nur jeder Beweis fehlt, sondern auch jeder Grund. \n\nDu wirkst aber nicht gerade sehr \"unschuldig\" wenn du wahllos Leute beleidigst. Also hast du deine Strafe ziemlich sicher verdient. Zu etwa 99,98 %\n\n>ihr Verlierer\n>Und von so kleinen Losern, die wahrscheinlich noch Milchzähne haben, würde ich sowas unqualifiziertes garnicht hören \n>Junge du bist schon irgendwo hinterblieben was?\n>Ob das dein Gehirn nun nachvollziehen kann oder nicht ist irrelevant,\n>kleinen Kindern \n\n-\n\n>Ob das dein Gehirn nun nachvollziehen kann oder nicht ist irrelevant, denn du glaubst mir ja sowieso nicht, also habe ich wohl wieder meine Zeit vergeudet um kleinen Kindern zu zeigen wie sehr sie doch im Unrecht sind. Und nur so, so wie ich das sehe, gehst du immer sofort davon aus, dass jeder der einen Report hat ein richtiges * ist und sich auch im realen Leben so verhält (bitte nicht abstreiten ich weiß, dass es stimmt). Also halt dich hier mal Lieber raus.\nMit freundlichen Grüßen BEWULF THE KING\n\nKeine Angst. Gut 90 % aller Spieler die eine Strafe erhalten haben und sich im Forum melden, wollen einfach nicht wahr haben, dass sie im Unrecht sind. Wenn du es versuchst, schaffst du es aber vielleicht zu erkennen, was andere an deinem Verhalten stört. Das kannst du dann anpassen und wirst in Zukunft nicht mehr bestraft.","replies":[]},{"poster":"Waldschrat86","date":"2015-08-20T11:07:47.632+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BEWULF THE KING,realm=EUW,application-id=KYnfKGf0,discussion-id=aiF36AZf,comment-id=00010000,timestamp=2015-08-20T02:03:37.050+0000)\n>\n> Junge du bist schon irgendwo hinterblieben was? \n\nBester Satz :D","replies":[]}]}]},{"poster":"Madchickendinner","date":"2015-02-18T11:13:15.781+0000","up_votes":1,"down_votes":0,"body":"> Es ist sinnlos, da die Spieler sich dadurch auch nicht ändern. Außerdem verlieren viele Spieler dadurch die Lust am Spielen.\n\nFind ich gut. Leute die sich ingame nicht benehmen können sollen ruhig weg bleiben.","replies":[]},{"poster":"Gorantharon","date":"2015-02-18T11:02:45.912+0000","up_votes":1,"down_votes":0,"body":"Wo ist denn die Option:\n\nKönnte ruhig noch härter vergeben werden?","replies":[]},{"poster":"HansMowlWurf","date":"2015-02-17T08:47:19.583+0000","up_votes":1,"down_votes":0,"body":"Und wieso hat nicht jeder eine Ranglisten / Chatsperre?\nErklaere mir das mal bitte ;)","replies":[]},{"poster":"Veezey","date":"2015-02-17T03:49:39.754+0000","up_votes":3,"down_votes":5,"body":"http://i.memeful.com/media/post/edvJ55d_700wa_0.gif","replies":[]}]}