{"poster":"Wast3land ","date":"2016-11-01T11:01:38.080+0000","title":"@Riot Hacker....?","subforum":"Miscellaneous","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/KG3i7","image":"http://i.imgur.com/UrCmUig.jpg?fb"},"up_votes":1,"down_votes":0,"body":"I was the only person in my house as my family was out, played a couple of normals so MMR isn&#039;t that high, and as expected perfect ping, but there was something not right. After 2 beautiful wins with 39 ping i played another one, but this gam wasn&#039;t just a normal game, something cam up, my ping rose up from 39 to 500 and stayed there for the entire match, restarted my computer twice and my router with it, went to Dodo&#039;s customer support and they said their network was fine...so i thought it was just the connection on my end, i apologised to everyone for the bad game as i had no idea this would happen. Fast forward 5 minutes after the game i went into a custom game just to see if my ping was still bad, shockingly no, it was back at 39 ping, so i continued further and played a game, and go figured it stayed at 39 ping. Something doesn&#039;t add up here, if my internet provider said that there seems to be no connection error occurring, my computer doesn&#039;t seem to have any problems running anything else at what i normally run it at, and my router was just as it is, and to add in the fact that i was home alone how is it possible that 1 game out of 5 happened to be not like the rest although it was under the same circumstances. The worst part is that the enemy were also quit fishy, they hadn&#039;t talked the whole game and the Yasuo seemed a bit weird about my whole ping thing., maybe it&#039;s just me and something went wrong but there is just no way that out of nowhere 500 ping for 1 entire game and the next game i play right after is perfectly normal...If a Riot could look into the fills of the game i would appreciate it. Ask me for anything and i&#039;ll try to send it over.","replies":[{"poster":"Yasei Doubutsu","date":"2016-11-01T11:10:16.194+0000","up_votes":2,"down_votes":0,"body":"you gotta send them a support ticket.\n\nGo into your riot games folder-\nLogs folder-\n\nI believe- Game - R3d Logs.\nFind the txt doc that contains the date, on which you played that game.\nUpload that txt in the support ticket, along with the above image.\n\nAnd help explain a bit more in the ticket.\n(Not the direct link but close enough)\nhttps://support.riotgames.com/hc/en-us/requests/new","replies":[]},{"poster":"BarryButcher","date":"2016-11-01T12:05:03.907+0000","up_votes":1,"down_votes":0,"body":"I'm also with Dodo and had a huge lag spike during 1 game today (at about 5pm). So might be poor connection or temporary thing.\n\nMy ping went from my normal 25 to 260 for about 30mins.","replies":[{"poster":"Wast3land ","date":"2016-11-01T22:55:54.704+0000","up_votes":1,"down_votes":0,"body":"THAT SAME THING HAPPENED TO ME AT THE SAME TIME....Ping rose from 39 to 400+ for the whole game","replies":[{"poster":"Cakemeisting","date":"2016-11-02T01:02:27.887+0000","up_votes":1,"down_votes":0,"body":"Yeah it was Dodo at that time yesterday.... one of our team disconnected and came back after 10 minutes, citing Dodo.","replies":[]}]}]},{"poster":"The Wanak King","date":"2016-11-02T00:16:38.581+0000","up_votes":1,"down_votes":0,"body":"If youre suggesting that you were being DDOS'd or anything like that its highly unlikely, Sometimes Ping spiked happen im with optus in a ranked game and sometimes get 1000- 500 Ping randomly for mins its happens cant do much dont sweat too much :)","replies":[]},{"poster":"Roguestoney","date":"2016-11-01T23:07:14.601+0000","up_votes":1,"down_votes":0,"body":"Most likely a Dodo issue.","replies":[]},{"poster":"LevvyLeviticus","date":"2016-11-01T21:04:34.423+0000","up_votes":1,"down_votes":0,"body":"You're with dodo, that's why \n(just kidding, just a joke), but seriously, maybe not hacking, but maybe your area was using internet a lot.","replies":[]}]}