{"poster":"Ope Scuse Meh","date":"2016-08-23T22:13:37.476+0000","title":"Game crashing after character selection is done","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/PqQ03","image":"http://i.imgur.com/4w7Jei8.jpg?fb"},"up_votes":2,"down_votes":0,"body":"After talking to this guy for 8 days and going through troubleshooting he puts the ticket, \"Solved.\" and tells me I need to clean my computer..... What??... I don't have any problems with my computer overheating. I can play graphic heavy games no problem but it's my computer's fault that I bugsplat loading into a game after champion selection? Can someone please help me!?","replies":[{"poster":"Targons Blade","date":"2016-08-23T22:34:53.891+0000","up_votes":1,"down_votes":0,"body":"I took a look at your ticket and the FurMark screenshot you attached shows that your Graphics Card is hitting over 105°c, which is far beyond the safe point for the chipset. Continuing to run your hardware at such temperatures can result in long-term failure, so I strongly recommend you take your PC to a shop or try cleaning out some dust on your own.\n\nLet me know if you have any questions.","replies":[{"poster":"Ope Scuse Meh","date":"2016-08-24T02:07:26.461+0000","up_votes":1,"down_votes":0,"body":"I just noticed I can't even spectate games.","replies":[]},{"poster":"Ope Scuse Meh","date":"2016-08-23T22:40:36.102+0000","up_votes":1,"down_votes":1,"body":"That was during a FurMark which is made to push your computer to the limits. I promise my computer isn't having problems playing this game. Champion selection is not pushing my computer that hard. I don't understand how my computer being this hot has anything to do with a bugsplat. This is a client issue. Not my computer. I can be in a raid on WoW with 30 people on ultra settings and not have one issue at all. But I can't load into a little League of Legends game? This isn't my computer.","replies":[]}]},{"poster":"WizZarD","date":"2016-08-23T22:17:37.248+0000","up_votes":1,"down_votes":0,"body":"Hello.\nTry to have nothing else open but League of Legends and after the game is about to begin do not touch anything and wait. \nThis has solved that problem for me many times.","replies":[{"poster":"Ope Scuse Meh","date":"2016-08-23T22:22:58.168+0000","up_votes":1,"down_votes":0,"body":"I tried this and I still bugsplatted.","replies":[{"poster":"WizZarD","date":"2016-08-23T22:24:17.326+0000","up_votes":1,"down_votes":0,"body":"Does this happen every time to you?\nIf yes try to uninstall and then reinstall the game. \nThat might solve the problem.","replies":[{"poster":"Ope Scuse Meh","date":"2016-08-23T22:28:21.773+0000","up_votes":1,"down_votes":0,"body":"It started last week randomly. I played all night one day and the next day I logged in after work and boom. Fucked. I've ran 2 repairs and uninstalled the game and reinstalled. Still didn't help. Ran a bunch of computer tests and everything. I play other games just fine but I can't play league for some reason even though I've been playing for years! Everything works fine until after everyone has picked their champions and we start to load into screen and then I bugsplat and it takes me to the reconnect screen. If I press reconnect it bugsplats again.","replies":[{"poster":"WizZarD","date":"2016-08-23T22:34:24.306+0000","up_votes":1,"down_votes":0,"body":"Did you install any new program last week by any chance?\nChances are you have installed a program which blocks League for some reason.\nMaybe check your firewall and see if League is blocked. \nIt doesn't have any reason to go wrong if it was okay before, you have installed something on your PC that made League have these problems.","replies":[{"poster":"Ope Scuse Meh","date":"2016-08-23T22:39:34.701+0000","up_votes":1,"down_votes":0,"body":"No. Not that I recall. I went through all my firewalls already.","replies":[]}]}]}]}]}]}]}