{"poster":"MadLunar","date":"2018-03-21T22:09:42.338+0000","title":"Monitor out of range","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo ich habe ein Problem dsa wenn ich ein game starte sobald der lofing screen los geht mein monitor sagt das er out of range ist ist habe alles versucht ich habe das spiel sogar nochmal neu installiert ein kumpel hat sich in mein acc eingeloggr und die aufl&ouml;sung runter gestellt ingame aber alles hat nichts gebracht \r\n\r\nvielleicht wisst ihr ja wie man das fixxen kann \r\nw&uuml;rde mich &uuml;ber antworten Freuen","replies":[{"poster":"recon","date":"2018-03-21T22:48:05.557+0000","up_votes":1,"down_votes":0,"body":"> ein kumpel hat sich in mein acc eingeloggr\n\nDass du damit gegen die Nutzungsbedingungen verstößt und gebannt werden kannst, ist dir hoffentlich klar.\n\n\nZum Problem:\n_Out of range_ sagt ja, dass die benutzte Auflösung nicht unterstützt wird vom Monitor.\nSchau im Windows welche Auflösung du hast (Rechtsklick auf dein Desktop -> Bildschirmauflösung).\nÖffne dann die Datei game.cfg (Ordner: /League of Legends/Config) mit einem Texteditor und änder folgende Werte entsprechend ab:\n\n> Height=1080\n> Width=1920\n\nDas würde in Windows der Einstellung **1920x1080** entsprechen.","replies":[{"poster":"MadLunar","date":"2018-03-22T11:03:15.707+0000","up_votes":1,"down_votes":0,"body":"naja mein kumpel is ja nur in ein custom match gegangen um die auflösung zu ändern nicht um auf meinem acc zu Spielen \n\nUnd das mit dem änern hat nicht funtioniert und es hat ja funktioniert gehabt aber von dem ein auf den anderen tag ging es nicht mehr","replies":[{"poster":"Homunculi","date":"2018-03-22T11:49:51.453+0000","up_votes":1,"down_votes":1,"body":"Warte, dein Kumpel hat auf seinem PC sich mit deinem Account angemeldet um die Auflösung zu ändern?","replies":[]}]}]},{"poster":"Pandeonor","date":"2018-03-21T22:57:59.525+0000","up_votes":1,"down_votes":1,"body":"Na ja. Die Auflösung oder die Bildwiederholfrequenz mit welcher LoL als 3D-Anwendung versucht den Monitor anzusteuern wird von selbigem offenbar nicht unterstützt. Es kann theoretisch auch ein Kabelproblem sein.\n\nWorkaround wäre das einstellen des randlosen Fenstermodus für das Spiel.","replies":[]}]}