{"poster":"NuttyButterX","date":"2016-11-06T14:00:05.069+0000","title":"league of legends RWBY skins","subforum":"Concepts & Creations","up_votes":2,"down_votes":3,"body":"I know this has been discussed before but it would be cool if riot made RWBY skins.  my thoughts on who should get the skins are:\n\n{{champion:92}} (Ruby) i always thought of riven as more of a popular pick and is pretty notarized in the league community as one of the more powerful champs making her the leader of the group. her blade can switch forms as well just like ruby's scythe and i think it fits.\n\n{{champion:114}} (Weiss) its a good fit given since there both fencers and have that similar \"snobbish\" personality. there lore is quite similar as well since they both come from rich families.\n\n{{champion:39}} (Blake) i know Katarina and Ahri might fit the bill more accurately, but i see the group of RWBY as more of a tanky melee bruiser group and those two champs seem a bit awkward to me. Irelia fits because i always thought of her as a bit of a rival towards riven and fiora. also irelia's style of fighting is kind of similar to blakes with those quick movements and fast paced attacks. there lore is also a bit similar because Blake fights for the rights of the fauna while Irelia fights for the rights of Ionians towards noxus.\n\n{{champion:254}} (yang) not much explanation needed they both use there fists to fight and there both tough bad bitches.\n\n i see these 4 as a symbol of female empowerment in league and believe that these champs are the true fit for RWBY skins.","replies":[{"poster":"lightdragoon88","date":"2016-11-08T00:38:02.271+0000","up_votes":3,"down_votes":0,"body":"Oh and Kalista can be Pyrrha..cause you know...{{item:3599}} in the chest.","replies":[]},{"poster":"Weathered","date":"2016-11-06T14:21:31.863+0000","up_votes":2,"down_votes":2,"body":"Copyright","replies":[{"poster":"Zezockary","date":"2016-11-06T14:27:32.335+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SlayerTay6,realm=NA,application-id=A8FQeEA8,discussion-id=OqgU0aFy,comment-id=0000,timestamp=2016-11-06T14:21:31.863+0000)\n>\n> Copyright\n\nShaco and king rammus want to have a word with you.\n\nEDIT: Also the star guardians, among others.","replies":[{"poster":"Weathered","date":"2016-11-06T14:51:12.846+0000","up_votes":2,"down_votes":2,"body":"There is a difference between concept basing and making a Ruby Weiss Blake and Yang skin.","replies":[{"poster":"NuttyButterX","date":"2016-11-06T15:04:51.797+0000","up_votes":2,"down_votes":0,"body":"i don't see the see the difference when the definition of \"concept\" is to form an idea or general notion. i am creating a general idea or notion based on a matter of opinion regarding RWBY skins.","replies":[]}]}]}]},{"poster":"Poop Jelly","date":"2016-11-08T00:31:44.496+0000","up_votes":2,"down_votes":0,"body":"OMG I WOULD LOVE LOVE LOVE A SKIN FROM RWBY. IT'S SO AWESOME AND I'D LIKE RIVEN OR VI TO GET THOSE CONCEPTS!!!!","replies":[]},{"poster":"WolfOfSolace","date":"2019-09-22T01:31:14.895+0000","up_votes":1,"down_votes":0,"body":"I'm certain Rooster Teeth would be up for a promotional event if Riot approached them about it.","replies":[]}]}