{"poster":"CrazyFootCake","date":"2016-05-28T09:24:59.473+0000","title":"Me es imposible salir de platino V","subforum":"Reclutamiento","up_votes":3,"down_votes":0,"body":"La verdad estoy como en un circulo que se repite una  y otra ves , gano  2 o 3 partidas y despues pierdo los puntos que consegui. Es bastante frustrante ya que pase exactamente por lo mismo el a&ntilde;o pasado, a si que vengo al foro buscando gente con ganas de pasarla bien y tratar de ayudarnos mutuamente para salir de esta division. Acepto tambien consejos. \n\nMi nombre in-game es CrazyFootCake, juego mayormente jg ( {{champion:35}} {{champion:121}} {{champion:106}} {{champion:60}}) , pero no tengo problema con jugar otros roles.","replies":[{"poster":"Shappaw","date":"2016-05-28T10:29:49.936+0000","up_votes":1,"down_votes":0,"body":"Te cuento algo medio irrelevante. Yo vengo pasándola medio mal con gente que juego quien da una primera impresión sobre cómo es, y termina siento totalmente otra. No lo digo por nada en especial. Tenía con quien rankear... pero fueron amistades (o casi) que se perdiernon porque tuvieron actitudes un tanto pésimas para conmigo.\n\n\nSi querés jugamos algunas partidas y jugamos DuoQ. No me cabe mucho jugar de a 4 o 5 porque es complicado tener sinergía entre tanta gente (seguir los mismos objetivos, rotar, etc). No tengo con quién rankear actualmente, mejor dicho, nadie con quien quiera jugar a ganar, en lugar de jugar a empeorar el clima de juego.\n\nAhora estoy laburando, pero tipo 11:30am estaría en mi casa y te agrego. Si no conseguiste a nadie para esa hora... conozcámonos.","replies":[{"poster":"CrazyFootCake","date":"2016-05-28T12:04:45.912+0000","up_votes":2,"down_votes":0,"body":"Por mi  estaria genial que salgan unas partidas. Igual soy de esos hdp que estan toda la noche con el vicio jajaj a si que voy a ir a dormir, agregame y hablame por el lol y vemos como se nos dan las partidas. \n\nGracias por responder{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"GatóMonstruo","date":"2016-05-28T12:18:28.618+0000","up_votes":1,"down_votes":0,"body":">No me cabe mucho jugar de a 4 o 5 porque es complicado tener sinergía entre tanta gente (seguir los mismos objetivos, rotar, etc). \n\nUff... deberías practicar imponerte vos como el que arma la sinergia. No siempre te dan bola, pero, si lográs concretar un equipo completo que pueda seguir tus pasos, sos imparable.  Te lo digo por experiencia propia, es hermoso ver cuando todo tu team rota por una cosa que se te ocurrió y termina destrozando a alguien mal posicionado. \n_Por eso no juego rankeds en soloq, ver gente que no conozco haciendo rotaciones incorrectas, jugando sin pensar o cosas por el estilo me genera mucha impotencia_","replies":[{"poster":"Shappaw","date":"2016-05-28T12:30:23.911+0000","up_votes":1,"down_votes":0,"body":"Si, justamente, a veces trato de hacer el timón, y pasa tal cual vos decís, es complicado que algunos sigan los pasos de uno, porque uno sepa más y juegue mejor, sino porque se da naturalmente en el transcurso de la partida o simplemente no están de acuerdo con algunas decisiones (naturalmente, somos seres humanos). También soy de los que a veces se frustran mucho y hay que pausar un poco el juego y despejarme la mente con otro.\n\nGracias por el apoyo, MonstrousCat.","replies":[]}]}]},{"poster":"Smiling Monster","date":"2016-05-28T10:32:12.747+0000","up_votes":2,"down_votes":0,"body":"Hola,\nHe leído que no desprecias la ayuda de nadie. Mi opinión al respecto puede sonar medio cliché, pero te recomiendo salir de las mismas selecciones y posisiones. En un ejemplo muy particular: A veces uno cree que juega bien por el kda, le pasaba a un mid que iba siempre bien, pero nunca ganaba el juego y culpaba a otros, yo vine con la misma solución \"qué cambies de linea a otra cosa distinta y que al final del juego sí ganaron, te pienses qué te falto hacer a vos como midlanner que sí viste que ese midlanner haya hecho\" \nEn tu liga estoy seguro que ya te has cruzado con quien tiene buen kda, pero que nunca gana. Y que has de saber y practicar ir por objetivos en vez de buen kda. \nY otro consejo que sí eres de flammear (espero que no) o de tomarte las cosas muy apecho, siempre evites responder o reaccionar a ese baiteo, al final necesitarás que los 5 ganen el juego, todos saben que no es un juego de uno.\nSaludos y exito en tus partidas.","replies":[{"poster":"CrazyFootCake","date":"2016-05-28T11:57:19.947+0000","up_votes":1,"down_votes":0,"body":"Pienso exactamente igual en ese sentido, como dije normalmente voy jg pero siempre estoy dispuesto a jugar cualquier linea, me manejo bastante bien mientras use el campeon que me acomode. El kda en verdad no me importa, me interesa ganar las partidas y tirar el nexo abajo a como de lugar. No suelo flameear , soy bastante paciente con la gente, lo que si me molesta y que no puedo evitar callar es cuando se pelean entre si los de mi equipo, siempre que pasan estas cosas termino diciendo que por favor se muteen y que se concentren en como juegan ellos mismos y no los demas, me molesta la gente que es poco autocritica. Obviamente  digo eso y  prosigo a continuar la partida.\n\nMuchas gracias por tu respuesta. {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Reboleira","date":"2016-05-30T16:08:24.804+0000","up_votes":1,"down_votes":0,"body":"Agregame y jugamos, buen hombre.","replies":[]},{"poster":"JayInc","date":"2016-05-29T15:05:14.801+0000","up_votes":1,"down_votes":0,"body":"Mirando tu historial veo que tienes mucha culpa que atribuirte a ti mismo. Cuando no te toca jungla prácticamente pierdes la partida solo. Por ejemplo en tu historial reciente tienes:\n\n* Cait ADC: 22k de daño contra 40k del adc enemigo.\n* Irelia TOP: 10k de daño contra 27k del top enemigo.\n* Yasuo MID: 30.6k de daño contra 57.1k del mid enemigo.\n* Yasuo MID: 9.5k de daño contra 13k del mid enemigo.\n\nTe recomiendo buscarte un segundo rol que te acomode y en el que puedas jugar al nivel en el que estás. Dedicate a 1 segundo rol y 1-2 champs. Se nota que en la jungla te manejas (aunque en mi opinión juegas muchos champs y a veces tu rendimiento igual es pobre), pero tienes demasiadas partidas que las regalas tu mismo. El champion que más juegas en ranked no tiene ni 30 partidas, trata de reducir tu pool de champs.","replies":[]},{"poster":"carlitropajarito","date":"2016-05-28T22:22:22.246+0000","up_votes":1,"down_votes":0,"body":"juegas 4 junglas de early, revisa si estas aprovechando el early como deberías hacerlo, y si sacas ventaja, esa diferencia la estas traduciendo al team? otro punto,   las partidas en solo q predomina más el ganar por la kil o tf ( mas que sonwball de torre: de una, a la otra y a la otra y así), pero para eso necesitas comunicarte con los demás y en solo q te va a costar.\n\n con esos champ si se  alarga, pierdes, si tu team no juega a objetivos y stompear, vas  a perder más partidas de las que ganas.","replies":[]},{"poster":"Airways","date":"2016-05-28T13:48:24.208+0000","up_votes":1,"down_votes":0,"body":"El error en un principio es jugar para subir. Si jugas solamente a mejorar vos como jugador vas a ganar más partidas y por ende vas a subir. Yo te recomendaría mirar  partidas de elos altos, en los match ups que sientas que son complicados para vos. También te recomendaría que no realices la misma acción siempre en las partidas, ya que eso hace que tu toma de decisiones sea por costumbre y no lo que te conviene hacer en ese momento.","replies":[]},{"poster":"LeonardoSB","date":"2016-05-28T09:40:31.123+0000","up_votes":1,"down_votes":0,"body":"mmh, platino eh? creo que cualquier atasco estes en la liga que estés sucede de la misma manera, quizás simplemente ese es tu nivel actual, la pregunta es: \"como puedes mejorar lo que ya sabes?\" . una vez encuentres la respuesta creo con total firmeza que te será facil subir de platino 5...\n\no bien estás desmotivado, sin una meta que seguir, que en tal caso querrá decir que platino te conforma, eso ya varia en la persona.\n\nno te diré \"mira guias\" o \"aprende mejor mecanicas\" porque no siempre se requiere eso, sino tambien tener un enfoque mas global, ayudar mas a tu team, influir mas en la partida o inclusive aprender a carrearlos...\n\npero bueno, que sabré yo que soy un simple silver 5.","replies":[{"poster":"CrazyFootCake","date":"2016-05-28T09:54:25.723+0000","up_votes":1,"down_votes":0,"body":"Se te agradece la respuesta. Nunca pienses que por ser de una liga mas baja tu opiñon vale menos, la verdad tu opiñon me ayuda bastante, porque con lo que acabas de decirme me diste a plantearme algunas cosas, el tema es que aveces es muy complicado estar en todos lados durante las partidas, y es como que necesito un premade de confianza alguien que sepa que si le doy una mano, el me la va a dar a mi para ayudar a los demas del team. Gracias por comentar{{sticker:slayer-jinx-catface}}","replies":[]}]}]}