{"poster":"Korijenkins","date":"2017-02-24T07:31:53.264+0000","title":"Should perma banned players be allowed to post on the boards?","subforum":"Player Behavior","up_votes":3,"down_votes":3,"body":"Just a question of mine. It seems like the player behavior boards are mostly filled with toxic players whining about their bans rather than any substantive discussion.","replies":[{"poster":"AeroWaffle","date":"2017-02-24T07:37:33.525+0000","up_votes":6,"down_votes":0,"body":"Yes.\n\nNot all perma-bans are for behavioral reason, and getting community input can be helpful to fixing the problem. And besides that, some people are genuinely confused why they receive a ban. If they think the ban was a un-fixable mistake, they may create another account and just do the same thing.\n\nWhile it's true that many perma-banned players refuse to accept that their behavior was out of line, at the very least they can be informed that it was their behavior that the system banned them for, and that other humans also believe the behavior to be unacceptable.","replies":[{"poster":"Geauxx","date":"2017-02-24T09:22:15.219+0000","up_votes":1,"down_votes":0,"body":"Basically this, besides... rarely are the boards filled with meaningful post anyways other than how people want to complain about a champion they just lost to.","replies":[]},{"poster":"This Is Your Dad","date":"2017-02-24T08:34:36.169+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AeroWaffle,realm=NA,application-id=ZGEFLEUQ,discussion-id=UGTX0FUn,comment-id=0000,timestamp=2017-02-24T07:37:33.525+0000)\n>\n> Yes.\n> \n> Not all perma-bans are for behavioral reason, and getting community input can be helpful to fixing the problem. And besides that, some people are genuinely confused why they receive a ban. If they think the ban was a un-fixable mistake, they may create another account and just do the same thing.\n> \n> While it&#x27;s true that many perma-banned players refuse to accept that their behavior was out of line, at the very least they can be informed that it was their behavior that the system banned them for, and that other humans also believe the behavior to be unacceptable.\n\nThat and we get to see the system in action.","replies":[]}]},{"poster":"Laughing Fish","date":"2017-02-24T17:39:10.405+0000","up_votes":2,"down_votes":0,"body":"Yes, for one MAJOR reason. While the overwhelming majority of the time they are just coming here to whine, every once and awhile something really was unfair. The recent ban wave for 3rd party programs comes to mind. It is important that such things be allowed to go public, for the good of everyone who plays this game.","replies":[]},{"poster":"MFTORANK1","date":"2017-02-24T15:41:51.247+0000","up_votes":1,"down_votes":0,"body":"They could just create a new account  so I think this question is irelevant","replies":[]},{"poster":"Xantrenger","date":"2017-02-24T14:28:34.248+0000","up_votes":1,"down_votes":0,"body":"Yes this account I'm posting on right now is perma banned.\nI think the players should be allowed to post still because Riot does make mistakes sometimes and do ban people by accident. The banned players need a place to communicate their frustrations","replies":[]},{"poster":"JDusidZB6G","date":"2017-02-24T10:29:29.548+0000","up_votes":1,"down_votes":2,"body":"Hey Korijenskins I have a question for you, who do you hate the most? \nJudging by your comments and posts, you're on a rather mediocre level of comprehension, so did you pick these boards to get some confidence trying to be the enforcer? \nJust stop it. People like you make it harder for ones that are genuinely in trouble, I don't care about what your reasoning is, and neither are you somehow important to the rest of the people so how about you leave the decisions and comments to racionality? If you want to void the system of any transparency i'll just say you're pretty shallow (and have not done your basic sociology reading) ","replies":[{"poster":"Korijenkins","date":"2017-02-24T10:43:30.311+0000","up_votes":1,"down_votes":0,"body":"Seeing as you're going to every post I've commented on and trying to attack me or upset me in some way I would think you've got a petty problem with me. I don't know why but I'm flattered I'm worth your the time it took you to find a bunch of my posts and fail at ridiculing me.","replies":[]}]}]}