{"poster":"clair de lune289","date":"2016-12-11T15:35:15.687+0000","title":"enttäuscht von Season 7","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":5,"body":"Ich spiel LoL wirklich gern war aber noch nie so entt&auml;uscht von einer neuen Season.\r\nNein ich rede hier weder von der neuen Warteschlange noch von den Assassinenrework sondern davon das es IMMERNOCH nur 3 Banns gibt\r\nDie Anzahl der Champs w&auml;chst stetig weiter und es gibt somit immer mehr Champs die man Bannen sollte/m&ouml;chte.","replies":[{"poster":"HHaie tabbian","date":"2016-12-11T17:52:26.962+0000","up_votes":3,"down_votes":1,"body":"Ich persönlich bin gegen eine Erhöhung der Bannanzahl. In der Soloq mag dies noch in Ordnung sein, aber wenn ich mir überlege, was passiert, wenn es 10 Banns bei Turnieren gibt, würde das eindeutig keine Verbesserung sein. Man müsste einen ziemlich großen Championpool haben, um dann überhaupt daran denken zu können bei einer derartigen Veranstaltung mitmachen zu können.","replies":[{"poster":"Mi3zekatze","date":"2016-12-11T18:19:34.430+0000","up_votes":1,"down_votes":3,"body":"Das fände ich aber wiederum cool denn dann sehen wir auf den großen Bühnen von Proplayern nicht immer den 0815 Kram. \nIch sehe in der solo q eher die Probleme weil ich persönlich kb habe NOCH länger in der CS zu verbringen!","replies":[{"poster":"clair de lune289","date":"2016-12-11T21:03:42.753+0000","up_votes":1,"down_votes":2,"body":"naja man können es wie bei der champwahl machen, alos 1/2/2/2/1 dann würde es nicht ganz so viel mehr Zeit in anspruch nehmen.\n\nps: ich hänge lieber 4min länger in der Champselect und hab dann mehr Spaß in den 30-50min danach.","replies":[]}]}]},{"poster":"Kovorix","date":"2016-12-12T15:51:22.262+0000","up_votes":1,"down_votes":0,"body":"Die Season geht noch nichtmal 1 Woche und du bist enttäuscht?","replies":[{"poster":"clair de lune289","date":"2016-12-12T21:49:34.335+0000","up_votes":1,"down_votes":1,"body":"ja ich bin enttäuscht,da eine von mir lange erwartete Funktion (die Erhöhung auf 5 Banns pro Team) nicht dabei war.\n\nWir haben den neuen Clienten (zumindest die open Betatest)und die neuen Warteschlangen, aber die für mich einzig wichtige Veränderung kam nicht. Ich sehe keine Anzeichen davon das diese Änderung noch vor frühstens Midseason wenn überhaupt ins Spiel kommt.\n\nmMn würde  1 Bann pro Spieler das Spiel wesentlich angenehmer machen. Es sollte auch dem Gejammer in der Champselect \"why not bann XY\" entgegen wirken.","replies":[{"poster":"Kovorix","date":"2016-12-13T15:45:46.475+0000","up_votes":1,"down_votes":0,"body":"Und dennoch ist eine Season ca. 1 Jahr lang indem sich alles ändern kann. Vllt wird zur mid Season ein MMORPG, wer weiss.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2016-12-13T13:40:43.255+0000","up_votes":1,"down_votes":0,"body":"Du machst auf mich eben den Anschein als wäre das SO eine riesen Enttäuschung, dass LoL jetzt für dich kacke geworden ist, alleine deswegen, weil du nur aus dem Grund einen Thread im Forum eröffnen musstest. Und zudem finde ich, kann man die Mage-Änderung nicht mit der Erhöhung der Banns vergleichen. Die Mage-Änderung ist meiner Meinung nach eine riesen Veränderung, die Implementierung von mehr Banns nicht.","replies":[]},{"poster":"OT Riku","date":"2016-12-11T16:39:08.167+0000","up_votes":1,"down_votes":0,"body":"Sie hat grade erst begonnen.\nEs gibt 6 Banns, natürlich 3 für jedes Team.\n10 Banns sind jedoch im Gespräch und ich bin überzeugt das sie dies implementieren.","replies":[{"poster":"clair de lune289","date":"2016-12-11T17:15:54.793+0000","up_votes":1,"down_votes":3,"body":"Das 10 Banns im Gespräch sind ist mir bekannt wahrscheinlich auch einer der Gründe warum ich so enttäuscht bin.\nIch glaube halt nicht wirklich das man in einer laufenden Season noch einmal so massive Änderungen wie die Erhöhung der Banns vornimmt. (evt zur Midseason aber das ist noch sehr lange hin gemessen an einer LoLseason)\n\nMir fällt halt immer wieder auf wie viel Stärker die Kits der neuen Champs sind im vergleich zu meinen \"alten\" Lieblingen. D.h jetzt nicht das man sie mit den alten Champs nicht schlagen kann,aber das Potenzial der neueren Champs ist oft größer und in wenigen fällen einfach zu stark.\n\nz.B. merk ich zur Zeit das ein sehr gut gespielter {{champion:427}}  ein sehr großes Problem werden kann wenn dein Team auch nur leicht zurückfällt bzw zu viele lategame champs hat.","replies":[{"poster":"Angel Ayume","date":"2016-12-11T22:12:00.762+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=ip27PlEH,discussion-id=po9WzyiW,comment-id=00000000,timestamp=2016-12-11T17:15:54.793+0000)\n>\n> Das 10 Banns im Gespräch sind ist mir bekannt wahrscheinlich auch einer der Gründe warum ich so enttäuscht bin.\n> Ich glaube halt nicht wirklich das man in einer laufenden Season noch einmal so massive Änderungen wie die Erhöhung der Banns vornimmt. (evt zur Midseason aber das ist noch sehr lange hin gemessen an einer LoLseason)\n> \n> Mir fällt halt immer wieder auf wie viel Stärker die Kits der neuen Champs sind im vergleich zu meinen &quot;alten&quot; Lieblingen. D.h jetzt nicht das man sie mit den alten Champs nicht schlagen kann,aber das Potenzial der neueren Champs ist oft größer und in wenigen fällen einfach zu stark.\n> \n> z.B. merk ich zur Zeit das ein sehr gut gespielter {{champion:427}}  ein sehr großes Problem werden kann wenn dein Team auch nur leicht zurückfällt bzw zu viele lategame champs hat.\n\nAlso die schlichte Erhöhung der Banns empfinde ich jetzt nicht als \"massive\" Änderung. \nZudem war die Mageänderung auch mitten in der Season.\n\nGleich S7 als Enttäuschung zu bezeichnen finde ich doch arg übertrieben, wo sie doch nichtmal nen Monat alt ist. {{sticker:zombie-brand-clap}}","replies":[{"poster":"clair de lune289","date":"2016-12-12T00:12:46.236+0000","up_votes":1,"down_votes":1,"body":"damit das Season 7 grade erst angefangen hat hast du natürlich recht,aber wie ich schon erwähnt habe, gehe ich von keinen \"größeren\" Änderungen in einer laufenden Season aus.\nDie einzige großere Änderung während der letzten Season war ( soweit ich mich erinnern kann,lass mich gern du links von etwas anderem überzeugen) der \"Magerework\" zur Midseason.\n\nVielleicht hätte ich auch besser schreiben sollen \"ich bin vom Seasonstart enttäuscht\", aber an der Aussage ändert das ja nicht viel.","replies":[{"poster":"Angel Ayume","date":"2016-12-12T21:43:45.427+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=ip27PlEH,discussion-id=po9WzyiW,comment-id=0000000000010000,timestamp=2016-12-12T00:12:46.236+0000)\n>\n> damit das Season 7 grade erst angefangen hat hast du natürlich recht,aber wie ich schon erwähnt habe, gehe ich von keinen &quot;größeren&quot; Änderungen in einer laufenden Season aus.\n> Die einzige großere Änderung während der letzten Season war ( soweit ich mich erinnern kann,lass mich gern du links von etwas anderem überzeugen) der &quot;Magerework&quot; zur Midseason.\n> \n> Vielleicht hätte ich auch besser schreiben sollen &quot;ich bin vom Seasonstart enttäuscht&quot;, aber an der Aussage ändert das ja nicht viel.\n\nUnd was genau hast du dir zum Seasonstart erhofft? \nNur weil es noch keine 10 Banns gibt? Da sie im Gespräch sind werden sie noch kommen. LoL ist immer noch spielbar und macht auch immer noch Spaß.","replies":[]}]}]},{"poster":"Mi3zekatze","date":"2016-12-11T18:20:56.730+0000","up_votes":1,"down_votes":2,"body":"Stimmt alte Champions werden aber genau aus dem grund in Massen gereworked! \nZ.B. Talon, Rengar, Warwick, Aatrox, Katarina, Leblanc usw","replies":[]}]}]},{"poster":"Angel Ayume","date":"2016-12-13T02:11:05.393+0000","up_votes":1,"down_votes":1,"body":"Und woran erkennst du, dass diese Änderung nicht früher kommt? Nur weil Riot noch nichts angekündigt hat? Nur weil noch nix auf dem PBE Server ist? \nEs gab so viele Änderungen die Riot offensichtlich wichtiger fand, dass für die 5 Bans keine Zeit mehr da war. \nDu kannst es doch eh nicht ändern, also nimm es so hin. Sei einfach geduldig und warte bis es kommt. \nUnd wenn nicht, dann kehre LoL eben den Rücken zu. Sich darüber aufzuregen ist verschwendete Zeit... \n\nÜbrigens glaube ich nicht, dass ein Bann mehr das Gejammer von \"wieso haste nich den oder den gebannt\" ändern wird. Es gibt immer noch genug Champs die man gebannt haben will. Achja und ich hatte noch nie Leute die das geschrieben haben. O.o","replies":[{"poster":"clair de lune289","date":"2016-12-13T13:02:29.065+0000","up_votes":1,"down_votes":1,"body":"Warum ich glaube das jetzt erstmal keine Erhöhung der Banns kommt? ganz einfach Erfahrung. In jeder Season die ich bis jetzt gespielt habe (sind schon 3 oder 4) gab es **_KEINE_** wirklichen Änderungen in einer laufenden Season mit der Ausnahme zur Midseason (LCS pause etc).\n\nIch habe nirgends gesagt das ich deswegen mit LoL aufhöre,komm mal runter...\nEs ist also jetzt schon nicht mehr erlaubt seinen Unmut über etwas mitzuteilen nur weil man es nicht ändern kann?","replies":[]}]}]}